{
  "slug": "12-strong-2018",
  "title": "12 strong",
  "genre": "action",
  "format": "film",
  "scenes_count": 13,
  "characters_count": 0,
  "characters": [],
  "total_words": 29406,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. SPENCER HOUSEHOLD - FORT CAMPBELL - NIGHT  In uniform, Spencer comes into the room of his son, JAKE (12). Jake has fallen asleep with his baseball mitt. Spencer sits down on the bed. Then he looks up to see - MARCHA SPENCER (37). She’s just come into the doorway. MARCHA Do you know where they’re sending you? SPENCER Even if I did, I can’t tell you. (eyes on his son) 0500. I’ll let him sleep ‘til then. Marcha has a way of thinking out loud, which she does while Spencer watches their son sleep. MARCHA I hate the idea of y’all being in the hands of a brand new Captain. SPENCER Diller and I will take care of him. MARCHA His wife must be beside herself. She probably doesn’t know a soul here. I’ll have her over. He just looks at her, a long history in their eyes. MARCHA (CONT’D) You’ve been gone half his life, Cal. For God’s sake, wake him up.  INT. DILLER HOUSEHOLD - KITCHEN - BEFORE DAWN  TRACKING THROUGH DARK ROOMS WITH DILLER, we pass a digital clock that reads: “3:40 AM.” He moves into a bright kitchen, where he’s surprised to see his wife on the floor by the open oven door...   cleaning.  DILLER Lis’? She looks up. It’s not hysteria: she’s just finished cleaning the broiler pan. The kitchen is   spotless . DILLER (CONT’D) Aw, baby. If you got all the way to the oven, you’re breakin’ my heart. LISA Some women cry, some clean. She rises and meets his eyes.  12.",
      "characters": [],
      "action_text": "LISA (CONT’D) So this house is gonna be   spotless.  Until you get home and throw your socks all over the floor. She hugs him, still clutching the dirty rag.  EXT. BUS - FORT CAMPBELL - 4:35 AM  MILO’s teenage son is   crying , despite every effort not to. Milo pops him lightly in the shoulder. MILO Come on now, big guy. I need you. You got to take care of your mom. His son nods, mouth quivering. Milo hugs him roughly. MILO (CONT’D) I’m going to go do my job, you do yours. It’s that simple, bud. MOVING OFF MILO, we follow STAFF SERGEANT CHARLES JONES   (20s) as he listens to BLARING HEADPHONES, nonchalant as he throws his pack under the bus, a headbanger turned soldier. As he comes up from the storage compartment, COFFERS grabs him. COFFERS Jones. Check out the   medic . Jones doesn’t hear anything with the blaring music in his ears, so Coffers takes off his headphones to talk in his ear. COFFERS (CONT’D) Look how good our medic is. FOLLOW JONES’ GAZE to -- SFC SCOTT BLACK (28), the medic, a short man with bottle-thick glasses, saying goodbye to TWO FOUR-EYED SONS who look   exactly   like him. COFFERS (CONT’D) He can   clone   himself. Beside them, SFC TIAGO RAMIREZ (27) -- junior engineer, says goodbye to his kids in English, then his parents in Spanish. RAMIREZ  Voy a tener cuidado. No te preocúpes.  Ramirez is distracted by VERN MICHAELS (29), passing with a golf club hanging out of his pack, a cover on the head. RAMIREZ (CONT’D) Michaels? You dumb-ass, you brought your   driver   to the desert? MICHAELS Why the hell would I do that, Ramirez? (takes off the cover) Sand wedge.  13. Passing is FRED FALLS (25), an awkward man who’s all Adam’s apple, carrying his gear beside a   very   attractive older woman in tight jeans and heels. COFFERS and JONES ogle the woman as Falls hugs her, then trundles his gear toward them. COFFERS Falls! Got yourself a   cougar . What’d you do? Cruise the   Red Lion ? FALLS That’s my mom ,   asshole! As Falls throws in his pack and hea",
      "dialogue_count": 0,
      "word_count": 3198
    },
    {
      "scene_number": 2,
      "slugline": "EXT. BARRACKS TENT - K2 - J.O.C. - MOMENTS LATER  Laughing and loose, the rest of Team ODA 595 is watching “SPIES LIKE US” dubbed into Uzbek. Spencer is guffawing heavily at Chevy Chase, while Milo, Coffers and Falls marvel at the guttural voice coming out of a familiar actor. Nelson comes into the entrance and lingers. One by one, they look up at him, noticing his posture. Spencer’s still laughing, last to avert his attention. NELSON Saddle up. We got the job. Most of the men look astonished by the news. ON SCREEN - Chevy Chase and Dan Aykroyd are loaded into a rocket and dropped off a tower, nose-first into the ground. No one’s laughing. JONES takes off his blaring headphones. Finally, Diller reveals a grin, ear to ear. He leaps up, congratulating his Captain with a rough pat on the back. DILLER Atta boy, Mitch! Beautiful! As Diller jostles Nelson, Spencer and Essex come over to thank the Captain. PAN TO COFFERS, FALLS, JONES and BLACK, with warier looks. FALLS With a Captain straight out of the Q? What’s the catch? COFFERS Remember the Apollo program? Both men look over at him, confused. COFFERS (CONT’D) They sent a monkey up first.  EXT. K2 BASE - UZBEKISTAN - SUNSET  The sun sets over the tall cordillera of mountains to the south. In a brewing sandstorm, it’s colored a deep red. NELSON (PRE-LAP) “Northern Alliance” is a misnomer.  INT. QUONSET HUT - K2 - EVENING  Nelson stands by a screen where he projects slides off transparencies.   Only   his team fills up the wide space now - and the room feels desolate. The wind whistles outside. NELSON It’s a few tribes - and most have been fighting each other all their lives. They were held together by Massoud.  24.",
      "characters": [],
      "action_text": "So... Bin Laden and Al Qaeda kill him as payment for Taliban support of 9-11. It’s left the whole alliance hanging by a thread. If they fall apart, this whole country becomes a terrorist training camp. SPENCER Who’s our lucky warlord, Mitch? NELSON General Abdul Rashid Dostum. Nelson clicks ahead a few slides to an old picture of Dostum from the Soviet years: a sturdy man with wily eyes in a squint, a devilish smile, like he’s outsmarting the world. NELSON (CONT’D) Don’t get used to this picture. It’s 22 years old. That’s him with the Soviets. CIA says he might be sick now. Diabetic. They think he’s lost use of one of his arms. The team isn’t liking this news. NELSON (CONT’D) He doesn’t speak English, but his Russian is good. From back when he ran militias for the Soviets. He made his money smuggling opium those years. COFFERS So he’s a criminal? DILLER  Our   criminal. NELSON He was forced into exile in ‘98. Taliban stole his land, money, slaughtered his people. He wants revenge. DILLER What kind of troop strength does he have? NELSON Yeah, he’s got... (reading) “...a few hundred paid soldiers and an undetermined number of part-time militiamen.” The whole team exchanges glances:   This is a death march.  JONES And the other side? NELSON (CONT'D)  25. NELSON Mullah Razzak. A slide: MULLAH RAZZAK, Taliban leader in the north. Dressed in black, his eyes are encircled by kohl and exude hatred. NELSON (CONT’D) 50,000 Taliban and Al-Qaeda fighters. The entire group seems struck in the chest. NELSON (CONT’D) Armor, rockets, mortars, and machine guns. Yeah, we’re outnumbered. COFFERS 5,000 to 1. DILLER That’s called a target-rich environment. NELSON Dostum’s been holding off Razzak with whatever he has. But he’s out of ammo and money. We’re going to advise and assist. As soon as this weather clears, we’re going to helicopter in. Dostum’s going to meet us at our landing point and take us to his headquarters. From there, we’ll mount our assault. A brutal pause. This plan sou",
      "dialogue_count": 0,
      "word_count": 1532
    },
    {
      "scene_number": 3,
      "slugline": "INT. CHINOOK HELICOPTER - TWO HOURS LATER  PAN ACROSS the men,   gray   with airsickness and delirium. Falls is shivering. Milo whispers   Hail Marys . END ON NELSON, strapped across from Spencer. The storm howls. SPENCER Set your pack next to you so you don’t hurt your neck when you drop. NELSON I’m not even dizzy. SPENCER Big talk for a Kansas boy. That’s low country. NELSON When everybody comes to, I’ll be right here - watching over them. SPENCER You don’t need to prove so much. You got a veteran team. They don’t need to be tucked in for bedtime. Nelson notices Spencer’s smirk, and he’s getting angry. NELSON Maybe I’ll tuck you in, Cal. Spencer is now irritated also. SPENCER Must be the altitude talking, son. I’ll bet you a week’s worth of MREs that I watch you take a   nap.  NELSON I’m not closing my eyes. SPENCER Sounds like we got ourselves a bet. I’m warning you, Kansas. I been around a long time. Never lost a   drinking  contest in my   life.  INT. COCKPIT - CHINOOK HELICOPTER - ANOTHER HOUR LATER  With zero visibility, the chopper moves at full-speed, engines roaring, rotors slicing the air.  INT. CHINOOK HELICOPTER - BAY - CONTINUOUS  PAN ACROSS each man, green with airsickness, chattering with cold. FALLS is woozy. JONES slaps himself. MICHAELS motions to throw up into his sleeping bag case. But everyone is aware of the duel... At the end of the line, SPENCER and NELSON face each other across the aisle, eyes determined.  30.",
      "characters": [],
      "action_text": "SPENCER Queasy yet? Don’t worry. Take a nap. As the Chinook tips downward, BLACK’S limp body droops. Nelson shakes his head back and forth rapidly. SPENCER (CONT’D) No? Then you better pass the time. Tell me how you got off that Kansas farm and wound up here in a storm? MILO and BENNETT sag in the web seats, unconscious. Half the team has passed out. Diller, bleary-eyed, tries to stay alert to watch the standoff between Spencer and Nelson. SPENCER (CONT’D) Too sick to talk? ESSEX and COFFERS nod off, eyes rolling back.  NELSON Joined the army because of my Dad. SPENCER Ex-mil? NELSON Far from it. Cattle rancher. This is about the last place he’d ever see me. Diller hears Nelson’s words with narrowed eyes; then his head droops against Spencer. Spencer’s eyes are on Nelson. NELSON (CONT’D) He passed when I was nineteen. Heart attack. I figured I’d blaze my own trail. SPENCER You don’t think he’d approve? PUSH IN on NELSON as he remembers, keeping himself alert. NELSON It wasn’t   his   plan, so probably not. He was tough. It was his way or the highway. He used to say he’d rather we were scared of him than anybody else. Like he could bully us into being brave. But that’s not how you teach courage. That’s how you teach fear. My brothers and I, we grew up scared of making any mistake at all .   So I enlisted at nineteen, SFAS at 23. Figured it was the best way to do something good, instead of just trying  not   to do something wrong. (a beat) Cal?   Cal?  31. REVERSE ON SPENCER,   passed out   against his gear. As they pass over a ridge, the cabin slopes in the other direction and loose items tumble past. As Nelson realizes that he’s the last man standing, he allows himself a private smile.  EXT. HIGH DESERT PLATEAU - AFGHANISTAN - 3:10 AM  The helicopter touches down in zero visibility. The men deploy in formation. They form a defensive perimeter with Nelson at the apex while the helicopter lifts off, vanishing behind the grit swirling underneath it. Finally, the din of",
      "dialogue_count": 0,
      "word_count": 5760
    },
    {
      "scene_number": 4,
      "slugline": "INT. CAVE - COBAKI HEADQUARTERS - NIGHT  Nelson and Diller sit on opposite sides of a campfire, while Coffers and Bennett stand guard. Nelson’s eyes are on the other dark cave opening across camp. NELSON First he splits the group, then I gotta send Michaels downrange every time I check in. Spencer’s back there outnumbered twenty to one. Nelson pokes the fire. DILLER Makes you miss your old job, I bet. NELSON No. What’d you used to do? DILLER If I can remember back that far... I was a schoolteacher. In West Virginia. Fifth grade. NELSON No shit. DILLER American History. Loved it, man. Frickin’ loved it. Bull Run to Pearl Harbor. All the big hits. NELSON How’d you wind up in Mogadishu with Spencer? DILLER My temper. And a girl. I was with her at a bar. Some sonofabitch put his hands on her and he almost died in the hospital. I was this close to Man One. ‘Stead I got aggravated assault. Judge gave me a choice between jail or the army. Twelve years later, here I am where I really belong. In a   cave.  Nelson laughs. But he suddenly goes silent when he sees movement far across the campfire. NELSON Maybe you’ll wind up in somebody’s history book. A SHADOW approaches the edge of the cave. DILLER Let’s hope it’s ours   and not   his.  It’s DOSTUM, emerging out of the darkness, flanked by riflemen. Coffers and Bennett let him pass.  52.",
      "characters": [],
      "action_text": "DOSTUM Captain. We have a problem. Come with me. NELSON Come with you where? DOSTUM Come. Dostum turns and moves away back into the darkness. Nelson stares at Diller in the firelight. Diller shrugs with an expression that says: “Go for it.” Then - as Nelson rises to leave - Diller quietly readies his weapon.  EXT. COBAKI HEADQUARTERS - MOUNTAIN PATH - MOMENTS LATER  Catching up to Dostum, Nelson hikes a trail that winds above the camp. Rounding a bend, hidden from the others, he comes to Dostum, blocking his path. DOSTUM Sit. Please. NELSON Sir, whatever you need to tell me you can say it in front of my men. DOSTUM Sit. Nelson sits down. The sky is a spray of stars above them. DOSTUM (CONT’D) You are my guests. Under code of  shari’a , we’re sworn to defend you. (a beat) But your men stand guard. Nelson studies Dostum’s face in faint light: he’s insulted. NELSON Oh, okay. I get it. But... (a loud exhale) We have a cultural difference here, sir. This is how we’re trained; this is our code. DOSTUM We are hospitable people. Anything you want from my home, my camp... take it. It’s yours. Nelson can’t tell if this is sincere or a ploy. NELSON I respect that, sir. I do. But we have a mission plan, and I have to follow orders from above.  53. Dostum grabs Nelson by the shoulder, faux-fatherly for a moment - then more like he’s showing off his strength. DOSTUM “From above,” you say. This is where you will see that we have the biggest difference. It seems there are many men above   you . While for me... (glancing upward) There is only God.  EXT. HIGH PLATEAU - OVERLOOK - DAWN  On an 8,000 foot ridge filled with Dostum’s troops, Nelson waits as the attendants arrange a carpet and pillows. There’s absurdity to their fastidiousness in heavy winds. They motion that it’s ready and Dostum sits onto his pillow. Nelson joins him. Looking like they’re on a magic carpet, they peer at hills gouged by decades of fighting. Behind them, portable SOLAR CELLS power the radios. Dostum points",
      "dialogue_count": 0,
      "word_count": 1814
    },
    {
      "scene_number": 5,
      "slugline": "EXT. OVERLOOK - ON MICHAELS - CONTINUOUS  Michaels remains by the satellite radio, green with nerves. The campsite is in a frenzy, as Dostum, Lal and Khaled take off with fifty riders toward Nelson. MICHAELS (INTO RADIO) They’re heading your way. NELSON (ON RADIO) 36 degrees, 11 minutes, zero-zero point 39 seconds   nor---  There’s a whistle of a bullet on the radio. MICHAELS (INTO RADIO) Mitch?  EXT. RIDGE NEAR BESCHAM - CONTINUOUS  Perched on the ridge, Nelson is now taking fire from the Command Post below.   Pop! Pop! Pop!   The shale cracks above him. His horse rears back, then takes off running. MICHAELS (ON RADIO) Mitch, you there? THROUGH NELSON’S BINOS: He sees the MASSIVE ARTILLERY GUNS slowly rotating toward him, lowering barrels.  ZZZIP - a rocket zippers the air, shattering a cliff face.   As Nelson scrambles for cover, he watches the horse gallop off toward an approaching party: Dostum and his men. The bullets scream at him. Nelson finds a secure position, then looks down at the coordinates on his pad. He’s sweating so heavily that droplets fall onto the numbers... NELSON (INTO RADIO) 36 degrees, 11 minutes, zero-zero point 39 seconds north. 66, 38, zero-two point 2 2   east.   Make the correction. Altitude is 3- 7 -9-1. As his sweat droplets spread through the paper, blurring numbers, he’s taking fire from two directions. Just then, there’s a rifle shot behind him.  Dostum’s men   fire as they dismount, taking positions. LAL grabs Nelson and attempts to drag him to safety; but Nelson pulls away and returns to his radio. NELSON (INTO RADIO) (CONT’D) Michaels? You copy? MICHAELS (ON RADIO) In the air, boss. Ten seconds. Better get out of there. If the elevation’s off, they’re falling on your head.  59.",
      "characters": [],
      "action_text": "BELOW IN THE VALLEY  The Taliban’s Zuess finishing pivoting into position. Most of Dostum’s men fire back non-stop; but a few pause, terrified, as the barrel angles toward them, about the blow them to smithereens. Just then --  BOOOOM!   There’s a DIRECT HIT on the ZUESS, sending it up into a splash of earth. A gritty wind gusts over them on the hillside; and it takes a moment for Dostum to see...  The hit obliterated the artillery and the barracks.   Chunks of ripped steel still fall out of the sky. Dostum looks between the bomb site and Nelson. As the smoke clears,   hundreds   of black-robed Taliban are rushing out of the partially collapsed COMMAND POST. Dostum grins and shouts: DOSTUM  Mostaqim!  Thirty Afghans take off on their horses,   charging   down the rugged hillside in a surprise ambush. They hold the reins in their teeth and   fire   non-stop at the bewildered enemy. They cut the Taliban battalion in half, sending some men fleeing northward in pickups while gunning down others. As the battle rages, Dostum crosses the hillside to Nelson. DOSTUM (CONT’D) You will not live long here by ignoring what I tell you. NELSON You told me to bomb, sir. That’s what I did. Nelson begins treading back uphill, bruised and tired.  INT. CAVE - DOSTUM’S MOUNTAIN HQ - DUSK  In a basin of water, Nelson rinses out scuffs and cuts on his hands and arms. Outside a bonfire burns against the dim sky. BENNETT and RAMIREZ sit at the mouth of the cave, while COFFERS eats an MRE. Behind Nelson, Diller is reading Sun Tzu’s THE ART OF WAR. He looks up from the book and gestures to the mouth of the cave, where Dostum’s RIFLEMEN pace back and forth --   on guard.  DILLER I feel safer already. One guard is FAKIR, walking his sentry route barefoot.  60. COFFERS What do you expect? Six-hundred Gs worth of   white boy   in this cave. RAMIREZ Speak for yourself, puto. COFFERS Yeah, I guess a Mexican would be worth a little   less. RAMIREZ Oh, you’re going down for that. NELSON They’re respo",
      "dialogue_count": 0,
      "word_count": 1096
    },
    {
      "scene_number": 6,
      "slugline": "INT. ALAMO - MORNING  In the courtyard, Milo, Essex and Falls have returned with reclaimed blankets. As they distribute them, the AFGHAN SOLDIERS give them to   their horses , draping them over them. Najeeb still trails Milo, a grin on his face. Milo salutes him facetiously. Najeeb earnestly returns the gesture. Milo sidles up to Spencer, taking stock of supplies. MILO Spence, man, see that dude? Spencer follows his gaze and see Milo’s young shadow, NAJEEB, now squatting with his ancient ENFIELD rifle. MILO (CONT’D) I can’t even take a leak without him up in my business. SPENCER So what? Essex and Falls join the close conversation. MILO So it’s... a violation. I mean, what if he’s... you know. ESSEX You know   what?  MILO Don’t ask, don’t tell. Falls and Essex struggle to keep straight faces. ESSEX Yeah, that must be it. He’s into fat guys from Chicago. Falls and Essex burst into laughter, puzzling the Afghans. But Spencer keeps a straight face. SPENCER  Milo.   Don’t you get it? Milo just stares back, irritated by the ridicule. SPENCER (CONT’D) They’re supposed to guard us. If any of us get killed - Dostum will   execute   the guy who let it happen. Plus his entire family. ESSEX These guys don’t mess around. Milo looks back at Najeeb, suddenly moved by his predicament.  63.",
      "characters": [],
      "action_text": "SPENCER That poor kid got   you . The biggest, dumbest target out here.  EXT. MOUNTAIN TOP - NEAR DOSTUM’S MOUNTAIN HQ - MORNING  In heavy wind, Nelson kneels by the radio, where Michaels has just rigged a connection in a spot with reception. SPENCER (ON RADIO) (with static) Reclaimed most of the blankets and about a week’s worth of MREs. But... bad news... we can’t find anybody’s letters from home. And we lost some morphine. Not good. NELSON (INTO RADIO) I’m out of range from K2 here, Cal - I need you to update them. We’re going to need to rig the drops. A long pause, full of static. NELSON (INTO RADIO) (CONT’D) Copy that, Cal? SPENCER (ON RADIO) That’ll float with Dostum? NELSON (INTO RADIO) It has to. We can’t be dependent on him for food and water. Nelson looks out at the emptiness, strain on his face.  INT. DOSTUM’S CAVE - NOON  NELSON faces DOSTUM across a campfire, warming a pot of tea. The smoke is so thick any normal person would choke. Empty VODKA BOTTLES lay scattered. DOSTUM  Ali babas.   They shamed us. They’ll pay for it. NELSON There’s no need to do that, sir. DOSTUM My people are loyal because I don’t tolerate   betrayal. NELSON It’s not betrayal. DOSTUM Bandits like this - it’s why so many welcomed the Taliban. When the Russians left, they stole, raped, killed. The Taliban enacted   shari’a   law.  64. Flogging for rape. For theft... (pantomiming an axe) ...the hand. NELSON Don’t cut off any hands. DOSTUM My men will guard your things now. NELSON You don’t need to guard the drops. What I’m trying to explain... from now on, they’re going to guard   themselves . They’re going to be booby-trapped. Explosive packs. Anybody that doesn’t know how to disarm them will be blown apart. Dostum stares across the fire with murderous eyes. NELSON (CONT’D) It’s a harsh measure, I know. But any further loss of supplies will put our mission in jeopardy. Dostum tosses an empty vodka bottle into the fire. NELSON (CONT’D) I need you to get word out, so we can avoid civ",
      "dialogue_count": 0,
      "word_count": 2008
    },
    {
      "scene_number": 7,
      "slugline": "EXT. TALIBAN LINES - OUTSIDE BESCHAM - CONTINUOUS  A UNIT OF TALIBAN GUNMEN loses heart and climbs out from trenches, hands raised. MULLAH RAZZAK grows livid. He draws his pistol and -   Boom! Boom! Boom! -   kills his own men as they attempt to surrender.  EXT. MOUNTAINSIDE - ABOVE BESCHAM - CONTINUOUS  THROUGH NELSON’S BINOS: He witnesses this atrocity. NELSON Razzak’s shooting his own men. He’s sickened. But his attention is diverted to - AN ENTIRE NEW DIVISION OF TALIBAN TANKS and BMPs. They roll out of the shade of a canyon beyond the village. NELSON (CONT’D) Where the hell’d   those   come from? Nelson looks over at Dostum, stunned. NELSON (CONT’D) Sir? They have reinforcements! Dostum faces the battlefield as it changes shape. Nelson pivots back to Michaels, ashen. Then Nelson begins down the ridge.  EXT. TALIBAN LINES - OUTSIDE BESCHAM - CONTINUOUS  CLOSE ON THE TALIBAN TANKS. Turrets rotate toward the approaching cavalry charge.  ON THE LAL’S HORSEMEN   -- They leap trenches as -   Boom! -  blast rips through them.  FAKIR   -- pivots his horse to retreat. But a bullet pierces his back, spraying blood through an exit wound. Nelson rushes downhill toward the battle to where Fakir is retreating toward him. There’s a moment of relief as Nelson sees him, upright in the saddle, trotting ahead. NELSON Jesus, you tough sonofabitch, I thought... But as the horse continues ahead, Nelson sees - - FAKIR is already dead in the saddle, held upright against a pommel and the reins. He bounces for a few more strides, then falls off onto the rocks, lifeless. Nelson can hardly breathe as he looks down at Fakir’s vacant eyes, staring at the sky. Rockets cut the air overhead.  71.",
      "characters": [],
      "action_text": "PULL BACK TO REVEAL: Hundreds of Dostum’s men lie dead on the ground, mixed with Taliban for miles. Nelson looks uphill to see DOSTUM. Pulling out his radio and headset, Nelson turns to the battle. NELSON (INTO RADIO) (CONT’D) Wolfman, this is Tiger 02. I’ve got a ton of new targets. WOLFMAN (ON RADIO) Negative. I’m   bingo.  Ahead of Nelson, a Taliban tank fires at the riders at close range, blowing them apart in a spray of dust and blood. NELSON (V.O.) You’re kidding me!?   WOLFMAN (V.O.) I’m sorry. I’m   out   of fuel. NELSON (V.O.) They’ve got a whole new division. You gotta drop. I’m   begging   you. WOLFMAN (V.O.) Sir, I’m out.   Bingo.  Nelson throws down the handset. He stands at the bottom of the hill as   Dostum’s forces   retreat back toward him. The BMP’s mounted machine gun sweeps over them as they approach. Men fly off their saddles; horses stumble and drop. The others flee over body parts and abandoned weapons. Nelson covers his face in horror and disbelief. Then he gathers himself. He turns back uphill and ascends toward Dostum, who hasn’t moved from his high ground. There, the General stoically watches the smoking battlefield. NELSON The planes are out of fuel. He’s out of breath and cringing with grief. NELSON (CONT’D) That means we lost our air support.  Sir . That means we’re done. DOSTUM Now you have seen battle. How do you like it? Afghans evacuate hundreds of injured men. Blood stains the rocky walls of the canyon. Green with disgust, Nelson lifts his binos to see: MULLAK RAZZAK, firing his AK into the sky to celebrate the retreat of Dostum’s army.  72. EXT. RAVINE NEAR BESCHAM - AN HOUR LATER  The Afghans use ARMY BLANKETS to carry away their wounded. Diller and Bennett ride past a macabre landscape of slain bodies and severed arms. Diller sees a DECAPITATED HEAD sitting in the dirt. Dostum’s subcommander, KHALED, is gathering heads of the enemy, carrying a few by the hair. He puts them down, then drags another body a few feet. Diller and Ben",
      "dialogue_count": 0,
      "word_count": 867
    },
    {
      "scene_number": 8,
      "slugline": "INT. SURGERY ROOM - THE ALAMO - HOURS LATER  A BLOODY BLANKET is dropped beside other wounded men. On a makeshift operating table, Medic SCOTT BLACK is knee- deep in gore. He’s attempting to stop internal bleeding in a nineteen-year-old soldier.... BLACK These people are tough.   We barely got any   anaesthesia . Should I give him the rest of the morphine? Falls? How many out there? Falls glances out of the room, seeing that the   line   of wounded stretches into the darkness and out of sight. FALLS I think you better conserve it.  INT. CAVE - DOSTUM’S MOUNTAIN HQ - NIGHT - INTERCUTTING  Just outside the mouth of the cave, BENNETT is working his own triage of less-wounded soldiers. Nelson comes out of the triage area and gets onto the radio. NELSON (INTO RADIO) Talk to me, Cal. SPENCER (ON RADIO) I had to call in an airdrop of stretchers and morphine. And I got bad news. NELSON (INTO RADIO) So that wasn’t bad? SPENCER (ON RADIO) I got word from the brass. They’re not happy you missed targets yesterday, and they’re pissed as hell you were turned back at Bescham. Nelson drops his head, the weight of the world on him. SPENCER (ON RADIO) (CONT’D) Bowers is saying he picked the wrong team. You’re already behind schedule. They’re bringing in two Air Force  targeting   specialists. Nelson rolls his head back and groans. NELSON (INTO RADIO) The hardest job here is earning Dostum’s respect. They show up tomorrow, he’s going to know I don’t even have my own people behind me.  74.",
      "characters": [],
      "action_text": "SPENCER (ON RADIO) I can hold them off a few days. I’ll tell them we’re taking fire, it’s not safe to bring down another bird. You get yourself on better footing with the warlord. Nelson stares ahead with the weight of the world on him.  EXT. DOSTUM’S MOUNTAIN HQ - NIGHT  Dostum sits on a carpet beside several radios hooked to portable solar cells and car batteries. Nelson steps out to him, standing above the carpet, pausing. NELSON General. You know this whole area. Am I wrong to assume that you   knew   about the Taliban’s supply line? Dostum doesn’t acknowledge him. NELSON (CONT’D) You neglected to share that detail. No response. NELSON (CONT’D) If they can move reinforcements that quickly, that assault was suicide. You led us in anyway. Dostum puts up his hand, dismissive. Then he gets onto his Motorola, speaking in a wash of friendly, salesmanlike Dari. NELSON (CONT’D) What was that? DOSTUM Anyone who wants to fight the Taliban tomorrow, I said, “Come and join us.” Nelson stares back, blank-faced. NELSON Sir, if you want to kill your own men, there’s nothing I can do. But I’m not going to let you put   my   men in harm’s way until we deal with their supply chain. DOSTUM (INTO RADIO) “Come, fight with the Americans. Be prepared to die.” NELSON Sir? If I’m supposed to fight with a few thousand horsemen against tanks, then you have an   obligation   to tell me everything you know.  75. Nelson is seething, but Dostum grins like it’s absurd. DOSTUM You do not have the stomach for  “everything I know.”  (a beat) You will never win here, my friend. Because you are not honest with yourselves. NELSON Were you   testing   me today? DOSTUM You expect victory without blood. NELSON I expect you to   share   strategic information and stop treating us like children! You let people   die   to prove a point. DOSTUM I smell your fear. It stinks like a whore. Nelson pulls back from him, seething with anger. DOSTUM (CONT’D) You’re angry. Good. There’s just you and me here. Kill me",
      "dialogue_count": 0,
      "word_count": 2039
    },
    {
      "scene_number": 9,
      "slugline": "EXT. “BURRO CAMP” - NEAR THE CAVES - MOMENTS LATER  Spencer groans as he drops down into the cave beside Nelson. Close behind, SCOTT BLACK lingers in the opening. NELSON What’s the matter with you? SPENCER What’s the matter with me is that I’m forty goddamn years old. And that’s a medical fact. BLACK Slipped a disc, I think. Nelson stays at the mouth of the cave. NELSON Diller missed his first check-in on the PRC. Spencer looks concerned for a moment, then squelches it. SPENCER The mountains. No reception. Nelson looks out through the cave,   obviously   worried. SPENCER (CONT’D) Look, if you had to send somebody, he’s the man. I’ve known Diller a long time. He’s a hothead, but he’s smarter than hell. Did you   need   to do this? NELSON Either he slows down that supply line... or   we don’t move.  SPENCER So trust him. He’ll do his job.  EXT. ROCKY HILLSIDE - AFTERNOON  From beyond a mountain range, plumes of smoke rise. The echoing roar of heavy guns sounds like a far-off thunderstorm. Dostum’s troops are heavily engaged. Nelson sweats beside Michaels. NELSON Michaels? MICHAELS All set for round two, sir.  EXT. BESCHAM BATTLEFIELD - DAY  AFGHAN MILITIAMAN  Allahu Akbarrrr!!!  82.",
      "characters": [],
      "action_text": "A wave of Dostum’s horsemen crest a hill and charge down the other side toward the Taliban lines. Across the scorched earth, the Taliban guns   open   up. Mortars drop. Rocket- propelled grenades whiz past. Beside Nelson and FALLS, Dostum kicks his horse. DOSTUM This is a bad place now. (circling Nelson) Come! The two best American horsemen! Follow me! NELSON Michaels! Stay on the headset! Nelson heads over and quickly mounts his horse. He looks over to find Falls, wobbling on his horse beside him. Downhill, Nelson sees men topple in their saddles, punched by rifle fire. He hears whine of rounds passing by his head. He gets onto his handheld radio and calls back to Michaels. NELSON (INTO RADIO) (CONT’D) Drop! Now! He lowers his head at the shriek of a passing bullet. Then he looks up just as the entire Taliban front line explodes. As the smoke clears, the bomb has opened a line through the Taliban’s defenses -- into the occupied town of Bescham. Dostum shouts on his Motorola, leading the forces in.  EXT. BESCHAM BATTLEFIELD - AERIAL SHOT  Nelson falls in along with the Afghan horsemen as they ride in formation straight toward the village.  EXT. BESCHAM BATTLEFIELD - NELSON’S POV  But as they gallop forward, Nelson sees:  It’s a trick.   ZSU-23s (Zuesses) are wheeled from gutted houses and stables. They’ve hidden artillery in the village. NELSON General! Within moments, the Taliban has dialed the range on them - and the rapid banging of the anti-aircraft guns hurl through the approaching Afghan line. It’s a   calamity.   Men blow apart in their saddles. Nelson looks over to see COMMANDER KHALED riding beside him. They meet scared eyes just as - KHALED is lifted off the ground by a blast, cut in half.  83. Nelson winces, closes his eyes, and pulls his horse away from the detonation crater. As he opens his eyes, still galloping, his face has been sprayed with blood and dust. Ahead of him, the horsemen halt, trapped by gunfire. They begin to drop and take cover on the g",
      "dialogue_count": 0,
      "word_count": 2398
    },
    {
      "scene_number": 10,
      "slugline": "EXT. EMPTY DESERT RIDGE - DAY  CAPTION: “NOVEMBER 1.” Through heat fumes, across a vast empty landscape, turbaned figures rise over a ridge, elongated in the haze. Bearded men, thin as scarecrows. As they come closer we hear a famished man hoarsely singing: DILLER (from a distance) County roads, take me home... to the place I belooong... West Virginia... Exhausted, Diller and his team struggle past.  EXT. MOUNTAIN RIDGE - OVERLOOKING THE SUPPLY LINE  Thud! Diller and his team drop onto their bellies to look over a valley. Below they see -  - hundreds   of Taliban ZUESSES and BMPs in storage, waiting to be called into battle. With crazed eyes, Diller nods to Coffers... who begins calling in coordinates.  EXT. DESERT - MOMENTS LATER  As Diller and his men descend from the ridge, once again single-file, once again singing... DILLER  West Virginia...   Mountain Mama... take me home, country -- BOOM! A massive   explosion   goes up behind them. The munitions cache is ignited, setting off a chain reaction of smaller explosions as they continue wending downhill.  EXT. CAVE - SHULGAREH CAMP - MORNING - NOVEMBER 2  CAPTION OVER: “NOVEMBER 2. TWO WEEKS IN-COUNTRY” As Nelson sleeps, there’s a faint mechanic whir in the distance. The noise grows loud enough to awaken Nelson. His eyes pop open, confused: it sounds like a GOLF CART.  EXT. SHULGAREH CAMP - MORNING - CONTINUOUS  From behind a motorized GATOR, we ride toward the campfire smoke. As the Gator comes closer, more and more Afghans rise to watch. CONTINUE PAST - - all the way to where CAPTAIN NELSON has emerged from the cave with Michaels at his side. The cart stops in front of them. Nelson and the rest of the team are leathery and bearded, wearing the local clothes. REVERSE ON: TWO AIR FORCE TARGETING SPECIALISTS - WINEHOUSE and TATUM - finally come to a stop in a cart LOADED DOWN with gear. They’re clean-cut, in tidy uniforms, looking like they’re stepping out of the future in a rolling time machine.  91.",
      "characters": [],
      "action_text": "Spencer limps out, the gray in his beard showing. WINEHOUSE Captain Nelson? Air Force. Sergeants Winehouse and Tatum. We’ve brought the SOFLAM. NELSON SOFLAM. TATUM It’s a laser-targeting system... to assist you with accuracy. You point the laser beam, and the coordinates are uploaded to the pilots overhead. No more guesswork. Nelson looks over at Spencer. Spencer makes a deep sigh. SPENCER I’ll radio back to K2. As Spencer shuffles off with Michaels and the COMMO PACK - Nelson comes ahead to the two AIR FORCE SPECIALISTS. NELSON You need to ditch all of this gear. He begins unloading their supplies onto the ground. Cooking materials, fuel, camelback water filters. Nelson seems to have   pure authority   now in his demeanor. Spencer and Michaels have already got a line back to base - and Spencer waves Nelson over. NELSON (CONT’D) There’s no room for anything you can’t carry on a horse. As Nelson heads away, WINEHOUSE and TATUM just sit like stranded astronauts, peering at each other. TATUM Man, these guys are   ripe.  EXT. SHULGAREH CAMP - AROUND COMMO PACK - MORNING  Approaching, Nelson sees the troubled look on Spencer’s face. NELSON No more bad news, Spence. SPENCER Can’t help it. They dropped the Triple Nickels onto the ground in the Balkh. They’ve linked up with General Atta and the Tajiks. Nelson takes this news like it’s a body punch.  92. NELSON Dostum’s biggest rival. (a deep breath) They gave up. They took the ground out from under us. Nelson turns, looking over at Dostum’s new tent, a large white canvas affair, stiff as sailcloth. SPENCER You’ve earned his trust a little. Right? Nelson just looks at Spencer to say:   Are you kidding me?  SPENCER (CONT’D) Look at it this way. It’s a promotion. Bowers and Mulholland just handed you the most important diplomatic job in the free world: Keep the Northern Alliance together. NELSON Let’s be prepared to get out of here fast if we have to.  EXT. REMOTE MOUNTAINSIDE - MORNING  Dense fog. Dragging onward, Diller and",
      "dialogue_count": 0,
      "word_count": 4095
    },
    {
      "scene_number": 11,
      "slugline": "EXT. NORTHERN EDGE OF TIANGI GAP - CONTINUOUS  Amid whistling bullets, COFFERS’ hands are shaking as he tries to fix the SATELLITE RADIO, shearing and reattaching wires. Diller is sweating, out of breath. COFFERS Everything’s bent, Jesus Christ -- I got to -- I can’t -- DILLER Get her fixed, Coffers! An RPG hits with an ear-shattering baritone.  EXT. HILLTOP - EASTERN FLANK - MIDDAY  An eerie silence. A sea of red dirt. Fists punch up through the dirt, followed by arms, shoulders, then MILO’S HEAD. Gasping for breath, he claws himself free. Essex is scrabbling out of the earth, turning back to help Winehouse. Coughing, spitting dirt, they’re bleeding from the ears and noses. Milo stares down, awestruck, into the valley, scarred and desolate. Al Qaeda bodies litter the ground. ESSEX Milo. Milo turns to see Najeeb’s skinny legs stick out from the dirt: he’s buried, facedown, from the thighs up... Quickly the three men grab his legs, pulling hard, but he won’t come free. They claw frantically at the dirt, throwing fistfuls aside, till they can finally work the boy loose. Milo turns him over. Najeeb lies still, not breathing. MILO Ah, no. Come on, brother.   No.  He pushes down hard, with the heels of his palms, on the boys abdomen. Once, twice, three times. Nothing. Suddenly, Najeeb hawks out dirt. He gasps for breath. His eyelids flutter, then open. Milo exhales, relieved.  EXT. TIANGI GAP - DOSTUM AND BOWERS - AFTERNOON  DOSTUM fires from cover behind the rocks and debris. His men are holding their positions, but bottled up in a stalemate. From this position, the canyon bows outward, a sheltered but dead-end cove to the east of them. FARTHER BACK -- Nelson is holding his horse in position against a retreating current of Afghans. Jones has ridden up along Nelson’s side, panic on his face. JONES Do we retreat?  106.",
      "characters": [],
      "action_text": "NELSON No. We got one shot.  EXT. TIANGI GAP - AROUND THE BEND - MID-AFTERNOON  The BM-21 wheels into place around BMPs with mounted machine guns. Slowly, the MISSILE PAD lowers into place. The missiles begin to fire:   whoosh, whoosh, whoosh.  MULLAH RAZZAK steps up beside it, smiling wide.  EXT. TIANGI GAP - CANYON ALCOVE - ON BOWERS AND DOSTUM  Nelson hears the otherworldly sound, like a beating on the air itself,   whoosh, whoosh   -- and his eyes open wide as -- THE ROCKETS pulverize the canyon walls.  EXT. NORTHERN EDGE OF TIANGI GAP - CONTINUOUS  With a spark of two salvaged wires touched together, Coffers just manages to repair the radio... COFFERS Got it!   Yes!  Diller drops to a bloody, scuffed knee and keys in: DILLER (INTO RADIO) This is Tiger 02, Charlie cell -   Mitch , do you copy?   Mitch?  EXT. SOUTHERN EDGE OF TIANGI GAP - MID-AFTERNOON  NELSON receives the transmission under the horrifying rhythm of the missiles. The canyon ahead fills up with smoke. NELSON (INTO RADIO) Go ahead! He stands still on his horse as AFGHAN RIDERS begin fleeing past him out of the canyon. DILLER (ON RADIO) There’s a BM-21 in the chute. I saw the missiles go in. NELSON (INTO RADIO) How many? DILLER (ON RADIO) Enough to blow us all to hell. WE CATCH UP TO THE OPENING SHOT OF THE MOVIE. This time, instead of remaining tight on NELSON, we see the landscape: the nervous horses, Jones losing his nerve, the canyon coming apart with each blast. On his horse, Nelson faces the chaos. The noise is awful, a thumping that shakes the earth. Smoke pours out -- and the better part of Dostum’s army is fleeing.  107. JONES They’re gone, boss. Nelson stares ahead. What may have seemed like indecision in the opening shot, now - in context - appears to be resolve. An explosion drowns part of Jones’s panicked words. JONES (CONT’D) We can’t do anything for them. A closer blast RIPS THE CANYON, spraying rock. The detonation cloud rolls toward them, painting faces with grit. Nelson is comforti",
      "dialogue_count": 0,
      "word_count": 1443
    },
    {
      "scene_number": 12,
      "slugline": "EXT. NORTHERN EDGE OF TIANGI GAP - CONTINUOUS  DILLER is hanging off an aerie to fire at a CONVOY of missiles on trucks. NELSON (V.O.)  Thirty-two, thirty-three, thirty-four.  EXT. WESTERN FLANK - DIRT PATH - CONTINUOUS  The GATOR moves with SPENCER, as BLACK struggles to keep him alive, opening up his wounds with a scalpel... NELSON (V.O.)  Thirty-five, thirty-six, thirty-seven.  ...filling Spencer’s torso up with “Curlex” to soak the bleeding.  EXT. EASTERN FLANK - CONTINUOUS  Essex, Milo and Winehouse carry NAJEEB across a scorched landscape, toward the booming sound in the distance. NELSON (V.O.)  Thirty-eight, thirty-nine...  NELSON   -- rides ahead as the last missile is fired. NELSON That’s it. Two minutes to reload. He looks at Lal, then back at the soldiers who’ve fallen in line behind him, hundreds. NELSON (CONT’D)  Mostaqim! Tez! Tez! Tez!  He kicks into a gallop, followed by Lal and the horsemen, with the foot soldiers breaking into a run, shouting. COMMANDER LAL  Allahu Akbaaaarrrr!!!  AERIAL ANGLE   -- soaring above the charging mass, as they pour down the canyon like a river. Taliban snipers fire down from cliffs. Suddenly they’re struck down by --  MICHAELS AND FALLS   -- taking the shots.  ON THE TALIBAN’S BM-21  A gang of Taliban hurry to reload missiles from a FLATBED truck parked crookedly on the canyon floor. Each missile weighs 150 lbs, and takes three men to load into the pad. MULLAH RAZZAK shouts in Pashtun at his crew as he directs a TANK toward the bend and Nelson’s approach.  ON NELSON  111.",
      "characters": [],
      "action_text": "He leads charging Afghans, his horse in full gallop, reins in his teeth. He fires his M-4 non-stop at the front lines of Taliban and 055 fighters. Around the bend comes the TANK, a faded Soviet star on the side. Nelson pulls up on his horse. The tank’s turret slowly lowers to target him. Nelson takes a deep breath. Then he spurs his horse and takes off, galloping right at the tank. As the gun moves into place, Nelson pulls the reins, kicks his horse, and   leaps   onto the tank. His horse gallops over the top. The tank fires late, as Nelson vaults onto the silt on the other side. He looks back to see ALLIED AFGHANS leaping onto the tank, pulling open the hatch to kill the Taliban inside.  INT. TIANGI GAP - CANYON ALCOVE - CONTINUOUS  DOSTUM holds his position, shielded from the BM-21. His men lie on their bellies, firing at anything that moves. He squeezes off a few shots then drops behind rocks, reloading. The noise at the mouth of the cove grows louder. His men fire at it, creating a deafening echo chamber. But Dostum fires straight into the air, screaming... DOSTUM  Dresh! Dresh!  There’s silence. Then comes the clacking sound of hooves. Into the mouth of the cove steps NELSON on his horse, trailed by hundreds of men, bandoliers jangling. It takes a moment for Dostum to recognize Nelson, his face blackened with smoke and dust. But when he does, Dostum places his hand onto his heart. Nelson stops on his horse - then does the same. NELSON  Mostaqim!  Nelson kicks up a charge around the last bend, toward the teeth of the Taliban front line, as Dostum runs to his horse, calling his men in Dari. The survivors leap out of hiding to join Nelson’s charge.  ON THE BM-21  Almost reloaded, the crew inserts and locks in a few last missiles. Then the truck starts and the pad begins moving into position for a new assault. As it angles downward... NELSON, DOSTUM, and AHMED LAL round the bend on galloping horses, leading the frenzied men   straight   toward missile pad, crossing",
      "dialogue_count": 0,
      "word_count": 1203
    },
    {
      "scene_number": 13,
      "slugline": "EXT. NORTH OF CANYON - RIVER VALLEY - DUSK  Mitch Nelson rides full speed ahead on his horse, stirring up dust in the ancient riverbed.  INT. CHINOOK HELICOPTER - BAY - EVENING  The sun has just set and Spencer rocks with the motion of the Chinook. Below, he sees A LONG STRING OF LIGHTS on the road below.   Taillights.  INT. CHINOOK HELICOPTER - COCKPIT  The pilots curl off from the road, radioing in. PILOT (INTO RADIO) This is your eye-in-the-sky traffic report. We got one heck of a logjam out of Mazar.  EXT. ROAD FROM MAZAR-I-SHARIF TO KONDUZ - NIGHT  Taliban vehicles jam the road leaving Mazar, headlights stretching all the way to the horizon. We see pickup after pickup filled with retreating enemy fighters. PILOT (ON RADIO) A full-scale retreat to Konduz.  EXT. PLAINS SOUTH OF MAZAR - NIGHT  The moon shines in a clear, dark sky. Gradually, from over a hillock, there comes a thunderous sound. It grows in volume, jangling, knocking. Then, all at once,   hundreds   of silhouettes of horses crest the ridge. GENERAL DOSTUM rides at the front of his surviving troops, exhausted but pushing onward through the dark toward Mazar. Dostum’s MOTOROLA chatters in Dari, and he screams back into it, spitting with anger. He’s not slowing down. WE RISE UP FROM THE ROAD AND SWEEP BACK TWO MILES TO: CAPTAIN NELSON, galloping ahead, delirious from exhaustion. Trying to catch up to Dostum before Mazar, he rides his horse at a full sprint with a long tail of dust cast up into the air behind him. Suddenly - NELSON has to pull on his reins. He’s stopped by a whole NEW ARMY, filling the road, VEHICLES around horses. He trots his horse in a circle, and rides up to a familiar face: CAPTAIN DEAN NOSOROG of the Triple Nickels. NOSOROG Ho-ho-hold it. Hold it.  115.",
      "characters": [],
      "action_text": "Nosorog’s face drops in shock as he suddenly recognizes in the dark that it’s CAPTAIN NELSON. NOSOROG (CONT’D) Mitch? NELSON Where’s Atta? NOSOROG Orders are straight from Bowers: we’re supposed to stay put. The men are falling off their horses from exhaustion. We’re supposed to merge forces right here and ride into Mazar  tomorrow.  NELSON Where’s General Atta? NOSOROG He drove ahead with some men. Nelson rides in closer and leans down off his horse to meet Nosorog’s eyes. NELSON Captain, there’s   no tomorrow . Dostum’s not stopping and neither is Atta. They’re going to square off over the city - and in a few hours you’re going to see the end of the Northern Alliance. I’m breaking orders: blame it on me. Nelson takes off again on his horse, leaving a stunned NOSOROG reeling on his feet. Finally, after a beat, Nosorog makes the call and gestures to his men. NOSOROG Follow him. Let’s go.  OVERHEAD SHOT  The convoy of headlights catches up to Mitch Nelson as he gallops ahead on his horse. Nelson races, leading the charge, heading toward the dark figures of horses on the road.  EXT. PLAINS SOUTH OF MAZAR - MOMENTS LATER  As headlights begin to shine onto Dostum, the general is in an enraged trance. His Motorola murmurs in Dari. Coming into the lights at the edge of the city, Dostum leads a weary string of 1,500 men, on horses and on foot. He puts up his hand, and -- all at once -- the exhausted troops halt. Under a cloud of dust,   another army   approaches from the off the road.  116. As the haze clarifies around them, we see BLACK TOYOTA PICKUPS filled with troops, rifle barrels and RPGs hanging from all sides. All around, Dostum’s men begin shouldering their weapons.  FROM THE PERIMETER  Nelson reaches the edge of this scene on horseback just as Nosorog’s JEEPS begin pulling up around him. Stopping cold, Nelson watches from a few yards away. DOSTUM dismounts and walks into the headlights from the surrounding trucks. He pauses a moment. He looks back at the Jeeps. H",
      "dialogue_count": 0,
      "word_count": 1953
    }
  ]
}