{
  "slug": "12-years-a-slave-2013",
  "title": "12 years a slave",
  "genre": "action",
  "format": "film",
  "scenes_count": 16,
  "characters_count": 6,
  "characters": [
    "BURCH",
    "CHAPIN",
    "TREACH",
    "EPPS",
    "CELESTE",
    "ARMSBY"
  ],
  "total_words": 29626,
  "total_dialogue": 7,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. NORTHUP HOUSE - NIGHT 7   7 Solomon and Anne have fun and difficulty putting the unruly children to bed. They are tucked in, and each given a kiss good night.   As Margaret lays down to sleep, Anne blows out the candle darkening the room. Silhouetted in the doorway, Solomon takes Anne in his arms, holds her tightly as they both luxuriate in the simple, beautiful gift that is their children. INT. NORTHUP HOUSE - NIGHT 7A   7A   * Now alone together, we see Anne and Solomon wrapped in each other's arms.   Beyond being physically close, emotionally close, they are just so very comfortable with one another.   They are the very representation of a couple who are made for each other. They look at each other for a prolonged time.   * SOLOMON   * (comically forlorn)   * Three weeks.   Two days.   * ANNE   * It is the custom.   I wonder what   * you'll do without me?   * SOLOMON   * I won't stay idle.   * SOLOMON's eyes lower.   * ANNE   * Darling, it's good money.   * SOLOMON   * If only I didn't have to share   * your cooking with other people.   * ANNE holds his gaze.   * ANNE   * You don't.   * They kiss.   * OMIT 8   8 1/24/13   FINAL SHOOTING SCRIPT   6.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 212
    },
    {
      "scene_number": 2,
      "slugline": "EXT. NORTHUP HOUSE - MORNING 9   9 We are just outside the Northup house.   A CARRIAGE waits with a DRIVER.   Anne and the children are dressed for travel - Anne sporting HER NEW CARRY ALL.   The Driver loads bags into the carriage. For her parting gift, Anne gives her husband a kiss. SOLOMON Travel safely. ANNE Stay safely. Anne and the children loaded up, the Driver chides the horse and the carriage heads off.   Solomon waves a hearty good bye to his wife and children. EXT. PARK - DAY 10   10 Solomon is now out for a stroll. He passes two men - two in particular - who stand outside conversing with MR. MOON himself:   MERRILL BROWN and ABRAM HAMILTON.   Brown is about 40, with a countenance indicating shrewdness and intelligence.   Hamilton is closer to 25, a man of fair complexion and light eyes.   Both are finely, if perhaps a bit garishly, dressed.   Hamilton, as Solomon describes him, slightly effeminate. Moon, spotting Solomon: MR. MOON Call the Devil's name...   There he is now.   Mr. Northup...!   I have two gentlemen who should make your acquaintance.   Messrs. Brown and Hamilton. BROWN Sir. MR. MOON Mr. Northup, these two gentlemen were inquiring about distinguished individuals, and I was just this very moment telling them that Solomon Northup is an expert player on the violin. HAMILTON He was indeed. SOLOMON Mr. Moon is being overly gracious. 1/24/13   FINAL SHOOTING SCRIPT   7. (CONTINUED)",
      "characters": [],
      "action_text": "BROWN Taking into consideration his graciousness and your modesty, may we trouble you for a moment of your time to converse, sir? EXT. PARK/PAVILION - LATER 11   11 We make a jump to a green space.   Solomon, Brown and Hamilton are sitting at a bench. SOLOMON A circus? HAMILTON That is our usual employee.   The company currently in the city of Washington. BROWN Circus too constricting a word to describe the talented and merry band with which we travel.   It is a spectacle unlike most have ever witnessed.   Creatures from the darkest Africa as yet unseen by civilized man.   Acrobats from the Orient able to contort themselves in the most confounding manners. HAMILTON And I myself in aide of Mr. Brown; an internationally renowned practitioner in the art of prestidigitation. BROWN We are on our way thither to rejoin the company having left for a short time to make a small profit from our own exhibitions. HAMILTON The reason for our inquiry with Mr. Moon... BROWN Yes.   We had just a devil of a time in procuring music for our 1/24/13   FINAL SHOOTING SCRIPT   8. CONTINUED: 10   10 (MORE) (CONTINUED) entertainments.   Men of true talent seemingly in short supply. SOLOMON Thank you sir... BROWN If we could persuade you to accompany us as far as New York... We would give you one dollar for each day's service and three dollars for every night played at our performances. In addition we would provide sufficient pay for the expenses of your return from New York here to Saratoga. SOLOMON You understand this is all very sudden. HAMILTON Consider it an opportunity to see the country-- SOLOMON It's intriguing... HAMILTON If there is any way in which you would give consideration to the offer... Solomon gives the whole deal one last consideration. SOLOMON The payment offered is enticement enough, as is my desire to visit the metropolis. HAMILTON We are delighted, sir.   So delighted.   Though we would add that our travel plans-- BROWN We would like to depart with haste. 1/24/13   FIN",
      "dialogue_count": 0,
      "word_count": 831
    },
    {
      "scene_number": 3,
      "slugline": "INT. PUB - LATER 16   16 After the show, the pub now fairly empty, Solomon, Hamilton and Brown sit down to eat.   Hamilton and Brown drink, but again Solomon abstains.   Though Solomon remains cool, Hamilton and Brown put up a great show of being disappointed as Hamilton counts out what little money was collected. HAMILTON Not an additional tip from a one of them.   They expect to be entertained for nothing. BROWN And not satisfied a bit despite giving them more than what they paid for. SOLOMON It's the national mood.   There's too much grief to make room for frivolity. HAMILTON My sincerest apologies, Solomon. You were promised opportunity, and you were given none. BROWN The opportunity is with the circus.   A two man show poorly promoted, what were we to expect? But the circus bills itself. HAMILTON True. BROWN I have told you of the circus with which we are connected.   Creatures from the darkest of Africa. Acrobats from the Orient who-- SOLOMON You have described it, yes. BROWN Yes.   We need to return immediately to Washington. Solomon...I believe us familiar enough now, but forgive me if I am bold...would you consider making the trip with us? Solomon gives a bit of a laugh at the idea. 1/24/13   FINAL SHOOTING SCRIPT   11. (CONTINUED)",
      "characters": [],
      "action_text": "HAMILTON Entertaining at pubs and inns has it's place, but a man of your skills deserves better. BROWN Hear, hear. HAMILTON And more importantly you would build your own name and following. The circus tends to attract those with the highest of reputations. An introduction here and there could amount to a lifetime of reward.   Now would be the time. With your family away, an opportunity presents itself. BROWN Said as fellow artists as well as businessmen.   Well worth the effort at least. SOLOMON You present a flattering representation.   As my family will be traveling back shortly, perhaps I might commit only to one trial engagement. HAMILTON Oh, very good, sir.   Very good.   I cannot recall being so excited. BROWN There is a practical concern.   If you are to continue on with us you should obtain your free papers. SOLOMON Not necessary. BROWN Here in New York, no.   But we will be entering slave states and as a matter of precaution...   It's to all our benefit we should not have to come to account for your well being. HAMILTON Six shillings worth of effort could well save much trouble later. 1/24/13   FINAL SHOOTING SCRIPT   12. CONTINUED: 16   16 (CONTINUED) BROWN We'll go to the Customs House in the morning, then travel on.   Good business all around. 1/24/13   FINAL SHOOTING SCRIPT   12A. CONTINUED: (2) 16   16 OMIT 17   17 EXT. WASHINGTON - DAY 18   18 The city is a swarm of people. At the moment the populace is displaying both sorrow and anticipation.   Sorrow for the loss of the President.   Many are dressed in black, and black crepe hangs nearly everywhere. Black armbands are frequently seen, and the occasional American Flag hung at half mast. As well, there are portraits of Harrison at varying locations. Having arrived in Washington, Solomon, Hamilton and Brown RIDE ONWARD IN THEIR CARRIAGE. INT. GADSBY HOTEL/DINNING ROOM - EVENING 19   19 A decent though crowded, boisterous and smoke-filled joint.   Very lively.   Solomon, Hamilton and Brown are among sev",
      "dialogue_count": 0,
      "word_count": 836
    },
    {
      "scene_number": 4,
      "slugline": "INT. GADSBY HOTEL - STAIRCASE A23   A23 Hamilton and Brown help Solomon to lumber up the spiral staircase, passing the occasional bemused guest. INT. GADSBY HOTEL/SOLOMON'S ROOM - NIGHT 23   23 Hamilton is placing a spittoon near Solomon's bed, where a prone and reeling Solomon lays.   Hamilton sits on the bed.   As he strokes Solomon's sweaty face, Hamilton speaks sweetly. HAMILTON I'm afraid that Brown and I haven't brought you much luck. But rough waters bring smooth sailing.   Eventually they do. SOLOMON ....So...so sorry... HAMILTON Shhh.   We won't hear it.   We won't. BROWN Let him sleep. HAMILTON Hmm.   A good night's sleep.   And tomorrow...tomorrow you will feel as well and refreshed as though the earth were new again. Hamilton lingers a bit too long and a bit too close to Solomon for Brown's taste.   With more than a bit of signification: BROWN Hamilton!   Nothing more we can do for him. HAMILTON Such is the pity. Displaying an odd sort of disappointment, Hamilton slinks away from the bed.   He crosses to, and BLOWS OUT A CANDLE.   The room goes dark with a blackness more than night.   Brown and Hamilton exit.   Solomon lays in the dark and moans.   His sounds becoming MORE AND MORE DISTRESSED. INT. BURCH'S DUNGEON - DAWN 24   24 1/24/13   FINAL SHOOTING SCRIPT   15. (CONTINUED)",
      "characters": [
        "BURCH"
      ],
      "action_text": "Solomon stirs, then slowly awakes to his new circumstances.   He finds himself in a nearly lightless room about twelve feet square with walls of solid masonry.   There is a thick and well-locked door, a small window covered with iron bars and a shutter.   The only furniture is a wood stool and an old fashioned, dirty box stove.   As Solomon rises he sees that his HANDS are CUFFED - the chain running to a bolt in the ground - and his LEGS IN IRONS.   At first Solomon is incredulous.   But that emotion is replaced first by fury and then panic. He begins to pull on the chains, fight against them.   He does so with increasing desperation.   Solomon flails about, the sounds of the steel chains whipping and beating against the masonry.   He grunts and screams without regard as the cuffs and irons bite into his flesh, but he cannot pull himself free. After several minutes of intense effort, Solomon tires, slows, then finally he collapses.   And in this collapsed state he remains. INT. BURCH'S DUNGEON - MORNING 25   25 Solomon again awakens.   He hears sounds beyond the door...footsteps.   Eventually the door opens.   Enter JAMES BURCH - who runs the slave pen - and EBENEZER RADBURN who works as a turnkey and overseer. As the door opens, this is the first light to seep into the otherwise near-black room.   The shine is painful to Solomon's eyes.   With no salutation whatsoever, Burch asks: BURCH Well, my boy, how yah feel now? Solomon rises up as best he can.   With all the resolve he can put together he states what he considers to be fact: SOLOMON I am Solomon Northup.   I am a free man; a resident of Saratoga, New York.   The residence also of my wife and children who are equally free.   I have papers.   You have no right whatsoever to detain me-- BURCH Yah not any-- SOLOMON And I promise you - I   promise   - upon my liberation I will have satisfaction for this wrong. BURCH Resolve this.   Produce your papers. 1/24/13   FINAL SHOOTING SCRIPT   16. CONTINUED: 24   24 (CON",
      "dialogue_count": 1,
      "word_count": 1374
    },
    {
      "scene_number": 5,
      "slugline": "EXT. BURCH'S DUNGEON/YARD - DAY 30   30 It is a yard just beyond Burch's.   The yard is hemmed in by a brick wall.   In the yard are two men, and a boy. The oldest is CLEMENS RAY a man of about 25 years of age. He is well educated.   JOHN WILLIAMS is about 20 years old.   He is born and bred a slave, is lacking in education, and overwhelmed with fear of the situation. Finally there is a child about 10 years of age who answers to the name of Randall. Solomon, Clemens Ray, John and Randall ALL STAND NAKED. Though they try to cover their privates a bit, they are all aware of the uselessness of modesty.   Radburn is present.   He has before him A COUPLE OF BUCKETS OF COLD WATER.   He throws water on the naked men. RADBURN Go on.   Warsh   up. The men, soaking in humility as well as water, begin to scrub with A SINGLE BAR OF HARSH SOAP passed among them. RADBURN (CONT'D) The boy, too.   Get him clean. Solomon takes some soap and rubs it over Randall. RADBURN (CONT'D) Scrub now.   Git 'em clean. Solomon scrubs harder.   Randall - clearly cold and uncomfortable - appeals to Solomon. RANDALL Do you know when my Mama will come? RADBURN Hush him up! Seeing Solomon has no answer for him, Randall begins to cry. RANDALL Mama ..!   Mama! Is she going to come? Doing all he can to spare the child from a certain beating: SOLOMON Quiet, please. Randall is becoming nearly inconsolable. RANDALL Mama! 1/24/13   FINAL SHOOTING SCRIPT   21. (CONTINUED)",
      "characters": [],
      "action_text": "Saying anything to keep the boy quiet: SOLOMON Your mother will come, I swear she will, but you must be silent. Please.   Be silent! On the seeming strength of Solomon's promise, Randall goes silent.   Solomon looks to Radburn, who just throws water on the soapy men. 1/24/13   FINAL SHOOTING SCRIPT   21A. CONTINUED: 30   30 OMITTED 31   31 INT. BURCH'S DUNGEON - EVENING A32   A32 Radburn brings food in to Solomon; a shriveled piece of meat and some water.   Just barely enough to sustain Solomon.   Radburn also has a SHIRT. RADBURN That old thing of yours is just rags and tatters.   Need something proper to wear. Solomon doesn't move for the clothing. RADBURN (CONT'D) Go'won.   Put it on. With slow defiance, Solomon does as instructed.   He removes what remains of his old shirt - the one he was wearing when first kidnapped - and puts on the one Radburn brought him.   The shirt's ill-fitting and dirty. Despite that, Radburn says: RADBURN (CONT'D) There.   Tha's fine.   Tha's fine. Got no gratitude? SOLOMON ...Thank you... RADBURN Yah keep bein' proper, yah'll see how things work out. Radburn starts to take the old shirt. SOLOMON No!   It was from my wife. RADBURN Rags and tatters.   Rags and tatters. Taking the shirt, the \"rags and tatters\" as he calls them, Radburn exits, locking the door behind him. Solomon sits with the plate of food before him.   He pushes the plate away rather than eat. EXT. BURCH'S DUNGEON/YARD - DAY 32   32 Sitting together out in the yard are Clemens Ray, John and Solomon.   Over time they have drawn trustworthy enough to speak with one another.   At the moment Solomon is still trying to apply reason to the situation. 1/24/13   FINAL SHOOTING SCRIPT   22. (CONTINUED) Randall wanders about in the background.   As usual, he calls out for his \"Mama.\"   By now, however, his calls should feel like little more than background noise. SOLOMON This can't stand.   It is a crime. I believe now someone lay in wait for me.   My drink was altered... We are ",
      "dialogue_count": 0,
      "word_count": 1768
    },
    {
      "scene_number": 6,
      "slugline": "INT. STEAMBOAT - NIGHT 38A   38A   * We are now in the engine room of the steamboat, pistons   * pumping, black oily cogs turning, the power and the   * rhythm are both aggressive and hypnotic. A shovel comes   * into view, feeding the furnace.   * EXT. SEA - DUSK/DAWN 38B   38B   * The steamboat is en route between Washington and Norfolk.   * We tilt up from the violent water foam to the powering   * paddles of the boat.   * MOVED TO 43A 39   39   * 1/24/13   FINAL SHOOTING SCRIPT   26-28A.",
      "characters": [],
      "action_text": "OMIT 40   40   * OMIT 41   41 OMIT 42   42 INT. ORLEANS/HOLD - LATER - NIGHT 43   43   * Down in the hold the slaves eat, pray. The MULATTO WOMAN moves among them, catching ELIZA's eye. MULATTO WOMAN Cheer up and don't be so cast down. Clemens Ray and Solomon watch as the Mulatto Woman   * returns to top deck, the trapdoor locked firmly behind   * her. Clemens Ray turns to Solomon with a deadpan stern   * expression.   * CLEMENS RAY   * If you want to survive, do and say   * as little as possible.   Tell no   * one who you really are and tell no   * one that you can read and write.   * 1/24/13   FINAL SHOOTING SCRIPT   29. (CONTINUED) Clemens Ray turns away from Solomon, eyes lost into the   * distance.   * CLEMENS RAY (CONT’D)   * (slowly)   * Unless you want to be a dead   * nigger.   * Solomon’s face is one of a confused despair.   * EXT. NORFOLK/PORT - DAY 43A   43A   * We see a flat overhead view of the port of Norfolk.   * Sardines are laid out to dry in rows, glittering in the   * day's sun as if like silver pennies. A chain of slaves   * enter the frame and are led one by one on to the docked   * vessel.   * MORE SLAVES - about 15 in all, of various genders and   * ages - are brought on board.   Chief among them is ROBERT   * who fights viciously with his captors.   \"With all haste\"   * is shoved down into the hold.   * Having taken their cargo as far as they care or need to,   * Burch and Radburn depart.   They do so without a word   * spoken to Solomon or the others.   * With this new and sizable batch of slaves on board, the   * crew again CASTS OFF, and the Orleans makes its way   * again.   * INT. ORLEANS/GALLEY 44   44 Solomon is back cleaning in the galley.   As he cleans, he again watches Robert prep food.   Robert's skill with a knife is not lost on Solomon. INT. HOLD - LATER - DAY 45   45   * The hold is packed tighter now.   * Muzzle covering his face, Robert is shackled with his   * hands tied behind his back.   Solomon and Clemens Ray look   * o",
      "dialogue_count": 0,
      "word_count": 968
    },
    {
      "scene_number": 7,
      "slugline": "EXT. ORLEANS/DECK - DAY 51   51   * We are back up on the deck of the ship.   SOLOMON AND   * CLEMENS RAY dump ROBERT's body over the side of the ship.   * Solomon watches as the body churns for a moment in the wake of the vessel... then sinks beneath the water.   * Clemens Ray, with no sentimentality: CLEMENS RAY   * Better off.   Better than us.   * EXT. NEW ORLEANS HARBOUR - DAY 51A   51A   * Solomon’s POV from the back of the steamship of Robert’s   * corpse slipping gracefully into the water.   * EXT. NEW ORLEANS/PORT - DAY 52   52  -MID MAY, 1841-  A white male, fairly smart, with broad shoulders, stands and bellows- RAY Clemens...!   Clemens Ray! We are in the port of New Orleans, one of the busiest in the young nation. On the dock itself there is a bustle of activity as goods are loaded and unloaded from a various ships.   It's a bit of controlled chaos as a VARIETY OF LANGUAGES are spoken and shouted while slaves are shuttled from the Orleans to a holding pen.   Solomon, and all the slaves are overwhelmed by all that is happening around them. Two men - among many - are awaiting the arrival of the Orleans.   They are JONUS RAY - Clemens Ray's master - and DAVIS who is the solicitor of Mr. Ray.   They both look like they mean business.   The moment the gangplank is laid, Ray yells for Clemens. Clemens, seeing his master, is nearly crazy with delight. He is, uncharacteristically beside himself.   Ironically, his master now represents \"freedom.\" 1/24/13   FINAL SHOOTING SCRIPT   33. (CONTINUED)",
      "characters": [],
      "action_text": "CLEMENS ...My master...   Master Ray, sir! Master Ray! Clemens pulls on his chain. As he does so, Several other slaves collapse in his effort to reach his master, like dominos. RAY Who is in charge of this vessel? CAPTAIN I am the Captain. RAY I am Mr. Jonus Ray.   My solicitor has documentation verifying that the Negro named Clemens Ray is my property. As he reads PAPERS handed to him by Davis: CAPTAIN I know nothing of-- RAY You are ordered by court to return that property immediately, or face charges of thievery. CAPTAIN My duty is to transport goods.   I am not responsible for their origin. RAY Remove these contraptions! To his mate: CAPTAIN Free him! Biddee does as ordered.   Once free, Clemens hugs and sobs over his master as would a lost and then found child. RAY It's all well, now, Clemens.   You will return home with me. (to the Captain) Consider this notice and warning. 1/24/13   FINAL SHOOTING SCRIPT   34. CONTINUED: 52   52 (CONTINUED) Ray, Davis and Clemens head away.   Solomon seems both desperate and hopeful of some aid from Clemens and Ray. But there is none forthcoming.   Ray and Clemens continue on - Clemens not so much as even looking back in Solomon's direction.   Solomon stands and watches as they fade into the environs and are gone from sight. EXT. NEW ORLEANS/PORT - LATER 53   53 Hours later.   The slaves sit off on one side of the dock, baking in the sun, awaiting their fate. THEOPHILUS FREEMAN - a tall, thin-faced man with light complexion and a little bent - moves along the deck calling out names from a list.   The slaves STAND as they are called. FREEMAN Oren.   John.   Lethe.   Eliza. Randall.   Emily.   Platt...   Platt! Solomon does not respond.   Freeman looks around.   He spots Solomon. FREEMAN (CONT'D) Captain, who shipped that nigger? CAPTAIN Burch. Freeman steps to Solomon.   He gives him a looking over. FREEMAN Stand up. Solomon does as told. FREEMAN (CONT'D) You fit the description given. Why didn't you answer when called? SOLOMO",
      "dialogue_count": 0,
      "word_count": 662
    },
    {
      "scene_number": 8,
      "slugline": "I/E. CART - LATER 54   54 Solomon is carted off along with the rest of \"Burch's stock:\" Eliza and her children, John and Solomon. As they move off from the port in a make-shift cart, it opens up to the frenzic, busy port. For the first time Solomon sees true and severe slavery. These are not visiting servants, such as Jasper was back in Saratoga.   These are humans held in strict bondage - herded like cattle, chained together as if in a \"chain gang.\"   Slaves are evident not merely by the color of their skin.   The residue and accessories of slavery are everywhere.   Blacks almost universally display scars - THICK AND HEAVY DEAD TISSUE FROM LACERATIONS LEFT UNTREATED - brands, and are often missing limbs.   Blacks are held in all types of shackles, from simple chains to elaborate bindings, to neck collars that are spiked. Some are muzzled or forced to wear bits.   One slave is attacked by a dog and the slave owner. The dog pulls and tears at the slave's clothes. THESE IMAGES SHOULD BE A CONSTANT AND CONTINUAL CANVAS TO THE PIECE.   EVER PRESENT, BUT NOT REALLY COMMENTED ON AS THEY ARE THE NORM.   They should be a reminder that not only are people being oppressed, but that there is an entire system of oppression in place. EXT. FREEMAN'S SLAVE PEN - LATER 55   55 \"Burch's stock:\" arrive at Freeman's slave pen.   They are led in by Freeman and his house slave CAPE - a mulatto. The yard is enclosed by plank, standing upright, with ends sharpened instead of brick walls as with Burch's. Including Burch's group there are about 30 SLAVES in the pen. Solomon and the others look around and see nothing but downtrodden and despondent faces. Three men sit next to each other with muzzles and quietly stare back at this new batch of arrivals. One attempts to speak, but all that comes out is a muffled, unintelligible sound. EXT. FREEMAN'S SLAVE PEN - LATER 56   56 The slaves are in various states of undress, men and women alike.   They clean themselves, scrubbing with soap and water.   Women wash their hair.   Men shave, skin is oiled.   Freeman walks among them, inspecting them as they primp themselves. INT. FREEMAN'S SLAVE PEN - LATER 57   57 The slaves are given new clothes by Cape.   The men are given hat, coat, shirt, pants and shoes.   The women 1/24/13   FINAL SHOOTING SCRIPT   36. (CONTINUED)",
      "characters": [],
      "action_text": "frocks of calico and handkerchiefs to bind about their heads. INT. FREEMAN'S/GREAT ROOM - LATER 58   58 It's an odd, ironic scene.   The slaves are in a large and fairly ornate room within Freeman's house.   CAPE PLAYS A PAINFUL TUNE ON A FIDDLE - background music - as Freeman tries to line up A SMALL GROUP OF THE SLAVES, he becomes less patient, jittery and nervous, knowing that his livelihood is at stake, he wants his slaves to make a good impression. Sometimes his patience gets the better of him, and his hands move freely in direction of the slaves. The business has the air of an etiquette class, though what Freeman is trying to do is coach the slaves into being more \"sellable.\"   He works with them in groups of five or so. FREEMAN Tallest to smallest, understand? Are you taller than her?   Then you'd go before her.   Do it. Move.  (to the group) Keep your heads up.   A sense of direction; that's how you look smart.   None of those saucer eyes. Rid yourself of that smile.   Look like a goddamn grinnin' monkey. Put the least thought in your head.   C'mon, now.   Think of somethin'. Weary of Cape's playing, Solomon moves to Cape.   He asks: SOLOMON Can you play a reel? CAPE (dismissive) Nah.   I don't know no reel. SOLOMON If I may...? Cape looks to Freeman: FREEMAN He sick of your caterwaulin'.   Let him play, boy.   Let's see what he can do. Cape reluctantly hands the fiddle over to Solomon. Solomon tunes it a bit, then begins to play.   His fingers stiff at first, he takes a moment to warm up.   But as he warms up he is, despite the circumstances, masterful. 1/24/13   FINAL SHOOTING SCRIPT   37. CONTINUED: 57   57 (CONTINUED) THE SLAVES ALL CLAP ALONG.   SOME DANCE ALONG.   All admire his work.   Freeman chief among them. FREEMAN (CONT'D) Keep on.   Keep on. Solomon continues to play. FREEMAN (CONT'D) A damn sight better than you, Cape.   A damn sight better. Cape looks bitter as Solomon plays on. INT. FREEMAN'S/GREAT ROOM - DAY 59   59 We come in on an odd sort",
      "dialogue_count": 0,
      "word_count": 1531
    },
    {
      "scene_number": 9,
      "slugline": "EXT. FORD PLANTATION   - LATER 60   60 Driven in a horse drawn wagon by Ford are Solomon and Eliza.   Eliza is sullen to say the least.   With the loss of her two children she has dropped into a depression she will not be able to pull out of. 1/24/13   FINAL SHOOTING SCRIPT   40A. (CONTINUED)",
      "characters": [],
      "action_text": "They arrive to the FORD PLANTATION.   The main house of the plantation - the GREAT HOUSE as they are commonly called - is sizable.   Two stories high with a piazza in front.   In the rear are also a log kitchen, poultry house, corncribs and several slave cabins.   The plantation is described as \"a green spot in the wilderness.\" With the arrival of Master Ford there is a flurry of activity - the \"excitement\" of a new delivery.   MR. CHAPIN, a white overseer, instructs a slave named SAM. CHAPIN Sam, call to the Mistress. SAM Mistress!   Mistress, they arrivn'. MISTRESS FORD EXITS the house - along with her attending slave, RACHEL, who is a cook AS WELL AS SAM'S WIFE - and travels to her husband, kisses him, then laughingly inquires: MRS. FORD Did you bring all those niggers? Two of them?   You got two? FORD Make me something to eat, dear. The day has taken it from me. MRS. FORD Let me get a look at them... FORD Mr. Chapin-- MRS. FORD (re: Eliza) This one's cryin'.   Why is this one cryin'? FORD Separated from her children. MRS. FORD Oh, dear. FORD It couldn't be helped. MRS. FORD Poor, poor woman. FORD Mr. Chapin, tomorrow you will take these two up to the mill and start them workin'.   For now make them 1/24/13   FINAL SHOOTING SCRIPT   41. CONTINUED: 60   60 (MORE) (CONTINUED) adequate; fix them a meal, and have them rest themselves. CHAPIN Yes, sir. (to the slaves:) C'mon, now.   C'mon.   Don't dawdle. MRS. FORD (to Eliza:) Something to eat and some rest; your children will soon enough be forgotten. EXT. FORD'S WORK AREA - DAY A61A   A61A   * John Tibeats, stands before the slaves. Chapin hovers to   * one side.   * TIBEATS   * My name is John Tibeats, William   * Ford's chief carpenter.   You will   * refer to me as Master.   * Tibeats nods in Chapin's direction:   * TIBEATS (CONT’D)   * Mister Chapin is the overseer on   * this plantation.   He is   * responsible for all of Ford's   * property.   You too will refer to   * him as Master.   * This plantation covers",
      "dialogue_count": 0,
      "word_count": 958
    },
    {
      "scene_number": 10,
      "slugline": "EXT. ROAD - LATER 63   63 As Sam drives the wagon, the other slaves trudge along side by foot.   We should get the sense the travel is long and tedious. EXT. FORD'S WORK AREA - LATER 64   64 It is a sizable work area on the edge of Indian Creek. There is much work being done, the slaves primarily employed in piling the timber and chopping it into lumber.   As before, there is little doubt about the rigors of the job at hand. Working as a carpenter at the work area is JOHN TIBEATS. There are also various CUSTOMERS who move about placing orders. EXT. FORD PLANTATION - DAY 65   65  -EARLY TO MID JUNE, 1841-  It's Sunday morning.   All of Ford's slaves are dressed with their \"finest\" clothes - brightly colored and as free as possible of defect.   The slaves are gathered on 1/24/13   FINAL SHOOTING SCRIPT   42B. (CONTINUED)",
      "characters": [],
      "action_text": "the lawn just beyond the piazza.   Mistress Ford is present as well.   As the slaves listen, Ford reads to them Scripture.   His tone is of a man trying to preach by way of compassion. FORD \"But as touching the resurrection of the dead, have ye not read that which was spoken unto you by God, saying, I am the God of Abraham, and the God of Isaac, and the God of Jacob.   God is not the God of the dead, but of the living.   And when the multitude heard this, they were astonished at his doctrine. Then one of them, which was a lawyer, asked him a question, tempting him, and saying,   Master, which is the great commandment in the law? Jesus said unto him, Thou shalt love the Lord thy God with all thy heart, and with all thy soul, and with all thy mind. This is the first and great commandment.   And the second is like unto it, thou shalt love thy neighbor as thyself.   On these two commandments hang all the law and the prophets.\" Despite the lightness with which Ford speaks and the hope in his words, ELIZA SITS OFF TO THE SIDE - SELF-SECLUDED A BIT - WEEPING GENTLY. We should be able to see in Mistress Ford's eyes that Eliza's constant crying is unsettling. OMITTED 66   66 OMIT 67   67 OMITTED 68   68 1/24/13   FINAL SHOOTING SCRIPT   43. CONTINUED: 65   65 OMIT 69   69 EXT. FORD'S WORK AREA - DAY 70   70 -MID JUNE, 1841- The slaves have broken for lunch.   They snack on smoked meat and drink water from gourds.   As they lunch Solomon reads from Sam's Bible to the other slaves. SOLOMON But he that is greatest among you, let him be as the younger; and he that is chief, as he that doth serve.   For whether is greater, he that sitteth at meat, or he that serveth?   Is not he that sitteth at meat?   But I am among you as he that serveth. A white customer - WINSLOW - irate at the sight and sound of slaves reading Scripture, crosses over.   He grabs the Bible. WINSLOW From where did you thieve this? SAM Suh, the book is my property. The White Customer has no interest in Sam's an",
      "dialogue_count": 0,
      "word_count": 2198
    },
    {
      "scene_number": 11,
      "slugline": "EXT. FORD PLANTATION - DAY 81   81  -JANUARY, 1842-  Seasons have passed.   It is winter now, and very grey out along the bayou.   Ford and Tibeats - who we have seen working around the WORK AREA - stand with Solomon, Tibeats giving Solomon an inspection.   Ford carries much lament. TIBEATS Raise yer shirt. Solomon does as instructed.   Tibeats looks at Solomon's back, at the scars from lashings he bears. TIBEATS (CONT’D) Troublesome. FORD He's a good carpenter and quick- witted. TIBEATS I am familiar with his cleverness. FORD You won't find a nigger more humble. TIBEATS Ain't found a nigger yet I cain't humble. Tibeats heads off.   Solomon, highly curious over the preceding. SOLOMON Sir, have I done something wrong? FORD Not your concern, Platt.   I say with much...shame I have compiled debts.   I have long preached austerity, but find myself hypocritical in that regard. You'll be in the ownership of Mr. Tibeats.   You are his now. Serve him as you'd serve me. SOLOMON Sir. FORD And your faithfulness will not be forgotten. 1/24/13   FINAL SHOOTING SCRIPT   51. (CONTINUED)",
      "characters": [
        "CHAPIN",
        "TREACH"
      ],
      "action_text": "SOLOMON Yes, sir. FORD Pride and want have been my sin. Loss of you is but one of my punishments. EXT. FORD PLANATION - DAY 82   82  -END OF JANUARY, 1842- [OVER ONE DAY]  We see Solomon working as a carpenter, helping to erect a Weaving House that stands off to the side of the plantation's Great House. At the moment Solomon is nailing on siding.   Tibeats arrives and is immediately dissatisfied with the work. TIBEATS Make them boards flush. SOLOMON They are, sir. TIBEATS They is no such thing. Solomon runs his hands over the boards. SOLOMON As smooth to the touch as a yearling's coat. TIBEATS Callin' me a liar, boy? SOLOMON Only a matter of perspective, sir. From where you stand you may see differently.   But the hands are not mistaken.   I ask only that you employ all your senses before rendering judgement. What's Tibeats to do when faced with fact?   All he can do is spew invectives. TIBEATS You are a brute.   You are a dog, and no better for followin' instruction. SOLOMON I'll do as ordered, sir. 1/24/13   FINAL SHOOTING SCRIPT   52. CONTINUED: 81   81 (CONTINUED) TIBEATS Then you'll be up at daybreak. You will procure a keg of nails from Chapin and commence puttin' on clapboards. Tibeats wheels away.   Solomon goes back to his work. After a few moments Solomon notices a bit of commotion in the drive of the great house.   It involves an inconsolable Eliza who is being herded by Sam onto a cart DRIVEN BY A WHITE MAN.   Mistress Ford and Rachel watch. Solomon can only watch as the last connection to his days as a free man is driven away to a location unknown. EXT. WEAVING HOUSE - MORNING 83   83 It is day break.   As ordered, Solomon is up and working. Chapin is rolling a keg of nails off a handcart for Solomon. CHAPIN If Tibeats prefers a different size, I will endeavor to furnish them, but you may use those until further directed. SOLOMON Yes, sir. EXT. WEAVING HOUSE - LATER 84   84 As the day gets on to mid-morning, the sun already baking in the sky, Tibeats ma",
      "dialogue_count": 2,
      "word_count": 5022
    },
    {
      "scene_number": 12,
      "slugline": "EXT. ROAD - DAY A105   A105 Solomon is running flat out along the road.   Running as though his life depended on getting to his destination in beyond a timely manner. EXT. SHAW'S HOUSE - DAY B105   B105 Still running, slick with sweat, Solomon comes upon the SHAW HOUSE. As Solomon arrives: MASTER SHAW Platt Epps, good Sunday morning. SOLOMON Good morning, Master Shaw.   I've been sent by Master to retrieve Patsey.   May I approach? MASTER SHAW You may. Solomon makes his way over to the piazza. SOLOMON Excuse me, Mistress Shaw. MISTRESS SHAW Nigger Platt. SOLOMON My apologies.   Patsey, Master wishes you to return. PATSEY Sabbath day.   I's free ta roam. SOLOMON Understood.   But the Master sent me running to fetch you, and said no time should be wasted. MISTRESS SHAW Drink tea? SOLOMON Thank you, Mistress, but I don't dare. MISTRESS SHAW Would you knowed Massa Epps's consternation ta be any lessened wit your timely return?   Sit.   Sit and drink the tea that offered. 1/24/13   FINAL SHOOTING SCRIPT   69. (CONTINUED)",
      "characters": [
        "EPPS"
      ],
      "action_text": "Solomon knows better, but he sits and the Mistress has tea poured for him. MISTRESS SHAW (CONT'D) What'n was Epps's concern? SOLOMON ...I'd rather not say... MISTRESS SHAW L'il gossip on the Sabbath be fine.   All things in moderation. Solomon is not sure what to say.   He struggles to be as diplomatic as possible. SOLOMON As you are aware, Master Epps can be a man of a hard countenance. There are times when it is impossible to account for his logic.   You know he has ill feelings toward your husband. MISTRESS SHAW He do. SOLOMON Master Epps has somehow come to believe, as incorrectly as it may be, that Master Shaw is...   That he is something of a lothario and an unprincipled man.   A misguided belief born out of their mutual competition as planters, no doubt. MISTRESS SHAW No doubt...if not born outta truth itself. The Mistress waves to Shaw.   Shaw, unsuspecting of the conversation, waves back. SOLOMON I'm certain Patsey's well being is Master Epps's only concern. MISTRESS SHAW Nothin' Epps desire come outta concern. SOLOMON I meant no disrespect. MISTRESS SHAW He ain't heard you. 1/24/13   FINAL SHOOTING SCRIPT   70. CONTINUED: B105   B105 (CONTINUED) SOLOMON I meant no disrespect to you, Mistress. MISTRESS SHAW Ha!   You worry for me?   Got no cause to worry for my sensibilities.   I ain't felt the end of a lash in 'mo years than I cain recall.   Ain't worked a field, neither.   Where one time I served, now I got others servin' me.   The cost to my current existence be Massa Shaw broadcasting his affections, 'n me enjoyin' his pantomime of fidelity.   If that what keep me from the cotton pickin' niggers, that what it be.   A small and reasonable price to be paid 'fo sure. Looking toward Patsey, speaking with great empathy: MISTRESS SHAW (CONT’D) I knowed what it like to be the object of Massa's predilections and peculiarities.   And I knowed they can get expressed with kindness or wit violence.   A lusty visit in the night, or a visitation from the whip.   And ",
      "dialogue_count": 1,
      "word_count": 3886
    },
    {
      "scene_number": 13,
      "slugline": "EXT. TURNER PLANTATION - NIGHT (MOVED FROM 126) 126   126   * Secreted away out near the edge of the bayou and sitting by a small fire, Solomon takes the slip of paper from his fiddle.   It is yellowed, showing age, but still usable. Dipping the piece of cane - a quill - into the crushed berries, Solomon attempts to write a bit on the paper. The berry juice, too free-flowing, is unusable as ink. Solomon returns the paper to the fiddle.   He has some scraps of food with him, which he snacks on. OMITTED A127   A127   * INT. SLAVE SHACK - DAY A127A   A127A   * We see a sharp object scratching onto a surface.   The   * tool moves on to form another mark.   The sound is   * repetitive and almost unbearable.   As we move out, we see   * the names Anne, Margaret, Alonzo.   They are engraved onto   * the violin, in the hidden area where Solomon would rest   * his chin.   * Solomon looks at it for a moment, moving his fingertips   * across the engraving.   His face full of loss.   * Sadly, he lifts his instrument under his chin and leaning   * his head to the side as if to play.   * INT. YARNEY'S HOUSE - EVENING 127   127 A party has commenced at the noble home of one MR. YARNEY.   A group of REVELERS have gathered and are on the dance floor, in fancy dress. Their faces are covered with a variation of decorative masks. The party is a feast of celebration.   As entertainment, SOLOMON ACCOMPANIES A GROUP OF MUSICIANS, no more than three. And as he does so, they all play with jovial liveliness. Clearly a good time is being had by all. EXT. ROAD - NIGHT 128   128 His playing done for the evening, Solomon is returning to Judge Turner's on foot.   There is only the moonlight with which to light the way.   As he walks, Solomon eats from a HEARTY CHUCK OF BREAD.   Obviously part of his haul from the evening.   Solomon again hears noises coming from the brush just up ahead of him.   Solomon tears off some of the bread, kneels and holds it out before him. SOLOMON C'mere.   C'mon, boy. 1/24/13   FINAL SHOOTING SCRIPT   84. (CONTINUED)",
      "characters": [
        "CELESTE"
      ],
      "action_text": "This time, there is no dog.   Instead, from the dark and the brush step TWO BLACK MEN.   Solomon stands.   He looks the men over - their clothes tatters and they themselves covered in dirt.   It becomes quite clear they are not just slaves.   A fact confirmed when they step menacingly toward Solomon, ONE WITH A SHIV IN HAND. At first it seems they want Solomon's food or money. Worse, THEY GO FOR HIS FIDDLE. Solomon has but a moment to brace himself before he is attacked, TAKING A CUT TO THE ARM.   Solomon fights back, PICKING UP A PINE KNOT and striking his attacker over the head.   That takes the fight out of him, and both men retreat back the way they came leaving Solomon be. EXT. TURNER PLANTATION - NIGHT A129   A129 Outside of the slave shacks Solomon's wound tended by Uncle Abram.   As he works on it: UNCLE ABRAM Runaways I would expect.   The Bayou full with 'em.   They nothin' 'mo dangerous than a nigger in flight. SOLOMON They acted out of desperation. UNCLE ABRAM Act outta lunacy.   Heads fulla stories 'bout life up north.   Yah ever been north, Platt? SOLOMON ...No... UNCLE ABRAM And never should yah be.   I hope that yah never bear witness the sorry condition of the northern black.   Got neither no purpose, nor direction.   They jus...they jus fall about the streets in search of sustenance of both body and spirit. SOLOMON You know this to be so? UNCLE ABRAM Two of my massas tolt me. 1/24/13   FINAL SHOOTING SCRIPT   85. CONTINUED: 128   128 (CONTINUED) OMIT 129   129 EXT. TURNER PLANTATION - NIGHT 130   130  -FEBRUARY/MARCH, 1847-  Alone out on the edge of the Bayou, Solomon is playing a low air on his violin WHILE SNACKING ON SCRAPS OF BACON. As he plays, something appears in the distance.   From the edge of the bayou, coming forth like an apparition arisen from the earth, is CELESTE.   She is a young woman of about 19 years of age and far whiter than most blacks. \"IT REQUIRED CLOSE INSPECTION TO DISTINGUISH IN HER FEATURE THE SLIGHTEST TRACE OF AFRICAN ",
      "dialogue_count": 1,
      "word_count": 2404
    },
    {
      "scene_number": 14,
      "slugline": "EXT. EPPS'S PLANTATION/COTTON FIELD - DAY 140   140  -JULY, 1847-  The slaves are out working on the field.   White hands appear, picking cotton: ARMSBY. He is wholly unskilled at picking cotton, and he puts little effort into the job. As we meet him he seems a decent sort if a little short on self-motivation.   In anachronistic terminology, he'd be called a \"slacker.\" He joins in with the slaves, singing a spiritual. INT. MASTER EPPS'S PLANTATION/GIN HOUSE - EVENING 141   141 As Epps said, it is days of long since.   The slaves are back to having their cotton weighed in the Gin House EPPS Wiley...? TREACH Two hundred sixty pounds. EPPS Bob? TREACH Three hundred forty pounds for Bob. EPPS Patsey? TREACH Five hundred twenty pounds. EPPS Tha's a girl.   Don't never let me down.   Platt? TREACH One hundred sixty pounds. Before Treach is even done announcing the weight, Epps has pulled Solomon aside to where Uncle Abram already awaits his fate. EPPS Armsby? TREACH Sixty four pounds. Epps speaks to Armsby sternly, but nothing of the manner in which he would address the slaves. 1/24/13   FINAL SHOOTING SCRIPT   94. (CONTINUED)",
      "characters": [],
      "action_text": "EPPS A good days labor would average two hundred pounds. ARMSBY Yes, sir. EPPS I'm sure in time y'll develope as a picker, but it takes effort, boy.   Put some damn effort into it. ARMSBY Yes, sir. To Treach, regarding Solomon and Abram: EPPS Take 'em out.   Get to whippin'. No force is needed.   The slaves understand the situation. They follow Treach out of the Gin house. EXT. EPPS'S PLANTATION/SLAVE SHACK - NIGHT 142   142 We come in after the punishment has been dealt.   Patsey tends to Uncle Abram's back as Armsby applies liniments to Solomon's.   As he does, Armsby muses: ARMSBY It's a tragedy.   How does such come to pass?   Working a field and picking cotton like a lowly hand. I'm of a damn sight better station.   And my desires never lacked for a grandiose component, though I will admit they have at times been short on ingenuity. But only at times.   I've worked as an overseer, you know. SOLOMON I did not, sir. ARMSBY Not \"sir.\"   Just Armsby.   Not owed more than any other in the field. I worked plantations from Virginia, down into Alabama.   I could manage easy a hundred slaves and have done so.   But to toil in the field?   Never thought that would come to pass.   Never.   But times are desperate.   Where once I had said \"no\" to Epps and his merger offerings, I returned cap 1/24/13   FINAL SHOOTING SCRIPT   95. CONTINUED: 141   141 (MORE) (CONTINUED) in hand.   ...Look at what I've become. SOLOMON How did you arrive at such a place, if I may ask? ARMSBY Ask.   It's just conversation. From a pocket Armsby produces a flask. ARMSBY (CONT'D) I became a little too dependant on the whisky, a little too undependable on the job.   Before you say I'm just a sorry drunkard, let me state my case:   As reliable employment as overseeing is, it's no easy chore on the spirit.   I say no man of conscious can take the lash to another human day in, and day out without shredding at his own self.   Takes him to a place where he either makes excuses within his mind to be unaf",
      "dialogue_count": 0,
      "word_count": 1305
    },
    {
      "scene_number": 15,
      "slugline": "INT. EPPS'S PLANTATION/ARMSBY'S SHACK - LATER 150   150 The door opens.   Solomon enters.   Armsby is surprised to see him.   So much so, he isn't sure what greeting to give.   Solomon gives a blunt introduction.   Re: the coins: SOLOMON The proceeds of my fiddling performances.   A few picayunes, but all I have in the world.   I promise them to you if you will do me the favor I require.   But I beg you not to expose me if you cannot grant the request. ARMSBY What do you ask? SOLOMON First, your word, sir. ARMSBY On my honor. SOLOMON It is a simple enough request.   I ask only that you deposit a letter in the Marksville post office. And that you keep the action an inviolable secret forever.   The details of the letter are of no consequence.   Even at that, there would be an imposition of much pain and suffering were it known I was the author.   A patron is what I require, sir. ARMSBY Where's the letter now? SOLOMON ...It is not yet written.   I will have it in a day.   Two at most, my skill with composition as poor as it is. Armsby considers the request. ARMSBY I will do it.   And will accept whatever payment is offered. Solomon hesitates.   In the moment, he's not so sure he can wholly give himself over to trust. 1/24/13   FINAL SHOOTING SCRIPT   99. (CONTINUED)",
      "characters": [
        "ARMSBY"
      ],
      "action_text": "EPPS Well, boy.   I understand I've got a larned nigger that writes 1/24/13   FINAL SHOOTING SCRIPT   100A. CONTINUED: 153   153 (MORE) (CONTINUED) letters and tries to get white fellows to mail 'em. Solomon, hardly missing a beat, plays this off. EPPS (CONT’D) Well, Armsby tol' me today the devil was among my niggers.   That I had one that needed close watchin' or he would run away. When I axed him why, he said you come over to him and waked him up in the middle of the night and wanted him to carry a letter to Marksville.   What have yah got to say to that? SOLOMON All I have to say, master, is all that need be said.   There is no truth in it. EPPS You say. SOLOMON How could I write a letter without ink or paper?   There is nobody I want to write to 'cause I hain't got no friends living as I know of.   That Armsby is a lying drunken fellow.   You know this, just as you know that I am constant in truth.   Now, master, I can see what that Armsby is after, plain enough.   Didn't he want you to hire him for an overseer? A beat. SOLOMON (CONT’D) That's it.   He wants to make you believe we're all going to run away and then he thinks you'll hire an overseer to watch us.   He believes you are soft soap.   He's given to such talk.   I believe he's just made this story out of whole cloth, 'cause he wants to get a situation.   It's all a lie, master, you may depend on't. It's all a lie. For a tense moment we are unsure which way Epps'll go. Increasingly it become apparent that, shallow minded and equally soused, Solomon has been able to fold Epps's thoughts.   In a low curse that clearly states his ill intentions. 1/24/13   FINAL SHOOTING SCRIPT   101. CONTINUED: (2) 153   153 EPPS (CONT'D) (CONTINUED) Revealed is a pocket knife, which all through the conversation, unknown to us the audience, was pushed up against Solomon's stomach. As Epps speaks, he closes it and taps it on Solomon's shoulder. EPPS I'm damned.   I'll be god...   Were he not free and white, Platt. Were he n",
      "dialogue_count": 1,
      "word_count": 4142
    },
    {
      "scene_number": 16,
      "slugline": "EXT. ROAD BY EPPS' PLANTATION - EVENING A168   A168 Solomon sits on a secluded part of the road, fiddle in hand.   He stares across the expanse.   His eyes fixed on something that is a million miles away. Slowly Solomon tunes his fiddle, turning the tuning peg tighter and tighter. As the strings are taut, the sound is almost unbearable as Solomon tightens bit by bit, as if bones are being cracked one by one. Just beyond the breaking point of sound, there is a snap. He then repeats the action. Solomon holds the neck of the violin. Sliding his thumb and forefinger down the neck, he methodically cracks it at the base. He carefully snaps the neck and removes it from the body, then snaps it in two, placing it on the ground. He then starts on the body. Heaving it on the ground, it falls apart. Methodically he breaks the violin into small bits - silencing the instrument with a hushed display of violence, rather than aggressive. Seems almost to be, in an odd way, respectful. EXT. MASTER EPPS'S PLANTATION/FIELD - DAY 168   168  -FEBRUARY, 1853-  The Slaves are sewing the heavily plowed field, making their way in the trying soil. Solomon, too focused to note the arrival of two men by carriage: Parker and the SHERIFF. While the Sheriff makes his way to the field, Parker remains with the carriage.   The Sheriff calls: SHERIFF Platt...?   Where is the boy called Platt? SOLOMON ...Sir... The Sheriff crosses to him. SHERIFF Your name is Platt, is it? SOLOMON Yes, sir. Pointing off to the distance. SHERIFF Do you know that man? 1/24/13   FINAL SHOOTING SCRIPT   118. (CONTINUED)",
      "characters": [
        "EPPS"
      ],
      "action_text": "Solomon looks toward the carriage.   He has to shield his eyes from the sun.   Recognition is slow coming to him. But when it does, it hits him as a rush. SOLOMON Mr. Parker...? 1/24/13   FINAL SHOOTING SCRIPT   118A. CONTINUED: 168   168 (CONTINUED) Solomon starts for Parker, but he is pulled back by the Sheriff who is keen to determine Solomon's true identity. SHERIFF Say again? SOLOMON Mr. Parker? As he does, Epps makes his way over. SHERIFF That man received a letter compiling many accusations.   You look me in the eye and on your life answer me truthfully: have you any other name than Platt? SOLOMON Solomon Northup is my name. EPPS Sheriff... SHERIFF Have you a family? EPPS What's all this? SHERIFF It's official business. EPPS My nigger, my business. SHERIFF Your business waits. (to Solomon) Tell me of your family. SOLOMON I have a wife and two children. SHERIFF What were your children's names? SOLOMON Margaret and Alonzo. SHERIFF And your wife's name before her marriage? SOLOMON Anne Hampton.   I am who I say. Solomon pushes past the sheriff.   As Solomon moves toward Parker, his pace quickens with each step until his 1/24/13   FINAL SHOOTING SCRIPT   119. CONTINUED: (2) 168   168 (CONTINUED) personal velocity has him nearly at a dead run.   The two old friends make contact with each other, wrap each other in a long and emotional embrace.   It if finally broken by Epps, who has moved over with the Sheriff. 1/24/13   FINAL SHOOTING SCRIPT   119A. CONTINUED: (3) 168   168 (CONTINUED) EPPS Nah...   You will unhand 'em. Platt is my nigger! PARKER He is Solomon Northup. EPPS You say... PARKER He belongs to no man. EPPS You say!   You come here, unfamiliar to me, and make claims. SHERIFF Not claims.   I have no doubts. This is Solomon Northup, a resident of Saratoga Springs, NY. EPPS To hell with that!   My nigger, and I'll fight you for 'em! PARKER As is your right.   As it will be my pleasure to bankrupt you in the courts.   Your decision. By this time, the slaves",
      "dialogue_count": 1,
      "word_count": 1529
    }
  ]
}