{
  "slug": "13-reasons-why-101-tape-1-side-a-2017",
  "title": "13 reasons why 101 tape 1 side a",
  "genre": "romance",
  "format": "series",
  "scenes_count": 4,
  "characters_count": 0,
  "characters": [],
  "total_words": 9106,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. CLAY’S HOUSE - GARAGE - FOLLOWING  Clay sets the tapes, loosely cushioned in the bubble wrap, on  the workbench. Reaches to a shelf and pulls down a paint-  spattered Panasonic boom box.  He runs the plug to a power strip on the side of the  workbench. Studies the front of the boom box, guesses at a  button -- and guesses right. The tape drawer pops open.  Clay perches on a stool and unwraps the tapes again. Finds  TAPE 1, turns it to SIDE A, bends to slide it into the  player. Closes the drawer and presses play.  HANNAH (ON TAPE PLAYER)  Hey. It’s Hannah. Hannah Baker.  Clay sits up straight. It can’t be.  HANNAH (ON TAPE PLAYER) (CONT’D)  Don’t adjust your -- whatever  device you’re hearing this on. It’s  me. Live and in stereo.  FLASH ON:  HANNAH  Short-hair present-day Hannah. At an old-school microphone,  attached to a cassette recorder.  HANNAH  I’m about to tell you the story of  my life.  BACK TO:  GARAGE  As Clay watches the unspooling tape.  HANNAH (ON TAPE PLAYER)  More specifically, why my life  ended. And if you're listening to  this tape -- you're one of the  reasons why.  CLOSE on Clay as this lands.  CUT TO BLACK.  END ACT ONE.  11.",
      "characters": [],
      "action_text": "ACT TWO.  OPEN ON:  CLOSE ON TAPE PLAYER  The novel (nowadays) sight of two spinning spindles behind  the plastic door of the cassette player.  HANNAH (ON TAPE PLAYER)  I’m not saying which tape brings  you into the story.  REVEAL  INT. CLAY’S HOUSE - GARAGE - NIGHT - AS BEFORE  Clay at the workbench, listening, riveted.  HANNAH (ON TAPE PLAYER)  But fear not, if you received this  lovely little box, your name will  pop up... I promise.  Clay reaches to adjust the volume.  HANNAH (ON TAPE PLAYER) (CONT’D)  Anyway. The rules are pretty  simple. There are only two --  MRS. JENSEN (O.S.)  Whatcha doin’?  Clay gives a start. MRS. JENSEN(40’s), bright, involved,  lovely in a simple way, stands in the doorway to the house.  She regards Clay warmly, but with caution.  CLAY  Whoa! Jesus.  (frantically searches for  stop button)  What have we said about helicopter  parenting, Mom?  MRS. JENSEN  I wasn’t hovering --  CLAY  You’re always hovering --  MRS. JENSEN  I said your name.  12. CLAY  You did?  MRS. JENSEN  (indicates stereo)  You were lost in that -- What is it  you’re listening to?  CLAY  It’s, uh, for history class.  He ejects the tape, starts to gather them up, concealing them  in the bubble wrap. Mrs. Jensen approaches,  MRS. JENSEN  Cassettes are history now. Of  course they are. Can I listen?  CLAY  It’s dumb. Just a bunch of boring  old -- you don’t want to --  He can’t get them all wrapped up fast enough -- she picks one  up. Considers it fondly -- as Clay hides his freakout.  MRS. JENSEN  I used to make your dad mix-tapes,  back in college. I would spend  hours agonizing over choosing just  the   right   song.  CLAY  Don’t -- I mean, I need that --  MRS. JENSEN  Would he think I had bad taste in  music? Would he understand what I  was trying to say?  CLAY  Why didn’t you just tell him? Like,  send him... I guess it would be a  note, of some sort, on paper? Did  you have paper back then?  MRS. JENSEN  Why don’t you bring this inside?  I’ve got pork chops for di",
      "dialogue_count": 0,
      "word_count": 1544
    },
    {
      "scene_number": 2,
      "slugline": "EXT. TONY’S HOUSE - NIGHT - LATER  A more modest neighborhood. Working class, but in a town  where the working class can earn a living. A ‘65 MUSTANG,  cherry red, hood open, two figures bent over the engine.  CLAY  Another breakdown? Or just for fun?  TONY (17) turns. He’d be a greaser in another day, McQueen  cool, James Dean sensitive, dark-featured but bright-eyed  behind his classic shop-teacher spex. Still waters.  TONY  It didn’t break down. We’re just --  (gestures at the engine;  knocks a flashlight over)  Damn. Hold on.  TONY’S DAD (40s) pokes his head out from under the hood.  TONY’S DAD  When is it not fun? It’s even more  fun when it’s serious.  TONY  (reaching for flashlight)  Dad, you remember Clay.  TONY’S DAD  (doesn’t)  Sure. How are you, Clay?  CLAY  I’m well, thank you.  Tony emerges with the flashlight.  TONY  So, Clay, what’s up?  CLAY  Not much.  TONY  Just... out for a ride on the  completely opposite side of town?  CLAY  I was going to the -- to the  library. Thought I’d stop by.  Tony considers him with an odd, not-unfriendly half-grin.  Clay has no answer. Tony’s dad saves the day:  19.",
      "characters": [],
      "action_text": "TONY’S DAD  Wait! I remember you. You stayed  for dinner once. Big on “please”  and “thank yous.”  CLAY  That was me.  TONY’S DAD  My wife was on us for a month to be  more polite.  CLAY  Sorry about that. It’s ingrained.  TONY’S DAD  Well, make yourself useful, Clay.  Slip on in the driver’s seat there,  and try the ignition for us.  CLAY  Okay. Sure.  TONY’S DAD  If we’ve got this at the right  tension, we’ll hear it.  Clay walks around to the driver’s side, and slides in.  TONY’S DAD (CONT’D)  Okay, go ahead, flip the ignition.  Clay does and the Mustang roars to life.  TONY’S DAD (CONT’D)  Woo-Hoo! See there, son? Hear that  purr?  TONY  It’s the same purr it had before.  Clay sees a Walkman on the floor, passenger side.  TONY’S DAD  We’ve fine-tuned her.  (calling)  You can shut her off now, Clay.  Clay turns the car off, reaches for the Walkman, and shoves  it into his hoodie pocket before climbing out of the car.  TONY’S DAD (CONT’D)  I’m about to heat up some  leftovers. Care to join?  20. CLAY  (hands in pocket)  Oh. No, thank you. I should be  getting home.  TONY’S DAD  You guys’ve had a rough week at  school, from what I hear.  TONY  (to Clay)  They e-mailed the parents.  CLAY  Yeah, I know.  TONY’S DAD  Usually I delete, but I just --  TONY  It’s all fine, Dad. Nothing to  worry about.  Tony wanders away, stopping by the passenger window when  something inside catches his eye. Clay holds his breath.  TONY’S DAD  Did the girl even leave a note?  TONY  Dad. You can leave it alone.  Tony reaches in the passenger window and looks around, on the  seat, the floor, where the Walkman was. Clay holds his breath.  TONY’S DAD  All right, all right. But listen to  me, you do something like that to  your mother, I will kill you, you  understand me? I will kill you  dead.  Tony’s Dad lets the hood drop with an emphatic bang. Tony  emerges from the passenger side... with a wrench in hand.  TONY  Gotcha, dad.  (watches his dad wander up  to the house)  No sense of the i",
      "dialogue_count": 0,
      "word_count": 6198
    },
    {
      "scene_number": 3,
      "slugline": "INT. PEER COMMUNICATIONS CLASSROOM - DAY - FRESHMAN YEAR  Tyler, younger, slips into the classroom. Most of the class  is assembled as the BELL RINGS. Justin, Zach, and a few JOCKS  and a CHEERLEADER sit near the back. Hannah hurries in, and  slips into her desk, just in time to overhear them:  JUSTIN  Yeah. All the way up her skirt.  ZACH  Holy shit. So did you...?  JUSTIN  Total fingerbang. She was so loose  I had almost my whole hand up in  there.  JOCK  No way. Don’t believe you.  Hannah turns, just as Justin finishes something with his  phone and slides it into his pocket.  CHEERLEADER  Justin, shut up. That’s totally  gross. And she’s disgusting.  Hannah turns back, her face burning.  MRS. BRADLEY  Today we’re discussing ways to  navigate difficult interactions.  Somewhere in the classroom a phone PINGS. Then another.  MRS. BRADLEY (CONT’D)  People. Please at least give a nod  in the direction of our no-devices  rule.  A few more PINGS and vibratory BUZZES before students start  to silence their phones -- and check the screens.  MRS. BRADLEY (CONT’D)  We’re talking about how   to address  conflicts with our peers. How we  can communicate more effectively...  (tries a joke)  ...without the use of emojis.  Clay’s own phone BUZZES in his pocket. As other students  snicker and gasp at their own, finally, he pulls his out, and  looks at it, tucked under the desk...  52.",
      "characters": [],
      "action_text": "MRS. BRADLEY (CONT’D)  I need two volunteers for a little  role-playing exercise.  ...and sees an Instagram alert on his home screen. Slides his  thumb -- and it’s an pic of Hannah, sliding down the slide,  her skirt caught on the slide and pulled up above her waist.  HANNAH (V.O.)  Eventually, as they always do, the  rumors reached me.  He throws a glance at Hannah, and sees tears welling up in  her eyes. He quickly looks away, but she catches him looking.  HANNAH (V.O.)  And as everyone knows, you can’t  disprove a rumor.  CLOSE on Clay, regret in his eyes, we move  BACK TO PRESENT:  Clay looks back in Hannah’s direction, and her desk is empty.  Once again, Mrs. Bradley is discussing something else  entirely in exactly the same tone.  MRS. BRADLEY  We’ll continue our discussion of  non-verbal signals tomorrow...  INT. SCHOOL CAFETERIA/LUNCH - DAY - PRESENT  Tony sits in the back corner of the cafeteria. He is reading  a weathered copy of Kerouac’s   On the Road   and eating a sack  lunch. Clay charges up to the table.  CLAY  What did you do to her?  TONY  Hey, Clay.  CLAY  What’s the deal? How do you fit in  to all of this?  TONY  I’m not on the tapes, if that’s  what you’re asking.  CLAY  Did you help her do it?  53. TONY  (dead calm)  No. I did not.  CLAY  Did you know she was going to?  TONY  No.  CLAY  Then how the hell --  TONY  Listen to the tapes.  CLAY  Is that all I’m gonna get?  It is.  TONY  Hannah wanted it done like this.  CLAY  How do you know?  TONY  Listen to the tapes.  CLAY  What if I don’t? What if I can’t?  TONY  Then it’ll only get worse.  CLAY  Worse than Hannah being dead?  Tony doesn’t give him an answer. He gathers his lunch to go.  TONY  Keep listening, Clay.  CLAY  Am I side two?  Tony shoots him a look that’s not without sympathy -- but  then he walks away. Clay slumps into a chair. On Clay we  FLASH BACK TO:  54. FRESHMAN YEAR  HANNAH (O.S.)  Hey, Helmet. Can I eat with you?  Clay looks around the cafeteria and sees people watching him",
      "dialogue_count": 0,
      "word_count": 1152
    },
    {
      "scene_number": 4,
      "slugline": "INT. LIBERTY HIGH - HALLWAY - DAY -  Vance Joy SINGS “Mess is Mine” as the final BELL RINGS and  students tear from classrooms. One among them moves slowly.  Clay. He stares down the hall:  Hannah, long-haired and lovely, moving away from him. She  looks over her shoulder and gives him a sad, sweet smile. But  keeps walking.  HANNAH (V.O.)  I know you didn't mean to let me  down, Justin.  Faces turn and look at Clay. Courtney. Zach. Bryce. Tyler.  Ryan. And others. What do they know?  HANNAH (V.O.)  In fact, most of you listening  probably had no idea what you were  truly doing. But you'll find out.  Clay continues down the hall and out the doors.  INT. CLAY’S HOUSE - CLAY’S ROOM - DAY  Clay sits at his desk. The Walkman on the desk before him,  earbuds wrapped around it. He just stares at it.  HANNAH (V.O.)  Turn the tape over for more.  Finally he picks it up. Unwraps the earbuds and puts them in,  left, then right. Opens the tape deck, takes the tape out,  studies it: The \"1\" in blue nail polish. Turns it over: \"2\".  Stares at that “2”. Puts the tape back in. Bites his lip.  And presses play.  CUT TO BLACK.  END OF EPISODE.  58.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 212
    }
  ]
}