{
  "slug": "20th-century-women-2016",
  "title": "20th century women",
  "genre": "romance",
  "format": "film",
  "scenes_count": 18,
  "characters_count": 0,
  "characters": [],
  "total_words": 17161,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. OCEAN - DAY High overhead shot looking down on the Pacific Ocean. TITLE:   SANTA BARBARA, 1979. EXT. SANTA BARBARA - VONS PARKING LOT - DAY WIDE ON a plume of black smoke rising high into the air. CLOSER ON a 1965 Ford Galaxy engulfed in flames. DOROTHEA (55, short grey hair, Amelia Earhart androgyny) and JAMIE (15, New-Wave/Punk) jog their shopping cart toward the commotion, stunned to find their car in flames. Dorothea looks at the car and then at her son Jamie, concerned. People run for help. Sirens in the background. DOROTHEA (V.O.) That was my husband’s Ford Galaxy. We drove Jamie home from the hospital in that car. JAMIE   (V.O.) My mom was 40 when she had me.   Everyone told her she was too old to be a mother. VISUALS 1. BABY IN ISOLETTE DOROTHEA (V.O.) I put my hand through the little window, and he’d squeeze my finger, and I’d tell him life was very big, and unknown; VISUALS 2. DOROTHEA’S HAND OPENING ISOLETTE WINDOW AND PUTTING HAND THROUGH 3. BABY’S FINGERS HOLDING HAND 4. STARS IN SPACE JAMIE (V.O.) And she told me that there were animals and sky and cities, VISUALS 5. MUYBRIDGE FOOTAGE OF ANIMALS 6. STILL OF THE SKY 7. CITY FROM DOROTHEA’S ERA DOROTHEA (V.O.) Music, movies. He’d fall in love, have his own children, have passions, have meaning, have his mom and dad. VISUALS 8. BACK TO DOROTHEA’S HAND OPENING ISOLETTE WINDOW AND PUTTING HAND THROUGH 9. BABY’S FINGERS HOLDING HAND.",
      "characters": [],
      "action_text": "JAMIE (V.O.) When they got divorced, my father moved back east and left the car with us. He calls on birthdays and Christmas. Last time I felt close to him was on my birthday in 1974, he bought me mirrored sunglasses. I saw the president fall down the stairs, and I threw up on the carpet. VISUALS 1. 15 YEAR OLD JAMIE ON PHONE DOING A REQUIRED CALL WITH HIS FATHER 2. HANDS DELIVER MIRRORED SUNGLASSES TO 8 YEAR OLD JAMIE ON MINIATURE GOLF COURSE 3. PRESIDENT FORD FALLS DOWN STAIRS ON THE TV AT GOLF AND FUN 4. WORKER CLEANS STAR FIELD CARPET IN ARCADE INT. DOROTHEA’S LIVING ROOM Dorothea and Jamie slouch on couch, with “JEEVES” the cat, watching her favorite film CASABLANCA. DOROTHEA (V.O.) Since then it’s just been us. Track in on television playing the famous end of the film. RICK / BOGART You’re getting on that plane. ILSA / BERGMAN I don’t understand what about you? RICK / BOGART I’m staying here with him till the plane get’s safely away. ILSA / BERGMAN No Richard, what has happened to you, last night.... BACK TO VONS PARKING LOT: THE HULK OF THE CAR SITS IN A FOAMY WHIPPED CREAM PUDDLE. THE FIRE DEPARTMENT CLEANS UP. POLICE ARE THERE. DOROTHEA IS GREGARIOUS WITH THE FIREMEN WHO WORK AROUND HER. JAMIE WATCHES, STILL STUNNED, LIFE’S SURPRISES. DOROTHEA Listen, Captain.   I am having a party tonight, it’s my birthday actually, and I would like you to drop by so I can feed you  2. FIRE CHIEF It’s not necessary Mrs. Fields. DOROTHEA It’s Dorothea - no, I insist, please? That way I can thank you. She hands her address to them. EXT. PARKING LOT - SIDE OF FIRE TRUCK - DAY Jamie and Dorothea sit on a side bumper of a fire truck, movement around them. They look small, sit close, groceries at their feet. Dorothea watches Jamie. The fire scared her. She looks vulnerable. DOROTHEA That was a beautiful car. JAMIE Mom, it smelled like gas and overheated all the time, and it was just old... Dorothea’s surprised, she didn’t know they felt so differently about the car. DOROTHEA (Wh",
      "dialogue_count": 0,
      "word_count": 682
    },
    {
      "scene_number": 2,
      "slugline": "INT. MARY’S THERAPY PLACE - DAY Camera pans across teen therapy girl (IMPROVISE THERAPY TALK), sees a circle of 6 other teen girls having therapy, lands on JULIE (17, Something subversive below her good looks) similarly bored. The therapist MARY, (40’s academic) listens. Julie stares at Mary, criticality brewing inside of her. EXT. OUTSIDE MARY’S OFFICE Julie lights up a cigarette, her real self, gets on her bike. EXT. MONTECITO STREETS - DAY Julie smokes and rides her bike, her real self more on view. INT. OBGYN OFFICE ABBIE (28, Sophisticated NYC art-punk type) stands in gown in OBGYN office, looking confused, vulnerable, but armed with a late 70’s clunky Nikon camera. She studies her doctor putting a swab into a tube, writing her name; she takes a photograph. Turns and takes a photo of the room, her doctor is used to this. She watches an assistant come in and take the swab (and her future fate) in its plastic container away - go down the hall, and disappear around a corner. INT. HOSPITAL HALLWAY The technician carries the little swab down the hall, in a clear plastic bag. INT. DOROTHEA’S SIDE DOOR Abbie walks in, looking lost, puts her bag down in the kitchen. INT. ABBIE’S ROOM Now in her room, Talking Heads playing loudly, her pain peaks and she begins to dance alone. EXT. DOROTHEA’S HOUSE Julie rides her bike past a line of old VWs and an old 30’s Chevy. INT. DOROTHEA’S HOUSE Julie enters the house, walks towards WILLIAM (Mid 40’s post hippie type).  4.",
      "characters": [],
      "action_text": "William takes on a major job on his own (tearing down ceiling in entry way). Reveal that this is a big house, needing repair under serious renovations. WILLIAM Oh, hey, sorry.   Jamie’s not here right now. Julie walks past this. Follows the sound of music upstairs. INT. HALLWAY/ABBIE’S ROOM Julie can see Abbie dancing through a partially opened door, Abbie captivates her, she walks towards the room, Abbie sees her, snaps out of her dancing, turns off the record. Julie enters, Abbie’s still troubled by her OBGYN visit, Julie can’t really take her eyes off Abbie. ABBIE They’re not home. Abbie takes her picture. JULIE Don’t. That doesn’t stop Abbie. Not mean, just stubborn. ABBIE I’m taking pictures of everything that happens to me in a day. JULIE I don’t like having my picture taken. I didn’t happen to you. She takes another. INT. DOROTHEA’S KITCHEN AREA Dorothea and Jamie make their way to the kitchen with all the groceries. DOROTHEA Hello.  5. WILLIAM Hey. William enters and helps them, Julie and Abbie enter a beat later. DOROTHEA Hi. She hands William a bag of groceries. DOROTHEA You aren’t going to believe what happened. JAMIE Our car burst into flames in the parking lot. JULIE Seriously? WILLIAM You OK? ABBIE How did it happen? DOROTHEA I don’t know, they said probably just something electrical. We walked out and it was just sitting there, on fire. Life’s surprises. WILLIAM Oh man, I’m sorry. Everyone’s perplexed. William helps unload groceries. Julie and Jamie IMPROV in background.  6. DOROTHEA PULLS ABBIE ASIDE, LOOKS AT HER, ABBIE DOESN’T WANT TO SHARE. DOROTHEA So, what happened? ABBIE They never tell you anything, I won’t know for like a week. Dorothea gives her an encouraging look. ABBIE (CONT’D) I’m gonna be late on rent. DOROTHEA That’s okay, Don’t worry about that. ABBIE Thanks. Abbie looks at Dorothea with love and admiration. INT. JAMIE’S BEDROOM - DAY Jamie lies flat on his bed. Julie’s next to him, processing, earnestly worried for him. JULIE What if",
      "dialogue_count": 0,
      "word_count": 1630
    },
    {
      "scene_number": 3,
      "slugline": "INT. SCHOOL - ADMINISTRATION OFFICE - DAY 12 year old Jamie walks in and hands a note to the secretary. CLOSE ON the note. DOROTHEA (V.O.) Please excuse Jamie from school this morning, he was doing volunteer work for the Sandinistas. The secretary looks incredulous, but files the note and let’s Jamie head to class. DIFFERENT DAY: Jamie walks in, hands over a note. CLOSE ON note. DOROTHEA (V.O.) Please excuse Jamie from school this morning, he was involved in a small plane accident, fortunately he was not hurt. The secretary looks up at Jamie and files the note. INT. DOROTHEAS HALLWAY - NIGHT - 1979 William tries to teach Jamie how to help out around the house with Dorothea’s encouragement. IMPROVISE TALKING ABOUT RENOVATIONS. WILLIAM You’re going to be in for a legendary surprise. It’s mahogany underneath. JAMIE V.O. She’s always trying to bring a man into my life. WILLIAM This is probably Honduran mahogany, really fine grain... CUT TO Dorothea and Jamie whispering away from William. JAMIE This is like, really boring, he’s talking about wood and stuff. DOROTHEA Hey watch it, he’s helping me out, restore the house O.K.?  13.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 194
    },
    {
      "scene_number": 4,
      "slugline": "INT. DOROTHEA’S 1975 KITCHEN - MORNING - 1975 JAMIE (V.O.) She writes down her stocks every morning, 10 YEAR OLD Jamie’s and Dorothea’s backs as they’re hunched over the stock reports, writing down the day’s numbers. DOROTHEA IBM? JAMIE $213.20 DOROTHEA GE? JAMIE $51.62 JAMIE She smokes Salems because they’re healthier, wears Birkenstocks because she’s contemporary. She read  Watership Down   and learned how to carve rabbits out of wood. And she never dates a man for very long. VISUALS 11. SALEMS 12. HER BIRKENSTOCKS 13. DOROTHEA WORKS IN HOME OFFICE 14. DOROTHEA READING ALONE IN BED SMOKING. INT. DOROTHEA’S FRONT DOOR / BACK TO DOROTHEA’S BIRTHDAY PARTY The partygoers are heading out, Dorothea saying her good-byes. In foreground Julie whispers with Jamie. JULIE See you later? JAMIE Just don’t hang out with that Chris guy anymore, okay? He’s a skeez and he’s kind of dumb. JULIE Exactly.  14.",
      "characters": [],
      "action_text": "Turns to Dorothea as she leaves, JULIE Happy birthday. DOROTHEA Bye Julie. She leaves Jamie and Dorothea alone on the doorstep. JAMIE Stop. DOROTHEA What? JAMIE Thinking you know everything that’s going on. DOROTHEA Having your heart broken is a tremendous way to learn about the world. INT. DOROTHEA’S KITCHEN - CONTINUOUS They’re alone now, doing the dishes together, he studies her. JAMIE Do you think you’re happy, like as happy as you thought you’d be when you were my age? DOROTHEA Seriously, you don’t just ask people questions like that. JAMIE You’re my mom. DOROTHEA Especially your mom. Look, wondering if you’re happy is a great shortcut to being depressed.  15. He looks at her disappointed. INT. KITCHEN - NIGHT Dorothea is alone. Lost in thought. An ironing board in the background. Just smoking and thinking. Then, from above, PUNK plays. She looks up, in the direction of the sound. Rises. INT. ABBIE’S ROOM - NIGHT Jamie and Abbie sit together, listening to The Raincoats - Fairytale In The Supermarket. Abbie’s looking at the cover, Jamie’s looking through her other records. Dorothea appears in the doorway, observing her son, and his obvious love of this. She enters, sits down and listens with them, an awkward moment. DOROTHEA What is that? ABBIE It’s The Raincoats. She nods awkwardly to the beat, trying to relate. DOROTHEA Can’t things just be pretty? JAMIE “Pretty” music’s used to hide how unfair and corrupt society is. DOROTHEA Ah, okay so... they’re not very good, and they know that, right? He just looks at her - ‘why’re you still here’ - she looks at him confused by his pushing her away. Seriously curious. ABBIE Yea, it’s like they’ve got this feeling, and they don’t have any skill, and they don’t want skill, because it’s really interesting what happens when your passion is bigger than the tools you have to deal with it.   It creates this energy that’s raw.   Isn’t it great?  16. CU on Dorothea feeling like an outsider, lost. INT. DOROTHEA’S BEDROOM Dorothea ",
      "dialogue_count": 0,
      "word_count": 1125
    },
    {
      "scene_number": 5,
      "slugline": "INT. STAIRS - DAY Jamie walks ahead going up the stairs. She walks behind, eying him. Her worry and fear rising, until she says... DOROTHEA Why did you do something so - stupid (dangerous). JAMIE I don’t know mom, everyone was doing it. Escalating fear and anger with each line. DOROTHEA So you just went along with it? JAMIE It looked like fun. DOROTHEA That’s just dumb.   Why would you do something so stupid? Just following along? You know you almost died, right? He gets very defensive, feels attacked. JAMIE You don’t need to worry about me. She doesn’t buy it. DOROTHEA Why don’t you think? He turns away from her. DOROTHEA (CONT’D) Jamie, hey. What’s going on with you? He walks off to his room. She follows. INT. JAMIE’S ROOM - CONTINUOUS She storms into his room, when she enters he heads to the other side. Dorothea’s quite angry now.  20.",
      "characters": [],
      "action_text": "DOROTHEA (Jamie?!) What? You won’t talk to me now? He confronts her like he never has before. JAMIE I’m not the one who doesn’t talk. Dorothea’s surprised. DOROTHEA What? Come on, you scared the hell out of me.   Why did you hurt yourself like that? JAMIE Why do you smoke yourself to death? (Some specificity) Why don’t you go on dates? DOROTHEA (Shocked) Hey- Jamie is terrified, but he can’t stop. JAMIE Why’re you fine being sad and alone? DOROTHEA We don’t talk to each other like that. (What’s happening to you.) He storms off, she’s struck, she sits alone, she cries. INT. DOROTHEA’S LIVING ROOM - NIGHT Dorothea, still struggling, enters the living room, a movie plays blankly on the TV, she’s surprised to find Jamie asleep on the couch. She sits and looks at him, something she doesn’t get to do in peace anymore - thinking as she looks at him.  21.",
      "dialogue_count": 0,
      "word_count": 307
    },
    {
      "scene_number": 6,
      "slugline": "EXT.   EAST BEACH - DAY WIDE ON a beautiful beach in afternoon sun. In street clothes, they look out of place surrounded by bikini-shorts clad happy beachgoers. Dorothea looks at the girls, nervous. She starts walking. DOROTHEA I think history’s been tough on men, they can’t be what they were, and they cant figure out what’s next. ABBIE What’re we talking about? Dorothea struggles, wants them just to understand. JULIE Men? ABBIE I think history and men? They stand talking on the beach... CONVERSATION PRELAPS... DOROTHEA I think maybe you guys... INT. KITCHEN - DAY CLOSE on Dorothea - conversation continues. She is vulnerable. Seated at the table with Abbie and Julie. DOROTHEA ...could help me - with Jamie. Julie and Abbie look to each other and Dorothea. What’s she asking? DOROTHEA (CONT’D) He needs help figuring out how to be himself in all this mess. And I can’t be there, I can’t be there with him, I need to let go.  22.",
      "characters": [],
      "action_text": "JULIE Is this because of the fainting thing? He’s fine. DOROTHEA (No) it’s because of everything. ABBIE I don’t understand what you’re asking. DOROTHEA How do you be a good man? I don’t know how you do that nowadays. He’s only got me, I mean, it’s not enough. JULIE You’re serious? ABBIE What about William? He’s a guy, wouldn’t he be better for this? The girls look at each other, they take this more seriously. DOROTHEA Have you ever seen them have a conversation? Very vulnerable for Dorothea, like a failure. DOROTHEA (CONT’D) He doesn’t connect to men. He likes you two... he likes you two a lot. ABBIE But what if I’m not good at it?  23. JULIE He’s my friend, I don’t want to be his mom. DOROTHEA No, I’m his mom. JULIE Don’t you need a man to raise a man? DOROTHEA I don’t think so. I think you’re what’s gonna work for him. The girls don’t know what to think. DOROTHEA (CONT’D) He just has me, think about it, that’s not enough. I/E. MONTECITO STREETS - DOROTHEA’S CAR - DAY From inside Dorothea’s car we watch Jamie skateboarding down a steep street. Dorothea loves this, we see her smile at his taking flight. MOMENTS LATER: The car is parked at the bottom of the hill. She’s just delivered the news. Jamie’s angry, mortified, confused. She’s more vulnerable and scared than she knows. JAMIE Help me with what? DOROTHEA Go through this part of your life, it’s not easy, it’s not easy for anybody. JAMIE You asked them to help me? He gets out of the car, slams the door, but doesn’t know exactly where to go. She’s heartbroken but sticking with her plan.  24. DOROTHEA I think they get it, Jamie. They like you. JAMIE They said yes? Well, not exactly. DOROTHEA Yeah. JAMIE Fuck.   DOROTHEA Hey?! JAMIE You just feel guilty - cause it’s just you and me. DOROTHEA You don’t know what I’m feeling. JAMIE Right, exactly, tell me. That’s complicated for her. DOROTHEA Jamie... JAMIE You never tell me what’s going on with you, you just do things. He skates off - his face filled with anger. She’",
      "dialogue_count": 0,
      "word_count": 792
    },
    {
      "scene_number": 7,
      "slugline": "INT. DOROTHEA’S HOUSE - NIGHT - CONTINUOUS Hard cut to Dorothea working on the house late at night. William sees Dorothea down the hall, working away, hard on herself. She looks up and sees him. Why is it easy for her to be vulnerable with William? DOROTHEA Maybe I did do the wrong thing? WILLIAM Jamie’s energy’s very unstable, I think that’s why he does all this. DOROTHEA Well there’s an energy crisis, that must be playing into it. He just looks at her sincerely, why joke? DOROTHEA You don’t have a lot of funny lines do you? He doesn’t react. She leaves the room, seemingly fine. INT. DOROTHEA’S BEDROOM She sits in bed and smokes, and thinks, and worries. EXT. DOROTHEA’S HOUSE - NIGHT Camera finds Julie, sneaking up to Dorothea’s house in the dark. INT. JAMIE’S BEDROOM - NIGHT - CONTINUOUS Julie sneaks into his window. The way she does it tells us she’s done it a lot. She whispers for him but he’s not there. Has this ever happened? She sits on his bed, lonely. JULIE Jamie. She decides to get undressed, get’s into bed.  27.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 190
    },
    {
      "scene_number": 8,
      "slugline": "INT. ABBIE’S ROOM Abbie’s taking photographs in her room, listening to Siouxsie And The Banshees. She takes a photo of her red shoes on a grey backdrop, she’s excited. INT. WILLIAM’S BEDROOM - NIGHT William’s still recovering from Dorothea’s rejection. Abbie pops in, filled with energy. ABBIE Hey. WILLIAM Hey. ABBIE I had a new idea, for my work. Maybe just shoot all my stuff, everything I own, or everything that’s important to me.   A portrait of myself through all the objects I own? Can I show you? WILLIAM Yeah? She lays out polaroids for him to see. ABBIE Bra, birth control, “On Photography” by Susan Sontag, my shoes, underwear, a picture of a picture of my mom... I’m gonna do a bunch of them. He looks through some of her test Polaroids. Sort of immediately engrossed. WILLIAM It’s sad in a way isn’t it? All this stuff? You know what I mean? She didn’t expect him to get it. She’s looking at one of her objects as she talks. Longer eye contact than usual.  28.",
      "characters": [],
      "action_text": "He sits, looks at her, his hand is next to her hand. Something’s going on for her, takes a beat to say it. ABBIE You want to fool around, with me? WILLIAM Really? Yeah. He touches her hair. She closes her eyes, melts more than she thought she would, just to be wanted is nice. She never tells people about her cancer. ABBIE (CONT’D) You know I’m recovering from cervical cancer? WILLIAM I know. She can’t believe he still wants to fool around. Everyone else treats her like a leper.   Takes her a beat to assess what she feels capable of. He kisses her. She smells his hair. ABBIE (CONT’D) Your hair smells good. WILLIAM I make my own shampoo. ABBIE Of course you do. How did she get so far off course? She closes her eyes and kisses him again. EXT. 101 FREEWAY - CAR - NIGHT Jamie and his friends drive back from LA. He takes a beer from one of his passed out friends, drinks from it. INT. DOROTHEA’S HOUSE - NIGHT Jamie enters the front door, buzzed. He makes his way down the hallway, tipsy. Puts his beer on a chair. His ears ringing.  29.",
      "dialogue_count": 0,
      "word_count": 376
    },
    {
      "scene_number": 9,
      "slugline": "INT. DOROTHEA’S BEDROOM - NIGHT Dorothea’s smoking in bed, pretending to read, petting Jeeves. DOROTHEA It's OK Jeeves, he’s home now, you can relax. INT. JAMIE’S ROOM - NIGHT Jamie sits on the edge of his bed, looking at Julie. How strange, how great. A bit tipsy. JULIE Where were you? He thinks this is wild. JAMIE I went to LA. We went to the Starwood, saw a show. She looks upset, he studies her. JULIE Are you drunk? He sits down next to her, tries to kiss her. JULIE Don’t. JAMIE What’s wrong? JULIE Tim Drammer came inside of me. JAMIE I don’t want to hear this shit. INT. EMPTY SWIMMING POOL - NIGHT Abandoned empty Olympic size swimming pool, Julie and friends are drinking, fucking around, some one skateboards through it all.  30.",
      "characters": [],
      "action_text": "JULIE (V.O.) We broke into that old pool at the rec center.   Got loaded.   Fucked around. JULIE (V.O.) Me and Tim ended up in his mom’s Maverick. EXT. EMPTY PARKING LOT - NIGHT Camera pushes in on a lone Maverick, we hear the sounds of sex, we hear Tim orgasm. JULIE Did you just cum? INT. TIM’S MOM’S MAVERICK - NIGHT Tim’s getting up off of Julie in the back seat, she sits up. JULIE You said you were gonna pull out? TIM Yeah, sorry. Julie plays it like it’s not a big deal, but it is a big deal. JULIE I thought we had a deal there? CUT BACK TO JAMIE’S BEDROOM He hates hearing this. JAMIE Fuck. What’re you gonna do?  31. JULIE It'll be fine. She’s actually very worried. Her mind spins, disturbed. She changes the subject. JULIE Your mom asked me to like, help, like, raise you. JAMIE Yea I know. She was raised in the Depression, everyone helped everyone. The whole neighborhood raised the kids - Sorry. She let’s him know it’s O.K. But she’s still disturbed. JULIE Can we do therapy?   JAMIE Jesus, I don’t want to do therapy right now.... JULIE Let’s role play.   JAMIE Please no. JULIE I’ll be your mom, you can tell her what you want to tell her. JAMIE I don’t want to talk to my mom. JULIE What would you say to her? It takes him a beat to work up to it. JAMIE Well, mom, I don’t need any help, I’m OK. INT. WILLIAM’S ROOM - NIGHT - CONTINUOUS Abbie and William are kissing, shirts off, she pulls back, stops. Looks at him strange. ABBIE I’m gonna need a story.  32. WILLIAM A what? ABBIE (CONT’D) A story, like, you’re a photographer taking pictures of me, I’m like a very normal woman or something, you have to photograph me, but you can’t control yourself and you start touching me, and you shouldn’t, but you can’t stop and you keep apologizing, ‘I’m sorry, I’m sorry, I’m sorry...’ WILLIAM Can’t I just be me? ABBIE No... sorry. This isn’t William’s usual comfort zone, not his trip. But something about Abbie’s strength has him. CUT TO: William stands beside the bed, pretending to",
      "dialogue_count": 0,
      "word_count": 1205
    },
    {
      "scene_number": 10,
      "slugline": "INT. CRABTREE AND EVELYN: JULIE HELPS A WOMAN PICK POTPOURRI. SHE WANTS THE MONEY, SHE’S SMART, SHE COMPARTMENTALIZES. JULIE Spring rain features cinnamon, jasmine, lily-of-the-valley and rose. EXT. JULIE’S CREEK: JULIE READS THE ROAD LESS TRAVELED, BY M. SCOTT PECK, 1978. JULIE (V.O.) Of all the misconceptions about love, the most powerful and persuasive is the belief that falling in love is love, or at least one of the manifestations of love. EXT. ABANDONED PERGULA AREA: JULIE MESSES AROUND WITH A NEW BOY. INT. JAMIE’S BEDROOM NIGHT: JULIE TALKS TO JAMIE IN BED. JULIE Love is supposed to be a feeling that you feel. People say that they’re falling in love, but they’re not actually falling in love. It’s a fake connection that you feel with someone, and marriage should never happen. INT. MARY’S THERAPY BUNGALOW: A GIRL BEATS A WOOD STUMP WITH A ROLLED UP MAGAZINE, “YOU SHOULD HAVE DIED, IT SHOULD HAVE BEEN YOU”. It’s very cathartic and emotional. Mary watches the girl approvingly, Julie can’t stand the whole situation. EXT. DOROTHEA’S HOUSE - MORNING Julie quietly escapes Jamie’s window. WE FOLLOW her around the house, ducking under windows until she gets to the front door, neatens a little, knocks and lets herself in. INT. DOROTHEA’S KITCHEN - MORNING Dorothea is preparing breakfast for the family.   Julie walks in and helps bring dishes to the table.  38.",
      "characters": [],
      "action_text": "DOROTHEA Hey Julie, come in, Jamie’s still asleep, he got home late. JULIE Yeah. DOROTHEA Help me bring this stuff in OK? INT. DOROTHEA’S DINING ROOM - CONTINUOUS. Julie, Abbie, Dorothea and William are having a very awkward breakfast. Dorothea eyes William and Abbie. ABBIE So, is Jamie okay? DOROTHEA Yeah, he’s okay. I heard him come in last night.   I was awake. ABBIE Right. DOROTHEA Yea, I couldn’t sleep, so I was, listening for him. It’s clear she knows what happened, Julie really enjoys herself. Jamie finally enters, a bit sheepish, he did run away. DOROTHEA How was the show? JAMIE Good. DOROTHEA Next time you take a trip just tell me, I won’t make too much dinner. Jamie’s pissed to have his delinquency dismissed so. Wasn’t she afraid?  39. CUT TO: Everyone cleaning up and heading off. DOROTHEA Hey, do the stocks with me? Really? DOROTHEA C’mon. CUT TO: Dorothea and Jamie are seated at the table, paper and pad and more tension than before. Everyone else is gone. DOROTHEA IBM...Xerox...GE... JAMIE $69.73...$53.92... DOROTHEA Abbie’s got her appointment today. I have to work, maybe you can be here when she gets back, in case she needs support. JAMIE What if it’s like, bad news? DOROTHEA You can handle it. Or if you can’t, you just gotta start somewhere. He’s not so sure. DOROTHEA CONTD Men feel like you have to fix everything for women, or you’re not doing anything. But some things can’t be fixed. Just be there. Somehow, that’s hard for you all. JAMIE I’m not   all   men, I’m just me.  40. DOROTHEA Well, yes and no. INT. ABBIE’S BATHROOM - DAY Jamie watches a nervous, distraught Abbie re-dying her hair. ABBIE What if I have to do chemo, or have a hysterectomy? You know what that is? JAMIE I should go with you. She’s touched by his willingness. ABBIE Your mom did tell me to share my life with you... JAMIE I know. I’m sorry, she’s from The Depression. INT. OB-GYN - EXAM ROOM - DAY CLOSE ON Abbie’s confused, wide open face, hanging there. REVEAL she’s in a paper gow",
      "dialogue_count": 0,
      "word_count": 1638
    },
    {
      "scene_number": 11,
      "slugline": "INT. JAMIE’S ROOM - NIGHT Jamie’s alone in his room. Abbie enters sits next to him, she seems changed, a little lighter. ABBIE Thanks for coming with me. JAMIE Yeah. ABBIE I made you this. She hands him a mix tape. JAMIE A mix tape. CUT TO - ABBIE’S GIVING JAMIE AN IMPROV DANCE LESSON. ABBIE (V.O.) These are a bunch of songs that I think my life would have been better if they would have been around when I was a teenager.   And I’m hoping that if you listen to them now, you’ll be a happier and more realized person than I could ever hope to be. TITLE:   ABBIE PORTER   BORN 1955 JAMIE (V.O.) From that night on, Abbie started telling me everything. VISUALS 1. ABBIE AND JAMIE, LAYING ON THE BED, LAUGHING JAMIE (V.O.) She grew up in Santa Barbara, where everyone is happy, but that made her feel crazy. VISUALS 2. ABBIE AND JAMIE TALK AT DOROTHEA’S SMALL KITCHEN TABLE.  48.",
      "characters": [],
      "action_text": "JAMIE (V.O.) In 1973 she moved to New York City and went to art school. New York City made her feel sane.   It was so fucked up. She fell in love with photography, she learned to dance when she got sad.   She saw The Man Who Fell To Earth and died her hair red. VISUALS 3. EXT EAST VILLAGE: ABBIE WALKS DOWN THE STREET, ENTHRALLED 4. EXT. EAST VILLAGE: ABBIE TAKES PICTURES OF TRASH, HAPPY. 5. JUMP CUTS OF ABBIE GETTING DRESSED IN HER NYC MIRROR, SHE’S DISCOVERING A MORE SEXUALIZED LOOK. INT. ABBIE’S ROOM - DAY Abbie and Jamie are laying down - she tells him her story. ABBIE I figured out being looked at, you know? Making guys excited, uncomfortable. I was so cocky, and I was so angry, and I was so happy. EXT. JERSEY CITY APARTMENT - DAY Abbie and DANIEL (her teacher) sit on the front steps. JAMIE (V.O.) She fell in love with her teacher. Then she went to Planned Parenthood.   Her friends couldn’t deal with her having cancer, so she went home to her mom. VISUALS 5. ABBIE AND DANIEL WALKING AROUND NYC 6. DANIEL PLAYING VIOLIN 7. ABBIE WAITS WITH OTHER YOUNG WOMEN IN PLANNED PARENTHOOD 8. LAB TECHNICIAN LOOKS AT ABBIE’S CELLS 8. MAGNIFIED CANCEROUS CELLS EXT. NEW YORK CITY STREET -   DAY Abbie calls her mom from a phone booth on street. ABBIE Mom? INT. S.B. OBGYN OFFICE: OBGYN TALKS TO GAIL AND ABBIE. OBGYN Gail, did you ever take DES? When you were pregnant with Abbie? Confused, why is the question directed at her?  49. GAIL Yes...I had two miscarriages before Abbie...My doctor told me to take it? Abbie didn’t know her mom had miscarriages. Gail’s face stiffens. ABBIE   (V.O.) DES was a fertility medication they gave to women, doctors prescribed it to women. Later they figured out it gave the daughters of those women who took it cervical cancer. CUT TO SINGLE DES PILL ON GREY. INT. SANTA BARBARA HOSPITAL CORRIDOR: GAIL AND ABBIE LEAVE OFFICE; ABBIE’S LOOKING AT HER MOM CONCERNED. ABBIE I didn’t know you had miscarriages. GAIL FEELS TRESPASSED IN MANY WAYS, NO WARMTH, AB",
      "dialogue_count": 0,
      "word_count": 598
    },
    {
      "scene_number": 12,
      "slugline": "INT. DOROTHEA’S HOUSE: ABBIE MEETS DOROTHEA FOR THE FIRST TIME. ABBIE AND DOROTHEA TALK WARMLY IN THE KITCHEN. ABBIE UNPACKS IN HER NEW ROOM, SHE MEETS JAMIE FOR THE FIST TIME - HE LOOKS IN LOVE. JAMIE V.O. And she started renting the room upstairs. EXT. SANTA BARBARA BEACH - DAY Abbie, with a reporter friend, takes a picture of long-winded county supervisor for her work, how did her life end up like this? END OF SEQUENCE INT. MOTEL 6 DRAFTING ROOM - DAY All the men have their heads down drawing. Dorothea, the only woman, is sitting up, looking around. LATER IN THE BREAK ROOM: DOROTHEA SMOKES ALONE. CHARLIE ENTERS, DOROTHEA SALUTES HIM. HE LIGHTS UP, LOOKS AT HER. CHARLIE Hey Dorothea. DOROTHEA Hey Charlie. CHARLIE You wanna go out sometime? Get a drink? Surprised, sincere. DOROTHEA Yeah? What the heck, Charlie. CHARLIE Oh, great, funny, I wasn’t sure. DOROTHEA Of what?  51.",
      "characters": [],
      "action_text": "CHARLIE Some of the guys thought you’re a lesbian, you know, which is no problem with me if you are, but you aren’t. DOROTHEA Yeah, no, not a lesbian. CHARLIE OK, well then, let’s go out? DOROTHEA Maybe come to dinner at my house again sometime? We could do that. She leaves blasé, once out of sight, real hurt on her face. INT. DOROTHEA’S BEDROOM - THAT NIGHT Dorothea looks lost in bed alone. INT. EXT. DOROTHEA’S WINDOW - MORNING Dorothea’s up early, tidying up the house. She sees Julie making her escape out of Jamie’s window, climbing down the scaffolding, making her get away. Dorothea is as impressed as she’s angry. DOROTHEA Shit Julie. Dorothea takes off. EXT. SAN LEANDRO STREET/OAK TREE GLENN - DOROTHEA’S CAR - DAY Julie walks down the street. In the distance we see Dorothea’s VW BUG catching up, pulling up alongside Julie. Julie sees the car, walks on the little trail in to the oaks. Dorothea parks and catches up to her. DOROTHEA I saw you, leaving. Please don’t turn me into the cop here, that’s so boring you know? Julie feels horrible but decides to stand her ground.  52. JULIE It’s nothing, I just end up there sometimes. DOROTHEA What do you guys do? JULIE I just sleep there. We talk. CUT TO: They’re sitting in the car. Dorothea lights up. JULIE Can I have one? DOROTHEA It’s really bad for you. JULIE You smoke all the time. DOROTHEA When I started they weren’t bad for you, they were stylish and sort of edgy, so it’s different for me. Dorothea gives her one, Julie lights up like a seasoned smoker. DOROTHEA You’re good at hiding stuff, huh? JULIE My mom calls it “compartmentalizing”, apparently I do that a lot. DOROTHEA Are you helping him? JULIE I’m trying.  53. DOROTHEA Really? JULIE What about you? Have you thought about your impact on him? DOROTHEA Me? JULIE It’s always about the mother. Like, do you think you’ve moved on, since his dad? DOROTHEA You know, you’re not actually a therapist. Julie’s not easy to intimidate. She stares Dorothea down. DOROTHEA I’v",
      "dialogue_count": 0,
      "word_count": 1503
    },
    {
      "scene_number": 13,
      "slugline": "INT. JAMIE’S BEDROOM - NIGHT There’s a KNOCK. Julie hides under the covers. JAMIE Yeah? Abbie enters, distraught. She sits on the edge of Jamie’s bed. ABBIE I’m sorry, you awake? JAMIE Yeah. ABBIE I wanted to tell you, you just have to get out of this town, If you want to have any chance at an interesting life where you can move forward. JAMIE (CONT’D) What happened? She sees Julie. ABBIE Oh, shit. I’m sorry. JULIE We don’t have sex. I just sleep here. She looks at Jamie for verification, he nods, ‘sad but true’. JAMIE What happened? ABBIE Can I lay down? JAMIE Yeah, here, lay down. He makes room, Julie’s pissed. Half just to not be bossed around by Julie, Abbie lays down. Jamie’s surrounded by two of the women he loves.  60.",
      "characters": [],
      "action_text": "JULIE We were sleeping. ABBIE I’m talking to Jamie for a sec, OK? She composes herself on the bed, ABBIE CONTD Lynette Winters spit on me. CUT BACK TO BAUDELAIRES - LYNETTE SPITS ON ABBIE. WILLIAM TRIES TO INTERVENE. ABBIE (V.O.) So then I hit her. THEN ABBIE PUSHES LYNETTE TO THE FLOOR. JAMIE (V.O.) Why’d she spit on you? ABBIE (V.O.) Because I spit on her. TO ABBIE’S SURPRISE LYNETTE LUNGES BACK AT ABBIE, KNOCKING HER TO THE FLOOR, STRADDLING HER, HITTING HER. ABBIE V.O. Right before I was going to New York and I thought I was never coming back. It felt very liberating at the time. WILLIAM FINALLY PULLS OFF LYNETTE - ABBIE, BLOODY LIP OR NOSE, IS ENRAGED AT EVERYTHING THAT’S HAPPENED TO HER, GRABS A CHAIR AND AWKWARDLY TRIES TO DESTROY IT AGAINST THE GROUND, OVER AND OVER. ABBIE V.O. And somehow I ended up breaking a chair.  61.",
      "dialogue_count": 0,
      "word_count": 291
    },
    {
      "scene_number": 14,
      "slugline": "EXT. BAUDELAIRES - NIGHT Abbie quickly exits, bloody lip, torn up shirt. She rushes past Julian, “Hey, what happened?” She’s running down the street. It takes a block for William to catch up to her, he has to pull her to a stop. He has something to tell her. ABBIE (V.O.) And then William told me he didn’t want to sleep with me anymore.   Not that I ever really wanted to sleep with him. She yells at William. ABBIE What are you saying? I don’t like you, I don’t like you, I don’t like you, I don’t like you. BACK IN JAMIE’S BEDROOM: Abbie changes her mood again. Abbie gestures for Julie to look away. ABBIE (To Julie) I’m just gonna talk to Jamie for a second. Set gets very close to him, almost sexual. ABBIE (CONT’D) Don’t let her sleep here without having sex with you, it’s disempowering. And get out of this town before you end up working in a sunglasses shop. She looks at Julie. ABBIE That goes for you too. And with that she gets up and leaves. Julie’s jealous. INT. DOROTHEA’S BREAKFAST TABLE Julie, Jamie, Dorothea and William eat breakfast. Abbie shows up with a busted lip. Dorothea’s curious - Abbie waves her off and glares at William. Abbie has some books for Jamie.  62.",
      "characters": [],
      "action_text": "ABBIE Here’s some books from my feminism class. I thought they might be good for you, a woman’s perspective. JAMIE Thanks. DOROTHEA What happened to your lip? ABBIE There was a fight. DOROTHEA What? ABBIE It was ridiculous. William picks up “Our Bodies Our Selves”. WILLIAM I read this. The chapter on home birth. It was pretty helpful. He digs into it, he’s a mystery to them. Does he read something aloud? JULIE Home births actually stunts the baby’s growth personality. ABBIE What is a growth personality? JAMIE It’s a real term.  63. WILLIAM “And who knows what it means for a newborn to see wood walls and carpeted floors and to smell real human smells and to feel wool and cotton and flannel clothes instead of starchy, white, deodorized...” to me, that meant, what else? Dorothea looks on, perplexed, what is this world? INT. JAMIE’S BEDROOM - NIGHT Jamie in bed looks through the book SISTERHOOD IS POWERFUL. TITLE: THE POLITICS OF ORGASM - SUSAN LYDON, 1970 He finds the essay, begins to read. JAMIE (V.O.) ‘Women’s sexuality, defined by men to benefit men, has been downgraded and perverted, repressed and channeled... EXT. BACK YARD - SKATE RAMP - DAY Good 1979 style ramp skating. Punk on a boombox. Jamie and other skaters sit on the roll-out deck. MATT, hardcore punk style, holds court. JAMIE (V.O.) Anatomically, all orgasms are centered in the clitoris, whether they result from direct manual pressure applied to the clitoris, indirect...(fades out) MATT I fucked Heather so hard, she came like three times. JAMIE How did you stimulate her clitoris? What? MATT With my dick.  64. JAMIE Women need direct clitoral stimulation, with fingers or a vibrator or something. She probably faked it, women fake it all the time. All the boys feel betrayed on a deep level. Matt focuses on Jamie’s TALKING HEADS 77 shirt. MATT Talking Heads’re a bunch of fags. JAMIE There’s a girl in the band and she goes out with the drummer, so... CUT TO: Jamie and Matt FIGHTING AT THE BOTTOM OF THE RAMP. M",
      "dialogue_count": 0,
      "word_count": 4868
    },
    {
      "scene_number": 15,
      "slugline": "INT. HOTEL ROOM - NIGHT Julie smokes in bed and undresses.   Jamie comes in and sits on the bed. Something’s brewing in Julie. Jamie’s looking confused, out of body himself. JAMIE I love you. He tries to be sweet and caress her, she pulls away. JAMIE What’s wrong? JULIE Nothing. JAMIE What is it? JULIE I think I’m too close to you to have sex with you, it confuses me. I’m sorry. JAMIE I can help you get over that. JULIE I don’t want to get over it. JAMIE Yeah you do. JULIE You’re being like the other guys. JAMIE I don’t want to just, have sex with you, I want...you. JULIE But that’s like,   your   version of me, that’s not me... It’d be better if you just wanted sex... You   are  like the others, you just pretend to be all modern about it.  89.",
      "characters": [],
      "action_text": "Jamie rises, hurt and angry, gets dressed. JULIE Jamie? He doesn’t talk. He leaves in a rush. EXT. SAN LUIS OBISPO HOTEL Jamie exits the room, and takes off. EXT. SAN LUIS OBISPO - NIGHT Jamie hurriedly walks the streets of this sleepy town alone. INT. S.B. POLICE STATION - NIGHT Dorothea waits on a bench, after being processed. Long shot down the hall, Abbie walks up to her and sits by her. Dorothea, hair a mess and kind of sweaty looks at her confused, down the hall she can see William waiting patiently, not wanting to add to her pain. DOROTHEA These people have no sense of humor. ABBIE Let’s get out of here. Abbie neatens Dorothea’s hair, tidies her up a little bit, takes her arm and they walk out past the male cops, who don’t get out of the way, Abbie has to shoulder butt one as they pass, holding their dignity together. INT. ABBIE’S CAR - NIGHT Abbie drives her home. She’s exhausted, doesn’t want any pity or judgement. INT. DOROTHEA’S BEDROOM - NIGHT Abbie helps Dorothea into bed, gets her a glass of water. ABBIE Having a kid seems like the hardest thing. DOROTHEA How much you love the kid is the hardest thing. You’re just pretty screwed.  90. Abbie feels the loss of what she can’t have. EXT. SLO AGRARIAN FIELD - DAWN Jamie, strung out and tired is walking down a dirt road next to an agrarian field. As he walks, a group of 30 or so Latino migrant workers cross the road and the frame. They’re heading to work, some are as young as Jamie it seems, he stops as they all cross him, none of them look at him. Two different worlds. INT. DOROTHEA’S KITCHEN - MORNING Dorothea enters, finds Abbie and William at the table. She looks at them, not sure, mixed feelings, anger and vulnerability. DOROTHEA Julie called, they’re in San Luis Obispo, but she can’t find him. She looks at them, more open and real. DOROTHEA Will you guys please come with me? Up there? I/E. 101 FREEWAY - 1939 FORD - MORNING William drives Dorothea and Abbie up the 101 freeway. EXT. CENTRAL COAST - SAME ",
      "dialogue_count": 0,
      "word_count": 590
    },
    {
      "scene_number": 16,
      "slugline": "EXT. DRY CREEK BED - DAY Dorothea finds Jamie, alone, angry, at first not wanting to talk to her. They’ve both been up most the night, they both look rough. He walks away, she follows. DOROTHEA Julie’s a really complicated woman. I’m impressed in a way, but that’s a lot to take on. He keeps walking, heads into the connecting vineyard. She calls after him, he doesn’t look back, she follows. Catches up with him. JAMIE Aren’t you going to get Julie? To come talk with me? DOROTHEA Jamie! JAMIE What? DOROTHEA I thought they’d help. That stops him, changes him. JAMIE It just seemed like you couldn’t deal with me anymore. DOROTHEA Look.   I wanted.   I. I don’t want you to end up in the same place as me. JAMIE What does that mean? DOROTHEA Well, I wanted you to be happier. I just didn’t think I could do it by myself.  92.",
      "characters": [],
      "action_text": "JAMIE Okay..I thought we were fine though, just me and you. DOROTHEA Yeah? JAMIE Yeah. INT. HOTEL ROOM - NIGHT Dorothea, Abbie, Julie, Jamie and William sitting in the room eating take out dinner. JUMPS CUTS; Dorothea finds an oldies station, 30’s-40’s music plays. Dorothea teaches Jamie to dance, Abbie joins in, then Julie and William, they all find a partner. A small moment of grace between these 5 people. EXT. HOTEL PARKING LOT - DAY Abbie, Julie and William are loaded up in Dorothea’s car, waving, heading off. IMPROV GOODBYES. Dorothea and Jamie are alone now, they have to face each other. DOROTHEA Maybe we don’t go back yet? JAMIE O.K. INT. SLO SUPERMARKET - DAY Dorothea and Jamie walk down the aisle. JAMIE I want to dye my hair. She’s not really comfortable with that. DOROTHEA Really? JAMIE Well, yeah. Dorothea can’t relate, but wants to relate.  93.",
      "dialogue_count": 0,
      "word_count": 305
    },
    {
      "scene_number": 17,
      "slugline": "INT. S.L.O RESTAURANT - DAY Jamie and Dorothea have a picnic. JAMIE Were you and dad ever in love? DOROTHEA At first. Or maybe I was just supposed to be in love. Or scared that I’d never be in love. So I picked the best solution I had at the time. INT. MOTEL BATHROOM - DAY JUMP CUTS: Dorothea washes Jamie’s hair / rubs in the dye / waits with the little plastic baggy over his head / washes it out / dries his hair. She feels deep bittersweet heartbreak, loves him so much, understands him so little. JAMIE Are you lonely? DOROTHEA Well, in my next life, I might marry Bogart, we’ll see. JAMIE He’s... dead. DOROTHEA I’m talking about next life right? So he may be around, and we might meet and something might happen between us, OK? JAMIE What about having that in the real world? DOROTHEA This is no time to get rational sweetie, can you just go with this? JAMIE O.K. - keep going.  94.",
      "characters": [],
      "action_text": "DOROTHEA He knows what I’m thinking, and what makes me laugh - he can really see me. And, you know he’s gonna do what he says he’s gonna do, so it’s easy. JAMIE He sounds great. EXT. MID-COAST LONELY ROAD - DAY Dorothea drives. REVEAL that Jamie is on his skateboard hanging onto the passenger door, window down. JAMIE (V.O.) I thought that was just the beginning of a new relationship with her, where she’d really tell me stuff. But maybe it was never really like that again. Maybe that was it. INT. NONDESCRIPT ROOM: SMOKE RISES DOROTHEA (V.O.) In March of 1999, I’ll start to feel tired and confused. When I finally go to the doctor, he will say that the cancer in my lungs had already travelled to my breast and brain.   I’ll try to teach Jamie what to do with my stocks, but my instructions will be impossible to understand. VISUALS 1. STOCKS IN NEWSPAPER 2. JAMIE AND DOROTHEA SITTING ON THE COUCH WATCHING TV INT. DESKTOP: DOROTHEA’S VERY OLD HAND IS WRITING A NOTE, BUT HER HANDWRITING IS INDECIPHERABLE.  95.",
      "dialogue_count": 0,
      "word_count": 355
    },
    {
      "scene_number": 18,
      "slugline": "INT. JAMIE’S BEDROOM: JULIE AND JAMIE LAY IN BED AND TALK JULIE (V.O.) Abbie will take me to Planned Parenthood. And I will go on the pill.   I will go to NYU and lose touch with Jamie and Dorothea, and I will stop talking to my mom, I will fall in love with Nicholas, we will move to Paris, and choose not to have children. VISUALS 1. ABBIE AND JULIE AT PLANNED PARENTHOOD 2. JULIE ALONE IN PLANNED PARENTHOOD ROOM, LEARNING ABOUT BIRTH CONTROL. 3. JULIE LOOKING AT CAMERA 4. JULIE’S MOTHER LOOKING AT CAMERA 5. JULIE STARING AT CAMERA SMOKING IN HER CREEK. INT. ABBIE’S ROOM: JAMIE AND ABBIE DANCING - REPEAT SCENE ABBIE (V.O.) I will stay in Santa Barbara. INT. BIRD CAGE: CARLOTTA THE FINCH LIES LIFELESS ON THE FLOOR OF THE CAGE. MAX FLIES AROUND. EXT. SUBURBAN YARD: ABBIE DIGS A HOLE, PUTS SOMETHING IN IT. WE SEE DEAD BIRD IN ABBIE’S HAND. ABBIE (V.O.) A month after I get married Carlotta will die. A week later, Max will die too. INT. GARAGE: PORTRAIT OF ABBIE IN HER STUDIO. ABBIE I will work out of my garage and show in local galleries. EXT. SUBURBAN STREET: ABBIE STANDS IN FRONT OF A HOUSE, NEXT TO A MAN, THE REPORTER SHE WORKED WITH BEFORE. A BABY IN HER ARMS, 2 YEAR OLD BY HER SIDE. ABBIE Against my doctor’s advice, I will get pregnant, and by the time I’m 30 I’ll have two boys. INT. DORTHEA’S KITCHEN - DAY Dorothea sits down to do her stocks. William comes and sits on her left, picks up a pen with his left hand, scratches her back with his right, like they do.  96.",
      "characters": [],
      "action_text": "WILLIAM (V.O.) I’ll live with Dorothea for another year. Then I’ll open a pottery store in Sedona Arizona. EXT. WILLIAM’S POTTERY AREA: WILLIAM TALKS TO CAMERA. WILLIAM I will marry Laurie, a singer- songwriter. We’ll get divorced in a year. Then I’ll meet Sandy, we will marry, and I will continue to do my pottery. VISUALS 1. STILL OF SEDONA LANDSCAPE 2. RUSTIC CLAY POT 3. LAURIE WITH GUITAR 4. CAT SCAN OF BRAIN TUMOR 5. WILLIAM WITH SANDY 6. RUSTIC CLAY POT EXT. AIRPORT: DOROTHEA IS WALKED TO A BIPLANE BY A SWEET, ROUNDISH JIM BROADBENT TYPE OF MAN. HE HELPS HER INTO THE PLANE. KISSES HER, AND WATCHES AS SHE TAKES OFF. JAMIE (V.O.) My mom will meet Jim in 1983, they’ll be a couple until she dies. On her birthday each year, he will buy her a trip on a biplane. INT. DOROTHEA’S LIVING ROOM: SHE AND JAMIE DANCING JAMIE (V.O.) Years after she’s gone I’ll finally get married and have a son. I/E OLD BIPLANE HEADS DOWN THE RUNWAY, LIFTS INTO THE AIR - DOROTHEA LOOKS HAPPY AND FREE. JAMIE (V.O.) I’ll try to explain to him what his grandmother was like - but it will be impossible. CLOSE ON DOROTHEA’S FACE AS THE PLANE FLIES ABOVE THE SANTA BARBARA COAST, THE EXCITEMENT OF FLIGHT IN HER EXPRESSION. AS TIME GOES BY PLAYS.  97.",
      "dialogue_count": 0,
      "word_count": 512
    }
  ]
}