{
  "slug": "22-jump-street-2014",
  "title": "22 jump street",
  "genre": "action",
  "format": "film",
  "scenes_count": 4,
  "characters_count": 0,
  "characters": [],
  "total_words": 20785,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. KOREAN CHURCH - DAY   *  Schmidt walks into the church, which is now filled with old   *  Korean men and women praying in Korean.   *  SCHMIDT   *  Hey guys. You mind if I...   *  A Korean woman smiles and says something to him in Korean as   *  she gestures him over to Korean Jesus.   *  SCHMIDT (CONT’D)   *  So, you guys don’t mind?   *  No one pays him any attention.   *  SCHMIDT (CONT’D)   *  Hey Korean Jesus. Long time no   *  pray. How’ve you been? Busy   *  probably. North Korea? Nuts, right?   *  So listen, with this whole college   *  thing, I was hoping while I’m there   *  I could take care of this thing I   *  never got a chance to take care of,   *  which is, um, having sex. Like with   *  another person. I know it’s weird   *  to ask you, not because you’re   *  Korean, I assume Koreans do plenty   *  of sex having, but because you’re   *  Jesus, and I’m pretty sure you died   *  a virgin, and that’s cool for you.   *  I just, I just really don’t want to   *  die a virgin. Anything you can do.   *  Amen. Don’t tell anyone. Thanks.   *  JENKO (O.S.)   *  Yo, let’s go.   *  Schmidt turns to see Jenko at the front of the church. He   *  heads over to him, and as he goes, elderly Koreans all start   *  saying Virgin, Virgin, Virgin.   *  JENKO (CONT’D)   *  What’s going on?   *  SCHMIDT   *  Who knows? Guess they all love Mary   *  or something let’s go.   *  EXT. JENKO’S APARTMENT - DAY Schmidt and Jenko load supplies into the Schmidts’ Suburban.  4/20/13   16.",
      "characters": [],
      "action_text": "JENKO Dickson really needs to switch to   *  decaf. Can you imagine him at home?   *  SCHMIDT  Infiltrate the deli, find the   *  papaya!  They share a laugh as ANNIE and DAVID Schmidt arrive. ANNIE Look at you! All grown up and going to college. Annie grabs Jenko and gives him a sloppy mom kiss. JENKO Hey, Mrs. Schmidt. ANNIE (to Schmidt) Is that what you’re wearing? SCHMIDT Mom... ANNIE In my day we wore sundresses and didn’t shave anything. Now you wear cargo shorts and shave everything. SCHMIDT MOM... EXT. COLLEGE CAMPUS - DAY The Schmidt’s Suburban makes its way through a campus exploding with excited college kids and anxious parents. INT. HALLWAY - DORMITORY - DAY   *  Jenko, Schmidt and his parents carry boxes and bags, as a   *  pair of beautiful college girls narrowly squeeze by.   *  SCHMIDT And you didn’t want to come here. One girl has sweatpants with   Juicy   written on the butt.   *  SCHMIDT (CONT’D) Her ass has an adjective.  4/20/13   17. They arrive at their suite and walk through a small living   *  area to their room. Jenko stops at the doorway.   *  SCHMIDT (CONT’D) What’s up? JENKO I’m the first one in my family to pretend to go to college. They share a moment then head into the room together. EXT. DORMITORY - EVENING The Schmidts stand by their car, saying goodbye. ANNIE You sure you’re going to be okay? SCHMIDT Mom, we’re fine. ANNIE (to Schmidt) I meant you. You want us to wait? SCHMIDT Mom! Just get out of here!   *  ANNIE Doug or Brad or whoever you’re supposed to be, take care of him. SCHMIDT Mom! Other kids laugh good-naturedly at Schmidt and his parents. ANNIE What are you laughing at, that’s my child! Schmidt covers his face with his hands as we transition to... DORM ROOM MONTAGE Schmidt and Jenko set up their room, arguing over everything.   *  SCHMIDT   *  I call this bed.   *  JENKO   *  Then I call this dresser.   *  4/20/13   18. Jenko refers to the dresser right next to Schmidt’s bed.   *  SCHMIDT   *  The dresser goes with the b",
      "dialogue_count": 0,
      "word_count": 982
    },
    {
      "scene_number": 2,
      "slugline": "INT. BATHROOM - LATER Schmidt and Jenko brush their teeth at a row of sinks.   *  SCHMIDT Do you think we have a compatibility problem? JENKO No way. Whatever that is, no way. Jenko spits out some toothpaste.   *  SCHMIDT   *  Cool.   *  (beat, thoughtful)   *  I’m gonna go jerk off in the   *  shower.   *  JENKO   *  What?   *  SCHMIDT   *  You want me to do it in the room?   *  (eyeing Jenko’s bare feet)   *  This is why you need flip-flops.   *  These floors are like ninety   *  percent semen.   *  INT. DORM ROOM - NIGHT   *  They sit on their beds looking at course lists on their   *  laptops, their case folders open on their beds.   *  SCHMIDT   *  These course options are   *  incredible. I literally just signed   *  up for a class called Logic 101.   *  JENKO   *  I just want to get this over with   *  without humiliating myself. Why do   *  we even have to go to class?   *  SCHMIDT   *  Because we have to act like real   *  college kids. Don’t worry, we’ll   *  mix some electives with classes   *  Cynthia was signed up for. She had   *  a double major. Fine Art and--   *  4/20/13   21.",
      "characters": [],
      "action_text": "JENKO   *  (reading his folder)   *  Police?! I’ll take police.   *  SCHMIDT   *  That’s not police it’s poli-sci.   *  JENKO   *  Like, Italian police?   *  SCHMIDT   *  Political Science.   *  JENKO   *  Fuck science. I barely had a clue   *  in   app   chemistry.   *  SCHMIDT   *  Do you even know what the   App   in   *  App   Chemistry stands for?   *  JENKO   *  Apparatus?   *  SCHMIDT   *  Advanced placement. You were taking   *  college level chemistry.   *  JENKO   *  I was?   *  SCHMIDT   *  You’re gonna be fine.   *  EXT. CAMPUS - MORNING Schmidt and Jenko walk through the main Quad, surrounded by students of all shapes and colors. JENKO   *  What’s the plan?   *  SCHMIDT We’ll go to class, ask around about   *  the drug and find the dealer. Easy   *  peasy, just like last time.   *  INT. LECTURE HALL   *  Schmidt sits down next to a STONED-LOOKING kid.   *  4/20/13   22. SCHMIDT   *  You ready to get your logic on?   *  The stoned-looking kid eyes Schmidt like he just farted.   *  SCHMIDT (CONT’D)   *  College man... Work hard, party   *  hard, amiright?   *  STONED-LOOKING KID   *  I guess.   *  SCHMIDT   *  I wish there was some pill I could   *  take that combined those two   *  things. You feel me?   *  STONED-LOOKING KID   *  I totally feel you.   *  SCHMIDT   *  Awesome. So... You know where I can   *  get some WhyPhy?   *  STONED-LOOKING KID   *  Uh-huh.   *  The stoned-looking kid looks around and leans in to Schmidt.   *  STONED-LOOKING KID (CONT’D)   *  Try the evidence room at your   *  precinct... Because you’re a narc.   *  SCHMIDT   *  Tsh, yeah, whatever.   *  STONED-LOOKING KID   *  Dude, you’re wearing a badge.   *  (off Schmidt looking down)   *  Wow! Did you actually just check to   *  see if you were wearing your badge?   *  The stoned-looking kid explodes with laughter.   *  SCHMIDT   *  No. I was just-- I--   *  Schmidt gets up and moves to the other side of class. He sees   *  an attractive light-skinned black girl and sits next to",
      "dialogue_count": 0,
      "word_count": 5353
    },
    {
      "scene_number": 3,
      "slugline": "EXT. STREETS OF METRO CITY - NIGHT They ride on Vespas. Schmidt with Alan and Jenko with Mike.   *  ALAN YANG We bought these when we did a semester abroad in Montreal. You know what they call a quarter pounder with cheese in Montreal? MIKE YANG Royale with Cheese. SCHMIDT Are you guys serious? ALAN YANG You know what they call a Big Mac? SCHMIDT Le Big Mac! We know! Everybody fucking knows. MIKE YANG Calm down,   Burbank . Alan and Mike crack up again. EXT. FRATERNITY ROW - NIGHT SCHMIDT If you see anyone leave the basement, lay on the horn. Jenko and Schmidt hustle to the back of the Zeta house. In a flash, Jenko grabs a window sill and leaps to the balcony.   *  Schmidt leaps up, can’t even grab the window sill. SCHMIDT (CONT’D) (whisper shouting) Jenko! Jenko! The door opens and Jenko rolls his eyes and waves Schmidt in.   *  INT. THIRD FLOOR - ZETA HOUSE They reach the locked attic. Jenko ducks into an open room.   *  SCHMIDT Where are y--  4/20/13   48.",
      "characters": [],
      "action_text": "The attic door opens from the inside, Jenko steps out. SCHMIDT (CONT’D) How do you keep doing that? EXT. FRATERNITY ROW - SAME TIME   *  Alan and Mike keep watch from their scooters. ALAN YANG You see any Zeta brothers?   *  MIKE YANG   *  Negative.   *  ALAN YANG   *  Man, I am so locked in right now!   *  MIKE YANG   *  Focused like a laser!   *  INT. ATTIC   *  Jenko and Schmidt poke around a dusty attic littered with old   *  furniture, Fraternity Composites, lamps.   *  JENKO What are we even looking for, a box labeled   DRUGS ?   *  SCHMIDT (a noise) Shhh... They shut up, and we hear the quiet but distinct voices of the fraternity brothers wafting up through the A/C vents. ZOOK (O.S.) Next up for pledgeship... Brad Mcquaid. FRAT BRO (O.S.) Is that He-Man or Sponge Bob? ZOOK (O.S.) He-Man. There’s a chorus of ‘definitely’s and ‘hell yeah’s. ZOOK   (O.S.) (CONT’D) Great. What about Doug?  4/20/13   49. There’s a chorus of laughter and ‘are you serious’ and a very audible, ‘what’s with those shorts?’ ZOOK (O.S.) (CONT’D) Guys, he’s Brad’s brother. I doubt we get one without the other. There’s a collective groan and Schmidt’s face falls. EXT. FRATERNITY ROW In the house fraternity brothers begin to leave the basement.   *  ALAN YANG Do you remember why we’re sitting out here? MIKE YANG No clue. I was hoping you knew. Alan and Mike start laughing. ALAN YANG I think the Adderall’s transitioning to the Ecstacy. MIKE YANG Goodbye work hard, hello play hard. Alan honks his pathetically ineffectual horn twice. ALAN YANG (matching the tones) I’m. High. MIKE YANG (honking twice) Me. Too. INT. ATTIC Schmidt and Jenko dig around, the voices having disappeared. SCHMIDT The Zeta guys are assholes. JENKO They’re not that bad, you’re just a   *  different type of person. SCHMIDT What does THAT mean?  4/20/13   50. JENKO Nothing. (beat) Let’s go. This is just an attic.   *  SCHMIDT We could be standing on a mountain of drugs and you’d say it was just an attic. JENKO Fuck you. If",
      "dialogue_count": 0,
      "word_count": 11450
    },
    {
      "scene_number": 4,
      "slugline": "EXT. DUCK POND - DAY Schmidt stands, bored. Josh sits, picking his nose.   *  Jenko walks up wearing his USC jersey. JENKO What’s up guys? SCHMIDT Jenk! The two have an awkward hug and Josh offers a meek wave. JENKO So how’s it going? SCHMIDT (beat, decides to lie) It’s going amazing. I mean, I   *  wasn’t sure about Josh at first. Josh examines his booger and sticks it on Schmidt’s bike.   *  SCHMIDT (CONT’D) But, you know, he’s actually a fantastic cop. JENKO Oh yeah? SCHMIDT Yeah. We’ve made like way more arrests than you and I were making. We’re like best friends. JOSH We are? SCHMIDT Shut the fuck up, Josh. I’m just   *  kidding, you’re awesome.   *  Jenko forces a smile.   *  JENKO That’s cool. I’m happy for you. SCHMIDT How’re you, man?   *  JENKO I’m great. Football, school, it’s all great.  4/20/13   108.  (MORE)",
      "characters": [],
      "action_text": "(beat) Listen, I came by because I found the supplier. SCHMIDT   *  You did?   *  JENKO   *  Yeah, it’s   Mercedes .   *  SCHMIDT What? JENKO And The Ghost is her father.   *  SCHMIDT   *  That explains a lot, actually.   *  JENKO   *  Doesn’t it? The two of them are   *  going to Havasu to set up a massive distribution network. SCHMIDT Holy shit. JENKO I was thinking we could, I don’t   *  know, like go there and, you know,   *  bring down the whole thing.   *  SCHMIDT  We ? JENKO If you want. SCHMIDT What about school? JENKO I’m off. (off Schmidt’s look) It’s Spring Break. INT. BLACKHAWK HELICOPTER - NIGHT Schmidt and Jenko are decked out like members of Seal Team 6 and a 1/2. JENKO You ready to do this shit?  4/20/13   109.  JENKO (CONT'D) Schmidt pops a clip into his M-16. SCHMIDT Locked and loaded motherfucker! JENKO Hooah!   SCHMIDT Hooah!   *  INT. SCHMIDT’S SUBURBAN - DAY We see that we were just watching a dream Schmidt was having   *  in the back seat next to Jenko. Annie and David are up front.   *  SCHMIDT (asleep, drooling) Hooah... ANNIE Oh, Schmidty. INT. JUMP STREET HEADQUARTERS - DAY Josh walks his bike inside. JOSH I have a message for a Captain   *  Dickson?   *  INT. CHEAP MOTEL - DAY Schmidt and Jenko gear up, Spring Break style. They apply suntan lotion.   *  SCHMIDT You missed your neck.   *  Schmidt helps Jenko put lotion on his neck.   *  JENKO   *  Thanks.   *  They put guns in their waistbands and pop on sunglasses.   *  EXT. LAKE HAVASU - SPRING BREAK - DAY We zoom in over the most epic Spring Break party ever recorded on camera. Jenko and Schmidt tail Mercedes, Jenko in   *  a swimsuit, Schmidt in a T-shirt and cargo shorts.  4/20/13   110. SCHMIDT   *  If there are drugs at her meeting   *  with The Ghost and the dealers we   *  can get all of them at once.   *  Mercedes hops onto a Jet Ski and Schmidt and Jenko climb onto two others and follow her out towards a huge party boat. EXT. PARTY BOAT The boat is impossibly crowded with drunke",
      "dialogue_count": 0,
      "word_count": 3000
    }
  ]
}