{
  "slug": "22-july-2018",
  "title": "22 july",
  "genre": "action",
  "format": "film",
  "scenes_count": 31,
  "characters_count": 0,
  "characters": [],
  "total_words": 26212,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. RURAL NORWAY - WHITE FARMHOUSE - DAY 1   1 An isolated white farmhouse set within dense pine forest.  CAPTION: 21st July 2011. 90 miles east of Oslo.   * * CUT TO: INT. WHITE FARMHOUSE - GARAGE - CONTINUOUS 2   2 A man (early 30s) fills industrial sacks with thick black powder. Diesel soaked fertiliser mixed with aluminium. Messy work. This is ANDERS BREIVIK and he is preparing for war.   * CUT TO: EXT. UTØYA ISLAND - DUSK 3   3 A small island on the eastern flank of LAKE TYRIFJORDEN, 38 miles from NORWAY’S capital city, OSLO. CUT TO: EXT. UTOYA ISLAND - FERRY DOCK - DUSK 4   4 The early evening ferry from the mainland. Crowds of excited teenagers arrive for the annual summer camp run by Norway’s ruling Labour Party. Among them: VILJAR HANSSEN (17), a striking young man and to all his friends a natural leader. With him, his younger brother TORJE (14). They are met off the boat by MOTHER UTOYA (45). She has run the camp for 20 years. MOTHER UTOYA Welcome back! VILJAR   * Hey!   * The boys head on up to the centre of the island. Stopping at   * a check-in desk.   * VILJAR (CONT’D)   * Viljar Hanssen...   * CUT TO:",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 209
    },
    {
      "scene_number": 2,
      "slugline": "INT/EXT. WHITE FARMHOUSE - VAN - EVENING 4A   4A   * BREIVIK loads the sacks into the white van. Next the detonator and charges - which he packs in with pieces of old mattress. Then he threads a long black wire from the sacks into the driver’s compartment. CUT TO: EXT. UTOYA ISLAND - DUSK 5   5   * VILJAR and TORJE arrive at the campsite. Make-shift signs: Oslo; Finnmark; Nordland... They come from Northern Norway, so they make for the Troms & Svalbard camp.   * VOICE (as the brothers approach) I think I see them... Viljar! We   * saved a spot for you.   * Viljar sees his best friends - Simon and Anders (both 17). VILJAR   * Perfect!   * They hug and begin pitching their tents. SIMON   * So you brought a sleeping bag with   * you this time?   * VILJAR   * Yeah... my parents packed it.   * All around: excitement at the weekend ahead. CUT TO: MOVED EARLIER TO 4A 6   6   * EXT/INT. WHITE FARMHOUSE - EVENING 6A   6A   * BREIVIK loading a black peli-case: A Glock. A rifle. A shotgun. Thousands of rounds of ammunition. Grenades. He exits the farmhouse with the peli-case and drives away. CUT TO: 2.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 202
    },
    {
      "scene_number": 3,
      "slugline": "EXT. CENTRAL OSLO - GOVERNMENT DISTRICT - EVENING 7   7 Angle on Norway’s government buildings clustered together in the middle of the city, with a view of the harbour.   * AIDE MARIT (O.S.)   * Prime Minister, here is your agenda   * for the weekend. Saturday you will   * visit the AUF summer camp on Utøya.   * For your speech...   * CUT TO: INT. GOVERNEMNT PM OFFICE - TOP FLOOR - EVENING 8   8 Angle through the window: Oslo skyline with PM STOLTENBERG   * soft left of frame.   * PM AIDE 3 Prime Minister, here is your agenda   * for the weekend. Saturday, you’re   * visiting the AUF summer camp on   * Utøya. Attached is a draft of your   * speech...   * PM reads draft. PM AIDE 2 OYSTEIN   * I’ve started with your personal connection to the island. How it inspired your activism, and then you push on to the issues... PRIME MINISTER (scanning) OK…   I think it needs to be a bit more personal. More about my memories of the camp. And then I want to really address the challenge of youth unemployment. Can you get the latest stats over to me tonight, and I’ll re-draft   * and bring it in tomorrow.   * PM AIDE 2 OYSTEIN Yep.   * PRIME MINISTER (to AIDE 3)   * And make sure we schedule enough   * time for me to meet with the kids…   * two hours maybe?   * 3.",
      "characters": [],
      "action_text": "PM AIDE 3 Of course.   * PM AIDE 2 OYSTEIN And those committee papers are in   * your briefcase. You should read   * them before Monday.   * PRIME MINISTER The oil sector papers?   * PM AIDE 2 OYSTEIN Right.   * (to AIDE 3)   * Make sure he gets to them on   * Sunday. They’re pushing for a   * response.   * PRIME MINISTER Got it. Okay I think we’re all set.   * Well have a good weekend. Make sure   * you all get some rest.   * PM AIDE 2 OYSTEIN Will do thanks. Enjoy the island.   * Hopefully the weather will   * improve..   * PM walks away towards the door with AIDE 3.   * PM AIDE 3 You have National Security at 10 in   * the morning, Sir.   * They move out into a corridor.   * PRIME MINISTER I’ll do it in the Residency. Bring   * the Justice Minister earlier.   * (to office off screen)   * Have a good night.   * PM AIDE 4 (O.O.V) Goodnight Prime Minister.   * PRIME MINISTER Thank you.   * BODYGUARD (into radio)   * Coming down now.   * PM into lift.   * 4. PRIME MINISTER See you back here after lunch. PM AIDE 3 Good night, Sir. The lift doors closes. CUT TO: INT/EXT. GOVERNMENT OFFICE LOBBY - EVENING 9   9 PM crosses the lobby. Past a SECURITY GUARD.   * PRIME MINISTER Night, Tor. SECURITY GUARD   * Good night, Prime Minister.   * * The GUARD watches him walk out to his waiting car. Weighed down by the burdens of power. CUT TO: INT. PRIME MINISTER’S CAR - EVENING 9A   9A   * See PM alone on the backseat.   * CUT TO:   * EXT. UTØYA ISLAND - CAMPSITE - EVENING 9B   9B   * A campfire. Music, socialising.   * VILJAR, TORJE, SIMON and ANDERS around a fire pit. SOMEONE   * strumming a guitar. We see LARA RASHID (16) and her sister   * BANO (18) too.   * CUT TO:   * EXT. RURAL NORWAY - MAIN ROAD - NIGHT 10   10   * BREIVIK on the road towards OSLO.   * CUT TO: 5.",
      "dialogue_count": 0,
      "word_count": 578
    },
    {
      "scene_number": 4,
      "slugline": "EXT. WEST OSLO - BREIVIK’S MOTHER’S APARTMENT - NIGHT 11   11 He pulls up outside an apartment complex, in an up-market part of Oslo. CUT TO: INT. MOTHER’S APARTMENT - NIGHT 12   12 BREIVIK comes out of the bathroom, freshly showered.   * LATER: BREIVIK and his mother eating dinner in front of the   * TV: economic stagnation and the fall-out from the 2008 banking crisis. Europe’s growing migrant crisis.   * BREIVIKS MOTHER   * How is the farm?   * BREIVIK   * It’s good. A lot of work.   * BREIVIKS MOTHER   * I’ve been thinking, it must be   * lonely up there...   * BREIVIK   * I see people every day.   * BREIVIKS MOTHER   * Good.   * BREIVIK (gets up) I have an errand. CUT TO: INT/EXT. MOTHER’S APARTMENT - NIGHT 13   13 Angle from a window: Breivik into a small Fiat Diablo.   * His mother watching him from behind the curtain, as he draws   * away in the Fiat.   * CUT TO: EXT. FJORDS OUTSIDE OSLO - THE NEXT MORNING 14   14   *  Caption: 22 July 2011  6.",
      "characters": [],
      "action_text": "A sailing boat cuts through the water. CUT TO: INT. SAILING BOAT. BELOW DECK - EARLY MORNING 14A   14A GEIR LIPPESTAD (40s) a criminal lawyer, making coffee on a stove. His daughter REBEKAH(15)(in a wheelchair) watches. Other kids around. LIPPESTAD Ready to get home? REBEKAH’s eyes light up. LIPPESTAD (CONT’D) (smiling) Me too. CUT TO: EXT. SAILING BOAT - DECK - EARLY MORNING 15   15 LIPPESTAD comes up onto deck. Sees SIGNE, his wife. Hands her the coffee. SIGNE Better not... LIPPESTAD No? SIGNE Looks like I can’t drink coffee for   * a while... LIPPESTAD   * (finally gets it)   * Really?   * SIGNE   * Really.   * He starts laughing. They hug.   * LIPPESTAD   * Oh my God. How did that happen?   * 7. SIGNE   * (laughing)   * You’ve forgotten?   * LIPPESTAD   * I need to get cases reassigned. I   * really want to take time off this   * time.   * They round the headland towards Oslo.   * CUT TO: EXT. UTOYA ISLAND - CAMPSITE - MORNING 16   16 VILJAR wakes. Sees the rain. Wakes Torje next to him. They walk over to Simon and Anders’ tent. VILJAR Where did you get to last night? SIMON Swimming. With some girls from Finnmark. VILJAR (laughs) Swimming? With the enemy? They walk across the campsite to the canteen. We catch a glimpse of PM Stoltenberg’s photo, advertising his speech on the island tomorrow. Viljar checks the seminar noticeboard. See: ‘ If I was PM... ’ and ‘ Volunteering in Africa ’ etc. VILJAR (CONT’D) (reading) First seminar at 10. Football at 3. ANDERS Finnmark’s big guy at the back is out. VILJAR How do you know that? ANDERS Skinny-dipping. With the enemy. 8. Laughter as they head into the canteen. CUT TO: INT. BREIVIK’S BEDROOM - MOTHER’S APARTMENT - MORNING 17   17 BREIVIK at his computer. Writing an email:  Consider this my personal gift to all Europeans. Anders Behring Breivik.  BREIVIK’S MOTHER (V.O.) Breakfast.   * BREIVIK   * Leave it outside the door. BREIVIK swallows a couple of pills. Highlights a file:   *  “2083: A European Declaration of Indepe",
      "dialogue_count": 0,
      "word_count": 1259
    },
    {
      "scene_number": 5,
      "slugline": "EXT. GOVERNMENT OFFICE REAR - SAME TIME 28   28  CAPTION: 3:25PM.  The van parked. Unsuspecting pedestrians. Norway oblivious. CUT TO: INT. GOVERNMENT OFFICE LOBBY - SAME TIME 29   29 SECURITY GUARD on the phone to the DVLA. SECURITY GUARD I’ll check the number plate and   * I’ll try to find the driver.   * He glances over to CCTV screen, where... CUT TO: EXT. GOVERNMENT OFFICE REAR - SAME TIME 30   30 A second SECURITY GUARD is approaching the van. Suddenly: BOOM. The van explodes in a massive fireball. CUT TO: INT. PM’S RESIDENCY - STUDY TO SECURE ROOM - SECONDS LATER 31   31 PM goes to the window. Sees a huge tower of smoke rising in the distance. Suddenly: BODYGUARD 1 (enters at speed) Sir, we need you to leave. Now! His SECURITY DETAIL drag him out of the room. More guards responding. BODYGUARD 2 Lock down all exits! The PM is propelled through the kitchen. Someone gives him a bullet-proof vest. Down a stairwell. PRIME MINISTER Was it a bomb?? 13.",
      "characters": [],
      "action_text": "AIDE MARIT A massive explosion in the government district. That’s all we know. BODYGUARD 1 Get the doors open! Through a set of doors and into a bare situation room. BODYGUARD 1 (CONT’D) (into radio) PM secure. The doors close. The PM protected, but powerless. CUT TO: EXT. GOVERNMENT OFFICE REAR - SAME TIME 32   32 Government quarter devastated. Smoke, debris, paper cascading through the air. A gaping hole in the ground where Breivik’s van was parked. And from every direction the sound of sirens and screaming. CUT TO: EXT. OSLO HARBOUR - SAME TIME 33   33 LIPPESTAD and SIGNE docking in Oslo Harbour, looking at a   * huge column of smoke rising above the city. SIGNE: What is that??   * On LIPPESTAD. He looks down at REBEKAH.   * LIPPESTAD   * Let’s get in the car.   * CUT TO: EXT/INT. FIAT DOBLO/TUNNEL - ROAD TO UTØYA - SAME TIME 34   34 BREIVIK approaches the tunnel heading west out of the city. CUT TO: 14.",
      "dialogue_count": 0,
      "word_count": 337
    },
    {
      "scene_number": 6,
      "slugline": "EXT. GOVERNMENT BUILDING - REAR & LOBBY - SAME TIME 35   35 Blood-stained victims emerge. People screaming. Bodies on the ground.   * Police start to arrive. Staggered by the scale of the destruction. CUT TO: INT. PM’S RESIDENCY- SECURE ROOM - SAME TIME 36   36 Chaos as the SECURE ROOM begins to fill with AIDES. The PM   * watches news coverage.   * AIDE OYSTEIN   * (holding a phone) The whole quarter has been destroyed. The Prime Minister’s Office, Supreme Court, Justice Ministry. AIDE OYSTEIN (CONT’D) It’s bad. Bring up news of the explosion breaks on TV. AIDE MARIT Is this gas? A gas explosion?   * AIDE OYSTEIN   * That’s not a gas explosion, that’s   * a bomb. It’s got to be a bomb.   * On PM as he surveys pictures of the damage. On air   * speculation about the status of the government.   * SECURITY OFFICIAL LARS   * (enters, to comms) Can we get an update on security at the Residency please?   * PRIME MINISTER This is obviously a terrorist   * attack. We need to secure   * government. Call the cabinet. I want the Police Director, the Head of Defense and the PST. Get in contact with them now. And then we need to inform the King: The Prime Minister is safe, the government is functioning. 15.",
      "characters": [],
      "action_text": "SECURITY OFFICIAL LARS   * Yes, sir. CUT TO:   * EXT/INT. FIAT DOBLO/TUNNEL - ROAD TO UTØYA - SAME TIME 37   37 BREIVIK’s van comes out the tunnel. RADIO  We’re getting reports of an   *  explosion in central Oslo...  See BREIVIK. He looks down at his GPS. His destination: UTØYA ISLAND. CUT TO: EXT. UTØYA ISLAND - CAMPSITE/CANTEEN - DAY 38   38 VILJAR with TORJE, returning from the football. They see TEENAGERS by their tents, on their phones. Concerned faces. TORJE What’s going on? ANDERS   * An explosion in Oslo. Everyone’s   * been called to the canteen.   * VILJAR checks his phone as they head towards the building.   * CUT TO: EXT. UTOYA ISLAND - CANTEEN - CONTINUOUS 39   39   * We follow VILJAR and TORJE into the crowded canteen. SIMON   * and ANDERS too. Across the room: LARA and her sister BANO.   * MOTHER UTOYA Quiet please! I’m going to shout because the microphone is down... Room becomes still. As you’ve probably heard, there’s been an explosion in Oslo, in the government district. We don’t know yet what caused it, but many of you have parents who work there, so you should probably call them, if you haven’t already. 16. TORJE looks up at VILJAR. MOTHER UTØYA In the meantime, we’re suspending activities until we know what’s going on. VILJAR pulls out his phone. Starts to dial. As kids question   * MOTHER UTØYA.   * MOTHER UTØYA (CONT’D)   * We will tell you as soon as we know more. Now please don’t worry. This is Utøya - you’re safe here. VILJAR   * (into phone)   * Mum?   * CUT TO: EXT STREET/BUILDING - CENTRAL OSLO - SAME TIME 40   40 VILJAR’S PARENTS, CHRISTIN and SVEINN (30) emerge from a   * hotel door. The sound of sirens in the distance. Ahead of   * them, PEOPLE hurrying towards government centre. POLICE CARS   * passing.   * CHRISTIN   * (on phone)   * Hi, I’m fine. Dad’s with me. We’re   * at the hotel. We’re fine.   * SVEINN   * (looking at his phone)   * They’re saying it’s an explosion.   * CHRISTIN   * Dad says it’s some kind of   * explosion. ",
      "dialogue_count": 0,
      "word_count": 1504
    },
    {
      "scene_number": 7,
      "slugline": "EXT. UTOYA ISLAND - CAMPSITE - SAME TIME 51   51 Tight on VILJAR, as the sound of gunfire reverberates across the island. Around him TEENAGERS emerge from their tents. Confused looks. CUT TO: EXT. FERRY DOCK - SAME TIME 51A   51A BREIVIK on the move. Up the slope. Towards the campsite. CUT BACK TO: EXT. CAMPSITE - SAME TIME 51B   51B More cracks. Closer this time. ANDERS I’ll go and see what’s happening. CUT TO: EXT. SLOPE UP TO CANTEEN - SAME TIME 51C   51C BREIVIK still coming. Fast. CUT TO: EXT. Campsite - SAME TIME 51D   51D VILJAR watching ANDERS walk up towards the canteen. More loud bangs. The sound of screaming on the wind. VILJAR (to Torje)   * It’s okay, it’s just kids messing.. CUT TO: EXT. SLOPE UP TO CANTEEN - SAME TIME 51E   51E BREIVIK approaching the top of the rise. CUT TO: 23.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 149
    },
    {
      "scene_number": 8,
      "slugline": "EXT. CAMPSITE - SAME TIME 51F   51F VILJAR sees in the distance screaming TEENAGERS running towards their car.   * And behind them, BREIVIK cresting the hill. A moment suspended in time... as he raises his gun.   * VILJAR (realising) RUN! VILJAR grabs TORJE and runs, as BREIVIK opens fire. CUT TO:   * EXT. GOVERNMENT DISTRICT STREET - SAME TIME 52   52   * Viljar’s PARENTS, CHRISTIN and SVEINN, arrive at a corner   * just down from government centre. POLICE CARS, AMBULANCES.   * CROWDS milling around. Chaos.   * SVEINN   * (approaches a police   * officer)   * Was it a bomb?   * STREET POLICE OFFICER   * Move back! You have to move back!   * CHRISTIN   * Excuse me. Excuse me, Sir. I need   * to see my colleagues. We’re   * supposed to be having a campaign   * meeting. At Labour Party   * headquarter.   * STREET POLICE OFFICER   * Please move back! You can’t come   * through. We’re clearing this area.   * CHRISTIN   * Can you at least tell me which   * buildings have been hit?   * STREET POLICE OFFICER   * We don’t know. You just need to   * move back. Please.   * Suddenly her phone rings...   * The sound of screaming, running, and the phone being fumbled   * through hands.   * 24.",
      "characters": [],
      "action_text": "CHRISTIN Viljar?   * VILJAR   (V.O.) Mum, they’re shooting at us! CHRISTIN Viljar?? What’s- The phone line goes dead. SVEINN What is it? CHRISTIN   * (trying to call them back)   * It was Viljar. He said someone was   * shooting at them.   * SVEINN   * Shooting? What do you mean   * shooting?   * CHRISTIN   * He just said there was shooting and   * hung up.   * SVEINN   * Try him back.   * CHRISTIN   * (dialing)   * I’m calling him...   * SVEINN   * Shooting what? What did he say   * exactly?   * CHRISTIN   * It was really quick. He definitely   * said shooting.   * (listens)   * It’s going to voicemail.   * SVEINN   * Just someone is shooting?   * CHRISTIN   * (trying phone again)   * At us. He said: Mum. Someone’s   * shooting at us. Quietly. Just like   * that. That was it.   * 25. SVEINN   * (checking his phone too)   * Did he sound frightened?   * CHRISTIN   * Yes. I heard gunshots.   * They look at the chaos in front of them.   * SVEINN   * Gunshots? We need to get down   * there.   * They push their way through the chaos and start running to   * their car.   * CUT TO: EXT. UTØYA ISLAND - LOVER’S PATH - SAME TIME 53   53 Back to VILJAR and TORJE, running into the woods. Panic. Hundreds of TEENAGERS. Gunfire, screaming behind them. CUT TO: EXT. UTØYA ISLAND - CANTEEN - SAME TIME 54   54 BREIVIK approaches the main building. BREIVIK (Sees faces at the window) It’s okay. Police. I’ve got it under control. Stay there and I’ll come and help you. He goes into the building. CUT TO: INT. UTOYA ISLAND - CANTEEN CORRIDOR - CONTINUOUS 55   55 BREIVIK down a corridor. CUT TO: INT. UTOYA ISLAND - CANTEEN - SAME TIME 56   56 As dozens of TEENAGERS crouch in corners. Waiting to be saved. BREIVIK enters. Sees them. Raises his gun. CUT TO: 26.",
      "dialogue_count": 0,
      "word_count": 530
    },
    {
      "scene_number": 9,
      "slugline": "EXT. UTOYA ISLAND - CANTEEN - SAME TIME 57   57 The sound of gunfire and screaming from inside. CUT TO: EXT. UTOYA ISLAND - LOVER’S PATH - SAME TIME 58   58 VILJAR and TORJE running. Looking for somewhere - anywhere - to hide. VILJAR sees a break in a fence. They tumble down a muddy bank. Scramble sideways onto a ledge. A dead end. Below them an 8ft drop to the lake. They’re trapped.   * Other TEENAGERS crawl onto the ledge behind them. CUT TO:   * EXT. UTOYA ISLAND - CANTEEN - SAME TIME 59   59 BREIVIK leaves the canteen. Crosses the campsite.   * CUT TO: EXT. UTOYA ISLAND - LEDGE - SAME TIME71 60   60   * VILJAR and TORJE crammed together on the ledge. The shooting getting louder. He sees SIMON. But no ANDERS.   * VILJAR Torje, look at me. Look at me. TORJE tears streaming down face. VILJAR (CONT’D) It’s going to be ok.. CUT TO:   * EXT. UTOYA ISLAND - LOVERS PATH - SAME TIME 61   61 BREIVIK down the path. Sees the gap in the fence ahead.   * Climbs through it. Sees them all clustered on the ledge. Lifts his gun...   * He opens fire.   * PEOPLE falling. Panic. Screaming. VILJAR and TORJE jump. 27.",
      "characters": [],
      "action_text": "They land on rocks at the water’s edge and scramble for cover. BREIVIK shoots again. Simon hit. Two others as well. And then VILJAR is hit. He struggles back up, holding his shoulder. Another shot, he falls again. Another, still he keeps going. Desperately struggling to escape. And another. And then one last impact punctures his skull. TORJE turns back to see his brother fall. VILJAR sees TORJE coming back for him. VILJAR Go Mustering all his remaining strength he splashes water at TORJE. VILJAR (CONT’D) GO! TORJE turns and throws himself forward into cover.   * Through a haze of blood, he sees the dark figure looming   * above him on the clifftop, before he turns away into the trees. CUT TO: INT. HØNEFOSS POLICE STATION - DAY 62   62 A lone SWITCHBOARD OPERATOR. A quiet room. A red light on her switchboard begins to flash. SWITCHBOARD OPERATOR (answering) What’s your emergency- The sound of screaming down the end of the phone. Then it cuts. 28. SWITCHBOARD OPERATOR (CONT’D) Hello? The SWITCHBOARD OPERATOR puts down the phone. Almost immediately, another red light. SWITCHBOARD OPERATOR (CONT’D) Police emergency- SCREAMING VOICE Help us! Please SWITCHBOARD OPERATOR (struggling to hear) Hello? Hello? The line goes dead again. Beat. Suddenly: all the lights on the switchboard turn red. CUT TO: EXT. HØNEFOSS POLICE STATION - CONTINUOUS 63   63 HONEFOSS POLICEMAN #1 and his team scrambling to Utøya.   * POLICE DISPATCH (V.O.) Multiple reports of gunfire on Utøya Island... HONEFOSS POLICEMAN #1 On our way. What’s the RV point? CUT TO: INT. PM RESIDENCY - SECURE ROOM - DAY 64   64 Follow behind SECURITY OFFICIAL LARS on the phone as he   * approaches the PM - who is standing, watching news coverage,   * surrounded by several AIDES.   * SECURITY OFFICIAL LARS (holding phone)   * Sir, we may have another attack.   * We’ve just had reports of gunfire   * on Utøya Island.   * PRIME MINISTER What? Utøya? 29. SECURITY OFFICIAL LARS We’re just getting details now.   * PRIME MINIS",
      "dialogue_count": 0,
      "word_count": 1310
    },
    {
      "scene_number": 10,
      "slugline": "EXT. MAINLAND - GOLF COURSE JETTY - DAY 74   74 HONEFOSS POLICEMAN #1 arrives at RV point. DELTA UNITS arriving. The sound of distant gunfire throughout. VOICE OVER RADIO (V.O.) Unit A to the south end of the island, B to the north. (NB Correct terminology tbc) A police RHIB is frantically deployed. But it’s overloaded. The engine cuts out. HONEFOSS POLICEMAN #1 Shit! He spots a civilian boat approaching. OFFICERS unload into it. More precious moments wasted. CUT TO: EXT. MAINLAND - LAKE - SAME TIME 75   75 A handful of leisure boats speed away from the mainland   * towards the island.   * CUT TO: EXT. UTOYA SLAND - FOREST AREA 3 - SAME TIME 76   76 BREVIK sees them coming. CUT TO: EXT. UTOYA ISLAND -   TORJE SHORE - SAME TIME 77   77 So does TORJE.   * As they approach, he throws himself into the water and swims   * out from the cover of the cliffs, towards them.   * CUT TO: EXT. UTOYA ISLAND - FOREST AREA 3 - SAME TIME 78   78 BREIVIK sees TORJE. Opens fire. The tourist boat swerves. TORJE disappears under the surface. Swimming for his life.   * CUT TO: 34.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 198
    },
    {
      "scene_number": 11,
      "slugline": "EXT. LAKE - DAY 79   79 HONEFOSS POLICEMAN #1 behind the wheel of the second boat. Feels the engine straining. Willing it forward. The sound of gunfire ahead. CUT TO: EXT. UTOYA ISLAND   - FOREST AREA 3 - SAME TIME 80   80 BREIVIK ducks into cover, reloads, moves back across the island. CUT TO: EXT. LAKE - SAME TIME 81   81 TORJE still swimming.   * The sound of an engine behind him. He turns to see a second   * boat, the DRIVER waving frantically.   * TORJE is pulled onboard.   * TORJE (as the boat speeds away) No. Wait. We have to go back for my brother! More gunfire.   * DRIVER (steering the boat away) We can’t! We’ve got to go!   CUT TO: EXT. UTOYA ISLAND - VILJAR SHORE - SAME TIME 82   82 VILJAR fighting to stay awake. He starts to sing...   * CUT TO: EXT. UTOYA ISLAND - DELTA BOAT - DAY 82A   82A HONEFOSS POLICEMAN #1 speeds towards the island and catches a glimpse of BREIVIK in the trees. HONEFOSS POLICEMAN #1 One shooter. Two o’clock. CUT TO: 35.",
      "characters": [],
      "action_text": "EXT/INT. LIPPESTAD’S HOME. DAY 82B   82B   * LIPPESTAD and FAMILY pull up outside their home.   * LIPPESTAD unloads REBEKAH from the car, as SIGNE ferries the   * other kids inside.   * We follow them in. Through into the living room where SIGNE   * turns on the TV:   * Aerial footage above Utøya Island. Breaking news of suspected   * shooting.   * SIGNE   * (pulling out phone)   * I’m calling the hospital...   * On LIPPESTAD still watching the TV, as she dials.   * SIGNE (CONT’D)   * (into the phone)   * Hi. This is Signe. I’m watching the   * news. Do you need me to come in?   * (listens)   * I’ll standby.   * She hangs up.   * SIGNE (CONT’D)   * (to LIPPESTAD)   * They’re calling everyone in.   * They’ll let me know as soon as   * they’ve designated a hospital.   * LIPPESTAD nods as she runs upstairs.   * CUT TO: INT. PM RESIDENCY - SECURE ROOM - SAME TIME 83   83 The PM on a conference call. Grappling to make sense of the unfolding attack. SECURITY OFFICIAL ENDRE (OOV) Are DELTA on the island yet? Where   * the hell are they?   * PM AIDE 2 OYSTEIN (OOV) Activate mass casualty protocols.   * Repeat activate mass casualty   * protocols. I want every hospital on   * standby.   * 36. SECURITY OFFICIAL ENDRE (OOV) (on phone)   * I need an update on DELTA.   * PRIME MINISTER This is taking too long, right!   * CUT TO: EXT. UTOYA ISLAND - MAIN JETTY - DAY 84   84 HONEFOSS POLICEMAN #1 lands at the ferry dock. The island is eerily quiet. Rain, mist. He sees the bodies of MOTHER UTOYA and the SECURITY GUARD. He leads his unit in formation up the slope, past the white house. Towards the trees. CUT TO: EXT. UTØYA ISLAND - PINE FOREST - DAY 84A   84A   * In the distance, another massive burst of gunfire.   * Suddenly, a group of TEENAGERS burst out from bushes to his left, screaming. He motions to them: Stay hidden. He moves forward up into the woods towards the shooting. CUT TO: EXT. UTØYA ISLAND - BEACH - MOMENTS LATER 85   85 The SECOND UNIT land. Keep low as they move o",
      "dialogue_count": 0,
      "word_count": 577
    },
    {
      "scene_number": 12,
      "slugline": "EXT. UTOYA ISLAND - VILJAR’S BEACH - SAME TIME 85B   85B VILJAR lying on the rocks, bleeding out. Starting to fade.   * CUT TO:   * EXT/INT. UTOYA ISLAND - CANTEEN / MAIN HALL - DAY 86   86 HONEFOSS POLICEMAN #1’S UNIT emerge from the pine trees. His POV: the canteen building ahead of them.. Weirdly quiet.   * He leads his UNIT along the front of the canteen building. Scans the windows for threats. Moves inside... Down a corridor... into the main hall... Reveals a scene of utter horror. Bodies. Blood. HONEFOSS POLICEMAN #1 My God- The sound of gunfire. CUT TO: EXT. UTOYA. LOVERS PATH - SAME TIME 86A   86A The SECOND UNIT round a corner on the path... Ahead we catch a glimpse of a pile of bodies.   * CUT TO: EXT. UTØYA ISLAND - CANTEEN / FOREST AREA 5 - SAME TIME 86B   86B HONEFOSS POLICEMAN #1 AND HIS UNIT leave the canteen. Move through the trees. Suddenly he spots movement. Hand motions his UNIT: stop. He inches forward. Sees a black uniformed figure. Raises his gun until he has BREIVIK in his sights. HONEFOSS POLICEMAN #1 (calls out) LOWER YOUR WEAPON! ARMS UP! BREIVIK turns, drops his gun, and stands, open-armed. BREIVIK Don’t shoot! I surrender! He starts to walk towards them. 38.",
      "characters": [],
      "action_text": "HONEFOSS POLICEMAN #1 ON THE GROUND! GET ON THE GROUND! BREIVIK lies down. HONEFOSS POLICEMAN #1 moves swiftly towards him, gun to his head. DELTA OFFICERS bind his wrists with plastic strip   * cuffs. BREIVIK’s head in the mud.   * CUT TO: EXT. UTOYA ISLAND - VILJAR SHORE - SAME TIME 87   87 As news of the shooter’s arrest spreads over radio, a DELTA OFFICER climbs down the muddy slope and finds the shore littered with both injured and dead. VILJAR among them, lying motionless. DELTA OFFICER Casualties over here! MOVED TO 90A 88   88   * MOVED TO 90B. 89   89   * * EXT. UTOYA ISLAND - VILJAR SHORE - DAY 90   90   * Finally, a POLICE OFFICER reaches VILJAR, by the water’s   * edge. He has catastrophic injuries. His arm, hand and leg shot to pieces. The right side of his skull exploded open. POLICE OFFICER   * Jesus. He checks for a pulse. Nothing. Keeps checking. Then: POLICE OFFICER (CONT’D)   * (suddenly) I HAVE LIFE! He wraps a bandage, anything, around VILJAR’S shattered skull, covers his body with his coat. As OTHER OFFICERS scramble down the rock face. 39. POLICE OFFICER (CONT’D)   * (on his radio) WE NEED A CASEVAC NOW! Hold on VILJAR, as POLICE urgently wave a POLICE BOAT in.   * CUT TO: EXT. UTOYA ISLAND - WHITE BUILDING - DAY 90A   90A   * POLICE lead BREIVIK to the white building down by the jetty. Ahead of them, more boats arriving. ARMED POLICE and PARAMEDICS. CUT TO: INT. UTOYA ISLAND - WHITE BUILDING - UPSTAIRS ROOM -CONT’D 90B   90B   * HONEFOSS POLICEMAN #1 watches as POLICE swab, fingerprint, and photo BREIVIK. Macho poses for the camera. BREIVIK   * (noticing a cut on his   * finger)   * I need a plaster.   * HONEFOSS COP #1   * You’ll get no fucking plaster from   * me.   * DUTY DETECTIVE arrives and BREIVIK is sat in a chair. A   * dictaphone turned on.   * DUTY DETECTIVE   * (to BREIVIK)   * Who are you?   * BREIVIK   * My name is Anders Behring Breivik.   * Born February 13 1979. I’m from   * Oslo. This is a military operation.   * A coup d’et",
      "dialogue_count": 0,
      "word_count": 3897
    },
    {
      "scene_number": 13,
      "slugline": "EXT. GOVERNMENT BUILDING REAR - DAY 115   115 The PM’s car pulls into the government quarter. He gets out. Ahead of him: devastation.   * AIDE ØYSTEIN   * He drove along Grubbegata and   * parked at the rear of the building.   * (beat)   * We’re lucky the whole building   * didn’t come down.   * See the PM, lost in thought at the magnitude. CUT TO: INT.   PM’S RESIDENCY - LIVING ROOM (MEETING ROOM) - LATER 116   116 The PM in his living room - hastily transformed into a make- shift office.   A security meeting: The PST DIRECTOR, SECURITY   * OFFICIAL LARS, SECURITY OFFICIAL ENDRE, AIDE MARIT, AIDE   * OYSTEIN.   * PRIME MINISTER He buys 900 kilos of fertilser and   * aluminum nitrate, and no red flags?   * HEAD OF PST Sir, our focus has been on Islamist   * terror. Foreign threats.   * PRIME MINISTER But we know the Far-Right is   * growing fast.   * HEAD OF PST We can’t stop every threat. We did   * the best we could.   * PRIME MINISTER We should have done much better. I   * want to upgrade our national   * security. Intelligence. Defence.   * Policing. Everything. And I’m   * ordering a public inquiry. An   * inquiry into what happened and how   * we responded. Something went badly   * wrong. And we need to find out   * what. It’s the only way we’ll get   * through this.   * CUT TO: 59.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 236
    },
    {
      "scene_number": 14,
      "slugline": "INT. ULLEVAL HOSPITAL - OPERATING THEATRE - NIGHT 117   117 A surgical drill cuts into bone. A microscopic camera enters brain tissue. On a screen, SURGEONS remove fragments of Breivik’s bullet. VILJAR’S second operation. CUT TO: INT. ULLEVAL HOSPITAL - RECEPTION - NIGHT 118   118   * SVEINN on the phone. A TV in the corner while he waits for an   * answer. Sees news reports of rising public anger.   * SVEINN   * Hi. It’s Sveinn. Christin asked me   * to call. She’s suspending the   * campaign. And Torje’s staying here   * with us. I’ve told the school.   * The news report changes on the TV.   * SVEINN (CONT’D)   * (watching TV)   * Ok, thanks. She’ll appreciate that.   * Bye.   * Then he calls Torje’s school.   * Lastly, he calls work.   * SVEINN (CONT’D)   * Listen, can you hand over my field   * work to Erik? And make sure the new   * mercury data gets put into the   * system. Yeah, I’m fine.   * (beat)   * We’ve just got to take it one day   * at a time.   * He hangs up and watches the TV as BREIVIK’S FATHER gives an   * interview:   * BREIVIK’S FATHER   * I haven’t seen Anders in years. I   * am appalled… I think it would have been better if he had just killed himself. SVEINN walks away. CUT TO: 60.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 226
    },
    {
      "scene_number": 15,
      "slugline": "INT. ULLEVAL HOSPITAL - VILJAR’S ICU ROOM - CONTINUOUS 119   119 SVEINN reaches VILJAR’s room. CHRISTIN and TORJE are sitting.   * He puts his arm around TORJE.   * SVEINN   * (to CHRISTIN)   * You OK?   * CHRISTIN   * Yeah. I’m fine.   * The LEAD SURGEON enters.   * See them struggling to keep it together.   * Through an angle in the window, we see VILJAR brought back   * from theatre.   * LEAD SURGEON   * Viljar’s in recovery. I’m afraid we   * couldn’t get all the shrapnel. It   * was too deep. We’ll have to wait   * for him to wake up, before we can   * assess the damage. Our concern   * right now is infection. We’ve put   * him on some strong antibiotics, and   * we’re monitoring him closely. But   * there’s nothing more we can do for   * Viljar now. He needs to wake up.   * CUT TO: INT. LIPPESTAD’S OFFICE - MEETING ROOM - DAY 120   120 Boxes of police evidence on the table. LIPPESTAD, VIBEKE DEF. LAWYER, and TWO ASSISTANTS leaf through files. VIBEKE DEF. LAWYER (V.O.) It was a very dysfunctional family.   * Breivik’s parents split   * acrimoniously when he was very   * young.   * Insert: LIPPESTAD looks at ABB’s SOCIAL SERVICES FILES.   * VIBEKE DEF LAWYER His mother couldn’t cope. She wrote   * to Social Services asking for help.   * They put Breivik under psychiatric   * observation. They had serious   * doubts about his mother’s capacity   * to parent.   * 61.",
      "characters": [],
      "action_text": "LIPPESTAD And his father? VIBEKE DEF. LAWYER After the marriage collapsed, his   * father cut him off.   * LIPPESTAD And the half-sister?   * Insert: LIPPESTAD looks at a photo of YOUNG BREIVIK.   * VIBEKE DEF. LAWYER She emigrated to California. When   * he was about 16 I think.   * LIPPESTAD 16? 17?… Yeah ok… Thank you.   * VIBEKE DEF. LAWYER It was just him and his mother   * after that.   * Insert: LIPPESTAD looks at photos of TEENAGE BREIVIK.   * LIPPESTAD He was obviously very isolated all   * the way into adulthood. Always had   * trouble fitting in.   * LIPPESTAD ASSISTANT 2 Not exactly the picture he painted. VIBEKE DEF. LAWYER No, not it’s not.   * INSERT: LIPPESTAD opens a   file of crime scene photos. Photos of DEAD BODIES. LIPPESTAD So what are we talking about here? Pursuing insanity as a defense? LIPPESTAD ASSISTANT 2 It’s possible. VIBEKE DEF. LAWYER How else do we explain it?   * CUT TO: 62.",
      "dialogue_count": 0,
      "word_count": 406
    },
    {
      "scene_number": 16,
      "slugline": "EXT. BREIVIK’S MOTHER’S HOUSE - DAY 121   121 LIPPESTAD pulls up outside. Looks at the apartment block. CUT TO: INT. BREIVIK’S MOTHER’S HOUSE - DAY 122   122 LIPPESTAD opposite BREIVIK’S MOTHER. The curtains closed. LIPPESTAD My name is Geir Lippestad. I’ve been appointed by your son to lead his defence. Now I know Anders   * doesn’t have a relationship with   * his father. So I wanted to ask you   * some questions. We need to decide   * how to build his case. BREIVIK’S MOTHER Yes, of course. LIPPESTAD What was Anders like as a child? BREIVIK’S MOTHER He was a normal boy. Kind, clever Lots of friends. He loved his mother. I was a single parent after   * his father left us, but I made sure   * he had a normal childhood. We had a very nice house. LIPPESTAD Did he have any medical conditions? Any mental health issues? BREIVIK’S MOTHER Oh no. LIPPESTAD Was he ever violent? BREIVIK’S MOTHER Never. He loved me. He loved affection. LIPPESTAD   * Did you have any dealings with social services?   * He sees her hands shaking. She’s on the edge.   * * 63.",
      "characters": [],
      "action_text": "BREIVIK’S MOTHER That was nothing. Welfare state sticking their nose in. I thought I   * needed their help, but I didn’t. He   * was fine. LIPPESTAD I see. (beat) Did you have any sense recently   * that Anders was having problems?   * BREIVIKS MOTHER   * No.   * (beat)   * I told the police that I saw he had   * guns in his bedroom. But he told me   * he needed them for hunting. I   * believed him.   * LIPPESTAD   * Would you consider testifying in   * Anders’ defense? BREIVIKS MOTHER What would I say? LIPPESTAD Just that there were problems. In   * his childhood. It would help him.   * BREIVIK’S MOTHER But then everyone will know.   * LIPPESTAD Anders is entitled to a defense, just like everyone else. BREIVIKS MOTHER   * But I’ll be the most hated mother   * in Norway.   * LIPPESTAD   * Please consider it.   * LIPPESTAD goes to the door. BREIVIK’S MOTHER He’s sort of right though, isn’t he. About the way the country is going. It’s not what it used to be. CUT TO: 64.",
      "dialogue_count": 0,
      "word_count": 370
    },
    {
      "scene_number": 17,
      "slugline": "INT. ULLEVÅL HOSPITAL - VILJAR’S ICU ROOM - NIGHT 123   123 VILJAR still unconscious. CHRISTIN exhausted. Outside SEVERAL DOCTORS confer with SVEINN, obviously concerned. SVEINN (comes in) He should have woken by now. His   * temperature is up. Might be   * infection.   * They watch the DOCTORS leave. SVEIIN I’ll take Torje back to the hotel. Will you be OK? CHRISTIN I’ll be fine. SVEIIN Call me if anything changes. CHRISTIN   * Can you bring me clothes?   * SVEIIN   * Sure.   * TORJE (suddenly) He told me to go. He told me to leave him! CHRISTIN   * (hugs him) It’s okay. You did the right thing.   * See TORJE, in anguish.   * SVEINN   * (putting his arm around   * him)   * Come on.   * They leave. CHRISTIN sits for a moment. Then softly, starts to sing. A   * nursery rhyme. We recognise it. Viljar sang it on the island. CUT TO: 65.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 153
    },
    {
      "scene_number": 18,
      "slugline": "EXT. OSLO - DAWN 124   124 CUT TO: INT. ULLEVÅL HOSPITAL - VILJAR’S ICU ROOM - EARLY MORNING 125   125 A tap at the door. CHRISTIN looks up. It’s LARA. LARA Hi, I’m Lara… CHRISTIN Hi Lara.. LARA I was on the island. I’m visiting survivors. How’s Viljar? CHRISTIN He needs to wake up. They both look down at VILJAR. CHRISTIN (CONT’D) Are you OK? LARA I’m fine. (beat) My sister didn’t make it.   * CHRISTIN I’m so sorry. She hugs LARA. It’s a bit awkward.   * CHRISTIN (CONT’D) What was her name? LARA Bano. A moment between them. CHRISTIN She’d be so happy you’re alive, Lara. SVEINN enters with TORJE, fresh coffee. He looks exhausted. Sees LARA. 66.",
      "characters": [],
      "action_text": "CHRISTIN This is Lara. She was on the island. She wanted to see how Viljar was doing. SVEINN That’s kind. CHRISTIN Do you know Viljar well? LARA No, but everyone knows Viljar. I   * played against him in the football.   * He’s good!   * SVEINN smiles. An awkward silence. LARA (CONT’D) I should go.  ( beat) I’ll come back when he wakes up. It’s a small but powerful gesture of faith. CHRISTIN Thank you. She turns back to VILJAR, still unconscious. CUT TO:   * EXT. LIPPESTAD’S HOUSE - NIGHT 126   126 LIPPESTAD parks. CUT TO: INT. LIPPESTAD’S HOUSE - CONTINUOUS 127   127 LIPPESTAD enters. SIGNE is asleep in front of the TV. News   * reports of race crimes across the country.   * He checks on REBEKAH. He changes her oxygen tank. Lifts her   * into a more comfortable position.   * The phone goes. He crosses the landing. Answers.   * VOICE   * You fucking Nazi lover. I know   * where you live. I’m going to make   * sure you and your family rot in   * hell.   * 67. The line cuts.   * Lippestad comes back down to the lounge. A furtive look out   * the window.   * As from the TV we hear: Anger engulfing the nation.   * LIPPESTAD   * (gently wakes Signe)   * Hey...   Come on, I’ll take you up.   * As she gets up:   * SIGNE   * Who was that?   * LIPPESTAD   * Just the office.   * SIGNE   * That’s the third one tonight.   * See LIPPESTAD.   * LIPPESTAD   * Don’t answer the phone anymore. And   * keep the children inside. I’ll ask   * the police to watch the house.   * Just for the moment. While people   * are angry.   * CUT TO:   * EXT. PM RESIDENCY - NIGHT 128   128   * GJORV   * (leaving PM’s residency)   * I have just met with the Prime   * Minister. He has asked me to   * conduct a searching and independent   * inquiry into the attacks on 22   * July. I have accepted and our work   * will begin immediately. Thank you.   * CUT TO:   * INT. PM’S RESIDENCY - SAME TIME 128A   128A   * The PM in his hallway addresses the Press.   * 68. PRIME MINISTER   * This inquiry is of vital ",
      "dialogue_count": 0,
      "word_count": 2772
    },
    {
      "scene_number": 19,
      "slugline": "INT. ULLEVÅL HOSPITAL - VILJAR’S NEW ROOM - DAY 151   151 A NURSE carefully removes VILJAR’S bandages on his shoulder.   * Revealing angry red wounds. CHRISTIN watches. Sees VILJAR is   * in pain.   * CHRISTIN   * (to nurse)   * Can we get him something for the-   * VILJAR No. No more morphine. LATER: CHRISTIN feeds VILJAR. Dabs his mouth with a cloth.   * VILJAR silent, submissive.   * CUT TO: INT. ULLEVAL HOSPITAL - CORRIDOR TO MEETING AREA - DAY 152   152   * CHRISTIN pushes VILJAR in the wheelchair. Her phone rings. She turns it onto silent.   * VILJAR How’s the campaign going? CHRISTIN People are angry. VILJAR Shouldn’t you be there? CHRISTIN I’m not leaving you. VILJAR   * So how does that work on election   * night? CHRISTIN I can Skype. VILJAR Skype? Seriously?   * CHRISTIN Yeah, Skype. Maybe you could Skype   * with me? If you’re up to it...   * VILJAR Only if you win... 82.",
      "characters": [],
      "action_text": "CHRISTIN (the first time she’s seen him smile) I’ll try. Her phone goes again.   * VILJAR Take it. CHRISTIN I’ll call them later. VILJAR It’s a fucking election. Take it. A moment between them.   * She takes the call, leaving VILJAR. He looks around, uncertain in the BUSY corridor. Then he hears the sound of a TV. Wheels towards it... TV REPORT ...Norwegians are convinced Breivik is trying to cheat justice, and have reacted with an outpouring of national anger. CITIZEN VOX POP   * He kills 77 people and doesn’t go   * to jail? It makes me ashamed to be   * Norwegian.   * CITIZEN VOX POP 2   * I feel so sorry for those parents.   * The thought of him walking the   * street...   * FAMILY LAWYER The families have made their submissions to the court, in the strongest terms. We oppose Mr.   * Breivik’s insanity plea, and we   * await the court’s decision.   * VILJAR turns a corner. Comes face-to-face with BREIVIK on the   * TV.   * TV REPORT (over footage of Breivik led into courtroom) (MORE) 83. Meanwhile Breivik’s trial has been   * set for 16th April... AND WE HARD CUT   * TO: EXT. UTOYA ISLAND - VILJAR SHORE - A FLASHBACK 153   153   * Gunfire. Running. Screaming. And that DARK FIGURE looming   * over the clifftop. CHRISTIN (O.O.V) Viljar! CUT TO: INT. ULLEVAL HOSPITAL - CORRIDOR TO MEETING AREA - SAME TIME 154   154 CHRISTIN (bringing him back to reality) Viljar! See VILJAR. Battling fear and rage. CHRISTIN (CONT’D) He can’t get you. He’s never going to get you. CUT TO: INT. PM'S RESIDENCY - LIVING ROOM - NIGHT 155   155   * The PM watching election results. Alone. The mood is sombre.   * The Labour Party retain power, but the Right have made striking gains across the country. TV REPORTER ...there is no question Norway is following the European trend. Hard- line right-wing parties are growing in strength... and the question has   * to be asked, are people losing   * faith in the system? Are they   * beginning to give up on democracy?   * Hold on the PM.   * CUT TO: ",
      "dialogue_count": 0,
      "word_count": 517
    },
    {
      "scene_number": 20,
      "slugline": "INT. ULLEVAL HOSPITAL - VILJAR’S NEW ROOM - NIGHT 156   156 CHRISTIN on her laptop. Her family around her. CHRISTIN (to Skype camera) I’m honoured to become Mayor of Svalbard, and I want to thank   * everyone for being so understanding. It’s been a difficult time, but hopefully we will be home soon. (beat) Oh and Viljar has a message. She adjusts the computer. VILJAR (this is difficult) Hi, everybody! Hope you can hear me? And I don’t look too scary! (he struggles, then) I’m very proud of my mum. Hopefully they’ll let me out of this place soon and we’ll all get home for Christmas. CHRISTIN (steps in) So tonight we’re going to have a little celebration here in the hospital. And in the morning I’ll get to work, because we have so much to do to heal our country. She ends the call. The room subdued, the whole family strangely empty. CUT TO: INT. ULLEVAL HOSPITAL - PHYSIO ROOM - MORNING 157   157 VILJAR trying to stand. A PHYSIOTHERAPIST assisting. His good hand pushes down hard into the bench. His legs shake as he   * forces his body up. PHSYIO Steady... VILJAR takes a step. Then his legs buckle. He shouts out in pain. The PHYSIO catches him. 85.",
      "characters": [],
      "action_text": "Close on VILJAR, all energy spent, angry and afraid. CUT TO: INT. ULLEVAL HOSPITAL GARDENS - DAY 158   158   * VILJAR walking slowly with a frame. Managing the pain as best he can. Lara next to him. VILJAR I’m so fucking helpless. I mean   * look at me. I can barely walk. I   * can’t eat on my own. I can’t piss without being terrified. (beat) It makes me so fucking angry.   * LARA   * You want to stop?   * VILJAR   * No   * LARA   * Go slowly...   * VILJAR   * And I get flashbacks.. Do you get   * the fucking flashbacks? LARA Yeah. I had one yesterday. Some   * people across the street started to   * run. For a bus or something   * completely ordinary. But I started   * to run too. I don’t know why, but I   * felt like he was right behind me,   * over my shoulder, he was this   * big...   * VILJAR   * (interrupting) 20-foot high. With a huge gun. Just fucking huge. High above you, right? LARA   * Yeah. Exactly...   * (beat)   * I just kept running.   * VILJAR   * That’s easy for you to say...   * 86. LARA   * Right! Sorry.   * VILJAR   * No, it’s OK - you want to race?   * They laugh.   * Later: they sit in the hospital cafe.   * VILJAR looks over to a newspaper picture of BREIVIK.   * VILJAR (CONT’D) They’re saying he’s insane. Do you think he’s insane? LARA I don’t know. Maybe.   * VILJAR I saw him like This close.   * (beat) He knew what he was doing. Definitely.   * LARA   * What are you going to do? When you   * get out?   * VILJAR   * I don’t know... I can’t see the   * future. It’s like I’m still there   * on the rocks. Like I’m out there in   * no man’s land. Do you know what I   * mean?   * LARA   * Yeah. But we survived. Right?   * VILJAR   * Yeah. But what does that even mean?   * See VILJAR’s doubt. LARA   * I really don’t know... That we have   * to try to live?   * CUT TO:   * 87.",
      "dialogue_count": 0,
      "word_count": 569
    },
    {
      "scene_number": 21,
      "slugline": "INT. ILA PRISON. BREIVIK'S CELL - SAME TIME 158A   158A BREIVIK in his cell... CUT TO: EXT/INT. COURTHOUSE - JUDGES CHAMBERS - NIGHT 159   159   * LIPPESTAD up the front steps. Looking concerned. We follow him into the chambers. He sees the Prosecution lawyers INGA and SVEINN. And FAMILY LAWYER. The JUDGE enters. JUDGE ARTNZEN After careful consideration the   * Court has decided to allow further   * psychiatric assessment of Mr.   * Breivik.   * (sees LARSEN stand) Yes, Ms. Larsen? FAMILY LAWYER Your Honour, the families welcome this decision. And they thank you.   * We will call our own psychiatric   * experts to give evidence in the   * trial.   * LIPPESTAD (standing) Your Honour, the court has already   * had Mr. Breivik psychiatrically   * examined. Allowing further   * assessment has no precedent in law.   * JUDGE ARTNZEN Mr, Lippestad, the court is trying to do what’s best for Norway. See LIPPESTAD. This is a reverse. CUT TO: INT. ILA PRISON - HOLDING ROOM - DAY 160   160 LIPPESTAD watching BREIVIK reading the Court’s judgement.   * BREIVIK Why are they doing this? 88.",
      "characters": [],
      "action_text": "LIPPESTAD They want you to answer for what you did. BREIVIK  But   this is my trial.   * LIPPESTAD Victims have rights too. They have   * to be able to call their witnesses   * and testify, just as you can. It’s   * their right, Anders.   * Hold on BREIVIK, angry at being checked for the first time. CUT TO: INT. ULLEVÅL HOSPITAL - VILJAR’S NEW ROOM - DAY 161   161 VILJAR packing his things into a bag (now with a stick). Sudden silent shards of memory: ANDERS and SIMON’s faces, laughing as they unpack by their tents. CUT TO:   * * EXT. ULLEVAL HOSPITAL - MAIN ENTRANCE - DAY 162   162 LARA watches from the curb, as VILJAR is helped into the back   * of a people-carrier. He sits next to TORJE. TORJE quickly   * looks away.   * LARA   * Hi! I wanted to see you off. Will   * you be alright?   * VILJAR   * Yeah. It’s gonna be good to get   * home. What about you? Will you be   * OK?   * LARA   * Yep. I’ll be fine. I have to look   * for a job to keep myself busy, so I   * don’t think about things.   * SVEINN walks over to them.   * SVEINN   * Nice to see you again.   * 89. LARA   * You too.   * (to VILJAR)   * I’ll call you.   * VILJAR   * Sure.   * CHRISTIN comes up and says goodbye to LARA. Viljar gets into   * back of the van.   * LARA We’ll have that race when you get   * back to Oslo then.   * VILJAR   * I’m going to do some serious   * training and then I’ll beat you!   * CHRISTIN closes the door and gets into the car.   * LARA watches the car pull away.   * CUT TO: EXT. SVALBARD - AERIAL - DAY 163   163 A remote island in the ARCTIC SEA. 2000km from OSLO. Snow and mountain wilderness.   A kind of Eden. CUT TO: INT. HANSSEN CAR - CONTINUOUS 163A   163A   * VILJAR and FAMILY drive towards the small community of   * Longyearbyen.   * CUT TO:   * EXT/INT. SVALBARD - VILJAR’S HOME - DAY 164   164 They pull up outside a small clapper-board home. A snow-   * mobile parked outside.   * VILJAR gets out of the car. He struggles to walk.   * They enter and CHRISTIN helps VIlJ",
      "dialogue_count": 0,
      "word_count": 778
    },
    {
      "scene_number": 22,
      "slugline": "INT. ILA PRISON - BREIVIK’S CELL - DAY 166   166   * BREIVIK angrily pacing. Deep in thought. BREIVIK (suddenly) Guard. CUT TO: EXT. PLAY SCHOOL - DAY 166A   166A   * Establisher of playschool. KIDS play outside.   * CUT TO: INT. PLAY SCHOOL - EMPTY CLASSROOM - CONTINUOUS 166B   166B   * SIGNE and LIPPESTAD in a meeting with HEADMISTRESS.   * HEADMISTRESS   * There have been complaints. From   * parents. Because you’re defending   * such a dangerous man.   * LIPPESTAD   * Meaning?   * HEADMISTRESS   * They’re worried about the school   * being targeted.   * HEADMISTRESS (CONT’D)   * It’s a very difficult time. We have   * to think about what’s best for   * everyone.   * SIGNE   * Seriously?   * HEADMISTRESS   * I’m sorry. But you need to find   * another school.   * CUT TO: EXT. PLAY SCHOOL - STREET - CONTINUOUS 166C   166C   * LIPPESTAD and SIGNE leaving the school, with their DAUGHTER. 92.",
      "characters": [],
      "action_text": "SIGNE   * There’s Frogner down by the museum.   * At least it’s nearer.   * LIPPESTAD   * Is it good?   * SIGNE   * It’s okay. It wasn’t the one we   * chose.   * (suddenly she breaks down)   * I’m sorry. I’m sorry.   * LIPPESTAD holds her.   * AND WE CUT TO:   * OMITTED. 167   167   * INT. ILA PRISON CORRIDOR - NIGHT 167A   167A LIPPESTAD is led by a GUARD down the corridor... CUT TO: INT. ILA PRISON - HOLDING ROOM - NIGHT 168   168 BREIVIK   * I want to change my plea. I’m not   * insane.   * LIPPESTAD (hasn’t seen this coming) But you agreed to this defense.   * The psychiatric assessment said you   * were ill.   * BREIVIK I was playing a role. I was playing   * the monster in a nightmare. But I’m   * not a monster. I’m a soldier in a   * war, doing my duty. A leader. And a   * leader does not give away his   * power. I’ve allowed the families to   * take control, but this is my trial.   * I decide how it ends. I have to   * prove these attacks meant   * something.   * (beat)   * And I need to be judged for what I   * did.   * 93. LIPPESTAD You’ll go to prison. For the rest of your life. BREIVIK I have to finish what I started.   * Standing up in the court. I have to   * stand up for what I believe in.   * That’s the third attack. That’s the   * whole point of this. That is how I   * win.   * CUT TO: EXT. ILA PRISON - NIGHT 169   169 LIPPESTAD walks away from the prison. CUT TO:   * INT. LIPPESTAD’S OFFICE - DAY 170   170 Piles of files across every surface. LIPPESTAD looks tired.   * LIPPESTAD (to his TEAM)   * He wants to change his defense. He   * wants to plead guilty.   * LIPPESTAD ASSISTANT 1 Has he given any reason? I mean,   * why?   * LIPPESTAD He wants to stay in control.   * VIBEKE DEF LAWYER And he knows the consequences?   * LIPPESTAD He wants to stand up and be   * accountable for his actions.   * * LIPPESTAD ASSISTANT 2 It’s going to be very hard. The   * psychiatric assessment was clear.   * He’s been diagnosed insane. And the   * Prosecution are ",
      "dialogue_count": 0,
      "word_count": 762
    },
    {
      "scene_number": 23,
      "slugline": "INT. SVEINN’S OFFICE - DAY 172C   172C   * SVEINN in his more spartan office space. A couple of   * computers. Science equipment, outdoor gear, charts tracking   * migration patterns across the Arctic Sea.   * See SVEINN, trying to engage with his work.   * CUT TO:   * INT. SVALBARD HOSPITAL - MRI UNIT - DAY 173   173 VILJAR lying in an MRI tunnel. The screen showing his damaged brain. CUT TO: INT. SVALBARD HOSPITAL - EXAMINATION ROOM - DAY 174   174 An EYE DOCTOR carefully fits a prosthetic eye into VILJAR’S empty socket. Bright blue, but lifeless. SECOND DOCTOR (O.O.V) How are you Viljar? CUT TO: INT. SVALBARD HOSPITAL - DOCTOR’S ROOM - DAY 175   175 VILJAR in front of a SECOND DOCTOR. VILJAR (he shrugs) My head hurts. All the time. And my shoulder. (beat) I get phantom pain... SECOND DOCTOR That’s natural. See VILJAR, it doesn’t feel natural to him. SECOND DOCTOR (CONT’D) This is going to be a long recovery, Viljar. The bullet fragments are less than a tenth of a millimeter from the major nerve centres in your brain. The slightest movement- 96.",
      "characters": [],
      "action_text": "VILJAR (cuts him off) I know what the fucking dangers are. CUT TO: EXT. SVALBARD - STREET - DAY 175A   175A   * VILJAR walking painfully back from the hospital.   * A sudden noise - he flinches, frightened.   * CUT TO:   * INT. SVALBARD - VILJAR’S HOME - BATHROOM - DAY 176   176   * Close up in a mirror: VILJAR, topless, looks at his false   * eye. The red scars across his skull, shoulder. His deformed   * hand.   * In the background: BREIVIK is on TV. Dominating the   * headlines. Holding the country to ransom.   * Hold on VILJAR. No escape. As we track in, we feel his anger   * rising. He punches the mirror.   * CUT TO: EXT. VILJAR’S HOME - CONTINUOUS 176A   176A   * VILJAR slewing his snow mobile down the hill.   * CUT TO:   * INT. VILJAR’S HOME - SAME TIME 176B   176B   * TORJE runs up the stairs   * TORJE   * Mum, Dad!   * CHRISTIN and SVEINN look out the window. See VILJAR speeding   * away.   * They run down to the pick-up.   * AND WE HARD CUT   * TO:   * 97. OMITTED. 177   177   * MOVED TO 187A 178   178   * EXT. SVALBARD - SNOW - SNOWMOBILES - NIGHT 179   179   * A POV at speed through dense snow. VILJAR on the snow mobile. Riding hard.   * Back to the POV again: Round a bend. See Viljar pushing on. Faster, faster. As if daring to crash. Now lights behind... SVEINN and CHRISTIN coming after him in a pick-up. Desperate to catch him. VILJAR turns a sharp bend. Faster still. Another bend. And another. See VILJAR, closing on the trees. Closing, closing... until at the last minute he ploughs into a soft snow drift. SVEINN   * (out of the pickup)   * Viljar!!   * He and CHRISTIN run over to him. VILJAR walking away.   * CHRISTIN   * Wait!   * VILJAR   * I can’t live like this! Thinking   * I’m going to get better. I’m not.   * It’s all still here. In my head. I   * can’t get rid of it.   * They get closer. He turns.   * VILJAR (CONT’D)   * What the fuck am I supposed to do?   * Tell me! Tell me!   * SVEINN   * I don’t know. I wish it had been me   * not you.   * ",
      "dialogue_count": 0,
      "word_count": 1679
    },
    {
      "scene_number": 24,
      "slugline": "INT. TROMSO - HOTEL/MEETING ROOM - DAY 194   194 Follow CHRISTIN towards a room, crowded with PARENTS and their LAWYERS. She pauses outside. Hears a loud argument in   * progress. She opens the door and slips into the back as the   * argument rages.   * PARENT 1   * I just don’t see how it can be   * right that he’s allowed to speak.   * My daughter can’t leave her bedroom   * because of him. He broke her, and   * now he gets to stand up there and   * tell us how he did it.   * FAMILY LAWYER The court has to observe his rights. PARENT 1   * But he doesn’t deserve rights! PARENT 2   * He’s trying to use this trial as a   * platform for his propaganda.   * FAMILY LAWYER I will be there to ensure that   * doesn’t happen. PARENT 2   * But it is happening. That’s exactly   * what he’s doing.   * FAMILY LAWYER   * Look, the judge is letting us bring   * our own psychiatric experts, and we’re closing the trial with victim impact statements-   * PARENT 3   * They should just hang him.   * FAMILY LAWYER   * Listen, I promise you, we will have   * our chance to-   * PARENT 3   * But it’s not enough! This isn’t   * justice! They should just string   * him up. Be done with it.   * See CHRISTIN. Finally she can’t take it anymore. 106.",
      "characters": [],
      "action_text": "CHRISTIN   * (to everyone)   * Our children won’t get justice by   * executing him.   * (beat)   * I know you’re angry. I’m angry too.   * And my sons came back. Many of your   * children didn’t. But we can’t surrender to our anger, no matter   * how much we feel it. Somehow we have to learn to trust the world again. To trust each other. We have to reconnect. And that begins when   * we walk into that courtroom. (beat) Our power will come from how we respond to this man. Not in how we silence him. We have to trust in justice. That’s the only way we’ll win. CUT TO: EXT. TROMSO - HOTEL - LATER 195   195 CHRISTIN by her car.   * FAMILY LAWYER   * Christin!   * She hands CHRISTIN a letter.   * FAMILY LAWYER (CONT’D)   * Would you mind giving this to   * Viljar?   * (beat)   * I would like him to testify, if you   * think he’s up to it?   * CHRISTIN   * I’ll give it to him.   * FAMILY LAWYER   * Thanks.   * CUT TO: EXT. SVALBARD - STREET - NIGHT 196   196   * VILJAR walks away from the house. Opens the envelope. Reads.   * 107. CHRISTIN (OOV)   * They want him to testify...   * CUT TO:   * INT. SVALBARD - VILJAR’S HOME - LIVING ROOM - LATER 197   197 Angle on VILJAR out of the window. TV on in living room. SVEINN He doesn’t have to do it. We can get the doctor to excuse him. CHRISTIN   * Maybe he needs to.   * SVEINN   * What does that mean?   * CHRISTIN   * Maybe he needs to face it.   * SVEINN How do we know it won’t set him back? CHRISTIN We don’t. It’s his choice. CUT TO: EXT. SVALBARD - STREET - BEDROOM - SAME TIME 198   198   * VILJAR gets out phone and dials.   * LARA’S VOICE Viljar? VILJAR Hey. LARA’S VOICE I was worried about you.   * VILJAR   * I’m fine...   * (beat)   * I just received a letter. They want   * me to appear. At the trial.   * 108. LARA   * Me too.   * On Viljar, flash of relief.   * LARA (CONT’D) Do you think you can face him? Suddenly we’re back on the island. Gunfire. Screaming. And the DARK FIGURE looming above. LARA’S VOICE Viljar? VILJAR fo",
      "dialogue_count": 0,
      "word_count": 711
    },
    {
      "scene_number": 25,
      "slugline": "EXT. ILA PRISON - DAY 201A   201A Breivik’s white van convoy leaves through the prison gates. CUT TO: EXT. COURTHOUSE - DAY 1 - DAY 202   202 ANGRY CROWDS mass behind barriers. ARMED POLICE, SNIFFER   * DOGS. And the world’s MEDIA too. CUT TO: INT. COURTROOM - DAY 1 - DAY 203   203 Follow LIPPESTAD into the empty courtroom. A moment on his own. Then the prosecution lawyers, INGA and SVEINN enter. Then the FAMILY LAWYER and her team. The soft shuffle of legal papers, as we hear the gathering sound of an angry roar outside. AND WE CUT TO: EXT. COURTHOUSE - UNDERGROUND CAR PARK - DAY 1 - SAME TIME 204   204 BREIVIK arrives through a gauntlet of rage. Into the underground car park...   * CUT TO: INT. SVALBARD - VILJAR’ HOME - SAME TIME 205   205   * VILJAR turns on the TV.   * CUT TO:   * INT. PM OFFICE - SAME TIME 205A   205A   * He turns on the TV.   * CUT TO: 110.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 168
    },
    {
      "scene_number": 26,
      "slugline": "INT. COURTHOUSE - STAIRWELL - DAY 1 - CONTINUOUS 206   206 Breivik is led up through the building... CUT TO: INT. COURTROOM - DAY 1 - CONTINUOUS 207   207   * LIPPESTAD waits for Breivik to arrive. The courtroom is crowded. Banks of PRESS and CAMERAS. Broadcasting live. He looks to his right: PARENTS, just a few feet away. Those who   * had argued with CHRISTIN.   * A ripple through the room as BREIVIK enters. LIPPESTAD watches as he is uncuffed. Turns to face the crowded courtroom. Looks at the parents. Going from face-to-   * face. Then turns and punches the air with a Nazi salute.   * The room recoils with shock. Cameras click. See LIPPESTAD, he knows the third attack is a call to arms.   * CUT TO: INT. SVALBARD - VILJAR’S HOME - CONTINUOUS 208   208   * VILJAR watches Breivik’s salute.   * CUT TO: INT. COURTROOM - DAY 1 - DAY 209   209   * The JUDGE nods to the Prosecution. INGA (stands) On 22 July 2011, Anders Behring   * Breivik carried out a dual terror   * attack taking the lives of 77   * innocent people. Hundreds more were   * injured and left forever scarred by   * his actions. The facts are clear.   * First the car bomb, then the mass   * shooting. There is over-whelming   * evidence, including his own signed   * confession.   * (pauses)   * So the question is not whether he   * committed the crime, the question   * is how should he be judged?   * (MORE) 111.",
      "characters": [],
      "action_text": "(beat)   * Your Honour, the law is clear. If   * there is any doubt about the sanity of a person accused, we are required by law to request treatment. Not imprisonment. LIPPESTAD watches the PARENTS, as they impassively listen. INGA (CONT’D) Given the court-ordered,   * psychiatric diagnosis, the   * Prosecution believes there is clearly significant doubt as to Anders Behring Breivik’s state of   * mind on 22nd July. Therefore, we request the court to find him guilty, but sentence him to mandatory psychiatric treatment in a secure facility. INGA sits. The JUDGE nods to LIPPESTAD. LIPPESTAD (standing) Your Honour, we will not seek to deny the crimes committed on July 22nd. However, we will argue that Mr. Breivik was not psychotic during these attacks. Instead, we say he knew exactly what he was doing. (feels Breivik’s eyes on him) And though it is difficult to comprehend Anders Breivik’s view of the world, we will show that he is not alone in his opinions. There are others who think the way he does. Increasing numbers of people,   * all over the west. His were   * political acts. TIME-LAPSE TO:   * OMITTED AFTER BEING SHOT. 210   210   * OMITTED. 211   211   * MOVED TO 220A 212   212   * INGA (CONT'D) 112.",
      "dialogue_count": 0,
      "word_count": 460
    },
    {
      "scene_number": 27,
      "slugline": "INT. COURTROOM - DAY 2 - DAY 213   213   * * BREIVIK performs another Nazi salute.   * BREIVIK   * (his opening statement)   * I stand here today on behalf of   * Europeans who are being deprived of   * their ethnic, indigenous, cultural,   * and territorial rights.   * (beat)   * The Prosecution tell you I am   * insane. They do this because they   * fear me. Because I have committed   * the most sophisticated, the most   * spectacular, political   * assassination in Europe since World   * War Two.   * (beat, he turns a page)   * And why? Because Norway, Europe.   * These are not real democracies. Is   * it democratic for a nation not to   * be consulted about whether it   * becomes multicultural? To fail to   * ask your people for permission   * before welcoming immigrants? To   * force them to become a minority in   * their own capital? There can be no   * democracy whilst the liberal elites   * in Europe are in power. Democratic   * struggle is pointless. Many will   * realise this in the coming decades   * and pick up arms. Just as I did.   * He turns the page.   * Family lawyer LARSEN stands to object.   * FAMILY LAWYER   * The Defendant has said enough, Your   * Honour.   * JUDGE ARTNZEN   * You must hurry up, Mr. Breivik.   * BREIVIK   * I must be allowed to finish my   * statement!   * FAMILY LAWYER   * This is extremely upsetting for the   * families.   * 113.",
      "characters": [],
      "action_text": "LIPPESTAD   * (stands)   * Your Honour, the Defendant must be   * allowed to finish his statement.   * JUDGE ARTNZEN   * (beat)   * You may continue, Mr. Breivik.   * LIPPESTAD sits uncomfortable. Aware of the parents gaze. A   * FEW walk out in protest. But MOST remain. Impassive.   * BREIVIK   * When peaceful revolution is made   * impossible, then violent revolution   * is the only option.   * LIPPESTAD looks at the PARENTS. Their anger and their   * powerful dignity. Feels the shame of his position.   * BREIVIK (CONT’D)   * I demand to be acquitted because I   * acted in defense of my country.   * CUT TO:   * INT. SVALBARD - VILJAR’S HOME - CONTINUOUS 213A   213A   * Track in on VILJAR. As he watches the end of BREIVIK’s   * testimony.   * AND WE HARD CUT   * TO:   * MOVED TO 214B 214   214   * INT. SVALBARD - GYMNASIUM - DAY 214A   214A   * VILJAR at the edge of an empty gymnasium. He drops his stick,   * walks out towards the middle, unaided. Half-way he stops. Unsteady on his feet. See the effort on his face. VILJAR (turns to SVALBARD DOCTOR   * by the door) I’ve got eight weeks. I want to   * walk unassisted. No stick. No shaking. No breathlessness. SVALBARD DOCTOR   * Viljar, you’re still very weak.   * 114. VILJAR Just tell me what I need to do. CUT TO:   * EXT. INQUIRY HQ - EVENING 214B   214B   * The PM’s car pulls into the basement of the anonymous government building. CUT TO: INT. INQUIRY HQ - INTERVIEW ROOM - CONTINUOUS 215   215 The PM sits alone in front of the Inquiry panel, STAFF at tables to one side. GJØRV Thank you for coming today, Prime   * Minister.   * (beat)   * I want to begin by exploring to   * what extent Government was aware of   * the threat posed by Anders Behring   * Breivik prior to his attacks on   * 22nd July.   * PRIME MINISTER The Security Services told me they   * had no warnings. He operated   * completely out of sight.   * GJORV He could not have been detected in   * advance?   * PRIME MINISTER   * That is my understanding.",
      "dialogue_count": 0,
      "word_count": 1866
    },
    {
      "scene_number": 28,
      "slugline": "INT. COURTROOM - DAY 4 - DAY 221   221 LIPPESTAD cross-examines the FAR-RIGHT EXTREMIST. BREIVIK watching closely. LIPPESTAD How long have you been active in   * the politics of the Far-Right in   * Norway?   * EXTREMIST My whole adult life.   * LIPPESTAD And you share Mr. Breivik’s   * opinions on the subject of immigration?   * EXTREMIST I do. LIPPESTAD And you agree with him that multiculturalism is a threat to Europe?   * EXTREMIST Absolutely .   * LIPPESTAD Are you aware of others who share these opinions? EXTREMIST Many people. I would say millions.   * Wouldn’t you?   * See BREIVIK, vindicated.   * LIPPESTAD Have you ever met the Defendant? EXTREMIST I’ve met him online. LIPPESTAD   * Online?   * EXTREMIST In chat forums, attached to mythic,   * military games like World of   * Warcraft. Call of Duty. Our   * movement often congregates there.   * (MORE) 122.",
      "characters": [],
      "action_text": "It’s a place to train, to share   * ideas.   * LIPPESTAD   * Recruit?   * EXTREMIST   * Sure.   * LIPPESTAD   * How did the defendant strike you?   * EXTREMIST   * He liked to lead missions online.   * To strategise.   * LIPPESTAD Was he rational? EXTREMIST Perfectly.   * LIPPESTAD Was he a leader?   * EXTREMIST He certainly wanted to be.   * LIPPESTAD I have no more questions. INGA stands, to begin the Prosecution’s cross-examination. INGA Was Mr. Breivik your leader?   * EXTREMIST No.   * INGA You wouldn’t follow Mr. Breivik?   * EXTREMIST I think others in our movement are   * better qualified than him.   * INGA Stronger than Mr. Breivik?   * EXTREMIST For sure.   * See LIPPESTAD glance at BREIVIK.   * EXTREMIST (CONT'D) 123. INGA Better than Mr. Breivik?   * EXTREMIST Definitely.   * INGA Would they be capable of doing what   * Anders Behring Breivik did?   * EXTREMIST Let me tell you something about our   * movement. The Alt-Right. The Far-   * Right. Whatever you want to call   * us.   * (beat)   * We’re deadly serious. About seizing   * power. Changing society completely.   * About total victory.   * (beat)   * Not singular, violent acts that   * don’t contribute to that goal. The   * tide of history is flowing our way   * again. Nothing must get in its way.   * See BREIVIK watching intently. INGA So I’ll repeat the question. Would   * you, holding your views - the same   * views as Mr. Breivik - have done   * what he did?   * She waits.   * EXTREMIST (a beat) No. I would not.   * See LIPPESTAD and BREIVIK. For the first time, a flash of   * real anger on BREIVIK’s face.   * See the FAMILIES, registering the win.   * INGA Thank you. CUT TO: INT. COURTHOUSE - HOLDING ROOM - CONTINUOUS 222   222 LIPPESTAD enters. BREIVIK is pacing. 124. BREIVIK He’s a coward. He’s a fucking   * coward.   * LIPPESTAD He was the best I could get. BREIVIK To betray me like that. You never   * betray a brother. Never. You know I   * looked up to him. I trusted him. I   * fucking tr",
      "dialogue_count": 0,
      "word_count": 1262
    },
    {
      "scene_number": 29,
      "slugline": "EXT. SVALBARD - DAWN 226   226 VILJAR walking up hill. One foot in front of the other.   * Behind him: the endless snows of Svalbard.   * FAMILY LAWYER (OOV)   * Next we call Lara Rashid...   * CUT TO: OMITTED. 227   227   * INT. COURTROOM - DAY 6   - SAME TIME 228   228 LIPPESTAD watches LARA testify to FAMILY LAWYER.   * LARA My big sister Bano and I fled Iraq   * in 1999. We were refugees. My   * father brought us to Norway to be   * safe.   When I came from Kurdistan -   * what you call Iraq - I was just   * five years old. I was a refugee. It   * took a long time for Norway to feel like home. I struggled with the language. The climate too. And some people were suspicious of us. Angry that we were here. LIPPESTAD looks at BREIVIK. No reaction. LARA (CONT’D) But my sister Bano helped me. To   * see that in Norway there could be freedom, security, and hope. And   * that is what I felt around the   * campfire on Utøya. The night   * before.   * (pauses) But   the next day, when we were   * attacked - when she died - I lost   * all that. I was suddenly in a   * different world. Of pain and fear. Anger. (holding back her tears) I felt guilty. All of the time. Why   * did I live when she died? How do I face my parents now? But most of all, I couldn’t understand why someone would want to kill us. (beat) (MORE) 129.",
      "characters": [],
      "action_text": "Why would anyone be frightened of me? CUT TO: OMITTED. 229   229   * INT. COURTROOM - DAY 6 - SAME TIME 230   230 LARA But now I see things differently. I see that Bano died for a reason. Her life was a celebration. Of multicultural Norway. Proof that it can work. That is why she lived. And that is why she died. (beat) And I am still so proud to be her little sister. LARA looks up. Avoids BREIVIK. Sees her PARENTS watching. Tears in their eyes. LIPPESTAD looks at BREIVIK. He’s not even looking at her. CUT TO: INT. SVALBARD - VILJAR’S HOME - SAME TIME 231   231   * VILJAR (watching her testify on the TV) sees it too. Knows   * BREIVIK is still in control, as LARA leaves the witness box. CUT TO: OMITTED. 232   232   * MOVED TO 234A 233   233   * EXT. SVALBARD - VILJAR'S HOME - DAWN 234   234   * SVEINN and CHRISTIN packing the car.   * CUT TO:   * INT. SVALBARD - VILJAR’S HOME - VILJAR’S BEDROOM - CONTINUOUS 234A   234A   * VILJAR stands alone. Coat on. Comes out into hallway.   * LARA (CONT’D) 130. TORJE comes out too.   * VILJAR   * You OK?   * TORJE   * Yeah, I’m fine.   * VILJAR   * Good.   * CUT TO:   * OMITTED. 234B   234B   * OMITTED. 234C   234C   * EXT. SVALBARD - VILJAR’S HOME - CONTINOUS 234D   234D   * CHRISTIN and SVEINN wait by the car. Look up to see:   * VILJAR and TORJE come out. VILJAR ahead. TORJE behind,   * isolated.   * They get into the car. Drive away.   * CUT TO: INT. ILA PRISON -   BREIVIK’S CELL - NIGHT 235   235 BREIVIK sits alone. Track in on him. Feel his malignant force. CUT TO: INT. OSLO HOTEL - VILJAR’S ROOM - NIGHT 236   236 VILJAR in a hotel room. Oslo stretching out below him. He pulls out his phone. CUT TO: EXT. OSLO SQUARE - NIGHT 237   237   * VILJAR approaches a cafe. Looks inside. Sees LARA.   * 131. LARA sees him.   * LATER: And now they’re walking along a street.   * VILJAR   * How was it?   * LARA   * Very surreal. Seeing him. You walk   * in and he’s just there.   * VILJAR   * She’d be pleased. Bano. She’d be   * pleased yo",
      "dialogue_count": 0,
      "word_count": 910
    },
    {
      "scene_number": 30,
      "slugline": "EXT. UTOYA ISLAND - DAWN 238A   238A Utøya Island. CUT TO: INT. BREIVIK CELL - DAWN 238B   238B BREIVIK wakes. Gets dressed. Is cuffed and led away.   * CUT TO: INT. OSLO HOTEL -   VILJAR’S ROOM - MORNING 239   239 VILJAR washing his face. He dresses. Black shirt, tie, suit. His wounds visible as he combs his hair. Inserts his glass eye. It’s time.   * CUT TO: EXT. COURTHOUSE - DAY 7 - SAME TIME 240   240 BREIVIK in armed convoy towards the courthouse.   * CUT TO: EXT. COURTHOUSE - DAY 7 - MORNING 241   241 VILJAR AND FAMILY, on foot, arrive outside the courthouse. SVEINN and CHRISTIN lead VILJAR and TORJE through the CROWDS. See VILJAR, trying to keep his breathing steady. CUT TO: INT. COURTROOM - DAY 7 - CONTINUOUS 242   242 LIPPESTAD prepares for the session. CUT TO: INT. COURTHOUSE - UNDERGROUND CARPARK/BASEMENT - DAY 7 - DAY 243   243 BREIVIK moves towards the courtroom. CUT TO: 134.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 162
    },
    {
      "scene_number": 31,
      "slugline": "INT. COURTHOUSE - LOBBY - DAY 7 - CONTINUOUS 244   244 The FAMILY through the atrium. Wait outside the courtroom.   * VILJAR paces the lobby alone.   * TORJE goes over to him.   * CHRISTIN and SVEINN watch from afar.   * A moment between the brothers.   * A COURT USHER comes over.   * COURT USHER   * We’re ready for you.   * A moment between VILJAR and his FAMILY. They hug.   * And then he leaves behind the COURT USHER.   * CUT TO: INT. COURTROOM - DAY 7 - MOMENTS LATER 245   245 CHRISTIN and SVEINN find their seats. CHRISTIN sees the ANGRY   * PARENTS from before. They nod in support.   * LARA is there too.   * The crowded court is ready. The JUDGE motions for the session to begin. A side door opens and BREIVIK is brought in. CHRISTIN and SVEINN watch BREIVIK as he walks past - within touching distance. He takes his seat next to LIPPESTAD. SVEINN takes hold of CHRISTIN’S hand. The courtroom settles. FAMILY LAWYER We would like to call Viljar Hanssen. LIPPESTAD watches as the door at the back of the courtroom opens. VILJAR enters. He walks to the witness stand. Concentrating on keeping his breathing steady. His PARENTS watching. LARA too. 135.",
      "characters": [],
      "action_text": "LIPPESTAD watches VILJAR approach. As he approaches the stand, VILJAR sees BREIVIK. His head is down, talking to LIPPESTAD. VILJAR tries to control his shaking hands. Takes the last steps to the stand. Finally locks eyes with BREIVIK. For a moment, VILJAR feels himself going back to the island. The sounds of terror and pain. That dark menacing FIGURE looming above him... He struggles for control. Forces himself not to go there. Holds BREIVIK’S empty stare for the longest moment. FAMILY LAWYER (CONT’D) Can you tell us what happened to you on Utøya, Viljar? VILJAR Yes. He tried to... He tried to kill me. (begins to remember) I remember running away. Trying to find somewhere to hide. Trying to protect my little brother. And I remember being shot. (using his right hand) He shot me here, here, here, here, and finally here. In the eye. Five   * times. I lay on the beach. I was   * all alone. In a kind of pain I   * could never imagine.   * BREIVIK looks up momentarily. Catches VILJAR’s eye. FAMILY LAWYER But you’re here now?   * VILJAR steels himself, keeping his emotion at bay. VILJAR Yes. But everything is different.   * I’ve had to relearn how to use my   * body. Learn to walk again, to feed myself again. I have little use of my left arm. I’m blind in one eye -   * but that’s a relief. PROSECUTION A relief? 136. VILJAR Oh yes, a relief. Definitely a relief. (a beat and then) Because at least now I don’t have to look at him. Sudden laughter. Breaking the spell. BREIVIK looks around the room. Sees EVERYONE laughing. Can’t help but smile himself. And VILJAR sees it. Knows he’s got through. LIPPESTAD sees too. VILJAR (CONT’D)   * But of course it’s not that simple, I have a fragment of his bullet lodged in my brain, that could kill   * me at any time.   * His voice falters. VILJAR (CONT’D) And I don’t look like the person I used to. My body. It’s broken. Beyond repair. My self-confidence too. And I have pain that never   * goes away.   * A beat and then:   * VILJAR (CONT’D",
      "dialogue_count": 0,
      "word_count": 1455
    }
  ]
}