{
  "slug": "a-fantastic-woman-2017",
  "title": "a fantastic woman",
  "genre": "drama",
  "format": "film",
  "scenes_count": 6,
  "characters_count": 0,
  "characters": [],
  "total_words": 9836,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. ORLANDO’S APARTMENT - BEDROOM -- NIGHT 14   14 The silence in the room is suddenly interrupted by Orlando’s gasping sounds. Marina turns the light on. Orlando is sitting up at his side of the bed with his back turned towards her, having difficulty breathing. MARINA Orlando? Orlando tries to say something to her, but no words come out. MARINA (CONT’D) Orlando, What’s wrong?! ORLANDO I don’t know. MARINA You don’t know? ORLANDO I don’t know what’s wrong with me. Orlando stands up from the bed, tries to walk but falls down. Marina runs to grabs him. MARINA Orlando! What the fuck is going on? Come here. Marina manages to sit Orlando on the bed. MARINA (CONT’D) Honey... What is it? INT. ORLANDO’S APARTMENT -- NIGHT 15   15 Marina carries Orlando outside the apartment. He puts him against the wall. MARINA Lean against the wall. Look at me. Here. Marina puts Orlando’s glasses to him. She searches for something in her bag.  6.",
      "characters": [],
      "action_text": "MARINA (CONT’D) The keys, do you have them? ORLANDO No... Marina search for the keys on Orlando’s shirt. No luck. MARINA Orlando... She runs back to the apartment. MARINA (CONT’D) Wait here. No, Diabla, stop! Come here! Orlando stars walking with diffulty to the stair case. The lights go out and he fells through the stairs. MARINA (CONT’D) Orlando? Marina sees him and runs through the staircase. DIABLA, the dog comes along and barks. MARINA (CONT’D) Orlando! Orlando, honey! Marina tries to put Orlando on his feet. ORLANDO I’m fine. MARINA Let’s go! INT. ORLANDO’S CAR -- NIGHT 16   16 Marina drives nervously; the streets are empty. She notices that Orlando is in a lot of pain, unable to speak, in the passenger seat next to her. She looks forward again. MARINA Honey, talk to me, ok? He doesn’t respond. MARINA (CONT’D) Talk to me! Orlando! Please...  7. He barely reacts. ORLANDO (mumbling) Where are we going? MARINA To the hospital, Orlando, where else? Focus, okay? Orlando slips into unconsciousness once more, without enough energy to decide. ORLANDO Hurry up. MARINA What? ORLANDO Hurry up. MARINA Ok, Ok. He barely responds, and drives off at full speed. I/E. ORLANDO’S CAR / HOSPITAL / EMERGENCY ROOM / REANIMATION 17   17 CUBICLE -- NIGHT Marina brings the car to a screeching halt at a HOSPITAL entrance, honking her horn. She gets out of the car. MARINA Help, please! One PARAMEDIC runs to the car. PARAMEDIC Easy, ma’am. Let us take care of him... (TO ORLANDO) Are you OK? What’s your name? Can you hear me? (TO PARAMEDIC 2) Juan Pablo, hurry up! Hurry! Two more paramedics arrive with a stretcher and try to pull Orlando out of the car; it’s a difficult task because his arms and legs are rigid and stuck in his seat. Orlando’s body is HIT SEVERAL TIMES in the process.  8. MARINA Be careful... careful! Despite his limp state, they manage to pull him out of the car. MARINA (CONT’D) Be careful. They drag him towards the hospital. PARAMEDIC What`s your name? What`s your name? ",
      "dialogue_count": 0,
      "word_count": 2205
    },
    {
      "scene_number": 2,
      "slugline": "INT. MODERN RESTAURANT - DINING ROOM -- NIGHT 28   28 The restaurant is packed and Marina can barely keep it together. YOUNG MAN (from another table) Are you going to bring us our check, or not? MARINA Right away. ALESSANDRA Marina, someone’s looking for you outside. MARINA Who? ALESSANDRA I Don’t know. MARINA Where? ALESSANDRA At the entrance. Marina looks concern. EXT. RESTAURANT ENTRANCE -- DAY Marina walks towards the entrance. An attractive woman, ADRIANA (45), is standing waiting for her. ADRIANA (holding a file in her hands) Good afternoon, Marina. Thank you for coming out, this is just going to take two minutes. MARINA Hello ADRIANA Hello. I’m Detective Adriana Cortes, from the Investigations Police’s Sexual Offenses Unit. Good afternoon.  21.",
      "characters": [],
      "action_text": "They shake hands. MARINA Good afternoon. ADRIANA Well first of all, I wanted to offer you my condolences. They told me what happened, and I’m really sorry. The fact that you run away from the hospital, gave me some reason for concern. Marina feels uncomfortable. MARINA Could we talk over there? ADRIANA Of course... They walk towards a more private place. They star walking. MARINA I didn’t run away. ADRIANA Oh. There must have been some confusion, then. MARINA Could I see your identification, please? ADRIANA Sure Adriana show it to her. She really is a police detective. ADRIANA (CONT’D) One question. Mr. Orlando... MARINA Onetto. ADRIANA Yes. Was he paying you? MARINA (offended) We were a couple.  22. ADRIANA So you cared for each other. It wasn’t just sexual. Marina begins to feel irritated. MARINA It was a consensual relationship between two adults. Why do you want to know that? ADRIANA Because he was old enough to be your father. (Marina holds back) Did you use drugs before his attack? MARINA No. ADRIANA Alcohol? MARINA Yes. ADRIANA Did you have sex? MARINA I don’t remember. Long silence. ADRIANA I need to know if he suffered any kind of physical stress. MARINA Nothing unusual. ADRIANA The thing is, Mr. Onetto’s body arrived to the hospital with injuries, with bruises. He had injuries on his arms, on his sides, on his neck. And a contusion to his head. Marina grows frightened. Adriana opens the file she has brought along with her and shows it to Marina.  23. There are pictures inside. Marina looks at them, then snaps it shut, affected. MARINA I talked to the doctor about all of this. Did you talk to his family? Marina is confused. Alessandra appears at the door. ALESSANDRA Marina! Excuse me... We’re having problems with the check for table 15. MARINA I’m coming. ADRIANA Five minutes, please. (to Alessandra) Alessandra goes back inside. Adriana fixes her gaze on Marina.   Can’t anyone fill in for you? (to Marina) MARINA No. And I really need to get back to work... ",
      "dialogue_count": 0,
      "word_count": 1545
    },
    {
      "scene_number": 3,
      "slugline": "INT. ORLANDO’S APARTMENT - BEDROOM -- DAY 35   35 Marina wears a blue jeans dress, she stare at the mirror. She grabs her purse that is on top of the bed, she sees again the key with the 181 number written on it. INT. ORLANDO’S CAR - CARWASH -- DAY 36   36 Marina’s car enters the carwash tunnel. The running water, the dryers... It’s the closest thing she’s had to a peaceful moment. Protected in this solitary space, Marina lets her head fall back and closes her eyes. She sings quietly. As the soap falls over the windshield, Marina looks back through the rearview mirror: ORLANDO IS SITTING IN THE BACKSEAT. The spinning brushes run over the windows, making the car dark. Marina can’t tear her eyes away from Orlando through the rearview mirror; his face is hidden in the moving shadows and lights. Orlando now turns around and looks directly at her. Is she losing her mind? INT. GAS STATION STORE -- DAY 37   37 Overwhelmed, Marina covers her face with her hands as she waits in line for the cash register. She fails to realize that it’s her turn. CASHIER Miss...? Miss? Marina snaps back. She advances. MARINA I’ve got to pay for the wash. The CASHIER (30) takes a look at her exhausted, upset demeanor. CASHIER You need a cup of coffee. MARINA (staring back at her) Ok, one expresso. CASHIER How would you like it?  31.",
      "characters": [],
      "action_text": "MARINA Double. I/E. ORLANDO’S CAR / URBAN HIGHWAY -- DAY 38   38 Marina drives the now spotless car down a highway. Another cathartic song is playing on the radio, at full volume. “Natural Woman” performed by Aretha Franklin. Marina turns onto a busy street. It’s an office buildings area. A DOORMAN receives her, she pull down the window. MARINA Hi, good morning. DOORMAN Hi, good morning. MARINA I’m bringing this car to Sonia... I don`t know her last name. DOORMAN Yes, Sonia Bunster. Yes, she told me to inform her about your arriving. Please park in the -4th floor, parking space number 5. She’ll come and pick up the car. MARINA She wants me to wait down there? DOORMAN Yes, that’s what she told me. MARINA Ok, thank you. DOORMAN You’re welcome, go ahead. Marina continue driving. INT. PARKING LOT -- DAY 39   39 The car is parked. Marina waits besides it for SONIA (48) to come down. sees a woman making gestures at her from the sidewalk. It’s SONIA (48), attractive, with panache, dressed formally. They size each other up in a glance.  32. SONIA Hello MARINA Hello, Sonia. Sonia stares back at her, unable to react. SONIA I’m sorry. They shake hands. But Sonia is still stupefied. Marina responds with a gesture: this is me. SONIA (CONT’D) I've been wondering how is your face for about a year, It's different like this, face to face. MARINA Of course. Sonia still can’t believe her eyes. MARINA (CONT’D) As you can see... bones and flesh. SONIA Yes, it’s just that... I can’t imagine Orlando being with you. That’s all. MARINA Oh. Ok. SONIA Don't treat me so formal. MARINA Eh... Here are the car keys. Sonia receives them. SONIA Thank you. MARINA The documents are in the glove compartment.  33. SONIA Ok. Excuse me. (lamenting herself, whispering) Pure quantum physics. Sonia checks inside the car, then emerges and opens the trunk: it’s filled with color samples, books, and other products from Orlando’s printing press. Sonia slams the trunk shut, places both hands on the car, and lowe",
      "dialogue_count": 0,
      "word_count": 4216
    },
    {
      "scene_number": 4,
      "slugline": "INT. NIGHTCLUB - DANCE FLOOR -- NIGHT 66   66 She discovers that ORLANDO IS STILL WATCHING HER, standing on the dance floor, camouflaged in the crowd. Marina begins to dance with even greater impetus, as anonymous hands rise and surround her, cheering her on, which then turns into... A LONG AND COORDINATED GROUP CHOREOGRAPHY, vehement and openly sexual. INT. WANDA’S APARTMENT - HALLWAY -- NIGHT 67   67 Marina knocks on Wanda’s entrance door, she looks tired and she is completely wet. Gaston opens it. GASTON (patiently) Hello, Marina. MARINA Hello, Gaston. He lets her in. INT. WANDA’S APARTMENT - SOFA/ LIVING ROOM -- DAWN 68   68 Marina is laying back on a sofa. She’s already awake, not feeling good. INT. WANDA’S APARTMENT - KITCHEN -- MORNING 69   69 Marina and the family drink coffee together in the kitchen. Wanda looks for something in the newspaper. Wanda reads Orlando’s funeral information in the newspaper. WANDA Here it is. Orlando Onetto Pertier. MARINA What does it say? WANDA We announce the passing of our husband, father, partner and friend. Orlando Onetto Pertier. (MORE)  55.",
      "characters": [],
      "action_text": "Funeral services shall be held today at 16:30 at Parque de la Paz cemetery. Ejército Avenue #315, Santiago. His wife, brother, and children...” GASTON (trying to change the subjet) Could you pass the avocado? The sisters seem not to listen. WANDA Wait, listen... “We are deeply saddened to announce the passing of Orlando Onetto Pertier...\" blah blah blah... Onetto Textiles employees. GASTON What’s the point? I don't get it. WANDA I’m reading. GASTON What for? (to marina) Don`t go. That would be masochism. WANDA Define to me what masochism is. GASTON People who like to suffer. Do you like to suffer? WANDA What does that have to do with this? GASTON I don`t like to suffer... WANDA (CONT'D)  56. WANDA I’m just reading to my sister... MARINA Ok, stop it! Really, stop! I'm not going anywhere. Okay? I’ve turned the page. Okay? Life goes on. They seem not yo pay attention on what Marina just said. WANDA Why are you telling me what to do? GASTON No, no... MARINA (talking to herself) What doesn't kill you, make you stronger. Stronger. Marina’s mind is a million miles away, as she plays with the “181” key on the table. INT. HAIR SALON -- DAY 70   70 Marina is sitting while her hair is being washed. INT. HAIR SALON -- DAY 71   71 Marina it’s getting her nails done. MARINA I have the hands of an orangutan. MANICURIST No, you don’t. EXT. STREET, DOWNTOWN -- DAY 72   72 Marina, completely renovated, walks and runs head on into two Workers carrying A LARGE MIRROR. She’s struck by her own image in the reflection: is that me?  57. The Workers continue on their way, unblocking a flashing neon sign with an arrow in front of her: BAR. INT. BAR, DOWNTOWN -- DAY 73   73 The place is almost deserted, and it has an unreal air to it. Marina takes a large sip of her drink. EXT. STREET, DOWNTOWN -- DAY 74   74 Marina looks calmer, she walks the streets. INT. MODERN RESTAURANT - DINING ROOM -- DAY 75   75 Marina hands an OLDER MAN (60) his check. OLDER MAN (charming) How much is it, darling? MA",
      "dialogue_count": 0,
      "word_count": 1058
    },
    {
      "scene_number": 5,
      "slugline": "EXT. STREET, DOWNTOWN -- DAY 83   83 Marina runs through the streets. She pulls a taxi over and jumps in. A man is in there. MARINA Get out, Sir, I have an emergency. MAN ON TAXI I have an emergency too. MARINA (screaming) Get out! The man gets out. MARINA (CONT’D) (nicer again) Take Alameda St. please sir. Marina rides on the taxi. EXT. CEMETERY PARKING LOT -- DAY 84   84 Marina walks through the cemetery parking lot, amongst cars that are already on their way out. A car approaches her from behind, honking: Bruno is driving, Sonia is sitting beside him, and Gabo is in the backseat. Bruno stops the car suddenly when he sees her. She turns around and stands stiff. BRUNO Marina. What the fuck are you doing here! SONIA The Ceremony is over, go home! BRUNO Could you please leave us in peace! SONIA Move, move! Crazy man! Move! GABO Sonia, she is a woman.  61.",
      "characters": [],
      "action_text": "BRUNO She is not a woman. Marina continues standing, she doesn’t pretend to move. BRUNO (CONT’D) Move! Move! Made-up faggot! Marina impulsively puts one foot on the rear bumper and JUMPS ONTO THE CAR’S TRUNK, THEN WALKS ONTO THE ROOF AND VIOLENTLY JUMPS UP AND DOWN ON IT. GABO No, Marina, please don't do that! MARINA I want! My! Dog! She then springs forward, letting herself fall onto the windshield, beating on it with the palms of her hands. Marina slides off of the car deftly. Sonia screams while Bruno and Gabo observe this, frozen. Marina walks to Bruno’s window. MARINA (CONT’D) Here you have Orlando`s keys... She throws them inside. The car leaves. Marina is left on her own in the parking lot. EXT. CEMETERY CINERARY -- DAY 85   85 Marina walks and arrives at the cinerary building, which looks like a small chapel. INT. CEMETERY CINERARY -- DAY 86   86 Marina enters the cinerary. It’s completely empty, except for a CLEANING LADY who is putting out a bunch of candles. MARINA Is this where Orlando Onetto’s ceremony was held? CLEANING LADY I don’t know. I just clean here. MARINA Might you know where is he?  62. CLEANING LADY No idea, m'am Marina leaves this impersonal place, looking frustrated. EXT. CEMETERY CINERARY -- DAY 87   87 Marina observes the empty gardens... She looks defeated. Marina is taken aback when she feels someone passing close by... It’s ORLANDO, who is already walking towards the back of the cinerary building. She follows him. EXT. CINERARY PATIOS - CAR RAMP -- DAY 88   88 Marina follows Orlando down a car ramp that leads to an underground level. INT. CINERARY UNDERGROUND LEVEL -- DAY 89   89 Orlando enters an underground hallway. Marina follows him. She takes a look around: piled up caskets, candle stumps, a heap of wilting flowers, broken statues... ORLANDO pushes her up against the wall behind her. Marina tries to push him away in terrified silence, but Orlando corners and kisses her. But after a while, she gives in to a long and heartfelt kiss",
      "dialogue_count": 0,
      "word_count": 783
    },
    {
      "scene_number": 6,
      "slugline": "INT. THEATER STAGE -- NIGHT 97   97 It’s now Marina’s turn. She begins to sing with intensity and conviction. Her moving voice fills the space... THE END  65.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 29
    }
  ]
}