{
  "slug": "a-hidden-life-2019",
  "title": "a hidden life",
  "genre": "drama",
  "format": "film",
  "scenes_count": 3,
  "characters_count": 0,
  "characters": [],
  "total_words": 22660,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. VILLAGE SQUARE 26   26 A few days later, Franz comes across a neighbor in the village square, a farmer named HESSLER. His friends are consoling him. There has been some unexpected event. FRANZ Hessler, what is it? HESSLER I’ve been called up. We thought there would be peace, but this war goes on. I don’t know why. His friends look at each other. Their eyes dart left and right. FRIEND Shhh. They pat him on the back. It could happen to anyone. EXT. FIELD - LATER, ALONE 27   27 Franz questions his friend. Now they are alone. FRANZ Do you believe in what we’re fighting for? HESSLER A little. No. Not really. FRANZ We’ve invaded other countries. Stolen their land. And now we’re doing it again. Aren’t they the heroes, who fight against us -- who defend their homes? (no reply) Is something right -- just because the crowd is shouting it? Hessler bows his head. EXT. WOODS 28   28 Passing through the woods, Franz sees a madman in the distance. Dishevelled, his hair and beard grown out; a mad look in his eyes, of fear or dread. It seems the poor fellow had not expected anyone to pass this way. He looks at Franz for a moment, then slips off, into the darkness of the trees. 10.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 220
    },
    {
      "scene_number": 2,
      "slugline": "INT. J HOUSE 29   29 Fani can see that Franz is holding something back. FANI What is it? (after a pause) Toni opened his mouth too wide. FRANZ I wouldn’t do anything that would bring you reproach... He looks in on his children. He kisses them as they sleep. FANI (O.S.) To have a good husband -- a home -- they’re enough to make you happy... To love and be loved is the greatest happiness on earth. INT. J BEDROOM - NIGHT 30   30 Franz wakes up with a gasp. He lights a candle. Fani looks at him, startled. FRANZ I had a dream. I saw my father. I asked him what it was like in death. Could he tell me? He shook his head... Then I saw a train -- a wonderful train -- coming through the mountains. The locomotive was powerful -- dark -- it drew the children. They ran to it and weren’t held back. You couldn’t see where it was going -- just the trees and fields, flashing by. EXT. TRAIN (STOCK FOOTAGE, B&W) - DREAM 31   31 A train. A black locomotive. Coal is shovelled into the furnace. The tracks weave in and out. Pistons drive the engine forward: an overwhelming, relentless force. FRANZ (O.S.) Then a voice -- the voice said “This train is going into darkness!” I think it was a message. 11.",
      "characters": [],
      "action_text": "Franz on his motorcycle, the wind in his hair, the lovely sense of being free of all constraint, rushing on. NEXT MORNING 32   32 The next morning, at breakfast: FRANZ Those other men were like brothers. EXT. ECKINGER HOF - DAY 33   33   * The neighbors debate with Franz. NEIGHBOR   * Who are you? Even the Cardinal ordered us to pray for Hitler -- to ring the bells on his birthday. Fly the swastika from the steeple. You forget. ECKINGER   * You can’t blame the Cardinal for that. He hoped, by doing it, that the regime would be more tolerant toward the church. But now the   * priests are sent to concentration camps. Church processions banned. Mass on feast days, even Christmas, prohibited unless the feast falls on Sunday! We don’t   * have a say. It’s them up the hill that decide our fate. Officials from a fortress near St. Radegund wander through the street, singing. EXT. FORTRESS (BURG SAND) 34   34 The fortress, far away. Seat of the military authorities, it sits on a high hill, overlooking the valley below. It stands alone in the dusk. ECKINGER (O.S.)   * What do you say, Franz? 12. EXT. FIELDS - WIESENKREUZ 35   35 Franz wanders through the fields, disturbed by the sense that a decision may soon be required of him, one that will put the happiness of his family at risk and set him at odds with the village, which he has loved since he was a boy.   * Out in the fields, a crucifix stands on a pole, a gabled roof   * above it to shelter it from the snow. Uncanny. It stops him   * in his tracks. The figure on the crucifix looks down at him in silence. Franz turns away, embarrassed. The path wanders on through the fields of barley. But he cannot leave. He looks up again, takes off his hat. There is no one else in sight. The fields thrum with crickets. Franz takes off his hat, afraid. There are monuments to pain   * everywhere in these mountains. So incongruous. What is it he   * now finds in that face? Franz can tell no one. Especially not those closest to him.   * He c",
      "dialogue_count": 0,
      "word_count": 16506
    },
    {
      "scene_number": 3,
      "slugline": "INT. FRANZ’S CELL - NIGHT 182   182 It is during a raid that Franz receives a visit from Fr. Heinrich Kreutzberg, the Tegel chaplain. The crunch of explosions can be heard in the distance. FR. KREUTZBERG You aren’t responsible for their actions. You have no basis on which to reach a judgement as to the justice or injustice of this war. Your only responsibility is to meet your obligations to your family. Your people. FRANZ I don’t see things as you do, Father. We can’t remain silent in the face of evil. We have to confront it. FR. KREUTZBERG How? The Church can never make demands of its members that might alienate great numbers of them -- or provoke retaliation from the State. FRANZ I don’t want to take the slightest part in this war...   * Franz had expected consolation from the priest, a man of his own faith. FR. KREUTZBERG I suppose you prove there’s -- an examination. That the exam can be taken. But who knows of this exam? Who can be expected to answer it?   * Overhead, the light falters, then goes out. Franz’s children come to him in a dream. They hold out their hands, imploring him silently. One opens the door of his cell, show him the way out, the empty corridor, a stairway beyond it. Then he sees, behind them, a man in a Nazi uniform, his face wrapped in a cloth so that his eyes cannot be seen, or anything of his expression. 80.",
      "characters": [],
      "action_text": "LATER - DAWN (24 MAY 1943) 183   183 At dawn, Franz is dragged out of his cell, into the corridor. FRANZ (O.S.) I continue to find my situation quite satisfactory. Do not worry, my wife. It could be worse. I am still alone in my cell. Almost daily we have half an hour to move about freely. One can work in his cell as much as he likes --- making envelopes. And I can still pray for you. Here I can make a retreat. EXT. COURTYARD 184   184 Franz is led to a car in the courtyard below. He has no idea where he is going. MOVING CAR - TRIP TO WITZLEBEN STREET (BERLIN) 185   185 Two guards drive him to the Reich’s Military Tribunal in Witzleben Street (Charlottenburg). He gazes out the window at others going about their daily lives. FRANZ (O.S.) May 24 I appeared before the Reich’s Military Tribunal for interrogation. It was a long ride by car. The Tribunal is in Berlin, Tegel a little outside the city. The linden trees are in bloom. WITZLEBEN STREET BUILDING - STAIRS, HALLWAYS, ETC. 186   186 Franz is led through the hallways of the Tribunal. His hands are bound in chains. FRANZ O.S. Hopefully you’ve had more rain there than we have here. Otherwise it will be disastrous for the fruit. Stairways lead up towards and opaque skylight. 81. INT. REICH’S MILITARY TRIBUNAL 187   187 Franz is made to sit down on a chair in the middle of a large, drafty hall. The Court Martial convenes: The First Judge, Werner Leuben; two military officers; a prosecutor; a clerk, and Franz’s defense attorney Feldman. Banners with swastikas hang behind them. Judge Lueben opens the hearing. JUDGE LUEBEN Heil Hitler! Franz trembles at the name. The charges are read out. Against them we hear Franz addressing Fani, as though in a continuation of his letter: FRANZ (O.S.) Be at peace... forgive each other. After giving the personal details of the defendant, the Prosecutor reviews the indictment. Franz marvels at the strange hat Judge Lueben wears. He looks around at the other people in the room, wondering w",
      "dialogue_count": 0,
      "word_count": 5934
    }
  ]
}