{
  "slug": "a-knock-at-the-cabin-2023",
  "title": "a knock at the cabin",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 8,
  "characters_count": 0,
  "characters": [],
  "total_words": 16929,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. BACK PORCH, CABIN -- DAY  Eric and Andrew lounge on patio chairs, Eric in the shade, Andrew with his feet up, enjoying the sun. Eric sets down his   book, getting a little antsy. ERIC One of us should check on Wen. Andrew doesn't look up from his novel. ANDREW It's too late. Bears ate her by now. ERIC (smirks) You're such a dick. ANDREW I'll go free the grasshoppers from her torture chamber in a few minutes. Can you just relax till then? The sun's out. It would like to tan you. ERIC Sorry... I'm trying not to hover. ANDREW Listen, you're like the best dad in the world. Give yourself a break. Eric   nods. Goes back to his book. A few moments pass... Then he sighs, setting it down. ERIC I'm just gonna check on her real quick. Andrew sticks out his legs, blocking Eric's path. ANDREW You... Shall not... Paaaass... ERIC What are you, the world's hairiest wizard? He pinches some of Andrew's leg hair, making him recoil. ANDREW Ow! You're such a bully! Andrew grabs Eric and they wrestle around playfully. Until Eric winds up in Andrew's arms.  24.",
      "characters": [],
      "action_text": "ANDREW Wen's having a great time here. And so am I. Eric smiles. ERIC Me too. They share a sweet kiss.  INT. COMMON ROOM, CABIN -- DAY   (BACK   TO   PRESENT)  Eric now sits at the kitchen table. Andrew beside him. Wen in between, held close by her dads.   The tension hangs heavy, all   of them   on pins and needles as -- Sabrina, Redmond, and Adriane   pace   around them, lurking with their weapons. Leonard pours glasses of water from a pitcher, the sound palpable. He sets a glass in front of each family member. LEONARD Please. Drink. I'm sure you're thirsty. None of them move. Andrew stares daggers. LEONARD Wen, at least take a sip -- ANDREW Stop talking to her. Eric motions for Andrew to calm down. Then whispers to Wen. ERIC Sweetie, if you're thirsty, it's okay. Wen hesitantly picks up the glass and sips. Leonard nods, pleased. Then sits across from them. LEONARD I understand what you're thinking. Really, I do. But I promise you, we are not here with hate in our hearts. ANDREW Oh really. The fact that we're married men has absolutely nothing to do with   why you're here.  25. REDMOND scoffs (   ) If it were only that simple. LEONARD We're here, Andrew, because we have to be. We don't have a choice. ERIC There's always a choice. LEONARD For you, yes...   Not for us. His words   linger, the dads uncertain what he means. ERIC If you   want   money, you can take everything we have -- Redmond guffaws. LEONARD Redmond, please. to dads (   ) This is about something far more valuable than money. ERIC Then what's it about? Leonard   forces   a   polite   smile. LEONARD I think it would be better if we began   with introductions. REDMOND We don't have time   to dick around, Leonard. LEONARD This is the way it's supposed to be. They deserve to know who we are. An edge   in   his tone.   Redmond doesn't   press. Leonard takes a breath, smiling   across the table at the   family   once again. LEONARD My name is Leonard and I like catching grasshoppers. Right, Wen? Wen   just",
      "dialogue_count": 0,
      "word_count": 5105
    },
    {
      "scene_number": 2,
      "slugline": "EXT. CABIN -- DAY  Leonard drags Redmond's body onto the porch, leaving a bloody trail behind him. Sets down Redmond's weapon. He   sighs, taking in   the   remains   of the human before him.   And as we   linger, we realize...  WE'RE IN LEONARD'S PERSPECTIVE NOW. THIS IS HIS STORY.  Leonard crouches down, looking at the dead man's face. One of Redmond's OPEN EYES peeks through his mesh mask. Leonard stares at it for a long moment. And we see a hint of regret on Leonard's face. A glimpse of the man behind the monster. With a shaky breath, he reaches down   and   gently closes the dead eye. Then the giant of a man stands up and shakes out   the   white bed sheet, guiding it to gently fall over Redmond's body. He gives a small nod, this is the way it's supposed to be... But then a   RED BLOOD STAIN   slowly spreads through the sheet. Leonard stops and stares, watching it grow and grow... The sight of it unnerving to   him, as we --  CUT TO:  A RED MARKER drawing a solid red circle on a white board. Then a green marker adds a leaf on top. LEONARD So we know that Tommy has two apples... We pull out to reveal we're in --  INT. SCHOOL CLASSROOM -- DAY   (LEONARD - 1 WEEK AGO)  Leonard looks   enormous   in the room full of miniature furniture for the little SECOND GRADERS. But his excitement and verve are even bigger than his body. The passionate teacher you want your child to get in school. He's drawn two apples under a stick figure boy.   Points to a nearby   stick figure girl. LEONARD And we know that Lilly has   four more  apples than Tommy. So let's start with what skill we're going to use to solve this problem.  48.",
      "characters": [],
      "action_text": "Several hands rise around the classroom. He points. STUDENT Addition. LEONARD That's right. Addition. Leonard gets to work drawing additional apples on the board. LEONARD We're going to take the number of apples that Tommy has and   add   how many   apples   -- WHISPERS behind Leonard.   He sighs, and   turns to the class. LEONARD Is there something someone would like to add to the discussion? The students exchange confused glances.   Leonard   looks   from student to student. But no one admits guilt. LEONARD Alright... I'll let that one go. He goes back to drawing his red apples. LEONARD So we're going to   add   how many   more  apples Lilly has to figure out how many   total   apples she -- WHISPERS behind him once again, louder this time. Leonard snaps around. LEONARD If you have something to say, please raise your hand so that I can call on you. But now the students are even more baffled, exchanging nervous glances with one another. ANOTHER STUDENT Are you okay, Mr. Travers? Leonard sees   the concern on their faces. Then the WHISPERS rise. Leonard   tenses, looking around. But none of the students' lips   are moving. Yet   the   WHISPERS PERSIST...   Coming from   nowhere and   everywhere.  49.",
      "dialogue_count": 0,
      "word_count": 501
    },
    {
      "scene_number": 3,
      "slugline": "INT. LEONARD'S APARTMENT -- NIGHT  The cozy home of a man who chose to give back rather than live in luxury. But Leonard is far from comfortable as he paces around, WHISPERS COMING FROM BEHIND HIM no matter which way he turns.   Surrounding him. HE CRANKS UP   MUSIC, blasting classic   rock. But   THE WHISPERS ONLY BECOME LOUDER... Drowning out the music. We can't quite make out what they're saying. But from the looks of it,   Leonard certainly can. And it's freaking him out.  INT. BEDROOM, LEONARD'S APARTMENT -- NIGHT  LEONARD IS   NOW CURLED   UP IN BED,   hands clenched over his ears. The MUSIC BLARES from the other room. But it's no use. The WHISPERS SURROUND HIM.   Overwhelming   him. LEONARD Stop it... Stop it! Leave me alone! But they're not going away. LEONARD Please... Please!  EXT. SCHOOL YARD -- DAY   (LEONARD - 5 DAYS AGO)  Leonard moves aimlessly amongst the CHILDREN playing at recess,   lost in a haze.   He hasn't slept in days. The children are all around him, but their laughs and yells seem to   echo   in the   distance. Drowned   out   by the   INCESSANT WHISPERING. Leonard tries   to ignore   it but can't,   every second of his life now a living hell. Then his eyes widen as he sees A   GIRL LYING FACE DOWN ON THE GROUND by one of the play structures, not moving. Leonard   snaps back to reality. LEONARD Chelsea?! Chelsea?! LEONARD   RUNS TO HER. The whispers   fading   as he comes to the little girl's aid. Turns her over   -- Revealing that the GIRL IS COVERED WITH PLAGUE-LIKE LESIONS, FINGERTIPS BLACKENED.   Like she's been dead for days.  50.",
      "characters": [],
      "action_text": "Leonard recoils at the horrifying sight, trying to make sense of it.   Then he realizes --   the school yard is suddenly silent.   No sounds of kids playing. He slowly turns... The bright sun has been replaced by dark storm clouds and fog. And all around him... EVERY CHILD IS LYING DEAD ON THE GROUND, COVERED IN   LESIONS,   FINGERTIPS BLACKENED,   FLIES BUZZING AROUND THEM. Leonard staggers, overwhelmed by the sight... But then he blinks, and suddenly --   EVERYTHING IS BACK TO NORMAL. Children frolicking about.   As if nothing happened. But Leonard   doesn't move.   Frightened   beyond words. The WHISPERS RISE again. Only this time, Leonard doesn't fight them. Instead, he takes a deep shaky breath.  EXT. BOARDWALK -- DAY   (LEONARD - EARLIER TODAY)  People everywhere. Headed to the beach. Perusing shops. On carnival rides. Enjoying   a summer day. Leonard moves amongst them. Now dressed in jeans with a white button-down shirt, neatly tucked in.   He's tense, filled with trepidation. Transformed by his experience. His eyes dart about the commotion, passing over the tan bodies with indifference. He's searching for someone.   Then his gaze steadies and he   slows... Standing at the boardwalk's rail are SABRINA, ADRIANE and REDMOND, all dressed in jeans and their colored button-down shirts. STARING RIGHT AT HIM. They've been waiting. Leonard stiffens. As if he was clinging to one last   shred   of hope that this wasn't real. But with a steadying breath, he steels himself and approaches. He stops in front of them. For a long moment, they all just stare at each other. LEONARD Did everyone bring what they were told to? The others nod. Leonard nods back, resolved. Then he   steps to the railing, looking out over the CROWDED BEACH   below. The others take in the sight with him, gazing at all the people. SABRINA There's so many of them...  51. LEONARD That's why we're here.  EXT. CABIN -- DAY   (BACK   TO   PRESENT)  Leonard stands alone on the front porch, looking out over",
      "dialogue_count": 0,
      "word_count": 1632
    },
    {
      "scene_number": 4,
      "slugline": "INT. COMMON ROOM, CABIN -- EVENING  Leonard, Sabrina, and Adriane stand over Eric and Andrew, hands cuffed behind them. Wen   back   in Eric's lap, glaring up at Leonard. LEONARD Once again, you have the opportunity to choose. We don't yet know what happened in the other rooms, but Eric looks even more troubled.   Whatever happened to him with Adriane, it   has shaken him to   the   core. While Sabrina looks   even more   uneasy after her time with Andrew. Leonard   glances   at his watch as the seconds tick... Tick... Tick... Adriane tries to steady her breathing... LEONARD I don't mean to rush you... But our time   is short. ADRIANE You mean my time is fucking short. She turns to Eric. He can't meet her piercing gaze. ADRIANE Don't make me do this... He doesn't respond.   What does she mean ? ADRIANE Listen man, you and us and everyone on this planet   is   gonna run out of chances if you don't choose right now! ANDREW He doesn't believe you. None of us believe you.   Let your time run out, we're not gonna   do what you want. ADRIANE Eric, this is your last chance... Her   eyes plead with   him. But he remains steadfast. LEONARD Very well. Your second choice has been made.   (MORE)  57.",
      "characters": [],
      "action_text": "to Adriane (   ) LEONARD   (cont'd) I'm sorry. Wen clings to Eric, burying her head in his chest. Knowing what's coming. Leonard picks up his weapon. The sledgehammer head still coated with Redmond's dried blood. But Sabrina hesitates. ANDREW You don't have to do this. LEONARD Sabrina... Sabrina meets his gaze, conflicted. Then she obediently picks up her weapon. ANDREW You don't have to do this! Leonard and Sabrina step to opposite sides of Adriane, taking deep, steadying breaths once again. ADRIANE No, no, no, wait... We move in on her as tears well up in her eyes.  AND WE ARE NOW IN ADRIANE'S PERSPECTIVE, SEEING HER STORY.  She glances around, desperate, beginning to panic. Leonard and Sabrina   step   closer to her, weapons raised... ADRIANE Please...   I don't wanna die... I don't wanna die...  CUT TO: INT. ADRIANE'S HOUSE --   EVENING   (ADRIANE - 1 WEEK AGO)  Adriane dabs her eyes with a dish towel, wiping the tears away. Then goes back to CHOPPING ONIONS. She's making fajitas with the finesse of a pro. The meat and vegetables sizzling in the pan.   Looks so good you can taste it. She   looks like a different person   here, rested and carefree. MANUEL (O.S.) Mama?   Is it almost ready? Adriane smiles   as MANUEL (5) comes in the back door.  58. ADRIANE You know it. Here, take these out. She   hands him   plates   and silverware.  EXT. BACK   PATIO, ADRIANE'S HOUSE -- EVENING  Adriane and Manuel   sit   at the table,   eating the fajitas. It's a beautiful evening, the sky a   tableau   of colors. An AIRPLANE soars   over   them, flying low, en route to the nearby airport   runway. Their modest suburban home is situated underneath the FLIGHT PATH,   which for Adriane's son means constant entertainment. MANUEL pointing to plane (   ) I bet that one's   coming from... France! Or Italy! ADRIANE Nah,   that's a puddle jumper. I'm thinkin'...   Richmond. MANUEL re: the next (   plane) Okay,   that   one's coming from... Florida.   Maybe someone brought an alligator ",
      "dialogue_count": 0,
      "word_count": 1572
    },
    {
      "scene_number": 5,
      "slugline": "INT. COMMON ROOM, CABIN --   EVENING  The tears are still wet on Adriane's cheeks as   she glances from side to side.   Leonard and Sabrina circle in around her with their medieval weapons.   Their movements precise, ritualistic. Just like before. ADRIANE Please... Oh God... She moves towards Eric, pleading with him. ADRIANE You're just gonna let this happen?! Just gonna let thousands of more people die?! ANDREW Don't listen to her. ADRIANE Oh, he's gonna listen to me! He's gonna hear me scream and wail and choke on my own blood, and I'll just be the first of so many more! She glances at Leonard and Sabrina lurking behind her, clenching their weapons, getting ready to strike. ADRIANE Oh, I'm sorry... You want me to put my mask on first before you   slaughter me? Well, if that's how it's gotta be. Gotta abide by the visions... She reaches into her pocket   and   pulls out her WHITE MASK -- But   then SHE   PICKS UP HER WEAPON   and   lunges forward. SHE YANKS WEN TO HER FEET,   AND   HOLDS HER WEAPON TO WEN'S THROAT. ERIC / ANDREW WEN! / LET HER GO! But they can't stop Adriane with their hands cuffed.   Wen squirms and screams, but Adriane holds her tight. Leonard and Sabrina slow their advance, not expecting this. SABRINA Adriane, stop! ADRIANE Stay back! Stay back or I'll slice her up!  64.",
      "characters": [],
      "action_text": "LEONARD You can't do this. They need to make a choice   -- ADRIANE Sorry, but I don't want my blood   and guts spilled   all over the floor! ERIC Please don't hurt her... ANDREW Leonard, fucking stop this! LEONARD Adriane, just let her go... It can't be   like this...   It won't   stop   -- ADRIANE They're just gonna wait us out till we're all dead! LEONARD They'll do the right thing... You'll see... ADRIANE Then why don't we trade places right now and see if you still believe that! LEONARD You'll ruin everything -- ADRIANE You're right,   I'll ruin everything! I'll damn it all to hell! to Eric (   ) Unless you stop me right now. Come on, Daddy Eric. It's up to you. Your daughter or your husband. Eric meets her fiery gaze, breathing fast. ERIC I... I can't... ADRIANE You have three seconds   to choose! ERIC No... Please --  65. ANDREW Someone stop her! ADRIANE Three... Everyone begins shouting,   creating   a CACOPHONY OF EMOTION AND VITRIOL. Eric caught in the middle of the maelstrom. ADRIANE Two... ERIC No, no, oh please God -- ADRIANE One... ERIC STOP! I'LL DO IT! And just like that, EVERYONE GOES SILENT. Andrew turns to his husband, horrified. ANDREW Do what? Eric doesn't answer.   Can't look at him. ANDREW Eric? Eric's gaze rises to meet the three intruders. But where he lacked conviction before, he has it now. ERIC I'll do it. But only if Wen isn't in the room. Adriane gives a small nod   and moves Wen towards the bedroom. WEN No! She tries to resist but   Adriane   pulls her along. WEN No! Daddy Eric, don't do it! You can't! Adriane   pushes   her into a bedroom, and closes the door, standing guard by it. Wen's cries echo from inside.  66. ANDREW Eric... You can't be... No... Andrew shakes his head, trying to come to grips with this. ANDREW This is crazy... You know they're crazy... Leonard pulls a SMALL KEY out of his pocket and UNLOCKS ERIC'S HANDCUFFS. ANDREW You're my husband. I love you. Do you hear me? I love you! We're a family! Adriane watches as Eric",
      "dialogue_count": 0,
      "word_count": 1015
    },
    {
      "scene_number": 6,
      "slugline": "EXT. BACK PORCH, SABRINA'S HOUSE --   DAY  Sabrina steps out onto her porch.   She takes deep breaths, trying to calm   her anxiety   as she looks out over   the beach- side town and   THE OCEAN IN THE DISTANCE. Hoping to find answers in its vastness. She unlocks her phone...   Brings up her dad's   number... Her thumb hovers over   the   \"Call\"   button   -- But she's interrupted by   a LOW RUMBLE.   THE PORCH BEGINS TO TREMBLE BENEATH HER.   DISTANT   SCREAMS ECHO. Sabrina's   gaze rises to the ocean...   And sheer horror   washes over   her face... An ENORMOUS TSUNAMI approaches   the shore at unbelievable speed... Careening towards her town. But she can't move, petrified by the sight.   People run for their lives, grabbing loved ones, screaming in terror -- And   the CRASHING WATER OVERTAKES THEM.   Their bodies flung about wildly, no way to survive. A   moment later,   SABRINA   IS SWEPT AWAY IN   THE   DELUGE OF WATER that rips everything apart.  INT.   REDMOND'S   TRUCK -- DAY   (SABRINA - EARLIER TODAY)  Sabrina sits in the backseat, in a daze.   Staring out the window, watching the power lines go up and dip down, up and dip down. Redmond drives, Leonard and Adriane in the other seats. All dressed for their arrival at the cabin.   Coldly focused. But Sabrina just stares away. Dreading what's to come.  EXT. HIGHWAY --   DAY  The truck suddenly pulls over.   Sabrina opens her door before it's stopped and jumps out. SHE VOMITS into the dirt. More dry heaves follow, and then subside. She   gathers herself, looking back. The others stare at her from inside the truck. She hesitates. Then climbs   back   in.   Pulling   the car door closed --  INT. BEDROOM, CABIN -- DAY   (SABRINA - A FEW MINUTES AGO)  The bedroom door closes. Sabrina's hand on the knob.  69.",
      "characters": [],
      "action_text": "She stands there for a moment, troubled by her thoughts. Then lets them pass as she takes a seat on the bed, facing Andrew,   his hands   still cuffed behind his chair. Just the two of them in here now. ANDREW Look, I don't know what your plan is, but you're wasting your time. SABRINA Oh don't worry, I know you're too closed-minded to ever open your eyes. I'm just babysitting you while the others talk sense into Eric and Wen. ANDREW It'll never work. SABRINA We'll see. ANDREW You know, I've been wondering... What happens when the clock ticks down to sunset, and you're wrong? SABRINA What happens when the clock ticks down to sunset, and we're right? Andrew chuckles, shaking his head. ANDREW I feel sorry for you. Not   the others, but I really, truly feel sorry for you. I mean, you're a nurse, right. You're someone who's trained to catch mental illness. I mean, what the hell happened to you? Sabrina bristles, not liking where this is going. ANDREW Your whole job is to heal people. To save lives. And now you're here. SABRINA We told you. We don't have a choice. ANDREW And you really believe that? SABRINA Yes. I do.  70. But her confidence is waning. ANDREW Bullshit. You're no harbinger of the apocalypse. You're a nurse with schizophrenia. SABRINA I've seen plenty of schizophrenics. There's a big difference between a delusion and a vision. ANDREW I'd call it more of a fine line. Or more likely, no line at all. SABRINA What are the chances four people had the exact same visions? ANDREW What are the chances one person had a delusion and convinced others it was real? I'd say that's a hell of a lot more plausible. SABRINA Now that's bullshit. ANDREW Then how come you never told us how you met? SABRINA We met this morning. At a boardwalk on the coast. ANDREW So you   came   all the way across the country   from California... Randomly showed up on a boardwalk... And just happened to find three other people dressed in jeans and fancy shirts who were all ready for the apocalyps",
      "dialogue_count": 0,
      "word_count": 1332
    },
    {
      "scene_number": 7,
      "slugline": "EXT. CABIN -- CONTINUOUS  The sunlight is fading as   Sabrina comes outside. She quickly picks up REDMOND'S WEAPON   off the porch   and   looks ahead   -- Andrew is nearly to their SUV.   The TIRES HAVE BEEN SLASHED, the deflated wheels sitting on the rims. Andrew yanks open the SUV's door. About to climb in -- But Sabrina   closes the distance and   swings   her weapon, CLOBBERING THE BACK OF HIS KNEE. Andrew cries out in pain as he falls   to the ground. Sabrina stands over him. She could kill him right now if she wanted to. SABRINA This is   all   real, no matter what you say... Andrew clenches his teeth as he clutches his   already SWELLING KNEE. She extends her hand to him. SABRINA Come on. We still need you. Andrew   raises a hand to acquiesce and cautiously moves to get to his feet -- But he suddenly throws   a HANDFUL OF DIRT   IN   SABRINA'S   FACE with his other hand. Then PUNCHES HER IN THE STOMACH, DOUBLING HER OVER. Sabrina gasps for breath, the wind knocked out of her as Andrew   pulls himself into   the SUV. Sabrina lunges for him -- HE CLOSES THE DOOR JUST IN TIME. She yanks on the handle but he's locked it shut. She   lets out a cry of frustration and   SMASHES HER WEAPON INTO THE WINDOW. The glass spiderwebs, but doesn't break. Through the   cracked glass, she can see Andrew frantically digging   out   a GUN CASE   in   the cargo area. Sabrina smashes the window again   with   the   weapon   and   THE GLASS   SHATTERS, showering Andrew in   shards.   But he's   focused on the gun case. Sabrina reaches in, pops the lock, and yanks the door open. SABRINA We don't have time for this!  75.",
      "characters": [],
      "action_text": "CLINKING METAL as Andrew fumbles with bullets, trying to load his gun. SABRINA SHOVES HER WEAPON IN, JABBING ANDREW IN   HIS   SIDE WITH   THE   BLUNT END. The bullets spill out of his hand as he cries out. SABRINA Get out, now! SABRINA   JABS HIM AGAIN, but Andrew   doesn't surrender, still trying to load the gun.   Sabrina flips her weapon around to the sharp end -- SABRINA I don't want it to be like this! But   ANDREW TURNS OVER WITH THE GUN IN HAND   -- BANG! THE BULLET HITS THE CEILING JUST ABOVE SABRINA'S HEAD, the explosive sound surprising both of them. Sabrina stumbles back as Andrew steadies his grip on the gun, aiming at her. ANDREW Now you listen to me, you crazy fucking bitch. Drop that thing and back the fuck up. SABRINA Okay... Okay... ANDREW BACK THE FUCK UP! Sabrina shuffles back, knowing the tide has turned. She lowers her weapon, but doesn't drop it. Still holding the gun, Andrew maneuvers   to get out of   the SUV,   face   contorting with pain due to his   SWELLING KNEE. ANDREW Keep going! Move! Sabrina takes another step back. And another. Andrew cringes as he   moves through   the broken glass -- SABRINA   TURNS AND   RUNS AWAY towards the forest.  76. Andrew   struggles to get out of the SUV, his KNEE ALMOST GIVING OUT UNDER HIM.   He winces,   aiming   his gun -- ANDREW Stop! Stop! Sabrina doesn't look back. Andrew balances his weight on his good leg, taking aim -- BANG!   The bullet just misses her. But the recoil from the shot causes Andrew to lose his balance and fall. He looks up just as Sabrina disappears into the trees. ANDREW Fuck! He grimaces, clutching his swelling knee, gritting through it.   NOW WE STAY WITH ANDREW. THIS IS HIS STORY.  Andrew   struggles to get back to his feet. Grabbing hold of the SUV and pulling himself up, every movement causing him pain. He looks out to the trees.   No sign of Sabrina. He limps forward, cringing, feet crunching on broken glass. The sound makes him look down   -- At the JAGGED PIECES OF GLASS ",
      "dialogue_count": 0,
      "word_count": 4037
    },
    {
      "scene_number": 8,
      "slugline": "EXT. CABIN -- EVENING  Sabrina steps out, followed by Eric carrying Wen's body, wrapped in the towel. Andrew limps behind them, gun in hand. They all stop on the porch, staring up at   the   -- VIOLENT STORM CLOUDS filling the sky.   Rain falls, lightning flashes, and thunder roars. Trees creak under an onslaught of wind. ONLY A FAINT HINT OF SUNLIGHT left on the horizon. Eric moves forward with purpose, holding Wen's body   tightly as he walks. Andrew limps behind. He stops at their SUV and opens the back door. Picks up several BULLETS he dropped earlier. RELOADS THE GUN as he hobbles to catch up. The three of them head down the gravel road towards the forest. IT BEGINS TO RAIN. Andrew looks up, letting the drops wash the blood from his face. He glances back -- At the cabin. Once so peaceful... And now so horrific. Then he continues after the others.  EXT. FOREST ROAD -- EVENING  RAIN POURS as the three of them walk down the muddy path. Andrew and Eric   side by side with Sabrina ahead. Andrew   looks up at the GRAY AND PURPLE STORM CLOUDS, roiling angrily. He quickly looks down and keeps walking. ANDREW How much further is it? SABRINA Not far. Andrew eyes the blood-soaked towel in Eric's arms. ANDREW I can carry her for a bit. Eric shakes his head no, mind swirling just like the storm clouds above. ANDREW What is it? ERIC Leonard was right. We haven't stopped it yet...  93.",
      "characters": [],
      "action_text": "ANDREW You're not thinking straight. ERIC Everything that he said would happen has happened. You just don't want to believe it. ANDREW All I want is to get to that truck and bury our daughter. Eric stops, facing Andrew. Sabrina turns, watching them. ERIC Do you really think that everything that's happened   today, everything we've seen... Do you really think it's   all just   a coincidence? ANDREW Do you really think that one of us killing the other would   stop the end of the world? Andrew   stares at him as the rain pours around them. ANDREW Do you? ERIC You didn't answer my question. ANDREW Yes, I think it's all a coincidence! A horrible, tragic coincidence! I have to believe that, because the alternative is too horrifying to even consider!   Now answer mine. Eric just stares back. ANDREW Do you   really   think that one of us needs to kill the other? Eric can't bring himself to   say it...   But Andrew can see it in his eyes.   He   does. SABRINA SCREAMING jars their attention. SABRINA NO! NO!  94. She puts her hands over her ears, closing her eyes, trying to drown something out, yelling to no one we can see. SABRINA I'm helping them! I'm helping them! SHE TAKES OFF RUNNING, hands clenched over her ears. ANDREW What the... Stop! Sabrina, stop! He raises his gun but she doesn't slow down, running into the forest. The dads follow, Andrew on guard with his gun, Eric still carrying Wen.   They catch up with her and see -- Sabrina frantically rooting around in the mud, MUTTERING TO HERSELF. Words drowned out by the rain. ANDREW What are you doing?! SHE TOSSES SOMETHING towards them. It lands at their feet. Andrew picks it up. It's the TRUCK KEYS. Then Sabrina rises, now holding a DARK VINYL BAG. ANDREW What's that? SABRINA The truck's only a little ways down the road. You can make it. ANDREW What's in the bag, Sabrina? Sabrina opens the bag, reaches in, and lets it fall. Revealing a PISTOL in her hand that's bigger than Andrew's. Andrew tightens his aim on her. But s",
      "dialogue_count": 0,
      "word_count": 1735
    }
  ]
}