{
  "slug": "a-most-violent-year-2014",
  "title": "a most violent year",
  "genre": "action",
  "format": "film",
  "scenes_count": 13,
  "characters_count": 1,
  "characters": [
    "ABEL"
  ],
  "total_words": 26026,
  "total_dialogue": 1,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. ANNA’S DRESSING AREA  The camera slowly moves in as ANNA sits in a slip at her make  up table putting on her face for the day ahead. She looks  into the mirror as if she is putting on a coat of armor.  INT. DRIVER’S CAB OF A BULK OIL TRANSPORT TRUCK - DAY  STANDARD HEATING OIL, “We set the Standard” is written in  logo form on the side of the tank.  The truck idles in traffic waiting to pay the toll to cross  the Verrazano bridge that spans the mouth of New York harbor.  JULIAN, the young driver from the dock, cautiously looks  around as the traffic inches along. He finally approaches the  toll booth and pays.  JULIAN  Good morning.  JULIAN speaks English with a well-sanded accent. Is it  Central American or Mexican? The female collector gives him a  smile.  He heads through the booth, but there is still traffic on the  other side as the lanes merge together. Just as the traffic  is about to pick up he looks in his rearview mirror and we  see TWO GUYS come walking through the traffic and towards the  cab. Before we know it they are climbing up the cab steps.  The GUY on the driver’s side, LOUIS SERVIDIO, is small and  very slight but he moves with great speed and strength. He  shatters the glass side window with his elbow. Unlocks the  door just as his partner, THUG #2, does the same thing on the  passenger side, but he is holding a gun. They are not wearing  masks. It’s very brazen.  Before THUG #2 even asks JULIAN to get out of the cab LOUIS  SERVIDIO crushes him in the jaw with three swift punches then  pulls him out of the cab and down onto the roadway.  LOUIS SERVIDIO pulls the door shut and they drive away with  the truck leaving JULIAN sitting in the middle of the road  staring, as blood starts to flow from his jaw.  INT. PARKING YARD OF STANDARD HEATING OIL- SAME TIME  Two almost-matching late model Mercedes pull up to a chain-  link gate with a small sign that says “STANDARD HEATING OIL:  WE SET THE STANDARD”. The DISPATCHER opens the gate.  3",
      "characters": [
        "ABEL"
      ],
      "action_text": "They both pull into reserved parking spaces next to each  other. ABEL is dressed in a very tasteful custom made suit.  ABEL’s wife ANNA was driving the car behind him.   She is a  beautiful, tall, blonde woman dressed to the nines but with a  streak in her eye that this is all business.   You would not  want to cross this woman.  ABEL  Ready?  ANNA  Yes.  ABEL  You look very nice.  ANNA  Thank you.  ABEL  You sure?  ANNA  Yes.  ABEL walks around and opens his trunk. He takes out two large  empty briefcases.  He carries the briefcases as they both walk over to a large,  unmarked, armored van that is idling in the middle of the  parking lot. Two ARMED GUARDS get out of the van. One is  holding a clipboard. He walks up to ANNA and ABEL. He hands  them the clipboard. They look at each other one last time and  then both sign the document.  The other GUARD opens up the back of the truck. ABEL hands  him the briefcases and the guard begins to fill them with  cash. Lots of cash. ABEL and ANNA stand at the open back of  the van and just watch. Finally he finishes and hands the now-  heavy cases to ABEL.  ABEL picks up the two cases and walks a bit away from the  truck. He turns to ANNA.  ANNA (CONT’D)  Don’t do anything stupid.  ABEL  We don’t have any more money so  what else could I do.  She gives a small smile. He looks at his watch. They kiss.  4 ABEL turns and begins walking with the cases. He gives a nod  to the DISPATCHER, who we now see, is in a small gatehouse,  and he begins to open the front gate.  EXT. STREET OUTSIDE THE FRONT GATE- SAME TIME  ABEL walks out through the gate and down the abandoned  industrial street about 25 yards, then looks to his right. He  looks down at the cases in his hands, turns, and stands  looking into the neighboring site.  EXT. MASSIVE OIL TANK FARM: BROOKLYN NY WATERFRONT - DAY  ABEL comes walking across the parking lot and sees ANDREW  WALSH standing in the middle of the dusty parking lot. ANDREW  is their longtime LAWYER/RIGHT-HAND",
      "dialogue_count": 1,
      "word_count": 4361
    },
    {
      "scene_number": 2,
      "slugline": "INT. SHIT-HOLE TENEMENT STAIRWELL - DAY  ABEL is helping JULIAN up the stairs. They struggle together.  Finally they get to the top floor and stand outside apartment  number . JULIAN stops, not really wanting to open the door in  front of his boss.  ABEL  I’m very sorry this happened. Do  you need anything else?  (JULIAN nods no)  If you do, you call the office...  Okay then.  He turns to leave and walks back to the stairs.  JULIAN  Abel?  ABEL turns and looks at him.  JULIAN (CONT’D)  Do you think I am ready to move  into sales?  ABEL thinks this through.  ABEL  I don’t.  JULIAN  I... I’m not sure I will be able...  ABEL  You will.  JULIAN changes the subject.  JULIAN  Did you get the truck back?  ABEL  Yes. They took the load.  JULIAN  This is the sixth one?  ABEL  Seventh... you get some rest.  24",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 146
    },
    {
      "scene_number": 3,
      "slugline": "EXT. BUILDING BY ABEL’S CAR - DAY  ABEL comes out of the building and walks towards his car  where a group of TOUGH-LOOKING KIDS in their early twenties  are sitting, looking to see who is going to come and claim  the brand new car.   He walks right though them without being  overly aggressive but without a hint of being intimidated. He  gets in and drives away.  INT. BROOKLYN BARBERSHOP - NIGHT  ABEL is sitting in the barber chair getting a trim. Through  the window we see ARNOLD KLINE, a competitor of ABEL’S  walking by. They see each other. ARNOLD KLINE comes into the  shop followed by a BODYGUARD. He sits down next to ABEL. This  conversation happens with them both looking at each other in  the mirror.  ARNOLD KLINE  Well, look who it is.  ABEL  Arnold.  ARNOLD KLINE  Just a touch off the side Jimmy.  Not all of us are as lucky as Mr.  Morales here in terms of keeping  our hair.  BARBER JIMMY  You’re a good looking man.  ARNOLD KLINE  I know I am. So I hear  congratulations are in order?  ABEL  What’s that?  ARNOLD KLINE  You got yourself in contract over  there.  ABEL  We are working on it.  ARNOLD KLINE  Thirty day close I hear, you better  be.  ABEL  We are, thanks for your concern.  25",
      "characters": [],
      "action_text": "BARBER JIMMY finishes ABEL, and he stands up to leave. ABEL  has his back to KLINE as he pays.  ARNOLD KLINE  I saw a couple of your trucks over  in Rego Park the other day.  This brings ABEL around to look at him square.  ABEL  Really? When was that?  ARNOLD KLINE  A couple times.  ABEL  It’s possible.  ARNOLD KLINE  Is it?  ABEL  Yes.  ARNOLD KLINE  That’s a tough market.  ABEL  It is.  ARNOLD KLINE  My father struggled for years  before he broke in there.  ABEL  Any new market is a tough one. I’ll  see you.  ABEL walks out of the shop and looks around. It is now dark  outside.  EXT. COUNTRY ROAD - NEXT MORNING  ABEL is jogging again but this time he is deep in the woods.  He runs along the road. We then hear a car coming from behind  him. The car noise then turns into more of a truck noise. He  stops and turns around as we see a large truck coming towards  him.  He gets himself over to the side of the road. We have a  slight fear it might hit him. But as it passes we see it’s a  large moving truck. There’s a second one following right  behind it.  26 As the trucks pass it registers on ABEL’s face. He cuts into  a path in the woods.  EXT. DRIVEWAY  ABEL walks up to his house, and we see the moving trucks  preparing to unload. ANNA gets out of her car with the kids,  and they run around and check out the house as ANNA directs  the movers.  ABEL comes up and stands next to her. They smile a protected  smile at their new home. ABEL gives her a kiss.  INT. DINING ROOM OF NEW HOUSE - NIGHT  The whole family sits around the table in candlelight. They  are eating takeout, but with a mismatch of formal and  everyday tableware that has been unpacked. There are boxes  all around them.  ANNA  I know it has been a long road, and  that not all of you wanted to do  this, but thank you. For me...  ABEL  A toast.  All six raise a glass.  ABEL (CONT’D)  A toast to our new home. It’s as  beautiful as my wife and daughters  and as strong as me...(kids laugh)  May we be happy, prospe",
      "dialogue_count": 0,
      "word_count": 2024
    },
    {
      "scene_number": 4,
      "slugline": "EXT. FRONT DOOR TO ABEL’S HOUSE - NIGHT  ABEL comes to the end of the front walk and there is nothing.  The dog has now followed him outside and is slowly heading  over to a area where a small exterior hallway leads to a side  entrance. It is dark. The dog starts barking and going crazy.  ABEL slowly heads over to the covered passageway.  All hell now breaks lose. A BURGLAR, in all black, comes  blasting out of the shadows. The dog tries to bite him as he  goes by. ABEL swings his club and hits BURGLAR square on the  shoulder but he keeps coming. He knocks ABEL over and runs  towards the driveway. ABEL is up and chasing after him faster  than we expect.  EXT. BASE OF THE RAVINE DEEP IN WOODS- CONTINUOUS  There is a pretty good moon out so we can see them running  full throttle through the very thick woods. ABEL is keeping  up with him and in fact may be gaining on him.  ABEL is still in his pajamas. He has a rage that has been  building up inside him for a good two weeks that is now  pouring out of him in the energy to chase this guy down.  They come to the top of a small ravine which ABEL seems to  know from his runs through the woods and ABEL takes a bit of  an easier/quicker path down.  EXT. WOODS BEHIND ABEL’S HOUSE - CONTINUOUS  ABEL now cuts him off at an angle and swings the bat at his  legs. BURGLAR trips and goes flying. ABEL falls as he swings  at him. They both sit on the ground for a beat. ABEL is  exhausted. They stare at each other.  A brief look of panic comes across BURGLAR’s face. Then he is  up again and running off into the woods.  ABEL gets himself up and chases after him.  EXT. ROAD NEXT TO THE WOODS - NIGHT  ABEL comes out of the woods into the middle of the road, and  in the distance we see BURGLAR run up to a waiting van with  its lights and engine on. The guy gets into the passenger  side of the van, and it peels out.  ABEL is left standing in the middle of the road, barely able  to breathe and holding the bat.  35",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 387
    },
    {
      "scene_number": 5,
      "slugline": "EXT. ABEL FRONT DOOR - NIGHT  ABEL comes walking back towards his front door. ANNA is  standing with all the lights on and with the dog sitting next  to her. She looks at him in shock.  ANNA  Where were you?  ABEL  (looking to the dog)  A lot of help you were.  ANNA  Abel?  They both look down at his bare feet. He has been in some  kind of shock and hasn’t even noticed that his bare feet are  cut up to pieces from running in the woods through the ice.  His feet are bleeding all over the walkway.  INT. POWDER ROOM OF ABEL AND ANNA’S HOUSE - NIGHT  ANNA is in warrior mode. Any panic in her voice has  disappeared, and she is speaking with a calm yet deadly  seriousness. She is cleaning the cuts on his feet and putting  bandages on them as they talk.  ANNA  Who was it?  ABEL  What do you mean, how am I supposed  to know who it was?  She gives him a look.  ABEL (CONT’D)  I don’t know.  She gives him another look.  ABEL (CONT’D)  I think it was just some punk,  looking to rip us off.  ANNA  If you...  ABEL  Ouch! If they had wanted to send a  message he could have... and he  didn’t.  36",
      "characters": [],
      "action_text": "ANNA  Seems like a message was sent loud  and clear.  ABEL  Please. Don’t get going on this. We  are a big new house. He probably  wanted the TV. He didn’t have a  gun, he had nothing. The alarm will  be in on Monday. It was some kid.  They aren’t coming back.  She looks at him with considerable concern.  He leans in and starts kissing her. She holds still at first  then gives in.  INT. TRAINING ROOM AT STANDARD HEATING OIL - NEXT MORNING  ABEL is in a suit but is kneeling and almost lying on his  back showing three SALES RECRUITS what they should be looking  for. Another INSTRUCTOR looks on. We see ABEL in his element.  He is a salesman.  ABEL  What you are looking for here is  the opening to the burn chamber.  Now at this point you have not  tipped your hat in anyway. From the  minute you walked in the house you  should have been working to create  an impression of total  impartiality. But now...  He reaches over and opens the small door. A fire is burning  inside. On cue the instructor hands ABEL a crisp clean white  handkerchief.  ABEL (CONT’D)  When this door opens you begin to  close. It must always be spotless.  If they see you have ever done this  before it is over.  He takes it and reaches up into a small exhaust chimney.  ABEL (CONT’D)  Now, you do this and only this...  You look down at the cloth and  don’t say a word... You just keep  staring at the cloth and then you  slowly just start shaking your  head. Very very slowly and small.  37  (MORE) Don’t look up at them. Just at the  cloth.  Then ABEL makes a small clicking noise.  INSTRUCTOR  Do you hear that noise... that’s  the noise.  SALES STUDENT ALEX  What noise?  ABEL  It means you are close... Then  after sitting in silence way longer  than is comfortable, you turn. And  say “I’d love to run a few numbers  for you. Is there somewhere more  comfortable we could sit.” They  will almost always take you to the  dining room table and will offer  you something.   And whatever it is  you always take the f",
      "dialogue_count": 0,
      "word_count": 3719
    },
    {
      "scene_number": 6,
      "slugline": "EXT. STANDARD HEATING OIL TRUCK   - DAY  Throughout this conversation ABEL is walking over to a  section of the yard where WORKERS are loading some sort of  additive chemical to the fuel trucks.  ANDREW WALSH  It is looking like we must do this.  ABEL  I   must?  This gets a little personal.  ANDREW WALSH  They will shut you down.  ABEL  These men, they work for me. These  trucks they drive, the customers  they serve. They are here because  we built this.  ANDREW WALSH  That’s true, until its not. And the  last person in the world right now  that we need working against us is  the president of the fucking  teamsters. This company is out of  business in a month if he gets  these guys to walk. We are running  out of cash.  ABEL  What are you even talking about  here?  ANDREW WALSH  The union provides a handgun and a  permit to every one of the drivers.  And they think this whole thing is  over in a week.  ABEL  These men are fucking truck  drivers. This is insane. You know  who is gonna get it in the end  here, me. This comes back to me.  ANDREW WALSH  It does either way.  ABEL  I’m not doing it.  55",
      "characters": [],
      "action_text": "ANDREW WALSH  Would you put everything at risk to  stand by that.  ABEL thinks this through.  ABEL  It will be the end of everything I  have worked for. If one of these  guys shoots somebody it’s me they  will bring down for it...I’ll talk  to him... And we need to close this  deal. We can’t stay like this any  longer. We must close on that  property... We are so weak right  now.  They are now standing on top of one of the trucks tanks as a  worker pours the additive into the tank. The container says  “GREEN DYE #7” on it. ABEL looks down as it flows in.  He stands up and looks out across the fence at the container  property.  ANDREW WALSH  Why do you want this so badly?  ABEL  Because I have my entire savings at  risk with this deposit. It is  everything.  ANDREW WALSH  That’s not what I mean. Why   did   you  want it so badly in the first  place? It was a risk... always.  ABEL thinks this through.  ABEL  I don’t know.  ANDREW WALSH  You don’t know?   Have you ever  thought about it?  ABEL  I’ve thought about it every day for  the last five years. This place was  sitting over that fence mocking....  ANDREW WALSH  I didn’t mean have you ever thought  about that place...  56  (MORE) I mean have you ever thought   why  you want it so badly?  ABEL  I don’t know what you mean.  ABEL looks to him in a sincere way wanting him to answer but  ANDREW just waits. Finally.  ABEL (CONT’D)  I know what you are asking and  no... I never ask myself why I do  this. It just feels right...  wanting to be bigger feels better.  It feels right.  ANDREW WALSH  That’s very simple.  ABEL  Yes...  With this he gives him a deadly serious look.  ABEL (CONT’D)  ...It is.  ANDREW WALSH  You take these risks...  ABEL  Only when necessary.  ANDREW WALSH  We have to get going, we need them  to show up.  INT. WHITE TABLECLOTH RESTAURANT - NIGHT  ANNA leads the boys to the table, and we see a whole new side  to her. She is going to get this done. As they approach the  table we see two BANKERS stand ",
      "dialogue_count": 0,
      "word_count": 6068
    },
    {
      "scene_number": 7,
      "slugline": "EXT. PETER FORENTE’S DRIVEWAY - DAY  ABEL is walking across the beautifully-manicured driveway,  and as he gets nearer to his car he starts to hear the mayhem  that is coming from the CB radio in the front seat. As he  gets closer he gets more and more details.  RADIO DISPATCHER V.O.  Where is the truck now?  RESPONDING DRIVER V.O.  It’s still on the bridge.  RADIO DISPATCHER V.O.  Is it still leaking oil?  RESPONDING DRIVER V.O.  No. They have stopped the leak.  RADIO DISPATCHER V.O.  Did it reach the river?  RESPONDING DRIVER V.O.  Some did.  RADIO DISPATCHER V.O.  How many shots were fired?  ABEL now slams open the door and gets into the driver side  and picks up the microphone.  ABEL  Joanne it’s me. What are you  talking about... what shots?  The camera now comes around to the outside of the car looking  back at ABEL through the windshield. The mansion is looming  in the background. We see ABEL’S face react as he hears the  news of the incident on the bridge. The camera pulls back as  ABEL’S face goes totally cold.  INT. COURT ROOM - DAY  ABEL walks into an almost empty courtroom. LAWRENCE is  packing up his things at the front of the room. They catch  each others eye. ABEL makes his way forward as everyone else  leaves. They look at each other for a beat.  A.D.A. LAWRENCE  I heard.  82",
      "characters": [],
      "action_text": "ABEL  I need to make sure you know that  we had nothing to do with this.  It’s not the way I do business. In  fact I have been warning my men  against doing this sort of thing.  It is terrible for me.  A.D.A. LAWRENCE  It’s not good... for either of us.  ABEL  Yes.  A.D.A. LAWRENCE  In my job we use whatever leverage  we can gain, as I’m sure you do in  your business. It’s an ongoing  investigation, and it will be just  one piece of many. So while I  appreciate you coming here... I  have nothing I can tell you.  LAWRENCE looks around the room thinking while ABEL says  nothing, just waiting.  A.D.A. LAWRENCE (CONT’D)  What a fucking mess this place  is... Do you know where he is?  ABEL  No... but I’ll find him.  A.D.A. LAWRENCE  You should. And when you do, bring  him to us. A situation like this,  happening in such a dangerous and  public way, within an industry I’m  charged with cleaning up. It’s very  bad for me... professionally  speaking.  They look at each other one last time. ABEL gets the message.  EXT. SMALL QUIET SIDE STREET, QUEENS - DAY  SALES STUDENT ALEX is walking down the street looking  terrible. His clothes are ruined by garbage, and he is  scared. As he approaches his car his face drops.  The car has a two-by-four slammed through the shattered  windshield.  83 He stops dead in his tracks and then carefully looks around  and scans the street looking for anything. It is eerily  empty.  EXT. OUTER GATE, STANDARD HEATING OIL YARD - DAY  ABEL pulls up in his car and the gate starts to open. As it  does we see ARTHUR LEWIS standing waiting next to his car.  ABEL pulls in next to him and gets out. There is an  overriding, almost unsettling calm to this conversation.  ARTHUR LEWIS  Abel.  ABEL  Arthur.  ARTHUR LEWIS  I wanted to come and talk to you in  person... We aren’t going to be  able to show up for you on Monday.  We can’t do the loan.  ABEL  I...  ARTHUR LEWIS  I wanted to let you know as soon as  possible so that you could try to  put something el",
      "dialogue_count": 0,
      "word_count": 1719
    },
    {
      "scene_number": 8,
      "slugline": "INT. ANNA’S CAR ON HIGHWAY - DAY  All five of them are sitting in the car, sadness prevails.  INT. ANNA MORALES’ LIBRARY - NIGHT  The camera moves slowly across a dark hallway.   We hear the  sounds of a manual adding machine grinding away.   As we come  through the doorway we see ANNA MORALES sitting at her desk  in a pool of light from the desk lamp.   She is deep in it  crunching numbers.   Finally ABEL walks into the doorway, he  looks exhausted.  ABEL  Hey.  She looks up with a small but sweet smile.  ANNA  Hi.  ABEL  How’s it coming?  ANNA  I’ve made it to 1975.  ABEL  That was a good year.  ANNA gives a slight look that the numbers may not totally  support that claim.  ABEL (CONT’D)  Well it was for me...how is it?  ANNA  I’m not sure yet... but it’s not as  bad as they are saying it is...  Turns out I kinda knew what I was  doing.  They give each other a slight smile.  ANNA (CONT’D)  How’d you do?  ABEL  I got us a three more days... and  one piece... from Saul. But we’re  still about a million short.  They look at each other with concern.  90",
      "characters": [],
      "action_text": "ANNA  You’re going to see your little  brother?  ABEL  First thing.  ANNA  And Peter?  ABEL  Probably.  As they look at each other ABEL  ANNA  This   is   all worth it.  He pauses just long enough to think.  ABEL  Of course.  A sense of caring and resolve comes over them. At least now  they know what needs to be done.  ABEL (CONT’D)  You should get to bed.  ANNA  I’ll be up.  ABEL  I love you.  ANNA  I love you too.  ABEL turns to go upstairs as ANNA starts in again with the  machine.  INT. HALLWAY, OUTSIDE OF JULIAN’S APARTMENT - DAY  ANDREW stands in the hallway about to knock, but he waits for  a beat. He knocks.  The door opens to a young woman, presumably JULIAN’S wife,  LUISA.  ANDREW WALSH  Is Julian here?  91 LUISA  No.  ANDREW WALSH  Abel would like to speak with him.  To help him.  LUISA  I will tell him.  JULIAN steps into the frame from behind her.  EXT./INT. LARGE LATE-MODEL AMERICAN CAR, PARKED - DAY  A DRIVER is sitting in the driver’s seat. ANDREW walks up and  gets in the front seat. JULIAN gets into the back and looks  over at ABEL who is sitting next to him. They drive off and  nobody says a word for a very, very long time.  EXT. EMPTY PARKING LOT - DAY  The car finally pulls into a large empty parking lot. For a  couple beats JULIAN has a look on his face that he may be  getting rubbed out.  Then off in the distance we see two cop cars. The car pulls  up to them and stops. ABEL and the DRIVER get out of the car  without a word, but ANDREW stays and turns around and now  gives him a total debrief.  JULIAN  He’s turning me in?  ANDREW looks at him without much remorse.  ANDREW WALSH  Of course we are turning you in.  You have put everything that man  has worked for for the last 20  years at risk. If it was up to me  we would be dealing with this in a  very different way.  JULIAN  But I know things...  This causes ANDREW to turn quickly back to him with as sharp  a look as he has.  ANDREW WALSH  Really?  92 JULIAN  Yes.  ANDREW WALSH  And what thing",
      "dialogue_count": 0,
      "word_count": 1026
    },
    {
      "scene_number": 9,
      "slugline": "EXT. VARIOUS 1980’S URBAN DECAY LANDSCAPES  We are now with JULIAN again, running. But as this chase  continues we see his face turn from fear, to desperation, to  a creeping sense of evil. He does not know how it has come to  this, but as he jumps down from fences and runs across  deserted lots we see that his weakness is turning.  As he runs through some of the most bombed-out, destroyed  sections of Queens, he just never stops. With each step his  fear turns to... anger.  EXT. BLOWN-OUT BUILDING  He stops, collapses, and hides behind a blown-out building  wall just as a COP CAR drives by. He starts to almost cry,  but then it again becomes something else. His survival  instinct is taking over and we are not sure what will become  of it. Anger.  INT. OLDEST HASIDIC BUSINESSMAN’S LIVING ROOM - DAY  ABEL sits across from the oldest Hasidic member of the  family, JOSEPH, from the first scene.  ABEL  Thank you for seeing me.  JOSEPH  Of course.  ABEL  I need more time.  JOSEPH  Of course you do.  ABEL  I know our agreement doesn’t allow  for that. But... I need more time.  JOSEPH  Why?  This takes ABEL back a bit.  ABEL  Thank you for asking. Many, many  reasons.  96",
      "characters": [],
      "action_text": "JOSEPH  It’s a difficult time to do  business.  ABEL  Yes... it is.  JOSEPH  I’ll give you three more days. Then  it’s over.  ABEL  Thank you.  INT. ASSISTANT DA’S OFFICE - DAY  ANDREW sits across from LAWRENCE and DEPUTY LANGE. They wait  while LAWRENCE writes something down on a pad in front of  him. He finishes.  A.D.A. LAWRENCE  So. I should start by thanking you  for your assistance in... in  attempting to bring in your driver?  ANDREW WALSH  We didn’t think he’d react that  way.  A.D.A. LAWRENCE  Yes... Well, the officers there  didn’t set it up very well on their  end either.  ANDREW WALSH  I’m sorry.  A.D.A. LAWRENCE  We are looking for him.  ANDREW WALSH  So are we... it’s very sad. He was  very close to Abel.  A.D.A. LAWRENCE  I understand. Well... Ms. Lange.  DEPUTY LANGE  It has been brought to our  attention that it might be  beneficial on your end to resolve  this issue in a time sensitive way.  97 ANDREW WALSH  Possibly.  DEPUTY LANGE  So we have prepared an offer for  you to review.  They slide the offer across the table. ANDREW opens it and  gives it a once over.  ANDREW WALSH  I’ll show this to them. He’ll never  go for it, but it’s a start.  A.D.A. LAWRENCE  This could get a lot worse for you  all.  ANDREW WALSH  I know... I will present it to him.  ANDREW gets up and prepares to leave. LAWRENCE stands with  him and walks him out into the hallway.  ANDREW WALSH (CONT’D)  Thank you.  A.D.A. LAWRENCE  And Andrew, one other thing.  He turns. They are now alone in the hallway.  INT. IMPOSSIBLY LONG HALLWAY - DAY  A.D.A. LAWRENCE  I need this to stop.  ANDREW WALSH  You need what to stop?  A.D.A. LAWRENCE  This fucking bullshit with the open  warfare. I won’t put up with it.  It’s starting to be a real problem.  ANDREW WALSH  Starting to be? No shit.  A.D.A. LAWRENCE  Not for you... but   for me .  This lingers for a beat as the meaning sinks in.  98 A.D.A. LAWRENCE (CONT’D)  I need the driver.  ANDREW WALSH  I understand. The kid went out and  got his",
      "dialogue_count": 0,
      "word_count": 2584
    },
    {
      "scene_number": 10,
      "slugline": "INT. ANNA MORALES’ LIBRARY - NIGHT  The camera moves slowly across a dark hallway.   We hear the  sounds of a manual adding machine grinding away.   As we come  through the doorway we see ANNA MORALES sitting at her desk  in a pool of light from the desk lamp.   She is deep in it  crunching numbers.   Finally ABEL walks into the doorway, he  looks exhausted.  ABEL  Hey.  She looks up with a small but sweet smile.  ANNA  Hi.  ABEL  How’s it coming?  ANNA  I’ve made it to 1975.  ABEL  That was a good year.  ANNA gives a slight look that the numbers may not totally  support that claim.  ABEL (CONT’D)  Well it was for me...how is it?  ANNA  I’m not sure yet... but it’s not as  bad as they are saying it is... I  guess I knew what I was doing.  They give each other a slight smile.  ANNA (CONT’D)  How’d you do?  ABEL  I got us a three more days... and  one piece... from Saul. But we’re  still about a million short.  Concern and exhaustion creep onto Abel’s face.  ANNA  You’re going to see your little  brother?  109",
      "characters": [],
      "action_text": "ABEL  First thing.  ANNA  And Peter?  ABEL  Probably.  Abel is now sitting down on the chair.  ABEL (CONT’D)  How are the girls? I feel like I  haven’t seen them in days.  ANNA  They’re fine.  ANNA gets up from her desk and comes over to him.  ANNA (CONT’D)  This   is   all worth it.  He pauses just long enough to think.  ABEL  Of course.  ANNA  Look at us...it is.  ABEL  I know.  A sense of caring and resolve comes over them. At least now  they know what needs to be done.  ABEL (CONT’D)  We should get to bed.  ANNA  I’ll be up.  ABEL  I love you.  ANNA  I love you too.  ABEL turns to go upstairs as ANNA starts in again with the  machine.  110",
      "dialogue_count": 0,
      "word_count": 312
    },
    {
      "scene_number": 11,
      "slugline": "INT. ABEL’S CAR - DRIVING - DAY  ABEL is driving towards the office and is listening to the  idle chatter on the radio between the dispatcher and the  drivers who are out. They are underneath the Brooklyn Queens  Expressway in stop and go traffic.  Suddenly a panic stricken VOICE blasts through on the radio.  SENIOR DRIVER EDDY V.O.  Motherfuckers!  RADIO DISPATCHER V.O.  Who’s that?  SENIOR DRIVER EDDY V.O.  It’s 17. Two guys are coming at me.  RADIO DISPATCHER V.O.  Where are you?  We now hear the driver yell at the TWO GUYS coming at him.  SENIOR DRIVER EDDY V.O.  Fuck you!  RADIO DISPATCHER V.O.  Where are you!  SENIOR DRIVER EDDY V.O.  Hall Street and Flushing Ave. I’m  out of...  RADIO DISPATCHER V.O.  Eddy? Eddy?  ABEL looks up at the street where they are and realizes this  is going down right down the street from them. He’s had  enough.  He pulls across the intersection and heads down a street. He  comes to the next intersection and right in front of him the  truck comes flying by.  He looks to his right and sees EDDY standing at the side of  the road. But he wants to end this. So he pulls out and  starts following the truck leaving EDDY behind.  ABEL follows the truck for several blocks through the  industrial neighborhood. He is tempted to pull up alongside  of it to see who is driving but doesn’t. He continues to  follow him.  111",
      "characters": [],
      "action_text": "They get to a light and the truck makes a right hand turn  and, as they are turning, LOUIS SERVIDIO who is sitting in  the passenger seat looks behind him and sees that ABEL is  following him. It now turns into a high speed chase as the  driver steps on it.  They race down a ramp into a railyard. ABEL chases the truck  as it crosses the tracks and heads towards an abandoned  tunnel. The truck races into the tunnel and ABEL follows. The  truck is throwing up a dust storm and ABEL has a difficult  time seeing where he is going but he keeps up.  The roadway is very bumpy and both the truck and ABEL’S car  are thrown around and the truck almost hits the sides of the  tunnel.  The light at the end of the tunnel starts to appear through  the dust but we can’t see the truck. As ABEL comes into the  light he has to SLAM on his brakes because the TRUCK has  flipped over in front of him.  As he gets out of his car he sees LOUIS SERVIDIO jumping down  from the overturned cab and run off into the train yard. ABEL  looks at the crushed cab of the truck and sees the DRIVER has  been killed. There is a gun sitting on the dash of the truck  and ABEL looks and thinks. He then picks up the gun and  chases after LOUIS SERVIDIO.  In the distance he sees LOUIS SERVIDIO leave the yard and  head up into an elevated subway station.  EXT. SUBWAY STATION - DAY  ABEL runs up the stairs of the station and hops onto a  leaving train just as the doors shut. ABEL looks around.  There are three people in his car. It is covered in graffiti.  He starts making his way down to the end of the train where  the guy is.  He looks into the last car and sees LOUIS SERVIDIO and just  bull rushes him to the ground. He starts beating on him very,  very badly with the pistol. All the rage comes out of him. He  then aims the gun at LOUIS SERVIDIO.  LOUIS SERVIDIO  Please. Please.  They stare at each other.  ABEL  Your friend is dead... who do you  work for.  112 LOUIS SERVIDIO  You know I could never tell you  t",
      "dialogue_count": 0,
      "word_count": 1795
    },
    {
      "scene_number": 12,
      "slugline": "INT. ABEL AND ANNA’S LIVING ROOM - NIGHT  ABEL comes in as ANNA is sitting at the table smoking. He  walks over and sits down at the table with her.  She gives him a great sly smile.  ANNA  What a day.  ABEL  Yeah.  ANNA  Are you okay?  ABEL  Yes.  ANNA  Car chases?  ABEL  Yeah.  ANNA  Who knew?  She gives him a loving look.  ANNA (CONT’D)  How was your brother?  ABEL  He seemed good... But the girls up  at that place are...  ANNA  Stop.  ABEL  I can tell you the girls didn’t  look like that where I went to  school...  ANNA  Enough.  After a brief light moment the cloud comes back over him.  ABEL  How are we here?  120",
      "characters": [],
      "action_text": "ANNA  It was a lot of things all at once.  ABEL  Yeah.  ANNA  How did it go?  ABEL  We can probably pull it off. Three  different parties... it’ll be a  mess... and the terms... Peter  suddenly showed me his true colors.  He lets out a brutal sigh.  ANNA  I’m sorry.  ABEL  I spent my whole life trying not to  become a gangster...  ANNA  I know.  ABEL  ...And now... on the biggest deal  in my career they will all control  me.  He sits there for a long beat and then she comes and hands  him a piece of paper with a series of numbers on it. He looks  up at her.  ABEL (CONT’D)  What is this?  ANNA  It’s a bank account.  ABEL just waits for more but gets nothing.  ABEL  Whose?  ANNA  Ours.  ABEL  How much is in it?  121 ANNA  A lot.  ABEL  What does that mean?  ANNA  It will help. You could replace  Peter’s money and get him out of  the deal.  ABEL  Where did it come from?  ANNA  Abel.  ABEL  Where did it come from?  She stops and thinks, then:  ANNA  Since 1971 I have been skimming  money out of the company. Some  years a little... others a lot. In  the beginning it was just in case  times got tough but then it was  because you were taking all these  chances... I didn’t know what else  to do... I couldn’t risk having us  be left with nothing.  This knocks him back.  ANNA (CONT’D)  I’m sorry.  ABEL  What do you expect me to do with  this?  ANNA  Use it.... Abel...  ABEL  Is it clean?  ANNA  What does that mean?  He thinks that through.  122 ABEL  It means if you walked into the  office of the people who have been  trying to put us in jail right now  and slapped a check from that  account down on their desk would it  push me further into hell or help  to get me out?  ANNA  It’s as clean as every other dollar  we’ve ever made.  ABEL  That’s a fucking bullshit answer.  ANNA  I can clear it on the books.  ABEL  Well it sounds like you should take  this money and keep it right where  it is... because I’m going to  pretend that we never had this  conversation. And you can use t",
      "dialogue_count": 0,
      "word_count": 1003
    },
    {
      "scene_number": 13,
      "slugline": "EXT. BEHIND THE TANKS, WITH A VIEW OF THE CITY - DAY  They all look out.  ANNA  What a hell-hole this city is.  ABEL  No.  ANDREW WALSH  I don’t know why but I guess I  never realized we even had this  view from back here.  That line sits for a long beat.  ABEL  I did.  Then they hear someone behind them. They turn. It’s JULIAN.  He is standing holding a gun. They stare for a long beat.  ABEL (CONT’D)  I thought you said you threw that  into the river?  JULIAN  I didn’t.  ABEL  I see that.  JULIAN  I have nowhere to go.  ABEL  Nowhere easy.  JULIAN  Fuck you. I have nothing. And  somehow you’ve ended up with  everything you wanted.  ABEL looks at the gun in his hand.  ABEL  It wasn’t meant to be.  JULIAN  What is that supposed to mean?  126",
      "characters": [],
      "action_text": "ABEL  I know what you wanted. But you  need to forget that. You are  looking backward. Only look  forward, that is what you can  control.  JULIAN  I’m sorry. You gave me a very good  chance. Right?  ABEL  Yes.  JULIAN  Probably a better chance than I  deserved.  ABEL  No.  JULIAN  Please take care of my family.  ABEL  Julian.  JULIAN  Please...  ABEL looks at him trying to read where this poor kid is at.  ABEL  I will.  With that JULIAN takes the gun and puts it in his mouth and  pulls the trigger.  The gun goes off and the red blood sprays on the white side  of the fuel tank that is behind him.  ABEL and the rest are left totally in shock. They are beside  themselves. But out of the corner of his eye ABEL notices  that the bullet has also pierced through the tank and amid  the red spray a flow of black heating oil is pouring out  through the bullet hole onto the ground.  ABEL steps around JULIAN’S body and goes over to the hole. He  picks up an old rag from the ground and stuffs it into the  hole plugging the flow of oil.  ANDREW WALSH  What... what should we do?  127 ABEL turns and looks back at him.  ABEL  We call the police.  ANDREW WALSH  Really?  ABEL  Yes!  With that he walks off behind the tanks.  EXT. PARKING LOT, NEXT TO THE TANK FARM SITE - DAY  There are now POLICE VEHICLES everywhere. ABEL is standing  off alone. The DA gets out of a car all alone and walks over  to ABEL.  A.D.A. LAWRENCE  I’m very sorry. Did you know him  well?  ABEL  I did.  A.D.A. LAWRENCE  He must have been under a hell of a  lot of pressure.  ABEL  Yeah. For a while I thought he  was... it’s just...  A.D.A. LAWRENCE  I’m sorry.  They look out across the city.  ABEL  You really do have to be lucky.  A.D.A. LAWRENCE  Yes... so you are chasing down  hijackers now?  ABEL  I was right there... I couldn’t  help myself.  LAWRENCE nods approval.  128 ABEL (CONT’D)  Have you found the driver?  A.D.A. LAWRENCE  No.  ABEL  You’ll find him.  A.D.A. LAWRENCE  Probably not.  ABEL  Well, thank yo",
      "dialogue_count": 0,
      "word_count": 882
    }
  ]
}