{
  "slug": "a-simple-favor-2018",
  "title": "a simple favor",
  "genre": "drama",
  "format": "film",
  "scenes_count": 10,
  "characters_count": 0,
  "characters": [],
  "total_words": 32220,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. EMILY’S HOUSE - DAY 7   7 Stephanie’s VOLVO pulls in behind Emily’s vintage BMW. Stephanie gets out into the lingering drizzle and marvels at the house: a MODERN DREAM of glass, steel and poured concrete plunked in the midst of suburban Connecticut.  INT. EMILY’S HOUSE - DAY 8   8 Miles and Nicky tear upstairs. Stephanie slips off her wet moccasins, revealing KITTY-CAT SOCKS. EMILY Cute socks. STEPHANIE Oh, yeah.   Target . A pack is only ten dollars. They must lose money on them. They have other animals, too. Chipmunks, squirrels ... Stephanie sees a PAINTING OF NUDE EMILY. Her eyes go wide. STEPHANIE (CONT’D) ... beavers. The painting hanging in the foyer depicts Emily at age 18, with red hair, staring at her own reflection with a hard expression. Stephanie tries to play it cool. STEPHANIE (CONT’D) Wow, that is so ...   lifelike . EMILY Used to dye my hair. I get bored easily. STEPHANIE It’s terrific. Who painted it? EMILY An almost-famous painter from the East Village. My life is littered with Almost- Somebodies. I did some art modeling to pay my way through school. But the weirdo got obsessed with me. Like restraining order obsessed. Anyway, I stole the painting, hoping it’d be worth something someday. No such luck. Stephanie is still reeling from the story as Emily slips off her heels and heads into a dream LIVING ROOM, decorated with a bold, eclectic mix of modern and vintage. Emily switches on Sonos, which plays the 1960s French pop song “COMMENT TE DIRE ADIEU” by Francoise Hardy. Stephanie is in awe. STEPHANIE What an incredible house. EMILY It’s a fucking money pit. STEPHANIE Oopsy.  7.",
      "characters": [],
      "action_text": "EMILY The fuck? STEPHANIE Oh, I’m sorry. It’s what we say when someone swears. Force of habit. (off Emily’s look) We have an “oopsy” jar in the pantry. A quarter for every bad word. EMILY You should smash the oopsy jar. It might change your whole life. STEPHANIE I’m sorry. EMILY And stop saying you’re sorry. It’s a fucked-up female habit. Don’t be sorry for anything. Ever. STEPHANIE You’re right. Thank you. That’s great advice. I love your music, by the way. EMILY It’s old French pop from the 60s. Makes me forget I’m stuck in this shithole town. I’ll make the drinks. Emily heads toward the kitchen. Stephanie looks to make sure Emily is out of sight, then starts doing a little dance around the living room to the music as she looks at everything. She’s never been anywhere so “classy.” EMILY (CONT’D) (coming back in) You like olives or -- what are you doing? STEPHANIE Oh! Um. Just got caught up in the moment. EMILY (shakes her head, amused) Jesus Christ. Come with me, Audrey Hepburn, before you hurt yourself. An embarrassed Stephanie follows Emily into the kitchen.  INT. EMILY’S HOUSE - KITCHEN - CONTINUOUS 9   9 Sea green glass tiles, slate counter tops and hand blown glass fixtures. A kitchen out of Architect’s Digest. STEPHANIE Wow, you must really love to cook. EMILY No. Sometimes Sean does, but I think it’s just an excuse to avoid writing. STEPHANIE Your husband? He’s a writer?  8. Emily begins to mix a MARTINI at the built-in WET BAR. EMILY  Was . Now he’s a bitter English professor at Connecticut College. He wrote a book ten years ago that made him the toast of New York. It opened every door in the city. It was non-stop, the dinners, the parties. All of Manhattan was like one long line of cocaine. Stephanie forces a demure smile. EMILY (CONT’D) I had to stalk him and force him to fall in love with me. Then ... nothing. One big   anti-climax.   He never finished another book. The old bait-and-switch. STEPHANIE But he loves you. What was the book? EMILY It was cal",
      "dialogue_count": 0,
      "word_count": 5159
    },
    {
      "scene_number": 2,
      "slugline": "INT. STEPHANIE’S HOUSE - MILES’ BEDROOM - NIGHT 30   30 As Stephanie climbs up to say good night to Miles on the TOP BUNK, her head gets trapped in a HANGING SOLAR SYSTEM MOBILE affixed to the ceiling. She tries to   blow   away a Styrofoam Saturn, finally clearing planets like a cloud of gnats. STEPHANIE G’night, Smooch. MILES Good night, Mama. (looking up) And good night, Daddy. Good night, Uncle Chris. NICKY Who’s Uncle   Chris ? STEPHANIE Chris was my brother. He’s in heaven now. NICKY There’s no such thing as heaven. STEPHANIE Is that what your mommy and daddy tell you? NICKY My Dad says life’s just a brief moment of pain before an eternity of darkness. STEPHANIE Well, he’s an English professor. NICKY And he says when we die we turn into a feast for bacteria. STEPHANIE Well, at least   someone   is eating dinner then. She checks Miles, hoping this didn’t sink in. STEPHANIE (CONT’D) Do you want a kiss good night, Nicky? NICKY I want to go home. My Mom didn’t say I was sleeping over. STEPHANIE She should be here any minute and then she’ll come wake you up. Stephanie pecks Nicky on the cheek anyway. He rubs his face with disgust as she walks out and closes the door.  INT. STEPHANIE’S HOUSE - KITCHEN - NIGHT 31   31 Stephanie makes two kids’ lunches for the next day in silence.  25.",
      "characters": [],
      "action_text": "She mashes avocados and nori on whole grain bread, then cuts the sandwiches in half. She texts Emily: “ Made lunch for Nicky. Text me to say you’re ok. Worried about u.”  She hits SEND. Waits a beat. No response. She finds a bottle of WHITE ZINFANDEL in the back of the fridge, half empty. She unscrews the screw cap and sniffs it. Still good? Maybe. She pours herself a glass. She steals a cookie from under Saran Wrap. She nibbles a tiny bit of it, washing it down with wine. She slips the cookie back, looking guilty. Looks at her phone. Nothing from Emily. CUT TO: 3 a.m. Stephanie dumps the empty wine bottle into the recycling bin. The cookies have been devoured. She washes the dish in the sink, disgusted with herself.  EXT. WARFIELD ELEMENTARY SCHOOL - DAY 32   32 PUSH IN ON the PARKED VOLVO as Stephanie tries to get a hold of Emily at work. She speaks slowly and with a forced calm. STEPHANIE (ON PHONE) Stephanie. Smothers. I’m a close friend. I’ve been watching her son. Do you know where she went or when she’ll be back?  INT. DENNIS NYLON INC - INTERCUTTING 33   33 In a sleek Manhattan office in a Midtown skyscraper, Emily’s assistant VALERIE (25) -- a Goth, emo girl -- is on her headset, multi-tasking as she types. VALERIE She - is - hold on ... (typing) Yeah, she’s in Miami for a few days, did you want to leave a message? STEPHANIE A few days? She didn’t tell me - The other line rings. VALERIE Can you please hold for a second? STEPHANIE The thing is, I haven’t heard a peep and Nicky wants to know - Valerie puts her on hold, activating 80s SYNTH MUSIC. STEPHANIE (CONT’D) Oh, for the love of Job. As she endures the hold music, we hear: STEPHANIE (PRE-LAP) (CONT’D) Hi, Moms. Stephanie here, and the truth is, I’m not quite myself today.  26. ON VIDEO VLOG - STEPHANIE’S KITCHEN - DAY 34   34 Stephanie addresses the camera, her voice shaky. STEPHANIE My friend, the one that inspired the double-weave   chevron   friendship bracelet ... well, she’s been gone a few days an",
      "dialogue_count": 0,
      "word_count": 2596
    },
    {
      "scene_number": 3,
      "slugline": "INT. STEPHANIE’S HOUSE - KITCHEN - DAY 44   44 Stephanie enters in her robe. Miles and Nicky are at the table drinking GREEN SMOOTHIES, Sean helming the blender with a mix of CHIA SEEDS, YOGURT, KALE, SPINACH, BANANAS, HONEY. SEAN Who wants more B vitamins? MILES I do! SEAN And I’m sure   mum   does. STEPHANIE What on earth are you making? SEAN A hangover smoothie. It’ll knock it right out of you. The kids love it. Stephanie turns to the kids, amazed they’re drinking it. SEAN (CONT’D) (whispering; with a wink) It’s a full serving of vegetables and they don’t even know it. She’s shocked to hear him say something she always does. SEAN (CONT’D) Hope this is okay. Don’t mean to mess up your routine. Her eyes are fixed on him now - with real desire. SEAN (CONT’D) Do you want some? STEPHANIE  Yes, please.  Stephanie takes the smoothie from his hand, slowly. She drinks it with her eyes locked on Sean. They have a long moment in the kitchen. The toaster dings, breaking the spell. Then they remember why they’re here. STEPHANIE (CONT’D) All right, kids. Party’s over. Let’s get ready for school.  ON VIDEO VLOG - STEPHANIE’S KITCHEN - DAY 45   45 Stephanie addresses the camera, looking a little worse for wear. She looks at the PAGE STATISTICS and sees HER LIVE TRAFFIC STATS. A graph shows viewership rising ... STEPHANIE Hi, Moms. Stephanie here. Before we get to today’s topic - VEGETABLE SMOOTHIES - I want to welcome all of the new viewers: thank you for joining us. (MORE)  35.",
      "characters": [],
      "action_text": "And I especially want to thank so many of you who have written to ask about Emily. Now, she is   very   sensitive about her privacy but these are extenuating circumstances. So, I’m using her real name and posting a few rare pictures in case any of you have seen her. It’s been six days. The good news is her husband Sean is back from London and working closely with the police. (a sigh) Now, a lot of you Moms are stuck on this idea that the husband is always the primary suspect. But I’m here to tell you: Sean was out of the country when Emily disappeared. Some of you have suggested he just wanted an alibi, but I can assure you, Sean is an amazing husband and father. He’s been a wreck ever since he got home. And the police are no help. I don’t know what our tax dollars are paying for!  INT. STEPHANIE’S HOUSE - MASTER BEDROOM - DAY 46   46 Stephanie is on her hands and knees digging in her closet. STEPHANIE (V.O.) Well, as every mom knows, if you want something done right, you better do it yourself. She finally finds a VINTAGE CHANEL SCARF in a gift box.  INT. STEPHANIE’S VOLVO (MOVING) - DAY 47   47 Stephanie wears the Chanel scarf, nattily knotted on the side. Trying to look chic, in dark lipstick, eyeliner and her hair pulled back in a low ponytail. She drives. STEPHANIE (V.O.) I will leave no stone unturned.  I/E. STEPHANIE’S VOLVO (MOVING) - G.W. BRIDGE - DAY 48   48 Stephanie drives into Manhattan playing Adele’s “HELLO.” STEPHANIE (V.O.) I think that’s what Emily would want. She joins in singing the chorus of “HELLO” at top volume. STEPHANIE “Hello from the outside / I must have called a thousand times / To tell you I’m sorry for breaking your heart ...”  INT. MIDTOWN MANHATTAN OFFICE BUILDING - ELEVATOR - DAY 49   49 It’s that awkward polite silence in a crowded elevator. As Stephanie rides, she eyes the faces around her. Skinny PROFESSIONAL WOMEN in sleek suits and stiletto heels. PROFESSIONAL MEN in suits with slick-backed hair. STEPHANIE (CONT'D)  36. Stephani",
      "dialogue_count": 0,
      "word_count": 4019
    },
    {
      "scene_number": 4,
      "slugline": "EXT. WITCH LAKE (MICHIGAN) - DAY 67   67 A TOW TRUCK tows a mud-splashed WHITE KIA down the dirt road. STEPHANIE (V.O.) Those of you who’ve been following the last few weeks, you know that my best friend went missing.  EXT. LAKESIDE - MICHIGAN WOODS - DAY 68   68 A CSI PHOTOGRAPHER takes a shot of FOOTPRINTS on a dirt path. STEPHANIE (V.O.) So many of you wrote to me with your tips or hunches.  INT. WITCH LAKE - CRAMPED SPACE - DAY 69   69 CRIME SCENE INVESTIGATORS tag and bag various personal items strewn about a cabin lined with rusty bunk beds. STEPHANIE (V.O.) Special thanks to Leanne Lippens, whose helpful tip led to a major break in the case. A GLOVED CSI HAND empties Emily’s handbag of its contents: CELL PHONE. LIP GLOSS. SUNGLASSES. LEGO MAN HOLDING A SWORD.  EXT. MICHIGAN LAKE FRONT - DAY 70   70 LOCAL POLICE OFFICERS loll around at the bank, casually chatting or on cell phones as an exhausted Sean stands at the water’s edge, arms folded, his face as pale as he watches the lake. STEPHANIE (V.O.) I have somber news ... DIVERS in tanks and goggles drag the bottom. Faint bubbles pepper the surface in spots. One of the divers surfaces and waves his hand, pointing below. He found something. STEPHANIE (V.O.) Emily was found. Sean’s face falls as the truth hits him hard. The Diver resurfaces with a BODY under his arm. The pale corpse of a woman, her loose hair hiding her face like seaweed. He swims toward the shore, tugging her along. STEPHANIE (V.O.) Not alive, I’m afraid. The police move in to meet him and take the body onto the land. Emily’s face is bloated, her eyes wide open, her lips parted as if taking her last breath. STEPHANIE (V.O.) My friend, my best friend ... is dead.  48.",
      "characters": [],
      "action_text": "Sean reaches for her lifeless hand with the barbed wire tattoo. And his mother’s sapphire and diamond WEDDING RING. Sean breaks down sobbing.  INT. MORTUARY - DAY 71   71 Sean is a wreck as he speaks to the MORTICIAN. Stephanie hangs back a few feet, supportive. MORTICIAN An open casket helps give the loved ones a sense of closure. SEAN I ... God - I have to think for a second. Sean heads out of the mortuary, leaving Stephanie alone with the MORTICIAN. They stand together in silence. MORTICIAN Let him know we have the best embalmer. Usually with drowning victims, the skin is too fragile for an open casket. But not us. We can give her a glow. STEPHANIE (uncomfortable) She was very private. And very particular about how she looked. MORTICIAN Oh, we only use the best brands of make- up. And fillers. You’ll never even know about her missing tooth. STEPHANIE Missing tooth? MORTICIAN Yes, the right front one. STEPHANIE (baffled) Did she lose it when she died? MORTICIAN Had to be an old injury. The bone was growing over it. But we’ll cover it. Think of us as life’s final   fashion runway.  EXT. WARFIELD CEMETERY - DAY 72   72 EMILY’S CASKET is lowered into a grave as a PRIEST delivers a sermon. Darren, Sona, Stacy, other parents, Dennis Nylon, Emily’s co-workers, they’re all there. Sean and Stephanie stand a safe distance apart. Nicky wears a navy blue suit and a numb countenance as the pulley ropes are removed and the casket settles in. Stephanie glances at Sean, whose eyes are red. Puts her hand on his arm. We see Dennis Nylon staring at Stephanie intently, thinking. Stephanie looks over at him and he looks back at the priest before Stephanie sees he was watching.  49.",
      "dialogue_count": 0,
      "word_count": 612
    },
    {
      "scene_number": 5,
      "slugline": "INT. EMILY’S HOUSE - DAY 73   73 Emily’s funeral reception. People mill around. Stephanie sets food out on the buffet table. Darren sets his homemade brownies out on a crystal platter next to her. He and Stephanie trade a look and a sad smile. STEPHANIE Are those ...? DARREN They are. From your “Last Minute Brownies” entry. STEPHANIE I can’t believe you watch my vlog. DARREN Well, to be honest, I was making fun of you at first. But then there were some helpful tips in there - especially when Lulu had that rash.   Apple Cider Vinegar.  Who knew? Stephanie gives him a sad smile as Sona walks up. DARREN (CONT’D) You’re a saint to help out her family. STEPHANIE I’m not a saint. Emily was my friend. She’d do the same thing for me. SONA If you or Sean ever need me to watch Miles or Nicky any time, it’s nothing. STEPHANIE Thanks, Sona.  EXT. EMILY’S HOUSE - BACKYARD - DAY 74   74 Nicky rips branches off a tree one by one. Angry and frustrated, he needs a release. Miles approaches Nicky from behind, also in his suit. MILES Nicky. You don’t need to worry. Your Mom’s in heaven. With my Dad and Uncle Chris. NICKY No, she’s not. She’s in the ground. She’s never coming back. MILES She’s in heaven now -   NICKY (CONT'D) Shut up! Nicky flies at Miles and shoves him to the ground. MILES OWWWW! Stop!!!  50.",
      "characters": [],
      "action_text": "Nicky straddles Miles and smacks him across the face, open- palmed, left then right then left then right until Miles’ nose starts gushing blood.  INT. KITCHEN - DAY 75   75 Stephanie notices the scuffle out the window and races --  OUT TO THE BACKYARD  SEAN (racing over) What the hell are you doing!? Sean yanks Nicky off Miles and holds him back. SEAN (CONT’D) Calm down. Stephanie moves to Miles and helps him up off the ground, kneeling to look at his nose. Nicky points at Stephanie. NICKY She made this happen. She made my mom die! Stephanie feels dizzy. She glances around and notices Darren watching all this from the kitchen window. SEAN Oh, Jesus, Nicky - that’s crazy. NICKY She’s trying to be my   new   mom. STEPHANIE I’m not trying to be your new mom, sweetie. NICKY You’re trying to be   everybody’s   Mom. But you’re not mine! SEAN Nicky,   stop . I know you’re upset, but - NICKY (CONT'D) I want my mom! SEAN I know you do, but you need to calm down. Sean struggles to hold onto Nicky who kicks wildly. NICKY Mom was right. You’re a loser! Sean hurls Nicky on the ground, snapping. Stephanie gasps. SEAN Is that what your mother said? Is that when she was drunk at two in the afternoon? I’m doing the best I can! STEPHANIE Sean, shhh. He’s a little boy.  51. All at once, Sean realizes what he’s done. SEAN Oh my God, what am I doing? What have I done? Nicky ... Jesus. Nicky hurls himself on the ground and hides his face with his hands. Sean touches his arm. Nicky swats him away. NICKY Get away from me! Sean looks up at Stephanie, completely lost. Some of the guests watch from a distance. SEAN What do I do? STEPHANIE Let’s everybody take a deep centering breath. We’re going to do one thing at a time. Let me talk to Nicky; and Sean, you get some ice for Miles’ nose. He’s got a good little shiner coming. Sean puts his hand on Miles’ shoulder, walking him inside. Stephanie sits down on the grass next to Nicky. NICKY I don’t want to talk to you. STEPHANIE Well, you’re not my",
      "dialogue_count": 0,
      "word_count": 3911
    },
    {
      "scene_number": 6,
      "slugline": "EXT. EMILY’S HOUSE - LIVING ROOM - DUSK 98   98 For just a brief moment, we WATCH STEPHANIE from   outside   the glass house, from a distant, anonymous POV. Stephanie seems to sense someone behind the glass. She turns off the lights.  INT. EMILY’S HOUSE - MASTER BEDROOM - DUSK 99   99 Stephanie heads into the room. She pauses at the window for a moment. Sean comes up behind her and pulls her close. SEAN Let’s get naked. STEPHANIE Sean, wait. We need to have a talk about Nicky’s laundry. SEAN About his   laundry?   Can we please hit pause on the “Captain Mom” thing? STEPHANIE The   Captain Mom   thing? SEAN (sighs; knows he fucked up) That’s just what Emily used to call you. She was masking her own guilt. Because you’re such a saint. STEPHANIE I’m NOT a saint. And   she   knew that. If anybody knew it, it was   her!  Sean is confused by her demeanor. STEPHANIE (CONT’D) I smell her, Sean. I smell her on Nicky. Her perfume ... it’s like a ghost all over him, all over his corduroys. SEAN He probably got into the bottle in the medicine cabinet. He misses her. You’re getting paranoid. STEPHANIE Am I? Because I also found   this . She holds out the CHEVRON FRIENDSHIP BRACELET. SEAN What is that? STEPHANIE A friendship bracelet I made for Emily. SEAN I hate to say it but she wouldn’t have kept that. She hated that stuff. I’m sure she gave it to him right after you gave it to her.  64.",
      "characters": [],
      "action_text": "STEPHANIE (deflating) Nicky and I were getting so close, but ... now the way he’s talking, Sean, doesn’t it worry you? Wouldn’t you think we should get him a psychologist? They can do a lot with play therapy: they have these plastic figures in a sandbox. I mean, he’ll smash all of them, but - SEAN Let’s let it rest for tonight. STEPHANIE Or maybe he’s telling the truth. SEAN Stephanie, you saw her with your   own  eyes. In her   coffin . STEPHANIE There was something ... off. SEAN She was dead. They found her at the bottom of a lake. You saw her crazy tattoo - and the ring she stole from my mother. STEPHANIE She said your mother wanted her to have that ring. She said she   insisted . Sean sits on the bed. He laughs darkly and shakes his head. SEAN God. Is that what she told you? That was the ring my father gave my mother. It’s the only piece of jewelry she ever owned. My whole life, I never saw her take it off. I took Emily to England to meet my mum after we eloped. That weekend, the ring went missing. My mother was frantic. We looked everywhere. I went down to the basement to tear apart the plumbing. We never found it. My mother was devastated. So, we flew back to New York ...  INT. TRANSATLANTIC FLIGHT (MOVING) - DAY (FLASHBACK) 100   100 Emily and Sean sit side by side on the plane ride home from England. They’re six years younger, radiant in love. EMILY Guess what I found? Emily reaches in her purse and pulls out the SAPPHIRE AND DIAMOND RING, showing it to him. SEAN Oh, thank god. Well done, my little Sherlock! Mum will be so relieved.  65. EMILY Oh, Mum’s not getting this. She’ll take it to the grave. What a waste. SEAN Excuse me. Not amusing, my darling. EMILY Not joking, my darling. I took it and I have no intention of giving it back. SEAN Of course you’ll give it back. I’ll tell Mum it dropped in your purse by accident, that you didn’t find it until now. EMILY If you tell your mother that I found it, I’ll tell her I stole it. What do you think will be worse",
      "dialogue_count": 0,
      "word_count": 1452
    },
    {
      "scene_number": 7,
      "slugline": "INT. STEPHANIE’S HOUSE - DAY 105   105 AS THE SONG CONTINUES, Stephanie takes down all personal affects: Miles’ art work and their family pictures as she continues to rap in Spanish: STEPHANIE Niñas con deporte lo hacen con elegancia / Yo, tengo presencia ...  EXT. EMILY’S HOUSE - DAY 106   106 AS THE SONG CONTINUES, Stephanie carries boxes of stuff from a U-Haul truck to the front door. She’s moving in with Sean.  INT. EMILY’S HOUSE - MASTER BEDROOM - DAY 107   107 AS THE SONG CONTINUES, Stephanie continues to rap as she unzips her dress down to her bra and underwear. She goes to the closet to hang it back up, so happy. STEPHANIE Disfruta quitale importancia / No te quejes tanto, tos tuvimos infancia -- When she slides open the door, her rap stops WITH A GASP: ALL OF EMILY’S CLOTHES ARE BACK IN THE CLOSET, HANGING EXACTLY AS THEY WERE BEFORE STEPHANIE REMOVED THEM. STEPHANIE (PRE-LAP) (CONT’D) Hi, Moms. Stephanie here. I want to start with something a bit different today.  ON VIDEO VLOG - KITCHEN 108   108 Stephanie addresses the camera at night. STEPHANIE I try to avoid any talk of religion on this vlog, because I don’t want to offend our non-denominational moms. But I do believe we live on after we die. In some fashion. So Emily ... if you’re out there ... and you can hear me, I wanted to tell you a few things. We all miss you more than I can say. Nicky knows that you’ll always be his mom. No one will ever replace you. But he no longer cries at night, like he used to. I know you wouldn’t want that. And I want you to know that I am preparing the most nutritious food for him. I can never take your place. All I can do is love the people you used to love and try to make their lives better. Which is what I know you would want. Rest in peace, my dear best friend. Wherever you are.  INT. STEPHANIE’S VOLVO (MOVING) - DAY 109   109 Stephanie drives Miles and Nicky home from school. They each have a superhero figurine and crash them against each other. Stephanie glances in the rear view getting stressed out.  69.",
      "characters": [],
      "action_text": "STEPHANIE It’s getting a little too rough back there, guys. NICKY Ha! I just killed you! MILES I came back to life! Like your Mom! STEPHANIE Okay! The dolls go in your backpacks or they’re going in the trash! Now! MILES  Mom! They’re not dolls!  Nicky makes a face at Miles. He shoves his figure in his backpack and remembers something, retrieving A SMALL SQUARE BROWN ENVELOPE WITH THE NAME STEPHANIE WRITTEN NEATLY ON IT. NICKY Oh. My mom told me to give you this. Stephanie looks in the rearview mirror at him, chilled, as he holds out the envelop to her. She nearly drives through a RED LIGHT and slams on the brake, the car spinning 180 as other cars screech to a stop to avoid her. Both kids fly hard against their car seat restraints. They sit in silence, then - NICKY (CONT’D) That was awesome. OFF STEPHANIE, heaving for breath --  INT. EMILY’S HOUSE - DAY 110   110 The boys race upstairs. Stephanie listens to make sure they’re in their room, then she rushes into the kitchen.  INT. EMILY’S HOUSE - KITCHEN - DAY 111   111 Stephanie tears open the envelope. She pulls out a photo: A SMILING STEPHANIE HOLDS MILES, AGE 2, IN HER ARMS. NEXT TO HER IS HER HUSBAND DAVIS AND NEXT TO HIM IS HER BROTHER CHRIS. A grease pencil has been used to circle Miles and Chris with an ARROW connecting them. Under Stephanie, is an ARROW and the words “BROTHER FUCKER.” Stephanie’s heart pounds. The phone RINGS. Stephanie jumps out of her skin. She stiffens and reaches for the phone. The CALLER ID says UNKNOWN. As she answers ... EMILY (O.S.) You like the photo? You should be more careful what you leave behind when you try to sell a little gingerbread house. STEPHANIE Who is this?  70. EMILY (O.S.) I’m just calling to say   Thank you   for all that “nutritious food for Nicky,” you Martha Steward wannabe. Oh, you’re just squeaky clean, aren’t you? You’re not fooling me. You fucked your brother, Stephanie. I bet Miles isn’t even your husband’s kid. I thought I was warped, but you have me beat by ",
      "dialogue_count": 0,
      "word_count": 3290
    },
    {
      "scene_number": 8,
      "slugline": "INT. MICHIGAN MOTEL - STEPHANIE’S ROOM - NIGHT 127   127 Stephanie sits on the bed in a dingy room, making a call from the land line. A commercial for LITTLE DEBBIE CHOCOLATE CUPCAKES plays on the TV. Stephanie stares at it, then ... STEPHANIE Oh, hi there, my name is - Deborah. Little Deborah. Panicking, she glances quick at a cheesy painting of rolling hills. Lying like this is new to her and she’s lousy at it. STEPHANIE (CONT’D) I mean, Hills. Deborah Hills. My friends call me Little. Off-topic, sorry. So ... I’m looking for a summer camp for my son who is refusing his Bible study like Lima beans. I hate to be pushy but I travel a lot and I won’t be back in town for a while. Could I tour your facility tomorrow morning?  EXT. SQUAW LAKE BIBLE CAMP - ESTABLISHING - DAY 128   128 Stephanie’s car drives through the front gates of a rundown campground. A sign reads “SQUAW LAKE BIBLE CAMP” with a big crucifix on it. The place is the definition of creepy.  EXT. SQUAW LAKE BIBLE CAMP - DAY 129   129 The owners of the camp, MARYANNE and BOBBY CHELKOWSKY, both 40s, upbeat and out of shape in their Squaw Lake Bible Camp attire, stroll alongside Stephanie through the campground toward the lake where Emily’s body was found. MARYANNE We’ve been saving young souls going on fifty years now. Not Bobby and me personally, the camp. But we’ve still been here a while and we’d be happy to help your son see the light too. STEPHANIE Well, it just seems perfect. (looking at the lake) My son is practically a   porpoise . He’s going to love swimming in this pond. MARYANNE That’s Abel   Lake. It’s where we have our canoeing competition and our baptisms. The kids all joke that it’s holy water. BOBBY (his favorite joke) Any fish you pull out of there is guaranteed to feed a multitude. STEPHANIE Ha ha, that’s a good one. So funny. (then) Is it safe, though? Didn’t I read somewhere that someone just drown in it?  80.",
      "characters": [],
      "action_text": "Bobby and Maryanne exchange a worried look. Try to recover. MARYANNE Oh, that had nothing to do with the camp. We were closed at the time. Just some poor soul who wandered in here and found her salvation in the lake. But don’t worry. We watch our kids like a hawk. BOBBY Yeah, we’re so on top of them, they can barely have any fun. Maryanne gives him a “shut up, you idiot” look. STEPHANIE Well, that’s great news. Hey, do you have any old photo albums or yearbooks I can look at? I think there’s no better review of a camp than the faces of the campers. BOBBY Oh, heck yeah. Got a ton of them down in the basement. You’ll see nothing but smiles in all of ‘em. I guarantee it.  INT. MAIN OFFICE - BASEMENT - DAY 130   130 An overhead bare bulb illuminates the musty basement. Cobwebs and dust coat everything. Stephanie sifts through a box of old books. She pulls out a stack of “SQUAW LAKE BIBLE CAMP YEARBOOKS,” scanning to SUMMER 2000. Stephanie flips through book after book. Not quite sure what she’s looking for, studying the young faces. Finally a SINGLE IMAGE grabs her: TWO IDENTICAL TWIN GIRLS (AGE 9), their arms around each other. They’re lean, fair, blue-eyed. There’s a vague resemblance to Emily. Could it be? Suddenly the names grab Stephanie: HOPE AND FAITH MCLENNAN. STEPHANIE Hope and ... Faith? Stephanie pulls out the UNFLATTERING FAXED PICTURE: “GOTTA HAVE FAITH.” STEPHANIE TAKES OUT HER PHONE AND SNAPS A PICTURE OF THE TWINS. She starts rifling through the pages, seeing and SNAPPING PHONE PICS of a SERIES OF AWARDS PAGES: The MCLENNAN SISTERS won nearly every ribbon: FASTEST CANOEING DUO, BEST SWIMMERS, HOT DOG EATING CHAMPIONS, THREE- LEGGED RACE WINNERS ... the list is an endless procession of grim summer accolades. Stephanie SNAPS A PIC. Must be Emily. BOBBY (O.S.) Take a picture, it’ll last longer. Oh, you already are. She startles and looks up the creepy staircase at Bobby. He smiles at his joke but suddenly seems more menacing as he blocks the only way out of",
      "dialogue_count": 0,
      "word_count": 6445
    },
    {
      "scene_number": 9,
      "slugline": "EXT. WITCH LAKE - WOODS - LATE AFTERNOON 165   165 Emily makes her way through the woods to follow Faith, whose bare flesh flashes through the trees.  EXT. WITCH LAKE - LAKE FRONT - LATE AFTERNOON 166   166 Faith wades into the water then submerges under its icy surface. Emily peels off her dress down to her bra and underwear. She wades into the water with a gasp, her jaw clenched against the cold. Faith surfaces and treads water. FAITH C’mon, wimp! I thought you were the Alpha! EMILY (muttering) I   am   the Alpha, goddammit. Emily dives into the water, then swims out to where Faith is. They tread water, face to face in the moonlight. Faith’s expression shifts. She’s childlike, vulnerable. FAITH How could you leave me like that? We were supposed to be a team. You and me. Forever. EMILY I know. I’m sorry. We were. Emily takes her sister’s shoulders to hug her ... EMILY (CONT’D) It’s just ... things have changed. She shoves Faith under the water. Faith struggles and splashes to the surface, but Emily shoves her down again. The struggle persists. Emily is athletic and strong. Her will to murder is stronger than Faith’s will to live. Finally the struggle stops. Faith goes limp and floats. Emily holds her sister in her arms. A tender moment. Emily glances at her own hand, the sapphire and diamond engagement RING. She pulls the ring off her finger and wrestles it onto Faith’s lifeless finger, forcing it on.  EXT. WARFIELD CEMETERY - DAY 167   167 A few real tears roll down Emily’s cheeks. EMILY I woke up the next morning and she wasn’t there. I couldn’t find her anywhere. Finally I remembered how much she loved swimming in the lake. So I went there. I was too late ... Now Stephanie   reads   Emily the same way Emily once read her.  102.",
      "characters": [],
      "action_text": "STEPHANIE You’re lying. You drowned her. You’re a sister killer. EMILY Well, you’re a brother fucker. STEPHANIE What does Sean know? EMILY Everything. Stephanie is stung by this. Emily sees her chance. EMILY (CONT’D) He told me to disappear until the money came through. Said we could finally get out of debt, sell the house, leave the country. Start over, that I could quit my job and spend more time with Nicky. STEPHANIE I don’t believe you. Sean grieved for you. EMILY All an act. STEPHANIE You’re a pathological liar. EMILY Did Sean say that? Emily takes out her cell phone, plays an AUDIO CLIP. EMILY (O.S.) (CONT’D) Do you love her? SEAN (O.S.) No. It was just sex. EMILY (O.S.) Did you think of me while you were fucking her? SEAN (O.S.) Yes. EMILY (O.S.) Do you love me or not, Sean? SEAN (O.S.) Of course, I love you. Stephanie means nothing to me. The CLIP stops. Stephanie looks sick to her stomach. EMILY Sorry, Steph. I know you thought it was real. But let’s look on the bright side. Your web site went viral thanks to me. Now you can sell those ad banners.  103. STEPHANIE All of this was for a little money. EMILY Yeah, a little four million. Sean convinced me we could pull it off. My sister didn’t exist anymore. DNA would take care of the rest. All I had to do was lay low for six months so he could collect the money, sell the house, tie up loose ends. STEPHANIE Was I a loose end? EMILY Sean needed some help looking after Nicky. And you’re so good with them. Darth Mommy. The entire tone has changed. It’s like a chess match and Emily seems to have regained an advantage. STEPHANIE You were supposed to lay low. Why did you come back at all? Emily glares back at her, offended now. EMILY Look, I may be a working mother ... but that doesn’t make me any less a   mom . (grimacing) Every time you vlogged about how much Nicky cried or how he hated quinoa, I couldn’t take it. It was like a hostage standoff. I had to see him again. To let him know that I was coming back. He’s my",
      "dialogue_count": 0,
      "word_count": 805
    },
    {
      "scene_number": 10,
      "slugline": "INT. EMILY’S HOUSE - MASTER BEDROOM - NIGHT 168   168 Stephanie lies in bed, back to Sean, snoring in a deep sleep. STEPHANIE Sleeping like a   log.  She slowly, gingerly slides her leg off the bed, toe finding the floor, her body slinking out behind it.  INT. EMILY’S HOUSE - KITCHEN - NIGHT 169   169 She logs onto the Connecticut College website. She types Sean’s email into user slot: stownsend@conncollege.com, then enters the password. Waits. She’s in.  EXT. EMILY’S HOUSE - NIGHT 170   170 Stephanie plants a DOCUMENT in the glove compartment of Sean’s car and closes it. She’s wearing Emily’s leather gloves. Stephanie quietly closes the door and clicks the lock on the key fob. She tiptoes into the house, closing the door.  INT. CONNECTICUT COLLEGE - ENGLISH DEPT. - DAY 171   171 Sean arrives at his office to find Beth, spooked. Two DETECTIVES are in his office unhooking computer cables. BETH They had a warrant. I tried to call you. Shocked, Sean enters his office toward the detectives. SEAN I’m Sean Townsend. I’m happy to comply with whatever you need, but it would be nice to have a heads up. DETECTIVE #1 This is an open investigation. You don’t get to pencil us in when it’s convenient. SEAN I’m calling a lawyer. DETECTIVE #2 I’m calling that a good idea.  EXT. EMILY’S HOUSE - DAY 172   172 Sean pulls up in his car to find his front door blocked with police tape and THREE SQUAD CARS. Detective Meany is there. SEAN What the fuck? Meany clocks Sean’s arrival and approaches as he gets out. SEAN (CONT’D) Am I under arrest? DETECTIVE MEANY We’re still working on it. The D.A. wants a slam dunk.  105.",
      "characters": [],
      "action_text": "SEAN Well, that may be hard, since I didn’t do anything. DETECTIVE MEANY Did you know your wife was alive? SEAN (after a beat) Not until recently. DETECTIVE MEANY  When?  Meany scrutinizes him carefully. SEAN She contacted me. DETECTIVE MEANY And you immediately notified the authorities, right? SEAN I can’t discuss this without my attorney. DETECTIVE MEANY I’d say that’s wise. We’ll talk soon. (turning back) Oh. If we need you ... will you be with your wife or the best friend? OFF SEAN, in a bad place --  EXT. STEPHANIE’S HOUSE - DAY 173   173 Sean pulls up to Stephanie’s house. Hearing his car, she opens the door. He grabs his briefcase and approaches her. SEAN I need a stiff drink. Maybe more of your dead husband’s scotch. She blocks the doorway with her body. STEPHANIE I can’t let you in. I’m sorry. SEAN Why not? Where’s Nicky? STEPHANIE Upstairs sleeping. You have to go. SEAN What are you talking about? STEPHANIE This is an ongoing investigation, Sean. I can’t let you into this house until this whole big hoo-ha is solved.  106. SEAN (studies her; then) My god, she got to you, didn’t she? She got into your head. STEPHANIE This has nothing to do with Emily. SEAN It has EVERYTHING to do with her! STEPHANIE Shhhh, the boys are sleeping -- SEAN She’s gaslighting you. You don’t understand how powerful she is. STEPHANIE I don’t understand anything right now. I just need to be alone and take care of the boys. Stay in a hotel tonight. Please. Don’t make me call the police. Sean looks at her, stunned. He backs away, shaking his head. Stephanie watches as Sean gets in his car and peels out of her driveway. She heaves a long slow sigh of relief.  INT. STEPHANIE’S HOUSE - KITCHEN - DAY 174   174 Stephanie bakes cookies. But there’s no joy in pinching the little dough clumps onto the greased pan. This is an act of survival. She sees her cell phone vibrating on the counter. We hear Sean on VOICEMAIL, forcibly calm and sincere. SEAN (V.O.) Stephanie? I don’t know what’s going o",
      "dialogue_count": 0,
      "word_count": 3931
    }
  ]
}