{
  "slug": "a-star-is-born-2018",
  "title": "a star is born",
  "genre": "drama",
  "format": "film",
  "scenes_count": 16,
  "characters_count": 6,
  "characters": [
    "ALLY",
    "RAMON",
    "JACK",
    "TOUR BUS",
    "EMERALD",
    "MALE DIRECTOR"
  ],
  "total_words": 24178,
  "total_dialogue": 12,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. SUV - TIGHT - JACK’S PROFILE - LATER Camera flashes zip by across his face... stadium lighting fading away in the reflection as he knocks back a BOTTLE OF GIN -- INT. BILTMORE HOTEL - BATHROOM - WIDE SHOT - DAY PAN ALONG the bottom of a number of stalls.   The bathroom seemingly empty... Until we hear a HUSHED VOICE and see two feet in heels in a stall down at the end. ALLY (O.S.) (into phone) Roger... You're a wonderful man, yes, and you're a great lawyer. We're just not meant to be together. ANOTHER ANGLE - INSIDE THE STALL ALLY CAMPANA, (early 30s) is on her cell phone. ALLY (into phone) No, I don’t wanna marry you -- are you crazy?!?   The hell's the matter with you?   Roger, we're done.   Oh, God. She hangs up, opens the door to the stall, and screams bloody murder. ALLY Fucking men! She pulls herself together. INT. BILTMORE - HALLWAY - CONTINUOUS ACTION She walks PAST various CATERING SERVERS AND STAFF with her best friend RAMON -- he’s an aspiring dancer with a sinewy body like a swimmer, flamboyant, wonderful. RAMON Did he cry? ALLY He cried.   He laughed.   He yelled at me.   You know, whatever.  2. (CONTINUED)",
      "characters": [
        "ALLY",
        "RAMON"
      ],
      "action_text": "RAMON You broke his heart, mama! ALLY I did the right thing.   It just wasn't right -- BRYAN (O.S.) Ally, garbage -- They turn to see BRYAN, their catering manager, walking up from behind. ALLY Bryan, can you get somebody else to do it for me? RAMON You have to let her shine! BRYAN (not messing around) It’s your fucking turn! ALLY (to Ramon) Okay, I’ll see you upstairs. He gives her a kiss and keeps moving.   Ally rolls her eyes and heads towards her manager... RAMON Come on, Bryan!   She’s performing tonight! ALLY Here we go.   Taking out the trash. Like your mouth. BRYAN I'll let you go early, but you gotta finish your job. ALLY Well, you gotta keep your mouth clean.   Okay? CUT TO: EXT. BILTMORE - TRASH AREA - NIGHT Ally tosses a bag of trash into the dumpster... She hums to herself, just audible over the LOUD TRASH COMPACTOR...  3. CONTINUED: (CONTINUED) JACK How’s your kid?   How old is he now? PHIL He is 17. JACK Fuck me. PHIL He got a scholarship to play baseball in college already, man. JACK Wow, that's great. PHIL I'm proud of him.   My little guy is not so little anymore. JACK (moving on) I don't wanna go home. PHIL Wish I could find you a spot. Sorry, Jack, I don't know this area. JACK Why don't you make a right here. INT. JACK’S SUV (MOVING) - LATER He looks out the window... He sees a BLUE NEON SIGN with some people standing out front... JACK Here we go.   That looks like a fucking bar. As Phil slows, Jack starts to get out -- JACK What's that say?   ‘Bleu Bleu.’ Here, let me just try this. Jack gets out and slams the door behind him.  5. CONTINUED: EXT./INT. “THE BLEU BLEU” - ENTRYWAY - NIGHT As Jack makes his way inside.   It’s dark, his eyes adjusting when... Ramon, the host, comes over to him -- RAMON Oh, shit!   Wait, wait.   My man... Aren't you that... Aren't you, like... JACK This is a bar, right? Ramon looks around. RAMON Yeah, but I don't know if this is your kind of place. JACK They got alcohol? RAMON (stammers) Well, yeah, but... JACK All ri",
      "dialogue_count": 2,
      "word_count": 2283
    },
    {
      "scene_number": 2,
      "slugline": "INT. “THE BLEU BLEU” - BAR AREA - LATER THAT NIGHT DRAG BAR EMCEE is closing out her receipts. DRAG BAR EMCEE (to Emerald) Bitch, can you get down off that stage and come help me close this bar, please? REVEAL Emerald on stage, taking her guitar from its stand. EMERALD Don't talk to me like that in that bus driver wig, girl. DRAG BAR EMCEE Oh, I know you did not.   What you have is street appointments tonight, sister. Jack is sitting there laughing. EMERALD Excuse me!   Mr. Jackson Maine, would you mind? JACK What do you want me to do? EMERALD Just come play a little song for me. JACK I don’t know. DRAG BAR EMCEE Can you leave the man alone, please? EMERALD I showed you mine, you show me yours.   Come on. DRAG BAR EMCEE He already signed your tits, honey.   Say, ‘No, sir.’ EMERALD You know you want to.   Show off for me a little bit. JACK I'll only do it because you already performed, so...  16. (CONTINUED)",
      "characters": [
        "JACK"
      ],
      "action_text": "EMERALD You're so nice.   Thank you. DRAG BAR EMCEE Lord, the man is here for Ally. Not for you, sister. JACK (re:   the guitar) Oh, this -- she's nice. EMERALD Isn't it cute?   Little arts and crafts. JACK Yeah, light.   Did you do this yourself? EMERALD Yeah, all me. JACK Does this mic -- (into microphone) -- work?   Oh, yeah.   Fuck, all right. (then to Emerald) What do you want me to play? EMERALD I don't care, just look at me while you do it. DRAG BAR EMCEE Oh, Lord!   Somebody kill me now. He begins to pluck the strings, something utterly different from that assault of “Black Eyes” -- JACK (singing)  ‘Maybe it's time to let the old ways die, Maybe it's time to let the old ways die, It takes a lot to change a man, Hell, it takes a lot to try, Maybe it's time to let the old ways die,  Ally emerges into the room to find Jack under house lights, in the flesh and blood, feet away in a private concert for three.  17. CONTINUED: (CONTINUED) JACK Can I ask you a personal question? ALLY Sure. JACK Do you write songs or anything? ALLY I don't sing my own songs. The bartender drops off another drink of Jack. JACK (to bartender) Thank you. (to Ally) Why? ALLY I just, I just don't feel comfortable. JACK Why wouldn't you feel comfortable? ALLY Um... Well, 'cause, like, almost every single person that I've come in contact with in the music industry has told me that my nose is too big and that I won't make it. JACK Your nose is too big? ALLY Yeah. JACK Your nose is beautiful. Jack looks at her, dumbfounded.   She turns her head profile, takes her finger and runs it down from her forehead, over her nose, down to her chin. JACK Are you showing me your nose right now? She embarrassingly smiles.  19. CONTINUED: (CONTINUED) ALLY Yeah. JACK You don't have to show it to me. I've been looking at it all night. ALLY Oh, come on. JACK Oh, I'm gonna be thinking about your nose for a very long time. ALLY No, you're not.   You're full of shit. JACK I'm not full of shit. ALLY Yeah, you are.",
      "dialogue_count": 1,
      "word_count": 1546
    },
    {
      "scene_number": 3,
      "slugline": "INT. SUPER A FOODS - NIGHT Fluorescent lighting... Jack walking up and down the aisles, looking for something -- Ally trying to keep up... ALLY I'm fine, honestly.   I'm okay. This is so stupid. JACK You gotta get ahead of the swelling.   Just try to find some... ALLY This is so embarrassing. Jack pulls a bag of frozen peas from the freezer and puts it on her hand. JACK Here we go.   Put that on there. Gotta wrap something up with it. Find a... Jack grabs a bag of Cheetos. ALLY You like Cheetos? JACK No, like, gauze.   Some gauze or something. ALLY Gauze? Jack stops to look at her hand to see if it’s starting to swell.   He holds it, looking at it with her... JACK (flexing his hand) Try to do that. She tries, but can’t really. JACK With that hand.   And do that hand. You play piano? (as she nods) Yeah, we gotta take care of this, then. He walks away.  25.",
      "characters": [
        "ALLY"
      ],
      "action_text": "INT. SUPER A FOODS - CHECK-OUT COUNTER - MOMENTS LATER The CASHIER is swiping their items. JACK It's already gotten warm, hasn't it?   Should we have gotten two? ALLY No, it's okay.   Thanks. CLICK. The Cashier is holding up her phone and just took a picture, Ally not quite in frame... FEMALE CASHIER I'm sorry.   I had to. JACK That's all right.   Have a good one. ALLY It's not really all right, but... And as they stumble out -- JACK Be careful, she'll hit ya. EXT. SUPER A FOODS - PARKING LOT - MOMENTS LATER Jack’s SUV parked, Phil, the driver eating the Cheetos off a ways, Jack and Ally sitting outside the store side- by-side on a parking block. JACK These rings are gonna get stuck if you don't take 'em off... Does that hurt? ALLY Yeah.   That's okay... JACK (holding her hand) May I? ALLY Yeah. Jack sucks on her finger, wetting it and slipping the rings off, places them in his pocket.  26. (CONTINUED) JACK Safe keeping. Jack reaches for the frozen peas. JACK Put this on there. ALLY You’re sweet. JACK Just wrap it up... You'll be good to go. He puts it on her hand and WRAPS IT with GAUZE and TAPE. ALLY How the hell do you deal with that all the time? JACK What's that? ALLY People just talking to you like you're not a real person.   Or taking your picture -- JACK Is that too tight? ALLY It's okay. He tears the wrap with his teeth -- JACK Did I hurt you? ALLY It’s fine, it's okay. He finishes wrapping the package of peas to her hand. JACK There you go, now you're mobile. Swing it around. They start to laugh.   It looks ridiculous. ALLY I look like a pirate.  27. CONTINUED: (CONTINUED) JACK I told you it was worth coming here. A beat... ALLY How do you do that? JACK Do what? ALLY Don't change the subject. JACK Is that what I'm doing? ALLY Nobody ever asked you about you, huh? JACK Not sure. ALLY Where you from? JACK Arizona. ALLY Arizona boy. JACK Dad had like a midlife crisis, I think, so I've been told.   Made his way to Arizona, started working for this family on a ",
      "dialogue_count": 1,
      "word_count": 2252
    },
    {
      "scene_number": 4,
      "slugline": "INT. ALLY’S HOUSE - DAY We hear opera as Ally runs down the stairs in a T-shirt and shorts. ALLY Who’s here? LORENZO I have no idea.   He won't tell me. ANOTHER ANGLE She opens the door to find Phil, the driver, waiting... PHIL Hi, Ally. ALLY Hi. PHIL I'm Phil.   We met last night. Lorenzo, over her shoulder... ALLY Yeah, I remember. PHIL Jack sent me to pick you up and take you to the gig. ALLY Oh, my God.   I gotta work.   I can't go. PHIL He’s really looking forward to this. She gently shuts the door saying... ALLY I appreciate that, but... PHIL I can't leave, so I'll be in my car right down the street. ALLY Uh, please tell him, ‘Thank you, but no thank you.’  39. (CONTINUED)",
      "characters": [],
      "action_text": "PHIL Well... ALLY Okay?   Say it just like that. She slams the door in his face and heads to the kitchen with Lorenzo in pursuit. LORENZO Wait a minute, Ally.   What are you doing? ALLY What the fuck is that shit?   This is crazy. LORENZO What are you doing?   This is great.   Look, a guy like that invites you to a show? ALLY Dad, don't start with me. LORENZO I mean, it could be a great opportunity. ALLY Don't start! LORENZO Listen, listen!   Does he know you sing at all?   Did he, did he hear anything from you? ALLY Dad, I gotta go to work. LORENZO This could be the opportunity of a lifetime. ALLY I don't have the same disease that you have, Dad.   You get around celebrities and it's like they're gonna rub off on you, you know? LORENZO What are you talking about?   What are you talking about?  40. CONTINUED: (CONTINUED) ALLY ‘Oh, you know who I drove the other day?’   Like magic, now you're famous.   And you're not. It's not magic, Dad. With that, she heads up the stairs. LORENZO Sweetheart.   I'm just -- ALLY He's a drunk!   You know all about drunks! And she disappears into her bedroom... Lorenzo's quiet. He starts back downstairs... LORENZO Sweetheart, he's still there. EXT. BILTMORE - RAMP - DAY Ramon and Ally are walking up stairs in their uniforms. RAMON Yo, so you fucking hit a cop? ALLY Yeah, he was being an asshole to Jack, so I fucking popped him in the face. RAMON Yo, that is so gangster. ALLY And so, then we ended up in a parking lot, and he put peas around my hand to fix it.   And then he was singing, and I was singing.   I don't know what the hell's going on.   But now he's got his driver following me around. RAMON Wait, he's been following you from your house all the way to work? ALLY Yes!   It's crazy!  41. CONTINUED:",
      "dialogue_count": 0,
      "word_count": 461
    },
    {
      "scene_number": 5,
      "slugline": "INT. THE BILTMORE - KITCHEN - PREP AREA - CONTINUOUS ACTION That same catering crew is back at work again tonight. RAMON Are you gonna go with him, 'cause if you don't go, I will go. Bryan walks by. BRYAN You're fucking late again. ALLY (a shout to Bryan) I’m what? BRYAN I said you're late! ON ALLY We begin to faintly hear INSTRUMENTAL GUITAR being played live somewhere... Calling her... RAMON Are we doing this? The guitar builds as Ally starts to walk out of the kitchen.   Ramon starts after her. ALLY Hey, Bryan, I'm out.   Find somebody else. RAMON Bryan, I'll be back.   I promise. Papo, I promise. ALLY See ya.   I won't. INT./EXT. JACK’S SUV - MOMENTS LATER Music builds as Ally and Ramon are ready for the night and walk to Jack’s waiting SUV. PHIL (out of the window) Hey, great!   Let's do this.  42. (CONTINUED)",
      "characters": [],
      "action_text": "Ally and Ramon get in the car and they share a giddy smile at what might lay ahead. RAMON What are we doing? ALLY (to Phil) You know, if I didn't know Jack... I would call you a stalker. EXT. SANTA MONICA AIRPORT - TARMAC - SUNDOWN The SUV stopped on the tarmac alongside a private plane. Ally and Ramon get out of the car, Ramon pirouetting his way onto the plane -- the music still going... INT. PRIVATE JET Ally and Ramon explore the interior of the luxurious private jet, taking it all in.   Lay on the couches, play on the televisions, loving it. RAMON I could get used to this shit. You need to date more rock stars, baby girl, you know what I'm saying? ALLY We're not dating. The music still building... INT./EXT. OUTDOOR AMPHITHEATER (BAY AREA) - NIGHT A Town Car pulling up at the venue, the music now audible, they’re right there... and GAIL, a frenetic type of woman, is waiting for her.   She opens the door for Ally.   Ramon gets out the other side of the Town Car, on his phone, recording this once in a lifetime experience. GAIL Hi, Ally, I’m Gail... You guys can leave your bags -- we'll grab 'em in a sec.   Ready? And with that said, Ally gets out of the car and they follow Gail -- ALLY Okay, sure.  43. CONTINUED: (CONTINUED) GAIL Did you have a good trip? ALLY Yeah. GAIL (handing them over) Passes. ALLY Oh, thank you. GAIL Put 'em around your necks. Earplugs.   You'll need these, it's loud up there. (into radio) Yeah, I got 'em.   We're coming in. (to Ally and Ramon) I'm gonna bring you guys to the side stage. Gail picks up the pace, Ally almost running after her... The music growing louder with every step... She looks back to Ramon to pick up the pace and then he’s there, taking up her arm and walking in stride, getting closer and closer... GAIL Guys, this way. ALLY This place is so big.   RAMON This is crazy. GAIL He's excited that you're here. They walk around a wall of amps and through PEOPLE onto SIDE STAGE LEFT, where we FIND Jack, drenched with sweat, playin",
      "dialogue_count": 0,
      "word_count": 2048
    },
    {
      "scene_number": 6,
      "slugline": "INT. HOTEL - THEIR ROOM - MIDDLE OF THE NIGHT Ally under the covers, asleep beside Jack.   His eyes open.   He comes awake, finding his bearings.   He sees her next to him asleep.   He looks at her back. He moves closer, tenderly kissing her shoulders.   She murmurs, coming awake.   He kisses her neck.   She rolls over.   He kisses her face.   Her lips. She pulls him closer as they make love in the witching hour... what feels like a real love... INT. HOTEL - THEIR ROOM - LATER Jack in his shirt and underwear and Ally in a hotel robe sitting around the dining table, eating breakfast. JACK One time, my brother came home... I was playing on this upright we used to always have in our den. And I was, like, in my own world. And no one was ever home, and he comes home to take care of my dad, who was sick.   And he's sitting there, and he's looking at me. And I swear to God, he looked at me like I was special or something, and it just kind of filled me up, and... I should've never told you that.   I don't know. ALLY Why? JACK 'Cause it's embarrassing.   I don't know. ALLY It's so sweet. JACK 'Cause you're nothing like my brother. ALLY Yeah, I don't look like your brother?  52. (CONTINUED)",
      "characters": [],
      "action_text": "JACK He's a fucking old man.   My dad had me when he was sixty-three years old. ALLY Sixty-three years old? JACK And we have different mothers, so... INT. ALLY'S HOUSE - CLOSE ON CELL PHONE - EARLY MORNING WE'RE LOOKING AT A YOUTUBE VIDEO OF THEIR DUET. WOLFIE (O.S.) What's that number down here? MATTY (O.S.) That is how many people looked at it. WIDER ANGLE And we see Lorenzo's racetrack and driver compadres are clustered together in Ally's living room, as one of them is holding a cell phone for the others to see... WOLFIE Get the fuck outta here.   How do they know how many people looked at it? LITTLE FEET They call it an algorithm... WOLFIE What's an algorithm? MATTY It’s like a beat. WOLFIE A beat? MATTY Yeah. WOLFIE Like in music, a beat?  53. CONTINUED: (CONTINUED) MATTY Yeah. Lorenzo comes in and sees what they’re looking at... LORENZO Do you believe this?   And you see this? He points to the growing number on the screen. WOLFIE Yeah. LORENZO That's how many people have watched. WOLFIE Yeah, yeah, we...   MATTY We were telling him. WOLFIE How the fuck do they do that? LORENZO I watched it two hundred times myself.   I'm two hundred of those people. MATTY Go, Pops. BACK IN THE HOTEL ROOM Jack races Ally back to the bed, but he grabs her, carries her into the bedroom; they crash among the sheets and blankets. EXT. ALLY’S HOUSE (THE VALLEY) - LATER A TAXI pulls up... LORENZO (V.O.) (pre-lap) Beautiful.   You wrote this with him? INT. ALLY’S HOUSE Ally and Lorenzo are watching the video.  54. CONTINUED: (CONTINUED) ALLY He's so talented. (it ends) Can we watch it again?   Just one more time. LORENZO One more time. ALLY Or, like... five hundred... LORENZO I'll be up all night watching this! INT. ALLY'S HOUSE - BEDROOM Ally lies in bed, peaceful, asleep despite the sun already peeking in. A gentle hand touches her, sweeps the hair from her face. She startles awake to see Jack, there in her bedroom, on her bed, in her life. ALLY Oh, my God.   How did you get in here",
      "dialogue_count": 0,
      "word_count": 992
    },
    {
      "scene_number": 7,
      "slugline": "EXT. GAS STATION - DAY Jack finished pumping gas, puts the GAS NOZZLE back, and screws the GAS CAP back on.   She looks up at him as he straps her helmet on her and kisses her. They ride off... EXT. WIND FARM (ARIZONA) - DAY IT’S A VAST WIND FARM, stretching into the distance... Jack standing, looks around... Ally in the distance looks around as well... ALLY Jack? Then to Jack... It’s as if all the life has been sucked out of him.   He tries to speak, but the words don’t come... He bends down and sifts some dry sand through his fingers. EXT./INT. COUNTY FAIR/BACKSTAGE - DAY Bobby is going over a SET LIST with a TECH. BOBBY Whenever he shows up.   These guys have been vamping out there for a fucking half an hour.   It's time to fucking get on. He looks up to see Jack -- BOBBY Don't you get tired of being... BAM! Jack DECKS Bobby with a hard punch sending him flat to the ground -- JACK You sold Dad's ranch!   They turned it into a fucking wind farm! Bobby’s trying to get his bearings, but he’s dazed... BOBBY I bought that for you.  58. (CONTINUED)",
      "characters": [],
      "action_text": "JACK Where's his grave? BOBBY (exploding) He washed away in a fucking storm. His grave isn't there anymore.   I would have told you, but you were fucking drunk.   You were fucking loaded and already pissing yourself a swan song.   Fuck if you shed a tear for that piece of shit you idolize for no goddamn fucking reason.   All Dad ever did for you... is make you his fucking drinking buddy.   And you'd be right there with him if he was still alive, and you fucking know it. Ally looks at Jack, his head down, thinking god knows what... But Bobby grabs Jack’s face, pulling him close, nose-to-nose, nowhere to hide. BOBBY What did you think, that I was gonna fucking take care of it while I'm fucking cradling your ass all over the goddamn world? JACK That's a good excuse.   Raising a little brother, so you don't have to deal with the fact that you were no fucking good. BOBBY If I was no good, why'd you steal my fucking voice? JACK 'Cause you had nothing to fucking say.   And you were too proud to sing any of the songs I ever wrote. BOBBY (after a beat) Well, I got something to say now, pal.   I'm done being your fucking errand boy.   I quit. And Bobby’s gone.   Jack opens the door to the dressing room...  59. CONTINUED:",
      "dialogue_count": 0,
      "word_count": 429
    },
    {
      "scene_number": 8,
      "slugline": "INT. COUNTY FAIR - BACKSTAGE - DRESSING ROOM - LATER Jack is standing, shirt off, pants halfway down as a DOCTOR administers a steroid shot in his bottom. JACK Yeah, my voice just got up on me a few months ago and... another shot of steroids is better safe than sorry. The doctor finishing... Hands him a prescription bottle. This is a routine. JACK Thank you for that and, yeah, we should be good. INT. COUNTY FAIR - BACKSTAGE - BATHROOM - CONTINUOUS ACTION Ally recovering from the fight that just happened, washing her face.   She steps out of the bathroom to find Jack. Jack notices Ally taking all this in as well as how beautiful she looks. JACK Hey.   You okay? ALLY Yeah. JACK Well, let's play. EXT. COUNTY FAIR (TEMPE, ARIZONA) - BACKSTAGE - LATER WALKING WITH JACK AND ALLY as they make their way as Ally stops and just watches as Jack grabs his guitar and heads effortlessly onto the stage... as we -- CUT TO: INT. HELICOPTER - CONTINUOUS ACTION We see Jack looking out the window to what looks like a makeshift city erected in the middle of the English countryside... as we -- CUT TO:  60.",
      "characters": [
        "TOUR BUS"
      ],
      "action_text": "EXT. GLASTONBURY MUSIC FESTIVAL Erupting applause from the AUDIENCE.   The music kicks in, and it’s the song, “ALIBI.”   Jack attacks the guitar. Ally plays the piano. JACK (into mic; singing) ‘ Don't ask me 'bout tomorrow, Or tell me 'bout my past, My heart is yours to borrow, Ain't nothin’ meant to last, I ain't lyin’.’  THOUSANDS OF PEOPLE IN THE CROWD ALL LISTENING -- MONTAGE - VARIOUS SHOTS ON THE ROAD As we see Jack play a familiar song, “MAYBE IT’S TIME.” JACK (into mic; singing)  ‘Maybe it's time to let the old ways die,’  TOUR BUS (MOVING) The tour bus hustles onward as the eastern sky begins to kindle -- JACK (V.O.) (into mic; singing)  ‘Maybe it's time to let the old ways die, It takes a lot to change a man, Hell, it takes a lot to try, Maybe it's time to let the old ways die,’  ANOTHER CONCERT - BACK LOT The band disembarks the bus one-by-one, and Ally, too, one of them now, with Jack, ready for the next one. JACK (V.O.) (into mic; singing)  ‘Nobody knows what waits for the dead, Nobody knows what waits for the dead,’  61. JACK It's gonna be a little different, we're gonna... ALLY Cheers. They all throw back the tequila... BAND MEMBER Where’s that joint?   JACK We're just gonna be a little different for the end, okay?   We're gonna do the encore and the thing that I said. BAND MEMBER Okay.   All right. The crowd’s applause and whistles urging their return... JACK All right?   Come on, let's go back out and do it.   Go, go, go. And walking back to the wings just off stage -- ALLY (following him) What?   What are you doing? He stops just short of the stage and turns to her, holding her... JACK All right, listen to me.   Here's what we're gonna do.   You're gonna do the song that I said that I wanted you to do, remember?   The one that I love. ALLY No.   No, I'm not.   Please! Come on. JACK Yeah, you're gonna do the one that I love.   It's gonna be great, come on. ALLY Come on, Jack.   Please don’t. JACK I’ll always... You promised me you were gonna do it -",
      "dialogue_count": 1,
      "word_count": 2163
    },
    {
      "scene_number": 9,
      "slugline": "INT. DANCE STUDIO Dancers stretch with Ally.   RICHY, choreographer- extraordinaire, walks in like he owns the place (he does). RICHY (to the dancers) Oh, so you guys have already met the new girl, have you? (noticing Rez in the corner) Rez!   What's the plan? REZ Yo, thanks for doing this, man.   I appreciate it. CUT TO: SAME SCENE - LATER LEGS DANCING FURIOUSLY IN THE F.G.   ALLY’S NEW SONG, “HEAL ME” PLAYS LOUD -- WIDER ANGLE We see Ally rehearsing with Richy and the two Dancers, a contemporary dance number... Ally and the dancers pouring sweat... Rez continues to watch from the back. The MUSIC CUTS -- RICHY This is pop music, kids.   We have a battle to do, okay?   You are the troops, so if I call you troops... just know that we're going into battle.   What are my lyrics, Ally? Richy keeps instructing vocally the beats, they continue to refine the moves... And dancing -- ALLY (singing; dancing)  ‘Just don't keep me waiting...’  RICHY (dancing with them) Yes!   Again, give me that.   Self. Break!   Yes!  71. (CONTINUED)",
      "characters": [
        "ALLY"
      ],
      "action_text": "JACK What are we gonna do with you? Oh, he's beautiful!   He's got your eyelashes. ALLY (as dog) ‘You can't send me back.   I'm too cute.’ He looks up to Ally, pure delight on his face. INT. BATHROOM - NIGHT Ally straddles Jack in the bathtub.   She puts MASCARA on his eyelashes, he’s playfully resistant. JACK This has never been done before, just so you know. She ever so gently places a BLACK TAPE EYEBROW on his face. ALLY It actually has been done before. Jack and Ally kiss. EXT. JACK’S HOUSE - NIGHT LOOKING IN.   Jack and Ally in bed... INT. SUNROOM - DAY Jack at the piano, working something out. INT. JACK’S HOUSE - CLOSE ON HANDS - DAY EATING SOME TAKEOUT CHINESE FOOD... WIDER ANGLE Jack and Ally are on the sofa together, enjoying their food.   They're quiet, enjoying the companionship... JACK (looks at her) Would you come with me to Memphis?  73. CONTINUED: (CONTINUED) ALLY What are you talking about? JACK I have to do some soul-crushing work there... But it keeps the lights on and then some.   So I should be grateful, but it's just kind of... never what I thought I'd wind up doing. Vulnerable to say the least. JACK I've made peace with it, though. Anyway, if you wanna come, I thought we'd have a laugh, at the very least. ALLY (wants to, but...) Rez wants to keep me here because they rushed out the single... They were so excited that they want me to finish the album.   So I'm working on that. JACK Listen to what you just said. People wanna hear what you have to say. ALLY I know.   I... JACK That's the stuff right there. (face-to-face) Hey, hey.   Take it in. She smiles. JACK Thank you, by the way. ALLY Thank you for what? JACK Giving me a home.   This place never felt like one before.  74. CONTINUED:",
      "dialogue_count": 1,
      "word_count": 674
    },
    {
      "scene_number": 10,
      "slugline": "INT. CONVENTION CENTER - DAY People costumed as PILLS dancing around giving out pamphlets, PHARMACEUTICAL KIOSKS set up in a horseshoe surrounding an empty stage where EMPLOYEES prep as people start to file into the chairs... BACKSTAGE - DRESSING ROOM Jack takes out a pill bottle... he takes his boot and smashes the pills and snorts them off the table... He puts the remainder of the crushed pills in a glass and chases it with a big swig of gin. ON STAGE The band is playing, but Jack’s not there.   Everyone is waiting for him.   Then, finally, Jack, a gin on the rocks in his hand, obviously two sheets to the wind, coming out to join his band to large applause.   Jack looking out at the audience, a sea of name tags... He puts on his guitar. JACK Oh, fuck. BAND MEMBER Jack, you okay?   Jack? And as he plays, drunk, loaded, but good enough to be passable and keep on his feet... INT. FESTIVAL VENUE - NIGHT We’re OVER Ally’s SHOULDER as she’s breathing, getting ready to go on... We PULL OUT and the music starts and she comes on and sings.   However, the dancers are not a part of this choreographed number as intended... ALLY (into mic; singing)  ‘Treat me like your patient, Just don't keep me waiting, Or I'll just be wasted, In a crowd of the lonely, I need you to inspire me, When I can't inspire myself, I need you to provide for me...’  Backstage, Rez sees the DANCERS, very much not on stage.  75. (CONTINUED)",
      "characters": [
        "ALLY"
      ],
      "action_text": "REZ Is there a reason why you're not up there? ALLY  ‘Lay me down, lay me down now, Lay me down, touch my spirit, ooh, Lay me down, lay me down now, Lay me down, Heal me, God knows nothin’ else is gonna, Gonna heal me, Oh, before it's too late, Won't you steal me, Steal me all the way from myself, Won't you heal me?’  EXT. FESTIVAL VENUE - OFFSTAGE - LATER Ally and Rez just offstage, crowd now dancing to a DJ that has taken the stage.   She’s still in her outfit... She and Rez speaking loud over the noise. ALLY (panting) Hey! REZ Pretty incredible. ALLY Did Jack show up? REZ I haven't heard from him. ALLY What do you mean, you haven't heard from him? REZ I haven't heard from him all night. ALLY I haven't been able to find him. I called him three times. REZ Listen, what happened with the dancers there?  76. CONTINUED: (CONTINUED) ALLY Well, I just thought, you know, that I should do it alone... It's just, it's so overwhelming.   With the hair, and the -- REZ You can't go rogue on me.   You have to understand that this is what I do... You have to trust me, okay?   So, if I give you a couple of dancers... don't not use them and then miss a couple of steps, okay?   We also have to change your hair.   We have to change the color of your hair. She’s still a little lost, thinking about Jack until -- ALLY What's wrong with my hair? REZ I'm thinking platinum, or... ALLY I don't wanna be fucking blonde. I am who I am, and I'm worried about Jack. REZ I will find Jack, okay?   I will find him. OFF Ally -- EXT. RESIDENTIAL NEIGHBORHOOD (MEMPHIS) - MORNING A figure steps into a sun-blistered sky and leans INTO the FRAME, REVEALING GEORGE “NOODLES” STONE. NOODLES Jack.   I feel like we've done this before.   Didn't think we'd do it so soon, man. We see that Jack is looking up at him, lying in a field of ivy.   Rough night. NOODLES Come on, bro.   Get up.   All right. There we go.  77. CONTINUED: (CONTINUED) Noodles helps Jack stumble to his feet.   They head for the house... JACK ",
      "dialogue_count": 1,
      "word_count": 2003
    },
    {
      "scene_number": 11,
      "slugline": "EXT. BILLBOARD (ESTABLISHING) Ally’s debut album --   ALLY . Her hair now RED, vibrant, exciting, new... INT. CHATEAU MARMONT - THEIR ROOM - DAY Jack getting off the hotel phone and Ramon sitting across the room on the couch, typing on his phone. JACK Lot of people downstairs? RAMON Yeah. JACK She better come out soon, before they leave. RAMON What, want me to check on her? JACK I think we're gonna have to go pretty soon, so... RAMON All right. Ramon gets up.   Jack watches him go over to the BATHROOM DOOR. RAMON Ally.   I'm coming in. Before she answers, he opens the door and slips in -- INT. CHATEAU MARMONT - THEIR ROOM - BATHROOM - CONTINUOUS ACTION He leans against the door. RAMON Ally. A beat. ALLY Yeah.  86. (CONTINUED)",
      "characters": [
        "EMERALD"
      ],
      "action_text": "Ally is in an empty bathtub, the shower curtain obscuring her. RAMON What're you doin' in the tub? He pulls back the curtain and Ally, with LONG, RED HAIR, is sitting on the bathtub floor in an EVENING GOWN. ALLY This is so weird.   I don't know who the hell I think I am.   I... One song is fine... but to put out a whole record, I don't know what the fuck I was thinking. RAMON I don't know about all of that, but you definitely look like a star. ALLY Really? RAMON Yeah. INT. CHATEAU MARMONT - THEIR ROOM Rez sits across Jack now, two men waiting for their girl. JACK What do you think of the hair and the look and the...? REZ Well, I discussed it with her. JACK Yeah. REZ I think it looks great. JACK Was that your choice, or...? REZ No, it was actually hers. (beat) No drink? JACK What's that?  87. CONTINUED: (CONTINUED) REZ No drink? Jack nods, fully aware of the implications Rez is alluding to. JACK No socks? Rez seemingly has no socks on. REZ Touché.   Touché, mate. JACK Yeah, I could never get used to that... the idea of not wearing socks.   Your feet get all sweaty... REZ (laughing) No, I actually am wearing socks. They're these kind of little female insert socks... that work with these shoes. JACK Oh.   Oh, you are.   You're just hiding them. REZ (laughing) Yeah, I'm just hiding them. That's right. INT. CHATEAU MARMONT - THEIR ROOM - BATHROOM - CONTINUOUS ACTION Ally and Ramon are sitting in the bathtub... Ramon pulls out his phone and, with a few swipes, pulls up a video... He hands it to her... We see her melt. VIDEO:   It’s the gang from THE BLEU BLEU all together in the dressing room -- DRAG BAR EMCEE (V.O.) (through phone)  Okay, now is this thing... Yeah, there it is.   Oh, that's a good light.   Here, hold this for me, baby.   Hey, Ally, girl!   Wait, hold on.   Come here, Sooki, Donte. Come here.  88. CONTINUED: (CONTINUED) REZ Season finale. RAMON No fucking way.   REZ No, you got it. ALLY Oh, my God!   That's incredible! Thank you. REZ Congratulations!   R",
      "dialogue_count": 1,
      "word_count": 962
    },
    {
      "scene_number": 12,
      "slugline": "INT. DANCE REHEARSAL SPACE - DAY Ally in rehearsals with her dancers and Richy, the choreographer.   They dance to the music and his count, one of Ally’s new hit songs, “HAIR, BODY, FACE.” INT. “SNL” - NIGHT ALEC BALDWIN walks to the stage with a FEMALE ASSISTANT DIRECTOR in tow.   There is a smattering of applause. FEMALE ASSISTANT DIRECTOR Thirty seconds.   Red mark. (beat) Alec in twenty. Jack watches from below, back behind the pit and the standing audience. MALE STAGE MANAGER (V.O.) (over radio) Fifteen. MALE DIRECTOR (V.O.) (over radio) All right, stand by, guys.   Here we go, ready?   Song one. MALE STAGE MANAGER (V.O.) (over radio) Stand by, Alec. Ally waits backstage.   We see monitors with “SATURDAY NIGHT LIVE” in the control room. MALE DIRECTOR (V.O.) (over radio) Ready four.   Cue dissolve four. FEMALE ASSISTANT DIRECTOR (V.O.) (over radio) Alec in five seconds. (through radio) Four, three, two, one... MALE DIRECTOR (V.O.) (over radio) And go four.   Dissolve four... and cue Alec! ALEC BALDWIN (to camera) Ladies and gentlemen... Ally.  92. (CONTINUED)",
      "characters": [
        "MALE DIRECTOR"
      ],
      "action_text": "Jack turns and takes in his brother... JACK (pleasantly surprised) What the hell are you doing here? BOBBY I'm in town for a gig.   Been working for Willie. (Jack can’t hear) I've been working for Willie. JACK No shit. BOBBY Yeah.   Thought I'd stop by and check her out. JACK (looking at monitor) Yeah, well... Ally is writhing on the floor like a cat in heat.   Jack grimaces. ALLY (into mic; singing)  ‘I've been prayin’ on my knees, That you would always stay around, That you would never leave.’  BOBBY (re:   Jack’s hearing) Is it getting worse? JACK Nah, I've just been with my wife... It's going real good. (beat) Funny to run into you 'cause, uh, I was thinking about asking you to come back out with us. Bobby is taken aback. BOBBY I gotta say, it's easier without you. Jack nods.   They regard each other and the audience erupts at the end of her song...  94. CONTINUED: (CONTINUED) ALLY (into mic) Thank you. Crew members and audience members alike begin to flood in around them, coming back to begin setup for the next skit... Jack begins to move back towards his wife, a fish heading upstream.   Bobby grabs and holds his brother close -- BOBBY Listen.   You run into any trouble... call me. Jack turns, Ally and the entire horde of people are being ushered past... Jack begins to walk in her direction, disappearing into the onslaught. INT. RECORDING STUDIO - DAY IT’S DEAD QUIET, WE SEE JACK IS IN A RECORDING BOOTH... WE CAN’T HEAR THEM BUT WE SEE HE’S AFFECTIONATELY GREETING THE MEMBERS OF HIS BAND... PRE-LAP:   SNARE DRUM, THEN GUITAR LICK AND BAND KICKING IN... INT. RECORDING BOOTH - DAY Jack, ebullient to be back in a recording session, the BAND all playing together.   Vamping the music, singing nonsense lyrics... Jack playing his guitar, feeling great, creating... And it actually sounds like something... Something special... And even if it didn’t, the feeling of being there, feeling young, being free, is good enough... Ally joins him at the mic -- ALLY AND JACK (into ",
      "dialogue_count": 1,
      "word_count": 1091
    },
    {
      "scene_number": 13,
      "slugline": "INT. JACK’S HOUSE - BATHROOM - LATER Ally is now in the bath, a moment of respite, quietly sings “La Vie En Rose.”   Jack enters, still drunk.   He sits down on the bath’s edge -- JACK You’ve been nominated for three Grammys and it’s fucking great. ALLY Thank you.   How did you find that out? JACK Bobby told me.   He called, he said that they want me to do some Roy Orbison tribute, some super group thing, but... ALLY That’s great. JACK But the point is you got nominated and it’s great.   I’m just trying to figure it out, that’s all. ALLY What are you trying to figure out? JACK ‘Why you come around with an ass like that?’ She looks at him dumbfounded... ALLY What are you... You singing my lyrics... JACK ‘Why you look so good in those jeans, why you come around with an ass like that...’ ALLY Yeah, that’s my song. JACK Yeah, I know it’s your song, I have to fucking listen to it over and over and fucking... ALLY What about my song? Then --  98. (CONTINUED)",
      "characters": [
        "JACK",
        "ALLY"
      ],
      "action_text": "ALLY You’re not making any sense. Jack takes a drink. ALLY Yeah, just keep drinking.   That’ll give you the answer. JACK I don’t know, maybe I just fucking failed you, it just kills me, I’m sorry, I just -- ALLY You what?!   You failed me? JACK Yeah, you’re embarrassing and it just -- You know, I feel bad for you. ALLY I’m embarrassing? JACK And I just... You know -- ALLY I’m not fucking embarrassing, you’re embarrassing and you know what you’re doing?   You’re so embarrassed of your fucking self that you gotta put me down. JACK I just have to tell you, I have to be honest with you, you know? JACK You’re worried that you’re ugly -- and you’re not, I’m trying to tell you that -- so you need to get all this fucking approval by all these other people and it’s... ALLY I don't need approval.   JACK I just... Why can’t I just be enough for you? ALLY You know what I’d like?   Is for my boyfriend to love me. JACK No...  99. CONTINUED: (CONTINUED) Then showing her wedding ring -- ALLY Actually, for my husband to love me. JACK Yeah, who’s your fucking boyfriend?   You have a boyfriend? ALLY (sarcastic) Yeah, I got a boyfriend. JACK That hurts. ALLY Yeah, I have a boyfriend. JACK Call me your fucking boyfriend... ALLY You’re my boyfriend!   You’re my boyfriend if you don’t treat me like your wife. JACK I don’t even know what that fucking means. ALLY It means clean your shit up. You’re fucking messy.   That’s what it means. JACK Well, that's not true. ALLY Oh, it isn’t? He shakes his head. ALLY Well, let’s go. (grabbing his drink) You want to be my drinking buddy? Want to practice? JACK I don’t think you could handle it.  100. CONTINUED: (CONTINUED) ALLY You don’t?   I’ll just do it. She takes a drink from his glass. JACK And you know why?   ‘Cause you’re too worried what everybody else is thinking. You can’t even concentrate on one fucking thing... That’s right. ALLY (imitating his voice) You don’t think I can handle it.   Here we go. Here we go.   Here we go, Jack, want me to",
      "dialogue_count": 3,
      "word_count": 5616
    },
    {
      "scene_number": 14,
      "slugline": "EXT. JACK’S HOUSE - GARAGE - LATER Jack is in his truck.   He sits as it idles, presumably warming it up.   Then, after a beat, he backs out of the driveway, but then -- Stops.   Cuts the engine.   Sits and waits.   We can’t see what he’s doing, but he shifts around in his seat for a moment, almost as if pulling something from his pocket... INSIDE THE PICKUP Jack fumbles with a bottle of pills in the glove compartment. INT. THE FORUM - BACK STAGE - NIGHT The sound deafening... Ally prays in a circle with her crew. ALLY (praying) Thank You so much for bringing us all here together.   Please look over all of the dancers tonight and the band.   And my husband, Jackson.   We're so excited for him to be here with us. The Forum crowd cheers. ALLY (to her crew) We got a big night.   We're at the Forum.   L.A.   Let's do this. EXT. JACK’S HOUSE - DRIVEWAY - LATER Jack’s pickup is parked.   Then he gets out. HOLD OUR POSITION BY THE TRUCK -- Jack walks back into the garage... He has his belt in his hand.   He gently sets his cowboy hat on a file cabinet. He turns TO us and, in pulling down the GARAGE DOOR, we get a glimpse of the ceiling fan slowing its spin... The door closes...  130.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 228
    },
    {
      "scene_number": 15,
      "slugline": "INT. FORUM - LATER And as Ally’s BAND plays out the last few bars, her voice holds the final note. Long and steady, the audience exhilarated to see how long she can hold it -- which is very long. A beat.   A breath. The audience on their feet, already wanting an encore... Eruption of a CROWD going crazy as Ally, breathless, comes UPSTAGE RIGHT down their staircase into the bowels below the stage. Rez is waiting -- ALLY Is he here? REZ He's not here. ALLY He's not here? She gulps from a water bottle while the stylists change her costume, Rez in tow. REZ We have to do ‘Shallow’ regardless, okay?   The guitar's up there.   Everything's gonna remain the same, okay? ALLY What? REZ The guitar's up there. Everything's gonna remain the same.   Both verses.   I'm sure it was just a bit much for him, that's all. ALLY Will you send somebody to the house, please. REZ I'm doing it right now. ALLY I have fifteen seconds.  131. (CONTINUED)",
      "characters": [],
      "action_text": "Ally turns and walks back up the stairs and out into the thrash of people -- The audience applause morphing into a chant. The band plays a familiar intro -- the first few chords of “Shallow”... The audience catches it, they erupt in tandem with the band coming in full force -- This is a whole new version of Jack and Ally’s song. This song has evolved much like the performer at center stage. Tell me something, boy... INT. FORUM - STAGE - CONTINUOUS ACTION Ally plays and sings by herself at a piano on a platform in the middle of the arena along with Jack’s guitar on its stand -- Ally launches into the CHORUS with the same power we heard echoing through the street their first night... ALLY (over speakers; singing)  ‘In the sha-ha-sha-ha-low, In the sha-ha-sha-la-la-la-low, In the sha-ha-sha-ha-ha-low, We're far from the shallow now, Ooo ouo oooo haaaa.’  (into mic) Give it up for my husband, Jackson. And as the SONG ends, breathing heavy -- EXT. JACK’S HOUSE - DRIVEWAY - NIGHT Charlie is at the garage door, back and forth trying to get in, barking.   Something’s wrong... EXT. JACK’S HOUSE - LATER Red and blue lights flash.   Inside through the glass doors it seems Jack has left the “La Vie En Rose” neon light on. DISSOLVE TO:  132. CONTINUED:",
      "dialogue_count": 0,
      "word_count": 395
    },
    {
      "scene_number": 16,
      "slugline": "INT. JACK’S HOUSE - MUSIC ROOM - MORNING Ally at the piano, alone, broken.   Bathed in the red light of the “La Vie En Rose” neon sign.   She plays a few melancholy chords, a song we’ve only begun to hear... EXT. JACK’S HOUSE - GRAND WINDOW - DAY LOOKING IN.   Ally looking out.   The garage in the distance... Her roots have grown out, showing the natural brunette, the markings of the Ally we met at the beginning of the movie... Her eyes transfixed on the vista below. INT. JACK’S HOUSE - HALLWAY/BEDROOM - MOMENTS LATER Ramon sits with Ally in the window seat.   Rubs her back. RAMON I can stay, if you want. INT. JACK’S HOUSE - HALLWAY - LATER Ally stares at JACK’S TOUR POSTERS.   Something building inside her.   And then, she snaps -- CRASH! She begins smashing them, glass flying in a rampage. SAME SCENE - LATER Ally sits cradling Jack’s guitar amongst everything broken and smashed... INT. JACK’S HOUSE - MUSIC ROOM - DAY Bobby sits next to Ally, equally broken, feeling the very same thing, quiet.   He doesn’t move, although it feels like they need to hold each other. BOBBY Some kid started singing one of his songs in a bar I was in the other night... They're playing his songs everywhere. He thinks about it...  133. (CONTINUED)",
      "characters": [],
      "action_text": "BOBBY At first I got angry.   I don't know why.   I guess I felt like... how can any of these people feel like they knew him?   Who he really was.   (beat) But then something changed.   And it soothed me.   That, well, it wasn't all for fucking nothing. She looks at him. ALLY (sobbing) The last thing I did was lie to him. BOBBY Listen to me.   It isn't your fault.   It just isn't.   You know whose fault it was?   Jack.   That's it.   No one else.   Not you, not me.   No one but Jack. ALLY (crying) I just keep going over and over it, over it in my head. After some moments... BOBBY Jack talked about how music is essentially twelve notes between any octave.   Twelve notes and the octave repeats.   It's the same story.   Told over and over. Forever.   All any artist can offer the world is how they see those twelve notes.   That's it. Ally looks at him, hearing him. INT. THE SHRINE - NIGHT Packed with people seated in this huge theater. BOBBY (V.O.) (post-lap) He loved how you see them.   He just kept saying, ‘I love how she sees 'em, Bobby.’  134. CONTINUED: (CONTINUED) A SILHOUETTE OF A WOMAN, her head down in the wings.   Her hands clasping each other -- Much in the same way she would hold Jack’s hand.   And it is Ally. And we’re -- WALKING now WITH Ally... She’s in a DRESS, heading into a proscenium larger than we have ever seen.   The lights find her... WE GO -- WIDE ANGLE The crowd embraces her, “We love you Ally,” and encouragement from all over... She puts her head down... We see she’s a brunette.   No makeup. ALLY (whispering; into the microphone) Hello, I'm Ally Maine.   Thank you for being here tonight to honor my husband. The crowd adoring her, accepting her at her most vulnerable... ALLY (whispering; into the microphone) He wrote a song for me.   I'd like to sing it for him tonight.   And with your help, maybe I can. Thank you.   Really.   Thank you. And with that, she begins to sing an original song, “I’ll Never Love Again.”   We SLOWLY PUSH IN -- The audie",
      "dialogue_count": 0,
      "word_count": 1035
    }
  ]
}