{
  "slug": "a-very-english-scandal-101-episode-1-1-2018",
  "title": "a very english scandal 101 episode 1 1",
  "genre": "drama",
  "format": "series",
  "scenes_count": 18,
  "characters_count": 0,
  "characters": [],
  "total_words": 11689,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. BESSELL’S OFFICE - DAY 6A   6A BESSELL’S business office at Pall Mall.   SECRETARY in background, Bessell at his desk, answering his phone: BESSELL Mr Peter Bessell speaking. CUT TO: INT. JEREMY’S H.O.C. OFFICE - DAY 6B   6B A comparatively small office at this stage of JEREMY’S career.   He’s on the phone, angry, clipped. JEREMY Pedro, I have a problem.   Meet me. At the Ritz.   12 o’clock. And bang, he hangs up. CUT TO: INT. THE RITZ - DAY 6C   6C JEREMY & BESSELL sit together.   JEREMY solemnly hands over... A 17-page HANDWRITTEN LETTER on BLUE PAPER. JEREMY It was delivered last week.   To my mother.   And she read it, every single word, all seventeen pages. BESSELL (flicks to last page) ...from Norman Josiffe..? Jeremy just raises an eyebrow. BESSELL (CONT’D) You mean he’s one of your...? (reads, hushed) “Jeremy and I have had a homosexual relationship.”   Oh my God, your mother read this.   What does he want, money? JEREMY The vast sum of £30.   He can’t even blackmail properly. BESSELL So who is he, exactly? English Scandal Ep.1 prod script amended 04th Dec   6.",
      "characters": [],
      "action_text": "JEREMY He’s... (helpless) When I first saw him.   He was very heaven. CUT TO: EXT. STABLES - DAY 7   7 SPLASH! CU NORMAN, WATER cascading over his head. WIDER: he’s stripped off his shirt, after a ride, dousing himself from a bucket, sweating, wired, breathing hard. It’s 1961 and NORMAN JOSIFFE is 20, lean, fit, handsome, from suburban Kent.   But he’s troubled, living on his nerves; he’s haunted by problems, and his vivid imagination makes them worse.   But right now, here in small world of the stables, in a Cotswold village, he’s happy. A STABLEHAND leads the HORSE away in b/g as Norman recovers, still catching his breath.   He leans on a stable door. A distance away, JEREMY rounds the corner. And he stops. Hold the moment.   Jeremy watching Norman.   Norman oblivious. And then Jeremy strides forward.   Confident, strong. JEREMY Good morning.   And a very fine morning it is too. Norman embarrassed, grabs a jumper, dries himself with it, then shoves it on; putting on a jumper over wet skin is so accidentally sexual.   All of that, during: NORMAN Morning, sir.   Pardon me. JEREMY Jeremy Thorpe.   I’ve come to stay for the weekend, I’m a guest of Mr Van de Vater. NORMAN I know, sir, he said.   He was very excited.   Quite a special visitor, Member of Parliament and all that. JEREMY And what’s your name? English Scandal Ep.1 prod script amended 04th Dec   7. NORMAN Norman, sir. JEREMY Another Norman?   Mine host, Norman Van de Vater, and Norman..? NORMAN Josiffe. JEREMY Josiffe!   Is that French? NORMAN I don’t know, sir. JEREMY Really?   You’ve never so much as enquired about your own surname? NORMAN It’s just...   My mother married a Josiffe.   But he’s not my father. JEREMY Ah.   Complicated. NORMAN Sorry. JEREMY No.   My fault.   That’s private. Pause. NORMAN I’d best get back to work.   Will you be riding this weekend, sir? JEREMY Oh, yes, definitely.   It’s a passion of mine, absolutely. NORMAN I can prepare the horse myself, what level are you at?   What kind o",
      "dialogue_count": 0,
      "word_count": 765
    },
    {
      "scene_number": 2,
      "slugline": "EXT. PARLIAMENT SQUARE - DAY 9   9 BIG BEN looming above. And there’s NORMAN, hurrying along, excited, determined, carrying a small battered SUITCASE, A DUFFEL BAG and a little Jack Russell called MRS TISH.   He’s on his way! CUT TO: INT. JEREMY’S H.O.C. OFFICE - DAY 10   10 JEREMY working at his desk, as a uniformed MESSENGER arrives. MESSENGER ‘Scuse me, Mr Thorpe, visitor for you, Central Lobby.   Says you’re expecting him, a Mr Norman Josiffe. Blink.   Then DELIGHTED. JEREMY Yes yes yes.   Right away! CUT TO: INT. HOUSE OF COMMONS, CORRIDOR - DAY 11   11 The MESSENGER running off ahead, as JEREMY strides along. Straightening his tie.   Pulling his cuffs.   Kicking out his trouser leg.   Electrified.   Galvanised.   Turned on.  CUT TO: INT. HOUSE OF COMMONS, STAIRCASE - DAY 12   12 JEREMY trots down.   Breaks into a RUN.   Pell-mell! CUT TO: INT. HOUSE OF COMMONS, CENTRAL LOBBY - DAY 13   13 JEREMY strides in, arms wide, grinning. JEREMY Norman! Huge, impressive space.   NORMAN stands there clutching a GREEN FORM, plus SUITCASE, BAG & MRS TISH.   At his side, guarding him, the SERJEANT AT ARMS, 50s, Nigerian, proud. NORMAN I’m sorry, I couldn’t think where else to go, I hope you don’t mind - English Scandal Ep.1 prod script amended 04th Dec   10.",
      "characters": [],
      "action_text": "He’s surprised as Jeremy hugs him.   A manly hug. NORMAN (CONT’D) Ooh.   Sorry.   Mind Mrs Tish! JEREMY I certainly will.   Hello Mrs Tish. Now I’m awfully busy but we might have time for a little conflab - NORMAN He says we’re not allowed in. SERJEANT AT ARMS I’m sorry, Mr Thorpe, but you know the rules.   No dogs allowed inside the Palace of Westminster. JEREMY That.   Is.   Correct.   Except! Jeremy turns his full charm on the Serjeant, who loves it. JEREMY (CONT’D) I’m sure you know that Charles II issued an edict allowing King Charles Spaniels inside the domain. And while this might be technically a Jack Russell - is that right? NORMAN That’s right, yes - JEREMY - you know what dogs are like.   I think some roving Spaniel might have had his way with Mrs Tish’s mother.   Which means.   She has royal blood.   So make way! CUT TO: INT. HOUSE OF COMMONS, STAIRCASE - DAY 14   14 NORMAN carrying MRS TISH (and SUITCASE & BAG), scampers along behind JEREMY, who trots up the stairs.   Jeremy’s brazen, not remotely worried about being seen with Norman. JEREMY Complete fantasy.   That Charles II thing.   No such law.   But so many people have said it, over the years, it’s assumed to be true. Which is a very good thing to remember in life, I think. CUT TO: English Scandal Ep.1 prod script amended 04th Dec   11.",
      "dialogue_count": 0,
      "word_count": 447
    },
    {
      "scene_number": 3,
      "slugline": "INT. JEREMY’S H.O.C. OFFICE - DAY 15   15 FIVE MINUTES LATER.   NORMAN with MRS TISH - he’s shaky, in quite a state; he’s living on his nerves, tapping out some PILLS from a bottle.   JEREMY studying him.   Fascinated. NORMAN I just had to get away.   And I thought of you.   Mr Van de Vater said the most terrible things to me.   Really, I’ve never heard a gentleman talk like that. JEREMY Between you and me, he’s not a gentleman at all.   It’s a charade, his entire life, his real name’s Norman Vater.   From Wales. NORMAN Well he adored you.   Absolutely. Oh my God, Jeremy this, Jeremy that.   Every time you wrote to him, he’d read it out loud. JEREMY (worried) Like what?   Anything in particular? NORMAN You sent him a postcard.   On the day Princess Margaret got engaged to Antony Armstrong-Jones.   And you wrote to Mr Van de Vater... CUT TO: OMITTED 16   16 OMITTED 17   17 INT. VAN DE VATER’S LIVING ROOM - DAY 18   18 This is a well-kept, expensive thatched cottage, but not a mansion.   VAN DE VATER in his SILK DRESSING GOWN, holding a POSTCARD, to NORMAN, who’s holding a TRAY OF TEA. VAN DE VATER ...of the happy couple, Jeremy says, “What a pity...” CUT TO: English Scandal Ep.1 prod script amended 04th Dec   12.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 221
    },
    {
      "scene_number": 4,
      "slugline": "INT. JEREMY’S H.O.C. OFFICE - NIGHT 19   19 JEREMY alone in a pool of light, Friday 26 February 1960. Writing his fateful POSTCARD to Van de Vater.   “What a pity...”   The words being written with Jeremy’s VOICEOVER. JEREMY V.O. ...I rather hoped to marry one and seduce the other. CUT TO: INT. VAN DE VATER’S LIVING ROOM - DAY 20   20 VAN DE VATER, BRAYING with LAUGHTER.   NORMAN shocked. CUT TO: INT. JEREMY’S H.O.C. OFFICE - DAY 21   21 NORMAN ...it wasn’t so much that, as what he did with the postcard. CUT TO: INT. VAN DE VATER’S LIVING ROOM - DAY 22   22 VAN DE VATER holding up the POSTCARD to NORMAN. VAN DE VATER I’ll keep this safe and sound. He opens a DRAWER; there’s a BUNDLE OF LETTERS, bound in STRING.   A glimpse of the HOUSE OF COMMONS EMBLEM.   As Van de Vater adds the postcard to the pile, NORMAN watching, rapt. VAN DE VATER Add it to my little collection. Letters from the great and powerful! SLAM!, the drawer shuts. CUT TO: INT. JEREMY’S H.O.C. OFFICE - DAY 23   23 JEREMY wary, disturbed. JEREMY I didn’t know he kept them. English Scandal Ep.1 prod script amended 04th Dec   13.",
      "characters": [],
      "action_text": "NORMAN Well he doesn’t any more.   I took them.   When I walked out. CUT TO: INT. VAN DE VATER’S LIVING ROOM - DAY 24   24 Room empty.   NORMAN with SUITCASE and DUFFLE BAG, hurries to the DRAWER, grabs the STRING-TIED BUNDLE OF LETTERS.   Hurries out with luggage, scooping up MRS TISH on the way. CUT TO: INT. JEREMY’S H.O.C. OFFICE - DAY 25   25 NORMAN now handing over the STRING-TIED BUNDLE OF LETTERS. JEREMY taking them, keeping them.   Relieved and grateful. JEREMY But that’s exceedingly kind. Whatever did you do that for? NORMAN Some of those things were personal. And a bit cheeky, if you don’t mind my saying.   If they fell into the wrong hands...   I didn’t want you getting into trouble. Beat.   A smile.   Affection between them.   And heat. NORMAN (CONT’D) It’s funny.   His name’s Norman and my name’s Norman, and these are all ‘Dear Norman’, I used to imagine... they were mine.   As if a man like you would write to a man like me. JEREMY It’s not impossible. NORMAN ...really? Norman shy, breaks the moment; he’s counted out four pills. NORMAN (CONT’D) Could I have some water? JEREMY Yes, of course. Jeremy’s got a CARAFE OF WATER, a GLASS, close at hand. NORMAN keeps talking, gulping down the PILLS. English Scandal Ep.1 prod script amended 04th Dec   14. DURING THE DIALOGUE: JEREMY watching.   Like a hawk.   He loves this; he’s attracted to a hapless, helpless Norman, to whom he can be superior.   But crucially, this weakness, this neediness, the pills, turn him on.   They give Jeremy control. And at the same time: Norman, by being helpless, and simply by being young, is giving out sexual signals.   It’s not deliberate, it’s innate; it’s how he gets through the world. NORMAN These pills are new.   I was on Largactil, but they said try this Elavil instead.   Because I wasn’t very well.   In the head.   I suppose you’d guessed that already!   I was in the clinic.   For psychiatric patients.   Is that all right? JEREMY Of course it is. NORMAN And they were very go",
      "dialogue_count": 0,
      "word_count": 694
    },
    {
      "scene_number": 5,
      "slugline": "EXT. URSULA’S HOUSE - DAY 28   28 DOOR OPENS.   And there stands URSULA THORPE.   Tall, grim, forbidding.   A Conservative, with a MONOCLE. URSULA Who might this be? CUT TO: INT. THE RITZ - DAY 29   29 THORPE with BESSELL, in 1965, interrupting the tale - BESSELL You took him to your mother’s house?! CUT TO: EXT. URSULA’S HOUSE - DAY 30   30 JEREMY on the doorstep, facing URSULA, NORMAN quailing. JEREMY Ursula!   This is... (making it up) Peter Freeman, he’s a cameraman, he’s coming with me on that expedition to Malta, I said we could give him a bed for the night - CUT TO: INT. THE RITZ - DAY 31   31 BESSELL But...   why ?! JEREMY I thought it would be fun. CUT TO: INT. URSULA’S MUSIC ROOM - NIGHT 32   32 NORMAN sits, polite, MRS TISH in his arms, SUITCASE & BAG by his side, utterly out of his depth, as URSULA plays the PIANO and JEREMY plays the VIOLIN.   An old party piece of theirs. Dinicu, ‘Hora Staccato,’ fast & fierce.   More like a battle between mother and son.   From the wild, mad, fiddling - CUT TO: English Scandal Ep.1 prod script amended 04th Dec   16.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 200
    },
    {
      "scene_number": 6,
      "slugline": "INT. URSULA’S DINING ROOM - NIGHT 33   33 URSULA sits at the head of the table.   JEREMY to one side. NORMAN opposite.   Ursula’s house, Stonewalls, is an austere late Victorian house in the Surrey village of Limpsfield; all rooms are on the ground floor, Ursula lets the upper floor. The world of the professional upper middle classes. A HOUSEMAID scurries round, serving up dinner. A BOILED EGG.   One each. This is normal to Jeremy and Ursula.   They take their spoons, crack their eggs.   Norman nervous, copies them, as mother and son talk, ignoring Norman completely.   And Ursula, monocle’d as ever, interrogates her way into Jeremy’s life. URSULA They say you’re part of it.   This Committee regarding peerages. JEREMY I’m not on the Committee, no. URSULA But it exists, because of you?   You facilitated it? JEREMY I just asked the right question at the right time, that’s all. URSULA But for whose benefit?   Anthony Wedgewood Benn? JEREMY I knew him at Oxford, he’s a perfectly decent chap - URSULA The man’s a Trot!   And think of the bigger picture.   If you sit on that committee and steer it correctly... (she bullies, then charms) Then one day you could claim the ancient barony of Thorpe, and wouldn’t that be marvellous? JEREMY I suppose it would. URSULA You would be elevated, darling. Elevated. CUT TO: English Scandal Ep.1 prod script amended 04th Dec   17.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 232
    },
    {
      "scene_number": 7,
      "slugline": "INT. URSULA’S SPARE ROOM - NIGHT 34   34 Small, neat room, with a sink.   NORMAN in PYJAMAS with a VEST underneath, filling a glass of water.   Gulps down his PILLS. JUMP CUT, MINUTES LATER, Norman just sitting on the bed.   A bit bleary from the pills, from the day.   Lost and alone. MRS TISH is asleep in a basket.   He gives her a little pat. JUMP CUT, MINUTES LATER, Norman in bed.   He’s been given a BOOK, Giovanni’s Room, abandons it, switches off the lamp. Darkness. JUMP CUT, 20 MINUTES LATER.   Creak.   The door opens.   A shaft of light.   And there’s JEREMY, in pyjamas & dressing gown. He’s carrying a TOWEL, and a JAR. Norman blinks awake. JEREMY Sssh. Jeremy comes in, sits on the bed, as Normal sits up in bed, shucks his knees up, switches the lamp on.   A bit scared of this powerful man; a bit thrilled to be in his company. While Jeremy is composed, calm, certain.   All hushed: NORMAN Nothing wrong, is there? JEREMY Why would there be? NORMAN I don’t know. JEREMY Did you read the book? NORMAN Not yet. JEREMY You’ll like it. And Jeremy leans over, puts the JAR on the bedside table. It’s a JAR OF VASELINE.   Norman taking this in.   Nervous. JEREMY (CONT’D) Don’t look so scared. NORMAN I’m not. English Scandal Ep.1 prod script amended 04th Dec   18.",
      "characters": [],
      "action_text": "JEREMY Yes you are.   Like a frightened little rabbit.   Is that what you are?   My little bunny? And Jeremy gives him a little tickle under his chin. But Norman starts to cry.   Just a quick little jag.   Jeremy still fascinated, loving it, completely in control. JEREMY (CONT’D) What’s all this? NORMAN I’m sorry. JEREMY You’ve had a nice time, haven’t you? NORMAN Yeah. JEREMY Then why so sad? NORMAN No one’s ever been this kind to me. JEREMY (mimics him) No one’s ever been this kind to me, poor little bunny rabbit, waah. (as himself) Now don’t be silly, dry your eyes. Go on.   Wipe your face.   Let me see.   Shake it off.   Brr! NORMAN Brrr! JEREMY And again! NORMAN Brrr! JEREMY Much better. And the two of them laugh a little, in the dark. JEREMY (CONT’D) Now I’m going to kiss you, and you will enjoy it. And he leans in, and does.   On the lips.   A few seconds. Norman just... blank.   Numb.   They separate. English Scandal Ep.1 prod script amended 04th Dec   19. JEREMY (CONT’D) You could enjoy it a bit more. NORMAN ...I can’t. JEREMY Why not? NORMAN It’s wrong. Jermey slides his hand between Norman’s legs.   Smiles. JEREMY That’s not wrong. And Jeremy kisses him again, deep. And now Norman responds, returns the kiss, excited. Then Jeremy separates, businesslike, holding up the towel. JEREMY (CONT’D) Now.   We’ll need this.   Just in case.   And a good little helping of every bachelor’s friend. He takes hold of the Vaseline.   Norman bewildered. JEREMY (CONT’D) Hop on to all fours, there’s a good chap, that always works best, don’t you think?   Up you get, come on. NORMAN On the bed? JEREMY Yes, on the bed. Norman does so.   Jeremy taking off his dressing gown, pyjamas underneath.   Then he leans in, to whisper in Norman’s ear. JEREMY (CONT’D) And remember... He points at the wall. JEREMY (CONT’D) Mother’s room. CUT TO: INT. THE RITZ - DAY 35   35 BESSELL transfixed by the story. English Scandal Ep.1 prod script amended 04th Dec   20. BESSELL And then..? JEREMY We ",
      "dialogue_count": 0,
      "word_count": 1253
    },
    {
      "scene_number": 8,
      "slugline": "INT. JEREMY’S H.O.C. OFFICE - DAY 48   48 JEREMY at his desk, writing a letter, VOICEOVER as he writes: JEREMY V.O. ...I wasn’t going to say anything compromising but can’t stop myself saying I love you, and can’t wait to see you... It’s easy to love Norman in letters, but in life - CUT TO: INT. DRAYCOTT PLACE, ROOM - NIGHT 49   49 JEREMY swings the door open, his usual cry: JEREMY Bunny! Only to find NORMAN sitting there, crying, helpless. Jeremy: God, not again. CUT TO: INT. DRAYCOTT PLACE FLAT - DAY 49A   49A JEREMY dressing for the day ahead, but mid-row with NORMAN. NORMAN I’m left on my own all day! JEREMY For God’s sake, d’you realise how busy I am? NORMAN But what am I supposed to   do?!  CUT TO: INT. DRAYCOTT PLACE FLAT - NIGHT 49B   49B NORMAN finds this life bewildering.   In fast, hard cuts: Knocks back WINE. Knocks back WHISKY. CUT TO: English Scandal Ep.1 prod script amended 04th Dec   23.",
      "characters": [],
      "action_text": "* OMITTED 49C   49C   * INT. LONDON RESTAURANT - NIGHT 50   50   * Quiet, discreet.   JEREMY at a table for two.   Raises a toast.   * REVEAL he’s with a HANDSOME YOUNG MAN.   30 and smart.   * Because when Norman drives Jeremy mad - or when Norman just   * isn’t enough - Jeremy has other men to turn to.   * CUT TO:   * INT. DRAYCOTT PLACE, ROOM - NIGHT 51   51 NORMAN - insecure, lonely - knocks back more WHISKY. RED WINE. CUT TO: INT. DRAYCOTT PLACE, ROOM - NIGHT 52   52 Post-coital, JEREMY sits on the bed getting dressed, strapping up his SOCK SUSPENDERS.   Norman half-naked, lying on the bed, bleary, vague, soaked in booze, unhappy. JEREMY Maybe it’s time you thought about moving on.   Doing something with your life, what d’you think, Bunny? That dressage school, whatever happened to that? NORMAN That would be wonderful.   But I can’t.   It’s in France. CUT TO: INT. JEREMY’S H.O.C. OFFICE - DAY 53   53 JEREMY writing a letter.   Crucially, on HoC notepaper.   CU on the sentence being written out out.   As he writes, VOICEOVER: JEREMY V.O. ...Bunnies can (and will) go to France... CUT TO: English Scandal Ep.1 prod script amended 04th Dec   24.",
      "dialogue_count": 0,
      "word_count": 370
    },
    {
      "scene_number": 9,
      "slugline": "INT. DRAYCOTT PLACE, ROOM - NIGHT 54   54 JEREMY and NORMAN, in the middle of a furious row.   Norman’s in his coat, shoving things into his SUITCASE. English Scandal Ep.1 prod script amended 04th Dec   24A.",
      "characters": [],
      "action_text": "JEREMY What happened to bloody France?! NORMAN They said no!   But go on then, tell me, how is that my fault?! JEREMY I got you that job!   At the stables!   And you threw it away! NORMAN I told you!   It was that man, he was vile to me! JEREMY Dare I say, if you drank a little less and took fewer of those pills - NORMAN And why’s that?   Why d’you think I need them?!   Because of YOU!   And the things you’ve done to me! JEREMY What’s that supposed to mean? In the doorway: NORMAN You have infected me, Jeremy.   With the virus.   Of homosexuality! And clutching his suitcase, he storms out, SLAM! CUT TO: INT. THE RITZ - DAY 55   55 JEREMY and BESSELL on coffee & brandy, now. BESSELL Where did he go? JEREMY God knows. CUT TO: INT. DRAYCOTT PLACE FLAT - NIGHT 55A   55A SLAM!   NORMAN’s sc.54 exit, now seen from the OTHER SIDE OF THE DOOR, the hallway outside the flat.   Norman, in his coat, and with his SUITCASE, slamming the door.   Storming off. English Scandal Ep.1 prod script amended 04th Dec   25. (This NIGHT now continues, a continuation of events, IE, stepping out of Jeremy’s narrative to Bessell and showing events in sc.58-63 that Jeremy, in 1965, isn’t yet aware of.) CUT TO: OMITTED 56   56 OMITTED 57   57 INT. POLICE STATION, FRONT DESK - NIGHT 58   58 NORMAN - upset, still bristling with anger - slams his precious SUITCASE down on the desk.   To the SERGEANT: NORMAN I have come to tell you about my homosexual relations with Jeremy Thorpe, MP. CUT TO: INT. POLICE STATION, INTERVIEW ROOM - NIGHT 59   59 A cold white-tiled box.   NORMAN sits opposite D.I ROBERT HUNTLEY and D.S. EDWARD SMITH.   Huntley writing down everything Norman says.   The police impassive, professional. NORMAN ...I was a victim.   Of his lust. And appetites.   And if you ask me why it’s taken me so long to come to the police, then all I can say is, I was in thrall to the man. That’s my explanation.   In thrall. JUMP CUT TO Norman taking A LARGE WHITE ENVELOPE out of his SUITCASE, containing",
      "dialogue_count": 0,
      "word_count": 502
    },
    {
      "scene_number": 10,
      "slugline": "INT. POLICE STATION, OFFICE - DAY 60   60 The next day.   D.I. HUNTLEY sits at his desk.   Puffs his cheeks, bemused.   Blimey.   What a story!   Starts to type. And as he types, SCENES 60-63 are linked together by fast, fierce MUSIC, like the Sc.32 Dinicu music: a sequence, showing the path of the report from desk to desk. CU TYPEWRITER, letter by letter, spelling: JEREMY THORPE. CU the REPORT, with Norman’s TWO LETTERS attached by paperclip, Huntley sliding them into an INTERNAL ENVELOPE. Envelope being handwritten: C. Fairfax, Scotland Yard. RED DATE STAMP, 19 December 1962, THUMP! CUT TO: INT. SCOTLAND YARD - DAY 61   61 Music continues. CAPTION: SCOTLAND YARD. C. FAIRFAX tips out the ENVELOPE; the TWO LETTERS. Reading it, he puffs his cheeks.   Blimey. THE TWO LETTERS shoved back into the INTERNAL ENVELOPE. Envelope being handwritten: J.J. Blaine, Special Branch. RED DATE STAMP: 20 December, 1962, THUMP! CUT TO: INT. SPECIAL BRANCH - DAY 62   62 Music continues. CAPTION: SPECIAL BRANCH J.J. BLAINE reading the report, puffs his cheeks.   Blimey. INTERNAL ENVELOPE being handwritten: T. SIMPSON, Box 500. RED DATE STAMP: 21 December, 1962, THUMP! CUT TO: INT. M.I.5 - DAY 63   63 Music continues. English Scandal Ep.1 prod script amended 04th Dec   27.",
      "characters": [],
      "action_text": "CAPTION: M.I.5 T. SIMPSON reads the report, puffs his cheeks, blimey. He shoves THE TWO LETTERS back into the ENVELOPE. Leaves his desk, carrying the envelope, going to... A SAFE.   T. Simpson puts the Thorpe envelope inside, and... SLAM!   Music ends. CUT TO: INT. THE RITZ - DAY 64   64 JEREMY innocent of the above sequence, with BESSELL, who’s now lit up a cigarette. JEREMY God knows what he got up to.   I thought I was rid of him, then out of the blue, that! (the letter) To mother.   Telling her everything. BESSELL Did she believe it? JEREMY Of course not. CUT TO: INT. URSULA’S HOUSE - DAY 65   65 HALLWAY.   URSULA hands JEREMY the 17-PAGE LETTER.   She’d use tongs, if she could.   Staring at her son, knowing it’s true. Jeremy takes the letter, for once in his life ashamed. CUT TO: OMITTED 66   66 OMITTED 67   67 OMITTED 68   68 OMITTED 69   69 English Scandal Ep.1 prod script amended 04th Dec   28.",
      "dialogue_count": 0,
      "word_count": 371
    },
    {
      "scene_number": 11,
      "slugline": "INT. THE RITZ - DAY 70   70 JEREMY (of the letter) Now he says he’s taken rooms, in Dublin, under the care of a Father Sweetman.   And this is where you come in, Besselli. BESSELL Good God.   Doing what exactly? JEREMY You can take that thing - He hands over the the 17-PAGE LETTER.   Bessell pockets it. JEREMY (CONT’D) - and confront him.   In Dublin.   I can’t put anything in writing, so I need you to see him in person and warn him off, and I mean seriously, go and put the shits up him, the little sod.   Tell him this amounts to blackmail, and he’ll have the full weight of the law upon his head if he ever tries anything like this again.   And make it very clear: he is not to contact me. Ever.   He is not to talk about our previous association, in any shape or form.   And he is not to write to my mother describing acts of anal sex under any circumstances whatsoever. CUT TO: EXT. IRISH COUNTRY LANE - DAY 71   71 The land between airport and city.   A TAXI tootles along. INT CAR: BESSELL sits in the back.   A man on a mission. CUT TO: EXT. DUBLIN HOTEL - DAY 72   72 A small, ramshackle hotel on the outskirts.   As the TAXI drives away, Bessell heads inside.   Disgruntled, out of place; this is a man who prefers the finer things. CUT TO: English Scandal Ep.1 prod script amended 04th Dec   29.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 249
    },
    {
      "scene_number": 12,
      "slugline": "INT. DUBLIN HOTEL, RECEPTION - DAY 73   73 Small, homely, dark-wood reception, BESSELL signing in, a little disdainful.   A MALE RECEPTIONIST on duty. BESSELL ...his name’s Norman Josiffe, I’ve asked him to meet me here at 8 o’clock, so it’s imperative.   You must let me know when he arrives. CUT TO: INT. DUBLIN HOTEL, BEDROOM - EVENING 74   74 Tiny room.   BESSELL sitting on the single bed.   Hating the sheets, the awful eiderdown, the thin pillow, everything. And he’s fed up, looking at his watch.   Norman’s late! CUT TO: OMITTED 75   75 EXT. TELEPHONE BOX, IRELAND - NIGHT 76   76 Rain.   BESSELL cold, cross, huddled in the box.   Bad line. BESSELL ...I called yesterday, for Norman? Norman Josiffe?   Is he there?   Mr Norman Josiffe, J-O-S-I-F-F-E... CUT TO: INT. DUBLIN HOTEL, BEDROOM - NIGHT 77   77 BESSELL in his PYJAMAS, getting into bed.   This godforsaken place.   And that godforsaken man, damn Norman! He switches off the light, CLICK! CUT TO: EXT. DUBLIN HOTEL - DAY 78   78 BESSELL, cross and frazzled, carrying his case to the waiting TAXI, when he sees... A MAN at a distance, heading his way.   Expensive coat, but crumpled.   Handsome, but looks like he’s been out all night. BESSELL ...Norman? English Scandal Ep.1 prod script amended 04th Dec   30.",
      "characters": [],
      "action_text": "NORMAN Mr Bessell, I take it? BESSELL I was expecting you last night. For goodness’ sake, this is highly inconvenient, I waited for a very long time. NORMAN I think you’ll find, Mr Bessell, that I’m not at your beck and call. You might be a Member of Parliament, but that gives you no authority in Ireland, and certainly none over me.   Now what d’you want? Bessell thrown, because Norman - outside Jeremy’s telling of the story - is sharper, cleverer than he expected. BESSELL Problem is...   I’ve got to go home, I only had the one night, so... You’ll have to come with me.   To the airport, so I can have a word en route.   In you get, chop chop! CUT TO: INT. TAXI/EXT. IRISH COUNTRY LANES - DAY 79   79 FIVE MINUTES LATER.   NORMAN & BESSELL in the back.   Norman bristling.   Bessell aware of the driver.   Who’s listening. BESSELL My friend and colleague - (indicates the driver) “JT” insists that you cease and desist from contacting - NORMAN Tell Jeremy Thorpe I don’t care! BESSELL JT!   Insists!   That you stop harrassing him and his mother - NORMAN Jeremy Thorpe can say whatever he wants - BESSELL JT, JT, JT!   JT demands!   That you stop!   Or he will take legal action against you.   I have here, in this case, an extradition order from the Home Secretary. (MORE) English Scandal Ep.1 prod script amended 04th Dec   31. If you don’t stop, this order will be issued and you will be taken back to the United Kingdom.   To face trial! NORMAN Show me. BESSELL ...what? NORMAN The extradition order.   Show me. BESSELL It’s in here. NORMAN Show me. Bessell’s lying, there is no order.   Instead, he sighs, backs down.   He’s nicer, more honest, and the whole car calms down. BESSELL You wrote to his mother, Norman. You can understand why he’s so cross, can’t you?   His own mother. Norman quieter, regretful. NORMAN S’pose it was a bit much. Silence.   They bump along.   Then quietly: NORMAN (CONT’D) He loved me.   He said so.   He wrote me a letter, it said, ‘I want to live on a farm ",
      "dialogue_count": 0,
      "word_count": 2444
    },
    {
      "scene_number": 13,
      "slugline": "INT. HOUSE OF COMMONS, STAIRCASE - DAY 101   101 LEO ABSE, nervous, trotting along with the Lord Chancellor, LORD KILMUIR, 67, stern. LORD KILMUIR I will refuse to sit in any Cabinet meeting where this filthy subject is even being discussed.   We would be licencing buggers’ clubs. CUT TO: INT. JEREMY’S H.O.C. OFFICE - NIGHT 101A   101A Sc.99 continued, JEREMY with BESSELL. BESSELL Difficult.   To ally oneself with that problem in particular. JEREMY You know Leo.   No stopping him. CUT TO: OMITTED 102   102 OMITTED 103   103 INT. HOUSE OF COMMONS, CENTRAL LOBBY - DAY 104   104 LEO But then finally, I found someone to help me.   Lord Arran. JEREMY Boofy. LEO Boofy! CUT TO: INT. LORD ARRAN’S MANSION, ENTRANCE HALL - DAY 105   105 LORD ARRAN Call me Boofy! Shaking LEO’s hand as he leads him in.   ARRAN’s 56, short, red-faced, white hair.   Wearing GUMBOOTS.   The mansion’s splendid but ramshackle.   Arran points to some more boots. English Scandal Ep.1 prod script amended 04th Dec   42.",
      "characters": [],
      "action_text": "LORD ARRAN (CONT’D) What size are you? LEO Size eight, why? LORD ARRAN You need boots.   To protect the ankle.   In case they get in. LEO In case who gets in? LORD ARRAN Badgers! English Scandal Ep.1 prod script amended 04th Dec   42A. CUT TO: INT. HOUSE OF COMMONS, CENTRAL LOBBY - DAY 106   106 JEREMY Badgers? LEO Conservation mad.   Anyway! CUT TO: INT. LORD ARRAN’S MANSION - DAY 107   107 LORD ARRAN ploughing through his collection of BOOTS. LORD ARRAN Eight, eight, eight.   There’s a cat- flap in the kitchen, in they come. And they bite, the little buggers. Give you tuberculosis! COUNTESS OF ARRAN And ringworm! She’s passing through, with a trug.   Jolly as can be. LORD ARRAN Terrible ringworm!   Fiona, this is Leo, Leo, this is Fiona, we’re celebrating, she’s just achieved speeds of 81.65 miles per hour across Lake Windermere. LEO I’m sorry..? CUT TO: INT. HOUSE OF COMMONS, CENTRAL LOBBY - DAY 108   108 LEO Turns out, the Countess of Arran is a champion powerboat racer. JEREMY Good Lord. CUT TO: English Scandal Ep.1 prod script amended 04th Dec   43.",
      "dialogue_count": 0,
      "word_count": 352
    },
    {
      "scene_number": 14,
      "slugline": "INT. LORD ARRAN’S MANSION - DAY 109   109 THE COUNTESS shakes a jolly fist at LEO, beaming. COUNTESS OF ARRAN That bloody Donald Campbell, I’ll catch him!   The devil! LORD ARRAN Now.   Boots.   Badgers.   I must show you the wallabies later.   What else?   Oh yes.   Queers! CUT TO: INT. LORD ARRAN’S MANSION, DINING ROOM   - DAY 110   110 An empty, echoing room, with a long, grand table.   LEO with LORD ARRAN, who’s having a whisky, and the COUNTESS OF ARRAN, who’s peeling and coring cooking apples.   All in BOOTS. They also have a MACAW, suspended in a cage. LEO ...but thank God for your support, Boofy.   People are starting to listen, at last. LORD ARRAN It puzzles me.   Why the heterosexual man should be so relentless in his attack. COUNTESS OF ARRAN We’ve had some dreadful letters. Full of bile, quoting Deuteronomy and Leviticus.   No one ever mentions the Sermon on the Mount. LORD ARRAN I was sent shit!   A parcel of shit. Shit in the post.   Human shit.   My secretary thought it was pâté, she said, ‘I threw it away, Lord Arran, it wouldn’t keep.’ They laugh, but the Countess is worried: COUNTESS OF ARRAN What chance d’you think we stand? LEO It’s not the most popular of causes.   But the world is changing, every day, we gain more votes. English Scandal Ep.1 prod script amended 04th Dec   44.",
      "characters": [],
      "action_text": "LORD ARRAN Not fast enough for some.   Oh goodness me. Because he’s suddenly brimming with tears.   Gets out a hanky. COUNTESS OF ARRAN Sweetheart. LORD ARRAN I’m fine. Leo just waits. LORD ARRAN (CONT’D) You might wonder.   Why an old kidney like me would help you.   But I’ve seen what the law does. (pause) My brother.   The Seventh Earl. COUNTESS OF ARRAN Queer as springtime. CUT TO: INT. CHAPEL OF REST - DAY 111   111 SILENT IMAGES to layer into a Sc.113 CU of LORD ARRAN. A small, cold room.   Pauly Gore, the Seventh Earl, laid out; A VICAR and an UNDERTAKER lead LORD ARRAN in.   The body just foreground, a blur; his hand. On Lord Arran.   This funny, fierce man crying his heart out. Boofy holds his brother’s hand, one last time.   Over this: CUT TO: OMITTED 112   112 INT. LORD ARRAN’S MANSION, DINING ROOM - DAY 113   113 These images of grief layered into quiet dignity: LORD ARRAN When we were children.   In the nursery.   I’d reach out.   Every night.   Hold his hand until he slept.   Such a clever boy.   He translated the Three Musketeers, did you know?   Penguin Classic. (pause) And the deaths go on. (MORE) English Scandal Ep.1 prod script amended 04th Dec   45. By hanging, by poison, by gas.   Men killing themselves out of fear and shame, and I don’t think it’s suicide, I think it’s murder, they are murdered by the laws of the land.   And I think it’s time it stopped. CUT TO: INT. HOUSE OF COMMONS, CENTRAL LOBBY - DAY 114   114 The bustle around them reduced to a BLUR now.   LEO intense, to JEREMY, as though Leo is concluding Arran’s speech: LEO Now we stand in a unique position. To change the law.   And save their lives.   Have I got your vote? CUT TO: INT. JEREMY’S H.O.C. OFFICE - NIGHT 115   115 BACK TO JEREMY with BESSELL, in the dark.   Hushed, intimate. Leo’s question suspended in the air.   Hold the pause, then... BESSELL ...what did you say? JEREMY I said yes.   Of course I said yes. Good God, what sort of man do you think I am? BESSELL Astonishing t",
      "dialogue_count": 0,
      "word_count": 1093
    },
    {
      "scene_number": 15,
      "slugline": "INT. MIKE STEELE’S OFFICE - DAY 118B   118B JEREMY in front of MIKE STEELE’s desk. JEREMY Tell me, how d’you think it would affect our ratings in the polls if I were to get married? MIKE STEELE Gosh.   Well, it could do you some good, people don’t trust a bachelor.   We might go up... two per cent? JEREMY Really?   How about five?   Let’s say five.   Five per cent it is! CUT TO: INT. MEMBERS’ DINING ROOM - NIGHT 118C   118C JEREMY & BESSELL continued from Sc.118A. BESSELL There’s one obvious problem. JEREMY I’ll close my eyes.   Grit my teeth. Then after a few months, I’ll just say I’m tired and old and impotent, darling, and that’ll be that. BESSELL What about the men? JEREMY What men? A cold glint from Jeremy.   Bessell backs down. BESSELL All the same.   If she’s not going to complain...   You’ll need to find a girl who’s led a sheltered life. JEREMY That’s what I’ll do.   And I’ll make her the luckiest girl in the world. Let the hunt begin! CUT TO: English Scandal Ep.1 prod script amended 04th Dec   49.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 186
    },
    {
      "scene_number": 16,
      "slugline": "INT. BOUTIQUE, DUBLIN - DAY 119   119 Ting!   A shop bell. English Scandal Ep.1 prod script amended 04th Dec   49A.",
      "characters": [],
      "action_text": "NORMAN walks in.   It’s a cool little boutigue, full of 60s fashions.   Norman’s just mooching.   Nice and calm. A distance away, behind the counter, LYN.   Irish, 30, tall, very stylish, the height of 60s style. She smiles. JUMP CUT: NORMAN and LYN now together, full of fun, in front of a full- length mirror, Norman holding a jacket, loving this. NORMAN You see, it’s the lining, the lining makes it look cheap, but if you made it scarlet, or mustard, the whole thing would come alive. LYN Oh my God, you’ve got quite an eye. (flirting) Mind you.   You’re one of those very lucky men.   You look good in anything. And as she holds his stare... CUT TO: INT. DRESSING ROOM, BOUTIQUE, DUBLIN - DAY 119A   119A NORMAN & LYN snogging, frantic, fun.   He’s a bit surprised: NORMAN Oh my goodness. But what the hell, he goes for it!   And as Norman finds himself with a girlfriend, then back in England... CUT TO: INT. JEREMY’S DEVON HOUSE - DAY 119B   119B JEREMY sits with his wife, CAROLINE, facing the press. Born Caroline Alpass, she’s 29, Roedean & finishing school, delightful and delicate.   She sits with her new husband in the Thorpes’ new home, a large 17th Century thatched cottage in Cobbaton, North Devon.   They’re both facing a WALL OF PHOTOGRAPHERS, 20 at least, all snapping away, MIKE STEELE with JOURNALISTS at the back of the room. Jeremy & Caroline talk to the cameras.   She’s holding out her wedding ring, the cameras snap and flash ferociously. English Scandal Ep.1 prod script amended 04th Dec   50. JEREMY We tried to keep the wedding day secret.   But you lot outfoxed us. CAROLINE I had the devil’s work talking him into a honeymoon.   Jeremy’s always so busy. He takes her hand.   Genuine affection. JEREMY Not any more.   I must say.   What started as a dalliance has turned into something quite wonderful. And the cameras CLICK and FLASH! CUT TO: INT. PHOTOGRAPHER’S STUDIO, DUBLIN - DAY 120   120 CLICK!   FLASH!   CLICK!   CAMERA firing. NORMAN the MODEL.   Wearing the ",
      "dialogue_count": 0,
      "word_count": 689
    },
    {
      "scene_number": 17,
      "slugline": "EXT. JEREMY’S DEVON HOUSE - DAY 123B   123B A CAMERA goes FLASH! Blinking in the flash: a BABY. WIDER.   JEREMY, with CAROLINE cradling their son RUPERT. They smile, posing for a family photo, and FLASH! WIDER.   They’re surrounded by lighting umbrellas and gear, posing for photos. It’s a proper shoot for the papers, with a LONDON PHOTOGRAPHER.   MIKE STEELE and FEMALE JOURNALIST standing in b/g.   As the photographer adjusts the lights: MIKE STEELE Fast as we can, thanks.   Don’t want to get cold. JEREMY It’s fine.   We’re perfectly happy. Isn’t that right? Said to the baby as Jeremy lifts him into his arms.   An intimate moment between the family, everyone else excluded. CAROLINE Careful. JEREMY I’ve got him. CAROLINE He’s a bit sleepy this morning. JEREMY Can’t have that.   Little chap. There’s a whole world to see. (kisses her forehead) Well done, you. CAROLINE Celia said she’d pop in later. JEREMY She’ll have a fight on her hands. Taking him off me. (adoring the baby) Rupert the Bear.   Hello.   Hello. PHOTOGRAPHER 2 Mr Thorpe? English Scandal Ep.1 prod script amended 04th Dec   53.",
      "characters": [],
      "action_text": "And Jeremy switches from intimate to camera-ready in a second, the baby in his arms, FLASH! CUT TO: INT. DEVON HOUSE, KITCHEN - NIGHT 123C   123C   * CAROLINE tidying up, JEREMY about to excuse himself.   Radio 2   * playing softy in the background from an old wireless.   * Stranger on the Shore, Acker Bilk.   * JEREMY   * I’ll say goodnight.   * But she takes hold of his hand.   * CAROLINE   * Not till you’ve danced with me.   * And she turns the music up.   He’s a terrible dancer, stiff,   * awkward, and yet loving this moment.   * JEREMY   * I absolutely refuse.   * CAROLINE   * Oh, but I insist.   * JEREMY   * You’ll wake up the baby.   * CAROLINE   * He’d be delighted for us.   * But all of that’s just throwaway chat, really, as Jeremy   * reluctantly, but happily, dances a little.   A quiet, intimate   * picture of a couple in love.   Contrasted with...   * CUT TO:   * OMITTED 123C   123C INT. SECOND COOL 60S PARTY - NIGHT 123D   123D Another party - darker, this one, smokier, bit grungier and wilder, as Norman’s life starts to spiral downwards.   He’s talking to GUESTS, but a bit drunk, a bit arrogant. NORMAN Well.   I may be from Bexleyheath. But my mother became pregnant while abroad.   Mysteriously.   So my father could be anyone... CUT TO: English Scandal Ep.1 prod script amended 04th Dec   54.",
      "dialogue_count": 0,
      "word_count": 416
    },
    {
      "scene_number": 18,
      "slugline": "INT. PHOTOGRAPHER’S STUDIO - DAY 123E   123E Norman, modelling SAFARI SUITS, but a bit worse for wear. LUKE Concentrate, Norman.   Look at me. You been having too much fun? CUT TO: INT. SECOND COOL 60S PARTY - NIGHT 123F   123F NORMAN knocking back a handful of PILLS. JUMP CUT TO Norman talking to GUESTS, drunker: NORMAN It’s entirely possible.   Between you and me.   I could be royalty. CUT TO: INT. PHOTOGRAPHER’S STUDIO - DAY 123G   123G Norman now modelling swimwear.   Bleary.   Photographer tetchy. English Scandal Ep.1 prod script amended 04th Dec   54A.",
      "characters": [],
      "action_text": "LUKE Can we get some make up?   Under his eyes?   Come on!   Hurry up! LYN, standing at the back of the studio, angry, fed up. CUT TO: INT. SECOND COOL 60S PARTY - NIGHT 123H   123H NORMAN out of it, dancing, alone, smoking a joint. CUT TO NORMAN, drunk, with a MAN. NORMAN I am a prince.   And you are my serf. And bang, he’s snogging him, wrapping himself around him. CUT TO: INT. PHOTOGRAPHER’S STUDIO - DAY 123I   123I Norman, in some fun, colourful shoot with BRIGHT CLOTHES and a FEATHER BOA, looks ghastly.   Red-eyed.   Shaky. The photographer lowers his camera. LUKE I can’t do anything with this.   You look shit. CUT TO: OMITTED 124   124 OMITTED 125   125 OMITTED 126   126 OMITTED 127   127 OMITTED 128   128 EXT. DUBLIN STREET - DAY 129   129 NORMAN, desperate, trotting along to keep up with LYN. English Scandal Ep.1 prod script amended 04th Dec   55. NORMAN But I said I’m sorry! LYN You were late, three times in a row and then Tuesday, you didn’t even turn up!   I’m sorry, Norman, you’re off the books. CUT TO: EXT. BOUTIQUE, DUBLIN - DAY 129A   129A NORMAN banging on the door.   But it’s locked. LYN appears, within.   Cold.   Turns the SIGN on the door. CLOSED. CUT TO: OMITTED 130   130 OMITTED 131   131 OMITTED 132   132 OMITTED 133   133 OMITTED 134   134 OMITTED 135   135 OMITTED 136   136 OMITTED 137   137 OMITTED 138   138 OMITTED 139   139 OMITTED 140   140 INT. JEREMY’S DEVON HOUSE - DAY 141   141 RAIN against the windows.   The house drumming under rainfall. Pressure from outside, cocooning the domestic bliss of CAROLINE THORPE and BABY RUPERT, inside the house. English Scandal Ep.1 prod script amended 04th Dec   56. She’s just putting the baby in his cot, when... The PHONE RINGS. A beautiful white Bakelite phone.   On its own table. Ring ring. Caroline doesn’t hurry.   She heads towards the phone, but picks up a stray jumper, folds it, puts it down. Ring ring. Now, Caroline approaches. Ring ring. She picks it up. CAROLINE Cobbaton 263? Beep-beep-beep, ",
      "dialogue_count": 0,
      "word_count": 1205
    }
  ]
}