{
  "slug": "a-very-english-scandal-103-episode-1-3-2018",
  "title": "a very english scandal 103 episode 1 3",
  "genre": "thriller",
  "format": "series",
  "scenes_count": 9,
  "characters_count": 0,
  "characters": [],
  "total_words": 13306,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. POLICE CAR - NIGHT 1   1 Driving through the night. TWO CONSTABLES in the front, silent, grim.   In the back, NORMAN.   Shaken, scared.   He is covered in DOG’S BLOOD. CUT TO: OMITTED 2   2 OMITTED 3   3 OMITTED 4   4 OMITTED 5   5 INT. MINEHEAD POLICE STATION, INTERVIEW ROOM - NIGHT 6   6 NORMAN, exhausted, still covered in blood, faces the TWO CONSTABLES.   Going over it for the fifth time: NORMAN I’m sorry.   But it’s true.   I had a homosexual relationship with Jeremy Thorpe, and if anybody wants to see me dead, then it’s him   - ...breaking off, puzzled, as the taller CONSTABLE, smiling, stands, beckons with a crooked finger for Norman to follow. NORMAN (CONT’D) What? He’s beckoning Norman over to the wall.   Norman disconcerted, but he’s obedient, follows.   Like it’s a secret conversation: CONSTABLE Now tell me that again. NORMAN I had an affair with Jeremy Thorpe - The Constable grabs Norman’s head, bangs it against the wall. CONSTABLE Jeremy Thorpe (bang) Is a Member of Parliament (bang) And a highly respected man (bang)  (MORE)",
      "characters": [],
      "action_text": "He is not (bang) To be abused (bang) By a lying little queer. CUT TO: INT. MINEHEAD POLICE STATION, FRONT DESK - DAY 7   7 Early morning.   YOUNG POLICEMAN on duty as EDNA FRIENDSHIP arrives.   To the rescue!   Bristling, NOTEBOOK in hand. EDNA My name is Mrs Edna Friendship, and I’m here about Norman Scott. YOUNG POLICEMAN I’m afraid we’re not allowing any - EDNA Mr Scott’s would-be assassin is in his early 30’s, with brown hair, and a moustache.   On Sunday the 12th of October, said gentleman was seen in the vicinity of the Market Inn, Barnstaple, wearing a red rally jacket and driving a yellow Honda, registration 589 LFT.   Now   * you can stay on the front desk all your life sonny, or you can pass this information on and get yourself promoted, which is it to be? CUT TO: EXT. BLACKPOOL STREET - DAY 8   8 ANDREW NEWTON and GIRLFRIEND head for the YELLOW HONDA.   With SUITCASES.   Hurried, like they’re going on the run, but... A POLICE CAR is pulling up, opposite.   Newton stashes the cases, fast.   A DETECTIVE INSPECTOR and POLICEMAN get out. DETECTIVE INSPECTOR Mr Andrew Newton..? ANDREW NEWTON Maybe I am. And he starts to swagger over to the policemen. Then he does a little dummy feint, to the side, like he’s going to run, both the D.I. and policeman feint to the side too, then stop, ha ha funny, Newton smiling, like gotcha. CONSTABLE (CONT'D) English Scandal Ep.3 prod script amended 8th Nov   2. And then ZOOM!   He really runs!   Pelts down the street! Police following! CUT TO: OMITTED 9   9 EXT. HOUSE OF COMMONS, COURTYARD - NIGHT 10   10 JEREMY and DAVID HOLMES have found a quiet corner, outside. Secretive.   DAVID HOLMES helpless, the bearer of bad news. JEREMY furious, dismayed, only just holding it together. DAVID They’ve arrested Andrew Newton. But we can trust him, he’s kept your name out of it, he’s said that Norman Scott tried to blackmail him when he went looking for... ladies’ services.   In a magazine.   Newton will say he got angry, shot the dog, i",
      "dialogue_count": 0,
      "word_count": 1473
    },
    {
      "scene_number": 2,
      "slugline": "INT. ORME SQUARE, DINING ROOM - DAY 17   17 MARION looks up from THE SUNDAY TIMES.   A terrible stare. MARION Bunnies? JEREMY sits opposite,   Porridge abandoned.   Seven-year-old RUPERT is also at the table, eating toast. JEREMY Rupert darling, I want you to take that piece of toast and eat it in your bedroom, there’s a good boy. Rupert heads off.   JEREMY quailing, as Marion reads on. CUT TO: OMITTED 18   18 INT. MARKET INN, BARNSTAPLE - DAY 19   19 Empty pub, EDNA joined by NORMAN in his pyjamas. EDNA “Bunnies can and will go to France, yours affectionately, Jeremy Thorpe.   P.S., I miss you.” (looks at Norman) So you’re Bunnies, Norman? NORMAN That was my nickname. (sad smile) I liked it. CUT TO: OMITTED 20   20 OMITTED 21   21 OMITTED 22   22 INT. ORME SQUARE, DINING ROOM - DAY 23   23 MARION now smoking a cigarette, as JEREMY explains. JEREMY Technically he was Bunny, singular. English Scandal Ep.3 prod script amended 8th Nov   8.",
      "characters": [],
      "action_text": "MARION Then why did you say Bunnies?   Were there two of you?   Are you a Bunny? Am I married to a Bunny? JEREMY No, I was using a generic noun in an imperative clause. MARION Well thank God it’s grammatically correct.   Because the whole country is reading this!   Bunnies! And she folds the paper shut, slams it down. CUT TO: OMITTED 24   24 INT. ORME SQUARE - NIGHT 25   25 Time has passed.   The end of the next day.   The flat DARK. JEREMY returns home.   Heavy hearted.   Shadows around him. He removes his coat.   As meticulous as ever.   Taking his time.   Aware of MARION, a distance away.   Waiting, then: JEREMY I saw David Steel.   Handed him my letter.   I have resigned as Leader of the party. (pause) One bloody word brought me down. MARION No.   It wasn’t Bunnies.   It’s because you lied, you told the party you hardly knew Norman Scott, then the Bunnies letter caught you out.   From that moment on, your position was untenable.   Now, Rupert’s with Alison and James, I packed that little case of his, they said he could stay the night. So that you and I can talk.   About everything.   I’ve made cod in parsley sauce. And she walks through, expecting him to follow. CUT TO: English Scandal Ep.3 prod script amended 8th Nov   9.",
      "dialogue_count": 0,
      "word_count": 385
    },
    {
      "scene_number": 3,
      "slugline": "INT. ORME SQUARE, DINING ROOM - NIGHT 26   26 JEREMY and MARION sit with their dinner.   It’s tough, tense, but honest.   Or as honest as Jeremy gets.   But both stay clipped and tight, with huge emotions swelling underneath. JEREMY Before I met you.   Before I met Caroline.   I had... moments. Selected nights.   Unfortunate nights.   Involving alcohol.   And with no women in the vicinity, I would... dabble.   To relieve myself.   And that’s all. MARION So this thing with Norman Scott. It wasn’t a relationship? JEREMY How could it be? MARION Jeremy.   I’m not a fool.   I practically grew up with Benjamin Britten, I’ve seen something of the world.   I fled from Hitler, for God’s sake.   My own son married a hippy in a yurt.   And I’ve toured with orchestras, I couldn’t begin to tell you the things I’ve seen. So there’s no need to protect me. JEREMY I made mistakes.   I have stopped. (more passionate) And I swear, I had nothing to do with that gun, and the dog - MARION - of course you didn’t, I know that - JEREMY (CONT'D) - it was nothing to do with me - MARION - Jeremy, I’m not even asking.   I won’t dignify it with discussion. And that’s an end to it. JEREMY Thank you. MARION For what it’s worth.   I think people have focused on the word Bunnies.   But the last thing you wrote in that letter was, ‘I miss you.’ (pause) (MORE) English Scandal Ep.3 prod script amended 8th Nov   10.",
      "characters": [],
      "action_text": "I think that’s a wonderful thing for a man to say to his friend. And that kills him: kindness.   For a second, he could lose it.   Shaken to the core.   He could tell her everything, now. But he controls himself. MARION (CONT’D) Are you all right? He nods.   Pause. JEREMY It’s a very nice dinner. MARION Thank you. Happier now, rebuilding: JEREMY I suppose...   This is a new start. I’m still a Member of Parliament, there’s work to be done.   And the party could do with a change in leadership.   There’s so much new blood coming in.   Clement Freud. Cyril Smith.   Exciting times. MARION And what about Norman Scott?   Are we finished with him? JEREMY Absolutely.   Damn him.   But there’s nothing more he can do. CUT TO: EXT. PRESTON PRISON - DAY 27   27 The PRISON GATE swings open. And ANDREW NEWTON steps out.   A free man.   Clutching a sad little bag of belongings.   He walks forward, across the tarmac, expecting someone.   And waiting for him... STUART KUTTNER, early 30s, confident.   A journalist.   Waiting by his car, now striding forward for a handshake. STUART Mr Newton?   Stuart Kuttner, Evening News.   We meet at last! MARION (CONT'D) English Scandal Ep.3 prod script amended 8th Nov   11. ANDREW NEWTON Longest 12 months of my life.   I warn you, I want £75,000 for my story, I’m bloody Watergate, I am. STUART I can give you 3,000, tops.   Deal? ANDREW NEWTON Deal. CUT TO: INT. DESK - DAY 28   28 SLAM!   A copy of the London Evening News lands on a desk, Wednesday 19 October 1977, headline: I Was Hired to Kill Scott.   Exclusive.   Gunman Tells of Incredible Plot. CUT TO: EXT. ORME SQUARE - DAY 29   29 NOISE, JOURNALISTS, WILD, microphones, cameras, yells, POLICE holding back the CROWD.   Questions being yelled, ‘What do you know about this?’   ‘Do you know Andrew Newton?’   ‘What do you know about the gunman and the dog?’ as JEREMY battles on, trying to get home.   He no longer greets them by name. CUT TO: INT. HOUSE OF COMMONS, CORRIDOR - DAY 30   30 JEREMY stri",
      "dialogue_count": 0,
      "word_count": 961
    },
    {
      "scene_number": 4,
      "slugline": "INT. BESSELL’S OCEANSIDE HUT - DAY 33   33 BESSELL sits with DIANE KELLY next to him.   D.C.S. CHALLES and D.S. GREENOUGH facing them, surrounded by files and papers.   They have coffee, and the hut is OPEN to the sun; but it’s like a pocket of dark, secretive England in here. D.C.S CHALLES I need to ask you, Mr Bessell, would you cooperate in bringing a case against Jeremy Thorpe? Specifically, would you appear in court, as a witness? BESSELL For the prosecution? D.C.S CHALLES Yes, sir. BESSELL You’ll be fully aware that Jeremy Thorpe is a very good friend of mine.   I would go so far as to say, my best friend.   And a bloody good M.P. to boot... But Bessell he breaks off, genuinely unwell.   Diane passes him a pill, and water, stays close, supportive. BESSELL (CONT’D) Sorry.   Not been well. D.C.S CHALLES Of course.   And I respect your position.   But we have a letter here, concerning the relationship between Mr Scott and Mr Thorpe - BESSELL You mean the Bunnies one?   It’s nothing, Bunnies, you people don’t realise, public schools run on nicknames, everyone I know is a Bunny or a Beano or a Biffo - D.C.S CHALLES I don’t mean Bunnies.   I mean   this . And Bessell’s horror, Challes hands over... The 17-PAGE BLUE NOTEPAPER LETTER, from Norman to Ursula. D.C.S CHALLES (CONT’D) A letter from Norman Scott to Jeremy Thorpe’s mother.   17 pages, describing his explicit relationship with her son. (MORE) English Scandal Ep.3 prod script amended 8th Nov   14.",
      "characters": [],
      "action_text": "(more letters) And these.   And these.   Letters from Scott.   To you, Mr Bessell. Detailing money which you paid to him, as a retainer.   Regular payments.   Over many years. BESSELL ...where did you find them? D.C.S CHALLES Exactly where you left them.   From your office, they went to the Sunday Mirror, from them, to us, and I get a trip to California as a result, so thank you for that. The shock has left Bessell alarmed, a bit breathless.   And Diane’s taken the letters, leafing through them, scared. DIANE KELLY Peter, your name’s all over this. He just nods.   Under pressure from all sides; his girlfriend, the police, the truth itself. DIANE KELLY (CONT’D) You need to ask for immunity. You need a lawyer, and you need immunity, right now. D.C.S.CHALLES We’ve agreed to consider immunity. If you speak up. DIANE KELLY This is exactly what your wife said.   She said Thorpe would fall one day and he’d take you with him. D.C.S CHALLES I’m asking that you put aside that old pals’ act, for something more important.   The truth. Bessell hesitant.   But crumbling. BESSELL You must respect...   I have a sense of duty.   Towards Jeremy. Pause.   Bessell’s old pomposity rising.   And also his vanity; reduced to living in a hut, he can now be a hero. BESSELL (CONT’D) But beyond that.   I have a greater duty.   To England.   And to justice. D.C.S CHALLES (CONT’D) English Scandal Ep.3 prod script amended 8th Nov   15. A gleam in Challes’s eye: he’s got him! CUT TO: OMITTED 34   34 EXT. MINEHEAD POLICE STATION - DAY 35   35 A BROWN ROLLS ROYCE pulling up in the yard. JEREMY gets out of the passenger seat, MARION out of the back; it’s SIR DAVID NAPLEY’s car (he’s been knighted since sc.15) now getting out of the driver’s side.   POLICEMEN head over to escort them.   Napley’s confident as they head inside. DAVID NAPLEY Won’t take long.   Home for supper. Once they’ve officially questioned you about this Newton chap, then the press might finally shut up. CUT TO: INT. MINEHEAD POLICE",
      "dialogue_count": 0,
      "word_count": 739
    },
    {
      "scene_number": 5,
      "slugline": "INT. CORRIDORS BENEATH MINEHEAD MAGISTRATES’ COURT - DAY 37   37 TEN MINUTES LATER, they’ve transferred to the MAGISTRATES’ COURT, nearby.   A long, subterranean corridor, JEREMY being marched along like a prisoner by D.C.S. CHALLES & POLICEMAN. But Jeremy’s got his head high, holding on to his dignity... ...but as they reach the STAIRS leading up to the court, it gets worse.   Waiting: a downcast DAVID HOLMES plus POLICEMAN. DAVID I’m so sorry. Jeremy with eyes blazing:   shut up!  D.C.S CHALLES If you could just wait here.   For the others. Challes heads off, Jeremy looks round.   Others?   From another junction, JOHN LE MESURIER plus POLICEMAN, and GEORGE DEAKIN plus POLICEMAN, approach.   All gathering at the stairs to wait; all to be charged at the same time.   Jeremy has never seen these men before.   These ordinary Welsh men.   And this, more than his actual arrest, makes him burn with shame. Le Mesurier’s almost touching his forelock.   Deakin is livid. JOHN LE MESURIER Mr Thorpe.   Very nice to meet you, sir, very great honour.   Albeit in these difficult circumstances. GEORGE DEAKIN Fucking mess, this is. JOHN LE MESURIER My name’s John Le Mesurier.   Not the actor.   Obviously. Pause.   Jeremy dying to escape.   Then to break the silence: JOHN LE MESURIER (CONT’D) I’ve always voted Liberal. GEORGE DEAKIN Waste of a vote. JOHN LE MESURIER No need to be rude. GEORGE DEAKIN My solicitor is from Swansea, I bet he’s had his flown in from Geneva. You watch him stitch us up! DAVID All right now, leave it. English Scandal Ep.3 prod script amended 8th Nov   17.",
      "characters": [],
      "action_text": "GEORGE DEAKIN And you can shut it.   David.   Or have we never met?   Ooh, sorry, I don’t know you, do I?   You bumhole. Challes is a long way down the corridor, calls out: D.C.S CHALLES Ready for you. And Jeremy practically RUNS up the stairs to get away! CUT TO: INT. MINEHEAD MAGISTRATES’ COURT - DAY 38   38 Small, wood-panelled court.   JEREMY, DAVID HOLMES, JOHN LE MESURIER and GEORGE DEAKIN in the dock.   SIR DAVID NAPLEY on the floor.   In the Public Gallery: MARION.   Horrified. CHALLES has read out the charges, and the three MAGISTRATES look down.   The lead MAGISTRATE is 55, wiry, female: MAGISTRATE How do you plead, Mr Thorpe? JEREMY I will vigorously defend these charges and plead not guilty. MAGISTRATE Gentlemen, you will be remanded until the 12th of September, on bail of £5,000 each. CUT TO: INT. CAR/EXT. MINEHEAD POLICE STATION - DAY 39   39 After all that formality, the INSIDE OF THE CAR is a BOX OF RAGE.   JEREMY in the passenger seat, MARION in the back, SIR DAVID NAPLEY at the wheel, so frantic he’s grinding gears. MARION Who were those awful men?!   Who were they?!  JEREMY For Christ’s sake, just drive! DAVID NAPLEY I am, I’m trying!   MARION They worked in carpets! JEREMY I know!   Since when did gangsters work in carpets?! English Scandal Ep.3 prod script amended 8th Nov   18. The car jolts backwards - it’s in reverse - JEREMY (CONT’D) Oh for God’s sake! DAVID NAPLEY Sorry!   Sorry!   JEREMY (CONT'D) Just get us out! MARION And they were   Welsh!   Why were they Welsh?! Car shoots forward, brakes, hard, all: WOAH! CUT TO: INT. ORME SQUARE - NIGHT 40   40 From the furious car, to absolute CALM.   Hours later. JEREMY, MARION and SIR DAVID NAPLEY, with whisky. DAVID NAPLEY The question is, who’s going to represent you in court?   The papers are trying you on a daily basis, you need someone remarkable.   If I might suggest..?   George Carman. JEREMY We were at Oxford. MARION Is he good? JEREMY Well.   Depends.   He’s a drinker and a gambler and his",
      "dialogue_count": 0,
      "word_count": 6393
    },
    {
      "scene_number": 6,
      "slugline": "INT. COURT NUMBER ONE, OLD BAILEY - DAY 74   74 Back in session.   PETER TAYLOR on his feet. PETER TAYLOR Thank you, m’lud, no further witnesses.   That rests the case for the prosecution. He sits.   The whole court bristling as the focus goes to CARMAN, and therefore JEREMY.   All waiting... JUDGE CANTLEY Thank you.   Mr Carman? Carman stands.   MARION waiting, and all the JOURNALISTS. Holding their breath. But more than anyone: Jeremy waiting.   Not knowing what Carman’s decision will be. And Carman considers.   Decides. GEORGE CARMAN M’lud.   On behalf of Jeremy Thorpe. I call no witnesses. Shock!   All round the room!   Carman SITS! SHOUTS, CLAMOUR, JUDGE CANTLEY trying to be heard - JUDGE CANTLEY Silence!   I must insist!   The court will resume at 10 o’clock tomorrow morning for the closing addresses. But all of that in the background, as CARMAN closes his files, packing up.   Aware he’s taken one of the biggest risks of his life.   He looks round at Jeremy. Jeremy meets his stare.   Wonders at what Carman’s done. Whether he’s doomed him, or saved him. CUT TO: English Scandal Ep.3 prod script amended 8th Nov   45.",
      "characters": [],
      "action_text": "OMITTED 75   75 OMITTED 76   76 EXT. OLD BAILEY - DAY 77   77 BBC REPORTER to CAMERA. BBC REPORTER The surprise announcement means that Mr Thorpe won’t take the stand, and will not be questioned on his role in this remarkable affair.   He will remain silent. CUT TO: INT. JACK & STELLA’S FLAT - NIGHT 78   78 NORMAN, with STELLA & JACK and their guest EDNA, watching TV. English Scandal Ep.3 prod script amended 8th Nov   46. EDNA The coward. STELLA Is he allowed to do that? EDNA It’s the establishment.   Same as ever.   This whole thing’s been a stitch-up, right from the start. But Norman’s watching quietly.   Wondering.   Because Jeremy’s silence has prevented him from destroying Norman.   Perhaps. CUT TO: INT. COURT NUMBER ONE, OLD BAILEY - DAY 79   79 NEW DAY.   And JUDGE CANTLEY gives his summing-up. Reactions throughout; JEREMY and MARION, with CARMAN scarcely able to believe how good this is.   The PROSECUTION appalled. JUDGE CANTLEY This is a very serious charge and a rather bizarre and surprising case. The accused are men of hitherto unblemished reputation.   Mr Thorpe is a Privy Councillor, a former Leader of the Liberal party and a national figure with a very distinguished public record.   As we consider Mr Bessell’s evidence, he’s plainly a very intelligent man.   But having sold his story in a deplorable contract with the Sunday Telegraph, he told us that he was a Christian, at the same time being sexually promiscuous. Therefore, he is a humbug.   I now turn to the evidence of Mr Scott. You will remember him well.   A hysterical, warped personality, an accomplished sponger, and very skilful at exciting and exploiting sympathy.   A spineless, neurotic character, addicted to self- advertisement.   He is a crook.   He is a fraud.   He is a sponger.   He is a whiner.   He is a parasite.   Of course, I’m not suggesting you should not believe him.   That is not for me.   I am not expressing any opinion.   But any examination of Mr Scott’s motives must take into a",
      "dialogue_count": 0,
      "word_count": 1763
    },
    {
      "scene_number": 7,
      "slugline": "INT. OLD BAILEY, LONG CORRIDOR - DAY 90   90 JEREMY And you know how those nights end. CUT TO: INT. JEREMY’S FLAT, MARSHAM COURT - NIGHT 91   91 20 years ago, the STRAPPING BLONDE MAN is half naked, unbuttoned, JEREMY half-dressed.   But panicking, the night’s gone wrong, out of control - the man’s drunk, lurching, clutching a WHISKY, shoves Jeremy to the floor, violent - BLONDE MAN You touched me, you dirty queer, you fucking touched me - He throws the whisky, Jeremy’s precious ornaments, SMASH! CUT TO: EXT. EMBANKMENT - NIGHT 92   92 10 years ago, THE SKINHEAD holds JEREMY by the throat, against the wall, with one hand, his other hand expertly rips out Jeremy’s pocket-watch, wallet, money.   Jeremy terrified. CUT TO: INT. JEREMY’S FLAT, MARSHAM COURT - NIGHT 93   93 Five years ago, TALL BLACK MAN on top of JEREMY on the BED - both half-dressed, as it all goes wrong, turns violent, Jeremy struggling, the man slapping his face again and again - TALL BLACK MAN D’you like it?   Do you?   Do you? Do you?   Do you? CUT TO: INT. OLD BAILEY, LONG CORRIDOR - DAY 94   94 JEREMY and CARMAN look at each other.   Understanding. JEREMY Given those men.   It may be.   I suppose.   One could imagine... That Norman Scott was the best. And they sit there, in silence. Finally knowing each other. English Scandal Ep.3 prod script amended 8th Nov   53.",
      "characters": [],
      "action_text": "Hold. Then CLIVE OTUNDE approaches from the direction of the court. CLIVE OTUNDE They’re coming back. Jeremy stands.   Carman stands. They head off. CUT TO: INT. COURT NUMBER ONE, OLD BAILEY - DAY 95   95 THE PUBLIC GALLERY, a fever of chat, excitement, speculation. MARION on edge, and now URSULA has joined her, with MONOCLE. All the JOURNALISTS. And EDNA sits upright, proud.   Here to see justice done. On the floor, GEORGE CARMAN, CLIVE OTUNDE in place, and PETER TAYLOR, along with all the other BARRISTERS.   The ACCUSED in the dock.   JEREMY, then JOHN LE MESURIER, then GEORGE DEAKIN, then DAVID HOLMES.   Watching the JURY taking its seats. CLERK OF THE COURT All rise. EVERYONE STANDS as JUDGE CANTLEY arrives. CUT TO: INT. CYPRIOT CAFE, LONDON - DAY 96   96 CLOSER on NORMAN.   Wondering about the verdict. CUT TO: INT. COURT NUMBER ONE, OLD BAILEY - DAY 97   97 Foreman of the Jury, CELIA KETTLE-WILLIAMS, 45, stands; a teacher, elected foreman because she has the clearest voice. The ACCUSED, all STANDING. EVERYONE hanging on every word. CLERK OF THE COURT On the charge of conspiracy to murder do you find the defendant, David Holmes, guilty or not guilty? English Scandal Ep.3 prod script amended 8th Nov   54. CELIA KETTLE-WILLIAMS Not guilty. DAVID HOLMES reels, almost faints. CLERK OF THE COURT On the charge of conspiracy to murder do you find the defendant, George Deakin, guilty or not guilty? CELIA KETTLE-WILLIAMS Not guilty. GEORGE DEAKIN, of all people, bursts into tears. CLERK OF THE COURT On the charge of conspiracy to murder do you find the defendant, John Le Mesurier, guilty or not guilty? CELIA KETTLE-WILLIAMS Not guilty. JOHN LE MESURIER gives a polite little nod. CLERK OF THE COURT On the charge of conspiracy to murder do you find the defendant, Jeremy Thorpe, guilty or not guilty? CELIA KETTLE-WILLIAMS Not guilty. A gasp around the court, but only for a second, and JEREMY keeps his composure, because it’s not quite over. CLERK OF THE COURT And on the sec",
      "dialogue_count": 0,
      "word_count": 1076
    },
    {
      "scene_number": 8,
      "slugline": "EXT. ORME SQUARE - DAY 102   102 JEREMY, MARION and URSULA appear on high. Orme Square has a STONE BALCONY with a carved balustrade. The three stand there, looking magnificent, and wave down. BELOW: A CROWD, and JOURNALISTS, CAMERAS.   Cheers, roars! JEREMY waves. MARION waves. The CROWD cheers. Marion leads RUPERT, now 10, over to one side... Staying on Jeremy.   And URSULA is now behind him.   He doesn’t look round, his mother is just a voice in his ear. URSULA Of course, you’re ruined.   You know that, don’t you? Jeremy gives no reaction.   She melts away.   He stays there with his head held high.   Waving to the people. And then, beyond, far away... A RED DOUBLE BECKER BUS pulls into the street. JEREMY looks in that direction.   He can’t see, he can’t know, and it can’t be the same bus. But perhaps. CUT TO: OMITTED 103   103 OMITTED 104   104 INT. DOUBLE DECKER BUS - DAY 105   105 NORMAN sits on the bus, with his CAKE in a little bag. Thinking about everything. He looks off, into the distance, down the street. He can’t see Jeremy, he can’t know he’s there, he can’t even be on the same street. But perhaps. English Scandal Ep.3 prod script amended 8th Nov   58.",
      "characters": [],
      "action_text": "INTERCUT SC.104 and 105. Jeremy looking RIGHT TO LEFT. Norman looking LEFT TO RIGHT. Two men, suspended in that moment. Their lives changed forever, defined forever, by each other. Then... The moment’s gone. The BUS judders, TURNS, driving away, taking Norman with it. Jeremy watches the bus recede into the distance. He smiles, a little. Then he turns away. CUT TO BLACK. MUSIC. END ON CARDS, against BLACK. A photo of JEREMY THORPE.   CAPTION:  Jeremy Thorpe never returned to politics.   In 1985, he was diagnosed with Parkinson’s Disease.   Marion cared for him for the rest of his life.  CUT TO: A photo of PETER BESSELL & DIANE KELLY.   CAPTION:  Peter Bessell never returned to Britain.   He married Diane Kelly and died in 1985.  CUT TO: A photo of DAVID HOLMES.   CAPTION:  David Holmes became the manager of a roller-disco in Camden . CUT TO: A photo of JUDGE CANTLEY.   Alongside that, PLAY IN FOOTAGE, Peter Cook, Secret Policeman’s Ball, his satire of Cantley. “A self-confessed player of the pink oboe...”   CAPTION:  Chief Justice Cantley was widely mocked and ridiculed.  CUT TO: English Scandal Ep.3 prod script amended 8th Nov   59.",
      "dialogue_count": 0,
      "word_count": 401
    },
    {
      "scene_number": 9,
      "slugline": "INT. CHURCH - DAY 106   106 This image contained within the CARDS of the final captions. CU on a COFFIN.   CAPTION:  Marion Thorpe died in 2014.   Jeremy died nine months later.  A HAT is placed on the coffin.   Jeremy’s famous BROWN TRILBY. CUT TO: EXT. DEVON COTTAGE - DAY 107   107 This image contained within the cards of the final captions. NORMAN SCOTT - the real Norman Scott - stands in the sunshine, in front of his 11th Century cottage.   CAPTION:  Norman Scott is alive and well.   He has 11 dogs.  Then add:   He still hasn’t got his National Insurance card.  END OF EPISODE THREE English Scandal Ep.3 prod script amended 8th Nov   60.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 115
    }
  ]
}