{
  "slug": "a-very-english-scandal-102-episode-1-2-2018",
  "title": "a very english scandal 102 episode 1 2",
  "genre": "thriller",
  "format": "series",
  "scenes_count": 11,
  "characters_count": 0,
  "characters": [],
  "total_words": 13036,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. COMMONS CHAMBER - DAY 1   1 JEREMY on his feet, to a packed House.   A firebrand. JEREMY I regard it as immoral!   This country continues to supply arms to Nigeria, while no food has been able to reach these people since the 10th of June.   And who takes advantage of this?   Soviet Russia! The Russians have been growing in strength within Nigeria with every passing day - the world should see this!   The world should know! CUT TO: INT. HOUSE OF COMMONS, CENTRAL LOBBY - DAY 2   2 MINUTES LATER, the session ended, the lobby full, JEREMY striding through, PETER BESSELL trotting after him, alarmed, as Jeremy returns to his greatest passion of the moment: JEREMY The real question is, where to dispose of the body?   In New York, they drop corpses in the river. CUT TO: INT. HOUSE OF COMMONS, STAIRCASE - DAY 3   3 JEREMY and BESSELL now hurrying upstairs. JEREMY I’ve read, you can seal a body in concrete at the base of a motorway. CUT TO: INT. JEREMY’S LEADER’S OFFICE - DAY 4   4 JEREMY striding towards his office, BESSELL following - JEREMY Tin mines!   That’s the solution. David!   Ready for you now. Waiting outside the office, now jumping to his feet, is DAVID HOLMES, 40s, northern, a solid, bluff man, heavy glasses; a good, blunt, down-to-earth contrast to these MPs.   He joins Jeremy & Bessell as they enter the Leader’s Office -",
      "characters": [],
      "action_text": "JEREMY (CONT’D) Pedro Besselli, David Holmes, David’s in finance, he was Deputy Treasurer of the party, he got us those carpets for Liberal Headquarters, half price. DAVID HOLMES Magic Carpet Company, that’s me. JEREMY We were at Oxford.   And we holiday together. DAVID HOLMES We’ve had some bloody times, him and me.   That beach in Greece. JEREMY That waiter! An old, intense friendship between Jeremy and David; their in- jokes and ease with each other make Bessell feel excluded. BESSELL Anyway, you two must have business, I’ll leave you alone - JEREMY No, same business!   Lock the door. Bessell does so, amazed, as David takes part, quite happily. Like it’s some old college game between them. JEREMY (CONT’D) I was saying, Norman Scott, tin mines.   Hundreds of abandoned tin mines in Cornwall. DAVID HOLMES Brilliant.   Drop the body down there, he’ll never be found. JEREMY Take him to the pub.   Get him drunk.   Shove him in the car, drive him out to Bodmin Moor.   Kill him. BESSELL But... that’s my constituency. DAVID HOLMES Kill him how? JEREMY Oh come on.   It’s quite easy to break someone’s neck. (MORE) English Scandal Ep.2 Prod Script amended 27th Nov   2. (demonstrates on Bessell) Elbow there.   Jerk up.   Hah! JEREMY (CONT'D) English Scandal Ep.2 Prod Script amended 27th Nov   2A. DAVID HOLMES He might wriggle out of it.   Men like him tend to be wrigglers. JEREMY You’ll just have to shoot him, David.   Can you get a gun? DAVID HOLMES I can do whatever you want. JEREMY Then shoot the bugger stone dead! CUT TO: INT. BESSELL’S OFFICE - DAY 5   5 BESSELL arriving, smoking a cigarette, weighed down by worries.   DIANA STAINTON passes him a slip of paper. DIANA Message for you.   Norman Scott. Bessell winces, oh God.   But as he reads... ...he GRINS. CUT TO: INT. JEREMY’S LEADER’S OFFICE - DAY 6   6 BESSELL bursts in, flushed, delighted.   JEREMY at his desk. BESSELL It’s over.   It’s finished.   It’s done.   You don’t need to worry about Norman Scott ever again! J",
      "dialogue_count": 0,
      "word_count": 1942
    },
    {
      "scene_number": 2,
      "slugline": "INT. JEREMY’S DEVON HOUSE - DAY 26   26 JEREMY walks in.   His mother, URSULA, is waiting.   She doesn’t go to him, too much in shock, speechless, just standing back as he walks past her. Goes to the NURSERY. RUPERT is there (now 1 year 2 months old), the NANNY nearby, looking upset, and as Jeremy enters, she walks out, can’t bear to watch.   Jeremy goes to RUPERT, picks him up, hugs him tight, and then he’s holding his son and crying. CUT TO: OMITTED 27   27 INT. JEREMY’S DEVON HOUSE - DAY 28   28 A MAID is giving out tea. All around the room,, grave and deferential: PETER BESSELL, EMLYN HOOSON, MIKE STEELE, JOHN PARDOE, MP for North Cornwall in chairs, DAVID HOLMES more informal, on a windowsill. It is many days later.   They’ve come to pay their respects. And JEREMY holds court.   Grim.   Keeping them spellbound. JEREMY We may never know.   Whether she looked down, or fell asleep at the wheel.   Just for a second.   But she swerved.   Into the opposite lane. Thirteen-ton lorry.   She flipped over, landed on the roof, skidded along.   Stopped.   Still alive. Spoke to the police while they were cutting her out.   I’m told she apologised for the inconvenience. (a nice smile goes round the room) Dead by the time she reached the hospital.   Ruptured spleen. DAVID HOLMES Bloody hell.   Just... awful. MIKE STEELE Everyone at headquarters sends their condolences. English Scandal Ep.2 Prod Script amended 27th Nov   10.",
      "characters": [],
      "action_text": "JEREMY Thank you.   If there was one miracle, Rupert wasn’t with her. DAVID HOLMES Thank God. JEREMY (more upset) It’s all about him, now.   My mother said, he’s 14 months old, he won’t remember her.   I said, he will. Silence, as he recovers. MIKE STEELE Obviously...   If there’s anything we can do to help.   With arrangements for the funeral, or talking to your constituents.   We thought some kind of public memorial would be a good idea...? Hooson is a little bit more beady. HOOSON And there’s the question of when you’re returning to work. MIKE STEELE Well it’s a bit soon for that - HOOSON Don’t mean to cause offence, Mike, I’m just being practical.   I’m sure you appreciate that, Jeremy. A low look across the room, Jeremy and Hooson; old enemies. HOOSON (CONT’D) The affairs of state are relentless.   So if you need me.   To step in.   You only have to say. CUT TO: EXT. JEREMY’S DEVON HOUSE - DAY 29   29 THROUGH THE WINDOW: DAVID HOLMES, EMLYN HOOSON, MIKE STEELE, JOHN PARDOE all chatting, the MAID serving tea. Seen by JEREMY; he’s escaped outside with BESSELL.   Old friends in the aftermath, though Jeremy’s bitter: English Scandal Ep.2 Prod Script amended 27th Nov   11. JEREMY Emlyn bloody Hooson.   He wants my job.   He always did.   I thought I’d have you at my side, Besselli, to fight the good fight, but now you’re giving me more bad news. BESSELL I’ve got no choice.   I’m not just leaving Parliament, I think I might have to get out of the country while I still can.   Just between you and me, I’m planning to vanish. That latest venture turned into a disaster, the one with the eggs. JEREMY What went wrong? BESSELL The egg man.   Dropped down dead. Leaving me half a million in debt. And since you’re not allowed to be both an MP and a bankrupt...   Off I pop.   I swear, a man is not allowed to lose his money these days without everybody making a fuss. Which actually makes Jeremy laugh.   He claps Bessell on the back, as they walk towards the lane, and Bessell’s c",
      "dialogue_count": 0,
      "word_count": 1765
    },
    {
      "scene_number": 3,
      "slugline": "INT. GWEN’S COTTAGE, LIVING ROOM - NIGHT 44   44 Both wrapped in dressing gowns in FIRELIGHT, with tumblers of WHISKY.   NORMAN telling his story, GWEN shocked into silence. NORMAN ...and that was it.   I never saw him again.   And I never got my National Insurance Card. (silence) I completely understand.   If you don’t want to see me again. GWEN Why would I do that? NORMAN Because of the men. GWEN Oh no, forgiven!   Forgiven outright, don’t be silly!   My husband was in the army.   But Jeremy Thorpe, for God’s sake, he’s the leader of the party.   And now you’re telling me this. (jumps to her feet) Norman!   You’ve struck lucky! CUT TO: INT. GWEN’S COTTAGE, KITCHEN - NIGHT 45   45 MINUTES LATER.   GWEN is all sudden bursts of energy and schemes; now she’s got PAPER AND PEN, hurrying to sit down at the table to write.   NORMAN caught up in her excitement. GWEN Cos this friend of mine, his son is the MP for Montgomeryshire - and he’s a Liberal MP, he’s an actual Liberal.   I’m going to tell him! NORMAN Good.   Yes.   Do!   Mention the National Insurance card. GWEN I will!   He’s a smashing chap. Emlyn Hooson, his name is. CUT TO: INT. HOUSE OF COMMONS, EMLYN HOOSON’S OFFICE - DAY 46   46 EMLYN HOOSON opens Gwen’s LETTER.   He reads... English Scandal Ep.2 Prod Script amended 27th Nov   18.",
      "characters": [],
      "action_text": "Horrified. And yet, with a glint in his eye.   He can USE this. CUT TO: INT. HOUSE OF COMMONS, CENTRAL LOBBY - DAY 47   47 NORMAN and GWEN sit waiting.   Two little people, huge space. For Norman, this is extraordinary.   Remembering the last time he was here.   And scared, in case he bumps into Jeremy. He keeps looking round.   The men, going to and fro. And then... the SERJEANT AT ARMS.   The same man.   After all this time.   Passing by, a distance away, not seeing Norman. Norman torn; he wants to hide, but he wants to be recognised. And he keeps thinking, Jeremy, Jeremy, Jeremy. His heart pounding as a man approaches.   EMLYN HOOSON. EMLYN HOOSON Mrs Parry Jones, of course.   Thank you for coming all this way. GWEN Nice to see you again.   Mr Hooson. This is Mr Scott. Norman now rather grand, given centre stage: NORMAN Thank you so much for seeing me. And may I say.   It’s about time. CUT TO: INT. HOUSE OF COMMONS, CORRIDOR   - DAY 48   48 NORMAN & GWEN walk along with EMLYN HOOSON.   Norman on edge. NORMAN Can I ask, is Mr Thorpe here today? EMLYN HOOSON He’s away, in Zambia, he’s not back until Monday.   Can I introduce... DAVID STEEL, MP for Roxburgh, only 33, short, clever, currently the Liberal Chief Whip.   He’s heading towards them, as Hooson ushers them towards the CHIEF WHIP’S OFFICE. English Scandal Ep.2 Prod Script amended 27th Nov   19. EMLYN HOOSON (CONT’D) ...my colleague, David Steel.   MP for Roxburgh, Selkirk and Peebles, he’s very kindly given us his office, and he’d like to attend. NORMAN Jeremy used to talk about you. DAVID STEEL Did he?   All good, I hope. NORMAN He called you Baby of the House. DAVID STEEL That’s a technical term, for the youngest MP in the Commons.   Which I was, at the time!   I’m sure he meant it in a... jovial fashion. NORMAN Not particularly. And Norman heads in.   The news that Jeremy’s away is toughening him up.   He’s ready for a fight. CUT TO: INT. HOUSE OF COMMONS, CHIEF WHIP’S OFFICE - NIGHT 49   49 Abrupt CUT TO",
      "dialogue_count": 0,
      "word_count": 1752
    },
    {
      "scene_number": 4,
      "slugline": "INT. HOUSE OF COMMONS, EMLYN HOOSON’S OFFICE - DAY 54   54 EMLYN on the phone, exasperated. EMLYN HOOSON We’ve hit a problem.   The Commissioner of the Metropolitan Police can’t find any substance in Mr Scott’s allegations. CUT TO: INT. GWEN’S COTTAGE - DAY 55   55 GWEN on the telephone.   But she’s changed; the crying which started in sc.49 wasn’t only for Norman, but the start of a bipolar swing plummeting from high to low.   She’s wrapped in diaphanous shawls, joss sticks burning, MUSIC playing on the record player, Middle of the Road’s Soley Soley. She sounds dreamy, spaced out, though she’s crying. GWEN You’re very kind, Emlyn.   But it really doesn’t matter any more. INTERCUT with sc.54, Hooson on the phone. EMLYN HOOSON I just thought, if Mr Scott had any evidence..?   Could I speak to him? GWEN I’ve been very silly, haven’t I? EMLYN HOOSON I’m sorry? GWEN I do things.   I get these little passions.   They sweep in and they sweep out, my husband used to say you’re not well, Gwen.   He was in the army.   D’you remember him? EMLYN HOOSON ...are you all right? GWEN They laughed at me.   Cos I loved him.   Norman.   But they were all laughing. And she’s tormented, keeps seeing: CUT TO: English Scandal Ep.2 Prod Script amended 27th Nov   26.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 219
    },
    {
      "scene_number": 5,
      "slugline": "EXT. TAL-Y-BONT VILLAGE - DAY 56   56 SILENT IMAGES, painted into GWEN, sc.57.   This is as sc.43, but a new version, Gwen’s version, how she remembers it now. The OLD MAN and the THREE LADS outside the pub are LAUGHING. It’s EXAGGERATED; in Gwen’s breakdown, she sees them leering, yelling, howling, all teeth, spittle, grins, wet mouths. CUT TO: INT. GWEN’S COTTAGE - DAY 57   57 GWEN, painted with paranoid images from sc.56. GWEN A widow woman.   Falling for a boy. A boy who was in love with someone else, I was stupid, stupid, stupid, oh my God, he’d be ashamed of me. I can’t bear it.   I cannot bear it. EMLYN HOOSON I don’t think I understand. GWEN The matter is closed, Mr Hooson. You go back.   To your world.   And leave me to mine.   Because I will be perfectly, perfectly fine. CUT TO: EXT/INT. GWEN’S COTTAGE - DAY 58   58 BANG! A POLICEMAN, shouldering the GWEN’S DOOR.   It won’t give. NORMAN and two old NEIGHBOURS standing back, worried. NORMAN I tried ringing, she won’t answer - BANG! again, then a final BANG!   The door FLIES OPEN. The policeman enters the HALL, Norman following. POLICEMAN Hello there?   Gwen?   Are you in? (to Norman) Bloody hell, it’s hot. But Norman pushes past, runs up the STAIRS. To the BEDROOM.   Opens the door. English Scandal Ep.2 Prod Script amended 27th Nov   27.",
      "characters": [],
      "action_text": "He’s hit by the SMELL. Then the HORROR. CUT TO: EXT. GWEN’S COTTAGE - DAY 59   59 NORMAN sits on a wall.   Shaken.   The smell still in his nose. An AMBULANCE is already there, PARAMEDICS going to and fro. The POLICEMAN joins him.   He’s shaken too, grim. POLICEMAN Hard to identify.   They think the body’s been there for weeks.   With the heating on full blast. NORMAN I was away.   In London. POLICEMAN We’ll have to wait for the inquest, but there’s some pills and some alcohol by the bed.   I’m so sorry. Norman has lost everything, again. CUT TO: INT. HOUSE OF COMMONS, CORRIDOR - DAY 60   60 JEREMY, stern and severe in victory, with a defeated EMLYN. EMLYN HOOSON ...it’s a terrible set of circumstances.   But given the poor lady’s passing, I think we have to consider the matter closed. JEREMY Gracious of you.   Did you give Mr Scott your sympathies? EMLYN HOOSON I passed on my condolences. JEREMY No doubt you used the same tone of voice, as when you offered me sympathy for my dead wife.   Thank you, Emlyn.   You are dismissed. Emlyn, cowed, walks off.   Then Jeremy goes the opposite way. English Scandal Ep.2 Prod Script amended 27th Nov   28. STAY ON JEREMY.   Walking.   Bristling.   DANGEROUS.   Because Norman Scott is very much back in his sights.   As he strides down the corridor, there, as arranged, waiting for him... DAVID HOLMES.   They have much to discuss. CUT TO: EXT. PACIFIC BEACH - DAY 61   61 Dazzling SUNLIGHT. Blue sky.   The vast ocean.   And standing like a free man... PETER BESSELL.   His new life.   This is Oceanside, California. Bessell lives in a seafront CLAPBOARD COTTAGE.   Practically a HUT.   It stands behind him, a single room, plus bathroom, its front open to the beach.   Humble but idyllic. He looks across.   Shaded by trees, his partner, DIANE KELLY, 32, American, dark-haired; a mortgage analyst, but right now, she’s painting at an easel with watercolours. But Bessell is just waiting.   And here he comes. Walking along the beach, DAVID HOL",
      "dialogue_count": 0,
      "word_count": 2288
    },
    {
      "scene_number": 6,
      "slugline": "EXT. NORTH DEVON STABLES - DAY 78   78 NORMAN’s now happy as can be, back at work with his beloved horses, saddling up for a ride. He mounts a WHITE HORSE.   In his element.   Off he trots. CUT TO: EXT. JEREMY’S DEVON HOUSE - DAY 79   79 JEREMY gets into his STAG TRIUMPH.   Roof down, it’s a fine day, he’ll enjoy the drive. Ignition fires.   And off he goes. CUT TO: EXT. NORTH DEVON COUNTRY ROADS - DAY 80   80 NORMAN on the WHITE HORSE.   Trotting along. Genuinely happy. Norman is heading LEFT TO RIGHT, and - CUT TO: EXT. NORTH DEVON COUNTRY ROADS - DAY 81   81 JEREMY’s driving along, heading RIGHT TO LEFT. He’s going from Cobbaton through South Molton, heading for the A351, to get to the M5, to Bristol, to London... INTERCUT, Jeremy smiling to himself, Norman never happier. MUSIC, faster and faster, as they get closer and closer. CUT TO: EXT. NORTH DEVON VILLAGE - DAY 82   82 A quiet, charming village, picked out in soft gold in the sunlight.   The CENTRAL SQUARE acts as a CROSSROADS. JEREMY’S STAG TRIUMPH approaches from one direction, slows, stops, as a TRACTOR & HAY TRAILER crosses the square. On the OPPOSITE SIDE of the square... NORMAN’S HORSE trots to a halt, to let the square clear. Norman waits. English Scandal Ep.2 Prod Script amended 27th Nov   38.",
      "characters": [],
      "action_text": "Jeremy waits. And as the TRACTOR CLEARS... Norman sees Jeremy. And Jeremy sees Norman. Good God. Jeremy open-mouthed. Norman not sure what to do... But then he SMILES. He gees up the horse, trots forward, to pass Jeremy’s car, as though this is all perfectly normal.   Jeremy just staring. And as the horse reaches the car, without stopping, Norman cannot think of what to say, so he waves, and blurts out - NORMAN Thank you! And he rides off.   Down the road. Jeremy sits there.   Thank you??  Norman’s delighted.   No anger.   Like he’s seen an old friend. Jeremy turns round in his seat, in disbelief, looks back at the horse.   Norman bouncing off down the road. Jeremy turns round, to face front.  What?!?  CUT TO: INT. HOUSE OF COMMONS, CENTRAL LOBBY - NIGHT 83   83 MUSIC linking sc.66-83 ends.   Everything quiet now, dark, lights low.   The House is not in session. JEREMY crosses the floor.   Alone.   Darkness gathering. CUT TO: INT. HOUSE OF COMMONS, CORRIDOR - NIGHT 84   84 Silence, as JEREMY walks down the corridor. CUT TO: English Scandal Ep.2 Prod Script amended 27th Nov   39.",
      "dialogue_count": 0,
      "word_count": 417
    },
    {
      "scene_number": 7,
      "slugline": "INT. JEREMY’S LEADER’S OFFICE - NIGHT 85   85 BLINK!   JEREMY switches on his DESK LAMP. Then, he’s in turmoil.   A sudden intake of breath.   Like he could shout, or panic, or rage.   But he quells it.   Sits. And now... It must be done. He picks up the phone and starts to dial. CUT TO: EXT. MANCHESTER - NIGHT 85A   85A The city of MANCHESTER.   The sound of a PHONE RINGING... CUT TO: INT. DAVID HOLMES’S HOUSE, MANCHESTER - NIGHT 86   86 HALLWAY.   PHONE ringing.   DAVID HOLMES answers it. DAVID Didsbury 4656. STAY ON HIM.   David’s got a nice, decent house, not too expensive.   In the background, LIVING ROOM, a man, GERALD, sits watching television.   A new sitcom called Fawlty Towers. DAVID (CONT’D) No no no, not bothering me at all, is there something wrong? CUT TO: EXT. DAVID HOLMES’S HOUSE, MANCHESTER - NIGHT 87   87 SEEN FROM OUTSIDE, through RAIN: DAVID HOLMES in the hall, on the phone.   Grim.   The most important phonecall of his life. CUT TO: INT. DAVID HOLMES’S HOUSE, MANCHESTER - NIGHT 88   88 DAVID HOLMES now putting the phone down.   For a moment, he buries his head in his hands.   Overwhelmed. Then sits upright.   Snaps out of it.   He’s made a promise. English Scandal Ep.2 Prod Script amended 27th Nov   40.",
      "characters": [],
      "action_text": "He starts to dial. CUT TO: EXT. WELSH VALLEY - NIGHT 88A   88A A typical Welsh valley, terraced houses clinging to both sides of the hill.   The sound of a PHONE RINGING... CUT TO: INT. JOHN LE MESURIER’S HOUSE - NIGHT 89   89 The PHONE RINGING in a nice, ordinary home.   JOHN LE MESURIER, 41, a big, genial Welshman, answers the phone. JOHN LE MESURIER Hello, Le Mesurier residence? (big smile) Bloody hell, the Magic Carpet King! CUT TO: EXT. JOHN LE MESURIER’S HOUSE - NIGHT 90   90 SEEN FROM OUTSIDE: JOHN LE MESURIER on the phone.   He sits. Sighs.   Rubs his forehead.   Difficult call. CUT TO: EXT. PORT TALBOT - NIGHT 90A   90A STEELWORKS belching out smoke.   Sound of a PHONE RINGING... CUT TO: INT. GEORGE DEAKIN’S HOUSE - NIGHT 91   91 The PHONE is ringing away, inside a house full of SLOT MACHINES and PINBALLS, in various states of repair; GEORGE DEAKIN has to slide past them to get to the phone.   He’s 31, Welsh, sandy-haired, small, bit flash. GEORGE DEAKIN Hello hello, Deakin speakin’! CUT TO: English Scandal Ep.2 Prod Script amended 27th Nov   41. OMITTED 92   92 EXT. BLACKPOOL - NIGHT 92A   92A The city, glittering in the night. CUT TO: EXT. SAVOY HOTEL, BLACKPOOL - NIGHT 93   93 GEORGE DEAKIN steps out of a TAXI.   Feeling sharp and cool in BLACK TIE, the life he thinks he deserves.   He heads in. It’s the Savoy Hotel.   A glamorous night inside... CUT TO: INT. SAVOY HOTEL, BALLROOM - NIGHT 94   94 It’s the 1975 Annual Showmen’s Dinner, to raise money for fairground workers.   BLACK TIE, though it’s a boisterous do, a bit rough and ready.   Mid-dinner, chicken in the basket, WAITRESSES on duty, the band playing.   Pure Blackpool. GEORGE DEAKIN walks in.   Sly.   Scans the room, looking for... ANDREW “GINO” Newton, 29, a pilot with British Island Airways.   A London lad, raised in Chiswick.   He’s got a moustache, looks every inch the spiv or cad.   Now, he’s already a bit drunk, life and soul, with his MATES: ANDREW NEWTON Stuck in bloody Antwerp.   I said",
      "dialogue_count": 0,
      "word_count": 2133
    },
    {
      "scene_number": 8,
      "slugline": "INT. MARKET INN, BARNSTAPLE - DAY 102   102 NORMAN bursts in with PRINCESS ELEANOR.   It’s quiet, just a few CUSTOMERS, EDNA behind the bar.   Norman scared, excited. NORMAN Edna, there’s a man outside - (hands lead to a customer) Tommy, could you take her?   Sorry! (to Edna) This man, he’s got a yellow Honda, could you write down the number? EDNA What for? NORMAN Can’t stop! And he runs upstairs. Edna grabs her darts-score NOTEBOOK & PENCIL, hurries out - CUT TO: EXT. MARKET INN, BARNSTAPLE - DAY 103   103 EDNA with her NOTEBOOK & PENCIL appears in the pub doorway. ANDREW NEWTON is sitting in his YELLOW HONDA.   Sees Edna. She stares.   Writes down the number.   Newton wants to hide, but... what can he do?   He sinks down in his seat a little. CUT TO: INT. MARKET INN, BARNSTAPLE - DAY 104   104 EDNA hurrying in, as NORMAN runs downstairs, in a new shirt. EDNA I got it, who is he? NORMAN He says someone wants to kill me. EDNA So why’ve you changed your shirt? NORMAN He’s very good looking. And Norman runs out. CUT TO: English Scandal Ep.2 Prod Script amended 27th Nov   50.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 198
    },
    {
      "scene_number": 9,
      "slugline": "EXT. TOWN SQUARE - DAY 105   105 NORMAN and ANDREW NEWTON sit on a bench.   Newton’s been making notes on SHEETS OF PINK PAPER, balanced on his knee. Norman scared, in awe, and a little turned on. ANDREW NEWTON ...so have I got it right..?   After all that, you still haven’t got your National Insurance Card? NORMAN I have not.   So tell me, what do you do, who are you exactly? ANDREW NEWTON I’m a Special Investigator. NORMAN What does that mean? ANDREW NEWTON It means... what it means.   Best if you don’t ask too many questions. NORMAN Right.   Well.   Okay.   But... you said we were going to meet the man who hired you?   Is that right? ANDREW NEWTON Yes.   I did.   No.   Not now.   All I can say is: you’re in mortal danger.   And now I’ve got to go. NORMAN But...   What?   Why? ANDREW NEWTON I don’t like the way that man’s looking at me. An ORDINARY MAN walking past.   Not even looking. NORMAN But you can’t just walk off.   Not after that!   What do I do? ANDREW NEWTON I will contact you.   As soon as the man from Canada arrives. NORMAN Is he the man you wanted me to meet or is he the man who’s going to kill me? English Scandal Ep.2 Prod Script amended 27th Nov   51.",
      "characters": [],
      "action_text": "ANDREW NEWTON (can’t remember) ...it’s complicated. Papers in hand, he walks off to the HONDA, parked nearby. Norman left behind, stunned. CUT TO: INT. MARKET INN, BARNSTAPLE - DAY 106   106 EARLY MORNING, EDNA still in her dressing gown, pokes her head up the stairs, calling for the second time: EDNA He said it’s important!   Hurry up! She’s holding the telephone receiver, stretched out on its curly wire.   NORMAN in PYJAMAS hurries down the stairs. NORMAN Is it him?! EDNA I don’t know, I think so. Norman takes the phone. NORMAN Hello..? CUT TO: EXT. BARNSTAPLE STREET - DAY 107   107 ANDREW NEWTON in a PHONE BOX. ANDREW NEWTON Norman?   It’s Andy here. NORMAN Who’s Andy? ANDREW NEWTON (bollocks!) I mean Peter. Pip-pip-pip, the phone demands money, Newton shoves in 2p. ANDREW NEWTON (CONT’D) He’s here.   The man from Canada. He’s come to kill you, and he’s already in Devon. English Scandal Ep.2 Prod Script amended 27th Nov   52. NORMAN Oh my God.   What do I do? ANDREW NEWTON Don’t tell anyone.   Not a word. But meet me.   Tonight.   The Delves Hotel, Pin Street.   Five o’clock. And he hangs up. Norman left scared for his life. CUT TO: OMITTED 108   108 OMITTED 109   109 INT. JEREMY’S LEADER’S OFFICE - LATE AFTERNOON 110   110 JEREMY at his desk.   Hard at work, going through papers, the Industry Act, 1975.   His SECRETARY appears in the doorway. SECRETARY I’ll be going home now, Mr Thorpe. Are you working late? JEREMY Needs must.   Thank you. SECRETARY See you tomorrow. And he’s left alone. The calm, the silence. Then, for a moment, thinking of something, he looks up. CUT TO: EXT. MARKET INN, BARNSTAPLE - LATE AFTERNOON 111   111 NORMAN, with RINKA, setting off.   It’s cold.   Rain on the way.   For a moment as he stands there, buttoning his coat... CU Norman, looking up at the darkening sky. CU Jeremy, INTERCUT sc.110.   Staring into space. Both men connected, for a moment, on the most important night of their lives.   Friday 24 October, 1975. Then Norman heads of",
      "dialogue_count": 0,
      "word_count": 766
    },
    {
      "scene_number": 10,
      "slugline": "EXT. MOORS - LATE AFTERNOON 113   113 The CORTINA drives along, from left to right, going from Barnstaple to Porlock, across Exmoor. Beyond them, the sea, and the dying light. CUT TO: OMITTED 113A   113A EXT. CASTLE HOTEL, PORLOCK - EVENING 114   114 A smart half-timbered hotel & bar.   The car’s parked, NORMAN’s already on the pavement, RINKA clambering out through the passenger door.   ANDREW NEWTON at the wheel. ANDREW NEWTON Get inside.   Wait in the bar.   I’ll come back and get you. NORMAN So where are you going now? ANDREW NEWTON Business. Andrew Newton leans over, pulls the passenger door shut. Drives off, fast. Norman left with Rinka.   This is all so strange. CUT TO: INT. BAR, CASTLE HOTEL, PORLOCK - NIGHT 115   115 Small bar, old and rural, oak beams.   Oppressive.   NORMAN sits waiting, with a whisky.   RINKA at his side.   Norman wondering what he’s doing here, what the hell is going on..? CUT TO: EXT. LAY-BY, MOORS - NIGHT 115A   115A ANDREW NEWTON has parked the CORTINA in a deserted spot. Trapped in the box of the car, he’s smoking furiously.   RADIO playing, loud, something Heavy Metal from Europe. Newton banging his head to the music.   Psyching himself up. Because tonight, he’s got to do a terrible thing. CUT TO: English Scandal Ep.2 Prod Script amended 27th Nov   55.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 223
    },
    {
      "scene_number": 11,
      "slugline": "INT. BAR, CASTLE HOTEL, PORLOCK - NIGHT 115B   115B NORMAN looking round.   The bar almost empty, but... hostile, somehow.   A fire burning and guttering in the grate.   A SOUR OLD MAN & WOMAN sit together, in silence.   The Sour Old Woman stares at Norman.   Like she   knows . The BARMAN won’t even catch Norman’s eye. Outside, it starts to RAIN.   Water pattering at the window. Then it gets heavier, pouring down, the night getting worse. Norman chilled to the bone. CUT TO: EXT. LAY-BY, MOORS - NIGHT 115C   115C RAIN.   Drumming against the car.   ANDREW NEWTON reaches into the glove compartment.   Takes out... A GUN.   A 1910 MAUSER PISTOL. He holds it.   Weighs it.   Still psyching himself up. He imagine shooting.   Mimes.   Like a kid.   ‘Pew!’   ‘Pew!’ Then he covers his face, scared.   Can he really do this? CUT TO: INT. BAR, CASTLE HOTEL, PORLOCK - NIGHT 115D   115D The RAIN hammers. The Sour Old Woman keeps looking. And NORMAN’s nerve breaks, he’s creeped out by this whole thing, he grabs his coat, and Rinka, heading off. NORMAN Come on, girl.   Let’s go home. CUT TO: EXT. CASTLE HOTEL, PORLOCK - NIGHT 116   116 RAIN, hammering down. NORMAN pauses in the doorway, with RINKA, buttoning up his coat.   Where the hell is he?   How to get home..? But then a CAR, opposite, FLASHES ITS LIGHTS. English Scandal Ep.2 Prod Script amended 27th Nov   56.",
      "characters": [],
      "action_text": "Norman realises it’s the CORTINA, runs across with Rinka.   As he opens the passenger door, shoving Rinka in, getting wet: NORMAN How long have you been sitting here?   I thought you’d gone!   Why didn’t you come and find me? ANDREW NEWTON I can’t be seen with anyone. NORMAN Why not?! ANDREW NEWTON Cos of my job.   Obviously.   Get in. NORMAN Can you take me home? ANDREW NEWTON Get in! NORMAN I am getting in! And finally, he’s in, slams the door. EXTERIOR CAR: the Cortina drives away. INTERIOR CAR: Norman still worried. NORMAN (CONT’D) What about the man? ANDREW NEWTON What man? NORMAN From Canada. ANDREW NEWTON Don’t worry.   You’ll be okay. (genuine, kind smile) I’ll look after you.   Honestly. Everything is going to be... fine and dandy, that’s what my mum always says.   Fine and dandy. CUT TO: EXT. MOORS - NIGHT 116A   116A RAIN.   The CORTINA drives right to left, across Exmoor. English Scandal Ep.2 Prod Script amended 27th Nov   57. Headlights slicing through the night. CUT TO: EXT. MOORS/INT.CAR - NIGHT 117   117 NORMAN in the passenger seat.   RINKA’s in the back.   ANDREW NEWTON driving, peering through the windscreen wipers, the rain, the dark.   And despite all his psyching up, throughout this long and strange evening, he’s not a killer.   He’s never done anything like this before.   He’s realising how hard it is.   How wrong.   But still.   Ten thousand quid. ANDREW NEWTON Are they aggressive?   Great Danes. NORMAN No, they’re soft old things.   Isn’t that right, Rinka?   You and me. Both soft old things, aren’t we? ANDREW NEWTON But... do they attack?   If someone attacked you.   What would it do? NORMAN She might.   I suppose.   They used them to hunt boars in the old days. ANDREW NEWTON Oh Jesus. Newton makes a noise.   Like the whistle of a boiling kettle. NORMAN Are you all right? ANDREW NEWTON Yeah. He makes the noise again. Tapping the wheel, now.   Psyching himself.   The moment close. And then, hopeless, he tries to be nice to Norman: ANDREW NEW",
      "dialogue_count": 0,
      "word_count": 1333
    }
  ]
}