{
  "slug": "about-alex-2014",
  "title": "about alex",
  "genre": "romance",
  "format": "film",
  "scenes_count": 11,
  "characters_count": 0,
  "characters": [],
  "total_words": 16892,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. BEDROOM, A RUSTIC CABIN - NIGHT 1   1  A pair of hands rifles through the pages of a book. Discards  it and grabs another. The process repeats until a folded up  ARTICLE is revealed, nestled within a hardback.  A slender yet handsome figure -- we don’t get a good look at  his face, but we’ll learn this is ALEX LINDEN (27) -- unfolds  and scans the pages. He stuffs them in his suit jacket, grabs  his cell phone and walks downstairs towards...  CUT TO:  INT. DOWNSTAIRS BATHROOM, THE CABIN - CONTINUOUS 2   2  Alex gets in the tub, raising the steaming water to the brim.  Grabs his phone and scans Twitter (@AlexLinden). New messages  cascade down the screen. He types:   Ask for me tomorrow, and  you shall find me a grave man.   Clicks “Tweet.” His message  joins a rushing tide and tumbles down the page, out of sight.  He drops his phone in the bath, revealing his stricken face.  CUT TO:  EXT. NEW YORK CITY - LATE AT NIGHT 3   3  An office building around midtown. A lonely figure is  illuminated at his desk by the glare of florescent light.  CUT TO:  INT. A BUSTLING NEWSROOM - CONTINUOUS 4   4  Phones ring. Shouts reverberate across the open room. Middle-  aged men with stained shirts and considerable guts bluster  down aisles of desks holding mock-ups of tomorrow’s paper.  BEN KAPLAN (27) -- tall and reedy, and more contemplative  than most -- takes a big gulp of coffee and hunches over his  computer. We GLIMPSE what looks like a fledgeling novel: The  words “Chapter Two” and a whole lot of white space.  NIGHT EDITOR (O.C.)  Ben. Your pages set?  Ben CLICKS AWAY quickly to a newspaper layout. The NIGHT  EDITOR slows as he nears but doesn’t stop.  BEN  Yeah, yeah. Almost.   *",
      "characters": [],
      "action_text": "Ben turns to his computer. SCROLLS to reveal A PHOTO of a man  in a penis costume getting arrested. An empty headline field  waiting to be filled.  Ben’s cell phone RINGS, breaking his concentration.  BEN (CONT’D)  Goddammit, Alex.  But Ben doesn’t recognize the number. Decides to answer it.  BEN (CONT’D)  Hello? Yeah I’m at work so--  (a beat)  Please tell me this is a sick joke.  Ben looks like he’s been hit by a ton of bricks. He CHECKS  HIS MISSED CALLS: It’s “ Alex Linden ” all the way down.  CUT TO:  INT. A BROOKLYN LOFT - A LITTLE LATER 5   5  SIRI HOPKINS (26) -- beautiful, arty, ethereal -- turns an  opened envelope over and over in her hands. Reopens it:  “Dear Ms. Siri Hopkins: Congratulations! You have been named  a J. Liddle Urban Architectural Fellow for 2013...”  Siri refolds the letter. Feels a heady mix of elation and  dread. She hears KEYS JANGLING IN THE HALLWAY and loses her  nerve. Flicks off the bedside light and lies back in bed.  The DOOR OPENS and Ben appears, silhouetted by the hallway  fluorescents. He sheds his clothes while Siri feigns sleep.  Slips into bed and holds her from behind. Siri stirs.  SIRI  Good day?  Ben buries his face in the nape of Siri’s neck.  BEN  Siri. It’s...  Siri opens her eyes and turns to fix Ben with her gaze.  SIRI  Hey. What happened?  2. BEN  It’s Alex.  CUT TO:  EXT. A UNIVERSITY CAMPUS - EARLY THE NEXT MORNING 6   6  Students walk briskly across dewy quads.  PRE-LAP: A PHONE RINGS.  CUT TO:  INT. A MUSTY UNIVERSITY OFFICE - CONTINUOUS 7   7  JOSH LIPSCHITZ (27) -- a spectacled, ill-shaven mess -- is  startled from sleep. His desk is covered in booze, books, and  cigarettes. He knocks them over while groping for his phone.  JOSH  I had a freshman roommate named  Ben, but that ass wad hasn’t called  in ages.  (takes in the bad news)  Oh fuck. Fuck me! Well I’m not  going.  (listens)  Because I’m not, okay?  Josh hangs up and blinks his eyes silently for a moment.  Suddenly possessed, he gathers up his belong",
      "dialogue_count": 0,
      "word_count": 1752
    },
    {
      "scene_number": 2,
      "slugline": "INT. ENTERPRISE RENT-A-CAR - CONTINUOUS   *  Isaac hands his CREDIT CARD to an EMPLOYEE, who walks away to   *  process his rental agreement. Kate stands next to him.   *  KATE   *  Have you heard how he’s doing?   *  ISAAC   *  I don’t know. How do people   *  normally do after things like this?   *  KATE   *  It depends. Most of the time they   *  say they regret it. But there’s   *  also a high rate of repeats.   *  Isaac processes this information.   They wait together in a   *  moment of awkward silence.   *  KATE (CONT’D)   *  It’s okay that I’m coming, right?   *  ISAAC   *  You said you wanted to come and I   *  said it’s fine. So, it’s fine.   *  KATE   *  No no no. I said I wanted to be   *  there for you if you wanted me to   *  be there. Should I not be here?   *  ISAAC   *  Of course you should be here.   *  Everyone’s excited to meet you.   *  The rental car employee returns with a CONTRACT and a SET OF   *  KEYS.   *  EMPLOYEE   *  I’m so sorry, but all our premium   *  class vehicles are unavailable.   *  Could we interest you in one of our   *  other options?   *  ISAAC   *  Yeah. Sure. Whatever has wheels.   *  KATE   *  I shouldn’t have come.   *  Isaac sighs. Kate’s a bundle of nerves.   *  CUT TO:   *  10.",
      "characters": [],
      "action_text": "INT. THE DINING ROOM, THE CABIN - AFTERNOON 19   19   *  Ben approaches the bathroom door. He’s armed with a sponge  and bleach and dreading what kind of scene Alex may have left  behind. He steels himself. Opens the door to reveal...  A QUICK YET DISTURBING GLIMPSE of dried blood in the bathtub,  clinging to the grout between the tiles. A bloody handprint.  Ben SLAMS the door shut. Before he can decide what to do he  hears Siri’s car PULL UP outside. Car doors OPEN AND SLAM.  JOSH (O.C.)  I’m just saying, it’s an objective  truth: The Japanese are the most  whacked-out people on earth.  Josh and Sarah tumble in the dining room. Siri’s behind them  with a BAG OF GROCERIES. Ben collects himself before joining.  SARAH  You’re like an eight-year-old  racist.  JOSH  Come on. Cram that many people on  an island and it’s like a  throbbing, inbred hothouse of  cultural miasma. Frankly, I’m  surprised they don’t have   more  fetishes.  (noticing Ben)  Ben Ben.  BEN  You came.  JOSH  Yeah against my better fucking  judgement.  Josh keeps his distance. There’s a split second of tension.  BEN  Get the fuck over here. 19A   19A  Ben wraps Josh in a bear hug. Josh wrestles away.  JOSH  Back me up here, Ben. We’re not  really   going to just pretend with  Alex like nothing happened, right?  All the levity of their greeting quickly vanishes.  11. BEN  What are you supposed to say? “Hey  Alex. Interesting choice to commit  suicide.”  SARAH  Thank you , Ben. Hi, by the way.  Sarah and Ben hug.  JOSH  I can’t believe you’re on her side.  SIRI  Hey. There are no sides. This is  about Alex, remember?  Everyone’s momentarily chastened by Siri’s comment. Then they  start going at it again.  SARAH  I think we should watch him.  JOSH  What? Like... set up a monitoring  system?  SARAH  It’d be casual. But yeah, tag in  and out. Have someone with him at  all times.  JOSH  We’re his friends, not the Gestapo.  This is ridiculous.  SARAH  No, it’s not. I   googled   it.  JOSH  Case in point.  T",
      "dialogue_count": 0,
      "word_count": 606
    },
    {
      "scene_number": 3,
      "slugline": "EXT. THE FRONT PORCH, THE CABIN - CONTINUOUS 20   20  Ben walks outside. Lights a cigarette to calm his nerves. And  runs smack into...  Alex, stepping out of a taxi. Alex’s face lights up when he  realizes who it is. Ben, for his part, looks stricken.  ALEX  You came!  BEN  Course I did.  Alex and Ben embrace. Alex starts back towards the house.  BEN (CONT’D)  How you feeling?  ALEX  I’m good!  (a beat)  Well, you know. Considering.  BEN  Alex. Look--  Ben halts things. Josh and Sarah’s LOUD VOICES from within  disrupt the moment.  ALEX  Don’t tell me we’re having a party  in honor of my suicide.  BEN  Jesus:   attempt . If it were a  suicide we’d both be wearing suits.  Alex smiles. His whole demeanor is too upbeat and exaggerated  to be believed. He opens the front door to find...  CUT TO:  INT. THE DINING ROOM, THE CABIN - CONTINUOUS 21   21  Josh and Sarah, mid-argument.  SARAH  The first 48 hours are incredibly  important. So if you can stop being  such a--  (she notices Alex)  Alex!  13.",
      "characters": [],
      "action_text": "Sarah drops everything and rushes for him, holding him tight.  After a moment, Alex extracts himself.  ALEX  Hey. It’s okay.  Sarah wipes away a tear and nods. Alex looks to Josh.  JOSH  You know, you could’ve just sent an  email if you wanted us to visit.  SARAH  Josh!  But Alex smiles. Hugs Josh. Then has a moment with Siri.  SIRI  We were going to pick you up.  ALEX  Don’t worry about it. This was  easier.  SARAH  Do you want to sit down? Can we get  you anything?  ALEX  No, I’m good.  SARAH  You sure?  It’s awkward. Alex is projecting equanimity but underneath he  just wants to get away from everyone’s cloying concern.  ALEX  Actually, I’m gonna go upstairs and  get changed. Feel a little gross,  if you know what I mean.  Sarah shoots Ben a look. Ben realizes it’s his cue.  BEN  Here. Lemme come with.  Alex shrugs, nonchalant. Ben follows him upstairs. The others  stare at each other, perplexed, until he’s out of earshot.  JOSH  Well he seems fine to me. Guess our  work here is done.  14. SARAH  Clearly he’s in shock.  JOSH  Way to act normal, by the way.  SARAH  Way to be an asshole.  OFF Siri, upset and irritated with both of them.  CUT TO:  INT. ALEX’S ROOM, THE CABIN - CONTINUOUS 22   22  Alex rummages for a fresh change of clothes while Ben takes  in his Spartan accommodations: a bed, a desk, and a stack of  books by Wilde, Joyce, Eliot, and Pound.  BEN  Jesus, Alex. Is this your only  blanket?  ALEX  It’s warmer than it looks.  Ben picks up a book and uncovers some LONGHAND SCRIBBLINGS.  BEN  Why’d you leave LA?  ALEX  I don’t know. Acting thing was only  going okay. That city’s a fucking  soul killer. And I just felt...  Alex removes his shirt. There are bandages on his wrists and  an intensity in his look that wasn’t there a minute ago.  ALEX (CONT’D)  I mean, shit. I was running out of  cash. My mom’s in fucking Bali. My  dad had left me this. You and I’d  kind of lost touch and--  BEN  Alex... about the calls... if I’d  known--  Alex cuts him off.  15.",
      "dialogue_count": 0,
      "word_count": 2540
    },
    {
      "scene_number": 4,
      "slugline": "INT. ‘BEN AND SIRI’S ROOM,’ THE CABIN - NIGHT 32   32  Ben and Siri undress and lie down on opposite sides of the  bed. A small universe separates them.  SIRI  Why did you lie?  BEN  What? When?  SIRI  To Alex. About the book.  BEN  I didn’t. I’m   working   on it.  (OFF Siri’s stare)  Because this weekend’s not about my  problems, okay? But we can schedule  one of those if you like.  SIRI  These are your   best   friends , Ben.  They’ll always be impressed by you.  BEN  Then they’re fucking idiots.  (a long pause)  He’d been calling me. A lot  recently.  SIRI  Who?  BEN  Alex. Always just checking in.  Nothing much to say. Asking about  the book, the book. It got to the  point where I was screening his  calls. When the hospital called I  thought it was him again. And I...  Ben chokes up. Can’t finish his sentence.  SIRI  Hey. It’s not your fault.  BEN  But it kind of is, right?  Ben look away from Siri. The gulf between them remains.  CUT TO:  30.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 175
    },
    {
      "scene_number": 5,
      "slugline": "INT. THE LIVING ROOM, THE CABIN - CONTINUOUS 33   33  Kate’s fallen asleep next to Isaac on the couch. Sarah, Alex,  and Josh sit across from them, overtired and slaphappy.  SARAH  Kate seems really sweet.  ISAAC  If you make one more comment...  SARAH  What? I’m being serious! She looks  as peaceful as a child.  Alex, Sarah and Josh try to stifle their laughter.  ISAAC  That’s it. Bedtime. All of you.  ALEX  I’m ready.  SARAH  Lemme come up with you?  Alex shrugs.  CUT TO:  INT. THE UPSTAIRS BATHROOM - NIGHT 34   34  Alex and Sarah brush their teeth, jockeying for space.  CUT TO:  INT. THE DOWNSTAIRS HALLWAY - NIGHT 35   35  Isaac carries a half-asleep Kate to their room.  CUT TO:  EXT. THE BACK PORCH - NIGHT 36   36  Josh sits alone, rolling a joint. Lights it.  CUT TO:  31.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 140
    },
    {
      "scene_number": 6,
      "slugline": "INT. ALEX’S ROOM, THE CABIN - NIGHT 37   37  Alex lies down and Sarah follows suit, her head in his lap.  SARAH  It’s funny. All of us breathing  under the same roof again. Do you  ever wish we could just go back?  ALEX  Sometimes. Actually, not really.  SARAH  Why not?  ALEX  I guess I was mainly just scared.  SARAH  Of what?  ALEX  Of you all. Of the possibility that  you didn’t like me.  SARAH  That’s ridiculous.  ALEX  It’s the truth. I remember, that  feeling, it didn’t go away until  junior year. Ben had me at his  parents’ place in New York for  Easter. I don’t know what it was.  It just felt like I’d entered this  warm space, you know? We took the  train there and back. Barely  talked. It was better than talking.  Sarah’s emotions swell. She sits up to look at him.  SARAH  Alex, I don’t know how to say this  but have you thought about therapy?  ‘Cause I’ve done it a lot and--  ALEX  You have? Why?  SARAH  You know. Just stuff about how I’m  constantly anxious but can never  pinpoint why.  32.  (MORE)",
      "characters": [],
      "action_text": "How ever since college I feel like  I can only be with guys who are  assholes or married. Or both.  ALEX  Has it helped?  SARAH  Well. I take Xanax now. That does  wonders for the anxiety. My  therapist says the other stuff is  very deep-rooted.  (a beat)  Oh my god. Here I am talking... I’m  so self-absorbed. This is why I  need therapy.  ALEX  No, it isn’t. We just need sleep.  SARAH  I know but... can I get you  something? Are you okay?  ALEX  Sarah. You’re going to have to stop  asking me that.  CUT TO:  INT. ‘ISAAC AND KATE’S ROOM,’ THE CABIN - CONTINUOUS 38   38  Isaac and Kate crowd together in a twin bed, spooning. Isaac  is drifting off to sleep. Kate is wide awake.  KATE  Isaac... Isaac.  ISAAC  What?  KATE  Are you asleep?  ISAAC  Yes.  Kate pauses.  KATE  What do you like about me?  (a quick beat)  You waited too long.  33.  SARAH (CONT'D) ISAAC  Come on. I was thinking!  KATE  Well now I can’t trust what you say  because it didn’t just come to you.  ISAAC  Are you being serious right now?  KATE  They all think I’m young and  stupid. Maybe I am.  ISAAC  You’re neither. Now   please . Stop .  OFF Kate, unable to slow her spinning mind.  CUT TO:  INT. THE UPSTAIRS HALLWAY - CONTINUOUS 39   39  Sarah exits the bathroom and stumbles into Josh.  SARAH  Whoa.  JOSH  Sorry. I was just...  Josh tries not to look at Sarah’s breasts.  SARAH  What?  JOSH  I was... watching   Real Housewives  of Atlanta   the other week and--  SARAH  No you weren’t.  JOSH  I was! It was on, I was there, I  couldn’t look away, and then I  thought, “This show, it’s really  about the human condition and--  SARAH  Josh. Shut up.  34. A pregnant moment. Then THEY’RE GOING AT IT, making out.  CUT TO:  INT. ‘BEN AND SIRI’S ROOM,’ THE CABIN - NIGHT 40   40  Ben and Siri listen to A BED GROANING RHYTHMICALLY.  SIRI  Sarah and Josh?  BEN  Like old times.  Siri kisses Ben. He can’t get himself to engage. She breaks  it off and turns away, frustrated. Ben hates himself. He  studies Siri’s beaut",
      "dialogue_count": 0,
      "word_count": 1010
    },
    {
      "scene_number": 7,
      "slugline": "INT. THE KITCHEN, THE CABIN - CONTINUOUS 46   46  Sarah walks in and pours herself a glass of water.  SIRI (O.C.)  Busted.  Sarah jumps. Siri’s drinking coffee in her running gear on  the front porch. She gets up and joins Sarah inside.  SARAH  Jesus. Do the others know too?  SIRI  Paper-thin walls.  SARAH  Perfect.  Sarah pours them each a mug of coffee.  SIRI  No one’s judging.  SARAH  Besides me! It’s like I’m this  mature, successful, adult person  now. Except when I’m with Josh and  then it’s sophomore year, and I’m  insecure, and--  SIRI  It’s complicated. He was your  first.  SARAH  No, it’s simple. He’s using me.  SIRI  Who’s to say you aren’t using him?  SARAH  Because he’s a man-child who uses  sex as a means of processing  serious emotional issues.  SIRI  And you’re an overworked tax  attorney who could stand to get  laid!  SARAH  M and A.  38.",
      "characters": [],
      "action_text": "SIRI  What?  Sarah shoots Siri a look of disbelief.  SARAH  Mergers and Acquisitions. That’s  the kind of law I do.  SIRI  Right.  Siri fiddles with the sugar jar. Sarah drops it.  SARAH  Are you still...?  SIRI  Yeah. I’m think I’m still a little  pregnant.  SARAH  Have you taken a test?  SIRI  I don’t want to.  SARAH  Why not?  Siri and Sarah are interrupted by THE SOUND OF FOOTSTEPS on  the stairs. Isaac enters and gives Sarah a bemused look.  SARAH (CONT’D)  Don’t. Say. Anything.  Isaac raises his hands defensively and grabs some coffee.  SIRI  You’re up early.  ISAAC  (holds up his Blackberry)  Conference call with Singapore.   If  I can find some freaking service.  And can you guys do me a favor and  make an effort to be nice to Kate?  SARAH  Why are you looking at me?  ISAAC  Why do you think?  39. SIRI  I found a signal on the porch. But  you need to lean over the railing  and hold one foot off the ground.  ISAAC  Fuck you.  SIRI  I’m serious!  Isaac’s PHONE RINGS. He weighs his options. Walks outside to  take it. Sarah and Siri watch from the window.  Outside, Isaac looks around. Leans over and lifts one foot.  Siri and Sarah duck down and LAUGH LIKE GIRLS MUCH YOUNGER.  Alex enters in running gear and the attention quickly shifts.  ALEX  What?  SARAH  You don’t run.  ALEX  I’m thinking of taking it up.  SARAH  You’re still recovering.  ALEX  I can always stop.  SIRI  I’ve been trying to motivate myself  all morning. Come with me?  Alex smiles at Siri.  CUT TO:  EXT. THE WOODS SURROUNDING THE CABIN - MORNING 47   47  Alex and Siri jog.  ALEX  So how’s Brooklyn?  SIRI  It’s fine.  40. Alex runs out of gas. He bends over, catching his breath.  Siri puts her hand on his back.  SIRI (CONT’D)  Hey. You okay?  ALEX  Those photos you put up the other  day look great. The way you and Ben  went to all those thrift shops.  Made the place seem so home-like.  All you need now is a golden  retriever.  Siri snorts. Starts walking and Alex walks after her.  ALEX (CONT'D) ",
      "dialogue_count": 0,
      "word_count": 1062
    },
    {
      "scene_number": 8,
      "slugline": "INT. THE UPSTAIRS HALLWAY, THE CABIN - DAY 51   51  Alex tries the bathroom door. It’s locked.  KATE (O.C.)  One second!  The door opens and Kate appears.  KATE (CONT'D)  All yours.  ALEX  Thanks.  There’s an awkward moment where Alex fails to move.  ALEX (CONT'D)  Hey. I’m sorry... about what I said  last night.  KATE  It’s okay. You’re not even 48 hours  removed from a traumatic event.  You’re suddenly the subject of a  lot of love and attention and it’s  making you feel a bit manic but  also oddly angry. I imagine you  experience rapid mood cycling and  you’re scared as hell about the  next time you’ll crash. So no, I’m  not taking it personally.  Alex is surprised by her insight and candor.  ALEX  Good.  KATE  And don’t worry. You’ll level off.  Kate brushes by him.  CUT TO:  EXT. THE MEADOW BEHIND THE CABIN - A LITTLE LATER 52   52  Josh runs into Siri, who’s performing sun salutations. He  lights a cigarette and gestures towards some flowers.  JOSH  Early for these guys to be in  bloom.  45.",
      "characters": [],
      "action_text": "SIRI  Who are you? Ralph Waldo Emerson?  JOSH  Just an avid student of climate  change. Did you know they’re using  Thoreau’s diaries to measure the  effects? In 15 years you’ll be able  to plant mangos here. I’m just  waiting for the right moment to buy  up vast tracts of Canadian  wilderness and then--  Josh trails off. Siri looks up at him from her downward dog.  SIRI  What? Then what?  Josh realizes he’s been staring and looks away.  JOSH  Nothing.  CUT TO:  INT. ‘ISAAC AND KATE’S ROOM,’ THE CABIN - A LITTLE LATER 53   53  Isaac KNOCKS ON THE DOOR and enters.  ISAAC  Knock, knock? Who’s there?  He finds Kate, reading on the bed.  ISAAC (CONT'D)  Hey. I’m done with work. Want to  take a walk?  (Kate shrugs)  Okay. What’s up?  Kate keeps reading. Isaac lies down and puts his head down on  her stomach, obstructing her line of sight. Kate sits up.  ISAAC (CONT'D)  Kate.  KATE  Every time I turn around you’re  laughing with her. Or you’re  reminiscing with her. Or--  ISAAC  You’re being ridiculous.  46. KATE  Go ahead. Belittle my feelings.  That always helps.  Kate gets up and goes for the door.  ISAAC  Kate. Come on!  But she walks out. OFF Isaac, lying on the bed.  CUT TO:  EXT. A BEND IN THE RIVER - DAY 54   54  A pair of feet dip gingerly into the stream. Alex, Ben, Josh,  and Isaac sit on rocks on the river bank.  ALEX  You’ve got great southern exposure,  so I was thinking of installing a  solar array. Maybe a few rainwater  basins too.  JOSH  And then you’d have everything you  need to start your own cult.  Wouldn’t that be something?  BEN  I’m in.  Josh wields a fishing rod. Casts a line. He’s an inept  fisherman.  JOSH  You guys remember Michael?  ISAAC  I still see him sometimes.  JOSH  Guess how much he made when  facebook   went public?  BEN  I don’t want to.  JOSH  60 million dollars.  Isaac whistles.  47. JOSH (CONT'D)  How much do you make?  ISAAC  Enough.  JOSH  Come on. I think we’re past  politeness.  ISAAC  I know you are.  (a beat)  I’m still the",
      "dialogue_count": 0,
      "word_count": 1108
    },
    {
      "scene_number": 9,
      "slugline": "INT. A SMALL GROCERY STORY - DAY 57   57  Sarah and Kate peruse the produce aisle. Kate grabs a  watermelon and holds it aloft.  KATE  Will this one work?  Sarah takes it, holds it to her ear, and taps on it.  SARAH  Not ripe enough.  Sarah selects another. Repeats the process. Puts it in the  cart and moves on brusquely. They reach a pyramid of apples.  KATE  When did you first meet Isaac?  SARAH  Freshman year. He lived across the  hall.  KATE  God I was so nervous about going on  this trip. I guess I still am.  SARAH  (still uninterested)  Oh yeah?  KATE  Isaac just looks up to you guys so  much. It’s like meeting the  parents, but worse because there  are five of you.  SARAH  Be happy you’re not meeting his  parents.  Sarah moves on to the onions. Kate tries a different tactic.  KATE  I’m so jealous of you.  Kate succeeds in getting her attention with that one.  SARAH  Why?  KATE  You guys just have all these  experiences of him I’ll never have.  52.",
      "characters": [],
      "action_text": "SARAH  Well. What do you want to know?  KATE  I just want to feel like I’ve known  him for years.  SARAH  Isaac was... shy, sweet. The only  one of us from the Midwest. The  least neurotic of the bunch by far.  KATE  I can see it. Sometimes I think he  takes me fancy places to impress  me. Which is really cute, but it’s  not why I like him.  SARAH  Why do you?  KATE  Because he’s grounded. He’s kind.  And he gets all worried when I’m  sad. The other week we celebrated  our quarter-year anniversary. Which  is ridiculous but made me so happy.  And he has the right priorities.  Which I think is really rare.  Sarah absorbs Kate’s description. Allows herself -- just for  a second -- to be overcome.  KATE (CONT'D)  Is everything okay?  SARAH  (recovering)  Yeah. You’re right. That’s exactly  him! What else is on our list?  CUT TO:  INT. THE KITCHEN, THE CABIN - CONTINUOUS 58   58  Drenched to the bone, the guys burst in. Siri is at the  table, drinking a cup of tea.  ALEX  Big news.  SIRI  What?  53. JOSH  Isaac’s a Republican.  SIRI  Really?  BEN  That’s not the news.  The dog bounds in and SHAKES HIMSELF DRY, soaking everything.  BEN (CONT'D)  We found a dog.  SIRI  What? Where?  BEN  I don’t know. In the woods.  ALEX  I’m going to take a shower.  Everyone looks at one other. Ben moves to follow Alex.  BEN  Uh. Here. Lemme--  ALEX  What? Bathe me?  BEN  No. Just--  ALEX  I’m fucking fine, okay?  (to everyone)  Thanks for all the concern, but I’m  fucking fine! And you can stop  following me around, okay?  Alex stomps upstairs.  ISAAC  What do we do?  JOSH  You heard the man. He’s fucking  fine!  No one finds this particularly funny.  SIRI  He’s okay.  54. BEN  How do you know?  SIRI  I... just know.  BEN  I’ll invent an excuse to go up  there in a minute.  Sarah and Kate burst in the door, bearing loads of groceries.  JOSH  Sweet nectar and ambrosia!  SARAH  There’s more in the car.  Everyone gets up to help. Sarah hands Ben the car keys. The 58A   58A  dog goes to Sara",
      "dialogue_count": 0,
      "word_count": 5631
    },
    {
      "scene_number": 10,
      "slugline": "EXT. THE FRONT OF THE CABIN - CONTINUOUS 85   85  A moonlit driveway. Ben brushes by a confused Josh. Alex is  the first to catch up with him. He grabs his shoulder and  spins him around.  ALEX  Ben.  BEN  What can you possibly say to me  right now?  The others begin to gather a short distance away. Alex tries  to put his arms around Ben.  ALEX  That I... I love you. More than  anyone in this world.  Ben flings Alex’s arms away and keeps moving.  BEN  Fuck you.  He goes to open the driver’s side door of Isaac’s rental car.  Alex tries to grab him again.  ALEX  Come on, Ben. You don’t even know  how to drive.  Ben TURNS AND SLUGS ALEX in a single motion, sending him  reeling.  BEN  Can’t be that fucking hard.  He hops in the car, finds the keys in the ignition, and  starts the engine, cruising unsteadily down the driveway.  THERE’S PANDEMONIUM as Alex and Isaac chase after the car  while Siri runs to her Saab and tries to open the door.  Siri searches frantically for her keys but can’t find them.  Out of breath, Alex and Isaac rejoin the others and look to  Siri, who’s emerged from her car.  ALEX  Where are your keys?  86.",
      "characters": [],
      "action_text": "SARAH  (suddenly remembering)  I gave them to Ben...  Everyone looks to one another, unsure what to do now and  helpless to change the situation.  CUT TO:  I/E. ISAAC’S CAR - CONTINUOUS 86   86  Ben drives poorly. Cursing, drunk, he fumbles around the  steering column, trying to find the headlights, ACTIVATING  THE WINDSHIELD WIPERS instead. Finally, he switches on the  lights. They illuminate a large tree in his path.  Ben slams on the breaks. But it’s too late. The car skids  into the tree.  For a moment, EVERYTHING IS QUIET. Ben’s dazed and bleeding  slightly from his forehead. He tries moving. It slowly dawns  on him that he isn’t very hurt.  Ben stumbles outside and performs a cursory inspection of the  car. Suddenly realizes he’s very cold.  Ben climbs back into the car and sprawls out across the  backseat. Looks over and notices A PEN AND PAD OF LEGAL PAPER  in the seat pocket. Grabs it and hurls it across the car.  CUT TO:  INT. THE LIVING ROOM, THE CABIN - NIGHT 87   87  Alex approaches the door to the downstairs bathroom. Opens it  and takes in the messy scene without flinching.  CUT TO:  INT. SARAH’S ROOM - NIGHT 88   88  Siri tentatively opens the door. Crawls into bed with Sarah.  Sarah turns and puts her arms around her.  CUT TO:  87.",
      "dialogue_count": 0,
      "word_count": 433
    },
    {
      "scene_number": 11,
      "slugline": "INT. ‘ISAAC AND KATE’S ROOM,’ THE CABIN - NIGHT 89   89  Kate sleeps. Isaac lies awake, watching her with a mixture of  guilt and tenderness.  CUT TO:  INT. ALEX’S ROOM, THE CABIN - NIGHT 90   90  Josh enters with a package of frozen peas, looking for Alex.  Finds Ben’s article instead. He starts reading it. Smiles.  PRE-LAP: The sound of VIGOROUS SCRUBBING.  CUT TO:  INT. THE DOWNSTAIRS BATHROOM - CONTINUOUS 92   92  Two hands with bandaged wrists move rhythmically across the  tiles. Alex is on his knees, removing blood stains from the  grout. He works feverishly, but he doesn’t seem desperate.  Instead he’s simply resolved to accomplish the task at hand.  CUT TO:  EXT. A MILE DOWN THE ROAD - VERY EARLY THE NEXT MORNING 91   91  The sun is just beginning to cast a faint glow in the east. A  hand scribbles notes furiously on a yellow legal pad. Ben is  doing something he hasn’t done in a long time. He’s writing.  [SCENES 92-94 OMITTED]   *  CUT TO:  INT. THE MUD ROOM, THE CABIN - CONTINUOUS 95   95  Kate emerges, feeling hung over. She notices Alex sitting on  the stairs, a package of frozen peas against his eye.  KATE  Hey.  Alex notices her.  ALEX  Hey. How was your shift?  Kate sits down next to him.  88.",
      "characters": [],
      "action_text": "KATE  Nobody killed themselves.  ALEX  That’s good.  KATE  Not that you believe I had a hand  in that.  Alex thinks a second, then looks at her.  ALEX  Actually, that reminds me of  something I wanted to talk to you  about.  KATE  Yeah?  Kate sits down besides Alex on the stairs.  CUT TO:  INT. THE KITCHEN, THE CABIN - A LITTLE LATER 96   96  Josh enters with the dog on a MAKESHIFT LEASH and finds Isaac  and Siri. Isaac looks at him funny.  JOSH  What?  Sarah appears. She and Isaac both reach for the coffee  machine at the some moment, then retreat. It’s awkward.  JOSH (CONT'D)  Will someone please tell me what  the hell is going on?  Alex and Kate walk in. Alex avoids eye contact with Siri as  he pours himself coffee.  ALEX  Guys, I have an announcement. I’m  sorry for fucking up all your  lives.  JOSH  Mine was already fucked. So don’t  mention it.  89. ALEX  This isn’t a joke. I’m the cause  of... all of this.  SIRI  No, you’re not.  ALEX  Yes, I am. So please just let me  take some responsibility.  Alex heads for the door. Sarah makes a move to go after him.  ALEX (CONT'D)  Please. Alone.  Alex leaves. They all hear the front door OPEN AND CLOSE.  [SCENE 97 OMITTED]  CUT TO:  EXT. A MILE DOWN THE ROAD - DAY 98   98  Alex keeps walking. Takes in the bird song. Calms his breath.  Finally, he catches sight of what he’s been looking for:  Ben sits in the opened trunk of Isaac’s car. He’s writing on  the same legal pad and seemingly oblivious to everything  else.  As Alex gets close, Ben finally notices him and looks up.  BEN  Nice shiner.  ALEX  Nice driving.  (a beat)  What you doing?  BEN  Just writing.  Alex allows himself to smile, but it quickly vanishes.  ALEX  Ben. I’m a little fucked up.  BEN  Really?  90. ALEX  Can I play that card right now?  BEN  Go ahead.  ALEX  For how long, do you think?  BEN  Wouldn’t push your luck.  Alex starts to break down.  ALEX  I’m just so--  BEN  Hey. World’s got enough people you  gotta explain yourself to.  Alex smiles at he",
      "dialogue_count": 0,
      "word_count": 2435
    }
  ]
}