{
  "slug": "ad-astra-2019",
  "title": "ad astra",
  "genre": "sci-fi",
  "format": "film",
  "scenes_count": 4,
  "characters_count": 1,
  "characters": [
    "ROY MCBRIDE"
  ],
  "total_words": 21662,
  "total_dialogue": 1,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. COLORADO MOUNTAINS - PLATEAU Roy sinks to the surface.   A WIDE SHOT as we SEE: SCORES of PEOPLE RUNNING TO HELP HIM... MAN’S VOICE (PRE-LAP) I must say, you seem to be in remarkably good shape, Major. INT. HOSPITAL - COLORADO SPRINGS CAMPUS - NIGHT A ROW of HOSPITAL BEDS.   Roy is sitting up, on one of them. Each seat/bed has a SCREEN NEXT TO IT.   Large WINDOWS LOOK OUT INTO THE COLORADO WILDERNESS. A pair of MED TECHS are here, doing CHECKS on Roy. Roy sits alongside a window as they check his heart, lungs, blood pressure, temperature, etc.   Roy looks out the window. Earth, dusk.   Beautiful, with cloud formations.   He has trouble keeping eye contact with the Medical Officers.   A MAN takes ROY’S PHOTOGRAPH. MED TECH #1 (CONT’D) How d’you feel? ROY MCBRIDE Well...my left shoulder’s a little sore.   It was likely hyperextended at some point during descent. MED TECH #1 (CONT’D) Yeah, you got yanked around pretty good.   But you’re in one piece. (beat) Sad to say, some of your fellow engineers weren’t so fortunate. ROY MCBRIDE (beat) What’s that, sir? MED TECH #1 We lost your support crew, on the wire--and four hundred some odd more here on earth, too.   Been tragic. ROY MCBRIDE Gee...   That’s real unfortunate. I’m real sorry to hear that... 9.",
      "characters": [],
      "action_text": "MED TECH #2 Would you like the shades down, Major? ROY MCBRIDE No, it’s okay.   I like to observe the, the cloud patterns and the mountains. The Med Tech hears this, nods, then TYPES something into a small iPad-type device, except it unscrolls.   The CAMERA TILTS UP the ELECTRONIC DOCUMENT TO SEE: “MILD AUTISM”. As the Med Techs pack up, Med Tech #1 holds an earplug-sized item. MED TECH #1 (hands Roy the earplug) You might want to put this in your ear, sleep with it overnight.   Just to check for any head trauma.   And try to stay put, if you can. ROY MCBRIDE Yessir.   I would like to be able to return to my work. MED TECH #1 [If] Your head checks out, you can be cleared to go back as soon as tomorrow. ROY MCBRIDE Okay.   I’d like that very much. Given all that’s occurred, they’re probably pretty shorthanded up there. MED TECH #1 (stares for a beat; then) Of course.   Try to rest. He packs up and leaves. INT. DORMITORY - LATER Roy is in bed, sitting up in hospital whites.   A GREEN LIGHT and a BUZZ to his left.   He PUSHES A BUTTON.   PROJECTED in front of him, a very advanced form of FaceTime is showing: His mother.   LEANNE MCBRIDE.   Late sixties.   Seems older than her age; her face is lined, her mouth slightly downturned.  10. She SEES him, EXPLODING WITH EMOTION. The sound is worse than the image, for some reason: LEANNE MCBRIDE Roy! TEARS FLOW FORTH from HER: LEANNE MCBRIDE (CONT’D) Thank the Good Lord!   I couldn’t lose you up there too.   You’re all I’ve got... ROY MCBRIDE Hello, Ma.   I’m all right.   I’m gonna go back to work soon. LEANNE MCBRIDE I love you--so much.   I was just so sick with worry-- ROY MCBRIDE (smiles) There’s no reason for any kind of concern.   The fuss is unnecessary. LEANNE MCBRIDE Oh Lord...   I know you don’t understand--you can’t.   Maybe someday you will...   I’m sorry you’re alone there... ROY MCBRIDE It’s okay. (beat) I prefer it. LEANNE MCBRIDE I love you, Roy.   You’ll always be my little one.   Maybe I can see you for Thank",
      "dialogue_count": 0,
      "word_count": 604
    },
    {
      "scene_number": 2,
      "slugline": "INT. DORMITORY - LATE NIGHT The room is DARK.   ROY is prostrate, in bed, asleep. RESTLESS.   We HEAR his PULSE, HIS HEART... Roy’s EYES OPEN, and he is COVERED IN SWEAT.   His EYES WIDEN-- like he’s SEEING A GHOST. AWAKE, he has a VISION.   FLASHING: An image appears to him, and to us: The striking eyes and most of the face of a YOUNG BOY.   He seems around 8 years- old, looking off-screen at something.   He's smiling and blinking, in EXTREME, STEP-PRINTED, SLOW MOTION. But the image is very UNCLEAR.   It’s BLURRY, almost like a reclaimed moment from the Zapruder footage. WIDER SHOT -- again, EXTREME SLOW MOTION.   A SMALL BOY (probably the same person as the one in the previous image) runs across what might be a wet, cobble-stoned street, on a cloudy day.   This time: A GIRL, an OLDER GIRL, is JOINING HIM.   The image is haunting. The final image: striking, mainly because it's so odd.   A MEDIUM SHOT of what looks like a MEDIEVAL CASTLE (!) IRON GATE, COMING DOWN, in the same EXTREME, STEP-PRINTED, SLOW MOTION as in the other image. ROY’S BREATHING BECOMES LABORED. CLOSE SHOT on ROY as he then looks out the window.   His panic abating somewhat, he allows his head to REST back, ON THE PILLOW.   His EYES DART BACK AND FORTH, looking out to the ceiling--and to the heavens... FADE OUT. CUT IN: INT. HALLWAY - MORNING A YOUNG WOMAN IN ARMY FATIGUES comes down a hallway. INT. DORMITORY She approaches ROY, who is dressed and sitting up.   Going through a “Scientific American” on-screen magazine. 12.",
      "characters": [
        "ROY MCBRIDE"
      ],
      "action_text": "YOUNG WOMAN IN ARMY FATIGUES Morning, Major.   I’m here to take you to SPACECOM Control.   For debriefing.   Is that okay? ROY MCBRIDE Course, Ma’am. INT. FORT CARSON - CONTROL CENTER - MORNING It’s the center of the base.   A big “USSPACECOM” SIGN.   Roy is being escorted by the woman. A restaurant, a souvenir stand.   MUZAK plays softly. Families are here, excited.   There is a TOURISM BOARD desk (A SIGN READS, “READY TO MEET AN ALIEN? GO TO SPACE!”).   A LARGE ALIEN CHARACTER, meant to appeal to children, graces the painted board: ”Andy The Alien”.   Two YOUNG CHILDREN get their PHOTOS TAKEN in ill-fitting army spacesuits in front of a powder-blue backdrop. INT. FORT CARSON - CONTROL CENTER - CORRIDOR Roy is led down a long, winding CORRIDOR until he reaches a closed door. YOUNG WOMAN IN ARMY FATIGUES Would you like anything to eat or drink, Major? ROY MCBRIDE (friendly smile) No, thank you.   The food’s real good in the dorm. YOUNG WOMAN IN ARMY FATIGUES That’s wonderful to hear.   We brought in a new caterer last month and I think it’s gotten a lot better. And a LATCH OPENS: INT. FORT CARSON - CONTROL CENTER - USSPACECOM HEADQUARTERS This is USSPACECOM’s covert ops headquarters.   Present are FIVE of Roy’s SUPERIORS.   HE SALUTES THEM, mumbles cordial “HELLOS”. 13. They are: BRIGADIER GENERAL FALLON, LIEUTENANT GENERAL SHARPE, COLONEL EPINGER, and a woman, ADJUTANT GENERAL AMELIA VOGEL, who refers to a PDA-type device. Among the others here is an older man, seated SILENTLY in the corner.   Observing.   His name, we will learn, is DR. MARTIN PEDROSA.   More on him later. BRIGADIER GENERAL FALLON Major, I’m Brigadier General Fallon.   This is Lieutenant General Sharpe, Director of SPACECOM Special Operations.   And Adjutant General Vogel. ROY MCBRIDE (nods; then) Sirs.   Ma’am. The DOOR is CLOSED BEHIND THEM.   Actually, more SEALED THAN CLOSED.   Fallon motions for Roy to sit, and he does as well. As the others sit around him, he’s looking at a file: BRIGADIER G",
      "dialogue_count": 1,
      "word_count": 7516
    },
    {
      "scene_number": 3,
      "slugline": "INT. THE CEPHEUS The group settles in just a bit.   The distant sounds of the ENGINE are a soothing, rhythmic lullaby. DONALD SCOBEE SpaceCom, we are commencing CTP ingestion. Everyone TAKES A PILL which comes ejected from the console-- EXCEPT FOR ROY, who PALMS THE PILL and SLIPS it into his pocket. INT. THE CEPHEUS - COCKPIT - LATER Roy looks at his fellow travelers, all engaged in checklist tasks, other mundane activities: DONALD SCOBEE Pilot report A one-niner, Mars trajectory...   The burn was on time.   The residuals before nulling- -minus 0.1... ROY MCBRIDE Captain, I think my suit’s suffered an oxygen leak.   It’s going to require an epoxy patch. LAWRENCE BLUNT Happy to assist, sir. ROY MCBRIDE That won’t be necessary, Captain. Thank you.   I’ve got it. As Roy gets up, we SEE, to his RIGHT: “CAUTION: MANUAL BOOSTER CONTROL”. INT. CARGO AREA Roy floats in to a SECLUDED PART of the ship.   He pulls out what Pedrosa gave him.   The DOSSIER/AMULET, a thin, silver card.   He inserts it into a slot of a small computer that is in his sleeve.   Inserts an earbud. LASERS and OPTICS read his irises.   SCREENS on his helmet inside display his biorhythms. ROY MCBRIDE Password DAISYWHEEL.   Slate 23. 46.",
      "characters": [],
      "action_text": "The password and bioscan activate the ELECTRONIC DOSSIER. The dossier opens up on a screen before him--in what looks like MID-AIR. ON SCREEN: “LIMA TRANSMISSION INTERCEPT: 12/14/16. UNTELEVISED CANADIAN BROADCASTING CHANNEL INTERVIEW: H. CLIFFORD MCBRIDE” INT. FIAT LUX - OCULUS BASE PROFESSOR H. CLIFFORD MCBRIDE, looking into the camera. Unlike videos from today’s astronauts, these are HD, fluid images. H. CLIFFORD MCBRIDE Hello CBC...Toronto... H. Clifford McBride is on a space station, but exactly where is unclear.   He looks haggard and unkempt.   UNHINGED. H. CLIFFORD MCBRIDE (CONT’D) I’d like to use this opportunity to reach out directly.   To my son.   If you could get this to him...please... (beat) Roy...   Solitude has increased my perception... I look so far into the universe here, and I see how cruel it is in its indifference... So many planets potentially suitable for life, yet as of now we hear and see nothing...   I’ve come to worry that our own long-term survival is in doubt.   My death is not something I fear.   But--the extinction of ALL ideas, of all human expression--that is the true terror.   Our consciousness must extend into the future, past any force that renders us extinct.   We must commit ourselves to this goal... (beat) And so I, I...   If you see this-- we’re, we’re real far away.   And some people haven’t been able to keep their composure... (looks down, avoiding) It’s been very difficult... 47. ANGLE ON ROY.   His FACE registers that this is his father, addressing him directly--and his father doesn’t look good. Roy looks down, at his SLEEVE.   His VITALS.   Over this: H. CLIFFORD MCBRIDE (CONT’D) I’m sure you will have a lot of questions about the choices I’ve had to make.   But...   Perhaps someday you’ll understand.   I do miss you.   I’m sure you miss me, too. ROY’S PULSE STARTS CLIMBING...   So he has to stop watching before the computer redflags his bioactivity... CUT TO: INT. CEPHEUS - CARGO AREA Roy takes the small stick given to ",
      "dialogue_count": 0,
      "word_count": 5466
    },
    {
      "scene_number": 4,
      "slugline": "INT. ROVER A wonder to behold.   ALL DIALOG IS RADIO FILTER:  FRANCESCA DESANCTIS That is Valles Marineris, over to your right--it’s a thousand times bigger than the Grand Canyon on earth.   And just about every other month an earthsick person throws himself off it. INT./EXT. FRONT ROVER - CONTINUOUS Francesca DeSanctis gestures to a large structure that they’re about to pass. FRANCESCA DESANCTIS The area we’re entering was self- sufficient at one time, with a greenhouse and self-replicating units for maintenance and repair. (to Collins) You can take us right to that white circle, Kathryn. KATHRYN COLLINS Will do. Collins pulls the rover over to the side of the road, near a WHITE STEEL CIRCLE TUBE in the dirt--about 10 feet in diameter.   Roy leans forward.   To Collins: ROY MCBRIDE I have activated GPS so you can find us.   When we’re done.   It reports that we have twenty-six minutes until we need to be inside. KATHRYN COLLINS Roger that.   We’ll be more than happy to come pick you up on our Mars Taxi service! (no answer from Roy, so) Good luck, both of you! EXT. MARS - VALLES MARINERIS - CONTINUOUS The rover’s doors open.   Roy steps out. Roy and Francesca are left all alone as the Rover leaves behind a trail of dust. 73.",
      "characters": [],
      "action_text": "It’s silent.   The landscape is mostly barren--the greenhouse, the radio telescope, and a few other structures are in the distance. A purple DUST STORM materializes, gathers, grows, approaches. The atmosphere is obscured. Luckily, the atmosphere is so thin that these twisters are harmless--they just leave a RED/VIOLET HUE over Roy’s and Francesca’s spacesuit and helmet. Francesca finds a HATCH, covered in dust and dirt.   POINTS TO ROY.   Roy bends down, shoves the dirt away and find a metal protuberance.   After removing more dirt, he is ABLE TO LIFT UP THE HATCH. DOWN THEY GO, INTO AN UNDERGROUND CHAMBER. INT. UNDERGROUND CHAMBER A CONCRETE SARCOPHAGUS.   A WALL.   With a CIRCULAR WHEEL, leading DOWNWARD.   FRANCESCA GESTURES. ROY TURNS THE WHEEL.   It opens, and they descend into the DARK WATER: INT. TUNNELS THEY ARE NOW SWIMMING in a TUNNEL of DARKNESS.   Roy and Francesca have HELMET LIGHTS which illuminate a few feet in front of them. They PULL THEMSELVES ALONG by the GUIDE ROPE. ROY’S SLEEVE BLINKS: “EXCESSIVE RADIATION” INT. DEEPER INTO THE TUNNELS They are dark. Only a few feet in front of Roy is illuminated. THE TWO PULL THEMSELVES ALONG THE ROPE SLOWLY and CAREFULLY. INTO THE DARKNESS. But then we see the movement of particulate in the air. Something is causing dust to disperse in that DARK TUNNEL... ROY MCBRIDE Something appears to be moving. 74. The breaths quicken. TERROR on her face.   He looks down the pipeway; he can focus on nothing else... SOMETHING begins to appear in the darkness... FRANCESCA DESANCTIS I just received a text message, imploring us not to proceed.   It says if we do we will be destroyed... SLOWLY BUT SURELY we begin to make it out... It is a creaturelike SELF-REPLICATING MACHINE. We’ve SEEN SOMETHING LIKE IT before; they were working on the tether, in the beginning of our story.   But this one is larger, somehow more unforgiving.   Its HEAD is ONE HEADLIGHT; the head looks like Odilon Redon’s portrait of the CYCLOPS... It charges ",
      "dialogue_count": 0,
      "word_count": 8076
    }
  ]
}