{
  "slug": "adjustment-bureau-the",
  "title": "Adjustment Bureau, The",
  "genre": "unknown",
  "format": "film",
  "source": "imsdb",
  "scenes_count": 3,
  "characters_count": 0,
  "characters": [],
  "total_words": 27241,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "OPENING",
      "characters": [],
      "action_text": "<b>                             THE ADJUSTMENT BUREAU </b> Written by George Nolfi Based on a short story by Philip K Dick <b>          BLACK SCREEN </b> The sounds of a large crowd, but muffled, as if we're inside, and hearing the crowd through a window or door. FADE IN ON: <b>          INT. SOME SORT OF LOBBY -- DAY </b> DAVID NORRIS, 33, is having a private moment, looking down, thinking. He wears a suit and tie. He seems relaxed and confident. Content. Completely in his element. In one of hi",
      "dialogue_count": 0,
      "word_count": 8068
    },
    {
      "scene_number": 2,
      "slugline": "EXT. CIRCLE LINE CRUtgE -- DAY",
      "characters": [],
      "action_text": "The boat pulls away front=the dock. It's misting rain so there's only asmattering of tourists on-board. David stands looking back at Manhattan. Harry is next to him. <b>                         HARRY </b>          A lot of people just collapse when they see what you've s'een. Their personal choices suddenly seem meaningless to them. Life starts to feel pointless. <b>                         DAVID </b>          I was` raised to believe there's something behind the curtain. I just never pictured i",
      "dialogue_count": 0,
      "word_count": 15093
    },
    {
      "scene_number": 3,
      "slugline": "INT. DANCE COMPANY -- Nit;HT",
      "characters": [],
      "action_text": "Elise dances. <b>          INT. UNDERGROUND PUMPING STATION -- NIGHT </b> <b>                         HARRY </b>          one wearing a hat Is. a threat. vv1Le. h e rea lizes w hat' = g oin g on , Thompson is gong to pull out all the stops. H going to get reinforcement Jots of them. I don't care if u'see a auv wearing a Yankees ca a\"yarmulke, or a bowler, as he's working for them. <b>                         'DAVID </b>          Okay, you said he's right in front of me, right? Harry nods. <b>",
      "dialogue_count": 0,
      "word_count": 4080
    }
  ]
}