{
  "slug": "after-the-wedding-2019",
  "title": "after the wedding",
  "genre": "drama",
  "format": "film",
  "scenes_count": 8,
  "characters_count": 0,
  "characters": [],
  "total_words": 23114,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. CALCUTTA INDIA. FROM ABOVE - MORNING 1   1 We soar above the busy, dilapidated city, towards the outskirts of town, where we close in on the remnants of what looks like an ancient, abandoned temple. INT./EXT. DILAPIDATED TEMPLE, OUTSKIRTS OF THE CITY 2   2 ISABEL (39), leads a meditation. She’s not native to this part of the world, though her skin is deeply tanned and her hair is streaked from the sun. Her eyes are closed and she emits a subtle chanting sound. Her lids flutter and her eyes open and look right at us. WHAT SHE SEES: Sitting facing her, are a dozen Indian children attempting to meditate. One lies on his back looking up at his hands, pretending they are a bird, flying over head. Isabel stands and walks to him. She kneels next to him and looks at his bird-hands. After a moment, she lies next to him. She whispers in ‘Bengali’. ISABEL (In Bengali) What kind of bird is that? The 7 year old boy, JAI, looks at her and shrugs his shoulders. Isabel puts her hands up in the air and makes a bird of her own. They fly together. ISABEL (CONT’D) (Bengali) Why don’t you sit up and meditate with the others and you can imagine as many birds as you like. JAI (Bengali) I don’t want to close my eyes today. Isabel examines his precious face. ISABEL OK. But help me with the bell. Jai smiles and excitedly scampers to his feet. He puts his hands out to help Isabel up.",
      "characters": [],
      "action_text": "Jai goes to the front of the room and grabs a bell. He looks to Isabel in anticipation, and she nods. With all his might, he shakes the bell and a low ring emanates, signaling the meditation is over. The others open their eyes. Jai laughs at their surprised expressions as they see it’s him with the bell. EXT. DILAPIDATED TEMPLE - DAY 3   3 Like the pied piper, Isabel leads the children out of the beautiful but broken down temple, back into the rundown village streets.  TITLE: AFTER THE WEDDING  EXT. CALCUTTA STREET, IMPOVERISHED AREA - LATER THAT DAY 4   4 Isabel, Jai, and a few other children from the orphanage, ride in the back of an open pick up truck down a dusty street. A group of hungry local children chase the truck as it pulls up in an open square and stops. The driver gets out and the local kids surround the truck. Isabel and the orphans begin their routine of serving a meal from giant pots; rice and lentils. The hungry children wait with cups and get food ladled in. INT. BACK OF TRUCK - LATE AFTERNOON 5   5 The exhausted group rides back toward the orphanage. The sun has just set and the sky is a silvery blue. Jai is glued to Isabel’s side as they all sing a song. INT./ EXT. ORPHANAGE - EVENING 6   6 Isabel’s truck pull in. A French aid worker, JAQUES (Late 40’s), is laying out some supplies he has brought in a van. Isabel’s truck pulls in and she hops out, anxiously. ISABEL (to Jaques) What did you get? She blows by him to check out the supplies. Pink Rev. (05/28/18)   BF7   2. JAQUES (sarcastically) It’s nice to see you... Isabel looks through what he’s brought. She picks up some sheets. ISABEL Where are the beds? The food? And there were supposed to be school supplies. JAQUES We can hang hammocks. Temporarily. A beat as they look at each other. JAQUES (CONT'D) It’s all I could get. For the money. She looks at him slightly confused, then shakes her head and marches away. INT. ORPHANAGE OFFICE - MOMENTS LATER 7   7 Isabel marches in. ISABEL Where’s the mo",
      "dialogue_count": 0,
      "word_count": 3657
    },
    {
      "scene_number": 2,
      "slugline": "INT. BOWERY HOTEL - DAY 43   43 The elevator opens and Isabel steps out. She has cleaned up and wears a nicer outfit but still looks out of place. She carries a folder and a DVD. Jonathan, who we saw at the bar with Grace, approaches Isabel. JONATHAN You must be Isabel. She’s taken aback. JONATHAN (CONT’D) I’m Jonathan. He extends his hand and she shakes it dubiously. JONATHAN (CONT’D) I’m here to take you to your meeting. She looks at him. ISABEL OK. They look at each other awkwardly for a moment. He smiles and extends his arm as if to say, ‘after you’. EXT. BOWERY HOTEL - CONTINUOUS 44   44 They emerge onto the busy street. JONATHAN How’s the hotel? Are you comfortable? ISABEL Yes. He seems happy. JONATHAN Good. I chose it myself. They arrive at the curb and Jonathan raises his hand, beckoning the Tesla which waits at the corner. Jonathan opens the door which swings upward, like a spaceship. Isabel is startled. Pink Rev. (05/28/18)   BF7   19.",
      "characters": [],
      "action_text": "INT. TESLA - MINUTES LATER 45   45 Isabel tries to get her window down but can’t seem to find the right button. Jonathan helps. JONATHAN Is it the french spelling? She looks at him. JONATHAN (CONT’D) (with accent) “Isabelle.” ISABEL I S A B E L. JONATHAN Ah, that’s not the french. Another awkward moment. Isabel looks out at the city. JONATHAN (CONT’D) Have you ever met Theresa? ISABEL No. JONATHAN She’s very impressive. She built ‘Horizon’ from nothing 22 years ago, and now it’s one of the biggest media buying companies in the world. ISABEL Media buying? JONATHAN We connect brands to consumers and vice versa, through an understanding of demographics and Psycho-graphics. Isabel looks at him blankly. ISABEL So, what do you sell? JONATHAN Whatever the client is selling. She nods, half understanding. Pink Rev. (05/28/18)   BF7   20. JONATHAN (CONT’D) It’s Theresa’s brain child. Don’t be intimidated by her. That’s a mistake. ISABEL Sounds like you know her well. He smiles. JONATHAN I’ve worked at the company for 4 years. (admitting) And she’s my mother in-law... or will be on Saturday. I’m marrying her daughter. ISABEL Oh. Congratulations. JONATHAN (happy) Thanks. INT. HORIZON WAITING AREA - DAY 46   46 Isabel sits, waiting. Modern and beautiful. Lots of glass. Stunning view of the city. After a moment, Theresa’s executive assistant, GWEN (30’s), approaches Isabel. GWEN Isabel. She stands. GWEN (CONT’D) Follow me. INT. HORIZON OFFICE HALLS AND STAIRS - CONTINUOUS 47   47 Isabel follows Gwen down the labyrinth modern hallways - up a staircase, past walls of glass and employees. And finally: INT. HALL JUST OUTSIDE THERESA’S PRIVATE CONFERENCE ROOM 48   48 Gwen and Isabel arrive and stop. Glass windows allow us to see in. Inside, Theresa is just finishing up a meeting with SIMON (43), TANYA (55) and Bill (60), her lawyer. They have someone on a conference call. Pink Rev. (05/28/18)   BF7   21. GWEN Sorry, they are almost finished. Can I get you a water? ISABEL No, thank you",
      "dialogue_count": 0,
      "word_count": 1658
    },
    {
      "scene_number": 3,
      "slugline": "EXT. THERESA AND OSCAR’S HOUSE, DRIVEWAY AND LAWN - DAY 54   54 A lot of action on the lawn. Trucks in the driveway, people setting up for the wedding. Theresa's car wends down the long driveway toward the big house. It stops and Theresa gets out. She heads across the lawn toward Oscar, who is speaking to the wedding planner, MELINDA. She looks slightly frantic. Before Theresa can get to them, the twins, Otto and Theo ambush her. Her face lights up as they run into her arms. She bends to scoop them up and they almost all topple over. She laughs. THERESA Hello my little cookies... She covers them in kisses. They laugh and resist - and love it. THERESA (CONT’D) Chocolate chip... and peanut butter... TWINS No! Not peanut butter! THERESA Oh that’s right, someone is allergic! Sugar then... She pretends to eat their cheeks. They point to the sky where a a hi-tech drone with a camera mounted soars above them. TWINS Mom, mom. Look. The man let us fly it. I was making it go. Theresa watches as the drone flies back to the young man who is controlling it. THERESA Wow! Just don’t fly away. TWINS It’s not for people! It’s going to take pictures of the wedding. Pink Rev. (05/28/18)   BF7   28.",
      "characters": [],
      "action_text": "Theresa looks over at Oscar who is engaged with the wedding planner MELINDA. THERESA Ohhh I see. Have you seen your sister? TWINS She told us to stay away from her. THERESA Well, brides are crabby. Theresa stands. THERESA (CONT'D) Go ask that man if you can fly it again. They run off. Theresa walks to Oscar. EXT. LAWN 55   55 Theresa walks up to Oscar. They smile at each other in acknowledgement of how much is going on. OSCAR I nixed the ice sculptures. Melinda’s having a fit. They look over at some huge ice sculptures which are being carried away around the side of the house. Melinda is frantically point to the men where to put them. Theresa and Oscar watch her. THERESA I guess this isn’t the time to tell her we need one more chair. Oscar looks at her, quizzically. THERESA (CONT’D) Somebody from work. Oscar sighs. OSCAR I think I just won’t tell her and add it when she’s not looking. Another scream. The boys are buzzing Melinda with the drone. She is ducking. Pink Rev. (05/28/18)   BF7   29. THERESA Where’s Gracie? Oscar looks toward the epic tent. Another kiss. EXT. WEDDING AREA, BACK OF HOUSE - MINUTES LATER 56   56 Lush and beautiful. Tables are being set, flowers placed. Theresa sees Grace counting chairs, excitedly and anxiously. Theresa takes Grace in for a moment then approaches her. Grace turns and sees Theresa and gives her a wide, nervous smile. Theresa smiles back. They go to each other and hug. GRACE Can you believe this is happening? THERESA No, I can’t. Are you okay? Any doubts? GRACE You wish. Theresa holds her face and looks right at her. THERESA No. I wish what you wish. Grace smiles and hugs her mom again. GRACE Thank you. THERESA I don’t see what would be so wrong with just living together for a year... Grace has heard this before. GRACE Really? THERESA And, he’s not as good looking as you. She’s clearly used to this. GRACE Anything else? Pink Rev. (05/28/18)   BF7   30. The look at each other deeply again. THERESA Yes. You’ll always be mine. Rem",
      "dialogue_count": 0,
      "word_count": 1185
    },
    {
      "scene_number": 4,
      "slugline": "INT. BOWERY HOTEL PENTHOUSE - CONTINUOUS 62   62 Isabel enters. ISABEL What’s this? The Manager stands in presentation. MANAGER Ms. Young thought you might need a dress for the wedding. Isabel takes them in. EXT. THERESA AND OSCAR’S HOUSE - WEDDING DAY - AFTERNOON 63   63 The grounds look beautiful. Lanterns line the driveway. Around back, the ceremony is about to start. EXT. THERESA AND OSCAR’S BACK YARD - SAME 64   64 Theresa, Oscar, and Grace, all dressed in their wedding attire. They stand on a little brick patio in front of a small greenhouse; waiting. About 50 feet away, the guests are seated, waiting. Oscar and Theresa stand on either side of Grace. They look across at her, and then anxiously to each other. Grace looks straight ahead, avoiding their gaze. Theresa reaches up to Grace to fix a stray hair. Grace pulls away annoyed. GRACE Please... Theresa nods. They settle back into waiting. After a moment: OSCAR You look beautiful, sweetheart. GRACE You’ve told me that... A lot. (Thank you) THERESA Well, it’s true. Grace takes a deep breath. Pink Rev. (05/28/18)   BF7   34.",
      "characters": [],
      "action_text": "GRACE (tense) Thank you... Again. Waiting. Then music begins. They jump, startled. Then gather themselves, and begin walking. EXT. HOUSE, BACK LAWN - CONTINUOUS 65   65 About 75 people. Everyone turns to see the bride and her parents as they walk up the isle. Jonathan smiles as he waits at the front, next to the Buddhist monk who will be preforming the ceremony. People take out their phones to take some pictures and videos. ON Grace, all smiles as she arrives next to Jonathan. Her parents kiss her, then take their seats. Looking between the Bride and Groom, we see the beautiful stone sculpture Oscar was finishing earlier. It’s an abstract depiction of 2 entwined bodies. Somewhere between Picasso and Giacometti. EXT. PARKWAY - SAME 66   66 The tesla sits on the Grand Central parkway in terrible traffic. INT. TESLA - CONTINUOUS 67   67 Isabel is dressed nicely but still in her own Indian flavored outfit, having opted not to wear Theresa’s dresses. She anxiously tries to look past the traffic. DRIVER We might be a little late, but I won’t let you miss it. Up ahead we see a State Patroller dealing with a stopped vehicle. EXT. PARKWAY 68   68 The Tesla drives up on the shoulder and scoots around the mess, then takes off down the freeway. Pink Rev. (05/28/18)   BF7   35. EXT. HOUSE DRIVEWAY - AFTERNOON 69   69 The Tesla pulls in. The door flips open and Isabel rushes out. One of the wedding staff points her toward the house. She kicks off her shoes and runs up toward the wedding. EXT. HOUSE, BACK YARD, WEDDING AREA 70   70 The monk delivers the vows. MONK Remember to be patient with yourselves and others, knowing that change comes slowly and gradually. Seek inspiration from your family and friends. Theresa and Oscar sit in the front, a mixture of nerves and excitement. An usher quietly shows Isabel to a seat in the back. A few people turn to look at her. She smiles uncomfortably and tries to focus on the ceremony. MONK (CONT’D) To make your relationship work will take lov",
      "dialogue_count": 0,
      "word_count": 6783
    },
    {
      "scene_number": 5,
      "slugline": "INT. THERESA’S BATHROOM - MORNING 109   109 She downs her morning vitamins. INT. CLOSET - MOMENTS LATER 110   110 She puts on her jewelry. As she does, she looks over at her shelf where she had put the birds nest and eggs she found. It’s not there. She goes over and looks more closely. No where to be found. She looks agitated. INT. KITCHEN - CONTINUOUS 111   111 Cibele, their housekeeper, is cleaning. Theresa stomps in. THERESA Cibele there was a nest in my closet. Did you movie it? Cibele looks puzzled. THERESA (CONT’D) (impatient) A birds nest with blue eggs. Did you move it? CIBELE No. I didn’t see it. Theresa looks annoyed. INT. BARN - MORNING - CONTINUOUS 112   112 Oscar is showing two men around his new studio. One wears a suit and looks like he is a collector. The other is his art advisor. Theresa walks in. She immediately spots the nest on one of Oscar’s work tables. Oscar and the men appear from around the other side of the huge stone he’s working on. OSCAR Tess. This is Jamey and Andre. I’m showing them the new pieces. She barely acknowledges them. THERESA (to Oscar) Did you take that from me? Pink Rev. (05/28/18)   BF7   70.",
      "characters": [],
      "action_text": "He’s trying to understand what’s going on. He steps away from the others to try and speak privately with her. OSCAR I... I saw it in your closet. THERESA What were you doing in my closet? OSCAR I saw it when I was replacing a bulb for you. It was starting to fall apart, so I thought I’d repair it for you. The two others hang awkwardly in the background. THERESA You don’t need to fix everything. You’re not the fucking handyman! She stares daggers at him then leaves without a goodbye. He takes a deep breath, then turns back to the others, who wait awkwardly. OSCAR (lightly) Sorry about that. The down side of working at home. He forces a smile and leads them back to the work. INT. ARETSKY’S PATROON - DAY 113   113 Theresa sits at her regular corner booth of this up scale, business-oriented restaurant, drinking a martini. The maître d’ shows Isabel to the table. Theresa smiles at her. THERESA Oh good come sit down. Isabel slides in the booth. Theresa finishes off her martini. THERESA (CONT’D) I’m celebrating. I have officially sold my company. She raises her hand to the waiter for two more martinis. Pink Rev. (05/28/18)   BF7   71. ISABEL No, thank you. THERESA You don’t drink? ISABEL Not in the middle of the day. THERESA Not at the wedding either. Isabel realizes Theresa was watching her. THERESA (CONT’D) Oscar said you guys partied a lot. Is it cause of that? Isabel doesn’t feel comfortable, and it shows on her face. She shakes her head. ISABEL Why am I here? Two men in suits approach the table and greet Theresa. RICHARD Just wanted to stop by to say congratulations. EDDIE We heard you made out pretty well. THERESA Is that a surprise? Now, I’m just a very rich employee. They smile at her. THERESA (CONT’D) This is my friend, Isabel. Richard - Eddie. The men smile at Isabel. THERESA (CONT'D) I’m about to donate a small fortune to the orphanage she runs in India. Isabel is taken by surprise by this information. RICHARD Wow, now I feel bad about myself. Pink Rev. (05/28/1",
      "dialogue_count": 0,
      "word_count": 4663
    },
    {
      "scene_number": 6,
      "slugline": "INT. BOWERY HOTEL/ EXT. ORPHANAGE - DAY 139   139 Isabel hangs on the phone. Her eyes are glassy with emotion. Silence. INDIA On the other end, Preena holds the phone out the window of her office toward the courtyard where Jai’s party is going on. The group sings happy birthday. On her end, Isabel listens intently, and mouths a few of the words. They finish and people cheer. Jai looks up to the window and sees Preena with the phone. She gives a wave. Jai shakes his head ‘no’, then returns to the party. PREENA We’re going to do the ice cream now. Isabel swallows, knowing this means he’s not coming to the phone. PREENA (CONT’D) Isabel. You are doing something important. Call me as soon as you sign the contract. Isabel nods. ISABEL (happy birthday) Tell him, “Subha janmadina” PREENA (God bless you/good luck) Allah tomara mangala karuka INT. THERESA’S OFFICE - AFTERNOON 140   140 Isabel sits and reads contracts while Theresa watches her.   * Pink Rev. (05/28/18)   BF7   97.",
      "characters": [],
      "action_text": "ISABEL There are a couple of points I don’t understand. Theresa looks over her shoulder. THERESA Oh, that just means if you and Grace can’t agree on how the funds are distributed, Oscar will be the tie breaking vote. I thought it would be better if it wasn’t me. She smiles and sits. ISABEL Not that. (pointing) This. Theresa reads. ISABEL (CONT’D) It says I have to ‘reside’ in New York? Theresa nods. THERESA Yes. Your cost of living will be taken   * care of. Isabel is baffled. ISABEL I can just come for board meetings, do the rest over Skype. Theresa looks at Isabel impassively. THERESA I’m afraid it’s a requirement. This rubs Isabel the wrong way. ISABEL That makes no sense. Why? Pink Rev. (05/28/18)   BF7   98. THERESA (deep breath) I know you are used to running things at the Orphanage, but you aren’t familiar with what it takes to manage millions of dollars. So I would like you here.   * Isabel shakes her head and thinks. ISABEL 6 months here and 6 there. Theresa looks at her dead on. THERESA It’s non-negotiable. Isabel struggles to understand. THERESA (CONT’D) And please don’t waste our time pretending you aren’t going to do it.   * Isabel begins to let her anger out. ISABEL You think I give a shit about your money?   * THERESA   * I do.   * ISABEL   * You think I’m for sale? You can’t buy me.   * Isabel gets up.   * THERESA I don’t want to buy you. This is an   * opportunity.   * Isabel becomes more and more agitated, like a caged animal. ISABEL (yelling) Bullshit! That’s what it says here. Pink Rev. (05/28/18)   BF7   99. She pushes the contract off the table and some papers fly. Theresa stays calm. THERESA Call it whatever you want. But think what you could do with the money; how many kids you could help. She narrows in on Isabel. THERESA (CONT'D) I know you’d sell yourself for that. ISABEL Fuck you, you don’t know me. Isabel turns to walk out. THERESA Actually I know all about you. 39 years old. Born in Troy, New York; raised by adoptive parents in Connecti",
      "dialogue_count": 0,
      "word_count": 2911
    },
    {
      "scene_number": 7,
      "slugline": "INT. THERESA AND OSCAR’S HOUSE, HALLWAY 153   153 Theresa walks down the hall and we follow her.   She comes to the boys room and pushes the door open. INT. BOYS ROOM 154   154 The boys are already in their PJ’s. They have a couple of friends over. They are all playing “Dance, Dance Revolution”, on X-Box; all dancing like maniacs. She watches them for a moment then walks in front of the TV blocking it, facing the boys. THERESA A dance party! Oh good! I love to dance! She starts to dance. They yell and scream, trying to get her to move. The twins try and push her out. She just keeps dancing. TWINS (OTTO AND THEO) Mom, this is serious, get out of the way. THERESA I didn’t know it was serious! I’m sorry. She hugs them, and they go right back to playing. THERESA (CONT’D) Be good for Bellie. INT./ EXT. THERESA’S CAR PARKWAY - LATE EVENING 155   155 Oscar drives. Theresa looks out her window. Music plays. After a moment, Oscar turns to her; sensing him, she turns to him. Oscar opens his mouth, about to speak. CUT TO: INT. MINETTA TAVERN - NIGHT 156   156 Theresa, Oscar, and about 30 others, have taken over the whole back room of this village bistro. A mixture of Theresa’s work associates and friends. Isabel sits with Grace midway down the long table. Theresa and Oscar sit together at the end, surrounded with friends. Someone is mid-toast. Pink Rev. (05/28/18)   BF7   114.",
      "characters": [],
      "action_text": "TANYA There are not many people who have the   * power and tenacity to will their vision into existence - And in the process to change the way our industry works. Not to mention employing over a thousand people, raising a family and, oh yeah, making a shit load of money. They all laugh. We are with Isabel and Grace as they listen. TANYA (CONT’D) I’ve known Theresa for 20 years now, so when she told me she was thinking of selling the company I said: ‘don’t I get a vote?’ He looks at Theresa. TANYA (CONT’D) To which she replied: “no”. Lots of laughter. TANYA (CONT’D) So why sell? When you’ve built this big,   * thriving, behemoth of a company. Why?   * SCATTERD GUEST   * Why? Why?   * Everyone laughs.   * TANYA   * That’s what I asked. Why?   * Theresa shakes her head at Tanya.   * TANYA (CONT’D)   * And she said because she likes beginnings   * - and a little bit of hardship. When   * things get to easy, she gets bored. We   * bored her!   * Some jeers and laughter.   * TANYA (CONT’D)   * Theresa, congratulations. We love you -   * We can’t wait to see what you do next.   * And we’re sorry we bored you!   * Big smiles and laughter.   * Pink Rev. (05/28/18)   BF7   115. Isabel touches Grace’s leg in support.   Everyone raises a   * glass.   * TANYA (CONT’D) To Theresa, for bringing us all together. EVERYONE To Theresa. CUT TO: OVERLAP ‘HAPPY BIRTHDAY’ BEING SUNG 157   157 Oscar carries out a cake that looks more like a sculpture. Clearly his brainchild. He sets it down as everyone finishes singing happy birthday. Theresa looks embarrassed by the show of affection. She looks at the crazy cake. Pink Rev. (05/28/18)   BF7   115A. Takes a deep breath and blows out the candles. It takes a couple tries. People clap. Theresa looks at Oscar and shakes her head, as if to say, “I hate/love that you did this”. He takes some icing on his finger and offers it to her. Theresa shakes her head but eats it. A deep breath and she stands. THERESA Okay, okay... Everyone claps. THERESA (C",
      "dialogue_count": 0,
      "word_count": 2140
    },
    {
      "scene_number": 8,
      "slugline": "INT. ISABEL’S OLD ROOM, INDIA - CONTINUOUS 166   166 Isabel walks back in her room, alone. ON HER FACE as she gathers herself emotionally. Something across the room catches her eye. It’s a little mirror she kept over her wash basin. She sees herself in the reflection. Lets herself look. It’s one of those naked moments, where you can really see yourself. EXT. ORPHANAGE - A FEW MINUTES LATER 167   167 A game is being played on the soccer field. Jai runs after the ball. Isabel appears on the periphery of the field and watches. As she does, we rise up and up; bird’s point of view. SLOWLY FADE TO BLACK. Pink Rev. (05/28/18)   BF7   124.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 117
    }
  ]
}