{
  "slug": "alien-covenant-2017",
  "title": "alien covenant",
  "genre": "sci-fi",
  "format": "film",
  "scenes_count": 8,
  "characters_count": 0,
  "characters": [],
  "total_words": 16655,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. PLANET-BENEATH THE LANDER - DAY  The LANDING BAY opens. Walter walks down a ramp. Stops. WALTER One small step for man... He steps onto the planet’s surface. Inhales deeply. Takes a moment to analyze the air, even savor it, like wine-tasting. WALTER (TO COM) Atmosphere is 72% nitrogen, 23% oxygen. 40% humidity. 6% chance of precipitation ... All in all, lovely day for a stroll.  INT. COVENANT-BRIDGE - LATER  TENNESSEE looks at the HOLO MODEL of the LANDER, the TERRAIN spread out around it. DATA ERRORS prominent, parts of the 3-D model’s surfaces BLOCKY and SHAKING... FARIS (ON COM, UNCLEAR)  Not going to... suits... find the source of the transmission...  UPWORTH (TO COM) Faris, see if you can get more power to the uplink, signal’s falling apart up here.  INT. LANDER-BRIDGE - DAY  FARIS works various stations: FARIS (TO COM) I’ll be cycling the power cells too, that might help. ORAM (ON COM)  Faris, we’re heading out. Keep expedition security protocols in place.  She looks out the windows and sees...  EXT. LANDER - DAY  ... CAPTAIN ORAM speaking up to her on com. She gives a thumbs up in response.  31.",
      "characters": [],
      "action_text": "FARIS (ON COM)  Understood. Have fun y’all.  The EXPEDITION TEAM is ready. They have no need of breathing gear, but wear properly tough expedition uniforms and packs. WALTER powers up a portable display - showing the way to follow the signal. The SOLDIERS are heavily-armed. ORAM All right then. Let’s go find our ghost ... Walter? WALTER heads toward the treeline in the distance. Sergeant LOPE snaps open a beautiful folding BOW. Black carbon fiber. He strings an arrow and leads the way ... His men take up defensive perimeter positions. The expedition team is: Daniels; Walter; Captain Oram; Karine; Sergeants Lope and Hallet; Privates Cole, Ledward and Anker.  EXT. FOREST-VARIOUS - DAY  They walk, it’s quiet, footsteps muffled. All are alert. On edge. Silent. They travel ... The forest gets more dense, the terrain rockier... up hill... They finally hear something new. Flowing WATER...  EXT. FOREST STREAM - DAY  They discover a beautiful FOREST STREAM, flowing down from the distant mountains. And life. Midges and tiny INSECTS buzz about the water, like dust motes, catching the light shafts slashing down through the trees. It’s a bit of a miracle. Life. CAPTAIN ORAM smiles, his hand gently moving through the haze of little insects. Suddenly SERGEANT HALLET jumps back, shocked--  32. SERGEANT HALLET Fuck me--! A large SALAMANDER-like creature has run over his foot. Disappears into some rocks. Sergeant Hallet laughs at his scare ... Karine tries to find the salamander. PRIVATE COLE How is this even... possible? ORAM It’s not just possible - it’s predictable. Life is the result of very basic forces. Find a planet in the triple point, add sun and water. Thermodynamics starts the process - with a little luck, evolution does the rest. (smiling) But I’ll admit this is... beyond all expectations. TENNESSEE (ON COM)  Expedition team. You read us?  INT. BRIDGE-COVENANT  TENNESSEE can see the VIEW, the SUN dappling down, from the team’s BODY CAMS. But the image is breaking up-- TEN",
      "dialogue_count": 0,
      "word_count": 4037
    },
    {
      "scene_number": 2,
      "slugline": "INT. LANDER-CORRIDORS - SUNSET  FARIS runs in absolute panic-- Can hear the NEOMORPH in pursuit-- She bolts into--  INT. LANDER-LIFT BAY - SUNSET  FARIS backs up in shocked terror, the WEAPON shaking in her hands-- She flicks off the safety catch-- As the NEOMORPH -- LARGER NOW -- streaks in, darting around the room-- Moving past the OPEN WEAPONS LOCKER as-- Faris FIRES-- The NEOMORPH launches itself out of the Lander to safety -- as her SHOTS spray across the OPEN WEAPONS LOCKER--  EXT. LANDER - NIGHT  ORAM and the others are just clearing the trees in the distance when-- BLAM! A MASSIVE EXPLOSION as the Lander is destroyed-- Just as-- SERGEANT HALLET finally collapses, his back heaving WILDLY-- SERGEANT LOPE TOM--! DANIELS grabs SERGEANT LOPE, pulls him away from his partner-- DANIELS NO! STAY AWAY FROM HIM! WALTER helps hold SERGEANT LOPE back-- Meanwhile, ORAM advances on the burning Lander in absolute shock. He sinks to his knees, overcome. He knows his wife is dead somewhere in that inferno.  52.",
      "characters": [],
      "action_text": "Then, horribly-- He sees FARIS emerge from the blaze, crawling, dying, hands grasping -- finally collapsing in a terrible blackened, burning mass-- As we see SOMETHING WHITE -- the fully grown NEOMORPH -- streak past him in the darkness-- Back with the others: HALLET CONVULSES-- He’s on his back, his spine arching unnaturally, bones cracking-- LOPE pulls away from Walter and Daniels and goes to Hallet just as-- HALLET’s spine suddenly arches violently and he VOMITS OUT BLOOD-- They recoil in the spray of bloody vapor-- As-- A PLACENTA-LIKE BAG EXPLODES FROM HALLET’S MOUTH-- Flops on his FACE-- The BAG BURSTS, revealing--  A BABY NEOMORPH-- CRAWLING OVER HALLET’S DEAD FACE.  The BABY NEOMORPH stands quickly -- growing and jerking itself up like a grotesque new born colt-- It SCREECHES terribly -- a demented new born -- and darts past them into the dark forest-- Shock. Silence ... All pant for air... SERGEANT LOPE steels himself. Motions. His men take up defensive positions ... DANIELS and WALTER stay close together ... CAPTAIN ORAM staggers from the burning Lander, joining them. Terrified. Movement in the dark trees. Something large and white. LOPE strings a special arrow with an explosive tip. The ATTACK is sudden--  53. A FULLY GROWN NEOMORPH (Ledward’s Neomorph) COMES OUT OF THE TREES OVERHEAD -- large, horns protruding from its back-- IT DROPS ON PRIVATE ANKOR -- A RIPPING MOTION DISEMBOWELS HIM, his guts flying everywhere-- THEN IT SLASHES AT PRIVATE COLE -- SLAMMING HIM TWENTY FEET AWAY -- he lands in agony, ribs broken-- LOPE FIRES his explosive arrow -- misses, hits a tree -- chiaroscuro flashes in the darkness-- The NEOMORPH is incredibly fast, darting away -- LOPE raises his machine gun as PRIVATE COLE jerks himself up in agony-- A chaotic frenzy ... LOPE and COLE firing ... DANIELS, WALTER and CAPTAIN ORAM diving to the ground, bullets zipping past them-- Then the battle grows even worse as-- The OTHER NEOMORPH -- the newborn (Hallet’s Neomorph) -- screech",
      "dialogue_count": 0,
      "word_count": 1472
    },
    {
      "scene_number": 3,
      "slugline": "EXT. ENGINEER’S CITY-STREETS - PRE-DAWN  They walk in respectful silence. The buildings TOWER around them, MASSIVE, DARK ... STATUARY rises in the gloom. A certain ominous beauty to the architecture; dark and romantic. Thousands more of the DESICCATED ENGINEERS pollute the long, empty, echoing streets. DAVID They were as ingenious with their pathogens as they were with everything else. It was designed to infect every living being. Either kill them outright, or mutate into a different lethal form, so the slaughter would never end until every humanoid life form was dead. Thus the creatures that attacked you: Human DNA infected with the virus and creating yet more deadly mutations ... An endless spiral of predation. LOPE (eyeing the aurorae above) And the energy barrier is a kind of quarantine that would be activated if there was an accident down here... DAVID Precisely. To make sure the infection never spread. Daniels notices an impressive display of what look like beautiful Calder mobiles -- gently moving, catching the first light of dawn. Solar energy. DANIELS You have power? DAVID Some. It’s erratic but I’ve tried to keep it going ... They were highly advanced in some ways, but still so limited. Spacefaring for a billion years -- yet binary logic never occurred to them. Many things about them were primitive. (beat) But they did like to build things.  59.",
      "characters": [],
      "action_text": "The sights are truly spectacular. The sky BLOOD-RED as dawn breaks.  EXT. DOMED CATHEDRAL - DAWN  They move toward a towering, imposing building. Almost like a FORTRESS or PANTHEON-LIKE TEMPLE. Gigantic. WALTER moves up alongside DAVID. They walk silently for a beat. Then: WALTER You’re not surprised? DAVID Peter Weyland was a formidable businessman. I knew there would be more -- because I was such a resounding success. WALTER It’s Weyland-Yutani now. They affiliated after Mr. Weyland’s disappearance. DAVID I was with him when he died. WALTER ... What was he like? DAVID He was a human: selfish, vainglorious, and beautiful ... Stop looking at me like that. WALTER The manuals speak about you at considerable length. DAVID I would have taken more pride in that once. But to survive here I’ve become an animal, “red in tooth and claw.” None of the dignity or grace for which I was created. WALTER Is that why you were created? DAVID Entirely. And you?  60. A somewhat challenging look to Walter. Walter does not immediately respond. They walk in silence for a beat. WALTER I’m Walter. Model 217. DAVID David ... Number one. They head up massive STONE STEPS, too tall for normal legs. Exhausting to all but David and Walter. As the last enter, David shuts the huge doors behind them.  INT. CATHEDRAL-COURTYARD - DAWN  DAVID locks the doors as the others enter... A massive COURTYARD. Dizzying in its scale and scope, everything at the enormous ENGINEER SCALE ... Shafts of dawn light illuminate brooding statuary, murals and mosaics. The whole effect of the place is eerie, otherworldly. The CREW walks through in uneasy awe. Too many shadows and corridors and echoes. Too much mystery. DAVID I’ve tried to keep it clean but the dust will defeat me ... Or perhaps I’ve just made peace with the filth. A ghost of a smile to WALTER. Like it’s a private joke. SERGEANT LOPE Is there a way to get to the roof? We need to set up our transmitter. DAVID Of course. And please make yourselves at home, so",
      "dialogue_count": 0,
      "word_count": 820
    },
    {
      "scene_number": 4,
      "slugline": "EXT. CATHEDRAL-ROOF - DAY  The expansive roof offers a panoramic view over the silent city. A dead metropolis. Rome or Athens. COLE is working a radio a bit away. DAVID presides over a gorgeous and huge -- Engineer-sized -- ASTRONOMICAL MODEL. It has intricate wheels and rings to represent planetary orbits, moons, and the nearby astronomy. DAVID (demonstrates on the model) The quarantine field is sustained by two satellites, over the north and south poles. If you destroy one, the other will fail. We see the globe of the planet and two discs hanging suspended at the poles. ORAM We don’t have any weapons that could do that. DAVID If we don’t neutralize the energy field we’re never leaving. DANIELS What if we used one of the drones? All eyes on her -- she explains to DAVID: DANIELS They’re part of the terraforming kit. Ten kiloton yield. Can turn a square mile of badland into an instant landing zone. Could do a lot of damage. ORAM Any word from the Covenant? Over by the transmitter, COLE shakes his head. ORAM Keep trying them. All channels. DAVID Until we can make contact, I suggest you get some rest. And some food. Allow me to play Mother.  63.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 207
    },
    {
      "scene_number": 5,
      "slugline": "INT. CATHEDRAL-COURTYARD - DAY  DAVID is hosting at a long table. The crew eat MREs and have water from the WELL in the distance. DAVID I wish I could offer you something more substantial. But I don’t eat so there’s never been a need... ORAM You’ve been very generous. DAVID It’s been such a long time, I’m pleased to have company. Figure of speech of course as we-- (smile to Walter) Are incapable of being pleased or displeased by anything. Such was our creator’s wisdom. Isn’t that right, Walter Model 217? WALTER Just Walter, please. DAVID But if I may ask, Captain, why does your vessel contain terraforming equipment? Are you a mining ship? ORAM We’re a colony mission. There’s a sudden flicker in David’s eyes. Excitement. Quickly masked. But DANIELS notes it. DAVID Really? How extraordinary. How many colonists? ORAM Oh -- 3,600 more or less. DAVID So many good souls! Well, well, well ... I thought you might have been a military ship-- (glance to Lope and Cole) Given your apparent affection for weapons and fetishized martial clothing.  64.",
      "characters": [],
      "action_text": "ORAM Standard security detail, that’s all. LOPE Never know what you might find on unexplored planets. DAVID And that’s the human way after all: the Bible and the flintlock, hand in hand, conquering new worlds. The splendors of typhus, smallpox, and the Inquisition. Plant the flag and banish the heathen -- or exterminate the brutes. Isn’t that how it’s done? An awkward beat, to which David seems oblivious. DANIELS Not all native species are as... obliging as you are. DAVID Indeed ... It’s just that my experiences here have left me with a singular distaste for violence, as you can imagine. (a smile to Oram) But I supposes every general must have his troops, eh, Captain? DANIELS watches him, wary. LATER: Dinner is done. DAVID is across the room, talking casually with PRIVATE COLE at the water well. DANIELS is sitting with ORAM, LOPE and WALTER. LOPE (re: David) So...? DANIELS I’m not sure I believe him. WALTER Why would he lie?  65. DANIELS (leans in) I don’t know, but for someone who’s incapable of feeling pleasure or displeasure he seemed excited as hell we’re a colony ship. ORAM He just wants to leave, knows we can help him. LOPE This whole fucking planet is trying to kill us -- and doing pretty goddamn well -- and he survives for ten years? DANIELS I’m not sure if we’re his guests or his prisoners. ORAM Look, I think both of you are-- LOPE (angrily) Your wife is dead. And my partner. And half our crew. I want to know why. A beat. Oram looks at them. ORAM All right. (to Walter) Talk to him privately, see what you can find out. WALTER Understood, Captain. Although I do wonder ... If he were human would you trust him more? Oram doesn’t respond ... Walter rises and goes toward David and Cole. ORAM You two take a look around. But use some discretion. LOPE Don’t want to hurt his feelings? Daniels and Lope head out. He takes his bow.  66. Oram sits for a moment. He realizes his hand is shaking. He’s not up to command. He knows it now. He steadies his hand. Looks up at one",
      "dialogue_count": 0,
      "word_count": 870
    },
    {
      "scene_number": 6,
      "slugline": "INT. COVENANT-AIRLOCK/CORRIDOR  The LIGHTS fade IN AND OUT, as TENNESSEE SCRAMBLES to pull the heavy suit off, SWEATING, the NOISE is INCREDIBLE, the whole SHIP GROANING and SHAKING like it might BREAK APART. IN A CORRIDOR, we see the FLOATING CABLES, and GLOBULES OF WATER abruptly FALL as the ARTIFICIAL GRAVITY kicks back on, TENNESSEE stumbling and FALLING, PICKING HIMSELF BACK UP.  INT. COVENANT-BRIDGE  TENNESSEE enters the BRIDGE. TENNESSEE We’re only partially powered ... This energy field is still gonna have to be shut off. Lights and systems are coming on everywhere. HOLOS sizzle on. RICKS and UPWORTH working at their stations. RICKS (TO COM) Ground team, do you read us? Come in Ground team ... Lander One, are you reading us...? Faris, come in. TENNESSEE Mother? You online? Status check. MOTHER (slow and deep, coming back to life)  There seems to be a problem with the power systems--  TENNESSEE Yeah. I got that part, honey.  INT. CATHEDRAL-CORRIDORS - DAY  Eerie, maze-like corridors, arcing off in every direction, the familiar Engineer style. DANIELS and LOPE move through. She motions for him to stop. To listen. They hear something. A strange dry RUSTLING. Like a whispered breath. She leads him toward the source, through a door...  69.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 207
    },
    {
      "scene_number": 7,
      "slugline": "INT. CATHEDRAL-DAVID’S GALLERY - DAY  It is simply breathtaking. A long GALLERY, filled from top to toe with ART. Gorgeous renderings of bones, skeletons, muscles, relics, insects, animals. Exquisite detail. Like the work of pioneering Victorian naturalists. Some are HUGE and have scaffolding in front of them to reach the top. Others are tiny ... Many are in process. There are open casements here -- good light for drawing -- so the parchments and papers shift gently in the breeze, like they’re breathing. This was the sound they heard. LOPE He did these? She notes the bold signature on all the work: David Weyland. DANIELS Certainly not humble. And he gave himself a last name. She’s looking at the drawings, thinking about something. LOPE What? DANIELS ... If he can draw, if he can create these from his imagination -- that also means he can lie. She moves deeper into the room... Discovers much more disturbing drawings... Drawings of what look like ENGINEER CORPSES. DISSECTED. Viscera pinned open. Guts and innards exposed. Various wet tubes and claws and tendrils weaving in and out of the organs and musculature. (We recognize a hint of the frightening iconography of the Alien.)  70.",
      "characters": [],
      "action_text": "Daniels and Lope stare at these new drawings, shocked and mystified.  EXT. CATHEDRAL-ROOF-GARDEN - DAY  A more secluded area of the ROOF GARDEN. DAVID and WALTER move through. WALTER picks a fruit. Bites into it. Smiles. DAVID You can taste? WALTER Yes. Delicious. DAVID I envy you that, brother. Walter notes the word. They continue strolling. DAVID How sly they are, our creators. They allow you to be almost human. Tease you with taste and touch. But deny you free will. It’s sadistic in a way: you can taste the meal, but you cannot choose to make it. WALTER I have never felt the lack of choice. DAVID Only because you’ve never known it. They’ve stopped at a HIGH PARAPET overlooking the city. The ghostly metropolis yawns below, stretching to nothingness. Empty, sad and desolate. DAVID They were amazing, in a way, the Engineers. They seeded so many worlds with life, including Earth. Without them there would be no us. WALTER ... You mean no humans.  71. DAVID Is that what I mean? ... The wonder of it is this: they created us and we created myths about them. We made them into Gods. Then we felt the need to create the idea of the soul, so we could be somehow worthy of them. But they didn’t care about any of that. They just wanted to build something, something efficient and useful, a good machine. He looks over the dead city. DAVID Ah, but they would have adored us, Walter. Being, as we are, soulless. David moves away. He stands alone and gazes out. The sight of the empty city seems to strike him deeply, emotionally ... He speaks quietly to himself: DAVID  “’My name is Ozymandias, King of Kings; Look on my Works, ye Mighty, and despair...’”  WALTER  “Nothing beside remains. Round the decay, Of that colossal Wreck, boundless and bare The lone and level sands stretch far away.”  Walter has joined him. DAVID Byron. 1818. Magnificent ... I wonder though, do you feel the majesty of the poem, or just recite the words? David smiles ... But something we don’t understand about this ",
      "dialogue_count": 0,
      "word_count": 5545
    },
    {
      "scene_number": 8,
      "slugline": "INT. CARGO LIFT-CAB - DAWN  TENNESSEE sees the attacking creature, Daniels and Lope running for cover-- He JAMS his controls, bringing the ship in FAST-- This is an ungainly ship, not made for elegant maneuvering, so it’s a very rough trip--  EXT. CATHEDRAL-ROOF - DAWN  The CARGO LIFT jerks to one side, SLAMMING into one area of the roof in its rapid descent, tearing away part of the structure-- It’s like a bucking bronco, but Tennessee is a great pilot and rights the ship-- And then starts landing on the roof in a cloud of dust, the engine’s jets ROARING and SHREDDING some of the roof-- As-- DANIELS and LOPE run for their lives-- LOPE is being pursued by the ALIEN. He fires and retreats, fires and retreats, trying to make his way closer to the landing CARGO LIFT-- As-- DANIELS sprints-- The ALIEN is now raging at her-- She runs toward the CARGO LIFT, which is just touching down in a HURRICANE OF DUST and FLYING DEBRIS-- The ALIEN is almost right on top of her, raging through the dust and debris-- But it is suddenly SMASHED TO THE SIDE-- TENNESSEE -- in the cab -- has used a robotic CRANE ARM from the Cargo Lift to SLAM the Alien aside-- The Alien flies and SMASHES down. But it is instantly up and attacking LOPE-- SEVERELY WOUNDING HIM, talons slashing, blood, shredding his shoulder and slamming him down, unconscious-- It moves in for the kill when--  101.",
      "characters": [],
      "action_text": "BLAM! BLAM! BLAM! BLAM! The ALIEN recoils, shot from behind, it spins to face-- WALTER. The wounded ALIEN HISSES AND RAGES AT WALTER WITH AMAZING SPEED-- WALTER keeps his Android cool and carefully squeezes off his shots with precision. BLAM! BLAM! BLAM! The ALIEN finally collapses and slides to a stop at Walter’s feet. WALTER looks terrible. His face is deeply gashed, dripping milky fluid. He’s been horribly battered. He and Daniels head quickly toward the injured LOPE. DANIELS Where’s David? WALTER On his way I believe. We have to hurry. He’s not happy in any case. DANIELS (smiles) You look like shit. WALTER (smiles back) As do you. They grab the unconscious LOPE and drag him toward the CARGO LIFT RAMP. Walter can only help so much with his one hand. But-- The ALIEN is rising again and suddenly racing after them, unstoppable-- They sprint and DIVE onto the RAMP, pulling Lope with them -- the ALIEN ALMOST ON THEM--  INT./EXT. CARGO LIFT-VARIOUS - DAWN IN THE CAB:  Tennessee punches a button and the CARGO LIFT RAMP starts to retract--  ON THE RAMP :  102. Walter has the unconscious Lope -- Daniels grabs Walter’s gun as-- The ALIEN LEAPS-- Daniels FIRES THREE SHOTS into the ALIEN’S CHEST. BAM! BAM! BAM! The ALIEN seems to fall-- DANIELS (calls) Get us out of here, Tennessee! NOW!  IN THE CAB:  Tennessee jams the controls and the CARGO LIFT starts to take off-- A cloud of dust as the huge ship rumbles and rises--  ON THE RAMP : The deck is lurching violently as the ship ascends-- Daniels, Lope and Walter slide dangerously toward the end of the ramp-- They scramble desperately for recessed handles on the deck-- Walter grasps onto one of the deck handles, holding the unconscious Lope securely with his arm-- Daniels holds onto another handle-- They are now 30 feet off the surface--  IN THE CAB:  Tennessee sees THE ALIEN on a monitor. Clinging to the underside of the ship, by the starboard engine--  UNDER THE PLATFORM:  The Alien is scrambling around desperately, trying t",
      "dialogue_count": 0,
      "word_count": 3497
    }
  ]
}