{
  "slug": "all-is-lost-2013",
  "title": "all is lost",
  "genre": "sci-fi",
  "format": "film",
  "scenes_count": 4,
  "characters_count": 0,
  "characters": [],
  "total_words": 7671,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. COCKPIT OF THE BOAT  OUR MAN starts in on a built in hand pump that will pump the  water from the cabin. He has shoved a long mop handle into  the pump for better leverage.  He checks the compass.  WE SEE SEVERAL SHOTS OF HIM PUMPING AND FIBERGLASSING.  EXT. BOW OF BOAT - SUNSET  Night is falling. OUR MAN eats a can of soup while sitting  and staring out at the ocean.  EXT. COCKPIT OF THE BOAT - NIGHT  OUR MAN tries to sleep as the water in the cabin sloshes  around.  FADE TO BLACK.  EXT. BOAT - (DAY 2)  A FULL DAY OF:  Pumping.  Fiberglassing.  Eating.  Pumping.  Fiberglassing.  Eating.  Pumping.  Fiberglassing...he almost falls over the edge.  Eating.  NIGHT FALLS:  OUR MAN sits and stares out at the endless ocean. He lays  down and falls asleep.  FADE TO BLACK.  6.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 142
    },
    {
      "scene_number": 2,
      "slugline": "INT. BOAT - MORNING  OUR MAN stands in front of the gash. The repair is completed.  Although it looks like hell, it is watertight. He is pleased.  He looks down at his feet and the floor of the cabin can now  be seen as the water is gone. The wooden decking is starting  to warp up but there is no standing water.  His eyes drift over to the navigation and electronics table.  EXT. BOAT - DECK - BRIGHT MORNING  There is no wind, the ocean is flat. OUR MAN takes down the  sails and the boat comes to a stop. As it does the repaired  gash dips below the waterline and he looks on to see if it  will hold water. It does.  CUT TO:  OUR MAN has laid out and secured down all of the charts,  maps, navigation books, and is bringing up pieces of  electronics one by one to dry in the glaring midday sun.  He zeroes in on the radio. He starts to take it apart. The  salt has begun to corrode the inner parts of the radio. Our  man looks around.  He grabs a container of fresh water and pours it over the  radio parts. He puts it down to dry in the sun.  He goes over and starts to collect the maps. He sits down  with the pile and searches through to find one that  corresponds with his last coordinates.  The two electronic GPS systems sit in a pile on the deck  useless.  By the look on OUR MAN’S face he has been relying on the GPS  too closely in life. He is lost.  INT. BOAT - CABIN  He goes over to a shelf filled with wet books. He scans and  takes out a book titled AN INTRODUCTION TO CELESTIAL  NAVIGATION. He sits and begins looking at it.  RADIO VOICE  (static noise... crackle)  (foreign language)  When are you going to get here?  7.",
      "characters": [],
      "action_text": "OUR MAN immediately looks up like he has heard a ghost.  RADIO VOICE (CONT’D)  (foreign language)  That’s right.  OUR MAN drops everything and scrambles up the stairs and just  stares at the radio waiting to see if it comes to life again.  The light blinks.  RADIO VOICE (CONT’D)  (static... static)  OUR MAN picks up the mic and presses the button.  OUR MAN  This is the Virginia Jean, are you  there over?  Nothing.  OUR MAN (CONT’D)  This is the Virginia Jean with an  S.O.S. call over?  Nothing.  OUR MAN (CONT’D)  This is the Virginia Jean with an  S.O.S. call over?  Nothing... The powerlight goes off on the radio... it’s dead.  OUR MAN hears something, he looks around, the wind is  starting to pick up and ripple the still water. He tries to  bounce back from the near miss on the radio.  He goes and collects all the loose components from the deck  and gets the boat ready to sail again.  The sails are up and he has got things going again. Spirits  are up.  As dusk begins to fall OUR MAN looks out across the ocean and  there is a dark cloud on the far distant horizon. He looks  down at the disabled weather radio.  He has no idea if it’s a small rain shower or something far  worse.  INSERT TITLE CARD: ACT II (Man vs. Nature)  8.",
      "dialogue_count": 0,
      "word_count": 546
    },
    {
      "scene_number": 3,
      "slugline": "INT. BOAT - CABIN - EVENING  OUR MAN is down below preparing dinner when the rain starts  hitting the deck above his head. It starts softly then builds  to a downpour. He sticks his head out of the doorway to look  at the horizon, there is no wind building, he is relieved.  He cooks some beans on the stove.  He pours himself a scotch.  Settles in to read The Introduction to Celestial Navigation  as the rain falls. The boat is once again watertight and he  quickly falls asleep.  FADE TO BLACK.  INT. BOAT - FRONT V BERTH - MORNING  OUR MAN is asleep. The bright sun comes into the cabin and he  slowly wakes. He looks around realizing that was his first  really good night of sleep in some time.  INT. BOAT - GALLEY (KITCHEN) - MORNING  OUR MAN has got the gas stove working again and is making  himself a cup of coffee.  EXT. BOAT - COCKPIT - MORNING  OUR MAN is enjoying his coffee looking out across the water.  He zeroes in on a small patch of wind that is dancing across  the surface. It is beautiful but somehow ominous.  INT. BOAT - ENGINE COMPARTMENT  OUR MAN is on his hands and knees struggling to get behind  the swamped engine to a massive bank of large capacity  batteries. They are corroded and waterlogged. He struggles to  bring one out and up onto the deck.  EXT. BOAT - DECK/COCKPIT  As he comes back up from below carrying the battery he looks  across to the horizon and notices terrible looking storm  clouds in the extreme distance. His face registers severe  concern.  The thunderheads reach miles into the sky.  9.",
      "characters": [],
      "action_text": "OUR MAN looks around at the boat to see what to do next. He  is still holding the large battery. He looks down at it in  his hands. He hurls it over the edge and heads back down  below.  INT./EXT. STORM PREPARATION  As OUR MAN goes through these preparations he begins to sing  to himself. The song starts out too low to hear, but then  grows.  Loading up potable water from the sink tanks into large  portable water carriers.  Changing the sails to smaller storm sails.  Looking out at the horizon as the front comes closer.  Down below stowing all loose objects away.  Checking the charts/maps to try to place himself.  Going into the bathroom and shaving.  Checking the fiberglass over the repaired spot.  Checking the placement of the life raft and repacking the sea  anchor next to it.  Back up top looking out at the storm. The waves are starting  to pick up.  OUR MAN stops, looks around at his little boat, checking to  see what else needs to be done.  He goes over and checks the auto steering device one more  time. The clouds are now blocking out the sun and it feels as  though night is falling.  INT. BOAT - DARK & STORMY  He is back below prepping his foul weather gear. As he stands  looking at the jacket the boat gets thrown abruptly in one  direction and OUR MAN falls/gets tossed over into the  navigation table.  The charts come down on top of him. He sits on the ground as  the boat begins to get rocked far more violently. He can only  laugh to himself as he knows things are about to get a whole  lot worse.  10. (During a storm like this it cannot be underplayed how loud,  intense, varied, and downright frightening the sounds of the  storm hitting a small boat are. From the waves hitting the  hull, to the wind in the sails and rigging, to the general  pressures put on every element of the ship it is difficult to  explain. The sound design during this sequence will be of the  utmost importance and will play relentlessly through the  storm sequence.)  OUR MAN stands up ",
      "dialogue_count": 0,
      "word_count": 1293
    },
    {
      "scene_number": 4,
      "slugline": "EXT. BOAT DECK  As he turns to head back into the cabin he looks for a moment  out to sea into the darkness and sees the waves have grown to  at least twenty-five feet high.  INT. BOAT - CABIN - NIGHT  OUR MAN comes down the stairs into the cabin and slams shut  the hatch. The sound goes from total chaos to controlled  chaos.  He pulls off his soaked foul weather gear and falls to the  floor exhausted. Suddenly he jumps up and throws up a good  gallon of sea water into the sink. He falls back down to the  floor and passes out.  The storm rages on as he slides from side to side across the  floor as the boat careens down the face of the waves, one  after the next.  FADE TO BLACK.  INT. BOAT - CABIN  OUR MAN is rudely awoken by the boat feeling like it is  falling off a cliff, then landing at the base of a wave with  a horrifying crash. He gets thrown across the floor of the  cabin and then gets sent in the other direction. He’s up now.  OUR MAN realizes this situation is not improving. He gets up  and gets out the sea anchor from the storage bin again. He  checks through its components then prepares to head back out  into the storm.  INT. BOAT - BOAT ROLL - DAWN (DAY 5)  Just as he is about to open up the hatch again he gets thrown  off the steps as the boat starts to go down the face of  another massive wave. Although this time, things seem  different... very different.  Everything goes almost eerily silent as the boat seems to  float in the air. Then it skips, then again, then total  mayhem as the boat is rolled over.  The porthole windows turn blue with water, so do the skylight  windows. OUR MAN is hurled to the ceiling of the cabin as it  temporarily becomes the floor.  Then the horrible sound of ripping fiberglass.  13.",
      "characters": [],
      "action_text": "The boat continues its roll and the floor becomes the floor  again as OUR MAN gets thrown around like a rag doll.  The boat somewhat stabilizes and before it heads down the  next wave OUR MAN goes to the skylight porthole to look up  and sees through the early morning light to see what the hell  just happened.  He rushes over to a side window and sees a few of the stays  (cables that hold up the mast) have ripped from the deck and  are whipping around.  Here comes another massive wave. He braces himself.  It’s not as big but the boat is hurtling down the face and  sounds as though it may start coming apart.  OUR MAN must get out and install the sea anchor.  He forgoes putting on any foul weather gear and goes over to  the steps.  EXT. BOAT - COCKPIT - POV OF DAMAGED DECK - DAWN  As he comes up the steps and into the cockpit the light of  the new day lets him see the size and ferocity of the waves  for the first time. The rain and wind have somewhat died down  but the waves are beyond belief.  Trying not to lock up completely from fear OUR MAN makes his  way to the back of the cockpit, attaches the clip of the sea  anchor to the back of the boat and then, just as he lets the  cloth parachute go into the water, a massive wave builds  behind the boat.  A second smaller cross wave comes and pushes the boat  sideways and it begins a death-roll.  EXT. BOAT - COCKPIT/OCEAN  The cockpit area is now underwater and OUR MAN is doing all  he can to stay attached to the boat. He did not attach the  storm harness this time so he is free floating into the  ocean.  The boat does a massive full flip under the water and then a  noise like nothing else we have heard up to this point. It’s  snapping metal combined with the deep thunder of a fifty foot  wave crashing around him.  14. The boat starts in on a second flip and miraculously he is  scooped back up into the cockpit by total luck as the boat  rights itself in the trough of the wave.  OUR MAN looks around and can’t believe that ",
      "dialogue_count": 0,
      "word_count": 5690
    }
  ]
}