{
  "slug": "all-quiet-on-the-western-front-2022",
  "title": "all quiet on the western front",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 24,
  "characters_count": 0,
  "characters": [],
  "total_words": 26760,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. WOODS, FRANCE 1917 - DAWN 1   1  Softly LAPPING WATER. A creek running over roots, grass swaying in the stream. Ferns softly RUSTLE in the wind. THUMP. A pine cone falls on the ground. Another one. And another one A peaceful, mild spring morning. Peaceful. LOW RUMBLE OF THUNDER in the distance. It's very quiet. Too quiet. INTERCUT WITH: INT. FOX DEN - DAY 2   2  A narrow shaft of light falls into the fox den, from the entrance of the tunnel. The dirt is damp. And a soft noise. SCRATCHING. SMACKING. SOFT WHIMPERS. The vixen feeds her young, who greedily suckle at her teats. The twigs and berries beside them. Then, we hear it again. A distant RUMBLE OF THUNDER, followed by a noticeable TREMOR. A little dirt trickles from the ceiling. Light falls on the young family, like a painting of the Madonna. The vixen ignores it, wholly absorbed by her litter. She licks their fur and lets them suckle. It's soft and fuzzy and full of love... ... when suddenly: A SHORT, SHARP, SHRILL tone. BOOOOM! The world explodes. Everything goes BLACK. The fox den has ceased to exist. EXT. LATIERRE / TRENCH - DAY 3   3  A trench -- about 8 feet deep. Walls of earth and clay. The bottom is mud and dirt. THUMP. THUMP. THUMP. THUMP. THUMP. Deafening NOISE. A hellish barrage of gunfire. Metal shrapnel perforates the wood posts like butter. Hundreds of shells explode around the GERMAN SOLDIERS, hurling piles of dirt into the air. Ruthless. Destructive. Random. We pan over dozens of bodies: Young SOLDIERS lying in the dirt, hugging the walls of the trench. They hope against hope they will survive the next seconds. That's all it's ever about: Surviving the next seconds.  (CONTINUED)",
      "characters": [],
      "action_text": "BOOM! A DIRECT HIT. The trench explodes in a cloud of dirt, smoke and death. Bodies fly through the air, landing in the reeking water. Over the SCREAMS of the wounded -- amid a crescendo of noise and chaos -- we hear barked orders across the front lines: SERGEANT (O.S.)  ATTACK... ATTACK!  ANGLE ON the frightened face of a SOLDIER: HEINRICH GERBER -- no older than 18. His hands clutch a rifle, his knuckles stand out white as a ghost, his bayonet is mounted. The SERGEANT appears, drags Gerber to the ladder. SERGEANT (CONT'D) Come on, Heinrich!!! Let's go! BOOM! A shell hits the trench. Soldiers hurry by. SERGEANT (CONT'D) On my orders. Charge!!! A shrill WHISTLE and WAR CRY arises along the front line. A young 16-YEAR-OLD RECRUIT, looks at him, trembling... Heinrich nods at him. HEINRICH GERBER It'll be OK! Before we can catch our breath, HEINRICH climbs up the ladder behind the RECRUIT, out of the German trench, right into the MG barrage whipping at them from the French lines. RAT TAT TAT TAT TAT! The RECRUIT and a dozen other men are hit and hurled back into the trench like dominos. Heinrich stands at the top of the ladder. Trembling, he turns around to see the young RECRUIT bleeding to death in the mud, shot in the head. SOLDIERS (O.S.) Keep going! SERGEANT Go on, Gerber. Go! The next wave of Soldiers throngs up from below, forcing Heinrich up the ladder, onto the the roiling battlefield. The Sergeant drives him onward. SERGEANT (CONT'D) Go, go, go!  CONTINUED: 3   3 (CONTINUED)  Goldenrod Revision 22.4.2021   2. Heinrich fights his way through the heavy mud which sucks at his boots and slows him down. Past the tentacles of barbed wire, in which disfigured bodies hang. BOOM! A shell hits a few yards off, hurling dirt and mud over us. Heinrich keeps on running. He staggers and runs, bowing low, shitting bricks. He fights against overwhelming nausea as shells blow new craters around us. A No Man's Land of death and madness, pocked with craters like the moon. Heinric",
      "dialogue_count": 0,
      "word_count": 862
    },
    {
      "scene_number": 2,
      "slugline": "EXT. BEHIND GERMAN LINES / MASS GRAVE - DUSK 4   4  An open-bed truck on the edge of a makeshift cemetery, SOLDIERS are unloading the bodies of German recruits. One of them is Heinrich Gerber, a bloody wound in his chest. They unbutton his uniform jacket and toss his uniform onto the pile. The boots land on another pile. Coffins of a mass grave piled up in BG. EXT. BEHIND GERMAN LINES / TRAIN TRACKS - DAY 5   5  A freight train along a railroad embankment. The dead men's uniforms in bundles in a boxcar. WOUNDED SOLDIERS are loaded on beside them. EXT. TEXTILE FACTORY, GERMANY - DAY 6   6  An open-bed truck, piled high with military uniforms, pulls up outside a factory. Bundles of dirty uniforms are tossed on a hand cart. INT. TEXTILE FACTORY WASH ROOM, GERMANY - DAY 7   7  A load of uniforms is dumped into a huge trough full of hot soapy water. The suds turn red. A strong WOMAN stirs the vat. INT. TEXTILE FACTORY DRYING ROOM, GERMANY - DAY 8   8  A pile of half-dry, washed uniforms hang from a drying line. Water drips into puddles beneath them. A WASHERWOMAN comes and collects the uniforms. INT. TEXTILE FACTORY HALL, GERMANY - DAY 9   9  ...which are wheeled down the hall in a hand cart. INT. TEXTILE FACTORY, GERMANY - DAY 10   10  ...into a room with SEAMSTRESSES at sewing machines. A young SEAMSTRESS (14) takes a pile of clothes and returns to her sewing machine. She examines a uniform jacket: A narrow slit stabbed into the chest. She starts sewing. WHIRRRR. The sewing machine RATTLES. CLOSE ON: The collar name tag reads HEINRICH GERBER. Goldenrod Revision 22.4.2021   4.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 286
    },
    {
      "scene_number": 3,
      "slugline": "EXT. COUNTRY ROAD, GERMANY - DAY 11   11  A bicyclist pedals along the road: PAUL BÄUMER, 18 years old. A skinny young man with a sincere face and a school book bag on his bicycle cargo rack. The textile factory truck roars up from behind, HONKS briefly, swerves and passes the young man. Uniforms piled up on the back of the truck -- laundered and neatly folded. A VETERAN with a cigarette beside them, missing an arm and half his face. Paul Bäumer watches him go, a shadow of doubt on his face seeing the broken man. He gets a grip on himself and keeps pedaling. EXT. SMALL TOWN / ALLEY - DAY 12   12  Paul rides his bike through town. EXT. SCHOOL - DAY 13   13  Paul pedals down an alley and parks his bike against a wall. With lowered gaze, he takes his school bag and follows the throng of STUDENTS to the auditorium. A few of his FRIENDS call to him among the hullabaloo. KROPP Paul...? Paul! ALBERT KROPP (19), a farmer's son who made it to the college- track Gymnasium prep school. He may be a little thick, but he's full of verve for life. Strong, tough, down to earth, with rough milking hands. He's very traditional. FRANZ MÜLLER (19) is more oriented toward the future. He likes progress and the finer things in life. He's well-spoken and a Ladies' man, always has a comb in his pocket. Then there's LUDWIG BEHM (18), the runt of the gang. A pale, skinny, somewhat fearful guy. A dreamer with glasses. KROPP (CONT'D) Well? Paul shakes his head in resignation. Kropp and Müller GROAN. KROPP (CONT'D) Now what? Does he know we're all going? PAUL Sure.  (CONTINUED)  Goldenrod Revision 22.4.2021   5.",
      "characters": [],
      "action_text": "BEHM Are you staying home? KROPP For Christ's sake, are you supposed to stay here hugging your mommy's apron? MÜLLER Gimme that. Müller sticks his hand out for the school bag. Paul is shaken by what Kropp said. He's a lot of things, but definitely no mama's boy. MÜLLER (CONT'D) Give it to me. I'll sign it. BEHM His parents have to sign. MÜLLER But they didn't, so gimme that. BEHM You can't. They'll notice. KROPP How? Is your daddy their pen pal? Paul seems to hesitate for a moment. He finally opens his book bag. CLACK. He gets out a pen and paper -- his Army volunteer form. He places the form on the book bag and starts to sign... nothing. Out of ink. He turns to his friends, cursing. PAUL Gimme your pen. Kropp doesn't have one. Neither does Müller. Behm eyes him skeptically. BEHM You're gonna be in hot water. He'll give you a thrashing. KROPP Oh, shut up, Ludwig. PAUL You got a better idea? I'm not gonna be the only one to stay behind!  CONTINUED: 13   13 (CONTINUED)  Goldenrod Revision 22.4.2021   6. Behm SIGHS and hands him a pen. Paul quickly kneels and scribbles a signature on the piece of paper. He stands up again quickly. A weight falls off his shoulders. Kropp puts an arm around him. KROPP Congratulations, Private Bäumer. You're headed to the front. PAUL (mumbles) I'm a dead man. The gang of friends heads for the staircase, where the truck is parked at the cargo ramp. The veteran is unloading the uniforms with two other soldiers. INT. SCHOOL / STRAIRS - DAY 14   14  A big staircase. The STUDENTS crowd the steps, Paul and his three buddies among them, holding their marching orders to the front lines, a sense of grand adventure on their faces. They can't wait to become soldiers. The teachers stand at the back in the hall, looking proud. The PRINICIPAL (61) stands on the top flight, a short, wiry guy with a big handlebar mustache, giving a fiery speech. PRINCIPAL You stand on the threshold to becoming men. This is a moment you will always remember. It's a great ",
      "dialogue_count": 0,
      "word_count": 1522
    },
    {
      "scene_number": 4,
      "slugline": "EXT. SMALL TOWN / STREET - DAY 23   23  They march out of town in lockstep, rifles slung over their shoulders. The CHURCH BELLS drown out their MARCHING SONG. RECRUITS  Tomorrow we march To the farmers night quarters. A cup of tea, sugar and coffee, A cup of tea, sugar and coffee, and a glass of wine,   and a glass of wine!  Franz Müller looks at a few GIRLS, waving among the onlookers by the side of the rod. He grins and dances out of line, full of excitement, adventure and joy. MÜLLER  A cup of tea, sugar and coffee, sugar and coffee...  Paul, Müller, Kropp and Behm -- ruddy-cheeked, booming voices. Everyone sings along with their fellows. They all march off to war together...   what an adventure.  EXT. POPLAR-LINED AVENUE, GERMANY - DAY 24   24  A poplar-lined avenue along the road, their tips swaying in the wind. The recruits march down the road. RECRUITS  Tomorrow we march To the farmers night quarters. And when I leave, my girl will grieve, And when I leave, my girl will grieve and will cry, and will cry.  The young men march into the distance. Their song wafts over the fields. CUT TO: EXT. TROOP VAN, WESTERN FRONT - DAY 25   25  Behind the lines of the Western Front, Northern France. An open troop transport truck rumbles down the muddy road to the front. Paul and his friends sit in the back, with their rifles and knapsacks, amid two dozen new recruits. Expectation is written all over the young men's faces. The bright spring sun pierces the clouds. KA-CHACK. LIEUTENANT HOPPE (37) has planted himself before them, a Prussian officer with a dirty mouth, a tough guy with a heart of gold.  (CONTINUED)  Goldenrod Revision 22.4.2021   11.",
      "characters": [],
      "action_text": "He pushes his way through the recruits and inspects one rifle after the other. Müller's rifle is spotless. He hands it back wordlessly. Albert Kropp is next. The Lieutenant pulls back the bolt -- KA-CHAK... He stares. Dirty. He holds it under Kropp's nose. LIEUTENANT HOPPE What's your name, Private? KROPP Kropp. Albert Kropp, Lieutenant, Sir. LIEUTENANT HOPPE Do you like dirty girls, Kropp? KROPP  ...?   No, Sir, Lieutenant, Sir. LIEUTENANT HOPPE (indicates the bolt) So why do you sleep with one...? Report for guard duty at 3 a.m.! The Lieutenant tosses the rifle to Kropp, who only barely catches it. Ludwig Behm is next. KA-CHAK. LIEUTENANT HOPPE (CONT'D) Gentlemen! You are fighting in a God-forsaken pile of shit, so you better do it with a clean Mauser! Paul digs out a handkerchief and cleans his barrel quickly. The Lieutenant stands before him already. LIEUTENANT HOPPE (CONT'D) Your life as you knew it is over. Your rifle is your girl now. You are married to your rifle. You will pamper your rifle. You will love your rifle. And God damn it, you will keep it spotless as the thighs of the Holy Virgin! You got it? RECRUITS ON TRUCK Yes, Sir! LIEUTENANT HOPPE Welcome to the 78th Infantry Reserve Regiment. You are now on the Western Front. RECRUITS ON TRUCK Welcome to Paris!  CONTINUED: 25   25 (CONTINUED)  Goldenrod Revision 22.4.2021   12. Albert Kropp clutches his rifle in his arms, grinning. He licks it... The soldiers are brimming with enthusiasm. They laugh and nudge each other. Hoppe lets them and hands his Mauser back to Paul. Clean. KA- CHAK. EXT. FIELD HOSPITAL - DAY 26   26  A temporary field hospital set up behind the front in a bombed-out farm house. SOLDIERS are unloaded from individual trucks, bloody and mutilated: Ambulances, horse carriages, cars. NURSES and MEDICS place the wounded in rows in the mud. The hospital is overcrowded. The only ray of light are a few FEMALE NURSES. An ARMY DOCTOR (50) comes out of the gate with his ASSISTANT to the street, l",
      "dialogue_count": 0,
      "word_count": 1049
    },
    {
      "scene_number": 5,
      "slugline": "EXT. MUDDY ROAD TO FRONT - DAY 27   27  The sky is overcast. It looks like rain. An ammo supply convoy passes them on the road. The soldiers march toward the front. Clay sticks to their boots, a dead dog lies in their path. Lt. Hoppe eggs them on. LIEUTENANT HOPPE Step lively, Soldier! Don't fall asleep! He marches along beside Müller for a beat. LIEUTENANT HOPPE (CONT'D) You, Müller! The commander in chief expects you to survive at least six weeks. Do you want to be alive in six weeks? MÜLLER Yes, Sir, Lieutenant, Sir. LIEUTENANT HOPPE Then get a move on! March! Müller staggers on, a little faster. Suddenly: a WHISTLE and HOWL. BOOM! BOOM! Two shells land in the distance, hurling up a gush of mud. Most of the recruits hit the dirt. Hoppe SCREAMS at them. LIEUTENANT HOPPE (CONT'D) Gas! Gas! Gas! The recruits frantically get up and dig out their gas masks. While most of them are still struggling with their satchels, Hoppe already has his mask on and fastened. The Lieutenant marches along his squad, his voice muffled by his gas mask. He's using the forced march for a drill. LIEUTENANT HOPPE (CONT'D) Gentlemen, that was what you call a  \"Fat pig\" . If the Frogs could aim, they'd be scratching us off the road with a spatula and burying us in a mess kit. But one thing is as sure as hell:   \"Fat pigs\"   don't carry poison gas. Paul helps Behm, who dropped his mask in the mud, so he's the last to put it on. Hoppe continues his speech stoically.  (CONTINUED)  Goldenrod Revision 22.4.2021   15.",
      "characters": [],
      "action_text": "LIEUTENANT HOPPE (CONT'D) Poison gas shells come in groups of three and land with a dull thud. So if you see someone putting on their mask, put on yours. You've got six seconds before you start spitting clots of blood the size of beets back home on the farm. Lt. Hoppe stops before Paul. Very calmly, he watches the young recruit still struggling with his gas mask. LIEUTENANT HOPPE (CONT'D) Eyes front! The recruits snap to and look straight ahead -- except Paul, who frantically wedges his gas mask between his knees, trying to adjust the leather straps. Hoppe's glasses fog up, a first drop of rain falls on them. His ominous breathing behind the mask. In. Out. In. Out. A bit like Darth Vader. Paul finally got it on. He puts the mask on and looks straight ahead. LIEUTENANT HOPPE (CONT'D) Are you deaf, man? PAUL No, Lieutenant, Sir. I was just trying to put my mask on. Hoppe eyes him for a beat. Then: LIEUTENANT HOPPE You're almost certainly gonna be dead by dawn, boy. You better have something to eat. Paul swallows the insult. Hoppe takes his mask off and turns to the squad. LIEUTENANT HOPPE (CONT'D) Attention! Masks off! Two abreast, forward march! (to Paul) Not you. You leave it on until your guard duty tonight. (turns to Kropp) With that shithead there. PAUL Yes Sir, Lieutenant. The recruits stow their masks and march to the front. Paul has a hard time breathing and can hardly keep up.  CONTINUED: 27   27 (CONTINUED)  Goldenrod Revision 22.4.2021   16. The weight of his knapsack is crushing... Artillery RUMBLES in the distance. EXT. LATIERRE HILL / ACCESS TRENCH - DAY 28   28  Rain beats down. Lt. Hoppe leads the exhausted recruits down an access trench to the front. Shells WHIZZ by. A DRONE drowns everything out. BOOM! The shell explodes. The young recruits duck. Clumps of dirt pelt down on their backs. Hoppe waves them onward. LIEUTENANT HOPPE Go. Go! Bullets ZING over their heads. MG FIRE RATTLES in the distance. WOUNDED MEN come toward them, two SOLDIERS drag an e",
      "dialogue_count": 0,
      "word_count": 1608
    },
    {
      "scene_number": 6,
      "slugline": "EXT. LATIERRE HILL / TRENCH - NIGHT 30   30  The middle of the night. It's still raining. It's cold, wet, and dirty. A flare illuminates the battlefield, strewn with corpses. Paul and Kropp huddle in the trench, their uniform collars closed tight around their necks, pulling guard duty. Kropp's head sinks to his chest. He has a carving knife and a piece of wood on his lap -- he's fallen asleep over his carving. Paul is polishing his rifle again, then he listens up and looks out at the deep darkness -- a RUSTLE in the dark. He nudges his friend. PAUL Albert... Albert! Albert Kropp wakes up again. PAUL (CONT'D) Soldiers who fall asleep on guard duty are court-martialed and shot. KROPP Leave me alone. Kropp straightens up tiredly and watches Paul cleaning his rifle. KROPP (CONT'D) You think it will shoot better that way? Paul listens up. There it is again: The RUSTLE in the dark. PAUL Did you hear that? KROPP What? PAUL That noise. Listen. KROPP It's nothing. PAUL Psst -- Albert keeps carving his block of wood, delicate work for his rough hands. Paul listens to the dark and raises his rifle, excitedly.  (CONTINUED)  Goldenrod Revision 22.4.2021   21.",
      "characters": [],
      "action_text": "PAUL (CONT'D) Our first Frenchman. KROPP Settle down. There it is again. A soft RUSTLE, not even ten yards away. Paul and Kropp exchange looks. They both pale. KROPP (CONT'D) Now I heard it too. PAUL (loud whisper) Who's there? No answer. The RUSTLING suddenly stops, then resumes a few seconds later. Paul aims his rifle into the dark. A shadow flits by in the dark, looking like a man. PAUL (CONT'D) (louder) Halt, who goes there? (in broken French)  Montrez-vous!  Nothing. The shadow crawls toward them... Paul SHOOTS. The muzzle flash illuminates the night: Two rats, the size of a loaf of bread, skitter a few steps to the side. Their faces are bloody; one of them has human entrails dangling from its mouth. Suddenly -- CLANG! A bullet hits Paul's helmet and knocks it clean off his head. Paul falls off the ladder and lands in a puddle at the bottom of the trench. PAUL (CONT'D) I'm hit! I'm hit! He frantically feels his face and head to see where he's hit. Then he inspects his helmet and discovers two bullet holes. PAUL (CONT'D) They shot me. Twice! KROPP Well, there were two rats, after all. KAT (O.S.) Who shot? Katczinsky comes out of the covered path and approaches up the trench. Paul shows him his bullet-riddled helmet.  CONTINUED: 30   30 (CONTINUED)  Goldenrod Revision 22.4.2021   22. PAUL They shot me. Two of those bastards shot me. KAT With one shot? Kat looks at the damage: One entry hole, one exit hole. KAT (CONT'D) They saw your muzzle flash. Next time, don't stick your head out. He hands Paul back his helmet. The boy dons it, awkwardly and returns to his original position. KAT (CONT'D) If you don't wanna catch the next bullet with your teeth, I suggest you moved ten meters down the trench. The two recruits stare at him. KAT (CONT'D) Shoot, move, shoot, move. Got it? Kat heads off, shaking his head. Paul and Kropp head along the trench and take their positions again. Paul reloads. Two FLARES are shot into the sky, gliding down on parachutes. Paul and Kropp ga",
      "dialogue_count": 0,
      "word_count": 679
    },
    {
      "scene_number": 7,
      "slugline": "INT. LATIERRE HILL / BUNKER - NIGHT 31   31  The SOLDIERS sit in the bunker, huddling tight. It's dark. Earth and wood walls. Paul and Kropp find themselves a spot, near Müller and Behm. Kat and Tjaden are with them. Shells hit outside. BOOM. BOOM. BOOM. It doesn't stop. The recruits are in panic. They shut their eyes, shaking, as the veterans sit there, stoically waiting for the end of the barrage. Behm holds his ears shut, sweating and and gasping for air. BEHM \"You are what you eat...\" My mother always said. Paul smiles. Behm looks at him. BEHM (CONT'D) We'll stick together, Paul. PAUL Yeah. A shell strikes nearby. BOOM. A roof beam breaks and collapses, sending dirt raining down on the soldiers. A desperate recruit pukes in a corner. Ludwig Behm wants to   *  get up and flee, but Paul is holding him back.   *  PAUL (CONT'D)   *  Don't, Ludwig. Everything will be   *  fine.   *  BEHM   *  I can't do this, Paul. I can't. I   *  wanna go back home.   *  PAUL   *  Ssssh.   *  The barrage gradually recedes to behind the front. A few   *  clods of dirt rain down from the ceiling. Behm gets a grip on   *  himself. The soldiers are listening.   *  TJADEN   *  Creeping barrage.   *  PAUL   *  What?   *  TJADEN   *  The artillery barrage moves forward   *  every few minutes, as the infantry   *  advances behind it.   * (CONTINUED)  Goldenrod Revision 22.4.2021   24.",
      "characters": [],
      "action_text": "KROPP   *  What does that mean?   *  KAT   *  It means they're coming.   *  He grins into the silence. The men await the impending   *  attack. Behm chews his lip in fear. Paul and Kropp clutch   *  their rifles...   *  But nothing happens. There's no attack. The air is   *  suffocating, Behm yanks open his uniform collar. The men sit   *  there, as if sitting in their graves.   *  BOOM! The walls shake. A SCREAM and FLASH. Smoke. Sulfur.   *  Dirt. Dust. The bunker creaks under the hit, all the beams   *  straining, but they hold.   *  A frantic recruit, 19 years old, climbs over the men and   *  heads for the exit. Kat and Tjaden try to stop him.   *  KAT (CONT'D) Where are you going? You are   *  staying here.   *  SOLDIER No. Let me out. I wanna get out of   *  here!   *  KAT Settle down. Clam down, god damn   *  it!   *  The SOLDIER breaks free and runs towards the exit, when a   *  HUGE EXPLOSION hurls him back, ripping the young soldier   *  apart.   *  Blood spatters Tjaden's face. Shrapnel and bits of uniforms   *  everywhere. Ludwig Behm is hitting his head against the wall   *  like a billy goat, over and over again. Paul almost has to   *  puke for a moment, then the next shell hits the top of the bunker. BOOM. BOOM. BOOM. KAT (CONT'D) Out! Out! Out! BOOM! A direct hit. The beams burst over their heads. The soldiers leap up with their rifles and try to flee out of the bunker... It's too late. The earth SHAKES. BLACK.  CONTINUED: 31   31 (CONTINUED)  Goldenrod Revision 22.4.2021   25. Silence. DEATHLY SILENCE. CUT TO: EXT. LATIERRE HILL / UNDERGROUND - DAWN 32   32  A quiet SCRATCHING and SCRAPING noise. Flat breathing. Suddenly, a first ray of dawn light pierces the dirt: Paul lies buried beneath. He gasps for air, hears the SOLDIERS' muffled voices. SOLDIERS  < Here's one. Go on, help me get him out! Pull! >  Paul still can hardly hear. His ears RING. A DEAD SOLDIER out of the corner of his eye. Suddenly, Franz Müller appears, helping his fellow soldier",
      "dialogue_count": 0,
      "word_count": 1063
    },
    {
      "scene_number": 8,
      "slugline": "EXT. FIELDS - DAY 34   34  The wheat is tall and golden in a field, the wind whips the stalls gently. Calm, peaceful, majestic. EXT. FIELDS BEHIND THE FRONT - DAWN 35   35  It's Fall by now. The fields are bare. Fog hangs low over the ground. Leaves are still blowing across the roads here and there.  18 MONTHS LATER. NOVEMBER 1918.  INT/EXT. TRUCK / ROAD BY FARM - DAY 36   36  An ammo truck heads for the front. Spent cartridges jiggle on the cargo bed. Paul dangles his legs off the back of the truck. Paul has aged. His gaze has hardened. Kat leans against the cab. Finally, he knocks on the window. The DRIVER brakes, the two buddies jump off the back. Kat offers the driver two cigarettes as payment. KAT Thanks. The truck slows down. Kat and Paul march across a field. EXT. ROAD / FARM - DAY 37   37  A farm wall appears off to one side of the road. Kat and Paul march toward it. KAT I did the math, Paul If we keep up this pace, we'll have conquered all of France in 180 years. Paul grins. PAUL What? Are you gonna go get 'em? KAT M-hm. PAUL Don't get caught. KAT No way. He shrugs. Goldenrod Revision 22.4.2021   28.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 217
    },
    {
      "scene_number": 9,
      "slugline": "EXT. FARMYARD - DAY 38   38  Kat stops at the farmyard wall, listening to the wind. KAT Listen. Soft CLUCKING NOISES in the distance. Kat glances at his friend. KAT (CONT'D) What do you think? Is this worth dying for? PAUL Anything's worth it when you're hungry. Paul grins. He squats down and extends his clasped hands to Paul. Kat sticks his foot in his cradle and deftly climbs over the wall. Paul stays behind, alone, looks down at the valley, pensively. A DOG barks somewhere. Paul listen up. A GOOSE HONKS like an alarm, a door slams on the farm yard, and suddenly... BANG! He hears a man swear in FRENCH. Paul peers through a crack in the gate, sees the dog run by. A BOY (10) stumbles along after it. Paul creeps around the yard as Kat staggers out of the stable door onto the fields. KAT Quick! Run! FARMER  < Voleur! >  BLAM! Another bullet misses him. The Farmer CURSES in French behind him. Paul runs along with him, PANTING. KAT Throw. Throw! Kat tosses the goose to him like a rugby player. Laughing, the two buddies flee over the field. INT./EXT. SHED / STAGING CAMP BEHIND THE FRONT LINES - DAY 39   39  A shed on the edge of a staging camp, where soldiers can recuperate. Through a dirty window, we see Paul, Kropp, Müller and Tjaden heads straight for the shed.  (CONTINUED)  Goldenrod Revision 22.4.2021   29.",
      "characters": [],
      "action_text": "CLACK. The men stumble in, famished. Kat already has plucked the goose and is frying it in the pan. It sizzles on the stove. The men greedily inhale the smell. TJADEN Oh, my God. You're the best, Kat. KAT Shut the door or everybody will smell it. Tjaden shuts the door. They all take out the plates of their mess kits. Kat carves big fat slices for the gang with his trench knife. KAT (CONT'D) Password? TJADEN I forgot. I'm drawing a blank. KAT What's the password? KAT (CONT'D) Wide eyes, long fingers. TJADEN Mouth open, goose in. They LAUGH. MÜLLER I'll take a wing. TJADEN Gimme the rest. KAT No goose for Franz. KROPP Sleep well in the MG barrage. Kat passes out meat on their plates. Paul is stuffing the goose down in his pillow case. Tjaden grins. TJADEN I'll never forget this, guys. The men wordlessly sit down on crates and start eating. Teeth gnash. Grease drools. They dunk grey biscuits in the gravy. Tjaden has a wing in his mouth like a harmonica, chewing and MOANING in happiness. KAT Taste good?  CONTINUED: 39   39 (CONTINUED)  Goldenrod Revision 22.4.2021   30. ALL Mmmh. Good. You too? KAT Life is short. Frank digs a piece of shotgun lead out of his mouth and spits it into his mess kit. Tjaden drinks grease straight from the pot, smacking. TJADEN Oh boy, oh boy...   Jeeves, you may serve the caviar and coffee now!  MÜLLER  And draw my foot bath, please!  Artillery fire. A low THUD rattles the shed, aerial bombs hit. Muffled SHOUTS. A few SCREAMS. It must've hit a barracks. Airplanes BUZZ in the distance. MG fire: RAT TAT TAT TAT TAT. Tjadsen suddenly looks up. TJADEN Kat... KAT Hm? TJADEN ... The goose is gone and the fox is on the town-o ... The men LAUGH and join in. In here, the fire flickers on the stove, illuminating their faces. The men sit in a circle in their worn uniforms, eating happily. Five friends by the stove, with food to eat – what could be better? OMITTED 40-42   40-42  EXT. STAGING CAMP - DAY 42A   42A  The staging camp on a wide meadow. The s",
      "dialogue_count": 0,
      "word_count": 3529
    },
    {
      "scene_number": 10,
      "slugline": "INT. TRAIN YARD / STOREROOM - DAY 57   57  It's dark and quiet in the storeroom. It's quiet as a grave. All we hear is a few drops from the ceiling and the BUZZ of a swarm of flies. Paul stares... His breath in the damp air, fears rises in his eyes. A sticky pile in FG, flies BUZZ around it. INT. TRAIN YARD / ENGINE HALL - DAY 58   58  Franz in a hallway of the building when we hear SHOUTS in the distance. PAUL (O.S.) Kat...   Kat!?  Franz turns on his heel, then Kat joins him from a side wing. They head up the hall together... INT. TRAIN YARD / STOREROOM - DAY 59   59  A moment later, they reach Paul in the storeroom -- Franz Müller makes a face. MÜLLER Fuck. SIXTY RECRUITS on the floor before them, all DEAD. Blue faces, black lips, frozen in place, their gas masks in their lifeless hands, like they were struck dead. They're all dead. KAT Fucking kids. MÜLLER They took their masks off too soon. Kat heads over to the dead: Pale faces with cramped hands. None older than 18, their uniforms much too big for them. Wordlessly, Kat opens a satchel on his belt and gets out a handful of chlorinated lime. He goes along the row of bodies and sprinkles them with lime... Skinny, white bodies in the dark, shining like funeral shrouds. Kat tosses lime on a BOY (17), who suddenly wakes up and starts to COUGH. He stares at him, wide-eyed and trembling on the floor, too scared to move. Kat quickly kneels down to him.  (CONTINUED)  Goldenrod Revision 22.4.2021   44.",
      "characters": [],
      "action_text": "KAT Hey, hey, hey. It's okay. Can you hear me? The recruit nods, a crust of blood in his ears. KAT (CONT'D) Can you speak? What's your name? My name is Kat. THE BOY E... e... He can't get any more out. Paul approaches and hands him his canteen, but he's too weak. He CHOKES and COUGHS. Müller indicates his boots. MÜLLER Look at those boots. Those are nice boots. Right, Kat? KAT Come on, let's get him out of here. Paul and Kat help the kid get up. They help him limp out of the room, while Müller ogles his boots: They're made of soft yellow leather, with nice buckles on the shaft. EXT. TRAIN YARD BEHIND FRONT LINES - DAY 60   60  Outside, in the fresh air, the kid keels over again. He shyly sticks a hand out for a canteen. Kat holds it up to his mouth. KAT Not so fast. That's better. The kid catches his breath again. KAT (CONT'D) Can you walk? We'll take you to the infirmary. The kid nods. He bravely tries to get on his feet, but he can do it alone. Paul and Kat have to support him. They stagger across the courtyard with him a few feet, then he vomits a gush of blood and collapses in exhaustion again. He lies on the ground, pale as a sheet. He whispers. Kat crouches down to him. KAT (CONT'D) Easy, easy. It'll pass --  CONTINUED: 59   59 (CONTINUED)  Goldenrod Revision 22.4.2021   45. THE BOY St--stay... stay here. KAT Sssh. THE BOY Stay here. KAT Don't worry. I won't leave you. Kat takes the boy's hands, who can hardly breathe. His face is wet with soft tears, which he tries to suppress. He's very brave. One last gasp, then he's dead. Kat looks at him for one more moment, then he lets go of his hands and gets up. Paul can hardly breathe. The soldiers silently stare at the dead kid. Tjaden nods. TJADEN Germany will be depopulated soon. Müller joins him on the ground, taking the kid's boots off. He wordlessly holds up the soles to his own, then puts them on. They fit perfectly. EXT. EQUISAC MANOR - NIGHT 61   61  Night. A diplomatic limousine pulls up to a mansion. The D",
      "dialogue_count": 0,
      "word_count": 1002
    },
    {
      "scene_number": 11,
      "slugline": "EXT. DIPLOMATIC TRAIN - NIGHT 65   65  The lights of a train peel out of the dark. INT. DIPLOMATIC TRAIN / ERZBERGER'S COMPARTMENT - NIGHT 66   66  CLACK-CLACK. CLACK-CLACK. CLACK-CLACK. The monotonous rattle of the train on the tracks. Erzberger can't sleep and sits up in the middle of the night. He pulls his sheets back and picks up pen and paper, making a few notes. The photo of a young man in a frame on his night stand: His son. INT. DIPLOMATIC TRAIN / HALL - NIGHT 67   67  WHOOSH. Erzberger comes out of his compartment in his pajama. He rubs his face, tired, then staggers down the hall to the toilet. INT. DIPLOMATIC TRAIN / TOILET - NIGHT 68   68  Erzberger opens the toilet lid. He quietly whispers to himself, rehearsing a bit. ERZBERGER  ... in the interest of -- I have to insist... I demand, that--  A sudden JERK in the train. Erzberger staggers and misses the toilet. He CURSES softly. ERZBERGER (CONT'D) Damn. He washes his hands and looks for a towel, can't find one, then he looks out into the dark. The window is painted over, through a narrow slit you can see -- A CLEARING IN A BARE FOREST. A second train stands a few hundred meters off on parallel tracks. Wood boards through the mud between the two trains. FRENCH SOLDIERS stand guard, as a grey man gets out of the train. Skinny. Stern. Proud. His uniform fits perfectly. He's FERDINAND JEAN MARIE FOCH (67), French Marshal and Supreme Allied Commander. He lights his pipe. Erzberger -- with wet hands, dressed in his pajama -- starts to SWEAT. He wipes his hands on his pajama pants. Goldenrod Revision 22.4.2021   48.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 288
    },
    {
      "scene_number": 12,
      "slugline": "INT. DIPLOMATIC TRAIN / HALL - NIGHT 69   69  CLACK. Erzberger opens the toilet door and ties the belt of his robe to cover his wet pants. Suddenly, a young man stands before him: Cavalry CAPTAIN VON HELLDORF (27), the delegation's interpreter. He quickly emerges from his compartment and pulls his robe shut. VON HELLDORF What? ERZBERGER We're here. Erzberger can't hide how much it weighs on him. EXT. STAGING CAMP - NIGHT 70   70  The quiet camp in the dark. A few petroleum lamps burn. Lieutenant Hoppe marches over to the Barracks. INT. BARRACKS / STAGING AREA CAMP - NIGHT 71   71  The barracks lies in the dark, as the light suddenly comes on again. Lt. Hoppe staggers down the hall, loudly hitting the bunk beds with a cane. LIEUTENANT HOPPE Soldiers! Pack your knapsacks, roll up your bedding, wash your mess kits. Our Regiment will advance to the front line. Anyone who can stand is coming. The SOLDIERS sit up in bed. Hoppe quickly loses his temper. He starts to SCREAM. LIEUTENANT HOPPE (CONT'D)  Get out, God damn it!   You think the French will wait for you to comb your pubes? Anyone who's not on the truck in fifteen minutes, I will chase on foot with the truck myself! The place comes alive. The soldiers leap out of their beds. Paul stuffs his things into his knapsack. Müller slips his boots on. Kat buttons up his shirt. KAT Here we go. MÜLLER Where to?  (CONTINUED)  Goldenrod Revision 22.4.2021   49.",
      "characters": [],
      "action_text": "KAT To battle. The men nod and buckle on their daggers and spades. EXT. TROOP TRUCK / ROAD BEHIND THE FRONT - NIGHT 72   72  A convoy of hard-top trucks barrels through the night. The road is pot-holed and worn. The trucks have their lights off and hit all the bumps. The men stand crowded on the back of the lead vehicle. There's no room for anyone to sit. Paul, Kat, Müller and Tjaden sway monotonously between the others. Kropp carves a stick, giving it its finishing touches. Suddenly, a reedy NOTE sounds: He plays the flute he carved. It gradually turns into a TUNE... short, but eerily beautiful. KROPP For my sister. Paul nods. The trucks turn off their brights, one after the other. They cruise through the dark. OMITTED 73   73  EXT. LATIERRE HILL / ENTRY TO ACCESS TRENCH - FIRST LIGHT 74   74  An indefinite blue-black light on the horizon, illuminated by muzzle flashes of distant cannons. The air is muggy with gunsmoke and fog. Flares shoot up here and there. It's silent otherwise. The soldiers jump into the access trench one after the other, wearing backpacks. Their heads and rifles stick out like out of a pond, then they disappear underground. EXT. LATIERRE HILL / ENTRY TO ACCESS TRENCH - FIRST LIGHT 75   75  The soldiers goose-step along the trench. Paul stubbornly stares at the back of the guy in front of him. Müller is wearing his scarf and is proud of his boots. Kropp quietly plays his FLUTE. INT. DIPLOMATIC TRAIN - DUSK 76   76  Early morning: It's dawning outside.  CONTINUED: 71   71 (CONTINUED)  Goldenrod Revision 22.4.2021   50. The rest of the distinguished delegation sit with Erzberger and Major General von Winterfeldt in a generous compartment, which was turned into a meeting room: MAJOR GENERAL DETLEF VON WINTERFELDT (51), the Reich Chancellor's military attaché, dressed in uniform from head to toe. Navy Captain ERNST VON VANSELOW (42), ALFRED COUNT VON OBERNDORFF (47) -- members of the Foreign Ministry, CAPTAIN GEYER (36) and the translator: Von Hell",
      "dialogue_count": 0,
      "word_count": 1877
    },
    {
      "scene_number": 13,
      "slugline": "EXT. LATIERRE / FRENCH TRENCH - DUSK 83   83  RAT TAT TAT TAT TAT. A French MG GUNNER fires deadly salvos. EXT. LATIERRE / NO MAN'S LAND - DUSK 84   84  All hell breaks loose around us, coloring the fog red. Paul staggers and falls, getting back up, forced to take cover behind an earth berm. He wipes the dirt from his face. Then he crawls up the wall and pulls a hand grenade out of his satchel. Trembling, he pulls the pin and tosses it in the enemy trench, where young eyes flash under enemy helmets. CALLS and SHOUTS. THE MG falls silent. Then: BOOM! The hand grenade explodes, tearing the French SOLDIERS apart. Anger. Sweat. Blood. Death. Paul struggles up and charges over the berm, FIRING into the enemy trench, SCREAMING, and charging into it. EXT. LATIERRE / FRENCH TRENCH - DUSK 85   85  A few DEAD SOLDIERS killed by the hand grenade before them. A FRENCHMAN tries to flee. Paul SHOOTS him at close quarters. Another one of them is barely alive. Paul stabs him with his bayonet, where it gets stuck between the ribs. He rams his feet in his ribs to pull it out. A FRENCHMAN attacks him from behind, Paul drops his bayonet. He gets his trench shovel out with his other hand and HITS the man with the sharp edge of his shovel. The Frenchman defends himself with his arms, but it's no use. The sound of BREAKING BONES. WHAM! WHAM! WHAM! GASPING, the Frenchman falls into the black mud, his hand on his shattered collar bone, blood oozing out between his fingers. Paul Bäumer stands over him. They exchange looks: Innocent eyes, filled with the horror of this waking nightmare. The Frenchman can hardly breathe and clutches Paul's collar, desperately. Blood GURGLES in his throat. His body drains. He whispers. FRENCH SOLDIERS  Pourquoi tu veux me tuer?   Je veux pas te tuer...   Pourquoi?  He stares up at the German, who stands there, transfixed, his shovel raised for the next blow, staring like a wild beast.  (CONTINUED)  Goldenrod Revision 22.4.2021   56.",
      "characters": [],
      "action_text": "Müller appears out of nowhere. He draws his gun and SHOOTS the man in the head, matter of factly. MÜLLER Let's keep going, Paul! Paul takes his eyes off the man and runs after his comrade. CUT TO: FURTHER ALONG THE TRENCH Kat and Tjaden maker their way along the trench until they reach a bunker. A FRENCHMAN tries to escape, but Kat HITS him in the face with his rifle butt. Kat quickly secures the entrance of the bunker, then Tjaden tosses a hand grenade into the bunker. The earth trembles. A BLAST, smoke and groans. A French OFFICER staggers out, ears bleeding. Kat stabs him with his bayonet, as Paul and Franz join him from BG. Franz staggers on without stopping to catch his breath. CUT TO: FURTHER ALONG THE TRENCH The FRENCH are overrun. Paul staggers after Kat and Tjaden, breathlessly. He falls on a soft body, struggles back up. CUT TO: SIDE TRENCH Kat and Tjaden exchange GUNFIRE with two Frenchmen, until they lie dead on the ground. Another one turns on his heel and takes cover in a shelter. Kat hurries after them, pulls out a grenade, but Tjaden holds him back and runs past him. A mad look, a deep breath, then Tjaden charges into the shelter with a madman's glee, SCREAMING and FIRING blindly. Kat charges after him. INT. LATIERRE / FRENCH SHELTER / KITCHEN - DUSK 86   86  It's the kitchen. Three FRENCHMEN have taken cover here. Tjaden shoots all three, a Kat kneels at the door, covering him.  CONTINUED: 85   85 (CONTINUED)  Goldenrod Revision 22.4.2021   57. Bullets whip the dirt, cans EXPLODE on the shelves. Finally, all the Frenchmen are hit and lie on the floor, bleeding. Tjaden heads to the shelves, plundering their supplies. He draws his knife and opens a can of corned beef, spreads it on a baguette. FRENCHMEN run by the door. While Paul keeps guard, Kat finds a bottle of Cognac and opens it. Kat, Paul and Tjaden drink and scarf the food down, hungrily. They look at the ground with dirty eyes, chewing. They still their hunger. It tastes good. They suddenly f",
      "dialogue_count": 0,
      "word_count": 2139
    },
    {
      "scene_number": 14,
      "slugline": "EXT. DIPLOMATIC TRAIN - DAY 91   91  The diplomatic train stands deserted in the woods. A FRENCH GUARDSMAN is smoking in the fog. INT. DIPLOMATIC TRAIN - DAY 92   92  The German Armistice negotiating team is back on their train. They sit around the conference table, grumpily. Major General von Winterfeldt pages through the Allied treaty draft, them slams it shut angrily. MAJOR GENERAL WINTERFELDT This isn't a negotiation, it's a dictate. COUNT VON OBERNDORFF Maybe we should go back to Spa to consult with the High Command? MAJOR GENERAL WINTERFELDT What good will that do? There's no alternative but to fight to the end. Even if we wind up losing, we won't be worse off than with this capitulation. ERZBERGER Except for a few hundred thousand more dead. Erzberger stands at the window, staring out at his dirty shoes. With a scoff, the Major General takes the contract and waves it like a stinking rag. MAJOR GENERAL WINTERFELDT This is a complete capitulation. Alsace-Lorraine. The occupation of the Rhineland. Cannons. Locomotives. Wagons. Negotiating over this is political foolishness! ERZBERGER 250,000 Americans are landing in Europe every month. Cambrai, Marne, Cantigny -- all lost. The only thing separating us from Armistice is false pride... We will now undo the mess you and your fellow Generals have left us. But if you don't want to stay... be my guest. We will stay here. And then, if you wanna blames someone afterward, well, here I am.  (CONTINUED)  Goldenrod Revision 22.4.2021   63.",
      "characters": [],
      "action_text": "Erzberger stares at his opponent, with a calm but sharp tone. Count von Oberndorff gets involved, expressing his doubts. COUNT VON OBERNDORFF It's winter. Without trains and provisions, the Bolsheviks will overrun us. The men will starve on their way home, instead of dying with honor on the battlefield. ERZBERGER Honor? My son fell in this war. Where's his honor? Erzberger eyes the others coolly. Then he turns to Von Helldorf. ERZBERGER (CONT'D) Von Helldorf. Get us a few copies of the Allied demands and telegraph headquarters to inform the government. Von Helldorf salutes and exits the car. Erzberger looks around at everyone. ERZBERGER (CONT'D) We have 72 hours, gentlemen. Every minute we waste talking here, another soldier dies. Let's pray for God's mercy, but for God's sake end the war. Erzberger wipes the sweat off his brow. EXT. EGUISAC MANOR - DAY 93   93  General Friedrichs steps out on the balcony of HQ, looks out at the battle in the distance. A shadow of a doubt on his face, as he resists the looming defeat. EXT. LATIERRE HILL / HINTERLAND - DAY 94   94  Tree trunks blasted by the artillery barrage. Their blackened, splintered tree trunks dot the plain. In between, a wasteland of craters and holes. Heavy fire covers the land. Dead bodies all over. The whole company is retreating. Panting, Paul carries the heavy tripod on his shoulder. A SHELL EXPLODES barely five meters away from him, killing a private.  CONTINUED: 92   92 (CONTINUED)  Goldenrod Revision 22.4.2021   64. THUMP THUMP THUMP. The bullets ZING past, riddling tree trunks. Soldiers fall all over. A plane ROARS overhead, also opening FIRE. With his last strength, Paul jumps into a crater for cover. EXT. LATIERRE HILL / CRATER - DAY 95   95  An oily mess at the bottom of the crater, a yellow puddle of blood in it. Paul leaps in it. It's noon. The hot sun burns down. Out of breath, Paul wipes the blood off his face. His hands tremble uncontrollably. He rises up a bit to look out, but quickly ducks d",
      "dialogue_count": 0,
      "word_count": 1891
    },
    {
      "scene_number": 15,
      "slugline": "EXT. EGUISAC - DUSK 99   99  Finally, we reach Eguisac. A deserted, destroyed village with bombed-out roofs. A flare shoots skyward behind a shot-up church tower. SOLDIERS warm themselves at the campfires which burn all over. EXT. EQUISAC / VILLAGE SQUARE - NIGHT 100   100  On the village square, a few SOLDIERS drag up mattresses from the houses. Two of them lie in a four-poster bed in the middle of the burning street. Beside them, a SOLDIER is shooting up morphine. A CROWD chases a pig across the square. Soldiers PLUNDER the town and urinate on the street, SINGING and SHOOTING in the air. A drunk PRIEST (32) is blessing a loose group of men kneeling before him on the ground. PRIEST Lamb of God, you take away the sins of the earth: have mercy on us. Lamb of God, you take away the sins of the earth: give us your peace. SOLDIERS Lord, I am not worthy that you should enter under my roof, but only say the word and my soul shall be healed. The Priest goes around between the soldiers, hands them his bottle of wine. He blesses them. PRIEST Born in war, died in war. A PHONOGRAPH plays on the other side of the street. A SOLDIER sits at the head of the bed in a velvet fauteuil armchair, listening to the music and smoking a cigar like Che Guevara himself. A man beside him sits in a cast-iron tub full of bloody water. If this were Apocalypse Now, this would be Col. Kurtz's camp, only without the leadership. Paul staggers up the street, exhausted. A few SOLDIERS sidle past, rifles slung over their shoulders Russian-style, with the butts up. One of them runs into Paul's arms. SOLDIER LEMROTT Knock on the monastery's door and you will only find thieves and hoodlums. PAUL ...?  (CONTINUED)  Goldenrod Revision 22.4.2021   70.",
      "characters": [],
      "action_text": "SOLDIER LEMROTT It's over. It's all over. The pig fuckers are surrendering. They're finally negotiating...! No answer. SOLDIER LEMROTT (CONT'D) We're going home soon, Soldier! He marches by with his comrades. Paul calls after them. PAUL Where's the infirmary? SOLDIER LEMROTT Who the hell cares? I survived! Paul stays behind, dazed. INT. EGUISAC INFIRMARY - NIGHT 101   101  An old village church, converted to an infirmary. A bucket of water is poured out on the floor. A NURSE scrubs the blood off. A MEDIC brings chloroform to the OR, where a young RECRUIT lies on the operating table, his arm broken to pieces. The man struggles like crazy, while the ARMY SURGEON approaches with a bone saw. OR RECRUIT No! No! Stop it! ARMY SURGEON Hold still! Will you chloroform him, already? The MEDICS press a cloth soaked in chloroform on the man's face, as the surgeon starts sawing his bone. Paul enters, goes along the rows of WOUNDED on the floor, looking for his buddies. No luck. The SCREAMS behind him fall silent. The doctor stops sawing. The Medics carry the corpse off. INT. EGUISAC INFIRMARY / HALL - NIGHT 102   102  Paul heads down the crowded hall of the infirmary, when a voice comes from the yard. TJADEN (O.S.) Bäumer. Bäumer! Paul exits.  CONTINUED: 100   100  Goldenrod Revision 22.4.2021   71.",
      "dialogue_count": 0,
      "word_count": 536
    },
    {
      "scene_number": 16,
      "slugline": "EXT. EGUISAC INFIRMARY / YARD - NIGHT 103   103  Tjaden is lying on a wood bier in the yard, a bloody bandage on his leg. He's sweating and feverish, pale and weak with loss of blood. Paul joins him quickly. PAUL Tjaden. What happened? Where did you get hit? TJADEN Over the knee, I think. I can't feel anything. Paul takes off his helmet and lifts the bandage: A gaping, ugly wound. Tjaden's knee is totally shattered and gangrenous. TJADEN (CONT'D) How far up is the bullet? I can't lift my head. PAUL (lies) At least ten centimeters... You're heading home, Tjaden. TJADEN You think so? PAUL I'm sure of it. Tjaden nods. He clenches his teeth. TJADEN Paul. I heard there will be peace soon. This will all be over soon. PAUL That would be something. TJADEN Goddamn it, how am I gonna make Ranger now? PAUL You still can. Tjaden shakes his head. TJADEN I'm not gonna let them amputate, Paul. I'm not gonna be a cripple.  (CONTINUED)  Goldenrod Revision 22.4.2021   72.",
      "characters": [],
      "action_text": "PAUL You won't have to. You'll see -- They've patched up much worse cases here. Tjaden gulps and shuts his eyes. He has to get a grip on himself. TJADEN Paul... With great effort, he sticks his hands in his pocket. Then he gets a scarf out... Müller's scarf. A smattering of blood on the corner. Tjaden sticks it in his hand, whispering. TJADEN (CONT'D) This is for you. Paul stares at it, incredulous. PAUL Is he dead? Tjaden nods. TJADEN (shakes his head) You have to be brave now, Paul. You're still alive. You have to be grateful for that... for us. For all those who didn't make it. PAUL Stop it, Tjaden. Don't say that. Not you! Paul gets angry. He has tears in his eyes. Tjaden clenches his teeth and takes Paul's hand with the scarf in it. TJADEN Listen, Paul. I heard they're serving beans in back of the yard. Can you bring me some? PAUL (nods) Sure. TJADEN Come right back, huh? And don't forget your mess kit. Paul stares at him --   why should he forget his mess kit?   With that, he leaves. Tjaden lets go of his hand, Müller's scarf glides from his fingers.  CONTINUED: 103   103  Goldenrod Revision 22.4.2021   73.",
      "dialogue_count": 0,
      "word_count": 383
    },
    {
      "scene_number": 17,
      "slugline": "EXT. EGUISAC INFIRMARY - NIGHT 104   104  Paul comes out on the street. He looks at the scarf for a beat, then he ties it around his neck... He will wear it all the time from now on. INT. EGUISAC SOUP KITCHEN - NIGHT 105   105  The fires flicker outside. The ARMY COOK (32) at the head of the room, defending his mess kitchen. A horde of SOLDIERS crowds around him with their mess kits. Kat is in the front row. ARMY COOK Not so fast! Not until everyone's here. SOLDIER FROM CHURCH We are. ARMY COOK Yeah, sure. Where are the others? KAT Dead or infirmary. They're not your business any more. Paul listens up. Was that his buddy? Paul quickly grabs a mess kit off a pile and approaches the rebellious horde, while the cook is blown away for a beat. Kat is in the very front. KAT (CONT'D) Go on, Cookie, serve it up. We can smell it's done. ARMY COOK I -- I can't'. SOLDIER FROM CHURCH Why not, bacon grease? ARMY COOK I cooked for a hundred and fifty. I can't serve eighty men food for a hundred and fifty. KAT I think you need to be relieved of duty. You got provisions for 2nd Company. That's us. We're the 2nd Company. So dish it out! SOLDIER FROM CHURCH As if they were your provisions. PRIVATE FROM CHURCH Go on, hurry up. We finally wanna eat.  (CONTINUED)  Goldenrod Revision 22.4.2021   74.",
      "characters": [],
      "action_text": "KAT Don't lose count! PAUL Kat... Kat! KAT Paul? The soldiers shout overlapping and throng the cook. Suddenly a SOLDIER hits an ORGAN keyboard -- the shattered organ pipes GROAN in atonal cacophony. Paul pushes his way amid the throng, reaching Kat by the field kitchen. He SCREAMS over the chaos. PAUL Kat, you're alive! You're alive! KAT Paul! The two buddies hug, happily. Paul SCREAMS over the mayhem. PAUL Tjaden got hit. He's in the church. KAT He'll get double rations from us. Kat sticks his mess kit out to the cook. EXT. EGUISAC INFIRMARY - NIGHT 106   106  Kat and Paul gingerly balance their mess kits full of beans and bacon on the way back to the infirmary. PAUL Fucking hell, I thought you were dead. KAT We all have to die. PAUL But not on the home stretch. They reach the church. KAT If you die before me, I'm gonna kill you. He LAUGHS.  CONTINUED: 105   105  Goldenrod Revision 22.4.2021   75.",
      "dialogue_count": 0,
      "word_count": 411
    },
    {
      "scene_number": 18,
      "slugline": "INT. EGUISAC INFIRMARY / YARD - NIGHT 107   107  Tjaden lies in the yard, half-unconscious. Kat shakes his shoulder. KAT Tjaden. Tjaden... wake up. TJADEN Hm. KAT We brought you beans. TJADEN You got the silverware? Kat takes out the silverware. Tjaden sits up as best he can and smells the steaming grub. TJADEN (CONT'D) Smells good. Fatty. PAUL Need help? TJADEN (shakes his head) I can do it. You got silverware? The men sit up and eat. Embarrassed, Paul avoids the gaze of an injured, FAMISHED SOLDIER, who stares at him, lying on the ground. Tjaden can hardly swallow a bite, but Kat and Paul relish it so much, they huddle over their mess kits, eating silently. Suddenly, Tjaden RAMS THE FORK into his throat. It's a little dull, but he rams it deeper. He keeps stabbing till he hits the jugular. Kat and Paul TACKLE him. PAUL No! Stop. STOP IT! They try to grab the fork from him with all their strength, finally get hold of it. Kat looks around for help. KAT (calls) Help, he's bleeding to death! Kat presses his hand on Tjaden's gushing wound, but no one hears them, no one comes to help. Blood streams out of Tjaden's mouth. Paul whispers.  (CONTINUED)  Goldenrod Revision 22.4.2021   76.",
      "characters": [],
      "action_text": "PAUL Why did you do that? Why? TJADEN It's over, boys. It's over. KAT  We need help!  PAUL Tjaden. Tjaden. Paul and Kat try to help Tjaden, who GURGLES and GASPS. The FAMISHED SOLDIER scrapes up the dish of beans from the dirty floor, greedily scarfing it down on his stretcher. Then Tjaden stops breathing. His blood stops gushing, Kat and Paul are left alone by their dead buddy. EXT. EQUISAC / FIELD - NIGHT 108   108  Reedy grass wafts in the wind as a flare sails into the sky. INT/EXT. EGUISAC / VILLAGE SQUARE RESTAURANT - NIGHT 109   109  The flare sails over Eguisac, casting its shadows over the destroyed village. In a destroyed restaurant, Paul and Kat sit on mattresses on the floor. The light of the flames outside dances on their exhausted faces. They're drinking rum. Kat watches his beetle, dreamily holding out a twig to it. Paul has his mouth and nose buried in Franz's scarf. Suddenly, he has an idea. He searches his pockets for the envelope with Duval's address. KAT What? PAUL I lost something. Paul searches for a beat, then gives up in despair. PAUL (CONT'D) Kat...? Do you speak French? KAT How? I never saw a Frenchman before I came here. PAUL I wish I spoke French... My mother wanted me to learn French.  CONTINUED: 107   107 (MORE) (CONTINUED)  Goldenrod Revision 22.4.2021   77. And piano. But she didn't want me to go to war. \"It's not for you\", she said. \"You'll be dead in two days.\" Paul sinks back down on the mattress. PAUL (CONT'D) I wanted to prove I could do it. KAT And how does that help us now? Paul just shrugs. Not at all. PAUL  \"In two weeks, we'll be in Paris.\"  Two years of hand grenades, you can't just discard all that like a pair of socks. The stench will always be with us. Ludwig is dead. Franz is dead. Albert-- KAT What do we care? We're alive. There's nothing we can do for them now. Who knows what's in store for us. Kat hands the bottle to him. KAT (CONT'D) It's like a fever dream. No one wants it, but suddenly it's there. We didn't want i",
      "dialogue_count": 0,
      "word_count": 1359
    },
    {
      "scene_number": 19,
      "slugline": "EXT. EGUISAC MANOR - NIGHT 112   112  The manor on the edge of the village. News of the Armistice spreads like wildfire. Celebrating SOLDIERS pass by on a truck, SHOOTING in the air. People are SINGING from somewhere. Everyone is looking forward to peace. INT. EGUISAC MANOR / STUDY - NIGHT 113   113  General Friedrichs stands at the window, looking out at the celebrating soldiers. The sight is like a knife in his heart. Tiredly, he reaches in the pocket of his vest and takes out his pocket watch: It's the middle of the night. MAJOR VON BRIXDORF (O.S.) What will you do now? Major von Brixdorf stands behind Friedrichs with a message in his hand -- news of the Armistice has reached the German high command as well. The General silently goes to his map table. His dog lies by the warming fireplace. GENERAL FRIEDRICHS Have a look. What do you see? MAJOR VON BRIXDORF The plains of Latierre, Sir. Eguisac... GENERAL FRIEDRICHS You know what I see? I see our once glorious Army running away. He looks at the map. GENERAL FRIEDRICHS (CONT'D) In Latierre, the Frogs are farting in our foxholes. And over there is a train full of horse fuckers who want to betray our country. Friedrichs eyes his Major. GENERAL FRIEDRICHS (CONT'D) But we're German soldiers. And if there's one thing German soldiers are good at, it's fighting to the last man. Brixdorf eyes him in confusion. He's not sure what the General is trying to tell him.  (CONTINUED)  Goldenrod Revision 22.4.2021   82.",
      "characters": [],
      "action_text": "GENERAL FRIEDRICHS (CONT'D) Withdraw the recruits from all their positions and have them assemble in the yard. I will address them at dawn. We're gonna save the day. Friedrichs nods and reaches a decision. INT/EXT. EGUISAC / RESTAURANT ON VILLAGE SQUARE - DAWN 114   114  Early morning. Birds drink from the fountain on the village square. The embers of the fire fade. Drunk SOLDIERS sleep it off in the colonnade. A RADIO plays softly in a room amid the destruction, with the same message over and over. RADIO Firstly: Hostilities will cease at eleven a.m. today, November 11th, in all theaters. Secondly: Troops will not cross the lines held at that hour. These lines will be marked and recorded. The Army on the West Front will immediately begin to withdraw from occupied territory. Thirdly: Communication with the enemy remains prohibited-- Kat sits silently in the demolished restaurant, looking out at the fog. He looks tired, hasn't slept. Paul wakes up behind him. PAUL Kat... What time is it? Why aren't you sleeping? KAT Shh... Listen. Paul listens and hears: The birds SING. The leaves RUSTLE. A serene quiet in the village. KAT (CONT'D) It's so quiet I almost think I'm dead. He smiles. KAT (CONT'D) They signed it. The war's over. PAUL ...?  CONTINUED: 113   113 (CONTINUED)  Goldenrod Revision 22.4.2021   83. KAT We lost. It's finally over. Paul gapes at him. Kat gets up and pats the dirt off his pants. Then he marches off. KAT (CONT'D) I'm hungry. Are you hungry? PAUL Where are you going? KAT Come on, before the son of a bitch wakes up. I hear a KP volunteer! With that, he's gone. Paul hurries after him. EXT. VALLEY / FARM YARD - DAY 115   115  Kat and Paul cross a meadow in the valley. You can see their breath it the cold morning air. KAT What will you do for Christmas, Paul? PAUL I dunno. KAT I'm gonna fry a goose. With red cabbage and kraut. Then I'll light all the candles and kiss my wife. God, Paul, she's so beautiful. PAUL (laughs) Yeah? What does she look like? KAT",
      "dialogue_count": 0,
      "word_count": 1636
    },
    {
      "scene_number": 20,
      "slugline": "EXT. VALLEY / FARM YARD - DAY 123B   123B  Paul sits on the meadow by the woods, staring at the broken egg shells in his hands. Suddenly... BANG! A gunshot behind him makes Paul jump to his feet. PAUL Kat...? He runs into the woods. EXT. VALLEY / EDGE OF WODDS - DAY 123C   123C  Paul hunts for his buddy in the woods. Finally he finds him amid the trees, leaning on a stump. PAUL Kat... Kat? What happened? Kat turns around and limps back. KAT Nothing. Let's get out of here... Or we'll miss the end of the war. EXT. VALLEY WITH MANOR - DAY 123D   123D  He stubbornly limps out onto the meadow, but suddenly his legs buckle. Kat huddles on the ground, hanging his head. Paul looks at him, worried. PAUL Who fired that shot, Kat? KAT It's a mess. The little snot from the farm. He SIGHS. Finally, he pulls his shirt from his pants, feels his stomach wound. Paul helps him. PAUL It's alright. I'll have a look. Paul raises his uniform coat to look: Kat was hit in the liver. Not bigger than a fingernail, but dark blood oozes out. KAT How big is it?  (CONTINUED)  Goldenrod Revision 22.4.2021   89.",
      "characters": [],
      "action_text": "PAUL Little finger. I'll get the bullet out. KAT (shakes his head.) Let the medic do it. It's stuck too deep. Come on, give me a cigarette. Paul offers him a cigarette and lights it for him. Kat looks at the blood on his hands for a moment-- dark blood on cold fingers. The he looks up bravely. KAT (CONT'D) They stuck me in a class with seven- year-olds. I was already shaving. Find a word that rhymes with \"monkey\"... Nothing rhymes with monkey. Kat shakes his head. KAT (CONT'D) Fucking hell. Now of all times. PAUL Come on, we have to get back to camp. I'll help you. KAT Sure. Let's go. Kat struggles up. PAUL Are you okay, Kat? KAT Gotta be. PAUL It's not far. We can make it. Gasping, Paul takes him on his back and carries him off. PAUL (CONT'D) Kat? KAT Yes. PAUL Flunky. Flunky rhymes with monkey. KAT ...? Go hang yourself. Paul grins, and marches off down the valley with his buddy.  CONTINUED: 123D   123D  Goldenrod Revision 22.4.2021   90.",
      "dialogue_count": 0,
      "word_count": 384
    },
    {
      "scene_number": 21,
      "slugline": "EXT. EDGE OF WOODS BEI EGUISAC - DAY 124   124  Paul runs along the edge of the woods, sweating, carrying his injured buddy on his back. He breathes heavily, his face swollen with the effort of carrying Kat, the blood from Kat's wound drips from his hand. PAUL Kat, when we get back, you can fix my boots for me. My feet are bloody. Paul listens up and gapes: A row of trucks with reinforcements is arriving from the rear. Paul quickly puts down his buddy and tries to stop a truck. PAUL (CONT'D) Hey! Stop... Stop! The SOLDIERS just wave and cheer. Paul remains behind with Kat, who lies unconscious in the mud now. He takes a deep breath and gets a grip on himself, before hoisting his buddy on his shoulder again. PAUL (CONT'D) Kat, look. We're almost there... KAT (weakly) Mmh. PAUL I'll shoot myself in the foot so we can stick together. He carries Kat down the road, panting. EXT. EGUISAC / VILLAGE SQUARE - DAY 125   125  Bustle on the main square. RECRUITS jump off the trucks, chattering excitedly. Paul makes his way through the crowd, carrying Kat. INT. EGUISAC INFIRMARY - DAY 126   126  Paul hurries through the infirmary, finally reaches the OR .  It's deserted except for a grunt mopping the floor. PAUL Medic... Medic! No answer. He spots a vacant stretcher. He goes to his knees and lowers Kat gingerly. A MEDIC hurries up.  (CONTINUED)  Goldenrod Revision 22.4.2021   91.",
      "characters": [],
      "action_text": "Paul smiles. His hands and legs are quivering with exhaustion, but he made it --   Kat is saved.  He slowly catches his breath again. He gets up and takes out his canteen. He raises it to his lips, dying of thirst, but can't drink, he's trembling so much. MEDIC Well, that was a waste of effort. Paul eyes him, not understand. The medic points to Kat. MEDIC (CONT'D) He's dead. PAUL ...? It was just a flesh wound. MEDIC Sure. Black blood. Right in the liver. His organs are poisoned. Paul turns around to Kat. He breaks a sweat again and runs down his eyelids. He wipes the sweat away. Kat lies there, immobile. PAUL Unconscious. MEDIC (shakes his head) Uh-uh. Dead. I'm the expert. PAUL That can't be. I was just talking to him. He's just unconscious! Paul pulls his buddy's shirt upand examines the wound on his back... the blood has stopped oozing. He reaches for Kat's hands, his shoulders, his head... and suddenly he stops. Kat isn't moving. The medic WHISTLES through his teeth. MEDIC You see. Tough luck, right at the end. Paul GULPS. Stanislaus Katczinsky is dead... The church doors open behind him: A platoon of celebrating SOLDIERS charges in. They BELT OUT A SONG: The recruits' marching song from the beginning. SOLDIERS  Tomorrow we march To the farmers night quarters.  CONTINUED: 126   126 (MORE) (CONTINUED)  Goldenrod Revision 22.4.2021   92. A cup of tea, sugar and coffee, A cup of tea, sugar and coffee, and a glass of wine,   and a glass of wine!  Paul sits beside Kat on the ground and holds his hands. Finally, he takes out a matchbox, slides it open: It's empty. The beetle is gone. The Soldiers keep singing. SOLDIERS (CONT'D)  Darling I love you, but I can't marry you, just wait a year, then it'll come true; just wait a year, then it'll come true; and we'll be a pair. And we'll be a pair.  Paul sits beside Kat, silently. All his friends are dead. He's dead inside. Everything's dead. INT/EXT. EGUISAC / RESTAURANT ON VILLAGE SQUARE - DAY 127   127  Paul sits alone in",
      "dialogue_count": 0,
      "word_count": 1799
    },
    {
      "scene_number": 22,
      "slugline": "EXT. LATIERRE HILL / TRENCH - DAY 138   138  A FRENCH MAJOR, GRENIER (44) is taking a piss on the latrine and talking to a fellow soldier, also on the latrine. MAJOR GRENIER  Va chercher Bernard et Dubois quand tu as fini de chier. Ils collectionnent les médailles dehors.  SERGEANT  Bernard et Dubois sont morts, monsieur.  MAJOR GRENIER  ...? Quand?  SERGEANT  La semaine dernière. Lambert et Fournier sont dehors.  MAJOR GRENIER  Alors, va les chercher.  Grinning, Grenier buttons up his fly, heads along the trench, nodding to a SOLDIER here and there until encountering a Corporal: MOREAU (31). MAJOR GRENIER (CONT'D)  Moreau. Ça va?  MOREAU  Ça va bien, Ms. le majeur.  MAJOR GRENIER  Vingt minutes, eh?  They go their way, when something occurs to Grenier. He turns back and calls Moreau back to him. MAJOR GRENIER (CONT'D)  Moreau? Venez. J'ai quelque chose à vous montrer  MOREAU  Quoi?  MAJOR GRENIER  Surprise.  Moreau returns and accompanies him to a shelter. MAJOR GRENIER (CONT'D)  Attendez.  Grenier disappears inside the shelter, comes back a moment later, carrying a bottle of Cognac. He cradles it reverently.  (CONTINUED)  Goldenrod Revision 22.4.2021   98.",
      "characters": [],
      "action_text": "MAJOR GRENIER (CONT'D)  Ç'était à Lefevre. Cet imbécile gardait pour la fin. Il n'en aura plus besoin.  He opens the bottle and sniffs it, then pours. They drink to each other. MAJOR GRENIER (CONT'D)  Merde, ç'est bon. La fin du cauchemar.  Grenier nods and heads off, with a last greeting to Moreau. MAJOR GRENIER (CONT'D)  Y a plus qu'à survivre, Moreau!  He reaches the next SOLDIERS, who hold tin cups out to him. Grenier pours them cognac. MAJOR GRENIER (CONT'D)  Beau travail, soldat.  He goes on, laughing. EXT. LATIERRE HILL / EMPLACEMENTS - DAY 139   139  Next to Paul, a YOUNG SOLDIER checks his watch, trembling... a little photo of his parents in the lid. Paul stares out at the battlefield. PAUL What time is it? YOUNG SOLDIER Fifteen more minutes. Up front, the MP raises his hand --   Ready to attack. Forward march!   He wordlessly gets down off his horse, as the soldiers march on down the hill. The sound of FOOTSTEPS and boots in the mud, canteens JANGLE on belts. It's eerily quiet otherwise... The fog swallows every sound. EXT. LATIERRE HILL / TRENCH - DAY 140   140  In the French positions, the SOLDIERS start to relax. Here and there, there's still a few MGs mounted on the edge of the craters. Sand bags are piled up in the gaps of the trench. The soldiers mingle in groups, exchanging stories and cigarettes, laughing and joking, peace just minutes away. Grenier is rolling a cigarette when he passes a squad playing cards.  CONTINUED: 138   138 (CONTINUED)  Goldenrod Revision 22.4.2021   99. CARD PLAYER  Majeur, soyez pas si avare.   Nous avons soif, nous aussi!  MAJOR GRENIER  C'est le meilleur cognac de votre vie.  Grenier fills their cups, emptying the bottle. MAJOR GRENIER (CONT'D)  Je vais chercher un autre.  He tosses the bottle out on to No Man's Land. TRACKING SHOT out onto the battlefield, where LAMBERT and FOURNIER are picking up dead comrades' dog tags. Grenier shouts into the fog. MAJOR GRENIER (O.S.) (CONT'D)  Lambert. Fournier! Vous voulez quelque ",
      "dialogue_count": 0,
      "word_count": 942
    },
    {
      "scene_number": 23,
      "slugline": "EXT. LATIERRE HILL / HINTERLAND - DAY 145   145  The MG salvos carve through the ranks. Men fall left and right, but Paul is in a tunnel. It's all about survival now, as he runs on and on, his legs aching... The muddy craters are hard to climb. The soldiers keep slipping in the mud, sliding back and starting over. RAT TAT TAT TAT TAT. Fifty yards. The Lieutenant barks an order. LIEUTENANT Ready grenades! The MEN take cover behind a dirt berm. Paul ducks behind a dead horse, whipped by bullets. A few feet on, a soldier stands up to throw, but get shot and then torn apart by his own grenade exploding. Paul ducks in time. A French grenade lands beside him. He grabs it and tosses it back, taking out an MG nest. BOOM! EXT. LATIERRE / FRENCH TRENCH - DAY 146   146  Grenier ducks in the trench, while the MG nest and its SOLDIERS are blown sky-high behind him. MAJOR GRENIER  Chargez!  The flattened trench hardly offers cover to the FRENCH, so they jump out and engage hand to hand. EXT. LATIERRE / HINTERLAND - DAY 147   147  Behind the dead horse, Paul SHOOTS at the attacking FRENCHMEN, but a few steps later, they appear before them. The SOLDIERS are now fighting hand to hand. Steel on steel. Bayonets hit shattered bone. Into the melee, the apocalypse. Men with breathtaking injuries. Next to Paul, a FELLOW SOLDIER falls in a crater with a FRENCHMAN, while the next one gets his face slashed by a bayonet. Paul struggles forward angrily, stabs an enemy, before he is knocked to the ground by a CORPORAL. Paul loses his rifle in the struggle. He reaches for his helmet and hits his enemy in the face with it until he stops moving.  (CONTINUED)  Goldenrod Revision 22.4.2021   102.",
      "characters": [],
      "action_text": "Paul can barely catch his breath when a FRENCHMAN SHOOTS several GERMAN SOLDIERS at close range. He quickly crawls over to his rifle, while the MARKSMAN takes aim at him. BANG. A RICOCHET hits the Frenchman in the hip. He falls on his behind, dazed, but before he can take aim again, the Paul hits him with a fatal shot. Paul crawls toward the trench. Suddenly, a VOICE in the chaos, SCREAMING. WALTER (O.S.) No! Paul stands over the trench, looks around in all directions. Young Walter hits the ground beneath him. A Frenchman raises his bayonet and wants to stab him, but Paul shoots him in the back. The next ENEMY appears and wants to attack Walter. Paul is out of ammo and jumps down with a SAVAGE SCREAM -- EXT. LATIERRE HILL / TRENCH - DAY 148   148  WHAM. The man rams Paul's back against the wall. Paul gasps for a moment, breathless, but neither man relents. They tumble across the trench, wrestling, till Paul gets him in a headlock from behind. The man drops his rifle, grabs Paul's arm with both hands to free himself from his grasp. Paul throws his gun away and starts to strangle him... They wrestle. Elbow and knee each other. Tug, choke and punch. A battle of blood and chaos in the mud. The man is strong, tries to hurl Paul over his shoulder, finally manages to trip him up. The two men lose their balance and fall in the mud. The Frenchman lands atop Paul in a puddle at the bottom of the trench. Gasping, he tries to drown him in the mud, presses his fingers in his eyes and mouth. Paul can hardly breathe, almost downing in the puddle. Finally he gets his hand on a rock and HITS the Frenchman on the head. WHAM. Paul takes a moment to catch his breath, then the Frenchman reaches for the pistol in the hand of a dead soldier, half buried in the mud. Paul attacks him with all his might. He SCREAMS and rams his head in the Frenchman's stomach, they both plunge into a bunker head-first.  CONTINUED: 147   147  Goldenrod Revision 22.4.2021   103.",
      "dialogue_count": 0,
      "word_count": 670
    },
    {
      "scene_number": 24,
      "slugline": "INT. LATIERRE HILL / BUNKER - DAY 149   149  Paul lands hard on the ground and immediately struggles up again. Suddenly, he finds himself face to faces with his enemy for the first time. Both men gasp for breath. They look at each other for a moment, both ashamed of what they're doing. Then a very young FRENCHMAN (16) charges out of the shadows and rams his bayonet in Paul's back. WHAM. And again. Paul stares down at his chest, incredulous, where the blade sticks out. The Frenchman pulls the bayonet out again. Paul sinks to his knees. A distant WHISTLE from outside... A last look at his opponent, then the Frenchmen turn away and disappear. Paul is alone now. He staggers down the stairs with an effort into the trench. EXT. LATIERRE HILL / TRENCH - DAY 150   150  Along the front, Officers pass on the cease fire order. WHISTLES across the battlefield. A FRENCH BUGLER plays a tune. MAJOR VON BRIXDORF Cease fire. Cease fire! It's eleven o'clock. MAJOR GRENIER  Cêsse-feu! Cêsse-feu!  The gunfire instantly stops. An eerie silence. Paul looks up and listens to the silence. He looks at the sky, where the fog wafts by. It's all so bright and white. Finally, he sinks to the ground, drained of energy. Blood gushes out of his wound. He wears Franz's scarf. Paul looks down at it. He slowly opens the knot, to hold it in his hand. His lungs fill with air for one last time. The life slowly drains from his gaze and he just keels over lifelessly. The remains of a front theater poster from last year hang on a shattered wall... a pretty girl in a white dress. INT. MANOR / STUDY - DAY 151   151  DONG. DONG. DONG. Back at HQ, the big grandfather clock strikes eleven. General Friedrichs sits at the table, stonily, his elbows on his knees.  (CONTINUED)  Goldenrod Revision 22.4.2021   104.",
      "characters": [],
      "action_text": "The clock stops striking. It's quiet here now, too. Only the TICK-TOCK of the pendulum. The ashtray on the table with a burnt-out cigarette. The maps. A Bible... General Friedrichs lets his head hang. It's over. EXT. LATIERRE / TRENCH - DAY 152   152  On the silent battlefield, the dead lie in the mud all along the hilltop. Soldiers crawl from the craters and stagger off, homeward bound. Major Grenier helps a soldier up on his feet and staggers off with him. EXT. LATIERRE / TRENCH - DAY 153   153  Major von Brixdorf marches along the destroyed trench and picks his way past the corpses. He stops stops before a young man, who's sitting in the dirt, exhausted: Walter. He survived. MAJOR VON BRIXDORF Are you alright, Soldier? WALTER ... Yes, Sir. MAJOR VON BRIXDOR Collect the dog tags, please. The tired Major holds a bag of dog tags out to Walter, who takes them. He weighs them in his hand and looks inside... heavy. The tin rattles in the bag. Walter finally gets up and heads down the trench, bending down to the dead, deadpan, taking their dog tags and putting them in the bag. A soldier sits on the ground, leaning on the trench wall. Walter lifts his head and gapes: It's Paul Bäumer. High school student. 19 years old. His expression is composed, almost serene. He could almost be asleep. But he's dead. Walter kneels down to him and takes his dog tag. He seems to hesitate for a moment. Then he takes the scarf from Paul's hand, ties it around his own neck, and keeps going. He makes his way down the trench. He will always wear the scarf from now on.  CONTINUED: 151   151 (CONTINUED)  Goldenrod Revision 22.4.2021   105. FADE TO BLACK. THE END.  CONTINUED: 153   153  Goldenrod Revision 22.4.2021   106.",
      "dialogue_count": 0,
      "word_count": 628
    }
  ]
}