{
  "slug": "american-hustle-2013",
  "title": "american hustle",
  "genre": "drama",
  "format": "film",
  "scenes_count": 20,
  "characters_count": 2,
  "characters": [
    "SYDNEY PROSSER",
    "IRVING ROSENFELD"
  ],
  "total_words": 30229,
  "total_dialogue": 2,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. PLAZA HOTEL LIVING ROOM - CONTINUOUS 6   6  DRAMATIC PUSH IN ON: THE DESTINY OF THE STORY MAYOR CARMINE  POLITO PINKY RING, ROTARY CLUB PIN STANDS FINISHING STORY TO  BUSINESSMAN CARL ELWAY AS IRVING, EDITH, RICHIE WAIT FOR HIM  TO FINISH -- THEY ALL SHAKE HANDS AND SIT ON THE COUCH ACROSS  FROM EACH OTHER. RICHIE CAREFULLY SETS THE BRIEFCASE DOWN ON  THE GROUND NEXT TO HIS FEET. CUT TO THE SCENE AS VIEWED  THROUGH A SURVEILLANCE MONITOR. THE DATE AND TIME STAMP  VISIBLE.  CARMINE POLITO  I thought he was going to be here.  I do business face to face, person  to person. That’s just who I am.  Richie reaches down and awkwardly slides the briefcase over  to Carmine unprompted. LEAVE MONITOR’S POV AND RETURN BACK TO  THE SCENE.  IRV’S EYES WIDEN AS IN ‘NO! DON’T DO THAT!’ WHILE HE AND  RICHIE STARE AT EACH OTHER, EDITH TENSE, CARMINE LOOKS  DISTURBED AT THE CASE COMING HIS WAY. HE STANDS ABRUPTLY.  CARL ELWAY  Whoa, excuse me, excuse me. I'll  handle that for the Mayor.  RICHIE DIMASO  No, it’s for the Mayor. It would be  a sign of disrespect to the sheik  if the mayor didn’t take it  himself. It’s for you Mayor.  Carmine looks angry and confused. He looks over to Carl.  CARMINE POLITO  What are you doing? What-- (to  Carl) Carl, what the fuck? What is  this?  CARL ELWAY  No, I'll handle it. I'm gonna take  care of--   Everything's good.   I  got everything under control. (TO  RICHIE) That's for me. I handle all  that for mayor.  CARMINE POLITO  What is this?  Irving looks over and says nothing. Not surprised at all how  badly this is all going.  5.",
      "characters": [
        "SYDNEY PROSSER"
      ],
      "action_text": "Edith whispers to Richie.  EDITH GREENSLY  (whispers to Richie)  Just stop it, ok  RICHIE DIMASO  (whispers to Edith)  He's gotta take it himself, okay?  CARMINE POLITO  I don’t know what the fuck that is  but it’s weird you understand?  CARL ELWAY  Misunderstanding. Misunderstanding.  CARMINE POLITO  I came here to meet a sheik, that’s  all I know. I’m very interested in  that but he’s not here apparently.  Carl?!  Carmine turns and starts to walk out of the room.  CARMINE POLITO (CONT’D)  I’m very interested in meeting the  Sheik. You let me know when THAT  could happen! Thank you, have a  good day.  Carmine leaves the room.  Irving looks over and shrugs his shoulders. Not surprised at  all the way this is going and horrified that Richie has  ruined it.  CARL ELWAY  (leaving)  Irving! You better come get him.  RICHIE DIMASO  (stares at Irv)  Go out there and get him right now.  CARL ELWAY  Help me get him back!  RICHIE DIMASO  Go get him.   He needs to take the  fuckin' briefcase, Irving.  6. IRVING ROSENFELD  I didn’t wanna do it in the first  place. This is your show, YOU go  get him.  RICHIE DIMASO  No, you have no choice.   You have  to go get him.   Now, go get him, so  he takes the briefcase by himself!  That's the whole plan, Irving!  Irving stands up angry and gets in Richie’s face.  IRVING ROSENFELD  What were you doing pushing the  fucking briefcase, dummy? Huh?  RICHIE DIMASO  The whole fuckin' thing was falling  apart.   You know how much I paid  for this goddamn hotel that you  fucking asked for?!  IRVING ROSENFELD  Now I gotta go mop up your mess.  I'm gonna go fucking mop up your  mess!  Irving storms out of the hotel suite towards the Elevators to  get Carmine.  INT. PLAZA HOTEL SUITE FOYER - DAY  Irving paces back and forth as he waits for the elevator.  INT. PLAZA HOTEL LIVING ROOM - CONTINUOUS  We push in on the concerned face of Sydney as Richie rambles  on to her.  RICHIE DIMASO  You understand what I'm saying,  right? It wasn't working.  INT.",
      "dialogue_count": 1,
      "word_count": 3238
    },
    {
      "scene_number": 2,
      "slugline": "INT. BUSINESSMAN OFFICE - DAY  Irving and Edith discuss a piece of art they’re in the  process of selling to a businessman.  IRVING ROSENFELD (V.O.)  We kept selling art together, too.  EDITH GREENSLY  It's really a fabulous example of a  genre painting, which is really  rare for the time. It's a boy and  his dog.   Non-religious painting.  55. Golden age. Dutch painting.  ANOTHER DAY -- A CAR DEALERSHIP OFFICE -- IRV DROPS THE  CANVAS BAG REVEALING A VINTAGE PAINTING -- (COLORED ORBS AND  LINES) -- TO THE MIDDLE AGED CAR DEALER WHO OWNS THE  WAREHOUSE WHO WRITES A CHECK.  IRVING ROSENFELD  Paul Klee. Bauhaus Movement. 1920s.  MIDDLE AGED CAR DEALER  Before we go any further, is this  legit?  IRVING ROSENFELD  Let’s just say it’s missing from  Spain and leave it at that.  EDITH GREENSLY  Don’t show any Spanish friends.  Irving and Sydney kiss passionately in front of the middle  aged car dealer as he tries to hand them his check.  IRVING ROSENFELD (V.O.)  I mean it just took off. We got an  elegant Manhattan office. We called  it London Associates for her  accent.  INT. NEW OFFICE LOBBY - MADISON AVENUE - DAY 44   44  A JANITOR FINISHES POLISHING SILVER PLATED LARGE LETTERS:  LONDON ASSOCIATES to a pale wall as he and Edith sip  champagne from flutes and offer one to the worker who toasts  with them.  21.",
      "characters": [
        "IRVING ROSENFELD"
      ],
      "action_text": "IRV DOES HIS TRADEMARK MINIMALIST BADGER DANCE, IN PROFILE,  TO QUIET DELIGHT OF SYDNEY.  Irv and Edith kiss gently, lovingly, sincerely on the lips --  They walk into their CLASSIC LOOKING, STAID, PRIVATE BANKING  OFFICE SUITE.  IRVING ROSENFELD   (V.O.)  When I was around her I felt joy.  Fucking joy! And love. That’s what  I felt.  SMASH TO:  EXT. PARK AVENUE - SUNNY DAY 46   46  They dance down Park Avenue together. 47   47  INT. LOBBY OF PIERRE HOTEL - CONTINUOUS  Irv and Edith dance through the lobby.  THE PIERRE HOTEL CAFE 49   49  As they dance among mostly older wealthy couples on the small  dance floor of the elegant restaurant as a live jazz quartet  plays “I’ve Got Your Number”. Camera circles them, putting  their foreheads together, very happy.   THEY SING TO EACH  OTHER quietly as they dance close.  INT. ROOM AT PIERRE HOTEL -- NIGHT 50   50  Irv and Edith make passionate love, we see in pieces --  He gets up, she watches him dress and leave --  INT. IRV’S CADILLAC - NIGHT 52   52  He drives over the Triborough Bridge. 53   53  IRVING ROSENFELD (V.O.)  As, as far as I could see, people  were always conning each other to  get what they wanted. We even con  ourselves.  22. INT./EXT. IRV’S CADILLAC - NIGHT 54   54  He drives through the suburb of ranch houses and driveways 55   55  and pulls into his driveway of his split-level ranch. Irv 56   56  gets out of his Cadillac and walks to the front door of his  house --  IRVING ROSENFELD (V.O.)  We talk ourselves into things. We  sell ourselves things we maybe  don't even need or want by dressing  them up. We leave out the risk. We  leave out the ugly truth.  INT. IRV’S HOUSE - NIGHT 57   57  Irv walks into the decorated ranch house, frosted glass with  bird designs, glass tables, walls, black and brown lacquer  everywhere. He walks into the house and looks at a picture  his son did -- a drawing of the Yankees playing baseball --  that is taped to the refrigerator.  IRVING ROSENFELD (V.O.)  Pay attention to t",
      "dialogue_count": 1,
      "word_count": 4470
    },
    {
      "scene_number": 3,
      "slugline": "INT. ART MUSEUM - NEXT ROOM - CONTINUOUS  Irving, Edith, Richie, and the fake Sheik admire a REMBRANDT  painting on the wall.  IRVING ROSENFELD  I want to show you something. This  Rembrandt here? People come from  all over the world to see this.  RICHIE DIMASO  Yeah, he's good.  IRVING ROSENFELD  It’s a fake.  RICHIE DIMASO  Wait, what’re you talking about?  That's impossible.  IRVING ROSENFELD  People believe what they want to  believe. Cause the guy who made  this was so good that it’s real to  everybody. Now whose the master --  the painter or the forger?  Richie’s continues to stare at the REMBRANDT on the wall.  RICHIE DIMASO  That’s a fake?  IRVING ROSENFELD  That’s the way the world works. Not  black and white as you say.  Extremely grey.  ELWAY’S ACQUAINTANCE walks up to Irving and the group and  steps into the conversation.  ELWAY’S ACQUAINTANCE  Irving can I --  IRVING ROSENFELD  How many times I gotta tell you.  You can’t meet the sheik, alright?  Edith sees this and steps into the conversation.  EDITH GREENSLY  Arthur? Hi. Edith. We’ve met  before.  41.",
      "characters": [],
      "action_text": "EDITH GREENSLY (CONT’D)  I wanted to introduce you to Robert  Spencer. We’re advising the Sheik  together.  She looks at Richie. Richie offers his hand.  RICHIE DIMASO  (catching up)  Yeah, I’m Robert Spencer, advisor  to the sheik.  EXT. CHELSEA HOTEL -- ESTABLISHING - DAY 70A   70A  INT. OFFICE OF CARL ELWAY - SUCCESSFUL, BUT SHADY - DAY 71   71  CARL ELWAY, 40, preppie Waspy, very old fashioned with  cigarette holder, but something vaguely criminal about him,  in his conservative suit, natty white and red striped shirt,  and navy blue tie sits with Irving.  CARL ELWAY  What’s this I hear about a god damn  Sheik?!   Why you leaving me out of  this? I gotta hear about it from my  friends?  IRVING ROSENFELD  It ain’t for you Carl.  CARL ELWAY  What do you mean it ain’t for me?  We gotta do certificates of  deposit. I can print as many as you  need.  IRVING ROSENFELD  This is not a one man operation.  CARL ELWAY  Look, I can get other guys. What  are you talking about Irving?  IRVING ROSENFELD  You’re telling me that you can get  four guys to sell fake certificates  of deposit to my investor within a  week?  The camera zooms into Irving’s shirt collar revealing a tiny  microphone.  42. CARL ELWAY  Yes I can make that happen. Carl  Elway can do what he says he’s  going to do.  IRVING ROSENFELD  That’s interesting but you know  I’ve got other guys lined up. I’ve  got a meeting with my associates.  SUDDENLY CARL ELWAY’S ASSISTANT, OPENS THE DOOR AND ENTERS.  Richie Dimaso and Edith ARE STANDING THERE -- MUCH TO IRV’S  DISMAY.  CARL ELWAY’S ASSISTANT  Carl, his associates are here. He’s  got a meeting he’s got to go to.  CARL ELWAY  No wait. Don’t go anywhere.  IRVING ROSENFELD  I’ve got to go.  Irving gets up to walk out as Richie and Edith stand in the  doorway.  IRVING ROSENFELD (V.O.)  Crazy thing about people -- the  more you say no, the more they want  in on somethin. It is so stupid.  Irving looks over at Richie and Edith.  IRVING ROSENFELD  I’ll tell them, don’t ",
      "dialogue_count": 0,
      "word_count": 1022
    },
    {
      "scene_number": 4,
      "slugline": "INT. CAMDEN CITY HALL - W.P.A. MURAL ROOM - DAY 78   78  CARMINE POLITO  (giving speech)  The W.P.A. employed craftsmen to  paint this during the Depression.  Why can't we employ people today to  do work like this in rebuilding  Atlantic City?  RICHIE DIMASO (V.O.)  He worked with all the unions. He  was the leader of the State  Assembly. And he had just gotten  gambling legalized in New Jersey to  create jobs.  -- FLOOR OF STATE ASSEMBLY -- Carmine   huddles with other 80   80  STATE LEGISLATORS, horsetrading and then poses for a picture  with other members of the State Assembly.  RICHIE DIMASO (V.O.)  But he couldn’t get the funds to  rebuild Atlantic City and   that   was  his problem. So with our help, he  was about to have his hand in the  wrong pocket at the wrong time.  And to me that meant corrupt  BACK TO: 81   81  STODDARD THORSEN  You said grifters and con artists.  We're not going after some  politician. This is a bad idea,  Richard.  RICHIE DIMASO  Shhhh. Look, it's really simple.  All you need is to put two million  in a Chase account --  STODDARD THORSEN  What?!  RICHIE DIMASO (CONT’D)  -- under the Sheik’s name --  STODDARD THORSEN  Whose two million?!  46.",
      "characters": [],
      "action_text": "RICHIE DIMASO  Shh, just listen.   Two million  dollars under the Sheik's name, in  a Chase account that we control.  Carmine calls up on the telephone --  calls the bank -- and he sees that  the Sheik is real and he has a real  account.   Five days.  STODDARD THORSEN  I'm not taking two million dollars  of the taxpayers' money and putting  it anywhere for five days, I don't  care if we control it the whole  time.  Richie as he stares at Stoddard in frustration.  RICHIE DIMASO  Stoddard, let us do what we need to  do to rule out corruption and to  get rid of the payoff guys that are  ruining this country. That's my  dream. Don't smother it, please.  STODDARD THORSEN  You know Richard, I understand your  eagerness. I really do. You know  I'm from Michigan, right? Let me  tell you a story about me, and my  dad, and my brother. We used to go  ice fishing every November. Ice  Fishing. That’s what we lived for.  RICHIE DIMASO  Holy shit --  STODDARD THORSEN  Just listen to me.   It's beautiful.  You have a little stove. You huddle  around, you keep each other warm.  You drop a line and you just wait.  One year my brother says, “let's go  in October.\"   He wants to go ice  fishing in October. My dad says,  \"No, the ice is too thin.\"   My  brother says -- I love my brother  he says --  47. RICHIE DIMASO  I understand what's happening.  You're saying your brother went out  on the ice, the ice was too thin,  he fell through the ice, he went in  the water because he was too eager,  and you're saying I'm too eager --  that's what you're saying?  STODDARD THORSEN  No, that’s not what I’m saying.  RICHIE DIMASO  What are you saying?  STODDARD THORSEN  We’ll finish the ice fishing story  another time, young man. For now,  no Carmine Polito. Go do your job.  Richie looks at him annoyed and upset.  RICHIE DIMASO (V.O.)  Stoddard shot the whole thing down.  RICHIE DIMASO  Boring.  RICHIE DIMASO (V.O.) (CONT’D)  But Edith was a genius.  SEE B-ROLL OF: Edith and Richie walk back into ",
      "dialogue_count": 0,
      "word_count": 3373
    },
    {
      "scene_number": 5,
      "slugline": "INT. TABLE AT BARON’S ITALIAN RESTAURANT - CAMDEN - NIGHT 99   99  Ella continues. Mixture of LOCALS: ITALIANS, POLISH, BLACKS  AND PUERTO RICANS -- wave to the mayor from the bar, and  tables, as Irv and Rosalyn follow.  THEY SIT AT BOOTH -- 100   100  CARMINE POLITO  Rocco, you know like we do. The  chicken very thin. You should see  the way he does this chicken with  the red sauce  DOLLY POLITO  It’s beautiful.  CARMINE POLITO  Right?   With the red sauce, the  lemon--  Dolly kisses Carmine as he gives his wife’s leg a squeeze and  kisses her cheek, then her mouth.  Irv and Rosalyn squeeze hands on the table. SHE KNOCKS BACK A  GLASS OF RED WINE as a plate of Chicken Picatta is served to  the table.  DOLLY POLITO  It’s the Piccata of the gods!  She pulls away awkwardly, waiter refills her glass which she  throws back right away. Irv looks concerned.  They all drink.  CUT TO - LATER: Carmine and Irving talk. 101   101  IRVING ROSENFELD  I believe that you should treat  people the way that you want to be  treated.  CARMINE POLITO  Right.  IRVING ROSENFELD  Didn't Jesus say that or something?  CARMINE POLITO  He may have.  63.",
      "characters": [],
      "action_text": "IRVING ROSENFELD  Also, always take a favor over  money.   I think Jesus said that as  well.  CARMINE POLITO  (laughing)  I don't know if he said the second  one but he may have said the first  one.  CUT TO -- Rosalyn DRUNKENLY LEANS IN TALKING TO Dolly POLITO  ROSALYN ROSENFELD  (shows her nails)  I chip them moving furniture, it’s  my obsession -- Moving, re-  decorating, it makes me feel better  like exercise. There’s this top  coat that you can only get from  Switzerland and I don’t know what  I’m going to do because I’m running  out of it but I LOVE the smell of  it.  DOLLY POLITO  I can get that for you, of course.  ROSALYN ROSENFELD  There’s something, the topcoat,  (sniffs nails) it's like perfumey  but there's also something rotten?  I know that sounds crazy, but I  can't get enough of it.  Dolly laughs.  ROSALYN ROSENFELD (CONT’D)  No, smell it.   It's true. Dolly,  historically the best perfumes in  the world, they're all laced with  something nasty and foul. It’s  true!  She puts it under Irv’s nose as he talks to Carmine, he  sniffs, closes his eyes, nods without even looking.  ROSALYN ROSENFELD (CONT’D)  Irving loves them. He can’t get  enough of them.  IRVING ROSENFELD  I can’t get enough.  64. ROSALYN ROSENFELD  (hand out to Carmine)  Carmine, sweet and sour. Rotten and  delicious.  She leans across the table and puts them under Carmine’s  nose.  CARMINE POLITO  Smells like flowers.  ROSALYN ROSENFELD  Flowers, but with garbage.  CARMINE POLITO  You know what that is for me? It's  coriander for me.  ROSALYN ROSENFELD  Irving loves it. He can’t get  enough. That’s what hooks you. He  always comes back for it.  IRVING ROSENFELD  I can’t stop.  ROSALYN ROSENFELD  (confidentially to Dolly)  He’s gonna say we have to talk  business in five, four, three, two,  one --  IRVING ROSENFELD  (to girls)  Dolly, can me and the mayor talk  business here?  ROSALYN ROSENFELD  (falling off her seat)  AHH-HA-HAHAAAAAAAAHHHHH!  Carmine and Dolly rush to grab Rosalyn; JU",
      "dialogue_count": 0,
      "word_count": 594
    },
    {
      "scene_number": 6,
      "slugline": "EXT. WEST 54TH STREET - NIGHT 102   102  Todd Rundgren’s “I Saw the Light” plays somewhere. Edith  dressed in tight Halston dress, hair flows huge all round  her; walks with Richie, who is waiting in a white gray suit  with a white disco collar outside the lapel, chains around  his neck.  EDITH GREENSLY  Didn’t your fiance want to come out  tonight?  RICHIE DIMASO  Yeah, no, I don’t know.  EDITH GREENSLY  I’m sorry, we don’t have to talk  about it. I was just teasing you.  RICHIE DIMASO  Do you ever think, how did I end up  here? How did my life become this?  You ever think that?   And you  wonder, am I ever gonna get to a  better place or is this it? You  ever feel like that?  Edith stares, nods yes.  EDITH GREENSLY  I do. I definitely know that.  Edith nods puts a hand on his face.  EDITH GREENSLY (CONT’D)  I’m sorry we don’t have to go  dancing. We can go have coffee or  talk or something.  RICHIE DIMASO  No, I need this. Please, I need to  go dancing with you.  Richie reaches down and squeezes her hand.  RICHIE DIMASO (CONT’D)  Please.  Edith smiles. 103   103  EDITH GREENSLY  OK baby, let’s go dancing.  INT. DISCO - NIGHT  66.",
      "characters": [],
      "action_text": "Richie and Edith DANCE AND DANCE AND SWEAT to Donna Summer’s  “I Feel Love” -- dance -- riding a high.  Edith EXCUSES HERSELF to go to bathroom -- breaks away  through crowd -- leaves Richie on dance floor -- then  SUDDENLY BREAKS AWAY -- RUSHES THROUGH THE CROWD --  GETS TO THE LADIES ROOM JUST AS SYDNEY DOES -- HE PUSHES HER 104   104  FROM BEHIND INTO A STALL -- SHE PUTS HER HANDS ON THE TOP OF  THE STALL WALL AS RICHIE RUNS HIS HANDS UP HER LEGS FROM HER  ANKLES AND UNDER HER DRESS - SHE LEANS HER ASS BACK INTO IT  ARCHES HER BACK --  SUDDENLY RICHIE STOPS, throws himself back against the other  stall wall, out of breath.   Edith LOOKS OVER HER SHOULDER --  RICHIE DIMASO  I really fucking like you.  EDITH GREENSLY  I like you too. I want to live,  alright. For real. No more fake  shit. Alright?  She get’s real close to his face, almost about to kiss.  EDITH GREENSLY (CONT’D)  We’re going to wait until we decide  to go for love Richie. For real.  That’s when we fuck. Not till then,  ok?  RICHIE DIMASO  OK.  GIRL OUTSIDE STALL (O.S.)  Are you gonna fuck for real or get  out of the stall for real?  EDITH GREENSLY  No more fake shit.  RICHIE DIMASO  No more fake shit.  EDITH GREENSLY  No more fake shit!  GIRL OUTSIDE STALL  Fuck me I gotta piss!  The girl outside the stall bangs on the door.  67. She holds his mouth in one hand and leans in and kisses him -  they get lost --  EDITH GREENSLY  Get out!  SHE SHOVES HIM OUT OF THE STALL, LOCKS IT.  RICHIE DIMASO  (outside stall)  I want to be fucking real!  RICHIE LAUGHS MANICALLY EXCITED AS HE STANDS AMID MANY WOMEN  WHO SHOVE HIM OUT THE DOOR. IN THE STALL SYD SITS  EXHILARANTLY AND THROWS HER HEAD BACK LAUGHING HYSTERICALLY -  GIDDY.  EDITH GREENSLY  AHHHHHHH!  SMASH TO:  INT. BARON’S BACK ROOM - CAMDEN SOCIAL CLUB - NIGHT 105   105  Irv and Carmine JOYOUSLY SING Tom Jones’ \"Delilah\" WITH a  RAUNCHOUSLY HAPPY GROUP OF locals.  SMASH TO:  INT. BARON’S BACK ROOM- CAMDEN SOCIAL CLUB - NIGHT - LATER  Carmine puts down gl",
      "dialogue_count": 0,
      "word_count": 2454
    },
    {
      "scene_number": 7,
      "slugline": "EXT. TETERBORO AIRPORT TARMAC - DAY 115   115  ELO’s “10538 Overture” kicks on. Irv and Richie exit the  plane walking slightly behind the “sheik” and his  “bodyguards” - the sheik in the front.  The Sheik hands the ceremonial knife to Carmine and bows his  head --  CARMINE POLITO  Hello Sheik, my friend. Welcome.  On behalf of the great state of New  Jersey I want to welcome you to New  Jersey. I know that was redundant.  I'm sorry. I'm just very nervous.  Carmine takes the knife and looks to the others excitedly. 116   116  CARMINE POLITO (CONT’D)  (to “shiek”)  We have a great party planned for  you this evening.  INT. IRV AND ROSALYN’S HOUSE - NIGHT 118   118  ROSALYN ROSENFELD  (half dressed)  But what are you talking about, I  can't go? I just did my hair and  makeup and everything!  IRVING ROSENFELD  The Sheik's very particular. It's  international cultural protocol.  ROSALYN ROSENFELD  International protocol? What the  fuck are you talking about?  PHONE RINGS --  IRVING ROSENFELD  Do not answer that!  ROSALYN ROSENFELD  (answers phone)  Hello -- Robert Spencer? I don't  know a Robert Spencer. What do you  want?  IRVING ROSENFELD  (takes phone)  Give it to me.  79.",
      "characters": [],
      "action_text": "ROSALYN ROSENFELD  Who is that?  IRVING ROSENFELD  (into the phone)  Look, I told you, for God's sake, I  told you not to call here.  ROSALYN ROSENFELD  What is that about?  RICHIE DIMASO  (on phone)  Two more federal agents tonight,  OK?  Ros leaves the room.  IRVING ROSENFELD  No way.  RICHIE DIMASO  Yes. They're bodyguards for the  Sheik.  IRVING ROSENFELD  That’s too many people for me to  control, no.  RICHIE DIMASO  Look.   I'm in charge here, alright?  Just do it.  IRVING ROSENFELD  Rosalyn, get off the extension!  PAN TO:  REVEAL ROSALYN IN KITCHEN LISTENING ON THE PHONE.  ROSALYN ROSENFELD  (hangs up)  I’m not on it!  But she was on it. She heard.  IRVING ROSENFELD  Look, don't call here again,  alright?   Don't call at home.  RICHIE DIMASO  Alright?  80. IRVING ROSENFELD  OK.  RICHIE DIMASO  Good night.  He HANGS UP and walks into the kitchen. Rosalyn looks at him.  ROSALYN ROSENFELD  Federal agents?  IRVING ROSENFELD  It's bodyguards for the visiting  dignitary, that's all.  ROSALYN ROSENFELD  What is it, an I.R.S. thing?   Like  a tax investigation?  IRVING ROSENFELD  Why you gotta say that?   I mean,  that's why I can't invite you.  It's too complicated.   Listen, come  on.  ROSALYN ROSENFELD  Are you in trouble?  IRVING ROSENFELD  Look, stop being so nosy.  Irving opens the fridge which is a mess.  IRVING ROSENFELD (CONT’D)  Look at this shit.  ROSALYN ROSENFELD  I'm only nosy cause you never tell  me anything.  IRVING ROSENFELD  Can we clean up this fridge? I  mean, what are you causing trouble  for all the time?  PHONE RINGS AGAIN.  IRVING ROSENFELD (CONT’D)  DO NOT ANSWER THAT--  ROSALYN ROSENFELD  (picks up phone)  HEL-LO- Oh, hi, Carmine. We were  just talking about you.  81.  (MORE) Irving's being a mean, boring man  saying that he doesn't want me to  come tonight.  CARMINE POLITO  (on phone)Tell him he's crazy!  ROSALYN ROSENFELD  Well, I agree.   Want to tell him  yourself?  IRVING ROSENFELD  Gimme the phone, come on.  CARMINE POLITO  It wouldn",
      "dialogue_count": 0,
      "word_count": 806
    },
    {
      "scene_number": 8,
      "slugline": "INT. IRV’S CADILLAC - DUSK 119   119  Elton John’s “Goodbye Yellow Brick Road” plays on the  soundtrack as Irv drives: tinted glasses, large comb over,  blue crushed velvet suit, dark tie -- PAN TO:  VISOR MIRROR -- WHERE Rosalyn APPLIES MASCARA --  SMASH TO:  EXT. GRAND OLD ATLANTIC CITY HOTEL - NIGHT 120   120  Elton John continues as Carmine LIGHTS A CIGARETTE in a two-  toned GRAY AND BLACK TUXEDO, at the center of a haphazard red  carpet situation in front of a has-been beach resort -- large  old movie premiere spotlights rotate onto the facade in an  assorted CROWD OF LOCALS some dressed up -  JULIUS, CARMINE, TITO, MELORA (Carmine’s STEADFAST AIDES)  son DOMINIC, daughter LUCILLE, wife Dolly, assorted COPS,  FIREMEN IN FORMAL UNIFORMS WHITE GLOVES, UNION GUYS in suits,  fringe the area.   Carmine ’s family is dressed up.  IRV’S CAR PULLS UP AND A FAT VALET IN RED OPENS DOOR. ROSALYN  GETS OUT IN HER WHITE DRESS --  DOLLY HANDS ROSALYN A TINY SHOPPING BAG WITH SWISS NAIL  PRODUCTS. ROSALYN OPENS A LITTLE BOTTLE OF NAIL FINISH AND  SHRIEKS IN ECSTACY.  Greets everyone.  LIMO PULLS UP: FLASHBULBS GO OFF -- SUDDENLY THE SPOT LIGHT  JAMS WITH GRINDING SOUND, LAMP EXPLODES IN SMOKE --  THROUGH THE SMOKE FROM THE FIRE STEPS: Richie IN A WHITE  SUIT, Edith stunning SILVER METALLIC Halston dress, WHITE FUR  COAT --  THE SHEIK STEPS OUT OF HIS LIMO, IN A BLACK FORMAL ARAB  DRESS, WITH AN ARABIC OR HISPANIC LOOKING FBI AGENT WE SAW ON  THE PLANE DRESSED AS HIS BODY GUARD IN BLACK WITH BLACK  SUNGLASSES.  ACROSS THE RED CARPET -- ROSALYN AND SYDNEY SEE EACH OTHER  FOR ONE OF THE FIRST TIMES -- LOCK EYES. ROSALYN HUGS IRV’S  ARM --  ROSALYN ROSENFELD  (to Edith, glaring)  I know who you are.  84.",
      "characters": [],
      "action_text": "Irv tries to turn Rosalyn away, but she keeps turning back  giving Edith the hairy eyeball, as Edith gives it right back.  ROSALYN ROSENFELD (CONT’D)  I know who that is Irving.  Off to the side, Richie steels himself with bump of cocaine  before walking inside the old resort, his eyes dilate.  INT. LOBBY OF GRAND OLD SEASIDE HOTEL - NIGHT 121   121  The entourage walks through the ornate lobby as Edith and  Rosalyn continue to eyeball each other with Irv uncomfortably  in the middle as Carmine   ENTHUSIASTICALLY CONTINUES HIS  PRESENTATION FOR THE SHEIK.  CARMINE POLITO  So this is the lobby. Now mind you,  a week ago this place was a mess,  but what existed was this  plasterwork. Look at the detail.  This is beautiful. My sons are  craftsmen. (to son, Dominic)  Please, tell them what you did.  DOLLY POLITO  Tell them everything you know. The  trompe l'oeil.  DOMINIC POLITO  Birds, sky, clouds, wood. Trompe  l'oeil -- \"Trick of the eye.\"  CARMINE POLITO  We can restore all of this, you  see? You save 50 million -- look at  me -- fifty million right off the  bat -- I waive the law I helped  write. It said casino construction  must be ground up new, we don’t do  new. We renovate.  DOLLY POLITO  We don’t do new. We renovate.  Carmine leads all of them through the very crowded lobby as  he talks.  Irving listens intently, moved.  85.",
      "dialogue_count": 0,
      "word_count": 534
    },
    {
      "scene_number": 9,
      "slugline": "INT. DOWNSTAIRS CASINO - CONTINUOUS 122   122  200 PEOPLE ARE GATHERED around blackjack, roulette, and craps  tables, playing and having a good time.  CARMINE POLITO  We put in some temporary fun --  some gaming tables, some play money  for people to have a good time. For  charity -- the Boys and Girls Club  and some arts programs.  Rosalyn walking with Irving, continues to stare daggers at  Edith, who stays close to Richie.  Carmine, Julius, Melora, CONTINUE TO LEAD EVERYONE INTO  INT. THE OCEAN ROOM -- CONTINUOUS 123   123  Carmine continues to walk --  CARMINE POLITO  This is the Ocean Room --  He pushes open double upholstered old doors --  THEY ENTER THE LARGE CROWDED YET INTIMATE BEMELMANS STYLE BAR  The bar -- LIKE THE BEMELMANS BAR AT THE CARLYLE HOTEL IN  MANHATTAN - IS LARGE YET INTIMATE -- THERE ARE 50 DRESSED UP  CITIZENS THERE DRINKING -- AND A CROWDED LONG BAR -- AND  ANOTHER SMALLER BAR ON THE FAR SIDE OF THE ROOM ---  Carmine pauses to stare at the MEN AT THE FAR BAR -- FIVE MEN  IN SUITS, 40 TO 60, SLIGHTLY MOB-LOOKING.  AS Irv IS PULLED ASIDE CONFIDENTIALLY BY Carmine   -- Richie  AND Edith WATCH -- Rosalyn STANDS TO THE SIDE -- Carmine  puts his arm around Irv’s shoulders --  CARMINE POLITO  There are some gentlemen over there  at the bar. That's a hundred and  thirty years sitting there --  that's how much time’s between  them. They run the biggest casinos  in the United States. We have to  work with them.  IRVING ROSENFELD  Right.  86.",
      "characters": [],
      "action_text": "CARMINE POLITO  The good news is they know how it's  done. They get it done. You don't  have to worry. Everyone makes their  money.  IRVING ROSENFELD  You mean the Mob?  CARMINE POLITO  Yes, but they're businessmen, okay?  Now, spend as much or as little  time with them as you like, but we  do have to deal with them. All  we’ve got to do is go say hello.  We just gotta say hi, that's all.  Edith looks on, calm, as Richie -- WILD EYED WITH COCAINE AND  ADRENALINE --  IRVING ROSENFELD  Carmine, maybe -- I'm not sure  that's such a good idea. We gotta  confer before we talk to these  guys.  RICHIE DIMASO  (interrupting, hopped up)  Confer? What is there to confer  about? They’re casino guys.  CARMINE POLITO  They are businessmen.  RICHIE DIMASO  We came all this way, Irving. We  should be here. What’s everybody  scared of? There’s nothing to be  scared of.  Richie stares down Irv, Edith pulls Richie back -- Rosalyn is  starting to go down a SPIRAL OF DEPRESSION as she looks  increasingly uncomfortable.  ROSALYN ROSENFELD  (re: the mob guys)  Those are the guys you’re all  scared of? Those guys over there?  They don’t scare me.  She glares at Edith and Irv and pivots to walk to the bar.  IRVING ROSENFELD  Rosalyn!  87. But she’s already on her way over to the MAFIA MEN at the bar  who GREET HER WARMLY as Irv, Edith, Richie, and Carmine  watch.  RICHIE DIMASO  I love this!  Rosalyn walks up to PETE MUSANE, CHARISMATIC, 30 and sits  down in between all the Mafia guys.. THE OTHER THREE SALT AND  PEPPER MAFIA GUYS LAUGH AND TALK WITH Rosalyn - who gulps a  glass of PROSECCO and IS REFILLED BY PETE MUSANE.  ROSALYN ROSENFELD  Hi.   Can I sit here?  Carmine whispers to Irv as he watches Rosalyn talk to the  Mafia guys.  CARMINE POLITO  Irving, this is not a good idea.  ROSALYN ROSENFELD  How you guys doing? Everybody over  there is really scared of you guys,  you know that?  She knocks back the prosecco. She seems relieved.  Dolly ushers her kids to the door.  DOLLY POLITO  K",
      "dialogue_count": 0,
      "word_count": 3386
    },
    {
      "scene_number": 10,
      "slugline": "INT. HALLWAY TO SYDNEY’S APARTMENT - DAY 134   134  BANG BANG BANG -- Richie POUNDS ON SYDNEY’S DOOR -- SYDNEY,  HAIR IN CURLERS, ANSWERS THE DOOR.  RICHIE DIMASO  Can I use your phone?  INT.   SYDNEY’S APARTMENT DAY - AS SHE WATCHES -- HE paces 135   135  intense, phone in hand, SHIRT SLEEVES, a mess. HE DIALS.  RICHIE DIMASO (CONT’D)  (to Sydney)  Last night was insane. I got it all  figured out.  STODDARD THORSEN  (on phone)  Stoddard Thorsen.  RICHIE DIMASO  (into phone)  Listen, I need the Sherman Suite at  the Plaza Hotel, okay?  STODDARD THORSEN  (on phone)  That's a whole floor of the hotel.  RICHIE DIMASO  I need a whole floor. I need it for  my operation  INT. FBI FIELD OFFICE - DAY - CONTINUOUS  STODDARD THORSEN  (on phone)  Stop calling it your operation,  Richard. It's not your operation.  And I'm not giving you a whole  floor of the Plaza Hotel.  INT. SYDNEY’S APARTMENT - DAY  RICHIE DIMASO  I have members of Congress that are  gonna come in right now to try to  give the Sheik citizenship. They're  taking bribes. This is happening  right now. That's what's happening  right now.  102.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 191
    },
    {
      "scene_number": 11,
      "slugline": "INT. FBI FIELD OFFICE - DAY  STODDARD THORSEN  (on phone)  Bribing members of Congress are you  out of your fucking mind?  INT. SYDNEY’S APARTMENT - DAY  RICHIE DIMASO  Stoddard. Stoddard!   Shut up!  Listen! Do you know who Victor  Tellegio is? Victor. Tellegio.  Works for Meyer Lansky. You know  who that is?  STODDARD THORSEN  I know who Victor Tellegio is.  RICHIE DIMASO  Resorts International! He wants ten  million dollars. I have two weeks!  STODDARD THORSEN  You’re not getting ten million  dollars.  RICHIE DIMASO  (screaming)  Just listen to me! You're not  listening to me! I have two weeks!  I have two weeks to put this thing  together and I need you to get me  the Sherman Suite at the Plaza  Hotel. And your going to fucking do  it!  STODDARD THORSEN  Lower your voice. You don’t get to  yell at me.  Richie SLAMS DOWN THE PHONE. Edith (HAIR IN CURLERS) STARES  AT HIM.  RICHIE DIMASO  Calm me down baby. You gotta calm  me down.  He handles her hips and neck and waist and ass.  RICHIE DIMASO (CONT’D)  Baby let’s do this. Let’s do this  right now. --  103.",
      "characters": [],
      "action_text": "EDITH GREENSLY  No, no.  RICHIE DIMASO  I want to do this. You’re fucking  skin is glowing baby. Your skin is  glowing.  EDITH GREENSLY  I’m not doing this with you. We’re  not going to do this unless we do  it for real, alright?  RICHIE DIMASO  I want to do this now!  EDITH GREENSLY  That’s what we agreed on so we’re  not going to do that alright?  Alright? Where are you? You’re  acting all scary.  She grabs him by the head to calm him down.  EDITH GREENSLY (CONT’D)  Are you here with me?  HE TRIES A GENTLER SEDUCTION.  RICHIE DIMASO  (leans down to her eyes)  I love you. I love you. Look at me.  (slowly)  I’m in love with you. It is real  now. I just said it so now’s the  time.  He handles her, nuzzles her neck, starts to turn her on.  EDITH GREENSLY  (kissing him)  You want the truth? You want real?  RICHIE DIMASO  I’m ready for real.  SOMETHING CLICKS INSIDE HER -- SHE DROPS HER BRITISH ACCENT --  SYDNEY PROSSER  (DROPS HER BRITISH ACCENT)  OK, this is real. Do you hear my  voice? This is real. This is real.  What you hear is real.  104. Richie steps back quickly and grabs Sydney.  RICHIE DIMASO  What?  SYDNEY PROSSER  This is me.  RICHIE DIMASO  What do you mean? What are you  doing an accent? An American  accent?  EDITH GREENSLY  No. There is no English. There’s  only American. There is no English.  Richie looks at her and continues to hold her looking very  confused and flustered.  RICHIE DIMASO  What are you talking about? Stop  it. You’re Edith. You’re Edith  Greensly. I checked your records.  SYDNEY PROSSER  I falsified my records back to  birth. I falsified them.  SYDNEY PROSSER (CONT’D)  My name is Sydney Prosser, and I'm  from Albuquerque, New Mexico. I'm  not Edith Greensly. There is no  Edith Greensly.  Richie steps back. He stares at her darkly.  RICHIE DIMASO  You’re -- freaking -- me -- out.  No, you said in the stall that we  were going to be real and that we  weren't going to fake it.  SYDNEY PROSSER  I’m being real now. This is who I  am. I’m Sy",
      "dialogue_count": 0,
      "word_count": 2924
    },
    {
      "scene_number": 12,
      "slugline": "INT. PLAZA HOTEL - GENERAL SHERMAN SUITE - DAY  Richie on a black and white surveillance camera as he shows  the briefcase full of money.  RICHIE DIMASO  I’m federal agent Richard Dimaso.  I've placed seventy-five thousand  dollars into this briefcase for  Representative John O'Connell of  the Ninth District.  SMASH TO:  EXT. STATE CAPITOL - TRENTON, NEW JERSEY - DAY 148   148  Carmine shakes hands with REP. JOHN O’CONNELL --  CARMINE POLITO  Congressman, thank you for coming  by, John --  RICHIE DIMASO (V.O.)  Representative O'Connell was  contacted by Carmine Polito to ask  if he could obtain rapid  citizenship through an act of  Congress for one Sheik Abdullah,  investor.  They walk up the capitol steps.  CARMINE POLITO  You wanna talk jobs, investment,  construction, if we can expedite a  very wealthy man’s citizenship --  INT. SHERMAN SUITE, PLAZA HOTEL - NIGHT 149   149  CAMERA PANS TO HOLE IN CORNER and CAMERA LENS -- 150   150  152   152  RICHIE DIMASO  How you doing congressmen?  JOHN O’CONNELL  I’m excited to be here.  CARMINE POLITO  This brings the state back. I mean,  how long we known each other?  118.  (MORE)",
      "characters": [],
      "action_text": "You know what this is gonna do for  us?   This is huge for the state of  New Jersey. It stabilizes our  economy.  IRVING ROSENFELD  Hotels. Restaurants. It’s waiting  to happen. Carmine sees it, this  fucking thing is waiting to happen.  CARMINE POLITO  The goddamn bankers. Keeping their  money on the sidelines. How we  supposed to get anything done?  JOHN O’CONNELL  Bankers only put money in the game  when they can reap insane profit.  Richie staring, mesmerized by this trap.  RICHIE DIMASO  The only problem is this  citizenship situation. I mean, we  got to expedite it as soon as  possible.  JOHN O’CONNELL  Yeah, well I'll tell you, you came  to the right place.  Everyone looks tense and on edge before.  JOHN O’CONNELL (CONT’D)  I’ll make it happen.  CARMINE POLITO  Hey, this is going to happen.  Richie slides the briefcase in John’s direction.  CARMINE POLITO (CONT’D)  This is real. You understand?   This  is real. On my family.   On my kids.  On my life.   On my work.  JOHN O’CONNELL  I know that, Carmine.   You're a  good man  This hurts Irving to see his friends sincerity.  119.  CARMINE POLITO (CONT'D) ANOTHER DAY - ON GRAINY MONITOR 153   153  RICHIE DIMASO  (on grainy black and white)  I’m federal agent Richard Dimaso. I  am placing 75 thousand dollars in  this brief case for one  Representative Gerald Sanders of  the 3rd district.  SMASH TO:  -HAND SHAKES - REP. SANDERS SITS LOOKING WARILY AT BRIEFCASE 154   154  REP. SANDERS  I don’t want to do anything illegal-  CARMINE POLITO  Please Gerry. Use it as a campaign  donation. Whatever you want to do.  Richie slides the briefcase to him.  ANOTHER DAY 155   155  RICHIE DIMASO  (on grainy monitor)  I’m placing g $60,000 into an this  brief case for one Congressman Eric  Keshoygan of the 4th district --  ERIC KESHOYGAN  I’m going to do what I can to help  Carmine.  Irv watches in pain as he sits with them.  SMASH TO:  ANOTHER DAY 156   156  RICHIE DIMASO  A $100,000 into this briefcase for  two term United Stat",
      "dialogue_count": 0,
      "word_count": 1673
    },
    {
      "scene_number": 13,
      "slugline": "EXT. IRV AND ROSALYN’S HOUSE - NIGHT  Irving’s Caddy comes screeching up to the house and parks in  the driveway. Irv get’s out and races inside.  INT. IRV AND ROSALYN’S HOUSE - BEDROOM - NIGHT  Rosalyn is still sitting on the bed with Danny.  IRVING ROSENFELD (O.S.)  (shouts)  ROSALYN! ROSALYN!  Rosalyn looks scared.  IRVING ROSENFELD (CONT’D)  This is a real low in our  relationship! You know where I was  recently? I was in your boyfriend’s  fucking car! I saw your nail  polish.  SMASH TO:  INT. PETE MUSANE’S CADILLAC - FLASHBACK  IRVING LOOKS DOWN AND SEES THE BOTTLE OF ROSALYN’S NAIL  FINISH ON THE CAR SEAT -- HE PICKS IT UP, LOOKS AHEAD THROUGH  WINDSHIELD SMELLS IT, WORRIED. Carmine glances over his  shoulder anxiously at Dick Helsing in the back seat.  PETE MUSANE  What’s this I hear about your curly  haired friend working for the  Government?  CARMINE POLITO  What?! Who said that?  IRVING ROSENFELD  That’s bullshit!  PETE MUSANE  Your wife.  Irving is surprised to hear this.  IRVING ROSENFELD  That’s bullshit.  CARMINE POLITO  Rosalyn?  126.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 174
    },
    {
      "scene_number": 14,
      "slugline": "INT. IRV AND ROSALYN’S HOUSE - BEDROOM - CONTINUOUS  IRVING ROSENFELD  (screams)  HE PUT A CANVAS BAG OVER MY HEAD!  SMASH TO:  INT. PETE MUSANE’S CADILLAC - FLASHBACK  A WHITE CANVAS BAG GARROTES OVER IRVING’S HEAD, FROM HELSING  IN THE BACK SEAT.  CARMINE POLITO  Hey, what the fuck?! --  PETE MUSANE  Shut up. Shut the fuck up.  DICK HOLDS A GUN TO THE BACK OF IRVING’S BAGGED HEAD.  INT. IRV AND ROSALYN’S HOUSE - BEDROOM - CONTINUOUS  IRVING ROSENFELD  ARE YOU HAPPY NOW? BECAUSE HE IS  TRYING TO KILL ME!  ROSALYN  What are you talking about?!  IRVING ROSENFELD  WHAT ARE YOU DOING? WHAT DO YOU  THINK YOU’RE DOING?  ROSALYN ROSENFELD  Get out of here! I’m not doing  anything!  IRVING ROSENFELD  WHY ARE YOU TALKING SO MUCH? YOU’RE  GOING TO GET US ALL KILLED!  Irving looks down to see Danny sitting there on the bed.  IRVING ROSENFELD (CONT’D)  Danny. Come here buddy alright? Go  draw a picture or something.  Irving ushers Danny out of the room.  127.",
      "characters": [],
      "action_text": "ROSALYN ROSENFELD  You’re a real sick son of a bitch  for screaming at me like that in  front of Danny.  IRVING ROSENFELD  I’M A SICK SON OF A BITCH? YOU’RE  TRYING TO GET ME FUCKING KILLED. OH  MY GOD!! YOU DRIVE ME SO FUCKING  CRAZY. WHAT ARE YOU DOING?! YOU’RE  BOYFRIEND -- YOUR FUCKING BOYFRIEND  WILL KILL ME, HE’LL KILL DANNY, AND  HE’LL KILL YOU.  ROSALYN ROSENFELD  STOP TALKING LIKE THAT!  IRVING ROSENFELD  He’s a mobster alright? That’s who  you’re dealing with.  ROSALYN ROSENFELD  Alright fine! Yes, I wanted to hurt  you but how do you think that I  feel all day when you leave me  alone all day? And all I’ve ever  wanted is for you to love me.  That’s all I ever wanted. And stay  married and for you to love me. And  that's why I'm going to Miami!  IRVING ROSENFELD  You’re NOT going to Miami.  ROSALYN ROSENFELD  That's why I'm going to Miami with  Pete!  Irving picks up Rosalyn’s clothes from the bed where there is  an open suitcase, throws them back in the closet.  IRVING ROSENFELD  You are NOT going to Miami.  ROSALYN ROSENFELD  I finally found somebody who loves  me just like YOU always wanted.  IRVING ROSENFELD  Too dangerous. Miami? Not now. Too  dangerous.  Irv continue to throw clothes back into the closet.  128. ROSALYN ROSENFELD  He likes me just the way I am.  IRVING ROSENFELD  Not now. Everything has to stay  normal right now. And you’re going  to shut your mouth!  ROSALYN ROSENFELD  You told me that you wanted me to  find a nice quiet man!  IRVING ROSENFELD  Oh and what a DOOZY you picked!  ROSALYN ROSENFELD  He’s the one.  IRVING ROSENFELD  He’s the most dangerous guy ever.  ROSALYN ROSENFELD  WELL WHAT DO YOU EXPECT IRVING?! I  KNOW EVERYBODY THROUGH YOU! WHY  CAN’T YOU JUST BE HAPPY FOR ME?!  Irving reaches for his heart pills but they fall out of his  hands and scatter on the floor. He bends down to grab them  and almost falls. Rosalyn helps him up.  ROSALYN ROSENFELD (CONT’D)  Why aren’t you taking your heart  pills? Irving, what’s going on?",
      "dialogue_count": 0,
      "word_count": 755
    },
    {
      "scene_number": 15,
      "slugline": "INT. IRV AND ROSALYN’S HOUSE - BEDROOM - CONTINUOUS  IRVING ROSENFELD  I can save all of us, and we can  save money. I can take care of you  and Danny. OK?   But you gotta close  your mouth.  Rosalyn looks satisfied and points her finger at Irving.  ROSALYN ROSENFELD  I knew it. I have always said,  Irving, that you are very, very  hard to motivate properly. And I  knew that Pete was gonna go over  there and knock some sense into  you. I've been reading this book,  Irving. It's by Wayne Dyer, about  the power of intention.  Irving can’t believe what he’s hearing right now.  Rosalyn, very satisfied, reaches over the bed and grabs a  book.  ROSALYN ROSENFELD (CONT’D)  And my intention in sending Pete  over to you was so that you could  come up with this plan.   So, you're  welcome.  Irving incredulous, thinks to himself how to respond. Forces  himself to say gently --  IRVING ROSENFELD  OK. Thank you, Rosalyn.   Thank you  for the plan.  ROSALYN ROSENFELD  You’re welcome.  IRVING ROSENFELD  I appreciate that. So, I think that  we should be partners on this.  ROSALYN ROSENFELD  I’m a good partner. Almost better  than Edith. You ever think about  that? You ever think about how you  might have underestimated me?  IRVING ROSENFELD  So what is our plan? Tell me the  plan. What are you gonna do?  131.",
      "characters": [],
      "action_text": "ROSALYN ROSENFELD  I’m going to keep my mouth shut and  I’m not going to say anything but  what do I do if Pete calls me? What  am I supposed to say?  IRVING ROSENFELD  You gotta stop talking about your  government agencies and your I.R.S.  and your tax and your conspiracies  and all of that. You're gonna say  how you were wrong, you were wrong  about that.  ROSALYN ROSENFELD  I’ll tell Pete that I was wrong but  you know that in real life, I was  right for saying all that stuff  because then that spurred on the  actions that made you come up with  this plan. So I will tell Pete.  IRVING ROSENFELD  (holding his head)  OK.  ROSALYN ROSENFELD  (pointing with cigarette  between fingers)  The power of intention Irving. The  power of intention.  Irv is doing everything he can to hold it together.  IRVING ROSENFELD  OK. You were right.  Rosalyn gets up from the bed and walks over to Irving.  IRVING ROSENFELD (CONT’D)  You're so smart. Good job, peaches.  ROSALYN ROSENFELD  Irving, I've been doing a lot of  thinking and -- you need to grow  up.   And you need to face the  facts.   And I think that both of us  will be a lot happier if we get a  divorce.  As he listens to words he has been saying himself for months,  now spoken as Rosalyn’s idea.  132. IRVING ROSENFELD  OK.  ROSALYN ROSENFELD  Just think about it. (kisses him)  These things are never easy.  Irving starts walking away towards the door.  IRVING ROSENFELD  Alright.  ROSALYN ROSENFELD  Irving. Good luck with your plan.  EXT. FBI OFFICE, FEDERAL OFFICE BUILDING, NY - DAY  The spare rhythmic intro of Jeff Lynne’s “Long Black Road”  plays as Richie looks back over his shoulder and walks  towards the building with intensity.  IRVING ROSENFELD (V.O.)  Necessity truly is the mother of  invention. The F.B.I. was willing  to wire the two million dollars if  it meant taking down Tellegio and  his entire organization.  INT. FBI OFFICE, FEDERAL OFFICE BUILDING, NY  Brenda in her office.  Amado looking very pleased on the t",
      "dialogue_count": 0,
      "word_count": 638
    },
    {
      "scene_number": 16,
      "slugline": "INT. ELEVATOR - CONTINUOUS 178C   178C  THEY STAND TENSE IN ELEVATOR NOT SPEAKING.  INT. RECEPTION AREA - SIMONE LAW OFFICE - DAY 178D   178D  They open door to large, spare reception area of Alfonse  Simone’s law office. MIDDLE AGED SECRETARY looks up and picks  up the phone.  INT. HALLWAY OF ALFONSE SIMONE'S OFFICE - CONTINUOUS 178E   178E  NEARBY AT A SMALL TABLE SYDNEY IS FRISKED BY A BLACK MAN IN A  SUIT, SHE SUSTAINS EYE CONTACT WITH IRVING AND RICHIE AS THEY  ARE ALSO FRISKED BY ANOTHER MAN IN A SUIT ACROSS THE ROOM. --  THE CONTENTS OF SYDNEY’S PURSE ARE EMPTIED AND EXAMINED ALONG  WITH HER PURSE. IT IS TENSE. SYDNEY STARES AT A NERVOUS  RICHIE; THEIR MICROPHONES HAVE GONE UNDETECTED. “LONG BLACK  ROAD” CONTINUES AS CAMERA FOLLOWS THE BACK OF THE THICK NECK  OF THE MAN IN THE SUIT AS HE LEADS THEM DOWN A WINDING NARROW  OFFICE CORRIDOR. IN ONE SHOT THE DOOR OPENS, JEFF LYNNE’S  SONG SHIFTS TO A LIGHTER THAN AIR PIANO BREAK.  INT. ALFONSE SIMONE’S OFFICE - CONTINUOUS 178F   178F  ALFONSE SIMONE- 64, BRONX, SEASONED LAWYER.  Alfonse Simone rises from behind his desk. A silent secretary  sitting at his side in a white dress stares at our heros as  Simone steps forward to introduce himself.  ALFONSE SIMONE  Alfonse Simone.  Edith walks up to him to shake hands. He shakes hands with  Irving and Richie as well. Man in the suit closes the door  behind them.  EDITH GREENSLY  Edith Greensly.  IRVING ROSENFELD  Irving Rosenfeld.  RICHIE DIMASO  Good afternoon.  ALFONSE SIMONE  Please, be seated.  134.",
      "characters": [],
      "action_text": "They sit in three chairs facing Simone’s desk: Sydney/Edith,  Richie, Irving.  Simone sits behind his desk, the silent secretary sits just  behind him slightly to the side, stares at Edith, Richie,  Irving.  ALFONSE SIMONE (CONT’D)  I appreciate the fact that you all  came in person, but the trip was  really unnecessary because this  whole thing could have been done  with a simple wire transfer. As a  matter of fact this is the number  of our wire right here.  Simone slides a small pink piece of paper across the desk to  them. Richie stares at the paper, but doesn’t touch it.  RICHIE DIMASO  Where is Mr. Tellegio?  ALFONSE SIMONE  Mr. Tellegio unfortunately was  called out of town on business.  RICHIE DIMASO  That’s not good. We were willing to  come here today, in person, to see  Mr. Tellegio, as a sign of respect  to give two million dollars --  ALFONSE SIMONE  I can assure you that I have the  power of attorney --  RICHIE DIMASO  Excuse me. If you'll let me finish,  we are willing to give two million  dollars today of the ten.   But  without Mr. Tellegio here --  IRVING ROSENFELD  (to Simone)  We can't, we can't make that  decision. It's not the right thing.  It's not the right time. It's just  not good.  EDITH GREENSLY  (to Irving across Richie)  You don't have the authorization to  make this kind of choice so don't  be hasty, alright?  135. IRVING ROSENFELD  I'm not being hasty.   It's just,  let's be smart about it. This is  not how we do business. (to Simone)  I'm sorry. I apologize.  Richie motions with his hand to Edith that he agrees with  Irving.  RICHIE DIMASO  He's right, we can't.  EDITH GREENSLY  I think you should hang in there.  RICHIE DIMASO  For what? The guy's not here.  IRVING ROSENFELD  He isn't.  RICHIE DIMASO  That’s it.  He stands, goes to the door.  IRVING ROSENFELD  This is a surprise. The Sheik  doesn’t like surprises.  Edith turns in her chair to face them in the doorway.  EDITH GREENSLY  Don’t leave.  IRVING ROSENFELD  (in doorway with ",
      "dialogue_count": 0,
      "word_count": 1014
    },
    {
      "scene_number": 17,
      "slugline": "INT. ALFONSE SIMONE’S OFFICE - DAY - CONTINUOUS  Richie hangs up.  RICHIE DIMASO  The money’s been wired.  ALFONSE SIMONE  I think we have a deal.  RICHIE DIMASO  Yes we do sir.  ALFONSE SIMONE  Pleasure doing business with you.  RICHIE DIMASO  Okay, well, thank you very much,  Mr. Simone.  RICHIE SMILES, SYDNEY LOOKS AT IRVING, WHO LOOKS PREOCCUPIED.  PUSH IN ON IRVING.  RICHIE DIMASO (CONT’D)  The Sheik’s very excited.  ALFONSE SIMONE  I’m sure that we’ll be seeing each  other.  Richie and team start to walk out.  RICHIE DIMASO  (grinning)  Oh I’m sure we’ll be seeing each  other very soon. You may even get  sick of me, like these two.  ALFONSE SIMONE  I don’t think I’ll get sick of you.  Nice meeting you.  Richie, Edith, and Irving walk down the hall after leaving  his office. Richie smiles as the opening of Bowie’s “The Jean  Genie” momentously starts. Edith smiles as she walks down the  hall followed by Irving. Richie puts his hand on the door  knob to exit the hallway.  INT. AMADO’S OFFICE, FEDERAL OFFICE BUILDING - DAY 178H   178H  THE DOOR OPENS IN A TIMECUT, RICHIE IN SUNGLASSES, HIS JACKET  IS OFF, HE BEAMS AND CELEBRATES AND EXHORTS A ROOM FULL OF  FBI AGENTS, ADMINISTRATORS, SECRETARIES.  139.",
      "characters": [],
      "action_text": "THE JEAN GENIE PLAYS ENERGETICALLY AS RICHIE CELEBRATES WITH  EVERYONE, LIKE IN A LOCKER ROOM, HIS FIST IN THE AIR.  RICHIE DIMASO  FINALLY! FINALLY WE GET SOME  RESPECT!  AMADO SITS IN HIS CHAIR WITH CIGAR IN ONE HAND AND DRINK IN  THE OTHER. VERY EXCITED AND LAUGHING AS HE POINTS AT RICHIE.  ANTHONY AMADO  (shouts through clamor)  We’re ambitious, that’s why!  Richie suddenly moves to the reel to reel surveillance tape  and quiets the room, the music momentarily stops as we hear  Alfonse Simone on the surveillance tape.  RICHIE DIMASO  Shh, shh, shh!  ALFONSE SIMONE (ON SURVEILLANCE TAPE)  If we have to pay somebody off,  we'll pay somebody off. If we have  to lean on somebody, intimidate  somebody, we'll intimidate  somebody.  Richie joyfully lip synchs to the rhythm of Simone’s  incriminating words on tape.  RICHIE DIMASO  (in unison with Simone on  tape)  -- If we have to lean on somebody,  intimate somebody, we'll intimidate  somebody!!  RICHIE THROWS HIS FIST IN THE AIR AND CHEERS, JOINED BY  EVERYONE IN THE ROOM. BOWIES “THE JENE GENIE” COMES BACK  LOUD.  RICHIE TURNS AND TWIRLS A WHITE HAIRED FBI AGENT IN 179   179  CELEBRATION, LAUGHING WITH JOY. THEN GOES OVER TO A SULKING  STODDARD AND HUMPS HIM LIKE AT A FRAT PARTY, LAUGHING WITH  EVERYBODY AT STODDARD’S STIFFNESS. STODDARD GETS UP AND  RICHIE SMACKS HIS ASS AS HE LEAVES THE ROOM. RICHIE IMITATES  STODDARD TO ROARING LAUGHTER -- TWICE.  THE MUSIC CRESCENDOS TO AN ABRUPT STOP.  140.",
      "dialogue_count": 0,
      "word_count": 450
    },
    {
      "scene_number": 18,
      "slugline": "EXT. CARMINE POLITO’S CAMDEN NJ CLAPBOARD HOME - DAY 180   180  Irving’s big blue car pulls up to the lens. Irving and Sydney  looking a little uneasy.  Irving stares at the house.  IRVING ROSENFELD  I gotta do it.  INT. CARMINE’S LIVING ROOM - DAY 181   181  CARMINE POLITO  What do you mean, there's no sheik?  What does that mean, \"there's no  sheik\"? What does that mean?  Carmine stares at Irving.  IRVING ROSENFELD  I want to face you like a man  because I want to be real now.  CARMINE POLITO  Who is \"they\"?  Irving looks distressed. He’s a wreck.  IRVING ROSENFELD  It’s the Feds.  CARMINE POLITO  The Feds?  IRVING ROSENFELD  Yeah.  CARMINE POLITO  Irving -- I'm a good person  IRVING ROSENFELD  You are!  Carmine stands up and looks around the room, disoriented, his  life passing before his eyes.  CARMINE POLITO  I’ve been doing this for a long  time, for twenty years.   Do you  think I woulda taken that money if  it wasn't the right thing to do?  141.",
      "characters": [],
      "action_text": "IRVING ROSENFELD  Hey look, you’re a good person I  know that but in all honesty --  CARMINE POLITO  (screams)  You said that was the only way,  Irv. You chased me, remember?  IRVING ROSENFELD  They fuckin' made me do it. What  was I supposed to do?   They had Syd  in jail.  CARMINE POLITO  You made me go back to the Plaza to  take that money, you piece of shit!  I was gone! You fucking prick!  CARMINE BEATS IRVING DOWN ON THE COUCH.  CARMINE POLITO (CONT’D)  I was gone, I left!  DOLLY WALKS IN.  DOLLY POLITO  Is everything alright? Can I have a  word with you?  CARMINE POLITO  (very upset)  No, please, Dolly, just go  upstairs. Take the kids and go  upstairs!  DOLLY POLITO  Alright, alright.  IRVING ROSENFELD  I want to make this right.   I came  here because I want to make it  right.  Irving is in tears. Very upset.  CARMINE POLITO  Look at my face. You tell me that  I'm lying to you when I say that  everything I do is for the good of  the people of New Jersey.  Everything I do is for them. Am I  lying to you?  142. IRVING ROSENFELD  I never had a friend like you  before.  CARMINE POLITO  I used that money for the goddamn  casino.  IRVING ROSENFELD  I got some leverage, alright? I can  help you out.  CARMINE POLITO  This is all shit. It's all  bullshit.  Carmine picks up the knife the Sheik gave him.  CARMINE POLITO (CONT’D)  Look at this thing. Look at this.  Ceremonial fucking knife.   What is  this bullshit? Some toy?  He drops it on the table. Irving stares at his friend,  removes his glasses.  IRVING ROSENFELD  Carmine, Syd and I got a plan for  you. We can help you out.  CARMINE POLITO  Please get out of my house, Irving.  Will you please leave?   I'm asking  you nicely, please leave.  Irving gets up to go and is pushed towards the door by  Carmine. Dolly joins Carmine in tears. Carmine’s kids stand  on the stairs.  DOLLY POLITO  Get out of our house!  IRVING ROSENFELD  I don’t want to -- (seeing kids)  I'm sorry. I didn't mean for this  to happen.  CARMINE ",
      "dialogue_count": 0,
      "word_count": 1544
    },
    {
      "scene_number": 19,
      "slugline": "INT. ALFONSE SIMONE’S OFFICE - DAY - FLASHBACK  Ed Malone, dressed as Alfonse Simone, steps to camera to  shake Richie’s hand.  ED MALONE  Alfonse Simone.  CUT TO:  INT. ANTHONY AMADO’S OFFICE - DAY - BACK TO PRESENT  EDITH GREENSLY  People believe what they want to  believe Richie.  RICHIE DIMASO  That’s because you conned me! You  both fucking conned me. You both  got under me. You did!  IRVING ROSENFELD  Well that doesn't sound so good,  either. I mean -- and I don't know  what you're talking about, but --  let's just assume you want to go  with that story. Really? That's the  story you want to go with? That's  what you want the New York Times to  hear? That you got conned by the  very con men who you forced to  entrap the members of Congress in  the first place. That's what you  want to go with? That doesn't sound  so good for your whole thing.  Richie looks like he’s going to be sick.  IRVING ROSENFELD (CONT’D)  And how ironic that the most  creative minds, the ones who are  working hardest to get the economy  of New Jersey going, those are the  ones that you round up. And why?  Because what, they're the easiest  to go after? And what about the  real bullshit artists? You didn't  even come close to the big leagues.  Those big guys. The money men.  RICHIE DIMASO  That's what I was trying to go  after.  149.",
      "characters": [],
      "action_text": "IRVING ROSENFELD  I'm sorry to tell you, you got none  of 'em.  STODDARD THORSEN  You know, Richard, I think we may  call you as a witness, but  otherwise you're done. I think you  better go home.  Richie disoriented, appeals to Stoddard.  RICHIE DIMASO  Stoddard --  STODDARD THORSEN  Go on home, Richard.  ELO’s “10538 Overture” reprises on the soundtrack.  EXT. FBI OFFICE, FEDERAL OFFICE BUILDING, NY - DAY  Camera tilts down from the Federal Building to find Richie  coming down the stairs, emotional. Richie walks wiping his  eyes, his innocence and Edith, lost.  CUT TO:  IRVING ROSENFELD (V.O.)  We took down some very big guys.  -REP. SANDERS SWARMED BY PHOTOGRAPHERS WALKING OUT OF  BUILDING, ESCORTED BY FBI AGENTS.  -REP. SIMMONS ESCORTED OUT OF CITY HALL.  IRVING ROSENFELD (V.O.)  Some of whom were just doing  business as usual helping their  communities or their states.  -REP. KESHOYGAN IS GRABBED AS HE APPROACHES HIS CAR IN A  GROCERY STORE PARKING LOT WITH A BAG FULL OF GROCERIES.  IRVING ROSENFELD (V.O.)  But some of them knew they had  larceny in their blood--  -REP. O’CONNELL COVERS HIS FACE AS PHOTOGRAPHERS SWARM HIM AS  HE’S ARRESTED OUTSIDE HIS HOUSE AS WIFE AND DAUGHTER LOOK ON.  150. CARL ELWAY IS CHELSEA HOTEL OFFICE IN HIS BATHROBE WITH HIS  SECRETARY IN TEARS.  IRVING ROSENFELD (V.O.)  And they even admitted it.  GREY HAIRED SENATOR HORTON MITCHELL, wife by his side, denies  any wrongdoing and is photographed and humiliated as he then  sits with her in a Federal car.  IRVING ROSENFELD (V.O.)  But in all it was six Congressmen,  one United States Senator, and my  friend, Carmine Polito.  THE DOOR TO CARMINE’S CLAPBOARD HOUSE OPENS, CARMINE STANDS  IN THE DOOR, STARES AT THE AGENTS, HIS WIFE AND CHILDREN IN  TEARS STAND BEHIND HIM AS HE SERVED A WARRANT. CARMINE IS  HANDCUFFED.  IRVING ROSENFELD (V.O.)  We gave the two million back so  Carmine got the reduced sentence.  18 months. The loss of his  friendship would haunt me for the  rest of my life.  C",
      "dialogue_count": 0,
      "word_count": 886
    },
    {
      "scene_number": 20,
      "slugline": "INT. ART GALLERY - DAY 210   210  Irving and Sydney admire a piece of art on the wall.  IRVING ROSENFELD (V.O.)  We got a loan from a bank and were  able to go gallery legitimate.  INT. SMALL BANK - DAY  Irving and Sydney sit in front of a banker asking for a loan.  IRVING ROSENFELD (V.O.)  The art of survival is a story that  never ends.  INT. SYDNEY’S APARTMENT - DAY  SYDNEY PLACES THE NEEDLE ON THE RECORD PLAYING ON A  TURNTABLE: DUKE ELLINGTON’S JEEPS BLUES, begins. SHE STARES  ACROSS THE ROOM AT IRVING. IRVING STARES BACK HER.  CUT TO BLACK  153.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 103
    }
  ]
}