{
  "slug": "american-vandal-108-clean-up-2017",
  "title": "american vandal 108 clean up",
  "genre": "comedy",
  "format": "series",
  "scenes_count": 5,
  "characters_count": 0,
  "characters": [],
  "total_words": 6569,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. HANOVER HIGH SCHOOL - SCIENCE LAB - DAY [IPHONE FOOTAGE] 108-11A  All the students stand at lab stations with blue lab notebooks. Mr. Runko addresses the class: MR. RUNKO Does anyone need a pencil? DYLAN Not me! Dylan holds up his pencil, proudly. DYLAN (CONT’D) I brought   my own . BACK TO:  TALKING HEAD:   DYLAN MAXWELL. DYLAN (CONT’D) Honestly, I feel like a new man. I’m putting in 100%. INT. MS. SHAPIRO'S SPANISH CLASSROOM - DAY [SNAPCHAT FOOTAGE] 108-12  Ms. Shapiro passes out quizzes. MS. SHAPIRO (addressing the class) OK, weekly conjugations, take one and pass it back. She reaches Dylan, sitting in the front row. She places a quiz on his desk. He looks at it for a moment, then slides it back. DYLAN Nah. I'm good. BACK TO:  RESUME TALKING HEAD:   DYLAN MAXWELL, IN HIS CAR. DYLAN (CONT’D) But fuck Shapiro. Seriously. (smiles) I can’t wait until she apologizes to me. It’s going to be fucking savage. RESUME SCENE:  AMERICAN VANDAL #108 \"CLEAN UP.\" Prod. Draft 12/30/16   10.",
      "characters": [],
      "action_text": "Bewildered, Ms. Shapiro removes the quiz from Dylan's desk. MS. SHAPIRO Can we speak after class? OMITTED 108-13  INT. MS. SHAPIRO'S SPANISH CLASSROOM - DAY [IPHONE FOOTAGE] 108-13A  Brianna secretly shoots with her iPhone in the doorway. Dylan stands at the foot of Ms. Shapiro’s desk. MS. SHAPIRO You’re going to graduate; that much has been made clear. So, to that end, some congratulations are in order... DYLAN (cocky) Thank you. MS. SHAPIRO I’m sorry that I suspected you vandalized the cars, but let’s be honest with each other, Dylan: you’ve terrorized me in and out of this classroom for four years, and your brother four before that. Those facts don’t change. So, while I am happy that you’re graduating, that alone doesn’t change you. It wasn’t enough to change your brother. And it won’t be enough to change you. Dylan stares back at her; this wasn’t what he was expecting. MS. SHAPIRO (CONT’D) Good luck to you, Mr. Maxwell. Shapiro walks away, leaving Dylan speechless for a moment. With Shapiro’s back turned, Dylan brandishes two middle fingers mouthing “fuck you, bitch”.  TALKING HEAD:   DYLAN MAXWELL. DYLAN Honestly, that bitch needs to work on her apologies.  AMERICAN VANDAL #108 \"CLEAN UP.\" Prod. Draft 12/30/16   11.",
      "dialogue_count": 0,
      "word_count": 377
    },
    {
      "scene_number": 2,
      "slugline": "INT. HANOVER HIGH SCHOOL - CAFETERIA - CONTINUOUS 108-14  We follow Dylan into the cafeteria. TIGHT ON: ALEX TRIMBOLI sitting in the corner, eating a pepperoni pizza. Dylan approaches him, a stern look on his face. ALEX Hey, man. Look, I'm really sorry how everything went down... Dylan towers over him, not saying a word. ALEX (CONT’D) I thought I saw you, but, obviously, that's... not the case. The guy looked just like you, I swear! Could've happened to anyone,  hundred-percent . Dylan continues to stone wall him as Alex rambles through his apology. Dylan keeps laser-eye-contact as he reaches down and delicately picks up Alex's bag of chips. ALEX (CONT’D) I hope you can find it in your heart to forgive me, man. I mean lunch was on the line... Dylan takes out a chip and slowly eats it. ALEX (CONT’D) I never would of done it on purpos-- Dylan puts one finger to Alex's lips, shushing him. DYLAN Someday, I'm going to even the score. Maybe not today. Maybe not tomorrow. But someday you're gonna get what's coming to you, Alex. Dylan gently picks up Alex's slice of pizza and carelessly drops it, letting it fall to the ground cheese side down. DYLAN (CONT’D) Okay, yeah, it was today.  TALKING HEAD : STUDIOUS SENIOR. STUDIOUS SENIOR I always knew Dylan was innocent! I've been saying it since day one!  AMERICAN VANDAL #108 \"CLEAN UP.\" Prod. Draft 12/30/16   12.",
      "characters": [],
      "action_text": "TALKING HEAD : CHRISTA CARLYLE. CHRISTA Your documentary, the FREE DYLAN T- shirts, the protests, the Go-Fund- Me Campaign, it all made a difference. I’m happy for Dylan.  TALKING HEAD : JUNIOR IN A WHEELCHAIR JUNIOR IN A WHEELCHAIR Everyone knew Dylan didn't do it. It was all a conspiracy, man!  TALKING HEAD : SENIOR IN HOODIE SENIOR IN HOODIE So if Dylan's innocent, who did it?  TALKING HEAD : BRANDON GALLOWAY. BRANDON You’re gonna find who drew the dicks, right? How else are you gonna end the documentary? PETER (O.S.) In a perfect world, I'd love to find out who did it, but you want to know the truth? In real life, not everything gets wrapped up with a bow. There are truths and half- truths-- BRANDON Dude, fuck that. Don't end it with that   SERIAL   bullshit, who the fuck drew the dicks?! CUT TO BLACK. OVER BLACK.  PETER (V.O.) “Who the fuck drew the dicks?” Brandon’s words, not mine. But it's a fair question. And if I'm being honest, it's been eating at me too. Now that we know that Dylan didn't draw the dicks, who did?  AMERICAN VANDAL #108 \"CLEAN UP.\" Prod. Draft 12/30/16   13.",
      "dialogue_count": 0,
      "word_count": 439
    },
    {
      "scene_number": 3,
      "slugline": "INT. HANOVER HIGH SCHOOL - TV STUDIO - DAY 108-15  Strings and pictures crisscross and overlap in a never-ending web of theories on the corkboard. Peter and Sam examine it all as they discuss. SAM I honestly have no clue. PETER We've looked at it from just about every angle and I’m still asking the same questions. Is there a teacher vendetta we're not considering? Anyone with access that we missed? A weak alibi? SAM The only thing we do know is that Dylan didn't do it... Peter tears down Dylan's picture from the middle of the bulletin board. He stares down at it, boiling over: PETER Yeah, and now that he’s innocent, literally no one in the administration gives a rat’s ass about finding who really drew the dicks. It’s insane. Dylan got no public apology -- the kid was wrongfully expelled and not one teacher seems to be bothered by this. Peter looks back up at his evidence board, his obsession. He’s driven to keep going. PETER (CONT’D) I feel like we're so close to cracking this, Sam. Like we're just missing that one last piece of this puzzle. SAM Maybe it doesn’t matter. Justice has been served, an innocent man has been exonerated. Dylan’s life is back on track, right? OMITTED 108-16  AMERICAN VANDAL #108 \"CLEAN UP.\" Prod. Draft 12/30/16   14.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 225
    },
    {
      "scene_number": 4,
      "slugline": "INT. HOME OF DYLAN MAXWELL - LIVING ROOM - DAY 108-16A  Dylan interviews. He holds up an envelope from Boulder, already opened. DYLAN Got a letter from Boulder... (genuinely disappointed) They said they’re full for next year already, and I should try for January admission. My mom called and everything, but... It’s bullshit. I don’t really know what else to-- The doorbell rings. DYLAN (PRELAP) (CONT’D) Hey. MACKENZIE (PRELAP) Can we talk? JUMP CUT: INT. HOME OF DYLAN MAXWELL - FOYER - MOMENTS LATER 108-16B  Dylan and Mackenzie talk at the front door. Peter moves to see Mackenzie on the front porch. She eyes the lens and ignores it. MACKENZIE I fucked up. DYLAN Yeah. You did. MACKENZIE But no matter what you think, I want you to know, I am really sorry. I shouldn’t have kept that video from you when it could have gotten you off. Dylan looks over to Peter, and leans back. Finally he feels like he’s in control of this relationship. DYLAN Damn right.  AMERICAN VANDAL #108 \"CLEAN UP.\" Prod. Draft 12/30/16   15.",
      "characters": [],
      "action_text": "MACKENZIE (keeps plowing through) I just want you to know that I didn’t mean to... I was so embarrassed and I didn’t want to hurt you after we had just gotten back together. But what I did sucks and I wish I could take it back... Dylan warms up to her. It’s hard for him to stay mad at Mack, so much history there. DYLAN (solemn) Mack, I didn’t get into Boulder... MACKENZIE I’m sorry, Dylan. At least you tried, right? DYLAN But... that was the plan. We were supposed to go together-- MACKENZIE Dylan, I mean... Boulder was always a bit of a stretch for you... It stings. Dylan tries his best to not show it. DYLAN Well, long distance relationships are fucking tough, but I guess we’ll make it work. Greg’s gonna need to pay for faster Wi-Fi. MACKENZIE I don’t think we should get back together, Dylan. I really just came to apologize... (gently) I’m ready to move on. I’m ready to start over. I think it’s what’s best for both of us... The words hit Dylan like a ton of bricks. It’s really over this time. DYLAN Yeah, well... I’d never take back a cheater anyway. Dylan looks over at Peter, directly into camera. We linger in the discomfort of this moment.  AMERICAN VANDAL #108 \"CLEAN UP.\" Prod. Draft 12/30/16   16. OMITTED 108-17  OMITTED 108-18  OMITTED 108-18A  INSERT : INSTAGRAM. VARIOUS PROM PHOTOS 108-18B  Several pictures and videos show students all dressed up for the dance. More than half feature the classic arms-around-the- waist prom pose.   We see many familiar faces: SARA PEARSON and SCOTT WINTER, GABI going stag with her FRIENDS, PAT MICKELWAITE with ANOTHER GIRL way out of his league, etc. EXT. HOME OF DYLAN MAXWELL - DAY 108-19  We match cut to the WayBack Boys doing the same prom pose, except this time it's all three of them posing with Ganj sandwiched in the middle. Each one of them wearing formal wear found on the clearance rack of a thrift store. SPENCER Yo, Sam. Get a shot of this. BRIANNA I promise it's relevant to the documentary. Sam turns the camera toward ",
      "dialogue_count": 0,
      "word_count": 4524
    },
    {
      "scene_number": 5,
      "slugline": "INT. DYLAN’S HOUSE - DYLAN’S BEDROOM - DAY 108-49D  A restless Dylan paces as Peter talks to him. DYLAN Shapiro just wants to see me get fucked, man. She’s trying to pin some shit on me! Can you believe this shit? It’s happening all over again! PETER (O.S.) What happened? DYLAN I don’t know, man. Someone, like, fuckin’ trashed her place and shit. PETER (O.S.) You sure you didn’t have anything to do with this? DYLAN What?! No. Are you kidding? Someone spray-painted a dick on her driveway.   No ball hairs . Couldn’t be me. Peter leaves an uncomfortable silence. Dylan continues. DYLAN (CONT’D) (trying to sell it) She’s fucking framing me again, Pete. PETER (O.S.) Do you know that Ms. Shapiro’s neighbor has a security camera? The color drains from Dylan’s face. EXT. MS. SHAPIRO’S HOUSE - NIGHT [SECURITY CAMERA FOOTAGE] 108-49E  We see Shapiro’s house from her neighbor’s surveillance camera. Dylan’s car pulls up front. Dylan hustles up to her driveway and pulls out a spray paint can. INT. DYLAN’S HOUSE - BEDROOM - RESUME SCENE 108-49F  Dylan doesn’t speak.  AMERICAN VANDAL #108 \"CLEAN UP.\" Prod. Draft 12/30/16   41.",
      "characters": [],
      "action_text": "PETER (O.S.) How could you do it? DYLAN It... wasn’t me. PETER (O.S.) You were exonerated! You were back in school! You were innocent, Dylan! How could you throw it all away?! Dylan hangs his head. DYLAN Throw what away? He looks up at Pete, vulnerable. DYLAN (CONT’D) Boulder won’t let me in anymore... (a beat) Mack’s gone... (a beat) Shapiro’s right. Doesn’t matter if I graduate. I’m still fucked. PETER (O.C.) Dylan... DYLAN Everyone thinks I’m just a fucking idiot stoner who’s not going anywhere... so what the fuck? If that’s what everyone thinks, then... that’s just who I am. PETER (O.C.) That’s not true. DYLAN I’m the bad guy. Dylan looks directly in the camera, and: DYLAN (CONT’D) I’m the fuck up. PETER (O.C.) You don’t have to be that person, Dylan. You’re more than just your reputation. Dylan stares at the camera. Unconvinced.  AMERICAN VANDAL #108 \"CLEAN UP.\" Prod. Draft 12/30/16   42. Long beat. CUT TO: EXT. HANOVER HIGH SCHOOL - GOLDEN HOUR 108-49G  Stylized shots of the high school. PETER (V.O.)  Consider for a moment the type of person that would spray paint dicks on cars in the faculty parking lot.  INSERT:   Shots of students on campus. PETER (V.O.)  What do they look like? Who do they hang out with? Where do they sit in the cafeteria? What kind of grades do they get?  INSERT:   YEARBOOK PHOTOS OF FRIENDLY LOOKING SOPHOMORE. PETER (V.O.)  Is this who you’re imagining? ...Probably not.  INSERT:   YEARBOOK PHOTO. NERDY KID. PETER (V.O.)  How about him?  INSERT:   YEARBOOK PHOTO. SARA PEARSON. PETER (V.O.)  Or her?  INSERT:   YEARBOOK PHOTO. DYLAN MAXWELL. PETER (V.O.)  Or   him?  INSERT:   VARIOUS SHOTS OF DYLAN AND THE WAYBACK BOYS. PETER (V.O.)  I set out to examine the case against Dylan Maxwell. To find out whether or not he was guilty of the vandalism on March 15th.  INSERT:   STYLIZED SHOTS OF THE DICKS.  AMERICAN VANDAL #108 \"CLEAN UP.\" Prod. Draft 12/30/16   43. PETER (V.O.)  I helped prove without a shadow of a doubt that Dylan Maxwell was innoc",
      "dialogue_count": 0,
      "word_count": 1004
    }
  ]
}