{
  "slug": "american-horror-story-101-pilot-2011",
  "title": "american horror story 101 pilot",
  "genre": "thriller",
  "format": "series",
  "scenes_count": 9,
  "characters_count": 0,
  "characters": [],
  "total_words": 11450,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. LIVING ROOM -- AFTERNOON  We are on Troy’s face as he slowly makes his way across the  empty room. All we HEAR is the sound of flies...a faint  buzzing, then a cacophony. He finally stops near where his  brother is standing and kneels down.  TROY  Awesome.  He is looking at a dead gutted POSSUM...someone, something,  has feasted here. The possum’s face is frozen and twisted in  fear. ANGLE: the boys crouching reflection in the gray flat  dead eye of the animal. Just then, a NOISE. Faint childish  LAUGHTER. Adelaide? The boys investigate.  They walk down the hall, when suddenly a BASEMENT DOOR at the  other end slowly creaks opens. The boys freeze, then --  TROY (CONT’D)  (afraid)  Go.  BRYAN  You   go, shithead.  A dare. Troy moves forward. His brother follows.  INT. BASEMENT -- CONTINUOUS  A murky soup, the flashlights cut a swath.  The beams illuminate the odd stray cobweb, nothing much down  here. The boys split up to investigate, Troy throwing the odd  snap and pop. Until --  TROY  Check it out.  Bryan approaches and stares with wonder. The flashlights  illuminate a wall of dusty SPECIMEN JARS filled with yellow  viscous fluid. Within the fluid: monstrosities. Severed  deformed hands, feet, a twisted jaw...a horrifying tableau in  the style of Joel Peter Witkin.  Next to the jars: a neat line of surgical equipment. Clamps,  disembowelers, spreaders...all caked in rusty blood.  A moment of awe from the boys. WE SEE (but they don’t)  something move behind them. A flash of white.  Troy picks up one of the jars, studies, it.  2.",
      "characters": [],
      "action_text": "BRYAN  Don’t.  But Troy smashes it against a wall, it shatters.  TROY  It stinks down here. It stinks like  shit.  (beat)  Last summer, when we had a raccoon  stuck in the chimney? That’s what  it smells like. Let’s go find it.  BRYAN  No, it smells bad. I’m going.  Bryan starts off. Troy starts investigating, throwing the  snap and pops. Bryan is half way up the stairs, when the snap  and pops ABRUPTLY STOP.  BRYAN (CONT’D)  Troy?  There is no sound. Then, a faint childish laugh.  BRYAN (CONT’D)  (freaked)  Who’s down here!  Silence. He moves down the creaking steps. Until his  flashlight beam finds...  Troy...eyes wide with fear...his throat ripped out.  Terrified, Bryan feels something behind him. He hears a  noise: breathing. He slowly turns, his beam ILLUMINATES:  A blonde two year old BOY, wearing a Lindberg-era white  christening gown with seed pearls long yellowed. His mouth  and face is smeared with blood, his skin is wrinkled like an  ancient man. The INFANTATA smiles, gurgles...  Then ATTACKS.  The lightlight falls to the ground.  FADE TO BLACK.  A SINGLE WORD POPS UP:   TODAY  INT. DOCTOR’S OFFICE -- DAY  THE SOUND OF RUNNING WATER.   Come up on a TRAY of  INSTRUMENTS.  3. A stainless steel SPECULUM, a large SYRINGE with NEEDLE,  COTTON SWABS, COTTON BALLS, RUBBER GLOVES.   The water stops  and the hands of DR. DAY come into view.   He towels them off,  pulls on the gloves.  DR. DAY  Are your periods regular again?  He messes with the instruments as a WOMAN speaks. It’s VIVIEN  HARMON.  VIVIEN  Pretty much. Every other month.  Dr. Day turns. REVEAL Vivien, gowned, on her back, her legs  in STIRRUPS. She’s pretty, forty, but she looks thirty five.  VIVIEN (CONT’D)  I’m not complaining. After all of  that blood.  Day inserts his gloved fingers into Vivien, beginning his  exam. She takes in a sharp breath.  VIVIEN (CONT’D)  Ben hates blood.  DR. DAY  How are you two doing? Sexual  relations?  Day is clinical.   He’s not looking to get off here.  VIVIEN  Som",
      "dialogue_count": 0,
      "word_count": 1889
    },
    {
      "scene_number": 2,
      "slugline": "INT. HALLWAY  Violet finds Hallie, barking madly at the BASEMENT DOOR.  VIOLET  Shut up!  She won’t.   Violet looks at the door.   It’s BOLTED SHUT.   Old  school bolted.   Two heavy bolts and two HUGE PADLOCKS.  Someone doesn’t want to let anyone in -- or maybe out.  Violet wiggles the doorknob, trying to pry it open.  INT. BASEMENT -- DAY  From the BOTTOM of the steps. POV of something watching the  door move, the knob jiggle. We hear it’s raspy breathing.  INT. HALLWAY  Violet tries the door a few more times, then yanks on the  locks. No luck. She stares at the door, oddly drawn to it.  INT. LIBRARY -- DAY  Marcy shows Vivien and Ben the BEAUTIFUL GOTHIC LIBRARY.  MARCY  This is my favorite room in the  house.  BEN  (to Vivien, trying)  When I saw the pictures of this  room online I thought maybe you  could use it as your music room.  MARCY  You’re a musician?  VIVIEN  I was.  BEN  She’s a cellist. She played in the  Boston philharmonic.  She heads over to the WALL. Something isn’t right.  MARCY  Why did you quit?  There’s an answer, but we’re not going to get it.  11.",
      "characters": [],
      "action_text": "VIVIEN  This wallpaper is coming off.  She goes to the wall, grabs a tiny PEELING PIECE of seagrass  wallpaper and gently pulls it off. It opens a small window to  the ORIGINAL WALL, no bigger than a couple of postage stamps.  VIVIEN (CONT’D)  I think there’s a mural under here.  MARCY  The last owners must have covered  it up. They were modernists.  (then, with difficulty)  Speaking of the last owners, full  disclosure requires me to tell you  about what happened to them.  VIVIEN  Oh God, one of them didn’t die in  here, did they?  MARCY  Yes, actually.   Both of them.  (off their shock)  Murder suicide. I sold them the  house, too. Just the sweetest  couple. You never know I guess.  BEN  So that’s why it’s half the price  of every other house in the  neighborhood.  MARCY  I have a very nice painted lady not  too far from here but you’re going  to get a third of the house for  twice the price if you go that way.  Vivien and Ben aren’t sure. Violet comes in carrying Hallie.  VIOLET  Where did it happen?  MARCY  The basement.  Another beat. Violet grins.  VIOLET  We’ll take it.  Off Ben and Vivien --  12.",
      "dialogue_count": 0,
      "word_count": 393
    },
    {
      "scene_number": 3,
      "slugline": "EXT. HOUSE - EVENING  As MOVERS finish bringing the last boxes in, Marcy pulls the  IN ESCROW sign off of the FOR SALE sign and replaces it with  one that says SOLD.  INT. HOUSE -- MASTER BEDROOM -- NIGHT  Ben comes out the bathroom in his pajamas, happy. Vivien is  still unpacking, there are boxes everywhere. He comes in  behind her, kisses her, she gently moves away.  BEN  Come to bed, we’ll finish this in  the morning.  VIVIEN  I’m worried about Violet. She’s  right about kids being different  out here. She can’t handle another  year of not fitting in.  BEN  You mean you can’t.  (then)  I treat kids like Violet every day.  In three months she’ll have lost  all of the dark eye make up and  combat boots and be walking around  in Birkenstocks with unshaven pits  smelling like patchouli.  She laughs.   He takes her in his arms.  VIVIEN  It doesn’t freak you out at all?  What happened here?  BEN  My repulsion is tempered by the  fact that this house is worth four  times what we paid for it.  VIVIEN  But it’s not like some old lady  died in here. A murder-suicide.  Gives me the creeps just thinking  about it.  BEN  So don’t think about it.  13.",
      "characters": [],
      "action_text": "VIVIEN  That’s your professional advice,  doctor?  BEN  No place is perfect. No place and  no person.  (then)  All I know is that for the first  time in months I feel at home  somewhere. Moving here, buying this  house was the right thing to do for  our family. It’s a good thing and  frankly, we deserve some good after  all the shit we’ve been through.  (then, realizing)  Sorry.  She nods, not sure, but desperate to trust him. He kisses  her. Another fleeting moment, this one of marital bliss, but  she can’t sustain it. She pulls away, leaves him to go do  more unpacking.  EXT. SCHOOL COURTYARD -- DAY  Violet walks through the commons, SMOKING.   She surveys the  scene -- a few kids reliving their grandparents’ Haight  Ashbury fashion mistakes but most are unmemorable. Upper  middle class high school in an upscale urban neighborhood.  She passes THREE pretty girls -- seniors dressed like they’re  twenty-five -- talking up some boys -- LEAH, BECCA and ABBY.  Overhears their conversation --  LEAH  So I let him.  BECCA  Do coke off of your nipples?  LEAH  They were numb for like two days.  They all crack up. Violet tries to disappear into her sweater  as she passes, but --  LEAH (CONT’D)  Hey! Student council passed a rule  against smoking in public spaces.  The girls step in front of her.  BECCA  Second hand smoke kills.  14. Violet puts the cigarette out.  VIOLET  I didn’t know. I’m new.  Violet nervously flicks her butt into a planter. Leah flips.  LEAH  What the hell is the matter with  you? People   sit   here. They   eat  here.  VIOLET  You don’t know me. Why are you  doing this?  BECCA  Leah’s grandma died of lung cancer.  She takes this stuff pretty  seriously.  Leah holds the butt out to Violet.  LEAH  Eat it.  (off Violet’s shock)  Eat it. Or I’m going to kick the  shit out of you.  ABBY  Come on, Leah, it’s enough.  LEAH  No, I want to see her eat it.  She grabs Violet’s face.  BECCA  Seriously, Leah, she’s like twelve.  Leah starts trying to shove the cigar",
      "dialogue_count": 0,
      "word_count": 590
    },
    {
      "scene_number": 4,
      "slugline": "INT. HOUSE -- MUSIC ROOM -- DAY  Vivien drops the NEEDLE on an old record player. Classical  cello plays as she sets out her INSTRUMENTS -- a large bowl  of water, scraping tool, small knife. Slowly and carefully,  she starts removing the old wallpaper.  As she does, the GOYA-ESQUE MURAL begins to reveal itself.  She can’t quite make out the first image -- until she pulls  off one more sliver or paper to see -- A WOMAN, her face bent  in pain, her body twisted and tortured.  Vivien stares at the image, transfixed and disturbed when  suddenly a HAND touches her shoulder. She jumps out of her  skin, turns, sees ADELAIDE, the child with Down Syndrome we  saw earlier, now a woman in her forties.  ADELAIDE  You’re going to die in here.  CONSTANCE (O.S.)  Adelaide!  Constance, Adelaide’s mother enters from the kitchen carrying  a BOX. Constance is a chain smoker, and she sounds like it.  CONSTANCE (CONT’D)  Adelaide. I put that “Dora the  Explorer” on for you so you would  sit and watch it.  ADELAIDE  It was “Go Diego Go.”   I don’t like  it.  CONSTANCE  Brown cartoon characters -- you  can’t tell the difference.  Vivien doesn’t know what to make of this. Finally --  CONSTANCE (CONT’D)  Hi. Hi. I’m Constance your neighbor  --   the tear down next door. This  is my girl Adelaide. Go home Addy.  Now!  Adelaide storms out.  CONSTANCE (CONT’D)  That girl is a monster. I love her  and I’m a good Christian but Jesus  H.  16.  (MORE)",
      "characters": [],
      "action_text": "Christ, if they’d invented some of  those tests a few years earlier...  VIVIEN  How did you get in my house?  CONSTANCE  You left your back door open,  though I have to warn you Addy  seems to always find a way in.  She’s got a bug up her ass for this  place, always has. You got a dog?  VIVIEN  Yes. Is that a problem?  CONSTANCE  Better for me. I run a little  kennel out of my house. Doggy day  care kind of thing. Don’t bother  calling the cops on me -- I’m in  with one of the city managers and  he always looks the other way.  VIVIEN  Look, it’s very nice to meet you  but I wasn’t really prepared for  company.  CONSTANCE  I’m gone. Brought this for you,  housewarming. Addy wanted to cook  you a pie but she tends to spit in  the cooking so I figured this was  better -- should help you get rid  of some of the bad ju-ju.  She hands Vivien the box.  CONSTANCE (CONT’D)  Those homosexual boys were nice  enough and I say live and let live,  but I can’t help but think that  that lifestyle drove them to do  what they did.  (then)  I can’t remember your name.  VIVIEN  I didn’t tell you. I’m Vivien  Harmon.  17.  CONSTANCE (CONT’D) CONSTANCE  Anyway, enjoy, relax, let me know  if you need help with your pup.  Glad you’re getting rid of that  wallpaper. Thought those people  were supposed to be stylish.  She exits. Vivien can’t help but laugh a little at their  oddity. She shakes her head, opens the box to see a TIGHTLY  WOUND BUNCH OF SAGE. A beat, then -- through the window she  sees Constance walking back to her house.  CONSTANCE (CONT’D)  (calling back)  It’s Sage. For cleansing the  spirits in the house. Too many bad  memories in there.  INT. HOUSE -- SAGE MONTAGE -- NIGHT  Vivien moves through the house, the burning sage bundle in  her hand. She’s not sure if she buys this whole cleansing the  spirits thing, but she’s committing. She moves into an  UPSTAIRS HALLWAY --  She hasn’t spent much time in this part of the house yet.  It’s barely decorated and there are even a fe",
      "dialogue_count": 0,
      "word_count": 1538
    },
    {
      "scene_number": 5,
      "slugline": "INT. VIOLET’S ROOM -- DAY  Violet makes another cut.  MALE VOICE  You’re doing it wrong.  She whirls around, revealing --  TATE  If you’re trying to kill yourself,  cut vertically. They can’t stitch  that up.  VIOLET  (freaked)  How’d you get in here?  TATE  If you’re trying to kill yourself  you might also try locking the  door.  He leaves. She stares.  INT. MASTER BEDROOM -- NIGHT  Middle of the night. So quiet you can hear the buzz of the  DIGITAL CLOCK.   Ben and Vivien in bed. Suddenly, from above  we see BEN’S EYES SPRING OPEN. There’s no life behind them  though. He gets up, SLEEPWALKING.  INT. HOUSE -- STAIRWELL -- NIGHT  Ben, NAKED, walks down the stairs.   The house CREAKS, GROANS.  INT. HOUSE -- LIBRARY -- DAY  IN THE SHADOWS we can make out some more of the mural.   It’s  a HELLSCAPE. QUICK CUTS as Ben KNEELS down, turns on the GAS  in the fireplace, LIGHTS a ROLL OF NEWSPAPER, tosses it on  the logs, IGNITING A HUGE FIRE.  He stands, watches the fire.   The room and his naked form  GLOWS.   As if he was reaching for a long lost love he reaches  out to the fire, closer.   Then --  VIVIEN (O.S.)  Ben!  Ben pulls his hand back, turns to see his wife. He’s still  not with it.  23.",
      "characters": [],
      "action_text": "VIVIEN (CONT’D)  What are you doing? You’re naked.  Come back to bed.  BEN  Am I in a dream?  Vivien softens, goes to him, starts leading him back.  VIVIEN  No, you’re sleepwalking.  She leads him out, turns to look at the fire as she does and  catches a glimpse of the MURAL as we...  END ACT ONE  24. ACT TWO  EXT. BACKYARD -- DAY  Vivien hangs BEDSHEETS up on clothes lines, drying them.  It’s peaceful, golden light, an easy breeze. A TALL WOMAN, in  her sixties comes around into the backyard.  VIVIEN  Can I help you?  MOIRA  I’m Moira O’Hara, I’m the  housekeeper.  VIVIEN  I didn’t know the place came with  one.  MOIRA  Why are you hanging your sheets?  Perfectly good electric dryer  inside.  VIVIEN  I don’t like the chemicals in  fabric softener and the organic  ones don’t work. This is the only  way to dry them without static  cling.  Moira’s impressed.  MOIRA  I work Monday through Thursday.  Four hundred a week. If you have a  dinner party and you want me to  serve or straighten up, it’s extra.  Thanksgiving on, Christmas off.  That was the deal with the last  fellows.  VIVIEN  I’m sorry, I’m just not sure if we  need a maid.  MOIRA  What have you been using to clean  the floorboards?  VIVIEN  Murphy’s oil soap.  25. MOIRA  No. White Vinegar. Oil soap kills  the wood. Have you ever owned a  house this old?  VIVIEN  No.  MOIRA  It has a personality, feelings.  Mistreat it and you will regret it.  Trust me, madam, you need me.  (then)  May I come in? My cab’s left and  I’d like to call another.  Off Vivien --  INT. KITCHEN  Vivien brings Moira some TEA.  VIVIEN  You worked for the previous owners?  MOIRA  And the ones before that. I’ve been  the housekeeper here for years.  They come, they go, I stay. My  husband has been ill for some time  so I’m the breadwinner.  (then)  They were both nice boys, the ones  before you. I found the bodies.  VIVIEN  What happened? I mean, I hate to  gossip.  MOIRA  I don’t know. They fought a lot.  Money I think. Who can know when",
      "dialogue_count": 0,
      "word_count": 987
    },
    {
      "scene_number": 6,
      "slugline": "INT. LIBRARY -- LATE AFTERNOON  Vivien carefully works the WALLPAPER off the wall. The mural  is becoming more clear. A WOMAN is dragged into HELL by a  GRINNING DEMON. A BEAUTIFUL MAIDEN is splayed out on a bed  with a MONSTER sitting on her chest. She tries not to take  the images in, she has a job to do.  THE RUBBER MAN appears in the doorway behind her. SOMEONE has  put on the suit. He slowly moves towards her.  POV -- from within the mask.   His BREATHING. He’s almost upon  her.   She’s oblivious -- Jesus fucking Christ, turn around!  Finally, she does --  VIVIEN  Violet! Can you take Hallie out?  He’s gone. Nothing.   She senses something odd, but then  brushes it off, goes back to her work.  INT. BEN’S HOME OFFICE -- DAY  Tate is in session, Violet spies through a partially cracked  door.  BEN’S VOICE  Are you taking the medications?  TATE  Yes.  He is aware of Violet, turns and looks at her. She takes in a  little gasp, he’s so handsome.  BEN’S VOICE  Thoughts of suicide?  TATE  Not lately. I met somebody.  Off Tate and Violet, eye-locked --  INT. VIOLET’S ROOM -- LATER  Post session. Music by The Smiths plays. Tate and Violet sit  on the floor, their sleeves rolled up. He’s showing her his  cutting scars.  TATE  This one I did when my dad first  left. I was ten I think.  (points to another)  29.  (MORE)",
      "characters": [],
      "action_text": "This one a year later. New school.  Got beat up.  Violet shows him her most recent cutting.  VIOLET  Last week, first day at my new  school which sucks.  TATE  Westfield?  VIOLET  Yep.  TATE  The worst. I got thrown out of  there.  VIOLET  I hate it here. I hate everyone.  All their bougie designer bullshit,  the east coast was much cooler. At  least we had weather.  TATE  I love it when the leaves change.  VIOLET  Me too.  They stare at each other, wildly attracted.  TATE  Why’d you move here?  VIOLET  My dad had an affair. My mom  literally caught him in the act.  INT. BOSTON HOUSE -- DAY -- FLASHBACK  Vivien climbs the stairs. She pushes the door open with the  knife, we see what was withheld from us. HER POV: Ben fucking  a blonde GIRL in her earlier 20s. Ben looks at her, we see  the pain in his face. The regret and self-loathing.  INT. VIOLET’S ROOM -- DAY  TATE  That’s horrible. If you love  someone you should never cheat on  them, or leave them. Never.  30.  TATE (CONT'D) VIOLET  Right? I know. And the worst part  is that six months earlier my mom  had, like, this brutal miscarriage.  The baby was seven months old, we  had to have this macabre funeral.  TATE  I’m sorry.  He takes her hand. She’s thrown at being touched.  VIOLET  Why are you seeing my dad?  TATE  Don’t ask questions you already  know the answer to. You’re smarter  than that.  She nods, it’s true. She looks down at her hand in his, she  feels self-conscious. The song ends on her iPod player.  VIOLET  You like Craven? It’s a new band.  TATE  I’ve never heard of them.  She gets up to play them.  VIOLET  They’re really cool, they’re from  Oregon, the lead singer is dyslexic  and a vegan...  She turns. Tate has left the room.  INT. KITCHEN -- DAY  Vivien comes in, is shocked by Moira’s OLD LADY ASS. She’s on  her hands and knees, SCRUBBING THE FLOOR.  VIVIEN  Um...Moira, you don’t need to do  that.  MOIRA  These old floors are finicky.   You  have to treat them right.  The SPIDER VEINS are showing",
      "dialogue_count": 0,
      "word_count": 855
    },
    {
      "scene_number": 7,
      "slugline": "EXT. HOUSE -- BACKYARD -- DAY  Ben runs out, searches for the man through the sheets, but  he’s gone. It’s like he was never there.  INT. HOUSE -- KITCHEN -- DAY (LATER)  The kitchen, gleams, spotless. Vivien enters with a bag of  groceries, takes a second to appreciate her ordered home.  She sets the bag on a counter, takes out a jug of orange  juice. There is the sudden firecracker sound of SNAP and  POPS. Vivien jumps out her skin, turns and SCREAMS.  ZOOM WIDE: every cabinet door and drawer HAS BEEN OPENED.  Reveal Adelaide, giggling maniacally at the screen door. As  she covers her mouth, amused by the horror we...  END ACT TWO  33.",
      "characters": [],
      "action_text": "ACT THREE  INT. KITCHEN -- DAY  Adelaide sits quietly with her mother, looking intensely at  Hallie, who is eating her dinner in a corner. Vivien and Ben  sit across from them. Vivien leans in, intense.  VIVIEN  I want you to stay out of my house,  do you understand?  CONSTANCE  Can I smoke in here?  VIVIEN  No.   (then)  Adelaide, answer me please.  Adelaide suddenly looks up at them, like an innocent child.  ADELAIDE  Can I pet your dog?  VIVIEN  No. I want you to stop coming into  my house and opening things and  telling me I’m going to die.  BEN  She said that?  CONSTANCE  She says that to everybody. Addie,  say you’re sorry.  ADELAIDE  No. I didn’t do anything wrong.  They did it.  VIVIEN  Who?  ADELAIDE  The Mischief twins.  Constance takes a beat, this lands. She quickly covers by  twirling her finger around her ear, the universal symbol for  crazy.  ADELAIDE (CONT’D)  Can I pet your dog?  34. Vivien snaps. She takes Adelaide’s face in her hands and  focuses her.  VIVIEN  Adelaide, listen to me. I want you  to stop coming in my house without  permission, am I clear?  BEN  (she’s gone too far)  Vivien.  VIVIEN  Am I clear?  ADELAIDE  (quiet)  Yes.  VIVIEN  Thank you.  She releases her. Adelaide goes to the door to leave, but  then suddenly races over to pet the dog. Hallie, eating and  territorial, bites her.  BEN  Hallie!  VIVIEN  (frantic)  Are you okay?  Adelaide stands there for a beat, her face darkens.  ADELAIDE  She shouldn’t have done that.  She exits. Constance quietly gets up, heads for the door.  CONSTANCE  Sorry about all this.  (then, to Vivien, matter  of factly)  Touch my kid again, I’ll break your  goddamned arm.  She leaves.  INT. HOUSE -- OFFICE -- DAY  Ben, in his chair. Into his TAPE RECORDER, about Tate --  35. BEN  Patient shows numerous signs of  sociopathic behavior -- grandiose  sense of self, lack of remorse.  High intelligence makes it  difficult to determine if symptoms  are actual or created as a front  for deeper psychosis...  You",
      "dialogue_count": 0,
      "word_count": 2587
    },
    {
      "scene_number": 8,
      "slugline": "INT. HOUSE -- KITCHEN -- NIGHT  QUIET. The clock on the wall TICKS from twelve-ten to twelve-  eleven AM. MOVE THROUGH THE HOUSE --  INT. UPSTAIRS HALLWAY -- NIGHT  Dark.  INT. LIBRARY -- NIGHT  Lit by a single LAMP.   The silence broken by Vivien’s  excessive SCRAPING. She peels off the LAST SCRAP of  wallpaper. Stands back to take in the WALL.  INT. MASTER BEDROOM -- NIGHT  Ben has fallen asleep reading. His eyes OPEN. The same  unconscious zombie-like awake he was the night of the  fireplace.  INT. LIBRARY  SLOW PULL BACK to finally reveal...The WALL -- if the Anti-  Christ had a Sistine Chapel, this is what would adorn the  ceiling. It’s a painted prayer to PAIN. Vivien is oddly  undisturbed by the images of torture, murder, RAPE.  As she loses herself in the mural we see Ben SLEEPWALK behind  her, unseen, into the KITCHEN.  INT. KITCHEN  Ben, at the stove. TURNS ON THE BURNERS -- all of them.  INT. BEDROOM -- NIGHT  A TOILET FLUSHES and Vivien, in her pajamas, comes out of the  bathroom, rubs lotion on her arms. Ready for bed.  She looks up, jumps when she sees THE RUBBER MAN standing  silently in the doorway. A beat, then a smile --  VIVIEN  Hot. I thought I told you to throw  that thing away.  The Rubber Man is silent.  INT. KITCHEN -- NIGHT  Ben leans down. Eye level with the BLUE FLAMES. They HISS.  He reaches his hand out.  47.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 244
    },
    {
      "scene_number": 9,
      "slugline": "INT. BEDROOM -- NIGHT  The Rubber Man just stands there. Vivien laughs.  VIVIEN  I have to admit, I’m giving you  points for creativity.  (then)  You were pretty hot this afternoon.  Wanna go for a two-peat?  She gets into bed. Pulls off her pajamas. Rubber Man moves  towards her.  VIVIEN (CONT’D)  You going to take the suit off?  (off his head shake “no”)  Okay, whatever, I can be kinky.  The Rubber Man approaches, RIGHT INTO CAMERA.  INT. KITCHEN -- NIGHT  Ben lowers his hand, into the flames. It BLISTERS, CRACKS.  No response.   Like it’s happening to someone else.  INT. BEDROOM -- NIGHT  The Rubber Man, on top of Vivien. FUCKING HER. It feels so  good, but it HURTS -- not just physically. She can feel the  darkness of the Wall inside of her.   Her head is back, a tear  rolls down her cheek. He FINISHES and stops moving.  INT. KITCHEN -- NIGHT  Ben’s hand is being burned by the flames. His flesh bubbles.  INT. BEDROOM -- NIGHT  The Rubber Man is gone. Vivien pulls up her pajama pants.  She’s emotional, vulnerable. Gets under the covers, turns out  the light as Ben enters, still SLEEPWALKING. He gets into  bed. She rolls over. On her face.  VIVIEN  Good night. I love you.  Ben stares off into space.  BEN  Love you, too.  END ACT THREE  48.",
      "characters": [],
      "action_text": "ACT FOUR  EXT. HOUSE -- AFTERNOON (LATER)  A hand pushes open the gate. REVEAL Leah, who stops and  stares at the house.  INT. LIBRARY -- DAY  Vivien takes her cello out of its case, looks at it. She  hesitates, sits with it, slowly begins to play a John Cage  solo. It’s passionate, full of all her unexpressed feelings.  An exorcism. INTERCUT the dramatic bowing of her cello with --  INT. HOUSE -- BASEMENT  From the bottom of the stairs, looking UP at the door.   The  sounds of muffled talking. The locks being UNLOCKED. The door  opens. Violet and Leah look down from above.  LEAH  What’s down there?  VIOLET  My stash. My parents toss my room  every week.  Leah’s not sure.   Violet, playing it cool, starts down.  LEAH  If you’re screwing with me...  Violet disappears down the stairs. Leah does NOT want to go  down there.   Violet reaches the bottom -- turns --  VIOLET  It’s just a basement.  Fuck it. Leah comes down. Leah’s POV, following Violet.  VIOLET (CONT’D)  I found the best hiding place.  This is great shit, too.   A lot of  the coke coming into the US from  Central America is smuggled in on  lobster boats in Gloucester. I used  to show my boobs to one of the  lobsterman in return for a key or  two before they cut it.  They come around a corner, find TATE, sitting on a RUSTED  MEAT FREEZER.  49. LEAH  Who the hell are you?  TATE  So this is the coke whore.  SLOW MOTION -- Leah looks eyes with Violet. She can see it in  Violet’s face -- things are about to get scary for her.   She  flees. Too slow. Tate grabs her.  TATE (CONT’D)  (to Violet)  Get the light!  Violet TURNS OFF the light.  INT. LIBRARY  Vivien’s solo moves toward a crescendo. The bow almost burns.  INT. BASEMENT  Now it’s just sounds.   Leah fighting. Tate laughing.  VIOLET  It’s enough, Tate.  Violet’s BUMPED to the ground. We can hear the wind being  knocked out of her. Leah’s screams become more desperate.  LEAH  Oh, God!   Get it off of me!   Please  God get it off of me!  VIOLET  What’s happe",
      "dialogue_count": 0,
      "word_count": 2367
    }
  ]
}