{
  "slug": "american-ultra-2015",
  "title": "american ultra",
  "genre": "comedy",
  "format": "film",
  "scenes_count": 5,
  "characters_count": 0,
  "characters": [],
  "total_words": 13037,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. WASHINGTON DC NIGHTCLUB - THE BATHROOM 45   45  Douglas is peeing at a urinal, when his phone rings.   He answers it without looking. DOUGLAS This is the jiff-master, how can I help you. EXT. LIMAN SHERIFF’S STATION - CONTINUOUS 46   46  Lasseter stands over Crane’s dead body, in front of the burning police station. LASSETER Be somewhere you can talk.   Now.  DOUGLAS (quietly) Shit. EXT. WASHINGTON DC NIGHTCLUB - ALLEY - MOMENTS LATER 47   47  Douglas comes out into the alley behind the nightclub. DOUGLAS Okay Diane, what’s- WE INTERCUT LASSETER I’m in Liman. DOUGLAS  -Say what now-  LASSETER  Yates is using the Toughguy assets to eliminate the Wiseman assets.  I’m trying to save asset Howl and derail the operation but now Yates has got the town quarantined by the CDC and I am looking at the town’s Sheriff Station, which is on fire with the entire civilian police force dead inside it. Douglas takes a beat, and actually pulls his phone away from his face, staring at it in shock.  44.",
      "characters": [],
      "action_text": "DOUGLAS I don’t understand, why would you- I shouldn’t be talking to you if you’re there, that’s- LASSETER I need a weapon.   And I need to know where Yates was pulling the subjects for Toughguy.   This behavior doesn’t make sense. Douglas is quiet. LASSETER (CONT’D) There is no reason for that police station to be ON FIRE, okay?   Do you see what I’m saying?   If they’re trained assets they should be doing this quickly and quietly- DOUGLAS I have to hang up, I’m sorry- LASSETER Don’t hang up don’t hang up don’t hang up- Douglas groans, seeing the hot girl group departing from the front of the club. LASSETER (CONT’D) He’s boxing me into this town and he’s going to trap me like a rat and kill me, Pete, do you understand that?   I will be murdered and he will be protected by our own secrecy laws for MURDERING ME. Firetruck sirens begin rapidly approaching the burning sheriff’s station, and Lasseter quickly goes around to the side of the station, hiding from the arriving trucks. DOUGLAS (long beat) You shouldn’t have gone. LASSETER No, wrong response. (beat) There is a machine at work here, Douglas.  45.  (MORE) A big, bad machine, and it’s gone off the rails, you are witnessing  the wrong guy in charge , that’s what’s happening,   Madness of King George   do you understand- DOUGLAS Yes shakespeare sure- LASSETER  No, actually happening right now, tonight, now!  Helicopters blow past overhead.   The firefighters who’ve congregated around Crane’s dead body, and look up, confused. LASSETER (CONT’D) This is fire and brimstone, this is sinister lunacy sanctioned by arbitrary nothing,   I need you on my side , the side of good and order and NOT DEATH AND CHAOS,   fuck the chain of command .   On MY SIDE, RIGHT NOW, understand? Douglas is silent.   He looks around the alley.   There’s a couple hooking up by a dumpster.   He glances again, and realizes they are full on fucking. Whoa, gross. He sighs, mustering his courage, looks up at the sky... LASSETER (CONT’D) Did you hang",
      "dialogue_count": 0,
      "word_count": 542
    },
    {
      "scene_number": 2,
      "slugline": "EXT. ROSE’S HOUSE - NIGHT 48   48  Mike and Phoebe pull up to Rose’s house, which is a two-story deal out in the woods, isolated, a little bit hood but a little swanky too, in its way. They park on a landbridge over a ruddy little ravine.   Phoebe looks over to Mike, who looks totally miserable. PHOEBE You seem like...spooky quiet- MIKE I   am   spooky quiet.   I’m in the...anaphalactic shock- PHOEBE -that’s not what it’s called- MIKE Like, I’m trying to think of stuff, and I can’t think of   anything,  Phoebe.   Like I never even- I can’t remember where I went to school, or my parents... PHOEBE What?   You can’t remember your parents?   What’re you talking about, you sound crazy, dude- MIKE I’m like overwhelmed!   Pheebs...Did we even ever talk about my parents? PHOEBE I mean...no I guess but- MIKE  Shit , what if I’m like... (beat) A robot?   Do you think that’s possible that I’m a robot? With the- gigabytes of memory recall, and the karate programming where I use house hold objects to kill assholes- Oh shit   I’m freaking out again-  PHOEBE Okay stay calm.   Mike.   Listen. You are not a robot. MIKE Are you sure?  47.",
      "characters": [],
      "action_text": "PHOEBE I’m sure, you are   not   a robot. MIKE How can you know that? PHOEBE ...Because that is   obviously retarded.  MIKE ...Right, yes, you’re right.   Shit-  A GAS MASKED FIGURE POPS UP NEXT TO THE CAR WITH A SHOTGUN POINTED IN.  PHOEBE AHH!   MIKE FUCK! TWO MORE GUYS POP UP ON EITHER SIDE OF THE CAR WITH A COUGAR MAGNUM AND AN UZI. ROSE (under gas mask)  YO FREEZE MOTHAFUCKAAA-   OH HI MIKE!  Rose lifts his gas mask, smiling. PHOEBE (freaked out) JESUS CHRIST. EXT. GOVERNMENT FIELD OPS CENTER - NIGHT 49   49  The field ops center is set up in a Wal-Mart parking lot, in a big tent.   It’s clearly still in the process of being set up; computers and government operators everywhere. Several teenagers are hanging out, smoking cigarettes nearby. Yates rapidly walks up. YATES What the fuck is this? INT. GOVERNMENT FIELD OPS CENTER - MOMENTS LATER 50   50  Yates bursts in, and immediately several officers stand and salute.   Among them is Otis. OTIS Mr. Yates sir-  48. YATES I said SUBTLE, I said COVERT, not PITCH A TENT IN A PARKING LOT. OTIS Sir the tent is covered by FEMA protocol, the tent is covert as a disease control tent sir- YATES  IT’S A BIG WHITE TENT.   It’s covert as a fucking elephant! OTIS Sir civilians will not recognize the big white tent as a government operation, they’ll- mistake it for- YATES I get the concept, but there are- Yates pops out of the tent into the PARKING LOT And references the teenagers. YATES (CONT’D) HIPSTERS HANGING OUT TEN FEET FROM THE OP CENTER! Otis looks out. OTIS They’re punks sir. YATES ...What? OTIS They are not hipsters, sir, they look to me like skate punks sir, possibly grunge- YATES  Ohmigod.  One of the kids takes a camera phone picture of them. YATES (CONT’D)  Get that phone.   Now.   Thank you.  Immediately several soldiers take a running start at the teenagers, who are like “oh shit.”  49. YATES (CONT’D) Where are the assets? SLAM TO: INT. EIGHTEEN WHEELER - SECONDS LATER 51   51  It’s dark, and then the door opens,",
      "dialogue_count": 0,
      "word_count": 2365
    },
    {
      "scene_number": 3,
      "slugline": "INT. ROSE’S HOUSE - GYM 59   59  Phoebe is up in the ceiling, her legs dangling out, trying to get further in, while Mike keeps watch. MIKE We shouldn’t be doin’ this.   We should just wait, Rose’ll come around, he’s a good guy, you’ll see- PHOEBE  No , Mike, we are not waiting around here on the judgment of your DRUG dealer. MIKE Well what are you gonna do? PHOEBE I’m gonna crawl- unh- further in and see if I can get to the next room, and then- MIKE Shh. PHOEBE What? MIKE Do you hear that? INT. ROSE’S HOUSE - LIVING ROOM 60   60  Rose, Harold and Quinzin turn, watch as some sort of curtain drops down over all the windows to the outside. ROSE ...the fuck is this? EXT. ROSE’S HOUSE - CONTINUOUS 61   61  The entire house has been tented, like for fumigation.  BOURBON , an asset with marine-style red mohawk, stands outside of Rose’s tented house.   He’s activating some sort of fumigator, which is pouring a green fog into the house BOURBON Puff, the magic dragon, lived by the sea...  60.",
      "characters": [],
      "action_text": "A second figure steps into frame. INT. ROSE’S HOUSE - LIVING ROOM - CONTINUOUS 62   62  The fog is starting to come in. ROSE  What the fuck is going on...  Rose stands, and there’s a noise at the door-   ALL THREE MEN OPEN FIRE ON THE DOOR, BLASTING IT TO PIECES AS THE GREEN FOG BEGINS TO ROLL IN-  IN THE GYM Phoebe’s almost all the way up in the ceiling as the sounds 63   63  of gunfire blare out from the living room. MIKE Oh no.   Not again man, not again! IN THE LIVING ROOM Rose, Harold and Quinzin are out of ammunition, frantically 64   64  reloading their guns. QUINZIN Were we shooting at nothing- ROSE Nah, hell nah, there’s something, there’s- The lights cut off for a moment.   When they come back up, a new figure stands in the room. It’s a skinny, muscular man wearing a sleeveless bullet proof vest.   His skin is covered in do-it-yourself tattoos, the scribbling of an insane person, but his hair is short, military cropped. This is   NEWTON.   He raises a sawed off shotgun. ROSE (CONT’D) ...now who’s this freaky motherfu-  NEWTON BLASTS ROSE.  61. Rose is knocked violently backwards by the blast, Big Harold raises the magnum, and Newton   dodges three shots , sharply tilting and leaning his body as he swiftly crosses the room to Big Harold, hopping over furniture and strikes him once in the face, killing him, then tucks rolls and somersaults up to strike Quinzin, who’s still trying to reload once in the side of the head, killing him as well.  Newton killed everyone in the room in roughly four seconds. He pulls on a gas mask, and turns to the gym door as green fog rises all around him. INT. ROSE’S HOUSE - GYM - CONTINUOUS 65   65  Phoebe pulls herself all the way up into the ceiling as the door   BURSTS OPEN   and Newton comes into the blacklights. He raises Quinzin’s magnum, and Mike dodges   two blasts   as they both move towards each-other;   again BAM BAM BAM krav maga exchange of hits before Newton KICKS MIKE TO THE GROUND!  Phoebe, in the ceiling above hi",
      "dialogue_count": 0,
      "word_count": 4343
    },
    {
      "scene_number": 4,
      "slugline": "EXT. PHOEBE’S HOUSE - DAWN 82   82  Mike approaches, Lasseter following him, angry.   The sun is just starting to rise. LASSETER I am begging you, BEGGING you not to go in there, he could have snipers taking aim at us right now- MIKE Then let them shoot us, who cares- LASSETER I CARE, I don’t want to die, and I don’t want you to die either- MIKE I’m going home, I’m going to sleep- LASSETER WHAT ARE YOU TALKING ABOUT?   Mike you can’t do that, we have to keep you alive until someone at the Pentagon can see what’s happened, can rectify- MIKE WAIT?   That’s your plan?   You’re as stupid as the other guy!   Did you call anyone?   Is anyone even listening to you?   Have you ever been on like, missions and shit, are you a secret agent or just like, a desk person?   Do the people at the Pentagon even know you’re here?   Does anyone even care? Lasseter is silent. MIKE (CONT’D) You’re both fuckin crazy, crazy people.   I have accepted that I am going to die, okay?   I’m not even the person I thought I was, and my whole life is total bullshit, so who cares, right?   WHO CARES?   If I die, I’m gonna die stoned, in my bed, you can go or you can stay. Mike unlocks his front door, and Lasseter steps back, raising her shotgun.  82.",
      "characters": [],
      "action_text": "But he enters without incident.   Lasseter looks around, helpless, and then follows him inside. EXT. THE SKY - CONTINUOUS 83   83  The MQ-9 strike drone banks and turns around in the sky. AT THE PENTAGON Yates sits with a laptop, communicating with Airforce command 84   84  via video chat. AIRFORCE COMMAND Repeat, confirm target coordinates 58-91-10 local. DOUGLAS Confirm. AIRFORCE COMMAND Targeting in progress, awaiting confirmation to strike. Douglas’ cell phone rings, and he lifts it, answering it without looking. SCOTT Hey Pete, it’s Scott. Douglas’ face freezes, realizing he made a mistake answering. INTERCUT WITH Scott at home. SCOTT (CONT’D) Do you know where my mom is?   She didn’t come home last night- Douglas hurriedly hangs up, and then chucks the phone across the office; a young CIA woman is coming in, and it smacks her in the face; she spills her coffee and falls on the ground. Douglas instinctively ducks behind his desk. AIRFORCE COMMAND Douglas?   Agent Douglas? Douglas peeks up over the desk. DOUGLAS Still here.  83. INT. PHOEBE’S HOUSE - BEDROOM 85   85  Mike picks up the horrible stuffed bear, and goes into the bedroom.   He sits down on the bed, hugging it.   He stares at his feet.   After a moment he begins crying. IN THE LIVING ROOM Lasseter is standing awkwardly with her shotgun, looking around, nervous.   She notices all the pictures of Rocket Monkey and Chip the Brick on the ground. LASSETER Who’s Rocket Monkey? Mike, still crying in the other room, shouts back a response. MIKE He’s a monkey astronaut, I made him up.   He goes on adventures. Lasseter looks down, ashamed, sad. LASSETER You know, Selburg was supposed to come back in. Mike blinks, annoyed. LASSETER (CONT’D) When you were in the program, she was your number one.   As all the other assets in the program failed out, you just kept suceeding...She had so much faith in you.   She believed in you, and you showed her kindness, warmth, even then. Phoebe didn’t have a lot of that, growing",
      "dialogue_count": 0,
      "word_count": 3569
    },
    {
      "scene_number": 5,
      "slugline": "INT. WAL-MART - CONTINUOUS 109   109  Laugher is looking around the burning Wal-Mart. LAUGHER Were you crazy too?   Were you a person who was exceptional like me or are you a different type of exceptional, do you...can you move me?   Will you move me?   I feel like I need to be moved, you know, please   move me- MIKE ATTACKS- LAUGHER BLOCKS-  Listen, I’ve written a lot of action here.   You know it, I know it, and I want this script to be under 110 pages because, c’mon, it’s Stoner Bourne, not Kafka.   This isn’t Kafka, okay? They have guys...There are like, fight coordinators, guys who can make this look awesome.   This isn’t a comic book.   We all know ultimately it’s going to come down to what we can shoot on the day anyway, right? So just take my word for it that the fight between Mike and Laugher makes any of the action in the new James Bond films look like fucking 1960s Batman.   It’s violent, it’s incredible, they beat the living shit out of each other, and it ends with them  REPEATEDLY STABBING EACH OTHER WITH SCREWDRIVERS before Mike BURIES A CLAW HAMMER INTO LAUGHER’S FOREHEAD,   and then collapses, seemingly dead. EXT. BACK OF WAL-MART - CONTINUOUS 110   110  Yates is running, frantic.   He gets about twenty feet, repeatedly looking behind him, spinning and running   STRAIGHT INTO KRUEGER.  KRUEGER Hello Adrian. INT. WAL-MART - CONTINUOUS 111   111  Phoebe slowly moves through the back of the burning Wal-Mart, discovering Mike laying face down on the ground. PHOEBE Mike.   Mike.   Hey.  99.",
      "characters": [],
      "action_text": "MIKE Hey Phoebe. PHOEBE Do you want to...leave Wal-Mart? MIKE ...Yeah...I guess, yeah. EXT. WAL-MART - MOMENTS LATER 112   112  Phoebe, supporting Mike, exits Wal-Mart, and is immediately HIT BY MULTIPLE SPOTLIGHTS. She squints against the light, and turns, seeing Krueger, nearby, surrounded by Seal Team 6, with Lasseter and Yates handcuffed on their knees in front of him. Phoebe looks around, dazed. The Wal-Mart burning behind them, Black Hawk choppers in the air overhead, dozens of military vehicles and cop cars are parked into the lot, it’s CRAZY.   They are ready to take down God himself out here. PHOEBE I wanted you to break your training.   You know that right?   I wanted you to come to Hawaii with me, I hoped you’d be able to get through it, I believed in you- MIKE I know.   Lasseter told me. PHOEBE What?   Lasseter, you saw Lasseter- Mike drops to one knee, clearly about to pass out. PHOEBE (CONT’D) Mike, are you- He produces the ring box. MIKE Are you want to...marry me? Phoebe looks around, breathing hard, and immediately begins to cry, wiping blood off her face.  100. MIKE (CONT’D) Don’t cry.   It’s perfect.   This is all just...this is perfect. PHOEBE I’m sorry... MIKE Don’t say sorry.   Just say yes. PHOEBE ...Yes. THEN A   SYMPHONY OF CLICKING GUNS.  MIKE (thrilled) Hey!   SHE SAID YES!   WOOO- Mike is   HIT WITH A BOUT A MILLION TAZERS, DROPPED INSTANTLY.  HARDCUT TO: INT. INTERROGATION ROOM 113   113  The room is spotlessly clean and empty, save for a stainless steel table and two chairs.   In one of them is Mike. He’s been cleaned up and bandaged, but he’s still a total mess.   Bloody, slightly burnt finger tips drumming away on the steel, but other than that, he’s motionless. The door opens, and a young CIA   ANALYST , in a suit and looking very official, comes in carrying a file, and sits down across from the Mike. HARDCUT TO: INT. GOVERNMENT CAR - BACKSEAT 114   114  Yates and Lasseter, still all fucked up, are being driven somewhere.   They’re l",
      "dialogue_count": 0,
      "word_count": 2218
    }
  ]
}