{
  "slug": "annihilation-2018",
  "title": "annihilation",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 10,
  "characters_count": 0,
  "characters": [],
  "total_words": 22971,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. LIGHTHOUSE - NIGHT  The meteor has almost burned to nothing before it impacts.  What was a vast lump of extraterrestrial rock is now barely  an ember.  A SPARK.  Then it hits the ground by the LIGHTHOUSE...  ... drilling into the earth like a bullet hole.  CUT TO -  - an alien form.  A creature from another world.  It has tendrils.   It shimmers with iridescent colour.   It has  immense fractal complexity in its shape.  And it’s moving.   Gently, like a sea anemone in a swell.  Beats pass.  Then we hear a woman’s voice.  WOMAN (O.S.)  This is a cell.  As we watch, the alien creature starts to divide.  WOMAN (O.S.) (CONT’D)  Like all cells, it derived from an  existing cell.  The creature is now half-way through the division, separating  into a mirror of itself.  WOMAN (O.S.) (CONT’D)  By extension, all cells were  ultimately derived from one cell.  A single organism, alone on planet  Earth, perhaps alone in the  universe, about four billion years  ago.  The creature completes its division.  Immediately its two halves start the same process again.  WOMAN (O.S.) (CONT’D)  One became two.   Two became four.  Then eight.   Sixteen.   Thirty two.  3.  (MORE)",
      "characters": [],
      "action_text": "The rhythm of the dividing pair,  which becomes the structure of  every microbe, blade of grass, sea  creature, land creature, and human.  The structure of   everything   that  lives -  CUT TO -  INT. JOHNS HOPKINS MEDICAL SCHOOL/SEMINAR ROOM - DAY  - LENA KERANS.  Thirty years old.   Recently completed her doctorate, now  teaching a seminar class of first-year MEDICAL STUDENTS.  LENA  - and everything that dies.  Beat.  LENA (CONT’D)  As students of medicine, as the  doctors of tomorrow, that’s where  you come in.  She gestures to the screen behind her - which shows the  electron microscope images that we have been watching.  LENA (CONT’D)  The cell you’ve been looking at is  from a tumour.   Female patient,  early thirties, taken from her  cervix.   Over the course of the  coming term ...  LENA pauses.  A couple of the MED STUDENTS look up from their note-taking,  aware of the silence -  - and see that their tutor has been momentarily distracted.  Her head is turned to the window -  - where outside, above the tree tops, a FULL MOON hangs in  the blue sky.  The image of the MOON in daylight is gently surreal.  Arresting, because the sky is so cloudless and clear.  Almost absently, LENA’S hand goes to her neck, and her  fingers lightly touch a SILVER LOCKET that hangs from a  slender chain.  As the silence extends, the STUDENTS exchange a glance.  4.  WOMAN (O.S.) (CONT’D) Then LENA’S focus returns.   Becomes aware she has zoned out.  LENA (CONT’D)  ... Excuse me.  She picks up the thread.  LENA (CONT’D)  Over the course of the coming term,  we will be closely examining these  cancer cells   in vitro , and  observing autophagic activity.  EXT. JOHNS HOPKINS MEDICAL SCHOOL/CAMPUS - DAY  LENA walks across the campus.  A man in his forties jogs up to her.  DANIEL MAITLAND.  DANIEL  Lena.  LENA  Dan.  LENA doesn’t break stride, so he falls in beside her.  DANIEL  I keep looking for you at lunch,  but you never seem to be around.  LENA  I’ve been catching up on some  wri",
      "dialogue_count": 0,
      "word_count": 705
    },
    {
      "scene_number": 2,
      "slugline": "EXT. SUBURB - DAY  Bright, flat sunlight pushes through tree tops.  A broad road.   Detached houses.   Green lawns.  Two children on push-bikes glide down the sidewalk.  INT. HOUSE - CONTINUOUS  A quiet house.  Stillness in the rooms.  Photographs in the BEDROOM show a couple.   LENA, with a man  in his early thirties.   KANE.  KANE is a soldier.   Images show him in uniform, with  comrades, in a baked landscape of rock and dust.  He smiles easily at the camera.   Full of life in these frozen  snapshots.  One of the images shows a wedding.   LENA in white.   The  couple embracing.  Another shows the couple in Verona.   Perhaps the honeymoon.  INT. HOUSE/LIVING ROOM - CONTINUOUS  LENA sits on the sofa.  Legs curled beneath her.  In one hand, she holds her SILVER LOCKET.  It’s open.   Inside is a PHOTO of KANE.  She gazes at it.  We can feel LENA’S effort to modulate her breathing.  Inhaling and exhaling through parted lips.  Less controlled, tears spill down her face.   Down her cheeks  and neck.   Into the corner of her mouth.  TITLE:  ANNIHILATION  Then, into the quiet and stillness, MUSIC intrudes.  7.",
      "characters": [],
      "action_text": "CUT TO -  INT. HOUSE/GARAGE - DAY  - the garage.   Full of dust and boxes and junk.  LENA pulls stuff from shelves.   On a mission.   Searching for  a particular half-collapsed cardboard box.  Inside: tins of paint and a roller.  CUT TO -  INT. HOUSE/BEDROOM - DAY  - the speakers from which the MUSIC is playing.  - the framed photographs of LENA and KANE, which are now off  the walls, and stacked on the landing.  - a PLASTIC SHEET as it rises up, billows, then settles over  the DOUBLE BED.  - a flathead screwdriver pushes under the rim of a tub of  paint and pops the lid.  LENA runs a primed roller over the wall.   Leaving a fat white  stripe over the old colour.   Flecking her shirt and face with  paint.   Smearing it off her forehead with the back of her  hand.  Repainting the room is an act of moving on.  She is energised.   Focused.  So focused -  - that she doesn’t see the figure that appears in the doorway  of the bedroom.  KANE.  He seems different to the photos.   In uniform, but bloodless  in his complexion.   Older in his gaze.  He watches LENA painting.  Oddly blank.   Not announcing his presence -  - until she turns, needing to reload the roller -  - and sees him.  First, she jolts at the sight of the figure.  Second, she recognises him.  8. LENA  (whispers)  Oh God.  The roller slips from her hand.  Lands with a wet slap on the floor.  She walks towards KANE.  Puts a hand on his cheek, in the way she might touch a clear  window to see if it holds a pane of glass.  Then she grabs his face with both palms.   Kissing him as she  talks.  LENA (CONT’D)  Oh God, oh   God   - I thought you were  gone -   gone forever -   forever .  She’s crying, laughing.  He isn’t.  CUT TO -  - the two of them falling down to the paint-flecked plastic  sheet over the double bed.  LENA on top, pulling off her shirt, pulling at KANE’S belt  and trousers.  They start making love.  But her passion remains completely unmatched by him.   He is  glazed and distant.   No more than co",
      "dialogue_count": 0,
      "word_count": 3490
    },
    {
      "scene_number": 3,
      "slugline": "EXT. SOUTHERN REACH FACILITY/VIEWING PLATFORM - DAY  LENA makes only five or six steps into the sunlight.  Then -  - slows.  And stops.  Arrested by the view in front of her.  REVEAL that LENA is standing on a VIEWING PLATFORM.  Essentially a massive balcony, which projects from the MESS  HALL, three stories above the ground.  And the facility from which she has escaped turns out to a  kind of gatehouse structure - like a medieval castle, dragged  into a brutalist Twenty First Century.  Either side of the facility, a concrete wall extends.  Massive, buttressed, punctuated with watch towers.   It looks  designed to contain or defend against something mythic in  scale.  This would be a stunning sight in its own right - but it’s  the view from the platform that stopped LENA in her tracks.  It shows a landscape, behind which the sun sets.  A stretch of bare ground, for a few hundred yards beyond the  concrete wall, leading to a dense forest.  And in front of - or permeating - the forest, there is a  shimmer .  Similar to a heat haze - it gives a glassy liquid quality to  everything seen through its prism.  But unlike a heat haze - and like a prism - it splits light.  So, through the shimmer -  - the sun distorts into a deliquescing orange orb, fringed  with chromatic aberrations of blue and green.  - the colours on the clouds split into a full rainbow  spectrum, spread across the sky like psychedelic Northern  Lights.  - the trees in the forest distort gently, as if pushed by a  gentle wind that eases the trunks into movement, as if they  were as light as leaves.  SPEC OPS SOLDIER (O.S.)  GET ON THE GROUND RIGHT NOW!  26.",
      "characters": [],
      "action_text": "REVEAL behind LENA, an arc of three SPEC OPS SOLDIERS, all  pointing their guns at the back of her head.  But before the moment can unravel, DR VENTRESS appears,  pushing past the soldiers, brushing down their gun barrels as  if warding away a wasp.  DR VENTRESS  Is there really any need for that?  SPEC OPS SOLDIER  Sir, she -  DR VENTRESS  (cuts in)  Shut up and step away.   Give us  space.  The soldiers do as ordered.  Throughout, LENA hasn’t turned from the fauvist view.  The doctor steps beside her.  DR VENTRESS (CONT’D)  It’s obvious what your husband saw  in you.   Impressive: to have  escaped.   To this point at least.  LENA talks as if through a dream.  LENA  Where am I?  DR VENTRESS  Northern Florida.   Thirty miles  from the coast.   It was the  Blackwater State Park, but we now  call it the Southern Reach.  LENA  ... Why is a National Park sealed  behind a fifty metre high concrete  wall?  DR VENTRESS  Well, quite.   That is the question.  INT. SOUTHERN REACH FACILITY/COMMAND CENTER - DAY  The COMMAND CENTER of the Southern Reach Facility.  A large room, with one wall given over to a floor-to ceiling  window, which faces the landscape and the Shimmer.  27. In the middle of the room is a large digital map.   It shows  the coast of Northern Florida, the boundary wall of the  Southern reach facility, and - in illuminated blue - the  border of the Shimmer.  On the adjacent wall there is a collection of images.  Some show a tall white LIGHTHOUSE - with archive  architectural plans of the building.   The rest are a sequence  of TEAM PHOTOS.   Small groups of men and women with backpacks  and hiking gear.   Some with weapons and uniforms.  LENA walks to the digital map table.  DR VENTRESS, standing by the window, starts to talk.  DR VENTRESS  It started when a park guide  reported an event to the local  police.   A lighthouse on the coast  was surrounded by what he called a  ‘shimmer’.   A friend of his had  entered to find out what was going  on - and never ret",
      "dialogue_count": 0,
      "word_count": 2863
    },
    {
      "scene_number": 4,
      "slugline": "EXT. DEFORESTED AREA - DAWN  The team walk in single file.  DR VENTRESS leads.  Then THORENSEN, then SHEPPARD, then RADEK, then LENA.  They walk right past the BODY that THORENSEN pointed out.  As they pass it, LENA pauses.  Sees the skull.   The way patches of hair and dried skin still  cling to the underside of the skull, where it has been  shielded from the wind and sun.  Sees the missing section of bone above the left eye socket,  blown out by a bullet.  Sees the curve of ribs, visible where the material of the  uniform has started to disintegrate.  Ahead, DR VENTRESS has reached the treeline.  DR VENTRESS stops before entering the forest.   Then turns, to  look back at LENA.  They lock eyes through the shimmering air.  CUT TO BLACK.  CAPTION:  PART 2 - AREA X  CUT TO -  EXT. THE SKY - DAY  - the FULL MOON, hanging in a clear blue daylight sky.  The same image that distracted LENA as she taught her medical  students.  CUT TO -  EXT. HOUSE/GARDEN - DAY  - the garden of LENA’S house, where LENA and KANE are  sunbathing on the lawn.   LENA in a bikini.   KANE in shorts.  Around them are the remains of an impromptu picnic.  40.",
      "characters": [],
      "action_text": "They lie side by side, looking up at the sky.  LENA  I love seeing the moon in daytime.  It’s like God made a mistake,  leaving the hall lights on.  KANE  Mmm - not sure about that.   God  doesn’t make mistakes.  LENA  Oh really.  KANE  Yeah.   It’s kind of key to the  whole being-a-God thing.  LENA  I observe his mistakes every day.  KANE  ... You know he’s listening, right?  LENA  If you take a cell, and prevent the  incremental shortening of  telomeres, you circumvent the  Hayflick division limit and prevent  the cell from entering senescence.  KANE  Woah.   So   weird you say that.   I  was about to make the exact same  point.  LENA  Would you like me to explain what  it means?  KANE  I would.   Because I find it  arousing when you patronise me.  LENA  It means the cell doesn’t grow old  and die.   It becomes immortal.  KANE  Don’t stop.  LENA  We see the process of growing old  as somehow natural.   Whereas in  fact, it’s fault in our genes.   We  inherited it, but we don’t need it,  or want it.  41.  (MORE) And without the fault, I would be  able to stay looking like   this   -  She illustrates the point by indicating herself.  LENA (CONT’D)  - forever.  KANE glances at her bikini-clad form.   Then back at the sky.  KANE  Okay.   Mistakes were made.  Beats pass.  LENA  ... So are you going to tell me  where you’re heading this time?  KANE  Nope.  Beat.  LENA  I know there’s something strange  about the mission.  KANE  ... Why?  LENA  Because the silence around it is  even more deafening than usual.  Beat.  LENA (CONT’D)  I don’t even get a clue?  KANE sighs.  KANE  Okay.   You get one clue.   We’ll be  under the same hemisphere.   So, if  you step outside and look up,  you’ll know we’re seeing the same  moon in the sky.   Day or night.  LENA looks sideways at KANE.  LENA  Holy shit.  KANE  ... What?  42.  LENA (CONT'D) LENA  Are you kidding me?   Is that what  you think I do when you’re away?  KANE hesitates.  KANE  I’m just saying -  LENA  - You think I come ",
      "dialogue_count": 0,
      "word_count": 3327
    },
    {
      "scene_number": 5,
      "slugline": "INT. ABANDONED BASE/BARRACKS - DAY  The door to the barracks dormitory opens, and the five women  enter.  Light pushes through the grimy windows, and the foliage that  has grown up outside.  It illuminates rows of beds with bare mattresses.  THORENSEN pulls off her bag and drops it on the nearest one.  THORENSEN  I’ve slept in worse.  SHEPPARD  Not sure I have.  LENA takes a couple of steps further into the room.   She’s  seen something, a couple of beds further into the barracks.  There’s something lying on the ground.  When she gets closer -  - she sees it’s someone’s BACKPACK.  And she recognises what   kind   of someone.   Khaki.   Military.  Spec ops.  Beat.  Then LENA turns to the others.  LENA  Uh - guys.   Come and look at this.  The others join her.  RADEK  ... Whoa.   Someone else is here?  LENA  Was here.   It’s covered in dust.  THORENSEN  You think one of the other  missions?  DR VENTRESS  Certainly could be.   No reason to  assume they weren’t able to reach  as far as us.  SHEPPARD  Why would they leave their gear  here?  59.",
      "characters": [],
      "action_text": "THORENSEN  Guess they left in a hurry.  LENA opens the bag.   Starts pulling stuff out.  Produces a washbag.  A scrunched-up rain poncho.  Then -  - a VIDEO CAMERA.  SHEPPARD  ... Hello.  LENA glances back at the others.  THORENSEN  What are you waiting for?   Do it!  LENA pops open the flip screen.  Presses the play button.  ... And the camera is stone dead.  LENA  Figures.  RADEK  No problem.   Just take out the  memory card and we’ll stick it in  my camera.  CUT TO -  INT. ABANDONED BASE/BARRACKS - DAY  - the five women, standing around RADEK’S camera, waiting for  her to switch it on.  RADEK clips shut the card hatch, and powers the camera up.  RADEK  There we go.  CUT TO -  INT. SCREEN - CONTINUOUS  - extreme CLOSE UP on the tiny SCREEN of RADEK’S camera.  The video starts.  60. At first, abstract.   Something dark and unfocused,  accompanied by the kind of noise you hear when someone  accidentally dials their phone from their pocket.  Then the image and noise suddenly resolve.  And we find we are looking at KANE.  And he’s looking at us.  KANE  I don’t know how long we’ve been  here.  CUT TO -  INT. ABANDONED BASE/BARRACKS - CONTINUOUS  - LENA.  Freezing at the sight of her husband.  She shoots a glance at DR VENTRESS.  DR VENTRESS doesn’t look back.  KANE (O.S.)  It must at least be weeks.   But it  could also be months, or years.  CUT BACK TO -  INT. SCREEN - CONTINUOUS  - KANE.  We see he is sitting on steps, in sunlight.   Somewhere in the  abandoned base.  Red eyes, unshaven.   Wired.   As if he hasn’t slept in days.  He’s looking just past the lens - addressing not the camera,  but the CAMERAMAN.  KANE  We’ve lost track.   Of time, and  everything else.  Beat.  KANE (CONT’D)  Sometimes I think I must be  dreaming.   But I know I can’t be.  Because I never wake up.  Beat.  61. KANE (CONT’D)  If anything, it’s the other life  that feels most like a dream.   The  wife.   The home.   They don’t seem  to -  KANE breaks off.   Glances over his shoulder.  KANE ",
      "dialogue_count": 0,
      "word_count": 1846
    },
    {
      "scene_number": 6,
      "slugline": "INT. ABANDONED BASE/REC ROOM - NIGHT  - LENA’S eyes, flicking open.  Echoing the image of her waking that we just saw.   But this  time, when she rubs the sleep out of her eyes, she’s in the  Shimmer.  REVEAL what was once the REC ROOM of the abandoned base.  There’s a dart board on the wall, and a pool table with mould-  covered baize, and a pinball machine with broken glass.  She’s got a sheen of sweat on her face.   Wipes it off.  Looks around.  On the floor, she sees THORENSEN, asleep on her unrolled  bedding.  Beside THORENSEN is RADEK, also asleep.  Beside RADEK is SHEPPARD.  Awake.  SHEPPARD winks.  LENA  Hey.  The two women whisper quietly to each other.  SHEPPARD  How you doing, babe.  LENA  ... Fine.  LENA nods at RADEK.  LENA (CONT’D)  Good she’s getting some rest.  SHEPPARD  Yeah - with the help of a little  sedative.  LENA  How about you?   Get any sleep?  SHEPPARD shakes her head.  SHEPPARD  I’d need a horse-tranq to knock me  out.   I’m at least as freaked as  Radek.   Just hiding it better.  Beat.  70.",
      "characters": [],
      "action_text": "LENA  I’ll go check on Dr Ventress.  SHEPPARD  You got it.  EXT. ABANDONED BASE/REC ROOM HUT - NIGHT  LENA exits the REC ROOM hut.  The hut is on the edge of the abandoned facility.   The  starlight doesn’t illuminate much, but we can just about make  out the chain-link perimeter fence, and beyond it, the black  shape of the forest.  DR VENTRESS is sitting at a picnic table, just outside the  door, studying a map by torchlight.  DR VENTRESS  What are you doing up, Kerans?  You’re not due to relieve me until  three AM.  LENA  I’m done sleeping for the night.  DR VENTRESS  In that case, you might as well  take a look at this.  DR VENTRESS taps way-point positions on the map.  DR VENTRESS (CONT’D)  Here’s us.   Here’s where I think we  camped last night.   And here’s the  lighthouse.   Judging by the  distance we covered today, we won’t  reach it tomorrow.   But look, South  West from here -  DR VENTRESS indicates a new position.  DR VENTRESS (CONT’D)  - Ville Perdu.   A tiny community,  evacuated ten years ago.   I think  we should aim there for tomorrow  night.   Then pick up the road to  the coast.  LENA says nothing.  DR VENTRESS notices the non-response.  She looks up at LENA from the map and the torchlight.  A beat between them.  71. Then LENA speaks.  LENA  The previous expeditions.   Were  they selected in the same way as  this one?   From volunteers.  DR VENTRESS  Yes.   They were.  LENA  Even the soldiers?  DR VENTRESS  ... No one was ordered to go.  LENA meets the doctor’s gaze.  LENA  Then I have to ask: why did my  husband volunteer for a suicide  mission?  DR VENTRESS pauses.  DR VENTRESS  Why would I have an answer to that  question?  LENA  Because you ran the programme.   You  must have assessed him.   And he  must have told you.  DR VENTRESS  So you’re asking me as a  psychologist?  LENA  Yes.  DR VENTRESS  Then, as a psychologist, I think  you’re confusing suicide with self-  destruction, and they’re very  different.   Almost none of us  commit suicid",
      "dialogue_count": 0,
      "word_count": 3977
    },
    {
      "scene_number": 7,
      "slugline": "INT. HOUSE/BEDROOM - NIGHT  - LENA’S face, moonlit.  Seen over a man’s shoulder.  In bed.   Having sex.  CUT TO -  INT. HOUSE/BEDROOM - NIGHT  - LENA.  Now sitting at her bedroom window.   Gazing out at the night  sky over the suburban street.  REVEAL the man on the bed behind her.  It isn’t KANE.  It’s her work colleague.   DANIEL.  Beats pass.  Then LENA speaks.  LENA  This was a mistake.  DANIEL  Okay...  He pauses.  DANIEL (CONT’D)  ... But it’s a mistake we keep  making.   It’s not exactly the first  time I’ve been in your bed, or you  in mine.   Whenever he goes away, we  find ourselves right here.  LENA  It’s still a mistake.  DANIEL half-laughs.  DANIEL  You want to have this conversation  again?  Silence.  DANIEL (CONT’D)  Fine.   Let’s have it again.   You  spend more time away from your  husband than with him.  92.  (MORE)",
      "characters": [],
      "action_text": "You can’t talk to him about your  work, and he won’t talk to you  about his.   And there is a clear  physical and intellectual  connection between us.   Have I  covered the bases?  LENA  You didn’t mention your wife.  DANIEL  I love my wife, as I always make  plain.   She’s blameless in this.  DANIEL sits up in bed.  DANIEL (CONT’D)  Come on, Lena.   What’s really going  on here?  LENA doesn’t answer.   She’s zoned him out.  DANIEL (CONT’D)  Is it because you haven’t heard  from him?   You think...  DANIEL hesitates.  DANIEL (CONT’D)  ... You think something may have  happened to him?  Beat.  DANIEL (CONT’D)  Or you think he knows.   That’s it,  isn’t it?   You think somehow he’s  found out about our affair.  The note of anxiety in DANIEL’S voice pulls LENA out of her  glaze.   He’s clearly more worried by the idea that KANE knows  about their affair than KANE being KIA.  DANIEL (CONT’D)  ... Has he found out?  LENA glances back at DANIEL.  Watches him for a moment.  Flat.   Dead.  LENA  You should go.  DANIEL frowns.  93.  DANIEL (CONT’D) DANIEL  Look, Lena, I -  LENA  Dan.  DANIEL cuts himself off.  LENA (CONT’D)  I’m not interested in talking to  you, or anything you have to say.  Just get dressed and get out, will  you?  A beat.  Then DANIEL stands.  Starts to put on his clothes.  DANIEL  You know it’s not me you hate.  It’s yourself.  LENA  No, Dan.   It’s you too.  LENA turns away, back to the window.  CLOSE ON LENA’S FACE.  LENA (CONT’D)  This is never going to happen  again.  She shuts her eyes.  Behind her, out of sight, we hear DANIEL leave.  Then -  - we hear THORENSEN’S voice.  THORENSEN (O.S.)  You lying bitch.  The voice intrudes in the way an alarm clock intrudes on a  dream.   The sudden awareness that the alarm is real, and the  dream is not.  CUT TO -  INT. VILLE PERDU/HOUSE/FRONT ROOM - NIGHT  - LENA opening her eyes.  Sees THORENSEN and RADEK.  94. DR VENTRESS is nowhere to be seen.  RADEK looks terrified.  And THORENSEN is leaning over LENA.   E",
      "dialogue_count": 0,
      "word_count": 2442
    },
    {
      "scene_number": 8,
      "slugline": "EXT. LIGHTHOUSE - DAY  From the top of the lighthouse, we watch LENA approach.  Below, at its base, its door hangs open, swinging in the sea  breeze, knocking gently against its frame.  INT. LIGHTHOUSE - DAY  LENA enters the base of the lighthouse.  Light filters down from the window, thirty metres above.  It illuminates a round room, with some specific features.  A wooden staircase winds up the circular wall to the top of  the structure.  Abandoned on the floor, there is some MILITARY GEAR.   A  BACKPACK, surrounded by cannister-shaped GRENADES, and a  RIFLE.  Opposite where LENA enters, there is a TUNNEL in the floor,  about two metres in diameter.   At its entrance, the wooden  boards have been pulled up, and laid out as a kind of ramp  structure, leading downwards.  INSIDE the tunnel something glows.   The soft blue-green light  of phosphorescence.  Finally, in the middle of the room there is a VIDEO CAMERA on  a tripod.   The camera faces a long black scorch mark, rising  up the curved wall, from a blackened heap on the ground.   The  nature of the heap is unclear.   It’s charred and fused beyond  all recognition.  LENA takes this all in.  Her gaze finally settling on the CAMERA.  CUT TO -  EXT. SWAMP - DAY  - the PLAYBACK ON THE CAMERA.  Which opens TIGHT on SHELLEY screaming:  SHELLY  GET AWAY!   GET AWAY FROM ME!  It’s a blurred, shaking image.  PEYTON is trying to hold SHELLEY, who is bare-chested, and  struggling violently.  106.",
      "characters": [],
      "action_text": "KANE is holding a rifle on them both.  All the soldiers are unkempt.   Unwashed.   Bearded.  KANE  Let him go for Christ’s sake!  PEYTON releases SHELLEY.  SHELLEY breaks away.   Running for a tree-line.  KANE opens fire.  CUT TO -  EXT. SWAMP - DAY  - SHELLEY, lying in the grass, filmed by the CAMERAMAN.  KANE and PEYTON stand either side.  We can see that SHELLY has been shot in the chest.  He’s not dead yet.   He’s making a wheezing sound, as his  punctured lungs collapse.  Now that the camera is focused and steady, we can also see  that SHELLEY has some extremely strange deformations.  On his neck, there is a split, or opening.   Effectively a  large tracheotomy, shaped as a sideways mouth, running from  the concave skin above his collar bone to under his chin.  Inside the mouth, where there might be a tongue, there is  something fat and white and red.   It looks like a skinned  SNAKE.   Air bubbles through the blood around it, and the  SNAKE is writhing slowly.  There are more deformations on SHELLEY’S arms.   Each one is  split, just below the elbow, into two.  Each split has secondary protrusions, finger-like, at  irregular intervals.  PEYTON looks haunted.   Jaw locked into a rictus.  PEYTON  Oh God, Shelley...  KANE cuts PEYTON off -  - by lifting his gun and firing a quick burst into SHELLEY.  In SHELLEY’S throat, the skinned SNAKE judders and contorts.  Then stops moving.  107. KANE pulls at PEYTON’S shoulder.  KANE  Come on.  CUT TO -  EXT. BEACH - DAY  - the BEACH.  KANE and PEYTON are standing on the sand, facing the ocean.  They appear to be waiting for something.  After a few seconds, it appears.  First, a disturbance in the water - as if caused by a quake  on the seabed, a hundred metres from the shore.  KANE jabs a finger.  KANE  There.   It’s coming again.  Then an area of water is rising, as if forming a hill.  Then the surface of the water breaks -  - and a DOLPHIN launches itself into the air.  The DOLPHIN is the size of a BLUE WHALE.  The vast",
      "dialogue_count": 0,
      "word_count": 831
    },
    {
      "scene_number": 9,
      "slugline": "EXT. BEACH/LIGHTHOUSE - DAY  - KANE and PEYTON.  They’re a little distance away from the camera, where the  dunes get flattened by the tides.  PEYTON seems to be having some kind of seizure.  He’s on all fours, head dipped, with his spine buckling as if  he’s retching.  KANE isn’t helping.  He just holds his rifle.   Watching.  Then PEYTON lifts his head -  - revealing there is something wrong with the shape of his  skull.   At this distance, it’s hard to tell what.   Some kind  of deformation that has elongated his face.  Some words are exchanged between them.  A beat.  Then KANE shoots PEYTON.  CUT TO -  EXT. BEACH - DAY  - KANE.  He’s a long way distant from the camera.   Standing waist-deep  in the ocean.  After a few moments, KANE starts pounding the water with his  fists.   Screaming and yelling.  The rage is miniaturised by the scale of the landscape.  Voice almost lost against the surf.  Then he stops.  And looks back towards the CAMERAMAN.  Stares.  CUT TO -  EXT. LIGHTHOUSE - DAY  - KANE, walking towards the lighthouse.  Through the towering SAND STRUCTURES.  110.",
      "characters": [],
      "action_text": "CUT TO -  INT. LIGHTHOUSE - NIGHT  - KANE entering the lighthouse.  He slips off his BACKPACK.  Lays down his RIFLE.  CUT TO -  INT. LIGHTHOUSE - NIGHT  - GREEN & WHITE NIGHT VISION.  The camera position is locked-off, on a tripod, in the middle  of the room.  It faces KANE.  KANE is sat on the floor, cross-legged, with his back to the  curved wall.  Holding something in his hands.  KANE  I thought I was a man.  KANE pauses.  KANE (CONT’D)  I had a life.   People called me  Kane.   But now I’m not sure.  Beat.  KANE (CONT’D)  If I wasn’t Kane, what was I?  KANE looks at the CAMERAMAN.  KANE (CONT’D)  Was I you?   Were you me?  The CAMERAMAN doesn’t answer.  KANE (CONT’D)  My flesh moves like liquid.   My  mind is cut loose.  Beat.  Then KANE looks straight down the lens.  His pupils glow like a cat’s eye in the infra-red light.  111. KANE (CONT’D)  I can’t bear it.  He opens his palm.  He’s holding one of the cannister-shaped GRENADES.  He glances up at the CAMERAMAN.  KANE (CONT’D)  Ever see a phosphorous grenade go  off?   Shield your eyes.   They’re  kind of bright.  KANE hesitates.  KANE (CONT’D)  And if you ever get back, find  Lena.  CAMERAMAN  I will.  KANE pulls the pin on the grenade.  There is a soft quick ticking, like wristwatch by your ear.  KANE gazes directly at the camera.   Unafraid.  KANE  Five, four, three, two -  THE NEXT MOMENT -  - the grenade detonates.  A blinding white flame, as if KANE is suddenly holding the  sun in his lap.   A high pressure rush of noise.  Initially, we can scarcely see KANE’S shape through the glow.  Then it dims slightly, starting to burn itself out.  We see his blackened shape bend.   Fall forwards onto the sun.  A couple of moments pass.  The flare continues to die down.  Then -  - the CAMERAMAN walks forward.   Stepping into frame.  It’s our first ever view of him.  His back is to us.  112. He gazes at the hunched charcoal figure, as it continues to  blaze with the fierce white light.  Then he turns his head.   And ",
      "dialogue_count": 0,
      "word_count": 3176
    },
    {
      "scene_number": 10,
      "slugline": "EXT. THE NIGHT SKY - NIGHT  - a STAR-FIELD in a night sky.  Dense constellations.   The Milky Way.  Drift down.  Past the MOON.  To the SOUTHERN REACH FACILITY.  And a lone woman walking out of the tree line, across the  scrubland towards it.  LENA.  LENA (O.S.)  I want to see my husband.  CUT TO -  INT. SOUTHERN REACH FACILITY/MEDICAL WARD - NIGHT  - a medical ward.  LENA is walking down it, with a DOCTOR alongside, and two  SPEC OPS SOLDIERS following.  DOCTOR  It was miraculous.   It happened the  same night that the Shimmer  disappeared.   His blood pressure  stabilised, and his pulse rate  started to rise.   By the next  morning, he was not only awake.   He  was lucid.   Coherent.  They have reached a door in the ward.  Through the glass panel, LENA can see KANE inside.  Sitting at a chair.   Gazing out of the window.  DOCTOR (CONT’D)  There’s no trace of abnormality  anywhere in his system.  LENA  I’d like to see him alone.  INT. SOUTHERN REACH FACILITY/WARD ROOM - CONTINUOUS  LENA enters.  Closes the door behind her.  126.",
      "characters": [],
      "action_text": "KANE looks round, and they lock eyes.  Neither speak.  After a moment, LENA goes to the WINDOW.  Looks out at the NIGHT SKY.  LENA  Are you Kane?  Silence.  Then KANE gives a slight shake of the head.  KANE  I don’t know.  Beat.  KANE (CONT’D)  Are you Lena?  LENA hesitates.  Then turns to face him.  BEHIND HER -  - we can see through the window to the night sky.  And in that sky, we see a SHOOTING STAR.  Then another.  Then another.  CUT TO -  INT. LOWER ATMOSPHERE - NIGHT  - the shooting stars as FALLING METEORS.  As we saw in the opening images of the film.   A hunk of rock,  burning as it falls through Earth’s atmosphere.  And as the nearest meteor splits apart, we see in its core.  Something shimmering.  CUT TO BLACK.  END  127.",
      "dialogue_count": 0,
      "word_count": 314
    }
  ]
}