{
  "slug": "anthropoid-2016",
  "title": "anthropoid",
  "genre": "action",
  "format": "film",
  "scenes_count": 11,
  "characters_count": 1,
  "characters": [
    "JAN"
  ],
  "total_words": 26161,
  "total_dialogue": 1,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT/EXT. FARMHOUSE - DAY. 8   8  JOSEF pulls the phone line from the wall. Takes a cloth and  regards the dead weight of ANTONIN’s body on the kitchen  floor. A pool of black blood slowly creeping across the  floor. Josef wipes the blood from his face and exits.  JAN approaching. More in control.  JOSEF  You get him?  JAN shakes his head no. JOSEF looks at JAN for a beat -  JOSEF’s thoughts unreadable. He breaks off to survey the  area.  JOSEF  (nodding towards it)  We’ll take their truck.  INT. TRUCK - DAY 9   9  JAN drives. JOSEF looks out the window at the passing  landscape.  JAN steals a look at JOSEF. JOSEF notices.  JOSEF  What?  (beat)  They had made their choice.  (beat)  Sometimes you have to pick a side.  (beat)  You would prefer it was us?  JAN looks back to the road. The question hangs in the air.  JOSEF tears some cloth from a spare shirt and puts his foot  on the dash. He changes the blood soaked rag for the new  cloth and ties it tight.  JAN  (indicating Josef’s foot)  We have to get that looked at as  soon as possible.  JOSEF  We have to make contact with the  address in Prague first.  (beat)  We’ll deal with this after.  JAN gives him a worried look and then looks back at the road.  A squealing sound is heard over the engine. JOSEF turns,  lifts the canvas and peers into the back of the truck.  Six or seven pigs are in the back of the truck.  ANTHROPOID   V20 :   6",
      "characters": [],
      "action_text": "JAN  What is it?  JOSEF  A truck full of pigs!  JOSEF sits back and for the first time the men share a smile  at the situation they find themselves in.  EXT. COUNTRY LANE - DAY 10   10  The truck speeds past a sign post that indicates Prague is 28  Kilometers away.  OMITTED 11   11  OMITTED 12   12  OMITTED 13   13  EXT. PRAGUE STREETS - DAY 14   14  Various shots as the truck makes its way through the streets  of Prague.  INT. TRUCK - DAY 15   15  JOSEF checks his map and then the road ahead.  JOSEF  Should be the next left.  Through the windows we see the heavy presence of the German  army. Military trucks and soldiers very much in evidence at  every street corner.  JAN turns the wheel and makes a left turn.  JOSEF  Pull over here.  The truck comes to a stop as JOSEF looks up at an apartment  block.  JOSEF  This is it.  JAN and JOSEF exit the truck.  EXT. PRAGUE STREET - DAY 16   16  They both check the street with nervous glances.  ANTHROPOID   V20 :   7",
      "dialogue_count": 0,
      "word_count": 441
    },
    {
      "scene_number": 2,
      "slugline": "INT. APARTMENT BLOCK STEPS - DAY 17   17  JAN and JOSEF climbs the steps until they see a blue door  with the number 44 on it.  They have a quick look around and then nod to one another.  JAN knocks on the door and they wait. Footsteps are heard and  then the door opens.  A plain looking WOMAN in her late thirties appears and looks  at JAN and JOSEF.  WOMAN  Yes?  JAN  We are looking for Oldrich Novák.  The woman looks at them. Uncertainty in her eyes.  WOMAN  The Novákovi no longer live here.  A silent beat.  JAN  You have their new address?  The WOMAN looks down and sees that JOSEF’s foot is bleeding  and leaving a small pool of blood around his heal.  WOMAN  I heard they were taken by the  Gestapo a month before we moved  into the apartment.  From inside the apartment a MAN’s voice calls out.  MAN (O.S.)  Who is it?  WOMAN  (turning inside briefly)  Don’t worry, father. Just someone  looking for directions.  (back to Jan and Josef)  I’m sorry, that is all I know.  JAN  (stopping the door from  closing)  Please, can you help us?  WOMAN  My father is not well, you must  leave.  JAN steps back from the door and JOSEF stares at the WOMAN.  ANTHROPOID   V20 :   8",
      "characters": [],
      "action_text": "The WOMAN locks eyes with JOSEF. A brief second passes.  WOMAN  There is a veterinarian in the next  row of shops up the street.  (beat)  I hear he is a good man.  (beat)  One that may help.  JOSEF nods his thanks and they leave.  INT. VETERINARIAN’S SURGERY - DAY 18   18  A small French bulldog is being held by an ELDERLY WOMAN  while DR EDUARD, mid-50s bookish but kind, is trying to  examine the dog.  The dog is barking and trying to bite DR EDUARD.  ELDERLY WOMAN  He normally only barks at Germans!  DR EDUARD  Germans and anyone giving him a  rectal examination.  DR EDUARD removes his gloved hand from the dog’s rear and  takes off the glove.  DR EDUARD  He should be fine now but don’t let  him eat the rubbish around the bins  again.  From next door we hear the bell above the front door sound.  DR EDUARD looks up with slight concern - he is not expecting  any other clients today. He reassures the ELDERLY LADY with a  warm smile.  INT. VETERINARIAN’S RECEPTION - DAY 19   19  Frosted glass panels sit on top on wood panels and separate  the reception from the surgery with a door in the centre.  ELDERLY WOMAN  (leading the dog out of  the surgery)  Thank you, Dr Eduard. Come along  Benés!  In the shop the ELDERLY WOMAN stops to see JAN and JOSEF in  the waiting area - neither have any pets.  The ELDERLY WOMAN looks back at DR EDUARD with a slightly  worried expression.  DR EDUARD  Look after him, Mrs Spinka.  ANTHROPOID   V20 :   9 MRS SPINKA leaves and DR EDUARD turns to JAN and JOSEF. A  brief pause before we cut to:  INT. VETERINARIAN’S SURGERY - DAY 20   20  A close up of JOSEF’s foot. A spot lamp lights a large cut  that is being stitched together by DR EDUARD. Dark sticky  blood surrounds the deep cut and five stitches hold most of  the wound together.  DR EDUARD looks over his glasses at JAN who is peeking out  through the curtains.  JAN’s POV: Three German soldiers are roughly herding a Jewish  family along the streets. Prodding them, shouting at them.  JAN wa",
      "dialogue_count": 0,
      "word_count": 1167
    },
    {
      "scene_number": 3,
      "slugline": "EXT. PRAGUE, PANORAMIC SHOT - DAWN 21   21  Over the rooftops. All is now quiet. The city starts to stir.  INT. VETERINARIAN’S SURGERY - MORNING 22   22  JAN and JOSEF are ready and waiting. They look like they  haven’t slept. JOSEF is checking the street from the window  and JAN is whittling his piece of wood when the sound of keys  are heard unlocking the front door.  JAN opens the surgery door a crack and sees DR EDUARD enter  with another man. He is BRETISLAV BAUMAN, a tall slim man in  his early fifties, educated but with a brusque manner. He is  a local miller but carries himself with the confidence of  something more. His hand deep in his coat pocket proves it.  DR EDUARD stops when he sees JAN and JOSEF in defensive  positions by the surgery door.  DR EDUARD  This is Bretislav the miller.  BRETISLAV looks at JAN and JOSEF. A pause as they size each  other up.  BRETISLAV  Eduard told me you were looking for  Oldrich Novák?  JOSEF looks at BRETISLAV and nods.  BRETISLAV  Would you like to take a drive with  me?  Awkward pause. Nervous looks.  INT. TRUCK - MORNING 23   23  BRETISLAV drives with JAN and JOSEF on the bench seat next to  him.  A three-storey concrete building put up in the 1920s looms  through the windshield. Cold and functional. The truck  approaches and stops outside the entrance.  JOSEF  Where are all the students?  BRETISLAV  Closed.  (beat)  Germans don’t like colleges. They  encourage people to think.  (beat)  Most of the academics and  intellectuals have been shot.  ANTHROPOID   V20 :   13",
      "characters": [],
      "action_text": "BRETISLAV gets out the truck and starts walking across the  courtyard and towards the school building.  JAN  What do you think?  JOSEF  I think, stay on your toes.  EXT. SCHOOL BUILDING - DAY 24   24  JAN and JOSEF get out the truck and cross a courtyard and  join BRETISLAV as they all enter through the main large  doors.  INT. SCHOOL BUILDING, CORRIDOR - DAY 25   25  JAN, JOSEF and BRETISLAV walk down a long corridor, their  footsteps echo.  JOSEF looks around: empty class rooms. Some with chairs over  turned. Paint peeling from the walls. Rust marks. Decay. It  doesn’t look good.  JOSEF limps along and snatches a look at JAN. Both have a  hand in their pocket.  The corridor is long. Their footsteps echo out. Tensions at  breaking point.  BRETISLAV looks back over his shoulder at JOSEF. JOSEF meets  his gaze. BRETISLAV turns back and reaches a doorway, goes  through it. JAN and JOSEF follow.  INT. SCHOOL BUILDING, CLASSROOM - DAY 26   26  Sitting behind a desk is a man. Standing next to him is  another man.  JAN and JOSEF enter but don’t see the two men either side of  the door they came through.  “CLICK”. Pistols are trained on the back of JAN’s and JOSEF’s  head.  BRETISLAV spins, pistol trained on JAN and JOSEF.  BRETISLAV  Don’t move!  JAN and JOSEF look around to assess the situation. Two armed  men behind. BRETISLAV in front. Two men at the desk in front.  BRETISLAV takes the pistols from JAN and JOSEF’s pockets.  JOSEF looks very angry at himself for walking right into a  trap.  ANTHROPOID   V20 :   14 BRETISLAV places the pistols on the desk in front of the  seated man. He is JAN ZELENKA, a teacher, code-named ‘UNCLE  HAJSKY’, an intellectual looking man in his early fifties.  Standing next to him is a tall slim man in his mid-forties  with a determined manner. He is LADISLAV VANEK.  The men from behind place two chairs in front of the desk and  recede to cover at the back of the room.  LADISLAV  (hand outstretched)  Please sit.  The room is silent.  LADISL",
      "dialogue_count": 0,
      "word_count": 3560
    },
    {
      "scene_number": 4,
      "slugline": "INT. PRAGUE DANCE HALL - NIGHT 33   33  A smoky dance hall, softly illuminated in soft brown hues.  Tables and chairs around the edge of the floor. Some six or  so couples are dancing to a swing band.  JAN and JOSEF stand at the bar.  The atmosphere in the dance hall has an edge. It’s not  relaxed and feels slightly surreal. Almost lost in time.  Nervous looks. A banner hung across the hall proclaims  “ HAPPY NEW YEAR - 1942! ”  A few off-duty SS officers to one corner. Top buttons undone,  red cheeks. But people avoiding them. A few whores flirt with  them.  Upper class tuxedoes mixing with working class brown jackets.  Business men mixing with artists and Black marketeer’s mixing  with Czech police.  A group of friends drinking. One is quite drunk and starts to  push a mate around. A few others step in and calm the  situation down. Drinks and cigarettes are handed out. Nervous  looks in the direction of the SS officers.  This is occupied Prague. The Dance hall has an a 1920’s  prohibition feeling to it and tonight being New Years eve, a  temporary neutral ground for all attending, but only just  JOSEF  (to the crowd)  Look at them...  (beat)  Going through the motions like some  old ritual that no longer has any  joy for them.  JAN  Maybe there is hope in the  pretence...  JOSEF lights a cigarette, he is a few beers in. Turns to JAN.  JAN signals OFF SCREEN.  MARIE and LENKA emerge through the crowd arm in arm. Both  beautiful. Both receiving looks from various wannabe suitors.  LENKA FAFEKOVA, like MARIE is elegant with striking red hair,  she is slightly older but beautiful.  JAN  Looks like you fell on your feet  with Lenka.  JOSEF  Stupid...  JAN looks confused.  ANTHROPOID   V20 :   29",
      "characters": [],
      "action_text": "The girls approach them.  MARIE  Hello. Lenka, this is Jan and  Josef.  JOSEF turns his back on them. MARIE visibly disappointed.  JAN smiles nervously at MARIE. Awkward pause.  MARIE  You know it’s not very polite to  turn your back on a lady.  JOSEF turns and talks but doesn’t look at them. He looks past  them.  JOSEF  I’ll pay you the compliment of  being the two most beautiful girls  in the room but this is not a night  off for us.  JAN  Josef, maybe you are over-reacting  a little.  JOSEF gives JAN a look which silences him.  JOSEF  (looking past Lenka and  Marie)  Me and Jan appreciate the effort  but the point was not to attract  attention.  JAN looks over the room.  A few people avert his gaze. Maybe JOSEF has a point.  JOSEF  In future we need you to be as  plain as possible.  (beat)  Think you can do that?  MARIE nods, feeling small and rebuffed.  LENKA  You know, for most girls, a little  lipstick is the only way to forget  what is happening here.  (beat)  Even if it’s only for a few hours.  JOSEF looks at the table with SS officers. One of them  looking over. Observing while inhaling a cigarette.  JOSEF now looks at Lenka for the first time.  ANTHROPOID   V20 :   30 JOSEF  Your lipstick gets you noticed and  that gets us noticed and us being  noticed could get us all shot.  (beat)  And now this little scene needs an  ending.  LENKA frowns, not understanding.  JOSEF leans forward and whispers in her ear.  JOSEF  Slap my face so we can leave  without suspicion.  LENKA pauses for a second and understands the scene that  needs to be played. She then hauls a slap across JOSEF’s  right cheek. Her face plays the perfect part of a woman  scorned.  LENKA  I’m not a whore!  JOSEF rubs his cheek and sees: the SS officer turns and  laughs with the others. The acted story, now clear, has  averted any suspicion.  JOSEF  (whispered to Lenka)  Save your lipstick and pencilled  stockings for when the war is over.  JOSEF pushes past and leaves.  JAN grabs his coat.  JAN  ",
      "dialogue_count": 0,
      "word_count": 2701
    },
    {
      "scene_number": 5,
      "slugline": "INT. SAFE ROOM, CAFÉ SLAVIA - SAME. 41   41  The men stand down and breathe a sigh of relief.  INT. MORAVEC FLAT, MAIN ROOM - MORNING 42   42  CLOSE UP of the wood that JAN has been whittling. JAN is now  using a filing tool. The wood is taking shape into the form  of the human figure.  JOSEF and JAN sit on the sofa staring ahead. ATA is playing  the violin in another room. MR MORAVEC is lighting up his  pipe and chattering away (one gets the impression he would  chatter away even if he didn’t have an audience).  MR MORAVEC  (draws on pipe, billowing  smoke)  Out of Blue Boar tobacco!? Couldn’t  believe it. I told him I’d been  smoking it for twenty-odd years.  Didn’t have any. Says it’s because  of the war. Didn’t believe that for  a moment.  (to Jan)  Have you found work yet?  JAN  Nothing concrete yet. But I think  we have a plan.  MR MORAVEC  We have work down at the yard.  (beat)  You think perhaps you are too good  to do such work?  JAN  No, Mr Moravec. It’s a kind offer.  (beat)  Maybe if what we have planned  doesn’t work out?  MR MORAVEC gives him a slightly suspicious look as he draws  on his pipe.  JAN and JOSEF help MRS MORAVEC to the kitchen with the  breakfast plates.  INT. MORAVEC FLAT, KITCHEN - MORNING 43   43  The dishes are being piled in the sink.  MRS MORAVEC  (quietly to Josef and Jan)  There are two bicycles downstairs  for you. Both black, both ladies.  Sorry, it was all I could get, I  placed them there earlier.  ANTHROPOID   V20 :   40  (MORE)",
      "characters": [
        "JAN"
      ],
      "action_text": "(hands Josef two leather  cases)  A camera, loaded with film and  binoculars. The other bits you  asked for will be here tomorrow.  EXT. PANENSKE BREZANY - DAY 44   44  POV through binoculars: The entrance to Heydrich’s chateau at  Panenské Brezany. Many armed German soldiers are in evidence.  JOSEF (O.S.)  As Uncle said, there are too many  armed guards here.  JAN has turned his bicycle upside down and is pretending to  fix a puncture. Josef lays hidden from sight in a ditch with  his faced glued to the binoculars.  JAN  (sneaking a sly look)  Looks like there is a whole  garrison there.  HEYDRICH’s 3.5 litre Mercedes convertible sharks slowly out  of the entrance. It’s being driven by his personal chauffeur  Oberscharführer KLEIN. The top is off and HEYDRICH sits in  the front.  JOSEF  Looks like our man.  (beat)  What’s the time?  JAN  (checks watch)  Five minutes after nine.  The Mercedes approaches them   and roars past at sixty miles  per hour.  JAN busy with his tire and JOSEF digging deep to keep out  sight.  JOSEF  Anything else coming?  JAN  No. Riding solo today.  (beat)  Oh, wait.  An armed escort now roars past doing its best to keep up with  HEYDRICH but with no way of catching up.  JAN  Armed escort.  (beat)  Two minutes behind.  ANTHROPOID   V20 :   41  MRS   MORAVEC   (CONT'D) The armed escort races past. JOSEF gets up and dusts himself  down.  JOSEF  (retrieving his bicycle)  If we can stop the Mercedes using a  rope or steel cable across the road  then two minutes would be all we  need.  JAN  (placing his bicycle the  right way up)  Even if the rope stops the car we  need more than two minute to escape  from here. We would have to deal  with the armed guard here in the  open.  (beat)  It would not be my first choice.  JOSEF  And if it’s our only choice?  Jan is silent.  JOSEF  The point of the mission is to  succeed.  JAN  I’m more worried that we haven’t  planned what to do if we are  successful.  JOSEF  What happens after is not  important.  JAN",
      "dialogue_count": 1,
      "word_count": 7919
    },
    {
      "scene_number": 6,
      "slugline": "EXT. PRAGUE STREET - MORNING 78   78  JOSEF emerges from the alley and runs for a moving tram. He  catches up and jumps on board.  INT. TRAM - MORNING 79   79  JOSEF is out of breath. He moves up the tram and takes a  seat. He throws a few   nervous   glances   around the tram but  nobody seems to be paying him any attention.  The tram gains distance from the   chaotic   scene behind.  EXT. PRAGUE STREET, TOWN SQUARE - MORNING 80   80  The tram comes to a stop and JOSEF steps off.  He looks around trying to get his bearings and sets off in a  northerly direction.  EXT. MORAVEC BUILDING - MORNING. 81   81  As JOSEF approaches the building he sees CURDA waiting  outside. He seems greatly agitated.  JOSEF  Where were you Curda?  CURDA  I didn’t think you were really  going to do it.  JOSEF grabs him by the collar, looks like he is going to  smash his face in.  CURDA  It’s all over the radio.  (beat)  You shot him?!  JOSEF clenches his jaw in anger and then releases him.  CURDA  The radio said that 20,000 SS  troops have been drafted in to look  for us.  (Beat)  I have to get my family out of  Prague.  JOSEF  No one is going anywhere. You try  and flee now they will pick you up  before you get to the city limits.  Go back to your family, batten down  the hatches and stay calm. Stay out  of sight and keep your mouth shut.  Think you can do that?  ANTHROPOID   V20 :   73  (MORE)",
      "characters": [],
      "action_text": "(off Curda’s nod)  Now get out of my sight.  INT. MORAVEC FLAT, MAIN ROOM - DAY 82   82  JOSEF enters.  JAN is already there. He is sitting on a bench as MRS MORAVEC  treats his wounds with iodine. JAN is weakened and greatly  agitated. Did they or did they not succeed?  A heavy silence hangs in the air between them.  JOSEF slowly shakes his head in utter disbelief of the events  that have just happened.  JOSEF loses it and swipes some tins of food off a shelf.  JOSEF  KURVA!  JAN  He was definitely wounded.  JOSEF  KURVA!   The Sten gun! That bloody  Sten gun!  (beat)  I had him!  JOSEF points an invisible Sten gun into space. His  imagination reliving the moment.  JOSEF  (softly imagining)  I bloody had him...  (then angry)  HE WAS RIGHT THERE!  MRS MORAVEC finishes attending to JAN’s face and stands,  putting away her things.  Silence hangs heavy in the room.  INT. MORAVEC FLAT, BOX ROOM - DAY 83   83  KNOCK! KNOCK! KNOCK!  JAN and JOSEF sit bolt upright and grab their guns.  Then a single KNOCK!  JAN opens the door a crack, pistol aimed.  JAN’s POV: we see UNCLE HAJASKY.  ANTHROPOID   V20 :   74  JOSEF   (CONT'D)",
      "dialogue_count": 0,
      "word_count": 458
    },
    {
      "scene_number": 7,
      "slugline": "INT. MORAVEC FLAT, BOX ROOM - DAY. 84   84  The three men and MRS MORAVEC sit around talking in hushed  tones.  UNCLE HAJSKY  What went wrong out there?  JOSEF stares into space, dejected.  SIRENS are heard outside. JAN looks out the window from  behind the curtains.  JAN’S POV: a street scene with German soldiers marching,  several German vehicles, sirens screeching.  JAN turns from the window.  JAN  Looks like the whole of Prague is  crawling with Germans.  UNCLE HAJSKY  It was to be expected.  JAN  We didn’t even kill him!  UNCLE HAJSKY  Wounded.  JAN  How bad?  UNCLE HAJSKY  (shrugs)  It is hard to say. The SS still  have the hospital surrounded so,  presumably, he’s still alive. The  Germans have more men and guns up  there than they have on the Eastern  front.  UNCLE HAJSKY goes to the radio and switches it on. German is  heard, followed by the Czech translation.  RADIO ANNOUNCER (V.O.)  Karl Frank has temporarily taken  Heydrich’s place and has proclaimed  a state of emergency and a curfew.  (beat)  A reward of ten million crowns will  be given to any information that  leads to the arrest of the  criminals.  (beat)  Anyone caught aiding the criminals  will be shot with his entire  family.  UNCLE HAJSKY switches it off.  ANTHROPOID   V20 :   75",
      "characters": [],
      "action_text": "UNCLE HAJSKY  All radio stations are transmitting  the same message continually.  JAN gives MRS. MORAVEC a concerned look.  UNCLE HAJSKY  Nothing is leaving or entering  Prague.  (beat)  The bicycle you used has been  found. It has blood upon it. Also  your briefcases. The Germans have  put these in the window of the big  Bata shop in the city centre to see  if anyone recognises them.  (beat)  They’ve also taken several thousand  hostages and are shooting people in  the street.  (beat)  All home owners must declare to the  police all persons staying with  them who have not already been  reported.  (beat)  Failure to do so will be punishable  by death.  (beat)  What this means to you is that you  can no longer remain here. There  are no safe houses left any more.  MRS MORAVEC and UNCLE HAJSKY share a look.  JAN  Where do we go?  MRS MORAVEC  I’ve asked Father Vladimir Petrek,  he is the dean of the Orthodox  Church.  JAN  Where is he going to hide us? In  heaven?  MRS MORAVEC  The cathedral of Saints Cyril and  Methodius.  UNCLE HAJSKY  He has agreed to hide all the  parachutists until we can return  you to London.  JOSEF gives JAN a look.  MRS MORAVEC  I’ll pack you some warm clothes and  blankets.  ANTHROPOID   V20 :   76 JAN and JOSEF nod and the men shake hands.  UNCLE HAJSKY  Rest here tonight. I will be back  to pick you up first thing in the  morning.  UNCLE HAJSKY leaves.  INT. MORAVEC FLAT, BOX ROOM - MORNING 85   85  JOSEF wakes to the sound of HYSTERICAL CRYING coming from the  room next door.  He wakes JAN and places a finger to his mouth as a signal.  They grab their pistols and flank the door.  INT. MORAVEC FLAT, MAIN ROOM - MORNING 86   86  JAN and JOSEF enter the main room and see MRS MORAVEC  consoling MARIE.  MARIE looks up and sees JAN. Goes to him. Slumps into his  arms.  JAN  What is it?  MRS MORAVEC looks from JAN to JOSEF. Sadness in her eyes.  MRS MORAVEC  It’s Lenka.  EXT. PRAGUE STREET - DAY (FLASHBACK) 87   87  NO SOUND   - MARIE exits the ",
      "dialogue_count": 0,
      "word_count": 644
    },
    {
      "scene_number": 8,
      "slugline": "INT. MORAVEC FLAT, MAIN ROOM - MORNING 89   89  MRS MORAVEC  The Germans were rounding up random  hostages off the street.  EXT. PRAGUE STREET - DAY (FLASHBACK) 90   90  LENKA’s walk suddenly turns into a run. The CAMERA just in  front of her and keeping up with her. The sound of her  breath. In the background we can hear a German screaming  HALT! An intense sound building until:  OMITTED 91   91  EXT. PRAGUE STREET - DAY (FLASHBACK) 87B   87B  Loud machine gun fire makes MARIE jump and she covers her  mouth with her hand.  CUT BACK TO:  INT. MORAVEC FLAT, MAIN ROOM - MORNING 92   92  MRS MORAVEC  She was shot trying to escape.  JOSEF closes his eyes.  For a second we see LENKA’s hair gently blowing in the wind  in slow motion.  LENKA’s dead hand hanging limp. Blood dripping from the  finger tips.  Back with JOSEF. Anger on his face. He looks at MARIE.  MARIE’s face puffy from crying. Her eyes scared.  He strides off to their room. JAN follows.  INT. MORAVEC FLAT, BOX ROOM 93   93  JOSEF collecting his weapons. Loading them. Cocking them.  JAN enters the room and sees what he is doing.  JAN  Josef!  (beat)  Josef! Stop!  JOSEF makes to leave and JAN blocks his path.  JOSEF  Out of my way.  ANTHROPOID   V20 :   78",
      "characters": [],
      "action_text": "JOSEF tries to push past but JAN grabs him. The two of them  suddenly in a fight. Fists are thrown and blocked. They  grapple until a stale mate is found, both men breathing hard.  JAN  Josef, listen to me.  (beat)  What if they take you alive?  (beat)  You are risking everyone that has  helped us and for what? To shoot a  few soldiers?  (Josef struggles against  Jan’s grip)  STOP! SHE’S GONE!  JOSEF  It’s all my fault.  (beat)  I tried to kill Heydrich  (beat)  But I killed her!  JAN  It’s not your fault.  JOSEF breaks down and starts to cry. JAN holds him.  JAN  (softly)  I’m sorry...  JOSEF sobs into JAN’s shoulder.  INT. MORAVEC FLAT, MAIN ROOM - LATER 94   94  A clock ticks. MRS MORAVEC, ATA, MARIE, JAN and JOSEF sit and  stand in the room in silence - waiting. Three knocks then one  knock at the front door.  ATA goes and lets in UNCLE HAJSKY.  UNCLE HAJSKY  It’s time...  MARIE hugs JAN. She doesn’t want to let go.  JOSEF stands in front of MRS MORAVEC. Both their eyes red.  His emotions break through for a second as he moves forward  and hugs her. A tear runs down her face.  Last looks and JAN and JOSEF leave with UNCLE HAJSKY.  EXT. PRAGUE STREETS - AFTERNOON 95   95  A flurry of action as German army trucks unload soldiers.  People are stopped on the streets. Distant gun shots are  heard.  ANTHROPOID   V20 :   79 Several streets. Various angles as JOSEF and JAN follow UNCLE  HAJSKY at a discreet distance from one another. They follow  him towards their new hiding place.  German soldiers are greatly in evidence. Loud speakers echo  instructions regarding the curfew now in place.  EXT. RESSLOVA STREET - AFTERNOON 96   96  UNCLE HAJSKY stops and waits for JOSEF and JAN to catch up  with him.  UNCLE HAJSKY  This is the cathedral of Saints  Cyril and Methodius. Go through  that entrance. Father Petrek will  greet you.  (beat)  Ata will be bringing you food.  (beat)  Ladislav is working with London on  your exit plan.  (beat)  I know this maybe is not what you  wa",
      "dialogue_count": 0,
      "word_count": 4748
    },
    {
      "scene_number": 9,
      "slugline": "INT. UNDERTAKER’S GARAGE - DAY 111   111  At the back of the chapel there is place where the coffins  are loaded onto the cars. Several funeral wreaths lean  against the walls. Rain is pouring down. In the background  funeral organ music is heard.  We see two coffins in the back of a black hearse. Looking  down at it is the UNDERTAKER, beside him is LADISLAV and  UNCLE HAJSKY.  The UNDERTAKER raises the bottom of one of the coffins to  reveal a further space underneath  UNDERTAKER  Two in the coffins. Two under the  dummy floors and the other three  disguised as pall bearers.  (beat)  That’s the seven.  (beat)  The service can be at the Cathedral  of Saints Cyril and Methodius and  then the burial at Saint Josef and  Mary’s church which is outside of  Prague.  (beat)  You then make arrangements to  collect them from there.  LADISLAV looks at UNCLE HAJSKY. They nod in agreement with  the UNDERTAKER.  UNCLE HAJSKY  How soon can you be ready?  INT. GESTAPO HEADQUARTERS - NIGHT 133   133  Several shots of long featureless corridors. Silence. Then  the distorted sounds of ATA screaming under torture. His  screams become distorted and echo down the corridors.  INT. GESTAPO INTERROGATION CELL - NIGHT 134   134  Now a MS of ATA in his cell dressed in his Sunday best  playing a part of Bartok’s ‘Violin Concerto No. 2’. He is  immersed in an angelic light.  There is a passage in the concerto ATA cannot get right. He  keeps hitting the wrong note, a jarring almost discordant  wrong note that becomes louder and more frequent until it  turns into a never ending scream.  ATA looks across the cell and sees himself strapped to a  heavy wooden chair. The screaming coming from his open mouth.  His face is bloody from the beatings and one eye is swollen  shut, the other bloodshot and streaming.  ANTHROPOID   V20 :   96",
      "characters": [],
      "action_text": "The TORTURER punches him and two men then force brandy down  his throat using a funnel and rubber tube.  TORTURER  You like to play the violin?  The torture smashes ATA’s left hand three or four times with  hammer. ATA screams until he passes out.  A German doctor appears. He holds up a large hypodermic  syringe, ATA is injected.  A bucket of cold water then is thrown over him.  ATA has been broken both physically and mentally. He is not  who he was.  TORTURER  Maybe you would like to see your  mother again?  The broken ATA looks up through the tears, a glimmer of hope.  TORTURER  Yes, we managed to save her...  He signals and a man who leaves the room and then re-enters  with a METAL BUCKET.  TORTURER  We saved her head.  The man lifts MRS MORAVEC’s decapitated head out of the  bucket.  ATA  (the ATA in the wooden  chair)  NO! NO! NO!  TORTURER  (disembodied, echoic)  Where are the assassins?  (beat)  Where are the assassins?  (beat)  Where are they hiding?  (beat)  Where are they hiding?  ATA  (the Ata in his Sunday  best)  Don’t tell them!  (beat)  You mustn’t tell them!  TORTURER  (disembodied, echoic)  Where are the assassins?  (beat)  Where are they hiding?  ANTHROPOID   V20 :   97 ATA  (the ATA in the wooden  chair)  STOP! PLEASE STOP!  ATA  (the Ata in his Sunday  best)  You must never say!  TORTURER  (disembodied, echoic)  WHERE ARE THEY?  He is going to explode out of his body. The violin music gets  louder and louder. It’s going to burst his eardrums. The  violin is now mixed with ATA’s screams and the sound builds  to a crescendo and then stops as...  ATA  (the ATA in the wooden  chair SCREAMS)  THEY’RE IN THE CHURCH!  INT. GESTAPO HOLDING CELL - NIGHT. 134B   134B  The door opens on CURDA. He is escorted out of the cell by  two guards.  On the way out he sees ATA being dragged past and into a  cell. ATA’s hands tied behind his back.  CURDA looks away, guilt, shame.  He continues down the corridor, the camera stays close on his  face as light and shadow ",
      "dialogue_count": 0,
      "word_count": 780
    },
    {
      "scene_number": 10,
      "slugline": "INT. CATHEDRAL, NAVE - MORNING 137   137  JAN, OPALKA, and BUBLIK sit patiently, silently.  The street outside, usually noisy is now quiet. Too quiet.  JAN exchanges glances with OPALKA and BUBLIK.  JAN creeps to the window and looks down.  POV: The street is deserted. The Germans have closed off the  street at each end with barriers.  Suddenly there is a massive build-up of armed troops.  JAN  The Germans are surrounding the  church.  (beat)  We have to warn the others.  OPALKA  (stopping him)  There isn’t time. Take up defensive  positions. We hold them from here.  EXT. PRAGUE STREETS - MORNING 138   138  The approaching two hearses are forced to stop.  LADISLAV is in the passenger seat of the first hearse dressed  as an undertaker.  A German soldier approaches the hearse. Behind we see troops  taking up positions around the cathedral.  GERMAN SOLDIER #1  Where are you going?  LADISLAV  The other side of town.  GERMAN SOLDIER #1  (signalling)  Go back. No admittance.  The colour drains from LADISLAV’s face as he realises the  cathedral will become a tomb for his comrades.  The hearse starts to reverse and turns away from the  cathedral.  INT. CATHEDRAL, BALCONY - MORNING 139   139  The first wave of Germans slowly make their way into the  church.  On the balcony, OPALKA and BUBLIK have taken up defensive  positions.  ANTHROPOID   V20 :   99",
      "characters": [],
      "action_text": "JAN and the others look down on the church and see  PANNWITZ, a German officer in the Gestapo, and six of his men  walking through cathedral and cautiously move to the centre.  JAN’s POV down from the nave as the soldiers enter. They are  waiting till as many of the soldiers are gathered before they  open fire.  JAN looks over at OPALKA who gives a nod and then all three  open fire on the Germans below.  Several of the Germans are hit and fall. Some fire is  returned by the soldiers but they are unsure as to where they  should be aiming.  INT. CATHEDRAL, CRYPT - MORNING 140   140  JOSEF, VALCIK, SVARC and HRUBY are awoken by the gunfire and  jump down from their beds in the wall.   They cover their ears  with their hands. The noise is deafening. JOSEF grabs his  STEN.  JOSEF  We have to help them.  JOSEF is restrained by the others.  JOSEF  (screams up towards the  hatch)  JAN!  The others cover his mouth.  VALCIK  We must not give ourselves away.  (beat)  The Germans only know about the  three on the balcony right now. Not  us.  JOSEF continues to struggle.  VALCIK  If it was the other way around  would you not want to die knowing  your comrades had at least a chance  of surviving?  JOSEF thinks for a second. They release him.  INT. CATHEDRAL, BALCONY - MORNING 141   141  JAN finishes a clip and takes cover.  The Germans pull out their wounded.  ANTHROPOID   V20 :   100",
      "dialogue_count": 0,
      "word_count": 473
    },
    {
      "scene_number": 11,
      "slugline": "EXT. CATHEDRAL - MORNING 141B   141B  From the third floor window across the street we see the  German wounded being carried from the cathedral. The German  machine guns are training on the cathedral windows.  INT. CATHEDRAL, BALCONY - MORNING.  JAN  Block the stairwell!  OPALKA  But that is our only way out!  JAN  It’s also the only way up.  JAN, OPALKA, start to throw as much furniture down the  stairway that leads up to the balcony as possible. BUBLIK  joins in until it’s jammed with furniture.  All quiet now. OPALKA winks at JAN and BUBLIK. Silence. Then  a tremendous roar of automatic fire and crashing glass as  teams of German machine gunners opposite the church start  strafing the building.  There is nothing the three can do except take shelter behind  the great stone pillars that rise up in the cathedral, and  wait for the firing to cease.  JAN looks over BUBLIK. Bullets ricochet around BUBLIK as he  tries to make himself invisible. BUBLIK starts to panic and  hyperventilate.  JAN  Bublik!  (beat)  Bublik!  BUBLIK is not there. Tears rolls down his face and he is  covering his ears with his hands whilst in the foetal  position.  JAN slides over to BUBLIK and grabs him.  The fire dies down silence again but BUBLIK is still trying  to dig himself in to the stone floor.  JAN  Hey! Hey! Breathe! With me.  (beat)  Big breath in.  (beat)  Big breath out.  JAN grabs a clip and a fistful of ammo from his pocket.  BUBLIK  I don’t want to die today.  ANTHROPOID   V20 :   101",
      "characters": [],
      "action_text": "JAN  (mimicking Josef)  Here! Look, as we were trained.  JAN loads a bullet into the clip.  JAN  Nice and easy. You do it.  BUBLIK starts to load a bullet into the clip.  JAN  That’s it. Easy.  (beat)  Concentrate on the detail.  BUBLIK loads another. The panic attack subsiding.  JAN  It’s OK, Bublik. You are not alone.  We are here with you.  (beat)  And Czechoslovakia is here with us.  BUBLIK shakes his head, sniffs back snot and nods.  It’s a tender and heart-breaking scene. JAN passing on what  JOSEF had done for him in his time of need.  JAN looks over at OPALKA and nods that everything is OK.  EXT. CATHEDRAL - MORNING  A detachment of Waffen SS move into position at the front  door. Another A detachment of Waffen SS go through FATHER  PETREK’s apartment door which is attached at the front of the  cathedral.  INT. CATHEDRAL, BALCONY - MORNING.  JAN looks over to the balcony and sees the church swarming  with Germans.  JAN, OPALKA and BUBLIK open fire on the Germans below and all  hell breaks loose again.  A German machine gun team enters. They find a position and  load. Opening fire at JAN, the wooden balcony splinters into  hundreds of pieces as he drops for cover.  He pulls a large splinter from between his knuckles.  The furniture in the stairwell starts to move.  JAN  BUBLIK! COVER THE STAIRWELL!  ANTHROPOID   V20 :   102 BUBLIK ups and runs to see the Germans pulling chairs away  from the stairwell. He opens fire on them dropping two before  fierce gunfire is returned and he is forced back into cover.  INT. UNCLE HAJSKY’S APARTMENT, KITCHEN - DAY 144   144  UNCLE HAJSKY sits at the table staring into space. A clock  ticks in the room. A startling contrast to the previous  scene.  UNCLE HAJSKY turns to see:  POV: of the front door. Silhouettes can be seen on the other  side of the glass.  UNCLE HAJSKY removes his glasses like a man ready to go to  sleep at the end of a long day.  He places the glasses onto the table and we hold on them in  CLOSE UP as UNCLE",
      "dialogue_count": 0,
      "word_count": 3270
    }
  ]
}