{
  "slug": "assassination-nation-2018",
  "title": "assassination nation",
  "genre": "action",
  "format": "film",
  "scenes_count": 11,
  "characters_count": 0,
  "characters": [],
  "total_words": 26886,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. BASEMENT - CONTINUOUS 17   17 Diamond starts to pull off Bex’s shirt while they make out. She tenses up. BEX They’re not like super big. DIAMOND That’s okay. BEX You sure? DIAMOND Yeah. She lets him take her shirt off. INT. MASONS CAR - MOMENTS LATER 18   18 Em and Mason sit in his car. There’s nothing said. He hits the recline button on his seat and Em watches as he descends into place. It stops. He looks at her. MASON You should recline yours, it’s much comfier. She reclines hers, and the seat hums until she finds herself laying across from him. MASON (CONT’D) You wanna like hook up? EM I guess so. If you want. MASON Yeah. I mean if you do. EM Sure. They both lean over and start kissing at an awkward angle. They pull away. A beat. MASON Do you want like, more to drink? INT. KITCHEN - SAME 19   19 Sarah sits on the kitchen counter as Grace interrogates her.   * GRACE   *  Scarlett Johansson?   *  16.",
      "characters": [],
      "action_text": "SARAH   * Not even a question. Of course...   *  Kendrick?   * GRACE   * I’d get him to go down on me and   * mouth the entire “Control” verse...   *  James Corden?   * SARAH   * I don’t fuck with late night.   * GRACE   * I know, but he seems so sweet. I   * just want to lay on top of him and   * feed him ice cream.   * (they laugh)   *  ... Ben Affleck?   * SARAH   * Only if the baby sitter joins.   * GRACE   * Wait, I don’t remember, was the   * baby sitter hot?   * SARAH   * All baby sitters are hot.   * Reagan wanders in, drunk.   * REAGAN   * What about Bex?   * GRACE   * We’re doing famous people not real   * people.   * REAGAN   * No, seriously, what about Bex?   * Would you fuck her?   * SARAH   * Who says we haven’t?   * GRACE   * Wait, really?   * SARAH   * Why is this so hard to understand?   * It’s 2017, gender is irrelevant.   * Sarah throws back her drink.   * INT. BATHROOM - SAME 20   20 Lily has the phone angled below her, masturbating on video. CLOSE ON: LILY’S FACE as she leans her head back. We watch as her breath begins to slow into short, staccato gasps.  17.",
      "dialogue_count": 0,
      "word_count": 387
    },
    {
      "scene_number": 2,
      "slugline": "INT. GREENWALD’S PARTY - CONTINUOUS 21   21 ALL SOUND IS MUTED except for the SOUND OF LILY’S BREATH. The CAMERA MOVES THROUGH the party, past the drunken faces, the averted glances, the awkward brush of two legs on a couch, and through the general horror of teenage life... WE BEGIN TO CUT TO THE FACES OF THE KIDS. The ones we know and the ones we don’t. BEX, laying on the card table, her cheeks flushed. EM, as she runs her hands through MASON’S hair. MARK. ERIC. REAGAN. BB. JOHNNY. GRACE. NIKKI. From freshman to seniors. The awkward. The cool. The drunk. The high. The sober. One after another. FASTER AND FASTER, from FACE TO FACE. And over this WE HEAR the DISEMBODIED VOICE of ER0STR4TUS... (distorted through a voice masking software) ER0STR4TUS (V.O.) I know you because I’ve been watching you. Watching your little lives unfold. Your little flings and your little loves. I’ve seen it all. The lies you tell and the truths you hide. All in search of a connection. A human connection. Isn’t that what this is all about? You want to be known. Truly known. By someone. Anyone... (beat) Well, today is your lucky day. As Lily climaxes... SLAM CUT TO: INT. BASEMENT - SAME 22   22 Bex is lying across the table, her bra undone. Diamond starts to buckle up his pants. She looks up at him, tenderly. DIAMOND You know you can’t tell anyone about this. His words hit Bex like a punch to the gut - INT. PARTY BACK UPSTAIRS 22A   22A Lily walks out of the bathroom, as the blue and red lights of cop cars show up outside. People start to scatter. Em runs inside and finds Lily and Sarah amid the fleeing teenagers. As they head down the steps toward the basement, Diamond passes them, avoiding eye contact.  18.",
      "characters": [],
      "action_text": "As they head into the basement, they find Bex still lying on the table, tears streaming down her face. CLOSE: Lily leans over and kisses her tears, sits her up, and takes Bex in her arms. EXT. GREENWALD’S - MOMENTS LATER 23   23 The girls dart through a neighbor’s yard and out to the street where they find Lily’s car. As they drive off, CAMERA ascends to a BIRDS EYE POV. WE WATCH THE PARTYGOERS DART from the HOUSE like RATS. CUT TO BLACK. AND OUT OF THE BLACK. GRAINY WEBCAM FOOTAGE: 24   24 A FIGURE wearing an AMERICAN FLAG HOCKEY MASK leans forward. ER0STR4TUS (VOICE MASKED) Look at all of you... You have no idea what’s coming. THE SUN RISES. “HARD TIMES” by SEINABO SEY plays. I/E. MONTAGE AS THE GIRLS GET READY FOR SCHOOL - MORNING 25   25 (The following will be played at 2x it’s normal speed in the style of make up tutorials and other YouTube fare...) WE CUT BETWEEN Lily, Bex, Sarah and Em as they’re all   * separately applying their make up - patting foundation on, contouring, building up heavy smokey eyes, winged liner, bold lips a la Lana Del Rey... They try on outfits, discarding tops, skirts, leggings until each respective floor is covered in clothes. WE SHIFT INTO SLOW MOTION, as each one of the girls looks directly INTO THE CAMERA - checking their reflections. EXT. LACEY HOUSE - MORNING 26   26 Lily HONKS the horn. Bex sits shotgun, as they wait outside. LILY How are you feeling? Bex just looks at her, shakes her head. BEX I’m fine. It’s like whatever. Bex reaches over and lays on the horn. Sarah and Em come running out.   *  19. EM Okay, okay, okay, okay, chill, chill, chill, Jesus fucking Christ, so annoying. SARAH   * Don’t look at me, blame the fuckin’   * fifth Kardashian in the back with   * the 45 minute contour.   * INT. LILY’S CAR - SAME 27   27 As they drive to school and listen to music. BEX - And you know they’re gonna have a press conference and his wife is just going to be standing there, like the literal human embodiment of the gritting teet",
      "dialogue_count": 0,
      "word_count": 1730
    },
    {
      "scene_number": 3,
      "slugline": "INT. HALLWAY - DAY 30   30 Lily puts her headphones in. GASOLINE by HALSEY. She walks through the hallway, lost in some other world into: INT. BATHROOM - DAY 31   31 Passes a few awkward freshman looking in the mirror. Enters a stall. Latches it shut. Leans against the door.  [All the below plays out on screen in graphics.]   She opens her iPhone camera. Forms a gun with her fingers, jams the ‘barrel’ down her throat. Snaps picture after picture. Spit spills down her chin. Lipstick smears ever so slightly. And then finally. She gets it right. She opens the pic in a Facetune app. Smooths out her skin. Blows out the exposure until her face is the color of an angel. And then texts the pic to [heart eyes] Daddy: Lily:   I hate school. Wanna pull the trigger, Daddy?  A beat. Daddy:   Fuckk. You’re insatiable.  Lily:   Show me how insatiable.  CLOSE ON LILY’S FACE: she holds her breath. And then a short video begins to play. A man in a suit stands in front of a bathroom mirror. He begins to unbuckle his belt. Slides his hand down his pants. Lily:   [bang emoji] [bang emoji]  Daddy:   ???  CLOSE ON: Lily’s text:   I’m dead.  A FLOCK OF BIRDS puncture the SUN. As the CAMERA TILTS DOWN. To find the girls driving around after school. INT/EXT. LILY’S CAR - ROAD - DAY 32   32 BEX I’m telling you, Jay said CNN is at Bartlett’s house. SARAH   * But how do you know Anderson’s   * there?   * BEX Well who else are they going to send? Don Lemon!?  25.",
      "characters": [],
      "action_text": "EM I mean, yeah, probably. They only send Anderson to like, real places. They pull up outside of Mayor Bartlett’s house - some NEWS VANS are outside, REPORTERS are hanging around smoking cigarettes, drinking coffee. They slowly cruise by the scene as they scope out the action. They pass the CNN Truck but there’s no sign of Anderson, yet. They park at the end of the street and sit on the hood of the car, watching, as they see LANGLEY DONAHUE, 27, dressed in   * her Hillary Clinton solid pantsuit, hustling over.   * BEX   * Yo, I’ve always wanted to make the   * local news.   * OMITTED 32A   32A   * INT. LACEY HOUSE - NIGHT 33   33 Everyone is watching the news report play on TV: BEX (ON TV) I think it’s some like, socially conscious vigilante hacker guy. NANCE Oh, my god, wait pause it. I gotta put this on my Facebook. Bex you look so cute! You’re like a little natural! You girls are famous. She gets up really close to the screen to take a pixillated picture with her iPhone. Em presses play on the TV. LANGLEY (ON TV) So do you also think this is the work of a socially conscious vigilante hacker? LILY (ON TV) I don’t know, I kinda feel bad for the wife and kids. EM (ON TV) (whispering to Lily)   * Yeah, but she’s gross. Sarah elbows Em in the ribs on TV.   * SARAH (ON TV)   * (whispering)   * Em, we’re on live TV.   * And they cut from Langley’s live report back to the ANCHORS.   *  26. MALE ANCHOR (ON TV) Well now, strong opinions from strong girls! Ya gotta love it!   * Anyway, the Mayor has called a town hall amid growing protests from this very conservative community demanding that he step down. A MONTAGE of RESIDENTS being interviewed by LANGLEY: GUY IN STREET It’s absolutely appalling. Frankly, I don’t even want to think about it. It’s just sick. Sick. MOM AT SUPERMARKET I think we need to hold our politicians to higher standards. To be honest, I’m disappointed. I’m angry. This pervert ran on a family values platform. I feel like he’s conned us all. INT. POLICE ",
      "dialogue_count": 0,
      "word_count": 5500
    },
    {
      "scene_number": 4,
      "slugline": "EXT. LACEY HOUSE, POOL - NIGHT 58   58 WE SEE THE LIGHTED BLUE OF A POOL. The opening notes of DIRTY HARRY by GRACE. At 48 fps WE SEE the CRASH OF WATER followed by EM IN A NEON SWIMSUIT as she descends into the water revealing she’s wearing the EROSTRATUS MASK. And as the bass drops on the song we CUT TO:   * Lily struts toward CAMERA wearing the EROSTRATUS MASK, and   * begins to dance. As Em, Bex, Sarah and a GROUP OF TEENS cheer her on... JUMP CUT TO: Bex does Beyonce’s 7/11 dance in the MASK as everyone roars. JUMP CUT TO: Sarah does the Nicki/Drake Anaconda routine in the MASK with Lily in a pool chair. As Lily tries to touch her ass. Sarah slaps her hand and walks away. A beat. Sarah runs back and jumps into Lily’s arms. EXT. LACEY HOUSE - POOL - SAME 59   59 Em screams as Mason surfaces from underwater, laughing. She tries to slap and kick Mason who giggles - EM Don’t fucking grope me! MASON Ow! Ow! Ow! Chill out! They shout over the music as we see a small party around them EM No seriously, don’t grope me without my permission. MASON What’s the big deal? Bex is dangling her feet in the water. BEX Cause it’s assault, brutha. MASON This is the problem with the internet, now all girls think everything is rape. EM He’s so much sexier when he keeps his mouth shut. BEX Yeah, Mason. Shut up and look pretty.  49.",
      "characters": [],
      "action_text": "Mason purses his lips like an idiot. Bex’s phone buzzes. She stands up and starts to walk away from them as she checks her phone. It’s a TEXT from Diamond: Diamond:   I miss u  Bex:   what?  Diamond:   can we hang out again?  Bex:   why?  Diamond:   bc i like u  Bex:   is this like a prank?  Diamond:   no lol. ive just been thinking about u.  Bex stares at the last text, emotionally torn. We see ERIC, a couple OTHER GUYS, and a few RANDO GIRLS walk   * out of the sliding glass doors with some six packs of beer. ERIC Yo Bex, you want a beer? BEX No, I don’t fuck with carbs. EXT. LACEY HOUSE - POOL - NIGHT 60   60 Eric sits poolside with a bunch of DRUNK RANDOS and Grace.   * GRACE   * (wasted)   * I heard Marty was in the police station, and the cop asked him straight up if he was the hacker, and he looks at the cop and he’s like, if you ask me again, your whole life is gonna get leaked. And the cops were like, “wait what?” And then their whole lives got leaked. ERIC There’s no way that story is true. GRACE   * (in complete agreement) I know! ERIC Yeah but I was pretty disappointed by Patterson’s leak. I thought that shit would be way shadier. GRACE   * (in complete agreement)   * I know!   * ERIC   * Wait, but like didn’t the exact   * same thing happen to you a few   * years ago?   *  50. We can see Grace visibly wince. Em gets out of the pool and   * walks over, smacking Eric in the back of the head for the   * comment.   * ERIC (CONT’D)   * Hey! I meant it in a good way,   * those photos were like, really hot.   * GRACE   * Fuck off, Eric.   * Em sits next to Grace, throws an arm around her.   * EM   * There’s no way the hacker’s a   * student. He’s probably some twenty   * something disgruntled, loner IT   * dude who just like jerks off to   * Fight Club every night.   * GRACE   * Ohmigod. Brad Pitt’s abs. I can’t.   * ERIC But why would he go after Turrell? EM Motive is irrelevant. Like, what’s the motive behind the 300 plus mass shootings a year? There is none",
      "dialogue_count": 0,
      "word_count": 2495
    },
    {
      "scene_number": 5,
      "slugline": "INT. SCHOOL BATHROOM 73   73 GRACE rubs lotion up down her arms, neck and face until she’s glistening with a greasy shine. She takes a deep breath. EXT. FOOTBALL FIELD, CHEER PRACTICE - DAY 74   74 FROM ABOVE. Reagan in a Christ-like pose, falls backwards, into the palms of her teammates like a gift from God. INT. SCHOOL HALLWAY - DAY 75   75 FROM BEHIND. As GRACE walks through the hallways in jean shorts and heels. A baseball bat dangling by her side. She pushes through the EXIT DOOR - EXT. FOOTBALL FIELD - DAY 76   76 - into the bright sunshine toward the football field where the cheer squad is practicing. GRACE reaches the field, kicks off her heels and forges on. She begins to near the cheer squad. They’re in the middle of a pre-choreographed routine. Reagan’s pony tail is bouncing side to side as she grinds her hips to the beat. And as she turns - GRACE, SWINGS THE BASEBALL BAT BACK and - WIDE SHOT: In the distance, we see Reagan drop to the ground. Followed by blood curdling screams as the cheer squad comes running toward CAMERA. INT. POLICE CHIEF’S OFFICE - DAY 77   77 GRACE’S MOTHER and FATHER sit with Chief Patterson. FATHER Two years ago her phone was stolen. She had never had a boyfriend, I don’t think she had done much more than ever kiss a boy, but um, she had quite a few photos of herself in the nude. MOTHER She was exploring her sexuality. She had never sent them to anybody. INT. SCHOOL HALLWAY - DAY 78   78 GRACE as her bloody hands are cuffed behind her back.  60.",
      "characters": [],
      "action_text": "MOTHER (V.O.) Someone had uploaded every photo of our fifteen year old daughter to the internet. They posted her name, our address, phone number, her school, everything. She was suicidal, her grades dropped, she withdrew from all of her friends, and every night she begged us to move towns. WE SEE as GRACE is lead through the school hallway. The entire student body lining the walls. MOTHER (V.O.) To find out today that it was Reagan, her best friend from childhood who did this, I can’t even imagine the pain Grace felt.   * INT. POLICE CHIEF’S OFFICE - DAY 78A   78A   * Grace sits in front of Patterson, numb and defiant. SLOW PUSH   * into CU as she says:   * GRACE   * The night that it happened, the   * first person I called was Reagan.   * She stayed up on the phone with me,   * and I cried for hours. I wanted to   * die. It’s weird, because you don’t   * know how many people have seen it,   * and that’s what makes it worse. The   * question, the suspicion. Like I’m   * sitting here, talking to you, and   * you might have it saved on your   * computer. Or maybe you’ll go home   * and look it up, or share it with a   * friend, or twenty. For the rest of   * my life, every room I walk into,   * every new person I meet, every job   * interview, or first date, I’ll have   * that sinking feeling in my stomach.   * (beat)   * I made a promise that if I ever   * found out who did this, I would   * hurt them as much as they hurt me.   * Is it the right thing to do? I   * don’t know. But don’t tell me it’s   * not justified.   * She stares right through us.   * BACK TO:   * As Grace is lead through the hallways, a few STUDENTS begin   * to clap stoically, and then more, until the entire student body erupts in applause. WE TRACK BACK on GRACE as tears stream down her face. Despite the consequences to come, it’s not the fear that brings her to tears, it’s the show of support.  61.",
      "dialogue_count": 0,
      "word_count": 647
    },
    {
      "scene_number": 6,
      "slugline": "INT. BATHROOM STALL - DAY 79   79 SLOW PUSH IN on Lily’s face as we see her download the .zip file of Nick’s data. As she downloads the file, WE SEE on SCREEN the list of all the labeled files appearing one by one. WE SEE one file labeled:   KIK DATA  And in that file, we see their entire text history. She begins to look at the nude photos of herself that have been leaked. Her face is never shown. She begins to notice identifying details. She zooms in on. -- A small scar. -- A Grimes poster on the wall of her bedroom. -- A necklace. -- A mole. -- Her bracelets. -- Rings. -- A birthmark on the small of her back And then her heart stops. A whole file of videos. She opens the first... A CLOSE UP of her mouth, and written across her face, the word:   WHORE , her mouth forming the “ O ” She hits play, as we hear her voice: LILY (ON VIDEO) I want to be the best little girl you’ve ever had, Daddy. She looks back at the 4Chan boards. Then she sees a comment thread titled :   who is this wh0re?  Next to the screen shot of her mouth. 27,622 page views. 1,103 user comments. Thri11Ki11a666:   We gotta find out who this bitch is. Hot af  Xvk5t&D:   Is salem’s yearbook online? Lets start scouring fb profiles.  PepeDaFrog93:   just found the last few Salem yearbooks online.   *  assuming shes <21. cross referencing mouths and jewelry. narrowed it down to 16. will post names.  She sees NICK’S .zip file has 73,384 downloads. She OPENS HER TUMBLR. Scans her Anonymous asks. Anonymous asked:   theyre gonna find you wh0re  She begins to frantically delete everything off her computer. Her phone vibrates. New text message.  62.",
      "characters": [],
      "action_text": "-- Rose:   Lily?  A beat. -- Rose:   How could you?  INT. LACEY HOUSE - NIGHT 80   80 Em is banging on Nance’s bedroom door. EM Mom, Mom, open up! She’s not opening the door. The phone is ringing in the background repeatedly as Sarah looks at her. SARAH Just let her be. Em goes over, picks up the phone - there’s a creepy RUSSIAN VOICE on the other line, snorting and ranting - RUSSIAN MAN (O.S.) Is this fucking piggy pussy whore, Nance? Piggy, piggy, pink pussy - EM Stop calling you fucking creep! RUSSIAN MAN (O.S.) (calmly) I’ll kill you. She hangs up the phone. SARAH Just take it off the hook. Em unplugs the phone. SARAH (CONT’D) Have you looked through everything? EM No, I don’t want to. I’m not going to. SARAH It’s bad, Em, it’s really bad. There’s a ton of stuff about you and me in it. EM What do you mean? SARAH Just like, texts she wrote Aunt Kay. Just really personal stuff. EM But like what?  63. SARAH Stuff about our family... Stuff about my Dad, your Dad. Remember last year when I went to Planned Parenthood? It’s all in there. It’s not like she was talking shit, though, she was just updating Kay. But since then there’s like crazy anti-abortion people tagging me in photos of dead fetuses for the last   * 3 hours. First it was 10 people, then a thousand, now eight thousand... it just keeps growing... It’s pictures. Texts. I mean, she’s slept with a lot of people, Em. Like, married people. It’s not good. Right then, they HEAR a blaring CAR HORN as a pair of HIGH BEAMS blast through the kitchen windows. And then another set of HIGH BEAMS. Another HORN. The two girls stand there, illuminated by the light, as Sarah   * grabs a kitchen knife and screams over the horn:   * SARAH (CONT’D) Em! Call the cops! Call the cops! Em goes to plug the house phone back in - there’s no dial tone. Just heavy breathing. A RANDOM VOICE on the other end: RANDOM VOICE (O.S.)   * Yo, is this that milf slut Na - She hangs up, gets a dial tone, calls 911. SARAH (to the cars) We’re calli",
      "dialogue_count": 0,
      "word_count": 2993
    },
    {
      "scene_number": 7,
      "slugline": "INT. LILY’S CAR - MORNING 90   90 The music continues as CAMERA moves from LILY driving to BEX sitting shotgun, her boots on the side view mirror, to EM and SARAH sprawled out in the back. It’s silent as they look out at the town around them. OMITTED 91   91   * EXT. SCHOOL - MORNING 92   92 The GIRLS walk toward the entrance. LANGLEY comes jogging over with her CAMERAMAN in tow. LANGLEY Would you girls like to - All FOUR GIRLS raise their middle fingers behind them as they   * walk into school - INT. SCHOOL ENTRANCE - DAY 93   93 WE SEE THE GIRLS walking TOWARD US. As they near the CAMERA   * they come to a stop. They look down to find -   * OFFICER RICHTER sitting at a fold out table, guarding the   * front of the school, inspecting students’ bags. He looks up at Sarah and Em with a grin.   * OFFICER RICHTER Twice in 24 hours? I’m beginning to think you girls like me. Em looks at Sarah, uncomfortable. He takes Em’s bag and dumps   * it on the table. Starts to inspect her belongings. Her makeup. A box of Tampax. OFFICER RICHTER (CONT’D) Pocket Pearls? Sounds cozy. Em and the girls grimace. He picks up her birth control. OFFICER RICHTER (CONT’D) What’s this? EM Birth Control. OFFICER RICHTER I guess the apple doesn’t fall from the tree. Em bursts into tears - SARAH Why are you trying to humiliate her?  74.",
      "characters": [],
      "action_text": "OFFICER RICHTER approaches Sarah aggressively.   * OFFICER RICHTER You wanna get an attitude with me? Sarah doesn’t break eye contact as she stares through him. SARAH I’m asking a question, Officer.   * He leans in close, menacingly: OFFICER RICHTER You need me, way more than I need you. Don’t you ever fucking forget that. INT. SUPERMARKET - DAY 94   94 WE FOLLOW from behind as Nance pushes a grocery cart down the aisle, her head slightly bowed, wearing a hat, ponytail, and sunglasses. She passes TWO HOUSEWIVES whispering to one another. They fall silent as she passes. CHECKOUT - LATER Nance looks around. It feels like the entire supermarket’s eyes are on her. As she pays and heads toward the door, one of the HOUSEWIVES from earlier cuts her off. HOUSEWIFE You really have no shame, do you? I don’t know how you can live with yourself. Nance looks down meekly as the woman passes. EXT. SUPERMARKET PARKING LOT - SAME 95   95 Nance loads her groceries into the trunk. In front of her we see an ESCALADE SLOW DOWN and CIRCLE. It comes to a stop. ANGLE ON: MARGIE DUNCAN, mid-30s as she briskly walks toward Nance from behind. We can HEAR HER BREATH CAUGHT IN HER THROAT as she walks up to Nance, grabs her by her ponytail and whips her neck back, violently yanking her to the ground. Nance shrieks before instinctively covering her head. MARGIE You wanna ruin families? Is that what you want, Nance, you wanna ruin my fucking family? NANCE Please, please, please.  75. MARGIE What are you sorry now? You sorry? NANCE I’m sorry, I’m sorry. MARGIE reaches into the grocery bag, pulls out a carton of eggs. She begins to smash them one by one in her face. MARGIE I. Don’t. Fucking. Believe. You. Whore. Nance is sobbing hysterically. MARGIE (CONT’D) You wanna act like trash then we’ll treat you like trash. Fucking garbage. She pulls out a carton of milk and dumps it right in Nance’s face. Nance gags as she tries to cover her nose and mouth. She then dumps orange juice in her face. WIDE SHOT",
      "dialogue_count": 0,
      "word_count": 923
    },
    {
      "scene_number": 8,
      "slugline": "I/E. HALLWAY - DAY 98   98 WE FOLLOW Lily as she walks the empty hallways. She pushes through the exit doors - toward the bleachers. EXT. UNDER THE BLEACHERS - MOMENTS LATER 99   99 Lily walks under the bleachers, looking for Mark. She spots him but as she nears she notices that something’s off. LILY What’s going on? MARK I want to ask you something. LILY What? MARK Do you have a birthmark on your back? Lily begins to realize what’s going on. LILY No. MARK You sure about that, Lily? LILY Yeah. I’m sure. MARK You’re lying, Lily. You’re fucking lying. LILY No, I’m not. MARK Show me. LILY No. MARK Show me you’re telling the truth. LILY No. Lily hears something behind her. As she turns, ERIC wraps his arm around her neck as TWO OTHER GUYS grab her. Lily screams. Trying to fight back but they quickly overpower her and wrestle her to the ground. ERIC Stop fighting. Stop fighting.  78.",
      "characters": [],
      "action_text": "LILY Please. Please. Please - ERIC STOP FUCKING FIGHTING! ERIC tries to cover her mouth as the TWO OTHER GUYS pin her on her stomach. Mark leans down - MARK When I was looking at all the photos in Nick Mathers’ leak... I started to think “This girl looks really fucking familiar”... MARK pulls out his phone, shows Lily a picture of a girl in panties from behind. A birthmark on the small of her back. MARK (CONT’D) What do you think? Look familiar, Lily? LILY Please don’t do this, Mark. Please. Please. Please. MARK And I thought, there’s no fucking way this could be Lily... LILY Mark I’m begging you. Stop. Stop. MARK But I just want to make sure... Mark pulls up Lily’s shirt from behind as she struggles. WE HOLD ON LILY’S FACE. As she begins to cry. Off-screen we hear a collective “Oooh” from the guys as they find their “evidence.” Followed by the SNAP of a photo being taken. THE PHOTO BECOMES FULL SCREEN SUDDENLY A RED CIRCLE is drawn around her birthmark. We move to SPLIT SCREEN as WE SEE all of the photos of Lily’s body from Nick’s leak, rapidly cycle across screen, until it lands on the photo of her from behind in her underwear, her birthmark visible. Another red circle is drawn. In text, across the top of it, we see, as if someone’s typing:   found u slut... Lillian Colson, 4267 Grove Street. 555-1864. (for a good time call ;)  CAMERA ZOOMS OUT to see it in the form of a PHOTO on the screen of a phone, being texted.  79. (We see in rapid time, how something goes viral) - from a text, to being uploaded, to Tumblr, to Twitter, to Instagram - being retweeted, reblogged, upvoted, commented on. From 3,000 to 8,000 to 120,000 from one subreddit to 100 subreddits, thousands upon thousands of comments. To the front page of Reddit, Google... the think pieces in response - Buzzfeed, Mashable, Daily Beast. To what seems like the entire nation, sharing, commenting, taking sides...  (But all of this is what’s about to happen. So for right now)  WE CUT BACK TO: EXT. UNDER THE B",
      "dialogue_count": 0,
      "word_count": 4367
    },
    {
      "scene_number": 9,
      "slugline": "INT. EM’S BEDROOM - NIGHT 117   117 Lily, Em, Bex, and Sarah lay around Em’s room, half-watching the 1971 version of Straw Dogs. SARAH Someone should remake this movie, but instead of Susan George getting raped, Dustin Hoffman should get raped. EM When I grow up, I want to be a director and only make male rape revenge films. SARAH   * That’s my dream, you can’t steal   * that from me!   * LILY Oh my god, that would be amazing. Can you imagine like, “I Spit On Your Grave,” but starring Channing Tatum? EM (movie trailer voice) On a dark and stormy night, in a small rural town, five men kidnap The Tate and do the unspeakable...   * Wait? Just imagine that poster, the   * Tate in tighty-whities covered in   * blood and dirt, holding a kitchen   * knife. Ughhhhhhh!   * BEX Ugh, why hasn’t Shonda written that already? Lily looks at her phone. She sighs - SARAH Lil, stop looking at your phone. LILY I just don’t understand how like legit news organizations can link to my nudes. EM It’s super fucked up. Google needs like a delete button. Bex is flipping through Lily’s mentions on Twitter. BEX Chrissy Teigen kind of tweeted her support for you. I mean, she didn’t reference you directly, but she said “when a man cheats, why does everyone always blame the other woman? Especially when she’s 18 and he’s 40-something.”  95.",
      "characters": [],
      "action_text": "EM Ugh, I love her. I wish they’d adopt me. Just like strap me in a   * baby bjorn and walk me around town.   * SARAH   *  That’s who should run for   *  President!   *  As Sarah and Em freak out over this possibility -   * LILY What are people saying back? BEX Well. Like, if I’m gonna be a hundred percent honest, there’s not a whole lot of people on your side.   * (Lily sighs)   * You should just do what Kim Kardashian did and build an empire out of this. LILY It’s not funny, Bex. BEX I’m serious, how many followers do you have on Twitter now? LILY I don’t know, 40,000 or something. But straight up, 80% of them are threatening to either kill me or rape me. In no particular order. Which I can’t figure out for the life of me. Like who sees naked photos of a girl and their first instinct is like “yo, I gotta kill this bitch.” EM   * Guys are super illogical. SARAH   * That’s what men don’t realize. This   * whole slut shaming thing literally   * makes my pussy drier than a   * motherfucking rice cake.   * The girls crack up.   * SARAH (CONT’D)   * No. I’m serious. I’m like so sad I   * haven’t been able to masturbate.   * Last night, I looked at my   * hitatchi... with disdain.   * They keep laughing... After a beat.   * LILY This whole thing is so fucking humiliating.   *  96. SARAH If life was a movie, this would be the obligatory “girl shaves her head” scene. LILY No. C’mon. That would have been last week. Right now, it would be “girl burns this motherfucking town to the ground” scene. SARAH That’d be so dope. EM But I’m glad this isn’t a movie cause if it was, you’d definitely die at the end. SARAH Totally. LILY Why the fuck do I gotta die at the end? EM AND SARAH (in a fuckboy voice) Cause sluts gotta go! They all start laughing. Sarah stops abruptly, sits up. SARAH Wait, what the fuck, did you guys see this? Sarah looks at her phone -   * SARAH (CONT’D) Marty Kolker uploaded this and now it’s like everywhere - She presses play. It’s the video we saw before with ",
      "dialogue_count": 0,
      "word_count": 1615
    },
    {
      "scene_number": 10,
      "slugline": "EXT. LACEY HOUSE - NIGHT 120   120 Lily looks around at TEN MASKED MEN, positioned around the house and street. Suddenly, she’s swarmed on either side. TWO MEN grab her and throw her to the ground. Her hands are quickly zip tied. Mouth duct taped. And then lifted and carried toward a car. RED STOCKING MASK stands outside the front door, holding the nail gun and looking at the house. Another BLACK SKI MASK, yells to him. BLACK SKI MASK   * Let’s go! We got her. But RED STOCKING MASK doesn’t move.   * BLACK SKI MASK (CONT’D)   * The fuck are you doing? Let’s go! CLOSE ON: RED STOCKING MASK as he reaches into his pocket and pulls out a ZIPPO. BLACK SKI MASK (CONT’D)   * No! No! No! RED STOCKING MASK holds the zippo out. Moves it toward the gasoline soaked window... The HOUSE CATCHES FIRE. The flames quickly spread around the outside of the house. RED STOCKING MASK pulls the FRONT DOOR SHUT, raises the NAIL GUN and PUMPS NAIL AFTER NAIL INTO THE DOOR FRAME. Bolting it shut. Bolting them inside. BLACK SKI MASK and the OTHER MEN take off down the street -   * INT. CAR - CONTINUOUS 121   121 ANGLE ON. LILY as she’s stuffed in the BACK SEAT of the CAR surrounded by THREE MASKED MEN. She sees the house go up in flames and begins to scream from under the duct tape. EXT. STREET - CONTINUOUS 122   122 WIDE SHOT: The car carrying Lily begins to drive away into the night - A beat. FOUR MUFFLED GUNSHOTS LIGHT up the inside. The CAR SLOWS, before veering at a snail’s pace and banging into a stop sign.  102.",
      "characters": [],
      "action_text": "A BEAT. The BACK DOOR opens. LILY emerges covered in blood. Her hands still zip tied behind her back, but her waist twisted to the side in order to hold the gun. She crouches down, lays the revolver down on the street as tries to step through her bound hands to bring them to the   * front... She can’t. She lays down on the street facing us as   * she tries to get her legs through -   * In the BG BLACK MASK crawls out of the car, a LARGE KNIFE in   * HAND. He’s bleeding from his gut as he slowly slithers toward   * Lily.   * Lily is straining her shoulders as pulls her legs up.   * The MAN slithers closer, his KNIFE raised. He’s almost on top   * of her as she finally brings her leg to the front, reaches   * down, grabs the gun. As BLACK MASK brings his KNIFE DOWN to STAB HER, she PUSHES   * THE BARREL under his chin and PULLS THE TRIGGER, blowing his head off. His body drops. She looks at him, shaking with fear. She tears the tape off her mouth and turns toward -- THE HOUSE, flames licking around the first story. And standing in front of the HOUSE, the man in the RED STOCKING MASK. He begins to walk toward LILY. Nail gun raised. POP. POP. Both nails miss, clinking against the pavement around Lily. Lily aims her revolver at him. Pulls the trigger. CLICK. The   * chamber is empty. She takes off running - INT. LACEY HOUSE - SAME 123   123 BLACK SMOKE POURS IN as the HOUSE BURNS from the outside. The   * girls all on the floor crawling up the steps -   * SARAH   * Use the window in Em’s room.   * BEX   * But it’s a straight drop. EM   * There’s no other choice.   * They reach Em’s bedroom and head toward the window. It’s small, not easy to fit through but the flames have yet to engulf it. Em pulls it open.  103. NANCE Em, crawl through. Em begins to squeeze her way through the window. The fire is just below her... She looks down. It’s a straight 12-foot drop onto concrete. EM Oh god. I can’t. I can’t.   * EXT. SALEM SUBURB, NEIGHBORS BACKYARD - CONTINUOUS 124   124 CLOS",
      "dialogue_count": 0,
      "word_count": 3412
    },
    {
      "scene_number": 11,
      "slugline": "INT. COP CAR - NIGHT 141   141 Em and Sarah are in the backseat. Richter starts the car.   * OFFICER RICHTER   * I guess little Marty Kolker was   * telling the truth.   * EM   * Believe me, he wasn’t.   * OFFICER RICHTER   * Tell that to the FBI. They just   * called the Chief and confirmed   * Marty’s story about the amount of   * data Lily was uploading.   * SARAH   * Hey Richter, anybody ever tell you   * that you have brain of an infant in   * the body of John Goodman?   * The both start laughing. Em’s eyes go wide.   * OFFICER RICHTER See this is the problem with your fuckin’ generation. You don’t think anything’s real. You think you can just destroy people’s lives like it’s fuckin’ nothing. Well, guess what? (beat) If you girls want to be our judge,   * jury, and executioner than I got no fuckin’ problem being yours.   * In the distance, his headlights come up on Lily, a torn   * stocking covering her face, standing in the middle of the   * street. She has two machetes strapped to her back, three guns   * in the waistband of her skirt and she’s pointing a combat   * shotgun at the cop car.   * RICHTER slams on the brakes. Opens the car door. Holds his gun by his side. Em and Sarah scream from the backseat: EM He’s gonna kill you! RICHTER walks to Lily before stopping about ten feet away. OFFICER RICHTER You sure you even know how to hold that thing, little girl? As RICHTER moves to shoot Lily - A LOUD BLAST.   * INSIDE COP CAR. BLOOD SPLATTERS THE WINDSHIELD of CRUISER.   * As LILY blows RICHTER away.   * She walks to the cruiser and opens the back door. Em and Sarah wrap her arms around her...   *  115.",
      "characters": [],
      "action_text": "SARAH   * I thought you were dead.   * LILY   * Where’s Bex? EM She said to meet her at her house. She was gonna cut through the woods, I think.   * LILY   * Where’s Nance?   * A pained look in Sarah and Em’s face.   * Suddenly, A loud gurgling from Richter. The girls turn. Sarah   * grabs Lily’s shotgun and rounds the police cruiser.   * She looks down at Richter laying in a pool of his own blood.   * He looks up at Sarah, gurgling.   * Close on SARAH:   * SARAH I just want to be clear. This isn’t   * out of vengeance...   * (she cocks the shotgun)   * It’s pity.   * WIDE SHOT. We see headlights of Richter’s car. And the girls   * in silhouette.   * A SHOTGUN BLAST lights up the night sky.   * EXT. SALEM SUBURB - NIGHT 141A   141A   * CAMERA SLOWLY PANS DOWN FROM the NIGHT SKY to find Lily, Em   * and Sarah walking through the streets of Salem, armed to the   * teeth - with machetes, shotguns and handguns.   * EXT. WOODS - NIGHT 142   142 WE SEE Johnny as he gets in DIAMOND’S FACE. JOHNNY C’mon Diamond! Be a fucking man!   * Bex watches as Johnny pushes Diamond toward her. Diamond   * looks at Bex. BEX Please. Please. I’m begging you. Don’t do this. DIAMOND (softly) I’m sorry, Bex.  116. He picks up the other end of the rope and throws it over a tree branch. A ROAR OF APPROVAL from the GUYS. JOHNNY Thatta boy, Diamond! MASKED TEAMMATE Slay ‘em High, Killa! Diamond starts to pull the rope. Bex writhes as she’s lifted to her feet. Johnny is looking at his phone - JOHNNY You see this? The whole town is headed to Lily Colson’s house. MASKED TEAMMATE Oh shit. They’re gonna be out for blood. JOHNNY (to Bex) You hear that? We’re bringin’ all you fuckin’ bitches to justice. The MASKED TEAMMATE BEGINS to FILM BEX on his phone... Bex looks at Diamond, pleadingly.   * BEX   * (choking)   * This isn’t you, please. Look at   * what you’re doing, look at what   * you’re doing. You’re not like this.   * DIAMOND   * (whispered, to Bex)   * I’m so sorry, Bex, but I’m so   * scared.",
      "dialogue_count": 0,
      "word_count": 2817
    }
  ]
}