{
  "slug": "atlanta-2x01-alligator-man-2016",
  "title": "atlanta 2x01 alligator man",
  "genre": "drama",
  "format": "series",
  "scenes_count": 5,
  "characters_count": 0,
  "characters": [],
  "total_words": 5691,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. APARTMENT COMPLEX - DAY (D1) 1   1 A dude,   CURTIS   (20’s) in a retro Falcons starter jacket walks through the cold. It’s rainy. We only see the back of his head/hood as his breath moves past the handheld camera. He walks up two flights of stairs to the second floor. We hear people laughing/talking loud as he passes.   “Master PeeWee” by Peewee Longway   is playing from an apartment. He knocks on Apartment 227. CURTIS Ey, Droop! Another dude,   DROOP   (20’s) answers in his boxers and white t- shirt. They dap. Droop goes inside. INT. APARTMENT - DAY (D1) 2   2 Droop sits back down to his FIFA game. Curtis heads straight to the fridge. CURTIS What’s good? DROOP (sucks teeth) Man, ya boy Marcus Miles goin’ to jail, man. CURTIS Shit, for wha? DROOP Runnin’ over people with that car. CURTIS Damn. They gon’ ban it now. Niggas can’t have anything. Curtis is about to drink some POWERADE from the bottle. DROOP Ey! Curtis stops. DROOP (CONT’D) A cup. Curtis’s face: “fine.” He pulls out a mug from the cabinet, pours himself a drink, and then sits next to Droop.  ATLANTA   - EP #201 - \"Alligator Man\" - Writer's Draft - 04/17/17   1.",
      "characters": [],
      "action_text": "CURTIS Ey, can I tell you ‘bout Chris at the job?   Talm‘bout some, “I got better bars than Scooter.” Boy, if you don’t sit yo ass down wit yo struggle flow.   This nigga talkin’ like he ‘bout to quit off one weak- ass mixtape ain’t nobody listen to. DROOP That nigga wanna be somebody so bad. CURTIS Last year he was the hotep nigga.   Right?   Now he hard? DROOP (CONT'D) Mm-hmm...Mm-hmm. DROOP (CONT’D) He’s so confused. CURTIS He gets on my last nerve, man.   Oh my god. Silence. DROOP So what you on today? CURTIS (wipes face with both hands) Man, I’m just trying to chill before work tonight. I been tryin’ to smoke but my mans ain’t hittin’ me back. DROOP Mm. Silence. DROOP (CONT’D) You know they serve out the Cook- Out? CURTIS What you mean? DROOP Yeah.   You order a number seventeen, they hook you up wit the eighth. 2   2  ATLANTA   - EP #201 - \"Alligator Man\" - Writer's Draft - 04/17/17   2. CURTIS You a lie. DROOP Real talk. CURTIS Who told you that? DROOP Man, ya boy P-Dot. The custodian in on that shit. Curtis gives a look like “oh shit.” CURTIS Shit, we might have to roll through. Get some food too. I can eat and take a nap before tonight. DROOP Lemme finish this. Curtis fucks with Droop’s CONTROLLER. CUT TO: EXT. COOKOUT DRIVE-THRU - DAY (D1) 3   3 Droop rolls up to the Cook-Out ordering board in his NISSAN SENTRA. We see Curtis in the passenger seat. SERVER Welcome to Cook-Out. May I take your order? DROOP Yeah, can I get a Big Double burger, a spicy chicken, both with medium fries. A red cherry shake and a watermelon. SERVER Watermelon is only available in July and August. Droop and Curtis congregate for a moment. DROOP Aight, peach cobbler shake. And a number seventeen. A beat. (2) 2   2  ATLANTA   - EP #201 - \"Alligator Man\" - Writer's Draft - 04/17/17   3. SERVER A number seventeen? DROOP Yeah. And a peach cobbler. Silence. SERVER Sixty-eighty five, please drive to the window. They drive. INT. COOKOUT - DAY (D1) 4   4 The Server/Manager,   VICTOR   (20’s",
      "dialogue_count": 0,
      "word_count": 1014
    },
    {
      "scene_number": 2,
      "slugline": "INT. STORAGE UNIT - DAY (D1) 5   5 The storage unit door opens on Earn’s face and a   MAN   walks in. MAN Ey, man.   You gotta get up. Earn starts to flutter his eye lids. He’s in his underwear. EARN Hm? MAN Gotta go, gotta go. The man starts to look through Earn’s things and pocket them. EARN Ey...Ey!   That’s my shit. MAN You ain’t paid so it’s up for auction, bruh. And you can’t stay in here anymore. They know you’re in here and they comin’. Today. EARN That doesn’t mean you get to take my shit. You gotta actually auction it off. MAN Yeah, I watch “Storage Wars” too. This ain’t that. Earn starts to put on clothes. EARN Can you give me a day to take the things I need? I gotta run some errands. MAN I’m not in charge. The man continues to go through. Earn stares. CUT TO: EXT. ALFRED’S APARTMENT - DAY (D1) 6   6 Earn knocks on the door. Darius opens the door.  ATLANTA   - EP #201 - \"Alligator Man\" - Writer's Draft - 04/17/17   6.",
      "characters": [],
      "action_text": "EARN Eyyyy.   What’s up? Darius looks a little perturbed. DARIUS Sup. He unlocks the screen and walks away. Earn walks in. INT. ALFRED’S APARTMENT - DAY (D1) 7   7 Darius looms in the kitchen making what seems to be sliders. Alfred is on the couch half watching television, half on his phone. EARN Sup, man. ALFRED Sup. Earn plops down. Something seems off. Why’s it so awkward? EARN What ya’ll do last night? Ya’ll go out? Get fucked up? ALFRED House arrest.  (No need for INSERT SHOT bracelet here. Audience will see it later)  EARN Yeah... I know. I was joking. (then) I got y’all this gift. Earn lays this small box down wrapped in newspaper. EARN (CONT’D) My boy hooked me up with this jump drive that lets up torrent movies. Movies that ain’t even out yet. ALFRED Cool. I’ll check it out. EARN Maybe Darius should set it up. You know that shit, right? 6   6  ATLANTA   - EP #201 - \"Alligator Man\" - Writer's Draft - 04/17/17   7. Silence. EARN (CONT’D) Darius? DARIUS What? EARN You could set it up? DARIUS Yeah. Silence. It’s awkward. What the fuck’s going on? Darius slices a slider in half and places in on a plate. DARIUS (CONT’D) You want one, Earn? EARN Sure. Earn gets up and takes a slider. He and Darius eat at the counter. Earn feels weird about Alfred not having one. EARN (CONT’D) You want one, Alfred? ALFRED Nuh. Silence. EARN (to Darius) Can you still gimmie a ride to the P.O.? DARIUS Yeah. Darius gets up and heads to his room. EARN You good, man? ALFRED Yeah. EARN What’s up with you guys? 7   7  ATLANTA   - EP #201 - \"Alligator Man\" - Writer's Draft - 04/17/17   8. ALFRED I don’t wanna talk about it. EARN Aight. Silence. Suddenly, the front door opens. A cute girl,   TARA , walks in carrying two bags from Golden Crust. TARA Hey, Earn. EARN Ey, Regina. She stops. TARA My name’s Tara. EARN Shit.   You remind of this girl named Regina I used to hang with. Sorry. Behind Tara’s back you see Alfred raise his hands like “really, nigga?” As soon as Tara turns to Alfred, Ear",
      "dialogue_count": 0,
      "word_count": 1212
    },
    {
      "scene_number": 3,
      "slugline": "INT. DARIUS’ CAR - DAY (D1) 16   16 Darius parks the car in a parking lot downtown. EARN No. DARIUS It’s true, man. He always gets away with it too. Him and the state government in cahoots. We only get echoes of the truth up here in Atlanta. EARN Why would anyone do that? DARIUS To keep black people from moving to and, or,   becoming registered voters of Florida. Why else? EARN Not Cubans though? DARIUS Cubans are crazy. They love Florida Man, much to his chagrin. But, he don’t like nobody. That’s why I stay ready for him. EARN I thought nobody knows what he looks like. DARIUS I’ll know ‘im when I see ‘im. (then) And when I see ‘im... I’ma blow his fucking brains out. Earn’s expression is along the lines of “Jesus, Darius.” EARN I’ll be back. DARIUS Cool. INT. PAROLE OFFICER OFFICE - DAY (D1) 17   17 Earn sits in a white room waiting. Suddenly,   KEISHA   walks through the door. No nonsense type lady.   Think “Dragnet”.  ATLANTA   - EP #201 - \"Alligator Man\" - Writer's Draft - 04/17/17   13.",
      "characters": [],
      "action_text": "EARN Hey. Keisha sits and looks through the file in her hand, ignoring him. KEISHA Earnest Marks. First-time offender. Narcotics possession with intent to sell? EARN Half a joint. Plus they said the charge don’t even count unless I get another charge- KEISHA Unless you get arrested again.   Not charged. One’s easier than the other. (then) You’ve already paid your entrance fee- EARN Yeah, my jail entrance fee- KEISHA --we’ll need $50 for the mandatory anti-drug class materials and each class is $25, so that’s $325 plus the 50, 375 in total. Are you able to pay this amount at this time? EARN (laughs) No. KEISHA A payment plan will be setup for the remainder of the classes. Please pay promptly or a warrant will be issued for your arrest. EARN Would I even need to show up to these classes if I paid all the fees up front? KEISHA You can’t, so let’s not. (gives a look) 17   17 (MORE)  ATLANTA   - EP #201 - \"Alligator Man\" - Writer's Draft - 04/17/17   14. Take one of those cups by the door, fill it up and leave in the cupboard. INT. DARIUS’ CAR - DAY (D1) 18   18 Darius and Earn are eating Flaming Hot Cheetos. Earn stops. EARN What’s the flavor of a flaming hot cheeto? A beat. DARIUS (matter of fact) Hot. Earn can’t disagree. He is tasting the flavor of hot. His phone rings. INTERCUT: INT. ALFRED’S APARTMENT - DAY (D1) 19   19 ALFRED Yo, where you at? EARN I’m with Darius headed back. Hold on, I’ma put you on speaker. Earn puts him on speaker. ALFRED (O.S.) Nigga, take me off speaker. Earn takes him off speaker. ALFRED (CONT’D) I need you to go over to Willy’s. EARN What’s wrong? ALFRED Yvonne just called me screaming about he kidnapped her. She said she called the cops. Earn closes his eyes like he doesn’t wanna do this. (2) 17   17 KEISHA (CONT'D)  ATLANTA   - EP #201 - \"Alligator Man\" - Writer's Draft - 04/17/17   15. ALFRED (CONT’D) Just make sure he’s good. (then) Earn! You got it? EARN Yeah. I got it. ALFRED Peace. EARN Peace. (to Darius) Can you drop me somewhere? ",
      "dialogue_count": 0,
      "word_count": 2003
    },
    {
      "scene_number": 4,
      "slugline": "INT. WILLY’S HOME - EVENING (D1) 24   24 Earn rushes in, but while we follow him, we see Darius in the back trying to see the alligator, but he’s trying to stand as far away as possible while doing it.   “Love Ballad” by L.T.D .  is playing. It will transition into   “Fire and Desire” by Rick James.   Willy is lighting a Swisher Sweet on the kitchen stove. EARN Willy, I don’t want this to get crazy. DARIUS Oh it’s crazy already. This nigga gotta full grown Caiman in his bathroom covered in chicken carcasses. Shit looks like an Azealia Banks Snapchat. EARN I’m on probation. I can’t be here if this is gonna turn into a shoot out. WILLY Shoot out? Nigga, I’m not crazy. I’m not Florida Man. Super slowly, Darius turns to Earn: “told you.” WILLY (CONT’D) I just know the law. This is my goddamn house. As long as I stay in here, they can’t do shit. EARN Willy, you’re high and getting on my last fuckin’ nerve. WILLY (smiling) Uh-oh. EARN Fulton County has no problem coming in here and cuffin’ all of us. Don’t- A loud BANG comes from the bathroom. Everyone looks at the alligator door. Earn continues. EARN (CONT’D) Don’t be an idiot.  ATLANTA   - EP #201 - \"Alligator Man\" - Writer's Draft - 04/17/17   24.",
      "characters": [],
      "action_text": "WILLY Nigga, you don’t have a home. How you gonna tell me about myself? You don’t own a mirror to look at yourself. Yvonne slowly gets up and walks to Willy. She gives him a fifty dollar bill. YVONNE I know you about your principles, but can we please listen to Earn so we can get out of here. Please. There’s six cops out there and if they come in here they gonna get you on a lot of other shit. We’re hearing more POLICE SIRENS coming in the distance. Willy looks at the bill and finally figures out the words to say. WILLY You lyin’ ass bitch. YVONNE Willy, on my mama I hate you. WILLY Don’t you EVER come back in my house! YVONNE I hope they blow your ass to mothafuckin’ smithereens! WILLY They better! Cause if I find ya, you gonna wish they had. Yvonne walks out the front door. YVONNE (O.S.) This nigga kidnapped me! EARN (to Willy) What the hell is wrong with you? WILLY Why are you wilin’ out about this? You on probation, just leave a nigga. 24   24  ATLANTA   - EP #201 - \"Alligator Man\" - Writer's Draft - 04/17/17   25. EARN This house you’re staying in doesn’t belong to you. The person who owns this house asked me to make sure you’re okay. WILLY Shit, you just can’t go back to Alfred and say you failed? Earn is a little stunned. EARN No. WILLY Uh-huh. You scared. Ain’t no way I’m on probation and still be here. EARN I’m not scared of that. WILLY You gotta stay on his good side cause he’s Mr. Money-Bags now. You know cousin Jarvis used to manage Damon when he was in that group. That’s why they don’t talk no more. You start to realize family is business. EARN I’m not scared of that. WILLY Oh really? EARN Nah, I’m scared I’ll end up like you. A guy everyone knew was smart, but ended up being a know-it-all, fuck-up jay who just let shit happen to him. Willy stares at Earn. WILLY Well damn. Willy heads to his bedroom. A moment. DARIUS The vibe here is starting to feel more and more like jail. So... (2) 24   24  ATLANTA   - EP #201 - \"Alligator Man\" - Writer's Draft - 04/",
      "dialogue_count": 0,
      "word_count": 1074
    },
    {
      "scene_number": 5,
      "slugline": "EXT. STREETS - EVENING (D1) 27   27 Willy, in a robe and Nikes, is running down the street. CUT TO: INT. ALFRED’S APARTMENT - NIGHT (N1) 28   28 Earn and Darius walk in. Alfred is on the couch smoking, writing something, and listening to music through his laptop. ALFRED How’s Willy? EARN Not in jail. Alfred looks: “good enough”. Darius is about to head to his room, but Alfred holds out a blunt to Darius. ALFRED Want some? Darius thinks, then takes the blunt as sign of reconciliation. He sits on the couch arm. Earn pulls out the gold .45. Darius starts to choke looking at it. DARIUS (laughing) What is that? EARN A gun. Willy gave it to me. ALFRED And you took it?! EARN I was trying to help. DARIUS You just gonna hold a gun for somebody with the cops outside? ALFRED The shit is gold! Alfred and Darius crack up. Out of nowhere, a large guy in a white tank,   TRACY,   joins in laughing. He’s eating a bowl of cereal.  ATLANTA   - EP #201 - \"Alligator Man\" - Writer's Draft - 04/17/17   29.",
      "characters": [],
      "action_text": "TRACY Haha! You gotta get rid of that, nigga. EARN Uh... who are you? ALFRED This my boy Tracy. Just got out today. TRACY Sup. EARN Are you staying here? TRACY Goddamn. You the landlord? Tracy plops on the couch. It’s clear he’s staying here. Earn takes this in. EARN Aight. I’ll see you guys. DARIUS Ey. You good? EARN Yeah. I’m good. Earn closes the door behind him. EXT. ALFRED’S APARTMENT - NIGHT (N1) 29   29 Earn stands in the street. It’s cold and he can see his breath. He stares off into the night.  END OF EPISODE.  28   28  ATLANTA   - EP #201 - \"Alligator Man\" - Writer's Draft - 04/17/17   30. WILLY’S SUGGESTED MUSIC PLAYLIST:  “Love’s Train” - Con Funk Shun “The Monster Dance” - (Ron Ford) George Clinton “Super Spirit” - (Junie Morrison) George Clinton “Love Ballad” - L.T.D. “Fire and Desire” - Rick James “Candy” - Cameo “Ghetto Life” - Rick James “Let it Whip” - Dazz Band “Slide” - Slave “You, Me, and He” - Mtume “Love Don’t Live Here Anymore” - Rose Royce “Hey! Love” - The Delfonics  29   29  ATLANTA   - EP #201 - \"Alligator Man\" - Writer's Draft - 04/17/17   31.",
      "dialogue_count": 0,
      "word_count": 388
    }
  ]
}