{
  "slug": "atlanta-101-the-big-bang-2016",
  "title": "atlanta 101 the big bang",
  "genre": "romance",
  "format": "series",
  "scenes_count": 3,
  "characters_count": 1,
  "characters": [
    "DAVE"
  ],
  "total_words": 6339,
  "total_dialogue": 1,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. PRINCETON UNIVERSITY CAMPUS - DAY  TITLES:   PRINCETON UNIVERSITY - 2006  INT. OFFICE - DAY  We are close on   EARNEST MARKS’   face.   He looks tired and  stressed.   His face is tight.   His eyes are glassy with  exhaustion, probably.   He looks struck by something.   That  feeling of “is this happening to me?” that people get when  something unimaginable happens, good or bad. He looks down as  the DEAN speaks.  DEAN (O.S.)  Mr. Marks..?  Earnest doesn’t move.  DEAN (CONT’D)  I really can’t stress the severity  of this situation enough.   Full  scholarships from Princeton are few  and far between and in light of  what’s happened, you’re lucky you  aren’t in jail...Mr. Marks?  Nothing.  DEAN (CONT’D)  You’re obviously a very bright  young man. The accusations against  you aren’t light.   And it would  behoove you to be a little more  cooperative.   Everyone else seems  to have made up their minds and I’m  trying to get a full picture.   Now,  please start from the beginning.  Another nothing.   The dean is getting impatient.  DEAN (CONT’D)  For the past thirty minutes you’ve  said a total of five words to me:  two yeses and an “I don’t know” to  be precise. The door’s closing on  hearing your side of the story.  What you have to say for yourself.  Earnest quickly breathes in deep.   Everything shifts to  Earnest as he stares at the dean. Everyone in the room  freezes.",
      "characters": [],
      "action_text": "EARN  I woke up.  Silence.  EARN (CONT’D)  That’s it.  Papers rustle, zippers yelp, etc.   We can hear the dean  starting to pack up his things.  DEAN (O.S.)  Johanna, please note Mr. Marks  refused testimony.   Make sure his  RA is made aware of his exit. Also,  Call Mr. Suen and let him know I’m  twenty minutes away.  We see the dean leave as Earnest sits there.   We never see  his face.  JOHANNA  This way, Mr. Marks.  He doesn’t move.   Two police officers walk into the doorway.  JOHANNA (CONT’D)  Mr. Mar-  TITLE:   ATLANTA  [“BOBBY JOHNSON” BY QUE STARTS HARD AS “ATLANTA” COMES UP.]  EXT. ATLANTA - DAYBREAK  The sun is rising over Atlanta.   It’s a hot day.   Already in  the seventies. You can see kids walking to school and a car  with heavy bass cruise by.   Birds.   It’s a really pretty  spring day.  INT. EASTLAKE APARTMENTS - DAY  “Emmit Smith” is still playing in the background.   The  neighbors have it on repeat.   It’s all bass. Middle of the  scene is switches to “Danny Glover” by Young Thug.  EARNEST (27)   is in bed and staring at the ceiling as his  girlfriend   VAN (25)   sleeps in the fetal position next to him.  2. Van starts to move.   She turns over and hits him in the face.  He keeps staring.  VAN  (eyes still closed)  What’d you dream?  EARN  A new one.  She lifts her head up sleepily.   Kinda excited.  VAN  What happened?  EARN  I was swimming in a pool, but it  was like the ocean.   And I was  swimming through the seaweed, but  it was people’s hands instead of  seaweed.   And this girl was  swimming with me and told me to  swim above the hands cause if they  grab you they drown you-  VAN  Who’s the girl?  EARN  I dunno.  VAN  What she look like?  He thinks.  EARN  She was fat and not very  interesting.  VAN  ...okay.  EARN  Then we get out of the pool.   And  it was behind this big house and  the house had these creepy statues  in it.   They all looked scared.   So  I just sat down and looked at the  ground.  VAN  Hm.  3. EARN  Then the house ",
      "dialogue_count": 0,
      "word_count": 1035
    },
    {
      "scene_number": 2,
      "slugline": "INT. MARTA TRAIN - DAY  *This is all   one shot   until Earn gets to the top of the  stairs.  Earn is listening to music on some headphones.   He’s got the  whole section to himself, so his feet are up on the seats.  Listening to “Brad Jordan” by Isaiah Rashad, Earn bobs his  head. You can only hear the song.  A   GIRL   sitting on the train is eating hot fries and staring  out the window.   A girl in a   HEAD WRAP   walks on from a  different car.   A   DUDE   is closely following Head Wrap.   He’s  trying to get her back to the other car.   Head Wrap is  pissed.   She screams at the other girl.   The other girl has a  “get this hoe out my face” demeanor. Earn watches quietly.  It starts to get physical. Earn’s had enough.   He gets up and  solemnly walks onto the next car.   But you can still see them  arguing through the window behind him.   Earn’s back is to  them, so he doesn’t see what we see.   The Hot Fries girl  pushes Head Wrap hard into her seat.   Head Wrap falls into  the seat behind her.   She’s livid now.  Head Wrap pulls out a gun.  BANG.  Earn drops on the floor of the car.   We can hear everything  now, his earphones are off.   He’s pulled off his earphones.  Head Wrap has shot Hot Fries and has turned to the dude she  ran in with.   His hands are up.   They are yelling at each  other.  DUDE  Bitch, what’s wrong wit you?!   You  betta gimmie that muthafuckin gun  for-  She shoots him.  The train has stopped and people start running off.   Earn  runs off and up the stairs away from the commotion.   He  stands with some kids off to the side and watch as police and  security run in.   Head Wrap yells as GUNSHOTS go off.   They  shoot her.  Earn stands there watching.   Three cops step off the train.  They congratulate each other (high fives, hugs, etc.).   A  local news crew has somehow already set up.   They interview  one of the cops for what seems to be three seconds.   They  shake hands, and everyone leaves.  7.",
      "characters": [
        "DAVE"
      ],
      "action_text": "The kids filmed all this on their phones.   They kinda chuckle  and walk off after the commotion.  KIDS  Fuck/Daaammmn, homie/ Shit was  crazy shawt.  The bloody bodies lie on the train still.   The train starts  up again and leaves.   Earn stares.  INT. HARTSFIELD AIRPORT - CREDIT CARD STAND - DAY  Earn and   SWIFF (27)   stand next to their station.   They’re  both in a blue blazer and ties.   Swiff is looking at his  phone.   The banner above their station says “DELTA SKYMILES:  FREE TRIP ANYWHERE WITH SIGN UP!”   There’s a heavyset older  black woman,   LORETTA (54?),   wearing the same tie and blue  blazer.   Loretta looks like a sweet old grandma type.   She’s  speaking with this older white guy.   He’s filling out a form.  Earn sees a dude rushing past.   He tries him.  EARN  Excuse me, sir-  A DUDE  Fuck off.  EARN  I know, right?  Earn steps back with Swiff.  SWIFF  We shut Compound   down , my nigga.  Me and my cousin had like eight  bottles in dat bitch.   Lef out with  like, three hoes.   Each, my nigga.  And we was supposed to hit two-  dollar Tuesdays at Ultimate, but he  had to see his P.O. back in Florida  on Monday.   I’ma go anyway.   You  wanna come?  Earn stares off, lost.   Swiff vines himself.  SWIFF (O.S.) (CONT’D)  (filming)  Bitch niggas be like.  Swiff turns the phone on Earn.  8. SWIFF (CONT’D)  Hey, Earn.   Say something.  Earn slowly turns to camera.   Holding his scowl the entire  time.  SWIFF (CONT’D)  Perfect.  The Vine video on his phone now has Swiff saying “Bitch  niggas be like”   then Earn slowly turning to camera.  EARN  Van’s dating other guys, Swiff.  She’s gonna kick me out.   I’m  broke.   And I can’t sign anyone up  cause I’m not an old lady.  SWIFF  You can’t sign anyone up because  you refuse to lie to people.   You  better stop letting niggas walk  over you and get this money.  Loretta is talking to a white UGA student looking kid with  glasses.  LORETTA  You look   just   like my little  nephew, baby.   That’s a sign.  ",
      "dialogue_count": 1,
      "word_count": 4909
    },
    {
      "scene_number": 3,
      "slugline": "INT. EASTLAKE APARTMENTS - NIGHT  Earnest lies on a couch in the living room, looking sleepy.  He hears a key in the door and perks up. Van walks in the  door and sees Earn on the couch.  VAN  Hello. Don’t tell me you waited up  for me.  EARN  No.   I’m not tripping. You’re a  grown woman. I’m not your keeper.  VAN flashes a faint smile at Earnest. She continues to get  herself comfortable while she walks in the bedroom. Earnest  follows her.  VAN  Where’s my baby? I hope you fed  her.  EARN  Of course. Lottie is asleep in her  crib. I’m not as irresponsible as  you like to believe.  VAN  Yea, let you tell it.  Earn sits on the bed while Van changes into her pajamas.  EARN  So...how was your day?  VAN  (smiling)  How was my date?  EARN  Not what I said.  VAN  You’re such a hater.  Van gives Earnest a love tap to the head.   He grabs her and  kisses her hard.   When he pulls away she looks at him as if  he’s brand new.   She’s struck.  EARN  I know he’s a corny ass dude.  Cause he’s not me.  34.",
      "characters": [],
      "action_text": "Van’s never really seen this.   It’s different.   Kind of a  turn on.  VAN  Maybe. But maybe I like corny  dudes. The kind that have weird  dreams all the time. How was your  day?  EARN  Alright. A little long but it  turned out okay I guess.  Van motions for Earn to get in bed next to her. Earn gets up  off the bed and gets under the covers next to Van.   She turns  on the T.V. The news.  EARN (CONT’D)  Can you tell me how close I am?  “Ey girl.   I’m not trying to fuck,  I just wanna listen to Talib and  vibe   with your energy. Don’t mind  the incense and neo-soul cd  collection. CD’s because  downloading music is illegal.” That  right?  Van laughs. She begins to play with Earn’s hair.  T.V.  A shooting on the eastside of  Atlanta tonight outside of  Dragonfly Chinese restaurant on  Wesley Chapel.   One man was shot  and is in stable condition.  Witnesses say a fight broke out  after two men cat called a woman.  One of the suspects, known as the  rapper “Paper Boy,” was arrested.  Earnest turns to the television. Fuck.  VAN (O.C.)  Oh yeah.   You got that money for  the rent?...Earn?  CUT TO BLACK.  END  35.",
      "dialogue_count": 0,
      "word_count": 395
    }
  ]
}