{
  "slug": "atomic-blonde-2017",
  "title": "atomic blonde",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 12,
  "characters_count": 0,
  "characters": [],
  "total_words": 21005,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. CENTURY HOUSE - GRAY’S OFFICE - CONTINUOUS The office is classic British Empire. Framed conquest maps hang on the walls. A Regent desk in dark wood and oxblood leather chairs. Gray and another man, the Chief of the Secret Intelligence Service known only as “C,” sit across from one another. GRAY Broughton speaks four languages, and her Russian is excellent. C What about her field craft and perishable skills? GRAY She’s an expert in Escape and Evasion, NATO and Warsaw Pact Weapons systems, and hand-to-hand combat. C Knowing the reds as I do, she’ll need to use every damn one of them. There is a KNOCK on the office DOOR. Neither Gray or C stand as Broughton enters the room. GRAY Sorry to pull you in on short notice, Lorraine. You know C, of course. Broughton looks to the emotionless man who remains seated in a straight-back chair. BROUGHTON Yes, of course. C motions towards a chair, and Broughton sits at the table and opens a pack of Woodbine cigarettes. BROUGHTON (CONT’D) Mind if I smoke, sir? Gray pulls a cadet lighter from his pocket, leans across his desk and lights Broughton’s Woodbine. Broughton takes a drag off of her cigarette and exhales. GRAY I’ll get straight to the point. How well do you know, James Gascione?  6.",
      "characters": [],
      "action_text": "BROUGHTON Enough to say hello... We did work together several years back in Istanbul. Gray and C share a quick look, trying to decipher if she is lying to them. GRAY (PRE-LAP) As of yesterday morning Gascione was reported as incommunicado. HARD CUT TO: EXT. WEST BERLIN - DAWN SUPER: “WEST BERLIN, NOVEMBER 1, 1989” 5 AM. Snow is falling. Most Berliners in the French, British and American sectors of this divided city are asleep. A dependable-looking middle-aged man runs down the empty street.(The same man from the photo in Broughton’s vanity) This is JAMES GASCIONE. BROUGHTON (V.O.) Who was Gascione handling? Gascione’s shoes pound the pavement. His lungs burn. Each quick exhale leaves a ghostly trail behind him. Remember the gradation of fear in Gascione’s eyes as he glances over his shoulder. GRAY (V.O.) Gascione was running an agent codenamed Spyglass, a Stasi officer. Two ROUGH MEN chase after him through the snow. They are all business. They are KGB. Gascione cuts through a backyard, hurdles several fences, vaults over a brick wall and lands. He checks over his shoulder again. Nothing. Maybe he lost them. GRAY (V.O.) Spyglass had just delivered a list to Gascione. Gascione sprints towards the river and glances again just as...  7. ... the ROAR of an ENGINE gets his attention. Gascione holds his hands out on instinct, headlights blinding him until he feels the front of a sedan SLAM into his legs just above the knees. Gascione’s body is lifted and then violently pinned against a parked car. Pain surges through his body as he looks down at his mangled legs. The sedan reverses a few feet, and Gascione crumples facedown onto the snowy pavement. The two rough men slowly jog up to the scene as an average- looking man, YURI BAKHTIN emerges from the car and moves towards Gascione. BAKHTIN Look at me. Gascione’s eyes tilt upward at Bakhtin. GASCIONE You... cossack... bastard! Bakhtin presses the barrel of a Makarov pistol onto Gascione’s forehead. The MAKAROV BARKS OUT, an",
      "dialogue_count": 0,
      "word_count": 2296
    },
    {
      "scene_number": 2,
      "slugline": "EXT. WEST BERLIN - TEMPELHOF AIRPORT - PARKING LOT - DAY A forest green BMW 2002 sedan is isolated at the end of the parking lot. The Gentleman and Broughton climb in. INT./EXT. BMW 2002 - CONTINUOUS The Gentleman pulls out of the airport parking lot and onto the main route. They drive in silence. Broughton looks into her side mirror and notices a Saab 900 Turbo tailing them. GENTLEMAN Well... it’s a remarkable time to be in Berlin. BROUGHTON That so? Broughton looks again to her mirror and sees the Saab is still there. GENTLEMAN The music, nightlife and great restaurants. BROUGHTON You’ve got a suggestion? GENTLEMAN For the beautiful people, go to the Palm for a drink. Broughton looks back to the mirror. The Saab speeds up behind them and taps the BMW 2002 in a perfect PIT maneuver. Broughton quickly buckles her seat belt. The Gentleman is too busy controlling the car to notice Broughton reach across and depress the button to his seat belt. The BMW spins off the road, and Broughton braces for impact. The BMW slams into a metal guard rail. The WINDSHIELD SHATTERS, and the Gentleman is ejected onto the hood. Broughton relaxes and looks out at the bloody and moaning body of her driver. A figure drags the Gentleman off the hood and onto the frozen ground. We see Perceval look back through the shattered glass at Broughton. PERCEVAL Welcome to Berlin.  17.",
      "characters": [],
      "action_text": "Perceval stuffs a rag in the Gentlemen’s mouth and secures his mouth, ankles and hands with duct tape. Broughton unbuckles her seat belt and steps out of the BMW. BROUGHTON I could have handled him. PERCEVAL I have no doubt. Question is: What were you waiting for? Perceval drags the Gentleman across to his idling Saab. The boot is already open. BROUGHTON Who does he work for? PERCEVAL KGB. Perceval dumps the Gentlemen into the boot. The Gentleman starts to realize what is happening. Broughton unloads a huge right hand into his face, more as a fuck you to Perceval than anything. The Gentleman’s body goes limp. Perceval shoots her a look, impressive. BROUGHTON I am on the ground five minutes and get blown. PERCEVAL You’re not blown. Perceval slams the boot closed. BROUGHTON He knew my name. PERCEVAL Troubling. BROUGHTON And yours. PERCEVAL Not surprised. Broughton and Perceval move and get into the car.  18. INT./EXT. PERCEVAL’S SAAB - CONTINUOUS The inside of the car is littered with Wienerwald wrappers and empty beer cans. Perceval jams the Saab into gear and speeds away. BROUGHTON How would anyone know I was on that flight? Perceval turns with a peripheral smile. PERCEVAL Those are the kinds of questions that keep us up late at night. BROUGHTON We should message the home office and let them know what happened. PERCEVAL Christ and Mother Mary. London sent you to sort this mess out? BROUGHTON I just go where I am told. PERCEVAL Story of our lives. Checkpoint Charlie, by the way. Perceval points out the windshield. BROUGHTON I’m not here to collect postcards. PERCEVAL Ahhh... You’re all business under that lipstick. Broughton ignores the remark. BROUGHTON I was told you’d be briefed. PERCEVAL Your cover is civil service? Gladys Lloyd, Cambridge-educated lawyer sent by James Gascione’s family to return the body and effects of their now-deceased son, a British subject.  19. Perceval looks for a reaction but gets nothing from Broughton. PERCEVAL (CONT’D) Just how in the ",
      "dialogue_count": 0,
      "word_count": 767
    },
    {
      "scene_number": 3,
      "slugline": "INT. EAST BERLIN’S HOHENSCHONHAUSEN PRISON- NIGHT We see a man built like a Soviet T-10 battle tank. He wears a gray Soviet translation of a Brooks Brothers suit and is all business as he moves into the room. This is ALEKSANDER BREMOVYCH, KGB. A dozen STASI OFFICERS have six EAST GERMAN PUNK ROCKERS and B-BOYZ from the underground night club lined up in their underwear against the wall. There is a wooden table in the center of the room and nothing more. Bremovych sets a carton of Russian “Belomorkanal” cigarettes on the table. BREMOVYCH (in German) You’re not free to go. You may never be free to go. Unless you tell me what I want to hear? Bremovych lights a filter-less Belomorkanal from a pack of twenty five. Four Stasi officers drag a young man over and SLAM him face down onto the table. Bremoyvch holds a small B/W photo of Bakhtin. BREMOVYCH (CONT’D) (in German) Have you seen this man? EAST GERMAN (in German) No. Bremoyvch nods and lays down another photo of Spyglass. BREMOVYCH (in German) Last night at the club, did you see this man? EAST GERMAN (in German) No. Bremoyvch takes a long drag on the filter-less cigarette and then jams it into the young East German’s eye. The young man howls in pain and buckles under his captor’s hands. Bremovych lights another cigarette and holds up the carton for the rest of young men to witness. BREMOVYCH (in German) If I must, I will use all of them to get the truth from you.  21.",
      "characters": [],
      "action_text": "Bremovych turns back to the whimpering young East German. BACK TO: INT. PERCEVAL’S SAAB - CONTINUOUS Perceval and Broughton are driving through the streets of West Berlin. We see outside, a massive wall of graffiti-covered concrete that divides East and West. BROUGHTON I didn’t travel as a QM, so I need you to supply me with a firearm. PERCEVAL This is Berlin, not Tombstone. BROUGHTON Gascione was assassinated, and I was just set up by the KGB. PERCEVAL If the KGB wants you dead, you’ll need more than good looks and a pistol. Broughton looks out the side window. BROUGHTON Turn left here and take me to my hotel. PERCEVAL They said you’d never been to Berlin. How in the hell do you know where your hotel is? BROUGHTON I can read a map, you chauvinistic sonofabitch. Perceval SLAMS on the brakes and pulls the car to a stop. PERCEVAL You may not be declared here by Her Majesty, but I am still the head of this goddamn station, and you’ll respect me.  22. BROUGHTON Respect is a two-way street, Mr. Perceval. Clearly, you don’t want me here. However, C himself gave me this job. PERCEVAL C is an arrogant lapdog and doesn’t know fuck all about the world past the edge of his desk! Broughton opens the door and steps out. BROUGHTON Good night, Mr. Perceval. Broughton crosses the hardscrabble street and walks towards her small hotel, never looking back. INT. WEST BERLIN - HOTEL ROOM - NIGHT A Patrick Nagel print hangs on the wall. The room is equal parts Euro-chic and Miami Vice. We hear the RUNNING WATER from the bathroom. Broughton sits on the edge of the bed watching MTV news on a color Zenith. KURT LODER (V.O.) The civil disobedience in East Berlin continues to build momentum. The disenfranchised youth leaders shout out their protests through the tear gas and water cannons. One eyewitness tells of police beating the peaceful demonstrators with batons. Broughton turns off the sound on the Zenith. She moves the hardcover of “Shibumi” onto the nightstand, picks up the rotary telep",
      "dialogue_count": 0,
      "word_count": 2275
    },
    {
      "scene_number": 4,
      "slugline": "EXT. WATCH REPAIR SHOP - NIGHT Along a quiet street, just around the corner from Zoo Station, is a tiny watch repair shop. Broughton enters with purpose. INT. WATCH REPAIR SHOP - CONTINUOUS Broughton moves through orderly store filled with hundreds of grandfather clocks. A couple of patrons mill about the aisles. In the back of the shop, a middle-aged man known only as the WATCHMAKER stares through magnified jeweler’s glasses at the guts of a “Newman” Daytona. BROUGHTON I’d like to purchase a watch. The Watchmaker never looks up from his delicate work. With a thick German accent: WATCHMAKER I don’t sell watches. I only fix them. BROUGHTON I am looking for an East German watch. WATCHMAKER The East German watches aren’t worth wearing. BROUGHTON I am looking for a Ruhla. WATCHMAKER A Ruhla is very different. BROUGHTON I will pay a premium. WATCHMAKER I sense you’re serious. Come back tomorrow before closing. BROUGHTON Thank you. Broughton exits the shop without another word, and the Watchmaker never looks up from the precision of his work.  33.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 178
    },
    {
      "scene_number": 5,
      "slugline": "EXT. BRANDENBURGER STRASSE 10 - NIGHT A working-class neighborhood. Broughton approaches the apartment building and deftly breaches her way inside. INT. GASCIONE’S APARTMENT BUILDING - STAIRWELL - NIGHT Broughton climbs up a dimly-light stairwell to the fifth floor landing. She quickly shims the lock and steps into apartment 5A without a sound. INT./EXT. APARTMENT 5A - CONTINUOUS Broughton moves through Gascione’s apartment and studies the details of a dead man. The CAMERA FOLLOWS her as she moves to the bedroom, examining. A closet of perfectly-folded clothes and shoes in neat rows. The bed’s made with military corners. A porthole into Gascione’s precise and orderly life. Broughton steps into the living room. She walks towards a Biedermeier Secretaire desk and picks up a framed photo. We see a young James Gascione and David Perceval in the English countryside, Holland & Holland shotguns cradled over their shoulders and freshly-killed rabbits in both of their strong hands. Broughton sets the photo down and takes in the room. Outside the window, Broughton notices the building across the street bathed in blue flashing lights. She leans towards the window for a better view. We see German polizei cars roll to a stop. A dozen OFFICERS advance towards the apartment building. INT. APARTMENT 5A/APARTMENT BUILDING HALLWAY - MOMENTS LATER Broughton moves through the hallway as she hears the polizei five floors below. Broughton pushes a sofa out of the living room and down the short hallway. She pushes the sofa out into the stairwell landing. We hear POLIZEI BOOTS four floors below.  34.",
      "characters": [],
      "action_text": "Broughton moves back to the kitchen and finds what she needs: a box of steel wool and bottle of high-proof rubbing alcohol. Broughton moves back down the hallway. We hear POLIZEI BOOTS three floors below. Broughton piles the steel wool on the sofa, soaks the sofa and steel wool in rubbing alcohol and stands back. Broughton draws a black ski mask from her jacket pocket and pulls it over her head. We hear POLIZEI BOOTS two floors below. Broughton lights a match against the wall and tosses it onto the soaked steel wool and sofa. WHOOOOM! Broughton pushes the burning sofa down the stairs at the advancing polizei and forces them to dive out of the way. The polizei push past flames and climb the stairs. Still wearing the ski mask, Broughton ducks back in the apartment and waits in the darkness. The first officer charges in with his baton in hand. Broughton slams the door and bolts it shut. As the officer turns, Broughton strikes him with blinding speed and then hanging arm throws him to the floor. The officers outside in the hallway are POUNDING on the DOOR. Broughton picks the baton and then cracks it down on the officer. He is out cold. We hear the CHAMBERING of a breaching ROUND into a shotgun, and Broughton rolls out of the way as the LOCK on the front door EXPLODES inwards. Broughton bolts through the living room as a second officer grabs her from behind. Broughton snaps her head back, crushing his nose, and then hip throws her attacker through the glass doors of the balcony. EXT. GASCIONE’S APARTMENT BUILDING - NIGHT Broughton steps over the broken glass and the officer. She quickly climbs out onto the thin features of the building. It’s not gymnastic pretty but sixty feet off the street, Broughton is strong and without fear. Broughton, now on the rooftop, quickly scans the buildings around her as she sprints across the flat roof.  35. Three polizei officers pull themselves onto the rooftop, and the chase is on. Broughton jumps down a staggered rooftop, lands and sp",
      "dialogue_count": 0,
      "word_count": 4438
    },
    {
      "scene_number": 6,
      "slugline": "EXT. KINO INTERNATIONAL CINEMA - MOMENTS LATER Bremovych and his driver pull to the curb at the rear of the movie theater. The Stasi and KGB search the crowd outside for Broughton. Nothing. BREMOVYCH Keep looking for her. The two KGB officers move away from Bremovych’s sedan and back towards the crowd. EXT. EAST BERLIN - DAY Broughton moves through the bombed-out neighborhood left over from the Second World War. She enters an abandoned building on the southwest corner of Arnimplatz. INT. ABANDONED BUILDING - ROOFTOP - CONTINUOUS Broughton moves up a set of crumbling stairs towards the roof. The Berlin Radio Tower looms close. Broughton steps onto the rooftop. We see the young Bartender from the East German Club sitting in one of two lawn chairs on the roof. His newly-dyed hair and tattoos are visible from under his plain jacket. This is MERKEL. MERKEL (BARTENDER) You’re late. BROUGHTON I know. MERKEL And you were followed. BROUGHTON I lost them twenty minutes ago near the Palast der Republik. MERKEL You’re as good as your reputation. BROUGHTON I’m already known by reputation? MERKEL To the right people.  56.",
      "characters": [],
      "action_text": "Merkel sits in one of the lawn chairs and looks out across the drab rooftops to the West. BROUGHTON Is this the best place for a rendez- vous? Merkel points towards the Orwellian tower. MERKEL Keep your enemies close. Please have a seat. BROUGHTON No thanks. MERKEL The watchmaker told me there has been great interest in the black market over the last few days. BROUGHTON I am looking for -- MERKEL A list... It is the desire of you and every foreign officer. BROUGHTON Do you know who has it? MERKEL Some say Bakhtin has it others say he doesn’t. BROUGHTON Where is he? MERKEL No one knows. All this talk of Satchel has people nervous on both sides of the wall. BROUGHTON If Bakhtin or the list surface you must let me know. MERKEL The price will be extremely high. BROUGHTON We will not be outbid. Broughton hands Merkel a fist full of Deutschmarks.  57. BROUGHTON (CONT’D) Five thousand marks to get you started. Broughton moves across the rooftop and down the dilapidated staircase. INT. WEST BERLIN - HOTEL ROOM Broughton laces the wire and SN mirco recording device back onto her body with flawless detail. Checks herself in the mirror, grabs her coat, and is out the door. INT. WATCH REPAIR SHOP - NIGHT The Watchmaker is busy at work, when a solitary man enters the shop and moves towards the back to speak to him. Only when the man arrives do we reveal it is Bakhtin. BAKHTIN I am interested in selling a watch? The watchmaker continues his accurate work. WATCHMAKER Tell me what you are selling? BAKHTIN It’s extremely valuable and the finest quality. The watchmaker looks up at Bakhtin. WATCHMAKER You have my complete attention. EXT. WEST BERLIN - NIGHT The neon signs are bright. The KaDaWe department store is open late, and all is bustling along the Kurfürstendamm. INT. WEST BERLIN - ROUGH TRADE BAR - NIGHT It’s a leather bar. On the wall, a mural-sized painting of a young Ronald Reagan in biker chaps à la “Daddy and the Muscle Academy” by Tom of Finland. We hear “You Spin Me Rou",
      "dialogue_count": 0,
      "word_count": 1598
    },
    {
      "scene_number": 7,
      "slugline": "INT. U6 TRAIN CAR - CONTINUOUS The car is empty as Broughton sits next to Perceval. The train rolls down the tracks towards East Berlin. PERCEVAL Next stop is Friedrichstrasse. On the south side of the station there is a green service door marked “Diensteingang” for the Deutshe Reichsbahn employees. The train begins to slow for the upcoming station. PERCEVAL (CONT’D) The Red Army terror cell and the West German communist party used it for years. On January 18, 1979, I led out the East German double Werner Stiller. BROUGHTON That was you. PERCEVAL My first dance, and I’ve been using the breach point for the last ten years. Broughton and Perceval stand to exit. PERCEVAL (CONT’D) Just do as I do. The doors open, and they step out into the station. INT./EXT. S-BAHN STATION #2 - CONTINUOUS They walk through the station until they reach a green metal door marked just as Perceval said: “Diensteingang.” Perceval waits a beat for several workers to pass and then produces a small key and opens the door. Broughton and Perceval slip inside without a wasted movement. CONTROL ROOM/HALLWAYS They move through an empty control room and down several dimly-light hallways until they reach an exterior door. PERCEVAL Hold.  65.",
      "characters": [],
      "action_text": "Perceval looks out through the dirty industrial glass window at four East German guards standing at attention across the street. Perceval looks at the sweep hand of his watch. PERCEVAL (CONT’D) They turn their backs at the changing of the guard. Outside, four more East German guards goose step towards the group standing at attention. Perceval locks eyes onto Broughton. PERCEVAL (CONT’D) Three seconds to get out of this door and around the building before we’re seen. Outside, the guards goose step to a stop. As their comrades step off duty, the others step forward. PERCEVAL (CONT’D) Now. Perceval opens the metal service door, and they exit in a steady walk. Broughton and Perceval turn the corner just as the East German guards pivot and stand at attention, never seeing them exit the station. EXT. EAST BERLIN - NEIGHBORHOOD/ABANDONED BUILDING - DAY Broughton and Perceval move through a barren neighborhood and quickly enter the door of the abandoned building. From across the street, Spyglass watches their movements with apprehension. INT. ABANDONED BUILDING - MOMENTS LATER Broughton and Perceval descend the stairs to the basement. As they turn the corner, they find Merkel waiting. MERKEL Ms. Lloyd speaks highly of you. Perceval looks to Broughton. PERCEVAL And you as well. At the top of the stairs, Spyglass appears, and all three of them turn. Broughton motions to Merkel.  66. BROUGHTON Watch the street to make sure he wasn’t followed. Merkel nods and moves up the stairs past Spyglass. Perceval steps forward towards Spyglass. PERCEVAL I am confident Ms. Lloyd can get you across. Broughton approaches Spyglass and holds out a small package from Perceval’s office. BROUGHTON You smell like a Stasi officer. Broughton gestures to a small adjoining room. BROUGHTON (CONT’D) There is a bucket of water. Shave off your moustache. Use this soap and cologne, it is from the West. Spyglass takes the package and does as he is told. PERCEVAL How big is this protest supposed to be, anywa",
      "dialogue_count": 0,
      "word_count": 6114
    },
    {
      "scene_number": 8,
      "slugline": "INT. LASALLE’S APARTMENT - NIGHT We see a window of the apartment slide open. Cold air gently blows the curtains. Lasalle listens to a Sony Walkman through headphones as she pours a drink for herself in her bedroom and sets the bottle down. We reveal an INTRUDER wearing a ski mask standing behind her. Lasalle is completely unaware until the electrical cord pulls tight around her neck. Lasalle struggles to free herself. She throws the Intruder off of her and scrambles, gasping for air, towards the bed. The Intruder lunges after Lasalle as she crawls up the bed, reaching for the pillow, her concealed gun just inches away. We hear the downstairs BUZZER of the building. The Intruder climbs on Lasalle’s back, grabs the cord and pulls it tight around her neck. Lasalle’s hand is on the gun, but she doesn’t have the strength to lift it into her palm. EXT. LASALLE’S APARTMENT BUILDING - NIGHT A young couple leaves Lasalle’s building. Broughton slips through the open front door and moves down the hallway. INT. LASALLE’S APARTMENT - NIGHT Lasalle twists around and claws the ski mask off the Intruder. We reveal: Perceval as he pulls back on the cord, and the life fades from her eyes. Lasalle’s body falls to the floor. Perceval moves off of Lasalle’s dead body and begins to search through the apartment. We hear a KNOCK on the door. Perceval is out of time. He turns and climbs out the open window as Lasalle’s front door is pushed open by Broughton. Broughton enters and finds Lasalle’s strangled, warm body on the floor. She moves through the apartment, sees the open window, and looks outside. Nothing. Broughton moves back through the apartment and stops at the bathroom. She looks in and sees it has been converted to a small photo darkroom with a red blub. A clothesline hangs above the develop, fix, and stop trays. We see there are several photos of Broughton that reveal Lasalle’s fixation.  96.",
      "characters": [],
      "action_text": "Broughton closes the door and moves back into the kitchen We see large glass containers of FLOUR, SALT... and SUGAR. Broughton turns over the container, dumping the sugar onto the counter along with a package. Broughton opens the package to reveal a stack of photos. INSERT - PHOTOS Photo 1 - Perceval and Bremovych talking in a club. Photo 2 - Perceval talking to the KGB Sniper, Ivan Yerchenko. Photo 3 - KGB Agent Bakhtin handing Perceval an envelope. Photo 4 - Perceval opening the envelope. Photo 5 - Gascione’s Burcherer timepiece in Perceval’s hand. Photo 6 - Perceval standing over Bakhtin’s dead body. BACK TO SCENE Broughton takes the photos and moves out of the apartment, never looking back at Lasalle’s body on the floor. EXT. BERLIN - FRENCH SECTOR - NIGHT Broughton exits Lasalle’s apartment building and moves into the neighborhood. On the street, a sedan pulls out and follows her. Broughton can sense the sedan’s headlights and picks up her pace towards a busy intersection ahead. Broughton stops at a small newspaper stand and glances toward the street and the approaching sedan. She can now see Bremovych and his driver clearly in the sedan driving towards her. She calmly turns and walks around the corner just as the light turns red. Bremovych’s sedan pulls up just six feet away. Steady now... Broughton looks across the six busy lanes of traffic to the hotel’s taxi stand. Out of the corner of her eye, she watches Bremovych. Then, the sedan’s window starts to roll down. Against the red light, Broughton bolts out into the fray of speeding cars and cuts through the screeching traffic. We hear HORNS HONKING and SHEET METAL SMASHING. Cars slide and pile up in the intersection. Broughton escapes without a scratch.  97. She sprints onto the median, across the next three lanes, and jumps into the waiting taxi. Broughton looks across at the wrecks of a dozen cars. Bremovych stands next to his sedan and watches her escape him once more. INT. ATTACHÉ’S OFFICE - NIGHT The roo",
      "dialogue_count": 0,
      "word_count": 1322
    },
    {
      "scene_number": 9,
      "slugline": "INT. CENTURY HOUSE - ISO-FAC - DAY The ashtray is full of Woodbines. The Nagra III reel to reel records on the table. Gray leans forward and then exclaims: GRAY What happened? Broughton sits in silence for a moment. BROUGHTON I failed, sir. GRAY Your directive was to bring home one body, and you return with two. You were tasked to find the most important list of the last forty years of the Cold War, you come back empty-handed. You’re a bloody disgrace! Broughton leans across the desk. She has had enough. BROUGHTON You sent me into a hornet’s nest. From the moment I touched down, the KGB was on to me. You knew Perceval was on the bubble and he knew not to trust me. You wanted Satchel? Well here he is. Broughton sets down a manila folder. Gray looks through a stack of black-and-white photos from Lasalle’s apartment. Gray lifts a black-and-white photo and shows it to Kurzfeld. BROUGHTON (CONT’D) These photos are damning evidence of Perceval’s involvement with the KGB. Perceval was Satchel. Gray and Kurzfeld looks across at Broughton. BROUGHTON (CONT’D) Three days after Gascione was killed, Bremovych arrives in Berlin. Why? Because Gascione was onto Perceval and he was going to reveal him as the double.  101.",
      "characters": [],
      "action_text": "KURZFELD So Bremovych has Gascione killed to cover for Perceval. Broughton points to the photo of Perceval and Bakhtin. BROUGHTON And once you sent me to West Berlin. Perceval was covering his tracks. KURZFELD The sniper team was meant for you after all. BROUGHTON I think so. I found a French made UHF device in my coat after Spyglass was killed. I now believe Perceval planted it and made it look like Lasalle. FLASH CUT: INT. WEST BERLIN - HOTEL ROOM - NIGHT Broughton sits at the desk in front of the Narga SN mirco recording device. A stack of recorded reel and reel tapes sit next to her. With great precision, Broughton methodically edits sections of tape together from different recorded conversations. BACK TO: INT. CENTURY HOUSE - ISO-FAC - DAY Broughton turns to Gray. BROUGHTON Sir, you told me to “trust know one”. In case you need anymore evidence against Perceval. Broughton pulls out the Narga SN from her purse and sets it on the desk. BROUGHTON (CONT’D) Here is a recording of Bremovych and Perceval. Broughton leans forward and CLICKS on the Narga SN and the mirco reels begin to play her masterfully edited tape.  102. We follow the dialogue back to each scene: FLASHCUT TO: EXT. WEST BERLIN - WALL - DAY Perceval walks with Broughton. Two US ARMY jeeps with SOLDIERS from the 2nd Battalion 6th Infantry patrol past. Perceval gestures towards the Brandenburg Gate. PERCEVAL Look... if you’re going to be here for awhile, we had better play nice with one another. FLASHCUT TO: EXT. PERCEVAL’S APARTMENT BUILDING - NIGHT Perceval is in the alleyway next to his Saab 900 turbo. PERCEVAL Whoever has the list in this new world has all the power. FLASHCUT TO: INT. PALM RESTAURANT - NIGHT Bremovych stands along the Art Deco bar next to Broughton and Lasalle. BREMOVYCH Maybe we could make some sort of arrangement? FLASHCUT TO: EXT. WEST BERLIN - NIGHT We see the bombarded ruins of the Kasier Whelm Memorial Church. Perceval stands next to Broughton. PERCEVAL Deal. FLASHCUT TO:  103",
      "dialogue_count": 0,
      "word_count": 559
    },
    {
      "scene_number": 10,
      "slugline": "INT. PALM RESTAURANT - NIGHT Bremovych stands turns to Broughton at the bar. BREMOVYCH What about the British? FLASHCUT TO: INT. PERCEVAL’S SAAB - NIGHT Perceval stares to Broughton in the parked car. PERCEVAL C is an arrogant lapdog and doesn’t know fuck all about the world past the edge of his desk! FLASHCUT TO: INT. CENTURY HOUSE - ISO FAC - DAY Broughton stares at the mirror of the wall and then at the two veterans of the Cold War. She calmly leans over and CLICKS off the Narga SN and the mirco reels fall silent. BROUGHTON Do you need to hear more? Gray looks at Kurzfeld and leans over, CLICKS his NAGRA reel to reel. The tape stops for the first time in hours. GRAY We are choosing to bury this one, Broughton. Your mission never took place. This conversation and the one that Emmett and I are about to have with C never happened. Broughton sits in silence. GRAY (CONT’D) I’m putting you on leave, effective immediately. Come back fresh in the new year. We’ll start the next decade well-rested. Gray and Kurzfeld stand and exit the room. Broughton sits in the bare light. She slowly lights her last Woodbine and exhales.  104.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 207
    },
    {
      "scene_number": 11,
      "slugline": "EXT. NEWCASTLE, ENGLAND - AIRPORT SUPER: “DECEMBER 1, 1989” A gorgeous blonde steps from a Newcastle taxicab and walks into the airport. It’s Lorraine Broughton. She carries no bags. She walks through security and boards an international flight. EXT. LONDON - DAY C and Gray stroll along the Thames River under a late afternoon sky. C Thatcher is going to have a difficult time with this. GRAY It’s never good when one of our own stumbles. C nods and squints towards the Palace of Westminster. INT./EXT. PAN AM FLIGHT - DAY On the descent, Broughton looks out the window. C (V.O.) Did we ever find the watchmaker? FLASH CUT: EXT. WEST BERLIN- WATCH REPAIR SHOP. We slowly move into the shop window and reveal the watch repair shop is completely empty. GRAY (V.O.) We sent a team to the address Broughton gave us. It was clean, nothing but an empty store front. BACK TO: EXT. PARIS - CHARLES DE GAULLE AIRPORT - DAY Broughton steps up to a waiting taxi and climbs into the backseat without hesitation. The taxi pulls out and drives towards the city of Paris.  105.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 190
    },
    {
      "scene_number": 12,
      "slugline": "INT. FRENCH TAXI - EVENING Broughton is being driven through the City of Lights. The blonde wig is gone, and she’s wearing a new set of clothes. She looks through a small Hermès Kelly bag. Broughton exits the taxi and turns into the early evening. EXT. LONDON - DUSK The sun is nearly gone. Gray and C move their walk off the banks of the Thames and up to the Victoria Embankment. C We’ll have to promote Broughton just to keep her quiet. GRAY Yes, sir. EXT. PARIS - L’HOTEL RITZ - NIGHT Broughton walks across the Place Vendome. The RITZ DOORMAN greets her as she enters the lobby. INT. PARIS - L’HOTEL RITZ - LOBBY/ELEVATORS - NIGHT Broughton moves through the grand lobby, passes the Bar Vendome and stops at the front desk. We don’t hear the conversation. Broughton smiles as she is handed the room key and moves to the elevators at the end of a gilded hallway. EXT. LONDON - NIGHT Gray and C stand outside the black door of Number 10 Downing street. GRAY It’s still hard to imagine David Perceval and Satchel were the same person. C I never really trusted him. INT. PARIS - L’HOTEL RITZ - NIGHT Broughton walks down the hallway to the door of her suite. She enters and takes off her coat.  106.",
      "characters": [],
      "action_text": "A titan of man sits on the couch with his back to her. He stands and turns to reveal: Bremovych. BREMOVYCH (in Russian) Comrade Satchel. BROUGHTON (in Russian) Comrade Bremovych. Broughton moves toward Bremovych, and they embrace. BREMOVYCH (in Russian) I am pleased you choose to meet in Paris before we return home. BROUGHTON (in Russian) I ordered room service from the concierge. Broughton leans in and kisses her counterpart. BROUGHTON (CONT’D) (in Russian) I could’ve done without being shot at in East Berlin with Spyglass. BREMOVYCH (in Russian) The West has made you soft with ideas of individualism, comrade. BROUGHTON (in Russian) My hope is Moscow and the party will be pleased. We hear a KNOCK at the hotel suite door. Broughton walks to the door, and a ROOM SERVICE ATTENDANT enters with a rolling cart and bottles of Dom Perignon and Stoli sitting in silver buckets of ice. Bremovych signs for the bill and tips the attendant. ROOM SERVICE ATTENDANT Merci. Bon nuit, Monsieur. The Attendant turns to Broughton. ROOM SERVICE ATTENDANT (CONT’D) Mademoiselle.  107. Only in this moment do we sense something familiar about him -- he turns and leaves without another word spoken. Bremovych lifts the Dom Perignon from the ice. BREMOVYCH (in Russian) 1961. Very appropriate. Broughton moves to him, takes the bottle of Dom from his hands and sets it back into the ice. BROUGHTON (in Russian) Let’s start with the vodka. BREMOVYCH (in Russian) A good Russian woman. Broughton lifts the bottle of Stoli from the second bucket and pours two glasses of vodka. BROUGHTON (in Russian) That you’ve been ordered to kill, haven’t you? Bremovych doesn’t react and deflects her question. BREMOVYCH (in Russian) Lasalle, Gascione and Perceval they were all worthy enemies. Broughton holds up her wrist and reveals the “Carl F Bucherer” timepiece. BREMOVYCH (CONT’D) (in Russian) They may have won the battle for Berlin, but this... will let us win the Cold War. BROUGHTON (in Russian) Let’s enjoy the n",
      "dialogue_count": 0,
      "word_count": 1061
    }
  ]
}