{
  "slug": "august-osage-county-2013",
  "title": "august osage county",
  "genre": "drama",
  "format": "film",
  "scenes_count": 7,
  "characters_count": 0,
  "characters": [],
  "total_words": 23524,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. BARBARA’S BEDROOM - DAY 11   11  JEAN, fourteen, precocious, sticks her head in.  JEAN  ...Mom?  A sound from the body, still no movement.  BARBARA  Mmm...  JEAN  You didn’t hear the phone?  BARBARA  If it’s your father, tell him to  fuck off.  JEAN  It’s Aunt Ivy in Oklahoma.  New deal. She sits up. CLOSE ON: BARBARA FORDHAM, late-  forties, fully dressed.   She gropes for the phone.  BARBARA  ...Ivy? ...what’s wrong?  Barb stands, moves slowly to the window. Outside: identical  suburban homes, neutral house colors, lawns.  We STUDY Barb as she listens. Greying roots, no make-up, a  few extra pounds.   A woman who, for reasons we don’t yet  understand, has decided to stop giving a damn.  BARBARA (CONT’D)  ...When...?  Jean passes in the hall. Stops, watching as her mother slowly  dissolves, reaches for the sill, lowers herself to sit.  INT/EXT. WESTON HOUSE (PAWHUSKA, OKLAHOMA) - DAY 12   12  A battered Honda Civic makes it’s way up the long drive from  the highway below, dust swirling behind it. It’s hot. Bright.  The Honda parks. IVY WESTON, forties, shy and soft-spoken,  attractive enough but expert at hiding it, climbs out.  Stares up at the trees surrounding the old farm house.   The  precarious old barn out back and untended flower beds.  \"August\" 9/21/12 FINAL WHITE Draft   9.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 214
    },
    {
      "scene_number": 2,
      "slugline": "INT. WESTON KITCHEN - DAY 13   13  Johnna washes a dish at the sink.   Watches Ivy’s arrival  through the kitchen window.   Makes no motion to go to her --  INT. THE WESTON HOUSE - DAY 14   14  Ivy steps into the dark house.   Drapes drawn, lights off.  IVY  Mom...?  (no answer)  Mom?  Steps into the open door of her father’s study.   His vacant  desk chair, untouched papers, dust mots settling in the  sunlight.   She takes a moment, then heads upstairs.   CARRYING  US with her.   Finds Violet, in her bedroom, sitting in front  of her vanity in near darkness, smoking and on the phone.  VIOLET  ...You’ve been out there...?  Barely acknowledges Ivy’s arrival.   The room is unruly.   Bed  unmade.   Clothes draped over chairs. Dresser and night-stands  cluttered with pills, tissue boxes, creams and lotions.  VIOLET (CONT’D)  ...You’re going out yourself...?   *  Ivy wanders into the bath.   More pills, wet towels on the  floor.   She turns off the dripping faucet.   Picks up towels.  VIOLET (CONT’D)  Stop that...  Violet is off the phone, standing in hall, watching Ivy.   Ivy  stops, briefly chastened.   Violet opens a bottle of pills.  VIOLET (CONT’D)  You call Barb?   What’d she say?  IVY  She’s on her way.  VIOLET  What’d you tell her?  IVY  I told her Dad was missing.  \"August\" 9/21/12 FINAL WHITE Draft   10.",
      "characters": [],
      "action_text": "VIOLET  Did you tell her how long he’d been  missing?  IVY  Five days.  VIOLET  What did she say?  IVY  She said she was on her way.  VIOLET  Goddamn it, Ivy, what did she   say ?  IVY  She said she was on her way.  VIOLET  You’re hopeless.  (heads back into her room)  Goddamn your father for putting me  through this. Seen that office of his,  all that mess? I can’t make heads or  tails of it. He hired this Indian for  some goddamn reason and now I have a  stranger in my house. What’s her name?  Ivy follows her mother, returns to tidying up.  IVY  Johnna.   Who was on the phone?  VIOLET  This house is falling apart, something  about the basement or the sump pump or  the foundation.   I don’t know anything  about it.   I can’t do this by myself.  IVY  I called Karen.  VIOLET  What did she say?  IVY  She said she’d try to get here.  VIOLET  She’ll be a big fat help, just  like you.  \"August\" 9/21/12 FINAL WHITE Draft   11.  CONTINUED: 14   14  (MORE) (takes another pill)  I need Barb.  IVY  What’s Barb going to be able to do?  Ivy moves on to hanging clothes back in the jammed closet.  VIOLET  What did you do to your hair?  IVY  I had it straightened.  VIOLET  You had it straightened.   Why would  anybody do that?  IVY  I just wanted a change.  VIOLET  You’re the prettiest of my three  girls, but you always look like a  schlub. Why don’t you wear makeup?  IVY  Do I need makeup?  VIOLET  All women need makeup.   Don’t let  anybody tell you different.   The only  woman who was pretty enough to go  without makeup was Elizabeth Taylor  and she wore a   ton . Stand up straight.  IVY  Mom.  VIOLET  Your shoulders are slumped and your  hair’s all straight and you don’t wear  makeup.   You look like a lesbian.  Violet takes another pill.  VIOLET (CONT’D)  You could get a decent man if you  spruced up.   A bit, that’s all I’m  saying.  IVY  I’m not looking for a man.  \"August\" 9/21/12 FINAL WHITE Draft   12.  CONTINUED: 14   14  VIOLET (CONT'D) VIOLET  There are a lot of loser",
      "dialogue_count": 0,
      "word_count": 1129
    },
    {
      "scene_number": 3,
      "slugline": "INT. WESTON HOUSE - DAY 16   16  Ivy and Charlie follow.  MATTIE FAE  Where’s your mother?  IVY  Upstairs.  CHARLIE  They’ve always had trouble, Ivy.  MATTIE FAE  He’ll come back again, I know he will,  he always does. Beverly is a very  complicated man.  IVY  Kind of like Charles.  CHARLIE  Yes, like Little Charles. Exactly --  MATTIE FAE  Oh.   He’s nothing like Little Charles.  CHARLIE  She just means in their sort of quiet  complicated ways --  MATTIE FAE  Little Charles isn’t complicated,  he’s just unemployed.  The phone begins to RING.   Ivy eyes it apprehensively.  CHARLIE  He’s an observer.  MATTIE FAE  All he observes is the television.  (and)  Why is it so dark in here?  CHARLIE  So you can’t even see Ivy’s point?  That Little Charles and Beverly  share some kind of... complication.  MATTIE FAE  You have to be smart to be  complicated.  \"August\" 9/21/12 FINAL WHITE Draft   16.",
      "characters": [],
      "action_text": "The phone STOPS.   Violet’s answered it upstairs.  CHARLIE  Are you saying our boy isn’t smart?  MATTIE FAE  Yes, that’s what I’m saying.  Ivy steals glances upstairs, concerned about the phone.  MATTIE FAE (CONT’D)  I’m sweating.   Are you sweating?  CHARLIE  Hell, yes, I’m sweating, it’s ninety  degrees in here.  MATTIE FAE  Feel my back.  CHARLIE  I don’t want to feel your back.  MATTIE FAE  Sweat is just dripping down my back.  CHARLIE  I believe you.  MATTIE FAE  Feel it.  CHARLIE  No.  MATTIE FAE  Come on, put your hand here --  CHARLIE  Goddamn it --  MATTIE FAE  Sweat’s just dripping...  Mattie Fae pulls back a set of drapes, finds the light is  blocked by shades sealed with tape.  MATTIE FAE (CONT’D)  Ivy, when did this start?   This  business with taping the shades?  IVY  Been a couple of years now.  \"August\" 9/21/12 FINAL WHITE Draft   17.  CONTINUED: 16   16 Mattie Fae starts peeling off the tape.  MATTIE FAE  Is it that long since we’ve been here?  CHARLIE  Do you know its purpose?   You can’t  tell if it’s night or day.  IVY  I think that’s the purpose.  Ivy goes, Charlie notices Mattie Fae pulling off tape.  CHARLIE  Don’t do that.   This isn’t your place.  MATTIE FAE  The body needs sunlight.  INT/EXT. RENTAL CAR (MOVING) - AFTERNOON A17   A17   *  Jean has on headphones, listening to her Walkman in the back.   *  Barbara’s estranged husband, BILL FORDHAM, drives the rental.   *  Barb’s in the passenger seat beside him, watching the brown   *  countryside pass by.   *  BARBARA   *  What were these people thinking... the   *  jokers who settled this place.   Who   *  was the asshole who saw this flat hot   *  nothing and planted his flag?   I mean   *  we fucked the Indians for   this ?   *  BILL   *  Well, genocide always seems like such   *  a good idea at the time.   *  BARBARA   *  Right, you need a little hindsight.   *  BILL   *  If you want me to explain the creepy   *  character of the Midwest, you’re --   *  BARBARA   *  Please, the Midwest. ",
      "dialogue_count": 0,
      "word_count": 4902
    },
    {
      "scene_number": 4,
      "slugline": "INT. WESTON HOUSE BEDROOM - NIGHT 30   30  Jean sees her father coming, hears his footsteps approaching  across the wooden porch below, the screen door opens quietly.  She slips back into her room and bed, but he doesn’t stop.  Jean waits, listening for her mother.   She doesn’t come.  EXT. SKIATOOK LAKE - NIGHT 31   31  We’re on the old wooden dock, watching a man walking away  from us toward an aluminum rowboat tied haphazardly to the  dock in the moonlight.   He leans down to untie the boat,  looks back at us, directly into camera -- Beverly.  Now we’re traveling BELOW the surface of the lake, through  its dark, tenebrous waters on the moonlit night.   The  rhythmic SLAP of gentle waves. We’re underwater, light  fractures and scatters above us.   We’ve been here before as --  A rowboat SLIPS across our field of vision.   It’s aluminum  bottom cuts through the calm above.  Oars dip on either side, propelling the small craft. It  slows. Stops. Bobs gently. We wait, watch --  Until, suddenly, something hits the surface above, exploding  the calm, coming at us fast, sinking.  INT. THE ATTIC - NIGHT 32   32  Johnna wakes with a start. Sits up, listens intently.  EXT. WESTON HOUSE - NIGHT 33   33  Johnna steps out onto the second floor porch balcony, finds a  police car approaching in the distance, headlights cutting  through the dark country night.  INT. WESTON HOUSE STAIRWAY - NIGHT 34/35   34/35  Barefoot, Johnna quietly descends the stairs.   Approaches the  front door, left open to let in the cool night air.   Undoes  the screen door latch.   Steps outside.  Watches the car arrive.   The driver’s door opens, a sheriff  gets out, silhouetted against the police flashers behind him.  \"August\" 9/21/12 FINAL WHITE Draft   43.",
      "characters": [],
      "action_text": "INT. UPSTAIRS HALLWAY - MOMENTS LATER 36   36  Barbara, bleary-eyed, moves quickly down the dark hall in  her robe.   Bill follows in his boxers and T-shirt, pulling  on pants.   Barb goes to Vi’s door, KNOCKS.  BARBARA  Mom?  She opens the door.   Over her we FIND: Violet, entombed in  her room.   Squinting against the intrusive hall light.  BARBARA (CONT’D)  Mom, wake up, the sheriff’s here.  VIOLET  Did you call them?   I dig in call  them.  BARBARA  Mom.   The sheriff is here.  VIOLET  Inna esther?  BARBARA  What?  VIOLET  Inna esther broke.   ‘N pays me  ‘em...sturck...struck.  BILL  Come on.   Leave her there.  Barbara does, starts for the staircase, meets the just  awakened Jean coming out of her room, concerned.  BILL (CONT’D)  Go back to bed, sweetheart....  Barbara descends the stairs, trailed by Bill. The SHERIFF  waits on the porch, late-forties, handsome, Stetson in hand.  They go to him, but WE HANG BACK with Jean, watching the  scene outside unfold. Bill shakes the Sheriff’s hand. The  Sheriff speaks earnestly to Barbara and Bill.  We can’t hear what’s being said, only murmurs until --  Barbara sinks to her knees.   Bill holds her.   Jean watches.  \"August\" 9/21/12 FINAL WHITE Draft   44.",
      "dialogue_count": 0,
      "word_count": 485
    },
    {
      "scene_number": 5,
      "slugline": "INT. KITCHEN - NIGHT 37   37  Johnna enters, snaps on the light, starts a pot of coffee.  Stoic, inscrutable.  EXT. WESTON HOUSE DRIVEWAY - JUST BEFORE DAWN 38   38  A big pre-dawn sky is changing from black to blue.   The  Sheriff walks to his cruiser, kills the flashers.   Bill joins  him, still barefoot.  BILL  What happened?  SHERIFF  Couple old boys running jug lines in  the lake hooked him.   Pulled him up.  BILL  He drowned.   That’s how he died, from  drowning?  SHERIFF  Looks it.   Yes, sir.  Bill looks off.   Song birds begin their pre-dawn chatter.  BILL  Is there any way to determine if  he... I mean is this an accident,  or suicide --?  SHERIFF  There’s really no way to tell.  BILL  What’s your guess?  SHERIFF  ...Suicide.  And now the full weight of it hits Bill. After a moment --  BILL  How does a a person jump in the  water... and choose not to swim?  INT. WESTON GIRL’S BEDROOM - PRE-DAWN 39   39  Barb pulls on clothes, rakes a brush through her hair. Jean  appears in the door, watches her.   After a moment:  \"August\" 9/21/12 FINAL WHITE Draft   45.",
      "characters": [],
      "action_text": "JEAN  What about Aunt Ivy?  BARBARA  I guess we’ll stop on the way.  Christ, I need to call Karen, too.  Why the fuck am I brushing my hair?  She drops the brush.   And then an odd sound intrudes from  downstairs, a song: “ Lay Down, Sally ” by Eric Clapton.  INT. LIVING ROOM - PRE-DAWN 40   40  The music is LOUD.   We follow Barbara and Jean halfway down  the stairs to REVEAL: Violet, high as a kite, doing a jerky  little dance by the stereo.   The Sheriff stands uncomfortably  by the door, his hat in hand. She shuffles over to him.  VIOLET  Izza story.   Barely’s back.   Did sum  Beer-ley come home?  SHERIFF  Ma’am?  VIOLET  Gizza cig... some cigezze?   Cig-zezz,  cig-zizz... cig-uhzzz...  She laughs at her inability to speak. He takes a Pall Mall  from his shirt pocket, hands it to her.   Lights it for her.  VIOLET (CONT’D)  In the archa, archa-tex?   I’m in  the bottom.   Inna bottom of them.  (and)  Mm, good beat, right?  He nods.   Bill comes back in from outside.  VIOLET (CONT’D)  Barbara?! Is Barbara here?!  BARBARA  (quietly)  Right here, Mom...  Johnna steps in from the kitchen, pensively observing.  VIOLET  Mm, good beat, right?   Idn’t it’s a  good beat?  \"August\" 9/21/12 FINAL WHITE Draft   46.  CONTINUED: 39   39  (MORE) Mmmm, I been on the music... pell man  onna sheriff. Armen in tandel  s’lossle, s’lost? Lost?! From the day,  the days. Am Beerly... and Beverly  lost?  Violet abandons her dance, separates invisible threads in the  air.   The others stand frozen, staring at her.  VIOLET (CONT’D)  And then you’re here. And Barbara, and  then you’re here, and Beverly, and  then you’re here, and then you’re  here, and then you’re here, and then  you’re here, and then you’re here...  EXT. SKIATOOK LAKE ROAD - DAWN 41   41  The sun’s just topped the horizon, throws long early shadows  across the flat expanse of prairie.   Scattered trees, a  ribbon of asphalt leading to a distant lake, telephone poles.  We’re HIGH ABOVE the country road, following the Sher",
      "dialogue_count": 0,
      "word_count": 15578
    },
    {
      "scene_number": 6,
      "slugline": "INT. FRONT HALLWAY - CONTINUOUS 89   89  BARBARA  Ivy, listen --  IVY  Leave me alone.  BARBARA  When Mattie Fae told me, I didn’t  know what to do --  Ivy runs from the house.  EXT. WESTON HOUSE - CONTINUOUS 90   90  Ivy rushes to her car, still followed by Barbara.  BARBARA  I was trying to protect you --  IVY  We’ll go anyway, we’ll still go away.  Ivy gets in the car, starts it, revs the engine.   Barbara  tries to open the car door.  BARBARA  This is not my fault.  Barbara pounds on the car window.  BARBARA (CONT’D)  I didn’t tell you,   Mom   told you!  It wasn’t me, it was   Mom !  The car window slides down.  IVY  There’s no difference.  Ivy floors the car, roars out of the driveway, leaving Barb  standing there.   After a moment, Barb turns, stares up at the  house, angry, resolute. Starts back inside.  INT. WESTON HOUSE - CONTINUOUS 91   91  Finds Violet still at the table, lighting a cigarette.  \"August\" 9/21/12 FINAL WHITE Draft   131.",
      "characters": [],
      "action_text": "VIOLET  We couldn’t let Ivy run off with  Little Charles.   Just wouldn’t be  right.  Barbara doesn’t respond, keeps her distance.  VIOLET (CONT’D)  She’ll be back.   She’s a sweet girl,  Ivy, and I love her to death.   But she  isn’t strong.   Not like you.   Or me.  BARBARA  You knew about Daddy and Mattie Fae?  VIOLET  Oh sure.   I never told them I knew.  But your father knew.   He knew I knew.  But we never talked about it.   I chose  the higher ground.  (and then)  If I’d had the chance, there at the  end, I would’ve told him, “I hope this  isn’t about Little Charles, cause you  know I know all about that.”   If I’d  reached him at that motel, I would’ve  said, “You’d be better off if you quit  sulking about this ancient history.”  BARBARA  ...what motel?  VIOLET  I called over there on Monday after I  got into that safety deposit box. But  it was too late, he’d checked out.  BARBARA  How did you know where he was?  Violet is growing agitated with the interrogation.  VIOLET  The note.   He said I could call him  over at the Country Squire Motel --  BARBARA  He left a note?  VIOLET  And I did, I called him on Monday.  \"August\" 9/21/12 FINAL WHITE Draft   132.  CONTINUED: 91   91 BARBARA  After   you got the money out of your   *  safety deposit box...  VIOLET  We had an   arrangement . You have to   *  understand, for people like your   *  father and me, who never had any   *  money, ever, as kids, people from our   *  generation, that money is important.   *  BARBARA   *  If you could’ve stopped Daddy from   *  killing himself, you wouldn’t have   *  needed   to get into your safety deposit   *  box.   *  VIOLET   *  Well, hindsight’s always twenty-   *  twenty, isn’t it?   *  Barbara stares at her mother for a long moment.   Then --  BARBARA  Did the note say he was going to kill  himself?  No response.  BARBARA (CONT'D)  Mom?  VIOLET  If I had my wits about me, I might’ve  done it different.   But I was, your  father and me both, we were...  Barbara looks of",
      "dialogue_count": 0,
      "word_count": 996
    },
    {
      "scene_number": 7,
      "slugline": "INT. UPSTAIRS HALLWAY/ATTIC STAIRS - DAY 93   93  Violet climbs the staircase on all fours.  VIOLET  Johnna... Johnna... Johnna...  Johnna sets down her TS Elliot, goes to Violet, holds  Violet’s head, smooths her hair, rocks her.   Quietly --  VIOLET (CONT’D)  And then you’re gone, and Beverly,  and then you’re gone, and Barbara,  and then you’re gone, and then  you’re gone, and then you’re gone --  Johnna quietly sings to Violet.  JOHNNA  “This is the way the world  ends...”  VIOLET  --and then you’re gone, and  then you’re gone --  INT. BEVERLY’S PICK-UP - DAY 94   94  ON Barbara as she drives --  JOHNNA (OS)  “...this is the way the world ends,  this is the way the world ends...”  VIOLET (OS)  --and then you’re gone, and then  you’re gone...  We stay on Barb as she slowly pulls herself back together.  Brushes tears from her cheeks.   Laughs darkly.   Notices her  hands are shaking from the adrenaline.  Slows, pulls the pick-up to the side of the road at the top  of a small rise.   Climbs out, stares out over the miles of  prairie.   The wind gently ruffles her clothing, her hair.  CLOSE ON her as she settles into exhausted relief, unsure of  what comes next, but finally on her way as we --  FADE TO BLACK.  \"August\" 9/21/12 FINAL WHITE Draft   136.",
      "characters": [],
      "action_text": "TWCAwards.com",
      "dialogue_count": 0,
      "word_count": 220
    }
  ]
}