{
  "slug": "awake-101-pilot-2012",
  "title": "awake 101 pilot",
  "genre": "thriller",
  "format": "series",
  "scenes_count": 5,
  "characters_count": 1,
  "characters": [
    "DR. LEE"
  ],
  "total_words": 12225,
  "total_dialogue": 1,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. LOWEN’S RESTAURANT/BAR - NIGHT  Britten, suit and tie, steps through barricades holding back  a crowd.  As he does, DET. RICHARD VEGA, 30’s, gregarious, the type of  person who talks to strangers in elevators, steps over.  He’s the only one who seems excited to be at a murder scene.  VEGA  Detective Britten! Over here.  DR. LEE (V.O.)  And they’ve got you working with a  partner?  BRITTEN (V.O.)  New guy. Vega. They just want  someone to hold my hand until they  know I’m okay.  INT. DR. LEE’S OFFICE  Lee leans on his fingers and looks at him.  DR. LEE  And are you okay?  BRITTEN  (long beat)  Yes.  EXT. LOWEN’S RESTAURANT/BAR - NIGHT  There’s a cab with a shattered window, a DEAD DRIVER slumped  behind the wheel.  Vega walks Britten through the scene like a tour guide with a  slight case of nerves. He refers heavily to his notes.  VEGA  So... the driver picked up a fare  downtown, registered this address  with dispatch. Um, he’s still got  his wallet, and there’s a twenty on  the seat beside him, so I think not  only was it not a robbery, it looks  like the fare was actually paid.  Then, either the rider or someone  else puts a gun to the window,  BOOM, BOOM, BOOM... leaves us this  messy little mystery.  BRITTEN  Witnesses?  Vega nods proudly. He’s on that. He motions to an OFFICER who  brings over a WITNESS, knit cap, 30’s, skinny, very polite.  2.",
      "characters": [],
      "action_text": "VEGA  Okay, so I’ve interviewed about  thirty. Basically everybody came  out of the bar when it happened.  But this guy lives in the apartment  building above it, saw from his  window.  WITNESS  After I heard the shots I looked  out, saw a man in a cowboy hat run  that way, up the block, and then  turn into that alley.  VEGA  Thanks. I’ll let you know if I have  other questions.  The Officer leads the witness away. As he goes-  WITNESS  Happy to help.  Vega turns to Britten.  VEGA  Exact same report from the bar  witnesses, just a little more chaos  on the ground. Guy in a cowboy hat  running away, but no one close and  no one who claims to have seen the  shooting.  BRITTEN  What do we know about the driver?  Back to his notes.  VEGA  Right. Driver. Married. No kids.  Dispatcher says he wasn’t the type  to get in an argument. At this  point nothing really suggests he  should be dead except for the fact  that he is.  Britten surveys the scene. Looks past the crowds at the  barricades and notices the building across the street.  BRITTEN  Building looks like it’s got a  secured front door. Let’s see if  they’ve got a camera on it. Might  have caught something we can use.  Vega smiles, stares at him a beat.  BRITTEN (CONT’D)  What?  VEGA  I just, um... want to thank you.  3. BRITTEN  For what?  VEGA  I got passed over for detective  three times before this assignment.  I’m pretty sure I only got the  boost because you requested me. I  just wanted you to know I, uh... I  won’t disappoint you.  Britten’s starts away.  BRITTEN  I didn’t request anyone. If you got  promoted it’s because they didn’t  want to waste anyone else’s time  baby-sitting me.  As Vega takes that in-  DR. LEE (V.O.)  And then what?  BRITTEN (V.O.)  I go home.  INT. BRITTEN’S HOUSE - NIGHT  It’s a modest but homey craftsman bungalow that looks a  million miles from murder investigations.  As Britten steps in, his wife, HANNAH, the woman from the  wreck, late 30’s, stunning, warm, looks down from a ladd",
      "dialogue_count": 0,
      "word_count": 2552
    },
    {
      "scene_number": 2,
      "slugline": "INT. DR. LEE’S OFFICE - CONTINUOUS  Britten looks at Lee.  BRITTEN  I actually wasn’t looking to come  back to work. She sort of forced my  hand.  DR. LEE  She wanted you to get back to a  routine?  BRITTEN  No. She wanted to break all our  routines. She wanted to move. Like  cross the country and start over.  She says it’s hard to live with  that empty room upstairs. My best  argument for staying was that the  seniority and benefits I’d worked  for wouldn’t follow us.  DR. LEE  But you don’t really care about  those things? You just wanted to  remain where you are.  BRITTEN  For me, the room upstairs isn’t  empty.  Lee notes this.  LEE  Detective, I’m going to be frank.  For you to process what’s happened,  heal, and move on, it’s imperative  that you acknowledge what’s real  and what’s fantasy. We can talk  about your dreams, but we have to  accept them as just that, dreams.  Do you understand?  Britten eventually nods.  LEE (CONT’D)  Let’s talk about your partners. Why  do you think they’re different  between your dream and reality?  CUT TO:  INT. POLICE DEPARTMENT  Britten and Vega interview a witness. Vega smiles broadly as  Britten makes notes.  14.",
      "characters": [],
      "action_text": "BRITTEN (V.O.)  I don’t know. I never worked with a  partner before the accident.  CUT TO:  INT. POLICE DEPARTMENT  Britten and Bird are looking over bloody crime scene photos,  pointing out various items, making notes.  BRITTEN (V.O.)  They told me they wanted me with  someone for while and... I don’t  know, I got one in one world and  the other in the other.  INT. DR. EVANS’ OFFICE  Dr. Evans is nodding adamantly.  DR. EVANS  But you said that they don’t like  each other, this Bird and Vega?  BRITTEN  Vega’s just new. Still thinks we  fix things. Bird knows better.  DR. EVANS  It makes perfect sense. Your brain  doesn’t want you to know which  world is real and which isn’t. It  would defeat the purpose of the  coping mechanism. If you had the  same partner, you might invent  details about them in your dream  that were disproved in reality and  you’d suddenly know which was  which. This way, you’re free to  create a story for each of them,  and their animosity helps keep them  from crossing paths and forcing you  to reconcile what you’ve imagined  with the truth. It’s the same  reason you’ve given yourself  different therapists.  INT. DR. LEE’S OFFICE  Dr. Lee closes his notebook.  DR. LEE  It’s these little details and  differences we should focus on.  CUT TO:  15. INT. POLICE DEPARTMENT  Britten and Vega step out of the interview room, call their  next witness in. As they wait Britten looks across the  department at BIRD, NOSE IN A BOOK AT HIS DESK, oblivious.  BRITTEN (V.O.)  Why?  CUT TO:  EXT. RESIDENTIAL STREET - AFTERNOON  Britten and Bird stand outside of a house. There’s a CAR in  the street surrounded by OFFICERS and TECHS.  DR. LEE (V.O.)  Because dreams aren’t meant to be  sustained. When we pull at the  threads they tend to fall apart.  As Britten watches, VEGA GETS INTO A CAR DOWN THE BLOCK.  DR. LEE   (V.O.) (CONT’D)  Your partners are threads. And once  we start to pull on them, I think  we can help you see the truth.  Vega shoots Britten a brief gl",
      "dialogue_count": 0,
      "word_count": 2603
    },
    {
      "scene_number": 3,
      "slugline": "INT. BRITTEN’S CAR - LATE NIGHT  Britten drives, Bird’s words ringing in his ears. The hand on  the wheel has a GREEN rubber band around the wrist.  MATCH CUT TO:  INT. BRITTEN’S CAR - MORNING  Britten’s hand on the wheel, but now with a BLUE rubber band.  He fights the morning traffic as he heads for the station.  As he sits at a light, a YELLOW CAB pulls up beside him. He  looks over as the light changes.  Britten starts his turn into the station, then notices the  cab pulling to a stop right in front. He pauses mid turn.  A BLONDE WOMAN IN A BLACK DRESS AND WIDE HAT gets out. She  puts her purse on the roof, appears to dig for her wallet.  Britten is about to dismiss it when BOOM, BOOM, BOOM, the  woman fires a gun from inside her purse right through the  roof of the cab and into the driver.  As people SCREAM and start to run, the woman looks up at the  station and TIPS HER HAT.  Britten jams on the accelerator and TEARS OUT, barreling over  the sidewalk towards the cab.  The Woman bolts. As Britten dodges pedestrians, the woman  races into an alleyway between the station and the large  office building next door.  When Britten’s way is blocked, he abandons the car and leaps  out only to find OFFICERS sprinting towards him, guns drawn.  OFFICER  FREEZE!  Britten slows up, reaches into his pocket.  OFFICER (CONT’D)  DON’T!  Britten stops, slowly draws his badge, keeps his tone even.  BRITTEN  Detective Britten. I’m just getting  my badge.  The officer holds his bead as Britten produces his badge. A  beat, then, satisfied, they take off towards the alley.  26.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 284
    },
    {
      "scene_number": 4,
      "slugline": "EXT. ALLEYWAY - MORNING  Britten and the officer run down the deserted alley. They  stop, unsure which way to pursue.  Britten spots a side entrance to the office building.  INT. OFFICE BUILDING - CONTINUOUS  Business people move about through the lobby, oblivious to  the scene outside. As Britten eyes them-  OFFICER  Detective!  Britten turns to see the Officer standing next to a trashcan  in an alcove. Hanging out is a bit of BLACK FABRIC.  Britten walks over to the can, pulls the lid off. Inside is  the black dress, hat, and a long blonde wig.  Britten looks up, making eye contact with various people  moving in and out of the lobby. The suspect could be anyone.  OFFICER (CONT’D)  What are we looking for?  Britten looks back at the disguise in the trash.  BRITTEN  I wish I knew.  END OF ACT II  27.",
      "characters": [
        "DR. LEE"
      ],
      "action_text": "ACT III  EXT. POLICE DEPARTMENT - MORNING  Britten and Vega are looking at the madhouse of police and  spectators surrounding the murder scene outside the station.  VEGA  Should I take statements again?  BRITTEN  (shakes his head)  They saw what I saw: someone in  disguise who got away with murder.  The tapes, the witnesses, he likes  that we have everything and still  end up with nothing. Makes him feel  smarter than us. Invisible.  (a thought)  Where would you go if you were  invisible?  VEGA  I’m going to take the 5th on that.  Britten stares into the crowd.  BRITTEN  I bet you wouldn’t be able to  resist admiring your own handiwork.  He turns, walking toward the department. Vega follows.  BRITTEN (CONT’D)  Once he ditches the disguise, he  could stand in that crowd all day  and we’d never know it.  (beat)  We pull the security tapes from all  three scenes, but let them run  through the hours after the murder.  Maybe we get a face that pops up in  all three crowds.  INT. POLICE DEPARTMENT  Britten and Vega sit at a monitor when a TECH approaches,  holding a plastic bag with a single RED HAIR in it.  TECH  Looks like your suspect left  something behind this time.  Britten takes the bag, eyes it.  TECH (CONT’D)  Pulled it out of the wig you found  in the trash. We’ll run the DNA,  but the database is small.  28.  (MORE) Unless he’s been in serious trouble  before we probably won’t get a hit.  VEGA  Hey, we know we’re looking for a  red head. That’s something, right?  BRITTEN  Thanks.  Britten hands back the bag. Vega turns to the monitor.  VEGA  First up, 611 Waverly.  (starting the tape)  Okay, carrot top. Where are you?  The address hits Britten like a brick.  BRITTEN  What did you say?  VEGA  What?  BRITTEN  611 Waverly?  FLASH TO:  WE SEE the parking space, 611 written at the bottom.  VEGA (V.O.)  The restaurant where the cabbie got  killed. That’s the address.  BACK TO:  INT. POLICE DEPARTMENT  Britten is struggling to process this.  BRITTEN  Did I know that? ",
      "dialogue_count": 1,
      "word_count": 5812
    },
    {
      "scene_number": 5,
      "slugline": "EXT. HILLSIDE - NIGHT  CLOSE ON Britten waking up, bloody, hanging from his  seatbelt.  BRITTEN (V.O.)  No.  EXT. HILLSIDE - LATER  Britten is taken in one ambulance as his wife and son, still  unconscious are put into another.  CUT TO:  INT. DR. EVANS’ OFFICE  She’s thinking.  DR. EVANS  Maybe this is all your way of  trying to remember.  (to explain)  Just as you seem to work out your  cases in your dreams, I wonder if  the entire construction of those  dreams is meant to try to draw your  attention to something bigger.  Maybe that your wife survived in  one and your son in the other, or  the fact that you have different  partners is actually all a way of  getting you to think about that  night. Clues, so to speak, as to  what actually happened.  CUT TO:  INT. POLICE DEPARTMENT - NIGHT  Vega is doing paperwork at his desk.  BRITTEN  What are you still doing here?  VEGA  You see all this stuff? Guy had  like a hundred different costumes  in that apartment, was still  showing up to teach 8th grade math  everyday. Nobody suspected a thing.  BRITTEN  It’s one in the morning. Don’t you  have someone waiting for you?  56.",
      "characters": [],
      "action_text": "VEGA  I don’t care if I got the promotion  just to hold your hand. I’m gonna  prove I deserve it. My wife  understands.  A beat.  BRITTEN  Vega. Trust me. Go home.  Britten turns to leave, but Vega doesn’t move. Britten  shrugs. As Britten starts to walk-  VEGA  You were joking right?  BRITTEN  (stopping)  What?  VEGA  About going back to that crime  scene because of a dream. That’s  not why we went, right? Cause, you  know, weird stuff like that, it’s  sort of what they told me to look  out for.  OFF Britten’s expression-  CUT TO:  EXT. CAMPGROUND  Police everywhere, ambulance, reporters. Bird steps next to  Britten. They see the GIRL with officers.  BIRD  She says he kept talking about  marrying her. That the Lord had  brought them together.  (long beat)  So, the red hair. The obsession  with that parking space. They’re  going to ask how you put all that  together.  BRITTEN  Right.  (a beat)  Can we call it a hunch for now?  Bird looks at him.  BIRD  I’ve been a cop for thirty years.  Only seen hunches on TV. But for  now... okay, we go with hunch.  57. We see the Girl being led into an ambulance.  BRITTEN  What happens to her?  BIRD  She goes to an aunt or something.  I’m not sure she even understands  what’s happened yet.  As they watch the ambulance doors close behind the girl-  BIRD (CONT’D)  Remember when you used to think  solved and fixed meant the same  thing?  CUT TO:  INT. DR. LEE’S OFFICE  Dr. Lee leans forward.  DR. LEE  Detective, turning yourself in  circles like this, over and over,  it will catch up with you. This  fantasy is far from a benign coping  mechanism. When your brain should  be resting, recharging, you’re  using it to hold up a detailed and  complicated alternate reality. A  reality that only gets more  complicated the longer it exists.  That is unsustainable, Detective  Britten. I’m afraid that the longer  you continue, the more you  jeopardize your already tenuous  grasp on reality. It is, quite  simply, a road to madness.  A long beat",
      "dialogue_count": 0,
      "word_count": 974
    }
  ]
}