{
  "slug": "babylon-2022",
  "title": "babylon",
  "genre": "romance",
  "format": "film",
  "scenes_count": 12,
  "characters_count": 0,
  "characters": [],
  "total_words": 42823,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. HALLWAY - DON WALLACH’S HOUSE - CONTINUOUS 6   6 -- as he COLLIDES into a tall Chinese-American WOMAN. ORVILLE PICKWICK  Mmm mmm...  The Woman SLAPS Orville so fast he doesn’t know what hit him. As he holds his hand to his reddened cheek, we FOLLOW her, continuing her walk as though nothing had happened. She’s in her early 40’s. She’s wearing a dress of embroidered silk, her hair studded with plum blossoms. Her name is LADY FAY ZHU. You do not fuck with her. As Lady Fay slips behind one door -- we see MANNY exit another. ORVILLE PICKWICK José! José!!! (Manny realizes he means him) Get us some more. Orville hands Manny the bottle -- scurries back into his ROOM -- swings that door shut just as, out of a   third   door -- BOB LEVINE, 50’s, Don Wallach’s fixer, emerges. MANNY He wants more --   LEVINE No. Avoid him. If he spots you again tell him we ran out. MANNY ...It’s only ten o’clock. LEVINE That fucktard doesn’t know what day it is. (points to a lower level) Got another animal task for you. One of the guests brought a chicken as their plus-one and now it’s causing a scene. Can you handle? MANNY Sure. LEVINE Careful, I think someone fed it mescaline. Manny processes. Jesus. We follow him to a GIANT CURVED STAIRCASE. As he descends, we get our first wide view of --  INT. BALLROOM - DON WALLACH’S HOUSE - CONTINUOUS 7   7 Bedlam. Underneath cathedral ceilings we see -- 6.",
      "characters": [],
      "action_text": "YELLOW BALLOONS -- towers of CHAMPAGNE -- overturned CHAIRS -- tux-clad MEN with their pants off -- topless WOMEN on tables. The whole place looks like a Gothic castle-meets-Gilded Age palace descended into chaos and filled with 200 DRUNKS and COKE FIENDS. In the middle of it all -- a 15-piece JAZZ BAND, all black. We land on a trumpeter -- 20’s, handsome, his playing as feverish as the crowd. This is SIDNEY PALMER. A few feet away, a 500-POUND WOMAN is wrestling and beating the shit out of two MALE GUESTS. She BULLDOZES them into the bandstand, wood-chips flying and blood spewing -- but Sidney just keeps playing, unfazed, nonchalantly stepping to the left to avoid the BRAWL, casually ducking while a CHAIR sails through the air. Never misses a beat. WE WHIP PAN BACK -- to Manny, eyes peeled for a CHICKEN, passing a WOMAN walking a MAN in a HORSE’S MASK on a leash, a GUEST Peter- Panning into a table, a DRUNK WOMAN tumbling down the stairs as -- LADY Oh I’m so sorry. A LADY in her 70’s has just cut off his path. Half-hidden behind a purple chiffon veil, a world apart from the crowd, she stares at Manny like an eagle -- swallowing him whole in her gaze. For him this sudden apparition is almost too much to take in at once. Her name is ELINOR ST. JOHN, and with her milk-pale skin, fire-red hair, and blue eyes so sharp and cutting they could slice through glass, she’s some strange, inimitable mix of majesty and madness. ELINOR ST. JOHN Would you mind showing me to the upstairs powder room, my boy? MANNY Uh -- sure -- it’s -- down the hall -- ELINOR ST. JOHN No. Upstairs. MANNY The stairs are pretty steep -- ELINOR ST. JOHN I can be carried. Manny looks at her. And then, suddenly intervening -- EMPLOYEE Evening, Madame, lovely to see you, I have to steal him I’m afraid -- 7. The EMPLOYEE -- his name’s JIMMY -- HURRIES Manny off -- JIMMY What did you say to Elinor? MANNY Who? JIMMY Elinor St. John. (then, seeing something else he needs to run off to --) Look -- never speak",
      "dialogue_count": 0,
      "word_count": 2792
    },
    {
      "scene_number": 2,
      "slugline": "EXT. DON WALLACH’S HOUSE - MOMENTS LATER 15   15 GEORGE MUNN -- teary, drunk, 40’s -- is locked inside a car. Jack ambles over, passing a GUEST strip-dancing to a GUITARIST outside, and calmly knocks on the car window -- JACK She said no, huh?   GEORGE After all we’ve been through! JACK Well to be fair, you only met her a week ago, Georgie. GEORGE (CONT'D) What we had was special, goddamnit!!! JACK I know, buddy, but you’re not going to kill yourself over it, ok? Save the ring and come inside -- a girl’s asking after you. GEORGE (a beat; surprised) ...Yeah? JACK (CONT'D) (nods) That’s right. George exits. Jack turns to the Driver, nods “thanks”. Sotto -- DRIVER Who’s the girl?   JACK (CONT'D) I’ll figure it out.  INT. BACK ROOM - DON WALLACH’S HOUSE - CONTINUOUS 16   16 SMASH TO: Nellie animalistically snorting COKE. Manny watches her. She turns, offers to him. He shakes his head. NELLIE Ah. Never done cocaine? MANNY What? I do cocaine all the time. (Nellie keeps just looking at him) I’ll do a little. Whatever. He does a line. It’s clearly his first time. NELLIE No Paris for me. The French are dumb clucks. You know LaRoy means “the king” in French? I added the “La”. Maybe Niagara Falls. You? Manny takes a moment to recover. Thinks for a second. MANNY I’ve always wanted to go on a movie set. 17.",
      "characters": [],
      "action_text": "NELLIE Yeah? MANNY Yeah... NELLIE Why? A beat. Manny thinks. The coke getting to him more... MANNY I don’t know. I want to be a part of something...bigger... You know? NELLIE Bigger? Than what? MANNY I don’t know... I don’t know... NELLIE You never been on one? 17A. MANNY A movie set? No. You? NELLIE Not yet. Beat. Nellie looks at him again. A moment. A connection. NELLIE (CONT’D) You know you’re not bad-lookin. MANNY ...Thanks.   NELLIE (CONT’D) Take your clothes off. Manny looks at her. Did he hear that right? He couldn’t have. But she just keeps looking right at him. BANDLEADER (JOE HOLIDAY) (PRE-LAP)  And now, ladies and gents -- your star musical attraction of the night!  INT. BALLROOM - DON WALLACH’S HOUSE - CONTINUOUS 17   17 BANDLEADER (JOE HOLIDAY) All the way from Old Shanghai -- the Exotic Sexation -- that Emerald of the East -- that Ornament of the Orient -- the Rose Petal of the Rising Sun -- Miss Lady Fay Zhu!!! From behind the bandstand emerges LADY FAY ZHU -- now in FULL TUXEDO AND TOP HAT. A hush falls over the crowd. Fay takes a drag from a cigarette, coyly eyes the audience -- then starts to SING in a come-hither Chinese accent: LADY FAY ZHU  There’s one pet I like to pet Ev’ry evening we get set I stroke it ev’ry chance I get It’s my girl’s pussy...  The audience ERUPTS. Fay’s voice stays soft, calm, teasing: LADY FAY ZHU (CONT’D)  Seldom plays and never purrs And I love the thoughts it stirs But I don’t mind because it’s hers It’s my girl’s pussy...  (more cheers)  And while often it goes out at night It’s always back before the light No matter what the weather’s like We always have a ball...  (MORE) 18. It’s never dirty, always clean In giving thrills, it’s never mean But it’s the best I’ve seen, and I’ve seen ‘em all...  She SLINKS off the stage. She moves like WATER -- ebbing and flowing past the tables, her eyes slowly roving. She stops at a COUPLE on a couch. Leans over, fondles the MAN’s tie -- then turns to face the WOMAN -- slowly bends ",
      "dialogue_count": 0,
      "word_count": 2565
    },
    {
      "scene_number": 3,
      "slugline": "EXT. ROAD - EARLY MORNING 24   24 Manny drives. Jack’s next to him, passed out.  EXT. JACK CONRAD’S HOUSE - EARLY MORNING 25   25 The car pulls into a Mediterranean-Revival-style ESTATE. Manny parks, turns to Jack. No choice but to carry. Hoisting him up -- MANNY (CONT’D) Do you have keys, sir? JACK My   wife ...is at her mother’s. Manny nods.   Ok...   Suddenly -- Jack BREAKS FREE AND INTO A RUN.  INT./EXT. JACK CONRAD’S HOUSE - CONTINUOUS 26   26 A cavernous, marble-floored interior. BOLTING IN, wide awake -- 27.",
      "characters": [],
      "action_text": "JACK (CONT’D) How ‘bout some music? -- Jack SPEEDS past Manny to a Victrola. LOUD OPERA SWELLS. JACK (CONT’D) (singing along and conducting)  “Guarda il mare come è beeellooooo! Spira tanto sentimeeeeeeento!”   You ‘magine me at the opera? That would’ve made Ina’s folks happy, huh? Within seconds Jack has removed his jacket and shirt. JACK (CONT’D) Now if you’ll excuse me -- I’m gonna go take a piss. He disappears. The opera can be heard everywhere -- one speaker per room. Manny takes it in. Hears Jack urinate while BELTING -- JACK (O.S.) (CONT’D)  “Senti come lieve saaaaaaaaaaaale!”  (then,) Ina’s mom always told her, “I don’t see how you can marry a man who paints his face -- period.” See my point? A pair of shoes FLIES from the doorway. Jack then re-emerges, now shoeless, slipping off his pants. Dramatically tosses them as well. Manny wonders for a second if Jack’s going to fully undress. JACK (CONT’D) Want some almonds? MANNY ...I think I should take you to bed, Mr. Conrad -- JACK (CONT'D) (wolfing down almonds) Back off, I’m not that easy. Jack lights a cigarette, opens a drawer -- pulls out a GUN. JACK (CONT’D) Watch this! Buffalo Bill gave it to me!! He puts one arm over both his eyes, unsteadily aims the gun -- Manny goes wide-eyed,   holy shit   -- Jack FIRES.   BAM!   We hear glass shatter off-screen. Jack uncovers his eyes. JACK (CONT’D) Yep, still got it. Slams the gun down on the table. Devours more almonds, then PUSHES OPEN a pair of doors -- revealing a BALCONY overlooking the hills. 28. JACK They’d’ve preferred me as a “legit”, you know. “Legits” have class. Then -- suddenly seized with inspiration, a fire in his eyes -- Jack turns around and GRABS Manny by the collar: JACK (CONT’D) But you know what we have to do, right? He steps atop a wobbly table and, in boxers, gesticulating with the almonds and a cigarette, half to the hills and half to Manny -- 28A. JACK (CONT’D) We have to redefine the form! The man who fills your gasoline tank goes to the mo",
      "dialogue_count": 0,
      "word_count": 1857
    },
    {
      "scene_number": 4,
      "slugline": "EXT. BATTLEFIELD - OUTSKIRTS OF LOS ANGELES - DAY 37   37 Director OTTO VON STRASSBERGER is losing his shit. We’re in a deep VALLEY outside L.A. proper -- pure wilderness. A card:   9:00 AM.  OTTO VON STRASSBERGER  Dees Sheisse fucks!!!!!!!   GEORGE Please -- Jack’s arriving... We HEAR the ROAR of an engine, a car SPEEDING toward us, and we -- SMASH TO: Jack’s CAR SURGING to a VIOLENT STOP. Jack at the wheel. He pulls his handbrake and turns to a shaken, sweating Manny -- JACK What about pancakes? Should you heat the syrup or let the pancakes do the warming? MANNY (recovering from what seems to have been an insane drive) Uh -- I -- I don’t -- maybe -- heat the syrup...? JACK I agree! (then, seeing George run up,) Ah ha! Meet George Munn. Best producer in the business and my oldest pal. We were one step from jail or dead when we met and now look at us -- not bad for a couple of street rats, huh? (smacks Manny in the chest) Set patrol’s Jim Kidd, by the way -- legend of the Wild West. Made his name killing Apaches. Lives in Brentwood now. What’s up von Cheeseburger’s ass today, Georgie? GEORGE Extras want to renegotiate their pay. OTTO VON STRASSBERGER  Zee Kaiser vood ahv IMPALED dem!!!!  JACK (hopping out of the car) Huh. Well -- put the kid on it. GEORGE ...The kid?   JACK (CONT'D) The kid. The Mexican I brought. He’s great. What’s your name? MANNY Me? Uh -- Manuel. JACK Right, Manuel. Manuel’s great. Put Manuel on it. 35.",
      "characters": [],
      "action_text": "Jack barrels ahead, on to the next thing. George looks at Manny. Confused. Manny is still struggling just to keep up. GEORGE ...You have experience with strikes? MANNY (lying) Uh, I... Yes. Lots. GEORGE Ok, good. These are all junkies from Skid Row so they’re pretty violent. With that, George hurries after Jack, leaving Manny on his own to face -- the scariest group of EXTRAS you’ve ever seen. EXTRA #1 Who’re you?   EXTRA #2 That’s the cocksucker they sent to screw us!!! All the EXTRAS -- sunken eyes, rotting teeth -- TURN to Manny. MANNY Uh... Well, gentlemen -- I believe you all agreed to a day’s work -- EXTRA #3 And I believe I agreed to ram this knife up the ass of the first faggot they sent over -- CUT TO: Jack atop a hill with Strassberger and George. Behind them we see Manny below, getting SWARMED by the MOB. OTTO VON STRASSBERGER And zees is where you kiss ze apparition. She has guided you to your destiny... (aside, to a GRIP) I asked for sticks and you brought a dolly. Why? JACK Yeah, good, I like it. I’m gonna play it   adagio   -- we want poetry after all. Poetry and music. All art aspires to music. Sandwich!!! (immediately a SANDWICH is placed in his hands by a P.A.) Thank you. Speaking of music, I’d like Wagner for the love scene. MANNY: Fleeing the army of bloodthirsty EXTRAS, frantically reaches a bored-looking 60-year-old COWBOY on HORSEBACK. It’s JIM KIDD. The “patrol” Jack mentioned. MANNY Sir -- can I borrow that??? BACK TO JACK: In his element -- JACK Best light is 5:30 to sunset. You got any boards? OTTO VON STRASSBERGER I never storyboard, it is ze instrument of ze coward. 36. JACK Copy that. Alright, I’m gonna go work on three other movies, you shoot the battle and call me when you’re ready. Off that -- GUNSHOTS. Jack turns. Sees Manny atop Kidd’s horse, FIRING Kidd’s GUN in the air and SHOUTING AS LOUDLY AS HE CAN: MANNY  ALRIGHT YOU MOTHERFUCKERS!!!!   Any of you don’t work gets a bullet in the  FUCKING SKULL!!!!  The EXTRAS are scurrying no",
      "dialogue_count": 0,
      "word_count": 5301
    },
    {
      "scene_number": 5,
      "slugline": "INT. SHOOTING STAGE - KINOSCOPE PICTURES - DAY 99   99 CONSTANCE MOORE This goddamned bitch is stealing the scene right out from under me!!! We’re midway through Nellie’s new SHOOT, and Constance is pissed. CONSTANCE MOORE (CONT'D) She’s changing the blocking with every take -- she’s icing her nipples so they perk up through her dress -- NELLIE Fuck you, I ain’t icin my nipples, these are natural. You’re just sore ‘cause yours look like fuckin latkes. CONSTANCE MOORE -- and she placed this in my dressing room! Constance pulls out a GIANT DILDO. The CREW gapes at it. RUTH ADLER I doubt Nellie meant anything by it. Can we try the scene? NELLIE I don’t even know what that is. CAMERA’s up -- Nellie DUCKS out -- ICES her nipples -- does the SCENE: TRAIPSES in, LIGHTS a cig, FLOPS onto a couch. Effortless. CONSTANCE MOORE Stop! She changed the blocking again! D.P. (JAMES WONG HOWE) It’s ok, we can keep up --   CONSTANCE MOORE (CONT'D) Well I can’t! RUTH ADLER Fine, grab her close-up --   CONSTANCE MOORE (CONT'D) No. No close-up. RUTH ADLER ...Well to match-cut with yours -- CONSTANCE MOORE (CONT'D) I’m the star. I get the close- up. Not her. This is my money, my company’s writing the checks -- I decide!!! A beat. Adler hesitates, but has no choice but to acquiesce. Nods “Ok”, starts moving on. We PUSH IN on Nellie -- incensed...  INT. PHONE BOOTH - THAT EVENING 100   100 NELLIE Yeah, Dr. Lubin? I wanna do the operation we discussed. Tonight.  EXT. SHOOTING STAGE - KINOSCOPE PICTURES - THE NEXT MORNING 101   101 Nellie waltzes onto set -- her face completely covered in bandage. 54.",
      "characters": [],
      "action_text": "RUTH ADLER Oh my God... How long will that take to   heal???  ON CONSTANCE, seeing this. Realizing what Nellie’s done...  SMASH TO VARIETY HEADLINES: 102   102 “ Constance Moore pic shuts down due to runaway sked. Moore to eat costs. ” “ Moore production shingle folds. ” “ New Nellie LaRoy pic starts lensing.”  EXT. NEW MOVIE SET - DAY 103   103 A new movie set. Nellie has just shot a medium, turns to the CREW: NELLIE Whaddaya say we try a close-up? No one -- not the DIRECTOR, not anybody -- dares say no. ELINOR ST. JOHN (V.O.)  “She has killed our grandmothers --”  INT. ELINOR ST. JOHN’S OFFICE - DAY 104   104 Elinor St. John is DICTATING to her LACKEY in her OFFICE -- ELINOR ST. JOHN  “ -- and we thank her for it. For common and uncouth though she may be, something about her speaks to us in a language as bracing and vital as life... ”  EXT./INT. NELLIE’S HOUSE - DAY 105   105 Nellie excitedly USHERS a notes-taking Elinor into her NEW HOME -- ELINOR ST. JOHN (V.O.) “ I was lucky enough to visit her home on a weekend. A greater maelstrom of bad taste I have never seen... ” NELLIE ...That’s from the Spanish somethin, I won it playin craps. And this is my teddy bear, I call him Gary Cooper. This here’s the livin room, but I call it the “lovin room”. The house is INSANE. French next to Navajo next to Greek next to Japanese -- a weird doll in a skirt with one red eye and one green. Nellie spritzes herself with perfume as she declaims -- NELLIE (CONT’D) That’s my boyfriend Cole -- say hi. (COLE, a burly boxer, waves) (MORE) 55. And here’s my “Chinese room”. That’s a god they worship there. And that’s a painting of my favorite cowboy, Tom Mix. That’s me at the Eiffel Tower. Here’s my poker table. Oh and in this room’s my cousin Ron who’s come to stay with us. Say hi, Ron. He’s had some law troubles lately. (RON waves; Nellie moves to --) That’s my bed, I put a mirror on the canopy. And over there’s my dad -- he’s my cook and my bus’ness manager. (Robert cooks macaroni, no",
      "dialogue_count": 0,
      "word_count": 7625
    },
    {
      "scene_number": 6,
      "slugline": "INT. CAR - OUTSKIRTS OF LOS ANGELES - DAY 139   139 Fay’s at the wheel. Nellie’s by her side -- red-eyed, a giant makeshift BANDAGE over her neck. Both of them look beyond dazed. For a while, neither of them says a word. Finally -- LADY FAY ZHU You said your call-time’s ten, right? NELLIE Yeah...  EXT. KINOSCOPE PICTURES LOT - DAY 140   140 Fay’s car drives onto the LOT. It’s 10 AM. Fay and Nellie hurry out, but they soon notice -- the lot’s empty. It’s eerily quiet... They reach a DRESSING ROOM -- it’s LOCKED. Fay knocks -- LADY FAY ZHU Hello? Is anyone in there? A beat later -- the door OPENS. A young STAGEHAND looks SHOCKED to see Lady Fay Zhu and Nellie LaRoy standing here. STAGEHAND Uh -- hi -- can I -- help --   LADY FAY ZHU (CONT'D) Yeah we’re here for work. STAGEHAND Oh... But -- studio’s closed... Fay looks at him.   What?  LADY FAY ZHU ...Closed? ‘Til when?   STAGEHAND (CONT'D) ‘Til they...build the soundstage... A beat. Fay and Nellie look at each other. Truly bewildered now. STAGEHAND (CONT’D) Geez, I... Did you...not hear? Can I get you two a sandwich or...something? LADY FAY ZHU ...Hear   what?  STAGEHAND That -- uh -- Wallach...changed his mind when the...“Lion and the Mouse” numbers came in this weekend... (he pauses; then,) It’s all talkies from here on out. And off that -- WE SMASH CUT TO BLACK. 83.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 243
    },
    {
      "scene_number": 7,
      "slugline": "INT. SOUNDSTAGE - KINOSCOPE PICTURES - DAY 141   141 WE FADE IN on an interior shooting stage -- or “SOUNDSTAGE”, as it’s now called. The first thing we notice is the silence. A card:  July 1928  This is the polar opposite of the shooting environments we’ve seen before. Gone is the hustle and bustle. Gone are the movies shooting simultaneously. A few CREW MEMBERS sit and wait quietly -- already hot and sweaty. The rest of the stage is completely empty. Another thing we notice -- the darkness. The only light here is artificial. No open air, no sunlight. The walls are thick and imposing, the doors black slabs. A red lamp hangs over each of the doors, and “SILENCE!” signs are everywhere. The single movie set is of a COLLEGE DORM ROOM. Hanging over it, from the rafters above -- is a GIANT MICROPHONE. In front of the set is a BIG WOODEN BOX with a sheet of GLASS. Inside, pointed through the glass, is the CAMERA. Finally, looming above, also enclosed in glass -- is the SOUND BOOTH, where a sound engineer, LLOYD (from New York) sits at the ready, hands on dials. Something about the whole set-up fills us with dread... NELLIE appears -- in costume as a new college freshman. RUTH approaches her, MAX by her side. In Nellie’s hands is something else we haven’t seen before: a SCRIPT. RUTH ADLER Alright, Nell -- how do you feel? NELLIE I’m ready... RUTH ADLER Yeah? You ok to try a take? NELLIE Yep. RUTH ADLER Ok, great. We’re going to pre-roll first so I’ll cue your entrance. First mark is where you say the line “Hello, college”. Then you head to the phone and we do the rest of the dialogue. NELLIE Sounds easy. 84.",
      "characters": [],
      "action_text": "RUTH ADLER I think it will be. Lloyd -- any directions on voice? LLOYD No, we’re good up here, Ruth! RUTH ADLER Great! Mark, can we fix her makeup? A MAKEUP ARTIST hurries over to hide Nellie’s sweat. NELLIE ...No air conditioning? RUTH ADLER Too loud. A beat. The Makeup Artist finishes. Ruth looks at Nellie. Smiles. RUTH ADLER (CONT’D) Be natural. You’ll do fine.   MAX Alright, places everyone! Nellie manages a smile to Ruth. Nods. Is handed LUGGAGE. Heads behind the DOOR to the SET. A D.P. enters the soundproof CAMERA BOX and CLOSES a door behind him. Other CREW MEMBERS scurry into place -- we hear heavy FOOTSTEPS -- LLOYD Woah, what is that? Silence. Max turns -- sees one of the GRIPS, frozen mid-walk. MAX Harry, what kind of shoes are those? GRIP I... Uh...   MAX (CONT'D) Come on, guys, rubber soles. (shouting out) Everyone, a reminder -- rubber soles only from now on. Ok, camera and sound! The CLAPPER brings the SLATE into position for camera -- CLAPPER Scene 17, Take 1 --   D.P. (BILL) (O.S.) Mark -- Just then -- one of the soundstage doors OPENS -- it’s a P.A. -- MAX CLOSE THAT! (the scared P.A. does so) (MORE) 85. For fuck’s sake, don’t you know what the red light means? WE CUT TO Nellie. Alone behind the set door, running lines   sotto   -- NELLIE  Hello, college... Hiya, this is Joanne from 31 Grimes Hall...  (stops, looks down at her script)  ...31 Grays Hall...  (starts again)  Hiya, this is Joanne from 31 Grays Hall, I jus wanted to...to...  (looks again)  ...to see if the phone worked...  She’s nervous. Starts trembling a bit. The script is stained with SWEAT, splotched with MAKEUP. The INK on some words runs free. CLAPPER (O.S.) Scene 17, Take 1 --   D.P. (BILL) (O.S.) Mark -- Nellie puts the script away. We hear the SLATE. RUTH ADLER (O.S.) And action! The SILENCE that follows is so thick you could cut it with a knife. No mood music. No anything. Finally, gradually, we hear certain sounds emerging. A soft, shallow current of air. Nellie’s BREATHING..",
      "dialogue_count": 0,
      "word_count": 10153
    },
    {
      "scene_number": 8,
      "slugline": "INT. JACK CONRAD’S HOUSE - DAY 192   192 Jack on the phone again, another drink in hand. Card:   4:00 PM . JACK Oh really? Gone for the day?   O-kay...  You know, I think I’ll go see for myself. ... No, I think I’ll do just that. Thank you. He hangs up.  EXT. ROAD - DAY 193   193 He DRIVES at 100MPH.  INT. SOUNDSTAGE - KINOSCOPE PICTURES - DAY 194   194 CLOSE ON -- Sidney playing his horn -- face coated in cork, gleaming under the klieg lights. He’s ripping through the take, fingers flying, eyes locked ahead. We PUSH IN on him... Then -- time seems to slow down -- and Sidney lowers his horn... Looks at it. Has he stopped playing? Is he   going   to stop? Seconds pass -- the music still churning around us... Sidney raises the horn back to his lips -- holds it just a few inches away for one more beat, as if still weighing the decision to go on -- and then -- resumes playing -- buries any and all emotions, sublimates them into the music, spits out the furious final cadenza and -- KINOSCOPE A.D. Great --   cut!   That’s a wrap on Sid! Hearty APPLAUSE. We STAY CLOSE on Sidney -- receiving cheers, various pats on the back. He nods, manages a polite smile -- then grabs a handkerchief and wipes the cork off his face. P.A. #2 Uh, Mr. Torres, we can’t find Ms. LaRoy. CUT TO Manny -- turns to the P.A.,   WHAT?   -- AND THEN BACK TO Sidney -- the cork removed, taking a moment as he looks down at his horn. We linger on his eyes. Something in them has changed... 123.",
      "characters": [],
      "action_text": "DISTRIBUTION EXEC  Terrific   work, Sid. While I have you, let’s talk about your next pictur-- But Sidney just walks away and out the door.  EXT. NELLIE’S DRESSING ROOM - KINOSCOPE PICTURES - DAY 195   195 A parking spot labeled “NELLIE LaROY”. Empty. Skid marks slice the asphalt leading away. Running toward us with the P.A., frantic -- MANNY Where the   fuck   did she go???? -- as, across the alley, we find -- Sidney, horn case in one hand, car keys in the other. He heads to his parked Rolls Royce. Looks like he’s about to get in -- but instead, he just places the keys on the car’s windshield and keeps walking.  OMIT 196   196  OMIT 197   197  INT. IRVING THALBERG’S OFFICE - MGM STUDIOS - DAY 198   198 Doors BURST open -- and Jack enters Thalberg’s office -- seems calm, collected -- SECRETARY (coming from behind him) Mr. Conrad -- Mr. Thalberg’s not -- JACK That’s ok, thank you. I know my way around, I picked the architect. 124. Jack closes the door behind him. Then looks ahead. Thalberg’s office is EMPTY. Jack takes a moment. Walks toward the desk. To his left is a whole line-up of MOCKUPS for POSTERS. A romance. A costume epic. A gangster film. A Western. And a big POSTER for “RED DUST” -- starring CLARK GABLE... Jack takes it in. Lets his eyes drift down to a pile of SCRIPTS. Picks one up as a magazine falls to the floor. He looks. It’s the Photoplay article. “ IS JACK CONRAD THROUGH? by ELINOR ST. JOHN ”. And we PUSH IN ON him now -- his thoughts crystallizing...  EXT. ROAD - DAY 199   199 He DRIVES at 150MPH. An eerie calm now in his eyes...  OMIT 200   200  BACK TO MANNY:   The P.A. is hanging up the phone in NELLIE’S 201   201 DRESSING ROOM, turning to Manny and shaking his head -- P.A. Maybe she went to Cal-Neva?   MANNY  FUCK!!!!!!!  Manny GRABS the phone and CHUCKS IT -- overflowing with RAGE -- then sees DON WALLACH has just arrived, Levine by his side... Suddenly Manny’s eyes fill with fear...  BACK TO SIDNEY:   Lights a cigarette. Reaches a GUARD GATE.",
      "dialogue_count": 0,
      "word_count": 3516
    },
    {
      "scene_number": 9,
      "slugline": "EXT. THE GARDEN OF ALLAH - LAUREL CANYON - NIGHT 211   211 Nighttime. A hotel nestled at the foot of Laurel Canyon. A car pulls up. Manny looks more nervous than we’ve ever seen him. The Count’s at the wheel, a BAG by his side. MANNY He’s here now?   THE COUNT Wilson? Yep. Don’t worry. MANNY And it’s all in there?   THE COUNT (CONT'D) Yep. MANNY And how do you know him -- ?   THE COUNT I sold him keys a while back. He works for McKay. We hand him the bag, he calls McKay and the threat’s off. MANNY I’m -- not used to these kinds of people, you know -- THE COUNT (CONT'D) They’re no worse than movie people. Manny nods. Wants to believe that. Trying to stay calm. THE COUNT You good?   MANNY Yeah. Let’s go. The Count exits the car, BAG in hand. Manny, scared, follows. THE COUNT Remember. A monologue on the next picture.  OMIT 212   212  EXT. COURTYARD - THE GARDEN OF ALLAH - MOMENTS LATER 213   213 We’re in a courtyard modeled on the Alhambra. GUESTS recline on sofas. Middle Eastern MUSIC plays. THE COUNT Wilson! A tough, big-bodied man approaches. WILSON. WILSON Been a while.   THE COUNT (CONT'D) Good to see you. Meet Manny. Wilson shakes Manny’s hand. Towers over him. Spits on the floor. WILSON Nice to meet you, Manny.   MANNY Nice to meet you. 135.",
      "characters": [],
      "action_text": "The Count hands Wilson the BAG. It’s full of WADS OF MONEY. $100 and $20 bills. Wilson checks the number of wads. Seems pleased. WILSON K. Lemme talk to Jim. He heads off. The Count shoots Manny a look. Nods confidently. A few seconds later, Wilson returns, still carrying the bag, his eyes on Manny. WILSON You’re a producer? MANNY Um -- studio executive... 135A. WILSON ...That’s the same thing, yeah? MANNY Uh -- it’s similar. WILSON Jim heard you were a big producer. He’d love to buy you guys a drink. MANNY Oh, that’s very kind but --   THE COUNT Sounds great. Manny looks at the Count. The Count looks back at him. WILSON Great. He’s here now. Follow me. Wilson hawks and spits on the floor again, then starts walking. The Count turns to Manny and whispers: THE COUNT Gotta be polite. One drink. Manny nods. Heart’s pounding but he gets it. They follow. Seated by himself, on a divan shaded by plants -- is JAMES McKAY. He doesn’t look like your typical “tough guy”. Looks kind of normal even. Though there’s something in his eyes that seems -- just subtly --   off ... He’s talking with an ASSOCIATE of his when we arrive. WILSON Jim. This is Manny. And the Count. JAMES M C KAY How do you boys do?   MANNY How do you do, sir. McKay seems polite, friendly. The Associate quietly rises and heads off as McKay motions to the now-empty seats. JAMES M C KAY Sit down, welcome, I’m James McKay. Want a drink? It’s brandy mixed with ether. MANNY Sure...   JAMES M C KAY (CONT'D) Wilson, get us some drinks, please. Wilson spits and nods. Leaves the BAG on his seat. McKay eyes it. 136. MANNY Sir, I’m -- I want to say how sorry I am that -- things got out of hand... JAMES M C KAY Nonsense! I own four casinos in Cal- Neva, if things never got out of hand I’d have nothing to do. You came through. That’s what counts. Manny manages a smile. Nods. A beat. Not sure what to say next. McKay pats the bag. JAMES M C KAY (CONT’D) So you boys friends with Nellie LaRoy? Too bad what happened to her caree",
      "dialogue_count": 0,
      "word_count": 1618
    },
    {
      "scene_number": 10,
      "slugline": "INT. WILSON’S CAR - NIGHT 214   214 Manny and the Count are seated in the back of Wilson’s car. Wilson and McKay are in the front, McKay’s face now lathered in makeup, the BAG on McKay’s lap. Manny turns backward -- sees the lights of the city recede into the distance as the car winds its way up the hill and into dark forest... JAMES M C KAY (CONT’D) I had some ideas for Negro pictures too ‘cause those seemed hot, but I just read the Negro vogue is over. Manny nods. Can’t even listen. Too filled with terror. Eyes the BAG on McKay’s lap -- THE BAG FILLED WITH PROP MONEY... Wilson drives further and further outside L.A. proper, deeper and deeper into wilderness. Soon all you see out the window is PITCH BLACK. Manny eyes the Count.   This is so bad...  EXT. THE BLOCKHOUSE - OUTSKIRTS OF LOS ANGELES - NIGHT 215   215 Wilson’s car pulls into a lot -- outside an unadorned hole in a hill in the middle of fucking nowhere. This is THE BLOCKHOUSE. THE COUNT Um... What’s this...? JAMES M C KAY You’ve never been? It’s great for a night-cap. They do all the stuff here I can’t get away with even in Cal-Neva anymore. Manny and the Count take this in. Not reassuring. Wishing they did not have to, they follow McKay and Wilson (who holds the BAG). JAMES M C KAY (CONT’D) Welcome to the asshole of Los Angeles! We ENTER. Inside...  INT. THE BLOCKHOUSE - OUTSKIRTS OF LOS ANGELES - CONTINUOUS 216   216 ...is even worse. Dark-red lighting, MEN banging on thudding DRUMS while two barely-clothed WOMEN viciously FIGHT each other inside a CAGE and drug-addled SPECTATORS cheer. A sign: “WILD CAT COMBAT!” The WOMEN aren’t play-fighting: they’re biting and tearing at each other with CLAWS on their nails. Blood SPEWS. The SPECTATORS look terrifying as well: dope addicts, junkies, drugged and crazed. JAMES M C KAY (CONT’D) He’s two floors down! Follow me! Shouting over the drums, McKay gestures to a CRYPT-LIKE STAIRWELL. 142.",
      "characters": [],
      "action_text": "MANNY We can wait here!   THE COUNT Yeah, we’re good up here! JAMES M C KAY Trust me, you got to see him perform! Every instinct in their bodies screaming at them to run, Manny and the Count instead follow McKay. The STAIRWELL feels medieval: cold stone steps, heavy walls, moisture in the cracks. They reach... ...the FIRST BASEMENT FLOOR. The walls to the right are lined with CHAINS and what look like medieval INSTRUMENTS OF TORTURE: an IRON MAIDEN, a RACK, a SPIKED WHEEL. On the other side, behind BARS, are NAKED PEOPLE, a few in GIMP MASKS, some with bruises and bleeding backs. They clutch at the bars. Some laugh, others whimper. The walls here seem to be lined with EXCREMENT... JAMES M C KAY (CONT’D) One more floor. Manny and the Count share a look. The Count’s just as terrified as Manny at this point. McKay walks ahead, heading further down the stairs. Wilson follows him. Manny and the Count follow Wilson. The deep   thump-thump   of the drums above recedes as our characters descend. We start to hear frenzied SHOUTS and CRIES. We reach... ...the SECOND BASEMENT FLOOR. Here, CIRCUS “FREAKS” (a BEARDED LADY, an ELEPHANT MAN and others) sit in cages or on leashes as NAKED WOMEN take them out and FUCK them in front of ONLOOKERS. JAMES M C KAY (CONT’D) Hm. Not this floor either. Wilson, isn’t he on tonight? WILSON I thought he was... Manny watches as McKay and Wilson discuss -- while behind them, the crazed CROWD chucks dollar bills at a pair of SIAMESE TWINS, who are getting fucked by two WOMEN at the same time. MANNY Um -- sir -- we’re -- we’re running low on time, actually, so perhaps -- JAMES M C KAY Bullshit, you came all the way out here! I promised you a sight, you’re getting a sight. Let’s try one more -- He heads back down the stairs. Wilson looks at Manny and the Count and nods for them to follow. They do... Down another flight of stairs we go, until the group reaches -- a DOOR. It’s closed shut. McKay OPENS it -- it’s heavy -- and ushers the others through",
      "dialogue_count": 0,
      "word_count": 2963
    },
    {
      "scene_number": 11,
      "slugline": "INT. MANNY’S HOUSE - MORNING 219   219 Manny BUSTS inside. It’s morning. He’s frenzied, follows a trail of coke to the couch -- where Nellie’s passed out. GRABS her, SHAKES her awake. She’s even higher than when we last saw her. MANNY  Levántate, levántate --   NELLIE ...the fuck? Manny opens one drawer after another, grabs any CASH he can find -- digs through a mess of clothes, finds a PASSPORT, grabs it -- MANNY Get dressed --   NELLIE (CONT'D) What’s goin on...? MANNY We’re going to Mexico.   NELLIE (CONT'D) Mexico? MANNY Yes -- now get fucking dressed! NELLIE (CONT'D) Are you   crazy , I’m not goin to Mexico with you, go hit a piñata if you’re homesick. Manny THROWS a jacket on her and just PUSHES her out the door -- NELLIE (CONT'D) Hey I gotta brush my teeth --   MANNY No you don’t.  EXT. MANNY’S HOUSE - CONTINUOUS 220   220 Manny gets Nellie into the car, the Count’s already inside -- NELLIE Oh, hi --   THE COUNT Hi, Nellie. NELLIE You got any heroin?   MANNY Don’t give her anything. -- SLAMS on the gas and TEARS out the driveway. 150B.",
      "characters": [],
      "action_text": "OMIT 221   221 150BA. OMIT 222   222 151. OMIT 223   223 152. EXT. THE COUNT’S APARTMENT BUILDING - LATE AFTERNOON 224   224 The car SCREECHES to a stop in front of a shitty-looking apartment building. We’re back in L.A. proper. Tenements and empty lots. MANNY (CONT’D) Ok. You pack what you need, Nell and I get gas, we meet back here in ten minutes and we drive to the border. The Count NODS. HURRIES out -- and Manny and Nellie DRIVE off. 153. INT./EXT. MANNY’S CAR/ROAD - MOMENTS LATER 225   225 Manny drives while Nellie does coke in the passenger seat. MANNY (CONT'D) ...Stop it .   NELLIE Suck my dick, Señor Avocado. They pass one building after the next -- but no GAS STATION... NELLIE (CONT'D) I wanna   dance...   MANNY  Estas loca... Loca...  NELLIE C’mon -- let’s go   dance...   MANNY (CONT'D) Where the fuck is the   gas...?  NELLIE  Where zee fahck ees zee gahhhhs?  MANNY (CONT'D) (spotting a GAS STATION)  PUTA!!!!!!!!!!  The station is closed. Nellie laughs. Manny SPEEDS UP, sweating -- Nellie grabs a PILLOW, starts SMACKING Manny in the head with it. MANNY (CONT'D)  Puta puta puta puta puta --   NELLIE God, calm   dowwwwwwwwwwwwwn...  MANNY Nellie --   despierta!   These people find us we’re dead.  ¿Entiendes? Muertos. Estamos muertos.  NELLIE  I told you to stop fuckin speakin Mexican!!!!  Then -- Manny spots an OPEN STATION.   Yes.   Nellie puts her hands over his eyes. He SCREAMS, SWERVES, she cackles with laughter as he manages to PULL IN. The ATTENDANT is napping, Manny PUMPS -- MANNY Come on, come on, come on --   NELLIE Maybe they got dancin... Finally the TANK is full. Manny pays, looks -- Nellie’s gone. MANNY Nellie!!!!!!! 154. Then he sees her. Crossing the road -- nearing a corner CAFE... MANNY (CONT’D) Where the fuck are you going????!? Nellie turns to Manny. Points excitedly to a sign by the door: “KING TITO’S SIX vs. THE JUAN BONILLA ORCHESTRA!” MANNY (CONT’D)  ESTAS LOCA, PENDEJA!!!!!!!!!!!!!!!  But of course it’s no use -- Nellie casually saunt",
      "dialogue_count": 0,
      "word_count": 3185
    },
    {
      "scene_number": 12,
      "slugline": "EXT. KINOSCOPE PICTURES - DAY 240   240 An hour later. Manny slowly walks the studio lot perimeter...  OMITTED 241   241  EXT. CITY STREET - DAY 242   242 Late afternoon now. Manny passes an APPLIANCE STORE selling TELEVISION SETS. Next to it, a PIN-UP SHOP. Images of Marilyn Monroe. Then, further down the block -- a MOVIE THEATER. He stops. Looks at it. An Art Deco entrance. A fleet of Technicolor posters beckoning. He takes it in. Then continues on. We continue with him. He stops at the end of the block. Waits at a crosswalk. Seems hesitant. Behind him we can still see -- the theater. Finally -- he turns back. Looks at it again. He walks back toward it. Wavers in front of it. Uncertain again. TICKET CLERK You coming in? Manny’s surprised to be addressed. Then -- as though he no longer has a choice -- he heads to the booth, and buys a ticket.  INT. MOVIE THEATER AUDITORIUM - CONTINUOUS 243   243 Manny enters the darkened theater. We hear a CHORUS singing. CHORUS  All I do is dream of you The whole night through, With the dawn I still go on Dreamin’ of you...  Manny looks around. Hasn’t been in a theater for some time. Finds a seat. Leans back. Turns his attention to the SCREEN -- a bright, lush Technicolor image, CHORINES in pink outfits, singing and dancing. We may recognize a few faces -- Debbie Reynolds, Gene Kelly. At this point, we may even know which movie it is. Manny does not... His eyes drift -- from the screen to what else is around him. It’s a fairly packed house. He’s one of the older people here. A mostly young audience -- and one that seems to be enjoying itself very much. Then he hears something -- CHARACTER IN MOVIE  “The Jazz Singer”, that’s what’s the matter, “The Jazz Singer”...  164.",
      "characters": [],
      "action_text": "Manny turns back to the screen. Did he just hear that right? CHARACTER IN MOVIE (CONT’D)  No no, this is no joke, Cosmo, it’s a sensation, the public’s screaming for more: talking pictures, talking pictures!  Manny is taken aback. The movie’s about the birth of the talkies. He takes it in, struck by the sheer surreal déjà vu of it all as -- A MONTAGE flits by on the screen -- newspaper headlines like “REVOLUTION IN HOLLYWOOD” and “STUDIOS CONVERT” -- and then, the movie’s CHARACTERS scrambling to shoot their first talkie... Manny sits there, amazed. It’s as though he’s wandered into a screening of his own life. He sees a SOUND CHIEF in a SOUND BOOTH, shaking his head. A DIRECTOR, growing more and more frantic. An 18TH-CENTURY SET just like the one Manny worked with Nellie on. He keeps watching as the scene descends into TOTAL COMEDY -- cables getting tangled up, the director losing his sanity. There seems to be a little of Jack Conrad in Gene Kelly’s character... GENE KELLY  “I love you, I love you, I love you...”  ...and a lot of Nellie in his costar, played by Jean Hagen... DICTION COACH (speaking like Elinor)  “Pierre, you shouldn’t have come...”  JEAN HAGEN (nasal, screeching)  “Pierre, you shouldn’t have come!!!”  The characters flail around -- as the audience in Manny’s theater LAUGHS HYSTERICALLY. Manny turns, watches the people around him convulsing, eating it all up -- having the time of their lives. Manny can’t believe it.   How can they laugh so callously?   He glares -- pissed now. Looks back at the screen -- furious to see events he feels so close to be so glibly mocked. Keeps watching, the images becoming even more personal now -- the scene of a MOVIE PREMIERE, where Jean Hagen’s character, dolled up like an 18th- century MARQUISE just like Nellie was, butchers lines with her nasal screech -- JEAN HAGEN (CONT’D)  “My father has me betrothed to the Baron de Landsfield, and I can’t stan’ ‘im.”  The SPECTATORS on-screen roar with laughter -- as do those a",
      "dialogue_count": 0,
      "word_count": 1005
    }
  ]
}