{
  "slug": "bad-boys-for-life-2020",
  "title": "bad boys for life",
  "genre": "action",
  "format": "film",
  "scenes_count": 17,
  "characters_count": 0,
  "characters": [],
  "total_words": 24256,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. BURREL PRISON - VARIOUS - SAME The extraction team makes their way through the prison. A gunman attaches an explosive to a lock. BLOWS FREE the door. INT. BURREL PRISON - UTILITY ROOM - SAME A gunman cuts wires to the electrical grid. INT. BURREL PRISON - CELL BLOCK - SAME The lights SHUT OFF -- leaving guards vulnerable to the extraction team, wearing night vision. They CUT THEM DOWN. INT. BURREL PRISON - ISOLATION WING - MOMENTS LATER The hallway door EXPLODES. TEAM LEADER crosses up to Luga’s cell. Attaches another charge to the door. It blows open. Luga steps out. Instantly demands: LUGA  Give me a gun.  The gunman hands him a Glock 30. Luga sees two guards rushing up and FIRES -- killing them both. EXT. BURREL PRISON - SAME A MERLIN HELICOPTER shoots towards the prison. INT. BURREL PRISON - VARIOUS - SAME The extraction team commences exfil. EXT. BURREL PRISON - SAME The helicopter touches down inside the walls. Luga and the extraction team hop inside. It flies off. EXT. PLG SHIPPING COMPANY - MAGIC (SIX HOURS BEHIND) A large building on the Indian River in Florida. SUPER:   MIAMI   - FLORIDA  INT. PLG SHIPPING COMPANY - OFFICE - SAME BARDHA, a tough Albanian, hands a cheap phone to his boss, ALBERT HESS, 50’s, serious and intelligent. Into the phone: HESS  Put him on.  INT. MERLIN HELICOPTER - INTERCUTTING Luga takes the phone from the Lead Team Member. 2.",
      "characters": [],
      "action_text": "HESS  You know who this is?  LUGA  I got your message.  HESS  Good -- then you know I only got you out for one reason. This is not a personal job. It’s business. You’re to do what I hired you to do and nothing more. Tell me you understand that.  LUGA  ...I understand.  Luga hangs up. Stares ahead. Cold eyes. Hard. END INTERCUT. HESS (to Bardha) I need to keep this dog on a short leash. Make sure he’s brought to me the second he gets off the boat. Hess sends the phone down a chute -- into an incinerator. RESUME HELICOPTER: flying off -- as RAP MUSIC BLASTS. EXT. ATLANTIC OCEAN - NIGHT SHOOTING over neon-lit water, we pan up to frame the MIAMI SKYLINE, the sonic   WHOOSH   of a 6262cc V12 engine as we GO TO: A GUN-GRAY FERRARI 599 THUNDERING past Miami hot-spots. Behind the wheel, dressed like a GQ cover model: MIKE LOWERY. A Lamborghini Huracan pulls up beside him at a red light, two IMG MODELS inside. IMG MODEL #1 Sweet ride. She REVS the engine. MIKE You two aren’t silly enough to want to race me. IMG MODEL #1 ...Maybe. IMG MODEL #2 ...Depends how big your engine is. 3. MIKE Big enough for two. What do you have under the hood? IMG MODEL #1 Catch us and you’ll find out. MIKE Would if I could, but I got work. I’ll have to find you ladies later. IMG MODEL #1 And how do you plan to do that? Mike flashes his BADGE. Girls smile. The light turns green. They ZOOM AHEAD. Mike mouths “damn” and ROARS forward. EXT. AVENTURA MALL - PARKING LOT - LATER A luxury shopping center. Mike’s Ferrari pulls up and parks. INT. FERRARI - SAME Mike checks his Hublot King Power Black Mamba watch. MIKE Alright, it’s almost game time. Daltrey, Sanchez, you two set? This to a HIDDEN MICROPHONE in the lining of the car ceiling. INT. CADILLAC ESCALADE - SAME Parked a few cars away from Mike. Sitting inside are two next- generation cops with MIAMI-DADE PD’S TACTICAL NARCOTICS TEAM: SCOTT DALTREY (Louisiana-transplant; ex-Marine;   Duck Dynasty - beard; the guy you want backing you in a firefight)",
      "dialogue_count": 0,
      "word_count": 684
    },
    {
      "scene_number": 2,
      "slugline": "INT. DODGE CHALLENGER - SAME Meet Mike’s new partner: CAM THEROUX, young and cocky. INTERCUT ALL THREE CARS: CAM Nice of your connection to pick this place to meet. I say after we bust the bad guys, we do a little shopping, a candle from Wicks N Sticks, maybe grab some Cinnabon. Daltrey, some new bandanas? MIKE Hey, you wanna do your job or you wanna fuck around? Cam gets quiet quick. MIKE (CONT’D) Now let’s go over it again: as soon as I agree to the buy, I give the call to Theroux to show up with the green. Once we got the glass in hand: Daltrey, Sanchez, you two come in hard and fast, back us up. No call, you’re all statues unless I give the trouble signal. Any questions? SANCHEZ Yeah. What’s the trouble signal? MIKE “Oh shit, I’m in trouble.” Now let’s get sharp. It’s prove yourself time. Cam resents Mike’s condescending attitude. Under his breath: CAM Prove yourself, my ass. EXT. AVENTURA MALL - PARKING LOT - MOMENTS LATER Stores are closing. Mike and the TNT cops are still waiting. RESUME DALTREY AND SANCHEZ: DALTREY C’mon, top 3 country songs. Go. SANCHEZ They’re all the same. If it's not about cheating, it's about drinking. Or screwing. 5.",
      "characters": [],
      "action_text": "DALTREY And that’s different from what you listen to? It’s all about Kush, bitches and doe. Sanchez sits up. Spots a mousey WHITE GUY heading toward Mike’s car. Into her mic: SANCHEZ Lowery, heads-up. Mike sees the white guy approaching. His connection. MIKE That’s him. Get ready. Cam zips open a gym bag on the passenger seat. A Strayer Voight Infinity TIKI handgun rests atop wrapped stacks of bills. He discretely pulls out the gun. Mike gets ready to step out of his Ferrari but the connection doesn’t slow down. Just keeps walking up to Mike’s car -- -- and drops a PRE-PAID CELL onto Mike’s lap. Cam, Daltrey and Sanchez are all thrown. Mike was supposed to meet him in the open. Mike sees the connection vanish into the shadows of the parking lot, then picks up the phone. VOICE ON PHONE We need to change locations. MIKE What are you talkin’ about? This is where we agreed to meet. VOICE ON PHONE Not anymore. You want what we’re selling, you come to us. Club Apagón. Be there in twenty minutes. Bring the cash to the VIP section. Come alone.  CLICK.   The call ends. Back into his mic: MIKE Alright, change of plan. We’re goin’ clubbing. Meet’s at a place called Apagón. Sanchez instantly gets on her phone and runs a search. SANCHEZ After hours joint in Little Havana. 6. DALTREY Goddamn set-up. CAM C’mon Mike, you’re not serious. That’s an invitation to a hit. You gotta call this off. MIKE Not callin’ anything off. (urgent) Sanchez, Daltrey: beat us to the club. Make sure you got eyes and ears in place when the deal goes down. Daltrey and Sanchez immediately drive away in the Escalade. MIKE (CONT’D) Theroux, you hold back out front with the money and don’t release it until you get the call from me. You got it? Cam’s not happy -- but Mike’s the senior officer here. CAM Yeah, I got it. Mike drives off. Cam shakes his head. CAM (CONT’D) Goddammit Lowery. And starts up his ride. LATIN TECHNO BLASTS as we GO TO: INT. CLUB APAGÓN - LATER An EXPLOSION OF SOUND AND LASER LIGHT. Lots",
      "dialogue_count": 0,
      "word_count": 1100
    },
    {
      "scene_number": 3,
      "slugline": "INT. CLUB APAGÓN - SAME Sanchez and Daltrey see Cam go to the VIP area. SANCHEZ Where the fuck’s he going? Lowery hasn’t given the signal yet. RESUME MIKE: MIKE If not, just shoot me now cause you’re not gonna see dime one of that fucking money. Cam SLAMS his hand on the door outside. CAM (O.S.) Hey, open up, I got your money! Mike rolls his eyes. Asshole. No choice -- Mike KNOCKS away the gun that’s pressed to his temple while quick-drawing a SECOND GLOCK out of the gunman’s pants. He aims it at the leader as another CREW MEMBER FIRES. Mike uses his gunman as a HUMAN SHIELD, trading bullets. The glass wall SHATTERS! INSTANT PANDEMONIUM! EVERYONE IN THE CLUB GOES RUNNING! Cam draws the bouncer’s gun and starts laying down cover fire. Mike escapes the VIP section. TWO MORE GANG MEMBERS run from the main area of the club. But before they can shoot at Mike and Cam --   BANG! BANG! BANG!  Daltrey and Sanchez take them out. It’s an ALL OUT GUN BATTLE -- bullets shooting electrical equipment -- CAUSING SPARKS and FIRE. WATER GUSHES out of the sprinklers. Everyone gets DRENCHED. The Lead Gunman goes for an exit. Mike CHARGES after him. Another SHOOTER takes aim, but before he can fire -- his head EXPLODES. REVEAL: CAM -- having just taken the kill shot. Mike gets closer to the Lead Gunman -- who whips around, FIRING at Mike, who then SLIDES across the wet floor, legs STRIKING the Lead Gunman, who drops onto his back. Mike swings the gun right into his face. MIKE Like I said: my way. 10.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 277
    },
    {
      "scene_number": 4,
      "slugline": "EXT. CLUB APAGÓN - LATER Aftermath. Fire trucks. Cruisers. A Crown Victoria pulls up. CAPTAIN LEO HOWARD steps out. Surveys the chaos and zeroes in on the man responsible: Mike, currently fighting with Cam. MIKE You disobeyed a direct order!   CAM They were gonna kill you! MIKE What you did was put the whole crew at risk! As tensions reach a fever pitch, Howard comes walking up. CAPTAIN HOWARD Yeah, yeah, this looks about right for one of your Thursdays. Wait, can that be? Oh my God yes, the building’s still standing. You must be losing your touch, Mike. MIKE Captain, before you start in -- CAPTAIN HOWARD Over here. Mike follows Howard away from Cam and the others. MIKE Look it’s not my fault that things got out of hand this time. CAPTAIN HOWARD Of course not. It was “ABM’s” fault. Anyone But Mike’s. You said this was gonna be a routine buy. MIKE Which it would have been if Theroux listened -- CAPTAIN HOWARD Wait, someone didn’t listen to you? I’m sorry ‘CAUSE I HAVE NO IDEA WHAT THAT’S LIKE! You know, ever since the “Bad Boys” broke up, you’re like my nephew without Ritalin. You weren’t a one man army doing everything the way you want. So I’m telling you now: you better learn how to be part of a fucking team again. Howard walks away. OFF MIKE -- fuck that, MUSIC and GO TO: 11.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 240
    },
    {
      "scene_number": 5,
      "slugline": "EXT. MIAMI - MORNING Sun breaks, casting morning rays over the city. INT. BURNETT HOUSE - MORNING The front door flies open, letting in a walking rack of DRY- CLEANING. A dog rushes in and undercuts the mess, tripping the person in the center: MARCUS BURNETT. MARCUS Oh shit! THERESA (O.S.) Baby, that you? He falls, and the dog tramples the clothes. THERESA (CONT’D) Did you remember the dry-cleaning? MARCUS Uh-huh! (to the dog) Go, scoot, away. Past the open rumpus room door, a phone is ringing. INT. BURNETT HOUSE - “RUMPUS ROOM” - MOMENTS LATER Which has been converted into a combination gym/home office. On the treadmill, JAMES BURNETT, 16, has just answered the phone. QUINCY, 15, reads a men’s fitness magazine. JAMES Hello, B.S. Unlimited! MARCUS (entering) James! No, no, man. How many times do I have to tell you: it’s not B.S. unlimited. It’s “Burnett Services Unlimited. Private Investigator.” JAMES I think B.S. makes more sense. Marcus snatches the phone. Clears his throat. MARCUS Good morning. Burnett Services Unlimited. He scrambles for something to write on. Quincy hands him a torn-out page from his magazine. It’s an ad for MALE BOTOX. 12.",
      "characters": [],
      "action_text": "“Because you’ve only got one face. BRO-TOX.” The tight face of a middle-aged man peers back. Marcus leers at Quincy. MARCUS (CONT’D) You’re adopted. (into the phone) Yes, ma’am, I got thirty years of investigative experience. Narcotics, Murder One, kidnapping, human trafficking. Seen it all. (crestfallen) Oh, your husband came home late? He begins writing notes onto the BRO-TOX AD. MARCUS (CONT’D) No ma’am, there is no sin too big or too small for Marcus Burnett. INT. BURNETT HOUSE - KITCHEN - MOMENTS LATER Marcus walks in on wife THERESA hugging their 22 year-old daughter, MEGAN. THERESA ...just make sure you break it to dad gently. MARCUS Break what to dad gently? Megan turns to Marcus. Smiles. MARCUS (CONT’D) Oh shit. THERESA Marcus!   MEGAN Dad! MARCUS I’m sorry, baby. That was just a reflex. I’m here now... What were you gonna say? MEGAN I’m -- MARCUS Oh shit! THERESA Marcus! MARCUS Theresa, what do you want from me? Our little girl wants to go off and marry that idiot, Clark. 13. MEGAN Dad, I’m not marrying Clark. MARCUS Damn right you’re not. MEGAN I’m having his baby. MARCUS Oh hell no. THERESA Marcus -- MARCUS Theresa, excuse me, but no way. First off, Clark’s unemployed -- MEGAN He’s not unemployed. He works at home. He does freelance. MARCUS You know who also does freelance at home? Hookers. And I wouldn’t want them to be my baby’s baby daddy either. MEGAN (storming past him) You’re unbelievable. MARCUS Megan! THERESA Good one, baby. Real slick. Theresa follows her now-crying daughter. Marcus looks down. He still has the BRO-TOX AD in his hand. MARCUS What are you looking at? A beat as the picture catches his gaze again. Lingers there. He doesn’t break. Wait, is Marcus considering “Bro-Tox?” EXT. MEDITERRANEAN SEA - DAY A cargo ship trudges over choppy waters, spewing smoke. INT. CARGO SHIP - HOLD - SAME Ship see-sawing, Luga shaves his beard -- dry. Looks in a small mirror at his new face, still menacing. 14.",
      "dialogue_count": 0,
      "word_count": 532
    },
    {
      "scene_number": 6,
      "slugline": "INT. MIKE’S PENTHOUSE APARTMENT - MORNING Panning across the ultimate bachelor pad, we pick up pieces of clothes. Shoes. Pants. Then a skirt. A bra. We hear a shower running as we land on Mike, asleep in bed. The phone RINGS, waking him. He picks it up, answering: MIKE Lowery... Yeah, alright. I’ll be there in twenty. An arm drapes over him. Belongs to IMG MODEL #1 from the opening, a pair of HANDCUFFS dangling from her wrist. IMG MODEL #1 Don’t tell me you’re leaving me again. MIKE Sorry, baby. Duty calls. IMG MODEL #2 (O.S.) But we haven’t posted bail yet. Mike looks to the BATHROOM where IMG MODEL #2 has just emerged from the shower, naked and wet. But whereas before, Mike would mouth “damn”, now he looks...bored. Has the bachelor life become too routine? EXT. MIAMI-DADE P.D. HEADQUARTERS - DAY Mike’s Ferrari roars up. Parks. INT. MIAMI-DADE P.D. HEADQUARTERS - ELEVATOR - DAY Mike crosses the lobby to the elevator. As the doors shut -- VOICE Hold the elevator. Mike stops the doors from closing to reveal LT. ELLIE GARRISON, strong-willed and beautiful. Even her conservative business suit can’t diminish the luster she gives off. ELLIE (stepping inside) Sergeant. MIKE Lieutenant. Ellie hits the button for 6. Mike has already pressed 8. Ellie is the only woman in Miami who won’t succumb to Mike’s charm -- but that hasn’t stopped him from trying. 15.",
      "characters": [],
      "action_text": "MIKE (CONT’D) Hear the brass wants you to head up Vice. Congratulations. ELLIE Thank you. MIKE Sure Howard’s gonna miss having you as his #2. If you want I could help you celebrate. ELLIE I don’t think so. MIKE You know one of these days you’re gonna surprise me and say yes. ELLIE And one of these days you’re gonna surprise me and say nothing. The elevator stops at Ellie’s floor and she gets out. Mike smiles. Likes her. She’s a challenge. The doors close and -- INT. TNT DIVISION - MOMENTS LATER  --   re-open on the 8th floor. Mike crosses the busy bullpen to Howard’s closed office. INT. TNT DIVISION - HOWARD’S OFFICE - CONTINUOUS MIKE (knocking as he enters) Hey Captain, they said you wanted to see me. CAPTAIN HOWARD Close the door. Mike sees Howard isn’t alone. There’s someone else with him: FBI SPECIAL AGENT DAN KESSLER, 50’s. Mike closes the door. CAPTAIN HOWARD (CONT’D) Mike, this is Agent Dan Kessler with the FBI Miami field office. MIKE (sitting down) So is this a good meeting or a bad meeting? AGENT KESSLER Aleksander Luga escaped from Burrel Prison in Albania. 16. Mike reacts. He knows the name well. AGENT KESSLER (CONT’D) Needless to say, his capture has become top priority for both the bureau and Interpol. MIKE I’m sure not everyone is being told in person. CAPTAIN HOWARD Mike, the FBI has reason to believe Luga’s on his way to Miami right now. MIKE To do what? AGENT KESSLER To kill you. For a second that hangs there -- but Mike is hardly rattled. MIKE That it? Bad guys try to kill me every day. AGENT KESSLER I wouldn’t be here if I didn’t think I was saving your life. We’ve got intel that his people back in Albania have been running searches on you. They have your social security number, your home address... MIKE Luga’s not a fool. He’s not gonna come all this way, risk all the heat, just to kill me. AGENT KESSLER (deadly serious) That’s exactly what he’ll do. You and Marcus Burnett killed his brother. The Albanians call it “Krvna Osveta”. Means he’s made",
      "dialogue_count": 0,
      "word_count": 2011
    },
    {
      "scene_number": 7,
      "slugline": "INT. RED ROOF INN - HALLWAY - SAME The figure knocks on Mike and Marcus’ door. FIGURE Hotel secur -- Doors on either side of him swing open and SEVERAL GUNS are leveled out at the man -- who we now see is a RED ROOF INN EMPLOYEE, scared shitless. RED ROOF EMPLOYEE ...so yeah, if you can keep it down... or not... whatever. (backing away) Have a nice night. “Hit the Roof.” He moves down the hall as if there was a motor on his ass. A beat later, both room doors are slammed shut -- and Mike and Marcus show the other their backs, tenser than ever. INT. RED ROOF INN - ROOM 125 (TNT ROOM) - SAME Cam collapses back in his chair, exhaling: CAM This is gonna be a long assignment. EXT. RED ROOF INN - NIGHT Hours have passed. Night has fallen. RESUME MIKE AND MARCUS: both in bed -- but only Mike is awake. Can’t sleep. You couldn’t either -- if you heard how LOUDLY Marcus is SNORING. MIKE You gotta be kidding me. EXT. RED ROOF INN - DAY Blinding sun. INT. RED ROOF INN - ROOM 124 - SAME Mike plays chess on his iPad. A cockroach skitters across the floor. Marcus sees it. JUMPS. MARCUS Oh shit! MIKE What? 25.",
      "characters": [],
      "action_text": "MARCUS Did you see that? Mike looks up. Doesn’t see the cockroach. A SECOND COCKROACH then appears. Bigger too. Marcus’s eyes go wide. MARCUS (CONT’D) Oh shit! Fuck me! MIKE Would you keep your voice down. MARCUS That’s a fucking armadillo! The second cockroach catches up to the first. Starts EATING it in front of Marcus. (Yes, they do that.) MARCUS (CONT’D) Holy shit. It’s eatin’ the mother- fucka! I gotta get the fuck out of here. MIKE We can’t go anywhere. MARCUS Not only do they put us together, we got the Goddamn -- Marcus stops, overcome with an intense scratching fit. MARCUS (CONT’D) Why the fuck am I itching?!? What the hell are they doin’ to me in here!?! Mike shakes his head. Give me a break. Off which: INT. RED ROOF INN - ROOM 125 (TNT ROOM) - LATER THAT DAY Sanchez and Daltrey are growing bored watching Mike and Marcus on the monitor. DALTREY Craziest place you’ve ever had sex. SANCHEZ Probably the bathroom. DALTREY Bathroom’s not so crazy. SANCHEZ It was in a church. (off Daltrey’s look) Preacher’s daughter. 26. Cam comes in with take-out. Hands out lunch. CAM What’d I miss? ON THE SCREEN: Mike, on “his side” of the room, kicks Marcus’s trash back onto “Marcus’s side”. MIKE (ON THE SCREEN) Would you please clean up after yourself! Mike swings open the door to the bathroom. Instantly recoils. MIKE (ON THE SCREEN) (CONT’D) Jesus! MARCUS (ON THE SCREEN) Yeah, that’s my bad. Cam rolls his eyes. EXT. MIAMI DOCKS - NIGHT In shadow, a Ford Flex waits, three ALBANIAN GUNMEN in front. The leader, VIKTOR, looks at the cargo ship arriving. Moments later, Luga emerges from the ship. VIKTOR  Welcome, Mr. Luga. I’m Viktor. Mr. Hess sent us. We’re to take --  LUGA  Give me your phone.  Viktor’s caught off guard by the request. Luga just stares him down, eyes clarifying “give me your fucking phone.” Viktor doesn’t know what to do, but he knows better than to piss someone like Luga off. Wisely hands it over. Luga steps away. Pulls a paper with a number on it. Dials. But",
      "dialogue_count": 0,
      "word_count": 2617
    },
    {
      "scene_number": 8,
      "slugline": "INT. RED ROOF INN - ROOM - CONTINUOUS Mike moves inside. Still no sign of Luga -- but the window is OPEN. He rushes over. Looks out. Nothing. Then: A REFLECTION. Mike whips around to find Luga CHARGING HIM -- the two CRASHING into each other, FLYING out the window -- EXT. RED ROOF INN - SAME -- SLAMMING hard to the ground. EXT. HIGHWAY - SAME Police cruisers roar toward the hotel, sirens wailing. EXT. RED ROOF INN - SAME Cam, Daltrey and Sanchez fire back at the gunmen, who jump back into their Ford Flex, FIRING UP the engine. INT. RED ROOF INN - HALLWAY - SAME Marcus cradles Howard, slipping... EXT. RED ROOF INN - SAME Mike and Luga trade vicious blows on the ground. Luga reaches behind his back. Draws a SIX INCH STILETTO. He THRUSTS it down -- but Mike grabs his wrist. Luga presses down HARDER. Mike BITES Luga’s hand. Kicks him off. Then -- HEADLIGHT BEAMS hit Mike. He looks up to see the FORD FLEX SCREAMING UP. Mike quickly ROLLS out of the way, the SUV just missing him, screeching to a sudden stop, on its way to picking up Luga. POLICE CRUISERS appear in the distance, coming up fast. The Ford Flex doors open, Viktor screaming at Luga to: VIKTOR GET IN THE FUCKING CAR! But Luga refuses to go, a man POSSESSED as he grabs a gun from one of Viktor’s men and hurries around to the other side of the SUV -- FIRING at Mike, who DIVES behind a parked car, Luga keeping his finger firmly pressed on the trigger, rounds ripping open the fuel tank. Mike sees the car is about to blow and he quickly RUNS OFF as Luga continues to shoot until -- --   BOOOOM!   -- the car ERUPTS. Goes AIRBORNE. Mike DIVES. 37.",
      "characters": [],
      "action_text": "The car comes CRASHING down, stopping short of crushing Mike when it lands atop another car hood, right beside him. Luga --   CLICK!   -- runs out of bullets. Cam, Daltrey and Sanchez run up, firing in his direction. Luga turns. Sees the cruisers coming. Then whips around, searching again for Mike -- but he can’t see him through the rain, smoke and fire. FUCK! He missed his shot. He gets back in the Ford Flex. It PEELS AWAY. Covered in soot, Mike watches Luga disappear. Then as police cruisers pull up, everything starts SLOWING DOWN, SOUND DROPPING OUT, MUSIC TAKING OVER as WE GO TO: INT. RED ROOF INN - ADJOINING ROOM - LATER PARAMEDICS rush inside, over to Howard. EXT. RED ROOF INN - MOMENTS LATER Howard is loaded into the ambulance. Mike, Marcus and TNT watch and pray as the ambulance pulls away. EXT. HIGHWAY - MOMENTS LATER The ambulance roars away, bubble lights blurred by rain. INT. HOSPITAL - VARIOUS - LATER Cops hold a vigil for Howard in the lobby. Sanchez prays in the chapel. Daltrey and Cam comfort Howard’s family. Mike and Marcus are in one of the exam rooms, giving blood, silent. INT. HOSPITAL - OPERATING ROOM - SAME Howard goes under the knife. He has vital signs, but they’re very faint. Don’t know if he’ll live or die as we GO TO: EXT. PLG SHIPPING COMPANY - NIGHT To ESTABLISH. INT. PLG SHIPPING COMPANY - OFFICE - SAME Hess watches TV news coverage of the Red Roof Inn shooting, livid, when Bardha appears in the doorway. BARDHA He’s here. INT. PLG SHIPPING COMPANY - MAIN FLOOR - MOMENTS LATER Hess and Bardha find Luga walking calmly inside. 38. HESS  (in Albanian; subtitled)  Do you know what you did? You’re all over the fucking news!  Luga says nothing. Just lets Hess bluster. HESS (CONT’D)  Every law enforcement agent in Florida is looking for you now.  LUGA  You think I care about your police? Back home, they’re the criminals.  HESS You’re not home. We have a way of doing things here. And I’m not gonna let you further jeopardize everything I’ve worke",
      "dialogue_count": 0,
      "word_count": 2426
    },
    {
      "scene_number": 9,
      "slugline": "INT. MIAMI-DADE P.D. HEADQUARTERS - ELLIE’S OFFICE - SAME ELLIE About Luga. You’re not going after him, correct? MIKE Absolutely not. ELLIE ‘Cause you need to stay away from this case. Cam’s with you, right? MIKE Of course. We’re attached at the hip. I love that kid. ELLIE Good. I want someone watching your back. After last night, you need to low. I’ll check in with you guys later. MIKE Always love you checking me out, Lt. Ellie hangs up. Mike knows he has no choice but to call Cam. MIKE (CONT’D) Shit. INT. MIAMI-DADE P.D. HEADQUARTERS - GYMNASIUM - DAY Cam POUNDS a punching bag, then answers his ringing phone. CAM What’s up, Mike? INT. CAMARO - LATER Mike and Marcus ride in front, Cam sits in the back. CAM (after a beat of silence) So, Mike... you gonna tell me where we’re going or what? MIKE I’ll tell you when we get there. CAM I know you don’t think so, but I can probably contribute to whatever it is you’re not supposed to be doing.   (MORE) 48.",
      "characters": [],
      "action_text": "(off Mike’s silence, Cam leans forward) Come on, I saw your eyes at HQ and after your couples therapy session at the inn, there’s only one reason you’d be sharing a car with Burnett. You’re going after Luga and you’re worried if Ellie sees me without my partner, she’ll stop you. Mike won’t admit he’s right. Marcus is impressed. MARCUS Gotta say, Mike, your boy’s quick. MIKE He’s not my boy. He’s a pain in the ass. CAM Hey Mike, just because I don’t do things exactly the way you do -- MIKE You don’t know how to do things, that’s the problem. MARCUS You know, I don’t know what it is, but there’s something very familiar about this conversation. MIKE Don’t start in, Marcus. MARCUS Cam, let me ask you something: has Mike ever canceled SWAT on you right before you’re about to go in on a bust? CAM Shit, yeah. He did it twice in the same month. MARCUS Alright, what you gotta do next time is call ahead and let them know -- MIKE What are you, his mentor now? MARCUS That’s right. Professor Marcus X. CAM (CONT'D) 49. CAM Let me ask you something, Marcus. MARCUS Shoot, my brother. CAM When you guys were on a stakeout and you had to have something to eat -- MARCUS (knows exactly where this is going) And he won’t let you have food in his car. Man, bullshit to that! Cam and Marcus laugh. Mike doesn’t. CAM Man, you’re alright, Marcus. MARCUS Thanks, Cam. I think you’re cool too. MIKE That definitely means a lot from a grown ass man in skinny jeans. Before Marcus can strike back: CAM Yeah, I was gonna ask, what is up with those pants anyway? They help with posture or...? MARCUS What the fuck, you’re starting in on me, too!?! CAM I’m sorry, but Mike does have a point. MARCUS I don’t believe this shit. MIKE Yeah, it’s tough when you think someone’s got your back and then they don’t. CAM Mike, come on, that isn’t fair -- 50. MIKE Shut up, Cam. MARCUS Yeah, shut up, Cam. Cam sits back, giving up. CAM Man, you guys deserve each other. EXT. LIBERTY CITY - DAY A violent Miami neighborhood. ",
      "dialogue_count": 0,
      "word_count": 912
    },
    {
      "scene_number": 10,
      "slugline": "INT. VIKTOR’S MOM’S HOUSE - MOMENTS LATER An Albanian soap plays on a TV with rabbit ears. MRS. GOJAHKI adjusts her recliner. She’s old and mean as fuck. In the window behind her, we can just make out -- EXT. LIBERTY CITY STREET - SAME -- Marcus struggling to climb the telephone pole. INT. CAMARO - SAME Same seats as before: Mike, up front. Cam in the back. CAM You really hate having a partner don’t you, Mike? Mike says nothing. CAM (CONT’D) Marcus, me. If it was up to you, you’d just do everything yourself. MIKE Occasionally I need someone to get me coffee. CAM You read my jacket before we were partnered up. You know what I can do. What I bring to the game. MIKE Yeah. Headache. Problem with you is you have no idea what it takes to be a real cop. You got no field experience. CAM I think the only reason you give me no respect is because I remind you of you -- only you’re a step slower and I’m the up and comer. MIKE Please, if you reminded me of me, I’d kick my own ass. Now shut up. You may learn something. EXT. LIBERTY CITY STREET - SAME Sweat POURING, Marcus reaches the phone box. He pops it open and connects the gypsy wire, tapping into the mom’s line. 53.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 230
    },
    {
      "scene_number": 11,
      "slugline": "INT. CAMARO - SAME MIKE ... cool. And you’re sure she just has the land line, right? No cell phone. (beat) Thanks, Lisa. I owe you one. He hangs up. Dials a new number. INT. VIKTOR’S MOM’S HOUSE - INTERCUTTING An old-school ROTARY PHONE rings. Viktor’s mom grimaces and answers the call. With a THICK EUROPEAN ACCENT: MRS. GOJAHKI Yes. MIKE This is Viktor Gojahki’s mom? MRS. GOJAHKI Who this? MIKE I’m the guy who just shot your son! He’s dead. Mike hangs up. Cam looks at him, shameful. CAM This is just mean, man. MIKE Mean, but it works. Mrs. Gojahki hangs up, concerned. Is it true? She immediately picks back up the phone. Dials a new number. RESUME MARCUS: hearing her dial a new number, but before she can get connected to anyone, he cuts the call. RESUME MRS GOJAHKI: MRS. GOJAHKI (hearing nothing on the other end) Hello?... Hello? Nothing. She hangs up. Thinks. Then steps out of frame. RESUME MARCUS: climbing down the wooden pole. Gets a splinter along the way. 54.",
      "characters": [],
      "action_text": "MARCUS Ahh fuck! (then another) Shit. (and a third for good measure) Mother-fucka! He jumps the last few feet and hits the ground, swallowing a yell. Then steels himself and gets back in the Camaro. Viktor’s mom exits her house, gets into her own car and drives down off. Marcus follows in pursuit. The plan worked. EXT. MIAMI STREET - MAGIC Sun setting, Viktor’s mom’s car passes, followed by Marcus. EXT. MIAMI MARINE STADIUM - VIRGINIA KEY - MAGIC Built in 1963, the concrete amphitheatre overlooking a man- made basin and the Miami skyline was condemned in 1992. It stands now, completely painted over in graffiti. Viktor’s mom pulls up to the street to the stadium. RESUME CAMARO: MIKE Alright, she’s slowing down. Viktor must be hiding out in the stadium. Get in front of her. We’ll cut her off. Marcus, get to her door. Marcus hits the gas. Cuts in front of the mom’s car. She stops short. Mike, Marcus and Cam explode out of the Camaro. Marcus is the first to reach the mom -- going up to her door. MARCUS Ma’am, I need you step -- But that’s all he gets out. Viktor’s mom puts a STUN GUN to his hand. Shocks him with 50,000 volts. Marcus CONVULSES. CRASHES. Mike and Cam rush over. Viktor’s mom BOMBS out of the car, SWINGING her purse in Mike’s face over and over, kicking the crap out of him. MIKE Do something! CAM I have no field experience, remember. Mike catches the purse. Engages in a TUG OF WAR with the mom. 55. MIKE Jesus, she’s got a grip! Cam gets an idea. Rushes off. Viktor’s mom starts SPITTING and CURSING at Mike. VIKTOR’S MOM I kill you! I kill you! Marcus staggers to his feet. Grabs the mom from behind. Tries to yank her back when -- -- TWO PROBES ATTACHED TO TASER WIRES tag her in the chest. Cam hits the trigger on Marcus’s TASER GUN. She gets SHOCKED and FALLS BACKWARD onto Marcus -- the two HITTING THE GROUND, Marcus breaking her fall. Mike and Cam stand over the pair. Marcus winces. MARCUS Next time...you get the door. CAM What do we do with her now? MIKE Cal",
      "dialogue_count": 0,
      "word_count": 4180
    },
    {
      "scene_number": 12,
      "slugline": "INT. MIAMI GENERAL HOSPITAL - ICU WING - INTERCUTTING  DING!   An elevator opens. Mike steps out. Moves down the hall. EXT. MIAMI STREET - INTERCUTTING The suburban approaches the hospital. INT. MIAMI GENERAL HOSPITAL - ICU WING - INTERCUTTING Mike looks in on a patient through a window: HOWARD -- still on life support. Mike regards him, quiet. EXT. MIAMI GENERAL HOSPITAL - INTERCUTTING The Suburban pulls up. Parks. INT. MIAMI GENERAL HOSPITAL - ROOM 726 - NIGHT Marcus tries to get some sleep, tossing and turning.   DING!  INT. MIAMI GENERAL HOSPITAL - SEVENTH FLOOR - SAME The elevator opens up. Bardha and the Gunman exit. The Gunman continues on alone. Bardha holds back, keeping an eye out. INT. MIAMI GENERAL HOSPITAL - ROOM 726 - MOMENTS LATER Marcus sleeps. The room is dark. The Gunman comes in. Walks up to the bed. Aims the Sig when --  CLICK ! Mike appears behind him, gun to the Gunman’s head. He was in the closet. MIKE Wrong patient, asshole. Miami PD. Marcus turns on the light and sits up in bed, adding: MARCUS And Burnett Services Unlimited. MIKE Hands up and drop the gun. The Gunman raises his hands and drops the Sig. Mike goes to grab his wrist and -- LIGHTNING QUICK: the Gunman SNATCHES Mike’s -- causing Mike to FIRE at Marcus, bullet just exploding an IV bag beside him. The Gunman SLAMS Mike against the wall -- SHATTERING a TV. INT. MIAMI GENERAL HOSPITAL - HALLWAY - SAME Hearing the COMMOTION, Bardha BOOKS toward the room. 74.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 260
    },
    {
      "scene_number": 13,
      "slugline": "INT. MIAMI GENERAL HOSPITAL - ROOM 726 - SAME Mike and the Gunman go to BLOWS. Marcus makes a move for the fallen SIG. Bardha steps into the room and aims at Marcus -- who quickly rolls off the bed. Mike and the Gunman continue to STRUGGLE. A DEATH MATCH. Moving so furiously that Bardha can’t get a clear shot. On the floor, Marcus reaches up. Pulls a TELEPHONE down from the bedside table. Rips out the cord. Bardha finally gets Mike in the cross-hairs. About to fire.  WHAM!   Marcus BEAMS him with the telephone. Marcus LEAPS over the bed -- ass visible through the gown and SLAMS himself into Bardha -- the two FALLING to the floor outside the room -- back into the hall. Mike and the Gunman trade punches, knees and elbows. INT. MIAMI GENERAL HOSPITAL - HALLWAY - SAME Marcus fights Bardha. Gets SLAMMED against a CRASH CART, impact causing the EKG DEFIBRILLATOR PADDLES to CHARGE. Marcus drops to the floor. Bardha gets on top. Starts choking him. Marcus grabs the defibrillator paddles. Puts them to Bardha’s chest and hits him with 250 volts. Bardha FLIES off Marcus, crashing onto his back, body SIZZLING. MARCUS Clear. RESUME MIKE: trapped in a BEAR HUG. He SLAMS his head back into the Gunman’s nose. He DROPS Mike -- who picks up his gun, spins and CRACKS it over the Gunman’s head -- knocking him out. INT. MIAMI GENERAL HOSPITAL - HALLWAY - SECONDS LATER Mike rushes out. Marcus gets to his feet. MIKE You alright? MARCUS Yeah. Mike looks up. Sees the NURSES at the front desk on the phone with HOSPITAL SECURITY. 75.",
      "characters": [],
      "action_text": "MIKE (re: Bardha) This asshole led the hit team at the stadium. We gotta get him out of here before the uniforms come. SMASH TO: MIKE -- taping Bardha up in medical tape -- head to toe like a mummy while: EXT. MIAMI GENERAL HOSPITAL - NIGHT Marcus drives his Camaro to the service entrance. INT. MIAMI GENERAL HOSPITAL - LAUNDRY CLOSET - MOMENTS LATER Mike drags a mummified Bardha to the laundry chute. His eyes widen as he sees what’s gonna happen to him. MIKE Don’t worry. You can scream all you want. With that, Mike puts him inside -- INT. MIAMI GENERAL HOSPITAL - LAUNDRY CHUTE - CONTINUOUS -- and Bardha goes SLIDING down the tube -- into a LAUNDRY CART in the hospital basement. INT. MIAMI GENERAL HOSPITAL - HALLWAY - MOMENTS LATER Mike steps into an elevator -- as another elevator opens up and MIAMI COPS step out, just missing him. EXT. MIAMI GENERAL HOSPITAL - PARKING LOT - MOMENTS LATER Mike and Marcus carry the taped up Bardha over to Marcus’s Camaro, toss him into the trunk and drive off. SMASH TO: A ROARING, HUNGRY LION! EXT. MIAMI ZOO - NIGHT At the entrance to the LION PIT, Mike unwraps several Big Macs and stuffs them inside Bardha’s clothes. Gagged, Bardha’s eyes do all the screaming. MARCUS This is some sick ass shit right here. MIKE You didn’t say anything when I asked you to go to the drive-thru. 76. MARCUS I thought you were buying me dinner, not no lion! Like “good job for not killing your suspect. Love, Mike.” I was touched. MIKE Don’t worry. This is gonna be much more satisfying. Mike rips off the tape on Bardha’s mouth. He SCREAMS: BARDHA You better let me the fuck go! MIKE Where’s Luga? BARDHA Fuck you! You won’t do shit to me. MARCUS He taped your ass up and kidnapped you from a hospital. All he does is do shit to people! MIKE One last time. BARDHA (still defiant) I’m not telling you shit. MIKE Your choice. Mike shoves the last Big Mac into Bardha’s pants. Bardha SCREAMS --   AHHHHH!   -- as Mike picks him up. MIKE (CONT’D) Get his legs! (Marcus h",
      "dialogue_count": 0,
      "word_count": 1875
    },
    {
      "scene_number": 14,
      "slugline": "EXT. PRIVATE AIRFIELD - SAME The strike team COCK triggers, readying themselves. EXT. HIGHWAY - SAME The Camaro is moments away. INT. CAMARO - SAME MIKE You know, this car ain’t so bad. Marcus locks and loads his Glock. MARCUS We should wait until back-up arrives. MIKE Luga’s not waiting. Neither can we. He drops the hammer. EXT. PRIVATE AIRFIELD - NIGHT “Forager” lands. When the engines CUT -- Luga and his team RUSH the plane. INT. TRANSPORT PLANE - SAME Seeing armed men approaching: PILOT Holy shit. He tries raising the military on the radio -- but the signal is JAMMED. He only gets STATIC. CO-PILOT They’re jamming the fucking signal! PILOT Get your gun. EXT. PRIVATE AIRFIELD - SAME Luga attaches a C-4 brick to a plane door. Activates a detonator.   BOOM!   The door BLOWS OFF. INT. TRANSPORT PLANE - SAME Luga and his team STORM the plane. The co-pilot raises his gun -- but a GUNMAN puts two muffled shots in his chest. Luga aims a Tech-9 at the other pilot. Shoots him between the eyes. 84.",
      "characters": [],
      "action_text": "VERY FAST: the team boards the plane. Load BARRELS containing 12,000 lbs of fuel. Dump the dead pilots out the open door. Luga sits down in the cockpit. Starts the engines back up. EXT. PRIVATE AIRFIELD - SAME Plane comes back to life as --   VROOOOM!   -- the Camaro CRASHES through a perimeter gate. INT. TRANSPORT PLANE - SAME Seeing the Bad Boys coming -- Luga’s face TIGHTENS. He rushes away from his seat -- grabbing a machine gun -- DRIVEN as he gets to the open door -- EXT. PRIVATE AIRFIELD - CONTINUOUS -- and JUMPS OUT onto the runway. Fires madly at the Camaro. INT. CAMARO - SAME A shower of bullets RIP through the windshield, SHATTERING GLASS. Mike CRANKS the wheel -- EXT. PRIVATE AIRFIELD - SAME -- and VEERS the car off the runway -- skidding to a stop near the tower -- Luga following it with his machine gun. INT. CAMARO - SAME Bullets RAIN IN. Marcus KICKS OPEN the passenger door and climbs out with Mike. EXT. PRIVATE AIRFIELD - CONTINUOUS Mike and Marcus duck behind the Camaro as Luga’s joined by THREE GUNMEN. MARCUS There’s too many -- we need back- up, man! MIKE Just cover me. MARCUS Mike, don’t -- But it’s too late. Mike’s already on his feet -- RACING away from the car -- and DIVING behind some runway equipment. He POPS BACK UP and SHOOTS THREE ROUNDS into another gunman, killing him. 85. THREE MORE STRIKE TEAM MEMBERS get out of the plane, joining Luga, concentrating gunfire on Mike who turns to look over at Marcus -- -- who remains crouched behind the Camaro -- a cell phone to his ear. Mike -- eyes filling up with fury when he sees that Marcus isn’t backing him up -- turns his attention back to Luga and his men -- trading ear-piercing rounds. RESUME MARCUS: on the phone with Cam, screaming over gunfire. MARCUS (CONT’D) Where the fuck are you at!?! INT. CADILLAC ESCALADE - INTERCUTTING Sanchez drives, topping 100 mph. Daltrey rides shotgun while loading one. Cam sits in the back, phone to ear. CAM We’re still three minutes out. EXT. PRIVATE AIRFIELD -",
      "dialogue_count": 0,
      "word_count": 703
    },
    {
      "scene_number": 15,
      "slugline": "INT. TRANSPORT PLANE - CONTINUOUS Luga hops inside and begins throwing open the military crates, pulling from them an ARSENAL OF MACHINE GUNS, GRENADES AND SHOULDER-FIRED MISSILES. EXT. PRIVATE AIRFIELD - SAME As the cruisers SCREAM UP, Mike and Marcus rise up from the ground -- about to move on the plane when -- LUGA AND HIS TEAM COME BACK OUT -- re-armed -- unloading a wealth of gunfire that SHREDS the incoming police cars. Luga takes a MANPAD: a shoulder-launched surface-to-air missile -- sets it down on his shoulder, peers through the sights and FIRES A MISSILE that EXPLODES the tail of the police helicopter -- causing it to SPIN WILDLY. Cops SCATTER as the helicopter BLOWS in an ERUPTION of fire and metal that nearly takes them all out. The Escalade soon ROARS UP. Cam, Sanchez and Daltrey hop out of the car and join in on the action -- firing bravely. Mike and Marcus are still trading gunfire with Luga and his men -- but they are out-numbered and out-gunned. The arrival of additional police cruisers -- along with a SWAT VAN -- forces Luga back into the plane -- INT. TRANSPORT PLANE - CONTINUOUS -- where he sits down at the controls -- steering the plane. EXT. PRIVATE AIRFIELD - SAME The transport plane TURNS. Starts down the runway. Mike goes CHARGING after it on foot. Marcus tries to stop him: MARCUS MIKE! But Mike doesn’t listen -- his arms pumping -- running like a mad man after the escaping plane. Cam also sees this, but unlike Marcus, he JOINS IN -- running over to a cruiser and ROARING after Mike. Cops OPEN FIRE on the plane, but Luga keeps going. As does Mike. But the plane is picking up speed. Then -- Cam SHOOTS UP in the cruiser -- moving past Mike on the right side -- then SLAMS to a stop so Mike can catch up. Cam throws open the passenger door -- and screams out: 87.",
      "characters": [],
      "action_text": "CAM Get in! Mike hops inside the car and Cam PEELS OFF after Luga. INT. TRANSPORT PLANE - SAME As Luga gets ready to take off -- EXT. PRIVATE AIRFIELD - SAME -- Cam pulls the cruiser up to the open plane door. Mike aims out at the plane. Opens fire --   BANG! BANG! BANG!  INT. TRANSPORT PLANE - SAME An Albanian gets shot. Another fires back at Mike. Luga pulls back on the wheel -- EXT. PRIVATE AIRFIELD - SAME -- and the plane TAKES OFF. Mike continues to fire -- but Cam is almost out of runway. He SLAMS on the brakes. The car screeches to a stop as the transport plane rises and disappears into the clouds. Mike steps out of the car, watching Luga escape -- as we PRELAP: AGENT KESSLER (V.O.) According to the DOD, the weapons were all set to be   repurposed upon arrival in Florida. INT. MIAMI PD HEADQUARTERS - SITUATION ROOM - NIGHT Everyone’s present -- listening to Kessler. Tensions are high. AGENT KESSLER The MANPADS that were on board is a man-portable air-defense system, shoulder-launched surface-to-air missile. It can take down planes, helicopters, drones. The black market value of these latest versions is staggering and the introduction of them into the terrorist marketplace has enormous national security implications that are only too frightening to imagine. (to Mike and Marcus) You just armed the enemy. 88. Mike and Marcus take issue, but before they can get in Kessler’s face about it -- ELLIE Agent Kessler, my officers -- AGENT KESSLER (cutting her off) Are out of your control. (re: Mike) He is out of control. MIKE (getting in his face) You fuckin’ kiddin’ me, man? MARCUS Mike, calm down. MIKE No. Fuck that. At every turn this mother fucker’s been up my ass even though we’ve been doin’ his job. AGENT KESSLER No one asked you to, Lowery. Luga’s operation was a Federal investigation. Miami PD was supposed to back off -- MIKE We called you right when the shit was goin’ down and if we didn’t act, we wouldn’t have even had a chance at stoppin’ Luga. AGENT KESSLER ",
      "dialogue_count": 0,
      "word_count": 1918
    },
    {
      "scene_number": 16,
      "slugline": "EXT. INDIAN RIVER - NIGHT Mike’s Ferrari arrives at an INDUSTRIAL AREA near the river. He gets out. Looks around. Sees a boat shed, but no Luttrell. A beat later and a car approaches. We think it’s Luttrell, but the driver steps out -- IT’S MARCUS. MIKE What the hell are you doing here? MARCUS Luttrell called. Said you needed to see me. Mike instinctively knows it’s a set up and TACKLES Marcus to the ground as --   BANG!   -- a bullet rips through the air and strikes a gas tank behind our them.  BOOOOOOOOM!   It ERUPTS! Shockwave sends Mike and Marcus SOARING -- then crashing back to the ground. LUGA and a trio of HITMEN emerge from behind a stack of rusting marine parts nearby. Mike quickly gets to his feet. Helps Marcus up. Bullets chasing them, they SPRINT across a wooden dock -- to the BOAT SHED atop the water. They BOMB through the door as the wood walls gets SPLINTERED with rounds. Luga readies a Heckler & Koch HK69A1 Grenade Launcher. Mike slams the door to the boat shed. Marcus peers out a dirty window. Sees Luga aiming the grenade launcher. MARCUS (CONT’D) Mike! Mike spies a SCUBA TANK on the floor. MIKE Take that! Luga pulls back the trigger. Mike throws open a small hatch in the floor to get to the water below the shed. The grenade from Luga’s gun FIRES into the shed.  BOOOOOOOOOM!   -- the entire shed EXPLODES! Wood and fire go every which way. 95.",
      "characters": [],
      "action_text": "Luga watches the blackened pieces fall from the star-lit sky, then goes over to see what remains of Mike and Marcus. But there are no remains. Only charred wooden planks. Luga looks out at the river. Their bodies must’ve been blown out to the river. He waits there a moment, staring out. Sees nothing. An Albanian hitman says what all is thinking. HITMAN  They’re dead.  But Luga refuses to take that for an answer. He grabs the machine gun out of the hitman’s hands and opens fire on the water -- FURIOUS. Screams at the others to: LUGA  Get some lights now!  The gunmen focus flashlight beams on the water. Luga wants to see bodies -- but all he sees is BLACKNESS. Convinced that they’re dead -- that no one could’ve survived that blast or stay under water that long -- Luga turns and leaves -- ROARING AWAY in a nearby speed boat. Another moment passes -- then Mike and Marcus appear from under the water -- sharing the oxygen in the SCUBA TANK. Moments later, the two collapse on shore, exhausted. Marcus turns to Mike, appreciative. MARCUS ...Thanks. Mike nods. MIKE Luttrell set us up. Marcus spits out some salt water. MARCUS Well, I’m definitely down for beatin’ his ass. You? The two get to their feet -- as we GO FAST TO: INT. LUTTRELL’S HOME - NIGHT The front door EXPLODES OPEN! Mike and Marcus RUSH inside. They look around, but the house is EMPTY. No Luttrell. MARCUS He’s gone. 96. Mike tries to find a clue,   any clue , but there’s NOTHING. MIKE Shit! Mike’s phone rings. He puts it on speaker. MIKE (CONT’D) Go. INTERCUT: INT. MIAMI-DADE P.D. HEADQUARTERS - LUTTRELL’S OFFICE - SAME Daltrey and Sanchez search Luttrell’s office. Cam has FINANCIAL RECORDS up on Luttrell’s computer. CAM I hacked Luttrell’s Internal Affairs password and ran a Dun and Bradstreet check on him. Eight years ago, the asshole was on his second divorce, had child payments, alimony, was dead broke. MIKE Lemme guess: out of nowhere he’s suddenly got enough cash to pay off his bills. CAM All coming from a",
      "dialogue_count": 0,
      "word_count": 687
    },
    {
      "scene_number": 17,
      "slugline": "EXT. PORT OF MIAMI - MORNING ESTABLISH. Filled with ships of all sizes. MUSIC PULSING, Luga supervises large CRANES filling the hold of a CONTAINER SHIP -- THE “OSAKA SPIRIT” -- with dumpster- sized VESSELS. Luttrell is with him -- making a plea: LUTTRELL Look, I’ve given you everything you want, but as soon as you’re gone, I’m done. No more. You understand? Luga doesn’t even pay him the courtesy of eye contact. LUGA I understand we have an arrangement and when it ends isn’t for you to decide. NEW ANGLE: A PAIR OF BINOCULARS seeing this. Mike, Marcus, Cam, Sanchez and Daltrey over look Luga’s operation from a concealed distance. MIKE (looking through the binoculars) I see Luga. He’s with Luttrell. Shit. They’re getting ready to leave. MARCUS (taking the binoculars) There’s gotta be fifteen, twenty guys with him. Maybe more inside. MIKE We have to move fast. Keep the ship at port until customs and back-up arrives. Daltrey, Sanchez: you two take the port side. Cam, you’re mid- ship. Lay down enough cover fire to buy me time to get to the bridge. The younger cops nod. On it. Mike sees Marcus. Pauses. MIKE (CONT’D) ...That work for you? Marcus nods. Good of him to ask. MARCUS Yeah. 98.",
      "characters": [],
      "action_text": "MIKE Then let’s do it. QUICK CUTS: the team gears up: weapons prep/rounds are seated: KA-CLICK/Kevlar vests strapped on. Mike turns to Cam. MIKE (CONT’D) You ready for this? CAM I think I am. MIKE So do I. Cam smiles. A healing moment. Off which: EXT. CONTAINER SHIP - DAY A loud horn BLOWS. Luga’s ship is about to leave. Luttrell is about to step off the boat when we -- NEW ANGLE: A CRANE OPERATOR working the controls from inside his booth. The butt of a gun STRIKES him across the back of the head -- knocking him out. Cam takes his place in the booth. Gives the lever a hard YANK, RELEASING a container from its hook. It CRASHES down onto the deck of the ship -- Luttrell and Luga’s CREW DIVING ASIDE. INT. CONTAINER SHIP - VARIOUS - SAME A gunman sounds the general alarm. SHOOTERS grab weapons and step out onto the deck to investigate as -- EXT. CONTAINER SHIP/DOCK - SECONDS LATER VERY FAST: Mike and Marcus ROAR UP to the ship in Mike’s Ferrari -- SCREAMING up a ramp -- and FLYING their ride onto the main deck -- PLOWING DOWN two gunmen in the process. Luttrell sees them and quickly BOLTS inside the ship as -- Daltrey and Sanchez ZIP-LINE onto the top deck on cables while FIRING -- hitting gunmen. Mike and Marcus throw open car doors and immediately engage in a fire fight. Mike covers Marcus -- screaming at him to: MIKE GO, GO! Marcus fires his way inside an open hatch, into the ship. 99. Mike trades rounds with gunmen -- before running through the same door -- joining Marcus inside: INT. CONTAINER SHIP - CORRIDOR - CONTINUOUS They go TEARING DOWN the narrow hallway. At an intersection: MIKE I’ll take the bridge. You take the engine room. MARCUS On it. Mike goes left. Marcus goes right. EXT. CONTAINER SHIP - SAME Daltrey and Sanchez find themselves pinned down by enemy gunfire -- ducking behind one of the steel containers. Two gunmen ADVANCE -- about to get a clear shot when -- CAM climbs up the anchor on the side of the ship -- pulling himself onto the deck behind the",
      "dialogue_count": 0,
      "word_count": 3604
    }
  ]
}