{
  "slug": "bad-times-at-the-el-royale-2018",
  "title": "bad times at the el royale",
  "genre": "action",
  "format": "film",
  "scenes_count": 10,
  "characters_count": 0,
  "characters": [],
  "total_words": 27491,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. MOTEL ROOM - DAY/NIGHT 1   1  It’s 1958.   We’re in a lonely motel room. A key hits the lock.   A MAN throws open the door and races into the room.   He slams the door.   He peeks out the window and studies the parking lot. He struggles to catch his breath. We may notice blood on the sleeves of his suit.  This is FELIX O’KELLY.  He steps away from the window.   He’s carrying a RED DUFFEL BAG.   He sets it down and surveys his room. CUT TO: Felix shoves the bed to the side of the room. [Note: for the duration of this sequence, the camera remains in the same position.   Fast jump cuts.] Felix opens his red duffel bag.   He removes a crowbar.   A hammer.   A handgun. CUT TO: Felix, his jacket off now, yanks up the carpet from the corner of the room, revealing the WOODEN FLOOR BOARDS below. Felix looks at the floor boards.   Looks at his tools. Thinks. CUT TO: Felix adjusts THE RADIO antenna.   Static.   He fiddles with the dial.   Fifties folk-pop fills the room as Felix finds a station playing “26 Miles” by The Four Preps.  Twenty-six miles across the sea, Santa Catalina is a-waiting for me...  Felix turns up the volume. CUT TO: Felix hammers the crowbar between slats in the center of the room.   The sound is somewhat muffled by the radio.  (CONTINUED)  Bad Times At The El Royale   Final Shooting Draft   1.",
      "characters": [],
      "action_text": "He pries up the floorboards one by one. CUT TO:  Santa Catalina, the island of romance, romance, romance...  We may notice it’s NIGHT outside now.   Felix has his shirtsleeves rolled up.   He’s covered in sweat.   There’s now a large hole in the floor.   The floorboards are all neatly stacked to the side. Felix zips up the duffel bag.   We never get a good look at what’s inside. He drops the bag inside the hole. CUT TO: Felix replaces the floor boards.   He hammers the nails in time to the music.   He smokes while he works. CUT TO: Felix rolls the carpet back.   Stamps it down in the corner. He looks down at the hammer in his hand.   Looks at the crowbar on the bed.   Thinks. CUT TO: The room is empty now.   Through the open door, we can see it’s raining outside.   We hear a trunk SLAM. CUT TO: A soaking wet Felix crawls on his hands and knees and scoops up the sawdust on the carpet.   He stands.   Surveys the room.  Looks good.  Felix catches a glimpse of himself in the LARGE MIRROR mounted on the wall.   Looks less good.  CUT TO: Felix stands in front of his mirror.   He combs his hair with a black plastic comb.  Twenty-six miles across the sea...  CUT TO:  CONTINUED: 1   1 (CONTINUED)  Bad Times At The El Royale   Final Shooting Draft   2. Felix paces back and forth.   He stubs out one cigarette and lights another. CUT TO: Felix sits in the wooden chair in the corner.   He smokes. The ashtray next to him is filled with butts. HEADLIGHTS flare the curtains.   Felix stubs out his cigarette.  Forty kilometers in a leaky old boat...  There’s a knock at the door. Felix grabs the handgun from the night stand.   Moves to the peephole.   Studies the outside world.  Any old thing that’ll stay afloat...  His shoulders relax when he sees who it is. Felix throws the latch.   Opens the door.   Gestures for the person to   come on in...  BOOM.   A shotgun BLAST hits Felix O’Kelly square in the back. He’s launched clear across the room, and the second his body SLAMS INTO CAMERA",
      "dialogue_count": 0,
      "word_count": 4222
    },
    {
      "scene_number": 2,
      "slugline": "INT. ROOM ONE - DAY 6   6  We hear the sound of a key jangling.   Click.   Laramie enters, hits the lights.   He carries his accoutrements into the room. Takes off his hat and jacket.   Folds the jacket carefully and lays it over the back of a chair.   Rolls up his white shirt sleeves.   Studies the room. The Honeymoon Suite is on the California side of the border, and thus decorated in warm orange hues.   It would never be described as luxurious by any means, but it does have a notable king bed on a raised platform and a jacuzzi tub in the floor. CLOSE SHOTS: locks flip.   A suitcase swings open, revealing: neatly folded clothes.   Everything feels regimented.   A hand removes A DOPP KIT. CLOSE SHOTS: items are placed along a sink.   A toothbrush.   A soap case.   A small bottle of shampoo.   A hair tonic.   All meticulously ordered just so. CLOSE SHOTS: locks flip.   The trunk swings open, revealing: the Calhoun Electrovax.   The vacuum is removed.   Click.   A false bottom is removed from the trunk.   A BLACK BRIEFCASE is removed and placed on the bed.   The briefcase swings open, revealing an array of SMALL TOOLS. CLOSE SHOTS: a pair of glasses are removed from a case. Laramie sits on the bed.   In his shirtsleeves and wireframed glasses now, he looks a far cry from the seersucker southerner we met moments ago. He removes a pair of pliers and a screwdriver from the case. He thinks of something.   He checks his watch.   Does a small double take.   Picks up the phone and dials it.   Listens. Then. LARAMIE Hi, my love.   I know, I know... check-in took a little longer than I expected... And as Laramie talks, we may notice that his thick Mississippi accent is now GONE. LARAMIE (CONT’D) Is she still up?  (CONTINUED)  Bad Times At The El Royale   Final Shooting Draft   20.",
      "characters": [],
      "action_text": "While Laramie waits, he takes the screwdriver and begins to unscrew the baseplate of the phone receiver.   He works quickly, with clinical precision. LARAMIE (CONT’D) Hi rabbit!   I know, I’m sorry.   I got delayed.   Yes, the clock is right.   Daddy’s wrong. And between the accent, the wife, the child, and the toolkit, it should obvious that this man has not been honest about who he is.   In fact, we should probably start calling him by his real name.   This is not Laramie Seymour Sullivan...  This is DWIGHT BROADBECK . DWIGHT But I got you before you went down. Ready?   Of course.   I’m on my knees. Dwight pulls off the baseplate, flips the housing over. Looks under the receiver... DWIGHT (CONT’D) “Now I lay me down to sleep, pray the Lord my soul to keep...” Dwight removes a SMALL BLACK MICROPHONE from the receiver. Holds it up to the light.   Nods, pleased.   He sets it down on the night stand. DWIGHT (CONT’D) “And if I should die before I wake, I pray the Lord --” (listens) What do you mean we’re not saying that anymore? (listens) How do you even know what “morbid” means -- what does Mommy want us to say? Dwight begins to reassemble the phone. DWIGHT (CONT’D) Okay.   “When I wake in the morning light --”   Okay, okay, from the beginning... Dwight frowns.   Something’s WRONG.   He holds the receiver up to the light to get a better look.   Grabs his pliers.  CONTINUED: 6   6 (CONTINUED)  Bad Times At The El Royale   Final Shooting Draft   21. DWIGHT (CONT’D) “Now I lay me down to sleep, pray the Lord my soul to keep.   And when I wake in the morning light...” Dwight removes   something else   from the phone with the pliers. Holds it up to the light. DWIGHT (CONT’D) “Teach me to do what’s right.” It’s another microphone. This one’s different than the other.   Smaller.   Tan in color. Dwight stares at it, confused.   Clearly troubled. DWIGHT (CONT’D) Amen. (then) I gotta go, Rabbit.   Tell Mommy I love her, okay? (listens) A couple days.   I love you. He hangs up. ",
      "dialogue_count": 0,
      "word_count": 5598
    },
    {
      "scene_number": 3,
      "slugline": "EXT. EL ROYALE - NIGHT 20   20  Rain is pouring down now as Dwight makes his way through the parking lot.   He’s watching the front carefully, he does not want to be seen. He slides up to Emily’s Mustang, pops the hood.   Yanks the DISTRIBUTOR COIL CABLE free.   Pockets it in his raincoat. CUT TO: Dwight repeats the process on Flynn’s Futura. CUT TO: Dwight repeats the process on Darlene’s Studebaker.   He shuts the hood... and stares at the hotel. DWIGHT (ON TAPE) Sir... there’s something else. While investigating the observation corridor, I witnessed what appeared to be a kidnapping in process.   A young woman, Caucasian, holding another woman hostage.   Also Caucasian. HOOVER (ON TAPE) The priority is the surveillance material, Agent Broadbeck. Peripheral matters are not our concern. Dwight stands in the rain.   Staring at the hotel. DWIGHT (ON TAPE) Sir...  INT. DIRECTOR’S OFFICE - ANTEROOM - NIGHT 21   21  Tape reels spin as Helen transcribes: HOOVER (ON TAPE) I am not in the habit of repeating myself, Agent Broadbeck, but I will do so here to ensure there is no confusion.... CLOSE ON HELEN’S PAGE as her keys type: “ DO NOT INTERFERE .”  Bad Times At The El Royale   Final Shooting Draft   45.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 207
    },
    {
      "scene_number": 4,
      "slugline": "INT. ROOM ONE - NIGHT 22   22  Dwight stands in front of his mirror.   Soaking wet. Breathing hard.   Thinking. He glances at himself in the mirror. CUT TO BLACK.  TITLE :   Room Seven  We HEAR the gentle sound of crashing waves...  EXT. SANTA MONICA - BEACH - DAY 23   23  A solitary trail of BOOT PRINTS leads up the beach to where a young eighteen-year-old girl sits beside a large Army duffel. It’s Rose. She’s wearing cowboy boots and jeans. She sits in the sand with her knees to her chest. She’s crying. A BAREFOOT MAN walks along the boot prints.   Theirs are the only footprints on the beach. BAREFOOT MAN Hi. Rose looks up and squints.   The man is BACKLIT by the setting California sun.   We never get a good look at his face. ROSE Hi. BAREFOOT MAN I like your boots. ROSE They’re my Daddy’s. BAREFOOT MAN Don’t look like they’re your Daddy’s no more. (then) That why you’re crying? Rose shrugs.  (CONTINUED)  Bad Times At The El Royale   Final Shooting Draft   46.",
      "characters": [],
      "action_text": "BAREFOOT MAN (CONT’D) Don’t get a lot of girls down here in boots.   You come straight from the station? Rose shrugs. BAREFOOT MAN (CONT’D) It’s all right, Boots.   You don’t got to say nothin’.   I’ll figure it out in three guesses.   Watch. Tennessee. Rose just looks at him. BAREFOOT MAN (CONT’D) Nah.   Too easy.   And you ain’t no Texas girl, I know that much for sure.   West Virginia? (she shakes her head) ‘Course not. “Let’s not be insulting, Billy Lee.”   Nah, I’m just messin’ about with you.   I knew it the second I saw these bootprints in this beach. (then) You’re an Alabama girl. OFF HER LOOK. BAREFOOT MAN (CONT’D) See.   Told you I could do it in three. He takes his shirt off, drops it next to her. BAREFOOT MAN (CONT’D) Now you got to come swimming with me. ROSE (smiles) That wasn’t the deal. BAREFOOT MAN Sure it was.   You knew the game the second we started playing. He unbuckles his belt.   Slips out of his jeans.   Naked.   He walks towards the ocean.  CONTINUED: 23   23 (CONTINUED)  Bad Times At The El Royale   Final Shooting Draft   47. BAREFOOT MAN (CONT’D) C’mon, Boots.   You got no reason to cry no more... CLOSE ON ROSE as she hears: BAREFOOT MAN (CONT’D) You’re in California now. MATCH CUT TO:  INT. ROOM SEVEN - NIGHT 24   24  SAME FRAMING.   CLOSE ON ROSE.   Bound and gagged.   Her eyes flutter.   She groans. Emily looks up from across the room, where she’s busy stashing her gear under the bed.   She hurries over to Rose, kneels down next to her. EMILY Rose?   Rosie?   It’s okay.   You’re safe.   You’re here with me.   It’s Em. Rose’s eyes from fear to recognition to anger in a flash. She strains against her bonds. EMILY (CONT’D) Rosie.   Stop.   You’re safe.   But I can’t untie you.   Not ‘til you’re right.   We gotta get you right. (Rose struggles) I ‘spect you’re all kinds of mad at me.   And some extent you’re right to be.   But we’re gonna wait this out.   We’re gonna wait ‘til you’re clear.   Then we’ll have it out. She kisses Rose on the f",
      "dialogue_count": 0,
      "word_count": 2787
    },
    {
      "scene_number": 5,
      "slugline": "INT. OBSERVATION CORRIDOR - NIGHT 32   32  Miles watches in growing horror as Emily stands with her handgun, talking to Dwight through the door: EMILY Fuck.   Off. DWIGHT  I’m very sorry to have spooked you, ma’am.   Have a safe night.  WHAM!   Miles jumps as Dwight kicks the door open, BACKHANDS EMILY across the room. MILES  Father Flynn!  INT. MAINTENANCE CLOSET - NIGHT 33   33  Flynn has unspooled a length of the 16mm film.   He’s holding it up to the light.   He turns his head as he hears Miles screaming for him.  INT. OBSERVATION CORRIDOR - NIGHT 34   34  Flynn comes hurrying around the corner, sees a panicked Miles down at the end of the hall. MILES  Father Flynn get down here that vacuum man just busted down the door and he beat up that other girl and he’s got a gun --  Flynn races forward. EMILY (O.S.)  Rosie -- get out of the way.  We hear the cold metal RACK of the shotgun. FATHER FLYNN Kid -- GET AWAY FROM THE WINDOW! KA-BOOM!   The window EXPLODES in the shotgun blast.   Miles disappears in a storm of BUCKSHOT and GLASS. Flynn jumps, slams on the brakes.   Watches in horror as Miles hits the ground. HOLD ON FLYNN.   Staring at the hole where the window used to be.   He looks down at Miles.  (CONTINUED)  Bad Times At The El Royale   Final Shooting Draft   60.",
      "characters": [],
      "action_text": "And Miles starts to move. His face is a mess of blood and glass and buckshot.   But he seems to be   alive . He CRIES OUT in pain. HOLD ON FLYNN.   Frozen.   Not knowing what to do.   Miles cries out on the ground. MILES  Ahhhhhh... help me...  Flynn takes a step forward.   Moving to help him. But then thinks twice. Flynn stops. He starts backing up. He turns and runs. We’re at the far end of the hall.   He races past us, rounding the corner.   And just as Flynn disappears from view -- Emily sticks the shotgun through the hole.   Swings it towards us.   Scans the corridor.   Sees the bloodied boy on the ground. EMILY Jesus Fucking Christ! CUT TO BLACK.  INT. LOUNGE - NIGHT 35   35  CLOSE SHOTS.   The mechanical arm chooses a record. “Bernadette” starts to play. TICK!   The clock ticks forward. WHAM!   Darlene bashes Flynn in the face with the bottle. WHUMP!   Flynn hits the ground in a heap.  EXT. PARKING LOT - NIGHT 36   36  RING-RING.   Darlene races out of the lobby, into the rainstorm.   Panic on her face.   Breathing hard. She scans the parking lot.   Think, Darlene...  CONTINUED: 34   34  Bad Times At The El Royale   Final Shooting Draft   61.",
      "dialogue_count": 0,
      "word_count": 438
    },
    {
      "scene_number": 6,
      "slugline": "INT. ROOM FIVE - NIGHT 37   37  Darlene grabs her keys from her night stand.   Grabs her purse.   Looks to the rest of her belongings.   No time.   Leave them behind.   She bolts towards the door.  EXT. PARKING LOT - NIGHT 38   38  RUMBLE.   The rain is a genuine deluge.   The crashing sounds of water and thunder drown out all other noise. But Darlene creeps through the darkness nonetheless. Stepping carefully.   Keeping an eye on THE LOBBY.   She sees NO MOVEMENT through the windows.   Okay, good. Breathe, Darlene.   Breathe.  Time to go.   She turns to step out of the darkness, into the parking lot, when -- WHUMP. She hears something.   A muffled thump in the parking lot. She turns, and sees -- Dwight. He just shut the hood of Flynn’s Futura.   He’s making his way over to the Studebaker.  Darlene’s car.  Darlene stays crouched in the shadows.   Watches in growing horror.   What is this man doing?  Dwight pops Darlene’s hood.   He searches around in her engine.   RIPS something out of it. Then Dwight steps forward.   Stares at the hotel. HOLD on Darlene.   Staring at this man.   Standing motionless in the middle of the storm.   It’s unsettling. Dwight walks to his room.   Disappears. Darlene waits.   Oh god, what did he do?   She bolts through the rain to her car.   Slips into the driver’s seat.   Fumbles with her keys.   Hands shaking.   C’mon, Darlene.   She manages to get the key into the ignition.   Turns it... Nothing.  (CONTINUED)  Bad Times At The El Royale   Final Shooting Draft   62.",
      "characters": [],
      "action_text": "The car’s dead.   No.   She tries again.   Click.   And again. Click.   Nothing.  And all the fear and panic that Darlene’s been keeping at bay, it all comes home.   She starts pounding at the steering wheel... No no no no NO...  Hold it together, Darlene . She grips the steering wheel tight.   What do I do what do I do?   She closes her eyes.   Tries to keep her voice calm. DARLENE (quietly) Dear Lord, please give me guidance. I am here in darkness and I need your light. She sees something outside. It’s Dwight again. He’s left his room.   He’s heading towards Room Seven.  Now what?  Darlene watches from the covered darkness of her car:   Dwight knocks on the door.   Dwight seems to be having a conversation with the person inside.   Dwight seems to be getting frustrated.   Dwight steps away from the door.  Dwight pulls HIS GUN out of his coat. Darlene’s eyes go wide as Dwight steps quickly to the door and KICKS IT OPEN.   Darlene JUMPS --   oh my god   -- as Dwight disappears into the room. Darlene opens her door.   Moving on instinct -- through the rain -- staying covered.   Trying to get a better look at  what’s happening inside that room .  There’s Dwight, cutting Rose free.   There’s Emily getting to her feet.   With a shotgun.   Before Darlene can scream -- BOOM.   Emily shoots Dwight. Darlene claps her hands over her mouth to stifle her scream.  Oh god NO . Darlene’s POV: Emily and Rose look at each other in shock. Look to the shattered window.   Emily steps forward. Cautious.   She pokes her head through the hole.  CONTINUED: 38   38 (CONTINUED)  Bad Times At The El Royale   Final Shooting Draft   63. EMILY  Jesus Fucking Christ!  The storm around Darlene makes it hard to hear exactly what’s being said in the room.   We hear distant screaming.   Words come through muffled. EMILY (CONT’D)  What is this?  (then)  Keep your fucking hands where I can see them!   What the hell is this?  Emily thinks.   Looks to Rose. EMILY (CONT’D) Rosie.   Stay right there. ROSE ",
      "dialogue_count": 0,
      "word_count": 1158
    },
    {
      "scene_number": 7,
      "slugline": "EXT. PARKING LOT - NIGHT 42   42  Darlene pops the hood of her Studebaker.   Stares at the engine.   Looks at the bloodied cables in her hands.  What do I do with these?  She searches for where they might fit.   Her hands shake. It’s dark.   She can barely see the engine, let alone discern where the cable might go. She makes her best guess.   Tries to lock one of the cables in place.   She closes the hood.  INT. STUDEBAKER - NIGHT 43   43  Darlene gets in her car.   Shuts the door.   Her hands fumble for her keys.   C’mom... c’mon...  She puts the key in the ignition.   Take a breath.   Please.  Darlene turns the key. The engine groans.   But doesn’t turn over. She grips the steering wheel so tight her knuckles turn white. DARLENE (closes her eyes) Lord... There’s a KNOCK at the passenger’s side window. Darlene CRIES OUT in surprise.   She reaches into her coat, pulls out the gun, points it RIGHT AT --  Father Flynn . He’s at the passenger window.   Holding both hands where Darlene can see them.   Don’t shoot.   I mean no harm.  He gestures for Darlene to roll down the window. After a moment, she does.   Never taking the gun off him. FATHER FLYNN I just want to talk.   Can I get in? Darlene thinks about it for a moment. DARLENE  I will shoot you in the face .  (CONTINUED)  Bad Times At The El Royale   Final Shooting Draft   67.",
      "characters": [],
      "action_text": "FATHER FLYNN I believe you. He doesn’t wait for further invitation.   He opens the door. Sits down in the passenger seat slowwwwwwly. He rolls up the window. He wipes the rain from his forehead. He stares at the hotel. FATHER FLYNN (CONT’D) Well. (then) We’re in a bit of a pickle here. Darlene just stares at him.   Tries to keep the gun from shaking as she points it right at him. FATHER FLYNN (CONT’D) I’m sorry I tried to drug you back there in the lobby. (then) I wasn’t trying to diddle you or nothing like that.   I just needed to break into your room and I didn’t want to hurt you.   More than need be, I mean. (then) No hard feelings about bashing me in the head, is what I’m saying. Flynn stares at the hotel.   Thinks. FATHER FLYNN (CONT’D) I’m pretty sure those girls just killed a cop of some sort. DARLENE (nods) They did. FATHER FLYNN You saw it? Darlene nods. FATHER FLYNN (CONT’D) That his gun? She nods again.   Flynn thinks.  CONTINUED: 43   43 (CONTINUED)  Bad Times At The El Royale   Final Shooting Draft   68. FATHER FLYNN (CONT’D) This is not so good for us. He looks at her.   Almost as an afterthought: FATHER FLYNN (CONT’D) I’m not really a priest. DARLENE Yeah. (then) No shit. CUT TO BLACK.  TITLE:   Room Four  We HEAR what sounds like sleigh bells jingling.   And is that some sort of Christmas music in the distance?  INT./EXT. ARMORED CAR - DAY 44   44  SAME FRAMING.   CLOSE ON the man we know as Father Flynn.   At least, we think that’s him... it’s hard to know for sure beneath that BLACK HAT and MASK he’s wearing.   We should probably start calling this man by his real name now:  This is DOCK O’KELLY . We start slowly tracking back... ROTATING as we do so... Dock seems to be frantically shoving CASH into a familiar RED BAG. Cash seems to flip and flutter in the air around us... we keep pulling back... snowflakes drift in among the cash... Dock turns, climbs towards us, and we reveal we are in: 1958.   Small town, main street U.S.A.   Christmas time. Fes",
      "dialogue_count": 0,
      "word_count": 1223
    },
    {
      "scene_number": 8,
      "slugline": "INT. COURTROOM - DAY 45   45  SAME FRAMING.   CLOSE ON DOCK.   Now cleaned up in a cheap suit and tie as he stands up next to his lawyer and awaits his sentence. JUDGE Donald O’Kelly.   On the charges of grand larceny and conspiracy to commit larceny, I hereby sentence you to fifteen years in the federal penitentiary. HOLD ON DOCK as he hears his sentence. Pre-lap the sounds of A MAN SCREAMING... MATCH CUT TO:  INT. PRISON CELL - NIGHT 46   46  SAME FRAMING.   Though now Dock’s lying on his back.   And he looks a decade older.   His wild, terrified eyes look up at us as he thrashes about in his bunk. DOCK  Where am I where am I where am I?  His CELLMATE is a large, tattooed man named SAMMY WILDS.   He tries to roust Dock from what seems like a waking nightmare. SAMMY Dock, Dock -- stop -- hey -- HEY -- You’re okay -- Dock sits up.   Stares at his cramped cell.   Confused. Terrified.   Gasping for air.   A frightened child. DOCK  Where am I?  SAMMY Same place you’ve been for the last ten fucking years.   Cell Block Four.   Just breathe... you’re okay... Sammy’s voice seems to be calming Dock down.   We get the sense this happens a lot.  (CONTINUED)  Bad Times At The El Royale   Final Shooting Draft   73.",
      "characters": [],
      "action_text": "SAMMY (CONT’D) (exhales) Jesus, Dock.   We gotta do something about this. HOLD ON DOCK as he stares at his cell.   Trying to remember who he is. CUT TO:  INT. PRISON HOSPITAL - DAY 47   47  SAME FRAMING.   CLOSE ON AN X-RAY of a skull. DR. WILLIAM LAURENCE studies the X-Ray.   Takes a drag off his cigarette. Dock sits in a prison hospital bed.   He’s wearing his prison clothes.   One hand is handcuffed to the bed rail.   He’s got a black eye and a bandaged forehead. DOCK What do you think? DR. LAURENCE I think you should stop fighting with the niggers, for starters. DOCK Mexicans.   This time.   And I didn’t do nothing. DR. LAURENCE I’d hate to see what it looks like when you do something.   They tell me that boy down the hall may not walk again. DOCK They jumped me. DR. LAURENCE Sure. Dr. Laurence stares at the chart.   Lost in thought. DOCK It’s not the fighting. Dr. Laurence takes a drag off his cigarette.   Grave.  CONTINUED: 46   46 (CONTINUED)  Bad Times At The El Royale   Final Shooting Draft   74. DR. LAURENCE (agrees) It’s not the fighting. He wheels himself closer to Dock. DR. LAURENCE (CONT’D) Tell me about your family.   Any history of dementia?   Alzheimer’s? Dock nods. DOCK My mother. (then) Her father. Dr. Laurence offers Dock one of his cigarettes.   Dock takes it.   Dr. Laurence lights it for him. DOCK (CONT’D) How long do I got? Dr. Laurence thinks.   Smokes. DR. LAURENCE When are you up for parole? DOCK Six months. DR. LAURENCE (shrugs) You should make it ‘til then. OFF DOCK -- MATCH CUT TO:  INT. STUDEBAKER - NIGHT 48   48  SAME FRAMING.   Dock sits in the passenger seat.   Stares out at the rain.   Darlene keeps the gun on him. DOCK Ten years ago, my brother Felix and I robbed an armored car in Sacramento.   Job went bad.   I think we got burned by our crew.   I went to prison, Felix got killed at the meetup.   Which was here.   At the El Royale.   We had a plan, case things went south.  CONTINUED: 47   47 (MORE) (CONTINUED)  Bad Times At The El",
      "dialogue_count": 0,
      "word_count": 2473
    },
    {
      "scene_number": 9,
      "slugline": "INT. ROOM FIVE - CONTINUOUS 56   56  Song break.   The room goes entirely silent.   Just the sound of that metronome. Tick... tick... tick... Darlene sways.   She catches a glimpse of Dock between the beds.   Crowbar under the boards.   Ready to pry.   Frozen. Watching Darlene. Darlene squares herself to the mirror. Tick... tick... tick... DARLENE  No, love, love... don’t come easy...  She walks towards the mirror.   We follow. DARLENE (CONT’D)  But I keep on waiting... anticipating...  She’s belting it out now.   Her voice full of power.   She walks right up close to the mirror... looks herself in the eye...  INT. CORRIDOR - CONTINUOUS 57   57  It looks like Emily and Darlene are standing nose-to-nose. DARLENE  For that soft voice... to talk to me at night... for some tender arms... to hold me tight...  INT. ROOM FIVE - CONTINUOUS 58   58  And Darlene screams: DARLENE  I keep waiting... INT. CORRIDOR - CONTINUOUS 59   59  Emily jumps back.   Startled. But Darlene keeps swaying. DARLENE  I keep on waiting...  (CONTINUED)  Bad Times At The El Royale   Final Shooting Draft   85.",
      "characters": [],
      "action_text": "She claps.   It almost looks like she’s having fun. DARLENE (CONT’D)  But it ain’t easy...  INT. ROOM FIVE - CONTINUOUS 60   60  CLOSE ON DOCK.   As he pries up the boards under cover of Darlene’s singing. DARLENE  It ain’t easy.   But mama said...  The board clears. There. Down in the dirt. THE RED BAG. DARLENE (CONT’D)  You can’t hurry love...   no you just have to wait...  Darlene sways back into Dock’s view. DARLENE (CONT’D)  She said to trust, give it time...  They LOCK EYES.   It’s there.  Darlene’s eyes dance. DARLENE (CONT’D)  No matter how long it takes.  INT. CORRIDOR - NIGHT 61   61  Emily turns away. DARLENE  You can’t hurry love... no --  Click.   Emily shuts off the intercom. The world goes eerily silent once again. Emily walks through the halls.   Stops at Room Four. It’s empty.   She stares at it. Thinks.  CONTINUED: 59   59  Bad Times At The El Royale   Final Shooting Draft   86.",
      "dialogue_count": 0,
      "word_count": 332
    },
    {
      "scene_number": 10,
      "slugline": "INT. LOUNGE - NIGHT 62   62  “I Think We’re Alone Now”   by Tommy James & the Shondells plays on the jukebox.   The chandelier is now on the ground, smashed. Rose seems unfazed.   She pulls a log out of the fireplace and uses it to light the braziers around the room. MILES Rose?   That’s your name, right? Please, Rose... please don’t kill me. Rose stands motionless in the center of the room. ROSE It ain’t entirely up to me. FLASHBACK TO: MALIBU MANSION - NIGHT Same framing.   Rose stands over what looks like a DEAD BODY. BACK TO: LOUNGE - CONTINUOUS MILES You can talk to her.   She’s your sister?   She’ll listen to you. ROSE It’s not up to her, either. MILES Who’s it up to? OFF ROSE, MATCH CUT TO: MALIBU MANSION - NIGHT CLOSE ON ROSE.   As she stares down at the body, we see the SHADOW OF A MAN in the WINDOW behind her. BACK TO: LOUNGE - CONTINUOUS Rose doesn’t respond to Miles.   She turns to light another brazier.  (CONTINUED)  Bad Times At The El Royale   Final Shooting Draft   87.",
      "characters": [],
      "action_text": "Emily enters.   Deep in thought.   She sets the shotgun down on the front desk. She drums her fingers on the desk.   Something about this is not right...  EMILY Where’s the priest? She looks across the room.   Miles shifts uncomfortably. EMILY (CONT’D) Miles? MILES I don’t know. Emily moves towards him. EMILY But you know something, don’t you? She reaches into her pocket.   Pulls out Miles’ heroin.   Slaps it on the table. EMILY (CONT’D) This is yours? Miles nods. EMILY (CONT’D) You want it? Miles stares at the heroin.   Nods. EMILY (CONT’D) Where’s the priest? MILES I don’t know.   I promise.   I want to find him, too.   Please. Tears start to well up in his eyes. MILES (CONT’D) Please.   I’ll do whatever you want. Just let me talk to the priest when you find him. (then) Just let me talk to him before you kill me. In the background, Rose pirouettes on the border.  CONTINUED: 62   62 (CONTINUED)  Bad Times At The El Royale   Final Shooting Draft   88. ROSE I been trying to tell him, we might not have to kill him.   But it’s not up to us. Emily’s face falls.   Wait.   What?  EMILY Who’s it up to? A CHILL runs down her spine as she looks to her sister. EMILY (CONT’D) Rosie... what did you do? In the darkness behind Emily, the shadows MOVE...  EXT. ROOM FIVE - NIGHT 63   63  Darlene and Dock slip out of Room Five.   Darlene holds the gun, Dock holds the bag.   They keep their eyes locked on THE LOBBY as they creep towards the parking lot. They give each other a look.   We did it.  Darlene motions for Dock to wait.   She creeps forward, stares at the front windows of the lobby.   It’s DARK.   Why’s it so dark?   She waits as the sound of thunder crashes around them. We can feel Darlene’s heart pounding.   Something is wrong... but, if we’re gonna move, we better move now.   Darlene turns to Dock...   let’s go...  And a man has a knife at Dock’s throat. Darlene’s eyes go wide with shock.   She starts to raise the gun... a hand whips out of the shadows behind her, grabs h",
      "dialogue_count": 0,
      "word_count": 9053
    }
  ]
}