{
  "slug": "ballers-101-pilot-2015",
  "title": "ballers 101 pilot",
  "genre": "drama",
  "format": "series",
  "scenes_count": 6,
  "characters_count": 0,
  "characters": [],
  "total_words": 6715,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. MIAMI- VERY EARLY MORNING - PRE DAWN  South Beach.   Hotel Row. Overbuilt condos...in one of them...  INT. CONDO COMPLEX - SAME  A man and woman sleep. We notice two things. He’s heavily  muscled, she’s boomin’ hot.   Her perfect, bare ass is  partially covered by the sheets. Close on HIS eyes. Eye lids  flutter back in forth in a state of REM.   We move closer and  bam...  POV: Inside a helmet.   View partially obstructed by the grid  of the face mask.   Absorb one bone crushing hit after  another.   Mini earthquakes inside his head. One last blow and  then his eyes pop open. Takes a minute.  He rolls over.   Sits on the edge of the bed.   SPENCER  STRASMORE, mid 30’s, Black, former All-Pro running back.  Always ran hard.   Grew up in Virginia Beach, and if you think  there’s no hood near the beach, then you haven’t been to the  757.   Adopted too..  Prepares to stand but before he can, he has to place both  hands on his knees.   Tiny holes pepper both knees.   A pinky  juts out at a right angle.   Knuckles swollen.   Football  fingers.   Spencer braces himself, pushes down on his  knees...and stands up.  Walks into the bathroom and CLOSES the door.   Opens a drawer,  filled with orange pill bottles.   Grabs a handful of pain  killers, pops them in his mouth...starts CHEWING them.  He may look beat up and busted right now, but only we see  this. Put him in a custom made suit and, to the outside  world, he is still the same 227 lbs of chiseled perfection.  Like many of his peers, he never lets anyone see behind the  curtain.  He opens the bathroom door and sees MARQUEZ, mid 20’s  brunette, frantically grabbing her clothes from the floor.  She jumps into her skirt, pulls her blouse over her head,  grabs her heels in her hand and heads for the door barefoot.  SPENCER  You don’t want to shower here?  MARQUEZ  Can’t. Totally messed up. Have a  meeting at the network in an hour.  It’s easier.  HBO Draft (7/12/12)   2.",
      "characters": [],
      "action_text": "SPENCER  Easier?  MARQUEZ  All my stuff is there. Products,  hair, skin...you know, stuff that  makes one pretty.  SPENCER  Got it.  MARQUEZ  Babe, I had a really nice time last  night. Bye.  She heads toward the door.  SPENCER  You forgetting something?  She looks at him confused, then smiles, heads over to him and  gives him a goodbye kiss.   He grins.  SPENCER (CONT’D)  That’s what I’m talking about.  EXT. OCEAN DR. - DAY  A Big Benz cruises onto the Causeway, Star island in the  distance.  INT. BIG BENZ - SAME  A guy, RODNEY, Black, late 30’s, drives, obviously a baller,  the girl next him, KIMMY, 26, Latina, is his girl.  KIMMY  Baby, I love you.  RODNEY  And I love you, baby.  KIMMY  Do you really? Are you sure?  RODNEY  Why do you always ask me that?   You  know I do.  KIMMY  How much?  HBO Draft (7/12/12)   3. RODNEY  More than anything. But why you  always have to quantify things?  KIMMY  I don’t know.   Maybe I just like to  hear you say it.  RODNEY  Well then I’ll say it again.   I  LOVE you baby.   More than anything.  KIMMY  Anything?   More than football?  RODNEY  More than ball.  KIMMY  More than your Rookie of the year  trophy?  RODNEY  Yep.  KIMMY  How bout your Superbowl ring?  He thinks.   Pauses.  RODNEY  Hmmmm. Even more than that.  KIMMY  So you would do anything for me?  Cause I would do anything for you.  Even kill myself.  He turns and stares at her.   She’s crazy.   He responds  without missing a beat.  RODNEY  Anything.   I would do absolutely  anything.  KIMMY  Even leave your wife?  He doesn’t respond.   She does.  KIMMY (CONT’D)  You motherfucker.   I knew it.  HBO Draft (7/12/12)   4. RODNEY  Would you relax?  KIMMY  Relax? Relax?!? You told me you  were separated!!  RODNEY  I am.  KIMMY  You lying piece of shit.   I  checked.  She grab his balls. Starts to punch him.   He looks to push  her off of him.   Starts to swerve when a semi plows right  into them.   Dead.  INT. STADIUM - DAY  On the field a temporary stage with makeshift blea",
      "dialogue_count": 0,
      "word_count": 2129
    },
    {
      "scene_number": 2,
      "slugline": "INT. THE WALL NIGHT CLUB - CONTINUOUS  Night club going off.   The guys are joined by several other  former players. Everyone drinks, Charles drinks water.  PROMOTER brings boom boom girls to the table.  PROMOTER  Dashi, Paulina, and Barrrrbara,  (whispers to guys)just don’t call  her Barbara.   Girls, meet the dream  team.  The guys smile and say hi.  SPENCER  What can I get for you girls?  GIRLS  (in Unison)  Champagne please.  The girls jump up and sit of the ledge of the booth.   Paulina  stands and starts dancing on top of the booth.   The waitress  comes over with a bottle of Dom.   Hands each of the girls a  flute.  Dashi sits down next to Charles.  DASHI  I’m Dashi, who are you?  CHARLES  Charles Green.  DASHI  Who do you play for Charles Green?  CHARLES  (self conscious)  Used to play. But I’m retired now.  Haven’t really figured what I want  to do next.   I’m still  contemplative.  With that she gets up to moves on.  DASHI  Nice to meet you Charles.   Good  luck with everything...  Spots Ricky, realizes who he is, makes a beeline for him...  HBO Draft (7/12/12)   13.",
      "characters": [],
      "action_text": "Ricky and Spencer, admiring the view.  RICKY  Didn’t he meet Kimmy here.  SPENCER  Yep.   He had a thing for bottle  service girls.  RICKY  Who doesn’t?   You think it’s the  uniform?  SPENCER  No, I think it’s they’re hot and  you’re drunk.  RICKY  Then I think I’ll stick to a  civilian tonight.  Dashi sits down next to Ricky.  DASHI  Hi, I’m Dashi...  RICKY  I’m Ricky, what you do Dashi?  DASHI  I’m in branding.(she’s not)  INT. BATHROOM  Dashi is propped up a small sink inside a unisex bathroom  while Ricky is fucking the hell out of her.  EXT. BATHROOM HALLWAY-MOMENTS LATER  A line has formed.   People grow impatient.   Even over the  music you can hear Dashi howling in ecstacy coming from  inside.   They all look at each other.   A FRAT BOY type,  wearing a way to colorful button up starts banging on the  door.  FRAT BOY  Come on you somma bitch, hurry the  hell up.  A moment later the door opens.   Ricky emerges.   Quickly  closes the door behind him before Frat boy can get in.  HBO Draft (7/12/12)   14. RICKY  O my bad, didn’t know people were  waiting.(He did) Do me a favor and  just give my girl a minute, would  you? She’s not feeling too well.  The kid looks at him.   Realizes.  FRAT BOY  Hey, you’re Ricky Jarret. (Ricky  nods) I watched you and your boy  Rodney play at SC.  RICKY  You a Trojan too?  FRAT BOY  Hell no. Fuck the TROjans.  RICKY  Huh?  FRAT BOY  Rules don’t apply to you, huh? No  common decency? You guys with your  self entitlement.   Y‘all nothin’  but a bunch of selfish womanizing  assholes...know what I mean?  RICKY  No, I don’t know what ya mean. (He  does) How bout you tell me, big  boy?  FRAT BOY  How bout you ask your friend  Rodney?  Ricky punches the guy in the face and drops him.   Casually  turns and walks back to the table.  A guy in line takes out his cell and types...  We freeze frame on Ricky walking away.  Super reads “@RickyJarret just punched some guy at #THEWALL”  INT. WALL NIGHT CLUB - GUYS TABLE - CONTINUOUS  Spencer see",
      "dialogue_count": 0,
      "word_count": 1562
    },
    {
      "scene_number": 3,
      "slugline": "INT. CAR - SAME  Ricky wearing sunglasses and a Yankee baseball hat.  RICKY  Spence, it’s Rick. You wanted to  talk?  SPENCER  Yea, can we grab dinner tonight at  Prime 112?  RICKY  Nah, can’t do that, don’t want to  see anybody.  SPENCER  Where’re you now?  RICKY  Where else? Parked right out front  of your office.  Spencer shakes his head.  SPENCER  Ricky, hold on a sec. Joe. It’s  Ricky Jarret, needs a minute with  me.  JOE  Not a problem, but you should be  handling him. Bro, the time to  pounce is when people are at their  weakest. By the way, what’s it like  to get traded?  SPENCER  I wouldn’t know.  EXT. ANDERSON FINANCIAL - CONTINUOUS  Spencer walks out to see Ricky in his Red 458 Italia Ferrari.  License plate 88.   Spencer gets in the car.  SPENCER  Thought you were laying low?  RICKY  It was this or the monster truck.  Thought this was a better choice.  HBO Draft (7/12/12)   22.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 158
    },
    {
      "scene_number": 4,
      "slugline": "INT. LOS PERROS RESTAURANT - HIALEAH, FL - LATER  Spencer and Ricky eat with the locals. They munch on  ChorriPerros (Cuban Hotdogs).   Ferrari in the background  surrounded by junkers. Ricky is amped and fidgety.  RICKY  I don’t want to be traded.  SPENCER  You’ve been traded before.  RICKY  Yea, but I was young and stupid  then.   This time it’s different. I  like where I am.   Don’t want to  learn a new system, play the get to  know you game.  SPENCER  Did Jason tell you that?  RICKY  (panicked)  No, I’m not talking to him.   I’m  avoiding his calls. (Takes a  bite)...I’m not letting them treat  Ricky Jarret like this. I mean  fuck, if they send my ass to  Jacksonville, I’ll retire.   I do  not care.   I’ll do something else.  SPENCER  You threatening to quit?  RICKY  Fuck being part of rebuilding an  organization. Had 1000 yards last  year.  SPENCER  Oh, so you’re going to pull a Tiki  Barber?   Retire early.   Pursue your  dreams.   Nigga please. You think  there should be special rules?  Ricky Rules.  RICKY  Hell no.   It’s not what I’m saying.  They didn’t treat you like this,  Golden boy.  HBO Draft (7/12/12)   23.",
      "characters": [],
      "action_text": "SPENCER  Golden boy, huh?   Well let me tell  you what it was like...I had an  image of what my retirement day was  going to look like, standing at the  podium, mic in front of me, coach  on one side, owner on the other,  family and friends surrounding  me...you know how it went down?  Ricky shakes his head, he doesn’t  SPENCER (CONT’D)  Sitting at my kitchen with my cell  phone...waiting for the call from  the owner, GM, hell even the  trainer.   You know when it came?  He stares at Ricky.  SPENCER (CONT’D)  Never.  RICKY  Really?  SPENCER  Yes, really.   I’ll swap with you.  Trade my life to get one more play.  Nothing can replace that feeling.  So you better wise the fuck up,  because you got one more contract  before you join the rest of us.  Start acting and conducting  yourself like a professional.   Do  not do anything on your own.   No  phone calls, no texts and you  better not be tweeting.  RICKY  You’re right...I promise.   No  tweeting.  INT. CHARLES’ TRUCK - LATER  Charles cruises down Biscayne Blvd.   Stops at light.   Looks  down at the passenger seat covered in empty wrappers.  There’s one last Yodel.   He stares at it. Finally he snatches  it, opens it, takes a huge bite and smiles.  HBO Draft (7/12/12)   24.",
      "dialogue_count": 0,
      "word_count": 405
    },
    {
      "scene_number": 5,
      "slugline": "INT. SETAI - LATER  Jason walks through the lobby, talks on his cell to  Philadelphia Eagles GM.  JASON  John, we both know that the Packers  have family base and you guys have  a rogue base.   If they put him on  waivers you will be fighting six  other teams for Ricky. You don’t  want that.  EAGLES G.M.  Six?  JASON  Ok, 3.  EAGLES G.M.  I’ll think about it.   But it’s hard  to make a decision without knowing  how long the suspension is going to  be.  Jason winces at the word suspension.  EXT. TROPICAL CHEVROLET - SAME  Charles drives along, sees Chevy dealership, decides to turn  in.  INT. TROPICAL CHEVROLET - CONTINUOUS  Shined up cars fill the floor, surrounded by desks occupied  by SALESMEN.   One jumps up as soon as he sees Charles walk  through the door.  SALESMAN  Hey, how you doing today buddy?  CHARLES  Good.  Looks out the window at Charles’ truck.  SALESMAN  You looking for an upgrade?  CHARLES  No, sir. I’m looking to get me a  job. You guys hiring?  HBO Draft (7/12/12)   25.",
      "characters": [],
      "action_text": "SALESMAN  Have you worked in car sales  before?  CHARLES  No, sir.  SALESMAN  Sales of any kind?  CHARLES  No, sir.  SALESMAN  What was your last job?  CHARLES  You a football fan?  SALESMAN  Hell yeah, I’m a fan!  CHARLES  Played offensive line for the Rams.  Charles Green.  He extends his huge hand.  SALESMAN  No shit, don’t remember you.  CHARLES  Don’t feel bad.   No one ever  remembers the right tackle.  INT. STAR ISLAND HOME - LATER  Ricky antsy in his trophy room.   Triple flat screens on the  wall.   He stares at the phone, can’t control himself.  Finally he hits speed dial for the Packers front office.  SECRETARY  Packers office.  RICKY  It’s Ricky Jarret, is Mr. Johnson  available?  SECRETARY  Hold one moment please.  Long hold.   Ricky fidgets.  HBO Draft (7/12/12)   26. OWNER  Hello.  RICKY  (Owning it)  Mr. Johnson, I’m calling to  apologize.   I messed up.   No other  way to say it. I am a fuck up and I  let my emotions get the best of me.  OWNER  I appreciate your honesty, son.  RICKY  I’d also like to say that I will  never put myself or YOUR team in  this position ever again.  OWNER  Good to know and I admire the call.  I’ll take it all under  consideration.  RICKY  Thanks so much.  OWNER  Take care.  They hang up.   The owner looks over to his executive team.  OWNER (CONT’D)  Cut him.  INSERT SHOTS  Spencer’s phone -   Text from Ricky. “I called Mr. Johnson.  Think we’re good”.  Jason’s phone -   Text from Ricky. “I called Mr. Johnson.  Think we’re good”.  Off both their looks...Fuck.  EXT. CORAL GABLES - POP WARNER FOOTBALL FIELD - AFTERNOON  A practice game of 12 year olds in progress.   Tina watches  from the sidelines as Rodney Jr. scrambles for big yardage.  He is clearly the best kid on the field by a wide margin.  Spencers walks up next to her.  HBO Draft (7/12/12)   27. SPENCER  I’m impressed to see you guys out.  TINA  They say the best thing for kids is  to keep them in their daily  routine.   Keep them busy.  Rodney Jr. notices Spencer o",
      "dialogue_count": 0,
      "word_count": 845
    },
    {
      "scene_number": 6,
      "slugline": "EXT. STAR ISLAND HOME - LATER  Spencer, Jason, Ricky and his girlfriend, ANNABELLA, talk out  in the back.   Biscayne Bay in the background.  RICKY  Cut me? Cut Ricky Jarret? 22nd all  time on the receivers list.  ANNABELLA  Behind Steve Largent.  RICKY  Who the fuck is that?  SPENCER  Hall of fame...  RICKY  I cannot believe I’m in this  position.   They can’t even get  value for me?  JASON  You know how it is now.   Once they  see an imperfection the  organization doesn’t want to have  anything to do with you.  SPENCER  It’s just politics.  ANNABELLA  He’s still one of the best damn  wide outs in the league.  RICKY  It’s humiliating.  JASON  I’m working to fix it. I’ve already  been in contact with Philly, Miami,  Atlanta, and Tennessee.  ANNABELLA  And?  JASON  I’m waiting for them to get back to  me.  ANNABELLA  Waiting?   Training camp starts in 3  weeks.  HBO Draft (7/12/12)   30.",
      "characters": [],
      "action_text": "Jason looks at her.  RICKY  (to Annabella)  Baby. Chill. (To Jason, honest and  insecure.) I can’t stand to wait.  INT. CHARLES’S HOUSE - AFTERNOON  Charles comes walking in.   Julie’s there waiting.  JULIE  I got worried. I came in.  Sportscenter wasn’t playing, you  weren’t on the couch...I thought  you might have been abducted.  CHARLES  Why you always have to make jokes  at my expense? You know I’m  sensitive.  JULIE  Because deep down you like it. You  know you always played better for a  hard ass coach.  CHARLES  True.  JULIE  You know mama is always here for  you. More than anything I got you  back. We are in this together.  She goes to kiss him, stretches up to reach him.  CHARLES  Yea I know.  JULIE  So how did you do? Any leads?  CHARLES  Well I...  He pauses for a second and then whips out the Tropicana  Chevrolet hat from his back pocket and puts it on his head.  CHARLES (CONT’D)  You now looking at the new salesman  of the biggest Chevy dealership in  Miami.  HBO Draft (7/12/12)   31. JULIE  Baby!  She jumps on him and straddles him...  INT. STAR ISLAND HOME - RICKY’S BEDROOM - LATER  Ricky getting ready for bed. TV, muted, on ESPN, Adam Shefter  reports. Ricky sees his face being featured next to  Shefter’s. Annabella nowhere to be seen. Ricky turns off the  TV, kneels next to the bed.  RICKY  Please dear God, if you bestow on  me a chance to play again, to lace  up my shoes, to put on my pads and  once again take motherfuckers out,  I promise I will make you proud...  INT. TROPICAL CHEVROLET - NEXT DAY  Charles is at his desk getting a tutorial on car sales by a  guy named, RAY, 53.  CHARLES  What happens if I don’t know  something?  RAY  You’re a car salesman, just make it  up.  Charles walks up to a customer.  CHARLES  How you doing today, sir?  CUSTOMER  Not bad.  Charles looks out the window to see that the guy’s car is a  Mercedes.  CHARLES  Looking for an upgrade?  Customer laughs.  CUSTOMER  No, I’m looking for a truck for  hunting and fishing.",
      "dialogue_count": 0,
      "word_count": 1616
    }
  ]
}