{
  "slug": "battlestar-galactica-101-33-2005",
  "title": "battlestar galactica 101 33",
  "genre": "sci-fi",
  "format": "series",
  "scenes_count": 3,
  "characters_count": 4,
  "characters": [
    "SHARON",
    "GAETA",
    "ADAMA",
    "LAURA"
  ],
  "total_words": 9560,
  "total_dialogue": 4,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. SPACE - COLONIAL ONE 7   7 The transport ship in amid the rest of the civilian ships. Several of the other civilian ships JUMP AWAY, leaving Colonial One and a few others. INT. COLONIAL ONE - OFFICE 8   8 LAURA sitting in what has now been transformed into a crude Oval Office.   BILLY is on the phone and various AIDES are in their seats.   Like on Galactica, everyone here is exhausted, stressed, and watching a digital clock counting down the seconds:   7... 6... 5... LAURA Cutting it a little close this time, aren’t we, Billy? BILLY (listening to phone) Pilot says he’s had to reboot the FTL computer again. Laura looks around the cabin at the tense and scared faces. She tries to put on a confident smile for them. INT. BALTAR’S HOUSE - DAY 9   9 Six sidles up to Baltar, slips an arm around his waist, nuzzles his neck. NUMBER SIX I love you.   That’s not rational. BALTAR You’re not rational.   You’re also not really here. INT. GALACTICA - HANGAR DECK 10   10 TYROL and his DECK GANG are standing by, watching a wall CLOCK as the final seconds tick down.   The fatigue and exhaustion are all too evident here as well.   CALLY is   * standing next to TYROL.   She’s mentally burnt, strung-out,   * right on the edge.   * CALLY   * Why is it always thirty-three   * minutes?   Why isn’t it thirty-four?   * Or thirty-five?   Or fifty-five?   Or   * sixty-seven or seventy-eight...?   * '33' Fully Collated - 6/22/04   3. (CONTINUED)",
      "characters": [],
      "action_text": "TYROL   * Cally.   * CALLY   * Yeah?   * TYROL   * It’s gonna be alright.   * Cally pulls herself back, nods.   They resume watching the   * clock:   4... 3...   * INT. BALTAR’S HOUSE - DAY 11   11 Baltar is kissing Six’s neck, unbuttoning her blouse, losing himself in the eroticism of this woman in his arms.   She smiles indulgently. '33' Fully Collated - 6/22/04   3A. CONTINUED: 10   10",
      "dialogue_count": 0,
      "word_count": 321
    },
    {
      "scene_number": 2,
      "slugline": "INT. KARA’S VIPER 12   12 Kara is in her Viper, waiting along with the rest of the squadron in space.   She slaps her arms, shakes her head, tries to get bodily awake and ready. KARA   * How many times is this?   Have we   * passed two hundred yet?   * INTERCUT WITH:   * INT. LEE’S VIPER 12A   12A   * LEE   * Try two thirty-seven.   * KARA   * Two thirty-seven?   You’re telling   * me I missed number two hundred?   * LEE   * That’s what I’m telling you.   What,   * were you planning something   * special?   * KARA   * Just like to keep track of these   * things.   Two hundred was such a   * nice round number.   Now I gotta   * wait for three hundred.   * LEE   * Don’t even joke about that.   * Kara looks at her digital WATCH:   2... 1...   * INT. BALTAR’S HOUSE - DAY 13   13 Baltar has Six on the chaise and begins to make love to her. She pulls back, looks at him with regret. NUMBER SIX Time’s up. QUICK CUTS: 14   14 The digital clocks all around the fleet register ZERO and the analog second hands all reach the hour mark-- '33' Fully Collated - 6/22/04   4.",
      "characters": [
        "SHARON",
        "GAETA",
        "ADAMA"
      ],
      "action_text": "EXT. SPACE 15   15 Hold a beat on the empty starfield... then a CYLON BASE SHIP JUMPS into view.   It LAUNCHES MISSILES immediately. CLOSE ON BALTAR Eyes closed.   His eyes fly OPEN at the sound of the Pilot’s VOICE coming over the P.A.: PILOT (P.A.) Ladies and gentlemen... REVEAL: INT. COLONIAL ONE - OFFICE 16   16 Baltar is sitting in a chair at the rear of the cabin. PILOT (P.A.) I’m afraid the Cylons have appeared again.   However, our FTL drive is now working and we will Jump momentarily. Baltar rubs his face with his hands.   Unlike the way he looked in his house, here Baltar looks like hell; a man right on the edge of his ability to take the stress and pressure and fatigue. '33' Fully Collated - 6/22/04   4A. (CONTINUED) Number Six leans into frame.   We begin to realize that she is the one constant in his mind -- a phantom that slides easily back and forth between the calm sedate world of the house he used to live in and the chaotic world of life in the rag-tag fleet. INT. GALACTICA - CIC 17   17 The dradis console shows enemy blips and ALARMS are going off around the ship.   There’s just the slightest pause of resignation as everyone realizes that it’s happened again. Tigh’s exhaustion and disappointment is palpable -- Adama is just as tired as everyone else, but his mind is already moving on and he goes to Tigh with an encouraging tone: ADAMA (to Tigh) Not this time -- but maybe the next.   I’ve got an idea for the next cycle... The CIC becomes a beehive of activity once again.   PILOT CHATTER coming in, officers and enlisted scurrying about. Tigh watches his crew perform their tasks -- his temper is short, not tolerant of mistakes in this situation.   He quickly spots an error on one of the consoles, taps the display over the shoulder of the unfortunate Lieutenant. TIGH Watch the ammo hoists for the main guns -- you’ve got a red light right there. The ship is ROCKED by an explosion. DUALLA (to headset) Hit on the starboard bow.   Away the damage control p",
      "dialogue_count": 3,
      "word_count": 4874
    },
    {
      "scene_number": 3,
      "slugline": "INT. BALTAR’S HOUSE - DAY 71   71 Baltar sits up in his chair, puzzled and disturbed.   Number Six walks by him. NUMBER SIX God is watching over you, Gauis. Baltar is thrown, rattled by the strange coincidence. BALTAR The universe is a vast and complex system.   Coincidental and serendipitous events are bound to occur, indeed they are to be expected. NUMBER SIX Doctor Amarak posed a threat to you.   Now he’s gone.   Logic says there’s a connection. BALTAR A connection, maybe.   But not God. There is no God or gods -- singular or plural.   No invisible men or women taking a personal interest in the fortunes of Gaius Baltar. NUMBER SIX Be careful.   That which God gives, he can also take away. Baltar reaches out a hand, grabs the hem of her outfit. BALTAR We have another half hour -- shall we? NUMBER SIX Not this time, Gaius.   This time’s going to be different. DISSOLVE TO: '33' Fully Collated - 6/22/04   30.",
      "characters": [
        "LAURA"
      ],
      "action_text": "EXT. SPACE - THE FLEET 72   72 Including Galactica and Colonial One.   The ships are in formation and barely moving. EXT. SPACE - VIPERS 73   73 Hanging in space, ready for the Cylons to appear. INT. HANGAR DECK 74   74 Tyrol and his deck hands are watching the clock. INT. COLONIAL ONE - OFFICE 75   75 Laura, her aides, Billy and Baltar waiting in the b.g. INT. CIC 76   76 Everyone watching the clock as the second hand sweeps toward the hour mark:   5... 4... TIGH Maybe this time... 3... 2... 1....zero. And nothing happens. A long, quiet beat passes.   People exchange looks. ADAMA Dradis? GAETA No enemy contacts. Adama watches the clock as the hand keeps sweeping around. TIGH (sotto) What do you think? ADAMA I think we wait.. DISSOLVE TO: INT. CIC 77   77 Later.   The clock now shows that 45 minutes have passed. Adama is pacing, thinking. '33' Fully Collated - 6/22/04   31. (CONTINUED) ADAMA Get me the president. INT. COLONIAL ONE - OFFICE 78   78 Moments later, Laura is on the phone with Adama. LAURA Why this time -- something you did? INTERCUT: INT. CIC 79   79 Adama on the phone with Laura. ADAMA No.   We’ve been working on a new plan, but didn’t have time to implement it yet. LAURA We lost a ship last Jump -- the Olympic Carrier.   Could that have something to do with it? ADAMA Possibly... A long beat on both ends of the phone as each of them tries to think straight, but fatigue is making them feel like they’re both wading through rivers of mud. LAURA You there? ADAMA Yeah, I’m here. LAURA I can’t believe this is really over. ADAMA No.   Can’t let our guard down yet. LAURA So what do we do?   I’ve got people on the verge of collapse over here. Adama glances around the strained, exhausted faces in CIC. '33' Fully Collated - 6/22/04   32. CONTINUED: 77   77 (CONTINUED) ADAMA I know what you mean. (beat) We’ll go to Condition Two. He catches Tigh’s eye as he says it, and Tigh nods agreement. ADAMA (cont’d) Each ship keeps the first watch on alert.   Other watches g",
      "dialogue_count": 1,
      "word_count": 4365
    }
  ]
}