{
  "slug": "baywatch-2017",
  "title": "baywatch",
  "genre": "action",
  "format": "film",
  "scenes_count": 2,
  "characters_count": 1,
  "characters": [
    "ELLERBEE"
  ],
  "total_words": 26561,
  "total_dialogue": 1,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. THE BAY - MORNING  Pristine water. Perfect sand. Not a trace of garbage or even  seaweed. This is the beach as it should exist.  A ripped surfer shreds an early morning wave. Two California  beauties dip their feet in the water, chasing the surf. A  sand-sculptor makes an amazing castle. God it’s awesome here.  Drums start. Music is beginning to build. And now, the shot  that made BAYWATCH the biggest show on planet Earth:  CJ PARKER  a beautiful blonde bombshell of a LIFEGUARD with a red rescue  can jogs past the beachgoers in glorious sun-dripped slo-  motion. She looks to a LIFEGUARD TOWER where a tall brunette  STEPHANIE HOLDEN  emerges, making notations about the tidal conditions on a  clipboard. She nods to CJ, all business. Attractive but  conservative, she looks to her watch, expectant.  Everyone on the beach now turns. Women, men, children, the  old, the young, they all ready themselves...  ...for it’s time for ‘IT’ to happen:  OCEAN  The water is calm, almost a sheet of glass.   After a couple  of beats, however... BUBBLES begin to appear. Just a few at  first... but then more.   There’s something down there.  Something rising. Is it a sea beast? No, it’s --  6-FOOT 5-INCHES, 255 POUNDS OF PURE MUSCLE & GRIT. A tanned,  strapping package of ‘Fuck Yeah!’ -- rising out of the ocean  like Godzilla -- covered by only a pair of red swim trunks  with a ‘BAYWATCH’ emblem.   This is  MITCH BUCHANAN  He probably just swam 5 miles, but he isn’t even out of  breath. He turns to the ocean and makes a series of loud  CLICKING SOUNDS. What the hell is he doing?  Just then, THREE DOLPHINS emerge, responding to his call,  ‘tail-walking’ on the water. Incredible. Mitch grins:  MITCH  ‘Mornin’, ladies!  Mitch now begins his morning run. We follow him as he passes:",
      "characters": [
        "ELLERBEE"
      ],
      "action_text": "-- THE BEACHCOMBER SNACK SHACK (exchanging a ‘Sup nod with  its elderly FILIPINO OWNER).  -- THE PIER (where fishermen are hauling fresh catch to their  trucks; one worker tosses Mitch a hunk of sushi-grade tuna,  which he catches with one hand. Takes a bite. Approves.)  -- BASKETBALL COURTS. 10 BALLERS are in the middle of a full  court game. Just as a streaking player goes up for a dunk,  however -- Mitch meets him mid-air and swats the ball away!  VARIOUS BALLERS  Ohhhhhh/Shiiiiiitttt!/Dammmmm!  The rejected baller is pissed... until he sees it was Mitch  (who’s just smiling back, continuing his run).  MITCH  Not in my house, Darnell.  And DARNELL is actually cool with it. As if being blocked by  Mitch was some kind of honor.  DARNELL  Motherfuckin’ Mitch Buchanan!  Brother saved my Nana’s life. I  ever tell you that?  BALLER  Every time he jogs by. Literally  every single time.  MITCH, FURTHER ALONG ON HIS RUN  He passes LUXURY BEACH HOMES... when he’s hit in the head by  a bikini top.   He stops, looks up at the source, finding: A  smoking hot WOMAN standing on her balcony, wearing only the  matching bottoms. Mitch smiles up at her.  TOPLESS WOMAN  Ooops. Finish your workout up here?  MITCH  Sheilaaaaa... you’re married. You  know I don’t swim in other men’s  waters.  Her HUSBAND comes out, cradling his morning cup of coffee. He  calls down:  HUSBAND  For you, Mitch? I’d make an  exception!  2. Mitch laughs and points up at him -- you dog! He keeps  running, leaving her deeply disappointed. He turns to her --  HUSBAND (CONT’D)  You know, if you’re in the mood --  TOPLESS WOMAN  Shut the fuck up, Howard, I can’t  face your tired dick right now.  ELLERBEE  A bit-overweight black COP sits on an idling beach patrol  ATV, writing someone a ticket for littering. Mitch jogging  by, turns backwards --  MITCH  Hey, Ellerbee -- why don’t you get  off that Rascal and join me?  Ellerbee laughs but we can see he’s putting on a fake smile --  ELLERBEE  All-Terrain-Vehicle, M",
      "dialogue_count": 1,
      "word_count": 16823
    },
    {
      "scene_number": 2,
      "slugline": "INT. POLICE STATION WAITING ROOM - DAY  Mitch & Brody are sitting together, looking pret-ty  victorious. This is as close to a team as we’ve seen them.  BRODY  I gotta admit -- catching those bad  guys like that? Kind of a rush.  MITCH  That’s not why we do this. But hell  yeah.  There’s yelling behind the door. Ellerbee comes out of the  office. He just got his ass torn. Comes to them, points --  SGT. ELLERBEE  My office -- now!  ELLERBEE’S CUBICLE  Mitch & Brody take in Ellerbee’s “office”.  MITCH  You know, I think by definition an  office is required to have walls.  BRODY  And a ceiling.  Ellerbee isn’t amused. Mitch redirects:  MITCH  So what’d you learn from the perps?  SGT. ELLERBEE  “The perps”? Mitch, the only  “perps” here are you two. You  turned the Venice Canals into the  goddamn X-Games!  MITCH  We were in lifeguard pursuit.  SGT. ELLERBEE  There’s no such thing as a  “lifeguard pursuit”!   Police   do  pursuits! When you do it, it’s just  some guys chasing some other guys.  MITCH  (indignant)  What are you saying? You’re just  gonna let these guys walk?  76.",
      "characters": [],
      "action_text": "SGT. ELLERBEE  Walk?! You’ll be lucky if they  don’t sue you for harassment! They  said you came at them for no reason  and that they were fleeing for  their lives! Thank god that nice  rich family has rich people  insurance --  MITCH  Look, we have reason to believe  they’re involved in the Mexican  Drug Cartel running an Op here in  the Bay. We have a key piece of  evidence we’re calling the  ‘Converso Clue’. I just don’t know  how they’re moving the product in  from Mexico without me noticing...  Ellerbee does a complete -- WTF?! -- and turns to Brody:  ELLERBEE  And you, you believe this  horseshit, too? Have you actually  seen   any drug smuggling??  Brody looks to Mitch -- would like to cover for him -- but  BRODY  Well... No. No, I haven’t, but --  SGT. ELLERBEE  Leave -- the law enforcement -- to  the police. That’s the last time  I’m gonna say it. Do your job,  Mitch --   and your job only   -- or  you’ll be looking for another one.  OUTSIDE THE STATION  Mitch walking away from the station, eyes focused forward,  doesn’t wanna talk to Brody who trails.  BRODY  Mitch! Mitch, I’m sorry -- what was  I supposed to do?!  But Mitch just keeps walking. Brody stops, shakes his head.  INT. MITCH’S PLACE - NIGHT  Victoria and Mitch are eating dinner together. She looks  happy. Mitch looks distracted. Introspective.  77. She’s pouring the wine, about to spill. Mitch goes to her,  and helps. They kiss. But Mitch looks like his mind is  somewhere else.  EXT. THE BAY - MORNING  Mitch is at the lifeguard tower, back in his perch, looking  over the beach. There are two-young girls swimming. A woman  sun tanning on a beach towel. Slow day.  BRODY  More like it, right?  Brody closes his eyes in the warm sun and grins. That’s when  a man in a woven straw hat leads over a HORSE by his reigns,  a woman riding with her head turned away --  MITCH  Excuse me! You got a permit for --  The woman turns -- it’s VICTORIA riding!  MITCH (CONT’D)  Victoria! What are you doing?  VICTORIA ",
      "dialogue_count": 0,
      "word_count": 9738
    }
  ]
}