{
  "slug": "beautiful-boy-2018",
  "title": "beautiful boy",
  "genre": "drama",
  "format": "film",
  "scenes_count": 18,
  "characters_count": 0,
  "characters": [],
  "total_words": 18295,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. MEDICAL OFFICE AT UCLA - DAY  DAVID SHEFF - in his 40’s and still a great looking guy - is seated with DR. BROWN (62), a passionate amiable man. We stay close on David. DR BROWN (O.S.) So this is for The New York Times Magazine? DAVID No. I’m sorry... I freelance, I write for different magazines but this is a personal matter. DR BROWN (O.S.) A personal matter? DAVID Yes. I’m sorry, is that okay? DR BROWN (O.S.) That’s absolutely okay. May I ask what this is regarding? DAVID It’s about my son. DR BROWN (O.S.) Okay how can I help? DAVID There are moments that I look at him, this kid that I raised who I thought that I knew inside and out, and I wonder who he is? He’s been doing all sorts of drugs, but he’s addicted to crystal meth, which seems to be the worst of all of them. And I guess I am here because I just want to know all that I can about all of it. Know your enemies right? So... my two big questions are, what is it doing to him and what can I do to help him? FADE TO BLACK.  TEXT ON SCREEN:   one year earlier FADE IN:",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 211
    },
    {
      "scene_number": 2,
      "slugline": "INT. UPSTAIRS HALLWAY, SHEFF HOUSE - NIGHT  David is walking in the hallway and peeks inside his son NIC’s (18) room. The bed is made, Nic is not there. David turns off the light and closes the door.  INT. BEDROOM, SHEFF HOUSE - NIGHT  David can’t sleep. He looks at the clock, it’s 1 am. Silently he gets out of bed to not wake his wife.  INT. UPSTAIRS HALLWAY, SHEFF HOUSE - NIGHT  Restless, David walks downstairs.  EXT. SHEFF HOUSE - NIGHT  From the surrounding woods, we see a light on the first floor turn on.  INT. DAVID'S STUDY, SHEFF HOUSE - DAY  David is on the phone in his workspace. It’s ringing. HOSPITAL FRONT DESK (O.S.) Marin General Hospital, how may I help you? David’s study is the kind of space you’d love to live a creative life. David is a senior writer for   Rolling Stone ,  Playboy, Wired, Vanity Fair.   On the walls, artwork mixed with family photos - Nic at various ages - mixed with framed magazine covers, including David’s own holy grail, the Playboy-cover featuring John Lennon’s final interview from 1980. DAVID Hi, my son went missing and I wanted to check if he was maybe brought in. Maybe an accident happened or... HOSPITAL FRONT DESK (O.S.) Can I have name and a description, sir? DAVID Nicholas Sheff. S-H-E-F-F. He‘s 18 years old, just over six feet tall. About 130 pounds. (MORE)  2.",
      "characters": [],
      "action_text": "Maybe less, I’m not sure. He has shoulder length brown hair and green eyes. HOSPITAL FRONT DESK (O.S.) Thank you, please hold. DAVID Okay. As he waits it is excruciating. He looks around the room. At the old photos of Nic. It takes forever. HOSPITAL FRONT DESK (O.S.) Mr. Sheff? DAVID Yes. HOSPITAL FRONT DESK (O.S.) There is no one by that name, sir. DAVID Okay. Thank you. David hangs up.  INT. NIC’S BEDROOM, SHEFF HOUSE - NIGHT  David enters Nic’s room. Turns on the light. What is he looking for? He doesn’t really know. A little nervous he goes through some stuff, opens the drawers and checks them. He sits at Nic’s desk and studies his drawings and writing tacked to the wall. On Nic’s desk he sees a couple of books. He takes one, ‘The Beautiful And The Damned’, by Fitzgerald. He takes the book and flips it open at some random places, reads snippets here and there.  EXT. BACK YARD, SHEFF HOUSE - DAY  David is walking around with his phone in the garden. DAVID He...  (a beat)  He’s been gone for two days. DAVID (CONT'D)  3. He is speaking to VICKI, Nic’s mom. They separated a long time ago, and Vicki is always a little uneasy when confronted with David. VICKI (O.S.) What?! What do you mean, he’s gone? What’s going on? DAVID Well, I don’t know. VICKI (O.S.) Two days? Why didn’t you tell me sooner? DAVID I didn’t want to worry you I guess. I just-- VICKI (O.S.) I’m his mother, David.  (a beat)  Didn’t you see this coming? DAVID Uh, no. VICKI (O.S.) What? DAVID  (a little upset)  No. I didn’t see it coming.  (even more)  If I had seen it coming I would have done something. VICKI (O.S.) It was just a question David. You, know I haven’t been talking a lot with him lately. In a split-second this conversation has turned into a fight, as many times before, probably. DAVID Well, maybe that’s why you shouldn’t be giving me advice on parenting, right? Fuck, Vicki. Could we just not blame each other right now? Thanks.  4. VICKI Who’s blaming who here? If I hardly ever see him, it",
      "dialogue_count": 0,
      "word_count": 1021
    },
    {
      "scene_number": 3,
      "slugline": "INT. UPSTAIRS HALLWAY, SHEFF HOUSE - DAY  David approaches Nic’s bedroom door. It’s closed. He opens it.  INT. NIC’S BEDROOM, SHEFF HOUSE - DAY  David sees Nic curled up in his bed. A moment of relief. He watches him, goes nearby, sits down next to him. Nic looks pretty bad. He’s shivering. DAVID Hey. Where have you been? Nic opens his eyes. NIC I just need to sleep. DAVID What have you been doing? NIC I just need to sleep, alright? Leave me alone. David notices Jasper and Daisy standing in the door and watching. They see Nic who looks really wasted. DAVID Guys, could you go downstairs? I’ll be there in a minute. They hesitate a little, want to see what is going on. DAVID (CONT’D) Please. They back off. David looks at Nic again, his eyes are closed again. Nic is calmer now. David looks at him for a moment...  I/E. VOLVO / INVERNESS ROADS - DAY  A tiny Volvo in a wide landscape. The car drives towards us. David is driving. Nic feels sick. David pulls over. We stay close on David. From outside the car we hear the sounds of throwing up.  7.",
      "characters": [],
      "action_text": "Nic reenters the car. David gently rubs his back.  INT. VOLVO / GOLDEN GATE BRIDGE - DAY  David and Nic are driving. Nic watches the road and the clouds. He still feels sick. They cross the Golden Gate bridge.  INT. VOLVO / ENTERING SAN FRANCISCO - DAY  David and Nic enter San Francisco, they drive up a typical steep hill.  I/E. VOLVO / OHLHOFF REHAB - DAY  They arrive at a driveway to the rehab centre. David parks. NIC Dad I’m sorry. I fucked up and it was a mistake but it was a one time mistake. I learned my lesson. I don’t want to go through this shit again. David looks at Nic, feels for him. DAVID Let’s just go inside. NIC No. DAVID They are professionals. Let’s just listen to what they have to say. In a split-second Nic just changes and becomes angry and aggressive. He screams out of frustration. NIC Look I’m 18! You can’t force me. David is taken aback. Nic’s right, he no longer has a legal right to force Nic into rehab. DAVID This got out of hand, right? Don’t you think? Come on. NIC Okay. I’m doing it for you.  8. He looks at David one more time and exits the car.  EXT. OHLHOFF REHAB - DAY  They walk towards the building. SOME GUYS - presumable addicts or ex-addicts - are smoking on the stairs leading to the entrance. Nic looks at them. They look back.  INT. WAITING ROOM, OHLHOFF REHAB - DAY  Nic sits in an austere waiting room.  INT. ADMISSIONS OFFICE, OHLHOFF REHAB - DAY  David is seated with the DIRECTOR of the program, an imposing woman. DIRECTOR He needs treatment and fast. There are still a lot of drugs in his system and worst of all, he is in denial. David is watching Nic through the glass of the door. DAVID Can you help him? DIRECTOR Oh yeah. A lot of the people here are not here by choice and they have just as much a chance as anybody. DAVID OK. Although all of this is alarming, David stays cool. ‘We will fix this’. DIRECTOR We have one free bed, so if you want I can check him in for our 28 day treatment. Then we evaluate. DAVID Um. What is your suc",
      "dialogue_count": 0,
      "word_count": 833
    },
    {
      "scene_number": 4,
      "slugline": "INT. NIC’S BEDROOM, SHEFF HOUSE - DAY (FLASHBACK)  Nic is on the floor writing in his notebook. NIC I read. I draw. David is standing at Nic’s desk. DAVID You know what we should do? We should go surfing. Nic looks up from his notebook and smiles at David. NIC Yeah? DAVID Does that sound good? NIC Yeah, well. I’m into other things now. DAVID Reading misanthropes and seriously depressed writers... NIC Ah, cmon. They’re kinda great though, right? David smiles, he is reminded of his own young years. DAVID I get it. It’ll pass, though. Silence. DAVID (CONT’D) It always does. Nic looks back down at his notebook. NIC What does? DAVID The feeling of being alienated and isolated. Nic chuckles.  11.",
      "characters": [],
      "action_text": "NIC That really helps. Thanks for the advice. David understands Nic wants to be alone. DAVID OK. He exits Nic’s room. NIC Sorry, dad, that was stupid. It came out wrong, I’m sorry. A little smile. He closes the door.  INT. OFFICE, OHLHOFF - DAY  Present time. David and Karen sit with the director. The door opens. VINCE - one of the Ohlhoff counselors - and Nic enter. He looks a little better. DAVID Hey. NIC Hi dad. David and Karen stand up and hug Nic. It’s a little awkward. Vince takes some chairs, they all have a seat. Vince starts talking to break the ice. VINCE So, we feel he’s made great progress. Right Nic? NIC Yes. DAVID That’s great. KAREN That’s great, Nic. David pats Nic on the shoulder and leaves his hand there.  12. VINCE So we should maybe talk about the coming weeks. Nic? NIC Yes. David is surprised: where is this leading to? Nic takes a moment, then turns to David and Karen. NIC (CONT’D) I think I need a little bit more time in rehab. So if it was alright with you guys I was wondering if I could stay in the halfway house here. David and Karen look to Vince. VINCE The halfway house is an open living facility, with follow-up every night. And we would help him find a job. A beat. David is trying to figure out what this means... He looks at Nic. NIC I don’t want to go to college right now, dad. David didn’t see this one coming, doesn’t understand. Takes his time to let it sink in. DAVID Oh. OK. And do what? NIC  (takes his time, soft)  I think I need to be independent. Dad, I’m telling you this is... it’s going to be good. David doesn’t know what to say. A long silence.  INT. VOLVO - DAY  David is angry. He and Karen sit in the front. DAVID What is he gonna do? Make coffees the rest of his life?  13. Outside a strong wind plays with the branches of the trees aligning the street. KAREN Frederic told me they have friends that have a son who did a 4 week program, but it wasn’t enough. He’s doing a year program now. David thinks about it... Knows she’s right,",
      "dialogue_count": 0,
      "word_count": 617
    },
    {
      "scene_number": 5,
      "slugline": "EXT. BACK YARD, SHEFF HOUSE - DAY  In the backyard Karen is body painting Daisy as an Indian. Jasper is running around in red socks and red underpants and already bodypainted as SPIDERMAN.  INT. KITCHEN, SHEFF HOUSE - DAY  David is preparing food. The phone rings, and immediately the dogs start barking very loud. David, a bit annoyed, looks around but cannot find the portable phone, so it keeps on ringing, and the dogs keep on barking. Finally he finds the phone and answers. DAVID David Sheff. One last bark by Moondog. DAVID (CONT’D) Shhht. DIRECTOR (O.S.) Hi Mr. Sheff. This is Annie Goldblum from the Ohlhoff Center. DAVID Oh, yes. Hi, hello. DIRECTOR (O.S.) I’m sorry to disturb you, but I need to inform you about Nic. DAVID OK? DIRECTOR (O.S.) He left the facility today, during some free time, and he has not returned since. DAVID Oh no. DIRECTOR (O.S.) I’m sorry Mr. Sheff. But please don’t despair, this happens. DAVID But, I thought you said he was doing so well?  15.",
      "characters": [],
      "action_text": "DIRECTOR (O.S.) You should think of this as part of the process. Relapse is a part of recovery. DAVID Relapse is part of recovery? DIRECTOR (O.S.) It’s part of Nic’s learning process. DAVID That’s... that’s like saying crashing is part of pilot training. DIRECTOR (O.S.) Look, he’ll be back. Probably really quick. DAVID Is somebody out looking for him? DIRECTOR (O.S.) It’s not our responsibility once he leaves the facility. But he’s welcome to come back. Of course. David hangs up angry. He watches the rest of his family outside for a while, who are still oblivious. CUT TO:  I/E. VOLVO / PARKING AND ALLEYWAYS, SAN RAFAEL - DAY  David is driving through San Rafael. The rain is pouring down. David has opened his window and is looking left and right, then turns and drives up on a parking lot... INTERCUT WITH:  E/I. ROADS NEAR THE OCEAN/ VOLVO - DAY (FLASHBACK)  Younger David is driving with younger Nic. The intro to “Territorial Pissings” by Nirvana is playing: very wild drums, very wild guitar. Nic knows it by heart and shouts along. KURT COBAIN + NIC  When I was an alien... !!!  16. David watches Nic, it’s funny. Nic continues to head-bang and scream along with the song. It’s really wild. David is having fun, Nic too... (although he’s screaming along so wild, it becomes a little scary).  E/I. MIDDLE SCHOOL / VOLVO - DAY (FLASHBACK CONT’D)  The song continues over young people exiting middle school. David is waiting near his Volvo for Nic. Surfboards in the back of the car. David spots Nic. 12-year-old Nic looks like a typical nineties teen: grungy, a Primus T-shirt that is way too big, long hair covering his eyes, some pimples. Nic stands out, because the guys who are walking next to him all seem just a little older, they all have short hair, everybody is dressed the same. BACK TO:  I/E. VOLVO / PARKING AND ALLEYWAYS, SAN RAFAEL - DAY  David pulls up to a KITCHEN HELP smoking outside at the back door of a restaurant under an umbrella. The music softens. DAVID Excuse me",
      "dialogue_count": 0,
      "word_count": 2680
    },
    {
      "scene_number": 6,
      "slugline": "INT. ROLLING STONE MAGAZINE - MEETING ROOM - DAY  David in a meeting room talking and laughing with a couple of editors. NIC (O.S.)  I changed jobs and cities, I hated holidays, babies...  EXT. BACK YARD, SHEFF HOUSE - DAY  Karen painting a tree in their garden in very uplifting colors. NIC (O.S.)  History, newspapers, museums...  INT. TUTORIAL ROOM, EAST HAMPSHIRE COLLEGE  Eyes on Nic as he continues. NIC  Grandmothers, marriage, movies, spiders...  EXT. BACK YARD, SHEFF HOUSE - DAY  The kids and David throwing balloons with paint towards a canvas. With every word of the poem another balloon splash. NIC (O.S.)  Garbagemen, English accents, Spain, France, Italy, walnuts, and the color of range.  Karen joins in on the family fun. BACK TO:  INT. TUTORIAL ROOM, EAST HAMPSHIRE COLLEGE  People are listening, sometimes chuckling. JULIA (18, a sweet girl) thinks Nic is cool. Nic notices, goes on. NIC  Algebra angered me, opera sickened me, Charlie Chaplin was a fake and flowers were for pansies.  29.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 166
    },
    {
      "scene_number": 7,
      "slugline": "EXT. EAST HAMPSHIRE COLLEGE GROUNDS - DAY  Nic and Julia sit on the lawn, they’re talking, Nic is wildly explaining things to Julia. They seem in love and to only have eyes for each other, while masses of people stream by them, going from one class to the next.  INT. LIBRARY, EAST HAMPSHIRE COLLEGE - DAY  Nic sits at a computer. Typing. Focused.  EXT. EAST HAMPSHIRE COLLEGE GROUNDS - DAY  Julia runs her hands through Nic’s hair. They kiss and playfully roll on the lawn.  INT. LIBRARY, EAST HAMPSHIRE COLLEGE - DAY  Nic and Julia sit in the library. As they have to be silent, they write little notes to each other. They giggle.  INT. LIVING ROOM, JULIA’S HOUSE - DUSK  They’re sitting at the table, having dinner. JULIA’S MOTHER and FATHER and 2 younger BROTHERS, an OLDER SISTER and JULIA’S UNCLE. They’re all really nice and the atmosphere is pretty relaxed, yet we get the sense Nic doesn’t fit 100% in this average middle class family, with his wild hair, torn jeans, worn sneakers. Julia’s family is chit-chatting away, going back and forth, LOUDER and LOUDER. Nic is trying to follow the conversation and wants to make a good impression, but it all makes him pretty nervous actually. NIC  (to Julia)  Can I use the bathroom?  (she didn’t catch it)  Hey is there a bathroom I can use? Julia’s mother heard it. JULIA’S MOTHER Of course honey. Come, I’ll show you.  30.",
      "characters": [],
      "action_text": "Nic gets up.  INT. BATHROOM, JULIA’S HOUSE - DUSK  Nic enters a bathroom. He takes a moment for himself, then takes a piss. While he is slowly washing his hands he sees a couple of medication bottles in the bathroom cabinet. He goes through them, sees a bottle of Percocet. He stares at it. He dries his hands. He closes the cabinet.  INT. LIVING ROOM, JULIA’S HOUSE - LATER  Back at the table. It’s after dinner, everybody still chatting quite loud, Nic is more relaxed.  INT. NIC’S DORM ROOM, EAST HAMPSHIRE COLLEGE - DAY  Nic is on his bed on campus, a little passed out. His cell phone rings, it says ‘DAD’. Nic wakes up, and quickly gets up. He takes a moment to gather himself before answering the phone. NIC Hey dad! DAVID (O.S.) Hey Nic. How you doing? What’s going on? NIC Everything is going great. Hey, thanks for sending me that money. I really appreciate that.  INT. LIBRARY, COLLEGE - DAY  Nic sits at a computer and is surfing the web. We see a website that shows how to shoot yourself up. He looks over his shoulder to make sure no one is watching.  INT. NIC’S DORM ROOM, EAST HAMPSHIRE COLLEGE - DAY  Nic is fighting with Julia.  31.",
      "dialogue_count": 0,
      "word_count": 456
    },
    {
      "scene_number": 8,
      "slugline": "INT. NIC’S DORM ROOM, EAST HAMPSHIRE COLLEGE - DAY  Nic is preparing the drugs, making it liquid, getting it in the syringe, prepping his arm. It’s all a bit clumsy as he’s never done this.  EXT. EAST HAMPSHIRE COLLEGE GROUNDS - NIGHT  It’s cold outside, people are wearing warm winter jackets and caps. We spot Nic, zoned out, only wearing a T-shirt. He’s really high. He stops, stands still. Closes his eyes.  INT. LIVING ROOM, SHEFF HOUSE - DAY  Some time later. Nic is arriving back home for the holidays. He is carrying a bag and enters the living room. David is behind him and talking. DAVID And Patrick and Phil are going hiking tomorrow. I told them we might join. They definitely want to see you. They hear gentle shrieks of laughter. Nic looks around the living room, nobody there. David and Nic pretend to keep on talking while looking for the kids who’ve hidden themselves. Nic discovers banners made by the kids to welcome him. One is a hedgehog saying ‘BOOHOO I MISS NIC’. Nic is moved by it and expresses that to David inaudibly. Nic then discovers where the kids are hiding but continues to play it cool. NIC Are Jasper and Daisy here? DAVID They’re not here. NIC No? Oh they didn’t want to see me? DAVID Nope, they didn’t want to see you.  32.",
      "characters": [],
      "action_text": "NIC Oh that’s tough to hear. I’ll just have a seat on this couch and think about that. Nic sits down and then rips off the cover revealing the kids. They now jump on Nic, he takes ’em both in his arms. They kinda crawl all over him. He holds them tight. Karen enters the living room too, and smiles. NIC (CONT’D) You’ve grown so big guys! This is amazing!!! I can hardly hold you. But he does hold them and then starts turning around his axis, like a human merry-go-round. Nic starts going faster and faster as the kids are cheering. David and Karen don’t know whether to laugh, because it’s so funny, or to try and stop them, because it does look a little dangerous. But they’re all laughing so loud. When Nic slows down he almost starts losing balance, he’s a little dizzy. Nic smiles and hugs and kisses Karen.  EXT. BACK YARD - DUSK  The Sheffs are having a nice dinner outside. Enjoying great food. So much to talk about. After dinner they play a wordgame. When someone snaps the other person has to tell the next line of the story. Nic starts. NIC  (storytelling voice)  Denmark, 1632.  Snap . DAVID We like to look back at the history of hula hoops.  Snap . The little ones laughing uncontrollably. NIC So important to the culture of peace and wisdom.  Snap.   More laughter.  33. DAVID A man named George-- A quick   snap . NIC Hoop Hula was--  Snap.  DAVID Thought I’m going to develop something... The family loses it. The kids barely containing their joy.  INT. UPSTAIRS HALLWAY, SHEFF HOUSE - NIGHT  Nic turns out the light in Jaspers bedroom. He closes the door. Alone in the hallway, he scratches his skin. DAVID (O.S.) Hey. NIC Oh hey. Suddenly David is there. NIC (CONT’D) Hey, um, I was wondering if I could use the car? I still want to go to a meeting tonight. DAVID You have a meeting tonight? Yeah, sure. David leans on the banister. He takes a long look at Nic. DAVID (CONT’D) You good? Nic motions towards the kid’s door and laughs to dodge the question. NIC Yeah... They’re cra",
      "dialogue_count": 0,
      "word_count": 1386
    },
    {
      "scene_number": 9,
      "slugline": "INT. NIC’S BEDROOM, SHEFF HOUSE - NIGHT  David sees a notebook laying on the ground. He picks it up and flips through it. We see it’s a journal, with short, and longer very personal writings. Close on David as he starts to read. He flips another page. Scribbles, hard to read what is there. Another page. We read what he reads: 1 1/2 grams speed / Klonopin / Codeine / Valium / Hard to find meth here. Scored some heroin instead. He flips to the next page, which is filled with chaotic small written text. David looks closer at the nervous, crazy handwriting. This is the Disease talking. As if he can experience his son being changed by the drugs. He reads a last sentence:  So all I can do is move forward... and don’t look back.  He closes the notebook. David looks terrified.  INT. VOLVO / GOLDEN GATE BRIDGE - DAY  David drives by himself back to Los Angeles.  INT. MEDICAL OFFICE AT UCLA - DAY  David is seated with DR. BROWN. We have arrived back at the opening scene. DR BROWN So this is for the New York Times Magazine? DAVID No. I’m sorry... I write, I freelance for different magazines but this is a personal matter. DR BROWN (O.S.) A personal matter?  40.",
      "characters": [],
      "action_text": "DAVID Yes. I’m sorry, is that okay? DR BROWN (O.S.) That’s absolutely okay. May I ask what this is regarding? DAVID It’s about my son. DR BROWN Okay... As David begins to talk we INTERCUT WITH:  INT. HAIGHT STREET - DUSK  David on the famous Haight Street in San Francisco, looking for Nic. We see the colorful shops. Kids with dreadlocks and dogs. Tourists with dyed hair. Tattoos. Older hippies. DAVID (O.S.) He has been doing all sorts of drugs but is addicted to crystal meth, which seems to be the worst of all of them. And I guess I am here because I just want to know all that I can about all of it. Dr. Brown is now extremely precise in his use of language. DR BROWN So crystal meth gives the user a feeling of instant euphoria, at least when he takes it. But when it wears off with a depletion of as much as 60 percent of the dopamine the user has to up the doses. David walking on Haight Street. Still looking. DR BROWN (O.S.) (CONT’D) Double it, triple it. Just to feel something. Back at UCLA.  41. DR BROWN (CONT’D) Causing even more nerve damage which increases the compulsion to use. Horrible cycle. CUT TO:  INT. DAVID’S STUDY, SHEFF HOUSE - NIGHT  David sitting in the dark at the computer. Karen walks in. KAREN What’s up? She rests her hands on his shoulders. His eyes stay fixed on the screen. DAVID Just doing some research. BACK TO:  INT. HAIGHT STREET - DUSK  David hesitates then walks up to a girl DIANE (19), she shields her eyes, takes him in. He looks closely at Diane, she’s still really young, but has clearly been damaged by the drug abuse too. DAVID Hey, I... Are you hungry? You want to get something? DIANE Most guys just ask me for a blowjob. DAVID Yeah, well, I just want to offer you something to eat. And talk a little. If you’re up for it.  INT. MEDICAL OFFICE AT UCLA - DAY  Dr. Brown and David are now watching a screen with brain scans. We see a lateral cross-section of a brain, with blue patches and yellow and red areas. The doctor points out the red area",
      "dialogue_count": 0,
      "word_count": 1206
    },
    {
      "scene_number": 10,
      "slugline": "INT. KITCHEN, SHEFF HOUSE - MORNING  Birds are chirping. David looks out the window. He was awake the entire night.  INT. CAFFE TRIESTE - AFTERNOON  David alone at the window seat at Caffe Trieste in San Francisco (landmark coffee shop in North Beach). The empty coffee cup and glass of water suggest he’s been there a while. David looks outside. CUT TO:  INT. CAFFE TRIESTE - AFTERNOON (FLASHBACK)  A younger David and Nic (6 years old) settle in at a table. Nic is asking questions all the time. David lavishes his full attention on Nic. He answers Nic with great dedication. DAVID I’m going to try some Klingon on you. He speaks in Klingon. Nic interprets. NIC Can I have a Coca-Cola? DAVID Exactly! That’s exactly what I asked. NIC Can   I   have a Coca-Cola? DAVID If you ask me in Klingon maybe I’ll get you a Coke. Nic tries but it mostly sounds like gibberish. It’s cute. BACK TO:  INT. CAFFE TRIESTE - AFTERNOON  At length Nic appears, chalk-white, like a ghostly Egon Schiele self-portrait, debauched, wasted. They hug. Nic sits. His fingers tremble, his jaw gyrates, he grinds his teeth.  46.",
      "characters": [],
      "action_text": "David looks at Nic. Nic can’t look David in the eyes so he looks anywhere else. NIC This place hasn’t changed at all. David gets right to it. DAVID So how ya doing? NIC I’m doing great. OK. I’m just doing what needs to be done. A pause. David doesn’t believe it’s true, it just can’t be. DAVID What does that mean? NIC Being responsible for myself. I’ve quit on my own. I’ve got five days now. (pause)  I feel like I’m doing well but I just need a few hundred bucks though. It breaks David’s heart. Ok, so that’s why he called. But David swallows his pride, needs to find a way to get through to Nic. He stares at Nic, who can’t seem to look in David’s eyes. Nic now stares outside. David fiddles with his cutlery. DAVID Nic, I can’t give you any money. NIC It’s just a few hundred bucks. I just need to get some shit together. I want to go to New York. DAVID New York? NIC I need to get out of San Francisco, too many bad vibes here.  (beat)  I just need a few hundred bucks. DAVID Why don’t we just have lunch. And talk. We can do that, can’t we?  47. This makes Nic a little mad and fidgety. He calms down. He switches between being the old sweet Nic, and this unreasonable junkie. NIC How are Karen... and the kids? DAVID OK. They ask about you.  (pause)  Next week is their step-up ceremony. I’m sure they‘d love you to be there. I’d love you to be there... NIC See, you’re guilt-tripping me... Look, dad, I already feel horrible about myself. DAVID I know they wanted you to be there. That’s all. NIC I’m sorry, dad, I just need some fucking money alright. So please... DAVID And then what? Where does this end? NIC I don’t know. It's kinda working out for me right now. You know, I gotta see this through. I got five days sober... DAVID It doesn’t look like it’s working. NIC Oh it doesn’t look like it’s working out? So what then? Therapy? DAVID You can come home. We’ll make it work. Please Nic. Please. NIC That wouldn’t... No. DAVID I’ve been doing some research.  48. NIC Been doing fucki",
      "dialogue_count": 0,
      "word_count": 1109
    },
    {
      "scene_number": 11,
      "slugline": "INT. LIVING ROOM, SHEFF HOUSE - DAY  David sits on the couch, stares blankly in front of him. KAREN (O.S.) Dave, we’re coming out. Close your eyes! DAVID OK! He closes his eyes. We hear some noises, Karen and the kids are entering the living room. KAREN OK! You can open them! He opens his eyes and sees his kids, all dressed up. Jasper in white oxford, Daisy in a cute little dress. DAVID Oh wow... Amazing guys! He smiles, while the kids make funny poses.  INT. AUDITORIUM, ELEMENTARY SCHOOL - DAY  We’re mid-ceremony of the “step-up” ceremony, a long-standing tradition at Jasper and Daisy’s elementary school. All the CHILDREN are dressed up and standing in front of their chairs. The kids are singing and depicting the lyrics to “Catch a Falling Star” with simple movements. It’s beautiful. David stares straight ahead. He’s emotional - struggling not to break down.  INT. DAVID AND KAREN’S BEDROOM - NIGHT  The phone rings, louder and louder. It’s deep in the night. David slowly rolls over, awake, confused. He looks at the phone on the bedside table - ringing, glowing - like it’s the most evil thing in the world. He knows what this call is, of course. He answers. DAVID Hello.  52.",
      "characters": [],
      "action_text": "VOICE ON PHONE (O.S.) This is Julie Ford. I’m the admissions nurse at Bellevue Hospital, New York. Is Nic Sheff your son?  E/I. DRIVEWAY / LIVING ROOM, SHEFF HOUSE - DAY  David drives off in a hurry. Karen - from the living room - watches him drive away.  INT. DEPARTURES, SF AIRPORT - NIGHT  David sits at the gate with his arms crossed. Still staring straight ahead. There’s hardly anyone there at this time.  INT. PLANE BEFORE TAKEOFF - SOON AFTER  David is in his seat, the plane almost fully boarded. He is on the phone. BELLEVUE DOCTOR (O.S.) Mr. Sheff, sorry we missed each other earlier. So Nic is still experiencing some respiratory depression but his vital signs are returning. A flight attendant comes to reprimand David, as the doors are closed. FLIGHT ATTENDANT Sir? Sir! We are ready for departure. DAVID OK. Okay...  (to the Doctor)  May I talk to him? BELLEVUE DOCTOR (O.S.) No I’m sorry but that won’t be possible. He’s sleeping right now and we shouldn’t wake him up. Try again in a few hours. FLIGHT ATTENDANT Sir I need you to turn off your phone. David holds his hand up...  53. DAVID Okay. FLIGHT ATTENDANT Sir! DAVID  (to the Doctor)  Would you please let him know that I’m on my way.  INT. NY ST. AUGUSTUS HOSPITAL, NEW YORK -   HOURS LATER (DAY)  Nervous David walks to a NURSE at a busy nurses’ station. NURSE I’m sorry sir. He checked out. Against doctors orders. DAVID What? No. No! He OD’ed. NURSE I’m sorry sir. He pulled out the IV and catheter and left. DAVID How long ago? NURSE Ten, fifteen minutes. I’m sorry sir. Damn. David sighs. What now?  INT. JFK - DUSK  David is waiting at a nearly empty gate. Again. His phone rings. He answers. DAVID Yes...? All we hear on the other end is a quivering voice.  INT. DONUT SHOP - NIGHT  David enters a rundown donut shop. He sees Nic sitting at a table inside, almost falling asleep, unaware of David. He looks the worst we’ve ever seen him. David watches him for a moment, then takes a seat opposite Nic, who opens his eye",
      "dialogue_count": 0,
      "word_count": 1573
    },
    {
      "scene_number": 12,
      "slugline": "EXT. ROADS, TOPANGA CANYON - DAY  Nic appears in the distance, riding his 10-speed through Topanga Canyon. Although he is drenched in sweat and grunting he looks pretty great actually. MUSIC is BIG now. Changing gears, up a hill, down a hill. We now see he is chasing SPENCER (40’s), his sponsor. He’s pushing it 200%. As they arrive at a steep hill, Nic, younger and lighter, overtakes Spencer. NIC Come on old man! SPENCER  (playful)  You are being so disrespectful! Spencer catches up to him. SPENCER (CONT’D) I’m coming for ya! You about to look at my ass! NIC Motherfucker! CLOSE on Nic who’s in pain but does not give up. PRIMAL AGONY, pedalling HARD: NIC (CONT’D) Aaaaaarrrrgggghhhhhhhhh!! Nic reaches the top. In the background Spencer falls over in defeat. Nic wins. They stop, laugh at each other. Nic rides back to Spencer and helps him up. SPENCER So that’s what I get for helping you out? Thanks man. NIC Sorry old man. I’m ruthless! Puffing. They enjoy the view.  60.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 173
    },
    {
      "scene_number": 13,
      "slugline": "EXT. GARDEN NIC’S STUDIO - DAY  Vicki and Nic are carrying Nic’s stuff towards his studio, which is located above a garage in the back of a garden of a large house.  INT. STUDIO NIC - DAY  They enter the studio. Drop the stuff. Nic looks at his new place. It’s not huge, but his own. Nic opens a window and looks outside. When done, Nic sits down and watches his shelf with all his stuff. Vicki watches him. VICKI How does this feel? He smiles. NIC Like I’m a real human being.  INT. CHURCH - DAY  A 12-step meeting. Quite a lot of people. Lots of young and hip people in LA. Nic looks good. He takes in the space and speaks to the group. NIC One day I tried methamphetamine and I thought, this is what’s been missing. I felt complete. And I’ve been chasing that high ever since. No matter how much meth or whatever else I can find to shoot up into my body, I knew it’s never enough. I went to a couple of rehabs, a detox, we would talk about disease. Sure. But it never clicked. Until one day I woke up in a hospital and someone asked me, what’s your problem? I said I’m an alcoholic and an addict and he said no that’s how you’ve been treating your problem. People nod ‘that’s right’. We see Vicki and Spencer seated together in the back. Vicki watching. Spencer nodding.  61.",
      "characters": [],
      "action_text": "NIC (CONT’D) I know now I need to find a way to fill this big black hole in me. Anyway. I’m 14 months clean. I have a job at a rehab, and it’s fulfilling to help other people get sober. I have a sponsor, Spencer, he shows me how great my life can be sober. I still have a family. My mom has been amazing. My dad has been amazing too... I want them to be proud of me.  I/E. MAZDA / VARIOUS LOCATIONS - DAY  Nic is driving a $500 Mazda on Inverness roads. “Heart of Gold” by Neil Young plays. He opens the window and hangs his arm outside. Enjoys this so so much.  INT. ROOM, HOUSE KAREN’S PARENTS - DAY (FLASHBACK)  A younger David is getting dressed, suit and bowtie. Nic, 8 years old here, sits on the bed, he is wearing a shirt that is slightly too big, blue trousers and All Stars. Nic is dangling his legs up and down. DAVID You alright? What’s wrong? Are you nervous. NIC Yeah.  EXT. TERRACE, HOUSE KAREN’S PARENTS - DUSK (FLASHBACK CONT’D)  David, Karen and Nic stand on a terrace, where they have gathered with some friends and family for a cosy wedding. The terrace has a great view of hills and trees. It’s a beautiful day. Karen wears a simple white dress. KAREN  (to David)  Thank you for marrying me. Thank you for being a perfect partner in an imperfect world. Thank you for introducing me to your amazing son. I’m here for you and I’m here to stay.  62. People cheer. DAVID  (to Karen)  Karen, thank you for loving me. David looks at Nic. DAVID (CONT’D) And thank you for loving him. They kiss. Karen gestures Nic to come in between them. Nic holds hands with both of them. He smiles, although still nervous. They kiss again. Cheering! CUT TO: Drinks afterwards. It’s joyful and informal. A couple of musicians are playing music on their acoustic instruments. Talking, laughing. David is talking to a friend about Nic who stands a few feet away dancing to the music. The friend laughs. David and Karen look over at Nic. Still dancing.  EXT. DRIVEWAY, SHEFF HOUSE - DAY  Back to the pres",
      "dialogue_count": 0,
      "word_count": 3724
    },
    {
      "scene_number": 14,
      "slugline": "INT. ROLLING STONE MAGAZINE - MEETING ROOM - DAY  David in a meeting room with a couple of editors. David is trying his best to not constantly check his phone.  EXT. PATHWAY LEADING TO INVERNESS AQUATICS CENTER - DAY  David, Karen, Daisy and Jasper just parked the car and walk to the entrance of the swimming pool. A lot of kids and parents are arriving and entering. Both Daisy and Jasper have a bag with their bathing suits. JASPER I thought Nic was gonna be here today. DAVID Something came up. JASPER Can I call him? DAVID That’s not going to be possible. JASPER Why not? DAVID Because it’s not. Silence. Jasper hesitates. JASPER Is Nic back on drugs again? Wow. Karen looks at David. They both don’t know what to say. A long silence. Karen is honest. KAREN We don’t know, honey. Jasper nods. He walks off, takes Daisy along.  INT. KITCHEN, SHEFF HOUSE - DAY  The phone rings throughout the house. No answer. It clicks through to an answer machine.  80.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 174
    },
    {
      "scene_number": 15,
      "slugline": "EXT. DRIVEWAY, SHEFF HOUSE - DAY  Nic and Lauren arrive at the front door, Nic lifts a pot plant, nothing there. He tries another pot, again nothing. It makes him angry. He throws the pot to the floor. He kicks the solid door, nothing happens.  EXT. BACK YARD - DAY  Nic goes around the back. He creeps along different doors and windows, and checks if one of them is open. He starts banging and pounding on a back door, until it breaks open and he slams to the ground. He bounces right back up. If he weren’t high, his limbs would hurt after this.  INT. SHEFF HOUSE - DAY  We follow Nic who walks through the house and gathers stuff he can take along. In a storage he takes a jacket, a Nintendo console, some bottles of wine. An old laptop. From the kitchen a bottle of Vodka. He dumps some stuff into a woven laundry basket. Meanwhile Lauren is looking at art books, etc.  INT. DAVID'S STUDY, SHEFF HOUSE - DAY  Nic enters David’s study. He opens drawers of his desk, looking for stuff he can take. He’s progressively angrier and angrier. On David’s desk Nic sees print-outs of stuff David is writing. He looks at it, his own name appears quite a few times. He reads the top line:   Nic didn’t come home last night.  Then the last:   Have you seen my son? Have you seen my beautiful boy? Tell him I miss him.  INT. INVERNESS AQUATICS CENTER - DAY  The competition is on. BOYS and GIRLS of all ages in their bathing suits. Different TEAMS, amongst them Jasper’s team ‘Angry Tuna’. Jasper is just about to get on a starting block, while David and Karen stand to the side of the pool. Karen waves, but Jasper doesn’t see her.  81.",
      "characters": [],
      "action_text": "Behind Jasper we notice a large banner from the local swim team that says: ‘Nothing in life is so complicated that it cannot be achieved by discipline and hard work’. And GOOOOOOOO! Jasper dives into the water, and swims as fast as he can. Karen is watching and cheering. David looks pretty stressed out. A little later, David walks out checking his phone. Karen sees him walking out. She’s angry. She focuses on Jasper again.  INT. LIVING ROOM, SHEFF HOUSE - DAY  Nic is watching the basket and the stuff he wanted to take with him . . . What a stupid idea. At that moment we hear a car pull up in the driveway. He rushes to a window. It’s the family arriving. Nic, instant panic mode. NIC Oh fuck.  (loud whisper)  Hey Lauren. LAUREN What’s going on? NIC Let’s go. We gotta go. They rush out of the back.  EXT. DRIVEWAY, SHEFF HOUSE - DAY  In the driveway David, Karen, and the kids all get out of the car. Jasper is wearing a medal around his neck. The back of the car is filled with bags of groceries. David and Karen pick them up and carry them. KAREN Honeys, can you help us out here? They all take something - David the bulk. They walk to the front door, Karen opens it. They enter.  INT. LIVING ROOM AND KITCHEN, SHEFF HOUSE - DAY  They pass the living room.  82. Dump the groceries in the kitchen. Karen starts unpacking. Jasper takes a banana and starts eating it, just hanging a little in the kitchen. Daisy goes up the stairs to her room. David heads back outside.  EXT. DRIVEWAY, SHEFF HOUSE - DAY  As David enters the house again with the last groceries, he notices the broken plant pot at the entrance.  INT. LIVING ROOM AND KITCHEN, SHEFF HOUSE - DAY  David enters again with the last groceries. JASPER I think I just saw Nic... KAREN What hon? JASPER I think I just saw Nic and a girl. Running away. Dumbstruck for a moment... David rushes outside.  EXT. DRIVEWAY, SHEFF HOUSE / AND STREETS SURROUNDING- DAY  David runs onto the street, sees Nic and Lauren, but they’re pretty far aw",
      "dialogue_count": 0,
      "word_count": 1069
    },
    {
      "scene_number": 16,
      "slugline": "EXT. DRIVEWAY, SHEFF HOUSE - DAY  David walks up to the driveway. Daisy is crying. Jasper is consoling her. DAVID I’m sorry guys. David looks at them... doesn’t know what to do anymore. He comes closer to his kids. Sits on the ground near them. DAVID (CONT’D) I’m so sorry.  EXT. PORTRERO HILL, SF - NIGHT  Nic is taking a walk and smoking a cigarette by himself. He drops the butt and walks over to his Mazda on a quiet street on a hill. In the distance we see the city of San Francisco.  INT. MAZDA - NIGHT  Nic steps into his Mazda. As the light turns on, we see Lauren is lying in the passenger seat, passed out. Nic watches her a little closer, is she OK? He shakes her. NIC Lauren? She actually looks a little blue. NIC (CONT’D) Lauren?! He checks a pulse. None. He slaps her face. NIC (CONT’D) Lauren! He panics, searches her phone, finds it, dials 911. Meanwhile tilts the backseat, and starts to do some CPR. Mouth to mouth. Chest compressions. NIC (CONT’D)  (in phone)  Hello. Yeah, I’m with a friend. She just OD’d. I need an ambulance. We need some help!  86.",
      "characters": [],
      "action_text": "911 VOICE (O.S.) Sir, do you know CPR? NIC I’m doing it. Please come quick. You have to send an ambulance. 911 VOICE (O.S.) What is your location? NIC I don’t know. Trace the call. Nic drops the phone, keeps on doing chest compressions. All of a sudden: Lauren gasps, and jerks awake. She blinks twice and bursts into tears. Nic is relieved. He holds her.  EXT. PORTRERO HILL, SF - NIGHT  An ambulance has now arrived and routine examinations have been done. EMT We need to take you to the ER. LAUREN I don’t want to. I’m fine. EMT  (firm)  We need to take you to the ER. NIC Can’t you hear what she’s saying? She doesn’t want to go. EMT Otherwise I need to inform the police. Up to you. NIC Godammit. Nic and Lauren look at each other. They don’t want police. LAUREN You’re going to come meet me right? You promise?  87. NIC Yes. Nic nods. Lauren is crying. LAUREN I love you. Come get me, Nic. NIC I love you too. LAUREN Please come get me. You promise? Nic gets angry. NIC Yes I said I will! What do you fucking want from me? Nic can’t look Lauren in the eyes. This is the end, but Lauren is too fucked up to see that. CUT TO: The ambulance drives off. Nic feels miserable. Worn out, fucked up, done. Nic still has Lauren’s phone. He dials a number. It’s ringing. DAVID (O.S.) David Sheff... NIC Hey dad. It’s me. DAVID (O.S.) Nic. Nic is crying. Standing in the middle of the street. NIC Please don’t hate me, dad. I know what I did wrong. I... Listen, I want to stop. But please, please, please no rehab. Let me come home. I realized I actually need to be home. You guys will give me the strength to stop. Alright? A beat. DAVID (O.S.) That’s not going to happen.  88. INTERCUT WITH INT. LIVING ROOM, SHEFF HOUSE - NIGHT  David is seated on the edge of the couch. This breaks David’s heart. DAVID I wish I could help, but I can't do that. I can’t. NIC Please help me dad. I just need a little bit of help.  (crying, pleading)  Please help me. I want to come home. DAVID All I can tell you is wha",
      "dialogue_count": 0,
      "word_count": 1352
    },
    {
      "scene_number": 17,
      "slugline": "INT. AL-ANON MEETING, CHURCH BASEMENT - NIGHT  Rose continues. ROSE You mourn for the living. That’s a hard way to live. So in a way, it’s better, I guess. She was a dear, dear young woman. I always felt I needed to stay strong. There’d be some future event, and I’d need all my strength for it. But there are no events after this one. I hope she’s not in pain now. Oh, my Frances. And now Rose weeps, and weeps. It’s a full-fledged weeping, the kind you don’t often see, even in meetings. But the room just lets it happen. Lets it flow. Lets her be. David takes Karen’s hand. Karen let’s it happen. She’s cried, she doesn’t look at David.  INT. CAFFE TRIESTE  Nic’s injecting himself in the bathroom. As it comes on it’s not slow motion, but it might as well be. Nic, jaws slack, eyes closed, unfurls backwards in his own SLOW-MO. In a beautiful, haunted arc of ballet he fully reclines, until his head slowly touches the ground as if it’s a feather-down mattress. PEACE descends. His lips are turning blue.  INT. CAR / WINDING ROADS INVERNESS - DAWN  David is driving the winding roads. As he drives through the woods it’s pretty dark outside. Focusing on the road, he looks blank-faced. Frozen. Conflicted. As he takes a turn, and exits the woods, he arrives in an open valley, where the sun manages to shine its first rays of light. He watches the gentle hills of Marin.  INT. HALLWAY, RECOVERY HOUSE - DAY  David walks into a white hallway.  93.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 266
    },
    {
      "scene_number": 18,
      "slugline": "INT. WAITING ROOM, RECOVERY HOUSE - DAY  David sees Vicki sitting in a chair. DAVID Hey. VICKI Hi. They hug. Holding on for an extra beat before letting go. DAVID How is he doing? VICKI The doctor is with him right now. She chuckles. VICKI (CONT’D) He said it’s close to a miracle that Nic survived, with all the drugs in his body. David breathes deep in, and out again. Looks at Vicki. Takes her hand and holds it for a moment.  INT. CORRIDOR, RECOVERY HOUSE - DAY  David supports Nic under one arm as they trundle along a corridor. Nic holding onto David with one arm. From behind, it looks like the way a younger man would support his frail, doddering father. But it’s the opposite.  EXT. COURTYARD - DAY  David and Nic sit on plastic chairs in a nondescript empty inner courtyard with a view onto the back of a blank wall that’s evidently not been painted in twenty years. Side-by-side, looking at the small pebbled courtyard with its sickly potted palms. They look at each other. Nic tries to smile. But starts crying. A little later David too. David hugs Nic. FADE TO BLACK.  94.",
      "characters": [],
      "action_text": "CARDS: Drug overdoses are now the leading cause of death for Americans under 50. Through an incredible amount of support and hard work, Nic has been sober for 8 years - one day at a time. While addiction treatment is massively under-funded and under- regulated, there are those working tirelessly in all communities to combat this epidemic. The help is out there - for those struggling with the disease, their loved ones, and for those who grieve. ROLL CREDITS.  95.",
      "dialogue_count": 0,
      "word_count": 279
    }
  ]
}