{
  "slug": "beau-is-afraid-2023",
  "title": "beau is afraid",
  "genre": "drama",
  "format": "film",
  "scenes_count": 9,
  "characters_count": 0,
  "characters": [],
  "total_words": 27548,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. WAITING ROOM - DAY  BEAU (40), an extremely anxious but pleasant-looking black man, sits in a THERAPIST’S WAITING ROOM. He wears a loose, slightly weathered suit. His eyes, posture and manner are possessed of a striking, childlike innocence. One might even describe him as “touched by the angels.” He glances up at... The Therapist’s DOOR. A sign reads “In Session. Please Wait Quietly.” Above the door: a surveillance camera, aimed at Beau. Beau looks down at the magazine in his hand. It’s called   Dental Confessions   (its cover photo: a screaming mouth receiving a root canal). The sterile ambiance is disrupted by the sound of muffled CRYING from the adjacent room. A woman’s crying. She is passionately recounting something. Concerned, Beau looks at the DOOR. As Beau LISTENS, the sounds of the waiting room - the tabletop fountain, air conditioning, etc - DESCEND, muting themselves to favor the vague cries behind the door. Beau snaps himself out of it. He reaches down to switch magazines. He grabs one called   Who SAYS You Can’t? , but then looks for another. He considers   Facing Adulthood , but then settles on “ Safe” Things That Can Kill You . There’s a harsh THUMPING sound from the other room. The Therapist is heard trying to calm down the now-hysterical patient. Unnerved, Beau tries to ZONE IN on his magazine. BEAU’S EYES. Determined to focus on the magazine’s text. They crawl across the page, “reading,” but as they reach the end of the page, they continue to crawl, drifting away from the magazine. They alight, once again, on the Therapist’s door... The sounds from the other room have become more upsetting. Beau, very tense, has obliviously started chewing at his fingernails. His other hand has TIGHTENED around the magazine. The distressing commotion has swollen to an almost fevered pitch, and then... The DOOR OPENS and the THERAPIST (40s), handsome and charismatic, emerges - with a perfectly happy FEMALE PATIENT. THERAPIST Next Monday, then? FEMALE PATIENT Perfect. THERAPIST Great! He puts his hand out for a HIGH FIVE. She enthusiastically indulges. THERAPIST (CONT’D) Come on in, Beau.  Beau, confused, stands up and follows him in.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 360
    },
    {
      "scene_number": 2,
      "slugline": "INT. THERAPIST’S OFFICE - DAY  The Therapist gestures to the COUCH. Beau sits down, and the Therapist plants himself on the chair opposite. The opening silence is heavy. Beau is painfully aware that it’s his responsibility to start the session. The Therapist waits with a patient smile. BEAU I guess this week has been pretty steady. THERAPIST Has it? BEAU More or less. The therapist makes a “hmm” face. BEAU (CONT’D) I drank some mouth wash Friday night. THERAPIST Oh? BEAU By accident. The Therapist pleasantly waits for more. BEAU (CONT’D) I’m visiting my mother tomorrow. THERAPIST I know you are. (pause) For your father’s anniversary, right? BEAU (quietly) His death, yeah. THERAPIST How you feeling about that? BEAU (shrugs) I never met him. THERAPIST I meant about seeing your mother. BEAU ...Nervous. THERAPIST I’ll bet. Any other feelings? BEAU ...I dunno...  2.",
      "characters": [],
      "action_text": "Beau waits for the Therapist to stop waiting. He doesn’t. BEAU (CONT’D) Scared. THERAPIST Mm-hmm. Of what? BEAU Just, all of it. You know. THERAPIST (nodding) But right now, when you say “scared,” what are you thinking? Can you predict something? Beau thinks about it. Tenses. Begins to tear up. BEAU No. THERAPIST (too sensitive) Yeah. BEAU It’s good that I’m going. It’s been a long time. THERAPIST Has it? BEAU A few months. THERAPIST (considers) One month. BEAU Well - five and a half weeks. THERAPIST Has she made you feel guilty about that? BEAU No. I just   am   guilty. The Therapist nods, taking neutral note of this. THERAPIST And when you’re out there - are you going with any sense of... protecting yourself? BEAU How do you mean? THERAPIST I’m just thinking about the last time you saw your mother.  3. Beau doesn’t react. THERAPIST (CONT’D) And every time before that. Beau nods. THERAPIST (CONT’D) But last time especially. Do you remember what that was like? BEAU Of course. THERAPIST It was as bad as I’ve ever seen you. Beau looks embarrassed. THERAPIST (CONT’D) (reminding him) That’s a new couch you’re sitting on. BEAU Oh God, I’m sorry. You never sent me the bill. THERAPIST Don’t be silly. Beau stifles more tears. THERAPIST (CONT’D) (re: the tears) Where’s all that coming from? BEAU I dunno. THERAPIST (too sensitive) Yeah. Beau continues holding back the tears. His face is red with tension as he fights the oncoming deluge. THERAPIST (CONT’D) I just wanna make sure you’re not going there unprepared. BEAU I’m trying to be prepared. THERAPIST How? Beau looks cornered. THERAPIST (CONT’D) I’m not trying to challenge you. I’m just curious how you   would   prepare. What are the limits you’d be setting?  4. BEAU Just...thinking about the thought- stopping stuff we talked about. And refusing to engage in arguments I don’t wanna have. THERAPIST (reminding) And refusing to be   abused . BEAU Right. THERAPIST Even if she   is   your mother. Beau nods. THERAPIST (CONT’D)  E",
      "dialogue_count": 0,
      "word_count": 12104
    },
    {
      "scene_number": 3,
      "slugline": "INT. BUILDING - DAY  Grace walks Beau through the LOBBY again. They pass Jeeves, who sits heavy behind his desk. GRACE Hi Jeeves! Without moving his head, JEEVES’ EYES follow Beau and Grace to the elevator.  INT. JUDY’S OFFICE - DAY  Beau sits on the couch, eyes closed. Judy talks him through an exercise. JUDY Now relax your body. Feel your feet against the floor. Feel your toes. The balls of your feet. Your arch. Is there energy coming up from the floor? Or maybe it’s coming   from   your feet, going out. Do you feel your blood pulsing?... Now, move on to your ankles... and then your calves... and then your knees... and your thighs... your butt against the seat. And really try to   feel   the sensation. Can you do that? BEAU I think so. JUDY Are any parts tenser than others? BEAU Maybe my neck and shoulders. JUDY Okay. BEAU And my back. And my teeth. JUDY And how would you describe that tension? BEAU ...Tight. JUDY Using metaphors can sometimes be useful, too. Like “my heart feels broken”... BEAU Well...I guess my tense parts feel like... Beau makes a CLAW of contorted fingers with his hand.  54.",
      "characters": [],
      "action_text": "JUDY Like that? BEAU Yeah. JUDY And how often? BEAU All the time probably. I only notice it, though, when you tell me to relax. ‘Cause I try to relax and then I don’t know how. JUDY That’s very common among people with trauma. Not to mention your upbringing. You said your mom was a very negative woman. BEAU Not negative-negative. Just - if something was wrong, she’d focus on  that   and it’d be the only thing that existed, and if something was good, it was probably not gonna last, so we didn’t talk about it, ‘cause we’d only be setting us up for more disappointment. JUDY Yeah, so okay, there you go - that’s something you inherited. And it’s become a Philosophy, meaning it’s deeply   imbedded . So it’s gonna take a lot of committed work to install a   new   perspective. BEAU But horrible things   do   happen. I’m not just afraid of made-up, imaginary stuff. JUDY But wonderful things happen, too! Have you noticed what a beautiful day it is outside? Or the sunset last night:   Gorgeous . The sunrise this morning - even better! Beau doesn’t look convinced. JUDY (CONT’D) Look: you have a long history of trauma and learned negative   thinking , and right now you keep getting caught in that trauma vortex we talked about - because you’ve been exposed to so much junk. But   this   work is about strengthening the   healing   vortex. ‘Cause that’s been very neglected. Beau does his best to remain optimistic. Almost off-handedly:  55. BEAU She also put ipecac syrup in my food a couple times when I was twelve. JUDY Your mother? Why would she do that? BEAU I was supposed to go to summer camp and she needed me to stay. JUDY How do you know it was ipecac? BEAU Because I spied on her when she was sneaking it, and then I looked it up after I got sick for a bunch of weeks. Judy’s eyes are wide with quiet alarm. JUDY ...Let’s go back to feeling our feet on the floor.  INT. CAR (MOVING) - EVENING  Grace drives happily as Beau sits passenger. Beau turns to her. He tries to find the words",
      "dialogue_count": 0,
      "word_count": 2259
    },
    {
      "scene_number": 4,
      "slugline": "EXT. FOREST - EVENING  Beau sits up in the heart of the woods. He’s been unconscious for a day and the sun is already setting. Still dazed, Beau sees a sparkling POND nearby. Dehydrated, he stumbles over to it and gulps down some water. When he looks back into the pond, he notices: it’s FILTHY, and the surface of the water is actually littered with dead, floating fish. Beau REACTS by trying to cough up the water he just drank. He jams his finger down his throat and tries to throw up, but then he hears a TWIG SNAPPING in the distance. He LOOKS OVER to see... A frightened-looking MAN wearing camouflage (30s) stands behind a collection of bushes. He holds a rifle. This is MICHAEL. Beau and Michael engage in a sustained, confused STARE DOWN. Slowly, Michael brings a WALKIE-TALKIE to his lips. MICHAEL (whispering) I think he just woke up. THE WALKIE BLARES THROUGH STATIC: WALKIE (V.O.) Get him talking. Michael calls out to Beau. MICHAEL You okay over there?! BEAU (confused) Yeah, I just got lost. MICHAEL How’d you get out here? BEAU I was being chased. MICHAEL By who? BEAU I think I’m okay now. WALKIE (V.O.) (through static) Is he talking? MICHAEL (into walkie) Sorta. WALKIE (V.O.) Ask him what he’s looking for. MICHAEL (to Beau) Are you looking for something?  65.",
      "characters": [],
      "action_text": "BEAU I think I just need to get to my mom’s house. MICHAEL (weirdly loaded) Oh, you got a mom? This question hits Beau where it hurts. BEAU I did. MICHAEL She left? Beau’s silence tells Michael what he needs to know. Michael nods. MICHAEL (CONT’D) My mom’s dead, too. From a car accident. Head-on collision. BEAU I’m sorry. MICHAEL What about your dad? Beau’s lack of an answer is telling. WALKIE (V.O.) (static) What’s he saying? Michael lifts the walkie to his lips, but then PAUSES. He lowers the walkie. MICHAEL (to Beau) You hungry?  EXT. FOREST - NIGHT  Michael leads Beau towards a clearing in the woods where a GIANT TENT has been pitched. As they pass the tent, Beau sees what lies ahead... An impressive, hand-made TREEHOUSE COLONY. A banner on a flagpole reads “Orphans of the Forest.” Several “uniformed” men and women are huddled around a contained FIRE. The uniforms are kakhi-colored jumpsuits. A NAKED MAN (save for a loin cloth) walks by, carrying as many logs as his arms can hold. He’s handsome, in his 30s, and exudes an almost frightening confidence. He SEES Beau and Michael, and immediately RELEASES the logs (which spill at his feet). The Naked Man runs over to Beau and Michael. He has perfect posture. NAKED MAN Hello! The Naked Man offers his hand. Beau reaches out to shake it, but--  66. NAKED MAN (CONT’D) Ha! I’m just kidding! The Naked Man grabs Beau by the shoulders and pulls him in for a BIG HUG. NAKED MAN (CONT’D) Michael tells me your name is Beau. BEAU I -- Yeah. NAKED MAN Hi Beau! Welcome to our little community. I’m Brennan! BEAU Hi. The Naked Man (who we now know as BRENNAN) changes his tone to one of sorrowful empathy. BRENNAN I hear you’ve suffered a very recent loss. BEAU Yes. BRENNAN I’m so sorry, Beau. Lots of people will   tell   you they understand, but here you’ll find that’s very much a sincere and heartfelt truth. How much has Michael told you about us? BEAU Nothing. He said that you’d “explain everything.” BRENNAN Good. (to Michael) Than",
      "dialogue_count": 0,
      "word_count": 2628
    },
    {
      "scene_number": 5,
      "slugline": "EXT. DINING SPACE - NIGHT  Everyone sits around the picnic table, eating dinner. That same awkward silence pervades the meal. Beau sits uncomfortably between two especially shaken Orphans. Beau’s eyes are busy. The words “You need to get home” echo through his head. He stares anxiously at an OPENING in the woods. A clear escape. Brennan appears from the main trail. He holds a STACK OF MAIL. BRENNAN All right, everybody. Snap out of it. Brennan begins to sift through the mail, distributing it among the Orphans. As he does so: BRENNAN (CONT’D) On my trek to fetch the mail, I was visited by Yesekov’s spirit. He was opaque and still somewhat vague, given my limited consciousness, but he apologized for the scene he made earlier. He said he was frightened for a moment, but he assured me that everything is wonderful on the other side. He also said he will   not  reappear - not even to me - but he stressed that we must keep strong and continue our work. Today was one of many trials, but he’s so proud of us for holding to our convictions. The group looks relieved by this news. Brennan comes to an ENVELOPE WHICH APPEARS TO HAVE BEEN TORN OPEN. BRENNAN (CONT’D) Oh, and Charles. This was actually torn open when I found it. He hands the letter to CHARLES (28), a feeble-looking Orphan. Charles nervously accepts the letter. BRENNAN (CONT’D) I looked inside to make sure nothing was missing, but then I noticed in my periphery...the name signed at the bottom. Charles’ face goes white. BRENNAN (CONT’D) Who’s “Dad”? A HUSH falls over the table. Everyone is frozen. Charles is at a terrified loss. CHARLES It’s my step-dad.  76.",
      "characters": [],
      "action_text": "BRENNAN Oh... ‘Cause I thought your mother “never even looked at another man after your father died.” CHARLES I don’t think I ever said that. BRENNAN I’m pretty sure you might have. CHARLES You must be thinking of something else. I never would have said that. I love my step-dad. Brennan stares at him. He smiles warmly, but his eyes are stone. BRENNAN That’s my mistake, then. I must’ve gotten confused. Sorry. CHARLES ...It’s okay. I might’ve mis- spoken, too. Brennan’s strange smile remains. This seems to be resolved?  INT. MAIN TREEHOUSE - NIGHT  A large, rustic treehouse. A threadbare, braided rug covers the floor. An inexplicable fire crackles in the fireplace. The walls are adorned with framed portraits of great, lost Orphans. A COUCH rests in the center. All of the Orphans are gathered about. They hold cocktails and chat. Beau is being engaged by a group of laughing Orphans. He smiles, making new friends. Suddenly the LIGHTS ARE SHUT OFF and a single SPOTLIGHT BEAMS DOWN ONTO THE COUCH. BRENNAN Attention, everybody. Everyone turns to Brennan. He turns to Beau. BRENNAN (CONT’D) Beau. Please approach the couch. Beau looks very confused. He turns to Billy, who smiles. BILLY It’s okay. Beau goes to the couch. BRENNAN Go ahead and lay down, Beau. Beau lays down. BEAU Like this?  77. BRENNAN Yes. And close your eyes. Beau reluctantly closes his eyes. Brennan turns on a MACHINE that emits a strange, almost inaudible whine (like a dog whistle). BRENNAN (CONT’D) What is your full name? BEAU Beau Wilmington? BRENNAN Where are you from? BEAU Castlestone. That’s where I need to go back. BRENNAN Did you like your parents? BEAU Well - I didn’t know my dad. BRENNAN Did you like your mother? BEAU I love her. BRENNAN Did you like her? BEAU Yes. BRENNAN Do you believe in an afterlife? BEAU ...I dunno. BRENNAN Do you believe in God? BEAU ... BRENNAN Are you afraid to make that decision? Beau doesn’t know how to answer. BRENNAN (CONT’D) If you had to make a choice between yes or no",
      "dialogue_count": 0,
      "word_count": 3468
    },
    {
      "scene_number": 6,
      "slugline": "EXT. CASTLESTONE STREET - DAY  A beautiful day on a modest Castlestone street. The simple residents shop and brunch under the pleasant Castlestone sun. Beau’s BUS enters to pause at the bus stop and release an extremely haggard Beau. The bright sunlight reveals the toll that his recent traumas have taken on his face (most notably the lines under his eyes). He proceeds to walk zombie-like through the scene. A BUTCHER looks up from his meat cart to watch Beau pass. His customer also takes note.   There is recognition in their eyes.  Even Castlestone’s sole homeless man stops to stare. Beau ignores them all.  EXT. BEAU’S MOTHER’S HOUSE - DAY  Beau approaches the MAILBOX of his Mother’s house. He sentimentally runs his fingers along the box’s texture, and then allows his gaze to travel up the LONG DRIVEWAY to... HIS MOTHER’S LARGE, BEAUTIFUL BEACH HOUSE, coated handsomely in white and blue paint. Just beyond it lies a glittering lake. Beau, squinting through too much sun, starts up the driveway.  INT. BEAU’S MOTHER’S HOUSE - DAY  Beau enters the house. Sunlight beams in through the windows, illuminating a density of dust particles. The interior has been painted a very clean WHITE. As Beau trudges forward, he walks past a STANDEE of a happy- looking black woman with her arms crossed (with mock-attitude). This is presumably BEAU’S MOTHER. Attached to the standee is the text: “Don’t Let Depression Ruin Your Day! Pop a PAXIM!” (In smaller font: “Brought to you by   Mama Wilmington .”) Beau continues forward. There are myriad FRAMED POSTERS advertising other prescription meds - many of them featuring Mama Wilmington’s face (and all of them featuring her name). Tears well in Beau’s eyes as he takes in the house. He begins climbing the stairs. As he does so, the distant sounds of his memory (of his mother, of himself as a child) seem to echo delicately off the walls.  INT. HALLWAY - CONTINUOUS  Beau walks the hallway. It’s adorned with photos. Photos of him as a CHILD - being HOME-SCHOOLED by his mother (from ages 7 to 17), COOKING with his mother (both wearing chef hats), dressing up with mom for Halloween, etc. There is a photo of him (at age 8) poking inquisitively at a BEEHIVE. This is followed by a photo of him screaming among a swarm of attacking bees. This is followed by a photo of his mother tending (quite happily) to Beau’s bee-stings. There’s a photo of Beau (age 21) and his mother, standing before his apartment door. The mother is crying as she hands him his   APARTMENT KEY , which is garnished with a GIFT RIBBON.  93.",
      "characters": [],
      "action_text": "Beau continues on, but a final photo makes him PAUSE... It appears to be a SURVEILLANCE STILL of Beau (current) holding a phone up to his ear in his apartment. The lighting, his stance, and all other details are identical to those of the scene in which he first learned of his mother’s death. Beau squints, very confused. He hesitates before moving on.  INT. BEAU’S MOTHER’S BEDROOM - DAY  Beau enters his MOTHER’S BEDROOM. Everything is as it was. The bed is made. The desk is covered in sketches (most of them stabs at advertising ideas). The shelves are neatly organized. Beau sits on the bed, overwhelmed. He notices the PILLOW. It still bears the vague imprint of his mother’s face. He sees a single STRAND OF HAIR. He takes it and gently smells it. Beau goes to the SHELVES. They are stacked with JOURNALS. Beau pulls one from the wall and starts to read. BEAU’S MOM (V.O.) October 2nd, 1975. Just when you think your heart has swollen to capacity with love, your child manages to inflate it even further. Today Beau did something amazing...  DISSOLVE TO...  Beau, rapt, reading another entry from a different journal... BEAU’S MOM (V.O.) ...and when I look back - what do you know? - he’s   covered   in the alfredo! Beau laughs.  DISSOLVE TO...  Beau reading another entry. BEAU’S MOM (V.O.) ...and so, after begging me for hours to take him to the park, it turns out he’s too terrified to step   foot   on the slide...  LATER  Beau sits on the floor, surrounded by stacks of journals. He’s been reading for hours, and his face is red and swollen (from crying). Outside, the sun has begun setting. BEAU’S MOM (V.O.) January, 1978. This morning I did a very difficult thing. I lied to Beau about his father’s death. Beau PAUSES and we are SLAMMED into silence. After a moment, he warily reads on, and we DISSOLVE TO A FLASHBACK...  94.",
      "dialogue_count": 0,
      "word_count": 770
    },
    {
      "scene_number": 7,
      "slugline": "INT. BEAU’S MOTHER’S HOUSE - DAY - FLASHBACK  A YOUNG VERSION OF BEAU’S MOTHER (mid 30s) sits on the couch, writing in her journal. An 8 YEAR OLD BEAU, traumatized- looking, lies on the floor, drawing in his notepad. Beau’s Mother watches him while she writes today’s journal entry. YOUNG BEAU’S MOM (V.O.) I told him that his father died on our honeymoon at the peak of our lovemaking. I told him he passed at the instant of conception. I couldn’t bring myself to tell him the truth. Why do parents always lie to their children about everything? Is it to keep them from making the same mistakes...? I know, in my case, it was certainly to prevent some   new   ones, since the story I told him will no doubt serve as a powerful sexual deterrent. Little Beau looks sadly up at his mother. She SMILES at him. He manages to smile back, none the wiser. She then adds casually to the journal: YOUNG BEAU’S MOM (V.O.) I also told him that there’s a swamp monster in his closet.  INT. BEAU’S MOTHER’S BEDROOM - EVENING  Back to present. BEAU CLOSES THE JOURNAL. His eyes are busy. How does he feel about this? He’s certainly shocked.   But is he angry. ..? Yes! BEAU STANDS UP SWIFTLY, fueled by the confused rage of the long-deceived. What’s he gonna do? He then sees a DOOR. It bears a sign:   MAMA’S WORKSHOP .  INT. MAMA’S WORKSHOP - CONTINUOUS  Beau enters. There are easels everywhere, holding different pie charts, ad ideas, pitch boards. Most of them are for various miracle drugs. But as Beau walks around, taking all this in, he discovers something special... An easel holding a BOARD for a new project, to be launched next year. Its title reads:   MAMA WILMINGTON’S ULTIMATE SURVEILLANCE.  There’s a lot going on here, but the most intriguing element might be the DIALOGUE BUBBLE emerging from the spunky photo of Mama Wilmington: “Does it work, you ask? I observed   MY OWN SON  for 23 years without him ever suspecting a thing!” Beau’s jaw is slack. His eyes are crazed. HE PUNCHES THE BOARD.  INT. BATHROOM - NIGHT  Beau stands in the shower. He SCRUBS himself vigorously.  LATER  Beau stands in front of the mirror. He’s SHAVING angrily.  95.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 381
    },
    {
      "scene_number": 8,
      "slugline": "INT. KITCHEN - NIGHT  Beau searches through a PHONEBOOK. His clean-shaven face is speckled with a few bits of bloody tissue paper. He finds the phone number for...ELAINE BRAY! He hesitates before dialing the number. He holds his breath, almost turning purple, through the rings. An OLDER WOMAN answers. OLDER WOMAN (V.O.) Hello? BEAU Hi, uh... Is... Are you Elaine? OLDER WOMAN (V.O.) Elaine’s out. This is her mom. Who’s this? BEAU Oh, hello, I’m uh... This is Beau. I’m an old, high school...friend. OLDER WOMAN (V.O.) (heard it all before) Uh-huh, okay, well - she’s probably at the Squirrel Den.  INT. SQUIRREL DEN BAR - NIGHT  A seedy BIKER BAR. Hard country music blares over the jukebox as grimy-looking patrons play pool, argue and get shit-faced. Beau, dressed nicely (in a sweater and kakhis), enters. He approaches the bar and sits down. The BARTENDER addresses him. BARTENDER What can I get ya? BEAU Anything alcoholic. BARTENDER Beer? Bourbon? BEAU Yeah. The Bartender doesn’t strain the issue. He gives Beau a beer. BARTENDER Start a tab? BEAU (confused) You want   me   to? BARTENDER No. Should   I ? BEAU (not sure) Okay.  96.",
      "characters": [],
      "action_text": "The Bartender confusedly leaves. Beau looks around the bar. After some scanning, he SEES... A BEAUTIFUL WOMAN (40s) nursing a lonely cocktail at the bar. She watches a group of guys play pool. This is ELAINE. Beau stares at her. He looks frozen in time. Elaine turns to notice Beau. There is no recognition, but she offers a friendly smile. Beau’s first reaction is to LOOK AWAY as if something else has grabbed his attention. But he catches himself. With great tension, he turns back to Elaine, forms a strained smile, and rises clumsily from his seat. He approaches her. BEAU (CONT’D) Hi. Elaine? ELAINE Hello? BEAU It’s me. ELAINE Uh... She squints, trying to place his face. BEAU Beau. She winces, still foggy. BEAU (CONT’D) You remember? Beau? From... ELAINE (suddenly places it) Oh my -- Not... Beau?!  BEAU Yeah! ELAINE Oh my God! Beau?! BEAU Yeah! ELAINE I can’t believe it! BEAU Me neither! ELAINE You look so good. BEAU What?  97. ELAINE You do! BEAU Well, that’s, I mean, you look   amazing . ELAINE I can’t even believe this! It’s been like a hundred years! What have you been doing? BEAU Nothing! ELAINE Yeah, but no, but - what have you been  doing ?! What’s your   life?!   Who   are  you?! It’s been like twenty   years!  BEAU Yeah, no, I’m nothing! I’m just here! ELAINE Doesn’t look like nothing! You look sharp. BEAU Yeah right. ELAINE  Yes right!   Look at you! You look - sturdy. BEAU (bashful smile) Well, what are   you?   What did   you   do? ELAINE I’m a teacher. BEAU You are? ELAINE Of tiny children. It’s been Kindergarten for like a million years, but I love them all! BEAU Wow. You’d be a great teacher. ELAINE Oh my God! I’m so excited about this! We’re doing shots - I don’t care! (to Bartender) Bobby. Four shots. Peach vodka.   No!   Six!  LATER  Elaine and Beau are hunched over the bar, both “tipsy.” ELAINE (CONT’D) My husband left me.  98. BEAU Oh - you have a husband? ELAINE He   left   me. BEAU I’m really sorry. ELAINE (waving it away) Ach, he found some pre",
      "dialogue_count": 0,
      "word_count": 5211
    },
    {
      "scene_number": 9,
      "slugline": "EXT. OCEAN - DAY  Beau’s boat floats calmly into the open water of what appears to be an OCEAN. With no land to be seen for miles, he’s surrounded by nothing but PLACID, GLITTERING BLUE. Beau, still addled from all of his recent experiences, sits back. He looks up at the sun, which pleasantly warms his face. He sees a TARP covering up half of the boat. He draws it aside to reveal: Several bottles of WATER, a wealth of CANNED FOOD and bread, a set of BINOCULARS, a FISHING ROD, a book on BIRD WATCHING, and a beautiful hardback edition of Tolstoy’s   WAR & PEACE.  Beau looks back up. It’s such a beautiful day. He hears SEAGULLS in the distance and ducks float happily nearby. Beau looks down at his feet. He FEELS them on the boat’s floor. He could almost smile. We cut to a WIDE of Beau’s lonely boat in the vast ocean. It is an almost perfect replica of the PAINTING from Beau’s apartment (which bore the text “Simplicity”). Beau’s eyes are closed. He feels his body. He soaks in the PEACE. This is all he’s wanted. After a long stretch of this, Beau hears distant music. His eyes open to SEE: A CRUISE SHIP in the distance. Beau reaches for the binoculars. Peering through them, he sees more clearly... Atop the cruise ship, several overweight kids in colorful spandex DANCE enthusiastically. A BANNER above them reads: “Reaching Your Full Potential at MICHELLE OMAMA’S FITNESS RETREAT!” The First Lady of the United States is guiding the exercise, yelling enthusiastic motivation into a MICROPHONE. FIRST LADY (O.S.) (aided by music)  And one, and two, and yeah, and great - and shake your buns! And touch the floor! And grab the sky!  Beau’s eyes widen. Something has been TRIGGERED in him. (The “sleeper assassin” is no longer asleep.) The black of his pupils is replaced by the rotating hypno-discs from the Orphans’ treehouse. Beau looks back down. The MACHINE GUN rests before his feet. Beau looks back up at the Cruise, which is moving very much in his direction. His shoulders slump with exhausted resignation. BEAU Goddamn it. CUT HARD TO   BLACK .  118.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 367
    }
  ]
}