{
  "slug": "beauty-and-the-beast-2017",
  "title": "beauty and the beast",
  "genre": "drama",
  "format": "film",
  "scenes_count": 14,
  "characters_count": 0,
  "characters": [],
  "total_words": 25751,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. CASTLE GROUNDS - NIGHT 1   1  A MAGNIFICENT CASTLE.   Resplendent, bespeaking great wealth and   *  power.   The grounds and stonework immaculate. NARRATOR (V.O.) Once upon a time in the hidden heart of France, a handsome young Prince lived in a beautiful castle... RACK FOCUS to a single RED ROSE clinging to a rose bush on a   *  stormy spring night.   A WEATHERED HAND plucks the rose.   *  NARRATOR (V.O.) Although he had everything his heart desired, the Prince was selfish and   *  unkind.  INT. BALLROOM ENTRANCE - CASTLE - NIGHT 2   2  TIGHT ON   THE PRINCE   being groomed by his servants.   (We do not see their faces.)   A   FRENCH MAID   paints an exotic animal mask on the Prince’s face with a feather brush.   A   TALL VALET   drapes the Prince with an elaborately bejeweled coat. NARRATOR (V.O.) He taxed the village to fill his castle with the most beautiful   *  objects... The MAID dusts his wig with powder - MAID   *  Poof poof...   *  - while a   MAJORDOMO   holds a POCKET WATCH, indicating that they   *  are running late. MAJORDOMO   *  Master, it’s time.   *  With a haughty wave, the Prince instructs his   FOOTMAN   to bring more light. FOOTMAN   *  Oui, maître.   *  A CANDELABRA is lifted to the preening Prince as he looks at himself in an ornate HAND MIRROR. NARRATOR (V.O.)   *  ... and his parties with the most   *  beautiful people.   *",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 236
    },
    {
      "scene_number": 2,
      "slugline": "INT. BALLROOM - CASTLE - NIGHT 3   3  The ornate room is filled with BEAUTIFUL PEOPLE from all   *  corners of the world, each on display for the Prince’s   *  pleasure.   A circle of eligible maidens bow their heads.   *  Seated in a throne chair dominated by a majestic COAT OF   *  ARMS, the Prince snaps his fingers impatiently at an   ITALIAN   *  MAESTRO , who smiles, revealing comically rotten teeth.   *  The maestro sits at a harpsichord and motions to his wife, a  LARGE DIVA   holding a   TINY BICHON FRISÉ .   As the music begins, the Prince steps forward. The diva fills the room with a voice as big as her frame. The Prince performs a ROUNDELAY with several debutantes: DIVA  Oh how divine Glamour, music and magic combine See the maidens so anxious to shine Look for a sign that enhances Chances She’ll be his special one  INT. BALLROOM - CASTLE - NIGHT 5   5  The dance speeds up.   The Prince connects momentarily with a   *  beautiful woman -- but quickly moves on when his eye catches someone even more dazzling: DIVA  What a display! What a breathtaking thrilling array  (coos to the dog)  Every prince, every dog has his day Let us sing with passion, gusto Fit to bust - oh Not a care in the world  KNOCK KNOCK.   The Prince stops.   Then a gust of wind blows open   *  the windows.   Sconces flicker and go dark.   The figure enters in silhouette, hobbling on a CANE. Furious, the Prince grabs a lit candelabra from the Footman. He rudely pushes through the crowd, sweeping people from his path.   He crosses to the windows, finally revealing -- AN   OLD BEGGAR WOMAN   shivering from the rain.   She looks to the Prince with hope and offers him -- A RED ROSE. NARRATOR (V.O.) Then, one night, an unexpected intruder   *  arrived at the castle, seeking shelter from the bitter storm.   As a gift, she offered the Prince a single rose.  2.",
      "characters": [],
      "action_text": "The PRINCE’S HAND waves her off.   The woman begs on her knees. The Prince motions to the staff. NARRATOR (V.O.) Repulsed by her haggard appearance, the Prince turned the woman away.   But she   *  warned him not to be deceived by appearances, for beauty is found within. The majordomo and footman approach to usher her out.   The woman   *  lowers her head as if to cry -- NARRATOR (V.O.) And when he dismissed her again, the old woman’s outward appearance melted away to reveal... Suddenly, the old woman’s cape and hood cocoon.   AN ERUPTION OF LIGHT as she transforms into...   *  NARRATOR (V.O.) ...a beautiful Enchantress. The wind picks up inside the room.   Frightened, the Prince   *  falls to his knees. NARRATOR (V.O.) The Prince tried to apologize but it was too late.   For she had seen that there was no love in his heart.   *  As the Prince begs for mercy, his body begins to transform.   *  His jewelry pops off.   His clothing rips as he grows larger. NARRATOR (V.O.) As punishment, she transformed him into a hideous beast... The guests scream in horror and flee.   But pushing his way   *  through the crowd, A YOUNG BOY slips into the ballroom, watching in wonder as -- the PRINCE’S SHADOW twists into the SHADOW OF A HIDEOUS BEAST. The boy’s mother frantically follows him inside --   *  BOY’S MOTHER   *  Chip!   Chip!   Oh   my ...   *  -- just as the doors slam shut, leaving the staff, the   *  entertainers and the dog trapped in the room.   *  NARRATOR (V.O.) ... and placed a powerful spell on the castle and all who lived there.  3.",
      "dialogue_count": 0,
      "word_count": 605
    },
    {
      "scene_number": 3,
      "slugline": "INT. BALLROOM - CASTLE - NIGHT 5A   5A   *  CLOSE ON a portrait of the handsome prince -- as the beast’s   *  giant paw slashes it.   *  EXT. CASTLE - NIGHT 6   6  Years later, the enchanted castle stands isolated.   The   *  property is surrounded by an ice hedge.   The only sound is the grim winter wind.   As we move closer:   *  NARRATOR (V.O.) As days bled into years, the Prince and his servants were forgotten by the world.   For the Enchantress had erased all memory of them from the minds of   *  the people they loved.   *  EXT./INT. BEAST’S LAIR - WEST WING - CASTLE - NIGHT 7   7   *  At the highest window of the west wing, we see   THE BEAST .   The   *  ROSE, already wilting, floats before him.   To protect it, the beast has covered it with a glass bell jar.   *  NARRATOR (V.O.) But the rose she had offered was truly an enchanted rose.   If he could learn to love another and earn their love in return by the time the last petal fell, the spell would be broken.   If not, he would be doomed to remain a beast for all time. TIGHT ON THE ROSE -- another petal drops. NARRATOR (V.O.) As the years passed, he fell into despair and lost all hope.   For who could ever learn to love a beast?  EXT. BELLE’S COTTAGE - MORNING 8   8  The front door of a cozy cottage opens to reveal --   BELLE , a   *  pure beauty blessed with intelligent, fiercely inquisitive eyes. With book in hand, she takes a deep breath of morning air and gazes toward the church which peeks above the village rooftops. BELLE  Little town, it’s a quiet village Every day like the one before Little town full of little people Waking up to say...  Belle looks at the clock on the church counting to 8am.   Wait for it.   3. 2. 1.  4.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 323
    },
    {
      "scene_number": 4,
      "slugline": "EXT. VILLAGE OF VILLENEUVE - MORNING 9   9  On cue, the villagers begin their day.   A   HOUSEWIFE   opens a   *  window, nods to a   WOMAN   shaking out a rug nearby.   A   BUTCHER   *  opens his shop, waves to a   COBBLER   moving past with his cart.   *  VILLAGERS  Bonjour.   Bonjour.   Bonjour.   Bonjour.  An old   VAGRANT   is the only one to notice Belle, smiling at her   *  as he’s tossed inside a HOLDING TANK by two   GENDARMES .   *  VAGRANT  Bonjour.  Belle weaves between the villagers, making herself invisible.   *  She passes a harried   BAKER , buys a baguette --   *  BELLE  There goes the baker with his tray like always The same old bread and rolls to sell  Belle approaches   JEAN , the potter, tending to his   MULE .   *  BELLE (CONT’D)  Every morning just the same Since the morning that we came To this poor provincial town  JEAN  Good morning, Belle  Jean scratches his head, trying to remember something.   He   *  searches his cart which is loaded with pottery. BELLE Good morning, Monsieur Jean.   Have you lost something again? JEAN I believe I have.   Problem is, I can’t remember what.   Well, I’m sure it will come to me. As she leaves:   *  JEAN (CONT’D) Where are you off to? BELLE To return this book to Pere Robert. It’s about two lovers in fair Verona. JEAN   *  Sounds boring.   *  5.",
      "characters": [],
      "action_text": "Later -- Belle passes   SCHOOL BOYS   as they march into the school   *  house.   Their heads turn in unison. SCHOOL BOYS   *  Look there she goes That girl is strange, no question  The   NASTY HEADMASTER   ushers them in impatiently.   *  NASTY HEADMASTER  Dazed and distracted, can’t you tell?  As the boys scramble into school, Belle steps on the stones over the duck pond -- revealing   GIRLS   forced into “woman's   *  work” chores, washing clothes in the circular laverie. They’re surrounded by women kneading clothes on barrels.   *  WASHER WOMEN   *  Never part of any crowd ‘Cause her head’s up on some cloud  LITTLE GIRLS  No denying she’s a funny girl That Belle  A   FLIRTATIOUS FARMER   approaches a   PRETTY FISHMONGER’S WIFE .   *  FARMER   *  Bonjour, good day, how is your family?  PRETTY FISHMONGER’S WIFE   *  (pointed)  Bonjour, good day, how is your wife?  THE FISHMONGER   pops up next to his wife, sending the would-be-   *  Lothario into retreat.   Another fishmonger, the shrewish   *  CLOTHILDE , accosts him:   *  CLOTHILDE  I need six eggs  The FARMER points out the price.   Belle moves past.   *  CLOTHILDE (CONT’D)  That’s too expensive  BELLE  There must be more than this provincial life  INT. CHURCH VESTRY - DAY 10   10   *  Belle escapes into the peace and serenity of a country church.   Jolly   PERE ROBERT   looks up as she enters.  6. PERE ROBERT Well!   If it isn’t the only bookworm   *  in town.   So where did you run off to   *  this week? BELLE Two cities in Northern Italy.   I   *  didn’t want to come back.   *  Belle hands   “Romeo and Juliet”   to Pere Robert, who dutifully returns it to the shelves of the town’s “library”: a COUPLE DOZEN BOOKS in total.   She remains hopeful. BELLE (CONT’D) Have you got any new places to go? PERE ROBERT I’m afraid not.   But you may reread any of the old ones that you’d like. BELLE Thank you, Pere Robert.   Your library almost makes our small corner of the   *  world feel big.   *  He smiles.   Belle picks",
      "dialogue_count": 0,
      "word_count": 2458
    },
    {
      "scene_number": 5,
      "slugline": "EXT. VILLAGE OF VILLENEUVE - DAY (LATER) 17   17  Gaston shakes his head and laughs, absolutely smitten. GASTON You are the wildest, most beautiful thing I’ve ever seen.   No one deserves you, but at least I know our children will be beautiful. A reverse angle reveals Gaston was addressing his reflection   *  in a shop window.   *  LEFOU (O.S.)   *  Am I catching you at a bad time?   *  GASTON   *  What is it, LeFou? LEFOU A certain   damsel   is in distress.   *  GASTON Oh well.   It’s hero time. (to his reflection)   *  I’m not done with you yet.   *  And he’s off.   LeFou steps up to the mirror.   *  LEFOU   *  Me neither.   *  EXT. BELLE’S COTTAGE - DAY (LATER) 19   19   *  Gaston follows Belle back to her cottage.   *  GASTON   *  Belle!   Heard you had a little trouble   *  with the headmaster.   He never liked   *  me, either.   Can I give you a little   *  advice about the villagers, though?   *  They’re never going to trust the kind of change we’re trying to bring.   *  Pursuing her into her garden, he trampling cabbages.   *  BELLE All I wanted was to teach a child to   *  read. GASTON The only children you should concern yourself with are... your own. Belle looks for a way out.   She doesn’t like where this is   *  going.  15.",
      "characters": [],
      "action_text": "BELLE I’m not ready to have children.   *  GASTON Maybe you haven't met the right man.   *  BELLE It's a small village, Gaston.   I've   *  met them all. GASTON Maybe you should take another look.   *  Some of us have changed.   *  She climbs the steps to her cottage door.   Gaston follows   *  close behind.   *  BELLE   *  Gaston, we could never make each other   *  happy.   No one can change that much.   *  GASTON   *  Belle, do you know what happens to   *  spinsters in our village after their   *  fathers die?   *  Gaston motions to the street, where we find   AGATHE , a   *  spinster, late 30’s, dirty and homeless, rattling her cup:   *  “alms for the poor?”   *  GASTON (CONT’D)   *  They beg for scraps, like poor Agathe.   *  This is our world, Belle.   For simple   *  folk like us, it doesn’t get any better. BELLE I might be a farm girl, but I’m not   *  simple.   I’m sorry, but I will never marry you, Gaston. Gaston keeps the gallant smile plastered as she shuts the door   *  in his face.   *  EXT. BELLE’S COTTAGE - SUNSET 20   20  Belle watches Gaston leave.   She opens the door.   *  BELLE Can you imagine?   Me, the wife of that   *  boorish, brainless...   *  She turns away from the home she thinks she will never   *  escape.   *  BELLE (CONT’D)  Madame Gaston, can’t you just see it Madame Gaston, his little wife No sir, not me, I guarantee it  (MORE)  16. I want much more than this Provincial life...  EXT. VILLAGE PROMONTORY - SUNSET 21   21   *  Belle races up the hills to the outskirts of town.   When she reaches the highest point, we circle around to reveal the town spread out beneath her. BELLE  I want adventure in the great wide somewhere  I want it more than I can tell  And for once it might be grand To have someone understand I want so much more than They’ve got planned  As the last rays of light fade we RISE to reveal a forest in the *  distance, where the skies begin to rage.   A swirling wind and a   *  streak of...  EXT. WOODS - EVENING 22   2",
      "dialogue_count": 0,
      "word_count": 755
    },
    {
      "scene_number": 6,
      "slugline": "EXT. ENCHANTED WOODS - EVENING 23   23   *  We have entered another world.   A light, whirling snow descends on Maurice, dusting his coat.   The clippity-clop of hooves echo in stillness.   *  Suddenly, A   WHITE WOLF   roars out of the bushes, barely missing   *  them.   Gaze darting, Maurice notices WHITE WOLVES running on an   *  icy ledge above him.   The wolves keep pace, massing to overrun him. MAURICE Go, Philippe!   Hurry! Maurice urges his horse on, but his rickety cart starts to buckle.   A HARNESS IS LOOSE.   *  The wolves leap in front of the cart, which comes undone, tipping over on its side.   The chest of music boxes smashes open *  on the ground.   Maurice is launched up onto a ridge -- and finds *  himself face-to-face with the snarling and scarred ALPHA WOLF.   *  Terrified, Maurice turns and begins sliding down the snowy ridge *  -- towards a trio of wolves waiting below.   *  MAURICE (CONT’D)   *  Philippe!   *  As Maurice drops from the ridge, Philippe appears beneath him -- *  and Maurice lands on his back!   *  MAURICE (CONT’D)   *  Go!   Go!   *  Philippe rides.   PAWS crush twigs -- SLAVERING JAWS -- EYES mad   *  with hunger -- a gleam of FANGS -- Philippe gallops.   Maurice races toward the CASTLE ICE GATES -- which churn open as the   *  wolves draw near. Maurice and Philippe speed through the gates as the wolves skid to a stop, their HOWLS turning to YELPS OF FEAR.  EXT. CASTLE GROUNDS - EVENING 24   24   *  Maurice stares in open-mouth awe at THE BEAST’S CASTLE.   A grey   *  edifice seemingly growing out of stone and reaching to troubled   *  skies.   It feels like a place hiding its face from the world.   *  MAURICE   *  (to Philippe)   *  Oh Philippe, you saved my life...   *  They’ll have to get their dinner   *  somewhere else.   *  ANGLE ON MAURICE -- as he draws near the castle, he notices a   *  colonnade filled with WHITE ROSE BUSHES.   Just beyond, he sees   *  the door to the STABLES swinging in the wind.   A LAMP has been   *  lit inside.   As if inviting a tired traveler.   *  18.",
      "characters": [],
      "action_text": "Maurice strokes Philippe’s neck.   *  MAURICE (CONT’D)   *  Water, fresh hay.   Looks like you’re   *  set, old friend.   Rest here...   *  Warily, Maurice peers out at the intimidating castle. MAURICE (CONT’D) While I pay my respects to our unwitting   *  host... whoever that may be...   *  He leaves.   Philippe stares uneasily at a statue of a horse.  EXT. TERRACE - CASTLE - EVENING 25   25  Cautiously, Maurice approaches the castle door.   He gazes up at a row of TORCHES held by sculpted iron hands.   The hands are so life-like, does a double-take.   *  MAURICE   *  Hm.   *  Then --  INT. FOYER - CASTLE - NIGHT 26   26  -- the DOOR OPENS with a creak.   Maurice peers in. MAURICE Hello?   Anyone home? Silence.   Flashes of lightning illuminate a once-elegant space   *  now fallen into disrepair. MAURICE (CONT’D) Forgive me, I don’t mean to intrude.   I need shelter from the storm.   Hello? Maurice puts his hat and coat on a COAT RACK at the entrance. Maurice turns, not seeing the coat rack shake the snow off. Maurice explores, scanning the room and its FURNITURE --   *  TABLES, CHAIRS, A FEATHER DUSTER.   A MANTLE CLOCK AND   *  CANDELABRA SIT ON A TABLE.   As Maurice passes them, the   *  candelabra slowly TURNS -- as if watching him.   This is   *  LUMIÈRE, formerly head footman to the Prince.   *  LUMIÈRE   *  Must have lost his way in the woods...   *  The candelabra continues craning -- while the mantle clock   *  beside it remains rigid.   Meet   COGSWORTH , every bit the stiff-   *  upper-lip majordomo.   *  COGSWORTH   *  (whispers)   *  Shut up, you idiot.   *  19. Hearing this, Maurice spins -- but sees only an ordinary   *  candelabra and clock on the table.   Curious, he approaches,   *  leaning down to the clock...   *  MAURICE   *  Mm... extraordinary.   *  He picks up the candelabra, inspecting it.   *  MAURICE (CONT’D)   *  This is beautiful...   *  An echo of eerie harpsichord music makes Maurice turn toward   *  the ballroom.   He places the cand",
      "dialogue_count": 0,
      "word_count": 1454
    },
    {
      "scene_number": 7,
      "slugline": "EXT. TERRACE - CASTLE - DAY 32A   32A   *  Belle dismounts Philippe.   Finding a THICK BRANCH, she wields it *  like a club, then bravely crosses to the castle and enters.   *  INT. FOYER - CASTLE - DAY 33   33  Club held high, ready to defend herself, Belle cautiously eases the door open and peeks inside. The atmosphere of the castle presses in on Belle.   Creepy DRAGON *  STATUES on the staircase seem like they're watching.   Eerie   *  SHADOWS stretch down impossibly long hallways.   *  LUMIÈRE Look, Cogsworth.   A beautiful girl. COGSWORTH I can see it’s a   girl .   I lost my   *  hands, not my eyes.   *  LUMIÈRE But what if she is the one?   The one who will break the spell?   *  Belle reacts.   Quickly moves towards the voices -- BELLE Who said that?   Who’s there? Belle reaches the spot where she heard the voices.   No one there.   Only a clock and candelabra.   Suddenly, a COUGH echoes   *  through the castle.   Belle grabs the candelabra and climbs a   *  long staircase.   The clock shudders with dread.   *  INT. PRISON TOWER - CASTLE - DAY 34   34  Belle follows the cough up a labyrinth of stairs until she reaches the dark prison tower and a GRATED IRON DOOR. BELLE Papa!?   Is that you?   *  Belle sees Maurice through a grate in the door.   He looks   *  terribly pale and sick, coughing.   *  MAURICE (O.S.) Belle?   How did you find me!? Belle puts the candelabra down and clutches his hands.   *  BELLE Oh, your hands are ice.   We need to get you home.   *  23.",
      "characters": [],
      "action_text": "MAURICE Belle, you must leave here at once.   *  This castle is alive!   Now go, before   *  he finds you!   *  BELLE   *  Who?!   *  The beast roars.   Belle spins quickly, swinging her club to   *  strike, but the figure jumps onto another staircase.   Belle searches the shadows.   The voice circles her. BELLE (CONT’D) Who’s there?   Who are you? THE BEAST (O.S.) Who are   you ?   *  BELLE I’ve come for my father.   *  THE BEAST (O.S.) Your father is a thief. BELLE Liar!   *  THE BEAST (O.S.) HE STOLE A ROSE.   *  In Belle’s wide eyes, we see her guilt.   *  BELLE I asked for the rose.   Punish me, not   *  him!   *  MAURICE No, he means   forever .   Apparently   *  that’s what happens around here when   *  you pick a flower.   *  BELLE A life sentence for a rose? THE BEAST I received eternal damnation for one. I’m merely locking him away.   Now... do   *  you still wish to take your father’s place? BELLE Come into the light. The figure remains still.   Belle grabs hold of Lumiere and   *  thrusts the candle forward, illuminating a HIDEOUS HORNED   *  FACE.   Belle’s eyes go wide as she clearly sees   THE BEAST.  The only part of him that seems human are his eyes.   BLUE.  24. DEEP.   SOULFUL.   And flicked with pain when he sees Belle’s   *  revulsion.   *  THE BEAST CHOOSE!   *  MAURICE Belle, I won’t let you do this.   I   *  lost your mother.   I won’t lose you   *  too.   Now go!   *  Maurice falls into a terrible coughing fit.   *  BELLE Alright, Papa.   I will leave.   *  (to the beast) I need a minute alone with him.   *  The beast doesn’t respond.   *  BELLE (CONT’D)   *  Are you so cold-hearted that you won’t   *  allow a daughter to kiss her father   *  goodbye?   *  (off his proud grunt) Forever can spare a minute! Intrigued by her defiance, the beast moves toward her, reaching out with his massive paw.   Belle closes her eyes, bracing herself for his retaliation.   Instead, she hears -- CLANG. Belle opens her eyes to find herself eye to eye with the ",
      "dialogue_count": 0,
      "word_count": 1388
    },
    {
      "scene_number": 8,
      "slugline": "INT. CORRIDOR/BELLE’S BEDROOM - CASTLE - EVENING 41   41  Belle stands outside the bedroom door, anticipating worse squalor...   *  LUMIÈRE   *  Welcome to your new home.   It’s   *  modest, but comfortable...   *  Instead, the door opens to --   *  INT. BELLE’S BEDROOM - CASTLE - EVENING 42   42   *  -- the most beautiful, magical room she’s ever seen.   The entire *  ceiling is a painting of white clouds in a blue sky.   There is a LARGE DRESSER and a COMFORTABLE BED.   Opulence. BELLE It’s... beautiful. LUMIÈRE Of course.   Master wanted you to have the finest room in the castle. Lumière leaps onto the bed and - POOF - dust fills the air.   *  LUMIÈRE (CONT’D) Oh dear!   We were not expecting guests.   *  PLUMETTE , a feather duster, swoops into the room, giving the   *  surfaces a quick dusting. PLUMETTE   *  Enchanté, Mademoiselle!   Don't worry,   *  I'll have this room spotless in no   *  time!   *  She lands in the arms of Lumière, whose candles burn a little   *  hotter once she speaks in her sexy French accent. PLUMETTE (CONT’D) (sotto) This plan of yours is... dangerous. LUMIÈRE I would risk anything to kiss you again, Plumette. He moves to embrace her, but she stops him.   *  PLUMETTE No, my love.   I've been burned by you before.   We must be strong. LUMIÈRE How can I be strong when you make me so weak?  29.",
      "characters": [],
      "action_text": "Cogsworth clears his throat.   Belle backs away from the   *  strange creatures.   *  BELLE   *  Is everything here alive? (picks up a HAIR BRUSH)   *  Hello, what’s   your   name?   *  Cogsworth looks up at her, puzzled.   *  COGSWORTH   *  Um... that’s a hair brush.   *  Belle hears a loud SNORE behind her, and turns to see the   *  DRESSER bursting open with an operatic “laaaaaa!”   Belle   *  shrieks and steps back.   *  LUMIÈRE Do not be alarmed, mademoiselle.   This is just your wardrobe.   Meet Madame De Garderobe.   A great singer. COGSWORTH   *  When she can stay awake.   *  GARDEROBE   *  Cogsworth!   A diva needs her beauty rrr-   *  MADAME DE GARDEROBE   yawns loudly. LUMIÈRE Ah, stay with us, Madame!   We have   *  someone for you to dress! Garderobe’s gilded arms stroke Belle’s shoulder and face.   *  GARDEROBE  Finally .   A woman.   Pretty eyes.   *  Proud face.   Perfect canvas.   Yes!   I   *  will find you something worthy of a princess. BELLE But I’m not a princess. GARDEROBE Nonsense!   Now, let’s see what I’ve   *  got in my drawers. Garderobe’s doors open and a few moths fly out. GARDEROBE (CONT’D) Oh, how embarrassing. Garderobe places a large HOOP over Belle’s head, and proceeds   *  to create an outfit using fabric and her pinking-shear hands.   *  FROUFROU , a piano stool, runs in, barking like a dog.   *  30. GARDEROBE (CONT’D)   *  Come here, Froufrou.   Come help mama!   *  Froufrou tugs at the fabric, helping Garderobe complete the   *  outfit -- which is garish and too too much, all wrong for   *  Belle.   *  GARDEROBE (CONT’D)   *  Perfetta!   *  Lumière and Cogsworth put on a game smile.   *  LUMIÈRE   *  Mm.   Subtle.   Understated.   I love it!   *  With a deep bow and a whistle for Froufrou, Lumière drags   *  Cogsworth out.   Plumette and Froufrou follow.   Garderobe calls   *  out after her beloved dog. GARDEROBE Froufrou, send my love to the maestro! The door closes.   Belle is alone.   Garderobe instantly falls   *  asleep wi",
      "dialogue_count": 0,
      "word_count": 4623
    },
    {
      "scene_number": 9,
      "slugline": "INT. KITCHEN - CASTLE - NIGHT 58   58  Mrs. Potts hops along the edge of the sink basin.   *  MRS. POTTS  It’s a guest, it’s a guest!  Sakes alive, and I’ll be blessed!  Wine’s been poured and thank the Lord  I’ve had more napkins freshly pressed!  She ascents to the top of a tiered, circular pastry table, as   *  napkins twirl around her.   Desserts appear and circle Mrs.   *  Potts.   Then tea cups enter on the outer circle, moving in the opposite direction. MRS. POTTS (CONT’D)  With dessert, she’ll want tea And my dear, that’s fine with me!  While the cups do their soft shoeing,  I’ll be bubbling, I’ll be brewing!  From overhead, a la Busby Berkeley, we reveal desserts, teacups, napkins, the floor, everything circling in opposing directions. Mrs. Potts descends, jumping onto her tea trolley -- and notices *  a smudge of icing on Chip. MRS. POTTS (CONT’D)  I’ll get warm, piping hot  Heaven’s sake, is that a spot?  She quickly steams it off him.   *  MRS. POTTS (CONT’D)   *  Clean it up, we want the company impressed!  The trolley rolls through the doors --   *  INT. DINING ROOM - CASTLE - NIGHT 59   59  -- and up to Belle.   Mrs. Potts pours a cup into Chip.   *  MRS. POTTS  We’ve got a lot to do -- Is it one lump or two? For you our guest!  LUMIÈRE   *  She’s our guest!  MRS. POTTS  She’s our guest!   *  Finally, unable to resist, Cogsworth joins in, pushing   *  Lumière out of the spotlight.   *  COGSWORTH, LUMIÈRE, MRS. POTTS   *  She’s our guest!  48.",
      "characters": [],
      "action_text": "Plumette and her “Ettes” descend on a chandelier, which is lowered by Lumière.   They dance; a Beyoncé homage. ALL  Be our guest!   Be our guest!  Our command is your request!  It’s years since we had anybody Here   and we’re obsessed!  Lumière ties the chandelier rope around Cogsworth, who falls over, causing the light to spin.   Plumette dives into a massive punch bowl, leading her “Ettes” into an Esther Williams moment. ALL (CONT’D)  With your meal, with your ease, Yes indeed, we aim to please  Splashes from the punch bowl launch us into a “Singin’ in the   *  Rain” moment, with Lumière dancing under the fountain.   The   *  grand finale is pure Bollywood, punctuated by explosions of candy-colored powders. ALL (CONT’D)  While the candlelight’s still glowing ,  Let us help you, we'll keep going --  Course by... COURSE!   One by one! Til you shout “Enough, I’m done!”  Then we’ll sing you off to sleep as you digest  Tonight you’ll prop your feet up But for now let’s eat up ...  Be our guest!   Be our guest! Be our guest!   Please!   Be our guest!!  As the table clears itself, whooshing back into the kitchen,   *  Lumière whirls toward Belle, finally presenting her with --   *  LUMIÈRE Pudding?! Overwhelmed, she laughs.   *  INT. FOYER - CASTLE - NIGHT 60   60   *  Mrs. Potts (on her trolley cart) escorts Belle from the dining   *  room.   *  BELLE   *  Surely you’re as trapped here as I am.   *  Don’t you ever want to escape?   *  MRS. POTTS   *  The master’s not as terrible as he   *  appears.   Somewhere deep in his soul,   *  there’s a prince of a fellow, just   *  waiting to be set free.   *  49. Belle takes this in, a valuable piece of the puzzle.   She   *  looks up at the massive staircase.   *  BELLE   *  Lumiere mentioned something about the   *  West Wing...   *  MRS. POTTS   *  Never you mind about that.   Off to bed   *  with you, poppet.   *  BELLE   *  Good night.   *  MRS. POTTS   *  Nighty-night.   Straight to bed!   *  Mrs. Potts moves off as Belle ",
      "dialogue_count": 0,
      "word_count": 2295
    },
    {
      "scene_number": 10,
      "slugline": "EXT. REMOTE FOREST ROAD - NIGHT (LATER) 70A   70A   *  Maurice is now tied to a tree.   Gaston secures the knot and walks to the carriage.   Darkness has come over Gaston.   *  GASTON If Maurice won’t give me his blessing,   *  then he is in my way.   Once the wolves are finished with him, Belle will have no one to take care of her but   me . LEFOU For the sake of exhausting all of our   *  options, do we maybe want to consider a   *  less   gruesome   alternative?   *  Gaston climbs into the carriage.   *  GASTON   *  Are you coming?   *  LeFou looks back to Maurice, an apology in his eyes.   He   *  climbs into the carriage.   *  Gaston and LeFou ride off, leaving Maurice to die.   *  INT. BEAST’S LAIR - WEST WING - CASTLE - NIGHT 71   71  The beast lies in his old human bed.   Belle dabs a large gash   *  on the beast’s arm.   The beast bares his fangs and lets out a roar. THE BEAST ROOOOAARRRR!   Ow!   That hurts!   *  BELLE If you held still, it wouldn’t hurt as   *  much.   *  THE BEAST   *  If   you   hadn’t run away, none of this   *  would have happened.   *  BELLE   *  Well if   you   hadn’t frightened me, I   *  wouldn’t have run away.   *  The household staff anxiously watches the battle of words.   *  THE BEAST   *  Well   you   shouldn’t have been in the   *  west wing.   *  BELLE   *  Well   you   should learn to control your   *  temper.   *  56.",
      "characters": [],
      "action_text": "The beast is momentarily silenced.   Belle looks down at the   *  wound she has been dabbing.   It’s worse than she thought.   *  BELLE (CONT’D)   *  Try to get some rest.   *  The beast’s breath slows to a low rumble as his eyes slip   *  shut.   *  MRS. POTTS Thank you, Miss. LUMIÈRE We are eternally grateful. BELLE Why do you care so much about him?   *  MRS. POTTS We’ve looked after him all his life. BELLE But he has cursed you somehow.   *  (off their silence) Why?   You did nothing.   *  MRS. POTTS You’re quite right there, dear.   You   *  see, when the master lost his mother,   *  and his cruel father took that sweet   *  innocent lad and twisted him up to be   *  just like him... we did nothing.   *  Belle notes their shame just as we HEAR the first notes of a beautiful melody coming from the ballroom downstairs.   This is the beast’s lullaby -- “ DAYS IN THE SUN .”   *  LUMIÈRE   *  Let him sleep.   *  As the staff and Belle exit, the beast stirs.   We move from   *  his face, shivering in a fever dream, to discover --   *  INT. BEAST’S LAIR - WEST WING - CASTLE - NIGHT 71A   71A   *  The YOUNG PRINCE gazes down sadly.   *  YOUNG PRINCE   *  Days in the sun   *  When my life has barely begun   *  We move around to reveal that he is looking at the pale body   *  of THE QUEEN on her deathbed.   *  YOUNG PRINCE (CONT’D)   *  Not until my own life is done   *  Will I ever leave you   *  57. Behind the prince, a figure approaches: his FATHER.   Cruelty   *  written on his face.   Placing his large hand on the boy's   *  shoulder, he pulls him out of the room.   *  INT. CASTLE - BALLROOM/FOYER - NIGHT 72   72   *  In the gloomy ballroom, Cadenza plays the beautiful melody. CADENZA   *  Will I tremble again   *  To my dear one’s gorgeous refrain?   *  The melody drifts through the ballroom until we find Lumière and *  Plumette, dancing:   *  LUMIÈRE & PLUMETTE   *  Will you now forever remain   *  Out of reach of my arms?   *  INT. CASTLE - KITCHEN - NIGHT 72AA  ",
      "dialogue_count": 0,
      "word_count": 7070
    },
    {
      "scene_number": 11,
      "slugline": "INT. FOYER - CASTLE - NIGHT 103A   103A  CRASH!   The battering ram breaks through the postern door,   *  which falls out of the door frame.   *  COGSWORTH   *  We need help!   *  He lopes towards the staircase.   *  INT. ASYLUM WAGON - VILLAGE OF VILLENEUVE - NIGHT 105   105   *  Belle gazes out the prison bars, sees d’Arque pacing by the   *  fountain.   She whispers to Maurice --   *  BELLE   *  I have to warn the beast --   *  MAURICE   *  Warn him?   How did you get   away   from   *  him?   *  BELLE   *  He let me go, papa.   He sent me back   *  to you.   *  MAURICE   *  I don’t understand.   *  She holds up the rose-shaped rattle.   Maurice recognizes it   *  immediately.   *  BELLE   *  He took me there.   I know what   *  happened to maman.   *  Maurice takes the rattle.   Stunned.   *  MAURICE   *  Then you know I had to leave her   *  there.   I had to protect you.   I’ve   *  always tried to protect you... too   *  much, perhaps...   *  He stops, eyes filled with tears.   *  BELLE   *  I understand.   *  She takes his hand and kisses it.   *  BELLE (CONT’D)   *  Will you help me now?   *  MAURICE   *  It’s dangerous.   *  84.",
      "characters": [],
      "action_text": "BELLE   *  Yes.   Yes it is.   *  Maurice sees the courage and determination in her eyes.   And   *  his own eyes light up with an idea.   *  MAURICE   *  Of course I could try to pick the   *  lock.   After all, it’s only gears and   *  springs.   But I would need something   *  long and sharp --   *  He stops as Belle, a step ahead, removes and hands him one of   *  her long hairpins.   *  MAURICE (CONT’D)   *  Like that.   Perfect .   *  Maurice gets to work.   *  EXT. HIGHEST TURRET - CASTLE - NIGHT 104   104  Cogsworth hops up the spiral staircase and out onto the   *  turret.   He spots the beast, perched among the gargoyles.   *  COGSWORTH Pardon me, master.   I’m sorry to   *  disturb you, but --   *  THE BEAST   *  She’s not coming back.   *  COGSWORTH   *  No... the castle is under attack!   *  THE BEAST   *  It doesn’t matter now.   Just let them   *  come.  EXT. TERRACE - CASTLE - NIGHT 106   106  The battering ram smashes against the door. MOB  Kill the beast!   Kill the beast!  INT. FOYER - CASTLE - NIGHT 107   107  The door is giving way, the mob is too strong. MRS. POTTS This isn’t working! LUMIÈRE I know what to do.   *  85.",
      "dialogue_count": 0,
      "word_count": 424
    },
    {
      "scene_number": 12,
      "slugline": "EXT. TERRACE - CASTLE - NIGHT 108   108  The battering ram smashes again. MOB  Kill the beast!   Kill the beast!  INT. FOYER - CASTLE - NIGHT 109   109  The castle staff has now vanished, their barricade dismantled. A series of bolts on the door slide open one by one, top to bottom.   The door unlocking itself...  EXT. TERRACE - CASTLE - NIGHT 110   110  The battering ram smashes the door one last time -- MOB  Kill the beast!   Kill the beast!  The door swings open easily and the mob tumbles inside, to find:  INT. FOYER - CASTLE - NIGHT 111   111  It’s EMPTY.   Met by eerie silence, Gaston and the mob cautiously enter.   The door barely hangs on its hinges. Villagers hold up torches.   The flickering light reveals FURNITURE.   Chairs.   A coat rack.   A feather duster.   A candelabra.   A tea pot and teacup.   A harpsichord. LEFOU Are you not the least bit concerned that   *  this castle might be haunted?   *  GASTON Don’t lose your nerve, LeFou. Gaston looks into the mirror.   ANGLE ON LeFou -- he notices   *  Mrs. Potts.   Brings his torch close to study her. ANGLE ON THE MOB -- among them, Jean the potter stares at the eerie castle foyer -- JEAN This place seems familiar... like I’ve   *  been here before...   *  Gaston approaches the west wing stairs.   LeFou brings his face down to the tea pot and teacup.   *  LEFOU   *  You must be the talking teacup.   And   *  you   must be his grandmother.   *  Mrs. Potts’ EYES open.   Furious.   *  86.",
      "characters": [],
      "action_text": "MRS. POTTS   *  Grand- mother?   ATTACK!   *  LeFou jumps back.   ALL HELL BREAKS LOOSE as the furniture comes   *  alive.   Chairs kick the shins of several villagers.   Plumette feathers villagers’ faces furiously, causing them to have sneezing fits.   As other villagers funnel in, the “Lend-a-Hand” lights outside the door bonk several of them on the head. They’re alive after all. Chapeau spins Gaston around and is about to land a blow when   *  GASTON GRABS LEFOU and puts him in the line of fire.   LeFou   *  becomes a human punching bag as Cadenza approaches and rears   *  up on his hind legs.   His shadow falls across Gaston, who   *  dives out of the way -- leaving LeFou exposed.   *  LEFOU   *  Gaston!   *  Cadenza comes crashing down on LeFou, squashing him flat.   *  Gaston looks down at his friend.   *  LEFOU (CONT’D)   *  (weak, muffled)   *  Gaston... help...   *  Gaston looks from LeFou to the enchanted mirror, then to the   *  grand staircase.   *  GASTON   *  Sorry, old friend.   It’s hero time.   *  Gaston rushes up the staircase.   Lefou passes out.   *  INT. VILLAGE OF VILLENEUVE - NIGHT 112   112   *  Monsieur d’Arque paces in the square, when he notices the   *  door to the asylum wagon is ajar.   He runs to the wagon and   *  flings open the doors, only to find it empty.   D’Arque slams   *  the doors shut -- and there’s Maurice, smiling beside him.   *  MAURICE   *  Hello.   Oh, I believe this is yours.   *  Maurice casually hands the wagon’s padlock to Monsieur   *  d’Arque -- just as Belle rides past on Philippe!   As she   *  charges out of the village gates, she tosses her ball gown to   *  the ground.   *  Maurice waves to her proudly, then turns back to d’Arque.   *  MAURICE (CONT’D)   *  She’s very headstrong.   Do you have   *  children?   *  Off d’Arque’s confusion --   *  OMITTED 113   113  87.",
      "dialogue_count": 0,
      "word_count": 577
    },
    {
      "scene_number": 13,
      "slugline": "INT. FOYER - CASTLE - NIGHT 117   117   *  LeFou, bruised but alive, opens his eyes, sits up -- when   *  Plumette furiously begins feathering his face.   *  PLUMETTE   *  (laughs)   *  No one to protect you now, eh?!   *  LeFou swats -- and Plumette flies away, laughing.   *  INT. TURRET STAIRCASE - CASTLE - NIGHT 119   119  Gaston finds himself at the landing of two staircases. Unsure which one leads to the beast, he holds up the mirror, which illuminates the right way.   Gaston bounds up them.  INT. FOYER - CASTLE - NIGHT 120   120  Chip rapidly fires saucers at attackers, counting them off as   *  he dispatches them with glee.   *  CHIP   *  One!   Two!   Three!   Four!   Five!   *  Above, Cogsworth looks down from the balcony, a tinhorn   *  general surveying the battlefield.   *  COGSWORTH   *  Good show, Chip my boy!   *  Just then, a platoon of books arrives on the large table from   *  the library, battle-ready.   *  COGSWORTH (CONT’D)   *  Excellent!   The infantry’s arrived.   *  Now go and teach them a   lesson !   *  The books rocket down into the fray, thwacking villager after   *  villager.   *  COGSWORTH (CONT’D)   *  Yes, those are called   books , you third-   *  rate musketeers!   *  This draws the attention of Tom, Dick and Stanley.   Cogsworth   *  shudders --   *  COGSWORTH (CONT’D)   *  Oh, I’m off!   *  -- and jumps down from the balustrade, as they bound up the   *  stairs.   They face off against Cogsworth, and he backs up   *  quickly.   *  COGSWORTH (CONT’D)   *  Ah, terribly sorry, pardon me, I’m   *  just a clock!   *  88.",
      "characters": [],
      "action_text": "Suddenly, Garderobe leaps out, blocking the brutes’ path, and   *  unfurls her fabric, wrapping them up.   *  GARDEROBE   *  Yes, that’s it... put it on...   pretty   *  little boys !   *  Tom and Dick look at each other and shriek, horrified at their   *  girly make-overs.   Stanley, however, doesn’t seem to mind his   *  new look.   Garderobe cackles.   *  GARDEROBE (CONT’D)   *  Go!   Be free!   Be free!   Be FREE! 121   121   *  EXT. WOODS - NIGHT 122   122  Belle on Philippe.   She whips past the withered tree and down the path toward the castle grounds. OMITTED 124   124  OMITTED 124A   124A  OMITTED 124B   124B  INT. FOYER - BALCONY - CASTLE - NIGHT 126   126  From the balcony, Mrs. Potts leaps onto a chandelier --   *  MRS. POTTS   *  How do you take your tea?!   Piping   *  hot?!   Or   boiling ?!   *  -- and douses villagers below with boiling water.   She looks   *  down -- seeing Jean the potter -- and gasps.   *  MRS. POTTS (CONT’D)   *  Mister   Potts ?!   *  Suddenly, Mrs. Potts slips and drops down towards the floor.   *  Jean the potter looks on in confusion.   Chip looks on in   *  terror.   *  CHIP   *  Mama!   *  But just as she’s about to shatter, she is caught by a pair   *  of human hands.   Mrs. Potts gazes up at -- LEFOU, who seems   *  as surprised as she does.   *  MRS. POTTS   *  Oh!   Thank you.   *  Suddenly, two villagers charge at LeFou from either side.   *  LeFou ducks, the villagers wallop one another, Mrs. Potts   *  spits hot water in their faces, and LeFou punches one out to   *  finish the job.   *  89. MRS. POTTS (CONT’D)   *  Nicely handled!   *  LEFOU   *  Well I used to be on Gaston’s side,   *  but we’re in a bad place right now.   *  MRS. POTTS   *  You’re too good for him anyway...   *  LeFou nods, emotional.   *  MRS. POTTS (CONT’D)   *  Shall we get back to it, then?!   *  Below, Cadenza bucks and rages against villagers, besting   *  them repeatedly as he plays elaborate trills.   *  CADENZA   *  Such sweet music!   H",
      "dialogue_count": 0,
      "word_count": 3151
    },
    {
      "scene_number": 14,
      "slugline": "EXT. TERRACE - CASTLE - DAWN 140   140  A wonderful emotion-filled reunion.   STABLE BOYS, KITCHEN MAIDS, ARTISANS, GROUNDSKEEPERS, GUARDS, and SEAMSTRESSES are reunited in human form. Among the happy villagers, we find Cogsworth. CLOTHILDE (O.S.) Henry? He spins to see Clothilde - his wife.   Gulp. COGSWORTH Oh.   DEAR!   *  She hugs him.   *  CLOTHILDE   *  I’ve been   so lonely.   *  He shuts his eyes tight and whispers to himself:   *  COGSWORTH   *  Turn back into a clock... turn back   *  into a clock...   *  Lumière and Plumette embrace, then...   *  PLUMETTE Lumière, look! LUMIÈRE   *  Oh, my Prince!   *  BELLE AND THE PRINCE emerge.   He rushes to Lumiere.   *  THE PRINCE   *  Hello, old friend.   *  Lumiere is taken aback by the warm embrace of his master.   *  LUMIÈRE   *  It’s so good to see you!   *  Belle and the Prince are surrounded by the staff.   Plumette   *  curtsies to Belle --   *  PLUMETTE   *  You saved our lives, mademoiselle.   *  -- As Chip runs up and hugs her tight.   *  CHIP   *  Belle, it’s me!   It’s Chip!   *  “BEAUTY AND THE BEAST”   starts to play.   *  99.",
      "characters": [],
      "action_text": "OMITTED 141   141  INT. BALLROOM - CASTLE - DAY 142   142  The entire village celebrates as Cadenza -- smiling with   *  dentures -- plays the harpsichord with his beautiful wife Garderobe singing. GARDEROBE  Tale as old as time Tune as old as song Bittersweet and strange Finding you can change Learning you were wrong  We glide past various familiar faces: LeFou; Lumière waltzing   *  with Plumette; Cogsworth with Clothilde; Chip and his father,   *  Jean the Potter... and finally Mrs. Potts.   She beams as she   *  watches Belle dance with the Prince, then crosses to   *  acknowledge Maurice, who sits at an easel, sketching the   *  celebration.   *  MRS. POTTS  Winter turns to spring Famine turns to feast Nature points the way Nothing left to say Beauty and the Beast  Belle runs her hand down the Prince’s smooth cheek.   *  BELLE   *  How would you feel about growing a   *  beard?   *  He growls playfully.   As they laugh, we PULL OUT to reveal   *  the ballroom in all its restored splendor.   *  ALL (V.O.)  Certain as the sun Rising in the East Tale as old as time Song as old as rhyme Beauty and the Beast  CUT TO: BLACK. OMITTED. 143   143  100.",
      "dialogue_count": 0,
      "word_count": 392
    }
  ]
}