{
  "slug": "belle-2013",
  "title": "belle",
  "genre": "drama",
  "format": "film",
  "scenes_count": 6,
  "characters_count": 1,
  "characters": [
    "DIDO"
  ],
  "total_words": 20069,
  "total_dialogue": 1,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. KENWOOD HOUSE. STAIRS/ENTRANCE HALL/GALLERY - DAY. 2 7   7   * ON ELIZABETH seated at the grand staircase as LADY MARY and DIDO emerge. Like ELIZABETH, DIDO is now freshly dressed in rich silks, an adorable sight as they move through corridors ELIZABETH Are you...a nee-gro? ELIZABETH makes her way across...taking her aunt’s hand as all three walk. DIDO is silent. ELIZABETH (CONT’D) Are you what they call ‘a negro?’ I heard them talking. LADY MARY Questions, questions, Elizabeth! Tis a most irritating trait you and your father share. ELIZABETH Papaa M? LADY MARY No your blood papaa. Sir David Murray.   You should not insist on always speaking your mind, you know. You will end up an old maid with only your own company for entertainment! ELIZABETH Like you, Aunt Mary? That is what the maids say? LADY MARY You little.... ELIZABETH takes off. LADY MARY rushes after her. DIDO is left alone - through the doorway of the gallery, a portrait of LINDSAY stares at her.   She gazes at it. LORD MANSFIELD approaches, arrested at the sight of DIDO, newly tidied. He follows her gaze to LINDSAY’S image. The sight affects him, unexpectedly. LORD MANSFIELD Captain Sir John Lindsay. (off her reaction) Do you recognise him? She nods. A beat as conflict fills him. 6.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 217
    },
    {
      "scene_number": 2,
      "slugline": "INT. KENWOOD HOUSE. GALLERY. CONTINUOUS. DAY 2 8   8   * LORD MANSFIELD D’you see here...? This..this is your grandfather, Sir Alexander Lindsay of Evelick. DIDO examines the painting. LORD MANSFIELD watches her. LORD MANSFIELD (CONT’D) I am here too....do you see? Her eyes search the long line of her aristocratic heritage, until her gaze settles. He chuckles, reluctantly charmed as she points to his likeness. LORD MANSFIELD (CONT’D) Yes...I am William Murray, First Earl of Mansfield. A beat as he looks to her, affected by this little person. Gently, he leads her to a final portrait. LORD MANSFIELD (CONT’D) (carefully) Now...do you see this man?   He is my nephew...do you understand...? (off Dido’s nod) ...your uncle - Sir David Murray. DIDO Elizabeth’s papa. He pauses LORD MANSFIELD You are a sharp little one. He is The Seventh Viscount Stormont... (beat. Almost to himself) ...to inherit everything that we are standing on when I am gone. She nods, bites her lip - that much has gone over her head...he can see. He closes his eyes. The enormity of this new responsibility weighing heavy. INT. KENWOOD HOUSE. LADIES PARLOUR/LAWNS - DAY. 2 9   9   * LORD MANSFIELD’s POV: through window - The lawns. ELIZABETH gently takes DIDO’S hand in hers, leads her off to run between the trees. As their delighted screams filter... LADY MANSFIELD enters - observes LORD Mansfield, a moment. LADY MANSFIELD Born on English soil? 7.",
      "characters": [
        "DIDO"
      ],
      "action_text": "LORD MANSFIELD Indeed. He discovered her mother aboard a captured Spanish slave ship.   He was charged with conveying it back to these shores, he tells me. LADY MANSFIELD Evidently he had some...‘feeling’ for the woman. LORD MANSFIELD (dry) And there I was believing it was sheer lack of ‘self control’. (scathing) He has been at sea, six years. All of this child’s life! LADY MANSFIELD Well, he clearly saw to their wellbeing. The child is not altogether uncivilized. (she breathes deeply) So...now we have two nieces in our guardianship. LORD MANSFIELD (reticent) Elizabeth was much in need of a companion. LADY MANSFIELD And that is what we shall say when questions are asked of us? LORD MANSFIELD We shall say that in accordance with her birthright, she is entitled to live beneath this roof. (with irony) Such...is the nature of ‘order’. LADY MANSFIELD And where in this ‘order’ should her colour be placed? Below or above her Murray bloodline? (off his silence) May she dine with us? LORD MANSFIELD She may...(pause)...NOT...in company. We cannot escape society’s confines on etiquette LADY MANSFIELD Marriage? 8. He shakes his head at the complexity of it all. LORD MANSFIELD Impossible.   Any match her..’other origins’ may attract would surely disgrace her and the family rank. LADY MANSFIELD And when we are no longer here? No husband - who will take care of her? He rubs his eyebrows, perturbed, turns back to the lawns. EXT. KENWOOD HOUSE. LAWNS - CONTINUOUS. DAY.2/3 10   10   * A view across the idyllic estate. SOUNDS of children’s shrieks have become adult. CAPTION: 1781 A twenty year old DIDO darts between trees. DIDO Bette! No...no surprises Bette! ELIZABETH, also twenty now, suddenly jumps from behind the willows, causing DIDO to wail hysterically. LADY MARY stands at the doorway of the old nursery. LADY MARY (shrieking) Girls! Will you refrain from shrieking like the...bless-ed French! The girls race towards the house. ELIZABETH’S blonde colouring remains, whilst DIDO’S l",
      "dialogue_count": 1,
      "word_count": 2212
    },
    {
      "scene_number": 3,
      "slugline": "INT. KENWOOD HOUSE. DRAWING ROOM. CONTINUOUS - NIGHT. 4. 25   25   * A single figure -   at the farthest end of the crimson drawing room...DIDO’S heart skips a beat at the SOUND of the approaching dinner party...Suddenly the doors open ...DIDO stands quickly - nervous. LORD MANSFIELD Dido...my dear. LADY ASHFORD (whispers to her sons) Good Lord - the negro! She really is... JAMES ASHFORD (quietly disturbed) ...a lady. OLIVER Capital! LADY ASHFORD I hadn’t expected her to look so...black. OLIVER Mamaa, did you not listen to the rumours when you were spreading them? DIDO curtseys respectfully to LORD MANSFIELD. LORD MANSFIELD May I present to you the second of my nieces - Miss Dido Lindsay. DIDO curtseys. LADY ASHFORD nods graciously. OLIVER bows - has to nudge his troubled brother do the same. OLIVER A pleasure, Miss Lindsay. She curtseys once again, then moves to sit with ELIZABETH. ELIZABETH (sotto - re. James) He is the eldest - to inherit the entire Ashford fortune.   He is also to inherit from his uncle - a healthy man, who shows little sign of departure. DIDO How do you know? 18.",
      "characters": [],
      "action_text": "ELIZABETH Lady Ashford herself.   She seems rather despondent at her brother’s robust constitution. JAMES catches DIDO’S soft brown eyes resting on him. DIDO He has much to recommend him. And a second fortune in life should please any wife. ELIZABETH clocks the gaze between DIDO and JAMES. ELIZABETH Dido! You are not to be a coquette with him! You already have your fortune! DIDO Are you suggesting I now condescend to a gentleman without means, Bette?! What should good society think of us! OLIVER moves to his brother, follows his gaze to DIDO. OLIVER She is intriguing, is she not? JAMES I find her repulsive. OLIVER I suppose she is...if you find a most rare and exotic flower so. She is quite something to behold. ON DIDO as she falters under the brothers’ stares. ELIZABETH (flustered, to DIDO) Good Lord! They are appraising me! ELIZABETH composes herself. JAMES’ eyes remain on DIDO, swallowing hard at her undeniable beauty. JAMES One does not make a wife of the rare and exotic, Oliver. One samples it on the cotton fields of the Indies... OLIVER So far, when it is right at my door? 19. JAMES ...Then finds a pure ENGLISH rose to decorate one’s home. OLIVER smiles. OFF both men - trained on DIDO. INT. KENWOOD HOUSE. DRAWING ROOM - NIGHT 4. 26   26   * ELIZABETH is at the pianoforte. She sings, plays hard, for JAMES’ attention, gazing up at him as he stands beside her. LADY ASHFORD Is she ‘OUT’?? LADY MANSFIELD (embarrassed) Not quite. LADY MARY (awkward) Any day now. LADY ASHFORD raises an amused eyebrow -   precocious creature!  OLIVER offers DIDO a discreet smile, as she sits beside LORD MANSFIELD. His mother quietly moves across to him. LADY ASHFORD You will refrain from any intercourse with the negress. (beat) Lord and Lady Mansfield may find it fascinating to have a Lady Mulatto running around their household, but I will not have one running around mine! OLIVER She is an heiress. A seamless change of heart for LADY ASHFORD. LADY ASHFORD Although exceptions can be ma",
      "dialogue_count": 0,
      "word_count": 4074
    },
    {
      "scene_number": 4,
      "slugline": "INT. KENWOOD HOUSE. LADIES’ PARLOUR. DAY.7 46   46   * LADY MANSFIELD shakes her head. LADY MANSFIELD Lord knows I will need you both to keep each other out of trouble. INT. KENWOOD HOUSE. DRAWING ROOM - DAY.7 47   47   * DIDO Papaa... LORD MANSFIELD You are not to be denied, Dido. He looks down. DIDO’S eyes follow to a large bunch of keys. DIDO Papaa, please! LORD MANSFIELD These are the keys to the house. They have hung at the waist of your aunt for the last thirty years. DIDO (horrified) No! I am not Lady Mary. I am not an unwanted maid! LORD MANSFIELD feels no choice but to go on. LORD MANSFIELD Lady Mary is too old to continue in charge of the house. He places the keys in her hand and closes her fingers. LORD MANSFIELD (CONT’D) You may assume her duties on your return. A most respectable position for an unmarried Mansfield Lady. She stares at him, disbelieving, bereft... DIDO Are...are you punishing me? LORD MANSFIELD Punishing you!!   Dido, you are most cherished. Most loved. Why ...why would you say such a thing? DIDO Because... 38.",
      "characters": [],
      "action_text": "She tries to find courage to speak. LORD MANSFIELD waits. DIDO (CONT’D) Because ... She swallows hard...loses courage... LORD MANSFIELD Because what? A moment. He looks down, sees the bright red wax from his seal on her fingers. ON his slow dawning. Ominous beat. INT. KENWOOD HOUSE. GROUND FLOOR CORRIDORS - DAY.7 48   48   * ELIZABETH steps from the ladies’ parlour - DIDO from the drawing room, winded with emotion.   As they fall into each other’s arms, weeping... ELIZABETH I am sorry, Dido. So very sorry. INT. KENWOOD HOUSE. DRAWING ROOM. DAY. 7 49   49   * LORD MANSFIELD stands alone restraining his tears. INT. KENWOOD. LORD MANSFIELD’S STUDY. DAY. 8 50   50   * LORD MANSFIELD’s eyes are wild. JOHN stands before him. LORD MANSFIELD You told her they were wantonly drowned. JOHN Because they were! Those slaves were diseased - some were already dying - yes. But it was essential they die ON the journey or they would not come under insurance consideration! Neither too, if they had expired of their diseases - That is why they were killed - this we all know! LORD MANSFIELD You have entered my home and utterly taken advantage of the confidential matters afforded you. JOHN These ‘matters’ have been for public consumption for months. Miss Lindsay is no child...no.. fool! 39. LORD MANSFIELD (incandescent) Her precious care is in my hands and I will decide when she is ready for such realities. Not the son of a vicar! A vicar who, incidently purchased his living from me! JOHN I shall gather my belongings. LORD MANSFIELD Do so! LORD MANSFIELD turns his back on JOHN to glare at the lawns JOHN calmly collects his books, jacket, hat.   He hesitates. JOHN Your Lordship, a question? LORD MANSFIELD swings round ready to bite.. LORD MANSFIELD WHAT, Mr Davinier! JOHN As the mere son of a vicar - I wonder whether the value you extend to your very precious mulatto niece - well I wonder if it amounts to MORE...or LESS than the thirty pounds insurance the traders are asking for each life t",
      "dialogue_count": 0,
      "word_count": 829
    },
    {
      "scene_number": 5,
      "slugline": "EXT. LONDON STREETS. DAY. 9 55   55   * Bloomsbury Square opens before us. As the carriage halts... ELIZABETH (O.C) Aren’t you quietly relieved? DIDO Relieved? ELIZABETH That you shan’t be at the caprice of some silly Sir and his fortune! (off Dido’s silence) The rest of us haven’t the choice! Not a chance of inheritance if we have brothers and forbidden from any activity that allows us to support ourselves. ELIZABETH sighs. ELIZABETH (CONT’D) (c’est la vie) We are but their property. OFF DIDO, affected. INT./EXT. BLOOMSBURY SQUARE ENTRANCE HALL - DAY. 9 56   56   * LIBBY, the housekeeper and THOMAS, the butler stand on ceremony.   Maids help the Mansfield ladies as they disrobe. ON DIDO as her gaze falls on MABEL (20), a black maid helping ELIZABETH with her hat. A beat as DIDO stiffens. LADY MANSFIELD Light the fires for dinner, will you, Thomas. ON MABEL as she catches DIDO’S stare, forcing DIDO to avert her gaze quickly, turning her back to distance herself. INT. BLOOMSBURY SQ. DIDO AND ELIZABETH’S BEDROOM. NIGHT.9 57   57   * The soft light of oil lamps. DIDO, in night-clothes, drags a brush through tight ringlets. She stops, observes, a moment as ELIZABETH runs a comb through her own silken hair. DIDO You are so beautiful, Bette. I hope your match is the most wonderful of all gentlemen. 42.",
      "characters": [],
      "action_text": "ON ELIZABETH wide eyed, then moved as her eyes brim. A tentative knock and MABEL enters - DIDO becomes tense. MABEL speaks gently - strong Welsh accent. MABEL Some bed socks for you, Miss Murray, Miss Lindsay. It’s not as warm as we hoped tonight She hands a pair each to the girls. ELIZABETH, Thank you Mabel...How kind. MABEL pauses as DIDO struggles with her hair. MABEL Can I help you with that, Miss Lindsay? ON DIDO, self-conscious under MABEL’S stare. DIDO Mabel, I am fine - thank you! She struggles once again, wrenching the brush. MABEL You must start from the ends, miss. DIDO stares at her - a long beat. CUT TO: Candle lit faces... DIDO’s reflection in the mirror - her hair separated into four sections. In the reflection BG, ELIZABETH sits serenely watching MABEL brushing through each section from ends to roots. MABEL (CONT’D) My Mam taught me, see? DIDO stares at her a moment, some kind of pain resonates in her eyes as her face softens and she begins to relax. EXT. MAYFAIR. ASHFORD HOME.   DAY.10 58   58   * The four MANSFIELD ladies step from the carriage. Before them, a huge Georgian home.   All four take it in. LADY MANSFIELD Promise me you will change that vulgar teal paint, if you ever become lady of this home.   It is positively wanting, Elizabeth. 43. EXT. MAYFAIR. ASHFORD HOME. GARDENS. DAY.10 59   59   * A sophisticated landscape, very much in keeping with LADY ASHFORD’S sense of style. A maid steps out - LADY MANSFIELD follows with the four Mansfield women.   ELIZABETH beams. MAID Lady Mansfield, LADY MARY and their nieces, Madam. LADY ASHFORD moves towards them, face bright with ambition. LADY ASHFORD Ladies. LADY MANSFIELD Lady Ashford. The girls curtsey. LADY MANSFIELD (CONT’D) And the gentlemen? Mr James? LADY ASHFORD (reassuring) Here, of course. Very little could have prevented him, knowing that Miss Murray would visit today. ELIZABETH could burst.   She looks up to see JAMES and OLIVER approach from the North side of the gardens. CUT TO: The l",
      "dialogue_count": 0,
      "word_count": 2740
    },
    {
      "scene_number": 6,
      "slugline": "INT. ASHFORD CARRIAGE - NIGHT.11 62   62   * JAMES Penniless? LADY ASHFORD (disgusted) Without an inch of property, or shilling to her name! OLIVER chuckles. LADY ASHFORD rests her hand on JAMES’ knee. LADY ASHFORD (CONT’D) Your situation can attract so much better, James. She brings nothing but name. A real lady is blessed with SO much more. OLIVER (sardonic) Do you hear that, James? A lady’s good breeding alone will not do! LADY ASHFORD (to Oliver) Your brother needs a wife who will bring him further land! LOTS!... if he is ever to exert more political influence than your father has. JAMES But what of her own father? LADY ASHFORD The Seventh Viscount Stormont is a scoundrel. Ensconced in Vienna with the girl’s vicious step-mamaa and his new offspring - who I am told is to inherit EVERYTHING. She shakes her head, stares through the carriage window. LADY ASHFORD (CONT’D) I must say, pen-ni-less! Thankfully   her cousin is not. It is true that on each occasion I lay eyes upon that girl, she becomes more beautiful. OLIVER shifts, perturbed -   DIDO, indeed, on his mind.  JAMES She has the colouring of a farmer. LADY ASHFORD James, we do not talk about that, any longer. 55.",
      "characters": [],
      "action_text": "JAMES Is this really the very best you aspire to, Oliver? To introduce some woman of obscure birth into the family lineage? LADY ASHFORD James - you are my first boy - blessed by law to inherit your father’s wealth. Be sympathetic to your brother. Like the unfortunate Miss Murray - a good family name and empty pockets will only get him so far!! OLIVER closes his eyes, privately humiliated. INT/EXT. BLOOMSBURY SQ. DRAWING ROOM - DAY.12 63   63   * LADY MANSFIELD looks up from her embroidery - SOUNDS of a carriage rounding into the square. At the window. LADY MANSFIELD Good heavens, Lord Mansfield has arrived a day early! LADY MARY moves quickly to look down on the street. Her POV: below, LORD MANSFIELD’S carriage outside. LADY MARY (calls out) Mabel! Freshen the flowers! INT./EXT. BLOOMSBURY SQ. ENTRANCE HALL - DAY.12 64   64   * A trunk hits the flagstone. A FOOTMAN enters with another. INT. BLOOMSBURY SQ. BREAKFAST ROOM. DAY.13 65   65   * A beautifully laid out breakfast - A spray of purple lavender, silver and porcelain. MABEL smiles privately at DIDO as she lays some bread on the table.   DIDO watches her leave. DIDO looks to the newly arrived LORD MANSFIELD, as he sits. DIDO (facetious) Is Mabel a slave? LADY MANSFIELD almost chokes on her porridge. LORD MANSFIELD I beg your pardon? 56. DIDO Is-Mabel-a-slave! LORD MANSFIELD swallows hard, his jaw tightens. LORD MANSFIELD She is free and under our protection. DIDO (twice as facetious) O! Like me! ELIZABETH Hardly, Dido! LORD MANSFIELD And paid a very respectable wage. DIDO takes a mouthful of breakfast, goads her father further. DIDO How is the fraud appeal Papaa? LORD MANSFIELD Fraud? DIDO The marine insurance. It is a Fraud case, is it not? LORD MANSFIELD That would depend on to whom you may speak. DIDO To cull your ‘cargo’? To do it solely to claim insurance because it was too diseased to achieve a good price at market? If not fraud, then what? LORD MANSFIELD Do you speak on my behalf, Dido? LADY MANSFIELD Oh",
      "dialogue_count": 0,
      "word_count": 9997
    }
  ]
}