{
  "slug": "big-little-lies-105-once-bitten-2017",
  "title": "big little lies 105 once bitten",
  "genre": "action",
  "format": "series",
  "scenes_count": 6,
  "characters_count": 0,
  "characters": [],
  "total_words": 10421,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. GUN-RANGE - DAY 501   501 NATHAN is on the shooting range with HIS SILVER GUN.   As he re-loads, we hear someone else starting to shoot a gun: BANG! Times five again. Nathan looks at his neighbor’s target: a thin paper blow-up of THE SILHOUETTE OF A MAN.   The neighbor is a pretty good shot... three bullet holes on the forehead, one on the bridge of the nose, one on the cheek. Nathan peeks in, surprised to find a female neighbor, and at a second glance... Jane. CLOSE ON SAMANTHA SAMANTHA I think guns are sexy. (then) I don’t say it in public. (then) Especially Glocks. EXT. CREST COMMUNITY THEATER - MORNING 501A   501A BANG!   This time, it’s not a gun but a door that is being shut!   MADELINE DEBOARDS HER SUV, heads for the staircase that we know.   Again, its entrance is blocked.   And again, Madeline doesn’t care.   She rips the “Do Not Cross” construction ribbon and walks up the stairs as we hear the cast of “AVENUE Q” belting out... CAST (V.O.) (singing) Nothing lasts/ Life goes on/ Full of surprises/ You’ll be faced with problems of all shapes and sizes. INT. CREST COMMUNITY THEATER - CONTINUOUS 501B   501B Wet Tech rehearsal continues.   THE ENTIRE ENSEMBLE IS ON STAGE SINGING “FOR NOW.” CAST (singing) You’re gonna have to make a few compromises/ But only for now. JOSEPH BACHMAN stands in an aisle, watching the above. (CONTINUED) BLL EP 5 \"Once Bitten\" - PRODUCTION DRAFT - 3-8-16   3.",
      "characters": [],
      "action_text": "THE SONG CONTINUES as Madeline enters, observes, approaches Joseph.   The body language is telling. MADELINE Does that mean we’re on? JOSEPH (without looking at her) Mayor just gave the okay. MADELINE Fantastic!   Wow! She squeezes his arm in a friendly fashion, wants to express her excitement in some way, “high five” or something, but Joseph doesn’t move a finger. JOSEPH (still not looking at her) Yep. A beat.   An early winter frost.   Okay.   Madeline gets it and leaves. INT. BLUE BLUES - DAY 502   502 JANE is sipping a coffee as Madeline arrives. MADELINE (V.O.) The shooting range? Both of them are now seated and in the middle of a conversation. JANE He came up to say hello.   He was very nice. MADELINE Why were you there? JANE I try to go once a month.   Target practice. Madeline wonders, hides behind her coffee cup. JANE (CONT’D) You seem suspicious. CONTINUED: 501B   501B (CONTINUED) BLL EP 5 \"Once Bitten\" - PRODUCTION DRAFT - 3-8-16   4. MADELINE We’re planning this little road trip to meet your rapist, and you’re taking target practice... (ironic) I’m not suspicious at all. JANE (fighting a smile) I don’t plan to shoot the man. MADELINE I’m not a big believer in guns to begin with.   That’s something Nathan and I used to get into, his gun thing.   All those mass shootings we have... I don’t know. JANE It’s actually helped me.   Owning a gun.   They say just holding one in your hand has psychological benefits for emotional trauma. MADELINE Really? JANE It inhibits mentalization.   Helps you block yourself off from emotions. MADELINE And that’s a good thing? JANE If the memories are painful enough, yes. (off Madeline) I feel stronger when I hold a gun. More invincible. CLOSE ON SAMANTHA SAMANTHA I’ve held one once, a loaded one, I didn’t even shoot, and I must admit... it turned me on. CONTINUED: 502   502 (CONTINUED) BLL EP 5 \"Once Bitten\" - PRODUCTION DRAFT - 3-8-16   5. CLOSE ON GABRIELLE GABRIELLE For all we know, Jane was packing every time she came to s",
      "dialogue_count": 0,
      "word_count": 1595
    },
    {
      "scene_number": 2,
      "slugline": "EXT. RENATA’S HOUSE, BACKYARD - DAY - LATER 508   508 Renata and Gordon, both fraught. GORDON A lawyer isn’t the answer.   Maybe we should just take her out, put her in a private school-- RENATA Why should she be the one to go, it should be that little felon. GORDON Renata-- RENATA If you tell me to calm down, I swear-- GORDON Can you take a breath?! RENATA Why aren’t you more upset? GORDON I am very upset. RENATA Well, I don’t see it, Gordon! GORDON Do not make this a referendum on my anger, alright?   That somebody has been hurting her, for who knows how long, that we haven’t known about it, or that we can’t stop it, or that she won’t even talk to us, do not pull out your fucking scorecard to total up who’s got the most anger. RENATA The problem is yours is for me, when it should be directed at whoever is mutilating our daughter! GORDON (about to explode) You listen to me-- (CONTINUED) BLL EP 5 \"Once Bitten\" - PRODUCTION DRAFT - 3-8-16   11.",
      "characters": [],
      "action_text": "RENATA No, I will not, I listened to you the last time!   There’s something wrong with Amabella!   But you didn’t want to hear about that.   I wanted to take her to a psychiatrist but you thought no, better to whisk me into your office bathroom -- where you could fuck me on top of the sink! GORDON Stop screaming at me!!   Goddamn you! It’s gone too far for both of them now.   A beat.   They’re both quaking with rage, fear... and both are struggling; Renata sees as much and gathers herself. RENATA (quietly) Whether it’s talking to a lawyer, a child psychiatrist, the teacher, all of the above... we’ve got to do something.   My god, that’s the essence of parenting, keeping your child safe.   We’re not doing that, Gordon. CLOSE ON HARPER HARPER Renata blamed herself.   The hours she worked... my question was: where was the nanny? She waits for an answer that doesn’t come. HARPER (CONT'D) Where was she? ED (V.O.) Yeah! INT. MADELINE’S HOUSE - KITCHEN - DAY 508A   508A Madeline and Ed are about to do it right there in the kitchen, among the grocery bags, as they’re getting undressed.   They don’t have Celeste and Perry’s swagg, but they are going for it. CONTINUED: 508   508 (CONTINUED) BLL EP 5 \"Once Bitten\" - PRODUCTION DRAFT - 3-8-16   12. ED You sure you don’t want to go on the couch, or in the bed? MADELINE You complained we hardly had sex. Just shut up and fuck me, Ed. As he’s about to try to, we hear the front door opening. CHLOE (O.S.) It’s me. Fuck.   Madeline and Ed dress up in a flash and start unloading what's left of grocery bags to unload, as Chloe arrives in the kitchen, aims for the fridge. MADELINE What’s up, baby? CHLOE (her head in the fridge) I’m hungry. ED Don’t they have food at your friend’s place? Chloe shoots her dad a look.   Madeline fights a laugh. CHLOE Today’s grocery day.   So before the human crusher eats everything, I wanted to-- Chloe stops herself in her tracks.   Looks at her mother. Madeline’s mood just changed.   Chloe seemed to have ",
      "dialogue_count": 0,
      "word_count": 4543
    },
    {
      "scene_number": 3,
      "slugline": "INT. OTTER BAY ELEMENTARY, NIPPAL’S OFFICE - DAY 523   523 Jane, Emily Barnes and Principal WARREN NIPPAL are seated in the tiny office. NIPPAL Unfortunately Amabella won’t say who’s involved.   However, her mother is convinced that Ziggy is responsible. Jane gulps. NIPPAL (CONT’D) But I’m not.   Nor is Mrs. Barnes. Look, if it weren’t for the incident on orientation day, I wouldn’t have called you in until we had anything more definitive. Jane nods.   Waits. NIPPAL (CONT’D) Is there anything out of the ordinary in Ziggy’s past, his home life, his background, that you think we should know, that might be relevant?   I understand that Ziggy’s father is not involved with his upbringing, is that right? A long beat.   Jane just stares.   Then-- JANE Well, is this relevant?   All I know about Ziggy’s father is that he was keen on erotic asphyxiation and raping women. INT. BLUE BLUES - DAY - LATER 524   524 Madeline chokes while drinking her coffee as she sits in front of Jane. MADELINE You didn’t say that? (CONTINUED) BLL EP 5 \"Once Bitten\" - PRODUCTION DRAFT - 3-8-16   33.",
      "characters": [],
      "action_text": "JANE Of course, I didn’t.   But the thought of it, that it could get out one day, that Ziggy wasn’t the result of normal, loving sex, but the product of... rape... Jane sighs, shakes her head.   She seems to have a hard time with the word... and the memory of it. JANE (CONT’D) Every time I’m asked about Ziggy’s father, I’m always scared I’ll be exposed.   I thought the Kleins were about to spot me right there. MADELINE What do you mean? We hear a KNOCK on a door. INT. OTTER BAY ELEMENTARY, NIPPAL’S OFFICE - DAY - FLASHBACK 524A   524A We’re back with Jane, Emily Barnes and the principal as the SCHOOL SECRETARY puts her head in. SECRETARY Mr. And Mrs. Klein are here. The principal looks at his watch. MADELINE (V.O.) No? Renata appears at the secretary’s shoulder, catching sight of Jane, clearly ready to barge on in. RENATA We just wondered if you could fit us in. The principal jumps out of his seat. NIPPAL Is it possible you could come back later? RENATA I assume we’re all here to discuss the same topic, aren’t we? CONTINUED: 524   524 (CONTINUED) BLL EP 5 \"Once Bitten\" - PRODUCTION DRAFT - 3-8-16   34. Renata strides past the secretary and straight into the office, followed by Gordon. Jane gets to her feet. RENATA (CONT’D) (to Jane) You need to get that son of yours under control. GORDON Renata. (to Jane) Please, excuse my wife.   She’s very upset. He holds out a hand to Jane. GORDON (CONT’D) Gordon Klein. She takes it. JANE Jane Chapman. NIPPAL All right, well perhaps then, we could have a constructive chat.   Can I offer anyone tea, coffee, water? RENATA I don’t want refreshments.   I’ll tell you what I want.   I want her child to stay the hell away from my daughter. Jane stares Renata down.   And then it happens.   It looks like the tough woman is about to break down.   Renata is fighting tears so hard, Jane is startled to suddenly be feeling compassion for her.   Offers a tissue. INT. BLUE BLUES CAFE - DAY 524B   524B And we’re back at the cafe where it’s Madeli",
      "dialogue_count": 0,
      "word_count": 822
    },
    {
      "scene_number": 4,
      "slugline": "INT. CELESTE’S CAR - MONTEREY STREET - DAY 524C   524C Celeste parks her car, turns off the engine, looks at herself in the mirror, takes her purse, and applies some make-up on her face, her neck, her hand, until WE HEAR her cell phone ring. ANGLE ON THE PHONE: MADELINE is calling. Celeste doesn’t pick up and gets out of her car. EXT. CYPRESS HOSPITAL - PARKING LOT - DAY 525   525 Madeline is on her cell as she deboards her car, heads for the hospital. MADELINE Hey, call me back when you can.   We have to stop Jane from going on this trip, steal her car or something... INT. CYPRESS HOSPITAL - CORRIDOR - DAY 526   526 Madeline heads down the hospital corridor... MADELINE (V.O.) I thought she needed closure, now I’m thinking she wants revenge. ... unaware of Tori's   presence, Joseph’s wife, at the nurse station near by.   She spots Madeline who enters into-- INT. CYPRESS HOSPITAL - JOSEPH’S ROOM - CONTINUOUS 527   527 Joseph lies there, bandaged head.   Awake. MADELINE Hey. A beat.   What to possibly say?   Finally-- JOSEPH I’m okay.   They plan to release me on Wednesday. MADELINE That’s good.   Thank god. (CONTINUED) BLL EP 5 \"Once Bitten\" - PRODUCTION DRAFT - 3-8-16   37.",
      "characters": [],
      "action_text": "JOSEPH Are you okay? MADELINE Not even a scratch.   Lucky. Awkward silence. MADELINE (CONT’D) I’m sorry.   I feel that... maybe you were driving a little fast, a little less aware, because of-- JOSEPH I’m here because some kid ran a stop sign. More silence. MADELINE If I can help you get some clarity... did I have feelings? It seems hard to admit.   But she does.   With a nod. MADELINE (CONT'D) Do I still?   Maybe.   Like you said, I kissed you back.   But what I’m feeling most right now is fear. Paralyzing fear that what happened between us last year might get out. And ruin my family.   That it might destroy a love that goes to my core.   My love for Ed. Joseph stares back. MADELINE (CONT'D) Was it just sex between you and me, no.   And when you kissed me the other day, you brought back... I don’t deny it.   But whatever I felt, it doesn’t come close to being a fraction of what I feel, what I will always feel for my husband. Joseph just got more clarity than he was perhaps looking for.   A beat during which he nods. JOSEPH I think I’m going to ask you to beg out of the play. CONTINUED: 527   527 (MORE) (CONTINUED) BLL EP 5 \"Once Bitten\" - PINK - 3-13-16   38. The work’s basically done now anyway.   We should be fine. Of course.   Madeline looks like she was prepared for that reaction. MADELINE (no argument) You should. Silence.   Awkward.   Tori then enters. TORI Madeline. MADELINE (brightly) Well, he just looks so much better today, doesn’t he? CONTINUED:   (2) 527   527 JOSEPH   (CONT'D) (CONTINUED) BLL EP 5 \"Once Bitten\" - PINK - 3-13-16   38A. TORI Oh, yes.   I think we’re all doing better.   How are you feeling? MADELINE (a little too cheery) Honestly, I usually have some lower back pain, which I don’t have at all, I think the accident actually spared me a trip to the chiropractor. A joke, kind of.   A nervous joke.   A beat. MADELINE (CONT’D) (to Joseph) Well, anyway, I just came by to say hi and make sure you’re doing okay. I’m going to head out now. JOSEPH ",
      "dialogue_count": 0,
      "word_count": 661
    },
    {
      "scene_number": 5,
      "slugline": "INT. DR. AMANDA REISMAN’S OFFICE -   DAY 529   529 Dr. Reisman is seated in her chair, waiting for Celeste to speak, a smile on her face, almost like inviting her to speak. CELESTE He’s in Chicago.   Coming back tonight.   So I decided to come by myself. DR. REISMAN Okay. CELESTE It was Perry’s idea to come in, actually.   Which I take as a very healthy sign. We can read the doctor’s suspicion, as can Celeste. CELESTE (CONT’D) (trying a little too hard) Don’t you think that’s positive, that he would want to come in? DR. REISMAN (neutral) Why did Perry want to come in? CELESTE Well, same, you know, he’s troubled... we both are, that our lovemaking often seems to be bound up in some anger. Silence. DR. REISMAN Why did you want to come in today? Celeste takes a deep breath. A FLASH OF PERRY UP-ENDING THE ENTIRE BOX OF LEGOS OVER CELESTE’S HEAD. THE SHOCK AND HUMILIATION MAKES HER GASP. CELESTE I don’t know. DR. REISMAN Something happened? A beat.   Celeste shakes her head.   No. (CONTINUED) BLL EP 5 \"Once Bitten\" - PINK - 3-13-16   40.",
      "characters": [],
      "action_text": "A FLASH OF CELESTE GRABBING A HANDFUL OF LEGOS FROM HER LAP AND THROWING THEM AT PERRY’S FACE. CELESTE The usual, you know.   Before he left this morning... A FLASH OF PERRY SLAPPING CELESTE IN THE FACE. CELESTE (CONT’D) ... we made love. A beat during which Celeste smiles uncomfortably. A FLASH OF PERRY TAKING CELESTE FROM BEHIND, HOLDING HER HANDS BEHIND HER BACK, AS HE’S PENETRATING HER VIOLENTLY. CELESTE (CONT’D) It’s as if the passion is fueled, or at least enhanced, by rage.   And that might be a problem. (then) Is it? DR. REISMAN Well, I’m encouraged that you at least think of it as lovemaking. Because sex isn’t always that. Silence.   Celeste’s discomfort is evident. DR. REISMAN (CONT’D) Does the sex you have with Perry ever strike you as violent? A FLASH OF PERRY AND CELESTE TENDERLY KISSING EACH OTHER AFTER SEX. CELESTE No. Silence.   She’s withholding.   The Doctor knows it.   And Celeste knows that the Doctor knows it. DR. REISMAN Are you ever left with bruises? CONTINUED: 529   529 (CONTINUED) BLL EP 5 \"Once Bitten\" - PINK - 3-13-16   41. A beat. A FLASH OF CELESTE IN HER BATHROOM, APPLYING MAKEUP ON THE OBVIOUS BRUISES SHE HAS ON HER FACE, HER NECK, HER HAND... CELESTE Maybe... one or two... I can’t remember. She’s a good liar.   The doctor measures that.   Then-- DR. REISMAN Have you ever sustained bruises from something other than sex? This doctor knows.   She knows. CELESTE (deflecting) I don’t follow. The doctor lets Celeste squirm for a beat with the hollowness of her response.   Then-- DR. REISMAN Your husband said he grabbed you too hard sometimes.   Has he ever left a mark on you by grabbing you? CELESTE We have a very volatile relationship. Silence. CELESTE (CONT’D) I’ve left the occasional mark on him, too. DR. REISMAN By hitting him? CELESTE Yes. DR. REISMAN Hitting him first, or hitting him back? This doctor surely knows.   And she’s got Celeste right in the cross-hairs now.   There’s nowhere to run. CONTINUED:   (2) 529   529 (CONTINUED) B",
      "dialogue_count": 0,
      "word_count": 2441
    },
    {
      "scene_number": 6,
      "slugline": "INT. CELESTE’S CAR - DAY 538   538 As Celeste drives and keeps her eyes on the road, the twins, seated in the back, look outside and wonder... MAX Where are we going? Celeste doesn’t answer... just smiles... then... CELESTE You’ll see. INT. MADELINE’S HOUSE - KITCHEN - DAY 539   539 Chloe puts her ipod down on the counter and we now discover whose guitar is playing, the one from “Big Brother And The Holding Company”... and it keeps playing as Madeline, Ed, Abigail, Chloe and Ziggy set the table for dinner.   Like a happy, normal family.   That’s what Ziggy seems to be thinking as he looks at the others, with his smile that we know... INT. MONTEREY AIRPORT - DAY 540   540 Celeste and the kids arrive at the airport.   They walk in the hallway as we wonder what is she up to when suddenly Perry gets out of the arriving section and does a double take when he spots the twins and Celeste... who came to welcome him back. The kids run to their dad.   Hugs and kisses.   Father and sons walk to Celeste.   Perry has his kid look on his face. He knows he fucked up again.   But he’s so happy to see her there, so touched by the attention... that all he can do is to hug her.   And cry. INT. JANE’S PRIUS - NIGHT 541   541 Jane keeps on driving madly as she’s holding back tears when suddenly a police car is FLASHING ITS LIGHTS behind her... as we... CUT TO: BLURRY FLURRIES OF FLASHING LIGHTS; GLIMPSES OF DIFFERENT ELVIS PRESLEYS AND AUDREY HEPBURNS; (CONTINUED) BLL EP 5 \"Once Bitten\" - GOLDENROD - 4-11-16   53.",
      "characters": [],
      "action_text": "FLASHES OF NAKED BODY PARTS... OF A MAN AND A WOMAN.   HARD TO TELL IF THEY’RE HAVING SEX... OR TRYING TO KILL EACH OTHER.   AND WE... SMASH CUT TO BLACK CONTINUED: 541   541 (CONTINUED) BLL EP 5 \"Once Bitten\" - PINK - 3-13-16   53A. ... as Janis starts to sing her descent to hell, “ Ball And Chain ”.   End credits. TO BE CONTINUED CONTINUED:   (2) 541   541 BLL EP 5 \"Once Bitten\" - PRODUCTION DRAFT - 3-8-16   54.",
      "dialogue_count": 0,
      "word_count": 359
    }
  ]
}