{
  "slug": "big-little-lies-102-serious-mothering-2017",
  "title": "big little lies 102 serious mothering",
  "genre": "drama",
  "format": "series",
  "scenes_count": 2,
  "characters_count": 0,
  "characters": [],
  "total_words": 4245,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. CELESTE'S HOUSE - NIGHT 221   221 A spectacular floral arrangement sits on the table in the living room where Kelly is reading as Celeste enters. CELESTE (O.S.) Wow. KELLY They arrived just after you left. Double the price, I think, for night-time deliveries. Celeste joins Kelly and opens a card that was left on the table: \"You make me.   Perry.\"   * She smiles and SNAPS A PICTURE OF THE FLOWERS WITH HER CELLPHONE. KELLY (CONT’D) On a less-positive note... I believe I've failed you miserably. INT. CELESTE'S HOUSE, MASTER BEDROOM - NIGHT 222   222 Josh and Max are in the master bed, still awake, Harry The Hippo between them.   They immediately pretend to sleep when Celeste enters.   She walks to them. CELESTE I thought Harry was just a stupid stuffed animal for babies. Max pushes Harry on his brother’s side. MAX He is. They push each other back. Then-- JOSH Can we sleep with you tonight? CELESTE Again? They nod yes, and wait patiently for a response.   How can she resist?   She slides in next to them. (CONTINUED) BLL EP 2 \"Serious Mothering\" - YELLOW - 1-23-16   31.",
      "characters": [],
      "action_text": "CELESTE (CONT’D) Harry doesn't snore, does he?   I hear it's a problem with hippos. MAX Daddy snores. Max pretends to snore. CELESTE No, like this. She joins in.   And then Josh.   It’s a snoring impression contest.   When they stop... JOSH I wish Daddy was here. A beat.   It changes her mood. CELESTE Me, too.   But the four of us all together, we'll be okay. The boys don’t have a clue of what she’s referring to. They just stare at their mom as she lies next to them, and suddenly notices that Harry... is missing a leg. JOSH It was Max. MAX It was Josh. As they go on and fight, we CUT TO... INT. JANE’S PRIUS - ROAD BY THE OCEAN - MORNING 223   223 AN UNDEREXPOSED MOVING POV: THE SUN, THE OCEAN, THE COASTLINE... A FURTHER REMINDER: NATURE IS BEAUTIFUL BUT MAN-MADE.   THE IMAGE BECOMES PERFECTLY EXPOSED WHEN THE TAINTED WINDOW THROUGH WHICH WE WERE LOOKING COMES DOWN, THEN UP AGAIN... AND DOWN... CLOSE ON Ziggy, enjoying the wind on his face, as he’s playing with the electric window... JANE (O.S.) I think that's a bad idea.   As much as I appreciate it... CONTINUED: 222   222 (CONTINUED) BLL EP 2 \"Serious Mothering\" - FULL BLUE - 1-7-16   32. He looks at his mom... She's on her cell, talking and driving. JANE (CONT’D) If the birthday party is ruined and Ziggy's the root cause, it'll just make things worse for him. INTERCUT WITH MADELINE on her cell IN THE HALLWAY, hurrying about, getting ready to rush out the door with Chloe as ABIGAIL WALKS DOWN THE STAIRS. MADELINE Sweetie, people here just assume me to be the root cause of everything, you need not worry. (to Chloe) Hurry up. JANE (O.S.) I'd really prefer you just let Chloe go to the party-- ABIGAIL DROPS HER PURSE TO THE FLOOR; ALL KINDS OF SHIT FALLS OUT, INCLUDING AN UNMISTAKABLE LITTLE BOX. MADELINE FREEZES, as Abigail quickly scoops it all up. MADELINE (to Jane) Call you back. (abruptly) Chloe, to the car.   Now! The tone... They all know something's up. INT. MADELINE'S HOUSE, KITCHEN - LATER 224   224 ABIGAIL I",
      "dialogue_count": 0,
      "word_count": 2859
    },
    {
      "scene_number": 2,
      "slugline": "INT. MADELINE'S SUV - DAY 237   237 We hear the soft, beautiful MELODY again, played by an ACOUSTIC GUITAR.   Chloe is in the back, moving her head to the music that comes from the car speakers, as Madeline drives. CHLOE How can you not wanna make up on this song?   Come on! MADELINE Make up, yes, not make out, dummy. CHLOE It's what you guys do, when you get mad at each other, big hug, kiss, bang!   Everything's better again. MADELINE It's different with married people. CHLOE Why? MADELINE Because it just is, that's why. Don’t start with me. They both shake their heads and look away.   These two are so much the same.   A long beat.   Madeline looks from the rearview mirror to the road, to the car navigation screen which displays Chloe’s music playing: LEON BRIDGES,   RIVER . MADELINE (CONT’D) This is a beautiful song, honey. PERRY (V.O.) Hey, baby. INT. CELESTE'S HOUSE, MASTER BEDROOM - NIGHT 238   238 Celeste has just had a bath; she's wearing a bathrobe as she sips some tea in front of her COMPUTER SCREEN; SKYPING WITH PERRY.   INTERCUT BETWEEN THEM. CELESTE Isn't it like the middle of the night there? (CONTINUED) BLL EP 2 \"Serious Mothering\" - FULL BLUE - 1-7-16   46.",
      "characters": [],
      "action_text": "PERRY It is.   I'm having the usual insomnia adjusting to the time- zone.   Is that the bathrobe I bought you? CELESTE It is.   And thank you for the flowers, they're beautiful. He smiles; it's an admiring smile. PERRY I miss you. CELESTE Miss you, too.   And the boys miss you. PERRY How was their second day? CELESTE Fine, but a little more drama; that Ziggy boy tried to kiss Amabella Klein. PERRY What is wrong with that kid? CELESTE I think he was just trying to make friends with her.   You know how school is, it's all about being popular. (off his silence) Can you hear me? PERRY I can hear you.   I'm just looking at you, beautiful. CELESTE You're sweet. PERRY Do me a favor.   Take that robe off for a second. CELESTE Perry. CONTINUED: 238   238 (CONTINUED) BLL EP 2 \"Serious Mothering\" - FULL BLUE - 1-7-16   47. PERRY Come on, I need to help myself go to sleep, and you need to help me help myself. She just stares back.   Naughty boy.   But he does make her feel beautiful -- constantly, in fact. PERRY (CONT'D) Just let me look at my gorgeous wife for a second.   Ten seconds. CELESTE I'll give you five.   The boys are waiting for me downstairs. PERRY Make it a nice five. And she lowers her robe.   He smiles... but we see a flicker of... something.   His smile looks tempered. She looks up, SEES HERSELF IN THE MIRROR, SEES WHAT HE SEES: that bruise on her ribs.   Neither make mention of it; finally, as she re-covers herself-- CELESTE Okay.   That's all you get, naughty boy, you'll have to come home sooner if you want more. PERRY Sit for a second, come closer. She sits in front of the COMPUTER. PERRY (CONT'D) I love you.   Call me when you wake up? CELESTE I will. He kisses his index finger, touches the camera with it. Celeste kisses her index finger, does the same. EXT. RENATA’S HOUSE, DECK - NIGHT 238A   238A Renata sits with GORDON.   She is still livid.   A beat. GORDON We could take her out of the school if you’re that concerned. CONTINUED:   (2) 238   238 (CONTINUE",
      "dialogue_count": 0,
      "word_count": 1386
    }
  ]
}