{
  "slug": "big-little-lies-101-somebodys-dead-2017",
  "title": "big little lies 101 somebodys dead",
  "genre": "thriller",
  "format": "series",
  "scenes_count": 3,
  "characters_count": 0,
  "characters": [],
  "total_words": 9616,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. JANE’S PRIUS - MORNING 105   105 JANE CHAPMAN, twenty-four, behind the wheel, her tired old Prius idling behind the parked SUV.   There's a palpable fragility to Jane.   No makeup, no effort made to draw attention to herself.   A hint of anxiety on her face; through it all she oozes a fundamental kindness. JANE Ouch. STRAPPED INTO THE BACK SEAT, HER SIX-YEAR-OLD SON, ZIGGY. Big eyes, the image of innocence and gentility.   He could pass for a puppet. ZIGGY Did you hurt yourself? JANE No.   The lady tripped, she fell down. THE MITSUBISHI ZOOMS OFF after doing its stop at the intersection.   JANE PUTS ON HER SIGNAL, BEGINS TO NAVIGATE PAST THE PARKED SUV. ZIGGY Where are we going? JANE We don't want to be late for Orientation. ZIGGY But shouldn't we make sure the lady's okay? JANE Well... (then) You're right, we should. JANE PULLS THE PRIUS OVER, DEBOARDS, under-- EXT. ROAD BY THE OCEAN - CONTINUOUS 106   106 JANE (calling to Madeline) Are you okay? As Jane helps her up-- (CONTINUED) BLL - EP 1 \"Somebody's Dead\" - FULL BLUE - 1/7/16   6.",
      "characters": [],
      "action_text": "MADELINE I'm fine.   I just rolled my ankle a little. JANE You should probably get ice on it. MADELINE I've got to get to school.   My daughter's first day, they have a thing about tardiness. JANE At Otter Bay?   That's where I'm going, my son, Ziggy, is starting there. MADELINE Ziggy?   Like Ziggy Stardust?   What a great name. (indicating) That's my little Chloe, shrinking from embarrassment right there.   Are you new to Monterey? JANE Just moved here.   Two weeks ago. MADELINE I'm Madeline, by the way, Madeline Martha Mackenzie.   I only go by Madeline, but for some reason I always mention the Martha. JANE Jane.   Jane-no-middle-name Chapman. MADELINE I already like you, Jane-no-middle- Chapman.   You're an intrinsically nice person, I have a nose for this sort of thing. CLOSE ON BERNARD, forties. BERNARD What Madeline had was a nose for everybody else's business. CLOSE ON OREN, also forties. CONTINUED: 106   106 (CONTINUED) BLL - EP 1 \"Somebody's Dead\" - FULL BLUE - 1/7/16   7. OREN (times ten) Oh my god. INT. JANE’S PRIUS - MORNING 107   107 Jane drives, Madeline rides, her injured foot elevated above the dashboard. Chloe sits in the back, next to Ziggy. MADELINE I’m a stay-at-home myself so I’m glad to welcome another full time mother into the ranks.   It can be us against them sometimes, the career moms in this town, they put more into their various board meetings than they do parenting, trust me. CHLOE My Mom's an active talker. JANE I actually have a part-time job. MADELINE So do I, but it doesn’t really count, the over-under in this town is a hundred and fifty thousand. I work in the community theater twenty hours a week, so I’m an “under,” what do you do? JANE Bookkeeping. So I guess I’m an “under” too. CHLOE (to Ziggy) When I grow up, I’m going to run a massive Label.   Do you have plans? ZIGGY BLINKS HARD, TWICE: A NERVOUS TIC HE HAS WHEN THINGS JUST DO NOT COMPUTE. CHLOE (CONT’D) I'm effervescent, which makes for a good leader.   Do you have an adjecti",
      "dialogue_count": 0,
      "word_count": 6860
    },
    {
      "scene_number": 2,
      "slugline": "EXT. JANE’S TOWNHOUSE - NIGHT 122   122 A small, unloved building, some decay on the shingles.   But nothing looks too shabby when bathed in a full Monterey moon.   Jane’s on her cell, seated on the stairs of the porch, smoking, speaking with DI, her mother. JANE He was a little shaken up at first, said he never wanted to go back to school.   But he's okay now. DI (O.S.) Why would she accuse Ziggy? JANE I don't know.   She could have been confused, there were a lot of new faces... the thing is, she seemed truthful, it wasn't like she was a brat.   The mother was a little awful, but the girl seemed okay. DI (O.S.) Well, you can't possibly think Ziggy tried to choke her. JANE Of course not. DI (O.S.) So what's going to happen? JANE Well, the principal decided it's best to let it go, move forward, so that's what we're going to do. DI (O.S.) I still don't understand why you chose to move there... all alone. JANE I'm not.   I've already made friends, Mom.   Most of the people are really friendly. DI (O.S.) People need family in their lives, you know?   I really think you should come back here. (CONTINUED) BLL - EP 1 \"Somebody's Dead\" - FULL BLUE - 1/7/16   43.",
      "characters": [],
      "action_text": "JANE Jesus, Mom! Can we not get into that again?! (deep breath to calm herself) I'm gonna go check on Zig. Jane clicks off, takes a hit of... what is it, a joint... throws it away in the street, and walks inside... INT. JANE’S TOWNHOUSE - CONTINUOUS 123   123 ... into the living room where she stops in her tracks, looks around: a few boxes unpacked, nothing on the walls, furniture at its strict minimum, used, old, and a sink that leaks. One drop at a time. She takes her cell and dials. DI (O.S.) Hello? A long beat. JANE I’m sorry.   I love you, Mom. DI (O.S.) I love you too, hon... She doesn’t let her mom finish, hangs up again.   Seems to feel better now.   We do love this girl.   She walks to the couch, pulls out a hide-a-bed.   Sits on it a while, then rises, and disappears into the only bedroom of the house. INT. ZIGGY'S BEDROOM - NIGHT 124   124 ZIGGY LIES THERE ASLEEP as Jane stares at him. Even though it’s dark, we can’t help being touched by what we see: the colors, the posters on the walls, the toys, the brand new furniture, a six year old boy’s dream room.   Now we really love this girl. There's a certain magic to Ziggy while he sleeps.   All his innocence comes to the fore.   It hurts to think that this tender, sensitive boy will one day grow into a whiskered, broad-chested man thing.   Jane gently climbs onto the bed, lies next to him.   Studies that little face, counting the freckles.   And she can't help but wonder a bit.   Could he have done it?   Does anybody truly know their child?   After all... she then shakes the idea out of her head: \"don't think about that.\"   Almost on cue, Ziggy's eyes open and he's staring at her.   Into her. CONTINUED: 122   122 (CONTINUED) BLL - EP 1 \"Somebody's Dead\" - FULL BLUE - 1/7/16   44. JANE Hey.   Did I wake you? He says nothing.   Jane stares. JANE (CONT'D) Zig. ZIGGY Am I in trouble? JANE No, baby. But she has to ask.   She has to. JANE (CONT'D) Ziggy.   Did you touch that little girl?   You can tell me. He just",
      "dialogue_count": 0,
      "word_count": 727
    },
    {
      "scene_number": 3,
      "slugline": "INT. MADELINE'S HOUSE, HALLWAY / ABIGAIL’S ROOM - NIGHT 124A   124A Through a cracked door, we see ABIGAIL laying in bed, over her laptop, probably on FACEBOOK.   A KNOCK.   Madeline pokes in.   Abigail immediately shuts her screen off. MADELINE Can we talk about the SAT tutor? ABIGAIL Mom. MADELINE Honey, if you don’t get your boards up... ABIGAIL Y’know, Mom, the whole college thing, it’s kind of a racket.   Especially liberal arts, people go off to study Homer for four years, they graduate with a ton of debt and no job prospects. MADELINE You are going to college, young lady. ABIGAIL Ed didn’t go, he’s doing alright-- MADELINE He took computer engineering-- ABIGAIL And Dad, he never went, and he seems perfectly happy in life. (off Madeline) Career-wise. MADELINE Go ahead, finish the analogy, let’s not leave Bonnie out.   Her little cup of happiness just runneth over, doesn’t it, with no college degree. ABIGAIL I’m sorry that you hate Bonnie.   And that I’m unable to. MADELINE This is not about Bonnie.   Not about your dad, or Ed, or even me.   It’s about you.   And your future. (CONTINUED) BLL - EP 1 \"Somebody's Dead\" - FULL BLUE - 1/7/16   46.",
      "characters": [],
      "action_text": "ABIGAIL And what I’m saying is... The metric of success is not always monetary or career related.   It can be much more of a holistic equation. Okay.   That actually makes Madeline’s eye twitch. MADELINE I will not pretend to know as much as others about the holistic wonder of life.   What I do know... in the end, if you’re not independent, if you’re not self-sufficient... all that it- takes-a-village crap, it’s only true to a point.   Even the best-laid plans can go poof, in which case you need to be educated, strong, independent, strong. ABIGAIL You said ‘strong’ twice. (then) You kind of remind me of a space- alien right now, you do know that. Madeline smiles, tries to brush a piece of hair off Abigail’s face but the daughter moves back, annoyed. ABIGAIL (CONT’D) (pointing to her laptop) Can I? They hold a look.   The mother gets it, as it should be, and exits in silence. INT. CELESTE’S HOUSE, HALLWAY / LIVING ROOM - NIGHT 125   125 We see Perry laying on the couch, the boys draped over him as he reads from “The Gashleycrumb Tinies” by Edward Gorey. This is Celeste’s POV as she watches from the hallway.   Her man.   Her boys.   A contrast to the previous scene. PERRY E is for Ernest who choked on a peach. Perry pretends to be choked, and holds back a small BURP. PERRY (CONT’D) F is for Fanny sucked dry by a leech. CONTINUED: 124A   124A (CONTINUED) BLL - EP 1 \"Somebody's Dead\" - FULL BLUE - 1/7/16   47. Perry makes the sound of sucking something. PERRY (CONT’D) That’s what you’ll get if you go down to the beach without me or your Mom. Strictly forbidden.   Too many leeches. MAX There wasn’t any last time we went. PERRY Of course not, I was there.   They’re scared of me. JOSH Pfff! PERRY Didn’t you notice?   Every time we go down there, I scare them away. JOSH How? PERRY With my... (and he BURPS) ...burping superpower! ANGLE CELESTE Fighting a giggle. PERRY (CONT’D) Once you master it, ciao, bye leeches. And he BURPS again.   A big one.   The kids laugh. PERRY (CO",
      "dialogue_count": 0,
      "word_count": 2029
    }
  ]
}