{
  "slug": "big-time-adolescence-2020",
  "title": "big time adolescence",
  "genre": "romance",
  "format": "film",
  "scenes_count": 8,
  "characters_count": 0,
  "characters": [],
  "total_words": 18557,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. HIGH SCHOOL FOOTBALL FIELD - NIGHT  Kate, Mo and their parents watch Zeke play in a big football  game. He has the ball and charges down the field, plowing  through every player on his path to the end zone.  MO  -Zeke could beat the crap out of  every one of them.  The Kaufman family cheers for Zeke along with everybody else.  We watch from Kate’s POV as a cheerleader jumps into Zeke’s  arms.  INT. KAUFMAN HOUSE - ANOTHER NIGHT  Kate and Zeke are having an intense argument. Mo watches from  the top of the stairs.  MO (V.O.)  I couldn’t really blame her when  she broke up with him. But he  didn’t cheat on me so...  EXT. KAUFMAN HOUSE - CONTINUOUS  Zeke storms out of the house.  MONROE  Where are you going?  Mo is barefoot in his pajamas. Zeke doesn’t even turn around  when he speaks, he just keeps moving towards the car. Mo  chases after him.  ZEKE  Go back inside Mo.  MO  Can I come with you?  ZEKE  No man. Your sister wouldn’t like  that.  MO  Now   you care what she would like?  Zeke laughs at the quick wit of such a squeaky little voice.  4.",
      "characters": [],
      "action_text": "ZEKE  I have things I have to do.  MO  I won’t get in the way, I swear.  Just for tonight.  Zeke looks at him for a second.  ZEKE  Alright fine, but I’m bringing you  home in an hour.  Mo walks around to the passenger side of the car.  MO  What are we going to do for an  hour?  DISSOLVE TO:  AN EMPTY PARKING LOT - A FEW MINUTES LATER  MUSIC: Toots and the Maytals - Take me Home, Country Roads  SLOW MOTION: Zeke’s dark green 1978 Mercedes SLC 170 comes  spinning into view.  The boys scream at the top of their lungs as the car does  donuts all around the lot.  MAIN TITLES -   BIG TIME ADOLESCENCE  MONROE (V.O.)  That hour lasted six years.  The green mercedes spins to a stop.  Monroe sits in the front seat he is 16 years old and scrawny  as ever. In the driver’s seat Zeke is 23, he’s tall, handsome  and well built with dark hair and a goofy smile.  DISSOLVE TO:  EXTREME CLOSE UP - A SYRINGE FILLING UP WITH LIQUID  EXTREME CLOSE UP - ALCOHOL SWAB RUBBING SKIN  EXTREME CLOSE UP - NEEDLE GOING IN TO ABDOMEN  5.",
      "dialogue_count": 0,
      "word_count": 394
    },
    {
      "scene_number": 2,
      "slugline": "INT. DOCTOR’S OFFICE - CONTINUOUS  Mo is sitting on an examination table, giving himself a shot.  His parents and a doctor look on.  DOCTOR  You are getting good at that.  Mo shrugs.  DOCTOR (CONT’D)  What’s wrong.  SHERRI  I think he is upset he isn’t as  tall as he thought he would be.  MO  I thought I would get like...really  tall.  DOCTOR  (finding this amusing)  No no, It won’t make you any taller  than you were always meant to be,  the shots just help to keep you  growing at the same pace with your  peers.  MO  But I’m not.  REUBEN  I’m with Mo on this, I’m spending a  fortune for these shots and he’s  still... (he indicates Mo’s height  with his hands)  DOCTOR  You really don’t need to worry.  Most patients with growth hormone  deficiency's like this don’t start  reaching potential until they are  at least eighteen.  SHERRI  (looking at her watch)  We need to get him back to school.  DOCTOR  Okay let’s do this. When do you  turn sixteen?  6.",
      "characters": [],
      "action_text": "MO  Next week.  DOCTOR  You get your license?  Mo nods.  DOCTOR (CONT’D)  Let’s meet again in six months, if  you aren’t starting to make  improvements, we can talk about  other strategies.  EXT. SCHOOL - AFTERNOON  Mo’s parents pull up in front of the school, he get’s out.  SHERRI  Don’t forget your lunch.  He takes the lunch bag from her. We see Mo start to walk into  school as soon as his parents pull away he runs back out to  the parking lot. To a car parked on the other side.  Zeke’s POV - Mo running towards his car.  INT. ZEKE’S CAR - SECONDS LATER  Zeke somehow manages to smoke a cigarette, drive the car,  surf the radio, lecture about nothing, and stuff his face  with half of Mo’s peanut butter and jelly sandwich. Mo  quietly watches.  ZEKE  ...It’s like in King Kong when the  monkey has got the chick in his  hand and he is throwing her around.  Yea, she is scared but she is also  super turned on, because- this is  what I am saying - girls like to be  thrown around when you are having  sex. They like somebody that’s  going to pick them up and throw  them up against a wall or on the  bed. Because it makes them feel  small, it makes them feel like you  are a real man, but more  importantly like they are this  fragile little girl.  (realizing his audience)  7.  (MORE) With you it will be different  though. I don’t think there are  many girls you can pick up. We’ll  have to figure out your own thing.  Shit where am I going again?  INT. SPORTS BAR - AFTERNOON  Mo and Zeke are with Zeke’s two friends, NICK AND TONY,  watching a football game. Across from them, three pretty  girls are at a different table watching the game, minding  their own business.  Zeke yells to the girls at the next table.  ZEKE  What is this? Junior High?  GIRL  Excuse me?  ZEKE  Boys over here, girls over there, I  feel like we are at an eighth grade  dance or something.  The girls laugh.  ZEKE (CONT’D)  (pointing at his friends)  I’ll trade you him and him.  (pointing at the girls)  For he",
      "dialogue_count": 0,
      "word_count": 596
    },
    {
      "scene_number": 3,
      "slugline": "INT. CAR - MORNING  Mo drives his car, alone for the first time. He looks around  the empty car feeling incredibly old. He turns on to a nearby  street and stops.  He is double parked, listening to Bruce Springsteen and  singing along with the music at the top of his lungs. Cars  pull up behind him and honk, he waves them to go around.  Across the street Zeke comes out of his apartment building  and jay walks across the street, pissing off the same  driver’s that are trying to get around Mo’s car. He hops in  and Mo pulls out.  ZEKE  I can’t believe it.  MONROE  I’m a real person now.  ZEKE  I didn’t think they gave driver’s  licenses to kids who couldn’t reach  the pedals.  MONROE  I have to wear special shoes.  ZEKE  No fucking way.  He tries to bend over and see.  MONROE  I’m kidding you idiot. I can reach  the pedals.  ZEKE  Let me see the thing.  Mo pulls out his wallet and shows him his license.  ZEKE (CONT’D)  (reading)  Monroe Ernest Kaufman. God that’s  unfortunate.  (then)  It is going to be so nice having a  personal chauffeur.  9.",
      "characters": [],
      "action_text": "MO  Get that idea out of your head  right now. I am not driving you  around.  ZEKE  Are you kidding me? Do you know how  many years of me driving your sorry  ass around you have to make up for?  MO  I’ve got an hour and a half until I  have to be at school. Where do you  want to go?  ZEKE  I thought your school started at  8:30?  MO  Yeah but the first class is  bullshit.  ZEKE  I’m hungry.  Zeke pulls out a joint from his shirt pocket and lights it.  MO  Not in my new car man.  ZEKE  It’s weed, it smells good. It will  compliment the new car smell.  (He takes a puff)  You should really smoke this, you  might relax a little bit.  (then)  Don’t you have that research paper  for your art class?  MO  Yeah, so?  ZEKE  Well let’s go look at some shit.  (british)  To the museum driver, show me the  meaning of haste.  INT - CHICAGO INSTITUTE OF ART - DAY  Zeke and Mo walk through the museum.  10. ZEKE  So what’s the assignment?  MO  I’m supposed to pick a painting I  think is important and write about  it.  ZEKE  What about this one?  Zeke points to a painting by Cy Twombly entitled “Leda and  the Swan.”  MO  Looks like a bunch of scribbles and  dicks on a blank canvas to me.  ZEKE  If you boiled life down to it’s  essentials that’s probably all it  would look like too. It’s just a  bunch of disruptive gestures and  violence and explosions...and dicks  and liquids flying around in a  void. Everything else is  superfluous window dressing.  MO  There’s more to life than “liquids  flying around” and dicks and  violence.  ZEKE  Not really, you just think there  is. But if you really want to  represent what’s important, what’s  constant, there it is in front of  you in one immediate experience. If  I asked you to make a picture of  what’s important in life you’d  probably show me an iPhone photo of  your fucking Xbox.  MO  I could make this painting in like  5 minutes dude.  ZEKE  Yeah, yeah, you and everyone’s kid  right? First of all, no you can’t  and the proof of that is th",
      "dialogue_count": 0,
      "word_count": 858
    },
    {
      "scene_number": 4,
      "slugline": "EXT. ZEKE’S DAD’S HOUSE - 2 WEEKS LATER  Zeke’s car comes back down the same road it left only a few  weeks earlier. This time there is no crowd of people in his  driveway. Just Mo standing alone. Zeke get’s out of the car,  his face is black and blue.  MO (V.O.)  One of their dads was the dean and  he got Zeke kicked out. It was all  very political.  INT. ZEKE’S DAD’S HOUSE - CONTINUOUS  Mo helps Zeke carry his bags back into the house. In the  living room Zeke’s Dad is drunk and passed out in front of  the television.  MO (V.O.)  Zeke’s Dad seemed pretty cool about  the whole thing.  INT. MUSEUM - PRESENT  Mo gives the painting one last look and goes to catch up with  his friend.  INT. SCHOOL - AN HOUR LATER  Mo walks into the school as the first period is ending. The  hallway is completely empty. The bell rings and students pour  in from everywhere around him. He is in a forest of kids and  he barely comes up their chests. He pushes through, miserable  and unnoticed.  INT. KAUFMAN HOUSE - KITCHEN TABLE - EVENING  Mo eats with his parents.  REUBEN  How was the first day with the car?  MO  Really good.  REUBEN  How was school?  13.",
      "characters": [],
      "action_text": "MO  Good.  (clearing his plate)  I gotta go though.  REUBEN  Where?  MO  I was going to go over to Zeke’s.  REUBEN  It’s a school night.  MO  He is helping me with my homework.  SHERRI  That is so nice of him.  MO  Yeah, he had a lot of these classes  before so...  REUBEN  (not convinced)  Doesn’t he have work tomorrow?  MO  He quit his job.  SHERRI  Why?  MO  They were hiring people above him.  He had to leave...It was all very  political.  SHERRI  So what’s he going to do now?  MO  He’s still trying to figure that  out. He said he wants to break into  the art world.  DAD  Why doesn’t he come here and help  you with your homework? We haven’t  seen him in ages.  14. MO  (halfway out of the room)  Come on, he’s doing me a favor. I  can’t ask him to drive all the way  over.  DAD  Alright.  SHERRI  Well, tell him to come over and see  us every once in a while. We miss  him.  MO  I will.  DAD  And be careful in that car.  MO  I will.  DAD  All it takes is ten seconds of  stupid to ruin your whole life.  MO (O.S.)  (gone)  I know.  INT. ZEKE’S APARTMENT - LATER  CLOSE UP - A quarter landing in a glass of brown liquid.  Rack focus to the boys on the other side of the room.  ZEKE  HOMERUN!!!!  TONY  NO!  ZEKE  That’s never happened to me before.  MO  Who has to drink that?  ZEKE  You do.  15. MO  (devastated)  What’s in it.  ZEKE  (blissful)  Whiskey, vodka, Beer, red wine,  Robitusin, Milk duds, Xanax, orange  juice.  NICK  (still holding his eye)  No, he’s going to die. I’ll drink  it for him.  MO  Like hell you will.  ZEKE  He can do it.  He holds the glass up to his face.  ZEKE (CONT’D)  Wait I need music for this.  Zeke goes over to the speakers and turns up the music.  Mo closes his eyes and chugs the drink.  ZEKE (CONT’D)  (As Mo chugs)  Okay, this is for Nick. What would  you rather, every time somebody  says your name you jiz in your  pants OR every time you wake up in  the morning Mo punches you as hard  as he can in the face.  Mo finishes the drink.  MO  But I w",
      "dialogue_count": 0,
      "word_count": 773
    },
    {
      "scene_number": 5,
      "slugline": "INT. CLASSROOM - CONTINUOUS  All around him kids are socializing, gathered in little  clumps around the room. He sits alone at his desk with a  terrible hangover.  MO’S POV - SOPHIE WILLITS sitting on her desk, talking to a  group of her girlfriends. She looks over to Monroe, he smiles  and then looks away quickly.  A boy, JON EPSTEIN, comes up to Mo’s desk.  EPSTEIN  Monroe, what’s up man?  MO  Hey Epstein.  EPSTEIN  How do you always get away with  skipping first period? It’s  incredible.  MO  I don’t know.  Mo just wants to look at Sophie in peace.  EPSTEIN  I’m serious, every time I skip a  class I have so many people  crawling up my ass.  MO  I don’t know- My friend told me  once, if they don’t notice you when  you’re there, they won’t notice  when you aren’t.  EPSTEIN  You’re a legend.  Mo shrugs at the compliment.  EPSTEIN (CONT’D)  Are you okay?  MO  I’m a little hungover.  EPSTEIN  But it’s Wednesday.  Mo shrugs again.  18.",
      "characters": [],
      "action_text": "EPSTEIN (CONT’D)  (under his breath)  Incredible.  Mo goes back to staring at Sophie.  Epstein follows Mo’s eyeline across the room.  EPSTEIN (CONT’D)  Sophie Willits?  MO  What? No?  EPSTEIN  Hey hey, don’t get defensive. She  is hot. Ya know what...  (moving in closer and  whispering)  Paul’s parents are going out of  town this weekend and we are  throwing a rager at his house.  Guarantee Sophie will be there.  MO  Really?  EPSTEIN  What you think I’m lying?  MO  Did Paul say I could come?  EPSTEIN  Don’t worry about Paul. I can  invite anybody I want. I have carte  blanche.  MO  Okay cool, yeah I’ll come.  Sophie looks back over at Mo and smiles. Epstein sees this  exchange.  EPSTEIN  Oh my god it’s so fucking on.  Epstein goes back to his desk but remembers something.  EPSTEIN (CONT’D)  It’s a pimps and ho’s party.  MO  What does that mean?  19. EPSTEIN  Guys dress like pimps girls dress  like Hos.  MO  What does a pimp wear?  EPSTEIN  I don’t know, robes and chains and  shit.  MO  Alright cool.  EXT. BASEBALL DIAMOND - AFTERNOON  Mo is at Baseball practice. He is standing at the plate. He  swings hard but misses every time, striking out. He walks  away from the plate defeated.  INT. LOCKER ROOM - AFTERNOON  Mo is in the back changing out of his baseball gear. A few of  the bigger, more senior players are gathered around nearby.  The ringleaders seem to be DANNY AND JOSH. Mo can’t help but  overhear they are talking about Paul’s party.  MO  Hey are you guys talking about  Paul’s party?  DANNY  (caught off guard)  What? No- It’s just, it’s like a  birthday thing.  JOSH  It’s going to be super low key.  Just like some close friends and  stuff.  MO  No, it’s cool, Epstein invited me.  JOSH  Oh really?  MO  Yeah, Pimps and Ho’s party right?  DANNY  Yeah. Epstein invited you?  20. Mo packs his stuff up and heads out.  MO  Yup. See you there.  The boys shrug at each other, confused at what just happened.  DANNY  Epstein is going rogue.  JOSH  Seriously.  INT. ZEKE’S A",
      "dialogue_count": 0,
      "word_count": 1452
    },
    {
      "scene_number": 6,
      "slugline": "INT. KAUFMAN HOUSE - KITCHEN TABLE - CONTINUOUS  The kitchen table which has been completely cleaned off since  dinner has a small syringe and an alcohol swab resting at the  head of the table.  Mo stands in front of his shot, he looks down at his dick.  EXT - PAUL’S HOUSE - NIGHT  We follow Mo into the house. He is wearing a long white  shower robe over his regular clothes and some cheap holloween  jewlery.  As he walks into the house there is a giant handmade sign  that reads “Pimps and Hos” in big happy bubble letters as if  it actually said Happy Birthday Grandma.  The guys are all wearing robes or long jackets. The girls are  all in basically nothing.  CUT TO Mo getting a beer, unsure of himself.  CUT TO Mo staring at Sophie, she is the only girl who isn’t  dressed like a playboy bunny.  Mo narrates over shots of kids socializing, he tries to seem  like he belongs there.  MO (V.O.)  The theme party has been around  since before Zeke was in high  school and its actually a pretty  ingenious idea. Most kids can’t get  into bars yet, so we have to do all  our serious drinking in basements.  Normally it’s the same basement,  drinking the same cheap vodka with  the same kids night after night can  get a bit repetitive. So you give  each party a theme. Everybody puts  on a costume, and boom, new party  every night. It also has a very  important added bonus. Girls love a  good reason not to wear anything.  So you give the party a theme with  the word ho in it, the girls show  up half naked and half your job is  done for you.  Back to Mo’s POV of Sophie.  27.",
      "characters": [],
      "action_text": "MO (V.O.)  Though I had no idea how to  complete that job.  He starts to walk over to her until Epstein, wasted,  intercepts him. Epstein is really going for it, big floppy  hat, a cane, a long multicolored coat, a fake moustache.  EPSTEIN  You made it dude.  Watching Sophie walk away.  MO  Yep, I’m here.  EPSTEIN  You got a drink?  Mo holds up his drink.  EPSTEIN (CONT’D)  Isn’t this shit the best man.  MO  Yeah it’s pretty good.  EPSTEIN  Have you seen Sophie yet?  Playing dumb  MO  What? No, I don’t know-no. Is she  here?  EPSTEIN  Dude that girl is a ten. A ten.  MO  Cool ya-sure.  EPSTEIN  See that girl over there.  POV - some random wasted girl falling on her ass.  MO  Ya.  EPSTEIN  She’s so fucking hot right?  28. MO  She’s okay.  EPSTEIN  Yeah she’s okay, whatever. I could  probably do better. I’ll see you  man.  Epstein starts to walk away then Mo remembers something.  MO  Eppy wait.  He turns around.  MO (CONT’D)  I brought some drugs for you and  the guys. It’s cool if you don’t  want- I just thought- it’s stupid.  Nevermind-  EPSTEIN  (the music is too loud)  What?  MO  (Louder)  I brought Marijuana.  CUT TO:  A BATHROOM IN THE HOUSE  A group of sixteen year old “pimps” huddle around Mo as he  lays the bottles of weed on the sink.  EPSTEIN  Mo, you are a god damn legend.  MO  Do you want it all?  DANNY  Yeah we fucking want it all.  EPSTEIN  Dude. How much you want for it.  MO  (unsure of himself)  What about six hundred dollars. I  understand if that’s too much I  guess-  29. JOSH  You are the fucking man.  Instantly the guys start pulling out wads of cash and  throwing them at a shocked Mo.  EPSTEIN  Did I not tell you this kid is one  of us, this kid is a ten.  The boys cough up a large wad of cash and he stuff it in his  giant robe pocket.  DANNY  You gonna hang and smoke with us?  MO  (these are not his people)  Nah I’m already pretty baked, this  stuff is real strong.  RANDOM PIMP  Legend.  BACK IN THE PARTY  Monroe stands with a group of guys. He ",
      "dialogue_count": 0,
      "word_count": 4586
    },
    {
      "scene_number": 7,
      "slugline": "INT. PARTY - NIGHT  Danny, Josh and Mo are talking while Epstein breaks up lines  of coke.  JOSH  God look at this, we have  absolutely no hot girls at our  school.  DANNY  What are you talking about?  Jessica, Ramona, Sophie, Tess-  JOSH  No I’m talking about the girls like  when we were Freshman. The seniors  then, those girls were out of  control.  DANNY  True.  JOSH  Like remember Holly McCartney?  DANNY  Oh my god I fucking loved her.  Mo perks up.  MO  Ya know I’m good friends with her.  DANNY  What are you talking about?  MO  She dates my best friend.  JOSH  That makes me so sad.  DANNY  Is she still incredible?  MO  Yeah, she’s pretty great.  He sees Sophie on the other side of the room.  MO (CONT’D)  I’m gonna go do a lap.  54.",
      "characters": [],
      "action_text": "Mo walks towards Sophie.  DANNY  Yeah we are too.  Danny and Josh leave Epstein alone with his pile of coke.  EPSTEIN  (to nobody)  Hey is nobody going to do this? I  don’t like to leave food on the  table, guys.  Angle back on Mo, catching up with Sophie.  SOPHIE  (teasing)  I thought your only friends were  older and more sophisticated.  INT. ZEKE’S APARTMENT - LATER  Nick, Tony, Zeke and Holly are playing Beer Baseball.  NICK  Alright Zeke. Would you rather have  all of the hair on your body be  silly string, or denim?  ZEKE  Denim? What would that even look  like? It doesn’t matter you are  asking the wrong guy, Tony’s the  one with the hairy chest.  TONY  What kind of denim is it?  NICK  Like some Diesel faded design shit.  TONY  Silly string.  HOLLY  Would you rather get raped by 10  guys at once and nobody ever finds  out, or the whole world thinks you  got gang banged by the entire New  York Jets. But you didn’t actually  do it.  NICK  That just got so real.  55. At that moment Mo appears in the doorway of the apartment  with Sophie.  MO  I’m sorry. Are we interrupting  something?  The group seems totally caught of guard. And shocked at how  pretty Sophie is.  NICK  Fresh blood.  ZEKE  Don’t be weird Nick.  SOPHIE  (To Mo)  So this is your secret clubhouse.  ZEKE  I hope you blindfolded her on the  way here. We can’t have the  location getting out.  DISSOLVE TO:  ZEKE’S APARTMENT - LATER  Everybody is much drunker. The music is much louder. They all  have forty ounce bottles of beer duct taped to their hands.  Zeke and Nick are wrestling. Tony is in the bathroom trying  to figure out how to pee. Sophie is picking out music on the  ipod. Mo and Holly sit on the couch observing everything.  HOLLY  Sophie is adorable.  MO  Yeah, thanks. So is Zeke. I mean-  You know what I mean.  Holly laughs. Sophie finally picks a song she likes and pulls  Mo to his feet. The dance, awkwardly, since they have no use  of their hands it’s just a lot of rubbing hips. Holly watch",
      "dialogue_count": 0,
      "word_count": 1676
    },
    {
      "scene_number": 8,
      "slugline": "INT. KITCHEN - LATER  His parents sit at the table talking.  MONROE  Standing outside the kitchen still trying to psyche himself  up.  He listens to them talking. They start to laugh at a joke he  can’t hear. On that he walks in laughing as well, he thinks  this will blend him in but he just looks like a crazy person.  REUBEN  What’s wrong with you?  MO  What? I mean excuse me?  He sits down at the table, still trying to appear normal.  MO (CONT’D)  Are we going to this thing?  SHERRI  Oh no. Reuben what’s wrong with  him?  REUBEN  I think I know.  Monroe can hear them talking but can’t bring his mouth to  rebuttal. So he just continues to act as if nothing is  happening.  MO  I totally forgot, Happy Birthday!  He gets up and give’s his father a hug.  SHERRI  What are we going to do?  REUBEN  I don’t know this is a nightmare.  (to Mo)  How could you do this on my  birthday.  MO  Do what?  64.",
      "characters": [],
      "action_text": "SHERRI  Do you have any idea how much  trouble you are in?  MO  Hmm?  REUBEN  Let’s just go we are going to be  late.  SHERRI  Should we leave him at home?  REUBEN  I don’t know how to explain to my  parents that Mo got too stoned.  MO  Guys, you are wrong.  SHERRI  About what?  MO  Everything. All of it.  REUBEN  Jesus Christ.  INT. CAR - LATER  The parents sit up front. Reuben drives. Mo is in the  backseat, trapped in his own mind.  REUBEN  This is exactly what I’m talking  about. Ten seconds of stupid.  MO  I think it’s been a  misunderstanding.  SHERRI  Please stop talking Monroe.  REUBEN  Listen, when we go inside. You kiss  your grandparents hello. You say  nothing else. Are you listening to  me?  65. MO’s POV - His parents are moving in slow motion and sound  like the teacher from Charlie Brown.  The car pulls up to Mo’s grandparents house. His parents give  each other one last look.  SHERRI  Please don’t eat too much.  REUBEN  Oh shit, you’re right.  (to Mo)  Don’t even go near the buffet. Just  say hi and go sit down somewhere, I  will give you food.  EXT - GRANDPARENTS HOUSE  The three of them walk to the door.  SHERRI  We good?  MO  We’re great!  REUBEN  You are a real idiot.  The door opens. It’s Mo’s grandmother.  GRANDMOTHER  Hello! Come on in. Take off your  coats.  The family takes off their jackets.  GRANDMOTHER (CONT’D)  Hi Monroe.  MO  What- Hi.  GRANDMOTHER  How’s school going?  MO  (long pause)  A lot.  BUFFET  Mo walks past, eyeing the mini hot dogs.  66. REUBEN  (sotto)  Don’t even think about it.  TABLE  Mo sits at the table not saying anything. Kate and Doug are  on either side of him. The three of them whisper to each  other.  KATE  How high are you right now?  MO  Quiet.  KATE  Nobody can hear me.  MO  How obvious is it?  DOUG  Nobody can tell, you are doing  great.  KATE  Do Mom and Dad know?  MO  I’m not sure. I don’t think so.  Across the table Reuben glares at his son.  CUT TO:  MONROE IN HIS ROOM ON THE PHONE WITH ZEKE  ZEKE (V.O.)  ",
      "dialogue_count": 0,
      "word_count": 8222
    }
  ]
}