{
  "slug": "big-little-lies-107-you-get-what-you-need-2017",
  "title": "big little lies 107 you get what you need",
  "genre": "drama",
  "format": "series",
  "scenes_count": 3,
  "characters_count": 0,
  "characters": [],
  "total_words": 8619,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. JANE’S TOWNHOUSE, FAMILY ROOM - DAY 708   708 Jane is on the phone, paperwork spread out in front of her, including a Quickbooks spreadsheet.   ZIGGY, still in his jammies, IS WATCHING CARTOONS, a thermometer in his mouth. JANE (into phone) Yes, the invoice was sent out twelve days ago. (then) I would really appreciate it.   Thank you so much.   Bye bye. And she hangs up.   As THE THERMOMETER BEEPS, Jane pulls it out, checks. JANE (CONT’D) Ninety-eight point six.   That’s as normal as it gets, bud. She feels his brow.   She then picks up the remote, TURNS OFF THE TELEVISION. JANE (CONT’D) Tell me the truth, baby.   Are you really feeling sick, or is it that you don’t want to go to school? ZIGGY I feel sick. Ziggy’s not a good liar.   He doesn’t know how. JANE You don’t seem congested. ZIGGY I have aches. (puts his hand to his temple) One here. (points to the crown of his head) One way up here. (points to his heart) And here. (CONTINUED) BLL EP 7-\"FUN AND MERRIMENT\" - PINK - 4-11-16   9.",
      "characters": [],
      "action_text": "JANE Oooh.   Possible that your heart hurts because the other kids have been told not to play with you?   I would certainly understand. Silence from Ziggy. JANE (CONT’D) Is that what’s going on here, buddy? ZIGGY Friends play with me.   Chloe, and Josh.   And Harriet.   And Amabella. CONTINUED: 708   708 (CONTINUED) BLL EP 7-\"FUN AND MERRIMENT\" - PINK - 4-11-16   9A. JANE Amabella Klein plays with you? ZIGGY Yes.   We’re friends.   She likes ‘Star Wars,’ too. (then; almost dismissive) It’s not me who hurts her. Jane stares, something in his tone.   Something knowing. JANE Ziggy.   Do you know who’s been hurting her? His face closes down slightly, but enough for a mother to recognize. JANE (CONT’D) Oh my god.   Who is it? ZIGGY I don’t want to talk about it. JANE You do know. (then) For god’s sake, Ziggy, why wouldn’t you tell me? He stares back, a bit like a deer caught in the headlights. ZIGGY I promised. JANE You promised who? His lip quivers a bit now. JANE (CONT’D) All this time you’ve known?   While taking the blame? ZIGGY I only just found out. JANE Who is it? CONTINUED:   (2) 708   708 (CONTINUED) BLL EP 7-\"FUN AND MERRIMENT\" - PRODUCTION DRAFT - 3-16-16   10. ZIGGY I promised I wouldn’t tell. JANE I don’t care.   Promised who? Silence. JANE (CONT’D) (softly imploring) Promised who, Ziggy? ZIGGY Amabella.   She said if I told, she might get killed dead. His eyes are filling with tears. JANE Ziggy.   Sweetie.   Normally, it’s important to keep promises, but sometimes-- ZIGGY No.   I promised. Jane’s wheels are spinning.   She can sense that part of him wants to tell. JANE How ‘bout this? She grabs her computer, flips it on. JANE (CONT’D) You can’t tell me who it is, but you can point!   That wouldn’t be breaking a promise.   Right? He blinks twice. JANE (CONT’D) You wouldn’t be breaking your promise to Amabella, and I can promise you that she won’t be killed dead. ANGLE THE COMPUTER A CLASS PHOTO.   ROSTER, ALL THE FIRST GRADE FACES. JANE (CONT’D) Point to me ",
      "dialogue_count": 0,
      "word_count": 1134
    },
    {
      "scene_number": 2,
      "slugline": "EXT. OTTER BAY ELEMENTARY SCHOOL - DAY 710   710 CARS BACKING UP IN THE DROP-OFF ZONE AS THE FIRST GRADERS EMERGE.   THE ELECTRONIC BOARD REMINDS PARENTS, “SUPPORT OTTER BAY ELEMENTARY -- ATTEND TONIGHT’S BIG GALA!”   WE FIND MADELINE near the front, as she deboards her SUV to meet with Chloe. WE CAN HEAR THE TRAFFIC MONITOR BLOWING ON HIS WHISTLE. MADELINE How was your day, baby-cakes? CHLOE Well, T.G.I.F. MADELINE Tell me about it.   I’m either picking fights today, or joining in. NATHAN (O.S.) Maddie? REVEAL NATHAN APPROACHING as Chloe climbs into the SUV. MADELINE (to herself) Sure.   Why not? NATHAN Ready for Trivia Night?   You’re coming, I presume. MADELINE I’ll be the one dressed like Audrey Hepburn. NATHAN Funny.   Listen.   Bonnie and I went to see a counselor this morning, one who specializes in teenagers.   I wanted to share... MADELINE Wait just a second.   You went to a counselor?   You? He doesn’t bite.   Except for his lip. (CONTINUED) BLL EP 7-\"FUN AND MERRIMENT\" - PRODUCTION DRAFT - 3-16-16   16.",
      "characters": [],
      "action_text": "NATHAN He thinks that this could be a kind of scream for attention.   Divorce can mess kids up pretty good. MADELINE Really?   Parents splitting up can actually affect the kids?   If only I’d known, I might not have walked out.   Oh, wait, did I... NATHAN Do you just have to turn everything into a fucking battle? Nathan shoots a look to Chloe, hoping she didn’t hear that. NATHAN (CONT’D) (back to Madeline) Sorry. MADELINE (genuine) I’m glad you’re taking the parenting thing seriously.   I am. Nathan knows his ex well enough to see something’s up. NATHAN Are you okay, Maddie? MADELINE I’m fine. He can see that she’s not. NATHAN Y’know.   Apart from all our shit... He shoots a look in Chloe’s direction again. NATHAN (CONT’D) (back to Madeline) I do root for you.   I’m not crazy about spending time together.   But I do root for you. MADELINE I know.   Thank you. CONTINUED: 710   710 (CONTINUED) BLL EP 7-\"FUN AND MERRIMENT\" - PRODUCTION DRAFT - 3-16-16   17. NATHAN Also, a heads up... of sorts.   Bonnie plans to sing tonight at the party, as part of the talent thing.   Maddie. She’s good.   Really good. Great. CLOSE ON THEA THEA Knowing what I know now... I’m surprised there wasn’t more carnage on Trivia Night. CLOSE ON GABRIELLE GABRIELLE One dead, we definitely got off light. CLOSE ON CELESTE Staring with vacant eyes. INT. CELESTE’S NEW APARTMENT - DAY 710A   710A WE REVEAL HER IN THE NEW APARTMENT.   SHE’S MAKING UP THE TWIN BEDS IN THE BOYS’ ROOM.   Her body language is a bit rigid, frozen, like she’s on auto pilot.   The room is quiet, peaceful.   All we hear is the distant, pleasant sound of outdoor birds singing.  FLASHBACK  A QUICK GLIMPSE OF CELESTE’S HEAD BEING SLAMMED AGAINST A WALL.   NO SOUND BUT THE ONE OF THE BIRDS FROM... PRESENT Celeste carefully places some of the boys’ toys about, staging the room.   Warmth and happiness.   Until she feels pain on her neck.  FLASHBACK  A QUICK GLIMPSE OF CELESTE’S THROAT BEING GRABBED BY PERRY’S HANDS, as she tries to",
      "dialogue_count": 0,
      "word_count": 935
    },
    {
      "scene_number": 3,
      "slugline": "INT. MADELINE'S HOUSE - MASTER BEDROOM - DAY 712   712 Madeline is getting ready, last touch-ups before the big night.   ABIGAIL sits not too far away, watching. MADELINE He said, “see you at the party” like it was a threat. ABIGAIL I seriously doubt he’s going to just blow up his life. Madeline is not so sure about that.   A beat during which Abigail watches the reflection of her mom putting on some lipstick.   Madeline catches her look.   They share a smile. ABIGAIL (CONT’D) Why did you want to blow up yours? Oh.   Madeline is surprised by the question.   She turns to look at Abigail. ABIGAIL (CONT’D) Why’d you cheat on Ed? MADELINE If only I knew the answer to that. Abigail stares; waiting for more. MADELINE (CONT’D) I can’t make sense of it. (then) The one thing I cling to more than anything is being a good wife, a good mom. (a beat) I can’t explain it, or excuse it. Other than to say it was maybe a stupid thrill-ride where I never thought I’d get caught... I’ve been wanting to tell Ed for so long... I just haven’t found the courage yet. Abigail considers.   Then-- ABIGAIL What good can come of it? (CONTINUED) BLL EP 7-\"FUN AND MERRIMENT\" - PRODUCTION DRAFT - 3-16-16   21.",
      "characters": [],
      "action_text": "MADELINE I’d maybe feel less burdened. ABIGAIL What good can come of it for Ed?   Or Chloe? Madeline considers, nods.   A look between them.   Then-- MADELINE How’d you get so smart? ABIGAIL I take after my dad. Madeline shoots her a look. ABIGAIL (CONT’D) Kidding. (a beat) Listen.   I’ve decided not to go through with it.   My secret project. What?   Madeline seems so relieved. ABIGAIL (CONT’D) It was pointed out to me -- not by Bonnie -- that whatever attention I drew to the cause would get buried under the controversy over my methodology.   So I’m going to find another way. (a beat) Maybe I never wanted to do it.   It was more of a publicity stunt.   To raise awareness-- MADELINE And piss me off? They share another smile.   Madeline holds a long look at her daughter.   It’s not lost on her that they have an incredibly candid and healthy relationship.   Nor does it escape Madeline... this is a pretty cool kid. MADELINE (CONT’D) You are such a great kid. CONTINUED: 712   712 BLL EP 7-\"FUN AND MERRIMENT\" - PRODUCTION DRAFT - 3-16-16   22. INT. RENATA’S HOUSE, MASTER BATHROOM - SUNSET 713   713 RENATA and Gordon Klein.   He’s already got his Elvis outfit on; Renata is still working on her hair.   The bathroom is massive. RENATA I really wish you hadn’t confronted them like that. GORDON I’m not going to just stand by and do nothing. RENATA The problem is, I’m the one who gets vilified. GORDON Why would you be-- RENATA Because I’m a working mom, I have a career which, by default, makes me the bitch, you have no idea.   I could be shot dead in the head, half the mothers would go, “what, she couldn’t be bothered to duck?”   “The nanny didn’t stop the bullet?”   That’s how these people think, they’re vicious. GORDON Maybe we should just blow off this party. RENATA In which case, we’re demonized for skipping the fundraiser.   “The rich people just send money, they can’t be expected to actually invest their time.” (then) God, I hate everybody right now. (then) Except Jane, ",
      "dialogue_count": 0,
      "word_count": 6550
    }
  ]
}