{
  "slug": "big-little-lies-104-push-comes-to-shove-2017",
  "title": "big little lies 104 push comes to shove",
  "genre": "romance",
  "format": "series",
  "scenes_count": 3,
  "characters_count": 0,
  "characters": [],
  "total_words": 5774,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. CONFERENCE ROOM - DAY 415   415 Renata Klein is seated next to the Mayor in a large conference room.   MAYOR RANDALL BARTLEY, fifties, a bit gruff, a rough-and-tumble politician, is surrounded by A COUPLE OF AIDES.   Sitting across from them: Celeste, Madeline, and Joseph. MAYOR BARTLEY Look, I’m not looking to like chill artistic expression.   I hear it’s a great play.   That said, the puppets fuck.   We can’t have puppets fucking in Monterey. MADELINE May I be heard? Celeste puts her hand on top of Madeline's to suggest \"not yet.\" CELESTE There is one scene and one scene only where two of the puppets simulate sex.   There is no nudity. MAYOR BARTLEY Yeah, naked puppets don’t concern me.   Fucking puppets on the other hand...   It’s vulgar. CELESTE Even if it were, you’d still have to show that it has no literary, social, or artistic value-- MAYOR BARTLEY I’m not talking about the legals. MADELINE Well, if this goes to court... Celeste puts a hand on Madeline's arm again. CELESTE (voice of reason) To shut down a play simply because it makes you uncomfortable, at this stage, two weeks-- (CONTINUED) BLL EP 4 - \"PUSH COME TO SHOVE\" - FULL PINK - 3-3-16   25.",
      "characters": [],
      "action_text": "MAYOR BARTLEY Okay, look.   I’m new to this whole controversy, okay?   It’s just been brought to my attention, mostly by concerned parents. Madeline shoots a look to Renata; Renata returns the stare. MAYOR BARTLEY (CONT’D) So I’m bringing a fresh eye to the whole thing.   You can tell me I’m full of shit; you wouldn’t be the first -- but from my perspective, the whole point of the theater is to bring the community together, to entertain, to have an affirming effect on our society.   This thing here is already divisive. RENATA We have zoning laws prohibiting strip clubs, sex shops,-- CELESTE This is hardly that. MADELINE This play examines love, racism, same sex marriage, there are so many redeeming themes-- MAYOR BARTLEY The puppets fuck. RENATA If I may speak, not as a member of the Monterey Planning Board, but as a parent... Madeline straightens, bristles at the suggestion that she's not a 'parent.' RENATA (CONT'D) Nobody’s trying to be a prude here.   It's a vulgar universe, understood.   But we're Monterey. Is this the best we can do? Really? (a beat) CONTINUED: 415   415 (MORE) (CONTINUED) BLL EP 4 - \"PUSH COME TO SHOVE\" - FULL PINK - 3-3-16   26. The question here isn't what is this play?   It's who are we? A beat.   Compelling.   Winning.   Renata knows it; shoots Madeline a self-satisfied look.   And then-- CELESTE (poised) I take your point, Renata, and it's a good one.   We all have small children.   This is the village we've chosen to raise them in.   As for who we are, I like to think that among other things we’re open-minded.   In fact, what draws many to Monterey is its progressiveness. (back to the Mayor) Legally, you already know you lose.   If anything, The California Constitution goes further than the Federal one to protect the First Amendment. (to Renata) But to your question:   Who are we? Like you say, we’re Monterey.   Do we really want to become synonymous with suppression and prior restraint?   We'll face accusations of being anti- American, ",
      "dialogue_count": 0,
      "word_count": 1094
    },
    {
      "scene_number": 2,
      "slugline": "EXT. SIDE DOOR CAFE - DAY 418   418 Ms. Barnes is there with Jane. MS. BARNES Thank you for agreeing to meet me. I would've asked you to come to the school, but... it's kind of a fish bowl there, and people... can gossip. JANE (a lump in her throat) What's going on? MS. BARNES Well.   First let me say I have no facts, no evidence, no-- JANE (fearing the worst) Oh my god. (then) Just tell me. MS. BARNES I have reason to suspect, and only suspect... that Amabella Klein is still being bullied.   And that Ziggy may be the culprit. Jane can feel her insides seize up.   She can't even form a response. MS. BARNES (CONT'D) I have not seen anything.   But I feel certain that something's going on with Amabella.   She's implicated no-one, in fact she claims she and Ziggy are friends. My personal experience of Ziggy: he's a sweet little boy. JANE Then where is this coming from? MS. BARNES I've sensed some tension between them.   This morning, Amabella was visibly upset about something.   I observed Ziggy looking at her. (MORE) (CONTINUED) BLL EP 4 - \"PUSH COME TO SHOVE\" - FULL PINK - 3-3-16   31.",
      "characters": [],
      "action_text": "And from my vantage point, it appeared he knew what she was upset about. JANE Maybe he saw her being bullied. Maybe he was concerned. MS. BARNES That could very well be, though it wasn't my take.   As I said, I have no evidence.   What I do have is an obligation.   If I think a child is being physically or emotionally abused, I have a duty to go forward with that, first and foremost to the parents. JANE (snapping) What fucking evidence do you have? Ms. Barnes stares back, frozen.   Then-- MS. BARNES I’m actually on your side here. JANE I’m sorry, but going to Amabella’s parents will make things worse. If you’re on my side, you gotta come up with a better solution. A beat during which Ms. Barnes seems to agree with Jane. MS. BARNES Do you have any reason to suspect that Ziggy could be violent? CONTINUED: 418   418 MS.   BARNES   (CONT'D) (CONTINUED) BLL EP 4 - \"PUSH COME TO SHOVE\" - GREEN - 3-28-16   32. Hesitation.   Then-- JANE No. CONTINUED:   (2) 418   418 (CONTINUED) BLL EP 4 - \"PUSH COME TO SHOVE\" - YELLOW - 3-8-16   32A. MS. BARNES Maybe something in his past-- JANE (suddenly yelling) No!!! HEADS TURN.   Jane is immediately mortified. JANE (CONT'D) He's a docile, sweet boy, he's never hurt anybody. A beat. JANE (CONT'D) Wouldn't somebody have seen it, for God's sake?   If this was going on at school? MS. BARNES You'd be surprised how discrete this kind of thing can be. A beat.   Then-- MS. BARNES (CONT'D) Okay.   Maybe you’ll think this is way off-book... how about you take Ziggy to a child psychologist, get an independent evaluation? The idea grows in Jane’s mind. CONTINUED:   (3) 418   418 BLL EP 4 - \"PUSH COME TO SHOVE\" - YELLOW - 3-8-16   33.",
      "dialogue_count": 0,
      "word_count": 502
    },
    {
      "scene_number": 3,
      "slugline": "INT. COMMUNITY THEATER - DAY 419   419 REHEARSAL IN PROGRESS as Madeline walks through, headed for Joseph’s office. JOSEPH (V.O.) I feel guilty about your friend working for free, I mean, should this go to court... INT. JOSEPH BACHMAN'S OFFICE - DAY 420   420 MADELINE It won’t.   You saw how good she was?   And Celeste is financially okay, her husband runs a hedge fund, add to that, she’s enjoying herself.   So stop beating yourself up. JOSEPH Well, I do beat myself up... and with very good reason.   A lot of people have gone out on a limb here, made sacrifices.   Given their time, their passion... including you. MADELINE I love this play. A beat during which Madeline waits for Joseph to say more.   He doesn’t.   He just stares at her, and suddenly pulls her in and plunges his tongue into her mouth. EXT. CELESTE’S HOUSE, PATIO - DAY 421   421 Celeste spits her wine as she takes a sip, looking at Madeline who sits in front of her. CELESTE Oh my god. MADELINE Right?   Out of nowhere.   I'm still shaking. (CONTINUED) BLL EP 4 - \"PUSH COME TO SHOVE\" - FULL PINK - 3-3-16   34.",
      "characters": [],
      "action_text": "Madeline empties her glass of wine and pours herself more.   THE TWINS ARE PLAYING IN THE BACKGROUND.   * Madeline makes sure that they’re not listening. MADELINE (CONT’D) One second we're talking, the next, he’s tongue-lashing my esophagus. CELESTE The man assaulted you? MADELINE I may have... y'know, kissed him back a little. AND WE’RE BACK IN JOSEPH’S OFFICE AS MADELINE KISSES HIM 421A   421A BACK.   NOT JUST A LITTLE.   WE DON’T HEAR THEM.   WE STILL HEAR THE SOUND OF CELESTE AND MADELINE’S EXCHANGE. CELESTE (V.O.) I’m sorry? MADELINE (V.O.) It was a reflex. (off Celeste) Okay, I may have grabbed his ass, too. Madeline grabs Joseph’s buttocks. MADELINE (V.O.) It all happened so fast. BACK ON CELESTE ON THE PATIO, LISTENING TO MADELINE, 421B   421B eyes wide open. MADELINE The next thing I know, he has his hands in my shirt. AND WE’RE BACK IN JOSEPH’S OFFICE.   MADELINE HAS HER 421C   421C hand in his pants as they keep on kissing madly. MADELINE (V.O.) Or was it my hands in his? I don’t remember. She breaks it off.   Wants to leave but Joseph grabs her and kisses her again. CONTINUED: 421   421 (CONTINUED) BLL EP 4 - \"PUSH COME TO SHOVE\" - CHERRY - 5-23-16   35. CELESTE (V.O.) So what you're saying... it was mutual. She again breaks it off. MADELINE (V.O.) No.   Not at all, the man jumped me and yelled at me... JOSEPH I'm in love with you.   You hear me?   I'm in love with you, Madeline, and have been for a long time. Madeline’s reaction is spontaneous: she slaps Joseph in the face and flees the room. RESUME ON CELESTE who stares at Madeline, mouth wide 421D   421D open, her jaw on the floor.   A beat during which she fights a smile. MADELINE It's not funny, Celeste. Celeste can’t help herself, bursts into laughter. MADELINE (CONT’D) It is not funny.   I’m happily married, and he forced himself on me. CELESTE (probing) But... was it thrilling? MADELINE Absolutely not. Celeste stares, clocking Madeline’s denial.   Upon which, Perry enters, arriving home from work",
      "dialogue_count": 0,
      "word_count": 4178
    }
  ]
}