{
  "slug": "big-little-lies-103-living-the-dream-2017",
  "title": "big little lies 103 living the dream",
  "genre": "drama",
  "format": "series",
  "scenes_count": 4,
  "characters_count": 0,
  "characters": [],
  "total_words": 7998,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. CELESTE’S HOUSE - DEN - NIGHT 304A   304A CELESTE is at her desk, her open laptop in front of her. HER POV:   GOOGLE SEARCH ON AVENUE Q’S RESEARCH AND THEN   * ON THE FIRST AMENDMENT.   * INT. VAN - DAY 305   305 ONE OF THOSE BIG HUMMER STRETCH VANS.   MADELINE, CHLOE, JANE, ZIGGY, CELESTE, JOSH, MAX, SAMANTHA, her daughter, LILY; MELISSA, and her son, SAM... The KIDS are moving their heads to the rhythm of the music, “DREAMS” from FLEETWOOD MAC, thanks to Chloe.   The mothers all seem in perfect harmony with the voice of Stevie Nicks.   This song is setting a mood in the van that is nice, cool, unexpected from a bunch of kids and mothers about to go to a Disney show.   Ziggy is on-guard; he holds Harry The Hippo tight. CELESTE (to Ziggy) Be gentle with his legs. MADELINE (to Chloe) Put on something we can sing along to. CHLOE Just listen, woman. CLOSE ON HARPER HARPER Madeline was desperate for the trip to be better than the birthday party.   It was pathetic. RESUME Madeline turns to Celeste, who's lost a bit in the memory of last night. MADELINE All good? CELESTE (covering) Good. MADELINE Thanks for arranging the transpo. (CONTINUED) BLL - EP 3 \"Living The Dream\" - YELLOW - 4-13-16   11.",
      "characters": [],
      "action_text": "CELESTE Well.   You got the tickets.   Least I could do. MADELINE (reading her) Everything okay? CONTINUED: 305   305 (CONTINUED) BLL - EP 3 \"Living The Dream\" - PINK -   3-28-16   11A. CELESTE Between you and me?   I’d rather snorkel in my own vomit than have to listen to that stupid   “Frozen” song one more time. And Celeste winks.   Madeline smiles.   A perfect deflect. EXT. RENATA’S HOUSE, BACKYARD - DAY 306   306 WE HEAR THE MUSIC FROM WITHIN THE TENT: \"DISCO INFERNO\" IS EXPLODING OUT LOUD.   WE’RE OUTSIDE THE TENT WITH GORDON, HAVING A SMOKE WITH SPIDERMAN ON BREAK.   Gordon finishes his cigarette, and ENTERS INTO: INT. TENT - CONTINUOUS 307   307 GORDON’S POV: ALL THE PARTY GUESTS ARE DANCING TO \"DISCO INFERNO.\"   THEY'RE ALL IN SYNCH, CLEARLY HAVING GOTTEN INSTRUCTIONS/LESSONS FROM THE 'DISCO TEAM LEADER' a local Monterey favorite who doesn't come cheaply. PARENTS AND KIDS TOGETHER, SINGING, DANCING. ALL (singing) Burn, baby, burn. Gordon SEES RENATA, NEXT TO HARPER.   THEA and GABRIELLE ARE BOTH THERE, TOO.   The level of silliness a parent will sink to in order to put a smile on their child’s face.   Gordon spots BONNIE WHO DANCES LIKE AN IKETTE; NEXT TO HER NATHAN IS TRYING TO DO AN IMPRESSION OF TRAVOLTA.   HE SHOULD HAVE A SEAT. CLOSE ON THEA THEA It was a fantastic party.   With the exception of Bonnie's dancing.   A lot of husbands were staring. CLOSE ON STU, mimicking “Touching Fire.” STU She was hot! (admitting) Some of us got erections. CONTINUED:   (2) 305   305 BLL - EP 3 \"Living The Dream\" - PRODUCTION DRAFT - 1-9-16   12.",
      "dialogue_count": 0,
      "word_count": 484
    },
    {
      "scene_number": 2,
      "slugline": "EXT. RENATA’S HOUSE, BACKYARD - LATER 308   308 Renata is proudly dispensing the party favors -- in this case, over-the-top gift-bags. RENATA (doling out bags of stuff) Thank you so much for coming.   I hope you had fun. BONNIE Of course we did, thank you so much. Bonnie and Nathan take their bag and walk off with Skye who immediately opens it, revealing \"Frozen\" swag, including elaborate DOLLS and SNOWMEN. CLOSE ON THEA THEA The \"Frozen\" gift bags was a deft touch. CLOSE ON GABRIELLE GABRIELLE They only sell the cheap stuff at the actual show. INT. MADELINE’S HOUSE, ED’S OFFICE - DAY 309   309 Ed is at work on his computer, as Abigail enters. ABIGAIL Whatcha doing? ED Designing this website for a new drone company.   Incredible, the technology. ABIGAIL Aren’t those things illegal now? ED Not yet.   Probably matter of time, though.   They need to make them with guns so we can get Constitutional protection. (CONTINUED) BLL - EP 3 \"Living The Dream\" - PRODUCTION DRAFT - 1-9-16   13.",
      "characters": [],
      "action_text": "ABIGAIL What happened between you and my father?   He said you threatened him. ED I didn’t threaten him. (off Abigail) I didn’t.   If anything, he was aggressive; he demanded that I make your mother be nice to Bonnie. Which I found to be ridiculous, truth be told. ABIGAIL Which part was ridiculous?   The idea of Mom being nice to Bonnie, or that my father should care? ED Okay.   I guess we know where you stand. ABIGAIL What’s going on with Mom? ED Nothing.   Why? ABIGAIL She doesn’t seem a bit agitated to you lately? ED Honey, agitation is her preferred state. ABIGAIL Well, it’s not mine, if that matters. And she exits the room as WE HEAR THE DOOR OPEN MADELINE (O.S.) Oh my god!   It was beyond great. OMITTED 310   310 INT. JANE'S TOWNHOUSE - CONTINUOUS 311   311 Jane and Ziggy walk in. CONTINUED: 309   309 (CONTINUED) BLL - EP 3 \"Living The Dream\" - PRODUCTION DRAFT - 1-9-16   14. JANE So good!   Did we have fun or not? Ziggy goes straight to the bathroom. ZIGGY You got Harry, right? Jane stops in her tracks. CLOSE ON HARPER HARPER Harry The Hippo had been with the school for over ten years. CLOSE ON GABRIELLE GABRIELLE And the cheap thing she replaced it with?   Made in China.   The hippo's face wasn't even friendly. INT. JANE'S TOWNHOUSE - LATER 312   312 Madeline and Jane.   Jane's head is in her hands. JANE They're all going to think I'm the most irresponsible mother.   And Ziggy will get blamed, as if things weren't already bad. MADELINE It's not a big deal-- JANE (suddenly) Why does this fucking shit keep happening to me? There's a look of rage in Jane's eyes... scary. Madeline is taken aback, a bit spooked. INT. CELESTE’S HOUSE, MASTER BATHROOM - SHOWER - NIGHT 313   313 CELESTE IS SHOWERING; she's almost meditative, letting the HOT WATER POUR OVER HER HEAD.   It's a bit of a safe haven in here, a respite... a place she feels warm, protected.   THE GLASS IS THOROUGHLY STEAMED UP, her choice; CONTINUED: 311   311 (CONTINUED) BLL - EP 3 \"Living The Dream\" - PR",
      "dialogue_count": 0,
      "word_count": 1761
    },
    {
      "scene_number": 3,
      "slugline": "INT. MADELINE’S HOUSE, KITCHEN - DAY 320   320 Ed and Madeline sit in stunned silence.   Finally-- ED It's my fault, I never should have gotten into it with Nathan. MADELINE It's not your fault.   It's mine, I just push too much.   I always have. ED Look at me. She doesn't. ED (CONT'D) Honey. She looks at him. ED (CONT'D) You are not losing her.   You and Abby are so close, maybe too close, which is why she feels... MADELINE She would never ever walk out if she knew I had cancer. ED You don't have cancer. MADELINE I'd be willing to get it. (admitting; some struggle) This is really rough, Ed. ED I know. A beat. ED (CONT'D) I know you don't want to hear this... but if it is your fault... your crime was that you were too good of a parent. (off Madeline) (MORE) (CONTINUED) BLL - EP 3 \"Living The Dream\" - PRODUCTION DRAFT - 1-9-16   23.",
      "characters": [],
      "action_text": "You've raised a strong-minded, autonomous young woman who can think for herself, who can express her feelings... equipped to make pretty big life decisions.   She's an extraordinary person.   Just like her mom. Madeline is genuinely moved.   God, did she need to hear that.   She takes his hand, squeezes it tightly. MADELINE (softly) Thank you. EXT. ORACLE BUILDING, SAN JOSE - DAY 321   321 A gleaming, shining building. Renata enters. GORDON (V.O.) Therapy? INT. ORACLE LOBBY - CONTINUOUS 322   322 WE FIND RENATA, heading to the elevator bank. RENATA (V.O.) It couldn't hurt. INT. GORDON’S OFFICE - DAY 323   323 A corner office, on the top floor, GREAT VIEWS... the office is well-decorated; oozes posh.   Renata has come to see him. GORDON She's six. RENATA But she's gifted, which makes her intuitively advanced and emotionally more vulnerable. GORDON Honey. RENATA Do not honey me. (off Gordon) Look, I know she enjoyed the party. CONTINUED: 320   320 ED   (CONT'D) (MORE) (CONTINUED) BLL - EP 3 \"Living The Dream\" - PRODUCTION DRAFT - 1-9-16   24. But you have to admit her excitement seemed tempered.   It was because Chloe and two other popular children weren't there. GORDON But seeking medical help-- RENATA Amabella internalizes, and a social slight can cause more psychological harm than being choked. GORDON I come back to, she's six. RENATA She wouldn't need to know she's seeing a child psychologist, some of the best ones now dress like clowns, we could sell it as another birthday surprise. He fights a smile. RENATA (CONT'D) You're laughing at me.   This is our daughter, Gordon. GORDON One of the reasons that you're so successful is because you're able to anticipate every possible hiccup.   It's one of your many gifts.   But one of the pitfalls... you have a tendency to way over- think things.   Amabella had a great time at the party.   How could she not?   It blew \"Disney On Ice\" away. Renata just stares.   A long beat. GORDON (CONT’D) What? RENATA Have I become tragica",
      "dialogue_count": 0,
      "word_count": 1556
    },
    {
      "scene_number": 4,
      "slugline": "INT. GORDON'S OFFICE, BATHROOM - DAY 325   325 Gordon Klein, pants down, has Renata, half-undressed, up on the sink; his butt-cheeks look to be in total spasm. As he thrusts away, RENATA YELPS, GRUNTS with orgasmic delight; pleasure.   Fifty years of sensible, practical, living -- it's all given way to reckless abandon now. Two Pagans in the woods. RENATA Yes.   Yes!   Fuck me!   Fuck me to the moon!   Fuck me to the moon and back!! (screams) Oh yes!   Fuck me to the fucking moon!!! Gordon’s buttocks convulse, quiver, and thrust, HE THEN SCREAMS, as he releases; then RENATA SCREAMS. CLOSE ON NIPPAL NIPPAL Thank you all for coming. REVEAL INT. OTTER BAY ELEMENTARY SCHOOL, AUDITORIUM - DAY 326   326 Principal Warren Nippal stands before a FULL HOUSE OF PARENTS.   MADELINE and ED included in the crowd. Madeline looks a little detached throughout, perhaps feels a bit empty. NIPPAL We’ll turn to various administrative matters shortly, but first, let me proudly report -- we are once again off to a wonderful new year, the faculty is excited, the students are engaged.   Optimism and joy abound from the entire Otter Bay school community. CLOSE ON THEA THEA Give me a fucking break. RESUME (CONTINUED) BLL - EP 3 \"Living The Dream\" - PRODUCTION DRAFT - 1-9-16   32.",
      "characters": [],
      "action_text": "NIPPAL Our first order of business today regards our Annual Fall Gala Fundraiser; given the unprecedented success of last year's Trivia Night, with the theme of \"Dead Celebrities,\" we have decided to come back with yet another costume gala, this time \"Elvis and Audrey\" night. ANGLE RENATA as she enters.   Reasonably put back together, but looking a little flush.   A hair or two out of place, which hasn't happened since the late nineties. NIPPAL (CONT’D) Where couples will be asked to dress up as Elvis Presley or Audrey Hepburn.   It should make up for a splendid evening of fun, fashion, and frivolity, one which should raise much-needed funding, going to the benefit of all our wonderful children. A HAND GOES UP IN THE FRONT ROW: THEA. NIPPAL (CONT'D) Yes, Ms. Cunningham. THEA We all dress as either Elvis or Audrey?   The same costumes for everybody? NIPPAL Part of the fun will be seeing the different interpretations. CLOSE ON SAMANTHA SAMANTHA It was a mistake to make people compete.   The guests all showed up with game faces on. CLOSE ON GABRIELLE GABRIELLE You can’t win in this town unless somebody else loses. CONTINUED: 326   326 (CONTINUED) BLL - EP 3 \"Living The Dream\" - PRODUCTION DRAFT - 1-9-16   33. CLOSE ON NIPPAL NIPPAL (offended; livid) That's not what got someone killed. EXT. OTTER BAY ELEMENTARY SCHOOL, PARKING LOT - LATER 327   327 Post-assembly; parents are heading to their cars.   WE FIND MADELINE and ED on a brisk move. MADELINE Of all the people for me to have to pretend to be.   Audrey Hepburn, oh yes, I'll look the spitting image. NATHAN (O.S.) Maddie. Madeline turns to see Nathan and Bonnie approaching. MADELINE Oh, great. (then; to Nathan) Nathan, hey.   Bonnie. BONNIE Hey, Madeline. Nathan nods to Ed. NATHAN Ed. ED Nathan. Ed is fixing a bit of a hard look on Nathan: \"go on, say something stupid, license me to hate you.\"   Nathan reads Ed’s expression, decides not to go there. NATHAN (to Madeline) Can I steal you for one sec? Madeline sighs, no",
      "dialogue_count": 0,
      "word_count": 4197
    }
  ]
}