{
  "slug": "big-little-lies-106-burning-love-2017",
  "title": "big little lies 106 burning love",
  "genre": "drama",
  "format": "series",
  "scenes_count": 6,
  "characters_count": 0,
  "characters": [],
  "total_words": 9111,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. CELESTE’S HOUSE, DECK - NIGHT 600   600 CLOSE ON PERRY.   Watching from the doorway. CELESTE STANDS THERE, staring at the ocean, a glass of wine in hand. She turns to look at Perry who joins her. CELESTE What? PERRY I need to leave again tomorrow, in the morning.   This time Phoenix. I’m back Thursday. CELESTE You’ll miss the play.   Opening night. PERRY I can see it when I get back. CELESTE But it’s opening night, there’s a whole big thing.   Madeline’s going to be so disappointed. PERRY I don’t want you going to the premiere either. CELESTE Excuse me? A beat.   He approaches. PERRY Come to Phoenix with me. CELESTE Honey... PERRY I think it would be the best thing. Maybe we could sneak off to Sedona, relive our honeymoon. CELESTE If I miss opening night, Madeline would never speak to me again. (CONTINUED) BLL - EP 6 \"Burning Love\" - PRODUCTION DRAFT - 3-21-16   4.",
      "characters": [],
      "action_text": "PERRY Madeline’s really beginning to piss me off. (a beat) C’mon.   How often do we get away together? CELESTE You see what you’re doing?   You’re the one who has to leave suddenly. And somehow, I’m the one who disappoints. He stares. PERRY My intent was to be romantic. A beat.   He caresses the side of her face.   She responds to his touch.   Perhaps surrenders to it. JOSH   (O.S.) Mom? Reality beckons. EXT. BONNIE’S HOUSE - NIGHT 601   601 BONNIE is TENDING TO HER HERB GARDEN.   NATHAN is there, bridling.   Bonnie is steadfastly unflappable. NATHAN I don’t want to. BONNIE (even keel) Madeline would take it as a slight if we just cancel. NATHAN Why is everything about Madeline? I am sick of Madeline.   One of the perks of leaving her was not having to sit down with her ever again at a fucking dinner table. BONNIE (mellifluous) Relationships don’t end with divorce, they simply transition. CONTINUED: 600   600 (CONTINUED) BLL - EP 6 \"Burning Love\" - BLUE - 3-27-16   5. NATHAN You know what, Bonnie?   When you see me chewing on the insides of my cheeks like this, not a good time to go Dr. Phil on me.   It isn’t normal for divorced people to be friendly.   To have dinner.   To be civil.   It’s okay for things to be ugly sometimes, y’know, it’s called life. BONNIE Got it, life can be ugly, I’ll make a note of it. ABIGAIL (O.S.) Hey. REVEAL ABIGAIL, approaching. ABIGAIL (CONT’D) What’cha doing? BONNIE Oh, just puttering in the garden, honey.   Trying to make things grow and evolve. That was meant for Nathan, which he well knows. NATHAN (to Abigail) What have you been doing locked behind closed doors all day?   This secret project of yours? ABIGAIL It won’t be secret for long, my official unveiling is Wednesday. BONNIE You’ve been working pretty hard on it. ABIGAIL Well, college admissions look for passion projects now, it’s not just about GPA’s and being captain of volleyball. (then; shifting gears) Listen, I just want to say... thank you for doing this dinner Tuesday. (",
      "dialogue_count": 0,
      "word_count": 930
    },
    {
      "scene_number": 2,
      "slugline": "INT. JANE’S PRIUS - MORNING 604   604 JANE DRIVES, ZIGGY rides, as WE HEAR the instrumental introduction of “ Papa Was A Rolling Stone ”. (CONTINUED) BLL - EP 6 \"Burning Love\" - BLUE - 3-27-16   8A.",
      "characters": [],
      "action_text": "Ziggy is watching THE TEMPTATIONS performing their song on a YOUTUBE VIDEO ON HIS IPAD. Jane approaches the drop-off at the Otter Bay Elementary carport. JANE Okay, baby, pulling up, we’re here. ZIGGY Wait.   My favorite part. As SHE PULLS IN-- JANE Hit pause, your favorite part will be waiting for you when I pick you up, I promise. ZIGGY Here it is. And THE TEMPTATIONS do a cool dance move, spinning on themselves. Suddenly, A RAP ON THE WINDOW.   Jane lurches to SEE MS. BARNES AT THE WINDOW.   JANE LOWERS THE WINDOW. MS. BARNES (to Jane) Can you come see me? We can see from her face, it’s urgent. INT. MS. BARNES’ CLASSROOM - MINUTES LATER 605   605 MS. BARNES (a bit ashen) There’s evidently a petition circulating, I just found out about it myself. JANE A petition? MS. BARNES Calling for Ziggy’s suspension. JANE Suspension from school? CONTINUED: 604   604 (CONTINUED) BLL - EP 6 \"Burning Love\" - PRODUCTION DRAFT - 3-21-16   9. MS. BARNES I’m furious about it, as is Mr. Nippal.   And we will get it stopped.   But in the meantime... JANE Are people actually signing it? MS. BARNES It seems so. JANE He’s six years old!   And we don’t even know that he’s the bully.   Is Renata Klein behind this? MS. BARNES I don’t know.   As I said, I just found out, and we will absolutely handle it.   Ziggy will of course not be suspended. CLOSE ON HARPER HARPER I’m not ashamed to say I started the petition.   The school was doing nothing. CLOSE ON NIPPAL NIPPAL The school was not doing nothing. CLOSE ON STU STU That Harper was so far up Renata’s ass she could chew her food for her. CLOSE ON THEA THEA I signed the petition. CLOSE ON GABRIELLE GABRIELLE I accidentally signed it. CONTINUED: 605   605 (CONTINUED) BLL - EP 6 \"Burning Love\" - PRODUCTION DRAFT - 3-21-16   10. RESUME MS. BARNES The petition we will get squashed. I’m more concerned... some of the children have been instructed not to play with Ziggy. That hits Jane right between the eyes.   And in her heart. INT. OTTER BAY ELEME",
      "dialogue_count": 0,
      "word_count": 2603
    },
    {
      "scene_number": 3,
      "slugline": "INT. CELESTE’S HOUSE, FAMILY ROOM - NIGHT   (FORMERLY SC. 615) 612E   612E Celeste is on her knees in front of Josh, looking into his mouth.   Max is there. CELESTE My baby lost another baby tooth. JOSH I put it under my pillow. MAX There is no tooth fairy, idiot. It’s mom and-- Celeste cuts Max off and shoots him a look. CELESTE Hey.   Get me a tissue. JOSH/MAX Is it still bleeding? The front door opens and they are all startled by Perry. PERRY (monster voice) Hey, hey, hey. Celeste is shocked to see him. CELESTE What??? PERRY Don’t we have a premiere to attend tonight? CELESTE You made it back for the play? PERRY I got lucky.   A guy cancelled his flight. CELESTE (as she walks to him) Oh, Perry. MAX (to Josh) They’re gonna kiss. (CONTINUED) BLL - EP 6 \"Burning Love\" - YELLOW - 4-11-16   23.",
      "characters": [],
      "action_text": "And Perry bends Celeste over, silent movie style, and gives her a kiss.   The boys laugh. CONTINUED: 612E   612E BLL - EP 6 \"Burning Love\" - YELLOW - 4-11-16   23A.",
      "dialogue_count": 0,
      "word_count": 180
    },
    {
      "scene_number": 4,
      "slugline": "INT. CELESTE’S HOUSE, BEDROOM - NIGHT   (FORMERLY SC. 616) 612F   612F Perry and Celeste.   As she’s getting ready for the night. CELESTE Thank you, Mr. Monster. He smiles softly.   Then-- PERRY You look amazing. CELESTE Thank you for that, too. He plays with her hair a little. CELESTE (CONT’D) We can’t be late. He trails his finger down Celeste’s neck to her breast. CELESTE (CONT’D) (tempted) Please don’t do that. PERRY (seducing) You don’t want me to do that? CELESTE (fighting off temptation) No. PERRY (almost cooing) Gee, you seem pretty adamant. CELESTE (weakly) Perry.   We have to get ready. PERRY We can be a little late. CELESTE Actually, we can’t. He slides her hand down to his groin, pushes it into him. (CONTINUED) BLL - EP 6 \"Burning Love\" - PRODUCTION DRAFT - 3-21-16   24.",
      "characters": [],
      "action_text": "PERRY I’ve been very excited to get home. CELESTE I can feel that. He gives her a kiss... and as he does, he unzips his fly... with the dexterity of a surgeon, he deftly has his penis out and in her hand. CELESTE (CONT’D) (half-amused but a little not) That’s quite a trick. And Perry pulls her in tighter, nuzzling her neck, manipulating her hand. CELESTE (CONT’D) (aroused but resisting) Honey... (breaking away) We have to go. PERRY Haven’t you been missing me? He takes her hand, positions it back onto his now- throbbing penis. CELESTE (not amused now) Perry, come on. PERRY (frustrated) What is wrong with you?   I come home, happy to-- CELESTE We’ll be late-- PERRY Why do you always have to be like this? The man still has a full erection, by the way. CELESTE (re: his erect penis) Did you take a pill or something? CONTINUED: 612F   612F (CONTINUED) BLL - EP 6 \"Burning Love\" - PRODUCTION DRAFT - 3-21-16   25. He’s not amused. PERRY Of course not.   You’re capable of arousing me without medication, pity that you can’t summon up the same passion-- CELESTE You’re being ridiculous-- And he grabs her arm. PERRY I just want to make love to my wife, that’s all. Playing with her hair again-- PERRY (CONT’D) (softening) And I don’t think I’m out of line, wishing my wife would want to make love to me. As she pulls away, he yanks on her hair, violently. She instinctively throws a punch, he catches it with his hand, and then with an open hand he straight-arms her in the jaw.   She staggers back... and in one fluid movement grabs hold of the tennis racquet on the table and is swinging it.   She makes full contact with his still-erect penis.   He screams out in pain, DROPS TO THE FLOOR.   She raises the racquet, almost swings again for his head, but stops herself.   As he writhes in pain on the floor-- OFF PERRY, WE HEAR SOME PIANO MUSIC... INT. CREST COMMUNITY THEATER - CONTINUOUS 613   613 ANGLE ON THE STAGE.   ACTORS AND PUPPETS ARE RIGHT IN THE MIDDLE OF THE PLAY. JOYCE (singing)",
      "dialogue_count": 0,
      "word_count": 717
    },
    {
      "scene_number": 5,
      "slugline": "INT. COMMUNITY THEATER LOBBY, POST-SHOW RECEPTION - LATER 613A   613A BOISTEROUS, CROWDED, AN ELECTRICITY ABOUNDS. ED (effusive) It was fantastic. MADELINE Right?   And the people seemed to like it, didn’t they? ED Like it? JANE They loved it. As Nathan and Bonnie appear. BONNIE Congratulations, Madeline. MADELINE Thank you. NATHAN I thought it was great.   I mean, I’m not a big fan of muppets, but... JANE (pulling out her phone) I’m gonna try Celeste. MADELINE Where’s Abby? NATHAN She had to rush out, but she told me to tell you she loved it. MADELINE Why’d she have to rush out? NATHAN This big project of hers.   Whatever it is... seems to be all-consuming. TORI Madeline. (CONTINUED) BLL - EP 6 \"Burning Love\" - PRODUCTION DRAFT - 3-21-16   28.",
      "characters": [],
      "action_text": "MADELINE Tori, hey. TORI Congratulations. MADELINE You, too.   And to Joseph.   Wow.   It was really great, wasn’t it? TORI It was. MADELINE You should be so proud of Joseph. TORI I am, I am. MADELINE So proud. A long beat.   It’s really awkward now.   Tori pulls Madeline aside. TORI Was it you? MADELINE I’m sorry? TORI I know he had an affair a year ago. It was you, wasn’t it? MADELINE Of course not.   I’m a happily married person, Joseph and I are friends.   I would never... he would never... My word.   I would never. TORI Why were you in his car? OMITTED 614   614 OMITTED   (MOVED; NOW SC. 612E) 615   615 CONTINUED: 613A   613A BLL - EP 6 \"Burning Love\" - PRODUCTION DRAFT - 3-21-16   29.",
      "dialogue_count": 0,
      "word_count": 256
    },
    {
      "scene_number": 6,
      "slugline": "INT. MADELINE’S SUV - NIGHT 615A   615A Madeline is seated on the passenger seat.   ED DRIVES. Silence. ED Kinda quiet. MADELINE Oh... just reflecting on it all. ED Big night.   I would think you’d be bubbling over a bit with pride. You should be. MADELINE Thanks. (then) Thinking about this dinner coming up with Nathan and Bonnie. Dreading it. ED It’ll be fine. She’s not sure about that.   And Madeline’s phone vibrates.   She looks at it, sees Celeste’s ID. MADELINE (to Ed) Finally.   She better have a damn good reason. (to the phone) Where were you? Madeline listens.   Her jaw suddenly drops to the floor. MADELINE (CONT’D) WHAT?! OMITTED (MOVED; NOW SC. 612F) 616   616 INT. MADELINE’S HOUSE, KITCHEN / LIVING ROOM - NIGHT 617   617 Ed is there with Madeline speaking in hushed tones. ED A broken urethra? (CONTINUED) BLL - EP 6 \"Burning Love\" - PRODUCTION DRAFT - 3-21-16   30.",
      "characters": [],
      "action_text": "MADELINE Yeah.   Wow.   Can you imagine? Obviously they must’ve been having sex.   I mean, there’s no bone to break when it’s flaccid, is there? Madeline turns towards Chloe who’s watching SOME MUSIC VIDEO ON YOUTUBE, HER IPAD CONNECTED TO THE TV IN THE LIVING ROOM: ” Grass is Greener/Live version ” from St. Paul And The Broken Bones. MADELINE (CONT’D) Time to go to bed, young lady. CHLOE Gimme ten. MADELINE Chloe. CHLOE I’ll give you seven, final offer. MADELINE Now. Chloe turns the TV off, runs into the kitchen, kisses her parents good night and runs into her room. ED So it happened... during... MADELINE Talk about wild sex. ED Yeah.   Talk about it. She reads his face, measures his tone. MADELINE What’s that s’posed to mean? ED I just can’t imagine the passion it must take to shatter a urethra in two places. MADELINE You sound envious.   Would you like me to smash yours? Ed shoots her a look.   Funny. CONTINUED: 617   617 (CONTINUED) BLL - EP 6 \"Burning Love\" - PRODUCTION DRAFT - 3-21-16   31. ED Not smash it, but... we never have wild sex. (off Madeline) We have nice sex, I like it.   But let’s admit it.   The whole thing times out between four and six minutes, and neither of us are remotely in danger of physical injury. MADELINE That’s a really mean thing to say, Ed. ED Sorry.   Maybe I am envious. (off Madeline) Perry walks in the door, and whoosh?   I wish we had that kind of desire. MADELINE By we, you mean me. ED Okay.   You’re a fiery person, which makes your “tepid-ness” for me more conspicuous. A beat.   She looks away. ED (CONT’D) I don’t mean to punish you. MADELINE Well, you’re certainly doing a good job of it. ED I tell myself all the time, “hey, married couples after awhile, they reach a sexual plateau, it’s the norm.”   And when I hear of other couples breaking urethras... MADELINE It’s not like you’re a raging bull, most nights you only touch me reaching for the Visine ‘cause you’ve got dry eye. CONTINUED:   (2) 617   617 (CONTINUED) BLL - EP 6 \"B",
      "dialogue_count": 0,
      "word_count": 4425
    }
  ]
}