{
  "slug": "billions-101-pilot-2016",
  "title": "billions 101 pilot",
  "genre": "drama",
  "format": "series",
  "scenes_count": 9,
  "characters_count": 4,
  "characters": [
    "FERN",
    "MAN",
    "AXE",
    "FABER"
  ],
  "total_words": 14913,
  "total_dialogue": 4,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. BEACH HOUSE, MONTAUK - DAY 1   1  A MAN is LYING ON THE FLOOR of a vacant, unfurnished house.  It’s not clear if he’s injured or resting or meditating. And  it’s not just a house, it’s a palace.  CLOSE ON: The Man. BOBBY “AXE” AXELROD, early 40s, but in  excellent physical shape, like an ex-college wrestler.  Casually dressed, the intensity and intelligence in his eyes  is far from casual.  He listens to the sound of the waves, through open French,  doors crashing on the nearby beach. The squawk of a sea bird  pierces the moment.  Axe gets up, stretches, checks the views as he walks through  a massive cook’s kitchen. He notes a detail on the cabinetry.  Then he strides into the Great Rooms, cavernous, sprawling.  The dining rooms, lush. He runs his hands over fine woodwork,  marble. He feels the hardware, testing the seal on the doors  as they open and close.  Axe exits through a side door.  EXT. BEACH HOUSE, POOL - DAY 2   2  Axe REMOVES his clothes, completely, DIVES into what seems to  be an Olympic-length swimming pool.  Axe goes the distance of the pool underwater. When he gets to  the far end, he props himself up on his arms, surveys the  entire thing. A slow, determined smile comes to his face.  EXT. BEACH HOUSE, REAR - DAY 3   3  He exits the house and walks the beach, his feet seeming to  float on the fluffy white sand.  He could be trespassing or it could be he’s in a dream…  EXT. BEACH HOUSE, FRONT - DAY 4   4  He appears from around the side of the house.  He’s not in a dream. This is his life. He crosses to a  waiting Bentley, CHAUFFEUR inside.  MIKE ‘WAGS’ WAGNER leans against the car. Wags is a bit  taller, more stylishly dressed and more Patrician in manner.  (CONTINUED)",
      "characters": [
        "FERN",
        "MAN"
      ],
      "action_text": "A smiley real estate agent, FERN, waits expectantly. Axe  ignores her. WAGS and FERN notice he’s wet but don't speak to  it.  AXE  Dovetail joints. The kitchen  cabinets. All hand done.  WAGS  The things   you   notice.  AXE  Real quality is never on the  surface.  FERN  I told you it was special, Mr.  Axelrod.  A beat. Axe turns to her. She’s nervous and keeps talking.  FERN  The Norton spread is the last of  the important beach front  properties. They only come  available once in a generation.  We see a look in Axe’s flinty eyes, and it’s hard to  determine if it’s humor or contempt.  AXE  Was I first.  NOTE: whenever Axe asks a question, he conveys the idea that  he already knows the answer. It’s a tactic. And also: most of  the time, he does.  FERN  I can’t lie.  AXE  Sure you can.  He looks her over.  AXE  But you won’t. Go on.  BILLIONS - 2nd Yellow Revisions - 02/09/15 *FULLY COLLATED*   2.  CONTINUED: 4   4  (CONTINUED) FERN  Barton Oakleigh was first. But only  because he’d been courting the  owner for ten years.  AXE  They really stick together, these  fucking old-line WASPS...  He turns to Wags.  AXE  No offense, Wags.  WAGS  None taken. I work for a living.  AXE  An exception to the breed.  He turns back to Fern.  AXE  The ask.  FERN  Eighty-three million.  AXE  And he went to Bart Oakleigh to get  it. He should’ve come to me first.  WAGS  Chopper’s waiting. We’re gonna be  late--  AXE  How am I late when it’s my fucking  chopper.  Wags shrugs, amused. Axe leans in to him.  AXE  I don’t get   wowed   very often  anymore.  WAGS  Oh, boy.  AXE  Guy like me--people who built this  place wouldn’t even let me stay in  their servant’s quarters back then.  BILLIONS - 2nd Yellow Revisions - 02/09/15 *FULLY COLLATED*   3.  CONTINUED: (2) 4   4  (CONTINUED) WAGS  A lot’s changed.  AXE  Yeah.  Fern gathers herself.  BILLIONS - 2nd Yellow Revisions - 02/09/15 *FULLY COLLATED*   3A.  CONTINUED: (3) 4   4  (CONTINUED) MAN  Not a great idea.  DOMINATRIX  That’s not a ‘",
      "dialogue_count": 2,
      "word_count": 1763
    },
    {
      "scene_number": 2,
      "slugline": "INT. U.S. ATTORNEY CHUCK RHOADES’ OFFICE - DAY 12   12  SPYROS  Look at this.  SPYROS takes the folder from Chuck and starts spreading out  pieces of paper with lots of rows of data.  BILLIONS - 2nd Yellow Revisions - 02/09/15 *FULLY COLLATED*   8A.  (CONTINUED)",
      "characters": [
        "AXE"
      ],
      "action_text": "SPYROS  You can all study the charts, or I  can give you the answers to the  test: these three small firms all  knew exactly when to buy and when  to sell the stock.  CONNERTY  They had inside information. You  must get pings like that every day.  SPYROS  We do.  CHUCK  So get ‘em talking, and fine ‘em.  SPYROS  It’s bigger than that. All three  firms have links to Bobby Axelrod.  A BEAT. This is a big deal. Chuck’s eyes flare at the name,  he looks like he wants blood, but he plays it cool.  This isn’t remotely satisfactory to Spyros. He grabs the  folder, pulls out THREE 8” x 10” PHOTOS.  INSERT PHOTOS.  SPYROS  Dan   Margolis , Century Capital.  Lenny   Bosco , Old Oaks Investments.  Peter   Decker , Quaker Ridge  Financial. This is big. It’s  criminal. And I want to be part of  treeing Bobby Axelrod--  CHUCK  Hey, I want to be an astronaut, but  I get air sick in choppy weather.  Looks at Spyros.  CHUCK  Your burden of proof is lower.  They’ll talk to you because they’re  happy to pay a fine and move on.  I’m at the coalface. And I don’t  appreciate you strolling in here,  telling me how to deploy my  resources, because you can’t build  your own case.  BILLIONS - 2nd Yellow Revisions - 02/09/15 *FULLY COLLATED*   9.  CONTINUED: 12   12  (MORE)  (CONTINUED) Especially considering how much we  have on right now.  He nods to a big white board which reads: TERRORISM and  INTERNATIONAL NARCOTICS, SECURITIES & COMMODITIES FRAUD TASK  FORCE, COMPLEX FRAUDS, PUBLIC CORRUPTION, ORGANIZED CRIME.  SPYROS  You’re still taking bows from  busting up that drug cartel--  SACKER  We didn’t break down the door of  some warehouse in the Bronx. We  systematically dismantled a  criminal organization that used the  proceeds of their drug operation to-  SPYROS  I get it: you guys are rock stars--  CONNERTY  We get it--you want to be one too.  CHUCK  None of that matters. Look, Spyros  if you’ve lucked onto some trail of  bread crumbs that leads to Bobby  Axelrod, it could be a win for",
      "dialogue_count": 1,
      "word_count": 2059
    },
    {
      "scene_number": 3,
      "slugline": "INT. CHUCK’S OFFICE - DAY 17   17  Chuck and Connerty eat at Chuck’s desk,  CHUCK  And you do not want Mike Tyson in  his prime. Remember what happened  to the guys who fought him then?  CONNERTY  They got their faces pushed in. But  eventually he got beat. Buster  Douglas knocked him on his ass.  Ketchup.  Chuck slides over the Heinz.  CHUCK  Eventually is the key word. When  Tyson was ready to go. Since my  appointment, the office is  undefeated in financial  prosecutions--81 and 0. That’s  because I know when the time is  right.  CONNERTY  I get it, but this would be a big  one.  CHUCK  Bryan, what do you think happened  this morning?  CONNERTY  We got significant information.  CHUCK  Maybe. Or maybe it was Spyros  setting us up. See: if we go first  and lose in the criminal action,  Spyros and the SEC can still get  him civilly. So if we win, Spyros  wins. If we lose, Spyros still  wins.  CONNERTY  Damn. Ketchup’s empty.  CHUCK  We’ve got to play three dimensional  chess. Axe is a folk-hero in this  town.  BILLIONS - 2nd Yellow Revisions - 02/09/15 *FULLY COLLATED*   18.  (MORE)  (CONTINUED)",
      "characters": [],
      "action_text": "Guy gave the New York City Fire  Department Foundation $100 million--  last year. Police gave him a plaque  at Ground Zero with his name on it.  CONNERTY  Spitzer’s name was on all the  highway signs too. Signs come down.  Chuck gets a kick out of this.  CHUCK  That’s why I love ya, man. But a  good matador doesn’t try to kill a  fresh bull. You wait until he’s  been stuck a few times. We need an  opening, no matter how small--a  shift in momentum--before we start.  Then we get the guy the moment he’s  get-able, just like the rest. But  not if there’s a chance we lose.  Right now, Axe’s game is too tight.  The whole thing, too fraught.  CONNERTY  What about the other issue, the one  Spyros mentioned: home. Was he  right about that?  Chuck’s eyes are as flat as his tone.  CHUCK  No.  Chuck starts eating. After a moment, Connerty does too.  EXT. AXE CAPITAL - DAY 18   18  Lara walks June out toward the parking lot.  JUNE  I’m sorry, I don’t know what...  LARA  It’s a tough day for everyone.  JUNE  I just...I just had to sell the  Oceanis, which Dave just loved--  BILLIONS - 2nd Yellow Revisions - 02/09/15 *FULLY COLLATED*   19.  CONTINUED: 17   17  CHUCK (CONT'D)  (CONTINUED) LARA  I’m sure that’s why it upset you.  I’ll drive you home in your car,  Andy will follow us. Keys.  BILLIONS - 2nd Yellow Revisions - 02/09/15 *FULLY COLLATED*   19A.  CONTINUED: 18   18  (CONTINUED) June hands over her keys. Lara signals her DRIVER.  LARA  Me, I never set foot on a yacht  until I started dating Bobby. In  Inwood, growing up, the only  boating we did was the Staten  Island Ferry. Big Irish family,  five sibs. Close though. Firemen,  cops, nurses. When I first moved up  here, this world, I saw how  everyone looked at me. I had my  frosted hair, but not the Warren-  Tricomi kind. Like out of a box.  And I cursed more than you all do  in public.  JUNE  I never judged--  LARA  Course not. So I got my act  together. And I’m comfortable in  this life. But certain things you  learn i",
      "dialogue_count": 0,
      "word_count": 3567
    },
    {
      "scene_number": 4,
      "slugline": "EXT. AXELROD HOME, WESTPORT - DUSK 31   31  HELICOPTER SHOT: Pushing in off the Sound, establishing the  lush enclave of Westport and...the Axelrod house:  Massive. A classic colonial book-ended by large 18th century  restored barns that create a ring around a pebbled driveway.  From the outside, Axe’s home is elegant, despite the fact  that it’s bigger than some small towns.  INT. AXELROD HOME - NIGHT 32   32  The place goes on forever, but there are warm, understated,  classic design elements throughout.  In a place of honor is a framed photo. A FIREFIGHTER, DEAN  BENJAMIN, in his dress uniform with the dates 5/3/1975-  9/11/2001 on a brass plaque at the bottom.  FOLLOW an out of control GERMAN SHEPHERD as he careens around  corners until he arrives, panting, in the...  INT. AXELROD HOME, KITCHEN - NIGHT 33   33  The Axelrod’s chef, RYAN, holding a serving dish piled high,  sticks out a leg, stopping the dog.  A HOUSEKEEPER grabs hold of the dog’s collar and struggles to  get it out of the room.  There are several dining rooms, but Axe, Lara and their boys  Dean and GORDIE, 8 eat around the kitchen counter.  As Ryan puts down the tray, Axe notices the dog’s struggle.  AXE  Ah, let him free. It’s ok. Let him  go free.  The Housekeeper does and the dog goes a little crazy. Axe  laughs. As do Lara and the kids.  AXE  Live-wire, that one.  The dog runs over to a corner of the kitchen.  BILLIONS - 2nd Yellow Revisions - 02/09/15 *FULLY COLLATED*   34.  (CONTINUED)",
      "characters": [],
      "action_text": "LARA  Yeah. He chewed up a custom sofa.  Gotta calm him down.  DEAN  Send him to obedience school.  LARA  He’s going to the vet to get fixed.  Axe winces. The boys get it. Giggle.  LARA  Guys--what do you say to Chef Ryan?  KIDS  (rote)  Thank you.  LARA  Okay. Dig in.  All three Axelrod men grab biscuits, as they are also being  served the cutlets by Ryan.  And then the dog sprints to the breakfast nook across the  kitchen and SPRAYS the furniture and floor.  The Housekeeper scrambles over.  AXE  See that, boys. He’s marking his  territory.  LARA  He’s peeing on the furniture.  AXE  Yeah but he’s showing Ryan who’s  boss. That’s why it’s called a  pissing contest when two men try  and stake out their turf.  LARA  Yeah, well, I don’t love it when  men do it either.  Axe takes a bite of corn, looks at the dog, now barking up a  storm as he’s dragged from the room, tosses him a biscuit.  BILLIONS - 2nd Yellow Revisions - 02/09/15 *FULLY COLLATED*   35.  CONTINUED: 33   33  (CONTINUED) AXE  Poor guy. Okay! Dean. You ready?  Seventh president. Hint. He came  two after Monroe.  BILLIONS - 2nd Yellow Revisions - 02/09/15 *FULLY COLLATED*   35A.  CONTINUED: (2) 33   33  (CONTINUED) DEAN  Jackson. Andrew Jackson.  Axe turns to Gordie.  AXE  Where was he from?  GORDIE  Let’s talk Yankees.  His older brother laughs.  DEAN  ‘Cause you don’t know. Don’t switch  the subject.  Axe watches, smiling.  GORDIE  I do know.  DEAN  Prove it.  GORDIE  Seattle?  Dean laughs harder.  DEAN  There was no Seattle back then.  Idiot!  Gordie hangs his head.  DEAN  I knew you didn’t know it.  GORDIE  I bet I’d get it on the next guess.  DEAN  I bet you don’t.  GORDIE  How much?  DEAN  Ten pushups.  GORDIE  Deal.  BILLIONS - 2nd Yellow Revisions - 02/09/15 *FULLY COLLATED*   36.  CONTINUED: (3) 33   33  (CONTINUED) They shake. Gordie’s manner changes.  GORDIE  Border areas near The Carolinas.  Lara and Axe crack up.  AXE  You can’t fall for that every time,  Dean. See, he knows his customer  and ",
      "dialogue_count": 0,
      "word_count": 1905
    },
    {
      "scene_number": 5,
      "slugline": "INT. PENTHOUSE APARTMENT - DAY 39   39  The elevator opens directly into a lavish but tasteful  apartment. The ELEVATOR MAN holds the door as Chuck exits.  Chuck walks through a foyer into a living room.  CHUCK  Mom.  ELLEN RHOADES, late 60s but looks younger, dressed in  understated Upper East Side style offers a cheek for a kiss.  ELLEN  Hello, dear. I hear you’ve been  busy. He’s in the den.  INT. PENTHOUSE APARTMENT, DEN - DAY 40   40  Its a clubby room. Chuck finds Chuck Sr. in a leather chair.  CHUCK  What the hell was that stunt?  SENIOR  Skip Wolkowska’s an old friend. He  asked for help and I didn’t want to  refuse. But I was ninety percent  sure you’d react the way you did. A  win any way you look at it.  CHUCK  How’s that a win?  SENIOR  I knew Skip’s lawyer would spread  it and it’d land in the news. If  you treat me that way, they’ll all  fear you. You need this right now.  To be seen as tough on Wall Street.  CHUCK  Some audible to call.  SENIOR  You’re welcome.  Senior gestures to his computer.  BILLIONS - 2nd Yellow Revisions - 02/09/15 *FULLY COLLATED*   44.  (CONTINUED)",
      "characters": [],
      "action_text": "SENIOR  Now, listen, you didn’t smile  enough during the presser. You let  them get to you.  CHUCK  You’re right.  SENIOR  I didn’t like that question about  Axe Capital. What prodded it?  CHUCK  My guess: Spyros planted it. SEC  wants me to move on Axe.  SENIOR  If you move on him, and take that  risk,   you   have to get the reward.  Let the SEC mop up, collect their  fines, but they can’t be seen as  leading it.  CHUCK  I know.  SENIOR  Don’t underestimate that Spyros.  You can’t be seen as having  Washington leading you around by  the nose.  CHUCK  I said “I know,” dad. I have some  ideas.  SENIOR  Good. Your focus needs to be on how  to deal with Axe. He’s popular.  Don’t forget the first few Gotti  prosecutions. A lot of people have  Axelrod’s back in this city. He’s  made them a lot of money. You know  the line: if you’re going to strike  at the king...  Chuck nods.  CHUCK  The king is house shopping right  now. Prime beach front, heritage.  Hasn’t even come to market yet.  BILLIONS - 2nd Yellow Revisions - 02/09/15 *FULLY COLLATED*   45.  CONTINUED: 40   40  (CONTINUED) This puzzles Senior.  SENIOR  That would be a mistake. A  conspicuous buy like that, in the  news, he goes from a billionaire  you can pull for to another rich  asshole. Right now, if you take him  on and lose, the city will be  laughing at you. But if he turns  the populous against him, it makes  you look like a hero whether you  win or lose. Because you’re risking  your reputation   for   the   people . He  gives his edge to you...Nice idea,  but he won’t make that mistake.  CHUCK  Probably not. But the motor that  runs a guy like Axe, revs at a very  high speed. Eventually he’ll have  to take it out for a spin.  BILLIONS - 2nd Yellow Revisions - 02/09/15 *FULLY COLLATED*   45A.  CONTINUED: (2) 40   40  (MORE)  (CONTINUED) I passed word he shouldn’t buy it.  An admiring look from Senior.  SENIOR  Smart. He doesn’t like being told  what he can or can’t have. Maybe I  could have a friend make",
      "dialogue_count": 0,
      "word_count": 2577
    },
    {
      "scene_number": 6,
      "slugline": "INT. BRONX RESTAURANT - DAY 45   45  A six-table eatery. Axe is in back with Dimonda.  DIMONDA  I didn’t know this place was open  for lunch.  AXE  It’s not.  Dimonda looks around, realizes the place is EMPTY.  AXE  We’re off the record. If you fuck  me I never talk to you again.  DIMONDA  Got it.  AXE  Good. If you ever want to come  here, just call me. Now why is my  name coming out of your mouth at a  press conference.  DIMONDA  Hey, it was before you asked me to  lunch.  Axe laughs.  AXE  Jump in.  DIMONDA  Let’s talk about those kids you put  through college--  AXE  That’s the one question that’ll get  me walking away from the table.  It’s between them and me. And I  don’t talk about it with anyone  else.  Dimonda begins again.  DIMONDA  Okay. Why do you think it’s fair  for you to have it both ways?  BILLIONS - 2nd Yellow Revisions - 02/09/15 *FULLY COLLATED*   57.  (MORE)  (CONTINUED)",
      "characters": [
        "FABER"
      ],
      "action_text": "To write public letters to boards  of directors when you want the  media to help you shame them, to  drive down the stock, but then  you’re secretive and refuse to even  talk on the record about anything  else?  AXE  Fair isn’t the question. It’s   all   a  negotiation. You--the media--know  that better than anyone.  DIMONDA  My job is to tell the public what’s  going on.  AXE  That’s pure capitalism. You have a  business. I have a business. What’s  next.  Food arrives, wine.  DIMONDA  Ok. Softball. Underhand. Give me  some insight into how you process  information--  AXE  The press acts like information’s a  dirty word. Everyone has access to  the information. We just know how  to analyze it better.  Axe tries to leave it at that, but can’t help himself.  AXE  Now you answer me one: when did it  become a crime to succeed in this  country? America used to salute the  guy in the limousine. They wanted  to be the guy in the limousine.  They still want to. But now they  throw eggs at it. And you know why--  because of guys like you--the media-  -you hate us, and turn them against  us.  Axe leans back. Dimonda drops the reporter pose.  BILLIONS - 2nd Yellow Revisions - 02/09/15 *FULLY COLLATED*   58.  CONTINUED: 45   45  DIMONDA (CONT'D)  (CONTINUED) DIMONDA  I only went egging once. Biggest  house in the neighborhood and they  never gave out any candy, so they  deserved it. We destroyed that  place.  AXE  Once? You’re an altar boy. That was  every Halloween for me. We’d plan  for weeks, stash cartons, let em  rot. And we’d go so late that not  even the cops were out anymore.  They share a laugh at this. Then, after a beat...  AXE  You’re from around here, right.  Dimonda realizes Axe has checked him out, admires it.  DIMONDA  Grand Concourse. Then White Plains.  AXE  Me too. Well, Yonkers. But it  wasn’t nice back then.  DIMONDA  Yonkers used to be a place you  could really get your ass kicked.  They let it hang there for a second and then both crack up.  AXE  You’re a",
      "dialogue_count": 1,
      "word_count": 2311
    },
    {
      "scene_number": 7,
      "slugline": "EXT. US ATTORNEY’S OFFICE - DAY 51A   51A  Chuck, still carrying the weight of the suicide, enters.  BILLIONS - 2nd Yellow Revisions - 02/09/15 *FULLY COLLATED*   67A.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 28
    },
    {
      "scene_number": 8,
      "slugline": "INT. US ATTORNEY’S OFFICE - DAY 52   52  Chuck moves through, realizes a hush has fallen over the  office and STAFF. Sacker is there and looks to him. Connerty  notices him enter too. Chuck stops.  CHUCK  Rough morning. Part of the price we  pay for representing the people.  But a reminder like this is useful.  What we do has consequences,  intended and unintended. The  decisions we make, the actions we  bring, have weight. I’ll have to  carry this one. Would I have given  a break to some drug dealer? No. So  why would I give one to a  businessman? None of this can  change our mission: come to work  every day and be just and strong in  the actions you bring, and don’t  waver.  Chuck gives a nod and moves on. After a beat...  SACKER  That’s it. Back to work.  Across the office, Connerty falls into step with Chuck.  A quick smile from Connerty and he flashes his iPad, which  shows the headline.  CONNERTY  Front fucking page of the Post.  Beach Bum! It’s like he’s daring  you.  The slightest smile on Chuck’s lips as they arrive at his  office and enters...  INT. U.S. ATTORNEY CHUCK RHOADES’ OFFICE - DAY 53   53  They enter and a new white board has been set up, with a  picture of Axe at the top. Below blank space, at the bottom  are THREE PICTURES, with names: Dan Margolis, an X over his  face, Pete Decker, and Lenny Bosco.  CHUCK  Next up to the plate: Pete Decker,  Put together a team.  BILLIONS - 2nd Yellow Revisions - 02/09/15 *FULLY COLLATED*   68.  (MORE)  (CONTINUED)",
      "characters": [],
      "action_text": "We’ve got a lot of work to do.  CONNERTY   *  So now you’re sure...   *  CHUCK   *  Yeah. And not just because of the   *  PR cushion he’s giving us. At that   *  conference, up close. I got a read   *  on him.   *  Chuck warms to it.   *  CHUCK (CONT’D)   *  It’s psychology. I looked in his   *  eyes and dared him. No matter how   *  bad he wants that place, if he has   *  nothing to hide, he walks away.   *  Because he’s a disciplined player.   *  And he knows it’s the disciplined   *  move. To avoid the hassle. To avoid   *  me finding out that some portfolio   *  manager who sits on the other side   *  of his office has a gambling   *  problem. Or that his energy sector   *  guy paid off a regulator. No. If   *  he’s innocent he passes. But a   *  guilty man, he buys that house to   *  show me he’s not afraid. That he   *  has nothing to hide. He has to make   *  a stand.   *  Connerty gets it.   *  CONNERTY   *  So we take a look at Axe Capital.   *  Chuck turns to the whiteboard filled with info on Axe.   *  CHUCK   *  Yeah. We take a real close look.   *  Connerty turns with him and they study what they’ve got.   *  EXT. BEACH - NIGHT 54   54   *  HELICOPTER SHOT: Racing along the beach, push into...  BILLIONS - 2nd Yellow Revisions - 02/09/15 *FULLY COLLATED*   68A.  CONTINUED: 53   53  CHUCK (CONT'D)",
      "dialogue_count": 0,
      "word_count": 521
    },
    {
      "scene_number": 9,
      "slugline": "EXT. BEACH HOUSE, MONTAUK - NIGHT 55   55  The house, now Axe’s, is empty, but beautifully illuminated.  We see Axe, Lara, and kids through the window, celebrating.  Axe’s cell phone rings. He answers it.  HALL (O.S.)  There’s movement.  ANGLE ON: Axe, taking it in.  INT. RHOADES HOUSE, DEN - NIGHT 56   56  Chuck enters. It’s late. Wendy is in the den, laptop open.  CLOSE ON: Chuck’s face, awareness that he has just engaged  the battle, putting it all--home, family, career--at risk.  And then he masks it, sits down next to her.  CHUCK  You waited up.  WENDY  And made sure the kids were asleep.  I wanted to see you.  She shuts her laptop. Chuck runs his fingers through her  hair.  CHUCK  Me too.  They kiss. She grabs a handful of his hair, YANKS IT.  CHUCK  That hurts.  WENDY  I’ll bet it does.  The kissing becomes more intense. His hands go down her body,  past her thighs until they cross her knee and reach the  STILETTO BLACK SUEDE KNEE HIGH BOOTS.  FADE OUT.  BILLIONS - 2nd Yellow Revisions - 02/09/15 *FULLY COLLATED*   69.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 182
    }
  ]
}