{
  "slug": "bill-and-ted-face-the-music-2020",
  "title": "bill and ted face the music",
  "genre": "sci-fi",
  "format": "film",
  "scenes_count": 3,
  "characters_count": 0,
  "characters": [],
  "total_words": 16545,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. BOOTH - ON BILL AND TED Bill and Ted - stunned, amazed - gape out at the circuits of time.. for the first time in a long time.   And we cut to: INT. GREAT DOME - THE YEAR 2712 - DAY The booth appears and touches down on the floor.   Rollins gets out, followed by Bill and Ted.   Bill and Ted whisper: TED Dude. BILL What? TED I think I liked Rufus better. BILL Me too. (turns to Rollins) What is it you   do   here, dude? ROLLINS I clean up messes. The guys look at each other as they hear.. BOOMING VOICE Bill and Ted.   Step closer please. Now they turn and see: THREE IMPOSING FIGURES-- who look at Bill and Ted with barely restrained urgency and frustration. They are fierce, unblinking.   It’s dark and intense.   Bill and Ted look at each other, swallow. Around the room is a kind of “Senate” of observers who line the walls.   Bill adopts an upbeat manner. BILL How’s it goin’?   Good to be back again. Lookin’ great. LEADER What do you have to say for yourselves? TED Oh.. They look at each other, then adopt their arm-raised posture.  21.",
      "characters": [],
      "action_text": "BILL Be excellent to each other..? TED And.. party on, dudes..? Dead silence.   No smiles.   No nods.   Nothing but scowls. LEADER Where’s the song? The guys eyes widen.. TED Oh.. The song. BILL Which one?   We’ve written so many. LEADER The song.   The song that will fulfill your destiny.   The one that is to be played at the Fabulous Forum tomorrow night.   The one that will save the world as we know it. BILL Oh, yah.   That song.   We definitely have that song.   Yah. The Leader makes a gesture.   Lights come up and suddenly all around them are MUSICAL INSTRUMENTS of all shapes and sizes. LEADER Then play it. TED Like right now? LEADER We need to hear it. TED Um.. Before we do that -- BILL Which we very much look forward to doing -- TED And are most eminently prepared to do -- BILL Being as it’s already written --  22. TED And is very good on the level of lyrics, and melody, and rhythmic aspects as well as meter and, you know, thematic content.. we need to.. BILL Tweak.. TED Yah.   Tweak.. BILL Or, even better, perhaps what would expedite this entire process.. TED Would be if you played the song for us right now. BILL Or perhaps played it several times. TED Or even just give us a recording.   So we may be certain we have the exact rendition of our greatest song ever written.. A pause. LEADER You don’t have it. BILL What?!   No.   Just the opposite. TED In fact, our problem is we have so   many  great songs that as we put together our set list for the concert tomorrow night -- BILL The one we in no way bailed on years ago -- TED And which as recently as an hour ago did not try to get our money back from - BILL Right, that did not happen.. TED You’re not watching us all the time, are you?  23. Silence.   Then the Leader just waves his arms and THE FLOATING GREAT FIGURES DISAPPEAR INTO DARKNESS -- as do the instruments, and instantly-- Rollins is standing right in front of the guys. ROLLINS The window of destiny is closing.   You have twenty four hours to come up wi",
      "dialogue_count": 0,
      "word_count": 6477
    },
    {
      "scene_number": 2,
      "slugline": "EXT. FRONT OF THE HOUSE - SAME Police cars in the driveway, lights flashing.   A cop is interviewing Eddie Van Halen.   A third car squeals into the driveway and Deacon - ten years older now - jumps out. DEACON Tell me this isn’t my brother and Bill. COP Sorry, Deac. Deacon sighs, grabs a bullhorn and yells: DEACON Ted!!   Come out right now, or I’ll have to call Dad!! EXT. BACK OF EDDIE VAN HALEN’S HOUSE - SAME The guys hear Deacon’s voice on the megaphone. TED (yells) Deacon!   It’s not me! 55 YR OLD TED Yes, Deacon!   It totally IS me! FRONT OF HOUSE Deacon and the other cops - along with Eddie Van Halen - listen to the voices from the back yard: TED (O.S.) This me talking is from ten years ago, and I don’t have anything to do with this! BILL (O.S.) It’s totally true, dude!   It’s the future us’s that you want! 55 YR OLD BILL (O.S.) Shut up, Bill! BILL (O.S.) You shut up, Bill! Deacon grabs his radio. DEACON Dad, you gotta get down here.  52.",
      "characters": [],
      "action_text": "BACK OF HOUSE Bill looks to Ted. BILL We gotta make a break for it. TED Yah, but how?   They’re us - they remember everything we’re gonna do. BILL That means we gotta do something we can’t possibly remember. TED How do we do that? Ted thinks a moment, then.. TED (CONT’D) Dude - check it out. Ted pulls his shirt up so his head is hidden.   His arms flail. TED (O.S.) (CONT’D) I totally can’t see where I am! Bill nods - does the exact same thing.   And now.. UP ON THE ROOF 55 Yr Old Bill and Ted look at each other, alarmed. 55 YR OLD BILL Oh no.. The head in shirt move. 55 YR OLD TED I was hoping those younger us’s wouldn’t think of it this time. DOWN BELOW We HEAR Bill and Ted’s voices as we see what basically looks like two headless bodies running in circles. BILL   (O.S.) Dude!   What do we do? TED (O.S.) No idea! That’s the point!  53. They spin, sprinting in odd, random, chaotic, arbitrary directions - like pinballs - as they rush out the gate and start spinning down the alley.. Falling at times, bumping into each other, into walls.. Tripping, getting up.. For a moment Bill’s shirt drops. BILL Oh no!   I can see! (then; pulling his shirt up) Spin me dude!   I can’t know where I am! Ted spins him and pushes him over and now the two of them start ROLLING DOWN THE HILL - gaining speed.. FRONT OF HOUSE Into the swarm of police cars out front, CHIEF LOGAN screeches to a halt, jumps out, enraged. LOGAN TED! DEACON Dad, I think Ted needs help.   He was talking to himself like he’s two people-- LOGAN This ends now.   The lies, the delusions. I’m done with him.   I’m done with both of them. (turns; gives the signal) Take them!   Now! And the cops burst the door down and race into the house. AT THE BACK OF PROPERTY - SAME 55 Yr Old Bill and Ted yell from the top of the hillside: 55 YR OLD BILL You guys are idiots!   This woulda worked! 55 YR OLD TED You haven’t heard the last of us!   We’re gonna get you, Bill and Ted! Suddenly cops come out, guns drawn. LOGAN Drop your wea",
      "dialogue_count": 0,
      "word_count": 4845
    },
    {
      "scene_number": 3,
      "slugline": "EXT. FORUM - NIGHT Above, the sky starts to DARKEN ominously.   LIGHTNING flashes.. Some cracks start to appear in the ground.   We PAN TO: THE 76 STATION ACROSS FROM THE FORUM Where a guy gets out of his car to pump gas and stops short - totally baffled as he sees: An EQUALLY CONFUSED ROMAN SOLDIER - in toga, with 1st century weaponry - just standing there, under the fluorescent light of the gas station. Both men stare at each other, utterly confounded.   And we cut to: EXT. HEAVEN - DAY Stark, white, quiet. As if we are up in the clouds. The POLICE CAR is parked.   Deacon and Logan are standing, waiting.   In silence.   For a long while.   Until, finally: LOGAN Fine.   Ted wasn’t wrong. (off Deacon’s look) He was right.   Ted was right.   Ted was.. totally, one hundred percent right.   About everything.   You happy? Deacon nods.   Footsteps.   Death approaches, exiting a heavy, gold door. LOGAN (CONT’D) How’d it go? DEATH My bad.   I thought I could get the gate key.   But the truth is, the old man just got pissed. That’s the bad news.   The good news?   I just got scored a new Play Station which is pretty rad, and since we’ll be spending a lot of time - like “eternity” - together-- LOGAN (interrupting) No.   Absolutely not.   I’m not staying here. DEATH Well I’m afraid you don’t get to make the--  76.",
      "characters": [],
      "action_text": "LOGAN No.   No no no.   My son is in serious jeopardy - and I have a job to do. He pushes past Death and through the gold door, which closes with a solid whoomph. Deacon and Death look at each other as, OFFSCREEN, we hear Logan’s insistent, muffled voice - and a lower, booming, also muffled voice - talking over each other. Death looks at Deacon, raises an eyebrow. DEATH Wow.   Your old man has a very big ball sack, bro. There’s a brief beat of silence.   Followed by a low PHHUP- PHHHHHUP, and then.. MUFFLED AUTHORITARIAN VOICE OW-OWWWW.. Which is then followed by a very heavy THUD.   And groaning. And then Logan storms out, eyes straight ahead - jaw fixed - holding a GILDED SKELETON KEY. DEACON Did you just bean-bag God, Dad? LOGAN Yes I did.   Get in. Deacon turns - follows his father to the car. DEATH I’ll try to smooth this out. Say hi to the fellas for me.   And - oh - one thing.   Can I keep that chill Jack Johnson CD? Deacon hands Death the CD, the police car screams away.. then shimmers and disappears and we cut to: INT. GREAT DOME - DAY (2713) --BANG - the phone booth lands, roughly, followed a half beat later by the silver booth. The guys get out - shaken   - and find themselves face to face with the THREE GREAT LEADERS, who are scowling, furious. LEADER You have failed utterly.  77. Though inside the dome, we HEAR UTTER CHAOS coming from outside:   thunder - the ground is quaking - screaming.. people in the dome are running. LEADER (CONT’D) Why we ever put our hopes in you two idiots is beyond me. And he and the others turn, stride off.   There is a final BEEEEEEP on the timepiece as it runs out. The guys just stand, looking down at it-- horrified, speechless. Then Rollins steps between them.   They look at him. BILL What’s going to happen? Rollins indicates for them to follow. WITH THE GUYS - A MOMENT LATER As Rollins leads them, shell-shocked, into the room which houses the TIMELINE. ROLLINS This is the new reality. He points all the way down towards ant",
      "dialogue_count": 0,
      "word_count": 5223
    }
  ]
}