{
  "slug": "bird-box-2018",
  "title": "bird box",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 9,
  "characters_count": 0,
  "characters": [],
  "total_words": 21650,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. MALORIE’S BATHROOM - DAY Malorie drains her tub after a bath. She’s wrapped a towel around her head, partly dressed in bra and panties, so it’s clear she is six months pregnant. This is five years earlier. She looks radiant, bright-eyed, and when she unwraps the towel, LONG HAIR flows out. Malorie runs a hand over her baby bump. Questioning. All by herself, naked both physically and emotionally, she stares at her belly as if it were concerning news. INT. MALORIE’S LIVING ROOM - DAY A painting of a river hangs over a cheap fireplace. Nearby, a TV plays a fashion reality program. Malorie sits on the floor with her back against a faded sofa. She’s dressed comfortably now, but made up. FASHION HOST ON TV (O.S.) And now it’s time to transform her from ‘hot mess’ to ‘princess.’ Before Malorie: a baby shower gift in pretty wrapping paper. Around it lay the paper remains of previously opened gifts. She tears into the wrapping. This baby shower gift is a wipe warmer. And a card. WRITTEN INSIDE: “Better find a husband soon! xo Alison” Malorie makes a noise with her teeth. MALORIE (sotto) Alison, you bitch. She clucks her tongue and logs the gift on a notepad. Malorie sits up as someone enters her front door. JESSICA, Malorie’s sister. A skinnier, fiercer version of Malorie. Carrying groceries like they’re 500 pounds. JESSICA Holy fuck, the store was packed. This thing is serious. MALORIE What?  6.",
      "characters": [],
      "action_text": "JESSICA Turn to the news. MALORIE What channel? Jessica carries the bags to the kitchen. Over her shoulder: JESSICA Any of them. SWITCHING CHANNELS, the TV lands on footage of two ambulances at a park at night, loading bodies on stretchers. NEWS ANCHOR (V.O.) And in Tula, a city south of Moscow, last reports estimated a death toll of twenty-one thousand. It’s yet to be determined if this is from an airborne pathogen, but some liken the symptoms to a sudden onset of psychotic behavior. Malorie gets up and follows Jessica. INT. KITCHEN Jessica unloads the bags. Malorie loiters nearby. RUSSIAN OFFICIAL ON TV (O.S.) --not that we know of, but somehow it’s spreading at an alarming rate, which is why we are being careful-- MALORIE It’s in Russia. JESSICA Try telling that to the soccer moms fighting over the bottled water. I don’t want you going out there until people remember to calm the fuck down. Okay? Is Dad texting you survivalist bullshit? Jessica uncaps a beer bottle with her shirt, takes a swig. MALORIE I was in the bath. I have that OB appointment, remember? JESSICA Shit! Right. I can drive you.  7. MALORIE Maybe we should postpone. Jessica faces Malorie, who won’t make eye contact. JESSICA Hey. We talked about this. It’ll be fine. You’re having this baby. MALORIE Yeah. (then) Of course. JESSICA I was an accident, too. Ask mom. Jessica goes back to stowing the groceries. MALORIE But Dad never bailed on Mom. JESSICA Doesn’t matter. Moms are moms. Malorie nods. Trying to buy into it. JESSICA (CONT’D) How goes the Great Unwrapping? MALORIE It goes. I don’t know what half this stuff does. Alison got me something. JESSICA Seriously? What? MALORIE (grin forming) A wipe warmer. JESSICA (laughs) Perfect. You’ll think of her every time you wipe the kid’s ass. C’mon, let’s get you to the doctor. Jessica grabs her car keys and her purse from the counter. NEWS ANCHOR (O.S.) --but the CDC has not found any evidence of a contagion.  8.",
      "dialogue_count": 0,
      "word_count": 586
    },
    {
      "scene_number": 2,
      "slugline": "INT. LIVING ROOM Jessica passes Malorie, on march for the front door, but Malorie lingers a moment, captivated by something on TV. ON SCREEN: low-quality dashboard camera footage of civilians fleeing past the car in a downtown district. One of the people running by wears a HOSPITAL GOWN. INT. HOSPITAL EXAM ROOM - DAY Malorie sits on an exam table, wearing a HOSPITAL GOWN. DR. SUE LAPHAM (40s, cheery) is dressed in a white coat over her street clothes, and she gestures with her clipboard. DR. LAPHAM Thanks for meeting here, by the way. Another patient of mine is about to pop. How have you been feeling? Sleeping any better? MALORIE Sleep is still rough. No one told me how hard it would be to get comfortable in this shape. DR. LAPHAM You know my method? Couch cushions on the bed. Here and here, so your belly fits between them. MALORIE I’ll try that. DR. LAPHAM You’re due in twelve weeks, so let’s try some natural remedies for the insomnia before I prescribe anything. (casually) You have a name picked? MALORIE Not yet. Something about it... It hasn’t really clicked with me. You know? The idea. Motherhood. DR. LAPHAM That’s normal. It will pass. Malorie smiles sadly and nods. While holding that smile:  9.",
      "characters": [],
      "action_text": "MALORIE What if it doesn’t? Dr. Lapham reads from her clipboard. DR. LAPHAM Everything will change after the baby’s born. Now, let’s talk about the next trimester. Expect more weight gain, but if it gets more than forty pounds over where you were before, call me. CREEPING IN on Malorie as she listens to the doctor, and it all plays out on her face: A silent war against encroaching anxiety. She looks away. Takes a breath as Lapham continues: DR. LAPHAM (O.S.) (CONT’D) Heartburn will be more common. You might also deal with hemorrhoids, discharge, bleeding, and varicose veins, that’s all natural. Be aware of Braxton Hicks contractions at odd hours, like tremors before a real quake... The doctor’s voice grows more and more distant as Malorie struggles to keep it all together. And then-- INT. HOSPITAL BATHROOM - MOMENTS LATER Malorie vomits into the toilet bowl. She cleans herself up at the sink and stares at herself in the mirror. Her own bloodshot eyes stare back. Malorie washes her face. Then goes to the towels to dry her face and hands. Nearby: A basket of reading material. Magazines. Pamphlets. Flyers about parenthood, childbirth. Malorie notices one. Picks it up. The headline: “YOU HAVE A CHOICE. // Give your child to a good home!” An informational flyer on adoption. Malorie considers something. Then puts the flyer in her purse.  10.",
      "dialogue_count": 0,
      "word_count": 445
    },
    {
      "scene_number": 3,
      "slugline": "INT. HOSPITAL - DAY A cacophony of noise. Malorie navigates a hallway, leaving Lapham’s office. A pair of PARAMEDICS rush by the other way, wheeling a MAN with a leg injury on a gurney. INT. HOSPITAL LOBBY The commotion is louder here. Other PATIENTS waiting for urgent care watch in horror at the scene playing out in the corner of the room-- A WOMAN in a pricey jogging suit and glossy fingernails shrills at two NURSES trying to close in on her-- As she SCREAMS non-words she digs her fingernails into her right cheek and begins to tear into her flesh-- With her other hand she starts with the thin skin around her eyelid and pulls-- And the NURSES go for her and blood gets everywhere and Malorie hurries out the door amid the AD LIB SHOUTS-- EXT. HOSPITAL - MOMENTS LATER Malorie gets to Jessica’s car in visitor parking. Shaking. Jessica waits in the driver’s seat, texting on her phone. INT. JESSICA’S CAR Jessica doesn’t look up from her phone as Malorie gets in. JESSICA How’d it go? Still having a baby? MALORIE It’s happening now. This gets her attention. JESSICA The baby? MALORIE No, the-- whatever it is in Russia. The thing that makes you go crazy? I think it’s here.  11.",
      "characters": [],
      "action_text": "JESSICA Doctor Lapham is crazy? MALORIE Can we get going please? JESSICA Okay, number one, you gotta calm down for me. And B-- Outside, an ambulance drives up, lights and sirens going, and screeches to a halt at the door. The back of the ambulance rocks violently from some struggle playing out inside. Jessica notices, tosses her phone in her purse, throws it in back, and starts the car. EXT. PARKING LOT Jessica’s car tears out just as two squad cars pull in. INT. JESSICA’S CAR - DAY Malorie holds her phone to her ear. JESSICA Who are you calling? MALORIE Mom and Dad. JESSICA They’ll be fine. Takes an act of congress to get them out of their house more than once a week. Malorie listens with the phone to her ear. MALORIE Voicemail. (to Jess) It went to voicemail. Jessica lets out a stiff breath, then changes lanes. JESSICA We’ll swing by. But I’m calling it now: They’re both fine. At the next red light, they pull up alongside another car. A YOUNG MAN drives with his pretty GIRLFRIEND.  12. He nods at Malorie. Malorie nods back. They’re strangers, but just checking in with each other. It’s okay. Then: A loud but distant CRACK. And a RUMBLE. Malorie looks around -- it’s behind her. Four blocks back and one or two over: A FIRECLOUD. Smoke rising like black cellophane. JESSICA (CONT’D) Damn. Seriously? MALORIE I don’t like this. Jess, can we just go? Maybe we just drive. In the adjacent car, Young Man with his panicked Girlfriend does that: he looks at cross traffic, and runs the red light. Other traffic screeches and veers, HONKING. MALORIE (CONT’D) Jess-- JESSICA I’m not doing anything stupid. You’re pregnant. The light turns green a moment later. Jessica mashes the gas. EXT. SUBURBAN NEIGHBORHOOD - DAY Upper middle class. Not mansions, but trying. Jessica’s car navigates the streets amid sparse traffic. The clouds are the color of fresh bruises. Distant thunder. INT. JESSICA’S CAR Jessica and Malorie take the ride in silence. Tense. Malorie fidgets nervously. MALORIE W",
      "dialogue_count": 0,
      "word_count": 2735
    },
    {
      "scene_number": 4,
      "slugline": "EXT. SUBURBAN NEIGHBORHOOD - DAY Five years later. Ivy has snaked over an orphaned tricycle. Rust cakes a car’s sideview mirror. EXT. RIVER - DAY Malorie steadies herself on the row boat. Girl turns her head toward Malorie. GIRL You stopped rowing. MALORIE Just taking a break. Keep listening. No talking. Beat. But because she’s four years old: GIRL (sotto) How much longer? MALORIE (sigh) A few hours. BOY (sotto) What is it like? MALORIE (sotto) I don’t know. It’s a safe place. Protected with high walls. They say there’s even a courtyard, so you can walk around outside. Girl asks it like it’s Santa Claus: GIRL Trees? MALORIE Trees. (hardening) Now if you refuse to keep quiet, tell me the steps again. Tell me the steps.  24.",
      "characters": [],
      "action_text": "GIRL Eighty-six, forty-four, thirty. MALORIE Boy. Landmarks. BOY Statue. Bridge. Car. Stone. MALORIE Good. Now quiet. Listen. GIRL (beat, sotto) What’s a car? Malorie realizes: They don’t know. The children have never seen one. Before she can explain-- BOY I hear something. Girl straightens up. Her ear perks along her scalp. Malorie reaches out to the shoebox. Inside: The flutter of tiny wings. But otherwise silent. MALORIE (sotto) Is it... BOY I don’t know. GIRL I hear it, too. And now Malorie does. A faint but rhythmic CLAPPING. MALORIE Can you tell where it’s from? Neither child answers for a moment. Then: BOY It’s getting closer. Malorie dips the oar back into the water--  25. It yanks in her hand, nearly slipping. The current is fast. And now we see what’s making the noise. A sunken BOAT, its deck still partly surfaced. Part of a human skeleton dangles from a cabin door. This vessel is too big to navigate these shallow waters, and now it’s debris. Malorie’s boat is on a collision course. And none of them sees it coming. Their blindness makes them eerily unguarded as-- The rowboat SMASHES into the shipwreck-- Lurching everyone and everything inside-- Malorie ballasts herself with the oar but-- A backpack tips overboard and then-- BOY falls off the back-- BOY (CONT’D) Malorie! She felt it coming and snake-swift GRABS his leg through some maternal instinct-- But hanging onto him starts to tip the boat over-- MALORIE Boy! And Boy flails and splashes-- And Malorie lies flat and drops her oar but refuses to let go of the Boy’s jacket-- The boat hits a shallow point, slowing abruptly-- Boy manages to get his hands on the boat again, coughing up water, his breath pluming in the cold air-- Girl is quietly having a nervous breakdown, her hands on the blindfold, ready to pull it off-- Malorie gets both hands around Boy-- Hefts him back into the boat, soaking wet, crying, bleeding-- BOY Malorie Malorie Malorie--  26. MALORIE Shh shh, I got you. BOY I’m cold. MALORIE Girl: ",
      "dialogue_count": 0,
      "word_count": 3537
    },
    {
      "scene_number": 5,
      "slugline": "INT. GARAGE - DAY ANGLE ON A CAR: A Cadillac. Upper-middle-class luxury. But American. The product of living close to Detroit. Tom climbs in. Others from the group spill into the garage, trying to figure it out. CHERYL You’re gonna drive there? TOM It’s faster. Easy to stay together. And it’s safer. DONALD How is it safer to drive blind? Tom starts up the car. The in-dash GPS navigator boots up. Tom smiles. TOM We’re not blind. SERIES OF SHOTS: - Tom cuts up a cardboard box with a pair of scissors. - Black electrician’s tape spreads over the windshield. - The top of a pillowcase catches as a window seals up. - More tape secures the pillowcase to the window. - Tom removes the rearview mirror with a wrench, to remove any tape-gaps in the windshield. INT. GARAGE - DAY Tom’s last flourish: taping over the tiny camera above the license plate on the back. Tom stands with his arms crossed, nodding at his work. Lucy, Malorie, Donald and Greg all stand with him. The Cadillac looks like a makeshift meth lab. Every window is blacked out with cardboard, tape, and linen. Lucy checks it out more closely. LUCY It’s like a car for vampires. (grins at Tom) Cool.  44.",
      "characters": [],
      "action_text": "Tom opens the driver’s door, climbs in, and starts the engine. The Cadillac thrums to life. The interior glows from the light of the electronics. INT. CADILLAC - LATER Still idling in the garage, driver door ajar. Tom sits at the wheel. Malorie sits shotgun. In back: Lucy and Felix. Lucy carries a golf club with her, and Felix has armed himself with a hand-axe. Greg hands Tom a sticky note from outside Tom’s door. GREG I made a list, going by your math. Get as much as you can. TOM Will do. GREG The store address is eleven oh one Longview Street. TOM Already in the system. Now get inside, and I’ll raise the door. GREG Okay. I... Good luck. Tom nods and shuts the car door. The interior feels more like a submarine, lit by the dome light. Malorie pulls out a slip of paper. Considers it. MALORIE Tom... TOM What do you have there? She holds it out for him. MALORIE This is where my parents live. I was going to check on them-- TOM Malorie--  45. MALORIE --and I just, I haven’t heard from them and I know it’s out of the way but I just need to know. I’m sorry-- TOM Hey, hey. He takes her hand with the note and closes her fingers over it. Tom isn’t taking the address. He’s having her keep it. But he’s being tender with her about it. TOM (CONT’D) I get it. I do. We all want to know about someone. But we have to get used to not knowing. Or else we won’t make it. Okay? Malorie takes a ragged breath and nods. Tom reaches up and presses a button on a remote. Click! The group listens to the sound of the garage door opening. Tom touches the navigation screen. FEMALE GPS VOICE (V.O.) Calculating route. A map appears, with a thick red line forming an L-shape along the streets. Tom puts the car in reverse. EXT. STREET - DAY The rear bumper advances at us, reverse lights aglow. INT. GREG’S HOUSE - DAY Cheryl begins searching in drawers by the entertainment center, tidying up as she goes. OLYMPIA So, are all of you, like, friends and family? CHERYL We didn’t know each other before last we",
      "dialogue_count": 0,
      "word_count": 4138
    },
    {
      "scene_number": 6,
      "slugline": "INT. KITCHEN - NIGHT Water pours down a funnel from the pail into a plastic jug. Malorie then gets a glass for herself. INT. LIVING ROOM - NIGHT Malorie sits on the couch, drinking the water. Her attention drifts to the coffee table, where the landline phone sits alongside the Stonebridge phone book. She scoots the book toward her, flips through the pages. And then picks up the receiver. Holds it to her ear. Remarkably, there is still a dial tone. (This is probable but only with old landline telephony.) Malorie flips to the yellow pages section and finds a listing for the hospitals. She starts dialing. Behind her, over her shoulder, the open kitchen area. And, farther still, the back door in the mud room. That area is unlit now, but the white of the back door stands out. And the door starts to open. Malorie doesn’t hear. She’s busy trying numbers. PRESSING IN on Malorie as she dials and listens for a working number on the other end, edging out the view of the door and the kitchen as something gets closer... Then that sound. That otherworldly, inhuman noise. Malorie’s whole body goes rigid with sudden fear. She snaps her eyes closed and leans down into the couch to try and hide. Her shallow breath is overtaken by the sound of rasping. Close on her face, eyes firmly shut, and then-- Two ragged FINGERS with wet, black talons on the ends reach in and press against her cheek and eyebrow. Malorie whimpers in shock, tries to turn away from the contact, but then--  65.",
      "characters": [],
      "action_text": "The fingers spread, pulling her eyelid open, forcing her to look directly at the thing-- Her pupil contracts in terror--  And for a singular frame we see: A wide-mouthed, pale, wet FACE with bulging eyes like a deep-sea monster, then--  INT. MALORIE’S BEDROOM - NIGHT Malorie wakes up from the nightmare, breathless. Her hair is damp with sweat. It takes her a moment to calm down. Olympia snores softly in the neighboring bed. Malorie reaches for a glass on her nightstand. It’s empty. INT. FOYER Malorie descends the stairs with her empty glass, headed for the kitchen. She passes the front door... A moment later, there’s a VOICE from outside. STRANGER (O.S.) Anyone? Hello? Malorie freezes. Tense. Waits it out. A pause. Silence. Malorie turns, shaking her head, then: STRANGER (O.S.) (CONT’D) Help, is there anyone? Malorie goes to the door and calls out: MALORIE Someone there? STRANGER (O.S.) Oh god, oh thank god. The sound of boots on the wood planks of the front entry. Fumbling sounds of the blanket insulating the front door. MALORIE Who is it?  66. His voice rises at the end of his sentences, so sometimes they sound like questions. STRANGER (O.S.) My name is Gary? I’m, I got lost scavenging for food and, hello? Is this the front door? MALORIE It’s the middle of the night. GARY (O.S.) Is it? Shit, it’s been hours... Malorie looks upstairs for help. No one else is awake. She hesitates. Then remembers the budgies. They slumber in their cage, a few paces away. Unfazed. Malorie double-checks by picking up the box and holding it close to the door. She whispers to them: MALORIE (to budgies) Is it safe out there? GARY (O.S.) Please. It’s cold. Can I come in? MALORIE There’s a protocol. I can’t let you inside right now. You have to wait. GARY (O.S.) I fell and I’m bleeding. I can’t see how bad it is? I don’t want to bleed to death, please... Malorie sets the box of budgies down and debates with herself. They didn’t consider someone with an injury when they made the rules. She c",
      "dialogue_count": 0,
      "word_count": 3327
    },
    {
      "scene_number": 7,
      "slugline": "INT. UPSTAIRS HALL - MOMENTS LATER Cheryl steps out of the hall bathroom, still full of dread. Lucy catches up to her at that moment. Nearly passes her by. LUCY Hey. You okay? CHERYL Oh, yes. (then) I don’t know how you do this. You’re so... brave. And clever. Cheryl’s whole concept of who Lucy was has been demolished. It’s enough in this moment for Lucy to revise her views, too. She reaches out and puts a comforting hand on Cheryl. LUCY I’m scared, too. Just like you. But we got this. Because we’re clever. Cheryl nods, mustering courage again. CHERYL Yeah. Okay. INT. GREG’S HOUSE - DOWNSTAIRS BATHROOM - DAY Malorie washes her face with water she pours from a jug. She hears voices nearby. Leaning out the door, she spies-- DONALD AND TOM facing off in the dimly-lit dining room, near a china cabinet of plateware no one will ever use. DONALD No one’s thinking about it. TOM What are you on about this time? Donald speaks quickly with clenched teeth: DONALD Soon we’ll have two infants. That’s an added strain to our food supply, our medical supply, and fresh water supply, not to mention the noise of two crying babies could bring those things right to our door. What are you gonna do when that’s a problem?  82.",
      "characters": [],
      "action_text": "Tom is done with Donald’s shit. TOM What’s your solution? Go on. DONALD Doesn’t matter, I’m not the leader. You are. They’re your problem. One day you’ll have to tell everyone the only way to guarantee survival is to stab out your own eyes, and then we’ll see how popular you are. TOM Is that what this is about? Being leader? Fine, take it. It’s yours. Go tell everybody your plan. Donald balks at this. Starts to retort but doesn’t have a ready comeback. Tom slaps him on the shoulder. TOM (CONT’D) All right, then how about you try to think in terms of group survival versus just your own. Okay? Tom leaves Donald to stew his own fear of leadership. DONALD Maybe I will. Malorie, who’s seen this all, slinks out of the bathroom. INT. MUD ROOM - DAY At the back door, Tom is first to arrive at the mud room for the supply run. Malorie approaches and hugs Tom. He hugs back. But she doesn’t let go. Into his ear: MALORIE I read that when you hug for twenty seconds, it releases oxytocin into your system. Helps calm the nerves. TOM I’ll take it. MALORIE What did you do? Before all this.  83. TOM You really wanna know? (then, grinning) Optometrist. There goes my career. Malorie laughs. Nearly snorts. A genuine surprised laugh. It’s infectious, and gets Tom giggling. MALORIE Oh my god! Ohh. I can’t remember the last time I laughed. Thank you. She puts her hand on his chest. He keeps it there. An unspoken invitation to tenderness. Malorie’s eyes sparkle. TOM And you? What did you do? MALORIE Whatever paid the bills until I figured out what I want to be. TOM A mom? MALORIE Not really. I’m terrible at it. The budgie in the box near Tom TWEETS softly. Lyrically. TOM I don’t think you give yourself enough credit. You’re a survivor, and survivors make good parents. (grins) Wouldn’t I make a good father? Malorie looks up at Tom. Wondering if he’s asking what she thinks he is. She starts to reply, when Tom looks past her: TOM (CONT’D) Gary? Malorie looks back to find Gary standing nearby. F",
      "dialogue_count": 0,
      "word_count": 793
    },
    {
      "scene_number": 8,
      "slugline": "EXT. GREG’S BACK YARD - DAY From the tarp-covered back door, a four-person chain emerges on march alongside the house. Tom leads, followed by Lucy, then Cheryl, and Gary brings up the tail. They walk with one hand on the shoulder of the person in front of them. All wearing some form of blindfold. INT. MUD ROOM - MOMENTS LATER Malorie stays by the door, listening to Tom’s voice leading the group away. DONALD (O.S.) Tom better come back. She looks over at Donald, who’s been watching her. MALORIE Why do you care now? DONALD He’s the glue of the group. And most of you wouldn’t know how to survive on your own. Donald exits down into the basement, leaving Malorie cold. INT. LIVING ROOM - MOMENTS LATER Malorie sits down next to Olympia and returns to holding her hand. Olympia smiles through her cramps. OLYMPIA Can we-- (breathes) Can we do something distracting? MALORIE Like what? OLYMPIA Anything. Malorie looks around and her eyes land on the phone book, next to the phone. She gives the book to Olympia and puts the phone in her lap.  86.",
      "characters": [],
      "action_text": "MALORIE Here. Turn to the bookmarked page and read me the next number. Olympia opens the book to find PAGE AFTER PAGE of residential names either circled or crossed through. Stopping at ‘M.’ OLYMPIA What is this? MALORIE I’ve been calling people, leaving messages when I get a machine. Maybe there’s a doctor out there, or someone who knows more about what’s going on. Anyway, it be nice to talk to someone new. Yeah? Olympia doesn’t argue. She finds the next name. OLYMPIA Bill Martinson. 980-1023. Malorie dials the number. Listens to it ring. MALORIE (into phone) Hello, yes, my name is Malorie. There is a group of us here in Riverbridge, on Shillingham Drive. If you get this message, call us back at this number. Please. OLYMPIA Julie Marx. 761-8811. Malorie dials another number. Listens. Waits. Shakes her head at Olympia. Olympia marks through the name, but winces at the end of it, dropping her marker. Her eyes go wide-- OLYMPIA (CONT’D) Malorie. It’s happening now. MALORIE You sure? (off her look) FELIX! EDGAR (O.S.) It’s comin’ out. Malorie whips around to see EDGAR at the entry.  87. He stares at the two women, clutching a thermos in one hand. The other shakes as if from Parkinson’s. And his fingertips are fully blackened from using charcoal sticks. EDGAR (CONT’D) Only one room with enough space for you to do it. The attic. MALORIE The attic? That’s your room. Edgar keeps talking like it’s a done deal. Donald arrives in time to hear Edgar’s speech: EDGAR We used a midwife for our two kids. You’re gonna need lots of water. Sponges. Towels. Surgical tools would help but I doubt you got those, so you can cut the cord with a pair of scissors an’ a coupla binder clamps. Malorie nods, feeling more uneasy by the moment. MALORIE Okay. Thanks. EDGAR And a belt. OLYMPIA A belt? EDGAR Give you something to bite down on. So you don’t scream. (leans in) There’s gonna be a lot of blood. Felix enters from the kitchen with a bowl of dry Choco-Burst. FELIX That right there? Is why e",
      "dialogue_count": 0,
      "word_count": 3172
    },
    {
      "scene_number": 9,
      "slugline": "EXT. BACK LAWN - DAY The sun hangs low over the lawn, where a fire burns. A bonfire made of a pile of bodies. Malorie stands a dozen paces away, hearing it burn. She wears a scarf over her eyes. And carries a pole on her shoulders. Water jugs dangle from the pole. In this pose, in this light, she looks like Lady Justice. Among the burning bodies: The ADOPTION FLYER she took from the hospital so long ago. “You have a choice!” It catches fire. SERIES OF SHOTS The months tick by: 1) Malorie opens the phone book, red pen in hand. 2) Malorie holds infant Girl in a rocking chair to the sounds of Frank Sinatra on the radio. The house is a mess. 3) A fire burns in the fireplace. The babies are close for warmth. Malorie’s breath is visible. 4) The phone book. The final name in the Z alphabet. Last one in the book gets a red line through it. 5) Malorie hangs up the phone in defeat. Utterly alone. INT. NURSERY - NIGHT A year later. The two crib-forts sit in the room. Covered by a blanket. Malorie arrives. Trembling. Holding a hypodermic needle in her hand. Outside, something bumps against the house. A tree, maybe. The wind. Malorie approaches the cribs. Draws back the blanket. Inside: Boy and Girl. Each maybe a year old. Asleep. Fitful sleep. Malorie cries silently. Reaches in with the needle.  102.",
      "characters": [],
      "action_text": "The pointy tip is charred black from heat. Pointed straight down. Shaking in her grip. It hovers over Boy’s left eyelid. An inch. Less. Malorie’s fingers reach and open Boy’s eye. A breath from receiving the needle. Something creaks nearby. Something stirs. Malorie looks up and recoils in surprise. Girl sits up in her crib. Looking at Malorie. Head tilted. Just watching. Innocent. Confused. Malorie puts a hand to her mouth. Drops the needle. Slumps against the wall. A mess. For a long time, she sits there. INT. BATHROOM - DAY Eyes and nose red from tears, Malorie steps in. Stares at her reflection in the mirror. She reaches out, picks up a pair of scissors. Brings them to her face... And then starts to cut her own hair. PANNING to the mirror... It’s now the end of the haircut. Short-cropped. A warrior’s cut. Malorie hardens her face. She’s made a decision: Survival. But on her terms. INT. LIVING ROOM - DAY Two years later. Boy and Girl are both nearly the age of the opener. Playing with simple toys. Sounds of HAMMERING nearby. Malorie reinforces a wood plank over a window. Muscular arms. Still short hair. When she’s done, she steps back.  103. MALORIE All right. Going out for dinner. You remember the rules? The children nod. Malorie nods back, like a sergeant. She crosses past a wall now covered with a giant Riverbridge city map, likely taken from a municipal building. The map is riddled with push-pins. She’s covered a lot of ground. Before Malorie leaves for the back door-- GIRL Malorie? MALORIE Yes, Girl. GIRL Do you think you’ll get to letter ‘K’ again today? The phone book rests open again on the coffee table. Its place marked by the pen. MALORIE (beat) We’ll see. EXT. WOODS - DAY Quiet. Stillness. Malorie crouches, following a string. Her boots crunch under the winter ground. The string leads to a rabbit trap. Something furry caught inside. Malorie feels it: A dead rabbit. EXT. BACK LAWN - DUSK Malorie, still blindfolded, carries two dead rabbits tied together,",
      "dialogue_count": 0,
      "word_count": 2917
    }
  ]
}