{
  "slug": "black-lightning-101-the-resurrection-2018",
  "title": "black lightning 101 the resurrection",
  "genre": "action",
  "format": "series",
  "scenes_count": 5,
  "characters_count": 0,
  "characters": [],
  "total_words": 12997,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. GARFIELD HIGH GYM - DAY He looks up and sees the teenage boy mentioned in the wanted poster, EARL CLIFFORD. He’s tied to the backboard of the basketball goal, like a crucifixion. As Black Lightning stares up at Earl, a drop of blood falls from his drenched mask onto the floor. Black Lightning slowly pulls off his mask and we reveal that Jefferson Pierce IS Black Lightning. ANISSA (PRE-LAP) Dad. CUT TO: PRESENT DAY INT. WATTS POLICE STATION - MOMENTS LATER Jefferson’s thoughts are interrupted by his daughter ANISSA (22), a brown-skinned beauty with intense eyes and a quick mind. She’s clearly just been released from jail. Their eyes meet, hers a bit tired, his full of relief. CUT TO: INT. JEFFERSON’S CAR - NIGHT As he drives, the silence is heavy, Jefferson can sense the halo of anger around Anissa. JEFFERSON So you looked at your schedule tonight and it said, protest the One Hundred or attend Garfield High’s Fund-raiser. And you figured it was best to choose the path that leads to you getting arrested? ANNISA It wasn’t a choice, dad. JEFFERSON No, it was a choice, Annisa. ANISSA I should have never been arrested. It was a peaceful protest. \"Black Lightning\" Pilot   3.",
      "characters": [],
      "action_text": "JEFFERSON Burning police cars, breaking windows, yeah that’s the definition of peaceful. ANISSA I guess it depends on what your definition of peace is. People in Watts haven’t had peace with police or the gangs in generations. JEFFERSON “Non-violence is the answer to the crucial political and moral questions of our time: the need for man to overcome oppression and violence. Man must evolve for all human conflict a method which rejects revenge, aggression and retaliation. The foundations for such method is love.” Jefferson looks at Anissa, anticipating a response. This is a game they play which keeps the debates respectful. ANISSA Martin Luther King Jr. (beat) “I’m sick and tired of being sick and tired.” JEFFERSON Fannie Lou Hamer. In his rearview mirror, Jefferson notices the blue lights on top of a police car light up the night. JEFFERSON (CONT’D) This night just keeps getting better. Jefferson pulls his car to the curb, the LAPD pull their car close behind his. CUT TO: INT/EXT. JEFFERSON’S CAR - NIGHT - MOMENTS LATER TWO OFFICERS approach Jefferson’s car, their hands on their guns. Their flashlights, pointed in Jefferson and Anissa’s eyes, are blinding. OFFICER #1 Step out of the car. \"Black Lightning\" Pilot   4. JEFFERSON Officer, my name is... Officer #1 ignores Jefferson and opens his car door. OFFICER #1 Get out please. Jefferson gets out of the car as Anissa watches. Jefferson speaks through his frustration. JEFFERSON This is getting out of hand, it’s the third time this month I’ve been pulled over. Jefferson is immediately pushed against his car and handcuffed. Anissa begins to protest. ANISSA What are you doing!? Anissa, still in the passenger seat, moves to pick up her phone and start video taping what's going on but Officer #2, on the passenger side of the car, pulls his gun. OFFICER #2 Don’t move! Jefferson panics. JEFFERSON Stop! Don’t shoot! Jefferson is thrown on the hood of the police car but still manages to speak. JEFFERSON (CONT’D) Anissa put you",
      "dialogue_count": 0,
      "word_count": 2731
    },
    {
      "scene_number": 2,
      "slugline": "INT. CLUB 100 - NIGHT Jennifer and Will are where we left them, sitting in their booth, talking. JENNIFER Afro Punk over Coachella any day. Please, Grace Jones? Bad Brains? T.V. On The Radio? Come on. WILL Oh, you one of them alternative sistahs. How old are you? JENNIFER Eighteen. How old are you? WILL Twenty-two. For real though, how old are you? JENNIFER I told you. I’m eighteen. Their conversation is interrupted by two One Hundred gang members, the YOUNGSTERS. They both look like your average college freshman who are dressed for a Yeezy concert. One of them even wears a backpack. One plops down next to Jennifer, the other next to Will. YOUNGSTER #1 What’s good bruh? WILL What’s up? Jennifer’s face has wrong place, wrong time written all over it. JENNIFER I’m going to go to the bathroom while you talk to your friends. Jennifer moves to scoot out but Youngster #1 doesn’t move. YOUNGSTER #1 No, you’re not. JENNIFER Umm, excuse you. The Youngster cuts a look at Jennifer, Will sees things are getting tense. \"Black Lightning\" Pilot   15.",
      "characters": [],
      "action_text": "WILL (to Jennifer) Chill. Off of Jennifer knowing she’s found herself in way over her head. INT. CLUB 100 - NIGHT The crowd moves in sync as the artist on stage performs with passion. Jefferson ignores the partying going on around him while standing in a corner scanning the room. After a beat he notices Jennifer walking through the club with strange men. She’s being escorted, along with her new friend Will, through the club by the Youngsters. Jefferson watches in horror as Jennifer tries to make a detour but is grabbed forcefully by one of the Youngsters. The fear in her eyes makes him desperate to get to her. CLUB SECURITY opens a door for them marked PRIVATE. The group disappears behind it as Jefferson wades through the crowd, headed for the same door. INT. CLUB 100 - PRIVATE ROOM - NIGHT The Youngsters keep a watchful eye alongside LALA (24), whose boy-next-door handsomeness hides the fact that he is the brutal General of the Watts’ gang, the One Hundred. Lala and his soldier, Will, talk money. Jennifer is afraid, she listens while trying to figure out what she should do next. LALA Will, why I got to chase you down to have a conversation? WILL You ain’t got to chase me down, Lala. I’m out here hustling trying to get the money you say I owe you. LALA The money “I say” you owe me? Bruh, did LAPD steal a hundred grand worth of product from you when you got popped? With mention of police, drugs and money... JENNIFER See, this right here is none of my business. I’m-- LALA I’m talking. \"Black Lightning\" Pilot   16. Jennifer shuts her mouth, Lala puts his attention back on Will. LALA (CONT’D) ‘Cause I want us to be clear on this point. Did you not have commissary money? Did you not have The Stephen Barnes as your lawyer? The money “I say” you owe me? Will doesn’t have a response, Lala slaps the W out of Will’s name, leaving him ill. LALA (CONT’D) I’m talking to you! Will tries his best to hang on to his manhood in front of Jennifer. WILL You didn’t have to do that in fr",
      "dialogue_count": 0,
      "word_count": 9450
    },
    {
      "scene_number": 3,
      "slugline": "INT. WORLD ON WHEELS SKATING RINK - DAY C.U. on Jefferson who’s gliding strangely through time and space until we realize that he and his girls are roller- skating together, each showing off their best move. WATTS RESIDENT #1 (O.S.) What I wanna know is what took the niggah so damn long. Neither of his daughters can beat the old school pro Jefferson, who skates backwards with style and ease as his girls look on impressed. INT. LYNN’S HOUSE - KITCHEN - DAY Lynn sits at her kitchen counter and drinks her coffee watching the local news. She watches the Watts resident give his opinion. WATTS RESIDENT #1 Things been bad out here for ages, ain’t nobody got time for no decade long lunch breaks. Lynn watches, grateful that her children are safe, but fearful of what the future holds. Another woman gives her thoughts. WATTS RESIDENT #6 I’m just gon’ be honest, this is not the work of God. ‘Vengeance is mine,’ said the Lord. He didn’t say vengeance is some freak running around in a Halloween costume. INT. GAMBI’S TAILOR SHOP - DAY Gambi’s sense of satisfaction is written all over his face as he watches the same news report. But there is a different person on the screen now. It’s the woman we saw on T.V. at the police station, she’s dressed different but her pain is the same. WATTS MOTHER The One Hundred shot and killed my oldest son right out here ten months ago. A month ago, my youngest son was killed. Her V.O. continues over the following scenes: \"Black Lightning\" Pilot   57.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 269
    },
    {
      "scene_number": 4,
      "slugline": "EXT. SANTA MONICA BEACH - DAY Jennifer, earphones in her ears, jogs down the beach path with her other track teammates. WATTS MOTHER (V.O.) I’ve tried to pray the pain away, drink it away but don’t nothin’ help. Unless a child has come out of you, and then he die, don’t nobody know that pain. A mama’s pain. INT. GARFIELD HIGH GYM - NIGHT It’s an after-school meeting with a group of parents. Blue collar workers, mothers on aid and older ex gang members. Jefferson is at a white board, his tie loosened, his sleeves rolled up.   We see written on it, “SAFE PASSAGE: PROTECTING OUR CHILDREN WITH A COMMUNITY BASED NEIGHBORHOOD WATCH PROGRAM.” Ms. Fowdy stands at the back of the room, with a “it ain’t metal detectors” look on her face. She watches skeptically as Jefferson explains the program. WATTS MOTHER (V.O.) I prayed to God every night that he would kill the people who took my babies. And I don’t care how old they get, they still your babies. EXT. WATTS STREETS - NIGHT Anissa is in the middle of a protest against the One Hundred. She holds hands with a beautiful BLACK WOMAN with cornrows. When the police shoot tear gas, Anissa grabs her new girlfriend by the hand and they run away from the chaos. Annisa and her girlfriend notice all the car alarms on the block are blaring. They stop and look behind them and notice that car windows are shattered and a crack in the ground trails Anissa. Both her and her girl look at each other curious about how this could happen. But as a SWAT tank rolls past them they assume it’s the cause, rather than a hint of Anissa’s own latent superhuman abilities. WATTS MOTHER (V.O.) Maybe Black Lightning is an answer to my prayers. CUT TO: \"Black Lightning\" Pilot   58.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 312
    },
    {
      "scene_number": 5,
      "slugline": "EXT. LALA’S COMMUNITY CENTER - LATER THAT NIGHT A long beat of silence gives the night an uncomfortable feeling. Malik sits on the curb across the street, his box of candy by his side, the bruises on his face are fresh. He watches the rest of the kids from the community center pile into a van, when he hears Black Lightning’s voice behind him. BLACK LIGHTNING You got a Kit Kat? The little ones, not the value pack size. Nervous, excited and afraid at the sight of Black Lighting, Malik manages and answer. MALIK All I got left is Almond Joy. BLACK LIGHTNING I’m allergic to coconut. Time for you to go home. Don’t come back. If you do I’ll come looking for you. As Black Lightning walks across the street, Sly & The Family Stone’s “Stand!” scores the moment like a modern day Shaft. Malik takes one last look at Black Lightning, then runs off. As he’s running, he notices the street lights begin to flicker. He watches Black Lightning enter the community center and the lights in the building fall to darkness. Malik can’t help himself, he stops to watch from a distance. Through the windows he can see flashes of light illuminate like fireworks. With Sly’s voice as our anthem, we watch a beautiful smile of hope spread across Malik’s face. TO BE CONTINUED...  END OF SHOW  \"Black Lightning\" Pilot   59.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 235
    }
  ]
}