{
  "slug": "black-mirror-401-uss-callister-2017",
  "title": "black mirror 401 uss callister",
  "genre": "sci-fi",
  "format": "series",
  "scenes_count": 10,
  "characters_count": 0,
  "characters": [],
  "total_words": 14805,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. CALLISTER INC. - DALY'S OFFICE - DAY 4   4 DALY's office is cramped. On the wall there's a POSTER for SPACE FLEET, an old late 60s TV SHOW in the STAR TREK mould. Bits of SPACE FLEET memorabilia are everywhere. There's even a series of BLU-RAY, DVD and VHS box sets on a shelf. DALY sits at his desk. Sighs. He looks through the glass to notice SHANIA and KARL. From the glances in his direction it looks like maybe they're talking about him. SHANIA laughs at whatever KARL just said. Under the desk, DALY clenches a fist. A knock at the door snaps him out of it. NANETTE COLE (mid 20s), supersmart coder, stands in the doorway, a tad nervous. DALY thinks he knows what she wants. It's happened before. DALY Ladies bathroom's that way. The sign's confusing. NANETTE You're Robert Daly, right? DALY Right -- NANETTE steps forward and holds out a hand. NANETTE Nanette, Nanette Cole. DALY gingerly takes her hand and shakes it NANETTE (CONT’D) I started here today, coding on the update? Just wanted to pass on my admiration to the person who actually designed Infinity. The procedural algorithm is amazing, it really is some beautiful code. DALY is genuinely taken aback. DALY Thank you. NANETTE steps inside. NANETTE It's actually the reason I wanted to work here.  USS CALLISTER. SHOOTING SCRIPT. 06.01.17   11.",
      "characters": [],
      "action_text": "A pregnant pause, DALY doesn't know what else to say. NANETTE (CONT’D) You must be busy, sorry. DALY No-no, its fine- NANETTE -Fangirling, sorry. She notices the SPACE FLEET boxsets. Picks up a VHS case. NANETTE (CONT’D) Woah what's that? (beat)  Vintage.  DALY stands, worried his VHS case may get fingermarks on it. DALY Space Fleet. A TV show. It was before your time - before   my   time actually, but it was visionary -- NANETTE Is that on like   tape ? DALY taps the other boxsets DALY Got the VHS, the DVD, the Blu-Rays - - whole thing, seasons one to six. (beat) Netflix has it these days. NANETTE “Aboard the spaceship USS Callister”. OK yeah, so Callister is like the- DALY Yeah, when we set up the company I suggested we call it Callister as a kind of a tribute. Walton didn’t really get the reference, but he let me have that one. Nanette looks at the SPACE FLEET poster. Notes the female crew member in a sort of mini-skirt costume. NANETTE Mini-skirted damsels? Little cold for that in space. CONTINUED: 4   4  USS CALLISTER. SHOOTING SCRIPT. 06.01.17   12. DALY That's just what a Bargradian sand warrior would say. The look on NANETTE’s face indicates she didn’t get the joke Suddenly WALTON enters without invitation. Starts talking before he even realizes NANETTE is in the room. WALTON Bob, Christmas is closing in like a god damn meteor and we got customers all over our balls waiting on this Infinity update. Just tell me it’ll be up and running before the weekend. DALY (flustered) Well - I can ask Kabir if he could pick the pace up a little- WALTON (interrupting) You're CTO, you shouldn't be   asking  anyone anything. You should be telling. Like I'm telling you now. DALY I'll speak to him. I'm sorry. WALTON Good. Okay. DALY nods. WALTON notices NANETTE standing in the room. Desperately wishing she wasn't there. WALTON (CONT'D) Hello. NANETTE Hi. Sorry. I couldn't find a good moment to - She's about to say the word \"leave\". WALTON You must be new. (Holds out his hand) ",
      "dialogue_count": 0,
      "word_count": 2467
    },
    {
      "scene_number": 2,
      "slugline": "INT. CALLISTER INC. - CONTINUOUS 14   14 The office is almost empty bar DALY, still in his office. He watches the last few employees leaving. KARL, pulling on a coat, chatting to SHANIA, leaves through the doors. NANETTE hoists a backpack onto her back and puts her earbuds in. She's the last to leave. The moment the door shuts behind her, DALY stands up. He opens a desk drawer containing SURGICAL GLOVES, TWEEZERS and a SEE-THRU PLASTIC BAG. He starts pulling on the gloves.  INT. CALLISTER INC. - MOMENTS LATER 15   15 DALY is at NANETTE's WORKSTATION. He reaches into her TRASH CAN. Pulls out the COFFEE CUP she had earlier. Takes off the LID. Carefully places the LID into the SEE-THRU BAG  INT. DALY'S APARTMENT - FRONT DOOR/CORRIDOR - NIGHT 16   16 BONG. The room lights up in preparation for DALY'S return. DALY bursts in, fumbling at his work bag. He pulls out the cellophane bag we saw earlier and hurries into his bedroom.  INT. DALY’S APARTMENT - BEDROOM - NIGHT 17   17 DALY rushes to his desk, sits, puts down the cellophane bag. He dons latex gloves again. Pops open the MYSTERIOUS DEVICE on the desk. There's a PETRI DISH in there with some sort of thick blue gel in it. He carefully takes the CUP LID out of the plastic bag and runs a SWAB along the SIPPY-HOLE. DALY delicately places the SWAB onto the PETRI DISH and closes the lid. An LED winks. Something bleeps. Then he places the LID back into the BAG and puts the BAG into the FRIDGE. We notice the shelves have OTHER ITEMS in bags -- one contains a splodge of CHEWING GUM, another a TISSUE, and one a LOLLIPOP. He turns to his keyboard and types. Clicks his mouse around.  USS CALLISTER. SHOOTING SCRIPT. 06.01.17   23.",
      "characters": [],
      "action_text": "More LIGHTS on the PETRI DISH DEVICE start to twinkle. On the screen: ASSIMILATING. And a loading bar appears. 1% and rising. ESTIMATED TIME TO COMPLETION - 16 HOURS DALY looks at his watch. Stretches. Heads for bed as the loading bar rises incrementally.  EXT. DALY'S APARTMENT BLOCK - DAWN 18   18 Orange morning sun spreads over Daly's apartment block.  INT. DALY’S APARTMENT - BEDROOM - MORNING 19   19 The loading bar reads 67% as DALY, in the background, gets dressed and heads out the door. Music carries us through a little montage:  INT. CALLISTER INC. - VARIOUS - MOMENTS LATER 20   20 DALY exits the elevator, crosses the lobby and tries his pass. Once again he's rejected. ELENA the RECEPTIONIST buzzes him in again. We INTERCUT the following with the LOADING BAR as it climbs. Now it's at 74% Next we see him watching NANETTE chatting with WALTON, then KARL, then SHANIA. The loading bar climbs to 85% DALY sits typing when WALTON suddenly holds an iPad-type tablet displaying a press article directly in between him and the monitor. Headline: INFINITY UPDATE: NOT TILL XMAS? DALY looks up at him. WALTON shakes his head, disappointed. Meanwhile NANETTE is at her station, coding. Loading bar now at 96% We go in on NANETTE's face. 97% We see DALY watching her through the glass. CONTINUED: 17   17  USS CALLISTER. SHOOTING SCRIPT. 06.01.17   24. 98%... 99%... 100%  INT. USS CALLISTER - MED BAY - DEEP SPACE 21   21 There's a starched white MEDICAL BED in this room. We are tight on eyes. A woman's eyes. Nanette's eyes. Suddenly NANETTE wakes, looks around. This isn't her bed. Or her room. It’s too dark to make out detail. There's no window. Just some machines making beeping-booping noises She looks down and realises she's dressed in SPACE FLEET attire. Figure-hugging uniform. Groovy short skirt. She pats herself, confused. Feels her hair. It's different. She walks to a door, which opens into a corridor...  INT. USS CALLISTER - CORRIDOR - DEEP SPACE 22   22 We HEAR an automati",
      "dialogue_count": 0,
      "word_count": 845
    },
    {
      "scene_number": 3,
      "slugline": "INT. USS CALLISTER - BRIDGE - CONTINUOUS 23   23 The BRIDGE is dimly lit. The crew are not at their stations. They're in a corner, huddled around a kind of BAR. WALTON's there, pouring a drink whilst the rest sit solemnly watching. The argument (between WALTON and TULASKA) stops the minute they see NANETTE in the doorway. There's a pause. WALTON (to self) Oh boy. (beat) Looks like there's a new girl in the office. He takes a swig. NANETTE holds back, confused. SHANIA pipes up -- in her ‘regular’ voice, not her cut-glass accent. SHANIA What’s your name hun? WALTON Come in. Let me pour you a drink. Got everything from Bengarian phlegm shots to distilled root blood from the Cangor quadrant. What's your poison? Some of this actually is poison. Don't be shy. NANETTE doesn't move. NANETTE Am I dreaming? SHANIA ‘Fraid not. TULASKA, who’s bored and sitting at her station, doesn’t look up from her fingernails. TULASKA I remember dreaming. PACKER nods -- those were the days. PACKER Me too. NANETTE Where am I?  USS CALLISTER. SHOOTING SCRIPT. 06.01.17   26.",
      "characters": [],
      "action_text": "WALTON The USS Callister, Space Fleet's finest, exploring the farthest reaches of the known universe and beyond. We are its loyal crew. And now, it seems, so are you. Cheers. WALTON downs a shot. NANETTE looks around. SHANIA Your name, babes, what’s your name? NANETTE Nanette. (off SHANIA’s blank look) We've met. SHANIA Maybe, in the real world. I got no way of knowing. NANETTE What do you mean? SHANIA You'd better sit down. NANETTE I don't want to sit down, I want to know what's going on. DUDANI walks towards her. DUDANI You're onboard Robert Daly's ship. NANETTE Wh -- Robert Daly? The CTO? WALTON (Pouring another drink) Here he's   Captain   Daly, our fearless leader. SHANIA You're   seriously   gonna need to sit the fuck down. NANETTE turns to spot PACKER. NANETTE (To PACKER) You're the intern? From work. Nate something? CONTINUED: 23   23  USS CALLISTER. SHOOTING SCRIPT. 06.01.17   27. PACKER Packer. Nate Packer. (beat) I’m still just the intern out there huh? Jesus. NANETTE turns to DUDANI. NANETTE And you’re -- DUDANI Kabir Dudani. Diagnostics. NANETTE, dazed, looks at TULASKA. NANETTE You're the receptionist. TULASKA nods. TULASKA Elena. NANETTE looks at TULASKA’s ALIEN BLUE SKIN. NANETTE But you’re skin is blue... TULASKA looks at her own alien skin and practically shrugs by way of recognition. TULASKA Weird alien skin, I know, it’s fucked up. Almost sort of racist. NANETTE looks dizzy. She nearly falls over. SHANIA is there to catch her. She starts leading NANETTE over to the captain's chair. SHANIA Walt. Fix her something. Vodka. Something she'll recognise. NANETTE sits. The rest of the officers crowd round. She looks at them like she’s dreaming. PACKER What's it like out there now? NANETTE struggles to answer. PACKER (CONT’D) Like what year is it? SHANIA is annoyed with PACKER. CONTINUED:   (2) 23   23  USS CALLISTER. SHOOTING SCRIPT. 06.01.17   28. NANETTE What year - I saw you today. WALTON Did you see me? Did I look thin? Like wheatgrass and yoga thin?",
      "dialogue_count": 0,
      "word_count": 4244
    },
    {
      "scene_number": 4,
      "slugline": "INT. CALLISTER INC. - ELEVATOR/LOBBY - DAY 35   35 NANETTE, stands in the elevator listening to her ear buds and exits into CALLISTER inc's LOBBY... ... which is now festooned with CHRISTMAS DECORATIONS. Even ELENA the RECEPTIONIST wears novelty antlers as she fiddles with her smartphone. NANETTE Hey Elena. As NANETTE passes toward the office she hears her phone PING. It’s an email. ROBERT DALY INVITES YOU TO JOIN INFINITY. NANETTE opens the e-mail and stands reading for a moment. Beneath the 'SIGN UP NOW' icon is a message; THIS IS NOT SPAM. DALY HAS STOLEN YOUR IDENTITY. I AM YOU AND I'M TRAPPED IN MODDED INFINITY. HELP ME. CONTACT CYBER POL! NANETTE reads the message, thoroughly confused. Elena assumes there's a problem with her pass. ELENA You need me buzz you in? NANETTE Wh - oh. No - uh. She puts her phone away and looks for her pass. KARL appears from behind, and proffers his own. KARL I’ll get that for you NANETTE Thanks. KARL After you.  INT. CALLISTER INC -   OFFICE - DAY 36   36 More decorations. NANETTE heads across the floor, still slightly thinking about the email. Looking at her phone.  USS CALLISTER. SHOOTING SCRIPT. 06.01.17   48.",
      "characters": [],
      "action_text": "She sees Robert Daly walking ahead of her. NANETTE Mr Daly, hi. He looks up. A bit flustered. DALY Uh, hey. NANETTE You didn't send me an Infinity invite just now did you? DALY What? No. What? NANETTE It was really weird, it had this message attached, about people \"trapped in the game\". DALY thinks fast. DALY Probably a spambot, firewall doesn't always get them all. NANETTE That's what I thought. Weirdest thing. It went to my personal account, not my work mail. DALY Hackers getting creative. I wouldn't worry about it. Didn't open the link did you? NANETTE God, no. DALY Maybe upgrade your security software I guess. NANETTE Yeah. Well. Have a good one. She turns and heads back to her desk. Daly passes WALTON’s OFFICE, peering in. Walton is walking around casually strumming an unplugged ELECTRIC GUITAR. Daly glowers. CONTINUED: 36   36  USS CALLISTER. SHOOTING SCRIPT. 06.01.17   49. INT. USS CALLISTER - BRIDGE - DEEP SPACE 37   37 WALTON is methodically banging his head on a desk. Slowly. Bang. Pause. Bang. Pause. Bang. Pause. Eventually: PACKER Could you cut that out? WALTON Trying to make it a hobby. Suddenly the LIGHTS turn up - the HUM of the ship waking up. SHANIA This is way too early. He's only been at work a few hours. NANETTE She got the message. I did. It's me. Or the cops most likely. (Smiles) We're getting out of here. SHANIA looks less convinced. They look at the DOOR -- as it slides open... to reveal CAPTAIN DALY. Glowering. NANETTE glances at the CREW. This is bad. DALY walks to the DISPLAY SCREEN and gazes out into space. CAPTAIN DALY What is Space Fleet? (Dark, quiet) I’ll tell you what it is. It's a belief system, founded on the very best of human nature. It's a goal for us to strive towards, for the betterment of the universe, the betterment of life itself. He turns to face them. CAPTAIN DALY (CONT’D) (petulant rage) And you assholes are fucking it up! NANETTE steps forward. NANETTE It was me. I sent the message. No one else was involved, I swear. CA",
      "dialogue_count": 0,
      "word_count": 2220
    },
    {
      "scene_number": 5,
      "slugline": "INT. DALY'S APARTMENT - FRONT DOOR/CORRIDOR - NIGHT 46   46 We notice a uniform CHRISTMAS WREATH on the door, as the house lights up as DALY enters and heads to his bedroom.  INT. DALY'S APARTMENT - BEDROOM - NIGHT 47   47 Once inside, DALY sits down at his games desk. There’s now a slightly pathetic mini-CHRISTMAS TREE on it. Grabs a chocolate milk from his fridge. We see the LOLLIPOP and the other DNA bags. He slurps, pops the VR DISC on his temple. Boots up the game. An LED flashes. His eyes mist over. He goes limp. He's in.  INT. USS CALLISTER - BRIDGE - MOMENTS LATER 48   48 CAPTAIN DALY bounds in. And smiles as he sees NANETTE is sitting dutifully at the COMMS desk. CAPTAIN DALY (to NANETTE) Good to see you at your position Cole. NANETTE (saluting) Captain - you've come at just the right time. CAPTAIN DALY I have? NANETTE (nod) I'm picking up a distress signal from the surface of Skillane IV. Looks like a crashed shuttle. (beat) What should we do? CAPTAIN DALY Space Fleet never turns its back on those who need our help. Dudani, set a course for Skillane IV -- DUDANI Aye aye sir  USS CALLISTER. SHOOTING SCRIPT. 06.01.17   59.",
      "characters": [],
      "action_text": "CAPTAIN DALY We'll send a search party. (beat; turning round) Packer, Tulaska -- NANETTE (cutting in) Actually Captain - I was thinking maybe you could take me alone. As science officer I need to learn the ropes. And I could use your close attention. DALY is flustered. It takes him a while to respond. CAPTAIN DALY Good idea.  EXT. ALIEN PLANET SURFACE - LATER 49   49 NANETTE and CAPTAIN DALY transport down onto a warm, craggy planet surface. Arid mountains, lush lakes. DALY takes out his omnicorder, scans the area. NANETTE eyes the device hungrily. CAPTAIN DALY Atmosphere's good. Daly spots the SHUTTLE up ahead. It's the size of a minivan. CAPTAIN DALY (CONT’D) Over there. He leads the way. Behind, NANETTE exhales. So far so good.  INT. USS CALLISTER - BRIDGE - CONTINUOUS 50   50 The CREW are gathered around DUDANI's control panel, watching a wireframe map with a GPS dot on it, indicating DALY and NANETTE’s position. They're waiting for something. We turn to see their faces as we hear DALY saying: CAPTAIN DALY (V.O.)  No signs of life here. Shuttle is deserted .  EXT. ALIEN PLANET SURFACE - MOMENTS LATER 51   51 CAPTAIN DALY and NANETTE stand a short distance from the SHUTTLE. DALY is talking into the omnicorder. There is a shimmering LAKE nearby. NANETTE looks at it and thinks. CONTINUED: 48   48  USS CALLISTER. SHOOTING SCRIPT. 06.01.17   60. CAPTAIN DALY We'll scout the area, check for any life forms. Daly out. NANETTE starts walking toward the lake. DALY looks confused. CAPTAIN DALY (CONT’D) Cole, we should head out this way. (beat) Cole? NANETTE unzips her uniform, slipping it off (she wears a sports bra and underwear beneath). CAPTAIN DALY averts his eyes -- then stops averting them. CAPTAIN DALY (CONT’D) Wh- what are you doing? NANETTE swims in up to her neck and turns around, smiling. NANETTE Ohmygod the water's   great . DALY’s flustered. He's simultaneously annoyed and mesmerised. NANETTE (CONT’D) Come on in! CAPTAIN DALY Swimming's a leisure activity. We'",
      "dialogue_count": 0,
      "word_count": 2777
    },
    {
      "scene_number": 6,
      "slugline": "EXT. ALIEN PLANET SURFACE - SHORE - CONTINUOUS 81   81 DALY Come in? (beat) Goddamnit. He looks around. Spots the SHUTTLE in the distance. Trudges towards it.  INT. USS CALLISTER - BRIDGE - CONTINUOUS 82   82 DUDANI notes something on his display. DUDANI Uh-oh. The wormhole. It's decreasing in size. NANETTE Upload must be in the last few percent. Dammit Packer, we're gonna  have   to go through the belt. (beat) Think you can do it? PACKER Think I can try. They watch anxiously as the DISPLAY swerves to show the ASTEROID BELT.  EXT/INT. SHUTTLE - CONTINUOUS 83   83 On the ALIEN PLANET, CAPTAIN DALY is inside the SHUTTLE. He taps a few buttons on the dash. Systems hum into life. COMPUTER Ships. Computer. On. CAPTAIN DALY Computer, where is the USS Callister? COMPUTER USS Callister is on course. CAPTAIN DALY On course for where? COMPUTER The wormhole. A beat.  USS CALLISTER. SHOOTING SCRIPT. 06.01.17   72.",
      "characters": [],
      "action_text": "CAPTAIN DALY What wormhole? COMPUTER The update vortex. A penny drops. Woah. WOAH. CAPTAIN DALY Sons of bitches. (beat) Prepare for takeoff. He hits some controls. The engines start up.  EXT. DEEP SPACE 84   84 The CALLISTER swerves through the ASTEROID BELT, narrowly avoiding calamity. A small ROCK bounces off the hull.  INT. USS CALLISTER - BRIDGE - CONTINUOUS 85   85 The CREW lean THIS WAY and THAT, as PACKER pilots them between spinning chunks of space rock. TULASKA Shields at 86 percent. Suddenly DUDANI notes something on his computer. DUDANI I’ve got a heat signature. Looks like a shuttle just took off from Skillane IV. NANETTE Daly. TULASKA Incoming transmission. She hits a button and we INTERCUT with CAPTAIN DALY, speaking into a handset on board the SHUTTLE, which is now in space. CAPTAIN DALY (O.C.) I know you can hear me. Whatever you think you're going to do won't work. But it is going to cost you. NANETTE (to PACKER) Let's go faster! PACKER We're already at maximum. CONTINUED: 83   83  USS CALLISTER. SHOOTING SCRIPT. 06.01.17   73. DUDANI Daly can't touch us unless he makes it on board. And that shuttle's a jalopy. He won't catch us in time. NANETTE I hope you're right. Just then -- CLONG! Another small asteroid collides with the ship. The crew rock about a little more. TULASKA Shields 58 percent.  EXT. SHUTTLE - DEEP SPACE - CONTINUOUS 86   86 DALY's SHUTTLE is whizzing through the inky dark.  INT. SHUTTLE - DEEP SPACE - CONTINUOUS 87   87 DALY continues hurling insults at them: CAPTAIN DALY If you thought what has happened to you in the past was bad, that was nothing. What I'm going to do you is going to be god damn   biblical...  INT. USS CALLISTER - BRIDGE - CONTINUOUS 88   88 DALY's voice echoes round the BRIDGE as PACKER continues to weave through the rocks. CAPTAIN DALY (V.O.)  I'm going to literally turn your insides out, but I'll keep you alive, in jars--  NANETTE Why are we listening to this? TULASKA nods, hits a button. DALY's rant is cut off",
      "dialogue_count": 0,
      "word_count": 534
    },
    {
      "scene_number": 7,
      "slugline": "EXT. USS CALLISTER - CONTINUOUS 89   89 He spoke too soon. Just as the CALLISTER exits the asteroid field, one ASTEROID collides with CALLISTER's hull. It dings away, causing damage.  INT. USS CALLISTER - BRIDGE - CONTINUOUS 90   90 Thump! Rumble! The crew is jerked around. Then: TULASKA Shields critical, 6 percent -- Suddenly there's a heavy groaning sound from the engines. NANETTE What was that? DUDANI (studying screen; worried) The primary drive. It’s not responding. PACKER I've lost all thrust! (beat) Engines not responding. (beat) We're drifting here.  EXT. USS CALLISTER - CONTINUOUS 91   91 Sure enough, the ship is drifting in space. Powerless.  INT. SHUTTLE - CONTINUOUS 92   92 The ship's computer announces: COMPUTER  USS Callister has lost engine power.  CAPTAIN DALY Coming to get you! He accelerates a little more.  INT. USS CALLISTER - BRIDGE - CONTINUOUS 93   93 All hope is lost. No-one knows what to do. PACKER What do we do?  USS CALLISTER. SHOOTING SCRIPT. 06.01.17   75.",
      "characters": [],
      "action_text": "Everyone looks at NANETTE. She's in the captain's chair. NANETTE I don't know... (to DUDANI) Any way we can fix the engines? DUDANI That’s only feasible manually. By climbing inside the jet feeder. NANETTE So -- PACKER So you'd burn to a crisp when the jet came on. DUDANI You'd burn without dying. NANETTE Then one of us has to go. Sudden wide shot. WALTON isn't there. Suddenly - a voice: WALTON (O.C.) One of us already has. NANETTE Walton?  INT. JET FEEDER TUBE - CONTINUOUS 94   94 The JET FEEDER TUBE is a bit like the interior of a giant jet ENGINE. Dark and lots of pipes and stuff. WALTON is in there, with some TOOLS. Wrenching at something in the wiring. He now has a COMMS EARPIECE in his ear. WALTON (straining as he wrenches something) Pretty sure I can fix this... NANETTE Walton, are you sure about this? WALTON keeps his eyes fixed on the task. WALTON I'm sure. (beat) Tulaska, can you patch me through to Daly? CONTINUED: 93   93  USS CALLISTER. SHOOTING SCRIPT. 06.01.17   76.",
      "dialogue_count": 0,
      "word_count": 343
    },
    {
      "scene_number": 8,
      "slugline": "INT. USS CALLISTER - BRIDGE - CONTINUOUS 95   95 NANETTE looks at TULASKA. She nods. TULASKA Patching through. INTERCUT ALL THREE -- the CREW on the BRIDGE as they listen, WALTON in the JET FEEDER and DALY in the SHUTTLE. WALTON Daly? Can you hear me? CAPTAIN DALY Walton you're gonna pay for this -- WALTON Robert, listen- CAPTAIN DALY -- I'm gonna bring Tommy back in-- WALTON Robert -- CAPTAIN DALY And God so help me you’re gonna regret this all so hard-- WALTON BOB I WANNA TALK TO YOU HERE! DALY shuts up, momentarily chastened. WALTON (CONT’D) I was thinking I should say sorry. As WALTON talks he continues tinkering with a space-spanner. CAPTAIN DALY Go on. WALTON You created Infinity. You're a genius. I exploited that. Treated you like the golden goose. Got fat on the profits. (beat) Figuratively speaking. (beat) I was thinking I oughta say I should’ve appreciated you more. Shoulda treated you better. DALY doesn't speak for a moment -- this is touching him.  USS CALLISTER. SHOOTING SCRIPT. 06.01.17   77.",
      "characters": [],
      "action_text": "WALTON (CONT’D) Yeah. I was thinking I should say all that. (beat) But you threw my son out of an airlock. So fuck you to death. And with that he WRENCHES something -- and the JET roars. WALTON is INCINERATED, SCREAMING.  INT. USS CALLISTER - BRIDGE - CONTINUOUS 96   96 WALTON's scream is cut off - the feed dies. ENGINES roar. PACKER We got power back! He YANKS a thruster.  EXT. USS CALLISTER - CONTINUOUS 97   97 The ENGINE roars -- and the ship HURTLES for the WORMHOLE.  INT. SHUTTLE - CONTINUOUS 98   98 DALY anxiously looks ahead. A little graphic display shows his shuttle is GAINING on the USS CALLISTER. COMPUTER Callister at 4Km and closing. CAPTAIN DALY Faster! COMPUTER Speed already at maximum. CAPTAIN DALY Whatever, just catch them!  INT. USS CALLISTER - BRIDGE - CONTINUOUS 99   99 DUDANI Wormhole almost closed. NANETTE (to PACKER) Keep her steady... PACKER sweats as he pilots the craft. CONTINUED: 95   95  USS CALLISTER. SHOOTING SCRIPT. 06.01.17   78. NANETTE (CONT’D) Steady...  EXT. DEEP SPACE - NEAR WORMHOLE - CONTINUOUS 100   100 The CALLISTER approaches the shrinking WORMHOLE... We INTERCUT with the CREW holding its breath: NANETTE Steady... And with DALY, shouting: CAPTAIN DALY Come on! And with TULASKA saying: TULASKA I hope we are going to die. And then... The USS CALLISTER SLIPS INTO THE WORMHOLE - - Which WINKS SHUT BEHIND THEM. And DALY's SHUTTLE zips past, missing the aperture. CAPTAIN DALY  GODAMMIT!  INT. USS CALLISTER - BRIDGE - CONTINUOUS 101   101 Wild, bright lights on the display. Like the Falcon going into HYPERSPACE. The CREW stand together. Looking into infinity. They slowly, silently HOLD HANDS in a final act of solidarity. The entire BRIDGE distorts. Elongates. SPINS. Strobe lighting. Impressionistic faces of the crew. Like the black hole segment in   2001: A Space Odyssey . And then -- BLACKNESS TOTAL BLACKNESS And then suddenly: CONTINUED: 99   99  USS CALLISTER. SHOOTING SCRIPT. 06.01.17   79. INT. USS CALLISTER - BRIDGE - MOMENTS ",
      "dialogue_count": 0,
      "word_count": 667
    },
    {
      "scene_number": 9,
      "slugline": "EXT. DEEP SPACE - OTHER SIDE OF WORMHOLE 103   103 DALY's SHUTTLE thrums through space. Suddenly -- the stars start to disappear. All of them. Rapidly twinkling out of existence. COMPUTER Update complete. Wormhole closed.  INT. SHUTTLE - CONTINUOUS 104   104 Daly frantically punches buttons. COMPUTER Controls are disabled. DALY No no no-  INT. USS CALLISTER - BRIDGE - CONTINUOUS 105   105 The CREW sit on the BRIDGE, looking at the universe. Just then they hear the DOOR OPEN and a triumphant voice: SHANIA Arseholes! They spin around. SHANIA and VALDACK have just entered. KARL is now in INFINITY COSTUME, as are the rest of the crew. SHANIA (CONT’D) Brig unlocked itself. KARL My Valdack outfit turned into this! SHANIA Yeah Karl, more to the point I’m not a fucking beetle thing anymore. (beat) Got my body back, I mean my   full  body back. Guessing we all did. PACKER thinks. Peers inside his own PANTS. And grins like a man who's discovered his penis now exists again after a long period of absence. Because that's what has happened. NANETTE So what do we do now?  USS CALLISTER. SHOOTING SCRIPT. 06.01.17   81.",
      "characters": [],
      "action_text": "DUDANI We've got an infinite procedurally generated universe at our disposal. We can go anywhere. NANETTE gazes at the heavens on the monitor, awestruck. NANETTE Holy mackerel.  INT. SHUTTLE - CONTINUOUS 106   106 DALY notices it's getting darker. He's worried. CAPTAIN DALY What's happening? COMPUTER Rogue universe detected... Deletion in process... CAPTAIN DALY No! NO! Undelete! UNDELETE! COMPUTER (voice slowing down) My mind is going... I can feel it.. The COMPUTER falls silent. The lights in the SHUTTLE dim. CAPTAIN DALY Exit game. Nothing. CAPTAIN DALY (CONT’D) Exit game! A penny drops. He panics. CAPTAIN DALY (CONT’D) EXIT GAME! EXIT FUCKING GAME!  INT. DALY'S APARTMENT - BEDROOM - CONTINUOUS 107   107 The REAL DALY sits LIMP in the chair. EYES GLAZED. Mouth slightly open. Unable to move. The VR disc on his temple. The mini Christmas tree glows in the dark. We slowly drift away... CONTINUED: 105   105  USS CALLISTER. SHOOTING SCRIPT. 06.01.17   82.",
      "dialogue_count": 0,
      "word_count": 346
    },
    {
      "scene_number": 10,
      "slugline": "INT. DALY’S APARTMENT BLOCK - HALLWAY - CONTINUOUS 108   108 We pull away from DALY's APARTMENT DOOR with its Christmas wreath - - past the screen that reads; DO NOT DISTURB And pull further out to see...  EXT. DALY’S APARTMENT BLOCK - CONTINUOUS 109   109 ... the entire building. Snow swirling. Sleighbells tinkling. Passers-by walking past, oblivious.  INT. USS CALLISTER - BRIDGE - CONTINUOUS 110   110 TULASKA sees something on a monitor. TULASKA Incoming transmission! They all spin to look at her. TULASKA (CONT’D) It says Gamer691 -- DUDANI That’s... a playertag. Another ship. Another player -- NANETTE We’re online. Patch them through! She nods and taps something. NANETTE (CONT’D) Hello! Hey! This is the crew of the USS Callister. Man, are we glad to-- She's cut off by the sound of an obnoxious 13-year old BOY: TEENAGER (O.C.) Yeah, Merry Christmas, so are we gonna blow each other or are we gonna trade? NANETTE Um- NANETTE opens her mouth, to be cut off again--  USS CALLISTER. SHOOTING SCRIPT. 06.01.17   83.",
      "characters": [],
      "action_text": "TEENAGER Hello-o? Do you have anything to trade at all? NANETTE No, uh- TEENAGER So why did you respond? OK just get the hell out of my quadrant or I’ll blast you to shit. You got ten seconds. SHANIA (yelling at TEEN) Oh do try -- we’ll photon bolt you right up the perineum, you stupid little boy. TEENAGER Five seconds! SHANIA Come on then. NANETTE sees this is going to get out of control. NANETTE Okay Nate-- uh Helmsman Packer TEENAGER (O.C.)  Five...  PACKER Yes Captain? TEENAGER (O.C.)  Four.  SHANIA This kid-- NANETTE Stick us in hyperwarp and lets - fuck off somewhere. TEENAGER (O.C.)  Three.  PACKER Aye aye, Captain. NANETTE Really, Nanette's fine. PACKER Aye aye, Nanette. CONTINUED: 110   110  USS CALLISTER. SHOOTING SCRIPT. 06.01.17   84. TEENAGER (O.C.)  Two.  INT. DEEP SPACE - CONTINUOUS 111   111 The USS CALLISTER fires up its hyperwarp engines and ZIPS off out of view leaving behind the HECTORING VOICE of GAMER 691 TEENAGER (O.C.) - One! Uh huh, you better run! King of space, right here. (beat) King of space. THE END CONTINUED:   (2) 110   110  USS CALLISTER. SHOOTING SCRIPT. 06.01.17   85.",
      "dialogue_count": 0,
      "word_count": 362
    }
  ]
}