{
  "slug": "blackberry-2023",
  "title": "blackberry",
  "genre": "sci-fi",
  "format": "film",
  "scenes_count": 12,
  "characters_count": 0,
  "characters": [],
  "total_words": 19598,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. JIM’S OFFICE, SUTHERLAND-SCHULTZ, WATERLOO - CONTINUOUS Mike screws the intercom back together -- puts it down on the desk -- shifts it to a perfect right angle... INT. HALLWAY, SUTHERLAND-SCHULTZ, WATERLOO - CONTINUOUS Jim almost spills his COFFEE. JIM Watch the fuck out! INT. JIM’S OFFICE, SUTHERLAND-SCHULTZ, WATERLOO - CONTINUOUS Doug scrambles to sit back in his seat. DOUG Oh shit! Sit down. Sit down. Mike focuses on the now silent INTERCOM, looks to Doug. MIKE Much better. Jim enters the office, slamming the door behind him. He takes a seat at his desk, collecting himself, looks across at them. JIM Yeah. What can I do for ya? MIKE Yes. Hi. Uh, I’m Mike Lazaridis, CEO of Research in Motion. Mike awkwardly hands Jim his business card -- Jim takes it. Mike returns to his cue cards. MIKE (CONT’D) We create various computer hardware systems using both custom-designed integrated circuits, as well as off- the-shelf components provided by major hardware vendors such as Intel, American Micro Devices, and Cyrix. Our clients have included: U.S. Robotics. Rogers Cantel. RAM Mobile Data-- Jim interrupts and picks up his phone. 9.",
      "characters": [],
      "action_text": "JIM Just a second. Mike and Doug share a look. Doug motions a thumbs up to Mike. JIM (CONT’D) (on phone) Hey you’re on Callaghan’s desk, right? Okay, great. This is Jim Balsille. Brock wanted me to do a quick proof of that tax stuff before the meeting... could you bring me... Exactly... Okay great, thanks. Hangs up -- pulse elevates -- JIM (CONT’D) Okay. Uh, what is this? MIKE So.. We, we had a shop teacher -- Doug attempts to move the PRESENTATION CARDS dropping them on the ground. DOUG (under his breath) Fuck. Doug continues to put the PRESENTATION CARDS back together on the easel. Jim watches the pair, unamused. MIKE (CONT’D) Who told us - Oh. We had a shop teacher in high school named Mr. Micsinszki who told us “ the person who puts a computer inside a phone will change the world.\" Well, we have a plan to piggyback on the unused bandwidth of the UHF spectrum to create an all-in-one mobile device. Mike pauses -- Jim’s intercom DINGS. Intercom light turns on. SHELLEY (INTERCOM) Callaghan’s Assistant is here to see you? Jim hits the button. JIM Send him in. 10. CLICK. NO STATIC.  Doug nods to Mike. At least   that   worked. The door opens -- Callaghan’s Assistant nervously walks in and hands Jim some documents. JIM (CONT’D) Great. Callaghan’s assistant doesn’t leave. CALLAGHAN’S ASSISTANT Sorry, Mr, Balsille. No one, uh. I didn’t realize you needed a copy of this tax report -- Jim shoots him a look. JIM I’m in a meeting right now. The Assistant gets it now -- leaves immediately -- Jim flips through the documents with interest... Doug steps in -- DOUG So, basically, there is a   free  wireless internet signal all across North America and nobody has figured out how to use it. There’s free internet in this room right now. It’s like the Force. Sorry, have you seen Star Wars? JIM No. DOUG So, okay, picture a pager, a cell phone and an email machine all in one thing. Doug rifles through the PRESENTATION CARDS until he finds the last one -- revealing concept schematics fo",
      "dialogue_count": 0,
      "word_count": 1790
    },
    {
      "scene_number": 2,
      "slugline": "EXT. STRIP PLAZA, RIM 1, WATERLOO - DAY Jim pulls into the plaza. SPORTS RADIO HOST (O.S.) Toronto wins it by a count of five- to-four. Doug Gilmour had 3 assists. Felix Potvin finished the game with thirty saves including three in the extra period, but obviously the story was... INT. MAIN OFFICE, RIM 1, WATERLOO - DAY Mike sits at his desk trying to plug in his NEIKO HILTEX MAGNIFYING LIGHT -- he can’t find the right power adapter, but there is chaos in the office. A game of COMMAND & CONQUER is being played. STEVE Are they top or bottom left? Send, Send everything, let’s take a gamble, let’s go for Scott -- MIKE Anyone have a Type-C Coax?! SCOTT They don’t even know. I’m not even top left. DOUG Scott, you’re attacking me! SCOTT What?! DOUG You’re attacking me. SCOTT Oh, I’m sorry. STEVE Send the dogs in. Send the dogs in. They’re rushing -- DOUG Bottom Right. SCOTT I’m sending another, another. 18.",
      "characters": [],
      "action_text": "DOUG Dude, they got rockets! I got run down. Mike is ignored by the gang, who are too distracted. MIKE Anyone have any Type-C Coax cables? Doug detonates Steve’s Command Centre. It’s over. DOUG Oh, the plungers moving! The plungers moving, dude! Doug runs to Steve’s desk, yanks a CEREMONIAL TOILET PLUNGER off the top of his monitor, the monitor comes with it, smashing on the ground. DOUG (CONT’D) Come on! Come on! Oh shit! I’m sorry boys but it’s back! Doug slams the plunger down on top of his monitor. It sticks. DOUG (CONT’D) It’s back! SCOTT (O.S.) You had them-- DOUG Back! The office erupts into cheers and laughter as Jim enters the office. After a moment he clears his throat. Beat. INT. MIDWAY DINER, WATERLOO - DAY Mike and Doug sit across from Jim in their usual booth. Waitress #1 places their food on the table. DOUG Thank you. MIKE Thank you so much. JIM Nothing for me, thanks. 19. Doug holds Jim’s BUSINESS CARD -- the phone number for SUTHERLAND-SCHULTZ is scratched out and another is written in pen... JIM (CONT’D) So, I know how to sell your phone. I know how to market it, and I know who we can sell it to. MIKE Who? Doug looks up from the business card. DOUG What do you mean “We”? JIM Here’s the deal. I will leave my job at Sutherland-Schultz if you make me CEO of Research in Motion. DOUG Are you serious? JIM That was the worst product pitch I’ve ever seen in my life. You guys don’t stand a chance out there. You need me. DOUG Sorry... I don’t know who you think you are, but WE, are just fine. We have a   sixteen million   dollar deal with U.S. Robotics. JIM Sixteen million? DOUG That’s right. JIM Wow. Okay and what did they buy? DOUG Modems. Ever heard of ‘em? JIM Are they like The Force in   Star  Wars ? 20. DOUG Very funny. You know, your logo literally is   SS ? JIM And how much have they paid you on that 16 million? MIKE Yeah, nothing. JIM Zero? DOUG Nothing yet. We haven’t delivered the modems. Doug looks to Mike. MIKE Well, we shipped them product samp",
      "dialogue_count": 0,
      "word_count": 4319
    },
    {
      "scene_number": 3,
      "slugline": "INT. CAB, NYC - LATER Mike excitedly raps on the prototype case, looking out the window at the big city-- he takes out a Tupperware of fruit -- starts eating -- drops a piece of fruit on his shirt, leaving a dark stain -- he tries to rub it out -- Jim watches in dismay... JIM So, if you hear me crinkling a piece of paper, that means stop talking. MIKE Like, in general or...? JIM No. In the pitch. MIKE Oh. Yeah. Gotcha. Jim notices the car is moving too slow for him. JIM (to driver) Hey, we gotta move here, man! My wife’s in labour. Let’s go. The driver floors it! Mike looks at Jim, evaluating his feelings about that lie... MIKE May I ask why your business card had the phone number crossed out? JIM I have no idea what you’re talking about. Beat. MIKE Hey, let’s make a deal, okay? You and I never lie to each other. The cab stops. JIM Sure. I didn’t quit my job. I was fired. I just mortgaged my house to pay our staff. So, if this doesn’t work out, I’m fucked. 44.",
      "characters": [],
      "action_text": "Beat. MIKE Why’d they fire you? JIM ‘Cause they’re idiots. Jim gets out... Mike follows.. Forgetting the prototype case in the taxi. INT. RECEPTION, BELL ATLANTIC HQ, NYC - DAY Elevator doors open onto the 80th floor -- Jim and Mike exit. The BELL ASSISTANT greets them. BELL ASSISTANT Hi. Research in Motion? JIM How are ya? BELL ASSISTANT Fantastic. Can I get you anything? Coffee? Water? JIM We’re good. We’re good. BELL ASSISTANT Okay. They’ll be with you shortly. MIKE Okay. Thank you.   BELL ASSISTANT (CONT'D) Alright. The Assistant directs them towards a small waiting area. Mike nervously raps on his legs -- stops -- looks down. Suddenly Mike becomes panicked -- he looks around -- MIKE Jim... JIM No. No. No. No. Never take the drinks. Thirst is a display of weakness. MIKE No. I may have forgotten the phone... 45. JIM Please tell me you’re joking. MIKE No I’m completely serious. JIM Fuck! Jim realizes he’s making a scene -- drags Mike back to the elevator bank... JIM (CONT’D) Alright, here’s what we’re going to do. I need you to draw out a little sketch. Something that shows the keyboard just like you did in my office -- -- Jim walks over to the Assistant -- JIM (CONT’D) Excuse me miss, could I trouble you for a pen and paper please?  DING.   The elevator opens and Mike goes inside. Jim turns around just in time to see the doors close behind Mike. BELL ASSISTANT They’re ready for you. JIM Great. INT. BOARDROOM, BELL ATLANTIC HQ, NYC - CONTINUOUS The room is PACKED with Executives. CEO JOHN WOODMAN (late 50s, no tie) sits dead centre. JOHN WOODMAN Oh wait, wait. Here he is. Hey. JIM Hi. JOHN WOODMAN Hi. JIM How are you? 46. JOHN WOODMAN Good. Good. We uh, are we waiting for anyone? Jim looks back to John -- JIM I’m alone. JOHN WOODMAN Okay. JIM Good. (beat) Alright, guys. Here’s how I see it. I know your marketing team tells you that you sell togetherness - family, “staying connected” whatever. But, let’s be honest, you sell minutes. Period. I mean, your market is m",
      "dialogue_count": 0,
      "word_count": 2943
    },
    {
      "scene_number": 4,
      "slugline": "INT. ENGINEERING DEPARTMENT, RIM 2, WATERLOO - LATER Jim stands in front of the engineers, clearly having just delivered big news. Mike stands beside him, crestfallen. JIM Okay? You could hear a pin drop. Doug raises his hand. JIM (CONT’D) Yeah. Doug. DOUG So. My question’s actually for Mike. How are we supposed to sell another five hundred thousand phones when we’re already maxed on every network we’re on? Mike doesn’t look up -- he just shakes his miserable head. JIM You guys will figure it out. Doug raises his hand again. DOUG How - how? If we put more phones on these networks they are going to crash. Period. We are not   allowed  to   sell more phones. Mike? JIM No. You don’t worry about what’s allowed. I say what’s allowed. DOUG I don’t even understand what the problem is here. Who cares if this guy wants to buy our company, isn’t that good? JIM I fucking care. That’s who cares. I care. I’m trying to keep this company together, you fuck. DOUG I’m sorry. Do you even know what a network limit load is? Mike motions Doug to stop. 60.",
      "characters": [],
      "action_text": "MIKE Doug. JIM (to Mike) Talk to me outside for a second? Jim leads the way to the door. Mike gives Doug one more look of “please shut up”. DOUG What?! Mike follows Jim to the hallway -- INT. HALLWAY, ENGINEERING DEPARTMENT, RIM 2 - CONTINUOUS JIM What’s a Network Limit Load? MIKE This is impossible. JIM Well what are we supposed to fucking do Mike? Either we jack our stock to the moon or Yankowski fucks us. MIKE Doug is right. Unless the carriers rebuild their entire networks there’s nothing we can do. The phones use too much data. JIM Well then fucking shrink it? MIKE Yeah. Okay. We, we looked into that... JIM ...Uh huh? MIKE (whispering) These guys can’t do it. Mike looks past Jim to the room of engineers. They’ve formed a little circle around a game of   Magic: The Gathering . 61. JIM What do you mean, they can’t do it? You said they were the best engineers in the world. MIKE I said they were the best engineers in   Canada.  Beat. JIM Okay. Alright. Who could do it. MIKE Maybe top guys from Motorola or Microsoft or Google... Jim pulls out his BlackBerry and opens the notes app -- starts typing. JIM Okay. MIKE What, what, what are you doing? JIM Who else? Where else? DOUG (O.S) (muffled through glass) John Carmack! Jim and Mike turn to Doug, who’s standing on the other side of the glass door, trying to listen in. DOUG (CONT’D) (muffled) Get John Carmack! From I.D. Can you guys hear me? The guy who made Doom? Jim looks at Mike. JIM What’s   Doom ? MIKE Have you played   Wolfenstein ? Jim is not impressed. 62. MIKE (CONT’D) Just please don’t sell anymore phones. Jim walks away. DOUG Can you hear me? MIKE Yes! YES! DOUG Oh. Shit. INT. SALES ROOM, RIM 2, WATERLOO - DAY A room of ten young salesmen with the exact opposite vibe of the engineers. If those were budding Mikes, these are wannabe Jims. Muscular, sharply dressed, and with great hair cuts. They’re relaxing as though they’re in a locker room. Stereo blasting. One bounces a ball against a wall; another lifts we",
      "dialogue_count": 0,
      "word_count": 815
    },
    {
      "scene_number": 5,
      "slugline": "EXT. GOOGLE HQ, CA - DAY Jim walks through the Google Campus with his head held high. INT. PAUL STANNOS’ OFFICE, GOOGLE HQ, MOUNTAIN VIEW, CA - DAY Jim sits across the desk from PAUL STANNOS (46, BIG glasses), the name plate on his desk reads “Head of Physical Engineering”. Paul holds a brand new BlackBerry -- still in the box -- PAUL Actually, we’re talking about banning these. JIM Banning? PAUL Nobody pays attention to meetings anymore. They’re crouched over.. JIM Tell them to stop. PAUL Okay. We call them CrackBerries. JIM Come work for me. PAUL I can’t. JIM Why? PAUL Because I am under contract here. JIM How much to break it? PAUL Excuse me? JIM How much money do you want to break your contract with Google? Paul gets up nervously -- walks to the door -- closes it. 65.",
      "characters": [],
      "action_text": "JIM (CONT’D) I’ll give you a million dollars if you sign right now. Paul rushes over to his computer -- unplugs it. PAUL (whispering) I am not moving to Canada. We are not having this conversation. Jim is surprised his number didn’t move the dial. JIM Two million. PAUL Stop. JIM Three million. PAUL I need you to leave. Jim isn’t going to lose -- goes for it... JIM Ten million. Beat. PAUL Well, you don’t have ten million dollars. Jim takes a contract out of his suitcase -- starts amending it by hand... JIM This... is a million dollar option deal. I will backdate that to when RIM was trading at a dollar. Merrill just gave us a target of 13. Jim hands it over. Paul looks down at the contract. PAUL Is this legal?  SELLING/RECRUITING MONTAGE BEGINS  66.",
      "dialogue_count": 0,
      "word_count": 285
    },
    {
      "scene_number": 6,
      "slugline": "INT/EXT. AIRPORT HANGER - DAY Jim marches towards his private plane through an operating machine shop, looking like he owns the place. It’s loud. His BB rings -- looks at it -- picks up... JIM Carl! CARL YANKOWSKI (O.S.) PalmBerry! JIM Eh, listen, I can barely hear you buddy! CARL YANKOWSKI (O.S.) I said PalmBerry. Isn’t that great? JIM Listen uh, I’m getting some static on the line. Can I call you back? CARL YANKOWSKI (O.S.) Jim, I can barely hear you. Jim. Jim holds the phone up towards the loud engine -- CARL YANKOWSKI (O.S.) (CONT’D) Jim, speak up. JIM What? Carl? Okay, I’ll call you later. He cuts himself off by hanging up -- puts his phone away and waltzes up the steps of his plane... INT. RIM'S RENTED WESTWIND JET, 35,000 FEET - DAY  Jim reads an email from Accounting:   Just confirming Jim... 10m in stock to Paul Stannos?  Jim replies:   Do it. INT. NOC (NETWORK OPERATIONS CENTRE), RIM 2 - DAY Close on a computer screen showing the BlackBerry network usage tick upwards... INT. ENGINEERING DEPARTMENT, RIM 2, WATERLOO - DAY Mike and Doug deep in conversation in the engineering department. 67.",
      "characters": [],
      "action_text": "PAUL Mike Lazaridis? Paul Stannos stands at the door to engineering with a box of personal belongings. MIKE If Jim fired you, I can’t undo it! I’m sorry. I’ve tried. PAUL No, No. I, just got hired. It’s Paul. DOUG How ya doing? Welcome! Where are ya coming from? PAUL Uh, Google. DOUG Nice! What’d, what’d you do? PAUL I was the uh, Head of Physical Engineering. The guys look around impressed. EXT. AIRPORT HANGER - DAY Jim struts into the airport hanger. JIM (O.S.) You are not salesman anymore. You’re male models. INT. RACQUET CLUB - DAY Fabian plays tennis. JIM (O.S.) I want you at every Country Club, Yacht Club, Tennis Club. Wherever the elite go, you go. Fabian checks his BlackBerry. JIM (O.S.) (CONT’D) I want them to see you using it. Be big-- 68.",
      "dialogue_count": 0,
      "word_count": 335
    },
    {
      "scene_number": 7,
      "slugline": "INT. COUNTRY CLUB - DAY Mark smokes a cigar while checking his Blackberry. JIM (O.S.) Be LOUD. Have them thinking, who is this annoying prick? And how can I be more like him? INT. TAILORS - DAY McMurtry gets his suit fitted. He types on his BlackBerry. TAILOR What is that? JIM (O.S.) And when they ask you-- JIM (O.S.) (CONT’D) Don’t say it’s a phone that does email... It’s not a cell phone... It’s a status symbol. EXT. TARMAC, WASHINGTON AIRPORT DAY Jim hustles down the steps of his plane. EXT. MICROSOFT, WASHINGTON - DAY Jim arrives at Microsoft. Makes a deal. INT. OFFICE BUILDING - DAY Jim making deals and shaking hands. INT. COUNTRY CLUB - NIGHT Mark being showered with business cards. MARK GUIBERT Anybody else? Anybody else? Alright. INT. SALES ROOM, RIM 2, WATERLOO - DAY Mark hands Austin more business cards. 69.",
      "characters": [],
      "action_text": "AUSTIN Hi. I’m calling on behalf of BlackBerry. I heard that you’re interested in buying some of the quarks for your corporation. INT. NOC (NETWORK OPERATIONS CENTRE), RIM 2 - CONTINUOUS Network ticking up yellow. INT. RACQUET CLUB - DAY Fabian schmoozes with the other players. INT. SALES ROOM, RIM 2, WATERLOO - DAY Fabian shows off his collection of business cards and gives them to Austin. INT. NOC (NETWORK OPERATIONS CENTRE), RIM 2 - DAY Allan monitors the network ticking up yellow. INT. TAILORS - DAY The BlackBerry on the tailor’s desk catches a customer’s eye. INT. SALES ROOM, RIM 2, WATERLOO - DAY Business cards pile up on Austin’s desk. INT. NOC (NETWORK OPERATIONS CENTRE), RIM 2 - DAY The network monitor has ticked up into the RED ZONE.  MONTAGE ENDS  FOX 5 NEWS FOOTAGE: FOX REPORTER It’s 7:55. We are back with Fox 5 Consumer news. A global BlackBerry crisis this morning. The company says it’s experiencing massive service interruptions. (MORE) 70. The company’s help line says, users can expect delays in sending and receiving messages. ENGINEERING DEPARTMENT, RIM 2, WATERLOO - DAY Everyone is going crazy trying to figure out what happened to their traffic. Doug handles the phones. DOUG (on the phone) Yes. Yes. We are aware of the problem and uh, we are.. We are sorting it out right now. I’ll call you back. Doug hangs up. Engineers are scrambling. It’s pure chaos. DOUG (CONT’D) What’s happening man? SCOTT It’s all down there! PRANAY Are we totally fucked? Mike leans out from the NOC door -- MIKE HEY. QUIET! They shut up. Mike slams the NOC door shut. DOUG Let, let, let, let’s just keep it down out here guys... for a second. INT. NOC (NETWORK OPERATIONS CENTRE), RIM 2 - CONTINUOUS Mike closes the door and joins Network Engineer Allan Lewis -- he’s sitting in front of A SINGLE LAPTOP in the middle of the room. MIKE How many are down? ALLAN Maybe... ten thousand? MIKE Jesus. Okay. Okay. Okay. FOX REPORTER (CONT'D) 71. RIINNG!  Mike picks up his BlackBerry. MIKE (C",
      "dialogue_count": 0,
      "word_count": 593
    },
    {
      "scene_number": 8,
      "slugline": "EXT. PAYPHONE BOOTH, CALIFORNIA - CONTINUOUS JIM They! Fucking! Work! INT. NOC (NETWORK OPERATIONS CENTRE), RIM 2 - CONTINUOUS MIKE (O.S.) Yeah. Okay. It’s not us, Jim. It’s the carrier. Verizon is doing something weird. EXT. PAYPHONE BOOTH, CALIFORNIA - CONTINUOUS JIM Well, I’m about to do “something weird” if you don’t fix this. NOW. INT. NOC (NETWORK OPERATIONS CENTRE), RIM 2 - CONTINUOUS JIM (O.S.) The deal was, I get the engineers.. You shrink the data! Mike suddenly makes the connection -- MIKE Are, are you, are you selling more phones? EXT. PAYPHONE BOOTH, CALIFORNIA - CONTINUOUS JIM What the hell do you think I’ve been doing over here, Mike!? We’re in the middle of a hostile fucking takeover! INT. NOC (NETWORK OPERATIONS CENTRE), RIM 2 - CONTINUOUS JIM (OS Do I need to have someone babysit you dorks? MIKE Okay...okay... so THAT’S.. okay. Yeah, the entire system is crashing..  (MORE) 73.",
      "characters": [],
      "action_text": "(to Allan) He’s selling more phones.. Allan looks over at Mike with concern. EXT. PAYPHONE BOOTH, CALIFORNIA - CONTINUOUS JIM HEY. GOD DAMN IT. INT. NOC (NETWORK OPERATIONS CENTRE), RIM 2 - CONTINUOUS MIKE Yeah. Yeah. So.. Okay uh. I didn’t realize.. uh, hold off selling more until we -- EXT. PAYPHONE BOOTH, CALIFORNIA - CONTINUOUS JIM I’M NOT FUCK -- Jim bashes the receiver against the phone, leaving nothing but bits behind as he storms off. INT. OFFICE, MOTOROLA, CHICAGO - DAY Jim sits opposite RITCHIE CHO (Head of Devices). Ritchie reads over a contract. Looks up at Jim. RITCHIE Okay, sorry, is this technically legal? CHARLES PURDY (O.S.) Ritchie! Jim spins around to see CHARLES PURDY (70, heavyset, scary) standing in Ritchie’s doorway... RITCHIE I’m actually in a personal meeting, Charles. CHARLES PURDY And I personally don’t give a flying fuck! Engineering can’t do a god damn thing until you send that fax! Now take a “meeting” when the union isn’t ripping my guts out. MIKE (CONT'D) (MORE) 74. Do you hear me? Get it done. (under his breath) Son of a bitch. Charles SLAMS the door shut -- Ritchie turns to Jim. RITCHIE You said you were located in Waterloo? Jim is still looking at the door where Charles stood. JIM What is that guy’s name? INT. ENGINEERING DEPARTMENT, RIM 2, WATERLOO - DAY It’s madness. All the new superstar recruits have arrived on the same day. Doug stands on his chair with his arms in the air, holding court. Mike watches from the corner of the room. DOUG Okay. Okay. Hey everybody. Welcome to Research in Motion! I know this is a bit disorganized. I promise we will get everybody settled. So um, in the meantime, we are having a bit of a network issue. So, put up you hand if you understand   Mobitex architecture ? Ritchie Cho and Paul Stannos raise their hands. DOUG (CONT’D) Two people. Okay. Uh, that’s fine. You two, you’re with Mike. The rest of you, I don’t know what you do but follow me. We are taking a tour! Let’s go. Doug starts a tour -- DOUG ",
      "dialogue_count": 0,
      "word_count": 2813
    },
    {
      "scene_number": 9,
      "slugline": "INT. ENGINEERING DEPARTMENT, RIM 2, WATERLOO - DAY It’s dark. The lights are off and the projector screen is down, like movie night. But we’re not watching a movie. Instead, the entire engineering department watches STEVE JOBS on stage at MacWorld 2007. We notice the engineering department has gone through another makeover. All of the movie posters and comic books and science fiction novels have been replaced with BlackBerry advertisements. Doug leads Mike into the room from the doorway -- they join the crowd of engineers, all staring in wide eyed wonder/terror. JOBS (ON SCREEN) So. Three things. A widescreen iPod with touch controls. A revolutionary mobile phone and a breakthrough internet communications device. Mike steals a look at Doug watching Jobs. JOBS (ON SCREEN) (CONT’D) An iPod... a phone... and an internet communicator. An iPod. A phone. Are you getting it?! These are not three separate devices. This is   one   device. And we are calling it:   iPhone.  Murmurs from the crowd. JOBS (ON SCREEN) (CONT’D) Here’s four smartphones, right? Motorola Q, BlackBerry, Palm Treo, Nokia E62... Usual suspects. They all have these keyboards that are there whether you need them or not to be there. Mike looks at the same phone in his own hands. JOBS (ON SCREEN) (CONT’D) And they all have these control buttons that are fixed in plastic. Mike looks at the same phone in his own hands. MIKE Why would anybody want a phone without a keyboard? 89.",
      "characters": [],
      "action_text": "JOBS (ON SCREEN) What we’re going to do is get rid of all these buttons and just make a giant screen. A giant screen. Awe from the crowd on screen and in the RIM office. JOBS (CONT’D) When we start shipping in June and we’ll be selling iPhones through our own stores and through Cingular stores. And it’s my pleasure to introduce the CEO of Singular... Stan Sigman. On screen Stan Sigman (55, CEO of AT&T) joins Steve Jobs on stage, they shake hands. MIKE Are you fucking kidding me? DOUG What? MIKE That’s Stan Sigman. That’s the CEO of AT&T. STAN SIGMAN (ON SCREEN) You know, Steve and I first met about two years ago in New York City when he shared with me this vision that he had for this product. MIKE This fucking guy. (to the room) Alright everybody. That’s it. Fun times over. Back to work. I need a prototype of the Bold in my hand by Friday with a working trackpad. Thank you. The lights come on. TV off. Everyone gets back to work. DOUG (Pointing at the screen) That’s crazy. Doug’s BlackBerry RINGS. Unknown Caller. DOUG (O.S.) (CONT’D) Okay guys, let’s get back to work. 90. Doug picks up his BlackBerry. DOUG (CONT’D) Yello! DARA FRANKEL (O.S.) Hi, is this Douglas? DOUG Ah, yeah. DARA FRANKEL (O.S.) I’m from the Securities and Exchange Commission and I was wondering if you could answer some questions for me? DOUG (on the phone) Sure. Okay. SCOTT (O.S.) Has anyone seen Allan? DOUG (to the room) Check the NOC! DARA FRANKEL Were you involved in the hiring of a Mr. Paul Stannos? DOUG Sorry - from where? DARA FRANKEL I’m from the SEC. DOUG Is this a serious call? DARA FRANKEL Yes. DOUG Yeah. You called the wrong person. I can’t help you with anything like that. DARA FRANKEL Is this Douglas Fregin? DOUG Yes ma’am. 91. DARA FRANKEL Sorry. I have you listed here as one of the founders of the company. Doug chuckles. DOUG Yeah. I guess I am. ENGINEER (O.S.) Doug. DOUG I gotta go. Doug hangs up and gets back to work. INT. RECEPTION, NHL HQ, NEW YORK -   DAY Jim paces in the recept",
      "dialogue_count": 0,
      "word_count": 810
    },
    {
      "scene_number": 10,
      "slugline": "INT. ENGINEERING DEPARTMENT, RIM 2, WATERLOO - DAY Mike shouts into the engineering room. MIKE Okay. We gotta go! DOUG One sec. Doug and the guys huddle around his desk with a PROTOTYPE BLACKBERRY BOLD plugged into his computer and a TERMINAL open on the screen. Scott is at the keyboard typing code as fast as he can. DOUG (CONT’D) One sec! (to Scott) This good enough. Good enough. SCOTT This is   good enough ? Allans joins the guys with news. ALLAN Apple is launching a marketplace for applications. It’s going to be third party developers. Anyone. anyone -- DOUG Bad time. Bad time. ALLAN (whispers to Pranay) Third party developers. Scott passes the BOLD to doug who tests the trackpad. The latency is brutal but it works. SCOTT Here man. It’s laggy as hell. DOUG Good enough. Good enough. Good enough. MIKE (O.S.) Now! DOUG Yeah. We got it. 94.",
      "characters": [],
      "action_text": "Doug runs up to him, prototype in hand. MIKE Doug. Come on. ALLAN (to Pranay) They are launching an application market place. DOUG So, the touchpad is working, I don’t know if I would say that it’s  WORKING working . Doug looks to Mike who is displeased.  BBM from Jim:   Can’t make it, go without me, you’ll be fine alone. Mike looks around in distress. DOUG (CONT’D) What? MIKE Do you have a suit? INT. LOBBY, VERIZON HQ, NEW YORK - DAY Mike and Doug enter through revolving doors. Mike takes the lead. INT. BOARDROOM, VERIZON HQ, NEW YORK - DAY Mike stands in front of ten VERIZON Executives. Doug sits beside by the window, looking out at the skyline. The room is silent as a prototype   BlackBerry BOLD   is passed from one person to the next. No one seems that interested. Behind Mike is a Powerpoint presentation on a large screen that goes over the main features of the new BOLD... MIKE  ... 2.4 inches, 480 by 360 HVGA screen and to top it all off, the world’s first trackpad which we believe will be the dominant navigational device for all mobile devices within the next two years.  95. Beat. MIKE (CONT’D) The BlackBerry Bold. John Woodman (now in his 60s) breaks the silence. JOHN WOODMAN That’s it? MIKE Uh huh. JOHN WOODMAN That’s what you’ve got for us? A trackpad? Mike looks to Doug. JOHN WOODMAN (CONT’D) You guys see Apple’s thing? The mere mention of Apple brings energy to the room. Doug looks to Mike. JOHN WOODMAN (CONT’D) Any reaction to that? MIKE Plenty. Yeah. It’s an over- designed, trying-to-do-too-much toy that will crash any network gullible enough to take it on. It is by every metric the exact opposite of   everything we do at Research in Motion.   Less   data, no frills, reliable network. That’s BlackBerry. JOHN WOODMAN Sexy slogan, Mike. The room chuckles -- MIKE So. I guess, you   want   to kill your whole network cause that’s what it will do. JOHN WOODMAN Yeah. The iPhone... they put a keyboard right on the screen? 96. MIKE And it’s the stupidest thing I",
      "dialogue_count": 0,
      "word_count": 3412
    },
    {
      "scene_number": 11,
      "slugline": "INT. RIM PRIVATE JET, JFK INTERNATIONAL AIRPORT, NY - DAY Jim rushes on... JIM Go! Go! Go! Go! PILOT We’ll never make it. JIM I said LET’s GO. (to Austin) Delay Sigman. AUSTIN I called. They said he’s already left for vacation. JIM Where? AUSTIN They just said he’s going to the airport. The plane starts to move. JIM Great. So are we. INT. TINY OFFICE, RIM 2, WATERLOO - EVENING Mike is starting to get nervous as contract after contract is put in front of him... DARA FRANKEL And is this your signature? Mike eyes it. MIKE Yeah. DARA FRANKEL And this? MIKE I don’t know what you’re looking for. These are standard employment contracts. 114.",
      "characters": [],
      "action_text": "DARA FRANKEL I’m just wondering   how   you convinced all these engineers from around the world to come all the way to Canada. Doesn’t make sense. MIKE It’s because they get to work on the best phone in the world. DARA FRANKEL Mike, each of these contracts offers back-dated stock options. You were illegally pricing your own shares so you could hire engineers with money you didn’t have. Mike looks at the contract in his hand -- DARA FRANKEL (CONT’D) Do you know what the sentence is for multi-million dollar stock fraud? MIKE Okay. I swear I had no idea about any of what you just said. DARA FRANKEL Do you expect me to believe that? You’re CEO. Beat. Mike looks down at one of the employment contracts. Sees Jim’s name. MIKE Co-CEO. EXT. RUNWAY, HARTSFIELD-JACKSON INTERNATIONAL, ATLANTA - DAY Jim runs down the stairs of his just-landed plane, holding his BlackBerry to his ear as he runs towards the terminal... STAN SIGMAN (O.S.) Tell me why this can’t wait another few weeks? JIM I’m telling you Stan. I’m headed for the terminal right now. STAN SIGMAN (O.S.) What? 115. JIM I’m at Gate 7. Uh, where are ya? STAN SIGMAN (O.S.) Are you runnin’? JIM No. Stan. No. I’m good. I’m telling ya. Just give me the gate. STAN SIGMAN (O.S.) I’m getting on a plane here, Jim. INT. TERMINAL, HARTSFIELD-JACKSON INTERNATIONAL AIRPORT, ATLANTA - CONTINUOUS Hundreds of people surround him. It’s loud and hectic. Jim searches the terminal for Stan Sigman. JIM No. Okay. Listen. Stan. Alright. Here’s the headline: half a million BlackBerries for AT&T, for zero dollars. STAN SIGMAN (O.S.) What’s the catch? Jim tears past people. Some are distracted by their phones and collide with him. JIM No! No catch. They’re yours. IF you’re willing to release them at a discount one month before the iPhone. Stan groans. Jim stops running -- pleads his case -- JIM (CONT’D) Stan, come on, you owe me. You’ve sold a lot of minutes because of us. STAN SIGMAN (O.S.) Yeah. But you know what the problem with selling minut",
      "dialogue_count": 0,
      "word_count": 620
    },
    {
      "scene_number": 12,
      "slugline": "EXT. RUNWAY, HARTSFIELD-JACKSON INTERNATIONAL, ATLANTA - DAY Jim runs up the stairs of the plane. EXT. PARKING LOT, RIM 2, WATERLOO - NIGHT Jim FOBS himself into RIM. INT. ATRIUM, RIM 2, WA TERLOO - CONTINUOUS Jim opens the front door -- the place is empty, quiet and eerie. Jim crosses the atrium and heads to the stairs. INT. JIM’S OFFICE, RIM 2 - CONTINUOUS Mike sits at Jim’s desk, looking over Jack Manishen’s iPhone projections -- the wall of masks behind him. Jim storms in. JIM Okay, so listen. AT&T   knows   exactly what they’re doing. They WANTED Apple to build a data-guzzling monster because that’s where they’re going to move the market. They’re not selling minutes anymore, Mike. They’re selling DATA. Mike picks up his BlackBerry -- dials... MIKE (on the phone) He’s here. Jim feels a chill. Mike hangs up. JIM Who’s that? MIKE They’re waiting for you next door. Beat. JIM Who? What did you do? 118.",
      "characters": [],
      "action_text": "MIKE I made a deal. The SEC gets you, your board seat, and our full cooperation in the criminal investigation, and for that they’ll leave us alone. Beat. MIKE (CONT’D) And they want 83 million dollars. Jim feels the walls close in, just like when Woodman told him “some nerds took you for a ride” back in 1996. His back is against the wall. It’s done. It’s over. No more rope. And then he can’t help but smile to himself, as if someone just whispered a great secret in his ear. He looks at Mike. JIM You said next door? Jim turns -- walks out of his office -- opens the door in the hallway -- steps inside. Mike watches him leave... ...then goes back to work on his prototype.  TITLE CARD: 2008  INT. MIKE’S BMW, PARKING LOT, RIM 2, WATERLOO - DAY Mike pulls into his “LAZARIDIS” parking space. Jim’s spot: Gone. Doug’s spot: Gone. INT. ENGINEERING OFFICE, RIM 2, WATERLOO - DAY New engineers populate the place. Gone are the familiar faces of Doug, Pranay, Scott, Ethan and Allan. INT. LOADING DOCK, RIM 2, WATERLOO - CONTINUOUS Mike walks along the pathway of the loading dock. Workers unload crate after crate from trucks into the loading bay. Wooden boxes with Chinese shipping labels. 119. Mike lands in the middle of the room, filled with BLACKBERRY STORMS WRAPPED IN THEIR COMMERCIAL PACKAGING... He rips open the plastic wrap. ...Mike picks one up... ...unwraps the box... ...pulls out the BlackBerry Storm... ...turns it on... ...the screen glitches for a moment, then reveals the BlackBerry home-screen, a cramped stack of icons against a “Verizon V” background... ...Mike opens the text app and we see the keyboard on the screen on a keyboard. He touches the screen -- scrolls -- the delay between touch and action is about 1/2 a second -- Suddenly we hear something... ...A quiet hissing... ... static ... ...Mike recognizes the sound... ...looks around the room, searching for the source... ...looks back at the BlackBerry in his hand... ... that’s it   -- his phone is making the hiss. ",
      "dialogue_count": 0,
      "word_count": 863
    }
  ]
}