{
  "slug": "black-mirror-101-the-national-anthem-2011",
  "title": "black mirror 101 the national anthem",
  "genre": "thriller",
  "format": "series",
  "scenes_count": 21,
  "characters_count": 1,
  "characters": [
    "JAMIE"
  ],
  "total_words": 14687,
  "total_dialogue": 1,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. DOWNING STREET BEDROOM - NIGHT 1   1  It’s very dark in here. Virtually the only thing we can make out is a double bed with a couple slumbering beneath a duvet. Beside the bed, a Blackberry thrums into life, on vibrate. From the bed, a man’s hand blearily reaches for the Blackberry, but manages instead to knock it onto the carpet, where it continues to thrum away. He grunts slightly. The Blackberry stops humming. For a moment, all is quiet again. Then another phone rings: an office desk phone, beside the bed. Sighing, he reaches over and switches on a lamp. Now we see him: Michael Callow: early forties. His wife Jane rolls over, pulls the covers up around her. Glancing at the clock beside the bed (5.13am), Michael lifts the receiver with a faintly resigned, apprehensive air. MICHAEL Hello. He listens. MICHAEL (CONT’D) Just tell me what’s happened. He listens. Whoever’s on the phone is saying something, but not giving him the basics:   what is happening?  MICHAEL (CONT’D)  What is it?  The voice on the other end says something. Something that wakes him up. His face drains of what little colour the night had left it with. MICHAEL (CONT’D) I’ll be right down. He hangs up and sits, slightly stunned, for a moment. Jane has woken up herself. She touches his arm to comfort him. JANE What’s happened? MICHAEL (staring into space) Susannah. JANE Susannah? MICHAEL Princess Susannah.  He rips back the bedclothes and reaches for a dressing gown.",
      "characters": [],
      "action_text": "JANE Is she alright? Michael heads for the door. MICHAEL I don’t know. INT. DOWNING STREET BRIEFING ROOM - NIGHT 2   2  A large oak panelled room. Prime Minister Michael Callow sits at a large conference room table, a coffee in front of him, still in his dressing gown. We hear muted sobs. Female. Coming from a speaker. But for now, we’re watching the people in this room. It’s a COBRA meeting. Aside from Michael there are four others present. Sitting to his right: Alex Cairns, Home Secretary, in her early 50s, smartly dressed. Also present: Julian Hereford, DG   *  of MI5 -- also smartly dressed. Standing at the back of the room, Director of Communications Tom Bilce, in trendy specs.   *  There’s also a steely looking man in his mid-30s: Section Chief Walker, also MI5, standing by a plasma screen which is   *  currently demanding everyone’s attention. The screen from which the sobs are emanating. It’s hooked up to a laptop in   *  front of Julian.   *  On screen, an attractive woman in her 20s. Mascara running   *  down her face. Cut-glass accent. We only see her from the shoulders up: straps of a summer dress and fresh bruises. It’s Princess Susannah. Clearly in great distress. Tied in position, arms behind her back as far as we can tell. She looks off to the side: there’s someone standing there, behind the lens. Someone we can’t see. SUSANNAH Don’t kill me. We see Michael’s ashen face, as he watches. Then back to the screen as an electronic voice - one of the standard ones included with modern laptops - speaks, off-mic, to the Princess. ELECTRONIC VOICE Read the statement. SUSANNAH Please don’t kill me. ELECTRONIC VOICE Read the statement.  Black Mirror 'The National Anthem' - Pink Script - 1/8/2011 -   2. SUSANNAH Yes... all right. From that screen? There is a slight pause: we hear brief typing. ELECTRONIC VOICE That is correct. Susannah looks down the lens, and starts to read, like an amateur presenter having to read an autocue at gunpoint. At times hesitant... a",
      "dialogue_count": 0,
      "word_count": 1678
    },
    {
      "scene_number": 2,
      "slugline": "EXT. STREET - DAY 1. EARLY MORNING 3   3   *  A flat above a shop. We close in on a bedroom window. INT. KIERAN & LAUREN’S BEDROOM - DAY 1. EARLY MORNING 4   4   *  This is a bedroom belonging to a young couple. The male half, Kieran, sleeps in bed. His girlfriend Lauren   *  isn’t here yet.   *  The door bursts open. It’s Lauren   his girlfriend, dressed for   *  work -- she works as a receptionist in A&E . She’s holding a   *  laptop and a phone. Kieran jumps.   *  LAUREN Princess Susannah’s been kidnapped! KIERAN   *  You scared the shit out of me. LAUREN There’s a YouTube of it! KIERAN (half awake)   *  Go to work...   *  LAUREN   *  Gabriel texted me about it   from   *  Canada.   *  LAUREN passes him the laptop and then switches on the TV.   *  We look over Kieran’s shoulder at the laptop. The video --   *  beneath it are comments from viewers -- a lot of ‘WTF’ and ‘OMFG’. SUSANNAH (oov)  On all major networks... terrestrial and satellite -- and have full unsimulated sexual intercourse with a pig.  KIERAN Gotta be a pisstake. LAUREN   *  (eyes on the TV)   *  It’s too...   weird   for that. Lauren is watching the channel UKN News -- a news network. LUCINDA TOWNE is the NEWSREADER   *  Archive footage of fire engines and the headline NO WAY OUT   *  Black Mirror 'The National Anthem' - Pink Script - 1/8/2011 -   9.",
      "characters": [],
      "action_text": "LUCINDA TOWNE   *  ... the Tillsdale fire inquiry hears   *  harrowing 999 calls   *  made by trapped residents as flames   *  engulfed the building.   *  LAUREN Why’s it not on the news? SCENE 5 OMITTED 5   5  EXT. UKN NEWS BUILDING - DAY 1. EARLY MORNING 6   6  It’s early morning. We’re looking at a glass-and-steel building. A bit Horseferry Road. A sign with a big UKN News logo. Over this, we hear a woman’s voice. The newsreader. LUCINDA TOWNE (V.O.)   *  Shut Down: The Tate Modern's   *  controversial 'Agitation'   *  exhibition closes three weeks ahead   *  of schedule, amidst criticism from   *  the Culture Secretary.   *  INT. UKN NEWS STUDIO - DAY 1. EARLY MORNING 7   7  A modern rolling news studio. From one side of the camera, we see morning shift news anchor Lucinda Towne reading   *  headlines. LUCINDA TOWNE   *  In the Clear: Footballer Geraint   *  Fitch has been cleared of any   *  wrongdoing following a   *  confrontation with the paparazzi   *  outside a Manchester restaurant.   *  INT. UKN NEWS ROOM FOUR - DAY 1. EARLY MORNING 8   8  This is a meeting room designed to accommodate about twelve people comfortably. Right now it’s holding almost double that, some seated round the table, some standing. On the table a laptop shows the Princess Susannah video. A debate is in full flow. Doing most of the talking are: two reporters, Malaika (female, attractive, late 20s) and Damon (late 30s). Outranking them are Shelly, Day Editor (late 30s) and Martin, Executive Editor (early 40s). Martin sits at the head of the table. DAMON How would we even describe it? An “indecent act”?  Black Mirror 'The National Anthem' - Pink Script - 1/8/2011 -   10. MALAIKA Everyone’s   seen   the video; they already know the full-- SHELLY If we   mentioned   bestiality pre- watershed Ofcom’d be seriously pissed off-- MALAIKA (snorting) Fuck Ofcom. MARTIN We’re still honouring the D-notice - SHELLY But surel-- MARTIN (raised voice) We are honouring the D-notice MALAIKA (sotto) The",
      "dialogue_count": 0,
      "word_count": 2229
    },
    {
      "scene_number": 3,
      "slugline": "INT. WORKSHOP - CONTINUOUS. DAY 1. 19   19  Some kind of workshop, in which a man in paint-spattered overalls has stopped to watch a small TV in the background. He drinks a cup of coffee while watching the broadcast. LUCINDA   *  As police round up potential   *  suspects across the nation this UKN   *  News viewer video shows armed   *  officers raiding an address in   *  Bradford.   A man thought to be   *  connected with a religious pressure   *  group can be seen being dragged to   *  a waiting van.   *  On the screen: shaky iPhone-quality video footage of guys   *  being bundled into the back of a van by armed cops (OR VANS   *  SIMPLY OUTSIDE AN ADDRESS).   *  INT. DOWNING STREET BRIEFING ROOM - DAY 1. 20   20  Michael is doing up a shirt - he’s just got changed. Walker passes him a sheet of paper containing a list of names. Some are organizations -- from Animal Rights to Muslims4Sharia -- others are named individuals. WALKER Our embeds have ruled out the major players: it’s not AQ, not IRA. This is what’s left. Radicals, hate groups, people who’ve threatened yourself or the Royals... JULIAN They’re being brought in as we speak. MICHAEL For more than questioning I hope. (looking at list) Someone knows something. INT. HOSPITAL CASUALTY AREA - DAY 1 21   21   *  In the casualty area they’re still transfixed by the breaking   *  news. LUCINDA (on screen) Two guards in the princess’s security detail were reportedly rendered unconscious during the kidnap.  Black Mirror 'The National Anthem' - Pink Script - 1/8/2011 -   19.",
      "characters": [],
      "action_text": "PIKE (eating a biscuit) If it’s terrorists they’ll take her head off. BRIAN Fuck sake, man. PIKE Just saying. SCENE OMITTED 22   22  SCENE OMITTED 23   23  INT. NASH ARMS PUB - CONTINUOUS. DAY 1. 23A   23A  SONIA, a barmaid-landlady in her early thirties, is behind the bar, preparing pumps for the day’s trade and being distracted by a portable TV in the corner on which the news is being broadcast. Behind her, her faintly nerdy 13-year-old mixed race son has wandered downstairs and is half-watching the news, half-playing a handheld videogame. LUCINDA (ON SCREEN)   *  The video also depicts the Princess   *  reciting a statement containing a   *  bizarre ransom demand of a personal   *  nature involving the Prime   *  Minister.   *  SONIA (eyes on TV) They’ll be asking for a million quid or something. SON (gawping at game) They want him to do it with a pig. SONIA (annoyed by that) Go to school. The boy exits.   *  *  INT. DOWNING STREET STAIRWELL - DAY 1 24   24  TOM BILCE bustles toward his office, Blackberry beeping every few seconds. Beside him, a young assistant called CAMILLA, referring to an iPad, updates him on coverage so far.  Black Mirror 'The National Anthem' - Pink Script - 1/8/2011 -   20. CAMILLA Telegraph has the full video and an interactive timeline, tonally stark, brief mention of ransom being a sex act, nothing too gross... They near the press office... INT. DOWNING STREET PRESS OFFICE   - MOMENTS LATER. DAY 1. 25   25  This is Tom Bilce’s little fiefdom. Computer monitors, and two big tellies at the side. One is tuned to UKN News. TOM and CAMILLA enter.   *  CAMILLA   *  The Sun’s site runs with ‘TAKEN’;   *  big grab of Susannah, mentions the   *  demand euphemistically...   *  It’s a poky room, with desks, and three young assistants in their twenties. One of whom is the quiet, faintly nerdy assistant called ANDREW we saw in a corridor earlier. He’s currently on the phone, speaking slightly in code. ANDREW   *  (on phone) Of course I still want th",
      "dialogue_count": 0,
      "word_count": 710
    },
    {
      "scene_number": 4,
      "slugline": "INT. UKN NEWS CORRIDOR - CONTINUOUS. DAY 1. 25A   25A   *  MALAIKA   *  Want to see how grateful I can be? INT. DOWNING STREET PRESS OFFICE - CONTINUOUS. DAY 1. 25B   25B  ANDREW turns the phone to his other ear and lowers his voice. ANDREW There’s no comment at this time. He hangs up. INT. UKN NEWS CORRIDOR - CONTINUOUS. DAY 1. 26   26   *  MALAIKA looks at her phone and thinks. INT. TOILET STALL - DAY 1 27   27  Malaika has slid the sides of her top down slightly, to expose her shoulders. She is taking a photo of herself with her phone. She looks at it and hits some more keys. INT. DOWNING STREET PRESS OFFICE - DAY 1 28   28  Camilla is still burbling away while Tom gawps at UKN News. CAMILLA Guardian’s businesslike but sympathetic; they   are   running a   *  fucking liveblog --   *  TOM   *  Ugh.   *  CAMILLA   *  ... and a short think piece on   *  historical symbolism of the pig...   *  Andrew’s Blackberry thrums once more. He looks at it. A picture of Malaika -- cut off just below the shoulders. It looks like she’s naked, even though she isn’t. He checks no-one’s looking over his shoulder. Looks at the photo again. And he puts the phone back in his pocket. But now he’s on a slightly different plane, somehow. INT. DOWNING STREET HALLWAY, PRIVATE APARTMENT - DAY 1 28A   28A   *  Jane, with a worried expression on her face, moving down from   *  the flat towards the briefing room.   *  Black Mirror 'The National Anthem' - Pink Script - 1/8/2011 -   22.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 271
    },
    {
      "scene_number": 5,
      "slugline": "INT. DOWNING STREET CORRIDOR - DAY 1. 28B   28B   *  Outside the briefing room door, a security guard, spots JANE   *  and looks at the floor.   *  INT. DOWNING STREET BRIEFING ROOM - DAY 1 29   29  This is now a nerve centre. Staff coming and going -- the PM in shirt pacing up and down. Julian updating him... JULIAN We’ve been squeezing hard but still nothing concrete. Those names were long shots, so maybe no surprise b-- A commotion; someone trying to enter. A security guard trying to stop them. It’s Jane. We hear but don’t see her. JANE (oov) It’s   my   house. You can’t stop me. That’s my doorway. You’re touching  my   doorhandle. Jane pushes past the security guy. Everyone’s looking at her. Then at their shoes. Jane fixes Michael with a look. JANE (CONT’D) (sharply) Can I have a word? Michael opens his mouth. But nothing comes out. INT. DOWNING STREET CORRIDOR - MOMENTS LATER. DAY 1. 29A   29A  A staff member shuts the briefing room doors from outside. INT. DOWNING STREET BRIEFING ROOM - MOMENTS LATER. DAY 1. 30   30  The briefing room is now empty apart from the PM and JANE. MICHAEL It won’t come to that. JANE And if they don’t find her? MICHAEL MI5 have a name; they’re surrounding a place now. JANE Where?  Black Mirror 'The National Anthem' - Pink Script - 1/8/2011 -   23.",
      "characters": [],
      "action_text": "MICHAEL What? JANE Where’s the place? MICHAEL (impressively fast) Truro. JANE (equally impressive) Why are you lying? MICHAEL What? JANE You’re lying. Truro, Jesus. No point arguing. He puts a hand on her shoulder. MICHAEL I don’t want you worrying-- JANE (pushing his arm away) You   never   patronize me, don’t start now. MICHAEL Whoever this is is insane-- JANE -- and has a princess -- MICHAEL Who’ll get through this -- JANE Not any princess, but   the   princess-- MICHAEL Even if they don’t find him -- JANE - Princess Facebook bloody eco- conscious ‘national sweetheart’ ... MICHAEL -- I won’t have to do anything. JANE (tearing up) Everyone’s laughing at us. MICHAEL You don’t know that.  Black Mirror 'The National Anthem' - Pink Script - 1/8/2011 -   24. JANE I know ‘people’. We love humiliation. It’s just slapstick to   *  us -- we can’t   not   laugh.   *  MICHAEL Nothing’s going to happen -- JANE It’s already happening in their heads. In their heads, that’s what you’re doing, what   my husband’s   doing... He touches her neck; she pushes his hand away. He touches it again. His touch makes her cry. JANE (CONT’D) I just... please... She pushes his hand away, but doesn’t really want to. He puts it back, cradling her head. MICHAEL Jane... JANE I love you. There’s a knock at the door. Then it opens to reveal CAMILLA. MICHAEL (irritated) What? CAMILLA Palace on the phone sir. MICHAEL I’ll be there in a bit. Get Alex to stall them. CAMILLA She’s been speaking to her for the   *  last ten minutes. MICHAEL Her? CAMILLA It’s the Queen herself. Michael looks at Jane as if to say ‘sorry, but...’. JANE (understandingly) Go on. Jane masks her tears from CAMILLA as she leaves.  Black Mirror 'The National Anthem' - Pink Script - 1/8/2011 -   25.",
      "dialogue_count": 0,
      "word_count": 538
    },
    {
      "scene_number": 6,
      "slugline": "I/E. CITY - MONTAGE - DAY 1 31   31  We are listening to a radio phone-in over shots of traffic; shots of builders on a site (with a radio); shots of a woman listening in her garden. The host is BOB HAYNES. The first caller is a man called WAROUQ who speaks with a bit of an ‘innit’ tone. BOB So Warouq: you say no negotiation with terrorists? WAROUQ (phone static) Yeah, cos if he did it, right, what next? Someone says we’ll set off a dirty bomb unless Obama does a shit- BOB Sorry Warouq, got to cut you off there, apologies for the language ladies and gentlemen; now on line three it’s Sam, hi Sam... SCENE OMITTED 32   32   *  SCENE OMITTED 33   33   *  INT. STUDIO - DAY 1 34   34   *  Callett is surveying the scene in front of him. Jon is   *  standing still in position behind someone else who is on all   *  fours, as though mimicking a pig. NB no ‘thrusting’ motions.   *  On the other side of the studio is a man standing roughly in   *  position against a large sheet of green fabric.   *  CALLET stands behind Noel -- upon Noel’s laptop we see an   *  image of Jon with the other man’s head mapped onto it.   *  CALLETT   *  Confident?   *  NOEL   *  Bit of a kick bollock scramble but   *  with finessing it should work.   *  CALLETT   *  Then finesse quickly. Our   *  ‘performer’ is on his way.   *  Black Mirror 'The National Anthem' - Pink Script - 1/8/2011 -   26.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 263
    },
    {
      "scene_number": 7,
      "slugline": "EXT. BANKSIDE STUDIOS - DAY 1 35   35  An official-looking car pulls to a halt outside the TV complex.   A waiting officer opens the rear door. Out steps a humourless besuited civil servant called BROWNE, closely followed by a rather goonish-looking lanky man in his early forties, with longish hair and a gold necklace. He’s Colin Flynn, better known by his ‘screen name’ ROD SENSELESS. A porn star ala Ben Dover, in mid-conversation with BROWNE. A one-sided talk: BROWNE is trying to ignore him. ROD It’s a new one for me, obviously, cos it’s illegal. I wouldn’t normally, y’know. Have you seen my stuff? BROWNE No. ROD Well I’m pretty trad. Bish bash bosh. I’d say no fannying about, but I’d be lying. That usually gets a laugh. Not now. ROD (CONT’D) Yeah, well. What do I put on the invoice, that’s what I’m wondering? BROWNE (trying not to sigh) There won’t be any invoicing. During this last exchange, a SPARK unloading equipment from   *  his truck spots Rod, and holds up a cameraphone.   *  SPARK   *  Oy oy Rod! Rod does a cheeky thumbs up as the spark take a snap --   *  BROWNE impatiently hurries him toward the entrance. The pedestrian walks off, fiddling with his phone... SCENE OMITTED 36   36  SCENE OMITTED 37   37   *  SCENE OMITTED 38   38   *  Black Mirror 'The National Anthem' - Pink Script - 1/8/2011 -   27.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 236
    },
    {
      "scene_number": 8,
      "slugline": "INT. UKN NEWS STUDIO. DAY 1. 38A   38A   *  Full screen on UKN as Lucinda Towne chairs a debate between   *  MEHDI RAHBOUD, a surprisingly youthful professor of Middle   *  Eastern Studies and SIR HAROLD MOUNT, former counter-   *  terrorism head.   *  SIR HAROLD (V.O.)   *  I can't think of anything even   *  remotely similar to this - it's an   *  entirely new form of terrorism (the   *  point of which I can't begin to   *  understand)   *  MEHDI   *  If this is terrorism it's not   *  Islamist in nature. To request a   *  pig is -- (specifically abhorrent   *  to)   *  SIR HAROLD   *  That's the point; making love to a   *  pig on live television would be the   *  ultimate humiliation -- (for a   *  Prime Minister)   *  INT. UKN NEWS GALLERY - CONTINUOUS. DAY 1. 39   39   *  MARTIN “Making love”? MARTIN and SHELLY are monitoring the debate from the gallery,   *  SHELLY speaks into Lucinda’s earpiece   *  SHELLY Steer them away from the grisly details. On the screen Lucinda’s eyes indicate ‘OK’.   *  INT. UKN NEWS STUDIO - DAY 1 40   40  Lucinda interrupts the chat about pig-sex. LUCINDA   *  (interrupting)   *  Without dwelling on details, this   *  is a huge national talking point,   *  and isn't that precisely what   *  whoever is behind this wants?   *  INT. HOSPITAL CASUALTY AREA - DAY 1 41   41   *  Brian, Pike, Lauren are watching the debate   *  Black Mirror 'The National Anthem' - Pink Script - 1/8/2011 -   28.",
      "characters": [
        "JAMIE"
      ],
      "action_text": "LAUREN Would they use a female pig? PIKE (nodding) It’s on the list. Lauren looks a bit blank. BRIAN The list of rules at the end of the video. Specifies camera angles and everything. PIKE Like Dogme 95. BRIAN (exasperated) It’s not like Dogme 95. PIKE It’s exactly like it! LAUREN What’s Dogme 95? BRIAN   *  A cinematic movement. PIKE Lars Von Trier. LAUREN Oh. That means nothing to her. Oh Vienna. BRIAN A list of rules for directors; nae background music, only use natural light and so on. LAUREN To save electricity? PIKE (for a laugh) Yeah. BRIAN (exasperatedly cutting him off) For authenticity. PIKE (to Brian) Same as these rules.  Black Mirror 'The National Anthem' - Pink Script - 1/8/2011 -   29.  (MORE) It’s so they can’t cheat it. Intercut some other guy’s arse pumping away. BRIAN It’s nae the same. PIKE Still about authenticity. BRIAN It’s nae the same! PIKE (shrugging) Authenticity. By now, on screen, UKN News are running a poll: Should the PM honour the demand?   86% say no.   *  *  Black Mirror 'The National Anthem' - Pink Script - 1/8/2011 -   30.  PIKE (CONT'D) *  *  INT. DOWNING STREET BRIEFING ROOM - DAY 1 44   44   *  The Prime Minister paces, mulling over his conversation with   *  the Queen with ALEX. TOM is in the corner, checking his   *  Blackberry.   *  In the background WALKER and JULIAN are approached by a young   *  computer analyst called JAMIE.   *  MICHAEL   *  “I trust you’ll do everything in   *  your power to get her back.”   *  That’s what she said.   *  ALEX   *  And we are.   *  MICHAEL   *  It wasn’t a collective ‘you’, it   *  was a singular ‘you’, i.e. me.   *  ALEX   *  I’m sure it was universal.   *  MICHAEL   *  Easy to be confident when it’s not   *  you.   *  Suddenly WALKER calls over from the other side of the room.   *  WALKER   *  Sir we may have something.   *  MICHAEL and ALEX come over. TOM looks up. JAMIE looks a tad   *  nervous when the PM approaches -- he   is   the Prime Minister   *  after all.   *  WALKER (CONT’",
      "dialogue_count": 1,
      "word_count": 1352
    },
    {
      "scene_number": 9,
      "slugline": "INT. DOWNING STREET PRESS OFFICE - DAY 1 51   51   *  JULIAN, adjusting a head mic, watching the plasma screen with   *  the live feed from the soldier’s headcam. The room now resembles the room in which Barack Obama and co watched the storming of Bin Laden’s compound. Generals. Laptops.   *  Advisors. All glued to the screen.   *  JULIAN If he gets wind we’re there, she’s   *  at severe risk; keep assembling and   *  keep quiet.   *  INT. DOWNING STREET BEDROOM - DAY 1 52   52  Jane is sitting at a dresser. A baby’s milk bottle is on the   *  dresser. Offscreen we hear a baby crying. Her laptop is open -   *  - she’s supposed to be working -- but is instead browsing Twitter using the third-party application Tweetdeck. A flurry of tweets. Concern for the princess. Conspiracy theories - is it a ‘False Flag’ operation? Sardonic one-liner gags from celebrity comics. Jokes about how he’s already screwed the country. The hashtag ‘SNOUTRAGE’. And these are the jollier comments. There are tweets joking the PM will catch Pig AIDS and die. Forum debates over which orifice he’ll enter. Tweets which say fucking a pig would be preferable to fucking his wife. The raw cruelty of the net. She can’t stop reading it. EXT. BANKSIDE STUDIOS - DAY 1 53   53  Establishing shot. INT. STUDIO - DAY 1 54   54  BROWNE arrives with ROD SENSELESS. They approach CALLETT BROWNE Agent Callett, this is Mister Flynn ROD (extending hand) AKA Rod Senseless. Stage name. Callett’s not returning the handshake. ROD (CONT’D) (sniffing slightly) Yeah, well. Callett hands him a suit: a replica of one of the PM’s.  Black Mirror 'The National Anthem' - Pink Script - 1/8/2011 -   34.",
      "characters": [],
      "action_text": "CALLETT You need to get into this. ROD There a dressing room I can use? CALLETT No. Rod, unfazed, kicks off his shoes and starts getting changed. ROD Where’s my co-star? Rude not to at least give her a kiss beforehand. CALLETT (coldly) Outside. In the truck. ROD Her own trailer! Who’s doing her hair? Vidal Sassoon? He doesn’t answer. Rod talks to Noel instead. ROD (CONT’D) Full of joie de vivre innee? He turns back to Callett. ROD (CONT’D) “Imagination was given to man to compensate him for what he is not; a sense of humor to console him for what he is.” Francis Bacon. Beat. ROD (CONT’D) Bacon? No? Fuckin’ hell, tough crowd. Callett holds out the green ping-pong-ball facemask. CALLETT You also need to wear this. Rod examines it. ROD You’re sick, d’you know that? He pulls on the facemask, laughing. INT. DOWNING STREET BRIEFING ROOM - DAY 1 55   55   *  The PM has opened some French windows for a crafty fag,   *  blowing smoke out the window to avoid setting off an alarm.   *  Black Mirror 'The National Anthem' - Pink Script - 1/8/2011 -   35. Tom Bilce approaches; the PM’s face indicates that he knows   *  he shouldn’t be smoking but is going to anyway.   *  TOM Have they gone in yet? MICHAEL Think I’d be here if they had?   *  TOM I’ve got statements for either outcome. Listen. The coverage is very sympath-- Michael holds a hand up. MICHAEL I can’t think about coverage now. TOM Of course. Although of course Michael   is   thinking about it now.   *  MICHAEL But it’s on-side? TOM Strong undercurrent of sympathy. Every poll indicates public understanding; disgust with the captor, outrage at the whole thing, but not at you. Tom checks no-one’s listening.   *  TOM (CONT’D) (lowered voice, indicating operation room) Fact is, if Walker’s team fuck up -- not that they will but if they do -- the public   anticipate   non- compliance from us. There’d be squawks from the ‘usuals’ but... It’s not ‘England Expects’. (even lower voice) If he kills her, there’s no blood on your h",
      "dialogue_count": 0,
      "word_count": 692
    },
    {
      "scene_number": 10,
      "slugline": "INT. UKN NEWS GALLERY - DAY 1 56   56  Onscreen, an attractive ACTRESS is burbling away about how the Princess might be coping while Lucinda nods meaningfully. In the gallery, MARTIN regards her with scorn. MARTIN Where do I know twinkletits from? SHELLY Actress. Downton Abbey. She knows the Princess. Martin looks unimpressed. Before he can finish sighing, JACK, the researcher, walks in with a small box. Approaches Martin. JACK This came for you. Left at reception. Martin looks at the box. It’s a small parcel about the size of a sunglasses case. It’s got his name neatly printed on it, and the word ‘URGENT’. MARTIN Feels   cold.  (unwrapping it) Any idea where it’s from? JACK (shaking head) Courier must’ve dropped it off. He removes the outer layer. Inside is a box. It is a spectacles case. Taped to it is a small USB key with the words WATCH ME painted on it in neat lettering. He passes this to SHELLY, who immediately plugs it into a laptop. Meanwhile MARTIN looks at the spectacles case, now very curious indeed. He flips it open. His face recoils with instant disgust. MARTIN Ugh! He almost drops it. Shelly stands up. Instant hubbub. Martin puts the case on the gallery desk. It contains crushed ice, glistening like diamonds and a severed finger. With nail varnish and a very distinctive ring on it. SHELLY Oh Jesus, that ring, is that..? Martin nods, with his hand over his mouth so he won’t puke. MARTIN (to assistant) Call the police.  Black Mirror 'The National Anthem' - Pink Script - 1/8/2011 -   37.",
      "characters": [],
      "action_text": "SHELLY (pointing at finger) Someone shoot that first. She clicks on the laptop with the USB key in it. We see the finder window. There is one file on the USB stick. It’s called PLAYME.MOV. She double clicks it. Up pops a window. Black screen. Then some stark white text. A caption reading:  I GAVE YOU RULES. I SAID NO CHEATING.  Which is then replaced by  ROD SENSELESS? PLEASE.  SHELLY (CONT’D) What does that mean? Martin goes to open his mouth but thinks better of it. The caption is replaced by  SHE PAYS THE PRICE. COMPLY OR IT WORSENS.  It abruptly cuts to a shot of the Princess tied to the chair. Her hands are tied behind her back. She is gagged and   *  screaming. SHELLY (CONT’D) Oh shit... A man with a sack on his head, wearing gloves, is behind the   *  princess -- he has done something to make her scream... then   *  he holds a recently severed finger to the lens. Shelly almost   *  pukes. So does Martin. SCENE OMITTED 57   57   *  INT. ELECTRICAL SHOWROOM - DAY 1 57A   57A   *  We’re in a huge branch of Dixons or Curry’s. A wall of whopping great brand new plasma screens all tuned to UKN News -- just as a huge BREAKING NEWS strap whooshes onto the screen. INT. HOSPITAL CASUALTY AREA   - DAY   *  Our NHS gang are watching part of the finger-severing video   *  being shown on UKN News.  Black Mirror 'The National Anthem' - Pink Script - 1/8/2011 -   38. LAUREN Oh God, I can’t watch this. LUCINDA (V.O.)  The rest of the recording is too   *  graphic for us to broadcast: it   *  depicts the kidnapper brandishing   *  the Princess's severed finger at   *  the camera... UKN News has passed   *  all material to Scotland Yard who   *  are believed to be subjecting the   *  finger to DNA testing immediately.   *  Lauren is shielding her eyes. LAUREN That’s proper grim. It’s got to stop, he’s got to do what they want. BRIAN Who, Callow? (looking back at the screen) Yes he fucking has.   *  INT. DOWNING STREET BRIEFING ROOM   - DAY 1 58   58   *  In ALEX’s office, MICHA",
      "dialogue_count": 0,
      "word_count": 1191
    },
    {
      "scene_number": 11,
      "slugline": "I/E. CITY - MONTAGE - DAY 1 61A   61A  More radio phone-in over shots of bustle. But people are stopping to listen now. WOMAN CALLER If he don’t do it, he’s a killer. BOB The Prime Minister? WOMAN CALLER As good as. BOB Have to say I’m with you there. I/E. UKN NEWS PACKAGE - DAY 1. 62   62  We come in halfway through a UKN News report fronted by DAMON, the reporter from earlier. Archive shot of the door of Number 10 Downing Street. A still of the PM, and a Pie Chart depicting a statistic. OR DAMON   *  OUTSIDE DOWNING STREET.   *  DAMON (V.O.) Just a few hours ago public opinion was behind Prime Minister Callow, with only 8% of the public believing he should fulfill the bizarre and illegal request. Then shots of the ‘finger’ video, and a still photo of the finger -- close up on the ring, with graphic bits pixellated out. DAMON (V.O.) But in the wake of these images and the delivery of the Princess’s severed finger to UKN, the mood is shifting.   *  At which point it cuts to more vox pops. Busy London street. First up, a female shopper in her early 50s. Middle class type. SHOPPER It’d be humiliating but it’s nothing compared to her suffering. DAMON (O.S.) So you think Mr. Callow should comply with the demand? SHOPPER Well I don’t see what choice he has.  Black Mirror 'The National Anthem' - Pink Script - 1/8/2011 -   42.",
      "characters": [],
      "action_text": "Hard yet sloppy news-style cut: to a Doncaster couple in their early forties, out in London for the day. The woman’s a bit more outgoing than the man. DONCASTER WOMAN He’s got to do it. He’s just got to do it. DONCASTER MAN He’s got to. DONCASTER WOMAN It’s a woman’s life. Then we cut again: next vox pop is from a late-forties cab driver. A bit Talksport. CABBIE I won’t watch but if Callow don’t do it, he’s letting that girl die. To save his own dignity, right? But how much dignity is he gonna have, with the whole country knowing he could’ve saved her? At this point we cut to... SCENE OMITTED 63   63  INT. DOWNING STREET BRIEFING ROOM - CONTINUOUS. DAY 1. 64   64   *  ... to reveal Tom Bilce, the PM, and Alex are watching the same UKN News report in Alex’s office. On the screen, Damon’s doing a walky-talky piece to camera in a busy street.   *  DAMON (on screen) Online polls suggest 86% of voters now believe the demand should be met.   *  Tom Bilce switches it off. Michael stares at the screen like he’s just experienced a haunting. Then he turns on his heel   *  into --   *  INT. DOWNING STREET CORRIDOR - CONTINUOUS. DAY 1. 64A   64A   *  We follow, as do Alex and Tom, as the PM stalks down the   *  corridor toward the press room with the operation screen.   *  Alex and Tom go with him...   *  MICHAEL When are Walker’s team hitting the   *  college?  Black Mirror 'The National Anthem' - Pink Script - 1/8/2011 -   43. ALEX They need more time to assemb--   *  MICHAEL It’s almost half two -- no more   *  pissing around.   *  ALEX   *  Julian’s advising against (anything   *  hasty)--   *  MICHAEL   *  And I’m advising   for . They go in   *  now.   *  By now they’ve reached the PRESS ROOM -- everyone looks round   *  at the PM   *  MICHAEL (CONT’D)   *  They go in now.   *  EXT. BUCKINGHAMSHIRE ROAD - DAY 1 65   65  The UKN News van is parked at the side of a country road -- fairly remote, with woods either side. There’s a cameraman beside it getting his gear out of t",
      "dialogue_count": 0,
      "word_count": 969
    },
    {
      "scene_number": 12,
      "slugline": "EXT. BUCKINGHAMSHIRE FIELD - DAY 1 73   73  More of the strike team are moving in.   *  INT. DOWNING STREET PRESS OFFICE - CONTINUOUS. DAY 1. 74   74   *  The PM and his team are seated in   precisely   the same formation as Obama watching the OBL hit, watching this unfold on the screen. Alex sits where Hilary Clinton did. Michael is a picture of concentration. ALEX Michael, if this doesn’t -- Michael puts a hand up to silence her. ALEX (CONT’D) We need to -- The hand again. Alex shuts up; fishes out her phone. INT. STUDIO - CONTINUOUS. DAY 1. 75   75  There’s hardly anyone here but Callett and Browne. Callett’s phone’s blips. He looks at it; then at Browne. CALLETT Radio down to the truck. Get the vet and the handler ready. EXT. COLLEGE EXTERIOR - DAY 1 76   76  The strike team is in position around the building. Either side of a door. One soldier hunched down beneath a broken window. Waiting for Walker to give a signal. Which he does. Foom - the hunched soldier bungs a flashbang through the broken window. Bright white light and smoke: they storm in. INT. COLLEGE - CONTINUOUS. DAY 1. 77   77  Chaos and smoke as we watch from a helmet cam. Shouting -- lots of shouting -- from the officers. INT. DOWNING STREET PRESS OFFICE- CONTINUOUS. DAY 1. 78   78   *  The footage is being streamed live to the screen in the briefing room -- the footage breaks up, pixillates. Michael, Alex, Tom, Julian: everyone watching is silent, staring at the screen as though watching 9/11 unfold again.  Black Mirror 'The National Anthem' - Pink Script - 1/8/2011 -   46.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 282
    },
    {
      "scene_number": 13,
      "slugline": "EXT. COLLEGE PERIMETER   - CONTINUOUS. DAY 1. 79   79  On the other side of the building, Malaika is holding her iPhone up, trying to film through a window using FaceTime. INT. UKN NEWS GALLERY - CONTINUOUS. DAY 1. 80   80  Martin and Shelly are watching Malaika’s footage -- shaky, blurry, blocky, chaotic, on a monitor in the UKN News Gallery. INT. COLLEGE - CONTINUOUS. DAY 1. 81   81  The smoke clears. Walker and team look around. This room is empty. Except, in its centre, an inflatable sex doll in a   *  tiara. There’s a laptop nearby.   *  Walker looks defeated. INT. DOWNING STREET PRESS OFFICE - CONTINUOUS. DAY 1. 82   82   *  Walker addresses the special officer’s helmet cam. WALKER It’s a decoy. Probably bounced the   *  upload from here with a proxy. They   *  could be anywhere.   *  Michael sits staring at the screen in silence. Julian looks   *  distinctly uncomfortable. But just then, behind Walker...   *  INT. COLLEGE - CONTINUOUS. DAY 1. 83   83  ... one of the soldiers spots Malaika’s phone being held aloft at the window. SOLDIER Tango! WALKER Weapons free. Walker spins around. Runs for the rear of the building. EXT. COLLEGE PERIMETER - CONTINUOUS. DAY 1. 84   84  Walker bursts through the rear door, gun drawn. Malaika starts running. WALKER Halt!  Black Mirror 'The National Anthem' - Pink Script - 1/8/2011 -   47.",
      "characters": [],
      "action_text": "Malaika doesn’t stop. Walker aims at her leg; squints down the barrel. Fires. Malaika goes down. Walker runs toward her. INT. UKN NEWS GALLERY - CONTINUOUS. DAY 1. 85   85  Martin and Shelly can’t make out what’s going on from Malaika’s feed. EXT. COLLEGE PERIMETER   - CONTINUOUS. DAY 1. 86   86  Malaika is on the ground, wailing and clutching her leg. Walker, standing, has prised the phone from her. WALKER You press? MALAIKA (through agony) Yes! Walker tosses Malaika’s phone to the ground and shoots it. WALKER There goes your RTS award. INT. DOWNING STREET PRESS OFFICE - CONTINUOUS. DAY 1. 87   87   *  The Downing Street team are trying to make out what the hell’s going on -- it’s chaos on the screen. SOLDIER (O.S.) Suspect down I repeat suspect down. MICHAEL Is it him? Have they got him? On the screen, the helmet cam soldier moves closer to Malaika. Tom Bilce recognizes her. TOM UKN. Malaika something. She’s from   *  UKN.   *  SOLDIER (O.S.) It’s just press sir, collateral. Medic! Michael slumps. MICHAEL There must be something -- ALEX There’s nothing there Michael.  Black Mirror 'The National Anthem' - Pink Script - 1/8/2011 -   48. MICHAEL There’ll be a clue, some evidence... He looks to Julian, as if for help.   *  JULIAN   *  We’ve done all w(e can)--   *  MICHAEL   *  You sent a strike team in to rescue   *  a blow-up doll.   *  JULIAN   *  Look, Michael, I’m sorry--   *  MICHAEL   *  Fuck off Julian.   *  ALEX   *  Michael, it’s twenty past three,   *  we’re out of time. Michael punches the table. MICHAEL We’re not out of time! (looking around, faintly hysterical) We’re not out of time!   *  But everyone else in the room is looking at their shoes, even   *  Julian.   *  Because they   are   out of time. And everyone knows it. MICHAEL exits. Alex moves after him.   *  INT. DOWNING STREET BRIEFING ROOM 87A   87A   *  Michael is chewing a nail, standing by a window. Alex enters,   *  followed by Tom. Tom sheepishly sits at the far end, almost   *  embarrassed ",
      "dialogue_count": 0,
      "word_count": 1423
    },
    {
      "scene_number": 14,
      "slugline": "I/E. BANKSIDE STUDIOS - DAY 1 97   97  The car is parked outside the studio complex. In the back, the PM sits with his head in his hands. Tom Bilce is reading from a post-broadcast statement he has prepared. TOM “Michael Callow has displayed incredible bravery in what was literally a matter of life or death.” That’s how we open, then we move on to -- Michael puts a hand up: stop. TOM (CONT’D) Okay. Yeah. Outside the car, Alex is whispering with CALLETT ALEX Everything in place? CALLETT Yes sir. ALEX It’s sedated? CALLETT Injection. It’s docile. Alex pats him on the arm. Then opens the car door. ALEX (softly) It’s time to go in now. Michael looks up. He is in tears. INT. NASH ARMS PUB - DAY 1 98   98  Hubbub -- the TV is still showing UKN News’s Bankside Studios shot. Then suddenly, an abrupt cut to black. The pub falls silent. A caption on the TV reads: OFFICIAL ANNOUNCEMENT ANNOUNCER This is an official announcement. In a few minutes the Prime Minister will perform an indecent act on your screens. There’s a cheer. Behind the bar, SONIA’s son has reappeared from upstairs.  Black Mirror 'The National Anthem' - Pink Script - 1/8/2011 -   53.",
      "characters": [],
      "action_text": "ANNOUNCER (CONT’D) This is in accordance with the kidnappers’ demands, in the hope that it will ensure the safe release of Princess Susannah. INT. ELECTRICAL SHOWROOM - DAY 1 98A   98A  The announcement is playing on every screen. Staff and shoppers alike have ground to a gormless, hypnotised halt. ANNOUNCER   *  The broadcast will contain strong   *  scenes of a sexual nature which   *  some may find disturbing.   *  INT. WORKSHOP - CONTINUOUS. DAY 1. 99   99  The man in overalls is also watching. He’s put down his materials. Still has gloves on. ANNOUNCER  All   viewers are advised to turn off   *  their televisions immediately. SCENE OMITTED 100   100  INT. KIERAN & LAUREN’S BEDROOM - CONTINUOUS. DAY 1. 101   101   *  Kieran hasn’t got out of bed all day. KIERAN   *  Pfff! He hits ‘record’ on the Tivo remote. SCENE OMITTED 102   102  SCENE OMITTED 102A   102A   *  SCENE OMITTED 103   103   *  SCENE OMITTED 104   104   *  Black Mirror 'The National Anthem' - Pink Script - 1/8/2011 -   54.",
      "dialogue_count": 0,
      "word_count": 380
    },
    {
      "scene_number": 15,
      "slugline": "INT. HOSPITAL CASUALTY AREA - CONTINUOUS. DAY 1. 105   105   *  By now what looks like the entire hospital. Nurses, support   *  staff, doctors... all gathered round the TV watching the broadcast. There’s almost a party atmosphere. ANNOUNCER   *  It is also illegal to allow   *  children to view this broadcast.   *  We see two ORDERLIES pushing MALAIKA on a trolley -- they 106   106   *  stop to watch. She tries lifting her head but can’t quite see   *  over the front orderly’s back. She drops her head back down,   *  frustrated and in pain.   *  ANNOUNCER (CONT’D) The broadcast will commence after the following tone. Suddenly, a piercing tone -- like a rape alarm, comes out of the TV. Everyone covers their ears. INT. NASH ARMS PUB - CONTINUOUS. DAY 1. 107   107  Everyone clutches their ears -- a few dropped glasses. SONIA hits the mute button on the remote. Sighs of relief. INT. BANKSIDE STUDIOS - CORRIDOR - MOMENTS LATER. DAY 1. 108   108  Like a crushed man being led to the gallows, Michael passes through corridors with Alex and Tom beside him. It’s almost dreamlike. An official passes him a small blue pill and a cup of water. Michael takes the pill, necks the water, passes the cup back. ALEX We’re complying with all the stipulated rules, so you’ll have to keep... you have to see it through to the end. Michael keeps walking. ALEX (CONT’D) We’ve placed visual aids -- pornography -- in your eyeline which might... help. That won’t be on camera. Michael keeps walking.  Black Mirror 'The National Anthem' - Pink Script - 1/8/2011 -   55.",
      "characters": [],
      "action_text": "ALEX (CONT’D) The suggestion we’re getting from psychologists is that you should take as long as you need -- to rush could be misinterpreted as eagerness or even enjoyment. By chance they pass ROD SENSELESS, who is being ushered in the opposite direction by BROWNE. ROD immediately peels off, shaking off BROWNE, following the PM ROD Sir? Few tips if I may. ALEX (to security) Get him out of here. ROD I’ve not done   this   but it’s my line of work so to speak. ALEX Get him out. Michael stops walking and looks at Rod’s kind, open face. He’s the only person looking him in the eye. MICHAEL (to Rod) Go on. ROD (quickly) Alright -- your body, your corporeal form, it’s an extension of you, but it’s not   you . It’s not you. You’re in there. (pointing to Michael’s head) Everything else is out here where it can’t touch you. All of this is miles away. And you can travel further, in your head. Fly into yourself. You’ll feel shame: just ride it, like a wave. It’ll help carry you. Michael nods. ROD (CONT’D) At the end of the day, you’re saving a life. And any cunt laughing at you is just a cunt laughing at you. They’re nothing. They’re no-one. Michael looks at Rod. And holds his hand out. Rod accepts it.  Black Mirror 'The National Anthem' - Pink Script - 1/8/2011 -   56. MICHAEL Thank you. And then he moves around the corner, to be faced by the studio door. The red light is on. ALEX We’ll stay out here. It’s just a skeleton crew inside. Closed set. MICHAEL moves toward the door and pushes it open, like he’s stepping into some awful Narnia... INT. STUDIO - CONTINUOUS. DAY 1. 109   109  Michael passes through the backstage area, turns a corner and there it is. A pig, tethered to a weight on the ground. Michael looks giddy for a moment. Behind the animal is a huge plasma screen, showing   *  pornography (naked humans, no pigs).   Also: a cameraman with   *  a hand held camera.   *  INT. GENERIC OFFICE - DAY 1 110   110  The kind of office you get all over London. Deserted. EXT. MAN",
      "dialogue_count": 0,
      "word_count": 761
    },
    {
      "scene_number": 16,
      "slugline": "INT. HOSPITAL CASUALTY AREA - CONTINUOUS. DAY 1. 115   115   *  The gang here are watching the same scene. Lots of hospital   *  staff have assembled. MALAIKA still can’t see. On screen,   *  Michael searches for something to say, words drying in his throat. MICHAEL I love my wife. LAUREN Awww. Pike snorts at that. MICHAEL May God forgive me. And he reaches for his belt. INT. NASH ARMS PUB - CONTINUOUS. DAY 1. 116   116  As the PM reaches for his belt onscreen, a storm of amazement, laughter, shock, rises up in the pub. We pan across watch their faces in slow motion as waves of different reactions flow across them. We see disbelief. Hysteria. Revulsion. Amusement. SCENE OMITTED 117   117  INT. KIERAN & LAUREN’S BEDROOM 118   118   *  Kieran is astounded by what he’s watching.   *  SCENE OMITTED 119   119  INT. DOWNING STREET BEDROOM - DAY 1 120   120  Jane sits on the bed, holding a baby. The TV is off. INT. WORKSHOP - DAY 1 121   121  Overalls man is looking at his small TV screen, while doing something with a rope. He also drags a chair into position.  Black Mirror 'The National Anthem' - Pink Script - 1/8/2011 -   58.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 205
    },
    {
      "scene_number": 17,
      "slugline": "INT. HOSPITAL CASUALTY AREA - DAY 1 122   122   *  Lots of faces watching. Some are laughing, but all can barely   *  believe it. Various reactions: Lauren feels sick, Pike is   *  laughing, Brian is shaking his head.   *  SCENE OMITTED 123   123   *  Black Mirror 'The National Anthem' - Pink Script - 1/8/2011 -   58A.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 57
    },
    {
      "scene_number": 18,
      "slugline": "EXT. OUTSIDE TATE MODERN - CONTINUOUS. DAY 1. 124   124   *  We’re behind a woman. A young woman, in an expensive dress,   *  walking in a slow-mo daze.   *  The woman walks out into a deserted South Bank and looks   *  around. It’s Princess Susannah. She seems drugged or sedated. There is absolutely no-one around. She staggers, falling to her knees. And getting up. INT. WORKSHOP - CONTINUOUS. DAY 1. 125   125   *  On a small TV we see the PM’s sweating, tear-streaked face... and pan across, behind the canvas, which we still don’t see, to find a body close to the lens, apparently twisting as though suspended. It’s in paint-spattered overalls. One of the hands has a severed, bandaged stump in place of a finger. In the background we can see a laptop.   *  INT. NASH ARMS PUB - DAY 1 126   126  The faces have turned more solemn. Some look almost bored, flat or sad. The place has thinned out a bit -- not a lot, but a bit. INT. HOSPITAL CASUALTY AREA - DAY 1 127   127   *  Even PIKE is looking morose. BRIAN glances at his watch and back at the screen. BRIAN Jesus, poor bastard. Lauren lifts a remote -- goes to switch the TV off. PIKE   *  stops her. LAUREN   *  It’s been over an hour. PIKE It’s history, this. EXT. NASH ARMS PUB - EVENING 1 128   128  Establisher -- the light has changed -- looks like quite some time has passed. INT. NASH ARMS PUB - EVENING 1 129   129  The pub has thinned out. The TV’s still on but everyone watching it looks sad and drained. Haunted, almost.  Black Mirror 'The National Anthem' - Pink Script - 1/8/2011 -   59.",
      "characters": [],
      "action_text": "There’s an expression playing across their faces -- a sort of final pinch of disgust mixed with the end of a disappointing goalless draw. One guy with a pint talking to his friend: BLOKE Least it’s over with. EXT. MILLENNIUM BRIDGE - EVENING 1 130   130   *  Slow mo. A group of concerned passers-by is gathered around someone on the floor. It’s Princess Susannah.   A policeman is pushing his way through. INT. BANKSIDE STUDIOS TOILET - EVENING 1 131   131  A poky communal gents toilet cubicle in which Michael is being violently sick, crying and wiping his nose. INT. BANKSIDE STUDIOS CORRIDOR - EVENING 1 132   132  Outside, Alex waits with a couple of officers. The sound of the PM’s vomiting leaks through the door. Suddenly Alex feels her phone vibrate. She answers it. INT. HOSPITAL CORRIDOR - EVENING 1 133   133   *  WALKER is in a hospital area; nurses etc. passing in b/g. WALKER She’s back sir, we’ve got her. Susannah. INT. BANKSIDE STUDIOS CORRIDOR - CONTINUOUS. EVENING 1. 134   134  ALEX They   released   her? She signals to Tom Bilce - gestures a thumbs up. Tom looks as relieved as a man who’s just discovered the moon isn’t about to crash into the planet after all. ALEX (CONT’D) Where? INT. HOSPITAL CORRIDOR - CONTINUOUS. EVENING 1. 135   135  WALKER Slap bang in the city. Stumbling   *  around -- sedated -- she can’t remember anything. But she’s unharmed.  Black Mirror 'The National Anthem' - Pink Script - 1/8/2011 -   60.",
      "dialogue_count": 0,
      "word_count": 540
    },
    {
      "scene_number": 19,
      "slugline": "INT. BANKSIDE STUDIOS CORRIDOR - CONTINUOUS. EVENING 1. 136   136  ALEX But the finger--   *  INT. HOSPITAL CORRIDOR - CONTINUOUS. EVENING 1. 137   137  WALKER Not hers. DNA shows it’s Male.   *  INT. BANKSIDE STUDIOS CORRIDOR - CONTINUOUS. EVENING 1. 138   138  ALEX What-- INT. HOSPITAL CORRIDOR - CONTINUOUS. EVENING 1. 139   139  WALKER That’s not all ma’am. She’d been   *  walking around for some time. ALEX What do you mean, ‘some time’? WALKER There’s a CCTV grab of her from half three. He let her go 30 minutes   before   it happened. INT. BANKSIDE STUDIOS CORRIDOR - CONTINUOUS. EVENING 1. 140   140  ALEX Why? WALKER (on phone) My guess? He knew everyone would be elsewhere. Watching screens. Alex digests that. An almost holy expression of recognition spreads across her face. ALEX   *  So it’s a statement.   *  WALKER Ma’am?   *  ALEX   *  (to no-one in particular)   *  That’s what this was all about.   *  About making a point.   *  Black Mirror 'The National Anthem' - Pink Script - 1/8/2011 -   61.",
      "characters": [],
      "action_text": "WALKER   *  Should we--   *  ALEX (lowering voice) Lose that page of the report.   No- one knows . Especially the PM. WALKER Of course.   *  Alex hangs up. Composes herself, clears her throat, and knocks on Michael’s dressing room door. ALEX Good news Michael. INT. BANKSIDE STUDIOS TOILET - CONTINUOUS. EVENING 1. 141   141  Michael is on the floor by the toilet. Alex calls to him. ALEX (muffled) You saved her. Susannah’s alive and well. Michael feels nothing. On the floor, his phone rings again. It’s Jane. He looks at it. But doesn’t answer. INT. DOWNING STREET BEDROOM - CONTINUOUS. EVENING 1. 141A   141A   *  JANE, in tears, listening to the phone ring and not answer.   *  At this point, the CREDITS start to cut in - as still boards.   *  Damon’s voice continues across the credits -- no music. The   *  following epilogue is threaded between them. I/E. UKN NEWS STUDIO - DAY 2. 142   142  Then we cut to footage of Michael on the campaign trail, with Jane by his side. Looking round a community project, nodding.   *  DAMON (V.O.) On the one year anniversary of his humiliating ordeal, an apparently unconcerned Michael Callow put in an assured performance at a public appearance today, accompanied by his wife Jane.... SCENE OMITTED 143   143  Black Mirror 'The National Anthem' - Pink Script - 1/8/2011 -   62.",
      "dialogue_count": 0,
      "word_count": 399
    },
    {
      "scene_number": 20,
      "slugline": "INT. NASH ARMS - CONTINUOUS. DAY 2. 143A   143A  In the pub, a few disinterested drinkers. The smaller portable telly is displaying the news report. DAMON (V.O.) ... during a visit to a community   *  project in Lincoln.   *  INT. HOSPITAL CASUALTY AREA - CONTINUOUS. DAY 2. 144   144   *  A few staff, including LAUREN, are chatting, ignoring the   *  news report on the screen behind them On the screen we cut to footage of Princess Susannah -- who is now lightly pregnant and at a red carpet event. DAMON The other central figure in last year’s events was also before the cameras, at last night’s Children of Valour awards; Princess Susannah made her first public appearance since announcing her pregnancy. Slow zoom on still of the artist standing in his workshop. We also see slow-mo footage of the artist from a Culture Show episode, in slow mo, in his studio. This footage loops. DAMON (CONT’D) (over this footage) It was one year ago today that former Turner prize-winning artist Carlton Bloom coerced the Prime Minister into committing an indecent act with the audacious kidnap. INT. KIERAN & LAUREN’S BEDROOM - CONTINUOUS. DAY 2. 145   145   *  Kieran sits with his back to the TV playing a handheld   *  videogame, ignoring the telly, upon which we see Damon doing   *  a walky-talky link in the alleyway Susannah wandered through. DAMON Immediately after releasing her from his South Bank studio, Bloom   *  hanged himself, leaving behind a note declaring what had occurred to be his final artwork.  Black Mirror 'The National Anthem' - Pink Script - 1/8/2011 -   63.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 269
    },
    {
      "scene_number": 21,
      "slugline": "I/E. UKN NEWS REPORT - CONTINUOUS. DAY 2. 146   146  DAMON (V.O.) As the anniversary arrived, one art critic has caused controversy by describing it as the first great artwork of the 21st Century. Shot of a shaven-headed art critic with even twattier glasses. A caption reads ‘GREGORY DYCE, Art in Review’   *  GREG There’s no rule that says art must be admirable or even enjoyable. The best art often unsettles us, which this certainly did. And of course it was the single biggest artistic collaboration in history, one in which all of us took part.   *  Shot of Michael and his wife -- his arm around her waist --   *  waving to the cameras outside Number Ten, then going in. DAMON (V.O.) But while cultural commentators debate its artistic worth, there’s no denying the incident failed to destroy a Prime Minister who currently holds an approval rating 3 points higher than this time last year. Damon Brown, UKN.   *  As he says this, Michael & Jane shut the door of Number Ten. INT. NUMBER TEN ENTRANCE - DAY 2. 147   147  The door has just shut behind Michael and Jane. Her face goes cold the moment the door shuts. She pushes his arm off her and walks up the stairs. And he looks up at her, as she goes. But she doesn’t look back.  TELEVISION PROGRAMME ENDS HERE  Black Mirror 'The National Anthem' - Pink Script - 1/8/2011 -   64.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 242
    }
  ]
}