{
  "slug": "black-mirror-102-fifteen-million-merits-2011",
  "title": "black mirror 102 fifteen million merits",
  "genre": "drama",
  "format": "series",
  "scenes_count": 9,
  "characters_count": 1,
  "characters": [
    "JUDGE WRAITH"
  ],
  "total_words": 13862,
  "total_dialogue": 1,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. BING’S TINY ROOM - DAY 1 1   1  I’m not kidding about this being a tiny room. We’re seeing  it from above, and all four corners fit comfortably on the  screen.  Bing (early 20s, male) is asleep in a small bed; so small  he’s almost touching both walls. Despite being undersized,  the bed touches three of the surrounding bedroom walls.  Walls which seem to be made of black reflective glass.  Except they’re not black glass. They’re screens. And now  they flicker into life, with a startup noise, to display a  computer-generated sunrise over a cornfield. A cheesy  screensaver to start the day. On every wall of the room.  Gentle acoustic guitar accompanies the pixellated sunrise.  A cartoon cockerel leaps atop a fencepost somewhere near  Bing’s head. It opens its beak and crows.  Bing grunts, swats the cockerel away by swiping in the air.  That’s what these walls are like: monolithic iPad screens  working in harmony.  He lies there for a moment rubbing his eyes. Up pops a short  ‘loading’ message on the wall, as the software scans his  face. Meanwhile he inserts two small rubberized earpieces --  one in each ear -- part of his morning routine. As he slips  them in, we hear a little ambient background noise on the  soundtrack. Soothing background minimal stuff, like you might  hear in a spa.  Then, with a soft ‘ping’ sound, the system logs him in --  just like the XBOX Kinect system recognizing someone from  their face alone. A small ‘Top Trumps’ style dialog box  appears on the wall containing h a vaguely toonlike CGI  dopple of Bing -- rather like an XBOX Live or Wii  customizable dopple -- accompanied by a number: ‘15,002,944  M’.  (NB - rather than a straight ‘M’, how about some kind of  iconic logoette -- like the Bitcoin logo  (http://mining.bitcoin.cz/media/img/bitcoin.png )  Bing swipes his hand up in the air to guide a movement. The  sunset scrolls upwards, like a theatrical curtain. Behind  it, notionally at any rate: an LCD clock. The time is  7.30am.  Bing grunts, sits up and rolls to the edge of his bed. He  stands up and enters the bathroom.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 359
    },
    {
      "scene_number": 2,
      "slugline": "INT. BATHROOM MIRROR   - DAY 1 2   2  We can hear a shower, see condensation on a mirror, which has  an M number on it, ticking down: it falls two numbers every  second. The water stops, the counter stands at 15,002,599.  Bing, with a a towel wrapped round him, is now in the mirror -  which is also doubling as a screen.  Icons hover near the side and a ticker-tape providing  entertainment news scrolls across the top.  Using a wall-mounted mini-pump, like a miniature petrol  pump nozzle, he dispenses a small amount of bright green  toothpaste onto a brush. The number on the screen drops  another fifteen points to 15,002,584m. He brushes, spits,  rinses.  Bing checks his face in the mirror. Suddenly his reflection  is replaced with the face of an attractive scantily-clad  young woman moaning; she seems to be having sex. There’s a  lascivious growling voiceover.  VOICEOVER  New! From Wraithbabes! The  hottest girls in the nastiest  situati--  Bing makes a ‘shooing’ gesture in the air before him, as  though telling it to shoo. The video freezes and over it, a  a dialog box pops up. ‘RESUME?’. He shoos it away again.  There’s a soft ping as the system registers this.  ‘SKIPPING INCURS 1000m PENALTY. RESUME?’. He impatiently  shoos it away   again . And the number counter drops 1000m to  15,001,584m.  The advert is replaced by his reflection once more.  Surveying his reflection uninterrupted this time, Bing  realises he needs a shave. He pulls out the same nozzle as  earlier, cups his hand over the end, taps an icon on the  mirror. Shaving foam schtooms out of it.  The number on the screen drops some more. Bing keeps an eye  on the screen -- he’s trying to stop the nozzle at a nice  round number, like someone filling a car with petrol trying  to stop on an even figure: 15,001,500m. He fails. He gets  15,001,499m and looks marginally deflated.  He selects an icon with a musical note on it -- music starts  to play, causing his M number to drop by another 1000m to  15,000,499. Surprisingly, the music is a cover version of  ABBA song - the opening bars of ‘I Have a Dream’.  BLACK MIRROR - 15 Million Merits - Blue Pages - 1/9/2011 - 2.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 378
    },
    {
      "scene_number": 3,
      "slugline": "INT. LIFT - DAY 1. MORNING. 2A   2A  BING is standing in a lift, amongst a group of people in  identical clothing, all looking ahead, a bit bored, all  listening to their own music (maybe one is nodding their head  in time to a different beat). They’re like commuters.  INT. PEDAL CHAMBER 59A - DAY 1 3   3  The bland ABBA continues as Bing, now clothed in discrete  grey sweatpants and a slim grey T-shirt -- halfway between  a uniform and exercise gear -- walks through a ‘pedal  chamber’ filled with futuristic exercise bikes -- it’s a  bit like a modern gym.  SINGER  I have a dream, a fantasy  To help me through reality...  As he walks past, a shy, relatively bookish-looking girl  sitting on a bike, looks at him. Her name is SWIFT.  We also see a ginger-haired guy called KAI, watching a video  of SELMA TELSE on his screen.  At the far end of the chamber, a slightly out-of-shape  cyclist called OLIVER puffing away. He looks red and sweaty.  BING sits upon something resembling an exercise bike with a  plasma screen mounted on the wall in front of him.  As he sits down, the screen recognizes and signs him in. The  bike adjusts to his settings: shifting the seat slightly for  his height and weight. His toon-style avatar - known as a  ‘dopple’ - appears on screen.  SINGER (CONT’D)  And my destination  Makes it worth the while  And accompanying the avatar is that number again:  15,000,499m. He starts to pedal. And the number starts to  rise. Roughly one digit per revolution.  It’s about this point we realize the figure equate to the  distance pedalled. The number (still rising as he pedals)  shrivels to the bottom right, where it remains visible.  SINGER (CONT’D)  Pushing through the darkness  Still another mile  I belie--  BLACK MIRROR - 15 Million Merits - Blue Pages - 1/9/2011 - 3.",
      "characters": [],
      "action_text": "Around here we cut to a wider shot -- outside of Bing’s  little bubble -- we can no longer hear the music, just the  quiet whooshing of all the exercise bikes in this quadrant,  and the occasional bit of noise leaking from the pedaller’s  headphones.  Up pops a series of ‘Available Streams’: not unlike the  ‘album view’ in iTunes -- Bing can swipe through them. The  first says NOW PLAYING and it shows a woman called Selma  (“HOT SHOT SENSATION SELMA”) performing ‘I HAVE A DREAM’.  Bing swipes it off-screen, like he’s flipping pages. The  music abruptly stops.  The next is a show called ‘Botherguts’. It looks like some  kind of reality show. A group of fat people are standing in  tissue paper smocks in some kind of indoor funspace. He  quickly flips past this and selects ‘Rolling Road’ -- which  displays a toon-style landscape rolling past as he pedals.  His merit total has been rising as he pedals - it stands at  15,000,559 and then decreases by 250m to 15,000,309m.  Quick glimpse of SWIFT, several bikes down -- she’s sneaking  a glance at Bing, who’s oblivious.  As Bing watches the rolling road, and Swift watches Bing,  we pull out to reveal they aren’t alone.  In fact they are   exceptionally   far from alone.  This place is like a warehouse. A vast warehouse filled  with hundreds of people on hundreds of cycles, all of them  pedalling, all of them staring at screens on the  handlebars.  There are cleaners passing between the bikes, wearing  yellow jumpsuits, scooping up discarded water bottles and  face towels with little dustpan-and-broom combos. Every one  of them, without exception, is overweight.  Next to Bing’s pedal cycle a cycle belonging to a stocky 28  year old called Dustin. He’s wearing identical clothing to  Bing - his credit number is increasing considerably faster  because he’s pedalling faster.  Dustin is watching Botherguts. We see a bit more of the show  on his screen. In front of the fat people a host is standing  with a man and a woman -- both ",
      "dialogue_count": 0,
      "word_count": 1503
    },
    {
      "scene_number": 4,
      "slugline": "INT. BING’S TINY ROOM - EVENING 1 6   6  It’s later that same evening. Bing is relaxing on the bed,  playing a videogame. He is using his finger to mime a gun.  Fat CGI people are running at him, making grotesque  grunting sounds as they approach. He’s blowing their heads  off. It’s all very graphic. He looks bored.  Suddenly the action pauses. Time for a commercial break.  The game dissolves -- and is replaced by a hyper-graded shot  of an attractive female singer hitting a climactic wailing  note. A huge caption reads SELMA TELSE  BOOMING MAN (V.O.)  Selma Telse!  Whoosh! And Selma is replaced with a wiry young man singing.  BOOMING MAN (V.O.)  Howie Mandelbrot!  Whoosh! And now we’re watching a pair of early twenty  somethings robot-dancing.  BOOMING MAN (V.O.)  Toy Soldiers!  Now we see they’re performing on a stage in front of several  judges.   NB Judge Wraith isn’t there. In his place is JUDGE  REISZ (appearance TBC).  BOOMING MAN (V.O.)  Today each headlines their own  tentpole content on one of your  eight daylight streams. But they  started here. Like you. Putting  their back into giving back -- for  a brighter now.  CCTV footage of Selma, Howard and several members of the Toy  Soldiers, all pedalling away on individual bikes. This is not  one shot: it’s a compilation of shots from different cameras  on different days.  This is ‘before they were famous’ material.  BOOMING MAN (V.O.)  Each paying their dues - like   you   --  hoping to become a Hot Shot.  Then a ‘whoosh’ as we see Selma in the embryonic stages of  fame - nervously waiting to walk onstage, in the wings of the  Hot Shot theatre.  BLACK MIRROR - 15 Million Merits - Blue Pages - 1/9/2011 - 8.",
      "characters": [],
      "action_text": "Another ‘whoosh’ -- she’s performing on stage, hitting a high  note, wearing the same regulation grey clothing as Bing.  She’s just finished singing.  The three judges are sitting in a row, in front of a screen  with an audience of dopple avatars. A deadpan man on the end  is looking at her. He is Judge Hope. He pauses.  JUDGE HOPE  That wasn’t good.  Selma looks like she might die of sadness.  JUDGE HOPE (CONT’D)  That. Was. Beyond. Incredible.  An explosion of applause.  Then we see shots -- almost CCTV style -- of people sitting  in tiny rooms just like Bing’s -- watching Hot Shot -- one of  them punches the air - -then we see an avatar in the audience  punch the air. (NB needs to be someone we don’t see elsewhere  in the story -- an extra basically - about 23 yrs old).  VOICEOVER  YOU decide the victors! YOU control  their fates! YOU make the call on --  BING’s had enough and abruptly shoos it away. Up pops the  dialog box:  ‘RESUME?’ He shoos it away. ‘SKIPPING INCURS PENALTY.  RESUME?’  Bing glances at the number beside his head - it reads  15,015,829. He’s spent too much today skipping adverts. But  he shoos it away regardless. His credit drops by 1000m to  15,014,829.  The walls fade to black for a moment (a little ‘LOADING’  icon?) -- like the gap between adverts on television. Then up  pops the porn ad again.  VOICEOVER (CONT’D)  New! From Wraithba--  Bing shoos this away too. Up pops the dialog box:  ‘RESUME?’ He shoos it away.  ‘SKIPPING INCURS PENALTY. RESUME?’  Bing glances at the number beside his head again, and  sighs. He makes a sort of quick beckoning motion -- like  when you’re trying to indicate ‘keep reversing’ to a  driver. And the commercial resumes.  BLACK MIRROR - 15 Million Merits - Blue Pages - 1/9/2011 - 9. Tired, he lies back and absent-mindedly covers his eyes  with his hand. The commercial pauses. A large caption reads  ‘VIEW OBSTRUCTED’.  Bing removes his hand. His eyes are still closed. He yawns.  The commercial is waiting.  The wal",
      "dialogue_count": 0,
      "word_count": 822
    },
    {
      "scene_number": 5,
      "slugline": "INT. BING’S TINY ROOM - AT THE DOOR. MORNING. DAY 2. 8AA   8AA  BING is ‘opening the door’ to leave for ‘work’. We see him  make some kind of clever door-opening gesture -- see the  graphic for the door mechanism --  POLITE VOICE  Portal activated.  -- and the door opens and he steps out.  INT. LIFT - MORNING. DAY 2. 8A   8A  Bing is standing in the lift amongst the group. A pretty girl  -- ABI -- gets in. He clocks her and is clearly interested,  but says nothing. She doesn’t notice him.  INT. PEDAL CHAMBER 59A - DAY 2. 9   9  Bing is approaching his bike. He notices an empty seat where  OLIVER was yesterday.  SWIFT  It didn’t let him sign in. Told him  to report to 22 down.  DUSTIN breezes past.  DUSTIN  Told you. Gone lemon, the lazy  fuck.  SWIFT pulls a face at DUSTIN’s back, looks back at BING --  they share a brief moment.  INT. PEDAL CHAMBER 59A - DAY 2. 10   10  A short time later.  On the onscreen interface, KAI is shopping for customisable  avatar items. Trying out different haircuts for his character  -- all ginger, like he is. The haircut becomes an afro, a  spiky mohawk -- he gets SWIFT’s attention.  KAI  (to SWIFT)  What you think?  SWIFT  It’s a bit much.  KAI looks a bit disappointed, goes back to his screen and  settles on a dopple hairdo similar to his existing one.  BLACK MIRROR - 15 Million Merits - Blue Pages - 1/9/2011 - 11.",
      "characters": [],
      "action_text": "DUSTIN is watching a video of SELMA singing one of her  hits. KAI is watching a TALKING HEAD INTERVIEW with SELMA,  shot against an indistinct backdrop. It’s illustrated with  stills occasionally, like a nostalgia package VT. Briefly  we move to a vantage point where we can hear DUSTIN’s  audio.  SELMA  (on screen, pondering  question she’s been  asked)  The best thing about my new  lifestyle...? Uh... where do I  start... I love choosing my own  clothes, I love red, I think it  really expresses a truth about who  I am... I love looking out over  (the outside)  While she burbles on, we move away, out of KAI’s audio  bubble... Then we notice OLIVER walking through, in a yellow  cleaner suit. Sweeping up. DUSTIN clocks him.  DUSTIN  Hey, nice outfit.  OLIVER doesn’t respond, but numbly keeps on cleaning.  DUSTIN (CONT’D)  Suits you.  Bing notices this. Rubs his eyes a bit and stops cycling.  INT. 59A LAVATORY - LATER. DAY 2. 11   11  Bing is standing at a urinal, urinating. As well he might.  The urinal is mounted on another wall-sized screen. On it is  a kind of animated graphic advert showing two happy, smiling  people pedalling on generator bikes- a man and a woman. It’s  vaguely reminiscent of vintage Soviet propaganda.  RIDING FOR A BRIGHTER NOW reads the legend.  As he stares at the screen, blankly, Bing hears a sweet  female voice, singing. The song is ‘Anyone Who Knows What  Love Is’ by Irma Thomas, but that’s not important right now.  ABI  (singing)  You can blame me... try to change  me... but still I’ll care for you..  Bing registers the beauty of the voice.  BLACK MIRROR - 15 Million Merits - Blue Pages - 1/9/2011 - 12. ABI (CONT’D)  (singing)  The world may think I’m foolish...  they don’t see you like I can...  But anyone who knows what love  is... will understand.  CUT TO Bing standing at the washbasin. His avatar is  displayed in the mirror above the sink. He holds his hand  under a soap dispenser -- his M credit drops ten points to  15,010,861m.  Behi",
      "dialogue_count": 0,
      "word_count": 1062
    },
    {
      "scene_number": 6,
      "slugline": "INT. BING’S TINY ROOM - EVENING 2. 15   15  Later that same day -- at night. BING is lying on his bed  humming the tune ABI was singing earlier. He can’t get it out  of his head.  Suddenly the wall explodes into the HOT SHOT advert again. He  makes a gesture with his hand to suggest ‘muting’. Dialog box  pops up: MUTE AUDIO? He gives a thumbs up. MUTING INCURS  PENALTY? MUTE AUDIO? He gives another thumbs up.  As the walls continue to depict the HOT SHOT visuals (SELMA,  the JUDGES etc), BING continues humming ‘Anyone Who Knows  What Love Is’ to himself.  INT. PEDAL CHAMBER 59A - DAY 3. 16   16  The next day. BING is cycling. DUSTIN is watching SELMA  again. SWIFT is playing her virtual violin. ABI gets off her  bike. BING notices this, and stops pedalling himself.  INT. SNACK AREA - DAY 3. 17   17  Abi is by a huge vending machine with a screen on it. She’s  logged in and is trying to buy an apple, which is lodged in  the machine and won’t come out.  ABI  Oh come on.  Bing sidles up.  BING  Wait, there’s a knack to it.  Reaches into the slot, delving with his arm  ABI  It’ll take your fingers off --  BING  Trust me.  He finds something. A gear grinds in the machine and the  apple drops down. In its paper wrapper.  ABI  Smart.  Bing offers his hand.  BING  Bing Madsen. Short for Bingham.  BLACK MIRROR - 15 Million Merits - Blue Pages - 1/9/2011 - 15.",
      "characters": [
        "JUDGE WRAITH"
      ],
      "action_text": "ABI  Abi Khan. Short for Abi Khan.  They start moving toward the table.  BING  You’re a new person. I’ve not  seen you.  Abi takes a bite of the apple.  ABI  (mouth full)  Just went 21 last week. Wanted to  go to Airedale, my sister's  there. Full apparently.  She savours the taste.  ABI (CONT’D)  Proper fruit. Worth the revs.  BING  Most natural thing in there and  it’s probably grown in a petri  dish.  ABI  Yeah. Worth it though.  BING  That’s the right way round. When  you get the cheap lardy gunk you  end up having to pedal it off.  Then you want more sugar and  you’re playing catch up... Been  there. Vicious circle.  ABI  Can’t you just use that CBT app?  BING  What’s that?  Abi takes a seat at a nearby table. Bing hovers anxiously  at the edge. As she sits, she carefully unfolds the  wrapper, smoothing it flat.  ABI  (as she sits)  This Cognitive Behavioral thing  which realigns your thinking so  you pick healthy food. Whispers  you into it while you sleep.  BING  Yeah I should try that.  BLACK MIRROR - 15 Million Merits - Blue Pages - 1/9/2011 - 16. Bing doesn’t have any more to say about that. And Abi is  munching that apple.  BING (CONT’D)  I liked your singing the other  day.  ABI starts folding the wrapper.  ABI  (embarrassed, smiling)  I was trying to sing so no-one  could hear me pee. I’m not Selma  or anything.  Bing finally sits down.  BING  You’ve got a phenomenal voice.  Really. It was the most beautiful  song --  He notices she’s looking at him with disbelief.  BING (CONT’D)  You think I’m being cheesy. I am  being cheesy. But it was  beautiful. So, you know, reality  is cheesy sometimes. Not often,  admittedly, but now, yes.  ABI  (mouthful of fruit)  Well thank you. It’s just noises  though. Noises in the right order.  ABI is folding the wrapper -- another penguin taking shape.  BING  Don’t downplay, you’re good.  ABI  The song’s good. It’s old. My mum  used to sing it. And she learned  it from her mum. A hand-me-down.  Bing nods sheepishly, and ",
      "dialogue_count": 1,
      "word_count": 4833
    },
    {
      "scene_number": 7,
      "slugline": "INT. LIFT - DAY 5 42A   42A  BING is standing amongst the group, looking blank again. ABI  isn’t in the lift.  INT. PEDAL CHAMBER 59A - DAY 5. 43   43  Now BING’s in the saddle. Pedalling slowly, staring blankly  at the low number on his screen.  6,828 metres.  Beside him, Dustin is pedalling hard, watching a  pornographic broadcast. Abi is sitting, fully clothed, on a  sofa. The camera swings around, handheld, gonzo style.  JUDGE WRAITH (O.S.)  And who are you?  ABI  I’m Abi.  WRAITH’s reaches in and caresses her cheek  JUDGE WRAITH (O.S.)  (laughing)  Like I didn’t know; met you on  Hot Shot. You were real  impressive.  Judge Wraith’s thumb circles Abi’s lips with faint  aggression.  JUDGE WRAITH (O.S.) (CONT’D)  You’re all clean and shit.  Dustin is staring hard at his screen, when the reflection  of the overweight cleaner spoils his view again. He spins  in his seat.  DUSTIN  Christ’s sake! I pay for this! I!  Pay! For! This! I pump my arse  off and you -- fuck you  He throws a handtowel at her; she walks away.  DUSTIN (CONT’D)  Yeah keep waddling, pigtits. Find  the horizon and fuck off over it.  Bing stares fixedly at his screen, when an advert comes on.  For the porn service.  BLACK MIRROR - 15 Million Merits - Blue Pages - 1/9/2011 - 38.",
      "characters": [],
      "action_text": "VOICEOVER  New! From Wraithb--  He shoos it, then shoos it again, angrily.  His metres drop by 1000 again to 5,828. He increases his  rate of pedalling.  He stares at his hand, where the ‘F&F’ mark is still  clearly visible. He stops pedalling.  A the top of BING’s screen, a small notification briefly  appears: DUSTIN LIKED A VIDEO: WRAITHBABES ABI KHAN SPECIAL  next to a small image of DUSTIN’S dopple’s face  Bing keeps looking at his hand.  INT. TINY ROOM - EVENING 5. 44   44  BING is in his room, lying on the bed. He reaches under the  mattress. Can’t find it. Jump cuts as he frantically tosses  the mattress, looking for the origami penguin or the  Cuppliance cup -- nothing there. He looks distraught. Then  has a thought and looks determined.  INT. 59A LAVATORY - EVENING 5 44A   44A  BING stomps into the communal lavatory area, where OLIVER is  cleaning. His bin bag is nearby. BING approaches.  BING  Where is it?  OLIVER  What?  BING snatches OLIVER’s bin bag, starts looking in it.  OLIVER (CONT’D)  Hey, that’s (my quota)  BING  Did you clean my room?  OLIVER  We clean all the rooms.  BING upends the bag -- a small load of rubbish spills out --  not much -- wrappers and the odd plastic bottle. OLIVER looks  worried -- he’ll get in trouble.  OLIVER (CONT’D)  We clean all of them.  BLACK MIRROR - 15 Million Merits - Blue Pages - 1/9/2011 - 39. BING starts rooting through it on the floor as OLIVER looks  on, pathetically. He finds the Cuppliance carton, but not the  penguin.  OLIVER (CONT’D)  It’s not my fault.  BING doesn’t answer - he’s sorting through the stuff on the  floor, separating the items. He finds the Cuppliance carton,  but not the penguin.  BING  Where’s the rest?  OLIVER  I don’t (know)-  Then BING finds the remains of the penguin -- it’s had orange  juice and something slimy spilt on in -- bin bag mush -- it’s  ruined.  As he stares at it, OLIVER starts picking the other items  back up and putting them in the bag. He goes to take the  Cuppliance cart",
      "dialogue_count": 0,
      "word_count": 2708
    },
    {
      "scene_number": 8,
      "slugline": "INT. STAGE - DAY 8. CONTINUOUS. 56C   56C  JUDGE HOPE  And what are you planning to do  for us?  BING  A sort of performance.  JUDGE HOPE  A sort of performance.  BING  Yes.  JUDGE CHARITY  A man of mystery.  The audience titters nervously.  BING  Mnn.  JUDGE HOPE  Well I suppose we’d better see it  then.  BING  Okay.  Bing signals offstage, and music starts up.  The music from the Wraithbabes video starts up.  Bing starts performing strange, jerky ‘dance’ movements, as  we saw him practicing earlier.  The judges look quite confused, but interested. Apart from  Judge Wraith, who couldn’t care less because there’s no  tits involved.  Bing’s performance appears to be segueing into some kind of  striptease -- some girls in the audience squeal. Judge  Charity starts clapping in time.  Now he starts removing his top. Judge Hope raises his  eyebrows in a slightly weary way, wondering when he should  jump in and put a stop to this.  Now the shirt’s off -- louder cheers. He windmills it  round, tosses it behind him like a stripper -- a loud cheer  for that -- then unveils the shard of perspex.  Judge Hope snaps to attention at that.  Judge Charity looks confused.  BLACK MIRROR - 15 Million Merits - Blue Pages - 1/9/2011 - 49.",
      "characters": [],
      "action_text": "Bing holds the shard to his own throat.  Backstage, the producer kills the music. A guard starts  walking on from the wings.  BING (CONT’D)  Stop. Stop there or I’ll do it.  (pushing shard against  neck)  This is a main artery. Keep  walking and you’ve killed me.  The guard hesitates; looks at Judge Hope. Judge Hope gives  him a nod. The guard backs down.  Quick cut to:  INT. SWIFT’S TINY ROOM - DAY 8. CONTINUOUS. 56D   56D  SWIFT is sitting on her bed, heart in mouth, watching the  live broadcast.  INT. STAGE - DAY 8. CONTINUOUS. 56E   56E  BING still has the shard at his throat.  BING  No-one stops me. Not till I’ve  said my piece. Then you can do  what you like.  Bing looks at Judge Hope.  JUDGE WRAITH  Oh just fucking kill yourself.  (to Bing)  Get any on me bro and I’ll kick you  back to life and cut your goddamn  head off.  JUDGE CHARITY  I think we should let him speak.  Judge Wraith looks at Judge Hope.  JUDGE WRAITH  Well, that kinda makes you the  decider doesn’t it?  Judge Hope ponders.  The crowd, getting rowdy now, starts settling into two  camps -- one half baying for Bing to cut his own throat,  the other demanding he should speak.  BLACK MIRROR - 15 Million Merits - Blue Pages - 1/9/2011 - 50. JUDGE HOPE  Let’s hear what he’s got to say.  Bing pauses.  JUDGE HOPE (CONT’D)  Well come on, you’ve got our  attention, as requested. So what  do you want to say?  Bing is staring, blinking into the light.  JUDGE HOPE (CONT’D)  Have you prepared a speech, is  that it?  (shouting)  Speak!  BING  I haven’t got a speech. I didn’t  plan words, I didn’t even try to.  I just knew I had to get here, to  stand here, now, and I knew I  wanted you to listen...  Judge Hope goes to open his mouth. Bing shuts him off--  BING (CONT’D)  (addressing Hope  directly)  -- to really listen, not just pull  a face like you’re listening, like  you do the rest of the time. A face  like you’re feeling instead of  processing. You pull a face and  poke it toward this stage and lah  di ",
      "dialogue_count": 0,
      "word_count": 1416
    },
    {
      "scene_number": 9,
      "slugline": "INT. SWIFT’S TINY ROOM - DAY 8. CONTINUOUS 56H   56H  But SWIFT is not.  INT. STAGE - DAY 8. CONTINUOUS. 56I   56I  The clapping and chanting reaches a crescendo. Bing looks  like he’s about to speak, when we abruptly cut to:  INT. PEDAL CHAMBER 59A - DAY 9. 57   57  One year later.  We see OLIVER is now a contestants in BOTHERGUTS, which is  being watched by DUSTIN. Oliver is being forcefed cake  (intercut with shots of the host laughing his arse off).   *  Dustin is chuckling, slurping a diet smoothie. He tosses it  over his shoulder where the female cleaner picks it up.  DUSTIN then flips channel and settles on what appears to be  ABI starring in some more porn.  A new rider sits in BING’s seat. On their screen, they’re   *  watching a BIG SHOT audition in which GLEE has finally had   *  her chance to perform. She’s hitting the final notes of ‘I   *  HAVE A DREAM’. Not very well. She pauses, having given it her   *  all, very nervous.   *  JUDGE HOPE thinks for a while before he delivers his verdict.   *  JUDGE HOPE   *  (on screen)   *  That was achingly terrible. You   *  don’t just sing badly, you   molest   *  the music in a manner I find   *  personally offensive. You have the   *  magnetism of a towel and an   *  inherent allergy to anything   *  approaching even basic talent.   *  Awful. I don’t even want to look at   *  you.   *  GLEE is destroyed. Utterly. CHarity chips in.   *  JUDGE CHARITY   *  Have to agree: sorry love but you   *  came across as fundamentally   *  unlikeable and quite worthless   *  really.   *  JUDGE HOPE   *  Wraith?   *  BLACK MIRROR - 15 Million Merits - Blue Pages - 1/9/2011 - 55.",
      "characters": [],
      "action_text": "JUDGE WRAITH   *  Does nothing for me. Fill that cunt   *  with honey and I still wouldn’t   *  fuck it.   *  JUDGE HOPE   *  Three nos. Bye bye.   *  GLEE is silent but utterly utterly devastated. Finally:   *  GLEE   *  You’re wrong! You’re all wrong! I’m   *  a good singer. I can sing. It’s my   *  destiny, I’m a good singer.   *  SECURITY come on and bundle her away while the audience jeer.   *  KAI is shopping. He’s buying a ‘BING SHARD’ for his dopple --  a shard of perspex his dopple can hold to its own throat.  Over this, we can hear Bing’s voice.  BING (O.S.)  15,000 new dopple wardrobe options  launched last week alone, which  effectively translates as 15,000  new ways to kill time in your cell  before you explore an afterlife  which doesn’t exist anyway. But  with any luck it’ll take your mind  off those saddlesores, eh?  We pan across to SWIFT’s bike.  She’s watching Bing on her screen. It’s a tight shot. He’s  sitting on the tiny bed in the cell we saw at the start,  hemmed in by the walls, holding the perspex shard to his  throat.  BING (CONT’D)  You know the only thing stopping  me slashing myself open right  now? I might not die right away.  (with dry humour:)  And before I went they’d find a way  to charge my twitching half-dead  cadaver 20,000 merits for swabbing  the walls clean.   *  BLACK MIRROR - 15 Million Merits - Blue Pages - 1/9/2011 - 55A. This makes KAI laugh -- he’s now watching the broadcast on  his screen too.  KAI  (snorting agreement)  Yeah.  SWIFT looks at him. She deselects BING’s programme, selects  the ROLLING ROAD instead and silently goes back to pedalling.  INT. LARGE APARTMENT - DAY 9. 58   58  We see a wider shot of the scene Bing is sitting in. The  tiny bed he’s seated on, in front of a small pencil-sized  camera, is part of a set in one corner of an apartment far  bigger and glossier than the one he had at the start.  BING  Anyway, till next week: hang on in  there. If you must. And you must.  Because what else are you go",
      "dialogue_count": 0,
      "word_count": 781
    }
  ]
}