{
  "slug": "black-sails-101-i-2014",
  "title": "black sails 101 i",
  "genre": "sci-fi",
  "format": "series",
  "scenes_count": 4,
  "characters_count": 1,
  "characters": [
    "GUTHRIE"
  ],
  "total_words": 12466,
  "total_dialogue": 1,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. MERCHANT SHIP - ARMORY - SAME  With the Sailor, winded, as he dodges another CUTLASS SWIPE.  SAILOR  Look, I get it.   Whatever you’ve  got there, it’s obviously very  valuable.  COOK  You can’t even imagine--  The Cook swings again, forcing the Sailor to duck.  SAILOR  Hey--   Let’s be reasonable.   What’s  say I don’t breathe a word of this  to anyone... Deal?  The Cook summons all his strength,   finally tackles the Sailor  to the ground.   The Sailor and the Cook grapple, the Cook’s  bulk giving him the advantage... Pinning the Sailor down...  COOK  It’s too late for that now...  THE COOK RAISES THE CUTLASS-- Off the Sailor’s panicked look--  INT. MERCHANT SHIP - QUARTERDECK BUNKER - SAME  Pirates and Sailors, in close quarters combat...  The Merchant Captain watches, stunned... His men fighting the  Pirates with swords, axes, fists...   Chaos...  The Captain fixes on one particular Pirate.   A GIANT of a  man.   Making quick work of defender after defender...   Coming  this way...   The Merchant Captain is paralyzed with fear...  The Giant nears...   Raises his cutlass...   And just as he’s  about to bring it down on the Captain’s head--  CLANG! Someone deflects the Giant’s sword into a bulkhead...  REVEAL THAT SOMEONE IS--  THE PIRATE CAPTAIN.   FLINT .   He and the Giant exchange a  contentious glare with each other.  FLINT  I believe we’ve made our point.  (to the Merchant Captain)  Haven’t we?  Off the Merchant Captain, more than ready to surrender...  Untitled Pirate Project - 2ND DRAFT - Steinberg/Levine   9/28/11   8.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 248
    },
    {
      "scene_number": 2,
      "slugline": "INT. MERCHANT SHIP - CORRIDOR - LATER  Below deck, the fight now over.   A few pirates search the  belly of the ship for cargo.   At their lead is an older  pirate, whom we’ll later meet as   GATES   (60s).   They reach a  locked door... The ARMORY.  A pirate with the AXE HACKS IT OPEN, to REVEAL--  THE SAILOR, staring innocently back at him.   And at the  Sailor’s feet, is THE COOK.   Face down.   Dead.   With the  CUTLASS STICKING UP THROUGH HIS BACK.  GATES  What happened to him?  SAILOR  He couldn’t handle the thought of  what you might do to him.  (then)  I, on the other hand, would very  much like to join your crew.  TIGHT ON THE SAILOR--  SAILOR (JOHN SILVER) (CONT’D)  My name is John Silver.   And I  happen to be a very good cook...  And off   JOHN SILVER , we DISSOLVE TO:  EXT. MERCHANT SHIP - DECK - LATER  The Merchant Captain has been tied to the mainmast.   Nearby,  his crew (save Silver) are herded together.   The GIANT we saw  slashing his way through the bunker approaches the crew.  They do their best not to cower...   But then, Giant speaks--  SINGLETON  You have nothing to fear from him  now.   We are your brothers.  On the Merchant Crew.   They weren’t expecting that...   The  Giant (whose name is SINGLETON), continues--  GIANT (SINGLETON)  Men who work for our own survival,  instead of thriving off the work of  others.   As are you...  At this, Singleton sees Gates and Silver emerging from below.  This next bit is as much for Gates’s ears as anyone’s...  Untitled Pirate Project - 2ND DRAFT - Steinberg/Levine   9/28/11   9.",
      "characters": [
        "GUTHRIE"
      ],
      "action_text": "SINGLETON  It’s the tyrant captain that is the  enemy of us all.   And when you  cease to fear the tyrant, he can’t  last for long...  Gates hears that.   Sees a CROWD OF PIRATES around Singleton,  staring back at him with hollow, angry stares. He then points  Silver towards   BILLY BONES   (20s), the ship’s First Mate.  GATES  This one wants to join.   Says he  can cook.  Billy nods, as Gates enters into--  INT. MERCHANT SHIP - QUARTERDECK CABIN - SAME  --where we find Flint, and   DUFRESNE   (20s, bookish).   Dufresne  sits, papers and ledgers spread all around.   Flint is reading  one of the books.   He doesn’t look up as Gates enters--  GATES  We made a full sweep of the lower  holds.   Twelve casks of palm oil.  Eight of sugar.   Some scattered  tobacco, maybe a few dozen pounds.  DUFRESNE  (beat)  That’s all?  Gates’s silence affirms.   Dufresne casts a concerned glance  in Flint’s direction, who isn’t paying attention...   Dufresne  then consults his notes, does a few quick calculations...  DUFRESNE (CONT’D)  Total tally...   400.   Maybe five if  we are lucky selling the tobacco.  Cameron’s arm is broken, and Duffy  was shot in the leg.   After injury  payments, we’ll net just under 8  pounds per man.  GATES  8 pounds...?  Flint glances up from his book.   Unconcerned.  GATES (CONT’D)  The men are not going to be  happy...  Untitled Pirate Project - 2ND DRAFT - Steinberg/Levine   9/28/11   10. FLINT  When are they ever?  GATES  When their end is a hell of a lot  richer than 8 pounds...  Flint smiles a bit.   Touché.  FLINT  Here, look...  Flint hands Gates the journal he’s been reading. As Gates  reads, Flint talks privately to him--  FLINT (CONT’D)  Captain’s log.   The whole story is  here.   Vazquez.   Port Royal.  (a small smile)  I told you this was the ship...  Gates reacts, but then flips the page in the journal back and  forth, as if looking for something--  GATES  Where’s the map?  FLINT  Someone must’ve torn it out.   Minor  obstacle, but we’re get",
      "dialogue_count": 1,
      "word_count": 8003
    },
    {
      "scene_number": 3,
      "slugline": "INT. CORRIDOR - CONTINUOUS  --but as he rounds the corner, he sees ahead--  THE REINFORCEMENTS.   A half dozen Marines, several of them  readying MUSKETS TO FIRE AT FLINT.  ON FLINT.   Just a moment’s hesitation, before he starts to  RUN RIGHT AT THE MARINES...   But he only gets a few steps  before--  BILLY CORRALS HIM, shoving him into a wall... And just before  the Marines are about to fire at us, BILLY HURLS A GAS LAMP--  The Corridor IGNITES IN FLAMES...   Flint watches Richard  hurried away, a wall of fire separating them...  Billy pulls Flint towards the back door...   And off Flint,  out of options...  EXT. HARBOUR ISLAND - NIGHT - MOMENTS LATER  Flint and Billy clear the grounds of the house, the beach  visible ahead.   But Flint stops.   Turns to see RICHARD, being  hauled away in the distance...  FLINT  No--  He starts to head that way, but Billy blocks him.  BILLY  Sir, it’s too late--  FLINT  I need that name--  BILLY  What difference does it make if  you’re dead?!  Flint is furious.   But can’t quite argue.   And off the sounds  of SOLDIERS yelling orders, getting closer, we SMASH TO:  EXT. OCEAN - MOMENTS LATER  Eerie SILENCE.   An oar breaks the water’s surface, as we PAN  UP to see Billy, rowing away from Harbour Island on a skiff.  CAMERA pans off him to reveal Flint, in the back, also  rowing, but glaring at Billy.   Not happy.   As they near an  OUTCROPPING of trees--  FLINT  Oars up.  Untitled Pirate Project - 2ND DRAFT - Steinberg/Levine   9/28/11   45.",
      "characters": [],
      "action_text": "Billy obeys, ducks low, as their momentum takes them out  past...  THE SCARBOROUGH... anchored in the harbour.   Startlingly  close.   Twice the size of the   Walrus.   So many fucking guns.  As their skiff floats silently past... even Flint can’t help  but gape.  And off the Scarborough, its lamps glittering, we CUT TO:  EXT. BEACH - NIGHT  MOSIAH’S OPEN, LIFELESS EYES.   Torchlight flickering in them.  WIDEN, as Gates, Guthrie, Scott and Logan arrive.   Dr. Howell  is inspecting Mosiah and Levi’s bodies.   Others from the  Walrus crew watch on, stunned.   The Jamaicans mourn.  Howell then draws Gates’s attention to the sand beside  Mosiah’s hand.   Some letters scrawled in it.   V-A-N. ..   The  blood from Mosiah’s wounds has run into the letters, filling  them red...  HOWELL  Goddamned butcher, Vane is...  GATES  He’s always been a butcher.   But  apparently he’s gone and gotten  clever, too.  Gates looks up, sees SINGLETON AMONG THE ONLOOKERS.   Gates  burns.   Singleton just watches on evenly.   Was that a hint of  a grin?   Singleton then turns, and walks off.   We then find--  GUTHRIE, as she storms off into the night alone.  GATES (CONT’D)  Ma’am--  But she just holds up a hand behind her.   Don’t follow...  Off Gates and Scott, watching her disappear into the night.  INT. WHOREHOUSE - NIGHT  The nastiest, most decadent corner of the inn, because it’s  where Vane puts his feet up.   All around, CREW MEMBERS  gamble, drink, get HANDJOBS.   Sometimes all at once.  Amid the debauchery, Rackham sits at a small DESK, writing in  on a strip of PARCHMENT.   Bonny watches over his shoulder.  BONNY  What is that?  Untitled Pirate Project - 2ND DRAFT - Steinberg/Levine   9/28/11   46. RACKHAM  Terms.   For the consortship of the  Walrus.   Singleton will run her,  but he’ll run her in our service.  He continues writing.   Bonny eyes the paper suspiciously.  BONNY  The Captain should give you that  ship.  RACKHAM  (beat; smiles...)  All in good time.  Suddenly, the roo",
      "dialogue_count": 0,
      "word_count": 3407
    },
    {
      "scene_number": 4,
      "slugline": "INT. FORT - SAME  A POV of Guthrie, looking down on her from above.   As her  hand goes up...  REVEAL SCOTT... Supervising a group of Guthrie’s SLAVES,  acting as a makeshift gun crew.   Off her signal--  SCOTT  Fire again.  The slaves light the flint, and--  KABOOM... MORE CANNONFIRE riddles the Ranger... SPLINTERING  Vane’s rigging and strewing the deck with falling debris.  RACKHAM  She’ll sink us if we let her...  As the crew races to get the ship going, we stay on Vane,  refusing to duck or move.   As debris falls around him, he  glares down at Guthrie with violent hatred.  On the beach, she looks back.   Shoots him the middle finger.  MOMENTS LATER... The Ranger retreats out of the bay.  ON FLINT.   He turns, trades a look with Gates, as we CUT TO:  EXT. NASSAU HARBOR - BEACH - MOMENTS LATER  A HARBOR BARGE arrives, carrying Flint.   He disembarks, walks  right up to a stunned Guthrie, then turns to follow her look  out toward Vane’s retreating ship...  GUTHRIE  What the fuck did I just do?  Off Flint, has to smile--  INT. WALRUS - LATER  Billy sits alone, still in shock over what happened.  GATES (O.S.)  It was blank, wasn’t it?  REVEAL Gates, in the doorway behind him.   Billy just stares  at him for a beat.   Speechless.  Having got his answer, Gates turns to go--  BILLY  How did he know I’d go along?  Untitled Pirate Project - 2ND DRAFT - Steinberg/Levine   9/28/11   59.",
      "characters": [],
      "action_text": "Gates stops, turns back.   Thinks about it.  GATES  What makes you think he knew?  Off Billy, mind blown--  INT. GUTHRIE’S OFFICE - LATER  With Flint, Guthrie and Scott.  FLINT  Your father’s been arrested.  On Guthrie.   Stunned.   She shares a shocked look with Scott.  GUTHRIE  Arrested?   By who?  FLINT  Captain Hume, of the HMS  Scarborough.  Guthrie’s mind races a mile a minute.   Flint continues--  FLINT (CONT’D)  I need your assurance you can keep  this operation going in his  absence.   We sail soon for our next  prize and my needs are substantial.  Guthrie snaps back to reality.   Your needs?  FLINT (CONT’D)  I’ll be outfitting more than one  ship, which will exhaust your  powder and grain stores, so you’ll  want to send for more right away.  And to answer your question... no,  I can’t pay for any of it.  (then)  Think of it as a loan.  Guthrie takes a beat.   The nerve on this guy.  GUTHRIE  You know what?   Fuck your needs.   I  need something from you first--  FLINT  The Scarborough?  Guthrie reacts.   He knows.   Flint studies her for a beat--  Untitled Pirate Project - 2ND DRAFT - Steinberg/Levine   9/28/11   60. FLINT (CONT’D)  Let’s assume for a moment that I  could chase her off.   How long  before His Majesty, feeling  bruised, decides to sends another  ship? Or two.   Or three.   A few  months, if we’re lucky.   And when  they arrived, we’d be sitting  ducks.  GUTHRIE  I know.  FLINT  So what would be the point?  GUTHRIE  (beat)  It’d be a few months.  On Flint.   A beat.   Until a smile grows on his face.  Something telling him he’s found a kindred spirit...  FLINT  You’re going to help me--  GUTHRIE  Wait just a minute--  FLINT  I’m not leaving this place.  GUTHRIE  What?  FLINT  I’m not leaving New Providence.  I’m staying here.   For good.  (then)  The fort is the first priority.  Right now we have 6 guns.   We’ll  need a hundred to defend that bay  and mean it.   Then we build a  fleet.   Frigates, with men trained  to sail them.   Once that’",
      "dialogue_count": 0,
      "word_count": 808
    }
  ]
}