{
  "slug": "blindspotting-2018",
  "title": "blindspotting",
  "genre": "action",
  "format": "film",
  "scenes_count": 13,
  "characters_count": 0,
  "characters": [],
  "total_words": 21224,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. STREET - NIGHT 1   1  SLOW-MOTION ABSTRACT IMAGES  We’re outside. It’s night. And a MAN is on fire. Scratch that. TWO MEN are on fire. Arms flailing. Wild. Swinging. We see pieces of a BROKEN GLASS BOWL flying in the air... FRUIT CHUNKS bouncing off a sidewalk... We go WIDE to REVEAL... ...one of the men is COLLIN. Black (35), in a long sleeve shirt. Hair twisted. His arm is a FIERY BLAZE. He’s PUMMELING someone on the ground, who is also on fire. Behind them, a BLURRY FIGURE shouts: BLURRY FIGURE GET HIM! These SURREAL IMAGES may be hard to grasp at the moment, but be patient, they will make sense in time. SMASH CUT TO: INT. COURTROOM - DAY 2   2  The incident we just saw has led to Collin being in court. We see Collin in a MEDIUM SHOT. He is center frame. The JUDGE is stern, but going through the motions. We don’t ever see him during this scene. JUDGE (O.S.)  Now that you have completed your two month sentence at Alameda County Jail Santa Rita, in accordance with the remainder of your sentence...  The Judge wonders if Collin is even paying attention.",
      "characters": [],
      "action_text": "JUDGE (O.S.) (CONT’D)  Mr. Turner? In accordance with the remainder of your sentence, you’ll proceed to a halfway house facility in West Oakland for your one year probation period. You will honor the 11:00 PM curfew, maintain employment, carry out assigned chores in the home, have zero altercations with law enforcement, and not travel outside of Alameda County under any circumstances. Any infraction results in case review.  (beat)  Give me a verbal confirmation that you have heard and understood these parameters.  Collin looks into camera. He SIGHS. COLLIN Yeah. CUT TO: BLACK  SUPER: 11 MONTHS AND 26 DAYS LATER   -   4 DAYS LEFT OF PROBATION  INT. DEZ’S CAR - NIGHT 3   3  The car is parked. Collin’s in the backseat, sitting in the middle. DEZ is smoking weed in the driver’s seat. MILES is sitting shotgun. Dez is black. Miles is white. Miles is Collin’s best friend. All three have fast food HAMBURGERS from KWIK WAY. Miles takes his GOLD GRILL out of his mouth, to take a bite of the burger. MILES (mouthful)  It doesn’t taste the same.  Collin holds up one of his fries, inspecting it.  2. COLLIN Oh, they’re wedges now. (takes a bite) I’m into that. MILES The bun’s different! Dez squirts some KETCHUP on his fries. DEZ What is Umami Ketchup? Miles gives up on the burger and decides to eat the fries, but even they seem to be disappointing him. MILES This doesn’t even look like a fry! COLLIN That’s because it’s a wedge! DEZ OK, real spit, this isn’t the old Kwik Way at all. COLLIN I like the wedges. MILES (to Collin) You would! Dez gets a text. Then they all get it. They all pull out their phones and look. DEZ Did yal just get Nak’s text about her work party on Friday. COLLIN AND MILES Yup. DEZ Yal tryin to go? COLLIN AND MILES Nope. Miles drops a fry. He reaches down to grab it, and notices... ...a GUN nestled between the seats. Miles picks it up. Super nonchalant.  3. MILES Oh, what is this, bruh? Little yistol? Collin sees the gun.   This isn’t good . COLLIN Uh, nope. C",
      "dialogue_count": 0,
      "word_count": 1630
    },
    {
      "scene_number": 2,
      "slugline": "INT. EZ-LIFT MOVING TRUCK - CONTINUOUS 8   8  Collin puts the truck in park. Miles wraps up the conversation and starts to get out. They slap hands. MILES We really need cars, eventually. COLLIN Ey. If you have that gun on you, don’t tell me.   Plausible deniability . Miles pulls out the gun. MILES You mean THIS gun? HA! COLLIN Yes, I don’t wanna be caught concealing a deadly white person concealing a deadly weapon. MILES THIS GUN!? RIGHT HERE??!! Miles waves the gun out the window. No one’s around but it’s still reckless. Collin reaches over and opens Miles’s door. He begins pushing Miles out of the truck. COLLIN Alright, get the fuck out. INT. EZ-LIFT MOVING TRUCK - LATER 9   9  Collin takes a bite of his Kwik Way burger, and hates it. He pulls up to a red light, and looks at the clock. It’s 11:03pm. Uh oh. Collin is super anxious. He taps the wheel... ...staring at the RED LIGHT. COLLIN (mumbling)  Come on... Come on... Come on...  10.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 174
    },
    {
      "scene_number": 3,
      "slugline": "EXT. OAKLAND STREET - SAME TIME 10   10  We are following behind a BLACK MAN running frantically, we hear heavy breathing and arms running wildly. The street looks similar to the area Collin is in. INT. EZ-LIFT MOVING TRUCK - SAME TIME 11   11  Collin is humming along to the song, which feels oddly happy and poppy for him. He looks around and contemplates running the red light. EXT. OAKLAND STREET - SAME TIME 12   12  The black man is running towards an intersection. We hear someone behind him yell... AUTHORITATIVE VOICE STOP! STOP! He glances back, we barely get a look at his face. He bolts towards the intersection. It is frantic and shaky. INT. EZ-LIFT MOVING TRUCK - SAME TIME 13   13  The light is still RED. Collin takes another glance at the clock, and decides to gun it through the light. As he’s about to take off-- There’s a COMMOTION down the street, and suddenly-- Collin’s POV: A BLACK MAN, about Collin’s age, runs through the crosswalk, and as he passes Collin’s truck... SLOW-MOTION:   Collin and the man lock eyes.  One thing is very clear... The man is scared and running for his life. ...the man SLAMS his hands on the hood to brace himself, and bolts down the street in the direction Collin came from. Collin sticks his head out the window to see why the man is running, and then suddenly... ...a uniformed COP appears on foot, and... COP STOP!  11.",
      "characters": [],
      "action_text": "The cop draws his weapon--  BLACK MAN Don’t shoo--  --and opens fire. One LOUD GUN SHOT rings out, setting off a CAR ALARM across the street.  Collin falls back into the truck, taking cover.  He watches the rest of the scene play out in the side mirror.  The cop fires THREE more times.  It’s raw and brutal. The man falls to the ground. We hear other cop cars on the way. SIRENS. Collin is still looking at the mirror when-- --he locks eyes with the COP! It’s extremely tense. The cop is in shock. Collin is horrified. The cop quickly looks down and away. Two other cop cars arrive. Red and blue lights flood the scene, as we hear other cars approach and screech to a stop. The CAR ALARM is still ringing loudly over all this. A SECOND COP suddenly appears at the EZ-LIFT truck window-- SECOND COP MOVE! Collin doesn’t need to be told twice. He puts his foot on the gas and speeds off into the night. EXT. STREET NEAR COLLIN’S HALFWAY HOUSE - NIGHT 14   14  Collin locks the truck and walks down the street. Still stunned and in horror. He approaches the front door of a TWO STORY VICTORIAN HOUSE. INT. COLLIN’S HALFWAY HOUSE - NIGHT 15   15  The lights are out. Collin steps inside, and walks down the hall. There is a small light over a chore-board. The top of it reads SECOND START HALFWAY HOUSE, with a grid of names and chores. We focus on it as he passes, still in pure shock.  12.",
      "dialogue_count": 0,
      "word_count": 508
    },
    {
      "scene_number": 4,
      "slugline": "INT. COLLIN’S HALFWAY HOUSE - COLLIN'S ROOM - MOMENTS LATER 16   16  Collin closes his door and locks it. His room is not much bigger than a prison cell. The space between the bed and the wall is only a few feet. He sits on the edge of the bed and stares blankly. KNOCK. KNOCK. Someone aggressively KNOCKS on the door. Collin jumps but doesn’t blink or move. JAMES, the halfway house manager who we will meet later, yells through the door. JAMES (O.S.)  11:00 PM is a required curfew, Mr. Turner!  (beat)  It is 11:09! And you have bathroom duty this week!  (beat)  Is that understood? Verbal confirmation, please!  Collin is completely tuned out and staring blankly. The faint sound of an AGGRESSIVE ALARM CLOCK can be heard. At the last moment, we see him turn his gaze to the door and snap out of it just enough to prepare to answer. SMASH CUT TO: BLACK  SUPER: TWO DAYS LEFT OF PROBATION  We hear the sounds of the final moments of the shooting. Feet running, “STOP” yelled by the cop, and then a GUNSHOT finally startles Collin awake-- INT. COLLIN’S HALFWAY HOUSE - COLLIN’S ROOM - MORNING 17   17  We are close on Collin’s eyes jolting open. The sound of the alarm clock gets louder. He turns it off and sits up, distraught and unrested. Collin looks over at the map of the east bay on his wall. Alameda county is outlined with a marker, showing where he can and can’t go. On his bedside table are travel books full of bookmarks. Collin grabs his hoop shoes and headphones.  13.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 272
    },
    {
      "scene_number": 5,
      "slugline": "EXT. STREETS OF OAKLAND - DAY 18   18  Collin FREESTYLES to himself as he jogs up from Telegraph Ave. over to Piedmont Ave. He rounds the corner where we reveal... THE KONA CLUB We’ll see more of this place later. Collin takes note of the doorway. As he passes, there’s a LOUD BANG. Collin flinches and spins around. He sees nothing. It must have been a car backfiring. He is relieved. Not a gunshot. He keeps running until he reaches... EXT. THE MOUNTAINVIEW CEMETERY - CONTINUOUS 19   19  Collin runs through the cemetery. He looks at the headstones. He’s shook, remembering what he saw last night. INT. MILES’S APARTMENT - LIVING ROOM - DAY 20   20  SEAN (3, black) runs through the apartment. It’s somewhat shadowy despite the amount of sunlight through the windows. Kids toys pepper the floor. ASHLEY (29, black) is barefoot, in shorts and a t-shirt. Her hair is still wet after a shower. Miles grabs Sean to put on his jacket. Miles is in jeans and shirtless, he is covered in small, scattered tattoos. Collin is standing in their kitchen. COLLIN I saw the cops kill a nigga last night... MILES (covering Sean’s ears) What do you mean you   saw   it? COLLIN Over by Broadway and 51st. He ran by the truck, then the cops showed up and shot him. ASHLEY Who got shot? COLLIN I don’t know.  14.",
      "characters": [],
      "action_text": "MILES But he’s definitely dead though? COLLIN Yeah, they shot him like four times. Hearing this, Miles and Ashley groan. MILES I mean he coulda lived. It ain’t like they shot him 14 times like that Milwaukee dude. What’s his name? ASHLEY Miles, not helpful. Are you okay? Collin SHRUGS. COLLIN Yeah, I’m good. Sean starts punching Miles like a boxer over and over again. MILES Ey, ok ok lil’ man, I get it. It wasn’t about you for a moment, you ain’t gotta KO me! Show Collin them hands, boy! Miles puts his muscles up like Popeye. MILES (CONT’D) I’m a tough guy! SEAN  I’m tuff guy!  MILES I’m the toughest mothafucka in all- ASHLEY Miles! Miles points at Collin, and tells Sean to... MILES Get him! What the hell was dude’s name... Sean runs over and starts trying to box with Collin. Collin immediately goes into play mode with Sean. They pretend box, and run into the living room together.  15. Miles and Ashley have a quiet conversation in the kitchen: ASHLEY No, it has to be Centro Vida preschool in Berkeley! MILES It’s 200 more per fuckin week! ASHLEY That’s because it’s the only bi- lingual pre school that I can get to on the train. MILES Why he gotta be bi-lingual? He already bi-racial! Ashley looks at him not entertained and irritated. MILES (CONT’D) Ok! I got it, ok, he will go to casa vida, then he can translate for us when   the Mexicans   take California back. ASHLEY Use that mouthpiece, get us fancy pre-school money. Miles and Ashley realize they’re alone for a brief moment... MILES Oh goodness - My hands are QUITE cold this morning’ and I need them for moving things. So I’m just gonna warm them up... on... your... booty. Miles puts his hands into Ashley’s shorts and down her underwear like he is warming his hands on a fire. He kisses her face while he does it. ASHLEY HA! Excuse you! Ah, COLD! Your hands are so cold! His hands land on her butt, and he squeezes with relief. MILES Much better. Thank you kindly. Bye. They give one big SMOOCH and Miles reaches for his ",
      "dialogue_count": 0,
      "word_count": 601
    },
    {
      "scene_number": 6,
      "slugline": "EXT. RIVER NILE MARKET AND LIQUOR - DAY 21   21  Collin and Miles dap up a few regulars standing outside the liquor store, and then walk inside. INT. RIVER NILE MARKET AND LIQUOR - DAY 22   22  The CLERK rings up a customer as Collin and Miles walk in. Miles notices the TV on behind the counter. It’s the local news covering the police shooting from the night before. ON SCREEN:  “RECENTLY RELEASED FELON DIES IN STANDOFF WITH POLICE”  MILES This what you saw? No shit. Oh yeah, he’s definitely dead. (beat as he listens) You see this cop? Collin looks up to see the Cop’s face on the news. We go in close up to hear-- NEWSCASTER The officer involved has been put on leave while details of the shooting are reviewed, which has become standard when... Collin stares at the image of the cop on the screen. COLLIN Yeah. I saw him. MILES (reference the cop photo) Why he wear his hat so low, ha! ...This cop see you? COLLIN Yeah. The Clerk finishes ringing up the customer in front of them. MILES (to Clerk) Ey, bro. You got my square. (to Collin) --and then you just left? Miles pays the Clerk a dollar for a single cigarette.  17.",
      "characters": [],
      "action_text": "COLLIN It was after 11, you know James always has something to say. MILES They didn’t wanna talk to you? You not gonna be a witness? COLLIN Hello, police? I want to report a murder you did. (beat) I was there after curfew. (beat) Yes, I’m on probation. Yeah. Convicted felon. (beat) Back to prison? Sure, tomorrow is good for me. Miles notices a display case full of hand-bottled healthy “GREEN” JUICES. They look out of place in a liquor store full of junk food and cheap booze. MILES What the hell is this green shit? Bro! Miles holds up the green juice. CLERK It’s a local artisan protein something or other. Good for you, help you live longer. Collin grabs one. COLLIN How much? CLERK Six dollars. COLLIN AND MILES WHAT? MILES Is it the blood of Jesus?? What the hell in this that it’s six dollars? COLLIN Lemme get one. Miles looks at Collin.  18. MILES WHAT? INT. EZ-LIFT MOVING TRUCK - DAY 23   23  They’re on the way to work. Music is blasting. Collin is driving and FREESTYLE RAPS about what they see. Outside we see a montage of gentrification in full effect... EXT. STREET - DAY 24   24  Young women walk dogs through groups of Black men. EXT. STREET - DAY 25   25  GRAND OPENING signs on a remodeled cafe. EXT. STREET - DAY 26   26  A street sign spinner almost hits an affluent-looking older couple. EXT. STREET - DAY 27   27  An Asian man in a button up waits for an Uber car next to a Black man in a hoodie standing with his Pit Bull. END MONTAGE. INT. EZ-LIFT OFFICE - DAY 28   28  Collin and Miles enter a small shop. Just a front desk and a door leading to the back locker room for employees. There’s SOOTHING MUSIC playing. Miles and Collin pick up their assignments for the day from... VALERIE GUTIERREZ (27), a Filipino woman wearing workout clothes. She’s pretty. Clearly built tough. Tattoo on her shoulder. Tight ponytail, hair-sprayed down. She is burning incense in the lobby and reading a textbook of some kind. VAL Good morning. MILES Namaste, Val. Your aura is really tra",
      "dialogue_count": 0,
      "word_count": 4994
    },
    {
      "scene_number": 7,
      "slugline": "INT. COLLIN’S MOTHER’S HOUSE - NIGHT - LATER 49   49  Collin walks Val to the door. Val pulls her keys out of her purse and begins the process of a very awkward goodbye. VAL I got a complaint today that one of our trucks disrupted a dance class - they said some black guy with dreads pushed someone. COLLIN That’s bullshit, a guy put his hands on me and I-- Val begins to shake her head. VAL It’s all in your control, Collin. Take some responsibility for-- COLLIN I didn’t deny it I just said that someone ELSE put... Val shrugs and looks away. She doesn’t want to have this conversation. VAL I know you’re trying.   At least you don’t wear that fucking grill anymore. (looking at Collin’s hair) Now you just need to cut this hair off and - COLLIN Heyyyy...this is me though VAL “Not the haaiirrr.” It gets quiet. Collin, trying to help her out of the discomfort, puts out his arms for a hug. Val hesitates for a moment, then goes in for a two arm hug. Val closes her eyes. Collin re-adjusts, SQUEEZING tighter. She taps his back. Time for the hug to end. When they separate, Val’s wiping a tear away from her eye. VAL (CONT’D) I...This is just why I don’t wanna--  43.",
      "characters": [],
      "action_text": "Suddenly, Collin’s Mom interrupts, YELLING from the kitchen: NANCY (O.S.) COLLIN, IT’S 10:45 BABE, YOU NEED TO GO, NOW! SORRY TO INTERRUPT, BUT... VAL Yeah. (yells) THANK YOU, NANCY! GOODNIGHT! COLLIN Okay... Thanks again. VAL Yeah. There’s a lot unsaid between these two. INT. EZ-LIFT MOVING TRUCK - NIGHT 50   50  Collin drives the truck by himself. He arrives at... ...the RED LIGHT. The scene of the crime. Collin stops the truck. Waiting for a green. He looks down. A SMALL SHRINE where the man was murdered. Some CHALK MESSAGES are written near it. A group of 30-SOMETHING TRANSPLANTS walk over it casually. The light turns GREEN. Collin drives away. INT. MILES’S APARTMENT - NIGHT - LATER 51   51  Ashley and Miles are watching the news. Sean’s on Ashley’s lap as she drinks a bottle of GREEN JUICE and reads the pamphlet from Collin’s mom. ANGLE ON: THE PAMPHLET. “THE TALK.” It’s got a picture of police on the front, and a young black teen. It’s a guide for talking to your kids about what they should say and do if they run into the police. On the inside, is a picture of someone with their hands up, with a voice bubble that says “Don’t shoot!” “I’m unarmed!” And other proclamations. Sean is sipping the Green juice, watching the TV.  44. MILES Please tell me you aren’t feeding my son that now. ASHLEY Lemon. Carrots. Ginger. Cucumber. Apple. Celery. Kale. MILES Two years ago “kale” didn’t even exist. Now it’s the goddamn savior of humanity. On the screen, we see the news report of the shooting Collin saw. They flash the official police photo of the cop and a mugshot of the victim. MILES (CONT’D) Oh, the cop gets his work photo? Use bro’s work photo! ASHLEY I’m always baffled with how, on your diet, you have any energy at all, let alone enough to move things all day. At least with Collin, he’s running and eating better. MILES He doesn’t run, and he’s just eating like that to prove something to Val cuz she drinks shit like that. ASHLEY Why?   SHE   should be proving somethin",
      "dialogue_count": 0,
      "word_count": 1777
    },
    {
      "scene_number": 8,
      "slugline": "EXT. RIVER NILE MARKET AND LIQUOR - DAY 59   59  Collin and Miles walk towards the store. Collin stops once he notices a giant poster on the side of the store. A few other guys are out front, and they dap Collin and Miles. Collin stops to look at a POLICE RECRUITMENT poster. Miles keeps walking into the store. After a moment, Miles walks back outside, realizing he lost Collin. Miles reads the poster too. In bold letters it says:  “It’s YOU we want!”  A black kid is next to the giant text on the poster, wearing a shirt that reads:  “Ready to show courage”  MILES “It’s YOU!” COLLIN Why did they pick THAT shirt? Miles and Collin walk into the store. INT. RIVER NILE MARKET AND LIQUOR - DAY 60   60  MILES Ash says OPD is payin 80k STARTING SALARY for new cops. Fucked up part is they don’t hire people FROM Oakland. So the cat who pulls you over actually lives in, like, Cupertino. COLLIN Why not just live in Oakland? MILES Uh, probably because they’re scared if someone knew where they lived, they’d come shoot them. (to Clerk) Lemme get my square, OG Collin grabs a Green Juice from the shelf. Miles watches him reach for it and sighs loudly. COLLIN Can I better myself, nigga? Can I show courage?  51.",
      "characters": [],
      "action_text": "Collin begins to chug some of the juice. MILES You’re gonna wake up one day listening to vinyl, with a wooden tie, suspenders, and a gluten allergy. Counting calories and riding a Vespa! To the Whole Foods! CLERK Hey, you pay first! Collin lands six dollars on the counter. COLLIN They actually. Have great. Produce. Miles shakes his head, pulls his square from behind his ear and lights his cigarette inside the liquor store, angrily. MILES I NEED THIS NOW. INT. EZ-LIFT OFFICE - MORNING 61   61  Collin and Miles enter. They approach Val. VAL Happy sunrise. MILES Val, indeed the sunrise IS a blessing on this day. My soul is as moved by that as you are moved by an elliptical. VAL (to Collin) Does he think of these on the way here? Miles b-lines for the locker room. Val and Collin have a moment and try to keep it light. VAL (CONT’D) Hi. Oh, those braids look good. Who did those? COLLIN Oh, these? Yeah it just kinda does this when I wash it now. Must be all this green juice I’m drinking.  52. Collin takes a sip of his juice in front of Val. VAL Mmmmhmm. I know you hate it, but it’s so good for you. COLLIN I don’t hate it, I don’t even notice it. It’s just part of who I am now. Val hands him his clipboard. INT. EZ-LIFT LOCKER ROOM - DAY 62   62  The boys are all pulling their jumpers over their clothes, switching shirts, etc. Miles, Collin, Tel, and a few others are all in there changing. Yorkie walks in wearing a San Francisco 49ers jacket. When Collin and Miles see it, they jump all over him. COLLIN Oh, absolutely not. Take that off! YORKIE Take what off? MILES Get that. Niner jacket. Out. YORKIE It’s the bay. LITERALLY THE WHOLE LOCKER ROOM It’s the city. MILES This the town! Raider nation only, take it off! YORKIE The Raiders ain’t even from here, they from LA. COLLIN Wrong! They were here, they WENT to LA, they came back. YORKIE The 49ers never left!  53. MILES The Niners are non-negotiable Yorkie, that jacket has to GO. YORKIE Tel likes the Niners! They all spin aroun",
      "dialogue_count": 0,
      "word_count": 3984
    },
    {
      "scene_number": 9,
      "slugline": "INT. EZ-LIFT OFFICE - NIGHT 77   77  VAL If you stuck around a little longer, you would have seen his white boy on the stool run over and they both stomp this drunk burnt kid out, beat him til he’s unconscious, yelling “Welcome to Oakland!” Rin and Tin realize this is their time to leave. RIN I seen dude the other day. His face is all weird shaped still. (beat) Well, we gotta go. COLLIN This was fun. They leave. Collin turns back to Val at the counter. VAL “His. Face. Is. All. Weird. Shaped.” COLLIN It was already like that. VAL You are ‘bout to get a restart. You’ve got to get away from Miles. COLLIN Don’t. Okay? He’s my best friend. VAL Is he though? I get that you grew up together, but he’s gonna get you fuckin’ killed. COLLIN Miles has had my back since we were like 11, and when I went to jail HE came and visited me all the time-- VAL Yeah, out of guilt, for pushing you into a fight and then not going to jail with you! What if that guy had had a gun? Or if Miles’s dumbass had had a gun?  71.  (MORE)",
      "characters": [],
      "action_text": "Or if the cops had shown up while you were stomping that white boy? You think they’d have shot Miles? Collin’s had enough. She took it too far. COLLIN Good night, Val. VAL Collin, I’m trying to-- COLLIN Yeah, I get it. Collin walks out the door. INT. MILES’S APARTMENT - KITCHEN - NIGHT 78   78  Ashley is finishing up cooking. The table is set, and she is stirring, sizzling, baking. Miles is in there counting out his money. INT. MILES’S APARTMENT - SEAN’S ROOM - NIGHT 79   79  Collin and Sean are playing with a TRAIN SET, pushing trains along the track, when Collin looks up at... SEAN’S BED FRAME Collin pauses. Looking intently at the frame... Sean PUNCHES Collin to get his attention. COLLIN I built these bed pieces. Well, not these ones, but like this. SEAN You don’t make beds! COLLIN I don’t, but I did for a little while. It was like a temp job... SEAN Where do you make beds? COLLIN In... jail. SEAN Why were you in jail?  72.  VAL (CONT'D) COLLIN Ummm... For being a tough guy. SEAN I made this train in class. Collin LAUGHS. Moment is broken. ASHLEY (O.S.) Food time! INT. MILES’S APARTMENT - KITCHEN - NIGHT 80   80  Dirty dishes are all that’s left of dinner. Miles has some hamburger left on his plate. Collin and Sean are on the couch eating carrots together, watching TV. Miles is rolling a joint. He watches Sean eat carrots. MILES Sean, try this hamburger. ASHLEY He likes his carrots! MILES He doesn’t know his options! ASHLEY Baby do you want carrots or hamburger? Miles and Collin each hold out some food for Sean. MILES Hamburger! COLLIN Carrots! MILES Hamburger! COLLIN Carrots! Sean goes for the napkin and puts it in his mouth. MILES & ASHLEY Napkin. ASHLEY Oy. Collin, tonight’s the last night! No more piss testing!  73.  (MORE) No more curfew! Are you going to smoke with your friend here? COLLIN I actually think I’m cool off the weed now. Miles looks up in shock, and throws down the joint he was rolling. MILES It’s like... I see that it’s him, and I hear that it’",
      "dialogue_count": 0,
      "word_count": 1104
    },
    {
      "scene_number": 10,
      "slugline": "EXT. MILES’S APARTMENT - NIGHT 83   83  Miles takes a swig of his flask, POWER WALKING fast towards the corner. Collin is walking beside him, both are a bit irritated with each other. Collin hands Miles back his gun. COLLIN Just get rid of it! Miles snatches back his gun, looks around, then stuffs it in his waistline. MILES You couldn’t just say it was yours for two seconds? COLLIN No, it’s not my gun! I told you I didn’t want nothin’ to do with that thing. MILES It doesn’t make it yours. It just makes it NOT mine! COLLIN I’m not gonna be the one who brought a gun around a three-year- old. MILES Now I'm the dad who brought a gun around his kid?! COLLIN Well, ain’t that what happened? MILES I know what happened! Miles and Collin both get texts from NAK. It’s about the party. Their screens read, “Yal gotta come to my work party tonight.” MILES (CONT’D) Fuck it. COLLIN Fuck it, what fuck it? Fuck what? MILES We goin to that party.  77.",
      "characters": [],
      "action_text": "COLLIN The hell we are. MILES We can’t go back in there, what - you wanna spend your first night with no curfew at the halfway house? COLLIN I am not goin to no fuckin party where no bullshit can happen. MILES Bullshit happens out HERE. Nak’s work party is squarest as square places get. It’s techies and artisan beer. I’m calling an Uber. Collin looks around for another option. Sees a cop car parked across the street at the Laundromat. COLLIN Fine, but I’m not bein’ around no hot shit tonight. MILES It’s here already. Just as Miles finishes his sentence, Dez pulls up in his scraper car with the Uber sticker in the window. DEZ My niggaz! Your Uber is arriving! MILES DEZ! What are the odds, of this. COLLIN Of-fucking-course we did. I/E. NEW CAR - NIGHT 84   84  Dez is driving, with Miles sitting shotgun and Collin in the backseat. Music blasts OBNOXIOUSLY LOUD. Subwoofers attracting a lot of attention. They swerve through Oakland. Miles dancing in his chair, leaning on the steering wheel, smoking a cigarette. They drive past a COP, Collin sees it. Miles yells out the window, being ignorant.  78. COLLIN Bruh, sit the fuck down! He pulls Miles back into the car. MILES Just cuz YOU don’t wanna celebrate, fine I’ll celebrate for you. COLLIN Don't yell out the window like a fuckboy. MILES Oh, I'm a fuckboy tonight. Better a fuckboy than a snitch, bruh. COLLIN Fuckboy. MILES Snitchin’ ass Collin. COLLIN Fuck. Boy. MILES Snitch. DEZ As your driver, I’ma just keep it professional and stay out of this. INT. WEST OAKLAND HOUSE PARTY - NIGHT 85   85  Collin and Miles head inside the party and look for their friends. It’s a hipster party. Plastic cups and drinking games, bongs and jello shots. As they walk up the stairs they run into SID, white and a very enthusiastic party host. SID That shirt is fuckin EPIC. “Kill a Hipster, Save Your Hood.” I love it. He pats Miles on the chest, and keeps walking. COLLIN There’s Nak. MILES ...I’m getting a drink.  79. Miles leaves Collin and he",
      "dialogue_count": 0,
      "word_count": 2404
    },
    {
      "scene_number": 11,
      "slugline": "EXT. STREET - NIGHT 91   91  Miles walks home alone, bleeding, looking around. He walks down a main street. No one bothers him. EXT. STREET - NIGHT 92   92  Collin walks home alone, nervous, looking over his shoulder constantly. Scanning the streets. He decides to jog. INT. MILES’S APARTMENT - NIGHT 93   93  Miles walks in, not expecting anyone to be awake. Ashley is sitting at the table. Miles is still covered in blood. She starts to scold him but then notices how he looks. ASHLEY You better not have that fuckin gun on you. Cuz if-- Miles, what the hell?! MILES I got into a fight. Think I broke my hand. Ashley’s expression changes from furious to shock to deep disappointment and dismay. ASHLEY What the fuck were you fighting about? MILES Just... (...realizing) Nothing important. INT. MILES’S APARTMENT - LATER 94   94  Miles is holding his hand in the freezer. Ashley comes in with an ACE BANDAGE and begins wrapping his palm. He is sitting in a chair and she kneels next to him. She is doing it with anger, and too fast. Ashley is upset, and biting her tongue. Ashley finishes tying the bandage and YANKS hard. MILES Ow!  89.",
      "characters": [],
      "action_text": "ASHLEY Shut up. She yanks again. MILES OW! ASHLEY Shut up! Miles looks at her hopelessly. MILES Yes, I got into a fight! You wanna be mad about that? ASHLEY Yes! But, no! You are pickin the wrong fights. Alright... THIS... (motions to the apartment) ...is already hard. THIS is work. HE is WORK, and I don’t feel like you’re HERE with me right now. MILES I didn’t buy the gun on some TOUGH shit, I was tryin’ to-- Ashley’s tone turns a bit more solution driven, but still desperate. ASHLEY I know why you thought you needed to get a gun-- MILES I shoulda been more careful with where I had it. Ashley SMACKS him upside the head. ASHLEY No, stupid! You shouldn’t have made a decision to buy a gun without me! Or goin’ out and brawlin’ with niggaz and god knows what the hell could happen to you. (beat) It’s not just YOU in this! MILES OK, THIS was some mothafucka...  90. ASHLEY Before you give me another excuse, which with your mouthpiece will seem like an airtight defense-- let me ask you something. Were you afraid when you came out here and saw Sean holding the gun? MILES Yeah. ASHLEY OK, so me too. And do you think that if you had told me about possibly buying a gun, I might have seen that scenario coming? Miles looks at the floor and processes. Then he starts nodding. MILES That’s a really good point. That’s a REALLY good point. (beat) If you go out and get a job in sales, you can list me as a reference. Ashley YANKS on his hand wrap, way harder than she meant MILES (CONT’D) OWWW!! ASHLEY HA! Maybe if you niggas weren’t so wi - MILES Don’t call me that. ASHLEY What? Nig -- MILES Don’t call me that. Ashley pauses. ASHLEY Ok. MILES I love you.  91. ASHLEY I love you too. EXT. CORNER OF COLLIN’S STREET - NIGHT 95   95  Collin has jogged the whole way back. When he gets to the corner of his street, he stops to look up at the street sign. He stares at the Oak tree. As he is standing there, a COP CAR flies by before abruptly stopping a few cars past Collin... Collin stops for a m",
      "dialogue_count": 0,
      "word_count": 820
    },
    {
      "scene_number": 12,
      "slugline": "INT. VAL’S BEDROOM - CONTINUOUS 98   98  Val’s phone rings, she is studying for exams. We INTERCUT between Val and Collin for this conversation: VAL Hi. COLLIN ...Hi. VAL ...um COLLIN How’s the memorizing going? VAL Yeah, trying to get these Psychology terms down. COLLIN What...name did you come up for the double picture one? The faces and vase one. VAL Oh! That one I like. I called it “Blindspottin’.” COLLIN ...why blindspottin? VAL Because it’s all about how you can look at something and miss the other thing there. So you always got a blind spot. COLLIN But you don’t have a blindspot once someone points out the other picture to you. VAL Mmmm, but you can’t go against what your brain wants to see first. So you’re blind to the spot you aren’t seeing, you got a blind spot, “blindspottin’” Collin takes that in for a while. The call is quiet.  93.",
      "characters": [],
      "action_text": "VAL (CONT’D) Collin? COLLIN When you look at me...do you see the fight first? Val is quiet on the other end for a long time. She puts her head down. Collin drops his head too. Her silence says everything. COLLIN (CONT’D) Good luck with your tests tomorrow, Val. VAL ...Coll-- And he hangs up.  SUPER: FIRST DAY OFF PROBATION  INT. COLLIN’S HALFWAY HOUSE - COLLIN’S BEDROOM - MORNING 99   99  The alarm clock jolts him awake. No gunshot. Collin opens his eyes. It’s a new day. He wakes up, and looks at the map on the wall. He rips it down, throws it in the trash. He picks up the TRUMPET. Looks it over. INT. COLLIN’S HALFWAY HOUSE - BATHROOM - MOMENTS LATER 100   100  Collin cleans the horn in the sink, the mouth guard, all the valves, etc. It shines a surprising amount with a little love and care. He attempts to blow it, but no sound comes out. He pulls a valve on the bottom, holds it over the drain, and watches a DIRTY UGLY OOZE slide out of the trumpet. It’s a lot, draining into the sink. He tries the trumpet again, and it makes a HUGE SOUND. We hear James off in the distance: JAMES (O.S.)  Oh HELL no! It’s 7am! Better be some cleaning going on!  Collin SMILES. We see a mop behind him.  94.",
      "dialogue_count": 0,
      "word_count": 385
    },
    {
      "scene_number": 13,
      "slugline": "EXT. KONA CLUB - DAY 101   101  Collin has earbuds in, rhyming to himself. He rounds the corner, glancing at Kona’s door. As he passes Kona, he steps on something squishy and stops. He looks down, and it’s... ...a strawberry, right where his fight happened. He shakes it off and keeps running. INT. MOUNTAIN VIEW CEMETERY - DAY 102   102  He enters the cemetery and starts his loop. After a bit, he looks up to see the BLACK MAN WHO WAS SHOT staring at him. Sitting on top of a HEADSTONE. Collin looks forward and keeps running when he notices... ...a SECOND BLACK MAN sitting on another headstone. He closes his eyes trying to will the hallucination out of his mind. Collin opens his eyes and keeps going. But then notices another, and another, and another. Other people are walking through the cemetery, but they can’t see all the black men sitting on the headstones. More and more appear, staring at him. COLLIN LOOKS AROUND AND NOW EVERY HEADSTONE IN HIS SIGHT HAS A BLACK MAN, HIS AGE, WEARING HOODIES, STARING AT COLLIN! Collin is frantic, running fast to get out. Eyes nearly closed, he bursts out onto the street. He keels over to catch his breath. Collin stands up and looks back. Now he sees what everyone else sees... ...just rows of gravestones. INT. MILES’S APARTMENT - DAY 103   103  Miles answers the door for Collin. Collin looks distraught. Ashley is dressing Sean in the background, Miles and Collin don’t say anything to each other. Collin is still wearing his running clothes. ASHLEY Hey Collin! MILES We late, we gotta go straight to the first appointment. I called the office & got the address.  95.",
      "characters": [],
      "action_text": "Ashley comes over, acting silly. She jumps towards him in celebration. ASHLEY Colliiiiiin! You are freeeeeee! Do you feel liberated today? Fresh start fresh start fresh start. She grabs Sean and dances with him. COLLIN Yeah, I’m good. ASHLEY And not a scratch on ya! Must got them quick hands quick hands! MILES (under his breath) That’s not why. Sean runs up, jumping over them both, then he punches Collin. COLLIN A-ha-how! Excuse me? Sean puts his dukes up, keeps punching Collin. COLLIN (CONT’D) Ha! Stop! ASHLEY Sean, quit being a tough guy, don’t punch Collin. COLLIN Ease up, lil man! Sean gives a big LAUGH, they play box and spill into the living room. Collin tries to avoid the punches. Collin sits down to be eye-level with Sean. They’re at a standoff. Collin and Sean stare at each other to see if Sean is going to PUNCH again. Finally, he does. COLLIN (CONT’D) Ey, quit it! Sean goes for it again. Collin changes his tone, points at Sean, and forcefully commands him. COLLIN (CONT’D) STOP!  96. Right then, Sean throws his hands up in the air over his head. And says: SEAN Don’t shoot! The room is quiet, Collin processes this. They are alone in the room, a 3-year-old with his hands up, and Collin with his finger pointed. He sits back in shock. His terror begins to return. He slumps back into the chair, he recedes back into his own head. We overhear Ashley, almost in the distance. ASHLEY Oh, good, baby! See they said he was too young for that pamphlet, but he took right to it.  Sean giggles. Collin is frozen, staring at Sean. Looks almost on the verge of tears. Collin slowly, uncomfortably slips backwards as everything else seems to fall away. We see Sean as a fully grown man standing in front of him, dressed like Collin. EXT. OAKLAND STREETS - DAY 104   104  Like a dream, we see rows of street signs are going by, over and over again as the signs drive by. We see the the EZ LIFT TRUCK rolling down the street overhead  EXT. HOUSE IN EL SOBRANTE - DAY 105   105  Collin ope",
      "dialogue_count": 0,
      "word_count": 2571
    }
  ]
}