{
  "slug": "bloodshot-2020",
  "title": "bloodshot",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 12,
  "characters_count": 0,
  "characters": [],
  "total_words": 20894,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. MEDICAL LAB - DAY  Bloodshot has his arm under a scanning electron microscope. BLOODSHOT (CONT’D) ...and I’m not the least bit tired. Harting looks through the eye-piece at Bloodshot’s skin cells. The monitor behind him displays the image. HARTING From the day we stop growing, our bodies begin dying. Our skin cells wither away, our muscles are cannibalized, and our bones degrade. Harting reaches for a scalpel... HARTING (CONT’D) But not you. The nanites are constantly repairing your body on a cellular level. BLOODSHOT So I’ll never have to exfoliate again? HARTING It’s a little more exciting than that... FLASH of the scalpel -- Harting SLICES Bloodshot’s hand -- he recoils -- but Harting pins his wrist under the microscope -- ON THE SCREEN: The magnified nanites pour out of the wound and stitch the skin back together... one cell at a time.  Holy shit.   Harting releases him. Bloodshot stares at his hand as the cut disappears before our eyes. BLOODSHOT Yeah. That’s exciting.  INT. FITNESS LAB - DAY  New, day -- same water wheel. Display reads: 20 mph... 21... Bloodshot is soaked in sweat, right at the point of breaking. HARTING Okay. That’s enough. LAB TECH The record at this resistance level is twenty-five miles per hour... ENDOSCOPIC SHOT: Bloodshot’s quads -- with each stride, muscles tear -- but are instantly repaired by the nanites --  21.",
      "characters": [],
      "action_text": "BLOODSHOT SOMEBODY PLAY THE ROCKY THEME. Pure determination -- this guy is not going to stop until he reaches his goal. ON THE READOUT: 23... 24... The water carried by the wheel’s pockets CHURN and FROTH and spray the back of the fitness lab like a rooster tail... And then something CRACKS at 25 MPH. The axle wobbles. And Bloodshot nearly rolls the thing out the pool. He hits against the inside and spins like a stray piece of clothing in an enormous dryer, and then... Collapses. HARTING The turbine -- it cracked. Bloodshot can’t help but smile.   He broke the thing.  BLOODSHOT Better get a new one. HARTING Thanks for the advice. Bloodshot’s head snaps up -- BLOODSHOT What did you say? HARTING Thanks for the advice. (beat) Why? Bloodshot’s heart rate picks up... POUNDING in our ears... BLOODSHOT Nothing. Harting holds his gaze...   something’s definitely wrong . Bloodshot grabs a water. That’s when we hear it... music... BLOODSHOT (CONT’D) You hear that? HARTING Hear what? It’s   Stairway to Heaven.   Bloodshot sits -- head in his hands. Music won’t stop -- like a hammer, SLAMMING into his brain. A TEST PILOT enters --  22. TEST PILOT Got this room booked. FEMALE TECH In fifteen minutes. TEST PILOT You’re late. FEMALE TECH You’re early. FLASH ON: Gina -- smiling in the Chevy -- GINA You’re early. BACK TO: Bloodshot -- doubles over in pain -- HARTING What’s wrong? FLASHBACK TO: Gina dead on the ground. Garrison foaming -- GARRISON YOU ARE NOTHING. I PROMISE YOU -- BACK TO: Bloodshot -- teeth GRINDING -- heart POUNDING -- BLOODSHOT --I-will-find-you-and-end-you-- Harting panics -- turns to the tech -- HARTING Get medical in here -- NOW. Harting GRABS Bloodshot -- helps him to a chair -- Zeppelin track builds -- BLASTING in our ears -- sensory overload -- BLOODSHOT --you-better-kill-me-now-- HARTING Breathe. Try to Breathe -- BLOODSHOT --you-will-not-get-a-second-chance. FLASH ON: Aussie standing over us, .45 pointed at the lens -- AUSSIE Thanks for the advice.  23. GU",
      "dialogue_count": 0,
      "word_count": 799
    },
    {
      "scene_number": 2,
      "slugline": "INT. COMMAND HUB - INTERCUT WITH ABOVE  Harting and a handful of TECHS monitor the situation from the center of Rising Spirit’s security grid. HARTING (INTO COM) Chainsaw -- headed your way.  INT. STAIRWWELL - CONTINUOUS  Bloodshot staggers up the stairs -- heart POUNDING -- FLASHES ON Gina’s tear-stained face -- Aussie’s smug smile, his .45 pointed right at us -- AUSSIE Thanks for the advice. GUNSHOT echoes from the past -- One more flight of stairs -- ground level. Taser baton in hand, Bloodshot enters the --  GROUND FLOOR  That’s when he hears it... the metallic CLANG of footsteps. Bloodshot looks up and sees -- A massive man wearing a skull-shaped ballistic face mask, the words “SO LONG” spray painted on his chest plate. SO LONG steps forward on hydrogen powered prosthetic legs. These things look more like sleek, articulated plastic limbs, not like bulky metal armor. The legs, in combination with a spinal support, allow him to lift a cannon, firing a tsunami of SOUND WAVES -- SLAMMING Bloodshot against the wall -- HARD. He tries to crawl away -- his nanites working hard to heal .  A WOMAN in tactical armor cuts him off -- THROWS something -- WOMAN Catch. Bloodshot tries to duck -- too late -- the object EXPLODES -- sarin gas BURNING his eyes and lungs. A blinded Bloodshot HOWLS in pain. So Long GRABS him by the neck -- lifts Bloodshot up to eye-level... SO LONG Bet that hurt...  25.",
      "characters": [],
      "action_text": "Bloodshot looks up at So Long -- BLOODSHOT Bet this hurts more. The taser baton in Bloodshot’s hand CRACKLES to life -- takes a cheap shot -- JAMS it under SO LONG’s face mask. So Long BELLOWS in pain -- drops Bloodshot -- who SCURRIES towards the door and freedom. The woman in the tactical armor gives chase as we POP OUT TO:  EXT. RISING SPIRIT - SAME  SNIPER POV of the ground floor. No windows -- just a wall. SNIPER’S VOICE (O.C.) Chainsaw Bravo, stand down -- Alpha has target. ECU of the sniper’s eye reveals an ocular implant -- it FLIPS from grey to red, allowing the sniper to see Bloodshot’s heat signature through the wall .  He squeezes the trigger -- BULLET POV: ROCKET out the barrel and BLAST through the wall.  INT. RISING SPIRIT - SAME  Time slows down as the bullet erupts from the wall -- reduces speed -- and extends a TRANQ DART, SLAMMING into an escaping Bloodshot’s neck -- LIGHTS OUT. CUT TO BLACK. OVER BLACK: VOICE (PRE-LAP) We’re talking about a multibillion dollar contract --  INT. CONFERENCE ROOM, RISING SPIRIT - DAY  The voice belongs to RST’s Chairman, MORRIS KOZOL, 50s, skyping with Harting. The conference room is decorated in Feudal Japan. Bonsai. Woodcut art. Swords on walls. KOZOL Bottom line it: how much more time do you need? Do I need to buy you some more dead soldiers? At this rate I’ll have to start another war for you.  26. Harting seethes... he does not like to be pinned down. HARTING He’s revived but he still has all the baggage of a person with his experience. It’s delicate work. Let me do my job. KOZOL My job, Doctor, is to remind you that he’s not a person, he’s property. And you don’t have a good track record when it comes to securing our property. We can’t let Harada get ahead of us on this. HARTING We’re handling that. Nearly finished. KOZOL Finish your job so I can do mine.  INT. RECOVERY ROOM - DAY  Bloodshot slowly comes to -- on a hospital bed. Tied down. BLOODSHOT Harting please... I have to find him... I just let her die...",
      "dialogue_count": 0,
      "word_count": 2803
    },
    {
      "scene_number": 3,
      "slugline": "INT. RECOVERY ROOM - DAY  Bloodshot sits up, waking suddenly, in a coughing fit.  EXT. SCRAPYARD OUTSIDE THE SHED - RESUME  Bloodshot’s clenched hand trembles as smoke curls up from the molten ROCK he’s holding, hissing through his teeth: BLOODSHOT Nineteen... twenty! He drops the thing right away and stares at his hand -- The badly burned flesh instantly REPAIRS, softly shushing the sizzling flesh until he’s back to normal. Bloodshot look up, triumphant, until he sees So Long coming at him with something new -- A blowtorch. BLOODSHOT (CONT’D) WHOA WHOA --  INT. RECOVERY ROOM - DAY  Bloodshot wakes again, with the same EKG electrodes on his chest. He checks his skin for burns. Just pale flesh instead.  INT. THE SHED - RESUME  The lights clack back on, but the chemical toxins KP threw at Bloodshot still have him blinded. KP attacks, demanding: KP Adapt again! Come on! Bloodshot strains his ears again -- ENDOSCOPIC SHOT: Inside the eardrum, the space begins to reform, allowing him to hear every minute sound -- KP’S STAFF comes sailing down to strike him in the head but then Bloodshot CATCHES the blow with his palms and in two swift twists he DISARMS her of the weapon. Standing triumphant, Bloodshot raises his arms. BLOODSHOT Adapted! I don’t need eyes to know I look good right now.  38.",
      "characters": [],
      "action_text": "KP can’t help but grin at Bloodshot’s sudden snark, especially when she pulls a swift KICK TO HIS NUTS -- Bloodshot immediately collapses in a heap on the floor, wheezing in pain. KP You still have weak spots. Remember that. Trick isn’t that you’re invincible. It’s that you can get back up. KP crouches down by Bloodshot, listening to him breathe through his teeth. KP (CONT’D) It’s just pain. BLOODSHOT Easy for you to say -- KP Control the blood flow, the muscle group around that whole area. Trust me, I’m doing you a favor. Bloodshot starts to get up again but not before looking bewildered at KP: BLOODSHOT How? KP Later on you’ll realize this level of control has... other uses. She means sex, Bloodshot.  EXT. ROOFTOP PLATFORM - SUNSET  Bloodshot now has to deal with SPINNING BLADES that pop out of the grid of metal poles. As he moves for Harting, he’s SLICED across one bicep. He grunts, grits his teeth... and the wound SEALS UP. Two more spinning blades CUT into him as he weaves for Harting, and both times he breathes through his mouth and the cuts self-repair. Then Harting STRIKES, but Bloodshot DODGES, and Harting’s arm is so strong, the sword cuts right through a metal rod. BZZP! One less spinning blade for Bloodshot to worry about. Harting strikes again, an overhead blow this time --  39. Bloodshot CLAPS his hands together, CATCHING the blade -- But not quite as elegantly as he’d like. Black blood drips down his arm. Grabbing the blade with both hands, his palms getting badly sliced, he wrenches the sword from Harting. It clatters to the floor. HARTING (CONT’D) Congrats. What you’ve become, what we’ve done this last week... it’s remarkable. Bloodshot clasps hands with Harting, congratulating... and then Harting plunges a SEPPUKU KNIFE into Bloodshot’s gut .  BLOODSHOT Sonofabitch, doc-- Bloodshot is suddenly on his knees. In shock at seeing the hilt sticking out of his abdomen. HARTING The ancient samurai were mentally prepared for death. Trained for it. Your tra",
      "dialogue_count": 0,
      "word_count": 1453
    },
    {
      "scene_number": 4,
      "slugline": "EXT. HONG KONG SKYLINE  THE ROAR of a helicopter on arrival to Rising Spirit. CUT TO: INDIVIDUAL FACES flickering by -- thirty per second -- TIBBS (O.S.) Encrypted hard-line access to the CIA/Interpol shared database. POP OUT TO REVEAL:  INT. RISING SPIRIT, SUB-BASEMENT - NIGHT  Bloodshot watches the headshots on a view screen, Tibbs and Harting behind him. TIBBS Every driver’s licence, passport, and mugshot ever taken. Three billion some-odd folks... BLOODSHOT Facebook for feds. Thousands of images reflect off Bloodshot’s dark eyes. TIBBS (CONT’D) If that Aussie is the needle, this is your haystack. HARTING I’m running a diagnostic on your nanites’ bioelectrical system, so you may experience some weird lapses... Bloodshot doesn’t respond. Tibbs SNAPS his fingers in front of Bloodshot: doesn’t even blink. HARTING (CONT’D) He’s already gone. BLOODSHOT’S POV: Time slows to a crawl, each face holding on screen for a beat. Bloodshot takes it all in. Waiting for a FLASH OF: AUSSIE Thanks for the advice. GUNSHOT RIPS US BACK TO:  44.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 168
    },
    {
      "scene_number": 5,
      "slugline": "INT. SUB-BASEMENT - NIGHT  The place is deserted. Bloodshot is alone. Hasn’t moved -- hasn’t blinked -- in hours.   His vigil of vengeance.  Suddenly Bloodshot’s face begins to twitch, like a contortionist who can no longer hold his pose. Sweat beads on his brow... finally he reaches up, pauses the images dancing by. ON SCREEN: one face. Familiar. Australian. This is his guy. The man who shot Gina in front of him. And now we have a name, glowing at us under the profile pic: BLOODSHOT Martin Axe. Found you.  INT. RST OPS CENTER - NIGHT  So Long and Harting argue in front of an array of high-tech networked computers, unaware that the mugshots of bad guys have finally stopped on Martin Axe. SO LONG I just don’t get it. You could pump me full of nanites instead of him. Why bother with Mister Broken Heart at all? HARTING You’re right. You don’t get it. It isn’t skill or training that makes him perfect, it’s what drives him. SO LONG Technology. HARTING You know the myth of Tantalus? Cursed for the rest of his days to be surrounded by fruit and water that recedes every time he reaches for it? That’s Bloodshot. He’s ever reaching for what he can’t have. (beat) It’s his prison. SO LONG I’ll take his prison over mine any day. More data on Axe starts to fill screens. Files opened. Surveillance photography. It’s the digital version of dumping a trash bin full of personal records.  45.",
      "characters": [],
      "action_text": "The computer system CHIMES with an alert, finally attracting Harting’s attention. He looks over at all the search data clearly culled by Bloodshot. SO LONG (CONT’D) Martin Axe? Who’s this? ON ONE SCREEN: “Last known location: ST. PETERSBURG.” Bloodshot barrels into the room, surprising the men. BLOODSHOT I need to get to Russia.  INT. BRIEFING ROOM - LATER  Bloodshot gets a a fake passport from Tibbs. TIBBS Given US tensions with Putin, we can’t risk an incident on Russian soil. That means you’re gonna be on your own -- no insertion, no back-up, no exfil. Tibbs notices Bloodshot checking the sights and thumbing the safety on a Desert Eagle. TIBBS (CONT’D) You can’t take that on the plane, you know. BLOODSHOT Considering my own blood will probably trip the metal scanner, I’ll have to get creative with my travel. The rest of Chainsaw hangs back, saying “goodbye” without saying it. Bloodshot takes a deep breath...   is he nervous?  KP Think you’re ready? Few days ago you were a corpse. BLOODSHOT Says the woman with the broken neck. KP and Bloodshot share a look...   is she worried about him?  BLOODSHOT (CONT’D) I’ll be fine... survived the freakshow, didn’t I?  46. SO LONG We pulled our punches. Last time you saw this Axe clown, guy put a bullet in your brain... BLOODSHOT I intend to return the favor. SO LONG (taunting) Killing him isn’t gonna bring your wife back. BLOODSHOT Being a dick isn’t gonna bring your balls back. So Long’s on his feet -- Bloodshot holds his ground. TIBBS Calm down, ladies -- you’re both pretty. Bloodshot notices his pale skin. BLOODSHOT I kinda look like I sleep in a coffin. HARTING Don’t like what you see? Change it. BLOODSHOT Ha ha. Wait, really? HARTING (samurai wisdom) The body is but an extension of the mind. Bloodshot considers this. He closes his eyes and exhales... MICROSCOPIC SHOT: Bloodshot’s skin cells -- one by one they transform from deathly pale to a robust flesh tone -- PULL OUT: the transformation SPREADS like a wave -- continu",
      "dialogue_count": 0,
      "word_count": 620
    },
    {
      "scene_number": 6,
      "slugline": "INT. RISING SPIRIT, GROUND FLOOR - EARLIER THAT DAY  Harting leads Bloodshot to the front door. Bloodshot looks startlingly normal, like he was when we first saw him. HARTING Nanites use voice over IP so just ask for a connection. There’s a beat of silence... this is it. Bloodshot’s leaving. BLOODSHOT I appreciate you letting me do this. I would’ve felt a pang of guilt if I had to escape instead. HARTING This is a test, for both of us. But as I’ve said, there comes a time when you have to step off the ledge. (then) I’m a dead man if you don’t come back. BLOODSHOT Being dead isn’t so bad. (then) I’ll come back.  EXT. HONG KONG INTERNATIONAL AIRPORT - DAY  On a man-made island, giant commercial planes are literally coming in just a hundred feet over hotels and condos to land. Out on the tarmac, a herd of PASSENGERS board a 747 while BAGGAGE HANDLERS load the freight compartment. Lingering on the line of Passengers as they ascend the stairs... No sign of Bloodshot here... BLOODSHOT (V.O.) You’ve given me a second chance -- a chance to make things right. But then an ASIAN BAGGAGE HANDLER climbs into the freight compartment with a box marked “fragile.”  INT. 747 FREIGHT COMPARTMENT  The Handler sets the box down, walling off a section of the compartment. The Handler then sits behind that wall of baggage, takes off his ear protectors... And stares at his hands. He begins SHAKING HIS HEAD like he has water in his ear or something, but then his FACE CHANGES--  48.",
      "characters": [],
      "action_text": "MICROSCOPIC SEQUENCE: The brown eyes around his pupils shift to a different color, the skin tone shifts, and then-- It’s BLOODSHOT sitting in the freight compartment. He checks himself in the reflective surface of a chrome support beam. BLOODSHOT Damn. I looked good as an Asian dude.  EXT. SKY OVER CHINA - DAY  The 747 vaults into the stratosphere.  INT. 747 FREIGHT COMPARTMENT  Bloodshot has three different suitcases open, pulling out potential clothing options and placing them against his chest to see if they’d fit. All the while he’s singing to himself: BLOODSHOT If you think I’ll sit around while you chip away my brain / Listen I ain’t foolin’ and you’d better think again -- He finds a turtleneck that looks like a good fit and tosses it into a Tumi briefcase he’s gutted to claim his own. A bag of homemade COOKIES sits in his lap, pulled from someone’s checked luggage. Bloodshot looks up at nothing in particular and says: BLOODSHOT (CONT’D) Open new window. Access employee roster for Halcyon Technologies. He takes a bite of a cookie -- BLOODSHOT POV Suddenly the MUSIC OF JUDAS PRIEST is blasting in his head and we’re looking at a slew of holographic website data floating in front of us, a dozen windows multitasking. JUDAS PRIEST (music video window) If you think I’ll let it go you’re mad, you’ve got another thing comin’. One website pulls up a set of EMPLOYEE RECORDS for a tech company while other pages show satellite PHOTOS of a corporate compound in St. Petersburg. It’s an old building with rows of very expensive cars out front. The employee records page SCROLLS as if by mental command.  49.",
      "dialogue_count": 0,
      "word_count": 547
    },
    {
      "scene_number": 7,
      "slugline": "INT. RST OPS CENTER - DAY  The same EMPLOYEE RECORDS show on the screens here at RST. They’re seeing all of Bloodshot’s inquiries real-time. Also, they’re victim to his music selection. KP sits with Harting in the center, watching the data go by like a pair of voyeurs. KP Is that Judas Priest? HARTING (sigh) Yes. He’s using our Internet server link as his personal jukebox. KP leans in, increasingly fascinated. KP He used Axe’s income return forms to locate a Russian shell company Axe uses as cover. (sees another screen) Now he’s pulling up the building’s history. Is he looking for a point of access? HARTING He can’t just walk in and ask to murder a high-tech arms dealer. So, I’d say yes. On the screens, faces of different RUSSIAN MEN AND WOMEN whip by, with employee ID numbers. KP So what’s he doing with that employee roster? HARTING Probably figuring out how many are working the night shift. THE SCREENS switch to a new video website with the title “Language Learners.” The first video: “Learning Russian. Lesson one.” The video plays at DOUBLE SPEED, all the while Judas Priest still WAILS their guitars, right into --  EXT. ST. PETERSBURG AIRPORT - DUSK  The 747 now parked at a gate.  50.",
      "characters": [],
      "action_text": "BAGGAGE HANDLERS dressed for the cold weather unload the luggage from a conveyor belt as the bags travel from the belly of the plane. The Handlers turn around to grab another suitcase but instead find BLOODSHOT riding the conveyor down, dressed more warmly now himself, too, and carrying his (stolen) briefcase. BLOODSHOT (in Russian, subtitled)  Luggage inspection. You handled that fragile box like it was your woman, good job. Here, have a cookie.  Bloodshot leaves the mystified Handler with the cookie bag.  EXT. ST. PETERSPBURG - DAY  Soaring above the northern capital of Russia, fourth largest city in Europe. Sun glistens off the snow-capped rooftops. Street level. ALEXI KRIEGER, parks his car. Groceries in hand, he enters the front door of his up-scale flat. KRIEGER Viktor!  INT. KRIEGER’S FLAT - DAY  Silence. Krieger grabs a box of dog treats from his bag. He heads into the kitchen and finds -- KRIEGER Viktor. His DOBERMAN. Krieger shakes the box... but the dog could care less... he’s chomping on something else. KRIEGER (CONT’D) (Russian, subtitled)  What you got there?  Krieger moves closer --   sees that the dog is eating a steak?  Suddenly -- phone cord goes around Krieger’s neck -- Bloodshot pulls it tight -- Krieger struggles -- BLOODSHOT If I wanted you dead, you’d be dead. Krieger gasps for air --  51. BLOODSHOT (CONT’D) Alexi Krieger. Yeah, I know who you are. You got an attack dog like Viktor for protection because you’re not a fighter. So listen t--OOOF! Krieger’s ELBOW jams right in Bloodshot’s gut -- Then Krieger STOMPS Bloodshot’s foot -- Bloodshot loses his grip on the cord for a moment, and so Krieger LUNGES for the knife block -- Bloodshot PULLS back -- too late -- Krieger GRABS a blade -- LAUNCHES himself backwards -- SLAMS Bloodshot into the fridge -- again -- and again -- Doberman just watches -- that steak is   really   good. WHAM -- Bloodshot loses his grip on the cord. Krieger spins around -- STABS at Bloodshot -- the blade goes through Bloo",
      "dialogue_count": 0,
      "word_count": 1476
    },
    {
      "scene_number": 8,
      "slugline": "INT. CARGO HOLD, HADES OCEAN FREIGHTER - NIGHT  A Russian copycat of an American cartoon plays on a small TV. One lone WATCHMAN with an AK-47 sits at a desk, enjoying the show with a grin. Then he stands as a group of OTHER GUARDS led by a MERCENARY COMMANDER (M.C.) haul in two bodies in black body bags. M.C. takes Bloodshot’s Desert Eagle from the Guards, inspects it, nods, then sets it down, ordering: M.C. Put them on the tables here. The Guards obey, then leave. Meanwhile, the M.C. goes to the Watchman’s desk and grabs a handset to the freighter’s internal phone line. M.C. (CONT’D) (beat) There’s been an incident. An intruder attempted to gain entry but Ivan shot and killed him at the gangway. The other Ivan was killed, too. Friendly fire.  INT. CAPTAIN’S QUARTERS - THAT MOMENT  Revealing MARTIN AXE sitting up in bed, handset to his ear. He’s getting out now like this is mobilizing news. AXE Is he American? (beat) Are you sure he’s dead? Axe reaches out and grabs a little REMOTE, thumbing it to activate the little LED screen: “ARMED.”  INT. CARGO HOLD - THAT MOMENT  The M.C. listens to his orders from Axe. M.C. Stay with them? Yes sir. The M.C. hangs up and looks back at the body bags, like,   Why the hell am I babysitting dead men ? Next to him, the Watchman remains standing but goes back to his cartoons. In the background, visible between these two thugs, one of the body bags begins to UNZIP ITSELF. Behind them, Bloodshot SITS UP. Looks over at the men.  57.",
      "characters": [],
      "action_text": "Bloodshot picks up his Desert Eagle off the table. WATCHMAN This is my favorite part. M.C. You seen it already? Why watch again? Don’t you want to be surprised? Bloodshot SHOOTS THEM BOTH -- double taps -- they collapse. He grabs assault rifle from the M.C.  INT. HADES OCEAN FREIGHTER - MOMENTS LATER  Bloodshot makes his way down the narrow metal steps, armed with the AK-47. He ducks into the --  INT. UTILITY ROOM, HADES FREIGHTER - CONTINUOUS  Bloodshot searches the various panels -- finds the power line, RIPS it out.  INT. CARGO HOLD - CONTINUOUS  Lights out --  INT. BRIDGE - CONTINUOUS  Power goes out here but emergency lighting flickers on, revealing MARTIN AXE with a shotgun, alert as a cat after a shot of espresso. His crew of MERCS are close. Four, five... at least six. AXE He’s here. He’s down in the hold. (then) That means GO, you idiots.  INT. FREIGHTER CARGO HOLD - MOMENTS LATER  Axe’s MERCS make their way into the bowels of the freighter, weapons ready... Flashlights sweeping... Totally unaware that in the shadows -- Bloodshot watches. His eyes are tinged with a dull crimson GLOW, tracking them with a nanite-induced infrared filter until -- He STRIKES, blasting in the dark -- all rage and brutality; gone is the wisecracking man we thought we knew -- One, two, three men go down before they know what hit them --  58. But there are too many, and from the door: AXE (O.S.) It’s him! Bloodshot finds Axe at the entry, a silhouette against the deck lights beyond, and Bloodshot forgets about the other MERCS around him, it’s all about getting to Axe -- Bloodshot FIRES at Axe, who ducks away -- -- And that’s when two Mercs GUN BLOODSHOT DOWN. He starts to get up again -- MERC Sonuva-- And they shoot him AGAIN. MERC (CONT’D) What d’you think he was on? PCP? The Merc kicks at Bloodshot’s corpse. Bloodshot rolls over, handgun in his grip, and BLASTS at the Merc, dropping him -- The SECOND MERC freaks out, FIRES AGAIN, two to the chest... AXE (O.S.) Did you get him? ME",
      "dialogue_count": 0,
      "word_count": 1369
    },
    {
      "scene_number": 9,
      "slugline": "EXT. BOLSHOI PORT - NIGHT  Bloodshot’s dying -- the nanites not re-booting -- his legs not healing -- like nothing he’s experienced before. Bloodshot FALLS to the snowy rooftop on his back. WHUMP. His body begins to TURN GRAY... And on his torso, dead-center, a RED CIRCLE of light pulses. ENDOSCOPIC SHOT: Bloodshot’s brain -- nanites FLICKER in unison -- trying to reboot -- finally they go dark. CUT TO:  BLACK.  FRANTIC VISUAL COLLAGE  Day of the dead images -- coffins and carnations -- a child in skull face paint -- Ray and Gina in the hotel room --  INT. TIJUANNA HOTEL ROOM - MORNING  Bloodshot wakes in bed. Alone. Which seems...   odd . BLOODSHOT Gina...? He looks around -- finds the note.  Went to get us breakfast, back soon. Practice makes perfect.  Bloodshot smiles. Turns and catches his reflection in the mirror -- the scar on his chest is gone.  Or was it ever there?  BLOODSHOT (V.O., PRE-LAP) (CONT’D) Sorry to call so early. Just needed to talk...  EXT. HOTEL BALCONY - MOMENTS LATER  Bloodshot’s on the balcony, leaving a message. BLOODSHOT (INTO PHONE) Thinking about getting out of the field, taking that instructor’s post... Remnants of the Day of the Dead festival litter the street below. It’s all so...   familiar .  63.",
      "characters": [],
      "action_text": "BLOODSHOT (CONT’D) (laughs to himself) Sorry, if we’ve, uh, talked about this before. Just had this crazy dream... anyway, call me.  INT. HOTEL BATHROOM - MOMENTS LATER  Bloodshot’s in the shower... lost in thought. Keeps scrubbing the same spot on his chest... right where the scar should be.  Something is definitely wrong.   He turns off the water...  INT. HOTEL ROOM - MOMENTS LATER  CREAK -- the door opens -- two Pros enter -- just as they did before. Head towards the steam-filled bathroom, passing the --  BALCONY  Where Bloodshot is clothed and ready -- SOG knife in hand. In a FLASH -- he takes out the first Pro. Second Pro LUNGES at Bloodshot -- who COUNTERS with ease, pinning his attacker against the balcony railing. BLOODSHOT Where is she? Where’s my wife.  Bloodshot remembers -- everything.   Pro curses in Spanish -- BLOODSHOT (CONT’D) Then I’ll ask Martin Axe. Bloodshot THROWS the Pro off the balcony before --  INT. HALLWAY - MOMENTS LATER  Moving into the hall, ready for Axe.   But it’s empty.   The stairwell door opens...   here we go...  But it’s just some OLD GUY with a ponytail. He sees the knife in Bloodshot’s hand... freezes. BLOODSHOT Go to your room -- lock the door. Old Guy moves quickly past Bloodshot -- but then turns and -- STABS Bloodshot in the back with an auto-injector. A shocked Bloodshot SPINS on the old guy... legs lock up... his vision... cloudy... finally he collapses.  64. BLACKNESS  We know what comes next --   Stairway to Heaven.   Hood comes off, Bloodshot’s back in the chair --  INT. BARN - CONTINUOUS  But it’s not Axe in front him -- it’s that old guy. OLD GUY Now   this , this is torture. GARRISON Who -- OLD GUY Led Zeppelin. Most overrated band -- GARRISON -- are you? OLD GUY I think I’ll ask the questions. Bloodshot is beyond confused...   What the hell is going on?  BLOODSHOT Where’s Martin... Axe? OLD GUY Who? BLOODSHOT He set this up... took my wife... OLD GUY Right about one thing... The old guy gives the signal and his MEN",
      "dialogue_count": 0,
      "word_count": 2528
    },
    {
      "scene_number": 10,
      "slugline": "EXT. EUROPEAN COUNTRYSIDE - DAY  The passenger train slices through the hilly forest, having escaped the cold snows of deep Russia.  INT. PASSENGER TRAIN - “COACH” SEATING - DAY  Bloodshot makes his way up the aisle, looking for a place to sit, trying to look inconspicuous. Of course he’s wearing the same shirt from St. Petersburg. He looks like a hobo. A zombie hobo, with his skin tone. On the train’s TV in the corner, live news of the EMP explosion is the main attraction. A few blue-collar COMMUTERS watch the TV with interest. Then an image of Bloodshot appears on screen, with the bumper text of “BREAKING NEWS” underneath. So Bloodshot keeps moving, head down, not making eye contact with anyone.  INT. PASSENGER TRAIN - BUSINESS CLASS CAR - DAY  Bloodshot slides open the door and steps in. WIDE ANGLE This is where the rich ride. One extra-large seat on either side of the main aisle versus two small ones. Leg room. And also virtually empty. In one seat: A foppish BRITISH COMMUTER, sipping a tea while working on his laptop on a tray. Bloodshot eyes that laptop. And sits down across from him. The Brit glances at Bloodshot, then does a double-take. As Bloodshot gets comfortable, the Brit clears his throat. BRITISH COMMUTER Pardon, do you have a ticket? BLOODSHOT Why, is this seat taken? BRITISH COMMUTER I don’t think you belong here. BLOODSHOT Everyone keeps telling me that. The Brit starts to stand up, grabbing his laptop --  75.",
      "characters": [],
      "action_text": "BRITISH COMMUTER I’ll have the conductor tell you, so you can go back to your hillbilly convention -- Bloodshot puts a hand on his shoulder and forcibly sits him back down. BLOODSHOT I just need to borrow your laptop. BRITISH COMMUTER For what? A seat warmer? Bloodshot takes the computer from the Brit’s hands and opens it to discover a login screen. BLOODSHOT I’ll just take a minute, I won’t even close your browser so you can keep shopping for monocles or whatever -- BRITISH COMMUTER It’s password protected. BLOODSHOT Is it? The password sequence CYCLES THROUGH numbers until -- DING! BRITISH COMMUTER How did you -- The screen now displays a web browser; some gateway page to a paid porn site -- “Big Busted Brits!” BLOODSHOT Ohh wait, that’s not a monocle site! Red-faced, the Brit now jumps out of his seat and flees for the next car, with the threat over his shoulder: BRITISH COMMUTER The authorities will deal with this! BLOODSHOT (friendly) Oh I think you’re safe to watch porn here, don’t worry! Even more incensed, the Brit opens the (electric) pocket door and hurries to the next car. Now temporarily alone, Bloodshot opens a new search screen.  76. Types in the name: “Nick Baris.” The browser responds with a PINWHEEL ICON. Bloodshot rolls his eyes. Taps the tray-table impatiently -- ON SCREEN: Search results return. News articles. Click -- SERIES OF QUICK CUTS: Photos of Baris. Tommy Lao. Freidrich Leipzig. All of them from Bloodshot’s memory. A couple of bars of Led Zeppelin punch through like a broken record. GUNSHOT RIPS US BACK TO: Bloodshot, in shock. His own past is in doubt. More than that, this is a man who suddenly   doesn’t know quite who he really is . Slowly, carefully, and full of hopes and fears, Bloodshot enters a new name into the search bar -- “Gina Garrison.” He hits ENTER. Nail-biting seconds go by. Bloodshot stares at the screen. Finally, the results. And the top result leads to a Facebook personal page...  Gina Garrison  Relationship Status not l",
      "dialogue_count": 0,
      "word_count": 880
    },
    {
      "scene_number": 11,
      "slugline": "INT. TRAIN STATION SHOPPING DISTRICT - DAY  At a window for a fashionable clothing store, a mannequin sports a stylish yet masculine OUTFIT, with a longcoat. Bloodshot admires it. Checks his pockets.  INT. ATM STATION - MOMENTS LATER  Bloodshot steps up to the cash machine. He puts his hand on the number pad and squints. The screen changes to read: “TEST MODE.” And then: “TESTING DISPENSER.” Euro bills start coughing out at him.  INT. TRAIN STATION SHOPPING DISTRICT - DAY  Bloodshot walks out of the store in new clothes. The mannequin is now nude in the window.  INT. PARKING GARAGE - DAY  A sleek Tesla sport model is parked in the charging station outside the train terminal. Bloodshot steps up to the door. He snaps his fingers. And the lights wink. The doors unlock. Bloodshot grins.  EXT. AUTOBAHN - DAY  The electric sedan RIPS PAST US at 120MPH.  INT. COMMAND HUB, RISING SPIRIT - NIGHT  Harting debriefs Chainsaw Gang via video conference -- HARTING Our dog is off his leash. Soon as he does a little homework, he’s going to Florence.  INT. RST GULF STREAM - INTERCUT WITH ABOVE  KP looks uneasy... TIBBS What’s the play?  79.",
      "characters": [],
      "action_text": "HARTING Bring him back. In pieces, if you have to. TIBBS Gonna be hard with that healing factor -- HARTING That EMP scrambled his system. Any of his higher functions will be inactive. He’s not as tough as he was. TIBBS And if he gets to her before we do? Harting considers the question...   point of no return.  HARTING Then she’s a liability. Harting signs off. Tibbs glances at KP -- from the look on her face, it’s not clear if she agrees. TIBBS There a problem soldier? KP No, sir. So Long smiles from ear to ear -- SO LONG Saddle up.  EXT. LANGLEY CIA HEADQUARTERS - DAY  Establishing. The nexus of international intelligence. DEPUTY DIRECTOR CARVER (V.O.) (pre-lap) Let’s get moving.  INT. “STAR CHAMBER” CONFERENCE ROOM  This room is designed for secret meetings. Kozol stands before a room of SEATED CIA DIRECTORS, all past their 40s; white men in expensive suits and cheap morals. KOZOL Project Bloodshot is nearly ready for delivery. You’ll get your prototype soon. DIRECTOR WILLIAMSON How do we know you aren’t already using it for your own purposes?  80. The most heavyset of the Directors (BURKE) rolls his eyes and finally leans in, holding a file folder: CHIEF DIRECTOR BURKE We know that answer already. Burke lays down SURVEILLANCE PHOTOS from the folder, arranged so Kozol can see them all: They show Bolshoi Port in the wake of the EMP burst. The carnage on the deck of the cargo ship. And finally: Bloodshot lying on the roof, red circular scar aglow as he fades out. CHIEF DIRECTOR BURKE (CONT’D) And you’ve been taking him for joy rides. Killing off the competition. KOZOL It’s called “field testing.” CHIEF DIRECTOR BURKE This sort of exposure is what we don’t want. It was part of the deal, you know, when we gave you four point two billion dollars to go make this happen. DEPUTY DIRECTOR CARVER And now it’s worse than that -- you’ve lost him. This is not like crashing a stealth bomber in Beijing. Bloodshot is a game- changer. This gets to the wrong people, I don’t care wh",
      "dialogue_count": 0,
      "word_count": 4785
    },
    {
      "scene_number": 12,
      "slugline": "INT. INFUSION LAB ENTRY - MOMENTS LATER  Bloodshot sees the elevator rising to his floor -- BLOODSHOT POV: And on one of the security camera windows in his mind’s eye, the elevator is packed with a SECURITY TEAM in full armor, assault rifles, and grenades. DING! The elevator doors slide open -- a SOLDIER steps out in the lead with a ballistic shield, leading the rest -- -- and Bloodshot strikes from above, having clung to the ceiling overhead -- punching and kicking while they’re all bunched up and too close to fire -- Some get a few bursts off but the rounds chew right through Bloodshot and wind up killing TEAMMATES behind him until -- Boom, the last goes down. Bloodshot’s surrounded by bodies. But now there are sounds of the Chainsaw gang approaching from the stairwell. Only one way to get past: the infusion lab. Bloodshot puts a grenade to the lab doors on the handle and pulls the pin. He then looks around for somewhere to find cover -- oh shit, there’s nowhere to hide really -- BLOODSHOT Ah hell -- He grabs the ballistic shield and crouches behind it, then is BLOWN BACK when the grenade detonates in a fiery explosion.  INT. INFUSION LAB - MOMENTS LATER  Fire and smoke and alarms. But where is -- oh here he comes: Bloodshot walks through the wall of flames... emerging on the other side ON FIRE, like some demon stepping out of hell... ...but then the nanites are so good at healing him, the fire actually snuffs out as he strides for the exit. A faint ringing CHIRP from Bloodshot’s head, then: BLOODSHOT Tell me you’re here.  EXT. RISING SPIRIT - NIGHT  Sitting in a white, unmarked van outside -- none other than that crazy Russian ALEXI KRIEGER. Into his phone:  102.",
      "characters": [],
      "action_text": "KRIEGER Waiting outside. Parking is terrible. You on your way down? INTERCUT BLOODSHOT Not yet. With that, Bloodshot is on the move again.  INT. CORRIDOR  Chainsaw emerges from the freight elevator... TIBBS (INTO COM) Place is on fire, Doc. He won’t last long. HARTING’S VOICE (THROUGH COM) If he destroys more property in there, neither will you.  INT. SUB-BASEMENT  Bloodshot’s surrounded by flames... but he’s nonplussed, kicking at the exit doors, breaking the lock. Suddenly -- GUNSHOT. His shoulder explodes with inky black blood. Direct hit from:  TIBBS  Near the entrance -- smoke obscuring his view -- TIBBS’S POV: Bloodshot’s thermal image is clearly visible. Trigger squeeze -- BULLET POV -- ROCKET towards --  BLOODSHOT  Nearly takes another hit. He closes his eyes -- exhales -- ENDOSCOPIC SHOT: Bloodshot’s heart -- nanites slow the blood flow so that his body cools and -- TIBBS’S POV: Bloodshot’s thermal image disappears. Tibbs turns to KP and So Long -- TIBBS We’re going in. SO LONG Oorah.  103. So Long stomps forward in his exoskeleton, pulls down his skull-shaped ballistic face mask. KP’s not nearly as gung-ho.  DEEPER IN THE LAB  Bloodshot hides. Suddenly -- he hears an high-pitched whine -- WHAM -- Bloodshot gets HAMMERED by So Long’s sound cannon. The big man STOMPS forward through the smoke -- looking like a mechanical monster from hell. SO LONG Ready to end this dance? The sound cannon WHINES -- then fires again -- BASHING Bloodshot against the wall. Just as he lifts his head -- KP steps in and fires a bioweapon capsule -- it misses -- -- and the capsule hits a WALL, eating through it like acid. BLOODSHOT You don’t have to do this... KP I’m doing my job. BLOODSHOT Is it your job to murder innocents? Like my wife? This is what’s been weighing on KP’s conscience... Bloodshot tries to crawl away... So Long stalks after him -- SO LONG Know what’s funny? All you cared about was getting the guy who killed your old lady... Sound cannon FIRES again -- Bloodshot d",
      "dialogue_count": 0,
      "word_count": 3466
    }
  ]
}