{
  "slug": "blue-ruin-2013",
  "title": "blue ruin",
  "genre": "action",
  "format": "film",
  "scenes_count": 26,
  "characters_count": 0,
  "characters": [],
  "total_words": 19769,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. SUNNY HOUSE - DAY 1   1  A spacious 2nd floor of faux paint and crushed sea shells. A TV REMOTE with a shit-ton of buttons. Behind it, a FLAT- SCREEN squawks to an empty room. A SNACK PLATE and EMPTY CUP sit atop a kitchen island. PUSHING PAST a BIN of CHILDREN’S TOYS, down a hallway filling with STEAM... INT. BATHROOM - SUNNY HOUSE - DAY 2   2  THE STEAM swirls around the spa-like interior. A PLASTIC COMB rests between HIS AND HER SINKS, under EMPTY TOWEL RACKS. Buried within the aquatic echo-chamber, FAINT CRUNCHING. The faucet SQUEAKS OFF. DRIPS resonate from behind the shower curtain. Through a cracked window, an OCEAN BREEZE swallows the steam. A CAR STEREO attacks and decays. Then quiet. The shower SQUEAKS ON and the STEAM retakes the room. ANOTHER NOISE. The water SQUEAKS OFF and the shower curtain yanks back, revealing a BEARDED MAN (36) with sun-baked skin, alarmed but motionless. Muffled, through walls: TIRES ON GRAVEL. THE THUMP OF CAR DOORS. ON THE BEARDED MAN: FIGHT-OR-FLIGHT... INT. FOYER - SUNNY HOUSE - DAY (MOMENTS LATER) 3   3  A FAMILY spills through the door (FATHER, MOTHER, weighed down with GROCERIES and TWO YOUNG DAUGHTERS running wild)- a wonderful cacophony disrupting the quiet. INT. KITCHEN - SUNNY HOUSE - DAY (CONTINUOUS) 4   4  The FATHER places REALTOR’S HOUSE KEYS on the island counter, beside the SNACK PLATE... FATHER  Hey! QUIET...",
      "characters": [],
      "action_text": "The WIFE turns from the THERMOSTAT and hushes the kids. The TV IS AUDIBLE. The Father sidesteps into the hallway, seeing DISSIPATING STEAM DRIFT FROM THE BATHROOM. FATHER (CONT’D) Honey. AMANDA. Take them back to the car. Call 911. The Wife corrals the girls as the Father DRAWS FROM A WOODEN KNIFE BLOCK SET, creeping down the hallway... MOTHER (urgent whisper) Eric! What are you doing? FATHER (bluffing a threat) I’VE GOT A DOG! DAUGHTER (O.S.) There’s a dog?! Nearing the bathroom threshold, the Father tightens a two- handed grip around his weapon, realizing he’s selected a ROUNDED STEEL SHARPENER from the knife block. HE SLIPS TO THE HARD WOOD FLOOR, landing torso upright with a SHARP BREATH. A Daughter breaks free as the Mother fumbles her purse. The Father’s lower vantage reveals A TRAIL OF WET FOOTPRINTS LEADING TO THE BACK OF THE HOUSE. His daughter runs past GIGGLING, following the footprints. FATHER ELLA! NO! Dammit... INT. BACK BEDROOM - SUNNY HOUSE (CONTINUOUS) 5   5  Her Father in pursuit, the Daughter crosses the carpeted room and pokes her head through an open window. EXT. BACKYARD - SUNNY HOUSE - DAY 6   6  FROM ABOVE: The Bearded Man runs naked clutching a wad of clothes, disappearing into an alleyway.  2. ON THE WINDOW: The daughter watches nonchalantly until her father scoops her up. EXT. ALLEYWAY - DAY 7   7  Obscured through CLOTHESLINES and fencing, the Bearded Man jogs to a stop and steps into his worn khakis. CLACK. He squats and rises, inspecting his PLASTIC COMB, now speckled with sand. He blows it clean. EXT. STREET - BEACH BLOCK - DAY 8   8  Dressed but damp, the Bearded Man drips a trail up the sandy walkway, anxiously combing his hair. He moves against beach traffic past modern condos, older bungalows and monstrous resort homes. EXT. MAIN DRAG - DAY 9   9  The Bearded Man sheaths his comb and turns down a walkway leading to a SMALL TOWN POLICE STATION. INT. POLICE STATION - DAY 10   10  The Bearded Man opens the door for an exiting PATROL O",
      "dialogue_count": 0,
      "word_count": 1313
    },
    {
      "scene_number": 2,
      "slugline": "EXT. BOARDWALK - AFTERNOON 20   20  THROUGH A LONG LENS: Distorted by rising heat from the crowded boardwalk planks, the Bearded Man offers something in his hand to several PASSERS-BY. He is ignored. EXT. FUNLAND - LATE AFTERNOON 21   21  ON THE ‘FUNLAND’ TICKETS: six are ripped from the book. A TICKET-TAKER seats the Bearded Man in a suspended track ride-car and secures the lap bar. The ride-car lurches forward and up through hydraulic HAUNTED MANSION DOORS with a BLAST OF PIPE ORGAN MUSIC... INT. HAUNTED MANSION RIDE - FUNLAND - AFTERNOON 22   22  The Bearded Man RUMBLES PAST A MIRROR MAZE, BOBBING SKULLS, HOWLING WEREWOLVES, A MISTY GRAVEYARD... A STROBE flashes. EXT. HAUNTED MANSION RIDE - BOARDWALK - AFTERNOON 23   23  THE EXIT DOORS HISS OPEN: The Bearded Man squirms from the ride-car before the ATTENDANT can lift the lap bar. A GHOULISH LAUGH through crackling speakers. EXT. ‘WHAC-A-MOLE’ BOOTH - FUNLAND - AFTERNOON 24   24  The Bearded Man SLAPS the ticket book on the counter of a WHAC-A-MOLE amusement game. A LUCKY KID snatches it up. EXT. BEACH INLET - EVENING 25   25  The Bearded Man CASTS A ROD AND REEL from the surf, his SATCHEL over his shoulder. EXT. VACANT LOT - NIGHT 26   26  By the light of a MAKESHIFT HEAD-LAMP, the Bearded Man FILLETS A BLUEFISH with a CORK HANDLED FISHING KNIFE.  7.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 229
    },
    {
      "scene_number": 3,
      "slugline": "EXT. STREET - BAYSIDE - PRE-DAWN 27   27  ‘O-Dark-thirty’. A COMPACT CAR drifts by upscale homes, tossing out NEWSPAPERS. INT. BONNEVILLE - VACANT LOT - DAWN 28   28  Cast in deep blue light diffused through dew-covered windows, the Bearded man lies curled in the back seat. TIRES CREEPING ACROSS SANDY ASPHALT. THROUGH THE DRIVER’S SIDE WINDOW, abstracted by moisture, POLICE LIGHTS roll in. A CAR DOOR opens and shuts. A BLURRY FIGURE approaches the Bonneville and KNOCKS. The Bearded Man rises, waiting with blinking eyes. FEMALE VOICE (O.S.) It’s officer Eddy. He flips the lock and pushes the door open for OFFICER EDDY, the Female Officer from the police station. OFFICER EDDY I’d like you to come in to the station. BEARDED MAN Is this about the house? I coul- ON A WIDE OF THE SCENE: OFFICER EDDY Dwight, sweetheart, I’ll explain. Just come with me. INT. POLICE CRUISER (MOVING) - EARLY MORNING 29   29  The Bearded Man, DWIGHT, stews in the back of the cruiser. FLASHING THE CRUISER’S TURRET, Officer Eddy coasts through a red light and turns off the road. OFFICER EDDY How ‘bout some breakfast? EXT. DRIVE-THRU RESTAURANT - EARLY MORNING 30   30  The cruiser rolls under a canopy up to a DRIVE-THRU WINDOW. The SPEAKER CRACKLES.  8.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 212
    },
    {
      "scene_number": 4,
      "slugline": "INT. POLICE STATION - EARLY MORNING 31   31  A SKELETON CREW works to the HUM of vending machines and a few SLURRED OUTBURSTS from the drunk tank. Officer Eddy guides Dwight past empty desks and down a hallway, carrying a TAKE-OUT BAG and NEWSPAPER. INT. BREAK ROOM - POLICE STAION - MORNING 32   32  Officer Eddy seats Dwight at a kitchenette table and pulls boxed food from the bag. OFFICER EDDY I apologize for the mystery- I don’t mean to scare you. You’re not in any trouble, everything’s fine- She winces into a solemn, regretful grin. Dwight settles into his seat as she takes hers. OFFICER EDDY (CONT’D) - you’ll   be fine. Oh, see, I just don’t know exactly how to handle this. And I know I’m not to bring this up- but, honey, someone brought this to our stoop. (unfolding the newspaper) I just thought you should be somewhere safe when you found out. Dwight suppresses a rush of realization. OFFICER EDDY (CONT’D) With somebody... She slides the newspaper across the table. He pulls it close without laying eyes on it. His attention shifts to a WALL CALENDAR hanging behind her. OFFICER EDDY (CONT’D) He’s going to be released. I’m not sure how much you... I just need you to know that you’re safe and that you can let me know whatever you   need.   They   are   missed.   It’s   an awful thing he did   to them. I’m just   going to hold   you   here   for   a   little   bit,   let   you   breathe. And who knows? This might even be an opportunity... HER VOICE WASHES INTO CARDIOVASCULAR PULSING. DWIGHT’S FACE GOES SLACK.  9.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 271
    },
    {
      "scene_number": 5,
      "slugline": "EXT. STREET - BEACH BLOCK - LATE NIGHT 33   33  Dwight takes the center of a residential street, moving numbly through pools of orange light, the NEWSPAPER in hand. COLLEGE KIDS watch him from a outdoor hot tub. Their mouths are moving, but Dwight hears no voices. EXT. BEACH - ATLANTIC OCEAN - SUNRISE 34   34  Dwight takes a solitary swim in the Atlantic. And goes under for a long time... EXT. SUPERMARKET - MORNING 35   35  Aluminum and glass CLANK into a self-serve RECYCLING MACHINE. INT. SUPERMARKET CHECKOUT - MORNING 36   36  Dwight hands a RECEIPT to a CASHIER and sets a ‘DE, MD, VA’ ROAD MAP on the counter. He looks half-dead. EXT. BONNEVILLE - VACANT LOT - DAY 37   37  Dwight pops the lid off a rusted coffee can from his trunk. He adds a handful of SMALL BILLS to the modest stash. He pulls out a GAS CANISTER and sets it down. ...opens the driver’s side door, pops the gas and the hood. ...shakes the canister, empties it into the tank. ...walks an 8” cube wrapped in plastic bags from the trunk to the hood. ...peels away the plastic bags, revealing a CAR BATTERY. ...props the hood open, sets the battery in the tray and secures the connections. INT. BONNEVILLE - VACANT LOT - DAY 38   38  Dwight places the map on the seat and turns the engine over. Beside the map is THE NEWSPAPER. An article is titled:   ‘97 PLEA DEAL MANDATES VA DOUBLE MURDERER FREED .  10.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 254
    },
    {
      "scene_number": 6,
      "slugline": "EXT. BONNEVILLE - VACANT LOT - DAY 39   39  HALF-FLAT FRONT TIRES roll back, breaking free of overgrown grass. The car reverses out of the sandy lot onto the street. EXT. FOOD MART / GAS STOP - DAY 40   40  A general store with a fueling station. Dwight presses a HISSING AIR HOSE to a tire, behind him a display of colorful rafts and floatation devices. He moves to the next tire. INT. PAWN SHOP - AFTERNOON 41   41  HAND GUNS LAID ON VELVET, behind thick glass. TAGS tied to the trigger guards are marked from   $180-$700 . Dwight thumbs his cash and pockets it, surveying the shop: florescent lights, drop ceiling and linoleum. He drifts along the gun displays, spotting HIMSELF ON A SURVEILLANCE MONITOR atop a stack of VHS DECKS. He locates the security camera and turns to the WOMAN behind the register. She glances under the counter and stares back hard. Dwight approaches. She steps closer to the counter. He stops at the register and spins a CAROUSEL OF POSTCARDS. DWIGHT Do you sell stamps? WOMAN I do. But those ones have postage included. INT. BONNEVILLE - CURBSIDE - AFTERNOON 42   42  CLOSE-UP, POSTCARD: OUT OF FOCUS TEXT, a BALLPOINT PEN hovers above in contemplation... In crude script: ‘ Your brother, ’ A WIDER VIEW: The Bonneville idles beside a MAILBOX. Dwight signs his name and deposits the postcard.  11.",
      "characters": [],
      "action_text": "INT./EXT. BONNEVILLE - HIGHWAY - LATE AFTERNOON 43   43  Dwight drives a two lane highway bordered by corn fields and metal framed irrigation equipment. INT. BONNEVILLE - ROADSIDE VENUE - EVENING 44   44  CICADAS drown out THUMPING LIVE MUSIC. Dwight watches HEADLIGHTS SWEEP BY before exiting the car. EXT. BONNEVILLE - ROADSIDE VENUE - EVENING 45   45  A jumbo shack-themed bar for half-assed bikers. Dim light from the facade casts a warm edge onto the VEHICLES in the lot. Dwight walks along the cars, inspecting their contents. He tries a car door- LOCKED. He tries the next- UNLOCKED- and rummages inside, thrown off by the OVERHEAD INTERIOR LIGHT. Nothing. Another UNLOCKED DOOR. He SWITCHES OFF the interior light before searching. Nothing again. Cupping glass, Dwight checks the cab of a locked PICKUP TRUCK. He moves to ANOTHER TRUCK a few spots down with a ‘ NATIONAL ASSOCIATION OF RIFLE OWNERS ’ WINDOW DECAL. He spies something on the cab’s floor, angling his head for a better view. He circles around and tries the other door- LOCKED... AND A LOUD FUCKING ALARM. Dwight flees, nearly tripping over a ROCK- he snatches it up, does an about face and SMASHES it through the cab window. He reaches through the jagged glass and unlatches the door, pulling a SMALL PLASTIC CASE from under the seat. THE LIVE MUSIC SURGES as a COWBOY exits the bar holding a KEG CUP, wresting his keys from his tight jeans. Dwight dives behind his car, panicking across the dirt. The COWBOY aims his keys at the BLARING truck. TWO QUICK HONKS and the ALARM IS SILENCED. The Cowboy heads back inside with a BELCH.  12.",
      "dialogue_count": 0,
      "word_count": 512
    },
    {
      "scene_number": 7,
      "slugline": "INT. BONNEVILLE (MOVING) - STATE ROAD - EVENING 46   46  Dwight rolls up his window. DUST SETTLES as he checks the rear view and opens the case beside him: BINGO- A SNUB-NOSED REVOLVER fitted in foam with SIX .357 CARTRIDGES. He lifts the weapon, noticing a HEAVY DUTY TRIGGER LOCK. EXT. SCENIC OVERLOOK - MORNING 47   47  MUTED, RHYTHMIC CRACKING ECHOES through the river valley. The Bonneville is parked alone in the lot, below tall trees and rock formations. WATER RUSHES nearby. There’s a small PLAQUE for tourists, a rustic TRASH BIN and PORTA-POTTIES. EXT. NATURE TRAIL - SCENIC OVERLOOK - MORNING (CONTINUOUS) 48   48  Dwight SMASHES THE REVOLVER’S TRIGGER LOCK WITH A TIRE IRON. He assesses the damage- very little. He places the gun on a rock and pounds with more and more might and less and less control, following it with wild swings into the dirt. THWAP, THWAP, CRUNK. The metal gives. He dusts off the gun- it’s broken in several places, the TRIGGER LOCK STILL INTACT. EXT. SCENIC OVERLOOK - RUSTIC TRASH BIN - MORNING 49   49  TRACKING WITH DWIGHT, marching in disappointment towards the trash bin. He watches a HYBRID SUV pull in with a half- hearted smile and nod. He discretely deposits the broken gun, returning to the Bonneville as the SUV DRIVER (40), fit and wearing fleece, hops out with a LEASH and a LATTE. A DOG BARKS from the SUV as Dwight pulls out. EXT. WINDING ROAD- BONNEVILLE - AFTERNOON 50   50  The Bonneville weaves between eastern foot-hills. EXT. INTERSECTION - DUSK 51   51  A shadowed ROAD SIGN against a waning blue sky. HEADLIGHTS illuminate it: ‘ PRISON AREA: HITCHHIKING PROHIBITED ’  13.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 281
    },
    {
      "scene_number": 8,
      "slugline": "INT. BONNEVILLE - STATE PRISON LOT - EARLY MORNING 52   52  Soft morning light. Dwight sits with predatory stillness. EXT. STATE PRISON LOT - EARLY MORNING (CONTINUOUS) 53   53  The Bonneville is parked a few rows from the lot’s edge with a view of the prison gate. Rising behind it is high fencing, razor wire and concrete. INT. BONNEVILLE - STATE PRISON LOT - DAY (HOURS LATER) 54   54  Midday sun beams into the car. The PATTER OF LIQUID FLOWING INTO PLASTIC. Dwight is hunched in his seat, eyes to his lap. EXT. BONNEVILLE - STATE PRISON LOT - DAY 55   55  LOW ANGLE OF TIRES AND GRAVEL, the prison visible between the ground and the car chassis: the driver’s side door opens and urine pours from a plastic bottle onto the gravel. A large sedan pulls into the lot. INT. BONNEVILLE - STATE PRISON LOT - DAY 56   56  Dwight tugs his door closed, observing THROUGH THE WINDSHIELD: An early ‘90s model WHITE STRETCH LIMOUSINE parks in the spot closest to the prison gates. ON THE DOOR: ‘ CLELAND LIMOUSINE ’ From the far side, A MAN and a WOMAN step out for cigarettes, the engine idling. Dwight half turns the keys in the ignition and rolls down the passenger side window. Their VOICES compete with MUSIC emanating from the limousine, their smoke puffs drift into the wind. Dwight pulls his satchel from the floor and rests it on the passenger’s seat. EXT. STATE PRISON LOT - DAY (LATER) 57   57  LOUDER MUSIC and LAUGHTER from behind the closed doors of the limousine. Dwight’s Bonneville hasn’t moved.  14.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 270
    },
    {
      "scene_number": 9,
      "slugline": "INT. BONNEVILLE - STATE PRISON LOT - DAY 58   58  Dwight squints at the prison entrance. An INMATE (42, white male) is being escorted out by a CORRECTIONS OFFICER. The inmate struts in prison issued slacks and shirt, carrying a cardboard BOX. He’s tattooed up his arms and neck, strong but with a gut. Dwight is frozen. THE FAMILY exits the limousine with a brief BLAST OF MUSIC. The TEDDY (45), stocky in casual preppie attire, hops back inside the driver’s seat to lower the volume. There’s CARL(39), wiry and tattooed in baggy clothes, CHRIS (46), scornful with teased, dirty blond hair, and HOPE (42), tight pony-tail and a dark, chiseled face. A BOY (14), lanky with hand-me-down clothes, scoots to the edge of the back seat, slouched over a HAND-HELD VIDEOGAME CONSOLE. The corrections officer hands the inmate a white envelope and heads back with PARTING WORDS. The Family Members circle the Inmate. Chris motions for the Boy to greet the Inmate, but he refuses. She power-walks over and grabs the Boy around the biceps. He shakes her off, retreating into the car as she palms his chin and shoves it back. They all pile back in the limousine. Dwight starts his car. INT./EXT. BONNEVILLE (MOVING) - HIGHWAY - DAY 59   59  ON THE REAR OF THE SPEEDING LIMOUSINE, FROM THE HOOD OF THE BONNEVILLE, several car lengths back. CHRIS rises from the SUNROOF with a PLASTIC CUP in hand. She flinches as airborne debris blows into her eye, the cup goes flying as she awkwardly ducks below. INT. BONNEVILLE (MOVING) - HIGHWAY - DAY (CONTINUOUS) 60   60  The cup CLACKS PAST Dwight’s vibrating car. He checks the speedometer. They’re averaging 83 MPH.  15.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 286
    },
    {
      "scene_number": 10,
      "slugline": "EXT. HIGHWAY BAR - DAY 61   61  The limousine pulls into the dirt lot of a single story stucco bar. The only other vehicle is a TRUCK FOR SALE. The Bonneville whips past, maintaining course. INT. BONNEVILLE (MOVING) - HIGHWAY - DAY 62   62  Watching his rearview, Dwight slows to a stop on the shoulder. P.O.V. (DWIGHT): HOPE yanks up a metal entrance gate, a PADLOCK in her hand. The Family follows her into the bar. ON DWIGHT as he rolls out into a wide U-turn. EXT. HIGHWAY BAR - DAY 63   63  Dwight pulls the Bonneville up a grassy incline beside the limousine and cuts the engine. INT. BONNEVILLE - HIGHWAY BAR - DAY (CONTINUOUS) 64   64  Dwight has a look around the car cabin and UNZIPS the satchel. He slides SOMETHING into his pant pocket. He closes his eyes. Then yanks the keys. EXT. HIGHWAY BAR - DAY 65   65  Dwight steps from the Bonneville, looping his key chain around his neck and tucking it into his shirt. TRACKING WITH DWIGHT as he shuts the door and walks unsteadily around the side of the building. A SOUND SYSTEM inside the bar cycles through RADIO STATIONS. Muffled, celebratory VOICES lure Dwight towards the back. He tries a side door near a dumpster. Locked. A DOOR SPRING. A WOMAN’S VOICE. A CLINKING CHAIN. Dwight follows the wall towards the sound, peeking one eye beyond the edge of the building. Hope is crouched by the rear entrance, opening cellar doors as the Teddy rolls a BEER KEG from a gated cold-storage unit.  16.",
      "characters": [],
      "action_text": "Dwight rotates out of sight, his back to the wall. OLDER TEDDY (O.S.) Stop breathing out your mouth. HOPE (O.S.) Yeah, if you stop talking out your ass. Putting him on your books- they’ll   be   looking   at   you   if   he fucks up even once-   and it won’t   be on me... Dwight TUNES OUT, drawn to a DISTANT RUMBLE above. IN THE SKY: a drifting contrail in the wake of a jet... The cellar doors swing SHUT. Dwight pivots around the corner- they’re gone. He slips inside the back door. INT. HALLWAY - HIGHWAY BAR - DAY (CONTINUOUS) 66   66  From bright daylight into a black cave. AUTO-TUNED RAP SWELLS as Dwight navigates the memorabilia- lined hallway, his eyes adjusting to the darkness. TRACKING BEHIND DWIGHT, as he reaches in his pocket and pulls out the CORK HANDLED FISHING KNIFE. He passes the kitchen, steadying himself against the wall, nearly knocking off a framed picture. He presses his hand to a door and it swings open... INT. BATHROOM - HIGHWAY BAR - DAY (CONTINUOUS) 67   67  It’s a cramped, dingy-tiled bathroom bisected by a narrow walkway. On one wall: two stalls and a trash can. On the other: two urinals and a stickered-up mirror mounted above a porcelain sink. Dwight crosses the walkway and turns to face the door. He adjusts the blade in his hand. The MUSIC lowers, then blasts LOUDER. ON DWIGHT, inching towards the door- VOICES from just beyond it stop him short.  17. The Convict and Carl push through the door, drinking from plastic cups. CONVICT Naw, man- she just talks too much. Shit- I ain’t used to that. CARL She talks shit, or she just talks too much? IN THE FAR STALL, Dwight stands silent, shadowed. CONVICT (jokingly fed up) Motherfucker. The two men place their cups atop the urinals and relieve themselves. CARL What, me too? CONVICT Yeah, maybe just let me piss. Haven’t done it alone with four walls in over a decade. CARL Ha, dude. They share a bit of a laugh then urinate in silence. Carl Finishes up and ZIPS. CARL (CONT’D) Hey, man. You all right? CO",
      "dialogue_count": 0,
      "word_count": 1323
    },
    {
      "scene_number": 11,
      "slugline": "EXT. HIGHWAY BAR - DAY 72   72  WHISTLING WIND and QUIET ROCK. ON THE STABBED TIRE, as Dwight shuffles past. He rounds the limousine hood and tries the driver’s side door- UNLOCKED. INT. LIMOUSINE - HIGHWAY BAR - DAY (CONTINUOUS) 73   73  Dwight sits and scours for keys- the ignition...the visor. He digs in a console CUP-HOLDER and pulls out a set, turning them in the ignition as the bar door opens. LOUD, OFFENSIVE MUSIC emanates from the limousine’s stereo as Dwight shifts and hits the gas. EXT. LIMOUSINE - HIGHWAY BAR - DAY (CONTINUOUS) 74   74  ON THE STABBED TIRE, as it WHIRLS THE KNIFE. The limousine carves a wobbly path, kicking up DUST as the Family Members exit, confused, furious, bloody. Hope holds a PUMP SHOTGUN. Chris and Carl sprint after the limousine, shouting hysterically. INT. LIMOUSINE (MOVING) - HIGHWAY - DAY (CONTINUOUS) 75   75  Dwight’s face quivers with emotion, but he can’t quite cry. DOWN THE ROAD, about a quarter mile, there’s a CONCRETE BARRIER along a curve. MUSIC STILL BLASTS. ON THE SPEEDOMETER: from 50MPH to 70MPH. EXT. LIMOUSINE (MOVING) - HIGHWAY - DAY (CONTINUOUS) 76   76  The shredded tire DISINTEGRATES, only the rim remains, SHRIEKING METAL and SHOWERING SPARKS. INT. LIMOUSINE (MOVING) - HIGHWAY - DAY (CONTINUOUS) 77   77  Dwight TURNS OFF THE BLASTING RADIO. Relaxing now, with peace soon upon him, he maxes out the speed of the teetering sedan. HE CLOSES HIS EYES.  22.",
      "characters": [],
      "action_text": "In the relative quiet, A STEADY THUMPING IS NOW AUDIBLE. Dwight blinks aware, triangulating the source- it’s behind him, in the passenger compartment. VISIBLE BEHIND THE PASS-THROUGH WINDOW: THE BOY, BEATING AGAINST THE SOUNDPROOF GLASS, unnerved but composed. EXT. HIGHWAY - DAY 78   78  The limousine WHIRS to a stop amidst SMOKE AND DUST. Dwight exits the car, caked in blood, opening the rear-hinged passenger door like a zombie chauffeur. The BOY climbs out grasping his video game console, scurrying a safe distance before turning to face Dwight. They regard each other. Chris and Carl pant towards them, far in the distance. Dwight pushes the passenger door closed and turns away. BOY Did you hurt Wade? Dwight turns back, breaths some air. DWIGHT I did. Wade hurt my parents. BOY No he didn’t. He just helped out. The boy turns and walks the highway towards his relatives, their frantic YELLING LOST IN THE WIND. EXT. CONCRETE BARRIER - HIGHWAY - DAY 79   79  The limousine SPARKS past the barrier at sublethal speed. INT. LIMOUSINE (MOVING) - HIGHWAY - DAY 80   80  Dwight hangs in limbo, his adrenaline dumped. DWIGHT (under his breath) Silly...  23. INT./EXT. BONNEVILLE - HIGHWAY BAR - DAY 81   81  FROM INSIDE THE BONNEVILLE, Family Members congregate around Dwight’s vehicle. The MAP and the NEWSPAPER flap on the passenger’s seat. LOST IN THE BACKGROUND: Chris YELLS ABUSIVELY at the Boy. Carl burns testosterone with VOWS OF REVENGE. Closer to the Bonneville, inspecting the bullet holes... HOPE Was that the car? TEDDY Yep. HOPE You think he was alone? TEDDY Do we care? EXT. ROADSIDE DITCH - DAY 82   82  The limousine CARVES INTO A DITCH AND LANDS HARD. Dwight pops from the door, dismounts the SMOULDERING sedan and walks off towards a TREE LINE on the far side of an open field. EXT. WOODS - DAY 83   83  Dwight takes cover in the shade of trees. EXT. WOODS (DEEPER IN) - DAY 84   84  Dwight DRY HEAVES, nestled between limbs of a fallen oak. EXT. CREEK - WOODS - LATE AFTERNOON ",
      "dialogue_count": 0,
      "word_count": 1117
    },
    {
      "scene_number": 12,
      "slugline": "EXT. BASEMENT WINDOW - MCMANSION - NIGHT 97   97  Dwight circles from the porch to a basement window left ajar. He slides it shut and trots silently across the sodded lawn. EXT. TRUCK STOP - NIGHT 98   98  Dwight stuffs the bag of soiled clothes into a pebbled trash receptacle near the perimeter of a truck stop. Industrial lights cast a sick hue across the asphalt lot. BIG RIGS all over- CHUGGING on and off the highway, lining up for fuel, idling in an adjacent lot. Dwight heads for a filling station CONVENIENCE STORE. EXT. CONVENIENCE STORE - TRUCK STOP - NIGHT (CONTINUOUS) 99   99  Dwight clears the side of the store, stepping into the fluorescent lights of its facade and within yards of a parked STATE POLICE CRUISER. The STATE TROOPER is visible inside, paying for coffee. Dwight’s eyes track the Trooper as he exits the store and settles in to his cruiser. The Trooper throws Dwight a dismissive glance and starts the engine. Dwight steps closer with an awkward, expectant gaze. The Trooper backs out, reversing over to Dwight. STATE TROOPER (rolling down window) You alright, sir? DWIGHT Are... you looking for me? STATE TROOPER (halfhearted jest) Not unless you’re looking for trouble... A forced smile from the trooper, nothing in return from Dwight... STATE TROOPER (CONT’D) Okay then. You got ID?  27.",
      "characters": [],
      "action_text": "Dwight fishes in his pocket, pulls out a RUBBER-BAND WALLET and hands over a ratty ID. The trooper runs his name. STATE TROOPER (CONT’D) You have a vehicle here, Mr. Evans? You driving? DWIGHT Not right now, no. STATE TROOPER Good. This is a learner’s permit from... (inspecting the ID) ...nineteen ninety-seven. You got anything else? DWIGHT No, sir. STATE TROOPER Get this up to date. And I don’t want you hitchhiking in the meantime, alright? DWIGHT Okay. STATE TROOPER Have a safe night. INT./EXT. TRACTOR TRAILER (MOVING) - NIGHT 100   100  Dwight stares out from the cab of a truck, the DRIVER focused on the road ahead. CRACKLING COUNTRY MUSIC and RUSHING WIND. INT. LIVING ROOM - RANCH HOUSE -   MORNING 101   101  Two KIDS (4&6), watching TELEVISION. A DOOR BELL RINGS. A MOM (39) walks through, plucks CAR KEYS from a CERAMIC JAR atop a cluttered table and exits into the foyer. A DOOR floods daylight inside and she reappears with a BABY SITTER (30’s).  28. MOM (to the sitter) Bit of a late start- you mind moving the sprinkler into the bushes in about twenty minutes? BABY SITTER Sure, yeah. The Mom kisses her kids on the cheeks. MOM Then turn it off after fifteen. They painted Shrinky-Dinks last night- if you could put ‘em in the oven? I think three minutes at three-fifty- it’s on the box. EXT. RANCH HOUSE - MORNING 102   102  The Mom walks briskly from the modest, two-story home. A ‘FOR SALE’ SIGN is staked in the neat grass. Juggling her keys, purse and a file folder, she ducks behind a hedge and OPENS AN EXTERIOR FAUCET. INT. HATCHBACK - RANCH HOUSE - MORNING (CONTINUOUS) 103   103  The Mom slips into the car as water PATTERS across the windshield. She starts up, plops her purse and checks the REAR VIEW MIRROR. She waits for the passing sprinkler and rolls down her window... EXT. HATCHBACK - RANCH HOUSE - MORNING (CONTINUOUS) 104   104  ...She pops her head out towards the rear. MOM (friendly warning) Pulling out! Dwight, standing at the edge of her driveway, sidest",
      "dialogue_count": 0,
      "word_count": 619
    },
    {
      "scene_number": 13,
      "slugline": "EXT. HATCHBACK - RANCH HOUSE - MORNING (CONTINUOUS) 106   106  The Mom pops her head back out with a furrowed brow. MOM Dwight? DWIGHT Hi, Sam. The Mom, SAM, is quietly stunned. Dwight sets his bag down and cautiously approaches. SAM Dwight? He’s clean shaven, in respectable attire, his ill-fitting shirt tucked tight into his pants. SAM (CONT’D) (searching) ...You look good. His pained eyes, his BANDAGED AND BLOODY HAND. SAM (CONT’D) (shifting car into ‘park’) Or do you? WIDE SHOT: Dwight backs away as Sam swings open the car door and stands. A protracted silence, then a tentative embrace... ...the SPRINKLER TICKS ITS SPRAY onto them. SAM (CONT’D) Let me call work. She has another look and Dwight, starts untucking his shirt. SAM (CONT’D) ...sorry, but ‘no’ to this. INT. FAST FOOD RESTAURANT - MORNING 107   107  An independent version of Roy Rogers half full with LOCALS. At the register, Sam lifts a plastic tray, one shoulder bracing her phone. Dwight, seated, watches her approach. Two wrapped breakfast sandwiches slide in front of him atop the tray. Sam scoots into the booth across.  30.",
      "characters": [],
      "action_text": "SAM Wish I had more time, I’ve got an asset inventory that can’t push. Dwight absorbs the surreal setting. SAM (CONT’D) You need money? DWIGHT No, I - did you get my letter? SAM There haven’t been any letters. DWIGHT Sent it after I crossed the bridge- it was a postcard. SAM No. When? DWIGHT Couple of days ago. SAM Yeah, postcards take more time- Dwight, I’m not following... DWIGHT I sent it on my way to Deerfield. She leans with deep concern. SAM I know he’s out, if that’s why you’re here. D.O.C. sends a notification. And a restraining order. Let’s not... She trails off, unwraps her sandwich. DWIGHT You’re selling the house? SAM Have been. For two years. It’s not really a hot market here. I’ve gotten a better job since then... She bites into her sandwich. Not enjoyable. DWIGHT But you want to leave?  31. SAM The absolute second I can. DWIGHT Why can’t you? SAM Good god, Dwight. You want me to answer that? DWIGHT Sorry. It’s fine... (stretching jaw) I’m not used to talking this much. SAM Well, it’s what people do. DWIGHT I know. He unwraps his sandwich. It’s greasy and grey. SAM Do you? Wanna know what I do? Dwight kindly postures for a storm. SAM (CONT’D) I’m a secretary for a probate attorney. Dwight can’t ask. SAM (CONT’D) They settle estates. I knew so much about it, he hired me during the interview... (fighting tears) I couldn’t ‘just leave’. I fought  Uncle Steve   in court. He wanted the house. I got the IRS on him and he took off to the Philippines. I was holding on but there was nothing... (blowing a breath) So I married an asshole. He tried to take the house too. I probably should’ve let him... Dwight reaches for Sam’s hand. She pulls away, then takes hold of his.  32. SAM (CONT’D) Crap. I took us here so this wouldn’t happen. There’s way too much... DWIGHT I’m sorry I left. SAM I’m sorry too. (sniffs, wipes) For this busted sandwich. DWIGHT I’ve had worse. They behold their sandwiches. SAM As far as the estate- you’re still owed twenty eight hundred dolla",
      "dialogue_count": 0,
      "word_count": 1700
    },
    {
      "scene_number": 14,
      "slugline": "INT. NURSERY - RANCH HOUSE - NIGHT 121   121  The flashlight beam pushes through the door and sweeps low, settling on an ATTIC DOOR in the wall. Dwight unlatches it and pulls, inspecting faded PENCIL SCRAWLINGS that once transformed the inside panel into a spaceship cockpit. He crawls into the dark and drags out a CARDBOARD BOX. He pulls out a shoebox, paper stacks and a dusty yearbook bound in blue leather. Leafing through the pages, he- THE HUM OF AN ENGINE echoes quietly through the house. He sets the yearbook down and kills the flashlight. INT. STAIRCASE - RANCH HOUSE - NIGHT 122   122  Dwight descends the stairs, old wood CREAKING underfoot. INT. LIVING ROOM - RANCH HOUSE - NIGHT 123   123  Dwight floats to the window, LOOKING OUT: THE BONNEVILLE IS PARKED A FEW DOORS DOWN, ACROSS THE STREET. DWIGHT Shit. There’s SHAPES within the car, hard to make out. ON THE BONNEVILLE: A FLICKER WARMS CARL’S FACE as he lights a smoke, its ember lingering in the dark. ON DWIGHT: Reaching for the garden weeder propped against the wall: IT SLIPS FROM HIS GRASP, SCRAPES THE WALL AND CLUNKS TO THE FLOOR. He grimaces, frozen with anticipation... ON THE BONNEVILLE: The ember is snatched and tossed out by the driver’s silhouette, ORANGE SPARKS bounce from the curb. INT. DINING ROOM - RANCH HOUSE - NIGHT 124   124  Dwight grabs the weeder, crossing the foyer into the adjacent dining room. He settles by a window closer in and waits.  40.",
      "characters": [],
      "action_text": "No movement from the car. His eyelids grow heavy. AMBIENT SOUND BUILDS TO A STING. CUT TO: INT. DINING ROOM - RANCH HOUSE - NIGHT (LATER) 125   125  Dwight opens his eyes. BACK TO CRICKETS. ON THE BONNEVILLE: NOW TWO GLOWING EMBERS. INT. STAIRCASE - RANCH HOUSE - NIGHT 126   126  Dwight sets the weeder down and CREAKS his way upstairs. INT. FRONT BEDROOM - RANCH HOUSE - NIGHT 127   127  Keeping low, Dwight grabs bed pillows and positions them under the sheets to emulate a person. He crawls to a bedside table and reaches up into a lamp shade... EXT. RANCH HOUSE - NIGHT 128   128  FROM OUTSIDE, the bedroom window WARMS WITH LIGHT, now a beacon in the dark. INT. BATHROOM - RANCH HOUSE - NIGHT 129   129  Dwight crawls into the bathroom, craning to FLICK ON THE LIGHT. He twists the SINK FAUCET ON. Backing out, he sets the door open a crack. INT. DINING ROOM - RANCH HOUSE - NIGHT 130   130  AN EMPTY DOOR FRAME. CREAK, CREAK, CREAK... Dwight slinks in and takes position by the window. THROUGH THE WINDOW: THE BONNEVILLE SITS EMPTY ON THE STREET. The front door handle CLICKS. A TUG tests the lock. Dwight’s eyes dart around. He walks to the foyer, listening, winding up the garden weeder... The CLINK of a fence latch from the side of the house.  41. He double backs to the dining room, hugging the wall to a side window... THROUGH THE WINDOW: A fenced, narrow side yard filled with junk, shadowed by the BLUE LIGHT OF A BUG-ZAPPER. Teddy moves through shadows with a SPORTING SHOTGUN. Dwight can hear his own pulse. He backs into the foyer. INT. LIVING ROOM - RANCH HOUSE - NIGHT (CONTINUOUS) 131   131  Dwight peers through the living room into the kitchen: TEDDY APPEARS THROUGH THE BACK DOOR WINDOW, WRAPPING A BANDANA AROUND HIS KNUCKLES. FUCK. Dwight heads to the front door, slowing his pace to appease THE SQUEAKING FLOOR. FROM THE KITCHEN, A MUFFLED POP, SPRINKLING GLASS... He squats to the door, surgically unlatching the lock. CLICK. FROM THE KITCHEN, A few more TAPS, CLINKING GL",
      "dialogue_count": 0,
      "word_count": 1723
    },
    {
      "scene_number": 15,
      "slugline": "INT. EMERGENCY ROOM - MORNING 147   147  SLIDING AUTOMATIC DOORS PART FOR DWIGHT. He strides in, pale and damp with sweat. A TRIAGE NURSE looks up from her computer. DWIGHT (depleted) ‘Scuse me. I have a question. Maybe a little goofy... TRIAGE NURSE Sure. DWIGHT Do you need- are you required- to report arrow wounds? Like an accident- hunting accident. With buddies. Alone, actually... TRIAGE NURSE Sir, do you need medical assistance? DWIGHT Just, um...yeah. A little hunting accident- my hip. Do you need to report it, if it’s self-inflicted ...by mistake? TRIAGE NURSE I’d have to check with the charge nurse, sir. I’ve never handled- DWIGHT COLLAPSES TO THE LINOLEUM. INT. HOSPITAL ROOM - LATE AFTERNOON 148   148  Dwight’s eyes flutter open. They close again in feigned sleep as a NURSE steps close, checking his CHART. He waits for her to walk off then lifts his gown to inspect THE WOUND: IT’S PROPERLY STITCHED AND DRESSED. There’s a wall mounted light box with an X-RAY OF HIS INJURY. There’s a bin of BLOODY POST-OP CLOTHES. He pulls TAPE and TUBING and NEEDLES from his arms.  47.",
      "characters": [],
      "action_text": "EXT. HOSPITAL - LATE AFTERNOON 149   149  Dwight climbs out a window wearing his bloody clothing, now HANGING FLAPS OF SURGICALLY CUT FABRIC. EXT. BENEATH A BRIDGE - LATE AFTERNOON 150   150  MOVING WITH DWIGHT, as he walks under a secluded railroad bridge, cautiously approaching... ...THE BONNEVILLE: PUSHING IN ON THE TRUNK. Dwight leans in, his ear to the trunk. He TAPS LIGHTLY- POUNDING AND EXASPERATED SHOUTS ERUPT FROM WITHIN, STARTLING DWIGHT. TEDDY (O.S.) (muffled, in trunk) ...HEY! I’M IN HERE! I GOTTA GET OUT! HELP... Dwight backs off and plucks the car keys from the wheel well. INT. BONNEVILLE - BENEATH A BRIDGE - LATE AFTERNOON 151   151  Dwight starts the engine, letting it idle as the PLEADING devolves to POUNDING HOSTILITY. EXT. BONNEVILLE - BENEATH A BRIDGE - LATE AFTERNOON 152   152  Dwight exits, walks over and SLAMS his fist on the trunk. DWIGHT (projecting through steel) You’re alone. You came into my sister’s house with guns. Unless you be quiet, I WILL DRIVE THIS DAMNED CAR OFF A BRIDGE! The pounding and yelling stop. Dwight walks off... ON A PROFILE SHOT OF THE TRUNK (MOUNTED TO THE CAR). Dwight returns, bending down into frame. DWIGHT (CONT’D) I just want this to be over.  48. TEDDY (O.S.) (muffled, through trunk) SURE, MAN. LET ME OUT AND THIS CAN END RIGHT NOW. DWIGHT You guys got guns. I’m not opening the trunk until I have one. TEDDY Shit, I could get- DWIGHT BE QUIET. Dwight exits frame: HOLD ON TRUNK SHOT... CUT TO: EXT. THRIFT STORE - EVENING (CAR MOUNT) 153   153  JUMP CUT OF THE SAME TRUNK SHOT, in a parking lot donation site. Dwight sorts through MATTRESSES and JUNK, expertly digging out a BAG OF CLOTHES... CUT TO: EXT. GAS STATION - EVENING (CAR MOUNT) 154   154  JUMP CUT OF THE SAME TRUNK SHOT, at a gas station. Dwight fills the tank, wearing a SWEATSHIRT AND CORDUROYS... CUT TO: EXT. COMMERCIAL STRIP - EVENING (CAR MOUNT) 155   155  JUMP CUT OF THE SAME TRUNK SHOT, stopping at a busy intersection... CUT TO: EXT. SAM’S STREET - EVEN",
      "dialogue_count": 0,
      "word_count": 574
    },
    {
      "scene_number": 16,
      "slugline": "INT. LIVING ROOM/FOYER - RANCH HOUSE - EVENING 157   157  A WIDE PROFILE OF THE STAIRCASE. A faint RUSH.. Dwight treads heavily through the door and up the stairs. INT. BATHROOM - RANCH HOUSE - EVENING (CONTINUOUS) 158   158  ON THE SINK, THE WATER STILL RUNNING. Dwight turns the faucet off, hits the lights and heads downstairs. Halfway down, he doubles back... INT. NURSERY - RANCH HOUSE - EVENING 159   159  Dwight’s CARDBOARD BOX, where he left it. He drags it off. EXT. SIDE YARD - RANCH HOUSE - EVENING 160   160  Dwight places the box in the garbage, salvaging the YEARBOOK. He folds up a cardboard top-flap and RIPS IT OFF. INT. KITCHEN - RANCH HOUSE - EVENING 161   161  Dwight TAPES THE CARDBOARD FLAP OVER THE BROKEN WINDOW. He sweeps up GLASS with a BROOM and DUSTPAN. INT. FOYER - RANCH HOUSE - EVENING 162   162  ON THE FRONT DOOR: Dwight swings it open and exits. It LOCKS from outside. HE DROPS THE HOUSE KEYS THROUGH THE MAIL SLOT. INT. BONNEVILLE - PARK - NIGHT 163   163  Dwight flips though his YEARBOOK, circa 1996: TEENAGE PORTRAITS, names in black type: denim, Hard Rock Cafe’ shirts, acne, crimped hair and braces. BZZZZZZ. A vibration inside the car. Dwight opens the glove compartment and removes Teddy’s CELL PHONE. ON THE SCREEN: ‘ C IS BACK. WHERE R U?! ’  50.",
      "characters": [],
      "action_text": "TEDDY (O.S.) (muffled, through trunk) WHAT’S THAT? I NEED WATER. DWIGHT NOT UNTIL I HAVE A GUN. Dwight sets the phone down and returns to the yearbook. ON THE YEARBOOK: UNDER THE HEADING ‘ JROTC ’, A PORTRAIT OF A TEENAGER IN MILITARY FATIGUES. TYPED UNDERNEATH: ‘ BENJAMIN GALICIA ’ EXT. BEN’S MOTHER’S HOUSE - NIGHT 164   164  An interior door opens inward, MARGARET GALICIA (67) stands guardedly behind a screen door. MARGARET Yes? DWIGHT Hi, Mrs. Galicia. I’m looking for Ben. Is he still in town? MARGARET No, he moved a while ago. DWIGHT Okay. I’m Dwight, from Orange High. I just... MARGARET Oh! I’m so sorry- you had me a little scared. Mr. Galicia is already in bed. I didn’t recognize you, Dwight. (a rush of sympathy) Oh my. Dwight deflects with a polite nod. MARGARET (CONT’D) Ben has a house near Wyndam. Come in, I’ll write down the address... Margaret unlocks the screen door and Dwight follows her inside.  51.",
      "dialogue_count": 0,
      "word_count": 394
    },
    {
      "scene_number": 17,
      "slugline": "INT. KITCHEN - BEN’S MOTHERS HOUSE - NIGHT 165   165  MARGARET He moved when he got back from Japan. He was deployed... Margaret leads Dwight to the kitchen table. She opens her address book on the counter, picks up a phone and dials. DWIGHT Oh, he doesn’t know I’m coming- MARGARET (gesturing to sit) Oh he’ll be thrilled... He watches her as the line TONES. MARGARET (CONT’D) (hanging up) He’s not picking up. He works at a concert hall in the city. He’s probably playing tonight... DWIGHT Richmond? MARGARET Yes. I never remember the name. It’s not a nice place... She passes a finger along POST-ITS, MAGNETS and PHOTOS displayed on her refrigerator. She slides a BUSINESS CARD from under a magnet and brings her address book to the table. Dwight watches her pencil information onto the card and into her book. MARGARET (CONT’D) This way...we can both have everything...just need this...for myself... (pointing to the card) Here. This is where he works. (flipping it) This is where he lives. You can take this ‘to go’. A TEA KETTLE WHISTLES. She hands the card over and rises. MARGARET (CONT’D) You might need a map, it’s out of the way, off six twenty four.  52.",
      "characters": [],
      "action_text": "DWIGHT I’ve got a map. Thank you. MARGARET Are you in a rush? DWIGHT Sort of. Yes, ma'am. MARGARET I’d offer you tea, otherwise. Dwight glances around, and at Margaret. DWIGHT I’d love some, Mrs. Galicia. MARGARET Oh good! Ben works late anyway. And they play God awful music... EXT. BEN’S MOTHERS HOUSE - NIGHT 166   166  THROUGH THE EXTERIOR WINDOW: Margaret pours Dwight tea in the warm kitchen glow. CUT TO: INT. BONNEVILLE (MOVING) - HIGHWAY - NIGHT 167   167  POUNDING FROM THE TRUNK. Dwight speeds down the road, patting around his seat. He checks the glove box, shuts it. He reads the address off the business card, looks ahead. THROUGH THE WINDSHIELD: A HIGHWAY SIGN: ‘ Zion Crossroads, Fork Union Exit 136 ’ ANOTHER: ‘ I64E Richmond ’ EXT. MUSIC VENUE - NIGHT 168   168  MUSIC BELLOWS WITHIN a textured concrete building with concert posters hung over blacked-out windows. Dwight walks up.  53.",
      "dialogue_count": 0,
      "word_count": 360
    },
    {
      "scene_number": 18,
      "slugline": "INT. ENTRY HALLWAY - MUSIC VENUE - NIGHT 169   169  Dwight angles past SMOKERS, along a vinyl rope partition, greeted by a ROCK GIRL (20s). ROCK GIRL (over the music) FIVE DOLLARS. Disoriented by the THROBBING MUSIC, he pulls CRINKLED BILLS from his pocket and hands them over. He continues past the Rock Girl as she counts six singles then yanks Dwight back. ROCK GIRL (CONT’D) HOLD ON... Dwight resists as she steadies his arm, shoves the extra dollar in his hand and STAMPS IT with a BLACK-LIGHT LOGO. He hurries off, inspecting it... ON HIS HAND IN GLOWING INK: ‘ STRANGE MATTER ’ INT. MAIN ROOM - MUSIC VENUE - NIGHT 170   170  Dwight dips through the crowd to the STAGE. He checks out the BAND MEMBERS. NOTHING. He scans around, lost. INT. ENTRY HALLWAY - MUSIC VENUE - NIGHT 171   171  The Rock Girl rolls her eyes as Dwight timidly approaches. DWIGHT EXCUSE ME. I’M LOOKING FOR A BAND MEMBER NAMED BEN. BEN GALICIA. HE’S SUPPOSED TO BE PLAYING TONIGHT? ROCK GIRL YEAH. BENNY? DWIGHT YES. ROCK GIRL HE’S HERE- HE WORKS THE BOARD. HE’S NOT IN THE BAND. DWIGHT THAT’S FINE. WHEN DOES HE GO HOME?  54.",
      "characters": [],
      "action_text": "ROCK GIRL AROUND TWO-THIRTY OR THREE. DWIGHT I’LL WAIT HERE. ROCK GIRL HE USUALLY LEAVES OUT THE BACK. YOU CAN’T WAIT HERE. DWIGHT (pivoting in search) OKAY. I’LL WAIT OUT AROUND BACK. ROCK GIRL (pointing) OUT THE FRONT AND AROUND THAT WAY. THERE’S AN ALLEY. DWIGHT THANK YOU. DO YOU THINK I COULD HAVE MY MONEY BACK? I COULDN’T STAY IN THERE... ROCK GIRL NO, MAN. YOU’RE GONNA NEED TO FUCK OFF... DWIGHT OKAY. EXT. BACK ALLEY - MUSIC VENUE - NIGHT (LATER) 172   172  IT’S QUIET. A BAND is loading up GEAR into a CONVERSION VAN. IN THE RED WASH OF BREAK LIGHTS, Dwight watches them pull out. He’s alone. There’s a DUMPSTER across the alley. He walks over, places his hand on the rim and rises onto tip-toes. He peeks in- A METAL DOOR SCREECHES OPEN. Dwight wipes his hands on his shirt, observing a LARGE MAN with long black hair turn down the alley. DWIGHT Ben? The Large Man walks on, insulated by HEAVY METAL MUSIC coursing through his HEADPHONES. Dwight follows.  55.",
      "dialogue_count": 0,
      "word_count": 377
    },
    {
      "scene_number": 19,
      "slugline": "EXT. STREET - NIGHT 173   173  Dwight steps from the alley, guided by HEADPHONE SPILL. EXT. VENUE PARKING LOT - NIGHT 174   174  The Large Man unlocks his PICKUP. Dwight stops short of the truck, noting the numerous MILITARY AND FIREARM DECALS. DWIGHT BEN! The Large Man turns, whipping his headphones off, LOUDER around his neck. Dwight stands ready with a cautious hand. DWIGHT (CONT’D) Ben. Hey, it’s Dwight. Evans. The Large Man, BEN, walks over, assessing the claim. Dwight meets him at the tailgate and they shake. BEN Wow, bro- you look square. DWIGHT I’ve been away. Ben nods, waiting for more. BEN No shit, man- just peaced-the-fuck- out... He pulls out cigarettes, Dwight declines and Ben lights up. BEN (CONT’D) ...Same year El Duce got hit by a train. (slaps his truck) Yo, I put the first two hundred miles on this thing stapling up your ‘missing’ posters. DWIGHT (struck, ashamed) Never thought of that. BEN Your sister, man. She was hell bent. Then I think a bunch of your parking tickets came in the mail- she called it all off...  56.",
      "characters": [],
      "action_text": "Dwight nods, thrown off. They listen to HEADPHONE CRACKLE. BEN (CONT’D) I took off too! (lifting shirt, showing a ‘U.S.M.C.’ tattoo) Joined up soon as I graduated. Nev- Ben cuts himself off, cocking his head. BEN (CONT’D) Was...that you? (pointing back) By the dumpster? DWIGHT Yeah. BEN Yeah... So should we get beers? DWIGHT Look, I need to warn you that I’m here- that I came to you- for a favor. A big one. Ben reaches in his jacket, SILENCING HIS HEADPHONES. BEN Sure. What do you need? DWIGHT I need a gun. And I don’t have a lot of time to get it. You were the only person I could trust. BEN Whoa. DWIGHT And has guns. BEN (taking a drag) Shit, man- you can pretty much buy one anywhere. DWIGHT I tried to get one on my own. I don’t have any money- wait... (digging crumpled bills from his pocket) I mean, I’ve got- but my I.D. is-  57. BEN Hold on. Are you a junkie, dude? DWIGHT No. No, I shouldn’t have just... BEN (realizing) Oh, wait. Shit. It’s about that time... Ben gives a subtle nod, takes another drag. BEN (CONT’D) Yeah. Hop in brother. Ben heads to his truck. DWIGHT I should take my car... BEN You gassed up? I’m in the boonies. EXT. COUNTRY ROAD - NIGHT 175   175  The Bonneville’s headlights project onto kicked-up dust from Ben’s truck. The tree-lined road vanishes into pitch black. EXT. BEN’S HOUSE - NIGHT 176   176  The two vehicles pull past a shotgun shack up to a single story prefab house. Dwight parks twenty feet short. INT. BEDROOM - BEN’S HOUSE - PRE-DAWN 177   177  HALLWAY LIGHTS CLICK ON. Ben leads Dwight into the sparse, earthy room, neatly kept if a bit dank. BEN Hey- I got something.. DWIGHT What’s that? Ben opens a JUNK DRAWER in a old bureau, rifles through it. BEN You remember when James Henry’s brother had the stripper at his party? At his shop?  58. DWIGHT Haven’t thought that far back in a while. BEN I got a Polaroid of me and you with the stripper. It’s hilarious- we’re both terrified. DWIGHT Ben. I need to hurry. Ben nods, shoving the drawer",
      "dialogue_count": 0,
      "word_count": 2767
    },
    {
      "scene_number": 20,
      "slugline": "EXT. SECLUDED AREA - BEN’S PROPERTY - LATER 181   181  A CRUDE STACK OF JUGS AND CRATES BLOWS APART. Dwight FIRES a CIRCUIT JUDGE REVOLVING RIFLE. He lowers the barrel, pops the cylinder and tosses the spent shells, looking to Ben. BEN It’s doesn’t have the stopping power of a twelve gauge- but you seem comfortable with it. Dwight nods, drifting. Ben swaps guns as Dwight TUNES OUT. BEN (CONT’D) Shoots slugs too- but you wouldn’t hit   anything.   Only   five   shots though,   so   the   Steyr   is   your   secondary- backup. Another eight rounds,   and stopping power- Ben steps to Dwight until his wandering eyes make contact. BEN (CONT’D) This is personal, I know. But that’s how you’ll fail. No talking. No speeches. If you point the gun, you shoot the gun. Dwight nods. EXT. DRIVEWAY - BEN’S HOUSE - DAY 182   182  Dwight and Ben load the guns and a pack in the Bonneville. BEN This should do you. DWIGHT Where’s the closest car repair? BEN Well, once you’re back to the main road- closest one’s about 20 miles. But that’s east. I assume you’re heading west. It’s just a gas station, though- watcha need?  72.",
      "characters": [],
      "action_text": "DWIGHT It’ll be fine. But do you have some food I could take? (holding his belly) Think I’m going to pass out... BEN Yeah, man. Dwight watches Ben double time it to the house. INT. KITCHEN - BEN’S HOUSE - DAY (CONTINUOUS) 183   183  Ben piles SNACKS from cabinets into a SHOPPING BAG. From a pantry he pulls packets of VACUUM SEALED FOOD. EXT. BEN’S HOUSE - DAY (MOMENTS LATER) 184   184  Dwight shuts the Bonneville’s door and turns to Ben, approaching with the grocery bag. BEN Threw a few MREs in there. Dwight accepts the bag and hands Ben the OLD YEARBOOK. BEN (CONT’D) (flipping through) Nice! I lost mine, or shot it up... DWIGHT I wish I didn’t bring all this to you. BEN (closing yearbook) It’s come and gone. Plus, I’m glad you did. You’d be dead otherwise. DWIGHT You know what I mean. BEN If it were my family, I might do the same. I don’t know. But I’m not helping ‘cus this is right. This is ugly, man. The two stand in silence, acknowledging the weight.  73. DWIGHT Hey. If you ever do come across that Polaroid- of us with the stripper- Ben smiles. DWIGHT (CONT’D) Do me a favor? BEN Yeah? DWIGHT Destroy it? Ben’s smile fades. BEN Okay. INT. BONNEVILLE (MOVING) - HIGHWAY - DAY 185   185  Dwight drives west, squinting peacefully into the sun, wind from open windows scattering his hair. ON THE RADIO: He powers it up and SCANS STATIONS. A LOCAL OLDIES STATION CRACKLES THROUGH THE SPEAKERS. ON THE BACK SEAT FLOOR: WIND WHIPS A CANVAS TARP OFF THE GUNS. CLOSE UP: TRACKING ALONG THE RIFLE BARREL, THE TARP FLAPPING LOOSE, REVEALING A HEAVY DUTY CAR BATTERY. CUT TO: INT. PICKUP TRUCK - BEN’S HOUSE - DAY 186   186  The truck cab is packed with HUNTING GEAR. Ben tucks TWO RIFLE CASES behind the seats and turns the ignition. THE ENGINE DOESN’T TURN OVER, NOT EVEN A CLICK. He pulls the hood latch and hops out. EXT. PICKUP TRUCK - BEN’S HOUSE - DAY (CONTINUOUS) 187   187  Ben lifts the hood, revealing an EMPTY BATTERY TRAY WITH LOOSE HANGING CONNECTOR CABLES.  74. BEN Ha. EXT. RO",
      "dialogue_count": 0,
      "word_count": 724
    },
    {
      "scene_number": 21,
      "slugline": "EXT. RURAL CENTRAL VIRGINIA - DAY 194   194  A panoramic view of rolling-hill country. EXT. HILLY ROAD - AFTERNOON 195   195  The Bonneville turns off the main road and up an incline. EXT. BONNEVILLE (MOVING) -HILLY ROAD - AFTERNOON 196   196  ON THE CAR WHEELS, from CRACKED PAVEMENT TO RAW DIRT. EXT. WOODS - AFTERNOON 197   197  Dwight backs the Bonneville into an off road clearing. INT. BONNEVILLE - WOODS- AFTERNOON 198   198  Dwight darkens. He cuts the engine. FROM THE BACK SEAT: Dwight opens the rear door and gathers his WEAPONS. ON THE KEYS, STILL DANGLING IN THE IGNITION, as Dwight shuts the door and passes the window. He places a FALLEN BRANCH against the car, shading the interior. Then another. EXT. FRONT GATE - CLELAND PROPERTY - AFTERNOON 199   199  A narrow, rutted road leads to a weathered brick entrance with an iron gate secured by a HEAVY CHAIN and PADLOCK. A worn, hand painted PLAQUE reads: ‘CLELAND’ EXT. FENCE - CLELAND PROPERTY - AFTERNOON 200   200  Dwight slides the Circuit Judge rifle and the Steyr pistol under a low, twisted fence. He tosses his backpack over and straddles the sagging wire, rolling over and off... ...HIS SHOES HIT THE DIRT ONTO CLELAND PROPERTY. EXT. WOODS - CLELAND PROPERTY - AFTERNOON 201   201  TRACKING WITH DWIGHT, traversing dense woods, rifle in hand.  76.",
      "characters": [],
      "action_text": "EXT. TREE LINE - AFTERNOON 202   202  Dwight crouches, getting the lay of the land. A rustic single story house sits in a half acre clearing. A two-car garage lies beyond, its doors obstructed by a BOAT TRAILER parked on sunken concrete. Four generation’s worth of ARTIFACTS clutter the property. EXT. CLELAND HOME - AFTERNOON 203   203  WIDE, FROM AFAR, Dwight starts towards the quiet house. EXT. BACKYARD - CLELAND HOME - AFTERNOON 204   204  Dwight rounds the back with trained eyes, moving past an old TOW TRUCK, its load covered in BLUE TARP. THE BACK SCREEN DOOR, FRAMED IN WOOD. Dwight leans close, listening inside. He cracks it open, turning the interior door handle. LOCKED. EXT. SIDE OF HOUSE - CLELAND HOME - AFTERNOON 205   205  Dwight hugs the mossy siding, ducking under a window. He sets the rifle down, cupping the glass for a view. EXT. CLELAND HOME - AFTERNOON 206   206  Dwight stalks towards the front door. A DISTANT NOISE. He pivots to the woods and listens. INT. CLELAND HOME - AFTERNOON 207   207  THROUGH A WINDOW, Dwight appears, squinting into the dark interior cast in green from surrounding foliage. EXT. BACKYARD - CLELAND HOME - AFTERNOON 208   208  Dwight opens the back screen door, widens his stance and VIOLENTLY KICKS THE INTERIOR DOOR. The screen SMACKS his back with each LOUD IMPACT.  77. The door holds firm. Spooked by his failed breach, Dwight clears out, the screen door SLAMMING behind him. He scampers behind the tow truck and readies the rifle, his grip arm resting on a fender. RIFLE SIGHTS ON THE BACK DOOR... Nobody comes. He turns to the tarp behind the truck, weighted by a CINDER BLOCK. He kicks it over and lifts the tarp. UNDER THE TARP: The WHITE LIMOUSINE wreckage, scorched and half-cannibalized. THUNK. Dwight plants the CINDER BLOCK, propping open the screen door. He leans the rifle by the frame and backs off. With a running start, Dwight delivers a POWERFUL KICK. The INTERIOR DOOR CAVES INWARD SEVERAL INCHES and the frame comes loose.",
      "dialogue_count": 0,
      "word_count": 1696
    },
    {
      "scene_number": 22,
      "slugline": "EXT. GRAVE SITE - CLELAND HOME - LATE AFTERNOON 220   220  ON THE FRESH GRAVE, PUSHING PAST IT, MOVING TOWARDS A GRANITE HEADSTONE: ‘ WADE MARSHAL CLELAND SR. ’ Urine desecrates the grave. A healthy amount of it. INT. LIVING ROOM HALLWAY - CLELAND HOME - EVENING 221   221  ON THE WELCOME MAT, Dwight props a GLASS JAR of coins, tacks and hardware against the front door. He takes shelter behind a PILED FURNITURE BUNKER, bracing against the wall, his rifle barrel resting on a couch pillow. Dwight waits patiently in the dark. EXT. CLELAND HOME - NIGHT 222   222  The BUSY DRONE of night creatures. PUSHING IN ON THE PITCH BLACK HOUSE. INT. LIVING ROOM HALLWAY - NIGHT 223   223  Dwight’s heavy, drifting eyes. HUM...TICK - THE LIVING ROOM LAMP THROWS WARM LIGHT AND DEEP SHADOWS IN EVERY DIRECTION. Dwight springs up with his weight against the wall. His eyes sharpen, his breaths ease- in through the nose, out through the mouth. The rifle is trained steadily on the door. He hunts for a trace of sound or motion. But there is none. He steps in for a better angle of view. Still no trace. He ducks past the window and drops down. INT. KITCHEN - CLELAND HOME - NIGHT (CONTINUOUS) 224   224  Dwight crawls through the kitchen and out the back door.  83.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 226
    },
    {
      "scene_number": 23,
      "slugline": "EXT. CLELAND HOME - NIGHT 225   225  Dwight jogs in a crouch around the house, sweeping with his eyes through the rifle sights. He lines-up the front porch. Nothing but night. INT. LIVING ROOM - CLELAND HOME - NIGHT 226   226  Dwight enters from the kitchen, approaching the PHANTOM LAMP. He drops to all fours and traces the lamp cord to an OUTLET. Between the plug and socket is a SMALL BEIGE DEVICE, like a thermostat, but marked with hours instead of degrees. Written in brown font: ‘ Intermatic TIME-ALL ’ It’s set for 9PM. From his low vantage point, Dwight notices a stack of BOOKS under the coffee table. He pulls out two dusty vinyl PHOTO ALBUMS. He cocks his head and listens. Then settles on the floor against the recliner and flips through... THE PHOTO ALBUM:  A photo timeline of the Clelands. Vintage black and whites, faded color prints and stained Polaroids. From stoic, depression era hunters to Teddy and his limousines. Pelts and guns. A man and a woman.  The man sick.   The woman pregnant. The woman with a baby, others wear black. A young boy beside a slain deer, with indifferent eyes...  INT. LIVING ROOM - CLELAND HOME - EARLY MORNING 227   227  Dwight sits asleep on the floor against the recliner, the album across his lap. The lamp’s warm glow clashes against the morning blue. HUM...TICK. The lamp turns off. Dwight wakes in the cold light.  84.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 243
    },
    {
      "scene_number": 24,
      "slugline": "INT. 2ND BEDROOM - CLELAND HOME - MORNING 228   228  Dwight pulls the bedsheet off the air mattress, sets the cigarette carton back on top. EXT. WOODS - CLELAND PROPERTY - MORNING 229   229  TRACKING WITH DWIGHT, back through the woods, the sheet over his shoulder. EXT. BONNEVILLE - WOODS - MORNING 230   230  PUSHING IN ON THE BONNEVILLE, half camouflaged with branches. ON THE TRUNK as it unlatches and bobs. Dwight lifts it open, wincing at the escaping smell. He spreads the bedsheet on the ground, holds his breath and lunges into the trunk, grappling with TEDDY’S BODY until it slumps over the edge and onto the sheet. Dwight gasps upward for air, pockets Teddy’s CELL PHONE and shuts the trunk. He wraps the body. EXT. FENCE - CLELAND PROPERTY - MORNING 231   231  Dwight struggles with THE BODY, caught in the fence by its own weight. EXT. WOODS - CLELAND PROPERTY - LATE MORNING 232   232  Dwight drags THE BODY by the bedsheet, torn and muddy with blood pooling at one end. He’s exhausted, sweating profusely. EXT. GRAVE SITE - CLELAND HOME - DAY 233   233  ON DWIGHT’S FACE, as he shovels dirt. ON THE GRAVE he’s digging, by the edge of the gated plot. WIDER, Dwight stands in the ditch, hips at ground level. He pulls THE BODY into the grave. ON DWIGHT’S FACE, as he shovels.  85.",
      "characters": [],
      "action_text": "A MUFFLED PULSE stops him mid swing. AGAIN, clearly now- A TELEPHONE RING. INT. LIVING ROOM - CLELAND HOME - DAY 234   234  ON THE PHONE. Dwight stomps to a halt, catching his breath as the ANSWERING MACHINE ENGAGES. TEDDY’S VOICE (V.O.) (answering machine) You’ve reached the Cleland residence- drop it like it’s hot. BEEP. DEAD AIR. FOUR NUMERIC TONES. Dwight tenses. ANSWERING MACHINE (electronic menu voice)  You have-no-new messages. You have- five-saved mes-  THREE NUMERIC TONES. Dwight steps closer with wide eyes. ANSWERING MACHINE (CONT’D) (electronic menu voice)  You have-no-messages . A SUSTAINED DIAL TONE... CLICK. Dwight stares, shaken. He fishes in his pocket, sets Teddy’s phone on the dining table and plugs in the charger. Fumbling with the power connector, Dwight scowls until the phone CHIRPS AFFIRMATIVE. EXT. GRAVE SITE - DAY 235   235  Dwight wiggles a SLAB OF ROCK flush with the dirt. He PAINTS ‘TEDDY’ on it with the roller and tray. INT. LIVING ROOM HALLWAY - CLELAND HOME - DAY 236   236  Dwight swings his rifle in the hallway, testing the width.  86.",
      "dialogue_count": 0,
      "word_count": 410
    },
    {
      "scene_number": 25,
      "slugline": "INT. MASTER BEDROOM - CLELAND HOME - DAY 237   237  Dwight shuts the closet door and pinches the drapes, reaching through them to open the bottom window pane. He kneels behind the bed. RIFLE SIGHTS THROUGH THE DOOR, INTO THE LIVING ROOM HALL. INT. 2ND BEDROOM - CLELAND HOME - DAY 238   238  Dwight closes the drapes and turns on a table lamp, leaving the door slightly ajar. INT. HALLWAY - CLELAND HOME - DAY 239   239  Dwight steps to the ironing board against the wall. He moves it aside and discovers a narrow doorway into a utility area. INT. UTILITY AREA - CLELAND HOME - DAY 240   240  Dwight enters the dark and pulls a hanging chain. A fluorescent light warms up, flickering above a compact washing machine and utility sink. DRIED BLOOD coats the sink rim, a bag of soiled clothes sits on the washer. A silver CHARM NECKLACE dangles from a wire shelf. INT. LIVING ROOM - CLELAND HOME - AFTERNOON 241   241  ON THE CELLPHONE, atop the dining table. It CHIRPS again, the charger unplugged. Dwight rises behind it. He disconnects the phone and arranges the charger on the table as he found it beside the map. He dials a number on Teddy’s cell phone, referring to a LABEL on the house phone. He waits. The house phone RINGS... The answering machine CLICKS AND SPEWS SHRILL AUDIO FEEDBACK. EXT. BACK YARD - CLELAND HOME - AFTERNOON 242   242  Dwight stands thirty feet from the house, the phone pressed to his ear, waiting for a BEEP.  87.",
      "characters": [],
      "action_text": "DWIGHT (into phone) Hello. It’s me... INT. LIVING ROOM - CLELAND HOME - EVENING 243   243  ON THE WELCOME MAT: Dwight removes the GLASS JAR from against the door. INT. LIVING ROOM HALLWAY - CLELAND HOME - EVENING 244   244  LOW, BROODING STRINGS. The furniture bunker is gone. Dwight tucks to the wall and sinks to the floor, the rifle in his lap. EXT. CLELAND HOME - EVENING 245   245  FIREFLIES BLINK in the brush as the house darkens. EXT. WOODS - CLELAND PROPERTY - EVENING 246   246  The night sky envelopes the surrounding woods. THE LOW STRINGS BUILD. EXT. WOODS - CLELAND PROPERTY - NIGHT 247   247  Black trees sway. EXT. FRONT GATE - CLELAND PROPERTY - NIGHT 248   248  Through the rusted gate, HEADLIGHTS APPEAR around a bend and skip off the dirt. THE STRINGS INTENSIFY. INT. LIVING ROOM - CLELAND HOME - NIGHT 249   249  EXTREME CLOSE-UP, THE INTERNAL MECHANISM OF A LOW TECH ELECTRONIC DEVICE. ROTATING PLASTIC AROUND SIMPLE WIRING. A FAMILIAR BUZZ...CLICK. The PHANTOM LAMP illuminates. DOWN THE HALL, Dwight waits.  88. The distant CLINK OF A GATE. The RUMBLE OF TIRES. Dwight brings his knees to his chest, his feet flat against the carpet. He pulls out Teddy’s cell phone, presses a button and waits. OUTSIDE, A VEHICLE PULLS UP. Dwight backs into the dark, pressing another button. THE HOUSE PHONE RINGS. MUFFLED VOICES OUTSIDE. RUNNING FEET. CHRIS (O.S.) (through door) It’s the phone! CARL (O.S.) (through door) Move! KEYS CLANK AGAINST THE DOOR. THE DOOR LATCHES OPEN: CARL, CHRIS, AND HOPE BURST THROUGH... ON DWIGHT, shadowed out of view, quietly closing the phone and slipping it away. THE RINGING STOPS as the trio reaches the phone. CARL (CONT’D) Fuck! CHRIS There’s a message! HOPE Go. Play it! Chris presses ‘PLAY’. ON DWIGHT, DOWN THE HALLWAY, dripping sweat. He raises the Circuit Judge Rifle, finds a firm grip. Chris, Hope and Carl gather around the table, listening intently to the message. THEY’RE ALL IN HIS SIGHTS. CLICK. BEEP.  89. DWIGHT’S VOICE (ON ANSWERING M",
      "dialogue_count": 0,
      "word_count": 1752
    },
    {
      "scene_number": 26,
      "slugline": "EXT. SIDE YARD - RANCH HOUSE - MORNING 254   254  ON THE GARBAGE: Dwight’s CARDBOARD BOX sits atop the pile along with a few bird droppings. INT. RANCH HOUSE - MORNING 255   255  IN THE KITCHEN: the TAPED UP CARDBOARD on the back window. UNDER THE DINING TABLE: The GARDEN WEEDER lies in a pool of sunlight. THE SOUND OF SOMEONE APPROACHING FROM OUTSIDE. ON THE FRONT DOOR: The Mail slot swings open, fluttering daylight as a STACK OF MAIL shoves through. ON THE FLOOR: SAM’S HOUSE KEYS, 4 days worth of JUNK MAIL, and a POSTCARD, with a drawing of Thomas Jefferson’s home and outlined block letters filled-in with images of lighthouses, waterfalls, blue mountains and trees. IT READS: ‘ Greetings from Virginia: The Old Dominion State ’ CUT TO BLACK. 256   256  96.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 136
    }
  ]
}