{
  "slug": "bohemian-rhapsody-2018",
  "title": "bohemian rhapsody",
  "genre": "drama",
  "format": "film",
  "scenes_count": 19,
  "characters_count": 0,
  "characters": [],
  "total_words": 28471,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. BRIAN’S HOUSE/ KENSINGTON/ LONDON - DAY  A RINGING TELEPHONE. CAPTION:   LONDON, 1991  Enter BRIAN MAY (44). He crosses to the TELEPHONE...  (INTERCUT as NECESSARY with - )  INT. ROGER TAYLOR’S KITCHEN/ LONDON - MORNING  ...ROGER TAYLOR (42) holding a TELEPHONE in one hand, reads from the   DAILY MIRROR...  ROGER “a man--bent--on abnormal pleasures, corrupt, corrupting--his life a revolting tale of depravity, lust and wickedness...” BRIAN No. ROGER “...for his kind his death--was a suicide.”   Bastards. Silence - BRIAN What do you want to do?  INT. BREAKFAST TV SHOW - DAY  The grieving BRIAN and ROGER on a couch, face an arrogant MALE TV INTERVIEWER. We are live - INTERVIEWER Last week saw the death of one of the most flamboyant and popular figures in rock-music--Freddie Mercury, lead singer with Queen. Joining us in the studio to pay tribute and maybe reflect on Freddie’s memory for the first time: two of the band members: guitarist Brian May & drummer Roger Taylor--thanks for coming. So-- the commentators have all had their say about Freddie, haven’t they? (CONTINUED)  3.",
      "characters": [],
      "action_text": "For ROGER and BRIAN, so full of emotion, the words don’t come easily... ROGER What we feel is--our friend is barely in his grave--all he ever did was try to entertain people--and some people are   saying “good”, “good riddance”, “he deserved it.” It’s disgusting. Because he was actually - MALE INTERVIEWER  (cutting him off)  (Yes, I mean) it would be wrong not to say that he has been depicted in certain quarters as a sort of decadent, wild, bisexual, irresponsible lover. ROGER We’re here to stick up for him, coz he can’t stick up for himself. MALE INTERVIEWER But what   was   the truth of that? BRIAN Of what? MALE INTERVIEWER  Was   he decadent, irresponsible? When you hear the stories - BRIAN  (reacting)  Did he   deserve to die , you mean? Is that the question? MALE INTERVIEWER But it’s interesting isn’t it, that - ROGER He was a victim of an epidemic. A plague. We lost a great artist. BRIAN And a magnificent human being. MALE INTERVIEWER And why do you think, then, some people are - CONTINUED: (CONTINUED)  4. ROGER - Newspapers - let’s be clear - MALE INTERVIEWER - newspapers--the media--have reacted in this way? Is it perhaps because - ROGER Because they have no shame. They want to sell papers. They don’t know who he was. MALE INTERVIEWER - because Freddie became a symbol for a certain sort of life-style, didn’t he? A manifesto of hedonistic freedom. BRIAN and ROGER now start to become furious with this guy - BRIAN Did he? I don’t know that. ROGER You asked us on this program so we could talk about our friend. We agreed that - MALE INTERVIEWER Well let’s talk about you then, the band. What will you do now? Will you go on, or disband? ROGER It’s too soon--it’s been three days --we were together 22 years. We’re in shock, I think. BRIAN Yes. MALE INTERVIEWER Because also, well, Freddie wrote most of your hits--didn’t he? This comments stuns BRIAN and ROGER - ROGER  (to BRIAN)  Did he?   Oh. BRIAN Oh so Freddie wrote: “We Will Rock You”--did he? CONTINUED: (2) (CONT",
      "dialogue_count": 0,
      "word_count": 3071
    },
    {
      "scene_number": 2,
      "slugline": "INT. MAY HOUSE (1970) - DAY  HAROLD MAY (BRIAN’s DAD) presents (to the CAMERA) the RED SPECIAL...  INT. “SMILE” GIG 3 - NIGHT  CLOSE ON: The RED SPECIAL, being strapped on by BRIAN, as - the band prepare to perform their first song - to a small audience. ANGLE ON: FREDDIE, struggling to adjust the FAULTY MIC- STAND which is set too low - OLDER BRIAN (V.O.) We had no idea what to expect from Freddie on that first night. ANGLE ON: JOHN DEACON (20) - on BASS GUITAR. OLDER BRIAN And John Deacon, electrical engineering student, had just taken over on bass--so anything could happen. FREDDIE still can’t adjust the FAULTY MIC-STAND - ROGER Ready? Freddie? FREDDIE Ready Steady Go.  (struggling)  Wait, wait--This--give me---Bloody- - but then the top half of the MIC stand breaks off, and won’t go back into the bottom half - - ROGER and BRIAN share concerned looks. Not a good beginning. ROGER Come on. BRIAN Freddie - FREDDIE Fuck it. Let’s go. (CONTINUED)  19.",
      "characters": [],
      "action_text": "FREDDIE will just use the top half of the MIC stand, the MIC affixed.   FREDDIE comes to the centre of the stage. For a second FREDDIE stares at the audience, the shy nervous Farouk Bulsara. But then he takes a deep breath and nods at BRIAN, who counts in the BAND - “SMILE” strike up the intro to   “Doin’ All Right”   -   and FREDDIE jumps into a dramatic pose, which he holds like a statue - BRIAN and ROGER and JOHN all share surprised looks as FREDDIE then begins to TRANSFORM THE SONG - his hugely dramatic and showy performance a million miles from what we saw Tim Staffel do with it. ANGLE ON: The Audience reaction: Startled. OLDER BRIAN (V.O.) Same old song, but it sure felt different with Freddie doing it.  INT. BIBA CLOTHING BOUTIQUE - DAY  A trendy clothes boutique - OLDER BRIAN (V.O.) ...and it needed a new look. CLOSE ON: MARY AUSTIN (19), who works in the store. BRIAN This is Freddie. FREDDIE, a gentleman, proffers his hand - FREDDIE How do you do? BRIAN Mary. Mary Austin. FREDDIE Mary. MARY Freddie. They smile at each other. MARY So how do you know Brian? CONTINUED: (CONTINUED)  20. FREDDIE I’m his new lead singer. BRIAN nods. MARY  (unimpressed)  Oh yeah? CUT TO: CLOSE ON: BRIAN’s FINGERNAILS - now varnished WHITE. WIDE: BRIAN and FREDDIE and ROGER (ROGER has a less over- the-top wardrobe than the others) are looking through the clothing racks - while MARY speaks with another customer. FREDDIE keeps sneaking glances at her - FREDDIE  (aside to BRIAN, re MARY)  Details!   She’s your girlfriend?  Not   your girlfriend? What? C’mon. BRIAN Sort of. FREDDIE Sort of Yes, or sort of No? BRIAN Sort of--both. We’ve been out a few times. It was - FREDDIE Kissed her? BRIAN Cheek only. Look, if you like her-- then just--she’s had a rough time with guys. Needs someone to appreciate her. FREDDIE There’s something really sweet and calming about her. BRIAN Go on then--ask her out. FREDDIE looks at MARY, who sees him looking, and he - shyly pretends to go through more clot",
      "dialogue_count": 0,
      "word_count": 4938
    },
    {
      "scene_number": 3,
      "slugline": "INT. FREDDIE’S FIRST FLAT/ LONDON - NIGHT  Fred gives MARY a PRESENT. MARY What is it? FREDDIE Go on, open it up! MARY opens the box and inside is another box. She opens this second box only to discover, inside, a third...and so on... MARY Oh no. FREDDIE Getting smaller and smaller, I’m afraid. Shrinking and shrinking, sorry sweetie. MARY What is it? FREDDIE Well it can’t be very big!  (watching her)  Be more fun if the boxes got bigger and bigger, wouldn’t it and you end up with a car or something. Finally MARY takes out a RING-BOX, and opens it. Inside is a RING.   She stares at him - stunned. FREDDIE Well? MARY Which hand? FREDDIE Left hand, fourth finger. Her heart stops. FREDDIE Your turn to say something. MARY  (moved)  Yes. Of course. (CONTINUED)  47.",
      "characters": [],
      "action_text": "They kiss. FREDDIE That’s alright then. Isn’t it? She nods, moved, looking at her RING.   FREDDIE watches her, warmly - but conflicted.  EXT. ROCKFIELD FARM - DAY  CHICKENS and COWS cross the FARMYARD. A working DAIRY FARM. ANGLE ON: QUEEN, standing with their gear, at the gates, in the mud, uncertain if this was a good idea. ROGER Nice recording studio. JOHN Evidently the cheapest EMI could find. BRIAN The idea was to get away from all distractions. FREDDIE You forgot cow shit and roosters at dawn. The FARMER comes out to greet them. FARMER “Queen” I presume?! Welcome! Shall we get you settled in then? The BAND cross the YARD.   FREDDIE, playfully, chases a CHICKEN that SQUARKS and FLAPS away. FARMER Only two of the rooms have windows! This makes BRIAN and JOHN dash indoors to grab them - leaving FREDDIE and ROGER the last to enter the FARMHOUSE. ROGER Engaged? Congratulations’n all that. Ra Ra, very cool. FREDDIE Surreal you mean. You and Dominique? CONTINUED: (CONTINUED)  48. ROGER  (cautionary)  Ah ah ah ah! Every man, in their own time, in their own way. WIDE SHOT of the YARD. MATCH DISSOLVE TO: THE YARD - LATER.   ROGER now CHATS-UP a FARM-GIRL (who holds an URN of MILK) as the sound of BRIAN’s GUITAR (playing ROCK CHORDS - not yet a memorable riff) emanates from the open windows.  INT. BRIAN MAY’S RECORDING STUDIO (2016) - NIGHT  BLOGGER Was there creative conflict? During those sessions? OLDER BRIAN Conflict? No, I don’t think so. No.  INT. RECORDING STUDIO /ROCKFIELD FARM - DAY  FREDDIE, ROGER, BRIAN and JOHN are shouting at the same time - ROGER’s VOICE breaks through. ROGER I put my heart and soul into this song and you don’t like it because you want   your   songs on the album and your royalties as writers--  that’s   why you don’t like it!!! FREDDIE For God’s sake. It’s not that, Roger dear - ROGER OH REALLY?! THEN WHAT IS IT?! Only BRIAN is brave enough to say it - BRIAN  (picking up the lyric sheet)  “I’m In Love With My Car”? It’s not strong enough. ",
      "dialogue_count": 0,
      "word_count": 1264
    },
    {
      "scene_number": 4,
      "slugline": "INT. RECORDING STUDIO /ROCKFIELD FARM - DAY  With a CLUNK the 24-TRACK RECORDING TAPING MACHINE starts to RECORD. At the MIXING DESK - ENGINEER (R.T.BAKER) Two. Mark Two--version of “Fred’s--  Thing .” CUT TO: FREDDIE recording the PIANO of the OPERA BIT. The lid of the piano is covered his little scraps of paper. FREDDIE stops when he makes a mistake. FREDDIE Sorry! ROGER  (over Tannoy)  Bit too fast, Fred. It’s okay, it’s just a wee bit too fast. BRIAN  (over Tannoy)  “Let the audience in.” Right? FREDDIE NODS, goes again, slower...  EXT. ROCKFIELD FARM - DAY  ELECTRICAL CABLES now cross the farm toward the TACK- ROOM...  INT. TACK-ROOM/ ROCKFIELD FARM - DAY  ROGER, wearing cans, plays the DRUM TRACK - which is all we can hear - amid the TACK and HAY-BALES. He’s is being watched by the now ADORING FARM-GIRL.  INT. RECORDING STUDIO /ROCKFIELD FARM - DAY  JOHN, wearing cans, plays the BASS track of the OPERA BIT - which is all we can hear. CUT TO: BRIAN, wearing cans, plays the searing LEAD-BREAK - which is all we can hear. He finishes. (CONTINUED)  54.",
      "characters": [],
      "action_text": "BRIAN  (nonchalant)  Something like that? Fred? CUT TO: The BAND listen to the PLAYBACK of the MIXED INSTRUMENTATION of the OPERA BIT (BASS, DRUMS, PIANO, TIMPANY) -  INT. KITCHEN/ ROCKFIELD FARM - NIGHT  The BAND is served food by the FARMER’s WIFE. They all eat silently, until - JOHN So, tomorrow--we start on the vocals? FREDDIE Don’t worry my dears, it’s all in here.  (taps his temple)  ROGER It’s not exactly “Killer Queen”. EMI’s gonna have a fucking heart-attack-- half the album’s gonna be   one song . FREDDIE Serves ‘em right--for telling artistes to repeat themselves!  EXT. ROCKFIELD FARM - DAY  Morning. A ROOSTER CROWS. SILENCE, and then - ROGER (O.S.) (extremely high, like a rooster) GALILEO! GALILEO! GALILEO! FREDDIE Can you go a bit higher? ROGER Any higher and only dogs’ll fucking hear it! CONTINUED:  55.",
      "dialogue_count": 0,
      "word_count": 325
    },
    {
      "scene_number": 5,
      "slugline": "INT. RECORDING STUDIO /ROCKFIELD FARM - DAY  ROGER recording the HIGHEST part of the BACKING VOCAL on the OPERA BIT. ROGER “GALILEO! GALILEO! GALILEO!”  (pulling off cans)  Jesus Christ, how many more Galileos? ENGINEER Freddie wants to do a few more overdubs. Gotta tell ya, the tape is wearing out, can’t take much more. The ENGINEER holds up the TAPE - almost TRANSPARENT! FREDDIE But it’s sounding colossal. A few more. Let’s do it! CUT TO: BRIAN is recording his GALILEO’s, but singing a BASS VERSION - BRIAN “GALILEO! GALILEO! GALILEO! GALILEO! GALILEO! GALILEO!”  (pulling off cans, exhausted)  Happy?  (beat)  Or not? REACTION FREDDIE: A big SMILE, he knows he has GOLD on tape.  INT. RAY FOSTER’S OFFICE/ EMI RECORDS - DAY  The FULL MIXED RECORDING of BOHEMIAN RHAPSODY is played on RAY FOSTER’s TAPE MACHINE, for RAY FOSTER and his FINANCIAL OFFICER and JOE BASTIN. Present, also, are QUEEN, and JOHN REID, and PAUL PRENTER. The SONG ends. The BAND waits for a VERDICT. RAY FOSTER  (furious)  I don’t believe it is the album you promised us. Do you? Do you? (CONTINUED)  56.",
      "characters": [],
      "action_text": "JOHN REID It’s a great album, Roy. RAY FOSTER I think--that what you have made here - FINANCIAL OFFICER - is the most expensive album ever made. That’s official. RAY FOSTER And as for Bohemian - JOE BASTIN Rhapsody - RAY FOSTER What is that? It goes on forever - six minutes!   Six   minutes? FREDDIE I pity your wife if you think six minutes is forever. It’s a   rhapsody . FINANCIAL OFFICER It’s a   travesty . FREDDIE We want to release it as our single. RAY FOSTER Well, that’s not possible. Anything over 3 minutes the radio stations won’t program it. And what on earth is it about anyway? Scaramouche, Gallileo- FINANCIAL OFFICER 1 - Figaro - RAY FOSTER And all that “ISSMILLER” business-- ”ISHMILLER” - FREDDIE Bismillah. JOE BASTIN  (reading lyrics)  “ Bismillah, they will not let him go ” RAY FOSTER What is that, anyway? “Bismillah”? CONTINUED: (CONTINUED)  57. ROGER, BRIAN and JOHN look at FREDDIE - SILENCE. FREDDIE shrugs - FREDDIE  (obfuscating)  It’s nonsense. Doesn’t mean anything. This does little to appease FOSTER - and then - JOHN REID Actually, I agree. We do need the BBC and their format is 3 minutes tops. I have to agree with Roy. FREDDIE looks at JOHN REID, furious - gives his ‘Et Tu Brute’ look.   ROGER and BRIAN and JOHN also stare at JOHN REID, outraged. JOHN REID I think the single is--”Love Of My Life.” It’s slow, but it’s strong. JOHN REID looks back at FREDDIE and holds up his hands - JOHN REID My job is to turn things around for you. “Love of my Life”. RAY FOSTER Play that one again. Let’s hear that one again... The TAPE MACHINE is wound backwards -  INT. RECORDING STUDIO /ROCKFIELD FARM - DAY  FREDDIE sings “ LOVE OF MY LIFE ”, recording vocals and piano solo, as the rest of the BAND - watch from the CONTROL ROOM, (Top Lit as in the album cover, minus Freddie.) FREDDIE sings his SONG FOR MARY, beautifully, over...  INT. BRIDAL SHOP - DAY  ...as MARY shops for a WEDDING DRESS.  INT. RECORDING STUDIO /ROCKFIELD FARM - DAY  FREDDIE plays and sings -",
      "dialogue_count": 0,
      "word_count": 551
    },
    {
      "scene_number": 6,
      "slugline": "INT. RAY FOSTER’S OFFICE/ EMI RECORDS - DAY  FREDDIE (O.S.)  (on the recording)  “ Don't take it away from me, because you don't know what it means to me .” The TAPE MACHINE is stopped. FREDDIE No. RAY FOSTER No? JOE BASTIN “You’re My Best Friend”? “Oooh you make me live, Oooh you make me live now honey...” Stronger? FINANCIAL OFFICER Or what about, what about “I’m In Love With My Car”? An idea. ROGER gives BRIAN an “I-told-you-so-look” but then offers - ROGER No. Bohemian Rhapsody. JOHN Bo-Rap. FREDDIE There’s no question. RAY FOSTER “Love Of My Life”...it’s hardly “Killer Queen”, but it may have a chance... BRIAN No! ROGER No! FREDDIE Tell me one other band that has done an operatic single? You can’t. FINANCIAL OFFICER My point exactly. (CONTINUED)  59.",
      "characters": [],
      "action_text": "JOHN “MacArthur Park” was   seven   minutes long. RAY FOSTER It’s the BBC. There’s no way around the BBC! So let me be clear!...EMI is not--repeat NOT-- releasing a six minute quasi-operatic dirge comprised of nonsense words !  INT. PUB - DAY  FREDDIE and ROGER and BRIAN and JOHN in private conference. FREDDIE Do you believe our own manager taking their side? ROGER Then let’s promote Bo-Rap ourselves. Go on TV, play it live. JOHN Without the multi-tracking it’ll sound crap. Gotta sound huge, or not at all. ROGER Okay. Alright, then let’s film it ourselves, mime it to the recorded track, and give   the film   to TV to play. BRIAN and JOHN and FREDDIE stare at ROGER, who nods and raises his pint - BRIAN Can we do that? JOHN Be expensive to film something. BRIAN How much? JOHN Have to beg, borrow, steal, friends, relations, anyone. FREDDIE Fucking John Reid. CONTINUED:  60.",
      "dialogue_count": 0,
      "word_count": 287
    },
    {
      "scene_number": 7,
      "slugline": "EXT. LONDON STREET - DAY  FREDDIE angrily strides down a LONDON STREET carrying a SHOULDER BAG. He opens the SHOULDER BAG and takes out a BRICK...as he stops below a certain window...  INT. JOHN REID OFFICE/ LONDON - DAY  JOHN REID introduces PAUL PRENTER to JIM BEACH. JOHN REID Paul? Want you to meet Jim, Jim Beach, Queen’s lawyer. PAUL PRENTER John just did an incredible job handling a very tricky situation with EMI about which single to release. JIM BEACH I see. JOHN REID Queen have great, wild ideas but they lack any sense of the industry. Just then his WINDOW explodes. KOOOOOSSSHHHHH!   FREDDIE’s BRICK lands on the FLOOR. JOHN REID WHAT THE FUCK?!!!! REID creeps to the broken window and looks down at -  EXT. LONDON STREETS - DAY  FREDDIE, hands on hips, looking up - FREDDIE  (shouting)  Don’t you EVER betray us again John Reid!!! FREDDIE marches off down the street.  MONTAGE  A) ROGER selling his CAR, to CASH-BUYER 1 B) FREDDIE selling his WHITE PIANO (with black keys) to CASH-BUYER 2 (CONTINUED)  61.",
      "characters": [],
      "action_text": "C) JOHN selling his HI-FI-EQUIPMENT to CASH-BUYER 3 D) BRIAN selling his TELESCOPE, to CASH-BUYER 4  INT. ELSTREE STUDIOS - DAY  The BAND record their VIDEO for BOHEMIAN RHAPSODY... The CAMERAMAN is ready to shoot. The BAND wait, arranged in their now famous diamond-shaped tableau, but in silhouette at this stage, waiting... CAMERAMAN Camera ready.  INT. BRIAN MAY’S RECORDING STUDIO (2016) - NIGHT  OLDER BRIAN Remember, there was no such things as Music Videos at that time...  INT. ELSTREE STUDIOS - DAY  OLDER BRIAN (V.O.) You appeared live on TV, or not at all. BRUCE GOWERS, the DIRECTOR, to his ASSISTANT DIRECTOR - BRUCE GOWERS OK--let me see the Multi-Facet Lens, try to make it interesting, hold it up... OLDER BRIAN (V.O.) It became the first music video of all time and paved the way to MTV. The CAMERA passes over - -   items on a table, firstly the famous RECORD cover of MARLENE DIETRICH ( lit from above, hands crossed over her collar-bone - the CONCEPT/INSPIRATION for this VIDEO ) - and then settles on CAMERA LENSES. The CAMERA ASSISTANT picks up one SPECIAL F/X LENS, and holds it over his face, checking it, and we see his face fragmented into FIVE faces, just before he holds it over the CAMERA LENS. CONTINUED: (CONTINUED)  62. BRUCE GOWERS Thanks. Take it away.  (the MF LENS is removed)  Okay, standing by--“Bohemian Rhapsody”...Cue smoke... The DRY ICE machine kicks in, clouding the back-light behind the BAND. BRUCE GOWERS Roll sound. CAMERAMAN Rolling. BRUCE GOWERS Mark it. The CAMERA ASSISTANT holds up the CLAPPER BOARD - on it is marked:  VIDEO - BOHEMIAN RHAPSODY, QUEEN, DIRECTOR BRUCE GOWERS”  BRUCE GOWERS And--roll the track please. In 5,4,3,2,1 - Music. We hear: ROGER/BRIAN/JOHN/FREDDIE  (singing)  “Is this the real life, BRUCE GOWERS Standby cross-fade - ROGER/BRIAN/JOHN/FREDDIE - is this just fantasy, caught in a landslide, no escape from reality. BRUCE GOWERS Cross-fade, and up you come. The TOP LIGHT comes up as the BACK-LIGHT fades out. The FOUR FA",
      "dialogue_count": 0,
      "word_count": 1153
    },
    {
      "scene_number": 8,
      "slugline": "I/E. HYDE PARK STAGE - SUNSET  The BAND make their way to the STAGE, and as they do so, the CLAMOR of the VAST AUDIENCE actually FADES to SILENCE, to total SILENCE... OLDER BRIAN (V.O.) ...like nothing else. Energy like you couldn’t believe-- SOUNDLESSLY the band makes their way onto the stage, the CAMERA trailing them, until the CAMERA reveals what the band see as they step on-stage - - MASSED HUMANITY! But silent -  INT. BRIAN MAY’S RECORDING STUDIO (2016) - NIGHT  OLDER BRIAN A tidal wave of sound, but more than that. Of approval. Approbation. Validation. A rush of joy. Love! Filling your soul and washing away your worries, fears, pain, making you into something you never dreamed you could be.  EXT. STAGE/ HYDE PARK - DAY  REACTION FREDDIE, ROGER, JOHN, and lastly BRIAN - Awe- struck by a sound we can’t hear - CUT-AWAYS of members of the wildly gesturing (but SOUNDTRACK-MUTED) CROWD... OLDER BRIAN (V.O.) When we went over our allotted time? The police shut us down but no-one would go home. 150,000 people stayed. We were suddenly the biggest band in the world. Well, we sold tickets faster than anyone. We toured like people possessed...  EXT. SANTA MONICA CIVIC AUDITORIUM/ 1976 US TOUR - NIGHT  BAND plays “TIE YOUR MOTHER DOWN” OLDER BRIAN (V.O.) America. 32 dates coast to coast.  67.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 227
    },
    {
      "scene_number": 9,
      "slugline": "EXT. JAPAN TOUR/ 1976 - NIGHT  FREDDIE engages the crowd with his “DAY-O” ROUTINE.... FREDDIE Dayyyy---OOOOO! JAPANESE CROWD Dayyyy---OOOOO! OLDER BRIAN (V.O.) Japan. Australia. UK.  EXT. ARGENTINA TOUR/ BUENOS AIRES/ 1981 - DAY  Police motorcycles lead a TANK down the CROWD-LINED street of BUENOS AIRES, with the motorcycles crisscrossing to keep civilians and cars away from the tank. OLDER BRIAN (V.O.) Then came South America. No one had ever played that part of the globe-- but Freddie... Appearing out the TOP of the TANK, FREDDIE MERCURY, waving a ARGENTINIAN FLAG... FREDDIE  (to his band-mates below)  Isn’t this fun, darlings?! OLDER BRIAN (V.O.) ...Freddie realised that after the World Cup there might be some nice little stadiums not being used by anyone.  EXT. STAGE/ SAO PAOLO/ 1981 - NIGHT  FREDDIE walks out on-stage to a FOOTBALL STADIUM AUDIENCE of 58,000 (nearly all of whom waving LIT LIGHTERS!) He waves to this TWINKLING GALAXY of PEOPLE... OLDER BRIAN (V.O.) There were. CUT TO: (CONTINUED)  68.",
      "characters": [],
      "action_text": "Onstage, FREDDIE has his eyes closed, as if PRAYING, as - 58,000 Brazilians sing “ LOVE OF MY LIFE ”! A tremendously moving - almost holy - experience for him. OLDER BRIAN (V.O.) 58,000 people. Most couldn’t speak English but they   could  sing Freddie’s song. When FREDDIE opens his eyes - he has TEARS in them. CUT TO: BRIAN, on-stage alone, starts an extended GUITAR SOLO, as FREDDIE jogs from the stage... CUT TO: ...Backstage - FREDDIE quickly changes into a new costume, with the help of PAUL PRENTER, as BRIAN’s SOLO continues. ROGER drains a cup of water... FREDDIE How long has Brian been going? ROGER Ahh--’bout five minutes so far.  INT. BRIAN MAY’S RECORDING STUDIO (2016) - NIGHT  OLDER BRIAN, eyes closed, remembering, smiling, plays the RED SPECIAL GUITAR (unplugged) - as we hear him reproduce the virtuosic lead-break (mutely) on the un-amplified strings...  EXT. STAGE/ SAO PAOLO/ 1981 - DAY  ...BRIAN, on-stage, alone, at full volume again, still cutting loose on the RED SPECIAL - CUT TO: FREDDIE, now slouched in a chair, in his new costume and waiting to go back on, but awaiting the end of BRIAN’s SOLO. PAUL PRENTER checks his watch - FREDDIE  (to PRENTER)  Fuck it, let’s go shopping. CONTINUED: (CONTINUED)  69. PAUL PRENTER This is ridiculous. Just then the STAGE MANAGER enters - STAGE-MANAGER Freddie, Roger - it’s ending. FREDDIE and ROGER stalk back on-stage, to a roar from the CROWD.  INT. BRIAN MAY’S RECORDING STUDIO (2016) - NIGHT  OLDER BRIAN And the parties?!  (pause)  Well--I was a married man...  INT. FANCY DRESS PARTY/ BALLROOM (NEW ORLEANS) - NIGHT  A BACCHANALIAN REVEL straight from the imagination of FELLINI - we see the FUN of being one of the biggest bands in the world... OLDER BRIAN (V.O.) But there were temptations...  MONTAGE A (NEW ORLEANS PARTY):   of - A) BRIAN on the BALCONY, surveys, from above the hotel ballroom, made up to resemble labyrinthine jungle swamps, swarming with - B) Naked dancers, cavorting in bamboo cages suspended from b",
      "dialogue_count": 0,
      "word_count": 3268
    },
    {
      "scene_number": 10,
      "slugline": "INT. FREDDIE’S MANSION - NIGHT  A CAT sits on the lid of the STEINWAY as FREDDIE composes - what will become \" Somebody To Love .\"   He plays the first piano part...the INTRO... starting slowly, softly, developing it until he finds what he wants. He picks up his pen and notates the music...As he WRITES we hear (on the SOUNDTRACK) the music he is hearing in his head. The piano intro is repeated...  MONTAGE   (The Search For Love)  A) RESTAURANT. FREDDIE and JOE BASTIN talk over DINNER... FREDDIE (V.O.) “Each morning I get up I die a little Can barely stand on my feet Take a look in the mirror and cry Lord what you're doing to me B) MARY’s FLAT. MARY frames a PHOTOGRAPH of herself and FREDDIE...alone, with FREDDIE’s cats. FREDDIE (V.O.) “I have spent all my years in believing you But I just can't get no relief, Lord!... Somebody - B) MANOR RECORDING STUDIO. ROGER, BRIAN and FREDDIE share a MIC and record the GOSPEL BACKING TRACK - a monumental gospel feel - ROGER/BRIAN/FREDDIE “SOMEBODY!!” C) FREDDIE’s MANSION - FREDDIE at his PIANO, sings - FREDDIE “Somebody...” D) MANOR RECORDING STUDIO - ROGER/BRIAN/FREDDIE “SOMEBODY!!..“CAN ANYBODY FIND ME...” E) FREDDIE’s MANSION - FREDDIE at his PIANO, sings - FREDDIE “...Somebody to Love?” (CONTINUED)  85.",
      "characters": [],
      "action_text": "F) ON A LAKE. FREDDIE and JOE BASTIN laugh as they try to SAIL a YACHT on a lake, and have no CLUE at first - but then they are soon underway, JOE at the TILLER, gliding along in a firm breeze. FREDDIE looks happy... G) RESTAURANT. MARY now has a date with a BACHELOR, until she is called away by the waiter, who indicates there is a PHONE-CALL for her... H) MARY picks up the PHONE... (INTERCUT with - ) I) ...FREDDIE, in tears on his couch with his CATS, talking on the phone to MARY, whilst watching his favorite DOUGLAS SIRK MOVIE - “ Imitation Of Life ” - specifically the climactic FUNERAL SCENE with LANA TURNER and the GOSPEL CHOIR. J) The BACHELOR, alone, looks at his WATCH, wondering when MARY will return... K) FREDDIE and MARY and JOE at a CLOTHING STORE CHECK-OUT all pile their clothes on the counter - CHECKOUT GIRL  (looking at MARY and JOE)  Paying for everyone? FREDDIE takes out his CREDIT-CARD. FREDDIE Everyone in the store darling! (to the SHOPPERS)  Attention! For the next five minutes everything in the store is on me!  Stunned looks from the SHOPPERS... L) Outside the CLOTHING STORE, all the HAPPY SHOPPERS, arms loaded with SHOPPING BAGS, applaud FREDDIE for his generosity as he and MARY and JOE emerge, and walk off down the street, waving them goodbye. FREDDIE (V.O.) “I work hard...Every day of my life... I work till I ache in my bones! At the end of the day I take home my hard earned pay, all on my own. I get down on my knees...and I...pray... Till the tears run down from my eyes Lord! Somebody K) MANOR RECORDING STUDIO - CONTINUED: (CONTINUED)  86. ROGER/BRIAN/FREDDIE “SOMEBODY! FREDDIE “Ooh somebody... ROGER/BRIAN/FREDDIE “PLEASE! ANYBODY FIND ME....!” L) NEW YORK HOTEL.   FREDDIE sits on the end of the BED, as JOE BASTIN ZIPS up his bag, making to go. FREDDIE Everybody goes...Who is it? Who are you seeing? JOE BASTIN I can live with a rock-star, but not one that’s not ready to commit. Your work comes first. Right? FREDDIE  (sadly)  Handsome Joe. Kind",
      "dialogue_count": 0,
      "word_count": 1212
    },
    {
      "scene_number": 11,
      "slugline": "EXT. CHICAGO - NIGHT  In concert, under a spot-light, FREDDIE sings his (public but encoded) declaration of who he is... In the presentation it should have a dramatic quality of a defendant in the witness stand, giving his testimony. FREDDIE  (emotional)  “I’ve paid my dues, Time after time. I've done my sentence But committed no crime. And bad mistakes? I've made a few. I've had my share of sand kicked in my face but I've come through. ROGER/BRIAN/JOHN “And I need just go on and on, and on, and on. FREDDIE/ROGER/BRIAN/JOHN “We are the champions, my friends, And we'll keep on fighting 'til the end. We are the champions. We are the champions. No time for losers 'cause we are the champions of the world.  (to the crowd)  Sing it! Let’s hear you! And then the CROWD take over, with FREDDIE conducting - CAMERA picks out INDIVIDUALS - all possible OUTCASTS uplifted by this song - a DIVERSE range of people from all walks of life who for a moment are raised up. CROWD “WE ARE THE CHAMPIONS, MY FRIENDS, AND WE'LL KEEP ON FIGHTING 'TIL THE END.   WE ARE THE CHAMPIONS... WE ARE THE CHAMPIONS... NO TIME FOR LOSERS 'CAUSE WE ARE THE CHAMPIONS OF THE WORLD!” FREDDIE spins, grinning, and looks at BRIAN, who is struck by the dialogue between band and audience that just happened. BRIAN’s expression says he has an idea. FREDDIE  (grinning)  Told you so! It’s   their   song! (MORE) (CONTINUED)  91.",
      "characters": [],
      "action_text": "(turning back to the crowd)  “I've taken my bows And my curtain calls You brought me fame and fortune and everything that goes with it I thank you all! The CROWD roars their love - FREDDIE turns and faces BRIAN and delivers the next lines straight to him - FREDDIE “But it's been no bed of roses, No pleasure cruise. I consider it a challenge before the whole human race And I ain't gonna lose!!!! BRIAN smiles at his MAGNIFICENT FRIEND. In the WINGS, angle on: MARY lovingly watching FREDDIE perform. Her eyes are on FREDDIE (on-stage), but she is holding the HAND of DAVID, her new boyfriend. DAVID notices how lovingly MARY looks at FREDDIE, and swallows his jealousy.  INT. BACKSTAGE/ US TOUR 3 - NIGHT  FREDDIE and BRIAN and ROGER and JOHN all excitedly discuss what just happened, as they undress. (The DRESSING ROOM is now, unlike before, FULL of people we have never seen before, HANGERS-ON. JIM BEACH is there, and so is PAUL PRENTER.) BRIAN That was amazing. They kept singing, even after we’d left the stage. FREDDIE They want to join the band, darling! Every fan sub-consciously wants to join the band. CONTINUED:   FREDDIE (CONT'D) (CONTINUED)  92. BRIAN Then let’s let ‘em join the band. They can sing, they can clap, they can stamp their feet. Let’s write something that gets ‘em   even more  involved. FREDDIE The critics will hate it. Right then--first one to write a cracking audience participation song gets -  (holds up a cookie)  - a piece of my Mr Kiplings Almond Slice. I’m now having them flown in from London to go with my cup of tea. ROGER (to FREDDIE) Hey. Great song man. FREDDIE Why thankyou Roger. JOHN It’s a hit. FREDDIE Of course it’s a hit. But--muchos gracias amigos. MARY enters with her MAN, DAVID. MARY Freddie? FREDDIE turns - and looks at DAVID. FREDDIE tries to remember the guy’s name. MARY David. FREDDIE David! David. Hello dear. Be very good to Mary, won’t you. Sorry about this but we’re all about to change-- clothes. (to MARY) See you later. FREDDIE ki",
      "dialogue_count": 0,
      "word_count": 780
    },
    {
      "scene_number": 12,
      "slugline": "EXT. UK CONCERT/ LONDON - NIGHT  The IMMENSE CROWD all STAMP and CLAP in time to “WE WILL ROCK YOU”, until the BAND add to it, but they do not replace it - they integrate it.  INT. RECORDING STUDIO - DAY  FREDDIE starts to RECORD the VOCAL, but he is ONE OCTAVE HIGHER than the version we all know - in high FALSETTO. FREDDIE “Buddy you're a boy make a big noise, Playin' in the street gonna be a big man some day - BRIAN in the RECORDING BOOTH, hits the TANNOY button - BRIAN Freddie, Freddie, Jesus man! This isn’t Opera now--we want the audience to sing along to this one and you’re the only guy in the world who can sing that high. FREDDIE Drop it down? Y’think? They start again. FREDDIE drops it all down ONE OCTAVE - FREDDIE “Buddy you're a boy make a big noise, Playin' in the street gonna be a big man some day - FREDDIE looks at BRIAN and ROGER and JOHN who are all giving him now the THUMBS-UP, nodding.  INT. NEW YORK BARBERSHOP - DAY  HAIR falls onto the BARBERSHOP FLOOR. In the mirror we see the NEW FREDDIE, short-haired, clean-shaven, and now sporting a MUSTACHE! FREDDIE spins in the BARBERSHOP CHAIR and looks at - PAUL PRENTER, who nods his APPROVAL. FREDDIE GRINS, and then COVERS HIS TEETH with his hand coyly.  EXT. NY GAY LEATHER CLUB (MINESHAFT) - DAY  Outside the NOTORIOUS CLUB - FREDDIE and PAUL PRENTER look like GAY CLONE TWINS - mustache, short hair, leathers. (CONTINUED)  95.",
      "characters": [],
      "action_text": "PAUL PRENTER They all come here, all our famous ones: Rock Hudson, Robert Mapplethorpe, Rudolph Nureyev comes here,   Fassbinder, Foucoult. It's absolutely without question   the   place in the universe for someone like you. Anything goes. FREDDIE You know, despite my stage persona, I’m still really a very shy boy. PAUL PRENTER Oh this place’ll cure you of all that. Life-changing. Trust me. And!--and I can even get you your own key to the private VIP room downstairs. Almost no-one gets their own key! They cross the ROAD and PAUL gets FREDDIE entry, straight away.  INT. NY GAY LEATHER CLUB (MINESHAFT) - DAY  A WILD PARTY. The DISCO ERA has ARRIVED. FREDDIE, in a corner, SNORTS a HUGE LINE OF COKE... CAMERA goes into an E.C.U on his face as he whispers - FREDDIE ...Bis--millah! The DECADENCE in the room is pronounced. And then - - FREDDIE is presented with a KEY. FREDDIE looks at the KEY, and takes it, and mock bows in thanks. FREDDIE My own key! CUT TO: SHOT OF: a BASEMENT CORRIDOR - the CAMERA tracks in on a DOOR at the far end...one with a LARGE KEY-HOLE...  EXT. NY GAY LEATHER CLUB (MINESHAFT) - SUNRISE  FREDDIE and PAUL and two other GAY CLONES emerge, HIGH and RAUCOUS. They head off down the street. CONTINUED: (CONTINUED)  96. We HEAR: as SOUNDTRACK: “ I WANT IT ALL ”.  EXT. MEAT PACKING DISTRICT - SUNRISE  BLOODY MEAT CARCASSES are being loaded into REFRIGERATED TRUCKS by burly MEAT-PACKERS. MEAT-PACKER 1 Hey! Six MEAT-PACKERS turn and see FREDDIE and his GANG walking toward them. The MEAT-PACKERS, some with HOOKS, move to cut off FREDDIE’s path as FREDDIE’s GANG stop before them. MEAT-PACKER 2 What the fuck do we have here? PAUL PRENTER  (afraid)  No problem. Freddie? Come on. But FREDDIE, high as a kite, refuses to be dragged away by PAUL. A fight seems inevitable. FREDDIE I love it. It’s like West Side story. MEAT-PACKER 3 You guys sure picked the wrong street to walk down. FREDDIE Oh, I don’t know about that. Lovely bunch of beefy boys like you... PAUL PREN",
      "dialogue_count": 0,
      "word_count": 986
    },
    {
      "scene_number": 13,
      "slugline": "EXT. SMALL GAY BAR / LONDON - NIGHT  A TAXI pulls up and MARY gets out, WORRIED. She looks for FREDDIE who is hiding in the shadows across the road. She goes to him. He is sporting his CLONE LOOK. MARY What’s the emergency?! FREDDIE I need someone to go in there ( gay club ) with me. I can’t go in alone. MARY  (outraged)  Freddie?! I left David in the middle of dinner! FREDDIE He’s very short, isn’t he. Five foot six, seven? MARY How dare you! HOW DARE YOU! You know what? Find someone else. Call your PA! I’m sure PAUL is   lurking   close by. MARY walks off, looking for a new CAB. FREDDIE chases her and catches her. FREDDIE Mary! You’re here now. Just give me five minutes. Please! Please.  (beat)  I’ll pay you. This infuriates her further. MARY What’s happening to you? FREDDIE I can’t stand being alone right now. How do I look? My hair is so horrible and still fucking greasy! She regards him, with sympathy - and then softens. FREDDIE Ten minutes. Then you can go home to David in my Rolls Royce. I’m very happy for you. Really. (CONTINUED)  99.",
      "characters": [],
      "action_text": "MARY Five. Five minutes.  INT. SMALL GAY BAR / LONDON - NIGHT  FREDDIE and MARY sit at the BAR, on stools. The room is full of GAY MEN, MARY is the only woman. FREDDIE keeps his CAP on, hiding his identity, as he waits to be picked up. MARY  (sarcastic)  Well,   this   feels natural. FREDDIE Must seen very strange to you, sorry darling. MARY You do this a lot? FREDDIE  (nervous)  Bars. Sometimes in the park, you know. MARY Have you heard from Joe? FREDDIE Love is Russian Roulette for me, with all the chambers loaded. So here I am. Sad, isn’t it, to only trust strangers.  (beat)  And you.  (holds her hand)  Do you love him? MARY He wants to have children.  (looking around)  And so you always just wait for someone to approach you? FREDDIE Absolutely. I’m not a tramp, darling! Can’t have them getting the wrong idea! They laugh - FREDDIE I love you. CONTINUED: (CONTINUED)  100. MARY That’s the problem. As FREDDIE turns and looks around the room for CANDIDATES...a STOCKY IRISHMAN with a MUSTACHE (JIM HUTTON) comes to the bar, stands beside MARY. Their eyes meet - JIM HUTTON You don’t remember me? Probably the leather. You come to my salon. Never forget a hair-cut. MARY Oh hello. JIM HUTTON Jim. MARY Mary. And this is -  (tapping FREDDIE’s shoulder)  - this is--umm--ummm-- FREDDIE turns - FREDDIE and JIM look at each other - JIM HUTTON You can’t remember? MARY He goes by many names. JIM HUTTON A man of mystery then? FREDDIE  (to JIM)  How big’s your cock? MARY- shocked - turns to FREDDIE - MARY And   that’s   not giving them “the wrong idea”?! JIM HUTTON I was just going to offer you a drink and some conversation, I don’t give a fuck who you are—-you shouldn’t be rude. FREDDIE is startled to be spoken to like this - CONTINUED: (CONTINUED)  101. MARY I like him. FREDDIE I like him too. MARY Great. Then I’ll leave you two to get to know each other. I have a spaghetti bolognese getting cold. MARY kisses FREDDIE on the cheek - MARY Bye Jim. MARY leaves the bar. JIM HUTTON So-",
      "dialogue_count": 0,
      "word_count": 2166
    },
    {
      "scene_number": 14,
      "slugline": "INT. MUNICH OPERA HOUSE - NIGHT  FREDDIE watches, with PAUL PRENTER, a German-language production of “THE RING CYCLE” by WAGNER, a SCENE of TREACHERY and BETRAYAL. The ORCHESTRA rises to a CLIMAX. The CONDUCTOR urges his players on... ANGLE ON: FREDDIE, rapt, spell-bound - OLDER BRIAN (V.O.) But now he had to deliver on two solo albums, two   disco   albums, that would repay the enormous advance the record company had paid, and he’d never recorded on his own before.  INT. FREDDIE’S MUNICH FLAT - DAY  FREDDIE tries to write songs - and to inspire him he knocks back vodkas. CUT TO: PAUL PRENTER on the phone to someone - PRENTER  (into phone)  He can’t talk now. He’s working. He works day and night.  INT. MARY’S NEW FLAT - NIGHT  MARY puts down the phone - upset, as her BOYFRIEND, DAVE enters with FLOWERS. She tries to smile as he kisses her.  INT. FREDDIE’S MUNICH FLAT - DAY  FREDDIE, looking TIRED, rises from his COMPOSITIONS and goes to a silver case on the sideboard and scoops COCAINE onto the glass surface.  INT. MUNICH NIGHT-CLUB - NIGHT  FREDDIE knocks back VODKAS with PAUL PRENTER and several NEW FACES - shouting over the LOUD MUSIC... (CONTINUED)  111.",
      "characters": [],
      "action_text": "FREDDIE Listen to that! That’s the sound I want! The sound of-- youth , the sound of youth! It’s   that ! Pleasure! Indulgence! Hedonism! Ecstacy! ECSTACY! The MUSIC in the CLUB is DANCE/DISCO, heavy on synthesizers - far from the Queen sound.  INT. RECORDING STUDIO (MUNICH) - DAY  FREDDIE’s new session band stands around waiting to be told what to play - Fred Mandel, Paul Vincent, Curt Cress, Stephan Wissnet...but FREDDIE is drunk. FREDDIE Well, let’s just fucking try it again, yes? Because right now it’s so bad I can’t even recognise it as being the worst song I’ve ever written! Is any of this getting lost in translation? Mac? Do we need to hire a translator? He turns to MAC, the GERMAN ENGINEER/PRODUCER - in the CONTROL ROOM. MAC Freddie. We should go again. FREDDIE Ja! We should go again! Danke! Then let’s--jolly well--go again. The BAND all pull on their CANS and go again -   the DISCO- ORIENTED intro to “ LIVING ON MY OWN .” CUT TO: FREDDIE, taking time out, COUGHING and drinking VODKA and SMOKING to sooth his throat, while the BAND records. CUT TO: FREDDIE tries to write lyrics in the studio, alone - MAC Time to go home Freddie. Let’s do this tomorrow. CONTINUED: (CONTINUED)  112. But FREDDIE just keeps working. CUT TO: THE CONTROL ROOM. FREDDIE works with MAC, producing the track - FREDDIE No, no--completely take out the drums for the first twelve bars - MAC Take them out? FREDDIE Take them out, gone--just the vocal for the first two lines, try that.  Something   has to work. CUT TO: FREDDIE records his lead vocal - (We don’t hear the backing track) FREDDIE “Sometime I feel I’m gonna break down and cry, Nowhere to go nothing to do with my time, I get lonely, so lonely, Living on my own...” He starts to COUGH. He grabs a napkin. He coughs up BLOOD. MAC Freddie? To the SOUND of the DISCO BACKING TRACK (minus VOCALS) of “Living On My Own”, we cut to   -  INT. FREDDIE’S MUNICH FLAT - NIGHT  A PARTY at FREDDIE’s FLAT. PAUL PRENTER and a coterie of THEATRICAL HANG",
      "dialogue_count": 0,
      "word_count": 1968
    },
    {
      "scene_number": 15,
      "slugline": "INT. FREDDIE’S MUNICH FLAT - NIGHT  - MARY takes off the HEADPHONES. Silence.   She SMILES. MARY I do. FREDDIE It’s good, isn’t it?! It’s really good! MARY But I thought CBS has forbidden an opera record. FREDDIE Sshhh. They have. But I’ll pay for it myself.  (overjoyed)  It’s so great to have you here. Mary--I need you.   Stay . Stay here, with me, just till I finish the album! Two months! Just you and I! Your own bedroom. He grabs her SUITCASE and carries it into a SPARE BEDROOM and then re-appears. She still looks uncertain - FREDDIE Say “Yes.” You can help me work, you can be my inspiration.  (tenderly)  I need the love of my life. She melts - MARY Oh Freddie... He kneels at her feet, holds her hands - MARY I don’t want to sit here and watch you hurt yourself. All the parties, drugs, strange people - FREDDIE No. No, no, no. I’ll work. I’ll just work, that’s all. Live a quiet life, we’ll look after each other and become vegan missionaries until the album is done. (CONTINUED)  121.",
      "characters": [],
      "action_text": "MARY Work? And nothing else? Mr Mercury? FREDDIE I promise. Oh, and people call me “Your Royal Highness” now. MARY I’m sure they do. She smiles. He smiles too, freely, not covering his teeth. FREDDIE I’ll show you! I’m gonna start now, prove it to you! Just watch! Work! He goes to the piano, while she sits on the LOUIS XIV CHAISE LONGUE. FREDDIE Total dedication!  (sings)  “ Just you wait ‘enry ‘iggins just you wait. ” He resumes work on a new song - FREDDIE I’m working on another piece to suit Monserat’s voice. Can you imagine? Writing for the most divine voice on earth? MARY  (tired)  That’s good Freddie. That’s good. FREDDIE starts to read the music of “ENSUENO”, and we hear both PIANO and VOCALS on the SOUNDTRACK as he reads - FREDDIE A piano introduction, in E/m...  (we hear this)  and then...change, B7B9...  (and this)  ...and then, her voice...Octave higher! E/m... We hear MONSERAT’s voice come in...Over her lines Freddie mutters - FREDDIE “En mi sueno re vi...” CONTINUED: (CONTINUED)  122. - and then POUNDING on the DOOR. FREDDIE stops. FREDDIE opens the door, and PAUL PRENTER and the REVELLERS (MEN and WOMEN) all push into FREDDIE’s FLAT. PAUL PRENTER Sorry we’re late!  (seeing MARY)  Oh! Mary! What a pleasant surprise! PAUL goes to MARY and kisses her on the cheek. PAUL PRENTER What brings you here? Should have told us you were coming--What hotel are you staying at? MARY starts to put on her COAT, making to leave again - FREDDIE Mary? Come on. MARY Bye Freddie. FREDDIE Mary...  (deciding who he wants)  Paul! Everyone, you have to leave. REVELLERS LEAVE?! FREDDIE Everyone out. OUT! Out, out! PAUL PRENTER Well you heard him. Everyone out! Out! Out! PAUL herds the REVELLERS out and shuts the door. PAUL PRENTER There. That’s better. FREDDIE looks at MARY to see if she’s happy now - MARY Him too.   (Paul)  FREDDIE Mary - CONTINUED: (2) (CONTINUED)  123. MARY Him too. I’m not staying if he’s here. FREDDIE Paul. You need to go. PAUL PRENTER For how long? FREDDIE ",
      "dialogue_count": 0,
      "word_count": 2794
    },
    {
      "scene_number": 16,
      "slugline": "INT. WAITING ROOM/ DOCTOR’S SURGERY - DAY  (On another day) - FREDDIE, wearing sunglasses, cap,   waits nervously, beside JIM HUTTON (on one side) and a YOUNG HIV MAN (on the other). YOUNG HIV MAN  (to FREDDIE)  Hey. FREDDIE looks at the YOUNG HIV MAN, gives a quick smile, then LOWERS his CAP over his eyes and adjusts his SUNGLASSES, fearful of being recognised.   Silence, until - - NURSE 2 appears... NURSE 2 Doctor will see you now. JIM taps FREDDIE on the knee supportively, then FREDDIE follows the NURSE, until - YOUNG HIV MAN Day-O. FREDDIE turns, the YOUNG HIV MAN is looking at him... FREDDIE  (touched)  Day-O FREDDIE enters the SURGERY, the door closes behind him.  EXT. HOSPITAL - DAY  FREDDIE emerges - stay on his face as he processes the news...hard to tell what he’s thinking, feeling...  INT. REHEARSAL ROOM/ LONDON - DAY  For their 2nd “LIVE AID” rehearsal, the BAND are now rehearsing “ CRAZY LITTLE THING CALLED LOVE ” and really rocking it now. They have gelled again, but... FREDDIE is off, troubled, in poor voice, weak... BRIAN and ROGER and JOHN all notice and look at each other, wondering what is up with FREDDIE?  MONTAGE (LIVE AID):  (CONTINUED)  136.",
      "characters": [],
      "action_text": "A) VAST CROWDS make their way toward WEMBLEY STADIUM. CAPTION:   “JULY 13, 1985”  B) The GATES into WEMBLEY STADIUM are opened. C) Inside WEMBLEY STADIUM the first audience members pour into the GIANT EMPTY SPACE, heading for the STAGE, staking out their turf. D) LIMOUSINES disgorging ROCK-STARS. E)   The STADIUM is now full, and HUMMING. F) BACKSTAGE, POP-STARS all talking to each other. G) BACKSTAGE, BOB GELDOFF, on the PHONE, GELDOFF No! Fok off! It’s   a focken famine ! People are focken’ dying! Africa needs this money NOW! ( Hangs up ) Fuck! WORKER Coffee? GELDOFF  (politely)  No thank-you.  INT. FREDDIE’S MANSION/ LONDON - DAY  FREDDIE sits at his BREAKFAST table, staring out the window at his beautiful garden...where JIM HUTTON tends the FLOWERS. MARY enters - PREGNANT - bringing a steaming cup. MARY Here. Try and drink this? Lemon and honey. How is it?   (the throat)  FREDDIE Not good. And my knee is killing me too. I’m not sure I can do it, Mary-kins. I’m serious. He touches her PREGNANT belly - FREDDIE How is my god-son? Little Richard? CONTINUED: (CONTINUED)  137. She smiles, and makes him take another SIP of lemon water. FREDDIE What time’s the car coming? MARY 3.30. FREDDIE tries to SIP the LEMON DRINK but he winces in pain. MARY turns on the TV set. MARY The show starts in a few minutes. The PICTURE shows...the waiting WEMBLEY CROWD... FREDDIE I’m going for a walk.  EXT. FREDDIE’S MANSION/ STREETS OF LONDON - DAY  FREDDIE emerges and walks up the street, wearing CAP and SUNGLASSES and a LARGE COAT. A lonely man. When the SUN falls on him, he stops, turns his face toward the healing sun, closing his eyes, trying to make sense of everything... He then looks around him, up and down the street.   WHERE THE HELL IS EVERYONE? The streets of London are empty! Suddenly - the ROAR OF A CROWD. Where is it coming from? ELECTRIC GUITARS then augment the ROAR... FREDDIE looks around, and realises that the sound is coming from OPEN WINDOWS... ...and then from the so",
      "dialogue_count": 0,
      "word_count": 630
    },
    {
      "scene_number": 17,
      "slugline": "EXT. WEMBLEY STADIUM/ “LIVE AID”/ LONDON (1985)  STATUS QUO are playing “Rockin’ All Over The World.” But the lead singer - FRANCIS ROSSI -calls to his soundman - FRANCIS ROSSI More volume. MUSIC UP:   “THE SHOW MUST GO ON” ...(the pulsing INTRO)...bleed in the sound of CHOPPER ROTOR-BLADES...  MONTAGE  A) A HELICOPTER flies over LONDON...SWOOPING MAJESTICALLY around the SKY-SCRAPERS, over the beautiful city...toward...WEMBLEY STADIUM... FREDDIE (V.O.) “Empty spaces - what are we living for Abandoned places - I guess we know the score On and on, does anybody know what we are looking for... “Another hero, another mindless crime Behind the curtain, in the pantomime “Hold the line, does anybody want to take it anymore B)   INSIDE the HELICOPTER: FREDDIE closes his eyes, his hand protectively massaging his THROAT, clearly in discomfort. ANGLE ON: MARY & JIM HUTTON looking at FREDDIE, concerned. FREDDIE (V.O.) “The show must go on, The show must go on... Inside my heart is breaking My make-up may be flaking But my smile still stays on... C) The HELICOPTER lands at WEMBLEY and FREDDIE MERCURY disembarks...  EXT. MIXING DESK/ LIVE AID - DAY  CONCERT MIXING BOARD - SEVERAL SWITCHES on the MIXING DESK have the tape over the TOP PARTS of the VOLUME SLIDERS. (CONTINUED)  139.",
      "characters": [],
      "action_text": "MIXER  (into mouthpiece)  Not allowed to go higher than “7” - regulations, sorry.  INT. QUEEN DRESSING ROOM/ LIVE AID (1985) LONDON - DAY  As the BAND gets ready...a DOCTOR prepares a HUGE NEEDLE, seriously HUGE, and goes to FREDDIE with the SYRINGE - FREDDIE Where are you sticking   that ?! DOCTOR Back of your throat. Small steroid injection. FREDDIE Get that away from me! Christ!  (to MARY)  I need vodka and three cigarettes right-fucking-now! The DOCTOR looks at JIM BEACH, who shrugs, and accepts FREDDIE’s decision. As the DOCTOR exits... FREDDIE  (tests his voice)  Ahhh---hah!--hah!  (to BRIAN)  How long do we have? BRIAN As long as you need then halve it. FREDDIE  (warming his voice)  Ahhh---hah!--hah! DAAYY-O--AAYYY-O...  (coughs, winces)  Guys?! I have to cut the DAY-O’s with the crowd. My voice can’t handle it. BRIAN Good idea. Look after your voice. FREDDIE Cigarettes! Ahhh---hah!--hah! While JIM BEACH pulls out cigarettes, MARY pours a VODKA, while JIM HUTTON fixes FREDDIE’s HAIR. CONTINUED: (CONTINUED)  140. FREDDIE So greasy! Why is it always so greasy? JIM HUTTON Because you wash it six times a day. FREDDIE That makes no sense. JIM BEACH steps up, and holds out a CIGARETTE for FREDDIE to smoke from it as JIM holds it -   but this is a new FREDDIE and, seated at his MIRROR, he takes the CIGARETTE - he will do it himself. FREDDIE Miami?   I thank you. I’m turning over a new leaf. From now on I’m going monastic. MARY passes FREDDIE a glass of VODKA. FREDDIE Early nights, mineral water -  (raises his vodka)  Nastrovia. FREDDIE downs the VODKA, stands up, gargles it for a few seconds... FREDDIE looks at MARY, who angles her face to be kissed ON THE LIPS...but FREDDIE (significantly) KISSES HER ON THE FOREHEAD FOR SAFETY SAKE! ( confirming he is HIV positive .) FREDDIE then continues his vocal warm ups, bouncing up and down on his feet - FREDDIE Come on voice come on voice come on voice--you can do it--one more charge--one last hurrarr... JIM HUTTON steps up ",
      "dialogue_count": 0,
      "word_count": 1520
    },
    {
      "scene_number": 18,
      "slugline": "EXT. STREETS OF WEMBLEY - DAY  PEDESTRIANS have frozen in their tracks, and stare skyward, able to hear the BOOM-BOOM-CHA in the very air, wondering where in hell it’s coming from... ANGLE ON: a STORE’s PLATE GLASS WINDOW, vibrating to the BOOM-BOOM-CHA!...  EXT. CAR PARK/WEMBLEY STADIUM - DAY  2 DOZEN CAR ALARMS, (on the newest cars only) have gone off, activated by this crowd-made EARTH-TREMOR...  INT. BACK GARDEN/ WEMBLEY HOUSE - DAY  A CHAINED DOG, hearing the far-off BOOM-BOOM-CHA, strains against his chain and BARKS/HOWLS.  EXT. STAGE/ LIVE AID - DAY  With the fuse lit, BRIAN blows the entire thing sky-high by launching into the famous POWER CHORDS of the INTRO, accompanied by ROGER and JOHN. The effect is orgasmic - the crowd ROARS! FREDDIE, now at PIANO, comes in with the SOLO PIANO intro of “WE ARE THE CHAMPIONS” FREDDIE “I've paid my dues/Time after time. I've done my sentence/ But committed no crime. JOHN comes in on BASS - FREDDIE “And bad mistakes? I've made a few. I've had my - BRIAN, fuelled with ADDED EMOTION, kicks in -as does ROGER - FREDDIE “- share of sand kicked in my face But I've come through! We are the champions, my friends, And we'll keep on fighting 'til the end. We are the champions. We are the champions. (MORE) (CONTINUED)  146.",
      "characters": [],
      "action_text": "No time for losers 'Cause we are the champions of the world. FREDDIE on solo piano again - singing, intimately now - with the AUDIENCE singing along with him - FREDDIE “I've taken my bows/ And my curtain calls/ You brought me fame and fortune and everything that goes with it I thank you all! The CROWD roar! FREDDIE “But it's been no bed of roses, No pleasure cruise/ I consider it a challenge before the whole human race/ And I ain't gonna lose! FREDDIE AND CROWD “We are the champions, my friends, And we'll keep on fighting 'til the end. We are the champions. We are the champions. No time for losers 'Cause we are the champions of the worrrrrrrrlllllldddddd!!!!” On the thunderous climactic chord - FREDDIE closes his EYES, chin raised, as if in prayer, then lowers his head, and opens his eyes - SMILING, EMOTIONAL, MOVED... CUT TO BLACK:  INT. BRIAN MAY’S RECORDING STUDIO (2016) -   MORNING  OLDER BRIAN  (emotional)  Write what you want. You people always do. I need to sleep.  (pointing an accusing finger)  Just don’t call him “wicked” or “corrupt”! -  (passionately)  -   he lived life !   To the brim! -  and perhaps -  (softening)  - yeah, over the brim - CONTINUED:   FREDDIE (CONT'D) (MORE) (CONTINUED)  147. (forcefully again)  - but he was always singing for the person right at the back of the stadium, the one who doesn’t fit in, the outcasts, the shy, and the pretty- damn-sure-they-don’t-matter. He showed them they too could fly, fly above the haters and the detractors and the pullers-down--coz   that’s   what rock and roll can do.   It can re-define you .  Dream heroic --and little Farrokh Bulsara did that. BLOGGER (nodding) “Re-define you.” In what way? OLDER BRIAN If you’ve never put on your   favourite  song and never   felt it --then you’ll never know.  (beat)  Freddie made you feel-- better --bigger-- braver...  (smiles, gently)  ... happier . Now that’s it, we’re done! We’re done. BLOGGER But we didn’t get to the end! The end of the story. OLDER BRIAN You know",
      "dialogue_count": 0,
      "word_count": 1121
    },
    {
      "scene_number": 19,
      "slugline": "INT. BLOGGER’S PARKED CAR (2016) - MORNING  CLOSE ON: A PLATE in the LARGE ATLAS...CAMERA shows “ZANZIBAR” and then moves and tightens on a small town... ... ” BISMILLAH ” FREDDIE (V.O.) “Cos these are the days of our lives They've flown in the swiftness of time These days are all gone now but some things remain When I look and I find - no change.”  EXT. SHIP - DAY  Young FARROKH BULSARA, stands alone at a RAIL on the deck of a SHIP, as it enters LIVERPOOL - a MIGRANT arriving in a new land... FREDDIE (V.O.) “Those were the days of our lives yeah The bad things in life were so few Those days are all gone now but one thing's still true  INT. BRIAN MAY’S RECORDING STUDIO (2016) - MORNING  BRIAN looks out the OPEN DOORS - sunlight falling on him... FREDDIE “When I look and I find, I still love you...”   (beat)  And then, as if directly to BRIAN himself - FREDDIE I still love you. CUT TO BLACK: RUN END CREDITS. Over this: roll FOOTAGE of the REAL FREDDIE MERCURY and QUEEN, from the video of “DON’T STOP ME NOW” - an uplifting and emotional performance of Freddie’s ode to joy.  THE END  151.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 210
    }
  ]
}