{
  "slug": "borat-subsequent-moviefilm-2020",
  "title": "borat subsequent moviefilm",
  "genre": "drama",
  "format": "film",
  "scenes_count": 10,
  "characters_count": 0,
  "characters": [],
  "total_words": 17414,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. MEDICAL ROOM IN PRESIDENTIAL PALACE - DAY  An old terrifying doctor, DR. YAMAK, gives Borat a MEDICAL and fills a SYRINGE. DR YAMAK These Gypsy Tears will keep you safe!  INT. ANOTHER ROOM IN PRESIDENTIAL PALACE - DAY  Borat is given his OLD SUITCASE. He opens it up. Inside is the iconic GREY SUIT. He tenderly pulls it out and smiles. END MONTAGE.  EXT. BORAT’S VILLAGE (KUZCEK) - DAY  BORAT (V.O.) Before I make commencings my mission... Borat, in GREY SUIT, returns to his old village. We pass a SIGN READING: “KUZCEK.” WOMEN pull CARTS with MEN on them. Borat greets them. BORAT I return to my village in order to give kiss to my sons and make sexy- time with my wiiife.  INT. BORAT’S OLD HOUSE - DAY  In his GREY SUIT, Borat, carrying A SINGLE FLOWER, runs up to his OLD HOME. BORAT (calling out) I back, everybody, I back! Borat walks in the door to find NURSULTAN TULYAKBAY in his house wearing Borat’s PAJAMAS and listening to Borat’s IPOD. Borat’s old CLOCK RADIO is also visible. BORAT (V.O.) But I discover that my neighbor, Nursultan Tulyakbay, had taken everything from me. My Michael the Mouse pajamas... and my sons. Bilak, Biram, and Hueylewis. 6.",
      "characters": [],
      "action_text": "He finds his THREE SONS: BILAK, BIRAM (a WOLF BOY), and HUEYLEWIS. HUEYLEWIS That’s not my name anymore. I’m so ashamed of you, I change it to... Jeffrey Epstein! They shoo him out the door.  INT. BORAT’S STABLE - DAY  Borat heads to the back of the house. BORAT (V.O.) All I had left was my livestocks. Two pigs... ON the PIGS. BORAT (V.O.) ... One cow... ON TILAP the COW. BORAT (V.O.) ... And a daughter. He hears audio. On a SHITTY TELEVISION: “ MELANIA .” Borat follows the sound inside the STABLE. NARRATOR (ON TV) Once upon a time, there was a lowly peasant girl called Melania from shit-hole country Slovenia, who dreamed of one day marrying a rich old man. Watching it is a dirty, wild-looking 15-YEAR-OLD GIRL (TUTAR), TIED TO A POLE. On it plays a CARTOON [drawn in 1950 Disney style]. BORAT I have a non-male son? Seeing him, Tutar turns and smiles. TUTAR Tatti...? Borat looks around. 7. BORAT Why are you living like this? TUTAR Because I have no husband to put me in a beautiful “wife cage.” Unlike that bitch Lilyat Sakanov. A SIMILAR-AGED GIRL IN A CAGE outside the HOUSE NEXT DOOR - LILYAT SAKANOV - gives her the finger. BORAT How old are you? TUTAR 15. BORAT Fifteen?! You are the oldest unmarried woman in all Kazakhstan! TUTAR I’m so happy that you’re back. BORAT I’m not. I’m off to US&A. TUTAR Please take me with you! BORAT Not possible. Tutar gets mad, goes off on Borat, YELLS AT HIM IN KAZAKH. Borat’s taken aback. Then she smiles, sweetly. TUTAR ...Please Tatti. BORAT Here... Borat pulls a PIECE OF ONION out of his pocket. BORAT (CONT’D) ...have a piece of onion instead. A GOVERNMENT AGENT pokes his head in. AGENT Sagdiyev! Jonny’s in the crate. You must leave now. Borat turns back to Tutar awkwardly. 8. BORAT Err, nice to meet you... Off Tutar...  EXT. VILLAGE / HIGHWAY OUT OF TOWN - DAY  Same one as in the first movie. VILLAGERS are gathered as per Borat’s departure in the first movie. In GREY SUIT. He picks up the HANDLES of the HAND CART with JONNY’S CRATE ",
      "dialogue_count": 0,
      "word_count": 1055
    },
    {
      "scene_number": 2,
      "slugline": "INT. HALLOWEEN COSTUME STORE - DAY  Borat talks to the STORE OWNER who shows him VARIOUS DISGUISES. He points to a costume. BORAT What is that? STORE OWNER That almost looks like you! On a costume labeled: “STUPID FOREIGN REPORTER.” BORAT Stupid foreign reporter? STORE OWNER Yeah, kinda looks like you, you got the dark hair and the mustache. BORAT No, but this is not like me. STORE OWNER I mean, it does look like you though. No? Borat frowns. He collects various costumes including a FAT SUIT, a bag of BULK WIGS, and another of ASSORTED NOSES. BORAT Thank you. STORE OWNER You’re welcome. Have a good day! He exits with MANY BAGS OF COSTUMES.  EXT/INT. INDEPENDENT ELECTRONICS STORE - DAY  SHOTS of PEOPLE in the street glued to their phones. BORAT (V.O.) Much had change since I was last in US&A. America had become calc-u- lattor crazy! Borat, in an UZBEK JOURNALIST DISGUISE, approaches the store. BORAT (V.O.) I needed to make purchasings of an electrical abacus. 12.",
      "characters": [],
      "action_text": "Inside he’s helped by a TECH EXPERT, BRIAN, who sells TVs, COMPUTERS, PHONES, VACUUM CLEANERS, etc. Brian sells him a phone. BRIAN I think we could get rid of this one for thirty dollars. BORAT Ah. What this? BRIAN FaceTime. BORAT Yes. They begin a FaceTime call each holding phones a foot away from each other. BORAT (CONT’D) Hello? BRIAN Hello. BORAT Who this? BRIAN This is Brain. BORAT Hello. I talk to him. Please be quiet. Hello. Ghost with blue shirt, answer me. You are a demon? BRIAN This guy that you’re seeing in the phone-- BORAT (to guy in phone) Please be quiet. TECH EXPERT --is me. BORAT What? BRIAN If I say something, he says something. 13. Borat, still hearing the voice in the phone, addresses it. BORAT Brian Brother. Please, you must be quiet. Speakings not polite. Brian moves on to explaining Google / the internet. BRIAN So I’m going to show you how you can ask Google questions and it’ll give you answers. He gestures to a TV SCREEN where he displays a Google search. He gives Borat a PHONE with a keyboard displayed. BORAT I can make a typings? BRIAN Yes. BORAT (reading) Restaurants near me. (then) Maybe I look for food that I like to eat. Borat types: “SPIT ROAST.” BORAT (CONT’D) ...and for dessert, um... He types “CREAMPIE” which causes PORN to come up. ON BRIAN’s FACE. BORAT (CONT’D) What this? BRIAN That’s not what you’re talking about I bet. Brian helps him pull up photos of food. BORAT This is for dessert? BRIAN No, this is probably what you’re looking for. 14. BORAT It has a pictures of a woman with no clothes? BRIAN ...Most likely. BORAT Wawaweewa. Can I make borrowings this for one moment? I need go toilet. You stay here. He walks away and ON THE SCREEN we see him type in: “BIG AFRICAN WOMAN TALL WHITE MAN SEX.” As he jerks off out of sight, we see porn AIR-PLAYED on the store’s television. BRIAN I think he’s figuring it out. Borat leaves with a USED SMARTPHONE with a CRACKED SCREEN. BORAT (V.O.) Brian use calc-u-lattor to find out that Jonny wou",
      "dialogue_count": 0,
      "word_count": 1894
    },
    {
      "scene_number": 3,
      "slugline": "INT/EXT. HORSEBOX / SIDE OF ROAD - NIGHT  Borat is digging a SHIT-HOLE under the cage. Tutar is BESIDE THE CAGE watching the ‘MELANIA’ cartoon on YouTube on the phone. NARRATOR (V.O.) One day, she was invited to a grand ball. ON PHONE SCREEN: KAZAKH CINDERELLA CARTOON. Melania is at a ball now wearing a YELLOW GOWN. NARRATOR (V.O.) When Fat King Donald saw Melania, he became more turgid than he’d ever been before... A TINY PENIS grows hard. NARRATOR (V.O.) ...So he grabbed her vagine... Donald and Melania waltz; he still has her in the vag-hold. Borat interrupts, having finished digging. She stops the video. He does a welcoming gesture, like a doorman at a posh hotel. BORAT Your palace... awaits. Ecstatic, she goes in to hug him but he rejects it. BORAT (CONT’D) Whoa, whoa, not allowed. She ENTERS the cage. BORAT (CONT’D) You like it? TUTAR It’s the best present I’ve ever had! Is it nicer than Melania’s cage? BORAT Not quite, but similar to cage of the wife before her... Stormy Daniel. TUTAR Ahh. 24.",
      "characters": [],
      "action_text": "BORAT Get some sleep. Tomorrow we will get you ready for Pence. Well, good night. TUTAR Tatti, I love you. BORAT Thank you.  INT. PICKUP - A LITTLE LATER  Tutar rides SHOTGUN inside the car next to Borat. TUTAR There is so little wind in here! (shouting from window) LOOK AT ME! I’M FLYING! Borat pulls her back inside. BORAT Get inside. TUTAR Where are we going? BORAT I am taking you to meet one of America’s leading feminists. TUTAR Oooo!  INT. LUXURIOUS HOUSE - DAY  Tutar meets SUGAR BABY MACEY CHANEL who hugs her. CHYRON: MACEY CHANEL INSTAGRAM INFLUENCER MACEY Hi, I’m Macey! It’s nice to meet you. TUTAR Nice meet you. MACEY Come sit with me. They take a seat. 25. TUTAR You are sugar baby? MACEY I am. TUTAR What is sugar baby? MACEY So pretty much a sugar baby is a younger girl like you and I and we’re dating someone who’s older. TUTAR Yes. MACEY And how old do you like them? That’s the question. TUTAR Nearly dead. MACEY Okay, then you should get someone who just had a heart attack. TUTAR Yes. MACEY Okay, high five. They high-five. MACEY (CONT’D) I love that. That’s what you want. As a woman, you never want to be a person who is aggressive. You want to be more submissive. TUTAR Oh. MACEY We have to be kind of weak. TUTAR But I am strong. I can open a beer with my small hole. 26. MACEY Look, we gotta be appropriate and ladylike... Macey watches as Tutar ATTEMPTS TO OPEN A BEER WITH HER ASSHOLE. MACEY (CONT’D) Okay. This is what you’re not supposed to do. The CAP OF THE BOTTLE POPS OFF. MACEY (CONT’D) Okay, you did do it. Okay, so we’re not gonna do what you just did ever on a date. Because if you do that, they won’t like you. You want them to like you. And so that way you can get money from them. TUTAR What can I do to make a man like me? MACEY You need a total makeover. Okay? From face to hair to clothes to personality to gestures and to what you’re doing? TUTAR Yes. MACEY Are you ready for a makeover? TUTAR Yes.  INT. PICKUP - DAY  OVER MUSIC: Borat drives, Tutar ",
      "dialogue_count": 0,
      "word_count": 1312
    },
    {
      "scene_number": 4,
      "slugline": "EXT. TEXAS STATE FAIR - THE NEXT DAY  ON a “TEXAS STATE FAIR” sign. Borat, in the AMERICAN “BOB CHEVROLET” DISGUISE, enters the fair with Tutar. He has her on a leash. She notices a FATHER holding hands with his DAUGHTER. TUTAR Look, Tatti! The fathers hold their daughters hands here! BORAT He probably forgot to bring a leash. DAUGHTER Daddy, hold my hand or they will know you are fake. Borat grabs a plastic bag and uses it to HOLD TUTAR’S HAND. She’s jumping up and down, thrilled. They do a little KICK DANCE together.  EXT. STREET / PARKING LOT - DAY  Borat, in the AMERICAN “BOB CHEVROLET” DISGUISE, and Tutar, in VILLAGE CLOTHES, are walking away from the fair. TUTAR Could a father ever love a daughter as much as he loves his sons? BORAT No, they are sentenced to death. TUTAR (acknowledging) Uh-huh.  INT. FANCY CAKE SHOP - CONTINUOUS  They enter a shop with a wide array of cakes, including a display of BABY SHOWER CAKES. He greets the CAKE SELLER. BORAT Howdy-doody. CAKE SELLER Hey, how are ya? 33.",
      "characters": [],
      "action_text": "BORAT I would like purchase uh, cake, prodigious size, made of chocolate for my glorious leader please. CAKE SELLER Okay. He’s shown a BIG CHOCOLATE CAKE - 18” X 6” BORAT Can you put message on it please? CAKE SELLER Yes, sir. What would you like on this? BORAT Jews. Will. Not. Replace. Us. CAKE SELLER Okay. She begins writing the MESSAGE in ICING - ‘Jews Will Not Replace Us’. BORAT And maybe a smiley face underneath. CAKE SELLER Okay. BORAT To put him in a good mood! She finishes. BORAT (CONT’D) Thank you. CAKE SELLER You’re welcome. BORAT If we could pack that up please, thank you. CAKE SELLER Yes. Is there anything else I can help you with? BORAT This is enough, thank you very much. 34. CAKE SELLER You sure? BORAT Yes, that’s it. CAKE SELLER Okay! TUTAR I want to have a cake too! BORAT No. Daughters are not allowed to have cake. She drops to her knees, begging. TUTAR Please! Please! Please! BORAT It is illegal to give you treat. (to cake seller) Teenagers! TUTAR Pleeeeease. Give it to me, Tatti. Give it to me, give it to me, give it to me. BORAT Okay. Choose cake, choose cake. She jumps up, excited. CAKE SELLER You want to pick it out? BORAT (laughing) I will regret this. TUTAR I want this one with the baby on it. She points to the BABY SHOWER cake with a 2-INCH MALE BABY FIGURINE on it. CAKE SELLER Okay. 35. BORAT It have a lot of cream... This is our little secret. The seller hands her the cupcake and she looks at it lovingly, then proceeds to take it to her mouth. Borat stops her. BORAT (CONT’D) No, no, no. I do not want the authorities to see.  EXT. ALLEY BEHIND CAKE SHOP - MOMENTS LATER  They go behind a DUMPSTER. Tutar holds A BIG CAKE BOX in both hands. Borat holds the CUPCAKE. TUTAR Ooo! I can’t wait to eat this! BORAT Hide back here. Borat looks around to ensure no one is watching. BORAT (CONT’D) Ready? Borat feeds the cupcake to her. She beams, it’s been the best day ever! She has BUTTERCREAM all over her face. BORAT (CONT’D) Okay, slow down! TUTAR But ",
      "dialogue_count": 0,
      "word_count": 2538
    },
    {
      "scene_number": 5,
      "slugline": "INT. CONVENTION CENTER - AUDITORIUM - CONTINUOUS  Borat BURSTS IN (SHOOT REACTIONS). Still carrying Tutar, he runs INTO THE SEATED AUDIENCE. He interrupts the speech: BORAT Michael Pen-is! Michael Pen-is! I brought the girl for you! CROWD MEMBERS grow angry. BORAT (CONT’D) Don’t worry, I won’t get jealous. She not Ivanka. CROWD MEMBER Get out!!! BORAT Mike! Michael Pen-is! Hey, you just hit me, sir! (then) Don’t punch me, sir! (then) Mike, help me! Pence shakes his head in dismay. BORAT (CONT’D) Mike! You’re fired!!! CROWD MEMBERS (chanting) FOUR MORE YEARS! FOUR MORE YEARS! FOUR MORE YEARS! BORAT Four more years! 100 MORE YEARS!  INT. CONVENTION CENTER - LOBBY - MINUTES LATER  Borat is seized by SECURITY who lead him out. SECURITY Don’t stop. Keep moving. Don’t stop. Keep moving! She SECURITY DOGS GROWL at Borat.  EXT. FAX STORE - DAY - DAY  Borat and Tutar arrive BACK AT THE SAME FAX STORE as before. 49.",
      "characters": [],
      "action_text": "BORAT (PRE-LAP) Please, make faxy-meal of this... Premier Nazarbayev, I have unfortunate news. Michael Pence did not accept her as a gift...  INT. FAX STORE - DAY  Borat, in GREY SUIT, is with the same FAX EMPLOYEE from earlier. He writes as Borat dictates. BORAT ... “Yours, Borat.” And then put sad face. FAX EMPLOYEE (drawing) Sad face. Mm-kay. He sends the fax, receives a response. On Borat’s face as he’s read the following: FAX EMPLOYEE (CONT’D) (reading) “Return immediately to die in excruciating pain. You will be tied to two cows who will face Uzbeks with turnips inserted in their assholes. Uzbeks will be enticed away with money and cows will follow to eat turnips, ripping you apart...” Borat looks sick to his stomach.  INT. PICKUP TRUCK - DAY  Tutar rides shotgun next to Borat who looks terrified. TUTAR What’s the matter, Tatti? BORAT Nothing. TUTAR Will they hurt you? BORAT Of course not. 50. TUTAR Could I be a gift to this friend of McDonald Trump instead? On the phone, she shows him a PHOTO of a MICHAEL FLYNN. BORAT No, he’s in jail. She pulls up a PHOTO of MICHAEL COHEN. TUTAR What about this one? BORAT In jail too. A PHOTO of STEVE BANNON. TUTAR Him? BORAT Arrested. A PHOTO of PAUL MANAFORT. TUTAR Him? BORAT House arrest. TUTAR What about Rudolph Giuliani? She pulls up a PHOTO of RUDY GIULIANI looking insane. ON BORAT. He does a U-turn in the pickup.  INT. FAX STORE - A LITTLE LATER  Back at the fax store, the employee pulls a message out of the fax machine. BORAT What it say? FAX EMPLOYEE (reading fax) ‘If you can deliver her to Rudy, you will live.’ 51. Borat smiles. Great success! BORAT High five!!! The fax employee high-fives him. FAX EMPLOYEE You’re not going to be killed. BORAT I love you.  A THIRD TITLE CARD: “BORAT - DELIVERY OF SEXY GIFT TO RUDY GIULIANI IN LAST-DITCH ATTEMPT TO SAVE BORAT FROM EXECUTION AND MAKE BENEFIT DIMINISHED NAION OF KAZAKHSTAN” INT/EXT. FOOTAGE - DAY  FOOTAGE of Rudy Giuliani making a speech. GIULIANI (FOOTAGE) Donald Tru",
      "dialogue_count": 0,
      "word_count": 630
    },
    {
      "scene_number": 6,
      "slugline": "EXT. OUTSIDE PLASTIC SURGEON’S OFFICE - DAY  SIGN: COSMETIC SURGERY CENTER Borat, in UZBEK JOURNALIST disguise, and Tutar, in her YELLOW DRESS, arrive. The walk to the door and both try to enter at the same time. BORAT After me.  INT. PLASTIC SURGEON’S OFFICE - MINUTES LATER  They meet an UNETHICAL PLASTIC SURGEON. BORAT I want very much her to be attract to top level guy. CHYRON: DR. CHARLES WALLACE, PLASTIC SURGEON SURGEON Well, what I would suggest is that we do some simple things. Like a little refinement of the nose-- TUTAR What’s wrong with my nose? Do I look like a Jew? SURGEON No ma’am. Not at all. Borat and Tutar are relieved. SURGEON (CONT’D) (demonstrating with nose) Because a Jew would be like this... BORAT (also demonstrating) Jew nose more like, out, out a bit more, down, here, then down a bit, here, bump, bump, in. SURGEON It can be that bad, yes. And then if you like, what I would suggest, is that maybe we put some breast implants. 53.",
      "characters": [],
      "action_text": "BORAT And what it mean, breast? SURGEON (grabbing chest) The breast. Titty. BORAT (confused) Titty? SURGEON Titty. BORAT (still confused) Titty? SURGEON Titty. BORAT (not getting it) Titty? SURGEON Titty. Borat looks to Tutar. TUTAR (learning) Titty. SURGEON Or breast. TUTAR I want a man who wants to make a sex attack on me. SURGEON Mm-hmm. (beat) Well, I think that would be most men. TUTAR Would you make a sex attack on me? SURGEON If your father was not here. Or if we were together... 54. Borat and Tutar high five.  INT. PLASTIC SURGEON’S OFFICE - RECEPTION - MINUTES LATER  Borat and Tutar speak with an ACCOUNTS MANAGER. ACCOUNTS MANAGER Hello. BORAT Hello. ACCOUNTS MANAGER So all together, the total is $21,751. BORAT How much? ACCOUNTS MANAGER $21,751. BORAT Tenge? Or dollar? ACCOUNTS MANAGER Dollars. He FARTS when he hears the cost. BORAT Okay. With the saline implant-- ACCOUNTS MANAGER Yes. BORAT --Could you take off some money if instead you use potatoes. ACCOUNTS MANAGER We cannot use potatoes. BORAT Why not? ACCOUNTS MANAGER Because potatoes aren’t sterile. BORAT This a very good potato... 55. ACCOUNTS MANAGER But you cannot take a potato and put it in the body. BORAT What if we allow perverts in to watch the surgery. Can we have reduction? You can keep the money that they pay you. ACCOUNTS MANAGER Uh, absolutely not. The more people you bring in, the more germs come in. You cannot do that. The perverts have to be medical personnel. They have to be either a doctor or a nurse. BORAT I want to make sure that the man I give her to is very happy and will not return her. ON TUTAR, she looks sad. ACCOUNTS MANAGER Okay. BORAT So the quality must be tip top. Will it be? ACCOUNTS MANAGER It’ll be tip top. It’ll be more than tip top. Are you able to pay this amount? BORAT Yes, I have. He puts a SUITCASE full of MONEY on the desk. ACCOUNTS MANAGER Okay, thank you. As the ACCOUNTS MANAGER counts out money (most of which is $1 bills) Borat and Tutar take a seat. BORAT Th",
      "dialogue_count": 0,
      "word_count": 689
    },
    {
      "scene_number": 7,
      "slugline": "EXT. STREET / BABYSITTER’S HOUSE - NEXT DAY  Borat, in GREY HERO SUIT, and Tutar, in YELLOW TOP and JEAN OVERALLS with TOO-HIGH HEELS, walk up to a modest home. BORAT (V.O.) To pay for new chests, I would need employment. So next day, I leave my daughter with babysitter.  EXT/INT. BABYSITTER’S HOUSE - DAY  Borat RINGS the doorbell. It’s answered by a REGULAR AFRICAN- AMERICAN BABYSITTER. SHE’S VERY CONFIDENT. She represents the mother Tutar never had. BABYSITTER Hello. BORAT Uh, what your name? BABYSITTER Jeanise. CHYRON: JEANISE JONES BORAT Jeanise, nice meet you. BABYSITTER Nice meeting you. Borat uses a CLICKER to signal Tutar inside. She ALMOST TRIPS on her heel. Borat feeds her a TREAT. She goes to crouch in the corner on her heels. BABYSITTER (CONT’D) So what is that, like a treat? BORAT Treat, uh, yeah. When she perform a command correctly. Click. You give her treat. BABYSITTER Um, oh. Okay. Borat hands over a BALL AND CHAIN. BORAT This is her ball. It make her feel safe. 58.",
      "characters": [],
      "action_text": "Borat gives a list of ABSURD ways to discipline and look after her [much like she was an animal]. BORAT (CONT’D) For water... please use this. He hands her a DOG BOWL. BABYSITTER We drink water out of a glass. BORAT The strings in her brain might break if you try to teach her so be careful please. BABYSITTER You said... the strings in her brain might break? BORAT The can be strain and sometimes pop. One of them already... she saw something and that was complicate for her... and I hear the noise. He mimics the noise. BABYSITTER (sotto) Oh my god. (sarcastic) Really? Borat heads out the door. In Kazakh: BORAT See you later. TUTAR Don’t leave me here. BORAT See you later at the Titty Doctor! He closes the door. BABYSITTER Alright...  EXT. PICKUP / STREET - DAY  TRANSITION DRIVING. Borat drives. 59. BORAT (V.O.) The operation was five hours away. Luckily, I get hired to do a job.  EXT/INT. BARBER SHOP - DAY  Borat, in GREY SUIT, is working as a HAIRDRESSER. A stiff, cantankerous, OLD WHITE GUY, RANDY, is in the chair. BORAT What would you like? I can take it all off? CHYRON: ALAN “RANDY” KNIGHT RANDY Keep it where it’s, you know, above the ears is fine. Borat pats the guy all over his head, neck, and shoulders. He puts SHAVING FOAM on the guy’s arms. BORAT Want me to shave your arms? RANDY No. BORAT No? RANDY No. You’re not going to shave my hair off, are ya? BORAT No, no, no. RANDY Okay. BORAT I have good work. I have done... From his pocket, he pulls out PHOTOS of his work as a barber in Kazakhstan, mainly with livestock, and presents them. RANDY But you do mostly animals though, right? 60. BORAT Uh, no. This Billy Sexcrime before they remove his chram, I remove his pubis. I was given honor. RANDY Oh, that’s great. Borat snips a bit of hair and shows it to the guy. BORAT To you satisfaction, sir? The guys nods. He snips another bit, presents it to him. The guy nods. RANDY That’s fine. And another bit. RANDY (CONT’D) That’s fine. And again. RANDY (CONT’D) That’s fine. ",
      "dialogue_count": 0,
      "word_count": 2571
    },
    {
      "scene_number": 8,
      "slugline": "INT. SYNAGOGUE - DAY  Borat, comes in DRESSED AS A JEW - a MASSIVE 12 INCH NOSE, BAT WINGS, a bag with DOLLAR SIGNS and a MARIONETTE with a MEDIA badge. Two octogenarian LOVELY JEWISH WOMEN - DORIS and JUDITH - are there. DORIS Hello. BORAT Uh, Jag-shalom. Are you a Jew? DORIS Yeah, I’m Jewish, yeah. BORAT Very nice weather we have been controlling. JUDITH You are Jewish? BORAT Um... (shaky) Ye-- Yes. JUDITH No, you are not Jewish. JUDITH (CONT’D) Listen. She inches closer to him. He backs away. JUDITH (CONT’D) Don’t be afraid of me. BORAT But please don’t eat me alive. JUDITH Do I look like I eat people? BORAT Uh... JUDITH I’m an old, good woman. BORAT Yes... 75.",
      "characters": [],
      "action_text": "JUDITH Look at me. I am Jewish. Do I have a long nose? Borat studies her face. BORAT No. JUDITH Look at me. You can touch my nose. BORAT What? Borat tentatively reaches out and touches her nose with his JEW CLAW FINGERS. JUDITH You see? Is it long? BORAT No, it’s a small one. JUDITH Exactly like yours. Look at Doris. Does she have a long nose? BORAT A little bit bigger than yours. JUDITH So, we are normal, exactly like you. BORAT Okay, then, use your venom on me and finish me. I am very depress. JUDITH Can I give you a hug? As she goes in for the hug, FOREBODING MUSIC PICKS UP. Borat stiffens. BORAT Don’t kill me. JUDITH I will not kill you. Let me give you a kiss. He WHIMPERS as she presses her lips to his cheek. 76. JUDITH (CONT’D) You see I give you a kiss and you are still alive. BORAT For now I am, but maybe the venom take longer. JUDITH (loving) Oh, come on, you will be okay. BORAT I am hungry. JUDITH You are hungry? BORAT Yes. CUT TO:  INT. SYNAGOGUE - 15 MINUTES LATER  Borat eats CHICKEN SOUP with the lovable women. JUDITH Good, huh? BORAT Very good. JUDITH Very good, huh? (then) I want to hear your story, my dear. BORAT This is the worst story that ever happen to any human being... or Jew. I came here on a simple mission to save my country by delivering by number one televiski star, Jonny the Monkey, as a gift to Michael Pence... and I’m sure you’ve figured out what happen next - my daughter had smuggled herself into the crate - and yes, you got it - she’d eaten the monkey... Judith scratches her head. 77. BORAT (CONT’D) Although, I believe he probably eat himself... JUDITH There are bad stories out there. Listen, you want to hear my story when I was a little child? BORAT Yes, what is your story? JUDITH I was in the Holocaust. You see me? I was in the Holocaust. BORAT The Holocaust?? You were in the Holocaust? JUDITH Yes. BORAT But the Holocaust never happen. JUDITH (pointing to eyes) But I saw it with my own eyes. ON Borat, in shock. BORAT (suddenly lights",
      "dialogue_count": 0,
      "word_count": 6102
    },
    {
      "scene_number": 9,
      "slugline": "EXT. VILLAGE - DAY  On Borat: BORAT Bride exports declared misogynist so we now traffick grooms.  EXT. DOCKS - DAY  A mirror of the first video clip. Eight 14-year-old boys dressed in TUXEDOS are loaded into a CRATE with the label “Ship To: K.Spacey.”  EXT. VILLAGE - DAY  Back on Borat. BORAT We use my iPhone 4’s hotspot and steal password from assholes Uzbekistan.  INT. TROLL FARM - DAY 117   117  Hundreds of WOMEN working. BORAT (V.O.) Now we are part of the global community... Influencing elections around the world! An 8-YEAR-OLD KAZAKH GIRL types on Facebook: “...speaking as a black man, I love Trump.  EXT. VILLAGE - DAY  TIGHT ON Borat as he lowers his MASK. BORAT Kazakhstan now center of Covid-safe nation. We invent the mask-ini! PULL OUT to revel his mask is attached to a mask cockpouch. He does a little dance in it. 116.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 149
    },
    {
      "scene_number": 10,
      "slugline": "EXT. VILLAGE - DAY  People line up to get their temps checked. A guy pulls his pants down and turns around to have thermometer inserted in his asshole. BORAT (V.O.) Our people are kept healthy with daily hygienic temperature checks. The next person comes up and lowers their mask. They use the same thermometer in his mouth. BORAT (V.O.) Our fatality rate plummet to 92%.  EXT. BORAT’S HOUSE - DAY  Borat proudly wears his MICKEY MOUSE PAJAMAS and heads outside his house. BORAT And best of all, I am reinstate as number four most popular journalist in all of Kazakhstan. Who number three? TUTAR Tutar Sagdiyev. REVEAL TUTAR in a grey skirt suit. BORAT Why not? May the patriarchy go to hells. TUTAR Nice! BORAT No, “niiiice.” TUTAR Don’t mansplain to me. BORAT (shrugs) Feminist. FLASHBACK TO: 117.",
      "characters": [],
      "action_text": "EXT/INT. VARIOUS SHOTS - FLASHBACK [PREVIOUSLY SHOT]  Various shots from Borat’s travels in the US. BORAT (V.O.) My visit to US&A make me realize that greatest threat to Kazakhstan is no longer the Jew! It is in fact... the Yankee!  EXT. COBBLE STREETS - “RUNNING OF THE YANK” - DAY  KAZAKH TV FOOTAGE: REVEAL Borat and Tutar are dressed in IDENTICAL SUITS talking to camera. With KAZAKH TV MIC CUBES. They report: TUTAR Jagshemash. Welcome to the first ever-- BORAT --Running of the American! REVEAL the COBBLE STREETS. THE GUYS IN WHITE RUNNING UP STREET. It’s like the first movie again. CHYRON: THE RUNNING OF THE AMERICAN The CROWD all wear MASKS. BORAT (CONT’D) They’re starting to run! Here comes the American! An AMERICAN HEAD, very white face, a MAGA caricature, with a MAGA HAT, BEARD, holding a BURGER. BORAT (CONT’D) Oh no, he’s got a fever. TUTAR He’s not wearing a mask. GREEN LIQUID SPEWS out. BORAT And here comes Karen! MRS. AMERICAN (aka KAREN) has an AR-15. Wearing a T-SHIRT that says “ALL LIVES MATTER.” 118. TUTAR She’s being a little bit racist! She’s going to cough. GREEN LIQUID SPEWS out from Mrs. American too. BORAT Here comes the Chief Medical Expert. A SCIENTIST with a WHITE COAT and huge SYRINGE. TUTAR And he’s got a vaccine! BORAT Everybody’s going to be saved! Mrs. American aims her gun. BORAT (CONT’D) Uh-oh. She’s been to Walmart. She’s got her AR-15. TUTAR Karen is not happy. Mrs. American shoots Fauci. The crowd BOOS. BORAT Oh no, she’s killed Fauci! The Americans are victorious in their battle against science. TUTAR For Kazakhstan Televiski, this is Tutar Sagdiyev... BORAT ...And Borat Margaret Sagdiyev. BORAT/TUTAR Chenquieh. Borat and Tutar put their arms around each other. BORAT (to Tutar) You were amazing! They wave as we PULL OUT...  THE END.  119. CARD: NOW VOTE OR YOU WILL BE EXECUTE CARD: BORAT SUBSEQUENT MOVIEFILM: DELIVERY OF PRODIGIOUS BRIBE TO AMERICAN REGIME FOR MAKE BENEFIT ONCE GLORIOUS NATION OF KAZAKHSTAN 120.",
      "dialogue_count": 0,
      "word_count": 474
    }
  ]
}