{
  "slug": "boy-erased-2018",
  "title": "boy erased",
  "genre": "drama",
  "format": "film",
  "scenes_count": 22,
  "characters_count": 5,
  "characters": [
    "JARED",
    "SYKES",
    "MARSHALL",
    "JON",
    "XAVIER"
  ],
  "total_words": 26796,
  "total_dialogue": 8,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. MEMPHIS SKY / CARPARK, 2004 - DAY  1 .  We hold on a big slice of MEMPHIS BLUE SKY. The only sound is the out of focus American flag whipped by wind in the distance. Soon after we hear, but don’t see - A car pull up on the gravelled asphalt and - The beeping of the door as it opens. From it spills the radio sounding out the ‘90s country hit - ‘Check Yes or No’   by George Strait.  GEORGE STRAIT I think this is how love goes. Check yes or no.  And - a fresh faced young man, 18, stands up filling the frame, looking out into the distance. This is JARED EAMONS. He wears an ultra crisp white shirt buttoned to the neck with no tie. He is slim and wears his hair cropped short. The camera moves slightly to take in an out of focus church cross atop a basic baptist steeple ahead of him. All the while - that distant American flag, flapping in the breeze, flanks him from behind. A second door opens O.S., spilling out that music again -  GEORGE STRAIT (CONT’D) Now we’re grown up, and she’s my wife. Still like two kids and stars in our eyes.  - and now - Jared’s mother NANCY steps into frame. She is made up to the nines: bottle blonde voluminous hair, hoop earrings and thick mascara. Underneath her heavy make-up we can see concern. She slides on Jackie O sunglasses and looks out toward the steeple as Jared turns toward the flag. They both seem lost. Nancy hides her concern behind the shades, tries a bright smile and, out comes her chirpy southern voice - NANCY Are you ready, honey? Jared looks away for a beat, then turns with a convincing  smile and starts walking. They leave frame.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 306
    },
    {
      "scene_number": 2,
      "slugline": "INT. L.I.A. FOYER - CONTINUOUS  L.I.A. is an acronym for ‘Love In Action’ -- But we should not know that yet. There is no signage. Grey-blue carpet covers an expansive floor space. Stark white walls with no hangings or decorations. Some empty basic chairs lining one section of wall. Heavy doors lead off to unknown rooms. A potted plant in a corner seems an afterthought.  N.B.: For now we should see it as a dry, clinical facility. It should feel like a juvenile detention center of some kind.  -- Through the glass of the aluminum framed doors we see Jared and Nancy approach uncertainly - then enter. Nancy’s ensemble is elegant, if not a little gaudy and mismatched: a Southern Belle dress and a shoulder padded coat. She wears heels and clutches a white bedazzled purse. Jared’s white shirt is tucked into a pair of brand new khakis with no belt. He wears rubber soled black shoes and holds a book in a blue plastic shopping bag. They look an odd pair: A tall ‘Tammy Baker’ mother escorting her awkward, ultra conservative, son. MALE VOICE O.S I help you? What’s your name? Nancy turns, taking her sunglasses off. AARON (40s) stands inside a reception booth: Stocky, with a severe hair-cut, he puts a clipboard on the reception ledge. NANCY Nancy. AARON The kid I mean. Unless you’re the one checking in. Jared and Nancy, side by side at the reception desk, sign the clipboard document. Aaron stands erect with his authority inside the booth. He too wears khakis and a white shirt, along with a blue tie and a name badge. He sizes Jared up. AARON (CONT’D) Let’s get you checked in properly Jared. Wanna say your good-byes? He comes out from the door of his reception booth.  2.",
      "characters": [],
      "action_text": "NANCY Can I see the place? AARON Afraid you won’t be allowed beyond the reception area Missus Eamons. You can pick him up at five P.M. On Nancy, uncertain -- JARED It’s okay mom. NANCY Call me if you need anything. I’ll be at the hotel and on my cell ph-- AARON We’ll be holding his cell-phone. If there are any emergencies we will contact you. Otherwise, five P.M. Aaron punches a code into the door and the door mechanism releases with a mechanical buzz. Jared and Aaron pass through the secure door to a hallway, leaving Nancy waving nervously goodbye. INT. HALLWAY - CONTINUOUS  Jared walks ahead as Aaron follows him. When Jared turns, the blank expression on Aaron’s face troubles him a little. AARON Door on the right. They stop in front of the third door and Aaron knocks. Soon - A tall, skinny blonde man (Michael, 24) answers the door. His shark grey, piercing eyes are almost permanently set in a judgmental frown, giving him a mean-streak air. AARON (CONT’D) Newbie. Eamons. INT. OFFICE - CONTINUOUS  Michael picks through Jared’s possessions, scrutinizing each thing placed down: coins; cash; gum; a plastic hotel key- card; the bag containing the book, and; his wallet.  3. He starts going through the wallet, while throwing the gum in the trash. Jared reacts. Jared holds out his cell phone unsure who to give it to. Aaron takes it from Jared and puts it with the pile. MICHAEL Do you have any numbers or photos we need to be concerned about? On Jared. Thinks. Shakes his head slowly. It reads like he is not convinced. Michael’s eyes drill into him. MICHAEL (CONT’D) We will check this daily for any ‘False Imaging’ and call any numbers we want to at random. So best you be straight with all this. JARED There is nothing... And yeah, call whatever numbers if you need to. Michael, now back in the wallet, holds up a business card. And flips it... a handwritten cell number on the back. MICHAEL Who will answer if I call this number? JARED Umm. It is my doctor. (beat) It’s her off hou",
      "dialogue_count": 0,
      "word_count": 3386
    },
    {
      "scene_number": 3,
      "slugline": "EXT. LAKE - NIGHT  A sprawl of wet, undressing youth all in bathers or underwear. Jared strips down and heads for his teammates who are already splashing in the water. He passes - A flat-bed truck that is reversed close to the water’s edge. A couple of guys are trying to set up speakers. Meanwhile - Chloe and the girls undress more carefully, hanging clothes in trees or folding them into neater piles. Then the music BLARES, received with a victorious cry. Bring Me to Life - Evanescence. Another cheer rings out simply for the choice of song. Through the opening riff - The girls continue to undress while - In the lake other kids start to ‘air-drum’ to the song. Jared and his mates tune in too, all playing their air guitars. Then, as the song shifts gear, Wayne splashes Lance and the others and they start to wrestle and play-fight - Jared jumps into the fray, grappling with Wayne, fully committing to the camaraderie. Then - Wayne breaks free. WAYNE Holy.... Dude. Check it out. And then Jared turns to see - - what would normally make any teenage boy quiver immediately: Chloe in a white bra and panties, semi see- through when wet. She is full breasted and wading, barely hip deep, in the water. The boys all stare - at the trio of girls: pure teenage fantasies wading in the lake. Jared turns back to the guys. WAYNE (CONT’D) Bro. What’s wrong with you? Go. Go. That’s the trophy. The guys all push Jared toward Chloe. It’s a slow approach. WAYNE (CONT’D) You know white is see through when it’s wet Chloe? A few chuckles from the boys.  17.",
      "characters": [],
      "action_text": "CHLOE I heard that laugh before. I think on a documentary about hyenas... that were retarded. And their retarded friends. Jared laughs like a goof at Chloe’s joke. WAYNE You may as well take it off, cause we can pretty much see it all. CHLOE Shall I..? Okay... (she teases) Oh, But I wouldn’t want you guys to pollute the water with all your... WAYNE Say it. You can’t even say it. CHLOE Cum. Shock. Off Wayne’s expression she turns to the girls. CHLOE (CONT’D) See. He just did I bet. You guys actually have hard-ons right now don’t you? Blank expressions. Wayne gives an ‘as if’ response. CHLOE (CONT’D) Prove it?! Long pause. Jared certainly doesn’t have a hard-on but wonders if he should. Chloe won’t let up. CHLOE (CONT’D) Stand up properly. All of you. None of them are willing. Finally Lance goes up on his tip- toes. We don’t see it but Chloe must be right because Mindy stifles a laugh and Cheryl turns away with an ‘Ewwww.’ Lance drops back down into the water. He doesn’t care. LANCE Damned if you do. Damned if you don’t. Then - Chloe splashes Jared, breaking the tension and they all start to wrestle, thrashing in the water.  18.",
      "dialogue_count": 0,
      "word_count": 493
    },
    {
      "scene_number": 4,
      "slugline": "EXT. LAKE-SIDE BEACH BONFIRE - NIGHT  Jared and Wayne by the bonfire. Lance and Nick dress close by. Wayne offers sage advice on sex - JARED What’s it like? WAYNE We’ve done it four times now. Jared nods. His friend is an expert. WAYNE (CONT’D) It’s pretty awesome dude. I have to say. I mean, I’m sure it’d be even better just relaxing on a nice bed instead of in the corner of a barn or in some dark closet with an actual real fear of getting caught and shot by Mr. Riggs. But - Even still, it’s a-mazing. (beat) It’s like being in a place you’ve been told over and over is bad and then you get in there and you are like - ‘how is this bad? I wanna be in here forever.’ LANCE Like White Castle. NICK Like eating a burger?? LANCE Like shut up.   NICK (CONT'D) You compared sex with a girl to eating shitty food. Lance punches Nick and Nick returns fire. Soon they are up wrestling each other. Wayne and Jared.  LANCE O.S. Get off me, fag. Faggot!!  WAYNE It’s warm. And it gives you this amazing great feeling. JARED I bet yeah  19.  (MORE)",
      "characters": [],
      "action_text": "WAYNE Plus, man. Listen. This whole no sex before marriage thing... would your dad expect a customer to buy a car without test-driving it? See. You almost have to try it. (good point) You won’t wanna stop dude. Seriously. Try it. You’ll see. This lands with Jared. The thought that maybe sex with Chloe could make him snap out of his thoughts aimed at men. He looks across at her on opposite side of the fire. She has finished dressing and wears his hoody. INT/EXT JARED’S FORD / CHLOE’S FAMILY HOME - NIGHT  Elton John’s - “Sad songs said so much”   plays as Jared pulls up to Chloe’s family home. Their hair is still wet. CHLOE Go back behind the tree. JARED I should get home. I - CHLOE We are fifteen minutes early. He reverses so a large maple tree blocks the view from the house to the car. She immediately starts to kiss him. Jared engages. Then his eyes open, looking down -- A hand, Chloe’s hand, is on his thigh. He stops her. CHLOE (CONT’D) What? I just wanna touch it. (beat) On the outside. Jared keeps his hand on hers. CHLOE (CONT’D) If it’s not hard, I can make it hard. JARED We should wait for that kind of -  20.  JARED (CONT'D) CHLOE I’m not asking you to put it inside me, Jared. I just wanna feel it through your jeans  20A.  (MORE) . Wayne and Mindy have gone all the way and they didn’t get struck by lightning or put in prison. Cheryl has put at least three in her mouth that I know of. JARED Cheryl? CHLOE I just wanna feel it. JARED If we start that, then it’s gonna be hard to stop. I want to but shouldn’t we wait until, you know - CHLOE You asking me to marry you? (beat. Silence) That’s what my parents think should happen. To keep us together through college. Jared is at a loss for words. Then Chloe tries one more time. He stands his ground. She sits back defeated and opens the door. CHLOE (CONT’D) What is wrong, Jared? Jared is left alone, aware this is an escalating issue. INT. EAMONS FAMILY HOME - JARED’S BEDROOM - DAY  Jared, shirtless, staring at a screen. ",
      "dialogue_count": 0,
      "word_count": 889
    },
    {
      "scene_number": 5,
      "slugline": "EXT. EAMONS FAMILY HOME   - DAY  Jared and his father get in Jared’s car as Nancy waves to them. She is setting up her easel and paints beside Marshall’s other hobby: a restored ‘65 Chevy Pick-Up. MARSHALL O.S. You are both mature kids. EXT. INDUSTRIAL COUNTRY ROAD - DAY  Jared’s car turns into the Ford dealership. INT. EAMONS’S FORD DEALERSHIP - DAY  Jared walks through the dealership following his father. Jared shakes Big Jim’s hand and is greeted by other workers.  MARSHALL O.S. Who know how to conduct themselves -  MARSHALL Big Jim. Lead us in prayer today? JIM Be proud to Captain. Jared.  MARSHALL O.S. - and who know by now how the world works.  INT. DEALERSHIP FLOOR - LATER  There among the display cars Jared, Jim, AND FOUR OTHER CO- WORKERS, lock arms in prayer. JIM Dear Heavenly Father. Thank you for this day filled with sunshine -- OMITTED  INT. LUNCH ROOM - DAY  Jared devours ‘To Kill a Mockingbird’ over lunch --  23.  MARSHALL (CONT'D)",
      "characters": [
        "JARED"
      ],
      "action_text": "MARSHALL O.S. You gotta learn to take small steps toward manhood, so that you don’t have to run, panicking, when it suddenly arrives.  Across the table, a voluptuous female employee eats lunch reading a magazine. Jared shares an awkward smile with her. OMITTED  OMITTED  INT. FIRST NATION BAPTIST MINISTRY - DAY  On Jared, flanked by Nancy, watches Marshall preach. MARSHALL Let’s see a show of hands -- Wayne, who sits next to Jared, palms him something. A condom. He winks. Jared is mortified. MARSHALL (CONT’D) Who knows they are imperfect? Everyone’s hands go up. Jared swaps the condom in his hands to comply with all the hands firing up in the air. MARSHALL (CONT’D) And those that are? No hands - a polite chuckle from the congregation - MARSHALL (CONT’D) Well, that seems like the perfect segue to my introduction. Jesus spoke to me the day I saw this man first speak, and said ‘listen to, and learn from, this man.’ Which I have done every week in this very church. He has helped me immensely and given me the strength to start my own mission at Mountain Home. Jared catches eyes with Chloe -  24. MARSHALL (CONT’D) He’s about as perfect as any man can get in this world and in his true service to the Lord. My mentor, Pastor Lynn Marks. He passes the mic to the elder Pastor. Marshall then sits in front of Jared and turns with a smile and a weird high- five/handshake. Pastor Wilkes climbs the stairs. PASTOR Everybody stand up. On your feet. And such is Pastor Wilkes’ power: the congregation stand. INT. CHLOE’S FAMILY HOME - NIGHT  Jared sits for dinner with Chloe, her parents ERIC and BRANDY and her fifteen-year-old brother CHRISTOPHER. Secretly, Chloe reaches her leg out to touch Jared’s thigh. ERIC So a semester at Lyon, and then Chloe was saying you hope to bridge over to U.N.C by next year? JARED Yes, sir. They have a great writing program. Journalism really interests me - ERIC Well. We’ll have to find ways to keep you guys connected. Looks all around. The conversation is ",
      "dialogue_count": 1,
      "word_count": 560
    },
    {
      "scene_number": 6,
      "slugline": "INT. STAIRWELL - NIGHT  Jared moves ever so quietly up the stairs. But then - CHRISTOPHER O.S. Where you think you’re going? Jared frozen, turns to see Christopher. Sprung. INT. BASEMENT - NIGHT  Jared plays Dynasty Warriors III with Christopher. The music is synthesized and upbeat.   The character, Zhang, looks like an Asian rock prince, clad in purple silks, wearing a slick hair topped by a tiara. He swings a four pronged sword. CHRISTOPHER What do you think of him? What’s- his-face, Zhang He, there with his girly crown and pony tail in the purple outfit moving around like a dancer. JARED Yeah. It’s a bit much. CHRISTOPHER A bit gay don’t you think? Jared looks at Christopher. CHRISTOPHER (CONT’D) Don’t you think? They stare at each other. Something shared in the look. Dangerous and also tender. There is a wisdom to Christopher for a younger kid. The silence broken only by a text message. CHRISTOPHER (CONT’D) You wanna go and fool around with my sister, I ain’t gonna stop you. Hold.  26.  JARED (CONT'D)",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 176
    },
    {
      "scene_number": 7,
      "slugline": "INT. CHRISTOPHER’S BASEMENT BEDROOM - NIGHT  Jared stares at the ceiling, then finally turns to fall asleep. He’s given up the attempted mission. CUT TO  26A.",
      "characters": [],
      "action_text": "INT. L.I.A. MAIN AUDITORIUM - AFTERNOON (PRESENT)  Jared stands back from his Genogram and stretches. He making some notes on his L.I.A. notebook. INT. L.I.A. ADMIN OFFICE - LATE AFTERNOON  Jared is handed a zip-lock bag containing his possessions by Michael. Jared opens his phone, just to check it. MICHAEL Tomorrow at nine. Jared starts to walk toward the exit, as Michael moves back down the bowels of L.I.A. Jared turns, holding his Moleskin. JARED Um. Hey. You tore out the pages - MICHAEL False Imaging. Jared looks at the book with the pages crudely ripped out. JARED They’re just... stories. MICHAEL Sykes will decide that. EXT. L.I.A. - AFTERNOON  Jared comes out quietly fuming, holding his bag of items. Jon is on the steps waiting. Jared sits a little way off. JON Whatever they took, you’ll probably get it back. Don’t sweat it. Jared tries to let it go. JARED Were you in the military? I saw you salute. I thought -- JON Oh. That. No. I could do the whole handshake thing. I’m just trying zero contact what-so-ever.  27.  (MORE) Twenty-three days now. So I - (he salutes) Salute instead  27A.  JON (CONT'D)  (MORE) Jared nods awkwardly. JON (CONT’D) Sure it don’t feel like it right now maybe but you’ll love it here. You get all sorts but this group seems good. JARED Have you been here before? JON It’s my second go round in the Refuge Program. I started a couple days late last time and - (beat) I’m actually waiting for a place to open up in one of the houses. JARED What houses? JON Down the back there, past the fence they got a couple houses for the long-stayers. New Hope house for the men. One for the women too. (points) Those others you saw earlier today, most of them stay there. (beat) Meanwhile, I’m at the Best Western while I wait for my spot. Assuming you’re staying at one of the local ‘safe zone’ hotels with a relative too? Jared takes this in. JARED How long will you stay for? JON That’s not really up to me. Sykes decides - sometimes six months. Or else a year. ",
      "dialogue_count": 0,
      "word_count": 1037
    },
    {
      "scene_number": 8,
      "slugline": "INT. HAMPTON INN AND SUITES ROOM - NIGHT  Jared puts his schedule on the wall. He takes his L.I.A. handbook and homework and piles them on the nightstand. He weighs his own books he brought for the stay -- now certainly ‘off limits.’ About to place them in the trash, he thinks better of it and piles them over on his mother’s nightstand. Nancy enters from the bathroom and places a piece of paper on the top of his L.I.A. handbook: Jared’s Genogram homework. NANCY Sleep well. Big day tomorrow. As she walks away, he examines the paper. NANCY (CONT’D) I was only with the gang for a year or so... Until I went down for drugs, and got sent to prison. JARED Ha ha. Jared leans over and switches off the lamp. Then after a pause in the near darkness we hear - NANCY O.S. I put your Uncle Victor down there. We never see him. He moved to Louisiana. We always figured he might have been... well, he was very feminine-like you might say. Jared stares at the ceiling, the traces of light outlining his face. SYKES O.S. What is a real man? INT. L.I.A. MAIN AUDITORIUM - MORNING  CLOSE ON JARED’S GENOGRAM. It now has a handful of ‘A’s added and ‘Dm’ in both grandparents lines. And a new BOLD addition...   UNCLE VICTOR -- ‘H.’   (Homosexuality)  SYKES O.S. What defines a ‘real’ man? Close on Cameron’s child-like drawing of his dad: Brutish.  32.",
      "characters": [],
      "action_text": "SYKES O.S. (CONT’D) Perhaps being close to the flames of hell and finding your way back forges a great strength -- Jared and the others pin their work to the back wall. From his position near the big open door, Jared can see the fence line outside: A big black Chevy pickup parks outside. OMITTED  INT. L.I.A. MAIN AUDITORIUM - DAY  Close on the members of the group as they keenly watch the ‘newcomer.’ SYKES O.S. And if so... if this isn’t a real man, I don’t know what is. Sykes is almost too excited to introduce their guest staff member. And we finally see him - SYKES Meet Brandon Ellis. There is no mistaking, Brandon is a hard man, who’s lived a hard life, and walked a hard road. That 1% that makes most self-proclaimed men feel ‘less than.’ SYKES (CONT’D) Over to you Brandon. Sykes tries a tough-guy handshake. It is comfortable on Brandon. Not with Sykes. BRANDON Thanks Sykes. Mighty kind of you and... God bless. (beat) A ‘real man’ to me is a man of God first and foremost. I’m a man of God no doubt. But, I wasn’t once. If I was ever listed on my own son’s Genograms - God forbid I was and that he were here - In that comment we see not just Brandon’s thinly veiled disgust for homosexuality  33. BRANDON (CONT’D) - But   if I was : Drugs. Violence. Prison time. Gang crime...   I’d have so many letters next to my name, it would look like qualifications from some university. (pause for effect) And I actually believe that to be true. I’m qualified to be here, not maybe because I have ever had the kinds of thoughts and feelings that y’all are wrestling with. Or that your other guidance counselors have overcome. There is the disgust again. PLUS it dawns on Jared that most of the staff may be ex-gay. He steals a look at Sykes. BRANDON (CONT’D) But I’ve had all sorts of my own trials that took me so far from the Lord, it is a true miracle that I am standing here before you. But I am. INT. L.I.A. SHORT BUS - DAY  Jared and the gang all ride the short bus. Brandon and Sykes fla",
      "dialogue_count": 0,
      "word_count": 1256
    },
    {
      "scene_number": 9,
      "slugline": "EXT. BASEBALL BATTING CAGE - DAY  Jared and the others line up outside of a batting cage fence. We hear the ball being shot out and the grunt of - Simon, who misses the ball, then miserably hits the second. BRANDON Who you are on the inside can be affected by the outside. Next. Lee look bewildered, realizing it’s time to step up to the plate. Simon hands Lee the helmet. BRANDON (CONT’D) Outside in. Fake it till you make it. Adapt to survive. Lee enters as Brandon slides another coin into the slot. There is a terrible anticipation and the first ball comes SHOOTING out. Lee startles. BRANDON (CONT’D) And you kids and folk, being what you are afflicted with -- Lee spins disoriented by the second. Then the third makes awful body contact, tilting the helmet from Lee. BRANDON (CONT’D) - better learn how to survive. Become the man you are not. Jared sees Brandon smirk, amused, and unwilling to turn off the machine. Lee is swamped and scared. Gary goes in to help. BRANDON (CONT’D) When you are in a prison, you would surprise yourself -- On Jared absorbing all this as we hear - METALLIC NOISES. GUNS in fact. Guns being loaded. CHK.CHK. Magazines being locked. CHK. Firing bolts being racked. EXT. FLAT BED TRUCK - DAY (FLASHBACK - 2002)  An array of HUNTING RIFLES placed on the flatbed tray. There are four in total, laying side by side.  37.  BRANDON (CONT’D)",
      "characters": [
        "SYKES"
      ],
      "action_text": "BRANDON O.S. What you can do to fit in  37A.  (MORE) The rifles are grabbed by their various owners. EXT. FOREST - DAY (2002)  Big Jim, Marshall, Jared and a FOURTH MAN edge along a river, deeper into the woods. They split into two groups. - Later, Jared following Marshall, pulls up to rest. Marshall urges him on. A SHOT volleys out over the valley. Jared looks back. EXT. FOREST - DAY  Jared helps Jim and his father winch a DEAD BUCK onto the back of one of Jim’s trucks  38-39. BRANDON O.S. (CONT'D) . INT. CARMEN’S STOP - AFTERNOON  Jared, dressed in his hunting gear, finishes off his fries as he sits alone. Marshall is at the counter with his glasses on paying the check and using easy charm with the WAITRESS. Beside Jared’s table is A YOUNG MAN, barely 25, his three KIDS and young wife. There is also two men sitting at a window booth that Jared particularly notices. Just then - CHERYL, who works in the diner, comes up to the table. CHERYL Hey Jared. JARED Oh. Cheryl. Hey. CHERYL Y’daddy’s pickin’ up everyone’s checks again. So sweet. He’s even paying for those two queers - JARED You think they’re...? CHERYL They have to be. Actually quite nice though. Marshall, now shaking hands with the OLD MAN, calls Jared over. He’s ready to leave. Jared passes the male couple, making eye contact with one of them. An awkward smile. EXT./INT CARMEN’S STOP / MARSHALL’S TRUCK - DAY  Once in, Marshall takes a pile of religious pamphlets from the glove compartment. On one he writes a bible reference Romans 1:27. MARSHALL There are two men sitting by the window. I just paid for their lunch. Tell them I’d appreciate them taking a look at this paper and this verse. For their sake. Jared wants to ask why, but is unable. He knows.  40. MARSHALL (CONT’D) Men committed shameful acts with other men and received in themselves the due penalty for their error. INT. CARMEN’S STOP - DAY  Jared walks back into the diner. He looks to where the men enjoy their lunch. Jared looks out the window to wh",
      "dialogue_count": 1,
      "word_count": 2164
    },
    {
      "scene_number": 10,
      "slugline": "INT. JARED’S DORM ROOM 346 - MOMENTS LATER  The room has a double bunk beds. There is no one else there. HENRY First one in gets to choose. You got a girl? If so you might wanna apply for a room without bunks. JARED Just broke up. HENRY (winks) Good timing. Before college. They head for the door. HENRY O.S. I got cousins in Mountain Home.  EXT. LYON COLLEGE, ARKANSAS - DUSK  Jared and Henry go for a run. We are behind them.  -------------------------------------------------------------- TITLE CARD:   HENRY  --------------------------------------------------------------  Jared and Henry at one end of the run, sweat heavily and gasp for air. They occasionally look at each other.  HENRY We’re a good fit. Hate running with slow pokes. Or speed freaks. (beat) Tell you what. Race you on the way back. Last one back has to go to the other one’s church. Serious. JARED Why? What kind of church is it? HENRY You game or not? Jared smiles goofily  46.  HENRY (CONT’D)",
      "characters": [],
      "action_text": "HENRY (CONT’D) Ready? After three. One, two, Three, GO! CUT TO: INT. THE HEALING HANDS PENTACOSTAL CHURCH - DAY  The opening POWER CHORDS of a Christian Rock band’s opener. Jared and Henry sit among many YOUNG PEOPLE who throw their hands in the air, CHEERING. A Pentecostal Church meeting in full swing. More a party than a service. LEAD SINGER Get on your feet for Jesus. Everyone stands and Henry does too. Jared is a beat behind like a guilty outside observer. His dad would HATE this kind of worship. Henry offers Jared a hand to stand.   Jared stands and watches as Henry, euphoric, cuffs the young TEEN in front of him and lets out a ‘whoop.’ HENRY (beaming) Radical huh? The minister, the YOUNG charismatic FRANK, 35, on the stage - FRANK Let’s sing it for Jesus -- HENRY/EVERYONE Amen/Amen! Henry puts his manly arm around Jared who allows himself to smile and start to enjoy it. He relaxes and puts his arm around Henry too. It’s a brotherly embrace that feels safe in this environment. But -- The music turns to something synthesized and ominous. EXT. LYON COLLEGE CAMPUS - NIGHT  Jared and Henry on a run, jog around trees, deflecting cherry blossom tree branches to cut a smoother line. Later -  47. At the end of their run, they stare at each other as they stretch and search for oxygen. Jared tries a smile. But it’s a little long and Henry frowns, a tad suspicious  47A.",
      "dialogue_count": 0,
      "word_count": 413
    },
    {
      "scene_number": 11,
      "slugline": "INT. JARED’S DORM ROOM 346 - LATER That ominous music is a SYNTHETIC LOOP from TOM CLANCY’S SPLINTER CELL.  Jared and Henry are still dressed in sweats. We see from behind as Jared controls the game and Henry watches, sipping a beer. A lone player makes his way through the green and blue glow of an underground concrete facility.   Jared steals a look at Henry’s face, glowing in the screen’s light. Henry checks his watch. Sips his beer. He’s tired. HENRY Y’said your roommate’s not coming back till tomorrow? JARED On some golf trip. You wanna crash? Jared moves to turn off the game. HENRY You keep playing. Henry gets up and we hear the sounds of Henry climbing up the bunk ladder. Jared watches, turns down the sound and then goes back to his game, conflicted. He’s attracted it’s clear. But Henry is straight and Jared has ZERO experience with ANYONE.  JARED O.S. Am I in trouble?  INT. L.I.A. ADMIN OFFICE - DAY (PRESENT)  Tight on Jared’s face as a door opens and shuts O.S. JARED Have I done something wrong? MICHAEL O.S. Here he comes now. SYKES O.S. Morning Jared.  48.",
      "characters": [],
      "action_text": "Sykes sits carrying a file. His demeanor is supremely casual and friendly. Not the ‘man on show’ he is in the group sessions. The only sound is a ticking clock  48A. SYKES No reason to be worried. Around day three I just check in with the new recruits. See how they’re getting along. Little private chat. A poster behind Sykes linking AIDS to homosexual deviant behavior draws Jared’s attention for a moment. SYKES (CONT’D) So, how is it going for ya? JARED It’s good. I’m finding it all... helpful, yeah. SYKES How is your Moral Inventory coming along? Are you ready? You wanna go today? Dive right in? JARED Oh... I, um.. I’d like to watch a couple more people do theirs I think, if that’s okay. I haven’t completed everything yet. Sykes pulls out a handful of papers from his file: Jared’s journal stories. He selects a page and holds it up. SYKES What is this? JARED It’s a story. SYKES It’s a love story about a boy and a girl. Were you thinking about two boys when you wrote this? (hold) Is this a true story? JARED No. It’s just a story. (off Sykes) Will I be able to get them back? They’re assignments for college.  49. SYKES Yes, I noticed your list of books here. A reading list I assume. (holds it up  49A.  (MORE) This troubles Jared, but he nods. Sykes reads him, his eyes narrowing a little and then the smile returns - SYKES (CONT’D) Listen. I want you to know, I’ve had conversations with your parents in the lead up to you being here, and I know a little of your story somewhat. (smiles) I know there are discrepancies from what your parents were   told   and what you have said to them. And they are really unsure what to believe. But, I know there is a bigger story. Or   stories . Right? We’re not here based on mere thoughts alone. (beat) You know, the ones that get the most out of this, are the ones who are brave. The ones who fess up to what God already sees, Jared. His friendly concern has somehow taken on the air of threat. SYKES (CONT’D) You really gotta put it all on t",
      "dialogue_count": 0,
      "word_count": 1541
    },
    {
      "scene_number": 12,
      "slugline": "EXT. LYON COLLEGE, CAMPUS - NIGHT  Jared and Henry run at a medium jog. We follow behind.  HENRY V/O We pray that you remove all obstacles from our path.  They take a bend.  HENRY V/O (CONT’D) And we give thanks for our freedom, for our youth, and our health, whereas others are less fortunate.  We continue to lead them now as Henry looks across to Jared. It is clear he is concerned for Jared’s withdrawal.  HENRY V/O (CONT’D) We pray for Jared’s aunt, that she may be restored to health and we dedicate this run to her recovery.  INT. JARED’S FORD MUSTANG - DAY  Jared drives his car. We are behind him.  HENRY V/O We run guided by your love and lifted by your spirit. Each step a prayer that all of your children share the same abundance.  The pair move down a rise and disappear into darkness. INT. LYON COLLEGE, HALLWAY - DAY  Henry moves with a purpose. A swagger. We follow as he raises a flip cell phone to his ear.  HENRY/JARED V/O Amen. Amen.  EXT. JARED’S FAMILY HOME - DAY  Jared gets out of his car and moves to the house where he is greeted with great warmth by his mother  55.  HENRY (CONT’D)",
      "characters": [],
      "action_text": ". INT. LYON COLLEGE, HALLWAY - DAY  Henry on the phone - HENRY Yo. Hey, you remember a kid called Jared Eamons? Ginger haired kid. Your year at St. Martins? INT. EAMONS FAMILY KITCHEN - DAY  Jared dumps his bag as he moves through the house. HENRY O.S. I’m looking to get a hold of him. INT. LYON COLLEGE, HALLWAY - DAY  Henry walks the hall dialing a new number. INT. JARED’S BEDROOM - DAY  Jared takes his sneakers off and turns on his computer.   The faint O.S. sounds of a phone ringing. INT. EAMONS FAMILY KITCHEN - DAY  The phone rings in the kitchen. We follow Nancy as she wipes her hands and moves to answer. NANCY Hello? INT./EXT. HALLWAY / LYON COLLEGE COURTYARD - DAY  Henry opens the wide doors to the college courtyard where hundreds of kids enjoy the sun. HENRY Hi. Is that Missus Nancy Eamons? INT. EAMONS FAMILY KITCHEN - DAY  Nancy is chirpy but somehow senses something ominous.  56. NANCY This is she. Who am I speaking to  56A.  (MORE) We move in on Nancy’s ‘not so great’ portrait of the family, now hanging on the wall. NANCY (CONT’D) Yes? What about him? INT. EAMONS FAMILY HOME/JARED’S ROOM - AFTERNOON  Jared sits on his bed reading. A knock comes to the door. MARSHALL O.S. Jared? Something in the tone of his voice makes Jared concerned. INT. EAMONS FAMILY LIVING ROOM - NIGHT  We SMASH INTO A FIERCE FAMILY ARGUMENT. Jared IS AT WAR with his father. Under interrogation. Nancy is the bystander. JARED Did he give you a name?   MARSHALL Answer my question?! JARED If he gave you a name... I’m just saying, why wouldn’t he give you - MARSHALL Answer me. Are you doing all the things he says? JARED Did he give you his name? MARSHALL Enough. I command you - JARED - command me all you want. I’m asking questions too. Marshall makes a move toward Jared. NANCY He didn’t give me his name. (wavers) I don’t think.  57.  NANCY (CONT'D) We hear Henry’s mumbled voice on the other end of the line. They both look to Nancy  57A. JARED The guy is full of shit! MARSHALL Nancy. Leave",
      "dialogue_count": 0,
      "word_count": 932
    },
    {
      "scene_number": 13,
      "slugline": "INT. BEDROOM - NIGHT  Jared is playing a game on his PLAYSTATION 2: FINAL DOOM - Level 9 with its dread filled pipe-organ theme track. Roaming the pit, he blasts demon soldiers and fiery skulls with a double barrel shotgun. Computer blood flows freely. He is deep in burying his reality when his father walks in. MARSHALL Your mother is making dinner. JARED I’m okay. I’m not hungry. He pauses the game as Marshall sets down a note pad and pen. MARSHALL I want you to write down this boy’s name and the name of this Pentecostal Church. If he did what you say then it needs to be reported. JARED I don’t want you to talk to him. MARSHALL I think this matter is a little too important for us to get into the business of protecting anyone. Jared looks at the paper and pen. Marshall moves to leave. MARSHALL (CONT’D) Eric is coming over tomorrow to discuss rewiring for the new ministry. (beat) I extended the invitation to Chloe and Brandy too. I’d appreciate it if you stuck around another - JARED I really should get back. MARSHALL If you can miss one day of classes, I’m sure one more is not going to end the world. (beat)  60.  (MORE)",
      "characters": [],
      "action_text": "Why did you come back in the first place? Mid-week? The way he asks it still feels like he mistrusts his son  60A.  MARSHALL (CONT'D) MARSHALL (CONT’D) You know there is nothing like the feeling of... being with a woman. If you knew what it was like - JARED Dad. It’s not true. Jared goes to put his head phones on. MARSHALL You know what I think about those kind of games too. Marshall leaves. Distracted, Jared is swamped by soldiers. Game Over. He sits in silence for a moment and then - Jared explodes. The closest thing we have seen to rage. He rips the cord from the controller out of the system and throws it across the room. INT. EAMONS FAMILY KITCHEN - NIGHT  Marshall looks at his ministry architectural plans while Nancy preps dinner. A somber mood. Broken as - Jared enters and drops the ENTIRE gaming system on the table, cords and all. BAM. JARED You want me to stop with the games? His parents are puzzled. JARED (CONT’D) Ok... I’ll stop with them. Pause. JARED (CONT’D) I don’t want to see Chloe. (beat) We broke up. And he exits, leaving his parents confused. But then - Moments later he is back --- JARED (CONT’D) We broke up because... I think I’m. In fact, I’m pretty sure that I’m -  61. Jared is trying to find the words. It’s hard, but he’s going to stay until the message gets across. Finally  61A. - Marshall swoops up his architect plans, and leaves the room. There is a long pause. Until Nancy awkwardly pipes up. NANCY Are you sure honey? INT. JARED’S ROOM - FAMILY HOME - NIGHT  Jared is watching through a crack in the door. He sees - In the kitchen his father sitting, embracing his mother. Then he hears a car and moves to the window. He is alarmed to see - Two men approach the house: Big Jim and Pastor Wilkes. Marshall walks to greet them. It’s definitely conspiratorial. And it’s definitely something to do with Jared. He moves to the landing to watch them enter the house, careful to avoid being seen. MARSHALL Thanks for coming Jim. Pastor. INT. L.I.A. OFFICE - ",
      "dialogue_count": 0,
      "word_count": 2028
    },
    {
      "scene_number": 14,
      "slugline": "INT. L.I.A. BATHROOM - LATE AFTERNOON  Jared steps up to pee. Unbuttoning, he sees a shape pass the high window. Curious, he hoists himself up, and can see - Sykes, alone and in the magical afternoon light staring at the tree line. Hands on his hips. Jared immediately wonders about him. Then the door swings open and Jared steps down - BRANDON O.S. You’re meant to attend bathroom breaks with a staff member. Brandon eyes him cautiously, and Jared goes to exit -- BRANDON What, you not gonna pee now? Jared realizes his mistake. Looks at his unbuttoned pants. BRANDON (CONT’D) Or were you gonna do something solo? That’s why they make the rules. Jared turns back to pee. It’s a fearful   stop-start   pee. BRANDON (CONT’D) Sounds like Morse code. You sending me a message, faggot? Finished, Jared goes to walk out. Brandon turns on the tap to for him to wash. He complies. Now Brandon gets awful close and hands him a paper towel. BRANDON (CONT’D) I do not get you guys at all. Too much mothering and not enough fathering. I can’t be both for you. Finally Jared is allowed to leave. INT. NANCY’S CAR - DAY  Jared rides back from L.I.A. deep in his head. Nancy drives wondering if she should respect the silence or probe -- NANCY It’s still early. Do you want to watch a movie  69.  (MORE)",
      "characters": [
        "MARSHALL"
      ],
      "action_text": "JARED I got homework still. Plus, I can’t anyway. The rules say all movies contain ‘sinful content.’ NANCY What about an animation? JARED ‘What’d you do last night?’ ‘I was hanging at the Hampton Inn watching  The Lion King   with my mom.’ Jared winds his window down. Nancy turns off the air - NANCY You want fresh air? Jared reaches out his hand and his hand dances with the air. NANCY (CONT’D) Honey... You know I don’t like - JARED Mom! Who did that happen to and when? Seriously!? Do you know!? Nancy retreats into silence. But Jared is spoiling for a fight. JARED (CONT’D) Seriously. Do you actually know who that happened to? Do you? For real? After another silence - JARED (CONT’D) It was Nobody. From Nowhere Town. (beat) On Highway Zero. It never happened. Now she feels the right to bite back. NANCY Parents want to protect their kids. JARED So they feed them lies. NANCY I think those are okay lies.  70.  NANCY (CONT'D) Jared, realizing he’s been unfairly combative, pulls his hand back just a little bit  70A. JARED You know the whole thing you and Dad are paying for here is all about how messed up we are by our parents. They want to know about you. That’s why you can’t know all about it. Cause then they wouldn’t get their money out of you. NANCY What have I ever done to you? I’m not a drunk or a divorcee. Your father and I don’t fight. We barely even raise our voices. (beat) Talk about me however you want,   my  conscience is clean. Nancy stops. She hit ‘my’ a little too hard. Silence. NANCY (CONT’D) I think I should read the book too. (beat) See what it’s all about. Read these rules and what not. (no answer) They get to discuss   us . I think we should know about   them   too. We are paying for it, and trusting them with your care. Jared winds his window up: Happy? He leans against the glass. INT. HAMPTON INN AND SUITES - NIGHT  Jared and his mother schlep down the hallway. Five steps behind his mother Jared’s step is heavy and tired. INT. HAMPTON INN AND SUITES - R",
      "dialogue_count": 1,
      "word_count": 2243
    },
    {
      "scene_number": 15,
      "slugline": "INT. PRISON - DAY  Jared trails Pastor Wilkes and Marshall as they go through the prison security check  78A.",
      "characters": [
        "JON"
      ],
      "action_text": ". A big multi-bag of peanut M&M’s gets scanned along with three King James Bibles and pamphlets. MARSHALL Candy to anyone who can recite at least two verses from the bible. (beat) If a want for candy tricks them into finding truth in the gospel, then -- We have to appeal to their lower natures before we can appeal to their higher ones. Jared nods. Marshall, seeing Jared’s fear, offers him a reassuring pat on the shoulder. INT. PRISON HALLWAY - DAY  Jared, terrified and wary, stands carrying the M&M bags. He watches as his father consoles a prisoner with truly great compassion. Then he hears his name called. Pastor Wilkes needs a bag of M&M’s. Jared steps closer to the cell he is in, trying not to make eye contact with the prisoner. PASTOR WILKES This is where the fallen land. You see? Look around you son. INT. MARSHALL’S CAR - DAY  Marshall and Jared approach the car. Marshall eats M&M’s. Then hands the bag to Jared, who is still deep in memory of the pastor’s warning. They get in - MARSHALL You going to stay for dinner? Or -- JARED I should probably make a start today. Hold. Marshall puts his hand on Jared’s shoulder. MARSHALL We’ll get through this son. Then Marshall turns on the radio: Credence Clearwater revival blasts out: There’s a Bad Moon on the Rise  79. INT./EXT. JARED’S CAR/HIGHWAY - DAY  Jared on the side of the highway, where people only usually stop because their car has broken down. He is in the midst of a panic attack: trying to regulate his breathing. He gets out and closes the door, leaning against the car. He manages to calm himself a little. VRrrrmmm. The sounds of trucks racing past by catches his attention. Soon he steps forward, until - He is very close to the edge. Might he just step forward and solve all his problems on the grill of a speeding semi? One driver HONKS a warning. Finally - Jared walks back to the car, kicking out at the side mirror, breaking it. He gets back in the car and starts the ignition. His complicated life must keep goi",
      "dialogue_count": 1,
      "word_count": 2049
    },
    {
      "scene_number": 16,
      "slugline": "INT. NEW HOPE HOUSE, BATHROOM - DAY  Jared watches through the crowd as Cameron is placed in the basic shower bath-tub of the small bathroom. There he is baptized with his father and mother close, encouraged by Rev. Neil to place their hands on him. His big body shudders and his strong arms reach out for the water. Like a massive baby. Full surrender. Jared watches mute. The only thing that makes this even remotely bearable is that Cameron, seems ecstatic and accepting of his REBIRTH. His arms clawing for God, reaching for a loving embrace. Beethoven’s music underpins the whole horrible, beautiful, scene. Jared sees Sykes on the edge of the action, involved but not really. Jared turns to go, unable to watch anymore. Interestingly, Sykes doesn’t try and stop him. But - Jon does. He grabs for Jared’s arm. Jared shakes him off.  EXT. NEW HOPE HOUSE, HALLWAY - DAY  Jared moves into the hall, escaping the horror. He is alone. GARY O.S. Starting to see it for what it is? Gary is standing by the corner. GARY They catch him with another boy in a steam room and what do they do? (beat) You seem smart. You want my advice? Tell them everything they need to hear and play the part. You’re up any day now. Let them know you’re understanding your mistakes, getting better, that it’s working. Think all my stories and my tears were real? ‘Fake it to make it’. None of   this   is going to help any. The sooner you are out of here and home the better.  87.  (MORE)",
      "characters": [],
      "action_text": "And the sooner we are all out of home and somewhere else the better - (that hangs  87A.  GARY (CONT'D)  (MORE) You don’t want to end up at one of these houses for any amount of time. I’ve heard the stories and they are not good. A muffled chorus and shout comes from the bathroom. GARY (CONT’D) Unless you really think you can change. Or want to. INT. HAMPTON INN AND SUITES - NIGHT  The music continues as - Jared walks the hall with his mother. Seen from behind they walk away and enter the room, leaving an empty hallway. Hold. And the music ends on a deep base note - EXT. MEMPHIS MOTEL MILE - NIGHT  Jared runs, exorcising the days events. Hood up, he pounds the pavement past the various motels. The rushing oncoming cars WHOOSH past like his dark thoughts. Later: As he passes a bus shelter he comes to a stop. A strip mall in the background. Not a soul about. He takes a seat on a bench to catch his breath and when he looks back he sees - On the outside of the bus shelter: a beatific advertising image of a SHIRTLESS GUY, lit and inviting. Jared looks away but something draws him back. His nature. Then, something fierce wells up in him, and he gets up as if he is looking around for something. Leaves frame. Hold. We hear noises of effort. He soon returns with a heavy paving stone. He is about to launch the missile at the advertising image. However -- On the approach, the poster slides to the NEXT ad... a woman in a swim suit. It railroads his intentions. JARED Arghhhh. He throws the paver anyway and it bounces off the Perspex shield, doing minimal damage. He sits down drained. Defeated  88.  GARY (CONT'D) JARED (CONT’D) Fuck. (turning skyward) Fuck you. I hate you. Fuck you. FUUUUUUCK! He waits. Nothing. Then - The advertising image slides back, to the beatific male image. But, now buckled by the assault, its mechanism falters and sticks halfway. We move in on Jared. Recognition. Memory. The man, the face, albeit obscured with fracture glass, reminds him of something. Some",
      "dialogue_count": 0,
      "word_count": 1113
    },
    {
      "scene_number": 17,
      "slugline": "INT. XAVIER’S STUDIO ROOM - NIGHT  They walk in together. As the door closes the music stops  90A.",
      "characters": [
        "XAVIER"
      ],
      "action_text": "There is minimal improvised and eclectic furniture in this studio space. Beyond it Jared can see at the far end, a bed room lit by warm lamp light. Xavier puts on Otis Redding - Change is Gonna Come. Vinyl. XAVIER O.S I’m having some wine. Do you want some more? When Xavier speaks he has a slight European accent: French. Swiss? It is hard to tell. Jared looks around at the motley pictures hanging: Subversive religious images; magazine cut-outs, plus; sketches of people and shapes. Curated by a novice, yet somehow captivating. JARED Where are you from Xavier? XAVIER O.S I lived in thirteen countries before I left high school. Born in Vienna. Ended up in Canada. Now here. He approaches with a red wine. Jared takes it. JARED Do you believe in God? XAVIER Serious. JARED Why is that serious? Jared is buoyed by drink. It is a bold side of him we have never seen. Perhaps some things are possible with booze that otherwise are not, as we may remember from Jon’s tale. Like with that - this encounter should carry an edge that carries the possibility of that same danger. JARED (CONT’D) Do you believe in God or not? Your whole art thing is -- XAVIER I do. I was raised with religion and I question it, but I still believe in God  91.  (MORE) JARED Who created the earth? Xavier laughs. That’s a BIG question? XAVIER You like a little small talk, huh? JARED I don’t think you can believe in science and religion equally. Xavier frowns, not ready to engage in the seriousness. JARED (CONT’D) Don’t you think you have to pick a side? Don’t they cancel each other out. XAVIER Well, paper beats rock. Then no one can believe in God. JARED Why? XAVIER Because science has shown itself and God has not. JARED Sure he has. XAVIER Not all the time. Science shows itself all the time. It’s always around us developing. Does God show himself enough? Where is He? (off Jared’s expression) Wait till you really suffer. Jared seems to be getting either angry now or emotional. He may lash out, physically OR s",
      "dialogue_count": 1,
      "word_count": 789
    },
    {
      "scene_number": 18,
      "slugline": "EXT. LYON COLLEGE, LAKE PONTOON - DAY  Jared naked from the waist up. JARED Please Lord, make me pure.  And falls backward, right into the icy college lake. His clothes left piled on the shore nearby. INT. HAMPTON INN AND SUITES, BATHROOM - NIGHT (PRESENT)  Jared, dripping wet, stands before the mirror in his running gear, staring at himself. The shower runs in the B.G. Then we realize that he is looking at a card. It is the business card of Dr. Beverly Muldoon. He turns it over in his hands. Contemplating. Phone poised he actually starts to dial. Then he thinks better of it and takes off his shirt, walking into the steam. INT. HAMPTON INN AND SUITES HALLWAY - MORNING Behind: Nancy, in her Jackie O’s, and Jared walk the hall.  INT. L.I.A. HALLWAY - DAY  Behind: Jared walks the L.I.A. hallway. INT. L.I.A. MAIN AUDITORIUM - DAY  Jared sits in his chair, clutching his papers and handbook, a purposeful steely look in on his face. He looks across and - Cameron slowly eases himself into an empty seat. He acknowledges no one and sits, arms across his massive torso. Sykes moves to his podium. SYKES I don’t know about y’all, but today I feel invigorated. I feel hopeful that so much is possible. Jared steals a look at Cameron. Cameron does not seem to be sharing the same vigor. He seems truly sunk.  95.  JARED (CONT'D)",
      "characters": [
        "SYKES",
        "JARED"
      ],
      "action_text": "CAMERON I feel   great,   Sir. SYKES Do you feel the true presence of God in your heart? CAMERON Yes sir. SYKES It feels great don’t it? CAMERON Yes sir. It does for sure. Jared catches Gary’s eye. A shared skepticism. Then he catches Jon’s eye, but Jared turns away almost coldly. Things have shifted between the two of them. Broken. SYKES O.S. Ready when you are, Jared. INT. L.I.A. MAIN AUDITORIUM - MOMENTS LATER  Jared’s hands squeeze his papers for his Moral Inventory. We hold on Jared’s face through -- JARED I had thoughts of men. (beat) Boys at school. On T.V. On the street. In my imagination. At college I held the hand of a boy and I stayed through the night. In his bed. (beat) For these thoughts and this action, for which I felt regretful, I - SYKES O.S. Hold on. And..? The faces of others. Of Jon. Aaron filming. JARED I never... I stayed the night with the boy from college but we never did anything more. That’s the only  96.  SYKES (CONT’D)  (MORE) SYKES Come on Jared. Don’t hide your sins. God sees everything. What else? Jared stews. He really is telling the truth. What happened with Henry was Henry’s sin. JARED I lied on my Genogram. My uncle Chris wasn’t an alcoholic. Sykes sighs. JARED (CONT’D) It’s true.   How do you know? SYKES You want to waste everyone’s time? JARED I’m not.   SYKES (CONT'D) And mock everyone who has got up here being honest and brave. JARED I could make something up. Is that what you want me to do? Isn’t that a sin too? He eyeballs Sykes. A new strength of defiance. JARED (CONT’D) If thoughts are a sin, I ask God’s forgiveness for that, but I’m not making anything up. On Sykes. He eyes Jared: It seems like a stand off. SYKES Okay then. He moves off to get the lie chair. He sets it down in front of Jared. And places another chair beside Jared. SYKES O.S There’s your father. Sit down. Jared sits, albeit reluctantly.  97.  JARED (CONT'D) SYKES Tell him how he’s affected you. Tell him how angry you are  97A.  (MORE) (hold) Tell him you h",
      "dialogue_count": 2,
      "word_count": 2215
    },
    {
      "scene_number": 19,
      "slugline": "INT. JARED’S ROOM/EAMONS LIVING ROOM - NIGHT  Jared sits on his bed. He unzips his L.I.A. bag. He raises his white shirt. Throws it in the trash. Behind him now as he unpacks, we hear a doorbell ring. He turns to register it but doesn’t pay too much mind. Moments later he hears a knock at his door. NANCY (knocking) Honey. Jared turns - NANCY (CONT’D) Do you know a boy by the name of Cameron Van Huessen? JARED Is he here? NANCY No honey. That’s a sheriff. He’s come to ask you some questions. Apparently this Cameron boy killed himself today. The world drops away. And much like Cameron’s fake funeral, we absorb his death in a similar fashion: slowly -- -- Jared sits to talk to a young sheriff. The sheriff takes Jared’s statement. Behind the sheriff - -- Jared sees him father move away up. -- The Sheriff is seen to the door and the whole family disperses into separate rooms. - Jared walks into his room. He turns and sees his father watching him. Jared closes his door. SNAP TO BLACK: OMITTED  OMITTED  FADE TO BLACK  106.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 192
    },
    {
      "scene_number": 20,
      "slugline": "EXT. BROOKLYN STREETS - NIGHT (THREE YEARS LATER)  We follow Jared. A black coat. If it isn’t apparent, it will be as we take in his profile, and then his face full frontal as he turns the corner, that it is a few years later.  -------------------------------------------------------------- TITLE CARD: JARED --------------------------------------------------------------  It’s not so much that he has aged. More that he wears a new confidence that wasn’t apparent before. Under his arm he carries a six pack of craft beer and a bottle of wine. He approaches a building in an industrial area -- Jared puts a phone to his ear. An iPhone 1. (It is 2008) JARED I left my keys. They fixed the buzzer. He buzzes and is buzzed up. We pull sideways to take in - New York City. The vast skyline. OMITTED  INT. JARED’S SHARED APARTMENT - NIGHT  Jared and friends share a drink, post dinner. They are playing a board game. Improvised scene from which -- We move back to see this action now in B.G. From a bedroom we discover is Jared’s. His phone sits beside his computer and a stack of papers. Perhaps we see certain things in the glow: An article with Jared’s name on it in an open journal magazine; a photo of him and his Mom posted on a board; Another of him and a boyfriend. Then, as we reach his iPhone and push in - it lights up and rings faintly. The vibration moves it toward the desks edge, until it finally stops teetering over the lip. The glow of the ‘unknown number’ finally goes away. Back with Jared and his friends. Unaware of who was calling him and what it would potentially mean, Jared continues laughing and playing.  107.",
      "characters": [],
      "action_text": "LATER: The kitchen is empty. The bottles and dishes can wait for another day. We hear Jared farewell a friend O.S  107A. OMITTED  INT. JARED’S BROOKLYN BEDROOM - LATER  Jared works. Now lit by the screen of his desktop, we see evidence of the writer Jared has become. We pick off various things including a post-it note saying ‘write what you know!!’ Jared types furiously and when an email pings he immediately switches to his email page: an email from - Nancy Eamons: “URGENT -- I WAS RIGHT!!” How could he not open it - A news article:   A   BOY WHO LOST HIS ARM, HANGING IT OUT OF A CAR IN IBIZA.  Then another PING: He sighs, she has hooked him again, dragging him from work into a text chat.  MOM: Are you coming for Thanksgiving? JARED: I don’t know I can. MOM: Your dad would love to see you. JARED: I’ll come when Dad is away at the convention.  Then the phone rings. He snatches it up - JARED Mom! I’m working. Pause. Then a PING on the computer - Again it is -  MOM: Okay. Goodnight.  Then, who is on the phone! VOICE Is this Jared Eamons? JARED Yeah. Who’s this? Jared walks out to the fridge in the darkened kitchen to grab another beer -- VOICE From L.I.A. a few years ago?  108. He stops. Moves back to the bedroom and turns off the music. Now there is utter silence  108A. JARED Who is this? VOICE It’s ah... It’s Victor Sykes. Hold. SYKES Before you hang up. Please hear me out. I’ve been contacting as many ex-clients as I can... Jared listens and Sykes’ call drowns out. We move behind Jared’s head as he listens and we hear faint traces -- When we come across to Jared’s other side of Jared we hear a fierce and firm drum snare SNAP! THEN TO BLACK: Then a drum roll rumbles over - EXT. BROOKLYN STREET - DAY  A truck passing reveals Jared’s face cautiously standing on the street keenly watching something. He puts his phone to his ear. Another drum beat and we see - the drumming actually comes from a TEEN BOY right by Jared. Jared looks at him for a moment. Jared’s friend, one",
      "dialogue_count": 0,
      "word_count": 1159
    },
    {
      "scene_number": 21,
      "slugline": "EXT. EAMONS FAMILY HOME - DAY Jared’s car pulls into the family driveway.  JARED O.S. Where is he? INT. EAMONS FAMILY KITCHEN - DAY  Jared stands in the kitchen table, on a mission. Fierce. (NB: Nancy is slightly less ‘made-up’ these days) NANCY Honey. It’s Sunday. If it’s urgent, you’ll have to go to the church. JARED I’ll wait for him to get back. NANCY You haven’t even seen it. Not with all the fittings and filled with people. He’s so proud of it. (beat) Like he’s proud of you. JARED Mom, he lost part of his congregation on account of me. NANCY You’ve made that a bigger deal than it ever was. Honey - (beat) What is the matter? Is everything - JARED Why aren’t you there? At church. NANCY I don’t always go. I do to support your father sometimes. But, he knows. I have my own religion. (off Jared’s expression) Everyone else creates religions to suit themselves, so I figured, why couldn’t I.  112.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 168
    },
    {
      "scene_number": 22,
      "slugline": "INT. NANCY’S CAR - DAY  Nancy at the wheel. The sun sheds a warm glow on Nancy  112A.",
      "characters": [
        "MARSHALL"
      ],
      "action_text": "NANCY O.S. I love God and God loves me. And I love my son. Nancy turns to smile. Jared returns the look. INT. EAMONS FAMILY KITCHEN - AS BEFORE - DAY  Jared listens to his mother’s religion - NANCY And if He doesn’t love my son too, then I will stop loving Him. Jared wipes a tear, trying not to be drawn into feeling - NANCY (CONT’D) For your father it is a little more complicated than that. EXT. ARKANSAS HIGHWAY - MOMENTS LATER  Nancy’s car travels the highway. Her car peals left and we continue up the highway. NANCY Your call. Church left. Or right if you wanna go see a movie instead. INT. HOPE SPRINGS FIRST BAPTIST MINISTRY - LATER  Jared enters from the podium side with his Mother as The choir belts out the final bars of - ‘Someday’ As Jared sits, he catches eyes with Chloe who enters with Wayne (a new couple). Chloe, surprised, offers a small smile. Wayne, however, blanks him. Then the crowd settles: Marshall is heading down the aisle, greeting folk when   -- He sees Nancy and offers a smile, before spotting Jared. He freezes a beat, but then covers and offers a mini salute. Jared turns back, focusing his eyes to the front as --  113. MARSHALL The night before the crucifixion. Jesus and the disciples are heading down the Kidron Valley toward the Garden of Gethsemane. Vines are everywhere.  113A.  (MORE) On Jared, aware that his presence has created a stir. MARSHALL (CONT’D) So Jesus pointed to the vines and said these words: ‘Just like those grapes depend on the vine, so should you depend on me.’ On Jared focusing on his father, in his element. You can tell he is charismatic as the congregation hang on his words. MARSHALL (CONT’D) ‘Be fruitful’ is the subject of today’s sermon.  EXT. CHURCH PARKING LOT - EARLY EVENING  Jared and Chloe walk in silence until they reach Nancy’s car.  WOMAN O.S. Goodbye, Jared. Jared turns and waves to the WOMAN getting in her car. CHLOE See? Not everyone wants you to burn in hell. She hits him playfully. They hear a car horn BLAST.",
      "dialogue_count": 1,
      "word_count": 1687
    }
  ]
}