{
  "slug": "brads-status-2017",
  "title": "brads status",
  "genre": "drama",
  "format": "film",
  "scenes_count": 17,
  "characters_count": 0,
  "characters": [],
  "total_words": 20876,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. BRAD’S BEDROOM - NIGHT 5   5  Brad rolls over in bed, restless and agitated.   He picks up his cell phone on the side table.   It GLOWS to life. NARRATOR Brad’s mind went to other successes that pained him.  ON PHONE - MOMENTS LATER  We SEE Brad’s finger scroll across a SERIES of GOOGLE IMAGES of Craig Fisher - a political wonk and talking head.   Craig - in a studio, posing with the President, getting interviewed. NARRATOR There was Craig Fisher - who had worked for the White House.   He had written two successful books and was always on TV.   He had always been a self-confident know-it-all and now life had affirmed his delusions of grandeur. We now SEE Brad’s fingers ZOOM in close on a PHOTO of Craig, his WIFE and TWO DAUGHTERS all smiles, at an event. ON BRAD - illuminated by the light of the phone, he grimaces. He puts the phone down.   He looks back up at the ceiling. NARRATOR He thought about Jason Hatfield...  EXT. MANHATTAN STREET - DAY 6   6  JASON HATFIELD walks with TWO EXECS.   An attractive ASSISTANT intercepts him and they hop in the back of a waiting SUV. NARRATOR ...whose hedge fund had made him obscenely wealthy.   That he was a nice guy who was a philanthropist and had even given money to Brad’s non-profit somehow made it even worse.  EXT. MAUI BEACH - DAY 7   7  A tan BILLY WERSTLER sits on the beach with TWO YOUNG SURFER   * GIRLS, chatting them up.  (CONTINUED)  BRAD'S STATUS - WHITE VERSION - Sept 13, 2016 -   Page 3",
      "characters": [],
      "action_text": "NARRATOR And Billy Werstler who had made enough money from his tech start-up to retire in Maui before he was even forty.  INT. BRAD’S BEDROOM - NIGHT 8   8  Brad grits his teeth, his mind reeling. NARRATOR Everyone had won the lottery but him.   Bitter adrenaline pumped through Brad’s body.   He was never going to get back to sleep.  INT. BRAD’S LIVING ROOM - DAY 9   9  Brad’s son, TROY, age six, is playing something for him on an   * electric keyboard.   Brad looks over at... ...THE TV - where Craig Fisher is being interviewed on a news program. NARRATOR He remembered the first time he’d seen Craig Fisher being interviewed on TV. ON BRAD - he stops listening to Troy and stares mesmerized at the TV.   He rises, pointing at Craig’s talking head. NARRATOR The memory was like a cluster of needles in his heart.   This wasn’t a fleeting jealousy.   It was pain. It was real pain. BRAD  (calling toward kitchen)  Melanie! CLOSER ON BRAD - as he digests this vision. NARRATOR Why was it so painful?   What was wrong with him?  CONTINUED: 7   7  BRAD'S STATUS - Pink Revision - Sept. 29, 2016-   Page 4",
      "dialogue_count": 0,
      "word_count": 464
    },
    {
      "scene_number": 2,
      "slugline": "INT. BRAD’S BEDROOM - NIGHT 10   10  Agitated and trying to get comfortable, Brad accidentally swats Melanie in the face, waking her. MELANIE Brad! BRAD Shit, sorry. MELANIE  (half-asleep)  What the hell?   You just hit me in the face. BRAD Sorry, sorry.   I can’t sleep.  (beat)  How much do you think your parents house is worth? MELANIE My parents’ house?   I don’t know. BRAD Like two million?   Two and a half? MELANIE I don’t know. BRAD You’ve never thought about it? MELANIE Not really. BRAD  (grabs his phone)  It’ll say on Zillow.   * MELANIE Why are you doing this?   * BRAD  (types into phone)  It says 1.857.   That seems low, no?   * For Seattle?   4300 square feet.   * Zillow is always low.   I bet 2.5 at least.   Don’t you think?  (CONTINUED)  BRAD'S STATUS - Blue Revision - Sept 26, 2016 -   Page 5",
      "characters": [],
      "action_text": "MELANIE What does it matter? BRAD Well, aren’t you getting the house when they die? MELANIE When they die?   I mean, I split it with my brother. BRAD Really? MELANIE What? BRAD But your brother married into a ton of money.   He and Vanessa don’t need your parents’ money.   * MELANIE It doesn’t matter anyway, Brad.   I mean... BRAD Why?   Because of climate change? You think the world’s gonna end before we retire? MELANIE Uh, no. BRAD  We might need that money, Mel . MELANIE I think they’re considering leaving it all to the grandkids. BRAD What do you mean? MELANIE Splitting everything among the grandkids. BRAD What?   Steve has three kids.   And they’re already rich.   We only have one.   How’s that fair?  CONTINUED: 10   10  (CONTINUED)  BRAD'S STATUS - WHITE VERSION - Sept 13, 2016 -   Page 6 MELANIE It’s not up to me.   They’ve also thought about just leaving it all to charity so who knows? BRAD Seriously?   That’s absurd.   That’s mean. MELANIE You work for a non-profit - and you think that’s absurd? BRAD Right.   I work for a non-profit. And you work for the government. We need the money. MELANIE Look, I’m gonna be so distraught when my parents die, I’m not gonna give a fuck about the money. BRAD Really?   Not at all?   I think you   * will.   * MELANIE What about   your   dad?   You have money coming to you. BRAD He’s an academic.   Two hundred thousand dollars maybe. MELANIE It’ll help pay for Troy’s college. Is that why you’re worrying about money?   We’ll be fine.   We’ll figure it out. BRAD Thank god we only had one kid. MELANIE Oh my god. BRAD How much do you think your parents are worth total?   Four?   Five? Split in half.   Then taxes.   That’s like 1.5, 1.2.  CONTINUED: 10   10  (MORE)  (CONTINUED)  BRAD'S STATUS - WHITE VERSION - Sept 13, 2016 -   Page 7 And they’ll probably have health care shit to pay for - those senior living places can eat up the whole entire thing in no time... MELANIE What is wrong with you? BRAD I just feel like we’re running ",
      "dialogue_count": 0,
      "word_count": 2120
    },
    {
      "scene_number": 3,
      "slugline": "INT. AIRPLANE - DAY 22   22  Troy and Brad sit toward the back of the plane.   They look cramped and uncomfortable.   Brad pulls out his SILVER FLYER CLUB MEMBER CARD from his wallet. BRAD I’m sorry I couldn’t get us the upgrade.   I... TROY It’s no biggie. BRAD This Silver Flyer Card is totally meaningless.   It means nothing.   It gets you nothing. TROY Well, get rid of it. BRAD I’m gonna.   I’m tossing it.   Should I?   Yeah, fuck it - it’s trash.  (nowhere to throw it)  I’ll just keep it for now. Brad puts it back in his wallet and SIGHS.  INT. AIRPLANE - LATER 23   23  Troy listens to music and thumbs through a magazine.   Brad, deep in thought, looks out the plane’s window. NARRATOR On the flight, Brad wondered when was the last time Craig Fisher flew economy.   Probably not in decades.  INT. FIRST CLASS - DAY 24   24  We SEE Craig Fisher, sitting in First Class, drinking a mimosa, approached by a FLIGHT ATTENDANT. NARRATOR Brad imagined Craig enjoying all the perks of first class. FLIGHT ATTENDANT Mr. Fisher, can I offer you a warm towel?  (CONTINUED)  BRAD'S STATUS - WHITE VERSION - Sept 13, 2016 -   Page 16",
      "characters": [],
      "action_text": "CRAIG Warm towel.   Yes, thank you. With a tong, she hands him a towel. Craig places it over his face and reclines in his cushy seat.  EXT. AIRPORT TARMAC - DAY 25   25  Jason Hatfield and his ELEGANT WIFE and their FOUR TOWHEADED CHILDREN cross a tarmac towards their PRIVATE PLANE. NARRATOR Then Brad thought about how Jason Hatfield has his own private plane. Probably never has to fly commercial at all.  EXT. AIRPORT TARMAC - DAY 26   26  Nick Pascale and his BOYFRIEND and their DOGS get out of a   * HELICOPTER and cross the tarmac, then walk the stairs to   * their private plane.   * NARRATOR Nick Pascale probably flies private, too.   Brad thought what a high it must be for these guys to always feel important and special and better than.   It must be like a drug - a drug Brad distrusted yet coveted, and never seemed to have the opportunity to try.  INT. PRIVATE PLANE - DAY 27   27  The Hatfield family enters the plane.   They begin eating,   * playing, taking pictures. NARRATOR Brad imagined all the great vacations they went on - the exotic destinations. Jason and his wife drink champagne from flutes, then chuck the glasses.   She then takes a selfie of her and Jason.  CONTINUED: 24   24  BRAD'S STATUS - Blue Revision - Sept 26, 2016 -   Page 17",
      "dialogue_count": 0,
      "word_count": 429
    },
    {
      "scene_number": 4,
      "slugline": "INT. AIRPLANE - DAY 28   28  The same SELFIE PHOTO is on an INSTAGRAM page of JACQUELINE HATFIELD. WE SEE Brad scrolling through Jason’s wife’s Instagram page, a sour look on his face. ON PHONE - more PHOTOS of Jason’s family living the good life. NARRATOR The adventures.   And the sense of possibility.   No door ever closed. Everything an option. Brad puts away the phone and stares out the window.   * NARRATOR The world for them is not a battlefield.   Not even an obstacle course. He looks out at the clouds and the landscape below. NARRATOR It’s a playground.   A dream.   A Heaven manifest. Troy taps Brad on the shoulder.   A FLIGHT ATTENDANT stands behind him with her cart. TROY Dad, can I get some Pringles? They’re seven dollars. BRAD Seven dollars?   Yeah.   Okay. TROY I need your credit card. Brad pulls out his wallet and hands over the card.  INT. AIRPLANE - LATER 29   29  Troy has fallen asleep.   Brad sits and stares, thinking. NARRATOR Brad’s thoughts soon drifted back to his college days at Tufts.  BRAD'S STATUS - WHITE VERSION - Sept 13, 2016 -   Page 18",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 190
    },
    {
      "scene_number": 5,
      "slugline": "EXT. TUFTS UNIVERSITY - SUNSET 30   30  The late ‘80’s.   From a grassy knoll, we WATCH a GROUP of MALE STUDENTS gather and greet each other.   It’s a nostalgic, beautiful image. NARRATOR Wasn’t Brad then the golden boy? Wasn’t he the one destined for great things?   How did he end up the one compromised by life and living in the margins?   Brad likened it in his mind to a love affair.   When he was young, he was in love with the world.   And the world loved him.  EXT. SHOT OF PLANE LANDING 30A   30A   *  The SCREECH of TIRES on the runway.   *  INT. AIRPLANE - AFTERNOON 31   31  The plane has just landed.   It taxis across the runway. NARRATOR It pained him to admit the world had fallen out of love with him first.   This realization made him want to cry. Brad looks like he might cry, then realizes Troy is talking to him. TROY ...they say air travel leaves a huge carbon footprint - and with so many people flying now, it’s a big contributor to global warming. Kinda sucks. Brad snaps out of it, feigns attention to Troy. FLIGHT ATTENDANT (O.S.) Welcome to Boston.   Local time here is 6:15 PM...  EXT. BOSTON - DUSK 32   32  ICONIC BOSTON SPOTS from inside a moving TAXI.  BRAD'S STATUS - Blue Revision - Sept 26, 2016 -   Page 19",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 230
    },
    {
      "scene_number": 6,
      "slugline": "INT. TAXI - TRAVELING - DUSK 33   33  Brad and Troy are in the back of a taxi.  (CONTINUED)  BRAD'S STATUS - Blue Revision - Sept 26, 2016 -   Page 19A",
      "characters": [],
      "action_text": "NARRATOR In the cab ride to the hotel, Brad tried to locate the moment where things had gone wrong for him.   And when.   His first thought was Melanie.  INT. BRAD’S HOUSE - LIVING ROOM - NIGHT 33A   33A   *  Brad works at the dining room table.   He looks over at   * Melanie - she has pulled Troy close to her and plays with his   * hair as they watch TV.   The Bulldog is in Troy’s lap.   * NARRATOR   * Yes, Melanie was a great mother and   * she loved Brad and was clearly   * happy with their life together.   * Melanie looks over at him and smiles.   He smiles back.   *  INT. BRAD’S HOUSE - KITCHEN - NIGHT 34   34  Brad and Melanie are having a discussion in the kitchen as they make dinner. Brad approaches her with a spoonful of sauce to try.   * NARRATOR But she was also easily satisfied -   * and maybe her contentment   * undermined his ambition. Melanie tastes the pasta and smiles, nodding.   Brad remains skeptical that it tastes good.  INT. PRIVATE PLANE - DAY 35   35  Nick Pascale’s Boyfriend shows him a watch in a magazine. NARRATOR Nick Pascale’s boyfriend obviously loved expensive things.   Maybe his appetites spurred Nick’s drive to succeed. Nick takes out a WATCH BOX and hands it to Xavier.   Xavier opens it - it’s the same watch.   Xavier exults.  CONTINUED: 33   33  BRAD'S STATUS - Pink Revision - Sept. 29, 2016-   Page 20",
      "dialogue_count": 0,
      "word_count": 276
    },
    {
      "scene_number": 7,
      "slugline": "INT. PRIVATE PLANE - DAY 36   36  Jason Hatfield’s elegant Wife smooths down one of her daughter’s pinafores and arranges her hair. NARRATOR And Jason Hatfield’s wife was a blue blood.  (MORE)  (CONTINUED)  BRAD'S STATUS - Pink Revision - Sept. 29, 2016-   Page 20A",
      "characters": [],
      "action_text": "She had introduced him to rich clients, given him entree and status, and showed him the ways of the American aristocracy.  EXT. RED CARPET - NIGHT 37   37   *  Craig and his wife, DIANE, are both being interviewed separately on a red carpet before an event. NARRATOR And Diane Fisher was a celebrated intellectual herself.   She and Craig competed with each other - and that dynamic had driven Craig to become a stand-out in his field. They stop and pose for photos.  INT./EXT. TAXI - TRAVELING - DUSK 38   38   *  Brad’s PHONE - he is now looking at PHOTOS of Craig and Diane at the same event on his phone. NARRATOR Maybe Brad had married the wrong woman. Brad reacts to the photos. BACK ON PHONE - an incoming call - the screen reads “MELANIE”.   He answers. BRAD  (into phone)  Hey, honey.   Yep, we made it - we’re on our way to the hotel. How’s it going there?   Yeah?  INT. HOTEL LOBBY - NIGHT 39   39  Brad hands over his credit card to the EMPLOYEE at the REGISTRATION DESK.   Troy lingers nearby.   As the Employee runs Brad’s card... ...Brad eye-balls an OLDER MAN beside him, complaining to another HOTEL EMPLOYEE.  CONTINUED: 36   36  NARRATOR (cont'd)  (CONTINUED)  BRAD'S STATUS - Blue Revision - Sept 26, 2016 -   Page 21 OLDER MAN There’s this draft, moving the   * curtains - and I’m hearing this   * constant whistle and it’s driving   * me crazy...   * NARRATOR Brad’s suspicions then turned to his father.  INT. BRAD’S PARENTS’ HOUSE - NIGHT 40   40  BRAD’S DAD, a rumpled academic, sits in a reading chair, jotting his thoughts onto a yellow legal pad. NARRATOR His dad had been a professor and had spent years writing an exhaustive study on Institutional Fascism that was never published. Brad’s Dad reads over what he’s just written, finds it lacking and scratches it out.   He starts over. NARRATOR Brad found his father self-pitying and defensive.  INT. BRAD’S PARENTS’ KITCHEN - NIGHT 41   41   *  Brad and his dad, now older, have an argument over dinner. BRAD’S DAD I don",
      "dialogue_count": 0,
      "word_count": 1602
    },
    {
      "scene_number": 8,
      "slugline": "INT. HOTEL ROOM - NIGHT 45   45  Brad and Troy lie back on their twin beds, both illuminated by the glow of their laptops. On Brad - he is wide-eyed, energized - as he stares at the computer screen.   We can HEAR classical piano leaking from his ear buds. NARRATOR Brad was electrified by this latest development.   Here - suddenly - an unexpected lifeline - something tangible - an outward proof. ON COMPUTER - Brad is watching a home video of Troy playing piano.   He’s clearly a prodigy. NARRATOR Of course.   His child.   His son. Brad has tears in his eyes as he watches the video. NARRATOR A genius.   With substance.   His heart could burst with this deep satisfaction. He looks over at... ...Troy, watching GAME OF THRONES on his laptop. NARRATOR Brad realized along the way, he’d somehow lost the plot.   Cured of his amnesia, he now remembered what he’d been doing for the last seventeen years. Troy senses he’s being watched.   He looks over. Brad gives Troy a big, prideful grin. NARRATOR Planting and nurturing and modeling for this miraculous creature. Troy smiles back, bemused, then turns back to the show. Brad looks out into the middle distance, contemplative.  (CONTINUED)  BRAD'S STATUS - WHITE VERSION - Sept 13, 2016 -   Page 29",
      "characters": [],
      "action_text": "NARRATOR It occurred to Brad that Billy Werstler and Nick Pascale didn’t even have kids.  EXT. NICK PASCALE’S HOUSE - DAY 46   46  Nick and his Husband have a pool party at their LA mansion with a bunch of YOUNG, ATHLETIC GUYS. NARRATOR The pleasures in their lives were like candy, Brad thought.  EXT. MAUI BEACH 47   47  Billy makes out with an attractive GIRL in the ocean.   * NARRATOR Sugary, addictive, but ultimately empty, even potentially harmful.  INT. HOTEL - NIGHT 48   48  Brad puts away the laptop, smiling to himself. NARRATOR Not like the profound and sustaining pleasure Brad was experiencing right now. Troy is now crouching in front of the mini-bar cabinet. TROY Dad, can I have this Toblerone? BRAD Of course. As Troy opens the Toblerone... NARRATOR In this new light, Brad reconsidered all his regrets.  INT. PRIVATE PLANE - DAY 49   49  It’s mayhem in the Hatfield family’s private plane.   The kids are all acting bratty, complaining and arguing.  CONTINUED: 45   45  (CONTINUED)  BRAD'S STATUS - Blue Revision - Sept 26, 2016 -   Page 30 Jason Hatfield looks irritated, ignoring the chaos as he tries to work on his computer. NARRATOR If he had pursued money and power like Jason Hatfield, Troy might have ended up spoiled and entitled. One of the young boys snorts a line of COCAINE off a tray. NARRATOR Maybe on hard drugs.  INT. NEW YORK RESTAURANT - DAY 50   50  Craig and Diane Fisher and their TWEEN TWIN GIRLS, in their Brooklyn hipster fashion, have a discussion over brunch. NARRATOR And if he had married a striver like Diane Fisher and stayed in New York, his kids could have been self- important and unbearable. TWEEN TWIN ONE We need capital for our digital newsletter.   You must know investors. CRAIG Well, what is it exactly? TWEEN TWIN TWO We’ve told you, Dad.   Feminist theory and shopping tips.  INT. HOTEL ROOM - NIGHT 51   51  Troy hands Brad the last chunk of Toblerone.   Brad pops it in his mouth. BRAD  (to himself; chewing)  Thank God for Sacramento",
      "dialogue_count": 0,
      "word_count": 592
    },
    {
      "scene_number": 9,
      "slugline": "INT. HOTEL ROOM - NIGHT 52   52  Troy and Brad sleep soundly in their beds.   They both SNORE. NARRATOR For the first time in months, Brad slept through the night without waking.  EXT. HARVARD BRIDGE - MORNING 52A   52A   *  Troy and Brad walk the bridge from Boston to Cambridge.   *  EXT. HARVARD UNIVERSITY - MORNING 52B   52B   *  Troy and Brad enter the Harvard gates.   *  EXT. HARVARD UNIVERSITY - MORNING 53   53  Troy and Brad walk to the ADMISSIONS BUILDING. BRAD You nervous? TROY Not really.   I guess, a little. BRAD I know you.   You’ve got this. TROY Thanks, Dad. Brad opens the door to the ADMISSIONS OFFICE and they enter.  INT. ADMISSIONS OFFICE - MOMENTS LATER 54   54  Brad looks at some photos on the wall: An old photo of YOUNG, WHITE HARVARD STUDENTS from the 1800’s. Another old photo of YOUNG, WHITE HARVARD STUDENTS from the 1950’s A third photo of YOUNG, ETHNICALLY DIVERSE STUDENTS from the present day. Brad crosses and sits, next to another waiting MOTHER.  (CONTINUED)  BRAD'S STATUS - WHITE VERSION - Sept 13, 2016 -   Page 32",
      "characters": [],
      "action_text": "BRAD You have a son?   Daughter? MOTHER Yes, a son - he’s interviewing. BRAD Mine, too.   Where you from? MOTHER St. Petersburg. BRAD Russia?? MOTHER  (shakes her head)  Florida. BRAD Oh, right.   Okay.   My son is a very talented musician.   Pianist. Keyboard.   And he composes his own music so... MOTHER Wonderful. BRAD Looks like he’s gonna have a lot of decisions to make.   I think Harvard - is definitely in the running though. MOTHER  (dry)  You think Harvard has a chance? BRAD What does your son, uh, do? MOTHER What does he do?   He’s a student in high school. BRAD Right, right.  (sizes her up)  Okay. Suddenly, a sheepish Troy appears.  CONTINUED: 54   54  (CONTINUED)  BRAD'S STATUS - WHITE VERSION - Sept 13, 2016 -   Page 33 TROY Hey, Dad. BRAD  (confused)  What happened?   Is it over? TROY I got the day wrong. BRAD What? TROY I got the day wrong.   It’s yesterday. BRAD Yesterday.   What do you mean? TROY Yeah, I don’t know, I fucked it up. It was yesterday. BRAD Did they give you a time to come back? TROY I think they’re pretty booked up. They said I could do an alumni interview back in Sacramento. BRAD Noooo.   You don’t want to do that. You want to do it with one of these guys.   These are the guys that decide.  (to the MOTHER)  Right? The Mother shrugs. TROY I’m just gonna go on the tour. It’s not a big deal. BRAD It IS a big deal.   Let me talk to them. TROY No, Dad, no.  CONTINUED: 54   54  (CONTINUED)  BRAD'S STATUS - WHITE VERSION - Sept 13, 2016 -   Page 34 BRAD Yes, I’m going to.   We didn’t come all this way so you could have an interview in   Sacramento .  INT. ADMISSIONS OFFICE - RECEPTION AREA - DAY 55   55  An ADMISSIONS OFFICER talks to Brad.   Troy hovers, anxious. ADMISSIONS OFFICER I’d love to be able to accommodate you guys - but our schedule’s been set - for months. BRAD We flew from Sacramento. ADMISSIONS OFFICER We have a pretty small staff here... BRAD I just want you to get a sense of my son.   Harvard is his first choice.   So... TROY",
      "dialogue_count": 0,
      "word_count": 3792
    },
    {
      "scene_number": 10,
      "slugline": "INT. MEXICAN RESTAURANT - MOMENTS LATER 78   78  Brad runs into the restaurant, frantic. BRAD  (cupping phone)  What’s the name of that music professor?! TROY What?! BRAD The music professor!   The one you like!   C’mon, c’mon! TROY Jerome Backaly? BRAD  (into phone)  Jerome Backaly.   Yeah.   That would be terrific, Craig.   Man, I owe you.   Fantastic!   Yeah, dinner tomorrow.   Yep!   Talk soon!   Hey - have a good, uh, taping! Brad hangs up, feeling a mixture of emotions. TROY What’s going on?   Dad? BRAD I’m on it, okay?   I’m on it. Brad gives Troy a confident, cryptic look. Troy rolls his eyes and returns to his burrito.  INT. CAMPUS BOOK STORE - DAY 79   79  Troy strolls the aisles, looking at various books on music. Nearby, Brad pulls a book off a display table. ON BOOK - “POLITICAL BEASTS by CRAIG FISHER”.   * Brad reads a little of the book - contempt all over his face. He turns over the book...  (CONTINUED)  BRAD'S STATUS - WHITE VERSION - Sept 13, 2016 -   Page 53",
      "characters": [],
      "action_text": "On the back - a PHOTO of Craig, arms folded, with a take-me- seriously expression. Brad sticks out his tongue, nauseated. Suddenly, Brad’s PHONE BUZZES.   He takes it from his pocket. BRAD  (into phone)  Craig!   Hey!   Guess what?   I’m in a book store right now, looking at your book!   The new one, yeah. It’s got a big display here!   *  (eyes widen)  Yeah?!   Seriously?   Man, you are the best!   I don’t even know how to thank you!   * But in his excitement, Brad drops the book onto the table. BRAD I can’t wait to tell Troy!  INT. CAMPUS BOOK STORE - MOMENTS LATER 80   80  An excited Brad approaches Troy. BRAD Guess who you got a meeting with tomorrow morning! TROY Who? BRAD Jerome Backaly. TROY Shut up! BRAD And after - you’ve got an interview - with the Dean of Admissions himself! TROY No way!  CONTINUED: 79   79  (CONTINUED)  BRAD'S STATUS - Pink Revision - Sept. 29, 2016-   Page 54 BRAD Way! TROY Now, I’m nervous! BRAD Come on! TROY Shit!   Wait, but tomorrow I have Tufts. BRAD Fuck Tufts! TROY Right, right. BRAD We’ll go in the afternoon. TROY Dad! BRAD What? TROY You’re the King! BRAD  (grins)  I got you, pal. They high-five, both in great spirits.  INT. CAMPUS BOOK STORE - MOMENTS LATER 81   81  Brad approaches Troy with a Harvard sweatshirt.   * NARRATOR Coming through for his son made Brad giddy.   What if these meetings really did help Troy get into Harvard? Troy shakes his head, but then takes the sweatshirt with a   * sheepish smile.   *  CONTINUED: 80   80  BRAD'S STATUS - Pink Revision - Sept. 29, 2016-   Page 55",
      "dialogue_count": 0,
      "word_count": 449
    },
    {
      "scene_number": 11,
      "slugline": "INT. BRAD’S HOUSE - DAY 82   82  A euphoric Troy races into the room. TROY I got in!   I got in! At the table, Brad and Melanie leap to their feet, exulting. NARRATOR And what if, looking back, this was the fateful moment that started Troy onto a path of unimaginable glory.  EXT. MAGAZINE STAND IN SACRAMENTO - DAY 83   83  Melanie and Brad pull a WIRED MAGAZINE off the shelf. The cover is a picture of TROY with the headline - “WUNDERKIND STARTS A MUSICAL REVOLUTION”. NARRATOR He pictured Troy as an adult, happy and wealthy, even famous. Brad and Melanie hold each other as they stare at the cover.  INT. HOTEL RESTAURANT - DAY 84   84   *  Troy, well-dressed and confident, sits across from Melanie and Brad.   Troy has a beautiful GIRLFRIEND by his side. TROY Dad, Mom, I love you so much.   All my success is because of you. Melanie and Brad react, touched. TROY Guess what?   I bought an island! As Troy starts to show them photos on his phone, we HEAR... NARRATOR He pictured Troy’s triumphs eclipsing those of Brad’s contemporaries.   How gratifying that would be.  BRAD'S STATUS - Blue Revision - Sept 26, 2016 -   Page 56",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 204
    },
    {
      "scene_number": 12,
      "slugline": "EXT. CAMPUS BOOK STORE - DAY 85   85  Brad and Troy have exited the store with their purchases.   * Troy tries on the sweatshirt for his dad.   * Brad’s expression seems to change as Troy models his new   * Harvard sweatshirt. NARRATOR Suddenly, Brad was struck with a pang of anxiety. Troy takes the sweatshirt off again - embarrassed.   * NARRATOR What if Troy lorded his success over Brad - or hoarded it away?  INT. BRAD’S HOUSE - NIGHT 86   86  Brad and Melanie watch... ON TV - Troy is being interviewed by JIMMY KIMMEL. NARRATOR What if, in the end, Troy’s wins made Brad feel even more the loser? In his chair, Brad is feeling a mixture of emotions. MELANIE Did he call you back yet? Brad shakes his head.   Melanie frowns. NARRATOR What if they became estranged, alienated by their diverging fortunes?  INT. BRAD’S OFFICE - DAY 87   87  A stung Brad takes down the framed WIRED MAGAZINE COVER of Troy from the wall above his desk. NARRATOR What if Brad ended up envious of his own son? Brad drops the FRAMED PORTRAIT into a storage box.  BRAD'S STATUS - Pink Revision - Sept. 29, 2016-   Page 57",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 201
    },
    {
      "scene_number": 13,
      "slugline": "EXT. CAMBRIDGE STREET - DAY 88   88  Brad and Troy walk across a busy intersection.   Brad’s expression has turned grim. NARRATOR The thought horrified him. At the corner, they pass a YOUNG BUSKER, singing and strumming his GUITAR. Brad pauses for a moment. NARRATOR But, then again, musicians don’t really make money. Brad looks over at Troy - who has also stopped to listen, enjoying the music. NARRATOR Maybe even with an expensive education, Brad could wind up a struggling artist.  EXT. CAMBRIDGE STREET - DAY 89   89  Now, it is Troy busking on a Cambridge street, playing music on his keyboard for the PASSERS-BY. NARRATOR Maybe Troy will take after Melanie - perfectly satisfied with practically nothing. A PEDESTRIAN drops a dollar into Troy’s upturned hat.   Troy smiles, appreciative.  EXT. CAMBRIDGE STREET - DUSK 90   90  Troy, looking like a white-trash thug, and a few DIRTBAG FRIENDS smoke a joint and drink beers on the corner. NARRATOR Or worse, end up like Brad - bitter and restless and full of regrets. Maybe even blaming Brad for all of life’s disappointments.  (CONTINUED)  BRAD'S STATUS - WHITE VERSION - Sept 13, 2016 -   Page 58",
      "characters": [],
      "action_text": "TROY  (to another GUY)  My dad’s a fucking loser, too... Troy takes a swig, then tosses his beer can into the street.  EXT. CAMBRIDGE STREET - DAY 91   91  Brad and Troy listen to the Busker finish his song. The song ends.   Brad and Troy and a few others CLAP. Troy drops a FIVE into the Busker’s hat.  INT. HOTEL ROOM - DUSK 92   92  Brad and Troy change clothes for dinner. BRAD If you’re just gonna be a musician, do you even need to go to college? TROY Hunh? BRAD It’s a fair question. TROY  Just a musician ? BRAD I’m just saying - do you need a Harvard diploma to play music in a band?   Isn’t that what you want to do? TROY I don’t know what I want to do, Dad. BRAD Well, you need to start thinking about it - ‘cause this isn’t cheap, Troy.   You’re assuming a lot if you think I can pay for all this without taking out loans - and   you  taking out loans - and trying to get scholarships - and financial aid...  CONTINUED: 90   90  (CONTINUED)  BRAD'S STATUS - WHITE VERSION - Sept 13, 2016 -   Page 59 TROY What the fuck just happened? BRAD  (softens)  I’m just thinking out loud, okay? TROY I don’t expect you to pay for everything.  (beat)  Are you not gonna be able to pay for everything? BRAD We’ll see.   Look, I don’t want you to worry about that - yet. TROY Clearly. BRAD Hey, it might not be a big issue. Maybe one of your grandparents will die. Troy reacts, disturbed.  INT. HOTEL LOBBY - NIGHT 93   93  As Brad and Troy step off the elevator, they see... ...a beautiful young Indian-American woman, ANANYA, (21) standing in the lobby. TROY Hey! ANANYA Hey, Troy. She approaches and they hug. TROY This is my dad, Brad. ANANYA Hey, dad Brad.   I’m Ananya. Ananya and Brad shake hands.  CONTINUED: 92   92  (CONTINUED)  BRAD'S STATUS - WHITE VERSION - Sept 13, 2016 -   Page 60 BRAD So you guys were friends at Country Day? TROY Not really.   Well, Ananya was a Senior and I was a Freshman... ANANYA  (protesting)  We were friends. TROY You were nice to me. ANANYA We were in orches",
      "dialogue_count": 0,
      "word_count": 700
    },
    {
      "scene_number": 14,
      "slugline": "INT. HIPSTER RESTAURANT - NIGHT 94   94  Brad and Troy sit across from Ananya. ANANYA That’s cool you got a meeting with Jerome Backaly.   How’d you manage that? TROY My dad’s friends with a professor here. ANANYA Oh, yeah?   Who? BRAD His name’s Craig Fisher. Ananya grimaces, then recovers. BRAD What? ANANYA What? BRAD You made a face. ANANYA I did? BRAD You definitely made a face.   You can say whatever you want.   We’re not close or anything.   We were friends a   long   time ago. ANANYA Well, I just took his class last year - he’s kind of the worst.  (smiles; self-conscious)  Should I have not said that? BRAD No.   Say it.   Why? ANANYA He’s just condescending.   And I don’t know - he’s pretty sexist.  (MORE)  (CONTINUED)  BRAD'S STATUS - WHITE VERSION - Sept 13, 2016 -   Page 62",
      "characters": [],
      "action_text": "He’s just got this air of someone who thinks they know everything because they’re on TV and... they have contacts at the White House. BRAD So how do you really feel? ANANYA The way he sees politics - it’s all a game.   Who’s up.   Who’s down. It’s doesn’t inspire me.   Honestly - by the end of his class, I wanted to quit my major. BRAD Aren’t you a music major? ANANYA  (shakes her head)  Government.   I love music, but I want to get into public policy. TROY My dad majored in Government. BRAD Communications and Government. This was at Tufts.   Actually, Craig and I were in all the same classes. ANANYA Really?   Was he like... a cocky prick then, too? BRAD  (smiles)  Not as bad, I don’t think. ANANYA So what do you do now? BRAD I have a non-profit I started a few years ago. ANANYA Really?   Awesome.  CONTINUED: 94   94  ANANYA (cont'd)  (CONTINUED)  BRAD'S STATUS - WHITE VERSION - Sept 13, 2016 -   Page 63 BRAD We help other non-profits use social media to get the word out about what they do - help them find members and donors and... ANANYA Like crowd sourcing or...? BRAD Some of that.   We’re consultants, basically.   It sounds boring... ANANYA It doesn’t sound boring.   It sounds amazing. BRAD  (pleased)  Well, thanks. ANANYA I’m actually writing my thesis on NGO’s - maybe I could talk to you at some point... BRAD Of course.   Whatever you need. ANANYA Thanks.   I once told my dad my dream job was to work at Amnesty International - he was like devastated.   He wanted to disown me.   (to TROY)  You’re lucky your dad’s so cool. TROY  (nods)  I am lucky. BRAD Tell us about your thesis... ANANYA Really?   It’s not fully formed but I want to write about the history of white missionary women - you know, the wives? - and how they came to India and Sri Lanka to “convert the heathens” but laid the ground work for social reform...  CONTINUED: 94   94  (CONTINUED)  BRAD'S STATUS - WHITE VERSION - Sept 13, 2016 -   Page 64 As Ananya talks, Brad soaks her up.   Ananya’s voice fa",
      "dialogue_count": 0,
      "word_count": 3036
    },
    {
      "scene_number": 15,
      "slugline": "EXT. HARVARD BRIDGE - MORNING 105   105  Brad and Troy cross the Harvard Bridge toward Cambridge.  EXT. HARVARD QUAD - MORNING 106   106  Brad waits on a bench for Troy to get out of his meeting. Brad is deep in thought. NARRATOR The next morning, Brad turned on Ananya.   He kept replaying in his mind things she had said.  INT. DRUID - FLASHBACK 107   107  Ananya, at the booth... ANANYA Sounds like you just kinda backed into it ‘cause nothing else worked out.  EXT. HARVARD QUAD - DAY 108   108  Brad grimaces at the memory. NARRATOR Youth can be so arrogant and unforgiving.   He doubted she would ever live up to her own lofty ideals.  INT. PRIVATE PLANE - DAY 109   109  CLOSE on ANANYA, smiling with satisfaction. NARRATOR He could identify a strain of superiority in her.   He bet if her circumstances were different, she would be singing another tune. We PULL BACK TO REVEAL Ananya on a private plane with Jason Hatfield.   Maya is here, too. They all hold flutes of champagne and toast each other.  (CONTINUED)  BRAD'S STATUS - WHITE VERSION - Sept 13, 2016 -   Page 77",
      "characters": [],
      "action_text": "NARRATOR One taste of luxury - and how quickly she might forget the suffering of the masses. They guzzle down their champagne, toss their flutes to the   * floor and LAUGH.   *  EXT. HARVARD QUAD - DAY 110   110  Brad shakes his head at the thought. NARRATOR Brad realized he was just trying to make himself feel better.  INT. RESTAURANT - FLASHBACK 111   111  Ananya, talking at dinner, full of passion. NARRATOR Ananya had a good heart - she seemed wise. Brad smiles at her from across the table. NARRATOR She reminded him a lot of Melanie. Melanie has replaced Ananya.   She talks animatedly, looking radiant.  EXT. HARVARD QUAD - DAY 112   112  This latest thought causes Brad to snap out of his reverie. BRAD Melanie.   Shit. Brad takes out his PHONE and calls Melanie. BRAD  (into phone)  Hey, hon.   Trip’s going great. Troy is meeting with one of the music professors here right now and then he’s got an interview with the Dean of Admissions.   So yeah - it all seems to be working out.  CONTINUED: 109   109  (CONTINUED)  BRAD'S STATUS - WHITE VERSION - Sept 13, 2016 -   Page 78 Brad spots... ...Troy and an African-American professor, JEROME BACKALY, exiting a building.   Troy and the Professor shake hands. The Professor returns inside as Troy heads toward his dad. BRAD Anyway, Troy’s here now so call me back later.   I’ve got dinner with Craig Fisher...  (sarcastic)  ...so I’m really looking forward to that, as you can imagine.   Love you, honey. Brad hangs up and puts away his phone. BRAD How was it? TROY Good.   He listened to some of my stuff and I think he liked it. BRAD That’s awesome, Troy! TROY He said he was gonna put in a call to the admissions department, too. BRAD What?!   See!   There you go! Connections and talent.   I give you the lay up - you swish it in. Troy nods and smiles.  EXT. HARVARD CAMPUS - MOMENTS LATER 113   113  Brad and Troy walk along the campus. BRAD What’s wrong? TROY Nothing. BRAD You seem a little... you should be pumped!   You should be h",
      "dialogue_count": 0,
      "word_count": 2114
    },
    {
      "scene_number": 16,
      "slugline": "INT. COMMUNICATIONS AND MEDIA STUDIES - DAY 121   121  Brad scans the DIRECTORY OF OFFICES by the entrance. He finds - “Professor Connor - Room 107”. Brad heads off, down the hall.  INT. COMMUNICATIONS AND MEDIA STUDIES HALLWAY - MOMENTS LATER 122   122  Brad approaches Room 107 and peers inside.   The office seems to be in transition.   There are moving boxes on the shelves and on the floor. A FEMALE PROFESSOR - around Brad’s age - is at the desk.   She looks up from her laptop. BRAD Uh, hi.   I’m an old student of Professor Connor’s.   I was hoping to see him.   Is he...? FEMALE PROFESSOR Oh, you just missed him. BRAD He just left? FEMALE PROFESSOR No.   I’m sorry to say, he died. Just a few weeks ago. BRAD He did?   His name’s still on the... directory. FEMALE PROFESSOR I know - we need to change that.   I just got in here. BRAD How did he... die? FEMALE PROFESSOR He had a stroke.   And he never recovered. BRAD Oh.   That’s sad. FEMALE PROFESSOR Yes.  (CONTINUED)  BRAD'S STATUS - WHITE VERSION - Sept 13, 2016 -   Page 88",
      "characters": [],
      "action_text": "BRAD He was a great teacher. FEMALE PROFESSOR He was a sweet man. BRAD  (after a beat)  Well, have a nice day. FEMALE PROFESSOR Thanks.   You, too. Brad heads out.   The Professor returns to her work.  EXT. TUFTS CAMPUS - DAY 123   123  Brad wanders the campus, lost in thought. After a moment, we HEAR: NARRATOR Brad thought about the events of the morning and felt a sudden clarity.   How ridiculous it was for him to be jealous - or insecure about his place. Brad watches TWO STUDENTS - a young, attractive couple - walk past, holding hands.   They are in love. NARRATOR What a waste of energy to resent other people’s few pleasures. Brad watches them go. A MIDDLE-AGED WOMAN, looking harried and stressed, is next to approach. NARRATOR How stingy and mean - when everyone struggles. Brad gives her a consoling smile, as she passes.  INT. HOSPITAL HALLWAY - DAY 124   124  A distressed Jason Hatfield sits in a hallway, waiting for news.   His Wife can be seen, talking to a DOCTOR in the b.g.  CONTINUED: 122   122  (CONTINUED)  BRAD'S STATUS - WHITE VERSION - Sept 13, 2016 -   Page 89 NARRATOR He pictured his friends in their private, anxious moments.   No one is immune to pain. Jason nervously cracks his knuckles.  EXT. TUFTS CAMPUS - DAY 125   125  Brad walks, then stops to look at... ...a MEMORIAL PLAQUE, commemorating a departed University President. NARRATOR Brad’s thoughts then turned to death.   The great equalizer. Brad studies the memorial, closely.  INT. COMMUNICATIONS AND MEDIA STUDIES OFFICE - DAY 126   126  DIPLOMAS and DEGREES for “ROBERT CONNOR” have been placed into various boxes on the shelves to be taken away. In one box, we SEE a PHOTO of the distinguished, old PROFESSOR shaking some important person’s hand. NARRATOR His professor gone - without a trace - a brilliant man with a unique mind - and at the institution he had given his whole life to - already replaced. We SEE now the Female Professor - she types blithely away at her computer.  INT. BRAD’S PARENTS",
      "dialogue_count": 0,
      "word_count": 3302
    },
    {
      "scene_number": 17,
      "slugline": "INT. NICK PASCALE’S HOUSE - DAY 140   140  Craig regales his wife, Diane and a few other GUESTS. CRAIG It was embarrassing.   He’s out of his mind.   He’s completely lost it.  INT. NICK PASCALE’S HOUSE - DAY 141   141  Craig talks to Nick and Nick’s Husband. CRAIG He was the golden boy in college - and now I’m the one who’s winning prizes and getting recognized. He’s overcome with jealousy.  INT. NICK PASCALE’S HOUSE - DAY 142   142  Craig chats with Jason and his Wife. CRAIG He’s insane.   He’s a pedophile.   He looks old. Jason and his Wife, nod, solemnly.  EXT. CONCERT HALL - NIGHT 143   143  Brad crosses the quad to the concert hall. NARRATOR Why did he let Craig get to him? After all these years, why didn’t Brad have a stronger sense of self? Why couldn’t he sustain a feeling about himself?   Or even a point of view?  EXT. CONCERT HALL - NIGHT 144   144  Brad stands at the BOX OFFICE, lost in thought. NARRATOR Why was he always elsewhere, in his head, puffing himself up or tearing himself down?   Enough.  (CONTINUED)  BRAD'S STATUS - WHITE VERSION - Sept 13, 2016 -   Page 106",
      "characters": [],
      "action_text": "TICKET SELLER Sir.   Your ticket. Brad snaps out of it.   He takes his ticket and goes.  INT. CONCERT HALL - NIGHT 145   145  A small concert hall, mostly filled.   Brad stands at the back, looking for Troy. He spots him, sitting alone, near the front. MOMENTS LATER Brad appears by Troy’s side. TROY  (surprised)  Dad? Brad gives Troy a smile and takes the seat next to him. TROY What about your dinner? BRAD I’d rather be with you. Troy nods - as the AUDITORIUM LIGHTS GO DOWN. The LIGHTS GO UP on the stage - a group of about THIRTY STUDENT MUSICIANS are seated. Then, Ananya, with her flute, and Maya, with her violin, walk onto the stage. BRAD Those are the girls from last night. TROY I know. The musicians begin to play DVORAK’S “HUMORESQUE”. The music is beautiful, soothing, smooth. ON BRAD - as he listens, lost in thought. Brad looks over at... Troy, sitting still beside him, enjoying the music.  CONTINUED: 144   144  (CONTINUED)  BRAD'S STATUS - WHITE VERSION - Sept 13, 2016 -   Page 107 Brad takes Troy in with a proud, melancholy smile. He then turns his attention to the stage. ON STAGE - Ananya, on her flute, and Maya, on her violin, are playing their duet. ON BRAD - as he listens, he looks increasingly stunned. BRAD  (loud whisper)  They’re so good. TROY Shh.   Dad. Brad sits back in his seat, taking it in, really listening. NARRATOR The music is beautiful, Brad thought. The concert continues. Ananya and Maya are extraordinarily talented. NARRATOR These girls are beautiful. ON BRAD - he is visibly moved. NARRATOR He could love them and never possess them. The entire orchestra joins in - the music is gorgeous. NARRATOR Just like he could love the world and never possess it. A dam of emotion bursts.   Brad is now crying in his seat. NARRATOR He still   did   love the world. Deep, cathartic tears. Troy looks over and sees that his father is crying. TROY Dad?  CONTINUED: 145   145  (CONTINUED)  BRAD'S STATUS - WHITE VERSION - Sept 13, 2016 -   Page 108 Brad tries to ",
      "dialogue_count": 0,
      "word_count": 1175
    }
  ]
}