{
  "slug": "breaking-bad-301-no-mas-2010",
  "title": "breaking bad 301 no mas",
  "genre": "drama",
  "format": "series",
  "scenes_count": 7,
  "characters_count": 0,
  "characters": [],
  "total_words": 12561,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. SANTA MUERTE SHRINE - DAY 3   3  At the doorless threshold, white-hot light blasts in from  outside... and yet the interior quickly falls off into GLOOM.  It’s almost as if the sun is afraid to come any further.  Our pilgrims crawl in, joining others who are already here.  The Cousins arrive, rising to their knees and removing their  sunglasses.   It’s tight inside -- lots of sweaty, needy  worshippers and scores and scores of flickering CANDLES,  green, yellow and gold.  Everybody faces a sort of altar-wall at the front.   Standing  before them, greeting all with outstretched arms, is a  skeleton in a lace dress and a veil.   This is SANTA MUERTE,  and these people have come a long, hard way to pray to her  (Although we’re taking some liberties, this is a real cult  down in Mexico, with believers numbering in the millions.  Check it out on Google or YouTube) .  Stacked high at the Saint’s feet are hundreds of offerings:  tobacco, tequila and rum, fruit and flowers, coins, food.  The altar-wall is thickly papered with yellowing letters,  plus photographs old and new.   These represent requests --  leave an offering, light a candle and say a prayer, then hope  your request gets answered.   All around, folks murmur in  Spanish, talking to their beloved   La Nina Blanca .  Taking their turn at the wall, the two Cousins have a request  of their own.   One pulls a fat candle from the pocket of his  jacket, lights it and sets it at the Saint’s feet.   This  candle stands out from all others, as it is BLACK.  The other Cousin produces a wrinkled sheet of paper.   He  folds it open and carefully tacks it to the altar-wall.   Both  men settle back, staring intently at it.  CLOSE ON the sheet.   It’s a drawing of a man’s face.   Kind of  like a police sketch.   Maybe it’s a bit crude and homemade...  but we instantly recognize this bald, average man.   He has a  mustache, dark glasses and a black, narrow-brimmed hat.  It’s HEISENBERG, the drug-dealing alter-ego of WALTER WHITE.  Our two scary Cousins glare at Heisenberg.   Off them,  wrathful and unblinking, their lips moving in silent  prayer... and us thinking   ”Oh shit.   THIS can’t be good...”  ... We begin SEASON THREE.  END TEASER  BREAKING BAD #301   \"No Mas\"   WHITE   8/3/09   3.",
      "characters": [],
      "action_text": "ACT ONE  FUZZY, COLORED LIGHTS 4   4  Fill frame.   We are MACRO-CLOSE on a TV SCREEN.   We’re so  close, in fact, that its tiny PIXELS stand out INDIVIDUALLY.  Many colors sweep through, making an unseen larger image.  ANNOUNCER’S VOICE  We interrupt our scheduled  programming to bring you breaking  news.  FIRST ANCHOR  Good afternoon.   In the last  several minutes, KABQ has received  dozens of reports of what appears  to be a crashed aircraft --  possibly   two   aircraft -- on  Albuquerque’s east side.   As of yet  details are scarce, but callers  describe witnessing an explosion  overhead, followed by falling  debris.   Visible now toward the  Sandias are two large columns of  smoke, which seem to indicate...  Throughout this and the FOLLOWING, we slowly PULL OUT from  the television screen.   We begin to make out faces, details.  What follows is a MONTAGE of NEWS on DIFFERENT STATIONS.  It’s a constant flow of different REPORTERS and ANCHORPEOPLE,  all of them CROSS-FADING IN and OUT.   The conceit is that  we’re watching ONE WEEK’S WORTH of coverage of this big,  growing story -- this airline disaster which ended ep. 213.  Hopefully we can pull this off with seven ON-CAMERA talkers,  rounded out with another few unseen LOOP GROUPERS.  IMPORTANT!   Our on-camera folks -- when they REPEAT -- should  have WARDROBE CHANGES to help sell a passage of time.  FIRST REPORTER  ... Crash investigators with the  National Transportation Safety  Board are expected on-site as early  as this evening.   However,  officials warn that with a debris  field of this magnitude, the  investigation and clean-up may  stretch well into the week.  Meanwhile, Wayfarer Airlines has  issued the following statement...  BREAKING BAD #301   \"No Mas\"   WHITE   8/3/09   4. SECOND ANCHOR  ... Boeing 737 was being re-routed,  or “vectored” through the airspace,  which is standard procedure  according to a spokesman for the  FAA.   The eight-seat King Air 350  was a charter flight operating out  o",
      "dialogue_count": 0,
      "word_count": 1496
    },
    {
      "scene_number": 2,
      "slugline": "EXT. WHITE HOUSE - BACKYARD - MORNING - CONTINUOUS 6   6  Out here on the patio we continue to hear that TV NEWS  playing faintly in the house.   Without seeing inside through  the curtains (as we obviously have a set/location mismatch),  we PAN off the open sliding glass door to find...  ... WALTER WHITE seated by his swimming pool.  It’s been a week since the end of 213.   The NTSB guys have  long since come and gone.   All is cleaned up except for Walt.  Unshaven, unshowered, he sits alone in his bathrobe, engaged  in an activity viewers may remember from our Pilot episode.  Walt lights MATCHES.   He lets them burn, then tosses them in  the pool.   Several books’ worth are in there already --  little black squiggles gently bobbing on the surface.  Walt is barely aware of what he’s doing.   He looks like shit  and feels even worse.   Self-loathing, bereft, haunted, he  hasn’t slept in days.  CLOSE -- Walt is down to his very LAST MATCH.   His fingers  pause, hesitating to tear it loose.   Instead, emotion now  wells up inside him... as does an IMPULSE.  Up he lurches from his chair, matchbook in hand.   CUT TO:  EXT. WHITE HOUSE - BACKYARD - MINUTES LATER 7   7  BLACKNESS.   CLANG!   Suddenly we can see as Walt removes the  lid.   We realize we’re INSIDE his CHARCOAL GRILL, looking  straight up at Walt and the blue sky above.   He yanks out the  wire cook-top and tosses it, making room.  What is Walt dumping on us?   Is this... wait...   MONEY ?  NEW ANGLE -- it is indeed.   Emptying his familiar black  duffel into the Weber, Walt is a man with a fever.   Guilt and  self-directed anger have whipped him to a frenzy.   Wrapped  stacks of bills pile Matterhorn-high.   Some tumble to the  ground.   Walt grabs the strays, piling on every last dollar  of his METH EARNINGS.  Splurp-splurp-splurp   goes the lighter fluid, soaking all.  There’s a wild, “fuck it!” gleam in Walt’s eyes as he tears  loose the last match and strikes it to life.  He’s not really gonna do this, is he?   Oh, hell yeah he is.  WHOOOOOOMPH!   Big orange flames.   Walt stands by, watching  with grim satisfaction as the top bills curl and blacken.  BREAKING BAD #301   \"No Mas\"   WHITE   8/3/09   8.",
      "characters": [],
      "action_text": "Funny how short-lived satisfaction can be.   It quickly dawns  on Walt --   what the FUCK am I DOING?!   Eyes wide, he GRABS up  the grill --   AAH!   Hot, HOT!!   -- stumbling with it toward the  pool.   A few wads of burning cash spill onto the pavement.  KER-BLOOOSH!   Into the pool goes the grill and money in a fat  sizzle of STEAM.   Meantime, the sleeve of Walt’s bathrobe has  caught FIRE.   He spins and flails it through the air, but it  isn’t going out -- so into the water he BELLY-FLOPS.  (Obviously, the particulars of this fire gag all depend on  what we can actually pull off safely.   To be determined.)  Walt pops back to the surface, looking like a drowned rat.  He stands chest-high, frantically splashing water at the last  few lumps of cash still BURNING poolside.   Off our hero...  EXT. OFFICE BUILDING - DAY 8   8  To establish.   We’re amongst the tall buildings downtown,  though this particular one is NEW to us (let’s also grab as  many angles of our DEA BUILDING as we can while we’re here).  INT. LAW OFFICE - ANTEROOM - DAY 9   9  A quiet, tasteful lobby.   Currently the only client waiting,  SKYLER sits here beside baby HOLLY, asleep in her carrier.  Skyler stares into space.   This has been one hell of a week,  one hell of a month.   There’s a lot on her mind right now --  all of it complicated and painful.  Of note:   she wears a turquoise RIBBON pinned to her blouse.  We CREEP IN on Skyler, utterly lost in thought.   Until...  RECEPTIONIST’S VOICE  Ms. White?   She’s ready for you.  (Let’s keep this receptionist completely offscreen so we can  simply use a LOOP GROUP VOICE.   Yay austerity!)   Off Skyler,  forcing a smile and rising to her feet, we CUT TO:  INT. LAW OFFICE - DAY 10   10  PAMELA ORBIC, attorney at law, smiles down at baby Holly,  playing with her tiny hand.  PAMELA  You are one little cutie!   Yes, you  are.   What, nine, ten weeks..?  BREAKING BAD #301   \"No Mas\"   WHITE   8/3/09   9. SKYLER  (smiling)  Close.   Two months to th",
      "dialogue_count": 0,
      "word_count": 2787
    },
    {
      "scene_number": 3,
      "slugline": "EXT. WHITE HOUSE - MORNING 16   16  We’re low in the street, looking up at the house.   The Aztek  is gone.   A fragment of yellow POLICE LINE TAPE -- a reminder  of the air disaster -- lazily skitters through frame in f.g.  ( PRODUCTION NOTE:   split-diopter shot? )  INT. WHITE HOUSE - DINING ROOM - MORNING 17   17  Skyler and WALTER, JR. eat breakfast.   There’s no place  setting at Walt’s empty chair -- a glaring absence.  Nearby where mom can keep an eye on her, baby HOLLY lies in  her carrier or somesuch, fidgeting happily.   Skyler ventures  the occasional glance at her teenaged son -- who will   NOT  fucking look at her throughout this entire scene.  Talk about the cold shoulder.   All Walter, Jr. knows is that  his mom kicked his dad out of the house and won’t say why.  Stony, stony silence.   Skyler tries for chipper.  SKYLER  Honey, want another waffle..?  (a beat)  Still got the iron out.   I could  cut up some bananas...  Jesus, homemade waffles, even.   Unfortunately, this does  nothing to thaw Walter, Jr.   Now, their kitchen phone RINGS.  SKYLER’S VOICE  Hi, you’ve reached Walt, Skyler,  Flynn and   Holly !   Please leave us a  message.  WALT’S VOICE  Uh.   Hey.   Hello, everybody!   Good  morning!   I was just... checking  in.   Thought I’d uh, pass along the  current contact information.   I  mean, certainly you can always  reach me on the cell, I’ve always  got that on, but in terms of a  mailing address... I am here at  “The   Beachcomber ,” and you know  what?   It’s actually very nice!  Very pleasant.   Not as high-end as  the Oakwood, but you know, not so  corporate.   So, uh.   Gee, yeah.  That address.   That address is...  BREAKING BAD #301   \"No Mas\"   WHITE   8/3/09   18.",
      "characters": [],
      "action_text": "Throughout this, Skyler remains poker-faced for the sake of  her son -- no obvious displays of displeasure.   Junior rises  to his feet, gathers his crutches and heads for the phone.  SKYLER  Would you please just --  She changes her mind about stopping him.   It doesn’t matter  anyhow.   Ignoring his mom as studiously as she ignores her  husband’s message, the teenager picks up the receiver.  WALTER, JR.  Hey Dad, it’s me.  (listens a beat)  No, I’m   not   okay.   I don’t know  what the hell is going on!   Nobody  tells me jack-shit around here!  SKYLER  Flynn...  Walt, Jr. still won’t look at her.   Strictly into the phone:  WALTER, JR.  Whatever.   I don’t even care  anymore.   Can you just give me a  ride to school?  SKYLER  I’ll take you to school.  WALTER, JR.  (into phone)  Yeah.   No, I’m ready now.  SKYLER  Flynn, I’m taking you to school.  WALTER, JR.  (into phone)  Alright, I’m here.   See you soon.  Bye.  He hangs up.   Having utterly blown off his mom, Junior clunks  into the living room and sits waiting, glowering at the front  door.   You can practically see the black storm cloud of  petulance hovering over his head.  Skyler remains seated at the dining table, struggling to stay  patient.   Off her, frustrated and grieving and not allowed by  circumstance to even explain herself to her son...  BREAKING BAD #301   \"No Mas\"   WHITE   8/3/09   19.",
      "dialogue_count": 0,
      "word_count": 518
    },
    {
      "scene_number": 4,
      "slugline": "INT. THE BEACHCOMBER - WALT’S STUDIO - MORNING 18   18  CLOSE ON SANDWICH FIXINGS.   Peanut butter gets spread on one  slice of bread... strawberry jelly gets spread on the other.  Walt stands here in the tiny kitchenette, making his lunch.  He’s dressed for work.   His cell phone lies nearby.  Jesus.   Is Walt making a sandwich, or is he assembling a  communications satellite?   He works at this thing like it’s  some challenge of the utmost importance to humanity.  Peanut butter and jelly go on just so, in equal proportions.  The two slices are carefully mated.   Off come the crusts,  sliced with a sharp knife.   Only now, there’s trouble -- one  side of the sandwich is a little jagged.   Walt frowns down at  it, fiddling with the loose edge.   He nervously strokes at  his mustache --   what to do?   What to   do ?  Wow.   OCD, anyone?   As Walt stands here, we cut WIDE behind  him, taking in this dreary little furnished apartment.   This  is the kind of place middle-aged bachelors go to die.  BZZZZZZZZZ -- we hear the faint vibration of a CELL PHONE.  Walt turns our way, comes looking for it.   He finds it in the  bottom of a suitcase -- it’s his second, DRUG PHONE, still  sealed in its ZipLock baggie from when he had it hidden in  the toilet tank at home.  BLEEP!   The sound of a TEXT MESSAGE getting left.   Walt peers  at the phone in his hand.   His eyes narrow.  Walt’s POV:   CLOSE ON the cell phone’s tiny screen.   One word  appears -- “POLLOS.”  Uh-oh.   It’s GUS, Walt’s high-volume meth buyer at Los Pollos  Hermanos.   It’s okay if you don’t remember, as we’ll spell it  out later.   In the meantime, just know that getting this call  for a meeting doesn’t sit well with Walt.   He’s in no mood to  think about the life of crime which got him here.  Walt tosses the bagged phone back in its suitcase and returns  to worrying over his sandwich.  INT. HIGH SCHOOL - CHEMISTRY CLASSROOM - MORNING 19   19  The door opens immediately before us, revealing a waiting  class of CHEMISTRY STUDENTS.   We FOLLOW HANDHELD, Michael  Mann-style, just over Walt’s shoulder as he crosses the room  to his desk at the front.   He rounds to face everybody.  BREAKING BAD #301   \"No Mas\"   WHITE   8/3/09   20.",
      "characters": [],
      "action_text": "WALT  Well.   Good morning.   I apologize  for running a bit late, I uh...  Walt trails off as kids start CLAPPING for him.   It begins  with one or two teacher’s pets, but quickly spreads via peer  pressure to the ENTIRE CLASS.   Kids are applauding Walt’s  return to work after lung surgery.  We finally show Walt’s face... and the surprise it contains.  WALT  Uh.   T-Thank you, I...  (forces a smile)  Thank you.   It’s good to be back.  He gives a little “settle down” motion -- he appreciates the  sentiment, but as he’s not feeling much like a hero these  days, it makes him uncomfortable.   He simply wants to get  back to work so that he can bury himself in it.  WALT  Alright, so where’d you leave off  with your substitute?   Esters?   Did  you get as far as esters..?  As he checks some paperwork, the building’s P.A. SYSTEM  crackles to life overhead.   It’s assistant principal CARMEN.  CARMEN’S VOICE  May I have your attention, please?  Good morning, everybody.   As all of  you know... very well... last week,  our city suffered a terrible  tragedy.   One that none of us will  probably ever forget.   And that is  why, this morning, we are going to  take a little time out of our  schedule, and we are going to come  together as a family.   Just to  check how everyone is doing.  Walt glances up through his eyebrows --   say what?  CARMEN’S VOICE  So, teachers, please accompany your  students to the gym -- in a quiet,  orderly fashion, please.   And...  let’s rap.  Students glance to one another, then quietly rise to their  feet and gather their belongings.   Off Walt, dreading this:  BREAKING BAD #301   \"No Mas\"   WHITE   8/3/09   21.",
      "dialogue_count": 0,
      "word_count": 665
    },
    {
      "scene_number": 5,
      "slugline": "INT. HIGH SCHOOL - GYMNASIUM - MORNING - LATER 20   20  CLOSE ON a familiar face -- BARRY, the student from ep. 207.  The one to whom Walt said “Don’t bullshit a bullshitter.”  Here he is, sitting cross-legged on the gym floor, speaking  into a RADIO MIKE.   And yes, he’s at it again.  BARRY  ... I just find it, you know,  really, really hard to...  concentrate .   In the aftermath.  Because of all the horrors, you  know, we... perceived.   They really  get inside your brain, and uh...  (sad shrug)  In college, they have this thing  where if your roommate kills  himself -- like, if you come home  and find him hanging in the closet  or whatever?   It’s basically an  automatic A.   For you.   And I just  think that that level of compassion  is... I just think it’s something  to think about.   So...  Throughout this beautiful plea for understanding, we PULL  BACK from Barry to include the STUDENTS and FACULTY around  him.   This gym is packed to the rafters.   Kids fill the  bleachers, and the rest sit here on the floor like Barry.  Faculty members mostly stand (save for a few “hip” teachers,  who sit on the floor with their kids).   Lots of those present  wear turquoise REMEMBRANCE RIBBONS.   CARMEN does.   You can  bet Barry’s got one, too.  Walt does not.   He stands near Carmen, who moderates this  affair.   Walt’s arms are folded as if he’s hugging himself --  as if he’s trying to squash the discomfort he feels around  “sharing.”  He’s in the minority.   This faculty and these kids (aside  from Barry) take this thing seriously.   These students listen  intently and respectfully.   And why not?   The air disaster  truly has brought all of them together emotionally.  Carmen gets her microphone back from Barry.   Moving on...  CARMEN  Okay.   Thank you, Barry.   Who wants  to go next?   No judgements, guys.  Just say anything and everything  that’s on your mind.  BREAKING BAD #301   \"No Mas\"   WHITE   8/3/09   22.",
      "characters": [],
      "action_text": "A few hands go up.   Carmen smiles supportively as she hands  her mike to the nearest -- a SAD-FACED GIRL.  CARMEN  Here you go, Honey.  SAD-FACED GIRL  (into microphone)  I-I... I just keep asking myself,  “Why did this happen?”   I mean...  if there’s a God and all, why does  He allow all those innocent people  to die for no reason?  Seated on the lower bleachers, WALTER, JR. pipes up angrily.  WALTER, JR.  Who said anything about God?   It  was some stupid air traffic  controller! --  SHOUTS of agreement go up -- righteous anger directed at  Donald Margolis.   “Sue him!”   “Lock his ass up!”   Stuff like  that.   CLOSE ON Walt, whose silent discomfort increases.  WALTER, JR.  Yeah, put him in jail!   What’s   God  gotta do with it? --  CARMEN  L-Let’s, let’s keep things secular,  if we could.   Stick with feelings.  SAD-FACED GIRL  Whatever.   Anyhow, I haven’t really  been sleeping much.   Does anybody  else have that..?  (murmurs of agreement)  I-I just keep hearing that... that  sound.   That   boom .   I was close  enough to hear it, like five or six  blocks away.   It just plays over  and over in my head, like it won’t  ever stop.  Her girlfriend beside her gives her a big, supportive hug.  Throughout this crowd, sniffles and downcast faces.   A few  girls shed tears.   A few boys look like they want to.  Walt, too, is affected -- but in a somewhat different way.  Unbeknownst to everyone here, there’s a   guilt   component to  Walt’s suffering.   And if he were to shoulder it completely,  it would probably kill him outright.  BREAKING BAD #301   \"No Mas\"   WHITE   8/3/09   23. Therefore, he’s got to fight it off.   He’s gotta breathe deep  and go to his own private Idaho... and count the minutes  until this goddamned, emo-porn assembly is over.  Carmen hands her microphone to a WIDE-EYED BOY.  WIDE-EYED BOY  Um.   My neighbor?   He heard the  crash and he came outside, and he  found, like, this   seat ?   Like, this  airline seat?   Like you have on a  airli",
      "dialogue_count": 0,
      "word_count": 1134
    },
    {
      "scene_number": 6,
      "slugline": "EXT. MEXICAN SHACK - DAY 21   21  Sun beats at the dust.   We’re looking at a squat, tumbledown  hut built of adobe.   Maybe we’re on the edge of that village  from the Teaser.   Maybe not (as per schedule).   Regardless,  this is where live the poorest of the poor.  MOTHER sits in the deep shadow of the doorway, shucking corn.  FATHER and teenaged SON hunker under the open hood of an  ancient pickup truck.   If they can get this rusty piece of  crap running, it’ll be a miracle.  The nine year-old DAUGHTER yanks stray tufts of grass and  sits feeding them to a skinny GOAT tied to a post.   Silence.  It’s too hot to talk, and these folks have nothing to say to  each other anyway.  Patting her goat, the daughter is the first to notice the  CLOUD of DUST coming their way from up the road.   She slowly  rises to her feet, stands watching as...  ... A familiar MERCEDES purrs to a stop in front of the  shack.   Now the whole family turns to look.   Father and  mother stare, nervous, not blinking.  Here come the scary COUSINS, climbing out of their coupe.  Taking their time.   Oh god, are they gonna murder this entire  family?  No, wait... they walk past everyone.   Without a word, without  a glance, they head for... a sagging CLOTHESLINE in the yard.  Off come their Canali suits.   Not shy at all, these two strip  down in the middle of the yard.   Shiny PISTOLS in oxblood  shoulder holsters get revealed.   The Cousins hang them on  whatever’s convenient.   Their fine clothes get dropped in the  dirt as this bewildered family stands watching.  Now that they’re down to silk boxer-briefs and wife-beaters  of the finest Egyptian cotton, the two Cousins take their  pick of the ragged CLOTHES which hang on the line.  The teenager is about to complain -- but his father knows  better.   With a curt shake of his head, he shuts up his son  just as the boy opens his mouth.  Soon, the two Cousins are dressed just like this family --  dirt-poor and INCONSPICUOUS.   The only thing that stands out  about them are their SKULL-TOED COWBOY BOOTS.   Yeah, they’re  keeping those babies.   Plus the guns, of course.  BREAKING BAD #301   \"No Mas\"   WHITE   8/3/09   26.",
      "characters": [],
      "action_text": "Leaving their suits on the ground where they dropped them,  the Cousins head back the way they came...  ... Pausing when they get to the nine year-old daughter.  They stop before her and her goat.   Too curious and innocent  to be scared, she just stares up at them.  In b.g., her parents fidget, seeing this -- but they don’t  dare come closer.  One Cousin glances to the other, then down at the girl.   It’s  like that moment in the 1930 “Frankenstein” -- is the Monster  going to play with the fraulein, or drown her in the lake?  Neither, it turns out.   Instead, he bends down and hangs  something on one of her goat’s HORNS.  It’s the fancy key to the MERCEDES.   He gives it a twirl and  walks off, leaving it spinning.   CLOSE ANGLE PAST this KEY,  left dangling here in f.g. as the Cousins leave it behind.  The family slowly gathers, watching the Cousins depart in  their “new” clothes.   These two scary, silent men have  apparently left their expensive car in trade -- or maybe they  just don’t need it anymore.   Without so much as a look back,  they walk off on foot, headed for parts unknown.  Off these strange events...  END ACT TWO  BREAKING BAD #301   \"No Mas\"   WHITE   8/3/09   27. ACT THREE  EXT. WHITE HOUSE - AFTERNOON 22   22  Skyler’s Grand Wagoneer is in the driveway.   Marie’s blue VW  Beetle is beside it, parked where Walt’s car used to belong.  The Aztek motors into frame, pulling to a stop behind these  two vehicles.   It sits there, idling.  INT. WALT’S AZTEK - AFTERNOON - CONTINUOUS 23   23  Walt stares at the house through his spiderwebbed windshield.  Walter, Jr. remains where he is, his backpack in his lap.  Instead of getting out, he studies his old man with concern.  Finally, feeling eyes on him, Walt turns to his son.  WALT  How’s your Aunt Marie doing?  WALTER, JR.  (a beat)  Fine.   I guess.  WALT  You say hello to her for me, would  you?  Junior keeps watching his dad.   Walt is subdued, yet tries to  be chipper.   The effect is inadvertently s",
      "dialogue_count": 0,
      "word_count": 836
    },
    {
      "scene_number": 7,
      "slugline": "INT. WHITE HOUSE - LIVING ROOM - AFTERNOON - CONTINUOUS 24   24  We peek out between the CURTAINS, out the front window at  Walt’s Aztek as it backs out of the driveway and motors off  down the street.   We reveal MARIE watching Walt go   (is there  a way we can shoot this bit on location, then continue with  the scene on our soundstage set?)  Marie turns to Skyler, who sits across the way on the sofa.  MARIE  He’s gone.  Skyler nods, a bit less tense now.   As the front door  unlatches, Marie quickly steps away from the window, makes  like she wasn’t spying.   Walter, Jr. enters, his mood dark.  MARIE  Hey, Flynn!   How’s tricks?  WALTER, JR.  How’s   what ?  MARIE  Tricks.   It’s an expression.   How  are you?  Not up for small talk, the teenager turns on his mom.  WALTER, JR.  Why you gotta treat him like this?  SKYLER  (quiet, yet patient)  Well, hello to you, too.  WALTER, JR.  I’m asking you a question!   W-Why  you gotta be like this?!   Why can’t  you just TALK, even?!  MARIE  Flynn .   Hey.  Marie points a warning finger at her nephew.   Ah, fuck this!  That’s what the kid is thinking as he blows off both of them  and powers away on his crutches to his bedroom.  Skyler sighs, just sits here.   Marie glances at her and  considers, then joins her on the sofa.   Silence for a moment.  BREAKING BAD #301   \"No Mas\"   WHITE   8/3/09   29.",
      "characters": [],
      "action_text": "SLAM!   There goes Junior’s bedroom DOOR, closed and locked.  Once Marie is sure she and her sister have privacy...  MARIE  Wow.   Out of the mouths of babes,  huh? (as Sky starts to stew)  Try not to hold it against him.  Poor kid’s probably dying of  curiosity.   I guess it’s only  natural for him to be wondering,  you know.   Wondering... what could  have possibly gone so   wrong   that...  SKYLER  (overlapping her)  Marie...   Marie.  Marie finally throws up her hands.  MARIE  Well, I’m sorry!   How am I supposed  to help you get over this if you  won’t even tell me what Walt DID?  SKYLER  I don’t remember asking you,  alright?   You wanna be supportive?  Be supportive without all this  prying , for god’s sake.  MARIE  “ Prying .”   Oh, that’s very --  (turns on a dime)  Did he cheat on you?   He cheated on  you, didn’t he?  Skyler abruptly rises and exits frame, headed for the kitchen  or somesuch.   Marie remains behind, calls after her.  MARIE  He must have!   Why not just say  it?! --  Off Marie, left stewing now:  EXT. GREAT OUTDOORS - NIGHT 25   25  SPARKS.   Brilliant red and orange.   Hundreds of them.   They  rise through frame leaving crooked, whizzing trails across  the night sky.   We TILT DOWN and find their source...  BREAKING BAD #301   \"No Mas\"   WHITE   8/3/09   30. ... A crackling BONFIRE.   We sense people sitting around it  in the darkness.   We get flickering glimpses   (This is a scene  that can shoot pretty much anywhere, even in the grasslands  surrounding Q Studios.   Our schedule will determine) .  GROUP LEADER (O.S.)  It’s that voice inside your head.  Man, it’s that sneaky, rat-bastard,  twenty-four-seven   voice .  We FIND the LEADER of this rehab group.   He’s the same guy we  heard leading the discussion during the previous scene at the  Onion.   Perhaps we never showed his face that time around.  Perhaps we’re seeing it for the first time now.  He’s a middle-aged guy.   Probably younger than he looks.  This is a dude who has clear",
      "dialogue_count": 0,
      "word_count": 5125
    }
  ]
}