{
  "slug": "breaking-bad-305-mas-2010",
  "title": "breaking bad 305 mas",
  "genre": "drama",
  "format": "series",
  "scenes_count": 4,
  "characters_count": 2,
  "characters": [
    "WALT",
    "JANICE"
  ],
  "total_words": 10860,
  "total_dialogue": 2,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. STRIP CLUB - PARKING LOT - DAY  Early morning, dawn.   Just a few cars, including Jesse’s low  rider.   ( One of the cars will be some lame banger-mobile that  belongs to Combo. )   A BOUNCER opens the door, holds it for  our boys as they stumble out.   It shuts behind them.  JESSE  Thank you.   Yo!   Thank you.  SKINNY PETE  That was --  He turns away, PUKES.   It’s quick -- one hurl -- we don’t see  it, just HEAR it.   A second later he stands, wipes his mouth.  SKINNY PETE  (like nothing happened)  -- awesome, bro.   Later.  No one cares or even really registers the vomit.   That’s just  what happens.   They fist bump, then Skinny Pete weaves away.  A thought dawns on Jesse now.   He reaches in his pocket,  pulls out his remaining CASH and counts it.   He sobers up  fast as reality suddenly hits him.  JESSE  Oh god.   Oh, man.   Oh, I’m so dead.  (off Combo’s look)  I only got... ah, damn... I only  got, like, 1400.  COMBO  (great news)  Waffle House, yeah!  JESSE  No, man.  (confesses)  I was supposed to use that dude’s  money to buy an RV.  COMBO  Whaddya want with a RV for?  JESSE  ‘Cause like...   It’s like...  (why bother?)  Never mind.   Jesus!   Maybe now I  gotta, like, leave town or change  my identity or something.   Guy’s  blackmailing   me.   He’s got, like a  criminal mind, yo.  BREAKING BAD #305   \"Mas\"   SCRIPT AS BROADCAST   5.  (CONTINUED)",
      "characters": [
        "WALT"
      ],
      "action_text": "Gloomy silence.   Then a sly look crosses Combo’s face.  COMBO  RV, huh?  (off Jesse’s look)  I can hook you up, bro.   I can  totally get you a RV.  JESSE  No, I need it today.   Now .  COMBO  No problem.   Let’s go.  JESSE  (dubious)  You’re telling me you can get me an  RV.   For 1400.   At six in the  morning.  Off Combo’s confident nod:  EXT. MODEST HOUSE - DAY  Dawn light.   We’re looking at an RV.   OUR RV .   A hero shot.  It’s parked in the driveway of a low income home.   No  criminal vibe about this place.   One would guess that hard  working folk live here -- juggling two jobs and kids and  Sundays are for family -- no time for flowers in the yard.  Jesse, cold and bleary-eyed, walks the length of the RV,  finishes checking it out ( no bullet holes in the door yet ).  Seems old but okay.   It’ll do.   Especially now that echoes of  the last few hours are banging on his brain like a burly  landlord demanding late rent.  He stops near the door of the house.   On the wall next to the  door hangs a terra cotta SUN ORNAMENT.   Seems to be leering  at him in the half light.   Creeps him out.  Combo, slightly breathless, hustles out the door, hands Jesse  the KEY.  JESSE  Right on.   So do I need to sign  something or something?  COMBO  Nah.   It’s like, a no paperwork-  type deal.  Jesse frowns, suspicious.   Still... he hands Combo the MONEY.  BREAKING BAD #305   \"Mas\"   SCRIPT AS BROADCAST   6.  CONTINUED:  (CONTINUED) COMBO  Pleasure doing business with you.  Suddenly, LIGHTS flick on inside the house.   Combo tenses.  COMBO  Come on, we gotta bounce.  (off Jesse’s hesitation)  For REAL, yo!   Get it out of here!  Combo bolts down the driveway and hops into his CRAPPY CAR.  Jesse doesn’t argue -- this whole daybreak deal is definitely  wack.   He hurriedly FUMBLES with the lock on the RV’s door,  looks around nervously, finally opens it.  EXT. MODEST HOUSE/RV - MOMENTS LATER  The RV’s engine CRANKS.   It LURCHES, then BACKS DOWN down the  driveway heading s",
      "dialogue_count": 1,
      "word_count": 2196
    },
    {
      "scene_number": 2,
      "slugline": "INT. RV - NIGHT - CONTINUOUS  Hank’s POV:   looking straight down into the living area of  the RV, what we DON’T see is a meth lab.   Far from it.   Just  typical mid-eighties Bounder accoutrements, with set dressing  that’s folksy and cozy.   We ADJUST to REVEAL...  ... A very large, fifty-something WOMAN sitting in her  UNDERWEAR.   She’s playing Canasta with her still-older  HUSBAND, also in his underwear.   Maybe there’s even a little  DOG or TWO underfoot (or not -- director’s choice).  Ma and Pa Kettle as nudists.   While not in any way illegal...  it’s definitely not a sight meant for public view.   And  Hank’s reaction to it is an exquisite blend of disappointment  and revulsion.   Ohhhhh, fuck.  Time to cut his losses and creep ignominiously back into the  night.   Only now, as Hank tries to do just that, the metal  roof lets out a CRUNK as he shifts his weight.  The dog or dogs, if we have them, start to YAP-YAP-YAP-YAP.  Ma Kettle looks up.   Seeing Hank, her eyes snap wide and --  MA KETTLE  AAAAAAAHHH! --  Pa Kettle bolts upright, sees what Ma is screaming about.  Oh, crap .   Freaked Hank holds up his hands --   it’s cool, it’s  cool, it’s cool!  As seen from Gomez’s windshield POV, the RV door flings open  and Pa comes out in his boxers with some sort of half-assed  makeshift weapon in hand -- and there’s Hank crouching on the  roof above him, trying desperately to calm things down.  GOMEZ  No, no, no, no...  PA KETTLE  What the hell are you doing up  there?   You some kind of sick  pervert?  GOMEZ  Ahhh, shit --  Gomez jumps out of the truck and runs to Hank’s aid.   Off the  interior of the now-empty Jeep, its door left open and wobble-  wobbling as we hear distant YELLING from o.s...  BREAKING BAD #305   \"Mas\"   SCRIPT AS BROADCAST   14.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 311
    },
    {
      "scene_number": 3,
      "slugline": "EXT. RUSTIC CAMPGROUND - DAWN  Later.   The sun is now up, or thereabouts.   We TILT DOWN from  the lightening sky to find a small crowd of LOOKY-LOOS --  fellow RV owners and campers who have been drawn by the  previous scene’s excitement.   Their attention is on Hank, who  is talking to Ma and Pa Kettle (now dressed in bathrobes or  such).   We’re wide and distant on this scene.   From here, we  can’t hear what charming Hank is saying, but we can figure it  boils down to “please don’t sue me.”  In f.g., Gomez leans against Hank’s truck, arms and legs  crossed.   Shakes his head to himself.   Christ, what a night .  Finishing up, Hank shakes the old man’s hand and give his  shoulder a friendly pat.   He walks back to Gomez.  HANK  Go back to your trailers...  everything’s okay.  (to Gomez)  Guy’s VFW.   He’s cool.  Gomez says nothing.   Masking his shame and desperation with  humor and camaraderie, Hank refers to his NOTE PAD.  Gomez maintains his stoney silence.   His partner is more and  more baffling and unreliable.   And something else weighs  heavy on his mind.  HANK  Alright.   I’ll tell you what, we’re  gonna check out a couple more, then  call it a morning.   Okay, whaddaya  say?  GOMEZ  Can’t.   I gotta get home.  HANK  What?   You leave your balls in your  wife’s purse, or what?  Gomez finally says what he’s been avoiding saying all night.  GOMEZ  Gotta pack.  This is the first Hank’s hearing of this.  HANK  ... Where you headed?  BREAKING BAD #305   \"Mas\"   SCRIPT AS BROADCAST   15.  (CONTINUED)",
      "characters": [
        "JANICE"
      ],
      "action_text": "Gomez, feeling like a heel, knowing the crushing blow one  word will inflict on his partner, finally answers:  GOMEZ  Texas.  Off Hank, blind-sided, and trying to cover:  INT. SCHRADER HOUSE - KITCHEN - DAY  Early morning.   LIGHT JAZZ plays.   SIX SWEETENER PACKETS lie  in a neat row on the kitchen counter.  MARIE, dressed for work, prepares her early morning O.C.D.  coffee in her familiar to-go MUG.   As she rips and taps, she  HEARS Hank enter the house, front door closing with a   SLAM .  MARIE  Hey there!  As she finishes up preparing her coffee, she HEARS him WALK  RIGHT ON BY.   As his footsteps fade...  MARIE  (frowns)  Hank?  (beat)  Hank?  Off Marie, her instincts telling her something’s wrong.  INT. SCHRADER HOUSE - MASTER BATHROOM - DAY  Hank closes the door.   Closes his eyes.   His situation, his  decisions, his future all weigh heavily on him.   Wearily, he  undresses, longing for the solace the shower will bring.  Knock-knock .   Marie’s outside the door.  MARIE (O.S.)  Can I come in?  Before beleaguered Hank can say no... Marie enters.  Christ.   Hank was really hoping for a few minutes alone.  HANK  (forces a smile)  Hey, baby.  BREAKING BAD #305   \"Mas\"   SCRIPT AS BROADCAST   16.  CONTINUED:  (CONTINUED) Hank busies himself -- turns on the shower, adjusts it --  with any luck this chat’ll be short and sweet.   Marie makes  casual conversation, trying to gage him.  MARIE  Hey.   How’d it go last night?  HANK  Good.  MARIE  Catch the bad guys?  HANK  Nope.  MARIE  Want me to make you some breakfast?  HANK  Nah.  He sheds his t-shirt, climbs in the shower.  HANK  I’m gonna head back out after this.  MARIE  (concerned)  Now?   You worked all night.   Get  some sleep, Hank.   Those RV’s  aren’t going anywhere.  HANK  They’re recreational   vehicles ,  Marie, that’s what they do.  MARIE  You know what I mean.  Hank lets the water pound down on him.   Wills her to leave.  Marie, however, has an agenda.   It makes her nervous, but...  MARIE  I spoke with",
      "dialogue_count": 1,
      "word_count": 6467
    },
    {
      "scene_number": 4,
      "slugline": "INT. SAUL GOODMAN'S OFFICE - DAY  Saul and Jesse sit, waiting.   Judging from the look of  things, they’ve been here awhile.   Jesse’s knee bounces.   His  patience wears thin.   With each passing second Jesse grows  more aggravated.  Jesse sighs.   Rises to his feet, ready to leave.  SAUL  Howsabout we run through this thing  one more time.   Especially the part  where I do all the talking and you  don’t say jack.  JESSE  Oh, I’m gonna say jack.   I’m gonna  say plenty.  SAUL  Wha-what did we say about  escalating?   Huh?   Who’s got your  back here?   Me.   Alright.   I’m  gonna take care of things.  But Jesse’s chewing a thumbnail -- not really listening.  SAUL  Hey, what’re the parameters of this  sobriety thing you got going?  JESSE  What do you mean?  SAUL  Can you take a Xanax?   Cause, I got  a drawer full of ‘em.   I, uh, I get  ‘em from my --  (finger quotes)  -- “Chiropractor.”   Vietnamese.  Five foot tall.   She adjusts you to  “completion.”   Her name’s Kim Nu  Suong.   As delicious as it sounds.  I should give you her card.  JESSE  (not even listening)  To hell with this.   I’m outta here.  Saul’s intercom   BUZZES .   He picks up.   Shoots Jesse an   aren’t  I always right?   look.   Jesse pauses.  INTERCOM VOICE  He’s here.  BREAKING BAD #305   \"Mas\"   SCRIPT AS BROADCAST   42.  (CONTINUED)",
      "characters": [],
      "action_text": "SAUL  Send him in.  Walt enters.   The two ex-partners face each other across the  room.   Jesse’s tense, ready for a fight.   Walt is...  inscrutable. Saul hustles over and adroitly steers Walt,  treating him as if their middle-aged fight never happened.  SAUL  Hello, Walt.   Good to see you.  Please, uh... have a seat.   Here.  (to Jesse)  Mr. Pinkman, if you will?  They each take a seat.   Saul settles into a chair, ready to  mediate.   Jesse scowls at Walt, who seems impervious.  JESSE  You’re late.  SAUL  Gentlemen.   If we could come to  some accommodation here, now.  There’s always a way to oil  everyone’s lock.  (to Walt)  This young man is prepared to offer  you a sweetheart of a deal for  doing precisely   nothing .  WALT  Really.  SAUL  Ten percent of all future profits  from his solo venture.   That’s  money you get paid for simply  walking down to the mailbox! --  (off Walt’s silence)  Consider it a gesture of respect  for your valuable contribution to  the business thus far.   I’m sure  you’ll agree that’s fair.  JESSE  That’s   charity , is what that is.   I  do all the work, he sits around on  his fat ass judging people --  Walt blinks at Jesse’s line, but otherwise sits impassively.  SAUL  Hey-hey.   Escalating.   Stop .  (back to Walt)  BREAKING BAD #305   \"Mas\"   SCRIPT AS BROADCAST   43.  CONTINUED:  (MORE)   (CONTINUED) So there’s that.   Then there’s one  small detail:   clearly a mistake  was made on the part of our mutual  associate when he paid you half of  Jesse’s earnings.   He must not have  realized that you two had come to a  parting of the ways.  Before Saul can say any more, Walt pulls the POLLOS BAG from  inside his jacket.   Places it on the coffee table.  WALT  Take it.   It belongs to you.  JESSE  You’re damn right it belongs to me.  Jesse grabs it up and quickly counts it, double-checking that  Walt hasn’t shorted him.   Saul is pleased.  SAUL  I knew I could count on you boys to  play nice.   That’s -- that almost  brings a tear",
      "dialogue_count": 0,
      "word_count": 1886
    }
  ]
}