{
  "slug": "breaking-bad-312-half-measures-2010",
  "title": "breaking bad 312 half measures",
  "genre": "thriller",
  "format": "series",
  "scenes_count": 3,
  "characters_count": 2,
  "characters": [
    "GUS",
    "JESSE"
  ],
  "total_words": 10156,
  "total_dialogue": 2,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. BAR - NIGHT  CLOSE ON a glass of Coke.   Teetotaling Jesse (remember, he’s  in recovery) is not drinking alcohol.   He’s not even drinking  his soda, come to mention it.   His mind is elsewhere.  Walt sits before him, a beer mug in hand.   The two of them  sit in a booth or somesuch -- some spot in this half-full  place which affords them privacy.  Walt senses the kid has something big on his mind, and he’s  curious to hear it.   He’s patient, too, until finally...  WALT  What?  Glancing up at him, Jesse reaches in his pocket and pulls  something out.   He tosses it atop the scarred table between  them.   Walt frowns, recognizing it.  Walt’s CLOSE POV -- it’s a TEENTH baggie of BLUE METH.  Walt’s hand slaps down atop it, obscuring it from sight.   He  shoots a quick yet subtle glance around the place --   did  anyone see that?   Relieved no one did:  WALT  What the hell are you doing? --  JESSE  That’s ours, right?  (points)  Look at it and tell me if that’s  ours.  What the fuck?!   Walt takes the briefest glance at the teenth  under his palm, then shoves it back at Jesse.  WALT  Yes , it’s ours.   Now put it away.  What the hell is wrong with you?  (Jesse tucks it away)  Where did you get that?   Did you  take it from the lab?!  JESSE  I bought it from the two guys who  killed Combo.  Walt settles down.   Returns to being confused.   Staring  intently, Jesse quietly spells it out for him.  BREAKING BAD #312   \"Half Measures\"   AS BROADCAST   13.  (CONTINUED)",
      "characters": [],
      "action_text": "JESSE  They had Combo shot down in the  street, and now it’s   our   product  they’re selling.   Which means they  work for our guy.   Right?  Already not liking where this is headed, Walt tries to keep  things reasonable.   Even-keeled.  WALT  Wh-what is that?   That’s hearsay.  Do you have any proof?  JESSE  I heard it from the sister of the  kid who shot him.  (then)  You hear how I just said “kid?”  This   kid   -- he’s eleven years old.  Shot Combo on orders.   These two...  scumbags .   They got him dealing,  they got him...  Jesse trails off, not wanting to say it again -- as the whole  thing makes him emotional, and he’s trying hard to stay calm.  JESSE  You know he’s not the first.   They  use kids ‘cause hey, why not?   Easy  to control.   Easy to fool.   All  they get is juvie if they ever get  caught.   Hearts and minds, right?  Get ‘em young and they’re yours  forever.  (off Walt’s silence)  These guys killed Combo.   They used  this little kid like some puppet.  They used him to shoot my friend.  Jesse sighs raggedly and lapses into silence.   He stares at  the tabletop between them.   A wary beat.  WALT  So why are you telling me this?  Jesse eyes Walt evenly.   He’s back in control of himself.  JESSE  I need your help.  WALT  (not wanting to know)  ... How?  BREAKING BAD #312   \"Half Measures\"   AS BROADCAST   14.  CONTINUED:  (CONTINUED) JESSE  I need ricin.  WALT  Oh my God.   Uh... God.  Walt silently shakes his head --   absolutely, positively not .  JESSE  These two...  WALT  No.  JESSE  Hey, they gotta go, alright?   I got  the entire thing figured out.  WALT  No.  JESSE  The delivery method, everything.  All I need from you is the poison,  that’s all.  WALT  No.  JESSE  Look.   Otherwise, you don’t haveta,  you don’t gotta lift a finger.  WALT  No.   Listen, you don’t even know  what you’re talking about.   Not  even --  JESSE  -- You don’t get how   right   this is?  You don’t get how the whole entire  world   would be better off?  WALT  I kn",
      "dialogue_count": 0,
      "word_count": 2448
    },
    {
      "scene_number": 2,
      "slugline": "INT. CRYSTAL PALACE - WENDY’S ROOM - NIGHT  CLOSE ON:   a HAND holding a bag of BLUE METH.   Shake, shake.  rustle, rustle -- its a lot of gack.   Half pound.   Maybe  more.  NEW ANGLE shows:   it’s Jesse’s hand.   He’s pulled a chair up  to the bed where Wendy sits cross-legged, alternately deep-  hitting on a cigarette and gnawing at her nails.  JESSE  (low, intense)  You understand what you have to do?  Wendy’s looking away, she’s   actively not looking   at Jesse and  all that dope.... calling out her name...  JESSE  And you can never talk to anyone,  right?   I mean   ever , understand?  WENDY  (quiet)  Yeah.  JESSE  I found this stuff on the internet.  Takes days to kick in.   Just keep  quiet and this won’t ever come back  to you.  (off her silence)  You’re okay with this, right?  Wendy shrugs -- she’s obviously   not   okay.  JESSE  (steadying)  Just think of it like it’s the same  thing as always; you’re just  delivering some hamburgers.  WENDY  It’s not just delivering  hamburgers.  Ah, the refreshing moral clarity of a meth whore.   But Jesse  doesn’t relent.   He continues to gently   push .  JESSE  Hey.   You got a kid, right?   What’s  his name?  WENDY  Patrick.  BREAKING BAD #312   \"Half Measures\"   AS BROADCAST   25.  (CONTINUED)",
      "characters": [
        "GUS",
        "JESSE"
      ],
      "action_text": "JESSE  Alright, imagine these two guys had  Patrick working as a mule.   Making  him kill people.   Wouldn’t you do  anything to protect your kid?  WENDY  ‘Course I would.   I do all kinds of  things for him.  JESSE  Okay so, these guys using kids like  that?   They gotta go.   Right?  Wendy gives a barely perceptible nod.  JESSE  Good.  He stands and drops the bag of meth on the TABLE --   thunk.  JESSE  Tomorrow.   I’ll be in touch.  Jesse leaves.   Wendy continues to just sit there, not looking  at the dope... not looking at the dope... not looking...  Outside we hear:   TRUCK BRAKES.   An eerie groan.   Like a  whale call.  Off Wendy:   who turns and finally looks.  INT. WHITE HOUSE - LIVING ROOM - NIGHT  CLOSE ON:   BABY HOLLY.   Sucking greedily on a PACIFIER.  Walt’s with her.   He got his key from Skyler after their  negotiations, and is now taking over some of the child care  duties.   He has Holly on a blanket on the living room floor,  where she lies on her back.  WALT  (to Holly)  Yeah... I’ll bet that tastes good.  There’s a KNOCK on the door, interrupting this bonding time.  WALT  (to Holly)  Hey... come here, baby.   Okay...  here we go.   Here we go...  Walt rises and walks to the door, checking who it is through  the window...   What the--?   He opens to reveal...  BREAKING BAD #312   \"Half Measures\"   AS BROADCAST   26.  CONTINUED:  (CONTINUED) MIKE.   Saul’s “P.I.”  WALT  (agitated)  What are you doing?   If you need to  talk, use the phone.  MIKE  (coolly insisting)  This isn’t a phone talk, Walter.  Your wife’s out, right?  Walt hesitates.   He’s not crazy about letting this guy inside  his home, but this sounds serious.   Walt stands aside,  closing the door quickly after Mike enters.  MIKE  (smiling, re: Holly)  Aw, isn’t she somethin’.   I got a  granddaughter a few years older.  Uneasy about these two worlds of his colliding, Walt picks  her up and loads her into the bassinet.  WALT  (’get on with it’)  What can I do for you?  Mike sits on t",
      "dialogue_count": 2,
      "word_count": 6959
    },
    {
      "scene_number": 3,
      "slugline": "EXT. STREETCORNER - NIGHT - CONTINUOUS  In the lowrider, one of the Bulletheads counts money.   The  other one taps him on the shoulder.   What’s that?  Bullethead POV: a silhouetted figure approaches without  varying his pace.   As he crosses through a pool of yellow  light, Jesse’s face is visible.   He’s not sneaking up on  these skells, he going to face off with them man-to-man.  ANGLE LOW behind Jesse.   As he passes us, the STEEL AUTOMATIC  glints in his hand.   He holds it behind his back, flattened  against his thigh.   It’s out of the Bulletheads’ sight -- for  the moment.  ANGLE LOW on the Monte Carlo.   The doors swing open and the  Bulletheads step out.  The Bulletheads exchange a glance and then begin slowly  walking together towards Jesse.   They keep their hands in  their pockets.  If we haven’t noticed before, now we see one of the  Bulletheads is wearing a pair of OAKLEY SUNGLASSES around his  neck on a lanyard (this will play in the next episode).  ANGLE LOW on Jesse’s feet walking in measured steps over  cracked asphalt.  CLOSE ON Jesse’s 9mm.   TRACKING with the gun as it moves  steadily forward.   Streetlights glimmer in the steel.  HIGH AND WIDE.   The figures slowly converge.   Their long,  ruler-straight shadows slant across the desolate street.  Jesse’s only about a half block from the Bulletheads.  ANGLE ON Jesse; he’s breathing like he’s climbing a mountain.  This is   it .  Jesse allows his 9mm to come into view.  The Bulletheads pull their own AUTOMATICS.  Jesse raises his gun and --  SCRREEEEEEEEH!   Tires squeal nearby.   The Bulletheads turn  just a moment too late and --  RRRRRRROOOOOOOOOAAR!  HOLY SHIT!   A vehicle SCREAMS out of nowhere, PLOUGHING into  the drug dealers!   A gut-turning CRUNCH of metal on flesh.  BREAKING BAD #312   \"Half Measures\"   AS BROADCAST   54.  (CONTINUED)",
      "characters": [],
      "action_text": "The Bullethead with the Oakleys slides UNDER THE TIRES.   The  vehicle actually rises slightly as it CRUSHES his sternum.  The other guy FLIPS over the vehicle’s hood and goes FLYING.  He hits the concrete face-first and lies there, limp.  Jesse is frozen in place.   The vehicle is...   WALT’S AZTEK .  Walt gets out of the Aztek and quickly scans the area for  witnesses.   As far as he can tell, there’s no one out there.  We didn’t see him but during Jesse’s confrontation with the  Bulletheads, Walt was parked nearby, watching from the  darkness.   Getting involved wasn’t a calculated move -- if  he’d had time to think about it maybe he wouldn’t have done  it at all.  But when he saw Jesse walking into a gun fight, Walt’s  instincts took over.  Walt glances back -- the guy under the Aztek’s wheels is  twisted at a weird angle.   Blood pools around him.  Definitely dead.   But...   SCRAPE-SCRAPE .   What’s this?  The second Bullethead is MOVING.   His automatic landed about  ten feet away from him and he’s painfully inching his way  over to it.   The danger’s not immediate; at this rate he’ll  be there sometime after the next Summer Olympics.  Walt goes over to the automatic and picks it up.  With tremendous effort, the wounded Bullethead heaves himself  over onto his back.   His face is a mess; landing on the  concrete was like rubbing sandpaper on Jell-o.  Walt stares down at him.   He knows what he has to do.  Without taking his eyes off Walt, the Bullethead pulls  himself halfway up to a sitting position.   The drug dealer’s  mouth is moving, he’s struggling to say something.   Maybe  he’s trying to threaten, maybe plead for mercy.   No way to  tell, all he can make are saliva bubbles.  Jesse hasn’t budged since Walt arrived.   He’s watching, wide-  eyed.   His automatic dangles at his side, forgotten.  No half measures .   Walt grasps the Bullethead’s automatic and  stands over the drug dealer.   Is he really going to do this?  The Bullethead stares straight at ",
      "dialogue_count": 0,
      "word_count": 749
    }
  ]
}