{
  "slug": "breaking-bad-309-kafkaesque-2010",
  "title": "breaking bad 309 kafkaesque",
  "genre": "drama",
  "format": "series",
  "scenes_count": 3,
  "characters_count": 3,
  "characters": [
    "HANK",
    "SKINNY PETE",
    "WALT"
  ],
  "total_words": 11975,
  "total_dialogue": 3,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. FACTORY FARM - WAREHOUSE - DAY  ... Victor pushes the handtruck into the WAREHOUSE at the  chicken-processing facility we first saw in Episode 303.  Inside, EIGHT OR TEN WORKERS, all dressed in similar Tyvek  suits, stand and work at various stations in a kind of  assembly line.   We follow the Rubbermaid of meth from station  to station, glimpsing brief images of Gus' workers as they:  -- divide the meth into smaller portions and carefully pack  it into plastic baggies.  -- submerge the bags of meth into large plastic jugs of THICK  FRY BATTER.   The workers then mark the jugs by scratching the  lids with jackknives (the marks are tiny, you wouldn’t notice  them if you weren’t looking).  -- intersperse the marked jugs containing meth among many  other identical jugs (not containing meth), all of them lined  up on shelves and ready for loading.   The shelves are labeled  by destination: Amarillo, Dallas, Las Vegas, Phoenix, etc.  -- then wheel loads of the jugs on handtrucks outside, to...  EXT. FACTORY FARM - LOADING DOCKS - DAY  The loading area.   The workers wheel the jugs onto a loading  dock and into a Los Pollos Hermanos REFRIGERATED TRUCK.  We pull back WIDE to reveal not just this one truck, but  two..? four..? six..?   many   Pollos Hermanos trucks.   This is  one   major   operation.   And a well-oiled machine.  The workers finish packing and shut the tailgates.   The  trucks trundle away, exiting the factory farm in a long line  like elephants on parade.   And watching them go...  ... We reveal GUS, the man who makes it all happen.   He  stands on his loading dock, impassively watching.  Out on the main road, our trucks split and fork off -- headed  in every conceivable direction.   America, here we come.  END TEASER  BREAKING BAD #309   \"Kafkaesque\"   AS BROADCAST   3.",
      "characters": [
        "HANK"
      ],
      "action_text": "ACT ONE  INT. SUPERLAB - AFTERNOON  CLOSE ON a digital SCALE READOUT.   “160.2” it says in bright  blue letters, which then go dark.   Now, as a full Rubbermaid  gets loaded aboard its empty scaletop...  ... Up comes a new and updated readout:   “201.6.”  Reveal Jesse, dressed in Tyvek.   Yet another cook is finished  (not the same one depicted in the Teaser).   Like all that  occurs in Walt’s lab, the weighing of the yield is an  exacting procedure.  Jesse’s job, which we are witnessing, is the task of working  the scale and calling out the measurement.   (The scale has a  memory and automatically adds up the five containers of meth  per each cook, subtracting the containers’ tare weights.  There are FIVE CONTAINERS present, by the way -- the one  they’re on now is the last of the bunch to be weighed.)  JESSE  Two-oh-one point six.  (mildly annoyed)  Jesus.   Seriously?  Reveal Walt standing by, recording the amount on a clipboard  (where he is, the readout happens NOT to be visible to him).  WALT  Better over than under.  JESSE  Over by a pound and a half?   I  thought you were all, like,  “precise.”  (pops open the Rubbermaid)  Whatever.   I’ll just save it out  till next week.  Quickly overriding Jesse, Walt re-seals the container.  WALT  We ship it as-is.  JESSE  What are we, running a charity?!  C’mon man, we’re gonna take it out!  WALT  Leave   it.   One batch, one ship.  Stop complicating things.  BREAKING BAD #309   \"Kafkaesque\"   AS BROADCAST   4.  (CONTINUED) Jesse finally gives up, bewildered -- but mostly pissed-off.  Walt ignores him, returns his attention to his clipboard.  Jesse frowns.   Reads Walt --   is this extra amount by   design ?  JESSE  (outraged now)  Why are you purposely giving him  free   meth ?!   These bitches are  bleeding us enough already!  WALT  You are paid extraordinarily well,  why can’t you just appreciate  that...  Distracted Walt files away his clipboard and crosses the lab  to the lockers (or wherever our changing area happ",
      "dialogue_count": 1,
      "word_count": 6495
    },
    {
      "scene_number": 2,
      "slugline": "EXT. LONESOME HIGHWAY - DAY  LOW ANGLE on flat highway, inches above the blacktop.   The  double lines converge into infinity.   WOOSH!   The Aztek  rattles past as Walt heads for home.  INT. AZTEK - MOVING - DAY - CONTINUOUS  Out of Gus’ presence, Walt slowly drops his mask of  detachment.   He   hates   himself, hates what he’s done -- he’s  cemented a deal with the devil.   He pretended that what  happened to Hank didn’t wound him to his core.  The money was unexpected -- and just makes it worse.   Walt is  profoundly, utterly compromised.   And what has he gained?  Has he really protected his family?  We linger on his face as he’s consumed by regret and self-  loathing.   The moment is punctuated by the irregular THUP-  THUP of vehicles passing in the other lane.   One thing’s for  sure, this anguished, torn man is anything but cold-blooded.  Walt’s foot presses on the gas.   The Aztek whines and  shimmies as it picks up speed.  WHOOM!   WHOOM!   Cars rush past faster.  And then... gradually, very deliberately, he FLOORS IT.  The speedometer needle quivers.   70... 75... 86...  Now, as if resigned to his inevitable fate...  WALT CLOSES HIS EYES .  95...   98...   100...  THA-WOOM!   THA-WHOOM!   Cars and trucks FLICK PAST.  STAYING on WALT.   We barely glimpse the world blurring past  as he literally drives blind.   The head-on collision has got  to be coming.   Any second.   The only question is how many  innocent lives he’s going to take.  A protesting car horn DOPPLERS past.   Tires SCREECH.  The Aztek sounds like it’s going to shake itself apart.   It’s  rattling like a metal garbage can dragged over cobblestones.  For a strange moment Walt looks almost...   serene .  Finally, self-preservation compels Walt to OPEN HIS EYES.  BREAKING BAD #309   \"Kafkaesque\"   AS BROADCAST   30.  (CONTINUED)",
      "characters": [],
      "action_text": "Walt’s POV from behind the wheel -- he’s in the   WRONG LANE .  A TRUCK is headed his way, AIRHORN blasting --   WAAAAAAAAAAAH!  Walt’s reflexes snap back to life.   He JERKS the wheel.  EXT. LONESOME HIGHWAY - CONTINUOUS  The Aztek BURNS RUBBER and SWERVES across the blacktop onto  the shoulder.   The back end FISHTAILS on the dirt.  Nearly tipping over, the Aztek SHUDDERS to a stop.  INT. AZTEK - CONTINUOUS  A lazy cloud of DUST rises.   As it drifts past him, Walt just  sits here, getting his breathing under control.   For some  reason, today’s not the day to die.  The surge of adrenaline has brought Walt back into the  moment.   Death will just have to wait.  And now he’s back to being Walter White.   Just like his  Drivers’ Ed instructor taught him decades ago, Walt turns on  his blinkers.   Hands on the wheel at ten and two, Walt checks  his mirrors and pulls back on the highway.  EXT. LONESOME HIGHWAY - DAY  HIGH ANGLE.   The Aztek drives away from us, growing tiny in  the distance.   Walt’s crazy maneuver has left a swirl of  twisting SKID MARKS on the asphalt.   Off this...  END ACT TWO  BREAKING BAD #309   \"Kafkaesque\"   AS BROADCAST   31.  CONTINUED: ACT THREE  INT. MEETING ROOM - NIGHT  Jesse sits in another session as the Group Leader counsels.  Some of the same folks from before are here (new wardrobe),  but also there are several new faces.  GROUP LEADER  Part of the reason we talk about  what gets us riled up in our daily  lives is to help each other put a  finger on what our relapse triggers  might be.   Head off our disease  before it comes back.  (shrug)  So...   Anyone?   Free license to  bitch and moan.   How often d’you  get that?  Timidity reigns.   No takers.  GROUP LEADER  Jesse.   Last time, you seemed  pretty down about your job at the  Laundromat.  Jesse’s not in a big mood to talk.   He shrugs --   whatever .  GROUP LEADER  Lemme ask you something.   If you  had the chance to do anything you  wanted -- what would you do?  JESSE  (goes wi",
      "dialogue_count": 0,
      "word_count": 2794
    },
    {
      "scene_number": 3,
      "slugline": "INT. SUPERLAB - DAY  TIGHT ON a hand clutching a BRIGHT BLUE CLOTH, scrubbing  intently at one of the superlab’s stainless steel surfaces.  The hand moves aside, revealing WALT’S REFLECTION.   The field  of steel is gleaming and spotless, except for a single, small  stain of residue.   Like a Hindu bindi, right between Walt’s  eyes.   But black.  We hold on the reflection as Walt stares at the spot.   But  it’s as if he’s looking through it -- not seeing it for what  it is.   His mind is somewhere else.   Until he looks over at:  JESSE.   Wearing his iPod.   The music is cranked, thinly  audible through his headphones.   He weighs the FOURTH of FIVE  full and identical RUBBERMAIDS.   Another cook is complete.  We HOLD on Walt as he studies Jesse.   Worried.   Guilty.  Should he tell him what he now knows for certain -- that Gus  is a murderous criminal, likely as dangerous as Tuco ever  was?   That Walt just upped their deal -- a move calculated to  keep his own family secure, without regard to Jesse?  As Walt silently debates whether to spill his guts, Jesse  hoists the FIFTH and FINAL RUBBERMAID onto the scale.   All  the while, bobbing his head to the beat.  Walt snaps out of it.   Back to work.   He grabs his clipboard.  WALT  What’s the yield?   Hey.  Jesse pulls the headphones out of his ears --   huh?   Walt  gestures at the scale.  WALT  The   yield .   Come on.  Jesse glances down at the DIGITAL READOUT (remember, as  established in the Teaser, Walt does not see it from where he  stands).   Jesse’s POV:   “202.1.”  JESSE  Two-oh-one point eight.  Hold up!   Jesse is calling it one-third pound   under   the  actual weight!   Why would he do that?   We think we know.  Off this revelation that smooth Jesse is planning to STEAL  product from brilliant and scary GUS, we...  END ACT THREE  BREAKING BAD #309   \"Kafkaesque\"   AS BROADCAST   42.",
      "characters": [
        "SKINNY PETE",
        "WALT"
      ],
      "action_text": "ACT FOUR  INT. MEETING ROOM - NIGHT  Jesse is slouched in his usual seat, but tonight something’s  different about him.   His eyes are alive and watchful, as if  he’s waiting for something.   The meeting has just started and  the Group Leader spots a few newcomers.  GROUP LEADER  I see a couple of new faces.  Anybody wanna introduce themselves?  A chair CREAK.   A faint COUGH.   Nobody wants to go first.  GROUP LEADER  Don’t all speak at once.  In the shadows, a tentative hand rises.   The Group Leader  nods.   A big, shaggy guy speaks up.  BADGER  So my name’s Brandon?  Huh?   What the hell is   Badger   doing in Jesse’s sanctuary?  GROUP LEADER  Okay, Brandon.   You want to tell us  something about yourself?  Badger seems totally serious, sincere -- and tortured.  BADGER  Well, why I’m here... it’s, uh,  it’s just one thing.   It’s meth.  It’s bad.   I thought I had it  kicked a couple times, you know?  But then... Jesus.   This... new...  version   of it hit the streets, and  uh...  (eyes lowered)  Wow.  A new voice speaks from another part of the circle.  SKINNY PETE  Not that   blue   stuff?  Heads turn in his direction and   Skinny Pete   glances around,  embarrassed.   Did I just say that out loud?  BREAKING BAD #309   \"Kafkaesque\"   AS BROADCAST   43.  (CONTINUED) Jesse notes his potential customers with lazy satisfaction.  Rehab saved his life -- yet now he’s here to sell meth to  people struggling with addiction.   Awful.   Has Jesse truly  become the “bad guy,” like he once told us?   Off him...  INT. HOSPITAL - HANK’S ROOM - DAY  Hank sleeps, deathly pale.   His jagged breathing and the hum  of monitors are our only sounds.   ADJUST to reveal...  ... Walt standing alone in b.g., watching his brother-in-  law’s troubled sleep with haunted eyes.   Walt’s been here for  the better part of an hour, tormented by the knowledge that  he’s responsible for Hank being in this bed.  We linger on this sad tableau.   Now Marie’s voice PRELAPS:  MARIE (V.O.)  I swear ",
      "dialogue_count": 2,
      "word_count": 2686
    }
  ]
}