{
  "slug": "breaking-bad-307-one-minute-2010",
  "title": "breaking bad 307 one minute",
  "genre": "thriller",
  "format": "series",
  "scenes_count": 5,
  "characters_count": 0,
  "characters": [],
  "total_words": 9028,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. JESSE’S HOUSE - LIVING ROOM - CONTINUOUS  ... sliding across the wooden floor (amid whatever crap was  established there in 306 before Jesse left).  JESSE  Uuuuhh...   Christ !  Jesse is stunned, recovering from the brutal sting with  enough time to look up and see...  Hank is still coming .   One punch was not enough.   Hank keeps  attacking, straddling Jesse as he tries to back away.   BAM!  HANK  You had my cell phne number?   You  had my wife’s   name ?!  The punches get even more intense.   Jesse is defenseless as  blow after blow finds its mark.  HANK  How’d you do it?   Talk!   Who’re you  working with?!  But Hank doesn’t give him a chance to answer.   He’s lost  control.   The torrent of punches will   kill   Jesse, until...  Hank’s eyes zero in to focus.   He soon realizes, the kid is  out cold.  Breathing hard, Hank sees the blood, the limp body below  him...   oh fuck.   What did he do?   Hank knew going in that he  was crossing a line, he just didn’t know how far he’d go.   He  sees he completely obliterated the line.  Hank backs away... a flight instinct creeping in.   The open  door is right there.   He can just walk out and drive away.  Hank’s going to leave... but before he crosses that  threshold, Hank stops... catches his breath...  Off Hank, his eyes on the motionless Jesse...  TIME CUT TO:  EXT. JESSE’S HOUSE - NIGHT  The rear door SLAMS on an ambulance as EMTs have loaded Jesse  inside (we don’t see what the damage is to Jesse just yet,  but suffice it to say, it’s pretty damn bad).   The emergency  vehicle drives away, red lights flashing.  BREAKING BAD #307   \"One Minute\"   AS BROADCAST   6.  (CONTINUED)",
      "characters": [],
      "action_text": "We find Hank sitting alone... sad and stoic in the face of  this grim reality.   The pain from his bruised hand just  starting to creep in.   He looks over to Jesse’s front door,  where...  His boss, ASAC MERKERT, speaks to two ABQ PATROL OFFICERS.  Hushed tones, incomprehensible mumbles to our ears.   But  they’re clearly recounting the events as the evidence seems  to spell out.   The ASAC gives them a nod and moves away,  making his way toward Hank...  Hank sees his boss coming, and stands respectfully... but  there’s a sort of glaze over Hank’s face.   Lost.   Beaten.  The ASAC takes a breath, feeling bad for Hank.   He isn’t  angry or conspiratorial.   His tone is straight-forward and  supportive, wanting to make the situation as painless as  possible.  ASAC  (meaning the cops)  If you’re, ah... ready to talk,  they want to get a statement.   Your  side of what happened here.   Or we  can hold them off ‘til another  time.  But Hank still doesn’t respond, searching for the right  words... until the ASAC provides:  ASAC  Maybe you want to talk to a lawyer.  Hank hears the advice.   Swallows and manages a nod.  Off subdued Hank, the idea of a lawyer front-and-center in  his mind...  INT. HOSPITAL - JESSE’S ROOM - NIGHT  ANGLE ON A CEILING.   An odd sight, but even odder as...  SAUL GOODMAN’S head slides sideways INTO FRAME, looking right  at us.   Examining, the lawyer raises a CELL PHONE and snaps a  photo...   FLASH!   He looks at his screen:   oh yeah.  SAUL  There it is.  Saul proudly turns the camera screen toward us, revealing a  PICTURE OF JESSE’S BRUISED FACE.  BREAKING BAD #307   \"One Minute\"   AS BROADCAST   7.  CONTINUED:  (CONTINUED) SAUL  Yo, Adrian.   Rocky called -- he  wants his face back.  We REVEAL Jesse in his hospital bed, as horrible as the  picture showed, and feeling a hundred times worse.   Hank  really did a job on him.   He can barely move his jaw, and his  left eye is SWOLLEN SHUT from a broken eye socket, his face  BRUISED and DISTENDED",
      "dialogue_count": 0,
      "word_count": 2764
    },
    {
      "scene_number": 2,
      "slugline": "EXT. WALT’S CONDO - MORNING  SKYLER rolls into frame (the obvious recipient of Marie’s  news).   She parks her WAGONEER outside of Walt’s new home  (which he bought in 306).  Skyler turns off the car engine and readies herself.   She  dreads having to see him...  INT. WALT’S CONDO - MORNING  CLOSE UP -- A KNIFE, coming into frame, pressing down along  the crust of a sandwich.   It’s the end of Walt’s morning  ritual, as he fixes his lunch for the day.  A sandwich wrapper and brown bag are nearby as Walt cuts the  PBJ sandwich.   Methodical.   Hypnotic.   Making it OCD perfect.  Until...   BZZZZZZZ.  Walt looks...   the doorbell?   His first visitor.   He wipes his  hands on a towel, taking it with him as he beelines to the  front door.   Opening to reveal...  Skyler.   Surprised, off-guard... their first contact since he  hung up the phone on her (in #306).  WALT  Hi.  SKYLER  Do you have a minute?  WALT  Sure.  Walt gives way to allow Skyler inside.  Skyler enters, and surveys the inside of Walt’s new condo.  Nice in here.   Impressive.   But Skyler can’t help herself:  SKYLER  I guess crime does pay.  Any little bit of happiness Walt may have had upon seeing  Skyler fades out like a dying light bulb.   But he remains  polite, neatly folding the dish towel in his hand.  WALT  I don’t suppose you just came by to  insult me.  Skyler takes her focus off the living space and looks at  Walt.  BREAKING BAD #307   \"One Minute\"   AS BROADCAST   17.  (CONTINUED)",
      "characters": [],
      "action_text": "SKYLER  No.   We need to talk.  (then)  You heard about Hank.   About what  happened with this, um, Jesse  Pinkman.  Walt, so far beyond lying anymore, nods.  WALT  Yes.   I know.  Walt crosses back to the kitchen area, wanting to hang up his  towel.  SKYLER  Whatever Hank was investigating...  Him trying to find an RV.   Is there  any danger that could lead back to  you?  This question catches Walt (and us) a little off-guard.   Is  Skyler showing concern for Walt’s safety?   Walt doesn’t think  too much about it... she might just be nosy.  WALT  No.   Why would it?  Not exactly a lie... but stretching the truth.  WALT  Is that why you’re here?  SKYLER  I’m here to talk about Hank.   You  know what’s gonna happen to him if  this Pinkman presses charges.  (off his look)  Hank could lose everything.  Walt nods, somber.   He agrees.   And so?  SKYLER  I thought maybe, um... there’s a  way you could help him.  WALT  How?  SKYLER  Contact Pinkman.   Get him to drop  these charges.  Walt considers her a moment.   Choosing his words carefully...  BREAKING BAD #307   \"One Minute\"   AS BROADCAST   18.  CONTINUED:  (CONTINUED) WALT  Look, Skyler, I don’t know what  kind of relationship you picture me  having with this person --  SKYLER  -- I’m not asking.  WALT  -- He was, he’s-he’s not my   friend .  I mean, it’s not as if we were ever  close .  SKYLER  I’m not asking.   But there must be  something you can say.   Isn’t it  even worth a try?   Hank is your  family.  WALT  Not currently.  Ouch.   Skyler lets this sink in --   did she hear him right?  SKYLER  What?  WALT  I said “not currently.”  Wow.   Cold.   Skyler examines Walt, and he moves back to the  front door, opening it for her to leave.  WALT  I’m late.   I have to go.  He waits, clearly wanting her to exit before he leaves.  Walt’s a bit of a dick here, but this is exactly what she  wanted -- to have him out of her life.   Skyler sees it --  whatever emotional connection there was between them is  completely gone",
      "dialogue_count": 0,
      "word_count": 669
    },
    {
      "scene_number": 3,
      "slugline": "INT. SUPERLAB - DAY  Walt enters, deep in thought.   An answer in there somewhere.  GALE (O.S.)  (happy)  Hello!  Walt looks to see his new assistant, GALE, paging through the  New York Times.   Gale brightens at the sight of Walt.  GALE  Starting to get worried.  WALT  Car trouble.  GALE  Oh, that’s a bummer.   Y’should call  me next time, I’ll pick you up.  Walt moves to set down his lunch bag and belongings, as Gale  shadows him (without crowding him).   Gale, we may discern, is  dressed less casually this episode.   In fact... he’s dressed  a bit like   Walt .  Imitation is the sincerest form of flattery, and Walt subtly  notices.  WALT  No, uh... sandals today..?  Gale smiles, a touch self-conscious.  GALE  I just thought... bit more  professional.  (then, upbeat)  Well.   Everything is on track --  we’ve got our distillate.   Just  waiting to...  Walt gives a polite smile.   Uh-huh.   Walt moves to the “Clean  Zone” area where they change their clothes (and a locker if  we have it), and where the Tyvek suits are located.  WALT  Let’s get our trays ready...   clean ,  no moisture.  GALE  Done.  BREAKING BAD #307   \"One Minute\"   AS BROADCAST   20.  (CONTINUED)",
      "characters": [],
      "action_text": "WALT  (testing him now)  Is our, uh... our solvent filtered?  GALE  (proud)  I thought you might ask that.  Done.  Walt nods -- Gale is the perfect assistant.   A bit absently:  WALT  That’s good.   That’s good.  GALE  Hand-in-glove -- that’s what we  strive for.  (Bogart-lite)  You know, this might be the  beginning of a beautiful  friendship.  Gale gets a good feeling over his “Casablanca” comment... but  Walt pauses to consider the remark.   Something isn’t sitting  right.   As if a foul odor is wafting under his nose...  EXT. EMPTY LOT - DAY  The middle of nowhere.   A paved over piece of land where  someone maybe once considered putting a WalMart but then  abandoned the idea.   A lone TRACTOR TRAILER sits on the  tarmac -- a big thirty-foot delivery rig.   Inside:  A little Willie Nelson-looking TRUCKER relaxes behind the  wheel -- bored, waiting... drinking coffee from his thermos.  He checks his watch as...  A GREY CAR comes cruising across the blacktop at a casual  pace.   The trucker exhales --   about fucking time.   He climbs  out of his rig to greet...  THE COUSINS.   They park and step out.   Scanning the scene to  make sure no one else is around.   Just the trucker.  TRUCKER  So.   You the gentlemen?  The cousins nod.   Yes, they are.  BREAKING BAD #307   \"One Minute\"   AS BROADCAST   21.  CONTINUED: INT. TRACTOR TRAILER BED - MOMENTS LATER  The rear doors   CREAK   open, and the trucker climbs inside,  followed by both cousins.  TRUCKER  Lucky you boys caught me.   I got a  load to pick up, I’m takin’ the  Forty straight through to Memphis.  The trucker (talking   non-stop ) leads the cousins down the  large expanse of empty trailer.   The roof has sections of  opaque white Plexi, allowing light into the deep area.  TRUCKER  I can hammer it out in about  fifteen, but there’s this gal  there.   Named Lainie or Lolly or  something... Maybe Fran.   Anyhow,  she’s got one of these fetish  things where she likes to get peed  on?   You know.   So, I was hop",
      "dialogue_count": 0,
      "word_count": 3415
    },
    {
      "scene_number": 4,
      "slugline": "INT. DEA ABQ - ELEVATORS - MOMENTS LATER  CLOSE - HANK PUSHES THE DOWN BUTTON  He waits for the elevator to arrive, when...  ASAC (O.S.)  Schrader.  Hank looks to see the ASAC approach.  ASAC  Hold up.  Hank takes a breath.   Was hoping to get out of here without  the “good-luck-to-you” speech.   But Hank remains cordial.  HANK  Yes sir.  ASAC  I just wanted to tell you  something... and to be clear, you  didn’t hear it from me.  (low)  I don’t want you to get your hopes  up, but word in the pipeline is...  Pinkman   isn’t   pressing charges.  Hank considers this, frowning.   Confused.  HANK  Why not?  ASAC  Who the hell knows?   Maybe you have  a guardian angel.  With a pat on his shoulder, the ASAC moves off.   Hank  considers for a moment, stunned.   The elevator doors open,  and he gets on...  Hank pushes the button, thinks about what just happened.   How  is that for the universe talking to him?   Huh.   Hank shakes  his head and... actually smiles.  Off the DING of the elevator, the doors closing shut...  EXT. MALL PARKING LOT - DAY  MALL PARKING LOT.   A massive shopping center with a variety  of different stores.  BREAKING BAD #307   \"One Minute\"   AS BROADCAST   36.  (CONTINUED)",
      "characters": [],
      "action_text": "Hank exits with a small bouquet of fresh-bought purple  flowers -- like lavender and roses.   His cell phone pressed  to his ear...  HANK  (into phone)  It went fine.  (listening)  “Fine.”   It means what it means.  Look, I’ll, uh... I’ll tell you all  about it when I get home.  (pressed for details)  Yeah, it’s just... I don’t know  baby.   I just think... I think we  may be okay.  (then)  Okay.   I love you too.  When he hangs up, we MOVE WIDE.   We get a real scope of the  sprawling complex.   PEOPLE moving to-and-from the shops and  their cars.   And what a wide sea of cars it is.   It’d be easy  to get lost as Hank searches for his.  Hank finds his parked Commander wedged, nose in, sandwiched  between a couple of cars in a long stretch of vehicles.   BEEP-  BOOP , he unlocks his Jeep and squeezes his way inside...  INT. HANK’S JEEP COMMANDER - CONTINUOUS  Hank sets the purple flowers down in the passenger’s seat and  puts the keys in the ignition.   About to crank the engine,  HIS PHONE RINGS.   Hank answers.  HANK  Schrader.  VOICE (FILTERED V.O.)  I need you to listen very  carefully.   Two men are coming to  kill you.  Hank freezes.   What ?  HANK  Come again?  VOICE (FILTERED V.O.)  They’re approaching your car.   You  have one minute.  Hank’s face turns to stone.   This isn’t even a bit fucking  funny.  BREAKING BAD #307   \"One Minute\"   AS BROADCAST   37.  CONTINUED:  (CONTINUED) HANK  I don’t get the gag, jag-off.   Who  is this?  VOICE (FILTERED V.O.)  They’re coming.  CLICK.   What   the fuck   was that?  HANK  Hello?  Hank looks at his phone display:   RESTRICTED .  His eyes go to the dashboard CLOCK:   3:07   pm.  As Hank tries to make sense out of what he’s heard, we play  out this scene in excruciating REAL TIME.  A look around, and he hits SPEED DIAL on his phone.   Listens  to the ring, then...  HANK  Hey...  But it’s voicemail.   He pauses to listen through, until...  HANK  (into phone)  Hey Gomie, this is Hank.   I don’t  know what that call wa",
      "dialogue_count": 0,
      "word_count": 1003
    },
    {
      "scene_number": 5,
      "slugline": "EXT. MALL PARKING LOT - SAME  BLAM!   BLAM!   BLAM!!!   Hank’s rear window BLOWS!   Bullets  seem to come from everywhere as the cousins FIRE at will.  Hank’s right bicep EXPLODES with blood as a bullet rips  through him!   Painful, through the back and out the front.  Pedal to the floor, the Commander arcs back and...  SLAM!   He HITS Leonel, CARRYING HIM -- his body leaning in  through the open rear window... until...  SMASH !   -- the Commander rams into another car so this fucker  is   pinned   between them.  The impact causes the cousin to drop his gun...   inside   Hank’s  truck.   Hank sees the loose weapon RATTLE toward him, and he  makes a desperate move for the gun, as...  BLAM!   BLAM!   BLAM!   Hank’s HIP is shot once as bullets  pierce the driver’s door of the Commander.  The other cousin (Marco) FIRES round after round into the  Commander.   Hank is out of his (and our) view as he is  crawling in the back to get the loose gun.  The cousin stops shooting --   where is Hank?   The cousin  carefully approaches, looking into the window to see...  The back (passenger’s) seat door open, and HANK IS GONE.   A  blood trail leading off from the scene...  Marco sees his brother slumped through the rear window,  pinned between the cars.   He yanks the Commander’s gear shaft  into ‘Drive’ and lets it roll away... drifting until it  crunches to a stop against another car.  Leonel, free of the automobile vice, slumps to the ground.  Both legs SMASHED and bloody above the knees, one so bad that  it’s completely TWISTED AROUND.  Marco kneels next to his brother, seeing his gruesome  condition.   No big emotions here, just weird steely calm.  Intense, as Leonel looks to his brother...  LEONEL  (Spanish - with SUBTITLES)  ...   finish him ...  Marco gives a simple, determined nod.   He will finish this .  The cousin moves off, gun in hand, following the BLOOD TRAIL  left by injured Hank through the winding expanse of cars.  BREAKING BAD #307   \"One Minute\"   AS BROADCAST   40.  (CONTINUED)",
      "characters": [],
      "action_text": "On the hunt... it’s only a matter of time.   The trail leads  up ahead, between another set of cars.   As he approaches...  MAN (O.S.)  Jesus.  A self-absorbed PREPPIE SHOPPER in iPod headphones walks into  his path.   Suddenly aware of this scary gunman, the preppie  stops and raises his hands, as if to say: “Hey, I’m nobody,”  but...  POP-POP!   A quick SHOT to the gut and forehead, and the  bystander drops like a rock.   Sudden... violent... it’s over.  The cousin swings his gun,   something in his peripheral ... a  FEMALE SHOPPER,   looking right at him .   He pulls the trigger,  but...  The gun slide is LOCKED OPEN... HE’S OUT OF BULLETS!   The  woman runs off SCREAMING, her lucky fucking day.  Marco pulls a new CLIP out of his front pocket, and as he  does, we see: the BLACK DEATH BULLET falls out (the one the  Trucker handed him in Act Two).  The bullet tumbles and   CLINKS   to the ground next to his SKULL-  TIPPED BOOT.   Slow-motion.   Dramatic.   So we’ll remember it  for later.  His gun reloaded, the cousin continues to follow Hank’s blood  trail, around the car before him.   Where the fuck is he?!  But we see something the cousin doesn’t...   behind him .   Back  near where he dropped the bullet, HANK rises up from behind  the car!   His GUN trained, locked on the cousin...   he’s got  him!   A breath to steady his aim, and then...  BOOM !   The first shot spins the cousin around.   Then:  BOOM-BOOM-BOOM!   Three more bullets square in the fucker’s  chest!   But... the cousin doesn’t go down?   WHAT ?!   Hank’s  gun slide is LOCKED OPEN.   He’s out of bullets.   Hank sees...  The cousin takes aim.   On Hank.   Dead to rights.  BOOM!   BOOM!   Sudden,   violent   shots IMPACT with Hank -- his  right lung and lower left abdomen.   Hank crumbles...  The cousin tears at his shirt in pain, revealing the  BULLETPROOF VEST beneath.   That’s   how he survived.  Marco makes his way over to Hank, a bloody mess on the  ground, gasping for breath.   The cousin stan",
      "dialogue_count": 0,
      "word_count": 1177
    }
  ]
}