{
  "slug": "breaking-bad-311-abiquiu-2010",
  "title": "breaking bad 311 abiquiu",
  "genre": "drama",
  "format": "series",
  "scenes_count": 2,
  "characters_count": 1,
  "characters": [
    "HANK"
  ],
  "total_words": 7324,
  "total_dialogue": 1,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. SAUL’S OFFICE - LOBBY - DAY  In a snazzy ONE-ER, we PAN ACROSS a thicket of gang-bangers,  cheats and troglodytes who are waiting for the legal services  of Mr. Saul Goodman, Esq. to find...  ... Walt and Skyler.   Skyler is in a slight state of shock --  even   she   didn’t expect it to be this bad.   Off Walt, watching  her closely out of the corner of his eye... realizing a bit  too late that this is probably a HUGE mistake...  INT. SAUL’S OFFICE - DAY - LATER  CLOSE ON Saul’s “University of American Samoa” diploma.  Skyler stands staring at it, deadpan and unimpressed.   Behind  her we find SAUL GOODMAN, definitely impressed (and slightly  flummoxed) to be meeting pretty Skyler.  SAUL  Hell.   Welcome.   What a pleasure it  is to have you!   I’m just gonna  call you Skyler, if that’s okay.  It’s a lovely name.   Reminds me of  a... big beautiful sky.   Walt never  told me lucky how lucky he was...  prior to recent unfortunate events.  Walt watches nervously as his two worlds collide -- Saul  fawning over the tall-drink-of-water that is Skyler, and  Skyler uneasy that she might accidentally pick up a social  disease from the charged and shifty shyster that is Saul.  SAUL  Clearly his taste in women is the  same as his taste in lawyers: only  very best with just the right  amount of dirty.  (laughs; off her stare)  That’s a joke.   That’s a joke.  It’s funny because you are so  clearly very classy.   Here, please,  sit down.  Saul pulls out a chair for her.   When she’s not looking, Saul  gives a quick   eyebrow-raise of approval to Walt for landing  such a looker.   Walt tries not to notice, taking his own seat  as Saul rounds to the business side of his desk.  SAUL  So.   Walt tells me that you have,  uh, some concerns I can alleviate.  BREAKING BAD #311   \"Abiquiu\"   AS BROADCAST   18.  (CONTINUED)",
      "characters": [],
      "action_text": "As Skyler scans the big “Constitution wall” behind Saul...  SKYLER  Uh, yes I do.   I have... concerns.  No shit.   Glancing sidelong at Walt, you don’t have to be  Kreskin to read her mind.   How the   fuck   did you end up with  THIS guy?   Yet Skyler politely presses forward...  SKYLER  Um, if we’re going to go down this  road... and clearly we are, for the  sake of my brother-in-law...  SAUL  I’ve heard about him.   Uh, he’s an  American hero.  Nodding, Saul gives out with the cheesy sympathy like a  discount undertaker.   Skyler pauses flatly, then continues.  SKYLER  At any rate, I need some assurances  that we’re gonna go about this in a  manner that is extremely safe and  cautious.  SAUL  Fair enough.   I’ll walk you through  the process.   First step is  something we like to call “money  laundering.”   Alright, take you’re  money were represented by say...  these jelly beans.  WALT  Uh, Saul...  Saul sets out a jar of jelly beans, meaning to pitch the same  simplistic “Money Laundering 101” he gave to Jesse in #309.  Walt tries to warn Saul with a quick shake of his head.  SKYLER  Y’know, I’m a bookkeeper -- so I  actually, I know what money  laundering is.  SAUL  Uh-huh.  (takes away jelly beans)  Well.  BREAKING BAD #311   \"Abiquiu\"   AS BROADCAST   19.  CONTINUED:  (CONTINUED) SKYLER  And as with most things, the Devil  is in the details.   So to begin  with, what are we saying is the  source of this money?  SAUL  That’s simple.   Walt here came up  with a great story about gambling  winnings.   Blackjack, right?   Some  card-counting system?  WALT  (quiet discomfort)  Um, actually that was Skyler’s  idea.  Really ?   Saul’s eyes widen at Skyler, impressed.  SAUL  Well.   You grow more gorgeous by  the minute!  (then; shrugs)  Well, there you have it.   I’ll  generate false Currency Transaction  Reports out the wazoo, as well as  the necessary W-2Gs.   I know a  couple casino managers who will  jump at the chance to report false  losses.   So, win-win fo",
      "dialogue_count": 0,
      "word_count": 2124
    },
    {
      "scene_number": 2,
      "slugline": "EXT. CAR WASH - DAY - CONTINUOUS  They are parked across from a CAR WASH.   But not just any car  wash.   It’s where Walt worked all the way back in the PILOT.  SKYLER  You worked here four years.   It’s a  business you understand.   It’s a  story people will believe.   Not  Laser Tag.   This .   This is what we  buy.  Walt looks at her...   what   we   buy?  SKYLER  You.   This is what you buy.  She corrects herself without urging, but still... Skyler is  at a level of acceptance Walt would have never dreamed could  happen.   Off Walt, eyeing this possible business venture, and  an uneasy new stage in their relationship...  END ACT TWO  BREAKING BAD #311   \"Abiquiu\"   AS BROADCAST   27.",
      "characters": [
        "HANK"
      ],
      "action_text": "ACT THREE  EXT. CHURCH - DAY  A NEW DAY from the end of Act Two -- new wardrobe.   Jesse  leans against a wall, having a post-meeting cigarette.  Several other GROUP MEMBERS mill about, doing the same.  Here comes Skinny Pete and Badger, exiting the meeting,  Badger still munching on a big doughnut.   The guys approach,  a little wary to see Jesse --   did he make his sale?  Automatically dropping into “We don’t know each other” mode:  BADGER  Hey, uh...  (snaps; “remembering”)  ...   Jesse , right?  (presenting himself)  Brandon... Peter.   How goes it?  Hanging in there?  Jesse sighs and shakes his head, tiredly exasperated.  JESSE  Please , just..?   Dumbass.  BADGER  Sorry, man.   Just trying to keep it  on the D.L.  SKINNY PETE  (glances around; hesitant)  So.   You and that girl.   You do the  deed yet?  JESSE  Do   what ?  SKINNY PETE  You know.   Sell to her?  He says it low.   Jesse remains cool, shakes his head.  Jesse realizes -- they think he didn’t have the balls to go  through with slinging meth to Andrea.   Irritated:  JESSE  What are you two even doing here? --  SKINNY PETE  What d’ya mean?  BREAKING BAD #311   \"Abiquiu\"   AS BROADCAST   28.  (CONTINUED) JESSE  You can’t get your nut up to sell,  what’s the point of even coming?  Pete and Badger share another look --   isn’t it obvious?  SKINNY PETE  Homie, I’m on, like, Step Five --  This is totally sincere -- Skinny’s really trying to do the  right thing here.   Jesse stares at him, open-mouthed.   Then  he looks to Badger --   and you?  Badger throws two fingers in what looks like a gang sign --  but what he’s really saying is that he’s at STEP TWO.  BADGER  Deuce, yo.   I’m catching up.  Off of Jesse’s disbelief, he spies... Andrea, emerging from  the church, scanning for Jesse.   He stubs out his cig, makes  a bee-line for her.  JESSE  Whatever.   Later.  Badger and Pete stare after Jesse as he catches up with  Andrea.   The boyz both watch as they slip casually into each  other’s arms and head ",
      "dialogue_count": 1,
      "word_count": 5200
    }
  ]
}