{
  "slug": "brightburn-2019",
  "title": "brightburn",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 4,
  "characters_count": 0,
  "characters": [],
  "total_words": 19032,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. FARMHOUSE - NIGHT  A lonely, rundown Victorian farmhouse surrounded by six-foot- high cornfields. A neglected barn in the distance. No neighbors in sight. Everything dark but for a flickering blue TV light from an upstairs window.  INT. TORI AND KYLE'S BEDROOM - CONTINUOUS  PAN ACROSS an array of framed photographs on a hallway wall, stretching back generations - A recent color photo of a young man and woman on their wedding day. Sepia portraits of a homesteader family on the plains of Kansas, everyone sturdy, solemn. Black & white portraits from the '20's and '30s, lots of kids.  IN THE BATHROOM  The woman in the color photo - TORI BREYER, early 30's, in a sleeveless nightgown - studies herself in the mirror. She doesn't like what she sees. Too plain. Too Midwestern. Too wholesome. So she tucks a lock of hair behind her ear. Unbuttons a couple buttons on her nightgown. She makes her way -  INTO THE BEDROOM  Her husband KYLE - 30's, thatchy beard, sturdy build - lies in bed scrolling around on his laptop. A TV plays a sitcom on Nick at Nite. Tori goes to Kyle. She gets on the bed, folds up his laptop, sets them on a stack of books on the nightstand:   Taking Charge of Your Fertility; The Everything Getting Pregnant Book; Miscarriage: Women Sharing From the Heart . Tori climbs on top of Kyle. Starts to kiss him. He's pleasantly surprised - KYLE What's going on? Are you ovulating? TORI (between kisses) No. But for once let's not have it be work. Just fun.",
      "characters": [],
      "action_text": "KYLE Hell, it's always fun for me. He gets into it. They start messing around. Close. Intimate. A tangle of hands and limbs. A bedside lamp flickers. The cable TV feed pixillates and stutters - jagged bursts of creepy sitcom laughter. Tori stops short. TORI Um... Ow. KYLE (hyper-concerned) What, what? Her hair has become caught in his watchband. They both giggle. KYLE (CONT’D) Jesus, I'm sorry... He delicately maneuvers his wrist, unclips his watch, disentangles her hair. He throws his watch on the bed. She sits up, straddling his waist, her fingers interlaced with his. He smiles. She smiles back at him. Then - A chain on the bedside lamp quivers, tinkling against the light fixture. Tori climbs off the bed. She's curious. Alert. As if the air is suddenly charged. She ventures toward the hallway. KYLE (CONT’D) Babe? You okay? She looks down the dark hallway. Peering into the stillness. She turns to Kyle. TORI I'm fine. For a second I thought - A DEAFENING BOOM! LIKE A 747 ROARING INCHES ABOVE THE HOUSE. BOOKS, PERFUME BOTTLES, AND PICTURE FRAMES FLY AGAINST THE CEILING, AS IF MAGNETIZED BY SOMETHING PASSING OVERHEARD. TORI AND KYLE ARE THROWN TO THE FLOOR. THE HOUSE RATTLES TO THE FOUNDATION.  2. FOR A BRIEF MOMENT THE OBJECTS IN THE ROOM HOVER IN ZERO GRAVITY - THEN PLUMMET. The TV crashes to the floor. Kyle's watch lands beside him. Tori and Kyle try to collect themselves. KYLE You all right? She nods, shaken. TORI What was that? KYLE I don't know, an earthquake? She gives him a withering glance. THAT was not an earthquake. She notices something outside. She drifts toward the bedroom window and looks out, disturbed. Kyle joins her. They see, far off, a FLICKERING LIGHT in the woods. A thin wisp of smoke rising into the night sky.  INT. PICKUP TRUCK - MOMENTS LATER  Headlights cut through a dirt road - deeper and deeper into woods thick with trees. Kyle at the wheel, Tori looking out the window. She wears a red wool cardigan over her nightgown. Eerie old-time music ",
      "dialogue_count": 0,
      "word_count": 1754
    },
    {
      "scene_number": 2,
      "slugline": "INT. MIDDLE SCHOOL CLASSROOM - DAY  A SCIENCE TEACHER stands next to a video projection - images of bees and wasp dance off of her in the darkened room. SCIENCE TEACHER Wasps and bees. Both members of the same insect family, both with two pairs of wings, both with stingers. As the teacher lectures, a pretty girl with frizzy hair - CAITLYN - peers over at Benjamin making childlike doodles in his notebook - variations on his name and initials. SCIENCE TEACHER (CONT’D) Can anyone tell me any differences between them? Mr. Breyer? Benjamin looks up at her. BENJAMIN Well, um... bees are pollinators, wasps are predators. SCIENCE TEACHER Good, good. BENJAMIN Wasps are more aggressive. More dangerous. One species,   Polistes sulcifer , is what's called a brood parasite. A blue-eyed boy, ROYCE, exchanges glances with a kid with a FAUXHAWK, the two of them stifling a snicker. BENJAMIN (CONT’D) These wasps have lost the ability to build their own nests, so they use brute force to get other wasp species to raise their young. They make them feed their babies beetle larvae and maggots. An awkward silence from the class. Royce pipes up - ROYCE Yo man, how'd they taste? The classroom ERUPTS in laughter. Benjamin is bruised. As the teacher tries to quiet the class, Caitlyn leans over to Benjamin and whispers -  Blue (11/30/17)   9.",
      "characters": [],
      "action_text": "CAITLYN Don't worry about that idiot. Some day he'll be working for you. Benjamin takes this in. Caitlyn returns to her notebook. He smiles to himself.  INT. FARMHOUSE - KITCHEN - NIGHT  Tori washes dishes in the sink, steam rising. The kitchen is off dining and living rooms that haven't changed in generations - peeling wallpaper, heavy dark furniture, old porcelain dolls. A LOUD THUMP from upstairs. Tori turns off the sink. Listens. She calls upstairs - TORI Ben? A grandfather clock TICK-TOCKS. Then, from somewhere in the house, she hears - A LOW MURMURING NOISE. GHASTLY. SINISTER. Tori is creeped. She makes her way toward a back STUDY off the living room. Kyle is slumped on an old couch, sleeping, the TV playing some old movie with the sound off. Tori whispers - TORI (CONT’D) Kyle, do you hear that? He mumbles incoherently. She returns to the living room. She hears a SMALL CLATTER outside - trash cans maybe. Then a PAINED GUTTURAL MOAN. She opens the back screen door and goes -  10. OUTSIDE THE FARMHOUSE  A jagged breeze. Wind chimes trill. Tori stands on a wraparound porch. She scans the backyard area. Bare light bulb behind her. The fields a blanket of darkness. She zeroes in on a rusty swing CREAKING BACK AND FORTH. Is that what she heard? Then, across the yard, SOMEONE WALKS THROUGH HER PERIPHERAL VISION. Tori jolts as she watches BENJAMIN BEE-LINE INTO THE BACKYARD, OBLIVIOUS TO TORI, OBLIVIOUS TO EVERYTHING, in a kind of zombie trance. It's chilling. Unsettling. TORI Benjamin? He keeps walking through fluttering sheets on the clothesline. Through the backyard. Past the coop - chickens SQUAWKING WILDLY. TORI (CONT’D) Benjamin! Tori follows Benjamin as he staggers toward the barn - a tiny figure in his pajamas receding into the vast darkness. Tori can make out an eerie RINGING NOISE - keening, pulsating - emanating from inside the barn. Faintly at first, then growing. Tori heads toward the source of the noise. She enters -  THE BARN  Almost pitch black. Scary ",
      "dialogue_count": 0,
      "word_count": 808
    },
    {
      "scene_number": 3,
      "slugline": "INT. BENJAMIN'S BEDROOM - MOMENTS LATER  The room is dark and shadowy, cluttered with the detritus of different eras: a radiator from the 1910's, cowboy wallpaper from the '40s. Tori lovingly tucks Benjamin into bed. She makes sure he's asleep. Kisses his forehead. She heads out of his room, closing the CREAKING DOOR slowly, careful not to make too much noise. She turns, and - KYLE IS BEHIND HER! She jumps, startled. KYLE Everything okay? She fidgets. TORI I don't know. He was... sleepwalking I guess. KYLE (suspicious) Where? Tori catches herself, decides to protect Kyle - TORI Downstairs. He's fine. C'mon, you got an early morning.  INT. CHAIN RESTAURANT - EVENING  GROWLING ENGINES. First-person video POV of stock cars racing around a track, crashing into each other. Benjamin and Tori sit side-by-side at the wheels of a NASCAR Racing arcade game. Tori is having a blast.  INT. CHAIN RESTAURANT - MOMENTS LATER  Three members of a wait staff CLAP IN TIME WHILE CHANTING A BIRTHDAY TUNE. We're in a casual dining place. The waiters set down a sundae with a lit candle in front of Benjamin -  Blue (11/30/17)   13.",
      "characters": [],
      "action_text": "WAIT STAFF  Happy happy birthday! We whipped up something cold!  Benjamin is moody, distant. He's surrounded by Kyle, Tori, his AUNT MERILEE - 30's, sunny - and his UNCLE NOAH - late 30's, pudgy, affable. Benjamin contorts his face, turned off by the cheery song. WAIT STAFF (CONT’D)  Happy happy birthday! For someone getting old!  Tori snaps a photo with her phone as Benjamin blows out the candle. The staff whoops it up, wishes him happy birthday, then heads off. KYLE Wow. I think they use that to break prisoners at Guantanamo. Benjamin half-smiles. TORI Sorry, I did not know they were gonna do that. Noah puts his arm around Benjamin. NOAH Was it punishment for something? Bad grades? TORI (proudly) You've heard about his test scores, right? Top one percent. MERILEE Top one-tenth of one percent. Everyone on the faculty has been talking about him. TORI And he's just getting started. She starts to get choked up. TORI (CONT’D) So much ahead of you.  14. NOAH Well, a boy that special deserves a special gift. This is from me and your Aunt Merilee. He hands Benjamin a long wrapped gift. Merilee MERILEE Go 'head. Benjamin tears off the wrapping to reveal a REMINGTON BOLT- ACTION RIFLE. NOAH Shot my first buck with that very same model. KYLE No. No way. Tori, we discussed this. TORI I know, but - KYLE (to Benjamin) You're not ready. Kyle takes the rifle from him. Benjamin flares with anger. BENJAMIN I'm twelve years old. KYLE Exactly. You're still a child. Benjamin is irate. He stares down Kyle. Arcade games malfunction in the b.g. BENJAMIN Give that to me. It's mine. KYLE (taken aback) What'd you say to me? BENJAMIN I said - give it to me. Tori and Kyle are stunned. They've never seen this behavior from Benjamin before. Benjamin glares at his Dad -  15. BENJAMIN (CONT’D) Now. KYLE (furious) Okay. You're done. No ice cream. Kyle knocks the sundae aside - the glass bowl clattering across the table. Other customers steal glances at them. KYLE (CONT’D) We're leaving. Kyle stand",
      "dialogue_count": 0,
      "word_count": 10540
    },
    {
      "scene_number": 4,
      "slugline": "INT. COUNTY MEDICAL EXAMINER - NIGHT  MERILEE SOBS INTO TORI'S SHOULDER as they hold each other tight. Kyle puts a consoling hand on Tori and Merilee's backs. They're in a dim hallway. Linoleum floor. Gloomy lighting. Tori - her face red from tears - whispers tenderly - TORI It's okay. Let it out. Merilee breaks the embrace, tries to gather herself. MERILEE They won't even let me see him. They said he's all - She flutters her hands, indicating Noah is a mess. TORI Do they know how it happened? MERILEE He was on Route 18. They think he hit a deer or a cow or something. They're gonna do a toxicology whatever to see if he was, you know, impaired. Tori looks to Kyle, almost accusingly. KYLE He had, like, two beers. Maybe three, I wasn't counting. TORI Why didn't you drive him home? KYLE No one's even on those roads at night. Tori glares at him. Merilee sniffles. MERILEE How's Benjamin? KYLE We haven't told him yet. Just said we had something urgent.  69.",
      "characters": [],
      "action_text": "MERILEE So he got home okay? Tori nods yes. MERILEE (CONT’D) I'm sorry, it's a blur. I don't remember when he left exactly. Tori is confused. TORI Left where? MERILEE He came over. He wanted help with his homework. A FEELING OF DREAD wells up in Tori and Kyle.  INT. FARMHOUSE - LIVING ROOM - MORNING  Milky first light of morning. Benjamin sits with Kyle and Tori. The two of them have been up all night. They're solemn, measured. TORI This may be difficult for you to hear, but we wanted you to know that... your Uncle Noah - he, uh - She's emotional, has trouble finding the words. KYLE He died last night. BENJAMIN How? KYLE A car accident. Benjamin takes a deep breath. As if absorbing the news. Kyle studies his reactions. TORI You all right? BENJAMIN It's weird. I feel like maybe I should cry or something. Benjamin just sits there.  Blue (11/30/17)   70. TORI Now, Benjamin, we know you were at Aunt Merilee's last night. Benjamin takes this in, unfazed. TORI (CONT’D) I'm your mother, and I will always defend you. But if you know anything about what happened to Noah, it's okay to tell us. Benjamin regards his parents for a moment. Then - BENJAMIN All right. I'm gonna be totally honest with you. He looks Tori and Kyle in the eye. BENJAMIN (CONT’D) I was at Aunt Merilee's last night. She was helping me with my homework. Then she said she was tired, so I left, and I saw Noah in the driveway. He was yelling and acting strange, like he was drunk. Then he drove off. That's the last I saw him. KYLE So all that playing-soccer stuff was a lie. BENJAMIN Yes. I made up something that I thought would make me sound less - I don't know. Less weird. Tori is relieved. Kyle is not. He leans in. KYLE I gotta ask, Benjamin - what other things have you been lying about? BENJAMIN Nothing. TORI (cautioning) Kyle.  Blue (11/30/17)   71. KYLE Were you outside Caitlyn's bedroom before you broke her hand? TORI He was camping with us, Kyle! Kyle just stares at Benjamin - KYLE Where were you on Wed",
      "dialogue_count": 0,
      "word_count": 5930
    }
  ]
}