{
  "slug": "bright-2017",
  "title": "bright",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 10,
  "characters_count": 1,
  "characters": [
    "KANDOMERE"
  ],
  "total_words": 19754,
  "total_dialogue": 1,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT.   WARD’S HOUSE - BEDROOM - DAY  SCOTT WARD   can’t sleep.   He scowls in defiance at the golden midday sun scorching through the blinds.   Plain but handsome, with an ‘ I’m in charge here’   buzzcut.   A thoughtful man, but no genius, he’s stymied by the daylight.   We note the ANGRY BRUISING on his 200-pushups-a-day chest. Ward tries to fall back asleep.   No dice .   He shifts his weight and peels his Glock off his sweaty back.   Sighs and starts counting the cracks in his bedroom ceiling... SMASH TO: EXT.   LIQUOR STORE - WARD’S FLASHBACK   - DAY A   GANGBANGER   in a   black hoodie   bursts out the door with a shotgun!   WARD stands there in LAPD uniform.   Reaches for his holster -- Breaks leather.   Steps into a textbook shooting stance.   Muzzle coming on target.   Too Late...  The GANGBANGER spins aims fires   --   KABOOM!  INT.   WARD’S HOUSE - BEDROOM - DAY Ward gasps awake.   His fingertips skim the ugly green and purple bruises on his chest.   I’m still alive. .. INT.   WARD’S HOUSE - KITCHEN - DAY Ward shuffles into the kitchen -- Sees   SHERRI , his age, inspecting dishes in the sink, looking for the easiest one to wash.   Pretty in a champagne room kind of way.   She has an air of entitlement, things should’ve been easier for her. The tension between them is palpable.   Ward grabs a huge box of Cheerios, fills a plastic bowl.   Without looking up:  SHERRI There’s a fairy in the bird feeder again. Ward sighs.   Gets the milk from the fridge.   Smells it. Expired.   Pours it anyway. SHERRI (CONT’D) It’s the same fuckin’ one, too. Isn’t it?   Cause you didn’t kill it  last time.",
      "characters": [],
      "action_text": "Ward steels himself as he tamps cornflakes into sour milk.  He’s been over her shit for a long time --   His tone immediately counters her aggression, mellow, even... WARD I thought you were out looking for a job. SHERRI Oh.   Right.   Of course.   Of course you’d bring that up. WARD Yesterday you indicated you would be actively looking for employment. We had a plan, a timeline.   And I’m concerned-- SHERRI --Don’t.   Don’t do that. WARD Do what? SHERRI Your Zen cop   ‘I’m talking to a crazy person’   voice you do. WARD  ...I’m trying to not escalate...  SHERRI For your information, I had an interview this morning. WARD Okay.   That’s good. SHERRI I don’t need you to tell me it’s good.   I won’t fuckin’ get it. WARD How do you know? SHERRI Because I can tell.   Okay?   The woman was a snotty bitch. WARD Keep at it.   Your next interviewer might be a man.   You can shake your six thousand dollar bolt-on-tits at him.  2. SHERRI Way to de-escalate asshole.   We all know I can make more money than your broke ass ever will dancing. So fuck you.   Sophie’s staying at mom’s tonight.   You gotta give her a ride.   And get the fuckin’ fairy. Kill it this time.   Pussy. She grabs her keys and charges out of there. EXT.   WARD’S HOUSE - FRONT YARD - DAY Ward peers through the bars of his shitty Craftsman in South Central LA.   Gangster THUMP emanates from the house next door.   Two Low Riders on the lawn, cabled together.   HOMIES  solemnly   gathered around open hoods. Ward slides the Glock in his pocket.   Grabs a broom.   Steps out into the sunlight -- His neighbor   MIGUEL   clocks him. MIGUEL Good afternoon officer.   We didn’t wake you up? He salutes.   Ward salutes back, on a mission, not slowing down... WARD No, never.   Because bass doesn’t carry at all.   You know that’s bad for the grass.   The cars. MIGUEL Grass grows back.   How’s your old lady? WARD Save up your lunch money and ask her yourself. The Homies sense his venom and wince --   Damnnnn . MIGUEL Yo, that ",
      "dialogue_count": 0,
      "word_count": 1812
    },
    {
      "scene_number": 2,
      "slugline": "EXT.   GRANDMA’S HOUSE - DAY Ward hugs Sophia goodbye.   SHERRI’S MOTHER   looks on, while Jakoby waits with the car.   Ward SEES Sophia’s crying. WARD Hey, Sophia, don’t cry, don’t cry. SOPHIA I don’t want you to die. WARD Honey.   I’m not going to die.   I promise.   Go with Grandma. SOPHIA But mommy said Nick is going to get you killed.  Ward can barely contain his anger.  WARD Mommy’s kidding.   She says silly things sometime. SOPHIA I don’t want you to be dead.   I hate you being a policeman. Everybody hates policemen! Sophia twists away.   Runs crying towards the house.   Ward absorbs the blow for a moment.   When he returns to the car, Jakoby   is gentle with this...  JAKOBY Remind me, partner, why Sherri’s not watching her tonight? WARD She’s got a date. JAKOBY Bro.   Why are you still letting her live with you? WARD You know why. JAKOBY Sophia’s not your daughter. WARD Funny.   Cause it sure fucking feels like she is, Nick.  10.",
      "characters": [],
      "action_text": "JAKOBY I’m sorry.   You know what I mean. I don’t know how to be on your side when you’re not on your side. Ward angrily gets in the car... WARD Save me, Nick.   Save me from all the ex-strippers of the world. EXT.   LAPD STATION - DAY Solidly in the hood.   A black SUV pulls up.   Two Federal Agents step out in black suits.   One is human, he’s all about Gracie Ju-Jitsu and fine tailoring -- This is   MONTEHUGH.  The taller Agent is lithe with striking dark skin and dazzling teal eyes.   LIKE MOST ELVES   his features are nearly  human , if perhaps slightly stretched.   Almost too perfect, barring of course, his pointed ears -- This is   KANDOMERE.  MONTEHUGH It’s, um, rustic here.   I’m sure the inhabitants of this outpost have priceless knowledge to aid us on our quest.  Kandomere cocks an eyebrow at him.  KANDOMERE I apologize there are no local shops with artisanal kale smoothies and organic chicken breast in ten pound servings.   Stay on task. Montehugh glares at Kandomere as they enter the station. MONTEHUGH My gains, bruh.   Never mock my gains. INT.   LAPD STATION - DAY Crammed and with lead paint and peeling asbestos.   Kandomere and Montehugh check in at the front desk.  CAMERA FINDS JAKOBY   -- In a nearby hallway, watching the Agents from the shadows.   Nervous. Kandomere feels Jakoby’s gaze.   Looks over.   Jakoby is already gone.  11.",
      "dialogue_count": 0,
      "word_count": 398
    },
    {
      "scene_number": 3,
      "slugline": "INT.   LAPD STATION - LOCKER ROOM - DAY Cops suit up to protect and serve.   Ward peels the dry cleaning bag off a fresh uniform. WARD Hey, any of you seen my partner?  HICKS ,   a middle aged bulldog of a man, laughs thickly. HICKS Big green dude?   Orange eyes?   Not exactly a Rhodes Scholar?   Why yes. I have seen your   partner .  BROWN , 20s, with fratboy excitability, jumps in... BROWN Hah.   You said partner with airquotes. HICKS See, Ward’s partner is a   peace officer.  BROWN Fucking outstanding.   Airquotes again. HICKS (announces loudly) Anyone have a location on our diversity hire?   He likes to wander. Ward fumes.   POLLARD , late 30s, with the bitter cold demeanor of a broken street cop, mutters this: POLLARD Cops don’t wander.   Pets wander. Ward, you wanna ride with a dog, work K9. They laugh in that stupid, self congratulatory way racists always do.   Ward about to explode...  POLLARD (CONT’D) If I get smoked, gentlemen.   Let the asshole go. BROWN Dude.   I so got you.   Done.  12.",
      "characters": [],
      "action_text": "WARD And now I say fuck you to you. You.   And you. HICKS You know what they say about clan blood. (ominously) Once for the Dark Lord, always for the Dark Lord. WARD How can dumb-asses like you who can’t remember your wife's birthday still have beef against a whole race of people for some shit that went down thousands of years ago? HICKS  Race of people.  BROWN Bam!   Airquotes!   You are the fucking master. Ward spins to about to break Brown’s neck...  BANG-BANG-BANG!   SERGEANT CHING , a badass intelligent female, is pounding on a locker... SERGEANT CHING Hi guys.   If we’re done handing Ward ammo for his inevitable lawsuit against the Department, it’s time to drink in the Captain’s wisdom. INT.   LAPD STATION - ROLL CALL ROOM - DAY The Cops we met sit at tables.   Jakoby and Ward noticeably isolated from the “cool kids”.   Jakoby   whispers to Ward:  JAKOBY I saw feds in the building.   They had an elf and everything.   Think they’re here for me? WARD You’d be suspended already if something was up.   Lay off the energy drinks.  13. JAKOBY Right, man, yeah.  CAPTAIN PEREZ   enters... CAPTAIN PEREZ I’d like to welcome everyone to the latest episode of “We Are All Fucked” starring the PM Watch. Mock cheers and real laughs from the boys and girls. CAPTAIN PEREZ (CONT’D) Tonight we got the trifecta.   Full moon on a Friday night in a Summer heatwave.   The streets will be seriously assholed-up and we’re spread thin as Royce’s comb-over. One of the officers, ROYCE, chuckles. CAPTAIN PEREZ (CONT’D) That means clear your calls fast and help your colleagues clear theirs.   Get me outta this reporting period without another murder, I’ll buy you all coffee. This gets a positive, serious response.   As he rushes off to the next thing...  CAPTAIN PEREZ (CONT’D) Sergeant Ching, all yours. SERGEANT CHING Yessir! A former Marine, she snaps to with her clipboard... SERGEANT CHING (CONT’D) After I call your name, get your shotguns and radios and deploy.   I don’t want to see you h",
      "dialogue_count": 0,
      "word_count": 3625
    },
    {
      "scene_number": 4,
      "slugline": "INT.   SOUTH LA - 341 ABRAMS - DAY Ward is sweating now.   Pacing.   The three corrupt cops are anxious, impatient... WARD This isn’t happening, this isn’t fucking happening, this is a dream, man.   This is a bad dream. SERGEANT CHING Pollard, he’s spinning. POLLARD He’s fine.   Let him catch up to it. WARD I’m not catchin’ up to shit.   You don’t know magic!   People will die! Ward shoves Pollard.   Sgt. Ching gets in between them... SERGEANT CHING Whoa.   Easy.   Bring it down. POLLARD Fuck this.   Ward, lemme reframe this.   Want your little girl to not have a father   AND   Jakoby dies?   Or just Jakoby dies?   Because you’re in fuckin fantasy land if you think you’re walking outta here with life as you know it intact. WARD You threatening me motherfucker? HICKS I think he just caught up to it. POLLARD Who means more to you?   Your little girl or your pet monster?   We’re leaving with the wand.   You wanna go home tonight?   The orc dies either way.   End of story.  There’s a brutal silence.   We hear the flies buzzing.   The whine of the old light bulbs.   Hicks is smooth as Satan... HICKS Use your gun.   The kid got your gun away from you.   And shot Jakoby with it.   Right out front there.  31.",
      "characters": [],
      "action_text": "WARD How’s a little elf girl gonna disarm me? HICKS The kid was the bright.   The kid got away.   The kid disappeared. WARD No ... come on... POLLARD We got people coming to help. People who know how to fix things. This will work out good for you. Pollard puts a brotherly arm around Ward... POLLARD (CONT’D) You’re not making the decision, okay?   The situation is making the decision for you.   It’s not your fault.   It’s just how things worked out. SGT. CHING Enough bullshit.   You or him. WARD Fuck!   Shit! Ward takes a deep breath.   We see him slowly realize there’s no way out...  HICKS Perfect storm, bro.   It’s a perfect storm. EXT.   SOUTH LA - 341 ABRAMS - DAY Ward bursts out door, walking with purpose towards Jakoby. JAKOBY Hey man, where the fuck is everyone?   We don’t have a perimeter.   I think that pee-wee gangster saw the wand.   And the Elf kid’s hell’a spooked.   Saying someone’s coming back and shit. Jakoby notices Ward can’t face him...  32. JAKOBY (CONT’D) What’s wrong? WARD You let that kid go because he was clan blood.   Admit it. JAKOBY What the fuck are you doing right now?   What is this? WARD  Tell me now!  Ward shoves Jakoby, who snarls. JAKOBY Don’t put your hands on me.  ON THE HOUSE   -- Sgt. Ching, Hicks, Pollard drift outside. Watching from a distance.   Hicks holds the wand... WARD You fucked me!   You fucked us both! You stupid piece of green shit! Ward shoves him again.   Jakoby growls at him, menacing like a Doberman, frightening and animalistic.   Ward gets in his face, pressing foreheads... WARD (CONT’D) You fucked my fucking life for some thugged out punk ass Orc fuck. JAKOBY Fuck you.   Fuck off. Jakoby snarls.   Now clearly dangerous.   He doesn’t notice Ward flip the release on his holster... WARD You fucked yourself more.   Shit comes back, motherfucker.   Ready you fucking pigface piece of shit? Here it comes... JAKOBY (snapping)  Okay!   I let him go!   Is that what you fucking wanted to hear?  33. WARD I knew it, I fuckin",
      "dialogue_count": 0,
      "word_count": 1956
    },
    {
      "scene_number": 5,
      "slugline": "EXT.   SOUTH LA - 341 ABRAMS - NIGHT The sky is hesitant to release the day, its final soft blue glow recedes from the darkness.   It’s unnaturally quiet on this evil isolated little street...  HIDDEN ON THE PORCH   -- Pollard, in agony, trying to dial his iPhone.   It’s maddening to work a touch screen through so much blood.   He hears an SUV pull up.   FOOTSTEPS approach. He sets down his cell.   Grabs his gun...  GIBSON   crosses to the house.   Stops to pick up WARD’S GUN. She could be 20 or 40.   Her age and gender are a mystery. But she’s clearly an apex predator.   Everything she does is weighted with thought, meaning and intent, down to the smallest movement. She steps over the bodies of Sergeant Ching and Hicks. Behind her are SLASHER   and COWBOY ,   with carbines and body armor.   They have that Special Forces vibe, a couple hundred confirmed kills between them. Gibson stepping, Pollard slumps with relief... POLLARD Gibson?   Thank fuck. She turns to her muscle... GIBSON Get him inside. INT.   341 ABRAMS - KITCHEN - NIGHT Pollard sits at the kitchen table.   Slasher and Cowboy regard the hole blown in the wall.   Pollard groans in pain.   Gibson studies him silently for a time.   Then sits across from him. GIBSON You going to be all right? POLLARD What?   Fuck no, I’m ...   help me.  GIBSON Of course.   Help is coming. (beat) Where’s the wand? POLLARD They took it ... they took it ... fuckers shot me!  41.",
      "characters": [],
      "action_text": "GIBSON Describe it. POLLARD What? GIBSON The wand.   Describe it. POLLARD S’white ... gold ... black handle. GIBSON “They” who took it are... (reading off her phone) Scott Ward and Jakoby the Orc?   Is that correct? POLLARD That’s...that’s right...Local gangsters chased them off. GIBSON Humans? POLLARD Yeah.   Hispanic gang. GIBSON Do they know about the wand? Pollard just groans.   Gibson turns to Slasher and Cowboy. GIBSON (CONT’D) Priority one is to secure that wand.   It might be with the gang. It might be with the cops. Gibson thinking as Pollard bleeds on the floor.   Drip.   Drip. Drip... GIBSON (CONT’D) Are there GPS units in your patrol vehicles? POLLARD Yes. GIBSON We’ll find him that way. (to Cowboy and Slasher) Get on the bodies.  42. Cowboy and Slasher quickly exit.   She shows Ward’s Glock to Pollard... GIBSON (CONT’D) Is this the weapon Ward used? POLLARD Yeah.  BAM!   -- Gibson shoots Pollard in the head. EXT.   SOUTH LA - 341 ABRAMS - NIGHT Slasher rolls Ching’s body in a carpet.   Another rolled up carpet presumably contains Hicks.   Cowboy uses a metal detector to locate shell casings from Ward's gun... Gibson exits.   Looking around.   Scanning for prey.   Feels someone watching her.   Spins to SEE SOMEONE duck behind the curtains of the little house across the street... EXT.   SOUTH LA - OLD MAN’S HOUSE - NIGHT Gibson KNOCKS -- Holds an LAPD badge to the window. GIBSON Police!   LAPD! The door opens.   Still chained.   An   OLD MAN   peers at her... GIBSON (SPANISH) (CONT’D) I need to ask you some questions. You can talk to me here, or talk to me downtown. The door closes.   The chain is removed.   It opens again. INT.   OLD MAN’S HOUSE - 5 MINUTES LATER - NIGHT The OLD MAN and   OLD WOMAN   clearly want no part of this.   But are cooperating.   Gibson takes notes... GIBSON (SPANISH) The police were shooting at each other? OLD MAN (SPANISH) We’ve lived here for thirty years, and never seen that.  43. GIBSON (SPANISH) Who shot the other police?  ",
      "dialogue_count": 0,
      "word_count": 1759
    },
    {
      "scene_number": 6,
      "slugline": "EXT.   SOUTH LA - GARAGE HOUSE - NIGHT The Pitbulls strain against their chains as ten armed VETERANOS stare at the garage door.   Poison picks up the lock.   Turns to the others with a finger over his lips. POISON  ...shhhh...  Nods for a Veterano to open the door.   Guns are raised... INT.   GARAGE HOUSE - NIGHT (SAME TIME) Jakoby and Ward enter the connected house from the back of the garage with Tikka in tow and silently clear the dark house.   They startle a Latina   SINGLE MOM   in her pajamas... SINGLE MOM  Por favor, no me hagan daño.  WARD  Calmate.   No le vamos a hacer nada.  In a carseat on the table, her Baby starts CRYING.   Ward and Jakoby exchange a look.   Tikka alert with fear. WARD (CONT’D)  Que callas al bebe por favor.  The gangsters outside circle like jackals -- Their menacing SHADOWS sweeping across the curtains.   They are being surrounded -- Now the Baby starts SCREAMING. WARD (CONT’D)  Muevate.  The woman grabs her baby from the carseat.   The Baby SCREAMS EVEN LOUDER... WARD (CONT’D)  Que callas al bebe.   Shut your fucking baby up right now, shut it up right now. SINGLE MOM  Lo siento.   Perdoname.  WARD Don’t fucking apologize, lady. Shut your fucking kid up right now. She frantically shushes the baby.   Impossibly the baby HOWLS louder and LOUDER.   The tension unbearable.  50.",
      "characters": [],
      "action_text": "Jakoby looks to Ward, frantic.   Acting on pure instinct, Ward  pushes the woman to the ground...  WARD (CONT’D) Stay low, don’t m--  BRDDDDDDT!   BAM-BAM-BAM-BAM-BAM!   The gangsters open fire on the house.   Windows explode.   Bullets rip through the walls.  WARD (CONT’D) We’re not stayin here and getting them killed.   Move!   Move! With bullets SMASHING all around them, Ward and Jakoby make a break for the back door with Tikka in tow... EXT.   GARAGE HOUSE - BACKYARD - NIGHT (SAME TIME) Jakoby nearly takes the back door off its hinges.   A VETERANO is right there!   He opens fire --   POP-POP-POP! KABOOM!   -- Jakoby fires the shotgun.   Shredding the fucker. Ward covers Tikka’s eyes so she doesn’t see the body.   Jakoby jumps a fence.   Ward hands him Tikka and follows... EXT.   SOUTH LA - LONG ALLEY - NIGHT (SAME TIME) Veteranos YELLING.   WHISTLING.   Ward and Jakoby running. Jakoby holding Tikka.   Two Veteranos vault the fence into the alley and open fire --   POP-POP-POP-POP!  Ward stops.   Draws and aims.   Bullets ZIP past his head. Ward focuses on breathing.   Sight picture.   Trigger squeeze.  BAM-BAM!   -- The two Veteranos drop with headshots.   Say what you want about Ward but the dude’s a natural born gunfighter. He runs to catch up to Jakoby... EXT.   SOUTH LA - ANOTHER STREET - NIGHT (SAME TIME) Jakoby and Ward running.   Tikka in Jakoby’s arms.   We hear the WHISTLES and SHOUTS of the angry storm of Gangsters intercepting them...  UP THE STREET   -- Is a raucous HOUSE PARTY.   Bass THUMPS. Vapes glow.   40’s are drained.   Girls in underwear are hosed down.   Fun and games to escape the heat.  WARD  There, go go!  51. They cut towards the party.   Tikka SCREAMS in warning... BEHIND THEM -- Ten Altamira Soldiers explode out of the alley behind them.   Sprinting like cheetahs on the Serengeti. Cheetahs with guns -- POP-POP-POP-POP!  Ward stops and turns to return fire --   THWAP!   --   HE’S IMMEDIATELY SPUN BY A BULLET HITTING HIS LEFT ARM.  WARD",
      "dialogue_count": 0,
      "word_count": 746
    },
    {
      "scene_number": 7,
      "slugline": "EXT.   SOUTH LA - FOGTEETH PARTY HOUSE - BACKYARD - NIGHT Jakoby crashes out the back door dragging a blinded and bloodied Ward and a screaming Tikka.   Livid pepper sprayed Orcs following him out...  KABOOM!   -- Jakoby fires the shotgun in the air and growls something in ORKISH.   Stalling their pursuers.   He scoops up Tikka and hauls Ward through the back gate into another alley.   They disappear into the night...  EXT.   SOUTH LA - INTERSECTION - NIGHT Cowboy and Slasher regarding the wrecked black and white. Gibsons circling it in silence.   She looks up, studies the houses.   Measuring time and distance in her mind.   She notices something on the ground.   Crosses to it... Footprints -- In black iridescent blood, like gasoline. SLASHER What’s up, Gibson? GIBSON The bright.   Looking for the wand. SLASHER This change anything? GIBSON Yes.   We’re not the biggest shark in the water.   So we have to be the smartest. EXT.   SOUTH LA - DEAD END STREET - NIGHT Kandomere KNOCKS on the back of an old plumbing van hidden in the shadows.   Nothing.   Grabs door handle.   The door falls off CLATTERING to the street...  Revealing two OBLITERATED BODIES inside!   The first has been blasted into what looks like red spider-webs.   The other is shattered like glass.   It’s clear from the equipment racks it’s a SURVEILLANCE VAN.   Montehugh joins Kandomere, holding two assault rifles... KANDOMERE The bright was here. Montehugh tosses Kandomere a rifle.   The hair stands up on the back of his neck when he SEES his colleagues are now modern art displays...  53.",
      "characters": [],
      "action_text": "MONTEHUGH Lemme get local PD down here to contain the area. KANDOMERE Take a beat on that.   Until we know who’s who and what’s what. They’re a few houses up 341 Abrams -- Kandomere steps out into the street and SEES parked black and white just visible. Nods for Montehugh to follow... EXT.   SOUTH LA - 341 ABRAMS - NIGHT Kandomere and Montehugh approach on foot, cautious, rifles in low ready position.   They SEE BROWN, the fratboy cop from the station.   Talking on his cell.   He quickly hangs up...  KANDOMERE What do you got? BROWN Sir this is LAPD business, we have an active crime scene. KANDOMERE (flashing badge) Homeland Security Magic Task Force. It’s my crime scene now. BROWN Sorry, sir.   Uh.   Yes.   Sure.   But look, it’s all fucked. KANDOMERE Mind if we drill down a bit on what you mean by ‘fucked’? BROWN There was a shooting between the responding officers.   I got three dead cops.   Two more missing.   A dead couple with gunshot wounds across the street.   Four bodies inside.   And someone staging and cleaning the crime scene.   That’s what I meant by fucked, sir. KANDOMERE Where’s the bright come into this?  54. BROWN The four bodies from the original call are magicked the fuck up. (then) Who called you? KANDOMERE This is a Shield Of Light safehouse.   An extremist group convinced the Dark Lord will return and initiate a second Age of Magic. BROWN The crazy ass conspiracy theorists? They just hand out fliers on the corner.   It’s bullshit. KANDOMERE Right.   Until someone kills four of them and the two Agents surveilling them with a magic wand.   Then, I’m not so sure. BROWN  You guys been watching this place?  MONTEHUGH Agent Kandomere? He nods for him to join him.   Out of earshot.   For all of Kandomere’s Elvish wisdom and intellect, he’s not streetsmart like Montehugh. MONTEHUGH (CONT’D) Hey.   We gotta get Vance’s people down here right the fuck now and lock this place down.   Local PD’s got some dirty ass Rampart shit going down.   There’s a wand ",
      "dialogue_count": 0,
      "word_count": 640
    },
    {
      "scene_number": 8,
      "slugline": "INT.   TASK FORCE LOCKER ROOM - NIGHT (SAME TIME) A dozen Federal Swat Operators towel off, overdo Axe body spray, comb their hair carefully.   It’s Friday night and time to slay it in the bars after a long training day.   GORDON VANCE, Alpha of these Alphas, grabs his RINGING cell... GORDON VANCE Vance. KANDOMERE Where are you? GORDON VANCE Up at the facility.   We’re punching out for the day. KANDOMERE No you’re not.   Shit went down at the Shield of Light House we’ve been watching.   The bright killed everyone inside and killed my men monitoring the place.   The bright’s here.   Here in LA. GORDON VANCE Aw fuck, man. KANDOMERE LAPD’s all twisted up in this.   I’m behind enemy lines with no back-up. You’re it.   Get down here.   At the speed of light. GORDON VANCE We’re in fucking Lancaster, boss. It’s gonna be while.   Stay safe and hang on. Vance hangs up.   SIGHS.   Turns to the boys... GORDON VANCE (CONT’D) Suit back up!   We got a magic user on the street.   Grab your gear and get on the road! Their REACTIONS say it all.   A bright?   Magic user?   They know people are going to die tonight...  END INTERCUT: Kandomere hangs up.   Worry etched on his face.  56.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 207
    },
    {
      "scene_number": 9,
      "slugline": "INT.   341 ABRAMS - NIGHT Kandomere and Montehugh looking through the mess... MONTEHUGH We got the two bodies in the kitchen and the one in back the bright wanded.   The guy the first responders shot.   We know the Elf Girl was taken. KANDOMERE Someone’s missing. Kandomere charges upstairs with Montehugh in tow... INT.   341 ABRAMS - UPSTAIRS HALL - NIGHT Kandomere studies the walls... MONTEHUGH We searched up here. KANDOMERE I hear a candle burning. He pulls down a bookcase revealing a hidden door.   He draws a pistol open it.   Revealing... INT.   341 ABRAMS - SHRINE ROOM - NIGHT A single candle burns on an altar.   Various magic relics and scrolls.   On the floor is a dead human --   His upper body has been turned to solid gold!   Montehugh blinks... KANDOMERE They’re training a bright. BEHIND THEM -- Is Brown.   Gold fever in his greedy eyes... MONTEHUGH Get the fuck outta here.   That’s evidence. BROWN Evidence?   Looks like a house in Big Bear and a new Tesla to me. Kandomere and Montehugh give him withering looks.   Brown just smiles and backs away... WE FOLLOW BROWN -- As he pulls his cell and dials...  57.",
      "characters": [],
      "action_text": "BROWN (CONT’D) (into phone) Get down here right now.   I found something interesting. INT.   GAS STATION - NIGHT Jakoby sets water bottles on the counter.   Looking just beat to shit.   Smiles at the   CLERK , a hardass Korean man behind Plexiglas.   Jakoby grabs a handful of candybars. CLERK Are you a real cop? JAKOBY Yeah.   I’m a real cop. CLERK But you’re green. JAKOBY I’m blue.   Cops are blue. Jakoby pays the man. INT.   SHERRI’S MOM’S HOUSE - LIVING ROOM - NIGHT Ward's daughter Sophia lays under a blanket with a flashlight.   Drawing a picture with crayons.   Her grandmother pulls the blanket aside. SHERRI’S MOTHER You’re supposed to be sleeping young lady. SOPHIA I’m making daddy a card. She shows grandma a crude drawing of Ward, Jakoby and herself under a smiling sun.   It reads: “SORRY I WAS MEAN DADDY I LOVE YOU SO MUCH EVERYTHING WILL BE OK!” EXT.   GAS STATION - ROUND BACK - NIGHT Jakoby gives Ward a water.   Tikka curled up, asleep. JAKOBY How the fuck is she sleeping?  58. WARD Adrenaline dump.   She shut right down.   Sophia does it too. Jakoby sits.   He and Ward tap waters --   “Cheers”  JAKOBY Your arm okay? WARD My arm’s fucked. JAKOBY Can you move it? WARD I can move it. JAKOBY Bro.   Running into a Fogteeth party?   Man, I don’t know about that.   That was a bad move. WARD  I didn’t deploy pepper spray.  JAKOBY I’m just saying, Orcs hold grudges. (then) That crazy homeless fucker we hooked this afternoon?   Remember what all he was saying?   Like you think there’s a chance we’re ... in a prophecy right now? WARD It was just a coincidence.   Shit happens.   Shit is happening. (a beat, sadly) You know there’s no way we’re still cops after this. JAKOBY  ...are you sure..?  Yeah.   He’s sure.   Jakoby visibly sags.   He needs hope.  JAKOBY (CONT’D) Why choose me as your partner?   I mean, no one wanted to work with me.   But you did. WARD I dunno man.   You seemed cool.  59. JAKOBY I couldn’t believe it ‘cause to me you were like, you know.   You’r",
      "dialogue_count": 0,
      "word_count": 6857
    },
    {
      "scene_number": 10,
      "slugline": "INT.   341 ABRAMS - KITCHEN - NIGHT (SAME TIME) Ward heard them.   Gibson heard them...  WARD So ... do you have a new plan? Gibson doesn’t waver.   Tikka moaning in pain on the floor. Ward slides a hand towards the pocket on his thigh where the wand is stashed... WARD (CONT’D) The second she lowers that gun even an inch you kill her Nick. JAKOBY Roger that, partner. Gibson regards Jakoby.   Looks back at Ward.   SEES Ward now holds the wand... GIBSON Interesting.   Now put it down. WARD  No . GIBSON You’re either born a bright or you study for years.   Are you a bright? No.   Do you know any spells?   No. Try to use that wand and it will kill you. WARD Shut up. GIBSON There’s no way out.   Give me the wand while this little creature is still breathing. WARD Nick.   Get Tikka out of here. GIBSON No, Orc.   You don’t move. Jakoby, still aiming his gun at Gibson, slowly moves into the kitchen, towards Tikka... GIBSON (CONT’D)  Don’t move another fucking inch.  88.",
      "characters": [
        "KANDOMERE"
      ],
      "action_text": "Jakoby stops.   The shotgun shakes in his hands... WARD Nick.   It’s okay.   Get Tikka. JAKOBY What are you doing, Scott? WARD It’s gonna be okay. GIBSON Listen to your Orc. JAKOBY  What are you doing?  Ward smiles at his friend.   Quietly... WARD It’s like you said.   It’s a prophecy.   It’s all a prophecy. JAKOBY You really believe that? WARD No.   So I need you to believe it for me. (then) Get Tikka out of here. GIBSON You’ll do no such thing. (to Ward) Imagine sitting in front of a candle day and night for years. Learning the stillness of mind a wand requires.   Years of repeating the same spells.   Precise articulations of ancient word forms. Tikka, looking at Gibson, realizes something.   At the same time Ward does...  WARD ...you’re a bright... NEW ANGLE -- Slasher steps through the hole into the kitchen. Weapon trained on Jakoby.   Softly whispers...  89. SLASHER Easy friend.   I got the drop on you.   Let’s not have any mistakes here.   I need you to slowly lower your weapon. Jakoby knows he fucked up... JAKOBY What do I do? WARD Don’t you dare lower that shotgun. Gibson takes a step towards Ward... WARD (CONT’D) Stop. JAKOBY ... Scott..?  EXT.   SOUTH LA - 341 ABRAMS - BACK YARD - NIGHT (SAME TIME) The Assault Team creeps up -- THEY SEE Slasher in the kitchen through the hole in the wall... INT.   341 ABRAMS - KITCHEN - NIGHT (SAME TIME) Gibson’s eyes bore in on Ward... GIBSON It’s over.   It’s hopeless. WARD  SHUT THE FUCK UP!  NOW.   EVERYTHING.   HAPPENS.   AT.   ONCE...  POP-POP!   -- Slasher is shot in the back by the Assaulters... Jakoby fires his shotgun at Gibson --   KABOOM!  ...just as Slasher falls onto him, knocking his aim askew... ...so he only blows out a chunk of wall by Gibson’s head. Who swings her carbine from Tikka to Ward...  WARD SPRINGS TO HIS FEET AND SCREAMS:  WARD (CONT’D)  TALIOS!  90. THE FUCKING ROOM EXPLODES INTO LIGHT.   The wand BLOWS APART INTO A FOUNTAIN OF FIRE, VIOLENTLY LAUNCHING WARD BACKWARDS INTO THE WALL... A LIQUID",
      "dialogue_count": 1,
      "word_count": 1754
    }
  ]
}