{
  "slug": "brooklyn-nine-nine-111-christmas-2013",
  "title": "brooklyn nine nine 111 christmas",
  "genre": "action",
  "format": "series",
  "scenes_count": 2,
  "characters_count": 0,
  "characters": [],
  "total_words": 5174,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. COPY ROOM - LATER (D2) 6   6  Charles walks up to Gina. CHARLES Hey, my flight is at eight tonight.   It’s domestic.   Do you think I’ll be safe if I get to the airport five hours early? GINA I would give yourself at least seven. Charles nods: “You’re right.” GINA (CONT’D) Why are you going on a singles cruise anyway?   I thought you were into Rosa. CHARLES Well, I am.   But I’ve begun to feel like there is a small chance Rosa may not love me back. INT. BULLPEN - ROSA’S DESK - FLASHBACK - THREE WEEKS AGO(FBD) 7   7  Charles walks up to Rosa. CHARLES Hey, you wanna grab some dinner tonight? ROSA That’s nice.   And I like you as a person. But I’m just not interested in you romantically. CHARLES Coolio. He heads off. INT. BULLPEN - ROSA’S DESK - FLASHBACK - TWO WEEKS AGO (FBD) 8   8  Charles and Rosa. CHARLES Whattaya say we grab a drink? ROSA Again: that’s sweet.   But I’m not into you that way, and I have a boyfriend. CHARLES Gotcha!   Raincheck.  BROOKLYN NINE-NINE   \"Christmas\"   Pink Revised Pages   10/15/13   6.",
      "characters": [],
      "action_text": "He spins on his heels and walks off. INT. ROSA’S DESK - FLASHBACK - FIVE DAYS AGO (FBD) 9   9  Charles hands Rosa A ROSE. CHARLES A rose for Rosa.   You know, romantic chemistry is really -- ROSA -- something that I have with my boyfriend. (grabs his face) Listen to me: the healthy thing for you to do is move on. CHARLES (sotto) Your touch is electric. ROSA Move.   On. INT. BULLPEN - GINA’S DESK - BACK TO SCENE (D2) 10   10  CHARLES So we’ve both decided that the healthy thing for me to do is move on. GINA I’m impressed, Boyle.   That’s very mature. CHARLES Thanks.   You know, I kind of just realized-- GINA Oh I’m sorry, that wasn’t an invitation to keep talking. CHARLES Gotcha.   Raincheck on that convo. He heads off. INT. BRIEFING ROOM - MOMENTS LATER (D2) 11   11  The room is also decked out for Christmas.   Amy addresses Rosa, Terry, Charles, Gina, Hitchcock and Scully.  BROOKLYN NINE-NINE   \"Christmas\"   Pink Revised Pages   10/15/13   7.  CONTINUED: 8   8 AMY Peralta’s busy, so let’s just get started.   Now, the captain won’t allow us to give him all the presents we bought him-- ROSA You’re the only one who did that. AMY --but, we can make him the greatest Christmas card of all time!   We’re going to wear Santa hats and big sweaters and take a picture of all of us in a line-up. TERRY Sorry, Santiago, I don’t have time for that.   My psych evaluation is today. They’re gonna decide if I’m ready to go back on the streets. GINA Why do you care what they think? Psychologists are just people who weren’t smart enough to be psychics. AMY Don’t worry, Sergeant -- we’ll add you in later. CHARLES Uh, I have to go, too.   My flight’s in... (looks at watch, nervous) Oh boy.   Eight hours.   I can make it, I’ll just buy a sandwich on the plane. ROSA So, if Boyle, Peralta, and the sergeant are out-- AMY Gah, fine, everyone just go. Everyone starts to file out. GINA I could take a picture of myself dressed as an elf.   Elfie-selfie! Amy thinks...  **SCENES OMITTED** 12,13   1",
      "dialogue_count": 0,
      "word_count": 561
    },
    {
      "scene_number": 2,
      "slugline": "INT. HOLT’S OFFICE (D2) 14   14  Holt types. HOLT Are you going to sit there all day? Reveal: Jake sits in a chair behind Holt. JAKE Affirmative, Stone Eagle.   That’s the Secret Service codename I gave you.   I’m just doing my job: watching, protecting, bossing you around.   Now, for your safety, please open your internet browser and search for the words “pig” plus “jet skis.”   That’s an order. Holt gets up. JAKE (CONT’D) Whoa whoa whoa -- where are you going, Cold Mountain?   I changed your codename. HOLT To use the restroom. JAKE I’m only asking this for your safety: is it a number one or number two? (off his angry stare) Your silence indicates number two. Jake heads to the door, opens it a tiny crack and peers out. JAKE (CONT’D) Coast is clear, sir.   Go go go! Holt slowly walks out.   Jake watches him go. JAKE (CONT’D) (into his wrist) Cold Mountain is on the move.   Cold Mountain is rolling to the can. INT. POLICE PSYCHIATRIST’S OFFICE - LATER (D2) A15   A15  Terry and a straight-laced psychiatrist, HILLARY BERGNER. HILLARY Okay, Sergeant Jeffords, thank you for coming in.   We’re here to assess your readiness for active duty.  BROOKLYN NINE-NINE   \"Christmas\"   Pink Revised Pages   10/15/13   9.  (MORE)",
      "characters": [],
      "action_text": "If all goes well, I’ll stamp the release form and you can go back in the field. TERRY I think I’m ready.   I’m no longer fixating on my fears. HILLARY Good, good.   But today, let’s fixate on those fears. TERRY Okay.   That sounds... fun. HILLARY Let’s begin by talking about your baby girls, and your wife, and what would happen to all of them if you died in the line of duty? We hear a POP.   REVEAL: Terry has HUG-CRUSHED A PILLOW that was on the couch.   There is stuffing on him. TERRY ...I popped your pillow. INT. HOLT’S CAR - LATER (D2) 15   15  Captain Holt puts his car into REVERSE and starts to pull out, when suddenly he SLAMS on the brakes, because... EXT. PRECINCT PARKING LOT (D2) 16   16  Jake stands behind Holt’s car.   Holt gets out. JAKE Well well well.   We meet again.   Where exactly do you think you’re going? HOLT Your constant hovering is going to draw attention to the situation.   The last thing I want is for the rest of the precinct to get involved.   I’m going home to work in peace. JAKE Negative, Ice Veins -- I changed your code name again -- you’re not going anywhere. HOLT Do you know why I picked you to be my security escort?  BROOKLYN NINE-NINE   \"Christmas\"   Pink Revised Pages   10/15/13   10.  CONTINUED: A15   A15  HILLARY (CONT'D) JAKE Because I am a 21st century Sherlock Holmes.   Boyle is my Watson, and Santiago is my Moriarty.   I will defeat her. HOLT I chose you because the threat is not real, and I thought you’d have no problem breaking the rules and letting me do my work.   Now, let me go. JAKE Okay.   But your house is off-limits -- protocol.   If you really want to get out of here, we can go to my mom’s place. (off Holt’s look) Or, I can lock in you the holding cell with an armed escort.   Totally your call. Holt sighs, reluctant. HOLT Fine.   We will go to your mother’s place. I guess I am curious to see where... (waves in Jake’s general area) ...this all started. JAKE You’ll love it.   She has a great internet connection.   Not b",
      "dialogue_count": 0,
      "word_count": 4613
    }
  ]
}