{
  "slug": "brooklyn-nine-nine-113-the-bet-2014",
  "title": "brooklyn nine nine 113 the bet",
  "genre": "action",
  "format": "series",
  "scenes_count": 3,
  "characters_count": 0,
  "characters": [],
  "total_words": 4875,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. HOLT’S OFFICE - LATER (D2) 17   17  Terry enters.   Holt sits at his desk. HOLT Sergeant Jeffords, I’m honored to give you back your gun.   You are officially cleared for active duty. Holt solemnly presents TERRY’S GUN to him.   Terry takes it with equal gravitas. TERRY Thank you, sir.   It’s good to be back. HOLT I sent Gina out to get a congratulatory card. He hands Terry A CARD. TERRY “Through rain, hail, sleet, and snow, you never fail to deliver.   Thanks for being a great mailwoman.” HOLT She did not look very hard.   But you   *  understand the sentiment.   *  TERRY   *  Yes, sir.   I assure you, I can’t wait to   *  get out there and kick crime in the ass.   *  Terry’s phone RINGS.   Holt nods at him and he picks it up. TERRY Hey baby.   Yeah, I can do a quick story. (to Holt, hushed) At nap time, I tell my twins about a tiny princess who rides on a sparrow’s back. HOLT   *  Childhood is a time of whimsy. Dismissed. INT. BULLPEN - LATER (D2) 18   18  Amy hurries in with A PERP in tow.   She is out of breath. AMY Ladies and Gentlemen, I present Carl Laudson, who stole 3000 dollars! Santiago takes the lead with one minute left!   Suck it, Peralta!  BROOKLYN NINE-NINE   \"The Bet\"   Shooting Draft   10/25/13   10.",
      "characters": [],
      "action_text": "JAKE (unconcerned) Oh no. AMY That’s right ‘oh no’-- (realizing) Oh no, you don’t seem worried.   Why aren’t you worried? JAKE Bring in the johns! Jake stands.   A UNIFORMED COP brings in TEN JOHNS. JAKE I ran a prostitution sting through Vice, and arrested thirty guys for soliciting. AMY That’s not a felony. JAKE It is if it’s your second offense.   Which is the case for ten of these gentlemen. Little trivia -- four of them are actually named John!   Ironic.   Anyhoo, ten more for Peralta.   Accept your fate! AMY Never!   *  JAKE Five... four... three... two... one! It’s over.   Jake wins!   Amy loses! He hits play on A BOOMBOX: “Celebrate” by Kool & the Gang PLAYS.   Jake’s given everyone noisemakers, confetti, etc.   He flips the DRY ERASE BOARD, it reads: “PERALTA WINS.”   Amy sits, defeated.   Jake drops to one knee and produces A RING. JAKE Amy Santiago, you have made me the happiest man on Earth.   Will you go on the worst date ever with me?   You have to   *  say yes! AMY ...Yes. JAKE She said yes!   She said yes!  END ACT ONE  BROOKLYN NINE-NINE   \"The Bet\"   Shooting Draft   10/25/13   11.  CONTINUED: 18   18 ACT TWO  EXT. AMY’S STOOP - THAT NIGHT (N2) 19   19  Jake is in his Mustang.   He lays on his HORN, yelling. NEIGHBORS and PASSERS-BY stop and look, annoyed. JAKE Amy Santiago!   Date Time!   Time to date! (to a passing gawker) Hi there.   Sorry, I’m taken.   The woman who lives in that apartment loves me. Amy sticks her head out the door. AMY Peralta, this outfit is ridiculous. JAKE Should’ve thought of that before you spent all year losing our bet.   Chop chop, there’s a lot of embarrassing to do and not a lot of hours to do it in. Jake lays on his HORN again.   Amy exits.   She is wearing a very puffy, bright blue dress with a big bow on the butt. She looks like she just stepped out of a ‘90s Bat Mitzvah. AMY Happy? JAKE Yes!   You look like every girl I ever had a crush on at every Bat Mitzvah.   Let me see the bow. She turns around. JAKE Just lik",
      "dialogue_count": 0,
      "word_count": 1701
    },
    {
      "scene_number": 2,
      "slugline": "INT. BAR - FLASHBACK - 20 MINUTES AGO (N2) 28   28  Charles talks to Hitchcock. CHARLES I sometimes worry I’m going to become you. INT. BAR - BACK TO SCENE (N2) 29   29  ROSA He keeps saying he wants to talk to me. I’m afraid he’s going to tell me he loves me or propose or something. GINA He should smelt the bullets from his butt and make you a ring. (fanning her eyes) Oh my god, I’m gonna cry... ROSA Boyle dove in front of those bullets for me.   I can’t be mean to him -- I watched him make coffee for 28 minutes this morning.   But I also don’t want to lead him on... GINA Well, Holt told me not to let him get hurt tonight, so I will keep him away from you.  Charles walks up.   Rosa scurries away. CHARLES Have you seen Rosa? GINA Rosa died eight years ago.   Let’s get you a drink. INT. BAR - SAME (N2) 30   30  Jake stands in the center of the bar. JAKE Attention, everyone!   We are about to leave, but now, for the first time as winner and loser, Santiago and I will perform the steerage jig from the film, “Titanic,” which we have in no way practiced. A POLKA starts playing.   Charles asides to Jake:  BROOKLYN NINE-NINE   \"The Bet\"   Shooting Draft   10/25/13   18.",
      "characters": [],
      "action_text": "CHARLES Romantic. JAKE No.   Embarrassing.  (then, to the crowd) Please note, when Amy blushes, it starts at the tippy-top of her ears so watch for that! Jake walks up to Amy and starts spinning her around. AMY I hate your guts. JAKE Channel that passion into the dance, baby. HOLT Peralta. Holt motions for Jake. JAKE Scully.   Tag in. SCULLY Okay! Jake crosses to Holt.   Scully starts jigging his ass off around Amy.   Scully and Amy’s dance plays out in the background during the following: HOLT One of our informants just called.   We’ve been tracking a crew that lifts cargo from Laguardia.   The CI knows where the trucks unload, and I need you to go stake out the drop-site. Jake looks over to Amy dancing... JAKE Sir, I’m right in the middle of this date and I can’t reschedule.   I have far, far too many non-refundable deposits.   I’m renting a tiger cub by the hour! HOLT For what?  BROOKLYN NINE-NINE   \"The Bet\"   Shooting Draft   10/25/13   19.  CONTINUED: 30   30 JAKE Don’t even know.   Waiting for inspiration. HOLT This is not a negotiation.   Go. JAKE Fine.   But I’m taking Santiago, so the minute we’re done we’re back to the date. (to Amy) Darling?   Brief pause.   Duty calls. AMY Thank god. They head out. SCULLY Gina!   Tag in! GINA Not even if it would cure cancer.  END ACT TWO  BROOKLYN NINE-NINE   \"The Bet\"   Shooting Draft   10/25/13   20.  CONTINUED: (2) 30   30 ACT THREE  EXT. WAREHOUSE ALLEY IN BROOKLYN - ESTABLISHING (N2) 31   31   *  INT. JAKE’S CAR - NIGHT (N2) 32   32  Jake and Amy are back in their regular clothes.   They sit in the car.   Jake looks through BINOCULARS. AMY I’m so happy to be out of that dress.   It was weirdly hot. JAKE Oh yeah, it was a cotton-plastic blend. But don’t get too comfortable.   We’re gonna catch these guys and get right back to the worst night of your life. Jake reads a text on his phone. JAKE Ugh.   I have to cancel our theater reservation. AMY I don’t even want to know. JAKE Then I’ll tell you!   It was an interact",
      "dialogue_count": 0,
      "word_count": 692
    },
    {
      "scene_number": 3,
      "slugline": "EXT. JAKE’S CAR - BACK TO SCENE (N2) B33   B33   *  JAKE   *  It’s gonna be great.   For me and the   *  kids.   They get to stay up so late!   *  A TRUCK pulls up.   Jake and Amy perk up... but it rolls on. JAKE Is that the truck?   Please let it be-- Nope.   “Artisanal Soft Serve.”   Thanks a lot, Brooklyn! INT. BAR - SAME (N2) 33   33  Terry and Sharon talk it out at a quiet corner table. SHARON Why would you go back in the field and not tell me? TERRY You don’t tell me everything you do. Like when you bought our girls those fur vests! SHARON You love those vests! TERRY Yeah, because they’re adorable!   But I wasn’t consulted. (off her look) Baby, I’m sorry.   Captain’s life was in danger and I just did what I had to do. It was an impulse decision. SHARON I guess I can kind of understand that. Holt walks up. HOLT Sharon, I have to apologize.   I want to assure you that the call to put Sergeant Jeffords in the field wasn’t some spur of the moment, impulse decision.   It’s been in the works for a few months now. SHARON Months?   Terry said it just happened. You need to get your stories lined up. Sharon glares at Terry and storms off again.  BROOKLYN NINE-NINE   \"The Bet\"   Shooting Draft   10/25/13   22.",
      "characters": [],
      "action_text": "HOLT Perhaps I should stop talking to your wife. TERRY That’s a good call. Terry chases after Sharon, frustrated. INT. JAKE’S CAR - A LITTLE LATER (N2) 34   34  Jake and Amy, still on the stakeout.   Jake checks his watch. AMY Ten pm.   These wonderful thugs have saved me another hour of humiliation. JAKE Yeah, well, I’m not giving up.   There’s still time for us to get back to the worst date of your life. AMY Hmmm no.   Nothing will ever be worse than the date I had with my aunt’s dentist... INT. RESTAURANT - NIGHT (FBN) 35   35   *  Amy sits across from DOCTOR NASH, a dentist. DR. NASH Here -- try some of this! He offers a bite of food on his fork, then uses the fork and a SPOON to hold her mouth open and look at her teeth. DR. NASH Well, dessert is out of the question. Amy looks concerned. INT. JAKE’S CAR - BACK TO SCENE (N2) 36   36  Jake and Amy laugh. AMY What was your worst date ever? JAKE It’s like a fifty-way tie.   Recently I went out with a lady who thought our president’s name was “The Rock Obama.” Jake notices something.  BROOKLYN NINE-NINE   \"The Bet\"   Shooting Draft   10/25/13   23.  CONTINUED: 33   33 JAKE Hey, those people left the door open.   I bet that roof has a better vantage point. AMY And I bet it doesn’t smell like old cheese. JAKE Hey.   That’s offensive.   It’s old meat. INT. BAR - SAME (N2) 37   37  Holt notices Sharon near the coat-check, berating Terry: SHARON What else don't I know, Terrance?   Are you cooking meth?   Are you breakin' bad? How many phones do you have? Holt approaches. HOLT I’m sorry.   I need to clarify something I said earlier.   Technically, Sergeant Jeffords was correct when he said his choice to go back in the field that night was an impulse decision.   He didn’t even take the time to stop and gear up-- SHARON WHAT?!   You weren’t wearing your vest? HOLT Oh goodness.   Ohhhhhh my.   I shouldn’t have said that.   I feel I may have made things worse. Charles bursts upon the scene. CHARLES Wait!   I can fix this, Ray",
      "dialogue_count": 0,
      "word_count": 2482
    }
  ]
}