{
  "slug": "californication-102-hell-a-woman-2007",
  "title": "californication 102 hell a woman",
  "genre": "romance",
  "format": "series",
  "scenes_count": 2,
  "characters_count": 0,
  "characters": [],
  "total_words": 3365,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. KAREN & BILL’S PLACE - DAY 9   9  Hank pulls up in front.   Gets out with a bottle of Glenlivet.  Walks the walk.   Hearing signs of life from the --  POOL AREA  Where he finds a lone swimmer in the pool:  It’s MIA, of course.  She pulls herself up and out of the pool, dripping wet,  string bikini, more naked than not.   All that’s missing is a  pair of heart-shaped glasses.  HANK  Jesus Christ.  MIA  Nope.   Just little ol’ me.  (then)  Are you okay?   You look a little  pale.   You’re not going to have a  heart attack, are you?   You are  getting on in years.  HANK  Hey, being older than you doesn’t  necessarily make me old.  MIA  Well, I am sixteen, you know.  HANK  So I’ve been told.  MIA  What’s the word for that again?  Let me check the books.   Oh, here  it is.   Right here.   Statutory  rape.  HANK  That’s two words.  Bill emerges from the house, breaking the spell.   He clears  his throat, clearly uncomfortable.  BILL  Honey, go put some clothes on,  okay?   We have company.  CALIFORNICATION   EP102   FINAL DRAFT - GOLD 6/14/07   14.  (CONTINUED)",
      "characters": [],
      "action_text": "MIA  Oh, Daddy... I’m sure it’s nothing  he hasn’t seen before.  An uncomfortable beat.   She walks off.   It takes everything  Hank’s got not to watch as she goes.   Bill appraises Hank.  BILL  Hank.  HANK  Tim.  BILL  Thanks for coming.  HANK  Thanks for having me.  BILL  It’s my pleasure.  HANK  No, it’s my pleasure.  BILL  You know, I think this is an  important step we’re taking here  tonight.  HANK  What step is that, Bill?   The one  where I stand by and let you steal  my family out from under me?   I  don’t think so.   Game on, broheme.  Bill sighs, reaches out to take the bottle of booze...  BILL  You didn’t have to do that.  ...but Hank pulls away.  HANK  I didn’t.   This is for me.  At the same time, Karen walks out with a 40ish friend and  neighbor.   SONJA.   Hank goes in for his customary kiss and  gets his usual rebuke.  KAREN  Hank - Sonja... Sonja - Hank.  CALIFORNICATION   EP102   FINAL DRAFT - GOLD 6/14/07   15.  CONTINUED: 9   9  (CONTINUED) SONJA  I love your writing.  HANK  How much were you paid to say that?  Cuz I’ll double it for the truth.  SONJA  I read your adaptation way back  when Soderbergh was going to do it.  I fucking loved it.  HANK  Ah, yes.   The salad days.   There I  was, across from the man of my  dreams.   You’re so in love and you  know you’re going to fuck and make  this beautiful baby.   Then all of a  sudden you turn your head, and when  you look back, he’s gone, replaced  by some hack imposter.   Yet you  still sleep with him because he’s  vaguely attractive and you talk  yourself into thinking he’ll be a  great father.   Nine months later...  SONJA  ...you wish you had sucked down a  bottle of morning-after pills.  (then)  Been there, bought the T-shirt.  HANK  Oh, we’re going to get along just  fine.  (to Sonja)  Excuse me for a moment.  Hank smoothly tugs Karen out of earshot.  HANK  What are you doing?  KAREN  What are you talking about?  HANK  You’re trying to set me up with  this chick.  CALIFORNICATION   EP102   F",
      "dialogue_count": 0,
      "word_count": 1855
    },
    {
      "scene_number": 2,
      "slugline": "INT. KAREN & BILL’S PLACE - HALLWAY - NIGHT 13   13  Hank exits Becca’s room.   Picks up the dwindling supply of  scotch right where he left it -- by the door.   Takes a swig.  Just as Sonja is coming out of a nearby bathroom.  HANK  Hey, sorry about that.   I honestly  don’t know what the fuck I’m  talking about half the time.   Ask  anyone, they’ll tell you.  SONJA  No worries, Hank.  Hank smells something.   He sniffs.   Sonja giggles.  SONJA  Wanna get fucked up?  INT. KAREN & BILL’S PLACE - MASTER BEDROOM - NIGHT 14   14  Hank and Sonja share a joint on Karen and Bill’s bed.  SONJA  Why so smiley?  HANK  Nothing like getting stoned on the  very bed your ex-domestic partner  shares with her fiance.  (a happy sigh)  It’s the little things.  Sonja takes a deep hit, stands up.  SONJA  Do me a favor?  HANK  Sure.  SONJA  Tell me what you think.  She steps out of her dress.   Stands in front of him.  Completely naked.  HANK  Honestly?  CALIFORNICATION   EP102   FINAL DRAFT - GOLD 6/14/07   24.  (CONTINUED)",
      "characters": [],
      "action_text": "SONJA  Honestly.   I’m forty-something  years old, there’s no time for  games.   I need to know the truth.  HANK   *  Okay, well, your breasts are  obviously real... you have an  abundance of pubic hair... and  there’s no evidence of vaginal  rejuvenation...  (then)  Aside from the fact that you  worship a space alien, you just  might be one of the most beautiful  women I’ve ever seen.  Sonja smiles, gives him the finger, says:  SONJA  Thank you.  And she means it.  HANK  My pleasure.  SONJA  Do me another favor?  HANK  What’s that?  SONJA  Fuck me.  (then)  My husband recently left me for a  guy named Ted and right now all I  want to do is get fucked stupid by  a man who actually likes women.   Is  that okay with you?  HANK  Well, I’d be lying if I said I  never wondered what it would be  like to bang a Scientologist.  A beat.   And then she jumps his bones.  EXT. KAREN & BILL’S PLACE - NIGHT 15   15  Marcy and Karen, lit by the cool blue of the pool.  CALIFORNICATION   EP102   FINAL DRAFT - GOLD 6/14/07   25.  CONTINUED: 14   14  (CONTINUED) MARCY  You must be really fucking hairy  right now.  CALIFORNICATION   EP102   FINAL DRAFT - GOLD 6/14/07   25A.  CONTINUED: 15   15  (CONTINUED) KAREN  Excuse me?!  MARCY  You haven’t been in for a wax in  months.   Either you’ve taken your  lady business elsewhere, or you’re  sporting a ginormous hippie bush  these days.  KAREN  I’m sorry... but I just came to  keep you in business.  MARCY  And I just want you to be happy and  hair-free.  KAREN  Well, I am.   Thanks for asking.  MARCY  Good.   And you’re sure you’re not  making some deal with yourself that  your ass can’t cash?  KAREN  What does that even mean?  MARCY  Hey, I might be mixing metaphors,  but I’m not speaking in tongues.  Are you absolutely sure you want to  marry this guy?  KAREN  It’s not that complicated.   I love  him.   He loves me.   He’s good to my  daughter.   What else is there?  MARCY  What about Hank?  KAREN  What about him?  MARCY  He loves you.   ",
      "dialogue_count": 0,
      "word_count": 1510
    }
  ]
}