{
  "slug": "californication-308-the-apartment-2009",
  "title": "californication 308 the apartment",
  "genre": "drama",
  "format": "series",
  "scenes_count": 2,
  "characters_count": 0,
  "characters": [],
  "total_words": 4856,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. HANK’S BEDROOM - MORNING 2   2  Hank gradually wakes up in a bed full of naked strippers.  Only one of whom is awake and looking at him fondly:   Jackie.  The other two are still passed out.  HANK  I know we killed that bottle of  Jack, but I don’t remember making  the sex with Betty and Veronica.  JACKIE  Nah, they mostly amused themselves.  I’m not so good with the sharing.  Much with the kissing and the fondling.  HANK  Hey, you never told me what you  guys were out celebrating.  JACKIE  Oh, yeah.   That.   My last dance.  (off his look)  I’m done.  HANK  With?  JACKIE  The stripping.  HANK  Really?   Ya don’t say...  JACKIE  Yep.   I’m out.   No more grinding on  middle-aged hard-ons for me.  Except for yours, of course.  HANK  Hey, who ya calling middle-aged?  JACKIE  You.   My old dude boyfriend.  HANK  Oh, is that what I am?  JACKIE  Sure.   A girl doesn’t give up the  pole for just anyone, you know.  CALIFORNICATION   EP.308   PRODUCTION DRAFT   6/2/09   3.",
      "characters": [],
      "action_text": "HANK  Stop.   You’re gonna make me blush.  So what’s next for you?  JACKIE  Writing.   I’m gonna give it a go.  Fuck, it’s what makes me happiest.  So what if I die poor, drunk and  alone?  HANK  Who’s to say you wouldn’t go out  that way anyway?  JACKIE  Well, thanks for helping me see the  light, teach.  HANK  My pleasure.   I’m honored.   And  beyond giddy that my half-baked  wisdom is working for you.   But...  JACKIE  You’re not seriously gonna try  breaking up with me again, are you?  HANK  Well, to be fair and balanced about  it all, the phrase “breaking up”  suggests that, once upon a time, we  were together.  JACKIE  Okay, just so I’m clear -- the  sheer amount of no holds barred sex  we’ve been having does not indicate  a certain level of intimacy?  HANK  Well, sure.   Sure it does.  (confused)  What’s your point?  JACKIE  For a man who loves women, you  don’t seem to understand them very  well.   Every time we sleep  together... every time you’re  inside me... every time I come... I  get just a little bit more attached  to you.  CALIFORNICATION   EP.308   PRODUCTION DRAFT   6/2/09   4. HANK  Okay, I hear that.   And I know it  feels fairly momentous and all, but  I think this is one of those rites  of passage they talk about.   Yep.  Every comely young college gal has  a fling with her favorite  professor.   Even my old lady had  one.   Used to really gross me out.  Now I understand.   It’s like she  was fucking me before she met me.  Helps me sleep easier.  The phone RINGS.   Hank’s never been more pleased by the  shrillness of it all.   Until he sees who it is:   Karen.   He  gets out of bed.   Heads out of the room.  HANK  Yikes.   I should probably take this  elsewhere.   In Santa Monica,  perhaps.  JACKIE  Tell her I said hi.  HANK  Will do.  INT. HANK’S PLACE - LIVING ROOM - MORNING 3   3  Hank waits until he’s in the living room to answer.  HANK  City morgue.   You kill ‘em, we  chill ‘em.  Intercut with:  INT. KAREN’S OFFICE IN NYC - DAY 4   4  KA",
      "dialogue_count": 0,
      "word_count": 916
    },
    {
      "scene_number": 2,
      "slugline": "INT. HANK’S PLACE - FRONT DOOR - MORNING 6   6  Hank opens the door to a cheerful CHARLIE and a twitchy RICK  SPRINGFIELD.  CHARLIE  Top of the morning, chum.  HANK  What the fuck do you want?  RICK SPRINGFIELD  (to Charlie)  Does he know who I am?  CHARLIE  Of course he knows who you are.  You guys met at my place.   Shared a  meal, in fact.   Broke some bread.  RICK SPRINGFIELD  Then where’s the respect?   Why’s he  being a douche?  HANK  Hey, watch it, Rick Springfield.  I’m in no mood.  CHARLIE  Okay, studs.   Settle down.   No need  for a cock fight.  (to Hank)  We’re here to check out the  Porsche.   You’re selling.   Rick’s  looking to buy.   We firmed it up  last night, remember?  HANK  Yeah, sure, now I do.   But can we  reschedule?   I’ve got a comatose  stripper in my bed.  RICK SPRINGFIELD  Been there.   Need some help?  INT. HANK’S BEDROOM - MORNING 7   7  The boys walk in just as Jackie and the other stripper have  the comatose one sitting up on the edge of the bed.  But as soon as they let go, she slumps off the bed, onto the  floor, landing with a most unpleasant THUD.  CALIFORNICATION   EP.308   PRODUCTION DRAFT   6/2/09   8.",
      "characters": [],
      "action_text": "RICK SPRINGFIELD  Oh, man!   D’ja hear that?!   Nothing  like the sound of a stripper’s head  on a hardwood floor!  HANK  What the fuck is wrong with you?  RICK SPRINGFIELD  What?   You never rough ‘em up?  ‘Scuse me, George Bailey.  (to Charlie)  Get a load of this guy.   Fuckin’  last boy scout over here.  Rick Springfield eyes Jackie, starts singing “Jessie’s Girl”  right to her.   Hank looks at Charlie.  HANK  You gotta get this fuckin’ ass  clown outta here.   Before I start  swingin’..  RICK SPRINGFIELD  Oh yeah?   You wanna throw down, bad  boy?   You think you can take this?  Guess what?   I shit a pint of blood  this morning.  HANK  Why? (to Charlie)  Just do me a favor and get these  girls out of here, okay?  CHARLIE  I don’t know, Hank.   This seems  like dirty business.   Kinda shady.  HANK  Charlie, when was the last time I  actually asked you to do something  for me?  CHARLIE  I got you those Stones tickets.  HANK  Yes.   You did.   In the spring of  2003.  CHARLIE  That wasn’t easy, you know.   I had  to make a lot of calls.  CALIFORNICATION   EP.308   PRODUCTION DRAFT   6/2/09   9. Hank stares Charlie down until he leaps into problem-solver  mode.  CHARLIE  Okay, here’s what we do.   Rick and  I will take her to the ER.   See  what’s what.  (to Rick Springfield)  And while we’re there, we should  take a look at why you’re shitting  so much blood.  Charlie and Rick Springfield pick up the semi-conscious  stripper and start carrying her toward the front door.   The  other stripper looks at Rick.   Makes a connection.  STRIPPER  Hey, you’re Rick Springfield,  aren’t you?  RICK SPRINGFIELD  That’s right, tiny dancer.   You  look familiar.   You ever shake your  ass for me?  STRIPPER  No, but my mom did.   I think you  guys boned.  RICK SPRINGFIELD  Right on.   She say good things  about my big ten inch?  STRIPPER  She said you refused to put a  rubber on it.  RICK SPRINGFIELD  That’s right, baby.   Skin on skin.  Let the love begin.  Rick Springfield los",
      "dialogue_count": 0,
      "word_count": 3940
    }
  ]
}