{
  "slug": "californication-305-slow-happy-boys-2009",
  "title": "californication 305 slow happy boys",
  "genre": "drama",
  "format": "series",
  "scenes_count": 2,
  "characters_count": 0,
  "characters": [],
  "total_words": 3311,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. COLLINI HOUSE - SCREENING ROOM - NIGHT 9   9  Charlie and Marcy find themselves in a verbal headlock with  Sue and Walter Collini.  COLLINI  Who wants to go down to the  playroom and make a little movie?  We’ve got a camera, a tripod, and a  dirty futon.  MARCY  That sounds like a snuff film.  WALTER COLLINI  Nonsense.   Runkle, have you ever  seen a stag film?  CHARLIE  I’ve seen my fair share of porn.  WALTER COLLINI  Not porn, you simpleton.   A stag  film is different.   Evokes a bygone  era.   A better time for sex.  CHARLIE  I don’t believe I have, Mr.  Collini.  WALTER COLLINI  Listen to me.   We have something in  common, you and I.   Something few  men share.   We’ve both been inside  this gorgeous glass of gin over  here.   You call me Walter.   You  understand?  CHARLIE  Okay, fair enough.   Walter it is.  COLLINI  Walter has one of the preeminent  stag film collections in the  country.  WALTER COLLINI  It’s one of my great passions.  MARCY  What is it you do for a living,  Walter?  CALIFORNICATION   EP.305   PRODUCTION DRAFT   5/11/09   18.",
      "characters": [],
      "action_text": "WALTER COLLINI  Look around, my dear.   I buy and  sell erotic art.   That’s what gets  this soldier hard.  (off their looks)  Not down there.   No sirree.   That  thing’s about as useful as a piece  of string cheese.   But my tongue.  That’s where it’s at.   When I get  aroused, all the blood rushes to my  mouth.   It’s almost better than a  penis.   It’s a heat-seeker.  He wags his tongue at Marcy, who cowers, grossed-out.  COLLINI  He speaks the truth, my man does.  Although I’m still a penetration  junkie at heart.   Which is why he’s  kind enough to let me shop  elsewhere.  CHARLIE  If you don’t mind me asking,  Walter, how’d you end up in the  chair?  WALTER COLLINI  This one over here rode me so hard  one night she broke my member.   It  ballooned up.   Got all swollen and  purple.   Like an eggplant.   I  freaked out, thought I was never  going to be able to make love  again.   So I threw myself off the  deck.   Broke just about every bone  in my body.   But Sue Collini -- she  stayed with me.   Through thick and  thin.   To Hell and back.   I love  her madly.  Walter and Sue make out furiously.   Marcy elbows Charlie.  They try to sneak away.   No such luck.   Busted.  COLLINI  Hey, where do you two think you’re  going?  MARCY  We gotta call and check on the  kids.  COLLINI  I didn’t know you had kids, Runkle.  CALIFORNICATION   EP.305   PRODUCTION DRAFT   5/11/09   19. CHARLIE  You never asked.  They skedaddle.  INT. COLLINI HOUSE - NIGHT 10   10  Hank is shooting some pool when a flabbergasted Zloz races  in, soaking wet, pulling on his clothes.  ZLOZ  Dude, she has a cock!  HANK  Really?   Are you sure?   Maybe it’s  just an oversized clit.  ZLOZ  Things were going really well.   Too  well.   We were making out in the  hot tub.   She said she wanted to  tell me something.   I thought she  had a boyfriend or something.   Next  thing I know, she guides my hand  down to her thin, bent dong.  HANK  So then what?   You gave her a  handie?  ZLOZ  Fuck you.   I",
      "dialogue_count": 0,
      "word_count": 1736
    },
    {
      "scene_number": 2,
      "slugline": "INT. HANK’S BEDROOM - MORNING 14   14  Which should resemble David Lee Roth’s hotel room circa 1984.  It looks like a fucking bomb went off.   And much fun was had.  Next to Hank, tangled up in the sheets, SLEEPING BEAUTY.   All  blonde hair and dangerous curves.   We can’t see her face.  Hank gets out of bed.   Too fast.   Puts his hands out to stop  the spinning.   Courtesy of the night before, natch.  He stumbles around the room, looking for something he can’t  quite find.   Then -- a light bulb moment.   He lurches into:  THE BATHROOM 15   15  Where the sudsy remains of a bubble bath are still in the  tub.   He shoves a hand into the froth, comes up with various  and sundry articles of clothing.  Tops, bottoms, lacy what-have-you’s.   Finally producing his  sunglasses.  He shakes off the suds.   Slides them on.   Looks in the  mirror.   Improvs some kung fu moves.   And then it’s...  INTO THE DINING ROOM 16   16  It’s a fucking mess in here, too.   Bottles of booze  everywhere.   A mushroom cloud of cigarette smoke hanging in  the air.  Hank crosses paths with last night’s Little Person Stripper,  who is exiting Becca’s bedroom.   She gives him a nod and a  wink and heads for the kitchen.  Hank watches as she opens the fridge and guzzles some OJ out  of the carton.   He turns, walks into...  BECCA’S BEDROOM 17   17  Where another stripper is passed out in Becca’s bed.  A GNARLY PAIR OF MALE FEET poke out from under the covers  next to her head.  Hank peeks under the covers down by the girl’s feet.   Finds  an unconscious Charlie under there.   Sporting a nasty shiner.  Hank puts the covers back over Charlie’s face.   Leaves the  room...  CALIFORNICATION   EP.305   PRODUCTION DRAFT   5/11/09   27.",
      "characters": [],
      "action_text": "IN THE LIVING ROOM 18   18  Zloz is passed out on the floor.  Hank sighs, looks at his old friend with equal measures  compassion and disgust.   He gets an idea.   Goes...  INTO HIS BEDROOM 19   19  Where he shakes Sleeping Beauty.   Turns out it’s Jackie.   She  wakes up yawning.   All sleepy and cute.   Smiles at Hank.  JACKIE  Morning, teach.   Our first  sleepover.  HANK  Yeah, wish I remembered a little  more of it.  JACKIE  Did we take a bubble bath?  HANK  There is evidence to support that  theory, yes.  (then)  Can you do me big favor?  INT. HANK’S PLACE - LIVING ROOM - MORNING 20   20  We’re CLOSE ON ZLOZ as he wakes up.  Trying to remember where he is and how the fuck he got there.  He senses a body curled up next to him on the floor.   He  looks:  It’s Jackie.   Sound asleep.   He can’t believe his good  fortune.   He peeks under the blanket.   Yep, she’s naked.  Even better.   She wakes up.   All sleepy and cute.   Smiles.  ZLOZ  Did we...?  JACKIE  Oh fuck yeah.  ZLOZ  Wow.   Was I any good?  JACKIE  The best.   You’ve got a great cock.  CALIFORNICATION   EP.305   PRODUCTION DRAFT   5/11/09   28. ZLOZ  Good times...  Hank comes out of the bedroom.   Yawning.   As if he just woke  up.   Zloz leaps to feet.   Runs into Hank’s arms.   Big hug.  Hank pats his naked friend on the back.   Looks at Jackie.  HANK  (mouths)  Thank you...  JACKIE  (smiles, mouths back)  You’re welcome...  EXT. VENICE BEACH - DAY 21   21  Hank and Zloz play catch on the sand.  ZLOZ  Fucking beautiful here, man.   Takes  your breath away sometimes.  HANK  Yeah, it’s one of the perks.   That  and In-N-Out Burger.  ZLOZ  I got a question for ya.  HANK  Shoot.  ZLOZ  How come you never made it to my  wedding?  HANK  Shit, I dunno.   I was pissed at  you, I guess.   I didn’t want to see  you throw your life away.   We had a  plan.  ZLOZ  Yeah.   And I fucked it up.  HANK  We were gonna make it out of there.  The two of us.   Together.   I was  gonna be a famous writer.   You were  gonn",
      "dialogue_count": 0,
      "word_count": 1575
    }
  ]
}