{
  "slug": "call-me-by-your-name-2017",
  "title": "call me by your name",
  "genre": "romance",
  "format": "film",
  "scenes_count": 8,
  "characters_count": 0,
  "characters": [],
  "total_words": 18238,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. ELIO’S/OLIVER’S ROOM - PERLMAN VILLA - DAY 1   1 The sound of an approaching car. ELIO, 17, barefoot and in his bathing suit, is in the process of moving his clothes from his room to the adjacent room - a cramped storage room somehow refurbished into a single bedroom. The two rooms are separated by a ruined wooden door, with cracks all over it and share a common bathroom. MARZIA, a girl of about his same age, is lying on the bed. It is obvious both have been on it together. ELIO goes to the window and looks down. A car pulls up below, blowing up clouds of dust, and stops at the villa’s main entrance. A tall young man steps out of the car, wearing a billowy bright blue shirt with a wide-open collar, sunglasses. This is OLIVER, 25. ELIO (in French to Marzia)  L'usurpateur. (The usurper)  MARZIA jumps up to come stand next to him, looking down. ANCHISE, the gardener and handyman, appears below followed by the PERLMANS who introduce themselves to Oliver. Professor PERLMAN is in his fifties, distinguished, vigorous. ANNELLA, his wife, is in her mid-forties. PERLMAN (to Oliver) Welcome! Welcome! Oh, my, you are much bigger than your picture! ANNELLA (in Italian to her husband)  Dove è Elio?  (Where’s Elio?) ELIO (in French to Marzia)  Il faut que je descende.  (I’d better go down.) INT. STAIRCASE - PERLMAN VILLA - DAY 2   2 At the end of the stairs ELIO sees OLIVER being walked to Professor Perlman’s study. Oliver’s suitcase and backpack lie on the floor nearby. ANNELLA sees Elio approaching and gestures towards them.",
      "characters": [],
      "action_text": "ANNELLA (in Italian)  Aiuta Oliver a portare le sue cose in camera tua.  (Help bring Oliver’s things up to your room.) INT. PROFESSOR PERLMAN’S STUDY - PERLMAN VILLA - DAY 3   3 ELIO enters his father’s studio. OLIVER, sitting on the sofa, is having a glass of fresh water. Even if exhausted by the heat, he remains elegant and somewhat iconic. Professor PERLMAN introduces the two formally. PERLMAN Elio, Oliver.   Oliver, Elio. They shake hands. ELIO Hello. OLIVER (non committal) Hi. PERLMAN (to Oliver) Make yourself at home. Our house is your house. INT. STAIRCASE - PERLMAN VILLA - DAY 4   4 They head up the stairs together; ELIO lunges for the heavy suitcase, OLIVER takes the backpack. ELIO An my room is now your room. I’ll be next door. They meet MARZIA coming down. More introductions in the middle of the stairs. She kisses OLIVER on both cheeks. OLIVER is curious about her and looks back as he continues up. She looks back after he does. INT. OLIVER’S ROOM - PERLMAN VILLA - DAY 5   5 They enter Oliver’s bedroom. OLIVER drops his backpack and crashes on the bed, exhausted. ELIO lays the suitcase next to the bed.  2. ELIO We're sharing the bathroom. It's my only way out... But Oliver is not listening, already asleep. Elio walks out and closes the door that separates their two rooms. INT. STAIRCASE - PERLMAN VILLA - DUSK 6   6 Later. MAFALDA, at the bottom of the stairs, rings a bell. She looks up the stairs and, getting no response, rings the bell again. INT. ELIO’S/OLIVER’S ROOM/BATHROOM - PERLMAN VILLA - DUSK 7   7 ELIO is at the desk in his small “new” bedroom; he is transcribing music. Next to his desk lamp a Sony Walkman is playing music. He hears the bell. He enters the bathroom and the door that connects it to the other room is open. OLIVER sleeps in the dim light of sunset. ELIO We’re being called to dinner. No answer. Elio enters Oliver's room and reaches over to the bookshelf, takes a book from it but then drops it on the floor. It makes a sharp clatter. Ol",
      "dialogue_count": 0,
      "word_count": 11090
    },
    {
      "scene_number": 2,
      "slugline": "INT. ELIO’S BEDROOM - PERLMAN VILLA - DAWN 66   66 Later. It is now dawn. ELIO is in his room sitting naked at his desk. His small lamp is on. He takes up a school notebook and tears out a page. He begins writing the note to Oliver: Please don’t avoid me. He crumples that up. Please don’t avoid me. It kills me. He crumples that up too, and writes: Your silence is killing me. He says to himself, out loud, ELIO Way over the top. He writes: Can’t stand thinking you hate me. He tears that up too, and tries again: I’d sooner die than know you hate me. He laughs, tears that one up, and writes once more: Can’t stand the silence. I need to speak to you. He reads this, liking it. He lifts his right hand to his face, smells his fingertips, his palm, then his other hand liking that too. ELIO gets up, folds the last note, and slips it under the door that separates his room from Oliver’s. INT. MAIN STAIRCASE - PERLMAN VILLA - MORNING 67   67 ELIO coming up the steps as OLIVER is walking down. OLIVER Did you enjoy yourself last night? ELIO  Insomma   (so-so).  51.",
      "characters": [],
      "action_text": "PERLMAN walks out of his office to join the conversation. PERLMAN Must be tired then. Or were you playing poker too? ELIO I don’t play poker. PERLMAN and OLIVER exchange glances. PERLMAN (to Oliver) Several hundred color slides of our boxer and the others like him arrived yesterday from Berlin. We should start cataloging them. That will keep us busy until lunch I imagine. INT. ELIO’S BEDROOM - PERLMAN VILLA - DAY 68   68 ELIO enters his room. He sees the folded note he wrote to Oliver lying on his desk and opens it. Oliver has added: Grow up. I’ll see you at midnight. ELIO feels weak-kneed and has to sit down on his bed. He kisses the slip of paper, then holds it against his heart. Then he looks at the time on his watch: 10:30 AM. INT. PROFESSOR PERLMAN’S STUDY - PERLMAN VILLA - DAY 69   69   * PROFESSOR PERLMAN project images of classical athletes from a slide projector onto a screen in his study. On the screen is a close-up detail of a bronze navel in an impressively muscled stomach. There are several of these, and PERLMAN points out stylistic differences: PERLMAN (pointing at the images) Beautiful aren’t they? OLIVER They’re amazing. But these are far more... sensual.  Blue Rev. (mm/dd/yy)   52. PERLMAN Because these are more Hellenistic than the fifth-century Athenian, most likely sculpted under the influence of the greatest sculptor in antiquity: Praxiteles.   Their muscles are film- look at his stomach for example- and yet never a straight body in these statues, they are all curves, sometimes impossibly curved and so nonchalant, hence their ageless ambiguity.   As if they are daring you to desire them. Oliver, not unmoved by these images, steals a glance at Perlman to see if perhaps Elio’s father knows something about what is going on between Oliver and his son. EXT. TABLE UNDER THE LIME TREES - PERLMAN VILLA - DAY 70   70 At the lunch table. A clock strikes two. Lunch is over and everyone folds his napkin and pushes back their chairs. ANNELLA And don’t forget",
      "dialogue_count": 0,
      "word_count": 1699
    },
    {
      "scene_number": 3,
      "slugline": "INT. CORRIDOR/EXT. BALCONY - PERLMAN VILLA - NIGHT 83   83 ELIO walks onto the balcony where OLIVER is smoking. OLIVER I’m glad you came. I thought you had changed your mind. ELIO Change my mind? Of course I was coming. ELIO steps close to the ledge. ELIO (CONT’D) So you   do   smoke? OLIVER Sometimes. ELIO (not knowing what else to say) I’m nervous. OLIVER Me too. INT. OLIVER’S BEDROOM - PERLMAN VILLA - NIGHT 84   84 OLIVER sits on the bed, his legs crossed, looking smaller, younger. ELIO stands awkwardly at the foot of the bed, not knowing what to do with his hands. He keeps putting them in his pockets, then taking them out again. OLIVER (placing the full ashtray onto the floor) Come, sit. Hesitating, ELIO crawls onto the bed and sits facing him, cross-legged like Oliver, making sure their knees don’t touch. Needing suddenly to shed his shyness and inhibitions, ELIO decides he has to lean against something and slides up to the top of the bed, resting his back against the headboard beside OLIVER. ELIO looks down at the bed and at the two of them side by side on it, a moment he has dreamed of. Now here we are, he thinks, hardly able to believe it. As if to highlight that moment, OLIVER stretches his legs out, his bare feet next to ELIO’s own.  58.",
      "characters": [],
      "action_text": "OLIVER (CONT’D) You okay? ELIO Me okay. With his toes, ELIO reaches over to Oliver’s toes and touches them. He slips his big toe in between Oliver’s big toe and his second toe in a kind of desperately playful mood. OLIVER What are you doing? ELIO Nothing. OLIVER reciprocates the movement, seeking out Elio’s other foot. ELIO moves closer to OLIVER, then hugs him. A kind of child’s hug, which OLIVER responds to only by saying, half- humorously: OLIVER That’s a start. ELIO shrugs, not wanting to speak. OLIVER (CONT’D) Does this make you happy? You aren’t going to have a nosebleed are you? It does, and ELIO nods yes, then no. Finally, OLIVER brings his arm around ELIO. He doesn’t stroke him, doesn’t hold him tight. ELIO loosens his own hold for a moment, giving him time enough to bring both his hands, seeking skin, under Oliver’s loose shirt and resume his embrace. OLIVER (CONT’D) You sure you want this? ELIO nods again, Yes. OLIVER lifts Elio’s face with both hands and stares at him the way he did on the cliff, even more intensely. OLIVER (CONT’D) Can I kiss you? ELIO Yes, please. Then he suddenly pulls back, as if he might laugh, and runs his fingers through Elio’s hair, messing it up.  59. ELIO brings his mouth to Oliver’s in a fiercely eager kiss. Something seems to clear away between them, and both abandon themselves to the kiss. ELIO hungrily kisses Oliver’s closed eyes, his nose, his ears, his throat, discovering them with his lips. OLIVER kisses him back as eagerly, even roughly. ELIO lies back on the bed. OLIVER climbs atop him and starts to undress ELIO. OLIVER (whispering) Off, and off, and off, and off... (tossing them away) ELIO is soon naked and lies back in a kind of ecstasy as OLIVER moves his hands over his body, as inquisitive as Marzia’s had been the night before in the street. When OLIVER pulls the sheet back, ELIO loves being naked before him. No secrets. OLIVER kisses him, kisses his body, then returns to kiss Elio’s open lips again more deeply, as",
      "dialogue_count": 0,
      "word_count": 1012
    },
    {
      "scene_number": 4,
      "slugline": "EXT. RIVER - FIRST LIGHT OF DAY 87   87 At the river, OLIVER walks knee-deep in the water with the blue shirt on, then dives in and swims away. Elio is swimming 200 meters away, from a distance they look like two complete strangers. EXT. RIVER - DAY 88   88 ELIO and OLIVER walk towards their bikes. OLIVER Are you going to hold last night against me? ELIO No. He said this too swiftly to sound convincing. INT. STAIRS/ELIO’S ROOM - PERLMAN VILLA - DAY 89   89 Back at the villa. There are some sounds from the kitchen but OLIVER and ELIO succeed to get back home without being seen. They reach their respective doors and, while ELIO is going in, OLIVER hesitates before going through his and steps into Elio’s room instead. ELIO is taken by surprise. OLIVER shuts the door. OLIVER Take your trunks off. Surprised, ELIO, who doesn’t have it in him at this moment to disagree, lowers them and gets out of them. He feels awkward. OLIVER (CONT’D) Sit down. ELIO does, and almost before he’s settled, OLIVER brings his mouth to Elio’s penis and takes it all in (off-screen). OLIVER (CONT’D) (with a wry smile) Well, this is promising. You’re hard again. Good. With that Oliver jumps up and exits the room, leaving Elio wondering what just happened.  62.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 225
    },
    {
      "scene_number": 5,
      "slugline": "EXT. GARDEN IN FRONT OF THE KITCHEN - PERLMAN VILLA - DAY 90   90 Breakfast.   Oliver, freshly showered, sits at the table lost in thought. The PERLMANS, MAFALDA coming in and out from the kitchen busy with breakfast. Finally ELIO comes in and gives his mother and father a kiss before sitting down at the table. He says nothing to Oliver. OLIVER I’m going to town, I have to collect my typed up pages. Later I'd like to show them to you, Professor. PERLMAN (imitating Oliver) Later. Everyone laughs, Oliver also is amused. PERLMAN (CONT’D) Before you leave we'll certainly find the time to go over these revisions. The thought of Oliver's departure marks a shadow on Elio's face. OLIVER So.. Later! More laughing. OLIVER leaves the table and walks away. ELIO watches him go. EXT. MAIN ENTRANCE - PERLMAN VILLA - DAY 91   91 ELIO rides his bike out of   the gate. EXT. PIAZZA DUOMO - CREMA - DAY 92   92 The central square with Crema's Duomo. ELIO sees OLIVER at the newsstand, scanning the headlines of the International Herald Tribune, before heading in the direction of the post office. ELIO rushes up to him.  63.",
      "characters": [],
      "action_text": "OLIVER Something wrong? ELIO I just had to see you. OLIVER Aren’t you sick of me? ELIO I just wanted to be with you. If you want, I’ll go back now. OLIVER stands still, dropping his hand with the bundle of unsent letters, and simply stands there staring at ELIO, shaking his head. OLIVER Do you have any idea how glad I am we slept together? ELIO I don’t know. OLIVER It’s just like you not to know. I don’t want you to regret any of it. I don’t want either of us to have to pay one way or another. ELIO I’m not telling anyone. There won’t be any trouble. OLIVER I didn’t mean that. ELIO Are you sorry I came here? Oliver leans in close to Elio and whispers in his ear... OLIVER I’d kiss you if I could. INT. KITCHEN - PERLMAN VILLA - EARLY AFTERNOON 94   94 MAFALDA and several local women are busy making the local speciality, Tortellini Cremaschi.   They are talking politics. ELIO enters the kitchen from the outside, with two peaches in his hands and a towel on his shoulders. He says hello to the women and leaves the kitchen.  64. INT. STAIRCASE - PERLMAN VILLA - EARLY AFTERNOON 95   95 On the stairs he meets ANNELLA on her way up to nap and kisses her. She looks pleased by this unexpected show of affection from her teenage son. He eats a peach. INT. ATTIC - PERLMAN VILLA - EARLY AFTERNOON 96   96 ELIO enters the attic. Puts the remaining peach on the old bedside table and lies down on the mattress where he made love with Marzia. He opens his book and starts reading but, easily distracted, starts looking outside the window at the glorious summer sky. He tries reading again, but still no chance. His gaze scans the room, the abandoned objects, the dark corners... the peaches. He stretches out his hand to one and plays with it. He turns its crease towards him. Then opens it half-way with his thumbs and pushes the pit out. The pit falls on the attic floor. He brings the fuzzy, blush-colored peach to his groin and lowers his swim trunks. He presses himself into it until the parte",
      "dialogue_count": 0,
      "word_count": 2058
    },
    {
      "scene_number": 6,
      "slugline": "INT. HOTEL BEDROOM - DAWN 108   108 OLIVER stands naked on the balcony. He looks back in the room at ELIO sleeping in the bed. A flash of images suddenly appear- a rapid cut of moments from their time together over the summer.   It may be Elio dreaming or it may be Oliver’s memory. Oliver sits down on the bed next to Elio without waking him. He watches him sleep for the last time. A HISSING sound in the distance. EXT. BINARIO - STAZIONE DI CLUSONE - DAY 109   109 It is the sound of a train arriving at the station, on the main platform. ELIO and OLIVER together look at the train come to a stop. ELIO is wearing Oliver’s blue shirt. On the platform are a few travellers ready to leave. Oliver's bags are those for his trip back home; they are about to say goodbye. The train doors open, some people come out, others get in while saying their good-byes to their counterparts. Elio and Oliver aren't moving, they try to delay the inevitable, if only for a few seconds. The voice on the intercom informs that the Express train for Milan is about to depart from Platform 1. ELIO Did you get your passport? OLIVER Yeah, I did. The travellers are all on the train, except for Oliver.. The conductor is a few cars down, looking at his watch. A moment of suspended, cruel silence. They hug tightly. After several moments OLIVER lets go first. Elio holds him tighter. Oliver hugs him back as they hold each other for the last time, letting their embrace say what words cannot.   Then they both let go and Oliver grabs his bags and enters the train.  72.",
      "characters": [],
      "action_text": "The train leaves. Elio watches it disappear in the distance. Wiped out, he walks along the platform and sits on a bench, his gaze lost in thoughts. After a long beat he stands and go to the... EXT. PHONE BOOTH - STAZIONE DI CLUSONE - DAY 110   110 ELIO dials a number on a public phone, he does so mechanically. A few moments later somebody picks up. ELIO  Mafalda? Maman... Bonjour. Oui, je vais bien. Je suis à Clusone, à la gare. Oui... il est parti. Maman, s'il te plaît, tu pourrais venir me chercher?  (Mafalda? Mom... Hey. Yes, I'm fine. I'm in Clusone, at the station. Yes.. he left. Mom.. please could you come pick me up?) INT./EXT. CAR/COUNTRY ROAD - AFTERNOON 111   111 ANNELLA is with ELIO in the car. She is driving back to the villa. ELIO is silent. Oliver’s blue shirt is open over Elio's bare chest and blows in the wind. She looks at him. She reaches out with her free hand and caresses his cheek, the sweetest gesture. Elio’s face crumples. He starts to cry. She wipes his tears away with her free hand but he cannot stop. EXT STREETS OF TOWN - AFTERNOON 112   112 The Perlman car is parked in town. ELIO is alone, sitting on the passenger seat waiting for his mother. The car's radio is playing some summer song. In the distance, a group of Elio's friends are walking about. Among them is MARZIA, who notices the Perlman car, then Elio. She waves at her friends and leaves them to come towards him. MARZIA Ciao. Elio notices her only when she is close. MARZIA (CONT’D) How are you?  73. ELIO Good, thanks. Elio tries straightening up to hide his emotions, his face recently upset by tears. MARZIA (in French) J 'ai lu le livre que tu m'as offert, les poèmes. Ils sont très beaux. J’aime beaucoup cette Antonia Pozzi.  (I read the book you gave me, the poems, they are beautiful. I really love Antonia Pozzi.) Elio nods, smiling back at her. MARZIA (CONT’D)  I'm sorry you feel so bad. I just wanted to tell you that I'm not mad at you. I love you.   (Je suis désolée que tu sois s",
      "dialogue_count": 0,
      "word_count": 759
    },
    {
      "scene_number": 7,
      "slugline": "INT. OLIVER’S ROOM - PERLMAN VILLA - AFTERNOON 114   114 Elio’s room, in which Oliver has stayed. Alone now, ELIO enters it and looks around. Everything of his has been put back, his clothes in the closet and drawers. He drops his backpack on the floor and throws himself down on the sunlit bed. The bedspread is the same. He closes his eyes. He is glad to be back in his old room, now full of sustaining memories of Oliver. INT. PERLMAN STUDIO - PERLMAN VILLA - EVENING/NIGHT 115   115 Professor PERLMAN is sitting in his usual place. On his lap are proofs of his latest book. He is drinking. ELIO comes into the room to say good night. His father puts away his manuscript with a toss and lights a cigarette - his last of the day. PERLMAN So? Welcome home. Did Oliver enjoy the trip? ELIO I think he did. PERLMAN takes a drag from his cigarette, then pauses a moment before speaking. PERLMAN You two had a nice friendship. ELIO (somewhat evasive) Yes. Another pause, and another drag on his cigarette. PERLMAN You’re too smart not to know how rare, how special, what you two had was. ELIO Oliver was Oliver. PERLMAN  “Parce-que c’etait lui, parce-que c’etait moi. ” (Because he was he, because I was I)  75.",
      "characters": [],
      "action_text": "ELIO (trying to avoid talking about Oliver with his father) Oliver may be very intelligent - PERLMAN (interrupting his son) Intelligent? He was more than intelligent. What you two had had everything and nothing to do with intelligence. He was good, and you were both lucky to have found each other, because you too are good. ELIO I think he was better than me. PERLMAN I’m sure he’d say the same thing about you, which flatters the two of you. In tapping his cigarette and leaning toward the ashtray, he reaches out and touches Elio’s hand. PERLMAN alters his tone of voice (his tone says: We don’t have to speak about it, but let’s not pretend we don’t know what I’m saying). PERLMAN (CONT’D) When you least expect it, Nature has cunning ways of finding our weakest spot. Just remember: I am here. Right now you may not want to feel anything. Perhaps you never wished to feel anything. And perhaps it’s not to me that you’ll want to speak about these things. But feel something you obviously did. ELIO looks at his father, then drops his eyes to the floor. PERLMAN (CONT’D) Look - you had a beautiful friendship. Maybe more than a friendship. And I envy you. In my place, most parents would hope the whole thing goes away, to pray that their sons land on their feet. But I am not such a parent. In your place, if there is pain, nurse it. And if there is a flame, don’t snuff it out. Don’t be brutal with it.   (MORE)  76. We rip out so much of ourselves to be cured of things faster, that we go bankrupt by the age of thirty and have less to offer each time we start with someone new. But to make yourself feel nothing so as not to feel anything - what a waste! ELIO is dumbstruck as he tries to take all this in. PERLMAN (CONT’D) Have I spoken out of turn? ELIO shakes his head. PERLMAN (CONT’D) Then let me say one more thing. It will clear the air. I may have come close, but I never had what you two had. Something always held me back or stood in the way. How you live your life is your business",
      "dialogue_count": 0,
      "word_count": 1270
    },
    {
      "scene_number": 8,
      "slugline": "INT. DINING ROOM - PERLMAN VILLA - NIGHT 122   122 Elio enters the dining room which is decorated for a festive Hannukah dinner. The winter light is fading outside the windows. Activities continue around the table as Annella and Mafalda finish preparing for the meal. Placing flowers, filling wine glasses, etc. Elio crouches in front of the fireplace, the light of the fire reflected on his tear streaked face. We stay on his face, lost in thought. The entire end credit scrolls on his close up. Near the end of this close up we hear: ANNELLA Elio... Elio? Elio is so deep in thought that only after a long beat does he turns toward the sound of his mother’s voice. Fade to black.  81.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 125
    }
  ]
}