{
  "slug": "cassandro-2023",
  "title": "cassandro",
  "genre": "action",
  "format": "film",
  "scenes_count": 9,
  "characters_count": 0,
  "characters": [],
  "total_words": 18914,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. MECHANIC'S GARAGE - NIGHT The garage is now full. Saúl, in costume, peeks from behind a stack of the crates to see the ring. Grinding heavy metal music plays through a broken speaker. The announcer screams: ANNOUNCER  From the sacred lucha libre ring at Ray's Auto Shop, it's my pleasure to introduce The Executioner of Tijuana... Gigántico!  Desde la lona sagrada del Taller Mecánico Ray, para todos ustedes, el Verdugo de Tijuana… ¡Gigántico!  CROWD (CHANTING)  Gigántico! Gigántico!  ¡Gigántico! ¡Gigántico!  From behind the crates, Saúl breathes in and tries to prepare himself as best he can. ANNOUNCER  In a spectacular mano-a-mano against a guy who only goes out at night! The most abominable creature from Madrigal Street… El Topo! Topo! Topo!  En un mano a mano espectacular en contra de un hombre que solo sale de noche, ¡porque la migra lo atrapa! La más abominable criatura de la calle Madrigal Street… ¡El Topo! ¡Topo! ¡Topo!  Then he bounds into the ring. The crowd screams as the two luchadores circle each other. Saúl throws his shirt. SAÚL (to CROWD MEMBER)  Hold onto my shirt, buddy. It's the only one I have!  Te la encargo, compa. ¡Es la única que tengo!  Saúl and Gigántico begin to wrestle. MAN  That faggot likes to cry!  ¡A esa pinche nena le gusta hacer llorar al mocoso!  4.",
      "characters": [],
      "action_text": "Saúl's initial moves show his talent. In contrast to Gigántico's stomping, Saúl's movement is naturally fluid, dance-like. The problem is he's not showcasing these natural abilities. Instead, he's working against them, trying to come across as big and dominant. Saúl ends up looking silly, like a lumbering ballet dancer. Saúl jumps onto Gigántico. SAÚL  Let's give them a show. Follow my lead.  Les vamos a dar un show rifado. Sígueme la corriente, compa.  GIGÁNTICO  Eat my ass!  ¡Hazte las nalgas!  Gigántico slams Saúl onto the mat. GIGÁNTICO (CONT’D)  Hey, damn Topo, get up!  ¡Oye, pinche Topo! ¡Súbase! Pinche Topo maricón. Esto es lucha, puto.  Gigántico laughs. He roars. He beats his chest. CROWD  Get him! Get him!  ¡Duro! ¡Duro!  MAN  Get out of there, sissy! He's gonna kick your ass, Topo!  ¡Bájate, maricón! ¡Te van a romper tu madre, Topo!  Saúl and Gigántico lock and grapple in the middle of the ring. Saúl manages to free himself from Gigántico and does a frantic high kick, landing it on his opponent's chest. Saúl is limber and quick. Gigántico wasn't expecting this. He calls the Announcer for the microphone. GIGÁNTICO (into the mic)  Listen carefully, little mole. You strike me as the kind of guy who likes to get down on all fours! El Topo bites the pillow!  Mira, mira pinche topito. A mí se me hace que tú eres de esos ¡que les gusta ponerse en cuatro! ¡El Topo muerde almohadas! ¡El Topo muerde almohadas!  5. The crowd scream with approval and chant along. GIGÁNTICO (CONT’D) (like chanting)  El Topo bites the pillow! El Topo bites the pillow!  ¡El-Topo-Muerde-Almohadas! ¡El-Topo- Muerde-Almohadas!  CROWD (CHANTING) (to Saúl, following Gigántico's lead)  El Topo bites the pillow! El Topo bites the pillow!  ¡El-Topo-Muerde-Almohadas! ¡El-Topo- Muerde-Almohadas!  Gigántico drops the mic, lurches forward and grabs at Saúl. Saúl spins away, avoiding the bear hug. Saúl jumps on him from behind and tries to get him in a headlock. Gigántico hoists Saúl over his should",
      "dialogue_count": 0,
      "word_count": 4654
    },
    {
      "scene_number": 2,
      "slugline": "INT. MECHANIC'S GARAGE, JUÁREZ - DRESSING ROOM - NIGHT Saúl places his items on the dressing table: a photo of Yocasta, and the eagle feather. Saúl goes to his chair with his rolling pink suitcase and opens it. Inside is his regular El Topo spandex costume and mask. Nestled beside that is a cassette tape labeled with glitter pen and a stack of his mother's clothes and sparkly boots. Saúl hesitates. INT. MECHANIC'S GARAGE, JUÁREZ - MOMENTS LATER The audience is primed for the next fight. Sabrina talks with a referee. Pete looks on. Suddenly the speakers crackle to life. The announcer breaks in. ANNOUNCER  I'm told that there's been a change in the program. This is about to get ugly! Debuting tonight, a luchador you've never seen before. Coming to you from El Paso… Cassandro the Exótico!  Me informan que tenemos un cambio en el programa.   ¡Esto se va a poner muy feo! Tenemos el debut estelar de un luchador nunca antes visto. Con ustedes, desde El Chuco… ¡Cassandro, el exótico!  The crowd applauds. Gigántico looks confused. This wasn't the plan. Pete looks around, pissed. Gloria Gaynor's \"I Will Survive\" comes blaring over the speakers. Gigántico spins around, trying to figure out who's coming out to fight him. The crowd turns. Down the aisle comes Saúl. His identity is not hidden by his usual red spandex luchador mask. In fact, he wears no mask at all. His face for the world to see. Saúl is wearing his mom's clothes - an ill-fitting purple bra, green sequined cape, gloves, fishnets and garters, and an ostrich feather plumed hat. To complete the look, Saúl is wearing high heeled pink sparkly boots. CROWD MEMBER  Faggot!  ¡Culero!  27.",
      "characters": [],
      "action_text": "For a moment, Saúl feels like he's made a terrible mistake. He's standing in his mother's underwear in front of scores of screaming lucha fans with a hulking macho monster bellowing inside ring, ready to take him down. Saúl almost loses his courage. For a second he thinks about fleeing. He sees the mockery in the crowd's eyes. Gigántico makes two huge muscles and encourages the crowd on in their chanting. Saúl as \"Cassandro\" makes his way into the ring. The crowd boos and yells. MAN  Gigántico's gonna crush you! You're nobody! Fucking faggot!  ¡Gigántico te va a hacer pedazos! ¡No eres nadie! Pinche, puto --  Saúl jumps into the ring. He doesn't lumber or make muscles this time. He struts and pirouettes around the ring, his confidence building further (he's also getting used to the shoes). Gigántico, confused, steals a quick glance at Pete, who shrugs and urges him on. CROWD MEMBER  Fuck you, Cassandro!  ¡No eres estética, culero! ¡Chinga tu madre, Cassandro!  Gigántico taunts. The crowd chants. CROWD  ¡Gigántico, Gigántico!  Gigántico roars and runs at Saúl. Saúl gracefully leaps aside, and extends a leg with pointed toe, tripping Gigántico. The crowd whoops. Gigántico retaliates. He flips Saúl in an Octopus clutch, then reaches around with one massive hand to give him a titty twister. Saúl howls. Gigántico laughs at Saúl, egging the crowd on to join in. The whole audience laughs at Saúl. Gigántico releases Saúl and mimics him, sashaying with a limp- wristed gesture that regular exoticos use. Saúl looks out at the audience. He realizes it's the moment of truth. Lose the audience forever or turn everything on its head. Saúl takes a deep breath and looks out to the jeering crowd, then looks down at his body in women's clothes. 28. Something shifts, like his own body isn't his anymore, and he's slowly rising up, looking at himself as if in a dream. The lighting becomes dramatic, the sound in the ring becomes heightened. Saúl starts to see things differently. The crowd",
      "dialogue_count": 0,
      "word_count": 4703
    },
    {
      "scene_number": 3,
      "slugline": "INT. GERARDO'S HOUSE - NIGHT Gerardo is fixing drinks as Saúl walks in. The fridge is covered with children's drawings. \"Amor eterno\" by Juan Gabriel is playing in the back. Saúl kisses Gerardo and wraps his arms around his waist. GERARDO I missed your mouth.   Espérate, espérate.   One thing at a time. They kiss deeper, deeper. Saúl's hands tracing down Gerardo's back and clutching his ass. Then Gerardo pushes him away. GERARDO (CONT’D) First we eat. Can make some drinks for us. SAÚL Okay, okay.  GERARDO We need to celebrate.  Saúl sings to Gerardo the Juan Gabriel's song. Gerardo joins in as he stirs the pot. INT. GERARDO’S HOUSE - DINING ROOM - LATER The two say the Lord's Prayer in Spanish before dinner. SAÚL  Thank you, Universe, for allowing me to be here, all alone with Gerardo. Just me and him.  Gracias, universo, por dejarme estar solo, solo, solo con Gerardo. Solo él y yo.  Gerardo looks at Saúl in a doting, caring way. INT. GERARDO'S BEDROOM - NIGHT The two have sex in Gerardo's bed. It's passionate and sweaty. Saúl is a bottom and after Gerardo climaxes the two cuddle in bed. Saúl knocks something off the bedside table. 50.",
      "characters": [],
      "action_text": "SAÚL (CONT’D) Oh, sorry. Sorry, sorry, sorry. I think Cassandro's a top. He and I are so different. GERARDO I don't like when you talk about him like he's a real person. SAÚL He's also very daring and really fun and sexy. Don't you think he's sexy? Gerardo groans. GERARDO I mean, yeah, but… I liked you better when you were just a regular luchador.  SAÚL He'll come around. He'll grow up. GERARDO I like the way you are. SAÚL Yeah, 'cause you like fucking little weak topos. GERARDO Bastard. Stop it. SAÚL  Hija de la chingada...  Gerardo growls and grabs his wrists. They play wrestles in bed, with Gerardo pinning a writhing Saúl down and smothering him, then kissing him. Saúl squeals. GERARDO Where’s Cassandro now? Gerardo easily holds down Saúl as he tries to fight back. Then the wrestling relaxes into more tender romantic kisses. Gerardo rolls over on his back. GERARDO (CONT’D) I got to get a beer. 51. SAÚL Okay. He slips on underwear and walks to the main room. Alone, Saúl looks at the child's baseball hat hanging on the wall. Saúl hears Gerardo in the kitchen open the fridge and take out a beer. Saúl hears the sound of a beer can popping open. EXT. SOFTBALL FIELD - AFTERNOON Yocasta and Saúl are in Yocasta's old beat-up car watching Eduardo play in the softball game. Yocasta is in the driver's seat. Saúl is miserable that they are here again. Saúl angrily gets out of the car and walks around to her driver side window. SAÚL (CONT’D)  Let's go, Mom. Let's go, scoot over.  Vámonos, ma. Vámonos, órale . YOCASTA  Leave me be.  No, Saúl, déjame.  SAÚL  I'm going to take you somewhere special. Come on, let's go!  Te voy a llevar a un lugar bien bonito, vas a ver. Órale, ya estuvo.  Yocasta shifts over to the passenger seat as Saul gets in the drivers side. SAÚL (CONT’D)  I'm telling you, you're gonna love this place. All right? It's really lovely.  Vas a ver, te va a encantar este lugar que te voy a llevar. Bonito, bonito.  Saul drives the car away. INT/EXT. YOCASTA'S CAR ",
      "dialogue_count": 0,
      "word_count": 1205
    },
    {
      "scene_number": 4,
      "slugline": "INT. SAÚL ’S CAR - ALLEY - NIGHT Saúl and Sabrina smoke cigarettes, parked. She waits for a moment, decides to get a little personal for the first time. SABRINA Where’s your dad? SAÚL No. SABRINA It sounds like a story.  SAÚL Oh, no, there's nothing much to tell, no.  SABRINA Yeah, I don’t believe that. Saúl thinks for a minute. Then slowly he opens up. SAÚL So… my mom met him at a party when she was… she was very young. And, um, and they started to have an affair, instantly. That lasted years. But he had a wife. And then he had many kids. My mom was so in love with him. I think she still is. SABRINA So you-you knew him? Saúl pauses, takes a long drag of cigarette. SAÚL Yeah. Yeah, he introduced me to lucha libre. Took me to a few matches. SABRINA You don't... you don't see him no more? SAÚL No, not for a while. I came out when I was 15. And he's very… He's a lot into Jesus. So, one day, he just stopped coming. Sabrina nods, gives him space. 56.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 191
    },
    {
      "scene_number": 5,
      "slugline": "INT. DONUT SHOP - LATE NIGHT Young Eduardo and Young Saúl sitting at the counter of an all- night donut shop. Young Eduardo is seen indirectly, obscured. Menudo's \"Claridad\" plays on the shop's jukebox in the corner. Young Eduardo dips his doughnut into his cup of black coffee and passes it to Young Saúl. Young Saúl takes the doughnut and savors a bite. Young Saúl dunks the last piece of his doughnut into his father's cup, watching the doughnut fall apart into a soggy mess. The powdered sugar from the doughnut swirls into a whirlpool.  Music begins. MONTAGE: EXT. STREETS - DAY - MONTAGE Saúl runs as training, faster. EXT. SABRINA’S BACKYARD - DAY - MONTAGE Sabrina coaches Saúl as he lifts weights. EXT. WRESTLING VENUE - DAY - MONTAGE Lorenzo smokes cigarettes as one of his cronies takes pictures of Cassandro posing on an old point and shoot 35mm camera. EXT. EL PASO STREET - DAY - MONTAGE We see hands putting up a makeshift flyer on telephone poles, photocopied and typewritten, with one of the photos of Cassandro advertising him on a fight card. INT. WRESTLING VENUE - NIGHT - MONTAGE Backstage at a fight, Sabrina unhappily watches as Lorenzo flatters Saúl, puts his arm around Saúl's shoulder and showers him with compliments.  LATER  In the ring: Saúl, as Cassandro, is fighting and winning against more luchadores, one a wrestler in a lizard costume. 57.",
      "characters": [],
      "action_text": "The crowds are bigger. Gerardo fights in his camouflage lucha outfit. Fighting the lizard man, blood covers his face pouring down from his forehead with dramatic effect. With each victory the crowd cheers louder. CUT TO: We see grown macho men in the audience pump their fist for Cassandro. INT. LARGER WRESTLING ARENA - NIGHT - MONTAGE Cassandro, in a bigger ring, fights three luchadores from a ladder and with break-away chairs. In the crowd, we see a skinny teenage boy wearing a Cassandro-like tiara and cheering loudly. INT. WRESTLING ARENA - NIGHT - MONTAGE Smash cut to a hulking lucha libre wrestler dressed as an astronaut swinging a fluorescent light tube onto the face of another luchador. The bulb shatters into a million pieces and blood pours from the fighter's forehead. A luchador jumps on Sabrina's back, and smashes her with a 2x4. Another wrestler tosses thumbtacks onto the ring's mat and throws the astronaut onto the ground, his back now pierced with tacks. The crowd screams as blood trickles down the mat and from the ropes. It's a chaotic scene, and blood, real blood, covers everyone. Into the arena steps Saúl as Cassandro. The music changes to a disco song and the spotlight catches him. He is carrying a baseball bat and is wearing a lace cocktail dress and a tiara. INT. BACKSTAGE - NIGHT - MONTAGE Lorenzo hands Saúl a huge wad of cash after a fight. Saúl, in pain from the fights, injects himself with a painkiller. EXT. SAÚL'S HOUSE - DAY - MONTAGE Saúl leads his mom out front of their house and reveals the shiny new red Harley. Yocasta can't believe it. INT. DIVE BAR, JUÁREZ - NIGHT - MONTAGE 58. Saúl clinks glasses with Lorenzo as money is counted. EXT. DIVE BAR, JUÁREZ - NIGHT - MONTAGE Saúl, Sabrina, Yocasta and Felipe dance as they celebrate Saúl’s birthday. He blows out the candles as all cheer. END MONTAGE INT. SAÚL'S HOME - NIGHT Saúl lights two cigarettes off the burner of the gas stove. He enters the living room and looks at his mother lying on t",
      "dialogue_count": 0,
      "word_count": 1629
    },
    {
      "scene_number": 6,
      "slugline": "INT. GERARDO’S BATHROOM Saúl and Gerardo sit in a hot bath together. Gerardo looks down, torn about something. GERARDO The other wrestlers think you’re getting too big. SAÚL What do you mean? That’s a good thing, no? GERARDO You’re pushing things. Gerardo gets out of the bath. He stands with his back to Saúl. SAÚL So it’s my fault? Are you saying it’s my fault? GERARDO That’s not what I’m saying. I’m worried about you. Things before were... Everything had a place.  SAÚL Yeah. I was there when you wanted to fuck me and out of the way when you didn’t. Gerardo is silent. SAÚL (CONT’D) I want you to leave her. You heard me. Gerardo stiffens. He does not say anything. Gerardo walks out of the bathroom, leaving Saúl alone in the tub. INT. SAÚL'S CAR - NIGHT Saúl drives home pensively. INT. SAÚL'S HOUSE - NIGHT Saúl walks into his house. Many people are already there, with grave faces. An older woman, Saúl's aunt, sees him and hugs him. 65.",
      "characters": [],
      "action_text": "SAÚL  Hello.  Hola . SAÚL’S AUNT  Sweetie. I’m so sorry.  Mijo, lo siento.  FAMILY MEMBER  It was her heart, Saúl.  Su corazón ya no aguantó, Saúl.  INT. YOCASTA'S BEDROOM - NIGHT Yocasta's lifeless body is lying in her bed. Candles and herbs surround her. Family and friends have gathered to mourn. Saúl enters the bedroom. His cousins talk to the medicine man. Family members looks at him with empathetic eyes. Saúl ignores everyone in the room. He approaches the bed and touches his mother's cheek. GRIEVING FAMILY MEMBER  We didn’t know what to do .  Mijo, no supimos qué hacer.  MEDICINE MAN  The burial will be tomorrow at 2:00 p.m.  El entierro será mañana a las 2:00 p.m.  Around him, family members have hushed conversations. LATER Mourners usher themselves out. The room is silent. Saúl goes to his mom, caresses her cheek, gazing at her. He goes and gets his mom's make-up kit from her bag. He lays it all out in the ritualistic fashion just as his mother used to, under the Catholic icons and Dia de Muertos imagery. He kneels beside her bed and carefully, tenderly, does her make-up. It's the best damn make-up job he's ever done. He looks at her as if she might still open her eyes and see him again. She looks beautiful. 66.",
      "dialogue_count": 0,
      "word_count": 393
    },
    {
      "scene_number": 7,
      "slugline": "INT. SAUL'S HOUSE - BURIAL CEREMONY - DAY Saúl stands surrounded by Sabrina and his extended family. The Medicine Man places herbs in the coffin, which is already filled with many of Yocasta's belonging - clothes, jewelry. Saúl crosses himself. The Medicine Man does a ritual with smoke over Yocasta lying in bed. MEDICINE MAN (CONT’D)  Today is a good day to die.  Hoy es un buen día para morir.  Saúl looks to his mother and the icon of Christ above her. INT. SAÚL'S HOUSE - NIGHT Saúl's house is messier than before his mother died. There are old fast food wrappers, dirty dishes. Walking by Yocasta’s room, Saúl pauses to look at her now empty bed. INT. SAÚL'S HOUSE - KITCHEN - NIGHT Saúl lights only one cigarette off the gas stove. EXT. SABRINA'S BACKYARD - NIGHT Sabrina and Saúl are watching an old movie projected from a beat-up video projector onto a bedsheet in her backyard. Sabrina wears an old ripped T-shirt with a logo for the band \"The Specials.\" Sabrina’s daughter and teenagers from the neighborhood have come to watch the movie. They are watching Santo y Blue Demon contra los Monstruos (1970) and cheering Santo, doing their own moves and playing acting in the throw of the projector. Saúl is wrapped up in the movie. SABRINA She’s gonna be watching over you in Mexico City. Everyone will. You’re gonna be all over TV.  Saúl is barely listening, so intent on the movie. SAÚL Shit yeah? 67.",
      "characters": [],
      "action_text": "SABRINA Shit yeah. She swigs a beer. This last line hits Saúl. He starts to feel scared. EXT. MEXICO CITY - DAY Aerials of Mexico City. Sabrina and Saúl marvel at the city - they've never seen an urban center like this before. EXT. PALACIO DE LOS DEPORTES - AFTERNOON The magnificent domed stadium towers above Saúl and Sabrina as they enter the building. Saúl is wearing sunglasses and a zebra print top. SABRINA It’s huge. Saúl and Sabrina are met at the entrance by an assistant. RICARDO  Cassandro! Welcome, how are you? What’s your name?  ¡Cassandro! Bienvenido, ¿cómo estás? ¿Tú cómo te llamas?  SABRINA Sabrina. RICARDO  Nice to meet you. I’m Ricardo. Come on. My uncle is waiting for you.  Mucho gusto, Sabrina, yo me llamo Ricardo. Mi tío los está esperando.  Ricardo leads them inside. INT. PALACIO DE LOS DEPORTES AUDITORIUM - AFTERNOON Saúl and Sabrina sit in the cavernous auditorium with the event producer. Men are working to put up a professional ring in the middle. Others are hanging lights on the grid. Saúl can't believe the size of the place, with its 16,000 seats. PRODUCER  Of course, Santo always wins, you know that. Your goal is to prove you're worthy of fighting the king. He's very excited to work with you. Only the greatest artists have played here.  (MORE) 68. He saw you in video or something. You're gonna like him. I mean... he's the Son of Santo.  Va a estar cabrón, ganarle al Hijo del Santo. Lo que tienes que lograr es que toda esta gente, hasta la última silla, te idolatre. Que está bastante emocionado en conocerte, por cierto. Quiere que le enseñes la Vicente Guerrero que la vio en no sé qué video. Es un tipazo. Te va a caer muy bien. Digo, es El Hijo del Santo.  SAÚL  The legend!  ¡La leyenda!  PRODUCER  Exactly.  La leyenda, ¿no?  SAÚL  A living legend!  ¡Es la leyenda viviente!  PRODUCER  For now, get some rest. Try not to party too hard while in Mexico City.  Mira más, descansa. No vayan a agarrar mucho pinche desmadre aquí en la Ciudad de México",
      "dialogue_count": 0,
      "word_count": 1186
    },
    {
      "scene_number": 8,
      "slugline": "INT. HOTEL ROOM - BATHROOM Saúl washes his hands. He catches his reflection of himself in the mirror, studying what he sees. INT. HOTEL ROOM - NIGHT It's 4am. Sabrina is passed out asleep in the single bed. Saúl is sitting in a chair by the window, smoking a cigarette and drinking a beer with a few more empty bottles in front of him. Saúl crushes the cigarette out in the ashtray and lights a new one. SAÚL Sabri? He says it calmly. He waits for her to move. SAÚL (CONT’D) Sabri. Sabri! Sabrina opens an eye and sees Saúl collapsed on the chair. SAÚL (CONT’D) They sold the house. The one up the hill with the heart-shaped swimming pool. It's gone. They bought it. Somebody bought it. It's gone, Sabri. Sabrina sits up in bed, listening. SAÚL (CONT’D) Ah, we were gonna be dancing. Living room with a fireplace and smoking in the kitchen, the huge yellow kitchen that was there. (then, pained)  Oh, fuck. Ay.  La puta madre. Ay.  Saúl pauses, taking a drag in his cigarette. Sabrina gets out of bed and goes to Saúl. SAÚL (CONT’D) That-that was the only reason I wanted to be here. Saúl collects himself, looks to his cigarette. 73.",
      "characters": [],
      "action_text": "SAÚL (CONT’D)  But it’s over. I’m done. Last one. I’m done. No more.  Pero ya. Ya. La última. Y ya. Ya no más.  Saúl looks at her with hooded lids. His eyes open. Sabrina embraces him. SABRINA Saúl. SAÚL No more. SABRINA Don’t.  SAÚL Hey. Hey.  SABRINA Come on. SAÚL No. SABRINA Come on. She guides him to slowly to bed. SAÚL  Sí. I love you, girl.  Sí. Te quiero, morra.  SABRINA  I love you too.  Yo también te quiero.  INT. ARENA WINGS - NIGHT Lorenzo, wearing a slick suit, stands with Saúl by the stage door. Lorenzo slaps him on the back. LORENZO  Twenty-two thousand people are coming to see you, man. I told you. We made it!  22 mil personas vienen a verte, cabrón. Te lo dije, ¡lo logramos!  74. SABRINA  Yeah.  Ey.  LORENZO  Do you have someone watching at home?  ¿Tú te crees que te estén viendo en tu casita?  SAÚL  No. You know, because…  No. No, porque…  (he thinks, then)  Well, maybe my dad. Yeah, maybe him. I hope so.  Bueno, por ahí mi papá. Yo creo que mi papá. Ojalá.  Lorenzo puts his hand on Saúl’s shoulder, walks away. INT. ARENA MÉXICO - NIGHT Saúl in a massive dressing room. Naked from the waist-up except for purple sequined elbow length opera gloves, he reaches into his pink rolling suitcase. He places the photo of his mother and the eagle feather on the dressing table. Then he carefully lays out and performs his make-up ritual. He applies lipstick, powder, blush. He slips into the rest of his outfit. It’s his most flamboyant Cassandro outfit yet. Towering feather plumage, a floor length evening gown. He looks stunning. He can hear the crowd chanting from the stadium. CROWD (CHANTING)  Santo! Santo! Santo! INT. SAÚL'S HOUSE - NIGHT We hear the deep voice of Young Eduardo call and yell at the wrestlers on the TV. ECU of Young Saúl's eyes watching. Eduardo woops in delight. Young Saúl watches in hushed awe, taking it all in. He joins his father in a cheer. YOUNG EDUARDO/YOUNG SAÚL Santo! Santo! Santo! Santo!  INT. RING - NIGHT 75. A microphone is lowered f",
      "dialogue_count": 0,
      "word_count": 1330
    },
    {
      "scene_number": 9,
      "slugline": "INT. RING - NIGHT Back in the ring with Santo, the sound is deafening. Something in Saúl snaps. Sabrina sees this and gasps. Saúl is frozen. The Referee pulls Saúl off Santo, who pushes him. SANTO  What’s wrong with you?  ¿Qué te pasa, cabrón?  CROWD (CHANTING)  Faggot! Fagott!  ¡Puto! ¡Puto!  Overcome, Cassandro rolls out of the ring and runs. Runs right out of the arena to the exit door as the Crowd get on their feet to see where he went. The screaming mob looks around, confused. As does Lorenzo, Sabrina, the Referee, and Santo. Then Santo points up to the balcony. A spotlight catches a lone figure standing high on the edge of the balcony. It is Cassandro. The crowd gasps. Cassandro makes a flamboyant upward gesture with his arms. With that, he swan dives fifty feet right down into the audience below. He is caught by the crowd, and carried across the rippling hands and faces of the screaming masses. Cassandro acts like he is floating in the sea, pantomiming swimming and crowd surfing. He then somersaults back into the ring, and Santo bellows. Cassandro blows a kiss to the crowd and winks. They cheer him on. Sabrina and Lorenzo leading the cheer. CROWD (CHANTING) (CONT’D)  Cassandro! Cassandro! Cassandro!  Cassandro leaps up on top of the ropes and nimbly dances along them like a tight rope walker. But Santo comes up behind him and yanks his legs, sending Cassandro toppling to the ground. It isn't long before Santo has him in a ghastly choke hold. The fight is over, with Santo the winner as he must be. The Referee holds the belt for Santo. Cassandro rushes to grab it, hands it to Santo himself. They share a hug. 79.",
      "characters": [],
      "action_text": "Cassandro has come out on top nonetheless. The crowd loves him. As he bows and twirls in front of the audience, the crowd throws roses at him and screams. LORENZO  Bravo!  A number of super fans start to scramble up into the ring. Sabrina muscles her way up too. She reaches Saúl in the spotlights, ecstatic. Out of respect, Santo puts Cassandro on his shoulders and walks him around the ring. He is surrounded and his new fans reach out to try to touch his cape. EXT. CEMETERY - DAY Saúl is in the cemetery where his mother is buried. The edges of the frame team with the colorful plastic blossoms, and the piles of them stretch on forever. He sits at his mother's grave. SAÚL  He carried me on his shoulders, and everyone was screaming.  Me llevó en hombros, toda la gente gritaba.  Tears fall from his eyes. He laughs a little through them. It's the first time we've seen Saúl cry. INT. SAÚL'S CAR - CEMETERY - DAY Saúl lifts up an unlit cigarette from the ashtray. He studies it a moment, decides to put it back. In his rearview mirror he sees a man now at the grave. It is his father, EDUARDO. Now age 59. Saúl freezes, he starts the car and drives away. INT. JUÁREZ BAR - NIGHT Back in Juárez, Saúl is out drinking with his wrestling crew to celebrate his success in Mexico City. Gerardo sits amongst them at the bar. SAÚL  I was talking to Santo's team. They want to set something up in New York, or maybe Boston.  (MORE) 80. I don't remember which cities exactly.  No, si estuve hablando ahí con la gente del Santo. Como para ir a montar algo ahí en Nueva York, o en Boston. O algo así, no me acuerdo qué ciudades.  EL MYSTERIOSO  So, just between us, what was he like?  Oye, ya así, en corto, ¿cómo se porta?  SAÚL  He's a nice guy.  Bien.  WRESTLER #2  Did he take off his mask backstage?  ¿No se quitó la máscara en el camerino?  SAÚL  No way, he's the real deal. They say he never takes it off, not even when he sleeps.  No, pues es de verdad. Sí, ni siquiera para dormir, dicen. En serio",
      "dialogue_count": 0,
      "word_count": 3623
    }
  ]
}