{
  "slug": "catch-22-101-episode-1-1-2019",
  "title": "catch 22 101 episode 1 1",
  "genre": "action",
  "format": "series",
  "scenes_count": 2,
  "characters_count": 0,
  "characters": [],
  "total_words": 10376,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. TARMAC - DAY (”MAD MONK FUGUE”/COLD OPEN)  Black screen. Jagged, confusing NOISE, distant at first, then rising, more and more insistent. The roar of loud engines. Not all of them running smoothly. FADE UP: sunlight piercing here and there through dense swirling smoke, as a FIGURE EMERGES. (Gradually, we’ll learn this is YOSSARIAN, 27, our hero. But for now it’s just a figure, all shadow and silhouette in the swirl and confusion.) The landscape is like a netherworld, everything amorphous. There’s just this lone figure, lurching in a daze. Every so often we catch a clearer glimpse of him: - it’s possible this is an ENTIRELY NAKED MAN. CLOSER on him now, as he walks through the black smoke. His eyes blank. His face oily, begrimed. His hair askew. His clothes smeared with something greasy, viscous and awful. In the far distance, there are other noises, vaguely recognizable. A distorted voice on a bad PA system, its tone insistent but unintelligible. The persistent rumble of those powerful engines. He seems oblivious to it all. REVERSE. We’re following him now. It’s definitely a naked man. Walking through some outer circle of Dante’s Inferno. Two young FIREFIGHTERS pass, unfurling a giant hose, a fraction SLOW MOTION. As they pass, they turn back and look for a moment: did they just see a naked man? Yossarian, oblivious to them. Lost in some world of his own. Striding. Blank. Impossible to read as the thick swirling smoke finally clears and we see his red-smeared face clearer for the first time, emerging into sunlight. We travel with this spectral figure CLOSE, across the tarmac, until we slam into:  INT. BEDROOM - DAY  Yossarian and MARION (late 30s, wild, bookish, sad and lusty) are having beautifully enthusiastic sex. This is steamy. Really, truly excellent. An awful lot of fun. LATER. Yossarian is sitting up in bed smoking a post-coital cigarette while Marion gets dressed. YOSSARIAN Name one thing I’ve got to be thankful for.  (CONTINUED)",
      "characters": [],
      "action_text": "MARION Me. YOSSARIAN Oh, come on. MARION Aren’t you thankful for me? YOSSARIAN I’ll bet I can name two things to be miserable about for every one you can name to be thankful for. MARION Be thankful you’ve got me. YOSSARIAN I am, honey. But I’m also goddamn miserable that I can’t have Dori Saltz again, too. Or the hundreds of other girls I’ll want in my short life and won’t be able to go to bed with even once. MARION Be thankful you’re healthy. YOSSARIAN Be bitter you’re not going to stay that way. MARION Be glad you’re even alive. YOSSARIAN Be furious you’re going to die. MARION Things could be much worse! YOSSARIAN They could be one hell of a lot better. MARION You’re naming only one thing. You said you could name two. YOSSARIAN And don’t tell me God works in mysterious ways. There’s nothing mysterious about it. He’s not working at all. He’s playing. Or else He’s forgotten all about us. He’s a brainless conceited hayseed.  (MORE) (CONTINUED)  2 How much reverence can you have for a Supreme Being who finds it necessary to include phlegm and tooth decay in His divine system of creation? What was running through that warped mind of His when He robbed old people of the power to control their bowel movements? Why the hell did He create pain? MARION Pain is useful. Pain is a warning to us of bodily dangers. YOSSARIAN And who created the dangers?! He was really being charitable when He gave us pain! Why couldn’t He have used a doorbell to let us know, or one of His celestial choirs? Or a system of blue-and-red neon tubes right in the middle of our foreheads. Any jukebox manufacturer worth his salt could have done that. MARION People would certainly look silly walking around with red neon tubes in the middle of their foreheads. YOSSARIAN They certainly look beautiful now writhing around in agony or stupefied on morphine, don’t they? What a colossal spastic. When you think about the chance He had to do something good, and then look at the stupid, ugly mess He made of it ins",
      "dialogue_count": 0,
      "word_count": 8400
    },
    {
      "scene_number": 2,
      "slugline": "EXT. AIRSTRIP - MORNING  CREWS OF MEN trundle across the tarmac as planes start up for the Arezzo mission. Here’s Yossarian looking wholly unhappy to be flying another mission. McWatt, Kid Sampson and Nately walk with him, each with their own private pre-mission jitters. Yossarian looks over to see Dunbar and his CREW heading towards another plane.  INT. B-25 BOMBER (& EXT. SKIES OVER AREZZO)  In the plane with Yossarian: ahead in the distance, a town comes into view. Arezzo. McWatt chatters away on the radio. Kid Sampson, his improbably cherubic-looking co-pilot. Nately, tense, manning the tail gun. And then the dreaded German flak appears - a   skitter-skatter  sound like hail on a tin roof, and those evil puffs of black suddenly blooming all around us. Sudden chaos in the nose cone and cockpit and the air all around: engines screeching, men screaming their instructions. In all the chaos, Yossarian looks up for an instant from his bombsight as the target looms ever closer - - across in the nose cone of the next plane is Dunbar. He waves at Yossarian, sharing the surreal experience and throws him a cheeky thumbs-up. Yossarian smiles at him - just as a German anti-aircraft round pierces Dunbar’s plane with perfect precision - - and in an instant the plane explodes outwards in all directions - - and Dunbar, horrified - or rather, utterly uncomprehending - is shot out of the plane into the thin air and hurtles straight towards us from 50 feet away. Airborne like a skydiver, arms and legs spreadeagled, Dunbar SPLATS horrifically into Yossarian’s nose cone - like a bug onto a windscreen – inches from Yossarian’s own equally horrified, equally uncomprehending face. Dunbar hangs there for a millisecond, with that final look of terror on his face, before being swooped into the roaring void.  (CONTINUED)  42",
      "characters": [],
      "action_text": "In the midst of the mayhem, Yossarian is left sitting there, stunned by the close encounter with Dunbar’s face. MCWATT (O.S.) That was Dunbar’s plane! That was Dunbar’s plane! NATELY   (O.S.) Holy fuck! KID SAMPSON (O.S.) What are we doing, Yo-Yo? Are we dropping them? Yossarian snaps back into action and turns his attention back to the bombsight - – the landscape rushing by beneath us through the crosshairs - NATELY (O.S.) Is Dunbar going down? - Yossarian looking from viewfinder to horizon, viewfinder to horizon - - his fingers gripping the release lever - - CLICK! – Yossarian releases the bomb drop lever. The bombs drop out of the hatch, one after the other, to begin their whistling descent - YOSSARIAN Get us out of here, McWatt! Get us the goddamn fucking goddamn out of here! NATELY (O.S.) What happened to Dunbar? YOSSARIAN They’re gone. Dunbar’s gone. The plane engines whine as McWatt hauls the B-25 into a gravity-defying parabola. As the G-force pushes Yossarian’s face against the plexiglas, he comes face to face, in intimate proximity, with a ghastly sight - - a smear of BLOOD - a gruesome trace of Dunbar’s impact with the nose cone. The wind buffeting the blood in a raked pattern as it trickles across the plexiglas. All is NOISE and CHAOS and RATTLING and SHOUTING inside the plane, but for just an instant Yossarian is like a child studying a snowflake. The wonder of nature.  (CONTINUED)  43 EXTERIOR: meanwhile back outside, the extraordinary high- altitude ballet of ten planes peeling off in all directions in a sky spackled with flak, as huge explosions thump and bloom on the ground thousands of feet below.  INT. SHOWER BLOCK - NIGHT  Yossarian and the gang shower. The mood is solemn.  EXT. MESS HALL - NIGHT  Yossarian and the gang sit there eating in silence.  EXT. BASKETBALL COURT - DAY  Yossarian and the gang play a vigorous game of basketball. Whereas the last time they played they were laughing and wisecracking, here they’re simply more focused and phys",
      "dialogue_count": 0,
      "word_count": 1976
    }
  ]
}