{
  "slug": "catwoman",
  "title": "Catwoman",
  "genre": "unknown",
  "format": "film",
  "source": "imsdb",
  "scenes_count": 156,
  "characters_count": 48,
  "characters": [
    "ALL SCRIPTS",
    "CATWOMAN",
    "SECOND DRAFT POLISH",
    "A ROOFTOP",
    "EDNA",
    "PATIENCE",
    "GEORGES",
    "SALLY",
    "BERGER",
    "LAUREL",
    "WESLEY",
    "ANGEL",
    "WITH BERGER",
    "LONE",
    "RANDY",
    "BOUNCER",
    "YOUNG PATIENCE SOBBING.",
    "NEIGHBOR",
    "PUPILS.",
    "BEEP.",
    "NEVSKI",
    "MEDICAL PHOTOS.",
    "PROCESS SERVER",
    "MULTIPLE ALARMS RING.",
    "SANDY",
    "BARTENDER",
    "STOPS.",
    "BAG.",
    "CLOSES THE BLINDS.",
    "COMPUTER VOICE",
    "MOVE IN ON CATWOMAN'S FACE.",
    "PANE OF GLASS.",
    "ON CATWOMAN'S HANDS",
    "ANNOUNCER",
    "DRINA",
    "CONVEYOR BELTS.",
    "GUARD",
    "BITTEN GUARD",
    "HUNDREDS OF GLEAMING EYES.",
    "LANDLADY",
    "XAVIER",
    "NEWSCASTER",
    "PATROL COP",
    "DIRECTOR",
    "ASSISTANT",
    "PILOT",
    "CLOSES THE SUITCASE.",
    "THE END"
  ],
  "total_words": 25829,
  "total_dialogue": 696,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "OPENING",
      "characters": [
        "ALL SCRIPTS",
        "CATWOMAN",
        "SECOND DRAFT POLISH"
      ],
      "action_text": "The Internet Movie Script Database (IMSDb) The web's largest movie script resource! Search IMSDb Alphabetical # A B C D E F G H I J K L M N O P Q R S T U V W X Y Z Genre Action Adventure Animation Comedy Crime Drama Family Fantasy Film-Noir Horror Musical Mystery Romance Sci-Fi Short Thriller War Western Sponsor TV Transcripts Futurama Seinfeld South Park Stargate SG-1 Lost The 4400 International French scripts Latest Comments ALL SCRIPTS CATWOMAN by Dan Waters based on characters from DC Comics",
      "dialogue_count": 3,
      "word_count": 119
    },
    {
      "scene_number": 2,
      "slugline": "INT. TEMPLE OF BAST - NIGHT",
      "characters": [],
      "action_text": "START ON THE FACE of A GOLDEN CAT STATUE. This is the cat- god BAST, lithe, noble, beautiful. CAMERA MOVES to reveal the statue is 50 feet tall, dominating this space. Other images of CATS -- hieroglyphics, ceramics -- abound, as do -- REAL CATS, hundreds of them, slinking in the shadows on ramps cut into the sandstone walls of this Egyptian temple. At Bast's feet, EIGHT ACOLYTES in GOWNS kneel in a semi- circle around a flaming BRAZIER. Some of the women WEEP, others PRAY or stare stoically ahe",
      "dialogue_count": 0,
      "word_count": 111
    },
    {
      "scene_number": 3,
      "slugline": "EXT. TEMPLE OF BAST - NIGHT",
      "characters": [],
      "action_text": "THE TEMPLE is an impressive place of worship -- tapered columns and an ornate Egyptian facade -- at the apex of a hilltop VILLAGE, in FLAMES, under ATTACK by a PERSIAN ARMY. SUPERIMPOSE:   \"496 B.C.\" WHAM! THE STEEL PRONG of a mounted BATTERING RAM swings into the ornate DOORS of the temple. PERSIAN SOLDIERS operate the brutal siege engine, SLAM the doors again and again.",
      "dialogue_count": 0,
      "word_count": 65
    },
    {
      "scene_number": 4,
      "slugline": "INT. TEMPLE OF BAST - NIGHT",
      "characters": [
        "A ROOFTOP"
      ],
      "action_text": "The HIGH PRIESTESS wears a special HOODED WHITE GOWN that mostly conceals her face. She moves from one ACOLYTE to the next, pours a DARK LIQUID from a bejeweled decanter into golden goblets, then pours one for herself. She raises her goblet toward BAST, as do the others -- they drink in unison. HIGH ANGLE as the GOBLETS CLATTER to the floor and the WOMEN SLUMP to the ground... dead. PULL BACK -- we're watching this from the PERSPECTIVE of an EGYPTIAN MAU CAT -- slim, elegant, dark-spotted gray a",
      "dialogue_count": 1,
      "word_count": 372
    },
    {
      "scene_number": 5,
      "slugline": "EXT. EDNA'S NEIGHBORHOOD - DAY",
      "characters": [],
      "action_text": "THE MAU settles by a SATELLITE DISH, looking down on a present-day suburban street, a busy main drag. MARSHLAND and WATER are visible not far away, light RAIN FALLS. (CONTINUED) 3. CONTINUED: SUPERIMPOSE:        \"2500 YEARS LATER.\" The MAU watches as, ACROSS THE STREET, a BUS pulls away from the curb to reveal a WOMAN in a HOODED WHITE PONCHO -- the outfit recalls the high priestess of Bast. The HOOD is thrown back, revealing PATIENCE PRICE, 25-35, attractive but inclined to conceal her looks --",
      "dialogue_count": 0,
      "word_count": 154
    },
    {
      "scene_number": 6,
      "slugline": "EXT. EDNA'S HOME - DAY",
      "characters": [
        "EDNA",
        "PATIENCE"
      ],
      "action_text": "An eccentric, ramshackle home amongst neat, well-kept houses. PATIENCE moves to the front door, RINGS. As she waits, she notes the lawn GRASS grown high, CLIMBING CAT SCULPTURES on the shingles. A SIGN by the door: \"FELINE RESCUE SOCIETY.\" EDNA POWERS opens the door on a chain. She's 50-70, a former academic, intelligent, charming, but quite intimidating. EDNA Yes? PATIENCE Hi, Edna Powers? (off her nod) I'm Patience Price, I called about adopting a cat? I saw your flyer at my vet's office -- ED",
      "dialogue_count": 3,
      "word_count": 99
    },
    {
      "scene_number": 7,
      "slugline": "INT. EDNA'S HOME - LIVING ROOM - DAY",
      "characters": [
        "PATIENCE",
        "EDNA"
      ],
      "action_text": "PATIENCE, out of her poncho, fills out a questionnaire on a clipboard. Numerous CATS roam the premises. Feline artwork and curios, scratching posts, furry toys... cat paradise. (CONTINUED) 4. CONTINUED: PATIENCE ... Ma'am? EDNA is putting out DRY CAT FOOD in numerous BOWLS. EDNA You may call me Edna. PATIENCE Edna. Some of these questions are... kind of personal. Do you really need to know how many, um, partners I've had in the past year? EDNA I'm not interested in your love life. But I do want",
      "dialogue_count": 29,
      "word_count": 672
    },
    {
      "scene_number": 8,
      "slugline": "INT. PATIENCE'S APARTMENT - NIGHT",
      "characters": [
        "GEORGES",
        "PATIENCE"
      ],
      "action_text": "CAMERA MOVES THROUGH this modest, neat studio apartment, PAST a BULLETIN BOARD with numerous PHOTOS. One or two show a YOUNG PATIENCE, there's a picture of a LITTLE GIRL between TWO SMILING PARENTS on a ROLLER COASTER. Mostly, though, they're snapshots of a chubby TABBY CAT, from kitten hood to old age. Suddenly, MIDNIGHT LUNGES INTO FRAME, attacking a picture of FATSO, ripping it from the bulletin board. KEEP MOVING PAST WINDOWS facing on the street and an adjacent BUILDING across an alley -- i",
      "dialogue_count": 8,
      "word_count": 536
    },
    {
      "scene_number": 9,
      "slugline": "INT. PATIENCE'S APARTMENT - BATHROOM - NIGHT",
      "characters": [
        "PATIENCE"
      ],
      "action_text": "THE BATHROOM WINDOW faces into Lone's bedroom. He starts to unbutton his shirt, glances casually out the window -- PATIENCE immediately ducks out of sight.     A moment later, she rises slowly to peek out again -- THE WINDOW is DARK, LONE has turned off THE LIGHT. PATIENCE flips ON THE LIGHT, studies her face in the mirror. PATIENCE Lame, lame, lame. She wipes a bit of chocolate from the corner of her mouth. She tries a seductive pout, a la Laurel, gives her hair a seductive toss -- it winds up",
      "dialogue_count": 1,
      "word_count": 137
    },
    {
      "scene_number": 10,
      "slugline": "INT. AVENAL HQ - SHOWROOM - DAY",
      "characters": [
        "SALLY",
        "PATIENCE"
      ],
      "action_text": "MOVING CAMERA delivers an assault on the senses: MIRRORS, oversized versions of the BEAUTY PRODUCTS, charts of COLOR CHOICES, shelves upon shelves of slickly-packaged COSMETICS. Prominent is a DISPLAY for BEAUNIQUE. HIP MUSIC in BG. AVENAL GIRLS, perfectly coiffed and made-up Barbie dolls, busily paint the faces of CLIENTS, women of all ages and backgrounds, in high-tech MAKE-UP CHAIRS that resemble torture devices. PATIENCE crosses through, pausing to take off her sneakers and pull on a pair of",
      "dialogue_count": 3,
      "word_count": 172
    },
    {
      "scene_number": 11,
      "slugline": "INT. AVENAL HQ - ACCOUNTING BULLPEN - DAY",
      "characters": [
        "PATIENCE",
        "BERGER"
      ],
      "action_text": "OVERHEAD ANGLE on a rat's maze of office cubicles, peopled with ACCOUNTING STAFF. FIND PATIENCE tapping at her terminal, sipping COFFEE. It's a grim little space, enlivened by a GARFIELD toy, some New Yorker cartoons. PATIENCE seems bored by the drone work -- then she cocks her head at something on the screen, leans closer. She double- checks DATA in the print-outs. Something doesn't tally. ON SCREEN -- among a long list of figures, we see \"YP-3\" highlighted, followed by a series of numbers. PAT",
      "dialogue_count": 3,
      "word_count": 227
    },
    {
      "scene_number": 12,
      "slugline": "EXT. AVENAL HQ - DAY",
      "characters": [],
      "action_text": "-- CAMERA SWINGS UP the 40-story skyscraper in the business district of a city mixing architecture old and new. CAMERA PASSES a WINDOW WASHER on a cable-driven rig.    NEARING the ROOF, we see a glowing sign which reads \"AVENAL BEAUTY\" -- and a PASSENGER CHOPPER coming in for a landing.",
      "dialogue_count": 0,
      "word_count": 50
    },
    {
      "scene_number": 13,
      "slugline": "EXT. AVENAL HQ - HELIPAD - DAY",
      "characters": [
        "LAUREL",
        "GEORGES"
      ],
      "action_text": "THE CHOPPER touches down on a HELIPAD atop an elevated PENTHOUSE. GEORGES AVENAL emerges, ducking in the blade wash. The company's CEO, Georges is charismatic, handsome, immaculately tailored -- an exacting asshole to the core. Getting out of the helicopter behind him, his menacing, silent bodyguard ANGEL carries a leather suitcase or two. LAUREL AVENAL trots toward her husband with open arms. Laurel is 30-something, a still-gorgeous super-model but, in person, a tad past her prime. She comes ac",
      "dialogue_count": 5,
      "word_count": 222
    },
    {
      "scene_number": 14,
      "slugline": "INT. AVENAL HQ - PENTHOUSE - DAY",
      "characters": [
        "LAUREL",
        "GEORGES"
      ],
      "action_text": "LAUREL protests, examining her body. LAUREL No no, it's muscle -- I've been working out, doing my Tae Kwan Do -- She flexes a MUSCLE to demonstrate. GEORGES isn't interested, looking at the penthouse decor with distaste. Meanwhile ANGEL moves to an elevator, presses a down button and awaits his masters. The penthouse is a large, dramatic space, decorated in a frilly, Louis XIV style -- classical STATUARY of nude females, ornate DRAPERIES across one wall -- there are LADDERS, cans of paint, a wor",
      "dialogue_count": 6,
      "word_count": 182
    },
    {
      "scene_number": 15,
      "slugline": "INT. AVENAL HQ - ELEVATOR BANK - DAY",
      "characters": [
        "GEORGES"
      ],
      "action_text": "A LARGE GRAPHIC depicts LAUREL and GEORGE together. PATIENCE curls her lip at this as she presses the DOWN button. DOORS OPEN to reveal the real     LAUREL and GEORGES, startling Patience a bit, the impassive     ANGEL behind them. Patience takes a half-step forward and     hesitates, reluctant to get aboard, frozen in place. The      DOORS start to close, then open again -- she's in the way. GEORGES In or out? PATIENCE meekly steps into the elevator, presses a button for the lobby, nervously ke",
      "dialogue_count": 1,
      "word_count": 89
    },
    {
      "scene_number": 16,
      "slugline": "INT. AVENAL HQ - ELEVATOR - DAY",
      "characters": [
        "GEORGES",
        "PATIENCE",
        "LAUREL"
      ],
      "action_text": "GEORGES leans past her to hit \"DOOR CLOSE.\" Many CAT HAIRS are sprinkled on her clothes, he SNIFFS and stifles a sneeze. He looks Patience over, and doesn't like what he sees. GEORGES Excuse me, miss. Do you know who I am? (CONTINUED) 14. CONTINUED: PATIENCE Um... of course. You're Georges Avenal -- you own the company -- GEORGES Then you actually work for me.   Are you familiar with our products? PATIENCE Yes sir, I just can't really afford them -- GEORGES You can afford some peroxide, can't yo",
      "dialogue_count": 17,
      "word_count": 304
    },
    {
      "scene_number": 17,
      "slugline": "INT. JOEY'S DINER - DAY",
      "characters": [
        "PATIENCE",
        "SALLY"
      ],
      "action_text": "A retro place, PATIENCE and SALLY sit in a booth over SALADS and SODAS. Sally leans across the table, fixing Patience's make-up -- her mascara's run from crying, her nose is red. An open MAKE-UP POUCH rests between them. PATIENCE I try, Sally, I really do. I read Vogue, I wear uncomfortable shoes... I've been a female all my life, you'd think I'd be better at it by now. SALLY Watch the frown lines, you'll need a lift before you're forty. (CONTINUED) 16. CONTINUED: PATIENCE He's right, I'm not ev",
      "dialogue_count": 11,
      "word_count": 289
    },
    {
      "scene_number": 18,
      "slugline": "INT. LIMOUSINE - DAY",
      "characters": [
        "WESLEY",
        "GEORGES",
        "LAUREL",
        "ANGEL"
      ],
      "action_text": "LAUREL is fixing her make-up meticulously in a COMPACT MIRROR, looking for signs of the dreaded zit. GEORGES is flipping through AD LAYOUT BOARDS. WESLEY, a weasely ASSISTANT, is seated between them, going over an electronic appointment book. A CHAUFFEUR, ANGEL in the passenger seat. WESLEY You're both scheduled to appear at the Make-Overs for the Homeless event on the 25th -- GEORGES Ugh.   That one's yours, Laurel. WESLEY The ballet opens the following Friday -- GEORGES (re: the ad boards) The",
      "dialogue_count": 16,
      "word_count": 256
    },
    {
      "scene_number": 19,
      "slugline": "INT. AVENAL HQ - BERGER'S OFFICE - DAY",
      "characters": [
        "BERGER",
        "GEORGES",
        "WITH BERGER"
      ],
      "action_text": "BERGER peers at his TERMINAL, a half-eaten SANDWICH nearby. He's marked up the PRINT-OUTS that Patience brought him. BERGER (on phone) Mr. Avenal -- I hate to bother you, sir, but we have a problem. It seems the lab has been overproducing YP-3 -- that's the anti-aging ingredient in Beaunique -- GEORGES Why are you telling me this?   It's routine to have a surplus -- (CONTINUED) 19. CONTINUED: BERGER We've stockpiled over a thousand gallons, enough to last us well into the 29th Century. GEORGES P",
      "dialogue_count": 12,
      "word_count": 214
    },
    {
      "scene_number": 20,
      "slugline": "EXT. SHOPPING DISTRICT - DAY",
      "characters": [
        "SALLY",
        "PATIENCE"
      ],
      "action_text": "START on a JEWELRY DISPLAY, a ritzy DIAMOND NECKLACE. SALLY's face appears in the window, beaming. SALLY Wow... sorry, Patience, I just found a new best friend. PATIENCE, beside her, WHISTLES appreciatively, then moves on. PATIENCE I'm sick of drooling over things I'll never have. The two are WINDOW-SHOPPING, passing a SHOE STORE, boots and high-heels... A WESTERNWEAR SHOP, belt buckles, WHIPS... SALLY Oh, you're a ray of sunshine. Tell you what, let me take you clubbing this weekend -- PATIENCE",
      "dialogue_count": 13,
      "word_count": 272
    },
    {
      "scene_number": 21,
      "slugline": "EXT. BERGER'S TOWNHOUSE - NIGHT",
      "characters": [],
      "action_text": "DAVE BERGER, the accountant, dressed casually, gets out of a CAB and heads into his modest home.",
      "dialogue_count": 0,
      "word_count": 17
    },
    {
      "scene_number": 22,
      "slugline": "INT. BERGER'S TOWNHOUSE - NIGHT",
      "characters": [],
      "action_text": "Berger SNIFFS the air quizzically as he lets himself in. He moves toward the KITCHEN. In the kitchen DOORWAY, he fumbles for a LIGHT SWITCH, flicks it on and --",
      "dialogue_count": 0,
      "word_count": 30
    },
    {
      "scene_number": 23,
      "slugline": "EXT. BERGER'S TOWNHOUSE - NIGHT",
      "characters": [],
      "action_text": "KA-BOOM!     The WINDOWS BLOW OUT with a HUGE EXPLOSION. ACROSS THE STREET, a BLACK MERCEDES pulls from the curb, HEADLIGHTS OFF, and ACCELERATES away. CUT TO:",
      "dialogue_count": 0,
      "word_count": 26
    },
    {
      "scene_number": 24,
      "slugline": "INT. PATIENCE'S BUILDING - HALLWAY - NIGHT",
      "characters": [
        "PATIENCE"
      ],
      "action_text": "PATIENCE moves to her apartment door, arms loaded with GROCERIES. She struggles to unlock the door while keeping these upright -- we see a \"HELLO KITTY\" emblem on her key chain. As soon as the door is open -- -- MIDNIGHT BOLTS out into the hall, a black streak moving toward the stairs and darting upward. (CONTINUED) 22. CONTINUED: PATIENCE Midnight!   You little monster -- Patience tosses her groceries in the door, leaving it ajar, and runs after the cat. A few moments after she's vanished up th",
      "dialogue_count": 1,
      "word_count": 121
    },
    {
      "scene_number": 25,
      "slugline": "INT. PATIENCE'S BUILDING - UPSTAIRS HALLWAY - NIGHT",
      "characters": [
        "PATIENCE"
      ],
      "action_text": "MIDNIGHT makes for an open hall window that leads onto a FIRE ESCAPE. Patience just spots her heading outside. PATIENCE Oh no...",
      "dialogue_count": 1,
      "word_count": 22
    },
    {
      "scene_number": 26,
      "slugline": "EXT. PATIENCE'S BUILDING - ALLEY - NIGHT",
      "characters": [
        "PATIENCE"
      ],
      "action_text": "Patience reaches the window just in time to see -- MIDNIGHT make a SPECTACULAR LEAP across the alleyway and -- -- LAND ON TOM LONE'S BALCONY. PATIENCE is annoyed, but also impressed, in spite of herself. PATIENCE Hell of a jump...",
      "dialogue_count": 1,
      "word_count": 41
    },
    {
      "scene_number": 27,
      "slugline": "INT. PATIENCE'S APARTMENT - NIGHT",
      "characters": [],
      "action_text": "ANGEL flings open the closet and bathroom doors in Patience's empty apartment -- no dice. On his way out, he eyes a plate of cat food and ice cream with a wince.",
      "dialogue_count": 0,
      "word_count": 32
    },
    {
      "scene_number": 28,
      "slugline": "EXT. LONE'S BUILDING - ALLEY - NIGHT",
      "characters": [
        "PATIENCE",
        "LONE"
      ],
      "action_text": "Patience clumsily CLAMBERS up Lone's RATTLING FIRE ESCAPE, reaches the level Midnight is on, moves toward the cat. (CONTINUED) 23. CONTINUED: PATIENCE You are not worth the trouble -- Suddenly, a WINDOW FLIES OPEN, just a foot away, a GUN points in her face. Patience lets out a CRY, jumps back -- LONE Freeze! It's TOM LONE.     But Patience loses her balance, FALLS -- -- and LANDS in an open DUMPSTER. LONE darts from the window, alarmed, realizing his error.",
      "dialogue_count": 2,
      "word_count": 80
    },
    {
      "scene_number": 29,
      "slugline": "EXT. PATIENCE'S BUILDING - NIGHT",
      "characters": [],
      "action_text": "ANGEL emerges, shaking his head and shrugging toward the unseen driver of the BLACK MERCEDES, then he climbs in the passenger door. As the car pulls away -- -- LONE hurries from the building next-door toward the alley.",
      "dialogue_count": 0,
      "word_count": 38
    },
    {
      "scene_number": 30,
      "slugline": "EXT. PATIENCE'S BUILDING - ALLEY - NIGHT",
      "characters": [
        "LONE",
        "PATIENCE"
      ],
      "action_text": "PATIENCE painfully gets upright, slipping in the trash, as LONE appears; he's a no-nonsense, gruff cop with a dry wit. LONE You all right? He clambers onto the dumpster's edge to help her out, she slips and slides, almost pulls him in after her. LONE I'm really sorry -- I'm a police officer, I heard the noise and just assumed... here, grab my arm. He manages to hoist Patience to the lip, she's able to climb to the ground. She's drenched in GOOEY GARBAGE, just stares at Lone, a bit dazed from the",
      "dialogue_count": 13,
      "word_count": 313
    },
    {
      "scene_number": 31,
      "slugline": "EXT. TRENDY CLUB - NIGHT",
      "characters": [
        "PATIENCE",
        "SALLY",
        "RANDY",
        "BOUNCER"
      ],
      "action_text": "SPOTLIGHTS before a NIGHTCLUB, a CROWD behind a VELVET ROPE. A HANDSOME BOUNCER stands guard. SALLY AND PATIENCE are near the front of the line. Sally has transformed herself, with heavy make-up, a revealing skin-tight outfit that shows plenty of cleavage. Patience is in a conservative dress, one she might wear to work. Sally HOWLS with LAUGHTER at something Patience has just said. Patience looks grim. PATIENCE It isn't funny. SALLY (still chuckling) Yes it is. All this time you've spent mooning",
      "dialogue_count": 20,
      "word_count": 350
    },
    {
      "scene_number": 32,
      "slugline": "INT. BUS - NIGHT",
      "characters": [],
      "action_text": "PATIENCE sits alone in the back of the bus, looks at -- A YOUNG COUPLE making out... an ELDERLY COUPLE holding hands. Her eyes drift to an AD for AVENAL BEAUTY overhead -- LAUREL and GEORGES AVENAL, arms around each other. Patience sighs and stares out the window.",
      "dialogue_count": 0,
      "word_count": 48
    },
    {
      "scene_number": 33,
      "slugline": "EXT. PATIENCE'S BUILDING - NIGHT",
      "characters": [],
      "action_text": "PATIENCE walks toward her building, the bus kiosk behind her, the BUS MOVING AWAY. The street is deserted at this hour. Patience feels very alone, until she looks up to see -- -- MIDNIGHT, perched in her window, awaiting her arrival. A smile appears on Patience's face. She quickens her step, crossing the empty street, almost to the sidewalk when -- -- AN ENGINE ROARS behind her.     Patience spins just as -- -- THE MERCEDES, LIGHTS OFF, barrels out of the darkness and -- WHAM!   Hits her full-on",
      "dialogue_count": 0,
      "word_count": 138
    },
    {
      "scene_number": 34,
      "slugline": "INT. PATIENCE'S APARTMENT - NIGHT",
      "characters": [],
      "action_text": "MIDNIGHT is bouncing off the walls, HOWLING like mad, lunging and scratching at the door. Finally, the cat charges across the floor, LAUNCHES herself in a dramatic leap and --",
      "dialogue_count": 0,
      "word_count": 30
    },
    {
      "scene_number": 35,
      "slugline": "EXT. PATIENCE'S BUILDING - NIGHT",
      "characters": [],
      "action_text": "SLOW MOTION as MIDNIGHT LAUNCHES HERSELF AT THE GLASS -- SMASH! CUT TO: 28.",
      "dialogue_count": 0,
      "word_count": 14
    },
    {
      "scene_number": 36,
      "slugline": "EXT. BRIDGE/CITY SKYLINE - NIGHT",
      "characters": [],
      "action_text": "SPLASH! A BODY (we don't get a good look) hits DARK WATER hard and vanishes below. MOVE UP TO REVEAL we're at a bridge over a river, CITY LIGHTS in the distance. ON THE ROADWAY, CAR DOORS CLOSE and the MERCEDES SEDAN SCREECHES away. CLOSER ON THE SKYLINE. A HOWL rises -- FIND MIDNIGHT, CRYING from a rooftop. Unseen CATS join in, a feline TELEGRAPH.",
      "dialogue_count": 0,
      "word_count": 65
    },
    {
      "scene_number": 37,
      "slugline": "EXT. EDNA'S HOME - NIGHT",
      "characters": [],
      "action_text": "The CAT CRY, just audible, far off. Then -- a CAT squeezes out a WINDOW at the gap in the sill... more CATS SCRAMBLE out dormers... yet MORE SHOOT OUT the flapping CAT DOOR.",
      "dialogue_count": 0,
      "word_count": 34
    },
    {
      "scene_number": 38,
      "slugline": "EXT. SUBURBAN STREETS - NIGHT",
      "characters": [],
      "action_text": "EDNA'S CATS scramble through alleyways, joined by STRAYS converging from all directions, picking up the CHORUS. It's like a flowing RIVER OF CATS.",
      "dialogue_count": 0,
      "word_count": 23
    },
    {
      "scene_number": 39,
      "slugline": "EXT. MARSHLAND - NIGHT",
      "characters": [
        "YOUNG PATIENCE SOBBING."
      ],
      "action_text": "ON MURKY MOONLIT WATER -- CAMERA MOVES past floating TRASH, a CAR TIRE, BOTTLES and CANS. We hear the CRIES of the CATS from nearby, approaching. LIGHTS of the CITY further away, the BRIDGE visible. CAMERA FINDS a nylon-encased FOOT... PAN OVER a woman's CORPSE, her clothes TORN, SOAKED and MUDDY, strewn with RIVER WEEDS. The body bobs amidst REEDS by this soggy shoreline. We reach the woman's FACE -- unnaturally pale, eyes fixed... it's PATIENCE PRICE. Dead. THE HOWLING is CLOSE now... THE CATS",
      "dialogue_count": 1,
      "word_count": 289
    },
    {
      "scene_number": 40,
      "slugline": "EXT. MARSHLAND - NIGHT (PRESENT)",
      "characters": [],
      "action_text": "-- PATIENCE sits up INTO FRAME with a SCREAM. She thrashes in the shallows of the marsh, gasping for air, disoriented... reborn. There's no sign of the cats. PATIENCE crawls onto shore amidst the reeds, slightly clumsy at first, almost like a newborn kitten. Her ragged, wet clothes cling to her body. TIGHT on her terrified expression. She has no idea what she's doing here -- or who, or what she is. She opens her mouth to speak -- all that comes out is a strangled CAT CRY. She works her jaw, but",
      "dialogue_count": 0,
      "word_count": 478
    },
    {
      "scene_number": 41,
      "slugline": "EXT. SUBURBAN NEIGHBORHOOD - NIGHT",
      "characters": [],
      "action_text": "MIDNIGHT leaps to the top of a FENCE, staring down at Patience -- \"come on.\" Patience hesitates, then crouches and SPRINGS UP (with more than human ability), lands triumphantly on the fence -- then teeters and TUMBLES to the other side. MIDNIGHT looks disappointed. Patience jumps up again quickly, as if pretending this never happened, this time managing to hold her balance. MIDNIGHT gives her a look and leads onward. At first she's like a tightrope walker, careful of falling, but her steps becom",
      "dialogue_count": 0,
      "word_count": 108
    },
    {
      "scene_number": 42,
      "slugline": "EXT. PUBLIC GARDEN/ZOO - NIGHT",
      "characters": [],
      "action_text": "A tall wrought-iron FENCE surrounds greenery and distant cages in an urban area. A SIGN: \"ARBORETUM - ZOO.\" MIDNIGHT squeezes through a gap between the uprights. PATIENCE hesitates -- this is too narrow for a normal human. MIDNIGHT waits impatiently on the other side, tail twitching. PATIENCE makes a dubious SOUND, but manages to slip a foot -- then a leg -- into the opening, twisting and contorting. Amazingly, she's succeeding, her torso ripples and contracts as she insinuates herself between t",
      "dialogue_count": 0,
      "word_count": 233
    },
    {
      "scene_number": 43,
      "slugline": "INT. EDNA'S HOME - BEDROOM - MORNING",
      "characters": [
        "EDNA"
      ],
      "action_text": "EDNA POWERS sleeps in bed. MIDNIGHT climbs atop her, starts kneading. She makes a NOISE, rolls over, opens her eyes. EDNA Midnight?   What are you doing here? She squints, sees morning light through a window.    She climbs out of bed in her nightdress.",
      "dialogue_count": 1,
      "word_count": 43
    },
    {
      "scene_number": 44,
      "slugline": "EXT. EDNA'S HOME - DAY",
      "characters": [
        "NEIGHBOR",
        "EDNA"
      ],
      "action_text": "EDNA emerges in a bathrobe, crossing her overgrown lawn, MIDNIGHT bounding ahead of her. A Martha Stewarty NEIGHBOR, weeding an immaculate garden, throws Edna a sour look. NEIGHBOR Edna, your cats have been using my garden as a litter box again. EDNA (gravely) You can't change their nature. The neighbor scowls and returns to her weeding. As EDNA bends down for her newspaper, she hears a MEOW and sees -- -- Midnight licking a HAND, which protrudes from under a bush. Edna GASPS, moves closer, crou",
      "dialogue_count": 4,
      "word_count": 155
    },
    {
      "scene_number": 45,
      "slugline": "INT. EDNA'S HOME - LIVING ROOM - DAY",
      "characters": [
        "EDNA",
        "PATIENCE"
      ],
      "action_text": "PATIENCE is wrapped in a BLANKET, sitting on the couch, MIDNIGHT nuzzling her, as EDNA brings her a cup of TEA.      Edna picks up a CLIPBOARD from a coffee table. EDNA Your name is Patience Price, you live on South 87th. (beat) You love chocolate -- you're afraid of heights? Any of this ring a bell? Patience nods slowly, puts her face in her hands. PATIENCE I... it's coming back to me. But last night... it's just... it's like a dream. EDNA (chiding) You said in your application that you don't d",
      "dialogue_count": 8,
      "word_count": 301
    },
    {
      "scene_number": 46,
      "slugline": "INT. EDNA'S HOME - OFFICE - DAY",
      "characters": [
        "PUPILS."
      ],
      "action_text": "EDNA moves purposefully to a FILE CABINET in this cluttered, book-lined room and opens a drawer. She thumbs past many years' worth of scholarly research, finally pulling a thick, dog-eared MANILA FILE from near the back. She moves to her desk, slips on reading glasses and opens the folder -- ANGLE ON FILE -- an old, thick type-written SCHOLARLY PAPER entitled \"MYTHS OF FELIGYNY, by E. POWERS Ph.D.\" She puts this aside, revealing a WOODCUT of an AFRICAN Catwoman in leopard skin, surrounded by cat",
      "dialogue_count": 1,
      "word_count": 119
    },
    {
      "scene_number": 47,
      "slugline": "INT. PATIENCE'S APARTMENT - BATHROOM - DAY",
      "characters": [],
      "action_text": "PATIENCE stares at her dirty face in the MIRROR, still reeling from the events of the previous night. (CONTINUED) 35. CONTINUED: Behind her, THE BATHTUB RUNS, almost filled. She moves to the edge of the tub, starting to undo her ragged clothes, stares down at -- THE RIPPLING WATER.     She blinks, her expression far away -- FLASHBACK - INT. PATIENCE'S HEAD A vertiginous PLUNGE from the bridge toward DARK WATER --",
      "dialogue_count": 0,
      "word_count": 71
    },
    {
      "scene_number": 48,
      "slugline": "INT. PATIENCE'S APARTMENT - BATHROOM - DAY (PRESENT)",
      "characters": [],
      "action_text": "PATIENCE starts, shaking off this momentary vision. She dips a finger in the water, jerks back -- much as a cat might. She shakes drops off her hand, repelled by the water.",
      "dialogue_count": 0,
      "word_count": 32
    },
    {
      "scene_number": 49,
      "slugline": "INT. PATIENCE'S APARTMENT - DAY",
      "characters": [
        "PATIENCE",
        "BEEP."
      ],
      "action_text": "There's KNOCKING at the door. The PHONE IS RINGING, a MACHINE picks up. We hear RUNNING WATER from beyond the closed bathroom door. PATIENCE (V.O.) This is Patience, you can leave a message if you want... BEEP.",
      "dialogue_count": 2,
      "word_count": 37
    },
    {
      "scene_number": 50,
      "slugline": "INT. PATIENCE'S APARTMENT - BATHROOM - DAY",
      "characters": [
        "EDNA"
      ],
      "action_text": "PATIENCE turns off the TAPS, in the quiet she hears EDNA'S VOICE on her answering machine. EDNA (V.O.) It's Edna Powers -- the most extraordinary thing, I -- I think I know what's happened to you -- PATIENCE has risen with a shiver, hurries back into the main room, pulling her blouse closed.",
      "dialogue_count": 1,
      "word_count": 53
    },
    {
      "scene_number": 51,
      "slugline": "INT. PATIENCE'S APARTMENT - DAY",
      "characters": [
        "EDNA",
        "PATIENCE",
        "LONE"
      ],
      "action_text": "PATIENCE moves for the PHONE, but FREEZES at the sight of -- (CONTINUED) 36. CONTINUED: -- THE DOORKNOB RATTLING, someone trying to get in. EDNA (V.O.) -- be careful, Patience, I'm afraid you may be in danger... MIDNIGHT lets out a menacing GROWL. THE KNOB TURNS, the door swings open -- a MAN starts to enter -- CLANG!   PATIENCE whacks him over the head with a FRYING PAN. THE MAN is knocked hard into the door and slumps to the ground, stunned... it's TOM LONE. PATIENCE recognizes him with horror",
      "dialogue_count": 22,
      "word_count": 470
    },
    {
      "scene_number": 52,
      "slugline": "INT. PATIENCE'S BUILDING - HALLWAY - DAY",
      "characters": [
        "PATIENCE",
        "LONE"
      ],
      "action_text": "PATIENCE flings open the door, calls after Lone: PATIENCE I want you... He turns, startled. Patience has a sultry, come-hither look in her eye, her VOICE has a lower, sexier tone. LONE Excuse me? She shudders. The sexy expression turns to one of shock and anxiety -- what has she done? Then, vamping: PATIENCE I want you, um, to forgive me.   For hitting you like that. LONE No need -- woman living alone, you can't take any chances. (CONTINUED) 39. CONTINUED: PATIENCE nods unsurely, starts to retre",
      "dialogue_count": 5,
      "word_count": 108
    },
    {
      "scene_number": 53,
      "slugline": "INT. COFFEE SHOP - DAY",
      "characters": [
        "PATIENCE",
        "LONE"
      ],
      "action_text": "LONE and PATIENCE move from a COUNTER with COFFEE CUPS in hand. Patience has cleaned up, dressed a little sexier than usual -- she looks good. PATIENCE So, did you always want to be a policeman? (beat, rolling her eyes) God, listen to me, Conversation 101. LONE (a laugh) Hey, we gotta start somewhere. Actually, when I was a kid, I wanted to be a rock star. They take seats at a small table. LONE I was kind of a delinquent back then, got into some trouble. There was a cop who helped me out. Made a",
      "dialogue_count": 22,
      "word_count": 384
    },
    {
      "scene_number": 54,
      "slugline": "EXT. AVENAL FACTORY - DAY",
      "characters": [],
      "action_text": "LAUREL'S SMILING FACE on a BILLBOARD. It's only there for a moment, quickly plastered over with -- A NEW BILLBOARD featuring DRINA'S FACE. We're outside a dramatic, gated industrial COMPLEX, TRUCKS with the AVENAL LOGO, a sprawling CHEMICAL FACTORY at the center.",
      "dialogue_count": 0,
      "word_count": 42
    },
    {
      "scene_number": 55,
      "slugline": "INT. AVENAL FACTORY - GEORGES' OFFICE - DAY",
      "characters": [
        "GEORGES",
        "ANGEL",
        "NEVSKI",
        "MEDICAL PHOTOS.",
        "WESLEY",
        "LAUREL"
      ],
      "action_text": "HUGE VATS, DUCTS, PIPES, etc., it's a busy, VERY NOISY environment. CAMERA FINDS GEORGES' OFFICE, large windows overlooking the factory floor. INSIDE, behind the thick windows, it's SILENT.       This is a hard, masculine space, all steel and wood. GEORGES stands by a table, WESLEY and ANGEL at his side; IVAN NEVSKI, 50s, a smoldering Russian scientist, is showing them -- MEDICAL PHOTOS of people's faces, the eyes covered with black BARS -- the skin is BLOTCHED, lumpy, something very wrong. (CON",
      "dialogue_count": 18,
      "word_count": 446
    },
    {
      "scene_number": 56,
      "slugline": "EXT. URBAN PARK - DAY",
      "characters": [
        "LAUREL",
        "PROCESS SERVER"
      ],
      "action_text": "A HOMELESS CAMP -- tents, boxes, etc. -- nearby. BAG LADIES stand in a line near MAKE-UP STOOLS, AVENAL GIRLS are busy painting their faces, doing their best. LAUREL (O.S.) ...or maybe it's the other way around... FIND LAUREL AVENAL at a TABLE with a BANNER: \"AVENAL CARES.\" VIDEO CAMERAS are trained on her as she signs POSTERS, PERFUME BOXES, etc. while talking into a MIC. LAUREL The point is, everyone deserves to look in the mirror and feel good about themselves. Be we rich or poor, we all must",
      "dialogue_count": 10,
      "word_count": 280
    },
    {
      "scene_number": 57,
      "slugline": "INT. PATIENCE'S APARTMENT - NIGHT",
      "characters": [],
      "action_text": "PATIENCE'S SLEEPING FACE.     She stirs, stretches. WIDER, she's lying on top of a BOOKCASE in a twisted, awkward position. MIDNIGHT jumps up and brushes against her. CLOSE ON PATIENCE'S EYES -- they FLY OPEN, GOLD-FLECKED and (for a moment) ELLIPTICAL. PATIENCE -- now pure CATWOMAN -- springs down gracefully and scans the dark apartment. She stretches her limbs languorously, licks her lips. She flexes her fingers, watching appreciatively as her CLAWS EMERGE. She reaches out and SPEARS LONE'S CA",
      "dialogue_count": 0,
      "word_count": 278
    },
    {
      "scene_number": 58,
      "slugline": "EXT. SHOPPING DISTRICT - NIGHT",
      "characters": [
        "MULTIPLE ALARMS RING."
      ],
      "action_text": "MULTIPLE ALARMS RING. QUICK CUTS of STOREFRONTS, WINDOWS SMASHED -- the SHOE STORE, the LINGERIE STORE, the WESTERN WEAR SHOP, the TRENDY BOUTIQUE. The MANNEQUIN that had displayed the Gaultier knock-off is now NAKED. CUT TO:",
      "dialogue_count": 1,
      "word_count": 36
    },
    {
      "scene_number": 59,
      "slugline": "EXT. TRENDY CLUB - NIGHT",
      "characters": [
        "CATWOMAN"
      ],
      "action_text": "THRONGS out front behind the velvet ropes. All eyes turn toward an approaching FIGURE whom we don't see at first... LOW ANGLE -- a sleek pair of black patent leather BOOTS appears. A purring rendition of a familiar children's tune: CATWOMAN And the cat came back, the very next day... MOVE UP SLOWLY to reveal the rest of the ensemble -- long legs in BLACK TIGHTS, the short SKIRT and bodice TOP of the dress. A WHIP is wrapped around her waist, the tip dangles almost like a tail. Her stride is conf",
      "dialogue_count": 4,
      "word_count": 223
    },
    {
      "scene_number": 60,
      "slugline": "INT. TRENDY CLUB - NIGHT",
      "characters": [
        "CATWOMAN",
        "SANDY",
        "BARTENDER",
        "BOUNCER",
        "STOPS."
      ],
      "action_text": "Dramatic DECOR, throbbing MUSIC, DANCING TRENDIES. CATWOMAN moves confidently through the club. PATRONS can't help but stare, getting out of her path as she crosses the room. RANDY and SANDY, the rude couple, are bellied up to the bar. CATWOMAN slithers between them, almost unnoticed at first. RANDY starts as something FLICKS against his back -- CATWOMAN holds the end of her WHIP/TAIL, smacking it lightly against his rear end. He looks up at her. CATWOMAN Buy me a drink. SANDY stares daggers at",
      "dialogue_count": 10,
      "word_count": 489
    },
    {
      "scene_number": 61,
      "slugline": "EXT. TRENDY CLUB - NIGHT",
      "characters": [
        "CATWOMAN"
      ],
      "action_text": "CATWOMAN hurls open the front doors, kicks aside the velvet rope. She addresses the impatient CROWD: CATWOMAN C'mon in, wanna-bes! Free drinks! THE CROWD stampedes the door. Catwoman struts away down the sidewalk, recoiling the whip around her waist. A couple of CLUB GOONS make it past the throng. CATWOMAN, moving onto a highway OVERPASS, notes she's being pursued. She puts a hand on the railing, and casually VAULTS OVER -- THE GOONS rush to the side, look out to see --",
      "dialogue_count": 1,
      "word_count": 82
    },
    {
      "scene_number": 62,
      "slugline": "EXT. HIGHWAY - NIGHT",
      "characters": [],
      "action_text": "CATWOMAN strutting confidently down the narrow GUARDRAIL between the two directions of SPEEDING TRAFFIC. (CONTINUED) 50. CONTINUED: She could be out for an evening stroll, ignoring the SCREECHING BRAKES, HORNS, and STARTLED DRIVERS. She gives them a wave without bothering to look over her shoulder.",
      "dialogue_count": 0,
      "word_count": 45
    },
    {
      "scene_number": 63,
      "slugline": "EXT. TENEMENT ROOFTOP - NIGHT",
      "characters": [],
      "action_text": "A CHICKEN-WIRE DOOR explodes open and a FLOCK OF PIGEONS ROCKETS OUT of a COOP AT CAMERA. CATWOMAN emerges in a CLOUD OF FEATHERS, brushing a few stray ones off her outfit, with a cat-that-ate-the-canary smile. She cocks her head, listening in different directions for a new source of amusement -- snippets of VOICES, MUSIC, PLUMBING SFX, passing VEHICLES... it's like tuning a radio. Then she picks up a distant TINKLE of breaking GLASS --",
      "dialogue_count": 0,
      "word_count": 75
    },
    {
      "scene_number": 64,
      "slugline": "INT. JEWELRY STORE - NIGHT",
      "characters": [
        "BAG.",
        "CATWOMAN"
      ],
      "action_text": "Dimly lit, an older, discount place. THIEF #1 methodically breaks DISPLAY CASES with a wrapped hammer, snatches up the contents -- necklaces, rings, etc. -- stuffing them into a BAG. As he moves, a SHADOWY FIGURE -- CATWOMAN -- moves with him, looking over his shoulder, close enough to touch but unseen. Each time he turns his head, she has just slinked out of his view -- her timing is impeccable. THIEF #2, with a SHOTGUN, stands guard over a blindfolded, bound-and-gagged NIGHT WATCHMAN. CATWOMAN",
      "dialogue_count": 4,
      "word_count": 425
    },
    {
      "scene_number": 65,
      "slugline": "EXT. JEWELRY STORE ALLEY - NIGHT",
      "characters": [
        "LONE",
        "CATWOMAN"
      ],
      "action_text": "CATWOMAN bounds out the exit, leaps atop BOXES, onto a window A/C UNIT, which totters with her weight, just as -- (CONTINUED) 52. CONTINUED: AN UNMARKED SEDAN screeches to a halt, and TOM LONE leaps out, GUN ready. He trains it on CATWOMAN -- LONE Freeze! CATWOMAN freezes. She blinks down at LONE, he's got a clean shot at her. She cocks her head, licks her lips. CATWOMAN You are cute. LONE blinks at this uncommon response to a pointed weapon, continues to play it by the book. LONE I'm a police o",
      "dialogue_count": 6,
      "word_count": 164
    },
    {
      "scene_number": 66,
      "slugline": "EXT. ROOFTOPS/CITY STREETS - NIGHT",
      "characters": [],
      "action_text": "CATWOMAN, silhouetted against the sky, is having a great time, leaping from building to building, scrambling across rooftops. POLICE SIRENS recede in the distance. DISSOLVE TO:",
      "dialogue_count": 0,
      "word_count": 26
    },
    {
      "scene_number": 67,
      "slugline": "EXT. ZOO - DAWN",
      "characters": [],
      "action_text": "THE SUN is rising. PAN OVER a couple of GLITTERING JEWELS in the dirt. FIND CATWOMAN in the GOLDEN MORNING LIGHT, curled against what looks like a TIGER-SKIN PILLOW. She stirs and groans in her sleep, like someone waking with a hangover. (CONTINUED) 53. CONTINUED: She blinks and frowns at the SUNLIGHT. Where am I? She sits up and realizes -- she was sleeping against the belly of the BENGAL TIGER, lying on his side in his sunken ENCLOSURE. CATWOMAN SHRIEKS and leaps to her feet, terrified, yanks",
      "dialogue_count": 0,
      "word_count": 182
    },
    {
      "scene_number": 68,
      "slugline": "INT. EDNA'S HOME - KITCHEN - DAY",
      "characters": [
        "PATIENCE",
        "EDNA"
      ],
      "action_text": "A KITTEN pounces on a CAT TOY. PATIENCE -- but this time, it was like the tiger wanted to kill me... MOVE TO FIND PATIENCE, seated at Edna's kitchen table, finishing her tale. She's in tight-fitting jeans, RIPPED along the sides, a cut-off top revealing her midriff. Safety pins hold the outfit together, but it looks good on her. EDNA is pulling out teacups, a TEAKETTLE on the burner. EDNA You were afraid -- you became its prey.   The tiger shredded your clothes? PATIENCE No, I did that myself. I",
      "dialogue_count": 13,
      "word_count": 282
    },
    {
      "scene_number": 69,
      "slugline": "INT. EDNA'S HOME - OFFICE - DAY",
      "characters": [
        "EDNA",
        "PATIENCE"
      ],
      "action_text": "PAN OVER PRINT-OUTS, PAPERS, open BOOKS. A HIEROGLYPHIC of a figure half-feline, half-female in a heavy TOME. (CONTINUED) 55. CONTINUED: EDNA The cult of catwomen dates back to Ancient Egypt, where felines were first domesticated. A SMALL CAT suddenly LEAPS INTO FRAME, staring UP AT CAMERA. EDNA, in her reading glasses, and PATIENCE are seated before the research material spread on her desk, cups of tea before them. Edna patiently removes the CAT. EDNA Excuse me, Cicero. ON PAPERS -- a DRAWING o",
      "dialogue_count": 9,
      "word_count": 319
    },
    {
      "scene_number": 70,
      "slugline": "INT. EDNA'S HOME - LIVING ROOM - DAY",
      "characters": [
        "PATIENCE",
        "EDNA"
      ],
      "action_text": "PATIENCE paces, EDNA looks on sympathetically. PATIENCE She's like some demon, possessing me in the night, but -- but I can keep it under control during the day -- EDNA Well, cats do sleep most of the day -- PATIENCE When she takes over -- it's like, she just does whatever she feels like, she doesn't care what people think -- EDNA Is that so bad? PATIENCE You don't understand -- I'm afraid she's going to hurt someone -- or get me killed. Again. PATIENCE is near tears.     EDNA puts her arms arou",
      "dialogue_count": 12,
      "word_count": 239
    },
    {
      "scene_number": 71,
      "slugline": "EXT. JEWELRY STORE - DAY",
      "characters": [],
      "action_text": "POLICE TAPE across the entrance to the storefront. PATIENCE approaches warily, looking around to make sure no one's watching, nervous as hell. She sees an elderly JEWELER and a UNIFORM COP through the window. Patience withdraws a PAPER BAG from under her coat. She drops this beyond the police tape, KNOCKS on the door and RUNS. THE JEWELER comes out, looks down on the ground. He picks up the bag -- and sees the word \"SORRY!\" written on the paper. Opening the bag, he finds -- THE DIAMONDS AND JEWE",
      "dialogue_count": 0,
      "word_count": 94
    },
    {
      "scene_number": 72,
      "slugline": "EXT. PATIENCE'S BUILDING - ALLEY - DAY",
      "characters": [
        "LONE",
        "PATIENCE"
      ],
      "action_text": "PATIENCE comes out of a back door of her building with a GARBAGE BAG, still looking around nervously, moving toward the dumpster in the alley. She tosses in the bag -- ANGLE IN DUMPSTER, the BAG spills open to reveal pieces of the CATWOMAN OUTFIT. PATIENCE moves back for the door -- LONE (O.S.) We've got to stop meeting like this. She spins to see TOM LONE approaching from his sedan, parked in a LOT off the alley. PATIENCE is wary of him now, but he seems casual, smiling. She glances at the dump",
      "dialogue_count": 7,
      "word_count": 180
    },
    {
      "scene_number": 73,
      "slugline": "INT. PATIENCE'S APARTMENT - DAY",
      "characters": [
        "PATIENCE",
        "CLOSES THE BLINDS."
      ],
      "action_text": "PATIENCE dances with MIDNIGHT, overcome with joy. She holds the cat at arm's length, sings a TUNE of her own making: (CONTINUED) 59. CONTINUED: PATIENCE Tom Lone, Tom Lone, I called him on the phone -- now I won't be alone -- THE CAT isn't enjoying this, squeals and squirms free. Patience's smile fades a tick. PATIENCE It was Catwoman who made the call.    What's he ever gonna see in me? MIDNIGHT has turned his butt to her, tail TWITCHING angrily. PATIENCE glances OUT THE WINDOW to glimpse -- LO",
      "dialogue_count": 3,
      "word_count": 102
    },
    {
      "scene_number": 74,
      "slugline": "INT. AVENAL HQ - SHOWROOM - DAY",
      "characters": [
        "SALLY",
        "PATIENCE"
      ],
      "action_text": "THE DOOR OPENS and PATIENCE enters. She keeps her head down, not wanting to be noticed. SALLY spots her, follows her through the showroom toward the elevators. SALLY Patience, what are you doing here? PATIENCE Just came by to clean out my desk. SALLY (studying her) Hm.   Did you dye -- PATIENCE (alarmed) What? SALLY -- your hair.    You look different somehow.    Cooler. Patience shakes her head, uneasy. SALLY Are you going to the funeral? (peering at her) I know, tinted contacts. (CONTINUED) 60",
      "dialogue_count": 10,
      "word_count": 154
    },
    {
      "scene_number": 75,
      "slugline": "INT. AVENAL HQ - ACCOUNTING BULLPEN - DAY",
      "characters": [
        "BERGER",
        "PATIENCE",
        "COMPUTER VOICE"
      ],
      "action_text": "A GARFIELD TOY lands atop XEROXED CARTOONS and personal PAPERS in a CARDBOARD BOX. PATIENCE is cleaning out her cubicle in the office. Noticing a flashing LIGHT on her phone, she hits a MESSAGE BUTTON and picks up the receiver. BERGER (V.O.) (filter) Patience, it's Dave... She winces at this voice from the grave, casts a sad glance toward his empty office. BERGER (V.O.) I called the CEO about your YP-3 numbers -- Avenal went ballistic. I'll have to redo the spreadsheets, you must've screwed up s",
      "dialogue_count": 6,
      "word_count": 249
    },
    {
      "scene_number": 76,
      "slugline": "INT. PATIENCE'S APARTMENT - EVENING",
      "characters": [
        "PATIENCE"
      ],
      "action_text": "PATIENCE is sitting up in bed, reading a BIOCHEMISTRY TEXT, PRINT-OUTS and RESEARCH MATERIAL around her.   She YAWNS, squirms -- something is coming over her. Her eyes pop open. PATIENCE No.   Oh no, not again. SPASMS wrack her body, her back arches, she keeps fighting it, clenching her fists, struggling for control. ON HER HANDS, her own CLAWS are drawing BLOOD from her palms. 62.",
      "dialogue_count": 1,
      "word_count": 65
    },
    {
      "scene_number": 77,
      "slugline": "EXT. PATIENCE'S BUILDING - ALLEY - NIGHT",
      "characters": [
        "CATWOMAN"
      ],
      "action_text": "A GLOVED HAND grips the edge of the DUMPSTER -- then CATWOMAN vaults over the side, lands on her haunches, ready to rumble. Her outfit has a banana peel stuck to it. She wrinkles her nose, plucks this off, CLUCKING her tongue. She turns to MIDNIGHT, prowling nearby. CATWOMAN That girl has got to go. She glances up toward Lone's WINDOW -- lets out a sexy GROWL -- and SPRINGS UP the fire escape.",
      "dialogue_count": 1,
      "word_count": 74
    },
    {
      "scene_number": 78,
      "slugline": "INT. LONE'S APARTMENT - NIGHT",
      "characters": [
        "CATWOMAN",
        "MOVE IN ON CATWOMAN'S FACE."
      ],
      "action_text": "CATWOMAN SCRATCHES at the window... the place is DARK, no response. She PUNCHES out a pane of glass and slithers in. CATWOMAN Boy, you don't know what you're missing... She moves through the dimly lit, Spartan environment, able to see easily in the dark. She runs a CLAW over the strings of a GUITAR, finds a discarded button-down SHIRT, slips it on. She narrows her eyes when she finds a FRAMED PHOTO -- CLOSE -- TOM LONE with his arm around a pretty GIRL.    Letting out a GROWL, CATWOMAN slashes o",
      "dialogue_count": 3,
      "word_count": 142
    },
    {
      "scene_number": 79,
      "slugline": "INT. CATWOMAN'S HEAD (MEMORY MONTAGE)",
      "characters": [
        "EDNA",
        "PATIENCE",
        "BERGER",
        "GEORGES"
      ],
      "action_text": "Impressionistic POV FLASHBACKS, V.O.s overlapping, echoing, repeating... all snippets of previously heard dialogue. POV -- GEORGES AVENAL, chewing Patience out in the ELEVATOR. (CONTINUED) 63. CONTINUED: EDNA (V.O.) Most catwomen were murder victims... PATIENCE (V.O.) I was murdered? POV -- the MERCEDES COMING AT CAMERA. This time we follow through on the moment of IMPACT -- CAMERA FLIES THROUGH THE AIR, HITTING the ground hard. PATIENCE (V.O.) Why would anybody kill me? BERGER (V.O.) ... YP-3..",
      "dialogue_count": 7,
      "word_count": 146
    },
    {
      "scene_number": 80,
      "slugline": "INT. LONE'S APARTMENT - NIGHT",
      "characters": [],
      "action_text": "SMASH!   CATWOMAN throws the COLOGNE BOTTLE against the wall. CUT TO:",
      "dialogue_count": 0,
      "word_count": 11
    },
    {
      "scene_number": 81,
      "slugline": "EXT. AVENAL MANSION - NIGHT",
      "characters": [
        "PANE OF GLASS."
      ],
      "action_text": "A sprawling MANSION,    dark for the night, an \"A\" in iron scroll-work over the    gate. FIND a SECURITY CAMERA, trained on the area in front    of a ten-foot WALL. MIDNIGHT suddenly leaps onto the wall,    blocking and batting at the CAMERA LENS. WIDER, CATWOMAN, now out of the camera's view, LEAPS up the side of the wall and lands on all fours atop it. (CONTINUED) 64. CONTINUED: AT THE SIDE OF THE MANSION -- CATWOMAN scrambles up a trellis toward a second-story window. She leaps to the ledge,",
      "dialogue_count": 1,
      "word_count": 106
    },
    {
      "scene_number": 82,
      "slugline": "INT. AVENAL MANSION - HALLWAY - NIGHT",
      "characters": [
        "ON CATWOMAN'S HANDS"
      ],
      "action_text": "The CIRCLE OF GLASS pops out and lands on soft CARPET. CATWOMAN reaches her arm in, unlatches the window, and swings inside into the darkness. CATWOMAN moves stealthily, crouching, senses alert. HER POV - CATVISION The dark hallway GLOWS.   An amplified NOISE from a distance... SNORING. ON CATWOMAN'S HANDS Her NAILS emerge from her gloved fingertips, ready to rumble. CATWOMAN rounds a corner toward a large formal staircase that wraps around a huge chandelier. She nears a door which is slightly a",
      "dialogue_count": 1,
      "word_count": 89
    },
    {
      "scene_number": 83,
      "slugline": "INT. AVENAL MANSION - BEDROOM - NIGHT",
      "characters": [],
      "action_text": "HER POV -- CATVISION, nearing a huge, curtained CANOPY BED. CATWOMAN slashes the curtain aside, to reveal -- TIPPY THE LAP DOG, curled up in the center of the otherwise unoccupied bed, SNORING away. The dog awakens, raises its head, and starts BARKING FURIOUSLY. CATWOMAN hisses at the creature.   It cringes and shivers, seeking cover beneath a pillow.",
      "dialogue_count": 0,
      "word_count": 58
    },
    {
      "scene_number": 84,
      "slugline": "INT. AVENAL MANSION - HALLWAY & FOYER - NIGHT",
      "characters": [
        "LAUREL",
        "CATWOMAN"
      ],
      "action_text": "As CATWOMAN comes out of the bedroom, a FIGURE emerges from the darkness swinging a GOLF CLUB -- WHAM! (CONTINUED) 65. CONTINUED: She's struck hard in the back and the head -- she topples forward, ROLLS DOWN THE STAIRS. She hits a LANDING, curled up, dazed, clutching her skull. LIGHTS COME ON -- LAUREL looks down at her from the top of the stairs, wearing silk pajamas, golf club in hand. She descends cautiously, club raised. LAUREL tentatively pokes at the prone, black-clad Catwoman with her foo",
      "dialogue_count": 32,
      "word_count": 802
    },
    {
      "scene_number": 85,
      "slugline": "INT. AVENAL FACTORY - GEORGES' OFFICE - NIGHT",
      "characters": [
        "ANNOUNCER",
        "DRINA",
        "GEORGES"
      ],
      "action_text": "MOOD MUSIC plays, GEORGES is    on the sofa, in a silk robe, beside DRINA. Drinks are on     hand, Georges is attempting to neck with her. She pays him     no mind, a remote in hand, rewinding a VIDEO that plays    on a plasma SCREEN. (CONTINUED) 69. CONTINUED: ON TV, IMAGES OF DRINA dissolve into each other quickly -- she DANCES IN A BALL-GOWN, CHAIRS a CORPORATE BOARD MEETING, finally pulls into the winners' circle in a FORMULA RACE CAR, pulls off her helmet and shakes her hair out. ANNOUNCER",
      "dialogue_count": 3,
      "word_count": 130
    },
    {
      "scene_number": 86,
      "slugline": "INT. AVENAL FACTORY - NIGHT",
      "characters": [
        "CONVEYOR BELTS."
      ],
      "action_text": "A small crew of NIGHT WORKERS wearing JUMPERS and PAPER MASKS tend the elaborate industrial MACHINERY, it's DEAFENING here. SWIRLING GOO the color of HUMAN SKIN PUMPS through PLASTIC PIPES into a huge SEALED VAT. RAINBOWS of NAIL POLISHES squirt out of NOZZLES into BOTTLES. LIPSTICK STICKS screw down into their TUBES and are CAPPED on CONVEYOR BELTS. OVERHEAD, amidst DUCTING and PIPES, CATWOMAN is on the move. HER CLAWS rake across a row of RUBBER TUBES, which spray multi-colored FLUIDS. HER GLO",
      "dialogue_count": 1,
      "word_count": 247
    },
    {
      "scene_number": 87,
      "slugline": "INT. AVENAL FACTORY - GEORGES' OFFICE - NIGHT",
      "characters": [
        "GEORGES"
      ],
      "action_text": "THE CHAOS in the factory is clearly visible through the window, but GEORGES can't hear a thing -- he and DRINA are groping each other on the couch now. A nearby INTERCOM is BUZZING, Georges finally pushes a talk button, angry. GEORGES This had better be import -- oh my God. He's now looking out the window at the CHAOS below.",
      "dialogue_count": 1,
      "word_count": 61
    },
    {
      "scene_number": 88,
      "slugline": "INT. AVENAL FACTORY - NIGHT",
      "characters": [
        "GEORGES",
        "CATWOMAN",
        "GUARD",
        "DRINA",
        "BITTEN GUARD"
      ],
      "action_text": "The MACHINERY is off now, but the place is a wreck, CLOUDS of STEAM and POWDER, RIVERS of NAIL POLISH on the floor, etc. A handful of panicking WORKERS struggle to shut down a large DISTILLATION VAT, which RUMBLES ominously. SECURITY GUARDS are pouring in, one speaks rapidly into a WALKIE-TALKIE, looking upwards as he climbs stairs to a network of catwalks overlooking the factory. WALKIE-TALKIE Better stay in your office, sir, keep the door sealed. The saboteurs may still be on the premises. GEO",
      "dialogue_count": 11,
      "word_count": 575
    },
    {
      "scene_number": 89,
      "slugline": "INT. AVENAL FACTORY - DUCT - NIGHT",
      "characters": [],
      "action_text": "CATWOMAN rockets downwards, BULLETS PERFORATE the DUCT WORK just behind her.",
      "dialogue_count": 0,
      "word_count": 11
    },
    {
      "scene_number": 90,
      "slugline": "INT. AVENAL FACTORY - NIGHT",
      "characters": [],
      "action_text": "THE VAT EXPLODES UPWARD like a VOLCANO, DRENCHING ANGEL and the GUARDS with FLESH-COLORED FOUNDATION.",
      "dialogue_count": 0,
      "word_count": 15
    },
    {
      "scene_number": 91,
      "slugline": "INT. AVENAL FACTORY - BASEMENT - NIGHT",
      "characters": [
        "HUNDREDS OF GLEAMING EYES."
      ],
      "action_text": "DARKNESS, A GRILL EXPLODES from the ceiling with CATWOMAN'S IMPACT, she topples through and lands on a TABLE of GLASSWARE, which UPENDS, we hear GLASS SHATTER. CATWOMAN is instantly on all fours on the ground, breathing hard. She moves through the dark room, becoming aware of -- HUNDREDS OF GLEAMING EYES. CATWOMAN flips on a WALL-SWITCH -- -- revealing GLASS-WALLED CAGES containing SQUEAKING BLACK RATS. CATWOMAN instinctively HISSES and SWIPES A CLAW in their direction -- they shrink back from t",
      "dialogue_count": 1,
      "word_count": 131
    },
    {
      "scene_number": 92,
      "slugline": "EXT. VICTORIAN DUPLEX - NIGHT",
      "characters": [],
      "action_text": "Neatly kept, colorful architecture. CATWOMAN moves down sloping eaves and swings into a turret window.",
      "dialogue_count": 0,
      "word_count": 15
    },
    {
      "scene_number": 93,
      "slugline": "INT. NEVSKI'S APARTMENT - NIGHT",
      "characters": [
        "CATWOMAN",
        "LANDLADY"
      ],
      "action_text": "CATWOMAN moves stealthily inside the dimly lit place. It's upscale, expensively furnished. She scans the room, sees -- (CONTINUED) 74. CONTINUED: NEVSKI, his back turned, apparently dozing in a desk chair. CATWOMAN spins him in his chair to confront him -- CATWOMAN Ivan Nevski -- His head tilts back -- she's face-to-face with a CORPSE, he's been shot a couple of times in the chest. He's bluish, eyes glazed -- very dead. CATWOMAN (annoyed) You're no help. She SNIFFS the air, turns toward -- -- a",
      "dialogue_count": 4,
      "word_count": 225
    },
    {
      "scene_number": 94,
      "slugline": "INT. ARMS CACHE - DAY",
      "characters": [
        "XAVIER"
      ],
      "action_text": "Lush vegetation and tropical sunlight through walls of netting in this immense camouflage tent. (CONTINUED) 75. CONTINUED: CAMERA MOVES PAST racks of AIR-TO-AIR MISSILES, RPGs, a JET FIGHTER and a large military CARGO CHOPPER. XAVIER BARTOK, a well-dressed, heavyset man with a CIGAR in his mouth, accompanied by a couple of BODYGUARDS, is showing off a crate of AUTOMATIC WEAPONS to a couple of REBELS in combat fatigues. They speak in rapid SPANISH, examining the guns, sighting them, etc. XAVIER e",
      "dialogue_count": 1,
      "word_count": 103
    },
    {
      "scene_number": 95,
      "slugline": "INT. AVENAL FACTORY - DAY",
      "characters": [
        "WESLEY",
        "XAVIER"
      ],
      "action_text": "WESLEY is on his cell phone on the main FACTORY FLOOR. The place is a WRECK, as WORKERS clean up the mess Catwoman made. WESLEY (V.O.) (on phone) This is supply. There's been a slight complication, my employer wishes to move up the exchange -- tomorrow night. XAVIER (snorts) Impossible -- there are issues of transport, available funds -- WESLEY We're willing to adjust the price. But if you can't pick up the goods tomorrow, we'll have to take our business elsewhere. XAVIER This isn't your first '",
      "dialogue_count": 4,
      "word_count": 94
    },
    {
      "scene_number": 96,
      "slugline": "EXT. LOADING DOCK - DAY",
      "characters": [
        "WESLEY"
      ],
      "action_text": "A FREIGHT ELEVATOR rises to reveal MANY CANISTERS of YP-3. (CONTINUED) 76. CONTINUED: WESLEY waves to ANGEL at the controls of a FORKLIFT -- Angel still has dried flecks of MAKE-UP on his skin. He pulls forward, ready to load the YP-3 into a waiting TRUCK. WESLEY (V.O.) (on phone) It'll be eliminated, like the others.   We just don't want to take any chances. CUT TO:",
      "dialogue_count": 1,
      "word_count": 66
    },
    {
      "scene_number": 97,
      "slugline": "INT. PATIENCE'S APARTMENT - DAY",
      "characters": [
        "NEWSCASTER",
        "SANDY",
        "LONE",
        "PATIENCE"
      ],
      "action_text": "ON TV, AN ARTIST'S RENDITION of CATWOMAN, made to look far more menacing and mean. NEWSCASTER (V.O.) Catwoman has struck again -- FOOTAGE of a sheet-covered CORPSE being wheeled out of Nevski's duplex. A BANNER: \"CRIME BREAK,\" a LOCAL NEWS LOGO. NEWSCASTER (V.O.) This costumed criminal has now added murder to her resume of mischief and mayhem... REVERSE ANGLE -- PATIENCE, sprawled on the couch in baggy sweat-clothes, reacts to this with a stunned expression. ON TV, \"NEWS VIDEO\" of SANDY from the",
      "dialogue_count": 19,
      "word_count": 448
    },
    {
      "scene_number": 98,
      "slugline": "INT. SUSHI BAR - DAY",
      "characters": [
        "LONE",
        "PATIENCE"
      ],
      "action_text": "A WAITER comes through a BEADED CURTAIN, passing LONE and PATIENCE seated nearby, drinks before them. The curtain RATTLES after him, distracting PATIENCE. LONE So what've you been up to lately? PATIENCE Me? Oh. Not much. You know, sitting around my apartment, watching television. As she speaks, she involuntarily BATS like a kitten at the swinging CURTAIN. (CONTINUED) 79. CONTINUED: LONE Really? PATIENCE Is that so hard to believe?     What about you? LONE Catwoman. Patience starts, folds her han",
      "dialogue_count": 24,
      "word_count": 396
    },
    {
      "scene_number": 99,
      "slugline": "EXT. RIVERSIDE AREA - DAY",
      "characters": [
        "LONE",
        "PATIENCE"
      ],
      "action_text": "LONE and PATIENCE walk close together, near the water. LONE Gonna have to get back to the station, I'm working nights. PATIENCE Catwoman again? LONE Afraid so. But I have a feeling she'll be in custody within the week. PATIENCE (alarmed) Why do you say that? LONE Individuals who feel compelled to act out through an animal alter-ego -- bats, birds, bugs, there have been a number of cases in other cities -- they catch themselves. Take too many risks, think they can play with the cops. See, they li",
      "dialogue_count": 10,
      "word_count": 275
    },
    {
      "scene_number": 100,
      "slugline": "INT. EDNA'S HOME - LIVING ROOM - DUSK",
      "characters": [
        "PATIENCE",
        "EDNA"
      ],
      "action_text": "PATIENCE is breathing hard, blinking rapidly, as she paces Edna's floor. Edna follows nervously, trying to calm her. PATIENCE It's happening, it's happening again. It's not even dark yet -- you said she could only come out at night! EDNA I didn't say that! Patience, you made these rules up yourself -- a cat is a cat 24 hours a day, they just go hunting at night -- PATIENCE And she's after Georges Avenal -- if she finds him, she's going to kill him, I know it -- EDNA Stop talking about her like s",
      "dialogue_count": 7,
      "word_count": 148
    }
  ]
}