{
  "slug": "channel-zero-101-you-have-to-go-inside-2016",
  "title": "channel zero 101 you have to go inside",
  "genre": "drama",
  "format": "series",
  "scenes_count": 5,
  "characters_count": 0,
  "characters": [],
  "total_words": 10524,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. MARLA’S KITCHEN - DAY  Marla and Mike, back at home. Finishing lunch. Marla glances at him, fighting curiosity. MARLA You planning on doing anything today? Or just working from here? MIKE (getting up, glancing at his watch) I was gonna head over to the sheriff’s and see about something. MARLA “Something.” MIKE You said you don’t want to know. But Mike has glanced up - and he stops. He’s looking at the window behind Marla, which looks out into the back yard. MARLA What? MIKE There’s a guy in the woods. (as she turns to look) Hang on, don’t turn around. (then, unnerved) He’s looking at us. MARLA Can you see what he looks like? We still don’t see what Mike is seeing. MIKE No... he’s got a red sweater on. I think this same guy was at the cemetery just now. MARLA I’m gonna look. Marla turns to look and now we see HER POV: A FIGURE IN A RED- BROWN SWEATER lurking in the shadowed trees - turns and disappears into the forest as soon as Marla looks at him. MARLA (CONT’D) There he goes. (then, shrugging) People walk through the woods.  15.",
      "characters": [],
      "action_text": "MIKE He was stopped. MARLA I never saw any guy at the church. MIKE Anything like that ever happen before? Somebody looking at you? MARLA No. Mike, relax. MIKE Come with me to the sheriff’s. Marla gives him a look. MARLA Are you kidding?? Go. You’re aggravating me. (then) Jesus. People walk in the woods. Mike shrugs reluctantly. Mike hesitates, but finally leaves. Marla waits til she hears his car. Then she goes back to the window and looks at the woods uneasily. FADE TO...  EXT. A STREET IN TOWN - DAY  A street in IRON HILL. Quiet and idyllic, yet modern. PAN OVER to a small RED-BRICK BUILDING shaded by oaks:   THE SHERIFF’S STATION . Tiny. Looks more like a post office. REVEAL - That was Mike’s POV. Mike walks toward the station.  INT. SHERIFF’S STATION - FRONT DESK - DAY  Mike approaches Deputy   AMY WELCH   (~33). She’s on the phone, taking a report. She’s the only person visible. AMY WELCH Lemme guess, they didn’t take anything... Susan’ll take your statement, ok Mr. Crumm? (puts phone down, yells) SUSAN!? Line one... the only one that’s blinking. (to Mike;   who are you? ) Yeah? MIKE My name’s Mike Painter. I, um-  16. AMY WELCH Oh - hey! Mike Painter. MIKE That’s right- AMY WELCH I know all about you. My mom saw you on Dr. Phil and got all excited. Amy Welch. MIKE Amy Welch. I remember your mom. AMY WELCH None of her other students ever got on TV. Hey, want some pastries? She points to a paper box of pastries. MIKE All yours. AMY WELCH I can’t eat gluten. So... what are you doing   here ? Mike hesitates, not wanting to answer - when... MAN’S VOICE (O.S.) Holyyy shit.  Sheriff   GARY YOUNG   (40, African-American)   is walking up. A former football star past his glory. Friendly, relaxed. GARY I’ve seen him on TV, too. (looks at Mike a beat) Mikey Painter. You here to report a crime? MIKE Ah, no. Actually I have a request. For you, I think. GARY Why don’t we go in my office?  INT. SHERIFF’S OFFICE - DAY  A cluttered, almost cozy office. Family photos. Sports tro",
      "dialogue_count": 0,
      "word_count": 927
    },
    {
      "scene_number": 2,
      "slugline": "EXT. THE YOUNGS’ HOUSE - BACK YARD DECK - NIGHT  ... Mike sitting awkwardly at the “dinner party.” SIX PEOPLE outside under a FULL MOON, drinking beers and eating tri-tip. In addition to Gary, there’s Amy Welch, the deputy. The youngest here. Curious, loves stories. And...  JOE CUSTER   (40)   - Big, drunk. Former class clown. Likes Amy.  TIM HAZEL (late 40s)   - Quiet, mild-mannered. Also likes Amy. And notably,   JESSICA (40) , Gary’s wife. Pretty. Jessica has a warm, open-hearted vibe. She is intrigued by Mike’s presence. Watching him. He glances at her curiously, too. GARY Coach Founder never liked me. JESSICA He never liked anybody.   The man was a grouch, he was a grumpy, grouchy type of person- JOE CUSTER You know, I think he was the first teacher to swear in front of me. MIKE (doing an impression) “Custer, you’re pissin me off.” JOE CUSTER Mike, you missed your calling. AMY WELCH I always felt bad for the guy. TIM HAZEL How so? AMY WELCH Well he’d had to quit by the time I was there. MIKE He quit?   Why? GARY That’s right, you were gone by then. JOE CUSTER (savoring this) Founder was having an affair.  20.",
      "characters": [],
      "action_text": "MIKE What, really? JESSICA With Mr. Timmons. MIKE  What?  TIM HAZEL They live in Florida together now. Good for them, I think- MIKE Wait like- Mr. Timmons-   Grizzly  Timmons was having a secret affair with Coach Frowner!? JOE CUSTER Worth coming back just for that, right? MIKE I mean- Jesus.   Wow. AMY WELCH Well I think it’s a happily ever after. TIM HAZEL It is.  DANE YOUNG (9)   comes outside and nudges Gary’s arm... DANE Dad, Katie’s been watching TV forever. I wanna watch   Labyrinth . GARY Life is tough, bud. JESSICA Dane, tell your sister it’s time for bed. And you too. Dane makes an expression of outrage, then trudges inside. GARY My nine-year-old’s obsessed with David Bowie.   That’s strange, right? MIKE (amused) I wouldn’t worry about it.  21. JESSICA Thank you, Mike.   We   were strange. Remember we had our own language? AMY WELCH You made up a language? MIKE We were like seven. JESSICA We had an imaginary kingdom, and I was Queen and you were King. AMY WELCH My friends never did fun stuff like that, they were all on their gameboys. JESSICA God you ARE young. MIKE And Eddie wanted to be King, but I always made him be the Jester. JESSICA (to Amy) I grew up right down the road from him and his brother. When we got older Mike had a little crush on me. GARY Should I be worried? AMY WELCH Mike, you have a kid, right? MIKE I have a beautiful six year old named Grace who’s already learning how to use sarcasm. JESSICA A six year old teenager. That’s fun. MIKE (getting up) Always. Where’s the bathroom?  INT. THE YOUNGS’ HOUSE - UPSTAIRS BATHROOM - NIGHT  Mike SPLASHES WATER on his face. Looks in the mirror. He’s exhausted. A little drunk. Ready to leave.  22. UPSTAIRS HALLWAY - NIGHT  As Mike passes a bedroom doorway - QUIET LITTLE GIRL (O.S.) Mike? Mike stops. Steps back. A LITTLE GIRL watches him from the bedroom... and Mike does a double take when he sees the same Little Girl he met in his mom’s yard. This is   KATIE YOUNG (6).   Jessica’s daughter. Mike kneel",
      "dialogue_count": 0,
      "word_count": 2414
    },
    {
      "scene_number": 3,
      "slugline": "INT. MARLA’S BEDROOM - SAME TIME  Marla sits in the darkness of her bedroom, awake. Listening. She can hear every word Mike is saying downstairs. MIKE (O.S.) I can’t hold this door closed any longer. I have to go inside. Marla’s expression is complicated, haunted... as if she very much doesn’t want him to open that door. FADE TO...  EXT. MARLA’S HOUSE - YARD - MORNING  Sunrise. CLOSE ON MIKE’S FACE as he startles awake... Because Marla is SHAKING HIM. Mike stands in the yard, feet filthy.   He sleepwalked again . Marla’s staring at him, worried. Not knowing what to say. Seeing he’s awake, she just goes in the house without a word. Mike’s closer to the woods than he was last time... as if going further each time he sleepwalks. Again he looks above the trees - in   exactly   the direction he was going - to see: That   MOUNTAINTOP   in the distance. The   ROCKY OUTCROPPING   at its peak...   What’s it mean to him?  INT. THE YOUNGS’ HOUSE - KITCHEN - DAY  Jessica,   slightly   hungover, walking into the kitchen. Gary’s already up making eggs for Dane, who’s gaming on his phone. JESSICA I see my boys are up early. GARY I rise with the sun, baby. JESSICA S-U-N or S-O-N? GARY Whichever’s first. JESSICA Dane, go wake up your sister. Dane rolls his eyes and dutifully heads upstairs. JESSICA (CONT’D) Did you call the sink guy yet?  32.",
      "characters": [],
      "action_text": "GARY Of course I did. JESSICA Really? If you’re just saying that, hold off. I think I can fix it with- DANE (O.S.) (from upstairs)  MOM?  INT. KATIE’S BEDROOM - DAY  Jessica enters Katie’s room... to find Dane alone. Puzzled. DANE She’s not in the bathroom either. Jessica looks into the hall, calls - JESSICA KATIE? As Jessica calls for her daughter, PUSH IN on Katie’s pillow. Off the white pillow... MATCH CUT TO:  INT. RABBIT’S FOOT DINER - DAY  HOT SAUCE SPATTERING LIKE BLOOD ON SCRAMBLED EGG WHITES... as Mike douses his breakfast. He’s sitting at the counter at the Rabbit’s Foot, Iron Hill’s diner. Locals sit in the booths.  DAPHNE BONNER (late 40s) , matter-of-fact and bossy, brings him a coffee refill. She is also TEXTING distractedly. DAPHNE BONNER How’s those eggs, Mikey? My girls just got em fresh from the farm. (calling) Tess! Willa! Two WAITRESSES tending the booths look over.   TESS (19)   is fresh-faced, curious.   WILLA (27) , is dark-eyed, sexy/surly. DAPHNE BONNER (CONT’D) This is Mike Painter. I used to babysit him. Tess waves. Willa gives a grudging nod. Some locals look over at Mike. Daphne glances at her phone. REVEAL - she’s texting someone called “S”: “ He’s really back. He’s here now.”  Then the DOOR CHIMES JANGLE VIOLENTLY and she looks up as -  Jessica strides in . Messy, agitated. Drawing attention.  33. DAPHNE BONNER (CONT’D) Grits or hash browns, hon? But Jessica’s heading right for Mike. JESSICA Mike, can I talk to you? Mike, surprised, gets up with everyone in the diner watching...  INT. JESSICA’S BEAT-UP SUV (MOVING) - DAY  Mike rides shotgun as Jessica drives through town. She’s driving a bit recklessly. Anxious. Her mind on Katie - JESSICA She wanders off. But in the store. Not like this. Why would she get out of bed in the middle of the night? MIKE I’ve seen kids do stranger things. But CLOSE ON MIKE and he’s tense too, freaked by Katie going missing. Jessica pulls up at a red. Thoughts spiralling. JESSICA I mean, there’s no reason to",
      "dialogue_count": 0,
      "word_count": 1902
    },
    {
      "scene_number": 4,
      "slugline": "EXT. CHRISTMAS TREE FARM - DAY  ... where Mike walks uneasily with Tim Hazel sticking close to him. We can hear distant shouts of “ Katie ” from the others. Hazel keeps giving Mike curious glances. But Mike is looking off through the Christmas trees.   HIS POV : Amy Welch (half hidden by trees) talking to someone intently on a cell phone... and glancing over at   him . TIM HAZEL So that show... was last night the first time she saw it?  MIKE’S POV:   Amy ends her call, glancing back to Mike - alarmed. Then she hurries away...   Where’s she going?  MIKE I think so. TIM HAZEL What channel was it on? MIKE (looking at him now) Why? Hazel gestures dismissively:   Just wondering.  TIM HAZEL Weird they’d just air it again. (off Mike’s tense silence) Seems like everybody who saw it that summer was 12, 11, younger... I was too old. I missed it. Something about Hazel’s chatter is a little   too   casual. Mike has a rising sense of paranoia.   HIS POV:   He sees Amy reappear. With Jessica. Walking toward him purposefully. Something’s up. TIM HAZEL (CONT’D) (more insistent) What channel was it on? Mike looks at him, alarmed by his intensity. But now Amy and Jessica are striding up. Jessica motions Amy to stay back. Jessica approaches Mike, agitated. JESSICA I need to talk to you.  PRIVATE SPACE IN THE TREES  Mike and Jessica step away, a little distance off. Whatever she heard from Amy, it’s changed the way she looks at Mike.  40.",
      "characters": [],
      "action_text": "JESSICA Anything you’re not telling me? MIKE What do you mean? JESSICA Marla told us she heard you come in at 3 am.   Five hours   after you left our house. MIKE I walked around. JESSICA What aren’t you telling me? MIKE I’m trying to help here - JESSICA  Mike . I’m   scared   for my daughter. Just like you would be. I’m asking you, parent to parent: Is there anything you’re not telling me? Mike hesitates.   Knows   better than to say it. But he can’t lie to her in the face of that emotional appeal. MIKE ...This is gonna sound insane. JESSICA Jesus Christ - say it. MIKE The show...   It may have something to do with this. JESSICA (confused at first; then)  Candle Cove?  MIKE (insistent) That’s why I got so rattled last night - it was   connected to what happened in ‘88, too. The only time anybody   ever   saw that show was during the murders. And now Katie sees it... She’s staring at him. He sounds absolutely crazy.  41. JESSICA Where   did   you go last night after you left? (off his frustration) Mike, did you do something? MIKE I’m trying to help you find her. (admitting - ) I never told her we used to play here. This is where it took some of the kids in ‘88 - JESSICA  What?  MIKE It’s not just a TV show, Jess. Please listen, I’m not crazy- JESSICA You’re not crazy? MIKE I   know   it sounds- JESSICA I know about Stovington. MIKE (stops, at a loss; then -) I’m not crazy. I had a- JESSICA  You were released from a psych ward three days ago.  Mike looks suddenly exhausted. Doesn’t deny it. JESSICA (CONT’D) You must’ve come straight here from the hospital! MIKE (quiet) I went home the first night.   My wife let me come by to get some clothes. JESSICA It doesn’t matter! MIKE I had a nervous breakdown -  42. JESSICA What I heard was ‘psychotic episode.’   Psychotic . What does that mean, Mike? You’re a doctor. On Mike, losing the fight. Exhaustion in his eyes -  JARRING SILENT FLASH TO... Mike dull-eyed - SLEEPWALKING - in his Westchester home. Shirtless, HOLDING A KNIF",
      "dialogue_count": 0,
      "word_count": 4184
    },
    {
      "scene_number": 5,
      "slugline": "INT. KATIE’S BEDROOM - NIGHT  Back in Iron Hill, Katie sleeps in her bed... peaceful and safe. Miraculously Katie came out of her ordeal unharmed. Then... her eyes open. As if she heard something. She lifts her head, listening. Until finally... Katie smiles. Showing the cute gap in her teeth. And gets out of bed...  INT. GARY & JESSICA’S BEDROOM - NIGHT  Jessica sleeps in bed with Gary. Arms around him, clinging to each other in sleep after a long, frightening day. Then...  RAGGED SCREAMING   comes from down the hall.   They jolt awake - JESSICA That’s Dane! - and as they fly out of bed and rush to their children ...  EXT. MIKE’S WESTCHESTER STREET - NIGHT  Night has fallen in Westchester. Full dark now. Only the streetlights illuminate the peaceful neighborhood. Mike’s Lexus is still parked out of the way...  INT. MIKE’S LEXUS (PARKED) - NIGHT  Mike sleeps in the driver’s seat, huddled up a little bit, looking vulnerable. He is dreaming. TWITCHING slightly. His head twitches as if he’s trying to get away from something - HIS PHONE VIBRATES. He wakes, disoriented. Gropes for it. MIKE Hello?  INTERCUT WITH: INT. HOSPITAL - NIGHT  A distraught Jessica stands outside an OPERATING ROOM. In the b.g., Marla waits, worried. Both of them badly shaken. JESSICA (holding back panic) Dane’s in surgery, Mike, he - they’re trying to save him, they- She   stabbed   him, Mike. In his sleep- Mike struggles to understand - MIKE Who did, who stabbed-  57.",
      "characters": [],
      "action_text": "JESSICA She had a   hook ! Katie, she had a- she gave him wounds like- Where the fuck did she get a hook?? MARLA   -   puts a hand to her mouth. Sickened. MIKE - goes pale. Even more horrified. Thinking - MIKE Where is she? JESSICA She’s- she’s at the station. But- Something’s wrong with her. She won’t talk. She’s like a zombie... (then, quiet) You said... it can make people do things, right? Mike closes his eyes. This question hits him like a punch. JESSICA (CONT’D) Mike. It didn’t stop... Will you come back? On Marla, hearing this - her expression hard to read... as A SURGEON steps out of the operating room in the b.g., looks at Jessica. She makes one final plea - JESSICA (CONT’D) (desperate, pressing) Please - if you’re connected to it... Help us... (off the Surgeon’s impatience) Please, Mike. She hangs up and turns to the Surgeon...  WE STAY WITH MIKE   - In his car, stunned and haunted. Mike stares out into the darkness... HIS POV - The DARK TREES by the road... PUSH IN SLOWLY ON THE DARKLY RUSTLING LEAVES...  FADE/MATCH TRANSITION TO... SOFT LEAVES UNDER A KID’S SNEAKERS  Almost night. The SHAKY, TERRIFIED BREATHING of the kid whose sneakers we’re looking at is the only sound. We are -  EXT. THE “CROW’S NEST” - DUSK   * FLASHBACK TO 1988 *  In the darkness among the towering boulders. Only a few shafts of fading light creeping in. Now SLOWLY PULL UP TO REVEAL the terrified kid...  58. MIKE, age 12.   We have just plunged into a violent and vivid memory, something intensely traumatic, with no bearings...  He’s hiding. Eyes wide with adrenaline, leaves in his hair, beads of sweat on his forehead.   What’s going on? What is he hiding from??  Now Mike hears FOOTSTEPS. Slow, quiet FOOTSTEPS approaching across the leaves. Coming around the boulder... toward him. Mike becomes very still. Holds his breath. A focused intensity coming over him as the FOOTSTEPS draw closer... And now we see that Mike’s clutching something: A   HOOK . A long, curved, steel hook... a pirat",
      "dialogue_count": 0,
      "word_count": 1097
    }
  ]
}