{
  "slug": "chef-2015",
  "title": "chef",
  "genre": "drama",
  "format": "film",
  "scenes_count": 7,
  "characters_count": 0,
  "characters": [],
  "total_words": 15381,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. MC MANSION - BRENTWOOD - DAY Carl’s seasoned Mercedes pulls up to a fat house. He hustles to the door that opens before he arrives. PERCY comes out. He’s nine. Just in this brief glimpse we see a NANNY, a GARDENER, a HOUSEKEEPER and a HANDYMAN. PERCY Hi dad. CARL How’s mom? PERCY Good. INT. CARL’S CAR - DAY He drives aggressively. CARL School? PERCY Good. CARL Good? PERCY Fine. CARL Is it good or fine? PERCY What’s the difference? CARL I don’t know. PERCY You getting reviewed today? CARL Yes. PERCY Mom said you might be weird.  3.",
      "characters": [],
      "action_text": "CARL I’m not weird. I don’t care what they write. As long as I like what I cook. PERCY That’s what she said you’d say. CARL Listen. I haven’t been married to your mom for five years. She doesn’t know me any more. PERCY I thought you said you were still friends and always will be. CARL We are. But that doesn’t mean we know each other. PERCY She’s usually pretty spot on about you. CARL Really? You know what she thinks I should do? Open a food truck. PERCY I like food trucks. CARL So do I. Who doesn’t like food trucks? That doesn’t mean I should drive one around like a Fisher Price figure. PERCY What’s that? CARL The toy. You had them. The little wooden guys. Like Weebles. PERCY What’s a Weeble? CARL You never had Weebles? PERCY I never had any of the stuff you’re talking about.  4. CARL Like a Minecraft guy. PERCY There are no vehicles in Minecraft. CARL Here we are. EXT. FARMERS MARKET - SANTA MONICA - DAY Carl and Percy weave through the aisles of the Farmers Market. Carl paws at the produce. He talks to a VENDOR. CARL So basically all you carry now is kale. Is that what you’re telling me? VENDOR Everyone wants kale. PERCY (interrupts) Can I get kettle corn? CARL It’s not even eleven. PERCY So? CARL I’m here for work. You want a piece of fruit? Let’s get you a piece of fruit. PERCY I don’t want fruit. CARL You said you wanted me to help you lose weight. Listen... (stops) I’m not putting any pressure on you. It’s something that I’ve struggled with and my parents struggled with and I think it’s really great that you’re listening to your body at your age.  5.  (MORE) But remember. It’s up to you. I’m not putting any pressure on you. SMASH TO: EXT. FARMERS MARKET - MOMENTS LATER Percy and Carl are pounding fistfuls of steaming kettle corn. CARL ... and I have no idea which reviewer they’re sending. Most of them like me but there are some that have it in for me because I got featured in the other magazine. PERCY They’re haters. CARL Exactly. We didn’t have that word when",
      "dialogue_count": 0,
      "word_count": 2296
    },
    {
      "scene_number": 2,
      "slugline": "INT. MC MANSION - BRENTWOOD - DAY Carl walks past an endless parade of domestic employees. A handyman is painting. A cleaning lady is cleaning. A cook is cooking. Percy leads him to an office in the back where a gardener gardens and a CAR WASHER washes the car. Carl’s beautiful Cuban ex-wife, INEZ, sits wearing a bluetooth headset. She smiles and holds up a finger as she trills on in Spanish. INEZ (into phone/Spanish) It’s being delivered in the morning. It may even get there tonight... (then to Carl) Hi, Papi. (then into phone/Spanish) Yes. It will all be there. I have to go. Bye. The headset comes off. INEZ (CONT’D) Are you okay? CARL About what? The review? What the hell does it mean anyway? I cooked what they wanted me to cook. And I got three stars. I mean, three stars is good. I don’t know why he was saying all that negative-- INEZ Are you happy there? CARL Sure. I mean, we’re packed every night. I get to cook whatever I want. I mean usually... He pays me well. INEZ Since when does that matter? CARL Since you keep a staff of fifty people to keep the compound up to snuff. INEZ Don’t start.  18.",
      "characters": [],
      "action_text": "CARL You have literally fifty people working here. Percy’s nine. Does he really need a nanny? INEZ You want to talk about it? Let’s talk about it. CARL Just to be clear, you believe a nanny is a lifetime position. Even when you don’t have kids anymore. INEZ This isn’t why I invited you in. CARL He’s in school all day. What does she even do here? (then) Hi Guadalupe. INEZ Could we not talk about this now? I just wanted to make sure you’re okay. CARL Thank you. I am. Nice moment. Then. CARL (CONT’D) You need money? INEZ I’m good. PERCY We’re going to be late. SMASH TO: INT. MOVIE THEATER - DAY Carl and Percy sit side by side eating popcorn and watching a loud action movie. Abrupt CUT TO:  19.",
      "dialogue_count": 0,
      "word_count": 344
    },
    {
      "scene_number": 3,
      "slugline": "EXT. SANTA MONICA PIER - DAY Carl and Percy sit side by on a racing rollercoaster. Abrupt CUT TO: EXT. MC MANSION - BRENTWOOD - NIGHT Carl pulls away leaving Percy in front of his house waving. PERCY Bye, dad. INT. KITCHEN - GAULOISES - NIGHT Tight, impressionistic SHOTS of Carl preparing a dish. He is alone and experimenting. Each ingredient, and cooking surface, and knife stroke and gas flame fills the SCREEN unexpectedly, each gesture   imbued with a wisp of life. Cooking is a transcendent dance for Carl, and time bends as he enters the flow. A dish emerges as if sculpted with time and temperature. And many other beautiful creations now surround him. Martin enters. It is clear that it is now... INT. KITCHEN - GAULOISES - MORNING MARTIN You been here all night? CARL I need a new menu. MARTIN You got to get some sleep, dude. Fuck Twitter. CARL What do you mean fuck Twitter? MARTIN I mean fuck em. Who even reads that shit anyway. CARL I’m not on Twitter. I don’t know what you’re talking about. MARTIN Nothing. It’s just some bullshit.  20.",
      "characters": [],
      "action_text": "CARL Taste this. Carl feeds him a spoon like a baby. MARTIN Woooo hoo! You gotta serve that shit tonight. CARL I’m going to make it the special. Tony walks in, arriving at work. TONY You were cooking all night, you sick fuck? MARTIN Taste this shit. Martin feeds Tony like a baby. TONY Fuck, that’s good. CARL Tonight’s special. TONY Yo, fuck Twitter. CARL Again with the Twitter. Show me this Twitter thing. TONY You’re not on Twitter? CARL No. TONY Are you getting too much pussy? Is that the problem? CARL What’s Twitter got to do with pussy? TONY Have you ever heard the term social networking?  21. CARL Yes. TONY That’s what it means. CARL It means pussy? MARTIN Yeah. TONY Or ticket sales, or getting people to show up to see a band. Anything that requires a data base. CARL And you’re saying pussy requires a data base. MARTIN Uh... Yeah. TONY Not for “The Most Promising Chef” of Food and Wine magazine. CARL So show me your Twitter. What’s it say that’s so bad? MARTIN (covering) Nothing, Jefe. I want to hear your new menu. CARL I’m thinking we switch things up more. Why limit ourselves to the French classics? Let’s bring in other flavor profiles. TONY But it’s a French restaurant. CARL Riva has us cooking the same exact menu for the last five years. TONY It’s a good menu.  22. CARL I know. I came up with it five years ago. We have to switch it up. TONY We do switch it up. Every few months. CARL Please. We swap out one dish for a dish we already served. I feel like a robot. TONY You should check with Riva first. CARL You’re my sous chef. Don’t worry about Riva. Worry about me. TONY I worry about you all the time. That’s why I’m telling you. CARL Thank you for your concern. Now. Here’s tonight’s menu and how I want it prepared... INT. CARL’S APARTMENT - VENICE - DAY Carl and Percy stare at a TV and eat hero sandwiches from Bay City Deli. CARL How does Twitter work? PERCY It’s cool. CARL That’s how it works? It’s cool? PERCY You tweet on it. CARL Is it like texting? PERCY ",
      "dialogue_count": 0,
      "word_count": 3968
    },
    {
      "scene_number": 4,
      "slugline": "INT. KITCHEN - GAULOISES - NIGHT - LATER Molly is on the house phone. The kitchen is slammed. Martin sweats at the grill. Dishes stack at the washing station. Tony struggles in his new role as Chef de Cuisine. Riva storms in, totally flustered... RIVA Table eleven is still waiting for apps! Molly, I need you to help expedite! MOLLY I’ll be right there. I got a res cancelling. (into phone) We’re in deep weeds, Carl, I can’t talk. CARL (o.c.) What did we serve? MOLLY The same shit. He refused dessert. CARL (o.c.) Keep him there. MOLLY What!?! CARL I said keep him there! CAMERA SLAMS into Molly’s face as she realizes... She looks through the porthole to the front of house. The front door flies open. Carl charges in like a Brahma bull. SLAM into Carl as he looks around. Then he sees Ramsey Michel preoccupied with postprandular texting. Riva sees and gets in Carl’s face to intercept the confrontation. Afro- Cuban percussion swells the SCORE as blood rises. RIVA (hushed intimidation) Back of the house! Work your way through the stacked tickets and we’ll talk reinstatement. On my terms.  44.",
      "characters": [],
      "action_text": "CARL Fuck you. Carl pushes past him and calls to Ramsey Michel’s table. The restaurant falls silent. Ramsey looks up as we PUSH IN to his bemused expression. CARL (CONT’D) (holds up phone) No heart!?! Is that what you tasted? RAMSEY MICHEL I wrote the truth. CARL You wouldn’t know good food if your face was smashed into it! Cell phone cameras start popping up like prairie dogs. RAMSEY MICHEL At first I was surprised that you didn’t show. Then it made sense. You’ve got nothing left to say. CARL Nothing to say? How’s this, asshole? You’re a self-satisfied judgemental--- HATER! You make nothing. You live to tear others down who are trying. Ramsey calmly rises, leaves a generous tip and evenly and quietly offers to Carl... RAMSEY MICHEL (measured) I was talking about your cooking. You have nothing left to say with your cooking. (then quietly) And if you were “trying” we wouldn’t even be having this conversation. CARL You’re a fucking asshole! You know that? Go ahead! Walk out! You pompous fuck! Go!  45. Ramsey walks out, unfazed. Carl is left alone in a forest of staring video phones and flashing cameras. Martin, Molly, Tony, and Riva all watch as Carl is frozen with numb fog. CUT TO: Tight on a laptop screen featuring a TMZ.com article. It is a video clip of Carl’s outburst in Gauloises the night before with the headline “HOLLYWOOD CHEF GOES POSTAL ON FOOD CRITIC.” Reveal we are in... INT. CARL’S APARTMENT - VENICE - DAY Carl is on the phone with Inez’s publicist JEN, who we CROSS CUT with in her... INT. PUBLICISTS OFFICE - LOS ANGELES - DAY - CONTINUOUS Jen is dressed very smart behind her desk in a sandblasted brick loft space. JEN I don’t think you understand how this works. This is exactly the type of thing that website lives for. CARL But you’re a publicist. Don’t you have relationships with these people. I mean, isn’t that what you are hired to do? JEN I do have relationships, but it’s out there. Even if I could persuade one site to pull down one clip there are a",
      "dialogue_count": 0,
      "word_count": 3881
    },
    {
      "scene_number": 5,
      "slugline": "INT. MARVIN’S YARDS - MIAMI - DAY Carl enters and speaks to a RECEPTIONIST who sits before a bustling bullpen of cubicles. CARL I’m here to see Marvin. My name is Carl Casper. RECEPTIONIST The chef? He’s expecting you. INT. MARVIN’S OFFICE - MIAMI - DAY MARVIN sits in a large office adorned with photos of construction and development projects and sports memorabilia. A golden shovel hangs on the wall. Carl walks in with reticence. Marvin bear hugs him. MARVIN Chef Casper! CARL Marv. How are you? MARVIN Better than you. You’re a big hit on YouTube. CARL They say it’s blowing over. MARVIN Really? I thought that shit lived forever online. Remember Star Wars kid? He had to leave his school. CARL That’s what they’re telling me. MARVIN Inez says you want to lease a lunch truck, sell food at my construction sites. CARL That’s what she said? MARVIN No?  67.",
      "characters": [],
      "action_text": "CARL Not that I don’t appreciate the offer... MARVIN I get it. It’s beneath you. CARL It’s not that. MARVIN What is it then? You know what one of my trucks pulls down? CARL I got no idea. MARVIN Take a guess... Three large. A week. CARL That’s great. MARVIN And most of that goes to the operator. CARL No. I think that’s great. It’s just... Maybe this wasn’t a good idea. He starts to leave. MARVIN Hang on, Carl. Stop. Inez said you hit rock bottom. CARL She said that? MARVIN It takes a man to admit it. I mean, I was never there myself, but I can see how it could happen. CARL Look. I fucked up. Okay. I’m all over the internet. I’m out of money. I got no job prospects. I’m old. But I’m not at rock bottom.  68. MARVIN Aside from being strung out or in a fucking wheelchair, how many rungs do you think you have left. CARL And I’m divorced. MARVIN Which I still can’t wrap my head around for the life of me. CARL I mean, she’s the best. MARVIN The best... CARL But when something is over... MARVIN In my case, yes. Not with you two. CARL How’s that? MARVIN With us I thought it was love, but I think we were just really good together sexually. CARL Well... MARVIN It’s gotta be weird for you on some level to know that we both slept with the same woman. CARL I’m okay with it, actually. Maybe because I slept with her after you two were done. MARVIN MMmmmm. Not so much. CARL You slept with her when we were married? MARVIN No, no. God no.  69. CARL You had me for a minute. MARVIN I slept with her after you two split. CARL What? MARVIN Once. I didn’t even finish. We stopped. It was a bad Idea. The point is you were the one for her. I can see it clear as day. If you two don’t, then whatever. And about the truck, you can have it. CARL I can? MARVIN I know you didn’t want to sell lunch to my guys. You want a shee shee gourmet thing. Fine. Lease to buy. I’ll give you a good deal and you don’t have to pay me until you’re in the black. CARL Thank you. MARVIN Don’t thank me yet. The only truc",
      "dialogue_count": 0,
      "word_count": 1423
    },
    {
      "scene_number": 6,
      "slugline": "EXT. FOOD MARKET - LITTLE HAVANA - DAY Carl and Percy select meats and produce. CARL See this? You know what this is? PERCY Bananas? CARL Platanos. Here, smell. Different, right? This one is a maduro. We don’t want that kind. We want green. Like this. All green. For frying... Then the baked goods... CARL (CONT’D) I’m going to bake these myself when I have time. I need this bread for Cubanos and this bread for Medianoches. INT. FOOD TRUCK - MARVIN’S YARD - DAY Cuban music plays as Carl and Martin work side by side assembling the sandwiches. Martin pulls the roast pork out of the oven. Percy watches, perched on the counter. PERCY We could’ve just bought that at the store. They sold it there. MARTIN (what?) Are you sure this is your kid, Jefe. CARL That’s slow roasted in Martin’s special mojo. MARTIN With casava. Here, smell. CARL He don’t want to learn about casava. PERCY I do!  76.",
      "characters": [],
      "action_text": "CUTS OF them cooking like a four handed machine. Tight shots of the culinary ballet. The food comes alive to the music. MARTIN Is the placha hot? PERCY Me? MARTIN Yeah, you. PERCY Do I touch it? MARTIN What the hell do you think? PERCY No. MARTIN Right, no. PERCY Then..? CARL Flick water on it. It sizzles. CARL (CONT’D) It’s ready. Watch. Brush the butter on like this. Press it down. See? When the cheese looks like that and the bread gets that gold edge it’s done. A line cook is like a robot. You gotta do it exactly like I show you. Every time. He whacks it into three bites. CARL (CONT’D) Taste. All three eat. MARTIN Woooo Hoooo! I am home! CARL Good?  77. PERCY Delicious. CARL Okay. Then we’re open. PERCY Open? They throw open the awning and call out to the workers sipping the beer they got for helping with the stove. It is now... EXT. MARVIN’S YARDS - MIAMI - DUSK - CONTINUOUS CARL Cubanos are ready. CUTS OF the assembly line chugging along. Percy sweats it out as he works the plancha. The workers call out in enthusiasm. They approve of the meal. MARTIN We need a better sound system. I know a guy out here. CARL My cards are maxed out and we aren’t charging for food yet. MARTIN But you look happy as hell. CARL So happy. The sandwiches fly out the window and the line grows. Other workers gather. No one is turned away. Carl rejects a sandwich. Into the bin. CARL (CONT’D) Bread’s overdone. PERCY So? It’s free. Martin and Carl share a dour look. Carl beckons Percy to follow him out the back of the truck. A quiet moment. CARL Is this boring to you?  78. PERCY No. I like it. CARL Well, I love it. Everything good that has come to me in my life came from this. Do you understand? PERCY Yes. CARL This is my livelihood. I met your mother because of this. You would never have been born. Do you understand? PERCY Yes. CARL God gives you many gifts. Passion. Beauty. Love. These are special things. Why not share these things with others? I mean when you can. PERCY Yes. CARL Now, s",
      "dialogue_count": 0,
      "word_count": 2343
    },
    {
      "scene_number": 7,
      "slugline": "EXT. ABBOT KINNEY - VENICE, CALIFORNIA - DAY FADE UP on SHOTS of VENICE and LA. El Jefe is parked in a lot on Abbot Kinney Boulevard. Martin works the stoves inside. Carl pulls fresh baked bread out of the oven. He then sits at a small round table with two folding chairs. Jen, the publicist, is waiting there for him overdressed for the informal setting. Carl scribbles the menu on a chalkboard. Soothing Cuban folk music quietly croons from the PA. JEN I love this. CARL (preoccupied with menu) What? JEN This whole thing. I love it. CARL The truck? JEN The truck. The music. The branding. It looks like you’re not trying. CARL We’re not trying. JEN Exactly. So, I was able to talk to some of my connections in New Media and I can secure some primo placement in the digital space. I think the time is finally ripe to bring you on as a client. CARL A client? JEN I’m confident I can make the whole viral video a non-factor. I got a firm offer from the Hell’s Kitchen people which might be worth looking at. CARL I’m not interested.  91.",
      "characters": [],
      "action_text": "JEN Neither am I. I think I can get you your own reality show on Bravo. CARL I really don’t-- JEN Or the Food Network. I get it. I have no problem trading ratings for credibility. CARL Jen. I’m not signing up for your services. JEN As a friend, can I tell you? You need someone with their finger on the pulse of the online culture. CARL I do. My nine year old son. JEN He’s a great kid-- CARL And he built me up to seven hundred thousand followers on twitter, compiled a direct marketing email list indexed by market, and has me represented in every social media community. JEN I think you’re making a huge mistake. CARL Betting on my family? I’ve done worse. Want a sandwich? JEN Do you have anything gluten free? EXT. ABBOT KINNEY - VENICE - NIGHT The Boulevard is packed. It is FIRST FRIDAYS, when the vendors and food trucks rule the night. The entire area is packed with people and closed to traffic. Percy works the griddle. Carl presses cubanos and Martin serves.  92. The truck’s music makes the whole crowd bounce, and the line stretches down the street. Inez even helps by taking orders. INEZ Two cubanos, one medianoche, three platanos. PERCY Two cubanos, one midnight, three plantains! INEZ Next. She looks down and sees it is Ramsey Michel, the critic whose review and accompanying outburst video went viral and ruined Carl’s life. INEZ (CONT’D) No food for you. RAMSEY MICHEL I’d like to speak to the chef. INEZ The hell you will. CARL (relieves her. steps down) I got this. What did you come here for? RAMSEY MICHEL To taste your food. CARL I thought I didn’t have the heart to cook. RAMSEY MICHEL I didn’t expect you to serve me. I sent someone to buy it for me. CARL And? RAMSEY MICHEL It’s amazing. But I will not write about it. CARL Can I share something with you? What happened between us, it really did a number on me.  93.  (MORE) It robbed me of my pride, my career, my dignity. Part of me died. I know people who do what you do don’t care about such things... RAMSEY MICHEL T",
      "dialogue_count": 0,
      "word_count": 1126
    }
  ]
}