{
  "slug": "chernobyl-102-please-remain-calm-2019",
  "title": "chernobyl 102 please remain calm",
  "genre": "thriller",
  "format": "series",
  "scenes_count": 3,
  "characters_count": 0,
  "characters": [],
  "total_words": 11485,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. HOSPITAL FRONT DOORS - 212   212 CONTINUOUS  A MOB of angry people are yelling and pleading with: A LINE OF MILITARY POLICE, some with guns, some holding clubs. HOSPITAL SOLDIER We are at capacity. Please disperse! LYUDMILLA is JOSTLED by the crowd. Near the front, the soldiers physically PUSH people back. There's a SURGE of movement from behind her... the soldiers PUSH back... and in the chaos, she SLIPS past them... FALLS... ...then gets up and RUNS into the hospital. The soldiers can't stop her. Too busy with the rest of the crowd. The air fills with angry shouts and screams, and then:  INT. KREMLIN - DAY 213   213  Silence. A stately corridor. Chandeliers. Floors shined to a polish. And every few feet, the Soviet flag. VALERY LEGASOV sits on a small chair against the wall near one of the flags. Hair carefully combed. His best suit. A door opens, and a woman, 40's, emerges. Pleasant. Courteous. KREMLIN AIDE Professor Legasov? LEGASOV rises (   ) Yes? KREMLIN AIDE Oh no, not yet. They're finishing up some other business. It'll be a few more minutes. Can I get you some tea? LEGASOV No, I'm fine. Thank you. She extends a document to him. KREMLIN AIDE I thought you might care to read Deputy Secretary Shcherbina's report while you wait. 8.",
      "characters": [],
      "action_text": "LEGASOV Oh. Certainly. Thank you. He takes the typewritten report, and she exits. Legasov sits back down. Scans the first page. Hmm. Flip. Second page. Scanning. Mmhmm. Flip. Third page. Scanning. Wait.  Oh my god.  He sits there, staring agape at the page. Then looks around... is anyone else here? Has anyone else seen-- ?? The aide returns. Still pleasant and calm. KREMLIN AIDE All right, Professor. They're ready. She sees the panic in his eyes. KREMLIN AIDE Is something wrong?  INT. KREMLIN HALLWAY - 214   214 MOMENTS LATER  WE LEAD: Legasov, on his face, watching as he forces himself to walk... forces himself to stay calm, the report clutched in his hand, still open to the third page.  Surely they know. They have to know...  He wipes his brow. Sweat. Mouth dry. He passes SOLDIERS who push open doors, and he enters:  INT. KREMLIN CONFERENCE ROOM - 215   215 CONTINUOUS  The inner sanctum. The center of Soviet power. A long room lined with Soviet flags. In the center of the room, a conference table. Men in their seats. Some in Soviet military uniforms. Others in   suits. And at the head of the table, MIKHAIL GORBACHEV. 9. Legasov's eyes dart nervously. Who among these men knows? Who else is frightened? Who else feels sick to their stomach? Not one of them appears concerned at all. Someone clears their throat, catching his attention. This is BORIS SHCHERBINA, 67, barrel-chested, intimidating brow. A bull of a man. And Shcherbina nods toward a seat. As in: we are all sitting. You are not. Sit. Legasov rushes himself into his chair. Trying to keep his hands from shaking.  Please. Let someone else say it. Not me. Anyone but me.  GORBACHEV Thank you all for your duty to this Commission. We'll begin with Deputy Chairman Shcherbina's briefing, and then we'll discuss next steps if necessary.  If necessary?  SHCHERBINA Thank you, General Secretary. I am pleased to report the situation in Chernobyl is stable.  What?  SHCHERBINA We're coordinating with local Party officials an",
      "dialogue_count": 0,
      "word_count": 5859
    },
    {
      "scene_number": 2,
      "slugline": "EXT. ABOVE THE PRIPYAT FOREST - 235   235 MORNING  WE MOVE SILENTLY IN THE AIR - over the pine forest. What started as a narrow band of reddish/brown trees has widened. Death is spreading.  INT. FOREST - 236   236 CONTINUOUS  A thick mist hangs over the ground. The only sound is the occasional creak of wood. The mist shifts, and now we see the forest floor. Blanketed in dead pine needles. The corpse of a deer. Now we hear: a faint   whup-whup-whup-whup  In the distance, PINE NEEDLES are blown off of dead trees... the sound grows to a DEAFENING ROAR... the wave of air and pine needles rushes closer, and: LOOK UP THROUGH THE TREES TO SEE: a squadron of SOVIET AIR FORCE HELICOPTERS flying by in formation.  EXT. ABOVE THE FOREST - 237   237 CONTINUOUS  The helicopters bank around toward Chernobyl. TITLE:  MORNING, APRIL 27 30 HOURS AFTER THE EXPLOSION OMITTED 238   238 EXT. ROOF OF 239   239 ADMIN BUILDING   -   CHERNOBYL   -   CONTINUOUS  LEGASOV stands on the roof, watching the helicopters through binoculars. Shcherbina stands next to him. Behind them, set up on a small portable table, is a STASIUK, a RADIO OFFICER with a radio and microphone. We hear the squawk of voices over the radio. 36.",
      "characters": [],
      "action_text": "BASE COMMAND (RADIO) Boris squadron, maintain altitude, hold at 5 kilometers. Anna squadron proceed to pattern. Lead One begin approach. Keep clear of the construction cranes on the south edge of the zone, and move in from the east. As Legasov watches, four helicopters come closer. Three remain in a holding pattern while the LEAD COPTER begins to move slowly toward the reactor site. PILOT (RADIO) Anna squadron to pattern, Lead One on approach from east. The lead helicopter BANKS as it begins to move toward the PLUME OF SMOKE. Legasov watches. Nervous. LEGASOV Remind them about the perimeter. Stasiuk looks to Shcherbina for the okay on that. Shcherbina scowls. Doesn't like taking orders from Legasov. But nods. Fine. STASIUK into mic (   ) They cannot fly directly over the fire. A minimum of a ten meter perimeter. BASE COMMAND (RADIO) Ten meter perimeter, copy. A bit of static, then: BASE COMMAND (RADIO) Lead One, per preflight-- maintain minimum ten meter perimeter. PILOT (RADIO) Cop[distortion]. Legasov continues to peer through the binoculars. Shcherbina just watches with his eyes. Unblinking. The helicopter moves slowly toward the plume of smoke. PILOT (RADIO) Forty meters. [distortion]-five Thirty. 37. The smoke suddenly SHIFTS, and washing over the helicopter, partially obscuring it. Legasov lowers the binoculars. He's lost sight of the copter. ON THE RADIO - the signal is starting to distort. Then: PILOT (RADIO) breaking up (   ) --visibility, I [can't]-- breaking up (   ) --twent[y]-- BASE COMMAND (RADIO) Lead One, repeat. PILOT (RADIO) [distortion] are we [distortion] BASE COMMAND (RADIO) Repeat. Repeat. The wind shifts, and the smoke moves away, briefly REVEALING THE COPTER. It's drifting RIGHT OVER THE FIRE. LEGASOV No no no-- they're too close. The smoke returns, OBSCURING THE HELICOPTER again. Stasiuk looks to Shcherbina. LEGASOV no time for this (   ) They   cannot   go over the core-- tell them! Shcherbina gives Stasiuk another nod. Do it. STASIUK Lead ",
      "dialogue_count": 0,
      "word_count": 2772
    },
    {
      "scene_number": 3,
      "slugline": "EXT. POLISSYA HOTEL - NIGHT 255   255  A Red Army UAZ-469 drives up to the hotel. There are lights on in the lower windows. All of the windows above the first storey are dark...  INT. POLISSYA HOTEL - BANQUET ROOM - NIGHT 256   256  The type of place where you might have a wedding. The fancy lights and carpet are a strange contrast to Legasov and Shcherbina, who sit at a banquet table, looking at a large MAP of the region. Legasov smokes as he talks. Shcherbina barely looks at the map. Seems lost in his thoughts. LEGASOV We have to start a radiological survey. Sector by sector. On foot-- dosimeters in hand-- Legasov realizes Shcherbina isn't listening. LEGASOV Are you all right? Shcherbina lifts his head. Forces a reassuring smile. Then: PIKALOV enters with KHOMYUK. PIKALOV I'm sorry to interrupt. The guards arrested this woman at the south checkpoint. I would have put her in a cell, but-- KHOMYUK --but he thought you should know that   I know. Before Legasov can even ask-- KHOMYUK I know your reactor core is exposed. I know the graphite is on fire, the fuel is melting, and you're dropping sand and boron on it. Which you probably thought was smart. But you've made a mistake. (MORE) 50.",
      "characters": [],
      "action_text": "beat (   ) KHOMYUK   (cont'd) Ulana Yuriyvna Khomyuk, chief physicist, Byelorusian Institute for Nuclear Energy. You're Valery Alexeyevich Legasov? He nods. A bit bewildered. KHOMYUK Smothering the core will put the fire out, but the temperature will eventually increase. It will melt down-- He raises a hand to stop her. LEGASOV Believe me, I'm perfectly aware. But I estimate at least a month before it melts through the lower concrete pad, which gives us time to-- KHOMYUK You don't have a month. You have approximately two days. Before Legasov can respond, she puts the BLUEPRINTS down on top of their map. Points to the bottom of the reactor. KHOMYUK Yes, the fuel   would   take a month to reach the concrete pad here, but first it's going to burn through the biological shield   here   by Tuesday. And when it does, it's going to hit these tanks. Bubbler pools. Reser-- LEGASOV Reservoirs for the ECS. I understand your concern, but I confirmed it with plant personnel-- the tanks are nearly empty. KHOMYUK No. They   were   nearly empty. That gets Legasov's attention. He leans in, concerned, as she points to the blueprints again. KHOMYUK Each of these points, here, here, here in the reactor hall... all drain to the bubbler pools. 51. Legasov leans back. Beginning to understand. KHOMYUK I'm guessing every pipe in the building ruptured. And then there are those fire engines I saw on the way in. Pikalov turns to Legasov. PIKALOV The fire hoses are still connected. They've been gushing water into the structure this whole time. LEGASOV horrified (   ) The tanks are full... Shcherbina is utterly confused, but he can see from Legasov's face-- something has gone terribly wrong.  INT./EXT. NEWS REPORTS - VARIOUS 257   257  The ugly globe-and-red-star logo of the Soviet nightly news program VREMYA (\"time\") gives way to an oddly-framed newsdesk in front of a large blue screen. A female newsreader calmly reads a 14-second report.   This is footage of the actual newscast made on April 2",
      "dialogue_count": 0,
      "word_count": 2854
    }
  ]
}