{
  "slug": "chernobyl-104-the-happiness-of-all-mankind-2019",
  "title": "chernobyl 104 the happiness of all mankind",
  "genre": "action",
  "format": "series",
  "scenes_count": 3,
  "characters_count": 0,
  "characters": [],
  "total_words": 9092,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. MOSCOW UNIVERSITY LIBRARY - 418   418 DAY  The foreboding building, with its jutting central tower covered in bone-white tile, looks more like a prison fortress than a repository of knowledge.  INT. SECURITY CHECK-IN - 419   419 CONTINUOUS  Khomyuk waits by a check-in desk in front of a security gate. A SECURITY OFFICER - male, 30's, has her credentials in front of him on his desk. He painstakingly records her information into a LOGBOOK. No sound but the scratching of his pen, a   tunk-tunk-tunk   of an unseen clock, and the hum of overhead lights. Finally, he hands her credentials back, then hits a button. There's a BUZZ, and the security gate clicks open.  INT. 420   420 LIBRARY ARCHIVE   -   LATER  A large, two-level reading room. Long wooden tables run the length of it. KHOMYUK sits alone at the end of one of the tables. Stacks of books. Journals. Maps. Notepads. And a THICK BINDER with page after page of a dot matrix printout... an infodump from a computer, no doubt. We catch bits of her work as she progresses. Mathematical calculations. Notations referring to time of day. Marked-up diagrams of a nuclear reactor. Photographs of control room instrumentation...   panel schematics... She   circles   A3-5   (AZ-5 in Cyrillic)   on a schematic. Leans back. Thinks. Then checks one of her books. No. What she's looking for won't be in there. She tears a blank page from her notepad and starts writing.  INT. LIBRARY 421   421 ARCHIVE   - REFERENCE DESK -   LATER  An elderly male librarian sits behind an open window... a bit like a bank teller. Behind him, a few desks and walls of card catalogs. The secure reference section. He looks up from his work. Sees Khomyuk waiting. LIBRARIAN Yes? 14.",
      "characters": [],
      "action_text": "She hands him the piece of note paper through the window. KHOMYUK I need to see the following documents. They're listed as permission only. He takes the paper... and then a LETTER she hands him. KHOMYUK I'm working for the Central Committee. He puts on his glasses. But before he can even read the letter, a MAN IN A SUIT, 40 comes into view behind him. The KGB agent takes the list from the old man, who meekly looks down without protest. He walks back to a desk. Picks up a phone. Dials. While he mutters to someone on the phone, Khomyuk waits quietly. The old librarian still keeps his eyes down. Doesn't want to know her. Doesn't want trouble. THE AGENT - has a BLACK PENCIL in his hand. Whoever he's called is giving him instructions. He swipes the pencil across her list. Once... twice... three times... Khomyuk holds her anger in. The agent finally hangs up. Walks back to the librarian. Puts the piece of paper down. Every single request has been CROSSED OUT except for one. AGENT She can have that one. The agent lifts his head to stare at Khomyuk. A challenge for her to argue. But all he gets back is: KHOMYUK Thank you, comrade. He gives a little smile. Oh well. Perhaps next time.  EXT. FARMLAND - DAY 422   422  Over SCORE... no other sound... SLO-MO... dreamlike... BIRD'S EYE VIEW - an enormous, wide-open cabbage field. NEAT ROWS of vegetables. Then: THREE BULLDOZERS - enter frame, moving in a line, perfect unison, destroying the harvest in rows just as neat. 15.",
      "dialogue_count": 0,
      "word_count": 557
    },
    {
      "scene_number": 2,
      "slugline": "EXT. VILLAGE - DAY 423   423  SCORE/SLO-MO continues: THREE CHOPPERS glide like mosquitoes over a small, abandoned village, each dumping FOUR EVEN STREAMS of BROWN DECONTAMINANT, which land on everything like paint.  EXT. PRIPYAT STREET - DAY 424   424  SCORE/SLO-MO continues PUMP TRUCKS roll down the main street, each spraying an arc of BROWN FOAM DECONTAMINANT to the side. MEN IN PROTECTIVE SUITS - hoods drawn tight, faces covered in GAS MASKS, walk in front of the procession of trucks, spraying the road in a waving motion with handheld-nozzles connected to TANKS strapped to their back. It almost seems celebratory. Some kind of sick parade...  FADE TO BLACK OMITTED 425   425 OMITTED 426   426 A DARK BLOB AGAINST BLUE - OUT OF FOCUS - RESOLVES TO: 427   427 EXT. ROOF - KATYA - DAY 428   428  A chunk of   GRAPHITE. Scattered beyond it, more of the same. The bits of rock sitting on the scorched pitch-covered roof give the impression of an alien surface. And adding to that eerie sense... in the B.G., we see a FOUR-WHEELED VEHICLE - like a retrofuturistic go-cart, sitting on the roof. The LUNAR ROVER. It's about eight feet long. Steel piping. Cameras mounted on articulated arms. The tires are paper thin, with barely-there hubs made of needle-like spokes. A BULLDOZER ARM AND BLADE have been welded onto its front. 16.",
      "characters": [],
      "action_text": "INT. REMOTE COMMAND CENTER - 429   429 CONTINUOUS  A small, undamaged room under the roof. OPERATORS sit at a small table. Control equipment and small, square TELEVISION MONITORS are stacked. And a COMPUTER. On the walls, PHOTOS of the roof. A boxy CONTROL MODULE sits on the desk. Cables running in and out. Two switches. Two rows of LIGHTS. The lights are all currently RED. Legasov and Shcherbina watch, nervous, as Tarakanov waits with a walkie-talkie by his ear. Then: WALKIE-TALKIE We're clear. Tarakanov takes a breath. Then to his operators: TARAKANOV Bring up the cameras. The lead operator, JUGHASHVILI, hits the first switch on the control module.   THREE RED LIGHTS - turn GREEN. The other three remain red. THE MONITORS - flicker to life. Different IMAGES of the roof from the rover's cameras. And ONE REMOTE SITE CAMERA showing the LUNAR ROVER ITSELF. TARAKANOV Signal? JUGHASHVILI Acceptable. Running onboard diagnostics. TARAKANOV Tell me when we can start moving it. Shcherbina moves in closer to stare at the montior. SHCHERBINA To think that's what they put on the moon... LEGASOV Well, not that one. SHCHERBINA (glares) I know not that one. 17. Legasov shrugs. Sorry. TARAKANOV This rover was in storage, and I'm told they can build two more. That should cover Katya and Nina. SHCHERBINA And Masha? TARAKANOV The Central Committee has informed me they've found something that can work up there. From the outside. LEGASOV American? TARAKANOV Of course not. No, it's a German police robot. West German, though. You can imagine that wasn't easy. JUGHASHVILI Diagnostics complete, ready to engage main power and motor. Legasov and Shcherbina get ready. If this doesn't work... TARAKANOV Begin. The operator turns the second switch on the control module. Nothing. The lights stay red. Everyone is dead quiet. Then: TARAKANOV Again. The operator goes back to the switch. Off. Then on. Still nothing. Red lights. The monitors continue to show the rover's view of the roof. Slightly askew",
      "dialogue_count": 0,
      "word_count": 6329
    },
    {
      "scene_number": 3,
      "slugline": "INT. TOP OF THE STAIRS - 460   460 CONTINUOUS  The soldier returns to the relative safety of the hallway. The DOSIMETER noise subsides to a steady, low clicking.   And to think that once frightened us. The soldier remembers that he's still holding the shovel. His fingers gripped tight. He flings it into the bin. Then he feels something. PAIN. He looks down at his boot. There's a SMALL RIP in the rubber. He stares at it for a moment, then: SITE OFFICER (O.S.) Comrade soldier. The masked soldier looks up. The Site Officer stands ten feet away. Safe distance. He points toward a corridor. SITE OFFICER You're done. The soldier hesitates for a moment, as if he's not sure what that even means... ...and then he nods, turns to the corridor that will take him to decontamination, and exits. We never saw his face. We never even knew his name. The Site Officer watches him leave, then turns to:   FOUR NEW SOLDIERS, masked and suited up. SITE OFFICER It's time to go.  EXT. KIEV - APARTMENT COMPLEX COURTYARD - DAY 461   461  Children run by, bundled up against the cold, shouting and yelling happily as they play. We're back in the courtyard surrounded by blocky Soviet apartment buildings. LYUDMILLA - heavily pregnant, sits on a bench, still alone. Watching the children play. Watching the mothers. And fathers. TITLE:  DECEMBER, 1986  45.",
      "characters": [],
      "action_text": "A RUBBER BALL - bounces across the playground toward Lyudmilla. She bends down with effort to pick it up, and a LITTLE GIRL, 6, runs over to get it. Lyudmilla smiles and hands the ball back to the girl, and the girl smiles back. Then the pain hits. Lyudmilla doubles over. A contraction.   The little girl's smile fades. She just stares. WIDE SHOT - from across the courtyard. Women gathered in the foreground, chatting. In the B.G., Lyudmilla is doubled over... the little girl standing next to her. The PAIN hits again. Harder. She cries out. The little girl RUNS AWAY, afraid... and finally, one of the grown women turns to see Lyudmilla. Another cry. They all see her now. It's like they're just discovering she exists.   And finally, two of the women start running across the concrete courtyard to help her, and: DISSOLVE TO:  EXT. PRIPYAT - 462   462 LATE AFTERNOON  Silent streets. The freezing air is still. May Day banners hang limp and torn. Dead trees line the streets. And then, at the far end of the street - MOVEMENT.   A Red Army UAZ-469, the Soviet version of a Jeep, turns into view. Slowly moving toward us.  EXT. PRIPYAT - 463   463 CONTINUOUS  BIRD'S EYE VIEW - the UAZ drives down the street.   Nothing else moves in the dead, empty, silent   city.  EXT. OUTSKIRTS OF PRIPYAT - 464   464 MINUTES LATER  LOW TO THE GROUND - a cluster of dead bramble. The legs of a CHILD'S DOLL stick out obscenely from the branches. The UAZ enters, and rolls to a slow stop. KHOMYUK emerges from the passenger side. A FILE FOLDER under her arm. 46. In front of them, an ugly building. Dull white tiles. Four stories. Broken windows.   She looks around. No one in sight. No sound in the frigid air. They are completely alone. She nods in thanks to the   driver   and turns to the building.  INT. DILAPIDATED BUILDING - 465   465 MOMENTS LATER  Khomyuk walks slowly down a dim corridor. Broken glass occasionally crunching under her feet. Her breath fogging in the freezing air.   This was an ELEME",
      "dialogue_count": 0,
      "word_count": 2206
    }
  ]
}