{
  "slug": "cobra-kai-105-counterbalance-2018",
  "title": "cobra kai 105 counterbalance",
  "genre": "action",
  "format": "series",
  "scenes_count": 8,
  "characters_count": 0,
  "characters": [],
  "total_words": 7650,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. DIAZ APARTMENT - MIGUEL’S ROOM - MORNING 1   1  An iPhone alarm goes off. Miguel wakes up and turns it off. He sits up in bed, groggy, taking a few seconds to adjust to consciousness. He then plugs headphones into his phone jack. The badass speed guitar of Slash’s   World on Fire   kicks in, as Miguel gets on his floor and does push-ups on his knuckles. This kicks us into an AWESOME TRAINING MONTAGE: INT. COBRA KAI DOJO - MORNING 2   2  Miguel does knuckle push-ups on the mat. Johnny walks around him, nodding in approval. His student is getting stronger. CUT TO: Miguel is staring at the camera, laser-focused, wearing BLACK FOREARM GUARDS and SHIN GUARDS. We rack focus to Johnny standing behind him. JOHNNY READY?! MIGUEL Yes sensei! Johnny click a button on a small remote. Just then, a BASEBALL is fired out from a PITCHING MACHINE. It goes straight at Miguel’s face. Miguel quickly raises his forearm and blocks the baseball. He’s surprised he blocked it and looks to Johnny, excitedly. Johnny hits the remote again. Miguel quickly turns and sees the ball is already coming. He tries to block it but he’s too slow and it hits his hand. OUCH. Johnny shakes his head. CUT TO: INT. GYM - BLEACHERS - DAY 3   3  Miguel runs up and down the bleachers of his school gym. He’s sweating profusely and shadow-punching when he reaches the top. Down on the floor, Kyler and Brucks walk by, carrying gym duffels after wrestling practice. Kyler elbows Brucks, pointing up the bleachers at Miguel. They both smirk. Miguel notices them, but puts his head down and keeps running.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 279
    },
    {
      "scene_number": 2,
      "slugline": "INT. COBRA KAI DOJO - DAY 4   4  Miguel’s legs are kicking on the ground helplessly. We tilt up to reveal JOHNNY HAS MIGUEL IN A CHOKE-HOLD. JOHNNY What does a Cobra do? Miguel can’t speak. His face is turning red. Johnny really isn’t taking it easy on him. CUT TO: Miguel is back in front of the pitching machine. Johnny hits the remote. The baseball is fired and Miguel blocks it with his forearm guard. Johnny clicks again and again. We see ball after ball shoot at Miguel as he expertly blocks each one with ease. He jumps up high for one ball and uses his SHIN GUARD to block it, then quickly blocks another with his forearm. Johnny nods, impressed. CUT TO: Miguel (no guards or pads) uses his forearm to block a ROUNDHOUSE KICK from Johnny. Johnny and he are sparring on the mat. Miguel looks a little nervous as his sensei attacks him with kicks and punches, but he’s blocking well... ...until he misses an ELBOW TO THE FACE. Miguel goes down. Johnny shakes his head, disappointed. CUT TO: Miguel is back in Johnny’s choke-hold. Johnny squeezes harder on Miguel’s neck. JOHNNY (CONT’D) What does a Cobra do? Just then, Miguel twists his body. Johnny loses leverage as Miguel escapes his grasp. Miguel then jumps up. MIGUEL Slither! Johnny nods. Not bad. CUT TO: COBRA KAI 105   \"Counterbalance\"   Pink Pages   11/12/17   2.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 237
    },
    {
      "scene_number": 3,
      "slugline": "EXT. LAUREL CANYON - DAY 5   5  DRONE POV: Miguel runs uphill on Laurel Canyon as cars pass him by. As he crests the hill, the POV rises high in the sky, revealing the whole Valley below him. Christmas lights twinkle on most of the houses. CUT TO: INT. DIAZ APARTMENT - LIVING ROOM A6   A6  There are a few Christmas decorations around the apartment, as Miguel does a series of push-ups (on his knuckles) on the living room floor. INT. COBRA KAI DOJO - DAY 6   6  Back to their sparring match-- Johnny attacks Miguel with a variety of punches and kicks. Miguel dodges and blocks each one. His defense is strong. Johnny goes to back-elbow Miguel, but Miguel ducks it and LEG SWEEPS JOHNNY... Johnny falls down on the mat. He’s shocked as he looks up at Miguel, who’s smiling proudly. The student has actually bested the teacher! Until... Johnny presses a button on the remote. A BASEBALL SHOOTS OUT from the machine and hits Miguel on the side of the head, right at his ear. MUSIC ABRUPTLY ENDS, as Miguel screams. MIGUEL AHHHHH!!!!!!!!!!! Miguel falls to the ground in serious pain, holding his ear as Johnny stands up. MIGUEL (CONT’D) What the hell?! That wasn’t fair...! JOHNNY You want a fair fight? Dream on, kid. You can’t assume your enemy is going to play by the rules. Miguel stands up, holding his ear in pain. MIGUEL Yeah, but my ear! COBRA KAI 105   \"Counterbalance\"   Pink Pages   11/12/17   3.",
      "characters": [],
      "action_text": "JOHNNY What if that baseball was your enemy’s friend coming at you from behind? You have to be prepared for all possibilities. MIGUEL Is it bleeding? COBRA KAI 105   \"Counterbalance\"   Pink Pages   11/12/17   3A. Miguel stops rubbing his ear, revealing that it is very red and swollen. Johnny blanches. JOHNNY (lies) Nah, it looks fine. Don’t be such a baby. Just then, the door opens, and THREE WOMEN in SPANDEX enter, led by a hippie-ish woman in her 30s (FAUNA). FAUNA Hi! It’s five o’clock! Twilight is upon us! JOHNNY (frustrated) Oh. Right. Miguel gets up, confused, as he watches the women enter the dojo and set up YOGA MATS. MIGUEL What’s going on? JOHNNY I had to sublet a few hours. Just until we get more students. They watch as women light incense. They play New Age music. FAUNA Need to change the energy in here... Fauna pulls out a giant cloth and pins it to the wall above the “Strike First” mantra. As it unfurls, it covers the words with a peaceful DOVE and the motto, “LOVE IS HERE TO NAMASTE.” Johnny shakes his head, disgusted. SUPER:   COBRA KAI  INT. ENCINO OAKS COUNTRY CLUB - NIGHT 7   7  A silver tray is placed on a table. The top is removed to reveal a delicious three pound lobster. Reveal Daniel and ARMAND ZARKARIAN (50s Armenian real estate owner, thick accent) at the table... DANIEL Not bad, right? They ship in the three pounders from Ogunquit. COBRA KAI 105   \"Counterbalance\"   Pink Pages   11/12/17   4. Armand digs in, cracking the shell with gusto. ARMAND I love these hot butters. He sloppily dips a claw into a little ramekin of warm drawn butter and eats it. ARMAND (CONT’D) Thanks for the invite, LaRusso. Tanya and the kids always loved Lobster Night. You know this club revoked my membership? DANIEL Yeah, and frankly, I didn’t like how they handled that. It’s a stupid rule, if you ask me. ARMAND That’s what I told them. DANIEL I mean that’s the entire reason we wear flip flops in the showers, right? Armand nods in agreement, as he eats. DANIEL (CON",
      "dialogue_count": 0,
      "word_count": 1927
    },
    {
      "scene_number": 4,
      "slugline": "INT. LARUSSO LEXUS - DANIEL’S OFFICE - DAY 12   12  Daniel sits at his desk, on the phone. DANIEL (INTO PHONE) Armand, come on. I’ll give you ten percent over market price. That’s a great deal! INTERCUT: EXT. BOBA TEA STORE - DAY 13   13  Armand walks out of the store, sipping on a boba tea. ARMAND (INTO PHONE) That   is   a great deal. Too great. Why you want this so bad? Reseda’s a shithole. DANIEL (INTO PHONE) Call it nostalgia. I grew up there. ARMAND (INTO PHONE) Then you know it’s a horrible place. (re: boba) This boba is not good. The straw’s too thick. DANIEL (INTO PHONE) Look, if Reseda’s so bad, why not sell me the strip mall? I want to invest in my old community... ARMAND (INTO PHONE) I smell bullshit. I think there’s some other reason you want this. DANIEL (INTO PHONE) I don’t know what you’re talking about. And I don’t see why you’d even care. The mall down the street gets over twice the rent. You’re not even charging market rate. ARMAND (INTO PHONE) You insult me, LaRusso? DANIEL (INTO PHONE) I’m just letting you know the truth. I’m scratching your balls! COBRA KAI 105   \"Counterbalance\"   Pink Pages   11/12/17   12.",
      "characters": [],
      "action_text": "ARMAND (INTO PHONE) I can scratch them myself. I didn’t get to where I am by trusting car salesmen. No deal! DANIEL (INTO PHONE) Fine. Then enjoy pissing in your own your shower, Armand. ARMAND (INTO PHONE) Everybody does it! Armand hangs up, upset. He tosses his boba into a trash can and walks off. In his office, Daniel smiles - his plan is coming together on schedule. EXT. DEL TACO - DAY 14   14  Moon’s car is parked in a Del Taco parking lot. INT. MOON’S CAR - DAY 15   15  Del Taco wrappers are all over the car as Moon (drivers seat) and Yasmine (passenger seat) hotbox, passing a joint. The car is hazy. Moon takes a hit. MOON My mom gave me this weed for my birthday. It’s supposed to be lower in calories or something. Yasmine sees Lynn outside the car, holding a chunk of the torn-up COBRA KAI sign: “GIMME MONEY” is written in black marker on the back. YASMINE Ew, a homeless person. Don’t look. MOON I feel bad not looking. (she looks) Uh-oh, I made eye contact. Yasmine sees Lynn approaching. YASMINE Great, now she’s coming. You see what you’ve done?! MOON (paranoid) What do we do? COBRA KAI 105   \"Counterbalance\"   Pink Pages   11/12/17   13. YASMINE Just take out your phone and act like you’re texting. They both take out their phones and pretend to text as they look at their screens. Lynn comes up to the window and taps on it. Yasmine and Moon continue looking down. LYNN Hey! Open up and gimme money! (taps again, then sweetly) I ain’t gonna hurt ya! YASMINE (whispering) Lock the doors. MOON That’ll look bad, doing that right in front of her. YASMINE You want her hopping in the back seat, smearing shit everywhere, and slicing our throats? Be my guest. Moon feigns a yawn, trying to casually reach for the DOOR LOCK. Just then, the BACKDOOR OPENS. The girls freak out. YASMINE/MOON AHHHHHHH!!!!!! They turn and see Samantha has gotten in the back seat and Lynn has moved on. YASMINE What the hell, Sam?! MOON We thought you were a poor person! SAMANTHA Why have you guys ",
      "dialogue_count": 0,
      "word_count": 764
    },
    {
      "scene_number": 5,
      "slugline": "INT. COBRA KAI DOJO - DAY 16   16  CLOSE UP ON JOHNNY... JOHNNY Fighting positions! Miguel and Aisha walk to opposing sides of the mat, facing each other. JOHNNY (CONT’D) (to Aisha) OK, Miss Robinson, let’s see what you’ve got. (to Miguel) Mr. Diaz? Show her everything you’ve learned. Ready? MIGUEL Uh... no. Wait. Sensei... I’m not sure this is right. JOHNNY What are you talking about? MIGUEL Well, she’s a girl. JOHNNY And? I thought you said women were equal to men! MIGUEL I did, but... JOHNNY Then show her she’s equal and punch her in the face! AISHA Uhhhh, I just want to remind everyone. This is my first day. Johnny turns his attention toward Aisha. JOHNNY Your enemies don’t care what day it is. They prey on weakness. If you want to beat them, you have to conquer your fears and jump face- first into the fire. Now are you ready, Miss Robinson? AISHA (nervous) I... guess? COBRA KAI 105   \"Counterbalance\"   Pink Pages   11/12/17   16.",
      "characters": [],
      "action_text": "JOHNNY Mr. Diaz? MIGUEL (unsure) Um... JOHNNY FIGHT! Miguel and Aisha just stand there. Miguel is too nervous to touch her. Johnny is frustrated. JOHNNY (CONT’D) Don’t just stand there! Attack! Miguel takes a deep breath. MIGUEL (to Aisha) I’m sorry. With that, he runs over to the frightened Aisha and does a SPIN KICK TO HER STOMACH. The kick lands hard. Aisha immediately falls to the ground in pain. Miguel feels awful. MIGUEL (CONT’D) Aisha, I’m sorry! I didn’t mean to! Just then, Aisha’s head turns. Her eyes fill with fury. Miguel’s eyes fill with fear, as-- Aisha launches up into Miguel’s midsection, lifting him up off the mat. She BODY SLAMS Miguel and finishes him with a knee-drop to his stomach. As Miguel groans in pain, Johnny looks on, amazed. JOHNNY Girl’s a natural Cobra. Just then, there’s a COMMOTION outside. NESTOR (O.S.) This is wrong! You can’t do this! JOHNNY Students. Wait here. Mr. Diaz, you’re in charge. Aisha helps Miguel up, as Johnny goes to investigate. EXT. VICTORY COURT - DAY 17   17  Johnny exits the dojo and sees Nestor arguing with Armand, who is with his son Roland. COBRA KAI 105   \"Counterbalance\"   Pink Pages   11/12/17   17. NESTOR This is bullshit! I’ve been a tenant here for ten years! JOHNNY Hey, keep it down! I got a class in here! NESTOR This   cabrón   is doubling our rent! ARMAND Just bringing it up to market rate. Johnny looks worried. JOHNNY How do you expect me to pay double? ARMAND (shrugs) If you can’t pay, I find a new tenant. Come, Roland. We go home. Armand and Roland leave. Roland is engrossed in his iPhone video game. ARMAND (CONT’D) (to Roland) You see what I tell you? You have to be tough. ROLAND You’re a big man, Dad. Nestor storms off into his mini-mart, pissed, as Johnny is left pondering how his business will survive. INT. SHANNON & ROBBY'S APARTMENT - DAY 18   18  Robby enters the apartment, carrying a bag of groceries. ROBBY Hey mom, I went to Von’s and got those frozen pizzas you like. Wanna have dinner and w",
      "dialogue_count": 0,
      "word_count": 1373
    },
    {
      "scene_number": 6,
      "slugline": "EXT. VICTORY COURT - MOMENTS LATER 22   22  Johnny exits the dojo. He looks angry and frustrated, as he walks toward the Mini-Mart. As he walks, we see an out of focus dark sedan pull into the lot over his shoulder. Johnny enters the mini-mart. INT. VICTORY MINI MART - CONTINUOUS 23   23  The door DINGS, as Johnny walks in. Nestor is behind the counter, but Johnny ignores him, as he walks over to the refrigerated beverages. He sees the price tag for Coors Banquet, but the slot appears empty. He crouches down and sees a six-pack way in the back. Johnny reaches in and struggles to get his hands on the beer, as we hear the DING of the front door. VOICE (O.S.) Hey, you got any black spray paint? Johnny, arm-deep in the fridge, recognizes the voice. He bangs his head on the door of the fridge, as he pulls out the beer and stands up. CAMERA TURNS to reveal Daniel LaRusso standing at the counter. Daniel looks directly at Johnny, as he speaks to Nestor. DANIEL I have a little art project. Big canvas. Right near a couple of freeways. Johnny knows exactly what Daniel is talking about, but says nothing. NESTOR I keep it in the back. Kids are always stealing it. (then, re: Johnny) Watch him for me, will you? Nestor exits to the back, as Daniel casually browses the aisles. JOHNNY What are you doing here, LaRusso? COBRA KAI 105   \"Counterbalance\"   Pink Pages   11/12/17   23.",
      "characters": [],
      "action_text": "DANIEL Just checking out the neighborhood. You know I was actually considering opening up a dealership on this side of town. But I don’t know, the rent seems to be getting a little out of control. Johnny takes this in, gut-punched. DANIEL (CONT’D) Frankly, I don’t know how you afford it. Small business like yours. More power to you. Daniel picks up a pack of gum, as Nestor returns to the counter with a can of spray paint. DANIEL (CONT’D) (to Nestor) You know on second thought, I don’t need the paint. (re: gum) Just this. And throw that guy’s beer on my tab. He looks like he’s had a rough day. Johnny is boiling with anger, but stunned silent, as Daniel throws a twenty on the counter and exits. INT. LARUSSO RESIDENCE - KITCHEN - NIGHT 24   24  Daniel enters the kitchen with a spring in his step. He grabs a fancy corkscrew and starts opening a bottle of wine, as Amanda enters from the living room. AMANDA Opening the 2013? Somebody’s in a good mood. DANIEL Somebody got some payback. Daniel pops the cork and grabs some glasses, as Amanda sighs. AMANDA Daniel, do you really think it’s a good idea to start a war with Tom Cole? DANIEL What? Oh. No. Turns out it wasn’t Cole who messed with the billboard. COBRA KAI 105   \"Counterbalance\"   Pink Pages   11/12/17   24. Daniel pours the wine and then goes in his jacket pocket, taking out the Cobra Kai flyer that he got from Anoush. DANIEL (CONT’D) It was Johnny Lawrence. Amanda looks at the flyer, taking this all in. DANIEL (CONT’D) I thought after thirty years, maybe he’d change. But he’s still the same prick he was in high school. Guy thinks he can bring Cobra Kai back to the Valley? Not on my watch. Daniel takes a nice, satisfying sip of his wine. AMANDA (nervous) What did you do? DANIEL I told Zarkarian I wanted to buy the Cobra Kai strip mall. AMANDA Why did you do that? What do you need with a shithole in Reseda? DANIEL No no no. You’re gonna love this. I wasn’t really gonna buy it. I just wanted to tweak Zarkarian, so he’",
      "dialogue_count": 0,
      "word_count": 2385
    },
    {
      "scene_number": 7,
      "slugline": "EXT. VICTORY COURT - DAY 33   33  Johnny gets out of his car, confused as to why all of these kids are here. Most of them have their PHONES out, looking at videos with one another. He approaches and looks over a TEEN’s shoulder at his phone. TEEN (O.S.) This thing’s already up to ten thousand views... ANGLE ON PHONE: It’s a YouTube video of Miguel kicking ass in the cafeteria yesterday. The iPhone footage has been edited into a supercut, with awesome sound effects and Cobra Kai stickers all over the place. At the end is a picture of the dojo with the words, “FIGHT LIKE A COBRA KAI” superimposed. Johnny is confused. He looks up the line. AT THE FRONT, near the dojo’s front door, stands Miguel, proud and triumphant. Clearly he turned the fight video into a commercial for the dojo. Standing next to him is Aisha. Miguel meets eyes with Johnny. They smile to one another. Just then, a TOW TRUCK pulls into the lot, as Lyle comes out of the pawn shop. Lyle approaches the TOW TRUCK DRIVER and points to Johnny’s Firebird. LYLE It’s this one right here. I want you to bring it to Anibal’s shop and have him paint it blue. As the tow truck driver grabs his chains, Johnny walks over. LYLE (CONT’D) (to Johnny) Got your money. Twelve hundo. You get everything out of the trunk? He tries to hand Johnny an ENVELOPE full of cash. JOHNNY It’s no longer for sale. LYLE Wait, but you said-- Lyle and the tow truck driver look confused, as Johnny walks triumphantly toward Miguel, Aisha, and the dojo. JOHNNY (to Miguel) Looks like we’re open for business. COBRA KAI 105   \"Counterbalance\"   Pink Pages   11/12/17   33.",
      "characters": [],
      "action_text": "Johnny puts his key in the lock and opens the door. EXT./INT. DANIEL’S GUEST HOUSE - MORNING 34   34  Daniel opens the door to his guest house, which is still full of stuff the family has been storing over the years. In QUICK SHOTS, we see Daniel clearing out all the junk. Slowly, but surely, the guest house is turning back into the little dojo it used to be. Amanda walks by, dressed for work, and wondering what her husband is up to. She looks through the doors and sees Daniel hanging an Okinawan tapestry. He looks happy. She smiles and leaves him to it, heading to work. INT. LARUSSO LEXUS - OFFICE - DAY 35   35  Amanda sits at her desk, reading a resume. AMANDA Wow, this is an impressive high school transcript. Why do you wanna sweep up around here? Shouldn’t you be in college? REVEAL Robby is sitting at the other end of the desk. He flashes his winning smile. ROBBY I’m taking some time off to figure things out. This is exactly where I want to be. AMANDA OK! Well, I’d introduce you to my husband, but he’s taking a personal day. Can you start Monday? Robby smiles and nods. ROBBY Absolutely. Amanda stands and extends her hand. AMANDA Welcome to the LaRusso family! They shake hands. COBRA KAI 105   \"Counterbalance\"   Pink Pages   11/12/17   34.",
      "dialogue_count": 0,
      "word_count": 522
    },
    {
      "scene_number": 8,
      "slugline": "INT. DANIEL’S GUEST HOUSE - DAY 36   36  Daniel’s home dojo has been fully restored. Daniel hangs the framed photos of himself training with Sam when she was younger, followed by a photo of himself with Mr. Miyagi. He then takes out a small case and opens it.   Pulp Fiction  style, he looks inside the case, but we don’t get to see what he’s looking at. Until... Daniel reaches in and takes out the WHITE OKINAWAN CLOTH that Mr. Miyagi gave him in the original movie. We hear Bill Conti’s sweeping score as Daniel folds the cloth into a neat headband, wraps it around his head, and knots it. While the camera pulls back and the score swells... Daniel takes a deep breath. Camera moves around him in a smooth, fluid arc, as he begins going through the precise, meditative movements of Kata. The Karate Kid is back. CUT TO BLACK. END OF EPISODE COBRA KAI 105   \"Counterbalance\"   Pink Pages   11/12/17   35.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 163
    }
  ]
}