{
  "slug": "cobra-kai-107-all-valley-2018",
  "title": "cobra kai 107 all valley",
  "genre": "comedy",
  "format": "series",
  "scenes_count": 4,
  "characters_count": 0,
  "characters": [],
  "total_words": 6228,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. LARUSSO RESIDENCE - GUESTHOUSE - CONTINUOUS 9   9  Daniel is putting Robby through the paces of everything he’s learned. DANIEL Show me wax-on, wax-off! As Robby experiences the realization that all the moves Daniel taught him are actually karate techniques, he goes through the motions, just as Daniel did with Miyagi. Daniel smiles, proud of Robby and proud of himself. THEN... Daniel lunges and strikes at Robby. Robby quickly uses muscle memory to block, defend, and spar with Daniel. It’s an intense and awesome culmination –- just like it was in ‘84. Robby can’t believe what he just did. ROBBY Whoa... Daniel smiles, knowing the feeling. He takes a step back and bows. Robby bows to Daniel. SUPER:   COBRA KAI  INT. COBRA KAI DOJO - DAY 10   10  Johnny, donning his sleeveless black gi and headband, weaves through the room of students, all wearing their white Cobra Kai gis. The class stands in formation, a bit fearful of Johnny, as he seeks out weakness. JOHNNY Adjust your stance, Hawk! Johnny KICKS Hawk’s legs to widen them. JOHNNY (CONT’D) Stabilizing your base gives you balance, creates distance between you and your opponent and allows for full rotation when you strike. HAWK Yes, Sensei! Johnny turns to JOE, who flinches for no real reason. JOHNNY Did you just flinch, Virgin? COBRA KAI 107   \"All Valley\"   Pink Pages   11/13/17   3.",
      "characters": [],
      "action_text": "Johnny doesn’t even wait for his answer. He turns and fake punches BERT. Bert flinches even harder. COBRA KAI 107   \"All Valley\"   Pink Pages   11/13/17   3A. JOHNNY (CONT’D) Holy shit! We got a room full of flinchers. STUDENTS Yes, sensei! JOHNNY That wasn’t a question. (looks around) Who here has never been punched in the face? EVERYONE except Miguel and Aisha raise their hands. Johnny can’t believe it. He walks to the front of the class. JOHNNY (CONT’D) Your entire lives, you’ve been avoiding fights, because you’re all afraid of losing a tooth. Or breaking your nose. Or this concussion nonsense. The students look at each other, trepidatiously. JOHNNY (CONT’D) So there’s only one solution. Before we leave this dojo today, each and every one of you will take a punch. Very hard. To the face. The students look extremely fearful. JOHNNY (CONT’D) Miss Robinson, line them up. You’re gonna un-flinch this group. AISHA Yes, Sensei. She steps in front of Joe and cracks her knuckles. Joe looks extremely nervous. As Aisha winds up and launches a punch... CUT TO: INT. COBRA KAI DOJO - OFFICE - MOMENTS LATER 11   11  We hear Aisha punching and shouting in the background, as Johnny sits at his desk, drinking a Coors Banquet and paging through an issue of   Black Belt . He looks enviously at an ad for fancy nunchakus. COBRA KAI 107   \"All Valley\"   Pink Pages   11/13/17   4. JOHNNY Four hundred and fifty bucks for nunchucks? What a rip. Johnny turns the page to a large ad for this year’s All Valley Under-18 Karate Tournament. Johnny raises his eyebrows, his wheels turning. Miguel enters the room, tentatively. MIGUEL Sensei, can I ask you something? JOHNNY First aid kit’s under the counter. We got a bleeder? MIGUEL No-- I mean yeah, we do. There’s lots of blood. But this is about something else. Johnny tosses the magazine on the desk. JOHNNY What is it? MIGUEL (awkward) Uh, well, there’s this girl at school-- JOHNNY Is she hot? MIGUEL She’s super smart and... JOHNNY Hot? MIGUEL ..",
      "dialogue_count": 0,
      "word_count": 790
    },
    {
      "scene_number": 2,
      "slugline": "INT. DINER - DAY 12   12  Robby, now donning his LaRusso Luxury Motors employee shirt, dips some french fries in the ketchup. He’s eating a grilled cheese and bacon sandwich with fries and a Coke. TREY (O.S.) Yo yo yo, Job Kid. Whazzup? Robby looks up to see Trey and Cruz (now clean shaven, with no mustache) sliding into the booth. CRUZ Sweet shirt, bro. TREY Yeah. You’re really taking this job thing seriously. Thought you were just tryin’ to piss off your dad. ROBBY I am. I’m gonna quit soon. A CUTE WAITRESS comes over to refill Robby’s Coke. WAITRESS Let me give you a little refill. CRUZ I’ll give you a little refill. She glares at Cruz. WAITRESS Yeah, I bet it’s little. Robby smiles, appreciating her comeback. Trey cracks up. TREY Oh shit! She got you dude! (off Cruz’s pissed off look) All right, enough about Cruz’s tiny dick. We got an idea we wanna run by you. ROBBY I’m on a lunch break... I can’t do anything today. CRUZ Not today. Tonight. A big score. Robby doesn’t want to be involved but he won’t dare say that. COBRA KAI 107   \"All Valley\"   Pink Pages   11/13/17   7.",
      "characters": [],
      "action_text": "ROBBY Oh yeah? What’s the plan? TREY LaRusso Luxury Motors. ROBBY What are you talking about? (whispering, panicked) We can’t steal a car! Trey and Cruz laugh. TREY Relax, nobody’s stealing a car. CRUZ We’re talkin’ auto parts, bro. Rims, stereos, shit made of chrome and shit. ROBBY (not loving this idea) I don’t know, guys... TREY You don’t have to do anything. Just give us the security code, and we’ll let ourselves in. ROBBY But-- I don’t have the code. I’m the new guy, I don’t even have a key to the bathroom. TREY I’m sure you can figure something out. You always do. CRUZ Unless he doesn’t   want   to do it. TREY Well then we have a bigger problem. CRUZ Remember what we had to do to that bitch ass kid out in Ventura? TREY Yeah, that was unfortunate. (beat) But we don’t have a bigger problem, do we Robby? COBRA KAI 107   \"All Valley\"   Pink Pages   11/13/17   8. The guys look dead serious. Robby is intimidated. ROBBY No, no problem. I’ll get the code. CRUZ Noice. You’re doin’ the right thing. TREY (to Cruz) Come on, shrimp dick. Let’s hit it. As they get up, Cruz takes half of Robby’s sandwich. CRUZ Thanks for lunch, job kid! Robby is left in the booth, stressing. EXT. WEST VALLEY HIGH SCHOOL - LOCKERS - DAY 13   13  Miguel is just hanging around the lockers, trying to act casual as Samantha approaches her locker. He takes a deep breath, clearly winding up to take a big swing. MIGUEL Sam, hey! Is this where your locker is, I had no idea. SAMANTHA Hey! Yeah, this is me. That bio test was intense, right? MIGUEL What? Oh. Yeah, super intense. Anyway, glad I ran into you. I’ve been thinking a lot about you-- I mean, not A LOT a lot. Just sometimes-- like the normal amount one thinks of someone else. SAMANTHA (laughs) Are you okay? MIGUEL I just uh-- Are you like um-- (deep breath) Do you wanna go out on a date? With me? Samantha is caught off guard. COBRA KAI 107   \"All Valley\"   Pink Pages   11/13/17   9. SAMANTHA Oh. Uh... That’s really sweet, Miguel. And I want to-",
      "dialogue_count": 0,
      "word_count": 1026
    },
    {
      "scene_number": 3,
      "slugline": "INT. COBRA KAI DOJO - OFFICE - DAY 18   18   *  Johnny uses a foam roller as he talks on the phone. JOHNNY (ON THE PHONE) Yeah, hey, is it too late to register my dojo in the All Valley Tournament? (beat) No? Great! What do I need to do? (beat) Sure, it’s Cobra Kai. Cobra-- like the badass snake. And uh, Kai-- like GUY but not spelled like that. (beat) Kai. K as in kill... INT. COBRA KAI DOJO - SAME TIME 19   19  On the mat, Miguel, Hawk, and Aisha are stretching. MIGUEL I need a place that’s romantic but not trying to be romantic. HAWK You could get matching tattoos. Miguel stares - seriously? HAWK (CONT’D) I know a guy. Just finished this bad boy... COBRA KAI 107   \"All Valley\"   Pink Pages   11/13/17   13.",
      "characters": [],
      "action_text": "Hawk peels off his shirt, revealing a massive HAWK tattooed on his back. MIGUEL Holy shit.   AISHA Whoa, that’s badass. HAWK Right? I was in the chair for 14 hours. AISHA Your parents were OK with that? HAWK Oh, they have no idea. I have to wear a T-shirt until I go to college. Probably longer. Please don’t tell them. Miguel looks over to Aisha. MIGUEL Any other suggestions...? AISHA Don’t look at me. Sam and I used to be friends, but not anymore. MIGUEL Please. I need help. Aisha sighs and softens. AISHA Fine. I know she likes chocolate and... astronomy. She loves the stars. At least she used to. He nods, his wheels turning. MIGUEL I can work with that. Suddenly they’re interrupted by Johnny’s BOOMING voice-- JOHNNY (O.S.) BANNED?!?! WHAT ARE YOU TALKING ABOUT?! INT. COBRA KAI DOJO - OFFICE - CONTINUOUS 20   20  Miguel runs inside to find Johnny livid, on the phone. COBRA KAI 107   \"All Valley\"   Pink Pages   11/13/17   14. JOHNNY (ON THE PHONE) You don’t ban ME! I’ll ban YOU! He slams the phone down on the receiver. Several times. MIGUEL What’s going on, Sensei? JOHNNY There’s a lifetime ban on Cobra Kai entering the tournament. MIGUEL What? How is that fair? Johnny slumps into his chair and tosses the foam roller. JOHNNY It’s not. But there’s nothing I can do. MIGUEL What happened to “never accept defeat...” “There is NO no...”? JOHNNY That was girl advice. This is different. This is real life. There are rules. MIGUEL Since when do you care about rules? We don’t take no for an answer. YOU said that. You gotta fight this. Johnny looks at Miguel, realizing he has a point. JOHNNY You know, what? You’re right. I’m gonna go down there and beat their asses. Johnny heads for the door, but Miguel stops him... MIGUEL Whoa, that’s not what I meant. Don’t you think there may be a more... delicate approach, sensei? JOHNNY The way of the fist is not delicate. Cobras are not delicate... COBRA KAI 107   \"All Valley\"   Pink Pages   11/13/17   15. MIGUEL Forget delicate. I’m just",
      "dialogue_count": 0,
      "word_count": 990
    },
    {
      "scene_number": 4,
      "slugline": "INT. JOHNNY’S APARTMENT - EVENING 22   22  TIGHT ON hands tying a tie. REVEAL Johnny wearing his ill- fitting “court” suit. His hair is gelled and combed. He looks like a new(ish) man. He practices a few ways to carry the old leather 80’s briefcase he got to complete his look. Miguel enters, watching Johnny adjust himself in the mirror-- MIGUEL You nervous for your meeting? JOHNNY (fired up) I’m not nervous, I’m pissed off. MIGUEL Ok, but remember, you gotta be nice to these people. So, what are you gonna do if someone pisses you off? JOHNNY I usually just punch the guy. MIGUEL Well that’s not gonna work. How about this-- when you get angry, just make a fist like you’re   going  to punch them... but don’t punch them. JOHNNY Hold it in? (doubtful) I guess I could try. COBRA KAI 107   \"All Valley\"   Pink Pages   11/13/17   17.",
      "characters": [],
      "action_text": "MIGUEL (notices) What’s in the briefcase? Johnny pops it open, revealing it’s completely empty. JOHNNY Nothing. Found it in the dumpster. MIGUEL It’s a nice touch. JOHNNY Thanks. Hey, don’t worry about me, I got this. What about you? You nervous for your date? MIGUEL Well, yeah, a little. Or a lot. JOHNNY There’s nothing to be nervous about. Just relax, be cool, and when the moment’s right, make your move. MIGUEL Move? What move? What’s my move? I don’t have a move. JOHNNY C’mon, man! You gotta kiss the girl! MIGUEL Oh. Well, I mean, obviously I   want  to-- but I don’t technically   have  to, right? JOHNNY That’s true. You can just learn how to braid her hair and talk about all the other boys who had the balls to kiss her on a first date. Miguel realizes Johnny has a point. MIGUEL Shit. What’s my move? What’s my move?! JOHNNY Easy, you’re a Cobra Kai. Strike first. Strike hard.  (MORE)  COBRA KAI 107   \"All Valley\"   Pink Pages   11/13/17   18. You think that’s just for karate? It’s for everything. Miguel is even more stressed now. JOHNNY (CONT’D) Where you taking this girl anyway? MIGUEL The observatory. Picnic on the lawn... Chocolate-tasting three- ways... Then if it’s a clear night, we’ll check out the stars. (beat) She likes astronomy. Johnny stares at him like he’s an alien. JOHNNY The only part of that that made any sense at all was “three-way.” MIGUEL It’ll be fun. JOHNNY Look, if you wanna impress this chick, you need to take her where I took all my babes back in the day. MIGUEL Where’s that? CUT TO: EXT. GOLF N’ STUFF - NIGHT 23   23  Sam and Miguel get out of Sam’s car. SAMANTHA I can’t believe you wanted to go to Golf N’ Stuff. Miguel’s face reads pure panic as everywhere he looks there are FAMILIES with SMALL CHILDREN. MIGUEL We can go somewhere else. SAMANTHA Are you kidding? I love this place! MIGUEL Really? You do?  JOHNNY (CONT'D)  COBRA KAI 107   \"All Valley\"   Pink Pages   11/13/17   19. SAMANTHA Totally. My dad used to bring me here all the time",
      "dialogue_count": 0,
      "word_count": 3422
    }
  ]
}