{
  "slug": "coco-2017",
  "title": "coco",
  "genre": "drama",
  "format": "film",
  "scenes_count": 2,
  "characters_count": 0,
  "characters": [],
  "total_words": 23244,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. MARIGOLD PATH - DUSK A path of marigold petals leads up to an altar lovingly arranged in a humble cemetery.   An old woman lights a candle as the smoke of burning copal wood dances lyrically upward... CARD: DISNEY PRESENTS CARD: A PIXAR ANIMATION STUDIOS FILM The smoke lifts up toward lines of   papel picado   –- cut paper banners -- that sway gently in the breeze. PAPEL PICADO CARD: \"COCO\" MIGUEL (V.O.) Sometimes I think I'm cursed... 'cause of something that happened before I was even born. A story begins to play out on the papel picado. MIGUEL (V.O.) See, a long time ago there was this family. The images on the papel picado come to life to illustrate a father, a mother, and a little girl.   The family is happy. MIGUEL (V.O.) The papá, he was a musician. The papá plays guitar while the mother dances with her daughter. MIGUEL (V.O.) He and his family would sing, and dance, and count their blessings... (beat) But he also had a dream... to play for the world. (beat) And one day he left with his guitar... and never returned. The man walks down a road, guitar slung on his back.   In another vignette his daughter stands in the doorway, watching her papá leave.   Two feet step up next to her.   It is her mamá, hardened. She shuts the door. 1. ©2017 DISNEY•PIXAR - PRIVILEGED AND CONFIDENTIAL",
      "characters": [],
      "action_text": "MIGUEL (V.O.) And the mamá...?   She didn't have time to cry over that walkaway musician! (beat) After banishing all music from her life... The woman gets rid of all of her husband's instruments and records. MIGUEL (V.O.) She found a way to provide for her daughter... (beat) She rolled up her sleeves and she learned to make shoes. (beat) She could have made candy! Amongst the papel picado, a stick swings at a strung up piñata which bursts with candy... MIGUEL (V.O.) Or fireworks! Fireworks go off in the background... MIGUEL (V.O.) Or sparkly underwear for wrestlers! Sparkly underwear and a luchador mask hang on a line amongst other linens... MIGUEL (V.O.) But no... she chose shoes... On the papel picado, the little girl becomes a young woman. MIGUEL (V.O.) Then she taught her daughter to make shoes.   And later, she taught her son-in-law. She introduces a suitor to the family business. MIGUEL (V.O.) Then her grandkids got roped in. As her family grew, so did the business. In the next vignette, a bunch of goofy grandchildren join in the shoemaking.   The shoe shop is full of family! 2. ©2017 DISNEY•PIXAR - PRIVILEGED AND CONFIDENTIAL MIGUEL (V.O.) Music had torn her family apart, but shoes held them all together. (beat) You see, that woman was my great- great grandmother, Mamá Imelda. TILT DOWN from the papel picado to the OFRENDA ROOM - DAY where a photo sits at the top of a beautiful altar.   The photo features MAMÁ IMELDA -- serious, formidable.   She holds a baby on her lap.   Her husband stands beside her, but his face has been torn away. MIGUEL (V.O.) She died WAY before I was born. But my family still tells her story every year on   Día de los Muertos   -- the Day of the Dead... (beat) And her little girl? Fade from the face of the little girl to present day MAMÁ COCO (97), a living raisin, convalescing in a wicker wheelchair. MIGUEL (V.O.) She's my great grandmother, Mamá Coco. A boy (12) walks into frame and kisses her on the cheek. This is our narrator, MIG",
      "dialogue_count": 0,
      "word_count": 1772
    },
    {
      "scene_number": 2,
      "slugline": "EXT. MARIACHI PLAZA - DAY MIGUEL (CONT’D) ...If it wasn't for my family. PLAZA MARIACHI (playful) Ay, ay, ay, muchacho. MIGUEL Huh? PLAZA MARIACHI I asked for a shoe shine, not your life story. Miguel comes out of his reverie and looks up at the PLAZA MARIACHI whose shoes he is shining. MIGUEL Oh, yeah, sorry. He goes back to scrubbing the man's shoe.   As Miguel shines, the mariachi plucks his guitar idly. MIGUEL I just can't really talk about any of this at home so... PLAZA MARIACHI Look, if I were you I'd march right up to my family and say, \"Hey!   I'm a musician.   Deal with it!\" MIGUEL I could never say that... PLAZA MARIACHI You ARE a musician, no? MIGUEL I don't know.   I mean... I only really play for myself-- PLAZA MARIACHI Did de la Cruz become the world's best musician by hiding his sweet, sweet skills?   No!   He walked out onto that plaza and he played out loud! 10. ©2017 DISNEY•PIXAR - PRIVILEGED AND CONFIDENTIAL",
      "characters": [],
      "action_text": "The mariachi gets an idea.   He points to the gazebo where organizers are setting up for a show.   They unfurl a canvas poster which reads \"TALENT SHOW.\" PLAZA MARIACHI (CONT'D) Ah, mira, mira!   They're setting up for tonight.   The music competition for Día de Muertos.   You wanna be like your hero?   You should sign up! MIGUEL Uh-uh, my family would freak! PLAZA MARIACHI Look, if you're too scared, then, well... have fun making shoes. Miguel considers this. PLAZA MARIACHI (CONT'D) C'mon.   What did de la Cruz always say? MIGUEL ...Seize your moment? The mariachi appraises Miguel, then offers his guitar. PLAZA MARIACHI Show me what you got, muchacho. I'll be your first audience. Miguel's brows rise, surprised.   He reaches to take the instrument, regarding it as if holding a holy relic. Miguel spreads his fingers across the strings anticipating his chord and... ABUELITA (O.S.) MIGUEL! Startled, Miguel impulsively throws the guitar back onto the mariachi's lap.   He turns to see Abuelita marching toward him.   Miguel's TÍO BERTO (40s) and PRIMA ROSA (16), follow with supplies from the market. MIGUEL Abuelita! ABUELITA What are you doing here? 11. ©2017 DISNEY•PIXAR - PRIVILEGED AND CONFIDENTIAL MIGUEL Um...uh... Miguel quickly packs away his shine rag and polishes. Abuelita barrels up to the mariachi. She hits his hat with her shoe and waves him away. ABUELITA You leave my grandson alone! PLAZA MARIACHI Doña, please -- I was just getting a shine! ABUELITA I know your tricks, mariachi! (to Miguel) What did he say to you? MIGUEL He was just showing me his guitar... Gasps from the family. TÍO BERTO Shame on you! Abuelita lords over the mariachi, shoe aimed directly between his eyes. ABUELITA My grandson is a sweet little angelito querido cielito -- he wants no part of your music, mariachi!   You keep away from him! The mariachi scrambles away, snatching his hat off the ground before he goes.   Abuelita hugs Miguel protectively to her bosom. ABUELITA Ay, pobrecito!   E",
      "dialogue_count": 0,
      "word_count": 21472
    }
  ]
}