{
  "slug": "colette-2018",
  "title": "colette",
  "genre": "action",
  "format": "film",
  "scenes_count": 17,
  "characters_count": 0,
  "characters": [],
  "total_words": 23613,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT.   BURGUNDIAN   COUNTRYSIDE   -   SUNRISE   -   1892 1   1  The   first   light   is   breaking   over   the   fields   and   hedges   of this   timeless   rural   landscape.   With   the   clanking   of   bells, a   herd   of   cows   makes   its   way   to   the   first   milking. INT.   COLETTE   FAMILY   HOME   -   BEDROOM   -   EARLY   MORNING 2   2  The   room   is   simple   with   a   few   sticks   of   worn   wooden furniture.   A   young   woman   is   asleep   under   the   covers,   with   a cat   curled   up   on   the   bottom   of   the   bed.   This   is GABRIELLE- SIDONIE COLETTE,   or   as   she   will   later   be   known,   simply COLETTE. A   voice   calls   from   down   the   corridor   -   her   mother   SIDO. SIDO   (O.S.) Gabrielle! The   girl   stirs   but   her   eyes   remain   stubbornly   closed. SIDO (O.S.) (CONT’D) Gabrielle!!   Wake   up. COLETTE (murmuring) Let   me   sleep! SIDO Come   on,   Gabrielle!! Sido   is   now   at   the   door   frame.   A   handsome   country   woman, forthright   and   practical   -   nobody’s   fool. COLETTE What   time   is   it? SIDO It’s   8   o’clock.   Willy   is   coming   today. Colette   just   murmurs. SIDO (cont’d)   (CONT’D) Good.   Then   you   won’t   want   your hair   doing. She   disappears.   After   a   moment,   a   head   emerges   from   under the   pillow   and   looks   to   the   empty   doorway.   We   get   our   first look   at   the   milky   skinned,   precocious,   whip-smart,   Colette. EXT.   COUNTRY   TRAIN   STATION   -   DAY 3   3  A train belches steam as it slowly moves toward the station. A MAN IN A TOP HAT leans out of the window.",
      "characters": [],
      "action_text": "OMITTED 4   4  EXT.   TRAIN   CARRIAGE   -   DAY 5   5  Dismounting,   Willy   sees   a   waiting   carriage   across   the   platform. INT.   COLETTE   FAMILY   HOUSE   -   PARLOR 6   6  Wearing   her   best   frock,   Colette   carries   a   large   TEA   SERVICE down   a   corridor   and   into   the   main   room.   Willy   is   seated,   in conversation   with   Sido   and   JULES,   the   patriarch,   an   affable old   soldier,   with   one   leg,   who   is   smoking   a   pipe. JULES And   how   is   Paris   these   days, Willy? WILLY It’s   a   hot   bed!   It’s   “Electric!” Heaving   with   artists,   writers, poets,   all   seeking   to   say something   profound...   most   of   them are   too   young   or   crazed   but   still, they   do   generate   a   certain...   life force! Colette,   her   hair   neatly   plaited,   puts   the   cups   out   for everyone   then   takes   over   the   teapot   and   pours. JULES We   were   going   to   see   a   play   in Paris   -   weren’t   we? SIDO La   Tosca. WILLY I   was   at   the   opening.   I   wouldn’t bother,   quite   frankly.   Sarah   Bernhardt did   her   best,   she   always   does,   but   the piece   is   too   overwrought   in   a particularly   feminine   way... melodramatic   in   extremis!   Tears   on   the stage   but   all   dry   eyes   in   the   house. SIDO Maybe   I’ll   go   and   make   up   my   own   mind. WILLY Well,   just   remember...   if   a   book   bores you,   you   can   throw   it   away.   If   a painting   is   garish,   you   close   your eyes.  (MORE)  COLETTE - FINAL SHOOTING SCRIPT   2. Whereas   bad   theatre   is   like   dentistry; you   are   compelled   to   stay   in   the   chair, having   your   skull   drilled,   until   the entire   grizzly   procedure   is   over.  JULES Good point, Willy. Painful business! COLETTE Though I imagine it must hold a secret source of enjoyment - for the dentist.  Willy   raises   an   appreciative   eyebrow   and   chuc",
      "dialogue_count": 0,
      "word_count": 1497
    },
    {
      "scene_number": 2,
      "slugline": "EXT.   GARDEN   -   AFTERNOON 12   12  At   the   Wedding   Party,   Jules   is   making   a   toast   Colette   and Willy   in   front   of   a   MIXED   CROWD   of   WEDDING   GUESTS. JULES It’s   the   proudest   time   in   a   father’s life,   but   also   -   I   now   find   -   one   of the   saddest.   I   have   to   hand   over   my beloved   daughter,   who   has   lit   up   our lives   for   so   long,   with   her   wit,   her brilliance,   her   beauty.   I   will   miss you,   Gabrielle.   Almost   as   much   as your   mother   will...  A murmur of acknowledgement from the assembled.   Colette smiles at her father, and catches her mother’s eye, holding back emotion. JULES (CONT’D)  But   it   is   no   small   compensation   that   I give   her   to   a   man   of   such   inestimable standing.   There   are   many   celebrities in   Paris   but   few   are   famous   enough   to be   known   by   --   by   a   single   name. WILLY   -   Welcome   to   the   Colette   family. Everyone   cheers.   Colette   turns   to   her   new   husband, glowing. SOME   TIME   LATER   -   EVENING A   COUNTRY   BAND   strikes   up.   COUPLES   polka   around   the garden.  A COUPLE OF PEASANTS carry trays of drinks from a kitchen tent to the GUESTS. Some CHILDREN chase a chicken through the dancers.  WILLY (cont’d) This   is   definitely   a   country   wedding. COLETTE It’ll   make   a   good   story   --   in   Paris. WILLY You’ll be   the   story   in   Paris, Gabrielle.   Just   wait   ‘til   they get   a   look   at   you. Willy   twirls   Colette   round   and   round   and   round...  COLETTE - FINAL SHOOTING SCRIPT   8.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 245
    },
    {
      "scene_number": 3,
      "slugline": "EXT.   CITY   OF   PARIS   -   EVENING   -   1893 13   13  Across   the   river   Seine   -   the   center   of   the demi-monde;   the Left   Bank.   This   is   not   postcard   Paris   -   the   buildings   are sooty   and   chimneys   are   filling   the   sky   with   smoke.   On   the quay,   PEOPLE   go   about   their   business   as   a   YOUNG   ATTENDANT lights   the   gas   lamp. INT.   COLETTE   AND   WILLY’S   APARTMENT   -   BOUDOIR   -   EVENING 14   14  MATILDE,   the   maid,   is   winching   Colette   into   a   very   tight red   froufrou   dress.   A   knock   on   the   door. WILLY   (O.S) Are   you   ready   yet? COLETTE No   -   not   yet. (to   the   maid) What   do   you   think,   Matilde? MATILDE It’s   pretty,   Madame. Colette   looks   at   herself   critically. INT.   BEDROOM/HALLWAY 15   15  Willy   returns   and   prepares   to   knock   again. WILLY   (O.S) We   should   try   to   get   there   before it   ends. COLETTE (O.S.) I’m   coming... The   door   opens.   Colette   is   in   another   dress   -   the   one   from their   meeting   in   Saint-Sauveur.   Matilde   hovers   nervously. COLETTE (CONT’D) Is   the   carriage   waiting? Willy   looks   disappointed   but   together   they   proceed   through SEVERAL   ROOMS   to   the   front   door.   We   get   a   feeling   for   Willy’s apartment   -   a   warren   of   dark   rooms   overcrowded   by   boxes,   papers and   Wagnerian   bric-a-brac.   Willy,   it   seems,   is   a   hoarder. WILLY Where’s   your   new   dress? COLETTE It   looks   ridiculous.   I   couldn’t breathe   in   it.  COLETTE - FINAL SHOOTING SCRIPT   9.",
      "characters": [],
      "action_text": "WILLY That thing cost me two hundred and thirty-seven francs. COLETTE I know. We’ll get it adjusted.  WILLY  (half joking)  More   money!  They exit.  EXT.   ELEGANT   PARISIAN   STREET   –   EARLY   EVENING 16   16  The   carriage   pulls   up.   Colette   is   fiddling   with   a   spot   of tooth   powder   on   her   dress. WILLY What   is   it? COLETTE ...It’s   tooth   paste. WILLY (amused) My   God!   Here...  He rubs a little spit on it. WILLY (CONT’D) That’ll do. Let’s go in...  INT.   MME.   DE   CAILLAVET’S   SALON   –   HALLWAY 17   17  They approach the giant door.  WILLY Ready   for   the   lions...? She   lets   out   a   nervous   exhale.   The   double   doors   glide   open. INT.   MADAME   DE   CAILLAVET’S   SALON   -   MAIN   ROOM 18   18  Willy   and   Colette   proceed   into   a   reception   room   filled   with the   beautiful,   the   sparkling,   and   the   eccentric   of   Paris’ Golden   Age.   The   mirrors   have   been   polished;   so   have   the epigrams.   Amidst   the   gas   lamps,   the   India   rubber   plants, and   the   zebra   skin   rugs,   the   energy   is   bouncing   off   the walls. Willy   acknowledges   hellos   and   nods   to   people   along   the   way. With   her   tight   braids   and   country   dress,   Colette   looks   drab in   this   sea   of   peacocks.  COLETTE - FINAL SHOOTING SCRIPT   10. They   arrive   at   a   circle   of   conversation   --   that   of   MME.   DE CAILLAVET,   the   hostess,   the   debonair   COUNT   MUFFAT,   and   a few SALONITES   and   FRIENDS.  MME. DE CAILLAVET  It’s   monstrous.   I   can’t   look   at it.  COUNT MUFFAT  At   least   it’s   temporary. MME.   DE   CAILLAVET Oh   here’s   Willy   --   Willy!   Eiffel’s Tower,   are   you   for   or   against? WILLY I’m   for   it,   if   a   little   jealous   of   this giant   erection   in   the   heart   of   our capital...   belonging   to   someone   else. Laughter   from   the   circle. MME.   DE   CAILLAVET You   ",
      "dialogue_count": 0,
      "word_count": 3261
    },
    {
      "scene_number": 4,
      "slugline": "INT.   COLETTE   FAMILY   HOUSE   -   PARLOR   –   DAY 46   46  Colette   is   stretched   out   on   a   sofa,   reading   a   book, absently   stroking   a   cat   in   her   lap.   A   loud   clock   is ticking.   Sido   appears   at   the   doorway. SIDO You   must   eat   something. COLETTE I’m   not   hungry. SIDO You’re   always   hungry. Gabrielle...   you’re   not..? { pregnant } COLETTE No.   I’ll   eat   later. Sido   turns   to   leave   but   looks   back   at   Colette. SIDO Come   outside.   Help   me   with   the   tomatoes. EXT.   SIDO’S   KITCHEN   GARDEN   -   DAY 47   47  Colette   and   Sido   are   kneeling   together   in   the   soil.   They tie   some   young   tomato   plants.   An   ANT   crawls   up   one   of   the stems.  SIDO Agh - ants. There must be honeydew... COLETTE (feels the leaf) Yes.. it’s sticky. SIDO The white flies have probably got to it. They’ll have sucked all the juice. COLETTE We need some ladybirds? SIDO Or a spider. There’s a big one that’s dangling in my room. I’ll catch her and put her to work out here. Colette stops, looks at Sido.  COLETTE - FINAL SHOOTING SCRIPT   25.",
      "characters": [],
      "action_text": "COLETTE Did you ever feel like you were playing a part, Sido? SIDO In what way? COLETTE As a wife... or a mother... That you were just going through the motions? Sido thinks. Inspects the other leaves. SIDO Sometimes as a wife.. Never as a mother. Why? Colette shakes her head, perturbed. SIDO (CONT’D) Is he good to you Gabri..? (Colette’s eyes tear up) What is it, my love? Colette finally opens up... COLETTE Nothing’s how I imagined it. SIDO Come here... Colette falls into her mother. SIDO (CONT’D) My darling kitten. No one can take away what you are - no one. You’re too strong for that. Always have been. Trust no one but yourself. COLETTE I know. SIDO What’s he done to upset you? COLETTE Nothing... Nothing. (she pulls away) It’s all - just - new... That’s all.   I must get used to marriage. Sido nods, looks at her daughter who looks away.  COLETTE - FINAL SHOOTING SCRIPT   26. SIDO Better to make marriage get used to you.  EXT.   SAINT SAUVEUR -   RIVER   BANK   -   DAY 48   48  Willy   and   Colette   walk   along   the   dappled   banks   of   the   green slow   river.   She   is   distant.   He   is   persistent. WILLY Are   you   happy   to   be   here? COLETTE Yes.   It   makes   the   city   seem   even more   foul...  WILLY Well, you are a country girl... She rolls her eyes.  WILLY   (CONT’D) Did   you   miss   me? COLETTE (lies) No,   not   really. WILLY Life   has   been...awful   without   you. Just   dead.  His tone grows more emotional. She holds firm. WILLY (CONT’D)  I   don’t   feel   like   myself   at   all. Everything   seems...utterly pointless.   I   can’t   even   write anymore... You   mean   more   to   me   than   all   the women   of   Paris   put   together. COLETTE Have   you   sampled   them   all? WILLY Please   don’t   mock   me. COLETTE You’re   happy   to   mock   everybody else... WILLY It’s   true.   It’s   all horseshit...   Words are   deceptive   little   bastards...  (MORE)  COLETTE - FINAL SHOOTING SCRIPT   27. but   if   you  ",
      "dialogue_count": 0,
      "word_count": 3771
    },
    {
      "scene_number": 5,
      "slugline": "INT.   COLETTE   FAMILY   HOUSE   -   KITCHEN   -   DAY 76   76  Jules   watches,   as   Sido   opens   a   package   revealing   the   book. JULES Look   at   that! SIDO (critically) Yes,   look   at   it... INT.   SALON   –   DAY 77   77  Rachilde   continues   reading   her   rave   review   -   to   Willy. RACHILDE “It   took   an   extraordinary   man   to define   this   modern   young   woman. Willy,   your   book   will   change   the world..\" (she   raises   a   glass) To   Claudine! SALON-GOERS To   Claudine! Schwob   and   Colette   watch   from   a   corner. SCHWOB All   Paris   is   saying   your   husband is   a   genius. COLETTE And   what   do   you   say? SCHWOB He   is,   if   that   book   is   anything   to   go   by. Colette   smiles,   indicates   Willy   with   her   eyes. COLETTE Look   at   him.   I   haven’t   seen   him   as happy   for   a   long   time. In   the   center   of   the   room   Willy   is   up   on   some   FRIENDS shoulders,   uncorking   champagne.   Colette   gives   Schwob   a tight   lipped   smile.   Something   is   rankling   her   but   she   won’t confess   it   -   yet!   MUSIC   ENDS. INT.   PUBLISHING   HOUSE   -   OFFICE   -   DAY 78   78  Willy   and   OLLENDORFF,   the   publisher,   are   finishing   up   a meeting   in   OLLENDORFF’S   double   high   book-lined   office.  COLETTE - FINAL SHOOTING SCRIPT   45.",
      "characters": [],
      "action_text": "OLLENDORFF  Well, we’ve never had one fly off the shelves like this before. Quite a phenomenon. Everyone’s talking about it. And you know who’s buying it?   Young women! WILLY Really, I thought...that’s interesting. OLLENDORFF  We’ve   also   been   having   enquiries   about theatrical   rights.   Any   thoughts? WILLY Of   course,   the   theatre   is   the   next   logical step!   With   as   large   a   stage   as   possible!  OLLENDORFF  It’s   the   theatre-going   public which   will   make   you   rich,   Willy.  WILLY Make us all rich, my dear Ollendorff. They laugh as they leave the room.  EXT.   PUBLISHING   HOUSE 79   79  Colette   is   waiting   by   a   carriage   outside.   She   sees   Willy and   Ollendorff   coming   down   the   stairs,   talking   business, but   can’t   quite   make   out   what   they   are   saying.  WILLY So what size are you thinking of..? OLLENDORFF Perhaps - 20,000 units or 25,000 somewhere in that ballpark.   I’m waiting to see what the pre-orders are like back from the sellers. WILLY And what kind of return would that yield? OLLENDORFF Well, we’re calculating about 3 francs a unit profit - so, yes - it’s a tidy sum.  The   men   push   through   the   double   doors   and   are   now   fully audible.  COLETTE - FINAL SHOOTING SCRIPT   46. OLLENDORFF   (CONT’D) Mme.   Willy,   a   great   honor. COLETTE A   pleasure   to   meet   you. WILLY Listen!   Claudine   At   School   is heading   for   her   third   printing. COLETTE Excellent. OLLENDORFF I   believe   that   Willy   based “Claudine”   in   part   on   your   school days? COLETTE Yes,   I   believe   I   had   a   little something   to   contribute. Ollendorff   chuckles.   Willy’s   smile   is   stretched   thin. OLLENDORFF Well,   I’m   very   glad   your   experiences have   borne   such   wonderful   fruit.   Very nice   to   meet   you,   Madame. EXT.   PUBLISHERS   -   DAY 80   80  Willy   climbs   in   next   to   Colette. WILLY Gare de   Lyon. COLETTE Wher",
      "dialogue_count": 0,
      "word_count": 1728
    },
    {
      "scene_number": 6,
      "slugline": "EXT. BOIS DE BOULOGNE - DAY 92   92  A   beautiful   day,   PARISIANS   are   promenading   and   riding bicycles   and   velocipedes   in   the   open   air.   Colette   and   Willy are   pedaling   a   tandem.   She’s   at   the   front,   putting   in   most   of the   leg   work,   he,   true   to   form,   is   taking   it   easy   at   the back.  Under the trees, a cafe has been set up with delicate folding chairs and small round tables. A few dozen SOCIETY TYPES are enjoying tea and cakes. Depositing their tandem by a tree. Colette and Willy approach. There is a feeling that all eyes are on them. Walking through the tables they go past a beautiful red-headed heiress, named GEORGIE Raoul Duval.   She is taking tea with her companion, a pretty young girl named LILY. LILY (whispering) Colette and Willy are here! GEORGIE So they are. Don’t stare. Across the patio, Colette and Willy are seated by a WAITER. Georgie takes out a small card and scribbles a note. GEORGIE (CONT’D) Go take this to them. MOMENTS LATER Post-exercise the couple are eating cake. COLETTE Mmmm. It’s good. WILLY Indeed. He looks round. WILLY (CONT’D) How many people here do you think are reading Claudine in Paris - right now? COLETTE I don’t know.  COLETTE - FINAL SHOOTING SCRIPT   55.",
      "characters": [],
      "action_text": "WILLY At least three quarters, I’d say. And those who haven’t yet will soon catch up. He notices Lily weaving through the tables towards them. WILLY (CONT’D) (to himself) What comes this way? LILY M. Willy, Mme. Colette, I have a note for you....from Mrs. Raoul Duval. Clearly a little starstruck, she hands Willy the note and he surveys it. WILLY (remembering) Mrs. Raoul Duval.   Georgie   Raoul Duval? LILY Yes. WILLY Oh... wonderful!.. Please go tell your mistress we accept her invitation and look forward to her delightful company. LILY (thrilled) I will! And off she goes. COLETTE Who is she? WILLY (under his breath) ...An American - a wayward debutante from Louisiana.. she married a munitions magnate three times her age. COLETTE They sound a bit dull. WILLY He is. She is anything but. (glances at her) We don’t have to...  COLETTE - FINAL SHOOTING SCRIPT   56. COLETTE No. Let’s go... INT. CAFE NOIR - EVENING 93   93 In the high ceilinged cafe, we follow a WAITER who drops a bill off at a table where   Georgie   and   Colette   are   in   fits   of hysterics   -   the   kind   of   laughter   sustained   by   the   seriously drunk   and   flirtatious.   Willy   is   providing   the   after-dinner entertainment.   Lily   sits   by   them,   awed   at   getting   to   spend time   with   such   celebrities,   autograph   book   at   the   ready.  GEORGIE (almost crying with laughter) That’s so funny. Did he really say that? COLETTE Oh yes - he would. He is such a colossal snob. WILLY Then Mme de Caillavet happened to mention that he was only a baron and not a Marquise.   “Allow me, he said   “I am also Duke of Anjou, Bishop of Coutances, Prince of Joinville, of Asturias, of Orléans and the Dunes. But all that isn't of the slightest importance... (with perfect timing) ...here.”  Everyone   howls   with   laughter.   A   stray   curl   of   her   hair falls   down   over   Georgie’s   face. COLETTE Wait   a   moment. Colette   takes   the   lock   and   tries   to   pat ",
      "dialogue_count": 0,
      "word_count": 870
    },
    {
      "scene_number": 7,
      "slugline": "INT.   GEORGIE’S   BUILDING   -   STAIRCASE   -   NIGHT 94   94  Colette slowly ascends the dark staircase. Hiding her nervousness and her excitement. She knocks on the door. After a moment’s waiting Georgie answers. GEORGIE Come in.  INT.   GEORGIE’S   APARTMENT   -   NIGHT 95   95  Georgie’s apartment, naturally, is very stylish. COLETTE What a nice place.  GEORGIE Thank   you.   This   is   my   little pied-a-tere. Frederick   is   not   so   keen   on   the   Art   Nouveau pieces.   But   I   love nature...and   women. Colette   looks   at   a   painting   of   nymphs   bathing.  COLETTE I can see that.  GEORGIE I   remember   in   Claudine   At   School   when   the girls   go   swimming   together   at   night... COLETTE Night   is   the   best   time   to   swim. GEORGIE When   I   was   a   girl,   I   was   told   all the   lakes   in   Louisiana   have alligators.   So   I   never   went   for   a midnight   swim   but   I   regret   it... Georgie   looks   down   then   raises   her   eyes   towards   Colette. COLETTE When   you   raise   your   eyelids,   it’s   as if   you   were   taking   off   all   my   clothes. Georgie   looks   down,   blushing. COLETTE   (CONT’D) Don’t   look   away.   Look   at   me.   Look at   me   looking   at   you. She   does.   It’s   electric.   Colette   slowly   moves   in   and kisses   her   for   a   long   hot   moment.  COLETTE - FINAL SHOOTING SCRIPT   60.",
      "characters": [],
      "action_text": "GEORGIE You   have   the   most   beautiful   teeth. She   indicates   Colette’s   slightly   angled   front   canine. COLETTE Like   an   alligator. They   smile   and   kiss   again. INT.   COLETTE   AND   WILLY’S   APARTMENT   -   MORNING 96   96  Willy is perusing the morning mail. He hears the sound of Colette entering and, affecting nonchalance, carries on reading. Colette enters, also acting cool. WILLY My dear... COLETTE Have you fed Toby Chien? WILLY I forgot. I thought Matilde does it. She heads down the hallway towards the kitchen. He stops her with a question. WILLY (CONT’D) How was last night? COLETTE It was..interesting. WILLY What happened? COLETTE What do you think happened? WILLY Ah... well don’t tell me. I’ll wait to read about it. When Claudine develops tender feelings towards a lady friend. Colette rolls her eyes. COLETTE I won’t be writing it down. WILLY But you must... It’s prime material!  COLETTE - FINAL SHOOTING SCRIPT   61. COLETTE No! She heads out. WILLY Will you see her again? COLETTE (calling out) Probably. Willy is somewhat unsettled by his wife’s casualness and... independence. INT.   GEORGIE’S APARTMENT - DAY 97   97 As Georgie is finishing up her morning toilet, there’s the ring of a doorbell. GEORGIE (murmurs) One moment, my darling. She hastily wraps herself in a gown and makes her way through the apartment. As she opens the door she is taken a back to see the bald pate of Monsieur Willy. GEORGIE (CONT’D) Oh. WILLY Wonderful, you’re here.. I was just passing by... GEORGIE Yes... He continues to stare at her. She flushes slightly. WILLY Well - GEORGIE You’d better come in. INT.   COLETTE AND WILLY’S APARTMENT - ENTRANCE ROOM - 97a   97a LATE AFTERNOON Colette is working away in her small room. The front door goes and Willy comes in.  COLETTE - FINAL SHOOTING SCRIPT   62. WILLY How’s the writing going? COLETTE Slow...painful... How was your meeting with the bank? WILLY Good... yes, it was good.   I won’t bore you with the details. H",
      "dialogue_count": 0,
      "word_count": 700
    },
    {
      "scene_number": 8,
      "slugline": "INT. GEORGIE’S APARTMENT - NIGHT 103a   103a Colette and Georgie;s passion continues to heat up... INT. GEORGIE’S APARTMENT - AFTERNOON 103b   103b Georgie and Willy come to climax.  EXT.   GEORGIE’S   STREET   -   AFTERNOON 104   104  Colette   walks   down   the   street   looks   up   at   the   apartment. Someone   who   looks   suspiciously   like   Willy   is   at   the   window. INT.   GEORGIE’S   BUILDING   -   STAIRCASE   -   AFTERNOON 105   105  Colette   marches   up   the   stairs,   rings   the   bell. COLETTE Georgie!   I   know   you’re   in   there. Still   no   answer.   Colette   knocks   hard   on   the   door. COLETTE   (CONT’D) Georgie.   Open   up! More   loud   knocks.   Eventually   Georgie   answers   in   a nightgown. GEORGIE Colette,   I   was   taking   a   nap. Colette   pushes   past   her. COLETTE Who’s   been   in   here? GEORGIE No   one.   What   are   you   doing? Colette   looks   to   the   bedroom   where   tell-tale   cigar   smoke hangs   in   layers. INT.   COUNTRY   HOUSE   -   STUDY   -   DAY 106   106  Colette   is   writing   at   her   desk. COLETTE   (V.O.) Blue   cigar   smoke   feted   the   air...  (she pauses, crosses out, then continues)  I   marched   in   and   looked   straight   in   the face   of   the   Renaud.   He   recoiled,   saying, “It   was   wicked   of   me.   I’m   sorry.”  COLETTE - FINAL SHOOTING SCRIPT   64.",
      "characters": [],
      "action_text": "Colette   looks   at   the   statue   of   Willy   on   her   desk, wistfully. COLETTE   (V.O.) Rezi   was   there,   of   course   she   was there   -   covering   herself   up... INT.   COUNTRY   HOUSE   -   STUDY   -   NIGHT 107   107  Colette   and   Willy’s   voices   merge   as   the   story   transfers over. WILLY ...I   shall   always   remember   her   lily white   face   decomposing,   as   if   it   were dying   right   under   my   gaze. Once   again   at   the   desk   under   the   circle   of   light,   Willy   is reading   aloud   from   the   notebooks,   giving   his   customary polish   to   the   latest   Claudine.   Colette   sits   quietly   by   as this   chapter   of   their   own   lives   is   read.   But   she   has   more confidence   now   -   more   poise.   She   is   growing   into   herself. He   sets   the   book   down.   A   moment’s   thought. WILLY (CONT’D) It’s   good. COLETTE I   know. WILLY I’d   suggest   you   change   the   line   when Renaud   says,   “It   was   wicked   of   me   to do   it.”   But   I   know   that   you   won’t. COLETTE (piqued) What   do   you   think   Renaud   would say,   in   those   circumstances? WILLY Hmmm...something   like,   “Why...we were   waiting   for   you,   my   dear.” COLETTE I   don’t   think   she   would   believe   him. WILLY Of   course   not. This   is   a   sore   point.  COLETTE - FINAL SHOOTING SCRIPT   65. WILLY (CONT’D) But   don’t   you   think   she’s   being hypocritical   -   I   mean,   it’s   acceptable for   Claudine   to   sleep   with Rezi   but she   doesn’t   want   Renaud   to   do   the same? COLETTE Not   behind   her   back,   no.   The   betrayal came   when   Renaud   lied   to   her.   Renaud who   swore   he   would   always   be   honest. WILLY Perhaps   he   wanted   to   tell   her,   but   he was   frightened   of   her   terrible jealousy? COLETTE Then   he   was   a   coward   as   well   as   a liar. WILLY You’re   very   harsh   on   him. COLETT",
      "dialogue_count": 0,
      "word_count": 772
    },
    {
      "scene_number": 9,
      "slugline": "INT.   GEORGIE’S   APARTMENT   -   DAY 110   110  Georgie   pours   a   glass   of   brandy   for   Colette.   She   is   clearly wound   up   but   trying   to   remain   civilized. GEORGIE My   husband   -   he’s   just...pure   rage.   He was   going   to   challenge   Willy   to   a duel... COLETTE What? GEORGIE I’ve   put   him   off.   Hopefully   it won’t   come   to   that. (she   looks   at   Colette) You’ve   read   it,   yes? COLETTE I   have. GEORGIE How   worried   should   I   be? Georgie   walks   across   to   her   with   the   drink. COLETTE The   names   have   all   been   changed. It’s   not   blatantly   obvious   who   is who... GEORGIE I   don’t   believe   you.   Everyone   is chattering   about   it   -   saying   it will   be   salacious   in   the   extreme. (She   clears   her   throat) I   know   you   have   no   time   for   me   since   our separation   and   I   know   I   behaved   badly. But   I’m   begging   you...   Ask   Willy   to change   it   -   before   publication? Colette   slowly   shakes   her   head. GEORGIE (CONT’D) Please   Colette...   One   woman   to another?   Please... COLETTE No,   I   can’t. GEORGIE You’d   let   me   suffer?  COLETTE - FINAL SHOOTING SCRIPT   68.",
      "characters": [],
      "action_text": "COLETTE It’s   not   just   Willy,   Georgie, it’s...   the   book   itself...Willy thinks   it’s   a   work   of   art. Georgie   downs   her   drink   and   switches   gears   -   no   more   tears, a   hardness   comes   to   her   eyes. GEORGIE You   had   your   chance   to   be   decent.   So, it   will   be   left   to   my   husband   to   settle it. Ollendorff   has   agreed   to   a   lump   sum   for the   destruction   of   the   entire   print run. COLETTE What?   You   can’t   do   that. GEORGIE He   has   already   accepted. COLETTE The   sly   bastard.   You   can’t.   You   just can’t. GEORGIE We   have.   And   that   is   how   it   is. Colette   finally   snaps. COLETTE You   are   a   duplicitous   bitch. GEORGIE I   had   a   good   teacher. Colette   leaves   slamming   the   door.   Georgie   looks   after   her.  EXT. GEORGIE’S APARTMENT - DAY 111   111 Colette leaves the house in a rage.  EXT.   PRINTER’S   COURTYARD   -   DAY 112   112  A   WORKER   pours   petrol   on   a   bonfire   of   novels   then   throws his   cigarette   butt   on   it   to   ignite   the   pile.   It   bursts   into flame   immediately.   Charred   pages   rise   with   the   heat.   The worker   takes   another   crate   and   dumps   them   on.  COLETTE - FINAL SHOOTING SCRIPT   69.",
      "dialogue_count": 0,
      "word_count": 362
    },
    {
      "scene_number": 10,
      "slugline": "INT.   LA MASCOTTE   -   EVENING 113   113  Colette   and   Willy   are   with   Schwob   in   their   favorite   dining spot   feasting   on   oysters   and   champagne.   There   is   an unexpected   air   of   celebration. WILLY Like   a   true   French   heroine,   our daughter   was   burnt   at   the   stake.  COLETTE I said it would be a “hot book.” WILLY The thing is though,   Ollendorff   signed the   deal   but   unfortunately   failed   to mention... (drum   rolls   the   table...) That   he   didn’t   own   the   copyright.   I do. SCHWOB Unbelievable! WILLY All   I   had   to   do   was   trot   round   to another   publisher   and   collect   a   second advance.   The   presses   are   hard   at   it   as we   speak. SCHWOB How   do   you   two   do   it? COLETTE I   think   we   got   very   lucky... WILLY Not   at   all!   That   American   tart and   her   senile   lackey   didn’t   stand a   chance.   We   are   with   the   times! The   wind   is   under   our   wings!   And   I have   a   little   plan   that   will   make Claudine   the   most   popular   girl   in France,   if   not   the   entire   world.  SCHWOB With the play? WILLY Not just that. We’ll have Claudine perfume, Claudine lingerie, Claudine soap.  COLETTE - FINAL SHOOTING SCRIPT   70.",
      "characters": [],
      "action_text": "COLETTE She   will   literally   be   a   household   name . They   all   laugh. INT.   THEATRE   –   DAY   -   1903 114   114  On   a   blackboard,   in   chalk   is   written   “CLAUDINE   AUDITIONS.”  An   insipid   actress   is   cooing   her   way   though   the   dialogue. INSIPID   ACTRESS My   name   is   Claudine.   I   live   in Montigny.   I   was   born   there   in 1881.   I   shall   probably   not   die there... Colette   and   Willy   are   sitting   in   the   tenth   row   of   the   theatre. In   front   of   them   are   the   DIRECTOR   and   two   FINANCIERS. Colette,   now   in   her   late   twenties,   seems   to   have   grown comfortable   in   her   skin.   Willy,   on   the   other   hand,   is   showing the   tell-tale   signs   of   a   life   too-well   lived. WILLY She’s   not   bad. COLETTE She’s   terrible. INSIPID   ACTRESS Montigny   is   a   village,   not   a   town: its   streets,   thank   heaven,   are   not paved;   the   showers   roll   down   them in   little   torrents   that   dry   up   in a   couple   hours;   it   is   a   village, not   even   a   very   pretty   village, but,   all   the   same,   I   adore   it. WILLY (to   Colette) Yes,   you’re   right.  (shouts)  Thank   you   very   much.   Next. A   SECOND   ACTRESS   comes   up   on   stage   and   starts   repeating   the line.   Colette   notices   the   impressive   hourglass   silhouette of   a   woman   in   the   rear   doorway. The   woman   marches   down   the   aisle   and   plants   herself   in front   of   them.   Wearing   a   schoolgirl   smock,   she   is   vibrant, Algerian,   with   bobbed   hair   and   a   tiny   waist.   This   is POLAIRE.  COLETTE - FINAL SHOOTING SCRIPT   71. POLAIRE M.   Willy.   I   am   the   real   Claudine! Colette   and   Willy   exchange   an   intrigued   look. WILLY And   you   are? POLAIRE Me?   My   name is...Polaire! INT.   COLETTE   AND   WILLY’S   APARTMENT   -   LIVING   ROOM   -   DAY 115   115  Colett",
      "dialogue_count": 0,
      "word_count": 926
    },
    {
      "scene_number": 11,
      "slugline": "EXT.   THEATER   -   NIGHT 118   118  A   poster   announces   “CLAUDINE   IN   PARIS   –   TONIGHT”   as   CROWDS make   their   way   in. INT.   THEATER   -   NIGHT 119   119  Starting   on   the   back   of   Colette’s   head,   now   looking   super- chic   with   the   new   haircut,   we   follow   Colette   and   Willy   as they   take   their   seats   in   a   private   box   for   the   opening night   of   \"Claudine.\"   Next   to   them   are   SALONITE   and   her husband.  SALONITE  Colette,   you   look   ravishing. She   smiles. The   house   lights   dim,   the   ORCHESTRA   strikes   up   and   the curtain   goes   up. Polaire makes   an   exuberant   entrance. POLAIRE My   name   is   Claudine.   I   live   in   Montigny... Colette’s   eyes   shine   as   her   heroine   becomes   flesh. POLAIRE (CONT’D) ...I   was   born   there   in   1881.   I shall   probably   not   die   there. Montigny   is   a   village,   not   a   town: its   streets,   thank   heaven,   are   not paved;   the   showers   roll   down   them in   little   torrents   that   dry   up   in a   couple   hours;   it   is   a   village, not   even   a   very   pretty   village, but,   all   the   same,   I   adore   it. INT.   LA MASCOTTE   RESTAURANT/SALON   -   LATER 120   120  An   air   of   celebration   -   champagne   and   music.   At   the   far   end of   the   room   is   Willy,   sitting   on   a   throne,   holding   court with   Colette   and   Schwob   by   him. WILLY I   thought   of   all   my   novels,   this   was the   one   that   would   translate   to theatre. MME.   DE   CAILLAVET I   have   to   give   it   to   you,   Willy. It’s   going   to   be   a   huge   success   - enjoy   your   moment   of   triumph.  COLETTE - FINAL SHOOTING SCRIPT   75.",
      "characters": [],
      "action_text": "VEBER Now   that   you   are   such   a   celebrity, you’ll   become   more   insufferable   than ever. WILLY That’s   the   plan,   Veber!   That’s   the   plan!  Willy continues to hold forth. Someone who appears to be a dapper gentleman dressed as Napoleon approaches Colette. This, we will find out momentarily, is a woman called MISSY.  SCHWOB  Can you believe this crowd? Everyone’s here!   Look there’s the Marquise de Belbeuf... or Missy, as she’s known.  COLETTE A   woman? SCHWOB Descended   from   Empress   Josephine on   one   side,   the   Tsar   of   Russia   on the   other   -   She   only   shows   up   for very   special   occasions.  COLETTE Fascinating.  The   moment   is   interrupted   by   a   hubbub.   Colette   looks   around the   corner   where Polaire is   making   her   entrance   carried aloft   on   a   litter   by   FOUR   MUSCULAR   GUYS.   She   is   showered with   praise   and   flowers. WILLY Polaire!   Over   here! POLAIRE Monsieur   Willy! She   is   deposited   before... POLAIRE   (CONT’D) How   was   it? WILLY Brilliant,   my   dear!   You   were perfection! POLAIRE Thank   you,   M.   Willy!   Colette?  COLETTE - FINAL SHOOTING SCRIPT   76. She   looks   to   Colette   who   raises   her   glass. COLETTE You   are   her.   The   living   Claudine. Polaire is   so   excited   she   physically   vibrates. WILLY Polaire,   alight   upon   my   knee... He   pats   his   knee   and   she   sits. WILLY (CONT’D) And   you   Tetette! He   grabs   her   by   the   hand. COLETTE Willy! WILLY Come   here! She   acquiesces   and   lands   on   his   other   knee.   Willy   is   now framed   by   two   “Claudines”   with   perfect   bobbed   hair.   He waves   to   a   photographer. WILLY (CONT’D) Here   we   have   the   Claudine   Trinity. The   father... (he   indicates   himself) The   mother... (he   indicates   Colette) And   the   daughter... (Polaire) PHOTOGRAPHER Hold   still! A   magnesium   flash   goes   off,   freezing   the   pic",
      "dialogue_count": 0,
      "word_count": 806
    },
    {
      "scene_number": 12,
      "slugline": "EXT. BOIS DE BOULOGNE - DAY 127c   127c A YOUNG BUSINESSMAN reads a paper that says CLAUDINE SENSATION while a YOUNG WOMAN reads a magazine that says LE SECRET DE CLAUDINE. EXT. STREET 127d   127d Children eat CLAUDINE CANDIES.  INT.   BOUDOIR   -   DAY 128   128  A YOUNG WOMAN dresses in CLAUDINE LINGERIE. INT. BEDROOM - DAY 128a   128a A young DANDY slicks his hair with CLAUDINE HAIR OIL. INT. BATHROOM 128b   128b A WOMAN reaches out to pick up a bar of CLAUDINE SOAP. EXT. COURTYARD 129   129 A BUNDLE OF NEWSPAPERS lands with the headline “EPOCH DE CLAUDINE.” INT. BEDROOM 129a   129a TWO YOUNG GIRLS play with CLAUDINE DOLLS. EXT. BOIS DE BOULOGNE - DAY 129b   129b A group of YOUNG LADS trade CLAUDINE postcards.  INT.   LA MASCOTTE/SALON   -   DINING   ROOM   -   NIGHT 130   130  ...The   assembled   (including   Veber,   Schwob, Polaire)   bang rhythmically   on   the   table   with   glasses,   cutlery,   and   fists as   Willy   stands   at   the   head   of   a   large   table   improvising   a poem.   Missy   sits   far   down   the   table   near   Colette’s   end with   a   SUFFRAGETTE   FRIEND. WILLY Claudine,   she   is   a   Midas   Minx. Her   smile   mysterious   as   a   sphinx. She   walks   and   talks,   she   laughs   -   she   thinks! Claudine,   Claudine,   Claudine... He   starts   to   move   to   the   rhythm,   swaying   from   side   to   side. WILLY (CONT’D) Claudine’s   a   girl   that   knows   no   bounds. A   fox   that’s   never   caught   by   hounds.  (MORE)  COLETTE - FINAL SHOOTING SCRIPT   79.",
      "characters": [],
      "action_text": "Exploding   star   that   makes   no sound!   Claudine,   Claudine, Claudine! Willy   beckons   a   few   YOUNG   WOMEN   up   from   the   table   and   they link   arms   forming   an   impromptu   can-can   line.   The   rhythm speeds   up   and   intensifies... WILLY   (CONT’D) Who   is   this   girl   in   my   heart? (ALL:   CLAUDINE!) Who   has   been   there   from   the   start? (ALL:   CLAUDINE!) And   who   is   a   bit   of   a   tart? (ALL:   CLAUDINE) CLAUDINE!   CLAUDINE!   CLAUDINE! The   merriment   in   the   room   is   sky   high. WILLY (CONT’D) Who   is   the   one   I   admire? (ALL:   CLAUDINE) Who   is   the   queen   of   desire? (ALL:   CLAUDINE) And   who   has   set   Paris   on   fire? (ALL:   CLAUDINE) CLAUDINE!   CLAUDINE!   CLAUDINE!  The Marquise scribbles something on a card and passes it to Colette via her friend and then Wague. Colette looks at the card.   It has the family coat of arms and says, “Let’s meet.” WILLY (CONT’D) Who’s wearing a school girl’s smock? (CLAUDINE) Who’s causing a hell of a shock? (CLAUDINE) Who working it all round the clock? (CLAUDINE) CLAUDINE!   CLAUDINE! CLAUDINE!  He   raises   his   hand,   slightly   out   of   breath,   to   quiet   the banging,   for   a   more   personal   last   verse   that   he   delivers straight   to   Colette. WILLY (CONT’D) And   in   a   dream,   I   find   myself, Next   to   Claudine, And   her   magical   eyes, Forgetting   all   other   music For   the   laughter   of   her   voice... He   raises   his   glass.   Everyone   follows.  WILLY (CONT’D)  COLETTE - FINAL SHOOTING SCRIPT   80. WILLY (CONT’D) To   Claudine! ALL CLAUDINE!! Colette   and   Willy’s   eyes   connect,   sharing   a   moment   of   triumph. INT.   COLETTE   AND   WILLY’S   APARTMENT   -   BEDROOM   -   NIGHT 131   131  Colette   and   Willy   enter   laughing,   giddy   with   champagne,   and turn   on   the   light.   The   apartment   has   been   considerably UPGRADED COLETTE I’m   exhausted. W",
      "dialogue_count": 0,
      "word_count": 2851
    },
    {
      "scene_number": 13,
      "slugline": "INT.   BALLET   STUDIO   -   DAY   -   1906 149   149  The   ivories   of   a   piano   are   being   hammered.   A   BOHEMIAN PIANIST   is   playing   a   rhythmic   Oriental   piece. Light   bounces   around   the   studio,   with   its   polished   floors and   huge   mirrors.   Four   YOUNG   DANCERS   in   leotards   crawl   on all   fours.   WAGUE,   the   renowned   mime,   is   teaching   a   class. The   door   opens.   Colette   enters.   Watches   the   class   in action.   Wague   notices   her   presence,   nods   curtly,   and continues.   Colette   starts   to   take   off   her   outer   clothes, she   wears   a   leotard   underneath. HALF   AN   HOUR   LATER   The   dancers   gather   their   things.   Colette enters   now   changed   into   a   leotard   with   her   clothes   in   a bag.  WAGUE Ready? COLETTE Yes. WAGUE Let’s get to work.  A   short   montage   as   Wague   demonstrates   various   motions   that Colette   diligently   copies. INT.   COLETTE   AND   WILLY’S   APARTMENT   -   LIVING   ROOM   -   DAY 150   150  Willy   is   reading   a   newspaper.   Colette   is   in   front   of   a   mirror, with   a   sheet   of   chiffon   draped   around   her,   practicing  movement .   Matilde   is   on   her   knees   cleaning   the   hearth. WILLY Are   you   going   to   write   today? COLETTE No.   I’m   rehearsing   with   Wague   later. WILLY Don’t   you   think   you   ought   to? What   are   your   priorities? (he   looks   at   her, frustrated) I   should   start   locking   you   up   again. COLETTE I   would   scream   the   house   down. She   carries   on   with   the   exercises,   self-absorbed.  COLETTE - FINAL SHOOTING SCRIPT   94.",
      "characters": [],
      "action_text": "WILLY It’s   a   charming   hobby, Tetette but...   You   are   not   Sarah Bernhardt.   And   if   you   can’t   pull it   off   as   high   art   you’ll   be   doing the   bloody   music   halls,   for   god’s sake.   And   that   would   be scandalous. COLETTE And   when   have   you   ever   considered scandal   a   bad   thing? WILLY True...What   does   Missy   say? COLETTE He’s   all   for   it.   He   comes   along   to Wague’s   studio   with   me   all   the   time. WILLY How   depressing.   Does   she   have   no life   of   her   own   whatsoever? COLETTE Missy   does   the   movements   with   me. He’s   rather   good. Willy   nods   -   he’s   having   one   of   his   famous   ‘big   ideas.’ COLETTE   (CONT’D) Wague   thinks   I   could   be   a   ready for   the   stage   in   a   few   weeks.   What do   you   think,   Matilde? MATILDE I   have   to   agree   with   M.   Willy, Ma’am.   It’s   not   very   lady-like. COLETTE I   thought   you   were   on   my   side!  MATILDE Suit yourself.  WILLY So   you   and   the   Marquise   run   around   the studio   as   potty   mimetic   lovers   do   you? (Colette   nods) And   Missy   shares   your   ambition   to go   on   the   stage? COLETTE Oh   no,   he’s   far   too   shy.  COLETTE - FINAL SHOOTING SCRIPT   95.",
      "dialogue_count": 0,
      "word_count": 418
    },
    {
      "scene_number": 14,
      "slugline": "INT.   RESTAURANT   -   DAY 151   151  Willy   is   pitching   a   THEATRE   MANAGER   after   a   heavy   lunch. WILLY It’ll   be   called   “The   Dream   of   Egypt.” Paris   will   never   have   seen   anything like   it.   A   scandalous   sensation   - starring   Madame   Colette   Willy   and... (drumroll   on   the   table) The   Marquise   de Belbeuf!!!   In   the common   or   garden   music   hall!   Can   you imagine?   It’ll   be   a   full   house.   Every night. THEATRE   MANAGER We   do   perfectly   well   with   the   can-can. WILLY I’ve   seen   it   half   empty   on   a   week   night. THEATRE   MANAGER You   can   vouch   for   the   Marquise? WILLY It’s   in   the   bag.   We   can   even   put   the Belbeuf family   crest   on   the   poster. The   press   will   go   wild.   You   mark   my words. THEATRE   MANAGER Do   you   have   backers? WILLY I   only   need   one.   Myself. THEATRE   MANAGER You’re   that   confident?   That’s   a   lot   of capital.  Willy bluffs somewhat - in his eyes, a slight worry.  WILLY Yes... Yes   I   am. EXT.   MOULIN   ROUGE   -   EVENING 152   152  A   theatrical   poster   on   a   column   outside   the   Moulin   Rouge announces   the   premiere   of   \"Dream   of   Egypt,\"   starring   Mme. Colette   Willy   and   the   mystery   performer   \"YSSIM.\"  Excited crowds gather outside the famous red windmill, anticipating a big night.  COLETTE - FINAL SHOOTING SCRIPT   96.",
      "characters": [],
      "action_text": "INT.   MOULIN   ROUGE   –   THE   MAIN   ROOM 153   153  The   place   is   filling   up   -   Rachilde,   Veber,   Schwob,   Madame de   Caillavet   with   Gaston   and   Jeanne   and   many SALONITES.   On stage,   stands   a   large,   solitary   sarcophagus. Willy,   accompanied   by   Meg,   makes   his   way   to   a   table   near the   stage,   greeting   various   folk. MEG My   God,   there’s   Maurice   Ravel   -   and there’s   Madame   de   Caillavet...all   of   our friends   are   here.  WILLY Yes, a lot of the Marquis’ friends are here too.  He   indicates   a   block-booking   of   starchy-looking   aristocrats near   the   front. INT.   MOULIN   ROUGE   -   HALF   AN   HOUR   LATER 154   154  The   house   lights   come   down,   precipitating   a   wave   of   wolf whistles   and   cat   calls.   Up   on   a   balcony,   a   man   dressed   as ANUBIS   strikes   a   gong.   A   SMALL   ORCHESTRA   strikes   up   a   moody Arabian   theme. WILLY Here   we   go. The   curtain   goes   up   on   a   set   resembling   the   interior   of   an Egyptian   tomb   –   hieroglyphics,   statues   etc. Missy   enters   the   stage   woodenly,   dressed   as   an archeologist,   reading   from   an   old   book.   The   crowd   ROARS.   A shower   of   coins,   orange   peel   and   garlic   cloves   rains   on   the stage. Undaunted,   Missy   finds   a   cartouche   on   the   sarcophagus   and carefully   brushes   the   dust   off   it. HECKLER Get   a   move   on,   you   dyke! Then,   with   great   effort,   Missy   opens   the   lid   of   the sarcophagus.   The   lights   change.   The   orchestra   ramps   up. And   something   starts   to   appear. In   the   crowd   various   people   react:   Mme.   de   Caillavet, sneering   TOP-HATTED   GENTLEMEN,   Veber,   Schwob,   Gaston   de Caillavet.   Willy   watches   intently,   picking   up   on   every   murmur of   the   crowd.  COLETTE - FINAL SHOOTING SCRIPT   97. Emerging   from   the   sarcoph",
      "dialogue_count": 0,
      "word_count": 1740
    },
    {
      "scene_number": 15,
      "slugline": "INT.   COLETTE   AND   WILLY’S   APARTMENT   -   WILLY’S   STUDY   -   DAY 167   167  Willy   is   looking   helplessly   through   a   stack   of   bills.   He looks   like   he’s   recovering   from   a   rough   night. Moments   later,   he   is   at   his   desk   in   front   of   a   typewriter. He   cracks   his   knuckles   and   prepares   to   work.   In   front   of him   is   the   GREAT   BLANK   PAGE. He   types   “WHAT   CLAUDINE   DID   NEXT.”   Then,   “A   NOVEL   BY   WILLY” But   nothing   will   come.   The   page   remains   blank.   He   stares   at it   with   growing   frustration. He   types   a   letter,   the   word   “I.”   Then   dots.   .....   I...   I... then   just   scrambles   on   the   typewriter   anything. HJDGJYGEBNFJHjhgiuyi8t[10845oiodfjnaf;knakgjhuyatuhrtka He   stops.   Then... KSJhdiuyrugjhabvdfjhqyt5pquojbf’auyt[085yioqhohhtuhwqout He   types   faster   and   faster   and   faster   and   starts   to   bang the   keys   -   first   with   fingers   then   with   his   fists   so   that he   is   likely   to   hurt   himself.   Then   he   stops,   breathes   and almost   at   the   point   of   tears,   and   looks   desperately   at   a picture   of   Colette   on   his   desk. INT.   OLLENDORFF   PUBLISHING   –   DAY 168   168  Willy   walks   slowly   up   the   grand   staircase. INT.   OLLENDORFF’S   OFFICE   -   DAY 169   169  The   men   are   seated   on   either   side   of   Ollendorff’s   wide desk,   igniting   cigars. WILLY Tell   me   something...the   sole   rights   to the Claudines,   Ollendorff...   What   would you   give   me   for   them? OLLENDORFF Are   you   serious?   All   of   them? WILLY Make   me   an   offer. OLLENDORFF How   much   are   you   thinking?  COLETTE - FINAL SHOOTING SCRIPT   104.",
      "characters": [],
      "action_text": "WILLY Let’s   say   25,000.   In   a   few   years   - they’ll   recoup   ten   times   that. OLLENDORFF Possibly...but   I   don’t   have   that   much. Publishing   is   a   volatile   business,   Willy... WILLY (interrupting) How   much   then? OLLENDORFF ...For   the   sole   rights   in perpetuity? WILLY Yes. Ollendorff   eyes   him,   calculating.   He   takes   a   small   slip   of paper   and   scribbles   a   number   on   it   and   passes   it   over   the desk.   Willy   looks   at   it,   dismayed. INT.   A   BAR   IN   STRASBOURG   -   NIGHT 170   170  A   warm   crowded   table   in   a   lively   low-roofed   cellar   filled with   life   and   music.   Colette   and   BAPTISTE,   a   Vietnamese conjurer,   are   having   an   arm   wrestle   across   a   table.   Wague with   a   YOUNG   FLIRT,   a   RUSSIAN   ACROBAT   and   some   SHOWGIRLS cheer   Colette   on.   There   is   the   feeling   of   merriment,   of circus.   Colette   almost   loses   then   makes   a   final   mighty   push to   bring   her   opponent’s   hand   down.   Cheers   from   the assembled. COLETTE Did   you   let   me   win? BAPTISTE Of   course! COLETTE Bastard!   That’s   worst   than   losing! ACROBAT (to   Baptiste) How   about   it..? The   Acrobat   offers   his   arm   for   a   wrestle   to   the   Baptiste. BAPTISTE No   no.   I   have   a   great   affection for   my   arm.  COLETTE - FINAL SHOOTING SCRIPT   105. Laughter.   Across   the   room,   Missy   enters   at   the   main   door. Wearing   a   SKIRT. EVERYONE Missy!   Missy! Missy   expertly   detaches   the   skirt   revealing   trousers underneath.   Everybody   cheers. COLETTE Hello,   my   love. MISSY I’m   sorry   the   train   was   waiting for   two   hours   at   the   Gard   du   Nord. COLETTE Come   here...next   to   me. Missy   snuggles   on   to   the   bench   by   Colette. MISSY How   was   it   tonight? COLETTE It   was   like   every   night.   Sheer terror   and   then   bliss. MISSY ",
      "dialogue_count": 0,
      "word_count": 1836
    },
    {
      "scene_number": 16,
      "slugline": "INT.   COLETTE   AND   WILLY’S   APARTMENT   -   WILLY’S   STUDY   –   DAY 181   181  Paul Héon sit   typing   while   Willy   stands,   giving   dictation. Colette   is   at   the   door,   livid. WILLY ...I   am   most   insulted   by   the implication   of   your   letter.   We have   transacted   business   now   for over   five   years   without   any... Colette   storms   in. COLETTE Willy,   I   need   to   see   you   alone. WILLY Tetette!   What   a   wonderful surprise! Sensing   the   impending   storm, Héon   rises,   makes   for   the door. HEON I’ll   see   you   later,   Willy, Colette. He   leaves   the   two   of   them   alone. WILLY So? She   just   looks   at   him. COLETTE 5000   francs,   Willy.   5000   francs... WILLY Ah...   You’ve   heard...   Yes... Well...I   was   in   a   corner. COLETTE Traitor.   Liar.   Thief. WILLY Don’t   be   so   melodramatic.   I   was trying   to   keep   the   house   for   you. COLETTE I   gave   you   the   house! WILLY We   still   owed   the   bank   so   much   on it.  COLETTE - FINAL SHOOTING SCRIPT   114.",
      "characters": [],
      "action_text": "COLETTE You   could   have   sold   Veber’s novels.   Some   of   your   other   trash. You   only   did   it   to   stick   the   knife in   me.   Didn’t   you?!   DIDN’T   YOU?! WILLY I   wouldn’t   have   got   anything   for Veber’s   or   Schwob’s   or   anyone else’s.   Please   calm   down... COLETTE Why?   Why   should   I   calm   down?   You   hurt and   you   hurt   and   you   think   that   by saying   “I’m   a   man,   that’s   what   men do,”   you   clear   it   all   away... He   reaches   for   her   hand.   She   explodes,   recoils   as   if   at   an electric   shock. COLETTE   (CONT’D) DON’T   YOU   TOUCH   ME!   What   you   did   was not   just   hateful   -   it   was   stupid.   Now we’ll   have   no   say   over   our   books   and we’ll   never   see   another   sou   from   them. WILLY We   can   write   some   more... COLETTE No!   Never   again!   NEVER! WILLY My   dear,   you’re   over-reacting.   It was   purely   a   business   decision. COLETTE That’s   what   our   whole   marriage   has been!   Wasn’t   I   the   best   investment you   ever   made?   No   dowry   but   my God,   she   can   write   for   her   keep? WILLY If   you   were   an   investment   then   you were   a   highly   speculative   one.   I gave   up   my   inheritance   for   you. COLETTE I   paid   you   back   a   thousand   times. WILLY Colette   stop,   damn   it!!   Stop talking   about   money.   You   were   my ideal,   my   obsession,   my   love.  COLETTE - FINAL SHOOTING SCRIPT   115. Colette   catches   her   breath   and   slowly   turns   to   him.   Her eyes   are   burning.   When   she   speaks,   it   is   with   unexpected calm. COLETTE You’ve   killed   our   child. Willy   stares   at   her,   stunned. COLETTE   (CONT’D) Those   books   –   they   were   all   we had.   Now   they’re   gone   and   we’ve   no chance   of   repair. WILLY My   dear,   Claudine   was   only   a... COLETTE Don’t!   Don’t   tell   me   what   Claudine was.   I",
      "dialogue_count": 0,
      "word_count": 1221
    },
    {
      "scene_number": 17,
      "slugline": "EXT.   THEATRE   - MARSEILLES   -   MORNING 188   188  The   three   find their   way   to   the   theater   that   displays   a giant   poster   for   “FLESH.” INT.   DRESSING   ROOM –   EVENING 189   189  At the venue,   Colette   is   getting   dressed.   She   pulls   on a stocking   but   her   big   toe   pokes   through   it.   It’s   torn. COLETTE Shit! She   goes   over   to   a large   trunk in   the   corner,   opens   it up, and rifles   around   in   the   tattered   sequin   gowns. At   the bottom   of   the   trunk, she finds   something that   stops   her   in her   tracks.   It   is one of   her   school   notebooks -   the   last one   of   the   original   Claudine At   School   manuscript.   She   flips through   it   and   about a   third of   the   way   in   finds the page that   says   THE   END. Wague   sticks   his   head   in   the   door. WAGUE  Thirty minutes to curtain. COLETTE Thanks, Wague. She blows him a kiss.  MOMENTS   LATER 190   190  The   nib   of a   pen   is   dipped in   ink. On   the   opposite page   from the   end   of   Claudine,   Colette   writes   “NOTES   ON THE MUSIC   HALL.”  She   starts to   write   again   - we   hear a   new   authority in   her voice. COLETTE   (V.O.) After   two   years   of   music-hall   and theatre,   I’m   still the same   –   face to face with   that   painted   mentor   who   gazes at   me   from   the   other side   of the looking-glass,   with deep-set   eyes   under lids   smeared   with   purplish   greasepaint. INT. CORRIDOR   –   NIGHT 191   191  Colette   walks   down the corridor   backstage, past SHOWGIRLS changing   and   ACROBATS warming up   -   her   new   world, her new community.   She   sees Wague   who   signals   to   her   good   luck.  COLETTE - FINAL SHOOTING SCRIPT   120.",
      "characters": [],
      "action_text": "COLETTE (V.O.) I   know   she   is   going   to   speak to   me. She   is   going to   say: \"Is that   you there, all alone   under that   ceiling booming   and   vibrating   under   the   feet of   the   dancers?   Why   are   you   there,   all alone? And why not somewhere   else?” Yes,   this   is   the   dangerous,   lucid hour. Approaching   the   stage, we   hear the audience   chanting   \"Colette\" over   and   over   in   rhythm.   The   sound   gets louder, the audience’s feet beating a   tattoo   on the floor;   COLETTE, COLETTE,   COLETTE. INT.   THEATRE   – BACKSTAGE 192   192  COLETTE (V.O.) Now, whenever   I   despair, I   no   longer expect   my   end,   but   some bit of   luck, some   commonplace   little   miracle which, like   a   glittering   link, will mend   again the necklace   of my   days. Colette   takes   a   deep   breath.   The   curtain   goes   up,   to   thunderous applause.   She   walks   into   the   brilliant glow   of the footlights, and disappears   into white,   like a   bird   disappearing into   the sun. TITLES comes   up,   accompanied   by   ARCHIVAL   PHOTOS   and   MUSIC. TITLE In   1911, Colette’s   “The   Vagabond,”   based on her   music   hall   experience,   was   published under   her   own   name   to   great critical   acclaim. TITLE   (CONT’D) Missy   and   Colette   continued   their   relationship for   many   years.   Missy often   accompanied Colette   on   her   music   hall tours,   though   never again   opted to   appear   on   the   stage. TITLE   (CONT’D) Willy   continued   to   publish   ghost- written books   with   Meg, but failed   to replicate the success of   the Claudines. He   died   in   1931   in   relative   obscurity.  TITLE (CONT’D) Paul Héon did not destroy the original Claudine manuscripts but returned them to Colette. They became crucial evidence in a 1948 legal battle to establish the true authorship of the novels... that Colette won.  COLETTE - FINAL SHOOTING SCRIPT   121. TITLE   (CON",
      "dialogue_count": 0,
      "word_count": 609
    }
  ]
}