{
  "slug": "community-107-introduction-to-statistics-2009",
  "title": "community 107 introduction to statistics",
  "genre": "thriller",
  "format": "series",
  "scenes_count": 2,
  "characters_count": 1,
  "characters": [
    "PIERCE"
  ],
  "total_words": 3346,
  "total_dialogue": 1,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. LIBRARY - CONTINUOUS 7   7  Pierce enters, places his bird sidekick down and starts  laying pills from his organizer onto a table.   STAR-BURNS  enters, dressed as Nurse Ratchet from Cuckoo’s Nest.  STAR-BURNS  Sweet   owl .   *  He sees the pills.  STAR-BURNS (CONT’D)  Whaddya taking tonight?  PIERCE  Oh, cholesterol   pi   --   *  (gets embarrassed)  You know, the usual cool stuff.  Ludes.   Dreamers.   Johnny Boys.  Star -b urns   produces a pill container of his own.   *  STAR-BURNS   *  Trade you one of mine for two of   *  yours.   *  Star-burns   takes two of Pierce’s pills and   offers one of his.   *  PIERCE  I...don’t know...   *  STAR-BURNS  Oh... I thought I was talking to  the Beastmaster.  PIERCE  Did I say you weren’t?   Saddle up,   *  Fruit Pie.   *  Pierce takes the pill.   Star-burns takes two of Pierce’s.   *  They swallow.   *  PIERCE (CONT’D)   *  (small choke)   *  Smooth.   *  INT. STUDY ROOM - A LITTLE LATER 8   8  The party continues.   Sr. Chang offers a clipboard to Jeff.  SR. CHANG  He re, take this, give anyone that   *  shows up   their stupid   credit.   *  \"Community\" - #106 - \"Introduction to Statistics\" - Pink Revised   9/07/09   8.",
      "characters": [],
      "action_text": "JEFF   *  You going to the faculty party?   *  Let me be your plus one.   *  SR. CHANG   *  Give it up, Winger.   Professor   *  Slater doesn’t date students.   Or   *  married Asians who drive mopeds.   *  JEFF   *  Give you twenty bucks.  SR. CHANG  I’ll bring the hog around.  Chang moves off.   Jeff grabs his coat .   Britta observes it.   *  ANGLE ON: Annie gathering the crowd.  ANNIE  Okay, it’s time for the Dance of  the Dead.   Everyone form a circle.  Lights.   M usic.   *  Abed is standing by a laptop, working the music.   *  ABED  (gruff batman)  Is   it   under “genre” or on a   *  specific “play list?”   *  Pierce is reacting strangely to the lights and music.   He   *  approaches Star-Burns.   *  PIERCE   *  Hey, guy, what did you slip me?   *  I’m grinding my teeth and I want to   *  kiss everybody.   *  STAR-BURNS   *  What did you slip   me ?   My heart   *  stopped racing and I can’t pee!   *  ANGLE ON :   ANNIE.   The students have formed a circle.   *  The lights dim and Abed cues the music.   Slightly trippy  mariachi/Mardi Gras music plays.  ANNIE  Now , for the first dance, I would   *  like to invite a very special guest   *  to the floor.   Jeff Winger?   *  \"Community\" - #106 - \"Introduction to Statistics\" - Pink Revised   9/07/09   9.  CONTINUED: 8   8  (MORE) (looking around)   *  Jeff?   *  She looks around.   It’s awkward.   *  EXT. CAMPUS - CONTINUOUS 9   9   *  A tiny Sr. Chang drives a giant Jeff on a moped.   A car cuts  him off.  SR. CHANG  Nice blinker assface!  INT. STUDY ROOM - CONTINUOUS 10   10  BRITTA   *  (assuring yet fuming)   *  He just stepped out.   He’ll be   *  right back.   *  Britta confides in Shirley:   *  BRITTA (CONT’D)   *  He’s going to the faculty party.   *  SHIRLEY   *  To be with Professor Short Skirt?   *  We hate her.   *  BRITTA   *  It’s not about her, Shirley, I just   *  can’t believe Jeff would do this to   *  Annie.   *  SHIRLEY   *  Oh, yes, absolutely, it’s about   *  Annie.   *  (realizing)   *  ",
      "dialogue_count": 0,
      "word_count": 1979
    },
    {
      "scene_number": 2,
      "slugline": "INT. STUDY ROOM - A LITTLE LATER 15   15  Pierce staggers in.   The party lamely continues on with a few   *  loser guests and Annie sitting, despondent.   Pierce,   still   *  reeling from Jeff’s tongue lashing, having a bad trip.   HE  FIXATES ON THE DEATH IMAGERY: skeletons, grim reapers, a  giant coffin, etc.   Troy runs in after him.   *  TROY   *  Pierce, you cool man?   *  PIERCE   *  (no)   *  The coolest!   *  TROY   *  (looking around)   *  Man, all this death stuff really   *  freaks me out.   It could happen to   *  any of us any time.   Last year, my   *  uncle dropped dead.   Sixty-five   *  years old.   *  (then)   *  How old are you?   *  PIERCE   *  How black are you?!   *  Pierce staggers off.   SEE HIS STYLIZED DEATH NIGHTMARE.   A   *  skeleton on stilts laughs.   A grim reaper motions “come to  me” with a long finger.   Music gets louder and louder.  PIERCE sees giant cookie tombstones on a table.   He sees one  that reads “Pierce Hawthorne RIP.”   He’s paralyzed with fear.  He lets out a BLOOD CURDLING SHRIEK.   Everyone runs out.   *  INT. CAFETERIA - LATER 16   16  [network/table version, rewrite needed]   Jeff stands alone,   *  watching Professor Slater put on her coat.   Sr. Chang  approaches.  SR. CHANG  Do I feel a breeze?   Because  somebody just...  (miming baseball swing)  Struck out.  JEFF  She blew you off too, Chang.   *  SR. CHANG   *  That’s what you’re leaning on?   *  Look at me.   *  \"Community\" - #106 - \"Introduction to Statistics\" - Pink Revised   9/07/09   18.  (MORE)",
      "characters": [
        "PIERCE"
      ],
      "action_text": "I’ve got the body of a fifth   *  grader.   My parking space is a bike   *  rack.   If I was working with what   *  you’ve got she’d be at the Comfort   *  Inn right now doing weird things to   *  me with jam.   *  JEFF   *  (watching Slater)   *  I can’t let this happen.   *  Jeff walks over to her.   *  JEFF (CONT’D)   *  Wait.   I need to be with you   *  tonight.   And it’s not about the   *  sex, or about the taunting I may   *  have received from a tiny Asian   *  man, it’s about having one night   *  where people don’t look at me like   *  a student at a Community College; a   *  guy who has to save a teenager’s   *  party or wrangle a gyrating   *  Beastmaster.   Tonight, I want to be   *  with someone who can see me for who   *  I really am, a sleazy lawyer.   *  She laughs.   *  JEFF (CONT’D)   *  I don’t care what we do, we can   *  talk, watch a movie, cuddle, do   *  that “Ghost” thing where we almost   *  touch and that makes it hotter...   *  PROFESSOR SLATER   *  If we’re doing this there’s going   *  to be sex.   *  JEFF   *  That’s fine too.   *  PROFESSOR SLATER   *  Let’s go before I change my mind.   *  They start out.   Jeff is on a cloud.   He does a happy, high   *  elbowed, cowboy walk.   *  Chang p ulls him aside.   *  SR. CHANG   *  Nicely done.   *  (palms Jeff a card)   *  \"Community\" - #106 - \"Introduction to Statistics\" - Pink Revised   9/07/09   19.  CONTINUED: 16   16  SR. CHANG (CONT'D)  (MORE) My Comfort Inn platinum card.  It’ll get you HBO West and one  robe.   *  EXT. LIBRARY - A FEW MINUTES LATER 17   17  Jeff   head s with Professor Slater   towards her car, his arm   *  around her.   They pass o ur group and various lame party-goers   *  are standing outside the doors, looking through the windows  with concern.  TROY  Pierce,   it’s okay! Come out of   *  there!   *  TIGHT On Pierce in the classroom peering through some kind of   *  desk fortress.   *  PIERCE   *  You’re not getting me yet!   I’m not   *  ready to die!  JEFF ",
      "dialogue_count": 1,
      "word_count": 1367
    }
  ]
}