{
  "slug": "conclave-2024",
  "title": "conclave",
  "genre": "drama",
  "format": "film",
  "scenes_count": 16,
  "characters_count": 0,
  "characters": [],
  "total_words": 22965,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. CASA SANTA MARTA - SECURITY GATE - EVENING 23   23 The surreal sight of cardinals handing in their mobile phones at reception, queueing to pass through a METAL DETECTOR. Sister Agnes watches over the process. SISTER AGNES (Italian)  < The iPad too, your Eminence. >  SISTER AGNES  Anche l'iPad, Eminenza.  INT. CASA SANTA MARTA - STORAGE ROOM - EVENING 24   24 A NUN is placing the confiscated MOBILE PHONES and devices into dockets, each in a labelled plastic bag. INT. CASA SANTA MARTA - HALLWAY - EVENING 25   25 Lawrence walks quickly with Monsignor O’Malley, both trailed by the young chaplain, FATHER HAAS. LAWRENCE (Impatient) Where is he? O’MALLEY The meeting room, Your Eminence. LAWRENCE   * (handing coat and scarf to Haas; Italian)  Will you take these upstairs for me?  LAWRENCE Me li porta di sopra, per favore? O’MALLEY Do you w ant me to sit in? LAWRENCE No, no, I’ll deal with it. INT. CASA SANTA MARTA - MEETING ROOM - EVENING 26   26 He opens the door to the room and finds Wozniak with his back to him at the far end of the room, staring at the wall. LAWRENCE (Closing the door after him) Janusz? CONCLAVE by Peter Straughan - Pink Revisions. (27.01.2023) 21.",
      "characters": [],
      "action_text": "Wozniak turns, looking ashen. He’s been drinking. He sinks to his knees, makes the sign of the cross. CONCLAVE by Peter Straughan - Pink Revisions. (27.01.2023) 21A. ARCHBISHOP WOZNIAK In the name of the Father, the Son and the Holy Ghost. My last confession was four weeks ago... Lawrence walks to him, a little irritated. LAWRENCE (Helping him up) Janusz, Janusz, I’m sorry I don’t have   time   to hear your confession. There is so much still to do. Wozniak sinks into a chair. Wipes sweat from his face with trembling hands. Lawrence examines him in surprise. LAWRENCE   (CONT’D) Have   you been drinking? Wozniak looks at him, wretched. Lawrence sighs inwardly. LAWRENCE   (CONT’D) What’s troubling you? Tell me. ARCHBISHOP WOZNIAK I should have come to you before. But I promised I wouldn’t say anything. LAWRENCE Promised who? ARCHBISHOP WOZNIAK Cardinal Tremblay. Lawrence feels an instinctive stab of alarm, his natural aversion to secrets. Almost without realising it, he is drifting back towards the   door. LAWRENCE Janusz, the doors close soon and you’ll have to leave. Now if you promised Father Tremblay then perhaps it isn’t right for you to... ARCHBISHOP WOZNIAK (Blurting) The day the Pope died, the last person to have an official appointment with him was Cardinal Tremblay. CONCLAVE by Peter Straughan - Pink Revisions. (27.01.2023) 22. LAWRENCE (Impatient) Yes, I know. It’s on the official timeline for... ARCHBISHOP WOZNIAK At that meeting, the Holy Father dismissed him from all his offices in the Church. That stops Lawrence in his tracks. LAWRENCE What? ARCHBISHOP WOZNIAK He sacked him. Lawrence stares at him. He starts to speak, stops, dimly aware that he feels anger -   anger at being burdened with this . LAWRENCE (Tight)  Why?  ARCHBISHOP WOZ NIAK For gross misconduct. Lawrence stares at him, staggered. LAWRENCE You...you tell me this   now?   We are about to be sequestered and... ARCHBISHOP WOZNIAK Forgive me! But it wasn’t until the last few days, when I starte",
      "dialogue_count": 0,
      "word_count": 4393
    },
    {
      "scene_number": 2,
      "slugline": "INT. CASA SANTA MARTA - LAWRENCE'S ROOM - NIGHT 41   41 Lawrence wakes suddenly. From the next room comes the sound of stentorian snoring. He tries to screen it out. But sleep seems impossible now. He sits up in bed. INT. CASA SANTA MARTA - GYM - NIGHT 42   42 Lawrence walks on the treadmill, the only figure in the large room. He stares at his reflection in the mirrored wall as he speed walks, listening to the h ypnotic   thrum, thrum   of the treadmill. TITLE CARD:   FIRST DAY OF CONCLAVE  EXT. CASA SANTA MARTA - COURTYARD - MORNING 43   43 HIGH ANGLE - from the top of the balcony. The courtyard below is a sea of red: cardinals robed for the coming service. Lawrence stands staring down at them, an air of trepidation behind the eyes. Below a single nun in blue is lost among the red. FATHER HAAS (O.S.) Your Eminence? Behind   him Father Haas has appeared in the hall. Lawrence blinks out of his thoughts. INT. CASA SANTA MARTA - SIDE ROOM - MORNING 44   44 Haas is robing Lawrence, fussing around like a tailor, adjusting the heavy red chasuble. He places the tall, white mitre on Lawrence’s head, stands back to survey its angle critically. He hands Lawrence the crozier - a golden Shepherd’s crook. FATHER HAAS How does it feel, Your   Eminence? LAWRENCE Good. Thank you. We hear the chanting of the   Gospel of St John...  CONCLAVE by Peter Straughan - Pink Revisions. (27.01.2023) 41.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 251
    },
    {
      "scene_number": 3,
      "slugline": "INT. “ROOM OF CARDINALS” - MORNING 45   45 A bare space. Lawrence looks out at the rows of the congregation that have been crammed into the room: the red of the cardinals, purple of the Bishops, white of the Priests... They sit and stand in front of him. Lawrence sits, clutching the sermon in his lap, hiding the turmoil going on inside him. His gaze flits across the ranks of cardinals, finding the main co ntenders: Adeyemi, Bellini, Tremblay and finally Tedesco. Haas appears in front of him and removes the mitre, catches something in the Dean’s expression as he does so. FATHER HAAS (Concerned, softly) Are you well, Eminence? LAWRENCE I’m fine. The choir comes to an end. ON THE MICROPHONE - as Lawrence steps in front of it. For a moment he stares out over the room of faces. He stares down at the pages of h omily. The moment hangs until there’s a faint stirring of unease. Finally... LAWRENCE   (CONT’D) (Reading, Italian)  < Dear Brothers in Christ, at this moment of great uncertainty in the history of the Holy Church we must think first of the late Holy Father whose brilliant pontificate was a gift from God. >  LAWRENCE   (CONT’D)  Cari fratelli in Cristo, in questo momento di grande incertezza nella storia della Santa Chiesa d obbiamo pensare innanzitutto al defunto Santo Padre, il cui brillante pontificato è stato un dono di Dio.  A murmur of approval from the congregation. LAWRENCE   (CONT’D)  < Now we must ask our Lord to send us a new Holy Father through the pastoral solicitude of the cardinal fathers and we must pray to God for that loving assistance and ask Him to guide us to the right choice.>  LAWRENCE   (CONT’D)  Ora dobbiamo chiedere a n ostro Signore di mandarci un nuovo Santo Padre attraverso la sollecitudine pastorale dei padri cardinali e dobbiamo pregare Dio per questa amorevole assistenza e chiedere la sua guida nel compiere la scelta giusta.  He looks out at his audience, his gaze once more falling on Tedesco watching him with a faint complacent smile. CONCLAVE by Peter Straughan - Pink Revisions. (27.01.2023) 42.",
      "characters": [],
      "action_text": "He turns the page, scans the text, and the next page... platitudes, platitudes... Suddenly he puts the sermon aside. For the first time in days he feels calm. LAWRENCE   (CONT’D) (In English) But you all know that. There is some surprised laughter. LAWRENCE   (CONT’D) Let me speak from the heart for the moment. Now there’s a definite stirring of alarm amongst the cardinals. LAWRENCE   (CONT’D) St Paul said “Be subject to one another out of reverence for Christ.” To work together, and grow together, we must be tolerant. The room is entirely still   now... INTERCUT WITH: INT. “ROOM OF CARDINALS” ANTECHAMBER - MORNING 46   46 ... whilst right outside the door SISTER AGNES and a few of her nuns are silently listening to Lawrence’s speech. LAWRENCE St Paul said that God’s gift to the Church is its variety. It is this variety, this   diversity   of people and views that gives our Church its strength. In the course of a long life in the service of our Mother th e Church, let me tell you that there is one sin I have come to fear above all others. Certainty. Certainty is the great enemy of unity. Certainty is the deadly enemy of tolerance. Even Christ was not certain at the end. Lawrence switches into Italian. CONCLAVE by Peter Straughan - Pink Revisions. (27.01.2023) 43. LAWRENCE   (CONT’D) “ Dio mio, Dio mio, perché mi hai abbandonato? \" LAWRENCE   (CONT’D) (back to English)  “My God, my God, why have you forsaken me?”   He cried out in His agony at the ninth hour on the cross. Our faith is a living thing precisely   because   it walks hand in hand with doubt. If there was only certainty, and if there was no doubt, there would be no mystery, and therefore no need for faith. Let us pray that God   will grant us a Pope who doubts. Let Him grant us a Pope who sins and asks for forgiveness. And carries on. He looks out over the cardinals and sees they are unified by a single emotion. Shock. EXT. CASA SANTA MARTA - COURTYARD - DAY 47   47 Lawrence is led by Haas and some ASSIST",
      "dialogue_count": 0,
      "word_count": 1587
    },
    {
      "scene_number": 4,
      "slugline": "INT. SCALA REGIA - DAY 54A   54A A security guard scrolls through his phone, standing on the marble staircase. We hear the cardinals taking their oath. JUNIOR CARDINAL-DEACON GUERRINI (O.S.) (In Latin)  < ...I Antonio Cardinal Guerrini do so promise, pledge and swear, so help me God and these Holy Gospels which I touch with my hand. >  JUNIOR CARDINAL-DEACON GUERRINI (O.S.)  ...Et ego Antonius Cardinalis Guerrini   spondeo, voveo ac iuro, Sic me Deus adiuvet et haec Sancta Dei Evangelia, quae manu mea tango.  INT. SISTINE CHAPEL - DAY 55   55 The last of the cardinals stand taking the oath. The others have now taken their seats at the rows of desks filling the room. CARDINAL BROTZKUS (In Latin)  < ...I Romuald Cardinal Brotzkus do so promise, pledge and swear... >  CARDINAL BROTZKUS  ...Et ego Romualdus Cardinalis Brotzkus   spondeo, voveo ac iuro...  Lawrence finds himself staring up at Michelangelo’s   The Last Judgement . One of the Damned clutches a hand to his face as demons drag him down... CARDINAL BROTZKUS   (CONT’D)  < So help me God and these Holy Gospels which I touch with my hand. >  CARDINAL BROTZKUS   (CONT’D)  Sic me Deus adiuvet et haec Sancta Dei Evangelia, quae manu mea tango.  CARDINAL NAKITANDA  Et ego Irumbus Cardinalis Nakitanda s pondeo, voveo ac iuro, sic me Deus adiuvet et haec Sancta Dei Evangelia, quae manu mea tango.  Lawrence blinks as Mandorff steps up to the microphone that has been placed before the west wall of the chamber .  ARCHBISHOP MANDORFF  Extra omnes . The television lights are switched off plunging the chamber into relative gloom. Mandorff makes his way to the vestibule as priests, officials, choristers, securit y men, cameramen, photographer and the commandant of the Swiss Guard leave the chapel. The three scrutineers, CARDINALS LUKSA, MERCURIO and LOMBARDI, take their place at a table in front of the altar. CONCLAVE by Peter Straughan - Pink Revisions. (27.01.2023) 48.",
      "characters": [],
      "action_text": "Lawrence catches Adeyemi’s eye. Cardinal Tedesco glances at Bellini who looks at Tremblay across from him. In the vestibule Mandorff passes through the huge doors... INT. OUTSIDE SISTINE CHAPEL - DAY 56   56 ...to close them after him. INT. SISTINE CHAPEL - DAY 57   57 We hear the sound of a key turning. The great bell of St Peter’s begins tolling five o’clock. The Conclave has begun . LAWRENCE walks to the microphone. LAWRENCE  < Cardinal brothers, we will now proceed to the first ballot. >  (Holding up a ballot paper)  < You will find in front of you your ballot paper. On the top half is written... > (Glancing ironically at Tedesco) < Eligo in Summum Pontificem. “I elect as Supreme Pontiff”. Beneath this you must write the name of your chosen candidate. Please make sure your hand-writ ing is legible.>  LAWRENCE  Fratelli Cardinali, procederà ora al primo scrutinio.  (Holding up a paper ballot)  Troverete davanti a voi la vostra scheda elettorale. Sulla metà superiore è scritto...  (Glancing Ironically at Tedesco)  Eligo in Summum Pontificem. ”Eleggo Sommo Pontefice”. Sotto di essa dovete scrivere il nome del candidato che avete scelto. Assicuratevi che la vostra calligrafia sia leggibile.  La wrence returns to his seat and picks up his own ballot paper. He shields the paper with his arm and writes BELLINI, folds it and walks back to the altar. He holds it above his head. LAWRENCE   (CONT’D) (In Latin)  < I call as my witness Christ the Lord who will be my judge, that my vote is given to the one who before God I think should be elected. >  LAWRENCE   (CONT’D)  Testor Christum Dominum, qui me iudicaturus est, me eu m eligere, quem secundum Deum iudico eligi debere.  Under the gaze of the three cardinals he places his ballot in the large urn on the altar. CONCLAVE by Peter Straughan - Pink Revisions. (27.01.2023) 49. He returns to his seat, his eyes straying to where Bellini sits, apparently sunk in meditation. One by one the cardinals begin to rise and vote, ballots",
      "dialogue_count": 0,
      "word_count": 900
    },
    {
      "scene_number": 5,
      "slugline": "INT. SISTINE CHAPEL - DAY / LATER 59   59 CLOSE on the URN - now almost empty of ballots. Luksa’s hand reaches in. Lawrence is hurriedly adding up the votes in pencil beside his list. CARDINAL LOMBARDI  < Cardinal Bellini. >  (Italian, Receiving the next ballot)  < Cardinal Tremblay. >  (Beat)  < Cardinal Adeyemi. >  CARDINAL LOMBARDI  Cardinale Bellini.  (Italian, Receiving the next ballot)  Cardinale Tremblay.  (Beat)  Car dinale Adeyemi.  Lawrence scribbles away... CARDINAL LOMBARDI   (CONT’D)  < And finally... Cardinal Benitez. >  CARDINAL LOMBARDI   (CONT’D)  E infine... Cardinale Benítez.  Again, Lawrence looks up in surprise. Benitez himself has raised his head in shock. Whispered conversations break out around the chamber. The three Scrutineers confer briefly then Lombardi leans into the microphone again. CARDINAL LOMBARDI   (CONT’D) (Italian)  < The res ults of the first ballot are... Cardinal Adeyemi, twenty-one votes. Cardinal Tedesco, eighteen votes. Cardinal Bellini, seventeen votes. Cardinal Tremblay, sixteen votes. Cardinal Lawrence, five votes... >  CARDINAL LOMBARDI   (CONT’D)  I risultati del primo scrutinio sono i seguenti: Cardinale Adeyemi, ventuno voti. Cardinale Tedesco, diciotto voti. Cardinale Bellini, diciassette voti. Cardinale Tremblay, sedi ci voti. Cardinale Lawrence, cinque voti...  Lawrence flinches, dismayed at this. CARDINAL LOMBARDI   (CONT’D)  < Other cardinals assigned a single vote, thirty-one votes. >  CARDINAL LOMBARDI   (CONT’D)  Altri cardinali che hanno ricevuto un solo voto, trentuno voti.  The hum of conversation grows louder as Lawrence stands and walks to the microphone. CONCLAVE by Peter Straughan - Pink Revisions. (27.01.2023) 51.",
      "characters": [],
      "action_text": "LAWRENCE (Raising his voice over the hubbub )  < My brother cardinals... my brother cardinals, that concludes the first ballot. No candidate having achieved the necessary majority of seventy-two votes, we shall adjourn for the evening and resume voting in the morning. I now invite the Junior Cardinal-Deacon to ask for us to be released. >  LAWRENCE (Raising his voice above the hubbub)  Fratelli cardinali. .. fratelli cardinali, con questo si conclude il primo scrutinio. Poiché nessun candidato ha ottenuto la maggioranza necessaria di settantadue voti, per la serata la seduta è aggiornata e riprenderemo le votazioni domattina. Ora invito l’ultimo cardinale diacono a dire che ci vengano ad aprire.  His gaze flits to Bellini, who sits, staring into nothing. Guerrini walks to the back of the chapel and k nocks on the doors. JUNIOR CARDINAL-DEACON GUERRINI  Aprite le porte! Aprite le porte!  INT. OUTSIDE SISTINE CHAPEL - DAY 59A   59A Archbishop Mandorff waits outside the Sistine Chapel. He now unlocks the doors and they begin to swing open... INT. SISTINE CHAPEL - VESTIBULE - LATE AFTERNOON 60   60 Monsignor O’Malley squats by the stove, their chimneys rising to a window high above. He bundles inside the threaded ballo t papers. He ignites them with a fire-lighter, closes the door as they begin to blaze. He turns to the second stove and presses a switch. INT. INSIDE THE STOVE - LATE AFTERNOON 60A   60A INSIDE THE STOVE - the canister of potassium perchlorate, anthracene and sulphur activates with a   whoosh. .. EXT. SISTINE CHAPEL - LATE AFTERNOON 61   61 The temporary metal chimney jutting out above the roof of the chapel begins t o gush jet-black smoke, illuminated by a search-light. The smoke streams up to the winter sky and the waiting world. A dull roar swells and fades. It takes us a moment to realise it’s the response of the vast crowd gathered outside. CONCLAVE by Peter Straughan - Pink Revisions. (27.01.2023) 52. INT. EMPTY ROOMS - LATE AFTERNOON 61A   61A As t",
      "dialogue_count": 0,
      "word_count": 4354
    },
    {
      "scene_number": 6,
      "slugline": "INT. CASA SANTA MARTA - DINING ROOM BUFFET - DAY 80   80 Lawrence stands getting coffee. He turns and finds three of the African Cardinals behind him, their expressions mournful. And his heart sinks. For a moment he has a mad impulse to flee. But... CARDINAL NAKITANDA May we have a word, Dean? LAWRENCE Of course. CARDINAL NAKITANDA Our brother Joshua is troubled. LAWRENCE What just happened? The cardinals exchan ge glances. CARDINAL NAKITANDA One of the nuns serving our table started talking to him. He tried to ignore her and then she dropped her tray and shouted something. He got up and left. LAWRENCE What did she say to him? CARDINAL NAKITANDA We don’t know. She was speaking Yoruba. LAWRENCE Where is Cardinal Adeyemi now? Nakitanda shrugs, takes his arm. CARDINAL NAKITANDA Clearly something is wrong, Dean, and he   must tell us what. We have waited a long time for an African Pope. But he must be pure in heart and conscience. Anything less would be a disaster for us all. OMITTED 81   81 CONCLAVE by Peter Straughan - Pink Revisions. (27.01.2023) 70.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 185
    },
    {
      "scene_number": 7,
      "slugline": "INT. CASA SANTA MARTA - KITCHEN - DAY 81A   81A The kitchen is full of NUNS preparing food. Lawrence crosses towards the back, looking for the missing nun. Those closest to him bow their heads as he passes. In the back the office is empty. Lawrence returns. LAWRENCE (Italian)  < Could you tell me, where is the sister who just had the accident? >  LAWRENCE  Potreste dirmi dove si trova la sorella che ha fatto cadere   la bottiglia prima?  NUN (Italian)  < She is with Sister Agnes, Your Eminence. >  NUN  È con Suor Agnes, Vostra Eminenza.  LAWRENCE  < Would you be kind enough to take me to her? >  LAWRENCE  Sareste così gentile da portarmi da lei?  The Nun begins to lead him back to the dining room. LAWRENCE   (CONT’D)  < Is there a rear exit we can use? >  LAWRENCE   (CONT’D)  C'è un'uscita posteriore che possiamo usare?  INT. CASA SANTA MARTA - OUTSIDE BAC K OFFICE - DAY 82   82 The Nun knocks on the door of the office. There is no reply. Lawrence steps forward and knocks more loudly. After a moment, the door opens a little and SISTER AGNES peers out. LAWRENCE Good afternoon, Sister. I need to speak to the nun who dropped her tray just now. SISTER AGNES She is safe with me, Your Eminence. I am dealing with the situation. LAWRENCE I am sure you are Sister Agnes.   But I must see her myself. SISTER AGNES I hardly think a dropped tray should concern the Dean of the College of Cardinals. CONCLAVE by Peter Straughan - Pink Revisions. (27.01.2023) 71.",
      "characters": [],
      "action_text": "LAWRENCE Even so... He grips the door handle. Amazed, he finds that as he pushes, she resists. SISTER AGNES The welfare of the Sister is   my  responsibility, Dean. An impasse as both stare at each other. LAWRENCE (Icy) And this Conclave is mine. Beat. Finally she stands aside. INT. CASA SANTA MARTA - BACK OFFICE - DAY 83   83 The NUN - a plump middle-aged Nigerian woman   - sits in a corner of the office. She sta nds as Lawrence enters. LAWRENCE Please, sit, my child. My name is Cardinal Lawrence. How are you feeling? SISTER AGNES She’s feeling much better. LAWRENCE (To the Nun) Could you tell me your name? SISTER AGNES Her name is Shanumi. LAWRENCE (To the Nun) Please, do sit down. SISTER AGNES Eminence, I really do think it would be better if... LAWRENCE (Without looking at her) Would you be so good as to leave us now, S ister Agnes? CONCLAVE by Peter Straughan - Pink Revisions. (27.01.2023) 72. She opens her mouth to protest again but Lawrence turns and stares at her with a look of such freezing authority that she finally bows her head and walks out of the room, closing the door after her. Lawrence sits, facing SISTER SHANUMI. LAWRENCE   (CONT’D) Sister Shanumi, I want you to understand, first of all, that you are not in any sort of trouble. The fact of the matter is, I have a responsibility before   God to make sure that the decisions we make here are the right ones. Now it’s important that you tell me anything that is in your heart and that is troubling you in so far as it relates to Cardinal Adeyemi. Can you do that for me. Shanumi stares at the floor, shakes her head. LAWRENCE   (CONT’D) Even if I give you absolute assurance that it will go no further than this room? Again, she shakes her head. Lawrence   sits, at a loss. Then, inspiration strikes. He leans towards her again. LAWRENCE   (CONT’D) Would you like me to hear your confession? INT. CASA SANTA MARTA - CORRIDOR - DAY 84   84 TRACKING with Lawrence as he walks determinedly down the corridor. He reach",
      "dialogue_count": 0,
      "word_count": 682
    },
    {
      "scene_number": 8,
      "slugline": "INT. CASA SANTA MARTA - ADEYEMI’S ROOM - CONTINUOUS 85   85 Adeyemi is in the bathroom. We hear the steady stream of urination, followed by the flush. He walks out, buttoning his cassock, seems surprised to find LAWRENCE there. ADEYEMI Shouldn’t we be leaving? LAWRENCE In a moment. ADEYEMI That sounds ominous.  ( Studying himself in the mirror )  If this is about the incident downstairs, I have no desire to talk   about it. Lawrence watches in silence, waiting him out. Adeyemi turns from the mirror and walks past Lawrence into the room. ADEYEMI   (CONT’D) I am the victim of a disgraceful plot to ruin my reputation. Someone brought that woman here and staged this melodrama. She’d never left Nigeria before and suddenly she is here in the Casa Santa Marta? LAWRENCE With respect, Joshua, how she came here is secondary to the   issue of your relationship with her. ADEYEMI (turning) I have no relationship to her! I hadn’t set eyes on her for thirty years until she turned up outside my room last night! He catches himself. ADEYEMI   (CONT’D) It was...it was... (Helplessly) A   lapse , Dean. A   lapse ! “Let God grant us a Pope who sins and asks forgiveness, and carries on.” Your words! CONCLAVE by Peter Straughan - Pink Revisions. (27.01.2023) 74.",
      "characters": [],
      "action_text": "LAWRENCE And have you asked forgiveness? ADEYEMI I confessed my sin at the time! My bishop moved me to another parish and I never lapsed again! Such relationships were not uncommon in those days. You know that! LAWRENCE (Quietly) And the child? Adeyemi flinches. ADEYEMI The child? The child was brought up in a Christian household, and to this day he has no idea who his father is - if indeed it is me.  That   is the child. For a moment the two men stare at each other in silence, Adeyemi’s jaw jutted in defiance. Then something in him crumbles. He sits on the bed. ADEYEMI   (CONT’D) (Beat. Broken) We were very young. LAWRENCE No, Your Eminence.   She   was very young. Nineteen years old.   You   were thirty. ADEYEMI Thomas,   please ... Listen to me. I sensed the presence of the Holy Spirit this morning. I swear it. I am   ready   to t ake this burden. Does a single mistake thirty years ago disqualify me? I was a different man! I beg you, please don’t use this to ruin me. LAWRENCE (sadly) Joshua...the thought is not worthy of you. The woman will not speak of this to protect her son, and I am bound by the vows of the confessional. CONCLAVE by Peter Straughan - Pink Revisions. (27.01.2023) 75. Adeyemi looks up at him. ADEYEMI So... I still have hope? Lawrence hesitates, hating this duty. He steps closer, taking Adeyemi’s hands in his. LAWRENCE (Gently) No, Joshua. There is no hope. After such a public scene, there will be rumours. And you know what the Curia is like. Nothing terrifies our colleagues more than the thought of yet more sexual scandals. Adeyemi’s eyes prick with tears. LAWRENCE   (CONT’D) ( Moved) I am more sorry than I can say. You will never be Pope. You   must   begin again. He bends closer, grips the Nigerian’s hands tighter. LAWRENCE   (CONT’D) (Fiercely) But you are a   good   man. And you  will   find a way to atone. A long beat. Adeyemi nods blindly, disengages his hands to wipe his eyes. He breathes deeply, gathers himself. ADEYEMI Will you...will ",
      "dialogue_count": 0,
      "word_count": 649
    },
    {
      "scene_number": 9,
      "slugline": "INT. SISTINE CHAPEL - DAY 87   87 The Fourth and Fifth Ballots in progress. We’re watching Adeyemi walk down the aisle, his ballot held high in his hand. He passes the seats of the African Cardinals who, to a man, avert their eyes. He reaches the microphone. ADEYEMI (Solemnly, in Latin)  < I call as my witness Christ the Lord, who will be my judge, that my vote is given to the one who before God I think sho uld be elected. >  ADEYEMI (Solemnly)  Testor Christum Dominum, qui me iudicaturus est, me eum eligere, quem secundum Deum iudico eligi debere.  Lawrence sits, marvelling at the man’s dignity in the face of his ruined life. He turns back to his own ballot paper. A beat. Reluctantly, he writes:   Bellini . - Cardinals shuffle down the aisle, ballots held up in shaking hands... - Ballots are dropped into the Ur n... - High above, the Last Judgement lies cloaked in darkness... HARD CUT TO: INT. SISTINE CHAPEL - DAY / LATER 88   88 Cardinal Lombardi is reading the results. CARDINAL LOMBARDI (Italian)  < The results of the Fifth Ballot are... Cardinal Tremblay, forty votes. >  CARDINAL LOMBARDI  I risultati del quinto scrutinio sono i seguenti. Cardinale Tremblay: quaranta voti.  The Canadian bows his head and places his hands   together, as his colleagues twist in their seats to examine the new front- runner. CARDINAL LOMBARDI   (CONT’D) (Italian)  < Cardinal Tedesco, thirty- four votes. Cardinal Bellini, thirteen votes. Cardinal Lawrence, eleven votes. Cardinal Adeyemi, six votes... >  CARDINAL LOMBARDI   (CONT’D)  Cardinale Tedesco: trentaquattro voti. Cardinale Bellini: tredici voti. Cardinale Lawrence: undici voti. Cardinale Adeyemi: sei voti...  CONCLAVE by Peter Straughan - Pink Revisions. (27.01.2023) 77.",
      "characters": [],
      "action_text": "You can feel the electric tension in the room now - a staggering haemorrhage of Adeyemi’s followers. In a sea of scratching pencils, the Nigerian sits staring at the wall ahead, as if oblivious. CARDINAL LOMBARDI   (CONT’D) (Italian)  < Cardinal Benitez, four votes. >  CARDINAL LOMBARDI   (CONT’D)  Cardinal Benítez: quattro voti.  Lawrence sits, horribly aware of being an object of curiosity for the cardinals around him, who a re registering his increased share of votes. He can’t stop himself looking to Bellini and finds the cardinal’s cold gaze upon him. LOMBARDI (Italian)  < My brothers, that concludes the fifth ballot. No candidate having achieved the necessary majority, we shall resume voting tomorrow morning. >  LOMBARDI  Fratelli, qui si conclude il quinto scrutinio. Poiché nessun candidato ha ottenuto la maggioranza nece ssaria, le votazioni riprenderanno domani mattina.  INT. SISTINE CHAPEL - VESTIBULE - EVENING 89   89 The chapel has emptied. O’Malley bundles the ballots into the stove and burns them. He crosses the vestibule and turns to where Lawrence sits in the chapel, lost in thought, picks up his clipboard of notes. LAWRENCE (Noticing) Yes, Ray? MONSIGNOR O’MALLEY The incident this morning, your Eminence. I have more   information, if...? Lawrence considers, finally shakes his head. LAWRENCE No, Ray. I too must be shielded from any knowledge which could act as an... interference   in the process of this Conclave. MONSIGNOR O’MALLEY (Bowing) Of course, Eminence. CONCLAVE by Peter Straughan - Pink Revisions. (27.01.2023) 78. LAWRENCE Anything else? O’Malley glances at his clipboard. MONSIGNOR O’MALLEY Uhh...Oh, Cardinal Benitez. His health problems? He was issued with a return ticket to Geneva, paid for from the Pope’s own account. I checked the visa application. The purpose for travel was given as “medical treatment.” Anyway, whatever it was, it can’t have been serious. The tickets were cancelled. He never went. Lawrence   nods, barely listening. LAWRE",
      "dialogue_count": 0,
      "word_count": 1557
    },
    {
      "scene_number": 10,
      "slugline": "INT. CASA SANTA MARTA - UPPER CORRIDOR - NIGHT 93   93 A door opens a little and Benitez peers cautiously out at us, his open cassock clutched together at his throat. BENITEZ Your Eminence? Lawrence is a little taken aback by Benitez’ wariness. LAWRENCE I’m sorry to disturb you. May I have a word? BENITEZ Of course. One moment. To Thomas' surprise, Benitez disappears back into the room, leaving him standing in   the corridor. After a moment he reappears, clothed now. BENITEZ   (CONT’D) (Ushering him in) Excuse me, at this time of day I always try to meditate for an hour... INT. CASA SANTA MARTA - BENITEZ ROOM - CONTINUOUS 94   94 Lawrence takes in the room - identical to his own, except for a few lit candles here and the bathroom beyond. BENITEZ (Apologetically) In my travels I became used to not always having electricity. Now   I find it helpful when I pray alone. LAWRENCE (Politely) I must see if it helps me. BENITEZ Yes. Your difficulty with prayer. He watches Lawrence, the same keen gaze. Lawrence nods. CONCLAVE by Peter Straughan - Pink Revisions. (27.01.2023) 84.",
      "characters": [],
      "action_text": "BENITEZ   (CONT’D) (Gently) If I may say... sometimes I find, instead of speaking, I have to become silent. And in the silence wait for God to be heard. For a moment Lawrence feels affronted - is he, the Dean, to be given lessons in prayer now? But he fights it down. LAWRENCE Yes. I’m sure you’re right. BENITEZ Excuse me... He sits and starts to tie his shoes. LAWRENCE The other night you were kind enough to say yo u had voted for me. I don’t know if you’ve continued to do so, but if you have I would like to repeat my plea to you to stop. BENITEZ Why? LAWRENCE First, because I lack the spiritual depth to be Pope. And secondly I can’t possibly win. A long drawn out Conclave would be seen by the media as proof that the Church is in crisis. BENITEZ You have come to ask me to vote for Cardinal Tremblay? LAWRENCE Yes. A nd to urge your supporters to do the same. BENITEZ Cardinal Tremblay has already spoken to me about this. LAWRENCE (Bitterly) I’m sure he has. CONCLAVE by Peter Straughan - Pink Revisions. (27.01.2023) 85. He regrets his tone instantly. Benitez studies him solemnly. BENITEZ You want me to vote for a man you see as ambitious? LAWRENCE I do not want to see Tedesco as Pope. He would take the Church back to an earlier era. BENITEZ I’m sorry. I cannot vote for a man unless he is the one I deem most worthy to be Pope. And for me, that is not Cardinal Tremblay. It is you. Lawrence strikes the side of his seat in   frustration. LAWRENCE I don’t   want   your vote! Benitez stares back at him calmly, and once more Lawrence senses a surprising strength of character in this frail man. BENITEZ (Calmly) Never the less, you have it. He walks towards the bathroom, blowing out a few candles. Lawrence watches for a moment and then sighs. He wets thumb and forefinger and snuffs out the candle beside the bed. As he does he stares, distracted, at the little razor, out of place in the bedroom, still in its cellophane wrapper. And wonders why he has noted this. OMITTED 95   95 ",
      "dialogue_count": 0,
      "word_count": 1843
    },
    {
      "scene_number": 11,
      "slugline": "INT. PAPAL CORRIDOR - CONTINUOUS 103B   103B SISTER AGNES is walking down the corridor. She slows, seeing the broken seals of the papal suite and the light showing beneath the door. She stops at the door, listening. Then the LIGHT below the Papal Suite door switches off. INT. PAPAL SUITE - CONTINUOUS 103C   103C Lawrence stands by the light switch in the darkness, practically holding his breath - aware that someone is ju st on the other side of the door. INT. OUTSIDE THE PAPAL SUITE - CONTINUOUS 103D   103D SISTER AGNES hesitates, her hand on the door handle, considering who the intruder could be. And suddenly she is certain that it is Lawrence on the other side of the door. A strange moment of connection. Then TWO NUNS cross the corridor behind her, deep in conversation in Italian, breaking the silence. Agnes straightens up again and walks on down the corridor. INT. PAPAL SUITE - CONTINUOUS 103E   103E Lawrence waits in the dark, listening to her footsteps recede. Then he switches the light back on. INT. PAPAL BEDROOM - MOMENTS LATER 104   104 Lawrence enters, silhouetted in the door frame. The bed has been strippe d. He opens the wardrobe   - a simple closet that has been emptied of everything except two ghost-like cassocks that hang from the rail. The sight of them makes his heart ache. He turns to the bedside cabinet, kneels carefully and checks the small drawer, but it’s empty. On top of the cabinet lie the late Pope’s spectacles and alarm clock, just as they were on the night the pope died. CONCLAVE by Peter Straughan - Pink Revisions. (27.01.2023) 92.",
      "characters": [],
      "action_text": "The sight of them finally undoes Lawrence and leans his elbows on the bed, his face in his hands, and is wracked by a fit of dry sobbing. Finally, he opens his eyes again, bleakly accepting that he has given in to a fit of paranoid madness. He is about to stand again when he finds himself staring at the headboard with it’s pitifully frayed edge, the crack in the wood, as if some implement had been forced into the join... He reaches out a hand and pulls at the bottom corner of the padded head-piece. It resists. With both hands now he pulls harder, grunting with the effort... The headboard inches out from its frame. The material on the inside edge, normally hidden, has a frayed six inch slit down it. Tentatively Lawrence slips his fingers into the padded interior. When he withdraws them he his holding several FOLDED SHEETS OF PAPER. INT. CASA SANTA MARTA - UPPER CORRIDOR - NIGHT 105   105 Bellini opens his door and blinks at Lawrence. INT. CASA SANTA MARTA - BELLINI’S ROOM - NIGHT 106   106 Lawrence stands sipping a glass of water. Bellini sits on the bed, reading the sheets of paper. LAWRENCE It’s the report on   the activities of Tremblay. It’s an overwhelming prima facie case that he is guilty of simony - an offence that is stipulated in the Holy Scripture as... BELLINI (Reading) I am aware of what simony is, thank you. LAWRENCE He only obtained all those votes on the first ballot because he bought them. Cardenas, Diene, Figarella, Baptiste... (MORE) CONCLAVE by Peter Straughan - Pink Revisions. (27.01.2023) 93. And all of this done in the last twelve months when he must have guessed the Holy Father’s pontificate was coming to an end! BELLINI (Of the papers) How do you know they didn’t use this money for completely legitimate purposes? LAWRENCE Because I’ve seen their bank statements. BELLINI Dear God. Lawrence finds himself staring down at the small plastic CHESS SET which Bellini had taken from the Pope’s apart ment; the pieces still grouped in the unfinished fin",
      "dialogue_count": 0,
      "word_count": 1193
    },
    {
      "scene_number": 12,
      "slugline": "INT. CASA SANTA MARTA - DINING ROOM - MORNING / LATER 110   110 The dining room is now full, the buzz of excited conversation. Cardinals turn in their seats to stare at Lawrence who sits, impassive, feeling strangely calm. Sabbadin appears in front of him, tosses the report on the table before him. CARDINAL SABBADIN (Hissing) You have wasted this report! We could have used it to control Tremblay after he was   elected Pope. All you have done is strengthen Tedesco. He walks away before Lawrence can reply. Benitez sits at the table beside him with bread and fruit. BENITEZ You should eat Dean. Lawrence stares blindly at the food. LAWRENCE Did I do the right thing, Vincent? BENITEZ No one who follows their conscience ever does wrong, Your Eminence. The room falls suddenly silent as Tremblay appears, hair immaculate , chin jutted. He strides towards Lawrence. TREMBLAY (Loudly) You are responsible for this I believe? LAWRENCE No, Your Eminence. You are. TREMBLAY (For the room) This report is entirely mendacious! It would never have seen the light of day if you had not broken into the Holy Father’s apartment to remove it! CONCLAVE by Peter Straughan - Pink Revisions. (27.01.2023) 97.",
      "characters": [],
      "action_text": "LAWRENCE (Calmly) If the report is mendacious then why did the Holy Father, in his last official act as Pope, ask you to resign? A stir of amazement from the listening CARDINALS. TREMBLAY He did no such thing! As Monsignor Morales, who was at the meeting will confirm. LAWRENCE And yet Archbishop Wozniak insists that the Holy Father told him personally of the conversation... TREMBLAY (Over) The Holy Father -   may his name be numbered among the high priests - was a sick man towards the end of his life as those of us who saw him regularly will confirm! TEDESCO (Standing, Italian)  < If someone else may be allowed to join this dialogue - the names of eight cardinals have been blacked out. I assume the dean can tell us who they are? Let them confirm, here and now, whether Cardinal Tremblay requested their vot es in return for the payment. >  TEDESCO (Standing)  Se è possibile aggiungere qualcun altro a questa conversazione... i nomi di otto cardinali sono stati oscurati. Immagino che il Decano possa dirci chi sono? Lasciamo che siano loro a confermare, qui ed ora, se il Cardinal Tremblay ha richiesto i loro voti in cambio di soldi.  LAWRENCE (Beat) No. I won’t do that. Uproar. LAWRENCE   (CONT’D) (Almost drowned by the comm otion) Let each man examine his conscience, as I have. (MORE) CONCLAVE by Peter Straughan - Pink Revisions. (27.01.2023) 98. I have no desire to create bitterness in this Conclave and will be happy to stand down as dean... More uproar. At his table, Bellini watches his old friend standing alone in the storm of voices, conflicted whether he should come to his aid, when... SISTER AGNES (O.S.) Your Eminences... Your Eminences... Gradually the words cut through and the cardinals turn to stare at the small, resolute figure of Si ster Agnes standing in their midst. A silence falls, perhaps out of shock at her presumption. SISTER AGNES   (CONT’D) Eminences, although we Sisters are supposed to be invisible, God has nevertheless given us eyes and ears. I know",
      "dialogue_count": 0,
      "word_count": 689
    },
    {
      "scene_number": 13,
      "slugline": "INT. CASA SANTA MARTA - PRAYER ROOM - MORNING 111   111 Lawrence kneels in prayer. He looks up as Bellini kneels beside him. A beat. BELLINI (Wryly) We seem to be running out of favourites. LAWRENCE You should take over the supervision of this election, Aldo. BELLINI Ha! No, thank you. You are steering this Conclave. Exactly   where   I do not know, but you are certainly steering it. And that firm hand of yours has i ts admirers. (Beat) I’ve come to ask your forgiveness. Surprised, Lawrence looks at him. BELLINI   (CONT’D) I had the temerity to tell you to examine your heart, when all the time my own was... He shakes his head. BELLINI   (CONT’D) Shameful to be this age and still not know yourself.  (A rueful smile)  Ambition, “the moth of holiness.” (Beat) Perhaps it’s time you decided upon a name? Lawrence stares at him. BELLINI   (CONT’D) As the next   most senior member of the Conclave, it will fall to me to ask you how you wish to be known as Pope. Rightly or wrongly, it would seem Tremblay is finished. This will be a contest between Tedesco and you. You’re the only one who can stop him now. CONCLAVE by Peter Straughan - Pink Revisions. (27.01.2023) 100.",
      "characters": [],
      "action_text": "The two old friends stare at each other. Then, as if admitting to himself for the first time that the thought, the  ambition , was always there... LAWRENCE John. I would choose John. Beat. Then Bellini nods. BELLINI It has a weight to it. OMITTED 112   112 INT. SISTINE CHAPEL - DAY 113   113 A BLANK BALLOT. Lawrence stares at his own sheet, for the first time at a loss as to which name to write. He closes his eyes, hoping f or inspiration, some sign. Nothing comes. He opens his eyes, looks up... And finds Tedesco watching him. The Patriarch raises his eyebrows in amused complicity:   Just you and me.  Lawrence picks up his pen, feeling he no longer has a choice. Slowly he writes a name on the ballot. “Lawrence.” He stands and holding the ballot above his head, walks down the aisle to the waiting chalice, knowing he is a bout to sin. LAWRENCE (in Latin)  < I call as my witness Christ the Lord, who will be my judge, that my vote is given before God to the one who I think should be elected. >  LAWRENCE  Testor Christum Dominum, qui me iudicaturus est, me eum eligere, quem secundum Deum iudico eligi debere.  He holds the ballot over the chalice. Hesitates. Then he drops the ballot into the chalice. The explosion   is felt first as a ripple in the floor, a bass vibration throughout his body. Then the boarded windows are blasted in, raining glass down onto the chapel. For a moment Lawrence stands, stunned, wondering, almost hoping, that he is dead. Time slows. CONCLAVE by Peter Straughan - Pink Revisions. (27.01.2023) 101. For the first time bright morning light floods the former gloom of the chapel and Lawrence finds himself dwarfed and pitiful before Michelangelo’s vast fresco The Last Judgement. The work burns brilliantly before him, Christ dividing the Damned from the Saved... He turns again and finds the doors at the end of the vestibule beginning to open, screeching across the glass- strewn floor. INT. SISTINE CHAPEL - VESTIBULE - DAY 113A   113A Two SECURITY GUARDS",
      "dialogue_count": 0,
      "word_count": 2127
    },
    {
      "scene_number": 14,
      "slugline": "EXT. CASA SANTA MARTA COURTYARD - DAY 117D   117D   * Nun’s walk hurriedly past Cardinals standing in small groups   * having animated conversations   * EXT CASA SANTA MARTA COURTYARD - DAY 117E   117E   * Many Cardinals stand in small groups having animated   * conversations   * EXT CASA SANTA MARTA COURTYARD - DAY 117F   117F   * Three Cardinals have a hushed conversation. Dozens of other   * cardinals in the background do the same.   * EXT CASA SANTA MARTA   COURTYARD – SECOND FLOOR - DAY 117G   117G   * Two Nun’s look at someone below. Small groups of Cardinals   * continue their discussions.   * EXT CASA SANTA MARTA COURTYARD – SECOND FLOOR - DAY 117H   117H   * POV of Nuns looking at scores of Cardinals gathered below   * talking. Cardinal Benetiz sits alone on a bench with a   * sandwich as other Cardinals glance at him.   * EXT. CASA SANTA MARTA - PARKING - DAY 118   118 Lawrence sits alone, digest ing the contentious gathering, as a light drizzle of rain hits the pavement. Archbishop Mandorff quietly approaches. ARCHBISHOP MANDORFF The drivers aren’t ready, Your Eminence. Lawrence tears himself away from his thoughts. LAWRENCE Then we shall walk, Willi. CONCLAVE by Peter Straughan - Pink Revisions. (27.01.2023) 107A.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 206
    },
    {
      "scene_number": 15,
      "slugline": "EXT. VATICAN GARDENS - DAY 119   119 Lawrence leads the cardinals from the hostel. Overhead helicopters drone. Lawrence ignores them and opens up his umbrella. It has begun to rain. The mass of cardinals follow, walking in silence, a sea of white umbrellas crossing the gardens. A sense of silent solidarity. Bellini arrives beside Lawrence. He takes his arm in his. The two friends look at each other, united   again. They walk on. INT. SISTINE CHAPEL - DAY 120   120 The broken glass has been swept away. A faint breeze blows through the space where the windows were. Lawrence stands at the microphone. The beginning of what he senses will be the final ballot of the Conclave. LAWRENCE (Latin)  < O Father, so that we may guide and watch over Your Church, give to us, Your servants, the blessings of intelligence, truth and peace, so that we may strive to know Your will, and serve You with total dedication. For Christ our Lord... >  LAWRENCE  Ecclesiae tuae, Domine, rector et custos, infunde, quaesumus, famulis tuis spiritum intelligentiae, veritatis et pacis, ut, quae tibi placita sunt, toto corde cognoscant et agnita tota virtute sectentur. Per Christum Dominum nostrum.  From the assembled Conclave comes the low rumble o f “Amen.” ON LAWRENCE... ...sitting staring up at the painted ceiling high above. His gaze slips to the rows of cardinals, lingers a moment on Tedesco, Tremblay, Adeyemi, Benitez, Bellini... He feels a sudden wave of love for them all, in all their imperfection:  the crooked timber of humanity...  From outside comes a strange, soft sound - the rise and fall of an immense wave. The cardinals raise thei r heads, listening, puzzled, until they realise: it is the sound of tens of thousands gathering in St Peter’s Square. Droplets of water are trickling through the shattered windows, and down the stone walls. CONCLAVE by Peter Straughan - Pink Revisions. (27.01.2023) 108.",
      "characters": [],
      "action_text": "Lawrence watches the raindrops for a moment. Then he picks up his pen. His mind feels suddenly calm, clear. A moment of grace. He begins to write. INT. SISTINE CHAPEL - MONTAGE - DAY 121   121 ...ballots fall into the waiting urn.... ...the ballots are pierced by the needle, threaded on the scarlet strand. ...the hands of the Scrutineers take ballots from the urn and pass it along... ...the white cloth is smoo thed over the table, the final urn of counted votes is placed at its centre, ready for the announcement... Still in SLO-MO, the cardinals rise, one by one to their feet, applauding... A crowd of cardinals are gathered around someone, their backs to us. We PUSH slowly through the crowd, which parts for us, until we reach the cardinal at the centre, the only seated man in the chapel... Benitez. Lawren ce, having reached him, stares down at the slight figure. LAWRENCE (Latin)  < In the name of the whole College of Cardinals, I ask you, Cardinal Benitez, do you accept your canonical election as Supreme Pontiff?>  LAWRENCE  Acceptasne electionem de te canonice factam in Summum Pontificem?  Benitez, as if he hasn’t heard, continues to stare down at his feet, his face obscured by a tumbling lock of black hair . A long silence, a collective holding of fearful of breath. If he should refuse... LAWRENCE   (CONT’D) (Latin)  < Do you accept? >  LAWRENCE   (CONT’D)  Acceptasne electionem de te canonice factam in Summum Pontificem?  At last Benitez raises his head and stares at Lawrence. CONCLAVE by Peter Straughan - Pink Revisions. (27.01.2023) 109. BENITEZ (Latin)  < I accept. >  BENITEZ  Accepto.  A murmur of relief, of pleasure, erupts around them. Lawrence smiles, pats his heart to indicate his own relief. LAWRENCE (Latin)  < And by what name do you wish to be called? >  LAWRENCE  Quo nomine vis vocari?  Benitez stands. BENITEZ (Latin)  < Innocent. >  BENITEZ  Innocentius.  A moment of silence. No Pope has derived a title from one of the virtues for generations. The n ",
      "dialogue_count": 0,
      "word_count": 2127
    },
    {
      "scene_number": 16,
      "slugline": "EXT. STREETS IN ROME - EVENING 130   130 Deserted streets in this ancient city. A newspaper in the gutter. An abandoned car on the corner. Next to it an old statue in crumbling marble under the steady stream of a fountain. I/E. SHOP - STREET NEAR VATICAN - EVENING 130A   130A The store with the PLASTIC PIETÀS from the beginning. And suddenly there is Cardinal Lawrence, suitcase in hand, resting his gaze on the small   statues. Then he heads down the street and disappears around the corner. We HOLD on the display, the Pietàs, the compassion of the WOMAN cradling the Man of Sorrows. INT. SALE E TABACCHI - EVENING 131   131 A near-empty bar in a small café. On the counter a cold espresso that someone didn’t have time to finish. Behind it, in the background, the faint flicker of a TV. The screen shows the balcony of St. Pet er. The red shape of a Cardinal steps through the curtains. CARDINAL BROTZKUS  Annuntio vobis gaudium magnum. Habemus Papam!  A small figure in a white cassock steps out next to him, bowing his head in humble submission. And now we hear it, the roar rising to a deafening volume, the sounds of distant celebrations coming through on the TV.  THE END  CONCLAVE by Peter Straughan - Pink Revisions. (27.01.2023) 117.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 222
    }
  ]
}