{
  "slug": "constantine-102-the-darkness-beneath-2014",
  "title": "constantine 102 the darkness beneath",
  "genre": "thriller",
  "format": "series",
  "scenes_count": 4,
  "characters_count": 4,
  "characters": [
    "BETH",
    "ZED",
    "CONSTANTINE",
    "THAD"
  ],
  "total_words": 11589,
  "total_dialogue": 6,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. LOFT - MORNING 5   5 CLOSE ON AN ARTIST’S FEMININE HAND -- drawing with charcoal. With some intensity.   An impressionistic rendering of John Constantine.   His expression quiet and contemplative. EXT. HEDDWICH - MAIN STREET - DAY 6   6 CLOSE ON John’s face, bearing a similar contemplative look to the one in the drawing.   WIDEN to reveal John walking down the sidewalk of a small main street. John takes in a town that’s barely holding on.   Shops closed and boarded up.   Grim faces on PASSERSBY. INT. LOFT - DAY 7   7 THE HAND continues to draw John, filling out his body, which is walking, backlit by rising sun.   SLOWLY WIDEN to reveal -- THE ARTIST (from the end of Episode 102).   Dressed in a long man’s shirt and shorts.   Seated on a stool.   We’re seeing her fully for the first time.   Her name is ZED MARTIN, mid-20s, Latina, a face full of spirit and intelligence and innate curiosity.   She’s drawing almost by compulsion. EXT. HEDDWICH - MAIN STREET - DAY 8   8 John continues down the sidewalk and slows down, because headed his way he sees -- A CASKET.   Carried by a cluster of MINERS.   Moving somberly down the middle of the street.   We’re looking straight ahead at John, with the casket passing between us and him.   It’s a perfect John Constantine image and a very close match to -- INT. LOFT - DAY 9   9 Zed’s drawing, further along now.   It’s a charcoal rendering of the SAME SCENE -- Constantine staring at a casket passing in front of him.   There’s no distinct background, just John, a casket, and mourners. CONSTANTINE - Ep. 103 - Lavender - 8/5/14   4. (CONTINUED)",
      "characters": [],
      "action_text": "Zed pauses.   Considers the drawing, addresses the image of John in her drawing. ZED You’re really starting to piss me off. Unhappy, she tears off the paper, crumples it, and drops it into an overflowing TRASH CAN.   She lifts the heavy plastic bag from the can, grabs her purse, and heads out, walking past a VAST COLLECTION of John Constantine DRAWINGS AND PAINTINGS. EXT. HEDDWICH - MAIN STREET - DAY 10   10 John curiously follows the casket procession, hanging back a respectful distance. INT. STAIRWELL - DAY 11   11 Zed hustles down a set of stairs leading out of her loft, trash bag ripped and beginning to slip. EXT. HEDDWICH - MAIN STREET - DAY 12   12 John watches the mourners carry the casket into the door of a pub ahead.   He picks up his step to join them, when a door in front of him bursts open and -- WHAM!   John collides with Zed, knocking the heavy bag out of her hands, spilling trash around them.   John rubs his scalp, semi-obscuring his face.   Zed kneels to gather the refuse, embarrassed. ZED I’m so sorry.   I was in a rush. The bag was splitting. CONSTANTINE As is my head. John sees Zed -- not too bad on the eyes.   Decides to join her in policing the debris. CONSTANTINE (CONT’D) Apologies are mine, luv.   Let’s get you sorted -- if there’s one thing I know my way around, it’s rubbish. CONSTANTINE - Ep. 103 - Yellow - 7/23/14   5. CONTINUED: 9   9 (CONTINUED) As John heaves a handful into a nearby trash can, Zed glances at him for the first time and recognizes... the man from her drawings.   She stops and stares in disbelief.   Awe. ZED It’s... him.   You’re   you.  CONSTANTINE That observation always ends the same way -- and it’s never in my favor. John comes upon a crumpled sketch of Zed’s.   Smooths it out. It’s a CLOSEUP SKETCH of his face.   Ciggie in lips.   Like a charcoal mirror.   John tilts his head, studies it, surprised. Zed reaches for his face, overwhelmed. ZED I can’t -- I don’t -- I dream of you.   I had no idea who you were... I starte",
      "dialogue_count": 0,
      "word_count": 1767
    },
    {
      "scene_number": 2,
      "slugline": "INT. MINE - DEEPEST DIG AREA - DAY 16   16 As John moves deeper into the abysmal depths, the mine shaft grows NARROWER.   The ceiling LOWER.   The walls ROUGHER, dug by shovels and picks.   There are few support beams here and RIVULETS OF WATER trickle down in spots.   It’s intensely claustrophobic and every fiber of our being is screaming to turn tail and run. As his flashlight illuminates patches of the pitch black shaft, John catches MOVEMENT among the SHADOWS on the edges of his vision.   But when he turns -- nothing is there.   And then John reaches -- THE END.   Literally.   The deepest bowel of the mine.   John places his hand over the WORKING FACE, where the new coal is cut.   Feeling for... what?   Oddly, he leans forward and places his ear against the wall, listening.   Silence. Looking around, John spots a HAND PICK.   He turns the pick around, grasping the wood handle, and TAPS THE BUTT of the handle against the mine wall.   Three times.  Knock .   Knock .   Knock . He waits a beat.   A tense beat.   And then -- KNOCK!   KNOCK!   KNOCK! It’s distant, subterranean, but magnified by rock and booming in volume and the narrow shaft trembles, dislodging DUST AND DEBRIS, which falls on John’s head. Without a second’s thought, John does what we wanted to -- he turns tail and runs for safety under a shower of BILLOWING DUST. CUT TO BLACK.  END OF TEASER  CONSTANTINE - Ep. 103 - Pink - 7/23/14   11.",
      "characters": [
        "BETH",
        "ZED"
      ],
      "action_text": "ACT ONE  FADE IN: EXT. LANNIS’ HOUSE - DAY 17   17 The front door is open, a steady stream of somber MOURNERS arriving.   CLOSE ON a parade of HOMEMADE DISHES being carried into the house... and then a FROZEN ENTREE, the plastic wrap still on it, fresh from the market.   TILT UP to -- JOHN.   No trench coat.   He enters with his head bowed, less out of respect and more to avoid drawing attention.   John shuffles into the house with the others. INT. LANNIS’ HOUSE - LIVING ROOM - DAY 18   18 Mourners cluster in small groups, paper plates in hand. Keeping his head down, John makes his way toward the stairs. Along the way, John passes a cluster of old framed FAMILY PHOTOS.   Generations of miners.   Haunted eyes peeping out from coal-masked faces.   John lingers on these photos a moment, drawn to his own past.   Then he spots -- YELLOW TAPE across the entrance to the hallway, with Beth’s handwritten note:   PRIVACY PLEASE.   Glancing around to make sure nobody is watching, John ducks under the tape and heads down the hall. INT. LANNIS’ HOUSE - BATHROOM - DAY 19   19 As John enters the bathroom, he spots a COAL HANDPRINT on the door frame.   Curious.   John steps into the room.   Grimaces. The shower area shows the devastation of the flaming nozzle. SMOKE DAMAGE on the walls and ceiling.   John eases closer. The shower floor is horribly scorched, except TWO OUTLINES where Lannis’ bare feet stood.   John considers this, then turns his head to look up at the showerhead.   As he watches, a single DROP OF BLACK LIQUID rolls out. It quickly dawns on John that this may not be the smartest move, and he wisely pulls his face from the nozzle’s path, just in case. John studies the nozzle from the side.   He gingerly unscrews the showerhead, lifts it away, and runs his finger over the screen inside of the pipe.   Comes away with -- SLURRY on his finger tip.   Looking around, John grabs an ASPIRIN BOTTLE from the counter, pours the pills down the sink, scrapes the sample of slurry f",
      "dialogue_count": 2,
      "word_count": 4609
    },
    {
      "scene_number": 3,
      "slugline": "EXT. QUARRY / INT. SUV - DAY 28   28 A parking area surrounded by mining vehicles and equipment. With the drama down at the mine, nobody is around.   Owen enters his SUV and closes the door.   As he puts the keys in the ignition, the passenger door opens and John sits down. OWEN If Thad catches you here -- CONSTANTINE Men are dying in your mine. OWEN Five years ago, Heddwich was dead. NorPenn saved this town.   They said the mine was tapped out but we gave it new life. CONSTANTINE Because you’re a rogue operation. Digging unauthorized tunnels into regions of the earth where mortal man has no rightful place. OWEN How would you know? CONSTANTINE Been down there, mate.   Seen your shoddy supports with my own eyes. Only that’s the least of your worries now. Owen stares at John, truly afraid. OWEN It’s true, isn’t it?   What the miners are saying?   They hear sounds. CONSTANTINE And they’re gonna keep hearing ‘em and good men are gonna keep dying till you shut down the mine. OWEN Mr. Bowman will never go for that. CONSTANTINE It’s the only way to stop the dying. Abruptly, the DOORS LOCK.   All at once.   By an unseen hand. CONSTANTINE - Ep. 103 - Pink - 7/23/14   30. (CONTINUED)",
      "characters": [
        "CONSTANTINE",
        "THAD"
      ],
      "action_text": "Zed moves to the SUV and looks in as the receding slurry reveals Owen’s head, his mouth agape, oozing BLACK SLUDGE. Zed looks to John and shakes her head.   Too late. FADE OUT.  END OF ACT TWO  CONSTANTINE - Ep. 103 - Pink - 7/23/14   32. CONTINUED: 29   29 ACT THREE  FADE IN: EXT. HEDDWICH - MAIN STREET - DAY 30   30 John and Zed trudge into town along the sidewalk.   Both are mired in SLUDGE, making them a gawk-worthy sight for LOCALS. CONSTANTINE Don’t torture yourself over it. There was nothing we could do for the blighter.   And trust me, we don’t want to stick around and get involved in a police investigation. ZED I still don’t understand.   What was that inside the car? CONSTANTINE The price of doing business with yours truly.   I tried to warn you. ZED I know.   And I’m still here. John casts a sidelong glance at Zed.   Indeed, this girl’s a gamer.   TWO OGLERS have stopped in front of them, staring. CONSTANTINE Move along.   Nothing to see. ZED So what’s going on? CONSTANTINE Back home our miners called ‘em  Coblynau , but you see ‘em in every culture.   They’re the spirits of dead miners.   They knock on walls before cave-ins to warn of danger. Zed has seen enough to be convinced this is all real.   But it is all very new to her. ZED So... these “Coblynau”... they’re protecting miners?   Warning them of trouble, not causing it? CONSTANTINE That’s right.   Traditional Coblynau never pop to the surface, and they certainly don’t murder. CONSTANTINE - Ep. 103 - Pink - 7/23/14   33. (CONTINUED) ZED What’s the explanation then? They reach Zed’s loft and stop. CONSTANTINE Could be the Rising Darkness. Something’s forcing evil to the surface in waves.   Changing up the rules.   But me?   I’m sensing the human touch. ZED Someone called these spirits on purpose. CONSTANTINE Nothing says payback like a demon assassin.   If I’m right, these bad boys were conjured by someone close by. ZED Like a miner maybe?   I heard them say they’re all gathering at the pub for an em",
      "dialogue_count": 3,
      "word_count": 3197
    },
    {
      "scene_number": 4,
      "slugline": "INT. MINE - WIDE SHAFT - LATER 35A   35A PAN a line of explosives set in the nooks and cranies of the mine walls, a twine of ELECTRICAL WIRES connecting them all. PAN continues to: John.   Smudged and sweaty from his labors.   Carefully setting the last explosive charge in place.   Then he connects the wires to a RADIO DETONATOR and switches it on. EXT. QUARRY - MINE ENTRANCE - DAY 36   36 John, coal smudged, exits the mine entrance, holding the REMOTE CONTROL of the radio detonator.   He is surprised to see -- Zed’s car pulling up.   She climbs out.   Her passenger door opens to reveal:   Ellis.   Zed indicates for Ellis to hang back, then she walks over to John. CONSTANTINE What’s he doing here? ZED (with a firm certainty) He should be here to see this. John isn’t too sure.   But -- what the hell. CONSTANTINE You did good.   Earlier.   With the Coblynau.   If I failed to mention. ZED At least I know what line of work you’re in now. CONSTANTINE - Ep. 103 - Cherry - 7/30/14   44. (CONTINUED)",
      "characters": [
        "CONSTANTINE"
      ],
      "action_text": "CONSTANTINE It’s not for everyone. ZED When I had my visions, painted you, I knew the darkness around you was real.   But to see it... CONSTANTINE So after this, you gonna find a quiet new town?   Take up still life? ZED Yeah, because I’m that kind of  chica bonita.  They look at each other.   It’s a charged moment.   Then John’s eye goes to the detonation device in his hand. CONSTANTINE We really don’t want to be standing here. EXT. QUARRY - ENTRANCE ROAD - DAY 37   37 The mine SEEN in the distance below.   John and Zed and Ellis stand on this entrance road carved into the granite face. John holds the detonator Remote Control.   Moment, then John places the Remote in the hands of Ellis, who looks up at John, genuinely surprised: CONSTANTINE Sometimes appeals of faith just take a little time to be answered. (beat) Care to do the honors? Ellis looks at John, unsure.   He looks to Zed, who gives a small nod of quiet assurance. Slowly, Ellis turns to face the mine.   The mine that stole his son.   He takes a deep breath... and PRESSES THE BUTTON. DOWN BELOW The mine entrance blows in a SPECTACULAR EXPLOSION OF FLAMES. The fireball billows.   A hail of rock rains into the water. It’s a brief but powerful and strangely beautiful spectacle. THE ENTRANCE ROAD Ellis can’t help but feel deep emotion right now.   Zed puts a comforting hand on him. CONSTANTINE - Ep. 103 - Cherry - 7/30/14   45. CONTINUED: 36   36 (CONTINUED) BETH Oh.   Well, in that case, I think you should meet my guests. John waits but Beth doesn’t move from the door. CONSTANTINE Are you going to let me in? BETH No need.   They’re right behind you. John turns to look behind him.   From the shadowy recesses of the porch and surrounding deck, COBLYNAU STEP FORTH.   Ten of them in all.   Haunting spectral men of death without faces. They converge until John and Beth are encircled. Beth reaches out and strokes one of them on the arm. BETH (CONT’D) Now.   You had news for me. Off John, trapped -- FADE TO BLACK. O",
      "dialogue_count": 1,
      "word_count": 2016
    }
  ]
}