{
  "slug": "constantine-101-non-est-asylum-2014",
  "title": "constantine 101 non est asylum",
  "genre": "horror",
  "format": "series",
  "scenes_count": 12,
  "characters_count": 2,
  "characters": [
    "CONSTANTINE",
    "LIV"
  ],
  "total_words": 13305,
  "total_dialogue": 3,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. PSYCHIATRIST’S OFFICE - CONTINUOUS 4   4 John sits in a chair opposite DR. HUNTOON, slab-faced, square glasses, clinical air.   Dr. Huntoon holds John's case file. CONSTANTINE That’d be a neat trick.   Let’s get to that part. DR. HUNTOON You can start by telling me what happened that night at Newcastle. Do you remember the killer? CONSTANTINE ‘Course I do.   I see that demon every time I close my eyes. DR. HUNTOON By demon, you mean murderer. CONSTANTINE By demon, I mean bloody demon. Foul creature.   Smelled like a slaughterhouse. DR. HUNTOON You see what’s happening, John? You feel guilty for being unable to protect the girl, so you turned her killer into the embodiment of evil. We’re all powerless against demons. CONSTANTINE Not all of us, chief. DR. HUNTOON That’s right, before you checked yourself in here three months ago, you were working as... (finds John’s CARD) An “Exorcist, Demonologist, and Master of the Dark Arts.” Dr. Huntoon regards John skeptically.   John, frowning, leans forward to peer at his card. CONSTANTINE Says “master,” does it?   I should change that to “petty dabbler.”   I hate to put on airs. DR. HUNTOON In any case, you wouldn’t have been able to prevent the girl’s death.  \"Constantine\"   2ND BLUE 7/9/14   2.  (CONTINUED)",
      "characters": [],
      "action_text": "CONSTANTINE Astra.   Her name was Astra.   I can deal with her death.   It’s her damnation that’s eating me alive. Dragged to hell.   Nine years old and suffering for all eternity. That’s on me, mate. DR. HUNTOON John, it’s time to face the truth. The only one suffering here is you. There are no demons -- John SMASHES his fist on the coffee table, rattling the doctor’s tea, causing him to pull back in mild alarm. CONSTANTINE So you keep telling me -- now make me believe.   It's what I'm paying you for, isn’t it? John stares intensely at his unnerved doctor. INT. COMMON ROOM - NIGHT (N/1) 5   5 During Closure Group, a DOZEN PATIENTS sit in a semi-circle of card chairs, reviewing their daily goals.   At the moment, a NERVOUS MAN, 30, stands talking with a mug of tea. NERVOUS MAN My goal today was to break my worry rituals.   Like, I stir my tea nine times.   Then I have nine minutes to drink.   Nine sips in nine minutes. As the Nervous Man drones, find John seated in back, bored. He notices a lone COCKROACH scurrying across the wall close by.   John’s eyes idly follow the roach out to the hallway. NERVOUS MAN (CONT’D) Everything in multiples of nine. It keeps bad things away.   But today I let go of my rituals and... nothing terrible happened.   I only stirred this tea once. He proudly holds up his cup.   As the Patients APPLAUD, John spots a SECOND COCKROACH on the ground, heading the same way. Frowning, he rises from his seat and slips into the -- INT. HALLWAY - CONTINUOUS 6   6 Where he finds a DOZEN COCKROACHES emerging from the walls and woodwork and scuttling in the same direction.   With a knowing concern, John heads that way.  \"Constantine\"   2ND BLUE 7/9/14   3.  CONTINUED: 4   4",
      "dialogue_count": 0,
      "word_count": 517
    },
    {
      "scene_number": 2,
      "slugline": "INT. STAIRWELL - CONTINUOUS 6A   6A John follows the cockroaches up a set of stairs. INT. ART THERAPY ROOM - CONTINUOUS 7   7 The cockroaches all flow into a dramatic room with a high ceiling and a MASSIVE GOTHIC WINDOW engulfing the far wall. Easels, work tables and art supplies fill the space. John enters the room to see the back of a beautiful patient, EMMA, late 20s, messily hand-painting the far wall under the window.   What she's painting isn't clear because COCKROACHES, hundreds of them, are converging on the wall around her. CONSTANTINE Ah, Miss.   Whatever you're painting there, you might want to stop now. Ignoring him, Emma feverishly continues working.   John steps around to discover her eyes are ENTIRELY WHITE, rolled back into her head -- she’s in the throes of spirit possession. CONSTANTINE (CONT’D) No... no.   This is not my problem. John, who checked himself into the hospital to forget such darkness exists, angrily turns and starts walking back the way he came.   Over his shoulder, Emma starts WHISPERING fiercely and rapidly in what might be German or Austrian. CONSTANTINE (CONT’D) Bloody hell. John reverses course back to Emma, still painting madly. John takes her shoulders and spins her around to face him. CONSTANTINE (CONT’D) I’m addressing the entity inside. Who are you?   Tell me your name. Emma stops whispering and a TEAR OF BLOOD drips from the corner of one eye.   John places a hand on her forehead. CONSTANTINE (CONT’D)  Hear my words, whoever you may be, all malevolent spirits, infernal invaders, wicked legions --  Abruptly, Emma’s body STARTS TO LEVITATE.   John throws his arms around her waist to hold her down.   But Emma’s body begins to PITCH VIOLENTLY, flinging John to the ground.   On the easels, pages of drawing pads FLIP AND RIP into the air. John scrambles to his feet and raises a hand toward Emma.  \"Constantine\"   2ND BLUE 7/9/14   4.  (CONTINUED)",
      "characters": [
        "CONSTANTINE"
      ],
      "action_text": "As John strides out of the room, he walks past the Nervous Man, who’s now desperately stirring his cup of tea.  \"Constantine\"   2ND BLUE 7/9/14   5A.  CONTINUED: (2) 7   7 (CONTINUED) NERVOUS MAN ...seven, eight, nine. PUSH INTO the curious words on the wall... Liv Die. INT. ENDEAVOR RENT-A-CAR OFFICE - NIGHT 8   8 CLOSE ON a desktop NAMEPLATE that says: LIV ABERDINE.   A Windex bottle and a rag plop down, followed by LIV, a beautiful but disaffected twenty-something, waiting for her life to begin.   She joins her co-worker MAX eating Chinese. A wall SIGN behind them reads “ENDEAVOR RENT-A-CAR.” LIV Who has a brighter future?   Me or that Opera Lady in the food court? MAX Opera Lady.   No college loans to pay off.   Pass me a fortune cookie. Liv takes a cookie and hands it to Max, who opens it. LIV Doesn’t it ever bother you?   People have adventures in the cars they rent from us.   All we do is wash the windows and check for dents.   I want some dents. MAX (reading his fortune) “Failure is the opportunity to do better next time.” LIV “To do better next time -- in bed.” You always add “in bed” to the end. MAX Oh yeah?   Read yours. Liv grabs a cookie and opens it -- the paper has NO WRITING. LIV It’s blank.   Perfect, I have no future. MAX (sympathetic) Here, one more for the road.  \"Constantine\"   2ND BLUE 7/9/14   6.  CONTINUED: (3) 7   7 (CONTINUED) Max tosses her a COOKIE and heads out. MAX (CONT’D) See you in the morning.   Lock up. Liv looks at the cookie, debating, then pockets it.   As she clears her desk of take-out, CAMERA WIDENS to include a DESK LAMP in the foreground.   The lamp starts to FLICKER and BUZZ. EXT. ENDEAVOR RENT-A-CAR - NIGHT 9   9 Liv, backpack over her shoulder, locks the glass door on the way out and enters a code on a SECURITY KEYPAD.   As she heads to her car, HOLD on the keypad.   The screen says ***SYSTEM ARMED***.   After a beat, the WORDS FLICKER and BLINK OUT, then runic letters scroll across the screen:   xiqnfjkl . INT. HYUNDAI ",
      "dialogue_count": 1,
      "word_count": 1557
    },
    {
      "scene_number": 3,
      "slugline": "INT. SINKHOLE - NIGHT 14   14 John climbs into the sinkhole, a huge dirt pit with caved-in sides, slabs of collapsed asphalt and, oh yeah, a car pitched at an angle.   Investigating the area, John passes a ruptured gas line BILLOWING FLAMES, blackened and torn POWER CABLES. Then, an ominous BLACK SHADOW passes overhead.   Hearing the ruffle of HEAVY WINGS behind him, John straightens and turns to perceive a long, tall FIGURE obscured in the shadows. CONSTANTINE Whoever you are, I’m a nasty piece of work.   Ask anybody. The figure steps out of the darkness –- he’s a black man, soulful, dressed in monochromatic grays.   This is MANNY. MANNY You shouldn’t be down here. Manny looks over John.   Whether Manny is friend or foe -- or something in between -- is hard to determine. CONSTANTINE I could say the same for you.   You come to admire your handiwork? MANNY This wasn’t my doing.   What brings you back to the streets, John? John is surprised to hear his name.   He proceeds cautiously. CONSTANTINE A young lady.   What else?   I was asked to protect her by an old friend. MANNY A dead friend, more likely. CONSTANTINE Well he did have to possess a body, but he made his point.   Crudely. Who are you? MANNY You can call me Manny.   I’ve been asked to watch over you. CONSTANTINE Watch over? (off his serene look)  \"Constantine\"   2ND BLUE 7/9/14   10.  (MORE) (CONTINUED)",
      "characters": [],
      "action_text": "No offense, mate, but I’m not in the habit of slumming with angels. You’ll murder my reputation. MANNY So will a mental hospital. CONSTANTINE I checked out.   All better. (looks heavenward) You hear that?   I’m okay! (to Manny) So flap off. Manny steps closer, his words comforting, mesmerizing. MANNY You’re not okay, John.   You damned a girl to hell.   Along with yourself.   I can’t change your fate but I can ease your suffering. John notices Manny’s hand now lies on his shoulder.   It feels comforting, but with a force of will, John slaps it away. CONSTANTINE You’d like that.   All you beatific types are the same, like vampires. Go feed on someone else’s loss. MANNY But yours is exquisite. CONSTANTINE Don’t worry about me, chief.   I can handle a demon attack. MANNY Don’t be so sure.   You’ve been out of play a while.   There’s panic down here.   People can sense what’s on the way. CONSTANTINE What’s on the way? Manny reacts to the SOUNDS of APPROACHING SIRENS. MANNY We should go. CONSTANTINE Wait!  \"Constantine\"   2ND BLUE 7/9/14   11.  CONTINUED: 14   14 CONSTANTINE (CONT'D) (CONTINUED) MANNY’S POV:   John looks straight at us into camera.   We HEAR a FLUTTER and the CAMERA RISES, until we’re looking down at John from a height, accompanied by a mighty BEATING OF WINGS. CONSTANTINE (CONT’D) What’s on the way?! ANGLE ON John.   Manny’s SHADOW passes over him and he’s gone. As SIRENS GROW LOUDER, John starts climbing out of the hole. EXT. APARTMENT BUILDING - NIGHT 15   15 UNKNOWN POV:   We’re peering through bushes outside a modest apartment building.   On the street before us, a FIAT stops and parks.   Liv exits the passenger side and her neighbor TALIA, late 20s, pretty and perky, exits the driver’s side. TALIA ...It was no problem.   I work five minutes away from you. LIV Thanks, Talia.   I really appreciate the ride. The girls head up a walkway straight toward us.   We PULL BACK into our hiding place in the bushes.   Through leaves, we see Talia, in arm’s reac",
      "dialogue_count": 0,
      "word_count": 1049
    },
    {
      "scene_number": 4,
      "slugline": "INT. APARTMENT HALLWAY - NIGHT 20   20 The unknown presence faces the occult symbol on Liv’s door. TILT DOWN to reveal a LINE OF SALT across the doorway.   The presence PIVOTS 180 degrees to Talia's door, directly across the hall.   No symbol.   TILT DOWN.   No salt.   With a WHOOSH, the presence PUSHES through the door. INT. MILL - NIGHT 21   21 Inside, John finds vestiges of a thriving cocaine operation -- tables with drug-packaging paraphernalia, diluting solution, digital scales, a steel press, grinders and razors.   Half a dozen kilos of cocaine and piles of cash are in evidence. CONSTANTINE Coming ready or not. John rounds a corner to find PAPA MIDNITE, 30s, an imposing Cuban with a zig-zag beard and dirty white suit.   Normally, Midnite would be the alpha in any room, but right now he’s drained and exhausted, standing weakly with one hand on an IV stand, and the other holding an ORNATE RIFLE pointed at John. PAPA MIDNITE Damn, Constantine.   Almost shot you.   I should shoot you. CONSTANTINE Papa Midnite.   You’re looking a bit knackered.   What’s with the boomstick? PAPA MIDNITE Ace of Winchesters.   Works on ‘infernal’ types.   Cost me two- hundred grand. (then, suspicious) Who let you in here? CONSTANTINE Your men are scared.   I couldn’t help but notice the sacrifices outside. John’s eyes sweep the area, which looks like a cross between a makeshift hospital room with monitors, and a botánica with statuaries and dozens of lighted religious candles, the only light in the room.   Papa Midnite, real jittery, idly taps his head with the gun, talking more to himself than John. PAPA MIDNITE Gotta stay awake. John moves closer to examine the IV bag connected to his arm.  \"Constantine\"   2ND BLUE 7/9/14   14.  (CONTINUED)",
      "characters": [],
      "action_text": "CONSTANTINE What’s this?   Cocaine? PAPA MIDNITE Can’t fall asleep. CONSTANTINE Why?   What’ll happen if you do? Papa Midnite desperately grabs John by the coat. PAPA MIDNITE You can’t feel it, Constantine? That psych ward dull your senses? Constantine shrugs him off. INT. LIV’S BEDROOM - NIGHT 22   22 We HEAR John and Papa Midnite keep talking, as Liv prepares for bed.   When she lifts her jacket from the bed, the fortune cookie from earlier falls out of the pocket onto the sheets. CONSTANTINE (V.O.) I heard something bad’s on the way. Must be true.   I never seen you like this, Midnite. PAPA MIDNITE I think it’s time you go. CONSTANTINE Let’s not have any aggravation.   We can help each other here.   A small exchange of information. Curious, Liv sits on the bed and opens the cookie.   CLOSE on the FORTUNE.   It says: “TRUST HIM.”   Liv stares in wonder. INT. TALIA’S APARTMENT - NIGHT 23   23 Talia sits curled on her couch, checking e-mails on her laptop.   We continue to hear John speaking. CONSTANTINE (V.O.) I was on the job tonight.   Had a run-in with a celestial type.   He seemed almost as spooked as you. Now I know you dream the future, so why don’t you tell me what you’ve been seeing? The SCREEN starts to FLICKER and DISTORT.   Talia frowns.  \"Constantine\"   2ND BLUE 7/9/14   15.  CONTINUED: 21   21",
      "dialogue_count": 0,
      "word_count": 518
    },
    {
      "scene_number": 5,
      "slugline": "INT. MILL - CONTINUOUS 24   24 John finishes his story to Papa Midnite.  \"Constantine\"   2ND BLUE 7/9/14   15A.  (CONTINUED)",
      "characters": [],
      "action_text": "PAPA MIDNITE I’m not dreaming nothing, ‘cause I’m not closing my eyes.   Hired a medical doctor to keep me awake. CONSTANTINE Yeah?   Where is he? Papa Midnite points to a previously unnoticed DEAD DOCTOR lying in a pool of blood in a dark corner of the room. PAPA MIDNITE  Cabron   let me nod off. CONSTANTINE What do you see when you sleep? Papa Midnite rolls his IV to John, aiming the rifle at him. PAPA MIDNITE What do you care?   It’s not happening to you! CONSTANTINE What’s coming! PAPA MIDNITE Blackness.   Blackness and pain. It’s pulling me inside! He lowers the gun and sinks to a seat in anguish. INT. TALIA’S APARTMENT - NIGHT 25   25 We continue to HEAR Papa Midnite as Talia smacks her static- ridden laptop in frustration.   An IMAGE forms -- an EYEBALL OPENING.   It rotates to stare at Talia.   She pulls back, freaked.   Abruptly, a LIGHT BULB in the LAMP near her head POPS.   Talia turns, her eyes opening in terror. PAPA MIDNITE (V.O.) It’s pulling us all in!   There’s no place to run, Constantine.   It’s coming for us! CLOSE ON A WALL.   Talia's body FLIES INTO FRAME, smashing against the wall, breaking her neck.   She falls to the ground, her head contorted at an unnatural angle. CUT TO BLACK.  END OF TEASER \"Constantine\"   2ND BLUE 7/9/14   16.  CONTINUED: 24   24 ACT ONE  Fade in: INT. LIV’S BEDROOM - NIGHT (N/1 CONT’D) 26   26 Liv sleeps.   A glaring SPOTLIGHT washes over her face.   Liv stirs awake, shielding her eyes, and sits up.   Sounds like the sky is being torn asunder -- it’s a HELICOPTER. INT. APARTMENT HALLWAY - NIGHT 27   27 Liv, wearing a robe, opens the door to find the hallway busy with crime scene PERSONNEL.   A young, black ASSISTANT MEDICAL EXAMINER with a friendly face pushes a collapsible gurney past her doorway and into Talia’s apartment across the hall. At Talia’s door, a FORENSIC TECH dusts the frame for prints. LIV What’s going on? Liv steps closer and peers into Talia’s apartment in mounting horror to see a SMEAR OF BLOOD on the",
      "dialogue_count": 0,
      "word_count": 533
    },
    {
      "scene_number": 6,
      "slugline": "EXT. APARTMENT BUILDING - NIGHT 28   28 The Assistant M.E. slides the gurney holding the BODY BAG into the back of his VAN and slams the rear doors shut.  \"Constantine\"   2ND BLUE 7/9/14   17A.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 35
    },
    {
      "scene_number": 7,
      "slugline": "INT. CORONER’S VAN - NIGHT 29   29 As he drives, the Assistant M.E. HEARS a DULL THUMP from the back.   Odd.   Turning DOWN the RADIO, he hears a distinct THUMP-THUMP.   What the hell?   The Medical Examiner steers off the road and parks under a graffiti-riddled underpass. EXT. UNDERPASS - NIGHT 30   30 The Assistant M.E. hurries around the side of the van and opens the back door.   He reacts with shock at what he sees. HIS POV:   The BLACK BODY BAG holding Talia's body has broken free of its straps and THRASHES about -- literally, bashing against walls and tumbling about in a scary kinetic fashion. ASSISTANT M.E. Hold on!   Hold still and I’ll get you out of there! At the sound of his voice, the body bag reacts, holding eerily still.   The Medical Examiner enters the rear and starts to unzip the bag -- when the vehicle’s ELECTRICITY DIES, plunging the back of the truck into COMPLETE BLACKNESS. We can HEAR the Medical Examiner FUMBLING for the vehicle’s FLASHLIGHT.   Finding it, he switches on the flashlight and shines the BEAM on the bag -- to reveal it OPEN AND EMPTY. He turns and the flashlight’s beam falls on TALIA right beside him -- neck broken and dangling sideways, eyes MILKY AND WHITE.   As the young man SCREAMS, she grabs his face. EXT. UNDERPASS - CONTINUOUS 31   31 A violent head-shaped DENT appears in the side of the van, quieting the screams, followed by a SECOND DENT.   Silence. EXT. ENDEAVOR RENT-A-CAR LOT - MORNING (D/2) 32   32 An ATLANTA P.D. SEDAN pulls into the lot.   Liv exits, waving thanks, and the cop car departs.   Still extremely shaken, Liv heads to the office and notices a Yellow Cab parked nearby, with John leaning against the hood.   She walks over to him. CONSTANTINE You always carpool with the cops? LIV It’s been a long morning.   My friend was killed last night. CONSTANTINE I’m sorry to hear that.   She wasn’t the target.  \"Constantine\"   2ND BLUE 7/9/14   18.  (CONTINUED)",
      "characters": [],
      "action_text": "LIV Are you suggesting I’m the one who got Talia killed? CONSTANTINE No, that would be impolite. Constantine smiles -- which only infuriates Liv.   She holds out a PHOTO of the occult symbol on her cell phone. LIV (accusatory) I found this on my door.   What is it? CONSTANTINE The Eye of Horus.   It’s a symbol of protection.   Or so they say. LIV Well it didn’t work.   There was a man in my hallway last night.   I think he killed Talia. John taps on the cab roof behind him.   The door opens and the Tall Man steps out, unfolding his body.   Liv shrinks back. CONSTANTINE Liv, meet Chas.   My oldest mate. He didn’t kill your friend.   He made the carving that kept you safe.   Mine always look like wounded birds.   But Chas knows his way around a blade. Chas turns to Liv, with pathos in his eyes.   We’ll come to learn that Chas is compassionate and can be quite sensitive.  \"Constantine\"   2ND BLUE 7/9/14   19.  CONTINUED: 32   32 (CONTINUED) CHAS Don’t worry.   I learned my knife skills in culinary school. CONSTANTINE Oh how I missed your rack of lamb. CHAS (to Liv) I’m glad you’re safe. Chas returns to the driver’s seat and closes the door. CONSTANTINE Not a big talker, that one.   Now, down to business.   If we don’t get you somewhere safe, bodies will keep piling up -- Liv forces back the tears that threaten to consume her. LIV Why would anyone want me dead?   I’m a nobody. CONSTANTINE Hate to burst your bubble, but you ain’t a nobody.   I knew your father, Jasper Winters. LIV That’s not possible.   My dad died before I was born. CONSTANTINE Whoever told you that’s been lying. Jasper died just last year.   He was a good man, too. He reaches into his trench coat, retrieves a small VELVET SATCHEL, and holds it out for a tremulous Liv. CONSTANTINE (CONT’D) Open this.   It belonged to him. Liv takes the satchel, but before she can open it, they HEAR an ENGINE roaring down the street and turn to see the Medical Examiner’s Van speeding straight for the rental office. From ",
      "dialogue_count": 0,
      "word_count": 3482
    },
    {
      "scene_number": 8,
      "slugline": "INT. MAP ROOM - DAY 46   46 They descend a SPIRAL STAIRCASE into a massive stone-walled cavern transformed into living quarters full of MAGICAL TREASURES.   Liv’s tension relaxes as she gazes around. LIV This is insane.   You could survive a nuclear winter down here. CONSTANTINE Or start one.   Jasper used this place for divination.   No one could find trouble faster than your dad, literally. John takes down a leather-bound GRIMOIRE and starts flipping pages.   Liv curiously picks up Doctor Fate’s GOLD HELMET. CONSTANTINE (CONT’D) I’d put that down, luv, before it puts you down. Liv drifts over to a drafting table with a chimerical, hand- illustrated MAP OF ATLANTA.   The street names are normal, but not the locales: DAMNATION BAY, PANDEMONIUM, ILLUSION FALLS, SEVEN DEVILS, PHANTOM HILL. LIV This looks like a map of Atlanta, but what’s with these locations? Illusion Falls?   Phantom Hill? CONSTANTINE Jasper taught himself cartography. Started drawing his own maps, based on what he saw. LIV You said he could “find trouble.” CONSTANTINE It’s called scrying.   Hold your pendant over a map.   You’ll see. Liv does as he instructs.   John finds a passage in the book. CONSTANTINE (CONT’D) Ah, here it is.   Found the demon after you.   Goes by the name Furcifer.   The bloody angel was right.   The stakes are rising. Liv glances up.  \"Constantine\"   2ND BLUE 7/9/14   33.  (CONTINUED)",
      "characters": [
        "LIV",
        "CONSTANTINE"
      ],
      "action_text": "LIV What angel? CONSTANTINE Ah ah.   Eyes on the map. (reading book, worried) Furcifer draws strength from electricity.   It can manifest lightning and tempests.   That’s how it can control power lines -- even dead bodies. LIV I still don’t understand why it wants me. CONSTANTINE Now that you can see these things, they can see you.   And some of them don’t like to be seen.   Taking you out is -- preemptive. The terrible reality of that settles into Liv -- and in a rare moment, John tries to extend his sympathy. CONSTANTINE (CONT’D) Sorry.   No point in trying to sugar- coat it anymore. Liv turns back to the map.   Suddenly, a PINPOINT OF BLOOD forms in the middle, spreads wider, and drips down the map. Liv freaks. LIV Oh my God -- what is that? CONSTANTINE What you asked for.   Trouble. Where did the blood form? LIV Edgewood Avenue.   So what, like, something bad’s happening here? CONSTANTINE Will happen.   It’s daytime now. Most of the things your power’s connected to hunt at night. LIV We should warn someone. CONSTANTINE Not exactly a system in place for that, is there?  \"Constantine\"   2ND BLUE 7/9/14   34.  CONTINUED: 46   46 (CONTINUED) LIV We have to do something -- CONSTANTINE We are.   We’re keeping you alive. I’ve an idea to cut your attacker down to size, but it means using you as bait.  \"Constantine\"   2ND BLUE 7/9/14   34A.  CONTINUED: (2) 46   46 (CONTINUED) MANNY Did you find out what’s hunting the girl? John peers through the tunnel he made with his hand. CONSTANTINE A demon from the inner circle. MANNY A thing like that can't make its way here without serious help. CONSTANTINE Last night, you said something’s coming.   I talked to a colleague with bad dreams who agrees with you. MANNY (curious) Did he say what it was? CONSTANTINE He doesn’t know. Manny nods, introspective.   John senses the truth. CONSTANTINE (CONT’D) Neither do you.   I thought you cloud-huggers had all the answers. MANNY No.   We’re observers. CONSTANTINE Like hell, mate.   Feels l",
      "dialogue_count": 2,
      "word_count": 1547
    },
    {
      "scene_number": 9,
      "slugline": "INT. RIVER HOUSE - DEN - NIGHT (N/2) 49   49 The den, lit by a roaring fire in a stone fireplace.   An ORNATE MIRROR hangs above the hand-hewn mantle.   Liv enters with two logs and bends to add them to the fire.   When she straightens up, looking at the mirror, she sees -- -- the REFLECTION OF A MAN standing right behind her, his hands reaching out for her neck.   Liv SCREAMS and turns -- -- but there’s no one else in the room.   Liv looks back at the mirror, which she now stands directly in front of. LIV’S POV: In the mirror, her own reflection stands next to THE MAN, who has no awareness of her being there.   Looking closer, she sees that he wasn’t actually reaching for her. He’s holding his hands out to the fire, warming them.   He appears chilled, with traces of snow on his fur-lined jacket. Astonished, Liv looks beside her.   No one is there.   She turns back to the mirror, trying to make out the man’s face, but his features are hidden in shadow. Then the man in the mirror turns and steps to the couch.   Liv remains fixed, so she can follow his movements in the glass. LIV’S POV:   Reaching into his coat pocket, the man pulls out a PHOTOGRAPH, opens a hidden drawer in the coffee table, then pauses to gaze warmly at the picture.   He then places the photo in the drawer, closes it, and walks from the room. Tremulously, Liv turns away from the mirror.   Again, the room behind her is empty.   She approaches the coffee table, finds the drawer, slides it open.   Sees a stack of PHOTOS inside. Liv takes them out.   They are PHOTOS OF LIV, mostly childhood school photos.   The bottom photo is a POLAROID: a DRUNKEN TEENAGE COUPLE at a rock concert, arm in arm. LIV Dad? The tears that have been threatening to fall finally do. It’s a bittersweet moment, until -- FOOTSTEPS OVERHEAD startle Liv.   Wiping her tears, she crosses to the main area. INT. MAIN ROOM - CONTINUOUS 50   50 Liv steps to the spiral staircase to see John climbing down, holding a grocery bag and a DUFFLE BAG.   He looks her over. CONSTANTINE Don’t cry.   I brought groceries.  \"Constantine\"   2ND BLUE 7/9/14   40.  (CONTINUED)",
      "characters": [],
      "action_text": "LIV I saw a man.   In the mirror over the fireplace.   With a big fur coat.   Was that...? CONSTANTINE Jasper?   Sounds like him. LIV Was that his -- ghost? CONSTANTINE No.   Time’s out of joint in that mirror.   You were watching the past.   You’ll find lots of dodgy business like that in this house. (hands her duffle) I grabbed some clothes for you. LIV How’d you get in my apartment? John chuckles, amused, and pushes by.   Hearing HEAVY STEPS on the stairs, Liv turns to find herself facing the towering -- CHAS with grocery bags.   Liv SCREAMS like she’s seen a ghost. CHAS It’s okay.   I’m alright.   Sorry to startle you. As Chas moves closer, she backs away, frightened. LIV But you’re... you died. CHAS Not exactly.   It’s complicated. Chas heads to the kitchen area.   Liv follows, still in shock. INT. KITCHEN - CONTINUOUS 51   51 Chas and Liv enter.   John is unloading groceries, including a LAMB SHANK and a SIX-PACK OF BEER. CONSTANTINE There’s a reason Chas is my oldest friend.   He has survival skills. LIV No one can survive what I saw. CONSTANTINE Excellent.   If you’re not confused you’re not paying attention.  \"Constantine\"   2ND BLUE 7/9/14   41.  CONTINUED: 50   50 (MORE)   (CONTINUED) Now, time for that famous rack of lamb.   One should never battle demons on an empty stomach. Liv is still staring at Chas, distracted.   Then she zeroes in on what Constantine said. LIV Wait -- we’re going after that thing tonight? CONSTANTINE Live in the now, I always say. Liv, suddenly unsure, quietly joins them unloading groceries. EXT. ATLANTA - NIGHT 52   52 AERIAL SHOTS of downtown Atlanta carry us into the city. EXT. CAR PARK - NIGHT 53   53 CLOSE on hundred-dollar bills being counted out.   WIDEN to find John counting the bills to a slovenly RENTAL GUARD. CONSTANTINE Three hundred, four hundred, five hundred dollars. RENTAL GUARD Just to have sex on a rooftop? When he nods, we TILT UP to a multi-level PARKING STRUCTURE. CONSTANTINE It’s a fetish thing. Liv glares at",
      "dialogue_count": 0,
      "word_count": 1030
    },
    {
      "scene_number": 10,
      "slugline": "EXT. CAR PARK - NIGHT 55   55 The Rental Guard sits inside his shack, playing Tiny Wing. He reaches a new level and the screen starts to GLITCH.  \"Constantine\"   2ND BLUE 7/9/14   43A.  (CONTINUED)",
      "characters": [],
      "action_text": "RENTAL GUARD Hey, hey... that’s my high score! As the Guard tries to restore his game, PAN to the counter behind him, where the LIGHT BULB starts to GLOW. EXT. CAR PARK ROOF - NIGHT 56   56 Liv sits cross-legged in the Demon Seal, waiting.   John holds a rumpled pack of silk-cut cigarettes, compulsively fiddling with them. LIV You plan on smoking those? CONSTANTINE Nah.   Nothing worse than waking up next to a woman reeking of nicotine.   Or a man, so I’m told. LIV Then why do you have them? CONSTANTINE Temptation.   It tests my resolve. Liv stares at him curiously. LIV Where do you come from, John? CONSTANTINE The sordid passions of my parents. LIV You do that a lot, you know. CONSTANTINE What’s that? LIV Deflect emotions with humor. CONSTANTINE Do I. LIV The kind of weird humor that makes me wonder if you’re a sociopath. CONSTANTINE Forgive me if I don’t wallow in my feelings.   I’m a firm believer in repressing the past.   It’s where we are that counts.  \"Constantine\"   2ND BLUE 7/9/14   44.  CONTINUED: 55   55 (CONTINUED) LIV I don’t buy it.   You just risked your life to convince me that my past is important. John fiddles with his cigarette pack. LIV (CONT’D) C’mon, John.   I’m trusting you with my life here.   The least you can do is share one small personal detail. CONSTANTINE My mom died giving birth to me. LIV Or one big detail.   I’m sorry. CONSTANTINE My dad said it was my fault.   He had a nickname for me.   I heard it every day.   “Hey there, Killer.” And after a night at the pub, which was every night, he’d punch my head and say, “That’s for what you did to your mom, Killer.” LIV Did you report him to the police? CONSTANTINE He was one of London’s finest. LIV That’s awful.   Do you ever wonder sometimes?   What your mom was like? CONSTANTINE No point in wondering.   I’m going to find her. (off her look) When I was a teenager, I started reading every book I could find on the occult.   Taught myself spells, rituals, curses.   I had a knack for it.   Lear",
      "dialogue_count": 0,
      "word_count": 1986
    },
    {
      "scene_number": 11,
      "slugline": "EXT. EDGEWOOD AVENUE - NIGHT 61   61 Liv approaches a CROWD.   She pushes her way to the front. LIV Excuse me.   I need to get through. At the front of the crowd, Liv finds police tape surrounding a DEAD BODY on the sidewalk -- an All American teenage boy, his throat torn out.   Near the body, a POLICE OFFICER tries to hold back the GRIEVING MOTHER. GRIEVING MOTHER Let go!   Let go of me!   Who did this?   What kind of monster does this to a boy?   Why?   Why!  The disconsolate Woman collapses.   Witnessing her pain, Liv tears up herself, and then her sorrow transforms to anger. INT. PUB - NIGHT 62   62 John drinks alone at the bar of an English pub.   Half a dozen LATE-NIGHTERS, most of them solo, are scattered about.   Chas enters the pub, drawing stares.   He steps to the bar behind John as he raises a finger to the MALE BARTENDER for a beer. John, half tossed, turns to see Chas join him. CONSTANTINE Chas, just in time to settle a bet. Most influential band.   The barkeep credits The Ramones for the music, fair enough, but The Pistols were dangerous... CHAS Liv stopped by the Mill House to grab her bags.   Said something about a cousin in California. CONSTANTINE The Pistols started a revolution... Chas solemnly lays down the PENDANT on the bar before John. CHAS She’s isn’t coming back, John. CONSTANTINE Suppose we’re not all cut from the same cloth. John picks up the pendant and wraps his hand around it, closing his eyes, silently relieved.  \"Constantine\"   2ND BLUE 7/9/14   52.  (CONTINUED)",
      "characters": [],
      "action_text": "CHAS Is she safe out there? CONSTANTINE She will be.   With Furcifer gone, I can put a cloaking spell on her. John pockets the pendant. CHAS Liv spent an hour in the map room before she left.   Scrying like you taught her.   Look, it’s happening everywhere... Chas unfolds a U.S. MAP and spreads it out on the bar.   The map is cluttered with dried BLOOD DROPS, a HUNDRED OF THEM, scattered across the country.   Even John is surprised. CHAS (CONT’D) She wants you to keep fighting. Sounded just like her father when she said it, too. CONSTANTINE Did she now? CHAS It’s better than crawling back into a hole... or a bottle.   You’re the only one I know who can do anything about this. Chas pushes the map closer, motivating.   John looks at it, irritated. CONSTANTINE Pull up a pint and join me, or step out and sod off.   I’m busy. As John raises the dregs of his pint, Chas grabs it, sets it down, firm. CHAS Maybe you’ll never forgive yourself for what happened to Astra, but if you want to give her loss some meaning... (poking at map) ...then do something about it. Chas takes the map and heads out.   John watches him go sourly, turns back to the bar as a fresh PINT plops down. TILT UP to reveal the bartender is now MANNY.  \"Constantine\"   2ND BLUE 7/9/14   53.  CONTINUED: 62   62 (CONTINUED) MANNY Interesting coincidence.   Ritchie had to drive 20 blocks out of his way to pass Edgewood Avenue and stumble onto that crime scene. CONSTANTINE I chipped in for gas. MANNY You scared her away. CONSTANTINE Kind of the point.   I work better alone. MANNY You’re failing to grasp the stakes here, John.   Darkness rises around us.   Wickedness spreads over the earth.   Yet here you sit, alone and idle.   Able, but unwilling, to meet it.   Liv’s power is valuable -- All the emotional tension inside John threatens to snap. CONSTANTINE So’s her life.   If Liv was going to join our fight, she had to see the risks for herself. (calming down) All I did was give her a choice. It’s more than Astr",
      "dialogue_count": 0,
      "word_count": 708
    },
    {
      "scene_number": 12,
      "slugline": "INT. ABANDONED MILL - NIGHT 63   63 A LOW ANGLE, GLIDING ACROSS THE FLOOR.   Past the dead doctor lying in blood, flies buzzing.   Over discarded and empty I.V. bags.   At the same time, we HEAR fitful MOANING.  \"Constantine\"   2ND BLUE 7/9/14   54A.  (CONTINUED)",
      "characters": [],
      "action_text": "We reach A BED, then we glide up and onto the mattress, where we find Papa Midnite clutching his rifle.   HE’S FALLEN ASLEEP.   His body twitches.   His lips moan, low. PUSH INTO his fearful face, to see his eyeballs moving under the lids in furious R.E.M.   The MOANS turn to AUDIBLE CRIES, as if something is coming for Papa Midnite in his dream. PAPA MIDNITE No... no, por favor.... NOOOOO! Abruptly, Midnite’s eyes POP OPEN and he SCREAMS -- EXT. ABANDONED MILL - CONTINUOUS 64   64 The SCREAM echoes across the weeded area around the mill. His Men with their automatic rifles look at each other in superstitious fear, unsure what to do. INT. ABANDONED MILL - NIGHT 65   65 One of Papa Midnite’s men, a brave foot soldier named MANUEL, enters with trepidation to check on his boss. FOOT SOLDIER  ¿Hola?   Jefe?   ¿Estás aquí?  Manuel crosses to the mattress.   Papa Midnite’s clothes are torn and shredded on the bed, atop a bloody and flat shape. Manuel steps closer.   Using the tip of his AK-47, he pushes the ragged clothing aside to see -- Papa Midnite’s EMPTY FLESH.   A bloody skin suit without a body inside.   And then Manuel hears the voice behind him. PAPA MIDNITE (O.S.) Manuel?   Is that you? Manuel slowly turns and sees BLOODY FOOTPRINTS leading from the bed to a shadowy corner.   Thankfully the corner is too dark to see anything -- except for the eyes.   Two ROUND WHITE SAUCERS without lids, staring at him from darkness, pleading. PAPA MIDNITE (CONT’D) It’s here.   Get... (it hurts to talk) ...get... get Constantine! A SKINLESS ARM, red and glistening, reaches out of the black and into the light.   Off Manuel’s total terror -- CUT TO BLACK.  END OF SHOW \"Constantine\"   2ND BLUE 7/9/14   55.  CONTINUED: 63   63",
      "dialogue_count": 0,
      "word_count": 343
    }
  ]
}