{
  "slug": "crazy-rich-asians-2018",
  "title": "crazy rich asians",
  "genre": "drama",
  "format": "film",
  "scenes_count": 11,
  "characters_count": 8,
  "characters": [
    "NICK",
    "ASTRID",
    "COLIN",
    "WYE MUN",
    "ELEANOR",
    "AH MA",
    "AMANDA",
    "RACHEL"
  ],
  "total_words": 21650,
  "total_dialogue": 16,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. CLOTHING BOUTIQUE - DAY Rachel looks at her reflection in a mirror as she holds a blue and white dress to her body.   Her mother, KERRY (50s, real estate agent, Chico chic), shakes her head. Kerry has a slight Chinese immigrant accent. RACHEL What do you think? KERRY No!   No!   No!   No!   You can’t wear that to meet Nick’s Ah Ma.   Blue and white is for Chinese funerals. Now this, this symbolizes good fortune and fertility. Kerry holds up a conservative RED dress. RACHEL Great!   I was really going for that ‘lucky baby-maker’ vibe. KERRY Hey!   You are the one who asked for my help picking out a dress to meet Nick’s family. RACHEL It’s only ‘cause I hardly know anything about them.   Every time I bring them up Nick changes the subject. KERRY Maybe he’s embarrassed.   Maybe his parents are poor, and he has to send them money.   That’s what all good Chinese children do. Rachel chuckles and they keep searching for the right dress. KERRY Oh, you are going to have a wonderful time.   You’ve always wanted to go to Asia and who knows, if all goes well in Singapore, you might just come back with a souvenir. RACHEL Mom, stop!   Nick and I haven’t even talked about that.  14. (MORE) (CONTINUED)",
      "characters": [
        "NICK"
      ],
      "action_text": "I mean, his parents can’t not like me, right? Kerry has a sour look on her face and turns away to begin rummaging through a clothes rack. RACHEL What was that look?   I saw that. KERRY Nothing.   It’s just, Nick bringing a girl all the way there to meet them can mean a lot to these overseas families.   Eh, they’re different from us. RACHEL How are they different?   They’re Chinese, I’m Chinese.   I’m so Chinese, I’m an economics professor with lactose intolerance. KERRY Yeah, but you grew up here. (in Mandarin; subtitled)  Ni kan qilai shi huaren, ni jiang de shi zhongwen.   Keshi zheli he zheli...   [Your face is Chinese. You speak Chinese.   But here... (points to Rachel’s head and mouth) ... and here... (in English) You’re different.   But wearing a lucky color will make a good first impression. CUT TO: EXT. JFK - CURBSIDE - DAY Amid the hectic bustle, Nick and Rachel exit a taxi.   An airport sign behind them reads:   Kuwait Airways, Pacific Asian Airlines, Qatar Airways, Malaysian Airlines, Cathay Pacific. FEMALE ANNOUNCER (V.O.) Attention, the white zone is for passenger loading and unloadings only.  15. CONTINUED: RACHEL (CONT'D) (CONTINUED) RACHEL Okay, game plan.   Check our bags, get through security, and then we could eat one of the three homemade Tupperware meals my mom packed for us. An elegant PACIFIC ASEAN AIRLINES FLIGHT ATTENDANT approaches, flanked by TWO PORTERS with luggage carts. FLIGHT ATTENDANT Good afternoon, Mr. Young, Ms. Chu.   We’ll take your bags and get you checked into first class. NICK Great. Rachel looks confused as the porters take their bags. RACHEL Oh.   No, there's a mistake.   We're not first class.   We’re economy people. FLIGHT ATTENDANT This way, please. Nick puts a hand in the small of her back: NICK Just go with it.   Come on. RACHEL But... NICK Yeah, they’ll be fine.   Just leave them there. INT. PLANE - ON NICK - DAY FLIGHT ATTENDANT #2 pulls back a gold, silk curtain revealing a luxurious part of the plane that looks mor",
      "dialogue_count": 1,
      "word_count": 1162
    },
    {
      "scene_number": 2,
      "slugline": "INT. PLANE Nick and Rachel continue their conversation. RACHEL Okay, and what about your cousin Eddie?   You don’t ever talk about him. NICK Well, Eddie is a big finance guy in Hong Kong.   A real family man. CUT TO: INT. PENTHOUSE APARTMENT (HONG KONG) - MORNING Eddie, his wife FIONA CHENG (30s, Hong Kong Chinese, in a simple but elegant dress), and their three sons (all under 8 and wearing matching Gucci outfits) are frozen in “natural” poses -- Eddie and Fiona “laugh” as their boys “play” with wooden airplanes that look more like props than toys -- as photographer RUSSELL WONG takes their portrait.   Behind them, wide, floor-to-ceiling windows frame a panoramic view of Hong Kong. SUPERIMPOSE:   HONG KONG EDDIE CHENG (30s, intense investment banker), ASTRID (30s, gorgeous, elegant). RUSSELL WONG You know if you move, it will look more natural. EDDIE No, this way you get our optimal angles. RUSSELL WONG Uh, then we’re done. As Russell wraps up, Eddie scurries over, all smiles. EDDIE Russell, thank you so much.   It’s an honor to be photographed by you. FIONA (to kids) Good job, guys. (to nannies) Yes.  20. (CONTINUED)",
      "characters": [
        "ASTRID"
      ],
      "action_text": "RUSSELL WONG My pleasure.   People will love it in the next Hong Kong   Vogue . NANNY (to kids) Give me that.   You have to take a bath now. FIONA Thank you, Russell. Eddie beams, but the moment Russell and his ASSISTANTS exit, Eddie loses his smile.   Turns on his wife, annoyed. EDDIE Hong Kong   Vogue ?   I knew it.   Your dress is a disaster.   If you wore a Bottega gown, like I told you to, we’d be in the American   Vogue . FIONA You can wear that gown to Hell, Eddie. Fiona walks off as the children jump into 2 TOY BENTLEYS and start chasing their beleaguered NANNIES... NANNY (to kids) Stop! NICK (V.O.) Then there’s Astrid. INT. PLANE RACHEL I remember Astrid.   She’s like who I wanna be when I grow up. NICK Astrid is awesome.   And she’s probably the only one I’m actually close with.   And she’s really grounded and down to earth once you get to know her. CUT TO: INT. JEWELRY BOUTIQUE (SHANGHAI) SUPERIMPOSE:   SHANGHAI  21. CONTINUED: (CONTINUED) The JEWELER approaches. JEWELER Ms. Leong, right this way. ASTRID It’s very nice to meet you both. The patrons watch Astrid and the Jeweler disappear through a hallway into a restricted area... INT. JEWELRY STORE - BACK ROOM - DAY It’s a private room reserved for elite clientele.   An ASSISTANT brings Astrid tea in a tiny antique cup as she surveys A STUNNING SELECTION OF OVER-THE-TOP JEWELRY. JEWELER These are all brand new from Antwerp.   You’re the first person I’ve shown them to. Astrid is unimpressed.   Then she sees in ANOTHER DISPLAY CASE an understated pair of pearl drop earrings.   She looks at them, intrigued. ASTRID What are those? The Jeweler smiles, approving of Astrid’s taste.   He takes the earrings out so she can get a closer look. JEWELER Those.   Those are very special. Burmese pearl drop earrings.   Set with emeralds, and rare pigeon- blood-red rubies.   They were worn by Queen Supayalat at her self- anointed coronation in 1878. The assistant brings the earrings to Astrid.   She picks them up to look ",
      "dialogue_count": 1,
      "word_count": 771
    },
    {
      "scene_number": 3,
      "slugline": "INT. PLANE - NIGHT The plane is now in the air and Nick and Rachel’s suite has been converted into a bedroom.   They wear the complimentary pajamas as they lie in bed, continuing their conversation about Nick’s family. RACHEL So, if you have all this family there, why are we staying in a hotel?   Aren’t good Chinese sons supposed to stay with their parents? NICK Well, because A) I’m not that good a son, and B) I just want you to myself, just for a bit.   That okay? RACHEL Okay. Rachel smiles and kisses Nick.   He rolls on top of her. EXT. SKYLINE (SINGAPORE) - NIGHT The plane flies across the South China Sea into the sunset, heading for a SHINING JEWEL at the tip of the Malaysian Peninsula. INERT - WORLD MAP SUPERIMPOSE:   NORTH PACIFIC OCEAN, SOUTH PACIFIC OCEAN, NEW YORK, NORTH ATLANTIC OCEAN, SOUTH ATLANTIC OCEAN, CHINA, INDIA, INDIAN OCEAN, SINGAPORE, AUSTRALIA We ZOOM IN ON SINGAPORE -- SUPERIMPOSE:   MALAYSIA, SINGAPORE, SINGAPORE STRAIT, MAIN STRAIT, INDONESIA EXT. SINGAPORE (ESTABLISHING) SUPERIMPOSE:   SINGAPORE INT. CHANGI AIRPORT - DAY Nick and Rachel emerge with other TRAVELERS, pushing luggage carts as they emerge from customs.   Rachel looks around the shiny arrival hall in wonderment.  24. (CONTINUED)",
      "characters": [
        "COLIN",
        "WYE MUN",
        "ELEANOR"
      ],
      "action_text": "RACHEL I can’t believe this airport has a butterfly garden and a movie theater.   JFK is just salmonella and despair. WOMAN (O.S.) Nick!!!   Nick!!! Through the crowd runs a willowy, young woman, ARAMINTA (20s) clutching BALLOONS, rushing up to meet them.   She throttles Nick, wrapping her legs tightly around his waist.   Behind her is a ruggedly handsome man, COLIN (30s), holding a PLACARD that reads “Best Man.”   Nick lights up to see them. ARAMINTA Nick!!!   Nick!!! NICK Araminta! ARAMINTA I missed you. NICK I missed you, too. Araminta releases Nick and immediately grabs Rachel in a tight hug.   Rachel reacts, surprised, amused.   Colin grabs Nick in a big bear hug, pulling him back and forth. ARAMINTA Rachel. NICK (to Colin) Hey. RACHEL Hi! COLIN (to Nick) There he is.   How are you? ARAMINTA (to Rachel) It’s so nice to finally meet you. NICK (to Colin) I’m good. RACHEL (to Araminta) It’s so nice to meet you, too. Araminta has no makeup on under her spectacles, and is wearing pajama pants, a tank top, and flip-flops.   Nick gives Colin a big hug.  25. CONTINUED: (CONTINUED) COLIN Ah!   Nicki-Nick!   Welcome! NICK It’s been too long, brother. COLIN It has been too long.   Welcome back. NICK You guys didn’t have to pick us up. ARAMINTA Of course we did.   We had to! COLIN Of course I had to come welcome my best man properly. (to Rachel) Hi, Rachel. RACHEL Hello. They embrace warmly. COLIN Oh!   Lovely to finally meet you. RACHEL Nice to meet you, too. COLIN Shall we?   Let me help you with this. ARAMINTA Yes.   (handing Rachel the balloons) And these are for you. NICK Yes!   I can grab these.   All right. RACHEL Oh!   Thank you. ARAMINTA I know they’re a bit over the top.  26. CONTINUED: (CONTINUED) COLIN Let’s get you all localized. ARAMINTA Are you hungry? RACHEL I’m always hungry.   So let’s eat everything we can. ARAMINTA Okay. EXT. CHANGI AIRPORT - DAY Colin pushes the luggage cart out the door, flanked by Rachel, Nick, and Araminta. EXT. SINGAPORE (ESTABLISH",
      "dialogue_count": 3,
      "word_count": 5693
    },
    {
      "scene_number": 4,
      "slugline": "INT. TYERSALL PARK - LIVING ROOM - NIGHT Rachel and Nick enter.   She is stunned.   The expansive “living room” looks more like a glamorous club in Shanghai.   DOZENS of impeccably-dressed, bejeweled GUESTS cluster in seating areas.   A buffet is STACKED with gorgeous dishes and desserts. ASTRID (O.S.) Nicki! NICK Astrid. ASTRID Rachel! NICK Hey, good to see you. ASTRID I’m so glad you could make it. As we GO TO different tableaus and conversations, CAMERA DANCES ALONG, giving the feel of a choreographed number. Astrid, in a perfect cocktail dress, heads for them, followed by Michael.   She hugs Nick and Rachel, delighted. NICK Michael. RACHEL Astrid!   So good to see a face I know. MICHAEL Nick. ASTRID This is my husband, Michael. MICHAEL Nice to meet you.   Heard so much about you. RACHEL Nice to meet you, Michael. Eddie barrels in, smacks Nick too hard on the back.  56. (CONTINUED)",
      "characters": [],
      "action_text": "EDDIE Hey, the golden boy’s back!   Nick! (to Rachel) And you must be Rachel.   I’m Edison Cheng.   This is my wife. FIONA HI, I’m Fi-- EDDIE Her name is Fiona.   So, I see you’ve already met Princess Astrid and her little soldier toy-boy, Mikey. (busts Michael’s balls) You know Mikey is a big-shot tech startup guy.   So if you, uh, forget your password, he’s your man.   (then) So, you’re from the Taiwan plastic Chus, right? RACHEL Oh, well, actually... As Eddie commandeers Rachel, Michael has an aside with Nick. MICHAEL Can I punch him in the face?   Just once. NICK Take a number. MICHAEL I’ll be in my usual corner. (to Astrid) Champagne? ASTRID Thank you. Astrid goes over to Nick. ASTRID So, have you prepped Rachel to face the wolves? NICK Rachel is a New Yorker, and she lectures Millennials for a living. I think she can manage our family.  57. CONTINUED: (CONTINUED) Astrid looks at Nick like he’s crazy. ASTRID You’ve been away too long. BACK WITH RACHEL AND EDDIE EDDIE Okay, sorry, time out.   So, you’re not from a Taiwan Chu family? RACHEL Nope. EDDIE Hong Kong telecom Chus? RACHEL No. EDDIE Malaysian packing peanut Chus? RACHEL Is that really a thing? EDDIE Yeah, it’s everywhere.   You just -- Before Eddie can continue, Nick cuts in. NICK I’m gonna stop you there because I’m gonna take her on the rounds. We’ll be back, though. As Nick and Rachel leave, Eddie calls after. EDDIE No, wait.   Hang on.   China instant noodle Chus.   Rachel... (as Rachel turns) Chu are you? (to Fiona) Let’s go. Eddie laughs hysterically at his own horrible joke. Rachel politely smiles and moves on. Francesca and Celine hover nearby to listen in and get the dirt on Rachel.  58. CONTINUED: PARTY SEQUENCE The jazz band breaks into a DRUM SECTION as Nick introduces his family to Rachel, who’s anxious to make a good impression.   CAMERA DOES 360 LOOPS AROUND them, REVEALING a new set of people each time: -- WITH AUNTIES ALIX AND FELICITY: NICK This is Auntie Alix and Auntie Felicity. RACH",
      "dialogue_count": 0,
      "word_count": 1364
    },
    {
      "scene_number": 5,
      "slugline": "INT. TYERSALL PARK - NICK’S OLD ROOM - NIGHT Nick opens a closet, sees a row of meticulously pressed shirts hanging in a row.   He smiles, takes one out. Eleanor walks in. ELEANOR Ah Ma insists all your clothes be washed and pressed every two weeks. Nick sees his mother standing in the doorway.   She walks over, takes the shirt from his hands and selects another shirt for him.   (Throughout the scene she also quietly caters to Nick -- dusting his jacket, etc.) ELEANOR This one. As Nick takes off his soiled shirt he looks around at his childhood room filled with pictures and mementoes. NICK Everything is exactly as I left it. Nick moves to a nearby desk and rifles through a drawer. ELEANOR (glances over at him) Looking for your cigars?   I had them thrown out years ago. NICK Never could get anything past you, could I? Eleanor smiles while she fiddles with Nick’s clean shirt laying on the bed. ELEANOR I keep telling Ah Ma to put your things away, but she says this room makes her feel like you’re still here. (then) Well, I got an earful when you didn’t move back last year. Nick reacts, it’s a loaded subject.   Eleanor helps Nick put on the clean shirt.  65. (CONTINUED)",
      "characters": [
        "AH MA",
        "NICK",
        "AMANDA"
      ],
      "action_text": "ELEANOR Your father and I are really looking forward to having you home.   He’s not getting any younger.   With you onboard, maybe he’ll take a day off once in a while. NICK I know, Mum.   I’m just not ready yet.   There’s things in New York that I wanna see through. It’s not the answer Eleanor was looking for.   She presses on another front: ELEANOR Well, I’m happy I finally met Rachel.   She is very impressive. NICK I think so, too.   And I thought you might be excited that the first girl that I bring home is a Chinese professor. ELEANOR (noncommittal smile) Chinese-American. (fishes) You know, bringing her home, introducing her at a large family gathering... Some people may say -- NICK When there’s something to say about Rachel and me, you’ll be first to hear. (off Eleanor) But some things I need to figure out on my own. Nick grins as Eleanor helps him put on his jacket. ELEANOR Is that an American accent I’m hearing? Nick scoffs. NICK How do I look? Eleanor adjusts the pocket square in his jacket pocket, regards her son.  66. CONTINUED: (CONTINUED) ELEANOR Perfect. EXT. TYERSALL PARK - CONSERVATORY - NIGHT Guests stream into a vast open-air courtyard.   Alix and Felicity hold court as guests admire the large, spidery, white flowers which are STARTING TO BLOOM. ALIX Everyone!   Everyone!   The   tan hua  plants very rarely bloom, and even then only at night. FELICITY Their beauty is spectacular, but fleeting.   By dawn they’ll be gone. ALIX So... come.   Come. The crowd claps.   ZOOM IN ON the tan hua plant taking center stage in the conservatory. IN ANOTHER AREA Oliver pretends to admire the flowers as he points out the social scene to Peik Lin and Rachel. OLIVER Oh!   Someone forgot to wear a bra. He gestures to Kitty Pong, who’s entered with Alistair. OLIVER Kitty Pong.   Cousin Alistair’s latest flame.   An actress.   Rumor is, she was in a porno.   Two Girls, One Cup a Noodles.  Kitty bends down to smell a tan hua, her boobs almost spilling out of her dress.",
      "dialogue_count": 5,
      "word_count": 3781
    },
    {
      "scene_number": 6,
      "slugline": "INT. RAFFLES HOTEL - LANDING - DAY Nick enters the hotel having returned from his trip.   He sees Rachel reading in a quiet area.   He heads over, throws his bag down. RACHEL (O.S.) I thought I was here to meet your family... ON NICK AND RACHEL RACHEL ... go to your best friend's wedding, eat some good food. Instead, I feel like I'm a villain in a soap opera who's plotting to steal your family fortune. Nick blanches.   Knows this isn’t good. NICK What happened? RACHEL I mean, I met Amanda.   She told me that everyone here thinks that I'm the evil person that prevented you from moving back to Singapore last year but, when I didn't even know you were supposed to come home. NICK You have every reason to be upset - - RACHEL I’m not done yet!   There was also the gutted, bloody fish that Araminta’s friends left for me in my hotel room on my bed next to the words ‘Catch this, you gold- digging bitch’... written in big fat serial-killer letters -- NICK Is that all that happened? (off Rachel) I mean, please tell me that’s all that happened.  87. (CONTINUED)",
      "characters": [
        "ASTRID"
      ],
      "action_text": "RACHEL You know what?   I don't even care about those stupid girls, with their stupid little designer handbags and sunglasses.   I don't care about that.   I don't care that your ex-girlfriend told me all this crap.   It's that you didn't tell me any of it. NICK I screwed up. RACHEL Why? NICK I really messed up, okay? RACHEL Why?   What -- Were you trying to test me?   Why would you do that? Nick takes a beat, comes clean. NICK I made a mistake.   When we first met, you had no idea who I was, who my family were.   You didn't care! RACHEL Yeah, I don't care about that stupid stuff. NICK Well, exactly.   You are so different from all of the women that I grew up with.   And I love who I am around you.   And I don't want that to change.   And that's selfish, I know. Nick takes her hand. RACHEL Mm-hmm. NICK And I'm sorry that you had to deal with that on your own.   But I'm here now.   And whatever happens, we'll get through it together. Dead fish and all.  88. CONTINUED: (CONTINUED) As Rachel scoffs -- NICK All right? RACHEL It was so gross.   But I buried it. NICK You dealt with it. They laugh.   He holds her.   Rachel is touched. NICK Come here. RACHEL You know what?   We need to do something tonight.   We need to do something that's just you and me, okay? NICK 100% agree. RACHEL Yes. NICK But... we do have to go make some dumplings first.   Okay? RACHEL Then can we eat them? NICK We can eat as many as you like. RACHEL Okay, fine. INT. TYERSALL PARK - DINING ROOM - DAY QUICK CUTS of food being expertly prepared by half a dozen MAIDS: -- Small balls of dough are rolled into flat circles. -- Minced meat is quickly rolled into dozens of perfectly- formed, uniform BALLS.  89. CONTINUED: (CONTINUED) A maid takes a tray of the mincemeat balls to the center of the room, where Eleanor and other family members -- Nick, Rachel, Astrid, Cassian, Oliver, Alix, and Felicity -- are clustered around a large table.   They’re busy folding the dumplings, which are placed in neatly-stac",
      "dialogue_count": 1,
      "word_count": 1993
    },
    {
      "scene_number": 7,
      "slugline": "EXT. COFFEE SHOP - PATIO - DAY PEIK LIN (O.S.) Wait, what?   Was she like -- TILT DOWN -- Peik Lin and Rachel sit at a table. PEIK LIN (Eleanor impression)  ‘You will NEVER be good enough for my son,’   OR was it like,   ‘YOU, YOU will never be good enough for my son.’  RACHEL It’s like the second one. PEIK LIN Oh. RACHEL Except for in a way that made me wanna, like, cry and puke at the same time. PEIK LIN God, she’s so badass. (idea) You know, I bet if you told her you’d leave Nick for a million dollars, she will write that check.   They do that around here -- RACHEL -- And she   looked   at me like I was nothing... PEIK LIN -- Like a   ten   million dollar check.   I feel like she would do that. RACHEL I don't even know what I should do.   I mean, I can't even tell Nick because he like worships her. PEIK LIN Yeah, Chinese sons think their moms fart Chanel No. 5.   What about the Ah Ma?   Does she hate your face, too?  98. (CONTINUED)",
      "characters": [],
      "action_text": "RACHEL Okay, nobody said they hated my face.   And Ah Ma, she liked my face.   She said I had a lucky nose. PEIK LIN That’s great!   You know, Eleanor can hate you all day long, but you can’t beat two thousand years of Chinese filial piety. RACHEL I feel like I shouldn't even go to the wedding.   You know, it's Colin and Araminta's day, I don't wanna cause any drama there.   I feel like I should just sit it out. You know?   Tell Nick I had food poisoning or something. (off Peik Lin’s look) What? PEIK LIN That’s bullshit.   You’re just scared. RACHEL No, I’m not. PEIK LIN Okay, here's what you need to understand, all right?   It's not about getting Eleanor to like you. It's about getting her to respect you.   All right?   Right now, she just thinks you're some like undeserving, clueless, gold- digging -- RACHEL Okay, yeah, I got it. PEIK LIN -- trashy, unrefined banana, yellow on the outside, white on the inside -- RACHEL I know what a banana is -- PEIK LIN -- When in reality, you’re like a super sophisticated, smart professor of freaking game theory.  99. CONTINUED: (MORE)   (CONTINUED) Show her that side of you, you know. This hits home with Rachel. RACHEL You’re right. PEIK LIN Damn straight, I’m right.   It’s Peik Lin, I’m always right. RACHEL Yeah, she's like trying to play a game of chicken with me, where she's like coming at me, and like, thinking I'm going to swerve like a chicken. PEIK LIN But you can't swerve. RACHEL I'm not gonna swerve.   Not for her. PEIK LIN No.   Chickens are bitches, dude! RACHEL And I'm not a chicken PEIK LIN You're not a chicken.   You gonna roll up to that wedding, you gonna be like, ‘Bak-bak, bitch!’ RACHEL (chuckles) Bak-bak, bitch! PEIK LIN Chickens are bitches. A man on one of the upper balconies overhears her, gives her a disapproving look. PEIK LIN Sorry Uncle. RACHEL What are you doing tonight?  100. CONTINUED: PEIK LIN   (CONT'D) (CONTINUED) PEIK LIN Uh, I was gonna go to FedEx or something.   Why?   Oh! Peik Lin breaks int",
      "dialogue_count": 0,
      "word_count": 692
    },
    {
      "scene_number": 8,
      "slugline": "EXT. FIRST METHODIST CHURCH - DAY A long line of stately cars lead to the entrance. Throngs have gathered hoping to catch sight of arriving celebrities.   It’s a mix of FOREIGN DIGNITARIES, GOVERNMENT LEADERS, and Asia’s brightest stars. QUICK CUTS of reporters and photographers continues throughout the following scene. INT. GOH HOUSE - LIVING ROOM - DAY OLIVER Pull the plum Balenciaga, the peach Chloé, the Giambattista, all the Bottegas, oh, and that Jason Wu with the deconstructed ruffles. PEIK LIN And a sandwich for Peik Lin. Rachel enters modeling different dresses. OLIVER Oh! PEIK LIN Okay.   All right. OLIVER Right.   I'm not sure if it's working or if she looks like a clown's tampon. RACHEL Oh! PEIK LIN On a heavy day. OLIVER (next dress) Y-You look like a flower.   Like a sad, lonely flower no one wants to be around. RACHEL Ahh!  102.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 146
    },
    {
      "scene_number": 9,
      "slugline": "EXT. FIRST METHODIST CHURCH - DAY AMANDA (to Reporter) I mean, it's the wedding of the century.   So, of course we're here.   It's the natural... INT. GOH HOUSE - LIVING ROOM - ON RACHEL - DAY OLIVER Oh!   Oh!   It’s not that bad.   It’s holding you up. PEIK LIN It’s a hands-on dress.   You know what I mean? WYE MUN (throws dress over partition) Incoming. Peik Lin points for him to leave. WYE MUN Okay.   Okay EXT. FIRST METHODIST CHURCH - DAY REPORTER And this fantastic celebration here with -- Francesca and Celine pose for the cameras. Alistair poses with Kitty Pong, who’s delighted by all the attention. KITTY I love my fans... I love my fans. ALISTAIR (to reporters)  Taipei Tiger Two   is going to redefine the genre.   She's a star. KITTY TT-Two, honey! ALISTAIR She's a star.  103.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 141
    },
    {
      "scene_number": 10,
      "slugline": "INT. GOH HOUSE - LIVING ROOM - ON RACHEL - DAY PEIK LIN Oh!   I'm blinded by the light. OLIVER Oh.   Okay.   This is why disco died. PEIK LIN You kinda look like a slutty Ebola virus. OLIVER It's like a bag of Skittles. Taste the rainbow. OLIVER Could work, if we... Yes.   I, I think we just alter the -- Wye Mun comes back in offering another outfit -- WYE MUN (whispering) I, I, just think if we could just maybe just tell her this is coming from you because she probably doesn't wanna hear it from a guy. Okay.   Okay. Peik Lin throws him out again. EXT. FIRST METHODIST CHURCH - DAY Eddie, Fiona, and their three boys, again in adorable matching suits, pose for photographers.   Eddie nudges his eldest son. EDDIE Okay, remember.   Optimal angles. INT. GOH HOUSE - LIVING ROOM - ON RACHEL - DAY Oliver and Neenah are accessorizing the sparkly disco- type dress Rachel is now wearing. When Rachel goes behind the partition to change her outfit, Neenah, Wye Mun, P.T., and the twins all start dancing to the music.   Peik Lin’s parents get carried away and start making out on the chaise lounge.  104.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 202
    },
    {
      "scene_number": 11,
      "slugline": "EXT. FIRST METHODIST CHURCH - DAY Eddie trails off as the photographers suddenly head to -- -- a custom GOLD BENTLEY MULSANE.   It’s driven by Peik Lin, who wears a fetching driver’s uniform.   Seeing the car, Oliver steps up as Peik Lin opens the door -- a shapely stilettoed leg steps out.   It’s RACHEL in a glittering gown.   Her hair is swept up, her jewelry catches the light, she’s a VISION. It’s an EXPLOSION OF FLASHES as photographers, reporters, and looky-loos take pictures, yell to get her attention. Rachel is a little overwhelmed, but Oliver helps navigate her through the crowd. NEENAH Just right here!   Just right here! PHOTOGRAPHER Beautiful dress.   Thank you. Thanks for the... Excuse me. Excuse me, can I get a picture of you?   Lovely.   Oh, fantastic. Looking gorgeous.   Little closer together.   Who's this one?   What's your name? PEIK LIN Ma’am. OLIVER (mouthing) You look wonderful.   Breathe. (to paparazzi) Everyone, I've got Rachel Chu of New York.   Rachel Chu of New York. Real estate heiress, Rachel Chu of the New York Chus. FEMALE SPECTATOR Rachel!   Rachel!   Over here! PHOTOGRAPHER Rachel, this way.   Rachel! Rachel!   To me! MALE PHOTOGRAPHER Okay, ladies, looking good. Looking good.   Okay, out of the way, please.   Out of the way. Amanda, Celine, and Francesca, look agape, incredulous.  105. (CONTINUED)",
      "characters": [
        "ASTRID",
        "COLIN",
        "RACHEL",
        "NICK"
      ],
      "action_text": "KITTY So gorgeous! RACHEL Thank you. A Photographer gestures for Celine to get out of the way so he can take Rachel’s picture.   OFF Celine, pissed. MALE PHOTOGRAPHER Ladies, move please.   Out of the way!   Good, good.   That's great. Beautiful dress. RACHEL Ladies.   Amanda. AMANDA Hmm. RACHEL You’re in my way. AMANDA Okay, what? INT. BENTLEY - DAY Astrid and Michael, dressed for the wedding, sit in the back of a chauffeured Bentley.   Michael chatters on as Astrid listens in silence. MICHAEL -- Our Chinese investors are getting nervous.   I have to fly to Shenzhen on Monday to try and talk them down. This gets Astrid’s attention. ASTRID That’s Cassian’s birthday. MICHAEL Yeah, I know.   I hate to miss it, but this is important. ASTRID You’d think your son’s birthday is important.   Get someone else to handle it... (can’t help herself) Unless... there’s another reason you’re out of town.  106. CONTINUED: (CONTINUED) MICHAEL What are you saying? Astrid presses a button on the console, RAISING THE PARTITION between them and the driver. ASTRID I know you’re having an affair. Michael reacts, uncomfortable, but he doesn’t deny it. MICHAEL Oh, Jesus, Astrid. ASTRID Let’s just get through the wedding and we’ll deal with it after.   I don’t want to make a scene. Michael looks at her, incredulous. MICHAEL You find out I’m having an affair with another woman, and you’re worried about making a scene? ASTRID You’d rather I scream and carry on? MICHAEL Yes.   Honestly, I wish you would. It would show you cared about more than what people thought of you and your family -- ASTRID Don’t try and turn this on me. I’m not the one who screwed up! MICHAEL Of course not.   You’re always the prettiest, richest, most perfect girl in the room.   While I’m just this lucky bastard who will never measure up. ASTRID Don’t say that -- MICHAEL I know what you’re thinking, Astrid.   That’s why you hide your shoes, the jewelry you buy.  107. CONTINUED: (MORE) (CONTINUED) As if every minute of my ",
      "dialogue_count": 5,
      "word_count": 5705
    }
  ]
}