{
  "slug": "creed-2015",
  "title": "creed",
  "genre": "action",
  "format": "film",
  "scenes_count": 13,
  "characters_count": 2,
  "characters": [
    "BIANCA",
    "ROCKY"
  ],
  "total_words": 24578,
  "total_dialogue": 2,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. FIGHT CLUB/ BAR- TIJUANA MEXICO- DAY 1   1  We open on a mural of Jesus Christ, painted on the wall of the bar. We pan down to reveal dank surroundings where disinterested patrons are watching a brutal flyweight match between TWO HISPANIC FIGHTERS. INT. DRESSING ROOM- FIGHT CLUB/ BAR- TIJUANA MEXICO 2   2  More of a water stained box where ADONIS JOHNSON (20’S, Black) leans from one side to another, attempting to stay loose. FLORES (30’s) a battle scarred Mexican fighter, stands across from Adonis, thick and menacing, with a neutral expression. Adonis glances at his opponent, who stares back emptily. The door opens off screen. REFFEREE (O.S.) Vamanos! The two fighters stand up. INT. RING- FIGHT CLUB/ BAR- TIJUANA MEXICO 3   3  Adonis, prances around the ring, avoiding Florez who is struggling to make contact, and growing tired. Florez corners Adonis up against the ropes, and after missing a few jabs, WHAM he ducks into Adonis and lands a pretty deliberate head but above his left eye, opening a deep gash. As Adonis tries to recover: WHAM WHAM, he lands two bone crunching hooks to the gut. Adonis takes an airless breath and stumbles back to the middle of the ring, wiping blood from the gash as the bell sounds. Adonis heads to the corner, where a WAITRESS (40s) puts a stool down. He sits and she squirts water into his mouth. The bell for Round 3 sounds. He starts towards Flores, with more bounce in his stance. Flores takes a swing at his head, and Adonis evades. Flores swings again, and again, even harder, and Adonis ducks both and then crushes a left uppercut into Flores' chin, followed by a flurry of alternating punches that send Flores crashing to the matt- unconscious. The ref flies in waving, and Adonis spits his mouthpiece out and heads to the corner. REF (in Spanish)  6-7-8-9-10",
      "characters": [],
      "action_text": "Adonis looks on and starts biting at his glove to take it off. The ref walks over and pulls $500 out of his pocket, hands it to Adonis right there. EXT. US MEXICO BORDER- DAY 4   4  Several cars line up at the inspection booths. Adonis, drives in a primer colored 1967 Mustang, holding a T- shirt to his eye. He hands his passport to the BORDER PATROL AGENT, who looks at him, shakes his head, and signals him through. INT. ER WAITING ROOM- LOS ANGELES COUNTY HOSPITAL- EVENING 5   5  Adonis sits in a crowded ER waiting room. NURSE (O.S.) Donnie Johnson? EXT. BALDWIN HILLS STREET- NIGHT 6   6  Adonis’ Mustang pulls into a hillside driveway. He punches a code into a keypad, and a large iron gate opens. As he drives up the cobblestone driveway we pull back to reveal a breathtaking mansion, we notice the fresh bandage over his eye. INT. CREED MANSION- KITCHEN- CONTINUOUS 7   7  A hand wearing a massive wedding ring scoops beef stew into a bowl. We pull up to reveal MARY-ANNE CREED (70s), dressed modestly, but a regalness about her. She slides the bowl in front of Adonis, who sits at the kitchen island, and pours herself a glass of vodka. She puts her hand to his cut. MARY ANNE Do you have to come here after your fights? It’s like you want to rub my nose in it. ADONIS It’s tradition. (beat) Don’t you want to know if I won? MARY ANNE It doesn’t matter. Even when you win, you’re losing. (beat)  2.  (MORE) You given any more thought to going back to school? Adonis doesn’t say anything. MARY ANNE (CONT’D) What about the internship? ADONIS Maybe... if it works with whatever schedule Duke puts me on. MARY ANNE Have you even talked to him? ADONIS Tomorrow... what you got on TV? MARY ANNE Watching our boy. INT. CREED MANSION- LIVING ROOM- HOURS LATER 8   8  ON SCREEN- Walter White, in a desert standoff with members of a rival cartel, when... it cuts to credits. Mary Anne and Adonis sit next to each other on the couch. Adonis’ shoes off, his white socks dangling like a toddler. ADONI",
      "dialogue_count": 0,
      "word_count": 5295
    },
    {
      "scene_number": 2,
      "slugline": "INT. ADONIS’ APARTMENT- MOMENTS LATER 38   38  Adonis lays down on his back looking up at the ceiling. The music still plays, but so quietly that he has to strain to hear it. EXT. ROCKY’S HOUSE- MORNING 39   39  On the same street Rocky’s row house blends in with all the others. The door leading to the tiny back yard open, and Rocky exits. Dressed in modest, out of style clothing, and an old sweatshirt, he sits down on the top step and looks at the incredibly old, cracked heavy bag that still hangs from its rusted chain. He sips coffee from a mug and thinks. INT. MICKEY’S GYM- DAY 40   40  Several FIGHTERS warm up inside. Adonis walks past a   small SIX YEAR OLD fighter sitting at the edge of the ring, putting on his hand wraps. Adonis turns to the larger ring, where LEO “THE ASSASSIN” SPORINO JR. (20’s Italian American) works drills with his father “PISTOL” PETE SPORINO (40s Italian) who still looks like he may have a couple of fights left in him.   Above the ring a large banner reads “2012 Golden Gloves Champion Leo “THE ASSASSIN” Sporino Jr. . Leo’s entourage looks on. INT. MICKEY’S GYM- MOMENTS LATER 41   41  Adonis and Sporino talk ringside, between rounds. SPORINO The membership is $50 dollars a month. You get unlimited access to the gym, and all the equipment. You with a trainer? ADONIS Not yet. SPORINO You amateur? ADONIS Pro. SPORINO Oh yeah? Where you from?  25.",
      "characters": [],
      "action_text": "ADONIS LA. SPORINO Hollywood! (beat) Which gym? I know all those guys. This stops Adonis in his tracks. ADONIS More self taught than anything. SPORINO Self taught... pro... (long beat) Well most members just work themselves out. For an extra $20 a month. I can give you drills, and check in with you when I can. You want to do that? Adonis nods. MOMENTS LATER- We find Adonis in the corner, doing step and punch on air, next to the six year old fighter, and a couple of other young BOXERS. He looks over at Leo working drills, envious. EXT. PHILADELPHIA STREET- NIGHT 42   42  Adonis walks down the sidewalk, looking around, questioning if he made the right move coming out to Philly. As he approaches a building, he sees a line of hipsters, mostly black standing outside. Hip- Hop music plays from inside. He keeps walking: not his type of crowd, but as he passes the window, he sees that stops him in his tracks. He looks back at the line, and heads towards it. The camera tracks over to reveal a large flyer with a photo of Bianca on it. INT. PENN CAFE- MOMENTS LATER 43   43  Adonis, holding a beer, stands in the back of the crowd watching Bianca finish up her set. BIANCA This last song, is for anyone who has ever had their heart broken.  26. The HOUSE BAND starts, and Bianca closes her eyes, moving to the beat. She sings, with a beautiful edge to her voice. Adonis watches her closely, she opens them and they seem to catch eyes. INT. PENN CAFE- MOMENTS LATER 44   44  Adonis watching the musicians packing up. We see his POV: Bianca giving the guitarist a hug. She walks over to the bar, and the BARTENDER hands over her purse from behind the counter. ADONIS Wussup, neighbor. Bianca looks up and sees Adonis, recognizing him immediately. She turns back to her purse. Putting the pack of cigarettes back inside. BIANCA Workout boy. I thought that was you. Adonis smiles this off. ADONIS Nice show. BIANCA (disinterested) Thanks. ADONIS Yeah... Can I buy you a drink? BIANCA No. ADONIS Wuss",
      "dialogue_count": 0,
      "word_count": 774
    },
    {
      "scene_number": 3,
      "slugline": "INT. ADONIS’ APARTMENT- NIGHT 45   45  Adonis sits on his back, video chatting with Kayla on his iPAD. He says goodnight to her and hangs up. Just as Bianca’s music starts up again. Adonis listens for a bit. Then gives up on any chance of sleeping, and rolls out of bed and starts doing pushups. INT. BT CONVENTION CENTER / BACKSTAGE - DAY 46   46  It’s a PACKED HOUSE- a sellout crowd has gathered the around the weigh- in stage. A banner reads:   PORTER VS WHEELER: FIGHT OF THE CENTURY. Wheeeler and Porter, wearing only black briefs, approach each other for the stare down. Nose to nose, the two mumble threats at each other, until Porter pushes his forehead against Wheeler’s face. Wheeler gives him a hard shove back and, WHAM! Porter cracks Wheeler across his face with a right, crumpling him. A melee breaks out as both camps descend on each other.   FREEZE FRAME ON THE CHAOS ESPN ANCHOR (V.O.) That was the scene earlier today at the weigh in for the Porter- Wheeler fight. INT. MICKEY’S GYM- DAY 47   47  We pull back to reveal Adonis and a few other patrons watching Sportscenter in between rounds. ESPN ANCHOR Wheeler, who suffered a broken jaw in the fight, and has already announced plans to sue both Porter, and the WBC. Adonis goes back over to the heavy bag, and works drills away from all of the action of Sporino, Leo, and their entourage. INT. ADONIS’ APARTMENT- NIGHT 48   48  Adonis paces his apartment, bored. Bianca’s music can be heard from upstairs. He walks over to his kitchen and looks inside of the refrigerator- nothing but bachelor food. He looks up at his ceiling. INT. ADONIS’ APARTMENT HALLWAY- 49   49  Adonis knocks on Bianca’s door. This time she doesn’t stop the music, and just opens the door and stares at him blankly.  29.",
      "characters": [],
      "action_text": "ADONIS I’ve been hearing you up here working for a while. (beat) I was wondering if, you wanted to grab a bite? Bianca looks at him suspiciously. BIANCA You asking me out on a date? Or are you extending another olive branch? ADONIS I’m asking you if you’re hungry. (beat) I know how I am when I’m focused. Sometimes I forget to eat... It’s not a date... Bianca stares at him. Then looks back into her room. BIANCA I can’t do more than an hour. Where did you want to go? ADONIS I was hoping you could tell me. Maybe we go somewhere in your hood. BIANCA My hood? (beat) You sure you ready for that? Adonis nods. Bianca smiles. EXT. WEST PHILLY STREET CORNER- NIGHT 50   50  Adonis follows Bianca closely as they walk towards a florescent soaked Chinese Food Restaurant on a gritty, graffiti stained street corner. Several young, tough looking, kids stand outside on the street, staring Adonis down. ADONIS Where are we right now? BIANCA West Philly.  30. ADONIS So this is why the Fresh Prince’s mom sent him to Bel Air. Bianca chuckles at this. INT. CHINESE FOOD RESTAURANT- PHILLY 51   51  It’s a gritty restaurant. Graffiti stained windows, mostly African- American patrons, Chinese American staff serves the register. We find Bianca and Adonis sitting down near a window, tearing into their food with their chopsticks. BIANCA I been coming to this jawn since I was a kid. My parents own a store a couple blocks over. She scrapes pieces of general chicken onto his plate. ADONIS What’s a jawn? BIANCA Jawn... that’s Philly for anything. (Pointing out each item of food) See these, is jawns. These is jawns. That shirt you’re wearing, that’s a jawn. Adonis smiles at his cultural tour guide. ADONIS You got a dude? Bianca shakes her head. BIANCA Too much going on right now. Don’t have the time. ADONIS Booking a lot of shows? Bianca nods. BIANCA Need about 5 a month just to pay the rent. Also making a ton of music.  31.  (MORE) Tryna finish this EP by next week. Got a shot at opening for Rihanna ",
      "dialogue_count": 0,
      "word_count": 1302
    },
    {
      "scene_number": 4,
      "slugline": "INT. RING- MICKEY’S GYM- MOMENTS LATER 55   55  Adonis adjusts his headgear, trying to warm up. In the other corner, Leo stands already good to go. The bell sounds, and the fighters head towards each other. Adonis comes out with a lot of bounce, evasive but Leo, focused and methodical, quickly cuts the ring off on him and begins to punish him with jabs and hooks to the body. INT. MICKEY’S GYM- BACK 56   56  A door unlocks and opens in the back corner of the gym, away from the commotion of the ring, and Rocky steps in keys in hand. He’s dressed even more modestly than usual, as he walks towards the commotion of the sparring match, hanging back, out of sight. INT. RING- CONTINUOUS 57   57  Adonis is leaning up against the ropes, his back to Rocky, caged up against an all out barrage of hooks from Leo. SPORINO C’mon Hollywood, lets see that West Coast swag. He leans back on the ropes and counters, the first one lands, but Leo ducks the second and lands a three hit combo on Adonis’ head. The last one sending him to a knee. Leo backs off holding his hands up in the air. LEO Pro, what? Get me another one, pops! Adonis tries to shake off the blow, and he looks outside the ring and catches eyes with, Rocky. Who looks back at Adonis with a worried look. Almost on- sight, Adonis stands up. He bangs his gloves together. ADONIS Come’ on. I thought philly was tough, them love taps, boy! Leo turns around to Adonis. Rage in his eyes. He comes at Adonis swinging hard. Adonis ducks the punches, and counters with two hard left jabs to his nose, each one snapping his head back. Leo stumbles back, then counters with a hook to Adonis’ gut.  36.",
      "characters": [],
      "action_text": "The round buzzer sounds and Adonis backs off, but Leo comes forward wanting more. Blood trickles out of his left nostril. LEO Come’ on! Sporino comes into the ring and quickly steps between the two fighters. SPORINO Hollywood, you’re good for the day. He grabs Leo’s face, looking at his nose. LEO Naw, let us keep rockin. SPORINO Chill out. What are you gonna have World War III in a sparring session... Adonis turns back to where Rocky was standing, and finds: no one. He bites at his glove tape, dejected. EXT. ADRIAN’S RESTAURANT- NIGHT 58   58  Rocky is seen turning out the lights, then exits. He begins to cross the street when he hears a familiar voice. ADONIS (O.S.) Why’d you leave? ROCKY Whatya doin out here? ADONIS Taking a walk... that was you at the gym, right? ROCKY Yeah that was me. Had to get back to some things here. ADONIS Why didn’t you stay. ROCKY I had seen enough. (beat) Seeing you take punches in there, brought back memories. Not so good ones, you know?  37. ADONIS What was I doing wrong? ROCKY I don’t know... (beat) Off the top of my head... you can’t lean on the ropes against a fighter like that... tall like. You drop your weight, and spin keeping him close. Go right through him. Adonis looks at Rocky for a long beat. ADONIS See... that’s what I’m talking about... You’ve got all this knowledge in there... (points to Rocky’s head) but you sell spaghetti? Walk around here like a ghost? Rocky looks down. ADONIS (CONT’D) Mickey... he trained you right? And my grandpa, and Duke? It’s selfish of you not to give back. Especially with us being like family. ROCKY Why you keep saying that, kid. ADONIS What? ROCKY Family... we just met. ADONIS But you and my grandpa was like brothers right? Rocky sighs. ADONIS (CONT’D) He died and left me with a bunch of people that don’t get me. But I think he would have. And I know you do. ROCKY I don’t get you, kid. Boxings the worst sport there is.  38.  (MORE) People slap you on the back, telling ya how great you are, but",
      "dialogue_count": 0,
      "word_count": 5620
    },
    {
      "scene_number": 5,
      "slugline": "EXT. PHILADELPHIA STREET - DAY 83   83  Bianca walks briskly while Adonis tries to catch up. ADONIS Slow down... She walks faster. ADONIS (CONT’D) Hey. Adonis tries to grab her hand, but Bianca pulls away and continues to walk. She goes to the corner and tries to catch a cab. The cab pulls up, Adonis pushes past Bianca and closes the door, telling the driver to take off. Bianca tries to catch another one. ADONIS (CONT’D) What are you doing? BIANCA Going home. ADONIS Why? What you trippin for? BIANCA Are you seriously asking me that? (beat) I made love to you last night... and then I turn on the news and find out you’ve been lying to me. You have any idea how that makes me feel? Do you even care? ADONIS I didn’t lie to you. BIANCA I distinctly remember asking why you’re a fighter. That would have been the perfect time to say, “You know, I’m related to the most famous boxer who ever lived...” Adonis searches for an answer. ADONIS People look at me different when they know. I didn’t want you looking at me like that.  63.",
      "characters": [
        "BIANCA"
      ],
      "action_text": "BIANCA I’m not people...   I don’t care about that kind of shit. I care about you keeping it 100 with me. ADONIS Alright. From here on out, 100 percent honest and up front. Just come back to the house with me. Bianca rolls her eyes at this. ADONIS (CONT’D) I’m serious! On my grandfather’s grave. (beat) We can start right now. Ask me anything. BIANCA Anything? ADONIS Anything. Bianca smiles. She can’t help but to be intrigued. BIANCA How many girls you been with before me? Adonis winces. ADONIS You’re different. BIANCA How? ADONIS Cause I want to be around you all the time. I never felt like that with anybody. BIANCA It’s cause it’s new. ADONIS But it doesn’t feel new. It’s like I’ve known you forever. When I’m close to you, it’s like I can do anything. Bianca crosses her arms, and looks off for a beat.  64. ADONIS (CONT’D) Tell me you don’t feel the same way. Tell me you don’t and I’ll drive you home myself. BIANCA That’s passion, it’s infatuation. That fades. ADONIS I can’t see that. BIANCA Why not? ADONIS Shit feels too right. You make me want to work hard. Want to win. BIANCA So I’m just a good luck charm? ADONIS You could find an insult in a box of roses, huh? BIANCA Naw, I just find the real. (beat) It’s cool though. Maybe you’re my good luck charm too. Bianca stares at him. She smiles. ADONIS What? BIANCA You do look like him. Adonis quickly points at Bianca’s face, smiling. ADONIS See! I knew it! Adonis quickly grabs her by her knees and lifts her up high into the air inducing a playful shriek. Her phone buzzes. And she answers it while Adonis is holding her. BIANCA (into phone) Hello... Yeah this is she... (to Adonis) Put me down! Put me down!  65. Adonis obliges. She puts her finger in her ear to hear the phone better. BIANCA (CONT’D) Are you serious? Of course... Of course... This is foreal, right? Absolutely. Thank you so so much. Bianca hangs the phone up, and takes off running at full speed, screaming in joy. Adonis, confused, sprints after her. ADONIS ",
      "dialogue_count": 1,
      "word_count": 2416
    },
    {
      "scene_number": 6,
      "slugline": "EXT. ROCKY’S HOUSE 94   94  Adonis looks at Bianca, who paces on the porch, wrapping up what looks to be a very serious phone call. ADONIS What’s going on? BIANCA I just talked to one of the top tour managers in the country. ADONIS And... BIANCA He’s gonna be at the show tomorrow. ADONIS (beat) That’s amazing, right? BIANCA It’s just... It just feels like even more pressure. ADONIS Pressure’s good, it’s what you work so hard for. Bianca looks at Adonis for a beat, and smiles at him. ADONIS (CONT’D) Come’on. I’m smelling that food you guys have been cooking up. They head inside. INT. ROCKY’S HOUSE KITCHEN 95   95  The four of them eat dinner, and talk. It’s unconventional, but a family nonetheless. INT. ROCKY’S HOUSE- KITCHEN- LATER 96   96  Adonis washes the dishes, while Rocky dries them and puts them away. Bianca walks over to Adonis. BIANCA I’m gonna take off, babe. Got the tech rehearsal early.  76.",
      "characters": [],
      "action_text": "ADONIS I’ll drive you. BIANCA Cab is already outside. (beat) Come early tomorrow, it’s gonna be crazy. ADONIS I’ll come straight from workouts. I won’t even shower. BIANCA Gross. I’ll disown you... She gives him a hug, and a kiss. BIANCA (CONT’D) Bye Rocky. ROCKY Knock em dead sweetheart. She playfully shadow boxes the air, then heads out. EXT. PHILLY SOUL MUSIC FESTIVAL- SUNRISE NEXT MORNING 97   97  Workers drink coffee and bring equipment inside for the concert. INT. JOE HAND BOXING GYM- AFTERNOON 98   98  Marcel sits at the counter watching Rocky work out Adonis in the distance and the phone rings. He answers. MARCEL Hello... yeah... who is this? Okay hold on. Marcel heads over to the ring where Rocky watches Adonis work out. MARCEL (CONT’D) Rock... its the hospital on the phone. This catches Adonis’ ear. Rocky looks around and sees everyone’s concern. He heads over to the phone and picks it up.  77. ROCKY Yeah. DR. SHAHANI Mr. Balboa, this is Dr. Shahani- would you be able to stop by today? ROCKY What’s up? DR. SHAHANI It would actually be better if you came in to talk with us in person. Rocky looks over at his camp for a beat. INT. HOSPITAL - EXAMINATION ROOM - DAY 99   99  Rocky, wearing street clothes, sits in the consultation room. Dr. Shahani sits across from him. DR. SHAHANI Well, we went through your test results. And the neurological tests came back as I had expected. But your MRI and blood tests came back showing signs of Hodgekins lymphoma. ROCKY What’s that do? DR. SHAHANI Well Hodgekins is a very rare form of cancer. ROCKY Cancer? DR. SHAHANI The good news is, we caught while there is still a chance... We’ll have to remove the tumor in your lymph nodes, and start chemotherapy immediately. Rocky takes all of this in for a beat, while Dr. Shahani continues the prognosis. He stands up, grabs his coat. ROCKY Chemo- my wife tried that stuff. Didn’t work out so good for her.  78. DR. SHAHANI Mr. Balboa... I’d like to go over our options for treatment. Com",
      "dialogue_count": 0,
      "word_count": 1129
    },
    {
      "scene_number": 7,
      "slugline": "EXT. ROCKY’S HOUSE- NIGHT 104   104  Rocky walks out of the front door looking for Adonis. He opens the door and sticks his head in. ROCKY Kid? A UPS LADY walks up behind Rocky, with a package for him. He turns and takes it, looking at it with suspicion. EXT. PHILADELPHIA- NIGHT 105   105  Series of shots Adonis jogs the familiar route. Several miles through the city of Philadelphia. Tears in his eyes. He arrives at the museum steps and sprints up them without hesitation. He gets to the top, lays down on his back, and passes out. INT. BACKSTAGE PHILLY SOUL CONCERT- NIGHT 106   106  Bianca, wearing leggins and a beautiful top, paces behind the stage, getting ready to perform. She peeks out at the crowd, looking to see everyone getting seated. INT. BATHROOM STALL 107   107  On Bianca- having a panic attack. She pukes into the toilet, wipes her mouth, takes some deep breaths, and pulls out her cellphone and calls a number. INT. ROCKY’S HOUSE- ADONIS’ BEDROOM- NIGHT 108   108  Adonis’ cellphone buzzes on his bed. “BIANCA CALLING” flashes on the screen. INT. BATHROOM STALL- CONTINUOUS 109   109  Bianca talks into the phone, leaving a message. BIANCA Hey, you here yet? I’m freaking out over here... I gotta see you before I go on. I guess I’ll keep trying you.  82.",
      "characters": [],
      "action_text": "Bianca hangs up. She starts dialing again. EXT. MUSEUM STEPS- NIGHT 110   110  Adonis, still asleep on his back. A SECURITY GUARD wakes him up. Adonis takes a deep breath in, and looks around. Slowly realizing where he is. He looks down at his phone and fear flashes over his face. ADONIS Shit! Shit! He takes off running down the steps and hails a cab. EXT. PHILLY SOUL FESTIVAL 111   111  We open close on Bianca’s face. She’s looking off into the crowd, where Adonis is nowhere to be found. The music starts, and she starts singing, and she struggles... She looks into the crowd for a beat, then starts again. EXT. PHILLY SOUL MUSIC FESTIVAL- ENTRANCE- NIGHT 112   112  A cab pulls up on the street corner of the club, and Adonis hops out. EXT. PHILLY SOUL MUSIC FESTIVAL-VIP SECTION 113   113  Rihanna plays on stage as Adonis cuts through the sizeable crowd towards the VIP section where we see Bianca and a few other musicians standing by the large metal fold up chairs behind metal fencing. ADONIS (screaming over the music) Bianca! Bianca! Bianca sees him, and looks at him for a beat, before turning her back and disappearing deeper into the crowd. Two Security Guards head over to the Adonis. ADONIS (CONT’D) Say bro, my girl is back there. SECURITY GUARD No standing over here bro... The Security Guard firmly pushes Adonis against his chest. Adonis knocks his hand away. And looks towards where Bianca disappeared to.  83. He rushes the gate, in an attempt to get past the guards, and one of them bear hugs Adonis across the neck. Adonis slips out, and punches him in the nose, dropping him. The Security Guard, his nose bleeding, picks up a folding chair. More guards run over to Adonis, grabbing him and punching him SMASH! One brings the folding chair right to the side of Adonis’ face. Adonis falls as a guard pulls out handcuffs. INT. ROCKY’S HOUSE- ROCKY’S BEDROOM- NIGHT 114   114  Moonlight streams into the bedroom, where Rocky lies atop the bed, half awake, half sleep. The hous",
      "dialogue_count": 0,
      "word_count": 1454
    },
    {
      "scene_number": 8,
      "slugline": "EXT. ROCKY’S HOUSE- NIGHT 122   122  Adonis walks up the steps and keys into the front door. INT. ROCKY’S HOUSE- KITCHEN 123   123  Rocky sits at the dinner table, eating pasta and salad. He looks up as Adonis enters the door and walks in. There is a beat of silence between Rocky and Adonis. Rocky gets up, and walks over to the cabinet and grabs a bowl. He puts some salad into it, some pasta, and then sits it down on the table. Adonis sits down and starts eating. ADONIS I’m not training if you don’t get treatment. ROCKY Eat. You look like you lost five pounds. ADONIS Can’t be taking orders from a quitter. You can’t throw the towel in to this cancer shit. Rocky thinks on this. ADONIS (CONT’D) What makes this different than any of your other fights? (beat) If I fight, you fight. Rocky takes a long beat. And nods. Adonis extends his closed fist towards Rocky. Rocky punches it, and they eat. INT. HOSPITAL- CONSULTATION ROOM- DAY 124   124  Rocky and Adonis sit across from Dr. Shahani DR. SHAHANI Dr. Warren is going to walk you through the procedure. Rocky nods.  89.",
      "characters": [],
      "action_text": "DR. WARREN So we’ll be putting you under general anaesthesia, and removing the tumor from right here. Now once we’re in there, if we see any other questionable tissue, we will remove that too. ROCKY When? DR. WARREN As soon as possible. Rocky looks on at the CT Scan. Adonis standing beside him. INT. RECOVERY ROOM- AFTERNOON 125   125  Rocky wakes up, hooked up to IVs in the dim room. He looks over, and sees Adonis sitting in the corner looking back at him. Rocky stiffly sits up, and starts pulling at his IVs, as if he’s trying to leave. Adonis springs up. ADONIS Chill, chill, chill. It’s all good. ROCKY Did you get your workout in? Adonis shakes his head. ADONIS I stayed. Rocky feels at his neck. There is a large bandage on the side of it. ROCKY They get it all? ADONIS I don’t know. They said they’ll come and talk to us about it when you wake up. Rocky starts feeling around his bed again.  90. ADONIS (CONT’D) Chill out man, what you looking for. ROCKY Jacket... my jacket. Adonis reaches over to the chairs and grabs Rocky’s coat. He hands it to him. Rocky digs in it and pulls out his stopwatch. ROCKY (CONT’D) Let’s go, pushups, burpies, sit- ups, shadow box super-sets. (beat) Let’s go! Adonis looks at him like he’s fucking crazy. ADONIS Right here? ROCKY You think Porter aint working out right now? You think he doesn’t want to dismember you in front of his people? (beat) Go! BEEP. Rocky hits the stopwatch. Adonis obliges. START MONTAGE Adonis works out at Joe Hand’s with Amir. Rocky sits in a chair, ringside still bandaged on his neck. Rocky gets hooked up to the chemotherapy machine. Two large IV’s hooked up to his arm. On the other side of the room, Adonis sets up a standing speed bag, and a standing body dummy. He installs a pullup bar in the door jam. Adonis works out, while Rocky receives treatment Adonis helps Rocky, weakened from the chemo session to the van. Adonis lifts weights in the gym. Adonis hauls massive bags of fertilizer in Rocky’s backyard. Rocky, b",
      "dialogue_count": 0,
      "word_count": 1168
    },
    {
      "scene_number": 9,
      "slugline": "INT. BIANCA’S APARTMENT 128   128  Bianca leans up against the other side of the door, holding back tears. INT. ADONIS’ APARTMENT HALLWAY- CONTINUOUS 129   129  Adonis knocks on the door. ADONIS Bianca... open the door... He sighs, and leans on it with his palms placed high. He steps back and pulls an envelope out of his pocket. Then slides it under the door. ADONIS (CONT’D) That’s everything you need to get out to Liverpool in there. It would mean a lot to me and Unc if you could make it. But if not, promise me you’ll at least watch. He waits for an answer from the other side of the door, and receives none. He heads off. INT. BIANCA’S APARTMENT 130   130  Bianca leans up against the other side of the door and listens to Adonis leave, holding back tears. INT. PHILADELPHIA INTERNATIONAL AIRPORT 131   131  Adonis, Rocky and their team stand in the boarding gate of the airport. Adonis holds his cellphone to the side of his face, looking towards the escalator. Joe Hand, Marcel and Amir are preparing to board, looking back at Adonis. Adonis, frustrated, hangs up the phone. He starts to dial again when Rocky touches him on his shoulder. ROCKY We gotta roll, kid. Plane aint gonna wait for us. Adonis looks back to his phone. ROCKY (CONT’D) She needs time, that’s all.  95.",
      "characters": [],
      "action_text": "Adonis puts his phone back into his pocket and boards the plane with the group. EXT. LONDON INTERNATIONAL AIRPORT 132   132  We track a large international commercial airplane from underneath as it lands on the runway, we then boom up to reveal the London Skyline. INT. LONDON CONVENTION CENTER- PRESS CONFERENCE 133   133  Porter’s camp sits at he press conference table on one side, while Rocky, and Adonis sit on the other. Several reporters clamor for attention and have intense questions for Adonis and Rocky. REPORTER 1 Porter can we expect any more fireworks at the weigh in? PORTER I’ve been doing a lot of anger management. And learning how to turn the other cheek, and whatnot. HOLIDAY I just gotta make sure he unlearns all of this before Sunday morning. The crowd laughs. REPORTER 2 Balboa, there are rumors circulating back in the states about your health, some sources saying that you have been diagnosed with a serious health issue. ROCKY Yeah, it’s called   ageing.   Very contagious, so watch out. The crowd guffaws. REPORTER 3 I here has been questions raised about the odd nature of having a 5am start time, in order to maximize pay per view profits in the states. Could you both speak to how that might affect you.  96. Adonis looks at Porter, a bit unsure if he should go first. ADONIS If anything it’s an advantage for me, because it’ll be normal fight time where I’m from. PORTER It’s simple for me. 5 in the morning is just as good a time for an ass whoopin as any other. Adonis leans over and mean mugs Porter, who isn’t even looking at him. REPORTER 4 What about the contrast between you two, you the experience, the rags to riches background, vs. Johnson’s overnight success. ADONIS Well I wouldn’t- PORTER Everybody’s path is different. Some people have it better than others. My grandfather was a fisherman. His grandpa was the heavyweight champion of the world. Some people get things handed to them, while others have to earn it... Next question. The two fighters stare",
      "dialogue_count": 0,
      "word_count": 1083
    },
    {
      "scene_number": 10,
      "slugline": "INT. INTIMIATE PHILADELPHIA CONCERT VENUE- BACKSTAGE 139   139  Bianca and the band get backstage, The crowd can be heard chanting, “ENCORE, ENCORE, ENCORE” MANAGER You guys have to go back out. A couple more songs. Bianca looks down at her phone. EXT. CONCERT VENUE 140   140  Bianca frantically jumps into a taxi cab, with her carry on luggage.   It looks as if she ran straight from the stage. INT. PHILADELPHIA AIRPORT- MOMENTS LATER 141   141  Bianca runs through the airport as fast as she can move with her rolling luggage. She comes up to the gate just as the flight attendant closes the door. BIANCA Wait! The attendant ignores her. Bianca looks around, in panic mode. INT. PHILADELPHIA AIRPORT- MOMENTS LATER 142   142  Bianca talks to a flight attendant behind a desk. AIRLINE AGENT Our best bet would be to put you standby on a flight to manchester. BIANCA That’s fine, I just have to get there, you don’t understand. The agent, continues to search through options for Bianca. EXT. ANFIELD STADIUM- DAY 143   143  Adonis, Rocky and camp arrive at the stadium. Security is getting in place for the match and Adonis and Rocky get out of the car and look at massive entrance of the iron gates.  100.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 211
    },
    {
      "scene_number": 11,
      "slugline": "EXT. ANFIELD STADIUM- NIGHT 144   144  The parking lot is full, and the exterior of the stadium is alive with the electricity of a soccer match. Rowdy fans swarm the doors. INT. ANFIELD STADIUM- VISITOR’S LOCKER ROOM- NIGHT 145   145  Adonis, Apollo shorts and a modest robe rolls his neck, warming up.   Rocky, Joe, and Amir sit in chairs behind him. INT. ANFIELD STADIUM- HOME LOCKER ROOM 146   146  Porter shadow boxes into the mirror, Holiday watches through the reflection. INT. ANFIELD STADIUM- VISITOR’S LOCKER ROOM 147   147  Rocky laces his gloves his hands moving slowly. INT. ANFIELD STADIUM- HOME LOCKER ROOM 148   148  Holiday wraps the tape around Porter’s glove, with expert precision.   When done, Porter stands, Holiday sticks out his hand, and Porter punches it, hard. He turns to Junior, and G close by. PORTER Let’s give em a little action, for good luck now. Junior smiles and pounds his father’s gloves with all his might, top then bottom. Next, G, who does the same. INT. ANFIELD STADIUM- VISITOR’S LOCKEROOM 149   149  Rocky finishes the tape on Adonis’ glove. He struggles to tear the roll off... Amir sees this, and jumps in and quickly tears it off. Rocky and Adonis lock hands Adonis matches him, and they sway back and forth like cobras. ADONIS One step... one punch... one round... one fight. ROCKY Again.  101.",
      "characters": [],
      "action_text": "ADONIS One step... one punch... one round... one fight... Rocky throws soft jabs at Adonis. They come slow but rhythmic. Adonis ducks each one with the same rhythm. ROCKY It’s gonna be more people than you’ve ever seen before in your life... ADONIS One step... one punch... one round... one fight... ROCKY But they don’t matter... Adonis continues saying the mantra. ROCKY (CONT’D) We’re a long ways from home... but that don’t matter... all that matters is how much you want it... And you want it more than him, kid. I can see it in your eyes. INT. CALIFORNIA MEN’S COLONY- SAN LOUIS OBISPO 150   150  Terrel, in his cell, eats dinner off a tray, across from his CELLY (Black, 50s). A Corrections Officer walks up to him, and motions for him to come out. INT. CALIFORNIA MEN’S COLONY- SAN LOUIS OBISPO- HALLWAY 151   151  The CO leads Terrel down a hallway and opens a small room for him. INT. CALIFORNIA MEN’S COLONY- SAN LOUIS OBISPO 152   152  Terrel walks inside the rec room, to find a chair sitting across from a small TV, with the fight on. He nods at the CO, who nods back, and closes the door. He walks over and sits down.  102.",
      "dialogue_count": 0,
      "word_count": 435
    },
    {
      "scene_number": 12,
      "slugline": "INT. CLABSADDLE HOUSE 153   153  Daryl and the kids sit on the couch watching cartoons. He sneaks off to Adonis’ room, where the fight is already cued up. INT. CREED MANSION- LIVING ROOM- NIGHT 154   154  Mary-Anne her tumbler next to her on the side table looks on at the pay per view broadcast of the match. The Door Bell rings. She opens the door to find Lisa. Who walks straight to the couch and sits down in front of the television. Mary Anne thinks for a beat, then goes and sits down next to her. INT. ANFIELD STADIUM- VISITOR’S LOCKEROOM 155   155  Adonis continues to run drills with Rocky. The door opens in the locker room, and a STADIUM STAFF MEMBER waves at them. JOE HAND It’s time. INT. ANFIELD STADIUM- VISITOR’S TUNNEL 156   156  Adonis walks into view slowly, Rocky behind him, slower than we’ve seen him. His hand rests on Adonis’ shoulder for balance. Joe Hand, Amir, and Marcel walk out as well. The entire camp a ball of nerves but they hide it well. Adonis’ INTRO MUSIC plays. It is the song Bianca made for him. INT. MANCHESTER AIRPORT 157   157  Bianca is going through customs. The lines are massive. INT. BULLET TRAIN 158   158  Bianca looks at the time on her phone, then stares out of the window   of the train. INT. ANFIELD STADIUM- VISITORS LOCKER ROOM 159   159  Adonis, Rocky and camp are walking through the entrance tunnel, and now approaching the stadium ramp. Stone faced, walking in unison at a slow pace.  103.",
      "characters": [],
      "action_text": "INT. ANFIELD STADIUM 160   160  It’s a sea of Red Liverpool FC jerseys and some of the fans are wearing face paint. They boo, but the sound system drowns most of it out. ROCK It’s your night kid. This is what it’s all about. They arrive at the ring. Adonis bounces. He looks out and the reality of the size of the stadium sets in. ADONIS’ POV FROM THE RING 40,000 screaming fans. The stadium is open up top, over the ring. Clouds circle overhead- a modern day Roman Coliseum, fit to feed gladiators to lions. BACK TO SCENE Rocky limps over to Adonis, places his hand on his shoulder. ROCKY You freaking out? ADONIS Yeah. ROCKY Very normal. First title fight, I almost passed out. ADONIS What’d you do to stay cool? ROCKY Faked it. Like everybody does. Adonis nods. He throws some punches. Stay loose. Music starts, and the ENTIRE STADIUM SINGS “YOU’LL NEVER WALK ALONE”- the Liverpool F.C. Anthem. INT. ANFIELD STADIUM- HOME TUNNEL 161   161  Porter enters the stadium, with G sitting on his shoulders wearing a title belt, Holiday to his left, and Junior to his right holding a belt in the air. Around him seems to be at least 40 of his friends and at least 10 championship belts. The crowd is deafening.  104. Porter springs into the ring. His entourage floods into the ring and all of them stare down Adonis. Porter immediately comes out of his robe and we see his trunks, Red and Gold, a skirt with an English flag over it. INT. RING- ANFIELD STADIUM- MOMENTS LATER 162   162  Adonis and Porter in the middle of the ring, alone, the REFEREE pulls them in. He talks in a thick Scouse accent. REFEREE Watch the hits below the belt, make sure you guys honor my commands, honor each other. We’ll make it a good fight, make it a hard fight, sound good? Both fighters nod. REFEREE (CONT’D) Go’on and touch em’ up. PORTER Nice shorts. Too bad your grandpa ain't here to fight for ya. I’m gonna send you home, boy. Adonis’ eyes tighten in anger. Before he can respond Porter sprints back to his corner. A",
      "dialogue_count": 0,
      "word_count": 984
    },
    {
      "scene_number": 13,
      "slugline": "INT. ADONIS’ CORNER 165   165  Rocky gives Adonis water. ROCKY He really is that fast, he really is that good... but you know what? You belong in this ring with him, tonight. Go prove it. He puts his mouthpiece back in. The bell sounds. INT. RING- ANFIELD STADIUM- CONTINUOUS 166   166  The fighters approach each other quickly. Adonis dodges a couple punches then cages up, putting his hands over his face and body to protect. Porter pounds Adonis’ body. A hard left connects with Adonis’ ribs, causing Adonis’ mouthpiece to pop out. A thunderous right hook connects with Adonis’ jaw. Sending his mouthpiece flying. He fakes the left hook, then hits Adonis with a right hook over the eye, opening his stitches. ANNOUNCER Johnson is hurt. The ref slides in to save Adonis, and he stumbles over to grab his mouthpiece and replace it. ANNOUNCER 2 Johnson is saved by loosing his mouthpiece. He looks to be out on his feet. ANNOUNCER That gash above his left eye is leaking. Look for Porter to start attacking that side. Adonis smiles at Porter. ADONIS Let’s go! Is that all you’ve got? Let’s go! PORTER (smiling back) I got plenty more. The ref gives them the clear sign.  107.",
      "characters": [
        "ROCKY"
      ],
      "action_text": "Porter approaches, Adonis sways, like a cobra. He drops his hands, Ali style, baiting. Porter comes in, WHAM! Adonis sends a lightning fast jab that slips between Porter’s hands and catches him in the face. Porter stumbles back. ANNOUNCER Whoa. Johnson lands his first punch of the night on Porter. ANNOUCER 2 Yeah but it’s gonna have to take a lot more than that. Adonis comes back in on Porter and goes on the attack- Adonis throws combos, every third punch seems to land right on target. Hard. Adonis dodges Porter’s counter punches Adonis swings a left jab to the body. CRACK! A hard right to the bridge of Porter’s nose, opens him up. ANNOUNCER Porter’s hit, he looks to be cut! Porter bobs back but stays on his feet, Adonis gets greedy, and swings wildly. Porter ducks and hits Adonis with a straight shot, that sends down to the mat. The crowd erupts. ROCKY Get up! The referee counts. Adonis bounces back to his feet. ANNOUNCER First knockdown of the night for Porter, but Johnson is back on his feet. We’re gonna see a little more of this dynamite round 2. ANNOUNCER (CONT’D) Thank God for that. This was just getting good. The ref stops and checks with Adonis. Adonis straightens up. “10 SECOND CLAPS” sound. Porter’s wound bleeds over his eye. The fighters go right back at each other. Adonis is nicked with an uppercut to the chin, but comes back with two hard straights to Porter’s face.  108. The Bell sounds but Porter punch catches Adonis, who throws another set. They continue to box until both camps clear the corners and jump into the ring to break them up. During the commotion Rocky is pushed down to the mat. Adonis sees Rocky fall and snaps. ADONIS Let’s go, I ain't worried about the bell. Let’s do this right now! PORTER (smiling) I’m right here, mate. Don’t let those chumps hold ya back! ADONIS Take the gloves off! Fuck the bell! You gonna catch my fade! The two groups successfully get the fighters back to their respective corners, but Adonis fumes. ANNOUNCER These two",
      "dialogue_count": 1,
      "word_count": 2707
    }
  ]
}