{
  "slug": "da-5-bloods-2020",
  "title": "da 5 bloods",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 23,
  "characters_count": 0,
  "characters": [],
  "total_words": 24512,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. EDDIE’S CHEVROLET DEALERSHIP - PHOENIX, ARIZONA - DAY 3   3  MARVIN GAYE continues to croon as EDDIE, 65, in a casual business suit, Southwest style, is speaking with some BUSINESS TYPES, maybe Lawyers, who seem very serious. OTIS (V.O.) He’s the Big Shot Car Dealer. He listens, nodding, clearly impatient, looking at his Rolex, he motions for them to follow him. They continue to talk as he strides out of the building. EXT. EDDIE’S CHEVROLET DEALERSHIP - PHOENIX, ARIZONA - DAY 4   4  Eddie and the Business Types step out of the Large Dealership Building. They continue to follow. OTIS (V.O.) (CONT’D) After he got back to the World, he moved to Phoenix and knocked it out The Park selling Chevy’s. Eddie makes his way down a row of gleaming Chevy Malibu’s. He finally arrives at a New Red Corvette opening the door. OTIS (V.O.)(CONT’D) He’s had a couple Ex-Wives. Probably still drinks too much. He reaches under the visor retrieving a pair of shades putting them on. OTIS (V.O.)(CONT’D) Proud The Cat is a Big Damn Deal. He blows them off getting in The Vette and ZOOMING off! CUT TO: INT. MELVIN’S SUV - KANSAS CITY, KANSAS - DAY 5   5  WE pass Liquor Stores, Cigarette Billboards, Closed Stores, Dollar General Stores, abandoned Boarded Up Houses, rundown everything else. MELVIN, 55, Dapper and Smooth, drives down Quindaro Street, a tough hood in Kansas City, Kansas with his Wife, CISSY, 40, and his youngest son, MARCUS, age 12, who wears Ear Buds listening to RAP on his phone. They pass... 3.",
      "characters": [],
      "action_text": "ANGLE - HOUSE (MELVIN’S POV) Police Tape still surrounds it. Not a fresh Crime Scene, but POLICE INVESTIGATORS mill around still working The Case. A Major Crimes Truck is parked out front. MELVIN Killed the whole Family? CISSY Husband, Wife. Four Kids. MARCUS You remember Lavar, Dad? He came by not that long ago. You said he had a nice fade. MELVIN Cissy, they killed that Boy? Cissy nods, glances at Marcus. CISSY I been tryin’ to tell you. What these Fools won’t do for that Drug Money. Melvin turns staring at the House. OTIS (V.O.) Last time I heard from Melvin was Forever. Can you believe this, he actually lied about his age to get into The War? Cissy turns to Melvin. CISSY Let’s go before they start shootin’ agin’. CUT TO: EXT. PAUL’S HOUSE - OAKLAND, CALIFORNIA - DAY 6   6  PAUL, 60’s, steps out of his modest Ranch Style House in California. He wears a \"Vietnam Veteran\" Cap. CLARA (V.O.) That must be The Legendary Pumpin’ Paul. OTIS (V.O.) You remember me talkin’ about him? 4. CLARA (V.O.) How could I forget. Paul carries his luggage to his Car seeing next door his MEXICAN neighbors speaking Spanish working on an older vehicle in their driveway. CLARA (V.O.)(CONT’D) You said he had more guts than any Man you ever met. Paul turns sullen opening his trunk dropping in his luggage. He is about to slam the trunk when... CLOSE - ROBERTA 20, one of the Mexican Neighbors, stands before him holding a broken Oil Filter Wrench. Her English is limited. ANGLE - ROBERTA AND PAUL ROBERTA Señor, do you have an... um Oil... Filter... Wrench? Por Favor. PAUL Do I look like a Fuckin’ Walmart? Roberta just stands there. PAUL (CONT’D) I said do I look like a Fuckin’ Walmart? ROBERTA No, Señor. PAUL Then No Muthafucka I ain’t got No damn Oil Filter Wrench. Carry yo’ Ass on down da street to da Goddamn Walmart and BUY one. It’s right next to the Taco Bell. I’m sure you know where that is. Roberta walks away. Paul SLAMS The Trunk closed and talks to himself. PAUL (CONT’D) Whatdafuck I l",
      "dialogue_count": 0,
      "word_count": 641
    },
    {
      "scene_number": 2,
      "slugline": "INT. OTIS HOUSE - DETROIT - DAY 6A   6A  OTIS He has Guts and a lot else. CLARA So that must be Norman. Her finger pointing at him on the Photo. Otis gets quiet. CLARA (CONT’D) I understand. Let’s go, you can’t miss your Flight. INT. CLARA’S CAR - DETROIT AIRPORT - DAY 7   7  Clara pulls up to The Airport. She turns and hugs her Father, tightly, worried about him. CLARA I hope you find some Peace over there. He nods, then exits, grabbing his luggage. Clara watches him limp out to The Airport looking over finding the ROLLED UP MONEY in the seat next to her. Clara sighs. INT. COACH CABIN - VIETNAM AIRLINES - DAY 8   8  On a VIDEO SCREEN built into the back of a seat, a Yellow Flower dissolves into a Vietnamese Girl throwing a fishing net across a tranquil lagoon, bathed in golden light. Over the headset a Vietnamese softly sells... VIETNAMESE WOMAN NARRATOR (V.O.) ...tranquil, friendly, beautiful. Vietnam, a place of timeless charm. With destinations... ...Otis pulls off his headset, cutting off The Narrator, he yanks off the travel pillow removing his reading glasses. He can’t get comfortable. A   Shooting Pain   runs down his hip. OTIS God-Damn... He pulls out a prescription bottle of OXYCONTIN shaking out a little White Pill popping it. He reaches across the aisle grabbing Paul’s can of Ginger Ale washes it down. PAUL Gonna make it Dude? 6.",
      "characters": [],
      "action_text": "Paul is next to Melvin half-reading a Sports Illustrated. OTIS This seat is killin’ my Black Ass. Otis leans back hard in the seat trying to gain control. He looks over at Paul. OTIS (CONT’D) How’s Da Brother? Paul shakes his head. PAUL Man, I still can’t believe we goin’ back to Dis Bitch. OTIS I know. Paul looks at his hands. PAUL My damn hands are sweatin’. I ain’t felt dis way since the last time I was “In Country.” Otis listens. PAUL (CONT’D) Bad enough I can’t get these PTSD outta’ my head. Dream about dat Shit every night. OTIS Me too. PAUL Y’know, my memories grow old wit’ me. OTIS What do you mean? PAUL Da incidents never change, but I do. I age within da memory. Otis listens. You can see he feels that way too. OTIS Bro, I hear you. 7. PAUL Now here I am, of my own Free Will, goin’ back to dat God forsaken place. OTIS Seems like I recall back in 69’ somebody tellin’ me he volunteered to serve his “Country, Tis Of Thee.” Paul has to grin. PAUL See you remember dat Shit. OTIS Oh Yeah, We thought Yo’ Crazy Ass wuz Crazy. PAUL You got to understand back then, I was Young, Cock Strong, Dumb as a Rock. There’s a reason dey don’t send Old Men to Fight in The War. OTIS We wouldn’t go. PAUL You damn right. We know Death is Real. When you Young, you think you Ain’t Never Gonna’ Die. OTIS Yeah, I just keep tellin’ myself. We’re doin’ it Norm. Paul nods then takes out a Pen writing something on his drink napkin. He then passes it over to Otis. Otis takes the napkin, reading it. Paul winks at him. Otis cracks a devilish grin. FLIGHT ATTENDANT (O.S.) Ladies and Gentlemen, as We start our descent, please make sure your seat backs and tray tables are in their full upright position... 8. ANGLE - THE LIGHTS are turned down on the Plane as it quiets down preparing for descent. Otis leans forward to say something to Paul, but pauses seeing... CLOSE - PAUL’S HAND (OTIS’ POV) clenching the arm rest tightly as if bracing for a Crash. CLOSE - OTIS looks out at The Dark Jungle belo",
      "dialogue_count": 0,
      "word_count": 3438
    },
    {
      "scene_number": 3,
      "slugline": "INT. LOBBY - SAIGON PEARL TOWERS - NIGHT 18   18  Polished stone gleams under recessed lighting. Otis enters and a RECEPTIONIST behind a Mile-Long counter greets him. RECEPTIONIST Tôi có th? giúp gì du?c ông? OTIS Tien Luu, please. The Receptionist DIALS a number, then gestures to the HOUSE PHONE. Otis picks up the handset. OTIS (CONT’D) It’s me... EXT. TIEN’S APARTMENT - NIGHT 19   19  Otis walks up to the front door it opens. TIEN, a slender Woman in a Black Dress, stands in the doorway. She stares at him, both speechless. She’s nearly his age, but looks Younger. OTIS You’ve hardly changed. TIEN We both know that’s not true. But Thank You. A well-appointed Penthouse with Floor-To-Ceiling windows overlooking The City. Otis takes in the opulence. OTIS You done very well for yourself. TIEN We find a way. OTIS Yes we do... When we can. INT. TIEN’S APARTMENT - DINING ROOM - NIGHT 20   20  They are eating and drinking Red Wine. TIEN Who do you have with you? OTIS Just The Bloods. 24.",
      "characters": [],
      "action_text": "TIEN Bloods. I have not heard that word in such a long time. She tries to remember all the names. TIEN (CONT’D) Eddie, Paul... Melvin. Otis nods. TIEN (CONT’D) What about Tiny Tim? Stevie? And who was the one with The Blonde Mustache? Otis moves to her. TIEN (CONT’D) Mike? OTIS All Dead. Tim committed Suicide shortly after The War ended. Stevie was hit by a Drunk Driver on New Year's Eve, 1985. Mike died of a Heart Attack last year while Scuba Diving in Aruba. TIEN I'm sorry. And Eddie, Paul, Melvin? They're good? OTIS Good as they’re gonna’ get. She reflects knowing what he means. OTIS (CONT’D) We had a Bond, back then, Stronger than The War. Hope we can find it again. TIEN Still the Medic, always full of hope. Otis accepts it. OTIS We can find The Gold. Getting it out of the Country is the problem. 25. TIEN Under the War Relics Act, it belongs to The Vietnamese Government. OTIS Can we make a Salvage Claim? TIEN That would be very difficult. Your best chance is to convert it to Cash before you leave Vietnam. OTIS How? TIEN You'll meet him tomorrow. His Name's Victor Desroche. He's the only person I know who can handle a transaction of this size. OTIS You’ve dealt with him before? TIEN Yes. He’s expensive. Could be Fifteen, even Twenty percent. There's also the issue of my Cut... I'll need Ten Percent. OTIS That's going to be a tough sell. TIEN With this much money on the line, you don't want to take any chances. OTIS There's no other way to move it? TIEN International Exports are my Business. It's why you called me. OTIS Y’know that’s not the only reason. He waits for her to say something more, but she doesn’t. The front door opens and 26. ANGLE - MICHON BLASIAN, 46, walks in with groceries, she is a stunning Professional Woman. She pauses when she sees Otis sitting there. He stares at her. MICHON (in Vietnamese) I believe this is everything you wanted from The Market. She sets the grocery bags down in The Kitchen. TIEN Come here I want to introduce you to someone.",
      "dialogue_count": 0,
      "word_count": 805
    },
    {
      "scene_number": 4,
      "slugline": "EXT. TIEN’S APARTMENT - NIGHT 21   21  Otis and Tien stand outside A Taxi. OTIS Why don’t you come back to the Hotel with me and have a drink? I don’t want to leave you tonight. TIEN I can’t. Otis takes her hand and kisses it. TIEN (CONT’D) I’ll see you at the meeting tomorrow. Good night, Otis. OTIS Good Night... Tien... I Missya. He gets in the Taxi. Tien watches him drive away. INT. DESROCHE’S OFFICE - DAY 22   22  A rundown French Colonial place. Ceiling fans. Plantation shutters. Otis, Paul, Melvin, Eddie sit across from VICTOR DESROCHE, 40s, a Chain-Smoking Frenchman in a timeless White Linen Suit. Cuff-Links, Silk Pocket Square. Tien sits next to him. DESROCHE Foundry Stamps, other Markings? OTIS U.S. Eagle and Serial Numbers. DESROCHE Sequential? The Bloods all look at each other. No one knows. EDDIE We haven’t seen The Gold in a long time. DESROCHE How many did you say you have? OTIS How many can you handle? Desroche smiles, but it’s more cunning than warm. 29.",
      "characters": [],
      "action_text": "DESROCHE All of them. OTIS Must be. Two hundred? DESROCHE That won't be a problem. How did they end up in your possession? Paul, Wound-Up Tight, cuts in. PAUL Frenchy, you ask a lotta’ Goddamn questions. DESROCHE Maybe they’re from a Bank you just knocked off in Manila. Maybe the Authorities are looking for them. I don’t need that kind of trouble. MELVIN We ain’t no Damn International Criminals, You Dig? DESROCHE In my line of work, I must be careful and that means knowing what I'm getting myself into. PAUL Snail, you getting on my Last Goddamn Nerve. Tien tries to reassure Desroche. TIEN Detendez-vous, Victor. Permettez- moi de leur parler. Desroche shrugs, crushing his Cigarette. Tien turns to Otis. TIEN (CONT’D) You must understand. He’s taking a big risk... PAUL ...And we ain’t ...De Roach or whatever ya name is you got to Trust Us and we gotta’ Trust you. Desroche is unmoved. Otis comes clean. CUT TO: 30. CLOSE - Otis holds Paul’s Hand. CLOSE - OTIS OTIS Our Platoon was ordered to find a CIA Plane that went down with Payroll for some Mountain Tribes. CUT TO: VIETNAM FLASHBACK VIETNAM FLASHBACK 22A   22A  Norman holds up his Zippo illuminating him and The Gold. STORMIN’ NORMAN Look, we may not get out alive. If we do, we ain’t getting outta’ here with this Gold. So this is what we do. We bury it. For now. They ask, We say the NVA got it. Then we come back and collect. PAUL Steal it? STORMIN’ NORMAN We ain’t stealin’ Shit!   WE were the very first People to die for this Red, White and Blue. Not that Slave Owner George Washington, a Soul Brother, Crispus Attucks at Da Muthafuckin’ Boston Massacre. We been dying for dis Country from the very get-go, hoping in return they’d they give us our rightful place. But all we got was a foot up the Ass. No Mule, no Forty Acres, no nuthin’!   Fuck dat! The USA owe us! We built dis Bitch! OTIS What you sayin’ man? STORMIN’ NORMAN We abscond this Gold for every single Black Boot that never made it back home. For all Da Brothers ",
      "dialogue_count": 0,
      "word_count": 951
    },
    {
      "scene_number": 5,
      "slugline": "INT. PAUL’S ROOM - MAJESTIC HOTEL - DAY 23   23  Paul enters seeing an open suitcase on The Bed. Not his. He looks over at the SOUND of someone taking a piss in The Bathroom, the door ajar. Paul crosses to the bed, reads the luggage tag. PAUL What da’... Just then DAVID, his Son, 33, very much like his Father comes out of the rest room wiping his hands. PAUL (CONT’D) What da Fuck you doin’ here! DAVID I’m worried about you. PAUL What? DAVID When I heard you came here... PAUL ...And? DAVID I needed to check on you. PAUL You don’t give a Flyin’ Fuck ‘bout me. He closes his Son’s Suitcase packing him back up. DAVID I do. You been actin’ even more Crazy than usual. Paul chuckles to himself. PAUL Yeah, well, consider me checked on. He locks the suitcase up PUSHING it into his Son’s chest! DAVID You’re here for the Gold, aren’t you? Paul goes quiet. Can’t believe he said it. 34.",
      "characters": [],
      "action_text": "DAVID (CONT’D) You’re goin’ after the Gold. I read Otis’ Emails. Paul tosses the Suitcase across the room. PAUL Boy you Spyin’ on me? DAVID You gotta choose better passwords. '1234.' C’mon, Dad. PAUL What you want? DAVID An equal share. PAUL Hell No!!! DAVID Then I’ll inform the Authorities and ya’ll go home empty-handed. Paul takes a step back looking at his Son. PAUL So you just a lil’ Jive-Ass Gangster now, ain’t cha? DAVID After everything you’ve put me through, I think you’re getting off pretty damn light. Paul grabs David by the shirt and SLAMS him against the wall. PAUL Ungrateful lil’ Social Studies Teacher Nigga. David remains totally cool. Which is what scares Paul. DAVID Take your hands off me. David’s in much better shape than his Father and he knows it. He let’s go, steps away. David smooths out his rumpled shirt. DAVID (CONT’D) You wanna tell them or should I? 35.",
      "dialogue_count": 0,
      "word_count": 327
    },
    {
      "scene_number": 6,
      "slugline": "EXT. BALCONY - OTIS’ ROOM - MAJESTIC HOTEL - DAY 24   24  David stands across from The Angry Bloods. No one speaks. PAUL Look, this is my fault. My Son. My responsibility. EDDIE You sure know how to raise ‘em, don’t you? Otis, Eddie and Melvin all stare at David. MELVIN What happens if the 4 of us Bum Rush ya Boy and throw him off that balcony? DAVID Just know I’m takin’ a couple of you Old Goats with me. PAUL Don't ever threaten him again. MELVIN Or what? PAUL Or you're gonna’ have more trouble than you know what to do wit’. Paul takes a step toward Melvin, but Otis blocks the way. OTIS Cool it, Goddammit! David, you’re not getting an Equal Share. You and your Father can split A Share. Take it or Leave it. PAUL No Goddamn way! OTIS Take it or leave it! Paul sighs deep, looking at his Son, disgusted. PAUL You ain’t been nuthin’ but an Anchor ‘round my neck since da day you were Born. Yeah, I said it. I mean it too. 36.",
      "characters": [],
      "action_text": "Paul walks off leaving David standing there, gutted. The Bloods watch this. EDDIE Forget what I said. He slaps David on the back. They all walk out as David lingers. Otis steps up to him. OTIS You’re a Buck Private in this Outfit. That means you do what you’re told, when you’re told, no questions asked. Understood? David agrees. EXT. DOCK - DRAGON BOAT - DAWN 25   25  Melvin and Eddie, both drinking Coffee on The Boat. Paul mumbles to himself smoking a cigarette watching Otis still on the dock speaking to Tien, a Newspaper under her arm. OTIS I’m surprised you came. TIEN I have a bad feeling about this. OTIS Tien, I don’t care about The Gold. TIEN Then why do this? To find Norman? OTIS I guess. Sometimes. I don’t know. TIEN Then what then? Otis digs deep. OTIS Do you remember what I said that last day at The Airport. TIEN Someday you would come back for me and The Gold. He stares at her. She feels it. 37. Tien hands him the Newspaper and he opens it. Inside is an Army issue 1911-style COLT .45 HANDGUN. He looks up at her, surprised. TIEN (CONT’D) Gold does Strange Things to People. Even Old Friends. EXT. MEKONG RIVER DELTA - DAWN 26   26  A wide Brown River dotted with Wooden Boats of various shapes and sizes. Among them, We Find: EXT. TOUR BOAT - MOVING - DAWN 27   27  Vinh pilots a small Tour Boat up The Mekong River. Otis, Melvin and David sit with their OVERSIZE PACKS resting at their feet. Paul stands away from the others muttering to himself. Otis quietly notices Paul talking to himself. VINH This is my favorite time. Not too Hot. Not so many Mosquitoes. Melvin puts a stick of Gum in his mouth. He plays with a BUTTERFLY KNIFE. He nears Paul noticing his Baseball Cap. Paul sports a   “Make America Great Again”   Red Trump Cap. MELVIN You really wearing that? PAUL You don’t like it? MELVIN Who does? PAUL Don’t like it. Kiss my Happy Black Ass. 2 Times, 1 for each Butt Cheek. MELVIN Well, hopefully the People here don’t know what that really means. EDDIE Oh, they",
      "dialogue_count": 0,
      "word_count": 2540
    },
    {
      "scene_number": 7,
      "slugline": "INT. VICTORIA BAR - NIGHT 34   34  Jammed with Customers, mostly Locals. Melvin is at The Bar drinking and talking to TWO GIGGLING YOUNG LADIES in Short Skirts. Eddie sits near them but is just drinking. David and Hedy sit at a table, a couple of Tropical Drinks between them. Simon and Travis shoot Pool nearby. DAVID So how long are you here for? HEDY Just until morning, then back into The Jungle. David nods to Simon and Travis. DAVID What's their story? HEDY Simon's my Cousin. Travis and I use each other for Sex Once in a Blue Moon. David nods. He looks over at Travis, who eyes him back. HEDY (CONT’D) What about you? Girlfriend? Married? DAVID All alone. Can I buy you another? HEDY Sure. David motions to The Waitress. Another round. DAVID So how does one end up in the Mine Disposal Business? HEDY I'm Ten months into a Year Long Commitment. I saw it as helping the Environment. I guess this is me giving back to Mother Earth. DAVID Whatcha’ going do next? 50.",
      "characters": [],
      "action_text": "HEDY I don’t know, I'm dreading it. I'll take old, unstable explosives over the Real World any day of the week. David grins. DAVID What was your Real World Life about before you got into Old Land Mines? HEDY Living in Vancouver, waiting tables, trying to get my Photos into a Gallery and generally contemplating a dive off the Lions Gate Bridge. DAVID I hear you. I’m looking for a Bridge myself. They both laugh. EXT. VICTORIA BAR - NIGHT 35   35  Otis and Paul walking out. OTIS It's not the same place. PAUL For me it is. Most days I feel like I never left. OTIS I can’t have you Crackin’ up out there. PAUL Sir, Yes Sir. OTIS Come on Man. Cut the Bullshit. We’ve known each other too long. Paul gets Real with Otis. They look out at the Water where tiny boat lights rise and fall on the current. PAUL It’s different for me. You Guys were burying Da Gold. Norm and I were holding those Chink Bastards off when he bought it. 51. OTIS Blaming yourself? PAUL You don’t even know. OTIS When we get back, I'd like you to come with me to a Meeting. PAUL What kind of Meeting? OTIS Vets with PTSD. PAUL Man, I don’t do dat sit in a Circle whinin’ ‘bout your Shit Group Thing. Don’t do it. Never Have. Never Will. OTIS You gotta talk to somebody Man. PAUL I talk to My Brother Stormin’ Norman... Every Night. INT. VICTORIA BAR - NIGHT 36   36  Simon and Travis pull up chairs and join David and Hedy. SIMON How's it going, Mate? DAVID What's up? SIMON That one of yours over there? He gestures to Eddie at The Bar. David turns seeing Eddie, clearly loaded, standing now with Melvin and The Two Ladies. SIMON (CONT’D) He's getting pretty loaded. David looks at him, concerned. DAVID It's been an emotional trip. 52. TRAVIS Funny how the past still haunts us, isn't it? Travis leans in getting into Hedy and David’s Business. TRAVIS (CONT’D) Do you know how many Children are killed or maimed by unexploded Land Mines each year? DAVID I’m sure too damn many. TRAVIS Do you know most of those mines were made",
      "dialogue_count": 0,
      "word_count": 898
    },
    {
      "scene_number": 8,
      "slugline": "EXT. ROAD'S END - DAY 40   40  The Men step out of The Mud-Splattered SUV and begin gearing up. Melvin straps a METAL DETECTOR to his pack. MELVIN Thanks for getting us this far, Vinh. You put on a Hell of A Tour. Eddie draws a worn Green Boonie Hat from his pack. In faded Black Marker is a BLACK POWER and the words \"RIGHT ON.” In Answer, Paul puts on his Trump Cap. David sprays him down with insect repellent. Paul then sprays down David. Vinh hands Otis a small SATELLITE PHONE in a plastic bag. VINH I'll be waiting to hear from you. I hope you find your Friend. Otis pulls on his pack, wincing as he tightens the straps. OTIS See you in a few. Otis starts SINGING Marvin Gaye’s “WHAT’S HAPPENING BROTHER.” Soon all Da Bloods are singing. Eddie flashes Vinh the Peace Sign. DA BLOODS (SINGING)  Hey Baby/What’Cha Know Good I’m Just Gettin’ Back/But You Knew I Would/War Is Hell/When Will It End/When Will People Start Gettin’ Together Again/Are Things Really Gettin’ Better/Like The Newspaper Said/What Else Is New My Friend/Besides What I Read/Can’t Find No Work/Can’t Find No Job My Friend/Money Is Tighter Than It’s Ever Been/Say Man, I Just Don’t Understand What’s Going On Across This Land/Ah, What’s Happening Brother/Yeah, What’s Happening My Man/Are They Still Gettin’ Down/  55.",
      "characters": [],
      "action_text": "Where We Used To Go And Dance/Will Our Ball Club Win The Pennant/Do You Think They Have A Chance/And Tell My Friend/How In The World Have Ya Been/Tell Me What’s Out And I Want To Know What’s In/What’s The Deal Man/What’s Happening/What’s Happening Brother/Ah What’s Happening Brother/What’s Happening My Man/Ah What’s Happening Brother/What’s Been Shaken Up And Down The Line/I Want To Know Cuz’ I’m Slightly Behind The Time.  Moving Downhill, Eddie, Melvin, David and Paul Singing feeling the Old Brotherhood. Otis holds the rear. Vinh watches them disappear into The Jungle. The Song FADES AWAY. EXT. JUNGLE - DAY 41   41  They are spread out along a Narrow Trail that cuts through The Trees. All are drenched in sweat. Swatting Mosquitoes. David stays close to his Father. DAVID How you hangin’? PAUL You ask every five minutes. I did make it through Da ‘Nam War on my own. Otis trails behind, his Limp slowing him down. Eddie stops. EDDIE Hold up. Let Otis catch up. Melvin removes his Hat and wipes his head with a Bandanna. MELVIN Man, you can still hump it out On Point. DAVID What happens if one of us gets Heat Stroke or sprains an Ankle? EDDIE Otis is a Medic. A Good One. David nears Melvin holding out his hand. Melvin gives him some “Dap” teaching him.  DA BLOODS (SINGING) (CONT'D)  56. PAUL Even took a couple of rounds out of me once. MELVIN From your Black Hairy Ass as I recall. Melvin gives David a WINK. Otis limps up, struggling. PAUL I think that was Friendly Fire. MELVIN Maybe it was, maybe it wasn’t. Eddie takes another Drink from his Canteen. OTIS What is that? EDDIE Water. What? You wanna smell my breath? Otis backs down, feeling a little Foolish. OTIS Let’s just keep moving. As the Men heft their packs on, Eddie surreptitiously unwraps a piece of GUM and pops it in his mouth. Otis adjusts his pack, wincing in pain. He takes out a Pill, pops it in his mouth, and chews it. Grimacing at the bitter taste, he washes it down with a swig of water. EDDIE What are those? ",
      "dialogue_count": 0,
      "word_count": 771
    },
    {
      "scene_number": 9,
      "slugline": "EXT. CAMPSITE - JUNGLE - NIGHT 42   42  Otis is laid out, asleep. Several BATTERY POWERED LANTERNS illuminates the Camp in a small clearing. Eddie sorts through Bags of Dried Ramen Noodles. EDDIE Chicken, Beef, or Shrimp? MELVIN They all taste like Salt. Melvin ignites The Propane Camp Stove. David pours Water into a kettle. EDDIE Otis’ already out. MELVIN You know he’s hurtin’. David approaches Paul, away from others staring into The Darkness, he holds out The Ramen Packets. PAUL No Thank You, Son. An Animal CALLS OUT IN DEATH! David jerks. Other Animals respond, HOOTING and SCREECHING. DAVID Dad, what the Hell is that? PAUL Gibbons. I saw a Leopard tear one apart once. DAVID They’re Leopards out there. PAUL Leopard's are all gone now. Poachers wiped em’ out. Paul sees something and stiffens. He crouches down, pulling David with him. The Father Whispers to his Son. PAUL (CONT’D) You see dat? DAVID What? 59.",
      "characters": [],
      "action_text": "PAUL Looked like a Man Movin’ through Da Trees. David tries to see it but Paul pulls him back. PAUL (CONT’D) It was just a Flash, but I saw him. DAVID Maybe it was a Monkey. PAUL Wasn't no Goddamn Monkey. The Two stare into the dark for a long beat. DAVID See anything? Paul slowly rises, looking. It’s all clear. PAUL Sorry, I’ve been on edge. Bein’ back here. It's not easy. DAVID It's Cool. PAUL I don't like the way you did it, but I’m glad you’re here. Y’know Ya Daddy Loves You. Y’know dat right? Their eyes meet. The first sign of Paternal affection we’ve seen from him. DAVID Dad, you got a Funny way of showing Love but I do know that. Love ya Black. Father and Son walk back to the Fire. Melvin slaps at Mosquitos. MELVIN Where’s the spray? EDDIE Otis had it last. Melvin approaches Otis. Rather than disturb his sleep, Melvin opens his pack and rummages around inside. 60. He lifts out a Rolled-Up Rag. Curious, he unwraps it, revealing CLOSE - THE .45 HANDGUN AND THE SPARE CLIP TIEN GAVE HIM ANGLE - CAMP Eddie sees it and stops. David and Paul walk up. It stops them. PAUL Ain’t dat A Bitch. Paul kicks the bottom of Otis’ Boot, waking him. PAUL Get up. Nigga, I said get up. Otis wakes up. He sits up seeing Melvin holding up the .45. EDDIE Why didn't you tell us? They all look at Otis waiting for an explanation. PAUL No wonder you made all the arrangements. Tien give it to you? OTIS And what ‘bout it. PAUL We should all be Fuckin’ Packin’. MELVIN Fool, shut up! PAUL Otis, you are totally Pussy Whooped, ain’t ya’? You don’t see what she is? Or dat French Fuck Day- Roach. OTIS I don’t know Desroche from Adam’s House Cat, but if Tien vouches for him, that's good enough for me. PAUL She’s a Fuckin’ Ho, Otis, remember. OTIS You need to check yourself. 61. PAUL I know that Slanted Pussy Strung you out, but she’s still just a Ho! Otis charges Paul. They tumble to The Ground, scattering Mess Kits and Provisions. The Two Men grapple and trade Punches as Melvin, David and Eddie t",
      "dialogue_count": 0,
      "word_count": 688
    },
    {
      "scene_number": 10,
      "slugline": "EXT. COUNTRYSIDE - DAY 44   44  The Americans wade through Waist-High Grass, leaving The Rice Paddies behind. They’re on an incline, heading into Hill Country. Otis, as usual, trails far behind. EXT. HILLSIDE OUTCROPPING - DAY 45   45  The Men are gathered around The GPS and the Topo Map. OTIS We’re standing right on top of it. MELVIN You said that on the Last Hill. Otis pulls out SATELLITE PHOTOS and passes them around. The Men hold them up, trying to match them to The Landscape. MELVIN (CONT’D) Perspective's totally different. OTIS It’s gotta be here. Paul rinses his Mouth with Water and Spits. EDDIE Goddamn! We’re Fuckin’ lost! OTIS You wanna give up? Go ‘head. EDDIE Who said anything about givin’ up? PAUL Otis thinks he’s slick. Marchin’ us ‘round ‘til we give up and Go Home, then you come back and collect it all for yourself. OTIS Then why’d I drag your Crusty Black Ass out here in the first place? PAUL ‘Cuz you couldn’t afford Da Airfare, The Hotel, The Gear. You needed Banker Drysdale there! He jerks a Thumb at Eddie. Otis is so Mad he says nothing. 63.",
      "characters": [],
      "action_text": "PAUL (CONT’D) You and Tien are up to sumpthin’. I don’t need dis Shit, my Life is fine. I’m here for Norm. I’m not fallin’ for The OKEY DOKE. The Dope Fiend Doublecross. Hell Naw. David grabs something from his Pack, and starts down The Hill into The Brush... PAUL (CONT’D) Boy, where you goin’? Without looking back, David holds up a Camp Shovel and a Roll of Toilet Paper. EXT. LOWER HILLSIDE - DAY 46   46  David plunges The Camp Shovel into The Ground and digs a shallow trench, flinging loads of Earth Downhill. He hears an ODD SOUND and stops. He flings another Scoop and the dirt THUMPS against something HOLLOW... David drops The Camp Shovel and scampers down The Hill. He drops to his Hands and Knees, and feels around in the undergrowth. Feeling SOMETHING, he excitedly tears away The Vegetation to reveal an expanse of MANGLED, CORRODED ALUMINUM. A faded White “Star and Bar” emblem is painted on the metal. DAVID Hey, HEY, DAD. GUYS! I FOUND SOMETHING!!! I THINK I FOUND IT!!! EXT. HILLTOP - DAY 47   47  SLASHING! Paul, Eddie, Melvin, David and Otis SLASH through the dense brush with Machetes and New Energy! They reach a clearing overlooking another Rugged, Deep Ravine. Melvin quickly flips through The Photos. Then Otis spots it. A BARREN SECTION of Hill. Otis checks the GPS again and nods confidently. EDDIE Hallowed Ground, Bloods. Holy Ground. 64.",
      "dialogue_count": 0,
      "word_count": 433
    },
    {
      "scene_number": 11,
      "slugline": "EXT. RAVINE - DAY 48   48  The Metal Detector TICKS in Melvin's HEADSET as he waves The Sensor over The Ground. David and Paul follow along. Fifty yards away, Eddie paces around while Otis sits on A Rock, catching his breath. Melvin works The Metal Detector. MELVIN I got something! Paul and David Attack The Ground in a Frenzy of Digging. Eddie and Otis hurry over. David’s Shovel CLANGS against something. He scrapes more dirt away, revealing a Flat Metal Surface... The top of the LOST STRONGBOX... LATER The Men have creating a deep trench around The Box, exposing the Top Half. Melvin and Paul grab the handles on the sides of The Box. They pull hard, muscles straining... SNAP! ...they stumble back falling in The Dirt as The Box disintegrates in a Shower of Rusted Metal Flakes. Paul plunges a Shovel into The Dirt, desperately turning it over. It’s just Earth. Flecked through with Rust and Bits of Metal. The Men peer into The Dirt. DREAMS CRUSHED TO METAL BITS. Eddie laughs, bitterly. David watches, Paul laughs too. And Lo And Behold, despite THE PAIN Otis starts to DO A JIG. PAUL Fools Gold. OTIS We’re Gold Fools. Melvin can't accept it. He picks up The Metal Detector, puts on The Headphones, and begins sweeping The Ground... PAUL Give it up. It’s over. Da Jig is Up. Eddie lights up A Smoke and takes a deep drag. 65.",
      "characters": [],
      "action_text": "EDDIE Well, Fuck it, let’s find Norm. MELVIN Something’s here! PAUL Just some more Goddamn Box... Ignoring him, Melvin keeping moving down The Slope. MELVIN ...Another one. They're small, but there’s something here. David climbs out of the Pit with his Shovel. DAVID Where? Melvin points to A Spot. David plunges his Shovel into The Earth and begins Digging. Melvin moves on, scanning Terrain. MELVIN Another one. Otis joins David, both digging. A shovel CLANKS against something. Otis pulls up a Dirt-Caked OBJECT. He rubs The Soil away and-- GOLD GLEAMS. It’s a Donut-Shaped INGOT, just like the ones in The Photos. Otis GRINS. Paul moves to Otis who hands it to him. Paul turns it over in his hands, astounded. It's Real. REAL AF (AS FUCK). PAUL Kiss My Black Ass 2 Times and Say Hallelujah. EDDIE They spilled open in Da Mud Slide. MELVIN Goddamn! Gettin’ Hits everywhere! Eddie and Melvin Grab Shovels, scrapping dirt off A Spot, it’s Gold. Scrapping another one, GOLD! Even more, IT’S THE GOLD! PAUL Holy Muthafuckin’ Mother of Gold! 66. Paul HUGS Otis! Eddie gives Melvin some Dap! David does an “End Zone” Dance! The Bloods are cracking up with Pure JOY!!! THE BLOODS START JUMPING UP AND DOWN LIKE THEY ARE Q’S STOMPIN’ AT A GREEK SHOW. EXT. DIG SITE - LATER - DAY 49   49  FLYING HIGH (IN THE FRIENDLY SKY)   By Marvin Gaye Plays. 200 Gold Ingots are piled in stacks on a plastic tarp. David finishes washing The Dirt off them with A Canvas Bucket, while the Guys, Dirty and Sweat-Soaked, catch their breath. OTIS Thirty Five Thousand Per Ingot. Seven Million Bucks all in. DAVID So Fifty Kilos Per Person. That's... MELVIN ...A Hundred Pounds Each. Paul WHISTLES. That's a Heavy Load. Still grinning, Paul picks up The Metal Detector. PAUL Otis, will you pack up my share for me? OTIS Sure. EDDIE Where are you going? PAUL To look for Norm. Eddie, you were not far from The Gold when he got Hit, right? Eddie nods, yes. Eddie heads up The Slope, back toward The Hills. The others start rem",
      "dialogue_count": 0,
      "word_count": 2256
    },
    {
      "scene_number": 12,
      "slugline": "INT. STORMIN’ NORMAN’S VIETNAM HOOCH - NIGHT 55A   55A  Stormin’ Norm Chilling, Shirt off African beads around his neck smoking a Joint with Eddie, Paul and Melvin. His Black Liberation Flag behind him. STORMIN’ NORMAN War is ‘bout Money. Money is ‘bout War. War to Free Us from White Folks was ‘bout Money. We over here killin’ Shoe-Less Undernourished Viet Cong cuz of Money. And back in Da World, Black Folks offin’ each other Over Money. EDDIE What’s Da Answer, Blood? The Bloods watch Norman recite. One of those Special Moments. STORMIN’ NORMAN  Oh Don’t Go And Talk About My Father/God Is My Friend/Jesus Is My Friend/He Made This World/For Us To Live In/And Gave Us Everything/And All He Asks Of Us/Is We Give Each Other Love/Oh Ya/Don’t Go Talk About My Father/Cause God Is My Friend/Jesus Is My Friend/He Loves Us Whether/Or Not We Know It/Just Loves Us Oh Ya/And He’ll Forgive All Our Sins/Forgive All Our Sins/And All He Asks Of Us/Is We Give Each Other Love/Oh Ya/Love Your Mother/She Bore You/Love Your Father/He Works For You/Love Your Sister/ She’s Good To You/Love Your Brother/Love Your Brother/Don’t Go And Talk About My Father/He’s Good To Us/God Is My Friend/Jesus Is My Friend/For When We Call In Him For Mercy/My Father He’ll Be Merciful/My Friend/Oh Yes He Will/All He Asks Of Us/I Know/Is We Give Each Other Love/Bloods... GOD IS LOVE. OUR BROTHER. MARVIN GAYE  CUT TO: PRESENT DAY EXT. JUNGLE TRAIL - TALL GRASS - DAY 55B   55B  EDDIE I thought if We could find dat again. Find some Damn meaning. It would bring us back together. 77.",
      "characters": [],
      "action_text": "Make us Bloods one more time. I guess we won’t ever get that back. Eddie, NEAR TEARS, gives them a disappointed look. Then shoulder his Packs, Turns and Marches OFF-- --DIRT AND GRASS EXPLODE INTO THE AIR. Eddie vanishes in The Blast. A FLYING INGOT hits David in the Chest, knocking him back a step. Da Bloods Hit The Deck. DAVID What the Hell was that?! PAUL Land Mine. MELVIN Nobody move! As Bits of Grass float Back Down Out Of The Air, WHITE SMOKE OBSCURES The Blast Site -- and Eddie. Otis pushes past the others into The WHITE SMOKE. MELVIN Otis, Stop!!! It’s a Minefield! Otis ignores him and finds Eddie looking up at The Heavenly Sky. Eddie’s Mouth is Full Of Blood. BOTH LEGS HAVE BEEN BLOWN OFF and his Bowels are hanging out. Eddie’s Hands are Shredded, ALL of his Fingers Missing. Gold Ingots and Chunks of Flesh are scattered around Eddie. Otis kneels next to A DYING EDDIE. OTIS EDDIE!!! EDDIE!!! Eddie just stares up at THE HEAVENS, mouth moving wordlessly. A Large Bubble Of Blood forms on his Lips, then Pops. Otis takes a Mangled Hand and cradles it in both of his. OTIS (CONT’D) It’s Otis. I’m here. I’m here. Eddie’s Eyes Flick over and he seems to recognize Otis. More Blood Burbles up Out Of His Mouth. Eddie’s Mouth moves but No More Words come. Eddie is SLIPPING AWAY.  EDDIE (CONT'D)  78. OTIS (CONT’D) EDDIE... But Eddie isn't looking at Otis. He stares Into THE HEAVENS. Then Eddie is gone. Otis sits there, holding his hand. By now the White Smoke has dissipated. Otis shuts The Eyelids of Eddie. DAVID Oh My Fuckin’ God... David steps on something!!! DAVID OH FUCK. PAUL What? DAVID I stepped on something. EVERYONE is Freezes In Place. PAUL Don’t move Son!!! MELVIN Muthafucka!!! Otis holding Eddie can only close his eyes in fear and frustration. David holds tight. Not moving. The THREE NGOS from MAG, Hedy, Simon and Travis rush toward them emerging from the white smoke. They quickly stop knowing the danger!   Hedy shouts to the Bloods! HEDY No one move! Freeze! ",
      "dialogue_count": 0,
      "word_count": 2181
    },
    {
      "scene_number": 13,
      "slugline": "EXT. CAMP SITE - JUNGLE - NIGHT 58   58  Paul, Melvin and Otis look over The Topo Map. OTIS We can call Vinh and let him know The Rendezvous Point has changed. PAUL Vinh's out. He’s in Cahoots wit’ those Two Dinks. Right, Traitor? OTIS If you don’t trust me then just busta cap on me like you plan on shooting those Mine Workers. Paul stares at him, Scary. Hedy, Travis and Simon watch their backs against a Tree tied up. Melvin waits. PAUL Not enough Food or Water to reach Tân Châu on foot. We'll ration what we have. Paul steps away. Otis and Melvin exchange looks. EXT. TOP OF HILL - NIGHT 58A   58A  Paul lays on the top of A Hill, 30 Yards away, scanning The Jungle with Binoculars. Melvin crawls over and joins him. PAUL Wonder if those Gooks are sleep? Paul puts down The Binoculars. Gets Real. PAUL You know, as long as those Three are alive, we'll never make it out of The Country with it. Melvin turns to Paul and gives him a long hard look. MELVIN All right. How you wanna do it? Melvin pretending? Who knows. Paul holds up his Knife. PAUL March ‘em into The Jungle. Quick and Quiet. In the morning, we'll tell David and Otis they escaped. 88.",
      "characters": [],
      "action_text": "MELVIN What if they don't believe us? PAUL Then they can go and look for them. But I’m getting da Hell outta’ here. Melvin ponders it, sighs, nods, agreeing to it. PAUL (CONT’D) You gotta do one of them. MELVIN What? Why? PAUL I gotta know you’re not going to turn on me later. It's the only way. MELVIN Fine. But you have to do The Girl. Paul nods. DONE DEAL. EXT. CAMP SITE - NIGHT 59   59  Hedy and Simon are tied to A Tree. Otis is resting his Eyes. HEDY I need to Pee. David unties Hedy leading her into The Jungle. HEDY (CONT’D) Could you untie my Hands please? David mulls it over. HEDY (CONT’D) Don't you want the First Time you unbutton and remove My Pants to be under better circumstances? DAVID Not Buyin’ It. Ya tryin’ to Play Me. Hedy raises her hands. Please. A Beat, then David unties her. Hedy pulls down her Pants and Squats. David doesn't turn his back but stares past her, into The Darkness. 89. HEDY Were you flirting with me the other night because you were just looking for an Easy Lay or because you were actually interested in me? DAVID I’m interested. HEDY Why? DAVID Because you left your Life behind to try to do something good. And Ya Fine Too! Ain’t Gonna Lie. She stands, pulling up her pants. David shifts his gaze and makes eye contact with her. HEDY Then let me go. Give me a Ten Minute Head Start. That's all I need. Hedy steps closer to him, eyes pleading, and puts A Hand on the back of his neck as if she might Kiss David... HEDY (CONT’D) Please. David Kisses Hedy and She kisses him back. It's Fierce, Desperate, Raw... PAUL (O.S.) Hate to Cock Block... Son. She Fine Tho!!! Hedy and David turn finding... ANGLE - PAUL AND MELVIN standing there. They have Simon with them, Hands Bound. PAUL (CONT’D) Back to Camp. Hedy and David separate. Paul holds his Knife directing David with it. PAUL (CONT’D) Back to Camp. 90. David stands there. Melvin pulls The Rope from David’s Hand tieing Hedy’s Hands. Hedy stares at David. DAVID What ya’ll gonna do? PAUL You heard ",
      "dialogue_count": 0,
      "word_count": 3408
    },
    {
      "scene_number": 14,
      "slugline": "INT. VAN - ROAD - DAY 63   63  Vinh drives. Otis sits next to him. VINH I can help you get it out of The Country. Otis looks at Melvin. He nods. OTIS We’ll split a share with you. VINH How much is that? OTIS A million. Vinh driving, reacts. HEDY When are you letting us go? OTIS You want in? MELVIN Goddamn Otis! Put our Shit on Craig’s List. OTIS What choice we got? Better some than none. Hedy, Simon, you both will get a share. But Paul and his crazy shit. The kidnapping. That never happened.   Right? HEDY What about Travis? OTIS All we know is what happened. He was murdered by a Local Gang. SIMON Our share is also a Million? Otis nods. Simon looks at Hedy, who finally nods, yes. They are in. 105.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 139
    },
    {
      "scene_number": 15,
      "slugline": "EXT. CLEARING - DAY 64   64  Flies are swarming around The Bodies of Chavy, Tam and Bao when TWO JEEPS race up and come to a stop. Quan and SEVEN OTHER MEN, all carrying AK-47s, Hop Out. One of the Men, a DEGAR in his 50s, examines the hodgepodge of footprints. He walks to The Jungle, and pokes around. DEGAR TRACKER H? dã di theo cách này. He heads into Da Jungle. Quan and the others hurry after him. The Degar Tracker sees how they went two ways. Paul and The Van. He instructs Quan. Quan and Three Men get back in The Jeep and take off down the road. The Degar Tracker takes Three Men and go off following Paul. EXT. RIDGE-LINE - DAY 65   65  Paul steps out of The Jungle, onto A Ridge. Twenty feet below, A Wide River surges, the current swift and strong. He sighs and reluctantly turns walking along The Ridge, following the course of The River. EXT. ROAD - DAY 66   66  The Van runs out of gas. They all get out of The Vehicle and Vinh points off into The Jungle. They load up. Hedy and Simon help carry David. Otis and Melvin follow Vinh as he leads them. They move through some Brush cutting through. EXT. MY SON TEMPLES - DAY 67   67  The long forgotten Kingdom of Champa. An ancient Hindu complex built Centuries ago. Overgrowth, neglect and a few days of Intense Carpet Bombing have left the structures in ruins. Hedy and Simon carry David into one of The Open Buildings. 106.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 264
    },
    {
      "scene_number": 16,
      "slugline": "INT. TEMPLE - DAY 68   68  Otis, Melvin and Vinh bring in The Backpacks Of Gold. They are stacked up in a Large Pile. Simon and Hedy sit David down his leg stretched out trying to get him comfortable. SIMON You all right, Mate? David nods, grimacing. SIMON (CONT’D) I’ll be back. Hedy slides down the wall, exhausted with everything. David looks at her, closing his eyes. EXT. MY SON TEMPLES - DAY 69   69  Vinh leads Otis and Melvin through The Red Brick Ruins. VINH The Temples were dedicated to The God Shiva. The Ruins look more Indian than Asian. Astounding sculptures, designs, collapsed buildings dating back to The 4th Century. VINH (CONT’D) It was Carpet Bombed in 1969. Otis and Melvin turn staring down at a Massive Hole in the ground, now overgrown with Vegetation created by A B-52 Bomb. EXT. PAUL’S JUNGLE - DAY 70   70  Paul machete in hand madly hacking down Tree Branches. He charges through The Jungle hauling the heavy load on his back like an enraged Bull, MUTTERING to himself. PAUL Dey Mind’s weak. Got no intestinal fortitude. Ain’t as strong as you, Paul, NO SIR! Ain’t got da Guts Paul got! Ain’t dey fault. Dey wuz Born Weak. Otis and his Ho. Car Thieves, Guttersnipes, Chain Snatchers! Dey ain’t snatchin’ My Chain. Not Me. No, Sir. I ain’t gettin’ Fucked again. Not Paul. Not dis Time. I’m gettin’ mine! 107.",
      "characters": [],
      "action_text": "SHONUFF! Sum-Bitches turned my Goddamn own Son against Me. My own Blood! Yeah, well, we’ll see who’s standin’ in Da End... And another thing, I put Da Only Life I have on the line to protect the Red, White and Blue. I come back from Da Hell Vietnam wuz and People Hate Me, Curse Me, Spit at Me. Call Me A Child Murderer. Dem Gook Kids had Grenades and Guns. Dey were Killin’ Us. What were ‘pose to do? What wuz I’pose to do? I didn’t feel good ‘bout it but I wanted to Live and Not Die. KILL OR BE KILLED. SLASH! SLASH! SLASH! EXT. TEMPLE - DAY 71   71  Vinh is explaining how the Gunmen may attack. VINH The Gunmen perhaps will come from The East entering The Sanctuary down this road. MELVIN How many Men could they get? VINH Difficult to say. Eight. Ten. Some may be tracking your Friend. Melvin holds out a Pistol to Simon. SIMON I can’t. Mates, I can’t Kill a Man. MELVIN Fair enough. Can’t say I didn’t WARN YOU. He pulls The Gun back and hands it to Otis. He takes it. Otis points to a Temple Building. OTIS Could you get on The Roof with binoculars and warn us. Make yourself useful. Simon looks up at The Building.  PAUL (CONT'D)  108. SIMON I can do that. OTIS Good. I guess before we go any further. I should ask... MELVIN ...NO! I don’t want to just give them The Gold. Hell no. I’ve come too far to give up now. No... Otis turns to Vinh. VINH ...I have risked my Life for much less. Otis turns to Simon. SIMON I still have a lot of Student Debt. Otis and Melvin look at each and have to laugh. EXT. MAIN TEMPLE - DAY 72   72  Melvin pulls on A Rope that Simon has tied to the Roof of The Tallest Temple building. Simon looks down at Melvin. He gives him The Thumbs up. INT. TEMPLE - DAY 73   73  Otis enters carrying a stripped Tree Branch. OTIS Gonna make a splint for your Leg. It’ll keep it stable and help stop The Bleeding. Hedy pulls out a Water Bottle. She nears David, who is sweating hard, and uses what little is left to rinse off David’s Face and Leg. DAVID Thank you. Otis pu",
      "dialogue_count": 0,
      "word_count": 874
    },
    {
      "scene_number": 17,
      "slugline": "EXT. QUAN’S JUNGLE - DAY 75   75  Quan and his Men following Paul’s Trail at an intense pace. They HEAR the SHOTS!!! QUAN Nhanh lên! Di! Di! They break into a Trot, high-stepping over Tree Roots... OMITTED 76   76  EXT. PAUL’S JUNGLE - DAY 77   77  Paul rips open his sleeve, revealing TWO PUNCTURE WOUNDS Oozing Blood. He puts his Mouth over The Wound, sucks, and SPITS.   He repeats the process twice more, then moves out... EXT. COLLAPSED TEMPLE - DAY 78   78  Melvin and Otis sit on a couple of Large Slabs. MELVIN Wish Paul was in this Fight. OTIS I know. MELVIN This is probably our Last Go Round, Blood. OTIS Oh Yeah. MELVIN I gotta have this Money. OTIS You’ve done okay for yourself. Why you need it so bad? MELVIN You know me, Man. I ain’t been much of a Husband to Cissy. I ain’t done nuthin’ but cheat on her with a bunch of Women ain’t worthy of running her Damn Bath Water. Otis listens. 111.",
      "characters": [],
      "action_text": "MELVIN (CONT’D) I guess this whole Trip has made me realize how lucky I’ve always been. She’s stuck with me through Thin and Thinner. Melvin thinking about her. Otis listens. MELVIN (CONT’D) I want this Money for her and my Kids to make up for all that Bullshit I’ve put My Family through. Maybe I can make it right with her. If I gotta go out, I want it to be for something. OTIS How do you know you won’t get this Money and Divorce Cissy and become a permanent guest at The Pussyville Inn? Melvin has to grin. MELVIN I don’t. Guess I’m hoping I’m better than that. OTIS You are. MELVIN Maybe. Melvin looks at Otis and they both grin. MELVIN (CONT’D) You don’t think it’s worth it, do you? Otis shakes his head. MELVIN (CONT’D) You ain’t gotta die on this Hill. OTIS I know. MELVIN Why? OTIS ‘Cuz this is Our Hill. Blood. 112.",
      "dialogue_count": 0,
      "word_count": 330
    },
    {
      "scene_number": 18,
      "slugline": "INT. TEMPLE - DAY 79   79  Hedy sits across from David. He stares at the unopened letter. HEDY What’s this thing between you and your Father? David looks at her. DAVID Hedy, Do you really want to know? HEDY That’s why I asked. DAVID Jacquelyn... HEDY Who is that? DAVID My Mother. She had a very difficult Delivery with me. HEDY She didn’t survive? DAVID No. My Mother died giving Birth to Me. HEDY I’m so sorry. Sorry I asked. DAVID My Father blamed me. My Father has Hated me since The Day I Was Born. David Breaks Down. Tears and Sobs are FLOWING. Hedy moves to him, holds him TIGHT. She tries to Comfort him. DAVID I wish I would have Died instead of My Mother. HEDY It wasn’t your Fault... It wasn’t your Fault. 113.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 138
    },
    {
      "scene_number": 19,
      "slugline": "EXT. PAUL’S JUNGLE CANYON REGION - DAY 80   80  Paul trudges along, swaying unevenly, trying to keep his balance. The Venom isn’t deadly, but it’s debilitating. PAUL Damn... Snake Poison... He sits on a bolder near the edge of The Canyon. He tries to recover squeezing his eyes tight, then opening them. He gets grabbing his AK-47, but he stumbles backward, arms flailing... ...and FALLS OVER THE EDGE, into The Canyon.   Paul tumbles down the side of the cliff his... CLOSE - BACKPACK It flies off vanishing into a Thicket of Trees. CLOSE - PAUL Paul falls ripping through Tree Branches and brush! Flipping and catching on limbs SLAMMING on the ground below! EXT. PAUL’S JUNGLE - DAY 81   81  Paul flat on his back.   Most Men would be Dead. However, he pulls himself up covered with Bleeding Cuts and Scratches. He holds his aching back. He sees his Trump Cap. He dusts it off on his leg and puts it on. His mind then goes to... PAUL Where is it? Come on Baby... He looks around, eyes darting about, stumbling about growing desperate then he spots... CLOSE - BACKPACK sitting there upright intact like someone placed it there lodged in a Tree. ANGLE - JUNGLE Paul staggers with his BACKPACK into The Jungle. PAUL Gonna take a lot more den dat to Kill Me. I ain’t goin’ out like NO FUCKIN’ BITCH!!! 114.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 235
    },
    {
      "scene_number": 20,
      "slugline": "EXT. PAUL’S JUNGLE - SMALL CLEARING - DAY 82   82  He staggers out of The Jungle wearing The Backpack having lost his AK-47 entering a small clearing. He stares at something... becoming frozen. Stormin’ Norman stands there holding his M-16. The Squad Leader. STORMIN’ NORMAN Paul? PAUL What you doing here, Man? STORMIN’ NORMAN I been wantin’ to talk to you. PAUL ‘Bout what? STORMIN’ NORMAN Y’know. Paul’s look turns even more frightened. PAUL Go away. Please. STORMIN’ NORMAN Can’t, Paul, you gotta’ come clean. Norman rips open his Flak Jacket, then rips open his shirt revealing a huge gaping Bullet Wound in his Chest. Moving closer and closer toward the wound actually entering it... going back to... CUT TO: VIETNAM FLASHBACK 82A   82A  Norman and Paul under intense FIRE! They fire back at the V.C. STORMIN’ NORMAN (CONT’D) Get outta here. Go! The V.C. FIRING from the darkness of The Jungle. The Platoon is running off into The Darkness, Otis and Eddie carrying Wounded Men. Melvin firing, then runs off! Norman looks over and sees a stray GOLD IGNOT they didn’t bury. He reaches out and grabs it. Paul climbs out of his position about to dash off with the others... 115.",
      "characters": [],
      "action_text": "STORMIN’ NORMAN (CONT’D) Here. Norman tosses The Ingot to... PAUL who turns seeing a Gold Object fly at him in The Dark... ...accidently FIRES off A Round! It HITS... ANGLE - NORMAN Norman is hit in the chest. He stands there totally surprised. He falls back. Dead. Paul his face speckled with Blood in complete shock. CUT BACK TO: EXT. PAUL’S JUNGLE - SMALL CLEARING - DAY 82B   82B  STORMIN’ NORMAN (CONT’D) Let me lighten your load. Norman nears him taking off Paul’s Backpack and setting it on the ground. He HUGS him tightly. STORMIN’ NORMAN (CONT’D) It was an accident. Paul just stands there very still, then finally raises his arms up, hugging him back. Tighter and tighter. Norman says in his ear, softly. STORMIN’ NORMAN (CONT’D) I forgive you. Paul breaks loose weeping in Norman’s Arms. QUAN (O.S.) GI! EXT. PAUL’S JUNGLE CANYON REGION - DAY 83   83  Quan and His Men emerge from The Jungle. Paul stands, now alone, no Backpack, Weapon, Nothing. Quan BARKS ORDERS in Vietnamese. The Men fan out and encircle Paul. Paul scans all the GUNMEN surrounding him. 116. QUAN (CONT’D) You outnumbered. PAUL We were always outnumbered. QUAN Where’s Gold? PAUL Norman took it. It was his. Quan doesn’t get it. QUAN Who Norman? PAUL One Badd Black Muthafucka. QUAN Where other GI’s? PAUL I will never say. See, We bloods. We gotta Bond. We fought in a War that wasn’t ours, for Rights we didn’t have. They’re my Brothers. QUAN You kill my Brother. Paul and Quan just stare at each other. Finally. PAUL  Don’t Go And Talk About My Father/Cause God Is My Friend/Jesus Is My Friend/He Loves Us Whether Or Not We Know It/Just Loves Us/Oh Ya/He’ll Forgive All Our Sins/Forgive All Our Sins/And All He Asks Of Us/Is We Give Each Other Love  Quan stands there, confused, he shakes his Head. PAUL (CONT’D) My Brother Marvin Gaye. QUAN You Drunk? PAUL Never been Mo’ Sober in My Life. 117. QUAN Are you Sober enough to Dig A Ditch? Quan throws Paul a Shovel. QUAN (CONT’D) Dig. Paul takes the Shovel and start",
      "dialogue_count": 0,
      "word_count": 1114
    },
    {
      "scene_number": 21,
      "slugline": "EXT. TEMPLE - DAY 90   90  DESROCHE (CONT’D) I hope you have Norman’s Share. I do hope Norman will share it with us. OTIS I don’t know. Norman is very set in his ways... I have a question. DESROCHE Of course. OTIS Is Tien in on this? Desroche SNORTS, dismissive. DESROCHE Tien is a smart Woman but she doesn't have the... appetite for a venture such as this. No, your Love knew nothing about this. She is Innocent as you are Ignorant. OTIS Look, Just take The Gold. And leave. Leave Us in Peace. DESROCHE We just want what we came for. Desroche nods to Quan. He walks toward The Backpacks. Otis stands there one hand behind his Back. Desroche calmly puffs at his Cigarette. Quan picks up The Heavy Backpack. He sets it on a large stone unzipping it.   He looks inside, surprised. He lifts up the backpack turning to Desroche. Quan turns it upside down and ROCKS falls from The Backpack. Desroche face falls. Quan turns back around and... Otis FIRES his .45 putting a round through his forehead BLOWING out the back of his Head. Quan falls over Dead. MELVIN ON TOP OF THE MAIN TEMPLE OPENS FIRE with his AK-47! He rips apart Two more Bandits next to Desroche. 121.",
      "characters": [],
      "action_text": "Desroche scrambles back in the Range Rover as Melvin pelts it with Gunfire from above! THUNK! THUNK! THUNK! Desroche SCREAMS at the DRIVER. DESROCHE (CONT’D) Drive! Drive! Drive! The Driver floors it backing up! Vinh from the doorway of this Temple position, on the other side of the Range Rover, UNLOADS with his Pistol on the vehicle striking Desroche in the arm! DESROCHE (CONT’D) FUCK! Melvin SHATTERS the windshield killing The Driver with a devastating CROSSFIRE! The Vehicle in reverse SLAMS into some LARGE ANCIENT SCULPTURES sending the SUV on it’s side. Gunmen FIRE on Vinh ripping apart the doorway of his Temple position. He is hit in the shoulder falling back into The Darkness of The Building. Otis sees Vinh is hit. GUNMEN BEHIND QUAN’S JEEP fire at Melvin on the roof POUNDING his position with rounds! He scrambles getting to another spot. ON THE ROOF Simon hands Melvin another CLIP for his AK. He SLAMS The clip in shouldering the rifle as Simon holds the rope. Melvin CLIMBS DOWN down the Main Temple wall. A Gunman SCREAMS charging straight toward Otis FIRING at him. Otis ducks behind the large stone as it’s pelted with rounds. He then raises up BLASTING several rounds CUTTING the NVA down! Otis fires his .45 at The Jeep dashing as fast as he can to Vinh. Melvin on the side of The Main Temple provides cover FIRE for Otis pinning down the remaining Five Gunmen by The Jeep. Otis gets into Vinh’s doorway as Bullets rain around him. 122. IN THE TIPPED OVER RANGE ROVER Gunfire echoes from outside. A bleeding Desroche opens a side compartment removing two HAND GRENADES and a 9MM LUGER PISTOL that he shoves in his Pants. Desroche climbs out of the tipped over Range Rover and falls to the ground holding his Wounded Arm. In his Good Arm, he holds the Two HAND GRENADES. Otis quickly attends to Vinh’s shoulder. He asks Vinh. OTIS How many you got left? VINH Empty. Desroche holds his Wounded Arm running to The Jeep speaking with The Degar Tracker, who directs TWO over. Des",
      "dialogue_count": 0,
      "word_count": 1374
    },
    {
      "scene_number": 22,
      "slugline": "INT. VINH’S TOUR TRAVEL OFFICE - DAY 93   93  A very nicely equipped office in a professional high rise in Ho Chi Minh City. Vinh sits at his polished glass desk his arm in a sling. Nguyen and his comrades now in business attire working in the office. Vinh writes out something.  RIGHT ON   by Marvin Gaye plays. INT. BLM HEADQUARTERS - DAY 94   94  Black Young People are busy doing office work. Huddles of volunteers having conversations working on projects. A volunteer at a desk opens the mail and looks at something. She leaves her desk walking to a door knocking, entering... THE PRESIDENT’S OFFICE A Black Woman, PRESIDENT, CARMICHAEL, 30’s behind a desk working when the Volunteer nears her showing her the mail. She removes a letter from an envelope that says: POWER TO THE PEOPLE! She then looks at a Check for TWO MILLION DOLLARS addressed to: BLACK LIVES MATTER. The President looks up, stunned. CUT BACK TO: INT. VINH’S TOUR TRAVEL OFFICE - DAY 95   95  Vinh writing more. The Marvin Gaye Song   RIGHT ON   Continues. CUT TO: INT. MELVIN’S HOUSE - DAY 96   96  Cissy and Marcus, both looking hurt, stand at their front door being handed a Fed Ex envelope by a DELIVERY DRIVER. They open it removing the piece of paper: FROM MELVIN WITH LOVE! She places her hand over her mouth looking at the check for TWO MILLION DOLLARS. CUT TO: INT. MAG “MINES ADVISORY GROUP” - DAY 97   97  Hedy and Simon stand there with David, who leans on a cane. Revealing a banner: THE TRAVIS KELLY FOUNDATION FOR PROSTHETICS OUTREACH. Hedy steps behind a podium speaking before a Press Conference. 127.",
      "characters": [],
      "action_text": "HEDY The Travis Kelly Foundation was created to end the injuries and deaths caused by Mines and Cluster Bombs remaining in the Quang Tri Province in Central Vietnam. Travis Kelly tragically gave his life removing unexploded ordinances. David listens. HEDY (CONT’D) It is in the spirit of The Life he lived that the Foundation has received an initial grant of Three Million dollars to help continue the work of removing Mines and restoring the lives of Land Mine Victims. Several Children from The Village that were missing limbs now have new prosthetic limbs. HEDY (CONT’D) The Foundation is committed to ridding the world of the plague of mines that continue to destroy and damage lives. They are a constant reminded of how the Evil and Pain of War never ends. Hedy looks over at David. Their eyes meet. David thinks to himself reflecting on his Father and the insane adventure. PAUL’S (V.O.) Dear Son, If You Are Reading This Y’know I’m Deceased. I Gave This To My Main Man Otis when we decided to come back to NAM. INT. VINH’S TOUR TRAVEL OFFICE - DAY 98   98  PAUL’S (V.O.)(CONT’D) Like My Brother Tyrone Davis Sang, I WISH I COULD TURN BACK THE HANDS OF TIME... But I Can’t. Nobody Can. Not Even Almighty God. Vinh closes The Check Book taking a deep sigh of satisfaction. Marvin Gaye’s   Right On   continues. 128.",
      "dialogue_count": 0,
      "word_count": 513
    },
    {
      "scene_number": 23,
      "slugline": "EXT. LAX AIRPORT - DAY 99   99  PAUL’S (V.O.)(CONT’D) All I Can Say To You Is I’m Sorry. Sorry I Put You Through Holy Hell. On The Tarmac, an Honor Guard of Five Soldier in Dress Uniforms carry a Metal Casket draped with an American Flag from the C1 - Cargo Plane. CLOSE - JANET and KIM Stormin’ Norman’s Sisters, 60’s, wipe tears, standing there holding Norman’s framed official Army Photography from 1967 while the casket is placed in a hearse. INT. TIEN’S APARTMENT - NIGHT 100   100  A door opens and Tien stands there. She looks stunned as she sees Otis standing before her. He stands there staring back at her. Finally. PAUL’S (V.O.)(CONT’D) I’m Truly Sorry. David, Please Believe Me. It Wasn’t Your Fault. There are things about me you will never know and understand. But To Eternity And Back Your Dear Mother Jackie And I Will Love You Always, Your Father... Paul. OTIS Can I come in? He looks behind Tien seeing Michon, who cracks a warm smile at him. Tien hugs Otis tightly, tears in her Eyes, as Otis enters and the door closes. FADE TO BLACK: END. 129.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 194
    }
  ]
}