{
  "slug": "dallas-buyers-club-2013",
  "title": "dallas buyers club",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 21,
  "characters_count": 1,
  "characters": [
    "DR. VASS"
  ],
  "total_words": 21916,
  "total_dialogue": 1,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. RODEO STADIUM - DALLAS - TEXAS - DAY 1   1  Ambient sounds of the CROWD, RODEO, SEX, and a strange RINGING fade in along with IMAGES of... A COWBOY riding a BULL in an enclosed RODEO ring. RON WOODROOF, early 40's, handsome, long sandy hair, denim clad, worn snakeskin boots, dusty, cowboy hat, mirrored aviators, is engaged in wild SEX with a WOMAN.   He watches the rodeo through open slats in a BULL STALL as the STEER throws the COWBOY violently thru the air; he lands hard on the dirt. Another WOMAN snorts cocaine and offers some to Ron as he switches over to having SEX with her. The BULL STOMPS the Cowboy with its HOOFS. Ron climaxes -- pleasure and pain seem to come out of him, but we can't hear him, only this strange RINGING. RODEO CLOWNS grab the Cowboy's limp body and drag him out of the ring. Ron catches his breath; something is off. RON (V.O.) Did ya hear Rock Hudson was a cock sucker? EXT. RODEO STADIUM - LOCKER ROOM - DAY 2   2  A Dallas NEWSPAPER folded in half.   July.   1985.   AIDS.   New treatment.   In Paris.   ROCK HUDSON on the cover.   A HAND scribbles numbers over the photo. CLINT (V.O.) Where’d ya hear that? CLINT (32) a greasy hick who’s spent the last five months under the hood of a CHEVY, hands RON a WAD of CASH. RON It’s called a newspaper.   You heard of it? Ron smiles, adjusts his cowboy hat as he records some bets. Nearby, BULL FIGHTERS are putting on their clown makeup. RON What a waste.   All that fine Hollywood pussy on a guy who smokes his friends.  A HAND comes down through the slats holding a ten dollar bill.",
      "characters": [],
      "action_text": "RON C’mon Rog, this ain't the sandbox. Twenty’s the minimum. ROG slides another ten down; Ron snatches it. ROG Who the hell’s Rock Hudson? Ron looks at Rog.   A beat, then he starts laughing, then coughing... EXT. RODEO STADIUM - BULL STALL - DAY 3   3  ...and coughing as we follow him into the stalls.   Ron glad- hands as he goes; it seems everyone knows him but doesn't necessarily like him.   He makes his way toward T.J., white trash, pale as winter, who wipes vomit from his chin.   As he nervously looks down at the big angry BULL he’s about to ride, Ron hands him a pint of tequila. RON Calm the nerves, brother.   You look great. T.J. takes a swig, gives him a look. RON It's your day, I can feel it. T.J. watches as Ron takes a bottle of NYQUIL out of his pocket and downs it... to stop his hacking cough. T.J. I don’t know, Ron. Ron fans the money out for T.J. to see. RON Eight seconds and you'll be gettin blown by a hundred dollar hooker before you can scrape the bullshit off your boots. Ron winks and smiles.   T.J. signals the BULLMAN that he's ready.   And in five, four, three, two, one... THE GATE is up, the BULL is out, the crowd is HOLLERING and T.J.’s back is bending in unnatural ways. RON C’mon!   One one thousand, two one thousand, three one thousand...  Dallas Buyers Club / Green Revision / Dec 2, 2012 / P. 2 And T.J. is DOWN. RON Ah hen shit! Ron looks to the BLEACHERS.   The GAMBLERS are already searching for him. Ron slips out a SIDE ENTRANCE. EXT. RODEO STADIUM - PARKING LOT - DAY 4   4  Sweating, heart racing, Ron runs across the lot and jumps over fences to escape THE GAMBLERS that are running after him.   As they close in, Ron spots a cop, TUCKER, walking towards his patrol car. RON Hey, buddy I need you to arrest me. TUCKER Fuck off, Woodroof. RON Come on, man.   I'm serious! Tuck sees the angry mob approaching. TUCKER Looks like you got a few pissed off customers. RON You gonna cuff me or what? TUCKER Figure it out yourself. And with that, Ron PUN",
      "dialogue_count": 0,
      "word_count": 734
    },
    {
      "scene_number": 2,
      "slugline": "EXT. RON’S TRAILER - DAY 5   5  Tucker’s police car pulls up. TUCKER (V.O.) They’re gonna kick the shit out of you one day, Woodroof.   Maybe worse. INT. TUCKER’S POLICE CAR - DAY 6   6  Both Ron and Tucker are bleeding and bruised. RON Gotta die from somethin'. TUCKER Handle your business, huh?   Get your shit together. RON You're startin' to sound like your ol' man.   How's he doin' by the way? TUCKER (beat) There's good days and bad. RON (waving him off) Ah, he's a tough one. (beat) Though I can't imagine how disappointed he must be havin' you for a son. Tucker looks at him, half-smiles. TUCKER Get the fuck outta my car. Ron smiles, starts to get out, then stops.   Holds his head a moment.   We hear the strange RINGING sound again. TUCKER (CONT’D) You okay? RON (covers) You rattled my fuckin' brain. TUCKER What brain?  Dallas Buyers Club / Green Revision / Dec 2, 2012 / P. 4",
      "characters": [],
      "action_text": "Ron forces a smile, then exits the car.   Tucker watches as Ron slowly heads toward his trailer; something seems off.   After a few beats, Tucker brushes it off and pulls away. INT. RON'S TRAILER - DAY 7   7  Books, newspapers, empty beer cans and liquor bottles; on the wall, we may notice a painting of some Texas Wildflowers. Ron stumbles in as the RINGING sound comes back.   He stops, steadies himself on a piece of furniture, takes a few steps then collapses, unconscious. INT. RON'S TRAILER - MORNING 8   8  The first shafts of sunlight fall over Ron, still asleep where he dropped.   After a few beats, he stirs, pulls himself on to a chair. \"What the fuck?\". EXT. OIL FIELD - DAY 9   9  Lunch time.   Already a little drunk, Ron finishes off a pint of whiskey as Clint and a battered T.J. eat sandwiches nearby. Ron starts coughing again as he grabs a packet of cocaine out of his shirt pocket.   He slides it across the table to Clint who hands him cash. RON That shit is purer than a preacher daughter's pussy. CLINT Not after you just coughed your lungs all over it. T.J. You think anymore 'bout Saudi Arabia? They need guys over there. RON What do you wanna go work for a buncha sand niggas for? T.J. They pay five times as much, that’s why. Ron raises his eyebrows, not bad. T.J. I’m signing up.  Dallas Buyers Club / Green Revision / Dec 2, 2012 / P. 5 RON They got hot ladies over there? T.J. It’s a Muslim country.   You can’t fuck the women. RON Now that takes me out right there. The FOREMAN races over to them. FOREMAN Woodroof, there’s been an accident on platform five.   They need an electrician right away! EXT. DRILL PLATFORM - DAY - LATER 10   10  A MEXICAN WORKER has his leg caught in the drill.   It’s severed and he’s losing blood fast.   Ron walks over. RON Dumb spic.   How’d you get your leg in there? The guy’s breath is coming in short fast spurts. RON Where’s the ambulance? FOREMAN He’s illegal. Ron takes his OWN shirt off, rips it in half, kneels down next to t",
      "dialogue_count": 0,
      "word_count": 1158
    },
    {
      "scene_number": 3,
      "slugline": "INT. DALLAS MERCY HOSPITAL - ROOM - DAY 13   13  Ron, head and eyes bandaged, lays on a bed.   After a few beats, he peels off the eye bandages, gets up.   He opens a cabinet, then a drawer.   Finds a bag of sucking CANDY, pops a piece in his mouth, puts some in his pocket.   He sees his jacket on the back of the door, searches his pockets for a cigarette.   He's about to light one when Dr. Sevard enters with Eve Sakes.   Both wear surgical masks and latex gloves. DR. SEVARD Mr. Woodroof.   I'm Dr. Sevard. Ron turns to Eve, flashes a smile. DR. SEVARD We saw something that concerned us in your initial blood work so we ran some additional tests. EVE Blood tests. Ron stops moving and tries to assess the situation.   Is he in trouble? RON What kinda blood tests, cause I don't use drugs. EVE We didn't test you for drugs. RON Good, cause that ain't none of yer business anyway. DR. SEVARD You’ve tested positive for HIV -- Ron looks at Dr. Sevard blankly. DR. SEVARD ...the virus that causes AIDS. Ron freezes.   A long beat. RON Who you kidding, Rock cock sucking Hudson bullshit?! DR. SEVARD Have you ever used intravenous drugs or had any homosexual --  Dallas Buyers Club / Green Revision / Dec 2, 2012 / P. 9",
      "characters": [],
      "action_text": "Ron spits out his CANDY. RON Homo?   Homo?   That’s what you said, right?   Shit.   You gotta be kidding me. (laughs) I ain’t no faggot,   I don't even know any faggots, I’m a rodeo! The room is silent. RON Look at me, doc.   Come on now, look at me.   What do you see? DR. SEVARD Your T-cell count is down to nine, a healthy person has five hundred to fifteen hundred. RON What the fuck's a three-Cell?! DR. SEVARD T-cell.   Frankly we’re surprised you’re alive. RON Well surprise this: you’ve made a fuckin’ mistake! Ron looks back and forth from Dr. Saks to Sevard.   No mistake. RON You must've mixed my blood with some daisy puller or sumptin. EVE We ran the blood test several times. Eve hands him some pamphlets and other paper work. EVE That's some information on HIV and AIDS you may find informative and your test results. Ron flips through the papers.   Becomes frustrated by terminology he doesn't understand. DR. SEVARD Mr. Woodroof, we're trying to impress upon you the gravity of your situation.  Dallas Buyers Club / Green Revision / Dec 2, 2012 / P. 10  (MORE) Based on your condition, we estimate that you have about thirty days to get your affairs in order -- RON Thirty days? Ron jumps off the examining table. RON What is this shit?! They don't respond. Ron laughs incredulously and walks towards the door. RON I got a news flash for all y'all, there ain’t nothin' out there that can kill Ron Woodroof in thirty days. Ron looks at the papers, tosses them up in the air and exits. INT. RON’S TRAILER - NIGHT 14   14  Music BLARES as Ron and T.J. party with two hot girls, KELLY and CRYSTAL, 20s.   T.J. cuts a line of coke on a mirror while Ron dances over to the girls with SHOTS of Jack Daniels.   They both start kissing, then rubbing up against Ron. INT. RON’S TRAILER - NIGHT 15   15  T.J. is having sex with Kelly as Ron kisses Crystal; he leans down, snorts what is probably his fiftieth line of coke.   He shakes it off, slams some Jack Daniels from the bottle as if it wa",
      "dialogue_count": 0,
      "word_count": 4363
    },
    {
      "scene_number": 4,
      "slugline": "INT. DR. VASS’ CLINIC - MEXICO CITY - DAY 41   41  Ron enters, blind-sided by the mayhem inside.   Boxes of drugs and hospital supplies lie in various stages of unpacking.   An INTERPRETER shouts above the din to his wealthy ASIAN CLIENT.  Dallas Buyers Club / Green Revision / Dec 2, 2012 / P. 27A",
      "characters": [],
      "action_text": "DR. VASS (50’s), fit but tired, shouts in Spanish to a MAN unloading boxes.   He effortlessly switches to Japanese, continues to shout to another worker. Dr. Vass sees Ron, quickly moves over to him. DR. VASS You have something for me to sign? RON I’m lookin’ for Dr. Vass. Dr. Vass steps over. DR. VASS Speak up. RON I’m lookin’ for Vass, for some AZT. DR. VASS Looking to poison yourself? He grabs an empty bottle of pills on the counter.   Throws it to Ron. DR. VASS That's from the chemical manufacturer who makes AZT, Sigma. Ron looks at the bottle labeled with skull and crossbones: HIGHLY TOXIC, NOT FOR HUMAN CONSUMPTION. DR. VASS First thing I tell my patients: you won't find that shit here! Ron looks confused.   A nearby stack of boxes tumbles over. Dr. Vass shouts to no one in particular. VASS Who stacked those boxes there? (to Ron) Check in with a nurse. Dr. Vass is off, ripping open boxes. Ron starts to cough again.   Badly.   Vass notices, and shouts something in Spanish.  Dallas Buyers Club / Green Revision / Dec 2, 2012 / P. 28",
      "dialogue_count": 0,
      "word_count": 245
    },
    {
      "scene_number": 5,
      "slugline": "INT. DR. VASS’ CLINIC - MEXICO CITY - DAY 42   42  Frail and weak, Ron lies on a cot, surrounded by a dozen other PATIENTS of varied nationalities.   A NURSE records his vital signs in a chart, then hands it off to Dr. Vass, who peruses the information and begins reading aloud: DR. VASS Cocaine, alcohol, methamphetamine, AZT. (to Ron) That's what I call a recipe for disaster. RON (looking around) Doc, this place is a shit-hole. DR. VASS Who said I was a Doctor?   They revoked my license to practice three years ago, that’s why I’m down in this shit-hole. RON Why?   What'd you do? DR. VASS I didn't play ball. Ron smiles. DR. VASS These drugs you’re doing, they're breaking down your immune system, making you susceptible to infections. RON So cocaine gave me pneumonia? DR. VASS Cocaine made you more susceptible. As did AZT. RON I thought AZT's supposed to help me. DR. VASS The only people AZT helps are the people who sell it. (beat) It kills every cell it comes in contact with, good and bad. RON So medically speakin', I kicked my own ass!  Dallas Buyers Club / Green Revision / Dec 2, 2012 / P. 29",
      "characters": [
        "DR. VASS"
      ],
      "action_text": "You shot your immune system.   Now you have chronic pneumonia, among other things.   It can cause memory loss, mood swings, aching joints... RON If it sucks, I got it. Dr. Vass smiles and holds up a bottle in each hand. DR. VASS This is DDC, it works as an anti viral similar to AZT but less toxic.   And this is Peptide T, it's a protein -- totally non-toxic.   Early studies have shown it can help with all of that.   This is what I had you on since you got here. RON And you can't buy them back in the U.S.? DR. VASS No, not approved. Ron takes the bottle of PEPTIDE T, turns it over in his hand, looks around. RON Chinks, homos and herbs, you got a new world order here, Vass. You could be makin’ a fortune off this stuff. EXT. DR. VASS' CLINIC - MEXICO CITY - DAY 45   45  Ron stares into the trunk of his Lincoln Convertible. VARIOUS BOXES filled with illegal meds are packed to the brim. It won't close.   Ron slams it shut. Dr. Vass emerges from the building.   He hands Ron a neatly folded black vest, black pants and a detachable clerical collar on top. DR. VASS If you get caught, don't tell them you got AIDS.   They'll never let you back in. You've got thirty days to get your ass back down here and pay me the other half, after that I send MIGUEL. Ron nods to Miguel, hops in his car, starts it, nods to Vass and takes off.  Dallas Buyers Club / Green Revision / Dec 2, 2012 / P. 31  DR. VASS (CONT'D)",
      "dialogue_count": 1,
      "word_count": 698
    },
    {
      "scene_number": 6,
      "slugline": "EXT. CAR - THE CHIHUAHUAN DESERT - MEXICO - DAY 46   46  Ron's convertible races along the asphalt road.   Hot desert sun.   Sand and dirt cake the rims and tires.   The car slows down and comes to a stop on the side of the road. INT. RON'S CAR - THE CHIHUAHUAN DESERT - MEXICO - DAY 47   47  BINOCULARS POV on CARS making their way across the MEXICAN/AMERICAN BORDER.   Ron puts down the binoculars and writes on a NOTEBOOK.   A crude drawing of the border.   He marks different lanes, studies it, looking for patterns. Ron throws the pen down and exits the car. EXT. CAR - THE CHIHUAHUAN DESERT - MEXICO - DAY 48   48  As Ron goes to get out of the car he is pulled back by a PLASTIC TUBE attached to his ARM. We follow it up to a shirt HOOK on the passenger side. An I.V. BAG hangs carelessly from the hook, a liquid flowing INTRAVENOUSLY into Ron's arm. He reaches in and grabs the bag off the hook, gets out of the car, holds the bag above his shoulder and takes a PISS. INT. RON'S CAR - AMERICAN/MEXICAN BORDER - DAY 49   49  Ron now wears a PRIEST UNIFORM.   He hands the BORDER AGENT his passport. BORDER AGENT Anything to declare. RON Nada. The Border Agent takes him in a moment, his outfit, the car, the frame of the trunk almost touching the wheel and... CUT TO: INT. U.S. CUSTOMS HOLDING ROOM - AMERICAN/MEXICAN BORDER - DAY 50   50  Ron sits behind a table when a MAN in a suit walks in.   He takes off his jacket and sits.  Dallas Buyers Club / Green Revision / Dec 2, 2012 / P. 32",
      "characters": [],
      "action_text": "RICHARD BARKLEY I’m Richard Barkley from the Food and Drug Administration office. Ron nods.   A beat. RICHARD BARKLEY You're a priest?  Dallas Buyers Club / Green Revision / Dec 2, 2012 / P. 32A Ron smiles.   The customs agent doesn't. RICHARD BARKLEY You have over 2,000 pills here.   You are only allowed to bring in a ninety day supply. RON Well as I told the gentlemen, I am a sick man.   I have cancer.   I take 22 pills a day and these here vials of Vitamin A, C, E and Zinc.   That there is ninety days. The man looks at Ron, not really buying it. He takes a bottle of Peptide T and looks at it. RICHARD BARKLEY Vitamins? (no answer from Ron) You do realize that importing unapproved drugs for sale is a very serious offense? RON Well, as I said, they're not for sale.   And they ain't illegal, just \"unapproved.\" A long beat; they stare at each other. RICHARD BARKLEY If we find the slightest indication that you’re selling these drugs for profit, you will be thrown in jail... Father. RON Then I promise to take each and every one of them pills myself.   In fact this present detainment has already put me off schedule... Son. INT. DALLAS MERCY HOSPITAL - RECEPTION DESK - DAY 50A   50A  Ron talks to Nurse Frazin. RON I'm looking for Dr. Eve Saks. NURSE FRAZIN She's not here today. Nurse Frazin leaves.   Ron looks over the counter, sees something, looks around...  Dallas Buyers Club / Green Revision / Dec 2, 2012 / P. 33",
      "dialogue_count": 0,
      "word_count": 550
    },
    {
      "scene_number": 7,
      "slugline": "INT. EVE’S HOUSE - LIVING ROOM - DALLAS - NIGHT 51   51  Perfectly ordered and spotless except for files and reports piled on the floor.   An exhausted Eve takes her lab coat off, picks up a study and aims for the kitchen when a KNOCK comes at the door. EVE It's open! Ron comes in. EVE Mr. Woodroof... Ron, I thought you were...  Dallas Buyers Club / Green Revision / Dec 2, 2012 / P. 33A",
      "characters": [],
      "action_text": "RON (cutting her off) Dead?   Sorry for bargin' in. EVE What are you doing here?   You look great. RON Actually I look amazin’.   But you, you look like shit. EVE What happened to you? RON So you got any music?   Or crackers? EVE I'm sorry, but what is this? RON It's a celebration of how absolutely fuckin' wrong you were. Ron holds up a bottle of sparkling wine. EVE Excuse me? RON Thirty days you said!   Well here it is months later and I'm goin' like gangbusters.   Now if that don't call for a little Cheez Whiz on a Ritz, I don't know what does! Ron heads for the refrigerator. EVE No.   Don’t... I don’t really eat here. The DOORBELL interrupts them.   Ron watches as Eve crosses and opens the door, admitting Rayon, looking like shit and shaking badly in a full-length, pink fur coat. RAYON Them bastards Kentucky fried me. Rayon sways; Eve grabs his arm.   Ron watches as Eve helps Rayon inside.  Dallas Buyers Club / Green Revision / Dec 2, 2012 / P. 34 RON You women love Nancy Boys. Ron crosses to help Rayon to the couch.   He leans his head back, labors to breathe. EVE (to Rayon) Tell me what's wrong. RON Hell, I'll tell you what's wrong, it's the goddamn AZT! EVE What? RON It's killin' him, can't you see that? Why you think I look so healthy? Ron reaches into his his jacket, produces a small BOX filled with MEDS.   He takes out a brand new syringe and bottle of liquid. RON Tinkerbell, how much cash you got? Off his silence, Ron rummages through Rayon's purse, extracts two twenties, pockets them, and starts preparing the syringe. EVE What the hell do you think you're doing?! RON Helpin' him, that's what. EVE He’s a participant in a clinical trial, we need to get him to the hospital! RON So they can fuck him up even worse? Ron disregards her protests, starts to inject Rayon. EVE Are you out of your mind?!   If anything happens to him-- RON Relax, it's just a little vitamin boost, A, C, zinc.  Dallas Buyers Club / Green Revision / Dec 2, 2012 / P. 35  (MORE) (to Rayon)",
      "dialogue_count": 0,
      "word_count": 1675
    },
    {
      "scene_number": 8,
      "slugline": "INT. DALLAS BUYER'S CLUB MOTEL - RON'S OFFICE - DAY 61   61  Ron stacks boxes in the room among his personal stuff.   The place looks like what it is: a cheap sex motel. RAYON This place is disgusting.   We need to disinfect. RON Do not use the word “we”.   Now you wanna put your apron on and fly around on your broom, be my guest. Just then, a KNOCK on the open door.   Rayon and Ron look up to see attorney DAVID WAYNE, 40s. RON Howdy Counselor, welcome. RAYON Hi, I'm Rayon. Wayne takes in Rayon. RON He's my partner.   Business partner. Ron throws a key to Rayon. RON Your office's next door. Rayon gets the message and exits.   Wayne looks around at all the boxes. DAVID WAYNE Jesus, how many truck loads you bring back from Mexico?   All for your own personal use? (gives Ron a folder) Here's the paper work for your LLC.   I don't even want to know what it's for. RON Don't worry, Counselor.   I ain't selling drugs anymore. (off Wayne's look of surprise) I'm giving them away.   For free. (showing the folder) By selling memberships. Four hundred a month in dues gets you all the meds you need.  Dallas Buyers Club / Green Revision / Dec 2, 2012 / P. 41  (MORE)",
      "characters": [],
      "action_text": "Wayne looks at him, thinking it over. DAVID WAYNE You son of a bitch! RON Bitches.   Plural.   There's a bunch of faggots runnin' a hell of a club up in New York.   That's where I got the idea. (beat) Welcome to the Dallas Buyers Club. INT. EVE’S HOUSE - DALLAS - NIGHT - MARCH 1987 62   62  Eve pours herself a glass of red wine, cleans the stain left by the bottle on the counter and sits on the couch between paper works.   CLOSE ON the TV NEWS ANCHOR.  NEWS ANCHOR Barrow Wilkem announced today that AZT has been approved as the first drug to treat AIDS.   At a cost of $10,000 per year per patient, AZT is the most expensive drug ever marketed.   Barrow Wilkem stock jumped a whopping 12% today on the news. Eve sits, staring at the TV. INT. DALLAS BUYERS CLUB MOTEL - RAYON'S OFFICE - DAY 63   63  The small room has been turned into an office.   In his version of a Nurse outfit, Rayon is taping photos of MARC BOLAN to the wall.   We now understand where Rayon’s look comes from.   TEN MEN linger through the room and into the next one through a connecting door... RON'S OFFICE Ron is behind a desk, atop which sits a gun, a bottle of Tequila and dozens of medical files. On the wall nearby are posters of SPORTS CARS and BIKINI MODELS as well as the Texas Wildflowers painting, news clippings regarding AIDS and a crude CHART listing Patients and their info: SYMPTOMS, DRUGS TAKEN, and ORIENTATION (Gay, Drug Addict, Hemophiliac).  Dallas Buyers Club / Green Revision / Dec 2, 2012 / P. 42  RON (CONT'D) RAYON (as he enters) Roanie, we have two new customers. Ron looks up from the chart he's filling out. RON Bring 'em in and if you call me Roanie again... (grabs his gun) ...I’ma use this gun to give you the sex change you been hopin' for. Rayon shakes his head, walking off, as IAN and MICHAEL, a conservative gay couple in their 50s appear in the doorway. They look at Ron's gun and hesitate to walk in. RON Ah shit, did I scare you?   Sorry. Welcome to the Dallas Buyers Club. Ron puts",
      "dialogue_count": 0,
      "word_count": 1516
    },
    {
      "scene_number": 9,
      "slugline": "EXT. DALLAS BUYERS CLUB MOTEL - HALLWAY - DAY 67   67  Two dozen MEN, all prospective buyers, snake down the long exterior hallway.   A NEIGHBOR walks by, disgusted, hugging the wall as he makes it to his own door. That is Ron’s POV following at a distance as he arrives from the supermarket. INT. DALLAS BUYERS CLUB MOTEL - 2ND FLOOR ROOM - DAY A young, gay man, FREDDIE, stands awkwardly fidgeting by the door, makeup poorly masking lesions on his face and neck.   The line of customers is snaking behind him. Ron sees Freddie's money, grabs it and counts it. RON Fifty bucks. (yelling to the line) You don’t got the money, you don’t join the club.   This ain't no charity. Ron gives Freddy his money back. RON You need three hundred and fifty more. DENISE, a Club volunteer, early forties, walks in. DENISE Beaumont Lab's delivery is here.   A woman says you were expecting her. INT. DALLAS BUYERS CLUB MOTEL - RON'S OFFICE - DAY 69   69  FRANCINE SUSKIND (37), stands in front of Ron's desk looking at a MAN behind her wheeling in cardboard boxes on a dolly. FRANCINE SUSKIND You can get it abroad but in the States, we can only use it for animal research. It's not classified as a drug so the FDA does not control it. RON I’m usin’ it for memory loss.   You oughta try gettin’ it to market. FRANCINE SUSKIND It costs around 250 million dollars to get a drug to market.  Dallas Buyers Club / Green Revision / Dec 2, 2012 / P. 48",
      "characters": [],
      "action_text": "RON Damn, bureaucracy is good business. Francine smiles, she likes Ron.   The man places the BOXES marked PEPTIDE T on the floor. FRANCINE SUSKIND These are for your animal research. Ron winks at her, waits for the delivery man to leave, and produces a plastic BAG filled with vials and drugs. RON And these are for your daughter. She takes the bag of medication and surprisingly becomes emotional.   She holds it back, tries to say thank you but can't.   Ron nods \"it's ok\".   She hugs him. INT. DALLAS BUYERS CLUB MOTEL - 2ND FLOOR ROOM - NIGHT Rayon finishes packing Ron's suitcase.   He's high.   Wasted. INT. DALLAS BUYERS CLUB MOTEL - RON'S OFFICE - NIGHT 71   71  Ron works the combination lock on a safe.   He stops.   Wonders what's wrong.   Looks dizzy.   He goes to his desk and pops some pills.   Takes a deep breath. Rayon enters with the suitcase and a Pan Am airline envelope. RAYON You're all packed, here's your ticket. Ron removes a stack of cash from the safe and hands it to Rayon. RON (keeps the money) Jesus!   Are you fuckin' high? RAYON None of your business. RON Actually, it is if I can't fuckin' trust you. (yelling) Denise! Denise shows up from the other room.  Dallas Buyers Club / Green Revision / Dec 2, 2012 / P. 49 RON You're in charge! RAYON (grabs the money) No!   You can trust me!  Dallas Buyers Club / Green Revision / Dec 2, 2012 / P. 49A They stare at each other. RON Make sure my new Caddy is at the airport for when I get back. RAYON Got it. RON Denise, you hearin' this?   Now you two monkeys take care of the zoo. And as Ron takes his suitcase and exits... RON (to Denise) Keep an eye on him. EXT. AIRPLANE - STOCK FOOTAGE - DAY 72   72  A 747 soars across the sky.   On screen appears:  Hayashira Chemical Lab - Okayama, Japan  INT. HAYASHIRA CHEMICAL LAB - JAPAN - WAITING AREA - DAY 73   73  Briefcase in hand, cowboy hat on his head, Ron waits along with JAPANESE MEN who all stare at him.   After a few beats, MR. YAMATA, the lab's manager approaches.",
      "dialogue_count": 0,
      "word_count": 1893
    },
    {
      "scene_number": 10,
      "slugline": "INT. DALLAS BUYERS CLUB MOTEL - RON'S OFFICE - DAY 86   86  Not yet open for business.   As Rayon and his friend SUNNY hang photos on a freshly-painted nearby wall.   Eve stands across from Ron with her arms crossed. RON I got first hand experience with all of 'em.   And I'll tell you something else, if I don't know what somethin' is, or don't trust the white coat who's trying to sell it to me, I fed-ex it to my lab in Seattle and they test if for me. Eve looks around at all the boxes and files. RON Then I test it all on myself before I give it to anyone else. (off her look) I'm my own lab rat. He grabs a box of meds. RON Compound Q.   You know what happens if I come off it? My hair falls out, I lose weight, I can't get my dick up and I start to die.   I got three hundred other people with the same experience. (grabs another box) Peptitde T.   Gets rid of dementia.   Stop takin' it and you can't think straight, walk straight, or act straight.   I got over two hundred people on that.   You following me? (grabs another box) DDC and DDI, both toxic, but in small doses, helps kick opportunistic infections. EVE Ron, I respect that you're learning about your illness but some of these people should be in the hospital. RON All the hospital wants is to serve up AZT. EVE AZT helps eradicate the virus.  Dallas Buyers Club / Green Revision / Dec 2, 2012 / P. 58",
      "characters": [],
      "action_text": "RON Fuck the virus, once you got that, you're married to it.   I'm more concerned about my symptoms and survival.   I mean, I'm no scientist but... RAYON (mocking him) You're not?   'Cause you sound so... scientific. Rayon and Sunny laugh like children. RON You fuckin' high again? RAYON (giggling) I dunno. RON Are you listenin' to what I'm sayin' here about usin' that shit? (then; noticing) And what the fuck did you do to my wall?! RAYON It’s cranberry mocha.   For the holidays. Ron looks back at Eve, exasperated.   He grabs a folder off his desk. RON People can live with this thing for longer than they're saying.   Ninety-six- percent of people diagnosed with AIDS in the U S of A will be dead in under six months. EVE I know the statistics. RON Then use them.   Why give people AZT when their immune system is broken?   It's fuckin' toxic! EVE If you're abusing it, like you did, with no medical surveillance, of course it is.  Dallas Buyers Club / Green Revision / Dec 2, 2012 / P. 58A RON Maybe I did abuse it, but I'm off it now, and I'm here, feeling good.   And I'm not the only one. Ron turns to Rayon and Sunny, who are hanging Marc Bolan's pictures on the wall. RON Why is Boy George’s goddamned face everywhere in my room? Rayon and Sunny laugh. RAYON It's Marc Bolan, silly!   Why don’t you just get it over with and say it, you love it! RON (re: Rayon’s Friend) Take your sunflower and get out. RAYON Fine! Rayon and Sunny leave the room, laughing.   Ron TEARS down Bolan’s pictures, and throws down the folder. RON You know what, look at it, don't look at it, I don't give a shit. After a beat, Eve takes the folder. 87   87  Dallas Buyers Club / Green Revision / Dec 2, 2012 / P. 58B",
      "dialogue_count": 0,
      "word_count": 583
    },
    {
      "scene_number": 11,
      "slugline": "INT. DALLAS BUYERS CLUB MOTEL - BATHROOM - NIGHT 88   88  Ron looks at his reflection in the mirror.   Looks like he just 89   89  woke up.   He stands over the sink taking his meds, pouring out pills from among a DOZEN bottles.   He finishes taking the last pills, washing them down with water.   Runs his hands through his hair, looks at himself in the mirror, tries to find a flattering angle.   He stands there looking at himself.   After a while, he nods his approval. INT. DALLAS MERCY HOSPITAL - HALLWAY - DAY 89A   89A  Sevard is about to walk into a room but stops in his track. Dumbfounded, he walks towards another room, shakes his head and continues to the nurse's station. DR. SEVARD Where the hell are my trial patients? Nurse Frazin ignores him and walks away.  Dallas Buyers Club / Green Revision / Dec 2, 2012 / P. 59",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 153
    },
    {
      "scene_number": 12,
      "slugline": "INT. DALLAS BUYERS CLUB MOTEL - RON'S OFFICE - DAY 90   90  The place is jammed with BUYERS.   On the wall, people add their information to Ron’s ever growing chart.   EMPLOYEES unpack boxes and wait to talk to Ron who walks out. EXT. DALLAS BUYERS CLUB MOTEL - DAY 90A   90A  Ron walks past the line of customers and up the stairs to the second floor.   He spots a MAN leaning against his new Cadillac. RON Don't touch! INT. DALLAS BUYERS CLUB MOTEL - 2ND FLOOR ROOM - DAY 91   91  Rayon, sick again, rolls down his pants and prepares to insert a needle into his thigh.   He closes his eyes, brings the wavering needle closer to his skin... RON If you ain’t doin’ poppers and coke, how come you look like such shit? Rayon ignores Ron, tries to muster up the courage. RON You pussy, stick it in.   Who do you think is gonna do that when I ain’t here? Rayon looks at Ron with pleading eyes. RON Rayon, I swear, God sure was dressin’ the wrong doll when he blessed you with a pair of balls. (walks over) Give me that thing. Ron takes the needle and injects Rayon with the drug. RON You know it's one thing for me not to like you, but why don't you be a better friend to yourself? RAYON If I really thought you were interested, I'd tell you. Just then, the door opens.   It's Ron's attorney, David Wayne.  Dallas Buyers Club / Green Revision / Dec 2, 2012 / P. 60",
      "characters": [],
      "action_text": "RON What are you doin' here? DAVID WAYNE (holds up paper) You're being audited.   The IRS. INT. DALLAS BUYERS CLUB MOTEL - RON'S OFFICE - DAY 92   92  Ron and David Wayne look on as two IRS AGENTS carry out boxes of receipts and other financial records. RON Nice work, fellas, great.   This is how you got Al Capone, ain't it? As the Agents exit: DAVID WAYNE Don’t piss them off.   If there’s a fine, we'll pay it. RON A fine?   Fine, alright, how much?   Ten thousand?   Twenty thousand?   I'll write you a check right now. Ron grabs his check book. RON You think that will stop me, you motherfuckers! David waves Ron down with his hands. 93   93  INT. DALLAS BUYERS CLUB MOTEL - RON'S OFFICE - NIGHT 94   94  Rayon is prepping shipping boxes with Sunny, drawing abstract artistic designs on the boxes. Ron walks out of the bathroom dressed in a gangster style suit.   Rayon gives him the once over.  Dallas Buyers Club / Green Revision / Dec 2, 2012 / P. 61 RAYON Honey, you don’t have a snowball’s chance wearing that thing. RON Rayon, I don’t need help gettin’ ladies from your sorry ass. RAYON Trailer trash and rodeo groupies do not count as ladies.   Are you sure she said the word yes? Fuck off! RAYON You got any flowers? Ron looks around, spots the Wild Flower PAINTING.   He walks over and yanks it off the wall, looks at Rayon defiantly, puts it under his arm and storms out the door. INT. DUNSTON'S STEAK HOUSE - NIGHT 95   95  Eve waits in a booth.   She watches a couple flirt at another table.   The WOMAN laughs and tosses her hair back.   Eve self consciously tucks her hair behind her ear.   She stops, realizes what she’s doing.   Just then, Ron approaches with the PAINTING. RON It’s the Wildflowers.   Texas style. Ron hands her the painting.   She smiles, plays along. EVE They’re beautiful.   Thank you.   And I don't even have to water them. Ron slides in across from her. RON Thanks for coming. A beat.   She looks at his suit and smiles politely. RON The IRS is on my ass. ",
      "dialogue_count": 0,
      "word_count": 1110
    },
    {
      "scene_number": 13,
      "slugline": "INT. DALLAS BUYERS CLUB MOTEL - RON'S OFFICE - NIGHT 97   97  We hear someone breathing.   We’re on one of the POSTERS of a bikini clad woman.   We pan to another poster of another girl, then another.   The breathing is getting more intense.   It's obvious that someone is masturbating.   Then we’re on a POSTER of... Marc Bolan.   The breathing stops.   Ron walks into frame and tears Bolan’s poster down.   Then he spots another one. And another one. RON I’m gonna kill him! INT. DALLAS BUYERS CLUB MOTEL - RAYON'S OFFICE - MORNING 98   98  Ron sifts through boxes of inventory with a clipboard in his hand. A sickly looking Rayon sits on the sofa sipping a cup of green tea, watching TV. RON We're running low on DDC and Peptide-T, I thought you were stocking this? RAYON Sit down and shut up. Ron's POV on the TV. NEWS ANCHOR New studies have proven that AZT is effective in stopping the progression of AIDS in asymptomatic cases.   Dr. Anthony Fauci, head of the National Institute of Health, announced that a trial had clearly shown that early AZT intervention will keep AIDS at bay.   AZT is the only drug that has been shown in scientifically controlled trials to be safe and effective, Fauci contended.  Dallas Buyers Club / Green Revision / Dec 2, 2012 / P. 65  (MORE)",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 227
    },
    {
      "scene_number": 14,
      "slugline": "INT. EVE’S HOUSE - LIVING ROOM - DAY 99   99  Phone to her ear, Eve sits watching the same broadcast. RON (O.C.) Scientifically controlled, my ass!   They took eight months to approve it.   And from what we know now, AZT is everything but safe! INT. DALLAS MERCY HOSPITAL - NURSE STATION - DAY 100   100  Eve stands talking to Nurse Frazin. EVE I want all my HIV patients on the asymptomatic study to have their AZT doses lowered to the minimum, 600 milligrams. INT. DALLAS BUYERS CLUB MOTEL - RON'S OFFICE - DAY 101   101  With the line snaking out the door, Ron sits behind the desk dealing with a BUYER. RON That's four pills, three times a day with food.   The vitamins too. As Ron starts putting the meds in a paper bag, we hear a commotion coming from the other room. RAYON (O.C.) I'm not letting you in, you have a search warrant? RAYON'S OFFICE: Rayon, still in his robe, stands blocking the doorway to Richard Barkley who signals to Tucker to take over.   Tucker gestures to Rayon to move out of the way.   He walks in with a FELLOW POLICE OFFICER and two DRUG ENFORCEMENT ADMINISTRATION (DEA) agents.  Dallas Buyers Club / Green Revision / Dec 2, 2012 / P. 66  NEWS ANCHOR (CONT'D)",
      "characters": [],
      "action_text": "RON The hell's all this? TUCKER Sorry, Ron. (to the Buyers) Gentlemen, I'm gonna need you all to leave the premises in an orderly fashion, please! Some GRUMBLING as the Buyers file out.   Barkley enters. RICHARD BARKLEY Mr. Woodroof, I have a court order permitting us to confiscate any and all non-FDA approved drugs or supplements. RON In other words, my entire inventory. Ron looks over at one of the FDA Agents, who has begun opening boxes.   As the Agent removes an unmarked bottle: RON Aloe vera!   It's a plant.   What do you give a shit if people eat plants? RICHARD BARKLEY It's improperly labeled.   That's a violation of FDA regulations. RON It's a bullshit technicality and you know it! (to Rayon) Get my lawyer on the phone. Rayon crosses off to make the call. RICHARD BARKLEY Our primary concern is preventing a market for illegal drugs. RON Illegal?   Unapproved!   These are vitamins and minerals, for Chrissake! RICHARD BARKLEY Vitamins and minerals that gave you a heart attack, remember? RON I'm not selling that stuff, you confiscated it, remember?  Dallas Buyers Club / Green Revision / Dec 2, 2012 / P. 67 The agents confiscate lots of small blue boxes and put them in an evidence bag. RON (sarcastic) What's the matter, you got Alzheimer, Richard? (pointing at the blue boxes) 'Cause Peptide T works for Alzheimers too, ya know? Tucker looks over at Ron. RON Come on, it's a protein!   Effective with dementia which I have.   Why don’t you just look at my research? RICHARD BARKLEY Woodroof, I wouldn’t want you to spend your last days in jail.   If you have a product you'd like tested, fill out an application and go through the process. RON Don't threaten me!   I'm unapproved motherfucker!   The process?   That's just FDA bullshit for pay up!   250 million worth! The Agents exit carrying boxes and bags; Barkley gives Ron a big smile. RICHARD BARKLEY You'll be receiving your fine for non compliance and improper labelling soon. Barkley leaves followed by Tucker who look",
      "dialogue_count": 0,
      "word_count": 808
    },
    {
      "scene_number": 15,
      "slugline": "INT. DALLAS BUYERS CLUB MOTEL - RAYON'S OFFICE - DAY 103   103  CLOSE ON TV: we see Ron and Rayon's reflection as they're watching FDA commissioner Frank Young standing at a podium before a dozen microphones, mid-press conference, bombarded by camera flashes. FRANK YOUNG ...Americans with life-threatening illnesses will be permitted to import small quantities of unapproved drugs for their personal use.   Under this arrangement, the drugs may only be purchased by individuals who have been prescribed the medication by a physician. Ron turns the TV off, shakes his head as he walks away. RAYON What the fuck does that mean? RON It means we were unapproved.   Now we're illegal! INT. LONESTAR BAR - BATHROOM - DAY 104   104  Ron pulls out a brown paper BAG from inside the PAPER TOWEL DISPENSER.   He removes a stack of CASH, puts it in his coat, places a BLUE BOX into the dispenser and closes the top. INT. LONESTAR BAR - DAY 105   105  Ron walks out to a table where Rayon is waiting.   Rayon has a ledger in front of him.   His condition is deteriorating. RON Let’s get outta here. Rayon gathers his things and gets up to leave.   Ron looks up and sees TUCKER looking at him as he’s drinking a beer across the room with a few other cops.   Ron signals to a waitress. RON Send a round of beers over to my friends. Ron throws some cash down on the table. RAYON Save your money, we're broke.   Our credit cards are maxed.  Dallas Buyers Club / Green Revision / Dec 2, 2012 / P. 70  (MORE)",
      "characters": [],
      "action_text": "A hundred grand between the FDA and the IRS fines.   The pharmacy bills due... Ron ignores him.   A busty waitress floats by. RAYON How bout that size?   Those would look good on me. RON You ain’t gettin’ tits, Rayon. Memberships are high and so is demand. So we recruit more members from where? RAYON Support groups. RON Yep!   I'm gotta find MDs to write them prescriptions so we can keep dealin' these drugs... legally now. RAYON In the meantime we could try the bank? RON Oh yeah, Bonnie and Clyde comin’ in for a loan.   Stop starin’ at her tits, you're startin’ to look normal. INT. TUCKER’S HOUSE - KITCHEN - DAY 106   106  Tucker, still in his police uniform, finishes clearing the table after dinner with his old father, who sits silently in a rocking chair. Tucker opens the BLUE BOX and removes a Buyers Club bottle of Peptide T and a note. RON (V.O.) Tuck, sorry to hear about your dad’s Alzheimer.   This will help.   Woodroof. INT. SMALL HOME - DALLAS - DAY 107   107  The house hasn’t seen new carpet since the 60’s.   The conservative gay couple we met earlier, Ian and Michael, show Ron around.  Dallas Buyers Club / Green Revision / Dec 2, 2012 / P. 71  RAYON (CONT'D) RON This place is crap, I’ll give you one fifty a month and fifty percent off your meds. IAN Mr. Woodroof -- RON Don’t try to con me -- IAN We don’t want money. RON What do you want? IAN The house is free.   We want to help. Ron looks from Ian and Michael and back again. RON Oh.   Well that’s good news. Ian sticks his hand out, Ron shakes it. INT. DRADDY AUDITORIUM - DALLAS HIGH SCHOOL - NIGHT 108   108  The same meeting from the beginning; packed with mostly gay MEN.   A different group of people are here now, but the atmosphere is the same. Ron stands at the back of the auditorium with Rayon at his side chewing gum like a baseball coach.   Ron flips the lights off and on... RON Hello... Howdy... The CROWD calms down, turns to look at Ron. RON I got what you got and I have traveled the world looking f",
      "dialogue_count": 0,
      "word_count": 1001
    },
    {
      "scene_number": 16,
      "slugline": "INT. MAN'S OFFICE - FIRST BANK - DALLAS - DAY 110   110  Rayon looks at the various family PHOTOS which decorate the bookshelves of the man's office who sits behind his desk. RAYON Guess I didn't make the cut. THE MAN You made that choice yourself. RAYON It wasn't a choice, Dad. Rayon's father looks at him with disdain.  Dallas Buyers Club / Green Revision / Dec 2, 2012 / P. 73A",
      "characters": [],
      "action_text": "RAYON'S FATHER What do you want, Raymond? RAYON I'm fine, thanks.   And you?   Long time no see. RAYON'S FATHER I suppose I should thank you for wearing men's clothes and not embarrassing me. RAYON (sarcastic) Are you ashamed of me?   Because I never realized that. RAYON'S FATHER (shaking his head) God help me. RAYON He is helpin’ you.   I got AIDS. A long beat during which Rayon's father finally shows some sympathy.   Rayon looks like his father's son for a moment. RAYON I’m sorry, dad.   I found someone who’s been helping me and now I’d like to help him. INT. DALLAS BUYERS CLUB - RAYON'S OFFICE - BATHROOM - DAY A110   A110  Rayon finishes taking Ron's suit off and looks at his reflection, takes in the lesions on his naked body, grabs a compact and a tube of lipstick, and starts putting making up on his face, holding back tears. RAYON God, when I meet you, I’m gonna look pretty if it’s the last thing I do.   I’ll be a super model angel. INT. DALLAS BUYERS CLUB MOTEL - RON'S OFFICE - NIGHT 111   111  Ron is on the PHONE, his personal address book in his hand. There is MOVING BOXES scattered throughout the room. RON What?   No, please, wait a minute, doc...  Dallas Buyers Club / Green Revision / Dec 2, 2012 / P. 74 The phone CLICKS.   Ron slams the phone down several times. Suddenly Rayon enters as he finishes buttoning up his dress. RON All the MDs are fuckin' backpeddlin' on their heels.   The FDA is scaring them with license revocation if they write scripts. Rayon throws a cash filled envelope on Ron's desk. RAYON Maybe this will help. Ron looks at the cash in disbelief: two wrapped wads of hundred dollar bills, worth maybe $10,000. RON Where'd you get that? Rayon exits the room proudly. RON Did you sell your ass? RAYON (O.C.) Just a simple fuckin' thank you would do. Ron looks at the cash, shakes his head... INT. DALLAS BUYERS CLUB MOTEL - RAYON'S OFFICE - NIGHT 111A   111A  As Rayon walks into his room, Ron appears. RON Really, come on, where did you get it? A l",
      "dialogue_count": 0,
      "word_count": 735
    },
    {
      "scene_number": 17,
      "slugline": "INT. DALLAS BUYERS CLUB MOTEL - RAYON'S OFFICE - DAY 113   113  Music plays.   Rayon, extremely sick, holds a bottle of POPPERS, watches Sunny dance around the room amongst the stacked moving boxes.   Rayon starts coughing into a scarf, pulls it away, it's covered with BLOOD.   Sunny stops dancing. SUNNY You need to go to the hospital. Rayon can’t respond. SUNNY That’s it.   I’m driving you, right now. Sunny walks over and picks up Rayon, throws him over his shoulder. RAYON Okay, okay.   I’ll go.   Put me down.   Let me get some things first. Rayon picks up his bag. EXT. DR. VASS' CLINIC - MEXICO CITY - DAY 114   114  Ron enters the clinic with a suitcase. INT. DR. VASS' CLINIC - MEXICO CITY - DAY 115   115  CLOSE ON a BUTTERFLY, emerald green wings with a blood red middle.   Its wings flap with life as a hand holds it and a needle is inserted into its middle, extracting its fluids. Dr. Vass conducts the experiment with Ron looking on.   In the background, another makeshift lab. DR. VASS Secretions that the caterpillar uses to protect itself during the incubation period... Dr. Vass empties the contents of the syringe into a test-tube. DR. VASS ...act as a non-toxic anti-viral for humans.   The answer to a question. Dr. Vass sets the test-tube on a tray, crosses to a table lined with boxes, postmarks in different languages covering their surfaces.   He rummages on the table, finds a report.  Dallas Buyers Club / Green Revision / Dec 2, 2012 / P. 77",
      "characters": [],
      "action_text": "DR. VASS (handing it to Ron) The Lancet medical journal published a study conducted in France.   Proves AZT alone is too toxic for most to tolerate, and had no lasting effect on HIV blood levels.   Of course, Barrow Wilkem and the NIH did not include the study in their press release. Ron takes the study, looks it over. RON Doesn't surprise me at all. Vass hands Ron some more paperwork. DR. VASS These are early trial results for Fluconazole. RON The anti-fungal, right?   I read about this. DR. VASS You want to take some home? RON As much I can carry. DR. VASS We need a thousand more like you. RON Hell Vass, I’m just tryin’ to run a business. INT. DALLAS MERCY HOSPITAL - ICU ROOM - NIGHT 116   116  Eve walks in, breathless.   Eyes sunken, breathing shallow, Rayon is hooked up to an I.V. as Nurse Frazin adjusts an oxygen mask on his face. NURSE FRAZIN I took him off of it as you instructed. He's just on morphine now. EVE Good.   I'll be in my office.   Thanks for calling.  Dallas Buyers Club / Green Revision / Dec 2, 2012 / P. 78 She sees Sunny outside of the room, watching.   She gives him a hopeful smile and walks off. INT. DR. VASS' CLINIC - MEXICO CITY - NIGHT 117   117  Ron leaves the lab and notices an ominous green glow coming from a nearby room.   He approaches it slowly, drawn to it. INT. DR. VASS' CLINIC - MEXICO CITY - ROOM - NIGHT 118   118  As he enters, he notices hundreds of emerald green BUTTERFLIES flying in the air and hanging on the wall.   Their vibrant colors give off a luminous glow.   A butterfly lands on his hand.   He slowly raises his hand to his face for a better view.   As time goes on, more and more butterflies land on Ron’s hand and body.   Ron takes it all in.   Illuminated from the butterflies, he looks like a “Lite-Brite”. INT. DALLAS MERCY HOSPITAL - DR. EVE SAK'S OFFICE - NIGHT A119   A119  Eve wakes up, seated at her desk. INT. DALLAS MERCY HOSPITAL - ICU ROOM - NIGHT 119   119  Rayon lies alone in bed, delirious from morphine, mumbl",
      "dialogue_count": 0,
      "word_count": 2171
    },
    {
      "scene_number": 18,
      "slugline": "INT. DRADDY AUDITORIUM - DALLAS HIGH SCHOOL - DAY 131   131  The room is packed.   On the dais stands Richard Barkley from the FDA.   To his left and right, are representatives from the Center for Disease Control, the National Institute of Health and ACT-UP.   They HEAR something SQUEAKING and look up: At the back of the room, Ron enters, hooked up to an I.V. drip on wheels that he carries along as he starts passing out copies of his flyer. RON Here you go, please read this. RICHARD BARKLEY (O.S.) Mr. Woodroof, will you kindly tell us what you are doing? Everyone turns to look at Ron. RON I’m givin’ people information... on this trial I'm in, right now.   I want everyone here to know what's going on. RICHARD BARKLEY And what is going on? RON Why was Peptide T cut off?   A non-toxic drug, that I have proof works and that according to the National Institute of Mental Health, is completely safe. RICHARD BARKLEY Mr. Woodroof, you are nothing but a common drug dealer-- RON I’m a drug dealer?   You’re the drug dealer.   The pharmaceutical companies are the drug dealers. Ron grabs a bag of jelly beans out of the hands of a person in the audience.   Holds them up. RON The yellow number fives, red, green and purple dye you put in this here candy causes seven kinds a cancer. A SECURITY MAN approaches, Ron walks away from him.  Dallas Buyers Club / Green Revision / Dec 2, 2012 / P. 86",
      "characters": [],
      "action_text": "RON The aspartame in my diet coke, the steroids in my meat, the hormones in my milk, the antibiotics in the chicken. Now that’s the shit the FDA knows will kill you.   Yet you’re all up there worried that some sick people will find somethin’ without you and y’all won’t get paid. Ron throws the bag of jelly beans to the security man who catches it.   And he leaves the room, squeaking away. INT. RON'S CAR - DALLAS STREET - DAY 132   132  Ron is driving, singing out loud, a cappella. RON Oh I'm bad, I'm nationwide! INT. DALLAS MERCY HOSPITAL - CONFERENCE ROOM - DAY 133   133  Sevard puts Ron’s flyer down on the table in front of Eve who stands in front of the medical board. DR. SEVARD We think it is in everyone’s best interest that you resign. Eve looks at Dr. Sevard who meets her gaze with calculated coldness. EVE I won’t.   You'll have to fire me. She starts to leave, stops, turns around. EVE Y'all go fuck yourselves! INT. DALLAS BUYERS CLUB HOUSE - LIVING ROOM - NIGHT 134   134  Ron appears from the kitchen with a beer. RON One left. EVE We’re splitting that. Ron cracks the beer and hands her the can.  Dallas Buyers Club / Green Revision / Dec 2, 2012 / P. 87 RON That was a ballsy move! Eve looks away.   Ron opens his arms... RON A nice, warm hug... (she accepts it) ...and a day of watchin’ some bull ridin’, that’s what you need, doctor Woodroof’s order. She smiles and they both let go, uneasy with the closeness. RON Don’t you miss a regular life? EVE Regular?   What’s that?   Doesn’t exist. RON Yeah, I guess. (a beat) I just want... Ron looks at her. EVE What? He takes the can back. RON ... an ice-cold beer at Ruby’s.   Go dancin' with my woman.   I want kids... thumb wrestle with my sons.   I don’t know.   I got one life -- mine.   But I want someone else’s.   I feel I'm fighting for a life I ain't got the time to live. Ron downs some beer. RON I want it all to mean somethin’. Eve looks at Ron, studies him. EVE It does.  Dallas Buyers Club / Green Revision / Dec 2",
      "dialogue_count": 0,
      "word_count": 639
    },
    {
      "scene_number": 19,
      "slugline": "INT. EVE’S HOUSE - NIGHT 135   135  Eve looks at the painting of the Texas Wildflowers.   For some reason, she becomes emotional and decides to straighten it. INT. DALLAS BUYERS CLUB HOUSE - BATHROOM -   EARLY MORNING 136   136  CLOSE ON Ron's box of meds, almost empty.   By the look on his face, Ron clearly just woke up.   But there is something else. He takes an empty bottle of Peptide T and looks at it, confused.   Hears the strange ringing again... INT. RON'S CAR - DALLAS STREET - DAY 137   137  And that is all we hear as we see Ron driving along the street into the middle of an intersection.   Ron stops the car, puts his hands over his ears, and walks out. EXT. STREET - DALLAS - DAY 138   138  Ron tries to direct traffic, bear foot.   People blare their car horns.   Others scream out their windows.   A POLICEMAN arrives on the scene and approaches Ron. Tucker pulls up and sees Ron, he jumps out of his car. TUCKER I’ll take care of this. Tucker steps in.   He grabs Ron’s arm, makes eye contact. TUCKER Ron!   You are in the middle of the street.   Do you understand what I'm sayin'? No answer from Ron. TUCKER Come on, man, let's go home. Tucker puts a hand on Ron's shoulder and walks him towards his squad car. INT. TUCKER’S HOUSE - KITCHEN - DAY 139   139  A BLUE BOX rests on the table, next to Ron who stares at it, as he’s being given an injection of Peptide T by Tucker.  Dallas Buyers Club / Green Revision / Dec 2, 2012 / P. 89",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 275
    },
    {
      "scene_number": 20,
      "slugline": "INT. TUCKER’S HOUSE - LIVING ROOM - DAY 140   140  Tucker's father sits in a chair facing Ron. TUCKER'S FATHER Of course I remember you, trouble maker. RON I still am! They share a smile. RON I'm glad you're doin' better, sir. TUCKER I'm gonna talk with Ron a minute, pop. Tucker steps off to the side with Ron. TUCKER Listen, the FDA is gonna bust you tomorrow. Ron's wheels are turning. RON Thanks for the tip, Tuck. And as Ron exits the house... TUCKER I'll be there, man, and don't you fuckin' hit me again! EXT. DALLAS BUYERS CLUB HOUSE - DAY 141   141  A line of customers is out the door as three Dallas Police Cars pull up.   As Tucker gets out of the lead car, he is greeted by Richard Barkley and two FDA Agents.   They head inside.   That’s Ron’s POV... INT. DALLAS BUYERS CLUB HOUSE - LIVING ROOM - DAY 142   142  ...as he's watching from a window. Eve tends to several buyers club members, I.V.s attached to them, lying on the floor. A NEWS TEAM films the entire thing.  Dallas Buyers Club / Green Revision / Dec 2, 2012 / P. 90",
      "characters": [],
      "action_text": "EVE (to the reporter) This is Fluconazole.   It helps them with Thrush. Suddenly, the front door OPENS.   Police are in the room, guns drawn. RICHARD BARKLEY No one move.   Put your hands in the air. The news camera keeps rolling. TUCKER Ronald Woodroof? Ron steps up through the crowd. TUCKER I have a warrant for your arrest, a search warrant for the premises, and a court order to cease and desist business immediately. And with that, Ron allows Tucker to handcuff him.   And as he does, the Customers \"Boo\" and \"Hiss\" loudly, all caught on by the News Crew. RICHARD BARKLEY Turn off that camera.   Now! But the Camera Man doesn’t stop filming. RICHARD BARKLEY (to Ron) Please instruct the rest of these people to leave, now. RON I ain't no cop.   Why'nt you tell 'em? Tucker escorts Ron outside. EXT. DALLAS BUYERS CLUB HOUSE - DAY 143   143  The News Crew continues to film as Ron is led out past the waiting Customers, talking to the reporter. RON It’s the bust of the century!   Don’t they look like hardened criminals?!  Dallas Buyers Club / Green Revision / Dec 2, 2012 / P. 91 An ambulance pulls up.   MEN wearing MASKS and GLOVES begin to escort people off.   Barkley and his Agents watch the circus from the sidewalk.   Ron is put in the Squad Car by Tucker. INT. DALLAS POLICE STATION - HOLDING ROOM - DAY 144   144  David Wayne enters and throws a NEWSPAPER on the table in front of Ron. RON Deadly drugs?   What the fuck? DAVID WAYNE They wrote the FDA’s story. RON I can’t believe it.   I tipped those assholes off. DAVID WAYNE Don't worry.   I got good news.   I got you a change of venue for the Peptide T trial in San Francisco. And no surprise, they're not pressing charges. DAVID WAYNE Then what the fuck am I doin' here? DAVID WAYNE They're trying to break you, I don't know.   Let's get out of here. They leave. RON (to himself) They'll never break me. EXT. COURTHOUSE - SAN FRANCISCO 145   145  We see Ron's reflection in the window of a cab that moves out of the way as Ron s",
      "dialogue_count": 0,
      "word_count": 861
    },
    {
      "scene_number": 21,
      "slugline": "INT. DALLAS BUYERS CLUB HOUSE - LIVING ROOM - DAY 147   147  Ron, still looking sick, opens the door and is startled by a crowd of people clapping and cheering. RON Jesus Mother Mary Fucking Christ! Among the crowd, Ron spots Eve and David Wayne with a smile of victory on their faces.   Ron doesn't understand.   They walk to him and show him a paper with the FDA logo on it. Black. Super:  Following the trial, the FDA in Washington allowed Ron to get Peptide T for his own personal use.  And as the cheering and clapping grow bigger, we cut to: EXT. RODEO - DAY 148   148  Ron, 20 pounds heavier, looking healthier, is sitting atop the railing above the stall looking down at the bull.   He's got on gloves, hat, pants, and boots, ready to ride.   He removes a flask from his pocket and takes a long swig.   The BULLHAND and Ron exchange a look.   Ron nods, takes a deep breath, swings his legs over the railing, straddles the stall, stays above the animal.   The moment Ron’s ass hits the leather, the gate is up, the bull is out, and the crowd whoops it up. Rodeo contestant number “43” Ron Woodroof rides the bull, his hands, legs and heels all working together.   His “off” hand is held out above him, cutting the air for balance. The bull makes an abrupt change of direction, catches Ron off guard and just when it seems that he’s about to be thrown in the air, we hear Eve screaming her guts out as the image freezes on a PERFECT FRAME on this cowboy in action to control the beast. The crowd’s CHEERS are echoing in the distance, blended with the soft strange ring that we know, that only Ron could hear. And as we zoom in on the image: FADE TO BLACK.  Ronald Woodroof died on September 12, 1992, seven years after he was diagnosed with the HIV virus.   He managed to stay alive using unapproved drugs and was memorialized by 1000 gay men in Dallas, Texas.  Dallas Buyers Club / Green Revision / Dec 2, 2012 / P. 93",
      "characters": [],
      "action_text": "FADE OUT. Fluconazole and Alpha Interferon are now FDA approved. DDC was approved in 1992 but is no longer used due to its highly toxic effects. Peptide T remains unapproved but still in studies for neurological diseases, like Alzheimer. Today, it is had been scientifically proven that HIV is the cause of AIDS.   Based on this knowledge, great strides have been made in treating this infection with anti-HIV medications but a cure has yet to be discovered. The first studies with AZT as a single drug (monotherapy) while showing initial good results did not ultimately prove to be a long term solution for HIV treatment. By 1996, medical researchers learned that HIV is best treated with a combination cocktail of at least three HIV medications. AZT was frequently used as a part of these early combination therapies.   Today, AZT has been largely replaced by safer, new HIV medications.   *  Dallas Buyers Club / Green Revision / Dec 2, 2012 / P. 93A-95",
      "dialogue_count": 0,
      "word_count": 521
    }
  ]
}