{
  "slug": "darkest-hour-2017",
  "title": "darkest hour",
  "genre": "drama",
  "format": "film",
  "scenes_count": 9,
  "characters_count": 0,
  "characters": [],
  "total_words": 16798,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. PALACE ENTRANCE - DAY  A grand hall. Winston removing his hat and coat, hands his cane and gloves, then hat to a LIVERIED DOORMAN whilst a LIVERIED STAFF MEMBER waits nearby. WINSTON The only time I tried to ride the Underground was during the General Strike. Clemmie dropped me at South Kensington station. I went down-- but I got lost and came straight back up. Awful!  (girding himself)  Well, “Here we go”... EVANS Good luck sir. WINSTON strides away, following the EQUERRY.  INT. STATE CHAMBERS/ BUCKINGHAM PALACE - DAY  KING GEORGE VI   (agitated, troubled)   speaks with the ill, weak, outgoing PRIME-MINISTER NEVILLE CHAMBERLAIN. CHAMBERLAIN watches the KING. GEORGE VI Why not Halifax? I favour Halifax. CHAMBERLAIN I wanted Halifax. The Lords wanted Halifax. Halifax wanted Halifax. GEORGE VI Then--then why have I been forced to send for Churchill? CHAMBERLAIN Because he’s the only member of our party who has the support of the Opposition. GEORGE VI His record is a litany of catastrophe. Gallipoli, 25,000 dead. The India Policy. Russian Civil War. The Gold Standard. The the the Abdication. And now this Norway ‘adventure’. What, eighteen hundred men?  14.",
      "characters": [],
      "action_text": "CHAMBERLAIN One aircraft carrier, two cruisers, seven destroyers and a submarine. GEORGE VI Winston lacks judgement. CHAMBERLAIN He was right about Hitler. GEORGE VI Even a stopped clock is right twice a day. EQUERRY enters. EQUERRY First Lord of the Admiralty, Mr Winston Churchill! GEORGE VI Early. CHAMBERLAIN Keen. GEORGE VI I accept your resignation--but I want you to know--how--cruelly I think you’ve been treated. CHAMBERLAIN Thank you Your Majesty. He and GEORGE shake hands. EQUERRY This way, my Lord. The KING waits - SIGHS deeply, until... We hear footsteps approaching. WINSTON enters. WINSTON Your Majesty. GEORGE VI Mr Churchill. GEORGE VI (CONT’D) I believe you know why I--I I have asked you here today. WINSTON Sir, I simply can’t imagine why.  15. GEORGE VI It is my duty to-to-to invite you to take up - the position of of Prime Minister of this United Kingdom. Will you form a government? WINSTON I will. GEORGE VI Very well. WINSTON bows, and when the KING offers his hand, WINSTON kisses it. WINSTON rises. GEORGE VI (CONT’D) That was--quite easy. WINSTON Yes. They stare at each other in uneasy silence. WINSTON (CONT’D) I believe we are to meet regularly. GEORGE VI Once a week, I’m afraid. How are you on--on--on Mondays? WINSTON I shall endeavour to be available on Mondays. GEORGE VI Four o’clock? WINSTON  (resolutely)  I nap at 4. GEORGE VI Is that--permissible? WINSTON No. But necessary. I work late. GEORGE VI Then perhaps lunch? WINSTON Lunch! Mondays.  (WINSTON bows)  Your majesty. GEORGE VI Prime Minister.  16. When WINSTON backs out of the room, the KING anxiously lights a cigarette, and broods.  EXT. 10 DOWNING STREET - DAY  WINSTON pulls up in his PRIVATE CAR, alights, (followed by EVANS) waves at the PRESS, an effortless SELF-PUBLICIST, at total ease in the spotlight. Ever the showman - taps the NUMBER 10 on the famous front door with his walking stick for the amusement of the PHOTOGRAPHERS - PHOTOGRAPHER Prime Minister? First order of business, sir?",
      "dialogue_count": 0,
      "word_count": 1205
    },
    {
      "scene_number": 2,
      "slugline": "INT. CLOCK TOWER - DAY  BIG BEN strikes the hour - 3 PM.  INT. COMMONS/ PARLIAMENT - DAY  To the sound of the distant BELLS,   WINSTON enters, with EDEN, and small knuckle-knocking on woodwork, mainly from the LABOUR benches. WINSTON looks around, not actually surprised at the contemptuous reception. WINSTON  (to EDEN)  Contempt. Well, you have to start somewhere. In the LORDS GALLERY, above, HALIFAX enters and looks down at proceedings, and on - WINSTON, looking at his FOB-WATCH. The HUBBUB dies down and WINSTON puts on his GLASSES. SIR SAMUEL HOARE  (whispered, to SIMON)  Here we go. WINSTON reaches into his waistcoat for his TYPED SPEECH, then delivers his MAIDEN SPEECH as PRIME MINISTER... WINSTON Mr Speaker. On Friday evening last-- I received His Majesty’s commission to form a new administration... ANGLE ON: CONSERVATIVE MP’s, all looking worried. WINSTON (CONT’D) ...It was the evident wish and will of Parliament, and the Nation, that this should be conceived on the broadest possible basis, and that it should include all parties.  INT. BEDROOM / 10 DOWNING STREET - DAY  CLOSE ON: TYPED PAGE (with TEXT) being rapidly tugged from a TYPEWRITER CARRIAGE (to a LOUD explosive ratchet-whirr)!!! CUT TO: WINSTON (O.S.) A War Cabinet has been convened...  21.",
      "characters": [],
      "action_text": "CLOSE ON: TYPE-WRITER keys typing...” A War Cabinet has been convened”   - WIDE: ELIZABETH TYPES, as WINSTON dictates - WINSTON (CONT’D) Correction - “has been   formed”   - ELIZABETH adjusts the PATEN, then types -   “formed”   above  “convened”   -  INT. COMMONS/ PARLIAMENT - DAY  WINSTON - has been formed--of five members -  INT. BEDROOM/ 10 DOWNING STREET - DAY  WINSTON ...representing, with the Opposition parties, the unity of the Nation. CUT TO: CLOSE ON: A FRESHLY TYPED PAGE (ROUGH DRAFT) is set down on the desk by ELIZABETH’s hand. The stationary bears the Prime Minister’s monogram, and we see typed TEXT plus several phrases struck out (between parentheses). The CAMERA moves in on the paragraph that reads...  “The three party Leaders have agreed to serve, either in the War Cabinet, or in ( positions of authority* ) high executive office.”   (* denotes struck through phrase)  ELIZABETH (O.S.) The three party Leaders have agreed to serve, either in the War Cabinet-  INT. COMMONS/ PARLIAMENT - DAY  ELIZABETH (O.S.) - or in high executive office. WINSTON - or in high executive office. WINSTON (CONT’D) The three fighting Services have been filled.  INT. HALLWAY/ 10 DOWNING STREET - DAY  OUTSIDE the BATHROOM DOOR - ELIZABETH LAYTON waits, with a PAD and PAPER, taking down his dictation...  22. WINSTON Sawyers is she there? ELIZABETH Yes she is.. I mean, I am WINSTON (O.S.) Don’t come in! SOUNDS of him taking a BATH, the SPONGE being squeezed over his head...She starts to move away, but is arrested by - WINSTON (O.S.) (CONT’D) Don’t go away! ELIZABETH LAYTON No, no--I’m still here. WINSTON (O.S.) “With this agreement, I now invite the House -  (water sounds)  - by the resolution which stands in my name, to record its approval, and to declare its confidence in the new government.” Sound of WINSTON getting out of the BATH. WINSTON (O.S.) (CONT’D) Miss? I’m coming out in a state of nature! ELIZABETH LAYTON flees, as the DOOR opens and as WINSTON (naked) looks up and d",
      "dialogue_count": 0,
      "word_count": 2729
    },
    {
      "scene_number": 3,
      "slugline": "INT. PARLIAMENTARY LIBRARY - DAY  SIR JOHN SIMON and LORD LONDONDERRY walk and talk along the libary gallery - SIR JOHN SIMON He’s an actor. In love with the sound of his own voice. LONDONDERRY Oh I love to listen to him--but we must never take his advice. Has a hundred ideas a day. Four are good, the other 96 downright dangerous. SIR JOHN SIMON His father was a great orator but... LONDONDERRY Until he lost his mind to syphilis - SIR JOHN SIMON How nations suffer for the sins of their fathers. Across the AISLE, STANHOPE is also talking about CHURCHILL with SIR SAMUEL HOARE - STANHOPE My opinion? At this critical juncture for the empire, we have a drunkard at the wheel. SIR SAMUEL HOARE Wakes with a scotch, bottle of champagne at lunch, another at dinner, brandy and port till the wee hours...I wouldn’t let him borrow my bicycle!  INT. TREASURY TOILETS - DAY  KINGSLEY WOOD is talking to a COLLEAGUE - KINGSLEY WOOD He’s a Conservative, who defects to the Liberals--lobs grenades at us for 10 years--then flops Conservative again, as it bloody suits him! Sorry, but--he stands for one thing: himself!  34.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 198
    },
    {
      "scene_number": 4,
      "slugline": "INT. CHAPEL - DAY  HALIFAX is sitting with KING GEORGE VI. HALIFAX We might have to replace him, Bertie. KING GEORGE VI Replace him?! HALIFAX We must strive for peace--for every son and daughter of this land so that we may emerge from this crisis with something recognisable as 'home.' KING GEORGE VI Spoken like a true Prime Minister.  INT. KITCHEN/ 10 DOWNING STREET - DAY  YELLOW POWDERED EGGS are being MIXED with WATER, then fried then slopped onto a plate as SCRAMBLED EGGS. On a BREAKFAST TRAY (once more)are set - (in rapid cuts) BACON and POWDERED EGGS, SCOTCH and SODA, a GLASS of WINE... CAPTION :   SUNDAY, MAY 19, 1940 INT. DRESSING ROOM/BEDROOM/ 10 DOWNING STREET - DAY  JOHN EVANS stands outside the LOO (whose door is closed), with a note-pad and pen, ready to record WINSTON’s instructions. JOHN EVANS Sir, you need to reply to the Lord Privy Seal.  INT. LOO/ 10 DOWNING STREET - DAY  WINSTON sits on the TOILET, reading a French newspaper whose front page shows a picture of FRENCH SOLDIER with his arm around his FRENCH SWEETHEART, holding up his fingers in a V- FOR-VICTORY gesture (palm-outward). The headline is “ V POUR LA VICTOIRE ”. Winston is sitting on the toilet. WINSTON The Privy Seal? JOHN EVANS Yes sir?  35.",
      "characters": [],
      "action_text": "WINSTON  (reading)  “ V for Victory ” WINSTON closes the newspaper, stands - WINSTON (CONT’D) Tell the Lord Privy Seal -  INT. DRESSING ROOM/BEDROOM/ 10 DOWNING STREET - DAY  WINSTON (O.S.) - tell him I’m sealed in the Privy - We hear a flush and then WINSTON appears, wearing his pink silk dressing-gown. WINSTON (CONT’D) - and I can only deal with one shit at a time! He goes into the bedroom, followed by EVANS, where we find - ELIZABETH LAYTON, typing at the nearby desk, and - ANTHONY EDEN, seated in a chair beside the bed, reading WINSTON’S TYPED SPEECH... WINSTON (CONT’D) Don’t spare me, Anthony--be frank. EDEN Mmmmm. As EDEN reads, WINSTON stares at him, awaiting his reaction. WINSTON  (to EDEN)  I think it’s rather good. The ending especially. When EDEN says nothing the wait becomes agonizing.   EDEN finishes reading the speech, turns over the last page to see if there is more on the back. There isn’t. WINSTON waits for the verdict. EDEN takes off his glasses slowly and looks up at a hopeful WINSTON - EDEN I don’t think so. WINSTON You don’t think so,   what ?  36. EDEN You’re suggesting we’re--somehow--  winning .  (beat)  We’re not. WINSTON No but...it will inspire them. WINSTON (CONT'D) You don’t understand -   EDEN Winston, I know - WINSTON  (stubbornly)  - no, no, no. I am going to imbue them, Anthony, with a spirit of feeling they don’t yet know they have! Silence. Stalemate. EDEN looks gravely concerned. EDEN You asked my opinion. I caution against it. WINSTON stares at his trusted ally, his hopes fading, until - he snaps his finger, pointing at EDEN - WINSTON Cicero! He’s on the move again - heading out of the bedroom, with EVANS and LAYTON, and finally EDEN, forced to follow...  INT. HALLWAY/ 10 DOWNING STREET - DAY  WINSTON “ Live as “, “ Live as brave men ” - da,da,da - “ and if fortune is adverse, something, something, something  He then enters the -  INT. LIBRARY/ 10 DOWNING STREET - DAY  WINSTON  (shouting)  CLEMMIE!!!   CAT!!!   CLEMMIE!!! As he l",
      "dialogue_count": 0,
      "word_count": 904
    },
    {
      "scene_number": 5,
      "slugline": "INT. WINSTON’S OFFICE/ WAR ROOMS - NIGHT  WINSTON sitting on his bed, is AGITATED, UNEASY, UNSURE now about the speech he is to deliver on RADIO. ELIZABETH LAYTON sits at a desk in the corner holding files and paperwork. Two MICROPHONES sit on a table. An ACTOR also stands by. The Producer guides Winston to his desk. BBC PRODUCER So--if you will sit here - at your desk WINSTON Mmmmm. WINSTON sits, studying with CONCERN the SPEECH lying on the table in front of him, and taking out his PEN. BBC PRODUCER - and speak slowly and clearly. Into the microphone. WINSTON starts to jot last-minute CHANGES to the SPEECH. Increasingly PRESSURISED, he CROSSES OUT the CHANGES he just made, and tries to write alternatives. He’s clearly in a state. BBC PRODUCER (CONT’D) So--if you are ready--on the stroke of 9 the light will go red, and we shall go live to the nation. Nine O Clock. Red light. You begin. Yes? But WINSTON   isn’t   ready. He’s too busy trying to rewrite his speech The SWEEP SECOND HAND on the WALL CLOCK approaches 12. The PRODUCER, and ELIZABETH, become very concerned now as the last seconds vanish - BBC PRODUCER (CONT’D) Prime Minister? Are we ready? WINSTON  (to himself)  One moment, one moment - BBC PRODUCER We are going live.   Prime - WINSTON  (exploding)  I SAID ONE MOMENT, DAMN YOU!  40.",
      "characters": [],
      "action_text": "This eruption stuns the PRODUCER and ELIZABETH. WINSTON’s hand, holding the PEN, shakes now with indecision as he fails to think of the right words in time - BBC PRODUCER Four--three--two--one... On the stroke of 9 pm, the light goes RED, bathing him in red light. They are LIVE. SILENCE. TOTAL SILENCE. The PRODUCER is now in a panic. WINSTON seems frozen for a second, until - WINSTON takes a breath and begins... WINSTON “I speak to you for the first time as Prime Minister in a solemn hour for the life of our country, of our Empire, of our allies, and, above all, of the cause of Freedom. A tremendous battle is raging in France and Flanders.” ELIZABETH sighs relief, then follows on her carbon copy, mouthing the words, many of which she knows by heart. CAMERA follows the WIRES that lead out of the office, down the corridor, and into the TRANSMITTER ROOM. Reveal BBC Radio Recorder men.  INT. BUCKINGHAM PALACE - NIGHT  CLOSE ON: A RADIO. PULL BACK to reveal: The KING, looking up from the PAPER, as he listens to WINSTON’s speech on the radio, and studies his FRAMED FAMILY PHOTOS of his CHILDREN...Princesses ELIZABETH and MARGARET. WINSTON (O.S.)  “The Germans...by a remarkable combination of air bombing and heavily armored tanks, have broken through the French defenses north of the Maginot Line, and strong columns of their armoured vehicles are ravaging the open country...”  CLOSE ON:   NEWSPAPER - the HEADLINE reads:  IN CONTROL, SAY FRENCH   Despite Nazi Raid  41.",
      "dialogue_count": 0,
      "word_count": 485
    },
    {
      "scene_number": 6,
      "slugline": "INT. FOREIGN OFFICE - NIGHT  HALIFAX sits at the table, a minister standing behind him as they listen to Winston’s radio address WINSTON (O.S.)  “...which for the first day or two was without defenders...But!...I have invincible confidence in the French Army and its leaders. Only a very small part of that splendid Army has yet been heavily engaged; and only a very small part of France has yet been invaded...Side by side, the British and French peoples--have advanced...”  HALIFAX is disgusted by this DISTORTION of the facts. HALIFAX “ Advanced” ?! How bloody dare he!  EXT. FRENCH BATTLEFIELD - EVENING  AERIAL SHOT OF: the BRITISH and FRENCH armies in retreat - leaving behind SMOKING TRUCKS and ABANDONED ARTILLERY. TRACKING OVER this ravaged landscape, we see- CUT TO: - the abstracted landscape of a human CORPSE... WINSTON (O.S.)  “...the British and French peoples-- have advanced--to rescue not only Europe, but mankind from the foulest and most soul-destroying tyranny which has ever darkened and stained the pages of history . ...until an EYE is revealed in CLOSE-UP, staring into CAMERA.  INT. WINSTON’S OFFICE/ WAR ROOMS - NIGHT  CLOSE-UP ON: the RED RECORDING LIGHT. WINSTON “But now one bond unites us all - to wage war until victory is won, and never to surrender ourselves to servitude and shame, whatever the cost and the agony may be...Conquer we must, as conquer we shall.” CLOSE-UP ON: WINSTON’s FACE...  42.",
      "characters": [],
      "action_text": "ELIZABETH LAYTON Well done, sir. WINSTON sits back - UNHAPPY. CLOSE-UP ON: the RED RECORDING LIGHT goes off. The BROADCAST is over.  INT. LIBRARY/ NUMBER 10 DOWNING STREET - NIGHT  CLEMMIE turns off the RADIO, concerned.  INT. CORRIDORS - WAR ROOMS - NIGHT  WINSTON, UNHAPPY, walks up to a DOOR, enters it -  INT. TUNNEL/ BENEATH 10 DOWNING STREET - NIGHT  - then walks down the long tunnel (connecting the WAR ROOMS with DOWNING STREET) until, at its end, he enters an ELEVATOR-  INT. ELEVATOR/ 10 DOWNING STREET - NIGHT  - WINSTON rides the ELEVATOR upward -  INT. MAIN HALLWAY/ 10 DOWNING STREET - NIGHT  - WINSTON exits the ELEVATOR, and begins to climb the stairs -  INT. LIVING ROOM/ 10 DOWNING STREET - NIGHT  CLEMMIE You did marvelously. WINSTON For the last ten years I was the only one who told them the truth. Until tonight. There’s no advance. It’s a shambles. We’re in full retreat. CLEMMIE Would you be serving them tonight by denying them sleep, terrifying their children? WINSTON Even if the terror is coming?! CLEMMIE  Because   it’s coming! There is time enough for truth.  43. He nods, accepting this. He walks off, still anxious. She watches him go, worried.  INT. KITCHEN/ WAR ROOM - DAY  The front page of a newspaper: a PHOTO of WINSTON doing his V FOR VICTORY SIGN (palm inward). ELIZABETH LAYTON, leaning by the door, reading the paper. At her side stands another typist, SYBIL, reading another copy of the same PAPER - ELIZABETH is giggling - WINSTON passes the doorway in the corridor, then re-appears - WINSTON What’s so funny? ELIZABETH Prime Minister sir - WINSTON Go on. What is it?  INT. CORRIDORS - WAR ROOMS - DAY  ELIZABETH steps out into the corridor so they can have some privacy - ELIZABETH Not sure if you know this but-- the way you are doing your  V For Victory   sign--well, in the poorer quarters that gesture means--something else. WINSTON What does it mean? ELIZABETH Wouldn’t like to say sir. WINSTON I was captured by the Boer. I spent time in a South A",
      "dialogue_count": 0,
      "word_count": 4893
    },
    {
      "scene_number": 7,
      "slugline": "INT. WINSTON’S STUDY / 10 DOWNING STREET - NIGHT  ECU ON: A MILITARY DISPATCH, that reads:  CALAIS FALLEN. NUMBERS OF DEAD OR CAPTURED UNCERTAIN. GENERAL GORT.  Across the room, WINSTON is at his desk, immobile, nursing a glass of whiskey and soda, as, - - CLEMMIE enters - and looks at him, with concern. CLEMMIE  (worried)  Go to bed, Pig. He gives no reply - CLEMMIE (CONT’D) You must sleep. WINSTON Leave me, Clemmie. CLEMMIE The opportunity for doing so passed a long time ago. She gets an idea, and exits urgently, leaving him alone.  INT. OFFICE/ 10 DOWNING STREET - MORNING  WINSTON, in his SILK ROBE, still sits at his desk. The curtains are drawn. It’s MORNING. He walks to a TELEPHONE and dials - ADMIRAL RAMSAY. WINSTON Bertie--what’s been the response?  EXT. BATTLEMENTS/ DOVER CASTLE - DAY  ANGLE ON: 5 SMALL CRAFT, arriving at DOVER - a packet boat, a yacht, a fishing boat, a skiff... ANGLE ON: RAMSAY, talking into a FIELD TELEPHONE, watching from atop DOVER CASTLE. ADMIRAL RAMSAY It will take time. It’s too soon to judge. WINSTON How many boats so far? ADMIRAL RAMSAY It will take time.  67.",
      "characters": [],
      "action_text": "WINSTON The request for civilian boats was not a   request , Bertie. It was an order! In frustration, WINSTON slams down the PHONE, as - - SAWYERS, the VALET, enters and draws the curtains. As LIGHT floods the room-- CAPTION:   MONDAY, MAY 27, 1940 EXT. 10 DOWNING STREET - DAY  A CROWD of ON-LOOKERS are gathered there, as - - WINSTON, emerges to get into a GOVERNMENT CAR. He is angst- ridden now, gives the (POLITE)   V-FOR-VICTORY   SIGN, (PALM-OUT) but his heart isn’t in it. Hunch-backed, his eyes downcast, he gets in his GOVERNMENT CAR.  INT. BUCKINGHAM PALACE - DAY  WINSTON and the KING at lunch at a DINING TABLE. WINSTON eats heartily. The KING, with little appetite, smokes, watches WINSTON wash down the food with hearty gulp of champagne. GEORGE VI  (pours drinks)  How do you manage drinking during the day? WINSTON Practice. After another silence - GEORGE VI I have been asked--if plans should be drawn--to evacuate my f-family and I--to Canada. I wish to know the opinion of our prime minister. WINSTON My opinion? My opinion would be that you must do what you feel is right for yourself, your family, and for the country. Your survival is paramount. Prime Ministers--we seem to come and go at an astonishing rate. GEORGE VI Your--p-position in parliament, I hear, is not strong.  68. WINSTON My party resents how Chamberlain was pushed aside. And many others doubt me. I was not a popular choice. The KING nods - he himself resented WINSTON - and he turns away briefly, in embarrassment. WINSTON (CONT’D) They want Halifax still. But why get rid of the organ grinder and replace him with the monkey. GEORGE VI Lord Halifax is a close personal friend of mine! WINSTON I am unwanted.   I’ve never been trusted since the Gallipoli campaign. Unwanted. GEORGE VI Perhaps--it is because--you scare people. WINSTON Who?! GEORGE VI You scare me. WINSTON  (scarily)  What?! What nonsense! What could be scary about me? GEORGE VI One never knows what is going to come out of your mouth next.",
      "dialogue_count": 0,
      "word_count": 1427
    },
    {
      "scene_number": 8,
      "slugline": "EXT. TREASURY DRUM - DAY  HIGH WIDE-SHOT as WINSTON walks through the TREASURY DRUM toward DOWNING STREET. MILES ALDRIDGE, a lone photographer calls out - MILES ALDRIDGE Mr. Churchill! One picture, one picture, come on sir, one picture! How about a smile, Prime Minister? WINSTON steps toward him, and then DELIBERATELY gives the RUDE VERSION of the V-FOR-VICTORY sign (PALM-INWARD). Winston walks on.  INT. BATHROOM/ TREASURY - DAY  CHAMBERLAIN, alone, steadies himself against a wall - his health is fading. He takes out his bottle of MORPHINE and drinks.  INT/EXT. BUCKINGHAM PALACE - NIGHT  KING GEORGE walks out on to a BALCONY and looks down the MALL in BLACKOUT, as his EQUERRY joins him... GEORGE VI I was--ju--just imagining never standing--here again. Perhaps because I am no longer alive, or-- or because the palace itself-- is gone. EQUERRY Canada. You must decide, sir. You could rule in exile. GEORGE VI Truly? Is that my fate?  (pause)  You know what? I feel angry. In this moment I’m aware of feeling-- bloody angry. The EQUERRY studies him, as he studies the MALL.  INT. ELIZABETH’S “SHOE-BOX” ROOM/   WAR ROOMS - NIGHT  ELIZABETH LAYTON waits, her fingers at the ready. She sneaks a glance at the CLOCK on her DESK - it is   1.30 ! WINSTON is in a BLACK MOOD. He struggles to DICTATE a SPEECH...  74.",
      "characters": [],
      "action_text": "WINSTON I have...come to...to wonder...in... recent days...whether it was...my duty... ECU of: the TYPEWRITER hammers typing   “duty”   - WINSTON (CONT’D) - to consider... EVANS enters, carrying a TRAY holding a glass and a bottle. Elizabeth yawns. WINSTON (CONT’D) ...consider...entering... EVANS is standing there staring at WINSTON, waiting to knock off for the night. WINSTON notices - JOHN EVANS Will that be all for tonight, sir? WINSTON ignores him. WINSTON ...entering into negotiations with...  (unable to speak the dreaded name)  ...that...corporal...no... EVANS departs without an answer, as - WINSTON pours himself a SCOTCH and mumbles to himself - WINSTON (CONT’D) ...gangster--no--tyrant... ...monster of wickedness, no... WINSTON, wanting more inspiration, turns over a NEWSPAPER and on the COVER is - a LARGE PHOTO of ADOLPH HITLER. WINSTON looks at HITLER’S FACE with LOATHING - WINSTON (CONT’D) ...butcher--no good--monstrous savage?--bloodthirsty guttersnipe!--  housepainter ...  (throws newspaper on the ground)  HOUSEPAINTER!  (his head clears)  Where were we? Where - ? WINSTON, hearing no sound of typing, turns - and sees ELIZABETH LAYTON staring at her TYPEWRITER, frozen - WINSTON (CONT’D) Well?  75. ELIZABETH  (softly)  I didn’t understand you, sir. He doesn’t reply. She finally adds - ELIZABETH (CONT’D) You were - WINSTON Were? ELIZABETH You were - mumbling. WINSTON Mumbling. ELIZABETH Yes sir. WINSTON, crosses to the other side of her and sits down -he picks up a FRAMED PHOTO of A HANDSOME YOUNG SOLDIER from her desk. WINSTON Your beau? ELIZABETH maintains her composure with true grit during the following exchange - ELIZABETH My brother. WINSTON Where is he now? ELIZABETH He was falling back on Dunkirk but he never made it. This rocks WINSTON to the core. He studies ELIZABETH, stirred by the beauty of her sad face. ELIZABETH (CONT’D) What? His eyes moisten - at all she represents, innocence and loss and courage and purity. WINSTON I’m just looking at you.",
      "dialogue_count": 0,
      "word_count": 4328
    },
    {
      "scene_number": 9,
      "slugline": "INT. BUCKINGHAM PALACE - DAY  The KING smokes as he listens to the same broadcast.  INT. HOUSE OF COMMONS CHAMBER - DAY  WINSTON - if necessary for years, if necessary alone. At any rate, that is what we are going to try to do. That is the resolve of His Majesty's Government – every man of them. That is the will of Parliament and the nation. The British Empire and the French Republic, linked together in their cause and in their need, will defend to the death their native soil, aiding each other like good comrades to the utmost of their strength. ANGLE ON: ELIZABETH, who is “mouthing” these words, some of which she already knows by heart - WINSTON (CONT’D) Even though large tracts of Europe and many old and famous States have fallen or may fall into the grip of the Gestapo and all the odious apparatus of Nazi rule, we shall not flag or fail. We shall go on to the end. We shall fight in France--we shall fight on the seas and oceans, we shall fight with growing confidence and growing strength in the air, we shall defend our island - whatever the cost may be. We shall fight on the beaches, we shall fight on the landing grounds, we shall fight in the fields and in the streets, we shall fight in the hills; We shall never surrender, and if, which I do not for a moment believe, this island or a large part of it were subjugated and starving, then our Empire beyond the seas, armed and guarded by the British Fleet, would carry on the struggle, until, in God's good time, the New World, with all its power and might, steps forth to the rescue and the liberation of the old!  95.",
      "characters": [],
      "action_text": "The LABOUR BENCHES begin to wave their papers in the air and call their approval, (it is against Parliamentary etiquette to ever clap in the House of Commons). WINSTON’S children bang their hands on the woodwork. WINSTON’s CONSERVATIVE colleagues all look to CHAMBERLAIN. CLOSE ON: HALIFAX, looking down from the GALLERY at CHAMBERLAIN, closes his eyes, knowing what is coming next - -   CHAMBERLAIN TAKES OUT HIS WHITE HANDKERCHIEF, and tamps his forehead with it.   It’s enough.   The CONSERVATIVE FACTION, ignited, rises to their feet in THUNDEROUS SUPPORT of WINSTON. REACTION HALIFAX: Defeat. WINSTON turns to ANTHONY EDEN, registering surprise at the strength of support, and winks - EDEN grins and SHAKES his FRIEND’s HAND. EDEN Changed your mind? WINSTON Those who never change their mind never change anything. The UPROAR in the HOUSE continues, those in the gallery begin to throw their parliamentary papers into the air which then rain down into the chamber. STANHOPE What just happened? HALIFAX He just mobilized the English language--and sent it into battle. Every man is on his feet waving their parliamentary papers and throwing them into the air, shouting and stamping. Smiling with due deference WINSTON takes up his things and walks down the central aisle of the house as papers continue to rain down from the gallery like ticker tape or confetti. As the GREAT DOORS of the COMMONS close behind him - the screen becomes BLACK. Up with END CAPTIONS:  96. ALMOST ALL OF THE 300,000 TROOPS AT DUNKIRK WERE CARRIED HOME BY WINSTON'S CIVILIAN FLEET NEVILLE CHAMBERLAIN DIED SIX MONTHS LATER VISCOUNT HALIFAX WAS SOON REMOVED BY WINSTON FROM THE WAR CABINET AND SENT TO WASHINGTON ON MAY 8, FIVE YEARS LATER, BRITAIN AND ITS ALLIES WOULD DECLARE VICTORY WITHIN WEEKS OF VICTORY, CHURCHILL AND HIS PARTY WERE VOTED OUT OF OFFICE BY THE BRITISH PEOPLE. \"SUCCESS IS NOT FINAL, FAILURE IS NOT FATAL: IT IS THE COURAGE TO CONTINUE THAT COUNTS.\" WINSTON CHURCHILL  Roll End Credits.  97.",
      "dialogue_count": 0,
      "word_count": 629
    }
  ]
}