{
  "slug": "dave-101-the-gander-2020",
  "title": "dave 101 the gander",
  "genre": "romance",
  "format": "series",
  "scenes_count": 2,
  "characters_count": 0,
  "characters": [],
  "total_words": 8005,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. UROLOGIST’S OFFICE, LOS ANGELES - MORNING DAVE, a 27-year-old Jewish rapper, sits in a urologist’s office alone. He pulls out his phone, but as he reaches for it, the wax paper on the seat RIPS. He sighs, then looks at his phone at a google search page “is oral herpes on your genitals considered genital herpes?” DR. MEKELBURG, a mid-fifties white male urologist, walks in. DR. MEKELBURG Hello there! I’m Dr. Mekelburg, what brings you in today? Dave sighs deeply. DAVE Hi. So, a few days ago, I noticed these red bumps on my pubic bone. DR. MEKELBURG Pubic bone? DAVE Yeah, like where your pubic hair would be, I shave mine to the bone. DR. MEKELBURG Okay...Well how about we take a look. Dave sighs again, even deeper. DAVE Okay, I’ll show you, but before I do, and I know this is absurd, but I have to explain my penis to you. DR. MEKELBURG Sorry? DAVE I was born with a fucked up dick. Dr. Mekelburg listens intently. DAVE (CONT’D) I came out of the womb with a tangled urethra and they had to go in and surgically repair it, so there’s a lot of scarring. I used to have these things that looked like poppy seeds on it that I got removed. And then also...I assume you know what hapispadius is?",
      "characters": [],
      "action_text": "DR. MEKELBURG Hapispadius? The mislocated meatus? DAVE Mislocated meatus? The pee-hole is in the wrong place, is that - DR. MEKELBURG Yes, meatus/pee-hole, all the same. You say tomato, I say tomahto. DAVE I hate when people use that expression, I’m sorry, but it’s definitely tomato, who says tomahto? Only the misinformed. But anyways, my meatus is totally... like, off center. DR. MEKELBURG Okay, understood. Why don’t we - DAVE And then ON TOP OF THAT, you know how the skin on your testicles is different than the skin on your penis? Like it’s more ribbed? DR. MEKELBURG ...Yes... DAVE So my theory is, when they did all of these operations on me as a baby, they had to replace the skin on my penis...and when I look at my dick now, it’s actually ribbed the way my testicles are...So I’m pretty sure that they used testicle skin to replace my mangled penis skin...which would mean that my dick is actually MADE of balls. Dr. Mekelburg can’t help but laugh out loud. Dave is shocked that he would laugh at such a thing as a professional. DR. MEKELBURG Sorry, why don’t we take a look. Dave stands up as Dr. Mekelburg crouches down. 2. DAVE Also, I’m a public figure...I’m actually a rapper, I just put out my first video and it’s getting a ton of traction. I know there’s Dr./Patient confidentiality, but I really think I’m gonna the next “it guy” in America... Dr. Mekelburg, who is one his knees, looks up quizzically. DAVE (CONT’D) So I guess I’d love it if you could take it one step further and promise me this info never reaches the general public. My own girlfriend doesn’t even know about this stuff because I’m so good at controlling the lighting. DR. MEKELBURG There’s nothing higher than Dr./Patient confidentiality, I’m legally bound to keep this to myself. DAVE Okay. Well then, I’m putting my penis in your hands, doc. Dave pulls his shorts down and reveals his penis to Dr. Mekelburg, whose head covers it as he looks. DR. MEKELBURG Okay. Not concerned at all, that’s razor bumps. ",
      "dialogue_count": 0,
      "word_count": 6408
    },
    {
      "scene_number": 2,
      "slugline": "EXT. STUDIO PARKING LOT - NIGHT Gata smokes a cigarette outside. Dave gestures at his 2002 Toyota Avalon which is behind a Bentley in the parking lot. DAVE He can get out right? GATA Fa sho, and it’s 21’s car, you’ll be with him all night anyways. Dave looks at his phone. A text comes through from Elz reading “nah I ain’t there tonight”. DAVE Fuck, I wish Elz was working. GATA You got Gata! We just gotta feel it out bro. He probably got bitches in there, he probably pourin’ up, whoopdee whoop, we just gotta read the situation. Apply the gander. DAVE I just want you to know, if I was black, I would have the exact same hairstyle as you. It’s very sleek. GATA You a fool. Gata puts out the cigarette and they walk inside. INT. STUDIO A - NIGHT Dave walks into the studio, and there’s a lot of people drinking and smoking. A pit-bull runs up and jumps on Dave. DAVE (scared) Whoa there! Those that are paying attention look at Dave in confusion. DAVE (CONT’D) Hi, is Nutti here? Nutti walks up. NUTTI Lil Dicky, what up bro. 32.",
      "characters": [],
      "action_text": "Dave’s noticeably afraid of the dog. NUTTI (CONT’D) Balmain! Get down.   Try to control your fear, he can smell fear. DAVE Control my fear? I don’t know how, I probably reek of fear. 21 SAVAGE Balmain! The dog scurries over to 21 Savage. GATA Damn, even the dog is Balmain, that’s hard as fuck. NUTTI (to Gata ) What you doin’ here? We already got the syrup from Bino. GATA Huh? Oh I was just out here, seein’ what y’all got goin on, tryna - NUTTI Nah, you gotta go bro. ‘Rell firmly guides Gata out the door. Dave watches him go, terrified, realizing he’s been taking advice from someone they have no respect for. Now Dave is all alone. NUTTI (CONT’D) I hate being around broke niggas. Makes me nervous. Dave nervously laughs and sees a bag of cash and a few guns in the corner. DAVE Oh my, look at all that caysh. Wow, and all that weaponry. There’s nothing like, to be concerned about is there? Is something afoot? NUTTI Nahhh, just gotta stay ready. DAVE (scared) Totally. 33. Nutti walks Dave over to 21 Savage, who is pouring lean into a cup, therefore unable to properly shake Dave’s hand. NUTTI 21, this Lil Dicky. 21 SAVAGE (focused on pouring) Whassup wit it. DAVE Hey man, great to meet you. Dave stands awkwardly, unsure of what he should do next. DAVE (CONT’D) Love that dog...pit-bull right? 21 Savage doesn’t respond, as he’s in his own world. Dave looks over to a COOL BLACK CHICK sitting and smoking. DAVE (CONT’D) Do you know if it’s hypoallergenic? COOL BLACK CHICK (gives weird look) That’s Balmain. DAVE Oh okay. So Mr. Savage, I don’t know what Nutti has communicated to you, but I’ve got this song for us - 21 SAVAGE (ignoring Dave) Ay turn that shit up ‘Rell. 21’s music BLASTS, and we dissolve to... LATER THAT NIGHT - 3:39 AM. People are getting more and more fucked up. 21 Savage is playing his own music and dancing. It’s a very cool scene. Dave sits in the corner, looking at his phone anxiously. 21 SAVAGE (CONT’D) Ay you could fuck a bitch to this type of shit. DAVE Pr",
      "dialogue_count": 0,
      "word_count": 1597
    }
  ]
}