{
  "slug": "deadwood-104-here-was-a-man-2004",
  "title": "deadwood 104 here was a man",
  "genre": "thriller",
  "format": "series",
  "scenes_count": 4,
  "characters_count": 2,
  "characters": [
    "BURNS",
    "JANE"
  ],
  "total_words": 6023,
  "total_dialogue": 2,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. BELLA UNION - DAY  Cochran's with Tolliver and Joanie Stubbs somewhere on the  main floor. Tolliver's looking to build the relationship on a  broad base of bullshit --  TOLLIVER  I'm sure you don't need me  explaining, place like outs, a Doc  in frequent attendance can sow the  seeds of doubt.  COCHRAN  All depends on your standards of  hygiene.  TOLLIVER  Oh we want 'em shiny, make no  mistake --  COCHRAN  There's a wide range of normal.  Stubbs cuts through it --  STUBBS  Friday and Saturday morning and a  midweek day of your choice'd be  right for us.  Cochran appreciates her directness --  COCHRAN  I can work that out.  TOLLIVER  What does Swearengen pay for a  visit?  COCHRAN  Twenty dollars per routine call,  all girls in.  TOLLIVER  And what's his idea of routine? --  once every three or four months?  Cochran just stares at him --  STUBBS  Lubricants.  Whereas he likes her --  COCHRAN  Armed and ready Madam.  17.  (CONTINUED)",
      "characters": [
        "BURNS"
      ],
      "action_text": "Cochran goes, passing a just-entered gambler in a black frock  coat, maybe fifty, whose attire's the worst for the trail;  that it's not better dusted off, particularly as the gambler  seems to value an impression of focus and intention, suggests  some defect in his concentration or energy. The gambler,  CRAMED, carries his own valise; his portmanteau's deposited  by some just-hired idler, whom while visibly thinking of more  important things, he politely tips a dollar --  CRAMED  Thanks very much.  Tolliver approaches him as a stranger, greets him affably --  TOLLIVER  Howdy.  CRAMED  (a busy man)  Howdy yourself -- are you the  operator?  TOLLIVER  Cy Tolliver.  CRAMED  Name's Cramed. I'd like a room, I'd  like exclusive use of a safe, and  I'd like to shoot some dice.  TOLLIVER  And I'd like to think this is the  first day of a long friendship Mr.  Cramed -- we'll get you a room and  if you'll step into my office we'll  meet your needs for a safe. Help  you with your luggage?  CRAMED  Suitcase can go to the room.  TOLLIVER  I expect you'll keep the valise.  CRAMED  Keep what you expect to yourself  and you'll improve our chances at  that friendship.  Which has taken them out of public hearing --  TOLLIVER  Young man.  CRAMED  How are you Cy. Did some nice job  with this place.  18.  CONTINUED:  (CONTINUED) Tolliver indicates the just-arrived Sawyer --  TOLLIVER  Eddie's work.  JOANIE (O.S.)  Hey Andy.  CRAMED  Hello Sweetheart.  Which is the first of his greetings Cramed has seemed to  utter with genuine pleasure. He wipes his mouth, looks back  to Tolliver --  CRAMED (CONT’D)  Let's go, let's get something  working.  SAWYER  We could rob Cy.  Tolliver laughs --  TOLLIVER  (to Cramed)  How about a bath first and a nap  and some sex with an unfamiliar  woman.  CRAMED  Sure.  SAWYER  Signal when ready Commander.  Cramed's banter has sounded forced. He starts out, looks to  Sawyer --  CRAMED  If I didn't make my point I would  like to get something fucking  working.",
      "dialogue_count": 1,
      "word_count": 2965
    },
    {
      "scene_number": 2,
      "slugline": "EXT. MAIN STREET - BULLOCK AND STAR HARDWARE - DAY  Hickok, Bullock and Star inside the partly constructed  building --  BULLOCK  I don't know this camp. I'd have to  bring someone from Montana.  STAR  Would the widow give it that much  time?  HICKOK  (nods)  She don't want to be stupid or  fooled, wants to stand up for her  husband better'n he did for  himself. Not that she ought to  stick around.  BULLOCK  'Far as that goes she could sign a  proxy.  HICKOK  There's her hundred in it and what  the saloon-keeper gave me if you'd  want to take it on.  BULLOCK  All right.  Hickok understands Bullock's agreement is a gesture of  respect to him. He gives Bullock Alma's hundred dollars and  Swearengen's hundred and fifty --  HICKOK  I guess she's all right 'til the  saloon-keep decides I'm not  trustworthy.  STAR  Trust ain't his long suit -- she  ought to be looking for a wagon.  Off which --  CUT TO:  INT. THE GEM - SALOON - DAY  Trixie and Dority. Ellsworth drinking in the corner. Dority's  miserable --  DORITY  I like Ellsworth too.  33.  (CONTINUED)",
      "characters": [
        "JANE"
      ],
      "action_text": "TRIXIE  There's a difference between  talking a lot, which Ellsworth does  enjoy, and overstepping.  DORITY  He don't get into other people's  business.  TRIXIE  Then what are we talking about Dan?  DORITY  My own standards on who's reliable  ain't the same as Al's.  TRIXIE  So Ellsworth has to leave camp over  the difference?  DORITY  He does if it's that or kill him.  He said to tell him if those were  the choices.  TRIXIE  Don't you do it.  DORITY  Which?  TRIXIE  Either.  Dority rises, moves away. Off Trixie, at the table --  NEW ANGLE - FARNUM AND SWEARENGEN  Swearengen's gaze is murderous, fixed --  SWEARENGEN  Asks a bribe to do something he  never intends. Takes my hundred  fifty, then tells her not to sell.  FARNUM  Why are you so sure he told her not  to Al?  SWEARENGEN  You went back there. You knocked on  her door.  34.  CONTINUED:  (CONTINUED) FARNUM  She said he reported to her his  conversation with you but she  wasn't prepared yet to give me an  answer.  SWEARENGEN  Does that make sense to you? That  she'd hire Hickok to come talk to  me, he'd go back and tell her to  sell, and then she'd say she wasn't  ready to make up her mind?  (wipes his mouth)  That idiot couldn't put one in his  ear.  FARNUM  If you're talking about Tom Mason,  I'd say that's water under the  bridge.  SWEARENGEN  And I'd say Hickok has to die if I  have to kill him myself.  FARNUM  Jesus Al. Jesus. With all that's  going on? How would it sit with the  widow, for one thing. How would  that dispose her toward us?  SWEARENGEN  Let me pose you a question E.B.,  you fucking cunt. If someone comes  at you, what're you supposed to do  about it?  Farnum marshals all his minimal nerve --  FARNUM  And I'll pose you a question back,  Al Swearengen. If a friend or at  least a professional colleague has  a mistaken impression of who's  coming at him and who isn't,  what're you supposed to do then?  The frightened screech with which Farnum concludes, first  emitted by the common ancestor of",
      "dialogue_count": 1,
      "word_count": 2603
    },
    {
      "scene_number": 3,
      "slugline": "INT. NUTTALL'S NUMBER TEN - DAY  McCall enters Nuttall's. If Hickok senses his approach, he  gives no sign. McCall reaches the poker table, produces his  pistol and shoots Hickok in the back of the head --  MCCALL  Take that goddamn you!  McCall trains the weapon on the others in the saloon, moving  toward the back door; then he flees --  CUT TO:  INT. BELLA UNION - ROOM NUMBER EIGHT - SAME TIME  As Joanie stands in the corner, gaze averted. Pustulating  sores area raised on Cramed's face. With his eyes open, he  hallucinates some horror short of what is overtaking him --  CUT TO:  EXT. ALLEY BEHIND NUTTALL'S NUMBER TEN - DAY  McCall runs toward a saddled horse he intends to steal, jumps  to mount; the saddle is loose, and he brings it down upon him  as he falls to the mud. Of those who've pursued him from the  saloon, Nuttall is first to reach McCall, who, trapped  beneath the saddle, feels in the mud for the pistol he's  dropped; Nuttall grabs the weapon, yanks the saddle off  McCall, punches him once in the face as he brings him to his  feet --  EXT. BULLOCK AND STAR'S HARDWARE - DAY  Bullock and Star look in the direction of Nuttall's outside  which a commotion has begun; as moves toward them --  INT. GRAND CENTRAL HOTEL - ALMA'S ROOM - DAY  Jane has come beside Alma, watches with her this beginning of  focused activity on the street. Jane's eyes show some  premonitory sense of doom. She nods to Alma, indicating the  child, as she moves toward the door --  CUT TO:  INT. THE GEM - SWEARENGEN'S BEDROOM - DAY  As part of the slow, post-coital resumption of vigilance his  soul-sickness demands, Swearengen's wandered to the window,  sees Nuttall and the others from the Number Ten bring McCall  from the alley onto the street --  47.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 314
    },
    {
      "scene_number": 4,
      "slugline": "EXT. MAIN STREET - DAY  Bullock sees this too. He's already covered half the distance  from the hardware store. He's close enough to recognize  McCall --  ANOTHER ANGLE - JANE  comes running out of the Grand Central, past Farnum, who  stands on the porch of his hotel, content to be no closer.  Jane rushes up to the group who restrain McCall --  JANE  What happened?  STAPLETON  He shot Wild Bill Hickok.  Off her --  INT. NUTTALL'S NUMBER TEN - DAY  Into which Bullock has been drawn by his Marshall's intuition  or some deeper fate. He approaches Hickok, slumped dead on  the table, blood pooling from the mortal wound in his head.  An after-death spasm shifts the body's balance; Hickok falls  to the floor. As Jane appears at the entrance to the bar,  Bullock kneels beside Hickok --  FADE OUT.  48.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 141
    }
  ]
}