{
  "slug": "deadpool-2016",
  "title": "deadpool",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 8,
  "characters_count": 0,
  "characters": [],
  "total_words": 25552,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT.   FREEWAY OVERPASS - DAY 5   5 DEADPOOL sits on the edge of the highest freeway on the overpass, legs dangling over the side like Huck Finn. DEADPOOL Can I get some fries with that shake- shake boobie?   If looks could kill you would be an uzi. Deadpool is using some broken CRAYONS to draw something on a scrap of paper.   REVERSE ANGLE to REVEAL a childish drawing of Deadpool SHOOTING another man in the head, brains blowing out. The victim’s thought bubble reads:   ‘OUCHIE!!!’   Even through the mask, Deadpool looks pleased by this. He turns to CAMERA: DEADPOOL (CONT’D) Oh, hello, Deadpool here.   You may be wondering whose balls I had to fondle to get my own movie.   Rhymes with ‘Polverine.’   Couple’a smooth criminals. (ALT:) In a word, gorgeous. (ALT:) Surprisingly little hair down there. (ALT:) It’s a jungle down there. (ALT:) Thick underbrush. (beat) Anyway, I smell Oscar.   The suit’s gonna match the carpet.   Now... places to be... faces to fix... bad guys to kill... ANGLE ON a distant BIRD’S EYE VIEW of the freeway interchange:   an interwoven tangle of ramps. EXT. REMOTE AIRFIELD - MORNING 6   6 AJAX, 30’s, dead-blue eyes, broad shoulders, whip-smart, tightly coiled stands at ease on a cracked and blistered tarmac.   Behind him, a HEAVILY ARMED CONVOY OF DUCATIS and ESCALADES.   FOUR LARGE ALUMINUM CARGO CRATES sit beside him. Ajax squints   into the sun as A BELL HELICOPTER thrashes the air above him, kicking up dust as it lands. (CONTINUED)  Deadpool   Final Shooting Script   11/16/15   5.",
      "characters": [],
      "action_text": "A SERBIAN WARLORD, mid-50’s, sharply dressed, armored BRIEFCASE in hand, climbs out.   He is surrounded by ARMED GUARDS. The Warlord places the BRIEFCASE on the FOREMOST CRATE.   Ajax pops the case...   to find STACKS upon STACKS of THOUSAND DOLLAR BILLS.   Satisfied, he closes the briefcase   and hands it to one of his men.  AJAX (bangs crate) They won’t disappoint. WARLORD They’d better not.   And next month’s shipment? AJAX There won’t be one.   Demand is high.   You aren’t the only one with a war to win. WARLORD (steps forward) That won’t do. Both sets of armed thugs shift to ready positions. Ajax smiles calmly, but his free hand DARTS OUT and CASUALLY LIFTS the warlord into the air by the THROAT.   Fingers find triggers on both sides. AJAX There’s been a small... disruption in our supply chain.   We’ll deliver in full the following month.   Say, ten percent off for the inconvenience? The Warlord manages to nod in acquiescence.   Ajax smiles again, lowers him gasping to the ground. AJAX (CONT’D) We appreciate your business. Ajax spins and walks purposefully toward the line of waiting SUV’s. The warlord angrily motions for his men to begin loading the crates into the helicopter, which they do. WARLORD (sotto voce) Fucking mutant. CONTINUED: 6   6 (CONTINUED)  Deadpool   Final Shooting Script   11/16/15   6. Behind him the convoy of SUV’s and motorcycles pull out, falling into line as they accelerate past the rows of derelict aircraft. EXT.   FREEWAY OVERPASS - DAY 7   7 DEADPOOL watches as the convoy approaches.   He CASUALLY gets up as if standing up out of an easy chair... DEADPOOL On your mark, get set, go, let me go, let me shoop... He PIROUETTES, and DROPS an entire level DOWN... INT. ESCALADE - MORNING 8   8 THROUGH the SUNROOF of an ESCALADE.   SMASH! There are FOUR HUGE BAD-ASSES inside the S.U.V., two in front, two behind.   Deadpool lands back-middle in a HAILSTORM of GLASS.   He stuns the men to both sides with elbows to the face as he raises his arms ",
      "dialogue_count": 0,
      "word_count": 8047
    },
    {
      "scene_number": 2,
      "slugline": "INT.   SISTER’S MARGARET’S - NIGHT - PAST 23A   23A WADE dead-man-walks to the back of the bar.   He passes BOOTHE and BEEF on his way.   They nod solemnly, like cops at a funeral procession honoring one of their own. BEEF Wade. Beef offers Wade his shot.   Wade eeks out a smile.   Throws it back.   Then continues on.   Wade stops next to the MAN’s TABLE. WADE Forget your scythe? The man, even creepier from close up, SMILES. RECRUITER Mr. Wilson.   Have a seat. (Wade sits, long pause) I understand you’ve recently been diagnosed with terminal cancer. WADE Stalker alert. RECRUITER It’s my job.   Recruitment.   And you have quite a reputation.   I’m sorry you’ve had a tough go.   But you’re a fighter.   And not just for Johnny Canuck, impressive as your stint in special forces was.   Forty- one confirmed kills? WADE (bitter) One every seven weeks.   Same rate most folks get a hair-cut. Wade grabs the recruiter’s drink and throws it back. WADE (CONT’D) To wash the taste out.   It’s hard to forget being so... impressive .  RECRUITER Now you spend your days sticking up for the little man, slitting small time throats for small time folks.  WADE People change. (CONTINUED)  Deadpool   Final Shooting Script   11/16/15   42.",
      "characters": [],
      "action_text": "The recruiter leans uncomfortably close. RECRUITER (low, conspiratorial) Speaking of which... Mr. Wilson, I represent an organization that may be able to help.   What if I told you we can cure your cancer?   And what’s more, give you abilities most men only dream of? WADE I’d say you sound like an infomercial. And not a good infomercial, like Slap Chop.   More Shake-Weighty. (jack-off motion) RECRUITER The world needs extraordinary men.   We won’t just make you better.   We’ll make you better than better.   A super-hero. WADE I already tried the hero business.   Let’s just say it left a mark.   The only chance you’ll see me again is if I hit ‘fuck- it.’ EXT./INT.   GUADALAJARAN CLINIC WAITING ROOM - DAY - PAST 24   24 A DILAPIDATED, SKETCHY MEDICAL ‘CLINIC’ haunts the cityscape in GUADALAJARA, MEXICO.  WADE (V.O.) For now, I’ll get through this with the one I love.  A   sickly-looking WADE is on the final stop in his futile quest to find a cure.   DESPERATE.   Among the MOST DESPERATE. He sits in a pathetic muzak-filled WAITING ROOM.   Wearing a SOMBRERO and clutching VANESSA’s hand.   Her fingers are interlaced in his, once perfectly manicured nails chewed to the quick. Vanessa is also wearing a SOMBRERO, and ANXIETY on her face. Wade COUGHS SEVERELY, REPEATEDLY into a HANDKERCHIEF. Wade turns to the sweet ELDERLY COUPLE sitting next to him, ekes out a smile.   The old man plays with some WORRY BEADS. CONTINUED: 23A   23A (CONTINUED)  Deadpool   Final Shooting Script   11/16/15   43. WADE (pulls out Spanish-English electronic translator) De donde eres? ELDERLY WOMAN Boca Raton. WADE Ah.   The fancy part of Mexico. ELDERLY MAN We’ve moved in with my son.   To afford the treatment. Wade looks pained to hear this. WADE Cancer?   Sorry - ¿El Cáncer? ELDERLY MAN Stage four. WADE Toughest part of the Tour de France. VANESSA Very hilly. The elderly man gestures to the souvenir PATCHES sewn onto Wade’s ‘HELLO KITTY’ DUFFEL:   CHECHNYA.   CHINA.   INDONESIA. ELDERLY MAN Log",
      "dialogue_count": 0,
      "word_count": 838
    },
    {
      "scene_number": 3,
      "slugline": "INT.   OPERATING ROOM - DAY - PAST 25   25 ABE lies shirtless on an UNSANITARY operating table, a tray of RUSTY surgical KNIVES nearby. A MAN with a pock-marked face stands over him in a white lab coat with blue-stitched cursive writing:   ‘Dr. Delgado.’ DOCTOR Buenos días, Señor Abe. ‘Doctor’ Delgado pokes and prods with his fingers, as if Abe’s mid-section is Play-Doh. DOCTOR (CONT’D) Voy a llegar dentro de tu cuerpo. ABE I’m sorry.   No hablo español, doc. The doctor’s other hand dips below the table, comes up dripping with something bloody.   He kneeds at wrinkled skin smearing the CHICKEN BLOOD across Abe’s flesh. DOCTOR De que se cure!   Señor Abe, you are cured. The doctor holds SMELLING SALTS under Abe’s nose.   His closed eyes jerk open to see the doctor’s gloved hand CLUTCHING a huge, bloody ‘TUMOR.’ Abe pushes himself up, peers down at his bloody abdomen with awe.   The doctor wipes the blood away and helps him up. ABE (tearing up) Thank you.   I owe you my life. As Abe shuffles out, the doctor turns away to dump the ‘tumor’ in the trash and wash his bloody hands in a basin. DOCTOR (over his shoulder) ¡Proximo!   Next! WADE (O.S.) Already here, hombre. Dr. Delgado nearly JUMPS at the sight of WADE, already standing in the OPEN DOOR of the room, looking DANGEROUS. (CONTINUED)  Deadpool   Final Shooting Script   11/16/15   46.",
      "characters": [],
      "action_text": "DOCTOR So sorry, you surprise me.   How... long... you standing there, Señor? Wade walks slowly TOWARD the doctor, who steps out nervously from BEHIND his table.   The two stand face-to-face.   Wade smiles... angles his foot UNDER the OPERATING TABLE... ...and uses it to SLIDE something out from underneath the table:   a BUCKET of BLOODY CHICKEN GIZZARDS that double as removed ‘tumors.’   Wade’s RAGE seems to grow by the INSTANT. WADE Long enough...  Delgado   senses he is suddenly in danger, picks up a rusty  SCALPEL   from his tray.   Wade moves toward him.   Delgado LUNGES, He STABS WADE in the shoulder, then RUNS. Wade TACKLES him.   In Wade’s weakened state, the fight becomes an intense STRUGGLE.   The two FALL and WRESTLE.   The BUCKET of GIZZARDS   overturns.   They roll around in slop. The doctor squirms out of Wade’s grasp and crawls into the hallway.   Wade wriggles after him, tugging at his ankle. INT.   WAITING ROOM / HALLWAY - SUNSET - PAST 26   26 The MUZAC still plays.   VANESSA smiles warmly/sadly at the little BOY, who is unwrapping his CHUPACHUP. Suddenly... a SCREAM and cries for help in Spanish.   The NURSE and an ALARMED VANESSA rush toward the shouting. INT.   HALLWAY - SUNSET - PAST 27   27 At last, WADE’s fury has overcome his physical weakness.   He straddles the DOCTOR’s CHEST.   His expression is that of a man who’s LOSING his SHIT. Wade RAISES THE SCALPEL,   SLASHES at the doctor’s throat, then STABS him in the heart.   The doctor writhes, spasms, gurgles, and falls still. Chest heaving, Wade raises his head to see... at the FAR END of the HALL: VANESSA - frozen, TERRIFIED.   A blood-soaked Wade locks eyes with her and swims back up into SANITY... ‘What have I done?’ This is a horrific glimpse into Wade’s murderous past... ...and the look on Vanessa’s face is one of HORROR and PAIN. CONTINUED: 25   25 (CONTINUED)  Deadpool   Final Shooting Script   11/16/15   47. Awash in shame, Wade staggers to his feet, slips on chicken blood, and LUNGE",
      "dialogue_count": 0,
      "word_count": 1791
    },
    {
      "scene_number": 4,
      "slugline": "INT.   WORKSHOP - NIGHT/DAY - MONTAGE - PAST 32   32 A MONTAGE of Wade’s treatments in the Workshop, set to the notes of JOHN DENVER’s inspirational classic, ‘I WANT TO LIVE.’   Juxtaposed with HARROWING VIGNETTES of Angel Dust and AJAX experimenting on WADE... ...as he GASPS, CLAWS, SCREAMS BLOODY MURDER. Wade is DUNKED into thick, molasses-like LIQUID.   PULLED and YANKED, POKED and PRODDED by contraptions that would have shamed the Spanish Inquisition. SAWED.   COMPRESSED.   SLICED.   DICED.   SLAP-CHOPPED.   BLED. LONG SYRINGES PLUNGE DEEP INTO SOFT TISSUE. SCALPELS MAKE LONG INCISIONS. ENDOSCOPIC CAMERAS TRAVEL THROUGH THE BODY, REVEALING THE DIRTY WORK OF INVASIVE SURGICAL EQUIPMENT. STAPLE-GUNS DRIVE STAPLES INTO SLICED SKIN TO PULL IT BACK TOGETHER. MINIATURE CIRCULAR SAWS SLICE THROUGH BONE. IV’s PULL FLUIDS FROM THE BODY AND INSERT OTHER FLUIDS IN.  JOHN DENVER I want to share what I can give.   I want to be... I want to live!  We also see SHORT, ULTRA-FAST MINI-MONTAGES of medical instruments, implying the PASSAGE of TIME. INT.   WORKSHOP - MONTAGE - NIGHT 32AA   32AA Over images of: INJECTION: AJAX (V.O.) The serum I’m injecting you with targets any mutant genes lurking in your DNA. TORTURE: AJAX (V.O.) Adrenaline acts as a catalyst for the serum, so we must subject you to extreme stress. (CONTINUED)  Deadpool   Final Shooting Script   11/16/15   53.",
      "characters": [],
      "action_text": "AJAX (V.O.) If you’re lucky, the mutant genes will activate and manifest in spectacular fashion. AJAX (V.O.) If not, we’ll have no choice but to keep hurting you in new and different ways. Each more painful than the last. INT.   WORKSHOP - DAY 32AA   32AA AJAX Until you finally mutate.   Or die. INT.   WORKSHOP - WADE’S TENT   /   WORM’S TENT - NIGHT 33   33 At last, Wade is laid back down on his table, only now in QUIET DARKNESS, MEEK, WITHOUT ANY RESISTANCE whatever. CUNNINGHAM (O.S.) Puppies. In the tent NEXT to Wade, CUNNINGHAM   holds up his FIST to the fabric.   Wade can see it through the cloth in SILHOUETTE. CUNNINGHAM (CONT’D) It helps picturing puppies. Wade gives Cunningham a KNUCKLE BUMP through the fabric. WADE Puppies. CUNNINGHAM Or kittens.   If you swing that way. WADE (chuckles) I swing both ways. Wade swallows hard, grows serious: WADE (CONT’D) But me, I’ve been making a list of things I still plan to do. CUNNINGHAM A bucket list? CONTINUED: 32AA   32AA (CONTINUED)  Deadpool   Final Shooting Script   11/16/15   54. WADE I prefer fuck-it list:   Naked tandem base- jumping with the WNBA’s Sacramento Monarchs... Sparking up a spliff with the Olympic torch... CUNNINGHAM Finishing my Lego Millenium Falcon... WADE Giving Meredith Baxter Birney a dutch oven... CUNNINGHAM Making my kids banana pancakes... AJAX (O.S.) With the mouse ears?   Creative, and delicious. AJAX and ANGEL DUST enter CUNNINGHAM’s tent and begin prepping him for a fresh round of torture. AJAX (CONT’D) It’s OK, I encourage distractions.   Can’t have you giving up on us, can we now, you little worm? Suddenly, a VOICE calls out from the adjacent tent: WADE (O.S.) Don’t take that shit, Cunningham!   How tough can he be?   Name like Francis. Ajax is very subtly SURPRISED.   WHAT did Wade just say?   WADE is still strapped down inside.   Talking nice and LOUD: WADE (CONT’D) That’s right!   He got ‘Ajax’ off a dish- washing liquid! (laughs from nearby tents) Legal name’s Francis.   F-R-A-N-C",
      "dialogue_count": 0,
      "word_count": 7787
    },
    {
      "scene_number": 5,
      "slugline": "INT.   ‘NO. 5 ORANGE’ STRIP CLUB - NIGHT 52   52 WEASEL Or as I like to call her, Irony! DEADPOOL navigates through a TIGHTLY-PACKED CROWD toward the MAIN STAGE, accompanied by WEASEL. DEADPOOL We gotta find her fast.   Before fuck-ass. WEASEL How do you even know she’s here? DEADPOOL I come for the French Onion Soup. How do you think?   I’m constantly stalking that fox. Deadpool STOPS in his tracks, STARING.  DEADPOOL (V.O.) Every time I see her is like the first time.  REVERSE ANGLE to reveal what Deadpool is looking at:   the gorgeous backside of a COCKTAIL WAITRESS in a skimpy dress. Back to Deadpool:  DEADPOOL (V.O.) Even from this angle.   Especially from this angle.  Hypnotized, Deadpool puts one foot in front of the other, approaching the waitress. Suddenly, the WAITRESS TURNS to reveal her face:   VANESSA. Deadpool immediately CHICKENS OUT, puts his head down, turns away from her into the press of MEN around one of the stages. Vanessa catches the vaguest glimpse, but before she can get a better look, Deadpool is swallowed up by the crowd. She gets that warm shiver again... the one that says she’s feeling an old presence. She stares after Deadpool.   It couldn’t possibly be. Deadpool pushes past the men, almost in a panic, beating a HASTY RETREAT toward WEASEL at the back of the room. (CONTINUED)  Deadpool   Final Shooting Script   11/16/15   87.",
      "characters": [],
      "action_text": "DEADPOOL (V.O.) Shittiest moment numero tres.  Deadpool walks past Weasel, fleeing into the men’s room... INT.   MEN’S REST ROOM - CONTINUOUS 53   53 ...and SPLASH!   Washes his face at the SINK. DEADPOOL Lezzdothis.   Before I re-reconsider. Maximum effort. A hand comes into frame offering a paper towel.   It belongs to a WASHROOM ATTENDANT in a tuxedo vest.   Deadpool uses the towel to wipe his face and finishes with the attendant’s sleeve. DEADPOOL (CONT’D) Sorry. (tries to dry attendant’s sleeve with paper towel) I get very uncomfortable around you guys. (takes mint off counter, then condom off counter, then sees tip jar) Crisp high five? INT.   ‘NO. 5 ORANGE’ STRIP CLUB - NIGHT 54   54 VANESSA sets down a tray of empty glasses.   Her scum-bag   of a MANAGER gives her a heads-up: MANAGER Someone out back asking for you.   Said somethin’ about an old boyfriend? EXT.   ‘NO. 5 ORANGE’ STRIP CLUB - ALLEY - NIGHT 55   55 VANESSA exits the club into an ALLEY, one of Wade’s old jackets thrown over her shoulders.   One sickly street lamp casts some light.   The rest is obscured in SHADOW.   Vanessa spies the shape of a MAN hiding in the shadows. VANESSA I knew it was you. Vanessa is seized by memories.   She peers into the dark, heart pounding. VANESSA (CONT’D) With the weird, curvy edges. CONTINUED: 52   52 (CONTINUED)  Deadpool   Final Shooting Script   11/16/15   88. Then steps forward slowly, nervously.   Overcome with emotion. VANESSA (CONT’D) (barely audible) Like a jigsaw puzzle. No one answers.   Vanessa gets a bad feeling and starts to back up. The man steps confidently into the light.   Not WADE... ...but AJAX.   Vanessa spins around and runs straight into Angel Dust, who step out of the shadows. Vanessa make a grab for her purse, contents spilling out onto the grimy street, but her hand comes up with a TASER.   She jams it into the flesh of Angel Dusts shoulder. Angel Dust just smiles as electricity arcs and sizzles.   Then she grabs Vanessa’s hand and twists",
      "dialogue_count": 0,
      "word_count": 1167
    },
    {
      "scene_number": 6,
      "slugline": "INT.   DEADPOOL’S LAIR - DAWN 60   60 WEASEL and DEADPOOL are going through IKEA drawers, pulling out every GUN and GRENADE on God’s green earth and stuffing them into a couple of Deadpool’s ‘I *HEART* HELLO KITTY’ DUFFEL BAGS. This is Deadpool’s ARSENAL, big enough for a small army.   In go the twin DESERT EAGLES.   Then Weasel dumps an entire ARMFUL of AMMO BOXES into the duffel. WEASEL That’s about... three thousand shells. A BEAT.   Deadpool LOOKS AT CAMERA menacingly: DEADPOOL And we’ve all seen what I can do with twelve. BLIND AL enters, holding a STEYR AUG RIFLE. BLIND AL I was gonna spend tonight assembling the Borgsjo, but this is holding my interest. Both Deadpool and Weasel duck, afraid she might shoot them. DEADPOOL Careful, Ronnie Milsap, we’re down-range! And we decided on the Orrberg, not the Borgsjo. BLIND AL Shit. WEASEL She cool? DEADPOOL The coolest.   Plus, she could never pick you out of a line-up. BEEP-BEEP.   DEADPOOL looks at his phone.   The screen says, “Vanessa’s Phone” DEADPOOL (CONT’D) It’s Francis.   He wants me to come to him.   And he calls me a piece of- (squints, can’t read) (CONTINUED)  Deadpool   Final Shooting Script   11/16/15   92.",
      "characters": [],
      "action_text": "WEASEL (points) That’s the shit emoji.   A turd with a smile, see?   How did Google ever approve that? Blind Al grabs a Nerf N-Strike Elite Strong-arm Blaster from a drawer (it feels like a gun!) and goes to put it in the duffel.   Deadpool almost stops her, then shrugs - maybe it will come in useful... BLIND AL That’s every piece in the house. DEADPOOL Uh-uh-uh. Blind Al sighs - busted - she puts her leg up on a chair and pulls a tiny Saturday Night Special from an ankle holster... and is about to hand it over when instead, she turns, and... ...BOOM... shoots the ROOMBA, laying waste to it. BLIND AL It was him or me. (beat) I did hit it, right? DEADPOOL Please.   It’s been years since you’ve hit anything.   See what I did there? BLIND AL Fuck you. Deadpool takes the tiny gun and shoves it in the small of his back.   Then follows Weasel out the door.   Then quickly turns back. DEADPOOL (to Al) In case I never see you again, I love you very much... and there’s a hundred-ten million dollars buried somewhere in the apartment.   Good luck.   Watch your face. Deadpool slams the door behind him. INT./EXT.   TAXI - MORNING 61   61 A TAXI drives across the city, its BACK BUMPER scraping the ground, throwing off SPARKS. CONTINUED: 60   60 (CONTINUED)  Deadpool   Final Shooting Script   11/16/15   93. In the PASSENGER seat:   DEADPOOL, his DUFFEL at his feet. Behind the wheel:   DOPINDER. DEADPOOL Any luck winning Gita back? DOPINDER I tried to hold on tight, Mr. Pool.   But Bandhu is more craftier - and handsomer - than me. DEADPOOL (shrugs) It’s all relative. Deadpool quickly LIFTS his MASK, revealing his SCARS to Dopinder. STARTLED, Dopinder FLINCHES and SIDESWIPES a PARKED CAR. COLOSSUS (O.S.) Stop the car.   I must leave a note. Cut to the BACK SEAT to find COLOSSUS CRAMMED in, KNEES to CHEST.   He’s drinking a CAPPUCCINO in a Dunkin’ Donuts cup. DEADPOOL Oh, please.   I’ll bet the halls of your high school were very well monitored. DOPINDER I cannot be stopping. NEGASON",
      "dialogue_count": 0,
      "word_count": 5448
    },
    {
      "scene_number": 7,
      "slugline": "INT.   NEW WORKSHOP - DAY 74   74  DEADPOOL (V.O.) ..will be so much easier if you do.  We find ourselves in a newer, spiffier version of the WORKSHOP, where a LAB TECHNICIAN is strapping down a new sickly VOLUNTEER/VICTIM.  DEADPOOL (V.O.) Which brings us to shittiest moment number 1!   The guy behind the guy, Dr. Killebrew, off scot-free.  A SILHOUETTED FIGURE approaches the bed of the nervous volunteer, who smiles weakly. VOLUNTEER Can you make me better? REVERSE ANGLE to reveal whom he’s talking to:   the PUDGY, KINDLY-LOOKING DOCTOR WHO STROKED WADE’S HEAD IN THE WORKSHOP.   He smiles, pats the volunteer’s wrist. DR. KILLEBREW Better than better.  DEADPOOL (V.O.) But let’s look on the bright side. (sniffs) You smell what I smell?   I mean besides stale popcorn and my post-fight man-funk?  Dr. Killebrew holds up a syringe with a glint in his eye.  DEADPOOL (V.O.) Sequel.   Maybe even one of those ensemble team movies...  EXT.   SCRAPYARD - RUBBLE PILE - DAY 75   75 DEADPOOL and Vanessa MAKE OUT LIKE CRAZY, LONG AND HARD.   We slowly PULL BACK until they look SMALL against the toppled hulk of the COMBAT CARRIER.  DEADPOOL (V.O.) So, ‘til next time, this is your friendly neighborhood pool guy saying... I’m never gonna dance again... the way I danced with you.  WHAM BELTS OUT ‘CARELESS WHISPER’ as we ROLL CREDITS.  Deadpool   Final Shooting Script   11/16/15   116.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 230
    },
    {
      "scene_number": 8,
      "slugline": "INT.   SUBURBAN HOME - DAY - POST CREDIT SEQUENCE V76   V76 A hallway of a suburban home.   DEADPOOL enters in a maroon and gray striped robe.  DEADPOOL (short version) You’re still here?   It’s over!   Go home. Wait... you expected a tease for Deadpool 2?!   Sorry, we’re low on dough.   But if you can keep a secret, I can tell you who’s gonna be in it.   Cable!   Someone suggested Mel Gibson for the role, buuuut- I was thinking Liam Neeson.   Only problem, Liam likes to get paid.   And more for Liam means less for me.   Maybe we’ll crowdfund the shit.   Just you and me, kids.   Shalom! DEADPOOL (CONT’D) (long version) You’re still here?   It’s over!   Go home. Wait... you expected a tease for Deadpool 2?!   Maybe a little Samuel L. Jackson? Sorry, that budget went to Weasel’s Ketamine habit.   But if you can keep a secret, I can tell you who’s gonna be in it.   Cable!   You’re allowed to show your pleasure.   I’d love Liam Neeson for the role, but Liam likes to get paid.   And more for Liam means less for me.   So we’d best crowdfund the shit.   Depending on your level of giving, you could receive a Colossus-brand desktop steel-ball clacker, a Dwayne ‘The Rock’ Johnson real doll, or four minutes alone in a room with Charlie Sheen.   Donate now!   And shalom!  SMASH CUT TO BLACK: DEADPOOL (O.S.) (CONT’D) (a la Ferris) Boom, boom, chicka chickah...  Deadpool   Final Shooting Script   11/16/15   117.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 244
    }
  ]
}