{
  "slug": "dear-white-people-2014",
  "title": "dear white people",
  "genre": "drama",
  "format": "film",
  "scenes_count": 8,
  "characters_count": 1,
  "characters": [
    "KURT"
  ],
  "total_words": 20498,
  "total_dialogue": 1,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. MANCHESTER ROW - DAY 6   6  Signs scream out “ORIENTATION” as jazz music wafts from the  laptops of a group of NEO BEATNIKS. As the music fades...  SAM (O.S.)  Dear White People, apparently  Morgan Freeman in “Deep Impact”  wasn’t enough. Despite two terms  Obama could cure Cancer and  somewhere White folks will be  embroiled in protest. And he’s only  half Black.  GABE, 24, white and ruggedly handsome in spite of his shaggy  hair and “laundry day” flip flop clad ensemble, catches the  end of this as he passes - grabs his cell phone and dials...  INT. STUDIO BOOTH - DAY 7   7  ...Sam presses a button next to a red light on her controls.  SAM  Talk to me.  INTERCUT with Gabe walking about on campus.  GABE  What would you say if someone  started a Dear Black People?  SAM  (recognizing the voice)  No need. Mass media from Fox News  to reality tv on VH1 makes it clear  what white people think of us.  EXT. MANCHESTER COURT - DAY 8   8  SERIES OF SHOTS - POPULAR RESIDENCE HALLS  Manchester’s white and rich elite before BECHET HOUSE.  Athletes of many disciplines before WEBSTER HOUSE. 8A   8A  An eclectic group of Black students with some Latinos and 8B   8B  a sprinkling of whites before ARMSTRONG / PARKER HOUSE.  COCO (V.O.)  I’m fucking pissed...  4.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 222
    },
    {
      "scene_number": 2,
      "slugline": "INT. CONFERENCE ROOM - DAY 11   11  Colandrea Conners (Coco) trains her unnaturally blue eyes  right at us from a Youtube page pulled up on an iPad. She’s  got an entitled air about her. Even her cusses sound erudite.  COCO (YOUTUBE)  ...I am! The whole point of  randomized housing is to mix shit  up. I’m out here trying to find the  Olivier to my Halle Berry, and  they’ve got me looking like an  extra on a Different World...  The video ends with a click. Looking up is HELMUT WEST, a  30’s something Black man in dark rimmed glasses and trendy  everything. Too stylish for this place. If he’s impressed,  it’s barely perceptible.  HELMUT  You call your Youtube show “Doing  Time at an Ivy League?”  He stares right at Coco, there in the flesh.  COCO  In my second year of a four year  sentence. Wanted to go to New York.  SUPERIMPOSE: COLANDREA   COCO CONNERS, SOPHOMORE, ECONOMICS  HELMUT  Yeah? And do what?  COCO  Things my mama taught me not to.  You know get in a lot of trouble  and become famous for it. But alas  I didn’t get into Tisch...  HELMUT  Armstrong / Parker? That your  rooming assignment?  COCO  Traditionally it’s where the  hopelessly Afrocentric gather to  process their guilt over not going  to an HBCU.  (off Helmut’s look)  Where the Negros be at.  HELMUT  That’s not where you want to be?  5.",
      "characters": [],
      "action_text": "COCO  Bechet House is more my style.  HELMUT  With the rich white kids.  COCO  Excuse me?  HELMUT  What part of Chicago you from?  COCO  Hyde Park.  HELMUT  What street?  COCO  Seventy Eighth and --  HELMUT  -- Seventy Eighth is Southside  sweetheart. And you know what they  say. You can take the girl out the  hood but --  COCO  -- Ain’t nothing hood about me.  HELMUT  Thanks so much for coming in.  Coco gets up to leave. Tries to recover.  COCO  So what’s this show about anyway?  HELMUT  Here’s the way reality works  sweetheart, I’m the producer. I ask  the questions. Be in touch.  And with that Helmut hustles Coco out. He sits and ponders  before unmuting his iPad.  SAM (O.S.)  Dear White People I am here to  burst your post-racial little  bubble.  6.  (MORE) Yes Oprah may have her own network,  but Ann Coulter is still writing  best sellers, Black kids are still  getting shot for wearing hoodies,  and even here the few vestiges of  Black culture are under attack by  conservative groups, trustees and  yes our very own President  Fletcher.  Helmut double checks his app fighting a genuine grin.  HELMUT  This is the school radio?  INT. ARMSTRONG / PARKER HALL - DAY 13   13  A pristine pair of Retro Jordans make their way through the  halls of Armstrong / Parker where Black students have lively  debates, flirt and bump the student radio.  SAM (O.S.)  Dear White People, thanks to the  new process of randomizing housing  assignments for Sophomores, some of  you may be jarred by an assignment  to Armstrong/Parker house.  The owner of the Jordans is revealed as Troy Fairbanks.  TROY  Someone turn that trash off.  SUPERIMPOSE: TROY FAIRBANKS, SENIOR, POLITICAL SCIENCE  Even with his post workout sweat he looks like the cover of  Jet. Troy exudes “approachable homie” as he spots a small  group of WHITE SOPHOMORES who walk timidly down the hall.  TROY (CONT’D)  Newbies right?  The white sophomores nod their heads yes.  TROY (CONT’D)  Welcome to Armstrong / Parker, home  of t",
      "dialogue_count": 0,
      "word_count": 2918
    },
    {
      "scene_number": 3,
      "slugline": "INT. ARMSTRONG/PARKER DINING HALL - DAY 20   20  Troy and Sam sit across from each other at a table. Their  opposite facing laptops and a world of tension put a wall  between them.  TROY  Get it yet?  Sam shakes her head yes.  TROY (CONT’D)  Good. You’ve now got the shared  calendar, contacts, and official  email.  Troy throws a smirk her way before pulling out a thick stack  of papers.  TROY (CONT’D)  Oh and before I forget.  SAM  Event requests for the year?  TROY  Just this month. They need your  approval. Also don’t forget to pick  your office hours. At least 20 per  week.  SAM  That’s absurd.  TROY  You’re in charge of a hundred  residents now. And they need time  to complain to your face. About  noise. Leaky pipes. Gluten free  options in the cafeteria. Etcetera.  SAM  Troy. I didn’t think I was going to  win.  TROY  And by the way petitioning the  President on the Randomization of  Housing Act isn’t gonna do shit.  None of the other houses are  concerned.  19.",
      "characters": [],
      "action_text": "SAM  Because they all have a legacy of  rich and powerful allies on the  board who will make sure that  “random” works out to their  advantage.  TROY  And you think a petition is going  to change that?  Troy gets up to leave as Reggie sits - suspicious. Sam’s  phone buzzes: “MOM.” The letters chill Sam to the core.  INT. ARMSTRONG / PARKER - DAY 21   21  Lionel steps his way through the hall, a deer in headlights  with a notepad. He flips through Sam’s “EBONY & IVY” book...  SAM (V.O.)  The Armstrong / Parker dining hall  is the epicenter of Black culture  as it stands at Manchester. Only  here can you commiserate, celebrate  and discuss everything from Kanye  West lyrics to theoretical  relativism all in one sitting. Not  to mention find someone who can  actually do your hair.  ARMSTRONG / PARKER DINING HALL - CONTINUOUS  Lionel enters and takes a place in a line. He absorbs this  lively and somewhat alien dining hall.  Troy now holds court near the windows at a table of eight or  so friends including Martin and SUNGMI, a lip ringed Korean  art major.  MARTIN  “We wuz robbed.” That election was  suspect man.  Martin glares at Reggie and his giant souped-up Laptop. Sam  breaks this by sitting back down - her phone call ending.  SAM  You call me the minute there’s an  update. Love you too mom.  Sam hangs up. The call’s really put her in a bad place. She  sits at a table of her Bofros - who we’ll name by their hair.  20. CURLS  There is one other sister in my  Relativity class, I’ll be damned if  our professor doesn’t call me  Laretta every God damn time.  DREADS  We all look the same.  REGGIE  Programming professor gets me and  Martin here mixed up constantly.  MARTIN  You should be so lucky.  Reggie glances over at Martin’s Mac Air.  REGGIE  Cute. You get that at Toys R Us?  Sam pulls out her Mac and her   student ID card .  REGGIE (CONT’D)  You still using your ID number?  SAM  I always forget passwords.  REGGIE  You are begging to get hacked.  SAM  Good thing the ",
      "dialogue_count": 0,
      "word_count": 4519
    },
    {
      "scene_number": 4,
      "slugline": "INT. BULLPEN - NIGHT 36   36  ...An office filled with computers. George and a few other  EDITORS scream with laughter - beers and pizza in hand.  GEORGE does a beat on his desk while...  GEORGE  I keeps it clean  Ya know what I mean.  I drinks my Vodka straight,  like I’m a fiend.  ANNIE, a strawberry blonde laughs in George’s lap. Lionel’s  envy shows.  ANNIE  Wait, quiet I want to hear this.  Annie turns up a Youtube video of...  COCO (O.S.)  If I could grow straight Indian  hair out my head --  ANNIE  Ohmigod, this is going on Facebook.  Annie swivels in her chair only to SCREAM BLOODY MURDER at  the sight of Lionel.  LIONEL  Relax the Negro at the door is not  here to rape you.  Annie laughs. The mood is drunk and light.  LIONEL (CONT’D)  So this is what editors do?  GEORGE  We’re taking a break, what are you  doing here?  LIONEL  You wanted me to drop in and tell  you how the story was coming?  GEORGE  Yeah like this week. It’s Saturday  night. You got nowhere else to be?  LIONEL  It was this or the new Madea movie.  42.",
      "characters": [],
      "action_text": "GEORGE  Dear God. Where does Madea go this  time? Dialysis?  EXT. MOVIE THEATER - NIGHT 37   37  Sam, flanked by Reggie and the BoFros are in mid rant.  REGGIE  Man fuck Tyler Perry.  SAM  Like, can we have a movie with, you  know characters in them? ‘Stead of  stereotypes wrapped in Christian  dogma?  REGGIE  Why is every educated person  inherently evil? Why this Nigga  gotta be in a mutha fucking dress  all the mutha fucking time?  SAM  How come the only Black movies  Hollywood wants to make are ones  with mammies in fat suits or Black  women in pain man?  All of this is directed at a TEENAGER in the box office.  TEENAGER  Most people are here to see Fang 9.  (after a beat)  Kelly Rowland’s in it?  The group throw up their hands and groan in protest.  INT. KURT’S HOUSE - NIGHT 38   38  Game Night and Kurt’s house is filled with smoke, music, and  rich kids who play cards at various tables.  Coco, in a banging jumpsuit scans the room for prospects. A  few eyes from the WHITE BOYS start to flicker her way. This  perks her up, as she arches her back slightly...  ...only to see their eyes follow the WHITE BRUNETTE HIPSTER  GIRL who has entered behind her.  Coco catches herself in the mirror. What don’t they see?  CARD TABLE 38A   38A  43. Troy deals cards at a table - the game is Texas Hold Em. Troy  holds court - much to Kurt’s chagrin. The mood is playful.  There’s a brief eye contact between Troy and Coco.  INT. SAM’S APARTMENT - NIGHT 39   39  A huge “Boycott Sal’s Pizzeria” poster hangs on the walls of  Sam’s chic dorm surrounded by other street art. The BoFros  and a few cool residents of Armstrong / Parker hang about.  Underground hip hop permeates the room. Sam refuses a joint  coldly from Reggie - her eyes fixed on “SCHOOL DAZE” which  plays on her 36’ flatscreen.  SAM  How ‘bout you stop stereotyping  yourself and put that shit out?  This ain’t “Friday.”  REGGIE  Yo Sam. We got to talk about the  protest. When are we are bringing  the Housing fight to the p",
      "dialogue_count": 0,
      "word_count": 653
    },
    {
      "scene_number": 5,
      "slugline": "INT. KURT’S HOUSE - NIGHT 40   40  Troy deals another hand with Kurt, Mitch and Gordon. Troy’s  homeboy swag is thicker than usual.  MITCH  Yo my perfect Friday night is  whiskey and my T-Bone Walker  records, real talk.  TROY  Who the fuck is T-Bone Walker?  INTERCUT WITH SAM’S APARTMENT: 40A   40A  SAM  Only a few ways colored folks  survive at a place like this.  MITCH  Uh only a pioneer of electric and  jump blues bro. Know your roots.  TROY  White folks always be on stuff like  decades too late and act like they  discovered some shit.  SAM  “Oofta” is the jazz age term for  Bojangle types who Blacked it up  for White audiences.  MITCH  Don’t sleep on T-Bone man.  TROY  Rock, Jazz, Blues - Nigga whatchu  got on right now?  MITCH  Public Enemy my Nig--  TROY  --Yo watch that man.  GORDON  You just called him --  TROY  -- Ya’ll get Country Clubs we get  to say Nigga.  Everyone at the table erupts in laughter. Except Kurt.  45.",
      "characters": [],
      "action_text": "GORDON  And golf? And all our girls?  TROY  Whatchu mean all your girls?  GORDON  Dude, between OJ, Tiger, Wesley  Snipes and uh, Troy over here...  TROY  Yo. It’s a word for that.  Reparations.  More Kurt-less laughter from the table.  TROY (CONT’D)  Forty white bitches and a mule.  Perfectly executed. Troy grins as the table erupts.  SAM  An Oofta modulates his Blackness up  or down depending on the crowd and  what he wants from them.  MITCH  Kurt?  KURT  What?  GORDON  Kurt.  Troy watches this exchange closely.  GORDON (CONT’D)  Troy. You thinking about Pastiche?  TROY  That’s the magazine right?  GORDON  For starters.  MITCH  What other “magazine” you know has  a first look deal at NBC? The third  biggest Youtube channel. Talk show.  Platinum comedy record homie!  46. GORDON  Couldn’t you see him on the talk  show Kurt?  Kurt looks at his cards.  KURT  I fold.  INT. SAM’S APARTMENT - NIGHT 41   41  A small crowd’s formed around Sam.  SUNGMI  Okay, and a nose-job is a wannabe?  INT. KURT’S HOUSE - NIGHT 42   42  Coco finishes her drink and catches Mitch and Gordon as they  start up a Youtube video on their iPad. The previous game is  over. They watch “Dear White People - 1,378,480 views.”  INTERCUT WITH SAM’S APARTMENT: 42A   42A  SAM  Sort of. Nose-jobs smooth their  Black edges and try to blend.  Coco runs her fingers through her straight hair.  GORDON  You seen this one?  SAM (YOUTUBE)  Dear White People using Instagram.  You have an iPhone and go on hikes.  I get it.  COCO  Ugh.  Gordon and Mitch turn and notice Coco. Mitch eyes her curves.  GORDON  Not a fan?  Coco makes a “no” face.  MITCH  Sup ma?  COCO  Don’t talk like that.  47. GORDON  Hey I know you...  Coco is taken aback as Gordon punches up her video and plays  it back. She hovers over them.  COCO (YOUTUBE)  Muffins. I hate to do it, but Imma  have to get real Black with you.  Coco a bit embarrassed scans the view count.  SAM  A Nose-job’s worst fear is that  their “Blackness” might cause a  fuss or",
      "dialogue_count": 0,
      "word_count": 1331
    },
    {
      "scene_number": 6,
      "slugline": "INT. SAM’S APARTMENT - NIGHT 46   46  Sungmi is one of the last to clear out of Sam’s apartment as  the party winds down.  SUNGMI  Hey, about the rally. You could  still get the permit anyway Sam and  go against the board. Most people  consider that political suicide  though.  REGGIE  We got to rally Sam. Time is now.  SAM  Use your head Reggie. You think a  rally is going to change things?  REGGIE  It’ll do a hell of a lot more than  a radio show or views on Youtube.  Everyone gets quiet. Sungmi takes this time to exit.  REGGIE (CONT’D)  Look, we got power Sam and it’s  time we used it. We earned it.  SAM  We? I didn’t see you running for  shit Reggie.  The Bofros trade looks as Reggie storms out. Sam waits a beat  and rolls her eyes.  EXT. ARMSTRONG / PARKER QUAD - NIGHT 47   47  Sam walks after Reggie.  REGGIE  Tired.  SAM  Don’t “one word” me.  REGGIE  Why you got to snap at me all the  time? I’m around you like twenty  four seven. Like your lap dog. I  don’t even usually get down like  that with no red bone chicks man.  53.",
      "characters": [],
      "action_text": "SAM  Don’t call me that.  REGGIE  Come on, I thought your ass was  Puerto Rican when I met you.  Sam turns to go.  REGGIE (CONT’D)  Oh so you can dish it out but you  can’t take it?  SAM  I’m taking my ass home.  REGGIE  Come on Sam. You know how I feel  about you.  SAM  How am I supposed to know how you  feel about me?  REGGIE  You know what? Forgive me if I see  something in you. Something  inspiring. Something folks like me  can get behind.  Reggie puts his hands on Sam’s belt and pulls her in to a  kiss as a group walks by. Over Reggie’s shoulder Sam sees...  ...Gabe look back at her. He’s heartbroken. She pretends not  to be affected and sinks into a kiss from Reggie.  REGGIE (CONT’D)  Tell me you’ll set up the rally.  SAM  I’ll set up the rally.  INT. KURT’S KITCHEN - NIGHT 48   48  Kurt, Gordon, Mitch, Coco and Troy all trade glances.  GORDON  Are we sure about this?  KURT  It’s ironic. Bold. And don’t tell  me I’m the only one who thinks Sam  White’s little movement needs to  get cut down to size.  54. Agreement Coco’s gaze. Uncertainty in Troy’s.  KURT (CONT’D)  Looks like you got your Hip Hop  party Mitch.  MITCH  ‘Bout time. It’s going to be huge  man, fucking epic.  Kurt holds back a smile.  KURT  Boys, we’ve got a lot more mingling  to do. We’ll be in touch. And Troy?  Get off the board bro.  Troy chews on this as Kurt leads his group out. Troy smiles,  goes to exit.  TROY  Nice seeing you.  COCO  Where’s Sofia?  TROY  I have no idea.  COCO  Trouble in paradise?  Troy shrugs and heads to the party.  COCO (CONT’D)  Figures.  (off Troy’s  incredulousness)  Nothing. I’m sure you’ve got  something else fair and petite  and...fair lined up for that drink.  TROY  What’s that supposed to mean?  COCO  It’s fine. I’m not even really into  Black dudes anyway.  TROY  I’ll have you know I’m an equal  opportunity employer, okay?  55. COCO  And what kind of jobs are you  hiring for mister?  Coco’s stiletto rubs the side of Troy’s calf.  TROY  Aren’t you and Sofia -- ",
      "dialogue_count": 0,
      "word_count": 2042
    },
    {
      "scene_number": 7,
      "slugline": "INT. CLASSROOM - DAY 58   58  Professor Bodkin watches over a small class as the students  fill in essay questions. Sam’s eyes are glued to a window...  Outside below the Brofros pull up in an SUV. They hop out and  start pulling out rally signs and bullhorns.  Sam’s eyes dart back to the clock as Gabe watches her watch  the time.  EXT. MANCHESTER UNIVERSITY - DAY 59A   59A  Sam bounds out of a building on her way to the parking lot.  From behind her...  DEAN FAIRBANKS  Running late.  Sam pauses and turns to see him.  DEAN FAIRBANKS (CONT’D)  For your little rally?  SAM  Forget your sign Dean?  DEAN FAIRBANKS  Do you honestly think this is in  the spirit of Armstrong / Parker  house?  SAM  The role of the counter culture is  to wake up the mainstream to --  DEAN FAIRBANKS  -- I’ve got furniture older than  you. Counter culture? Is that what  you think this is? That show of  yours?  SAM  What about my show?  DEAN FAIRBANKS  Your show is racist.  SAM  Black people can’t be racist.  The Dean is rendered speechless at this statement.  64.",
      "characters": [
        "KURT"
      ],
      "action_text": "SAM (CONT’D)  Prejudice? Yes. But not racist.  Racism describes a system of  disadvantage based on race. Black  people can’t be racist since they  don’t benefit from such a system.  DEAN FAIRBANKS  Do you read the school papers?  SAM  Is the New York Times a school  paper?  DEAN FAIRBANKS  Your antics are making press Sam  and press like this keeps men like  President Fletcher up at night.  SAM  Warm milk?  DEAN FAIRBANKS  He’s building a file on you.  SAM  It’s not my fault your son couldn’t  beat me in an election.  DEAN FAIRBANKS  I’m sure it was hard growing up.  Wondering which side you fit into.  Feeling like you have to  overcompensate perhaps?  SAM  If that’s true, I’m not the only  one Dean.  Sam walks off in a half jog - Fairbank’s last words resonate  more than she’d like.  Gabe, making his way outside just catches her exit.  EXT. PARKING LOT - DAY 59B   59B  Huge canvas signs with the words “WHITES ONLY” are strewn  about the pavement, along with bullhorns and picket signs.  Sam takes these in while the Brofros feverishly unpack the  SUV.  65. REGGIE  There you are! We supposed to start  at noon.  SAM  I told you I had class.  There’s a vibration in Sam’s pocket. Her phone says “MOM.”  She cuts it off and picks up a “white’s only” sign.  REGGIE  Those are going up on Gillespie.  Good right?  Sam shrugs in the affirmative but it’s too much. Reggie sees  a doubt in her eyes.  REGGIE (CONT’D)  Yo. What’s that? You’re not getting  cold feet are you?  SAM  No. I mean how long do I have to  talk anyway?  REGGIE  You’re kidding right? You’re sort  of the keynote.  SAM  Yeah but...you know I think the  whole Malcolm X thing is your lane  Reg. I’m just not --  REGGIE  -- They came to hear you Sam. Grab  a bullhorn. Turn it on.  Sam is struck by the command. Stuck between wanting to curse  and comply another buzz in her pocket yanks her attention to  her phone. Sam checks: “IT’S ABOUT DAD. CALL ME”  Sam turns for some privacy. She makes eye contact with Gabe  who’",
      "dialogue_count": 1,
      "word_count": 6758
    },
    {
      "scene_number": 8,
      "slugline": "INT. DEAN’S OFFICE - DAY 94   94  Dean Fairbanks loosens his tie, flanked by several SCHOOL  OFFICIALS. They’ve been here for hours listening to...  KURT  Once I heard what the group was  planning, I sent out an email to  the staff to cancel it. You have  the email printed in front of you.  DEAN FAIRBANKS  Who’s this?  Kurt turns to a SUITED MAN next to him.  KURT  My lawyer.  CUT TO:  We’ll be cross cutting between several of these sessions. 94B   94B  COCO  So when I got the invite and saw  everyone clicking “yes” I figured  it was back on.  DEAN FAIRBANKS  You were hoping to make the staff?  COCO  ...  CUT TO:  DEAN FAIRBANKS  At what point in time did you show  up to the event?  Sam sits with arms folded. 94C   94C  DEAN FAIRBANKS (CONT’D)  Samantha. Please.  SAM  Why am I even here?  CUT TO:  KURT  Guys throw parties at the house all 94   94  the time.  97.",
      "characters": [],
      "action_text": "DEAN FAIRBANKS  We know you were planning this.  KURT  Your son tell you that?  CUT TO:  Fairbanks stares down his son. Troy is silent and anxious. 94D   94D  DEAN FAIRBANKS  (reading)  “...wishing you could sip on Henny  out yo crunk cup without a Bitch  giving you the side-eye?”  (and then)  You write this Troy?  Troy looks up at his father embarrassed.  TROY  No. Mine wasn’t chosen.  DEAN FAIRBANKS  But you wanted to be?  TROY  What I wanted didn’t matter then.  Why should it matter now? I told  you   about the party, remember?  CUT TO:  DEAN FAIRBANKS  The invite came from the Pastiche 94   94  Facebook account.  KURT  I loathe Facebook.  An OFFICIAL whispers something in Fairbanks' ear.  KURT (CONT’D)  You’ve got to believe me.  DEAN FAIRBANKS  You’ve used that line on me before  this year Mr. Fletcher. When a  homophobic message mysteriously  appeared on a voice mail line you  shared with a roommate.  CUT TO:  98. DEAN FAIRBANKS (CONT’D)  What were your intentions when you  went back the second time?  LIONEL  To stop it.  DEAN FAIRBANKS  By any means necessary?  LIONEL  Someone once told me...Manchester  is like jazz. I don’t know much  about jazz. But from what I can  tell, when your solo’s up, you  better blow.  Fairbanks fights a smile.  CUT TO:  SAM 94C   94C  All I did that night was hit record  brother.  The Dean takes a gulp from a glass of water. He stands and  looks out his huge windows onto the campus below.  CUT TO:  The Dean has Facebook opened on his computer. Officials 94E   94E  are taking a break. Drinking water. Discussing the day.  The Dean tries a few passwords.  CUT TO:  DEAN FAIRBANKS 94C   94C  Want to hear something strange?  The Dean turns from the window.  DEAN FAIRBANKS (CONT’D)  The Pastiche group page hadn’t been  used for months, until the invite  went out.  CUT TO:  The Dean tries a different password. Still invalid. 94E   94E  CUT TO:  99. SAM 94C   94C  Fascinating.  DEAN FAIRBANKS  Well what’s interesting is how easy  it was to",
      "dialogue_count": 0,
      "word_count": 2055
    }
  ]
}