{
  "slug": "den-of-thieves-2018",
  "title": "den of thieves",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 15,
  "characters_count": 0,
  "characters": [],
  "total_words": 31093,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. CITY STREETS - DAWN 6   6  The Armored and SUV barrel down the early morning streets at 80+ mph. THE SUV BAILS OUT ONTO A SIDE-STREET. The Armored hits a hard right, ENTERS A TUNNEL. EXT. HAWTHORNE STREETS - DAWN 7   7  The SUV rolls to a quiet stop in a RESIDENTIAL NEIGHBORHOOD. OUTLAW#2 QUICKLY WIPES DOWN THE INTERIOR OF THE SUV WITH  WINDEX   AND   BABY-WIPES . POURS GASOLINE on the dash, steering wheel and seats. Walks away from the SUV. He peels out a CAR-KEY TAPED TO HIS CHEST, quietly sticks it into the door of a nondescript TOYOTA MINIVAN parked there. Hops in and drives off, unnoticed. In the distance, SIRENS can be heard. EXT./INT. CRENSHAW BLVD. TUNNEL - DAWN 8   8  The ROAR OF THE ARMORED’S ENGINE REVERBERATES throughout the tunnel as they tear away from the scene, desperate to evade the response. Merrimen’s head is on a swivel clocking the streets. IN THE ARMORED -- they ROUND A CURVE in the tunnel. 95 mph. The tunnel empties back onto the city streets. MERRIMEN We’re clean! INT. “PACIFIC HORIZON FREIGHT” 3PL WAREHOUSE / OFFICE - DAWN 9   9  BOSCO sits in a vast warehouse OFFICE, in front of a laptop. READS THEIR “SIGNATURE” ON THE DATONG SYSTEM THAT DISPLAYS A LIVE MAP-GRID FEED OF THE STREETS, ALL COP CARS AND THEIR EXACT LOCATION DISPLAYED. Bosco keys a radio, guides them through the gauntlet of responding cops. BOSCO (into radio) Go right on Doty, right on Doty! INT. ARMORED TRUCK - DAWN 10   10  Outlaw Driver follows Bosco’s directions. THEY STOP IN AN ALLEY, KILL THE LIGHTS, AS A CLOSE CALL WHIZZES PAST THEM. TENSION. THEY DRIVE THE LAST FEW BLOCKS TO THE SAFETY OF...  Den of Thieves   February 6, 2016 Draft   8 .",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 298
    },
    {
      "scene_number": 2,
      "slugline": "EXT. “THIRD WORLD” INDUSTRIAL DISTRICT, WILMINGTON - DAWN 11   11  A sea of BUSINESS PARKS, industrial warehouses, refineries, tank-farms all divided by pot-holed streets. The VINCENT THOMAS BRIDGE looms overhead. A coyote scurries as the Armored approaches. It backs into one of the warehouses. INT. “PACIFIC HORIZON FREIGHT” 3PL WAREHOUSE - DAWN 12   12  Outlaw#2 and a TONGAN CARGO HARD shut the warehouse sliding doors. The   Toyota   Minivan already parked inside. Outlaw#2 hits several numbers on a SECURITY KEYPAD, securing the building.   Beep-beeping   SOUND as the Armored reverses in and parks. “Pacific Horizon Freight” is written on the warehouse wall. A few SAMOAN AND TONGAN DOCKWORKERS man the vast warehouse, home to a 3PL, “Third Party Logistics”, shipping-freight biz. The Outlaws are exhausted. No one speaks as they strip off kevlar, gas masks, body armor, the mood tense. Around them: stacks of empty pallets, shrink-wrapped freight, forklifts, high-tech security equipment, radios, stripped cars, gas cans, pvc piping, highway flares, a weight bench... Fluorescents buzz 28ft overhead, giving us our FIRST CLEAN GLIMPSE OF THIS ARMED ROBBERY CREW: Seen before, MERRIMEN, the leader. Outlaw#2 pulls off his gear, revealing ENSON LEVOUX. Fierce, fat, big, Samoan. With corn-rows. Merrimen’s “lieutenant”. Their laptop Datong navigator, BO “BOSCO” OSTROMAN, 42. A barrel-chested whiteboy from Huntington. “ PEN1 ” ink beside some faded military tat on his thick arms. Lastly, the Outlaw Driver, DONNIE ALISON, 33, edgy white guy, quiet-type, which are usually the most dangerous, just not in this case. They don’t come much more intimidating than this. Everyone wears SURGICAL GLOVES when handling the Armored. MERRIMEN Checked for trackers? (Enson nods “of course”) Do it again. Enson slips beneath the truck’s underbelly, sweeps the entire chassis and engine with a FREQUENCY SCANNER. ENSON Nothing. It’s one of the old models. (CONTINUED)  Den of Thieves   February 6, 2016 Draft   9 .",
      "characters": [],
      "action_text": "Donnie stands over a garbage can and PUKES. He looks at his hands -- still shaking with adrenaline. MERRIMEN (to Bosco) And you were clean? (Bosco shrugs, looks to Enson) I asked you. Not him. Were you? BOSCO -yeah. Ran figure 8’s. No fleas... Merrimen’s eyes burn into Bosco. Finally: MERRIMEN Why didn’t we know about the chase cars? How did the call get through- ENSON -Ray. All heads turn to Enson. No one usually speaks when Merrimen is this hot, because it just doesn’t happen. ENSON (CONT’D) We knew the risks. Shit popped off. We handled it... That’s it. Merrimen doesn’t respond. Then to Bosco: MERRIMEN Get back over there, see who responded. Probably LASD. They’ll supercede Gardena... If it’s Major Crimes, we got a problem. Bosco pulls on a hoodie, grabs a DIGITAL CAMERA, and leaves. Merrimen and Donnie turn their attention to the Armored Truck. Bulletholes riddle it’s sides. Donnie shuts off the engine. Merrimen runs his hands over the bulletholes: MERRIMEN (CONT’D) Patch these up. Need it like new. Donnie nods. Merrimen circles the truck, inspecting it thoroughly. He stops behind the rear doors. Pops open the latches, and swings open the doors. Inside... NOTHING. It’s empty. CONTINUED: 12   12 (CONTINUED)  Den of Thieves   February 6, 2016 Draft   10 . ENSON You good? Merrimen looks over the truck one last time. Nods: MERRIMEN ... We’re cop killers now... His words hang in the air. HOLD ON HIM. TITLE reads, “Merrimen”. INT. NICK’S F-150 TRUCK - DAWN 13   13  CLOSE ON a PAIR OF EYES. They’re open really wide. And the pupils dilated. Black saucers. PULL BACK to reveal “BIG NICK” FLANAGAN, 41, white, cock-strong muscles, the kind that come from genetics, not from doing a lot of reps on   Cybex   machines at   Bally’s . He’s sporting a   Rolex , a bit of bling, couple tats, got a shaved head a bushy   ZZ-TOP   style goatee, and the bad skin that accompanies too many cycles of ‘roids. Nick dumps   Visine   in his eyes while driving. Fast. Zips through LA’s South Bay",
      "dialogue_count": 0,
      "word_count": 3039
    },
    {
      "scene_number": 3,
      "slugline": "EXT. CITY STREETS, GARDENA - MORNING 18   18  100 meters down the boulevard, a safe distance away, a nondescript   Mazda   pulls to the curb, Bosco at the wheel. Bosco looks thru a DIGITAL   NIKON   CAMERA, zooms in on the donut shop. The motor-drive whirs as HE DOCUMENTS THE CRIME SCENE, then disappears back into morning traffic. ON BIG NICK AND THE REGULATORS -- Nick picks up a spent shell- casing, inspects it, impressed. BIG NICK Tungsten carbide. Jacketed. That’s no joke. GUS (motions to the 2 downed Gardena PD across the street) Cut through their vests like butter. BORRACHO Ambushed’em while they were picking up breakfast. Surrounded the truck, Brinks Driver tried to do what he’s paid to do. The tungsten rounds went straight through the windshield, took him out. They took off with the truck. Gardena PD lost them under Hawthorne Municipal. BIG NICK They knew the route. Picked it because it’s right next to the Municipal airport, knew the restricted air space meant no ghetto bird air support. Smart... Talk to  Brinks ? How much they get away with? MURPH They were en route to a BofA pick up for a Fed drop...There was nothing in the truck. BIG NICK Nothing in the truck? (They all shake their heads) They stole a fucking empty armored car? (pause) Why the fireworks? (CONTINUED)  Den of Thieves   February 6, 2016 Draft   20 .",
      "characters": [],
      "action_text": "BORRACHO One of the Brinks cats said the Messenger went for his gun, and that’s when it popped off. BIG NICK Genius... (pause) The SUV? Prints, run the plates, anything? GUS It’s a cold car. VIN and registration tags are scratched off. License plate is registered to no one. No prints. Nothing. BIG NICK (motions to Outlaw#3) He dead yet? Murph lightly kicks Outlaw#3. No response. He bends down, checks his pulse. Nothing. He shuts Outlaw#3’s eyes. BIG NICK (CONT’D) Lift prints, see who he rolls with. A Crown Vic pulls up, and 3 MEN step out. Nice new haircuts, bad suits, freshly shaven. THE FEDS, LA BANK SQUAD. A collective grunt and sigh from our boys. BIG NICK (CONT’D) I can’t deal with this retard factory right now. Can one of you handle it? (They all play dumb, look away) All right... Witnesses? Donut shop guy? Any video surveillance? Talk to DOT? GUS Not much, but we’ll get it. BIG NICK Pull it all together, meet at the office. Gus and The Regulators nod, leave the scene as “LOBBIN’ BOB” GOLIGHTLY approaches. Fed, 45, stick up his ass. Not a hair out of place on his head, not a stone left unturned in his cases. A cowboy’s, like Nick, worst nightmare. BOB “Big Nick”. In the flesh. CONTINUED: 18   18 (CONTINUED)  Den of Thieves   February 6, 2016 Draft   21 . BIG NICK “Lobbin Bob.” How’s that mean tennis game? No response. Nick imitates a forehand swing. Nick looks Bob up and down, gives him a thumbs up. BIG NICK (CONT’D) That’s a really nice suit you got there. Where’d you pick that up? BOB Not at Canali. Can’t afford it. Always did wonder how you and your boys do it. BIG NICK (motions to his blazer) This piece of shit? Na, this is garbage. Look at you. That thing’s tits. You must pull all kinds of ass sportin’ that. These two are just oil and water. BOB It’s too early for your circus. I don’t like you, or how you handle - BIG NICK - what’s up with that? I like you! (lightly hits Bob’s shoulder) Aside from the fact that you’re a Vegetarian - BOB - Vegan. BIG NICK ",
      "dialogue_count": 0,
      "word_count": 3620
    },
    {
      "scene_number": 4,
      "slugline": "INT. HOFBRAU - DAY 24   24  Donnie tending bar. Bosco’s there, putting down the   Cuba  Libres . DONNIE ...I’ve got a ‘72 Z28. 454 with a supercharger. I cruise up to Willow Springs every couple months and open it up a bit. BOSCO Nice. So you can drive a little, huh? DONNIE Little bit. Ran Formula Atlantic for a few seasons back in the day... BIG NICK (V.O.) ...What was his name? DONNIE (V.O.) Not sure. Bosco was his handle. Big white dude. Yoked up, arms are sleeved. He talked about being in the military for some time. Worked for the DWP. We hit it off because we both grew up in So Cal. Liked cars. Bosco sips his   Cuba Libre , looks around. He leans forward. DONNIE (V.O.) He asked me if I was interested in making a little extra cash. Said they had a job for me, “a cherry that was ripe for picking”. BIG NICK (V.O.) Who’s “they”? Bosco writes something down on a napkin, slides it to Donnie. DONNIE (V.O.) ...Merrimen. INT. “POMONA MINING CO.” RESTAURANT, POMONA - DAY 25   25  Merrimen sits in a booth overlooking the 10. Bosco stands there. BOSCO ...my boy did time with him at Wayside. He’s cool. (CONTINUED)  Den of Thieves   February 6, 2016 Draft   35 .",
      "characters": [],
      "action_text": "Merrimen glances over at Donnie, who waits nervously 30 feet away. Merrimen finally nods at Bosco. Bosco waves Donnie over, introduces them. They shake hands. Donnie sits across from Merrimen. Merrimen glances at Bosco. Bosco takes the cue, leaving them alone. BIG NICK (V.O.) Where’d you meet him? Merrimen and Donnie converse quietly. DONNIE (V.O.) Some restaurant way east off the 10. All he told me was he might have some extra work. Kept everything real low-key. Struck me as a very meticulous, sharp guy. He was feeling me out, putting together a crew. He had just gotten out, from what I understood. INT. PRISON CELL - DAY 26   26  Willy Lump Lump sits before us, smoking the same cig he was when we first met him. WILLY LUMP LUMP So what you gonna do out there? REVEAL THE PERSON WILLY HAS BEEN SPEAKING TO. SITTING ACROSS FROM HIM ON A COT, IS HIS CELLIE, MERRIMEN. Merrimen buttons up his prison-issued flannel, ties his prison-issued “Bruce Lee” shoes. Gathers his few belongings -- books, drawings, letters -- into a shoe-box. MERRIMEN (shrugs) Bang my old lady, play it cool...lay low. A title reads, “Feb. 9, 2011. Federal Correctional Institute, Terminal Island.” WILLY LUMP LUMP (chuckles) Yeah right. Footsteps and the jangle of keys approach. Merrimen stands with his back to the cell door, hands behind his back in the cell-door portal. FCI CORRECTIONS OFFICERS come to the door. FCI COP All right, Ray, lets cuff’em up. CONTINUED: 25   25 (CONTINUED)  Den of Thieves   February 6, 2016 Draft   36 . The cell-door portal slides open. The Cops reach in and handcuff Merrimen. Cuffed, Merrimen steps away from the door. FCI COP (CONT’D) (shouts out) 214! And the door to the cell is buzzed open. The FCI Cop enters, picks up Merrimen’s shoe-box of belongings. FCI COP (CONT’D) You gonna miss your cellie, Willy? Willy Lump Lump stretches out, rests his feet on Merrimen’s now empty cot. Tilts his head back, savoring the extra space. WILLY LUMP LUMP (coughs) ...quite the contrary. H",
      "dialogue_count": 0,
      "word_count": 4396
    },
    {
      "scene_number": 5,
      "slugline": "INT. THE FED, WASTE DISPOSAL - DAY 50   50  A VAT, where a ROTATING MIXING ARM stirs the shredded cash with WET CEMENT. MERRIMEN (V.O.) The shredded money is funneled into a vat, where it’s mixed with cement, dried into bricks and dumped in the trash. 120 million turned into dust in minutes. The “liquid cash” is squeezed into an OVEN, where it is MOLDED INTO SQUARE BRIQUETTES, HEATED, WRAPPED AND SEALED IN CELLOPHANE, and spit out into a DUMPSTER. MERRIMEN (V.O.) It’s then picked up by the Fed’s contracted waste management, and hauled to a city dump. POV floats past the dumpster to a HULKING ORANGE GARBAGE TRUCK that pulls up. A GARBAGE MAN STEPS FROM THE TRUCK -- BAS. He lowers the lifting arms, hooks the dumpster, then dumps the contents into the belly of the truck. Bas hops in the truck, and drives up a circular exit ramp. POV CHASES after the trash truck, and follows it... EXT. THE FED - DAY 51   51  Up and out of the Fed’s exit. The Garbage Truck turns left onto the one-way street and pulls away from us. MERRIMEN (V.O.) If you can get in there during that 1 hour window, and get to those unfit bills before they go to the shredders, and get out clean... POV moves across the street, BETWEEN PASSING CARS, until it finds Merrimen parked there. CAMERA COMES IN ON HIM, sitting behind the wheel. THE SINGLE TRACKING SHOT COMES TO AN END. MERRIMEN ...then you just got away with 120 million dollars that no one’s looking for. Donnie, Bosco, and Enson eye the Fed, and the herculean task. (CONTINUED)  Den of Thieves   February 6, 2016 Draft   51 .",
      "characters": [],
      "action_text": "ENSON Impossible. Forget once we’re inside. And getting out...How the hell do we get in? Enson motions to the front entrance to the Fed. MERRIMEN Not going in that way. Merrimen pulls back out into traffic, passes the front of the Fed. Points to a SECOND ENTRANCE on the western side, that a BRINKS ARMORED TRUCK PULLS UP TO. 2 Fed Guards stop the truck at a heavily fortified gate. MERRIMEN (CONT’D) We’re going in that way. All heads turn to the Armored Truck waiting at the gate. And it dawns on them... Merrimen lets the reality of what they’re about to attempt sink in. They drive on in silence. INT. LASD HEADQUARTERS, MAJOR CRIMES - DAY 52   52  CLOSE ON a BEET RED FACE -- Big Nick’s. Eyes bulging, cheeks bursting with air, exhaling in spurts. Tony Z spots Nick on a free-weight bench in the office’s makeshift gym. Nick struggles with his last reps. TONY Z Big chest, bro, come on! Power. Power! Get pissed! Come on! Get pissed! Nick‘s arms shake, gives everything to squeeze out the rep. TONY Z (CONT’D) One more you crush strangé pussy tonight. Come on! You’re an animal. Nick busts up laughing. The bar collapses down on him. Practically crushes his sternum. Tony Z pulls up the bar. BIG NICK Bro. You can’t make me laugh mid-set. Just frickin’ spot me next time. BORRACHO Ran prints through CAL ID. Got a match on the dead guy at Randy's. CONTINUED: 51   51 (CONTINUED)  Den of Thieves   February 6, 2016 Draft   52 . They look up, Borracho stands there. They hurry into the office, hungry for details. Borracho and Gus huddle at their desks, work the phones, on the case. GUS Name’s Marshall Rhodes. Gun nut from Oakland. CDC Gang Unit validated him as an associate of The Brand. ATF was looking for him, trying to get him on some inter-state gun trafficking technicality. But more to the point, was stationed at 29 Palms from ‘88 to ‘92. Same time Merrimen was there. BIG NICK This is good. (motions to Borracho) Grab the book on Merrimen. Borracho pulls out the crime book on Merrime",
      "dialogue_count": 0,
      "word_count": 4212
    },
    {
      "scene_number": 6,
      "slugline": "INT. MERRIMEN’S SUBURBAN, SOUTH BAY - NIGHT 72   72  Merrimen drives. Donnie rides shotgun. Enson in back right behind Donnie. They drive through vast South Bay industrial streets in silence, past refineries and defense contractors. Donnie stares straight ahead, battling cold waves of fear. Finally turns to Merrimen. DONNIE Where we going? No answer. Then Merrimen gently brakes, and turns into a desolate parking lot at the rear of a sprawling, Tudor-style house with well manicured lawns. A sign out front reads, “MCKAY’S SOUTH BAY MORTUARY”. Merrimen parks, shuts off the engine. Dread grips Donnie. They sit there in the quiet. The only sound heard is a faint, hollow, furnace-like drone emanating from the mortuary. A rear door to the mortuary opens, and a BESPECTACLED MAN in a dark suit appears, looks in their direction. Merrimen flashes his brights twice. With that, the man subtly nods, and disappears back inside, the door left ajar. Merrimen turns to Donnie, looks at him. Donnie’s mind reels. MERRIMEN You a cop? DONNIE What?! You kidding?! ...Fuck no! Merrimen just stares at him, finally looks away, nodding. Merrimen remains calm and collected. Yet he exudes, as always, an energy of unpredictable lethality. MERRIMEN ...you wearing a wire? Donnie sighs, shakes his head. Musters up the courage to look back at Merrimen. DONNIE No... Are you? Long pause. Merrimen grinds his jaw, debates. MERRIMEN Get out of the car.  Den of Thieves   February 6, 2016 Draft   67 .",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 244
    },
    {
      "scene_number": 7,
      "slugline": "EXT. MORTUARY - NIGHT 73   73  Merrimen walks toward the rear door of the mortuary. Donnie reluctantly follows. Enson trails Donnie a few feet behind. Merrimen stops just before the door, faces Donnie. The source of the sound reveals itself -- behind the door, is a CREMATORIUM. It’s furnace burns eerily hot. Donnie starts to tremble with fear. MERRIMEN Strip. DONNIE What?! ENSON Where’d you hide the wire? DONNIE What goddamn wire?! I’m not wearing - ENSON - take your fucken clothes off! Donnie begins to visibly shake. Pulls his shirt off, his pants down. Stands there in his underwear like an asshole. Enson rifles through his clothes. Looks in his underwear. Finds nothing. Tells Donnie to put his clothes back on. Donnie pulls on his jeans, when Enson buries a fist deep into Donnie’s unsuspecting gut. Donnie collapses to the ground, gasping. Enson kicks him several times. Donnie balls up. Enson stops. Merrimen yanks Donnie to his knees. MERRIMEN Open your mouth. Donnie does as told. Merrimen jams a Sig-Sauer down his throat. Donnie’s eyes water. His chest heaves. His eyes plead. MERRIMEN (CONT’D) How does he know you? And don’t tell me from the gym. DONNIE (voice gagging) I swear, I don’t know - ENSON - smoke him. Smoke the punk. (CONTINUED)  Den of Thieves   February 6, 2016 Draft   68 .",
      "characters": [],
      "action_text": "Donnie shakes his head vigorously. Merrimen pulls out the gun. Donnie gulps in air, quivering violently. DONNIE I’m not a cop. I swear to you...he came to me he knows who you are but I didn’t tell him a thing I swear to fuckin’ God. It was a while ago, right when we first hooked up. He sweated me, haven’t seen him since, thought he’d leave me alone. MERRIMEN What do they know? DONNIE Nothing. I didn’t know back then anyway. If we have to call it off, I get it. Merrimen stares at Donnie for what seems like an eternity, deciding. He finally sticks the gun back in his waistband. Merrimen wraps on the mortuary door once, then he and Enson start walking back toward the truck. MERRIMEN Put your clothes on... (opens truck door. To Donnie) ...Friday. Confirm with him it’s on. Make sure he’s on the line... Donnie meets Merrimen’s gaze, and nods. INT. NICK’S F-150 TRUCK, PALOS VERDES - NIGHT 74   74  Nick drives slowly past the upscale homes of Rolling Hills Estates, searching for something. Spots DEBBIE’S CAR parked in front of a Mediterranean McMansion, along with a few others. Landscape lighting is on. Looks like a party is underway. Nick parks a ways down the block, eyeballs the house. Gets out, walks toward it. He’s pretty buzzed. Slight chance a neighbor will call the cops on him. This is not his hood. INT. MEDITERRANEAN MCMANSION, ROLLING HILLS - NIGHT 75   75  Nick lets himself in. About 6 kids, ages 3-13, are going apeshit in the living area, all refereed poorly by an overworked Salvadoran nanny. Nick’s daughters are amongst them. Cassady sees her dad and gasps with joy. CONTINUED: 73   73 (CONTINUED)  Den of Thieves   February 6, 2016 Draft   69 . BIG NICK Peanut, give me a hug! She runs to him, grabs onto his leg: CASSADY Daddy!!! Just around the corner in the chef’s kitchen, the adults’ enjoying a red wine dinner stiffen, as they recognize the voice. Debbie is there, on a double-date with her older sister SANDEE, South African pro golfer-type brother-in-law RUUD, ",
      "dialogue_count": 0,
      "word_count": 1563
    },
    {
      "scene_number": 8,
      "slugline": "INT. LASD HEADQUARTERS, MAJOR CRIMES - DAY 78   78  Nick sits alone at his desk, his eyes gaunt and hollow, studying “MERRIMEN’S CREW” CRIME BOOK, comparing it with the “Unsolved?” crime book. Looks over CRIME SCENE PHOTOS of the “City National Hollywood ‘03” tunneling job, the “Dunbar Armored Depot ‘04” vault shape-charge job, etc... He studies DONNIE’S FILE. It’s woefully thin -- copies of an IMSA racing license, now infamous moving violations, and a SMALL ARTICLE from the   Ventura County Star   newspaper detailing local kid Donnie Alison taking second at the 1991 National Spelling Bee competition. A QUOTE from the article claims Donnie has a “ near photographic memory .” BIG NICK Why’s Fraulein’s file so thin? Gus works at his desk, tired and hungry. GUS We can’t find a damn thing on him. Nick furrows his brow. Forages through Merrimen’s   Cali Dept. of Corrections   file, discovers that Merrimen’s cellie at Terminal Island was none other than WILLIAM “Willy Lump Lump” PUMP, the most prolific bank robber in the history of the state. BIG NICK Merrimen’s cellie at TI was Willy Lump Lump. GUS No shit? (Nick nods “no shit”) How did we miss that?! BIG NICK Because we’re not very good at our job. Gus frowns. Nick brings MERRIMEN’S MUGSHOT up on his computer screen. Merrimen’s eyes stare right at Nick. Piercing, intense, direct. Not an ounce of bullshit in those eyes. Yet a ton of menace. Nick meets Merrimen’s gaze, and stares back. INT. SPEARMINT RHINO, CITY OF INDUSTRY - NIGHT 79   79  Gentlemen’s club. The weekday crowd is pretty thin. But the DJ works the mic like it’s Saturday night in Vegas. (CONTINUED)  Den of Thieves   February 6, 2016 Draft   74 .",
      "characters": [],
      "action_text": "WE WATCH IN   KUBRICKIAN   POV as a dancer comes out on stage, grabs the pole, and does her seductive thing. A HAND COMES INTO FRAME, DROPS A $20 ON STAGE. She nears us. IT’S HOLLY. She looks right down at us, starts to strip and writhe. Crawls toward us. Licks her lips then grabs the $20. Thrusts her ass out and stuffs it in her micro-bikini. REVEAL the big-tipper is BIG NICK. He sits stage-side, sunken in his chair, the King of the Jungle. He grins, all lust and vice. His eyes lock onto his prey. INT. NICK’S TRUCK, TORRANCE - DAY 80   80  Nick’s parked in the lot of a TACO STAND, eating. Murph and Gus are in back, doing the same. Donnie walks up, hops in shotgun. Nick offers him a taco. He declines, launches into Nick: DONNIE What the fuck was that all about?! You “spotted me at the gym”?! BIG NICK Tranquillo. They’re not gonna off you when they know there’s heat...When’s the party? DONNIE ...Friday. BIG NICK Where? DONNIE I don’t know. Friday’s all I can tell you. BIG NICK T G I F. DONNIE You’re protecting me on this. BIG NICK Fraulein, don’t worry about a thing. Donnie scoffs, gets out, shuts the door. Looks back. DONNIE (taps the door) Better wear your vests. CONTINUED: 79   79  Den of Thieves   February 6, 2016 Draft   75 .",
      "dialogue_count": 0,
      "word_count": 518
    },
    {
      "scene_number": 9,
      "slugline": "INT. “PACIFIC HORIZON FREIGHT” 3PL WAREHOUSE - DAY 81   81  Merrimen and Enson sit in their warehouse office with HUGO BANDI, 63, Croatian, board-member of the Longshoreman Union, olive oil and Ouzo importer, and “criminal receiver”. Which translates to   Street   as FENCE. Hugo is on his cell, having a CODED CONVERSATION that ping- pongs between Slavic, English and Spanish. Looks to Merrimen: HUGO BANDI ...you’re at Container Terminal 114... (listens to the other end) Maersk Sealand, operated by Maersk Line Liberia. You are all cleared on the passenger manifest as crew. Hugo finishes his conversation, hangs up. Slides 5 ENVELOPES to Merrimen. One for each man. HUGO BANDI (CONT’D) Travel documents, itineraries, which are all different. Everyone takes separate routes after your ride on the supertanker. Groups attract attention. OK? Merrimen nods, looks inside his envelope. The ITINERARY -- “...Ensenada...Mexico City...Havana.” Flips open his BRASILIAN PASSPORT. Already stamped with VISAS and CUSTOMS- STAMPS from various countries. HUGO BANDI (CONT’D) Passports are stamped with visas, customs, so you don’t look like a new traveler. That raises flags...You meet in Havana, where my people will handle the financials. Relax there, buy some girls, and get a tan so you don’t look so American. Merrimen looks over his “cover” -- BUSINESS CARDS and PAPERWORK support his new Brasilian identity. HUGO BANDI (CONT’D) Business cards, papers, all support your cover. Merrimen hands Hugo a thick envelope. They shake hands. (CONTINUED)  Den of Thieves   February 6, 2016 Draft   76 .",
      "characters": [],
      "action_text": "HUGO BANDI (CONT’D) And no sweats or sneakers or baseball hats. In the rest of the world, only mafiosi dress that way. Suits only... EXT. OAKWOOD APARTMENT COMPLEX, SAN GABRIEL VALLEY - DAY 82   82  Merrimen walks past the complex pool, approaches an apartment. He carries a   Samsonite   suitcase. Unlocks the door, enters. INT. HOLLY’S APARTMENT - DAY 83   83  Moment Merrimen walks in, A WOMAN GASPS. He braces himself, rounds into the living room. Freezes. Holly’s there, naked on the couch. She darts into a bedroom. And standing in the middle of the room in all his glory, is Big Nick. He’s shirtless, pulls on his jeans. Porn plays on mute on the TV. Nick and Merrimen just stand there, staring at each other. Nicks’s eyes go to his GUN, resting on the couch 15 feet away. Merrimen follows his gaze, sees it. He’s closer to the gun. And Nick knows it. Their eyes meet again. Nick raises his eyebrows, motions Merrimen to go for it. He doesn’t. Merrimen walks past the couch, past Nick, and into the bedroom. Then shuts the door. Nick stands there. Tries to listen in on them. Can’t hear anything. He pulls his clothes on, grabs his gun, and leaves. INT. HOLLY’S BEDROOM - DAY 84   84  Holly pulls on underwear. Merrimen watches, then steps toward her, threat in his aspect. Corners her. She cowers. HOLLY But I did what you told me. MERRIMEN How was it? His breathe bathes her. She starts to tremble, terrified. HOLLY Baby, please... Disgust and jealousy course through him. He fights the urge, forces himself to turn away from her. CONTINUED: 81   81  Den of Thieves   February 6, 2016 Draft   77 .",
      "dialogue_count": 0,
      "word_count": 530
    },
    {
      "scene_number": 10,
      "slugline": "INT. NICK’S TRUCK - NIGHT 85   85  Nick drives, a gloating grin plastered on his face. He dials his cell. The other end picks up: BIG NICK (into cell) B of A, Montebello Towne Center. Nick hangs up, then realizes something. He touches his wrist, where his watch usually is. All there now, is it’s tan-line. BIG NICK (CONT’D) Shit. INT. HOLLY’S APARTMENT - NIGHT 86   86  Merrimen sits in a Lazy-boy in front of the TV, brooding. He talks quietly to himself while cleaning his various firearms, which rest in pieces at his feet. He can’t shake the subtle, faint ticking sound in his head. Eventually, his eyes drift to the empty couch, and the errand WATCH that rests there. Merrimen glares at it, unblinking. The ticking grows louder. INT. DONNIE’S APARTMENT - DAWN 87   87  ECU of a digital watch. 5:14 am. A beeping alarm sounds. A finger comes into frame, shuts it off. Donnie gets up, already dressed. His apartment has been stripped clean, packed up. He goes to the large window, opens it. Sounds of the city drift in. He looks at something. A few blocks down the street, is... THE FEDERAL RESERVE BANK. Beyond it, dawn’s first light gives form to downtown’s skyline. INT. ENSON’S HOUSE - DAWN 88   88  Enson cooks eggs and sausage links for his kids, amidst the wonderful chaos of family getting ready for the day. Maloa comes in late, rushed, makes herself toast. ENSON Got practice this morning? You need protein. Enson puts a plate of eggs in front of her. She doesn’t eat it, doesn’t make eye contact either. Mad at her dad. Enson shakes his head, takes the plate away. (CONTINUED)  Den of Thieves   February 6, 2016 Draft   78 .",
      "characters": [],
      "action_text": "A car honks outside. Maloa pops up, grabs her backpack. Can’t get out of here fast enough. As she bolts for the door: ENSON (CONT’D) Maloa. She stops, looks back. Enson motions her over. She reluctantly comes back to him. ENSON (CONT’D) You have fun? Maloa shrugs. Enson struggles to find the words. ENSON (CONT’D) He treat you nice? Finally, Maloa looks up at her father. She nods with certainty. Enson has a tough time digesting the fact that, his baby girl has fallen in love. But such is life. Enson nods, then he hugs his daughter. And she him. He squeezes her tight. ENSON (CONT’D) I love ya. The car honks again. She’s gotta go. Maloa smiles at her dad, tears in her eyes, then she runs out to the car. Enson watches her go, a little girl no more. INT. HOLLY’S APARTMENT - DAWN 89   89  Merrimen sits on the edge of the bed, watching Holly sleep. Not wanting to wake her, he quietly stands, slips out. In the living room, he loads his firearms into their case. His eyes go to the watch again. He listens to it tick. EXT. OAKWOOD APARTMENT COMPLEX - DAWN 90   90  Merrimen walks past the complex pool,   Samsonite   and gun-case in hand. His wary eyes subtly sweep the surrounding area. EXT. ELEMENTARY SCHOOL, REDONDO - MORNING 91   91  Nick drives up, parks, hops out, approaches a school yard, packed with grade school kids playing during morning recess. A fence surrounds the entire playground, no way to get in. Nick stands at the fence, searches the crowd for his girls. Spots McKenna. CONTINUED: 88   88 (CONTINUED)  Den of Thieves   February 6, 2016 Draft   79 . He wraps his fingers around the fence, is about to call out to her, then hesitates. She plays happily, he doesn’t want to interrupt. Instead, he just watches her play. INT. NICK’S F-150 TRUCK - MORNING 92   92  Nick climbs in his truck, parked across from the school. He pops in the keys, turns on the ignition. Is about to drive off, when he pauses. He sits there, suddenly becoming very still, staring into space... And t",
      "dialogue_count": 0,
      "word_count": 3951
    },
    {
      "scene_number": 11,
      "slugline": "EXT. BANK OF AMERICA - DAY 110   110  Big Nick and his boys exit the bank, breeze past Lobbin’ Bob and the LAPD, who comb over the Econoline Van. Lobbin’ Bob shakes his head to himself as Nick passes. BOB You need professional help. BIG NICK Desperately... (shoulder taps Bob as he blows past) My bad last time. Your crime scene. Nick salutes Bob with a solidarity fist pump. Bob holds his hands up in surrender, unsure where the hell Nick is going. Nick, Tony Z, and Gus mount their vehicle, leave the scene. EXT. THE FED, ARMORED CAR ENTRANCE - DAY 111   111  Merrimen and Enson pull up to the security gate at The Fed. The Receiving Guard, JACKSON, black, 62, leans out from the bulletproof SECURITY BOOTH, doesn’t recognize them. New guys. JACKSON Got you on a new route? Merrimen hands Jackson a SCHEDULED DROP CONFIRMATION. MERRIMEN Yeah, they switched us over this week. Jackson picks up a PHONE. Speaks into it: JACKSON Got a 3 o’clock for BofA? Jackson waits for the confirm, inspects the “Scheduled Drop Confirmation”. He looks over Merrimen, glances inside the truck. RECEIVING GUARD#3 steps out from the booth, holding a POLE with a MIRROR ATTACHED to the end of it. Runs it along the bottom-side of the truck, inspects the underbelly. MERRIMEN If it’s a problem, we can have base reschedule. JACKSON It takes a sec...While we’re waiting, could I bother you for your ID’s? (CONTINUED)  Den of Thieves   February 6, 2016 Draft   93 .",
      "characters": [],
      "action_text": "Merrimen hands Jackson their BRINKS IDS. Jackson looks them over. Merrimen shifts a little. What’s taking so damn long? Jackson listens in the phone, hangs up. Jackson hands Merrimen their IDs, waves them through as the GATES FINALLY RISE. INT. THE FED, RECEIVING DOCK - DAY 112   112  Merrimen guides the truck along a WINDING CIRCULAR DRIVEWAY that leads 5 stories down. They approach the RECEIVING DOCK. Receiving Guard#2, MONROE, guides them into the dock. Merrimen and Enson hop out. Open the rear doors of the truck, wheel out MONEY TUBS, “FRB-LA” emblazoned on all. MONROE B of A, 2.2? (Merrimen nods) Sign here. Merrimen signs the RECEIVING CONFIRMATION FORM. As he does, Monroe eyeballs him. Looks at his ID. MONROE (CONT’D) You new, Marc? MERRIMEN Yes sir. Monroe nods, glances at his watch, annoyed. This is one to watch out for. He’s suspicious by nature. Fastidious. MONROE You’re late. MERRIMEN Yeah, we got caught up in traffic. Merrimen smiles. Monroe doesn’t. MONROE I don’t know where they had you guys routed before, but we run a tight, tight ship here. If you’re going to be late, have base call in. You should know that. MERRIMEN I know, I know. Traffic was - MONROE - just have them call. CONTINUED: 111   111 (CONTINUED)  Den of Thieves   February 6, 2016 Draft   94 . Monroe grabs the clipboard. Moves off. Enson and Merrimen wheel the MONEY TUBS to the RECEIVING BAY. Behind the wall of 3” thick bulletproof plexiglass are the count rooms, bustling with activity. Most employees look like they’ve been plucked from the   Universal City Walk . Minorities with   iPods   in their ears, or fat white women and old white dudes with ponytails. Merrimen eyes the omnipresent cameras above. LUIGI and JUNIOR approach, laughing about something, moving through a series of man-traps. Luigi nods to them, motions for Merrimen to pass the   B OF A   FEDERAL RESERVE DEPOSIT SLIP through a SLOT. Merrimen does. Luigi reads it, shouts through the glass: LUIGI Hundreds?! (Merrimen nods) W",
      "dialogue_count": 0,
      "word_count": 797
    },
    {
      "scene_number": 12,
      "slugline": "INT. SUBTERRANEAN TUNNELS - DAY 114   114  Bosco speaks back into his nextel: BOSCO Roger that, Repeat Offender. Lights out. He engages a series of controls on the grid. INT. THE FED, SECURITY NERVE CENTER - DAY 115   115  Cam checks the security control board, shakes his head. Shouts through the bulletproof glass to Johnny: CAM We’re brown again! Gotta shut down. Pull’em out of the count rooms! Johnny nods, speaks into a secured radio, as Cam checks the SURVEILLANCE SCREENS. COME IN ON MONITOR 14 -- the count room. INT. THE FED, RECEIVING DOCK - DAY 116   116  TIGHT ON MERRIMEN’S EAR. An EARPIECE inside. Locked into the internal radio wavelength. Overhears Johnny: JOHNNY (in earpiece) ...we’re going brown. Gotta shut down for a bit. All teams go ahead and take 10. MERRIMEN (quietly into nextel) Get ready to go. INT. THE FED, 100 DOLLAR BANKNOTE COUNT ROOM - DAY 117   117  Luigi shuts down the counting machine. He and Junior punch out of the man-trap, step into the hallway, lock the doors. Quiet inside now. Just the sounds of   Power 106 . ON MERRIMEN -- through several walls of man-trap glass, he sees Junior and Luigi LEAVE THE COUNT ROOM. MERRIMEN (into nextel) You’re clear. ON DONNIE -- crammed inside the tub. Very, very slowly opens the top lid. He looks to the FLUORESCENT LIGHT PANEL 10’ above. He extends a thin, RIGGED CAR ANTENNA, inches it out, extending it upward. 2 feet further. (CONTINUED)  Den of Thieves   February 6, 2016 Draft   96 .",
      "characters": [],
      "action_text": "ON MERRIMEN -- he and Enson feign interest in the   LA Times . Merrimen’s eyes furtively glance around -- MERRIMEN CAN MAKE OUT THE ANTENNA. All the FED EMPLOYEES head for the cafeteria. ON DONNIE -- couple of inches further. ON CAM -- in the security nerve center, reading a mag instead of looking at monitor 14, where the antenna is barely visible. ON DONNIE -- lightly jerking the antenna up, into the fluorescent bulb. Jabbing it. Can’t break it. ON MERRIMEN -- 2 Employees walk right past the 100 banknote count room. Merrimen and Enson tense. The employees disappear into the cafeteria. ON DONNIE -- jerks it again. POP. A small shower of glass. The BULB goes dark, causing the entire BAY OF FLUORESCENTS TO FLICKER slightly. Donnie quickly inches down the antenna. DONNIE (into mic) Am I clear? ON MERRIMEN -- sees the lights flickering. Scans the area. MERRIMEN (whispers into nextel) Clear. Go. Go. ON CAM -- still reading. MONITOR 14 GOES DIM. WHITE NOISE. ON DONNIE -- slides the top open further. Looks around. Holy shit. He’s here. Fed Employees walk past, down the hallways. He lowers to the ground, crawls over to the count machine. To the CLEAR TUBE, just above the shredding compartment. His eyes widen as he takes in the sight -- piles and piles of 100 dollar notes. TENS OF MILLIONS OF DOLLARS. From underneath his shirt, he slides out the OVERSIZED ZIP- LOCK BAGS. Clicks open an undercarriage of the tubing, reaches in, and STARTS SHOVING MONEY INTO THE ZIP-LOCKS. INT. NICK'S TRUCK - DAY 118   118  Big Nick tears through city streets. Gus white-knuckles it while riding shotgun. Tony Z in back. Nick keys the radio: CONTINUED: 117   117 (CONTINUED)  Den of Thieves   February 6, 2016 Draft   97 . BIG NICK (into radio) We’ll take north south streets, Fig and Grand. You take east west, 6th and 8th. INT. CROWN VIC - DAY 119   119  Murph drives, haul’s ass. Borracho rides shotgun, on the radio: BORRACHO (into radio) We got it. INT. THE FED CAFETERIA - DAY 120   120  Fed Emplo",
      "dialogue_count": 0,
      "word_count": 1940
    },
    {
      "scene_number": 13,
      "slugline": "INT. THE FED, VENTILATION SHAFT - DAY 127   127  Donnie drags himself to the vent. Next to the vent, in the shaft, IS THE PLASTIC DIN TAI FUNG TAKE-OUT BAG. DONNIE’S POV -- just below is the MEN’S BATHROOM. He’s directly above one of the three toilet stalls. The bathroom’s empty. Donnie takes a deep breath, then pulls up the vent. HE DROPS THE CHINESE TAKE-OUT ONTO THE MIDDLE STALL FLOOR. Stall#2. INT. ARMORED TRUCK - DAY 128   128  Merrimen drives, winding up the circular driveway. Jackson raises the gates, waves “bye” to Merrimen and Enson. Merrimen smiles, gives Jackson a two-finger salute. INT. THE FED, MEN’S BATHROOM - DAY 129   129  Donnie lowers himself down, WHEN THE BATHROOM DOOR OPENS. He quickly pulls his legs back up. Holds his breath. It’s Johnny. He moves for Stall#1. Sits on the toilet, groans. If he were to look up, he’d see a sweaty bare-chested man hovering over him in the vent, covered in pink hair-gel. But he doesn’t. He’s enjoying his quiet time. Johnny finishes up, flushes, and leaves. Donnie goes for it, quickly HOPS DOWN INTO THE STALL. He pulls his shirt back on. Tries to wipe the gel off of his arms with toilet paper. Flushes it down. He comes out of the stall. Checks himself in the mirror. Wipes sweat from his forehead. Calms himself. This is it. EXT. DOWNTOWN STREETS - DAY 130   130  The Armored Truck pulls up next to Merrimen’s Suburban, parked roadside. Bosco’s at the wheel. Bosco follows Merrimen as they pull out into the streets. INT. THE FED CAFETERIA - DAY 131   131  Doris and Sharon pay Donnie. DONNIE ...one of the guys didn’t come into work. They had me doing all the deliveries. DORIS I’m sorry, I’d tip you honey, but that just took too damn long. (CONTINUED)  Den of Thieves   February 6, 2016 Draft   104 .",
      "characters": [],
      "action_text": "Doris winks at Donnie. Donnie nods sheepishly, leaves. INT. THE FED, WASTE DISPOSAL AREA - DAY 132   132  The WASTE DISPOSAL GUYS toss the MONEY BRICKS into the DUMPSTER. COME IN ON ONE OF THE BRICKS -- a corner of one of the zip- locks protrudes an inch out of the brick. INT. THE FED, HALLWAY - DAY 133   133  Donnie moves toward the elevator, passes the JANITOR. Glances at him. The Janitor is WOLFGANG. INT. THE FED, ELEVATOR - DAY 134   134  Donnie, tension racking his body, can’t stop fidgeting, sweating. The elevator doors open. INT. THE FED CAFETERIA - DAY 135   135  Doris and Sharon, opening all the little take-out boxes. INT. THE FED, WASTE DISPOSAL AREA - DAY 136   136  The HULKING ORANGE WASTE MANAGEMENT TRUCK beep-beeps as it backs up to the dumpsters. ALEXI hops out, lowers the lifting arms, and unloads the dumpster into the belly of his truck. INT. THE FED, LOBBY - DAY 137   137  Donnie approaches the EXIT MAN-TRAP. The man-trap opens. Donnie enters, waves nicely to the SECRET SERVICE GUARD out front. Looks at the red light, waits for it to turn green. ON THE SECRET SERVICE GUARD -- checking the SIGN-IN SHEET. DOESN’T SEE DONNIE’S NAME. Furrows his brow. ON DORIS and SHARON-- digging into the food, taking famished bites. Sharon stops chewing. Spits the food out into a napkin. Looks up at Doris in disgust. Doris shrugs: DORIS What? Damn you’re finicky. DONNIE -- waiting in the man-trap. Eyeing the light. Still red. SECRET SERVICE GUARD -- flipping through the sign-in sheet. Looking for Donnie’s name. Confused. GLARES AT DONNIE. SHARON -- she’s on her cell-phone, pissed off. CONTINUED: 131   131 (CONTINUED)  Den of Thieves   February 6, 2016 Draft   105 . SHARON I wait almost 2 hours and when it finally comes it’s cold?! What kind of bullshit - COU-CHI’S VOICE - ma’am! Ma’am. I sorry. I got no oder fom you today. No oder. You never call. SHARON We never called?! INT. THE FED, LOBBY - DAY 138   138  Secret Service Guard still stares at Donnie, when the PHONE",
      "dialogue_count": 0,
      "word_count": 1151
    },
    {
      "scene_number": 14,
      "slugline": "EXT. VERNON STREETS / VERNON CITY DUMP - DAY 144   144  The Orange waste management Truck turns down a small side- street, nears the VERNON CITY DUMP. Crosses an alley that intersects the street. THE ARMORED TRUCK EMERGES FROM THE ALLEY, CUTS THE ORANGE TRUCK OFF. The Orange Truck’s brakes lock up. Squeal to a halt. Behind, the Suburban SANDWICHES THE ORANGE TRUCK IN. Bosco jumps from the Suburban, HK in hand. Runs up to the Orange truck’s cab, points the HK inside. BOSCO GET OUT! The Driver takes one step out, when Bosco BRINGS THE BUTT OF THE HK ACROSS HIS SKULL. The driver collapses in a ball. Bosco jumps into the truck’s cab, Enson into the Suburban. All 3 vehicles tear away from the scene. COME IN ON THE WASTE MANAGEMENT DRIVER, grimacing in pain. Only it isn’t Alexi. IT’S BAS. EXT. DOWNTOWN STREETS - DAY 145   145  ON DONNIE -- nearing the Verizon Van. Mack appears next to it, meets eyes with Donnie. Then Mack suddenly backs up. Donnie spins. A VEHICLE ALMOST RUNS HIM OFF THE ROAD, slams to a stop. Donnie jumps to avoid getting hit. Doors open. Donnie is grabbed, tossed in. Abducted in seconds. Mack turns away, plays it off as if uninvolved. The vehicle takes off. Nick’s F-150. EXT. “PACIFIC AUTO SCRAP & SALVAGE”, SOUTH GATE - DAY 146   146  A sprawling, neglected junk yard. Scraped cars stacked 5 high. The Armored Truck pulls into the yard, the Suburban and Orange Truck right behind it. They all come to a stop. SAMOAN MAFIA, Enson’s bros, receive the Armored Truck. Merrimen jumps out of the Armored, retrieves his gear. Enson nods to his Samoan boys. THEY IMMEDIATELY START TO STRIP-DOWN THE ARMORED TRUCK, make it disappear. INT. NICK'S TRUCK - DAY 147   147  Tony Z roughs Donnie up in back. Nick looks at their captive. (CONTINUED)  Den of Thieves   February 6, 2016 Draft   108 .",
      "characters": [],
      "action_text": "Donnie’s scared, confused, can’t believe he got burned. Nick has had it. He lets go of the wheel, lurches back at Donnie, attacks him, pounds his face. BIG NICK ASSHOLE, WHERE IS HE?! Nick tears at Donnie’s shirt, and in the process RIPS THE MIC AND A NEXTEL TRANSMITTER FROM DONNIE’S WAIST. Nick looks at it briefly. Then throws it out the window. ON MERRIMEN -- loading gear into the Suburban, when he hears the commotion over the nextel. He strains to hear more closely, but the line goes dead. ON NICK’S TRUCK -- Donnie is curled into a defensive ball. Blood pours from his mouth. Tony Z cuffs Donnie’s right hand to the door handle, jams a gun into gut. TONY Z Game’s up, that’s it. DONNIE Pacific Salvage. Junk yard in South Gate. Donnie looks to them. They to him, making sure this is solid. DONNIE (CONT’D) That’s our rally point. Ditching the truck there. They’ll get there any minute, if they’re not already. Nick and Tony Z share a look. It’s solid. Nick steps on it, gets on the radio. Gus brings the location up on their GPS. BIG NICK (into radio) Pacific Auto Scrap and Salvage. Alameda Corridor, South Gate... ON MERRIMEN -- Nextel suddenly crackles in Merrimen’s ear. MACK (over nextel) Repeat Offender, Ghetto Bird. Peckerwood is burned, over. Merrimen pushes the nextel deeper into his ear: MERRIMEN (into nextel) Repeat?! CONTINUED: 147   147 (CONTINUED)  Den of Thieves   February 6, 2016 Draft   109 . MACK (over nextel) Peckerwood is burned! They got him. Merrimen stops, squeezes his eyes shut. MACK (CONT’D) (over nextel) But I’m clean. Where am I going man?!! Merrimen pauses, doesn’t respond. Then he clicks off. INT. CROWN VIC - DAY 148   148  Murph and Borracho listen to Nick’s lead over radio: BIG NICK (over radio) ...suspects there now. We’re 5 minutes out. Borracho pulls it up on their GPS. Murph keys their sirens. They slice through and past traffic. EXT. “PACIFIC AUTO SCRAP & SALVAGE”, SOUTH GATE - DAY 149   149  Frantic, focused activity as the Orange Truck is",
      "dialogue_count": 0,
      "word_count": 800
    },
    {
      "scene_number": 15,
      "slugline": "EXT. ALAMEDA CORRIDOR - DUSK 150   150  Semis, Big Rigs, and rush hour traffic pack the main artery into the Port of Los Angeles. The Suburban pushes through aggressively best it can. INT. SUBURBAN - DUSK 151   151  Tension thick as their progress is slowed further by gridlock. Enson checks his watch. Merrimen’s eyes bounce back and forth between the road ahead and the rear-view mirror. Bosco passes out their travel docs and passenger manifest. Traffic grinds down to complete stop. Merrimen’s eyes are now pinned to the rear-view. Bosco starts to peel off his armor. MERRIMEN Keep your vest on. Bosco stops. He and Enson look to Merrimen. MERRIMEN (CONT’D) About 30, 40 cars back...Look. Enson tenses, follows Merrimen’s gaze, looks back. ENSON’S POV -- through the exhaust and congestion behind them, buried in deep traffic, is a vehicle we recognize. NICK’S F-150. Both Enson and Bosco turn, strain to get a cleaner view. BOSCO Is it?! ENSON (to Bosco) Give me that. Enson motions to one of the HK-416s. Bosco hands it over. Enson raises it, looks through the gun’s sight at the F-150. ENSON (CONT’D) Motherfucker. INT. NICK’S F-150 TRUCK - DUSK 152   152  ON BIG NICK -- eyes locked on the Suburban ahead. Their visual is occasionally blocked by Semis. Gus and Tony Z tighten their vests, check their mags, flip safety off. (CONTINUED)  Den of Thieves   February 6, 2016 Draft   111 .",
      "characters": [],
      "action_text": "BIG NICK (into radio) Be advised, they’re wearing full body armor. No center mass shots. Aim for limbs and vitals only. BORRACHO (over radio) 10-4. The gridlock reaches them. They grind to a halt. INT. CROWN VIC - DUSK 153   153  Murph edges the car into the far right emergency lane, overtakes a chunk of traffic. Gets a visual on the Suburban. BORRACHO (into radio) Coming up on suspects’ 4 o’clock! Move on suspects from their rear! Borracho gets a clean view of the Suburban 3 lanes over and just ahead. Taps Murph’s arm: BORRACHO (CONT’D) Here here here! Murph throws it into park. They grab carbines and extra mags. INT. SUBURBAN - DUSK 154   154  Enson and Bosco’s heads are on a swivel, search the traffic behind for incoming threat. Enson spots something, what looks like movement between cars -- COPS GETTING OUT OF THE F-150. He slams his fist into the dash in frustration. Merrimen grabs Enson by the arm, hard. MERRIMEN Hey! Enson slaps Merrimen’s hand away, turns melancholy. ENSON What did I tell you? What did I tell you?!! Merrimen glares at him, then raises his eyebrows, questioning his manhood. All said without words. Merrimen motions to the adjacent neighborhood, and the myriad ways to flee. MERRIMEN Go ahead... I’m not ditching. CONTINUED: 152   152 (CONTINUED)  Den of Thieves   February 6, 2016 Draft   112 . Enson’s eyes burn hot. He doesn’t blink, doesn’t take his eyes off of his lifelong teammate, and crimey. Then, his eyes glaze over, as resignation sets in. Enson turns to Bosco: ENSON Give me the 48. Bosco passes Enson the 7.62cal MK48 machine-gun. Enson clips on the MK48 ammo box, opens the feed-tray and chambers the link, slams it closed, and yanks the charging handle to the rear of the gun. Ready for war. EXT. ALAMEDA CORRIDOR - DUSK 155   155  CAMERA PUSHES LOW AND STEADY thru the traffic toward the Suburban. ONE BY ONE, NICK AND THE COPS MOVE INTO FRAME, crouched low, using the vehicles as cover. They signal one another, spread out into different lane",
      "dialogue_count": 0,
      "word_count": 4034
    }
  ]
}