{
  "slug": "destroyer-2018",
  "title": "destroyer",
  "genre": "action",
  "format": "film",
  "scenes_count": 11,
  "characters_count": 0,
  "characters": [],
  "total_words": 14596,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. FBI CONFERENCE ROOM - 17 YEARS AGO - NIGHT  A spread of dossiers and files on a conference table. Someone’s hand, picking through them.  LAWSON  Local scene is several loosely connected groups, gangs, “anarchist collectives,” whatever-the-fuck, comes out of the music and drug scenes.  INT. HOUSE SHE GREW UP IN - FLASHBACK - 17 YEARS AGO - DAY  The younger Bell, just over her shoulder, breath rising and falling. She moves through a beaten desert house, dark in the daytime. Glimpse of TV flashing, silhouettes on a couch, two young men, unmoving. Her brothers? They pay her no mind.  INT. FBI CONFERENCE ROOM - 17 YRS AGO - CONTINUING - NIGHT  LAWSON Mostly drug related, but guns are starting to flow through and we think there’s a hard center in there somewhere that has moved into armed robbery, planning more, interested in affiliating with some of the Bureau’s bigger targets regionally.  INT. BELL’S ROOM - CONTINUOUS - 17 YEARS AGO - DAY  Her old room. A bit trashed, nothing’s moved here in a very long time. Bell quickly rifles through drawers, not wanting to be here. Grabs a few things. We notice an old punk t- shirt.  INT. DINER - FLASHBACK - 17 YEARS AGO - DAY  Chris and Bell sit across from each other. Look and demeanor changed. Bell wears the shirt, has chopped her hair ragged.  INT. FBI CONFERENCE ROOM - 17 YRS AGO - CONTINUING - NIGHT  LAWSON We’re placing our agent undercover as a team with a local asset. Sheriff’s Deputy. This is her.  30.",
      "characters": [],
      "action_text": "AN IMAGE INTRUDES : Bell’s service portrait, her in uniform. AGENT This girl? Really? LAWSON She’ll look right enough next to our guy.  INT. DINER - FLASHBACK - 17 YEARS AGO - DAY  Chris and Bell don’t speak. Chris rolls and unrolls the paper wrapper from a straw. Bell’s twitchy energy is very different from what we know of her today.  INT. FBI CONFERENCE ROOM - 17 YRS AGO - CONTINUING - NIGHT  LAWSON One of our CI’s has a cousin in one of the groups, this kid by the name of Toby Heath. The CI will make the introduction.  INT. DINER - FLASHBACK - 17 YEARS AGO - DAY  We see the INFORMANT COUSIN sliding into the booth, greeting Bell and Chris. TOBY slides in next to Chris. Toby is young, skinny, nervous, in a sleeveless punk t-shirt. TOBY Wanna come to a party? He looks at Bell. She smiles. Suddenly, music, getting very loud, very fast.  EXT. GANG HOUSE - 17 YEARS AGO - DAY  We move toward a shabby house, windows completely blacked out, junk-strewn yard, fire burning in a metal drum.  INT. GANG HOUSE - 17 YEARS AGO - SAME  Bell and Chris enter the packed house, smoke hanging in the air. Music overdriven, so loud it distorts. A couple people push out past them. Toby moves into frame, arms around their shoulders.  31. TOBY Let’s meet the man. They walk. We are in Bell’s POV as they come around a corner to the living room, where everyone is looking at someone. Silas. Finally he looks up. Lets us see his eyes. Close on his eyes. They could make you do anything.  EXT. TOBY’S MOTHER’S HOUSE - PALM DESERT - MORNING  A battered, nondescript bungalow. A few tchotchkes by the door work hard to liven things up. We watch from afar as Bell approaches the door. It’s answered by an OLDER WOMAN. And after a brief conversation, she lets Bell inside. MOTHER (O.S.) Toby, you’ve got a visitor.  INT. TOBY’S MOTHER’S HOUSE - LIVING ROOM - CONTINUOUS  There’s a hospital bed in the living room. A TV plays. TOBY (late 30’s) unshaven, lies in the bed. Cancer. He’s been through the wringer, but",
      "dialogue_count": 0,
      "word_count": 2148
    },
    {
      "scene_number": 2,
      "slugline": "INT. IGLESIA CHRISTO RESUCITADO - NIGHT  Bell walks into the church. People are picking up, folding up metal chairs. People look at her, she looks at them. A small knot of people talking to the preacher .  She approaches them. A man steps forward. MAN Can I help you? BELL Yes, I hope so. I was told... that here I could... She puts on a nervous face. She’s a good liar. BELL I need to see Arturo Guerrero. The man’s expression falls for just a moment. MAN No, I’m sorry. BELL Please. I know he’s here. MAN He isn’t. How did you find us? Who sent you here? BELL I was told not to say. MAN I don’t think we can help you. One of the other people starts to head down a hallway. Bell grabs his arm to stop him. BELL I need help. Alba, she takes care of my kids. They are going to deport her. I don’t know what to do... I can pay. I can pay... The people exchange looks. MAN I’m sorry. There’s other places you can go. 42.",
      "characters": [],
      "action_text": "BELL I can’t..! I have to... Voice lower: BELL Because of my job. I work for the government. He studies her for a moment. Then: MAN Ok. It’ll be a minute. You can follow me. BELL Thank you. He goes down a hallway. She follows.  INT. HALLWAY - CONTINUOUS  A short hallway. At the end, an office door. The man gestures for Bell to sit in a chair against the wall. She remains standing. She watches the door. A woman comes out, holding a folder of papers. She turns back, embraces the man who has followed her out of the office. Arturo.  INT. GANG HOUSE - 17 YEARS AGO - DAY  In the past, Arturo suddenly looks up.  INT. HALLWAY - CONTINUING  Arturo looks up through the door, seeing Bell. Like seeing a demon. A furie. He backs into the office. BELL Arturo! She starts running. Pulls her gun. 43.",
      "dialogue_count": 0,
      "word_count": 335
    },
    {
      "scene_number": 3,
      "slugline": "INT. OFFICE - CONTINUOUS  In Bell’s POV: She bursts through the door. Movement, she swivels. Gun up-- -- a woman covers her face and screams, dropping folders-- -- while across the room a door bangs open. Arturo is out. Bell runs.  EXT. COMMERCIAL STREET - SAME  Bell runs after Arturo up the street. Shuttered businesses, acid streetlight, few people. Arturo darts onto a residential street. Bell follows. When she turns onto the street, she can’t see him anymore. Two ways he could have gone. One direction, an alley and bungalows. The other a long driveway. She goes down the alley.  EXT. ALLEY / SIDES OF HOUSES - CONTINUOUS  Bell moves through the dark. Sound of her breath. She’s lost him. Swallowed by complete dark until-- Motion detector tripped, floodlights up in the alley. BLINDING LIGHT catches Arturo turning the corner. She runs after him.  EXT. END OF HOUSES / SCRUB HILL - CONTINUOUS  Bell is fixated. Chasing him farther from other people. Farther from help. Headlong and undeterred by what she might be headed for. 44.",
      "characters": [],
      "action_text": "Arturo reaches the end of the row of houses, which abuts a scrub hill. Arturo scrambles up into the scrub. Running out of breath. Looks behind him, hoping she’s gone Bell is still there, slowing, but not stopping. BELL Arturo. He runs. Leaving the pool of light.  EXT. SCRUB HILL - CONTINUOUS  Suddenly in the wilderness, Arturo keeps going. Stumbles, rolling his ankle Cries out Leading Bell to the next hill.  EXT. ELYSIAN PARK - HILLSIDE  This one is steep. He climbs desperately Bell gaining Sound of helicopters and the wild leaking in Arturo now almost crawling. BELL Arturo. Bell following. An existential climb. BELL Just stop. He climbs. BELL Just fucking stop. 45. She reaches up to try to grab him. He kicks out at her, rubble clattering down. Kicks again. She fends it off. He reaches the top, throws himself onto  EXT. VICTORY GROVE PARK - CLEARING  He staggers a bit farther, slips. She’s on him. ARTURO Please. I don’t know why you’re... Arturo shrinks from her. ARTURO You don’t need to do this. I’m out, I’m so far out. BELL Where is he? He looks at her, confused. BELL Silas. ARTURO Silas? She nods. ARTURO I don’t know. Gone I thought. BELL Well, he’s back. And you know what happens. Arturo breathes. BELL How do I find him? ARTURO I’ve been hiding all this time, Bell. Hiding from   him . I don’t talk to anybody. BELL You don’t have to save anything for later, man. You can just help me. 46. ARTURO Save for what? BELL For a plea. I’m not arresting you and I’m not giving you to anybody. You understand? ARTURO Okay. BELL I don’t care about you. I need to get him. Bell looks at him closely. He looks scared of her. He shakes his head, puts his head in his hands, grabs handfuls of hair. ARTURO There’s a lawyer, DiFranco. BELL Okay. ARTURO He helps launder the money and distributes it. Petra sees him for that every once in a while. Petra’s still with Silas.  A FLASH:  INT. GANG HOUSE - 17 YEARS AGO - DAY  Petra stares directly at us. A hungry, unnerving 20 year old woman. ",
      "dialogue_count": 0,
      "word_count": 2311
    },
    {
      "scene_number": 4,
      "slugline": "INT. BATHROOM - CONTINUOUS  Bell braces herself on the counter, hacking. Tears come, but she chokes them down, unwilling to give in. A long moment as she collects herself. A knock on the door. Bell takes a deep breath. Her eyes fall on the stone soap dish. Bell takes it in her hand, opens the door-- BODYGUARD Oka... -- and smashes it into the bodyguard’s temple. As he reels, she hits him again. He crumples. Bell takes her gun back. Heads back toward the patio.  EXT. PATIO - CONTINUOUS  DiFranco has moved out on the lawn to watch his son. Bell closes the distance fast, still holding the soap dish. Ryan notices her first-- RYAN Dad!! DiFranco turns, too late. His eyes barely register alarm before Bell punches him across the face. He falls hard to the grass, his cheek open and gushing. Bell doesn’t stop, delivering a series a vicious blows. RYAN (O.S.) Stop! Stop! In the cage, Ryan backs away, fumbles for his phone. DiFranco sputters, furious-- DIFRANCO NO! Don’t fucking call anyone! BELL Yeah, don’t call. Your dad probably hasn’t hidden things as well as he should’ve. Bell takes out her gun-- DIFRANCO Please. Please... 57.",
      "characters": [],
      "action_text": "-- she keeps it at her side, watchful of the house and Ryan. BELL Here’s where I’m smarter than you... I don’t think I have Silas under control. You think you’ve got any choice with him? He’s controlling you. You’re his. DiFranco looks weak, scared. A tough guy who’s never been hit. BELL He’s out of money, isn’t he? He hesitates. She moves like she’s going to kick him. DIFRANCO Almost. Yes. BELL You better hope whatever he’s planning pays off. You think he’s going to let the payouts stop? DiFranco shakes his head, resigned. BELL When’s the next drop? DIFRANCO Next Wednesday, Griffith Park. Near the Merry-Go-Round. BELL Move it up to tomorrow. You’re going to do it the same as you always do. I’ll be recording it. Anything goes wrong, any tip-off or something like that, it goes right to the FBI. Got it? DIFRANCO Silas won’t be there. It’s always Petra. Ryan stares on, paralyzed. Bell gestures to the kid, looks down at DiFranco. BELL You teaching him to be a piece of shit like you? 58. DIFRANCO No... no, he’s a good kid. She walks away. After several steps, turns back to him. BELL You don’t get it. I’m trying to help you, too.  INT. BELL’S HOUSE - BEDROOM - NIGHT  Bell enters her bedroom. She coughs violently, wincing. Feels her lower back, where she was hit. Suddenly-- BLACK She finds herself on her knees, half on the bed, half on the floor. BLACK She sleeps.  EXT. GANG COMPOUND - THE PAST - NIGHT  Darkness but for fire light. Others sleep. Only Silas and Bell awake. We see them very close, so that it takes on the feeling of a dream. SILAS Look at that face. Little dog. You’re hungry. He kicks a small log back onto the fire. SILAS Hungry little mutt. You want. BELL Like what? SILAS You want us. A family. BELL What else you want to tell me about myself? SILAS You’re a liar. You’re a user. That’s how you survive. That’s what turns me on.  59. The statement isn’t overtly sexual. It’s flat, just an observation. SILAS You used to being noticed for what you are? She studies",
      "dialogue_count": 0,
      "word_count": 720
    },
    {
      "scene_number": 5,
      "slugline": "INT. EXAM ROOM - CONTINUOUS  Bell enters, followed by Ethan. Shelby is on the bed, wrist in traction. BELL Jesus Christ. A fight? SHELBY Don’t worry, I’m okay. BELL Don’t give me that shit. You think I don’t care? SHELBY Hard to tell. Bell forces herself to take a breath. BELL Tell me what happened. SHELBY Nothing. BELL Shelby. SHELBY Nothing! What, we were at this club, and out of nowhere this guy starts being a dick to Jay. BELL Out of nowhere. SHELBY Whatever. So Jay gets into it a little with this guy and like his girlfriend starts filming it, threatening all kinds of shit. So I just tried to take her phone... and she fucking starts hitting me, and we got all tangled up and I fell on my wrist... so now I’m here. Silence. ETHAN The police weren’t involved, so this is it. We gotta go to a orthopedist tomorrow morning to get a permanent cast. 61.",
      "characters": [],
      "action_text": "BELL What club? SHELBY Huh? BELL What was the club? SHELBY (shrugs) Some place on Cahuenga. BELL What’s its name? SHELBY I don’t know. Bell looks around, spots the plastic bag of Shelby’s effects. She rummages through it, finding her wallet. SHELBY Hey. Hey! Bell snatches a card from her wallet, holds it up to her. It’s a fake ID. BELL Pathetic. SHELBY Bitch. ETHAN Hey. Bell says nothing, just looks at Shelby, who won’t return her gaze. BELL You’re in over your head, Shelby. Where do you think this ends up? Silence. Bell hands Ethan the ID, heads toward the door. Before she exits, to them or no one: BELL So who’s gonna be accountable? She’s gone. Shelby looks at Ethan. He holds up the ID. ETHAN Come on, use your fuckin head. 62.",
      "dialogue_count": 0,
      "word_count": 297
    },
    {
      "scene_number": 6,
      "slugline": "EXT. HOSPITAL - NIGHT  Bell exits the emergency room into the night, in her own angry world. She notices Jay a ways away, near a different entrance, leaning against a wall, smoking. He smirks at her. Rolls away and heads into the hospital. Suddenly, from behind her: VOICE (O.S.) Hey. She turns, quickly. Sees who it is. BELL The fuck, Antonio. Approaching, Antonio nods toward the hospital. ANTONIO My friend at Hollywood caught the call. Why aren’t you picking up your phone? She keeps walking. He follows. BELL I told you I needed a minute. ANTONIO I got an Special Agent in Charge calling me from the FBI, pushing me on what you’re doing, where you are. What’s that about? BELL Old friend. ANTONIO Taz Furner all hot, saying you are holding his shit for some reason? BELL I’m working. ANTONIO You need to deal me in. BELL Listen, I’m looking out for you here.   (MORE) 63.",
      "characters": [],
      "action_text": "This thing I’m on-- this guy I’m looking for-- I own it. Just me. Okay? Can you hold on for a bit? He nods. She walks away. BELL I’ll see you.  EXT. GRIFFITH PARK - DAY  We move into Griffith Park. Families here, regular life. We find Bell. From a distance, in her car, she watches the carousel. Difranco arrives. Waits. Bell watches him until a woman slowly approaches. It’s Petra.  EXT. DESERT - 17 YEARS AGO - DUSK  FLASHBACK Bell and Petra laughing in the back of a desert pickup as it bounces over dunes, rifle at Petra’s hip.  EXT. GRIFFITH PARK - DAY - CONTINUING  She has a feral quality, a threatening looseness. Bell watches for any communication between the two. DiFranco says nothing. He has a bag for her, which he puts down next to her. DiFranco leaves. Petra takes the bag and walks toward the parking lot, toward a waiting car.  EXT. PARKING LOT - SAME  Petra gets into the car, driven by someone else. Bell follows them as they drive out.  EXT. ROAD / APARTMENT - SAME  Bell follows them toward Glendale. BELL (CONT'D) 64.",
      "dialogue_count": 0,
      "word_count": 348
    },
    {
      "scene_number": 7,
      "slugline": "EXT. STREET - GLENDALE - LATER  The car parks outside an apartment building. Petra and the driver, a young man, go inside. Bell parks her car. She watches the door. No one comes out.  INT. CAR - PETRA’S STREET - NIGHT  Bell is still watching. In Petra’s place, lights in the window go out. Bell sits in the dark, waiting.  TIME CUT : Bell still there, later, seen through windshield smeared by light overnight rain.  INT. GANG HOUSE - THE PAST - DAY  Moving down a hallway, Bell, high, finds a partially open bedroom door. She stops, watching through the crack. Inside, Silas rocks back and forth, Petra’s forehead against his. SILAS How big? PETRA Very, very fucking big. Huge money. SILAS It’s for sure? PETRA From my dad’s friend. It’s real. Their voices continue as we cut to Bell walking down the hallway, toward the living room, where people nod out, bullshit, listen to music. Chris among them, using. Enmeshed in the group, in every way.  LIVING ROOM  We are on Bell’s back as Chris’ eyes flicker up to meet hers. PETRA (V.O.) What do you think? SILAS (V.O.) I think we do it. Chris follows Bell to another bedroom.  65.",
      "characters": [],
      "action_text": "BELL Close the door. He does. She kisses him. They haven’t been pretending for a while now.  INT. BELL’S CAR - PETRA’S STREET - MORNING  With Bell as she watches-- she has been up all night, staking the place out. Petra finally emerges, on the phone with someone. The conversation seems intense. The driver from yesterday follows her out, waits for her to finish her conversation. When she is done the two walk past their parked car... Right toward Bell. She shrinks, slides her gun out. But they are animatedly talking with one another. Still walking in her direction, they stop a few cars short and get into a different car, a Honda. They drive.  INT. BELL’S CAR - FREEWAYS - DAY  We are with Bell as she follows the Honda to the 5, the 105. Signs for LAX. Off at Sepulveda. Driving up the long boulevard.  EXT. STREET / INT. BELL’S CAR - 98TH STREET  Finally the Honda pulls to the curb on a side street. Sits there. Bell pulls over, watching. Inside the Honda, Petra is moving around. Bell can’t see what she is doing. After a few moments, Petra opens her door. Petra gets out, sunglasses on, shoulders a large handbag. She walks around the corner. The Honda pulls away, past her. Bell creeps her car up closer, watches. Petra is now walking up the street. 66. Halfway down the block, Petra finds another woman, younger, greets her. The woman is also wearing sunglasses and a long coat. A sprinter van approaches, stops. Four men emerge. A startling sight. It takes a second to process. They wear masks. They never stop moving, up steps that lead... toward a bank. As the van pulls away... Petra and the long-coated woman pull masks on, rush behind them... Bell stares at One of the men, long, dark hair flowing behind his mask.  A FLASH  EXT. GANG HOUSE - 17 YEARS AGO - DAY  Silas in the past, glancing back at Petra, his hair the same long hair.  EXT. 98TH STREET - CONTINUING - DAY  It’s him. A glimpse of guns coming out and the group is inside. Seconds pass, Bell processing the situation, ",
      "dialogue_count": 0,
      "word_count": 759
    },
    {
      "scene_number": 8,
      "slugline": "INT. LOBBY VESTIBULE - CONTINUOUS  Bell moves into the lobby. Empty guard desk. Strain of the situation evident on her face. She moves to the bank entrance. The blinds have been pulled, covering the glass door and windows. Bell leans carefully to see through an opening in the blinds. BELL’S POV: Customers and a guard on the floor. Silas, visible, speaking loudly, can’t hear what he’s saying. It looks unstable. Imprecise. Bad body language in the younger men and women of the crew. Unsettled. All seen by Bell. INSIDE THE BANK: Shouting. The crew is amped up. Petra tries to calm them. They are all over the place. Money starts to come out in duffels from behind the counter, the vault. Bell watches Silas. Thinking. Managing her breathing.  OUTSIDE ON THE STREET  Behind her. The first unit, a POLICE SUV, approaches, no lights. Stops.  FROM THE SUV  Through the lobby window, the OFFICERS see Bell hunched against the wall by the inside entrance. She holds up her badge. 69.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 170
    },
    {
      "scene_number": 9,
      "slugline": "INT. LOBBY VESTIBULE - CONTINUOUS  The two officers come into the lobby, joining Bell: one MALE with a shotgun, one FEMALE. Bell looks inside as the cops take up positions on the other side of the door. INSIDE: an argument between two of the gang members, standing over the disarmed guard. A gun waved recklessly. One kicks the guard. Situation deteriorating. Then a customer runs for the door. One of the gang members-- CAMO MASK-- steps in front of him. Both are knocked down, sprawling. BELL We have to go now. MALE OFFICER We don’t wait for..? BELL This is a gunfight, you get it?  INSIDE:  The customer’s hands up and shaking. Camo Mask retrieves his gun. Angry.  IN THE LOBBY:  Female cop puts her hand on the door. Bell signals she’s going right. Bell’s gun up.  INSIDE:  Camo Mask lifts his gun, points it at the customer who fled. Inside, people are screaming.  INT. BANK - CONTINUOUS  The cop pushes the door open. Bell moves in. The cops follow her. 70.",
      "characters": [],
      "action_text": "FEMALE OFFICER Police officer...   MALE OFFICER Police get... Camo Mask turns, swings gun up. Bell fires a burst. Pink mist in the air. Camo Mask, dead weight, straight down to the floor. Screams start. Bell finds Silas as he runs toward the back. Fires, misses, he’s gone. Both cops still shouting. Bell advances, behind check-writing kiosk, ducks just as rounds hit right above her head. Sizzling sound. The female cop is trying to move up with Bell as panicked people run past her toward the door. Bell pops up. Gunfire chews up the kiosk. She ducks back down. Leans around the side Fires three bursts. Wild fire in return. The male cop fires his shotgun. Hits the long-coated woman in the upper torso and neck. She staggers back, falling over a crawling customer. Silas is moving toward the back door. A gang member near Petra fires, hitting the male cop, who falls to one knee. The cop’s partner drags him behind a planter. Bell advances, exposing herself to fire, blasting away at Silas. He’s ducking through an office Bell ducks behind a desk. 71. Petra and the two remaining men are firing at her And then they disappear into the back, the same way Silas went. A moment of quiet. Moaning Crying Crunch of glass. Bell pops up. All gang members are out. She moves Glances at an unmoving body: Camo Mask soaked in blood. And by the door, past the long-coated woman, who is holding her throat, squirming on the floor. The injured male cop is heard radioing in. The female cop moves up, kneels next to the wounded long- coated woman. And Bell reloads. Can’t see into the office. Has to go in after Petra.  INT. BACK OF BANK - MANAGER’S OFFICE - SAME  Empty. Door to the outside open. Bell moves outside.  EXT. BACK OF BANK / STREET - SAME  Civilians everywhere. Confusion building, still not comprehending. BELL Get down get down! Then Wild shots back up at her from the street. Panic. She scrambles behind a large planter. 72. There is too much background for her to return fire. The van is rolli",
      "dialogue_count": 0,
      "word_count": 4361
    },
    {
      "scene_number": 10,
      "slugline": "INT. BELL’S VAN - 17 YEARS AGO - DAY  We see them pull on masks, one by one, in slow motion. The conversation at the diner INTERCUTS with this. BELL (V.O.) While we were at the first-- the jewel repository in the file-- they were already hitting the second. It was over when we got there. CHRIS (V.O.) We take full responsibility for losing contact, but...  INT. DESERT DINER - THE PAST - CONTINUING  Bell looks directly at Chris, reciting the words without emotion. BELL There was no forewarning and we believe we did nothing to cause them to mistrust us. A moment. BELL Okay? CHRIS You’re a good fucking liar.  INT. BELL’S VAN - OUTSIDE THE BANK - 17 YEARS AGO - DAY  Outside the desert bank, Bell and Chris look at each other through the windows of their respective vans.  INT. DESERT DINER - THE PAST - CONTINUING  CHRIS He’s got us driving on the day. That’s good. We’ll be outside. BELL Masks anyway.  95.",
      "characters": [],
      "action_text": "CHRIS We get to the meetup, take our share, they all scatter. We come back to the scene, tell our story. BELL We do the after-action reports, go through the motions for a while until it quiets down enough to quit. Then we’re gone.  INT. BELL’S VAN / BANK PARKING LOT - 17 YEARS AGO - DAY  As Silas gets out of his van, he sees Bell through her windshield, an unnerving half-smile as he pulls on his mask. Silas says something to Chris through the driver-side window. Chris gets out, pulls a mask on. He doesn’t look happy about it. A change of plan. Arturo takes Chris’ place behind the wheel. They move toward the bank. Chris glances back, through his mask, at Bell. CHRIS (V.O.) Something goes wrong, then what? BELL (V.O.) We break cover, call it in ourselves. Make arrests when responders get there.  CHRIS (V.O.)  We have to work that story out too. We say they took our phones, we made the first move we could. She watches him go inside.  INT. DESERT DINER - THE PAST - CONTINUING  On BELL : certainty. BELL Yes.  INT. BELL’S VAN / BANK PARKING LOT - 17 YEARS AGO - DAY  She watches from the van as it starts to go down.  96. Faster cuts. The chaos of memory and extreme emotion, both what Bell can see through the windows and her projection of what she can’t.  INT. BANK LOBBY - SAME  The images come. - They take control of the bank. - We focus on a young TELLER, a girl probably just out of high school. She is shaking. We follow her throughout this, always aware of where she is. - Gang members pull bags out of the vault. - Employees shove money and other items into the bags. - Chris, masked, watches, anxious. - The teller is crying as she loads the bags. - Petra stalks in front of the vault. PETRA Come on, come on! - The gang members leave with loaded duffels. Silas is the last to leave the bank. To the teller: SILAS No dye packs in here? She is too scared to respond. SILAS It’s clean? He walks out the door.  EXT. PARKING LOT - DAY  Bell watches them exit, throwing bags in both v",
      "dialogue_count": 0,
      "word_count": 2157
    },
    {
      "scene_number": 11,
      "slugline": "EXT. DIFRANCO’S HOUSE - FLASHBACK - DAY  Bell at DiFranco’s, storming back onto the lawn. DIFRANCO (V.O.) You’ll never touch Silas. Because he’s in your head. And he’s smarter than you.  INT. TORRANCE BANK - FLASHBACK - DAY  Bell firing at the fleeing Silas in the bank. PETRA (V.O.) He’s never gonna let you take him. He owns you just like he owns me. BELL (V.O.) No.  EXT. GANG COMPOUND - 17 YEARS AGO - FLASHBACK - NIGHT  The younger Silas at the campfire, where we saw him and Bell. SILAS Nobody’s fucking watching. ON BELL: Losing the fight to stay closed to him. Her composure breaking. He’s telling her the truth. SILAS But I see who you are.  EXT. BOWTIE PROJECT PARK - NIGHT - CONTINUING  Bell FIRES. Again. She shoves a handful of marked bills into his chest as he reels backwards, fires again. Silas’ legs give way and he DROPS. He’s dead, in the position we saw the body in the opening. Silas is the body. He is the victim. And Bell is the killer. We have been watching the plotting of a crime, not its investigation. Bell stands over his lifeless body for a long moment. She drops the gun near his body. 108.",
      "characters": [],
      "action_text": "BELL (V.O.) What about if I know who did this? As Bell crouches down, looking at the bills scattered around him, DISSOLVE TO--  EXT. BOWTIE PROJECT PARK - MORNING  -- Bell, now at taped-off crime scene. BELL What about if I know who did this? We follow her away, exactly as we saw in the beginning.  INT. BELL’S CAR - SAME  She sits. She tries to put her keys in the ignition Fumbles them Starts to reach to pick them up, gives up. Sinks back into her seat. She pulls up her shirt Chest and abdomen swollen and purple Spreading darkness underneath, internal bleeding. Very bad. Outside, the skateboarder’s efforts catch her attention. She looks out the window. Her eyes flutter.  CHRIS (V.O.) It’s a bad idea. BELL (V.O.) I’m tired, Chris...  EXT. TACO SHACK - INDIO - DAY  The continuation of the conversation we saw earlier-- Bell is vivid and alive in the resentment that has led her here.  109. BELL I’m tired of scrapping... my whole fucking life. Jealous and hungry and scared. I want to spend one day on the other side of that... CHRIS I know. That’s me too. But this isn’t the way. BELL Please. Please. You gotta give me this, Chris. I need this... Silence, Bell grows defiant. BELL You want me to say it, I’ll fucking say it. Do it for me, okay? Do it for me. For us. Chris looks at her for a long moment. CHRIS Do you love me? BELL You know I do. CHRIS Because if we do this... you gotta promise me you’re not going anywhere. It’s you and me. ‘Cause that’s the only reason... She throws her arms around him. BELL Fuck yeah, I’m in. CHRIS Anything goes wrong... Anything. Someone gets their hair mussed... we pull the pin. We identify and shut it down. Okay? And we accept the consequences. BELL Yes. Yes. CHRIS No one gets a fucking scratch.  110. BELL The plan is good. It’s good. As if to convince himself, he kisses her, keeps her head in his hands. CHRIS I’m doing this for you. Only you. BELL I know. I know. I love you. CHRIS I love you too. They look at each other, everything sinkin",
      "dialogue_count": 0,
      "word_count": 990
    }
  ]
}