{
  "slug": "dickinson-101-because-i-could-not-stop-2019",
  "title": "dickinson 101 because i could not stop",
  "genre": "thriller",
  "format": "series",
  "scenes_count": 4,
  "characters_count": 0,
  "characters": [],
  "total_words": 6190,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. PARLOR - DAY Mrs. Dickinson sits in the parlor drinking tea with the suitor, GEORGE. George is gawky, but cute -- a Jesse Eisenberg type. Mrs. Dickinson sips her tea, embarrassed. MOTHER She’ll be down in a moment. I do apologize. GEORGE (awkward) Oh - no worries. Now Emily makes her entrance. She has brushed her hair so that it all HANGS IN FRONT OF HER FACE. Like Cousin It. She looks like a woman walking backwards. She looks insane. She walks into the room slowly, her hair blocking her vision. EMILY (dramatically) Hello. Mrs. Dickinson gasps. MOTHER Emily - cut that out! Emily laughs, and flips her hair back, so she can see. Then she looks at the suitor. She recognizes him. EMILY Oh, for fuck’s sake. George?! GEORGE Hey, Emily. Mrs. Dickinson is baffled. MOTHER You have already made my daughter’s acquaintance? EMILY Mom, this is   George . He’s in the lit club with Austin. We hang out all the time. Mrs. Dickinson’s hand is trembling on her teacup. 8.",
      "characters": [],
      "action_text": "MOTHER Well. I was just telling   George  here what an excellent   wife   you will be. How frugal and punctilious you are in all your duties-- EMILY Oh, yeah - I’m a real catch. Emily flops down in an armchair with her legs spread wide apart. Mrs. Dickinson almost faints. MOTHER Sit like a lady! EMILY (rolling her eyes) George, can I talk to you for a second? Outside? George leaps up, eager for a chance to be alone with her. GEORGE Totally! EMILY Cool. Mom - we’ll be on the porch. Try to relax. Emily heads outside. George follows. Mrs. Dickinson looks up at the ceiling, praying for help. EXT. SIDE PORCH - DAY Emily leans against the porch railing. George stares at her adoringly. EMILY Got a cigarette? GEORGE Oh - uh, sure! George takes out a cigarette. Emily grabs it. He scrambles to light it for her. EMILY (inhaling) What are you even doing here, George? 9. GEORGE I just wanted to see you.   (Beat.)   I always want to see you. EMILY You know I’m not going to marry you, right? GEORGE Never say never, Emily. Like you wrote in your poem - “I dwell in Possibility.” EMILY Nice. I love when people quote me. GEORGE Why won’t you marry me? I’m not good enough for you? EMILY You don’t understand - I’m not going to marry   anyone . GEORGE That’s not what your mother says. EMILY I have one purpose on this earth, George - and it is to become a great writer. A   husband   would put a stop to that. GEORGE I wouldn’t. EMILY You say that now, but little by little, you would. Emily stubs out her cigarette. George grabs her by the wrist. GEORGE I’m madly in love with you. EMILY Well - too bad. GEORGE Is there someone else? EMILY Actually - yes. 10. GEORGE Who is he? I’ll kill him. EMILY You can’t kill him. He is Death. GEORGE What? EMILY That’s right. I’m in love with Death. FLASH TO: EXT. FRONT WALKWAY - NIGHT A black CARRIAGE pulled by white HORSES rolls up in front of the Homestead, in the moonlight. Emily waits for it, at the bottom of the steps. We hear a smooth, sexy song -- s",
      "dialogue_count": 0,
      "word_count": 1848
    },
    {
      "scene_number": 2,
      "slugline": "EXT. DANDELION - FANTASY Emily and the BUMBLEBEE sit together on the BRIGHT YELLOW DANDELION, drinking from giant tumblers full of liquor. Emily is WASTED. The BEE is yellow, black, and fuzzy, with big eyes. EMILY It’s so obvious what’s going on here. Austin knows I love Sue and he’s trying to steal her from me. He’s such an asshole. BEE (lighting up a joint) Girl, don’t let this relationship shit get in the way of your career. EMILY That’s so smart. You’re so right. BEE Just make dat honey, bitch. Make dat honey. He hands her the joint, and she takes a HUGE HIT. CUT TO: EXT. CEMETERY - DAY At the funeral of Sue’s sister Mary. A sizable crowd, including all the Dickinsons, stands around the grave as the COFFIN gets lowered into the ground. MINISTER (intoning) “O Death, where is thy victory? O Death, where is thy sting?” Emily is dressed in white, as always. She looks across the grave and sees SUE, dressed in black. Sue is very, very beautiful -- and very, very sad. She wipes a tear away, and gives Emily a small smile. Emily mouths at Sue: “I love you.” Sue looks down at the grave. The minister wraps up his final prayer and men begin SHOVELING DIRT over the coffin. 19.",
      "characters": [],
      "action_text": "Emily fights her way through the crowd, trying to get to Sue, but just before she reaches her friend’s side, AUSTIN beats her to the punch. He takes Sue by the arm, protectively, and leads her off down the hill. Emily stands there, irritated. Funeral guests pass by her on all sides, on their way down the hill. Now, Emily looks behind her and sees A STRANGE MAN. The man is tall, with A STREAK OF SILVER IN HIS HAIR, and a BLACK SUIT. He’s very attractive. The MAN catches Emily’s eye. He WINKS at her. Just then, LAVINIA appears at her sister’s side. She sees Emily staring into the distance. LAVINIA Emily - what are you looking at? Emily, rapt, points. EMILY At him. Lavinia looks where she’s pointing. We see what Lavinia sees, which is NOTHING. LAVINIA What do you mean? That tree? We look again, and once again see what Emily sees - the MAN, who is now walking over towards them. EMILY Never mind, Lavinia. The man comes right over to them. He leans in and whispers into Emily’s ear. MAN See you tonight. Emily nods, blushing. The man walks away. Lavinia is confused, but then, she’s used to her sister being weird. LAVINIA Come on, Emily. Let’s go home. Emily and Lavinia walk together, down the hill. 20. LAVINIA (CONT’D) That was a lovely funeral, don’t you think? Emily shrugs. EMILY Mine will be better. As Emily and Lavinia walk, they pass by a GROUP OF GIRLS, well-dressed and well-coiffed. Emily overhears them, gossiping about her. GIRL Oh my god, it’s Emily Dickinson. The girls all titter. GIRL (CONT’D) She’s so intense. I seriously can not   handle her. Emily pretends not to have heard them. She lifts her chin proudly and marches down the hill with her sister. INT. PARLOR - DAY Austin and Sue sit on the very stiff couch. Mr. and Mrs. Dickinson sit across from them, on two very stiff armchairs. They are all in their funeral clothes. Sue’s face is bleak. EDWARD Well. We are very happy for you. Awkward silence. EDWARD (CONT’D) I mean - we’re very   sorry   about your sister,",
      "dialogue_count": 0,
      "word_count": 1896
    },
    {
      "scene_number": 3,
      "slugline": "EXT. DOOR TO THE KITCHEN - CONTINUOUS Lavinia stands outside the door to the kitchen, wearing an APRON, screaming for her sister. LAVINIA EMILY! COME! MAKE!   DINNER!!!!  BACK TO: EXT. LAWN - CONTINUOUS Emily nods to George. EMILY I gotta go. She hurries off towards the house - but calls back, over her shoulder. EMILY (CONT’D) Thanks again, George! George leans on his mallet, and watches her go. He sighs. INT. KITCHEN - EVENING Pre-dinner CHORES MONTAGE. Fire. Water. Chickens. Emily CUTTING AN ONION, and CRYING. INT. DINING ROOM - EVENING In the dining room, the whole family sits around the table: Mother, Father, Emily, Austin, Lavinia, and Sue. The table is laid with beautiful white china, and there’s lots of delicious-looking food. A KITTEN plays at Lavinia’s feet. Edward tears into a piece of chicken. EDWARD Wonderful chicken, Mrs. Dickinson. Mrs. Dickinson beams. AUSTIN It really is delicious, Mother. 29.",
      "characters": [],
      "action_text": "MOTHER Well - thank your sisters. They helped. LAVINIA One of us did. Emily pinches Lavinia, under the table. Edward clinks on his glass, with a silver knife. EDWARD Now, now, listen here. I have a rather exciting announcement. Everyone looks at him, curious. EDWARD (CONT’D) As you know, in addition to running my successful law practice, as well as maintaining my position as Treasurer of Amherst College, I’ve also served two terms in the Massachusetts House of Representatives. Well - I’ve got my eye on something bigger now. (beat) I have decided to run for Congress. (beat) Of the United States of America. General shock and awe. Mrs. Dickinson looks a bit queasy. AUSTIN Father - that’s marvelous! EMILY Way to go, Dad! Lavinia’s KITTEN, under the table, YOWLS. EDWARD I appreciate the enthusiasm. Your mother was quite opposed to the idea. MOTHER I just don’t want you away from home so much. Candidates are always moving about. 30. EDWARD Well, we’ve got to get out the vote, now, haven’t we? The vote, and the message. SUE What is your message, Mr. Dickinson? EDWARD Mine? Well - it’s simple. Let’s keep the country together, that’s what I say. Let’s not be torn apart. AUSTIN You mean - by slavery. LAVINIA Father, are you an   abolitionist ? EDWARD Of course not. I don’t care one way or the other about slavery. I just don’t think we ought to go to war about it. MOTHER Very sensible, dear. AUSTIN Personally, I think this Fugitive Slave Act is ridiculous. It’s making us regular citizens into slave-hunting patrols. EDWARD You’re right about that. EMILY Sometimes I feel like a slave. Everyone looks at her, horrified. MOTHER You are a spoiled girl from Amherst, Emily Dickinson.   Far   from a slave. Emily takes a bite of chicken. 31. EDWARD Well, it’s a messy business. But we must preserve the Union, at all costs. That’s my platform. Oh - and bring the railroad to Amherst. That too. LAVINIA The railroad! Fancy! EDWARD Yes, Lavinia, if I’m elected, you shall hear the sound of a t",
      "dialogue_count": 0,
      "word_count": 1678
    },
    {
      "scene_number": 4,
      "slugline": "INT. KITCHEN - NIGHT Emily is finishing up the arduous task of cleaning the entire kitchen by herself, after dinner. She is sweaty, dirty, and tired. She wipes a hand on her forehead. Some ASHES from the fireplace SMUDGE her brow. INT. UPSTAIRS HALLWAY - NIGHT Emily trudges upstairs and runs into Austin, in the upstairs hallway. He’s in his pajamas. AUSTIN Another fight with Dad, huh? Emily shakes her head, exhausted. AUSTIN (CONT’D) Don’t be too hard on him, Em. I know he can be tough - but he only wants to protect us. Emily says nothing. AUSTIN (CONT’D) Can I tell you a secret? She looks at him. AUSTIN (CONT’D) I’m happy we’re not moving to Detroit. I feel better here, with the family. Emily gives him a small smile. AUSTIN (CONT’D) Hey - do me a favor. EMILY Yeah? AUSTIN Do what you can - to cheer up Sue. She’s so depressed. I’m worried about her. EMILY Sure. Of course. 39.",
      "characters": [],
      "action_text": "AUSTIN Thanks, sis. The siblings are now interrupted by the appearance of their MOTHER, in her nightgown. MOTHER Emily - get to sleep. We need you up bright and early tomorrow. Another suitor is coming. EMILY Oh, great. Who is it this time? MOTHER A pig farmer, from South Hadley. EMILY Sexy. Austin laughs. Mother shoos them both off to their rooms. MOTHER Go to bed! INT. EMILY’S BEDROOM - NIGHT In the moonlit shadows of her bedroom, Emily lies in her bed, under the coverlet, masturbating. As she touches herself, she fantasizes about being in the carriage again, with Death. She sees herself FUCKING DEATH, passionately riding him as the carriage rolls over the cobblestone streets. Then, just as she’s about to come -- there is a KNOCK ON HER DOOR. She freezes, startled. Another KNOCK. EMILY (from bed) Who is it? The door opens. Standing in the doorway is her FATHER. He’s wearing a nightgown himself, and a knitted nightcap. EDWARD Emily. Are you awake. EMILY (sitting up) Yes, Father. 40. EDWARD May I come in? EMILY Yes, you may. Edward comes in, shuts the door behind him. He sits down on the bed, next to Emily. He waits a beat or two, then speaks. EDWARD I was rather gruff with you tonight. Another beat. EDWARD (CONT’D) I’d hate to think that you were angry with me. She says nothing. EDWARD (CONT’D) You just - you can’t know how I worry about you children. He looks at her. Then, unexpectedly, he BREAKS INTO A SOB. EDWARD (CONT’D) (crying) Oh, Emily! EMILY (disturbed) Father, what is it! Oh, Father, don’t cry! EDWARD I just don’t want to lose you, Emmy. Promise me! Promise me, okay? EMILY Promise you what? EDWARD Promise you won’t get married and move away. Edward clutches Emily’s hand, and stares at her through his tears. It’s touching, though deeply strange. EMILY I won’t leave you, Dad. 41. He smiles. EDWARD Oh, that makes me happy. Keep the family together, that’s what I say. Don’t let it get torn apart. Now Edward lies down in Emily’s narrow bed, beside her. His hea",
      "dialogue_count": 0,
      "word_count": 768
    }
  ]
}