{
  "slug": "doctor-sleep-2019",
  "title": "doctor sleep",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 25,
  "characters_count": 0,
  "characters": [],
  "total_words": 28765,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. CAMPSITE - AFTERNOON A lush campsite, in the woods. A smattering of RV’s and campers, a few TENTS, spaced out from each other for privacy.  Legend: 1980  VIOLET (7) steps out of a small CAMPER, heading away as her MOTHER leans out of the door. VIOLET’S MOTHER Where are you going, Violet? VIOLET Just to pick some flowers! VIOLET’S MOTHER Don’t wander too far! EXT. CAMPSITE, WOODED PATH - MOMENTS LATER Violet moves down the path, stopping to look at some WILD FLOWERS growing beside her. She glances up, seeing SEVERAL RV’S and MOTOR HOMES in a cluster, just visible off the path. We don’t know it yet, but these belong to the TRUE KNOT. Unaware of their danger, Violet heads further down the path. EXT. CAMPSITE, STREAM - LATER Violet emerges into a clearing on the banks of a quiet, pristine river. Sunlight reflecting off the water, lovely wildflowers growing by the bank... She’s startled to see a WOMAN sitting by the water, almost hidden by the overgrowth. Holding a fistful of FLOWERS, throwing pedals into the stream as she sings... ROSE  My wild Irish Rose / The sweetest flower that grows / You may search everywhere / But none can compare with my wild Irish Rose...  She is beautiful, dressed in flowing, strange clothes and a black TOP HAT. She is ROSE THE HAT (looks 30’s, but is so, so much older). She turns to Violet, smiling sweetly. ROSE (CONT’D) Well hi there.",
      "characters": [],
      "action_text": "Violet stares at Rose’s flowers. BRIGHTER, more COLORFUL than the wildflowers she’s found... VIOLET Where did you find those? ROSE Oh, these? I know all the secret places. You want one? Violet doesn’t answer. Studies Rose’s face. She has a sweet demeanor, a KIND, EARNEST SMILE... ROSE (CONT’D) Oh... you’re wondering why I’m wearing such a funny hat. Well I’ll tell you. I   always   wear this hat. So much it’s part of my name now. My friends, my very   best   friends, they just call me “Rose the Hat.” You can call me that, now that we’re friends. VIOLET I like it. It looks like a magician’s hat. ROSE It is! It’s a magic hat, wanna see? Rose removes her hat. Violet watches, her wariness fading. ROSE (CONT’D) Take a look. Nothing in my hat, nothing up my sleeves... Violet STEPS FORWARD again, so that she can see inside the hat. It’s EMPTY. Rose turns it over, shaking it for effect. A SNAPPING BRANCH draws Violet’s attention. She turns, seeing a MAN lurking at the edge of the woods. STARING AT HER. He is CROW (40’s, dressed in dirty clothes.) PERFECTLY STILL. ROSE (CONT’D) Don’t worry, he’s my friend. You’re missing the trick! Reach inside. Violet hesitates... and then reaches her hand out, into the hat... pulling up a HANDFUL OF BEAUTIFUL FLOWERS. VIOLET Wow... they’re so   pretty   -- 2. ROSE Because they’re special. Speaking of special... you’re a little magic too, aren’t you. Rose reaches into the hat, her hand disappearing from view. ROSE (CONT’D) The flower in my hand. What color is it? (off Violet’s hesitation) It’s okay, honey. You won’t scare me. I’m not like mom and dad. VIOLET Purple. Rose smiles, lifting up a GORGEOUS PURPLE FLOWER. Another SNAPPING TWIG, and Violet looks. There are MORE PEOPLE now, standing at the periphery of the woods. ROSE Violet. Like you. She turns. She doesn’t remember telling Rose her name... Rose turns over the hat, and FLOWERS POUR OUT OF IT onto the ground. Violet’s eyes light up. She stoops, picking up a few of them. Rose does th",
      "dialogue_count": 0,
      "word_count": 2462
    },
    {
      "scene_number": 2,
      "slugline": "INT. DEENIE’S BEDROOM - MORNING DAN TORRANCE (mid 20’s now) awakes with a start. Pale, sweaty. His face BRUISED AND SWOLLEN, fighting through one of the worst (and last) hangovers of his life.  Legend: 2000  He’s in a FILTHY APARTMENT, a dirty mattress on a dirty floor. He COUGHS, dry-heaving as he holds his throbbing head. He rolls over, and stops as he sees -- DEENIE (early 20’s, frail and sickly) asleep next to him. Also naked. He stares, trying to remember --  INT. DIVE BAR - THE PREVIOUS NIGHT Blurry flashes. Hazy memories. Dan, downing a shot of whiskey. And another.   Deenie, holding onto him while he shoots pool. DEENIE (slurring) What’s your name again, Cutey...  INT. DEENIE'S BEDROOM - CONTINUOUS Dan stares at her. There’s VOMIT next to her mouth, staining her pillow. As the sight and smell hit him -- INT. DEENIE’S BATHROOM - MOMENTS LATER Dan PUKES into the toilet, spitting out a vile mix of bile and whiskey. Fumbles for the handle, barely manages a flush. He THROWS water on his face, looking up in the mirror AND SEEING THE CUTS AND BRUISES. One eye almost SWOLLEN SHUT. He reaches up, perplexed. Touching the wounds...  INT. DIVE BAR - THE PREVIOUS NIGHT -- More whiskey.   A LARGE MAN trying to pull Deenie away from him. Dan, getting in the man’s face. A PUNCH that lands Dan on the ground. Spitting out BLOOD, getting to his feet - a familiar DARKNESS in his eyes. -- A hand, grabbing a BILLIARD BALL.   Dan, SMASHING THE BALL into the man’s head. Straddling him now, as others SCRAMBLE TO BREAK UP THE FIGHT.   Dan’s hand, smashing the ball into the man’s head AGAIN. And AGAIN. And AGAIN.  11.",
      "characters": [],
      "action_text": "DAN (between blows) You gonna take - your - medicine --  INT. DEENIE'S BEDROOM - MOMENTS LATER Dan STUMBLES, catching himself on the dresser. Looks down at his BLOODY, BRUISED KNUCKLES. HIS HANDS SWOLLEN. DAN Oh god... He looks back at the sleeping girl, and then at THE WHITE POWDER, STILL ARRANGED IN SLOPPY LINES, on the nightstand beside her. NEXT TO THE EMPTY WHISKEY BOTTLE.  INT. DEENIE’S BEDROOM - THE PREVIOUS NIGHT Dan PULLS HARD from the whiskey, WINCING as Deenie SNORTS A LINE OF COKE from the nightstand. DEENIE Holy shit, I think you killed him. What if you killed him. I hope you killed him. I hope you killed him, you hear me? Deenie, STRADDLING HIM NOW. DEENIE (CONT’D) Lemme kiss it better. She kisses him, hard, pushing him back onto the mattress.  INT. DEENIE’S LIVING ROOM - MOMENTS LATER Dan STUMBLES out, pulling his clothes on. Looking at the BLOOD ON HIS SHIRT. Not all of it his... And then he realizes something. He pulls out his WALLET... NO CASH. Digs through his pockets. NOTHING. DAN Fuck. Fuck... He turns his pockets out, frantic now. All of his money, gone, probably snorted by the naked girl in the other room -- HER PURSE. There, on the table. Open. Dan stares at it, and after a long pause, he moves toward it. 12. He opens her wallet, looking through. There’s CASH there, maybe $100. Tens and twenties, crumpled... AND FOOD STAMPS. A pile of food stamps. He slowly removes the cash, conflicted. Looking back through the open bedroom door, where she snores softly. He POCKETS THE CASH, heading toward the door when -- TODDLER (O.S.) Mommy? He stops cold. Turns. Standing in the doorway to another bedroom is a TODDLER, maybe 18 months. Staring at him. Dan DEFLATES a little. Confused, concerned... humiliated. DAN What’s your name, hero? The kid just stares at him. DAN (CONT’D) Please tell me you came from next door. Or down the hall... TODDLER Momma... Dan sighs. Oh, shit. He goes to the kid. Picks him up -- AND SEES THE BRUISES on the boy’s arms. The kind ",
      "dialogue_count": 0,
      "word_count": 951
    },
    {
      "scene_number": 3,
      "slugline": "INT. ABRA’S HOUSE, MASTER BEDROOM - LATER David and Lucy are fast asleep. Slowly stirred by a sound... PIANO MUSIC, echoing through the dark house. INT. ABRA’S HOUSE, LIVING ROOM - MOMENTS LATER David and Lucy make their way down the stairs, the music LOUDER NOW. It seems Abra’s snuck out of bed, and gone back to the piano. As they turn the corner, they STOP COLD. There is no one in the room. But THE PIANO IS PLAYING, the same song Abra was struggling with earlier... CUT TO: INT. MOVIE THEATER - NIGHT ANDI STEINER (15, sharp and pretty) sits in the dark theater. Munching on candy as an older BUSINESSMAN (50s) makes his way down the aisle, sitting next to her. She doesn’t look up from her candy as he sits. BUSINESSMAN Andi? ANDI That’s right. BUSINESSMAN You’re prettier than your picture. ANDI You’re older than yours. He looks around, a little nervous. BUSINESSMAN So are we staying here or going somewhere? ANDI Don’t you want to watch the movie? He frowns. But soon softens as she SNUGGLES UP to him, laying her head on his shoulder. His HAND finds her THIGH. We pull back to reveal ROSE and CROW, sitting a few rows back. Not watching the movie. Watching ANDI. 15.",
      "characters": [],
      "action_text": "ROSE I don’t see what the fuss is about. Chat room romance. A little gross, but not interesting. CROW Watch. It’s interesting, I promise. ROSE It better be. Because she’s not all that steamy - CROW There she goes. They watch as Andi PUTS HER LIPS TO HER DATE’S EAR. ANDI Aren’t you tired? Sleep. The man’s head instantly DROPS to his chest. He’s OUT COLD. She lifts his LIMP HAND off her thigh with disgust, and fishes out his wallet. Starts PULLING CASH, credit cards. ROSE Okay. CROW Wait. This is the best part. I’ve watched her do it three times now and it never gets old. Andi pulls a PEARL-HANDLED KNIFE from her purse. ANDI Sleep deeper. Deep as you can. The pain you’ll feel is only a dream. What will the pain be? BUSINESSMAN A dream. She puts her arm around him, and quietly SLASHES TWO TINY V’S into his cheek. The blood FLOWS. He doesn’t even FLINCH. ANDI You can explain a lost wallet, when your wife asks, but you can’t explain this.   This , you see every day in the mirror. Every time you see it, you’ll say it out loud... “I like little girls.” She finishes cutting, leaning closer to the sleeping man. 16. ANDI (CONT’D) You’ll say it out loud. BUSINESSMAN Out loud. ANDI And the next time you go looking for a little girl online, you’ll remember that time you got bit by a rattlesnake. A rattlesnake in a blue skirt and white blouse,   whose face is a blank . She kisses his bloody cheek, standing from her chair, quietly leaving the theater. Rose and Crow watch, impressed. ROSE That   is   interesting. EXT. MOVIE THEATER - MOMENTS LATER Andi walks in the afternoon sun. The street is crowded, she’s in a city. Behind her, CROW approaches. CROW ‘Scuse me, miss? Miss! She ignores him, walking faster. CROW (CONT’D) You left something in the theater - ANDI You wanna leave me alone. Crow STOPS. Blinks. Suddenly UNSURE of himself, as if he FORGOT WHY HE WAS CHASING HER. Andi turns to leave when -- ROSE GRABS HER ARM. ROSE Well hi there. Andi stares at her. ANDI You want to let m",
      "dialogue_count": 0,
      "word_count": 595
    },
    {
      "scene_number": 4,
      "slugline": "EXT. OVERPASS, NEWARK - EARLY MORNING Dan wakes up under the overpass, face down on a filthy towel he’d spread out for himself the night before. A fresh bottle in front of him, empty. Clutched in his cold fingers. He COUGHS, spitting with his dry mouth. Looking around him. Not even sure how he ended up here. INT. GREYHOUND STATION - LATER Dan stands at the ticket counter, looking at the crumpled bills in his hands. His hands SHAKE, he’s DIRTY. Exhausted. DAN How far can I get for... He counts out the bills. EXT. GREYHOUND STATION - LATE MORNING Close on the bus sign: FRASIER, NH. Passengers board quietly, and Dan is among them. The last of his cash apparently went to the BOTTLE he clutches, along with his beat-up knapsack. CUT TO: EXT. ABRA’S HOUSE, BACKYARD - AFTERNOON DOZENS of kids and parents pack the yard, decorated for Abra’s birthday party. David and Lucy watch Young Abra, dressed in a birthday tiara and carrying her STUFFED BUNNY, run toward them holding out a handmade card. YOUNG ABRA Mommy! I made this for you -- It’s a secret card! Abra bounds away, toward the MAGICIAN who is gathering the kids at the end of the yard. Lucy looks down at the card. Just a simple word: hELL ☺  The MAGICIAN holds out a red TOP HAT to the kids. MAGICIAN Nothing up my sleeves, nothing up my sleeves... He reaches in, pulling out a WHITE RABBIT. The kids clap and giggle, and he hands it to Abra. 18.",
      "characters": [],
      "action_text": "MAGICIAN (CONT’D) Abracadabra! YOUNG ABRA I know magic too! MAGICIAN Well you get to hold him, birthday girl. She pets the bunny, watching. He turns over the hat, and SILVER SPOONS fall out. The kids laugh, delighted, as he picks them up and starts HANGING THEM ON HIS FACE, the last one balanced on the tip of his nose. YOUNG ABRA I can do that. MAGICIAN That’s nice, sweetie. EXT. ABRA'S HOUSE, BACKYARD - LATER The party is over, the last of the kids trickling out. David and Lucy clean up as Abra plays with the last of her friends. David frowns at the birthday cake. DAVID We can forget nap time. LUCY Just a few more hours. Say it with me, just a few more hours -- She smiles at him, heading through the open sliding glass door into the house. As he carefully scoops up the cake -- LUCY (O.S.) (CONT’D) (alarmed) David... INT. ABRA’S HOUSE, KITCHEN - MOMENTS LATER David enters the kitchen, where Lucy stares. White as a sheet. She’s pointing... THE SILVERWARE DRAWERS ARE ALL OUT, as though they SHOT OUT. FORKS AND KNIVES ALL OVER THE FLOOR. DAVID What the hell... 19. LUCY Dave... Lucy POINTS AT THE CEILING. He follows her gaze -- ALL OF THE SPOONS are hanging from the ceiling. Dangling, as though magnetized. Their tips barely touching the plaster. They STARE at it as Abra enters. Stuffed bunny in her hand. YOUNG ABRA (proud) Abra... cadabra! LUCY Honey, did... did   you   do this? Abra’s smile fades. Her lip starts to quiver. YOUNG ABRA Am I in trouble? They stare at her, not sure what to say -- as she STARTS TO CRY, to REALLY LET LOOSE -- ALL OF THE SPOONS FALL DOWN AT ONCE, CRASHING TO THE FLOOR. CUT TO: INT. GREYHOUND BUS - SIMULTANEOUS Dan STARTLES awake in his seat. SENSING SOMETHING, something that woke him... as though REACTING TO THE FALLING SPOONS... CUT TO: EXT. CAMPGROUND, LONG ISLAND - SIMULTANEOUS Rose STOPS in her tracks as she heads toward her RV, also SENSING SOMETHING. Looking over her shoulder. A passing thought, but something... some thing... INT. ROSE’S",
      "dialogue_count": 0,
      "word_count": 986
    },
    {
      "scene_number": 5,
      "slugline": "EXT. TEENEYTOWN, FRASIER NH - EVENING Dan steps away from the bus station. Tired, beaten. Shuffling through town, not even sure where he’s going. It’s MAIN STREET New Hampshire, the evening hours seeing the streets mostly deserted. A small town, with character. He stops at a sign: VISIT TEENEY TOWN! FRASIER’S SMALL WONDER. He looks beyond it, smiling to himself as he beholds Teeneytown. It’s a MINIATURE REPLICA of the very street he’s on, a tiny representation of the town he’s in. Around it, a SMALL TRAIN - designed for toddlers - resting idle on its tracks. Dan smiles. It’s strange, but welcoming at the same time. He crouches, examining the locomotive. BILLY (O.S.) You like it? Dan spins to face BILLY FREEMAN (late 40’s, kind.) DAN Sorry, I was just - BILLY That’s okay, people love to look at it. Model train buffs, usually. We keep em away in the summer when the place is jumpin’, but this time of year there’s no we, just me. And I don’t mind. (holds out his hand) Billy Freeman. Town maintenance. DAN Dan Torrance. BILLY Just off the bus? Or you ridin’ your thumb? DAN Bus. What does this thing have for an engine? BILLY Now that’s interesting. You ever hear of the Chevrolet Veraneio? DAN Brazilian Suburban, wasn’t it? Turbodiesel. 23.",
      "characters": [],
      "action_text": "BILLY That’s right! Instrument panel’s from a Suburban too. Seats I put in myself. (beat) What brings you to town, Dan Torrance? DAN Not sure yet. BILLY Not many take the bus this far North, less they’re looking for work. You lookin’ for work? DAN Yeah, I am. Place to stay, too. BILLY Change of scenery? Or you running away from something? Don’t mind my asking, I hope. New face is all. DAN (beat) Running away from myself I guess. BILLY Yeah, I know that look. Pretty well, sorry to say. (smiles) Runnin’ away from yourself’s a pickle. You take yourself with you, wherever you go. DAN Ain’t that the bitch. BILLY (considering) I know Mr. Kingsley, from the program, he helps folks out now and again, if they’re worthy of help, that is. You got references? DAN A few. Mostly janitorial, hospital orderly stuff. 24.",
      "dialogue_count": 0,
      "word_count": 367
    },
    {
      "scene_number": 6,
      "slugline": "INT. DAN’S ROOM, ELLIOT STREET - EVENING Dan stands by as MRS. ROBERTSON (40’s) gives him a tour of the LOFTY ROOM, at the top of the building. A view of the mountains, a simple room. A bed, a bath. Billy watches on. MRS. ROBERTSON Rent’s eighty-five a week, payable upfront. Billy paid your first two, the rest are on you. Once you start getting paid at Teeneytown. No pets, no parties, no noise. Dan looks at Billy, surprised. Billy just watches. DAN I’m a quiet tenant. MRS. ROBERTSON Last guy said the same. Math student. Even let him paint the wall all   blackboard , so he could scribble his little puzzles up there. She walks to the wall adjacent to the bed. A wall painted over DARK, with CHALKBOARD PAINT. She reaches down, picking up one of several pieces of COLORED CHALK by the wall. MRS. ROBERTSON (CONT’D) (writing) Wasn’t quiet, no sir. Didn’t even paint over this when he left, but I’m glad he didn’t so I can make this easy for you... so you see it every morning, when you wake. She steps back, revealing the writing: “ 85/wk. BEHAVE .” She walks past him, stopping for a beat beside Billy. MRS. ROBERTSON (CONT’D) You sure you wanna vouch for this pup? BILLY Pretty sure. MRS. ROBERTSON It’s your ass, Billy. She leaves, and Dan looks to Billy. A long beat. 25.",
      "characters": [],
      "action_text": "BILLY I’m downstairs, ground floor, if you need anything. Find me tomorrow and we’ll talk about some work. DAN Why are you doing this? You don’t know me. BILLY No I don’t. But I know the look, like I said, and... sometimes I get feelings about people. Hard to understand, I guess. DAN (beat) Easier than you think. CUT TO: EXT. BEACH - NIGHT Andi lays flat on a lawn recliner, near the group of RV’s. The sounds of the waves, a sky full of blinking stars overhead. A FIRE BURNING in the center. She’s nervous. Around her, the members of the TRUE KNOT stand. Rose in her hat, Crow beside her. Apron Annie, Barry the Chunk, Silent Sarey watch as Grampa Flick regards them with ancient eyes. ROSE No fear. ANDI Who are these people - ROSE You’ll find out, after. But this here is Grampa Flick, and he’ll lead us. No fear, understand? Rose nods to Grampa Flick, who steps forward. GRAMPA FLICK We are the True Knot and we endure. GROUP  Sabbatha hanti . GRAMPA FLICK We are the chosen ones. 26. GROUP  Lodsam hanti . GRAMPA FLICK We are the fortune ones. GROUP  Cahanna risone hanti . GRAMPA FLICK What is tied cannot be untied. Here is a woman. Would she join us? Would she tie her life to our life? ROSE Say yes. ANDI Yes. Rose reaches down, lifting a SILVER CANISTER. Almost like a THERMOS, but older. STRANGER. She holds it near Andi’s face. Rose TURNS THE VALVE on the canister. A small, rueful sigh, and a PUFF of silver MIST escapes. But it doesn’t dissipate into the night air... IT HANGS. ROSE This one’s special. Her name’s Violet, and there’s not much of her left... she tastes like flowers. Rose gently purses her lips, BLOWING the pocket of mist softly. It FLOATS around Andy’s face. ROSE (CONT’D) Breathe deep. After a beat, Andi BREATHES IT IN. ROSE HOLDS HER DOWN. ROSE (CONT’D) Embrace it. It’s the only way through. Andi SCREAMS in pain, shaking VIOLENTLY in the chair. ROSE (CONT’D) Take steam or die. Andi CONVULSES, and as they stare at her, HER SKIN BEGINS TO CHANGE -- BECOMING TRA",
      "dialogue_count": 0,
      "word_count": 1957
    },
    {
      "scene_number": 7,
      "slugline": "INT. HALLWAY, RIVINGTON HOUSE - NIGHT Dan MOPS THE FLOORS of the darkened halls. Sparely decorated, patient rooms lined up left and right. As he does, he almost mops over a CAT, who scuttles out of the way. DAN Sorry, Azzie. The cat moves down the hall, SCRATCHING at a patient’s door before pushing it open and slipping inside. Dan moves along, lost in his work, as he passes the room. Glances inside. An elderly PATIENT (80’s) lays on the bed, and Azzie the cat perches at the foot of the bed. DAN (CONT’D) C’mon, leave him be. The cat doesn’t budge. Shrugging, Dan starts to walk away... but STOPS. A feeling comes over him. He turns back, opening the door further. The cat just stares, almost like it’s STANDING GUARD. Waiting for something. Dan looks at it for a long time... and then steps into the room. INT. PATIENT’S ROOM, RIVINGTON HOUSE - CONTINUOUS Dan steps inside, feeling uneasy. The patient STIRS. PATIENT Doc? Doc, that you? DAN (beat) No, it’s... I’m not a doctor. Just cleaning up, you want me to call you a doctor? PATIENT C’mere. Please. Dan steps toward him, leaning the mop on the desk. The man looks SICK. One foot almost in the grave. PATIENT (CONT’D) Cat’s on my bed. DAN I can take him out -- 35.",
      "characters": [],
      "action_text": "PATIENT No, I knew he would be. That cat... always seems to know when it’s time. Guess it’s time. DAN No, it’s just Azreel being a silly old cat -- PATIENT Nope. Been that way since I got here. The cat knows when it’s time to go to sleep, everybody knows that. I’m gonna die. Dan hesitates... then REACHES OUT, taking the man’s hand. DAN (quietly) Yes. You are. I’ll get someone -- PATIENT Stay with me. Please. Dan sits back down. PATIENT (CONT’D) Known it’s comin’. Doesn’t make it less scary. DAN (long beat) I know what scared feels like. But tell you what, maybe it’s what you said. Just going to sleep. Nothing to be scared of, sleeping. Maybe you wake up some place better. PATIENT You’re a strange type of Doctor. DAN I’m not a doctor. PATIENT I think y’are. (laughs)  Doctor Sleep . You’ll stay, right? The man sighs, relieved. Looks up at the ceiling. 36. PATIENT (CONT’D) I’m just scared, Doc, scared it’ll hurt or be dark or be nothin’ at all, and I don’t wanna -- Dan CLOSES HIS EYES, CONCENTRATING. PROJECTING... DAN (V.O.) (in the man’s mind) Nothing to be scared of. The man CALMS, listening as though it’s his own thoughts. DAN (V.O.) Just going to sleep. Finally. True,  restful   sleep. PATIENT Thank you, Doc. Thank you. DAN I shouldn’t be here, let me get you a real doctor -- PATIENT No, this is exactly where you should be. Exactly. (beat) I see my wife... And then, one LONG, RATTLING BREATH. As Dan stares -- A FINE CLOUD OF RED MIST rises from the patient’s mouth. Tendrils of red smoke, gently rising from his mouth and nose. Dan watches the small cloud of mist HOVER above the bed... AND DISSIPATES into the air with a sigh. Then, the patient is perfectly still. IT’S OVER. Dan watches as Azzie the cat GLIDES DOWN from the bed, calmly leaving the room. Heading back into the hallway. Dan sits there for a long time, looking at the man. And realizes, for the first time in years, a PURPOSE. CUT TO: INT. DAN'S ROOM, ELLIOT STREET - LATER Dan steps into his room, still in ",
      "dialogue_count": 0,
      "word_count": 813
    },
    {
      "scene_number": 8,
      "slugline": "INT. AA MEETING - MORNING CLOSE on an EIGHT-YEAR CHIP... in DAN’S HANDS. Eight years older now (late 30’s), CLEAR-EYED and sober. Around him, people CLAP as he takes his chip. He turns to face the room.  Legend: 2008  DAN Dan, alcoholic. GROUP Hi Dan. From the chairs, Billy cups his hands to his mouth. BILLY Speech! DAN I’m not a speech guy, so I figured I’d hold the chip and talk about whatever popped up. So here I am, and... I’m thinking about my dad. I saw a chip like this in his hand, couple of months before he died. 5- month chip, I’m pretty sure. He hurt me once, when he was drunk, broke my arm, then he dried right out. He looks at the chip, and then at the group. DAN (CONT’D) He died when I was 5, so the only way I ever got to know my dad,  really   know him, was when I went  dark . When I drank, to dull the... or every time I wanted to break someone’s face. The drinking and the temper. Those things in me, they were   his   and they were all I could know of him. (beat) But now...   now   I get to know him a little different. Cause he also stood in a room like this once, wanting to get well. For me. And my mom. He held a chip in his hand, a chip that said 5 months and on   that  day, anyway, before the hotel... Dan collects himself. 39.",
      "characters": [],
      "action_text": "DAN (CONT’D) On   that   day, all he wanted in the world was to stand where I’m standing right now. And here I am. (beat) So thank you, I guess, from us both. This is for Jack Torrance. He takes the chip, returning to his seat. Billy puts a hand on his shoulder as the next person stands. INT. CHARLIE’S ROOM, RIVINGTON HOUSE - NIGHT CHARLIE (90’s), stirs in his bed. Soft lamplight beside him as he looks through wrinkled eyelids... TO THE CAT, sitting calmly at the foot of his bed. He stares at it, sighing. Then turns to the chair beside him, where Dan sits. He smiles at Charlie in the warm lamplight. There’s something different in Dan’s demeanor... he is COMFORTABLE in this role now. Used to it. It’s WHO HE IS. DAN Hi Charlie. CHARLIE Doc.   (beat) I guess I don’t need to ask why you’re here, this hour. DAN Any pain? I can get Claudette to bring you a pill. CHARLIE Pill won’t matter. I’ve heard about these house calls. What a visit from Doctor Sleep   really   is. So what do you see? Dan puts his hand on the man’s forehead, gentle and calm. DAN Your twin sons at four. See them? CHARLIE (beat) I do...   I can actually see them...  40. DAN A Farmall tractor with a striped umbrella over the seat. Five years old, pulling a red wagon -- CHARLIE Lord, look at that -- like a deck of cards, all out of order... (beat) I’m not scared of hell, Doc. I lived a decent life. And I don’t think there’s such a place anyway. I guess I’m scared there’s nothing. There was nothing before, so what if there’s nothing after... DAN We don’t end, Charlie. I know that for certain. Don’t know much else, but I know we don’t end. CHARLIE I can taste blueberries, the blueberries my mother used to grow... you taste those? DAN I do. And I hear Frank, singing on the old radio, on your workbench, by your tools... (singing)  Come fly with me, come fly, let’s fly away...  Charlie smiles, a tear rolling down his cheek. DAN AND CHARLIE  If you can use some exotic booze, there's a bar in far Bombay... Come ",
      "dialogue_count": 0,
      "word_count": 2174
    },
    {
      "scene_number": 9,
      "slugline": "INT. ABRA'S HOUSE, ABRA'S ROOM - CONTINUOUS Abra starts SCREAMING HER HEAD OFF. THRASHING ON THE BED. SCREAMING LIKE BRAD is screaming, so many miles away. The lights TURN ON, and David and Lucy RUN IN, TERRIFIED. LUCY Abra! Abra! ABRA TONY!!!! TONY!!! STOP THEM, TONY!!! INT. DAN'S ROOM, ELLIOT STREET - NIGHT Dan is asleep in his own bed, when A BLAST, A SHOCKWAVE, FOLLOWED BY A LOUD CRACKING SOUND as Dan HITS THE FLOOR, HARD. GRABBING HIS HEAD, in PAIN. EXT. ABANDONED ETHANOL PLANT - CONTINUOUS Rose SPINS WILDLY over her shoulder. She FELT IT TOO. INT. DAN'S ROOM, ELLIOT STREET - CONTINUOUS Dan struggles to his feet. DAN Jesus! He stands, not even noticing that his NOSE IS BLEEDING. His eyes go to the mirror on the wall by his headboard -- WHERE SOMETHING TAKES HIS BREATH AWAY. He stares. All his breath stopped in his head. In the mirror, he can see the CHALKBOARD WALL reflected... A WORD CRACKED INTO THE VERY PLASTER, LARGE AND BOLD.  REDRUM  He stares at it, and slowly turns away from the glass, toward the wall, where the word   MURDER   stares down at him. He walks to it, very slowly. DAN (CONT’D) Okay. Okay. SCARED, he picks up the chalk. And writes one word back: 49.",
      "characters": [],
      "action_text": "WHO?  He slowly turns, walking back to the bed. Shaking, he sits down, and makes himself look back at the wall, where the answer has already appeared in chalk.  BASEBALL BOY . EXT. ABANDONED ETHANOL PLANT - LATER Brad stares ahead as his body finally GIVES OUT. A long DEATH RATTLE from his throat, and the Knot lean closer, GETTING THE LAST OF THE STEAM as it rises from his mouth. Sucking it in. Rose sits back. ROSE Damn, I thought he had another few minutes in him. CROW He made it three hours, we can’t complain. She picks up a silver canister. She looks up to Grampa Flick... WHOSE HAIR IS A LIGHT BROWN AGAIN, the silver long gone. His wrinkles seem BETTER, smoother. He looks TEN YEARS YOUNGER, EASY. As they disperse, Rose PRESSES ON THE BOY’S CHEST, looking for little traces of steam that might be hiding inside. She holds the canister, and the steam rises. INT. ABRA'S HOUSE, ABRA'S ROOM - CONTINUOUS Abra rocks back and forth, sobbing as her parents hold her. ABRA They killed him. They killed him... INT. DAN'S ROOM, ELLIOT STREET - CONTINUOUS Dan sits on the bed, looking at the word on his wall. Pale, scared. Over his shoulder, that familiar word in the mirror:  REDRUM  DISSOLVE TO: 50. EXT. ABANDONED ETHANOL PLANT - SUNRISE Rose and Crow finish BURYING THE BODY in the dirt, as the morning sun creeps up. The others are inside their vehicles, resting, ready to go. She shovels a heap of dirt onto the growing pile. Almost done. She sits back, resting her head on the handle of the shovel. And after a long beat... ROSE We had a looker. Crow stops. Turns to her, slowly. CROW Tonight? ROSE Yeah. CROW Big steam? ROSE Huge.   Huge . CROW Where? ROSE East Coast I think. CROW (beat) You’re saying someone looked in from   fifteen hundred miles away?  ROSE Maybe further. CROW Boy or girl? ROSE Think it was a girl, but she was out of there in a flash but then she screamed, and I swear, Crow Daddy... I haven’t felt power like that, raw power like that, in so long... 51. CROW We sho",
      "dialogue_count": 0,
      "word_count": 1198
    },
    {
      "scene_number": 10,
      "slugline": "INT. ABRA'S HOUSE, ABRA'S ROOM - NIGHT Abra sits on her bed, music playing in her ears. Her books are laid out on the bed around her, but she isn’t studying. She’s looking at the PRINTOUT she took home from the library. The printout of the MISSING PERSON’S REPORT: BRADLEY TREVOR. AGE: 12. RACE: CAUCASIAN. LOCATION: BANKERTON, IOWA. ABRA You were special. Like me... She holds onto the picture, laying down on her back. Getting comfortable. Reaches out, TOUCHING THE PICTURE. And after a few moments, closes her eyes... A FLASH:   Bradley, TIED UP, on the FLOOR OF A VEHICLE --  Abra OPENS her eyes. Startled. Wasn’t expecting that. She looks down at the picture again, and brings her fingers back to the image. Touches it. Closes her eyes again -- FLASHES OF:   CORN FIELDS, rolling by. The RUMBLING of the VAN beneath her -- A BASEBALL GLOVE ON THE FLOOR OF THE VAN --  She opens her eyes. Takes a deep breath. Lays completely back, holding the picture, squeezing her eyes closed... HER EYES FLY OPEN. COMPLETELY WHITE, ROLLED INTO HER HEAD... FLASHES OF:   A BASEBALL FIELD, CORN FIELDS, A LONG ROAD -- EXT. ABANDONED ETHANOL PLANT - NIGHT A BIRDS’ EYE VIEW of the abandoned plant. The LINE OF VEHICLES moving through the dark, NO HEADLIGHTS. RV’s, CAMPERS, A VAN... Pulling past the sign: NO TRESPASSING BY ORDER OF THE CANTON COUNTY SHERIFF’S DEPT. ANOTHER SIGN BEYOND IT...  INT. ABRA'S HOUSE, ABRA'S ROOM - CONTINUOUS Abra CONVULSES SLIGHTLY on the bed, eyes rolled over white. SHE GRIPS A PEN, scribbling on the printout without looking: “ORGANIC INDUSTRIES. ETHANOL PLANT #4. CLOSED UNTIL -- 55.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 277
    },
    {
      "scene_number": 11,
      "slugline": "EXT. ABANDONED ETHANOL PLANT - NIGHT -- FURTHER NOTICE,” reads the sign that Abra is transcribing. The images come in a FLURRY NOW: BRADLEY SCREAMING -- DIRT SHOVELED INTO A HOLE ONTO A BASEBALL GLOVE -- THE CARAVAN LEAVING IN THE MORNING LIGHT --  INT. ABRA'S HOUSE, ABRA'S ROOM - CONTINUOUS Abra GASPS in a breath as her eyes go back to normal. She stands, shaking it off. Tears in her eyes. She heads to the window, looking out at her street, and the MOUNTAINS in the distance. And we can tell... SHE’S ANGRY. She GRIPS the window, knuckles turning white. And as she stares at her street, her eyes ROLL BACK AGAIN -- And the room PIVOTS. ROLLING UPWARD, as though the whole house is ROTATING TOWARD THE SKY -- ABRA HOLDS ONTO THE WINDOW AS THE ROOM ROLLS AROUND HER, hair falling back behind her like she’s hanging from the ceiling. When she opens her eyes, she’s not home anymore. She’s in -- INT. SUPERMARKET - EVENING -- a supermarket. Just a normal supermarket. Lit by fluorescent lights, SHOPPERS milling about. Abra is FLOATING FORWARD down an aisle, and she looks down to see -- HANDS, HOLDING A SHOPPING CART. Not her own hands, though... the hands of a WOMAN. Reveal ROSE, pushing the cart, loaded with basics. As she goes, she SLOWS down. A strange look on her face. She looks around, trying to shake the odd feeling she has. She starts pushing the cart again. Turning a corner, looking out at the ICE CREAM in the freezer. She reaches up, as though to open the freezer doors -- But RESTS HER HANDS on them. EXACTLY THE SAME WAY ABRA WAS HOLDING HER WINDOW. Rose CLOSES HER EYES, and sees a FLASH -  OF ABRA’S STREET, WITH THE MOUNTAINS BEYOND.  ROSE Well hi there. In the reflection of the glass freezer doors, Rose can ALMOST SEE ABRA’S FACE, looking back at her. Rose reaches up and back to TOUCH THE BACK OF HER HEAD. 56.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 339
    },
    {
      "scene_number": 12,
      "slugline": "INT. ABRA'S HOUSE, ABRA'S ROOM - CONTINUOUS Abra STARES out her window, eyes rolled over white, when A HAND GENTLY RESTS ON THE BACK OF HER HEAD -- ABRA SCREAMS. ABRA Get out! INT. SUPERMARKET - CONTINUOUS Rose is KNOCKED BACKWARD as the glass of the freezer door SHATTERS BEFORE HER, bottles and containers EXPLODING within. She hits the ground, SHOCKED. BLOOD RUNNING FROM HER NOSE. INT. ABRA'S HOUSE, ABRA'S ROOM - CONTINUOUS Abra backs away from the window, eyes wide with fear and defiance. Breathing heavy, she SHUTS HER EYES AND SHOUTS -- ABRA GET OUT OF MY HEAD!! DAN, HELP -- RUMBLE - the whole room SHAKES ON ITS FOUNDATION. INT. ABRA'S HOUSE, KITCHEN - CONTINUOUS David LOOKS UP as the house VIOLENTLY SHAKES, the light above him SWINGING as though from a powerful EARTHQUAKE. INT. SUPERMARKET - CONTINUOUS Rose TAKES ANOTHER BLAST, KICKING at the shopping cart as she SKIDS across the floor. Sits up, looking wildly around as a CLERK rushes to her, to help her to her feet. CLERK Ma’am... you okay? ROSE I’m fine... Jesus.   Jesus.  She WIPES the blood from her nose, STUNNED. INT. AA MEETING - NIGHT Dan lays on the ground in front of the coffee pot. BLOOD RUNNING FROM HIS NOSE as well. Unconscious. Billy helps lift him up as Dan looks around, disoriented. 57.",
      "characters": [],
      "action_text": "BILLY You okay, Danno? DAN Yeah... what happened? BILLY You just dropped. I thought you was having a stroke... Dan gets to his feet. Wipes the blood from his nose. BILLY (CONT’D) Who’s Tony? Dan looks at him. Surprised. BILLY (CONT’D) You kept saying “Please Tony, help.” DAN Sorry about that. I’m good. CUT TO: EXT. CAMPSITE - NIGHT Rose steps out of her truck, heading toward the camp. The others mill about, but Crow can tell right away something is wrong. THE BLOOD, on her face and her shirt. CROW Rosie? INT. ROSE'S RV - MOMENTS LATER She shuts the door, pulling off her bloody shirt. ROSE We’ve got a problem. CROW Talk to me. ROSE The looker? She found me again. I’m minding my own business, buyin’ groceries, and there she was. 58. CROW (beat) How? ROSE Don’t know, don’t care. We have to have her, Crow, we   have   to. CROW Does she... does she know who you are? Where we are? ROSE I don’t know. I don’t think so, but that’s not the important... I said she was huge steam, right? Well it’s even bigger than that. I tried to turn around on her and she blew me out of her like I was nothing. CROW Bullshit. ROSE Never happened to me. Never. I would have said it was impossible. Crow takes this in. Rose smiles at him... she’s excited. CROW Is she food, or do we turn her? ROSE We don’t turn her. CROW You sure? If she’s what you say -- ROSE Then we don’t want anyone with that kind of power in the Knot. Think about it. (beat) What if it’s neither. CROW What do you mean? ROSE I mean we don’t kill her, we don’t turn her. Think of a cow. You butcher one, gives you meat for months. Keep it alive, take care of it, it gives you milk for years. (MORE) 59. And she can take it, Crow. She’ll last a long, long time. CROW We’ve never tried that. ROSE I know. CROW Because a steam-head’s dangerous. You keep it alive, it could be dangerous. ROSE I know. The point... the point is she’s a great, white whale.   And I want her, Crow. I want her.  CUT TO: EXT. SCHOOL - ANOTHER DAY Abra gets out of h",
      "dialogue_count": 0,
      "word_count": 717
    },
    {
      "scene_number": 13,
      "slugline": "EXT. TEENEYTOWN, FRASIER NH - MOMENTS LATER Dan sits at the controls, STARTING THE SMALL TRAIN. Aboard, dozens of HAPPY KIDS enjoy the train ride. He sits back, content. Smiling at them. And then... his SMILE FADES. SENSING SOMETHING. He turns around... seeing ABRA, standing a few feet away. SMILING AT HIM. He nods, turning back to the train... but looks back, and she’s still smiling. And then, a VOICE IN HIS HEAD. ABRA (V.O.) Hi. Dan goes PALE. Looks around... how did she find him? DAN (V.O.) Not here. Gimme a sec. Abra nods. Dan heads to Billy. DAN Hey, you okay if I take lunch early? Not feeling so hot. BILLY Sure. He watches as Dan walks away, through Teeneytown. Some teenager following him, at a bit of a distance... CUT TO: EXT. LIBRARY BENCH, MAIN STREET, FRAZIER - LATER Dan and Abra sit on the bench outside the public library. Abra watches him, EAGER. EXCITED. ABRA (V.O.) You can hear me -- DAN (out loud) Let’s use our outside voices, ok? You tracked me down. ABRA It was easier than I thought! Like GPS, but in my head -- 61.",
      "characters": [],
      "action_text": "DAN Listen, and I don’t mean any offense, but this day and age, a man sitting alone with a teenage girl on a bench -- ABRA I’m Abra Rafaella Stone. And you’re my uncle. Uncle Dan. And that’s not even a lie, not totally. In science last year, Mr. Staley told us that all humans share the same genetic plan. He said that the things that make us different are very small things. Did you know that we share something like ninety-nine percent of our genetic makeup with   dogs ? So you could be my Uncle. Or cousin, or whatever. That’s all I’m saying. DAN Abra’s Theory of Relativity. ABRA We’re related in other ways. You’re magic, like me. She looks at him, eager. Dan sighs. Reluctant. DAN Don’t know about magic. I... I always called it the Shining. And yeah, we both Shine. (beat) Do your parents know? ABRA About my “Shine”? My dad’s always been a little more scared of it, but he thinks it’s gone except for a few things, like me calling from camp because I knew Momo was sick, and he’s glad. My mom’s a little different. Sometimes she’ll ask me to help her find something she’s lost -- last month it was her car keys, she left them on Dad’s worktable in the garage -- but she doesn’t know how much is still there. They don’t talk about it. I know it scares them so I try not to. Because if people find out... Eek, a freak. You know? (off his face) (MORE) 62. Sure you know. You try not to use it, don’t you. (realizing) You’ve been trying a long time. DAN When I was a kid, I didn’t understand the Shining, so I called it Tony... I thought he was my imaginary friend. ABRA I thought   you   were my imaginary friend. For a long time. (beat) How many of us are out there? DAN Lot of folks have a little bit of Shine to them. They don’t even know it. But they always seem to show up with flowers when their wives are sad, they do good on school tests they don’t even study for, they sense how people are feeling as soon as they walk into a room. But I’ve only met two or three people in my life that",
      "dialogue_count": 0,
      "word_count": 2884
    },
    {
      "scene_number": 14,
      "slugline": "EXT. ROSE'S RV - CONTINUOUS -- AND BACK INTO HER OWN BODY, laying flat on her back on top of her camper -- as the world ROTATES VIOLENTLY TO THE SIDE, sending her ROLLING toward the edge of the camper -- AND FALLING HARD ONTO THE GROUND BESIDE IT. She GASPS, lifting her face from the DIRT. BLOOD running from her nose, eyes wide. Crow RUSHES TOWARD HER, followed by Andi and several other members of the True Knot. CROW Rose! ROSE (gasping) Trap... She tries to stand up, putting weight on her hand -- And HOWLS with pain. She slumps down, pulling her hand up to her face to look at the damage -- BROKEN FINGERS. NAILS PULLED OUT. DEEP GASHES in her skin -- it’s like her hand was put through a SHREDDER. ANDI What the hell happened?! ROSE (gasping) Little bitch set a trap for me. ANDI Your hand -- Rose SHOVES HER BACK. Furious. She SCREAMS into the night. CROW Rose -- She SPINS toward him, and we see -- HER EYES ARE DIFFERENT. INHUMAN. Small POINTS OF LIGHT SHINE from her PUPILS, subtle... but her feigned humanity is SLIPPING in her anger. CROW (CONT’D) Calm down. We know where she is now, right? Now we know. ROSE She was in my head. CROW (blinks) What? 74.",
      "characters": [],
      "action_text": "ROSE  Stealing!   Stealing from   me!  CROW What does she know? ROSE I don’t know! CROW How much did she see? ROSE  I don’t know!  She fumes. Paces. Clutching her damaged hand. ROSE (CONT’D) She’s dead. That little thing  dared... fuck... with me...  BARRY interrupts. BARRY There’s a problem - ROSE Not now! BARRY Grampa Flick. They turn and look at him. BARRY (CONT’D) I think he’s cycling. CUT TO: INT. DAN'S ROOM, ELLIOT STREET - NIGHT Dan STIRS in his sleep, a VOICE IN HIS HEAD -- CRACKING, like the FREQUENCY IS OFF, but BREAKING THROUGH -- ABRA (V.O.) Uncle Dan! Uncle Dan! I hurt her, I really hurt her! He WINCES, sitting up. Disoriented. 75.",
      "dialogue_count": 0,
      "word_count": 338
    },
    {
      "scene_number": 15,
      "slugline": "INT. ABRA'S HOUSE, ABRA'S ROOM - CONTINUOUS Abra SITS in bed, in the dark. Eyes closed. SENDING HER THOUGHTS. Whispering to herself... ABRA (whispering) I hurt her and she deserved it and that’s not the best part -- INT. DAN’S ROOM, ELLIOT STREET - CONTINUOUS Dan holds his temples as he listens to her voice in his head, distorted but clearly hers. ABRA (V.O.) -- the best part is I got in her head.   I got in her head.   Uncle Dan? Are you there? Can you hear me? DAN (to himself) Oh god, Abra. What did you do... Dan stands, heading toward the wall. The word MURDER, cracked into the plaster. He picks up a piece of chalk, and after a beat... writes “OKAY. WHERE?” And he STOPS. DAN (CONT’D) (to himself) Just talk to the kid. If we’re gonna do this, let’s do this. He PUTS THE CHALK DOWN. Takes a beat... and closes his eyes. DAN (CONT’D) Hi Abra. INT. ABRA'S HOUSE, ABRA'S ROOM - CONTINUOUS In her bed, Abra suddenly LIGHTS UP. Dan’s voice FILLING HER HEAD, no distortion at all. Like he’s RIGHT THERE. ABRA I can hear you... DAN (V.O.) I’m sorry I sent you away, before. Tell me everything. Then tell me what I’ve got to do in Iowa. CUT TO: 76.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 219
    },
    {
      "scene_number": 16,
      "slugline": "EXT. CAMPSITE - NIGHT The members of the True Knot gather around the campfire. They’ve pulled GRAMPA FLICK out into a field, near the firelight. They stare at him, faces pale and afraid. He lays on the ground, COUGHING. FRAIL. He appears near death. Crow crouches beside him. Rose is CRYING. Andi stands beside her, confused. ANDI I don’t understand. ROSE You will. ANDI I thought we lived forever... ROSE Did someone promise you that, Andi? Someone say you’re immortal? I said “live   long , eat well.” We can live long, very long, and we do, most of us, but we haven’t been eating well, not for a long time now and Grampa... Rose looks down at the pale man by the firelight. ROSE (CONT’D) He turned me, you know. A long, long time ago. Crow approaches them. CROW He’s going. They step over Grampa Flick. As Andi watches, we realize something has been happening - HIS SKIN IS FLICKERING. “CYCLING” between being visible, normal skin, and being TRANSPARENT. We have FLASHES of his skeleton within... We can see his LIVER, HIS LUNGS, HIS VEINS AND ARTERIES. THE NERVES CONNECTING HIS EYES TO HIS BRAIN -- And then, he’s BACK, and those eyes fix on Rose. GRAMPA FLICK Rosie... ROSE Yes, love. 77.",
      "characters": [],
      "action_text": "She crouches to him. Holds his hand. GRAMPA FLICK I’m scared... ROSE (defiant) No. No you’re not. Not you, my love. You watched empires rise and fall, cheered the gladiators in Rome. You sailed across oceans to new worlds and you fed on Kings, princes, and popes. They wrote myths of you and made statues and they trembled in their villages and beds and skyscrapers and they screamed, screamed at your coming. They broke against you like waves on rocks and they died by the billions as you burned like a sun, for eons. EONS. So no. You are not scared. Not you. You are a god, and you   eat   fear. You are not afraid. He smiles. Tears fall down her cheeks. ROSE (CONT’D) Look at us. Look at the family you made. We are your legacy, love, and  we are legion . As he looks at them -- the CYCLING BEGINS AGAIN. Violent this time. He SCREAMS as his body CONTORTS, FLASHING transparent, then back, then INTO SOMETHING ELSE -- SOMETHING UNDERNEATH IT ALL, UNDER THE SKIN AND THE BULGING EYES AND THE VEINS AND THE BONES -- SOMETHING LIKE AN INSECT, ITS EYES GLOWING FIERY RED -- INHUMAN MOUTH OPEN IN A SCREAM -- CYCLING BETWEEN THESE THREE VERSIONS OF HIMSELF, SCREAMING IN AGONY UNTIL -- HE BURSTS APART. Not an explosion... just as though he has ATOMIZED. His physical body CONVERTING... TO STEAM. And, TEARS in their eyes, his “family” steps forward -- AND BEGINS BREATHING HIM IN. FEASTING. CUT TO: 78. INT. HALLWAY, ELLIOT STREET - BEFORE DAWN Dan knocks at the door. Again. And again. After a few moments... Billy answers. BILLY It’s four in the morning -- DAN You’ve always seen me, Billy. Got a sense about people, that fair to say? You think I’m an honest man? A good man? Billy stares at him. Confused. BILLY I do, Dan. DAN I need your help. And the first thing I need is for you to listen to a story and try - harder than you’ve ever tried - to   believe me . INT. DAN’S CAR - SUNRISE Dan drives down the highway. He looks over at the passenger seat, where BILLY IS SLEEPING. The vast countrysi",
      "dialogue_count": 0,
      "word_count": 3025
    },
    {
      "scene_number": 17,
      "slugline": "INT. ABRA'S HOUSE, KITCHEN - CONTINUOUS Abra OPENS HER EYES. ABRA I-95. Barry, the Crow, the Snake and a few others. They’re close. Very close. The trees haven’t changed that much, maybe Massachusetts but they’re close. DAN Rose? ABRA Didn’t see her. But they’re coming. (beat) I don’t want them anywhere near my dad. Nowhere. DAVID If you think I’m leaving you -- DAN You’re not. INT. ABRA'S HOUSE, ABRA'S ROOM - MOMENTS LATER Dan steps into Abra’s bedroom, followed by Abra, David and Billy. He looks around. DAN This is the only room she saw? ABRA That’s right. And I made some changes. Hid some things. DAN Okay... they’ll be trying to track you. Trying to catch on. His eyes go to the STUFFED BUNNY by her bed. The same one she carried when she was a little girl. Dan stares. AN IDEA. DAN (CONT’D) And you’re going to let them. ABRA Are you crazy? 93.",
      "characters": [],
      "action_text": "DAN Probably. But you’re going to let them, and then I need you to try to do a little trick. ABRA (smiling) A magic trick? DAN More like ventriloquism. CUT TO: INT. DAN'S CAR - DAY Dan drives. Beside him, Abra sits in the passenger seat. Billy is in the back. No sign of David. ABRA (eyes closed) They’re following us. DAN Good. Let them. You okay? ABRA I’m okay. DAN Concentrate. You’ve gotta keep it up until they land. ABRA I know. EXT. STATE PARK - LATER Dan’s car drives into the STATE PARK entrance. Passing CAMPGROUNDS... heading deeper into the woods. CUT TO: EXT. CAMPSITE - DAY Rose steps out of her camper. Looks around the nearly deserted campsite, sighing. She CLIMBS THE LADDER, getting onto the roof. Sitting lotus, quieting herself. 94. ROSE Okay, Crow Daddy. Go get her. CUT TO: EXT. STATE PARK, CAMPSITE - LATER Dan’s car comes to a stop. He climbs out, looking around. A nice, secluded area... no other campers, not just yet. Some PICNIC TABLES. Billy gets out behind him, heading to the TRUNK. DAN This could work. BILLY Good blinds, over there and there. Dan walks to Abra’s door, opening it. Looking in at her. She’s sitting VERY STILL, concentrating hard. DAN Still close? ABRA Getting closer. I think. This is tough - DAN I know. Not much longer. Come on. Let’s get you ready. CUT TO: EXT. STATE PARK, CAMPSITE - LATER The RV moves slowly through the park. Purposefully. Down the wooded path... and to the clearing. EXT. STATE PARK, CAMPSITE - CONTINUOUS The vehicle comes to a stop. The doors open... and Andi, Barry, Silent Sarey and Apron Annie STEP OUT. Trying to look casual. Looking across the field, toward the picnic area -- WHERE ABRA SITS at the table, eyes closed. Concentrating. Andi points. Barry nods, and they start FANNING OUT. Heading toward her. 95. BY THE TREE LINE: Dan and Billy CROUCH. HIDING. Watching them through RIFLE SCOPES. THE CROSSHAIRS ON THE GROUP... BILLY (whispering) I don’t know, Dan. Jesus, I don’t know if I can do this - DAN I know. I kn",
      "dialogue_count": 0,
      "word_count": 1583
    },
    {
      "scene_number": 18,
      "slugline": "INT. ABRA'S HOUSE, KITCHEN - CONTINUOUS Abra LOOKS UP, lip quivering. A NEEDLE stuck in her neck, the syringe DEPRESSED. CROW smiles at her as she stares at him. CROW Hello, Abra. She COLLAPSES, he CATCHES HER. Starts to lift her up... DAVID (O.S.) Get away from her. Crow stops. Turns. Chuckles to himself to see DAVID, standing at the kitchen door. A KNIFE in his hand. DAVID (CONT’D) Step back. Crow gently places Abra down on the table. CROW Sure thing, daddy. You know, I’m glad we got to meet. DAVID I’ll kill you. CROW Brave words. Always tickles me, watching you rubes threaten a god. You know, your little girl... she’s maybe the best food we’ll ever have. He steps toward David. CROW (CONT’D) I’m so glad I had a chance to compliment the chef. CUT TO: EXT. ABRA'S HOUSE - MINUTES LATER The front door opens. Crow carries Abra to the driveway, where his VAN is parked. He leaves the door open behind him, and through the doorway we see -- DAVID’S LIFELESS BODY, crumpled on the kitchen floor. CUT TO: 102.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 186
    },
    {
      "scene_number": 19,
      "slugline": "EXT. STATE PARK, CAMPSITE - CONTINUOUS Dan spins around in the field, next to the abandoned RV. Desperate. Tears on his face, blood on his clothes. DAN Abra! Abra! Abra! Silence. No response. He stands in the field, looking around. The only evidence that anything bad ever happened here... is BILLY’S CORPSE, sprawled out by the camper. Broken, alone, Dan heads to his car. CUT TO: EXT. CAMPSITE - CONTINUOUS Rose PACES, tears on her face. RAGE. And finally her PHONE RINGS. She looks at it, relieved, rushing it to her ear. ROSE Tell me you got her. A beat... and then she RELAXES. ROSE (CONT’D) Thank you. Thank you love. CUT TO: INT. VAN - EVENING Abra lays on the back seat. TIED UP with her seatbelt. She starts to COME TO, blinking. GROGGY. Looking around with GROWING PANIC. CROW Oh good, you’re awake. She looks up at him. SQUEEZES HER EYES SHUT. ABRA Dan - CROW Don’t bother. Abra dry heaves, trying to get her bearings. ABRA What’s wrong with me... 103.",
      "characters": [],
      "action_text": "CROW You are   dosed , missy. More than I ever used before. Might let you wake up, here and there, but that steam of yours is fast asleep. ABRA (realizing) My dad. Crow doesn’t answer. ABRA (CONT’D) (angry) What happened to my dad. CROW Lotta good people killed today. Lotta good people. Abra starts to cry. CROW (CONT’D) Would love to tell you someone will pay, some kind of justice raining down for the sad events today but it don’t work like that. We were always gonna have you. Some of my people are dead, some of yours dead... outcome didn’t change, though. Think on that a minute. Outcome didn’t change, so their deaths...   all   of them... just a waste.   A waste , you brought on us all. For what? Abra closes her eyes. Tries to reach out to Dan. ABRA Please... hear me... CROW Ain’t no one hearing you, darling. Might as well calm down, enjoy the ride. Like I said. Outcome hasn’t changed. CUT TO: INT. DAN'S ROOM, ELLIOT STREET - LATER THAT NIGHT Dan enters the room, a BROWN BAG in his hand. He frantically pulls out its contents... A BOTTLE OF WHISKEY. 104. DAN Oh please, please please please. (concentrates) Abra... Abra! Abra! Silence. DAN (CONT’D) (concentrating) Dick... you there? I need help... I need your help... Dick please... He STARES AT IT. Tears on his cheeks. Closes his eyes. DAN (CONT’D) Don’t Doc. You don’t need it, you don’t... (quiet) Someone help me. Tony... please help me, Tony. Silence. He leans forward, PICKING UP THE BOTTLE. Holds it in his hands. Stares at it. And after a few long, AGONIZING MOMENTS -- EXT. ELLIOTT STREET - MOMENTS LATER The bottle flies out of Dan’s window, SMASHING on the sidewalk below. INT. DAN'S ROOM, ELLIOT STREET - CONTINUOUS Dan sits back down. Staring at the wall in front of him, the word MURDER cracked into the wall. DAN Okay. Okay. He always said your brain was like a radio... He sits lotus, collecting himself. DAN (CONT’D) No one’s answering when you call. So stop calling. (beat) And just listen. Dan concentrates. A haz",
      "dialogue_count": 0,
      "word_count": 1069
    },
    {
      "scene_number": 20,
      "slugline": "EXT. SECLUDED ROAD - CONTINUOUS The Van SWERVES FROM THE ROAD, through the guard rail, BARRELING TOWARD THE TREES -- AND CRASHES. HARD. CROW IS EJECTED through the windshield -- INT. DAN'S ROOM, ELLIOT STREET - CONTINUOUS Dan JERKS AWAKE on his bedroom floor, the momentum of the CRASH sending him FLYING BACKWARD against his bed -- EXT. CAMPSITE - CONTINUOUS -- Rose DROPS TO HER KNEES, SCREAMING IN PAIN AND SHOCK... ROSE NOOOOO!!! EXT. SECLUDED ROAD - MOMENTS LATER The van is SLAMMED against the trees. Inside, Abra is HELD FAST by her seat belts. She looks around, DISORIENTED... ABRA (weak) Dan? Dan? She gets out of the car. Walks toward the SMASHED HOOD -- And sees CROW, CRUMPLED ON THE GROUND. CYCLING. She crouches down next to him. He stares at her, SHOCKED AND BEWILDERED, EYES BULGING BENEATH HIS TRANSLUCENT SKIN -- ABRA (CONT’D) I hope that hurts. A lot. He CYCLES, contorting one last time into the INHUMAN CREATURE that resides underneath... And then VANISHES IN A RUSH OF STEAM. Leaving Abra alone. INT. DAN'S ROOM, ELLIOT STREET - CONTINUOUS Dan SMILES. Gasping. Wiping the blood from his nose. DAN Hang tight, Abra. I’m coming. He grabs his keys, and runs into the night. CUT TO: 109.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 211
    },
    {
      "scene_number": 21,
      "slugline": "EXT. SECLUDED ROAD - LATER Abra WALKS up the street by herself, in the dark. Shaken by the crash. As she does, she looks up and sees - ROSE. STANDING IN THE MIDDLE OF THE ROAD, IN THE MOONLIGHT. Abra GASPS -- but then realizes. She can see the MOONLIGHT THROUGH ROSE. ABRA Well hi there. Rose glares at her. ABRA (CONT’D) Guess there’s no point hiding anymore, is there. ROSE You killed them. You killed   him . ABRA The Crow? I did. And I’m gonna kill you, Rose the Hat. Rose BRISTLES. Smiles at her... but we can see the RAGE behind her eyes. The DISBELIEF. ROSE Big words, dear. Big words from such a small child -- ABRA A small child that just killed your man. ROSE I’ll come for you. ABRA I know. I hope so. Because if you don’t, if you chicken out, you coward, and I really need you to hear me when I say this... She steps close. ABRA (CONT’D)  I’ll come for you.  Abra PUSHES HER WAY through Rose, and the projection BURSTS AWAY like a puff of smoke. CUT TO: 110.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 190
    },
    {
      "scene_number": 22,
      "slugline": "INT. ROSE'S RV - CONTINUOUS Rose OPENS HER EYES. Fuming. ROSE Alright, bitch-child. Alright. Rose gets up, going to the CANISTERS OF STEAM. THE LAST OF THEM. She TEARS THEM OPEN with her hands, GORGING HERSELF ON THE STEAM that comes from them. Pulling it all in. As we watch, her skin GLIMMERS. Her eyes GLOWING from the pupils... she’s GETTING STRONGER. As the steam courses through her, HER HAND BEGINS TO HEAL. EXT. CROWN MOTEL - MORNING Dan’s car pulls into the parking lot. He gets out, looking around... and sees ABRA, crouched in the corner of the parking lot. She runs to him, throwing her arms around him. CUT TO: INT. DAN’S CAR - AFTERNOON Abra WAKES UP in the passenger seat. Dan is driving. She looks out the window... ABRA I’m sorry, I dozed off. DAN You earned it. ABRA Where are we? DAN Ohio. ABRA Where are we going? Dan looks at the road. His face pale. DAN (long beat) Colorado. ABRA Why Colorado? 111.",
      "characters": [],
      "action_text": "DAN (beat) She’s going to keep coming. ABRA I know. DAN Always. This only ends if we end it... and I don’t think we can beat her. Not by ourselves. (beat) There’s a place. It’s a dangerous place, for people like us. ABRA The place you told me about. The hungry place. DAN That’s right. ABRA If it’s so dangerous, why would we go there? DAN Because if it’s dangerous for people like us... and it is... I expect it’s dangerous for people like   her.   Maybe even more so. They drive in silence. ABRA Good. She’s following us, you know. DAN That’s good. Let her. (beat) I’m sorry. About your father. Abra nods. Takes a beat... and STARTS TO CRY. ABRA I’m sorry about your friend. (beat) This won’t end. Not unless we end it. So let’s end it. They drive on. DISSOLVE TO: 112.",
      "dialogue_count": 0,
      "word_count": 315
    },
    {
      "scene_number": 23,
      "slugline": "EXT. I-80 WEST - EVENING Dan’s car blazes down the road. The fields of Iowa extending around them. INT. DAN'S CAR - CONTINUOUS Abra looks out the window. ABRA Iowa. Where this started. DAN Started before that, I’m afraid. Abra’s PHONE RINGS. She looks at it... ABRA Oh no. (beat) It’s my mom. Dan nods. DAN Tell her you’re okay. But don’t tell her where we’re going... you don’t want Rose within a hundred miles of her. ABRA I know. What do I say to her? Dan reaches out, taking her hand. Abra answers the phone. ABRA (CONT’D) Hi Mom... EXT. ABRA'S HOUSE - INTERCUT Lucy sits on the curb, surrounded by POLICE. They’re going through her house. Tears on her face, devastated and shocked. LUCY Oh thank god -- where are you? Are you okay? As she talks, several DETECTIVES stand beside her, listening. 113.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 147
    },
    {
      "scene_number": 24,
      "slugline": "INT. DAN'S CAR - INTERCUT Abra tries to hold it together. ABRA I’m okay, mom. I’m okay. LUCY Come home... my god, Abra, what’s happening... ABRA I can’t tell you. Yet. But I’m okay. I’m with a friend, and we’re going to... we’re going to get the people that did this to dad. LUCY Who did this?! ABRA I’m sorry mom. I’ll call when I can. (beat) I love you. She hangs up. Looks over at Dan. ABRA (CONT’D) When we’re safe, you’ll call her. Tell her where to find us. DAN I will. ABRA Okay. She rolls down the window, and THROWS THE PHONE OUT. DISSOLVE TO: EXT. GAS STATION, SIDEWINDER CO. - NIGHT Abra looks up at the IMPOSING MOUNTAINS as Dan finishes gassing up the car. A LIGHT SNOWFALL on the ground around them, more on the mountains above. He climbs back inside. DAN Not too much further. Up the mountain. 114.",
      "characters": [],
      "action_text": "ABRA Are we going to win, Uncle Dan? DAN We have to. They start driving. EXT. MOUNTAIN PASS - NIGHT The familiar mountain pass, the camera FLOATING OVERHEAD as Dan’s car treks up the snowy mountainside. Higher and higher, and further and further away from civilization. Toward the one place in the world he fears the most. EXT. OVERLOOK HOTEL - LATE AT NIGHT Dan’s car approaches, and comes to a stop. The headlights shining on the old hotel. IT IS CONDEMNED. Dark, boarded up. The decades of NEGLECT AND DECAY evident in its crumbling form, the once grand hedge- maze just overgrown. A foot of snow on the ground, almost enough to make the road impassable. But somehow, they’ve made it. Dan climbs out of the car. Face pale. DAN There it is. Abra joins him. DAN (CONT’D) This is what we’re going to do. You’re going to stay in the car, keep the heater running. I don’t want you spending a minute inside there if you don’t have to. He points down the road, following it as it snakes around the adjacent mountain. DAN (CONT’D) She can only come this way. You’ll see her a mile out, easy. You see lights on the mountain, over there... you blast me, okay? And I’ll meet you in the lobby. 115. ABRA You aren’t waiting with me? DAN I can’t, I’m afraid. ABRA Why not? DAN Because I’ve got to go wake it up. She climbs back into the car, starting the engine. And Dan Torrance walks through the snow, toward the Overlook Hotel. CUT TO: INT. OVERLOOK HOTEL, LOBBY - MOMENTS LATER The camera FLOATS through the lobby. The hotel is TERRIBLY DAMAGED, dark. Mold and water damage everywhere. Rotted boards on the windows. This isn’t a hotel... it’s a carcass. LOUD BANGS at the front doors. They get louder as we get closer... and then we see the door GIVE WAY as Dan forces his way inside. He walks in, looking around. The silence of the place overwhelming. He looks to his left, toward the ELEVATORS... long out of order. Dark. DAN Wakey wakey. He stands in the lobby, waiting. Waiting. And then... A FEW OF THE",
      "dialogue_count": 0,
      "word_count": 4982
    },
    {
      "scene_number": 25,
      "slugline": "INT. OVERLOOK HOTEL, BOILER ROOM - MOMENTS LATER -- into the boiler room. Heads to the boiler, looking at the GAGES -- THE STEAM PRESSURE IS ALREADY IN THE RED. Panicked, he reaches up to grab the handles... BUT HIS HANDS STOP. Inches from the wheel. His face contorts in confusion. DAN, inside, trying to STOP HIS HANDS from relieving the pressure... DAN (struggling) Are you out? INT. OVERLOOK HOTEL, LOBBY - MOMENTS LATER Abra RUNS toward the door. ABRA Almost... INT. OVERLOOK HOTEL, BOILER ROOM - CONTINUOUS Dan’s hands SHAKE over the boiler. His face contorted with RAGE and anger... With great effort, Dan manages to STEP BACK, AWAY FROM THE BOILER. LOWERING HIS HANDS. Sitting back, WATCHING THE BOILER OVERLOAD. FLAMES ERUPT FROM THE PIPES. He sighs, knowing it’s over... the fire can’t be stopped now. He stands and watches, even as the flames SPREAD TOWARD HIM. As they reach him, Dan CLOSES HIS EYES, EXHAUSTED BUT VICTORIOUS. In the firelight, we see his weary SMILE as the FIRE REACHES HIM. EXT. OVERLOOK HOTEL - MOMENTS LATER Abra stands in the snow, watching as FLAMES begin to erupt from the hotel. She stares, helpless as they SPREAD. ABRA Come on Uncle Dan, get out of there... The FIRE SPREADS FAST... the old, rotten wood and plaster of the hotel CATCHING QUICKLY. The flames BUILDING AND BUILDING as the snow falls around her. 136.",
      "characters": [],
      "action_text": "ABRA (CONT’D) Come on. On the mountain pass, in the distance, she sees SIRENS from the APPROACHING POLICE CARS. Her mother brought the cavalry. She turns, looking as the FLAMES ENGULF THE HOTEL... GLOWING IN THE SNOW. The fire so large now, bursting through windows. Abra waits, and waits. A TEAR rolling down her cheek. Desperate for him to be safe. For it to be over. She waits... and waits... As the police cars reach the top of the pass. ABRA (V.O.) The fire spread fast. Destroying the hotel... purifying it. CUT TO: INT. ABRA'S HOUSE, ABRA'S ROOM - ANOTHER NIGHT, WEEKS LATER Abra sits on the foot of her bed. ABRA Burning so bright I was warm, even in the snow. I could almost hear it screaming. I could hear it dying. And I knew, somewhere deep inside... I knew you were okay. REVEAL DAN. Leaning against the wall. Smiling at her. DAN I’m sorry I put you in danger. It was the only way. ABRA I know. (beat) Do you think she was right? When she said she wasn’t the last one. Do you think there are more, somewhere out there? Dan considers this, moving toward the window. Looking out the mountains in the moonlight. DAN The world is a hungry place. A dark place.   (MORE) 137. And maybe there’s more of them, or things like them, or worse. But there are more people like   you   too. People who   stand . She smiles at him. He looks out at the mountain. The snow at the peak, against the night sky. DAN (CONT’D) You know what Rene Daumal said about mountains? “What is above knows what is below, but what is below does not know what is above. One climbs, one sees. One descends, one sees no longer... but one has seen.” (beat) They really are lovely, aren’t they. He turns back to her, the mountain behind him. DAN (CONT’D) I told you, when we first met... I told you that you should hide, keep your head down. Keep your Shine out of sight. I was wrong about that. (beat)  Shine on , Abra Stone.   You Shine on . She smiles. In the hallway, Lucy approaches. LUCY Abra! Dinner time! (stepping in",
      "dialogue_count": 0,
      "word_count": 780
    }
  ]
}