{
  "slug": "dollface-101-guys-girl-2019",
  "title": "dollface 101 guys girl",
  "genre": "drama",
  "format": "series",
  "scenes_count": 4,
  "characters_count": 0,
  "characters": [],
  "total_words": 6418,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. PARKING LOT - CONTINUOUS Jane and Jeremy get out of his car, alone in the empty lot. JEREMY I’ll crash with my sister while you move out your stuff. You’re going to be okay. JANE We’ve hung out basically every day for half a decade. I don’t exactly know what to do now. Jane finally hands Jeremy back his sweatshirt. Jeremy fishes something out of the pocket, and gives it to her. JANE (CONT’D) What’s this? Jane examines what appears to be a BUS TICKET. JEREMY It’s what you do now. It’s time to go back. JANE What are you talking about? Go back where? Suddenly, a huge GREYHOUND BUS rolls to a stop in the lot. JEREMY Back to hanging out with other women. Jeremy kisses Jane’s FOREHEAD, the international symbol for “I don’t want to have sex with you.” Then he’s gone. She watches him drive away. The bus doors HISS open. BUS DRIVER (O.S.) Come on lady, I don’t have all day! The bus is the only sign of life for miles. Confused and alone, Jane hesitantly climbs the steps. JANE Excuse me, can you tell me where this bus is-- Jane stops, speechless. Her mouth HANGS open. 3.",
      "characters": [],
      "action_text": "BUS DRIVER (O.S.) What, ya never seen an old cat lady before? Reveal the bus driver is an old CAT LADY.   Literally . The body of a middle aged-woman with the head of cat. Mom jeans, whiskers, the whole picture. BUS DRIVER (CONT’D) Take a seat, ponytail. Before Jane can say another word, the doors SHUT behind her and the bus ROLLS FORWARD.  END OF COLD OPEN  4. ACT 1  INT. BUS - CONTINUOUS Jane notices the other passengers on the bus. They are row after row of freshly HEARTBROKEN WOMEN like herself. A few pass around tissues, others hold shoeboxes of sentimental items. One SNIFFLING WOMAN up front picks at a carton of ice cream. Jane takes the empty seat next to her. SNIFFLES (exploding into sobs) We just bought a kayak! Jane shifts uncomfortably, angling toward the bus driver. JANE I think I’d like to get off. BUS DRIVER No can do, sweetheart. If you’re here, it means you’ve spent so much time on the other side, you need some help getting back. JANE Back to spending time with other women? That’s really what this is? BUS DRIVER Take it from me, ma’am, relationships with other women are sacred and necessary. We need each other to survive. In today’s world, the bonds of sisterhood are all you have to turn to. JANE The bonds of sisterhood? BUS DRIVER Well, you could always try being a guy’s girl... The bus driver slows as she nods towards the window. 5.",
      "dialogue_count": 0,
      "word_count": 454
    },
    {
      "scene_number": 2,
      "slugline": "INT/EXT. BUS PASSING THROUGH DESERT - DAY Jane looks out the window to see a huge, BLEAK DESERT. Spread out across the expanse are several ‘GUY’S GIRLS’-- chicks wearing tight, fitted FOOTBALL JERSEYS. They each pace around in small circles, talking to themselves like SCHIZOPHRENICS. GUY’S GIRLS Anybody want to get wings?/I totally love video games/I totally love video games/Anybody want to get wings? INT. BUS - CONTINUOUS Jane shudders. The BUS speeds past. Suddenly, Jane’s seatmate THROWS DOWN her ice cream, erupting. SNIFFLES THAT’S IT. I CAN’T DO THIS ANYMORE, LET ME OFF. The bus SCREECHES to a halt. The doors fly open, revealing a bus stop with a sign that reads: REBOUND TOWN. EXT. REBOUND TOWN - CONTINUOUS Waiting at the stop is a chubby, sweatpants-clad man, probably named GARY. Sniffles RUNS to his arms. GARY I live with my mom, wanna get married? Sniffles turns and waves goodbye to the bus, her expression bordering on HUGE SMILE and TERRIFYING GRIMACE. INT. BUS - CONTINUOUS Back on the bus, Jane looks a shade of white typically reserved for corpses and Olsen twins. BUS DRIVER (trying to comfort her) Don’t look so worried, you’re smart. You’ll figure it out. Just remember, women need each other now more than ever. Turn your back on them and you’ll end up alone... you can   guess  what happens then. 6.",
      "characters": [],
      "action_text": "She stares at Jane with all-too-knowing CAT EYES through the rearview mirror and WINKS. The bus finally pulls to a STOP. The passengers file out, Jane exiting with them. BUS DRIVER (CONT’D) Good luck, kitten! INT. BUS TERMINAL - DAY Jane shuffles through the crowded bus terminal. WOMEN from her bus are greeted by GROUPS OF GIRLFRIENDS holding signs with their names. Jane looks lost, not seeing anyone for her. A tough female SECURITY GUARD approaches Jane. SECURITY GUARD You look lost. JANE I just can’t find... anyone. SECURITY GUARD I need you to come with me. INT. REGISTRATION OFFICE - DAY The Security Guard leads Jane to a registration desk in what looks like a DMV-type office. A monotone DESK CLERK flips through some files. She wears a pin that says “PEE IN PAIRS”. DESK CLERK There seems to be a hold on your account as a woman. I’ll need to ask you some routine questions. Have you recently slept with a close friend’s boyfriend? JANE No. DESK CLERK Have you recently made comments about a female politician’s inability to lead due to her menstrual cycle? JANE No. The Clerk skeptically flips through some files. 7. JANE (CONT’D) (standing up for herself) This must be some kind of mistake. I mean, I support women. I love women... I did a breast cancer walk last year. DESK CLERK Says here that was organized by your ex-boyfriend’s mother? JANE Okay... Oh, I work for a company with a female CEO. What’s more pro- women than that? DESK CLERK I found your problem. Your personal relationships have all expired. JANE Personal relationships...? Are you saying that I don’t have any-- DESK CLERK Friends. You have no friends. The Security Guard stifles a giggle. JANE That’s ridiculous. I   totally   have friends. I could go see my BEST FRIEND right now if I wanted to. Jane begins to STORM OUT, then turns back around. JANE (CONT’D) Which I don’t, because I’m   fine . INT. JANE & JEREMY’S APARTMENT - DAY Jane, definitely not fine, plops down on the couch, frustrated. Jane and Jeremy’",
      "dialogue_count": 0,
      "word_count": 1043
    },
    {
      "scene_number": 3,
      "slugline": "INT. COFFEE SHOP - DAY Jane follows Madison as she grabs her ICED COFFEE from a BARISTA and walks to the cream and sugar counter. Next to them, the FEDORA BABY from earlier waits for his hip parents to pour ALMOND MILK into his baby bottle. JANE So now Huevos Rancheros are pretty much ruined for me. I have post traumatic eggs disorder. Madison stirs her coffee. JANE (CONT’D) Look, I know I should’ve been better about checking in the last couple years and I’m sorry. I just didn’t know who else to talk to. MADISON (finally looking up) So what do expect me to say? JANE I don’t know. It’s you. Aren’t you going to tell me Jeremy’s the worst? MADISON I’ve been telling you that since the time he got Clippers tickets for   your   birthday when you don’t like sports OR watching basketball. JANE I like watching him watch basketball. MADISON You know those boyfriend body pillows they make for sad people? You could watch one of those watch basketball. Jane rolls her eyes. MADISON (CONT’D) I don’t know what you expect me to say, Jane. I have a full-time job now and the people whose problems I solve actually   pay me.  11.",
      "characters": [],
      "action_text": "JANE Aren’t you going to tell me I should face the world instead of hiding at home? Go out and hit the town? MADISON Well no, I would not say the words “hit the town” because I’m not 100 years old and performing in a Broadway Musical. Jane gives Madison a look--   “you know what I meant”  MADISON (CONT’D) All I did for years was try to get you to do that stuff. The last time I got you to a bar I basically had to drag you kicking and screaming, then you met your boyfriend and didn’t come out again for five years. Who knows what would happen if we went out again, you might get married before our second drink. JANE I promise it won’t be like that, I just want to hang out again. We can do something you’ll think is fun, like go to one of those places with the elevated surfaces people dance on-- like you used to with your sorority friends. MADISON (laughing) You hated my sorority friends. JANE I did not   hate   them. The whole thing was just a concept... beyond my understanding. MADISON Oh sure,   college sororities , right up there with quantum physics and figuring out what went down between Solange and Jay-Z in that elevator. JANE I see a big group of girls like that and I feel totally out of place.   (MORE)  12. Jeremy and I watched this nature documentary about a baby monkey that was raised in a colony of sloths, and when they tried to release him back with the other monkeys he was HIGHLY overwhelmed. That’s me. I’m the sloth monkey. MADISON You don’t put yourself out there. Having a group of girlfriends you can count on is important. Madison nods at a TABLE OF GIRLS having coffee nearby. MADISON (CONT’D) I mean look at them. On cue, the girls LAUGH and their hair BLOWS IN THE WIND. JANE It just looks so   perfect , I guess it’s hard for me to believe that’s totally genuine... MADISON You don’t even know those girls! JANE Okay fine then... let’s ask them. Jane walks over to the girls’ table. JANE (CONT’D) Hi, excuse me, sorry to bother you-- we were just wondering, h",
      "dialogue_count": 0,
      "word_count": 2437
    },
    {
      "scene_number": 4,
      "slugline": "INT. CLOTHING BOUTIQUE - LATER Jane hurries to a dressing room area, calling to a closed curtain. JANE Madison, are you still here? Behind the curtain, Madison wiggles into a dress. MADISON Yeah, what was the emergency text? (poking her head out) Can you zip me?.. Oh my god. Madison takes in Jane’s outfit. Jane is wearing the Aruba T-shirt, complete with the palm tree shaped like a penis. MADISON (CONT’D) I figured you needed shopping help but this is worse than I thought. JANE The time with the car keys. Or painting my phone number. Or the acapella group or-- MADISON Take a breath. I don’t speak mental breakdown. JANE Freshman year spring break! My bathing suit broke on the beach so we rushed to that weird little gift shop and found this shirt, but you told me it’d be social suicide to walk around in it alone so you bought one too, remember? MADISON (she remembers) I do vaguely recall being propositioned for more than the typical number of hand jobs that trip. JANE You asked me why I wanted to be friends again. These shirts, all that stuff you used to do for me... MADISON That stuff used to make you   furious  with me.   (MORE)  22.",
      "characters": [],
      "action_text": "If anything it’s a laundry list of reasons why you stopped hanging out with me in the first place. JANE I know but-- I invited the girls from work to go out this weekend. MADISON (surprised) You did? JANE I really want you to come. Madison softens for a moment. MADISON I guess I don’t have plans already... (catching herself) But just so you know, I threw that shirt away like three years ago. A charged beat. Madison turns so Jane can zip her up. They assess her outfit in a mirror (TIGHT BLACK DRESS, WHITE COLLAR). MADISON (CONT’D) I look like a slutty pilgrim. JANE So... you’re gonna get it? MADISON Definitely. INT. TIPSY PANTHER - NIGHT A radio-hit THUMPS, the place is PACKED with GOOD-LOOKING PATRONS mingling and buying drinks. Jane lingers by the bar, trying to act casual. A BEAUTIFUL GIRL headed by stops her. BEAUTIFUL GIRL Cute jeans! JANE (startled, nervous-excited) Oh, uh, thank you! You too! The girl is wearing a DRESS. She gives Jane a polite, confused smile, and walks away. Jane cringes at herself... smooth. Finally, she spots Madison making her way over.  MADISON (CONT'D)  23. JANE (CONT’D) Thank god you’re here. MADISON I think that’s the welcome I want every time I enter a room. (beat) What do you want to drink? JANE I’ll get whatever you’re getting. MADISON No, come on. Go up there and order exactly what YOU want. A no-nonsense, tattoo-sleeved BARTENDER CHICK points to them. JANE (trying to be confident) I want something that tastes good but is also really strong. BARTENDER I can give you Sprite with roofies in it. MADISON (cutting in) She’ll have a vodka soda! The bartender rolls her eyes and makes their drinks. MADISON (CONT’D) Good try. We’ll work on that. Jane takes an exploratory look around. JANE So, this is it. I’m here. I’m at a club... I’m clubbing. MADISON (amused) Let’s take it one step at a time, party girl. You should check-in here so Jeremy knows you’re out and not thinking about him. JANE (re: her phone) But if I check in just for his ben",
      "dialogue_count": 0,
      "word_count": 2484
    }
  ]
}