{
  "slug": "dope-2015",
  "title": "dope",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 14,
  "characters_count": 0,
  "characters": [],
  "total_words": 23628,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. FOX THEATER - INGLEWOOD - DAY Malcolm, 5, sits with his father in the mostly empty, once stunning art deco movie theater which currently screens old movies for one dollar. He reads AMAZING SPIDERMAN. ON THE SCREEN is SUPER FLY. IN THE SEATS, Malcolm’s father is eating it up. OLUSEGUN I saw this film as a boy. This is a classic. You should pay attention. Malcolm peeks over his book, watches for a moment, goes back to reading. His father shakes his head. OLUSEGUN I learned more about America from this movie than anything I ever read. If you pay attention you will too. ANGLE ON THE SCREEN at YOUNG BLOOD PRIEST YOUNGBLOOD PRIEST You better take good care of me. Nothing. No-thiing better happen to a hair on my gorgeous head. Can you dig it? INT. MORNINGSIDE HIGH SCHOOL - GUIDANCE COUNSELOR’S OFFICE Malcolm continues his talk with Mr. Bailey. MALCOLM I could write the typical I’m from a poor crime filled neighborhood, raised by a single mother, I don’t know my dad, blah, blah blah. That’s so cliched. But this. This essay says I’m different. Harvard wants kids that write this essay. MR. BAILEY I’m going to be honest with you, Malcolm.  9.  (MORE)",
      "characters": [],
      "action_text": "It’s pretty damn arrogant to think you can get into Harvard. Fernando’s top choice is UC Riverside. Jordan’s is Spellman. Who do you think you are? Malcolm stares at Mr. Bailey. Upset at his derisive tone disguised as tough love. MR. BAILEY You go to Mornignside in Inglewood. To the admissions committee your straight A’s don’t mean crap. So if you’re serious about this exercise and not just wasting my time and yours, it’s going to be all about your personal statement, your S.A.T. scores, your recommendations, and most important, your alumni interview tomorrow. Are you ready? Malcolm nods. MR. BAILEY You better be. I just found out you’ll be interviewing with Austin Jacoby. He grew up in Inglewood as well. He’ll be able to relate to your circumstances. He hands Malcolm his business card: JACOBY’S CHECK CASHING and PAY DAY LENDING. MALCOLM Harvard? Really? MR. BAILEY Sorry, they don’t all go on to be President. INT. MORNINGSIDE HIGH SCHOOL - MUSIC ROOM The music room has seen its better days. Because of cutbacks, it hasn’t been used for intended purposes for a decade. It’s now used for storage.  10.  MR. BAILEY (cont'd) So among the old MUSIC STANDS and INSTRUMENTS in various states of disrepair are BROKEN DESKS, BOXES, MANILLA ENVELOPES, SCHOOL SUPPLIES. Malcolm, Jib and Diggy are on the stage. They set up their instruments. NARRATOR (V.O.) Malcolm, Jib, and Diggy used to be in the school marching band. But quit in protest after refusing to play The Harlem Shake. They arranged to use the music room during lunch for their recently formed punk band. They set up an iPHONE. Press RECORD. MALCOLM Microphone check one two, one two. My name is Malcolm Ad-rock on guitar, on the bass is diggity Diggy Dawson, I got mad Jib Garza on the ones and twos. And our band is...DOPE. One, two. One, two three, four! DOPE, is a hip-hop inspired PUNK BAND. And they actually sound pretty damn good. They are doing their rendition of JACKIN FOR BEATS. A JANITOR walks in. Shakes his head at Ma",
      "dialogue_count": 0,
      "word_count": 2614
    },
    {
      "scene_number": 2,
      "slugline": "EXT. CLUB FAIS DO-DO - NIGHT MUSIC CUE: “I WANNA ROCK (DOO DOO BROWN)” - LUKE When they arrive at the CLUB, they see the real boys in the hood surrounding the place. Gangsters, drug dealers, rappers, hoochies, pro athletes, and a surprising amount of drunk white USC students. Malcolm and his crew aren’t sure they want to go in. Then they see a few stoned STRIPPERS who FLASH their TITS. They grin. Oh yeah, they’re sure. Malcolm and his friends walk up to the LARGE BOUNCER in a dark suit holding a clipboard, manning the VELVET ROPE.   The Bouncer looks them up and down. BOUNCER Ain’t no cake and ice cream here little niggas. Go on. MALCOLM Dom invited me. I’m on the list. Malcolm. The Bouncer skeptically glances the list. BOUNCER You ain’t here. The bouncer lets in a group of HOOCHIES wearing the tightest of the tighties. JIB You let them in without even checking the list. BOUNCER I gotta keep that right nigga to hoe ratio. Ya feel me? So unless y’all got pussies, you need to bounce. DIGGY I have one. BOUNCER (laughing) I know, y’all are some little bitches.  21.",
      "characters": [],
      "action_text": "MALCOLM Naw really she’s a girl. She’s got a pussy for real. So she should be able to get in. And we’re with her. JIB Show him your titties. DIGGY Fuck no! JIB Come on Diggy, take one for the team. Show him. MALCOLM If she proves she’s a female will you let us in? BOUNCER (sarcastically) Yeah. Sure. Malcolm and Jib look at her. DIGGY Fuck it. She raises her shirt. The bouncer’s jaw drops at the sight of her large breasts. Malcolm and Jib also do a double take. BOUNCER Muthafucka! (to his partner) Yo, yo look at this shit yo, this nigga’s really a bitch! Look! Boys Don’t Cry like a muthafucka! His Partner falls down. Shocked by the sight. The Bouncer is in tears laughing so hard. Diggy puts her shirt down. DIGGY Let us in! BOUNCER OK. OK. I need to see some ID. 21 and over club. Y’all got ID? They shake their heads, NO.  22. BOUNCER I can’t let you in then. Now get the fuck outta here. He gives them a wink. Laughs. The crew turns around, walks away. JIB Can I see them again? Diggy punches him in the arm real hard. As they head to the car they see a group of BEAUTIFUL YOUNG LADIES, dressed sexy and giggling. They DRINK from a flask. In the middle of this group is NAKIA. Malcolm freezes in his tracks as he sees her. She then notices him and smiles. NAKIA You’re going in, right? Malcolm is speechless. Nakia and her friends all walk past the Bouncer. She gives Malcolm one last look before going in. Malcolm thinks. Looks around. Sees a large BUS PULLING in the back. Out of the bus is a RAPPER and his entourage. Roadies begin unloading EQUIPMENT. Malcolm smiles. EXT. CLUB FAIS DO-DO - BACK ALLEY Malcolm and crew sneak around to the back ALLEY, see the famous RAPPER and his large entourage entering the club. Malcolm picks up some CABLE. Jib and Diggy follow suit. They try to blend in. Walk with the rest of the crew, toward the back entrance to the club. They are about to make it inside, when they see The BOUNCER. He recognizes them and walks over. They are about to be bounc",
      "dialogue_count": 0,
      "word_count": 2908
    },
    {
      "scene_number": 3,
      "slugline": "EXT. MORNINGSIDE HIGH SCHOOL - MORNING Malcolm meets up with his friends. JIB Three words. Did. You. Fuck? Malcolm is silent. JIB Aww man you a pussy nigga, man. MALCOLM She let me feel the titties and finger bang. JIB Lying ass nigga. MALCOLM I’m serious. Here. Smell. Malcolm puts his middle finger under their noses. JIB I don’t smell shit. MALCOLM That’s cuz you don’t know what pussy smells like. DIGGY I do, and I don’t smell shit either. MALCOLM You know how your pussy smells. One smell doesn’t fit all. As usual, Malcolm, Jib and Diggy go through security. But unlike usual, the METAL DETECTOR goes off. The security guard, Stacey, looks on curiously. No way. STACEY Go through again. One at a time. Jib walks through, then Diggy, then Malcolm...BEEP. Stacey looks at him again. Confused.  35.",
      "characters": [],
      "action_text": "STACEY (re: the beeping) Damn. This must be broken. Then the GERMAN SHEPARD BARKS at Malcolm. Jumps on his BACKPACK. STACEY (wrangling the dog) Whoa. What got into you? Not suspecting anything foul from Malcolm and his geek friends... STACEY Go on in. (to everyone else) Machine’s broke. Pat downs. The kids all groan. INT. MORNINGSIDE HIGH SCHOOL - INGLEWOOD, CA Malcolm and his friends aren’t sure what just happened. But as Malcolm goes to his locker, opens his BACKPACK to get something, he finds out. He is shocked as he looks inside: LARGE STASH of DOPE and a GUN. MUSIC CUE: “BUGGIN’ OUT” A TRIBE CALLED QUEST Malcolm RUNS off. Diggy and Jib are confused as they watch him flee. EXT. MORNINGSIDE HIGH SCHOOL - UNDER THE BLEACHERS Malcolm runs under the bleachers. Diggy and Jib catch up to him. DIGGY (out of breath) What the fuck is your problem?! Malcolm shows them the inside of his bag. JIB Is that real?! How you get that shit?!  36. MALCOLM No fuckin’ clue-- He pauses. Time moves backwards in his mind, as if Superman is flying fast as fuck around his head. He sees the moment when DOM puts the stuff in his bag and tells him to RUN. MALCOLM Dom! Had to be! At the party! JIB I told you we shouldn’t go. We gotta get rid of this shit. Take it to the police. MALCOLM Are you crazy! Three niggas walk into a a police station like, “Here’s a bag of dope and a gun. See you later.” And Dom ain’t gonna figure out who snitched? JIB What then?! You can’t just keep the shit. DIGGY That is a lot of weight nigga. Gotta be at least, ten, twenty...I don’t know. A lot of keys, right? MALCOLM I don’t know! Only thing I know about this shit is Jeezy paid LeBron and Jay paid Dwayne Wade. JIB He was talking about dope? The SCHOOL BELL RINGS. INT. MORNINGSIDE HIGH SCHOOL - CLASSROOM. Malcolm is sweating. He can’t take his eyes off the BACKPACK. Jib and Diggy are in their seats. All are as nervous as hookers in church.  37. The teacher reads from her book as the kids follow along. She is inter",
      "dialogue_count": 0,
      "word_count": 1363
    },
    {
      "scene_number": 4,
      "slugline": "EXT. MORNINGSIDE HIGH SCHOOL - INGLEWOOD, CA MALCOLM He said he knows you. He knew my name? DOM (VOICE) Look there are two possibilities. Either, the nigga in that El Camino is po po and as soon are you give him the package is gonna arrest you, and my ass is heading to Chino with a price on my head. Or the nigga in the car is the snitch. In that case he’ll take the package, kill you, and I end up in Chino with a price on my head. INT. COUNTY JAIL - SAME DOM (intense) You gonna have to trust me right about now, you understand. If you take the backpack to the nigga in the whip, we’re both fucked. EXT. MORNINGSIDE HIGH SCHOOL - SAME Malcolm looks, as the TINTED WINDOW of the El Camino rolls down. A hard looking THUG looks around. Searching. DOM I’m gonna text you an address. Go there and ask for A.J. Say it’s about Boys Club. Give him the package. Say it’s from me. MALCOLM Oh shit. Oh shit. Oh shit. DOM Hey! You hear me nigga! RUN! MUSIC CUE: “SIMON SAYS” - PHAROAHE MONCH  43.",
      "characters": [],
      "action_text": "Malcolm turns and runs back toward Jib and Diggy who don’t know what the hell is going on. They follow Malcolm, who jumps on his bike. Jib and Diggy follow on their bikes. The window goes back up on the El Camino. It PEELS rubber in reverse as Malcolm, Jib and Diggy speed down the street. Turn into an alley. They look behind and see the El Camino. They speed away. Malcolm points. They squeeze their bikes through a space in a GATE. The car is stuck on the other side. Backs up. EXT. STREET OF INGLEWOOD, CA Malcolm and friends make a few lefts, and right. Getting away from the car. Slow down. JIB What the fuck happend?! MALCOLM That was Dom that called. He said that nigga that called earlier wasn’t with him! They look and see the El Camino at the end of the street. DIGGY How the fuck did they find us? PUSH IN on Malcolm’s face as they all begin to ride away. INT. RED EL CAMINO - SAME ANGLE ON an iPad screen. FIND MY iPHONE shows a green dot. A Thug sits in the passenger seat. This is THE VOICE that was on the phone. THE VOICE OK. He turned on Prairie. The car speeds onto Prairie Ave. They swerve in and out of traffic following the DOT.  44.",
      "dialogue_count": 0,
      "word_count": 422
    },
    {
      "scene_number": 5,
      "slugline": "EXT. PRAIRIE AVE - SAME Malcolm and his friends speed on their bikes down the busy street, they also weave in between traffic. But since they are on bikes they can speed ahead when gridlock freezes traffic. They look behind them and see the RED EL CAMINO in the distance. Malcolm picks up speed. He heads toward the intersection of Prairie and Century Blvd. A BUS is turning left as the light turns from YELLOW to RED. He ducks behind the bus, grabs onto the bumper. His friends follow amid HORN HONKS and SCREECHES. They hold on as the bus turns down Century Blvd. INT. RED EL CAMINO - SAME The GREEN DOT moves left on Century. The driver speeds around a couple of cars and turns left onto CENTURY. They follow the dot as it turns right on La Cienega. The Driver presses the GAS. The DOT turns on MANCHESTER BLVD. He looks up, sees a BUS turning onto Manchester. THE VOICE He’s on the bus. They zip the car around the corner and track down the bus, drive in front of it, slam the brakes. EXT. MANCHESTER BLVD - CONTINUOUS The bus driver slams the brakes to avoid rear ending the El Camino. The Driver and The Voice get out of the car. One holds a shot gun. The other a GLOCK. They point at the bus driver, who we recognize as LISA, Malcolm’s mom. THE VOICE Open the muthafuckin’ door! She quickly complies. The Driver and the Voice get on the bus. Look around. They don’t see Malcolm or his friends. THE VOICE Did three young niggas get on the bus in the last couple stops?  45.",
      "characters": [],
      "action_text": "LISA (annoyed) I don’t know. There are a lot of young niggas that get on the bus. THE VOICE Don’t get smart sweetheart. I’m just axing you a question. LISA I don’t see shit but the road. The Voice looks at the Ipad. The GREEN DOT is in the same place. He taps the bus steering wheel with his gun. THE VOICE Go on and start driving for me sweetie. Lisa drives. The GREEN DOT on the iPad screen begins moving. THE VOICE He’s here. He looks around pointing his gun at scared passengers. He clicks the PLAY SOUND bottom on his screen. The PHONE RINGS OUT loudly. The Voice and his thug friend follow the sound. Scared passengers duck as they approach. The Voice COCKS his gun as he gets closer. Then... He looks and sees the IPHONE. JAMMED into a cracked open window of the bus. EXT. LADERA HEIGHTS - AFTERNOON MUSIC CUE: “SWEET LIFE”- FRANK OCEAN Malcolm, Jib, and Diggy get off a DIFFERENT BUS on SLAUSON and LA CIENGA. They take their bikes off the rack in front of the bus and ride into the PALM TREE lined neighborhood. The houses are a combination of midcentury moderns, with gaudy new mini MacMansions. The lawns are green and manicured, the cars are nicer and the sky is more blue than the rest of Inglewood. As Frank Ocean sings, this is   Ladera Heights. The Black Beverly Hills. Domesticated paradise. Palm trees and pools....  46. They ride up to the largest, nicest house on the block. Malcolm looks at the address. Nods to his friends. He rings the doorbell. Waits. The door slowly opens. Using the door for a prop is a beautiful biracial young woman. This is LILY, 20. She is wearing a robe, if you want to call it wearing. It is dangling on her shoulder, barely covering her. A PACIFIER hangs around her neck on a gold chain. The door is snatched wide open revealing Jaleel, 20, biracial. Wearing a WHITE TANK top, tattoos sleeve his arms. He pushes Lily to the side. JALEEL What the fuck are you doing opening the door, butt ass naked. You are a fucking hoe, Lily. You know that? As much",
      "dialogue_count": 0,
      "word_count": 2828
    },
    {
      "scene_number": 6,
      "slugline": "INT. GUEST HOUSE - STUDIO Malcolm lays on the couch, NAKED. Waiting. He fidgets. Not sure how to lay. He starts on his back. Feels weird. Sits up. He puts his arm up. Lifts his knee. Looks like Burt Reynolds in Playgirl. Shakes it off. Sits. Waits... And waits.... And waits.... And it’s now that he notices his backpack is OPEN on the ground, not the chair where he left it. INT. GUEST HOUSE - HALLWAY Malcolm hears water running inside the bathroom. Taps on the door. No answer. He knocks. Nothing. He gently puts his hand on the door knob. Turns. Peeks inside. THROUGH THE CRACK: Lily is SLUMPED on the toilet. PACIFIER in her mouth. AN OPEN BAG of MOLLY on the sink. Crystal powder SPILLED all over the floor. MALCOLM Oh shit! INT. GUEST HOUSE - BATHROOM - CONTINUOUS Malcolm runs to her. Lily is unconscious. He tries to pull the pacifier out of her mouth, but it is CLENCHED TIGHT by her teeth. He lifts her up, slips on the powder on the ground. He falls on his back. Her on top of him. He looks at her. She’s lying on him, naked, but not how he imagined it. Her EYES OPEN. Startling Malcolm. She looks at him wide eyed, PUPILS fully DILATED. She then takes out her pacifier. Smiles. HURLS on Malcolm’s chest. MALCOLM AHHHHH!!!! What the fuck! He pushes her off. She rolls on the floor with a loud THUD. Malcolm bolts to the sink, frantically washing the VOMIT off of his body. He looks on as Lily writhes on the floor. BABBLING AND SLURRING. Grabbing and pulling at her sweaty skin like she’s trying to take off a tight sweater.  59.",
      "characters": [],
      "action_text": "LILY It’s fucking hot! She tries to move, but can barely control her limbs. Tries to talk, but only chopped and screwed sounds come out of her mouth. Then her EYES ROLL BACK into her head. She CONVULSES. Then goes still. Silent. MALCOLM Lily? He rushes over. Shakes her. She is still. MALCOLM Come on. Fuck! Wake up! She’s limp. He smacks her face lightly. Nothing. He smacks her harder. Still nothing. MALCOLM Fuck! (beat) OK. OK. OK. I got it. He runs water in the BATHTUB. While he waits for it to fill up, he goes over to Lily. Lifts her up from behind, his arms wrapped under her armpits. Drags her naked body to the edge of the tub. He sits her up. The water is over half way filled. He waits for it to fill a little more. Malcolm takes a deep breath, then pushes her backward into the tub. She FALLS in SLOW MOTION. As she hits the water, the image RAMPS BACK TO normal. Malcolm waits a moment. She doesn’t move and now she’s underwater. AIR BUBBLES float to the surface of the water from her nose and mouth. MALCOLM FUCK! He pulls her out of the water. She gags up water, but doesn’t wake. He then dials his phone: 9-1-1. 911 OPERATOR 9-1-1. What’s your emergency?  60. MALCOLM Yeah. I have a girl here that I think is OD’ing. 911 OPERATOR Do you know what she took? MALCOLM I don’t know! Molly I think! 911 OPERATOR Is she breathing? MALCOLM Yeah I think. I know she was before. I tried to give her the kick. 911 OPERATOR The kick? MALCOLM Yeah. The kick! The feeling of falling in water that wakes you up out of a dream. Like in Inception! The kick! 911 OPERATOR You dropped her in water?! MALCOLM Yeah, but it didn’t work! 911 OPERATOR That’s cause that was a movie! You need to get her to a hospital, now. Where are you? I’ll send an ambulance. MALCOLM I’m at... Malcolm thinks better of sending ambulances and police to the house of a drug dealer.   He hangs up. Picks up the DOPE.  61.",
      "dialogue_count": 0,
      "word_count": 650
    },
    {
      "scene_number": 7,
      "slugline": "INT. GUEST HOUSE - STUDIO Malcolm throws on his clothes. Throws the DOPE back into his BACKPACK. Slings it on his shoulder. INT. GUEST HOUSE - HALLWAY Malcolm drags Lily out of the bathroom and up the stairs. INT. GUEST HOUSE - BEDROOM. He drops her on the bed. Scrambles around. Searching. Finds a SET OF KEYS on her desk. Grabs them. INT. GARAGE - MOMENTS LATER Malcolm walks into the FOUR CAR GARAGE. Presses the alarm button. A BRIGHT YELLOW FIAT 500L’s door unlocks. Malcolm shoves Lily in the back seat. EXT. STREETS OF INGLEWOOD, CA - LATER MUSIC CUE: “SABOTAGE” - BEASTIE BOYS The small yellow car sticks out like a sore thumb as it moves along with the traffic. INT. LILY’S FIAT - CONTINUOUS Malcolm nervously drives. He stops at a light. A POLICE CAR drives by. The officer in the passenger’s seat looks at Malcolm as he passes. Malcolm looks at the police car in the rear view. Praying it doesn’t turn around. It stops. The police car turns on its lights. Heads toward Malcolm. MALCOLM No! no! Come on! The police car then quickly turns left and speeds away. Malcolm lets out a relieved breath. Cars HONK as the light turned green a minute ago. Like out of a cartoon, Lily SPRINGS AWAKE off the sound of the car horn. She SCREAMS as Malcolm drives.  62.",
      "characters": [],
      "action_text": "LILY I NEED TO PEE! I NEED TO PEE! MALCOLM Lily it’s me! Calm the fuck down! LILY WHO ARE YOU?! LET ME GO TO THE BATHROOM! THIS IS MY HOUSE!GET OUT OF MY HOUSE! She begins to PUNCH Malcolm in the back of the head from the back seat! Malcolm slams on the brakes, swerves to the side of the road. SIDE SWIPES the CAR in front of him. His AIR BAG OPENS in his face. Lily opens the door of the car. JUMPS out. MALCOLM Lily! Lily, stumbles as she crosses traffic. Cars swerving wildly to avoid her. She crosses the street and frantically runs into the LADERA CENTER strip mall, naked, covered in vomit. Malcolm is shaken from the collision. He pushes the air bag from him. Looks and sees LILY squatting and pissing on a curb in front of STARBUCKS. Security guards approach her. But that isn’t the craziest thing he is seeing. As he focuses on the car that he crashed into, he notices it is a RED EL CAMINO. And the angry guys getting out are The Voice and his partner. They look at Malcolm. Recognize him. Malcolm starts the car. The Voice runs up to Malcolm’s window. Grabs him. Malcolm slams on the gas sending the smashed up car in reverse. The Voice loses his grip. Malcolm then quickly puts the car in drive, speeds away. The Voice gets in the Red El Camino. Follows. INT. LILY’S FIAT - SAME Sirens are BLARING all around as Malcolm approaches the intersection. But even though the light is green, no one is moving. Malcolm HONKS. MALCOLM MOVE BITCHES!  63. Malcolm swerves into the PARKING LANE and speeds into the intersection. The El Camino follows. Malcolm slams the breaks as a FORD SHELBY races by, barely missing the Fiat. Malcolm looks at the car, sees JALEEL behind the wheel. The image SLOWS...as Malcolm makes eye contact with Jaleel. MALCOLM What the fuck? The image FREEZES as we hear... MUSIC CUE: “DROP” - THE PHARCYDE MALCOLM ?kcuf eht tahW The images MOVE   BACKWARDS   IN TIME following Jaleel in an homage to the SPIKE JONZE directed Pharcyde music video. Jaleel’s Shelby moves BAC",
      "dialogue_count": 0,
      "word_count": 2788
    },
    {
      "scene_number": 8,
      "slugline": "EXT. BUS STOP - LATER Malcolm sits on a bus stop. Waiting. Thinking. Moments later the bus pulls up. Opens the door. Malcolm stands. He turns and looks at the backpack still sitting on the bench. Should he leave it? He grabs the backpack. The weight of it on his back feels more heavy. LISA (VOICE) You getting on? Malcolm turns. Sees his mother behind the wheel of the bus. She smiles, surprised to see him. He walks up the stairs. Lisa knows something is wrong. LISA Looks like you and I had the same kind of day. How was the interview? Malcolm fights back the tears. LISA Sit down. My shift is almost over. Then I’ll take you home. MUSIC CUE: “HOME IS WHERE THE HATRED IS” - GIL SCOTT-HERON At this moment, the sound of that is not so appealing. He walks to the back of the bus. Sits. Looks out the window as Culver City turns to Inglewood. The images becoming more and more blighted. He sees the CRIME SCENE that is FABULOUS BURGER. Detectives and EMT’s mill about. The bus makes its stops. Letting people on and off. Tired laborers happy to have a day’s pay. Young mothers wrangling sleepy children. Hustlers hocking bootleg movies. Old men using walkers held together with duct tape. Old women who clutch their purses closer as teens in hoodies get on. As Malcolm looks at the hoodies: It’s Jib and Diggy. They just look at each other. Nod. Jib and Diggy sit next to Malcolm. No one says anything. There’s too much to say. There’s nothing to say. They just look out the window. Bobbing their heads to the GIL SCOTT HERON song.  75.",
      "characters": [],
      "action_text": "The bus rolls to the next stop: NAKIA gets on. Holding her books. She looks up. Sees Malcolm. Nods. Then takes a seat, looks out the window. Bobbing her head to the song. At the next stop: DOM. He nods at Malcolm. Sits. As TIME ELAPSES this continues: LILY, JALEEL, BUG, WYTONY, THE VOICE, HIS PARTNER. They all look out at the streets of Inglewood. Bob their heads to the music. Listen to Gil Scot Heron’s words: “ HOME IS WHERE THE HATRED IS. HOME IS FILLED WITH PAIN. AND IT MIGHT NOT BE SUCH A BAD IDEA. IF I NEVER WENT HOME AGAIN. ” People exit the bus. One by one. Until it is just Malcolm in the back seat. Alone. Tears in his eyes. LISA (VOICE) Malcolm. INT. BUS - NIGHT Malcolm wakes up. Looks around at the empty bus. At his mom’s face. For a moment, he thinks maybe this entire past couple of days has been a dream. He then sees the BACKPACK.   Heart sinks. His mom sits next to him. The radio is playing over the bus’ speakers. Tuned to an OLDIES STATION now that the bus is empty. DONNY HATHAWAY sings a live version of “SOMEDAY WE’LL ALL BE FREE”. Lisa looks Malcolm in the eyes. Proud. LISA My son is applying to Harvard. I barely got out of high school. Malcolm I wish I could help you with your school work, or give you advice about taking the SAT, or your application process and interviews. But I can’t. And I’m sorry. Lisa touches the side of his face. LISA You’ve always had to figure things out on your own. And praise God, you always have. So I know you’ll figure this out too.  76. OFF of Malcolm’s heartened, but conflicted expression. REPORTER (V.O.) The incident took place today at Starbucks in the Ladera Center. EXT. STARBUCKS - LADERA CENTER - NEWS FOOTAGE We see the TV IMAGE of an older Black Man wearing a RASTAFARIAN HAT and a “YOLO” T-SHIRT. REPORTER (V.O.) ...apparently the side effects of the popular club drug, MDMA, or Molly. Tannehill James was a witness to the bizarre scene. TANNEHILL JAMES So I’m at Magic Johnson’s Starbuck drinking my vanilla chai latte",
      "dialogue_count": 0,
      "word_count": 1330
    },
    {
      "scene_number": 9,
      "slugline": "INT. NON DESCRIPT ROOM - DAY MUSIC CUE: “REBIRTH OF SLICK(COOL LIKE DAT)”- DIGABLE PLANETS WILL SHERWOOD looks into the camera. He wears a blazer over a Steven Alan reverse seam shirt and skinny jeans. His curly hair peeks under his WATCHMAN CAP. NARRATOR (V.O.) William Ian Sherwood the third. Musician, scholar, rake, entrepreneur, conspiracy theorist. He POPS some PILLS. Gets a TWITTER ALERT, looks at the message from Malcolm: NEED TO MEET ASAP. NARRATOR (V.O.) Malcolm, Jib, And Diggy met William at band camp three years ago. EXT. BAND CAMP - DAY While bands do sound checks, practice and rehearse, Will just leans on a speaker. WILL If you niggas want some weed I can get you some. Good shit. Fair prices. Malcolm, Jib and Diggy look at each other. Diggy SLAPS him hard across the face. Will cups his sore cheek. Shocked. NARRATOR (V.O.) William assured them he used the word nigga only as a term of endearment as explained by Q-tip in the classic song Sucka Nigga. After that, they all hit it off. Though he never used the word in front of them again. INT. DORMITORY - BAND CAMP SITE Malcolm, Jib, and Diggy and Will play music, laugh, talk.  81.",
      "characters": [],
      "action_text": "NARRATOR (V.O.) The mission of band camp was to give kids from different backgrounds a chance to exchange music and experiences unique to their cultures. JIB So you’re saying white girls suck dick yet claim they’re still virgins? WILL (laughs) I’m serious. I’ve been getting head since I was like twelve. Hitting hoes in the ass since I was fourteen. They’ll let you fill any hole other than their pussy with a dick, no problem. MALCOLM So technically you’re a virgin too? WILL Yeah. But here’s something to wrap your brain around. I’ve never had intercourse with a pussy. Just asshole and oral. So the question isn’t am I technically a virgin. The question could be am I technically gay? JIB That’s deep, nigga. INT. SHERWOOD RESIDENCE - WILL’S BEDROOM William operates a VOLCANO VAPORIZER. Twists the DIAL to heat it up. Fills the VALVE with weed. Puts the valve BALLOON on the machine. The BALLOON fills with vapor. He takes off the balloon and INHALES the vapor. An idea hits him! WILL Small batch. Craft brewed. 40 ounce Malt liquor.  82. He giggles at his “brilliant” idea. Begins writing in a notebook: ORGANIC BARLEY, CASCADE HOPS, RECLAIMED 40 oz BOTTLES (sustainable). NARRATOR (V.O.) William went to El Segundo High. He smoked a pound of weed a week, skipped classes, and had a 1.9 G.P.A. Yet got a perfect score on his SAT. He was accepted to his father’s alma mater under academic probation. Which meant he had to maintain a 3.0 Grade point average. INT. UNIVERSITY OF SOUTHERN CALIFORNIA - SERVER ROOM - NIGHT SECURITY CAM FOOTAGE: Shows Will, dressed in a HOODIE, a GUY FAWKES MASK, SUNGLASSES. He takes a LAPTOP out of his back pack and connects it to a sever. Takes out a SPRAY PAINT CAN. INT. UNIVERSITY OF SOUTHERN CALIFORNIA - SERVER ROOM - NEXT DAY Campus police and School officials look at the servers. NARRATOR (V.O.) So, William hacked into the USC database. Erasing all grades for the entire freshman class. The servers are tagged with GRAFFITI: SAMO SAVES IDIOTS AND GONZOI",
      "dialogue_count": 0,
      "word_count": 1318
    },
    {
      "scene_number": 10,
      "slugline": "EXT. MORNINGSIDE HIGH SCHOOL - INGLEWOOD, CA - MORNING Malcolm, Jib and Diggy stand in front of the school. Malcolm gives a sly smile. MALCOLM Here. JIB Are you retarded?! MALCOLM It’s perfect. It’s got everything we need. Science lab, computers, supplies. And best of all. Watch. Malcolm walks through security. Once again the alarm goes off and he gets BARKED at by Stacey’s K-9. Once again Stacey waves him by. No harm, no foul. INT. MORNINGSIDE HIGH SCHOOL - CONTINUOUS Malcolm looks back at his friends. He goes to his LOCKER and puts the backpack full of dope INSIDE. MALCOLM No one will suspect us. We’re just geeks. Doing what geeks do. INT. MORNINGSIDE HIGH SCHOOL - INGLEWOOD, CA - AFTER SCHOOL Malcolm , Jib and Diggy are again the lone kids in the computer lab. Malcolm inserts a FLASH DRIVE. He types on the computer. UPLOADS the photos to their WEB STOREFRONT. He then uploads DOCUMENTS to set up a MT.GOX BITCOIN WALLET. INT. MORNINGSIDE HIGH SCHOOL - PRINCIPAL’S OFFICE Outside the office are a motley crew of knuckleheads and teenage miscreants awaiting punishment. Inside, Malcolm, Jib and Diggy chat with the Principal. PRINCIPAL The Google Science Fair. That’s pretty ambitious.  88.",
      "characters": [],
      "action_text": "MALCOLM I know, but I want to try to represent Morningside. Show we’re more than our reputation. INT. MORNINGSIDE HIGH SCHOOL - SCIENCE LAB - LATER Malcolm talks to a Science Teacher. The teacher flips through the SCIENCE PROJECT PROPOSAL. He looks like he’s reading a book in a foreign language. SCIENCE TEACHER Uh, yeah. So, Principal Blackmon told me you’d need access to the science and computer labs. They don’t really pay us for after school, you know. MALCOLM We just need you to open up the labs. We’ll do everything else. SCIENCE TEACHER That’s it? Just unlock it? Malcolm nods. The Science Teacher is relieved. SCIENCE TEACHER Cool. Not that I don’t want to help, it’s just I’m here on AmeriCorps to pay off my student loan. Hell, you probably know more than me. INT. MORNINGSIDE HIGH SCHOOL - MUSIC ROOM - LUNCH HOUR Malcolm and his friends rehearse. Afterward, they do an inventory of the items they can use that are being stored in the auditorium: BOXES, ENVELOPES, TAPE, FOAM, BUBBLE WRAP. INT. MORNINGSIDE HIGH SCHOOL - COMPUTER LAB - LATER They all sit around the computer. WILL is on the screen via video chat. He looks at Jib and Diggy. Nods. Malcolm hits ENTER. The WEBPAGE opens. Pictures of the MOLLY come up.  89. WILL Congratulations. Now we gotta get you some customers. My house is having a party. Could use a good band. Malcolm, Jib and Diggy look at each other. INT. TKE HOUSE - THE ROW - USC CAMPUS - NIGHT A DJ plays: The house is packed full of FRAT BOYS and COEDS. The typical scene as booze and other substances are consumed. Buzzed girls dance as buzzed boys gaze. Malcolm, Jib and Diggy nervously look at the crowd. They’ve never really performed in front of a real audience. They go through their mic check. Malcolm spots WILL in the crowd giving the DOPE to one of his Frat brothers: LANCE, the one that bought pills from Dom. LANCE (laughing) Saw your bitch on You Tube. WILL Lily ain’t my bitch anymore, fuck her. But you know what? She was using this. Shows him",
      "dialogue_count": 0,
      "word_count": 1153
    },
    {
      "scene_number": 11,
      "slugline": "INT. MORNINGSIDE HIGH SCHOOL - SCIENCE LAB - NEXT DAY The SCIENCE TEACHER is packing up at his desk. He looks at Malcolm, Jib and Diggy at work. SCIENCE TEACHER Make sure you turn off everything when you leave. Jib locks the door. Stands at the door as a look out. They get to work. Malcolm nervously takes out the package of Molly. Tries to weigh it on a SCALE, but his hands are shaking and he spills it. Damn. He quickly cleans it up. Diggy, more steady handed, takes over. Weighs the portion. Malcolm then carefully bags the CRYSTAL POWDER like Will instructed. Malcolm puts the BOX in his BACKPACK. INT. UPS FACILITY - EVENING Malcolm nervously fills out the ADDRESS LABEL. He wears LARGE DARK TINTED LAB GOGGLES, trying to be Mr. Incognito. He walks up to the LADY at the counter. Hands her the label. She looks him up and down. Shakes her head. UPS LADY And how are you paying? MALCOLM Uh. Yeah. I have an account number. She hands back the form. Points to the space to fill in the number. Motions for Malcolm to step to the side, so she can help other customers in line. Malcolm moves over. Takes out his phone. Pulls up a number: 5X4578. MALCOLM (whispers to himself) This better work, Will. He moves back to the UPS lady. Hands her the form. Waits anxiously as she types the number into the computer.   She looks at the screen. Then up at him. Malcolm gives an uneasy smile. They stare at each other. UPS LADY You wanna give me the package?  93.",
      "characters": [],
      "action_text": "Malcolm lets out a nervous laugh, hands her the package, hurries out. EXT. DIE ANTWOORD CONCERT - NIGHT Die Antwoord performs “I FINK U FREEKY” at the packed rave. The crowd is going wild, jumping up and down to the South African group’s brand of EDM with hard core hip hop called ZEF. In the middle of the frenzy is the HACKER, face still BLURRED and PIXILATED, high on Lily. He SHARES his MDMA stash with other PARTY GOERS. INT. MORNINGSIDE HIGH SCHOOL - COMPUTER LAB BEEP. BEEP. BEEP. Three more ORDERS.   Moments later there are several more ORDERS that rapidly come in. Bitcoins fill his wallet. Malcolm is excited. Amazed. Overwhelmed. INT. UPS FACILITY Malcolm, again wearing large dark lab goggles, fills out DOZENS of LABELS. Hands them to the UPS LADY. She’s annoyed at having to type in everything manually. SERIES OF SHOTS: We view a COLLAGE of YOU TUBE, INSTAGRAM PICS, VINE CLIPS of various people, parties, concerts, dorms, etc. that have ordered “Lily”. From a TRAP PARTY in Atlanta to the ELECTRIC DAISY CARNIVAL in Las Vegas, to bored rural kids in Nebraska, to socialites in Tribeca... INT. MORNINGSIDE HIGH SCHOOL - HALLWAY - DAY The PRINCIPAL leads a delegation of ADMINISTRATORS from the BOARD OF EDUCATION. He opens the door to the COMPUTER LAB where Malcolm, Jib and Diggy are working. PRINCIPAL These three have entered the Google Science Fair. They are an example of the system working. That Public Education is still a ladder to success.  94. The delegation applauds. The Principal gives them a thumbs up. They all return the gesture. EXT. STREET OF INGLEWOOD, CA - NIGHT A group of DRUG DEALERS on the corner run from the POLICE. A few are caught, cuffed, and shoved into the police cars. Malcolm and his friends look at the scene from a distance as they ride by on their bikes. INT. MORNINGSIDE HIGH SCHOOL - COMPUTER LAB - NIGHT Malcolm is on the UPS WEBSITE. He YAWNS as he types in ACCOUNT NUMBER 5X4578.   He prints out a SHIPPING MANIFEST. HIGHLIGHTS addresses. Prin",
      "dialogue_count": 0,
      "word_count": 1892
    },
    {
      "scene_number": 12,
      "slugline": "INT. MORNINGSIDE HIGH SCHOOL - BATHROOM   - CONTINUOUS The Police Officer looks around. The dog SNIFFS around. NOTHING. He looks in the stalls. NOTHING. He then looks out the window. EXT. MORNINGSIDE HIGH SCHOOL - SAME Malcolm is dangling from the window on the ledge like Harold Lloyd in Safety Last. He lifts himself up. Peeks inside and sees the Officer leave. He then STRUGGLES and lifts himself back up inside. INT. MORNINGSIDE HIGH SCHOOL - THIRD FLOOR - BATHROOM Malcolm slowly opens the door, watches Officer Bradley and the dog sniffing other lockers. He looks the other way. It’s CLEAR. Malcolm exits. INT. MORNINGSIDE HIGH SCHOOL - HALLWAY Malcolm runs down the stairs, turns a corner. BAM. Runs into STACEY. Hits the floor. His BACKPACK flies off and SLIDES down the hall. STACEY What the hell are you doing? Malcolm stares at the backpack as Stacey picks it up. Officer Bradley and his dog walk down the same hall toward them. MALCOLM SAT. I just needed to use the bathroom. I’m late getting back. Can I get my backpack? Stacey looks at him for a moment. Hands him the backpack. STACEY Good luck, little man. Malcolm runs away just as Officer Bradley approaches. When he is clear he looks INSIDE his backpack: A SMALL amount of DOPE still left over and DOM’S GUN. He zips up the backpack. Releases the breath he’s been holding.  101.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 237
    },
    {
      "scene_number": 13,
      "slugline": "INT. MORNINGSIDE HIGH SCHOOL - FIRST FLOOR Malcolm runs to the test taking room as Jib, Diggy, and the Staff Person turn the corner. JIB See. There he is. He gives a nod. They walk to Malcolm who shows them the backpack. They are all relieved, until they look inside the classroom and realize the next section has started. They quickly run in. EXT. MORNINGSIDE HIGH SCHOOL - LATER SAT’s complete. Malcolm and his friends wearily walk home. JIB Yo. Man, I’m not sure I can do this shit anymore. DIGGY Yeah, I barely finished the SAT. And I got a C minus on that Pre Calculus test the other day. JIB Some of us don’t have photogenic brains. We have to study for shit. MALCOLM I think I can fix this, but I can’t do it by myself. Yo come on, we’re almost there. The shit’s almost gone. Please. JIB I’m sorry. I’m not built for this. Malcolm looks at Diggy. She doesn’t say anything, but its clear she’s very reluctant to go on. MALCOLM (hurt) That’s fine. It’s cool. I know this shit is my fault. So it’s my weight to carry.  102.",
      "characters": [],
      "action_text": "Malcolm quickly walks away. DIGGY That’s bullshit. Malcolm stops. Turns back. DIGGY We all wanted to go to Dom’s party. Especially you, Jib. So it’s our weight too. We got your back. To the end. Right? She looks at Jib. Though still a bit reluctant, he gives Malcolm a nod. INT. DRUG ENFORCEMENT AGENCY - LOS ANGELES OFFICE - DAY A Tech walks into the office of an Agent. He types on the agent’s computer. Shows him the screen. It’s MALCOLM’S WEBPAGE full of pure MDMA. The agent looks at the photos. TECH Popped up about a few weeks ago. Look what they’re moving? And major volume, too. AGENT Why are they calling it Lily? TECH I don’t know. Maybe Chief Keef called it that on a mix tape. AGENT Who? Whatever. Can you trace it? INT. TKE HOUSE - USC CAMPUS - WILL’S ROOM - DAY Will takes a hit from his BLUE PLOOM VAPORIZER. Offers some to Malcolm, Jib and Diggy. They refuse. Malcolm reaches into his backpack, digs under Dom’s gun and hands Will the remaining ounces of DOPE. Will’s pay. He BEAMS with excitement. WILL Gracias.  103. MALCOLM So once we get the bitcoins now what? I need cash. WILL You have to do a currency exchange to get the US dollar equivalent. Which sort of defeats the purpose of a non fiat currency. MALCOLM Ok, say I don’t give a fuck about all that Aaron Swartz, Occupy Wall Street shit. WILL You have to link your bitcoin account to a bank account. And there’s an infinitesimally small chance it could get traced. Even so, the feds would have to... He takes another hit of the vapor. Loses his train of thought. Looks at Malcolm, Jib and Diggy like, “what are you looking at?” He takes out his “pay”. Prepares it. DIGGY The Feds would have to what?! WILL Feds? Oh, yeah, yeah, yeah. They would have to know exactly what to look for. It’s nothing they could find randomly. I’d have to make just a stupid ass mistake for them to trace it. And do I look like the kind of nigga that makes stupid ass mistakes? They look at him as he snorts the MDMA powder. INT. WAREHOUSE - G",
      "dialogue_count": 0,
      "word_count": 3469
    },
    {
      "scene_number": 14,
      "slugline": "INT. NAKIA’S APARTMENT - CONTINUOUS Nakia is at the door. Watching Malcolm through the peep hole. The note hits her foot. She picks it up: GOOD LUCK. INT. CLASSROOM - DAY Nakia takes her GED with dozens of other people of various ages, races. INT. MORNINGSIDE HIGH SCHOOL - GYMNASIUM - PROM NIGHT The school’s having its PROM. Couples slow dance wearing rented tuxedos and non red carpet ready dresses. Malcolm and his friends are all in TUXEDOS. The PHOTOGRAPHER is taking their pictures. Jib has a CLOCK around his neck and poses like Flava Flav. LATER Malcolm sits by himself. Watching people dance enjoy themselves. He sees something, someone standing in the doorway. He beams hoping it’s Nakia. But as he looks closer he sees it’s not. He gets a TEXT ALERT on his phone. He takes it out. Looks: A PHOTO OF LILY. Post rehab. SMILING. She looks well. Maybe even happy. The text reads:   say cheese . He smiles, takes a selfie. Clicks send. Lily sends one more TEXT:   happy?   He thinks about that question. Notices something attached to the text:   an MP4 FILE . He CLICKS on it. Listens. Lights up, recognizing the song. INT. MORNINGSIDE HIGH SCHOOL - GYMNASIUM - PROM NIGHT Couples are slow dancing to BRUNO MARS “ WHEN I WAS YOUR MAN”. But soon the song stops mid song... MALCOLM (VOICE) (over P.A.) This is a public service announcement. Your regularly scheduled Prom music has been hacked by a band called... Dope!  118.",
      "characters": [],
      "action_text": "The confused prom-goers look around as NEW SONG plays over the speaker: It’s the punk version of ELECTRIC RELAXATION that Dope recorded with Jaleel. Jib and Diggy are stuffing their mouths with cheap hor d'oeuvres when they recognize their voices. Their music. They scream with excitement. Look out on the dance floor and see MALCOLM. They run over and join him. The other Morningside kids stand and look confused, annoyed. Some laugh at the song, others are into it. Oblivious to their surroundings, Malcolm and his friends look at each other. Listen to their music. Knowing soon they will all be going their separate ways. They laugh a little harder, hold hugs a little longer. EXT. MALCOLM’S HOUSE - NIGHT Malcolm, bow tie undone, walks toward his house. NAKIA is standing outside. Waiting. Malcolm’s heart fills when he sees her. NAKIA Nice haircut. I like it. MALCOLM I’m sorry about the things I said. There was a lot going on at the time, but that wasn’t me. NAKIA Yes it was. You may have all these other folks fooled, but not me. You’re... (smiles) Complicated. Malcolm looks at her. Does she know? NAKIA Anyway. I just wanted to say thank you. MALCOLM You passed the test? She nods, smiles.  119. MALCOLM But Prom. You said-- NAKIA I told you I didn’t miss not going to Prom. She hands him something. He looks: TICKETS TO MAGIC MOUNTAIN. INT./ EXT. SIX FLAGS MAGIC MOUNTAIN - DAY TO NIGHT MONTAGE of Nakia and Malcolm at the amusement park. Riding SUPERMAN, COLOSSUS, WATER RIDE (Where Malcolm tries to cop a feel). They laugh, scream their heads off, eat terribly delicious greasy food. Ride more coasters into the night. They watch FIREWORKS as Nakia lays her head on Malcolm’s shoulder. EXT. MALCOLM’S HOUSE - NIGHT Malcolm walks in. Dizzy. Buzzing. His Mom is asleep on the couch after a long day’s work. The TV still on: a JACOBY’S CHECK CASHING COMMERCIAL.   Malcolm turns it off. INT. MALCOLM’S HOUSE - BEDROOM He walks into his bedroom and sees an ENVELOPE from HARVARD on his pillo",
      "dialogue_count": 0,
      "word_count": 656
    }
  ]
}