{
  "slug": "downhill-2020",
  "title": "downhill",
  "genre": "drama",
  "format": "film",
  "scenes_count": 10,
  "characters_count": 0,
  "characters": [],
  "total_words": 18068,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. HOTEL LOBBY - DAY - MOMENTS LATER  Pete and Billie approach RECEPTION as a group of MIDDLE-AGED GUYS on a men-only weekend are laughing/flirting with the FEMALE RECEPTIONIST. The GUYS depart, laughing. The receptionist is momentarily called away. CHARLOTTE (50s), a worldly Scandinavian woman, approaches.   *  She has packets of documents under her arm and an air of someone very happy. (NOTE: She’s on the same side of the counter as Billie/Pete.) CHARLOTTE Hello. I’m Charlotte. So. The flight was okay? What time did you check in? BILLIE Oh, uh, hi. Midday. Yes. All good. PETE   *  I wanted us to get right out on the mountain. Billie and Peter, confused by Charlotte’s role, glance back   *  in the direction of where the Receptionist had been.   *  CHARLOTTE Well, sorry I wasn’t there to meet you. Now, what the fuck have I got for you? Billie and Peter clock one another. However, there’s little time to process as Charlotte is a whirlwind of peculiarities. She gives them envelopes, key cards and maps.   *  CHARLOTTE (CONT’D) Okay. Resort map. Key cards. Um, ski passes you got, right?   *  With the pack?   *  Finn and Emerson run up, grabbing onto Billie. She settles them. CHARLOTTE (CONT’D) Well, hello, handsome ones. BILLIE This is Finn and Emerson. Our sons. CHARLOTTE Hello tiny men, yes?  JA 1st   10.",
      "characters": [],
      "action_text": "BILLIE So, I’m curious.   Are there   more   *  kids around? CHARLOTTE Oh yes. Many. Pete glances at Billie: “See?” CHARLOTTE (CONT’D) Not here. The town of Fiss-- Maybe, minutes of 20 from here-- Yes, there is all families. Billie looks at Pete: “Did you know this?” But, Pete shrugs and shakes his head. It seems genuine, at least.   *  CHARLOTTE (CONT’D) But, here better, yes? Is lively. The Ibiza of the Alps. Ski hard. Then, party as hardest. Yes? But, she offers no time for them to answer or process... CHARLOTTE (CONT’D) Yes! Okay. Now. Restaurant recommendations. Around the centre you will find quite fine dining, quite upmarket. And in the sauna. She pronounces it Scandinavian style ‘sow-nah’. CHARLOTTE (CONT’D) In Europe it’s considered unhygienic to sauna in your swim suits. So, please, the body is not to be ashamed of, yes? BILLIE Well, speak for yourself. CHARLOTTE (dead serious) No. Your body is good. Celebrate it.   (nod to Pete)   *  Both. Charlotte stays locked on them, waiting for confirmation. PETE  ... Thank you.   BILLIE  No, yeah. Celebrate. Thank  you.   *  JA 1st   11. CHARLOTTE (CONT’D) (pleased, back to business) For your skiing, there are the easy runs on the Austrian side. Over the other, if you like, you can go crazy in Switzerland. BILLIE Switzerland? CHARLOTTE Over the top is Switzerland and everything is different. And so any questions? Maybe they do, but Charlotte doesn’t wait for them... CHARLOTTE (CONT’D) Okay, so. We are finished. I’m here as friend, yes? Do you want to be   *  my friend? The slightly odd phrasing and European directness throws them   *  off. She holds their gaze.   *  PETE  Um--   BILLIE ... Yes?   *  CHARLOTTE (CONT’D) Good. Then, we are friends.   *  Charlotte laughs. So, naturally Billie and Peter laugh. Charlotte gives them her card. CHARLOTTE (CONT’D) Please call me. You are American. You have paid, so you must have everything! As they make “good-byes,” Billie and Peter fumble with their   *  bags.   They speak i",
      "dialogue_count": 0,
      "word_count": 3474
    },
    {
      "scene_number": 2,
      "slugline": "INT. HOTEL CORRIDOR - NIGHT  Billie and Peter walk down to dinner. Glances exchanged. Smiles, flashed. Billie grapples. A need to start a talk.   *  Just as she’s about to speak-- An enthusiastic ITALIAN COUPLE exit their room up ahead, mid- conversation. They continue down the corridor just ahead of Billie and Peter. Peter lets the back of his hand brush Billie’s. He offers a hand-hold. Billie doesn’t take it right away, but eventually gives in and they walk interlinked. The Italian Couple peels off down a different corridor. Back to silence. Billie lets her hand go passive, letting Pete’s fingers ride interlinked with hers, but with no grip between them. They slip away.   *  INT. HOTEL RESTAURANT - NIGHT  Peter and Billie are waiting to be seated. She glances at Pete, a desire to start. Pete stays focused ahead. He feels   *  her gaze but chooses to be oblivious.   *  BILLIE ... So,... CHARLOTTE (O.S.) Yay! My good friends! Yes!   *  ON CHARLOTTE in a banquette, waving. Her dinner companion, CHARLIE, a slightly older British fellow, is excusing himself to the restroom. ON BILLIE/PETE, waving back.   *  PETE (aside) I think she wants us to... BILLIE (aside) She’s just waving... Charlotte’s wave becomes a “waving over.” She gestures for   *  them to “join.” BILLIE (CONT’D) Let’s just make an excuse... There’s NO WAY she heard that, but...  JA 1st   27.",
      "characters": [],
      "action_text": "CHARLOTTE (calling over) There is no reason I take! Off Pete, giving a “What are we going to do?” to Billie,   *  we...   *  INT. HOTEL RESTAURANT - NIGHT - A LITTLE LATER  Peter and Billie are opposite Charlotte. A WAITER delivers “first” drinks for Billie and Pete and “another round” for Charlotte and her companion (still in bathroom.) CHARLOTTE (to Waiter) And, bring another for my friends. BILLIE  Oh, I’m not sure I’ll...   PETE  Yeah, I’m good for...  CHARLOTTE (CONT’D) No smart to get now. Bar is crazy. The Ibiza of the Alps, yes? The Waiter heads off. CHARLOTTE (CONT’D) I drink if you not. Going to clubs. Charlotte does a small “dance groove.” Pete attempts to fish out her precise role.   *  PETE That’s nice. So, a night off from-- (off Charlotte, not clicking in) Do you find you get enough time off from your duties as a... ? But, still no such luck-- CHARLOTTE Oh sure. Enough to catch a dick whenever I want! Billie swallows with a gulp. PETER That’s... great.   BILLIE ... Time is nice.  Charlie returns to the table. He slides next to Charlotte.  JA 1st   28. CHARLOTTE (CONT’D) (introducing) Charlie, this is Billie and Pete.   *  (then) I was just talking about you? CHARLIE All good, I hope?   *  BILLIE (with meaning) Uh-huh, sure. Charlie is gossipy and pally.   *  CHARLIE What did she say? BILLIE Oh. Um? CHARLOTTE I said I can always catch a dick when I like. She smiles. Playful. But he’s not quite up to the challenge of being so comic-casual about their liaison. CHARLIE Oh. Oh, right?   *  Charlie takes a swig of his drink. Smiles. CHARLOTTE Yeah? CHARLIE I mean. Okay, I just thought --   *  CHARLOTTE I was kidding! (off his slightly hurt look) Why, you think we’re getting married? CHARLIE No! God. No. (beat, then) I just thought. I had a nice time today? This afternoon?   *  CHARLOTTE Uh-huh.  JA 1st   29. Charlie looks at her - aren’t you going to give me more? Weird beat. Pete tries to break it... PETER And, you two know each other from...?   *  CHARLIE",
      "dialogue_count": 0,
      "word_count": 2785
    },
    {
      "scene_number": 3,
      "slugline": "EXT. HOTEL - DAY  The family waits out front in ski-gear. Silent and grumpy.   *  EMERSON Where are we going? PETER It’s a treat. It’s a Daddy surprise. Should I tell them? Billie is thinking about practicalities. The kids are hungry, whiney. BILLIE Should I get us something from the buffet? Peter checks his watch. PETE ... We   are   late... BILLIE   *  Maybe fruit? Something? Their CAR is pulled around by a VALET.   *  PETE   *  It’ll be fine. Let’s go.   *  Billie grapples, but goes with no buffet...   *  EXT. HELICOPTER LANDING AREA - DAY  At a small airfield. The SUV arrives, pulling up next to a Heli-Ski company jeep. Another YOUNG COUPLE are waiting in a small helicopter. There’s a PILOT hanging by the chopper. A young HELI SKI   *  EMPLOYEE approaches with her clipboard. PETER (jumping out, eager) Okay, we’re here! Sorry.   *  HELI SKI EMPLOYEE The Stantons? PETER Uh-huh. Yup. Yes. That’s us. Peter unloads all the equipment.  JA 1st   41.",
      "characters": [],
      "action_text": "PETE (to Twins) It’s heli-skiing, guys! Sweet, right? FINN Yeah! Em seems less enthused. PETE Yeah, it’s Daddy’s treat! EMERSON ... I’m hungry. PETE Once you get in that powder, buddy, you’ll forget about that! BILLIE (to Em) Maybe, they have a protein bar or something. HELI SKI EMPLOYEE They were just about to go.   *  PETE Yep. Sorry. We overslept. The chopper blades start going. BILLIE Do you have a bar? The Employee does not understand “a bar.” She takes a stab at   *  an understanding.   *  HELI SKI EMPLOYEE   *  ... Uh, yes. This is a seatbelt.   *  BILLIE   *  ... What?   *  HELI SKI EMPLOYEE   *  What?   *  With the chopper going, it’s loud. Everyone has to shout.   *  HELI SKI EMPLOYEE (CONT’D) We should climb on...  JA 1st   42. Pete’s gathering all the equipment up. She doesn’t have to say that twice. BILLIE Oh. Okay. Is there a briefing now?   *  Things we should know...?   *  HELI SKI EMPLOYEE We can do it on the way.   *  PETER Are we good? EMERSON ... Where’s my glove? But, no one hears him. BILLIE (to Employee) So, we’re just going to...? Is   *  there not more information?   *  HELI SKI EMPLOYEE As in? BILLIE What’s going to happen?   *  PETE We’ll get all that on board.   *  EMERSON (louder) Mom! I can’t find my glove.   *  FINN Why are you so stupid? BILLIE (mom mode) Hey. Uh-uh. No. Come here.   *  Despite the “urgency,” Billie takes time for a “teachable   *  moment.” Finn steps over, face-to-face with Em.   *  BILLIE (CONT’D)   *  (to Finn)   *  What don’t we do?   *  FINN   *  Call people names.   *  JA 1st   43. BILLIE   *  Why?   *  FINN   *  It’s mean.   *  BILLIE   *  So, what do you say now?   *  Finn looks down at his feet, and utters a soft:   *  FINN   *  I’m sorry.   *  BILLIE   *  No, you need to look him in the   *  eye, Finn. Say it loudly and   *  clearly so that he can hear it.   *  FINN   *  (he does)   *  I’m sorry.   *  Billie is satisfied. The Heli Ski Employee ushers them toward   *  the chopper.   *  HELI SKI EMPLOYEE We sh",
      "dialogue_count": 0,
      "word_count": 4539
    },
    {
      "scene_number": 4,
      "slugline": "EXT. ALPINE RAIL SLIDE - DAY  Em, Finn and Pete (in that order) are all in their individual slide cars. An ALPINE SLIDE EMPLOYEE works her way along them, checking that they each know how to operate the hand brake. ALPINE SLIDE EMPLOYEE (to Em) Forward to go. Em pushes the handle forward to show he understands. ALPINE SLIDE EMPLOYEE (CONT’D) Back to brake. Em shows her that. The Alpine Slide Employee gives Em a “thumbs up” and points to a security camera pointed at them. Clearly, for confirmation that they understood about safety. Em gives a “thumbs up.” The Alpine Slide Employee moves back to Finn and goes through the same instructions, then to Pete. ALPINE SLIDE EMPLOYEE (CONT’D) (to Pete) Forward to go. Pete does. ALPINE SLIDE EMPLOYEE (CONT’D) Back to brake. PETE (jokingly) Won’t be needing to. ALPINE SLIDE EMPLOYEE (not having it)  Back to brake.  Pete eats crow and shows that he understands, as we...  EXT. TOP OF MOUNTAIN - DAY  We’re back with Billie and Marouane, who it turns out, is   *  very French. They stand at the precipice of a slope. MAROUANE So, first thing of instruction.   *  Coffee!  JA 1st   66.",
      "characters": [],
      "action_text": "BILLIE To be honest,... (pronounced wrong) Ma-ROON-ON MAROUANE Marouane. BILLIE Mar-OO-NON MAROUANE Marouane. Like, marijuana, without the ‘a’. Marijuan-a. Marouane? Billie carefully says “Marijuana” and conscientiously stops before the “a.” BILLIE To be honest, Marijuan... I didn’t ask for a, uh-- I’m actually a pretty decent skier. MAROUANE Why stop at decent? There’s better than decent? He pulls a thermos from his knapsack. MAROUANE (CONT’D) (displaying) See? Coffee. Decent. Then, he pulls out a flask. MAROUANE (CONT’D)  Alpine   coffee. Better, no? Billie considers.   *  BILLIE Okay, yeah. Why not? I can be more than decent. He adds a healthy pour of the flask into her coffee. BILLIE (CONT’D) Oh. Okay. A lot more than decent. He winks at her, as she “bottom’s ups.”  JA 1st   67.",
      "dialogue_count": 0,
      "word_count": 325
    },
    {
      "scene_number": 5,
      "slugline": "EXT. ALPINE RAIL SLIDE - DAY  Finn, Em, and Pete ascend the mountain, spaced a good   *  distance apart. (It operates much like a “roller coaster,” pulling you up to the top on the track.) ON PETE, as we watches SKIERS whisk by. A hint of “I wish I was doing that” is undeniable. LATER - They make it to the top and, one by one, descend. ON EM. Contrary to skiing, Em appears not to be afraid of speed on the slide. He’s an expert at navigating the curves. This is his thing. ON FINN. He’s more hesitant, riding the brake. His pace is much slower. ON PETE. True to form, he’s all speed. PETE’S POV of Finn, up ahead. He’s gaining on him. BACK TO SCENE. PETE (joking) I’m coming for you, Finn! As he gets closer,... PETE (CONT’D) Ease up on the break, buddy. It’s fun! ON FINN. He does, speeding up a little. PETE (CONT’D) There you go! BACK WITH EM, having the time of his life. While fast, Em is being responsible about his brake. Safe. He passes a CAMERA BOX that snaps photos for purchase as you pass by. BACK WITH FINN. He’s coming up on a sharp curve. He brakes a good bit. ON PETE, pulling his brake, but fast approaching. PETE (CONT’D) (jokingly) Alright, I’m gonna tap you! FINN Don’t.  JA 1st   68.",
      "characters": [],
      "action_text": "PETE (doesn’t hear him) What? FINN Don’t! But, he does. Not a slam, by any means. Truly a tap, but it does jolt Finn. ON CAMERA BOX, flashing a photo of that moment.  EXT. ALPINE RAIL SLIDE - DAY - A LITTLE LATER  Post ride. CAMERA HOLDS ON Finn and Em, standing near the entrance. Each has a PHOTO. Em’s photo is of him beaming on   *  the ride. Finn’s is of Pete bumping into him. Behind them, in the distance and out of earshot, is Pete with an ALPINE SLIDE EMPLOYEE.   We can’t hear them , but it’s pretty   *  clear Pete is being reprimanded. After the “reprimand,” Pete approaches. EMERSON Did you get kicked out? PETE (”yes”) No. I just thought we’d, you   *  know,... do other things.   *  EMERSON Because, you got kicked out?  EXT. SLOPES - DAY  Billie is having a great run. She seems very relaxed. Marouane follows closely behind, encouraging and instructing. They get to a stopping point. MAROUANE Nice! BILLIE Whoa. That felt so different. MAROUANE Yes because you leaned into it.   *  With confidence. Just flow. No need to work so hard.  JA 1st   69. Billie likes that. “No need to work so hard.” MAROUANE (CONT’D) (pointing down slope) Now, you tackle this. Below, a good stretch of pronounced moguls. BILLIE Oh, I can’t do moguls. I know that. Marouane is not having it. Presents her with the flask. BILLIE (CONT’D) (laughing) So, just “alpine” now. No coffee? MAROUANE (sexy fucking smile) Decent. Better. (indicating flask) Best. Billie takes a huge swig off the flask. MAROUANE (CONT’D) Do like faster? Or slower? Billie is confused. MAROUANE (CONT’D) (re: moguls/slope) Do you want to go faster or slower? BILLIE ... Faster. Maroune steps up behind Billie, perhaps a bit too close, but not invasive. MAROUANE (pointing at slope) Hands out in front. Find a line and narrow your stance and go   around  each bump. Not over. Maintain a steady rhythm. BILLIE (little overwhelmed) Maybe, I just follow you...? MAROUANE No. Find a line. Steady rhythm. Do not look back. I will be there",
      "dialogue_count": 0,
      "word_count": 1003
    },
    {
      "scene_number": 6,
      "slugline": "EXT. SKI WARMING HUT - DAY  Billie descends more moguls, pretty expertly. Marouane right behind. She comes to a stop, exuberant. She’s breathing pretty hard. BILLIE That’s a lot of work. MAROUANE But, good, yes? BILLIE No, yeah. Worth it. Billie is definitely winded. MAROUANE Let us rest, yes? Warm up? And then, go again? Off Billie’s nod, Marouane skis toward the WARMING HUT, as we...  INT. SKI WARMING HUT - DAY - MOMENTS LATER  Marouane lights an oil heater. Billie can’t help but eye the smooth back of Marouane’s neck. His back is spectacular, too. A specimen. The light is flattering and cozy over the bare   *  room: Water; supplies; sleeping bags rolled up; emergency equipment; table and chairs. MAROUANE How do your calves feel? BILLIE Oh, I can feel them alright. MAROUANE You might want to... For ten minutes or so? He’s taking his ski boots off. Billie starts to pull her feet out of her boots. MAROUANE (CONT’D) (slapping his thighs) It can burn here, no? BILLIE Oh yeah. Yup.  JA 1st   73.",
      "characters": [],
      "action_text": "MAROUANE Sometimes I can give people, just on the calves or something, a rub? BILLIE (wry) Oh. Sometimes you can do that, can you? MAROUANE Yeah. That’s something I do. Marouane kneels to rub her calf.   *  MAROUANE (CONT’D) Yes? Just to relax out those muscles a little. It’s recommended. BILLIE Oh well, if it’s “recommended.” He rubs gently, but firmly. More sports massage than sensual   *  come-on. Not too much. MAROUANE Uh-huh? BILLIE Uh-huh. Um. That’s. Yeah. Uh-huh. As he rubs, keeping his hand below her knee, Marouane seems to be studying her. MAROUANE So, I’m curious. Who is Billie? Billie scoffs. Is that a line? BILLIE ... What? MAROUANE Why is that silly? To want to know? BILLIE It just sounds like a, uh... I mean, “ Who?”   How do you even answer...? MAROUANE (without missing a beat) I am very confident, but never afraid to admit when I am wrong. I tend to fall in love too fast.  JA 1st   74.  (MORE) And, heal too slow. I love to paint. And, I’m good at it. However, I cannot sing. But, that does not stop me from doing it everyday. He heads up a bit higher, up above the knee, massaging the front of her thighs. She shifts her body subtly to let him   *  know it’s okay. MAROUANE (CONT’D) Skiing is a passion, yes, but teaching feeds my soul. To witness someone surprise themselves. I live for that. And, I am the only child of a single mom and she is my hero. He lets that sit, then... MAROUANE (CONT’D) That is how   I   answer. Billie is flush. Her heart racing. He moves up higher, massaging with his thumbs, up towards her inner thighs. It feels good. MAROUANE (CONT’D) Uh-huh? BILLIE Uh-huh. MAROUANE You do not need to share with me who you are, Billie. But, you must promise me.   *  Marouane locks in, holding Billie’s gaze. His eyes stare right at her lips. MAROUANE (CONT’D) You must promise that you will   *  never find it silly when people want to make it about you. And, with that, a kiss. A perfect kiss, but not lustful. The kiss breaks. Marouane holds his g",
      "dialogue_count": 0,
      "word_count": 1238
    },
    {
      "scene_number": 7,
      "slugline": "INT. HOTEL SUITE, MASTER - NIGHT - MOMENTS LATER   *  Pete emerges from the bathroom. No Billie. Guess she’s not   *  sleeping there, again. Resigned, Pete heads to his side of   *  the bed, as...   *  THE SCREEN GOES BLACK   *  SKI DAY 5   *  INT. HOTEL SUITE, MASTER - MORNING  QUICK IMAGES OF: - Alarm goes off. “Pete’s” hand shuts it off. - The room is dark. Pete sits on the side of his bed. - Pete picks his ski stuff out of the piles.   *  INT. HOTEL SUITE - DAY - MOMENTS LATER  Pete stands just outside the TWINS’ ROOM. The door is slightly ajar. PETE’S POV of Billie and the boys on bed, watching something on an iPad together. Billie is holding it up so they can all see as they lie on their backs. BACK TO SCENE, as Pete lightly taps and opens the door. PETE Good morning. EM/FINN (staring at iPad) Morning, dad. BILLIE ... Morning. PETE Are we...? BILLIE I think we’re going to do this for now. PETE ... Okay. Zach texted about joining   *  us. I think Rosie is sleeping in.   *  JA 1st   79.",
      "characters": [],
      "action_text": "BILLIE Great. You guys have fun. Beat. PETE Should we meet up for dinner? Do the restaurant? BILLIE Sure. Beat. PETE You guys have fun. But, the three are lost in the iPad.  INT. HOTEL LOBBY - DAY  Pete steps off the elevator. Zach, dressed to ski, is there. And, he’s wearing a knit cap. ZACH Let’s do this. Pete considers. PETER Hold up. As Pete heads back onto the elevator,... CUT TO:  EXT. LIFT - DAY  Pete and Zach are in line. And yes, Pete is now wearing his dad’s old hat. No helmet for this cool motherfucker. Zach,   *  discreetly, takes a hit on his vape pen. He hands it to Pete   *  with a wink. ZACH A little Amsterdam in Austria. Pete considers: “Why not?” Zach snaps a quick selfie with   *  Pete. ZACH (CONT’D) Hashtag it begins!  JA 1st   80. LATER - Zach and Pete are at the front of the lift line. They   *  shuffle into place. The same Lift Operator is there. Pete   *  waits, but the Operator says nothing. He beams. He’s “cool.”  EXT. PISTE - DAY  Zach and Peter are at the top of a run. Pete can’t help it.   *  This feels good. To be standing here now. Free. PETE How great is this? ZACH So great. PETE All I have to do, right now. My   *  only obligation? Go down. ZACH Yeah. Live your best life. PETE Yeah. Every day is all we have. They fist bump. And, with that, push off. Confident. Free.   *  EXT. SLOPE - DAY - MOMENTS LATER  Pete’s having a great run. Maybe, a little loose from the vape, but in control. A SNOWBOARDER cuts across his path, nearly colliding.   *  Pete loses his balance, struggles. He can’t stay up and bites   *  it hard. His momentum carries him, sliding down the slope, in   *  a direct path with a SNOW GUN MACHINE. He skids to a halt, hitting his head on the machine. Not too hard, but he feels it. He sits up and checks the back of his   *  head for blood. But, luckily, none.  EXT. SKI LIFT - DAY  Billie and the kids are in line for the lift. [NOTE: This a two seater.] Rosie skis up into line. ROSIE Well, hello there. Going up? Mind if I..",
      "dialogue_count": 0,
      "word_count": 3170
    },
    {
      "scene_number": 8,
      "slugline": "EXT. TOP OF THE MOUNTAIN - DAY   *  We’re back where the photo was taken in the beginning. The   *  family stands at the edge of The Beast, staring down the steep incline. FEARLESS SKIERS swish right past them.   *  For some reason, no one is initiating a dissent. Not even Pete. Em’s words still haunting?   *  Suddenly, BANG! BANG! BANG! From a far distance, an avalanche is being set off. Despite the faintness, the whole family - even Pete - flinch. Finn grabs his dad. Is he holding on for   *  comfort or is he afraid his dad will flee again? A moment of clarity for Pete. A decision.   *  PETE   *  You know what I’m thinking I might need. Some hot cocoa. Maybe, we wait this out? Warm up? I’m not sure I’m feeling this.   *  The boys nod. Billie glances at Pete. A hint of smile. It’s   *  about time. They start for the lift, but... PETE (CONT’D)   *  (to Billie) You should take the run. If you want. We’ll wait for you at the bottom. Billie considers, as we... LATER - Billie watches from the top of The Beast as Pete and   *  the boys descend on the lift. BILLIE’S POV of the boys, leaning onto their dad. Pete puts his arms around them to get them warm. BACK TO SCENE, as she looks down at the slope ahead of her:   *  The way back to her family. Then, she glances behind her:   *  Switzerland. As she ponders, we...   *  EXT. BASE OF MOUNTAIN - DAY  Peter and the boys wait at the base of the run, looking out for Billie. An “avalanche” of skiers descend. But, no sign of   *  Billie. Long beat until,... EMERSON (a bit worried) ... Where is she?  JA 1st   95.",
      "characters": [],
      "action_text": "PETE   *  It’s okay. Your mom’s better than all of us. They scroll the area, but still no Billie. After another   *  beat,... A faint “Pete!” emanates from somewhere distant.   *  Peter listens intently until it’s clear... “Pete! Pete!”   *  Billie is calling out from up high. Without hesitation, Pete   *  pops off his skis. PETE (CONT’D)   *  Stay right here... EMERSON/FINN Dad. PETE   *  Everything’s fine. Stay right here. Pete runs up the slope, disappearing into the crowd of   *  skiers. We stay with Em and Finn, waiting. Long beat plays   *  out. Finally,... Through the crowd, we see Peter appear, carrying Billie in   *  his arms. He sets her down. EMERSON/FINN Are you okay? BILLIE I am now. She shares a glance with Pete. An understanding of what this was: Letting their sons see their dad as a “hero for a   *  moment,” instead of “the coward they had witnessed.” Peter   *  seems grateful. Then,... BILLIE (CONT’D) (very casual) I should get my skis. With that, she just walks back up. But, not before...   *  BILLIE (CONT’D) (whispering to Pete)   *  By the way, knee deep powder. Best run of my life. And, you’re   not  going back up there. She flashes a smile. And, Peter smiles back. He understands.  JA 1st   96.",
      "dialogue_count": 0,
      "word_count": 515
    },
    {
      "scene_number": 9,
      "slugline": "INT. HOTEL SUITE/HALL CORRIDOR - DAY - LATER   *  The family is preparing to leave. All the roller suitcases   *  are packed and stationed by the door. Pete opens the door to   *  the room. The Twins chase one another out.   *  PETE   *  Hold up. You guys are more than   *  capable of taking your own bags.   *  The Twins return, grabbing their suitcases and head back out.   *  As Billie passes by Pete in the doorway, he stops her.   *  PETE (CONT’D)   *  I’ll give you more reasons not go   *  to Switzerland.   *  A promise to be there. Shared smiles. Two people committing   *  to the story they want to be a part of. They kiss.   *  BILLIE   *  I hope you do. Because, I will kick   *  you in the nuts.   *  Pete seems confused, trying to decipher her words, but goes   *  with:   *  PETE   *  (”understood”)   *  ... Sounds good to me.   *  With that, she heads out, as we...   *  INT. HOTEL LOBBY - DAY   *  Pete, Billie and the Twins step off the elevator. The Twins   *  run ahead.   *  CHARLOTTE (O.S.)   *  No, this is not truth!   *  Charlotte approaches.   *  CHARLOTTE (CONT’D)   *  You must stay forever!   *  Pete, again, tries to pinpoint Charlotte’s “role.”   *  PETE   *  Thank you, Charlotte, for   *  everything you’ve done for us as   *  a...   *  JA 1st   97.",
      "characters": [],
      "action_text": "CHARLOTTE   *  Friend! This is of course! What the   *  fuck good am I if I’m not that?!   *  Charlotte laughs and hugs them, whether they want a hug or   *  not. “Good-byes” all around. Billie and Pete start to peel   *  off...   *  PETE   *  (to Billie, hushed)   *  Well, I tried...   *  BILLIE   *  (hushed)   *  Yep. Still don’t know who the fuck   *  she is?   *  Charlotte did not hear that, but she reaches out and lightly   *  grabs Billie’s arm. Stopping her. Pete heads over to the   *  Twins, as...   *  CHARLOTTE   *  So,... Your “lesson” good, yes?   *  Billie considers her answer.   *  BILLIE’S POV of Pete rough-housing with the Twins. A man   *  attentive. At this moment, a dad.   *  BACK TO SCENE. Billie, warmed by the image.   *  BILLIE   *  (nodding)   *  This story works for me.   *  Charlotte beams, approving. As Billie walks away, Charlotte   *  hones in on a group of YOUNG MALE SKIERS, passing by.   *  CHARLOTTE   *  My friends! I’m sorry I was not   *  here to meet you earlier! But, you   *  must have everything. And, you will   *  want everything from me!   *  EXT. HOTEL - DAY - MOMENTS LATER   *  The family make their way out to VALET. Nearby, Zach and   *  Rosie are handing their backpacks over to a SHUTTLE DRIVER.   *  ZACH   *  (calling over)   *  Hashtag we don’t want to leave!   *  JA 1st   98. They approach. Hugs all around.   *  ROSIE   *  Thanks for letting us crash your   *  vacation.   *  BILLIE   *  Glad you did.   *  A genuine sentiment. A “thank you” to Rosie for hearing her.   *  ZACH   *  We’ll see you back in the States.   *  PETE   *  What’s next for you guys before   *  that?   *  ZACH   *  Who knows...?   *  ROSIE   *  Oh my-- What is wrong with you?   *  (then, to Billie/Pete)   *  What’s next   is a shuttle to Zurich.   *  Layover in London. On standby in   *  Dallas. With hopes to be in LA by   *  midnight on Monday to be up for   *  work seven hours later.   *  ZACH   *  (smirks, shrugs)   *  Hey. Live your best life, right",
      "dialogue_count": 0,
      "word_count": 677
    },
    {
      "scene_number": 10,
      "slugline": "INT. SUV - DAY  Our family is in their same positions. As they round a   *  curve,...   *  POV of a LARGE BUS ascending from the opposite direction. It   *  and our SUV are on a path to intersect at the next curve. BACK TO SCENE, as Pete and Billie glance at one another. A   *  sly smile comes to Billie’s face. Pete reciprocates. A mutual decision. Pete lays on the gas, booking it to beat the Bus to the   *  curve. The Twins’ excitement grows as, with finesse, Pete   *  smoothly navigates and dodges the Bus, successfully.   *  The whole family cheers the success!   *  BILLIE  Nice.   EMERSON/FINN  Awesome, Dad!/So cool!   *  A shared thrill. We watch as, slowly, this feeling dissipates   *  and things go “back to normal.” Back to silence. And,   *  gradually, the family returns to the tableau we met them in.   *  - Billie goes to her phone.   *  - Pete focuses on the drive.   *  - Finn looks out the window.   *  - Em goes back to his book.   *  BEAT.   *  ON PETE, glancing at Billie, on her phone (She won’t notice   *  it.) Then, he glances in the rearview at his sons in their   *  own worlds. Then, his eyes go back to the road.   *  ON BILLIE, looking up from her phone. She glances at Pete,   *  lost in the road. She studies him for a beat.   *  ON BILLIE/PETE as they stare out at the road ahead, lost in   *  their own thought:   “Is this my best life?”   *  As they simultaneously glance out their side windows, we...   *  EXT. AUTO-ROUTE - DAY - CONTINUOUS   *  HOLD ON the SUV as it continues down the winding road.   *  JA 1st   100.",
      "characters": [],
      "action_text": "PAN to the back side of the same sign/billboard we passed in   *  the beginning. Again, an advertisement for Ischgl Ski Resort.   *  And, again, a mix up of German and English. And, the slogan:   *  “Come Again! If You Can...”   *  THE SCREEN GOES BLACK   *  JA 1st   101.",
      "dialogue_count": 0,
      "word_count": 342
    }
  ]
}