{
  "slug": "downsizing-2017",
  "title": "downsizing",
  "genre": "drama",
  "format": "film",
  "scenes_count": 26,
  "characters_count": 0,
  "characters": [],
  "total_words": 26207,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. CAVE - NIGHT 1   1  The rustic yet comfortable dwelling of a 16-PERSON   CLAN.   All are dressed in fur and leather, their hair long and braided. Small fires burn for   warmth and cooking. Women clean up after   a meal.   Men smoke pipes and converse   in a   language at once foreign and familiar, a blend of Nordic tongues and English.   Children chase one another and play   with simple wooden toys. A   young BOY intrudes   on the adults to tug on the arm of TERGEHL, an elder of   the clan. BOY  Come, grandfather, tell us a story.  A   weary Tergehl gently declines. BOY (CONT’D)  Please.   Please tell us a story.  Tergehl soon finds himself surrounded by a riot of begging faces.   The adults look on with amusement, quietly sharing   the children’s eagerness. MAN  Yes, Tergehl, it has been many lochnars since we have heard one.  (to all)  Shall we hear a story?  All chime in vigorously -- “ Yes!   Yes!   A story! ” TERGEHL  All right.   I will tell a story.   But then you must all promise to go to bed.  The adults chuckle, the children shriek in delight, and all vow to be good. LATER --- The clan have gathered around Tergehl, the children 2   2  at his feet, eyes glimmering. Grasping a gnarled staff, Tergehl scratches his chin as if   the story he knows so well were difficult to recall. TERGEHL (CONT’D)  Long, long ago, the world was very different.   Giants walked the land. There were so many giants that you could not count them all even if you counted for your entire life.  (MORE) 1",
      "characters": [],
      "action_text": "These giants had enormous brains. They could speak to one another across great distances.   They taught themselves to fly and traveled wherever they wished, even to the moon and the stars.   Yet despite these great powers, the giants were not happy.   They spoke in different tongues, worshipped different gods, and fought bitterly against one another.   No matter how much they ate, the giants always wanted more. They killed all the animals, chopped down all the forests, fished all the seas.   And their fires warmed the entire world, making it unbearably hot.  As Tergehl continues, we are transported to --  EXT. EDVARDSEN INSTITUTE - DAY 3   3  A   small, tranquil “campus” of buildings.  EDVARDSEN INSTITUTE Bergen, Norway  TERGEHL (V.O.)  But in one of their lands, there lived a clever wizard named Asborgön.  INT. LABORATORY - DAY 4   4  DR. JORGEN ASBJØRNSEN -- fifties, balding, closely trimmed beard -- works in his private lab, weary and alone. TERGEHL (V.O.)  Saddened by his greedy fellow giants, Asborgön wished to change their harmful ways and end their needless suffering.   For years he labored with his powders and potions until one day...  Dr. Asbjørnsen sedates a rat, then gives it an injection before placing it inside a stainless steel device the size   of a   microwave. He makes notes, flips a switch, and watches a timer count down to zero.   DING!  TERGEHL (CONT’D) 2 Long accustomed to failure, Dr. Asbjørnsen opens the door   of the device with little expectation.   Today, however, his eyes widen in amazement.  INT. HALLWAY - DAY 5   5  Dr. Asbjørnsen sprints down a corridor and into a stairwell.  INT. ADMINISTRATIVE OFFICE - DAY 6   6  Bypassing the secretary, Dr. Asbjørnsen bursts into the inner office of institute director DR. ANDREAS JACOBSEN. DR. JACOBSEN (Norwegian)  Yes, Jorgen ? DR. ASBJØRNSEN  We’ve got it.   It works.  Dr. Jacobsen rises from his desk.   The men embrace.  EXT. ASBJØRNSEN HOUSE - DAY 7   7  Electric cars and bicycles are parked outs",
      "dialogue_count": 0,
      "word_count": 911
    },
    {
      "scene_number": 2,
      "slugline": "EXT. ISTANBUL - DAY 12   12  A   WIDE SHOT of the city. TERGEHL (V.O.)  Seasons passed.   The warriors thrived.   And Asborgön resolved to spread word of his great discovery to all of the giants in all of the lands.  EXT. CONFERENCE CENTER - DAY 13   13  This structure hosts   exhibit halls, auditoria and meeting rooms.   An electronic sign displays the name of the current conference --   GLOBAL   SOLUTIONS: TECHNOLOGY FOR TOMORROW.  MAN’S VOICE (PRE-LAP) For nearly a century the Edvardsen Institute has been one of the few truly visionary research organizations, working entirely without government or commercial sponsorship...  INT. CONFERENCE CENTER - DAY A14   A14 Participants check-in at a REGISTRATION TABLE, sip coffee and mingle with their colleagues. OUTSIDE AN AUDITORIUM -- A sign announces one of many morning presentations: HUMAN SCALE AND SUSTAINABILITY JACOBSEN & ASBJØRNSEN, EDVARDSEN INSTITUTE  INT. AUDITORIUM - DAY 14   14  The voice belongs to   conference president DR. PAOLO PEREIRA, who addresses a crowded hall. DR. PEREIRA ...and today I’m sure you will agree they have far exceeded even their many impressive achievements of the past.   It gives me great pleasure to welcome the director of the institute and my old friend Dr. Andreas Jacobsen, along with his colleague, Dr. Jorgen Asbjørnsen.  5",
      "characters": [],
      "action_text": "Dr. Jacobsen emerges   carrying a wooden box which he sets atop the podium. DR. JACOBSEN Thank you, Dr. Pereira.   Seventy-five years ago, Mrs. Nellie Edvardsen, overcome with guilt by the fortune her late husband’s family had amassed producing mustard gas during World War I, founded our institute so that the wonders of science could instead be used to help mankind.   Our mission is to combat poverty, disease, natural disasters and other calamities that arise over time.   In the 1950s, the institute identified over-population as mankind’s single greatest long-term threat, the source of all the catastrophes we are seeing today -- extreme climate and weather events, and the devastating impact on food and water security.   Among the many solutions we conceived so many years ago, one which seemed then so ambitious, so outside our grasp, has at last borne fruit.   Today we are proud to unveil what we fervently believe to be the only practical, humane and inclusive remedy to humanity’s gravest problem.   Dr. Jorgen Asbjørnsen will now present his findings.   Are you ready, doctor? DR. ASBJØRNSEN (O.S.) (muffled, distant) I am ready. Jacobsen opens the front of the box to reveal -- DR. ASBJØRNSEN,   NOW JUST   FIVE INCHES TALL. As this miniature human walks out onto the podium, gasps of astonishment ripple throughout the room.   Many stand to get   a better look. DR. JACOBSEN Everyone, please take your seats. Please! As the audience quiets, Dr. Asbjørnsen takes his place behind a   tiny podium, dons reading glasses, and removes a speech   from his jacket pocket.  6 DR. ASBJØRNSEN Dr. Pereira, esteemed colleagues. Five years ago, building on the research of our predecessors at the institute, my team and I discovered a process by which all organic material can be reduced at the cellular level by a ratio of approximately 2,744 to one.   Such a process converts a man of 1.8 meters to just 12.9 centimeters.   A wide array of flora and fauna were subjected to this process and, w",
      "dialogue_count": 0,
      "word_count": 1221
    },
    {
      "scene_number": 3,
      "slugline": "EXT. RIYADH, SAUDI ARABIA - DAY 20   20  Saudis glimpse TVs through the window of an appliance store.  EXT. LA CASA RESTAURANT - OMAHA - DUSK A21   A21  Establishing.  INT. LA CASA RESTAURANT - DUSK 21   21  A   cozy eatery popular with older folks and hipsters alike. People crowd near the TV   above the bar,   among them PAUL SAFRANEK.   His polo shirt bears a CON-AGRA   insignia. PAUL (to a random guy) Wow.   That’s wild, isn’t it?   Just wild. (to a waitress) Say, Holly?   You can put in that take- out order now.  TERGEHL (V.O.)  In one of these lands, the land of Omaa, there lived a common laborer.  INT. CAVE - NIGHT 22   22  Tergehl addresses the rapt children seated at his feet. TERGEHL  Now, which of you knows his name?  The children wrack their tiny brains.   An adult prompts one child, whispering into her ear. CHILD  Safrapül!  TERGEHL  That’s right.   It was Safrapül the Good.  EXT. DUPLEX REAR ALLEY - DUSK 23   23  Paul pulls into his parking spot and emerges from his car   with the take-out food.   He climbs the back porch steps of this modest duplex and opens one of two back doors.  10",
      "characters": [],
      "action_text": "TERGEHL (V.O.)  Safrapül was not like the other giants.   He was possessed of a kind and generous nature.   Our tale tonight is the saga of Safrapül -- his search for love, and the quest to fulfill his destiny.  INT. DUPLEX KITCHEN - DUSK 24   24  Over the sound of a TV from the living room comes the voice   of Paul’s mother KAY. KAY (O.S.) Is that you? PAUL Yeah. KAY (O.S.) Oh, goody. Paul begins putting spaghetti onto a plate. PAUL You hungry? KAY (O.S.) I had a Healthy Choice about an hour ago. PAUL You knew I was bringing you food. I called and asked you specifically -- KAY (O.S.) -- I know -- PAUL -- and then you go and eat? KAY (O.S.) Just a Sesame Chicken.   I’m still hungry.   Don’t make me holler.  INT. DUPLEX LIVING ROOM - CONTINUOUS 25   25  Tethered to an oxygen tank, Kay Safranek sits in a recliner. Paul clears off a TV   tray before setting down her food.  11 PAUL Did you see the news today? KAY You mean about the little Swedish man? PAUL Norwegian. KAY Helen called to tell me to turn on the TV.   What won’t they think of next? PAUL Unbelievable, isn’t it?   Biggest thing since landing on the moon. Bigger. KAY Well, I don’t get it.   Why would anybody want to do that to himself? PAUL I don’t know, I think plenty of people will want to do it.   You know, the world’s in pretty tough shape. KAY Bullshit. Kay focuses on eating and watching TV. PAUL (smelling) Did you have a cigarette? KAY No. PAUL You know, with that oxygen tank, you’re going to burn the place down. At least you’ll save me the cost of cremation. KAY That’s an awful thing to say.   You shut up.  12",
      "dialogue_count": 0,
      "word_count": 500
    },
    {
      "scene_number": 4,
      "slugline": "INT. STAIRWAY - NIGHT 26   26  Kay wheezes upstairs.   Paul follows, toting her oxygen. KAY They can shrink people down and fly to Mars, but they can’t cure my fibromyalgia?  INT. KAY’S BEDROOM -   NIGHT 27   27  Kay lies bent over the bed.   Paul prepares a syringe and administers a shot. KAY And all this fuss about the environment.   As though the world’s going to end tomorrow.   I’m in pain. I can’t breathe.   Doesn’t that matter? PAUL Lots of people are in pain, Mom.   In all sorts of ways.  EXT. DUPLEX FRONT PORCH - NIGHT 28   28  Paul exits one side of the duplex and enters the other.  INT. PAUL’S LIVING ROOM - NIGHT 29   29  Paul watches TV in a   recliner of his own.   The phone rings, and the machine picks up.   It’s Paul’s on-again-off-again girlfriend AUDREY. AUDREY (ON MACHINE)  Paul, it’s Audrey.   I know we’re not supposed to be talking, but I thought you should know I had to put Bodie down today.   His seizures came back a couple months ago, and I could have had him operated on, but they cut back my hours at work, and he was getting really old, and...  (weepy)  ...I just feel so bad.   Are you there, Paul?   I really need to talk. I know you’re there.   Please, Paul. Please.   I miss you so much. Pleeeease.  13",
      "characters": [],
      "action_text": "PAUL Fuck. Paul picks up the phone but does not speak. AUDREY (ON PHONE) Paul? PAUL I’m here. TERGEHL (V.O.)  And so it was that Safrapül wooed the maiden Oodreh and took her as his wife.  FADE OUT.  EXT. LA CASA RESTAURANT - NIGHT 30   30  This is the same establishment where we first met Paul.   It’s now --  NINE YEARS LATER  TALKING HEAD #1 (PRE-LAP)  Look, I’m worried about global warming as much as the next fellow, but let’s not throw the baby out with the bath water.  INT. LA CASA RESTAURANT - NIGHT 31   31  The TV over the bar shows a Fox News-style debate. TALKING HEAD #1  This whole downsizing thing is another example of runaway-train technology leading us down a blind alley.   With all the holier-than- thou talk about saving the planet, we can’t ignore the devastating economic impact that’ll lead to more poverty, which’ll lead to more downsizing, and then more poverty, and the whole world economy going right down the toilet.   Billions of dollars in consumer spending are already starting to vanish -- construction and housing, the automobile industry, the airline industry, defense.  (MORE) 14 And then all the political abuses -- Israelis shrinking Palestinians, African dictators shrinking rival ethnic groups --  As the opposing speaker interrupts, we realize he’s SMALL. TALKING HEAD #2  Look, Ron.   Ron.   In any major transformation of society, are there serious growing pains?   You bet.   But we have to focus on the long term. The fact is that at current mass and volume, human life on Earth just isn’t sustainable, and dealing with that head-on makes good economic sense, no matter how you cut it.  We find a balder, paunchier Paul seated in a booth, enjoying happy hour with buddies KEVIN and TIM. KEVIN The one guy’s got a point.   This family on my block just moved away to get small, and their house is just sitting there.   Making everybody’s value take a dive is what they’re doing.   Just when I’m trying to refinance. TIM I don’t know.   Marlene thinks I s",
      "dialogue_count": 0,
      "word_count": 2841
    },
    {
      "scene_number": 5,
      "slugline": "EXT. LEISURELAND VISITORS CENTER - DAY 51   51  Across an immense parking lot sits a commanding building   that abuts a 20-foot-high WALL stretching in both directions, a wall that encircles and safeguards the city of Leisureland within. Long poles extending   skyward from the wall support the city’s protective overhead netting.  INT. LEISURELAND VISITORS CENTER - DAY 52   52  The Safraneks walk in, already starting to feel small in   this vast space.   A huge banner shows an ecstatic couple -- “It’s like winning the lottery   every day!”  A   large circular INFORMATION DESK is staffed by EMPLOYEES   in monogrammed golf shirts and khakis. AMONG THE EXHIBITS Audrey and Paul stroll through a maze of kiosks -- VACATION GETAWAYS, FINE DINING, RECREATION, INNOVATIONS IN EDUCATION, TRAVEL SERVICES, JOB   OPPORTUNITIES, STAYING IN TOUCH, SELLING YOUR CURRENT HOME, WHAT ABOUT MY PET?, WHEN YOU NEED A DOCTOR.  INT. LEISURELAND THEATER - DAY 53   53  Paul and Audrey sit watching a promotional movie.  EXT. BEACH - DAY - MOVIE WITHIN THE MOVIE 54   54  IN A TIDE POOL A   horseshoe crab scuttles along, silent and primordial, passing a pair of rubber boots.   Then we see the charismatic man inside those boots. TONY DALE Hi, I’m Tony Dale.   That horseshoe crab has remained unchanged for 250 million years.   Same size, same shell, same ugly mug.   But we humans are different.   We’re constantly evolving and adapting to new challenges.   And today we find ourselves at the dawn of an exciting new chapter in human history.   (MORE)  27",
      "characters": [],
      "action_text": "Each and every one of you can be among the lucky ones to take this great leap forward, enjoy the prosperity you deserve, and, most importantly, help protect our precious planet.   Join me, won’t you, as we take a look at the creation of the world’s first luxury community designed entirely to make anyone’s biggest dreams come true -- Leisureland Estates.  INT. SMALL PLANE - DAY 55   55  In the copilot's seat, Tony turns around and speaks as though we’re in the back. TONY DALE The first order of business was to find the perfect location -- not too cold in the winter, not too hot in the summer.   No earthquakes, no tornados, no hurricanes.   And no pesky mosquitoes.   Yep, everything had to be just right. The pilot points out   something below, and Tony raises binoculars to take a   look.  INSERT - A MAP OF THE UNITED STATES 56   56  ZOOM in on New Mexico. TONY DALE (V.O.) Our search led us to the ideal spot -- where we are right now -- ten square miles of high desert on New Mexico’s Vasquez Plateau.  EXT. VASQUEZ PLATEAU   - DAY 57   57  Twine on surveyor’s stakes winds through cacti and scrub. In work clothes and sun hat, Tony paces out a distance, then stops and points broadly at the ground, giving confident directions to offscreen crew.  TONY DALE (CONT'D)  28",
      "dialogue_count": 0,
      "word_count": 479
    },
    {
      "scene_number": 6,
      "slugline": "INT. CONFERENCE ROOM   - DAY 58   58  ACADEMICS give a presentation with charts and graphs.   Tony sits up front nodding thoughtfully. TONY DALE (V.O.) Next I gathered a team of top urban planners, architects and engineers from around the world to answer a simple question, “How can we design the most efficient and innovative city the world has ever known?”  INT. LEISURELAND DESIGN BULLPEN - DAY 59   59  ARCHITECTS AND ENGINEERS work at computers and drafting tables.   Others build maquettes. ANOTHER ANGLE --   Wielding a pointer and surrounded by his team, Tony reviews an enormous tabletop model of Leisureland. TONY DALE (V.O.) Each dwelling would be a dream house, a genuine estate within anyone’s reach.   Mass transit would be free and efficient. The streets would be neat and orderly, offering easy access to shops, schools, parks, medical services, and of course all the recreation and entertainment you can imagine. Now RENDERINGS of different neighborhoods -- Alpine Village, New Orleans Quartier, Fairway Manors, The Marina.  TONY DALE (V.O.)  Each neighborhood would accent our residents’   interests, diverse lifestyles   and hobbies.  INT. TONY DALE’S OFFICE - DAY 60   60  Tony addresses us from behind his desk. TONY DALE But no matter how much care we put into designing Leisureland, it’s really the people who make our community so special.   So now I’d like to introduce you to some actual residents who are eager to tell you more.  29",
      "characters": [],
      "action_text": "As the movie ends, the screen begins to rise and Tony turns his gaze vaguely downward...  TONY DALE (CONT’D)  Okay, folks, take it away!  ..returning us to --  INT. LEISURELAND THEATER - DAY 61   61  Stage lights illuminate, theme music begins, and a platform thrusts past the rising screen.   On the platform sits a downsized MANSION with swimming pool and tennis court. Tanned sales professional JEFF LONOWSKI steps out of the   front door wearing a headset mic, trailed by a tiny CAMERAMAN who transmits Jeff’s image onto a large screen. JEFF Thanks, Mr. Dale.   Welcome, everybody.   I’m Jeff Lonowski, Senior Product Specialist and happy homeowner here at Leisureland Estates.   Are you having a good time? (off initial response) Come on, guys.   You’re a heck of a lot bigger than I am.   Make some noise!   Are you having a good time? Paul and Audrey join   the enthusiastic response.   “Yes!” JEFF (CONT’D) That’s more like it.   So what do you think of my place?   Pretty nifty, huh?   It’s the house of my dreams. Heck, I’d say it’s the house of anybody’s dreams.   Why, an average guy like me might have to work twenty, thirty, even forty years to be able to afford a spread like this. And just wait until you see what’s inside. The house splits open to reveal the massive family room, enormous bedrooms, airy kitchen.   In the master suite upstairs, and with a   CAMERA GUY all her own, Jeff’s “wife” LAURA sits in a bubble bath. LAURA (headset mic) Jeff, you’ve got to stop inviting guests over without telling me!  30 JEFF Sorry, Laura.   I was only -- LAURA I mean, I finally got in the tub to relax after such a busy day. JEFF Busy doing what, sweetheart? LAURA Oh, no end of things.   First I took a tennis lesson and had a massage. Then after a gourmet lunch with the girls, we just couldn’t help ourselves and popped into that new Loget’s store downtown. JEFF Uh-oh, Loget’s.   What’s that going to cost me? LAURA Now, Jeff, you hush.   I was really good.   Just a diamond bracelet",
      "dialogue_count": 0,
      "word_count": 1171
    },
    {
      "scene_number": 7,
      "slugline": "EXT. DUPLEX FRONT YARD - DAY 65   65  Paul and Audrey oversee a RUMMAGE SALE of their belongings.  Downsizing!   Everything Must Go!  SOME OLD GUY How much for the hot dog cooker? PAUL Four dollars. SOME OLD GUY I’ll give you a dollar. AUDREY Sold.  INT. CON-AGRA PLANT - DAY 66   66  Paul finishes working with a FACTORY WORKER with a bad arm. PAUL Keep up those exercises.   Don’t get lazy.   I laminated everything for you, so no excuses. FACTORY WORKER Thank you, Paul.   Thank you so much. My wife and me, maybe someday we’ll get small too and we’ll visit you. PAUL That’d be great, but in the meantime... Paul squeezes and unsqueezes his hand, reinforcing an exercise.  INT. CON-AGRA BREAK ROOM - DAY 67   67  CO-WORKERS throw Paul a small goodbye party.   Atop the cake   is a   joke design in frosting about getting small.  EXT. CON-AGRA PARKING LOT - DAY 68   68  An emotional Paul walks to his car carrying a box of belongings.   It’s the last time he’ll ever see the place   he’s spent so many years.  34",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 182
    },
    {
      "scene_number": 8,
      "slugline": "EXT. RESTAURANT - NIGHT 69   69  A   perennially “hip” restaurant for the middle-aged.  INT. RESTAURANT - NIGHT 70   70  A   farewell party occupies the back.   Friends and family gather around four or five reserved tables.   We catch snippets of conversations with different FRIENDS -- first   up is GINA. AUDREY I mean, sure, I was on the fence about it for most of the year.   It’s pretty scary when you think about it at first.   But then when my college roommate Patty Loomis called to say she and her husband were doing it, and all the reasons why, I turned to Paul and said okay, you win.   Let’s go for it. GINA (hugging her) I’m just going to miss you so much. AUDREY Oh, Gina, I’m going to miss you too. But, you know, it’s not like we’re dying.   We’re just relocating and changing things up a bit.   We’ll be back at least once a year.   And you and Tim can come down and stay with us anytime.   We have like five guest rooms.   Open invitation.   Stay as long as you like. Gina laughs through tears at this joke. LATER -- BARRY talks   with Paul and Audrey. 71   71  BARRY And you guys didn’t consider Treasure Island out in Palm Desert? PAUL Yeah, we checked it out, but... (looking at Audrey) I mean, I liked it all right, but Audrey thought they were a little stingy with the amenities, especially for what they charge in monthly maintenance.  35",
      "characters": [],
      "action_text": "AUDREY And too hot.   And really provincial -- everything is golf, golf, golf.   And almost no diversity.   Super white bread. PAUL Yeah, no diversity. LATER -- Audrey’s father LARRY LUSTIG walks in.   Audrey greets 72   72  him with a big hug. AUDREY Hi, Dad. LARRY LUSTIG Your mother couldn’t bring herself to come, but she sends her love.   We’re still expecting you tomorrow afternoon at the house. Paul arrives, and the men exchange a respectful handshake. PAUL  Glad you made it, Larry. AUDREY What can I get you, Dad? PAUL Let me.   You guys visit. LARRY LUSTIG Oh, just   a   beer.   Any beer. PAUL (exiting) Comin’ right up. AUDREY I wish Mom weren’t taking it so hard. LARRY LUSTIG Well, you know your mother.   To tell you the truth, I was pretty skeptical myself at first.   You remember Jerry Gross.   Well, I called him up the other day.   He and Bev retired down there, did the whole shrinking thing you kids are doing.   He says they’re getting along just fine, never better.   Says he feels younger every day, says one dollar buys a thousand dollars worth of stuff.  (MORE) 36 Of course they need that with all the medication Bev takes.   But yeah, they play nine holes every morning.   Even taking a two-week cruise up to Alaska next month.   First class stateroom, gourmet food, whole nine yards.   Says the whole thing’s costing around $150.  No, I see the appeal.   And apparently there’s zero crime.   That’s what I keep telling your mother. LATER -- The party has wound down, and Paul and Audrey enjoy 73   73  a   final nightcap with close friends, including Tim, a friend of Paul’s we’ve met before.   A DRUNK GUY wanders over. DRUNK GUY Hey, you guys are getting small, right? PAUL That’s right.   My wife and I. DRUNK GUY My friend over there has a question. No offense, but do you think if you’re that small, you should still have all the same rights as the rest of us?   Same right to vote? PAUL Why wouldn’t we? DRUNK GUY Well, let’s see.   You’re not buying as many pro",
      "dialogue_count": 0,
      "word_count": 894
    },
    {
      "scene_number": 9,
      "slugline": "INT. DUPLEX LIVING ROOM - DAY 76   76  The room is bare.   Audrey removes her necklace and places   it inside their Leisureland KEEPSAKE BOX, a shoebox-sized container for those few small irreplaceable treasures -- family photographs, jewelry, baby spoons, etc. Audrey gets Paul’s attention and points at her ring finger. Together they remove   their wedding rings and place them on   a velvet-covered stem inside the box.  INT. AIRPLANE - DAY 77   77  Audrey leans her head against Paul’s shoulder while he watches the clouds. AUDREY I keep thinking I forgot something. He kisses the top of   her head.  EXT. ALBUQUERQUE AIRPORT TERMINAL - DAY 78   78  Carrying only their Keepsake Box, the Safraneks walk toward the Leisureland shuttle bus at the center island, where they join other NEW ARRIVALS with Keepsake Boxes of their own.  INT. LEISURELAND SHUTTLE BUS - MOVING - DAY 79   79  Seated on one side, Paul steals glances at the acrylic containers locked in   place across the aisle. Inside the containers are downsized TRAVELERS in rows of   first- class airline seats.   Just opposite the Safraneks are a MOTHER and her ADULT SON   in   sandals and Hawaiian shirts. MOTHER Moving to town, are ya’? PAUL How’s that? MOTHER (straining to be heard) I see you’re moving to Leisureland. (off Paul’s nod) You look like a nice young couple. PAUL Thanks.  39",
      "characters": [],
      "action_text": "MOTHER Where you from? PAUL Omaha. MOTHER Spokane.   Nervous? PAUL A little.   You know. MOTHER Don’t be.   It’s the best thing you’ll ever do.   And the medical part is no big deal.   Completely painless. Except if you have a lot of dental re- dos like my Dougie here.   He had to keep going back because he’d waited too long to get a root canal while he was still big.   I said, Dougie, those are your teeth.   You only get one set.   Anyway, you don’t want to hear about that.   We just got back from Turks and Caicos.   Have you ever been to Turks and Caicos? PAUL AND AUDREY No. MOTHER It’s so pretty.   Back in Spokane, we never went anywhere.   But now it’s so easy and so cheap.   You get in this contraption down at the travel center, and you don’t have to budge until you arrive at the hotel.   And the best part is you don’t have to take your shoes off in security.   I don’t like taking my shoes off once I have them on.  EXT. LEISURELAND PARKING LOT - DAY 80   80  The shuttle heads toward the TRANSITIONS CENTER, a building not far from the Visitors’ Center.  INT. COUNSELING ROOM   - DAY 81   81  Audrey and Paul sit across a desk from a pleasant and efficient “final step” ADMINISTRATOR.  40 She sorts Audrey and   Paul’s papers, occasionally checking   her computer screen to verify information. ADMINISTRATOR Okay.   And your medical records are up to date.   Very good.   And you’ve had no food or water for at least twelve hours, right? PAUL Right. AUDREY We’re starving. ADMINISTRATOR Oh, Audrey, you forgot to indicate if you want the clothes you’re wearing sent to someone you know or donated to charity. AUDREY Charity. ADMINISTRATOR Great.   Just one last thing we need to take care of. The Administrator adjusts a camera mounted to the top of her computer monitor. ADMINISTRATOR (CONT’D) Paul, could you scoot over a little? That’s it.   Perfect.   With your permission I’m going to record your answers to the following questions. May I begin recording? PAUL Sure. AUDREY Of",
      "dialogue_count": 0,
      "word_count": 926
    },
    {
      "scene_number": 10,
      "slugline": "INT. DENTAL THEATER - DAY 86   86  A   still-sedated Paul   is at a station in this large room with rows of dentists’ chairs.   His mouth is held open with a dental brace.   A drill approaches. FILLINGS drop inside   a metal pan.  INT. DOWNSIZING CHAMBER - DAY 87   87  Paul is wheeled inside a large stainless steel room, where   he is one of some 20 SEDATED MEN.   NURSES pull the IVs from   the men’s arms and remove their gowns, leaving them naked. A   SUPERVISOR makes a   final inspection -- looking in a mouth here, adjusting a head there -- before leaving the chamber   and securing the door.  INT. DOWNSIZING CHAMBER CONTROL ROOM - DAY 88   88  A   spinning red light.   An alarm bell.   A flipped switch. SUPERVISOR All clear! A   low hum begins, interrupted at intervals by a loud thunk, like an MRI. Nurses and orderlies   wait for the process to complete.   One offers another a piece of his Kit-Kat bar. A   gauge registers progress by displaying smaller and smaller silhouettes of a man.   The supervisor keeps an eye on things through a small window in the chamber door. BING!   Everyone begins moving again.  INT. DOWNSIZING CHAMBER - DAY 89   89  The door opens.   In the center of each gurney lies a tiny naked man. Three nurses enter pushing carts, each bearing eight tiny gurneys on top.   The   nurses gingerly “spatula” each downsized man onto the small gurneys.   As they work, we find Paul just as he is scooped up -- a bald, naked peanut.  INT. DOWNSIZING CHAMBER STAGING AREA - DAY 90   90  The nurses guide the   carts to DOCKING STATIONS set into a   wall.  44",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 277
    },
    {
      "scene_number": 11,
      "slugline": "INT. ANOTHER STAGING   AREA - DAY 91   91  ORDERLIES, most of them West Indian, stand chatting and checking their watches.   At the sound of an all-clear buzzer, they roll up a large   garage-style door and --  INT. DOCKING STATION   - DAY 92   92  -- walk out onto the   carts, revealing that they too are the same small size as the new arrivals.   The orderlies begin unlocking the gurneys to roll them away. TINY ORDERLY #1 Man, we got some real fatties this time. A   nurse from the other side pokes her enormous head in. BIG NURSE How’s everybody doing today? TINY ORDERLIES Fine.   Good.   How are you today, Joyce? BIG NURSE Me?   I’m great.   Just getting ready for the weekend.   We’re driving up to Denver for my cousin’s wedding. TINY ORDERLY #2 Oh... that sounds nice!  INT. LEISURELAND DENTAL AREA - DAY 93   93  DENTISTS and ASSISTANTS attend to the newly-downsized.   One dentist compares Paul’s open mouth against X-rays and charts on a computer screen.  INT. RECOVERY ROOM -   DAY 94   94  CLOSE on Paul regaining consciousness. He lifts his head to   examine his hands and arms.   He gives   his sore jaw a massage, then peeks under the sheet, relieved   to find his “equipment”   as it should be. A   CHEERY NURSE opens the door. CHEERY NURSE I see you’ve decided to join us.  45",
      "characters": [],
      "action_text": "PAUL Is this... Is it over? CHEERY NURSE Welcome to Leisureland.   Hungry? She lugs in a normal-size two-pack of SALTINES, now comically large. PAUL Oh, my God. CHEERY NURSE Isn’t that cute?   People just love that. (setting it aside) I’ll bring you a little snack in a moment. PAUL Thanks.   Um, I think my wife was supposed to be here with me. CHEERY NURSE What’s her name? PAUL Audrey Safranek. CHEERY NURSE (consulting a chart) Safranek, just like yours.   Let me see.   We do have an Audrey Safranek scheduled for today, but I don’t show her transferred over yet. PAUL Is something wrong? CHEERY NURSE No, no.   She’s probably just held up in dental.   I’ll go check.  LATER -- 95   95  Paul sits up nervously jiggling one leg.   The nurse comes   back inside and offers him a telephone. CHEERY NURSE Mr. Safranek, you’ve got a call.  46 PAUL Oh.  (answering) Hello? AUDREY (ON PHONE) Paul. PAUL Audrey, thank God.   Where are you, honey? AUDREY (ON PHONE) Don’t be mad at me.   Please don’t be mad.   It’s hard enough as it is. PAUL What’s hard?   What are you talking about? AUDREY (ON PHONE) Oh, Paul, they shaved my head, then they started shaving off my eyebrows, and I just thought, what am I doing?   I can’t leave my family, all my friends. I can’t do it.   I’m sorry, Paul.   I just can’t.   I’m not like you. PAUL Where are you? Silence.   Then Paul overhears what sounds like a boarding announcement. PAUL (CONT’D) Are you at the airport?  INT. ALBUQUERQUE AIRPORT - NIGHT - INTERCUT 96   96  Audrey is at a PAY PHONE, her bald head hidden under a hat, one eyebrow desperately drawn in with mascara. AUDREY (beginning to sob) Don’t hate me.   Don’t hate me. PAUL Okay, okay.   Take it easy.   Just get in a taxi and come back so we can talk about this.   Okay?   We’ll go back to Omaha and think this through together.  (MORE) 47 (an ominous silence) Wait.   You’re not leaving me here. AUDREY Can’t you understand how I feel?   I feel terrible, Paul.   I let you down, and I feel awf",
      "dialogue_count": 0,
      "word_count": 1205
    },
    {
      "scene_number": 12,
      "slugline": "INT. UPSTAIRS HALLWAY - DAY 103   103  Like Charles Foster Kane, Paul plods past huge mirrors, his diminishing image reflected into infinity.  INT. MASTER BEDROOM - DAY 104   104  Paul inspects this expansive room decorated with a decidedly feminine touch.  INT. PAUL’S LEISURELAND HOUSE - DAY 105   105  At a repeated doorbell ring, Paul opens the front door to   find a   MOVER with a clipboard. MOVER Safranek? Paul nods.   The mover turns toward his truck -- Paul and Audrey’s keepsake box mounted to a cab. MOVER (CONT’D) Okay! Another MOVER walks toward the house carrying what look like two hula hoops -- his and Audrey’s WEDDING RINGS.  INT. MASTER BATHROOM   - DAY 106   106  Paul robotically removes his clothes, steps into the shower, and turns on the water. PAUL OWWWW!  INT. MEDIA ROOM - DAY 107   107  Paul sits in a recliner, watching TV and guzzling champagne.  ON TV - A NEWS REPORT 107A   107A  An ANCHOR speaks to camera, while behind him/her a GRAPHIC depicts an open box with a Vietnamese flag on the side and question mark rising   out of it.  51",
      "characters": [],
      "action_text": "NEWS ANCHOR For years both the Department of Homeland Security and the INS have been warning about the ease with which downsized persons -- from illegal immigrants to potential terrorists -- could penetrate U.S. borders.   Last week’s discovery in Eugene, Oregon provided tragic new evidence to support that claim. Brian Fakler brings us up to date.  EXT. COSTCO - DAY 107B   107B  BRIAN FAKLER This Costco is just one of thousands of big-box stores around the country that import almost a million tons of goods weekly, most of it from Asia. Last week workers here in Eugene opened a suspicious TV box and discovered seventeen downsized stowaways from Vietnam, fourteen of them already dead, two more dying hours later at a local hospital.  INSERT - RECYCLED PRESS CONFERENCE FOOTAGE 107C   107C  POLICE display the BOX   in question.   One stained bottom corner is perforated with tiny holes punched out for air.  BRIAN FAKLER (V.O.)  On Friday, the lone survivor, a 45- year-old woman named Ngoc Lan Tran, was transferred to a hospital at Leisureland Estates in New Mexico, widely considered the country’s top medical center for the small. Doctors were forced to amputate a portion of an infected leg, and today her condition is described as fair but stable.  INSERT - “B-ROLL” FOOTAGE 107D   107D  Ngoc Lan Tran is transferred from a helicopter to a medical team outside Leisureland.  52 BRIAN FAKLER (V.O.)  Yesterday, U.S. officials were able to question the woman for the first time.   According to a statement from the Department of Homeland Security, Ms. Tran claims to have been jailed for her environmental and political activism and, along with dozens of other dissidents, was miniaturized against her will in a Vietnamese prison facility.   If true, this would bolster accusations by human rights groups that repressive governments around the world are forcibly downsizing scores of prisoners and political undesirables.  DOLLY IN on Paul.   PAN to reveal the wedding rings leaning 107E  ",
      "dialogue_count": 0,
      "word_count": 623
    },
    {
      "scene_number": 13,
      "slugline": "EXT. GOVERNMENT BUILDING - DAY 109   109  A   group of PROTESTORS hold sign saying things like, “Downsizing Shrinks a Beating Heart” and “Horton was Wrong.” PROTESTER The Bible doesn’t say nothing about little people, and the constitution doesn’t either.  EXT. THE VATICAN - DAY 110   110  The POPE speaks from   his balcony. POPE  As for the gift of science, as much as it helps combat famine and disease, it has no place interfering in God’s design -- not in reproduction, not in genetic engineering, and not in altering the very dimensions of our divine being.  INT. LUXURY MALL - DAY 111   111  Two wealthy OLDER WOMEN opine. WOMAN #1 It’s like a mouse.   How little they are and run around on their little feet.   You don’t know which way they’re going to go.   They might run up your leg. WOMAN #2 And they’re dirty.   They’re too close to the ground.  EXT. MOSCOW STREET -   DAY 112   112  WOMAN (in Russian)  I just don’t feel safe in my home.   I think one of those small people is going to sneak in and watch me on the toilet.   You can’t trust them. They’re too small.  54",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 195
    },
    {
      "scene_number": 14,
      "slugline": "EXT. STREET - DAY 113   113  OLDER GUY All those people used to put in an honest day’s work, and now they’re running off to get little and sip their piña coladas.   I went into a Target the other day, and wasn’t nobody to help me.   It was like a ghost town in there.  TERGEHL (V.O.) In a way, the giants were right. There was much to fear from such a rapid   exodus.  EXT. ARMY BASE - STOCK FOOTAGE 114   114  TERGEHL (V.O.)  Soldiers would abandon their posts.  EXT. WHEAT FIELD - STOCK FOOTAGE 115   115  TERGEHL (V.O.)  Crops would be left to rot.  INT. FACTORY - STOCK   FOOTAGE 116   116  TERGEHL (V.O.)  Workshops would be abandoned and overrun   by wolves.  EXT. COAL FURNACE - STOCK FOOTAGE 117   117  TERGEHL (V.O.)  Who would tend their fires?  EXT. WOMEN AT A RIVER - STOCK FOOTAGE 118   118  TERGEHL (V.O.)  Who would wash their robes?  INT. LEISURELAND CONFERENCE ROOM - DAY 119   119  CLOSE on Paul two years later.   His hair and eyebrows have grown back.  55",
      "characters": [],
      "action_text": "TERGEHL (V.O.)  But what of Safrapül?   Far removed from the troubles of the world, he was leading a monastic life of poverty and chastity, purging himself of the past and unaware of the adventures that lay ahead.  WIDE -- Paul stands atop a table, pen in hand. LAWYER (O.S.) Do we need to review any of the terms of the settlement? PAUL No, it’s all pretty clear. LAWYER (O.S.) I really wish you’d taken her first offer. PAUL I know. LAWYER (O.S.) All right.   Please step back a little.   Don’t want you to get hurt. The LAWYER   lays down a thick stack of normal-sized documents bristling with “Sign   Here” flags.   Paul steps up onto them. LAWYER (O.S.) (CONT’D) Sorry, would you mind removing your shoes? Paul dutifully slips   off his shoes, walks to the signature line, kneels, and begins to sign. LAWYER   (O.S.) (CONT’D) As large as you can, please. WIDER -- The normal-size lawyer watches Paul laboriously produce a deformed, oversized signature. LAWYER (CONT’D) Nice weather down here.   Turned real cold back in Omaha. PAUL Uh-huh. LAWYER Wind chill.  56",
      "dialogue_count": 0,
      "word_count": 357
    },
    {
      "scene_number": 15,
      "slugline": "INT. PAUL’S CONDOMINIUM - DAY 120   120  A   coffee-for-one brewer fills a travel mug.   Paul hurries   in from the bedroom of his humble, post-divorce dwelling, grabs his coffee, and hurries out the door.  EXT. THE MARINA - DAY 121   121  Paul exits this apartment complex overlooking a LAKE.  INT. TOLL-FREE CALL CENTER - DAY 122   122  Paul weaves his way glumly through a massive array of cubicles.   A CO-WORKER   gets his attention. CO-WORKER Hey, Paul, thanks.   You were right. Raising my monitor really did the trick.   My neck feels better and no more tingling in my arm.   I never would have made the connection. PAUL Glad to help. At his cubicle, Paul   takes a seat, dons his headset, and answers his first call of the day. PAUL (CONT’D) Hello and thank you for calling Land’s End.   My name is Paul.   No, ma’am, I’ve never been to India.   I’m in New Mexico.   How can I help you? Sure, let me check.  INT. GONDOLA - DAY 123   123  Paul cradles a gift-wrapped box in his lap and gazes absently at the city far below.  EXT. DAVE AND CAROL JOHNSON’S HOUSE - DAY 124   124  Paul plods toward a VERSAILLES, Leisureland’s most extravagant home.  EXT. DAVE AND CAROL JOHNSON’S BACKYARD - DAY 125   125  Paul emerges through   French doors and heads toward a birthday party for seven-year-old MADISON and twenty-five FRIENDS.  57",
      "characters": [],
      "action_text": "Kids take pony rides   and a magician performs. FROM A DISTANCE we watch Paul approach Dave and Carol, hearing only -- CAROL  Ciao, bello!  They exchange pleasantries, and Paul is instructed to place his present atop an obscene mountain of other gifts. LATER -- Paul observes the lavish goings-on.   Dave wanders 126   126  by. DAVE Hey, pal.   Why the long face? (off Paul’s shrug) Look around you, buddy.   Life is good. PAUL I made a mistake, Dave.   Biggest mistake of my life.   Should have stayed where I was. DAVE Hey, hey, hey.   I know divorce puts a pretty big dent in anybody’s self-esteem, and what Audrey did to you was beyond the pale.   I hate her.   I barely know her, and you may not hate her, but I hate her.   You just have to get back in the saddle, that’s all. PAUL Maybe some day. DAVE If you want my advice, single moms are the way to go.   They’ve got the whole kid thing out of their system, and they just want to party.   A few of ‘em here today. PAUL That’s okay, I’m -- DAVE And if you’re not ready for emotional connection, there’re plenty of good times to be had down here, no strings attached.   Just put it on your credit card.  58 PAUL Thanks, but I’m good.   Really.   In fact, I’ve started seeing someone. DAVE Oh, yeah? PAUL Single mom, actually. DAVE Ho, ho.   Now we’re talking.   Well, if that doesn’t work out, or even if it does, there’s this one chick, Stacy? Ouch.   Like a Victoria’s Secret model, only sluttier.   The tricks she knows -- man, oh, man.   Hey, first time’s on me. Paul’s gaze drifts to Madison, giggling atop a pony.  INT. PAUL’S LIVING ROOM - DUSK 127   127  The doorbell rings.   Wiping his hands, Paul hurries from the kitchen and greets pleasant but stiff KRISTEN SWANSON, who holds a pie. PAUL Hi, Kristen. KRISTEN Hi.   I brought dessert.   Apple- blueberry. PAUL You didn’t have to do that. She spots a huge yellow ROSE   in a vase. KRISTEN Wow, is that a real flower?   Where’d you get that? PAUL Full-Sized Flower Mart.   Just open",
      "dialogue_count": 0,
      "word_count": 987
    },
    {
      "scene_number": 16,
      "slugline": "EXT. PAUL’S BALCONY - NIGHT 129   129  Paul reaches the railing and yells up toward the balcony above. PAUL Dusan! (pronounced “Dushan”) Hey, Dusan!  EXT. DUSAN’S BALCONY   - PAUL’S POV - CONTINUOUS A130   A130  Euro-handsome DUSAN MIRKOVIC leans over the railing. DUSAN Yes? PAUL You mind turning down the music? Trying to have a quiet evening down here. Dusan gives Paul a little wave of “no problem.”   Dusan's French girlfriend MARIETTE   peeks over the railing, too. PAUL (CONT’D) Thanks.  INT. PAUL’S DINING ROOM - MOMENTS LATER 130   130  The volume of the music is lower than before, but not much. Paul and Kirsten continue with their meal.   For the moment, neither can think of   anything to say, so they simply eat and exchange smiles. The doorbell.   Paul gets up to open it. DUSAN Hello, my friend. PAUL Dusan. DUSAN May I come in? Once inside, Dusan gives Paul’s apartment a quick once-over. DUSAN (CONT’D) I’m sorry I am disturbing your nice little dinner, but listen, Pete --  62",
      "characters": [],
      "action_text": "PAUL Paul.   And Kristen. DUSAN Hello, Kristen.   Like I was saying, I’m having one more, you know, little party at my place tonight.   Just a few friends.   Not big like last time. Very small. (noticing) No!   Is that a rose?   A real rose? From where you get a real rose? PAUL New store.   Full-Sized Flower Mart. DUSAN Here in Leisureland?   Why did I not have such a brilliant idea?   How much they are charging for this? MARIETTE (O.S.) Dusan! Dusan steps out onto   Paul’s balcony and looks up. DUSAN  Quoi, ma cherie?  MARIETTE (O.S.) (French)  Dusan, what are you doing down there? The caterers just arrived with the food and are asking where to put everything.   I told them in the kitchen.   Now they’re asking to be paid.  DUSAN  Oui, ma cherie.   J’arrive.  (back inside) Anyway, Paul, listen, if tonight noise disturbs you, just come upstairs and talk to me.   Don’t make big show like last time yelling like crazy man.   We are neighbors.   And neighbors are friends.   What’s better, come to the party. PAUL Thanks, but like I said, we’re just trying to have a nice, quiet dinner. So try to keep it down, okay?  63 DUSAN Yes, darling.   Of course. Dusan puts a finger to his lips and makes a point of tip- toeing to the door, closing it without a sound. PAUL Kind of a jerk, right? KRISTEN What’s he even doing here?   Aren’t there like a ton of small cities in Europe?  INT. PAUL’S HALLWAY - NIGHT 131   131  Their date at an end, Paul walks Kristen down the hallway. Booming bass notes penetrate through the ceiling. PAUL Yeah, small party. (imitating)  Just a few friends.  Arriving at the elevator -- KRISTEN Well, thanks for a really nice time. Plus, cooking and all.   Sorry I have to leave so early, but, you know, the sitter. The elevator opens, and drunken SPANIARDS spill out. PAUL One floor up. They disappear back into the elevator. PAUL (CONT’D) So... Sunday.   I was hoping we could bring Jonah.   I’d like to meet him. KRISTEN Yeah.   Maybe. Paul leans in for a kiss.   ",
      "dialogue_count": 0,
      "word_count": 1607
    },
    {
      "scene_number": 17,
      "slugline": "INT. DUSAN’S BATHROOM - NIGHT 137   137  Locking the door, Paul sticks his finger down his throat in   an unsuccessful attempt   to induce vomiting.  INT. DUSAN'S LIVING ROOM - NIGHT 138   138  A   circle of people converse in Greek.   Paul wanders by, eyes wide, smiling, just enjoying the sounds. PAUL (interrupting) I’m going to take off my shoes.  INT. INDOOR SWIMMING   POOL - NIGHT 139   139  Paul is peaking -- eyes shut, arms overhead, dancing to a rhythm only vaguely related to the music.   Dusan wanders by. DUSAN Having a good time? PAUL I just realized... There’s no reason to be unhappy.   I mean, I’m here in Leisureland, but really I’m everywhere.   I’m connected to everybody.   Everything’s... just the way it’s supposed to be. PAUL’S DRUG-INDUCED POV -- streaked and vibrant.   Dusan laughs, looking directly into camera. DUSAN Yes, baby!   As long as the world is going to shit, let’s make a little money and let’s have a good time. (in Serbian)  You’re about to enter whole new world!  FADE OUT.  UNDER BLACK -- 140   140  The sound of a DOORBELL.  INT. DUSAN’S LIVING ROOM - DAY  CLOSE on Paul passed   out on the floor, wedged between a sofa and a coffee table.   The doorbell rings again, startling him awake.  70",
      "characters": [],
      "action_text": "PAUL’S POV -- Dusan’s hairy legs stagger toward the door, stop short, then approach him. DUSAN (O.S.) Who is that?   Who is down there? PAUL It’s me, Paul. DUSAN (O.S.) Paul who?   Who is Paul? PAUL From downstairs.   You know, Paul. The doorbell again. DUSAN Enough with the fucking doorbell! He opens the door. WOMAN’S VOICE (unusual Asian accent) Good morning, Mr. Dusan.   We come clean for you. Paul watches the legs of a small cleaning crew enter, his interest piqued by one person’s crude PROSTHETIC FOOT.  INT. DUSAN’S KITCHEN   - DAY 141   141  Paul shuffles in to find Dusan rooting around. DUSAN Fucking hyenas ate everything.   I am surprised there is even still water when I turn on the sink. Paul sits on a stool, and Dusan pours him coffee.   From the next room comes the sound of vacuuming. DUSAN (CONT’D) So you had fun last night, yes?   You did not know you were so lucky to have exciting neighbor such as me. PAUL Never been to a party like that.   So many Europeans.   Did you know Little Ronni was here?   I mean, he’s historic.  71 DUSAN And boring.   Good looking dumb Norwegian guy goes around the world having sex with everybody -- women, men, hermaphrodites, dogs, goats, monkeys.   He’ll be the first small baby to die of syphilis.   But yes, okay, historic. Glancing into the next room, Paul notices that the one-legged woman is the one steering the vacuum cleaner. PAUL Apparently he still lives in the original colony, you know, over in Norway.   I’ve always wanted to see that. DUSAN It’s all right. PAUL You’ve been there? DUSAN I go once or twice a year. Konrad, too.   We make business there. Good business. PAUL Man, that really must be something to see.   You can’t even find pictures of it online. Dusan studies Paul. DUSAN Yes, my friend.   The world is filled with things to see.   I don’t know you, Paul, but I like you.   I like you very much.   And my advice is to get out of your disgusting little fucking apartment and open your eyes. Don’t be so American",
      "dialogue_count": 0,
      "word_count": 1071
    },
    {
      "scene_number": 18,
      "slugline": "INT. DUSAN’S BATHROOM - DAY 143   143  Paul appears in the doorway and finds the woman rummaging through Dusan’s medicine cabinet and putting some items into her smock. PAUL Hello. She spins around, startled.   We may recognize her from the news report -- Vietnamese dissident NGOC LAN TRAN.   Her green cap reads “Jade Palace Cleansing Service.” PAUL (CONT’D) Can I talk to you for a minute? NGOC LAN These medicine too old.   Too old.   I clean, take away for you. (holding out a bottle) Na-pro-shien.   What this do? PAUL Naproxen.   That’s an anti- inflammatory. (off her blank stare) It helps with pain and swelling. She pockets the bottle and picks up another. NGOC LAN And this one, what this one do? PAUL That’s... Vicodin.   That’s also a pain killer, but it’s, well, you want to be careful with that one. NGOC LAN (pocketing it) Pain killer?   Pain killer good. PAUL You know, this isn’t my apartment, and I know you’re probably in a lot of pain, but I don’t think you should be stealing pills. NGOC LAN I no steal.   They too old, no good. Mr. Dusan, he say me okay I take away things.   Pills for sick friend. (closing the cabinet) Okay, I finish now.   Bathroom clean.  75",
      "characters": [],
      "action_text": "She pushes past Paul, and he follows her into --  INT. DUSAN’S SECOND FLOOR HALLWAY - CONTINUOUS A144   A144  PAUL Well, whatever’s wrong with your “friend,” I see you have a really, really bad prosthetic foot.   I’m sure it’s causing pain in your right hip and knee, probably both knees.   Lower back. NGOC LAN How you know these things?   You doctor? PAUL I’m an occupational therapist.   Wait a second.   I know you.   You’re that -- Oh, my God, you’re that woman from a couple years ago, the dissident.   From Thailand or someplace.   What’s your name? NGOC LAN Tran Ngoc Lan.   Vietnam. PAUL Yeah, right, I remember you lost your leg below the knee.   That’s you?   Wow. (to Dusan and Konrad downstairs) Hey, Dusan, do you know who this is? DUSAN Yes, of course, the famous Ngoc Lan Tran.   Dramatic escape from Vietnamese prison and almost died so that now she can clean my house. America, big land of opportunity! Dusan and Konrad share a big laugh.  INT. DUSAN’S DINING ROOM - DAY 144   144  Ngoc Lan sits in a chair while Paul cups a kneecap and manipulates the foreleg, then repeats the process with the other leg.   Dusan and Konrad watch, as do, from afar, the   rest of the cleaning crew. Ngoc Lan submits to the exam but seems more interested in   Paul himself than in what   he’s saying.  76 PAUL Okay, I’m going to push down and you try to push up.   Mm-hm.   You’ve got some pretty severe asymmetrical muscle compensation. DUSAN Paul, you are full of surprises.   You can do this but you work shit job answering phones? PAUL When I moved here, I didn’t think I’d be working, so I let my license expire.   And to get a license now in a different state... it’s a boring story. NGOC LAN (to the other cleaners) Hey, you no look me!   You work now.  Trabajo!   Trabajo!  As they scatter, Paul places Ngoc Lan's hand on her own knee and moves her foreleg up and down. PAUL You feel that crunching?   That’s arthritis.   It’s already pretty bad. (releasing it) I hate to say it, but if you",
      "dialogue_count": 0,
      "word_count": 879
    },
    {
      "scene_number": 19,
      "slugline": "EXT. FAR SIDE OF LEISURELAND - DAY 147   147  The bus drives away from central Leisureland and enters a   very modest section of town -- smallish houses, LATINO CHILDREN playing in the streets.  INT. BUS - DAY 148   148  Ngoc Lan and Paul have found a seat, but the aisle is packed. Buoyant RANCHERA MUSIC on the speakers contrasts with the weary faces of the passengers. PAUL If you don’t mind my asking, you were so famous a couple years ago. Everybody was talking about you.   I would’ve thought you’d be writing books and making speeches.   I mean, how’d you wind up cleaning houses? NGOC LAN Need money for live.   After TV box I stay hospital so long time, almost die.   Then three host family, but too much problems.   Leisureland peoples too selfish.   Better I live only me, work job make money. PAUL But after all you’ve been through, I would have thought for sure Tony Dale would have been happy to -- NGOC LAN Don’t say me Tony Dale! (mocking)  Tony Dale.   Tony Dale.  (a sudden tirade) Everybody say   Tony Dale   so nice guy, help people.   I say he bad man, make Leisureland people selfish.   I say you why Tony Dale still big?   Be careful you ask him this.   He no like this question.   I ask him, he say me, “You go back Vietnam TV box, you talk like this.”   He say me, “I save your life my hospital, make you better, now why you make bad PR for me.” He say me ungrateful.   He say me selfish.   He say me female dog!  (MORE) 79",
      "characters": [],
      "action_text": "Female dog okay Vietnamese, but female dog English very bad name call woman.   Tony Dale.  Paul nods politely at the outburst.   Glancing outside, he notes that the bus is now passing through --  EXT. NO MAN’S LAND -   DAY 149   149  An area of undeveloped lots and fields. One entire square block has been removed, the resulting hole surrounded by safety   barriers.   NORMAL-SIZED MEN in hard hats work down below, only their heads visible above ground.  INT. BUS - DAY 150   150  Paul now cranes his neck to look through the front windshield and discovers that the bus is headed directly toward THE WALL encircling Leisureland.  EXT. FAR SIDE OF LEISURELAND - DAY 151   151  The bus disappears into the wall’s shadow and heads toward   a TUNNEL in the wall.   Graffiti around the entrance has made   it look like the pupil of a giant eye.  INT. BUS - DAY 152   152  The bus motors through the darkness of the tunnel, finally emerging into the light.  EXT. WORKERS’ CITY -   DAY 153   153  The bus comes to a stop, and Paul follows Ngoc Lan off. This is essentially a BORDER TOWN.   Here the protective overhead netting hangs much lower and is poorly maintained   -- Paul notices the sagging weight of a BIRD CARCASS. As Ngoc Lan leads him, he continues to take in a world he   had no idea existed.   Most imposing is the sight of -- NORMAL-SIZED TRAILERS of the sort used for   portable classrooms or construction offices.   Here they’ve been re-purposed into apartment buildings, with rows   of tiny windows and crisscrossed bootleg wiring.  NGOC LAN (CONT'D) 80 Ngoc Lan leads Paul up the entrance ramp to one particular trailer named ALONDRA, dodging Spanish-speaking CHILDREN tobogganing past on normal-size bottle caps.  INT. ALONDRA APARTMENTS - DAY 154   154  Stepping inside, Paul pauses to absorb the extraordinary interior view.   Like   inside an Embassy Suites or a high- security prison, walkways on every floor surround an ATRIUM. On the ground floor,   RESIDENTS watch a 26” televis",
      "dialogue_count": 0,
      "word_count": 1331
    },
    {
      "scene_number": 20,
      "slugline": "EXT. ALONDRA APARTMENTS - NIGHT 158   158  It’s dark now.   As Paul exits the building, his attention   is drawn by whooping and shouting. A   jubilant GROUP OF MEN have just rolled up a normal-sized   can of TECATE BEER.   On the count of “Uno, dos, tres,” they hoist it up and begin to spin it and shake it. Finally, they drop it on the ground, and with practiced ease one of them punctures the can with a screwdriver, sending   a geyser of beer high into the air. They roll the can this way and that to guide the spray into their mouths.   Others laugh as they are hosed down with beer. Paul watches, wistful at the spectacle of this simple pleasure.  INT. TOLL-FREE CALL CENTER - DAY 159   159  Paul squints at his monitor, painfully aware of the senselessness of his   job. PAUL Let’s see.   Extra Large is still available in glacier, pebble, tulip, cayenne, moss and aubergine. WOMAN (ON PHONE) Cayenne, is that like red? PAUL More of a brownish red.   Like brick. WOMAN (ON PHONE) I don’t like brick.   Do you think moss is pretty? PAUL You know, I don’t know, lady.   Could you please just pick a color? WOMAN (ON PHONE) Don’t be short with me. PAUL What did you say? WOMAN (ON PHONE) Oooh, I see.   You’re small.   You’re one of those disgusting little small people.  85",
      "characters": [],
      "action_text": "PAUL That’s right.   And you’re extra large. Paul tosses his headset on his desk and walks away.  INT. ALONDRA SEVENTH   FLOOR - DAY 160   160  Carrying a small canvas bag, Paul knocks on Ngoc Lan’s door. Soon Ngoc Lan opens it and invites Paul in.  INT. NGOC LAN’S APARTMENT - CONTINUOUS 161   161  Upon entering Paul notices that Gladys is gone. PAUL Where’s Gladys? NGOC LAN She die. PAUL Oh, no.   I’m so sorry. NGOC LAN I think maybe I give her too much pills.   Anyway, she die very happy smiling. Appalled, Paul musters a strained smile.   Ngoc Lan   sits and loosens her leg. NGOC LAN (CONT’D) Okay, you fix my foot quick.   You do quick.   One hour.   Must clean house soon. PAUL I can’t exactly fix it, but I can make a few adjustments, and I can give you some pointers on how to walk better.   It’s a process.   And I think I found the right orthopedist for you. Ngoc Lan slides the prosthesis off and hands it over. LATER -- Paul works on the crudely constructed foot, pushing 162   162  and pulling on the hinges and springs.   Now on CRUTCHES,   Ngoc Lan manages to bring   him a cup of tea. PAUL (CONT’D) Oh, thank you.   Very nice.  86 NGOC LAN You finish soon okay?   I very busy. Go work soon. PAUL I’m getting there. Ngoc Lan sits. PAUL (CONT’D) I guess you like butterflies. (pointing at the walls) Butterflies. NGOC LAN Yes I like very much.   When I little girl my father she take with my sister see butterfly.   Near my village they come live trees.   You know, fly from cold place to hot place every year.   Live trees near village then go away come back. PAUL Oh, migrating butterflies.   Sounds beautiful. NGOC LAN Yes so many butterfly in tree very beautiful.   I no forget.   So many color. PAUL How do you say butterfly in Vietnamese? NGOC LAN  Con bu’ó’m.  PAUL Kon booyem. NGOC LAN (amused)  Con bu’ó’m.  PAUL You must miss your village. NGOC LAN No more village.   Government make people go away put water all over village, all over everywhere.   Too much water.  87 P",
      "dialogue_count": 0,
      "word_count": 2473
    },
    {
      "scene_number": 21,
      "slugline": "EXT. KONRAD’S YACHT - DAY 178   178  Paul stands at the prow, the wind in his hair, Ngoc Lan beside him. Paul looks up at the   wheel house, where Konrad is at the helm chatting with Dusan.   Then he looks down at Ngoc Lan’s PEG LEG.   It’s all so odd, so unexpected.  EXT. REAR DECK - SUNSET 179   179  From a distance, we see Paul, Ngoc Lan, Dusan and Konrad dining together, enjoying the splendid view.   Dusan clowns   to the delight of the others, and Ngoc Lan seems unusually relaxed and happy.  INT. CABIN HALLWAY -   NIGHT 180   180  Paul helps Ngoc Lan down the steps to the sleeping area, and she opens the door to her cabin. NGOC LAN Good night, Paul.   I’m sure you have very much work to do with Dusan Konrad.   Very important job only you can do. PAUL Um, yeah.   Well -- NGOC LAN I know you no like cleaning.   I too big boss, you try run away from me. PAUL No, no.   That’s not -- NGOC LAN No good lie me.   Jesus my friend.   He always say me truth. Paul squints at her.   Is she for real?   Then Ngoc Lan laughs   -- an endearing honk. PAUL Do you want help with your leg? NGOC LAN I take care myself.   Good night, Paul.  98",
      "characters": [],
      "action_text": "PAUL Good night.   Sleep well. Paul watches her go,   surprised by sudden pangs of longing.  INT. PAUL’S CABIN - NIGHT 181   181  Paul awakens when the engine suddenly cuts, and the boat slows to a stop.   Voices and footsteps follow. Paul rises to peer out his tiny porthole.   In the moonlight   he makes out a SKIFF pulling alongside the yacht and TWO NEW PASSENGERS helped off the skiff and onto the yacht.  EXT. KONRAD’S YACHT - DAY 182   182  An unshaven Paul emerges onto the deck and is about to head   to the wheelhouse when he notices -- NGOC LAN and an ELDERLY MAN AND WOMAN seated on the rear deck, conversing.   The woman leans forward to clasp one of Ngoc   Lan's hands in empathy and consolation. Paul makes his way astern. NGOC LAN Look, Paul.   This Jorgen Asbjørnsen. And her wife. Upon meeting the Asbjørnsens again, we see that the years   of stress have not been   kind. PAUL Oh, my God.   Jorgen Asbjørnsen. Hello.   This is such an honor. NGOC LAN See, Paul?   Jesus smile for me. (to the Asbjørnsens) I say Paul I want visit Norway only meet you. ANNE-HELENE I’m Anne-Helene.   Please, sit.   Join us.   We’re watching the world go by. DR. ASBJØRNSEN You’ve no idea how terribly grief- stricken we were by Miss Tran’s case.  99 ANNE-HELENE Yes.   Jorgen has lost so much sleep over all the abuses. (to Ngoc Lan) It’s such a pleasure to meet you at last.   I just can’t tell you. A   few moments of quiet as all take in the surroundings. DR. ASBJØRNSEN It’s humbling, no?   Nature is such a patient sculptor -- grinding a tiny bit each day slowly, slowly for thousands of years to make such a supremely beautiful thing. (overcome with sadness) What a waste.   What a dreadful waste. Dr. Asbjørnsen rises   and shuffles away, muttering to himself in Norwegian. ANNE-HELENE You’ll have to excuse Jorgen.   These past few days have been especially hard.   Such a big decision to make. And so quickly.   Normally when we visit the Colony, we like to take the train and spend a few ",
      "dialogue_count": 0,
      "word_count": 643
    },
    {
      "scene_number": 22,
      "slugline": "INT. GALLEY - DUSK 183   183  All aboard have gathered for dinner around a table and listen intently to the great man in their midst. DR. ASBJØRNSEN The Earth has already seen five major extinctions, and now there will be another.   I didn’t want to believe it, none of us did.   But there we were in Helsinki, big and small -- climatologists, biologists, physicists, demographers, immunologists, 26 Nobel Prize winners among us.   We built all the models, did all the math, and the conclusion was consistent.   Homo Sapiens will soon vanish from the Earth.   The only question is when. Some say 500 years.   Some say sixty. Now with the terrible spike in methane release, it’s out of our grasp.   Regardless how the end will come -- unbreathable air, impotable water, incurable disease, environmental catastrophe, nuclear winter, likely a combination of them all -- relatively soon the Earth will indeed purge itself of human life, and God knows how many other species.   It is now an actuarial certainty. His mind reeling, Paul looks at Ngoc Lan.   She has been listening quietly, but tears flow down her face. DR. ASBJØRNSEN (CONT’D) (pouring himself a drink) Not a very successful species, these Homo Sapiens, even with such great intelligence.   Barely 200 thousand years.   Alligator has survived 200 million years with a brain the size of a walnut. PAUL Do you really mean extinction?   What about downsizing? DR. ASBJØRNSEN Yeah, yeah, too little too late.   Only 3% of the world has miniaturized. There simply isn’t enough time.   Yes, extinction is exactly the correct word.  101",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 262
    },
    {
      "scene_number": 23,
      "slugline": "EXT. DECK - DUSK 184   184  Paul and Ngoc Lan lean against the railing, soothed by the stars and the wind. PAUL People have been predicting the end of the world for thousands of years, and now it’s really happening.   I guess somebody had to be right someday. NGOC LAN So sad.   Very sad. They gaze at the moonlit landscape.   The moment is ripe for love.   Ngoc Lan looks at Paul, hoping he’ll sense her need, but he seems oblivious, and she starts to walk away. NGOC LAN (CONT’D) Sleep now.   Good night, Paul. PAUL Good night, Ngoc Lan. Surprised by her abrupt departure, Paul watches her go.   Then she pauses, emitting   a barely audible grunt of pain. PAUL (CONT’D) You okay? NGOC LAN I fine. PAUL Maybe I should take a look. NGOC LAN Okay.   Yes.   You look.  INT. NGOC LAN'S CABIN - NIGHT 185   185  Ngoc Lan lies on the   bed with one pant leg rolled up. PAUL Yeah, that peg’s making the socket chafe a little. Paul squeezes lotion   into his palm and begins to massage the tender skin of Ngoc Lan’s stump.  102",
      "characters": [],
      "action_text": "PAUL (CONT’D) You know, if someone had told me five years ago that one day I’d be four inches tall, divorced, helping a famous Vietnamese dissident get a new foot, and cruising up a fjord in Norway discussing the end of the world with Jorgen Asbjørnsen, I would have said he was crazy. Paul notices she hasn’t been listening.   Her eyes are closed, and her head is tipped back.   She moans slightly. Paul stops massaging.   Ngoc Lan opens her eyes just enough   to give him a look, then closes them again.   Summoning his courage, he lies down next to her and plants his lips on hers. She’s stiff and unresponsive, so he stops. PAUL (CONT’D) I’m sorry.   I thought...   Jesus, I’m such an idiot. Ngoc Lan opens her eyes and gives Paul a look at once fierce and vulnerable. NGOC LAN No.   Please.   I want. Paul draws a deep breath, eases his way close again and gives her a few gentle kisses.   Ever so slowly, she reciprocates. FADE OUT.  UNDER BLACK -- 186   186  A   STRANGE SOUND --   OOOOEEEEOOOOO .  EXT. KONRAD’S YACHT - MORNING  Zipping up parkas as   they emerge onto the deck, Ngoc Lan   and Paul discover a different landscape.   The walls of the fjord are narrower, the terrain even lusher.  INT. WHEEL HOUSE - MORNING 187   187  As Paul and Ngoc Lan   enter, Konrad and Dusan exchange a knowing look.   There   are no secrets on a boat.  OOOEEEEOOOOOO!  PAUL What’s that sound?  103 KONRAD A greeting. Konrad blasts the foghorn in response.   When Ngoc Lan looks away, Dusan gives Paul a wink and makes a crude gesture.   Paul responds with a glare that says, “Cool it.”  EXT. ISLAND IN THE FJORD - MORNING 188   188  A   tiny BEARDED MAN in rustic clothing stands on a cliff blowing into a lacquered SNAIL SHELL.   OOOEEEEOOOOOO!  EXT. PORT - DAY 189   189  Motoring into a bay,   the boat approaches a loading dock.   A few downsized fishing boats are moored in the harbor, their prows carved into dragon heads as an homage to Viking heritage. No dwellings are in sight -- just the doc",
      "dialogue_count": 0,
      "word_count": 674
    },
    {
      "scene_number": 24,
      "slugline": "EXT. HILLTOP - DAY 193   193  The cart crests a hill and pauses to enjoy the remarkable view.   A lush valley cradles a village surrounded by tiered fields.   Near the village are larger, more modern buildings. ANNE-HELENE All this land -- everything you see -- belonged for centuries to the Edvardsen family.   It was Nellie Edvardsen’s granddaughter Solveig who arranged for us to use this place for our settlement. DR. ASBJØRNSEN Solveig will remind you of this many times. ANNE-HELENE Jorgen. DR. ASBJØRNSEN (with distaste) Solveig. PAUL So that’s it.   The colony.   And that’s the original dome.   Wow. DR. ASBJØRNSEN We use it now as a social hall and fitness center, but yes, this is where we started. ANNE-HELENE It was a wonderful time.   Remember, Jorgen? DR. ASBJØRNSEN (wistful) I remember.  EXT. VILLAGE - DAY 194   194  The cart passes through a gate and into the settlement,   a marriage between a traditional Scandinavian village and a modern eco-commune. The residents’ appearance suggests a life of communal values and harmony with nature -- long hair, sandals, beards, ruddy cheeks, rustic garments.   ALL RACES   are represented.  105",
      "characters": [],
      "action_text": "There’s a sense of urgency among the villagers as they bustle about, but they’re not too busy to cheer the Asbjørnsens as they pass.   The couple respond humbly with smiles and waves. CROWD Papa Jorgen!   Mama Anne-Helene!  EXT. THE SHED - DAY 195   195  The cart stops near a large, weathered SHED built into the side of a hill.   A small welcoming party of SCIENTISTS and ENGINEERS greet the new arrivals. SOLVEIG (O.S.) Jorgen, Anne-Helene!   Oh, thank God you’ve arrived!   Why didn’t anyone tell me? All turn to see SOLVEIG EDVARDSEN running toward them.   A   plus- sized Norwegian woman in her 60s, she’s hiking up the hem   of her long, flowing garments to avoid the mud. DR. ASBJØRNSEN (smiling stiffly) Solveig. Solveig makes a big show of embracing the Asbjørnsens, drawing them into her ample bosom. SOLVEIG I love you.   I love you both so much. Ever since the decision, I didn’t feel right without you here.   And you know how I am when I worry.   I can’t eat.   I can’t sleep.   Ask anyone here, they’ll tell you.   My stomach has been so upset, like I want to throw up all the time, but can’t. And I’ve had an awful headache that just won’t go away.   I know you know about my headaches.   I love you so much.   Thank God you’re here -- I feel so much better now, like a big release. A FELLOW SCIENTIST comes to the rescue. FELLOW SCIENTIST Sorry to interrupt, Jorgen, but we need your advice immediately. DR. ASBJØRNSEN Yes, yes.   Excuse us, Solveig.  106 SOLVEIG Of course, darling.   You’ve got important things to do.   I love you. You’re a genius. ANNE-HELENE (heading away too) You look wonderful, Solveig. SOLVEIG Really?   I do?   You really think so? ANNE-HELENE Wonderful. SOLVEIG (grateful) Oh, honey. Unplugged from the attention she craves, Solveig latches onto the other new arrivals. SOLVEIG (CONT’D) Dusan, Dusan, dear Dusan.   Bless you for coming so quickly.   I love you. DUSAN (kissing her cheeks) Solveig, my darling, I am always happy to help -- in difficult ti",
      "dialogue_count": 0,
      "word_count": 805
    },
    {
      "scene_number": 25,
      "slugline": "INT. THE SHED - DAY 196   196  Solveig escorts the group inside.   To Paul and Ngoc Lan's surprise, they find that the rustic shelter conceals the entrance to -- A   LARGE TUNNEL, disappearing into the mountain like a mine shaft. NGOC LAN Where it go? SOLVEIG To China! (giggling) I’m sorry, forgive me.   Sometimes I’m so silly.   No, to the vault. PAUL The vault? SOLVEIG Oh, yes.   We’ve been working on it almost since the very beginning. Actually, not many people know this, but it was my idea DUSAN Of course it was.   You’re always thinking ahead. SOLVEIG When Jorgen made his big discovery, I said, look, Jorgen, you’re a genius, and downsizing is a genius idea.   No one’s questioning that.   No one.   But what if people don’t accept it?   What if it doesn’t catch on in time?   Look at me -- you know, it took me years before I did it.   I had to sell my antiques and find homes for my cats. They’re very old and one of them is diabetic, needs two shots every day. It was a complete nightmare.   Anyway, this is what they came up with.   On my suggestion. Solveig leads Ngoc Lan and Paul toward TORVALD, an engineer seated at a control panel. SOLVEIG (CONT’D) Torvald, be a sweetheart and give our friends a little tour.  109",
      "characters": [],
      "action_text": "TORVALD The tunnel leads to a vault 1.6 kilometers inside the Earth’s lithosphere and encased in a double layer of Inconel 625. Torvald points at an   array of MONITORS displaying high-angle views of streets, homes, farms and pastures. TORVALD (CONT’D) In addition to maintaining a broad spectrum of biodiversity, the vault is equipped with fields for growing foods, forests for lumber, livestock for animal husbandry.   The residential areas are spacious and easily expandable to provide for future generations. PAUL Wait, that’s not underground. SOLVEIG Of course it is!   Our new size makes it possible.   Otherwise we never could have dreamed of preserving so much of the world in a single safe place. PAUL This is brilliant. (to Ngoc Lan) Isn’t this brilliant?   Like Noah’s Ark. SOLVEIG That’s exactly what I told Jorgen. It’s Noah’s Ark! PAUL What kind of power are you using, nuclear? TORVALD No, no, 100% geothermal. Interoperable organic systems manage production of artificial sunlight, oxygen, CO2 elimination, water purification, and so forth. As Paul soaks everything up, Ngoc Lan takes his hand. PAUL So how long will you stay down there?  110 SOLVEIG What is it, Torvald?   Eight thousand years? TORVALD (lips pursed) Something like that.   Until the surface environment stabilizes.  INT. COMMUNITY DINING HALL - NIGHT 197   197  All the villagers --   perhaps 250 -- dine together at long wooden tables.   Tonight the atmosphere is electric. Paul and Ngoc Lan sit near the Asbjørnsens and other SCIENTISTS who, between chews, dispassionately explain the project at hand.   Konrad and Dusan sit nearby. ONE SCIENTIST You know, it’s not unprecedented what we are doing.   Less than a hundred thousand years ago humans experienced a near-extinction.   Maybe 2,000 survived.   And from that handful came all the billions of people you see today. ANOTHER SCIENTIST Rebooting the species.   Nothing new. Glasses clink.   Dr. Asbjørnsen rises.   Never a comfortable public speaker, he scans",
      "dialogue_count": 0,
      "word_count": 2669
    },
    {
      "scene_number": 26,
      "slugline": "EXT. NEARBY HILL - NIGHT 205   205  From a vantage point   atop an incline, Dusan, Konrad and Ngoc Lan somberly watch the door closing.  EXT. TUNNEL - CONTINUOUS 206   206  The door is nearly shut, when from behind it comes a muffled, panicked cry. PAUL (O.S.) WAIT! The door stops, then   reopens slightly.   Paul squeezes out. PAUL (CONT’D) Thanks, Torvald.   Thanks. (jerking something) My bag.   Do you think you could --? TORVALD (O.S.) Leave it. PAUL But -- TORVALD (O.S.) You need to get away from here! PAUL Okay, sure.   Yeah. TORVALD (O.S.) Run! Paul releases the bag and sprints away.  EXT. NEARBY HILL - NIGHT 207   207  Dusan, Konrad and Ngoc Lan have taken cover behind rocks. Dusan peeks out and,   breaking into a smile, invites the others to witness Paul scrambling up the hill in a panicked zig-zag. DUSAN What did I tell you?   Nothing ever works out for this guy. NGOC LAN Paul! Paul spots his friends runs straight into Ngoc Lan's arms.  121",
      "characters": [],
      "action_text": "PAUL (out of breath) I was thinking about what you said, and I... realized... you’re right. I   am   Paul Safranek.   And... what you were asking... It   was   a love fuck. Ngoc Lan bursts into   tears of happiness and embraces him tightly. KA-BOOM!   An EXPLOSION above the tunnel entrance creates a landslide which tumbles down to conceal it forever.   Our friends take cover, but they needn’t have -- it’s all small scale, so the dirt falls pathetically. Soon they emerge from behind the rocks. NGOC LAN Okay, now we go back Leisureland. Okay, Dusan Konrad Paul?   You promise.   Nothing more here.   We go now. The three men stare at her, reminded once again what a monomaniac she can be.  EXT. KONRAD’S REAR DECK - DAYBREAK 208   208  Paul, Dusan and Ngoc   Lan watch the island recede as the yacht sails out of the harbor amid the rising sun. TERGEHL (V.O.)  And so it was that Safrapül the Good forsook salvation in order to return to Lohserlund with Princess Noc, to care for the sick and crippled of our ancestors.  INT. CAVE - NIGHT 209   209  Tergehl has reached the end of the story and sits back to gauge its effect on his listeners. LITTLE BOY  Then what happened?  TERGEHL  That is the end, little ones. There is nothing more to tell.  (MORE) 122 We know nothing more of Safrapül, nor of Princess Noc, nor of Drooshan the Cunning, nor of the sacrifices they made.  EXT. CAVE - NIGHT 210   210  Across a moonlit desolate landscape, we see the cave, high   on a   hill, illuminated by the fire within. TERGEHL (O.S.)  But that is why, each year at the feast commemorating the Great Exodus, we leave an empty seat for Safrapül, so that we remember all those who remained behind and suffered through the hell to come.  INT. AIRPLANE - DAY 211   211  Paul looks out the window.   He seems now genuinely clear- headed, aware, awake. PAUL To think, one day, all of this -- NGOC LAN Now maybe you understand little bit how I feel after survive TV box. Paul looks at her, takes her hand. NGOC L",
      "dialogue_count": 0,
      "word_count": 1024
    }
  ]
}