{
  "slug": "dr-ken-101-pilot-2015",
  "title": "dr ken 101 pilot",
  "genre": "drama",
  "format": "series",
  "scenes_count": 2,
  "characters_count": 1,
  "characters": [
    "CELLMATE"
  ],
  "total_words": 7124,
  "total_dialogue": 1,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. HMO - PSYCHIATRY WING - OFFICE - DAY 4   4  KEN LIES ON A COUCH, TALKING TO A   THERAPIST   (FEMALE, 40’S, NO  NONSENSE).   *  KEN  Ugh!   I’m so stressed out.   It’s these  patients - they’re all such whiny,  complaining bitches.   Know what I   *  mean?  THERAPIST  (DRY)   Yes.   I know exactly what you  mean.  KEN  And my daughter’s not helping.   Barely  16, and she gets her tongue pierced!  That’s like a flashing sign to boys  that she has left the Homeroom and  gone directly to the Champagne Room.  THERAPIST  But she’s doing well in school, right?  Second in her class?  KEN  Exactly !   I taught her everything she  knows.   Now she’s applying it towards  this wild streak.   Case in point?   She  kept that piercing hidden for two  weeks!   I just thought she was being  respectfully quiet for a change.  DR. KEN - \"PILOT\"   4.  (MORE)",
      "characters": [],
      "action_text": "The girl’s a genius.   I’ve created a  monster!  THERAPIST  So you blame yourself.   *  KEN   *  No.   *  THERAPIST   *  Have you considered blaming yourself?   *  KEN  Oh no.   I blame her mother.   She   *  enables it by coddling her.   I’m   *  positive.  THERAPIST  Okay, I'm going to use a technical   *  term here... you’re a jackass.   *  KEN  Whoa!   Not cool.   Very unprofessional,   *  Honey.  THE THERAPIST IS KEN’S WIFE,   ALLISON .   A   RECEPTIONIST   CALLS  OVER THE INTERCOM.  RECEPTIONIST (O.S.)  Doctor Park...?  ALLISON  Yes?  KEN  Yes?  RECEPTIONIST (O.S.) (CONT’D)  Your 5:15 is here.  DR. KEN - \"PILOT\"   5.  KEN (CONT'D) ALLISON  (CALMLY)   Thank you, Nina.  KEN  It’s time to put our foot down, Allie.  ALLISON  You sound like your father.  KEN  I do not.   My father sounded like  this:   (RANTS STERNLY IN KOREAN)   ¿Ã  ≥ Û± ∏ ¥¬ « √∑π ¿ÃÆÓØ° ¿¸¥\u0000«’¥Œ¥Ÿ.   ¿Ã  ≥ Û± ∏ ¥¬ « √∑π ¿ÃÆÓØ° ¿¸¥\u0000«’.  ALLISON  Which means?  KEN  You will become a doctor, or you will   *  need one when I’m finished with you.  ALLISON  We’re not our parents, Ken.   And I'm   *  glad, because otherwise, I'd be  sleeping with your dad, which would be  really weird.   *  KEN  That would be.   (SIGHS)   It’s just so   *  hard to give your kids space when you  see them being so, so incredibly  stupid.  DR. KEN - \"PILOT\"   6. ALLISON  But it’s what we have to do.  KEN  I don’t think they need space.   I   *  think they need... what’s the opposite   *  of space?   It’s duct tape.   I think   *  they need to be taped down.   Can we do   *  that?   I’m not a hundred percent   *  kidding.   *  ALLISON  Well, you might have to tape down the   *  car, too.   You know Molly re-took her   *  driver’s test today.   *  KEN  (MATTER-OF-FACTLY)   Doctor, I’m going  to need a gross of Xanax and a  bargeful of Valium.  ALLISON  There’s a stash of both in my night   *  table.   It was a wedding gift to   *  myself.   *  KEN  I’m praying she fails again.   I’m   *  praying real hard.   *  ALLISON   * ",
      "dialogue_count": 0,
      "word_count": 5657
    },
    {
      "scene_number": 2,
      "slugline": "INT. JAIL CELL - LATER 15   15   *  KEN, STILL SHIRTLESS, LIES ON A BENCH BESIDE A   CELLMATE   *  (30’S, STENTORIAN VOICE, DRUNK, COULD BE A PROFESSOR, COULD  BE HOMELESS).  CELLMATE  What you in for?  KEN  My daughter has the same name as a  Class A controlled substance.  CELLMATE  (NODS)   Ah, Cocaine.   Beautiful name.  Very unique.  KEN SHOUTS OUT THE BARS.  KEN  Guard!   I don’t belong in here with  these common criminals.  CELLMATE  Tell me about it.   Little advice: You  wanna survive in the joint?   You walk  right up to the biggest, baddest mofo  on the block and you clock him right  in the face.  KEN  You’re the only other person in here,  Gary.  CELLMATE OFFERS HIS FACE TO BE HIT.  CELLMATE  Hey.   You gotta do what you gotta do.  DR. KEN - \"PILOT\"   45.",
      "characters": [
        "CELLMATE"
      ],
      "action_text": "KEN LOOKS AT HIS FIST, CONSIDERING, WHEN A   GUARD   ARRIVES.  GUARD  Your wife and children are here.  KEN  (SKYWARD)   Thank you.  CELLMATE  If you wanna have a conjugal visit  just say the word.   I’ll even turn  around... maybe.  ALLISON   ARRIVES , MOLLY AND DAVE IN TOW.  ALLISON  Oh my god.   Are you okay?  KEN  (SARCASTIC)   Oh, I’m great, Allison.  Making a lot of new friends.   You’d be  surprised how much an exposed toilet  brings people together.  CELLMATE  The pleasure was all mine.  KEN  (TO MOLLY)   Are you alright?   *  MOLLY  Yeah, Dad.   (THEN)   Actually, the club  kinda sucked.   And the second a guy   *  hits on Avery, she disappears and   *  leaves me alone.  DR. KEN - \"PILOT\"   46. DAVE  Classic Avery.  MOLLY  I don’t even like those places,  anyway.  ALLISON  Good.   The people who dance to that  music are weirdos.  KEN  (EMBARRASSED)   Totally.  MOLLY  The point is...   I’m sorry I lied.  KEN NODS, APPRECIATIVE.  KEN  I’m sorry, too.   You have no idea how  badly I wanted to trust you.  THEY LOOK AT EACH OTHER, A TENDER FATHER-DAUGHTER MOMENT...   *  CELLMATE   *  (TO MOLLY)   Your father loves you very   *  much, Cocaine.   *  KEN   *  But it’s hard for me.   I mean, put   *  yourself in my mens’ five-and-a-halfs.  DAVE  That’s technically boys’ size.  KEN  Thank you, Dave.   *  DR. KEN - \"PILOT\"   47. ALLISON   *  (TO MOLLY AND DAVE)   Okay, why don’t   *  you two wait by the desk.   There’s   *  going to be an apology that you don’t   *  need to hear.   *  KEN   *  (THE BIGGER PERSON)   Al, you don’t   *  have to--   (OFF HER GLARE)   Oh, you   *  want   an apology.   (TO KIDS)   Yeah, go   *  over there.   *  THE KIDS   EXIT , LEAVING KEN AND ALLISON.   *  KEN (CONT’D)   *  Look, I’m sorry.   You know I am a   *  paranoid freak.   And sometimes,   *  paranoid freaks end up dancing in a   *  bunny head, and doing hard time.   *  ALLISON  Ken, I know that when it comes to the   *  kids, we don’t always see eye to eye.   *  But there’s got t",
      "dialogue_count": 1,
      "word_count": 1467
    }
  ]
}