{
  "slug": "dunkirk-2017",
  "title": "dunkirk",
  "genre": "action",
  "format": "film",
  "scenes_count": 25,
  "characters_count": 0,
  "characters": [],
  "total_words": 14121,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. BASE OF THE MOLE - CONTINUOUS A Warrant Officer tries to keep order as men line up to start the shuffle out along the eight-foot wide concrete mole. The line of stretcher-bearers approaches... From the base all you can see is the backs of helmeted heads queuing out onto the narrow breakwater. The Warrant Officer sees the stretchers, waves them past - WARRANT OFFICER Along the mole. All the way, she’s leaving - A ship’s whistle - WARRANT OFFICER (CONT’D) That’s it. (he turns) MAKE WAY! MAKE WAY! The stretcher-bearers squeeze past... EXT. BEACH - CONTINUOUS Tommy and Gibson hear the ship’s whistle. They start running with the stretcher, heading for the base of the mole... EXT. BASE OF THE MOLE - CONTINUOUS The Warrant Officer addresses a group of French soldiers. WARRANT OFFICER NO FRENCH! NON FRANÇAISES - SEULEMENT ANGLAISES! ENGLISH ONLY, YOU’LL HAVE YOUR OWN SHIPS! Tommy and Gibson arrive, panting. The Warrant Officer looks up at them. The ship’s whistle - the Warrant Officer points up - WARRANT OFFICER (CONT’D) That’s two minutes - you’ve missed it. He turns back to arguing with the French... Tommy pushes forward with the stretcher. Soldiers try to let him through on the narrow mole -  7.",
      "characters": [],
      "action_text": "The Warrant Officer, seeing Tommy, just shakes his head. EXT. HOSPITAL SHIP - CONTINUOUS Stretchers are loaded up the gangplank onto the deck of the ship, supervised by a Petty Officer. He checks his watch, then looks along the mole at the remaining stretchers... EXT. THE MOLE - CONTINUOUS Tommy weaves along the mole, squeezing past the mass of troops jamming the breakwater... Tommy leans out over the edge where the rail is missing, a twenty-foot drop to the churning water... Gibson follows, echoing Tommy’s route and footing. EXT. HOSPITAL SHIP - CONTINUOUS The last of the line of stretchers is carefully, awkwardly raised up from the mole onto the deck of the ship. The Petty Officer speaks urgently to the last stretcher-bearer. PETTY OFFICER Last? The Stretcher-Bearer nods, too breathless to speak, then follows his colleagues back down off the ship. An explosion hits the water nearby - Everyone hits the deck as shells impacts the water. EXT. THE MOLE - CONTINUOUS Tommy is pulled up short as Gibson stumbles - An ME 109 strafes the length of the mole with gunfire - soldiers hit the deck, several are hit... Gibson struggles up. CUT TO:  8.",
      "dialogue_count": 0,
      "word_count": 405
    },
    {
      "scene_number": 2,
      "slugline": "EXT. WEYMOUTH HARBOUR - DAY Peter and George rush things off the boat, then start loading the orange life-preservers. Mr. Dawson looks up from his charts to see naval officers and crew coming along the harbour, assigning crew members to boats... Peter follows his gaze - INT. MOONSTONE - CONTINUOUS Peter bursts into the cabin, stacking life vests. EXT. MOONSTONE - CONTINUOUS The pile of life vests on the dock shrinks... Mr. Dawson watches the naval men coming closer - CUT TO: INT. COCKPIT, SPITFIRE 1 - CONTINUOUS Farrier lightly brushes his fingers over the dashboard. COLLINS (over radio) Dunkirk’s so far, why can’t they load at Calais? Farrier looks over at his wing mate, Collins (Fortis 2). FORTIS LEADER (over radio) The enemy had something to say about it. INT. COCKPIT, SPITFIRE 2 - CONTINUOUS Collins scans the skies above... COLLINS Down here we’re sitting ducks. FORTIS LEADER (over radio) Keep ‘em peeled. They’ll come out of the sun.  9.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 162
    },
    {
      "scene_number": 3,
      "slugline": "INT. COCKPIT, SPITFIRE 1 - CONTINUOUS Farrier looks around into the blinding sun... CUT TO: EXT. HOSPITAL SHIP - CONTINUOUS The Petty Officer barks orders at the crew - PETTY OFFICER Man the bow line! Ready on the stern! Troops stuck down on the mole below look resentfully at the ship preparing to depart. One Soldier calls up - SOLDIER Any more room? The Petty Officer glares down at him. EXT. THE MOLE - CONTINUOUS Tommy breaks through a tight crowd of soldiers and stops. In front of him is a jagged chasm. One narrow plank laid across it. The drop is fifteen feet to rocks and concrete below. The ship’s whistle sounds. Tommy stares - SOLDIER Take a run at it! Tommy glances at the Soldier who spoke. Looks back at Gibson. TOMMY One, two, three! Tommy bolts across, pure concentration, the plank bowing and bouncing as he crosses the middle, Gibson following. Tommy’s foot slips, he almost goes over, rights himself - Helpful arms grab them as they hit the other side, a couple of cheers from the crowd. Tommy ploughs on -  10.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 187
    },
    {
      "scene_number": 4,
      "slugline": "EXT. HOSPITAL SHIP - CONTINUOUS Tommy passes the stretcher-bearers coming back down the mole. One of them moves to help but Tommy shakes his head, pushing past. The Petty Officer gestures at his men to pull the gangplanks - PETTY OFFICER PULL THE GANGPLANKS! Tommy and Gibson arrive at the end of the mole. TOMMY Oi! A gangplank is shoved back down. They struggle up it with the stretcher. When they make it to the deck they practically drop their burden, gasping for breath. Orderlies takes the stretcher below. Tommy and Gibson look around for a place to perch, catching their breaths... CUT TO: EXT. MOONSTONE - CONTINUOUS Mr. Dawson sees the Naval Officers stepping onto their dock - MR. DAWSON Ready on the stern line. George hops onto the dock, unties the stern line. Stops. Looks at the approaching Officers. Then back to Mr. Dawson - GEORGE Aren’t you waiting for the navy? Mr. Dawson starts the engine. Peter jumps down onto the boat with the bow rope... MR. DAWSON They’ve asked for the Moonstone, they’ll have her. With her captain. PETER And his son.  11.",
      "characters": [],
      "action_text": "The boat moves off. Peter looks to catch the line from George. PETER (CONT’D) Thanks for the help, George. Who, instead, jumps onto the stern, to Peter’s surprise. PETER (CONT’D) You know where we’re going? GEORGE France. MR. DAWSON Into war, George. GEORGE I’ll be useful, sir. Mr. Dawson looks at George. Pushes the throttle forward and they motor out of the harbour into the English Channel... CUT TO: INT. COCKPIT, SPITFIRE 2 - DAY Collins spots something - INT. COCKPIT, SPITFIRE 1 - DAY Farrier spots the ME 109 coming out of the sun - FARRIER Bandit - eight o’clock. FORTIS LEADER (over radio) Break. EXT. SKY OVER ENGLISH CHANNEL - CONTINUOUS The three Spitfires dart away from each other. The German plane takes the left one (Collins), hurtling down - INT. COCKPIT, SPITFIRE 2 - CONTINUOUS Collins dives, rolling, glancing back -  12. COLLINS He’s on me! INT. COCKPIT, SPITFIRE 1 - CONTINUOUS Farrier banks around, lining up on Collins’ pursuer. FARRIER And I’m on him - CUT TO: EXT. HOSPITAL SHIP - EVENING Tommy and Gibson shuffle around the deck, looking for a spot to settle... The Able Seaman manning the gangplank calls over - ABLE SEAMAN You two, get a shift on! Tommy reluctantly follows Gibson onto the plank. EXT. THE MOLE - CONTINUOUS As he shuffles down the gangplank he looks over at the thousands queuing on the mole... A Second Lieutenant on the mole waves Tommy along - SECOND LIEUTENANT Off you two! Back up the line! As Tommy steps off the plank he hears a noise: Gibson, finger to his lips, ‘shush’, is crouched in the crisscross structure below the mole where he can’t be seen by the officers on top. He beckons Tommy to join him... PETTY OFFICER That last barrage damaged the rudder! The Second Lieutenant turns to the Petty Officer. Tommy slips down beside Gibson - SECOND LIEUTENANT Tie up again while we try to fix it.  13. They settle in on the beams just above the water line... CUT TO: EXT. MOONSTONE, ENGLISH CHANNEL - MORNING Mr. Dawson comes to the back of the ",
      "dialogue_count": 0,
      "word_count": 793
    },
    {
      "scene_number": 5,
      "slugline": "INT. COCKPIT, SPITFIRE 2 - CONTINUOUS Collins pulls hard left, rolling up and left as tracer fire streaks past. INT. COCKPIT, SPITFIRE 1 - CONTINUOUS Farrier watches the ME 109 cut left to follow Collins. He pushes the button on his stick to strafe the plane with his cannons... Smoke starts trailing from the German plane. FARRIER Clear. EXT. SKY OVER ENGLISH CHANNEL - CONTINUOUS The ME 109 trails heavy smoke as it tips towards the water - INT. COCKPIT, SPITFIRE 2 - CONTINUOUS Collins straightens out, tries to look back - COLLINS Is he down? INT. COCKPIT, SPITFIRE 1 - CONTINUOUS Farrier watches the ME 109 smash into the water, breaking up in a fiery mess - FARRIER Down for the count - Tracer fire smashes into Farrier’s plane, sparking inside and out. Farrier banks hard right as a second 109 streaks away. He straightens up. FARRIER (CONT’D) Fortis leader, one bandit down... Nothing. FARRIER (CONT’D) Fortis leader, do you read? Nothing. Farrier looks around, spots a Spitfire -  15.",
      "characters": [],
      "action_text": "FARRIER (CONT’D) Fortis 2, I have you to port - no eyes on Fortis Leader. Over. COLLINS (over radio) Understood, Fortis 1. Orbit for a look... Farrier looks all around as he pulls right on the stick... CUT TO: EXT. THE MOLE - EVENING Eerie quiet. Tommy and Gibson sit in the structure, unseen, listening... Commander Bolton checks his progress on board the hospital ship. COMMANDER BOLTON How long, Lieutenant? LIEUTENANT We need to run a new cable, sir. They’re scrambling. Commander Bolton turns to Colonel Winnant, the army representative. COMMANDER BOLTON Colonel, you’re going to have to decide how many more wounded to evacuate... one stretcher takes the space of seven standing men. Colonel Winnant takes this in. Tommy crouches lower as he sees a launch approach... A high-ranking officer is helped up the ladder onto the mole. COMMANDER BOLTON (CONT’D) (salutes) Rear Admiral. REAR ADMIRAL Commander. (to Colonel Winnant) At ease, Colonel. How’s the perimeter?  16. Colonel Winnant gestures towards the smoke-shrouded town - COLONEL WINNANT Shrinking ever day. But between our rearguard and the French... we’re holding the line. And the enemy tanks I’ve stopped. COMMANDER BOLTON Why? COLONEL WINNANT Waste precious tanks, when you can pick us off from the air, like fish in a barrel? COMMANDER BOLTON How long does London expect the army to hold out before we make terms? The Rear Admiral looks sharply at the idea. REAR ADMIRAL Make terms? They’re not stopping here. We need to get our army back. The Rear Admiral points across the dark water... REAR ADMIRAL (CONT’D) Britain’s next. Then the world. Commander Bolton puts his field glasses to his face. COMMANDER BOLTON Christ, you can almost see it from here... COLONEL WINNANT What? COMMANDER BOLTON Home. (turns to town) What about the French? REAR ADMIRAL Publicly, Churchill’s told them  bras dessous . (off look) Arm in arm. Leaving together. COLONEL WINNANT And privately?  17. REAR ADMIRAL We need our army back. COLONEL WINNANT Ho",
      "dialogue_count": 0,
      "word_count": 3036
    },
    {
      "scene_number": 6,
      "slugline": "EXT. DESTROYER - CONTINUOUS Up on deck, Gibson watches several row boats heading towards them. Hearing the engines, they start shouting - MALE VOICES Wait! Wait for us! Gibson spots white water on the black sea - a wake - MALE VOICE (O.S.) TORPEDO! An explosion lifts   water at the side of the ship - INT. HOLD, DESTROYER - CONTINUOUS The cheering stops, Boooooms shudder the suddenly fragile iron walls of the hold, massive percussions of wobbling metal sheets. EXT. DESTROYER - CONTINUOUS A blast that moves every bolt of the destroyer - INT. HOLD, DESTROYER - CONTINUOUS Anyone standing is thrown off their feet - EXT. DESTROYER - CONTINUOUS A vast plume of fire explodes up and out of the funnel. The deck blasts apart - INT. HOLD, DESTROYER - CONTINUOUS Men scream as the iron plates of the walls buckle. A glimpse of water blasting in - The lights go out. Complete darkness... Sound of men screaming barely audible over the sound of blasting water and bending metal -  31.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 173
    },
    {
      "scene_number": 7,
      "slugline": "EXT. DESTROYER - CONTINUOUS The ship lists, rapidly sinking. The row boats pull away, hard. Gibson prepares to jump - glances back at the closed door to the hold - jumps back, opens the door - INT. HOLD, DESTROYER - CONTINUOUS Blackness. The dim light of the open door becomes a beacon. Tommy spots Gibson waiving - Tommy and Alex claw their way up the steps as the entire ship goes under - EXT. DESTROYER - CONTINUOUS Tommy and Alex burst free of the door as it sinks beneath the waves and - They pull away from the disappearing ship with the strength born of absolute desperation... CUT TO: EXT. MOONSTONE, ENGLISH CHANNEL - DAY George hears planes behind them. He looks up - Three Spitfires in confident formation sweep overhead... Mr. Dawson keeps his eyes on the black smoke ahead of them. MR. DAWSON Spitfires, George. Greatest plane ever built. George smiles. Then looks quizzical - GEORGE You didn’t even look. MR. DAWSON Rolls Royce Merlin engines. Sweetest sound you could hear out here.  32.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 177
    },
    {
      "scene_number": 8,
      "slugline": "INT. CABIN, MOONSTONE - CONTINUOUS Peter is folding a chart. A clicking sound catches attention - the handle of the forepeak door is being rattled from the other side. Peter freezes, uncertain what to do... BANG - the rattles become bangs - SHIVERING SOLDIER (O.S.) Hello?! Anyone there?! Peter puts the chart down, takes a step towards the door - BANG! SHIVERING SOLDIER (O.S.) (CONT’D) OPEN UP, DAMMIT! Peter freezes. Turns back to the companionway - EXT. MOONSTONE - CONTINUOUS Peter pokes his head out. Mr. Dawson looks at him, quizzical- PETER He wants to come out - The banging and shouting of the Shivering Soldier continues. MR. DAWSON What did you do? Lock him in? Peter is at a loss. MR. DAWSON (CONT’D) Let him out, for God’s sake! INT. CABIN, MOONSTONE - CONTINUOUS Peter comes down the companionway, reluctantly approaching the banging, rattling door... The banging stops... Peter reaches up to the bolt, braces, gently slides it back... Opens the door. The forepeak is empty... Peter rushes in, spots the open forward hatch...  33.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 177
    },
    {
      "scene_number": 9,
      "slugline": "EXT. MOONSTONE - CONTINUOUS Mr. Dawson leans down to try and see in the cabin - SHIVERING SOLDIER (O.S.) You haven’t turned around! Mr. Dawson turns calmly to the Shivering Soldier. MR. DAWSON No. We have a job to do. SHIVERING SOLDIER Job? This is pleasure yacht! You’re weekend sailors, not the blood navy! A man your age - MR. DAWSON Men my age dictate this war. Why are we allowed to send our children to fight it? SHIVERING SOLDIER YOU SHOULD BE AT HOME! MR. DAWSON There won’t be any home if we allow thus slaughter across the Channel. There’s no hiding from this. CUT TO: INT. COCKPIT, SPITFIRE 1 - DAY Farrier chases the 109 as it circles around on Collins... INT. COCKPIT, SPITFIRE 2 - DAY Collins glances out at his burning wing. Checks his altimeter, checks his canopy is locked in the half-open position- Lower... INT. COCKPIT, SPITFIRE 1 - CONTINUOUS Farrier fires at the 109, chasing him off - FARRIER He’s turned tail, I’m after him -  34.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 174
    },
    {
      "scene_number": 10,
      "slugline": "INT. COCKPIT, SPITFIRE 2 - CONTINUOUS Collins checks his belts are tight, checks the release pin on his harness - COLLINS Good luck. Watch your fuel... (reads) Fifteen gallons. Checks his Mae West, puffing into the inflating tube - Lower... INT. COCKPIT, SPITFIRE 1 - CONTINUOUS Farrier grease pencils the reading on the chart - FARRIER Fifteen gallons, understood... INT. COCKPIT, SPITFIRE 2 - CONTINUOUS FARRIER (over radio) Best of luck, Collins. Collins checks wind direction, checks wave direction on the surface of the water - Lower... Turns, lining up along the waves as he descends... Lower... The water rushes by blindingly fast... INT. COCKPIT, SPITFIRE 1 - DAY Farrier watches Spitfire 2 carve gracefully across the water, before coming to a stop, floating. Farrier spots a civilian yacht heading for Collins... He sees Collins’ hand stick out of the canopy, waving... He tips his wings at Collins, turns away, looks ahead, chasing the 109 towards Dunkirk... CUT TO:  35.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 161
    },
    {
      "scene_number": 11,
      "slugline": "EXT. WATER, JUST OUTSIDE DUNKIRK HARBOUR - NIGHT Tommy and Alex, life jackets on, swim on the swell, bodies and burning wreckage all around, fuel burning on the surface of the water. Tommy and Alex pull for an overloaded row boat. Tommy grabs the side, tries to climb. He’s pushed off by the men inside - MALE VOICE Piss off - it’s too crowded! Alex is grabbing at the rail as well - ALEX You can’t leave us! Make some room - SOLDIER (O.S.) You men, leave off. You’ll capsize the boat - it’s gone over twice on the way out here... Tommy looks at the Soldier. It is the Shivering Soldier, not yet shivering, in full control of his faculties. SOLDIER (CONT’D) You have to stay calm. There are plenty of boats. ALEX Calm?! Wait till you get torpedoed, then tell us to be calm! SOLDIER You have life jackets? MALE VOICE Yeah, they do. SOLDIER Don’t panic, the water’s not too rough, or too cold. We’re heading back to the beach - MALE VOICE Fuck off! Let’s go to Dover! Several voices join in. SOLDIER We can’t make it across the Channel on this, lads. We need to get back to the beach and wait for another ride.   (MORE)  36.",
      "characters": [],
      "action_text": "(gestures) It’s not even half a mile. You men in the water float here, save your strength, we’ll come back for you. The men start rowing. Gibson is in the back. Alex spots him. Gibson quietly drops the rear painter (a small rope attached to the stern) into the black water. Alex takes it, hands part of it to Tommy and they quietly drag behind the boat as it rows in to the shore... The men in the rear notice, but nobody says anything... As the dawn breaks, the small, packed boat pulls across the calm water to the vast, packed beach at Dunkirk. CUT TO: EXT. MOONSTONE - DAY The Shivering Soldier steps up to Mr. Dawson - SHIVERING SOLDIER What is it you think you can do out there?! On this thing?! MR. DAWSON Not just us. The call went out - we won’t be the only ones to answer. SHIVERING SOLDIER YOU DON’T EVEN HAVE GUNS! MR. DAWSON Did you have a gun? SHIVERING SOLDIER Course. A rifle - 303. MR. DAWSON Did it help you against the dive bombers? Or the U-boats? The Shivering Soldier glares at Mr. Dawson. SHIVERING SOLDIER You’re an old fool. And you’re going to die if you don’t turn around. SOLDIER (CONT'D)  37. The booms echo. Closer now. SHIVERING SOLDIER (CONT’D) We’re turning around, now! The Shivering Soldier steps towards Mr. Dawson, screaming at the top of his lungs - SHIVERING SOLDIER (CONT’D) TURN IT AROUND! TURN IT AROUND! - Peter, hearing this, makes his way back from the bow. The Shivering Soldier grabs the wheel. George grabs his shoulder - The Shivering Soldier smashes his elbow into George’s face, sending him flying backwards down the companionway - Peter pulls the Shivering Soldier away from the wheel. PETER Calm it down, mate. The Shivering Soldier looks at him, shocked. Confused. Peter calls down the companionway - PETER (CONT’D) George? Nothing? PETER (CONT’D) George?! Nothing. The Shivering Soldier watches as Peter climbs down to find - INT. CABIN, MOONSTONE - CONTINUOUS George, sprawled out at the foot of the steps, on his back, quietly groaning, bleedi",
      "dialogue_count": 0,
      "word_count": 599
    },
    {
      "scene_number": 12,
      "slugline": "INT. COCKPIT, SPITFIRE 1 - DAY Farrier chases the 109, gradually closing... Up ahead, a convoy of ships is gathered around the entrance to the harbour... Farrier passes over a fishing trawler with a blue cabin, covered with soldiers, strangely low in the water, water washing across its decks... He looks up ahead to the 109, just coming into range... He spots German planes in the distance, heading towards him - he sights the 109... Fires a short burst... Nothing... He remembers his fuel gauge... Pointlessly pushes the button next to the cracked gauge. No response. Farrier checks his position on his chart. Checks the last fuel reading he grease-penciled... knows he should turn around - Farrier sights the 109, banking slightly to bring it across his sights... Farrier fires - the 109 starts smoking, dropping - Farrier spins around - turning away from the approaching planes. Heading for Dover... for home. As he passes over the sinking blue trawler, he sees men jumping into the water, swimming for a destroyer nearby... In his rear-view mirror: the enemy planes approaching... Farrier looks at his cracked fuel gauge... Thinking... CUT TO: EXT. BEACH AT ZYDECOTTE (7 MILES EAST OF DUNKIRK) - DAWN The surf has picked up since yesterday... Tommy, Gibson, Alex lie on the beach, sleeping as the light comes up on a stormy day. In the distance, towards the dark smoke of Dunkirk, the lines of men extend into the sea.  39.",
      "characters": [],
      "action_text": "Nearby, small groups of soldiers attempt to climb onto small vessels. Row boats are being swamped and overturned in the surf, overcrowded boats are grounded on the sand - MALE VOICE Right. Three of you out, or the rest’s stuck. Soldiers give up their places. Some head back out of the surf. Some wade out past the break... EXT. BEACH AT MALO LES BAINS - CONTINUOUS Colonel Winnant walks the beach, surveying. He approaches a group of Engineers driving trucks onto the sand, taking the air out of their tires, laying duckboards on top... ENGINEER (brightly) A pier. When the water comes back in. Tide’s turning, now. Colonel Winnant looks out at the churning water. COLONEL WINNANT How can you tell? ENGINEER (quietly) The bodies come back. Colonel Winnant looks out at the water - men in line, chest deep, gently push floating bodies aside as they wash in. EXT. BEACH AT ZYDECOTTE - CONTINUOUS Tommy bangs a tin of vegetables on a rock. It springs a leak and he sucks the juice. Gibson holds out his hand. Tommy keeps sucking for a beat or two, then hands it over. Tommy watches Vanquisher loading troops from the vast crowd lining the mole. Despairing. Alex opens his eyes and sits up. Spots some Highlanders walking past, away from Dunkirk in loose formation... ALEX Hey! Highlanders! Tommy watches as Alex gets to his feet, heading over to his regimental comrades.  40. ALEX (CONT’D) What’s that way? HIGHLANDER 1 (points) A boat. Alex follows his gesture to a fishing trawler with a blue cabin, listing in the shallows a mile up the beach. ALEX She’s grounded. HIGHLANDER 2 Not when the tide comes in, she isn’t. Tommy and Gibson are already on their feet. Alex nods at them as they follow the highlanders down the beach towards the grounded trawler... CUT TO: INT. CABIN, MOONSTONE - DAY Peter goes down below to check on George. He checks the bleeding on the life jacket behind George’s head. PETER What’d you want to come along for, George? GEORGE Sea cadet? You and Mr. Dawson? Best thing I e",
      "dialogue_count": 0,
      "word_count": 1658
    },
    {
      "scene_number": 13,
      "slugline": "INT. COCKPIT, SPITFIRE 1 - DAY Farriers hears his engine skip a beat, puts his gloved finger on the reserve tank toggle switch, listening... His engine evens out again. He puts his hand back on the stick, focusing on the German planes... He throttles up, speeding into the fray, climbing... CUT TO: INT. HOLD, GROUNDED TRAWLER - DAY Dimly lit by a couple of small, dirty portholes. The soldiers lie around the hold. Sleeping or chatting. Alex is scrounging around the hold, finding nothing useful. ALEX (to Gibson) Poke your head out, see if the water comes in. Gibson shakes his head, pulling his arms tight around himself. Alex glares at him - ALEX (CONT’D) Talkative sod. Tommy gets up, climbs up to the door, cracks it. Crawls up into the well - peeks over the rail - The boat is in inches of water. TOMMY Bugger. Barely come in at all. ALEX For fuck’s sake. HIGHLANDER 3 Calm down. What goes out comes back in, right? ALEX Yeah, but how long? Silence answers this. Clearly no sailors aboard. CUT TO:  48.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 183
    },
    {
      "scene_number": 14,
      "slugline": "EXT. MOONSTONE, ENGLISH CHANNEL - DAY The Moonstone pushes through the swell, full speed, diesel engine straining... Peter watches the smoke-trailing Spitfire fly lower and lower... PETER No parachute... Mr. Dawson is watching the plane like a hawk, steering around the waves by instinct... INT. COCKPIT, SPITFIRE 2 - CONTINUOUS The water flashes by blindingly fast... Collins pulls back on the stick, raising the nose as the plane - Hits the water with a jolt and a tearing sound. Collins trashed against his belts, forward/back/left/right - Bang - EXT. MOONSTONE - CONTINUOUS Peter watches the Spitfire ‘land’ on the surface of the water - PETER He’s down. INT. COCKPIT, SPITFIRE 2 - CONTINUOUS With a shooosh, the plane is floating over the swell, like a sprinter hearing the gun. Collins releases his belts, starts inflating his life vest, pulls the catch on the canopy, yanking it back along its track. It jams... He thrusts his hand through the gap, struggling... From outside it looks like he is waving... He looks up to see Farrier’s Spitfire shoot over, dipping a swing in salute... Collins sits in the gently bobbing plane, collecting himself as he watches the water start to rise around the slowly sinking plane. Collins tries the canopy again -  49.",
      "characters": [],
      "action_text": "Jammed. He is trapped in the sinking plane... CUT TO: INT. COCKPIT, SPITFIRE 1 - DAY Farrier levels off, looking down at the Heinkel approaching - It has a single fighter escort - an ME 109 off the port wing... CUT TO: INT. HOLD, GROUNDED TRAWLER - DAY Tommy jolts awake - there are steps outside. He moves up to the door. Highlander 1 gets his rifle, moves in front of the door. Aims. Nods at Tommy... Tommy throws open the door. A Seaman stands there - SEAMAN Nee, nee! Highlander 1 is confused. Tommy grabs the Seaman, pulling him down into the hold. Highlander 1 holds his gun on him - ALEX Kraut? The Seaman looks uncomprehendingly up at Alex - ALEX (CONT’D) Are you German?! SEAMAN Dutch! Dutch! Merchant navy. Here to pick you up. To help you. They sit him up. ALEX Why’d you leave your boat? SEAMAN In case German come. We wait up the beach with the soldiers. Wait for the tide.  50. HIGHLANDER 2 You came back, the tide must be in. SEAMAN Coming, yes. But more hours till we float. ALEX Hours?! Why’d you come back? The Seaman gestures around the packet hold - SEAMAN Not so heavy when I left! Alex and the others take this in. A gunshot penetrates the hull - everybody lies flat, Tommy stares at the bullet hole, which lets in light... CUT TO: EXT. MOONSTONE, ENGLISH CHANNEL - DAY Mr. Dawson pushes the boat towards where the plane went down. PETER There was no ‘chute, dad... Mr. Dawson ignores him. The engine is screaming... PETER (CONT’D) Dad, there was no ‘chute. He’s probably dead - MR. DAWSON (snaps) Damn it, he might be alive!! Peter is shocked at his dad’s outburst. Mr. Dawson stares at where the plane went down... CUT TO: INT. COCKPIT, SPITFIRE 1 - DAY Farrier lines up for his attack... Sighting the Heinkel as it commits to its bombing run over the destroyer, Farrier pushes forward on his stick, going into his dive... CUT TO:  51.",
      "dialogue_count": 0,
      "word_count": 555
    },
    {
      "scene_number": 15,
      "slugline": "INT. HOLD, GROUNDED TRAWLER - DAY Everybody stares at the bullet hole, not making a sound... Another shot punches a hole two feet from the first - Highlanders near the holes ease away, squeezing up against the other soldiers... BANG! A third shot, directly above the first... Two Highlanders grab their rifles, going for the stairs - TOMMY No! Then they’ll know we’re in here. HIGHLANDER 1 Why else are they shooting at us?! TOMMY Look at the grouping... Everybody looks at the three bullet holes. TOMMY (CONT’D) Target practice. BANG! A fourth hole, near the others... CUT TO: EXT. MOONSTONE, ENGLISH CHANNEL - DAY The Moonstone is getting closer to the Spitfire bobbing on the waves. Close enough to see that it is sinking... MR. DAWSON Peter, go forward with the boat hook. INT. COCKPIT, SPITFIRE 2 - CONTINUOUS Collins smashes the canopy back and forth on its track... Jammed, jammed, jammed. Water starts pouring in, streaming through the gap in the half-open canopy. He shuts it... Trapped... Opens it, yanking, water pouring in...  52.",
      "characters": [],
      "action_text": "Collins searches around looking for inspiration, for an implement, for anything - Water rising past his ankles... his calves... CUT TO: INT. COCKPIT, SPITFIRE 1 - DAY Farrier dives, plummeting towards the Heinkel... He glances across at the 109, which suddenly banks towards him, clearly reacting to Farrier’s attack... INT. HOLD, GROUNDED TRAWLER - DAY As the men stare at the bullet holes, water starts slopping through the lowest ones... A Highlander goes to plug the holes. BANG! The Highlander screams, clutching his face. His comrades pull him back, trying to smother his cries... The water pours in steadily through the lowest holes. Alex points at the target zone - ALEX We have to plug it! HIGHLANDER 1 After you, mate! They stay back from the holes, wary. Watching the water pour in... CUT TO: INT. COCKPIT, SPITFIRE 2 - DAY Collins pulls the steel flare gun from its holder. Water is coming up over his legs now... he smashes the flare gun into the canopy, again and again... CUT TO: INT. COCKPIT, SPITFIRE 1 - DAY Farrier fires at the Heinkel. Tracers zipping at the bomber. The 109 rises at him, guns blazing. Farrier rolls away, trying to dodge the fire -  53.",
      "dialogue_count": 0,
      "word_count": 381
    },
    {
      "scene_number": 16,
      "slugline": "EXT. SKY ABOVE DUNKIRK HARBOUR - DAY As Spitfire 1 rolls way, the Heinkel releases its load - bombs falling around the destroyer - CUT TO: INT. HOLD, GROUNDED TRAWLER - DAY A burst of machine guns fire opens a new group of holes beside the first - Alex watches the water spraying in. He turns to the Dutch Seaman - ALEX How do we get off?! Do we need to ditch some ballast?! The Dutch Seaman looks at him, uncomprehending - ALEX (CONT’D) Weight! Do we need to lose weight! The Dutch Seaman shrugs. SEAMAN Weight, yes. Alex turns to face the group - ALEX Somebody needs to get off. HIGHLANDER 1 Well volunteered. ALEX We don’t need a volunteer. I know someone who ought to get off... Alex turns to Tommy and Gibson. Points at Gibson. ALEX (CONT’D) This one. He’s a German spy. TOMMY Don’t be daft. Alex stares Gibson down...  54.",
      "characters": [],
      "action_text": "ALEX He’s bloody Jerry. You might not’ve noticed that he hasn’t said a word, but I have. He doesn’t speak English - or if he does it’s with an accent thicker than sauerkraut sauce - TOMMY You’re daft. Tell him. Gibson just stares at Alex... ALEX Yeah, tell me. Nothing. Just the sound of water spraying in hard, jetting in through the bottom holes... CUT TO: INT. COCKPIT, SPITFIRE 2 - DAY Collins smacks the canopy. The flare gun bounces off. He drops the flare gun, scrambles to find it under the water. The water is rising up his chest... CUT TO: INT. COCKPIT, SPITFIRE 1 - DAY Farrier cuts right, dodging away from the 109 - Banking hard, he gets a clear look at the destroyer weathering the explosions. A plume of water right next to the destroyer comes so high he flies through the top of its spray. CUT TO: INT. HOLD, GROUNDED TRAWLER - DAY Alex turns to Highlander 1, holds out his hand for his gun. Highlander 1 hands it over. Alex moves to Gibson, pointing the rifle, hooks the barrel on Gibson’s tags, pulling them closer to read - ALEX Tell me... Gibson!  55. Tommy looks at Gibson, panicking - TOMMY Tell him, for God’s sake! Alex pushes the rifle against Gibson’s cheek. Gibson cracks - GIBSON FRANÇAIS! JE SUIS FRANÇAIS! Tommy stares, shocked. Alex moves back slightly, taking this in. A burst of machine-gun fire. Everyone ducks from ricochets. ALEX A Frog. A bloody Frog. A cowardly little queue-jumping Frog... With the end of his rifle Alex shakes Gibson’s tags - ALEX (CONT’D) Who’s Gibson, eh? A naked dead Englishman lying out on that sand. Or did you at least have the decency to bury him? “Gibson” just stares. TOMMY He did. I helped him. I thought it was his mate. ALEX Maybe he killed him - TOMMY He didn’t kill him - ALEX How do we know?! TOMMY How hard is it to find a dead Englishman on Dunkirk beach, for God’s sake?! He didn’t kill anyone - he was looking for a way off the damned sand like the rest of us! The water is spraying in from more and more holes as the water",
      "dialogue_count": 0,
      "word_count": 1244
    },
    {
      "scene_number": 17,
      "slugline": "EXT. TRAWLER - CONTINUOUS Alex pokes his head out as the Seaman is sneaking up to see where they are headed - The Dutch Seaman turns the wheel, jumps back onto the floor of the well as bullets impact the cabin. He throws the engine into forward gear, turns to Alex - DUTCH SEAMAN THE HOLES! PLUG THE HOLES! Alex crawls back downstairs - INT. HOLD, TRAWLER - CONTINUOUS Alex falls down the stairs - ALEX PLUG THE HOLES! PLUG THE HOLES! The men stuff rags, bolts, fingers, anything they can lay hands on to plug as many holes as possible... CUT TO: INT. CABIN, MOONSTONE - MOMENTS LATER Collins, drying himself with a blanket, looks down at George, whose breathing is shallow, sightless eyes open. COLLINS (to Peter) I don’t really know, son. You were right not to move him. (reassuring) You’ve done the best for him you can. EXT. MOONSTONE, WATER OUTSIDE DUNKIRK HARBOUR - CONTINUOUS The Shivering Soldier watches Collins come out on deck - SHIVERING SOLDIER Is he alright? PETER (O.S.) No. Peter is glaring at the Shivering Soldier.  61.",
      "characters": [],
      "action_text": "PETER (CONT’D) No, he’s not - BOOM! Collins follows Mr. Dawson’s gaze to a destroyer up ahead being bombed by a Heinkel, huge plumes of water rising just beside her. The Shivering Soldier retreats into himself. Peter runs up to the bow - A blue fishing trawler a quarter of a mile off, sinking... PETER (CONT’D) Dad, there’s men in the water! Mr. Dawson looks ahead to where Peter is pointing. He puts the throttle forward, heading into the fray... Collins spots Spitfire 1 arcing around, trying to get a bead on the Heinkel... COLLINS Come on, Farrier... CUT TO: INT. COCKPIT, SPITFIRE 1 - DAY Farrier pulls on the stick, lining up behind a 109... He fires, chasing down the plane, firing again... Smoke from the German plane, which starts to drop... Farrier is in a heavy dive, when his engine chokes. Farrier’s hand darts forward, switching to his reserve tank before the engine can die... The engine catches again. Farrier pulls out of the dive... CUT TO: EXT. THE MOLE - DAY Through the binoculars Colonel Winnant watches the blue trawler pushing out to the sea, low in the water... Commander Bolton watches a destroyer, under full steam, heading out to the Channel... Where there are shapes of boats on the horizon...  62.",
      "dialogue_count": 0,
      "word_count": 400
    },
    {
      "scene_number": 18,
      "slugline": "EXT. DECK OF TRAWLER - CONTINUOUS The Dutch Seaman aims the boat at a destroyer out at the mouth of the harbour... EXT. HOLD, TRAWLER - DAY Tommy, Gibson, Alex, Highlander 1 and the others stuff the holes as best they can. The makeshift plugs pop out every few seconds - the soldiers scrabble under water to find them and stuff them back in, hands pressed against water jets, spray coming in everywhere... EXT. THE MOLE - CONTINUOUS Omitted.* * In previous drafts of the script, this is the point at which Bolton and Winnant first see the Little Ships. Ultimately in the cutting room, they returned the entrance of the Little Ships to this location in the film. EXT. DECK OF TRAWLER - CONTINUOUS The Dutch Seaman looks over the rail, concerned, to see how fast his boat is lowering into the swell... CUT TO: EXT. MOONSTONE, WATER OUTSIDE DUNKIRK HARBOUR - DAY Collins watches Farrier spin around to get after the Heinkel. The Moonstone comes up on the men in the water. Collins comes to the side, to help Peter fish men out, notices the surface of the water - COLLINS (to Mr. Dawson) Oil. We’re getting into oil! Mr. Dawson puts the screw into reverse, stopping the boat. They fish men out of the water - the men covered in oil, anonymous in their glossy black filth... CUT TO:  63.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 234
    },
    {
      "scene_number": 19,
      "slugline": "INT. COCKPIT, SPITFIRE 1 - DAY Farrier chases down the Heinkel, closing in as its top turret opens up on him, tracer fire lighting up all around him - He dives down under the range of the rear turret, then angles up, firing at the bomber’s tail... CUT TO: EXT. BLUE TRAWLER - DAY The Dutch Seaman sees water sloshing over the deck. DUTCH SEAMAN ABANDON SHIP! ABANDON SHIP! INT. HOLD, TRAWLER - CONTINUOUS The soldiers, holding back the water, cannot hear him... One by one they start to abandon the task. More and more water pouring in... Alex and Gibson are last -   Alex turns, sees they are alone, grabs Gibson by the shoulder then jumps for the exit. Gibson, still holding back the water, notices too late - EXT. BLUE TRAWLER 0 C Tommy gets on deck, sees the Keith, a quarter of a mile away. He dives into the water, pulling away from the swamped trawler - All the men dive off the sinking boat, swimming for the Keith. INT. HOLD, TRAWLER - CONTINUOUS Gibson dives for the exit. He is blasted back by water, dragged down with the sinking trawler... CUT TO: EXT. MOONSTONE, WATER OUTSIDE DUNKIRK HARBOUR - DAY Peter, Collins and the first oil-covered men pull more oily men from the water, the decks of the yacht rapidly filling. Mt. Dawson looks at the oil slick, concerned. He addresses the oily survivors -  64.",
      "characters": [],
      "action_text": "MR. DAWSON Below deck. OILY SURVIVOR No fear. MR. DAWSON We need to get as many of you on board as we can before the oil catches fire. Get below or get off my boat - your choice. The oily survivors head below decks. Peter runs back to the companionway to shout down - PETER Careful there! INT. CABIN, MOONSTONE - CONTINUOUS Peter pokes his head down, sees two oily survivors moving George from the bottom of the steps = PETER Careful! The oily survivors look up at him. Alex is one of them - ALEX (quiet) He’s dead, mate. Peter takes this in... PETER So be bloody careful with him! EXT. THE MOLE - CONTINUOUS Commander Bolton stares at the shapes in the distance... He grabs the field glasses from Colonel Winnant, puts them to his eyes - Boats. Civilian boats. All shapes and sizes. An armada. Colonel Winnant peers over Commander Bolton’s shoulder... COLONEL WINNANT What can you see? Commander Bolton slowly lowers the glasses.  65. COMMANDER BOLTON (gentle) Home. Colonel Winnant grabs the glasses, confused... EXT. DECK OF DESTROYER - CONTINUOUS The soldiers peer over the railing at the absurd collection of vessels passing them in the opposite direction: Yacht, paddle steamers, fishing trawlers, day sailors, ferries, dredgers, dinghies, row boats... Crewed by: Fisherman, merchant navy sailors, naval officers, civilian crew, naval crew, nurses, retired sailors... The exhausted soldiers lining the decks of the Basilisk start to clap, then to cheer... Some are crying... EXT. MOONSTONE, WATER OUTSIDE DUNKIRK HARBOUR - CONTINUOUS Peter steps out of the cabin, reeling. Meets his dad’s questioning glance with unmistakable shock - SHIVERING SOLDIER (O.S.) The lad... Peter turns. The Shivering Soldier is looking up at him with terrified eyes, blanket tight around his shoulders. SHIVERING SOLDIER (O.S.) (CONT’D) Will he be okay? Peter looks at the Shivering Soldier. Sees the white knuckles clasping the edge of the rough blanket. Peter nods. The Shivering Soldier turns, staring out at th",
      "dialogue_count": 0,
      "word_count": 604
    },
    {
      "scene_number": 20,
      "slugline": "INT. COCKPIT, SPITFIRE 1 - DAY Farrier strafes the Heinkel - no apparent effect. Zipping over it, he dives down out of range of its turret, banks hard left to line up another shot. A 109 cuts across him, Tracer fire shooting past. CUT TO: EXT. WATER, JUST OUTSIDE DUNKIRK HARBOUR - DAY Tommy swims for the Keith... He hears an airplane... looks up to see a Heinkel coming in over the Keith... The bombs drop, plumes of water shoot upwards all around the ship. Tommy dives under the water for protection. The explosions are deafening - he holds his ears with his hands - Tommy breaks the surface. The barrage is over, the Keith is still afloat. Tommy swims for it. Getting closer, Tommy realizes he’s swimming oil, the black sludge covering his head and arms. He looks back - the blue trawler is gently slipping beneath the water... Tommy makes for the Keith, even as he sees men jumping into the water from her decks, lifeboats being lowered... Tommy spots another craft - a yacht heading towards them. Tommy pulls for the yacht as hard as he can... CUT TO: EXT. BEACH AT MALO LES BAINS - CONTINUOUS The rag-tag collection of small ships works the beach, picking men up in the shallows, ferrying them out to bigger ships... Small open boats use the truck ‘pier’ to load men as the Engineer looks on with pride... EXT. MOONSTONE, WATER OUTSIDE DUNKIRK HARBOUR - DAY The Moonstone is filled with oil-covered men, throughout the hold and across the decks - many more still in the water. The Keith lists, men jump off the far side, away from the oil slick, where small ships are gathering to pick them up...  67.",
      "characters": [],
      "action_text": "Collins moves up the side, watching Farrier bank hard to get behind the Heinkel. A 109 zips across his path, guns blazing... Collins looks down at the oil-covered water... INT. COCKPIT, SPITFIRE 1 - CONTINUOUS Farrier pulls around, hard. The Heinkel is in front of him, side on, heading in for another run at the Keith. Farrier banks and pulls up to keep the bomber in his sights as he fires his cannons - The Heinkel catches fire and starts falling... EXT. MOONSTONE, WATER OUTSIDE DUNKIRK HARBOUR - CONTINUOUS Collins sees the heinkel catch fire - turns to Mr. Dawson. COLLINS GO! GO! GO! Mr. Dawson throws the engine into gear, turns the wheel - The Heinkel falls flaming towards the oil slick... Peter has hold of one last oil-covered survivor, who hangs on for dear life as the boat drags him through the oily water - The men left in the water shout with despair as the Moonstone motors away - The flaming Heinkel hits the water - explodes - The surface of the water catches fire, spreading across the water. Men duck underwater to escape the flames. Underwater: Highlander 1 pushes down under, looking up at the fire. The surface is aflame as far as he can see... Peter holds on to the oil-covered soldier - Who is now being washed with cleaner water as they come out of the slick. As the oil comes off his face we see that it is Tommy... Collins watches, appalled, as the men in the water are engulfed by relentless flames... The Keith is going down - survivors on the far side are picked up by the various small ships...  68. Under the water, Highlander 1’s air runs out. The flames rage above... His instinct to breath pushes him up into the flames where he is engulfed, screaming, dying - Tommy lies on the deck at Peter’s feet, eyes closed... TOMMY (a whisper) Take me home. CUT TO: INT. COCKPIT, SPITFIRE 1 - DAY Farrier sees the Heinkel explode, turns away towards the beaches... He looks down at - The thousands of men on the beach. The small ships ferrying out to the larger vessels. T",
      "dialogue_count": 0,
      "word_count": 1106
    },
    {
      "scene_number": 21,
      "slugline": "INT. COCKPIT, SPITFIRE 1 - CONTINUOUS Farrier darts past the Stuka, gliding, guns blazing... EXT. THE MOLE - CONTINUOUS The Stuka never fires, it just smashes into the sea... The soldiers all along the mole cheer. INT. COCKPIT, SPITFIRE 1 - CONTINUOUS Farrier watches the Stuka disintegrate on the surface of the water. He nods... feeling the unaccustomed silence... CUT TO: EXT. MOONSTONE, ENGLISH CHANNEL - EVENING Mr. Dawson stares at the approaching 109. Peter glances back and forth between the 109 and his father... MR. DAWSON Wait for it... wait till he’s committed to his line... The nose of the 109 dips down - MR. DAWSON (CONT’D) NOW! Peter throws the wheel, the Moonstone lurches to port - The guns on the 109 light up, strafing the water to starboard - The 109 flashes over... Collins watches it recede. COLLINS He’s off. MR. DAWSON Bigger fish to fry. Collins looks at Mr. Dawson. Curious. COLLINS How’d you know all that, anyway? Mr. Dawson steps onto the deck.  72.",
      "characters": [],
      "action_text": "MR. DAWSON My son’s one of you lot. I knew he’d see us through. Mr. Dawson moves forward. Collins steps up beside Peter. COLLINS You’re RAF? MR. DAWSON Not me. My brother. Flew Hurricanes. He died third week into the war. Collins looks forward at the proud father standing by the mast. CUT TO: INT. COCKPIT, SPITFIRE 1 - DAY Farrier sits in the silence, gliding... looking to see how far he might make it up the beach... CUT TO: INT. CABIN, MOONSTONE - EVENING Tommy gets to his feet, steps over other men as he slips over to the stairs... EXT. MOONSTONE, ENGLISH CHANNEL - EVENING Tommy and Alex poke their heads out - PETER Stay below, please. TOMMY We just want to see the cliffs - Tommy looks over at white cliffs, ghostly above the dark water. TOMMY (CONT’D) Dover? Peter shakes his head, amused. PETER Weymouth.  73. Alex shakes his head, sadly. ALEX We let you all down, didn’t we? Peter just looks at this exhausted, ragged boy his own age. CUT TO: INT. COCKPIT, SPITFIRE 1 - DAY Farrier glides, banking, looking for a suitable stretch of beach to ditch... In the strangely silent plane, he passes over the troops, lines up on the vast stretch of sand beyond Malo Les Bains... CUT TO: EXT. HARBOUR AT WEYMOUTH - NIGHT Soldier after soldier climbs out of the yacht. The Corporal handing out travel chits marvels at the absurd amount... CORPORAL How many you got in there? The Shivering Soldier is taken ashore, wrapped in blankets. Tommy and Alex stick together as they are handed hot cups of tea and shepherded out of the harbour in long lines. Peter supervises as George’s body is taken ashore. As Collins steps off the boat a soldier from another boat spots his RAF uniform - SOLDIER (furious) Where the hell were you! Collins just stands there. He feels a hand on his shoulder. It is Mr. Dawson. He indicates the men filing off the Moonstone - MR. DAWSON They know here you were. Mr. Dawson puts his hat on. To go home.  74.",
      "dialogue_count": 0,
      "word_count": 523
    },
    {
      "scene_number": 22,
      "slugline": "EXT. WEYMOUTH RAIL YARD - NIGHT Tommy and Alex, exhausted, downcast, are herded across the tracks towards a train. Before getting on they are handed a blanket and cup of tea by an Elderly Man, who looks at their hands, not their faces, as he hands the rough blankets over - ELDERLY MAN Well done, lads... well done, lads... ALEX All we did is survive. ELDERLY MAN That’s enough. Well, done, lads, well done, lads... Alex steps up onto the train. The Elderly Man reaches out to Tommy, touching his face - clearly blind. INT. TRAIN - CONTINUOUS Tommy flops down, lying across the seat. Alex is slumped opposite, tears starting to roll down his cheeks. ALEX That old bloke wouldn’t even look us in the eye. No response. He looks over. Tommy is already asleep. CUT TO: EXT. THE MOLE - EVENING The mole is empty but for bodies. A Private opens his eyes. He sits up, alone on the deserted mole, his comrades gone, mistaken for dead... COMMANDER BOLTON (O.S.) Come on, then, Private... The Private looks down at the water to see Commander Bolton standing in a launch full of army officers. COMMANDER BOLTON (CONT’D) I know we’re officers, but it’s us or the enemy, so now’s not the time to be particular...  75.",
      "characters": [],
      "action_text": "The Private scrambles down into the launch, where Colonel Winnant stands talking to Commander Bolton. They look out at the vast deserted beach, littered with corpses and abandoned equipment... COLONEL WINNANT (to Commander Bolton) Churchill got his thirty thousand. COMMANDER BOLTON And then some. Almost three hundred thousand. So far. Commander Bolton steps back up onto the mole. COLONEL WINNANT So far? COMMANDER BOLTON I’m staying. (off look) For the French. The launch pulls away from Commander Bolton on the mole. CUT TO: INT. TRAIN - MORNING Sunlight flickering on Tommy’s eyelids wakes him. We have the sense that he has been asleep for a very long time. The train full of soldiers rolls to a halt. Alex opens the window, spots a Boy near the tracks - ALEX Hey! Where are we?! BOY Siding. You’ll put in in a minute - ALEX What station? BOY (surprised) Woking. Alex spots stacks of newspapers waiting to be loaded. ALEX Grab me one of them papers.  76. The Boy hesitates. ALEX (CONT’D) Go on! The Boy pulls the paper off the top and stretches up to hand it to Alex. Alex slumps into his seat. The headline: CHURCHILL ADDRESSES DUNKIRK EVACUATION IN COMMONS Alex thrusts the paper at Tommy. ALEX (CONT’D) I can’t bear it. You read it. TOMMY Can’t bear it? ALEX They’ll be spitting at us in the streets. If they’re not locked up waiting for the invasion. CUT TO: EXT. WEYMOUTH TOWN - DAY Peter walks down the deserted high street. He stops. Walks into the office of the local paper, the Herald... INT. HERALD OFFICE - CONTINUOUS Peter hands the Editor a photograph. Of George. CUT TO: INT. COCKPIT, SPITFIRE 1 - CONTINUOUS Farrier checks his canopy is locked, stows loose items, pumping the handle all the while... EXT. SPITFIRE 1 - DAY The landing gear inches out of its housing... CUT TO:  77.",
      "dialogue_count": 0,
      "word_count": 534
    },
    {
      "scene_number": 23,
      "slugline": "INT. TRAIN - DAY Tommy looks down at the paper. Starts to read. Poorly. TOMMY “Wars are not won by evacuations.” Alex shakes his head at this. The train starts to pull into the station... The platforms is crowded with civilians. Alex slinks down into his seat, turning away from the window... A Civilian bangs on the glass, peering in... ALEX I can’t look, TOMMY “But there was a victory inside this deliverance which should be noted...” Alex turns. The Civilian grins, holding up two beer bottles. The platform is packed with cheering and waving civilians... Women with sandwiches and drinks rush up to the windows... TOMMY (CONT’D) “Our thankfulness at the escape of our army -” Alex opens the window , grabbing food and drink as Tommy continues to read... TOMMY (CONT’D) “- Must not blind us to the fact that what has happened in France... is a colossal military disaster...” INT. COCKPIT, SPITFIRE 1 - DAY Farrier pumps the handle - EXT. SPITFIRE - CONTINUOUS The landing gear inches past halfway down...  78.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 176
    },
    {
      "scene_number": 24,
      "slugline": "INT. COCKPIT, SPITFIRE 1 - CONTINUOUS Pumping the handle, Farrier checks his belts - TOMMY (V.O.) “And we must expect another blow to be struck almost immediately...” Farrier holds the plane steady   in its descent towards the sands... EXT. BEACH AT LA PANNE - CONTINUOUS Spitfire 1 swoops onto the flat sand, wheels down. TOMMY (V.O.) “We shall go on to the end, we shall fight in France...” Farrier slides back the canopy and climbs out of the plan... INT. MR. DAWSON’S HOME - DAY Peter, gets up from the kitchen. Mrs. Dawson is at the stove, her back to us. As Peter grabs his coat he runs into Mr. Dawson, letters in hand, looking at the Herald. He hands it to Peter... TOMMY (V.O.) “We shall fight on the seas and oceans...” The small headline: LOCAL BOY, GEORGE MILLS, JUST 17, HERO AT DUNKIRK Peter looks at his father. Nods with satisfaction. EXT. BEACH AT LA PANNE - DAY Farrier brushes sand from the wing of his beloved Spitfire... TOMMY (V.O.) “We shall fight with growing confidence and growing strength in the air...” Farrier pulls his flare gun... He shoots into the cockpit...  79.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 196
    },
    {
      "scene_number": 25,
      "slugline": "INT. TRAIN - DAY Alex hangs out of the window, guzzling from a beer bottle, grinning at the women outside... TOMMY “We shall defend our island...” Alex turns, deliriously happy, beer running down his chin - ALEX What?! TOMMY (louder, over the celebration) “We shall defend our island, whatever the cost may be - we shall fight on the beaches, we shall fight on the landing grounds...” EXT. DUNKIRK HARBOUR - EVENING Bodies gently bob in the water... TOMMY (V.O.) “We shall fight in the fields and the streets...” Abandoned trucks and anti-aircraft guns, piles of boots, stacks of rifles catch the last light... TOMMY (V.O.) “We shall fight in the hills; we shall never surrender...” Bodies line the length of the mole... TOMMY (V.O.) ‘And even if, which I do not for a moment believe, this island... were subjugated and starving...” EXT. BEACH AT LA PANNE - CONTINUOUS Farrier kneels, hands on head, as dark shapes of German soldiers (seen only from behind) surround him...  80.",
      "characters": [],
      "action_text": "TOMMY (V.O.) “Then our empire beyond the seas, armed and guarded by the British fleet, would carry on the struggle...” Farrier is led away from the burning plane... INT. TRAIN - DAY Alex is oblivious. Tommy continues, to himself... TOMMY “Until, in God’s good time...” EXT. BEACH AT LA PANNE - CONTINUOUS Moving towards the burning Spitfire... TOMMY (V.O.) “The New World, with all its power and might -” The shape of the plane is still visible beneath the flames... TOMMY (V.O.) “- Steps forth to the rescue and the liberation of the old”. Move in on the burning Spitfire until the flames fill the frame and we - CUT TO BLACK: Credits. End.  81.",
      "dialogue_count": 0,
      "word_count": 283
    }
  ]
}