{
  "slug": "eddie-the-eagle-2016",
  "title": "eddie the eagle",
  "genre": "action",
  "format": "film",
  "scenes_count": 22,
  "characters_count": 0,
  "characters": [],
  "total_words": 22628,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. BATHROOM - NIGHT  At the bottom of a 1970s avocado bath, a bathplug chain drifts from side to side in the soapy water. EDDIE (VO) Every great athlete is born with a natural talent. Arnold Palmer, Jimmy Connors, Muhammad Ali, the illustrious Brazilian Pele... A boy's hand appears holding a waterproof plastic watch. The seconds tick by as bubbles begin to stream upwards. EDDIE (VO) (CONT’D) Every sporting legend you can mention — naturally gifted from birth. Ten-year-old Eddie Edwards bursts to the surface, purple faced and gasping for air. EDDIE (VO) (CONT’D) And I was no exception.  INT. HALLWAY - DAY  Little Eddie, hair still wet, carries his Gola kitbag to the front door. He is a stocky kid with a determined jaw. EDDIE (VO) A week after my tenth birthday I equalled the Cheltenham Junior Swimming League record for holding my breath underwater. He stands on tiptoes, straining for the lock. EDDIE (VO) (CONT’D) That meant I was ready to compete at the highest level. A woman in a nightgown appears — Eddie’s mother JANETTE. She’s a large, jolly woman in a muumuu and brown tinted glasses, equal parts warmth and anxiety. JANETTE And where d'you think you're going, young man?",
      "characters": [],
      "action_text": "EDDIE Rome. I'm going to hold my breath in the Olympics and win a gold medal. She regards him thoughtfully, then goes and rummages in the hall closet. Among the coats and umbrellas is a pair of National Health KNEE CALIPERS. Eddie looks at them darkly until she emerges holding out an empty Jaffa Cakes biscuit tin. JANETTE Well, you’d better take this for your medals then, hadn't you. Eddie tucks the tin under his arm, relieved. “Good thinking. JANETTE (CONT’D) And make sure you pack your hankie.  EXT. STREET - NIGHT  Eddie walks along the damp pavement. It’s a neglected working- class neighborhood, all stray dogs and misspelled graffiti. EDDIE (VO) I soon found out there wasn't an Olympic event for holding your breath. He studies the time-table at a bus stop. EDDIE (VO) (CONT’D) And there wasn't a bus to Rome from the end of our street. (rain drizzles down) And Mum was absolutely right. He wipes a sleeve over his runny nose. EDDIE (VO) (CONT’D) I should have packed my hankie.  INT. KITCHEN - NIGHT  Eddie toys with a consoling cup of cocoa, poring over his treasured 1972 Olympics photo album —   Moments of Glory . 2. EDDIE (VO) But I didn't care. I knew I was going to be a part of it someday. He studies the Kodachrome images enrapt — Jesse Owens, Olgar Korbut, Mark Spitz — triumphant medal winners cheered and chaired aloft. JANETTE Alright, pet. Time for bed. She removes his cup, revealing Eddie's handiwork: five chocolate rings on the plastic tablecloth — the Olympic logo. EDDIE (VO) The first step was finding the right sport.  EXT. PLAYGROUND - DAY  Eddie swings a battered old cricket bat at an incoming ball and misses completely. EDDIE (VO) Something that played to my strengths. He swings again with the same result. And again. And again, long into the night.  EXT. STREET - NIGHT  EDDIE (VO) I knew there'd be technical difficulties, and a fair bit of soul-searching. Eddie trudges home, dragging his kitbag behind him. EDDIE (VO) (CONT’D) Every great sportsman has to",
      "dialogue_count": 0,
      "word_count": 760
    },
    {
      "scene_number": 2,
      "slugline": "INT. BEDROOM - DAY  Eddie drops his broken glasses into the biscuit tin.  EXT. SCHOOL RUGBY FIELD - DAY  EDDIE (VO) Like making sure you pick the right size ball for your physical type. Eddie in ill-fitting shirt and shorts, chases a bobbling rugby ball, trying to scoop it up without success until the opposing team flattens him.  INT. EDDIE’S BEDROOM - NIGHT  Another pair of broken glasses drops into the tin. EDDIE (VO) And choosing the best terrain for your endurance capabilities.  INT. SWIMMING-POOL - DAY  A starting pistol sends Eddie and his classmates into the freezing water. They all emerge and swim off except for you know who. EDDIE (VO) Let’s just say it was a process of trial and error.  INT. BEDROOM - DAY  We move down Eddie’s effortfully handwritten list of sports: cricket, football, swimming, hurdles, boxing... All crossed out except for the last one — cycling.  EXT. STREET - DAY  Eddie peddles furiously on his trusty Raleigh Chopper — picking up speed towards a home-made jumping ramp. The local kids watch as he flies into the air — so high that he clears the long line of milk crates. He lands safely with a triumphant WHOOP only to discover that he hasn’t left enough room to stop. 5.",
      "characters": [],
      "action_text": "EDDIE Shhhhhhhhhhhiiii— He SLAMS into a neighbor’s wall and FLIPS over the hedge with a CRASH of glass and a sickening THUD. EDDIE (VO) (CONT’D) It was not what you’d call a textbook landing, but I couldn’t have been happier. The local kids wince as they find Eddie writhing amid the remains of a smashed green house. EDDIE (VO) (CONT’D) I was on my way. Part of the big show, admired and appreciated for who I was. Eddie is helped to his feet, badly cut and covered with broken plants. LOCAL KID Fucking maniac!  INT. BEDROOM - DUSK  EDDIE (VO) And then came the bombshell. Eddie lies on his bed reading   Moments of Glory,   like he does every night. A boy alone under his Evel Knievel poster. TERRY (OS) Eddie! Get down here now!  INT. KITCHEN - DUSK  Janette and Terry sit at the Formica table, bewildered and exasperated at this crazy son of theirs covered in scratches and cuts. TERRY Enough’s enough. You're spending your holidays with me down at the site. It’s time you learn the plastering trade. Eddie digests this like a death sentence, knee bouncing up and down. 6. EDDIE What about my Olympic preparations? Terry says nothing. Just picks off some debris from Eddie’s sweater. Eddie looks to Mum. But she has to agree with Dad. JANETTE You never know, pet, you might like it.  EXT. HILL TOP - NIGHT  Eddie sits with his bike, gazing out over the lights of Cheltenham below. EDDIE (VO) So that was the sporting career of Eddie Edwards. Down below him is a dirty noisy building site — his future. EDDIE (VO) (CONT’D) Eleven different sports and nothing to show for it except twelve pairs of broken glasses. (I sat on my sixth pair in the library.) He scratches his knees absently as his defeated face slips into darkness. The crushing despair that only a 10-year-boy can feel. We hold. Long enough to feel this could be the end of our story... and it probably would be except for the blaze of white light that suddenly illuminates the sky. Eddie sits up annoyed, but then increasingly intri",
      "dialogue_count": 0,
      "word_count": 647
    },
    {
      "scene_number": 3,
      "slugline": "EXT. DRY SKI SLOPE - NIGHT  Eddie clambers over the wire fence and scrambles up the dirt slope, all pain forgotten as he steps into the glaring light. EDDIE Bloody ada. He is standing at the top of a HUGE floodlit ski slope. He steps out onto the plastic surface and feels the springy bristles under his feet. He’s awe-struck, like he’s stepping out for the first time onto the moon. His battered urchin features tremble with emotion as he’s swallowed up by the heavenly glare of the floodlights...  EXT. CALGARY OLYMPICS, DOWNHILL FINALS - DAY  The rousing theme tune from BBC’s Ski Sunday. Out of the whiteness comes an adult SKIER zig-zagging down a slalom course towards a finish line, snow spraying in his wake. A title card reads: \"12 years later.\" A crowd leaps to its feet, deafeningly loud. RON PICKERING (VO) ... This is amazing! This is sensational! Edwards is carving up the Calgary hillside like a Sunday roast. RON PICKERING, the BBC’s tubby, excitable voice of skiing, grabs his microphone as the skier crosses the finish line. RON PICKERING (CONT’D) Oh my word! He’s only gone and done it. The crowd swarms forward as ADULT EDDIE takes off his goggles. He’s in his 20s with a tan and cool bouffant hair. RON PICKERING (CONT’D) Get out the champagne because Great Britain has just taken its first ever gold in the men’s downhill. And this is the man responsible, “Fast” Eddie Edwards. The crowd lifts up Eddie with a cheer. 8.",
      "characters": [],
      "action_text": "RON PICKERING (CONT’D) The plasterer’s son from Cheltenham — now turned alpine champion and world-class — WOMAN’S VOICE Oh for gawd's sake. Get a wiggle on. Ron Pickering looks up confused. So does the crowd. Eddie drops backwards to the ground. WOMAN’S VOICE (CONT’D) Come on. Pick a lane.  INT. VAN - MOVING - DAY  A horn HONKS and Eddie snaps to. He is in the front seat being driven along by his MOTHER. A Charles and Di air- freshener swings from the rearview mirror. In reality, Eddie is a stocky bloke in his twenties with a large jaw, no tan and gingery close cropped hair. His jam-jar spectacles are held together by a Band-Aid. JANETTE Here we go, pet. His mother turns off past a sign: \"British Men's Downhill Ski Trials.\"  EXT. BOSA DOWNHILL SKI TRIALS - DAY  The crowd is modest but well-heeled. Barbour jackets, cravats, Hermès headscarves. They applaud politely as a skier crosses the finish line. Over in the sponsors’ enclosure, a throng of suited businessmen pay slightly more attention to the canapés and free champagne. A title card reads: \"England, September 1986.\"  EXT. BOSA PARKING FIELD - DAY  The Edwards family van noses its way between Range Rovers and Jaguars to find a parking spot. 9.",
      "dialogue_count": 0,
      "word_count": 466
    },
    {
      "scene_number": 4,
      "slugline": "INT. VAN - DAY  Janette and Eddie share a final glance. This is his big moment, even though they’re both trying to act like it isn’t. JANETTE Knock ‘em dead. He grabs his skis and races off to the check-in, oblivious as he clips a wing mirror. She watches him go, and we see the true depth of her anxiety at having a daredevil like Eddie for a child. She takes out her wool and needles. Starts to knit. Alone in the dirty cement covered van.  INT. CHANGING-ROOM - DAY  The room is full of Olympic class skiers, which means a hubbub of blokey posh accents. They’re in no hurry to acknowledge Eddie as he breezes in. He covers up his discomfort by humming to himself until finally, he finds a spare coat hook at the end. TARGET (VO) Great Britain has languished for too long on past glories - in business and in sports.  EXT. CORPORATE ENCLOSURE - DAY  The sponsors have gathered round a podium to hear DUSTIN TARGET’s address. He is the conscientious new broom head of BOSA with immaculate green blazer and name tag to prove it. TARGET But just as you have entered a new era of business, so we have embarked on a new era of sports — and it’s one that requires a new kind of athlete.  EXT. STARTING PLATFORM - DAY  Eddie shuffles forward, flapping his arms and making strange warm-up noises. EDDIE Edwards, E. Cheltenham Winter Sports Centre. 10.",
      "characters": [],
      "action_text": "The STARTING OFFICIAL directs Eddie to the start gate; a glance at Eddie's shoddy equipment.  EXT. CORPORATE ENCLOSURE - DAY  Target surveys the crowd to make sure his theme is resonating. TARGET And just as the world of business looks to sporting champions for inspiration, so we in turn can now look to you — our distinguished sponsors — for ways to make our athletes more competitive.  EXT. STARTING PLATFORM - DAY  TARGET (VO) You are not just successful competitors. You’re brand leaders — the best in your field. And you deserve the best in return. Eddie wipes the steam off his goggles and snaps them into place. They're pink.  EXT. CORPORATE ENCLOSURE - RESUME  Target leans forward, savoring his crowd-pleasing big finish. TARGET Ladies and gentlemen, today you’re going to see just that. The KLAXON rudely cuts the applause short.  EXT. BOSA DOWNHILL SLOPE - DAY  Eddie smashes down the plastic slope. He barely follows the \"line,\" which shows his best quality is suicidal bravery. Not much style, plenty of guts. One by one, the sponsors turn to watch. Eddie takes the corners too fast and too tight, slamming over slalom flags. He looks like he'll wipe out at any moment, but amazingly he hangs on. 11. Target's face tightens at this careening blot on his landscape, flailing into the last two turns. Suddenly the flaw in Eddie’s all-out approach becomes apparent. He simply fails to make one of the turns. He flies off the course, right through the sponsors’ enclosure, and SMASHES into one of the hoardings. Silence. The drip of toppled ice buckets. The dismayed stares of sponsors at the smashed billboard. \"I bet he drinks Carling Black Label.\" Target turns to his Aide. Beckons him over. Now.  EXT. BOSA DOWNHILL SLOPE - DAY  The Course Official escorts Eddie off the slope. EDDIE See that? I was pinging down the hill like a ferret. The Official can only watch as Eddie re-assembles his glasses, wired with excitement EDDIE (CONT’D) Forty-five seconds at the halfway line. If I'd go",
      "dialogue_count": 0,
      "word_count": 2393
    },
    {
      "scene_number": 5,
      "slugline": "EXT. GARMISCH - NIGHT  A title card reads: “Garmisch, Germany. Site of the 1936 Winter Olympics.” Eddie sits up excitedly. Peers out of the van he’s hitched a ride in. The music is coming from the Walkman he wears on all his travels.  EXT. GARMISCH JUMPS - NIGHT  Eddie hurries into the floodlit landing arena, still carrying his gear. The ascending row of ski-jump towers are lined above him. The 15m. The 40m. The 70m and above them on its own hill, the 90m jump. A huge iron monster. At the top, in silhouette, a JUMPER sets off down the ramp. Eddie moves closer as the Jumper shoots into the air, soaring through the sparkling snowflakes, seemingly forever until he lands and skids to a perfect stop. This is LARS MOBERG, the moustachioed superstar of the Swedish national squad. He rejoins a monastic huddle of ATHLETES and COACHES in yellow and blue jumpsuits. It is all very high-tech with video monitors and walkie- talkies. Eddie moves closer still and sees this isn’t just the national squad, it’s the Olympic squad. There it is, on all their gear like a lucky omen — the five- ring logo.  INT. GARMISCH DORM ROOM - DAWN  An LED alarm clock glows — 5.30am — in a tiny stuffy dormitory crammed with bunk-beds. Eddie creeps out with his gear, accidentally smacking a sleeping roommate with his ski-tip. GERMAN ROOMMATE  Hosenscheisser ! EDDIE Bless you. 22.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 241
    },
    {
      "scene_number": 6,
      "slugline": "EXT. GARMISCH 15M JUMP - DAWN  Eddie bypasses the baby jump and goes straight to the 15m jump, all alone except for a distant snow groomer chugging up the hill. He slots in his skis and sets off. Here it is, the moment of truth... He shoots off the ramp and PLOPS onto the slope, gliding easily to a stop. EDDIE What a doddle. He can’t believe his luck. It’s so easy. He turns to look at the next jump up — the 40m.  EXT. GARMISCH 40M JUMP - DAWN  At the top of the ramp, Eddie finds this jump has two grooves into which you slot your skis. He takes a breath and pushes off. This jump is significantly faster. He shoots into the air, WHOOPING with delight. For one magical second he is flying, high above the twinkling resort below. Then reality returns and he CRASHES into the icy slope, sliding to a halt face first.  EXT. GARMISCH SLOPE - DAY  A row of YOUNG SKIERS shuffle into line for FLORIAN from the front office. FLORIAN Class, I want you to meet your new instructor, Mr. Eddie. CLASS Good morning, Mr. Eddie. Eddie gives the kids a wave, acting all cool. EDDIE Eddie. Fast Eddie. Whatever you like. FLORIAN Mr. Eddie’s going be teaching you the three S’s of skiing —   smart, sensible, safe. 23.",
      "characters": [],
      "action_text": "Eddie, we now see, has a huge bandage on his nose. THE CLASS Practice their snowplows down the hill under Eddie’s supervision. EDDIE Okay, folks, nice practice postures. Now let's try it for real. Penguins to the left, polar bears to the right. Eddie’s concentration drifts enviously over to the Swedes on the 70m. Flying through the air. Making it look so easy. NASAL VOICE (VO) Room for one more?  INT. SAUNA - DAY  Eddie emerges from a cloud of steam, sporting sturdy swimming trunks and his huge nose plaster. Lars and the Swedish team begrudgingly shuffle up as Eddie plonks down on the bench. EDDIE  Effermidaggen ! Eddie Edwards, Great Britain. The Swedes just stare. Eddie presses on, undeterred. EDDIE (CONT’D) I'll get right down to business if I may. I've just started on the 40m and I’m making solid progress, but I'd really appreciate a few tips. A vicious HISS of steam reveals the forbidding Swedish Coach, ladling water on the rocks. Like all Swedes everywhere, given half a chance, he has no clothes on. SWEDISH COACH You have been jumping long? Eddie looks everywhere but at the coach’s genitalia. EDDIE About a week. 24. SWEDISH COACH And you think you are ready to discover some advices from me? Eddie nods, sweat dotting his brow, this intensely nude man standing over him, hands on hips. SWEDISH COACH (CONT’D) You know who Matti Nykanen is? EDDIE He's only the best ski-jumper in the world. The Flying Finn. SWEDISH COACH The best and the most craziest. The Coach rocks back on his heels, arms akimbo. SWEDISH COACH (CONT’D) So maybe I give you something harder? It’s not exactly the phrase Eddie would choose, but okay. SWEDISH COACH (CONT’D) What is the maximum wideness for a jumping ski? Eddie boldly holds out his thumb and forefinger. SWEDISH COACH (CONT’D) And that is what exactly? Eddie can't help it. His gaze drops for a millisecond. EDDIE ... About four inches. The Coach SNAPS his fingers at Lars. LARS The maximum wideness is 11.5 cm. EDDIE That is about four inc",
      "dialogue_count": 0,
      "word_count": 4133
    },
    {
      "scene_number": 7,
      "slugline": "EXT. GARMISCH 40M JUMP - DAY  Peary winces as Eddie shoots off a jump. PEARY Too soon.  INT. PEARY’S WORKSHOP - DAY  Eddie sits on a sofa with two black eyes. Peary shows him video footage of Matti Nykanen in action. He is a blue-eyed boyish enigma. And insanely brilliant.  EXT. GARMISCH SLOPE - DAY  Eddie races to the jump, full of inspiration... Peary watches and winces doubly hard. PEARY Too late. He turns away to hide his expression only to meet the appalled stare of the Swedish Coach. SWEDISH COACH “Haven’t you got a toilet to go clean?” DOWN AT THE BOTTOM Eddie finds his boots and straps have finally snapped. EDDIE (to the Swedes) Any chance of borrowing some equipment? SWEDES Screw off English! Go take a bollock! Go play with your wanker!  INT. GARMISCH SENIORS REGISTRATION - DAY  A line of spindly, spry OLD PEOPLE. Eddie registers for the Seniors Tournament, his face swollen and purple. SIGNING-IN OFFICIAL For sure, he is okay for this? 45.",
      "characters": [],
      "action_text": "PEARY (indignantly) He’s the national squad captain. It’s a modest easygoing crowd. Lots of geriatric laughter and missing teeth. And the odd recovering Jumper in a wheelchair and plaster cast. Eddie tries to hide his nerves as Peary preps him at the base of the tower. PEARY (CONT’D) Remember. You’re only one jump away from the Olympics. Eddie puts on his battered old helmet. He’s customized the chin strap with a big piece of sponge. PEARY (CONT’D) Just stay focused and do what we’ve done in training only better. He slides Eddie’s chin strap into place. PEARY (CONT’D) A lot better.  INT. GARMISCH 70M TOWER - DAY  Antique jumpers bound up the stairs past Eddie as he psyches himself up. EDDIE You’re only one jump away... You’re only one jump away.  EXT. GARMISCH 70M SLOPE - DAY  Peary takes his place next to the MEASURING OFFICIALS, who are uniformly short intense men, who take measuring jumps very seriously.  EXT. GARMISCH TOP OF THE 70M - DAY  On the wind-swept platform, a bunch of OLD TIMERS laugh it up. One OLD SKIER turns to Eddie to share the joke. OLD JUMPER He says, “You must treat every jump as if it’s your last.” We are saying, for us, that is easy. 46. Eddie stares down the gut-churning icy ramp. EDDIE And for me. OFFICIAL Edwards! A OFFICIAL points at Eddie. It’s time. PA ANNOUNCER Our next jumper is Eddie Edwards from... Great Britain. The Measuring Officials snap into position — eyes fixed on the landing area. Peary discreetly mutters a prayer for good luck. The horn blares, the light goes green and off Eddie goes. Peary can’t help mime everything that Eddie should be doing. PEARY Arms back. Chest down. Fanny in... And lift. Lift! Eddie does not lift. He loses his nerve and shuts his eyes, so he stays frozen in a crouch and SMACKS down onto the slope, a good 30 meters above the normal landing position. The Measuring Officials, who never make a mistake, are completely caught out. The crowd too. That was the shortest jump they’ve ever seen. Eddie rockets p",
      "dialogue_count": 0,
      "word_count": 1004
    },
    {
      "scene_number": 8,
      "slugline": "INT. BOSA HQ - DAY  A seated row of BOSA officials, all in green blazers. Eddie sits opposite, perched on a single chair. Knotted tie, Argyle V-neck, combed hair — his dressed to impress look. Heading this row of flunkies is Dustin Target. TARGET Mr. Edwards, this is a pointless conversation. Our sponsors pay to be associated with hard-earned success, not some ridiculous side- show, however well intentioned. Eddie grits his jaw. EDDIE Why do I suddenly stop being ridiculous at 61 meters? TARGET You won’t reach 61 meters. EDDIE I shouldn’t have to reach anything. I’m the only one in Britain doing the event! TARGET That was the distance ratified by our Health and Safety committee. Target indicates a PORKY AIDE sitting at the end. Eddie’s face: “He’s Health and Safety?” Target gets to his feet. TARGET (CONT’D) Our position could not be clearer. We will not put amateurs in with the real athletes. More chairs scrape back. The meeting is adjourned. EDDIE I thought the Olympics was for amateurs... 50.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 173
    },
    {
      "scene_number": 9,
      "slugline": "INT. KITCHEN - DAY  A steaming pot of tea — untouched. Eddie sits at the kitchen table with his parents. TERRY So the only way to qualify is to make 61m in a European competition? Eddie nods. TERRY (CONT’D) And how much is that going to cost? EDDIE Not too   much. It’s mostly entrance fees and a bit of travel — TERRY But more than you can afford. Eddie doesn’t deny it. Terry picks up a Prince Charles salt shaker. TERRY (CONT’D) Well, answer me this. If this is you now — He mimes Prince Charles jumping off the teapot spout to the middle of the table. TERRY (CONT’D) How much more are they asking you to jump? Eddie can’t lie. He ‘jumps’ the Lady Diana pepper shaker all the way to the edge of the table. Janette and Terry look at this huge gap. This impossibly huge gap.  INT. BEDROOM - NIGHT  Eddie lies on his bed, flicking through well-thumbed pages of photos — Mary Peters, Lasse Viren, Dick Fosbury... It’s his old Olympics album,   Moments of Glory . The same book he pored over as a kid. He arrives at 1960 triple gold medallist Wilma Rudolph from Tennessee —  \"The Black Gazelle.\"  51.",
      "characters": [],
      "action_text": "A strikingly fit black woman, the 20th of 22 children, but also amazingly —  “a polio sufferer who couldn't even walk until she was eight.”  Eddie gazes deeply at the photo of Wilma taking gold in Rome –   “the fastest woman in the world ” – and even more deeply at the photo of Wilma as a young girl, standing in a pair of leg braces. Just like the ones in the hall closet.  INT. LIVING-ROOM - NIGHT  Terry and Janette sit by their pewter Flickerflame gas fire in matching armchairs. TERRY So he’s no better off than when he left, is he? JANETTE Like that’s going to stop him. She wants to go back to her knitting but can’t. He wants to go back to his copy of   Plasterer’s Monthly , but can’t either. JANETTE (CONT’D) We’re just going to have to face it. He’s an obsessive. Terry grunts. TERRY Yeah. I wonder where he gets that from. He looks at her   surrounded   by shelves of royal china. JANETTE Yeah. I wonder. She looks at him   surrounded   by swirly stucco walls and ornate brickwork.  INT. HALLWAY - DAWN  Eddie carries his gear to the bottom of the stairs. This time, Janette and Terry are both waiting for him. JANETTE If we can’t stop you, at least we can support you. 52. She holds out a check, which catches Eddie completely offguard. EDDIE ... You don’t have to do this. TERRY That’s what I said. Janette throws him a look. Turns back to Eddie. JANETTE Just come back in one piece. Eddie sees the amount on the check and reacts. It’s sizeable. Janette pushes the check into his hand. TERRY That was going to be for your first van after you got your diploma. Terry lets out a sigh. TERRY (CONT’D) That was the other dream I had.  EXT. MOTORWAY - DAY  A truck motors down the autobahn, splashing through puddles, ferrying Eddie back to Garmisch.  INT. TRUCK - MOVING - DAY  Eddie sits in the front seat. Headphones on, deep in thought. 90   90  One knee bouncing up and down.  INT. PEARY’S WORKSHOP - NIGHT  Peary idly tinkers away under a solitary work lamp. Lonely, bored, drunk. Edd",
      "dialogue_count": 0,
      "word_count": 611
    },
    {
      "scene_number": 10,
      "slugline": "EXT. GARMISCH 70M PLATFORM - NIGHT  The twinkling lights of the resort. Eddie and Peary sit atop the 70m, drinking cups of ‘fortified’ coffee from Peary’s Thermos. PEARY I think it’s a good thing, to be honest. It means now you’ve got to do it for real. Eddie sips his drink, in no mood to be consoled. EDDIE It was different for you. You were a champion. You were always   good . I got kicked off every team I was on. And the one thing I thought I was good at — ruddy downhill — they wouldn’t even take me. PEARY They’re not exactly begging you now. Eddie looks down, toying intently with his cup. Peary pulls out his schnapps bottle. Adds some more to his coffee. PEARY (CONT’D) Believe it or not, I do know what it’s like to be written off. Eddie glances up. A rare glimpse of the real Peary underneath. PEARY (CONT’D) Of course, my solution was to come here and screw everything that moved... He gives a worldly laugh, but it quickly evaporates. Eddie goes back to toying with his cup. EDDIE I was in a hospital for a year when I was a kid. Dodgy knees. All the doctors told me to forget about sport and take up reading. Eddie pauses, reliving the moment. 54.",
      "characters": [],
      "action_text": "EDDIE (CONT’D) So I did. First book I got was the official 1972 Olympics photo album — EDDIE/PEARY TOGETHER  Moments of Glory.  Peary knows the title all the well. PEARY That was the book I got written out of. EDDIE That was the book that made me realize I needed my own “moment.” That one thing I could do to prove them all wrong. Peary watches Eddie lift his hot metal cup to reveal five interlocking rings in the iced platform. EDDIE (CONT’D) I’ve never changed my mind since.  EXT. BOTTOM OF THE 70M - NIGHT  The clang of unsteady feet as Peary and Eddie descend the stairs. They get to the bottom. A pause. Peary has something to say too. He puts an arm around Eddie’s shoulder. PEARY Eduardo , mein freund . I’ll get you your moment. Off they weave, down the slope to the lights below.  EXT. MOUNTAIN - DAY  Music swells as we sail over a snowy mountain road. PEARY (VO) We’ve only got three contests to make your distance before the Olympic cut-off date. Seefeld, St. Moritz and Oberstdorf. Two months. Three jumps. That’s it. 55. A caravanette hatchback comes into view — the Garmisch maintenance van.  INT. CARAVANETTE - MOVING - DAY  Peary does the driving. Eddie handles navigation. On a map, Peary has marked the jumps in sequence — 1, 2, 3.  EXT. SEEFELD SLOPE - DAY  Eddie does brutal squat thrusts and leaping star jumps. PEARY (VO) I was letting you push off later because it gave you more time for your alignment. No more. Peary demonstrates using a homemade model skier. PEARY (VO) (CONT’D) You’ve got to do it quicker and stronger — with explosive plyometric force. Eddie doesn’t know what that means. PEARY (CONT’D) Like a mad salmon. Eddie leaps — just like a mad salmon.  INT. SEEFELD SLOPE OFFICE - DAY  PEARY (VO) Good start times! You’ll gain at least a meter jumping on early morning ice. Eddie presents himself to a surprised OFFICIAL. Signs his name on a clipboard. PEARY (VO) (CONT’D) So let’s get you registered as a squad captain and claim a pole position. Eddie tries ",
      "dialogue_count": 0,
      "word_count": 594
    },
    {
      "scene_number": 11,
      "slugline": "INT. SEEFELD STREET - DAY  Peary drags Eddie along to a ski resort building. PEARY New equipment! Decent skis, proper boots, aerodynamic jumpsuit, streamlined helmet. This will gain you at least two meters. EDDIE With what? We’ve barely got enough left for entry fees and petrol. PEARY Who said anything about buying? Eddie looks confused. EDDIE I already tried borrowing. Peary leads Eddie past a sign for “Lost Property”. PEARY We’re not borrowing. We’re  reclaiming .  INT. SEEFELD LOST PROPERTY DEPT. - DAY  Peary and Eddie root out various ski boots, a helmet, gloves, a ski suit — recoiling at the musty smell. PEARY Size 11, right? EDDIE 10. PEARY All they’ve got is 11. He hands Eddie the boots. And six pairs of socks. Eddie assembles his final selection. Notices Peary inspecting his own selection in the mirror — an alpine sports jacket with a distinctive zip-up collar. The preferred style for European jumping coaches. PEARY (CONT’D) What? I just like the look, that’s all. 57.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 168
    },
    {
      "scene_number": 12,
      "slugline": "INT. SEEFELD CHANGING-ROOM - DAY  Eddie puts on his six pairs of socks and oversized boots. He joins the circle at the captains’ meeting, proudly putting on his armband. One by one, the other captains react to their new colleague and his kaleidoscope of mismatched gear. “Is this a joke?”  EXT. SEEFELD 70M JUMP - DAY  SUPERIMPOSE: “Contest No. 1 Seefeld.” Eddie jumps and lands. Judging by Peary’s reaction — it’s an instant improvement. Ugly, but definitely longer. Peary gives Eddie the thumbs-up, resplendent in his new distinctive high-collar jacket. It’s a little shabby, but otherwise he looks just like the other coaches now. SWEDISH JUMPER  Din jävla idiot . Peary flicks him an Eddie-style V-sign.  INT. CARAVANETTE - DAY  Eddie - an ice pack on each knee - writes a postcard home, sketching a little diagram to show his progress...  INT. EDWARDS KITCHEN - DAY  ... Janette hands Eddie’s postcard to Terry, sitting behind his copy of   Plasterers’ Monthly . Then she moves Prince Charles a full two inches towards Lady Di at the edge of the table.  INT. SEEFELD PRESS ROOM - DAY  Eddie expertly plunders the free food. Peary, even more expertly, plunders the open bar. Until a voice on one of the TV monitors catches his attention.... He looks up to face the moment he’s been dreading for 20 years. A silver-haired MAN on screen. The TV caption reads “Warren Sharp, Former US Olympic Coach”. 58.",
      "characters": [],
      "action_text": "Sharp is being welcomed aboard the ABC Sports commentary team for Calgary. Peary goes quite still as he takes in Sharp’s immense patrician presence. Hurtling back into his past...  INT. CARAVANETTE - NIGHT  It's small, but they've made it like home. Makeshift clothes line. Posters of Matti Nykanen and Linda Gray on the wall. Eddie shivers in his sleeping bag, swaddled in mittens and scarfs, breath misting the windows. EDDIE “I’m going outside. I may be some time.” Not even a smile from Peary, lost in his thoughts.  INT. SKI RESORT STORE - DAY  Eddie peruses postcards, gulping milk. Peary discreetly unbags his new book –   Sharp Words: The Coaching Wisdom of Warren Sharp . He studies the back cover photo of Sharp — the archetypal straight arrow coach. His unforgiving eyes drilling deep into Peary’s conscience...  EXT. SLOPE - DAY  Swirling snow fills the sky. Peary and Eddie two dots on the wind-swept landscape. PEARY We have to keep working on your Telemark landing. It’s key. EDDIE It’s too complicated. The other way feels better. PEARY Yeah, but it’s not correct. Eddie looks at Peary, unsure where this sudden pedantry is coming from. EDDIE What happened to ugly but effective? 59.",
      "dialogue_count": 0,
      "word_count": 443
    },
    {
      "scene_number": 13,
      "slugline": "EXT. ROAD - DAY  The caravanette WHOOSHES past, more slowly now as it heads uphill... PEARY (VO) You plateaued sooner than I thought. The more you push now, the worse you make it. The only way forward is better technique.  EXT. SLOPE - DAY  Eddie practices the Telemark landing - knees bent, one leg in front of the other - without skis. Again and again under Peary’s exacting, precise direction. EDDIE Christ. When did you get so fussy? Peary ignores him. Just keeps correcting and adjusting. PEARY How does it feel now? EDDIE Robotic. Off Peary’s glare –  EXT. ST. MORITZ 70M JUMP - DAY  SUPERIMPOSE: “Contest No. 2 St. Moritz.” PEARY (VO) (losing patience) Precision is what sets you free. Form and function combined. Otherwise you just snatch at your lift-off and make it worse. We travel all the way down the scoreboard to last place — “Edwards, E. — 53m.”  INT. EDWARDS KITCHEN - DAY  Terry butters his toast with a plasterer’s precision. Looks up to see Janette move Prince Charles backwards from Lady Di — a whole inch. Terry’s face: What did I tell you? 60.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 190
    },
    {
      "scene_number": 14,
      "slugline": "EXT. FIELD - NIGHT  The caravanette sits parked in a muddy field, rain drumming on the roof.  INT. CARAVANETTE - NIGHT  Peary sips his drink and lights another tiparillo. Eddie fidgets noisily with the model skier as he ponders his progress chart — or rather lack of progress chart. The air is thick with fatigue and mutual frustration. And the odd leaking raindrop. PEARY Attitude is altitude. You can’t move forward if your head’s not right. What is Peary talking about? EDDIE We’ve only got three weeks left! Peary’s well aware of the pressure. And he’s not coping so great either. He tops up his glass. EDDIE (CONT’D) Like that’s going to help. PEARY Well, look at the raw material I got to work with. Eddie snaps. Hurls the little ski model into Peary’s glass, splashing it all over Peary’s shirt. EDDIE Some coach you are. Peary leaps to his feet, banging his head on the low ceiling. PEARY It’s ski jumping, not bungee jumping! EDDIE Since when did it have to be Swan Lake? Peary’s face tightens. Water dripping off him. Something has snapped in him too. 61.",
      "characters": [],
      "action_text": "PEARY Eddie. You have a self-limiting belief. Eddie can’t believe what he’s hearing. PEARY (CONT’D) A self-limiting belief that keeps you small. Peary peels off his wet shirt and hands it to Eddie. EDDIE Like you’re so bloody special. Peary’s face: Oh really? The two of them, nose to nose once more. Very coolly, Peary picks up his drink. Pulls out the dripping little ski model. Hands it to Eddie. Heads for the door.  EXT. SLOPE - DAY  Peary marches across the slope - no shirt, no shoes, drink in one hand, tiparillo in the other. Eddie trailing after him. EDDIE Nice. Nice attitude. Very professional. Peary hands Eddie his glass. PEARY Here. Hold this. He marches on to the base of the 90M jump. Points at a Jumper changing into ski boots. PEARY (CONT’D) What size are those? JUMPER 11s. PEARY Close enough. He takes them and the guy’s skis and starts up the stairs. Down below, the Swedes have gathered to watch. SWEDISH JUMPER What is this?   Call My Bluff   again? 62. Eddie feels the glare of onlookers. EDDIE Do you mind? Up at top of the ramp, Peary clips on his boots and slots in his skis, tiparillo still in mouth. EDDIE (CONT’D) Alright, Peary. You’ve made you’re point. Very impressive. Thank you. But Peary is only getting started. He crouches down, arms back, palms up, and sets off... He’s like a great surfer, the natural elegance undimmed by years away. He shoots off the ramp, springing upwards, taut and beautiful – no helmet, no shirt – flying past Eddie and the Swedes... and flying... and flying... The Swedes watch in awe. They all know pure style when they see it. Peary’s skis slap down in the most rakish version of a Telemark landing anyone ever saw. Gliding to a halt with a parallel skid and a perfect arc of spray. Awed silence. Peary removes his tiparillo and taps the ash. Takes back his drink from Eddie and takes a sip. PEARY I’m sorry. I interrupted you. You were saying?  INT. CARAVANETTE - NIGHT  Eddie lies in his sleeping bag, awake, looking like he’s been",
      "dialogue_count": 0,
      "word_count": 2830
    },
    {
      "scene_number": 15,
      "slugline": "INT. CARAVANETTE - DAY  Peary switches off the engine. PEARY Eddie, I want to tell you something. Eddie stares out the window like a zombie. PEARY (CONT'D) Your jump yesterday... Peary has never looked more alive. PEARY (CONT’D) It was the first time you had all your components working together — lift-off, timing, balance, trajectory. All of it, working together like second nature. Eddie can’t face any of this. He opens the door and gets out. Peary reaches to pull him back. PEARY (CONT’D) You idiot. I’m telling you it was the best jump you’ve ever done. But Eddie’s already gone, hurrying out of sight.  EXT. GARMISCH RESORT - DAY  Wind blows across the slopes as the last Swedish flag is taken down and their Olympic HQ packed up.  INT. PEARY’S WORKSHOP - DAY INT. PEARY’S WORKSHOP - DAY  Peary sits at his desk, underlining key sections of his copy of   Sharp Words , jotting notes in the margins, a man reborn. The sound of BANGING and SLAMMING intrudes. Peary looks over to find Eddie hollering in his garage. PEARY Eddie. Cut it out. I’ve been doing some thinking. Eddie just keeps hollering like a maniac. 75.",
      "characters": [],
      "action_text": "PEARY (CONT’D) Seriously. Enough with the histrionics. I’ve figured out a way forward — Eddie appears in front of him, waving a Telex. EDDIE We did it. We’re through. He’s not upset. He’s celebrating. EDDIE (CONT’D) They only recorded the bloody practice jump. He hands the telex to Peary. “E. Edwards, Great Britain, Oberstdorf 61m.” EDDIE (CONT’D) It’s official. It counts. Eddie charges out, banging the door, whooping with joy. EDDIE (CONT’D) “Everything to letter!” Peary stands there, completely thrown. This is a disaster.  EXT./INT. CARAVANETTE - DAY  Matti Nykanen’s inscrutable blue eyes are unpinned from the caravanette wall. Eddie rolls up his poster, unstoppable now as he does his best Ron Pickering. EDDIE Oh this is amazing, this is sensational. Peary arrives at the van, now with a “For Sale” sign in the front window. PEARY Eddie. What I said about your jump — I meant it. We can do this for real. Eddie hums, dances, moonwalks as he packs up his gear. PEARY (CONT'D) You don’t have to settle for being a novelty item anymore. 76. Eddie just keeps bopping away as he packs his case. PEARY (CONT’D) We should take another four years. Re-train you from the ground up. EDDIE What are you talking about? PEARY I’m saying I want to coach you for the next four years. So we can go and really compete. Eddie finally starts to pay attention. EDDIE What for? We’re already going. PEARY I’m saying, if you go now, they’re never going to let you back. EDDIE So what? PEARY So all you can prove is that you don’t mind coming last. EDDIE I   don’t   mind! Eddie can’t believe he’s trying to ruin this great moment. EDDIE (CONT’D) What’s the matter with you? We just pulled off the impossible. Now we get to be a part of it. PEARY I was a part of it. Remember? The intensity in his voice takes them both by surprise. PEARY (CONT’D) It doesn’t mean anything if you sell yourself short. 77.",
      "dialogue_count": 0,
      "word_count": 534
    },
    {
      "scene_number": 16,
      "slugline": "EXT. GARMISCH CARPARK - DAY  A bus driver loads up luggage, ready for the drive back to England. Eddie and Peary stand there, regarding each other with equal frustration. EDDIE I don’t understand. Why can’t we just go and have fun? It’s a good question. And one Peary has already pondered. PEARY A year after I got bumped from the Olympic squad, I went back to Warren Sharp to apologize. I literally got on my knees and begged him to let me jump again. Even now, it still stings. PEARY (CONT’D) You know the last words he said to me? This is the first time, we sense, Peary has said them aloud. PEARY (CONT’D) “You’ll never take jumping seriously, because you’ll never take yourself seriously.” Eddie digests the words and yes, they’re brutal. EDDIE They going to be your last words to me, too? The driver honks his horn. It’s time to go. PEARY Eddie. I got 20 years to make good on. Either we do it right or not at all. EDDIE You’re crazy! Six months ago you were driving a rust bucket. They stand there. Each hoping the other one will cave. PEARY Eddie. Don’t be a fool. 78.",
      "characters": [],
      "action_text": "EDDIE Better a fool than a coward. The bus driver honks again. It really is time to go. EDDIE (CONT’D) At least wish me luck, you stubborn bastard. They hug awkwardly.  INT. COACH - MOVING - DAY  Eddie clamps on his headphones and folds his arms as the bus moves off. How can a victory feel more like a defeat? He can’t even bring himself to look back. Not even a farewell glance at the windswept jumps.  EXT. EDDIE’S STREET - DAY  The street is strangely empty outside Chez Eddie, palace of stucco. Just a voice yelling — EDDIE (VO) Hurry up, it’s starting!  INT. LIVING-ROOM - DAY  Packed inside are Eddie, Terry, various NEIGHBORS, KIDS and Builders. Eddie's Mum enters with another round of tea and Jaffa Cakes as - ON TV, Eddie flaps his arms, jumping in a European contest. UK NEWS REPORTER (ON TV) This week, local boy Eddie Edwards achieves a boyhood dream when he heads off to Canada to compete in the Winter Olympics in Calgary. “Ahhhhhhhhhhh.” Eddie practices in his homemade harness in the back garden, watched by the local Kids. EDDIE (ON TV) I've broken my arm, my jaw, three fingers, two ribs, and eight pairs of glasses. 79. NEWS REPORTER (ON TV) Even though he only finishes half the distance of normal jumpers, Edwards can look forward to competing against the likes of Finnish champion Matti Nykanen. And can even expect to be cheered on by Great Britain’s consort at the Games, Her Royal Highness Princess Anne. On TV, a Gentleman’s Outfitter slips an Olympic blazer onto Eddie's shoulders. OUTFITTER (ON TV) Any pinching under the arms, sir? Eddie shakes his head, proudly inspecting the breast pocket crest. \"Calgary 1988.\" Five Olympic rings and a Union Jack. Just like in all the official British squad photos that fill the walls. Through all this, Terry and Janette exchange a look — quietly humbled by Eddie’s achievement.  INT. BEDROOM - DAY  Eddie rechecks his airline ticket and passport for the last time. When he struggles to close his ski bag, Terry comes and grips it",
      "dialogue_count": 0,
      "word_count": 816
    },
    {
      "scene_number": 17,
      "slugline": "EXT. STOCK FOOTAGE - DAY  Suddenly, we’re hurtling over the Calgary skyline towards the McMahon Stadium and the teeming spectacle of the opening ceremony. A procession of runners brings in the Olympic Torch to light the flame. COMMENTATOR (VO) Fifty-seven nations, 1,700 athletes, 60,000 spectators and more than two billion TV viewers around the globe — all have come together for the 15th Olympic Winter Games, where today the words will be spoken, Let the Games begin! The flame is lit and the stadium erupts in a swirling display of synchronized flag-waving. Drummers, marching bands, polar bear mascots, singer Gordon Lightfoot, sexy ice-skater Katarina Witt, the Jamaican bobsleigh team and —  EXT. CALGARY 70M JUMP - DAY  Whoosh! A SKI-JUMPER flying through the air to reveal a packed stadium below. Olympic flags. TV commentators. Thousands of fans. This is so much bigger and NOISIER than anything in Europe.  INT. CALGARY CHANGING-ROOM - DAY  Eddie waits, suited and ready to jump, his knee bouncing like a jackhammer. Around him, athletes are prepped and massaged by their coaches. Being on his own, Eddie makes do with humming and fidgeting. RON PICKERING (ON TV) So here we are, kicking off the men’s 70m ski-jump with the legendary Matti Nykanen. Eddie leaps up at the mere mention of his idol’s name. RON PICKERING (ON TV) (CONT’D) The 70m crowd has really come alive at the sight of the Flying Finn. Not what you'd call an accessible figure.   (MORE)  82.",
      "characters": [],
      "action_text": "Prefers to let his jumping do the talking — and my word, here's his first speech! Eddie watches the TV monitor: Nykanen soaring for an eternity — a near perfect jump. RON PICKERING (CONT’D) Oh, that’s big. That’s very big. It's got to be at least 89 meters. Nykanen's brilliance silences the other jumpers getting ready, even the Swedes. They quickly turn to stretching, checking their buckles. All except Eddie, who is rapt by the sight of Nykanen as he strides off — eerily boyish in close-up, and also eerily unmoved by the crowd’s rapture. OFFICIAL Edwards! A super intense OFFICIAL executes the now familiar pointing routine to Eddie and then to the sky. You. Next.  EXT. CALGARY 70M JUMP/START PLATFORM - DAY  Eddie bounds up to the platform determined to enjoy every second. This is his moment, right? He gets to the rail and looks down on the biggest ski crowd he's ever seen. 70,000 people and his parents, all waiting for him. RON PICKERING Here he comes, Eddie Edwards. His arrival in Calgary has already caused quite a stir, I can tell you. That homespun, idiosyncratic jumping style has even inspired a nickname — Fans wave a placard: “Canada welcomes Eddie ‘the Eagle’ Edwards.” RON PICKERING (CONT’D) “Eddie the Eagle.” Well, if ever there was a moment to prove he’s not an endangered species, this is it. Eddie waves to the crowd, hiding his nerves by hamming it up.  RON PICKERING (ON TV) (CONT’D)  83.",
      "dialogue_count": 0,
      "word_count": 493
    },
    {
      "scene_number": 18,
      "slugline": "EXT. VARIOUS - DAY  Around the world, people watch their TVs curiously —   Eddie’s neighbors, Florian, his old pupils.  EXT. CALGARY STADIUM - DAY  Around the stands, people watch curiously too — fans, commentators, some of the British squad. Target turns with a withering look to his porky Health and Safety Aide. TARGET “He’ll never make 61m.”  EXT. CALGARY 70M JUMP/START PLATFORM - DAY  The klaxon sounds and Eddie sets off down the slope, picking up speed. He flies into the air and flaps his arms with a mighty cry. But it's more of a squawk as he SHOOTS into the air and plummets to the slope. He lands awkwardly and skids to a halt only when he THUMPS sideways into the end billboard. It's all over in five seconds and the silence is deafening. The crowd, the commentators, the other athletes — all staring in disbelief. Until one by one they start cracking up. “What the f*** was that?” Americans, Canadians, Brits — all cracking up with amused disbelief. And the Swedish team, as always — totally impassive. They all turn towards Lars: “You gave that guy skis?”  EXT. CALGARY 70M JUMP/SLOPE - DAY  Eddie lifts his goggles and automatically turns to get Peary's reaction. But of course he's not there. The score flicks up on the big screen: 55 meters. The crowd applauds good-humoredly, but it's lame and Eddie knows it. TARGET’S AIDE Well, it could have been worse. 84.",
      "characters": [],
      "action_text": "Target’s not so sure as he watches Eddie hide his disappointment by clowning it up for the crowd.  INT. PEARY’S WORKSHOP - NIGHT  A stream of smoke. Peary watches the TV replays of Eddie and his forced bonhomie. Peary looks sad but resigned. He turns back to his new reading material,   Sharp Words: The Coaching Wisdom of Warren Sharp .  INT. CALGARY CHANGING-ROOM - DAY  Eddie clatters back to the quiet of the changing-room, still on a high. He goes straight to his kitbag to find his celebratory chocolate. A box of Jaffa Cakes all ready to go. But something’s off and he knows it. He catches sight of himself in the mirror. Away from the crowd, he can’t hide it anymore. It should feel great and it doesn’t.  EXT. OLYMPIC VILLAGE - DUSK  Eddie wanders along, fighting a growing sense of anticlimax. He squints at his map, totally lost amid the geometric athletes’ quarters. He passes the Jamaican bobsleigh team, decked out in green and yellow latex suits. They watch him go by very strangely. Once Eddie's out of sight, we see why. The Jamaicans pull out a huge joint.  EXT. OLYMPIC VILLAGE - NIGHT  Eddie finally locates his block, where a perky PR WOMAN is waiting to greet him. PR WOMAN A-ha, the elusive Mr. Edwards, where the hell have you been?  INT. PRESS CONFERENCE HALL - NIGHT  The PR WOMAN leads Eddie down a backstage hallway towards a growing hubbub of expectation. 85. EDDIE Blimey, who else is doing the press conference? PR WOMAN No one. It's just you. Eddie notices a TV screen showing footage of him reading   The Sun   at the top of a jump... doing his funny arm-flapping warm- up exercises. She beckons him into the room and a sea of flashbulbs explode. \"Eddie!\" \"Eddie!\"\"Over here! This way!\" More than 130 photographers, TV cameramen and journalists are crowded inside for the new star attraction. All bombarding him with questions.  EXT. CALGARY - VARIOUS - DAY  TV REPORTER The Winter Olympics descended into French farce this week with the outbreak of Eaglemania. SINGI",
      "dialogue_count": 0,
      "word_count": 1085
    },
    {
      "scene_number": 19,
      "slugline": "INT. OLYMPIC HEAD OFFICE - DAY  The PR WOMAN is not so perky anymore. She looks anxiously across at Eddie. PR WOMAN I’m not sure how to put this... On the conference table is a fanned-out mass of tabloid newspapers — Eddie’s antics all in print. PR WOMAN (CONT’D) The official photo session for the British athletes is being held tomorrow. And some of them don’t think it’s such a good idea that you attend. She reluctantly pulls out a letter. PR WOMAN (CONT’D) In fact, they’ve signed a petition. EDDIE Let me guess, the downhill squad? PR WOMAN ... Not just them. He takes the letter and reads. There’s four pages in total — 108 names. All of telling him to go home. TARGET (VO) You have to understand, these athletes have been preparing their whole lives to get to these Games.  EXT. BOSA OLYMPIC HQ - NIGHT  Target stands on the steps, addressing a cluster of reporters and cameras. TARGET This is their chance to get the exposure and sponsorship they need to survive. Watching from way back is Eddie. TARGET (CONT’D) They simply want to make sure it doesn’t get hijacked by some sideshow.   (MORE)  89.",
      "characters": [],
      "action_text": "Especially by someone with no desire to compete as a genuine athlete. A voice blurts out from the rear – VOICE I have desire! Target stops. Heads turn – curious, annoyed. But Eddie doesn’t emerge from the shadows, riding out the awkward silence until Target resumes. TARGET The Games are not about 15 minutes of fame. They’re about a lifetime of excellence. The crowd turns back to the steps as Eddie slinks away unnoticed.  EXT. CALGARY STADIUM - DUSK  The vast empty freezing cold stadium. Eddie sits way at the back, a tiny solitary dot, hunched against the icy wind, feeling like absolute shit. His only company is a snowgroomer put-putting up and down the slope. A steady rhythm that seems to say,   What did I tell you? What did I tell you?  In Eddie’s lap is his battered copy of   Moments of Glory . All his treasured images of triumph. Victorious athletes getting cheered and chaired aloft. Terry slides into the seat next to him. Eddie barely looks up from his book. EDDIE You were right. They don’t want me. TERRY They don’t know you. Eddie looks up at the 90M jump, towering above them in all its concrete and steel glory. And keeps looking up at it, daunted but compelled. Building up to some kind of decision. EDDIE Those other athletes on the petition. They’re not snobs. They’re good people.  TARGET (CONT’D)  90. Terry looks up at the 90 then back to Eddie, putting two and two together. TERRY Are you thinking what I think you’re thinking? Eddie takes a last look at Wilma Rudolph’s lung-busting face, then back up at the towering 90. EDDIE Mum’s going to kill me. Terry considers his only son, breath misting in the vast arena, as tortured as he’s ever seen him. TERRY You leave her to me. Eddie gets to his feet, his mind made up. He knows what he has to do. We hear the discreet hush of camera-clicking —  INT. PRESS CONFERENCE HALL - DAY  Eddie has called a second press conference. This time, it’s all business. EDDIE I’m not deluded. I do know there’s plenty of athletes more ",
      "dialogue_count": 0,
      "word_count": 873
    },
    {
      "scene_number": 20,
      "slugline": "INT. EDDIE’S CALGARY BEDROOM - DAY  On a TV monitor, Dr. Benjamin Pensotti of the Eventing Safety Commission explains: DR. PENSOTTI (ON TV) While the winds are this high, we have decided the less experienced jumpers should not jump. EDDIE High winds? That’s not even a stiff breeze. DR. PENSOTTI (ON TV) It’s nothing personal. It’s strictly a question of safety. Eddie switches channels in disgust. All he gets is a news report on the British athletes doing their photo call. And an episode of   Dallas   dubbed into French. And randomly, the Jamaican Bobsleigh team going down on their heads.  INT. OLYMPIC VILLAGE - NIGHT  Endless fluorescent-lit corridors. Eddie contemplates the contents of a vending machine — Big Turk, Coffee Crunch... His fingers stray to the buttons to make a selection only to be interrupted loudly by a ‘polite’ cough. It’s Peary, fresh off the plane, still with his travel bag. He looks Eddie up and down, none too impressed. PEARY “Eddie the fucking Eagle.” Eddie’s never heard such reassuring words.  INT. EDDIE’S CALGARY BEDROOM - NIGHT  Peary and Eddie get to work setting up base camp in the kitchenette — ski wax, green diet drink, harness, etc. EDDIE It can’t be like the Seniors Jump. It has to be a real jump. 93.",
      "characters": [],
      "action_text": "PEARY I wouldn’t be here otherwise.  INT. HOTEL BEDROOM - NIGHT  The 90m tower, all lit up like a fortress. Janette looks out from her hotel window, trying to hide her nerves and failing badly. Terry sits at the bureau, customizing a shiny new ski helmet. TERRY Get some sleep, pet. I got it covered. He pops open a tin of varnish. Dips in a brush.  INT. EDDIE’S CALGARY BEDROOM - NIGHT  Eddie’s single bed lies empty, stripped of its blankets. Nearby, a fold-out bed stands unopened. Instead, Eddie and Peary lie side by side on the floor, just like in the caravanette. The wind whistles outside, flapping the curtain. Neither one can sleep and they have to acknowledge it. EDDIE Have a cigarillo if you want. PEARY It’s just jetlag. (no it’s not) Eddie fidgets noisily. Peary reaches out to stop him. EDDIE I can’t help it. He really can’t. He rushes to the toilet. Heaves violently into the bowl. Peary has his own nerves to deal with. His hand hovers over the flask in his bag... Somehow he refrains. Eddie waxes his skis... Just like his Dad plastering the top of a low wall. EDDIE (CONT’D) Peary? 94. PEARY Eduardo. EDDIE Thanks for coming. PEARY What are you going to do? Jumping’s my Sistine Chapel and you’re my brush. Eddie heaves one last time. Gets back into his sleeping bag, pale as a sheet. Outside the wind howls remorselessly. EDDIE You ever get the feeling you’ve made the biggest mistake of your life? His questions hangs in the air. They continue to lie there, lost in their private hopes and fears. We fade to black. We fade back up: “Six hours later.” Eddie and Peary are still staring at the ceiling, only now the first rays of dawn are peeping through the curtain. Peary gets to his feet and extends a finger: Listen. EDDIE (CONT’D) What is it? He can’t hear anything. Which is precisely Peary’s point. Eddie scrambles to his feet and pulls back the curtains. A clear blue sky. Not a flag fluttering anywhere. EDDIE (CONT’D) They can’t use the weather as an excuse now, can th",
      "dialogue_count": 0,
      "word_count": 973
    },
    {
      "scene_number": 21,
      "slugline": "EXT. CALGARY STADIUM - DAY  Janette and Terry take their seats. Her knitted sweater says, \"I’m Eddie’s Mum.\"  INT. CALGARY CHANGING-ROOM - DAY  Peary gets Eddie to his feet. PEARY And remember: you’re going to land so much harder on this jump. So when your skis hit the slope keep that fanny up. Whatever it takes, don’t drop back otherwise... A huge GASP goes up from the crowd. The TV MONITOR shows a jump has gone horribly wrong — a monster wipe-out on the slope. PEARY (OS) (CONT’D) Otherwise, you’re going to be joining him.  OUT IN THE STANDS  Janette and Terry watch in horror as medics stretcher off the injured jumper. It’s a broken limb at the least.  INT. TV GANTRY - DAY  CANUCK ANCHORMAN And that may not be the only wipe- out of the day. Not with Britain’s Eddie “the Eagle” Edwards coming up soon. Take a look at this. They run footage of Peary arriving with Eddie earlier. CANUCK ANCHORMAN (CONT’D) Eddie’s coach is none other than Bronson Peary, fallen whiz kid of ‘70s ski-jumping and an old Olympic squad member of yours, if I’m not mistaken, Warren? WARREN SHARP We had a few years together. 98.",
      "characters": [],
      "action_text": "SUPERIMPOSE: “Warren Sharp, Former US Olympics Coach.” A Living Legend, no question. And not a man to waste words. CANUCK ANCHORMAN How do you feel about this unconventional return? Sharp flattens out his palms, not unprepared for the question. WARREN SHARP There’s an old expression in jumping. ‘You’re never bigger than the hill.’ That was Bronson Peary to a T. And it broke my heart. I could never reach him. He was such a natural talent when he was young. Technique, flair — everything but discipline and humility. CANUCK ANCHORMAN And now? Sharp ponders the question deeply. Finally — WARREN SHARP He disrespected the sport so totally as a jumper, I’m just sad he’s going to do the same thing today as a coach.  INT. CALGARY CHANGING-ROOM - DAY  The changing-room has fallen silent. Peary turns from the TV monitor to find the whole room staring at him. He doesn’t even attempt to make light of it. An Official enters and points at him and Eddie. You. Next.  INT. CALGARY STADIUM - DAY  Eddie and Peary are ushered down the tunnel, two silhouettes heading towards the rising wall of noise. One last glance at each other before they step out into the light.  EXT. CALGARY STADIUM - DAY  Electric excitement pulses through the athletes and officials ’backstage,’ including a British contingent. 99. One by one, they start to recognize Eddie. So this is the infamous Eagle. Peary steers Eddie through the gauntlet of stares, feeling the mounting pressure. He gets to the check-in desk. Hands over their paperwork. Mouth like cotton. They pass through to the elevator at the base of the tower. Eddie’s not sure what to do. So Peary leans over and presses the button — just like a regular elevator.  EXT. CALGARY STADIUM - DAY  Down in the stands, Eddie’s parents feel the buzz in the crowd. Officials hurry into position. TV crews from every country get the countdown.  EXT. CALGARY 90M JUMP/ELEVATOR - DAY  As the elevator descends, Peary checks Eddie’s equipment for the last time. The doors open ",
      "dialogue_count": 0,
      "word_count": 656
    },
    {
      "scene_number": 22,
      "slugline": "INT. CALGARY 90M JUMP/ELEVATOR - DAY  Inside, the roar of the crowd is eerily distant. Just the rhythmic hum of the winching cables ascending into the sky. Eddie stares ahead, trying to keep calm. Suddenly – MALE VOICE Jumping is all that matters. If I didn’t jump, I would drink and have sex all the time. Eddie turns and blinks. It is MATTI NYKANEN. His caravanette poster made flesh. Blonde, boyish and surprisingly small (5ft 8in), which throws Eddie even more. NYKANEN Everything else is shit, no? Eddie searches for a suitable reply. EDDIE ... Congratulations on your medal. NYKANEN I win gold, but it was not my best. If I had done my best, I could have come last and been happier. EDDIE What, like me? His strained laugh is quickly silenced. NYKANEN You did not do so good either. EDDIE No, not so good. NYKANEN You’ve done better. EDDIE (a chastised schoolboy) Yes. NYKANEN You laugh. You think I am being patronizing.  (MORE)  101.",
      "characters": [],
      "action_text": "(Eddie’s not laughing at all) But you and I are like one o’clock and eleven o’clock. Nykanen extends two gloved fingers to demonstrate. A V-sign over Eddie’s nose. NYKANEN (CONT’D) Closer to each other than to the others. Winning, losing — that’s for the little people. He rotates his V-sign so a finger now points at each of them. NYKANEN (CONT’D) Men like us, we jump to free our souls. Eddie stares back, frankly bewildered. The doors HISS open. Nykanen doesn’t move. EDDIE ... I think this is our floor. He still doesn’t get it. Nykanen leans in and grasps Eddie’s lapels. NYKANEN The only two jumpers with a chance to make history today are you and I. His stare is rich with self-loathing and threat. NYKANEN (CONT’D) If we do less than our best with the whole world watching, it will kill us inside for all time. And with that cheery parting thought, he steps out.  EXT. CALGARY 90M JUMP - DAY  Peary hurries down to his viewpoint, passing under the gaze of his old coach in the TV gantry box. RON PICKERING Here he comes, the Flying Finn. Matti Nykanen getting into position to go for an unprecedented second gold for jumping.  NYKANEN (CONT'D)  102. Eddie is instructed to wait on the bench. But he can’t help peering over as Nykanen sets off, hurtling down the jump. It is a nigh perfect jump: 118.5m. Alpine poetry in motion. The commentators are in raptures. The crowd applauds like crazy. Eddie is momentarily relieved — it is like a blessing — until he sees the close-up of Nykanen’s face on the monitor, the tiny telling hint of disappointment. Nykanen turns his piercing blue-eyed stare into the camera — right into Eddie’s soul. OFFICIAL Edwards!  EXT. CALGARY 90M JUMP/START PLATFORM - DAY  Eddie moves onto the start platform. And now it all becomes terrifyingly real. The horizon starts to sway. The sound of SCRATCHING echoes in his head. His knees go weak and his stomach heaves. It’s just like the last time he was on the 90. He spits into his steamed-up goggles, but nothing co",
      "dialogue_count": 0,
      "word_count": 2545
    }
  ]
}