{
  "slug": "edge-of-tomorrow-2014",
  "title": "edge of tomorrow",
  "genre": "action",
  "format": "film",
  "scenes_count": 14,
  "characters_count": 7,
  "characters": [
    "YOBO",
    "RITA",
    "MOE",
    "SGT. FARELL",
    "UDF PSYCHIATRIST",
    "ADAM",
    "CAGE"
  ],
  "total_words": 26096,
  "total_dialogue": 14,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. BEDROOM - COUNTRY HOME - NIGHT An OLD TICKING CLOCK. TICK TOCK, TICK TOCK, TICK TOCK. The SECOND HAND turning, unstoppable.   Father Time having his way.   As we find a SMALL BED in this ENGLISH COUNTRY BEDROOM.   TWO LOVERS SLEEPING quietly within.   At PEACE. CHILD’S VOICE (O.S.) ... Dad? DANIEL CAGE (30’s, American) wakes to see his 4 YEAR-OLD SON, ADAM standing by the bed.   The child looking SCARED. CAGE Adam?   What is it? Cage’s beautiful wife HAYLEY (30’s), sits up too. HAYLEY You have a bad dream? ADAM It wasn’t a dream. Cage looking at the little boy’s FEAR.   Unsettled. CAGE Adam? An AWFUL SOUND intruding.   The HIGH-PITCHED WHINE of RAMJETS laboring against HEAVY WINDS -- ADAM ... There’s something outside. The sound DEAFENING NOW.   Consuming everything as -- CUT TO: INT. UNITED DEFENSE FORCE DROPSHIP (IN FLIGHT) - DAY A PHOTOGRAPH.   A photo of the BOY.   WORN.   Coveted.   The ROAR coming from this cramped dropship’s RAMJETS outside. CAGE (now late 30’s) stares at the photo.   Cage is ONLY A FEW YEARS OLDER, but his face is RAVAGED BY TIME.   GAUNT. He is surrounded by 12th SQUAD.   TEN SOLDIERS, from 18 to 55 - FRESH MEAT to BURN OUTS.   All wearing HUGE “EXOJACKETS” - EXOSKELETAL WEAPONIZED BODY ARMOR.  (CONTINUED)",
      "characters": [
        "YOBO"
      ],
      "action_text": "Cage looks at the PHOTO one final time.   CROSSING himself with the picture THREE TIMES.   Superstitious routine. YOBO (CONT’D) THEY SAID IT WAS SECURE. The sound of ARTILLERY growing LOUDER and LOUDER as -- CAGE Welcome to the UDF. KERWHAM!   The dropship is STRUCK.   FIRE everywhere.   A SOLDIER KILLED INSTANTLY BY SHRAPNEL in front of Cage. SGT. FARELL GO, GO, GO-- DROP, YOU BABIES! SOLDIERS LITTERING OUT, tumbling like living ordnance. YOBO Please, I don’t wanna die, help me,   WHAT DO WE DO --  As Farell pulls a KNIFE and CUTS Yobo’s CLIP.   Yobo dropping.   Farell following suit.   Cage the LAST MAN OUT. CAGE ... Survive. EXT. SKY - DAY Cage drops like a HUMAN BOMB.   The ship EXPLODING above. The sky filled with DROPPING SOLDIERS from a THOUSAND DROPSHIPS.   A hail of falling warriors. ARTILLERY STRAFES THE SKIES ALL AROUND THEM.   Dropships EXPLODING.   Cage’s body hitting TERMINAL VELOCITY -- EXT. BEACHHEAD - FRANCE - DAY WHUMP, THUMP, FHRUMP!   SOLDIERS hit the beach, making CRATERS in the sand.   Exojackets going into AUTOLAND at the last moment, tiny JETS cushioning the fall.   Barely. WHAM!   Cage lands in a crater.   Winded.   Breathless.   A RELIEVED SOLDIER getting out of the crater next to him-- RELIEVED SOLDIER WE MADE IT! BOOM!   12 TONS OF FLAMING DROPSHIP LAND ON THE SOLDIER. Cage THROWN BACK by the impact.   Landing in 2 feet of SURF.   CHOKING on the SEAWATER.   Spinning --  4.  CONTINUED: (3)  (CONTINUED) SCREAMING SOLDIER SOMEBODY HELP ME -- Another SCREAMING SOLDIER stuck under the ship, on FIRE. Cage in shock.   As ENEMY FIRE starts streaking in -- THAP!   THAP!   THAP!   Cage RUNNING THROUGH IT ALL... UP AHEAD: BOOM!   HUGE PIECES of the Normandy CLIFF FACE suddenly explode ahead.   HUGE UDF CARRIERS lobbing HEAVY ORDNANCE into the coastline.   SHELLS WHISTLING above as... IN THE SKY: WHOOSH!   A litter of fast-moving STRIKE JETS SOAR through the SKY above as artillery PEPPERS the sky.   Chaos in the clouds, mid-air COLLISIONS, AIRMEN EJE",
      "dialogue_count": 2,
      "word_count": 2505
    },
    {
      "scene_number": 2,
      "slugline": "EXT. UNITED DEFENSE FORCES BASE - DAY RAIN falls on a HUGE MILITARY BASE in RURAL ENGLAND. HUNDREDS OF THOUSANDS of SOLDIERS preparing for war... CHINESE, RUSSIAN, AFRICAN, INDIAN etc.   This is truly a global army.   MARCHING.   EXOJACKET SPARRING.   SHOOTING. As Cage watches 12th squad in the middle of PT. CAGE ... Tub passes out -- The fat Private STRUGGLES over an OBSTACLE, FARELL SCREAMING until... Tub FAINTS.   MEDICS rush over. CAGE (CONT’D) Abba makes a perfect shot. PVT. MORTEN “ABBA” LJUNBERG (30, SWEDISH, male, blonde) hits three BULL'S-EYES, HOOTS IN SWEDISH. CAGE (CONT’D) Old man gets his leg stuck. PFC. HANS “OLD MAN” HEITZ (55, GERMAN, poster child for EXPANDED AGE conscription) gets his leg stuck in a rope. CAGE (CONT’D) French picks a fight. French powers towards a wall, PUSHING someone in her way. A FIGHT BEGINNING.   As Cage REMEMBERS IT ALL aghast -- CAGE (CONT’D) ... What the hell is going on? As Cage suddenly sees RITA breaking up the fight.   Out of her jacket, she’s SMALLER than you’d think, and PRETTIER too.   MOE and SKINNER joining Cage, watching on. MOE The Full Metal Bitch.   Never seen her out her jacket before.   Hell’s she doing down here in the mud -- SKINNER She's first wave tomorrow.   Some kinda morale boost, supposed to make us feel all fluffy inside -- MOE Her ass makes me feel all fluffy inside.   Heard she clocked three thousand kills in Florida alone.  12.  (CONTINUED)",
      "characters": [
        "RITA",
        "MOE",
        "SGT. FARELL",
        "YOBO"
      ],
      "action_text": "RITA steps forward, holding a BIO-TRANSMITTER.   A SUITCASE SIZED miracle of military technology. RITA This is how we fight back. (re: transmitter) ... Roaches communicate through an electricity-based   bio-tech   - their bodies are quite literally electrical receivers.   The Queen transmits to them where to go, how to fight - they’re like drones. Rita points at a HIGHLIGHTED AREA OF NORMANDY on a map. RITA (CONT’D) Sat intel yesterday put our Queen off the coast somewhere here, on your HUDS as Attack Zone Delta. That's 30 square miles so it's needle in a haystack time, but she is   priority one .   She is the key. She holds up the BIO-TRANSMITTER.   Showing a SERIES of PINCER CLAWS on the back of it, like SURGICAL STAPLES. RITA (CONT’D) If we can take her alive, we can implant the transmitter, scramble her signal, shut down the   entire  hive.   But she   has   to be alive for it to work... Kill her too soon, they’ll go into bezerker mode. Need to co-opt the signal first. The General takes over, as we reveal Cage watching it all.   CLEARLY HAVING HEARD THIS ALL BEFORE. BRIGADIER GENERAL ... Our enemy has many strengths but we have one thing they don’t -- CAGE The element of surprise.   BRIGADIER GENERAL The element of surprise. Yobo looks at Cage confused, seeing him mouth the words. BRIGADIER GENERAL (CONT’D) First wave heads to Delta, finds the Queen.   Sends our signal. Second secures the beach.   Third is last on clean up.   By the time the roaches realize what happened--  14.  CONTINUED:  (CONTINUED) CAGE We’ll already be in Paris.   BRIGADIER GENERAL We’ll already be in Paris. Yobo fascinated.   Grinning.   Loving the parlour trick. YOBO Hey, how’d you do that?   What are you psychic?   You read his speech? As Cage gets up mid-speech.   Hurrying out. CAGE ... I need a drink -- EXT. BEHIND THE OFFICERS’ CLUB - NIGHT A LIQUOR RAID in progress.   Skinner handing LIQUOR under the edge of the Mylar to the rest of the team.   As Cage suddenly walks through, GRABBIN",
      "dialogue_count": 4,
      "word_count": 2382
    },
    {
      "scene_number": 3,
      "slugline": "INT. OBSERVATION ROOM - CONTINUOUS The Doctor and Shrink enter an OBSERVATION ROOM.   A ONE WAY MIRROR providing a view of a BLOODIED CAGE next door. CAGE Please, I know how it sounds, but you have to listen to me... I’ve  been   there.   I wake up here, I die there.   Over and over.   I’ve seen the future -   we’re all gonna die   -- UDF PSYCHIATRIST That’s new. As the Young Doctor MUTES Cage’s ramblings next door. YOUNG DOCTOR Immortality construct.   Sisyphean architecture.   Thinks he’s trapped in a kinda, temporal loop.   Passed neural, fTCD, voice.   Total break. UDF PSYCHIATRIST ... What’s under the hood? THROUGH WINDOW: He looks at Cage’s BODY, covered in SCARS and CLAW MARKS. YOUNG DOCTOR (O.S.) Drafted out of Dorset, brought his family here after the US attacks. Been in 2 years - Beijing, Brazil. 9 brigs.   14 insubordinations. Abandoned his unit 11 times in the first 18 months, full AWOL... Mostly found him in Scotland -- UDF PSYCHIATRIST What the hell’s in Scotland -- YOUNG DOCTOR Refugee camps.   Son was remanded into state control when he was drafted, been trying to find him ever since.   Needle in a haystack up there.   It's a mess. As Cage breaks free, SLAMMING against the one way mirror. UDF PSYCHIATRIST ... Enough to drive a man insane.  23.",
      "characters": [
        "UDF PSYCHIATRIST"
      ],
      "action_text": "BACK TO OBSERVATION ROOM: The Psychiatrist watches Cage SLAM into the mirror REPEATEDLY.   Inches from his face.   HE LOOKS NUTS. UDF PSYCHIATRIST Alright, section him.   Take him to psych.   He can sleep it off while the real men do the fighting. (into MICROPHONE) 300 hypo thorazine, thank you. THWAP.   The MEDIC shoots the FRANTIC CAGE in the NECK with a HYPO GUN.   Cage groggy.   Wavering.   EYES FALLING. YOUNG DOCTOR ... I don’t get it. (off his look) Why now?   What made him snap now, after 2 years?   What broke him? UDF PSYCHIATRIST Who cares.   Just get him out of here, Doctor.   We have work to do. ADAM (V.O.) ... Dad? The psychiatrist LEAVING, as the Young Doctor watches Cage FALL DOWN.   Sympathetic.   Cage SHAKING, defiant. YOUNG DOCTOR The hell happened to you, soldier? As the sound of SIRENS GROWS LOUDER ALL AROUND US and -- ADAM (V.O.) Dad, what’s happening -- DREAM CUT TO: INT. LIVING ROOM - COUNTRY HOME - NIGHT -   FLASHBACK  Panic.   The sound of SIRENS.   Cage’s WIFE trying to PACK VALUABLES.   As Cage grabs their SON, PULLING her away -- CAGE ... There’s no time -- EXT. ENGLISH VILLAGE - NIGHT -   FLASHBACK  Cage pulls his wife and child into this COASTAL VILLAGE. VILLAGERS running from the SEA.   Cage GRABS a NEIGHBOR.  24.  (CONTINUED) CAGE How did they get through?   What happened to the perimeter -- NEIGHBOR It collapsed.   Soldiers left... They’re gone, they ran. CAGE What do you mean they   ran   -- NEIGHBOR They abandoned us.   Perimeter’s down, they came from the water -- SCREAMING coming from the coast.   Cage seeing a CONSCRIPT SOLDIER RUN PAST (19) with the villagers.   Terrified. CAGE What are you doing, YOU HAVE TO FIGHT.   YOU CAN’T LEAVE -- UDF CONSCRIPT SOLDIER ... I’m sorry, I can’t -- As Cage sees a HUNTING PARTY of MIMICS in the DISTANCE. Unleashing LEGLESS SNAKE-LIKE MIMICS into the village. SLITHERING at HORRIFYING SPEED.   Attacking the VILLAGERS. ADAM Dad, I’m scared. CAGE Alright, we’re getting out of here, everything’s gon",
      "dialogue_count": 1,
      "word_count": 1236
    },
    {
      "scene_number": 4,
      "slugline": "INT. LATRINES - MORNING Cage looks in the MIRROR.   The water pouring down the DRAIN.   As Cage stares at it, looking awful.   Spent. CAGE (V.O.) Believe in curses, private? INT. MESS HALL - LATER Cage CHEWS ASPIRIN as talks.   YOBO looking over. YOBO You talking to me, Sir? CAGE You’re the only one who ever listens... You believe in hell? Cage looks around the CAFETERIA.   The RAVENOUS SOLDIERS. RITA eating at the OFFICERS TABLE.   An oblivious world. YOBO Sir, you want me to get someone -- CAGE Been having this - dream. (off his look) -- This recurring dream - where I can’t stop dying.   In the battle tomorrow.   Everything goes wrong, we all die, only I don't stay dead.   Just keep waking up today -- YOBO (freaked out) Uh-huh... Did you try the Jello today?   Think it’s grape -- CAGE Best part is even if I don’t go, I die here.   Can’t escape it. Moe looks over from the NEXT TABLE, interrupting. MOE I used to have a recurring dream where I made out with my grandma. YOBO Not exactly the same, Moe --  29.  (CONTINUED)",
      "characters": [],
      "action_text": "CAGE Feel like I'm being punished. Like there’s nowhere to hide -- MOE She’d take out her teeth and stuff, it was nasty -- TUB (O.S.) I think it sounds awesome. Cage turns to see TUB at end of table.   Head buried in his VIDEO GAME.   SHOVELLING FOOD as he plays. TUB (CONT’D) I mean... If you can't die, you got infinite lives, right?   So, you get to fight for free.   No consequences.   Be like a game -- CAGE This isn’t a game, private. TUB It is if you play it like one. (off his look) See the patterns, beat the levels, find the Queen... Could win the whole war by yourself. As he finally LOOKS UP FROM HIS GAME.   Smiling.   Sincere. TUB (CONT’D) ... Maybe if you win the battle, you'll stop having the dream? French DROPS a TRAY with a CLATTER in the BACKGROUND. Everyone CHEERING.   Everyone but Cage.   Doing the math. CAGE Couldn’t find the queen by myself, there’s a million roaches between us and her, it’s impossible -- YOBO Sergeant Major won Florida in one try.   Killed half the mimic army -- CAGE Can’t fight like her, no one can. YOBO It’s a dream, Corporal, you can fight however you want.  30.  CONTINUED:  (CONTINUED) As Cage looks over at RITA EATING across the mess hall. The Sergeant Major SITTING AMONG HER TROOPS. YOBO (O.S.) (CONT’D) Learn to fight, win the war, end the dream... What you gotta lose? EXT. UNITED DEFENSE FORCES BASE - DAY Cage FOLLOWS Rita out of the mess hall, across the base. As he sees her disappear into the ARMORY.   Cage hesitating.   NOT WANTING TO DO THIS.   Until finally -- CAGE (V.O.) Hello? INT. ARMORY - DAY Cage walks into the ARMORY, looking for Rita.   THOUSANDS OF EXOJACKETS lining the walls.   An eerie quiet. CAGE Sergeant Major? He sees a HOLOBAY in the corner.   A 3-D HOLOGRAPH showing MIMIC HISTORY on a loop.   As Cage walks towards it... A HOLOGRAPH of ONE BILLION STARS serenely floats around him.   A METEOR SHOWER flying towards EARTH. HOLOBAY NARRATOR (V.O.)  ... The meteor shower containing the spores originated from a ga",
      "dialogue_count": 0,
      "word_count": 1965
    },
    {
      "scene_number": 5,
      "slugline": "EXT. GRASS HILL - DAY -- Cage’s AUTOCANNON targets nine MIMICS at once.   NINE MIMICS DYING, B-B-B-B-B-B-B-B-BLAM! EXCITED SOLDIER DAMN, SON, THAT’S SOME SHOOTIN’! As he sees MORE MIMICS LEAP off the hill above, LANDING ON the EXCITED SOLDIER, TEARING HIM TO SHREDS -- EXCITED SOLDIER (CONT’D)  NO, GET ‘EM OFF ME --  Cage ignoring him, SURGING UPHILL towards the CLIFFS. Closer now.   LEAPING through the air towards a MIMIC -- CUT TO: INT. SPARRING BAY - DAY -- ALMOST LANDING ON RITA.   Firing his TRACER ROUNDS as she rolls evasively.   A “ 28 ” now WRITTEN on his hand. RITA Size matters.   The bigger the gun, slower the soldier.   Less is more. She CASTS her GUNS aside and DEPLOYS BAYONETS out of her jacket arms.   POLYCARBONATE-KEVLAR BLADES stretching out of her WRISTS.   Extending her ARMS into LONG BLADES. RITA (CONT’D) Only real weapon a soldier needs is his bayonets.   Kill twice as many roaches in half the time -- (grinning) -- And they never run out of ammo. As she LEAPS down into a DEATH BLOW, Cage rolling away, deploying his own BAYONETS as he attacks -- CUT TO: EXT. GRASS HILL - DAY -- RIPPING into the THICK HIDE of a huge RHINO-LIKE MIMIC - Cage SLICING and DICING.   Bayonets covered in BLOOD. Wiping his SWEAT-COVERED BROW.   Clearly EXHAUSTED. CAGE ... Shouldn’t be this hard.  38.  (CONTINUED)",
      "characters": [
        "RITA"
      ],
      "action_text": "As, in the DISTANCE, he sees RITA at work UP THE HILL. WATCHING HER FIGHT with Nuriev-like PRECISION.   An ANGEL OF DEATH.   Cage still a clumsy brawler in comparison -- CAGE (V.O.) (CONT’D) ... What aren’t you telling me? CUT TO: INT. SPARRING BAY - DAY Rita SOMERSAULTS into an ATTACK POSITION.   IMPOSSIBLY ATHLETIC.   Cage TRYING TO ADJUST.   A “ 46 ” on his HAND. CAGE No matter what I do, I’m still too slow, what am I doing wrong? Rita looking at him.   Sizing him up.   Evaluating. RITA ... You afraid of dying, soldier? CAGE Could say I got a handle on it. As... SLAM.   She suddenly LEAPS on him.   An immediate INTIMACY as they are FACE TO FACE.   Rita even more BEAUTIFUL up close.   Cage clearly a little FLUSTERED. RITA You signed your infirmary release? Organ donation forms, next of kin? Cage NODDING, taken aback, as she suddenly SPINS him around like a RAG DOLL, RIPPING open a HATCH on his back. CAGE ... You know you need to start respecting my personal space -- Rita HACKING into the back of his jacket.   READOUTS on his faceplate FLICKERING as she hacks into his system. RITA Human body has a neural limit on it -- something that tells it not to push too far too fast.   Keeps your body from tearing itself up. She pulls out a CHIP, shuts a PORT.   The suit powers up. Readouts flashing “WARNING:   AUTOBALANCER DISABLED.”  39.  CONTINUED:  (CONTINUED) TAK TAK SPT SPT SPT -- His AUTOCANNON runs out of AMMO. A FRESH SWARM OF MIMICS heads his way-- As Cage JUMPS onto the turret of a HALF-EXPLODED TANK, TEARING off the main cannon and using it as a BLUDGEON. WHANG!   WHANG!   WHANG!   Cage unstoppable now. RITA (V.O.) ... How did you do that? CUT TO: INT. SPARRING BAY - DAY Cage SOMERSAULTS over Rita, his agility astounding, as for the first time we see Rita being OUTMANEUVERED. RITA Where’d you learn to fight like that?   Who trained you -- As Cage suddenly gets the drop on RITA.   THROWING her down.   ON TOP OF HER NOW.   In control. CAGE Beginner’s luck I guess. Ca",
      "dialogue_count": 1,
      "word_count": 3268
    },
    {
      "scene_number": 6,
      "slugline": "EXT. ENGLISH VILLAGE - NIGHT   - FLASHBACK  It is a SLAUGHTER.   JAVELINS flying.   SNAKE-LIKE MIMICS attacking like GIANT BLACK RATTLESNAKES, tearing through the VILLAGERS as they fight with makeshift WEAPONS... CAGE JUST GET BEHIND ME -- Cage RUNNING, keeping his family behind him.   GRABBING WEAPONS from FALLEN VILLAGERS.   A SHOTGUN.   A PITCHFORK. As a SNAKE-LIKE MIMIC surges at his son, and -- CAGE (CONT’D) ADAM -- BLAM.   He BLOWS the thing’s head off with the shotgun. Cage GRABBING his son, protecting his family... EXT. ROAD - ENGLISH COUNTRYSIDE - CONTINUOUS -   FLASHBACK  Cage gets his family to a ROAD, SWARMING with ATTACKING MIMICS.   Nowhere to go, no way out.   Hayley PANICKING. HAYLEY DANIEL -- Cage seeing a Villager coming off of a MOTORBIKE in the distance.   The BIKE SKIDDING TO A STOP.   Salvation. CAGE C’MON, LET’S GO -- As the sound of SCREECHING TIRES suddenly intrudes and -- CAGE (CONT’D) Wait, GET DOWN -- BOOM.   An ESCAPING CAR suddenly BARRELS down the street towards them.   As the car FLIPS.   SPINNING OVER THEM -- CRASHING into a house with an enormous EXPLOSION.   The GAS TANK going up.   Cage KNOCKED off his feet.   Until -- HAYLEY (O.S.) DAN ...  And then he sees her.   On the GROUND behind him. A PIECE OF SHRAPNEL having torn through her.   Cage’s wife gritting her teeth, looking at her husband fatefully.  52.  (CONTINUED)",
      "characters": [],
      "action_text": "CAGE Wait,   no --  Cage SCRAMBLING to his BLEEDING WIFE’s side.   Frantic. The sound of her SCREAMING overwhelming as -- CAGE (CONT’D) NO -- RITA (V.O.) ... STAY RIGHT WHERE YOU ARE -- DREAM CUT TO: EXT. DROPSHIP HANGER - DAY -   PRESENT DAY  Cage WAKES with a start.   He is wearing his UNBUCKLED EXOJACKET, laying NEXT to the EMPTY bottle of Bourbon. The FINAL DROP SHIPS are taking off for France all around him.   The sound of the ATTACK on his HUD RADIO. RITA (O.S.) HANDS ON HEAD.   NICE AND SLOW. Cage stands up.   Seeing RITA and THREE MILITARY POLICEMAN behind him.   All with GUNS RAISED. CAGE I finally figured it out. RITA PUT YOUR HANDS ON YOUR HEAD -- CAGE I know why this is happening. Rita pulling out a HYPO-GUN, carefully approaching. CAGE (CONT’D) You wanted to know the truth, that’s the truth.   It’s my fault.  RITA THIS IS A TRANQUILIZER, WE’RE JUST GOING TO SEDATE YOU -- CAGE ... I couldn't save her. As he hears the sound of the FAILED INVASION on his radio.   A curious, tragic calm to him now.  53.  CONTINUED:  (CONTINUED) CAGE (CONT’D) ... This is my punishment. Cage sad.   Resigned.   At peace with it. CAGE (CONT’D) I’m in hell .  The MPS suddenly GRABBING HIM.   Rita reaching out with the HYPO GUN.   Trying to TRANQUILIZE HIM -- RITA HOLD HIM STILL -- The gun JABBING into his ARM as -- Cage suddenly RUNS.   BREAKING FREE.   Sprinting to a DROPSHIP.   LEAPING onto the NOSE of the AIRCRAFT, PUNCHING through the GLASS, RIPPING the pilot out... As he REACHES inside and FIRES the JETS -- EXT. STRATOSPHERE - DAY The dropship SOARS upwards, as Cage forces the jet into a NEEDLE SHOT: straight up, ABOVE THE CLOUDS... Cage LOCKING his faceplate.   Securing his jacket.   As he soars ABOVE THE ATMOSPHERE to the BLACK EDGE OF SPACE... The DENSE FOG of war VISIBLE on the FRENCH COASTLINE BELOW, as the ROCKET starts to fail, and Cage lets go -- Cage floating in LOW-ORBIT.   A single man SILHOUETTED against the green and blue below.   And then he sees it... A SINGL",
      "dialogue_count": 0,
      "word_count": 668
    },
    {
      "scene_number": 7,
      "slugline": "INT. 12TH SQUAD BARRACKS - DAY Cage’s EYES OPEN to see Rita LEANING OVER HIM.   YOBO and 12TH SQUAD all looking on, in shock. RITA Time to wake up, Soldier. CAGE What... (trying to process) What are you doing, how are -- As a team of SCIENTISTS pull him onto a WAITING GURNEY. RITA ... Don’t bother struggling. EXT. UNITED DEFENSE FORCES BASE - DAY Cage is WHEELED through the pouring rain into a WAITING APC TRUCK.   Rita and the scientists following him inside. CAGE WHERE ARE YOU TAKING ME -- As the BASE GATES OPEN in front of the truck. RITA Everything will be revealed soon enough, just try to relax. EXT. LONDON - NIGHT The truck speeds over TOWER BRIDGE.   London TRANSFORMED. THE THAMES choked with vessels seeking haven from the world - Japanese WHALERS, Panamanian TANKERS etc. CAGE (V.O.) Why are you doing this -- EXT. LONDON STREET - NIGHT Rita and the scientists WHEEL Cage out of the truck.   The surrounding streets populated only by OLD PEOPLE and CHILDREN.   The once teeming city now EERILY EMPTY. RITA It’s the only way.   Knew you wouldn’t come voluntarily. As they pull him into a huge nondescript SKYSCRAPER.  55.  (CONTINUED)",
      "characters": [
        "RITA"
      ],
      "action_text": "RITA The bio-tech is blood based.   When you killed that thing, it bled on you, right?   Hit your bloodstream? Cage sees a READOUT.   Shocked.   Seeing an ELECTRICAL ENERGY pouring through his VEINS.   His body charged. RITA (CONT’D) Best we can tell it fuses with the frontal lobe of the host first. (re: a brain scan) When the host dies the bio-tech uses the body’s electrical energy to literally   transmit a   synaptic map back to the host 24 hours before he or she was first killed. (off his shock) Like travelling back in time. Cage reeling.   Trying to process it all.   Doing the math. CAGE ... Spent the last year thinking I was losing my mind -- RITA If anything goes wrong and the looper’s killed, roaches get an instant do-over.   Queens change their strategy based on loopers’ intel - we spend the last four years behind the eight ball. CAGE That’s how they knew we were coming.   They were waiting for us. RITA Been using time as a weapon... And now you have that weapon too. She remove his RESTRAINTS.   Cage sitting up on the edge of the gurney.   TRYING TO PROCESS IT ALL. RITA (CONT’D) ... I heard you talking about it, before you shot those men. (off his confusion) I saw it in your eyes -- CAGE Wait, how can you remember that, I’ve died since then --  57.  CONTINUED:  (CONTINUED) RITA Didn’t really think I was trying to   tranquilize   you, did you? She pulls out a HYPO GUN like the one she used earlier. RITA (CONT’D) Took a sample of your blood, injected myself with your strain. CAGE You did   what ? RITA It’s in my veins -- CAGE Wait, you’re a   looper   now too -- RITA No, no, no - just means I can keep my own memories when you do it. So I won’t forget each time.   So I can remember all this tomorrow. (off his look) We can works as a team now, Cage. ... We’re in this together -- As Cage BACKS AWAY.   Not liking where this is going. RITA (CONT’D) Cage, the UDF needs your help. EXT. LONDON STREET - DAWN Cage walks through London.   Rita following. RITA You know ho",
      "dialogue_count": 1,
      "word_count": 3926
    },
    {
      "scene_number": 8,
      "slugline": "EXT. TOKYO STREETS - NIGHT -   FLASHBACK  A MASSIVE WAR in TOKYO.   A fog of NEON and DEBRIS.   Rita and her TWO HUMAN LOOPER COHORTS leading the UDF TROOPS. RITA (V.O.) Human looping protocol was working.   We were beating them at their own game, that’s how we held Canada, the Americas, Greenland -- (fateful) ... Then the roaches found out. As suddenly a SWARM OF APOSTLES attack.   SWOOPING DOWN. Ripping through the UDF RANKS.   Hunting Rita and the other two human loopers.   BARBED STINGERS LASHING. RITA (V.O.) (CONT’D) Queen birthed the apostles within a week.   Hunted us down wherever we went.   Egypt, Sydney, Tokyo -- Rita POWERLESS as she sees her colleagues PINNED DOWN. STINGERS repeatedly STABBING them, SCORPION-STYLE. RITA (V.O.) (CONT’D) Only way to stop them tracking was to get out the loop - I’m the only one who made it out.   I was lucky. CAGE (V.O.) I don’t get it, how? As Rita is PULLED AWAY into an EVACUATING DROPSHIP. RITA (V.O.) ... I died. INT. OPERATING ROOM - UDF HQ - DAY -   FLASHBACK  Rita is surrounded by SCIENTISTS and EQUIPMENT. RITA (V.O.) Looping’s a quantum tech, works by transmitting a signal back using the host’s electrical energy. (beat) We stopped it getting out. We see her being surrounded by a HUGE THICK LEAD SARCOPHAGUS.   Her BODY TEMP being lowered.  73.  (CONTINUED)",
      "characters": [
        "RITA",
        "ADAM"
      ],
      "action_text": "Cage about to pull the safety net.   Hating the decision. CAGE You really think we can do this? RITA Think I’ll die trying. He looks at her.   London stretched out beneath them... CAGE Then I guess I will too. As she looks at him.   Smiling.   Handing him TWO PILLS. RITA Blood thinners.   Will get your final loop out faster.   Miminize the amount of time you have to -- CAGE Be dead? RITA Takes a while for the blood to thin, we'll do the procedure first thing in the morning.   Back here. (re: PILLS) ... Once you do this, there’s no turning back.   You understand? As Cage bites the bullet and finally SWALLOWS the pills. CAGE Who wants to live forever anyway. RITA ... C’mon, there’s one last thing I need for you to do -- EXT. OFFICERS BARRACKS - LATER THAT NIGHT Back at the base, Rita leads Cage through the OFFICER’S BARRACKS.   A CONTAINED area of SIMPLE mini-apartments. RITA Could be your last night alive, Corporal.   Need your head straight before you go in.   No regrets. CAGE ... I don’t understand -- They arrive at Rita’s PERSONAL BARRACKS.   Cage confused.  76.  CONTINUED:  (CONTINUED) RITA File says you went AWOL 11 times trying to find your kid, that right?   38 leave petitions, hacking camp databases -- CAGE Needed him to know he wasn’t alone out there.   He’s my son. RITA Oh, I know.   I can tell. (off his confusion) ... He looks just like you. Cage frowning.   Looking at her.   UNSETTLED now.   As he sees her looking through her BARRACKS WINDOW. CAGE I don’t -- And then he sees it.   Someone SITTING ON THE BED inside. Patiently waiting.   A SMALL SILHOUETTE.   Like a CHILD. RITA Services found him in the Glasgow camps.   Took a few calls. As Cage sees his SON (now 6) sitting patiently within. RITA (CONT’D) Figured in case anything happens. (off his look) I never got to say goodbye, Corporal.   You deserve better. Cage immediately NERVOUS, not knowing what to do, worried Unprepared.   As she helps him FIX his COLLAR. Rita SOFTENING for the first time.   Calmi",
      "dialogue_count": 3,
      "word_count": 2420
    },
    {
      "scene_number": 9,
      "slugline": "EXT. UNITED DEFENSE FORCES BASE - NIGHT Cage and Rita burst out of the armory to find SKINNER, TUB, FRENCH, MOE and YOBO already in jackets, fighting in the chaos... 12th squad fighting back.   GUNS BLAZING. SKINNER WHAT’S HAPPENING -- Cage and Rita CARVING their way through the fighting, as YOBO sees them run past, towards the DROPSHIP HANGER. YOBO What are they, insane?   WAIT -- EXT. DROPSHIP HANGER - NIGHT HUNDREDS OF DROPSHIPS line the hanger.   Cage and Rita fighting their way inside.   Yobo following. CAGE Where the hell’re all the pilots -- The Apostles CRASH through the HANGER DOOR.   A wave of violence.   Almost through.   Cage and Rita TRAPPED. YOBO (O.S.) Pilots are gone, they were all in briefing, they’re cut off -- As Cage sees Yobo RUNNING TO A COCKPIT. YOBO (CONT’D) C’mon... (off his look) What I told you, I trained for air con before infantry, remember -- Yobo climbing inside.   Cage looking at the encroaching mimics.   Knowing he has no other options. YOBO (CONT’D) C’mon, you want outta here or not? Cage seeing Rita CLIMB INSIDE, manning a GUN TURRET. CAGE ... This is a bad idea. EXT. UNITED DEFENSE FORCES BASE - NIGHT Skinner, Tub, French and Moe are losing the fight, in trouble when - the Apostles suddenly STOP FIGHTING.  85.  (CONTINUED)",
      "characters": [
        "YOBO"
      ],
      "action_text": "MOE What the hell -- As... KRRAANG.   A DROPSHIP comes CRASHING through the HANGER DOORS - GUNS BLAZING.   Soaring up into the sky. INT./EXT. DROPSHIP (FLYING) - ENGLISH COUNTRYSIDE - NIGHT Yobo SPEEDS across the English countryside at NIGHT.   ALL OF THE APOSTLES FOLLOWING THEM .   A SWARM.   At least 30. As the dropship PITCHES and ROLLS.   All over the place -- CAGE How many hours you say you had? YOBO Um, twelve.   Thirteen maybe. (off his look) ... I told you they switched me to infantry.   It’s not my fault. Cage and Rita manning the PULSE CANONS on the FLANKS. RITA AIM FOR THE WINGS, BELOW THE NECK. Yobo SPEEDING THROUGH TREES AND VALLEYS as they OPEN FIRE.   WHOMP, WHOMP, WHOMP.   The huge canons THUMPING out PULSE ROUNDS, lighting up the NIGHT.   The SCREECHING of APOSTLES filling the air as they take them down... THIRTY BECOMING TWENTY.   TWENTY BECOMING TEN. CAGE THEY’RE GOING UNDERNEATH -- Cage picking off the remaining Apostles one by one. WHOMP, WHOMP, WHOMP.   Unleashing hell -- RITA WE’RE ALMOST THERE.   ON YOUR NINE. Rita spinning around to see the final apostles SCREECHING towards her as ... FIVE LEFT.   THEN FOUR.   THEN THREE --  As she turns and... BOOM.   She blasts the final apostle out of the sky.   The winged mimic FALLING TO THE GROUND .  YOBO That’s it, we did it, WE’RE CLEAR. THE SKY EMPTY.   Cage and Rita looking, seeing NOTHING. Yobo TURNING THEM AROUND, HEADING BACK FOR BASE.  86.  CONTINUED:  (CONTINUED) Too late.   As   THE LAST APOSTLE REARS UP OVER CAGE . ANGLE ON RITA: Rita PULLS HERSELF out of the COCKPIT to see the SURVIVING APOSTLE still alive in the distance... The mimic backing CAGE INTO A WALL, as Rita GRABS an AUTOCANNON.   Lining up her SIGHTS.   A THOUSAND YARD SHOT. RITA C’mon, c’mon, c’mon... BACK TO CAGE: Cage keeps Adam behind him.   STARING the Apostle in its BLACK EYES.   As the STINGER comes flying toward him and -- TTHHHHWAP -- Rita’s SHOT BLOWS THE APOSTLE’S HEAD OFF.   A BLACK MIST.   The stinger left inches awa",
      "dialogue_count": 1,
      "word_count": 1824
    },
    {
      "scene_number": 10,
      "slugline": "INT. 12TH SQUAD BARRACKS - DAY Rita watches on as ACROSS THE ROOM we see Cage saying goodbye to his son.   The kid HUGGING his Dad tight.   As Cage stoically walks away, trying not to look back... CAGE Got this awful feeling like I'm not going to see him again. RITA You’ll be fine, Sergeant, let’s just get it done. Cage looks at her, confused.   Rita pulling out some SERGEANT STRIPES.   THREE CHEVRONS.   Matter-of-fact. RITA (CONT’D) Someone’s gotta take Farell’s place.   Unless you’re not ready? Cage looking at her.   TAKING THE STRIPES.   Nodding. CAGE (V.O.) ... This is it, Gentlemen. INT. ARMORY - DAWN Rita, Cage and the rest of 12th STRIP DOWN, putting on EXO-JACKETS.   GEARING UP.   French putting on WARPAINT. CAGE (V.O.) We are all that’s left. As Cage GRABS the BIO-TRANSMITTER.   Rita grabbing a “BIG DADDY” CLAYMORE and REMOTE DETONATOR.   Ready for war. CAGE (V.O.) (CONT’D) Lotta people died to get us here. The Sarge, Yobo, Heitz, Abba. Cage WEDGING Adam's photo into his breast plate. CAGE (V.O.) (CONT’D) Let’s do ‘em proud, okay? EXT. DROPSHIP HANGER - MORNING Cage and Rita BRIEF the remains of 12th squad as their DROPSHIP is LOADED UP behind them.   PILOTS getting in.  93.  (CONTINUED)",
      "characters": [],
      "action_text": "CAGE They’re gonna be expecting us from the sky, so ground-to-air around Paris is gonna be a turkey shoot -- SKINNER So what, we’re going in on the ground?   Won’t they be waiting? RITA Not if we’re on the water. As Skinner sees an MVC ATTACK BOAT being SECURED into the DROPSHIP.   A NIMBLE TRICKED OUT AQUATIC WAR MACHINE. MOE Oh, good, a boat ride... Maybe we can get some fishing in -- CAGE We drop at Vernon.   Take the Seine all the way through to the tower. RITA Once we’re in, we secure the queen, scramble her transmission. Then we evac outta there and blow the whole place by remote. Rita PATS the “BIG DADDY” CLAYMORE. CAGE We are now first wave.   Command has given us until 0800.   Then the attack will go ahead as normal -- SKINNER Why don't they just call it off -- RITA This is the biggest operation in military history, doesn’t just stop on a dime cause we say so. (off his look) We got 2 hours before they hit the beach, after that we're feeding mice to the snake.   Any questions? TUB Yeah, I have a question... You know there’s only 6 of us, right? RITA Can’t thread a needle with a piece of rope, private.   6 is perfect.  94.  CONTINUED:  (MORE)   (CONTINUED) ... Besides, we’ll be in the boat the whole time, don’t worry. (wanting to believe) With any luck, they’ll never even know we were there. INT. UNITED DEFENSE FORCES DROPSHIP - MORNING The quiet before the storm.   Skinner, Moe, French and Tub waiting, sitting in the BOAT, ARTILLERY THUMPING outside. PILOT (O.S.) THIRTY TO CONTACT.   HOLDING -- Skinner offers Cage CHEWING TOBACCO.   Cage taking some, appreciating the gesture.   Secretly spitting it out. RITA (O.S.) We can do this, right? Cage sees Rita looking at him.   Trusting him with her doubt.   Needing to near it.   As he smiles. CAGE Be back in Missouri before you know it... We’re almost there. As she SMILES and the BAY DOORS open to reveal FRANCE below.   The BLUE RIBBON of the RIVER SEINE visible. RITA K, LIGHT ‘EM UP.   CLOCKS UP FRONT. Cage and th",
      "dialogue_count": 0,
      "word_count": 2140
    },
    {
      "scene_number": 11,
      "slugline": "EXT. LEVEL ONE - EIFFEL TOWER - DAY Cage and the team RUN up a STAIRWELL to LEVEL ONE, 95 metres up.   Hearing FRENCH’S SCREAMS over the RADIO. BRIGADIER GENERAL (V.O.) No matter what happens today, history will remember our names... Skinner, Tub and Moe DETACHING THREE PULSE CANNONS from their jackets.   Forming three CANNON NESTS, SECURING THE TOWER BASE BELOW.   As Cage and Rita head up to LEVEL TWO. EXT. UNITED DEFENSE FORCES BASE - DAY The General finishes up, looking at his army. BRIGADIER GENERAL Let them remember us well. As the UDF ARMY CHEERS and the General CHECKS HIS WATCH. RITA (V.O.) This is it, Cage, no do-overs. EXT. LEVEL TWO - EIFFEL TOWER - DAY Cage and Rita arrive 150 METRES UP in LEVEL TWO.   Rita checking her HUD CLOCK: “ 22m 36s ” left .   As they SEARCH THE STRUCTURE.   The METAL CRACKLING with ELECTRICITY. RITA Remember, have to implant into her nervous system for it to work... HUD will locate her spine. Cage CARRIES the BIO-TRANSMITTER.   The TOWER EMPTY.   Rita seeing more MERCURY-like LIQUID on the ground. CAGE Maybe they moved her again? RITA No, she’s here... (looking around) And she’s been busy. As we see rows of HUNDREDS of eerily SYMMETRICAL AMNIOTIC SARCOPHAGI.   Like VERTICAL COCOONS.   Methodically laid out.   ELECTRICAL CURRENT SPARKING around them. CAGE Like a goddamn   production line ...  103.  (CONTINUED)",
      "characters": [],
      "action_text": "Cage looking within the TRANSLUCENT COCOONS to see ALMOST FORMED SPIDER-LIKE MIMICS inside, unmistakable.   LOOPERS. CAGE (CONT’D) Oh my God -- RITA Doesn’t make sense.   They stopped breeding ‘em when we started using the looping tech against them... Why risk starting again now? As a LONG NEEDLE protrudes out of her EXO-JACKET WRIST. Rita PIERCING the cocoon.   EXTRACTING a SILVER-BLACK BLOOD SAMPLE from the creature as it STIRS within. CAGE What are you doing? RITA Running bio-anaylsis.   If these things are loopers we’ll be... She loses the words.   Seeing the BIO-ANALYSIS POP-UP on her HUD.   Rita looking instantly NERVOUS. CAGE Rita we don’t have time for this -- Rita running a SECOND TEST.   Anxious.   CROSS CHECKING. As the sound of GUNFIRE suddenly interrupts -- EXT. LEVEL ONE - EIFFEL TOWER - DAY Skinner, Moe and Tub LAY DOWN FIRE from their PULSE CANNON NESTS.   PICKING off LONE MIMICS below.   A HUGE HORDE of MIMICS flooding towards them in the distance. TUB HERE THEY COME -- EXT. LEVEL TWO - EIFFEL TOWER - DAY Rita looks at the analysis, aghast.   Cage impatient now. CAGE It's a constant field. CAGE (CONT’D) What?   What’re you talking about --  104.  CONTINUED:  (CONTINUED) RITA ... It’s an open loop.   Means they won't have to die to jump.   They can control it, loop whenever they want, backwards or forwards -- CAGE What, like forwards in   time ? RITA Whenever they want.   Who knows how far.   Weeks, months, even years - they’ll control the timeline. (off his look) Cage, if these things get out, it's over.   We can't beat them -- She pulls out the “BIG DADDY” CLAYMORE.   Prepping it. CAGE What are you doing? (of her look) We have to send the signal first. RITA This is more important than Europe, if these things hatch the entire war   is over -- Cage takes back the REMOTE DETONATOR. CAGE Look at me.   This isn’t over yet. (off her look) We can find her, send it, get out and blow these things to kingdom come, okay?   There’s still time -- As she looks a",
      "dialogue_count": 0,
      "word_count": 1318
    },
    {
      "scene_number": 12,
      "slugline": "EXT. LEVEL TWO - EIFFEL TOWER - DAY Rita SETS the big daddy claymore in the middle of the GRID OF COCOONS.   PREPPING the REMOTE DETONATOR.   BEEP. As she sees the new species starting to STIR WITHIN THE COCOONS.   One of the sarcophagi slowly STARTING TO HATCH. RITA ... CAGE, TALK TO ME -- EXT. LEVEL THREE - EIFFEL TOWER - DAY Cage is MID-BATTLE.   FIGHTING at the TOP OF THE TOWER. The Queen like a sci-fi nightmare of KING KONG.   Cutting a TERRIFYING SILHOUETTE against the PARISIAN CITY SCAPE. Cage follows his HUD to the TARGET AREA on the Queen’s back.   Fighting on the QUEEN HERSELF.   Running from LIMB TO LIMB.   DODGING the razor-sharp ROOTS.   Impossible. CAGE I CAN’T GET TO IT -- A storm of JAVELINS and ELECTRIC TENDRILS surrounding him, a MAZE OF DEATH.   Cage trying to get position when --  SHHHICK ... A JAVELIN suddenly RIPS through his side. Cage sent FLYING BACK.   Our hero GRABBING a GIRDER just in time.   Now HANGING over the 300 foot DROP below.  EXT. LEVEL TWO - EIFFEL TOWER - DAY Rita sees Cage DANGLING way up above.   As the COCOONS all start to CRACK and HATCH around her.   Closer and closer. RITA CAGE -- EXT. LEVEL ONE - EIFFEL TOWER - DAY Moe DRAGS Skinner so their BACKS ARE TO THE WALL.   Moe unloading their REMAINING AMMO.   Final rounds. SKINNER Not gonna make it, are we? Moe saying nothing, watching his AMMO as it slowly counts down.   Almost gone.   Moe the LAST MAN STANDING.  109.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 257
    },
    {
      "scene_number": 13,
      "slugline": "EXT. LEVEL THREE - EIFFEL TOWER - DAY The Queen SLITHERS over to Cage.   His FINGERS starting to SLIP.   The Queen bringing her head CLOSER. She stares blankly at him.   Emotionless.   Watching on as a SINGLE POINTED ROOT extends towards Cage’s HANDS. And then she calmly SLICES OFF his LEFT HAND.   Cage SWALLOWING the PAIN.   Now hanging by one hand.   DEFIANT. CAGE Fuck you. The Queen’s face EXPRESSIONLESS.   Devoid of sympathy or life.   As the root reaches for Cage’s other hand and -- PFFFT.   The root suddenly DISAPPEARS.   BLOWN TO PIECES . The Queen looking down, confused, to see Rita below on LEVEL TWO.   Wearing her BATTERED OLD DISCARDED EXOJACKET. Sniping with her jacket’s AUTOCANNON. RITA CAGE, NOW -- The distraction all the opportunity that Cage needs.   As in a final feat of strength he suddenly PULLS HIMSELF UP with his GOOD ARM, HAULING himself upwards... Climbing onto a GIRDER - running UPSIDE DOWN along it... DROPPING DOWN ONTO THE QUEEN’S BACK - following his HUD to the TARGET AREA, pulling out the BIO-TRANSMITTER, RAMMING it down onto the QUEEN’S SPINE -- The QUEEN REELING as the bio-transmitter’s PINCER CLAWS attach like STAPLES, connecting to her NERVOUS SYSTEM -- This monstrous beast letting out an awful SCREECH as electricity CHARGES around her like a TESLA BALL.   Cage RUNNING.   LEAPING off of her, CATCHING a GIRDER just as -- BWAAAMMMM -- A THUNDEROUS PULSE of ELECTRICITY suddenly circles out of the enormous Mimic’s VIBRATING body. Rippling out into the PARIS CITYSCAPE and FRANCE BEYOND. EXT. LEVEL ONE - EIFFEL TOWER - DAY Moe’s AMMO COUNT hits ZERO.   The WALL of MIMICS now just feet away, a FEROCIOUS MIMIC reaching out for them as -- It’s HEAD is suddenly RIPPED OFF by another Mimic.  110.  (CONTINUED)",
      "characters": [
        "CAGE"
      ],
      "action_text": "MOE What the hell -- The Mimics all suddenly TURNING ON EACH OTHER.   RIPPING each other to pieces, tearing each other LIMB FROM LIMB. SKINNER They scrambled the signal.   Hive’s turning on itself -- (disbelief) ... Sunnavabitch, IT’S WORKING -- EXT. BEACHHEAD - DAY And sure enough, the Mimic army   is destroying itself.  THOUSANDS of Mimics ripping into one another in a mass of WRITHING BODY PARTS.   Like a huge CARNIVOROUS SNAKE PIT. BRIGADIER GENERAL (O.S.) TAKE ‘EM DOWN, ALPHA AND BRAVO -- INT. CONTROL ROOM - UNITED DEFENSE FORCES BASE - DAY The BRIGADIER GENERAL watches a huge BANK OF MONITORS.   A myriad CAMERA VIEWS on the BATTLE.   The entire control room in SHOCK, watching the MIMICS TURN ON EACH OTHER. BRIGADIER GENERAL Can’t believe she pulled it off - SEND IN EVERYTHING WE GOT, NOW GO. As we see the UDF soldiers OPENING FIRE on the exposed Mimic army.   Helping the rabid enemy DEFEAT ITSELF. RITA (V.O.) ... CAGE, WE DID IT, SIGNAL’S OUT. EXT. LEVEL THREE - EIFFEL TOWER - DAY Cage hurries down the Eiffel tower.   DODGING LIMBS as the LIVID QUEEN gives chase.   The awful SCREECH continuing. RITA (V.O.) ARTILLERY’S DOWN, EVAC’S EN ROUTE. EXT. LEVEL TWO - EIFFEL TOWER - DAY Rita checks the claymore.   Pulling out the REMOTE DETONATOR.   RUNNING through the HATCHING COCOONS.  111.  CONTINUED:  (CONTINUED) RITA MEET US AT THE SOUTH EAST SIDE OF LEVEL TWO, HURRY -- As she sees Moe PULLING SKINNER UP from level one. RITA (CONT’D) Tub? Moe shaking his head.   As the WHINE of RAMJETS intrudes and they see a UDF DROPSHIP SWOOPS DOWN.   BAY DOORS OPEN. RITA (CONT’D) C’MON, CAGE WHERE ARE YOU -- ANGLE ON CAGE: As he all but FALLS DOWN the tower - LEAPING PARKOUR STYLE.   CLOSER AND CLOSER TO LEVEL TWO... Cage seeing his team ALREADY INSIDE the dropship ahead. SPRINTING to them.   The Queen CLOSER TO HIM NOW. RITA C’MON -- JUMP -- Cage running for all he’s worth.   Almost to the edge of the tower as a LONG BLACK ROOT reaches out to grab him -- And Cage JUMPS.   Leap o",
      "dialogue_count": 1,
      "word_count": 1209
    },
    {
      "scene_number": 14,
      "slugline": "EXT. FRANCE - DAY The dropship soars over the REMAINS of occupied France. Every SPECIES of MIMIC attacking each other below.   HUGE REAVERS wiping out THOUSANDS OF ROACHES.   ARTILLERY JAVELINS attacking APOSTLES.   Mimic bedlam. As we see the BEACHES OF NORMANDY.   The UDF INVASION already a HUGE SUCCESS.   The threat of counter invasion, or nuclear reprisal, nothing more than a DISTANT DREAM. CUT TO: INT. 12TH SQUAD BARRACKS - DAY Adam SITS on his Father’s bunk.   Waiting patiently. RITA (O.S.) Adam? Adam looking up to see RITA standing in the DOORWAY.   The young boy curiously calm.   Almost like he expected it. ADAM He’s not coming back?   Is he? Rita SITTING next to him.   Putting her ARM around him. Saying all the things she never had the chance to say. As she hands the little boy his Father’s STRIPES. RITA (V.O.) ... He’s staying with me. EXT. UNITED DEFENSE FORCES BASE - DAY The Brigadier General follows Rita across the base. RITA I don't care what you do, but he doesn't go back to the camps. BRIGADIER GENERAL Then he’s going with you to Japan. (off her confusion) Recon has signatures in Egypt, Sydney, Tokyo.   Roaches know what we did, Queens are mobilizing. RITA They’re creating a new species. (off his confusion)  115.  (MORE)  (CONTINUED)",
      "characters": [],
      "action_text": "Look in my HUD drive, everything you need to know is there.   Heat signature, bio-readout, full -- And then she stops.   Somewhere between DISBELIEF and EXCITEMENT.   Looking over at the ARMORY. BRIGADIER GENERAL Rita, where are you going? INT. ARMORY - DAY Rita RUNS in, seeing MECHANICS repairing her JACKET.   As she pushes through, opening the JACKET ARM to find BIO- SENSORS within.   The NEEDLE Rita used to test the COCOON. As attached to the needle we see a VIAL OF BLACK BLOOD. BRIGADIER GENERAL (V.O.) You don’t know how to control it -- INT. SICK BAY - DAY Rita BURSTS in.   Grabbing a HYPO-NEEDLE.   Inserting it into the VIAL.   Pulling the BLACK BLOOD through. BRIGADIER GENERAL You don't know what it will do to. As Rita PULLS UP HER SLEEVE and SMACKS a VEIN.   Going to INJECT the blood into her system, as she SPIKES BLOOD. BRIGADIER GENERAL (CONT’D) Please, this is insane.   You don't know what it does, how it works -- RITA It’s a triggered by thought, neuro- synaptic frontal lobe activation -- BRIGADIER GENERAL How could you possible know -- RITA Because you and I just spent the last week in this lab studying it. The General looking at her confused, until... BRIGADIER GENERAL Wait,   you already   looped .  116.  CONTINUED:   RITA (CONT'D)  (CONTINUED) RITA -- So far can go almost a   year in either direction.   Forwards, backwards, I just have to focus. It’s like controlling a deja vu. (of his look) ... Had to be sure it worked. BRIGADIER GENERAL Jesus, what have you done -- RITA Exactly what they're going to do if we don't stop them. Rita standing back.   CLOSING HER EYES. BRIGADIER GENERAL What are you doing -- RITA Got a war to win, General. Rita FOCUSING HER ENERGY.   ELECTRICITY SPARKING... RITA (CONT’D) ... Can't do it alone. As the IMAGE SUDDENLY SHUDDERS with a STATIC WHINE and -- CUT TO: INT. 12TH SQUAD BARRACKS - DAY - (THE DAY BEFORE) Rita SKIPS A BREATH. Getting her bearings.   As she sees Cage saying goodbye to his son.   The FAMILIAR SCENE.   C",
      "dialogue_count": 0,
      "word_count": 978
    }
  ]
}