{
  "slug": "electric-dreams-107-the-father-thing-2018",
  "title": "electric dreams 107 the father thing",
  "genre": "drama",
  "format": "series",
  "scenes_count": 6,
  "characters_count": 0,
  "characters": [],
  "total_words": 8967,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. CHARLIE’S HOUSE - MINUTES LATER The back door bangs open.   Charlie, struggling to put on his coat and backpack, runs across the backyard toward the street.   However, as he crosses he hears something coming from the garage.   Charlie slows to a stop. INT. GARAGE - CONTINUOUS Charlie opens the door, finds The Father working in the corner at the workbench, his back to Charlie. CHARLIE Mom said you were at work. Nothing. CHARLIE (CONT’D) Maybe we can hit some balls later. And with that, Charlie is gone.  ON THE FATHER  He doesn’t even turn to Charlie.   The Father works some metal piece with an electric sander.   Sparks jump all over the place.  CHARLIE  Running.   Down an alley/street.   And if it seems like his life depends on it... well... in a way, it does. At the end of the block is another kid waiting:  PERETTI  Charlie, out of breath, races up. CHARLIE Did your brother leave? Perretti nods.   (N.B. Peretti is a good guy but never seems to talk much.   Harpo without the horn.   Every morning it is the same routine.   They race to school hoping they can make it before Peretti’s older brother Henry can beat the shit out of them.   Now Henry probably wouldn’t really beat the shit out of them being that Henry is Dylan’s brother and all... He is probably just trying to scare the crap out of them... but with Henry, you can never tell.   Henry is 14.   A legend in his own mind.   He is not the brightest bulb on the tree.  17.",
      "characters": [],
      "action_text": "But if you reminded him of that, he would offer to beat the shit out of you.   In fact, he says that a lot: “How would you like it if I beat the shit out of you?”)  CHARLIE (CONT’D) How much time do we have? Peretti shakes his head, panic in his eyes. CHARLIE (CONT’D) Shit. They take off. CHARLIE AND PERETTI Running like wildebeests.   They turn the corner and--  SHIT!  AT THE END OF THE ALLEY:  HENRY .   Standing like he’s in a Sergio Leone movie, seven inches taller than the other two, straddling a shiny purple bicycle, flicking a SHINY SILVER ZIPPO.  Flickity flickity flick.  Henry wears a Nine Inch Nails T-shirt that he found in the basement of his house -- who knows if the shirt belonged to his mom or dad, but it’s hard to imagine that either of the elder Perettis ever listened to anything but Joni Mitchell. Henry smiles, his mouth full of food-encrusted once-gleaming metal. HENRY Hey!   Dickheads! The two dickheads know what is coming next. HENRY (CONT’D) If I catch you, I’m gonna-- He doesn’t even have to finish.   They take off, hop a fence. Henry jumps on his bike. HENRY He makes a left, spins out almost laying down the bike, rights it, and works the pedals like crazy.  18. CHARLIE AND PERETTI Running across backyards, hopping fences.   And along the alley, in tandem, glimpsed by them through the fence, is Henry.  Are they going to make it?  HENRY IS GAINING.  Are they going to make it?  THEY ARE NO MATCH FOR A BICYCLE. But Charlie and Peretti hop one more fence and run across traffic, just as: HENRY Is cut off by one of those mean-looking   BLACK TRASH TRUCKS  ( N.B.   There must be a lot of trash in this city) .   Henry stops, hyperventilating. HENRY Dicks.  I woulda caught ‘em if it wasn’t for the friggin’ cars.  Fat chance.   It’s hard for him to catch anyone -- even on a bike -- because at 14 he already has a smoker’s cough. INT. CLASSROOM - LAKESHORE ELEMENTARY SCHOOL - DAY Charlie and Peretti are sitting in the classroom.   In front of Charlie sits a",
      "dialogue_count": 0,
      "word_count": 2399
    },
    {
      "scene_number": 2,
      "slugline": "INT. HALLWAY - SAME TIME The Father Thing walks down the hall, comes to Charlie’s door, reaches for the handle, starts to turn it, BUT: The door is locked. THE FATHER THING Open the door. Silence. THE FATHER THING (CONT’D) Right now, Charlie. Then, stating the not-so-obvious: THE FATHER THING (CONT’D) I am your father. The Father Thing stares.   A beat.   Gives the door a shoulder. The door gives way but it doesn’t matter because: CHARLIE -- ON THE ROOF He’s already out the window, sliding down the roof, tearing the shit out of his leg, falling from the second story to the ground, landing silently in the bushes. Charlie struggles to his feet, makes his way to the garage. INT. GARAGE - CONTINUOUS Charlie grabs a flashlight hanging on the wall by the door, turns it on. The garage is a mess.   But across the floor, the only bit of order -- moldy, soggy newspapers and magazines are stacked on a trash can/oil drum. Charlie makes his way over to the can.   The stench of decay issues from the magazines as he pushes them off and opens the lid, peers in. CHARLIE No!-- He drops the flashlight and leaps back.   The flashlight spins around like a top on the concrete until it comes to a stop, clicking off.   The garage is plunged into an instant moonlit gloom.  29.",
      "characters": [],
      "action_text": "Charlie forces himself to kneel down and picks up the light, manages to turn the beam back on and shines it down into the barrel. At the very bottom of the barrel, the   REMAINS OF HIS FATHER.  Charlie gets a rake, pushes down, stirs what is left of his father. THE FATHER THING (O.S.) Charlie? Charlie looks toward the door.  Shit!  EXT. BACKYARD - SAME TIME The Father Thing is coming down the path toward the garage. THE FATHER THING Charlie!   Are you in there? He opens the door, steps into: INT. GARAGE - CONTINUOUS Across the garage, the trash barrel.   The lid is back on. The magazines are piled high.   The Father Thing looks around.  Where is Charlie?  CHARLIE -- RUNNING FOR HIS LIFE Down the alleys.   Across the backyards.   Under the El. EXT. PERETTI’S HOUSE - LATER Out of breath, Charlie stands in front of the house, picks up a handful of pebbles, tosses them at a second-floor window. On the third pebble toss, the window opens.   Peretti sticks his head out, holds up one finger:  Wait.  30.",
      "dialogue_count": 0,
      "word_count": 410
    },
    {
      "scene_number": 3,
      "slugline": "EXT. SIDE OF THE HOUSE - SECONDS LATER Peretti walks down the side of the house and as he steps up to Charlie, Henry appears. Henry get’s in Charlie’s face, pulls out his Zippo, starts to flick. HENRY What are you doing here, dickhead? Charlie doesn’t back down. HENRY (CONT’D) Tell me what’s going on or I’m gonna beat the shit out of you. Charlie might not have a choice. INT. HALLWAY - PERETTI HOUSE - MOMENTS LATER The three boys.   A lot of “shushing.”   They don’t wanna wake up Mrs. Peretti.   Through the hallway and down the stairs. INT. BASEMENT - LATER Charlie, numb, sits on the couch.   Peretti and Henry across from him.   Peretti’s eyes are as big as saucers. CHARLIE He took him.   That son-of-a-bitch thing took him. INT. GARAGE - FLASHBACK - AN HOUR AND ELEVEN MINUTES EARLIER We have seen it before:   Charlie’s Father -- one of his fathers -- opens his mouth as if to roar.   But instead of a roar, it is as if the air and the sound are sucked out of the garage. EXCEPT, now we really see what we didn’t see before.   It almost makes us toss our lunch.   The Father’s insides are sucked out of his body.   Blood and bone and tissue and sinew. A body turned inside out.  Charlie framed in the shattered window, backs away from this unspeakable horror. CUT TO:  31.",
      "characters": [],
      "action_text": "CHARLIE ON THE COUCH - RESUME CHARLIE ... My father’s in the trash barrel.   My real father.   The pieces and bits that thing didn’t have any use for.   Bits it threw away.   So, I took the rake and pushed it down in the barrel and stirred. CUT TO: INT. GARAGE - FLASHBACK - AN HOUR EARLIER Charlie in the moonlight.   Stirring the remains in the trash barrel.   Dust stirred up, getting in his eyes. CHARLIE (V.O.) It was dry.   And it cracked and broke.   Like skin from a snake. Flaky and crumbling.   Empty skin. CUT TO: ON THE BOYS - RESUME CHARLIE The insides are gone. Peretti’s eyes are filled with tears. CHARLIE (CONT’D) Nothing but the cracking skin, wadded at the bottom of the trash in a heap. HENRY Jesus. CHARLIE We were supposed to go hit balls. (choking back a sob) I want my father back... It hangs there for a moment and then: HENRY Lemme get this straight.   Your old man shot some rays out of his eyes--  32. CHARLIE Not my dad, this thing-- HENRY This thing that’s your old man-- CHARLIE That looks like my dad, yes-- HENRY This thing that looks like your dad shot a ray out of his eyes-- CHARLIE Not his eyes, I dunno-- HENRY And ate your dad. CHARLIE Yes. HENRY Well, dickhead... I believe-- CHARLIE Thank you-- HENRY I believe that you’re full of crap. Henry pulls out a joint, lights it with his Zippo, sucks on it. HENRY (CONT’D) Hey, at least you got one. (pointing to his brother) Dylan hasn’t been the same since our old man left for New York to ‘pursue an alternative lifestyle.’ Ya know what I mean? Charlie doesn’t really know what he means.   Henry offers Charlie the joint.   Charlie shakes his head.   Dylan takes it, takes a hit when: A door at the stop of the stairs opens.   A light slices down the staircase. MRS. PERETTI (O.S) Are you boys down there?  33. Henry grabs the joint from his brother, swallows it, burns the shit out of his tongue. HENRY (eyes watering in pain) Yes, mom. MRS. PERETTI (O.S.) Is Charlie Cotrell with you?  MRS. PERETTI   comes down",
      "dialogue_count": 0,
      "word_count": 1019
    },
    {
      "scene_number": 4,
      "slugline": "INT. MASTER BEDROOM - SAME TIME Charlie isn’t the only one not sleeping.   Neither is The Father Thing. Ever. The Father Thing is staring at the human form turned away but next to him -- the bare leg draped over the comforter, the small of her back, her shoulders and her neck. But The Mother sleeps. CLOSE ON A DIGITAL ALARM CLOCK Flickering.   It’s 3:14 A.M. Charlie stares at it, HEARS voices from outside.   He steps up to the window. Down below it looks like a late night neighborhood watch gathering.   There’s   MR. RAZA   and   MR. JOHNSON   and Dashiell’s father   MR. DALTRY   and   MR. LAWRENCE   and   MR. GOLDBERG   and... In the middle of all of them is The Father Thing.   He’s doing all the talking. The Father Thing looks up at the window.   Charlie leans behind the drapes, back pressed up against the glass, holds his breath.  Did he see me seeing him?  The Father Thing finally looks away and the men move together silently down the street. ON CHARLIE  Who can I trust?  FADE OUT. INT. KITCHEN - CHARLIE’S HOUSE - NEXT MORNING Charlie, black circles under his eyes, comes downstairs, walks into the kitchen. The Father Thing is sitting at the table reading the newspaper on his iPad, casually drinking coffee.   Charlie’s mother is busy at the kitchen counter.  36.",
      "characters": [],
      "action_text": "THE MOTHER Here’s your lunch.   And don’t leave the water bottle at school. The Father Thing shovels spoon after spoon into his coffee. Nine -- ten -- scoops.   And then he starts to drink it. THE FATHER THING Charlie, did you see the Yankees traded for Prince Fielder?--  Someone must have been doing his homework.  CHARLIE Mom, can you drive me today? THE MOTHER Not today, Charlie.   I have clients back to back all morning-- CHARLIE Please. The Father Thing stares at him.   Finally: SMASH TO: INT. CAR - MOVING - MOMENTS LATER Charlie sits next to his mother.   He watches as The Father Thing -- standing in the middle of the driveway -- recedes in the passenger side mirror. CHARLIE We need to leave here. THE MOTHER What?-- CHARLIE We need to leave and never come back.   You’re not safe-- THE MOTHER Charlie-- CHARLIE (frantic) I know everything.   I know that Dad was thinking about moving out.   I know that you weren’t happy--  37. THE MOTHER You know how?-- CHARLIE Mom, I’m not a little boy.   And there’s nothing I want more than for us all to be together and to be happy and to go to the Galapagos Islands and all kinds of places-- She pulls the car to the side of the road.   He anxiously looks in the side mirror. THE MOTHER Charlie, things are complicated. Your father loves you.   And I love him.   Even if it sometimes doesn’t seem like I do.   I really think that things are going to get better, Charlie.   We are going to make it work-- CHARLIE You don’t understand.   It’s not Dad. Charlie is right.   She doesn’t understand. CHARLIE (CONT’D) I can show you.   I have proof. THE MOTHER Charlie.   Stop. EXT. LAKESHORE ELEMENTARY SCHOOL - DAY The Mother pulls up to the school.   Charlie opens his door. THE MOTHER Tell you what.   Tomorrow, your father has to work late.   How about you and I go out to dinner.   What do you say? Charlie doesn’t know what more to say. INT. HALLWAY - LAKESHORE ELEMENTARY SCHOOL - DAY Charlie walking down the hall, lost in thought, heading tow",
      "dialogue_count": 0,
      "word_count": 767
    },
    {
      "scene_number": 5,
      "slugline": "EXT. ELEMENTARY SCHOOL - SAME TIME A   BUNCH OF COP CARS   screech to a stop.   COPS   get out.   On their heels, a   COUPLE OF FIRE TRUCKS   pull up. THE ROOF OF THE GYM - CONTINUOUS Watching from the ledge on the roof, Mr. Dick.   Actually, he is not watching.   He is standing perilously close to the edge and gazing vacantly out across the city. BELOW THE GYM - CONTINUOUS  COPS.   FIREMEN.   THE PRINCIPAL.   SCHOOL PERSONNEL.   Looking up at the man on the roof.   The   HEAD COP, CAPTAIN MILLER,  takes a bullhorn, turns to the Principal. CAPTAIN MILLER What’s his name? PRINCIPAL Leonard Dick.   He’s a substitute teacher. CAPTAIN MILLER He married?   You call his wife? PRINCIPAL No answer. CAPTAIN MILLER Anyone else to call? The Principal shakes his head. CAPTAIN MILLER (CONT’D) Anything you can tell me about him? PRINCIPAL No. The Captain puts the bullhorn to his mouth -- he might as well be reading from a textbook. CAPTAIN MILLER Leonard.   I know you feel like you can’t go on, but things are going to get better.   This is temporary. MR. DICK I want my wife back home.  40.",
      "characters": [],
      "action_text": "Miller takes this information in, tries again to connect. CAPTAIN MILLER I wish we could bring your wife back.   It wasn’t right for her to leave you-- MR. DICK She didn’t leave me.   She’s still there.   But she’s not my wife.  Huh?  CAPTAIN MILLER I know we can figure this out, sir. Lemme help you. The Man on the Roof listens, nods. CAPTAIN MILLER (CONT’D) Just step away from the edge, sir. Mr. Dick takes a step back.   Miller turns to an   UNDERLING : CAPTAIN MILLER (CONT’D) Good.   Get up there and get him down. The Man on the Roof takes one more step back and then:  He jumps.  ON CHARLIE  Holy shit!  BELOW THE GYM - SAME TIME Mr. Dick is dead on the blacktop. INT. AUDITORIUM - LATER The school is assembled.   Charlie and Peretti and Rotko are sitting near the back.   The Principal is on the stage, jacket off, sleeves rolled up, microphone in his hand. PRINCIPAL Today has been a difficult day. Rotko leans over to Charlie and Peretti.  41. PRINCIPAL (CONT’D) School will be dismissed early today.   Just know that your teachers and your administration will be here all week to-- ROTKO Dashiell’s gonna be pissed that he ditched today and missed all this shit.   You wanna go to Superdawg? EXT. SUPERDAWG - LATER AFTER SCHOOL The kind of local fast food joint that has a lot of stuff on the menu and none of it is any good.   Charlie is picking at a slice of pepperoni pizza.   Peretti is next to him eating French fries.   Rotko is shoveling in a hot dog and has two more strategically placed in front of him.   Charlie is not sure what to do. ROTKO Maybe your Dad is just in a bad mood. CHARLIE It’s not a ‘bad mood’-- ROTKO My Mom gets in bad moods. Especially when she forgets to take her Abilify.   Course, she’s bipolar.   Hey, how bout if I can steal some of her medicine and you can sneak it in his food-- A hand reaches over and grabs a pepperoni.   The hand is attached to Henry.   Henry’s other hand is around the waist of the Girl we saw him with before.   By the way, her",
      "dialogue_count": 0,
      "word_count": 1679
    },
    {
      "scene_number": 6,
      "slugline": "INT. CHARLIE’S HOUSE - MOMENTS LATER Charlie bursts into the kitchen.   His mother isn’t there. Thank God The Father Thing isn’t either. INT. HALLWAY - CONTINUOUS Charlie walks down the hallway and into: INT. CHARLIE’S BEDROOM - CONTINUOUS Charlie enters.  Shit!  The Father Thing is sitting on the corner of the bed.   He tosses a ball back and forth in a mitt. THE FATHER THING I thought maybe we could play ball. Charlie is so fucked. EXT. BASEBALL FIELD - DUSK No one is there.   The sun is going down.   Charlie is standing down the third baseline. The Father Thing is at the plate, hitting a bucket of balls toward Charlie.   Each ball is hit incredibly hard and with purpose. THE FATHER THING You know why they call third base the hot corner, Charlie?  Whack!  THE FATHER THING (CONT’D) Because when the ball is hit hard in the direction of left-field and the runner takes off barreling to first at a rate of twenty-six feet per second, the third baseman has -- at most -- about four seconds to get the ball from third to first.  Whack!  The way The Father Thing behaves... and what he says... it is downright abusive.  49.",
      "characters": [],
      "action_text": "THE FATHER THING (CONT’D) With such a short margin of error and the need for superior reflexes, third base is the toughest position to play in baseball.   Once the ball is in play, you only have mere seconds to assess the situation, anticipate what will happen next, formulate a plan of action and execute in fractions of seconds. And you have to harbour beyond the sharpest of motor skills that will allow you to act defensively on impulse.  Whack!  It becomes more and more dangerous, as though Charlie is a target. THE FATHER THING (CONT’D) Do you know what it’s like, Charlie, to watch your world disappear, to wander the universe carried by star-winds with no possibility to be with your other, no chance to create progeny, no chance to have a real tomorrow? There is almost a hint of emotion. THE FATHER THING (CONT’D) I’ve been learning a lot the past few days, Charlie, as I have gotten stronger.   Soon you’re going to have the same opportunity.   Facts. Trivia.   ‘Stuff.’   I’ve learned about the whole history of ‘yourkind.’   Six thousand years. And it’s not a pretty picture, Charlie. The balls are coming fast and furiously. THE FATHER THING (CONT’D) But with everything I suck up, with every breath I take in, I keep coming back to one undeniable perplexing conundrum.  Whack!  50. THE FATHER THING (CONT’D) And it’s baffling: (Shaking his head, then:) Charlie, half of the batters in modern baseball bat left-handed. So why isn’t first base the hot corner, too? The Father Thing smacks a ball.   It’s like a shot from a cannon.   Charlie turns.   The ball hits him in the back.   It hurts like hell. Charlie lets out a yelp, turns back toward this Thing. THE FATHER THING (CONT’D) What’s the matter, Charlie?   Man up. Finally, tears in his eyes, Charlie throws down his mitt and runs away.   The Father Thing watches. INT./EXT. FRONT DOOR - PERETTI HOUSE - NIGHT The door opens, revealing a shaken Charlie.   Mrs. Peretti is at the door.   Behind her, Peretti and Henry are at the d",
      "dialogue_count": 0,
      "word_count": 2693
    }
  ]
}