{
  "slug": "emma-2020",
  "title": "emma",
  "genre": "drama",
  "format": "film",
  "scenes_count": 10,
  "characters_count": 0,
  "characters": [],
  "total_words": 25861,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. DONWELL ABBEY, MR KNIGHTLEY’S ROOM - LATER - LATE 14   14  AFTERNOON  Mr Knightley, now bathed, is being dressed by his VALET. This room looks properly inhabited: it’s cosy, with books and papers everywhere. 9A.  INT. DONWELL ABBEY, BEDROOM / DOUBLE CUBE / SINGLE CUBE/ 15   15  STATUE HALL - CONTINUOUS - LATE AFTERNOON  Mr Knightley, now dressed in clean clothes, is walking through the cavernous space. The furniture is all dust- sheeted and the chandeliers are bagged. Footmen are lighting candles in the background. His housekeeper MRS REYNOLDS intercepts him, ruefully- MRS REYNOLDS You know what I’m about to say, sir- MR KNIGHTLEY “-Why do you keep a carriage if you never put it out?” He smiles at her, unrepentant. MRS REYNOLDS It’s just such a shame to see it standing by. (changing tack) A gentleman on foot- it’s unusual. He says the word ‘unusual’ with her. Laughing, he goes out. MR KNIGHTLEY Good evening, Mrs Reynolds. MRS REYNOLDS (calling after him) It would be a kindness to the driver. Just every now and again.  EXT. DONWELL ABBEY - SUNSET 16   16  Mr Knightley exits on foot and sets off through the grounds, still smiling, enjoying the exercise.  INT. HARTFIELD GOLD DRAWING ROOM - AN HOUR LATER - EVENING 17   17  Mr Woodhouse is asleep in his habitual armchair, snoring softly. Emma is re-reading the letter from Frank Churchill. She hears footfalls and looks up to see through the window that Mr Knightley is approaching. Wanting to appear occupied when he comes in, she puts down the letter, hurries through to the music room, sits down at the piano and begins to play. The sound of the piano startles Mr Woodhouse awake. Mr Knightley comes in. Mr Woodhouse is pleased to see him. 10.",
      "characters": [],
      "action_text": "MR WOODHOUSE Mr Knightley! You must have had a shocking walk. MR KNIGHTLEY Not at all, sir. It is a beautiful, balmy evening. Mr Knightley feels at home at Hartfield. He goes at once to his habitual chair next to Mr Woodhouse and sits down. Emma, wanting to annoy him, plays a discordant note on the piano just as he sits down, as a rude sound effect. He shoots her a look, and she innocently busies herself with the music. MR WOODHOUSE But you must have found it very damp and dirty. MR KNIGHTLEY Dirty, sir! Look at my boots. Not a speck on them. How do you do? I came to wish you joy. MR WOODHOUSE Joy? (wincing) Oh! The wedding. Terrible day. MR KNIGHTLEY (to Emma) So how did you all behave? Who cried most? Emma has become bored with her pretend piano practice. She leaves the music room and comes back to join them. EMMA We all behaved charmingly. Everybody was in their best looks. Not a tear, and hardly a long face to be seen. MR WOODHOUSE (to Bartholomew) Bring that screen a little closer. Mr Knightley feels a chill. Bartholomew hastens to bring the screen forward. MR KNIGHTLEY And what of Mr Frank Churchill? Is he every bit as handsome as his father promised he would be?  (MORE)  11.  (seeing Emma’s expression) He did not come? He sees the letter on the sofa next to her and picks it up. MR WOODHOUSE Emma bears everything very well, but, Mr Knightley, she is really very sorry to lose poor Miss Taylor. MR KNIGHTLEY Poor Mr and Miss   Woodhouse , if you please, but I cannot accept ‘poor Miss Taylor’- on her wedding-day! He turns his attention back to the letter. Emma is watching him closely. EMMA He wished exceedingly to come, but his aunt and uncle could not spare him. Mr Knightley starts reading the letter, a little sceptically. Mr Woodhouse gets up: it’s the time of the night when Bartholomew sets up the backgammon table, and Mr Woodhouse needs to find the perfect spot to set it up. MR KNIGHTLEY Well, I dare say he might have come if he could. EMMA I do not know why y",
      "dialogue_count": 0,
      "word_count": 2174
    },
    {
      "scene_number": 2,
      "slugline": "EXT. HIGHBURY LANE, NEAR HARTFIELD - LATE AFTERNOON - DAY 24   24  Emma and Harriet are walking home together. EMMA Mr Elton is a such a good humoured man. So cheerful, and obliging, and gentle. I think very well of Mr Elton. Harriet glances at her uncertainly, wondering if Emma is trying to tell her something in a coded way. HARRIET I do so wonder, Miss Woodhouse... that   you   should not be going to be married. So charming as you are. She winces- has she overstepped?   But Emma laughs. EMMA A person’s being charming, Harriet, is not quite enough to induce them to marry; they must find another person charming, too. I have none of the usual inducements of women to marry. Fortune I do not want; employment I do not want; consequence I do not want. I believe few married women are half as much mistress of their husband’s house as I am of Hartfield; and never could I ex pect to be so truly beloved and important, so always first and always right in any man’s eyes, as I am in my father’s. They’ve reached the Hartfield gates. They stop and Emma puts out her hand, regally, for Harriet to take. EMMA (CONT’D) You must come again tomorrow. HARRIET (overcome) Oh, Miss Woodhouse! Thank you! She curtseys and walks off. Emma watches her go.  EXT. HIGHBURY MARKET SQUARE - A FEW DAYS   LATER - MORNING 25   25  Emma and Harriet are out walking through the quaint town centre of Highbury. They pass into Ford’s, the haberdasher. 19.  INT. FORD’S HABERDASHER - A LITTLE LATER - DAY 26   26  Harriet and Emma are shopping. Emma has already made her purchase, and Harriet is infuriating her by taking a long time to decide between two almost identical ribbons. HARRIET The dark blue or the light? Miss Woodhouse, which do you prefer? EMMA (repressing irritation) They are nearly identical. HARRIET (still dithering) Of course, if the dark gets dirty, it will not show... but the light- EMMA The dark then. HARRIET The light is a good deal prettier. Emma perceives Miss Bates peering through the window at them, and groans audibly. Harriet is instantly alarmed. HARRIET (CONT’D) What is the matter, Miss Woodhouse? Are you ill? But there’s no time to reply. Miss Bates comes in, breathless- MISS BATES Miss Woodhouse. How do you do- and you, Miss Smith- I saw you through the window- Miss Woodhouse, I bring happy news- such happy news- we have had a letter this very morning from my niece Jane Fairfax! EMMA I hope that she is well. She turns away and goes to continue shopping. But Miss Bates follows her around the store, not letting her escape- MISS BATES In normal course she writes Tuesday, or Wednesday, but here it is today, so very unexpected- (hearing Emma belatedly)  (MORE)  20.",
      "characters": [],
      "action_text": "(hunting in her bag for the letter) Oh, where is the letter? It must not be far off- such an unexpected-  MISS BATES (CONT'D)  Oh, Miss Woodhouse, you are so very kind to inquire. Her health- poor Jane- she is at Weymouth with Colonel Campbell, and- 20A.  Harriet has turned back to the ribbons. HARRIET (to herself) For winter perhaps the dark is best- MISS BATES (finding it) Ah!– it had got lost under the- (passing it to Emma, who takes it reluctantly) -yes, Weymouth, with Colonel Campbell, and his wife, and her dear friend Miss Campbell, who is recently, married: she is Mrs Dixon now. Emma has scanned the letter very briefly, and holds it out for Miss Bates to take; but Miss Bates has changed the subject, so Emma puts it down on the counter between them. MISS BATES (CONT’D) And oh- oh dear! Mr Dixon- the most charming young man- rendered Jane a great service in recent days. They were out in a party on the water, and Jane, by the sudden whirling round of something or other among the sails, would have been dashed to the sea at once- and actually was all but gone- but Mr Dixon, with the greatest presence of mind, caught hold of her habit,  and saved her life!  Harriet gasps. Miss Bates turns, thrilled to discover that Harriet is listening, and reaches out her hand to clasp Harriet’s. Her eyes fill with sympathetic tears. MISS BATES (CONT’D) To think that poor Jane might have perished! I cannot think of it without trembling! She an orphan! I shall always be very very fond of Mr Dixon now. EMMA I am very glad that Miss Fairfax was not harmed. MISS BATES (quivering with gratitude) You are too kind.   I shall write to Jane this very day!  (MORE)  21. She goes to leave, then realises she has left the letter and returns for it. MISS BATES (CONT’D) Such devoted friends.  MISS BATES (CONT'D)  How very gratified Jane will be, to know that she has such dear, devoted friends. 21A.  EXT. HIGHBURY LANE - FIVE MINUTES LATER - DAY 27   27  Emma and Harriet are returning to Hartfield",
      "dialogue_count": 0,
      "word_count": 2831
    },
    {
      "scene_number": 3,
      "slugline": "INT. EMMA’S DRESSING ROOM AT HARTFIELD - THE NEXT DAY - DAY 35   35  Emma, in her dressing room, is being fitted for a winter coat by the haberdasher MRS FORD. Emma is wearing a mock-up, and Mrs Ford is busily altering the garment to fit. The door opens and Harriet bursts in, carrying a letter. HARRIET Miss Woodhouse- you will never guess what has happened- Robert Martin has offered me his hand! (then, suddenly)  Hic.  She is so breathless with excitement that she has gi ven herself the hiccups. She rushes on, fumbling with the letter- HARRIET (CONT’D) He writes as if he really loves me very much.   Hic.   I came as fast as I could to ask you what I should do.  Hic.  Mrs Ford glances at her quickly, and then resumes work on Emma’s hem. Harriet is now comfortable enough at Hartfield not to pay attention to the servants, and doesn’t notice. She comes forward, holding out the   letter- HARRIET (CONT’D) Will you read it?   Hic.  EMMA Take a deep breath and hold it. Harriet obliges. Emma begins to read the letter. A long beat, and then Harriet exhales noisily to ask- HARRIET (anxiously) Is it a good letter? Or too short? It is, in fact, a good letter. Emma is surprised. EMMA A very good letter- so good, that I think one of his sisters must have helped him. HARRIET What shall I do?   Hic.  EM MA Hold your nose. 30.  HARRIET (holding her nose) About the letter. EMMA You must answer it, of course. HARRIET But what shall I say? Dear Miss Woodhouse, do advise me. EMMA (handing back the letter) Oh, no, no! The words must be your own. But you must be unequivocal. You must express gratitude, concern for the pain you are inflicting, and sorrow for his disappointment. She takes off the mocked-up coat and hands it to Mrs Ford, w ho curtseys and withdraws, glancing at Harriet dubiously as she does so. Harriet’s hiccups seem to have subsided. HARRIET You think I ought to refuse him. EMMA My dear Harriet, what do you mean? Are you in any doubt as to that? HARRIET I...I had no notion that he liked me so very much.   Hic.  EMMA I lay it down as a general rule, Harriet, that if a woman doubts as to whether she should accept a man or not,   she certainly ought to refuse him. But do not imagine that I want to influence you. HARRIET  Hic. .. Perhaps... it will be safer... Do you think I had better say ‘No’?   Hic.  EMMA Not for the world would I advise you either way. You must be the best judge of your own happiness. If you prefer Mr Martin to every other person;  (MORE)  31.",
      "characters": [],
      "action_text": "if you think him the most agreeable man you have ever met, why should you hesitate? HARRIET I have now quite determined, and really almost made up my mind– (tiny beat) -to refuse Mr Martin.   Do you think I am right?   Hic.  EMMA (with great relief) Perfectly, perfectly right, dear Harriet. While you were all in suspense I kept my feelings to myself, but now that you are decided, I have no hesitation in approving. I give myself joy of this. It would have grieved me to lose you. I could not have visited Mrs Robert Martin, of Abbey-Mill Farm! HARRIET You could not have visited me! The horror of this prospect has frightened the hiccups away. EMMA It would have been a severe pang to lose your acquaintance, but so it must have been. You would have thrown yourself out of all good society. I must have given you up. (beat- then, pleased) There. They’ve subsided.  INT. HARTFIELD GOLD DRAWING ROOM - DAY 36   36  Mr Woodhouse is directing Bartholomew and Charles, to position the folding-screens around him to block the draught. They are over-eager to please. They shut the front flaps, boxing him in completely. MR WOODHOUSE Not the- (protesting) It’s dark in here! Hurriedly, they unbox him again. He’s highly disgruntled-  EMMA (CONT'D)  32.  MR WOODHOUSE (CONT’D) How am I supposed to read in the dark? (beat- they’re flummoxed) Well, go and fetch a candle! They both set off running.  INT. HARTFIELD STAIRCASE ENTRANCE - LATER - DAY 37   37  Emma is descending the staircase when Mr Knightley steps in through the front door. He’s in a very good mood. MR KNIGHTLEY I just passed Miss Smith. EMMA She has gone home with a complaint. MR KNIGHTLEY Well, I am sorry to hear it; but I have reason to believe she will soon be feeling rather better. Mr Robert Martin sought my opinion yesterday-can you guess what about? Emma knows what’s coming. She goes through to the dining room, and Mr Knightley, still cheerful, follows. MR KNIGHTLEY (CONT’D) You will not guess? EMMA Mr Martin proposed to Har",
      "dialogue_count": 0,
      "word_count": 2768
    },
    {
      "scene_number": 4,
      "slugline": "EXT. RANDALLS - CHRISTMAS EVE - EVENING 51   51  Three carriages turn into the Randalls driveway. Mr Weston, beaming, comes out of the house to greet them. MR WESTON Welcome, welcome, welcome! OMITTED 52   52  41A.  INT. RANDALLS DRAWING ROOM - EVENING 53   53  A noisy scene of reunions, everyone talking at once: ISABELLA (to Mrs Weston) “Mrs Weston” is very well for every body else, but to me, you shall always be my dear Miss Taylor. MRS WESTON (to Isabella, smiling) And you, my dear Miss Woodhouse. How are the children? JOHN KNIGHTLEY (acidly, answering for Isabella) Multiplying. ISABELLA (to Mrs Weston) They are not at all well, I am sorry to say. Really we should never have travelled at such a time of year- Mr Wingfield expressly said- Meanwhile, Mr Knightley is talking to Mr Woodhouse: MR KNIGHTLEY How is your temperature, sir? Shall I ask to bank the fire? But Mr Woodhouse has been distracted by the conversation between Isabella and Mrs Weston. He addresses Isabella: MR WOODHOUSE We wanted you to visit in the autumn, Isabella. (to Mrs Weston) They went to South End. Isabella and Mrs Weston peel off with Mr Woodhouse. Mr Weston comes to greet Emma. MR WESTON How is poor Miss Smith? EMMA No better, I’m afraid. 42.",
      "characters": [],
      "action_text": "She’s addressing Mr Elton, who had been the first to take off his coat, and is poking about, examining the trinkets on the mantelpiece, and patently passing judgement on the room. MR WESTON Such a sad loss to our party today. (beat) Miss Smith has sent her apologies. MR ELTON She will be missed every moment. But in the next moment, he forgets her altogether: a servant appears with a tray of glasses of wine. He takes a glass. Meanwhile, Mr John Knightley is complaining to Mr Knightley. MR JOHN KNIGHTLEY Going in dismal weather to return probably in worse– four horses and four servants taken out for nothing but to convey five idle, shivering creatures into colder rooms and worse company than they might have had at home! Mr Elton’s lack of concern for Harriet bothers Emma, but before she can press him, Mr Weston has taken her arm: MR WESTON Frank has been detained at Enscombe, I am sorry to say. I had a letter from him just this morning- Mr Elton is left with the Knightley brothers. MR ELTON I dare say we shall have some snow. (beat) I was once snowed up at a friend’s house for a week! Nothing could be pleasanter. 42A.  MR JOHN KNIGHTLEY I cannot wish to be snowed up a week in Highbury. MR ELTON (misunderstanding him) Of course, we are but a small party. You are perhaps used to the large parties of London- MR JOHN KNIGHTLEY I know nothing of the large parties of London, sir; I never dine with anybody. Mr Elton is silenced. Mr Knightley is trying not to smile. He looks over and sees Mr Weston giving Emma a letter, evidently from Frank.  INT. RANDALLS DINING ROOM - LATER - EVENING 54   54  The others are talking in small groups in the drawing room. Emma is sitting alone in the dining room, which has already been set for dinner. She is re-reading the letter from Frank Churchill. Mr Knightley comes near. MR KNIGHTLEY Another fine flourishing letter, full of professions and falsehoods? EMMA Your feelings are singular. His letters seem to satisfy every body else. MR KNIGHTLE",
      "dialogue_count": 0,
      "word_count": 8897
    },
    {
      "scene_number": 5,
      "slugline": "EXT. HARTFIELD GROUNDS - DAY 94   94  Emma and Harriet are walking together, Emma very fast, Harriet struggling a little to keep up. EMMA Knightley! I could not have believed it. Knightley! Never seen him in her life before, and call him   Knightley ! She beheads a flower at the roadside, savagely. EMMA (CONT’D) And to discover that he is a gentleman! Upstart, vulgar being, with her Mr E, and her cara sposo- Mr Weston appears, beaming, wavin g a letter. MR WESTON Emma! The Churchills have settled at Richmond. We shall have our ball!  INT. HARTFIELD, EMMA’S ROOM - NIGHT 95   95  Harriet and Emma, in their nightgowns with their hair down, are practicing their steps. They are taking turns to lead each other around the room. HARRIET You dance so beautifully. She mucks up a step and they bump in to one another. EMMA No. You are Frank Churchill. Let’s do it again.  INT. CROWN BALLROOM - NIGHT 96   96  The space has been sweetly decorated, and really does look much better by candle-light. Musicians are already playing, and a small crowd is milling about. Emma and Harriet come in, marvelling at the transformation. But before Emma can enjoy the scene, Miss Bates comes in too- MISS BATES Well! This is brilliant indeed! This is admirable!  (MORE)  77.  Excellently contrived, upon my word- nothing wanting- could not have imagined- Miss Woodhouse, you must really have had Aladdin’s lamp! This is meeting quite in fairyland- such a transformation! Where shall we sit, where shall we sit? Anywhere where Jane is not in a draught. Where I sit is of no consequence... Mrs Elton has buttonholed Jane Fairfax and is talking with equal rapidity, over the top of Miss Bates: MRS ELTON How do you like my gown? I do not know whether it is not over- trimmed; I have the greatest dislike to the idea of being over- trimmed– quite a horror of finery. I must put on a few ornaments now, because it is expected. A bride, you know, must appear like a bride, but my natural taste is all for simplicity. Emma spots Frank Churchill nearby, talking to his father. EMMA Mr Churchill! He turns, and she goes to drop into a pretty curtsey, plainly rehearsed. But by the time she rises, Frank has already bowed curtly, and is making to move away. FRANK CHURCHILL Good evening, Miss Woodhouse. You will excuse me: I must inquire after good Miss Bates. He goes to speak to Miss Bates, leaving Emma confounded. MRS WESTON Emma! Emma turns. Mrs Weston is coming towards her, distressed. She is now six months pregnant. Mr Weston is by her side. His expression is also concerned.  MISS BATES (CONT'D)  78.",
      "characters": [],
      "action_text": "MRS WESTON (CONT’D) It has just occurred to us that Mrs Elton will expect to be asked to begin the ball- and she will surely think Frank ought to ask her. Emma glances at Mrs Elton, who is still talking to Jane- MRS ELTON And I see very few pearls in the room except mine. MR WESTON (to Emma) Frank cannot break his promise to you. He has promised you the first two dances! Here is the plan. I will ask Mrs Elton. The ball is in Frank’s honour, but it was my design. I will ask her. He hurries off to tell his plan first to Frank, who is still with Miss Bates, and then to Mrs Elton. Miss Bates is thrilled to be waited on by Frank. MISS BATES Such a noble fire, I am quite roasted! Mrs Weston turns to Emma, apologetic: MRS WESTON You must submit to stand second. EMMA A bride must be first in company. (beat- then, sardonic) It is almost enough to make me think of marrying. Mrs Elton comes over, having left Jane with Miss Bates. MRS ELTON Jane Fairfax is absolutely charming. I quite rave about Jane Fairfax. A sweet, interesting creature. So mild and ladylike- and with such talents! We must exert ourselves, Miss Woodhouse, and endeavour to do something for her. Such talents as hers must not be suffered to remain unknown. 79.  Miss Bates, meanwhile, is showing Jane off to any and all who will listen: MISS BATES How do you like Jane’s hair? She did it all herself. Quite wonderful. No hairdresser from London I think could... Just then Mr Knightley enters. He catches Emma’s eye, and smiles at her, kindly, naturally. She returns the smile, a little sadly. Already the evening feels a little spoiled. Mr. Weston is trying to get a word in with Mrs. Elton. At   *  last he manages-   *  MR WESTON   *  Mrs. Elton! Such an honourable   *  addition to our humble festivities-   *  MR ELTON   *  (interposing)   *  And so fashionable.   *  MR WESTON   *  Quite. Would you grant me the   *  infinite pleasure of leading us all   *  in the first dance?   *  She accepts, and is led to the top of t",
      "dialogue_count": 0,
      "word_count": 1304
    },
    {
      "scene_number": 6,
      "slugline": "INT. CROWN BALLROOM - LATER - NIGHT 98   98  The second dance comes to an end. Mr Weston escorts Mrs Elton back to Mr Elton, and Frank immediately asks Harriet if she would like to dance the third dance with him, leaving Emma and Mr Knightley both without partners. They both step aside. Emma comes to speak to him at the side of the room. EMMA Thank you. For your kindness to Harriet. MR KNIGHTLEY He was unpardonably rude- and he aimed at wounding more than Harriet. EMMA I was completely mistaken in Mr Elton. There is a littleness about him which you discovered, and which I did not. I was fully convinced of his being in love with Harriet. Mr Knightley glances at her. Then, kindly: MR KNIGHTLEY You would have chosen for him better than he has chosen for himself. Harriet Smith has some first-rate qualities, which Mrs Elton is totally without. She does you credit, Emma, as you do her. This warms Emma’s heart more than she can say. Mr Weston is trying to rouse everybody to dance again. MR WESTON Come, Miss Woodhouse, Miss Gilbert, Miss Fairfax, what are you all doing? We must dance another set. Come Emma, set your companions an example. They are lazy! They are all asleep! EMMA (laughing) I am ready, whenever I am wanted. Mrs Elton has been trying to coax her husband on to the dance floor. He has to explain in a whisper that he can’t dance. Mrs Elton responds furiously, and in the skirmish, we hear- 82.  MR ELTON (in a furious whisper) I am   not   embarrassing myself! MR KNIGHTLEY Whom are you going to dance with? EMMA With you, if you will ask me. MR KNIGHTLEY Will you? EMMA Indeed I will. You have shown that you can dance, and we are not really so much brother and sister as to make it improper. MR KNIGHTLEY (laughing) Brother and sister! No indeed. He holds out his hand, smiling, and she takes it.  INT. CROWN BALLROOM - LATER - NIGHT 99   99  They go hand in hand to the top of the floor. The music strikes up; they bow and curtsey, then begin to dance. Mr Knightley never breaks eye contact. At first he’s smiling, and Emma is too. But as the dance goes on, their smiles fade, and their breath shortens. They are looking openly at one another for the first time in their lives.  EXT. CROWN INN - DAWN 100   100  The ball has lasted until dawn, and the guests are only just leaving. Emma exits to where the coachmen, now very tired, are waiting by the carriages to take people home. She looks around for Mr Knightley before she gets in, but can’t see him. James helps her into the carriage and shuts the door, and the carriage drives off- -just as Mr Knightley comes to the door. He looks after the departing carriage, tortured. Has he missed his moment to tell Emma how he feels? Suddenly decisive, he sets off after the carriage. OMITTED 101   101  83.",
      "characters": [],
      "action_text": "OMITTED 102   102  OMITTED 103   103  INT. HARTFIELD GREAT HALL - DAWN 104   104  The hall is deserted: the servants are still in bed. Emma steps in taking off her gloves. She is confused.  INT. HARTFIELD, UPPER CORRIDOR - DAWN 105   105  Emma is going upstairs, but she’s too restless to sleep. She flops down on a window-seat, still thinking about the ball... and then she turns to the window, and sits up: Mr Knightley is approaching outside. He sees her through the glass and falters. They hold each other’s gaze for a beat. Her breath catches- why has he come? Then she leaves the window seat and runs downstairs.  EXT. HARTFIELD COURTYARD - DAWN 106   106  She exits to meet him. But when he sees her, all his confidence fails. He can’t think of what to say, and she can’t either. A beat- and then Emma sees, over his shoulder, Frank Churchill, who is hurrying towards her, carrying Harriet. Mr Knightley turns too. EMMA Mr Churchill! What has happened? FRANK CHURCHILL (out of breath) She was set upon by gypsies as she was coming home- when she attempted escape, she fell. She had a cramp- HARRIET (weakly heroic) From too much dancing. EMMA Is she hurt? MR KNIGHTLEY Her ankle. 84.  FRANK CHURCHILL I did not see it; I arrived moments after, and brought her here- I could think of no other place. HARRIET It was on account of the scissors. EMMA The scissors? FRANK CHURCHILL (a little embarrassed) I had borrowed a pair of scissors from Miss Bates. I was halfway home to Richmond when I made the recollection, and so doubled back. (defensive, to Mr Knightley) What’s your purpose here? MR KNIGH TLEY (lying) My carriage- my horse threw a shoe. EMMA (surprised) You took your carriage to the ball? MR KNIGHTLEY I- HARRIET What might have become of me, Miss Woodhouse, if not for the scissors! Something about this story seems strange to Mr Knightley. He looks sharply at Frank, and then at Emma. But there’s no time to ask for more information: they have reached the house. Mr Knightley holds",
      "dialogue_count": 0,
      "word_count": 2049
    },
    {
      "scene_number": 7,
      "slugline": "INT. DONWELL, DOUBLE CUBE - DAY 112   112  The dust sheets have been taken away, and the chandeliers unbagged. The place looks splendid, though still very like a museum. The party- Jane Fairfax, Miss Bates, Emma, Harriet, Mr Woodhouse, Mr and Mrs Weston, Mr and Mrs Elton, and Mr Knightley- file through the entrance to the double cube and break off in to pairs to look around the Picture Gallery. MISS BATES (to Jane) Do you not feel transported? I can hardly believe that we remain in England. I have never set my foot beyond the Abbey Mill. Once my dear father, your dear grandpapa, ventured to Bath on a clerical errand, and I was to accompany him, but the night before his going I was struck down by fever and so I did not go. He brought me back a jet brooch as a memento- I have it still. Bath I hear is a great metropolis. Every face a stranger! But you know a great deal more of the world than I. You have been to Ireland, and to Weymouth. (gesturing at a picture) Now Jane. This is just how I fancy Mr Dixon. Exactly with this look. Am I right? JANE FAIRFAX Quite wrong, my dear aunt. There is no likeness at all. She disengages and moves away to join Mr Knightley. MISS BATES Very odd! But one never does form a just idea of any body beforehand. One takes up a notion, and runs away with it... She realises that she’s alone and bustles off to join the Westons. Mrs Elton, standing with Mr Elton, sees Mr Woodhouse approaching on his own, and says to her husband- MRS ELTON Here comes this dear old beau of mine, I protest! I like him excessively.  (MORE)  91.  His quaint, old-fashioned politeness is much more to my taste than modern ease; modern ease often disgusts me. Mr Weston, meanwhile, is enthusing to Mrs Weston and Miss Bates- MR WESTON Now Enscombe is fine- the rooms are large- but there is no collection such as this... Emma and Harriet are looking at the pictures together. Emma glances at Mr Knightley and Jane, feeling jealous. Jane moves away, and Mr Knightley comes over to Emma and Harriet. Emma expects he’s going to speak to her, but: MR KNIGHTLEY There is a fine prospect from the south window, Miss Smith. May I escort you? Flushing with pleasure, Harriet follows him into the adjacent room. Emma stays where she is. She looks up at the vast panelled wall of pictures, all landscapes and seascapes, vistas of countries and places she has never seen. Lost in thought, she moves down the hall, looking at each picture. But then- JANE FAIRFAX Will you be so kind, when I am missed, to say that I am gone home? Emma turns in surprise. Jane looks stressed. The room has emptied and they’re now alone. EMMA Certainly, if you wish it; but you are not going to walk to Highbury alone? A beat. Jane seems on the verge of disclosing something. EMMA (CONT’D) Are you unwell? JANE FAIRFAX (with rare directness) Miss Woodhouse, we all know at times what it is to be wearied in spirits. Mine, I confess, are exhausted.  MRS ELTON (CONT'D)  91A.",
      "characters": [],
      "action_text": "Again she seems on the verge of saying something more. But she just curtseys and departs, leaving Emma mystified. 91B.  INT. DONWELL ABBEY, SINGLE CUBE / HALL OF STATUES 113   113  - LATER - DAY  Miss Bates is now walking with her mother. MISS BATES Such treasures- so unlike anything- behold, the continent has come to us! Mother, if each could speak, how silent we would be, how fervidly we would listen! Such wonders. One’s very spirit soars. One feels a kind of- is not Mr. Knightley kind to open up his great house- and so very discerning, with such an eye- magnificent specimen! I am quite transported. I fancy myself in an altogether different- even to speak the names- France! Italy! Prussia! It is too thrilling. Such exotic delights. Emma diverts her course to avoid Miss Bates, and comes face to face with Frank Churchill. He’s looking very hot and bothered. FRANK CHURCHILL Have I missed the party? EMMA Not at all. We are exploring the house. Frank Churchill mops his face and paces. He’s very cross. FRANK CHURCHILL I was detained by my aunt. A nervous seizure, which lasted some hours. Had I known how hot a ride I should have, I believe I should not have come at all. EMMA You will soon be cooler, if you sit down. FRANK CHURCHILL As soon as I am cooler I shall go back again! You will all be going soon; the party is breaking up. EMMA You need refreshment. Some cold beer perhaps. 92. She addresses this to a servant, who bows and withdraws. Emma moves off. Frank, pacing, follows her. FRANK CHURCHILL As soon as my aunt gets well, I shall go abroad. I am tired of doing nothing. I want a change. (she glances at him) I am serious, Miss Woodhouse, whatever your penetrating eyes may fancy. I am sick of England. I would leave it tomorrow, if I could. EMMA You are sick of prosperity and indulgence.  (MORE)  92A.  Cannot you invent a few hardships for yourself, and be contented to stay? FRANK CHURCHILL You are quite mistaken. I do not look upon myself as either prosperous or indul",
      "dialogue_count": 0,
      "word_count": 1136
    },
    {
      "scene_number": 8,
      "slugline": "EXT. BOX HILL - A LITTLE LATER - DAY 115A   115A  A little later. Everyone is seated. Frank Churchill is lying on his back with his ankles crossed and his hands behind his head. He turns to Emma, who is seated next to him. FRANK CHURCHILL How much I am obliged to you, for telling me to come today! I had quite determined to go away again. EMMA Yes, you were very cross. I was a kinder friend than you deserved. FRANK CHURCHILL Don’t say I was cross. I was fatigued. The heat overcame me. EMMA It is hotter today. FRANK CHURCHILL Not to my feelings. I am perfectly comfortable today. EMMA You are comfortable because you are under command. FRANK CHURCHILL Your command? Yes. Mr Knightley looks very sour at this comment. Emma darts a pained look at Harriet, but Harriet doesn’t look concerned. She’s making a daisy chain and is preoccupied. EMMA (shortly) I meant self-command. She bats away a fly. His conversation is annoying her a bit: she senses that he’s toying with her in some way, but she doesn’t know why. Frank Churchill senses her annoyance, lowers his voice mischievously, and rolls over: FRANK CHURCHILL Our companions are excessively stupid. What shall we do to rouse them? Any nonsense will serve. (loudly, to the group)  (MORE)  94.  Ladies and gentlemen, I am ordered by Miss Woodhouse to say- that she desires to know what you are all thinking of. The party looks at him. Miss Bates and Harriet smile nervously; Mr Weston, anxious as always to think the best of Frank, attempts a jolly laugh. But the others are po-faced. MISS BATES (anxiously) Oh dear. What we’re thinking of! MR KNIGHTLEY (icy) Is Miss Woodhouse sure that she would like   to hear what we are all thinking of? EMMA Oh- no, no, upon no account in the world. It is the very last thing I would stand the brunt of just now. MRS ELTON It is a sort of thing which I should not have thought myself privileged to enquire into. As the chaperon of the party. MR ELTON Very true, my love, very true- but some ladies say anything. Better pass it off as a joke. Everybody knows what is due   to you. FRANK CHURCHILL (to Emma) It will not do. They are most of them affronted. I will attack them with more address. (getting up on his knees) Ladies and gentlemen– I am ordered by Miss Woodhouse to say, that she waives her right of knowing what you may be thinking of, and only requires something entertaining from each of you. She demands either one thing very clever, or two things moderately cleve r, or three things very dull indeed, and she engages to laugh heartily at them all.  FRANK CHURCHILL (CONT'D)  95.",
      "characters": [],
      "action_text": "He is so preposterous that Emma can’t help but laugh. MISS BATES Oh! Very well, then I need not be uneasy. ‘Three things very dull indeed’. That will just do for me, you know. I shall be sure to say three dull things as soon as I open my mouth. EMMA Ah! Ma’am, but there may be a difficulty. You will be limited to number– only three at once! She had meant it lightly, gaily, in continuation of Frank Chu rchill’s outrageousness, but Miss Bates recoils as if she had been slapped. Her eyes fill with tears. MISS BATES Ah– well– to be sure– yes, I see what she means. I will try to hold my tongue. Emma is appalled at herself. But how can she patch it up? She glances at Frank, but he has turned away, smothering a cruel smile in private satisfaction at Miss Bates’ shame. MR WESTON (oblivious to the tension) I   like your plan. Agreed, agreed. I will do my best. I am making a conundrum. How will a conundrum reckon? FRANK CHURCHILL Low, I am afraid, sir, very low, but we shall be indulgent, especially to anyone who leads the way. EMMA (trying now to be kind) No, no, it will not reckon low. Come, sir. Pray, let us hear it. She glances at Harriet, seeking help, but Harriet is looking at Miss Bates, who is discreet ly wiping away tears. MR WESTON I doubt it’s being very clever myself. It is too much a matter of fact, but here it is.  (MORE)  96.  What two letters of the alphabet are there, that express perfection? EMMA What two letters– express perfection! I am sure I do not know! Her eagerness to know the answer is feigned. She darts another nervous glance at Miss Bates, feeling awful. MISS BATES (to Mr Knightley, quietly) I must have made myself very disagreeable, or she would not have said such a thing to an old friend. MR WESTON Ah! You will never guess. You, I am certain, you will never guess. I will tell you. M and A. Em-ma. Do you understand? Frank laughs. But nobody else does. Emma feels dreadful: to be praised right after having been so cruel! She manages only a pained sm",
      "dialogue_count": 0,
      "word_count": 3577
    },
    {
      "scene_number": 9,
      "slugline": "EXT. ABBEY MILL STABLES - DAY 130   130  Robert Martin watches Emma approach with astonishment. A beat, neither of them really sure who is going to speak first. Then: EMMA Mr Martin. I have a confession to make. (beat- haltingly) I have caused you great suffering, as I have also caused the suffering of my friend- (correcting herself) -my dearest friend. A little later. Emma returns down the hill to the carriage. Robert watches her go, then turns and looks at Emma’s gift basket. He notices a roll of canvas, tied with string, that has been inserted into the spray of lavender at one end. He crosses to it, pulls off the ribbon, and unrolls it. It’s Emma’s painting of Harriet, cut from the frame.  EXT. HIGHBURY LANE - DAY 131   131  Emma is walking down the road on foot. She’s alone. She comes around a bend and sees Frank and Jane, both dressed in mourning. They curtsey and bow automatically, but then they all hesitate. Nobody is sure who should speak first, or what they should say. Frank braves it: FRANK CHURCHILL Is it possible you had no suspicion? EMMA Never the smallest, I assure you. FRANK CHURCHILL I wish I had told you everything. I was once very near. EMMA It is not now worth the regret. She goes to keep walking. But Frank is still trying to apologise. FRANK CHURCHILL What an impudent dog I have been. How could I dare. 110-111.  EMMA I do suspect you had very great amusement in tricking us all. She steps around them and goes to continue walking. Jane finds the courage to speak at last. She leaves Frank and hurries anxiously after Emma. JANE FAIRFAX Miss Woodhouse. I am so sorry. I have not time for half of what I wish to say. EMMA You owe me no apologies. JANE FAIRFAX You are very kind, but I know what my manners were to you. So cold and artificial! I had always a part to act. It was a life of deceit. I know that I must have disgusted you. Frank is hovering, just out of earshot. Emma glances at him. EMMA (thoughtfully) I think there is a little likeness between myself and Mr Churchill. If not in our dispositions, then perhaps, in our destiny. We shall both marry people far, far better than ourselves. Jane is gratified by the compliment, but she doesn’t quite understand Emma’s meaning. JANE FAIRFAX You have a secretive engagement? EMMA If I had, Miss Fairfax, then be assured: Frank Churchill should be the very last to know. Jane allows herself a little smile. Emma takes Jane’s hand and presses it. For the first time in their acquaintance, they both feel as if they might become friends. 110-111A.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 463
    },
    {
      "scene_number": 10,
      "slugline": "INT. HARTFIELD, EMMA’S ROOM - DAY 132   132  Emma comes in to find Harriet waiting for her. The dynamic of Harriet’s first arrival at Hartfield is entirely reversed: this time Emma is apprehensive, Harriet cool and controlled. EMMA Harriet. HARRIET Mr. Robert Martin has offered me his hand. (beat) I have accepted him. It’s unbelievably tense. Harriet is testing her. EMMA Then he is the most fortunate man of my acquaintance. But still Harriet doesn’t smile. A beat, then: EMMA (CONT’D) Harriet. But Harriet has something to say. HARRIET There is something else. I have had a letter from my father. Now that I have come of age, he has revealed himself. He is a tradesman. In Bristol. He makes galoshes. He comes to Highbury next week on purpose to meet with me. It’s the final test: will Emma baulk at her now? But Emma doesn’t flinch. EMMA I hope that you will bring him to Hartfield. Harriet’s eyes flood with tears. Emma is overcome. She crosses the room to her, and hugs her tight. 112.  INT. HARTFIELD GOLD DRAWING ROOM - NIGHT 133   133  Mr Woodhouse, Mr Knightley and Emma are all in their habitual places, reading- except that Mr Knightley and Emma can’t concentrate, and keep stealing glances at one another. MR WOODHOUSE (suddenly) Do you feel a draught, Mr Knightley? About your knees? MR KNIGHTLEY I cannot say that I do, sir. MR WOODHOUSE Ah. Pity. But then Mr Knightley has an idea. Suddenly: MR KNIGHTLEY In fact- yes, sir. A chill draug ht. MR WOODHOUSE (instantly galvanised) A chill- the screen, the screen! Bartholomew! Make haste! Bartholomew rushes to unfold it. But Mr Knightley has been cunning: Mr Woodhouse is now blocked from view. Mr Knightley can reach over and take her hand. EMMA (in a whisper) How can I ever leave him? MR KNIGHTLEY (also whispering) He can remove with you to Donwell. Mr Woodhouse is directing Bartholomew to the wi ndow to stuff handkerchiefs into the cracks, observing anxiously to make sure it’s done correctly. Emma and Mr Knightley are still whispering. EMMA You know he never would. He could not stand it. MR KNIGHTLEY Then I shall come here. EMMA You would quit the Abbey? 113.",
      "characters": [],
      "action_text": "MR KNIGHTLEY Yes. EMMA Sacrifice your independence? MR KNIGHTLEY Yes. 113A.  EMMA Live constantly with my father, in no house of your own? MR KNIGHTLEY Yes. MR WOODHOUSE (O.S.) How it is now, Mr Knightley? MR KNIGHTLEY (with his eyes on Emma) It’s much better now. And at last, they kiss. OMITTED 134   134  114. OMITTED 135   135  INT. HIGHBURY PARISH CHURCH - A DAY IN MIDSUMMER 135A   135A  There are considerably more people present than at the Westons’ wedding nine months earlier. Harriet and Robert Martin are there; so is Mrs Goddard and her gaggle of schoolgirls. Isabella and John Knightley, overwhelmed by children as always, fill the Woodhouse pew. Frank Churchill and Jane Fairfax are sitting with the Westons. Mrs Weston has a baby in her arms. Miss Bates sits with her mother. Mrs Elton is in the front row. Mr Elton is waiting uncomfortably to the side of the altar. Mr Knightley is standing at the altar, nervous, facing front. The bells start to peal, and the congregation rises. Emma and Mr Woodhouse appear at the door of the church. Mr Woodhouse is a little tearful. He sniffs. Emma turns to him, anxious. EMMA Papa! Are you unwell? MR WOODHOUSE Unwell? What a ridiculous question. They process down the aisle. Emma looks radiant, and even Mr Woodhouse looks happy. Mr Knightley can’t help but turn to sneak a glance at her. Mrs Elton wants the last word. As Emma and Mr Woodhouse pass, she turns around and says, to Miss Bates: MRS ELTON You know, I made that match myself. Mr Knightley only has eyes for Emma. She joins him at the altar, and wordlessly he reaches out and takes her hand.  The End  115.",
      "dialogue_count": 0,
      "word_count": 662
    }
  ]
}