{
  "slug": "enough-said-2013",
  "title": "enough said",
  "genre": "romance",
  "format": "film",
  "scenes_count": 16,
  "characters_count": 0,
  "characters": [],
  "total_words": 14697,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. HOLLYWOOD APARTMENT BUILDING - DAY Eva, 45 and attractive, gets out of her old Prius, takes out a large massage table and proceeds to carry it to the apartment building. She’s wearing sweatpants and sneakers, ready for work. INT. HOLLYWOOD APARTMENT - DAY A middle aged man, MARTIN, is enjoying his massage. Face up, gaping mouth and utterly relaxed, Eva works on his neck and shoulders from behind him. MARTIN Oh, yeah, right there, my neck. Perfect. EVA Take a deep breath and hold it a minute. (he does) Now, exhale. He lets out a long exhale and Eva almost falls over from his BAD BREATH. She has to back up. EVA (CONT’D) Good... MARTIN Should I do it again? EVA No, no. One is good. INT. BRENTWOOD HOUSE/BEDROOM - DAY Eva gives a massage to CYNTHIA, 35, who lies face down. Despite the soothing music, Cynthia talks loudly and constantly. CYNTHIA She brought cupcakes, I brought cake pops, and she goes “they’re the same thing” but they’re not the same thing because a cupcake is a cupcake, a cake pop is a cake with a stick in it. Anyway, the real issue is her daughter because she’s not very smart whereas my daughter Anna...",
      "characters": [],
      "action_text": "Cynthia rolls over, continuing to talk. When she’s on her back Eva closes Cynthia’s eyes. EXT. YOUNG MAN’S HOUSE - ANOTHER DAY Eva lugs her large massage table up the stairs to an apartment. It’s heavy and clumsy. The front door (at the top of the stairs) opens up and HAL, 30, greets her. HAL Hey Eva. Come on up! He smiles and watches her struggle up the stairs, not helping. EXT. EVA’S HOUSE - NIGHT A cute, well kept bungalow type place. INT. EVA’S HOUSE/BEDROOM - NIGHT Eva is at her mirror putting on lipstick. Her daughter ELLEN, 18 and cute, comes in returning a necklace to the dresser. ELLEN Hey mom. Where are you going? EVA To a party with Sarah and Will so they don’t have to be alone. (beat) You want to come? ELLEN Why? EVA Because you’re leaving soon and we should hang out. ELLEN I’m good. She heads back into her own room.  ENOUGH   SAID   2",
      "dialogue_count": 0,
      "word_count": 369
    },
    {
      "scene_number": 2,
      "slugline": "INT. WILL’S NEW PRIUS - NIGHT Will (42) drives. His wife Sarah (40) sits beside him putting on some makeup. Eva listens from the backseat as they explain something to her. WILL We can never find anything. SARAH She puts things in the weirdest places. Like, if I leave my bracelets on the kitchen counter she’ll put them in a drawer in the kitchen. (to Will) Why can’t you just do it? WILL I always do it. I fired the gardener. It’s not fair. SARAH (to Eva) We want to fire her but he won’t do it. (to Will) It’s not hard for you. Why does it have to be   fair?  WILL You should do it   because   it’s hard for you. SARAH Oh,   please.  WILL Come on Sarah, grow up. You can fire a maid. SARAH Is that the definition of maturity? Being able to fire your friggin’ maid? EVA (leaning forward, showing her lipstick) Sarah, does this color look good on me? SARAH You look good. Pretty. WILL That’s nice. Nice look.  ENOUGH   SAID   3",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 177
    },
    {
      "scene_number": 3,
      "slugline": "EXT. PALISADES HOUSE - NIGHT Will, Sarah and Eva scan the large party and the beautiful back yard. EVA So whose party is this? WILL Well, he’s a big book agent and she’s an interior designer. They know everyone. SARAH Maybe there’s single men here. Oh shit, I see a patient. EVA What are you going to do? SARAH I don’t know. Ignore her until I can’t. EVA Show me. Introduce me! SARAH No way. EVA You’re a wet blanket. Oh, I see someone from my gym. Eva wanders off to say Hi to the gym woman, HILARY. She’s standing with another very attractive and stylish woman, MARIANNE. Both are mid 40’s. HILARY Eva - hi. This is Marianne. This is Eva. Eva’s a fabulous masseuse. MARIANNE Oh! Nice to meet you. HILARY Oh, will you guys excuse me for a sec? I’ve got to find a bathroom. She walks off leaving Marianne and Eva alone. EVA That was abrupt.  ENOUGH   SAID   4",
      "characters": [],
      "action_text": "EVA (CONT’D) Wow, I love what you’re wearing. Your dress, and your shoes and your purse. MARIANNE Oh, thanks. Gee, I should bring you everywhere. I love   your   outfit. So, you’re a masseuse. And you’re good? EVA I am. EVA (CONT’D) What is it that you do? MARIANNE I’m a poet. EVA And I’m a dreamer. MARIANNE No. Really. EVA Oh. You - you’re really a poet? MARIANNE I am. EVA And you make a living? MARIANNE I do! EVA You’re a poet. Now I know it. MARIANNE Good one. EVA Feel free to steal it! ANGLE ON Will standing alone, drinking. Eva walks up. EVA (CONT’D) I think I just got a new client.  ENOUGH   SAID   5 WILL Where? Eva points. They see Marianne being fawned over by a COUPLE OF GUESTS. WILL (CONT’D) She looks clean. EVA She’s really nice. And funny. Great taste. WILL And extremely attractive. EVA You think every woman at this party is attractive. WILL Pretty much. Eva looks around. EVA There is not one man here that I’m attracted to. Just then TWO MEN approach Will. One is JASON, 50. JASON Will, didn’t know you’d be here! WILL Hey Jason. This is my friend Eva. JASON Hi. This is Albert. They all shake hands. ALBERT is 45 and has a bit of a belly. EVA Nice party, huh? Lots of white balls hanging down. WILL Eva was just telling me that there’s not one man at this party that she’s attracted to.  ENOUGH   SAID   6 EVA Okay! I don’t know why you would make that announcement? ALBERT Is that unusual? EVA No, not unusual at all. And no offense. ALBERT (joking) That’s okay, I’m not attracted to anyone here, either. EVA Okay. Good. Yeah, it’s kind of an ugly crowd. WILL (making conversation) Jason, you’ve got a kid in college now, right? JASON Two. ALBERT I’ve got one leaving in the fall. EVA So do I. ALBERT It’s all I have. EVA Me too! JASON Oh come on, you guys. You want your kids to go away! It’s healthy! EVA Shut up. ALBERT Yeah, shut up. Albert looks at Eva, clearly charmed.  ENOUGH   SAID   7",
      "dialogue_count": 0,
      "word_count": 526
    },
    {
      "scene_number": 4,
      "slugline": "INT. PRIUS - NIGHT Sarah and Will drive home from the party, Eva is in the backseat. WILL Do all the guys get boners? EVA No. SARAH Haven’t we been over this? EVA Yes. WILL Massages make me nervous. I spend the whole time afraid I’m gonna get a boner. SARAH You are? WILL So, do they hit on you? EVA You know you’re starting to depress me. They don’t get boners and they don’t hit on me. WILL So, who do you massage? It must be so strange. EVA I’ve got a guy who’s got like a hundred stairs to his house and he never helps me with my massage table. WILL Did you ever ask him to? EVA AND SARAH I/She shouldn’t have to! She gets out of the car. EVA Bye guys. Love you.  ENOUGH   SAID   8",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 141
    },
    {
      "scene_number": 5,
      "slugline": "EXT. EVA’S HOUSE - NIGHT Eva gets out of the car, walks up to the house and opens her front door. INT. ELLEN’S ROOM - NIGHT Ellen is asleep in her bed. Eva enters and stares at her child for a long, long time. It’s unfathomable how much she loves this person. EXT. THE JOURNEY SCHOOL - MORNING Eva’s car pulls into the parking lot. Ellen and Chloe get out and immediately they trot off with THREE FRIENDS. ELLEN Bye mom! EVA (out the window) Have a good day honey. CHLOE Bye Eva, thanks for the ride! EVA Oh, you’re welcome Chloe. Eva sees TWO OTHER GIRLS, MADDY and SAGE, dressed way too sexy, drop trash on the ground. EVA (CONT’D) Hey. Maddy Price! You littered. Maddy turns and dead pans to Eva. MADDY (in English accent) Excuse me, what did you say? EVA Pick up your trash. You’re not British. Maddy picks up her trash. MADDY What a bitch.  ENOUGH   SAID   9",
      "characters": [],
      "action_text": "As Eva drives away - EXT. MARIANNE’S SANTA MONICA HOUSE - DAY Eva carries her massage table up to this beautiful Spanish house. It’s not big, but it’s special. INT. MARIANNE’S HOUSE - DAY Bringing the table into the house, Eva admires the beautiful place. It’s eclectic, colorful, creative, personal, perfect. Fresh flowers everywhere, amazing art. Marianne wears a casual but chic outfit. MARIANNE Come on in. Would you mind removing your shoes? EVA No problem. MARIANNE And your socks too? EVA Sure. MARIANNE Would you like some ice tea? Eva takes off her shoes and socks as Marianne slips into the kitchen. She then appears with a glass of iced tea. EVA Oh yeah, that sounds good. I’m so glad you called. So many people take my card just to be polite! MARIANNE Well, I’m not polite! EVA (looking around) Wow, this is soooo pretty! Can I live here? (sipping ice tea) And this tea is kind of fabulous!  ENOUGH   SAID   10",
      "dialogue_count": 0,
      "word_count": 327
    },
    {
      "scene_number": 6,
      "slugline": "INT. MARIANNE’S LIVING ROOM - LATER Eva is working on Marianne while she lies on her back. Soothing music plays. INT. MARIANNE’S LIVING ROOM - LATER Eva is putting her table back together while Marianne wears casual clothes and sits on the couch. They’re mid conversation. MARIANNE I’m dating this guy and he has no sense of humor. EVA Could be a deal breaker. MARIANNE Right? I don’t know what to do because he’s very sweet. EVA Sweet can be good. Find someone else to tell you jokes. MARIANNE Are you married? EVA Divorced. For ten years. MARIANNE Are you guys still friends? EVA Not really. We share a daughter. Other than that it’s hard to believe I ever had a laugh with the guy, let alone create a child. MARIANNE I know what you mean about your ex. We have zero in common. I don’t know how I ever had a real conversation with him. EVA Crazy, isn’t it?  ENOUGH   SAID   11",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 164
    },
    {
      "scene_number": 7,
      "slugline": "EXT. MARIANNE’S HOUSE - DAY Eva is putting her massage table in her car while Marianne clips herbs in her front yard. MARIANNE I’ll call you really soon. This left shoulder is still so tight. EVA You ought to ice it tonight. And drink lots of water. Stay hydrated. MARIANNE I will. Thank you again. I’m so glad I met you! Oh, want some chervil? I’m drowning in it. She hands her some herbs. INT. EVA’S HOUSE/KITCHEN - DAY Eva sits in her kitchen eating lunch, VIDEO CHATTING WITH SARAH. EVA What the Hell is chervil? She said she was drowning in it. SARAH An herb. (in American accent) An herb. How long have you known me? EVA I can’t understand a goddamned thing you ever say. EVA (CONT’D) The furniture was gorgeous. I wanted everything in there. INT. SARAH’S OFFICE - DAY Sarah sits at her desk (in her therapy office) VIDEO CHATTING. EVA She has no cellulite.  ENOUGH   SAID   12",
      "characters": [],
      "action_text": "SARAH How can that be? EVA I don’t know! There’s nothing! SARAH Anyway, Will said that some guy you met at the party wants your number! Jason’s friend I think. Eva smiles, in spite of herself. EVA But we both admitted we weren’t attracted to each other. (beat) What should I do? He’s kind of fat. SARAH He is? EVA He’s got this big belly. SARAH Oh, come on. You have nothing to lose. EVA No, but he does. Ha Ha Ha. Sarah just stares at her. Suddenly Eva notices the little light on the wall go on behind Sarah. EVA (CONT’D) Your patient just arrived. (beat) What if you never went out there. Would they just - (motions to shoot herself)? Oh, was that inappropriate? EXT. TRAGICALLY HIP RESTAURANT - NIGHT TWELVE PEOPLE wait for a table outside a nondescript, store- front restaurant. Loud music blasts out onto the street from inside. Albert and Eva stand in front with the others, making conversation. Everyone around them is YOUNG.  ENOUGH   SAID   13 ALBERT I’m sorry about this. I swear I made a dinner reservation. EVA Oh. That’s okay. (beat) What about you? What do you do? ALBERT I work at The American Library of Cultural History. EVA The what? ALBERT Exactly. It’s basically a television library. EVA (concerned) You watch a lot of TV. ALBERT (smiles) No, no. Television history. What’s on now? I have no clue. I tried to watch a Housewives of Idiot Town and I wanted to jump off a building. EVA I watched one of those shows with my daughter once and I couldn’t believe it. They had no brains. And they all had fake cheekbones. And fake boobs. (beat) You like fake boobs? ALBERT I like real boobs. EVA I got real boobs. ALBERT (awkward pause) Well, that’s working out for us then.  ENOUGH   SAID   14",
      "dialogue_count": 0,
      "word_count": 474
    },
    {
      "scene_number": 8,
      "slugline": "INT. TRAGICALLY HIP RESTAURANT - LATER They’re mid meal and haven’t run out of things to say. They have to shout to be heard. EVA How long have you been divorced? ALBERT About four years. EVA And was it mutual? ALBERT (embarrassed) Not really, no. EVA Uh uh. (beat) And can I get her number? ALBERT Of course. EVA Imagine the time it would save. ALBERT Sometimes I think we should all just wear signs around our necks. Get it all out there. EVA What would yours say? ALBERT I don’t know. I’m a slob? I have ear hair? EVA You know there’s ways to get rid of ear hair. ALBERT Fully aware. Taken care of. EVA A slob, huh?  ENOUGH   SAID   15",
      "characters": [],
      "action_text": "ALBERT Not the dirty, hoarder kind, just the normal kind. EVA Does your daughter live with you? ALBERT Half the time. EVA Does she mind your normal kind of mess? ALBERT I’m not that bad. But both she and her mother are very neat. They love that store - Christ - the empty box store? EVA The Container Store? ALBERT A whole store that sells crap to put your crap in so you can buy more crap. EVA I love that store. I love crap! ALBERT So did my ex wife. And she put it in very flowery and overpriced boxes. EVA They sell those in some manly designs, you know. ALBERT Manly designs? EVA Yeah, browns. Little cowboys. ALBERT Little cowboys? Well, if they did, my wife would have bought them for me because she tried very hard to domesticate me. EVA Living with someone else is   not   easy. Peoples habits.  ENOUGH   SAID   16 ALBERT Listen to this - (beat) I don’t like onions in my guacamole, right? So I would take a chip and kind of swirl it around until the onions were all on one side and then I could eat it. It drove her bananas. EVA Seems kind of harmless. ALBERT Completely. But by the end of our marriage it made her gag. EVA Well, that’s not nice. He notices her hands. ALBERT You have - um - lovely hands. EVA Oh. Thank you. ALBERT I would have thought - since you’re a masseuse that you would have big, manly hands but they’re actually very lovely. EVA (awkward) You have nice hands too. ALBERT (embarrassed) Thank you. EVA They’re kind of like paddles. (beat) Did they just turn the music louder? ALBERT No, I think you just got older. Eva flags down a WAITER. EVA Excuse me, could you turn the music down a little bit? I’m old.  ENOUGH   SAID   17 WAITER No, I’m sorry. EVA Are you sorry that I’m old, or that you won’t turn the music down? WAITER We can’t change the volume. The waiter walks away. EVA He’s nice. ALBERT I find I don’t like younger people. EVA (with her hand to her ear) Eh? ALBERT I’m sorry.   I picked the wrong restaurant. EVA Oh I’m having a great time. The food is ",
      "dialogue_count": 0,
      "word_count": 2732
    },
    {
      "scene_number": 9,
      "slugline": "INT. SARAH’S LIVING ROOM - DAY Sarah and Eva are pushing a heavy piece of furniture across the room. They’re getting help from Sarah’s son BRANDON (8), and her daughter GRACE, (6), as well. SARAH I’m so excited for you! He sounds great. EVA He kind of is. (whispering) We had such good sex. SARAH How fun! I can’t even imagine. Sarah stands back and looks at the furniture’s new spot. SARAH (CONT’D) What do you think? EVA I liked it where it was. You’re going to get a hernia. SARAH (to her kids) You guys can be done. Brandon and Grace walk into the other room. SARAH (CONT’D) No Cleveland Show. BRANDON (without turning around) Please. GRACE Please. SARAH Okay. EVA Jeez, you really put your foot down. SARAH Too tired to be a good parent. EVA Maybe stop moving furniture around.  ENOUGH   SAID   33",
      "characters": [],
      "action_text": "Sarah flops down on the couch, picking up a decorating magazine. Sarah’s maid CATHY, 30 and Hispanic, walks by straightening up. EVA (CONT’D) What’s she doing here? SARAH (talking quietly) You have no idea. Will refused to fire her so I let it go for a while hoping she’d just get better, but she got worse. She even seemed like she wanted to be fired cuz she was doing such stupid things. EVA Well, good. SARAH So I fired her and she started crying. And then I started crying and then we were hugging and then I hired her back. EVA You’re nice. SARAH Right? Some people might think that I’m compassionate or soft hearted or whatever, but Will just thinks I’m a baby. He wants me to fire her again as a learning experience. EVA Jesus. SARAH That’s our relationship, right there. EVA Oh come on, it’s so much more than that. SARAH Whatever. He’s an jerk. He was a middle child and never got enough fried chicken at the dinner table and thinks everything has to be fair. Cathy appears.  ENOUGH   SAID   34 CATHY Mrs. Sarah. Where do you want me to put this? It was in the bathroom. She holds up a ping pong paddle. SARAH Outside? With the ping pong table. CATHY Okay, no problem. She goes off and the two share a smile. EXT. EVA’S HOUSE - NIGHT Albert’s car is parked behind Eva’s in the driveway. INT. EVA’S BEDROOM - MORNING Albert and Eva, only half awake, are sitting up in bed. Eva’s mouth is wide open and Albert is looking inside it. ALBERT I’ve never actually seen wisdom teeth. I didn’t think anyone had them. You have a lot of fillings. EVA Do they look like the mercury kind? ALBERT No. Just normal fillings and a couple of crowns. Eva closes her mouth. EVA Okay, your turn. ALBERT No. EVA Come on. (seductive) Open your mouth.  ENOUGH   SAID   35 ALBERT Make me. She kisses him and he immediately opens up. EVA You’re missing a tooth! ALBERT I am. EVA It’s way back there. You can’t see it. ALBERT I’ve got to get some kind of hideous bone graft and it costs a fortune and I’ve been putting",
      "dialogue_count": 0,
      "word_count": 909
    },
    {
      "scene_number": 10,
      "slugline": "INT. AMERICAN LIBRARY OF CULTURAL HISTORY - DAY They walk among the stacks of scripts and audio/video stuff. ALBERT We have the most comprehensive collection of television shows from 1947 to the present. I make sure things are transferred properly, logged properly. I write blurbs for them, try to make them sound relevant and exciting in case someone younger than fifty wants to put down their phone and see something original and brilliant. EVA Like what? ALBERT Like Jack Benny. Or Sid Caesar. Or Dinah Shore. You wouldn’t believe the guests she had on - Betty Grable, Frank Sinatra, Ella Fitzgerald. EVA So cool. ALBERT It is. I kind of love it. And if it’s a slow day I get to go downstairs watch a couple episodes of ‘What’s Happening?’ She laughs and they have a kiss. INT. HALLWAY - LATER They approach an open office door. ALBERT This is my office. That’s Bob. Bob looks up from his desk. BOB Hey. EVA Hey. BOB Hey.  ENOUGH   SAID   39",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 170
    },
    {
      "scene_number": 11,
      "slugline": "INT. LIBRARY/VIEWING ROOM - DAY They walk into the room where people are watching things of video monitors. Eva admires some memorabilia that is placed behind glass. EVA Oh, remember Flipper? I always wanted a dolphin as a child. ALBERT That’s a lot of work. Suddenly they hear what sounds like a PERSON quietly crying. EVA (whispering) What is that? ALBERT I think it’s somebody watching something. It happens sometimes. Albert Peeks around to see what THE CRYING GUY is looking at. ALBERT (CONT’D) Taxi. EVA Really? ALBERT It’s probably the one where Alex’s dog died. (beat) You hungry? EXT. THE BRICK HOUSE - LATER Eva and Albert stand out front of a burger joint. ALBERT And here she is, right on time. TESS, 18 and lovely, approaches from across the street. TESS Hi Dad!  ENOUGH   SAID   40",
      "characters": [],
      "action_text": "ALBERT (they hug) Tess, this is Eva. Eva, Tess. EVA It’s so nice to meet you. TESS You, too! ALBERT So... He gestures that they should enter the restaurant. TESS (disgusted) Seriously. ALBERT They have great chili. EVA I love chili. TESS Have you ever been to Lily’s? It’s like, around the corner. ALBERT (beat) Lily’s it is. INT. LILY’S - DAY The three eat lunch in the upscale restaurant. Albert eats a steak while Tess and Eva have salads. TESS I’ll be studying fashion design. EVA Well, obviously you have great taste. TESS Thank you. ALBERT (to Tess) Eva has a daughter just starting college too.  ENOUGH   SAID   41 EVA She’s going to Sarah Lawrence. English and History. She loves History. But I think she wants to be a writer. TESS God, Sarah Lawrence is not what it used to be. (beat) I mean, I’m sure it’s still good, it’s just gone downhill a lot in the last few years. Some of my - let’s just say -   not so smart friends   - just got in. I was shocked. EVA Uh huh. ALBERT I’m sure some very smart people go there. TESS I know. I’m just saying. ALBERT (joking) And I’m just saying you should stay home and go to school around here. She glares at him. TESS At least you’re honest about it. Mom acts like she’s so excited to be on her own again but I don’t buy it. ALBERT Okay, let’s lighten up on Mom. She’s all right. And don’t judge until you have kids. TESS Except that I’m not having any. ALBERT (upset) What? How can you know that? TESS I want a career. Anyway, I hate kids. Eva looks at Albert, who looks destroyed.  ENOUGH   SAID   42 ALBERT Well, right about now we have that in common! EXT. LILY’S - DAY They come out of the restaurant. Tess walks ahead. EVA (trying to comfort him) She doesn’t know what she’s talking about. She’s too young to know what she wants. Tess sees THREE FRIENDS coming down the street. TESS Cory! Hey you guys! They all stop and chat. Each friend is chic and adult- looking. TESS (CONT’D) (turning to Albert) Dad, I’m going to get a coffee, okay? She k",
      "dialogue_count": 0,
      "word_count": 1124
    },
    {
      "scene_number": 12,
      "slugline": "EXT. MARIANNE’S HOUSE - DAY Eva rushes out of Marianne’s house lugging her massage table. Marianne stands at the front door. MARIANNE So, should we do something? Next week? EVA Absolutely. Yes! Marianne gives her a long, affectionate hug. INT. EVA’S PRIUS - DAY Eva drives away from Marianne’s, her mind racing. She stops at a stop sign, taking deep breaths. INT. EVA’S KITCHEN - DAY Eva is VIDEO CHATTING WITH SARAH. EVA Remember that new client of mine that I think is perfect? Marianne? INT. SARAH’S THERAPY OFFICE - SAME TIME Sarah is at her desk. EVA’S VOICE It turns out she’s   Albert’s ex-wife!   Can you believe this? I am   not   shitting you. SARAH That’s an unbelievable coincidence. What are you going to do? The light behind Sarah’s desk goes on. EVA Damn it your light just went on. Call me later? They shut off.  ENOUGH   SAID   48",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 150
    },
    {
      "scene_number": 13,
      "slugline": "INT. EVA’S KITCHEN - LATER She makes dinner as Ellen and Chloe come in. ELLEN Hi Ma. EVA Did you take off your shoes? ELLEN No. Since when do I have to? EVA I want to start doing that. It’s cleaner. Both Chloe and Ellen kick off their shoes. EVA (CONT’D) Socks too. They roll their eyes. EVA (CONT’D) Listen to this. Turns out I’ve been giving massages to Albert’s ex-wife. ELLEN How weird. CHLOE  So   weird. EVA I’ve been listening to this woman say the worst things about the one guy that I’m starting to really like. I pictured her ex like this fat, irritating slob, and it’s Albert. (realizing) Fat Albert. ELLEN Who? EVA Oh, it’s just a cartoon. A   cartoon!  CHLOE But he’s so not like that. ELLEN How do you know?  ENOUGH   SAID   49",
      "characters": [],
      "action_text": "CHLOE We all had breakfast the other day. He’s really sweet and funny. EVA You liked him? CHLOE Totally. ELLEN What? EVA You weren’t home, honey, so we had breakfast. That’s all. ELLEN But   I   haven’t even met him. EVA You will. ELLEN What does this woman say about him? EVA Ugh. Terrible things. She thought he was disgusting. A wimp with his daughter. Useless in bed. ELLEN (grossed out) Mom! EXT. PALISADES BLUFF - DAY Eva, dressed for hiking, and Marianne dressed for hiking/cocktails, walk up the hill. MANY OTHER WALKERS pass them. MARIANNE I date sometimes, but it’s so hard to meet people. I’m not attracted to anybody. EVA And you weren’t attracted to your husband? That must have been difficult.  ENOUGH   SAID   50 MARIANNE I tried really hard. He’d go on so many diets and cheat all the time and act shocked when he got fatter. It was so irritating. It almost wasn’t the weight that bugged me, it was his   behavior   about the weight. Just then TWO FEMALE HIKERS (30’s), who are going in the opposite direction, give Marianne a double-take. FEMALE HIKER Excuse me, are you Marianne Hope? MARIANNE Yes. FEMALE HIKER Oh my god. OTHER FEMALE HIKER You are our idol. We were just talking about you! FEMALE HIKER We admire you so much. I can’t believe we’re meeting you! Marianne shakes both of their hands. MARIANNE Hello, so nice. Thank you so much. FEMALE HIKER You have no idea how much this means to us. She gave me Beautiful Fruit when my mom died and it literally saved me. MARIANNE How wonderful. I’m so sorry. (ending it) Blessings. The hikers go down the hill, changed women. Marianne and Eva continue hiking up. EVA Blessings! (beat) It’s so cool you saved her! Marianne just smiles. Eva brings the conversation around.  ENOUGH   SAID   51 EVA (CONT’D) But he never got   obese,   right? MARIANNE It depends on your definition of obese. EVA Oh. Otherwise you liked him, more or less? MARIANNE Unfortunately, less. He did so many things that got on my nerves. EVA Like what? MARIA",
      "dialogue_count": 0,
      "word_count": 5927
    },
    {
      "scene_number": 14,
      "slugline": "INT. BRENTWOOD HOUSE - DAY Eva massages Cynthia as she blabs on about her butcher block and travertine tiles. Eva shuts her eyes, trying to tune her out. EXT. ALBERT’S STREET - ANOTHER DAY Eva’s prius drives toward Albert’s house. She gets out of the car just as Tess is coming outside with a big box of Cinnabons. EXT. ALBERT’S HOUSE - CONTINUOUS EVA Hi. TESS Hi. EVA Is he here? TESS He went to the market. EVA I’m sorry to just come over but he won’t call me back. TESS I’ll tell him you came by. But Eva just stands there, not going anywhere. EVA What are you going to do with that? TESS You want one? Tess sits and Eva sits beside her, taking a Cinnabon. Just then Albert drives up. He gets out of his car with a couple of grocery bags. Eva rises, nervous, holding the Cinnabon. EVA Hi.  ENOUGH   SAID   90",
      "characters": [],
      "action_text": "ALBERT (cold) You know how many calories are in that? He goes inside. Eva follows him. INT. KITCHEN - CONTINUOUS Eva comes in as he’s putting away the food. EVA I just want to talk. He gives her a look as if to say “so talk.” EVA (CONT’D) It really was a coincidence and then I wanted to stop but she needed massages and we sort of became friends and I didn’t know what to do. ALBERT You knew exactly what to do. You just didn’t do it. EVA I was very torn. ALBERT And while you were being torn she was poisoning our relationship? Poisoning your perception of me? EVA Yes. ALBERT And why would you want that? EVA I don’t know! I guess I was trying to protect myself. You know, we’ve both been married before, and we know how things can turn out. ALBERT And what about us? You didn’t protect us. EVA I didn’t protect us. But it’s not poisoned Albert, I still really want us to keep seeing each other.  ENOUGH   SAID   91 ALBERT I wouldn’t know how. EVA I’m so, so sorry. ALBERT This might sound corny, but you broke my heart. And I’m too old for that shit. And the worst part, the worst part is that you made me look like an idiot in front of my daughter. EVA I’m the idiot. I’m the idiot! He looks at her, not sure what to say. ALBERT I’ve got a lot to do. Tess and school - EVA When is she leaving? ALBERT In a week. School starts early. EVA That’s when Ellen leaves. (trying to be light) Guess we’re gonna need to get those hobbies going, huh? ALBERT Guess so. He goes to put away the groceries, his back to her. Torn up, Eva walks out. EXT. ALBERT’S HOUSE - CONTINUOUS Eva goes to the front door when she sees Tess in the doorway. EVA Bye. TESS He just really, really liked you. Eva turns.  ENOUGH   SAID   92 EVA I just really liked him. And she leaves Albert’s house. INT. EVA’S BEDROOM - MORNING Eva lies in bed and sighs deeply, staring at the ceiling. INT. ELLEN’S ROOM - ANOTHER DAY Eva enters Ellen’s room with the finished, hand knitted blanket. She places it in a suitcase on the floor. Sh",
      "dialogue_count": 0,
      "word_count": 911
    },
    {
      "scene_number": 15,
      "slugline": "INT. BRENTWOOD HOUSE - DAY Eva is massaging Cynthia’s neck. CYNTHIA Well, we always go to my parents for thanksgiving and we always get into a fight. My sister is a middle child so she’s got those issues - hey, what are you going to be doing? EVA Huh? CYNTHIA For the holiday? EVA Oh, just going to a friends house. It’s going to be small. CYNTHIA That sounds nice. EVA Oh yeah. It will be. EXT. SARAH AND WILL’S HOUSE - DAY Eva, in a sweater, gets out of her car with some groceries, walks up to the front door and opens it. INT. SARAH AND WILL’S HOUSE - MORNING She walks into the kitchen and puts the groceries on the counter. Sarah, wearing a robe, is preparing some food. EVA Hi. SARAH Hi honey. Thank you so much. EVA No problem. SARAH (unloading groceries) Are you excited?  ENOUGH   SAID   95",
      "characters": [],
      "action_text": "EVA Beyond. SARAH Do you think she’s going to look different? EVA Maybe she grew a beard. You know how it is at Sarah Lawrence. She looks the same. I skyped with her yesterday.   Actually, I think she gained a little weight. SARAH What time you getting her? EVA Not til two. SARAH We’re eating at five. You should come straight here from the airport. Cathy walks into the kitchen and takes down a bunch of plates. SARAH (CONT’D) Oh, let’s use the fancy plates instead. CATHY You said you don’t like them. SARAH Yeah, but it’s Thanksgiving. You’re supposed to use ugly plates. EVA I’m gonna get going. Sarah opens the silverware drawer and sees a hair brush where She rolls her eyes and looks at Eva, who smiles. EVA (CONT’D) I’ll see ya. CATHY Bye Eva. EVA Bye Cathy. Eva leaves.  ENOUGH   SAID   96",
      "dialogue_count": 0,
      "word_count": 299
    },
    {
      "scene_number": 16,
      "slugline": "INT. EVA’S CAR - DAY She sits in her car and doesn’t drive. After a moment, she checks her appearance in the mirror. EXT. ALBERT’S HOUSE - DAY Eva drives up and parks across the street. She stares at the house and can see the living room. After a moment, Albert is there. And he sees her. She freezes. She doesn’t know what to do, so she gives a stupid little wave. He walks away from the window. Her heart sinks. EVA Okay. She’s about to drive away when he comes out of the house and stands on the front steps. She takes this as her cue and gets out and goes over. EVA (CONT’D) I don’t often park in front of your house. (beat) Usually I just drive by. ALBERT I’ve driven by your house, too. EVA (thrilled) You have? He nods. He sits and she sits beside him. EVA (CONT’D) You look good. ALBERT So do you. EVA Is Tess coming home? ALBERT Already here. She’s at her mom’s. I’m going over there soon. Wanna come?  ENOUGH   SAID   97",
      "characters": [],
      "action_text": "Eva laughs, the ice breaking. ALBERT (CONT’D) And Ellen? EVA This afternoon. She’s coming home this afternoon. ALBERT So, you’ve been okay, without her? EVA Oh yeah. But she’s not going back because I’ve built a cage. ALBERT What a good idea. EVA I’ve missed you. He looks at her, his face softening. ALBERT I’ve missed you too. They smile at one another. ALBERT (CONT’D) (beat) Oh, I thought you should know. I bought some night tables. EVA (surprised) You did? ALBERT No. Eva laughs. EVA Okay. That’s good. And she looks at Albert, feeling gratitude and possibly love. FADE OUT  ENOUGH   SAID   98 FOXSEARCHLIGHT.COM/AWARDS  Released by Twentieth Century Fox © 2013 Twentieth Century Fox",
      "dialogue_count": 0,
      "word_count": 297
    }
  ]
}