{
  "slug": "euphoria-101-pilot-2019",
  "title": "euphoria 101 pilot",
  "genre": "thriller",
  "format": "series",
  "scenes_count": 5,
  "characters_count": 0,
  "characters": [],
  "total_words": 7621,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. JULES’ HOME - LATER Jules enters. There’s no one home. She goes to kitchen cabinet and pulls out a bottle of Hydrogen Peroxide. RUE (V.O.) She doesn’t really like to talk about it but dads almost never get full custody so some shit definitely went down. INT. JULES’ ROOM - MOMENTS LATER She sits in her bedroom and cleans her scrape. The walls are adorned with fashion editorials and anime cut outs... RUE (V.O.) She went to like three weeks of summer school with Kat, who failed intro to visual arts. CUT TO: INT. SUMMER SCHOOL, CLASSROOM - DAY KAT, 16, overweight, sharp and witty sits in the back left and Jules sits in the back right. WE SEE ON EITHER SIDE OF THE SCREEN their text messages to one another as their teacher MR. MARTIN (who’s completely silhouetted by the classroom projector) blah blah blahs in the background. KAT   [Gun to ur head would u fuck Mr. Martin]  JULES   [hmmmm]  KAT   [omg ur actually debating this?]  CLOSE ON: MR. MARTIN, still completely silhouetted as he continues to babble on. CUT TO: INT. COMPLETELY SPARSE ROOM - SOMETIME Rue talks basically to CAMERA. RUE Now think of all the teachers you’ve ever had and then rank them in order of who you’d want to fuck. (a beat;  (MORE)  24.",
      "characters": [],
      "action_text": "she lets that sink in) Mr. Martin is whoever in your imagination is second to last. BACK TO: INT. JULES’ ROOM - CONTINUOUS Jules finishes cleaning her scrape. Gets a text from KAT:   You wanna go to McKays party tn?  JULES:   Fuck no those assholes just ran me off the road  KAT:   That sucks. Sry.  Jules closes out iMessage and opens   SCRUFF.  She looks through her recent matches. A litany of mostly faceless men with super gross come-ons:   P&P? I wanna ruin you. How bigs your cock? U a twink or a real ts? U functional?   BLOCK. BLOCK. BLOCK. BLOCK. BLOCK.  And then a faceless older man in a business suit from the neck down. His profile reads:   Top only / Dominant Daddy / Sweet and Gentle / I’m a sucker for twinks and femboys  She looks at the other photos. He’s shirtless. Fit. Another one of his hand down his briefs. We can make out the shape of his cock. She taps his profile. And then a NEW MESSAGE from him. Jules’ heart races. She opens it:   My god, you’re perfect and beautiful and how I do I meet you for a drink?  Jules pauses... debates it. Takes a deep breath. He writes her another message:   ...tonight?  She closes SCRUFF and texts KAT:   So u for sure going to McKays?  CUT TO: INT. MADISON’S BEDROOM - CONTINUOUS KAT lays on MADISON’S bed watching her get dressed. MADISON’s in nothing but her underwear looking in the mirror. MADISON Do you think my areoles are weird?  RUE (CONT'D)  25. KAT No. MADISON But like the edges though? KAT No. They’re fine. MADISON Fine like they’re kind of weird or fine like nobody but me would ever notice what I notice? Their other friend, BB, does her makeup at a vanity table. BB Fine like shut the fuck up, Maddie. Kat responds to Jules text.   [yeah]   She gets up and starts to fix her hair and makeup. Maddy tries on a top, takes it off. MADISON Ugh, I’m disgusting. I literally look disgusting. Kat looks at Maddy’s waif like figure - KAT You’re trippin, bitch. You need to like snap the fuck out of this post- breakup pity party",
      "dialogue_count": 0,
      "word_count": 2846
    },
    {
      "scene_number": 2,
      "slugline": "INT. LEXI’S HOUSE - EVENING (LIKE 5 MINUTES AGO) CASSIE sits at the table with her mom, SUZE. CASSIE Rue-Rue pebbles. RUE How you been? Cassie shrugs whatever. SUZE She’s just being coy. She has a boyfriend she’s head over heels for. CASSIE Mom, stop being retarded. He’s not my boyfriend. SUZE Oooohkay. Then who was that handsome young man who came over for dinner last night? CASSIE Ohmigod, Mom. Suze winks at Rue and then without missing a beat - SUZE So Rue, how was rehab... CASSIE (to her Mom) You’re the actual worst. As CAMERA WHIPS AROUND - RUE (V.O.) But anyway back to this bullshit... SLAM BACK TO: NATE, grinning: NATE And the Oscar goes to - CUT TO:  39.",
      "characters": [],
      "action_text": "CASSIE’S SLUT PAGES. A GRAINY VIDEO, taken from the POV of an iSight camera of someone we don’t recognize having sex with Cassie. It’s unclear if Cassie knows she’s being filmed. GUY IN VIDEO You like it when I’m fucking rough with you? CASSIE Yessss... Pleeeeeassse. BACK TO: NATE AND THE OTHER GUYS CRACKING UP. NATE You want my advice? Fuck her like the whore she is. Throw her ass out. And never tell a soul. McKay sinks before the group. RUE (V.O.) It’s obvious that Nate got in McKay’s head because Cassie told Lexi, and Lexi told me, that the night of the party - CUT TO: INT. MCKAY’S PARTY - KITCHEN - NIGHT In the middle of the madness and chaos of the party, Cassie sits on the kitchen counter. McKay stands close, looking at her - CASSIE What? MCKAY Nothing. CASSIE Why are you staring me at like that? MCKAY I’m sorry, I just sorta spaced out. Cassie smiles. MCKAY (CONT’D) Was I being weird?  40. CASSIE No. You were being cute. A beat. MCKAY You’re literally the most beautiful girl I’ve ever seen. RUE (V.O.) - They hooked up. INT. MCKAY’S ROOM (DURING THE PARTY) - NIGHT Cassie and McKay make out on his bed. It’s getting more intense. Cassie slides his hand from her waist to her bare thigh. He looks at her. She kisses him. As he reaches under her skirt and slides her panties off. She falls on her side as McKay feels how wet she is. MCKAY Fuck. CASSIE I know. MCKAY Are you always this wet? Cassie buries her head in the bed for a brief second - CASSIE Kinda... It’s super embarrassing. He doesn’t say anything. CASSIE (CONT’D) (a long beat) Does it turn you off? McKay shakes his head, no. As he reaches into his drawer and pulls out a condom. Starts to put it on. She watches him, her breath slowing. - And suddenly McKay slams into her as we see Cassie wince uncomfortably. He smacks her ass and begins to fuck her roughly. - As Cassie grimaces, she turns around when suddenly he reaches out and chokes her. Cassie panics. Her breath constricted. Hands and legs flailing.  41. ",
      "dialogue_count": 0,
      "word_count": 1005
    },
    {
      "scene_number": 3,
      "slugline": "INT. MADISON’S CAR - NIGHT As they drive through the town blasting music. Rue looks out the window and sees the BEST WESTERN MOTEL as they pass the motel rooms, glowing from the inside. CUT TO: INT. BEST WESTERN MOTEL - NIGHT Jules sits on the edge of the bed in her pink wig and skirt. Her knees fall into one another. A glass of champagne is handed to her from O.S. JULES Thanks. REVERSE. An OLDER MAN, 40s, handsome. Clean shaven. In a nice button down shirt. There’s a calmness to him. Casualness. OLDER MAN How old are you? JULES Twenty-two. OLDER MAN Do you live in town? JULES (a beat) No.   (a beat) I’m just visiting my grandparents. OLDER MAN Hmm... JULES What about you? A long beat. OLDER MAN You live like this? JULES What do you mean? OLDER MAN Is this how you look generally?  45.",
      "characters": [],
      "action_text": "JULES I mean... For like the last six months. He nods. Sips his champagne. OLDER MAN You’re beautiful. JULES Thank you. OLDER MAN I’m envious of your generation. You know? You guys don’t care as much about the rules, you know. I think it’s a good thing. Jules nods for the sake of nodding. OLDER MAN (CONT’D) And I don’t want to be that old guy that gives you advice. But I look at you, and think there’s two versions of how your life can go... She looks at him. OLDER MAN (CONT’D) You can either go someplace where you’re wanted for who you are... Or you stay in a town like this and end up like me, living your life out in motel rooms. Jules nods. The OLDER MAN moves closer. He uses his knee to push Jules’ legs open. He stands over her. Puts his hand under her chin and lifts her face up: OLDER MAN (CONT’D) Selfishly... I hope you stay. He runs his thumb across Jules’ lips. Pushes it in her mouth. Jules doesn’t break eye contact. He uses his thumb to pull her mouth open. OLDER MAN (CONT’D) You have a great mouth. Jules’ breath slows, as he pushes her jaw down, opening her mouth even more. OLDER MAN (CONT’D) Wider... Wider...  46. He pushes his knee into Jules’ crotch. Her thighs clench around his leg. As he opens her mouth wider and wider. OLDER MAN (CONT’D) There you go. That’s it. (a beat) Good girl. CUT TO: INT. BEST WESTERN MOTEL - LATER WE HOLD ON Jules’ face, her lipstick and mascara smeared, as her face is pushed down into the bed. RUE (V.O.) Jules once told me that every night when she was a kid, like five or something, she’d lock herself in the bathroom, get down on her hands and knees, and pray to God. WE hear the SOUND of her fishnets being torn open. He reaches around and jams his fingers in her mouth. She gags. OLDER MAN Spit. She spits in his hand. JULES takes a deep breath as the OLDER MAN starts to fuck her. RUE (V.O.) She’d pray that when she woke up in the morning, she’d be 25 years old. She’d live with her best friend, a girl. Someone she hadn’t met yet ",
      "dialogue_count": 0,
      "word_count": 3021
    },
    {
      "scene_number": 4,
      "slugline": "INT. MCKAYS PARTY - HALLWAY - NIGHT Kat exits Skylar’s room and walks down the hall as CAMERA holds on her face, numb. She’s sweaty. Her hair is all messed up. She looks at her phone. A bunch of texts from Jules about 45 minutes ago. Suddenly, Maddy comes running toward her - MADISON Where the fuck have you been? You missed the craziest shit ever - Kat looks at her and smiles. Maddy’s like:   what?  KAT Guess who just lost their virginity? Maddy squeals in delight. MADISON Oh my god, oh my god, with who!? KAT I, uh, I think he goes to St. Mary’s. MADISON Oh my god, no way! How was it? Kat takes a beat, then lies. KAT It was... nice. She shrugs, as Madison wraps her arms around her in a hug. MADISON Aw, my little slut, I’m so proud of you! CUT TO: EXT. SUBURBAN STREETS - NIGHT Rue holds onto Jules as they ride her bike back home. Rue clings to her, the blood soaking through her shirt and into her clothes.  60.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 181
    },
    {
      "scene_number": 5,
      "slugline": "INT. JULES’ HOME - NIGHT They tiptoe through her house and into... INT. JULES’ ROOM - SAME Rue and Jules strip out of their bloody clothes and down to their underwear. Rue begins to bandage her arm. CUT TO: INT. MCKAY’S HOME - NIGHT Cassie sleeps peacefully as McKay cuddles her. He quietly and gently kisses the back of her neck as she sleeps. CUT TO: INT. MADISON’S HOME - NIGHT Maddy is passed out in her bed next to BB. CAMERA drifts over to the floor where KAT lays in a makeshift bed of blankets, scrolling through Skylar and Nick’s instagrams. They’re both total fuckboys. Constantly shirtless, their arms draped around random hot girls. None of whom look like Kat. CUT TO: INT. SPARSE ROOM - SOMETIME WE PULL OUT of the back of Rue’s head to REVEAL the SHERIFF and a COP sitting across from her. We can see that the Sheriff is at his wits end with Rue. SHERIFF Just tell us in a simple straightforward way what happened on the night of August 24th. RUE Was that the day the mall got shot up? SHERIFF What mall?  61.",
      "characters": [],
      "action_text": "RUE The one in the south, that like, that white supremacist dude shot up. SHERIFF I don’t know what mall shooting you’re referring to. RUE It was the one that happened the day of McKay’s party. SHERIFF On August 24th? RUE I don’t know. It’s not like I’m forty and keep a day planner. As the Cops look at each other in frustration. RUE (V.O.) So I’ve watched like a lot of true crime docs and I’m always amazed at like, how quickly criminals crack. Like if you’re gonna have the balls to commit a crime, then you’d think you’d have the balls to lie about it. Whatever. Point is - the first rule of fight club... Don’t trust the motherfucking cops. CUT TO: EXT. NATE’S HOUSE - NIGHT Nate weaves his car drunkenly down the streets. He gets out. Drunk. And walks toward the front door of his house. RUE (V.O.) Remember when I said things got weird...? INT. NATE’S HOUSE - NIGHT Nate closes the front door and drops his car keys in the bowl in the front hall. WE HOLD on A FRAMED PICTURE behind it. It’s a photo of NATE’S FAMILY, taken years ago. And WE REALIZE it’s the SAME PHOTO from the phone of the OLDER MAN Jules hooked up with.  62. RUE (V.O.)  So yeahhhh...  BACK TO: INT. SPARSE ROOM - SOMETIME The Sheriff looks at Rue. SHERIFF Just tell us what happened the night of Christopher McKay’s party. RUE (hesitates and then:) Can I be completely honest? SHERIFF I hope so - RUE I got really fucking high that night. So I’ll try to tell you what happened but I can’t like promise it’s, for real, what actually happened...   You know what I mean?  The Cops look at each other, overwhelmingly frustrated. CUT TO: INT. JULES’ ROOM - NIGHT Jules lays back in bed as Rue sits astride her, finishing bandaging her arm. They’re both in their underwear… There’s a certain sexual tension but it’s mostly platonic. Rue leans down and kisses her cheek. Sits up. Looks over her shoulder, away from us. RUE I have an idea... She turns back, looks down at Jules with a little smile. RUE (CONT’D) Wanna get high? EN",
      "dialogue_count": 0,
      "word_count": 568
    }
  ]
}