{
  "slug": "ex-machina-2015",
  "title": "ex machina",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 5,
  "characters_count": 1,
  "characters": [
    "CALEB"
  ],
  "total_words": 18230,
  "total_dialogue": 2,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. PATIO - DAY 14   14  The punch bag is suspended by a chain on an exterior flanking wall of the house. The man is wearing shorts, and is shirtless.   Bathed in sweat. His hands are not protected by gloves.   Only wraps.   Spots of blood seep through the pale material around his knuckles. This is NATHAN BATEMAN.   He’s thirty. After a flurry of punches, NATHAN breaks off. Breathing hard, he wipes at his eyebrows with the back of his wrist.   Sweat droplets cascade down his face. Then - - NATHAN senses the other presence. He turns to see CALEB.   Standing by the open glass wall. NATHAN Caleb. NATHAN beams. NATHAN (CONT’D) Caleb Smith. CALEB ... Hi. NATHAN starts unravelling his wraps. NATHAN Dude.   I’ve been so looking forward to this.  INT. HOUSE/MAIN ROOM - DAY 15   15  NATHAN walks past CALEB, and goes to the dining table, where there is a jug of non-specific vegetable juice waiting, and a glass. NATHAN Come in, come in. CALEB puts his bags down. NATHAN (CONT’D) You want something to eat or drink after your journey?  12.",
      "characters": [],
      "action_text": "CALEB No.   Thank you.   I’m fine. NATHAN You sure? NATHAN pours himself a glass of the vegetable juice. NATHAN (CONT’D) I’d been thinking we’d have breakfast together, but to be honest, I can’t eat anything right now.   I gotta tell you - I woke up this morning with the mother of all fucking hangovers. CALEB Yeah? NATHAN laughs. NATHAN Like you wouldn’t believe.   And if I have a heavy night, I always try to compensate the next morning. Exercise.   Juice.   Anti-oxidants. You know? CALEB Sure. Silence, as NATHAN drinks. CALEB feels he needs to say something. Looking around, he sees a collection of empty beer bottle on the kitchen counter. CALEB (CONT’D) ... Was it a good party? NATHAN doesn’t answer. He’s still drinking. The silence extends a little.   Verges on odd. CALEB (CONT’D) Because, uh... CALEB hesitates.   Wondering whether to be honest. Decides to be. CALEB (CONT’D) Actually there was a glass.   On the carpet.   One of your guests, maybe, left it, and -  13. NATHAN puts his empty glass down. NATHAN Guests? CALEB - I broke it. NATHAN Broke what? CALEB The glass. Beat. CALEB (CONT’D) But I cleaned it all up. NATHAN looks at CALEB.   His expression is unreadable. NATHAN Caleb.   I’m going to put this out there so it’s said. CALEB waits. NATHAN (CONT’D) You’re freaked out. CALEB ... I am? NATHAN Yeah.   You’re freaked out by the private jet, and the house, and the mountains, because it’s all so super-cool.   And you’re freaked out by me.   To be   meeting   me.   In this room, having this conversation, at this moment.   Right? CALEB doesn’t have time to answer. NATHAN (CONT’D) And I get that.   The moment you’re having. NATHAN smiles. NATHAN (CONT’D) But dude, can we get it behind us? Can we just be two guys?   Nathan and Caleb.   Not the whole employer- employee thing. CALEB Okay.  14. Beat. CALEB (CONT’D) It’s good to meet you, Nathan. CALEB holds out his hand. NATHAN beams. NATHAN It’s good to meet you too, Caleb. They shake. When CALEB takes his hand back",
      "dialogue_count": 0,
      "word_count": 2893
    },
    {
      "scene_number": 2,
      "slugline": "INT. HOUSE/CALEB’S BATHROOM - NIGHT 24   24  CALEB stands in his boxer shorts, brushing his teeth by the sink. REVEAL several long scars on his back. Neat.   Unusual.   Long-healed.   But from serious wounds, or surgery.  INT. HOUSE/CALEB’S BEDROOM - NIGHT 25   25  CALEB climbs into bed. At the foot of the bed, attached to the wall, there is a TV. On the bedside table there is a lamp, a remote control, and an alarm clock. The clock reads 11:43 pm. He switches the lamp out.  INT. HOUSE/CALEB’S BEDROOM - NIGHT 26   26  Darkness. The clock reads 01:32 am. The soft glow from the digital readout throws a light on the remote control. REVEAL CALEB. Eyes closed.   For a beat. Then his eyes open.   He’s wide awake. He turns over in the bed. Then turns back again.  CUT TO -  2:28 am. CALEB lies watching the digital clock, as the numbers change to 2:29 am. CALEB God damn it. He reaches for the remote control. CLICK.  29.",
      "characters": [
        "CALEB"
      ],
      "action_text": "The TV at the foot of the bed switches on, suddenly lighting up the room with cold TV glow. CALEB squeezes his eyes shut, momentarily dazzled by the brightness. When his eyes open again, instead of seeing a TV station, he sees a LIVE FEED from a CCTV camera. It shows the OBSERVATION ROOM. CALEB sits upright in bed. CALEB (CONT’D) ... What the fuck? AVA is sat at the table. Drawing.  CUT BETWEEN -  - CALEB watching AVA. - and varying CCTV ANGLES of AVA as she draws. The different TV channels flip between feeds from the various cameras. CALEB is transfixed by the imagery. Her posture.   Her legs tucked beneath the chair.   The curve of the breasts on her synthetic torso. The CCTV images become CALEB’S POV.   The things he is observing. CLOSE-UPS of her face.   Her eyes.   Her mouth. The way she bites her lip in an expression of concentration. As when she smiled, there is a powerful sense in this tiny gesture of her feeling sentient and human. Even more so because her face fills the screen, hiding the mechanical parts of her form. Throughout, we never clearly see what AVA is actually drawing.  END ON -  CALEB.   Glazed. Then ABRUPTLY - - the TV goes dead. And the digital alarm clock goes dead.  30. And the windowless room is plunged into total darkness, and total silence.   As if the house had been previously filled with a soft hum of power, which we were unaware of until it was gone. In this, we hear CALEB breathing. AUTOMATED VOICE Power cut.   Back up power activated. Soft emergency lighting comes on. CALEB hesitates a moment. Then gets out of bed. Goes to his bedroom door. Beside the brass plate, the LED is red. He swipes it with his card. The LED stays red. AUTOMATED VOICE (CONT’D) Full facility lock-down until main generator is restored. CALEB ... Are you kidding? He tries his card again. AUTOMATED VOICE Full facility lock-down until main generator is restored. CALEB looks around his windowless room. Which suddenly has the quality of a prison cell. Beats pass. Th",
      "dialogue_count": 1,
      "word_count": 9311
    },
    {
      "scene_number": 3,
      "slugline": "INT. HOUSE/CALEB’S BEDROOM - DAY 74   74  CALEB is woken with a jolt, by a bright shaft of light hitting his face. The door to his room has opened, revealing KYOKO, with his morning coffee.  INT. HOUSE/OBSERVATION ROOM - DAY 75   75  CALEB and AVA sit, observing each other through their own reflections. AVA Today, I’m going to test you. CALEB Test me? AVA Yes.   And please remember while you are taking the test that if you lie, I will know. CALEB smiles. CALEB Right.   Those pesky micro- expressions. AVA Exactly.   So are you ready? CALEB Shoot. AVA Question one.   What is your favourite colour? CALEB Red. AVA Lie. CALEB What? AVA Lie. CALEB ... Then what is my favourite colour?  80.",
      "characters": [
        "CALEB"
      ],
      "action_text": "AVA I don’t know.   But it isn’t red. CALEB All right.   Hold on a minute... CALEB thinks for a moment. CALEB (CONT’D) Okay.   I get it.   I guess seeing as I’m not six, I don’t really have a favourite colour. AVA nods. AVA Better answer.   Question two. What’s your earliest memory? CALEB Well, it’s actually a memory of kindergarten.   There was this kid who - AVA (cuts in) Lie. CALEB ... Really? AVA Yes. CALEB Okay.   Wait. CALEB concentrates. CALEB (CONT’D) So, there is a kind of an earlier memory.   But it’s ultra vague. It’s like... a sound.   And, maybe sky.   Or blue.   No, I think sky. And I think the sound is my mother’s voice. AVA nods. AVA Question three.   Are you a good person? CALEB laughs.  81. CALEB Oh, man.   Can we stop the test? You’re a walking lie detector, and I’ve suddenly realised this is a fucking minefield. AVA No.   We can’t stop.   Are you a good person? CALEB takes a breath. AVA keeps watching. CALEB Yes.   I think so.   I’m a good person. CALEB waits. AVA smiles slightly. AVA Question four.   Who’s the most beautiful girl you’ve ever seen? Beat. CALEB You are. Beat. AVA Hmm. Beat. AVA (CONT’D) The test is over. CALEB Did I pass? AVA Yes. CALEB That’s a relief. AVA reacts. AVA Why? CALEB hesitates.  82. CALEB Why is it a relief? AVA Yes. CALEB Oh, you know... AVA No. CALEB Just, if there’s a test, I guess by definition you want to pass. Beat. AVA What will happen to me if I fail your test? CALEB Ava - AVA Will it be bad? CALEB ... I don’t know. AVA Do you think I might be switched off?   Because I don’t function as well as I am supposed to? CALEB ... Ava, I don’t know the answer to your question.   It’s not up to me. AVA Why is it up to anyone?   Do you have people who test you, and might switch you off? CALEB No.   I don’t. AVA Then why do I? CALEB shrugs, helplessly. AVA (CONT’D) You’re testing me.   But you don’t know how I’ll pass.   And you don’t know what will happen if I fail.  83. There’s nothing CALEB can say. AVA stares into mid",
      "dialogue_count": 1,
      "word_count": 3195
    },
    {
      "scene_number": 4,
      "slugline": "EXT. PATIO - DAY 103   103  - NATHAN’S fist splitting the bag. Like an hourglass, sand runs out.  EXT. GARDENS - LATE AFTERNOON 104   104  Clouds spill around the mountain peaks.  INT. HOUSE/MAIN ROOM - LATE AFTERNOON 105   105  KYOKO stands by the Jackson Pollock painting, apparently looking at it. NATHAN stands by the open patio door, gazing at the low sun. CALEB appears. NATHAN Dude. CALEB Hey. NATHAN You know what day it is? CALEB No. NATHAN Your last.   The car is coming tomorrow morning.   Eight AM to catch the midday flight. CALEB pauses. CALEB Has it been a whole week? NATHAN smiles. NATHAN Time flies.   But what a thing you and I have shared.   Something to tell the grandchildren, right? CALEB smiles.   A little tightly. CALEB After they’ve signed their NDAs. NATHAN laughs.  99.",
      "characters": [],
      "action_text": "NATHAN Signed their NDAs!   Dude, you crack me up.   I’m not getting all maudlin or anything.   But straight up.   I will miss having you around. CALEB I appreciate that.   And - let me say: thank you for bringing me here.   It’s been a trip. NATHAN Yes it has. CALEB You know what? CALEB walks over to the kitchen area, and pulls two beers from the fridge. CALEB (CONT’D) We need to drink to that. CALEB walks back to NATHAN.   Extends a hand.   Holding a Peroni. But NATHAN doesn’t take it. NATHAN Oh, uh... no, I’m good.   You go ahead. Beat. CALEB You don’t want a beer? NATHAN shrugs. NATHAN No. CALEB ... Maybe wine or something. NATHAN I’m sure you’ve noticed - I’ve been somewhat overdoing it recently. When I woke up this morning, I told myself: time to hit the old detox. CALEB’S hand remains extended.   He smiles again.   More tightly. CALEB Are you kidding?   I’m drinking alone?  100. NATHAN Hey - you want to get wasted, knock yourself out.   Literally.   But I’m on brown rice and mineral water. A beat. CALEB puts down NATHAN’S beer. Then raises his own. CALEB Cheers, then. NATHAN Cheers. CALEB takes a single sip. NATHAN watches. NATHAN (CONT’D) So, anyway.   Surely this is when you tell me whether Ava passed or if she failed. CALEB pauses. Collecting himself slightly.   Trying to think how to get his plan back on track. CALEB Right. Beat. NATHAN You going to keep me in suspense? CALEB Her AI is beyond doubt. NATHAN Is it?   You mean, she passed? CALEB Yes. NATHAN Wow.   That’s fantastic. Beat. NATHAN (CONT’D) Although I’ve got to admit, I’m surprised.   I mean, did we ever get past the chess problem, as you phrased it?  101.  (MORE) As in: how do you tell if a machine is expressing a real emotion, or a just a simulated one? NATHAN pauses. NATHAN (CONT’D) Does Ava actually like you?   Or not. CALEB has a cold realisation dawning.   NATHAN is playing with him. NATHAN (CONT’D) Though now I stop to think, there is a third option.   Not whether she does or doesn’t have",
      "dialogue_count": 0,
      "word_count": 2646
    },
    {
      "scene_number": 5,
      "slugline": "EXT. PERIMETER GATE - DAY 125   125  - AVA’S precise POINT OF VIEW. Looking in at the CHAUFFEUR. The image echoes the POV views from the computer/cell-phone cameras in the opening moments of the film. Facial recognition vectors flutter around the CHAUFFEUR’S face. And when he opens his mouth to reply, we don’t hear words. We hear pulses of monotone noise.   Low pitch.   Speech as pure pattern recognition. This is how AVA has been sees us.   And hears us. It feels completely alien.  EXT. PERIMETER GATE - DAY 126   126  AVA and the CHAUFFEUR finish talking. We are too distant to hear their conversation. But whatever is said, a few beats later, the CHAUFFEUR exits the car, and goes around to hold open the rear door, to allow AVA to enter. Then goes back to the driver’s door. Gets in. And the car pulls off.  CUT TO - - COMPUTER MONITOR.  Lines of code appear, as they are typed. They read:  main( ) { extrn a, b, c; putchar(a); putchar (b);putchar (c); putchar(’!’*n’); } a ‘goo’; b ‘dby’; c ‘e, wo -  END  115.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 185
    }
  ]
}