{
  "slug": "extremely-wicked-shockingly-evil-and-vile-2019",
  "title": "extremely wicked shockingly evil and vile",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 14,
  "characters_count": 2,
  "characters": [
    "LIZ",
    "TED"
  ],
  "total_words": 17655,
  "total_dialogue": 3,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. UW LAW LIBRARY - NIGHT 29   29  Ted protests as he’s escorted out. TED I am an alumnus of this school! SECURITY GUARD Look, buddy, you seem like a nice guy, but you’re making the girls nervous. TED What do they think I’m going to do, knock ‘em over the head and attack ‘em in the bookstacks? The guard shuts the door on Ted.   Fuming, Ted spots a SIMILAR DARK SEDAN across the street.   The same one, or different? We can’t tell.   He marches up to it.   Bangs on the window. TED Hey!   Who are you?   I know you’re following me! The car starts up and drives away. TED Who sent you?! As it speeds off into the darkness, Ted fills with anger. Paranoia.   Fear.   He stands in the quiet night... alone. INT. LIZ’S BEDROOM - NIGHT 30   30  Dead of night.   Liz is fast asleep.   She stirs, squints her eyes open... and realizes SOMEONE’s sitting next to her UNDER THE SHEETS with a LIGHT ON. She screams!   Jumps up! Ted startles out from under the sheets.   Flashlight in his hand.   Surprised by Liz’s reaction. LIZ (re: flashlight) What are you doing? Ted shows her a paperback he’s reading.   Astute viewers may notice it’s Capote’s In Cold Blood. TED Reading.  22.",
      "characters": [
        "LIZ"
      ],
      "action_text": "LIZ With a flashlight under the sheets? TED I didn’t want to wake you. They realize the absurdity of the situation and break into laughter.   As Liz starts to catch her breath... TED I think we should get married. Liz loses her breath completely. EXT. MOUNTAINS - DAY 31   31  Two skiers zzzzZZZZOOOOOOMMMM past in a blur.   Ted and Liz cut down a daunting double black diamond.   Liz pulls ahead. Ted crouches lower.   Gains ground.   Neck and neck, fast approaching the finish... ...Liz wins by a hair!   She taunts him in celebration.   He tackles her in the snow and kisses her INT. HALLWAY - SALT LAKE CITY COURTHOUSE - DAY Ted and Liz meet O’Connell outside the courtroom on their way in.   Ted’s clean shaven in a light blue/gray suit, white shirt, and bow tie -- and noticeably tanner. JOHN O’CONNELL Where’d you fly in from, Barbados? TED Liz and I hit the slopes yesterday. We’re engaged!   Once we win this thing, I might just make you my best man. LIZ (re: O’Connell’s beard) You’ll have to shave for our wedding photos, of course.   Won’t you scare the jury with that thing? JOHN O’CONNELL If we had one.   We waived it. Local press all but convicted him so an impartial jury was hard to find.  23. As the daughter of a police officer, she felt foolish to question his authority, so she followed him to the parking lot where he led her to what he claimed to be an unmarked police vehicle. When he drove in the opposite direction of the police department, she knew she was in trouble.   When he slapped a handcuff around her wrist, she knew she was in danger. Fortunately, before he could latch the other, she twisted free and fled for her life. (beat) Then he pursued her with a crowbar. The courtroom suddenly drops a few degrees. INT. ROOM 310 - SALT LAKE CITY COURTHOUSE - LATER 34   34  CAROL DARONCH, a soft-featured, 19-year old, strawberry blonde girl, relives the pain of that night. CAROL DARONCH I was kicking him, and screaming. He held a small black gun to my head and said, ",
      "dialogue_count": 1,
      "word_count": 1588
    },
    {
      "scene_number": 2,
      "slugline": "I/E. DOG POUND - DAY 36   36  Ted and Liz look at DOGS IN CAGES. LIZ (re: a specific dog) What about this guy?   He looks like a good roommate. Ted doesn’t respond -- he’s distracted by all these animals in cages.   An ominous a reminder of his very possible future. LIZ Earth to Ted... TED He’s right.   This thing should have been a slam dunk.   Why couldn’t I just keep my mouth shut? LIZ If you could do that we never would have met. Her attempt to lighten the mood falls flat.   She notices Ted’s hand shaking.   She takes it in hers.   Knows she needs to be the strong one now. TED No matter what happens, promise you won’t leave me, Liz.   I don’t know what I’d do without you. LIZ I would never. The BARKING in the background gets louder and more primal. He stares them down. INT. TED’S APARTMENT - NIGHT 37   37  Warm, intimate tones.   Close, intimate SHOTS:   A half-empty bottle of tequila.   A salt shaker.   Chewed up limes.   A turntable playing a LOVE SONG.   Ted’s pet plant “FERN.” Ted and Liz fool around -- drunk, giggling, undressing each other in a romantically playful way. As it starts to get heavy -- he GRABS her by the hair.   She gasps in exhilaration.   It’s hot.   Two beautiful people in passionate throes. Ted throws her on the bed.   His eyes fix in a primal stare. Liz stares back in a hot combination of fear and desire...  30.",
      "characters": [],
      "action_text": "As Ted goes in for the kill. INT. TED’S APARTMENT - LATER 38   38  Ted and Liz catch their breath in twisted sheets, sharing a joint, looking like they just got fucked by a tornado. LIZ What was   that?  TED “Last Night of Freedom” sex? She shoots him a look. LIZ Too soon. A GAVEL CLACKS... (PRE-LAP) INT. ROOM 310 - SALT LAKE CITY COURTHOUSE - DAY 39   39  Restless murmurs die down to eerie silence.   Judge Hanson looks out over the courtroom.   Ted and Liz make flirty eyes from a distance.   Last night still on their minds. JUDGE HANSON After an agonizing weekend pondering the arguments presented in this courtroom, and by the power vested in me as both judge and jury, I hereby find the defendant  guilty   of aggravated kidnapping beyond a reasonable doubt. Liz’s blood runs cold.   Her entire world flipped upside down. JUDGE HANSON You will be remanded to the Utah State Prison to await sentencing. This court is adjourned. CLACK!   A court deputy handcuffs Ted, shell-shocked.   Liz moves toward him but another deputy holds her back. LIZ (crying) Ted... TED Everything’s going to be okay, Liz. LIZ Ted, I’m sorry...  31. TED Don’t give up on me, Liz.   I’m going to fix this.   I promise! LIZ Ted, I’m sorry! She stretches to touch him, but court deputies pull him away. WE STAY WITH LIZ... watching her heart and soul ripped away. Crying.   Two lovers.   Torn apart. EXT. UTAH STATE PRISON - DAY 40   40  Gates open to a drab, geometric compound coiled in razor wire. INT. PROCESSING - DAY 41   41  Ted strips for a medical inspection while Jimmy Carter’s victory speech plays on a TV. INT. PRISON CELL - DAY 42   42  Ted carries prison-issue bedding and amenities and takes in the spartan digs as the door locks behind him. LIZ (PRE-LAP) (phone-filtered) Is it scary? INT. PRISON PHONEBANK - NIGHT 43   43  On the phone, Ted tries to shield the sound of an off-screen fight between inmates. TED Let’s just say men convicted of crimes against women have a short shelf life in here.   E",
      "dialogue_count": 0,
      "word_count": 3426
    },
    {
      "scene_number": 3,
      "slugline": "INT. JAIL BARBER SHOP - DAY 65   65  Ted watches his own interview as he gets a shave and cut, making him look very different from the interview footage. TELEVISION REPORTER (ON TV) You don’t lie awake at night thinking about it? TED (ON TV) Not a moment. INT. TED’S CELL - NIGHT 66   66  Ted jumps off his bunk again, sticking a hard landing -- steeling his ankles for impact. TELEVISION REPORTER (V.O.) Do you think about getting out? CUT TO: TED’S TV INTERVIEW 67   67  A mischievous smile spreads across Ted’s bearded face... TED (beat) Legally, sure. INT. PITKIN COURTROOM - DAY 68   68  Ted’s now clean shaven, with close-cropped hair, and we get the sense he planned it that way.   He’s also oddly bulked in heavy layers despite everyone else’s light, summer clothing. Just over his shoulder, the CURTAINS of the open window BILLOW in the background. Sweat rolls down his temple.   Heat?   Or nerves? JUDGE LOHR Does the defense have anything further to add in this pretrial sentencing consideration? JIM DUMAS Your Honor, the death penalty is premised upon blood vengeance.   It carries the very real risk that the innocent will be executed.  48.  (MORE)",
      "characters": [],
      "action_text": "The defense requests that this court exclude the death penalty on the grounds that it is arbitrary and capricious. JUDGE LOHR Let’s take a fifteen minute recess before concluding with the prosecution’s final arguments. Lohr bangs the gavel and retires to his chambers.   The courtroom empties out. JIM DUMAS Let’s get some air. TED I’m going to stay and practice my final remarks if that’s alright. Dumas exits, leaving Ted alone in the courtroom.   Ted throws a friendly smile to Westerlund, standing post at the door. The curtains billow at the open window in the back. Ted gets up.   Wipes sweat from his temple.   His heart thumps loudly in his chest.   He wanders around the room, pretending to read a file while stretching his legs. Westerlund finds his pack of smokes and steps into the hall for his regularly scheduled smoke. Once Westerlund exits, Ted climbs onto the sill of the open window.   Heart beating out of his chest.   Random foot traffic below.   He steps out onto the ledge -- higher than he expected.   He steadies himself... EXT. PITKIN COUNTY COURTHOUSE - DAY As a WOMAN waits for her LITTLE DOG to poop on the courthouse lawn... ...Ted jumps out a second story window, twisting his ankle upon landing.   He gives a smile and a wave to the woman, who watches him briskly limp away. INT. HALLWAY - DAY 69   69  Westerlund flirts with the same YOUNG WOMAN:  49.  JIM DUMAS (CONT'D) DEPUTY WESTERLUND ...so I unholstered my service weapon, making like I was about to discharge -- that means shoot -- and this punk drops to his knees quicker than Warhol on a naval ship, slides the record across the floor right on up to my boots.   You know what it was?   Iggy Pop.   So I arrested him for bad taste. The WOMAN WITH THE LITTLE DOG and pooper scooper interrupts: WOMAN WITH A LITTLE DOG Pardon me, but is it common for people to jump out of windows around here? Westerlund looks inside.   His cigarette drops from his lips. EXT. ALLEYWAY - DAY 70   70  Ted sprints down an alleywa",
      "dialogue_count": 0,
      "word_count": 921
    },
    {
      "scene_number": 4,
      "slugline": "INT. KITCHEN - NIGHT 81   81  Liz pours Fisher coffee. DET. MIKE FISHER Did he give any indication he was planning this? Liz shakes her head. DET. MIKE FISHER I can’t stress how important it is you notify me if he contacts you. And if you know anything that you’re not telling me, you would be guilty of aiding and abetting. LIZ You came all the way from Colorado just to tell me that? Fisher reveals a large MANILA ENVELOPE marked “CONFIDENTIAL.” DET. MIKE FISHER I thought you should see firsthand just how serious this is. Liz doesn’t take the envelope.   Doesn’t want to? DET. MIKE FISHER If you help us get him, you can prevent it from happening again. LIZ Whatever you think you know about him, it’s all a lie.   He didn’t do what you think he did.   This is all a mix-up. DET. MIKE FISHER Ma’am, there are things you don’t know, that I can’t tell you right now, that will shock you beyond your worst nightmares, and it’s only a matter of time before the cards are on the table.   And when they are, they will wrack you. LIZ (cross-armed) Is that it? Fisher leaves the envelope on the table, gets up, and shows himself out.   Liz looks at the envelope but doesn’t open it.  52.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 221
    },
    {
      "scene_number": 5,
      "slugline": "I/E. MOUNTAIN CABIN - DAY 82   82  Ted snaps awake in a cabin he broke into for the night.   He orients himself, then gets up and stretches.   A peaceful mountain morning. In the kitchen, he rifles through cupboards.   Saltines, tins of Polish bacon, stewed tomatoes -- he shovels it all in... ...until a POLICE HELICOPTER roars overhead. Ted drops to his knees, scurries to the window -- where he hears POLICE and SEARCH DOGS approaching in the distance! Ted scurries back to the far window.   He CLIMBS OUT, back- crawling away, then running, but he trips, falls, and-- --looks up INTO THE BARREL OF A SHOTGUN. OMITTED 83   83  INT. PITKIN COURTROOM - DAY 84   84  Back in custody in the same courtroom he just fled, ARMED DEPUTY SHERIFFS flank Ted as Lohr arraigns him on new charges.   The windows are also now locked and guarded. JUDGE LOHR ...Two counts felonious escape, one count burglary, one count auto theft, one count misdemeanor theft, the sum of which carry a total of ninety years.   I hope it was worth it, son. TED (grins) It was just too pretty outside. He gets a chuckle from some in the courtroom.   Photographers snap away.   He realizes he’s the center of attention now. EXT. GARFIELD COUNTY JAIL - DAY An establishing shot of the quaint 10-cell “mom and pop” jail with a PRIVATE RESIDENCE affixed to the end. We hear an ELECTRONIC BUZZ... (PRE-LAP)  53.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 241
    },
    {
      "scene_number": 6,
      "slugline": "INT. VISITATION ROOM - DAY 85   85  A prison door opens.   Ted bounds in, running into Liz’s arms, both crying tears of happiness. TIME CUT: Ted and Liz sit as close as two people can, touching and cuddling each other.   First time they’ve been together in a while.   Security is lax in this mom and pop shop. TED It’s a bed and breakfast compared to Utah.   The head jailer and his wife live in an apartment attached to the end of the jail.   Kinda feels like a vacation if you don’t think about it too much. Ted surprises her with a newspaper-wrapped GIFT. TED Merry Christmas. LIZ I didn’t bring you anything. TED You brought me the only thing I wanted in the whole world when all I really deserved was a lump of coal.   Open it. Liz unwraps newspaper off a well-worn copy of   Papillon . TED I’ve read it four times.   You remember what it’s about, right? LIZ “Never lose hope.” TED You haven’t, have you? A melancholy falls over Liz. TED I know it’s hard.   It’s hard for me too.   It was foolish of me to run, but you weren’t answering my calls and I got scared you were going to leave--  54.",
      "characters": [],
      "action_text": "Ted suddenly realizes, Liz came here to break up with him. TED Oh no.   Don’t do this, Liz. LIZ Your lawyer called.   He said the Utah appeal was rejected. A major blow. TED I’ll take it all the way to the Supreme Court if I have to.   Liz, I’ve got documents that will destroy their case. LIZ They didn’t give you probation. They gave you fifteen years. TED That’s a maximum.   No one gets the max on a first conviction. LIZ And now you’re looking at ninety more for running. TED I told you, I’m going to straighten everything out. LIZ I can’t do this anymore, Ted. TED Do you not love me anymore? LIZ No, I do.   That’s the problem. TED What if I got out?   We could run away together.   Canada, maybe.   I don’t understand, Liz. LIZ I’m sorry.   This is from Molly. She gives him an ENVELOPE and hurries away in tears. TED Please don’t do this, Liz!  55. Ted looks like he was hit by a truck.   Now he’s all alone. He opens the envelope -- inside is a CRAYON DRAWING OF A SHARK. OMITTED 86   86  INT. TED’S CELL - NIGHT 87   87  Ted tapes Molly’s shark drawing on the ceiling so he can look at it while he lies in bed. INT. UNIVERSITY MEDICAL DIVISION - NIGHT 88   88  Sparse Christmas decorations adorn the office.   Liz looks like hell.   She stares vacantly at the copy of   Papillon .   Her desk phone is noticeably silent. She removes the picture of her and Ted from the frame and sticks it in the pages of   Papillon , literally closing the book on Ted.   She puts the book in a drawer and shuts it. JERRY (O.S.) What’s your resolution? Jerry unpacks a brown bag snack at the next desk over. JERRY For the new year.   Mine’s to lose two belt notches, except I always manage to find ‘em later. LIZ I don’t really have one. JERRY Everyone’s got something they want, or wanna get rid of. LIZ What if you don’t know which it is? JERRY My experience, you probably already know but aren’t ready to admit it. Liz wells up.   Not Jerry’s intention. JERRY But I’m wrong a lot.  56.",
      "dialogue_count": 0,
      "word_count": 580
    },
    {
      "scene_number": 7,
      "slugline": "INT. TED’S CELL - NIGHT 89   89  Ted lies on his bunk, still staring at Molly’s shark drawing... as his eyes take focus on something else -- the METAL PLATE in the ceiling holding the light fixture. TED (V.O.) Dear Liz. INT. GARFIELD COUNTY JAIL - DAY 90   90  Ted waits on the phone but the other end just keeps ringing. He hangs up.   Crushed. TED (V.O.) There are many things I can live without... INT. PRINT SHOP - DAY 91   91  At his print shop job, Ted slices reams of paper, staring off.   Losing hope... as we slowly PUSH IN on the BLADE. TED (V.O.) ...but you’re not one of them. INT. TED’S CELL - DAY 92   92  Ted extracts the blade hidden under his pant leg in his sock. Considers its sharpness. TED (V.O.) I may have lost you, but I’ll never lose hope. Ted climbs onto his bunk and knocks on the metal plate in the ceiling.   It’s HOLLOW. He grates the paper cutter blade against it.   GROOVES appear. INT. JUDGE LOHR’S CHAMBERS - DAY 93   93  Ted and Dumas meet with Judge Lohr privately.   Christmas decorations adorn the court. JUDGE LOHR I’ve concluded there’s no way to obtain an unbiased jury in Aspen in light of recent events, so I’m moving you to Colorado Springs where your antics have not been daily news.  57.",
      "characters": [
        "TED"
      ],
      "action_text": "Ted stares back at Lohr in sheer panic.   His shot at escape now in jeopardy. TED Your Honor, I have a good feeling about Aspen.   I’d prefer to stay right where I am. JUDGE LOHR I’ve ruled and it’s final. JIM DUMAS Ted, this is great news. JUDGE LOHR You’ll be transferred after the holidays.   Merry Christmas. Ted looks anxious. EXT. GARFIELD COUNTY JAIL - NIGHT Over a reminder shot of the “mom and pop” jail with private residence affixed to the end, we hear URGENT SAWING. INT. TED’S CELL - NIGHT 94   94  With the SHOWERS on in the background to mask the noise, Ted double-times it with the paper cutter blade, making quick work of a square foot cutaway in the metal ceiling plate. The showers momentarily shut off.   Ted stops sawing.   Waits. They turn back on and he resumes. INT. ATTIC CRAWL SPACE - NIGHT 95   95  A square foot of metal POPS FREE.   TED’S HANDS reach up into a dark, cobwebbed crawl space and feel around.   He hoists himself up, squirming through the narrow hole. Down a ways, a SHAFT OF LIGHT spears up from the floor.   He crawls toward it, coughing from the dust, trying to keep quiet on the old wooden paneling. The JAILER and his WIFE are having a marital argument below: HEAD JAILER (O.S.) I don’t understand why you’re so teed up? JAILER’S WIFE (O.S.) It’s called intimacy, Ed -- ever heard of it?   It doesn’t work if you hide things from me.  58. HEAD JAILER (O.S.) Ever heard of not going to bed angry? Ted SNEEZES.   Did they hear him?   He keeps perfectly still. JAILER’S WIFE (O.S.) What was that? HEAD JAILER (O.S.) I said goodnight. Ted HEARS A LAMP CLICK OFF. The light through the floor GOES OUT.   He waits IN THE DARK as they fall asleep... INT. HEAD JAILER’S BEDROOM - NIGHT - LATER 96   96  The HEAD JAILER and his WIFE are sound asleep in the middle of the night. A FINGER emerges from the HOLE in the plasterboard ceiling. A panel is carefully removed.   TED’S LEGS dangle through the hole, as he eases himself down into their PRIVATE RESIDENCE. T",
      "dialogue_count": 1,
      "word_count": 1925
    },
    {
      "scene_number": 8,
      "slugline": "INT. INTERVIEW ROOM - NIGHT 112   112  A TAPE RECORDER rolls.   Ted’s with three detectives, PATCHEN, CHAPMAN, and BODIFORD, who look like a tough audience.   Ted has the wear and tear of his scuffle with Lee on his face. TED You seriously never heard of me? Don’t you watch the news? DET. NORMAN CHAPMAN Right.   You jumped out of a window like I won the Super Bowl. The detectives laugh.   Ted looks slightly disappointed. Then the door OPENS and Officer Lee (the arresting officer) enters and lays down an FBI Ten Most Wanted flyer with TED’S FACE on it. OFFICER LEE Would you sign it for me? This raises a few eyebrows.   Proudly: TED Who wants to hear about my second escape? INT. TED’S CELL - NIGHT 111   111  Ted’s slumped in a windowless iron cell with a bed and combination sink-and-toilet, admiring Molly’s well-creased shark drawing, which he’s managed to keep. The light’s poor and the humidity makes him sweat. The CELL DOOR UNLOCKS.   A man in an expensive suit and haircut enters, picking lint off his sleeve.   SHERIFF KEN KATSARIS -- tall, Greek, and handsome. TED Are you my lawyer? SHERIFF KEN KATSARIS That’s funny, I thought you were one? Katsaris straightens his cuffs.   Ted doesn’t respond.   Not sure who this guy is, or what the angle is yet.  65.",
      "characters": [],
      "action_text": "SHERIFF KATSARIS The game is over, Ted.   Your days of walking without the clatter of chains are done.   Florida is the Buckle of the Death Belt and it’s my job to tighten things up in a major way. TED A bit excessive for stealing a car, don’t you think? Katsaris smirks like he knows something Ted doesn’t.   He sees Molly’s shark drawing. TED That’s a thresher shark.   They have tail as long as their whole-- Katsaris RIPS up the drawing. SHERIFF KEN KATSARIS I’m the sheriff of this town... and I’m the one who’s going to get you. Washington missed you, Utah gave you away, Colorado lost you, I’m going to fry you. Ted’s eyes darken.   Katsaris turns and walks out.   As if on cue, a PAIR OF JAILERS enter and FORCE Ted onto his back. They HOLD HIM DOWN as a DENTIST follows. TED (struggling) What are you doing to me? A DENTAL SPECULUM is shoved in Ted’s mouth.   His TEETH are photographed with a macro lens.   The speculum is RIPPED OUT. MODELING PASTE farts out of a tube.   An IMPRESSION TRAY is shoved in.   Ted GAGS under the barbarism... ...as Sheriff Katsaris watches on with a sadistic grin. Welcome to Ted’s new nightmare. CUT TO:  ARCHIVAL FOOTAGE of the Chi Omega reporting... a chilling crime... no suspects yet... etc.  EXT. CHI OMEGA SORORITY HOUSE - DAY (ARCHIVAL FOOTAGE) 108   108  Tripod video of a SORORITY HOUSE.  66. REPORTER (V.O.) The killer struck first at the Chi Omega sorority house. INT. BEDROOM CRIME SCENE - DAY (NEWS FOOTAGE) 109   109  A pillow soaked in blood.   Spattered sheets. REPORTER (V.O.) He clubbed and then strangled to death twenty year old Lisa Levy and twenty one year old Margaret Bowman. CUT TO: NEWSPAPER HEADLINES: 110   110  “Shadow of murderer looms over campus” “Police seek clues in slaying of two FSU sorority women” “Reward is offered”  And a NEWSPAPER PHOTO of a terrified sorority girl peering out a window. REPORTER (V.O.) At least one of them was raped. INT. ELEVATOR - NIGHT 113   113  Ted rides down in baggy green jail coveralls, h",
      "dialogue_count": 0,
      "word_count": 1867
    },
    {
      "scene_number": 9,
      "slugline": "INT. VISITATION ROOM - DAY 123   123  Ted feeds Carole Ann talking points... EXT. METRO JUSTICE BUILDING - DAY 124   124  Carole Ann regurgitates Ted’s words to the press... CAROLE ANN It’s obvious the media has already convicted him before he’s had his day in court, and to broadcast it to a national audience proves just how big a charade this really is... STILL INTERCUTTING:  ARCHIVAL FOOTAGE of pretty college girls describing why they’re so taken by this charming, accused murder... As national media interest grows... as throngs of reporters and broadcast equipment descend in and around the Miami courthouse in an unprecedented manner...  EXT. METRO JUSTICE BUILDING - DAY 127   127  ARCHIVAL FOOTAGE of a MEDIA CIRCUS: News vans from every network, throngs of reporters, live feeds, etc.   Cordoned off to either side are TED PROTESTORS who want him to fry, and TED SUPPORTERS who are mostly young women.  SUPER:   Miami, FL.  It’s the Super Bowl of court cases. VARIOUS SHOTS of key players as they enter the courthouse   *  alongside the public: Larry Simpson, Ted’s legal team (Ed,   *  Lynn, Peggy, Dan), Detectives Patchen, Chapman, and Bodiford,   *  Sheriff Katsaris, etc...   *  INT. LIZ’S HOUSE - DAY 120   120  Liz lays around reading   Papillon , looking like she hasn’t slept or showered in days.   The DOORBELL RINGS.   It’s Jerry with a takeout bag. JERRY I brought chicken soup.   You haven’t been at work all week so I figured you were sick.  74.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 245
    },
    {
      "scene_number": 10,
      "slugline": "INT. HOLDING ROOM - DAY 128   128  It’s dead silent in here, where Ted changes out of his prison jumpsuit into a dapper suit and bow tie -- like he’s getting ready for a performance. He makes a phone call. INT. KITCHEN - MOMENTS LATER 129   129  Jerry (alone) portions out the soup into bowls.   He notices  Papillon   and pages through, unaware of its significance. Then PHONE RINGS.   Jerry looks, unsure if he should answer. LIZ (O.S.) (from the bathroom) Can you get that? Jerry answers. JERRY Hello? INTERCUT - TED 130   130  All the color drains from Ted’s face. TED (beat) Who is this? JERRY Who is   this?  Tense silence.   Ted looks sick. JERRY You can’t call here anymore. You’re killing her. Ted’s not sure what to say.   It hurts: TED Will you give her a message for me? Will you tell her... will you tell her I love her? Dead silence. Jerry hangs up the phone. LIZ (O.S.) Who was that?  75.",
      "characters": [
        "TED"
      ],
      "action_text": "Jerry’s startled to find Liz there, drying her hair. JERRY (shrugs) Just a salesman. Liz holds on him for a beat, like she knows, then lets it go. INT. HALLWAY - DAY 131   131  Ted carries a beer carton of legal files, leading a procession of jailers toward the courtroom door where the DIN OF THE CROWD becomes audible.   Like a boxer before a fight. Just before entering, he takes a deep breath.   Puts on his game face.   A jailer opens the door to... INT. MIAMI COURTROOM - DAY 132   132  ...a vast, octagonal room paneled with tropical wood, brass rectangles, and suspended light fixtures.   If Utah was an empty house, and Colorado was a bigger ballgame, Miami is a sold out show. Thirty three JOURNALISTS with press credentials have reserved seats.   The public fills the hundred-seat gallery. Attractive college girls (the “TED GROUPIES”) have staked out the front row.   Only the jury box is empty. Ted takes in the enormity.   They’re all there for him.   He finds Carole Ann in the crowd, who waves and blows a kiss. BAILIFF DAVE WATSON, 70s, a white-haired spark plug of a man, in a crisply starched white shirt and dark pleated trousers, bellows over the crowd: BAILIFF WATSON Court will come to order! The noise dies down. BAILIFF WATSON Please rise for the Honorable Justice Cowart! Everyone rises as JUDGE COWART assumes his marble bench.   A venerable St. Bernard of a man, with great sagging jowls, horn-rimmed glasses, and a proclivity for old Southern sayings.  76. JUDGE COWART Bless your hearts.   Please sit.   In regards to the cameras, we're conducting the public's business, and we're going to do it in the sunshine.   After all, this is Florida. (to Ted) You look nice, partner. TED Thank you, Your Honor.   I’m disguised as an attorney today. Laughter softens the mood. JUDGE COWART Well, then, let’s put on a show. Ted surveys all the NEWS CAMERAS. CUT TO: A LIVE BROADCAST 133   133  Lead prosecutor Larry Simpson enters the courtroom as if it was rehearsed (it was).   ",
      "dialogue_count": 1,
      "word_count": 3457
    },
    {
      "scene_number": 11,
      "slugline": "INT. LIZ’S HOUSE - NIGHT 147   147  Jerry has just turned off the TV.   Liz sends him a vicious look. JERRY You need to let him go.   He is slowly killing you and you don’t even realize it. LIZ You’re just jealous Ted and I have a bond that you and I never could. I know you unplug the phones when I fall asleep.   Was it him that called the other day? Jerry doesn’t answer. LIZ What did he say? JERRY It doesn’t matter. LIZ WHAT DID HE SAY? JERRY He froze up because he knows I know he’s a weasel.   He is going to fry, Liz, and if you ask me, that’s the easy way out compared to the slow, protracted destruction you’re putting yourself through by holding onto him like this.   He is killing you, because you’re letting him. LIZ Get out. Jerry doesn’t move. LIZ GET OUT! Liz slaps Jerry who stands his ground.   Instead of leaving, Jerry steps   toward   her. JERRY You need to let him go, Lizzy.  93.",
      "characters": [],
      "action_text": "LIZ (breaking down) I just want this all to be over.   I wish I could take it all back. JERRY Take what back?   Why do you act like you’re personally responsible for everything that’s happening to him? PUSHING IN on Liz... LIZ (long beat) Because I’m the one who gave his name to the police.   That’s what started this entire nightmare. OVER, we HEAR/SEE THE OPENING POLICE CALL -- but now we also get the   other   side of the conversation... DISPATCHER (V.O.) King County Sheriff’s Department. LIZ (V.O.) Yes, my name is Elizabeth Kendall. I’m calling to report someone who matches the description of the guy from Lake Sam who was seen with those girls who disappeared...  Liz was the one who gave Ted’s name to the police.  LIZ (V.O.) Is he ever going to find out it was me who called? DISPATCHER (V.O.) No, he won’t find out. INT. MIAMI COURTROOM - DAY As Larry Simpson delivers his closing statement, again with his easel, this time we SEE IN DETAIL THE ACTUAL EVIDENCE BLOW UPS... -- A PILLOW SOAKED IN BLOOD -- FLAKES OF OAK BARK ON BLOOD-SPATTERED SHEETS -- BUTTOCKS BITE MARK PHOTO -- MACRO CLOSEUP OF TED’S GHASTLY TEETH  94. -- PANTYHOSE MASK -- “HOLE-IN-THE-HEAD” PHOTO -- SKULL MISSING ENTIRE FRONTAL PLANE FROM BLUNT FORCE TRAUMA -- PANTYHOSE GARROTTE SO TIGHT THE NECK IS HALF ITS SIZE LARRY SIMPSON ...He may ask for mercy.   His mother may ask for mercy.   But how nice it would have been if Lisa Levy’s and Margaret Bowman’s mothers could have been there that morning of January 15, 1978 and asked for mercy for them. TIME CUT: Now Ted delivers his closing statement... TED Ladies and gentlemen, the prosecution opened this trial by arguing this case is about more than murder.   I’d like to close it by making that same argument. There are two ways for the police to investigate a crime.   They can go to a crime scene, look for clues, and follow those clues to their logical conclusions.   Or, they can begin with a suspect, decide on a suspect, and work to make the evidence fit ",
      "dialogue_count": 0,
      "word_count": 615
    },
    {
      "scene_number": 12,
      "slugline": "INT. HOLDING ROOM - DAY 149   149  Ted waits with reporters.   Carole Ann by his side. Contrasted against Liz and Jerry, Ted and Carole Ann’s relationship feels hollow, an artifice. REPORTER Is it just being in the wrong place at the wrong time, Ted? TED It’s just being me in any place, I guess.   One set of circumstances seemed to bootstrap another, and once you get people thinking in that vein, police officers, they want to solve crimes, and sometimes they don’t really think things through.   They’re willing to take the convenient alternative.   The convenient alternative is me. Bailiff Watson arrives: BAILIFF WATSON The jury has reached a verdict. TED Seven hours.   Bless their hearts. INT. MIAMI COURTROOM - DAY 150   150  The jury files in.   The foreman passes the verdict to Judge Cowart who passes it to COURT CLERK SHIRLEY LEWIS. Ted stands. COURT CLERK LEWIS We the jury, in Miami-Dade County, Florida, find the defendant, Theodore Robert Bundy... ...as we PUSH IN on the lawyers, the groupies, the press. ...on Louise. ...on Carole Ann. INT. LIZ’S HOUSE - DAY 151   151  ...Liz and Jerry, now watching   together .   He’s her support.  96.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 195
    },
    {
      "scene_number": 13,
      "slugline": "INT. MIAMI COURTROOM - DAY 152   152  ...CLOSER ON Ted,   alone , betraying no emotion. COURT CLERK LEWIS (O.S.) ...guilty as charged. ...Larry Simpson pumps his fist.   He won. INT. LIZ’S HOUSE - DAY 153   153  ...Liz’s soul dies behind her eyes. INT. MIAMI COURTROOM - DAY 154   154  THE SOUND DROPS OUT, except for Judge Cowart’s voice, which sounds as clinically detached as the narration of an old public service announcement. JUDGE COWART It is this court’s reasoned judgment that you be adjudicated guilty of murder in the first degree; that the killings were indeed atrocious and cruel, in that they were extremely wicked, shockingly evil, vile, and with utter indifference to human life; and that you shall be put to death by a current of electricity that shall pass through your body until you are dead. INT. MIAMI COURTROOM - DAY 156   156  Now in the penalty phase of the trial, Ted listens to his mother break down on the witness stand. LOUISE I consider the death penalty to be the most primitive, barbaric thing that one human can impose on another.   My Christian upbringing tells me that to take another’s life under any circumstance is wrong, and I don’t believe the state of Florida is above the laws of God. JUDGE COWART (tenderly) Now, now, mother.   We haven’t lost a mother yet.  97.",
      "characters": [],
      "action_text": "Ted chokes up. INT. AA MEETING - NIGHT Liz stands in an AA MEETING. INT. MIAMI COURTROOM - DAY As Ted stands before Judge Cowart. INT. AA MEETING - NIGHT Trembling.   Scared: LIZ My name is Elizabeth Kendall, and I’m an alcoholic. INT. MIAMI COURTROOM - DAY Shaky.   Tearful.   Like a son facing his father: TED I’m not asking for mercy.   I find it absurd to ask for mercy for something I did not do.   I’m not the one responsible for these horrific acts.   Although the verdict found in part that those crimes had been committed, it erred in finding who committed them.   As a consequence, I cannot accept the sentence, because it is not a sentence of   me,   it is a sentence of someone else who is not standing here today. JUDGE COWART The court is going to sentence the person found guilty of the offense. Your name, sir, was on the verdict. Carole Ann struggles to restrain her own revulsion. JUDGE COWART (genuinely) Take care of yourself, young man. I say that to you sincerely. You’re a bright young man.   You’d have made a good lawyer, and I’d a loved to have you practice in front of me.   But you went another way, partner.  98.  (MORE) It’s a tragedy to see such a total waste of humanity that I’ve experienced in this courtroom.   I don’t have any animosity toward you.   I want you to know that. Take care of yourself. TED Thank you. Cowart anti-climactically taps the gavel.   Ted looks into the gallery in time to see Carole Ann running out without looking back.   He’s now completely alone. As he’s shackled and taken away, the CAMERA FINDS -- etched into the wood of the defense table where Ted’s seat was, the SILHOUETTE OF A SHARK. CUT TO BLACK. We think it’s over, until... INT. UNIVERSITY MEDICAL DIVISION - DAY The office is now more modernized.   Other women work here now, and there’s a different face at Liz’s old desk. SUPER:   1989.   Nine Years Later.  After a beat, LIZ, now in her 40s, exits an office marked “DIRECTOR.”   She’s several years sober and further along ",
      "dialogue_count": 0,
      "word_count": 685
    },
    {
      "scene_number": 14,
      "slugline": "INT. LIZ’S OFFICE - NIGHT   *  Later, with her coworkers gone for the evening, Liz shuts the   *  door.   She takes the letter out from her desk, opens it, and   *  reads it alone...   *  TED (V.O.) Dear Liz.   This will be my last letter.   If anyone deserves to hear it as it was -- it’s you. Off Liz, yet to look away... CUT TO:  ARCHIVAL FOOTAGE of the usual mix of protesters and supporters lined up outside the prison with signs and t- shirts... the circus is still strong nine years later...  NEWS REPORTER (V.O.) ...convicted murderer Ted Bundy is set to die tomorrow in the electric chair unless the Florida Supreme Court grants him a fourth stay of execution... INT. HIGH SECURITY VISITATION ROOM - DAY 161   161  Liz waits, nervously bouncing her leg.   A metal door OPENS. Liz steels herself.   This is the hardest thing Liz has ever had to do. SEPARATED BY GLASS... guards usher in Ted, now 42, thinner, gaunt, lacking the sturdy frame of his youth.   Pale from nine years behind bars.   By now he’s gotten used to the LEG BRACE and CHAINS as he moves.   He stops dead when he sees Liz. He sits across from her.   Picks up the phone.   She hesitates, then picks up hers. A long beat of silence.   Neither know what to say. TED (beat) Never lose hope. Ted notices Liz’s wedding ring.   Tries to hide the sting with a smile.   His   smile -- which doesn’t have the same power anymore.   It’s dimmer.   Weaker.  LIZ I didn’t come to catch up, Ted.   I came because I need to hear the truth.  100.",
      "characters": [],
      "action_text": "TED It’s all there in the letters. LIZ The whole truth. TED There is no truth, only controversy. LIZ There are detectives from seven states out there, lined up with armloads of open case files. TED It’s never going to stop, is it? LIZ It will stop with the truth.   You can stop it. TED I didn’t do anything, Liz. LIZ (re: detectives outside) You’re telling them that you did. That’s what you’re doing, right? Trading the truth to buy more time? TED I’m telling them what they want to hear because it’s the only way to save my life.   I haven’t been convicted of anything except this Florida thing -- which I’m still appealing -- but they’re going to fry me tomorrow if I don’t give them something.   I have no choice. LIZ Do you remember the night we met? TED You made heart valves. LIZ You told me you were a lawyer.   We started with a lie, Ted. TED My love was never a lie.   I fell in love the moment I saw you.  101. LIZ I need to hear the truth now. TED You know I’m not capable of these things, Liz.   I would never hurt a woman.   Have I ever laid a hand on you?   Have I ever even raised my voice?   Remember when we went shopping for ski racks and that lady got her purse snatched-- LIZ  I’m the one who gave your name to the police . Ted lets it sink in. LIZ It was 1974.   They put that sketch in the paper of the man at Lake Sam who used a fake cast to lure two girls into helping him mount a sailboat onto a ski rack on his Volkswagen Bug.   A ski rack that I lent you. TED I remember that sketch.   Everyone teased me about the resemblance. We used to laugh about it together. LIZ Part of me never believed you were capable of these things.   Part of me still doesn’t.   For years, I’ve carried this horrible guilt that I’m to blame for everything.   I used to think I ruined your life, but now I realize you almost ruined mine.   What if I could have saved some of those girls?   I can’t live like this anymore, Ted.   It’s not my guilt.   It’s yours.   You’re the only one who can r",
      "dialogue_count": 0,
      "word_count": 1689
    }
  ]
}