{
  "slug": "family-guy-103-chitty-chitty-death-bang-1998",
  "title": "family guy 103 chitty chitty death bang",
  "genre": "drama",
  "format": "series",
  "scenes_count": 6,
  "characters_count": 0,
  "characters": [],
  "total_words": 6091,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. MEG'S LOCKER - DAY  Meg is at her open locker. She sees a gaggle of CHEERLEADERS pass her by. CHEERLEADER #1 Boy, it sure is great being thin and popular. CHEERLEADER #2 Hey, let‘s go throw up! All the cheerleaders say \"sure,\" \"yeah,\" \"sounds fun,\" etc. MEG (SIGH) I wish I had someone to throw up with. Meg slams the door to her locker, revealing JENNIFER, a pretty girl with very short hair. JENNIFER Hi, I'm Jennifer. MEG Hi... I'm Meg. JENNIFER God, your hair is so beautiful. I just want to brush it. MEG Really? Well, uh, I feel the same way about your, uh... (OFF HER SHORT HAIR) teeth. Jennifer smiles. Meg smiles.  EXT./ESTAB. GRIFFIN HOUSE - DAY  FAMILY   GUY   -   \"CHITTY   CHITTY   DEATH   BANG\"   (TABLE   DRAFT)   8/20/98   15.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 133
    },
    {
      "scene_number": 2,
      "slugline": "EXT. GRIFFINS' DRIVEWAY - SAME  Peter is heading toward his car as CLEVELAND and QUAGMIRE pull up in Quagmire's 1956 Buick Convertible. QUAGMIRE Hey, Pedro, we're heading down to The Drunken Clam for a couple of beers, and I‘m gonna shake the lady tree and see what falls out. All riiiight. CLEVELAND Quagmire, when are you going to learn? PETER Sorry, guys. I gotta drop off a deposit check for Stewie's birthday party at Cheesie Charlie's. QUAGMIRE Cheesie Charlie's? Whoa, that's gonna cost ya a healthy chunk of do-re-mi. PETER Lois has her heart set on the place. Besides, she told me they're givin' us a package deal. Pizza, birthday cake, they even give ya free tokens. CLEVELAND The first ones are always free, Peter. Then before you know it, you've spent eighty dollars trying to win a Chinese fingertrap. (SIGHS) The Chinese certainly are an inscrutable people.  FAMILY   GUY   -   \"CHITTY   CHITTY   DEATH   BANG\"   (TABLE   DRAFT)   8/20/98   16.",
      "characters": [],
      "action_text": "QUAGMIRE Face it, Peter, you're an easy mark. You couldn't be more of a sucker if you were wrapped in plastic with a stick comin' out of your oh, yeah! PETER What the hell're you talkin' about? I‘ve only been conned once in my life. But that was a very sophisticated scam.  INT. BANK - DAY (FLASHBACK)  Peter holds a baggie full of bright orange fish in water. He addresses a bank teller. PETER (IRATE) Whadda you mean, \"worthless?\" The guy at the store said these were gold fish.  EXT. GRIFFINS' DRIVEWAY - DAY (BACK TO PRESENT)  PETER And I'll be damned if I ever get taken like that again.   Cheesie Charlie is gonna be no match for Peter-Peter Penny... uh... Eater. Peter stomps off, determined. Cleveland turns to Quagmire. CLEVELAND Cleveland Jr. swallowed a quarter once. It came out eventually, but we decided it was best to take the loss.  FAMILY   GUY   -   \"CHITTY   CHITTY   DEATH   BANG\"   (TABLE   DRAFT)   8/20/98   17. EXT./ESTAB. CHEESIE CHARLIE'S - DAY INT. CHEESIE CHARLIE'S - SAME  A restaurant/party place for kids, lots of games, play areas, etc. There's an animatronic band with various animals playing instruments. In the b.g., we see some birthday parties in progress. Peter enters with a full head of steam. PETER (MUTTERING) Try to rip me off.. I'll show you, Cheesie Charlie... He stops. PETER'S P.O.V.: A colorful ball pit. Peter is tempted, but he shakes it off and continues his purposeful stride. PETER (CONT'D) (MUTTERING) Screw me? Uh-uh, screw you. He stops again and looks again. PETER'S P.O.V.: Kids play in the ball pit. Peter takes two more steps, then dashes for the ball pit. He jumps in and most of the balls and all the kids fly out. Peter stands up and resumes his determined walk. PETER (CONT'D) (MUTTERING) Got another thing comin'. A young, pleasant MANAGER comes over to Peter. MANAGER Welcome to Cheesie Charlie's. Are you here for an affair? PETER An affair? I hardly know you. An ANIMATRONIC BEAR DRUMMER on the bandstand does a rimshot. PETER (CONT",
      "dialogue_count": 0,
      "word_count": 3863
    },
    {
      "scene_number": 3,
      "slugline": "INT. LOIS' WOMB - LATER (FLASHBACK)  STEWIE'S P.O.V.: - Light streams in as the walls of the cell part. Stewie starts toward the opening. STEWIE (V.O.) And then, without warning, there was a light at the end of the tunnel. I took advantage of the opening. Free at last!  INT. DELIVERY ROOM - DAY - CONTINUOUS (FLASHBACK)  STEWIE'S P.O.V.: -- The screen parts, revealing a bright white light. Suddenly a man's face (the DOCTOR) appears in the screen. He wears white scrubs. STEWIE (V.O.) But suddenly, I was seized by a mysterious Man in White!  EXT. GRIFFINS ‘ BACK YARD - DAY (BACK TO PRESENT)  Stewie snaps out of his reverie. STEWIE The Man in White! Of course. That cervical warden failed to thwart my escape into the outside world. Now, on the anniversary of his blunder, he's returning to rectify his mistake and put me back in the womb! But I shall be prepared.  EXT. /ESTAB. CULT MANSION - SAME INT. CULT MANSION - SAME  Jennifer sees Meg looking down-hearted as she gazes at a boy.  FAMILY   GUY   -   \"CHITTY   CHITTY   DEATH   BANG\"   (TABLE   DRAFT)   8/20/98   42.",
      "characters": [],
      "action_text": "JENNIFER Meg, you seem sad. Today's a happy day! MEG I know. It's just that... well, I really like that guy over there, but he doesn't even know I exist. He must think I'm like a total dog. JENNIFER Oh, that's so not true! You look great. MEG Then what is it? JENNIFER He's a eunuch. MEG (CHEERED) Really? JENNIFER Sure! All the guys here have been chemically castrated. It's cool! We see two CULT BOYS near the punch bowl, checking out girls. CULT KID #1 Hey, do you think that girl is hot? CULT KID #2 No. CULT KID #1 Me neither! The two boys high five.  FAMILY   GUY   -   \"CHITTY   CHITTY   DEATH   BANG\"   (TABLE   DRAFT)   8/20/98   43.",
      "dialogue_count": 0,
      "word_count": 308
    },
    {
      "scene_number": 4,
      "slugline": "EXT. GRIFFINS' BACK YARD - SAME  Accompanied by cheezy Vegas music, DAVID COPPERFIELD has Cleveland in a vertical box. He appears to be inserting sheets of metal right through Cleveland's body! The PARENTS watch, entertained. ANGLE ON QUAGMIRE, talking to an attractive SINGLE MOM. QUAGMIRE I got a trick for you. Write your phone number on this piece of paper. She does. QUAGMIRE (CONT'D) Now don't tell me what it is. Just put it in my pocket. (AS SHE DOES SO) All riiiiight. ANGLE ON CLEVELAND, whose head (still in a box) is now detached from his body and being held aloft by Copperfield. CLEVELAND Mr. Copperfield, you are truly the master of prestidigitation. Peter runs over. PETER Cleveland, I gotta find Meg. You gotta take me to that party she's at! CLEVELAND Peter, I'm in no condition to drive. I've had three beers. Besides, a man can't leave his own son's birthday festivities.  FAMILY   GUY   -   \"CHITTY   CHITTY   DEATH   BANG\"   (TABLE   DRAFT)   8/20/98   44.",
      "characters": [],
      "action_text": "PETER Aw, he won't even notice I‘m gone. He's playing with his little friends. PAN TO Stewie, surrounded by other one year olds in diapers. He paces up and down before them like a general addressing his troops. STEWIE ‘The hour of reckoning is at hand. The Man in White is coming for me. You could be next. And you! The children look at him, cluelessly. One of them falls over. STEWIE (CONT'D) But today I offer you the opportunity to join with me in glorious battle. I know there are some amongst you whose motor skills are not yet developed. Sadly, you will be used as decoys. But your children's children will know that you fell for a noble cause. Now, who's with me? They stare at Stewie. One of them smiles. INFANT (HAPPILY) Ducky? STEWIE Useless, everyone of you! Fine! I'll defend myself and the rest of you can rot in hell! (BEAT; AGGRAVATED SIGH) There, I‘ve gone and soiled myself. Are you happy now?  FAMILY   GUY   -   \"CHITTY   CHITTY   DEATH   BANG\"   (TABLE   DRAFT)   8/20/98   45.",
      "dialogue_count": 0,
      "word_count": 344
    },
    {
      "scene_number": 5,
      "slugline": "INT. PETER'S CAR - DAY  Peter drives. The box with Cleveland's head sits in the passenger seat. PETER Now where? CLEVELAND Left at the light. But can you pull over? I gotta... I gotta make water.  EXT. /ESTAB. CULT MANSION - SAME INT. CULT MANSION - SAME  We hear a large gong sound. The kids all reverently turn to a large door. Jennifer leans over to Meg. JENNIFER Ooh! Our leader is here. He's going to take us on our journey. MEG So he's like a tour guide? JENNIFER (BRIGHTLY) Okay! The door flies open, and the CULT LEADER ‘enters. He's got short white hair and looks like vegetarian. CULT LEADER My children! It's time to celebrate the hour of transformation. The Cult Leader notices Meg. CULT LEADER (CONT’D) Who are you?  FAMILY   GUY   -   \"CHITTY   CHITTY   DEATH   BANG\"   (TABLE   DRAFT)   8/20/98   46.",
      "characters": [],
      "action_text": "JENNIFER This is Meg, oh wise one. Can she come with us? CULT LEADER Perhaps. (TO MEG) Do you have a mind that seeks enlightenment, a heart that seeks purity, and a dark blue jogging suit? MEG I have a black one with the name of my high school on it... CULT LEADER (LOSING IT) Not black! (COMPOSING HIMSELF) I'll see what we have in stock. What're you, about a nine? MEG (EMBARRASSED) Hahaha, no, a six! CULT LEADER (SURE YOU ARE) Right. My mistake. (TO JENNIFER) Dispense the, uh, refreshments! The Cult Leader goes into another room. Jennifer starts ladling the punch and handing out cups to the others. Meg takes a cup as we PAN TO another door where Peter enters. PETER Meg, there you are. (TO JENNIFER) Nice place you got here. Parents in the Mob?  FAMILY   GUY   -   \"CHITTY   CHITTY   DEATH   BANG\"   (TABLE   DRAFT)   8/20/98   47. JENNIFER I don't have any parents. MEG I wish I didn't. (TO PETER) What are you doing here? God, I‘m so humiliated I could die. CULT KID #1 Hey, hey. Not before the rest of us. Jennifer offers him a cup for punch. JENNIFER Would you like a drink, Mr. G? PETER Does it have booze in it? JENNIFER No, sir. PETER No, thanks. Meg, your mother wants the family together today. JENNIFER We're Meg's family now. MEG That is so sweet. PETER Hold the phone. I don't remember• anyone here changin' her diapers or feeding her in the middle of the night or takin' care of her when she was sick.  FAMILY   GUY   -   \"CHITTY   CHITTY   DEATH   BANG\"   (TABLE   DRAFT)   8/20/98   48. CULT KID #1 (TOUCHED) You did all that? PETER Hell, no, not me. But her mom did. (TO MEG) She's always doin' stuff for me and you kids. That‘s why when she asks us to do something, we should do it. MEG I know, but it‘s just Stewie's birthday. Why does she care if I'm there? PETER I don't know... Maybe, it‘s kind of like her birthday, too. Once a year for each of you, your mom gets to remember the day you came into her life. MEG (TEARING UP) I'm the worst daughter ever! PETER No, you're",
      "dialogue_count": 0,
      "word_count": 881
    },
    {
      "scene_number": 6,
      "slugline": "EXT. GRIFFINS' BACK YARD - DAY  The party is winding down. Lois looks around sadly. LOIS (SADLY) Well, I guess there's nothing left but the birthday cake. Meg comes out of the house holding the cake. MEG One vanilla-fudge swirl with buttercream frosting, coming right up! LOIS Meg! MEG I'm sorry, Mom. Peter enters. Lois sees him. LOIS (TOUCHED) Thank you, Peter. PETER No problem. (CHEERFULLY) Hey, now that we're all here, what say we cut the damn cake! LOIS Gather round, everyone, it's time for Stewie's big moment.  EXT. GRIFFINS' HOUSE - CONTINUOUS  The Cult Leader knocks on the front door. The door slowly swings open with a creak. CULT LEADER Hello?  FAMILY   GUY   -   \"CHITTY   CHITTY   DEATH   BANG\"   (TABLE   DRAFT)   8/20/98   52.",
      "characters": [],
      "action_text": "He enters, tentatively.  INT. GRIFFINS' HOUSE - CONTINUOUS  The Cult Leader walks in the hall. The place is eerily quiet. He hears a scampering behind him and whirls, but nothing's there. CULT LEADER Is anybody home? The door slams shut behind him. CULT LEADER (CONT'D) Aaah! Stewie's voice is amplified - - it sounds as if it's coming from all around. STEWIE (V.O.) (AMPLIFIED & FILTERED) Greetings, Man in White. I've been expecting you. CULT LEADER (SCARED) Who said that? STEWIE (V.O.) (AMPLIFIED & FILTERED) Peek-a-boo, I see you! The Cult Leader turns toward the living room and spots a partially open closet door with a mirror on it. STEWIE (V.O.) (CONT’D) (AMPLIFIED & FILTERED) You're getting warmer! The Cult Leader moves towards the closet door, then throws it open! It's just a baby monitor. CULT LEADER Where are you? What do you want!  FAMILY   GUY   -   \"CHITTY   CHITTY   DEATH   BANG\"   (TABLE   DRAFT)   8/20/98   53. STEWIE (V.O.) (AMPLIFIED & FILTERED) Freedom! What do you want? CULT LEADER I want to get the hell out of here. STEWIE (V.O.) (AMPLIFIED & FILTERED) I'm sorry, we're fresh out of that. I'm afraid all we have left is untimely death! The Cult Leader hears a noise behind him. He whirls around -- no one's there. He turns back and closes the closet door. We see in the mirror that Stewie's standing right behind him! He wields a strange looking laser-sighted raybeam. The Cult Leader spins around to face him. CULT LEADER What the hell is this? STEWIE It's a boy! SMASH CUT TO:  EXT. GRIFFINS' BACK YARD - CONTINUOUS  Lois is lighting a big candle on the cake. PETER Hey, anybody seen Stewie? From behind, we see the whole inside of the house light up from the laser and hear a pshoooo sound. MEG Yeah, where's the birthday boy? Stewie comes swaggering out of the yard, brushing some dust off his clothes. STEWIE Victory is mine!  FAMILY   GUY   -   \"CHITTY   CHITTY   DEATH   BANG\"   (TABLE   DRAFT)   8/20/98   54. LOIS Yes, and this cake is yours, too, if you blow",
      "dialogue_count": 0,
      "word_count": 562
    }
  ]
}