{
  "slug": "fargo-301-the-law-of-vacant-places-2017",
  "title": "fargo 301 the law of vacant places",
  "genre": "drama",
  "format": "series",
  "scenes_count": 9,
  "characters_count": 0,
  "characters": [],
  "total_words": 13028,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. STASI INTERVIEW ROOM. EAST BERLIN - DAY (1988) 1   1 The room is sparse, with a single HARDBACK CHAIR positioned across from a DESK, under a hanging MICROPHONE. A table-top reel to reel tape recorder is on the desk. There is a drain in the center of the concrete floor. A MAN (50), meticulous, wearing glasses, sits behind a desk, wearing a Stasi police uniform. This is Colonel HORST LAGERFELD. He is eating a sandwich that has been wrapped in wax paper. A knock at the door. HORST Kommen. The door opens. A young STASI OFFICER stands there holding the arm of a fat, balding man, JAKOB UNGERLEIDER, in his mid- forties. (The following exchange takes place in German.) HORST (CONT’D) (barely looking up) In the chair. Horst returns to his lunch, as the officer sits the man in the chair, then withdraws. A long, tense silence. Horst eats. The man, JAKOB, looks around. ANGLE ON A REEL-TO-REEL RECORDER Light off, reels still. ANGLE ON JAKOB in the chair, nervous, sweating. He looks up. ANGLE ON THE MICROPHONE Hanging down from the ceiling. ANGLE ON JAKOB in the chair. He looks at -- ANGLE ON HORST He finishes his sandwich, licks his fingers, then carefully refolds the wax paper for future use. He opens his desk drawer, puts the wax paper inside, pulls out a FILE FOLDER, slides the drawer closed. He opens the folder, looks inside, then reaches over and turns on the recorder. The light comes on, reels begin to spin. Finally, Horst looks up at the man.",
      "characters": [],
      "action_text": "HORST (CONT’D) You are Yuri Boiko. JAKOB No, sir. My name -- thank goodness - - my name is Jakob Ungerleider. There is some misunderstanding. Horst studies the file, tsking to himself, unconcerned. HORST You live at 349 Hufelandstraße. JAKOB Yes, sir. HORST Well then -- Yuri Boiko is the registered occupant of 349 Hufelandstraße. So if that is your address, then your name is Yuri Boiko, and you are a twenty year   * old émigré from the Ukraine. Jakob blinks. He is a forty-six year old father of two. JAKOB Sir, I am from Stuttgart. A German citizen. As you can plainly see, I have not been twenty years old for   * a very long time. Horst studies the file, tsking to himself. JAKOB (CONT’D) (cautiously) Perhaps -- if I may -- I have only lived at this address -- 349 -- for six months. So, perhaps Yuri was the previous -- Horst holds up his hand. Jakob stops talking. HORST (beat, tsking) This is a problem, you understand? Because for you to be right, the state would have to be wrong. Is that what you’re saying? That the state is wrong? JAKOB (trapped) No, sir.  F A R G O #301   FULL BLUE - 12/12/16   2. HORST Good. Then you admit that you are Yuri Boiko. And your girlfriend’s name is Helga Albracht.   * JAKOB (taken aback) My -- no, sir. I don’t have -- (reluctantly) I mean,   m y   wife , she is in fact named Helga, yes, but not --   * HORST Excellent. JAKOB -- Albracht -- HORST (not listening) Now we are getting somewhere. And was it this morning or last night that you strangled her? JAKOB What? HORST Your girlfriend.   Helga Albracht .   * You killed her last night or this morning? JAKOB Sir -- please. This must be -- I do not -- as I said before -- I do not have a girlfriend. I have a wife, and though she is named -- coincidentally -- she is named Helga, yes, but Helga   Ungerleider ,   * not -- and also, believe me -- Helga, my wife, is very much alive.   * In fact, when your men came to pick me up only an hour ago, she was home. My wife was home, and offered them t",
      "dialogue_count": 0,
      "word_count": 1849
    },
    {
      "scene_number": 2,
      "slugline": "INT. STUDY. EMMIT STUSSY HOUSE’S - SAME TIME 6   6 * An important man’s lair. Emmit sits in a puffy chair. Sy Feltz leans against the credenza. Emmit and Buck are smoking   * cigars. Sy has a pipe.   * EMMIT We called the number. They said if there was ever a problem we should call the number. And, well, we called it.” ANGLE ON BUCK OLANDER Sitting on the sofa, facing them. He’s a heavyset man, former head of the Chamber of Commerce. BUCK And? EMMIT A series of clicks and buzzers. BUCK A series of -- EMMIT Clicks and buzzers. That’s what we got -- which -- SY Couldn’t even leave a message. EMMIT No message possible. So we thought - - SY We thought get Buck back in here. After all, he vouched for ‘em.” BUCK Well now -- let’s be -- call a spade a spade -- don’t know ‘em. Don’t vouch for em. I was just a conduit for information. Like you said,   Buck, we tried all the normal channels -- need a bridge loan ta -- last year, fer pete sake --   and I’d met this fella at the Shriners --  F A R G O #301   FULL BLUE - 12/12/16   8.",
      "characters": [],
      "action_text": "EMMIT Sure, okay. And everything worked out great when we met the broker, a Mr. Ermentraub, if I’m not --  F A R G O #301   FULL BLUE - 12/12/16   8A. SY Right. Rick Ermentraub. I got his card in my --(rolodex) EMMIT -- and now, we’re in the black again, so we call the number ta arrange payback and -- clicks and buzzers. SY Maybe there’s another number, we’re thinkin. EMMIT Another number where we could at least leave a darn message. It’s a lotta money. SY A heck of a lot. EMMIT And it’s just sitting there on the books -- which -- SY Can’t have that. Beat. Buck thinks about it. BUCK Wish I could help. But this Ermentraub fella, like you said, I met him at Mussbaum’s last year -- shared a pilsner out on the veranda. That’s about the extent of our -- EMMIT It’s real peculiar. That’s all we’re sayin. Ta lend out money and then -- SY So if you had another number, or -- A long beat. Buck doesn’t. EMMIT Okay then. Well, thanks for coming in. Buck stands.  F A R G O #301   FULL BLUE - 12/12/16   9. BUCK Course. And did you think about   * what I asked? The Widow Goldfarb.   * She wants to meet.   * EMMIT   * The who?   * SY   * I was gonna tell ya. She’s the so   * called storage queen, sniffin   * around fer a possible silent   * partner type arrangement.   * BUCK   * She seems like the real deal. Money   * ta burn.   * EMMIT   * Where was she two years ago?   * CUT TO: INT. ANTECHAMBER. EMMIT STUSSY’S HOUSE - CONTINUOUS 7   7 * Ray sits outside, losing his cool. The study door opens. Buck exits with Sy stepping out behind him. SY But seriously, if you hear anything. Buck exits through a second door. Ray stands. Sy barely glances at him. SY (CONT’D) Give us another five, huh, Ray? He goes back into the study, closes the door. Ray fumes, sits. CUT TO: ANGLE ON A POSTAGE STAMP vintage, behind glass, inside a frame. We pull out to find we are in -- INT. STUDY. EMMIT STUSSY’S HOUSE - LATER 8   8 * The stamp is hanging on the wall behind an expensive desk. Emmit Stussy sits be",
      "dialogue_count": 0,
      "word_count": 2731
    },
    {
      "scene_number": 3,
      "slugline": "INT. RED OWL GROCERY. EDEN VALLEY, MN - DAY 19   19 * Nathan closes the cash register drawer. Ennis is sleeping it off behind the counter. A CUSTOMER exits through the automatic doors. Nathan picks up a mop. ANGLE ON THE GLASS DOORS We see a woman, GLORIA BURGLE (30s), approach in a winter coat and tuque. She’s a practical woman, the one who grabs the fire extinguisher when the bacon catches fire and everyone else panics. She steps up to the automatic doors. THEY DON’T OPEN. She frowns, steps back, tries again. Nothing. She waves at the sensors. It’s like she’s invisible. ANGLE ON NATHAN He notices, puts the mop down. He walks up to the doors. They open easily. Gloria enters. GLORIA That’s weird, huh? You ready? Nathan nods, puts the mop away. Ennis wakes, sits up wiping his mouth. GLORIA (CONT’D) See ya tonight, pops? ENNIS If Macaroni and Cheese don’t float yer boat, might as well stay home. They exit. CUT TO: EXT. BAR. ST. CLOUD, MN - DAY 20   20 Ray’s Corvette screees into the parking lot, parks. CLOSE ON RAY As he gets out, looks at the bar. CUT TO: INT. BAR. ST. CLOUD, MN - DAY 21   21 Ray enters, looks around. It’s not a nice place. He sees --  F A R G O #301   FULL BLUE - 12/12/16   21.",
      "characters": [],
      "action_text": "ANGLE ON A MAN MAURICE LEFAY (40s) sitting in a booth. There are two empty beer bottles in front of him, and a WAITRESS puts down a fresh one. Maurice is a stoner, his already dulled intellect hobbled further by all the greenery he smokes. He’s wearing a faded t- shirt that reads --   Russia is for Lovers.  RAY approaches. Maurice doesn’t look up. He’s just turning his silver lighter between the fingers of his right hand, and tapping it on the table over and over, hypnotized. RAY Maurice. (beat, louder) Maurice! MAURICE (looks up) Huh? Oh. Hey, Ray. Ray takes a folded piece of paper from his pocket, drops it on the table. RAY Ya blew yer piss test, pal. Maurice unfolds the paper, but he already knows what it says. MAURICE Bummer. Look -- RAY A thing like that -- normally that gets ya right away revoked, but I thought maybe call him up, see what he has ta say. Maurice studies him. He knows nothing in this life is free. MAURICE Yeah Cool, cool. Maurice looks around. MAURICE (CONT’D) Hey -- how come we’re meetin in a bar? (off Ray) Not in the office, I mean.  F A R G O #301   FULL BLUE - 12/12/16   22. Beat. Ray sits. He takes Maurice’s beer, tips it back. MAURICE (CONT’D) I was drinkin that. Ray drinks the whole thing. He needed that. He puts down the bottle. RAY Let’s cut to the quick here. Yer last stretch was six and a half fer breakin inta rich folk’s digs, and stealin their flat screens. MAURICE Allegedly. RAY No -- moron -- how it works is -- when they convict ya it turns into a fact. He gestures to the waitress for another beer. RAY (CONT’D) Now look -- I got a place -- turns out -- a place that needs some robbin. A little robbin. Not wholesale burglary. Just a specific -- just lookin fer a certain item -- and if ya do it -- He takes the paper from Maurice, tears it in half. RAY (CONT’D) Let’s just say yer little problem goes up in smoke. Maurice studies him. MAURICE What are we talkin about? RAY (big deal) A stamp. MAURICE Cool, cool. Like a -- postage stamp? ",
      "dialogue_count": 0,
      "word_count": 926
    },
    {
      "scene_number": 4,
      "slugline": "EXT. EMMIT STUSSY’S HOUSE. EDEN PRAIRIE, MN - NIGHT 23   23 * Emmit’s car pulls out of the driveway. We PAN to the RED   * BRICK GATE and find the address.   * STUSSY 914 MAIDEN LANE   * CUT TO: HEADLIGHTS ON THE OPEN ROAD 24   24 As the car moves through the night. CUT TO: INT. MAURICE’S CAR (TRAVELING). RURAL MINNESOTA - NIGHT 25   25 We start on a PIECE OF PAPER on the center console.  Emmit Stussy 914 Maiden Lane Eden Prairie, Minnesota.  PAN UP to find Maurice driving. He’s smoking a joint and seems to be talking to himself. MAURICE You ever think about how they never put the morgue on the top floor of a hospital? I notice stuff like that. It’s always in the basement, with, like, it’s own elevator. A VOICE responds through the car’s bluetooth. THERAPIST (O.S.) And how does that make you feel? MAURICE Huh? No. It’s -- what I’m sayin is - - you asked me how I define the person called   me , and I’m sayin I’m always having thoughts. Whatdya -- insightful. (smokes) For example, where does the President of the United States buy clothes? Do they shut down like the whole J.C. Penny, just so he can try on a suit?  F A R G O #301   FULL BLUE - 12/12/16   26.",
      "characters": [],
      "action_text": "THERAPIST (O.S.) There’s a tailor. He comes to the White House. Maurice peers through the windshield. It’s getting harder and harder to see. He waves at the smoke. MAURICE Now see, I didn’t know that. THERAPIST (O.S.) Let’s -- focus. So when you say your parole officer was mean to you before, how did that make you feel? MAURICE Ya know, man -- just -- not good, ya know. I mean, here I am. I’m tryin, ya know. A new leaf. Not hurtin anybody. I have, but, ya know, not currently. Change and all that -- growth. So -- A long toke. Maurice waves at the smoke, which gets in his eye. THERAPIST (O.S.) Are you getting high? He starts coughing. MAURICE No. He ROLLS DOWN THE WINDOW to clear the car. ANGLE ON THE CAR From outside, in the rear, SMOKE POURS OUT. THERAPIST (O.S.) Maurice? INSIDE THE CAR A strong wind blows in. ANGLE ON THE PAPER with the address written on it. It lifts up in the wind, turns a little circle in mid-air and is then sucked out the window. Maurice tries to grab it, misses.  F A R G O #301   FULL BLUE - 12/12/16   27. MAURICE Shit. He swerves, almost crashes, before stopping. CUT TO: EXT. SIDE OF THE ROAD. RURAL MINNESOTA - NIGHT 26   26 Pitch black, except for the car’s headlights. Maurice has parked on the shoulder. We can see him in the beams, searching the white snow for the white page with the address. From the car we hear a faint -- THERAPIST (O.S.) Maurice? Maurice searches some more, but it’s hopeless. He straightens. MAURICE Screw it. I remember. He walks back to the car. We DROP DOWN to find the piece of   * paper in foreground, flapping in the breeze.   * CUT TO: INT. KITCHEN. ENNIS’ HOUSE. EDEN VALLEY, MN - NIGHT 27   27 * A small house, basically a geriatric bachelor pad. The kitchen is small, cluttered. There’s a CRAFT TABLE on one wall, where Ennis builds models. Ennis sits at the round dining table with his grandson Nathan. They’ve eaten dinner. Nathan opens a small BOX.   * Inside is a PRESENT from his grandfather.   * It’s a wood carving",
      "dialogue_count": 0,
      "word_count": 2944
    },
    {
      "scene_number": 5,
      "slugline": "INT. ENNIS’ HOUSE. EDEN VALLEY, MN - NIGHT 43   43 * ANGLE ON THE TV A sci-fi movie. The camera FINDS Ennis, asleep in his chair. A SCREAM from the movie wakes him. He sits up, looks around. He’s sober now, or at least as close as he ever comes. He gets up, shuffles into the kitchen. He sees the model on the table, picks it up. So much for   he likes it.   Ennis puts it back on the table, goes to the   * freezer to find a drink.   * Then HEADLIGHTS illuminate the house, turning in, the lights raking the walls. They hit ENNIS and he squints, vodka bottle in hand. Who could that be at this hour? CUT TO: INT. HOTEL BALLROOM. ST. CLOUD, MN - NIGHT 44   44 Ray and Nikki play bridge. They win the game. NIKKI We’re doin it, babe. All the way. Beat. Ray’s happy -- he has a thought. RAY I’m gonna -- see a man about a boat. CUT TO: INT. HOTEL BAR. ST. CLOUD, MN - NIGHT 45   45 * Ray goes to the bar, dials his cell phone. It rings.   * RAY Come on. Answer the phone. MAURICE (O.S.) (voicemail) Yello. RAY Yeah, it’s -- MAURICE Gotcha -- I’m not really on the phone right now. (MORE)  F A R G O #301   FULL BLUE - 12/12/16   41.",
      "characters": [],
      "action_text": "I mean, I am, but I’m not, which is -- when ya think about it -- pretty trippy. So -- (takes a hit) -- leave a message. Beep. RAY Maurice, hi. It’s yer parole officer. I, uh, wanted ta maybe take a pause on that thing we -- not do it, I mean -- tonight   -- so -- gimme a call as soon as you get this. He hangs up. Shit.   Where is this guy ? Nikki comes over. NIKKI Babe. They’re startin the next round. RAY Yeah, I’m -- ya know -- Ray pockets his phone. NIKKI We got em on the run, but hon, ya gotta focus. These big league sponsors aren’t just lookin fer flash. It’s about seein the whole picture. Strategy. Which is my strength, you got the steely gaze,   * but still --   * ANGLE ON RAY He’s got to make a choice. RAY Yer right, hon. I’m -- we got this. They put their foreheads together. NIKKI Yer twice the man your brother is. Now let’s go kick ass. CUT TO: INT. GLORIA’S PROWLER (TRAVELING) - NIGHT 46   46 Gloria drives back toward Ennis’s. MAURICE (CONT'D)  F A R G O #301   FULL BLUE - 12/12/16   42. GLORIA When we get there I’ll run in, okay? Ya know how Ennis gets when ya wake him up. Suddenly, HEADLIGHTS hit her (on a collision course) and she SWERVES as ANOTHER CAR races past in the other direction. CUT TO: EXT. ROAD. EDEN VALLEY, MN - CONTINUOUS 47   47 Gloria’s prowler SWERVES off the road, manages to stop on the shoulder without crashing. CUT TO: INT. GLORIA’S PROWLER - CONTINUOUS 48   48 Gloria turns to Nathan. GLORIA Okay? He nods. Her eyes go the rearview. GLORIA (CONT’D) He didn’t even stop. ANGLE ON THE MIRROR Red tail lights are visible in the distance. GLORIA Picks up her handset. GLORIA (CONT’D) Hey Donny, come in. DONNY (O.S.) (on the radio) Yeah, chief. GLORIA Yeah, I’m on Malta and some fool nearly ran me off the road. DONNY (O.S.) Oh yeah? GLORIA Yeah, didn’t get a license or nothin. Some kinda sedan. Are you --  F A R G O #301   FULL BLUE - 12/12/16   43. DONNY (O.S.) Well, I’m at the precinct, ya know, in case we get a 911. GLORIA Sure, well, nothi",
      "dialogue_count": 0,
      "word_count": 1221
    },
    {
      "scene_number": 6,
      "slugline": "INT. LIVING ROOM. ENNIS’ HOUSE. - CONTINUOUS 54   54 * Gloria comes down the stairs. She looks around, goes into the   * --   * CUT TO: INT. STUDY. ENNIS’ HOUSE. - CONTINUOUS 55   55 * A small “office,” more of a nook, really. It’s where Ennis did his books for the store. All the papers are on the floor. The desk drawers have been thrown open. Gloria looks around. ANGLE ON A PAINTING On the wall. GLORIA studies it, then goes over, leans it away from the wall, looking for a safe, but the wall is blank. As she STEPS BACK, the FLOORBOARD creaks under her feet. She kneels, sweeps the paper away, revealing an old throw rug. She moves back, lifts the rug away, revealing the old wooden planks. Gloria presses on them with her hand, until she finds the one that creaks. She tries it. It’s loose. She pries it up, then the one next to it. Peering into the hole, she clicks on her flashlight. ANGLE ON THE HOLE Inside is what looks like an old metal box about two feet square.  F A R G O #301   FULL BLUE - 12/12/16   47.",
      "characters": [],
      "action_text": "GLORIA takes it out. A beat. She opens it. ANGLE ON THE BOX In it are THREE PILES OF SCIENCE FICTION BOOKS, covers facing up. They are paperbacks of a certain type -- pulp fantasies with colorful paintings of robots and tight-shirted women on swirling red planets encircled by rings. ANGLE ON GLORIA This is not what she was expecting. GLORIA Huh. Gloria picks up one of the books, looks at it. ANGLE ON THE BOOK It’s called PLANET WYH. The author’s name is THADDEUS MOBLEY.   * On the cover, A ROBOT stands over a prone MAN. ANGLE ON GLORIA She PULLS Nathan’s CARVING out of her pocket. ANGLE ON THE CARVING AND THE BOOK The carving matches the two figures on the cover. ANGLE ON GLORIA What does it mean? CUT TO: EXT. NIKKI’S APARTMENT. ST. CLOUD, MN - NIGHT 56   56 Ray and Nikki approach her front door. Nikki is giddy, jumping around, hugging him. He seems embarrassed by the public display of affection, but can’t hide his happiness.   * ANGLE ON RAY AND NIKKI   * Through the windshield of a car parked across the street -- a   * telltale air freshener hanging from the mirror.   * They go inside.   * CUT TO:  F A R G O #301   FULL BLUE - 12/12/16   48.",
      "dialogue_count": 0,
      "word_count": 413
    },
    {
      "scene_number": 7,
      "slugline": "INT. LIVING ROOM. NIKKI’S APARTMENT. ST. CLOUD, MN - NIGHT 57   57 It’s not a fancy place, but well cared for. We are moving through the living room, hearing the sound of running water from the BATHROOM. We pass an OLD AIR CONDITIONER stuck in the window, plywood on either side -- but not air tight. A little BREEZE blows past us as we pass and sways the curtains. We find the BATHROOM DOOR, half open, and move towards it. CUT TO: INT. BATHROOM. NIKKI’S APARTMENT. ST. CLOUD, MN - NIGHT 58   58 Candle lit. Ray and Nikki are in a jacuzzi bubble bath. He’s laying against her. They are both looking at their phones.   * Beat. Ray puts his down, looks around.   * RAY This is nice. Nikki is typing.   * NIKKI   * Huh? Oh, yeah.   * (puts her phone down)   * Amazing.   * She picks up her wine.   * NIKKI (CONT’D) (savoring it) Third runner up, Wildcat Regionals.   * Just posted it on my Facebook.   * RAY We played good. NIKKI We didn’t just play good. That hand I got -- ten hearts -- that doesn’t just happen. That’s -- whatdya call -- fate or luck. RAY Plus my steely gaze striking fear into the hearts of the elderly.   * NIKKI I’m prouda you, mister. You really - - you focused. It’s like I said -- simpatico.  (MORE)  F A R G O #301   FULL BLUE - 12/12/16   49.",
      "characters": [],
      "action_text": "(marvels) Third runner up. RAY In the Olympics that’s bronze. NIKKI (CONT'D)  F A R G O #301   FULL BLUE - 12/12/16   49A. NIKKI Now, see. That’s the kinda thinkin that’s gonna take us straight to the top. Just then they hear the SOUND of the apartment DOOR opening and closing. Ray looks at Nikki. Is she expecting anyone? She shakes her head. They hear FOOTSTEPS approaching the half closed door. ANGLE ON THE HALL   * Partially obscured by the door.   * ANGLE ON RAY AND NIKKI   * They both lean to try to see around the door.   * ANGLE ON THE DOOR A shadow falls on the wall outside. The door swings open, revealing: MAURICE. He comes in like it’s no big deal that he’s broken in and found them naked in the bath. He may not even notice the state they’re in. MAURICE So, I got it, Ray. I did -- but -- I won’t lie -- it didn’t go smooth. He goes over to the closed toilet, tears off some sheets of toilet tissue, lays them on top of the seat. He studies the seat, swaying, then, satisfied, he sits. Nikki looks at him -- Maurice is so stoned he may nod off any second -- then turns to Ray. NIKKI Ray, there’s a man in my bathroom. RAY That’s -- let’s not jump ta any conclusions. NIKKI Are you sayin he’s not a man, or he’s not in my bathroom? RAY I’m sayin -- I can explain. Maurice fumbles out a cigarette, puts it between his lips.  F A R G O #301   FULL BLUE - 12/12/16   50. MAURICE I had ta -- there was some actin required -- in throwin the gas station attendant off my scent, but -- He pats his pockets, looking for his lighter. NIKKI There’s no smokin in here. Maurice fumbles with the lighter, can’t get the flame to come out. MAURICE And also -- if I’m bein honest -- I sure hope that fella with the stamps wasn’t a friend a yers, Ray, cause -- well -- let’s just say, when an ex-con threatens ya, demands the goods -- well, the smart money says cooperate. This gets Ray’s attention. RAY What? Nikki turns to Ray, processing. NIKKI ( what’s going on? ) Ray. Maurice finally gets the li",
      "dialogue_count": 0,
      "word_count": 1684
    },
    {
      "scene_number": 8,
      "slugline": "INT. STAIRS. NIKKI’S APARTMENT BUILDING - SAME TIME 60   60 Maurice reaches the second landing. One to go. But his cigarette has gone out. Shit.  F A R G O #301   FULL BLUE - 12/12/16   56A.",
      "characters": [],
      "action_text": "He pauses, tries to re-light it, then sees its wet from where Ray grabbed for him, so he pulls it out of his mouth, drops it on the landing, then descends. CUT TO: INT. LIVING ROOM. NIKKI’S APARTMENT - SAME TIME 61   61 Nikki pops the board off one side of the window. The air conditioner sways, but holds. She reaches for the other board. NIKKI Forty two, forty three. Behind her, Ray doesn’t know what to make of her actions, or what to do. RAY Can you believe this guy? I gave him a simple -- even wrote down the damn -- and now -- just my luck. Just my damn luck. Nikki starts loosening the other side. NIKKI (to the board) Forty four, forty five. CUT TO: INT. LOBBY. NIKKI’S APARTMENT BUILDING - SAME TIME 62   62 Maurice reaches the front door, opens it. CUT TO: INT. LIVING ROOM. NIKKI’S APARTMENT - SAME TIME 63   63 ANGLE ON THE SCREWDRIVER digging between the window frame and the board. A screw pops, then another. NIKKI Is he out? RAY What? NIKKI The other window. Do you see him?  F A R G O #301   FULL BLUE - 12/12/16   57. Ray goes over, looks out. ANGLE ON THE STREET Beat. Maurice emerges from the front door. ANGLE ON RAY Seeing him, he realizes what she’s doing. His eyes widen. He turns. RAY Yeah. He’s -- he’s coming. Hurry. He goes to help her, leaning on the board. With a final wrench, the board pops free. The air conditioner wobbles. CUT TO: EXT. STREET. ST. CLOUD, MN - SAME TIME 64   64 Three stories below, Maurice slows, flicks his lighter. It flares once, twice, then the flame catches and he lights his cigarette. He takes a deep drag, exhales, then starts to walk. CUT TO: INT. LIVING ROOM. NIKKI’S APARTMENT - SAME TIME 65   65 ANGLE ON THE AIR CONDITIONER It teeters. ANGLE ON RAY AND NIKKI They exchange a look. Then Ray lifts his foot and GIVES THE AC UNIT a little push with his toe. The window slides up. The air conditioner FALLS. The camera follows it into a second of BLACK -- and then -- ROTATES FORWARD to find the street below. The camera is the air condi",
      "dialogue_count": 0,
      "word_count": 476
    },
    {
      "scene_number": 9,
      "slugline": "EXT. STREET. ST. CLOUD, MN - SAME TIME 66   66 Maurice takes a few steps, his car visible at the corner, and then -- BAM! -- the air conditioner flattens him (setting off   * car alarms on the block).   * A long beat. Did that just happen? RAY (O.S.) Wooo! Did you see that? CUT TO: INT. LIVING ROOM. NIKKI’S APARTMENT - CONTINUOUS 67   67 Ray is leaning out the window. RAY Did you -- oh my God. Nikki PULLS HIM in. NIKKI Get down. Someone’ll see. Ray is hyperventilating. There’s no way Maurice survived. RAY Right in the -- no way he’s -- I mean, game over. Holy shit. Nikki grabs the phone from the counter, dials. RAY (CONT’D) (notices) What are you -- She holds up a hand, affects a professional actor’s level of hysteria. NIKKI Yes. 9-11 -- it’s -- there’s been an accident. On the sidewalk. The air conditioner -- my -- She pushes Ray, covers the mouth piece. NIKKI (CONT’D) Get dressed. You gotta go. RAY What?  F A R G O #301   FULL BLUE - 12/12/16   59.",
      "characters": [],
      "action_text": "NIKKI (into phone) Thank god. It’s nine-forty Hanover   * Street. Hurry, please. She hangs up, all business. NIKKI (CONT’D) It was an accident. I’ve been tryin ta get the landlord to take that unit out fer, like, six weeks. That’s on record. And tonight -- I don’t know. It musta come loose somehow. She shoves him. NIKKI (CONT’D) (to Ray) Yer his parole officer. You can’t be here. I gave a fake name when I rented the place. I got ID. RAY That’s against -- babe, it’s a   * violation of yer -- probation.   * NIKKI Ray! RAY (snaps out of it) Right. Right. Good call. Ray grabs his pants off a chair (they undressed in a hurry), pulls them on. NIKKI We’ll talk about this later. He grabs his shirt, gets it on, grabs his shoes, stumbles for the door. RAY You are so -- sexy. She smiles, gestures for him to hurry up. NIKKI (into phone) Thank you, officer. Yes, I’ll stay on the line. (MORE)  F A R G O #301   FULL BLUE - 12/12/16   60. (covers the mouthpiece, to Ray) Don’t forget the stamps. He goes to the bathroom, grabs them off the floor. NIKKI (CONT’D) Burn em, okay? He nods. She grabs him, kisses him. NIKKI (CONT’D) I love you. RAY Baby, you have no idea. She holds up her hand NIKKI (into phone) Yes, I hear the sirens. Thank you. She waves to Ray. Go. NIKKI (CONT’D) (whispers) Back stairs. Beat. He nods, exits. CUT TO: EXT. NIKKI’S APARTMENT. ST. CLOUD, MN - NIGHT 68   68 We are outside the window, watching as Nikki turns and prepares to face the cops. As we do, the CAMERA CRANES BACK, showing the other windows of the building, some dark, some with people going about their business. A couple of HEADS are sticking out, looking towards the street, where a crowd has started to gather around the stain that used to be Maurice. SIRENS grow in the distance. CUT TO: EXT. ENNIS’ HOUSE. EDEN VALLEY, MN - NIGHT 69   69 * The COUNTY POLICE are there now, TWO CARS. A FORENSIC TEAM in inside the house. Gloria stands by her prowler. Nathan sits in the open passenger seat of Gloria’s prowl",
      "dialogue_count": 0,
      "word_count": 784
    }
  ]
}