{
  "slug": "fargo-101-the-crocodiles-dilemma-2014",
  "title": "fargo 101 the crocodiles dilemma",
  "genre": "thriller",
  "format": "series",
  "scenes_count": 4,
  "characters_count": 0,
  "characters": [],
  "total_words": 4532,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. INSURANCE AGENCY. SAINT CLOUD, MINNESOTA - DAY Lester Nygaard arrives for work.   He takes off his puffy coat, hangs it on the coat rack.   His boss, BO MUNK (50s) comes over. BO Heya, Lester. LESTER NYGAARD Oh, hiya, Bo. BO What happened to yer face there? LESTER NYGAARD Ya know that spot near the fire station? BO Where they wash the trucks? LESTER NYGAARD Yah, slipped on the ice. BO Ouch.   Say, Lester.   I needya ta pull the policy for Sam Hess. LESTER NYGAARD (beat) For -- who now? BO Sam Hess, owns the truck depot over on Winslow.   You know.   Big fella. Well, he’s dead. The color goes out of Lester’s face. LESTER NYGAARD Oh ya? BO Ya.   Shame.   That’s a big policy. (lowers his voice) Murder, they’re sayin’.   Stabbed ta death is what I heard. (off Lester) You okay there, Lester? LESTER NYGAARD Oh sure.   I, uh -- you know I went ta high school with him.  42.",
      "characters": [],
      "action_text": "BO Ya don’t say.   Well, anyway. I need ya ta pull the policy.   Gotta get on the phone with his wife later. Bo walks away.   Lester stands there, feeling both terror and a peculiar elation. CUT TO: INT. ARBY’S. SAINT CLOUD, MINNESOTA - DAY Lorne Malvo sits at a formica table, finishing his meal. Lester comes in, hat on, agitated.   Malvo recognizes him. MALVO Lester. Lester comes over. LESTER NYGAARD Did you -- geez. (leans in) Did you really kill him? (almost can’t say it) Sam. MALVO Oh my god.   Is Sam dead? (off Lester) How do you feel about that? LESTER NYGAARD I mean, of course.   It’s -- ya know, tragic -- MALVO Then why’d you kill him? LESTER NYGAARD (too loud) Now hold on a second. Lester looks around, sits. LESTER NYGAARD (CONT’D) (quiet) I never -- MALVO You did actually.   Remember? Yes or no.  43. LESTER NYGAARD (hisses) I never said   yes . MALVO Well, you didn’t say   no . Beat.   Lester is tied up in knots. LESTER NYGAARD Now, that’s not -- that won’t -- in a court a law -- that won’t -- MALVO (dangerous) Who said anything about a court of law? LESTER NYGAARD No.   I just mean -- Aw geez. He had a wife. And those boys. MALVO He put you in a barrel and rolled you in the road.   Your problem is, you lived your whole life thinking there are rules.   There aren’t.   We used to be gorillas.   All we ever had was what we could take and defend.   The truth is, you’re more of a man today than you were yesterday. LESTER NYGAARD How do ya figure? MALVO It’s a red tide, Lester.   This life of ours.   The shit they make us eat.   Day after day -- the boss, the wife, etcetera -- wearin’ us down.   If you don’t stand up to it - - show ‘em you’re still an ape deep down where it counts -- you’re just gonna get washed away. Off Lester: this resonates. CUT TO: INT. NURSE’S STATION. EMERGENCY ROOM. SAINT CLOUD, MN - DAY Molly enters, approaches the nurse’s station.   SUE ROUNDTREE (30s), the same nurse from earlier, is working.  44. MOLLY Slow day. SUE ROUNDTREE Bars j",
      "dialogue_count": 0,
      "word_count": 1324
    },
    {
      "scene_number": 2,
      "slugline": "INT. BASEMENT. NYGAARD HOUSE. SAINT CLOUD, MINNESOTA - NIGHT Pearl comes downstairs.   Lester has his tool kit out.   He’s trying to fix the washing machine. PEARL Whatcha doin’, hon? LESTER NYGAARD Trying ta fix the darn thing. Looks like the motor mount broke. PEARL Ya sure ya know what yer doin’? LESTER NYGAARD Seems pretty straight forward. He puts the screwdriver down. LESTER NYGAARD (CONT’D) Okay. Give that a try. PEARL But there’s nothing in it. LESTER NYGAARD I’m sayin’ just fer a test. Pearl turns the machine on.   Beat. It fills with water, then the agitator kicks in.   A harsh shriek fills the air. LESTER NYGAARD (CONT’D) (panicked) Turn it off. Pearl tries to turn it off.   The shriek worsens.   SMOKE starts to pour out of the back of the washing machine. Lester finally pulls the plug.   The shriek fades slowly, as the engine cycles down. They stare at the now dead washing machine. LESTER NYGAARD (CONT’D) Well -- PEARL You killed it. LESTER NYGAARD I, uh -- PEARL You killed my washing machine.  51.",
      "characters": [],
      "action_text": "LESTER NYGAARD It’s -- I was -- ya know, the tide. I was standing up to the -- I was bein’ a man. PEARL But yer not a man, Lester.   Yer not even half a man. Lester stares at her, his nuts cut once again. PEARL (CONT’D) Honestly.   I don’t know what got into me, marrying you.   My mom said, don’t do it, Pearl.   She said, he’s the kind of boy who loses all the time.   And you know what those boys grow up ta be, don’t ya?   Losers. LESTER Looks at his tools. ANGLE ON A CLAW HAMMER Resting on top of the tool box. LESTER NYGAARD Take it back. PEARL Or what?   What are you gonna do? Ya can’t even face me when we’re having sex. LESTER NYGAARD What? It’s you not facin’ me. PEARL Well, yah.   So I can picture a real man. LESTER NYGAARD Now that’s not very nice. PEARL Loser. Lester picks up the claw hammer.   He walks towards Pearl. PEARL (CONT’D) What are you doon?   You gonna hit me with a hammer? That’s a laugh.  52. The first blow catches her by surprise.   The pain of it, the blood that runs down her face.   The moment hangs there.   Then Lester BEATS HER TO DEATH with the hammer.   Each blow is a release.   Eventually, he stops.   Stands there panting. Slowly the red haze lifts.   He looks down at his blood spattered clothes. LESTER NYGAARD Aw geez. He is about to panic, when he looks up. CLOSE UP ON AN INSPIRATIONAL POSTER taped to a bare concrete wall.   On it a school of yellow fish all face the same direction, except one.   The poster reads  There’s Always One.   Be the One.  LESTER Stares at it.   As he does, an idea hits him.   A brilliant, dangerous plan. Could he really do it?   As we watch, Lester strips off his clothes, shoves them in a garbage bag. Carefully Lester wipes the handle of the claw hammer to remove his finger prints.   Over this we hear: LESTER NYGAARD (O.S.) (CONT’D) (pre-lap, distraught) Ya, it’s me.   I -- you need ta -- I need help. CUT TO: INT. KITCHEN. NYGAARD HOUSE. SAINT CLOUD, MIN - NIGHT Lester, dressed in new clothing, stands with his",
      "dialogue_count": 0,
      "word_count": 1636
    },
    {
      "scene_number": 3,
      "slugline": "INT. MOLLY’S SQUAD CAR - SAME TIME Pulling up to Nygaard’s house, Molly sees Vern’s prowler. She CLIMBS OUT of the car, approaches the door. CUT TO: INT. KITCHEN. NYGAARD HOUSE. SAINT CLOUD, MINNESOTA - SAME TIME Lester hurries over to the basement door. LESTER NYGAARD They’re here.   The police. No response.   Lester starts down the stairs into ... THE BASEMENT LESTER NYGAARD I said the police are here.   What do we ... But Malvo is gone.   Vanished like a ghost.   Pearl lays alone on the floor, a bloody mess.   The hammer next to her. Off Lester: trapped. CUT TO: EXT. NYGAARD HOUSE. SAINT CLOUD, MINNESOTA - SAME TIME Molly pounds on the door. MOLLY Saint Cloud Police.   Open up. Nothing.   She looks in the nearest window, sees Vern laying dead on the hall floor. MOLLY (CONT’D) (upset) Oh. Oh. She keys her handset. MOLLY (CONT’D) Officer -- officer down! Send help. She pulls her weapon, starts kicking the front door. CUT TO:  59.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 165
    },
    {
      "scene_number": 4,
      "slugline": "INT. BASEMENT. NYGAARD HOUSE - SAME TIME Nygaard hears the front door CRASH OPEN upstairs.   He is trapped. He looks around. No exit. Can he hide? No. They’ll find him.   Then his eyes hit the inspirational poster on the wall.   There’s only one way out.   Lester, knowing he will be found at any moment, RUNS towards the wall, his head down. Crack.   He knocks himself out. CUT TO: INT. FRONT HALLWAY. NYGAARD HOUSE - SAME TIME Molly kneels next to Vern, checks his pulse.   But her mentor and friend is dead.   Struggling to stay professional, she straightens, her gun up. MOLLY Saint Cloud Police!   If there’s someone in the house, come out with yer hands up. Nothing. Cautiously, Molly goes room to room, searching.   We know Malvo could still be in the house.   Each blind corner and dark space offers certain death.   We can tell Molly is afraid, out of her league, but she keeps her wits. CUT TO: INT. BASEMENT. NYGAARD HOUSE - NIGHT Slowly, Molly comes down the stairs, gun drawn.   She sees Pearl and Lester, laying face down.   The basement looks like the scene of a massacre.   From upstairs she hears ... BILL (O.S.) Molly? MOLLY Down here! Molly assesses the situation. Pearl is clearly dead.   Molly holsters her weapon, kneels next to Lester, takes his pulse. MOLLY (CONT’D) Husband’s alive! She looks up.   There on the poster she sees A BLOODY HUMAN FACE PRINT with what appears to be a HALO over it.  There’s always one.   Be the one.  60.",
      "characters": [],
      "action_text": "Off Molly: what does it mean? CUT TO: EXT. TWO LANE HIGHWAY. RURAL, MINNESOTA - NIGHT A state police car is parked on the blind side of an overpass.   Nearby a sign reads   Duluth 10 miles . CUT TO: INT. STATE POLICE CAR - NIGHT Patrolman GUS GRIMLY (30s) sits behind the wheel, sipping a cup of coffee.   His walkie talkie crackles. KURT GRIMLY (O.S.) Dad. Come in, dad. Over. Gus picks up the walkie talkie. GUS GRIMLY Dad here.   Come back. KURT GRIMLY Vikings up by thirteen. Over. GUS GRIMLY What happened? Over. KURT GRIMLY Walsh kicked another field gold. Over. GUS GRIMLY Sweet. Did you brush your teeth? Over. KURT GRIMLY Yes. Over. GUS GRIMLY Homework? Over. KURT GRIMLY Did my math and science.   Still have to do English.   Over. GUS GRIMLY Okay, well.   As soon as the game’s over.   Over. A CAR SPEEDS PAST.  61. Gus hits his siren, pulls out onto the road.   We stay with him as he follows the speeding car, it’s tail lights visible through the front windshield. The car in front of him pulls over.   Gus pulls in behind it. Beat. He writes down the license plate number, notes the time.   Then climbs out of the car. EXT. TWO LANE HIGHWAY. RURAL MINNESOTA - CONTINUOUS Gus approaches the driver’s side, flashlight out.   The inside of the car is dark, ominous.   We can’t see the driver. Then the driver’s side window rolls down.   Now we see the driver is Lorne Malvo. MALVO Evening, officer. GUS GRIMLY License and registration please. MALVO Well, we could do it that way.   You ask me for my papers and I tell you it’s not my car.   That I borrowed it.   And see where things go from there.   We could do that.   Or, you could just get back in your car and drive away. GUS GRIMLY Why would I do that? MALVO Because some roads you shouldn’t go down.   Because maps used to say  there be dragons here .   And now they don’t.   But that don’t mean the dragons aren’t there. From the prowler, we hear Kurt’s walkie talkie. KURT GRIMLY (O.S.) Dad.   Come in, dad.   Over. GUS GRIMLY Ste",
      "dialogue_count": 0,
      "word_count": 1407
    }
  ]
}