{
  "slug": "fargo-201-waiting-for-dutch-2015",
  "title": "fargo 201 waiting for dutch",
  "genre": "thriller",
  "format": "series",
  "scenes_count": 2,
  "characters_count": 0,
  "characters": [],
  "total_words": 10042,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. COURT HOUSE. FARGO, ND - DAY 9   9 We watch through the windshield of Rye’s car as Judge Mundt exits the court house.   She goes to her parked car, gets in. The CAMERA FINDS Rye watching. CUT TO: EXT. RURAL ROAD. MINNESOTA - NIGHT 10   10 Snowy, barren. We see a sign LUVERNE, MN 10 miles. The Judge’s CAR passes. Beat. A SECOND CAR follows. CUT TO: INT. RYE’S CAR (TRAVELING). RURAL, MINNESOTA - NIGHT 11   11 Rye follows the judge. His radio is on, playing   Children of the Sun , by Billy Thorpe. He takes out a cigarette, lights it off the dashboard. ANGLE ON THE JUDGE’S CAR As it signals right and pulls off the road into the parking lot for the WAFFLE KING. CUT TO: EXT. WAFFLE KING - CONTINUOUS 12   12 The Judge’s car pulls in, parks.   Judge Mundt gets out, goes inside. Beat. Rye’s Car pulls in. CUT TO: INT. RYE’S CAR - CONTINUOUS 13   13 Rye Gerhardt sits in the driver’s seat.   He watches as ... ANGLE ON THE JUDGE the judge enters the diner. She is met and seated by a WAITRESS. RYE GERHARDT takes a glassine envelope out of his shirt pocket, pours some white powder on the meat of his left thumb, snorts it. As he does we RUSH INTO A CLOSE UP.  F   A   R   G   O   #201   PINK   PRODUCTION   DRAFT   -   (9/26/14)   11 .",
      "characters": [],
      "action_text": "Ding!  HARD CUT TO: INT. WAFFLE KING - MOMENTS LATER 14   14 ... as the front door opens and Rye enters. The same song is playing on the jukebox.   Rye looks around. ANGLE ON THE DINER The CAMERA PANS left to right with his eyes.   There is a FAMILY OF FOUR at a back booth. The Judge sits two booths forward, reading her menu. A FRY COOK works behind the counter. As the camera turns, it finds THE WAITRESS standing in front of Rye (us), waiting. WAITRESS Welcome to Waffle King! Table or booth? RYE nods his head to the counter, goes and sits.   The waitress comes around behind the counter, lays a menu in front of him. WAITRESS (CONT’D) Special’s tuna melt and fries. Pie’s humbleberry. RYE GERHARDT Just coffee. The waitress heads off. Rye watches the ... ANGLE ON THE FRY COOK A BLACK MAN in a hair net, working the grill. He reads an order slip, puts a burger patty on the grill. Laughter makes ... RYE turn ANGLE ON THE FAMILY Meal finished. The KIDS are up, horsing around.   MOM scolds them, as DAD puts on his coat. The Camera DRIFTS to Judge Mundt as the waitress brings her a milkshake.  F   A   R   G   O   #201   PINK   PRODUCTION   DRAFT   -   (9/26/14)   12 . ANGLE ON RYE’S RIGHT FOOT tapping nervously on the floor. RYE smooths his mustache. Behind him The Family walks to the register. The waitress meets them. WAITRESS How was everything? DAD Oh yeah. Real good. Dad pays. The waitress opens the register, gives Dad his change.   They exit.   Rye watches as they ... ANGLE ON THE FAMILY ... climb into their station wagon. WAITRESS (O.S.) Sugar? RYE TURNS The waitress is there, smiling, holding a sugar container. RYE GERHARDT No. She leaves. Rye wipes his nose nervously, glances at the judge, who is examining her burger suspiciously. It’s now or never.   Rye stands and crosses to the booth.   Beat. The judge looks up. JUDGE MUNDT You could shoe a horse with this thing. RYE GERHARDT What? JUDGE MUNDT The burger. I asked for medium rare. Are you deaf, son? Rye looks around",
      "dialogue_count": 0,
      "word_count": 5000
    },
    {
      "scene_number": 2,
      "slugline": "INT. KITCHEN. SOLVERSON HOUSE - CONTINUOUS 26   26 Lou walks to the phone (the handset resting on top of the hooks). Betsy follows. BETSY SOLVERSON Murder, Cutty says. Three of ‘em. LOU SOLVERSON Oh yeah? BETSY SOLVERSON Over at the Waffle King. LOU SOLVERSON ( what do you know? ) Had an all-you-can eat breakfast there not eight hours ago. (beat) Hey, you had your thing today? BETSY SOLVERSON Yeah. At three. LOU SOLVERSON You feel okay? BETSY SOLVERSON Compared to what? Love Canal? He nods -- what else is there to say -- picks up the handset. LOU SOLVERSON Solverson. (beat, listening) Yeah, okay. Tell him don’t go inside. Hank on his way? (beat, listening) Okay. Me too. He hangs up. LOU SOLVERSON (CONT’D) Gotta go, hon. You okay getting her to bed? BETSY SOLVERSON She’s four. Not, ya know, Pol Pot. He kisses her.  F   A   R   G   O   #201   PINK   PRODUCTION   DRAFT   -   (9/26/14)   35 .",
      "characters": [],
      "action_text": "LOU SOLVERSON Okay. Call if you need -- whatever. CUT TO: EXT. WAFFLE KING. LUVERNE, MN - NIGHT 27   27 As it was, except for a big rig cab is parked out front, a TRUCKER standing next to it.   A STATE POLICE CAR pulls up. Lou gets out. The trucker approaches him. TRUCKER I left my rig there. Hope that’s okay. Lou sees the dead Waitress, approaches her body, flashlight up and on. TRUCKER (CONT’D) I’m the one called it in, see? Stopped fer waffles, ya know. With the blueberries. Come frozen this time a year, I know, but -- Lou ignores him, crouches next to the waitress’s body. She’s been covered up. TRUCKER (CONT’D) I put my coat on her. Seemed only right. Lou lifts the collar of the coat, looks under it. LOU SOLVERSON (to himself) Yeah. TRUCKER “Yeah” it’s okay about the coat, or -- Lou shines his light on the snow. ANGLE ON A BLOOD TRAIL Two actually (Rye’s and the Waitress’s), leading from the waitress’s body back to the front door of the restaurant. LOU ... straightens, walks to the entrance, the trucker following.  F   A   R   G   O   #201   PINK   PRODUCTION   DRAFT   -   (9/26/14)   36 . TRUCKER (CONT’D) Hell of a thing. Just really wanted some waffles, ya know? Been driving since Brunswick -- Maine -- and -- Lou stops, gives him a look. The trucker stops.   Lou climbs the steps, goes inside. CUT TO: INT. WAFFLE KING. LUVERNE, MN - CONTINUOUS 28   28 Lou enters.   He looks around. ANGLE ON THE CRIME SCENE The bodies have drained, the blood has started to congeal. The camera FINDS a POOL OF BLOOD (where the waitress first fell). There are BLOOD SMEARS (from where she got up) and BLOODY FOOTPRINTS back past Lou to the front door. LOU notes this. LOU SOLVERSON (to himself) Yeah. He approaches the Fry Cook, laying prone on the linoleum. ANGLE ON THE FRY COOK One leg bent under his body, arms thrown up, as if in surprise. LOU nods. LOU SOLVERSON (CONT’D) Yeah. He steps over the body carefully, goes to the Judge. ANGLE ON THE JUDGE She lays on her back, half on a ta",
      "dialogue_count": 0,
      "word_count": 5042
    }
  ]
}