{
  "slug": "fast-color-2019",
  "title": "fast color",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 24,
  "characters_count": 0,
  "characters": [],
  "total_words": 20288,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. STREET - NIGHT A CAR ALARM CRIES OUT on the edge of an ABANDONED CITY... Neglected STREET LIGHTS buzz and glare. APARTMENT BUILDINGS and HOUSES stand dark, their windows boarded or broken. Faded graffiti, no signs of life. We focus on ONE BUILDING in particular...  BANG ! A GUNSHOT echoes from within. The CAR ALARM rages on. Constant. Hypnotic. We stare at the building. Waiting... Until --  THUMP.  From inside, someone pounds on a BOARDED UP WINDOW.  THUMP THUMP THUMPTHUMPTHUMP --  The WOOD on the WINDOW starts to SPLINTER -- Until it CRACKS OPEN. SOMETHING starts to push through. It’s a BLACK DUFFLE BAG. It DROPS to the ground. A LEG comes out from the window. ANOTHER LEG. And then... A FIGURE drops down onto the ground. They stand, grab the bag, and quickly move away from the house. As the figure comes under a streetlight, we see -- It’s a WOMAN. Her breaths heavy and quick. Cropped hair and black jeans. An OVERSIZED MEN’S COAT obscures her frame. She carries the bag in one hand and a GUN in the other. This is RUTH. She walks quickly to a DARK CAR that’s parked on the street in front of the building, and digging into the deep pockets of the coat, she finds the KEYS. Presses the --  BEEP BEEP.",
      "characters": [],
      "action_text": "The alarm STOPS. She gets into the car. The engine REVS. And as she pulls away... We hang on the building. Distant SIRENS creep in. INT. CAR - MOMENTS LATER We’re in TIGHT with Ruth. Her eyes piercing and strained. Even if she’s tired, it doesn’t matter. She’s driving fast. We hear a SIREN getting closer and closer -- Out of the DRIVER SIDE window, a POLICE CRUISER blows past, SIREN WAILING, painting everything BLUE and RED. Ruth flinches. She looks down, sees the GUN resting on the PASSENGER SEAT, and KEEPING ONE HAND ON THE WHEEL, she grabs the gun and SHOVES IT into the open bag. But the BUTT of the gun sticks out a bit, so she reaches down again and rearranges it. Satisfied, her eyes go back to the ROAD. It stretches out in front of her, white and yellow and black. CUT TO:  fast color  Our TITLE. Over black. Until -- INT. DARK CAR - NIGHT Ruth sits in the now parked car, artificial blue emanating from a dim internal overhead light. PUNK ROCK on the radio. The station goes in and out. Inside the pockets of the coat she finds... A black FLIP PHONE with a DEAD BATTERY. She SNAPS it in half, throws it on the floor. A WALLET. She opens it, inside are a bunch of $20s some $10s and $5s and a few $1s. She pockets the cash and throws the empty wallet down, too. 2. She opens the GLOVEBOX, pushes some things around, KLEENEX, an EMPTY PACK OF CIGARETTES, until she finds -- A MAP. One of those folded paper ones. She opens it, moving it this way and that, trying to make out the words in the dim light... EXT. MOTEL PARKING LOT - SAME A DEAD TREE stands off to one side of the MAIN BUILDING. It’s one of those cheap two story jobs with the room entrances on the outside. And in the fluorescent light near the MOTEL OFFICE we can just make out the BLEAK DESERTSCAPE that surrounds the building. The Dark Car is parked on the far side of the lot. Gripping the bag, Ruth gets out. INT. MOTEL OFFICE - LATER Ruth stands at the DESK talking to a TIRED WOMAN, not much younger than herself. T",
      "dialogue_count": 0,
      "word_count": 2099
    },
    {
      "scene_number": 2,
      "slugline": "EXT. ROAD - DAWN Ruth drives the STOLEN CAR. She YAWNS. Wipes her EYE. She turns a knob on the DASH, scanning the RADIO. RADIO REPORTER #1 (V.O.) -- price of water continues to soar as lawmakers meet to discuss -- She scans through to another station -- RADIO REPORTER #2 (V.O.) -- appears to be localized, with an epicenter just outside of View Park. Putting her hand back on the wheel, she listens. RADIO REPORTER #2 (V.O.) It was the first to rock the area in decades. Seismologists are -- And off Ruth, listening -- CUT TO: INT. ROADSIDE DINER - MORNING CLOSE ON: A fork digs into a FRIED EGG. YOLK runs everywhere. Ruth sits at a COUNTER, eating the egg and drinking some INSTANT COFFEE. She keeps looking out the WINDOW. The stolen car is parked out front. She takes a bite of EGG, and as she lifts the COFFEE CUP to her lips, she adjusts her sleeve, hiding the bandage on her wrist. MAN’S VOICE (O.C.) ...Expecting someone? She turns to see a MIDDLE AGED MAN with dark hair sitting on the stool next to her. He has wire-rim glasses and wears a casual button down shirt. A jacket. Jeans. Something like a college professor without a campus. This is BILL. 11.",
      "characters": [],
      "action_text": "RUTH Just watchin’ the cars. BILL Fascinating stuff. RUTH Riveting. BILL (re: the coffee) This is terrible, huh? RUTH I don’t remember anymore what proper coffee tastes like. Maybe if I close my eyes... She does. Takes a sip. BILL ...Yeah? RUTH Nope. Nope. Still terrible. He laughs. Bill glances at Ruth’s wrists. It’s just a split second, but Ruth notices and again adjusts her sleeve. BILL So where you headed? RUTH Oh, I’m... uh. Nowhere, really. Just going. Bill smiles. BILL You alright? RUTH Figuring some things out. BILL I remember those days. I’m married, nine years. Two kids. So my things are figured. (beat) Speaking of which. I should get going. 12. She nods. He wipes his mouth, puts his napkin down on the plate and stands up. BILL (CONT’D) Nice talking. Take care. And good luck. RUTH Thanks... BILL Bill. RUTH Thanks, Bill. And with that, he goes. Ruth looks down, a small smile to herself. She takes one last bite and one last sip. And then she grabs her check, stands and -- CUT TO: EXT. DINER - MOMENTS LATER Ruth comes outside. She’s walking over to her -- She stops. Dead in her tracks. A COP, having just gotten off his MOTORCYCLE, is walking towards Ruth’s STOLEN CAR. He’s leaning down to look at the plates, and then he looks up to see -- Ruth. Looking right at him. She’s frozen, unsure of what to -- MAN’S VOICE (O.C.) Honey! Ruth turns -- It’s Bill. Standing by the open DRIVER SIDE DOOR of his STATION WAGON. BILL I’m over here. CUT TO: EXT. COUNTRY ROAD - LATER BILL’S STATION WAGON drives along an empty country road. 13. As the trees fly by, we see that they are BARE. As the grass flies by, we see that it is BROWN. BILL (O.C.) So where can I take you? INT. STATION WAGON - SAME RUTH I’m good anywhere. Honestly. You’ve already helped more than you know. BILL Come on, I’ll take you where you need to get. RUTH You have a wife and kids to think about. BILL I feel responsible. RUTH I shouldn’t have let you get involved, but... BILL (smiling) You had no choice? RUT",
      "dialogue_count": 0,
      "word_count": 1020
    },
    {
      "scene_number": 3,
      "slugline": "INT. STATION WAGON - SAME Ruth has backed away, pressed up against the door. RUTH What do you want? Bill exhales. Looks at her. BILL I’ve been looking for you for a long time, Ruth. When Joe called and told us he’d finally got you... I didn’t quite believe it, but he said he saw it with his own eyes. (beat) I wanted to see it too. Ruth has her arm behind her back, blindly searching for the door handle... BILL (CONT’D) But when I got there, obviously, it was too late. She finally gets it, lacing her fingers around it... BILL (CONT’D) So here we are in the middle of nowhere, waiting on the end of the world. But there’s something I need you to know... you can help me. And I know I can help you. She PULLS hard -- But the door doesn’t budge. BILL (CONT’D) (re: the door) Come on. Her eyes shift to her bag -- BILL (CONT’D) You’ve still got his gun, don’t you... And now they just stare at each other... UNTIL -- Ruth goes for her BAG as Bill LUNGES towards her, but Ruth blocks him, SLAMMING HER HEAD INTO HIS FACE -- Bill recoils, BLOOD pouring from his NOSE. 17.",
      "characters": [],
      "action_text": "BILL (CONT’D) AARGH -- And in an instant -- Ruth REACHES DOWN TO the BAG and PULLS OUT THE GUN. She AIMS it at Bill -- He LUNGES at her, pushing the BARREL up. The gun GOES OFF, sending a round through BILL’S HAND and through the ROOF -- He SCREAMS -- Recovering, Ruth aims at him -- But now Bill goes for the gun with his other hand, grabbing the handle and pushing it up and back so it’s pointing over Ruth’s shoulder as she FIRES AGAIN -- SHATTERING the window behind her. GLASS flies everywhere -- Ruth tears the gun from his grip and reaches back and up and starts to pull herself out through the broken window, but Bill GRABS onto her legs -- She hoists herself up, pushing against his body, struggling mightily, finally she frees one of her FEET and KICKS HIM HARD in the face -- He FALLS BACK against the DRIVER SIDE DOOR. She pulls herself out of the car -- EXT. STATION WAGON - SAME And drops down into the brown grass. Willing herself up, she stands, looks into the car, and goes to fire at Bill again but  CLICK . It’s empty. A beat, and then... Ruth starts to RUN. Her breath heavy, she makes it to the -- 18.",
      "dialogue_count": 0,
      "word_count": 429
    },
    {
      "scene_number": 4,
      "slugline": "EXT. DESERT - CONTINUOUS We TRACK with Ruth as she runs out into the EMPTY DESERT. She runs as fast as she can. And she doesn’t look back. CUT TO: EXT. GAS STATION - LATER A DUMPSTER, full of trash. Ruth’s hands DIG through it, creating a hole. Then she reaches behind her, and from her waistband, tucked at the small of her back, she pulls out THE GUN. She gives it one last look, SHOVES it into the hole, and covers it up. INT. GAS STATION/MINIMART - MOMENTS LATER  DING DING.  The BELL above the door rings as Ruth comes into the store and starts to walk down one of the aisles... She looks over her shoulder to -- A KID, sitting behind the counter, hunched over a MAGAZINE. He’s listening to the RADIO. Some DUMB TEENAGE SONG. The SHELVES behind him are mostly EMPTY. Some CIGARETTES and CANNED GOODS. The Kid doesn’t look up. Back with Ruth, she grabs TWO BOTTLES OF WATER and heads to the front of the store. RUTH Just these. The Kid glances at the waters, then back to his magazine. KID 24. She pulls CASH out of her back pocket, only $13 left. She gives him $12, takes ONE BOTTLE and starts to go. RUTH ...Bathroom? 19.",
      "characters": [],
      "action_text": "KID Outside. RUTH Is there a -- KID It‘s open. INT. GAS STATION/BATHROOM - MOMENTS LATER Ruth DRINKS HALF the bottle. Through the thin wall of the bathroom, we hear the RADIO. CUT TO: INT. GAS STATION/BATHROOM - MOMENTS LATER We still hear the radio. Ruth pours a little bit of what’s left in the water bottle into her palm and rubs her arms and face down. Cleaning off the dirt and the blood as best she can. She winces as she rubs the water on the MANY SMALL CUTS that cover her arms. Then she drinks whatever is left. Head tilted back, she shakes the bottle, tapping every last drop into her mouth. CUT TO: INT. GAS STATION/BATHROOM - MOMENTS LATER It’s quiet. No more radio. Ruth just stands there. Looking at herself in the mirror. It’s getting harder to hide the wounds. On the mirror, a FADED STICKER for a high school football team -- GARRISON TIGERS. Ruth glances at it, and then runs her hand across her head, pushing back her mess of hair. She INHALES -- CUT TO: 20.",
      "dialogue_count": 0,
      "word_count": 398
    },
    {
      "scene_number": 5,
      "slugline": "EXT. DIRT ROAD - DUSK Ruth stands at the top of the road. In front of her -- A FARMHOUSE hangs back, just around a bend in the road. Off to the side, a SMALL BARN. Between them sits an OLD BROWN AND WHITE PICK-UP TRUCK. The VIVID WHITE from inside the farmhouse is the only artificial light for miles. The sky above is pink and purple and changing. Ruth stares at it. All of it. For a while, she doesn’t move. And then -- She turns and WALKS AWAY, back up the road. DISSOLVE TO: INT. CAR - NIGHT HEADLIGHTS shine on black pavement as a car moves alone on the road. Until... There’s SOMETHING up ahead. A STATION WAGON, abandoned. Bill’s, of course. As our car gets closer and comes to a stop, RED AND BLUE lights spill onto the road and Bill’s car... EXT. COUNTRY ROAD - SAME Our COP steps out of his cruiser. Hardy and bearded, with soft, weather-worn eyes. This is CAPTAIN DEAN MONROE. Leaving his lights on, he cautiously approaches. He pulls out his FLASHLIGHT, shining it into the back... nothing there. He moves to the DRIVER’S SIDE and his light catches: BROKEN GLASS... BLOOD STAINS... BULLET HOLES in the roof... 21.",
      "characters": [],
      "action_text": "The PASSENGER DOOR wide open -- Monroe shines his light through the car and out the door and into the DESERT. But no one’s there. INT. GAS STATION/MINI MART - NIGHT  DING DING.  The Kid’s still listening to the radio. Still lost in his magazine. And then -- MAN’S VOICE (O.C.) Where am I? The Kid looks up -- It’s Bill, and he’s a mess. His glasses are cracked and bent, his nose is red and swollen. The skin under his eye already turning PURPLE... He puts Ruth’s bag down on the counter.  Drip. Drip. Drip.  KID A gas station? (beat) You alright? He takes off his glasses, sets them down too. BILL What town.  Drip. Drip. Drip.  KID Garrison. About three miles west and you’ll hit it. Bill nods. KID (CONT’D) Can I get you anything? Bill looks down -- His HAND, shoved in his pocket, has soaked it through with blood that’s now dripping onto the floor. 22. He looks back up -- BILL You see a woman? CUT TO: INT. ROADSIDE BAR - NIGHT It’s loud and smoky. Ruth breaks through MEN and WOMEN talking over each other, over music. It’s more people than we’ve seen, but it’s not crowded. She makes her way to the -- RUTH Hey! She waits. RUTH (CONT’D) Hey! Behind the bar, a BIG WOMAN with long hair turns -- RUTH (CONT’D) You serve food? BIG WOMAN Yeah. What do you want? Ruth pulls herself up on the bar, leaning in -- RUTH I don’t have any money. The Big Woman turns away -- RUTH (CONT’D) It’s just you here? She turns back...   Yes . RUTH (CONT’D) I’ll do the dishes and clean up whatever you need in the back. All I ask in return is dinner and a jug. The Woman looks her up and down. Extends her hand -- BIG WOMAN Michelle. Ruth takes it -- 23. RUTH Sarah. And swings herself up over the bar. MICHELLE Sure you don’t wanna serve? You’re a pretty girl. You can keep the tips. RUTH I don’t like alcohol. Or people. Michelle just laughs. CUT TO: EXT. ROADSIDE BAR/BACK PARKING LOT - LATER Ruth DEVOURS a PIECE OF CHICKEN and some RICE. A SMALL JUG of water at her side. GLASS BREAKS in the distance, echoi",
      "dialogue_count": 0,
      "word_count": 4085
    },
    {
      "scene_number": 6,
      "slugline": "INT. FARMHOUSE/KITCHEN - SAME Lila sits down at the table. Bo is already there, pouring some GRANOLA into a BOWL. She passes it to Lila. Off-screen, the screen door SLAPS. Bo and Lila turn towards the sound -- RUTH ...Can I? Bo looks to Lila. Lila just looks away. Bo looks back to Ruth. Nods. Ruth comes in. Slowly. She looks around, taking in the room. She’s not sure what’s stranger: the things that have changed or the things that are the same. She makes it to the table. Sits. Bo pours some granola in another bowl and pushes it towards Ruth. Then she pours about a half a cup of coffee, black, and passes Ruth the mug. As she eats, Ruth glances over at Lila. Noticing something, she looks up at Bo -- RUTH (CONT’D) That’s my bowl. BO What? Looking down at Lila’s bowl, Bo nods. It’s ceramic, handmade, BLUE and WHITE. Ruth takes a bite of granola. RUTH (to Lila, with her mouth full of food) I broke that bowl. Lila looks from Ruth to the bowl and there, somewhere between the blue and the white, SEVERAL LINES of BLACK run up and around the edge, where it’s been glued back together. RUTH (CONT’D) I think my grandmother made it? Bo nods,   yes...  44.",
      "characters": [],
      "action_text": "RUTH (CONT’D) I remember I wanted to use my abilities to fix it, but -- LILA (parroting Bo) -- whatever it looks like when you take it apart -- RUTH (also parroting) -- is what it looks like when you put it back together -- LILA If it’s broken it stays broken. RUTH All we needed was a little glue. A moment. And then -- LILA So you can... like we can? Ruth and Bo exchange a look -- RUTH I can’t. Lila takes this in. RUTH (CONT’D) I should. I did a long time ago. CUT TO: EXT. FARMHOUSE - DAY (FLASHBACK) YOUNG RUTH sits in green grass. A SWIRL of MULTI-COLORED DUST before her face. She’s looking right at us. INT. FARMHOUSE/KITCHEN - MORNING BO Lila, with your mother here, I think it’s time we told you some things, some things about the past. Bo looks to Ruth. Ruth nods. 45. BO (CONT’D) I knew. I knew before it happened. It was like everything up ahead was suddenly growing dark. I could feel it coming. I knew her abilities were...   more   than mine. She was different. CUT TO: EXT. FARMHOUSE - DAY (FLASHBACK) A YOUNG RUTH sits in GREEN GRASS. We’re focused on her HANDS in front of her TORSO: a ROCK in one and a PINK FLOWER in the other. And they begin to disintegrate, swirl, levitate. TWO CLOUDS of DUST that pull towards each other, BLENDING together... SOMETHING STARTS TO TAKE SHAPE... But not a rock or a flower... IT’S SOMETHING NEW. INT. FARMHOUSE/KITCHEN - MORNING BO She could do things the other women in our family couldn’t do, had never done. I didn’t know what to do with her. I tried, but... She glances at Ruth -- BO (CONT’D) I didn’t know how to nurture it. CUT TO: EXT. FARMHOUSE - DAY (FLASHBACK) The NEW SHAPE catches FIRE and EXPLODES! Ruth stands and starts to run, away from the explosion, away from the farmhouse -- Just as a YOUNGER BO comes flying out onto the porch. She watches as Young Ruth runs away... 46.",
      "dialogue_count": 0,
      "word_count": 567
    },
    {
      "scene_number": 7,
      "slugline": "INT. FARMHOUSE/KITCHEN - MORNING BO So she pushed me away, started trying crazier and crazier things on her own. RUTH Like trying to take apart Lunch? LILA Lunch? BO Our dog. RUTH Lunch. CUT TO: EXT. FARMHOUSE/PORCH - DAY (FLASHBACK) We’re looking at a SMALL BROWN DOG. LUNCH. He pants. A YOUNG RUTH sits on the FRONT PORCH. She stares at Lunch, rather intently. In return, he stops panting and cocks his head. She FOCUSES her EYES on him... He KEEPS STARING at her... And SUDDENLY -- His RED COLLAR SEPARATES... and DISINTEGRATES. Lunch is SURPRISED -- Young Ruth stands up suddenly -- She goes to GRAB for him but he TAKES OFF! Down the PORCH STEPS and onto the DRIVEWAY. Young Ruth RUNS after him... As Younger Bo looks on through the window, shaking her head. 47.",
      "characters": [],
      "action_text": "And through the glass of the window we see Lunch, running faster and faster. And Young Ruth, running faster and faster too. INT. FARMHOUSE/KITCHEN - MORNING BO Because her abilities were different, because they were more, because I couldn’t make her more powerful than them, they... took over. CUT TO: INT. FARMHOUSE/KITCHEN - NIGHT (FLASHBACK) Younger Bo holds Young Ruth down on the kitchen floor as her body WRITHES and SHAKES. POTS AND PANS start to fall from hanging racks -- Bo lays her body down over Ruth’s, shielding her. And on the edge of frame, we see the BLUE and WHITE BOWL shaking to the edge of the table until it finally falls to the ground and BREAKS -- INT. FARMHOUSE/KITCHEN - MORNING RUTH And once the seizures started, I couldn’t use my abilities anymore. BO I tried everything, but nothing seemed to work. (to Ruth) I almost took you to a doctor, but I... couldn’t explain, I didn’t know who we could trust. Ruth looks away. BO (CONT’D) (to Lila) She grew frustrated. Reckless. Started hanging out with the wrong kind of kids. Started doing drugs -- Ruth turns -- 48. RUTH She doesn’t need to -- BO (to Ruth) Yes. She does. Ruth looks down. BO (CONT’D) Somehow, the drugs made the seizures stop. Lila looks at Ruth -- LILA And did your abilities come back? Ruth looks up -- CUT TO: EXT. FARMHOUSE/PORCH - DUSK (FLASHBACK) TEENAGE RUTH -- carrying a LARGE BAG over her shoulder -- pushes open the screen door, storming out onto the porch and arguing with Bo, who follows her out. We don’t hear what they say. We just see the anger in their eyes and the wideness of their mouths, screaming hateful words we cannot hear. Over this -- BO (V.O.) They never did. Teenage Ruth STORMS down the porch steps. Bo follows her, still yelling... BO (V.O.) She got so lost in that world that... It was no use stopping her. Ruth takes off down the driveway. She doesn’t look back. BO (V.O.) I knew the back of your mother’s head better than I knew her face. Bo just stands there, watching her ",
      "dialogue_count": 0,
      "word_count": 504
    },
    {
      "scene_number": 8,
      "slugline": "INT. FARMHOUSE/KITCHEN - MORNING LILA If you left then how did I -- RUTH I came back. BO With you. Bo gives Ruth a look. Then back to Lila -- BO (CONT’D) I begged her to stay, but... RUTH (to Lila) I couldn’t stay. (to Bo) You knew I couldn’t. LILA Why not? RUTH I was so messed up by that point... it was too dangerous. I couldn’t keep you. LILA So why is it okay now? Bo and Ruth exchange a look. Ruth doesn’t know what to say... BO Everyone’s older, a little bit wiser. You’re not a baby anymore. LILA I haven’t been a baby for a long time. Ruth doesn’t know what to say... BO It’s... There’s a lot more to it than... Ruth gets up and walks away, her back to them. Bo looks from Lila to Ruth, and then back to Lila -- BO (CONT’D) Why don’t you show her. 50.",
      "characters": [],
      "action_text": "LILA Huh? BO Go on. Show her what you can do, Lila. Ruth turns back... BO (CONT’D) It’s okay. Lila looks around and... She sees the BLUE and WHITE CERAMIC BOWL. The one Ruth broke. The one she eats her breakfast out of every morning. She wipes it out and puts it in the center of the table. Bo looks to Ruth, beckoning her back with her eyes. Reluctantly, Ruth comes back to the table. Sits. Ruth looks at Lila, who FOCUSES her EYES on the bowl... And the bowl creeps upwards, starts to come APART -- BUT SUDDENLY The pieces CLEAVE back together -- Lila’s eyes dart over to Bo, concerned -- Bo just nods -- And Lila takes a breath, grips the table, and FOCUSES her EYES again. Once more, the BOWL starts to lift and separate. And then it starts to DISINTEGRATE, turning to DUST... the BLUE and WHITE blurring, shaking, and dancing around just above the table. And the three women stare at it. The dust dances higher and faster, spectacular and sudden. Lila’s breath quickens and -- Slowly, haltingly, the bowl comes back together, the dust turning solid once more, the round shape reforming, but it hesitates, jerks -- AND -- 51. The BOWL CLATTERS back down in the middle of the table. Just as it was. The blue and the white and all the cracks. Lila’s eyes DART all around. Up and down and -- Amazed, Ruth realizes... RUTH (to Lila) ...You see them? Lila doesn’t respond, lost in whatever she’s seeing... BO She does. (beat) And she still finds it interesting... RUTH (to Bo) You don’t? BO (shaking her head) I’ve been seeing the colors for 52 years. Lila’s eyes stop moving. She closes them for a moment, catching her breath. And then opens them once more. RUTH (to Lila) What does it look like? A look of surprise comes over Lila’s face -- LILA ...You don’t know? Ruth shakes her head. RUTH I can’t see them. LILA Why not? BO We don’t know. She just... didn’t. Lila nods. 52. LILA But hasn’t Bo told you what they -- Bo smiles -- BO She wants to hear it from you. Lila looks at Ruth, looks down, ta",
      "dialogue_count": 0,
      "word_count": 638
    },
    {
      "scene_number": 9,
      "slugline": "INT. FARMHOUSE/KITCHEN - MORNING LILA Like when you blush. Like a memory of something you really liked, except it didn’t really happen. CUT TO:  INT. APARTMENT - DAY Ruth, much younger, presses her CHEEK to BABY LILA’S HEAD.  INT. FARMHOUSE/KITCHEN - MORNING LILA Bo says if you do something really big, sometimes the colors last a long time. (beat) And then just when you forget where you are... they’re gone. And everything’s just... normal again. Ruth’s eyes are glassy. She smiles at Lila and looks away. DISSOLVE TO: INT. POLICE STATION/EVIDENCE ROOM - LATER Sheila sits at a desk. Monroe comes in -- MONROE Has the rest of the analysis not come back? She stands -- SHEILA You didn’t hear? MONROE No... SHEILA Some men from another agency took everything over. MONROE What are you talking about? What agency? 54.",
      "characters": [],
      "action_text": "SHEILA You should call the lab. INT. POLICE STATION - MOMENTS LATER Monroe paces behind his desk. He’s on the phone -- MONROE No one had the authority without my signature. (he listens) I understand that, but there still needs to be some semblance of order, we can’t just -- (he listens) You do know those samples were the only evidence we had? (he listens) Who are these guys? Where did they come from? CUT TO: EXT. COUNTRY ROAD - LATE MORNING Monroe stands on the side of the road where Bill’s car was left, abandoned. Remnants of POLICE TAPE flutter a little in the breeze. He looks around. And then he turns and walks out, into the desert... BO (O.C.) What does it feel like when you try? EXT. FARMHOUSE - EARLY AFTERNOON Ruth stands behind the house with Bo. They’re both staring at a BLUE BUCKET, mid-conversation -- RUTH Cold? Bo’s face changes... RUTH (CONT’D) What? BO No, it... makes me feel warm. 55. RUTH Do you do that consciously? Or does it just happen? BO I don’t know. It’s... it’s like driving a car, at a certain point your body just knows. (beat) Maybe don’t think about doing it? Maybe the pressure you’re putting on is getting in the way. RUTH There’s this thing in program where... uh, lots of stuff is out of our control, so you’re supposed to be able to just let it go. You turn it over. BO Turn it over? RUTH To a higher power. God. Whatever. BO Whatever? RUTH You know what I mean. BO And can you? RUTH What? BO Turn it over. RUTH I want to. Bo thinks for a moment. BO Close your eyes. Ruth does. BO (CONT’D) When you feel the coldness, what do you see? 56. RUTH Nothing. Just darkness. BO Do you see a door... or an opening somewhere? RUTH What are you -- BO Look. RUTH How can I look with my eyes closed? BO You’re the one who said this was serious. Ruth opens her eyes. RUTH I just... I’m trying to -- BO The only thing you should be trying to do is -- Ruth sees something over Bo’s shoulder -- BO (CONT’D) Are you even listening to me? Bo turns and sees -- Lila. Not to",
      "dialogue_count": 0,
      "word_count": 2064
    },
    {
      "scene_number": 10,
      "slugline": "EXT. FARMHOUSE - LATER Lila and Bo talk in front of the truck while Ruth sits on the front steps of the porch, listening. LILA I think I need a new belt and some different tools. (beat) Please can we go? Please please? BO You know we don’t go for another couple weeks. LILA But we need the new glass for my window... Bo looks from Lila to Ruth... BO With Ruth here we could use some extra water. Lila smiles. BO (CONT’D) I’ll get my purse. Bo looks to Ruth -- RUTH Go. I’ll be fine. Bo eyes her, unsure... RUTH (CONT’D) Really. LILA (to Bo) Can I drive? Bo gives Lila a look as we -- CUT TO: EXT. DOWNTOWN GARRISON - LATE AFTERNOON BO’S CAR pulls into town, the mountains standing tall in the distance beyond the end of Main Street. 67.",
      "characters": [],
      "action_text": "Bo parks. She and Lila get out. And as they walk, Bo looks around. It’s still strange, seeing things looking this way. She glances over at the POLICE STATION and then turns back to Lila. INT. GENERAL STORE - MOMENTS LATER It’s one of the only businesses left in town. And they sell EVERYTHING. Bo stands in front of a wall that should be filled with JUGS OF WATER, but the pickings are slim. Lila comes up to her with a BASKET FULL OF TOOLS and the NEW BELT and a few other things. BO We can’t afford all of this, Lila. Go put some back. (beat) Just what’s essential. Lila nods slowly, disappointed. And then she heads back down the aisle, away from Bo. INT. ROADSIDE BAR - SAME The room is dim and smoky. Muffled music plays. Michelle stands behind the bar. She looks up. Smiles... MICHELLE What can I get you, officer? Monroe sits down on a stool. Smiles back. MONROE Nothing, thank you. I just have a few questions. She takes a breath. MICHELLE I figured you would. Monroe looks at her, searching... CUT TO: INT. FARMHOUSE/BATHROOM - SAME Ruth stands over the sink, UNWRAPPING her wrists. She inspects her wounds, which seem to be healing well. 68. She throws the bandages in the trash. INT. FARMHOUSE/HALLWAY - LATER She sits on the floor looking at the FRAMED PHOTOGRAPHS Bo leaned up against the wall. She picks them up, one at a time, looks at them... -- Lila when she was a little girl. -- Lila with Bo. Ruth touches her finger to the photograph. NO GLASS. Just like always. -- A PAINTING of a RAINBOW that Lila must have painted. -- A PICTURE of BO from when she was young. Hands on hips. And then --  RRRIIIIINNNNNNG   RING . Ruth starts, turns -- INT. FARMHOUSE/BO’S ROOM - MOMENTS LATER  RRRIIIIINNNNNNG   RING . Ruth pushes the door open. She stands there, frozen, staring at the TELEPHONE on Bo’s side table.  RRRIIIIINNNNNNG   RING . Ruth isn’t sure what to do. She takes a few more steps into the room, moves closer to the phone. Hesitates and --  CLICK . The MACHINE PICKS UP --  BEE",
      "dialogue_count": 0,
      "word_count": 1362
    },
    {
      "scene_number": 11,
      "slugline": "EXT. FARMHOUSE - EVENING The HOOD of the truck stands open, the top half of Lila disappeared inside as she works. INT. FARMHOUSE/LIVING ROOM - SAME Ruth sits on the couch. Looking through the JOURNAL again. RUTH (reading out loud)  Ruth wanted to go down to the pond today, I was afraid after what happened last time. But there’s not much water left in it, so I figured there wouldn’t any people there either. There’s been so little rain this summer.  Bo comes into the room, wiping her hands on a dishrag. Ruth looks up at her, and then back down. RUTH (CONT’D)  She threw a fit that there wasn’t enough for a swim. She tried to break apart the water with her hands. She told me she wanted to make more.  BO Lila’s never even been swimming.  CRRRRRRAAAAANNNNKK CHUG CHUG -- CRRRRRRAAAAANNNNKK CHUG CHUG --  They both turn, looking out the window. RUTH Oh, the... I almost forgot, the phone rang. Bo looks sharply back at Ruth -- RUTH (CONT’D) While you were out. BO And? RUTH I didn’t get it. (beat)  (MORE) 74.",
      "characters": [],
      "action_text": "The machine came on, but they didn’t leave a message. I’m sorry if I should have -- BO No. It’s good. It’s fine. (beat) Probably a wrong number. Ruth nods. Then Bo notices Ruth’s bare wrists. Her scars. Ruth notices Bo noticing. And self-consciously, she holds her wrists. And again, from outside...  CRRRRRRAAAAANNNNKK CHUG CHUG -- CRRRRRRAAAAANNNNKK CHUG CHUG --  As we -- CUT TO: INT. FARMHOUSE/LILA’S ROOM - NIGHT Lila, in her PAJAMAS, sits in on the floor reading an old AUTO REPAIR MAGAZINE. We can see the NEW PIECE OF GLASS lying on the carpet near the broken window, which now has SEVERAL PIECES of CARDBOARD TAPED over it.  KNOCK. KNOCK.  LILA Come in... Ruth pops her head in the door. RUTH You still awake? LILA Yeah. Ruth comes in. She’s holding SOME RECORDS. Under her arm, Lila can see the X-RAY SPEX “GERM FREE ADOLESCENTS” album peeking out. RUTH I thought since you liked the other one, I could show you some more? CUT TO: RUTH (CONT'D) 75.",
      "dialogue_count": 0,
      "word_count": 357
    },
    {
      "scene_number": 12,
      "slugline": "INT. FARMHOUSE/BO’S ROOM - SAME Bo sits on the edge of her bed. She pushes PLAY on the ANSWERING MACHINE. ANSWERING MACHINE You have one new message.  BEEEEEEP.  It’s silent, of course. But then... Bo starts to COUNT. Under her breath, to herself... BO One... two... three... four... five... Until --  CLICK . Bo looks up -- CUT TO: INT. FARMHOUSE/LILA’S ROOM - SAME Lila and Ruth are sitting on the bed now, looking at the records. Ruth is holding up PATTI SMITH, “HORSES” -- RUTH She felt out of place as a kid, she never felt like she belonged anywhere. But Patti knew she had something special inside that needed to get out. And through her music, it did. Next Ruth pulls out NINA SIMONE, “SOUL & SILK” -- LILA But that’s one of Bo’s records. RUTH No matter what kind of music you like, you like Nina. She’s the queen. That’s the rule. Lila smiles. Ruth holds up... 76.",
      "characters": [],
      "action_text": "LAURYN HILL, “THE MISEDUCATION OF LAURYN HILL” -- RUTH (CONT’D) Okay. (beat) Lauryn Hill got pregnant when she was 22 and lots of people told her not to have the baby. That it would ruin her career. But she did. And then she wrote this. It’s the only solo album she ever recorded... But it’s okay, cause it’s perfect. (beat) And the best song on the album is about her kid. And finally, the X-RAY SPEX, “GERM FREE ADOLESCENTS” -- RUTH (CONT’D) And last but not least... X-Ray Spex. The lead singer was Poly Styrene and after seeing the Sex Pistols live, she -- LILA What’s a sex pistol? Ruth can’t help but laugh -- RUTH Sorry, it’s uh, they’re a band. Lila nods. RUTH (CONT’D) So after seeing them she decided to form her own group. She put an ad in the paper that just said “Looking for young punks who want to stick together.” LILA Hey -- RUTH She was 18. LILA -- you wrote that in the truck. RUTH What? 77. LILA In the -- RUTH Oh shit! LILA It was yours, right? Ruth nods. Yes. LILA (CONT’D) Bo doesn’t know this but... I’m fixing it so I can leave. RUTH You what? LILA She thinks I just like fixing things, I mean, I do but... I want to see what’s out there. Didn’t you ever wonder if our abilities meant something? (beat) Like could we really do something. RUTH We’re not superheroes, Lila. We’re just trying to get by. LILA What if there’s more? RUTH Trust me. There’s not. LILA But what if there is and you just can’t see it? RUTH Listen. These women... (gesturing to the records) Are the real superheroes and that’s the truth. Lila smiles. RUTH (CONT’D) Don’t be in such a hurry to leave. LILA Why not? You did. 78. RUTH Exactly. And with that, Ruth gets up, leaning the records against the night stand as Lila gets under the covers. Ruth looks back at Lila -- RUTH (CONT’D) Okay. Lila’s just sitting there, returning her gaze. RUTH (CONT’D) Good night. LILA Good night. And off this, we... CUT TO: EXT. FARMHOUSE - NIGHT Ruth comes outside, walking across the porch and down the front steps",
      "dialogue_count": 0,
      "word_count": 1226
    },
    {
      "scene_number": 13,
      "slugline": "EXT. FARMHOUSE - MORNING The Old Truck sits in the morning light. INT. FARMHOUSE/LIVING ROOM - SAME Sunlight breaks through the windows. The room glows. INT. FARMHOUSE/KITCHEN - SAME An empty water jug. The round table and chairs. The bowl. Bo walks in. She LIGHTS A FLAME and turns to measure out some water. Seeing the empty jug, she pulls another one out from under the sink. She opens the jug and pours ONE CUP OF WATER into a POT and puts the pot over the flame. Lila comes in. She and Bo don’t acknowledge each other as Lila opens a CUPBOARD and takes out a GLASS JAR of GRANOLA. She moves, placing the granola on the table as Bo opens another cabinet and takes out THREE BOWLS. Lila turns back towards Bo as she extends the bowls out to Lila, who takes them. And as Lila moves back to the table, Ruth comes in. Lila lays the bowls out, one in front of each chair, and Ruth takes the granola from the table and pours it into the bowls. The three women sit around the table, eating their dry granola in silence. Lila looks up at Bo, then over to Ruth, and then back down to her granola. In the background, the water starts to boil. And over this --  CRRRRRRAAAAANNNNKK CHUG CHUG -- CRRRRRRAAAAANNNNKK CHUG CHUG --  84.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 231
    },
    {
      "scene_number": 14,
      "slugline": "INT. FARMHOUSE/LIVING ROOM - LATER Ruth looks out the window at Lila, who is sitting in the truck, trying to get it to start. Bo walks over to the window and stands by Ruth. They both look out. BO The first time I left this house, I met your father. Ruth looks at her mother -- BO (CONT’D) We were both about 14, I think? At least I let her go out. She nods out the window, towards Lila. BO (CONT’D) My mother wouldn’t even let me go to the store. So I snuck out. I walked. All the way. I must have been standing in front of the candy store -- there used to be this candy store, right in the middle of town -- staring in the window for 30 minutes. I didn’t have any money. He bought me a piece of blueberry taffy. Wanted to walk me home, too. I wouldn’t let him of course. He couldn’t know where we lived. No one could.  CRRRRRRAAAAANNNNKK CHUG CHUG --  BO (CONT’D) We did that every Saturday for almost a year before my mother found out. I couldn’t give him my address to write letters, but I did give him my number. He would call and stay on the line for five seconds, my mother going “hello?” ... “hello?” and me in the next room, counting. And if it was five... it was him. We’d meet at the reservoir. In the middle of the night. By the time my mother caught onto that plan, I was already pregnant. Ruth looks at her mother in disbelief. Bo nods.  CRRRRRRAAAAANNNNKK CHUG CHUG --  85.",
      "characters": [],
      "action_text": "BO (CONT’D) We’re all just doing the same thing over and over, hoping somebody will get it right. And then -- VROOOOOOOOOOOM! The ENGINE STARTS as we -- CUT TO: EXT. FARMHOUSE - MOMENTS LATER Lila gets out of the idling truck, jumping up and down as Ruth and Bo quickly come outside. BO Lila! You did it! Lila smiles. BO (CONT’D) Well, I told you if you did, you could have it. I’m so proud of you! RUTH Technically it’s my truck, so I’m the only one who can give it to you... Bo smiles at Lila. RUTH (CONT’D) And I   guess   you can have it. Lila smiles at Ruth. And just then SOMETHING ON THE GROUND catches Bo’s eye -- BO What are those? Lila turns and looks down. Ruth does too. LILA ...Tools? And there on the ground... the NEW TOOLS. 86. BO I’m aware of that. Where did you get them? LILA I found them. BO Where? LILA In the barn. BO Those tools are new, Lila. Lila looks away... Bo moves to the truck, turning it off, she takes out the keys. BO (CONT’D) You’ve never lied to me before. Lila looks at Ruth and then back to Bo -- BO (CONT’D) (to Ruth) Did you have something to do with this? RUTH What? No. Bo turns back to Lila -- BO How did you get them out of the store? Lila looks away. BO (CONT’D) Did you... She doesn’t respond. BO (CONT’D) Lila. Ruth shakes her head. BO (CONT’D) What? 87. RUTH I’m staying out of it. BO You’re good at that. LILA She didn’t do anything -- BO I can’t believe you would use them to steal. LILA What was I supposed to do? BO That is NOT what our abilities are for, Lila! LILA Then what   are   they for?! What’s the fucking point? BO Language! LILA At least I actually did something. What do you do except sit here making piles of dust? SUDDENLY -- The SOUND of a CAR COMING down the driveway... Bo turns -- And driving fast down the road is a POLICE CRUISER. BO Go inside. Now. (beat) Both of you. The Cruiser comes to a stop -- BO (CONT’D) I said go inside! Lila turns and heads up the stairs, across the porch and through the door... 88. Just as Monroe g",
      "dialogue_count": 0,
      "word_count": 1425
    },
    {
      "scene_number": 15,
      "slugline": "EXT. FARMHOUSE - AFTERNOON RUTH I wasn’t better. LILA So you left me here and now you’re gonna leave again? BO Lila, sweetheart -- LILA Just go! I don’t care anymore! Lila turns and runs into the house. Ruth looks down at her hand, at the keys to the truck. She looks up, wants to go after Lila, but -- BO Please. Ruth stands there. She looks at Bo. At Monroe. He nods. She gives one last look towards the house and then -- EXT. FARMHOUSE - MOMENTS LATER The Old Truck RACES away, up the drive. EXT. FARMHOUSE/PORCH - SAME Bo and Monroe watch it go. INT. FARMHOUSE/LILA’S ROOM - SAME Lila looks out the window -- now FIXED -- and watches the truck disappear around the bend... INT. OLD TRUCK - SAME Ruth’s hands GRIP the wheel as she speeds down the driveway. Her eyes focused on the road ahead... Her breath is short and quick. An ugly noise escapes her lips. She’s alone. She’s leaving. She’s done this before... She clears her throat, shaking the hair out of her face. 94.",
      "characters": [],
      "action_text": "And she drives on. EXT. ROAD - AFTERNOON The truck races down the road. And then... it starts to CLICK and SPUTTER and SLOW... And finally... It STALLS. And pulls off onto the side of the road. INT. OLD TRUCK - SAME She slams her hands on the wheel. RUTH Shit. Shit. Shit. And then she sees the GAS METER and realizes... THE TANK IS EMPTY. EXT. ROAD - MOMENTS LATER Ruth opens the METAL STORAGE BOX in the truck bed. And when she does, spray painted across the inside of the lid --  looking for young punks who want to stick together  She moves her hand across it, gently. CUT TO:  INT. APARTMENT - DAY Ruth, much younger, sleeps on faded sheets. By her side, BABY LILA, sleeps too.  EXT. ROAD - SAME Ruth closes her eyes, opens them again -- She pulls an EMPTY GAS CANISTER out from the STORAGE BOX and SLAMS the lid. CUT TO: 95.",
      "dialogue_count": 0,
      "word_count": 345
    },
    {
      "scene_number": 16,
      "slugline": "EXT. ROAD - DUSK Ruth walks down an empty road, GAS CANISTER in hand. CUT TO:  INT. APARTMENT - SAME Ruth shifts a little in her sleep.  EXT. GAS STATION - SAME She FILLS UP the CANISTER and... Her HAND starts to shake. CUT TO:  INT. APARTMENT - SAME Ruth’s head SNAPS BACK --  EXT. GAS STATION - SAME Ruth looks at her SHAKING HAND and pulls the cannister away, puts it down and RUNS --  INT. APARTMENT - DAY Ruth and the bed SHAKE. Baby Lila, near the end of the bed now, CRIES and WAILS --  EXT. GAS STATION - SAME Ruth runs across the street --  INT. APARTMENT - DAY The DINGY PLASTER WALL CRACKS --  EXT. DESERT - DUSK Ruth runs out into the land as far as she can -- 96.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 137
    },
    {
      "scene_number": 17,
      "slugline": "INT. APARTMENT - DAY The silver pipe SNAPS --  EXT. DESERT - DUSK Ruth falls forward to her knees --  INT. APARTMENT - DAY Ruth comes to and GASPS. BABY LILA is NOWHERE --  EXT. DESERT - DUSK The sky moves, big and DARKENING before her.  INT. APARTMENT - DAY Ruth is surrounded by WATER on all sides, with the PIPE pushing more WATER into the room every second --  EXT. DESERT - DUSK Ruth lies back --  INT. APARTMENT - DAY Ruth’s ARMS PLUNGE into the WATER... NOTHING.  EXT. DESERT - DUSK Ruth CLENCHES her eyes shut --  INT. APARTMENT - DAY Frantic ,   she PLUNGES her ARMS IN AGAIN --  EXT. DESERT - DUSK Ruth grabs hold of DEAD WEEDS coming up from the dirt -- 97.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 130
    },
    {
      "scene_number": 18,
      "slugline": "INT. APARTMENT - DAY And GRABS UP Baby Lila. Baby lila doesn’t move. She doesn’t make a sound. Ruth stares. Breathless, helpless...  EXT. DESERT - DUSK A STRONG WIND begins to blow -- The ground starts to BLUR and press together as an INVISIBLE FORCE moves over everything...  INT. APARTMENT - DAY Until... Baby Lila WAILS.  EXT. DESERT - DUSK As a DROP OF WATER LANDS ON RUTH’S FACE. She OPENS her eyes.  INT. APARTMENT - DAY Ruth holds Baby Lila close. She rocks her. Up and down, up and down. Holding her as close as she can.  EXT. DESERT - DUSK ANOTHER DROP. Ruth touches her face. It’s WATER. She rubs it between her fingers until it’s completely absorbed into her skin. And she notices... her hand isn’t shaking anymore. She looks up, WIND blowing back her hair -- 98.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 142
    },
    {
      "scene_number": 19,
      "slugline": "INT. APARTMENT - DAY Ruth presses her face to Baby Lila’s head.  EXT. DESERT - DUSK Ruth’s mouth falls open. She gets up, steps back...  INT. APARTMENT - DAY Surrounded by water... Baby Lila has stopped crying. She stares up at Ruth, EYES WIDE WITH LIFE.  EXT. DESERT - DUSK Ruth’s eyes dart EVERYWHERE -- She smiles, exhaling, and then we see what she sees: THE SKY ABOVE HER is GREY, thick and cottony. And then, through the grey comes... COLOR. Willowy and radial, seeping through the grey, coming for her... PURPLE BLUE RED YELLOW She sees them. She sees the colors. The WIND GROWS as she backs away, slowly, the colors still coming -- CUT TO: 99.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 119
    },
    {
      "scene_number": 20,
      "slugline": "EXT. GAS STATION - EVENING Ruth on the run, she grabs the GAS CANISTER from where she left it and keeps running -- EXT. ROAD - SAME She runs, carrying the canister, a GREAT WIND pushing her on. And then again we see what she sees -- LONG BANDS OF COLOR Racing towards her. BLUE and RED and PURPLE Bright and sharp in the night -- EXT. TRUCK - SAME TIRES SCREAMING, the truck heads back down the road. INT. TRUCK - SAME Ruth’s eyes dart all around, as she sees the COLORS reflecting and refracting on the windshield, in the street lights and the wind and the night. She comes to a STOP LIGHT and as she races through it she looks up to see -- RED and YELLOW and GREEN Stretching up and out across the dark -- 100.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 142
    },
    {
      "scene_number": 21,
      "slugline": "EXT. FARMHOUSE - NIGHT The truck races down the driveway and then starts to slow down, barely stopping before Ruth jumps out... her COLORS gone now. She runs up to the house -- A look of horror on her face. THE DOOR IS BUSTED. SEVERAL WINDOWS ARE BROKEN. She races up the porch steps -- INT. FARMHOUSE/KITCHEN - SAME Everything has been TURNED OVER. The table. The chairs. The pictures. RUTH Mom! Lila! The blue and white bowl lies BROKEN on the floor. And then she notices... PILES OF DUST. She runs into the -- INT. FARMHOUSE/LIVING ROOM - SAME Everything is a mess here too -- RUTH Mom? INT. FARMHOUSE/LILA’S ROOM - SAME Ruth just stands in the middle of the room. Devastated. And over this --  KNOCK KNOCK KNOCK --  CUT TO: 101.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 136
    },
    {
      "scene_number": 22,
      "slugline": "EXT. SMALL SUBURBAN HOUSE - NIGHT CLOSE ON: RUTH’S FIST BANGS on the DOOR.  KNOCK KNOCK KNOCK --  It opens -- RUTH Where are they? MONROE (O.C.) They’re alright -- RUTH What happened? INT. SMALL SUBURBAN HOUSE - SAME Monroe moves aside as Ruth charges in. MONROE Sit. RUTH I can’t. MONROE Your mother is on her way here -- RUTH What about Lila -- MONROE They’re holding her. They came to the house looking for you. RUTH They? MONROE Police. With those other men, the ones who were after you. RUTH Why are they holding her, it’s -- MONROE When they came to the house she just... She used her abilities. Ruth’s mouth falls open... 102.",
      "characters": [],
      "action_text": "MONROE (CONT’D) She thought she could make them stop looking for you. This hits Ruth right in the gut. She makes to leave, but -- MONROE (CONT’D) There’s nothing to do until your mother gets back. RUTH Can’t we just go to the -- MONROE She’s coming from there. We just have to wait. Ruth gives in. Sits. Drops her head in her hands. MONROE (CONT’D) I sold the body shop and started at the academy soon after your mom asked me to leave. You were about 8, I think. RUTH Why are you... MONROE Before, you asked how long I’d been a cop. Ruth nods. Right. MONROE (CONT’D) Whenever there’s a case with a woman who’s missing? It’s always you. Ruth looks up -- MONROE (CONT’D) I’ve been doing it for so many years I don’t even remember how it started. When they tell me where the woman was, I see you there. When they tell me what she was doing, it’s you doing it. And then, eventually, things get solved and there’s this real woman standing there. Someone’s else’s sister. (MORE) 103. Someone else’s daughter. And it’s not you. RUTH How did you know? MONROE The bartender. At the place near Valley’s. Ruth nods. Of course. MONROE (CONT’D) You’re sober? RUTH (yes) Almost a year. MONROE I’m proud of you. She meets his eyes just as -- The door OPENS. BO Dean, I need you to -- Ruth stands up. RUTH Are you alright? Is she alright? BO They’re holding her. They wouldn’t let me see her. They don’t know about my abilities and they don’t know where you are.   You have to leave, Ruth -- RUTH I can’t. BO Why must you always be so -- RUTH I saw the colors. Bo’s eye go wide... RUTH (CONT’D) I did. Right after I left. MONROE (CONT’D) 104. Bo can’t help but feel it. RUTH (CONT’D) I think they’re more than something we see. You were right that someone could take apart the sky, but it’s not Simona. It’s -- BO No. You need to go! You need to hide, you need to -- With so much tenderness, Ruth shakes her head. RUTH We’re done hiding. She reaches up to touch Bo’s face, but Bo flinches -- Calmly, Ruth looks at he",
      "dialogue_count": 0,
      "word_count": 790
    },
    {
      "scene_number": 23,
      "slugline": "EXT. DOWNTOWN GARRISON - MORNING She looks up and down the street. Not many people here. Not many cars. And then she looks up at... THE SKY. And the WIND starts to move... ACROSS THE STREET Bo’s car pulls up in front of the POLICE STATION -- Monroe and Bo hurry out as a GUST OF WIND blows past them. Bo shudders and looks up -- She follows the wind as it moves over to... RUTH. Monroe heads for the station, but Bo puts her hand out, grabbing his arm, stopping him. And he follows her gaze... BACK WITH RUTH The wind above her begins to collect and swirl, forming... CLEAR DUST That then turns into a MASS OF DUST, taking shape. And as it swirls around it turns... WHITE Swirling into VAPOR... That same WHITE against that same BLUE. But this time, it’s... more. The swirling vapor beats and grows and beats and grows until it’s... A CLOUD. WAY UP in the SKY. Ruth staggers back, catches herself. BACK WITH BO AND MONROE Bo’s expression is tight and expectant, looking from the cloud back down to Ruth -- AND THEN -- WITH RUTH 107.",
      "characters": [],
      "action_text": "The ONE CLOUD begins to CHANGE COLOR, turning from white to grey... and then the grey SPREADS OUT out into MORE DUST and the DUST swirls and becomes MANY GREY CLOUDS That cast a SHADOW across the SQUARE, across the people who have stopped their cars, who have started to come out of the few buildings left in town, who have come outside to see what the hell is going on. The CLOUDS get DARKER and DARKER... And LARGER and LARGER... UNTIL -- They BREAK OPEN and... IT RAINS. It’s light at first, water dropping slowly from the clouds. Out of sequence, random. Ruth feels the rain on her face and... she opens her eyes. SOME PEOPLE run for cover. OTHERS stay and watch. The rain falls on Monroe. It falls on Bo. AND THEN -- More drops... More rhythm... Harder -- And FASTER -- AND -- INT. POLICE STATION/LITTLE ROOM - SAME  DROP DROP DROP DROP DROPDROPDROPDROP --  Lila looks around, so confused. RAIN falls on the roof and streams down the outside wall and -- MAN’S VOICE (O.C.) It’s raining! It’s raining! She hears FEET running away from her door. 108. She runs to the door, and standing on her tip-toes she looks out the tiny window to see... NO ONE’S THERE. EXT. DOWNTOWN GARRISON - SAME It rains on. And the people who ran inside when it started realize... It’s safe. They come back out. POLICEMEN come out from inside, Running down the steps of the building, out into the street -- Everyone is outside. Everyone is looking up at the rain. And then come the MEN IN SUITS, the Older Man, Bill’s Partner, and... Bill. Everyone has come to see it rain. To see it rain for the first time in years. Seeing Bill, Ruth starts towards him -- But Bo moves quickly, into the middle of the street -- When Ruth sees Bo, she stops. Monroe doesn’t know what to do. Bill turns to his men -- BILL (re Bo) Why is she back here? He turns to Bo -- BILL (CONT’D) We already went through this, Ma’am. But Bo doesn’t move. She stands her ground. ONE COP pulls his GUN. BILL (CONT’D) It will be better for you if you co",
      "dialogue_count": 0,
      "word_count": 1800
    },
    {
      "scene_number": 24,
      "slugline": "INT. TRUCK - MOMENTS LATER Soaking wet, Ruth and Lila drive through the rain, down the road and out of town. Lila hands Ruth the PIECE OF PAPER that Bo gave her -- LILA Bo said... Ruth, one hand still on the wheel, takes the paper and opens it. Holding it up on the wheel, in her mother’s familiar handwriting, is one last thing...  Simona Lott is real. She’s in Rome. There are others. You were right about the colors. Go take apart the sky.  Ruth’s eyes widen, the strangest smile of surprise and wonder lights up her -- LILA (CONT’D) What? What is it? And with a look to Lila -- CUT TO: EXT. ROAD - SAME The truck makes its way out of town. The road is empty and long. And the rain continues to fall.  the end.  116.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 142
    }
  ]
}