{
  "slug": "faults-2014",
  "title": "faults",
  "genre": "drama",
  "format": "film",
  "scenes_count": 9,
  "characters_count": 0,
  "characters": [],
  "total_words": 18348,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. HOTEL RESTAURANT - DAY 1   1  It’s 1986.  On ANSEL ROTH (40’s), alone in a booth eating a club  sandwich. He wears a blazer that’s a depressing shade of  brown and sports a mustache.  A WAITER approaches...  WAITER  Can I get you anything else?  He chews and swallows then shakes his head “no”...  WAITER (CONT’D)  In that case. Whenever you’re  ready.  Before the waiter can set the check on the table Ansel pulls  a crumpled piece of paper from his pocket and hands it to the  young man...  ANSEL  I have a voucher.  The waiter unfolds the paper. He inspects it, then...  WAITER  I’ll be right back.  He walks away from the table. Ansel doesn’t look up as he  eats the remainder of the fries on his plate.  A moment later the waiter returns with his MANAGER. Ansel  looks up...  ANSEL  That is a voucher from the hotel.  MANAGER  Well. Yes. It is. But this voucher  has been used already.  ANSEL  No it hasn’t.  The manager remains calm. He holds the paper out for Ansel to  see...  MANAGER  You see here. These are my  initials. I’m the manager.  (MORE)",
      "characters": [],
      "action_text": "When the voucher has been used I  mark it with my initials and then  it’s processed.  ANSEL  I was given that by the hotel.  MANAGER  I understand, but what I’m saying  is that you used it last night. I  remember you. It looks like you-  like   someone   tried to erase the  writing but it’s pen ink. It’s  faded but still there.  Ansel sits up.  ANSEL  I am a guest of the hotel. I was  promised one complimentary meal a  day while I’m staying here.  MANAGER  That’s fine but I don’t know  anything about that. You’re going  to want to talk with hotel  management about that. But this is  no good and I need you to pay for  your food.  ANSEL  How much is it?  MANAGER  Four seventy five--  ANSEL  (cutting him off)  I don’t have that.  MANAGER  How much do you have?  Ansel stuffs the remainder of his sandwich in his mouth. It’s  too big a piece and hard to chew.  ANSEL  (mouth full)  Nothing. I don’t have anything.  He continues to stare and chew, antagonistic...  2.  MANAGER (CONT'D) MANAGER  I’m going to have to ask you to  leave.  ANSEL  I’d like to finish my meal.  MANAGER  And I’d like for you to leave.  Plus, you’ve eaten your food.  Ansel’s plate is clean. He scans the table. He casually  reaches for the ketchup bottle, turns it upside down and  gives it a few shakes onto his plate. He eats a bite of  ketchup using his fork...  MANAGER (CONT’D)  Please, stop that.  He doesn’t... The manager slides the plate away from him.  Ansel reaches for the syrup dispenser but the manager steps  in and grabs him. A struggle ensues in the confides of the  booth.  The young waiter stays back, unsure of what to do.  The manager forces Ansel out of the booth. DELAYED PAN as the  manager pushes him towards the exit.  INT. HOTEL HALLWAY/LOBBY - DAY - CONTINUOUS 2   2  Ansel is shoved through the doors and out of the  restaurant...  MANAGER  I want you to know that I saw you  take that voucher out of the trash.  I wasn’t going to say anything  about that because I didn’t want to  embarra",
      "dialogue_count": 0,
      "word_count": 946
    },
    {
      "scene_number": 2,
      "slugline": "INT. HOTEL LOBBY - GUEST CHECK IN - DAY 3   3  The concierge presses 9 on the large phone and passes it to  Ansel who clearly dials enough digits to be a long distance  number. The concierge shakes his head disappointingly but  does nothing about it and instead helps another guest.  The phone rings. It rings again. And again before...  ANSEL  Hello, Terry? Pick up.  (waits)  It’s me, Ansel.  (waits)  Roth-- Ansel Roth. Can you pick up,  Terry?  A NEWLYWED COUPLE steps up to the counter next to Ansel. The   ***  RECEPTIONIST congratulates the happy pair...  Ansel moves to the edge of the counter and turns his back to  them.  ANSEL (CONT’D)  Sorry, I’m still here. I guess  you’re not in the office right now.  Terry, I don’t... This is... I’m at  the seminar in...  He leans over and interrupts the receptionist helping the  couple...  ANSEL (CONT’D)  What town is this?  RECEPTIONIST  I’ll be right with you, sir. I’m  assisting these guests.  She looks back at the couple and begins to speak.  ANSEL  (interrupting; to the  couple)  What town is this?  YOUNG MARRIED MAN  (annoyed)  Shepardsville.  Ansel returns to the edge of the counter. The receptionist  apologizes to the couple.  Yellow (10/17/2013)   6.",
      "characters": [],
      "action_text": "ANSEL  (back into the phone)  Shepardsville. I’m about to do the  seminar and I need to talk to you,  Terry. It’s about the deal and the  remainder of the... the tour.  (beat)  Things are not good. They are not  good. Okay, I’m hanging up now. I’m  going to go.  He hangs up the phone.  INT. ANSEL’S HOTEL ROOM - BATHROOM - DAY 4   4  Ansel pees into the toilet. He finishes and reaches for the  lever to flush but decides not to. He also decides to leave  the seat up.  He removes the toilet paper from the dispenser. He takes the  shampoo and soap from the shower as well as a towel and a  hand towel.  INT. ANSEL’S HOTEL ROOM - LIVING AREA - DAY 5   5  Ansel tosses the toiletries into his suitcase... Half the  space is full of copies of his book.  He scans the room for other things to steal. He takes the 9  volt battery out of the bulky remote control and puts it in  his coat pocket.  There’s a knock at the door...  HOUSEKEEPING (O.S.)  Housekeeping.  Ansel closes up his suitcase and carries it with him. He  opens the door to see a nice OLDER WOMAN with an accent.  HOUSEKEEPING (CONT’D)  Is okay?  ANSEL  Yes, it is okay.  She smiles. He starts to leave but...  ANSEL (CONT’D)  (feeling guilty)  Sorry. One second.  7. He goes into the bathroom and closes the lid and flushes the  toilet...  He listens to the sound as he stares at himself in the  mirror.  EXT. HOTEL PARKING LOT - DAY 6   6  Ansel totes his suitcase to a used late 70’s Chevy Chevette.  He pops open the trunk to the hatchback revealing stacks of  boxes filled with copies of his book. He places the suitcase  in the trunk and removes two of the boxes of books before  slamming the door shut.  Ansel walks back towards the hotel with the boxes but  struggles to carry them.  INT. HOTEL - CONFERENCE HALL - DAY 7   7  The somewhat large space is brightly lit by the room’s  overhead fluorescents. A small stage has been set up at the  head of the room flanked by the poster and stand from earlier  on one side and a table",
      "dialogue_count": 0,
      "word_count": 2446
    },
    {
      "scene_number": 3,
      "slugline": "EXT. HOTEL PARKING LOT - NIGHT - MOMENTS LATER 11   11  Ansel ducks behind his car and awkwardly lowers his face next  to the exhaust pipe. He breathes in the exhaust fumes...  He takes deeper and deeper breaths. He coughs then takes some  more breaths which makes him cough even more. After a while  of this though his body can’t take anymore...  Ansel rolls away from the car, gasping for air. He pulls  himself to his hands and knees and throws up. It’s sad.  INT/EXT. ANSEL’S CAR - HOTEL PARKING LOT - MORNING 12   12  His arms are crossed in an attempt to stay warm but he still  shivers as he sleeps in the driver’s seat of his Chevette.  There’s a careful knock on the window. He wakes to see Paul  and Evelyn smiling outside the vehicle...  PAUL  (muffled through the  glass)  Good morning Mr. Roth.  Ansel starts up the car and puts his seat upright...  ANSEL  I was just leaving.  EVELYN  (muffled)  Thank you for the book, again.  Ansel nods and half waves without making eye contact...  ANSEL  Okay, that’s fine.  He puts the car into gear.  PAUL  (muffled)  Can we buy you breakfast?  Ansel puts the car back into park and turns off the engine.  He rolls the window all the way down via hand crank, looks up  at the couple and after all this simply says...  ANSEL  Yes.  18.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 233
    },
    {
      "scene_number": 4,
      "slugline": "INT. RESTROOM - DINER - MORNING 13   13  - Ansel takes his jacket off and rolls up his sleeves. He  washes his face.  - He works up a lather in his hair using hand-soap then  rinses in the sink.  - He dries his hair under the air dryer. The automatic shut  off kicks in after several seconds so he punches the button  again. It shuts off again. He pushes the button again...  INT. DINER - MORNING 14   14  Ansel’s hair is still slightly damp. He eats with a ravenous  appetite as Paul and Evelyn talk...  PAUL  Our daughter is not well. She has  been poisoned. She’s someone else.  She doesn’t listen to us anymore.  EVELYN  She’s not around   to   listen to us.  We haven’t seen her in months. And  we’re not talking about her not  obeying because she’s an adult but--  PAUL  It’s like she’s shut off from the  world.  ANSEL  What is the name of the group?  PAUL  They call themselves “Faults”.  ANSEL  I haven’t heard of that one. Who is  the founder?  PAUL  We don’t know. No one know’s  anything about them. We don’t even  know how Claire came to find them.  ANSEL  When was the last time you spoke to  her?  19.",
      "characters": [],
      "action_text": "EVELYN  (looking to Paul)  A week ago? On the phone.  ANSEL  What did she say?  PAUL  I told her that we missed her. That  we were worried about her.  ANSEL  How did she react to that?  PAUL  She told us that she found God and  that she made love with “it” the  night before while others watched.  Ansel takes a huge bite of pancake while Evelyn and Paul wait  for him to say something. He takes a drink...  ANSEL  That does sound troubling.  EVELYN  We’ve tried everything.  ANSEL  Are you still supporting her  financially?  EVELYN  No, we cut her off last year.  ANSEL  Does she have a car?  PAUL  They tried to sell it but it was in  my name.  ANSEL  You are lucky. They usually sell  off items of value to fund the  group.  PAUL  A few days later Claire reported it  stolen. The next day it turned up  in our driveway.  ANSEL  That’s good.  20. PAUL  It was on fire.  ANSEL  Have you tried a family  intervention? Exit counseling?  EVELYN  We did. Thanksgiving day. The group  discourages interaction with family  and friends, especially on what  they call “days of falsities”.  Holidays. We convinced her to come.  That it would be okay.  Evelyn becomes choked up...  PAUL  When Claire arrived and saw what it  was she immediately turned violent.  There was an anger in her eyes. I  don’t know if this is going to make  sense but... For how weak she  looked, emotionally, physically,  she had a strength that I have  never seen in her before. I don’t  want to lose her, Mr. Roth.  Up to this point Ansel has treated this meeting as a free  meal but he no longer can. He stops eating...  ANSEL  There is one other option you have  here. Are you familiar with  deprogramming?  This concerns the couple...  PAUL  Is that what you did with that man?  The one from last night?  ANSEL  His sister. Yes, we attempted a  deprogramming on her six years ago.   *  EVELYN  I don’t... I don’t know what that  is.  ANSEL  A man named Ted Patrick developed  the method fifteen years ago.  Blue (10/07/2013)  ",
      "dialogue_count": 0,
      "word_count": 9106
    },
    {
      "scene_number": 5,
      "slugline": "INT. BATHROOM - REST AREA - NIGHT 47   47  The mirror was smashed and disregarded long ago. Ansel washes  his face in the sink. He spits. There’s some blood in it.  He wipes his nose and gently dabs his cheek.  EXT. REST AREA - NIGHT 48   48  Ansel walks past the frame. He stops and re-enters frame. He  stares at a vending machine...  He manages to move the machine from against the wall. He  presses and holds one of the vend buttons as he yanks the  plug from the outlet. Keeping his hand on the button he  struggles awkwardly to plug the machine back in. Success. A  can falls into the compartment.  INT. ANSEL’S CAR - VARIOUS - NIGHT 49   49  Various shots of Ansel driving through the night back to the  motel all from the same angle. In an effort to stay awake he  drinks his soda, blasts music and opens the window.  INT. ANSEL’S CAR - PENNY PINCHER MOTEL - PARKING LOT- DAWN 50   50  The Sun is just beginning to rise as Ansel pulls into the  Penny Pincher parking lot.  EXT. PENNY PINCHER MOTEL - UPSTAIRS WALKWAY - MORNING 51   51  We track with Ansel as he walks to the stairs, up the stairs  and down the upstairs walkway. From a distance we see a mass  outside of one of the motel rooms.  Ansel stops at first, then realizing it’s a body he begins  running towards it...  It’s Claire. She’s laying unconscious outside of room 205 in   ****  her underwear and socks. Her nose is bloody..  Ansel reaches her and tries desperately to wake her but she’s  out cold. He bangs on the door to the room. He feels for a  pulse then bangs on the door again.  There’s a sound of locks being undone before door opens to  reveal Paul...  PAUL  Ansel--   *  Green (10/23/2013)   66.",
      "characters": [],
      "action_text": "ANSEL   *  What did you do!?   *  He sees his daughter...   *  Green (10/23/2013)   66A. *  PAUL  Oh my god.  Ansel picks her up and carries her through the door into...  INT. ROOM 205 - MOTEL - MORNING - CONTINUOUS 52   52 ****  He sets her on the bed, which Evelyn hasn’t even had a chance  to get up from yet. Ansel pulls back the sheets and puts a  pillow under her head...  ANSEL  Claire. Claire sweetie, wake up.  You gotta wake up, Claire.  He lightly slaps her face a few times. No response...  EVELYN  What happened? Is she alive?  ANSEL  She’s breathing. Get me some water-  Cold water.  Evelyn goes to the bathroom door. It’s locked from the  outside...  EVELYN  (panicked)  The door’s locked.  ANSEL  It locks from the outside. Just  turn the lock.  (realizing)  Wait, why is it locked?  PAUL  You told us to lock her in the  bathroom.  ANSEL  Why isn’t she in there?   *  PAUL  I don’t know.   *  ANSEL   *  How did she end up outside?   *  Green (10/23/2013)   67. PAUL   *  I don’t know!   *  ANSEL  You didn’t see anything?  Green (10/23/2013)   67A. PAUL  We were asleep.  Evelyn comes back with an ice bucket full of water. Ansel  takes it from her and pours it over Claire...  Claire’s eyes spring open from the shock of cold. She  struggles to catch her breath...  ANSEL  There you go. It’s okay. You’re  okay. Just breathe. Breathe. There  you go.  Claire is shivering uncontrollably...  ANSEL (CONT’D)  Let’s get her a towel. And some  blankets.  CLAIRE  What happened?  Ansel looks to Paul and Evelyn. What did happen?   *  INT. ROOM 205 - MOTEL - DAY 53   53 ****  The door to 206 is closed. Claire and Ansel are alone...   ****  Claire sits in the middle of the bed. She seems back to  normal. Ansel is in a chair beside the bed. He has a small  bandage over the cut on his cheek...  ANSEL  I wanted to talk to you about what  happened yesterday.  CLAIRE  I don’t remember anything.  (beat)  Why did you have them lock me up?  ANSEL  It was in everyone’s best interest.  CLAI",
      "dialogue_count": 0,
      "word_count": 2513
    },
    {
      "scene_number": 6,
      "slugline": "INT. ROOM 205 - MOTEL - NIGHT - CONTINUOUS 57B   57B ****  We watch the footage, along with Ansel, until we hear barely  audible MOANING under the sound of the show. With everything  he has Ansel forces his head to turn...  It’s too blurry to make out any detail but it’s clear that  there, in front of Ansel, is Claire laying on her back on the  bed with her father on top of her. Her mother is sitting on  the edge of the bed beside them both, watching it all.  Ansel straightens his head and squints in an effort to focus.  It doesn’t help...  Blurry Claire sees that Ansel is awake. She looks right at  him as he falls back asleep.  FADE TO BLACK.  INT/EXT. ANSEL’S CAR - MOTEL PARKING LOT - MORNING 58   58  Ansel startles awake. “How the fuck did I get out here?”...  He notices the key is in the ignition. He sits there for a  moment then reaches for it... But he can’t bring himself to  turn it. He takes the key with him as he exits the vehicle.  EXT. PENNY PINCHER MOTEL - MORNING 59   59  We follow him as he climbs the stairs and walks down the  upstairs walkway until he reaches room 205.   ****  INT. ROOM 205 - MOTEL - MORNING - CONTINUOUS 60   60 ****  He opens the door with the room key and enters to find the  room empty...  He looks around, nothing out of the ordinary. The door to the  other room is locked.  He hears a sound from the bathroom. Ansel walks towards the  door which is slightly ajar. He opens it to find Claire in  tears on the floor.  INT. BATHROOM - ROOM 205 - MOTEL - MORNING - CONTINUOUS 61   61 ****  She’s absolutely shocked/relieved to see him. She jumps up  and throws her arms around him...  Green (10/23/2013)   78.",
      "characters": [],
      "action_text": "CLAIRE  I thought you left me.  ANSEL  What happened last night?  CLAIRE  I woke up and you weren’t there.  ANSEL  I was in my car. Why was I in my  car?  CLAIRE  My parents are gone.  ANSEL  What do you mean your parents are  gone?  CLAIRE  They left me a note. They said that  I’d given up and so they gave up on  me.  ANSEL  I saw them.  CLAIRE  Where were they going?  ANSEL  In here. In the room with us last  night.  (beat)  With you.  CLAIRE  That’s impossible. The doors were  locked. Both doors.  ANSEL  I saw them.  CLAIRE  (emphatic)  You’re wrong.  ANSEL  Where did you get that tape?  CLAIRE  Tape?  79. ANSEL  The show. My show!  CLAIRE  Your show? Ansel, I don’t--  ANSEL  You’re lying to me. Why are you  lying to me?  CLAIRE  I’m not--  Ansel grabs her arms and shakes her...  ANSEL  What the fuck is going on?!  The door to the bathroom slowly begins to shut behind them.  Neither notices...  ANSEL (CONT’D)  We... You made me lick you.  CLAIRE  You’re scaring me, Ansel.  ANSEL  How did you--  CLICK. The door closes shut. Ansel turns around and tries to  open it. It’s locked...  CLAIRE  Open it.  ANSEL  It’s   locked .  CLAIRE  Why is it locked?  ANSEL  I didn’t lock it- Why would I lock  it? Why is it locked!?  Ansel throws his body into the door. Nothing. He does it  again. Nothing. He takes a step back and really throws his  weight into it. Still nothing...  ANSEL (CONT’D)  There’s something blocking it on  the other side.  80. CLAIRE  That doesn’t make any sense. Why  are you doing this?  Ansel SCREAMS.  The phone begins to ring in the other room...  ANSEL  (realizing)  Fuck. That’s Terry. Terry is  calling. I have to answer that.  Fuck!  CLAIRE  Let me out. I want to get out of  here.  ANSEL  Stop . Just stop.  He throws himself into the door with everything he has this  time but injures his shoulder in the process...  CLAIRE  Are you okay?  ANSEL  NO I’M NOT FUCKING OKAY- OKAY?  He slides down the door to the floor and begins to cry. He’s  completely lost ",
      "dialogue_count": 0,
      "word_count": 1753
    },
    {
      "scene_number": 7,
      "slugline": "EXT. PENNY PINCHER MOTEL - PARKING LOT - NIGHT 63   63  Terry waits in the car in the passenger seat. He looks up at  the open door to room 205.   ****  TERRY  (to himself)  Come on, Michael.  Terry keeps his eyes trained on the door. Nothing...  TERRY (CONT’D)  Jeez-louise. What is taking so  long.  He pushes his way out the car and shuts the door.  INT. ROOM 205 - MOTEL - NIGHT - MOMENTS LATER 64   64 ****  Terry peeks his head from around the corner into the room.  Mick’s body is gone. The room is empty but the water in the  bathroom is running...  TERRY  Michael.  (waits)  I’m not playing around, Michael.  He carefully enters the room. He’s pretty scared.  TERRY (CONT’D)  What are you doing in there?  The front door begins to close, revealing Claire behind it.  When it closes she locks it immediately.  Terry jumps and turns around...  TERRY (CONT’D)  Good Lord- You sure startled me. I  must have the wrong room.  ANSEL (O.S.)  Hi, Terry.  Ansel is standing near the bathroom.   *  TERRY  Ansel. You didn’t answer our call  earlier today.  Green (10/23/2013)   89.  (MORE)",
      "characters": [],
      "action_text": "I told you to have the money for me  today and here you are screening my  phone calls- and I’m sorry but  that’s just plain rude. I’m sick of  playin’ these games with you-  Makin’ me drive out all this way.  Ansel takes a couple steps towards Terry.  TERRY (CONT’D)  Where’s my money, Ansel?  (beat)  And where’s Michael?  ANSEL  He has moved on.  TERRY  What is that supposed to mean?  ANSEL  I’m not sure.   *  Ansel motions to the floor beside the bed.   *  Terry takes a step forward and sees Mick lying face down with   *  the handle of a phillips head sticking out of his head...  TERRY  (crying)  Michael, no!  (to Ansel)  What have you done?! I wanted to  scare you, that’s all this was. Oh,  God- Why did you have to go and  take it this far?  Terry kneels down next to Mick and grabs his limp hand...   *  TERRY (CONT’D)  He was an act--   *  ANSEL  Do you know what a fault is, Terry?  Blue (10/07/2013)   90.  TERRY (CONT'D) TERRY  This is   your   fault..  ANSEL  A fault.   A   fault.  TERRY  What the heck are you talkin’  about?  ANSEL  A fault is a fracture. It’s a place  where pressure builds and builds  until it releases--  TERRY  Please, just let me go. I won’t  tell nobody about this- I swear.  Ansel is in his own world. The words are almost coming from  someplace else other than himself...  ANSEL  But slowly after hundreds of  thousands and millions of years  something begins to grow from these  faults. From these faults grow  mountains.  TERRY  Why are you doing this? This isn’t  like you. It’s like you’re a  different person.  It all makes sense to Ansel. Everything makes sense now.  He grabs a copy of his book from the TV Stand...   *  ANSEL  Someday I will be a mountain but  for now I am a Fault.  Ansel rushes towards Terry and strikes him across the face  with his book. Blood flies from Terry’s mouth. Ansel bashes  him with the book again, knocking him to the ground. He hits   *  him again, and again, and again.   *  ANGLE ON Claire, as she watches blank",
      "dialogue_count": 0,
      "word_count": 835
    },
    {
      "scene_number": 8,
      "slugline": "INT. ROOM 205 - MOTEL - MORNING - CONTINUOUS 67   67 ****  There’s a sheet on the floor over Terry’s body. Claire closes  the door and walks past it and on her way to the bathroom...  She comes out holding a tooth brush. She walks towards us but  instead of going to the front door she goes to the door to  room 206. She opens her side but the door to room 206 is   ****  closed. She knocks...  It opens revealing Paul and Evelyn. She walks into the room.  INT. ROOM 206 - MOTEL - MORNING - CONTINUOUS 68   68 ****  Claire hugs Paul then Evelyn...  PAUL  How were we?  CLAIRE  You both were amazing.  Evelyn and Paul smile at each other. They’re beaming.  CLAIRE (CONT’D)  Did you take care of him?  EVELYN  Just making sure. This was the  white one? Not the colored fellow?  CLAIRE  The man who struck me, yes.  PAUL  He is no longer.  CLAIRE  God willed it.  Evelyn and Paul nod in agreement.  EVELYN  (re: Ansel)  And is he..?  CLAIRE  He’s in the car.  EVELYN  Oh, that’s just wonderful. I could  cry.  Green (10/23/2013)   93.",
      "characters": [],
      "action_text": "CLAIRE  Out of everyone I chose you. You  understand how special you are,  don’t you? Both of you. I couldn’t  have done this without you.  She grabs two cups from the table nearby and pours some water  from the sink into each of them...  CLAIRE (CONT’D)  You’ve both reached the final  level. How does it feel knowing  you’re about to move on?  PAUL  I feel...  (tearing up)  ... happy.  EVELYN  Yes. It’s very special. I’ve never  felt this way before.  Claire takes two pills out of her pocket and puts one in each  of their hands...  CLAIRE  You have always been and will  always be with us. We will see you  on the other side.  Claire kisses Paul on the lips. It’s like a boyfriend and  girlfriend saying goodbye at the airport knowing they won’t  see each other for a long time...  Claire then kisses Evelyn in exactly the same way. We see it  in Claire’s eyes that she is in fact quite sad.  Both place the pill into their mouths. Claire hands them  their water and they drink.  EVELYN  With his knowledge your teachings  will continue to expand beyond  anything we ever could have  imagined.  PAUL  Ira... We love you.  Claire/Ira takes a step back and lets them lay down in their  respective beds...  She waits until their eyes close then leaves the room.  94.",
      "dialogue_count": 0,
      "word_count": 416
    },
    {
      "scene_number": 9,
      "slugline": "INT/EXT. ANSEL’S CAR - MOTEL PARKING LOT - MORNING 69   69  Claire approaches the car. She goes to open the door but it’s  locked. She knocks on the window. Ansel leans over and  unlocks the door. She gets in...  ANSEL  Sorry.  CLAIRE  No more apologies. We won’t dwell  on what’s happened only what is  happening now. We don’t feel sorry  for ourselves. We have each other.  We are strong.  Ansel puts the car into reverse, but keeps his foot on the  brake...  ANSEL  Where am I going?  CLAIRE  Home.  CUT TO BLACK:  F A U L T S  95.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 100
    }
  ]
}