{
  "slug": "fighting-with-my-family-2019",
  "title": "fighting with my family",
  "genre": "drama",
  "format": "film",
  "scenes_count": 16,
  "characters_count": 0,
  "characters": [],
  "total_words": 19642,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. STREETS - NIGHT 9   9  Zak and Raya stare out at the Norwich suburbs from the W.A.W. van. Zak notices a solitary TEENAGER, sitting alone on a PLAYGROUND SWING-SET. It’s a melancholy sight. EXT. COUNCIL ESTATE - NIGHT 10   10  The van slows as it approaches a COUNCIL HOUSE -- the Knight home. Suddenly -- a DEBT COLLECTOR appears as if from nowhere, waving a LEGAL LOOKING LETTER. JULIA Rick, he’s here again! RICKY Oh, bollocks. JULIA Drive! Drive! Ricky puts his foot down as the Debt Collector hollers: DEBT COLLECTOR Seven thousand, six hundred and fourteen pounds! The van speeds on -- DEBT COLLECTOR (CONT’D) You can’t run forever. We know who you are, Mr. Clondike! JULIA (to Ricky) Mr. Clondike? Ricky shrugs. They start LAUGHING. The van drives on -- EXT. NORWICH STREETS - DAY 11   11  Zak is behind the wheel of the van now, steering past the boarded-up shops and grafittied walls of a RUN-DOWN WORKING CLASS SUBURB. Kaiser peers out from the backseat. A group of Young Kids are lying flat on their backs on the pavement in front of a plywood ramp. An older boy sitting in a shopping trolley is being pushed by another at break-neck speed towards the ramp.  9.",
      "characters": [],
      "action_text": "It’s clearly about to end in tears when -- Zak rolls up in the van and BEEPS the horn. The TROLLEY stops, inches from the ramp and calamity. The kids see the van -- and their faces light up. They abandon what they’re doing, start to climb aboard. EXT. NORWICH - CITY CENTRE STREET - DAY 12   12  Raya hands out FLYERS to disinterested passers-by. She is helped by the TWO EMO TEENS who were in the crowd at the show: Hannah and Ellie -- both shy and reserved, now wearing W.A.W. T-shirts. Most passers-by ignore them or brush them aside like flies. RAYA Have you got a leaflet for the wrestlin’ tonight? Hello, sorry, I have somethin’ for wrestlin’... A MAN IN A BUSINESS SUIT happily takes a flyer -- then promptly spits his gum into it. Raya watches, disheartened. EXT. COUNCIL ESTATE - CORNER - DAY 13   13  PAULIE (15), THIN, WIRY, SHAVEN HEAD, is staring up at two OLDER SKATER KIDS. They take drags on a joint. PAULIE Good, right? That’s the same shit Rihanna smokes. The Skater Kids take out their money as Paulie hands over a little baggie of weed. Suddenly -- between the skater kids -- Paulie sees the W.A.W. van pull into view. PAULIE (CONT’D) Shit... He grabs the cash from the Skater Kids, bolts in the opposite direction -- as Zak leaps from the van, powers after him. Paulie rips across a street -- hurtles a low brick wall into a FRONT GARDEN. Zak hurtles after him. Paulie enters the open FRONT DOOR of a HOUSE -- zips straight through the lounge past a LITTLE GIRL watching TV -- out the back door. Zak streaks through the lounge without stopping.  10. Paulie stumbles out into the back garden. An OLD LADY hanging washing backs away in fright. Paulie is up and over the BACK FENCE into an alley -- but Zak’s right behind him -- barrels down onto him, drags him backwards. The OLD LADY peers over the fence -- as Zak rifles through Paulie’s pockets, pulls out a few bags of weed and pills. PAULIE (CONT’D) That’s not mine. ZAK Then why did you run? PAULIE You said I should do more ",
      "dialogue_count": 0,
      "word_count": 1831
    },
    {
      "scene_number": 2,
      "slugline": "INT. KNIGHT HOUSE - KITCHEN - DAY 21   21  Raya sets the table. Ricky is sat in his WIFE-BEATER VEST, reading THE DAILY STAR. Julia blitzes TV DINNERS in the microwave, arguing with Zak. ZAK I’m not asking you to bow and scrape, it’s just Courtney’s parents are quite -- RAYA Posh. ZAK Her dad is teetotal. RICKY So am I. ZAK Yeah, but he’s teetotal out of choice, not ‘cause he’s an alcoholic. RICKY Oh, la-de-dah. RAYA He just wants to make a good impression when they get here. RICKY Make a good impression, how? ZAK Can you put a shirt on for dinner? RICKY (incredulous) How   fuckin’   posh are they?! JULIA Why’s a posh bird goin’ out with a wrestler? RAYA ‘Cause he told her he’s gonna be rich and famous.  19.",
      "characters": [],
      "action_text": "ZAK No. ‘Cause I’m kind and considerate... except in the bedroom, when I’m an animal. RAYA Ugghhh!   RICKY That’s my boy! Learned from the master. ZAK (CONT’D) And can we keep the effin’ and jeffin’ to a fuckin’ minimum? Courtney’s dad don’t use cusswords. RICKY Who is her dad? The Archbishop of fuckin’ Canterbury? ZAK Please, can we just try and act normal? For Courtney’s sake. Off Julia and Ricky’s nods -- INT. KNIGHT HOUSE - KITCHEN/DINER - NIGHT 22   22  The Family are sitting around the dining table eating dinner. Ricky is now wearing a Norwich City soccer shirt. Zak is next to Courtney. Opposite them are DAPHNE and HUGH -- a MIDDLE-AGED, MIDDLE- CLASS, MIDDLE-ENGLAND COUPLE -- wildly out of place beside the tattooed and pierced Knight family. JULIA (best behavior) Can I say, on behalf of my husband and I, that we are delighted to finally make your acquaintance. DAPHNE Oh... well, likewise. Julia winks at Zak -- who smiles, pleased. RICKY More expensive sparkling water, Hugh? HUGH Thank you.  20. Ricky pours water for Hugh. JULIA Courtney says you’re in stocks and shares, Hugh? HUGH For my sins. And... you’re all wrestlers? RICKY All of us, mate, that’s right. DAPHNE Who exactly enjoys wrestling? RICKY Loads of people, luv. HUGH Just no one we know, dear. DAPHNE Isn’t it all fake? The Knight family bristle at the word. JULIA If it was all fake, Daph, would I have broken my leg three times? My collar bone twice? RICKY Would me elbow bend like this? He shows them his elbow. It’s lumpy, mis-shapen, and bends at a weird angle. Daphne and Hugh wince. JULIA That’s nothin’. You should see his cock. RAYA Mum... JULIA Sorry. (to Daphne and Hugh)  His penis.  DAPHNE How did you get into wrestling?  21. JULIA (grinning) Oh, this is such a romantic story. Do you want to tell it? RICKY No, go ahead. JULIA Well, when I met Rick I was thinkin’ of killing meself. RICKY She wanted to top herself, yeah. JULIA I’d been abused and livin’ on the streets. RICKY And I’d done eight ye",
      "dialogue_count": 0,
      "word_count": 5151
    },
    {
      "scene_number": 3,
      "slugline": "INT. NXT DEVELOPMENTAL CENTER - DAY 45   45  STATE OF THE ART training facility -- pristine WRESTLING RINGS branded with WWE NXT logos -- an even longer way from the W.A.W. From the ring, Hutch explains a routine, demonstrated at half- speed by his TWO COLLEAGUES. Raya’s eyes wander -- she takes in the other new recruits: EIGHT MEN, THREE WOMEN. The BOYS: LONG HAIRED DUDE, GERMANIC BEEFCAKE and BLACK ADONIS from the London trials -- plus an assortment of body- builders, college quarterbacks, all-American high school heroes and meathead farm-boys. The GIRLS from the pool: JERI-LYNN, MADISON and KIRSTEN. Each has the bombshell physique and pin-up good-looks of the archetypal WWE DIVA -- SEXY OUTFIT, MANICURED NAILS, RICH TANS, COIFFURED HAIR. Raya looks down at her own TATTY BLACK LEGGINGS, FADING ROCK T-SHIRT and SPLIT ENDS. Her porcelain-skin and Goth-rock look mark her out -- as the runt of the litter. She looks up -- finds Kirsten staring at her. Kirsten flashes a smile and a mouthful of gleaming white teeth. Raya smiles back. ANGLE ON: Hutch’s colleagues, as they now demo the sequence at full speed. Applause. Hutch turns to the Class. HUTCH Everyone got it? CLASS Yes, Coach! Hutch points to Raya and Madison. HUTCH You and you. Show me. INT. THE RING - MOMENTS LATER 46   46  Raya and Madison lock up. They repeat the routine. Raya flows through the memorised moves effortlessly.  50.",
      "characters": [],
      "action_text": "They approach the final moves -- when Raya improvises -- Madison is not expecting it -- reacts slowly -- takes Raya’s FOOT IN THE FACE. Madison’s nose explodes in a cloud-burst of red. MADISON Agghh!!! RAYA Omigod, I’m so sorry! Raya rushes to help Madison -- who angrily pushes her away, clutching her bloodied nose. Kirsten clicks her fingers, points to a towel -- Jeri-Lynn grabs it, hands it to her. KIRSTEN (to Jeri-Lynn) Call the doc. Hutch jumps into the ring -- Kirsten follows, hands him the towel to smother the bleeding. Hutch examines Madison’s nose. HUTCH It’s not broken. Someone call the doc... KIRSTEN On the way. RAYA (to Madison) I’m so sorry. Hutch spins on Raya, angry. The class all turn to watch. HUTCH Did I tell you to add your own moves? RAYA (apologetic) I’m sorry, I thought she’d know what I was doing. HUTCH Did I tell you to add your own moves? Raya shakes her head “no”. HUTCH (CONT’D) Then why did you?  51. RAYA Your routine seemed kind of... basic. HUTCH Basic? RAYA My step-brother taught me that stuff when I was, like, ten. HUTCH Your step-brother? RAYA Roy Bevis. (off Hutch’s blank look) The Zebra Kid? HUTCH (US pronunciation) The Zeebra Kid? RAYA (correcting) Zebb-ra. Hutch steps forward, looms in Raya’s face. HUTCH I don’t care if you were taught by the Zebra Kid, the Elephant Man or the fuckin’ Lion King -- this ain’t the ass-crack of England anymore, this is the NXT. If you want any chance of makin’ it on to the Main Roster, you do what I say, when I say it, or you can fuck off back home to The Addams Family. Understood? RAYA I’m just sayin’, I -- HUTCH IS THAT UNDERSTOOD? Raya nods. RAYA Yes, Coach. Hutch walks away.  52. Raya finds everyone eyeing her suspiciously. JERI-LYNN (PRE LAP) One minute she’s like, “I’m an expert” -- EXT. APARTMENT COMPLEX - POOL - DAY 47   47  Kirsten and Jeri-Lynn are sunbathing. JERI-LYNN -- and the next minute she’s “Oh sorry, it was an accident”. So it’s like, are you an expert or not? (then) I can’t underst",
      "dialogue_count": 0,
      "word_count": 930
    },
    {
      "scene_number": 4,
      "slugline": "INT. HOSPITAL - DAY 51   51  Zak is handed his new-born son KAYDEN. He holds him awkwardly, stares into his eyes. Panic more than joy. EXT. BEACH - AS BEFORE 52   52  Kirsten is in the lead, Raya behind her -- followed by Jeri- Lynn, then Madison. Kirsten reaches a HEAVY TRACTOR TIRE. Dumps her sandbag -- wrestles her tire upwards. Raya catches up -- struggles to get under her tire. Sweating hard, she gives herself an extra boost -- flipping her tire over -- trying to catch up with Kirsten. Jeri-Lynn is close behind. Raya soldiers through pain but Kirsten powers on -- gives a FINAL PUSH. Crosses the ‘finish line’ -- victorious. Raya, lungs working overtime, arrives behind her in second place. She drops, exhausted. Finds Kirsten staring at her with steel-cold eyes. Jeri-Lynn slumps down next to them. Madison is way behind, still doggedly trying to hoist her tire. It’s a losing battle. Hutch hollers at her. HUTCH Flip it! MADISON It’s too hard... HUTCH How you gonna throw a girl round a ring every night if you can’t even flip a tire? Now flip it! Madison shakes her head, drops the tire, waves her hands in defeat, collapses to the ground, sucking air. Raya watches as Hutch shakes his head in contempt. EXT. NORWICH STREET - DAY 53   53  Tatty trainers pounding down a pavement. A blur of limbs and faces. Paulie runs for his life, pursued by TWO TWENTY- SOMETHING STREET TOUGHS.  55.",
      "characters": [],
      "action_text": "The Toughs are gaining on Paulie as he dodges a car -- tears across the industrial estate towards the W.A.W. gym. INT. W.A.W. GYM - DAY 54   54  Zak (blindfolded) is counting steps with Calum from one side of the ring to the other. They reach one side, turn, walk back. Strays work-shop in the other ring. Paulie BARRELS through the door, lungs in overdrive. A Stray nudges Zak and he lifts his blindfold -- to see the Toughs skid into the doorway. Zak quickly assesses the situation. ZAK Can I help you? TOUGH No.   (re: Paulie) We just need our friend here. ZAK He’s busy. TOUGH With what? ZAK Hand-washing our jock-straps. The Toughs stride towards Paulie. Union Jack steps towards them, intimidatingly. The Toughs back down. TOUGH (to Paulie) Stay off our fuckin’ patch. They leave. Zak turns to Paulie. ZAK Empty your pockets. PAULIE I ain’t got nothin’... ZAK Empty your pockets.  56. Paulie turns out his pockets -- he hands over some little baggies of weed. Zak points to the door. ZAK (CONT’D) Get out! PAULIE Zak... ZAK You want to wind up in the nick with my brother? PAULIE No. ZAK No? Then what do you wanna do for a livin’? Stand on a street corner like a prossie? Or wrestle? PAULIE Wrestle. ZAK Right. Then cut this crap or I ain’t trainin’ ya. Paulie nods apologetically. Zak softens. ZAK (CONT’D) Paulie, you got talent, mate. If you focus and work hard, you could be as good as me. PAULIE Can I be as good as Saraya? The question is a gut punch for Zak. He covers. ZAK Sure. CALUM Can I be as good as her, Zak? The other strays begin to echo the sentiment: “ Could I be as good as Saraya?” “Can I be like her? --   a cacophony in Zak’s head.  57. ZAK (curt) Yes! His bluntness surprises everyone. ZAK (CONT’D) (softening) Yes... if you all work at it... so let’s go... come on... Calum resumes his practice. ZAK (CONT’D) Rest of you, blow ups, let’s go... The Strays begin BLOW UP DRILLS with renewed vigour. PUSH IN on Zak, as his thoughts churn -- EXT. APARTMENT COMPLEX - DAY 55",
      "dialogue_count": 0,
      "word_count": 1319
    },
    {
      "scene_number": 5,
      "slugline": "I/E. VAN - NIGHT 63   63  Rain pours. The van sits on the hard shoulder of a dual carriageway. Hazard lights on. INTERCUT with Hutch. HUTCH But... I’m afraid the answer is still no. ZAK Can I speak to someone else, please? Someone higher up? HUTCH I’m afraid not. ZAK Mate, you don’t understand. This is my dream. HUTCH I do understand, but the decision's been made. I’m sorry. ZAK Please, I have a kid now. I made my girlfriend promises. She’s not gonna stay around if -- HUTCH I’m sorry, I can’t help you any more. ZAK There’s gotta be something I can do. I can work harder, I can train. HUTCH We’re lookin’ for somethin’ you can’t train for. ZAK What? HUTCH Somethin’ extra. ZAK I have that. HUTCH No, you don’t.  62.",
      "characters": [],
      "action_text": "ZAK But my sister does? Pause. HUTCH The decision’s been made. ZAK Stop sayin’ the decision’s been made. Change the fuckin’ decision! Beat. HUTCH I gotta go. ZAK Please... The line goes dead. HOLD ON Zak, clutching his phone -- he punches the wheel repeatedly. Unleashes his anger -- desperation. Sits alone in the rain-swept van. INT. VENUE - BACKSTAGE - NIGHT 64   64  Hutch hangs up the phone -- walks back out to the MAIN VENUE: A SMALL LOCAL CROWD fill bleachers around a ring. Hutch finds himself beside Raya, watching from the wings as Madison and Jeri-Lynn sell a SO-SO ROUTINE to the crowd. Plodding moves receive cheers and cat-calls. They may not be great wrestlers -- but they’re going over. Raya watches the red-blooded crowd eating them up. Anxiety rising, Raya steps away. Hutch notices. INT. BATHROOM - MOMENTS LATER 65   65  Raya rushes in. Throws her head over the sink. Pukes. Runs water. Cleans her face. Looks at herself in the mirror.  63.",
      "dialogue_count": 0,
      "word_count": 303
    },
    {
      "scene_number": 6,
      "slugline": "INT. ZAK AND COURTNEY’S FLAT - NIGHT 66   66  Zak is slumped on the sofa, half-watching the TV, drinking a beer. Kayden is on his playmat. Zak’s phone rings. He looks at the caller ID: RAYA. Stares at her name. Considers answering. Presses ‘cancel’. KAYDEN starts to cry. Zak looks down at him -- turns up the volume on the TV. As Kayden bawls -- so Zak RAISES THE VOLUME -- until the TV is in full contest with the WHINE OF THE CHILD. Courtney enters, scoops up Kayden. COURTNEY Jesus Christ, Zak. She comforts the child. INT. SMALL VENUE - FLORIDA - NIGHT 67   67  Kirsten circles Raya in the ring, holding the mic. KIRSTEN My name is Kirsten, I’m the future of the NXT... and the future looks good. CHEERS of approval. “ Damn good!” “Yeahhhh!”  KIRSTEN (CONT’D) I’m so hot, I make the sun jealous. Rowdy DUDES in the crowd WHISTLE AND CAT-CALL lustily for Kirsten, who plays up to it -- born to this. Madison and Jeri-Lynn applaud admiringly from the back. Hutch looks on -- monitoring the reaction -- evaluating. KIRSTEN (CONT’D) Paige, little Paige... I could say I’m gonna rearrange your teeth -- but you’re British, I’d be doing you a favor! CHEERS of approval. KIRSTEN (CONT’D) You know what would look good with that outfit? This body.  64.",
      "characters": [],
      "action_text": "More CHEERS. KIRSTEN (CONT’D) So get ready -- because I'm about to slap you so hard when you stop rolling your clothes’ll be out of style. If those clothes ever were in style! More HOLLERS of approval. ANGLE ON: Hutch taking it in. The Douche and his cronies CHEER louder than anyone. Kirsten soaks in her applause, hands the mic to the referee, who hands it on to Raya. Raya looks at Kirsten, never feeling less attractive -- or more inadequate. She looks out at the audience -- HAYSEED LOCALS swilling beer, waiting to be impressed -- none of the welcoming faces of her Norwich regulars. Heckles ring out from a FAT SLOBBY DOUCHE in the front row, sucking down a 24 OZ beer, surrounded by braying bros. DOUCHE What do you call this look? ‘Old gay man from Miami?’ THROATY LAUGHTER from his cronies, rattling Raya. A bead of sweat trickles down her face. Hutch inches forward. Senses something is not right. DOUCHE (CONT’D) What spray-tan did you ask for? ‘Donald Trump’s ball-sack?’ LAUGHTER. Raya raises the mic to her mouth. All eyes on her. The spotlights blaze. Audience expectant. She catches sight of Hutch watching her. The world suddenly falls silent -- the only sound the thump of her heart. THUMP, THUMP, THUMP. Raya opens her mouth to speak -- and NOTHING COMES OUT.  65. Mute -- dry -- burning up under the scrutiny. Frozen. Failure. THUMP, THUMP, THUMP The Douche starts BOOING Raya. Others join in. Raya stews in her humiliation -- as the boo-ing rises. Hutch lowers his head -- taking no pleasure. Jeri-Lynn, Madison and the rest of the NXT watch as she climbs from the ring and hurries backstage -- to a CACOPHONY OF JEERS. She passes Hutch, who watches her go. EXT. VENUE - NIGHT 68   68  The girls exit the stage door. A huddle of new fans surge around Kirsten, Madison and Jeri-Lynn -- ignore Raya, who pulls up her hood, heads for the coach. INT. COACH - NIGHT 69   69  Raya sits alone at the back, humiliated. She stares out at the night. She hears HUSHED VOICES -- Kirsten spe",
      "dialogue_count": 0,
      "word_count": 3261
    },
    {
      "scene_number": 7,
      "slugline": "INT. RAYA’S BEDROOM - NIGHT 82   82  Raya dumps the shreds of photo into a TRASH BAG. She picks up a wrestling trophy. Tosses it into the bag. Picks up a handful of WWE ACTION FIGURES -- tosses them -- -- picks up the PHOTO of herself after her first match -- grinning, arm in arm with Zak, dressed in his PINK POWER RANGER OUTFIT. She throws it in the TRASH -- as there’s a KNOCK ON THE DOOR. RAYA What? JULIA (O.S.) It’s me... RAYA Go away. JULIA (O.S.) Open the door. She doesn’t respond. JULIA (O.S.) (CONT’D) Courtney called. Your brother’s missing... Raya looks up -- opens the door -- locks eyes with her mother. EXT. BRITANNIA ROAD - NORWICH HILLSIDE - NIGHT 83   83  CLOSE ON Zak, swigging from a bottle of vodka, lost in his darkness. His mobile phone is ringing. He takes it out of his pocket -- looks at the caller ID: Raya. Cancels the call. Takes another swig. Walks off. Passing the looming facade of the PRISON... INT. W.A.W. VAN - SAME TIME 84   84  Raya’s phone beeps dead. Ricky is driving. Julia shotgun, Raya in the rear. They scan the streets. No sign of Zak. Raya looks out -- up on the hillside -- she sees the looming outline of the PRISON.  82.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 222
    },
    {
      "scene_number": 8,
      "slugline": "EXT. STREETS - NIGHT 85   85  The W.A.W. van prowls through the night. Searching. INT. W.A.W. VAN - CONTINUOUS 86   86  Julia looks over at Ricky, then -- fear and worry etched on her face -- turns to Raya. JULIA If you don’t want to go back to America... we’re not gonna make you. RICKY What? (to Raya) You’re goin’ back. JULIA Not if she don’t want to. RICKY Has everyone gone mad?! If she gets on the main roster, she’s set for life. JULIA She is -- or you are? RICKY All of us. You want me to go back to robbin’ banks to feed this family? JULIA What family? Our daughter’s miserable. One son’s in jail, the other’s hangin’ on by a thread -- RICKY Zak is fine. JULIA Will you pull your thick head out yer fat arse! Zak is not fine! And if you’ve gotta go back to robbin’ banks to feed this family, so be it, ‘cause at this rate, we’re not gonna have a fuckin’ family to feed!  83.",
      "characters": [],
      "action_text": "RAYA Stop! Ricky turns. Raya is pointing through the windscreen -- at Zak’s car parked haphazardly in the street. INT. PUB - NIGHT 87   87  A SPIT-AND-SAWDUST BOOZER. Zak is at the bar working rapidly through a beer and a whiskey chaser. He finishes both, summons refills from the barman. A THUGGISH-LOOKING BRUISER stands next to Zak at the bar. He is served FOUR PINTS OF BEER. Zak watches as he gathers them up and turns towards his other THUGGISH-LOOKING FRIENDS. Zak deliberately gets up and elbows the Bruiser -- sending the beers crashing to the floor. The Bruiser spins on Zak -- towers above him. BRUISER You just stuck you're fuckin’ elbow out. ZAK No I didn't. BRUISER You callin’ me a liar? ZAK No. I'm callin’ you a wanker. Beat. The Bruiser gets in Zak’s face. BRUISER I didn't hear that... ZAK Didn't ya? Then you're a deaf prick, as well. The Bruiser swings a punch. Zak is ready for it -- side-steps -- clobbers him. The other Bruisers immediately come at Zak -- he fights them off -- they trade punches -- crash through a table, knocking drinks flying.  84. The Bruisers back Zak towards a POOL TABLE. Zak grabs a POOL CUE, swings at a Bruiser who tries to side- swipe him. The cue breaks over his shoulder. Zak raises the severed cue, is about to bring it down on another Bruiser when a hand grabs his arm. He spins around, ready to smack someone -- -- finds himself staring at Ricky. RICKY Let’s go. ZAK Fuck off. Ricky manhandles Zak towards the exit. ZAK (CONT’D) Fuck off! EXT. PUB - CONTINUOUS 88   88  Ricky bundles Zak out of the pub. Zak spins into the street, stumbles -- sees Julia, looking pained -- pauses for a moment -- then regains his footing -- drunkenly lashes out at his father -- but it’s Ricky’s turn to side-step. He grabs his son’s arm -- twists it -- Zak swivels out of the hold -- suddenly sees his sister looking at him. RAYA Zak... Zak ignores her. Goes at his father like a ram. Tries to take down Ricky -- Ricky defends himself, trying not to hurt Zak.",
      "dialogue_count": 0,
      "word_count": 2206
    },
    {
      "scene_number": 9,
      "slugline": "INT. NXT PERFORMANCE CENTER - AS BEFORE 100   100  Hutch stands, addresses the remaining Classmates as they applaud themselves. HUTCH As a reward, April 6th I’m takin’ you all on a date to a romantic little place I call... Wrestlemania !  As the Class explode into cheers and Raya grins excitedly. EXT. HM PRISON NORWICH - DAY 101   101  The heavy PRISON GATE gate opens -- and Roy walks out. He is welcomed with hugs and tears by Ricky and Julia. They hand a gift bag to Roy -- who reaches inside, lifts out - - a ZEBRA PRINT LEOTARD. He grins. Then looks around -- ROY Where’s Zak? EXT. ANOTHER NORWICH STREET - DAY 102   102  Zak walks up the street, smoking, drinking a beer. He stops. Up ahead -- he sees Paulie, back on ‘his’ wall. A man in his MID-20s approaches -- they exchange a few words. Paulie reaches behind the wall, pulls something up. They do a street handshake. Mid-20s goes on his way. Zak moves forward -- for a moment we think he’s crossing the road to reprimand Paulie -- but then he veers down a side street -- leaving Paulie to count his cash. SIDE LANE Zak walks head-down -- when he bumps hard into a MAN coming the other way with his MATE. VOICE (O.S.) Watch it. Zak looks around. It’s the Street Toughs who were earlier hassling Paulie. Zak watches them go -- as they head towards Paulie’s corner.  94.",
      "characters": [],
      "action_text": "EXT. NORWICH STREET - MOMENTS LATER 103   103  The two STREET TOUGHS are working Paulie over. It’s all Paulie can do to cover-up and deflect the blows. VOICE (O.S.) Sorry to interrupt, mate... The Tough turns -- it’s Zak. ZAK ... but he's due at wrestling trainin’. TOUGH Fuck off. ZAK I would, but he's paid for the lesson, so he could sue. Zak steps forward, the Tough pushes him back. TOUGH Seriously, stick to the fake fightin', yeah? He turns back, raises his fist to give Paulie a wallop -- when Zak grabs his arm. The tough instinctively swings a RIGHT HOOK at Zak -- who deftly ducks underneath it, steps forward -- uses his right arm to collar the punk -- and SLAMS him down with a ROCK BOTTOM. The punk gasps for air, wind knocked out of him. ZAK Did that feel fake, mate? STREET TOUGH 2 steps towards Zak -- who stares him down. The Tough gives Zak a once over -- doesn’t fancy his chances -- grabs his friend and drags him away. Zak turns to Paulie. ZAK (CONT’D) You alright? PAULIE Yeah. ZAK Good --  95. Zak gives him a clip round the ear. PAULIE Arrghhh. What’s that for? ZAK For missin’ training. Off Paulie’s confused look -- EXT. PARK - DAY 104   104  Calum sits sullenly on his swing. Behind him, Zak, Paulie and the W.A.W. van pull up. Zak HONKS the horn. Calum looks up, confused. HONK. Calum’s frown turns to a grin -- as we -- EXT. NORWICH STREET - DAY 105   105  The Strays are taking turns tossing half a concrete block at a street light in an effort to smash it. One or two of the younger ones have lashed a handful of fireworks together and are trying to light them. Suddenly -- Metallica. They all look up, see Zak and the van approaching. INT. W.A.W. GYM - OFFICE - DAY 106   106  Ricky and Julia are doing their tax returns. They hear something outside. They get up to investigate -- find Zak, running the Strays through drills. He is holding Kayden, as Courtney looks on. Ricky and Julia exchange glances. Ricky wanders up beside Zak. They share a look. Ricky reaches u",
      "dialogue_count": 0,
      "word_count": 675
    },
    {
      "scene_number": 10,
      "slugline": "INT. NEW ORLEANS SUPERDOME - BACKSTAGE - NIGHT 108   108  Raya and the NXT Class wander, wide-eyed, taking in the backstage hubbub -- WWE superstars getting MADE-UP -- adjusting costumes -- running through routines. They stop at a lavish CATERING SPREAD, stock up on food. Raya takes a handful of HOTDOGS. A hand taps Raya on the shoulder. She throws the hotdogs down like she’s been caught. The hand belongs to Hutch. She turns to look at him. HUTCH Come with me. Raya looks disconcerted, follows Hutch. Kirsten and the other girls watch her go. RAYA (to Hutch) Is everything okay? He doesn’t reply. INT. ELEVATOR - MOMENTS LATER 109   109  Raya stands beside Hutch. The elevator doors open. INT. SUPERDOME - BACKSTAGE CORRIDOR - MOMENTS LATER 110   110  Raya follows Hutch down a corridor. They stop outside a DRESSING ROOM. A BURLY SECURITY GUY opens the door. Hutch looks at Raya, gestures inside. She hesitatingly enters, confused -- watches Hutch as he walks away... INT. DRESSING ROOM - CONTINUOUS 111   111  Raya takes in the plush surroundings: leather sofas, lamps, candles, treadmill, buffet of food and beverage. She stands for a moment, uncertain of what is happening, when suddenly the door opens -- and Dwayne Johnson strides in. DWAYNE (smiling) Hey. How are you?  97.",
      "characters": [],
      "action_text": "RAYA (confused) Fine... You? DWAYNE Never better. You want anything? Sugar-free soda? Sugar-free gum? Wheat-free donuts? Raya shakes her head. DWAYNE (CONT’D) Water? Vitamin water? Protein water? RAYA No, thanks. I got three hot dogs waitin’ for me. DWAYNE I haven’t eaten a hot dog since 1987. RAYA Do you want one? They’ve got loads out there. DWAYNE I mean out of choice. RAYA Oh. Okay. Dwayne walks into an adjoining bathroom, begins changing from his ‘stage’ to ‘civilian’ shirt. Raya’s not sure what she’s doing there. DWAYNE How’s your family? RAYA Fine. DWAYNE When’s the last time you spoke to them? RAYA Couple of weeks ago. Dwayne appears from the adjoining room. DWAYNE Then we should give them a call.  98. Raya looks confused. RAYA You want to call my family? DWAYNE Yeah. RAYA Are you feelin’ light-headed? Your blood sugar’s probably low. You should have a hotdog. INT. KNIGHT HOUSE - LIVING ROOM - NIGHT 112   112  Wrestlemania on TV -- Ricky parked in his usual chair, Julia sitting in his lap, both watching. Roy lies on the couch. Zak leans in the doorway, sipping a beer. On the TV, reigning champion AJ LEE runs at NAOMI, who scoops her up -- but AJ reverses. COMMENTATOR (V.O.) Look at AJ! Looking to put her away! Submission maneuver! Naomi going to tap out! Naomi taps. COMMENTATOR (V.O.) Against all odds, AJ does it! AJ grabs the belt and starts to celebrate. The crowd goes wild. The house phone RINGS. Ricky answers, eyes fixed on the TV. RICKY (angry) Which prick’s phonin’ during Wrestlemania? INTERCUT: Dwayne on the phone, Raya beside him. DWAYNE It’s Dwayne Johnson. RICKY Yeah. And I’m Vin Diesel. DWAYNE No, it is me, Mr Knight.  99. RICKY Prove it. Pause. DWAYNE (full Rock mode)  Can you smelllll what The Rock is cooking?!  RICKY Yes -- bullshit! He hangs up. Beat. The phone RINGS again. Ricky answers, eyes still not leaving the TV. DWAYNE It’s Dwayne Johnson again... RICKY Glenn, your Yank accent’s awful. You just sound constipated. RAYA Dad... it’s actual",
      "dialogue_count": 0,
      "word_count": 997
    },
    {
      "scene_number": 11,
      "slugline": "EXT. MOTEL - SUNRISE 114   114  Raya sits outside, wrapped in the blanket. Watches the sunrise pensively. INT. W.A.W. GYM - DAY 115   115  Roy looks on as Zak supervises Calum and Paulie in the ring. Calum, cool and confident now, throws Paulie off the ropes. Calum bounces back -- clotheslines Paulie. The Strays watch at the apron, applaud. Calum climbs the TURNBUCKLE. Stands astride it. Wobbles nervously. ZAK You got it... Calum pauses -- then MOONSAULTS off, landing on top of Paulie, both crashing to the mat. Roy leans forward -- what the fuck? Paulie and Calum get to their feet, grinning with glee. WILD APPLAUSE from the Strays -- as Roy shakes his head in disbelief. EXT. BRITANNIA ROAD - NORWICH HILLSIDE - DAY 116   116  Zak and Roy jog up the hill. They reach the top, sucking in air, looking out at their hometown. ROY Can ya believe our little sister's gone from here, to the main roster of the WWE? ZAK You'd would've too, if they'd given you the chance. ROY Nah. She's got somethin' I never had. ZAK What?  103.",
      "characters": [],
      "action_text": "ROY You. He runs on -- leaving Zak to muse on his words -- as he stares out at the city. INT. NEW ORLEANS AUDITORIUM - MORNING 117   117  The vast arena is empty. Raya makes her way towards the ring - - climbs in -- walks the canvas -- staring up at the size and scale of this coliseum. Not in awe -- more in fear. We hear the swell of audience CHEERS -- and -- COMMENTATOR 1 (V.O.) Welcome back to ringside, everybody... INT. AUDITORIUM - NIGHT 118   118  The camera sweeps across the same vast arena -- now filled to capacity with an ocean of SCREAMING FANS. COMMENTATOR 1 (V.O.) Monday Night RAW, live after last nights explosive Wrestlemania... INT. LOCKER ROOM - CONTINUOUS 119   119  Raya, in costume, watches the LIVE FEED on the IN-ROOM TV. COMMENTATOR 1 (V.O.) Another capacity crowd here in New Orleans... and millions watching us LIVE across the globe... PUSH IN: on Raya, anxiety rising. ON SCREEN: JOHN CENA appears, soaks in his ovation. COMMENTATOR 1 (V.O.) And here comes John Cena -- INT. KNIGHT HOUSE - NIGHT 120   120  Telecast on TV. Every chair and inch of floor space is filling up with WRESTLERS, STRAYS, FAMILY and FRIENDS, buzzing with excitement. Paulie helps Calum find a seat.  104. Courtney and Kayden enter with Hugh and Daphne. Roy shoos some Strays off the couch to make space for them. Julia whispers quietly to Courtney. JULIA Where’s Zak? Courtney shrugs. Julia looks pained. ON TV: Cena bolts for the stage, followed by Sheamus and Big E. COMMENTATOR 1 (V.O.) -- splitting Sheamus and Big E... and here we go... six man tag team action... Cena, Sheamus and Big E charge into the ring and fight back the Wyatt Family. Electricity seeps through the crowd. INT. DRESSING ROOM - NIGHT 121   121  As the CROWD ROAR on TV, Raya hears their rumble through the walls -- looks at the plaster like it might burst. A knock on the door. HUTCH (O.S.) Paige! You’re up! Another ROAR rattles through the wall. RAYA Hang on, please. OUTSIDE Hutch HAMMERS on the door. HUTCH This i",
      "dialogue_count": 0,
      "word_count": 1101
    },
    {
      "scene_number": 12,
      "slugline": "INT. THE GORILLA - SAME 126   126  Raya watches -- waiting for her cue -- never more nervous. She looks at Hutch. RAYA Any advice? HUTCH Crush it. Or you’ll wind up with me on the “Who The Fuck Are You?” pile. RAYA Do you say mean shit to motivate me? Or are you really a prick? HUTCH This is wrestling... who knows what’s real? He smirks. Raya manages a half-smile in return. A STAGE MANAGER gives Raya her cue... INT. THE RING - SAME 127   127  AJ LEE I’m the saviour of the Diva’s division. I am the Diva’s division...! Suddenly... PAIGE’S MUSIC HITS -- Raya strides out -- and down the ramp. COMMENTATOR 1 (V.O.) What’s this? It’s a new face from NXT. She’s from Nor-wich, England, her name is Paige -- and she’s here on RAW! INT. KNIGHT LIVING ROOM - SAME 128   128  Everyone CHEERS -- Hannah and Ellie go wild for their hero. INT. CONTROL ROOM - SAME 129   129  Hutch enters -- takes his place behind writers, producers, other wrestlers. He watches the monitors expectantly.  109.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 183
    },
    {
      "scene_number": 13,
      "slugline": "INT. THE RING - SAME 130   130  Raya is blinded by the sting of the STAGE LIGHTS. Time slows down. Her eyes focus. She sees THOUSANDS of EXPECTANT FACES staring at her -- ready to judge -- a Roman coliseum. Some CHEERS. Some BOOS. A distant chant of   “Who are you? Who are you?”.  AJ (from the ring) What the hell are you doing here? The question snaps Raya out of her daze. She climbs into the ring, takes the mic. RAYA I... just came to do what no one else would... and that’s to congratulate you, AJ... AJ Well, aren’t you the sweetest little crumpet? She flicks Raya on the nose. AJ (CONT’D) But you know what? While you’re here in my ring and you’re all fancy and dressed, why don’t I do to you what I did to every single other girl last night? Why don’t I beat you? RAYA I’m not ready to -- AJ You’re not? Okay. AJ SLAPS her across the face. INT. KNIGHT LIVING ROOM - SAME 131   131  Everyone reacts:   “Ohhhhh!”  INT. THE RING - SAME 132   132  Raya tumbles to the mat -- clutches her cheek.  110.",
      "characters": [],
      "action_text": "AJ Ready or not, this is my house. I’ll tell you when you’re ready. I think we need to have a match right now. And I will put my title on the line! COMMENTATOR 1 (V.O.) We have a title match? COMMENTATOR 2 (V.O.) But Paige is not ready for this... INT. KNIGHT LIVING ROOM - SAME 133   133  The whole gang leans towards the TV. Julia bites her nails. VOICE (O.S.) Mr. Bevis? Everyone turns. The Debt Collector is stood in the living room doorway. DEBT COLLECTOR You owe eight thousand, two hundred and thirty-three pounds. RICKY You'll get your money -- my daughter’s on TV. DEBT COLLECTOR That's not your daughter. Ricky holds up a framed picture of Raya. The Debt Collector compares it with the girl on the TV. They match. RICKY Now sit down, shut up and have a beer. Ricky tosses a can of lager to the Debt Collector -- as all eyes return to the TV -- ON SCREEN 134   134  A Referee has appeared. A bell rings. AJ sprints at Raya -- punches her in the throat, against the ropes. Raya falls to the mat, as AJ pummels her in the back.  111.",
      "dialogue_count": 0,
      "word_count": 396
    },
    {
      "scene_number": 14,
      "slugline": "INT. THE RING - SAME 135   135  AJ grabs Raya by her hair, tosses her like a rag-doll at the ropes. Raya springs off them -- head-first into a BACK ELBOW from AJ -- crashing to the mat. Raya lies on the mat, frozen to the spot. AJ skips around her, gloating. INT. KNIGHT LIVING ROOM - SAME 136   136  Julia leans forward, worried. JULIA Why she’s just sittin’ there? ZAK She’s milkin’ it. RICKY (concerned) No, she’s frozen. ZAK It’s part of the show. JULIA I know my daughter. She’s chokin’. ZAK I’m tellin’ you -- she’s fine. PUSH IN ON RAYA -- on screen -- Raya looks frozen to the spot -- while AJ vamps, buying time. INT. CONTROL ROOM - SAME 137   137  Hutch leans forward -- studies Raya on the monitor -- has he backed the wrong horse? INT. THE RING - SAME 138   138  AJ struts over -- pulls Raya to her feet -- side-kicks her in the stomach. Raya doubles over. INT. KNIGHT LIVING ROOM - SAME 139   139  Everyone -- the Debt Collector now sitting among them -- WINCE as one --  112.",
      "characters": [],
      "action_text": "-- as AJ swings Raya against the ropes. INT. THE RING - SAME 140   140  Raya hangs there for a second -- -- then COMES ALIVE -- -- bursts into action, charges at AJ -- ducks under a clothesline -- bounces off the ropes -- delivers a FLYING DROP KICK to AJ. The CROWD CHEER -- INT. KNIGHT LIVING ROOM - SAME 141   141  Everyone CHEERS, too. Daphne blows out of her seat. DAPHNE Suck my balls, bitch! Everyone reacts to Daphne’s new found aggression. ON SCREEN 142   142  Raya BACKHAND CHOPS AJ. ZAK (to Julia) Told you she was fine... INT. CONTROL ROOM - SAME 143   143  Hutch leans back, relieved. INT. THE RING - SAME 144   144  AJ checks for blood -- comes forward -- jumps on Raya’s back. COMMENTATOR 1 (V.O.) AJ looking for the Black Widow... submission manoeuver. Raya struggles -- AJ has her beat -- when Raya winds her right arm back -- delivers a swinging leg hook fireman’s carry slam, dumping AJ on the back of her head. Huge ROAR OF APPROVAL from the crowd.  113.",
      "dialogue_count": 0,
      "word_count": 373
    },
    {
      "scene_number": 15,
      "slugline": "INT. KNIGHT LIVING ROOM - SAME 145   145  Zak jumps up. ZAK (excited, proud) That was my move! That’s the Zak Attack! COMMENTATOR 2 (V.O.) Oh! What are we calling that -- ? COMMENTATOR 1 (V.O.) How about -- the Paige Turner! INT. THE RING - SAME 146   146  Raya leaps on top of AJ -- pinning her to the mat. CROWD  This is awesome! This is awesome!  The Ref slams the canvas:   ”One... ”  INT. KNIGHT LIVING ROOM - SAME 147   147  ALL Two... Hugh and Daphne clutch each other, enthralled. INT. THE RING - SAME 148   148  The Referee calls it:   “...three!”  INT. KNIGHT LIVING ROOM - SAME 149   149  TOTAL FUCKING BEDLAM -- hugging -- CHEERING -- crazed with pride -- the adrenalin of a life-changing moment. Kaiser is BARKING LOUDLY. HANNAH Group hug. Family -- Strays -- wrestlers -- Daphne and Hugh all bundle into a group hug. Beat.  114.",
      "characters": [],
      "action_text": "COURTNEY Paulie! PAULIE I can’t help it! It does what it wants! ZAK Fifty. PAULIE It’s only semi. ZAK Fine. Twenty five. INT. THE AUDITORIUM - SAME 150   150  The Crowd CHEERS. Raya clasps her hand to her mouth. She can’t believe it. Flooded with emotion. The referee raises Raya’s arm. COMMENTATOR 1 (V.O.) The twenty year old from Norwich, England wasn’t ready to be in WWE, comes here tonight to congratulate AJ and -- COMMENTATOR 2 (V.O.) -- is going to leave as the youngest WWE Diva’s Champion... in history! COMMENTATOR 1 (V.O.) And the first ever to win the title in her DEBUT MATCH! COMMENTATOR 2 (V.O.) Unbelievable! We have a new Diva’s champion -- Paige! Raya takes the Title belt, climbs onto the ropes, raises her fist triumphantly in the air and hoists the belt above her head. The crowd chants -- “PAIGE! PAIGE! PAIGE!!” -- just as Zak had envisioned back at the O2 Center. We 360° around Raya -- sharing her moment.  115.",
      "dialogue_count": 0,
      "word_count": 323
    },
    {
      "scene_number": 16,
      "slugline": "INT. CONTROL ROOM - SAME 151   151  Hutch watches the crowd cheering Paige’s name, assessing the response. INT. KNIGHT LIVING ROOM - SAME 152   152  Julia turns to Ricky. JULIA Our baby did it. They stare at one another for a beat -- then start making out passionately like teenagers. Hugh and Daphne shift uncomfortably. ANGLE ON: Zak watching his sister climb onto the rope, holding aloft her victory belt -- just as they’d practiced as kids. INT. THE TUNNEL - SAME 153   153  Raya jumps from the ring -- camera in her face as she melts into tears. She enters the TUNNEL leading backstage -- met by Kirsten ,   Jeri-Lynn and Madison. The girls embrace. Over their shoulders, Raya notices Hutch. With a nod and a flicker of smile, he tells her he’s proud -- and she understands. INT. KNIGHT LIVING ROOM - SAME 154   154  PUSH IN on Ricky. Could he...? Is he... crying, too? HOLD ON this beautiful moment -- then -- JULIA Are you cryin’? RICKY I ain't cryin’. JULIA (to everyone) The big man’s fuckin’ cryin’! Everyone turns to look, smirking.  116.",
      "characters": [],
      "action_text": "RICKY I ain't cryin’, it's that fuckin’ dog.   I'm allergic. JULIA Don't blame the bloody dog, you big girl’s blouse... ON TV 155   155  Raya holds her championship belt, emotional and overwhelmed. She blows a kiss to the camera and smiles widely into the lens. INT. KNIGHT LIVING ROOM - SAME 156   156  Zak smiles back, holding Kayden, sharing the moment with him. Pulls Courtney in close. PAN off Raya on TV -- to a photo of brother and sister on the mantle -- their teenage selves, grinning, arms around one another, fists raised -- striking a FIGHTING POSE for the camera. FADE TO BLACK. CAPTIONS: 157   157  Calum and Paulie are now professional wrestlers. Julia started her own women's wrestling promotion. Ricky retired from live wrestling... but was so miserable, Julia made him start again. Zak continues to wrestle in a tag-team with Roy... and train new recruits at the W.A.W. School. Paige is two-time Diva’s Champion... and one of WWE's biggest... and most controversial... stars. Dwayne ‘The Rock’ Johnson went on to a successful career outside of wrestling.  FADE OUT.  117.",
      "dialogue_count": 0,
      "word_count": 371
    }
  ]
}