{
  "slug": "film-stars-dont-die-in-liverpool-2017",
  "title": "film stars dont die in liverpool",
  "genre": "drama",
  "format": "film",
  "scenes_count": 14,
  "characters_count": 0,
  "characters": [],
  "total_words": 21159,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. LEADING LADY’S DRESSING ROOM - NIGHT 1   1  Snug and serene. An illuminated vanity mirror takes centre stage emanating a welcoming glamorous glow. A SERIES OF C/UP’s: A TDK AUDIO TAPE inserted into a slim SONY CASSETTE PLAYER immediately placing us in the late 70’s/early 80’s. A CHIPPED VARNISHED FINGER NAIL presses play..  ‘Song For Guy’ by Elton John (Gloria’s favourite track)   drifts in... OUR LEADING LADY sits in the dresser. Find her through shards of focus and reflections as she  transforms .. warming her vocal chords as she goes: GLORIA (O.C.)  ‘La Poo Boo Moo..’  Eye-line pencil; cherry-red lipstick; ‘Saks of Fifth Avenue’ COMPACT MIRROR, intricately engraved with “Love Bogie ’In A Lonely Place’ 1950”; Elnett hair laquer; Chanel perfume. A larger BROKEN HAND-MIRROR. A GOLDEN LOVE HEART PENDANT (opens with a sychronised tune). All Gloria’s ‘tools’ procured from a TATTY GREEN WASH-BAG, a trusted witness to her ‘process’ probably a thousand times or more. GLORIA (O.C.) (CONT’D)  ‘Major Mickey’s Malt Makes Me Merry.’  Costume: Peek at pale flesh and slim limbs as she climbs into a black, pleated wrap around dress with a plunging neckline; black stockings and princess slippers.. the dress hangs loose, too loose.. the belt tightened as far as it can go. A KNOCK ON THE DOOR STAGE MANANGER (V.O.) Five minutes Miss Grahame. GLORIA (O.C.) Thanks honey. Gloria’s tongue CLUCKS the roof of her mouth in approval,   it’s one of her things .  1.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 242
    },
    {
      "scene_number": 2,
      "slugline": "INT. DUKE’S PLAYHOUSE THEATRE/STAGE - LATER 2   2  WE CLASP EYES on Gloria for the first time   being  AMANDA WIGFIELD in the ‘Glass Menagerie’. Owning the stage. Acting her guts out   goddamit . AMANDA/GLORIA  “That’s why you act like this! I don’t believe you go every night to the movies! Nobody goes to the movies night after night. Nobody in their right minds goes to the movies as often as you pretend to!”  Gloria’s eyes blazing. FADE TO BLACK: INT. DUKE’S PLAYHOUSE THEATRE - CONTINUOUS 3   3  APPLAUSE from a small, enthusiastic AUDIENCE. Gloria takes her curtain call and theatrically welcomes her fellow ACTORS on stage. They hold hands and bow.. THEN Curtain down, house lights on.. and over the   speaker system the famous ditty   ‘I’M JUST A GIRL WHO CAN’T SAY NO’   - sung by ‘Ado Annie’, Gloria’s character in ‘OKLAHOMA’. The gimmick that sends the audience merrily on their way. OMITTED 4   4   *  INT. DUKE’S PLAYHOUSE THEATRE/STAGE - CONTINUOUS 5   5  Gloria shimmying her shoulders as STAGEHANDS pack up. GLORIA (softly singing)  “I’m just a fool when lights are low, I can’t be prissy and quaint-- I ain’t the type what can faint-- How can I be what I ain’t? I can’t say no”.  2.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 209
    },
    {
      "scene_number": 3,
      "slugline": "INT. DUKE’S PLAYHOUSE THEATRE/DRESSING ROOM - NIGHT 6   6  Gloria de-robing. The high wearing off, the beginning of a comedown she knows all too well. In the flesh she looks THIN. The wrong type of thin. SUDDENLY Gloria clutches her stomach; face contorted. WIDEN OUT as she collapses to the floor. EXT. ALLEYWAY/BELLA AND JOE’S HOUSE - NIGHT 7   7  PETER TURNER, 28, a strapping Scouser, walking home from ‘work’ down a rough Liverpool back alley. Note he has faint traces of THEATRE MAKE-UP that he’s not cleaned off properly... The alley leads onto a street full of red-bricked Victorian Terrace Houses. He stops outside NUMBER 8 the house where he grew up, strange he’s back, ‘nice strange’. Brother Joe’s FORD CAPRI parked on the path. He wanders in.. INT. BELLA AND JOE’S HOUSE/KITCHEN - CONTINUOUS 8   8  BELLA (70), Peter’s mum, cooks sausages for older brother JOE (40), his curvaceous wife JESSIE (38) sits playfully in his lap. JOE SNR (71), a man of greying countenance, is trailed by CANDY the mongrel dog as he scours the kitchen for the dog’s lead. JESSIE Y’might be staying in a luxury hotel Bella. Y’know three star and that, maybe more.. BELLA I don’t want to be staying in a bloody luxury hotel! JOE And be waited on hand and foot? Like the ‘Queen of Sheba’? BELLA Joseph, my ‘Queen of Sheba’ days disappeared down the swanny the day I married your bloody father.  3.",
      "characters": [],
      "action_text": "She scowls at Joe Snr, now even more desperate to escape. Suddenly Peter bowls in nearly knocking him over. They just give each other a canny look. JOE SNR Seen the dog’s lead? PETER Not my department. JOE SNR Desperate here lad. BELLA (at Joe Snr) Sixteen years I’ve waited for this trip! You knew all about this stopover didn’t you? Y’big lump of lard! Forgot to tell me ‘till now. We’re supposed to be off next Tuesday. I would never have agreed if I’d known. JOE SNR Sod this. Joe Snr disappears with the dog sans lead. Bella watches him bang the door on his way out. PETER What’s going on? JOE (notices) Y’mean apart from you wearing bloody eye-liner.   Jesus wept.   *  Joe seriously can’t believe it. Peter rushes to the sink and rubs it off. JOE (CONT’D) Bloody actors, dressing up as birds, putting make-up on. Weird way to make a living for a bloke if you ask me. PETER No-one’s asking you ‘soft lad’. And I’m not playing   a bird .. I’m playing ‘a nurse’ in a Allan Bleasdale play.  4.  CONTINUED: 8   8 JOE Can’t wait for this bloody   *  ‘play’ thing to end so you can   *  bugger off back to London.   *  Where you belong.   *  BELLA   *  Joseph! Enough.   *  Joe doesn’t mess with Bella. The lads flick ‘Vs’ like   *  kids do, behind Bella’s back.   *  PETER (to Bella)   *  You look stressed, ma. What’s   *  up?   *  BELLA I don’t want to talk about it. JOE Course she doesn’t. PETER Ma..? BELLA Well.. I’ve just been reliably informed,   by looking at the bloody tickets , that there’s a twenty four hour stopover in Manila when we fly back from Australia. PETER Manila, eh? Nice. BELLA No Peter. Not nice. Not nice at all. (collects herself) I’ll have just said goodbye to your brother Billy... maybe the last time ever-- PETER Don’t be daft..   JOE Don’t say that! BELLA (CONT’D) No you two don’t be daft! I won’t be going back all that way again, and our Billy won’t be coming back to Liverpool, ever.  5.  CONTINUED: (2) 8   8 So, yes, it’s probably the last time I’ll see him b",
      "dialogue_count": 0,
      "word_count": 4171
    },
    {
      "scene_number": 4,
      "slugline": "INT. PUB - LATER - NIGHT 28   28  Gloria and Peter burst in with that ‘just-seen-a- great-movie’ energy. Head to the bar. GLORIA It’s when the small aliens pop out from between your legs that things get complicated... The BARMAN comes over - peering at Gloria. Peter orders two pints. PETER How many times has that happened to you then? GLORIA Oh just the four.. PETER Four!? Gloria not sure how to take this. Peter genuinely flabbergasted. GLORIA What? You didn’t think I’d have any kids? PETER I didn’t expect you to have four, that’s like-- GLORIA -One more than three. PETER Where are they? GLORIA I keep ‘em safe.. with my four ex-husbands. Peter has to catch his jaw.   *  GLORIA (CONT’D) Excuse me, I need to powder my nose. Gloria heads off unsure how she’s come out of that; BARMAN arrives with the pints of ale.  27.",
      "characters": [],
      "action_text": "BARMAN Two fifty mate. Peter breaks out of his spell, pays up. BARMAN (CONT’D) Don’t mean to pry, but is that Gloria ‘whatsername’... Grahame. PETER I’m not 100 percent.   She says she is. BARMAN I recognise that pout! She was in loads of things in the 50’s, a proper film star she was. PETER Apparently so, yeah.. BARMAN Won an Oscar too if my memory serves me right. PETER Y’what? BARMAN Yeah, that film she did with Kirk Douglas, forget the name. PETER An Oscar? You sure? This hits Peter just as hard as ‘the kids’ reveal. BARMAN She not mentioned it? PETER (reflective) No... BARMAN If I’d won an Oscar I’d be wearing it round my neck so every Tom Dick and Harry’d would get the message. Knowhat-   *  I-mean son?  28.  CONTINUED: 28   28",
      "dialogue_count": 0,
      "word_count": 286
    },
    {
      "scene_number": 5,
      "slugline": "INT. TUBE CARRIAGE - LATER - NIGHT 29   29  Sat opposite. Peter eyeing Gloria with intrigue. The Oscar revelation knocked him off balance. Gloria catches him.... GLORIA What? PETER What, what? GLORIA  You   that’s what... Peter innocently points at himself. GLORIA (CONT’D) Yeah, you mister. You’ve gone all quiet on me. PETER I’m just ‘The strong, silent type’. GLORIA Oh yeah? PETER Think Robert Redford y’know..   *  ‘The Sundance Kid’. GLORIA OK I’m thinking... and I like that thought. They hold each others eyes... enjoying the sights. AND AS THE TUBE LIGHTS FLICKER ON AND OFF WE-- FLICK TO BLACK: FLICK IN: INT. GLORIA’S PRIMROSE ROOMS - LATER - NIGHT 30   30  Gloria hands a large glass of bourbon to Peter. GLORIA Cheers. They clink glasses and drink.  29.",
      "characters": [],
      "action_text": "PETER This is becoming a habit. GLORIA I like habits. Especially bad ones. She clucks her mouth. GLORIA (CONT’D) Hey, I gotta question. How do you join the Royal Shakespeare Company? PETER You don’t just fill a form out. I think you get invited to apply. GLORIA How do you get invited? PETER Through your agent. Or they head-hunt you I imagine. I mean I don’t know for sure, I wish I did. GLORIA OK, I’ll let my agent know... PETER Why? GLORIA ‘Coz I really wanna play Juliet for the ‘RSC’. PETER Juliet?? GLORIA Yeah. PETER (laughs) You mean the Nurse don’t you?! Gloria... a slow rage begins to engulf her. GLORIA I get it. You think I’m too old to play Juliet huh?  30.  CONTINUED: 30   30 Peter straightens - doesn’t know what to say. GLORIA (CONT’D) (in his face) Huh??? Gloria’s eyes blaze through him. GLORIA (CONT’D) Fine! She slams her drink down, marches to the coat stand. GLORIA (CONT’D) Fine! Puts on her rain-coat. GLORIA (CONT’D) You think I’m just an old lady don’tcha? Too old for you is that what you’re saying? PETER Er.. That’s not what I said. Gloria - too wrapped up in her rage. GLORIA Well you’re wrong Mister! I’m gonna go to that theatre right now and see one of their shows. Take a look at the competition. Thanks. Thanks a bunch! At least I have a chance to join the ‘RS’ goddamn ‘C’ coz at least I’m an actor who works! Peter jumps in front of the door. PETER Come on, don’t be like this.. GLORIA Move. PETER I’m not sure the RSC even has a performance tonight. GLORIA ‘The Merchant of Venice’. Aldwych Theatre. 7.30. I’ve done my homework!  31.  CONTINUED: (2) 30   30 PETER Well I don’t want you to go! GLORIA Why? PETER Because-- And with no words left in his locker Peter just grabs hold of Gloria and plants his lips on her. AN intense and long kiss - finally they come up for air. PETER (CONT’D) There! That’s why! A moment where Gloria feels the dizzy after effects. Then BAM! Peter grabs her - lips meet - the pent up frustrations. They smother each other. Clothe",
      "dialogue_count": 0,
      "word_count": 634
    },
    {
      "scene_number": 6,
      "slugline": "INT. WATFORD THEATRE - CONTINUOUS 33   33  THE HUGE APPLAUSE continues as Gloria takes her curtain call. She plays it like the Hollywood pro she is. Peter is on his feet, wolf whistling. Gloria throws him a personal cross-eyed wink which he loves! INT. WATFORD THEATRE BAR - LATER - NIGHT 34   34  Buzzy 1st night party. Gloria and Peter in the midst quaffing champagne, LOTS OF ADMIRERS and people wanting to shake her hand. GLORIA Thank you.. Thanks. Thank you so much... The producer GEORGE bustles over, takes her in his arms. They luvvie kiss. Peter notes he squeezes Gloria’s waist tighter than is appropriate.. GEORGE Superlatives are redundant darling. GLORIA Oh Georgie, you got me going all red. Gloria adept to a director’s praise. Enjoys it. GLORIA (CONT’D) Georgie.. this is my good friend Peter. (to Peter) Georgie produced this gig. George gives Peter the once over, doesn't shake his hand. GEORGE Yeah Hi. (back to Gloria) There’s an exquisite brasserie in Soho. We could stay up, wait for the rave reviews? GLORIA Oh I'd love to..  33.",
      "characters": [],
      "action_text": "GEORGE Great! GLORIA Peter can come too right? GEORGE Er.. Just then a PR PERSON intervenes. PR PERSON Gloria we're ready for the photocall out front.. Gloria heads off with Peter. GLORIA Gimmee a minute. They leave George stranded, Peter gives him a cheeky wink as he passes; they meander through the crowd. PETER (in Gloria's ear) George wants to fuck you.. GLORIA Darling, everyone here wants to fuck me! They laugh like lovers do. OMITTED 35-36   35-36   *  INT. GLORIA’S PRIMROSE ROOMS/BEDROOM - LATER - NIGHT 36A   36A   *  Peter and Gloria GETTING IT ON.. SUDDENLY Peter,   *  stops ,   looks Gloria deep in the eye.   *  PETER   *  I got a question.   *  GLORIA   *  Shoot.   *  It’s a funny time to ask one and they both know it.   *  PETER So apparently you're 'the girl   *  who can't say no' right?  34.  CONTINUED: 34   34 GLORIA Apparently yeah..   *  PETER But am I right in thinking the   *  girl who can’t say no is now   *  saying a big ‘yes’ to Peter   *  Turner?   *  They smile like naughty teenagers. GLORIA YESyesyesyesyesyesyeyesYES! CUT TO - MASSIVE PRIMROSE HILL WIDE as they maul each other with lust. INT. PRIMROSE HILL/GLORIA’S BEDROOM - MORNING 37   37  Peter’s eyes meet the morning shards of light. Excited to be alive as he has his arms wrapped around Gloria, still seemingly asleep. PETER (whispers) Are you awake? GLORIA (pause) Nope. PETER I am. GLORIA I can tell. Peter kisses her neck - then tickles her around the ribs, flipping her over so that she’s underneath him. They lock eyes, then he starts brushing his lips on   *  her ear and her neck, dropping his head towards her chest.. Then to her RIGHT BREAST.. Peter’s POV: A SMALL SCAR. He gently runs his finger   *  across it. Gloria softly takes his hand; sends it   *  south. INT. LONDON FILM SCHOOL/SCREENING ROOM - DAY 38   38  Blinds drawn, 16mm Projector plays ‘HUMAN DESIRE’. A train steams through America’s Midwest...  35.  CONTINUED: 36A   36A ‘COLUMBIA PICTURES PRESENT GLENN FORD and.. GLORIA GR",
      "dialogue_count": 0,
      "word_count": 2716
    },
    {
      "scene_number": 7,
      "slugline": "INT. BELLA AND JOE'S HOUSE/HALLWAY - MOMENTS LATER 47   47  Peter peers upstairs in the direction of spare room   *  THEN reluctantly, moves to the phone, picks it up,   *  tatty address book open in hand, he dials.. PETER Operator. International please. (pause) United States, California... Peter gives a number and it CONNECTS. Then with a   *  sudden CHANGE OF HEART he slowly put the phone down.   *  THEN -- THE HALLWAY WALL BEHIND MIRACULOUSLY OPENS   *  AND WE---  TRANSITION TO:  INT. ‘LAX’ FOYER - FLASHBACK - DAY 48   48  PETER’S CLEAN POV TAKES US INTO A SHINY NEW AMERICAN   *  WORLD.. The foyer doors slide open revealing an EXCITED GLAMOUROUS GLORIA arriving to collect her LIVERPOOL MAN. She flings her arms in the air with joy at the   *  sight of her man.   *  Swing back round on Peter, carrying an old suitcase, over-dressed for the heat. They rush into each others arms and share a good old fashioned snog. EXT. SUNSET BOULEVARD, HOLLYWOOD - DAY 49   49  A glistening, sunshiny day. Gloria driving Peter in her VW BEETLE - roof down. Peter stripped to his vest, Ray-Bans on living the Hollywood dream. ‘Good Vibrations’ on the radio. PETER Everything feels so   sunshiny ! Like the air’s full of-- GLORIA -Hollywood horse-shit,   I know . Both chuckle. GLORIA (CONT’D) Actually, I wanna show you something.  47.",
      "characters": [],
      "action_text": "Gloria brakes and spins the car like a stunt driver so that they end up travelling the opposite way. EXT. HOLLYWOOD MANSION - DAY 50   50  Gloria and Peter peering through HUGE ENTRANCE GATES at an ART DECO MANSION of epic proportions. PETER Jeez!   *  GLORIA A-hu. PETER   *  A bit bigger than my Mum and   *  Dad’s house in Liverpool.   *  GLORIA   *  I looove your folks pad. It’s   *  my favourite house in the   *  world!   *  Peter smiles with pride - Gloria means it too!   *  PETER What’s it like, living in a   *  place like this?   *  GLORIA Fun.. for a while.   *  (pointing) Bogey and Betty lived right   *  over there.   *  PETER   *  Next door??   *  GLORIA   *  Ahu..   *  PETER Did you see a lot of them? GLORIA We were friendly at first.. but   *  then Cy, my husband, and Bogey   *  had some beef about Bogey’s dogs barking at night. They ended up threatening each other over the fence with shotguns. (pause) I loved Humphrey..   *  48.  CONTINUED: 49   49 He gave me the best acting   *  advice once... (Bogey accent) “Just keep it in the shadows   *  Gloria, let the camera come to you.” (pause) Ain’t that the best? (pause) A few times Bogey would call me up... late... Gloria trails off thinking. She CLUCKS. GLORIA (CONT’D) But that Betty Bacall... (clucks)   *  she always looks so damned good . I couldn’t compete with that. Peter glances at Gloria as she stares into her past.   *  GLORIA (CONT’D) (snaps out of it)   *  Come on... I don’t want my ex- husband catching me peeping into my past. PETER What?? Y’mean he still lives here!? GLORIA Course he does. Why wouldn’t   *  he? Gloria quickly backs off to the car, Peter follows casting a glance back. Gloria - one big jigsaw he’s constantly trying to piece together. EXT. PACIFIC COAST HIGHWAY - DAY - LATER 51   51  The VW BEETLE cruising past Malibu Beach and its luxurious, silly-money beach houses. INT. VW BEETLE - MOMENTS LATER 52   52  The car parked up. Peter and Gloria stare out...  49.  CONTINUED: 50   50  GL",
      "dialogue_count": 0,
      "word_count": 2872
    },
    {
      "scene_number": 8,
      "slugline": "INT. BELLA AND JOE’S HOUSE/HALLWAY - LATER - DAY 62   62  Peter comes down stairs, puts his coat on... off to work. BELLA (V.O.) (from the kitchen) Peter.   *  PETER Yeah Ma. BELLA (V.O.) In here please.   *  Peter obeys his Mother. INT. BELLA AND JOE'S HOUSE/KITCHEN - LATER 63   63  Bella, Joe, Joe Snr sat at the table, they fix him with worried stares. Peter knows he’s being ambushed. PETER What’s up? BELLA We all know what’s up luv. With   *  Gloria..   *  (pause)   *  I’ve seen that look before.   *  PETER   *  What look?   *  BELLA   *  Your Uncle Tommy had it. Before   *  he passed away.   *  Peter knows she’s referring to the BIG ‘C’.   *  JOE SNR   *  She’s dying.   *  PETER   *  No she’s not.   *  JOE   *  What is it then?   *  PETER   *  It’s gas.   *  63.",
      "characters": [],
      "action_text": "BELLA   *  It’s not ‘gas’ luv.   *  JOE   *  Don’t take the piss here lad.   *  They stare at Peter.   *  PETER   *  What do you want me to say?   *  JOE SNR   *  You can start with the truth   *  Peter has a full internal convulsion - it’s an   *  impossible situation, loyalty to Gloria, but can’t   *  hide the truth from his family.   *  PETER   *  Oh for fu--   *  (blurts out)   *  It’s cancer, ok!   *  BELLA   *  I knew it..   *  PETER   *  Happy now?   *  Everyone takes this in. It’s no massive reveal - just   *  a very sad one.   *  JOE   *  What’s her family said? PETER (beat) She’s not told them. BELLA You need to tell her family. PETER She’s doesn’t want me to. I   *  promised her. And anyway Gloria   *  says she’s gonna get better.   *  She’s sure of it.   And I   *  believe her.   *  BELLA  Peter!   Someone needs to be told and needs to get over here quick! There might be unexpected things to deal with.  64.  CONTINUED: 63   63 PETER I’m just telling you what Gloria said that’s all! It’s suddenly charged. BELLA I can’t take this. PETER Ma, she’s not delirious. She   *  knows what she’s saying.   *  Bella begs to differ but doesn’t want to sound insensitive. BELLA That’s it. Cancel the flights. I’m not going to Australia! Not with Gloria upstairs the way she is. PETER Ma! BELLA She needs me here so that’s where I’m gonna be. Not in Australia. Not in bloody Manila. End of story. A visibly upset Bella storms out of the kitchen JOE You need to sort this lad!   *  PETER   *  Sort what?!   *  JOE SNR It’s not right Peter son.   *  PETER   *  It’s what she wants!   *  JOE   *  What about what Ma wants?!   *  JOE SNR   *  You need to let that girl’s   *  family know. PETER No I don’t Dad!  65.  CONTINUED: (2) 63   63 Peter gets up; fixes his brother and father. PETER (CONT’D) And neither will you.   *  Peter heads out: slams the front door on his way out. EXT. LIVERPOOL PLAYHOUSE THEATRE - LATER - DAY 64   64   *  A grand old dame of a theatre in a grand old dame",
      "dialogue_count": 0,
      "word_count": 1022
    },
    {
      "scene_number": 9,
      "slugline": "EXT. LIVERPOOL STREETS/INT. TAXI - LATER - NIGHT 69   69  A TAXI taking Peter home. He looks out on dark, wet Liverpudlian streets. COMING DOWN RAPIDLY. INT. BELLA'S GUEST ROOM - AT THE SAME TIME - NIGHT 70   70  Gloria, depressed in bed. Tries an APRICOT KERNEL, spits it out. Gets out of bed, sits at the DRESSER, studies HER THINGS, strokes the PENDANT AROUND her   *  neck; flips it open. The tune drifts out... soft, plinky piano. We vaguely recognise it.. Gloria spins on her chair; launches into ‘Ace in the Hole’ from ‘The Naked Alibi’. GLORIA (softly singing)  “There’s con men and there’s boosters, Card sharks and crapshooters, Wearing ties and fancy collars...”  She stands, following the moves like . GLORIA (CONT’D)  “But where do they get their dollars? They’ve all got an ace down in the Hole..”  THE TEMPO EXPLODES; jazz trumpet takes over. Pan off, lose Gloria in the window:  Reflection shot: MARIANNA in ‘NAKED ALIBI’   - wearing a satin cocktail dress with spaghetti straps. She shimmies her way through the ELLA FITZGERALD TRACK. MARIANNA  “Fact is their name would be mud, Like a chump playing stud, If they lost that old ace in the hole!!!”  Gloria, back in her nightdress stood at the window - slowly shimmying. Looking down onto the street.. IN THE SHADOWS. POV: Peter’s TAXI pulls up.  69.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 227
    },
    {
      "scene_number": 10,
      "slugline": "INT. TAXI/EXT. BELLA AND JOE’S HOUSE - AT THE SAME 71   71  TIME - NIGHT Peter studies the house.. in particular THE SPARE ROOM. POV: the house in darkness PETER (to taxi driver) Mate, changed me mind, take us back to town will you? Belgravia Casino. TAXI DRIVER (studies him) Course mate, money up front... Peter nods, digs in his pockets INT. BELLA’S GUEST ROOM/EXT. STREET - AT THE SAME 72   72  TIME - NIGHT GLORIA’S POV: the internal cab-light showing Peter hand cash up front. BUT he doesn’t open the door. The TAXI then does a three point turn; drives away. INT. BELGRAVIA CASINO - NIGHT - LATER 73   73  FOLLOW Peter into a late night casino FULL of late   *  night people. Looks relieved as he wanders past the   *  ‘gamers’ gaming - he reaches the bar. Orders a DOUBLE   *  WHISKEY.   *  EILEEN (O.S.)  Peter!?  Reveal EILEEN (31), Peter’s COUSIN in her BLACK CROUPIER DRESS. Peter squeezes her tight. PETER Soz Eileen, I know you’re working but I need a   big drink .   *  EILEEN   *  Aunt Bella’s told me Ma.. Gloria’s back at yours? In the   *  spare room?? (pause) What’s going on? PETER HA! Good question!   *  70.",
      "characters": [],
      "action_text": "Eileen sees her cousin is acting   strange.   *  EILEEN (takes his face) You OK Pete? PETER Right now? I’m great!   *  Peter shakes his head slowly in despair. Eileen hugs   *  him -   she knows him   - kisses him.   *  EILEEN   *  Half an hour then I’m   *  finished..   *  PETER   *  Perfect .   *  EILEEN   *  Debbie!   *  DEBBIE, the barmaid, saunters back over.   *  EILEEN (CONT’D)   *  Peter, my cousin... Whatever   *  he’s ‘avin, put it on the   *  ‘special bill’.   *  DEBBIE nods.. Eileen squeezes his arm, sets off to   *  the tables. Debbie brings Peter a double whiskey -   *  necks it one... he winks at Debbie; she re-fills.   *  INT. BELGRAVIA CLUB - NIGHT - MOMENTS LATER 74   74   *  Peter and Eileen in a quiet corner. Peter MORE than a   *  few scotches in... the high replaced by an inebriated   *  introspection.   *  PETER I’ve got me Ma’ and Da’ and our   *  Joe looking at me asking   what the fuck in’ell is going on up   *  there??   *  (pause) And I don’t know ‘Ei’. It   *  really feels that way. I get a   *  call from Gloria out of the   *  blue and BAM! She’s upstairs   *  looking soo.. Sick.   *  EILEEN   *  D’you know what’s up with her?   *  71.  CONTINUED: 73   73 Peter KNEW this question was coming. He downs his   *  whiskey - and lets it burn.   *  PETER   *  Stomach cancer.   *  (pause)   *  I rang the doctor who treated   *  her in Lancaster. He said...   *  Peter can’t quite believe he’s about to say this.   *  PETER (CONT’D)   *  And he said she’s gonna die   *  this time... soon.   *  EILEEN   *  What??   *  PETER   *  Two weeks, maybe three.   *  EILEEN   *  (devastated)   *  You’re fuckin’ kiddin’ me..   *  They both sit in silence a moment.   *  EILEEN (CONT’D)   *  Jesus...   *  (pause)   *  She’s had it before then..   *  PETER   *  (nods)   *  There’s a scar under here..   *  (he touches his breast)   *  Only tiny.. I never thought   *  much of it. But now... Thinking   *  back... fuckin’ stupid   *  bastard..   *  Peter thinking ba",
      "dialogue_count": 0,
      "word_count": 3750
    },
    {
      "scene_number": 11,
      "slugline": "INT. GLORIA’S MANHATTAN APARTMENT - LATER - DAY 74M   74M   *  Gloria finally arrives home. Peter is smoking   *  nervously on the balcony.. she casts a sad glance at   *  him... He flicks the cig away, moves in.   *  GLORIA   *  Hi.   *  PETER   *  How were the auditions?   *  GLORIA   *  (shrugs)   *  No-one knows nothing in this   *  biz... I’m gonna take a   *  shower..   *  She moves off to the bedroom..   *  PETER   *  (blurts out)   *  I called your agent, she said   *  you didn’t have any auditions.   *  Gloria turns back to face him.   *  GLORIA   *  Well then Peter, I guess I’m   *  busted..   *  Gloria holding his eye-line. No emotion.   *  PETER   *  Is it someone else?   *  GLORIA   *  Would you believe me if I said   *  no?   *  PETER   *  (pause)   *  No.   *  GLORIA   *  Then ‘no’.   *  PETER   *  What then?   *  Gloria can’t tell him.   *  89.",
      "characters": [],
      "action_text": "GLORIA   *  For god’s sake Peter I already   *  got four kids. I don’t need   *  five.   *  This stings him, his male pride, he beefs himself up.   *  PETER   *  I’m not a kid Gloria.   *  GLORIA   *  Stop acting like one then. I   *  was out OK. And now I’m back.   *  She walks into the Bedroom, Peter still angry follows   *  her.   *  PETER   *  I’ve been offered a job back in   *  England.   *  (pause)   *  A theatre job in ‘Liverpool’.   *  GLORIA   *  (fixes him)   *  Good for you.   *  PETER   *  Rehearsals start in three   *  months.   *  GLORIA   *  Have you taken it?   *  PETER   *  (beat)   *  Do you want me to take it?   *  GLORIA   *  You need me to make your mind   *  up for you now?   *  PETER   *  Things haven’t been right for a   *  few weeks now.   *  GLORIA   *  (dismissive)   *  You wanna leave me, fine, leave   *  me. I’m used to it.   *  PETER   *  Gloria, I don’t think--   *  90.  CONTINUED: 74M   74M GLORIA   *  -I got an idea! Go! Now! Right   *  fucking now!   *  GLORIA FLIPS; grabs his case from the top of the   *  wardrobe, flings it on the bed, PILES HIS CLOTHES IN.   *  PETER   *  Glo! Don’t be--   *  GLORIA   *  Go to hell Peter!   *  She launches the case into the hallway, slams the   *  bedroom door on him. Peter hears it lock - AND ON ONE   *  DOOR SLAMMING SHUT ON PETER’S FACE-   *  OMITTED 75   75   *  INT. BELLA AND JOE’S HOUSE - MOMENTS LATER 76   76  Another DOOR OPENS on a ROUGH Peter coming home   *  after his night on the lash with Eileen..   *  INT. BELLA AND JOE’S HOUSE/KITCHEN - MOMENTS LATER 77   77  Peter switches the light on. Finds JOE sat at the table, glaring at him. JOE Morning. PETER (guilty) Morning. JOE Been out then? PETER I met our Eileen for a drink. JOE Nice. Where? PETER The Casino.   *  JOE nods in approval. THEN SUDDENLY launches at PETER   *  pinning him up against the wall by his throat.  91. 74M   CONTINUED: (2)  74M JOE On the fuckin’ piss??! Leaving her upstairs for everyone else   *  to sort out? PET",
      "dialogue_count": 0,
      "word_count": 1365
    },
    {
      "scene_number": 12,
      "slugline": "INT. ST. VINCENT’S HOSPITAL - DAY 93   93  Gloria taking another MAMMOGRAM. She slips off her robe and steps up to the screening machine. WIDE AND LONELY of her bare back as X-rays are taken. INT. GLORIA’S MANHATTAN APARTMENT - LATER - DAY 94   94  Gloria finally arrives home. Peter is smoking nervously on the balcony..   *  GLORIA Hi. PETER How were the auditions? GLORIA (shrugs) No-one knows nothing in this biz... I’m gonna take a shower.. She moves off to the bedroom.. PETER (blurts out) I called your agent, she said you didn’t have any auditions. Gloria turns back to face him. GLORIA Well then Peter, I guess I’m   *  busted...   *  Gloria holding his eye-line. No emotion. PETER Is it someone else? GLORIA Would you believe me if I said no? PETER (pause) No. GLORIA Then ‘no’.  97.",
      "characters": [],
      "action_text": "PETER What then? Gloria can’t tell him. GLORIA For god’s sake Peter I already got four kids. I don’t need five. This stings him, his male pride, he beefs himself up. PETER I’m not a kid Gloria. GLORIA Stop acting like one then. I was out OK. And now I’m back. She walks into the Bedroom, Peter follows her.   *  PETER I’ve been offered a job back in England. (pause) A theatre job in ‘Liverpool’.   *  BEAT   *  GLORIA   *  Good for you. PETER Rehearsals start in three weeks. It’s a long run..   *  GLORIA Have you taken it? PETER   *  It’s a good job. And I spoke to   *  Mum and she said we could stay   *  in Liverpool, at her house--   *  GLORIA   *  --Take it. But I’m not coming.   *  BEAT   *  PETER   *  You really want me to take it?   *  (pause)   *  Without you?   *  *  98.  CONTINUED: 94   94 GLORIA What? Y’need me to make your   *  mind up for you now? PETER I’m just worried, things   *  haven’t been right for a few weeks now--   *  GLORIA You know what--   You wanna leave   *  me? Fine, leave me. People walk   *  out on me all the time honey.   *  PETER Glo, I don’t think--   *  GLORIA Hey, I got an idea!   *  (beat)   *  Go! Now! Right fucking now!   *  GLORIA FLIPS; grabs his case from the top of the wardrobe, flings it on the bed, PILES HIS CLOTHES IN. PETER You’re packing me up??   *  Peter laughs incredulously   *  PETER (CONT’D)   *  The suitcase? Come on!!   *  GLORIA   *  Yeah, it’s fucking ‘suitcase   *  time’ for you buster.   *  Glo keeps packing him up..   *  PETER   *  You’re nuts y’know that! This   *  is absolutely off it’s head!   *  She launches the case into the hallway.   *  GLORIA   *  Go to hell Peter!   *  She slams the bedroom door. Locks it from the inside.   *  PETER (O.C.)   *  You really want me to leave?   *  99.  CONTINUED: (2) 94   94 GLORIA Yeah, send me a postcard to   *  tell me you got home safe, OK? BEAT   *  PETER (O.C.) Can’t we at least talk? Glo...?   *  HE BANGS THE DOOR   *  Gloria back against the wall hyperventilating ",
      "dialogue_count": 0,
      "word_count": 1307
    },
    {
      "scene_number": 13,
      "slugline": "INT. BELLA’S GUEST ROOM - MORNING 100   100  Peter finds Bella fixing Gloria’s hair again at the dressing table. Mothering her. GLORIA (sees him) We’ve decided Bella can be my Mom too. Peter manages a smile. PETER Ma, can you help dress Gloria into something warm please. GLORIA Why? PETER We’re going out.   *  BELLA   *  Out? Out Where?   *  PETER   *  It’s a surprise..   *  BELLA   *  Don’t be daft, it’s cold out.   *  She needs to stay here where   *  it’s warm.   *  PETER   *  Come on Ma.. Just a couple of   *  hours.   *  BELLA   *  (thinks)   *  No. It’s a stupid idea.   *  PETER   *  Mum--   *  BELLA   *  -That’s final.   *  Peter searches for Gloria’s eyes. They connect.   *  Gloria senses FUN.   *  GLORIA   *  Bella..   *  104.",
      "characters": [],
      "action_text": "BELLA   *  Yes my luv..   *  GLORIA   *  I kinda like surprises..   *  BELLA   *  (beat)   *  Are you sure?   *  (pause)   *  Looks like rain out there.   *  GLORIA   *  (smiles at Peter)   *  Yeah.. Why not?   *  BELLA   *  (admits defeat)   *  I’ve got some spare thermals   *  somewhere..   *  Bella exits to sort. Peter smiling at Gloria.   *  EXT. LIVERPOOL PLAYHOUSE THEATRE - LATER 101   101  Peter helps a WRAPPED-UP GLORIA out of a taxi; they take in the impressive Victorian frontage.   *  GLORIA Oh my! Isn’t she a beauty!   *  They head in. INT. LIVERPOOL PLAYHOUSE THEATRE - MOMENTS LATER 102   102  BOTH ON THE STAGE looking out onto the EMPTY SEATS. Even this sends shivers down their spines.   *  PETER They’ve been treading these boards since 1886. GLORIA   *  Gee.. That’s some treading.   *  JUST THEN   *  OLD JACK wanders on with two chairs and a couple of   *  scripts. Plonks the chairs down facing each other, lays the scripts down - and wanders off.  105.  CONTINUED: 100   100 PETER Nice one Jack. Peter helps Gloria over to a chair. GLORIA What are you up to? PETER I thought we’d have some fun.. Peter sits her down, gives her a script. POV: ‘ROMEO AND JULIET’. GLORIA You gotta be kidding me?? PETER The Bard’s ‘the nuts’ huh.. (sits opposite) I thought we’d try it out. Page 58. Act 1 scene 5. You there? Peter means it. Gloria finds the page. GLORIA I’m there.. PETER Shall we? GLORIA Lets. PETER   *  You first.   *  JULIET/GLORIA   *  Good pilgrim, you do wrong your hand too much, Which mannerly devotion shows in this; For saints have hands that pilgrims' hands do touch, And palm to palm is holy palmers' kiss.  ROMEO/PETER  Have not saints lips, and holy palmers too?  JULIET/GLORIA  Ay, pilgrim, lips that they must use in prayer.  106.  CONTINUED: 102   102 ROMEO/PETER  O, then, dear saint, let lips do what hands do; They pray, grant thou, lest faith turn to despair.  For a moment Gloria struggles - the words stick in   *  her throat. Peter unsure what to d",
      "dialogue_count": 0,
      "word_count": 1359
    },
    {
      "scene_number": 14,
      "slugline": "INT. BELLA'S GUEST ROOM - LATER (MONTAGE) 109   109  Peter watches on helpless as Gloria’s deteriorates: Peter moistening her cracked lips; Gloria muttering old lines of dialogue; restlessness; crying in her sleep; her breathing now the dreaded ‘DEATH RATTLE’. EXT. BELLA AND JOE'S HOUSE - LATER 110   110  A BLACK CAB arrives for it’s 4AM pick-up. INT. BELLA AND JOE'S HOUSE/BACK ROOM - MOMENTS LATER 111   111  Peter looking at Gloria - sat in exactly the same position. Has been all night. A knock on the door. Bella comes in. BELLA Taxi’s here. Peter doesn’t respond. BELLA (CONT’D) Peter? PETER I heard you Ma. BELLA I’m going to wake Tim. Bella disappears. Peter on a motionless Gloria. PETER Gloria. No answer. PETER (CONT’D) Gloria... time to go. Gloria’s eyes flick open; confusion then she recognises Peter and calms. The overhead light goes on. Bella, Tim, Joe and Joe Snr busy themselves. Tim and Peter help her upright. TIM   *  Mom I’m going to get you back home. But you have to help me by giving one of your greatest ever performances OK? Is that a deal?  112.",
      "characters": [],
      "action_text": "Gloria nods. PETER We can’t send her out like this! She needs make-up. A flurry of energy as Peter applies make-up, brushes her hair, dresses her in her favourite clean cream silk pyjamas, wraps her in a head scarf, plants thick woolen socks fitted on her ‘fat feet’. A white fox fur placed around her shoulders. He loads her dark sun-glasses on last. Tim and Joe get Gloria on her feet, she takes a step then collapses. PETER (CONT’D) We need to carry her down.   *  INT. BELLA AND JOE'S HOUSE/STAIRS/HALLWAY - MOMENTS 112   112  LATER Gloria perched on a wooden chair, carried down the stairs by Peter, Tim and Joe. Like removal men shifting a heavy set of drawers. They manage to get her to the bottom. Joe Snr stops the procession - gives Gloria a kiss.. her eyes thank him. THEN BELLA STEPS FORWARD leans in - embraces Gloria. BELLA May the Lord protect you Gloria Grahame. GLORIA Don’t forget.. BELLA What my luv? GLORIA A son needs his Mom... Billy   *  needs you. Bella grips her tight, Gloria can’t see her tears.   *  113.  CONTINUED: 111   111 EXT. BELLA AND JOE’S HOUSE - MOMENTS LATER 113   113  Gloria loaded into the cab. Peter fixes her seat   *  belt; bends in, kisses her on the lips... trying not   *  to cry. GLORIA Peter.. how do I look? Peter laughs through his cry. PETER Beautiful.   *  (pause) Always beautiful Gloria.   *  Gloria manages her SIGNATURE ‘CLUCK’. THEY KISS AS   *  PASSIONATELY AS POSSIBLE... PETER (CONT’D) Call me when you land.. I’ll be   *  awake. Tim gets in the cab. Peter summons the strength.. and   *  tears himself away from her arms. PETER (CONT’D) I’ll be waiting! Right here! OK??  GLORIA   *  (pause)   *  In Liverpoooool.  They somehow share a smile.   *  THEN   *  HE HAS TO CLOSE THE DOOR.   *  CUT TO - the Taxi sets off. It disappears......   *  PETER   *  hoping it’ll come back.. but it doesn’t.   *  FINALLY   *  JOE (O.C.)   *  Eh, knob-head..   *  Peter snaps to reality. Reveal Joe at the gate. A   *  MOMENT... then Joe walks into the",
      "dialogue_count": 0,
      "word_count": 999
    }
  ]
}