{
  "slug": "first-they-killed-my-father-2017",
  "title": "first they killed my father",
  "genre": "drama",
  "format": "film",
  "scenes_count": 25,
  "characters_count": 0,
  "characters": [],
  "total_words": 23322,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. PHNOM PENH APARTMENT BALCONY - DAY  April 1975 We are inside a POV. Walking towards a balcony. We pass a TV where news about the Vietnam war coming to an end is playing. We see a reflection in the television. We see our reflection. A little girl. LOUNG. The news then shows the evacuation of the American embassy in Phnom Penh Cambodia.   A Helicopter takes off from the embassy. The little girl turns and walks toward a view not dissimilar to the one near the American embassy on the news. Little caramel colored legs and feet on a balcony. The edge of a skirt in the wind identifies the child as a little girl. She begins to climb to the top of the railing. Her little hands and feet. The sound of a helicopter coming towards her. Finally she reaches the top. She watches as a helicopter almost identical to the one on the television flies low over her head.   This brave free spirited little girl is LOUNG. At five she stands looking out over city from the third floor. Her POV of her feet. Toes wiggling. The city below. The streets are mostly empty except for a few street vendors. Some shops are closed, some shops are open, there are sand bags in front of some houses. A few people ride in Cyclos. A few on motorcycles. Not much movement. Loung watches the people. (Their clothing and style help us to know it’s 1975.)  EXT. PHNOM PHEN STREETS  Loung continues to watch. Military police officers walk the streets. The front of some shops sandbags covering the glass entrances making them less than welcoming. Loung notices FOUR YOUNG MEN (peasant revolutionaries) sit along a wall staring angrily at well to do couples shopping in the market. Loung doesn’t understand the look on their faces but it makes her uncomfortable.  OMITTED  A billboard for a movie poster across the street catches her eye. 1.",
      "characters": [],
      "action_text": "MA (O.S.) Loung. Come down. Loung looks to her mother. MA is admired in Cambodia for her height, slender build and light skin. She is a very beautiful, very elegant woman of Chinese decent. Ma has GEAK, Loung’s three year old sister, in her arms. Luong jumps down and goes to her. Cambodian News Years has just past. Red decorations still on the wall. Happy New Years (in french) hangs on the wall. Ma puts Geak down and the girls play or share a fruit plate Ma has put out. Loung watches as Geak’s fruit drips all over her dress. (This can be anything from toys to fruit. The point is for the child to notice sweet things before the war and for the audience to get used to a child’s view of the world)  OMITTED INT. PHNOM PENH APARTMENT - LATE DAY  PA and a COLLEAGUE of his enter the room. Loung jumps into his arms. Pa is loved for his generous heart. He reminds Loung of a teddy bear. His eyes are warm and brown and shaped like the moon. Loung plays with the four stripes on his uniform. Pa greets her and asks about her day. Pa’s Colleague seems concerned but remains professional. They speak in french (no translation as Loung can’t understand as he intends). COLLEAGUE Les Américains nous abandonnent. Ils sont déjà tous partis, ambassadeur, attaché militaire… COLLEAGUE The Americans have abandoned us.   They have all already left, the ambassador and the military attache... PA C'est là notre grande erreur d'avoir cru en eux. PA. It was a huge error to believe in them. 2. COLLEAGUE Qui aurait cru qu'ils abandonnent un peuple qui se bat pour sa liberté ? Les Khmers rouges sont déjà à Takmao et à l'ouest ils sont en passe de contrôler l'aéroport de Pochentong. Nos forces ne tiendront pas 48 heures de plus, il faudrait négocier maintenant. COLLEAGUE. Who would of guessed they would have abandoned the people fighting for freedom. The Khmer Rouge are already at Takmao and they have passed the west, controlling Pochentong airport.   Our forces cannot hold for more than 48 hours, we ha",
      "dialogue_count": 0,
      "word_count": 2112
    },
    {
      "scene_number": 2,
      "slugline": "I/E. TRUCK - DAY  The traffic is moving very slowly. Loung looks out. Their truck inches on in the streets, allowing them a safe view of the scene.  EXT. PHNOM PENH STREETS - DAY  Families on the move. Chaos. The KR soldiers are everywhere. There are so many of them around, giving orders into their bullhorns cradling rifles in their arms. Loung notices the other children. The fear on their faces. Small mountains of guns fill the sidewalk as government soldiers turn over their weapons to the men in black. The soldiers are then put into a truck and driven off. Loung buries her face into Keav's chest, her arms tight around her waist. Chou sits silently on the other side of Keav, her eyes shut. Beside them, Khouy and Meng sit stone- faced, watching the exodus. (FACT- TWO MILLION PEOPLE EVACUATED THE CITY WITHIN 72 HOURS)  I/E. TRUCK - DAY  Later - Loung burrows under her scarf to hide from the sun. Her eye lids struggle to stay open. Her POV of her hair whiping about her face. The sun shining on it. Keav wraps the end of Loungs scarf over her mouth an nostrils to keep the dust out. KEAV Don’t look over the truck. Keep your head down. Loung pretends to follow her sisters orders but peeks over the edge. Loung sees a doctor assisting a pregnant woman out of the hospital. A KR soldier telling the doctor to evacuate people more quickly. The doctor begs him. He moves him aside and guides staff and patients out with his rifle. She sees a hospital evacuated. Some people being pushed in carts or hospital beds by their relatives. Soldiers in black knocking on doors with their gun buts and evacuating people from their homes. 8.",
      "characters": [],
      "action_text": "OMITTED EXT. PHNOM PENH   - DAY  High wide shot of the chaos of the city. The truck slowly makes it’s way through the crowded streets.  I/E. TRUCK - DAY  As they move further from the city, the high rise apartments disappear and thatched-roofed huts take their place. The paved boulevard gives way to dusty roads. Tall elephant grass and prickly brown bushes have replaced the tall trees. As far as Loung can see, there are people marching in the roads while huts stand empty and rice field are left unattended. (See some areas affected by bombing - possibly one or two plate shots)  EXT. ROADSIDE - MAGIC HOUR  The sun is setting. The masses silhouetted as they continue along the road.  EXT. ROADSIDE - NIGHT  Hours later - the truck pulls over. The fields are lit up with small fires illuminating the faces of the women squatting near them, preparing meals. Loung looks around. In the darkness she can still make out thousands of people milling around, or walking to unknown destinations. Others, like them have stopped to rest for the night along the roadside. Later - Ma and Keav prepare the meal from the food Ma had packed. Chou is brushing Geak’s hair, being careful not to pull it. They squat in the darkness eating their food. (discuss Ma trading jewels for items or food)  OMITTED  9.",
      "dialogue_count": 0,
      "word_count": 526
    },
    {
      "scene_number": 3,
      "slugline": "EXT. ROADSIDE - NIGHT  Loung is tucked in by Ma in the back of the truck. While Ma Loung, Chou and Geak sleep in the bed of the truck, the older kids sleep on the ground with Pa. It’s a warm breezy night, the kind that requires no blankets. Loung can’t sleep. She looks up at the vastness of the sky. The dark sky is full of shining bright stars. Some blink at her. She winks back and closes her eyes.  EXT. ROADSIDE - MORNING  Loung opens her eyes to find her family is already packing up. They look tired with their hair sticking out in all directions. Someone is yelling. Loung looks around. A group of Khmer Rouge soldiers are yelling at everyone to keep moving.   Loung stares at their guns. Meng helps her up and gives her comfort. The KR soldier signals for Pa to move away from the truck. Pa steps out. ROAD BLOCK KR You comrade!   The Angkar needs your truck. You no longer will need it. Loung looks to Pa for his response.   He simply lowers his eyes and nods. PA (softly to his family) Everyone grab what you can carry. Loung watches as her siblings begin to pack. KHMER ROUGE SOLDIER ROADSIDE Comrade!   Angkar needs your watch! PA Certainly. Loung watches as Pa’s shoulders bend forward in submission. He takes the watch off his wrist. Pa does not look the soldier in the eyes as he hands over the watch. Loung watches as a YOUNG KR walks up to Meng and Khouy.   He smiles at them.   A strange smile as he takes their watches. He gives Keav a look. 10.",
      "characters": [],
      "action_text": "The soldiers look at Pa’s watch with suspicion. KHMER ROUGE SOLDIER ROADSIDE This is very nice. Who are you to have such a nice watch? PA It was a gift from my boss. KHMER ROUGE SOLDIER ROADSIDE Tu travailles pour le gouvernment? KHMER ROUGE SOLDIER ROADSIDE. You work for the government? He walks towards Pa with the barrel of the gun pointing at his mid section.   Loung stares at the gun. It is right at her eye level.   She can hardly breathe.   He speaks the phrase again and watches Pa’s reaction. After a very tense moment, Pa seems to pass the test and the family is suddenly moved on. As they walk on Loung notices some men with long hair who seem to have been selected and are being held.   Ma also notices.  OMITTED  Content from Scene 42 and 43 merged into Scene 45. Content from Scene 44 merged into Scene 41. 10A.",
      "dialogue_count": 0,
      "word_count": 430
    },
    {
      "scene_number": 4,
      "slugline": "EXT. ROAD - DAY  The sun is hot on Loung’s back. It burns through her black hair.   She looks at Chou and sees beads of sweat collect along her hair line and upper lip. Everywhere they go people are walking in all directions carrying their belongings.   Soldiers with guns move them along. They walk from the break of day until the dark of the evening. Loung Looks at her fingers and holds up one finger then two.  EXT. ROADSIDE - EVENING  Ma and Pa guides the children to an area roadside where they sit in silence and eat the dried fish they had packed. Ma has a small pot of sugar (OR BUYS IT FROM A FAMILY) They all have a taste of it. Loung rolls it in her fingers and licks every last bit. Later - Ma is cutting off Khouy’s long hair. 11.",
      "characters": [],
      "action_text": "Loung sees her father walking off on his own. She follows him with her eyes. He finds a secret place in the shade, behind a tree, and goes to his knees. Loung moves closer. She sees he is digging a hole. A moment later he pulls his ID cards and his work ties and buries them. She doesn’t understand and moves quickly back so he doesn’t see her. Gone is the air of mystery and excitement; now Luong is simply afraid.  OMITTED EXT. ROAD - MORNING  Along the road, the bombed buildings, the scars of war. It’s the third day on the road. Loung walks with a little more bounce in her step. She looks at her fingers and holds up two then three. She makes her way up to Pa. LOUNG Pa, the soldiers said we can return home after three days. Loung tugs at Pa’s trousers. PA No, Loung. LOUNG But it’s the third day. PA (sadly) We have to keep walking. LOUNG Pa, I’m hungry and my feet hurt. Loung stops walking. She stands still on the road and lets go of the rice pot to wipe the dirt and tears from her cheeks. LOUNG (CONT’D) Let’s go home. I just want to go home. 12. The red dust from the road and the sweat on her little body have mixed to create a layer of mud on her skin, making it dry and itchy. Pa walks over to Keav and takes a ball of sticky rice out of the pot she is carrying. He walks back to Loung and hands her the food. Her eyes look down at the ground in shame but she takes the food anyway. Silently, he strokes her hair while she eats the rice between the chocking sobs. Pa bends down and looks Loung in the eyes. PA We cannot go home tonight. LOUNG But they said three days. PA We have to keep walking. Reluctantly, Loung does what Pa tells her. Everybody has to carry something, so she pick the smallest item in the pile, the rice pot. As she walks, the pot becomes heavier and heavier in her hands as the sun climbs higher and higher in the sky. The metal handle digs and burns the palms of her hands. Sometimes she carries it with two hands in front of her, other times she switches the",
      "dialogue_count": 0,
      "word_count": 1613
    },
    {
      "scene_number": 5,
      "slugline": "EXT. ROAD - DAY  Passing the checkpoint safely, they walk on. A few miles down the road the sound of gunshots ring out in the distance behind Loung. She watches as a flock of black birds explode into the sky.  EXT. ROAD - LATE DAY  Later - As she walks, Loung watches as the sun goes to sleep behind the mountains and the world becomes a place of shadows and shapes once again. Sees a body in the field. He wears a uniform like Pa’s.  EXT. ROADSIDE - DUSK (ADJUST DEPENDING LOTUS FLOWERS)  In the mass of people, Pa finds them a spot of unoccupied grass near the side of the road. Loung and Chou walk around and find a pond full of lotus flowers. Kim finds a small area full of fish. The children, as children do, explore the area. Later - Ma puts Geak down next to Loung and tells her to keep an eye on her. Sitting next to her, Loung is struck by how Geak looks. Breathing quietly, she fights to keep her eyelids open, but in the end she loses and falls to sleep. Loung puts her arm around her sister in a protective way. She lies down on a small bundle of clothes. Quickly, Loung also falls asleep. LOUNG DREAMS  EXT. STREET  In her dream, fireworks crackle and boom noisily, she rejoices in the New Year celebration. Everything is red. Chinese firecrackers explode. Smoke rises. Confetti paper falls onto Loung’s face as she runs through the bits of paper and white smoke. LOUNG’S DREAM ENDS  EXT. ROADSIDE - MORNING  Fireworks from the dream turn into gunshots in the distance. Loung wakes up the next morning to the voices of her brothers and father whispering to each other about what went on in the night. She can’t hear but they look concerned. 17.",
      "characters": [],
      "action_text": "Keav takes her hand, grabs her things and leads her on.  EXT. ROAD - MORNING  Loung’s POV - Pa carrying Geak and reassuring Kim. People see along the road the scars of war. Loung feels Keav's hand pull at her, and her feet automatically move in her sisters direction. With Loung’s hand in hers, they catch up with the rest of the family and continue their fourth day of marching.  EXT. ROAD - DAY  On their walk, the soldiers are everywhere, prodding them along. They point and give directions with their guns. In the scorching April heat, Loung watches as many older people become ill from heatstroke and dehydration, although they dare not rest. When someone falls ill, the family throws out his belongings, puts the sick person on someone's back and march on. Loung notices a few lifeless bodies laid in a row on the side of the road. She focuses on their feet. The road ahead of them shimmers in the heat, and the dust swells are everywhere, burning Loung’s eyes. In the distance, her eyes focus on a lone man with a wagon pulled by two yellow skinny cows. It is strange that he is traveling against the flow of traffic. All of a sudden, she is startled by Ma's scream. Between loud, halting sobs Ma manages to say- MA It’s you Uncle Leang! With their hands in the air and bodies jumping up and down, they wave excitedly to their uncle. UNCLE LEANG waves one hand back and moves his ox cart in their direction. He comes to a stop a few feet from them, and all at once they rush toward him. He takes Ma into his arms with Pa standing quietly beside them. Uncle Leang hands Ma a package from the cart, she opens the package of food, sweet rice, fish and bamboo sticks. UNCLE LEANG I’ve been looking for you since I heard. 18. Standing next to Uncle Leang, Loung has to tilt her head back as far as she can to see his face because he is so tall. All she can see is the shape of his thin lips and wide, black nostrils that flare once every few seconds as he talks to Ma. At almost six feet tall, seco",
      "dialogue_count": 0,
      "word_count": 924
    },
    {
      "scene_number": 6,
      "slugline": "EXT. KRANG TRUOP - EARLY MORNING  Loung slowly opens her eyes.   Five days after leaving their home in Phnom Penh, the family arrives at Krang Truop.   A small dusty village surrounded by rice fields as far as the eye can see.  INT. UNCLE LEANG’S HUT - MORNING  Loung enters Uncle Leang’s hut. Uncle Leang and his wife have six children, so with the nine new people it makes seventeen under one roof. There are objects that show Uncle Leang had been a middle class farmer before the Khmer Rouge took over. Loung climbs into Pa’s arms. LOUNG The village is so poor. PA (strong) So are we. And from now on if anyone asks, we say we are workers. We can not go back to the city. You must stop thinking we can go back. Pa has never spoken to her this way. It finally sinks in. She trembles with fear. He holds her in his arms as her eyes water and her lips tremble.  EXT./INT. UNCLE LEANG’S HUT - DAY  Loung’s POV of the rice fields.   She removes her clothes and hands them to Chou who is already washed and in a sarong. Loung washes herself outside.   There is a big round container that looks like a three-foot-tall clay flowerpot.   Then she reaches into the container and takes a bowl full of water and pours it over herself. She becomes shy when she sees her little cousins watching her.  EXT. UNCLE LEANG’S HUT - DAY  The family clothes hang to dry.   Pa helps Uncle repair a fish trap. He is clumsy because he does not know how to do it properly. They share a hot tea and smoke tobacco. A NEIGHBOR is with them. 20.",
      "characters": [],
      "action_text": "NEIGHBOR Is it true everyone has evacuated Phnom Phen? (Pa nods) Did the Americans bomb the city? PA Angkar asked us to leave. I heard no bombings. UNCLE LEANG Here, in the village, Americans have bombed for many years. Sometimes three days in a row. We had to harvest during the night. 20A. He pauses deep in thought. NEIGHBOR They destroyed my house. My cows. I now support the Khmer Rouge revolution.   We want a new society, without poor people, without rich people. We don’t need the capitalists. The land is ours. We are masters of earth and water.  Nobody answers. UNCLE LEANG If you stay here you must refer to the village chief. You are from the city. You must be careful. Angkar knows everything.  EXT. UNCLE LEANG’S HUT - DAY  Loung wanders away towards a group of kids having a beetle fight.   Geak is loving it.   Chou is not so sure. Kim and Meng and Khouy play around doing handstands, and teaching their cousins. Ma and Keave are with the other women.  INT. UNCLE LEANG’S HUT - NIGHT  Lying on wooden planks Loung watches Chou tossing and turning.   Ma sits on a mat nearby holding Geak, who sleeps quietly in her arms.   She looks around the room at her sleeping family.   Loung overhears a discussion underneath the floorboards.   She looks through the slats. AUNT KEANG We cannot keep them with us. We will be killed. UNCLE LEANG She is my sister. AUNT KEANG You know there is no consideration for family. They continue whispering but Loung can’t make out what they are saying.   She looks over at Ma, wondering if she has heard. 21.",
      "dialogue_count": 0,
      "word_count": 563
    },
    {
      "scene_number": 7,
      "slugline": "EXT. UNCLE LEANG’S HUT - EARLY MORNING  Loung watching Uncle Leang. Wondering if he will say anything.   Life on the farm starts before the sun rises.   The clothes are now dry on the line. Washing up. Breakfast. (Scraps to pigs? Feed for chickens?)  EXT. KRANG TRUOP - MORNING  Loung walks into the fields. Using the traps made last night, they catch fish. The buffalo’s are brought in to graze. Loung looks around she cannot shake the feeling someone is watching her. She looks around anxious.  OMITTED  Content from Scene 89 has been merged into Scene 77AA. 22.",
      "characters": [],
      "action_text": "OMITTED  Later- Loung watching her cousins and neighbors play. Loung walks past Pa who sits quietly outside by himself. She enters the hut but turns when she hears a cow bell. They both watch as the Village Chief approaches Uncle Leang. They both know what this means.  OMITTED INT./EXT. UNCLE LEANG’S HUT - EVENING  Loung watches everyone around her packing. Uncle Leang, his wife, AUNT KEANG, and all the cousins are up. Beside Loung, Chou rolls up her thin blanket, folds her clothes and puts them in her pillow case. Outside, Lee Cheun scoops ladles full of cooked rice and puts it in banana leaves. Keav pokes the crackling fire to cook the dried fish while Kim fills up the petrol container with water. Ma puts her hand to her mouth to signal to Loung to stay quiet. Loung pulls the cover over her and looks at her still blistered feet. She doesn’t want to walk anymore. She wants to stay. Pa pulls back the covers and gently pulls her from her bed. Biting back her tears she puts on her flip flops and walks toward Keav’s extended hand. Pa and Ma turn to Uncle Leang and thank him for letting them stay with him. Uncle Leang looks at her, face hanging, eyes blinking rapidly, and blesses Ma for a safe journey. The cousins stand outside the hut to see the family off. Their hands dangle lifelessly by their sides as they watch Pa lead his family away.  EXT. REST STOP - NIGHT  By the time the family arrives at the rendezvous area on the roadside, about thirty people have already gathered there. They squat and sit on the gravel road in four family groups. Many have almond-shaped eyes, thin noses, and light skin, which suggests they might also be of Chinese descent. Their fellow travelers do not acknowledge their presence, instead they stare passively at the road. Like the family, they carry with them light bundles of clothes and small packages of food. 23. Loung and family sit on the gravel road next to them but no words are exchanged. In the dark of night they all wait for the truc",
      "dialogue_count": 0,
      "word_count": 2311
    },
    {
      "scene_number": 8,
      "slugline": "EXT. RO LEAP - EARLY MORNING  The guards patrol. Pa and the boys are working on the house. Davi’s Father and brothers are working next door to build theirs.  OMITTED EXT. RO LEAP - MORNING  Over the megaphone we hear the mornings announcements and call to work. We see the rice fields begin to fill with rows of workers.  EXT. RO LEAP - MORNING  Loung and Chou are in line with the other girls marching to work. They pass Ma and Keav in the fields.  EXT. RO LEAP GARDEN - MORNING  Loung and Chou’s first day at work. They tend to the soil to prepare a garden. Loung looks out and sees Ma and Keav in the rice field. Kim is in a nearby garden with the other boys. Chlop patrol. Later - Loung’s back is hurting. She is not used to this kind   119D  of labour.   The Base Woman who spit at Pa upon arrival, walks over.   She looks at the girls and tells them they are lazy and need to work harder. The young girls try to hold back tears.  INT. RO LEAP HUT - DUSK  Pa finishing the roof.   Loung’s eyes grow heavy.   She falls asleep.  EXT. RO LEAP GARDEN - MORNING - PLANTING  We pan across a large area where we see hundreds working the fields. 32.",
      "characters": [],
      "action_text": "Loung and Chou work in the garden. They sweat under the hot sun.  OMITTED EXT. RO LEAP - DAY  Loung walks back to her hut and passes her parents and older siblings working in the rice fields.  EXT. RO LEAP HUT - NIGHT  That night, Loung sneaks out of the hut past the KR on patrol and follows Pa into a meeting at the town square.  EXT. TOWN SQUARE - NIGHT  Loung and some other children are tucked away off to the side of the meeting.   She watches as Ma and Pa join the others for the town meeting.   Pa looks tired. There are a couple men and women the KR have put aside. Loung wonders why and what they have done. RO LEAP KHMER ROUGE Every work site is a fiery battlefield. Let us be master of the water, master of nature. Work in the rice field without considering the skies, to grow three tons a hectare. If you have a revolutionary position, you can do anything Comrade. Cheyo revolutionary Angkar! Fists in the air. “Cheyo! Cheyp!”   The Base Girl is standing next to the KR.   She points at a man and says he should confess. The man VICTIM/INFORMANT (birthmark on his face)confesses for taking something small for his child who is sick. He is punished and tied to a tree near the children.  OMITTED  33. EXT. RO LEAP  Loung and Chou on their way to work.   They pass the man still tied to the tree.   Loung looks at the KR near him.   Wondering how one man could do that to another.  EXT. RO LEAP GARDEN - EARLY MORNING  Weeks have passed. (Transition possibly by coming down from the sun) The seeds have begun to sprout and the vines have grown. She smiles and tends to them. She puts her head down and continues to work. 33A. Loung notices the change of rice fields.  EXT. RO LEAP DINING HALL - EVENING  Social contact among the new people is almost nonexistent. Everyone keeps to themselves, fearing that if they share personal thoughts or feelings someone will report them to the Angkar. Loung and Chou sits in silence.   She looks at her food.   The rations are less. Loung notices the ",
      "dialogue_count": 0,
      "word_count": 1060
    },
    {
      "scene_number": 9,
      "slugline": "INT. RO LEAP HUT - MORNING  Everyone is up early.   Loung notices Khouy who seems upset. She notices Pa and Meng having a serious private talk. Ma packs Keav’s black pyjama pants and shirt in a scarf. Keav sits next to Ma with their hands touching.   Loung is trying to understand what is happening.  EXT. RO LEAP - DAY  Quietly Loung walks with her family to the town square where other teenagers and families have already gathered. Other teenagers have tears in their eyes as do their distraught parents.   Loung now understands. Meng musses Loung’s hair and gives her a smile. Loung watches as the Village Chief calls them out and the base people hand out tools and give them a plot number. RO LEAP KHMER ROUGE LEADER The revolution is not taking place in this village alone; it is taking place throughout all of Kampuchea. Angkar needs strong young men and women.   The Angkar knows what is best.   We must trust in Angkar. She watches as Khouy and Meng steal glances at Pa as they get in line and begin to move off. Keav and Ma wish they could embrace. They look into each others eyes. Both full of tears. In a matter of minutes, the chlops lead the children away while the families watch in quiet despair. Keav looks to Loung who tries to muster a smile, then she hugs Pa and walks away in her black shirt and pants that are frayed at the hem. Loung watches Keav as she follows the soldiers, with twenty other boys and girls, never looking back. Chou and Loung watch with tears in their eyes and watch until Keav’s figure is no longer in sight.  OMITTED  36.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 287
    },
    {
      "scene_number": 10,
      "slugline": "INT. RO LEAP HUT - NIGHT  Loung watches Chou sleeping. She looks over at the empty place where Meng, Khouy and Keav used to sleep. Tears fall from her big brown eyes. PA Angkar is right. Soon the country will be prosperous. Angkar will take care of them. Loung is confused, then hears footsteps. She looks through the slats to see two Chlops walking away. She looks to Pa. Silently they express the understanding.  EXT. RO LEAP - RIVER - DAY  END OF MONSOON #1 Loung, Chou and other girls walk in line to get water. Each balancing two water pails on a long flat piece of wood over their shoulders. They approach the water when, a stench attacks Loung's nose and she begins to cough. Coming around the path into a clearing, she knows what the smell is before she even spots the body. The corpse lies decomposing in the sun. She holds her breath and walk toward it. CHOU Let’s go Loung waves her hand at Chou and proceeds forward while she stays back. Pinching her nose, she approaches it. (Possibly face down but gun shots to make clear executed) Black hair sinks into the grass, becoming one with the dirt. The chest cavity is caved in beneath the black clothes, home to hundreds of the black-green flies feasting on the body. Loung covers her mouth to push down vomit, not daring to look anymore. Quickly, she turns and walks away, but the smell of death still clings to her clothes. CHOU (CONT’D) What are you doing? 37.",
      "characters": [],
      "action_text": "LOUNG Trying to loosen the body to float down stream. Loung removes her pails, and with her stick helps to push the body away. With the two of them beating on it, it bobs and sways even more. Finally they loosen the leg and the body floats a few feet down before getting stuck again near the bank. This time he is inches away from them. LOUNG (CONT’D) On three. After a concerted effort, the body finally floats down the river, his long hair spreading around. They wait a few minutes until they believe the body fluids have all floated past them before fetching the water.   They move up stream for a clean area.  EXT. RO LEAP DINING HALL - DAY  Rain falls. Loung and Chou line up with soup bowls in hand along with the other girls to receive their rations. The cooks used to serve them rice gruel, but now there are only enough grains in the pot to make soup. (the soup is now very clear) When it’s Loung’s turn to receive the food, she watches anxiously as the cook stirs the rice soup. Staring at the rice pot, she lets out a breath of hopelessness when she sees the lady take the ladle and stir the soup. Both hands tightly gripping her bowl, Loung takes her two ladle fulls and walks to a spot away from all the others. Loung sits quietly, savoring it spoonful by spoonful, drinking the broth first. What's left at the bottom of her bowl is approximately three spoonfuls of rice, and she has to make this last. She eats the rice slowly. Tears mix with the food in her mouth. Her heart falls to her stomach when all the eight grains are gone and she sees that the others are still eating theirs. She studies them. Everyone is thinner. They look like the walking dead. 38.",
      "dialogue_count": 0,
      "word_count": 576
    },
    {
      "scene_number": 11,
      "slugline": "INT. RO LEAP HUT - NIGHT  Loung can’t   sleep. She looks at Chou. How her face has changed. Loung hears movement. She looks over in the direction of her parents. She sees her father caressing her mother. She has never seen them in such an intimate way before. She feels she should look away but it warms her to see how Pa loves Ma. He kisses her neck. (Not sex. Just affection. All very subtle so nothing would be noticed by guards passing by.)  EXT. RO LEAP - DAY  Standing in the rows of ripe red bell peppers, tomatoes, and green cucumbers, the sun burns hot on Loung’s skin, drenching her clothes. In the next field over, Kim wipes his forehead and continues his work in silence. As her fingers pluck the green beans, Loung’s mouth waters. Feeling the fuzzy hair of the beans between her thumb and finger, she craves to put it in her mouth. Loung hears yelling. Chou is suddenly being questioned. She reveals a bean in her hands half eaten. She begs for forgiveness as tears roll down her face. Loung studies her sister. She has never seen her like this. Her heart breaks for her.  EXT. RO LEAP - DAY  On the way back from work, in line with the other girls, Loung reaches for Chou’s hand. She holds it for a moment sending her a silent message. Loung’s POV of Pa working.  EXT. RO LEAP WELL - MORNING  DRY SEASON #2 A distorted image of Loung. 39.",
      "characters": [],
      "action_text": "Loung is looking at her reflection in a pond. She has not seen herself since Phnom Penh. The blurred child stares back at her. She touches her face knowing how much it has changed. She is always so tired. Starvation has done terrible things to her body. Her body is thin all over, except for her stomach and her feet. She lifts up her shirt and counts every rib in her rib cage. Her stomach protrudes outward, bloated like a ball between her chest and hips. She looks at her feet. Calloused and dirty. Loung and Chou roam the area for beetles, and crickets. Loung catches a beetle and eats it. They pick up a handful of dirt each, sift it in their hands as the big pebbles rise. They take out the big pebbles and eat the rest of the dirt Loung tilts her face up to the sky, forcing herself to look directly into the sun. The brightness stings her eyes making her temporarily blind.  EXT. RO LEAP - LATE DAY  The blue sky. Loung’s POV. DRY SEASON Loung notices the leaves have shriveled and the trees brown. People transporting dead bodies along the principal road to the village to bury behind the village. They transport in a very old mat or braided bamboo. One or two people follow the body with a pickaxe. A child cries in front of his house. Thin people work here and there like zombies. Under the summer sun, the stench of death is so strong in the village, Loung covers her nose and mouth with her hands and breathe only the air that filters through her fingers. The neighbors are too weak to bury all the corpses. Some bodies of recently dead lay waiting to be taken away. A very skinny dog looks hungrily at the flesh.   The smell permeates the surrounding air. She watches as the bodies are collected. Loung has seen the ritual performed so many times that she now feels nothing. A KR walks by and gives her a stern look.   She stares back. 40.",
      "dialogue_count": 0,
      "word_count": 600
    },
    {
      "scene_number": 12,
      "slugline": "INT. RO LEAP HUT - NIGHT  Loung lies on her mat. She watches as Pa puts a few spoon fulls of uncooked rice in the secret rice bag. He puts the bag, inside a container, and hides it beneath a small pile of clothes so that the other villagers cannot see it. PA watches three Chlops passing by on the main road of the village before hiding the rice.  INT. RO LEAP HUT - NIGHT  LOUNG’S DREAM (KUBRICK STYLE- CENTERED AND COLORFUL) The shadow of a KR looking towards Loung like in the previous scene. Loung is sitting alone at a long table. The table is covered with all of her favorite food in the world. There is food everywhere as far as her eyes can see! Red and crispy roasted pig, brown and golden duck, steaming dumplings, plump fried shrimp, and all kinds of sweet cakes! Everything looks so real. She shoves everything into her mouth at once with both hands, licking her fingers deliciously. Yet the more she eats the hungrier she becomes. She eats with great anxiety and urgency, fearing the Khmer Rouge soldiers will come and take it all away from her. She is so greedy, she does not want to share the food with anyone. She sees shadows. She gorges and hides foods. LOUNG’S DREAM ENDS  INT. RO LEAP HUT - 2 AM  Loung lays awake. Her stomach pains with hunger. She slowly, quietly, gets up and goes over the others sleeping bodies to get to the container. With her heart pounding, she slowly lifts off the top. Her hand reaches in and takes out a handful of uncooked rice (or snails or crickets) and quickly shoves it into her hungry mouth before anyone wakes and makes her put it back. Afraid that the crunch of uncooked rice might wake the others, she softens the grains with saliva. When it’s soft enough, her teeth grinds the rice grains, producing a sweet taste that slowly down her throat. She wants more but stops herself. 41.",
      "characters": [],
      "action_text": "INT. RO LEAP HUT - 6 AM  KIM Pa, someone was in the container last night. Pa checks the container.   He considers-- PA Maybe some rats got into it. Pa wraps it up tight and moves it higher. Pa looks at Loung. Shame burns her hand like a hot iron. As if to rescue her, Geak wakes up and her cries of hunger interrupt the incident. The guilt weighs heavily on Loung.  EXT. RO LEAP HUT - 6:10 AM  Loung keeps to herself washing food bowls in a bucket in front of the hut. Geak walks up to Loung and tugs at her clothes. Loung gently pushes her away. Geak tries again. She wants Loung to pick her up. Loung moves away from Geak. Pa walks out of the hut on his way to work. Chou comes over to help Loung. Kim walks by and intentionally knocks against Loung as he passes on his way to work. She looks up and he gives her a look. He knows. Loung’s lips quiver with shame. Chou grabs her hand.  EXT. RO LEAP - EARLY MORNING  Loung and Chou walk in line with others towards the garden. 42.",
      "dialogue_count": 0,
      "word_count": 535
    },
    {
      "scene_number": 13,
      "slugline": "INT. RO LEAP HUT - NIGHT  That night, Loung stares at Ma as she boils water for tea. She remembers that Ma used to be so beautiful. Now red lips are purple and dry, her cheeks are sunken, there are deep shadows under her eyes, her porcelain white skin is brown and wrinkled from the sun. Loung looks into her tea.  EXT. RO LEAP - EARLY MORNING  A beautiful orange sun rises.  EXT. RO LEAP HUT - EARLY MORNING  DRY SEASON BEFORE MONSOON #2 Early morning as everyone gets ready to report for work. Loung and Chou return to the hut with the water buckets. Ma sits on the porch combing Geak’s hair and looking for lice. She washes her when the water arrives. Loung watches Pa head out to work. A GIRL arrives in the village. She shows her pass to a chlop. She speaks to some people and is guided towards the Loung’s family hut. Loung watches as she comes closer. She seems concerned. GIRL I’ve come with a message from Comrade Keav. The family gathers to listen.   Ma shifts Geak on her hip. 43.",
      "characters": [],
      "action_text": "GIRL (CONT’D) She has been sick.   You are permitted to visit.  OMITTED EXT. RO LEAP - MORNING  Chou is left home with Geak. Loung watches Ma put the slip in her pocket as she leads them toward the road.  INT. RUN DOWN HOSPITAL - DAY  Ma guides Loung into the (pagoda or school turned into a makeshift-) hospital. The sounds of suffering overwhelm her. The room is full of patients. Most alone. One young boy already dead. Loung is just tall enough to see over the beds. She notices coke bottles used as IV drips. Splatter of blood on the floor catches Loung’s attention. A nurse pushes past her. Across the room Loung recognizes Keav. Loung is almost too afraid to walk forward. When Loung and Ma appear they see there seems to be no flesh left on Keav's body. Keav's eyes are sunken deep into their sockets, and she can hardly open them to look at her. When she first sees Ma she does not recognize her. Keav wheezes and gasps for air just from trying to talk to her. Ma breaks down and weeps. Keav keeps asking for Pa. She is so weak she cannot raise her hand to wave the (CG) flies away from her face. She is so dirty. They didn't even clean up her mess up. They just let her lie there in her sickness and dirty sheets. Ma gets upset and tries to help clean her. Loung looks to her sister. The sight of her is terrifying.  EXT. RO LEAP GARDEN - DAY  Days later.   Clouds in the sky.   (Land is wet from 167-172, sometimes rain).   Loung and Chou work the land. 44. Loung sees the GIRL who came with a message about Keav.   She watches from a distance as she is led to Ma in the fields. Loung looks on as her mother notices the girl and braces herself for the news. We can tell from the body language that Keav has died.   With the KR watching neither Ma nor Loung or Chou can express their grief.  INT. RO LEAP HUT - NIGHT  The hut is silent. Grief hangs heavy. Ma quietly making tea. Pa sitting alone. (Possibly carving for Chou, Loung and Kim) Loung and Chou whisper before bed. LOUNG What happ",
      "dialogue_count": 0,
      "word_count": 694
    },
    {
      "scene_number": 14,
      "slugline": "EXT. RO LEAP - DAY  BEFORE DRY SEASON. Base children play.   Loung feels hate for them. 45A.",
      "characters": [],
      "action_text": "The air is hotter and drier now. Time passes slowly. Loung and Chou eat lunch huddled together. The food rations have reduced even more. The man with the Birthmark (who was tied to the tree) is speaking with a Chlop. Loung notices as they give Pa a look. Pa lowers his head. LOUNG I’m going to kill them one day. She looks back and sees Chou smiling to herself. LOUNG (CONT’D) You don’t think I can? I can. CHOU (simply) I don’t want you to. I don’t want anyone to kill (hurt) anyone. Chou looks sad.  INT. RO LEAP HUT - NIGHT  MA (panicked) How would they know? Lying on her back next to Chou and Kim, Loung pretends to be asleep. PA Someone probably denounced me. MA How is it possible? We hid our names. Everything. Loung rolls over to her side. Ma and Pa become quiet, waiting for her to go back to sleep. Staring at Kim's back, Loung forces herself to breathe regularly. Pa whispers something we can not hear. MA (CONT’D) (whispering) No. Please. They are too young. They cannot defend themselves. Pa takes a deep breath. PA Not now then, but soon. 46. Geak kicks and moans in her sleep. Ma picks her up and puts her down between Pa and herself. Loung rolls over once more, this time facing Chou's back. She spies Ma and Pa asleep facing each other on their sides with Geak in the middle, their hands touching above Geak's head.  EXT. RO LEAP HUT - LATE DAY  The next evening, while sitting with Kim outside on the steps of their hut (sweeping).   Loung looks out at the camp, and up to the sky.   When Loung focuses her eyes back on the earth, she sees two men in black walking towards her with their rifles casually hanging on their backs. 46A. KHMER ROUGE WITH RIFLE Is Comrade Nath here? KIM Yes comrade. Pa hears them and comes out of the hut, his body rigid as our family gathers around him. PA Comrades, what can I do for you? KHMER ROUGE WITH RIFLE We need your help to repair the bridge near Prey Svay. Come with us Comrade. PA Could you please wait a moment so that I can pack my thing",
      "dialogue_count": 0,
      "word_count": 993
    },
    {
      "scene_number": 15,
      "slugline": "EXT. FOREST - NIGHT  A dark hole in the ground. There are already many dead people in the mass grave, their bodies sprawled on top of each other. Their black pajama clothes are soaked with blood. A soldier leads a man to the edge of the hole, his arms tied behind his back. It’s Pa. The soldier pushes on Pa's shoulders, making him kneel. The soldier has blindfolded him. Pa prays silently. The soldier raises the ax above his head. Pa is killed.  INT. RO LEAP HUT - NIGHT  Tears fall from Loung’s eyes. She slides next Chou. Beside them, Kim holds on tight to Geak. Loung’s mind swirls with pain and anger. The pain spasm convulses as if it is eating away her linings. Turning on her side, she digs her hands into her stomach and squeezes it violently to make the physical pain stop. Then the sadness surrounds her. Dark and black it looms over her, pulling her deeper and deeper into it. HER EYES GROW COLD. She can still hear the faint noise of Ma's muffled cries outside, but now does not feel her pain. She is becoming numb.  INT. RO LEAP HUT - MORNING  Ma is up before anyone else the next morning. Her face is all puffy, her eyes are red and swollen shut. Loung watches as Ma folds Pa’s clothes and puts them and his few other belongings in a loving pile and tucks them away. She notices Kim. He helps Geak change. He is different somehow. As if he now knows he must be the man of the house. He straightens up as if making the decision. The loudspeakers announces. Loung watches Kim walk to work. 49.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 285
    },
    {
      "scene_number": 16,
      "slugline": "EXT. RO LEAP - EARLY MORNING  DRY SEASON Ma and the other women harvest the rice.  EXT. RO LEAP CORNFIELD - MORNING  Stalks of corn in the sunlight. Loung looks over at Kim who is nearby working with the other young boys. He looks at the men guarding the corn. He watches as they stand nearby enjoying cigarettes. One Chlop looks at Loung. She stares back defiantly. He only winks, making it worse.  INT. RO LEAP HUT - NIGHT  Loung watches- Kim won’t hear no. He is determined. He takes a krama and heads out the door. Chou and Loung don’t try to stop him. They watch as he goes. Ma looks afraid. She doesn’t move. Later- Kim is still not back. (Find a visual way to show passage of time.) Loung looks to Ma who is holding Geak for comfort. Chou sits in the corner of the room, staring out into her own world. Suddenly Kim climbs into the hut. He is smiling and carrying a bag of fresh corn. Loung rushes to help him carry it into the house. Seeing Kim, Ma puts Geak down so she can greet him. They stay very quiet so not to attract attention. Loung edges herself closer and closer to the bags of corn. Her nose inhales the aroma. Her eyes fixate on the yellow ears. MA (to herself) They have turned us into thieves. 50.",
      "characters": [],
      "action_text": "Loung hears this but can’t listen. Her stomach is too empty to feel anything but happy for the food.  EXT. RO LEAP   - NIGHT  (discuss how it is cooked) The clouds are moving furiously fast, blocking any moonbeams from touching the earth. Ma passes around the corn. Kim plays with Geak who seems a bit livelier. Later- Ma tells a story as she combs knots out of Geak’s hair. She tells the story. She smiles at Kim. The story is for him. Loung and Ma share a smile. It’s been a while since she has felt that connection.  INT. RO LEAP HUT - NIGHT  The following night, Loung watches Kim sling a bag (or scarf) over his shoulders and climb down the steps of the hut. His knees buckle when he reaches the ground. Quickly, he straightens himself before anyone notices. Loung grabs a bag, slings it over her shoulder and follows behind him.  EXT. RO LEAP - NIGHT  The sky is very dark. His small feet carry him into the darkness. Kim looks behind him frightened upon hearing a noise. He breathes a deep sigh of relief when he realizes it’s Loung. He gestures for her to stay quiet.  EXT. RO LEAP CORNFIELD - CONTINUOUS  Then he sees the field ahead of him. It is thick with stalks of corn, each with three or four ears, standing twice the size of the small boy. His eyes scan the area all around him. Kim runs from his hiding place into the cornfield. His fingers work busily to fill the bags. Loung comes closer. 51. Suddenly, two hands grab Kim from behind and throw him to the  ground. He tries to get back on his feet. Through her hiding place in the field, Loung sees two Khmer Rouge, their rifles slung across their backs. One soldier grabs Kim by the arm and pulls him off the ground, but his knees buckle. His head spins. He is shaking with terror. A hand slaps him hard on the face. The pain is sharp and cutting, but he bites his jaws together to stop its hurt.  KR How dare you steal from Angkar. Thief! They yell at him, but he is too stunned to hear them. More hands push him down. He is on al",
      "dialogue_count": 0,
      "word_count": 2450
    },
    {
      "scene_number": 17,
      "slugline": "INT. CHILDREN’S WORK CAMP - NIGHT  Loung and Chou are wedged closely together on a wooden bamboo plank with fifty other girls.  EXT. CHILDREN’S WORK CAMP RICE FIELDS - DAY  Loung and Chou now work in the rice fields with the other girls.   Harvesting is hard work.   Loung watches the others to learn what to do.   Na helps her and shows her.  EXT. CHILDREN’S WORK CAMP  The girls return from work. VAN a girl around Chou’s age and size makes herself known as a leader. She stares at Chou. She finds her sweet soft nature weak. 59.",
      "characters": [],
      "action_text": "Van pushes into Chou on purpose. Chou is of such a gentle nature it really shocks her. She tries to move away from Van who gets near her and pushes her again.   SAT, Van’s friend is also there and giving Chou a hard time.  EXT. CHILDREN’S WORK CAMP  Another day working in the rice fields. Sweat pours down Loung’s face. She looks over at Van who is saying things to Chou under her breath. Chou is trying to be strong.  INT. CHILDREN’S WORK CAMP - NIGHT  Chou and Loung hold each other as they sleep on the wood boards surrounded by all the other girls.  INT. CHILDREN’S WORK CAMP - EARLY EVENING  While washing up for dinner one evening, Van, walks up and pinches Chou’s arm. She leans in and whispers something cruel. As if possessed by a will of their own, Loung’s arms reach for her neck and her hands close around the girls throat, squeezing hard. Van’s face turns white with confusion. She gasps for air, chokes under the pressure of Loung’s fingers. She grabs Loung’s arms, her nails scratching her skin. Loung refuses to let go. Sharp pain explodes on Loung’s shin as Van kicks her. Loung lunges at her with her body, knocking her to the ground. Sitting on her chest, Loung’s eyes pierce hers. Her hands slap Van’s face. Loung is pushed to the ground by Met Bong. MET BONG Enough! She points to Van. 60. MET BONG (CONT’D) Go and wash up. (to Loung) You will water the garden tonight. No dinner. And no sleep until you finish. Met Bong instructs another girl to guard Loung and make sure she does as she is told. As Loung struggles to get up, the crowd around her slowly dissipates. Chou looks down, unable to help. She grabs the water pail to start to water the garden.  EXT. CHILDREN’S WORK CAMP GARDEN - EARLY EVENING TO NIGHT  Loung works while the girls eat their dinner, recite propaganda at the nightly lessons (in the school room if nearby), and get ready to go to bed. She does not cry, scream, or beg for mercy. Many hours into the night, Met Bong approaches and tells her to go to s",
      "dialogue_count": 0,
      "word_count": 666
    },
    {
      "scene_number": 18,
      "slugline": "EXT. CHILDREN’S WORK CAMP - MORNING  At the break of dawn, Loung packs her clothes and food bowl. Hooking their elbows together Chou and Loung walk towards Met Bong. The girls hug wrapping their arms tightly around each other. Loung can feel Chou’s tears wet her hair. Met Bong announces it is time for everyone to move. (discuss other ways to show affection that are more suitable under KR) Chou refuses to let go of Loung’s hand. With all her strength Loung pulls her hand away and moves to catch up with the others. She can’t look back. Loung holds back her tears and lifts her head bracing herself for what’s to come.  EXT. CHILD SOLDIER TRAINING CAMP - DAY  Met Bong leads Loung and two others to another camp a half an hour’s walk away. When they arrive, Loung notices in many ways it seems similar in set up to the old camp. Met Bong passes them off to MET SREI. (Try a full camp bokotor training as the new girls arrive.) The new work camp is surrounded by forest. All around are hammocks in tall palm trees that sway lightly in the wind. Some boys are training. One looks at her and smiles, SMILING BOY. He looks about twelve years old, has a round face, black wavy hair, and a small, dark sinewy body. This familiar gesture of human friendship is one that she has become so unused to. She smiles slightly and turns her attention back to the camp. The camp is made up of about ninety girls and boys, their ages ranging from Nine to fifteen. Loung is one of the younger ones. In this camp I suggest to have 2 groups of children, gathered according to their age. Met Srei manages the group of girls like Loung and a boy, Met Prem leads the unit of 13-16 boys - only boys. There could be a unit of young boys too and a unit of young girls. But they all are separated when they sleep, when they eat...  EXT. CHILD SOLDIER TRAINING CAMP - NIGHT  Loung’s first night at the camp, the two groups gather around a roaring bonfire to listen to the latest propaganda.   Met Srei stands before them preaching the message. 62.",
      "characters": [],
      "action_text": "MET SREI We owe everything to Angkar! We are strong because of the Angkar. Loung joins the others in the obligatory fists in the air. ALL Chevo! Chevo! MET SREI Youns are like the devil and some refuse to die. We must use our knives and spill their insides into the dirt. Smash the Yuon agressors who devour our country! Down! ALL Down! Down! Down! Baratchey! Brarchey! As if possessed by powerful spirits, her arms shaking furiously at the sky, their lips moving faster and faster   as she spits words about the glory of the Angkar and the unbeatable Khmer soldiers. The children's furor matches that of the Met Srei’s. MET SREI Long live the courageous, invincible Revolutionary Army of Kampuchea. ALL Cheyo! Cheyo! They thunder in appreciation. Loung looks at the sea of fists in the air.  EXT. CHILD SOLDIER TRAINING CAMP - NIGHT  When the speeches are over, the circle opens up and the kids gather to one side of the fire. Four boys get up from the crowd, with mandolins and homemade drums in hand. They stand to the side of the crowd and start to play their instruments. They beat the drums and strum the mandolins while their feet tap the ground. Five girls walk up to the front and stand facing the crowd. All are wearing beautiful black shirts and pants, not the faded, gray-black Loung has on, but shiny and new, with bright red scarves around their waists.   They wear red ribbons across their foreheads with red fake flowers made of dyed straw.   Forming a line, they sing and dance. 63. All the songs are about worshiping the powerful leader of the Angkar, Pol Pot, the glory of Angkar society, and the unbeatable Khmer soldiers. Later- They dance scenes depicting farmers at work, and a song about a woman soldier hiding her knife in her skirt and thrusting it into the heart of a Youn. It has been years since Loung has heard music. Watching the girls sing and dance, a strange feeling comes over Loung. Though the words they sing describe images of blood and war, the girls smile. The",
      "dialogue_count": 0,
      "word_count": 878
    },
    {
      "scene_number": 19,
      "slugline": "EXT. CHILD SOLDIER TRAINING CAMP - DAY  Depending on their size and age, the children are given different jobs and training. Loung sits with a group of girls sharpening sticks and building traps.  EXT. CHILD SOLDIER TRAINING CAMP - DUSK  The children are gathered around the fire. Loung stares at the flames. TRAINING OFFICER It is very easy to train someone to use weapons but to train a mind is more difficult. You must follow orders without hesitation. Loung looks at the faces of the other children listening. Their big brown eyes glow by the light of the fire. Met Srei leads the children in propaganda songs. Loung must sing along.  INT. CHILD SOLDIER TRAINING CAMP - NIGHT  Loung climbs into her hammock. She looks around at the girls she lives with. No one is a friend. No one can replace her family. She sees two girls sleeping near each other. She misses Chou.  EXT. CHILD SOLDIER TRAINING CAMP - DAY  The Smiling Boy is there and this time Loung smiles back. Met Srei calls the other children to her. They all come together in the center of the camp. Met Srei stands up and disappears, only to return moments later with an armful of tools. They clang noisily as she drops them in a pile in front of them. MET SREI All these tools you already know. But in the hands of fighters, they are weapons of war.   The machete cuts.   The hammer smashes.   (re the sickle) The point of the sickle can pierce a person’s skull. 65.",
      "characters": [],
      "action_text": "Met Srei picks a rifle from the pile, the same kind Loung has seen many times before on the shoulders of the Khmer Rouge soldiers. MET SREI (CONT’D) This weapon is very expensive. It is easy to shoot. Met Srei calls Loung up from the group. She puts the rifle on her small shoulder. Its butt digs into her chest. Met Srei then instructs her to sling one arm over it, balancing its weight with her arm. Loung does this easily but against her will. She then takes the rifle and slips the strap on Loung’s shoulder. The rifle hangs on her back a foot from the ground, its butt bouncing lightly on her calf. Loung focuses on it, realizing that this is the weapon that made Kim bleed the same weapon that smashed into his skull. SHE HAS FLASHES OF THAT MEMORY. Her hand shakes slightly, but she steadies it by clutching the stock tightly until her knuckles turn white. MET SREI (CONT’D) Your extended left hand holds and balances the rifle. Your right hand aims and squeezes the trigger. She calls each child one by one and teaches her how to hold the rifle. Loung watches.  EXT. CHILD SOLDIER TRAINING CAMP - DAY  Loung and others in a class to lay land mines. She looks up and sees some of the boys gathered together as they march out of the camp and off to war.   Smiling Boy is there.   He’s not smiling this time.  EXT. TREES - MORNING  Light shines through the trees. Suddenly we see movement. The girls appear and disappear as they practice manoeuvres.  OMITTED EXT. CHILD SOLDIER TRAINING CAMP - NIGHT AM  Loung sits in fear. 66. The sky is dark and cloudless, allowing the full moon to shine through, giving everything an eerie, silvery glow. 66A. The cool wind blows quietly. All is quiet, except for the crickets. The night sky looms ever more black in front of her. Something rustles loudly in the tall grass. She holds her breath and look around the compound. Her heart races. The tree trunks expand and contract as if they are breathing. The branches shake and swing, transform into hands. T",
      "dialogue_count": 0,
      "word_count": 1044
    },
    {
      "scene_number": 20,
      "slugline": "INT. RO LEAP HUT - AFTERNOON  Everything is still there. Their wooden rice bowls and spoons. Their pile of black clothes. Loung searches the hiding place. She finds Ma’s blue shirt and the family photo wrapped inside. LOUNG Ma! Getting a bad feeling, Loung calls out again. No one replies. She notices a bowl knocked over. She puts it on the small shelf. Davi’s mother stands in the doorway of the next hut. DAVI’S MOTHER They went with the soldiers. The woman says quietly and looks away. She stares into the distance, refusing to look back at Loung. They both know what it means when the soldiers come to the village and take someone with them. Loung stares into the empty hut. They cannot have survived three years of starvation and the loss of Keav and Pa only to be taken now! She fought so hard to live! She cannot be gone. Poor little Geak, she never got anything good out of life. At the sound of a baby, Davi’s mother leaves.  OMITTED  MEMORY of Ma singing her to sleep in Phnom Penh flashes before Loung. She cannot be strong anymore. Tears run uncontrollably down her face. Her chest compresses, her insides gnaw at her, eating away at her sanity. She has to run away, she has to leave. Somehow her legs take over and carry her away from the village. Her body goes weak when she wonders which one the soldiers killed first... HER MIND PROJECTS IMAGES OF THE TWO OF THEM TOGETHER. HER THOUGHTS OF WHAT MIGHT HAVE HAPPENED -  EXT. DARK FOREST - NIGHT (OR DAY) - TBD  Ma cries softly, her body tense with fear. 69.",
      "characters": [],
      "action_text": "Suddenly the rattling sounds of the rifles go off and bullets pierce through bodies, silencing their screams. Geak moves to Ma's slumped-over body with her face in the mud. Geak is too young to understand what has just happened. She calls Ma. She touches Ma's cheeks and ears, and grabs her hair to try to lift her face out of the mud, but she is not strong enough. While rubbing her eyes, she wipes Ma's blood all over her own face. She pounds her fists on Ma's back, trying to wake her up, but Ma is gone. Holding on to Ma's head, Geak screams and screams, not stopping to take in any air. Seconds later, a shot, Geak too is silenced.  OMITTED EXT. RO LEAP - DUSK  Loung walks away from Ro Leap deafened by the ringing in her ears. Tears pour from her as she drags herself away from the village. Her eyes flutter, it is as if she is drifting away into another place, into the deepest recesses of her mind to hide from the pain. Suddenly, the world becomes hazy and blurry. It is black all around her, soothing and empty.  EXT. CHILD SOLDIER TRAINING CAMP - MORNING  Staring straight ahead, Loung regains conscious thought. Slap. She is back at camp, standing before Met Srei. Her hand massages her stinging cheek; she tastes blood in her mouth. MET SREI (demanding) Where have you been? For Loung, the world comes back into focus. He looks at the girls standing around staring. LOUNG I went to see my sister. MET SREI And stayed there for three days? Loung’s eyes widen in disbelief. LOUNG I don’t know.   I don’t know where I was. 70. Met Srei slaps her again. Loung almost loses her balance. Met Srei screams into her face. MET SREI You won’t tell me? No food tonight and I will reduce your ration until you do. Met Srei walks away. After she is gone, Loung walks to the well and pull up a pail of water. Drinking some, pouring the rest over her feet. Rubbing one foot against the other, she removes the layers of red mud to expose her small, wrinkled toes.  OMITTED EXT. CHILD SOLDIER TRAINING C",
      "dialogue_count": 0,
      "word_count": 1191
    },
    {
      "scene_number": 21,
      "slugline": "EXT. ROAD - NIGHT  On the road, Loung finds herself crowded among hundreds of people walking amid deserted towns and villages. Automatically, her body takes control of her feet and veers her in the direction of her Chou’s camp.  EXT. CHILDREN’S WORK CAMP - NIGHT  The camp is dark and empty when Loung get there. LOUNG (desperate) Chou! Chou! Loung circles around the compound, but Chou is not there. The camp has been evacuated. Penned animals panic as fire surrounds them.  EXT. ROAD - NIGHT  Loung runs back out into the traffic, not knowing what to do next.   All around her the people move like a herd of cows. Not knowing what to do.   She is afraid. She feels a hand grab her shoulder. It's Kim. He's alive! Chou is with him, holding on tight to his hand. Loung’s never been so happy! KIM Come, we have to leave quickly. Kim grabs Loung’s hand and they head back onto the road and into the traffic. Kim is once again in charge of the family. As other people carry their pots, pans, clothes, food, and   other belongings on their backs or in their wagons, Kim carries a backpack with a few clothes in it, while Chou and Loung hold his hands and walk with only the clothes they are wearing.  EXT. ROAD - NIGHT TO SUNRISE  They walk with the sea of people, following their route. Loung leans on Kim.   Soon the sun rises.   In crimson red, golden yellow, and fiery orange, it lights up the world around them.   In the field, tall elephant grass glistens with morning dew while gray smoke floats in to the sky from distant villages.   The small red gravel roads are swarmed body to body with people in their black shirts and pants. 73.",
      "characters": [],
      "action_text": "The traffic does not stop and continues to move, everybody dragging their feet slower and slower. Those who cannot move any farther sit at the side of the road, some curl up in a fetal position and sleep. The snakelike traffic pushes on with the strong able-bodied men forming the head, and the old, young, weak, and hungry trailing behind as the tail.  EXT. BOMBED HOUSE - MORNING  As the sun climbs higher in the sky. Kim spots a deserted bombed house. Chou and Loung follow Kim's lead.  EXT. BOMBED HOUSE- DAY  Alone in the bombed house, all is quiet except for the muffled grunts of pigs and cackles of chicken. The villagers evacuated in such a hurry that they left clothes, sandals, and scarves strewn everywhere on the ground. In the communal kitchen, smoke still rises from the ashes. Chou enters a hut and comes out with a few metal pots, aluminum bowls, and the remaining few small bags of rice and salt. Loung grabs three scarves, (or pieces like a jacket for Kim or a scarf for her?). Loung makes a big bundle with a scarf to balance on her head. Chou does the same. Loung watches as Kim catch two chickens and locks their wings behind their backs. He kills them and hangs them to carry. (could be just one and may carry live)  OMITTED EXT. ROAD - DAY  Bundles in hand, they walk back out to join the mob of people. Not knowing where they are going, they follow the traffic. Kim notices something on the road. He points it out to the girls. An anti tank mine. Half buried on the road. Loung looks at it as she carefully walks around it. Later - they pass a land mine that has exploded. Nothing but   284A  a hole in the ground and the remains of the blood from the victim who was dragged away. Now she is constantly looking down at the road. Terrified. There is gunfire in the distance. 74. HOURS LATER  Loung stops and stares straight ahead. Her heart pounds so loudly. Before them walk three men dressed in green clothes. Their legs move in long, casual strides and their rifles swing o",
      "dialogue_count": 0,
      "word_count": 949
    },
    {
      "scene_number": 22,
      "slugline": "EXT. INTERNALLY DISPLACED AREA - LATE DAY  Loung Kim and Chou pluck the chickens.  EXT. INTERNALLY DISPLACED AREA - DUSK  Finally Chou announces they are done. Kim breaks off a leg, scoops up a bowl of rice, and hands it to Loung. With their plates in front of them, they eat in silence. They notice a couple Orphans staring. Chou whispers to Kim and he invites them to share what little chicken they have.  EXT. INTERNALLY DISPLACED AREA - DAY  A day in the area - add details.   Chou and Loung preparing a snake (with a knife they found at the abandoned house).   Kim prepares a fire. Survival.   Some cooking frogs or spiders. Some people dying, having been starved too long. Later- Kim brings over a small water bucket. Kim, Chou and Loung help each other clean up. Chou wipes mud off Loung’s face. She then runs her fingers through her hair to “brush” it. Chou then walks up to Kim and pulls stray threads from his shirt.  EXT. INTERNALLY DISPLACED AREA - NIGHT  Chou spreads out their scarfs and lies down. With her in the middle, Kim and Loung huddle closely on either side of her. Kim hooks a bundle through his arms while Loung does the same to her bundle. They pull (Kims new jacket?) over themselves. All around them people are sleeping, eating, or sitting quietly together. Many who have little strength left are assisting the sick. Loung looks over to the side and watches a family sitting together, eating their meal. It is a family of five, parents with three boys, from perhaps five to ten years old. The father scoops rice and hands it over to his youngest child first, then he does the same for the others. The mother reaches over and wipes the child's nose with her fingers, then quickly wipes her hand on her skirt. Loung looks at the fathers kind eyes. She sees how much he loves his family. She misses Pa. 76.",
      "characters": [],
      "action_text": "Loung turns away. Gunfire can be heard in the distance. 76A.",
      "dialogue_count": 0,
      "word_count": 344
    },
    {
      "scene_number": 23,
      "slugline": "INT. INTERNALLY DISPLACED AREA - DAY  Loung and Chou wash and hang their laundry. MEMORY  INT. PHNOM PENH APARTMENT - MORNING  Flashes - New Year's morning, Keav, with big pink, yellow, blue, and green prickly plastic rollers in her hair held in by a hundred small black bobby pins sticking up everywhere like porcupine quills, as she combs Loung’s hair and ties it in ponytails. Next to her on the bed, Chou works on getting Geak dressed. After Keav finishes with Loung’s hair, she puts red rouge on Geak's lips and cheeks. On their bed, they bounce with glee as their mattress squeaks. Colors and pretty clothes and laughter. MEMORY ENDS An ax chops wood-  EXT. WOODS - EARLY MORNING  Loung, Kim and Chou gather firewood. Loung steps on something that looks like a brown twig but it slithers away giving her a small fright. Loung rubs her tired eyes, yawns, and adjusts the ropes she brought to tie the firewood, slinging them over her shoulders. Chou walks ahead with the ax in her arms.  EXT. INTERNALLY DISPLACED AREA - DAWN  FEBRUARY 1979 The sounds of morning.   The mass of small makeshift settlements for displaced families are all silent.   Men in green patrol the area. 77.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 207
    },
    {
      "scene_number": 24,
      "slugline": "EXT. INTERNALLY DISPLACED AREA - DAWN  Suddenly Loung awakens to the sound of a loud explosion. She bolts upright, her ears ringing from the blast. She hears a shrilling whine before another rocket ruptures nearby. The children scream at the top of their lungs, clambering around the campsite. Loung, Chou, Kim and the Orphans move.  EXT. INTERNALLY DISPLACED AREA - CONTINUOUS - DAWN  The earth shakes violently as crackling yellow, orange, and red flames devour a nearby hut. Gray smoke floats to the sky and white ashes fall on them like powder. (if no hut then embers from a blast. To be discussed) Loung watches as all around her people cry and scream for help as more rockets rain on the village. Fire engulfs the camp and villagers rush to evacuate.  EXT. INTERNALLY DISPLACED AREA - DAWN  Loung sees the men in green fighting the KR soldiers. Both sides seem equally frightening to her. Loung gets separated. She looks around everyone looks the same. She can’t find Kim and Chou. She feels panicked. Finally, she finds them. With their legs shaking in fear, they follow Kim ducking and keeping low.  EXT. RIVER - MORNING  They come to the river and, holding hands, wade into it. The river splashes in waves as hundreds of people jump in it at once trying to get to the other side. With small bundles on their heads or draped on their shoulders and small children hanging on their backs, the villagers wade across the chest- deep stream, desperately reaching for safety. Loung Kim and Chou tuck in to the side of the river bank to avoid the battle that rages around them. RE IMAGE AJP. She sees a young KR fighting the Vietnamese. It’s Smiling Boy. A blast almost knocks the air out from Loung’s lungs.   She reaches for the Orphan boy’s arm, then jerks her hand back as her palm touches something wet and sticky on her. 78.",
      "characters": [],
      "action_text": "Her stomach churns. Loung turns to see him lying facedown on the ground, quiet and motionless. His little brother below him covered in blood. The top of his skull is caved in. A pool of blood slowly seeps into the dirt around her head. Blood and pieces of brain are on Loung’s hand.  EXT. RIVER - MORNING  The battle rages on. Loung, Chou and Kim are under fire and forced to run.  EXT. FOREST - MORNING  People are scattered everywhere, soaking wet screaming and crying as they run in every direction, bumping and pushing each other. Kim and Chou hold hands and run ahead of Loung, yelling for her to keep up. They don't know where to run to, they just run.  EXT. FOREST -   MORNING  Running as fast as she can, Loung jumps over dead bodies. She hears their bullets whiz past her. She runs for her life. In front of her, a man falls from a bullet. His body stops mid stride, his chest jerking forward before he falls to the ground. Many people get hit and drop one by one to the ground all around her. Some lie still while others crawl on their elbows trying to reach safety. Loung sees a man thrown into the air as the ground explodes beneath him. Land mines. She keeps running. A woman with child stands screaming. Another woman running knocks into her and the ground beneath them explodes. Loung runs staring at the ground. What can she do? Bullets from behind, land mines underneath. She holds her breath and moves forward. (Possibly moves forward slowly because of mines. Could discuss slow motion as world blows up around her and her heart beats) Minutes later- After she catches up with Chou and Kim, they see an old remnant of a tree stump.   It sticks out of the ground three feet tall by four feet wide.   They crouch behind it. 79.",
      "dialogue_count": 0,
      "word_count": 645
    },
    {
      "scene_number": 25,
      "slugline": "EXT. TREE STUMP - DAY  Chou covers her ears with her hands and squeezes her eyes shut. Kim is white, leaning against the tree for support. They stay there for what seems like hours until all is quiet again. Later- When they believe it is safe, they come out from behind the tree stump. Loung watches Chou and Kim trudge ahead, their eyes focusing on the ground. There are smoldering remains of bonfires giving off the stench of burnt human flesh all through the village. Trails and puddles of blood stain the area. Her eyes are on the ground wherever she goes, steering clear of anything that looks like a grenade or land mine. They try to step into the footprints of others.  EXT. BORDER CAMP - DAY  A month or so later. They have moved with others up to a more mountainous region where it is safe. Chou and Loung at the river. Life is returning. We can see that aid relief is beginning to trickle in.  EXT. BORDER CAMP - DAY  Kim arrives at the site all flushed and out of breath. As he explains this, Loung hears every other word KIM (out of breath) A Khmer Rouge soldier. They caught him. (Pointing) They are taking him up there. Kim sits to catch his breath. Loung pulls Chou with her. She wants to see. Chou resists. Loung heads off on her own.  EXT. BORDER CAMP - DAY  Loung makes her way towards the sound until she closes in on a mob of people. 80.",
      "characters": [],
      "action_text": "Their bodies block her view of the prisoner. She tries to shift her body to find an open space but she cannot. Frustrated, she wedges her small body between theirs and pushes her way through. She is in the middle of the crowd, surrounded by people. She cannot see anything. She looks up to the faces of the adults who are all looking in the same direction. Some are staring at him overwhelmed with emotion, unable to speak. Some are full of rage. Finally, she sees a clearing between people's legs. She tries to push her way through, but they are so engrossed in what's going on that they do not move. Determined, she gets on her hands and knees, and crawls through the brown forest of legs up to the front. There he is. Loung stands and finds herself almost face-to- face with him, separated by only ten feet. Automatically, she raises her scarf to cover her head and face. Her heart beats wildly. Fear seeps into her body. She peeks over her scarf. He is looking at her. She takes a step back, leaning into the crowd for protection. The crowd vibrates with anticipation and energy, closing in around the prisoner. Loung’s hands close into fists. The mans face reveals nothing. His lips do not beg for mercy. He sits propped up on a high back chair on a gravel hill that serves as a stage. He is dark and wears the black clothes of the Khmer Rouge. A rough hemp rope that binds his feet together. More rope straps him to the back of the chair, it coils around him from the chest down to the stomach. CROWD Murderer! Loung stares at him full of hatred. Loung watches as sweat streams down his adams apple. He bends his head, looks down at his feet again, knowing there is no way out. Many people are wailing and accusing the man of killing their loved ones. Begging him to answer for his crimes. A WOMAN, crying loudly, pushes her way to the front of the crowd. She is young, in her mid twenties. Like Loung, she wears the Khmer Rouge clothes. Though tears fall from her eyes, her face is angry. WOMA",
      "dialogue_count": 0,
      "word_count": 1439
    }
  ]
}