{
  "slug": "first-reformed-2018",
  "title": "first reformed",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 18,
  "characters_count": 0,
  "characters": [],
  "total_words": 15635,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. FIRST REFORMED - CEMETERY - DAY 1   1 TOLLER, early 40's, a cleric, dressed in a worn black clerical garb like a small town judge, tends the historic cemetery of historic First Reformed Church, upstate New York, his face like a half rubbed away engraving on those tombstones, revealed in degrees of shadow. His angular body lists to the right, as if resisting weight. He is in Agony. And he writes.  TOLLER STARTS A JOURNAL  Still images of First Reformed Church, Snowbridge, New York, and environs: --A yellow on blue iron historical marker reads: “First Reformed Church, Organized 1752, Built 1765. Occupied 1776 by New York Provisional Congress. Station in Underground Railway 1845 to 1850. Placed on National Register of Historical Places. State of New York Education Department, 1934.” --A Dutch colonial spired church built on a fieldstone foundation under a low fluorescent sky against a mountain ridge. --Oft painted door jambs, slightly askew. --An ancient churchyard lined with weathered grey and uneven tombstones. A   faded inscription reads: “...in memory of Effie Vei Planck Born 16 of February 1737 and Departed this Life November...”  CUT TO:  INT. PARSONAGE - DEN -   NIGHT 2   2 A hand writes in a black flecked composition notebook. We hear what the writer writes:",
      "characters": [],
      "action_text": "In a background an unaccompanied   keyboard   plays, “Pass Me Not (O Gentle Savior).” ...and the simple events of my day factually and without hiding anything. When writing about oneself, one should show no mercy. Who are you hiding from? God?... INT. FIRST REFORMED - SANCTUARY - DAY 3   3 --Brochures in a pamphlet rack feature an antique photo of the church. “A Short History of Historic First Reformed.” Tours every Tuesday and Thursday at 10 AM. --Hands playing the   keyboard . --A framed and faded Continental Army flag “raised at the edifice June 1774” hangs beside two glass covered bullet holes. --”From this spot in March 1855, Calvin Verlander escorted 16 Free People of Color to the Canadian border.” TOLLER (V.O.) I will keep this diary for one year, twelve months and at the end of that time it will be destroyed. Shredded, then burnt. The experiment will be over. “Pass Me Not” draws to a finish. JOHN ELDER, 60, the steel guitarist, steps back and takes a seat. Wider angles reveal the nature of the sanctuary, a functional colonial rectangle lined with white painted pews. High stained glass windows let light in from above. The walls are lined with memorial plaques and remembrances.  TOLLER (V.O.) I have decided to keep a journal. Not in a word program or a digital file, but in longhand, writing every word out so that every inflection of penmanship is recorded, every word chosen, scratched out, revised to set down all my thoughts... Seven PARISHIONERS stand in the pews. Three single elderly worshippers, one middle aged couple and one younger couple. A token turnout at best. Reverend Toller, dressed in a collarless cassock, stands at the pulpit. He reads from the Heidelberg Catechism: TOLLER “What is thy only comfort in life and death?” The parishioners, Psalter books in hand, join in the response, their voices a communal mumble: PARISHONERS “That I with body and soul, both in life and death, am not my own but belong unto my faithful Savior Jesus Christ, who with hi",
      "dialogue_count": 0,
      "word_count": 1381
    },
    {
      "scene_number": 2,
      "slugline": "INT. PARSONAGE - BEDROOM - NIGHT 9   9 On his   rear , he prays at his bedside. INT. PARSONAGE - DEN - NIGHT 10   10 Toller pours himself a glass of scotch, sips it. Toller’s bed, unmade, messy, empty. TOLLER (V.O.) I look at the lines I last wrote with disdain. Twelve months? Can I keep up an exercise that long? I read these words and see not truth but pride. CLOSEUP: diary. TOLLER (V.O.) I wish I had not used the word pride. But I cannot cross it out. If only I could pray.  CUT TO: TOLLER MEETS MICHAEL  EXT. CORNER GAS STATION - DAY (OMIT) 11   11 EXT. SUBURBAN STREET - DAY (OMIT) 12   12  TOLLER (V.O.) I assisted Sunday the youth group at Abundant Life. The young people were so excited, so full of life. They were open, they welcome communion. Maybe I shouldn’t care about whether people like me? Did Jesus worry about being liked?",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 160
    },
    {
      "scene_number": 3,
      "slugline": "EXT. MENSANA HOUSE - DAY 13   13 A woman walking a dog passes. Toller parks in the drive of a modest house, goes to the front door, rings the bell. Mary answers the door, They speak. He enters. INT. MENSANA HOUSE - LIVING ROOM - DAY 14   14 Inside the house, Toller looks around as he hands Mary his coat.   A framed photo of Mary and Michael side by side hangs by door . MARY Thanks for coming. (about photos) Our honeymoon. A bike honeymoon. Michael Mensana joins them. He wears khakis and a checked shirt. MICHAEL  Ireland . They exchange greetings. MARY Thanks for coming. Would you like some coffee? Toller is concerned about his stomach: TOLLER Yes, but... MARY I think we have some tea. TOLLER That would be better. Mary heads toward the kitchen as Michael leads Toller into a small office. INT. MENSANA HOUSE - OFFICE - DAY 15   15",
      "characters": [],
      "action_text": "They sit in the cramped space. The room is filled with books, literature and announcements about ecological activism. Comparative graphs and global maps show the projected consequences of global warming: the rise of the oceans, drought, vanishing species, migratory patterns. Michael, uncomfortable, shifts his weight: MICHAEL I don’t know why Mary... TOLLER No reason to apologize. You’ve been in Canada? MICHAEL Ft. Providence. That is in the Mackenzie Delta, way to the north. TOLLER Beautiful country, I imagine. MICHAEL It is. Beat. TOLLER Mary says things have gotten you down. MICHAEL “Things?” You could say that, yes. Mary, tapping on the door, enters with a cup of coffee and another cup of tea. She closes the door behind her. MICHAEL (CONT’D) Mary is pregnant. TOLLER  I noticed. How far along is she?  MICHAEL  Twenty weeks . How old are you, Reverend?  (beat)  TOLLER Forty-two. MICHAEL Thirty-five. (beat) (MORE) MICHAEL You think? (Toller waits) The world is changing fast. Right in front of us. One third of the natural world has been destroyed in your lifetime. The earth’s temperature will be three degrees centigrade higher. Four is the threshold. Michael hands him a printout resting beside the keyboard: MICHAEL (CONT’D) ...“severe, widespread, and irreversible impacts”--when  scientists   use words like that-- the  National Center of Atmospheric Research, Lawrence Livermore, the Potsdam Institute... Michael stands, hands Toller reports from various agencies, speaks as he walks. A GIF plays on Michael’s computer screen: the computer animation displays the mutating planet from 1850 to 2050--less green, less ice, more flooding, more drought, decade by decade. Toller speaks over: TOLLER (V.O.) He went on for some time like that. By 2050 sea levels two feet higher on the East Coast. Low lying areas underwater across the world. Bangladesh ,   twenty percent loss of land mass. Central Africa ,   fifty percent reduction in crops due to drought. The western reservoirs dri",
      "dialogue_count": 0,
      "word_count": 1785
    },
    {
      "scene_number": 4,
      "slugline": "INT. PARSONAGE BATHROOM - NIGHT 18   18 Propping one hand against the wall, Toller urinates into the toilet. His urine runs dark brown. INT. PARSONAGE BEDROOM - NIGHT 19   19 TOLLER (V.O.) Who am I to talk about pride? Toller kneels at his bedside in prayer. INT. PARSONAGE KITCHEN -   DAY 20   20 Toller sits at the kitchen table. He tears bread from a loaf, eats it. Downs it with a sip of scotch.  CUT TO: TUESDAY MORNING TOUR  EXT. FIRST REFORMED CEMETERY - DAY 21   21 Toller, in his civilian clothes, speaks with a MIDDLE AGED COUPLE and a COLLEGE STUDENT in the snowy church graveyard. The guests hold printed pamphlets detailing the history of First Reformed. TOLLER ...completed in 1765 in a style we now call Dutch Colonial by settlers in this region with local field stones and timber, First Reformed took seven years to build. (MORE)  TOLLER   (V.O.)   (CONT'D) Despair is a development of pride so great that it chooses one’s certitude rather than admit God is more creative than we are. Perhaps it’s better I didn’t say that to him.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 185
    },
    {
      "scene_number": 5,
      "slugline": "INT. FIRST REFORMED - DAY 22   22 The tour continues inside the sanctuary. TOLLER The church was partially rebuilt in 1837 following a fire. This section was preserved. Beside the Continental Army flag, if you look closely, are two bullet holes fired during what was called the Skirmish of Snowbridge. MIDDLE-AGED WOMAN Do you still have services? TOLLER Oh yes, Sunday services are each week at 10 am. First Reformed is the third oldest church in continuous operation in New York State. In   a   month we will celebrate our two hundred fiftieth anniversary. INT. FIRST REFORMED ENTRANCE - DAY 23   23 They stand before a breakfront near the entrance. Behind the glass are mementoes of church history and souvenirs. TOLLER ...here are examples of the original church chinaware brought over from the Netherlands. And the first chalice. On the lower shelf are souvenirs which are for sale. Key rings, pens, postcards, caps and T shirts, although we only have the shirts in size S. We’re waiting for more to come in. The College Student reaches for a cap. TOLLER (CONT’D) Try it on. One size fits all.  TOLLER   (CONT'D) The Vei Plancks were one of the founding families. Effie’s tombstone dates from 1787.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 204
    },
    {
      "scene_number": 6,
      "slugline": "INT. FIRST REFORMED CHOIR LOFT - DAY 24   24 They stand in the choir loft beside a large pipe organ. The College Student holds a “First Reformed Snowbridge NY” baseball cap. TOLLER The pulpit was   donated by William Mercer in 1879 . The church organ which unfortunately is not working at this time was manufactured by A.G. Hill in England. MIDLE-AGED MAN Did you hear the one about the Choir Mistress and the Minister? TOLLER No, I haven’t. MIDLE-AGED MAN She chased him around the church and caught him by the organ. The Middle-Aged woman elbows her husband as he laughs. Toller responds with a polite chuckle. TOLLER I hadn’t heard that one. EXT. FIRST REFORMED - DAY 25   25 Outside the church, Toller wishes the group farewell as they thank him. The College Student straightens his new cap as he walks. The Middle-Aged Man walks away then steps back to slip a folded bill into Toller’s palm.  CUT TO: ABUNDANT LIFE  EXT. ABUNDANT LIFE CHURCH - DAY 26   26",
      "characters": [],
      "action_text": "The campus like environs of the Abundant Life in Christ Church of Christian Fellowship: a main Fellowship Hall, several ancillary buildings and acres of parking. A large sign lists the pastoral staff and hours of the services. “All Welcome.” “Lead Pastor Joel Jeffers.”  CUT TO:  INT. A.L. FELLOWSHIP HALL - DAY 27   27 Inside the main fellowship hall, church workers and volunteers are going about the multiple tasks which keep the organization humming.   The sound of vacuum cleaners. Several workers clean the chancel. CUT TO:  INT. A.L. REHEARSAL ROOM - DAY 28   28 Inside the choir rehearsal room, Esther leads a group of   six  teens,   three   boys and   three   girls of mixed backgrounds,  listen as Esther leads on a capella version of “Washed in the blood”. “WASHED IN THE BLOOD” “Have you been to Jesus for the cleansing pow’r, Are you washed in the blood of the Lamb?”.  The teen choir members, well scrubbed and fresh faces, brim with adolescent sexuality. Reverend Toller slips into the room, silently nods to Esther and takes a seat.  The youth choir joins in on the next verse . A boy in the second row slowly moves his hand behind the back of the attractive girl behind him, letting his fingers, in time with the lyrics, until it gently comes to rest above the crack of her buttocks. She quickly brushes the boy’s hand away. Toller, touched by the melody and lyrics, cannot help also be drawn to the garden of slender thighs, bulging crotches, tight buttocks and pert breasts, each about to flower and bloom. ESTHER  Very good. Take five.  She walks over to Toller: ESTHER (CONT’D) A penny for your thoughts. He snaps out of his reverie: TOLLER Joel wanted me to come by. ESTHER Nothing serious, I hope. TOLLER I assume not. ESTHER Want to have lunch? TOLLER I’ve got something after, but, well sure, why not? ESTHER (looking at teens) Remember that? TOLLER What? ESTHER When everything was ahead of you. TOLLER Try to tell them that. ESTHER See you then. (to choir)  “In the garden",
      "dialogue_count": 0,
      "word_count": 1353
    },
    {
      "scene_number": 7,
      "slugline": "EXT. FIRST REFORMED CEMETERY -   DAY 33   33 Toller, wearing his cassock,   lifts up a fallen   tombstone. This seems not so much a practical task but a personal one: a form of being. TOLLER (V.O.) Some are called for their gregariousness, some are called for their suffering, others are called for their loneliness. They are called by God because through the vessel of communication they can reach out and hold beating hearts in their hands. They are called because of their all consuming knowledge of the emptiness of all things that only can   be   filled by the presence of Our Savior. INT. PARSONAGE - DEN -   NIGHT 34   34 CLOSEUP. These words as they are written in his diary. EXT. CEMETERY - DAY 35   35 Toller’s cell phone rings. He sets down the brush, removes his phone from his cassock. MARY (O.S.) Reverend Toller? TOLLER Yes. Mary? MARY It’s me. TOLLER I got your message. About rescheduling. MARY You must come over. Now. TOLLER Is Michael there?",
      "characters": [],
      "action_text": "CUT TO: TOLLER AND MARY AND THE SECRET IN THE GARAGE  EXT. MENSANA HOUSE -   GOLDEN HOUR 36   36 The winter light is fading as Toller pulls into Michael and Mary’s driveway. She stands on the front porch. Toller approaches her. MARY Follow me. They walk around the house to the clapboard GARAGE out back. She opens the creaky garage door. They step inside. INT. MENSANA GARAGE -   NIGHT 37   37 Mary flips on and overhead bulb. The interior is a collage of tools, trash and abandoned projects. Two well maintained aluminum bikes hang on wall racks. MARY I was looking for some batteries. We were out and I thought there might be some here, you know, Mary works her way through stacks of junk as she reaches the far end of the garage where a rectangular wooden box like those used to transport Western rifles is stacked with discarded items. MARY (CONT’D) I put everything back just as I found it. I wanted you to see it just as it was. Mary places the objects atop the box on the concrete floor, then opens the box itself. Toller looks inside, not sure of what he sees.  MARY No, he’s at work. You must come over. Now. She lifts the item inside out so that Toller can see it. It’s immediately recognizable from news reports and Hollywood movies. TOLLER An explosive vest. MARY A suicide vest. Other elements are here. Batteries, detonators, tubes of jelly. Toller looks closer. MARY (CONT’D) He’s been working in the garage. He said he was fixing a motor. I didn’t question him. He’s been so lonely lately I was happy he found something that made him happy. Toller furrows his brow. What to say? TOLLER Did you have any...? MARY No. No suspicion. Nothing like this. (looks away) I can’t believe this. TOLLER Does Michael have any hint you know about this? MARY No. TOLLER When does he come back? MARY Later tonight. After closing. Ten PM. TOLLER Okay. I will take this. This cannot remain here. I will dispose of it. Don’t let on. Put everything back the way it was. MARY Are you going to the police?",
      "dialogue_count": 0,
      "word_count": 667
    },
    {
      "scene_number": 8,
      "slugline": "INT. PARSONAGE BATHROOM - NIGHT 38   38 Toller, using a plunger, struggles with the toilet. It’s backed up. He takes a bottle of Drano, pours it into the bowl. TOLLER (V.O.) Discernment intersects with Christian life at every moment. Listening and waiting for God’s wish what action must be taken. INT. PARSONAGE - NIGHT 39   39 Toller   lies fully clothed on the bed.  TOLLER (V.O.) My petty ailments have made me bad tempered. I fight the urge to write down the thoughts which come to my mind. INT. BATHROOM - NIGHT 40   40 Toller is bent over, clutching his stomach. TOLLER (V.O.) The desire to pray itself is a type of prayer. How often we ask for genuine experience when all we really want is emotion. My hand shakes as I write these lines. INT. PARSONAGE DEN - NIGHT 41   41 CLOSEUP:   Clean shot of journal. CUT TO: COME ALONE  EXT. FIRST REFORMED - DAY 42   42",
      "characters": [],
      "action_text": "A white “Bissel Music” truck is parked outside the church: “Pianos Organs--sales, service, repair, moving.”  CUT TO:  INT. SANCTUARY - DAY 43   43 Two Bissel REPAIRMEN have opened the pipe organ cover and exposed its inner workings. One sits at the keyboard as the other adjusts the ancient pipes. Familiar sounds of organ notes echo through the church. TOLLER I didn’t expect you for another two weeks. 1ST REPAIRMAN We got a message from the boss. He said it was a top priority. 2ND REPAIRMAN You are having a big event here? TOLLER It’s the two hundred fiftieth anniversary of the Church. They are expecting a lot of important people. The repairmen seem impressed. The 1st Repairman   testing , plays the opening notes of “A Mighty Fortress is Our God.” Toller smiles. Toller’s cell phone DINGS. He takes out his phone, checks the messages. There is a message from Michael: “Meet me at the Westbrook Park Trail. East entrance. The red diamond trail. Come alone.” Toller punches in a phone number. Mary answers. TOLLER (CONT’D) Mary, this is Reverend Toller. Is Michael there? MARY No. TOLLER Do you know where he is? MARY He’s out. TOLLER Did he come home last night? MARY Yes. He left without saying anything this morning. (beat) Reverend? TOLLER Yes. MARY He was up during the night.  CUT TO: THE RED DIAMOND TRAIL  EXT. WESTBROOK PARK - DAY 44   44 Toller exits his Toyota in the parking area by the ice covered pond. Michael’s car is parked nearby. Geese scatter as he checks the trail map. He locates the red diamond trail, heads that direction. EXT. TRAIL - DAY 45   45 Walking up the wooded path, Toller is soon surrounded by trees and greenery. He might as well be in the wilderness. He proceeds along the trail with increasing foreboding. TOLLER Michael? Ahead, he sees what he fears: two work boots emerge from the underbrush. A shotgun lies nearby. Toller walks beside Michael’s body. He looks to recognize him but realizes the body has no head. It has been completely blown off. Just a",
      "dialogue_count": 0,
      "word_count": 1190
    },
    {
      "scene_number": 9,
      "slugline": "EXT. FIRST REFORMED - NIGHT 51   51 Toller walks the dark path from the Parsonage to the Church. TOLLER (V.O.) I went into the church and fell asleep on a bench. INT. FIRST REFORMED - SANCTUARY - NIGHT 52   52 He goes into the SANCTUARY, curls up on a pew bench. TOLLER (V.O.) How easily they talk about prayer those who have never really prayed.  CUT TO: OLD ROCKIN’ CROSS  EXT. FIRST REFORMED - DAY 53   53 Plexiglas sign: “ February   6, 250th Anniversary and Reconsecration Service.”  CUT TO:  INT. SANCTUARY - DAY 54   54 John Elder plays the newly repaired pipe organ, starting with the opening cords of “Old Rugged Cross.” A smile spreads across his face: “So I’ll cherish the old rugged cross, Till my trophies at last I lay down...” ELDER This sounds great. I’m going to have to sharpen my chops for the reconsecration. Do you know what they want to play?",
      "characters": [],
      "action_text": "ELDER Why him? TOLLER It’s sort of his deal, I guess. He’s underwriting everything. He paid for the organ. There’s another music thing I want to talk about. Elder ups the tempo of “Old Rugged Cross.” Soon it’s moving at a be-bopping clip (“Rockin’ Around the Christmas Tree”). Toller waves him off with a laugh. TOLLER (CONT’D) Actually, it’s a sad bit of business. The Michael Mensana memorial. The scattering of his ashes. He asked me to arrange it. ELDER He   asked   you? TOLLER He left a letter. He had some requests.  CUT TO: YOUTH MINISTRY  EXT. A.L. CHURCH - DAY 55   55 The Abundant Life Church in Christ and Christian Fellowship.  CUT TO:  INT. A.L. BOOKSTORE - DAY 56   56  TOLLER Not a clue. Abundant Life is handling the invites and seating. Basically I’m going to introduce Joel, he’ll give a little spiel, introduce the Governor, maybe Ed Balq. Toller wanders through the expansive Abundant Life bookstore and gift shop. One wall displays Abundant Life publications. Pastor Joel Jeffers smiling face beams from a wide assortment of books, CDs and DVDs. Elsewhere clothes racks are hung with Abundant Life hoodies, T-shirts and polos. He steps over to the counter which displays pen sets, wristbands and lanyards. The YOUNG FEMALE CLERK notices him: CLERK Reverend Toller, can I help you? TOLLER I’ve been meaning to come in. We’ve run out of First Reformed T-shirts. We have some small sizes, but not the others. INT. A.L. MEETING ROOM - DAY 57   57 Toller sits with ROGER, 27, a muscled youth minister, and a group   of   young people in a CHURCH MEETING ROOM. Roger, in a black T shirt, has Bible texts tattooed along his bare arms. JASON, 18, offers testimony: JASON ...Since I made my commitment I have felt the Lord moving in my life. If happiness came in pill size it would have “JC” stamped on it. Continuous release size. I wake up feeling better. My relationships are better. I got a raise last week. I find myself in prayer without even thinking about it. Toller doesn’t know",
      "dialogue_count": 0,
      "word_count": 2760
    },
    {
      "scene_number": 10,
      "slugline": "INT. MENSANA HOUSE -   DAY 66   66 They step inside the living room. TOLLER Something I’ve been meaning to ask, if it isn’t too painful. (she nods) Do you think he would have really harmed someone? MARY He’d been involved in non violent protests, we both had, he’d been put in jail. He could lose his temper, start yelling at the police. But no, I don’t think he was violent. TOLLER I just wonder if I should have done something differently. MARY  He did not want to live.  ( Toller nods ) He was not a religious man, you know. He didn’t care for the church. That was me. I was the one who asked him to come. I was raised in the church and I’ve never been able to quite let it go. When I’m in a strange city I’ll just go in a church and sit down. I was the spiritual one. He nods.  TOLLER You’ll relocate there?  MARY I don’t know. She’s already contacted an obstetrician.  TOLLER A boy or a girl?  MARY My next visit I’ll find out.",
      "characters": [],
      "action_text": "MARY (CONT’D) Thanks. TOLLER I’ll get some boxes. Come back later to take care of the clothes. MARY Before you go, would you pray with me? He appears uncertain. MARY (CONT’D) I find it difficult to do alone. The words don’t come. Are you uncomfortable with me asking that? TOLLER No. Of course not. He clasps his hands, lowers his head. She follows suit.  CUT TO: MICHAEL’S FILES  INT. PARSONAGE - NIGHT 67   67 Toller writes in his journal: TOLLER (V.O.) I spoke and the words came out of my mouth. “By thy words you shall be justified and by thy words you shall be condemned.” TIMECUT. Toller goes through the boxes brought back from Michael’s garage. The explosive vest is in a box to the side. He looks through the file boxes. Michael’s framed photo of José Cláudio Ribeiro da Silva and Maria do Espírito Santo rests on the counter. Toller sips a drink of scotch, grimaces. He removes a series of paperbacks with dire titles: “Our Once and Future Planet,” “Plants at the Margin,” “Earth under Fire.” TIMECUT. Toller boots up Michael’s laptop. A series of icons and documents appear on screen. He examines the files: This Fragile Planet. Top 100 Polluters.  W Environmental Deregulation. Timelines. Bhopal. Marcal River. Arctic Melt. Ghana. Security Precautions. UN Resolutions. Scientific Associations. An encyclopedic reservoir of research. Toller clicks the “Top 100 Polluters” file. A number list appears: Monsanto. Shell. Kohle. Conoco. Balq. He opens the folder. The first document is a Balq Industries Quarterly Report. He opens it. A smiling photo of Edward Balq accompanies a welcoming message. A menu appears on screen under the title “BALQ” with subcategories: “Domestic Divisions, International Partners, Shell Companies, Political Contributions (est), Political Action Groups, Charitable Contributions, Litigations, EPA & IEC reports.” Toller takes another drink. TOLLER (V.O.) I can no longer ignore my health. I have postponed my checkup too often. Yesterday I literally could barel",
      "dialogue_count": 0,
      "word_count": 616
    },
    {
      "scene_number": 11,
      "slugline": "EXT. PARSONAGE - MORNING 69   69 In the rear of the parsonage, John Elder goes through the trash, separating the glass, plastic and metal recyclables. He cannot help but notice as he drops bottles into the bin. One empty bottle of scotch after another. Followed by an empty bourbon bottle. EXT./INT. TOLLER’S CAR - INNER CITY - DAY   (OMIT) 70   70 EXT. MEMORIAL HOSPITAL - DAY 71   71 He pulls his Toyota pulls into the parking structure. INT. MEMORIAL HOSPITAL -   NIGHT 72   72 MONTAGE of shots from a physical examination: --a scale is adjusted to record Toller’s weight --a   DOCTOR   takes his temperature --blood pressure taken -- The Doctor   taps his back --urine collected --blood drawn --chest x-ray  CUT TO: PARABLE OF THE RICH MAN  EXT. FIRST REFORMED - MORNING 73   73 Sunday morning. Tableaus of FIRST REFORMED. “Will God Forgive Us?” The sound of the organ comes from within.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 152
    },
    {
      "scene_number": 12,
      "slugline": "INT. SANCTUARY - MORNING 74   74 Ten worshipers are assembled in the SANCTUARY. Mary, wearing a smart coat, sits alone. Reverend Toller, sitting in the first pew, takes an antiacid from his pocket, slips it in his mouth. TIMECUT. Toller, at the pulpit, reads from the lectern Bible. TOLLER  “ ...and he said I will pull down my barns, and build greater and I will say to my soul, take thine ease, eat, drink, and be merry. But God said unto him, Thou fool, this night thy soul shall be required of thee. So is he that layeth up treasure for himself, and is not rich toward God. And he said unto his disciples, Take no thought for your life, what ye shall eat; neither for the body, what ye shall put on. The life is more than meat, and the body is more than raiment. ”  TIMECUT. John Elder speaks with Esther as they straighten the Psalters. ELDER He was out most of Friday. ESTHER He went to Albany?   For his checkup?  ELDER I kind of asked him but he didn’t volunteer anything. You know how he is. ESTHER Perhaps I can check. ELDER Esther. ESTHER It’s just that... ELDER I know.",
      "characters": [],
      "action_text": "They reach the front of the church. The door outside is open. Through the door Esther sees Toller speaking with Mary. He is smiling. She is stung by jealousy.  CUT TO: DIAGNOSIS  EXT. MEMORIAL HOSPITAL - DAY 75   75 A grey morning. INT. MEDICAL OFFICE - DAY 76   76 Toller sits opposite a white coated DOCTOR. Toller’s x-rays are on a computer screen. DOCTOR We like to do a gastroscopic exam. We lower a fiber optic camera down the throat and esophagus and take a look around. It’s an outpatient procedure with local anesthetic. You should be able to leave by mid afternoon. TOLLER That doesn’t sound good. DOCTOR We want to check for evidence of malignancy. TOLLER Cancer. DOCTOR It’s a possibility. Cancer is not the fearsome medical foe it once was. TOLLER What is the treatment? TOLLER Yes. DOCTOR How recently? (no response) I would like to schedule the gastroscopy as soon as possible. We have an open slot the week after next. What is your diet? TOLLER I get hungry, I eat. DOCTOR Do you smoke? (Toller shakes head) Drink? TOLLER In moderation. DOCTOR That needs to end. I’m writing a prescription that will help with the stomach pain. I want you to take nutritional   supplements. You should put on a little weight. Nutrihelp is a good over the counter supplement. Drink a bottle morning and night. Are you in pain now? TOLLER No. Actually, I feel quite good.  CUT TO: PRAYER CHAPEL  DOCTOR It depends on how advanced the tumor is. You stated that you have been experiencing discomfort? (checks records) Six months? (Toller nods) Diet, medication, chemo, even surgery. We have a variety of diagnostic tools. Have you had bloody stools?",
      "dialogue_count": 0,
      "word_count": 490
    },
    {
      "scene_number": 13,
      "slugline": "EXT. ABUNDANT LIFE - DAY 77   77 A snow plow maneuvers through parked cars. INT. A.L. MEDIA CENTER - DAY 78   78 State of the art communications hub. Sign on the wall: “Balq Media Center.” Media center employees sit at high tech work stations. A global Plexiglas map with sparkling lights and lines illustrates the worldwide evangelical partners of the Abundant Life Church. Joel Jeffers, dressed casually, addresses the camera in a SMALL STUDIO. A CAMERA ASSISTANT claps an electronic clapboard saying: CAMERA ASSISTANT Joel Jeffers, Daily Devotion number 174, take 2. Pastor Jeffers reads from the Teleprompter: JEFFERS “Refrain from anger and turn from wrath; do not fret--it only leads to evil. Psalm 37:8. We tend to think that a little anxiety and worry are simply an indication of how wise we are yet it’s a much better indication of how wicked we are. Fretting arises from our determination to have our own way. Our Lord never worried and was never anxious, because His purpose was never to accomplish his own plans but to fulfill God’s plans...” Esther looks out door, notices Toller walking down the corridor. She says to Mixer: ESTHER I’ll be back in a bit.",
      "characters": [],
      "action_text": "She rises from her seat, walks out. INT. A.L. SOUND STUDIO - DAY (OMIT) 79   79 INT. A.L. CORRIDOR - DAY 80   80 Esther catches up with him. ESTHER Reverend. TOLLER Hello, Esther. ESTHER I didn’t know you were coming. TOLLER Joel’s office wanted to go over the reconsecration program.   Has he discussed it with you ? ESTHER (nods) I’ll be at First Reformed. Stanley will be with the full choir here. The acoustics will be wonderful. I mean, wonderful. Did you hear from Albany? TOLLER (wary) Yeah. ESTHER What did they say? TOLLER Nothing much. More tests. ESTHER A gastroscopy. How does she know this? TOLLER And you know this how? Toller opens the door to the Prayer Chapel, motions for her to follow. They step into the darkened austere room. INT. PRAYER CHAPEL - DAY 81   81 He closes the door. He takes her shoulders: TOLLER Leave me alone. ESTHER I just want-- TOLLER I know what you want. I cannot bear your concern, you constant hovering. Your neediness. It’s a constant reminder of my failings and inadequacies. You want something that never was and never will be. She starts to cry. She seeks comfort. He doesn’t offer it. ESTHER Don’t make me do this. TOLLER Don’t you see yourself? ESTHER You don’t take care of yourself. TOLLER I despise you. I despise what you bring out in me. Your concerns are petty. You are a stumbling block.  CUT TO: FEELING BETTER  ESTHER (gives it up) I called. (explains) I’m worried about you.",
      "dialogue_count": 0,
      "word_count": 455
    },
    {
      "scene_number": 14,
      "slugline": "INT. PARSONAGE - NIGHT 82   82 Toller writes in his journal: TOLLER (V.O) I suddenly feel much better. I awoke early, clear-headed and immediately set about my daily tasks. INT. PARSONAGE BATHROOM - NIGHT 83   83 After brushing his teeth, Toller stops to examine his face in the mirror. He has lost weight. His skin seems a bit on the yellow side. INT. PARSONAGE - NIGHT 84   84 TIMECUT. NIGHT. Toller, in thought, walks around the parsonage. He goes to the   closet, removes   box where Michael’s EXPLOSIVE VEST has been placed. He removes the vest, examines the disconnected detonator wires. It’s a fearsome sight. TIMECUT. He researches types and characteristics of suicide vests and belts. Some of the literature is in English, some in Arabic. There are five types of vests, some utilizing dynamite, others Semtex, others C4. They vary in design and detonation features. Toller locates the vest before him: “Semtex Blocks #2. Hamas Style.” Foil wrapped 2500 gram vertical rectangles of Semtex attached to a Velcro belt with bungee cord and connected by wires to a push button detonator. He examines the vest. It’s beautiful and simple in design, power and intent. Web images show   GIF of a   suicide bomber attacks. TIMECUT. He writes in his journal. Next to him rests a half filled glass of scotch. He pours Pepto Bismol into the whiskey glass. Pink viscus fluid diffuses through clear amber.   He takes a sip.",
      "characters": [],
      "action_text": "TIMECUT. Toller lifts the vest, slips his arms into the straps, connects the Velcro tabs, looks at himself in the mirror. Adjusts the vests. Clerical. In a way. INT. BEDROOM - NIGHT 85   85 Late night. He sleeps in bed atop the blanket. Still dressed , he wears the vest.  TOLLER (V.O.) “Behold, I show you a mystery. We shall not all sleep, but we shall all be changed.”  CUT TO: THE SNAKE AND THE SQUIRREL  EXT. GRAVEYARD - DAY 85A   85A TOLLER, walking the barbed wire   which shakes through the hedgerow perimeter , stops when he notices something. A dead squirrel has gotten caught in drooping barbed wire. Toller uses his scratched bleeding hands to loosen the squirrel from the wire. He pulls at the wire compulsively, wrapping into a roll.  THE WOULD BE THIEF  EXT. PARSONAGE - DAY (OMIT) 86   86 EXT. CEMETERY - DAY (OMIT) 87   87 INT. SANCTUARY - DAY (OMIT) 88   88  CUT TO: RESEARCH  INT. TOLLER’S CAR - DAY 89   89 Toller is on the move in his Toyota. Driving here, driving there. America outside his car windows. Beautiful, sad, violated, polluted. EXT. BALQ PAPER INDUSTRIES   -   DAY 90   90 A sprawling industrial complex. INT. PAPER FACTORY - DAY 91   91 Toller walks behind a school group touring the Balq paper mill. They watch as massive machines transform pulp into paper. TOUR GUIDE Balg Home Products, makers of paper goods, fertilizers, everyday items for the household, was among the first companies to realize the need to address environmental concerns. Balq is green... INT. BALQ BUILDING - DAY 92   92 Toller drives past the four story dark glass corporate headquarters: Balq Industries.  CUT TO:  INT. UPSCALE JAPANESE RESTAURANT - DAY 93   93 TOLLER (V.O.) Today I stopped. I had Miso and fish. When was the last time? Such simple pleasures. Why do we deny ourselves? Toller, at the bar, sips sake as Ed Balq dines with top tier business companions at an overpriced restaurant.  CUT TO:  INT. TOLLER’S CAR - SUBURBS - AFTERNOON 94   94 LUXURIOUS SUBURB. Toller drives th",
      "dialogue_count": 0,
      "word_count": 1854
    },
    {
      "scene_number": 15,
      "slugline": "INT. PARSONAGE BEDROOM -   NIGHT 100   100 He sews a handmade patch onto the vest. It pictures José Cláudio Ribeiro da Silva and Maria do Espírito Santo, martyrs of the Amazon. He puts on a loose fitting dark work shirt over the vest. The vest is remarkably compact. He’s become so thin that the vest is hardly noticeable. TOLLER (V.O.) The stomach pains have returned. Yesterday I groveled on the floor, moaning like a sick beast. Will God’s grace ever shine on me?  CUT TO:  INT. MEMORIAL HOSPITAL WAITING ROOM - DAY 101   101 Toller wears his mended black sweater, but not the vest. He scans the room. A LOW INCOME MOTHER tends to her DISABLED 8 year-old. The Son looks at Toller. He is crushed by empathy. A NURSE steps out, calls his name: NURSE Reverend Toller? But he is gone.  CUT TO:  EXT./INT. TOLLER’S CAR - DAY 102   102 DAY AND NIGHT. Toller drives the streets in his Toyota. He wears the explosive vest under his dark work shirt. Past wealthy suburban homes, past inner city blight. TOLLER (V.O.) If one is awake, can he become more awake?  CUT TO:",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 193
    },
    {
      "scene_number": 16,
      "slugline": "EXT. HANSTOWN   KILLS   - PRE DAWN 103   103 THE DARK OF PRE DAWN. Toller, wearing the vest, stands in the moonlight. On the horizon the first eminence of sunrise. TOLLER (V.O.) Every act of preservation is an act of creation.   Everything   preserved renews creation. It’s how we participate in creation. EXT. HANSTOWN   KILLS   - DAWN 104   104 The sun rises. Toller is at HANSTOWN   Kills , the polluted stream where Michael’s ashes were spread.  CUT TO:  EXT. FIRST REFORMED - DAY 105   105 John Elder, kneeling beside the Plexiglas sign (“Will God Forgive Us?”), removes the letters.  CUT TO:  INT. SOUP KITCHEN - DAY 106   106 Toller stands with fellow volunteers dispensing hot lunches to the down and out. He wears a dark sweater. The wheel chair Vet waits for a hot lunch in the line of down and outers. The vest is under Toller’s sweater.   A red wire pokes through the dark fabric. CUT TO: THE DARKEST HOUR",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 160
    },
    {
      "scene_number": 17,
      "slugline": "EXT. FIRST REFORMED - MORNING 107   107 The church sign reads: “Next Sunday, 250th Reconsecration Service. Praise God.”  CUT TO:  EXT. ABUNDANT LIFE CHURCH - DAY 108   108 Toller’s Toyota pulls into the parking lot.  CUT TO:  INT. JEFFERS’ OFFICE - DAY 109   109 Toller enters Joel’s inner office. JEFFERS Close the door. Take a seat. Jeffers sips from a plastic water bottle, lifts it as if to say, “Want one?” Toller shakes his head. Jeffers sits. JEFFERS (CONT’D) We’re concerned about you. TOLLER Who is? JEFFERS How’s your health? TOLLER I need some more tests. JEFFERS You didn’t get the results? Toller shakes his head, eyeing Jeffers. Where is he getting his information? JEFFERS (CONT’D) How’s your diet? To be honest, you don’t look so good.",
      "characters": [],
      "action_text": "Toller: Huh? JEFFERS (CONT’D) Jesus wasn’t always in the Garden, on his knees, sweating drops of blood. No, he was on the Mount, in the temple, in the marketplace. But you’re always in the Garden. For you every hour is the Darkest Hour. Don’t confuse Post Traumatic Stress with the Holy Agony. TOLLER I didn’t know I had given offense. JEFFERS Jesus doesn’t want our suffering. He suffered for us. He wants obedience and commitment. TOLLER But what of His creation? The Heavens declare the glory of God. He is everywhere present. In the plants, the rivers, in the smallest insect. The world is a manifestation of God’s presence. This is an issue where we can lead. But what does the church say? Nothing. The U.S. congress deny climate change. Where were we when these people got elected? (MORE)  TOLLER I’ve been having some stomach trouble. JEFFERS I hear you’ve been drinking. TOLLER Just a little wine with dinner. JEFFERS Wine? That’s not advisable for a man with stomach problems. TOLLER I’ve got to take better care of myself. JEFFERS You’re always in the Garden. That hangs in the air a moment. Jeffers changes tack, offers solicitude:  TOLLER   (CONT'D) We know who spoke for big business. Who spoke for God? JEFFERS  “ The creation waits in eager expectation of liberation from bondage. The whole creation groaneth and travaileth in pain together until now. ”  TOLLER We should pollute so God can restore? We should sin so God can forgive? I don’t think that’s what the Apostle meant. We need to see through Jesus’ eyes, see every living thing. JEFFERS You don’t live in the real world. You’re a minister in a tourist church that no one attends. Do you have any idea what goes into the work of God? What it takes to maintain a mission such as this? The daily cost, the staffing, the outreach? How many people we reach each day?   Who’s that priest you like so much? Thomas Merton? He didn’t live in the real world either. He was a monk. He lived in a monastery in Kentucky and wrote books. T",
      "dialogue_count": 0,
      "word_count": 1872
    },
    {
      "scene_number": 18,
      "slugline": "INT. PARSONAGE   BEDROOM   - DAY 131   131 At the table, he looks at the open can of Drano, prepares to drink. He raises the bottle to his lips. Prepares to chug it down. The door RATTLES, then opens. He looks up. Mary   enters . The Drano drops from his hand, spills across the floor. MARY Ernst? He stands. ESTHER (O.S.) “What have I to dread, what have I to fear, Leaning on the everlasting arms? I have blessed peace with my Lord so near, Leaning on the everlasting arms.” Mary approaches Toller. He steps forward, takes her in his arms. The camera MOVES FOR THE FIRST TIME. It dollies forward and around, swimming with their embrace. She GASPS and presses her open mouth in SLOW MOTION to his cheek. Toller responds to her carnal embrace in kind, devouring her, as the camera turns and turns and until it suddenly stops. The screen goes BLACK. THE END   *",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 158
    }
  ]
}