{
  "slug": "first-cow-2020",
  "title": "first cow",
  "genre": "action",
  "format": "film",
  "scenes_count": 13,
  "characters_count": 0,
  "characters": [],
  "total_words": 14009,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. DRY POND BED - DAY On the edge of a suburban neighborhood, THREE THIRTEEN YEAR OLD KIDS play in a muddy pond bed. The dry pond bed resembles a giant ashtray. Weeds grow through the damp earth. Down below, in the center of the dry pond, ARTHUR attempts to arrange a bounty of discarded motorcycle tires. The tires are heavy and ill-shaped. His efforts ultimately amount to a random pile of tires. CHRIS stands above with a tire of his own. Arthur runs from the pile of tires. ARTHUR Let’er rip! From the far end of the pond, JAMIE looks up and watches as Chris lets his tire fly, his arms already in the air, making a victorious “V.” The tire rolls down the edge of the pond, hits a rock and goes veering off course. ARTHUR (CONT’D) Ah, damn it. Chris and Arthur retrieve the fallen tire and roll it back up the hill. Jamie returns to her earth drawing. She uses a stick to carve through the thick, clay-like soil. With nothing particular in mind, she drags her stick in whatever direction the earth-drawing spirits guide her. Soon her stick runs into something protruding through the ground. She goes over to examine it more closely. At her feet is something white and rounded. Jamie, begins to dig around the shape of the protruding object. She discards her large stick and swaps it out for a smaller one. Crouching on her hands and knees, she sets to work uncovering the mysterious object. As the thick dirt is scraped off -- a human skull emerges.",
      "characters": [],
      "action_text": "CREDITS BEGIN Jamie stares at the discovery. She continues unearthing. EXT. DRY POND BED - LATER - DAY The sun is high behind the clouds. Arthur and Chris have joined in the excavation, carefully moving excess mud away from the uncovered bones. As Jamie works, a full human skeleton is being uncovered. EXT. DRY POND BED - LATER - AFTERNOON Chris scavenges around the pond. He finds a piece of rag stuck in the earth. After a brief tug-of-war, he yanks the rag free. With his tee shirt pulled over his nose and mouth, he shakes out the rag. He runs the dirty cloth over to where Jamie and Arthur are working doggedly, covered in dry mud. A second skeleton is emerging. EXT. DRY POND BED - LATER - LATE AFTERNOON The afternoon ages. Chris has fashioned his rag into a brushing tool. The three kids work carefully. Finally, stepping back to fully realize their discovery. Two full skeletons have been revealed. They lie side by side, holding hands. Jamie and the boys stare at the remains with amazement and reverence. CREDITS END EXT. WOODS - CIRCA 1820 - DUSK A dense rain forest. 2 On the ground, ferns and moss-covered rocks and disintegrating trunks. Overhead, a canopy of needles and lichen-draped limbs. All around, the fir trees form melancholy aisles into the gloom. The last light of day sifts through. OTIS “COOKIE” FIGOWITZ, the hired cook for a fur trapping expedition, prowls for mushrooms. He’s bearded, tentative, and dirty. From the distance, rough laughter and yelling drifts to his ears. Men’s voices muffled by the woods. He walks deeper into the woods clutching his basket. EXT. WOODS - CONTINUOUS - DUSK Cookie keeps hunting. The voices fade and disappear. He’s alone in the silence of the primordial forest. He can hear the smallest sounds of crackling twigs, scurrying bugs. He finds some mushrooms and puts them in his wicker basket. EXT. WOODS - CONTINUOUS - DUSK He bends to examine a bug. His own breath is the only sound. The bug is shiny and desperate. The bug can barely ",
      "dialogue_count": 0,
      "word_count": 3281
    },
    {
      "scene_number": 2,
      "slugline": "EXT. FORT - CONTINUOUS - DAY The little girl wanders past the traders Cookie just left. She enters the fort’s walls. And Cookie enters behind her. INT. FORT - CONTINUOUS - DAY A guarded warehouse for furs. A watchtower. A saloon. A kitchen garden. The little girl wanders across down the single row of ad-hoc buildings. Cookie follows. She goes into the saloon, passing through it’s burlap door. Cookie waits outside. He can hear the boisterous sounds of the saloon’s PATRONS from outside. Laughter and the stomping of boots. Soon, the little girl exits with her bucket sloshing with beer. She belches loudly and walks past Cookie, and back out the gate of the fort. Cookie has nowhere to go but into the saloon. INT. SALOON - CONTINUOUS - DAY Cookie enters the bar. The air is hot and filled with smoke. It’s a long, dirty room with a wood stove and a tattered blanket on the wall. Some of the men speak the Chinook trade jargon. He sits at the bar facing himself in the long mirror. He looks small and pale compared to the rough men around him. Timidly, he orders: COOKIE Whiskey, please. The drink appears. BARTENDER Two. 17",
      "characters": [],
      "action_text": "COOKIE Two what? Cookie holds out his money. The bartender takes two coins. Cookie sips his drink as the PATRONS-soldiers, sailors, trappers, Indians, etc.—-keep laughing and gambling, playing poker and mahjong. The bar is filled with competing voices and competing stories. The men talk about health problems, grand plans, card games, foreign countries. All the talk mixes together and cancels each other out. Among the conversations, Cookie picks up on one in particular, and tries to catch some of its details. LLOYD First one in the Territory. Shipped it all the way up from San Francisco. SAILOR San Luis Obispo is what I   heard. LLOYD (to the sailor) I think I’d know. SAILOR (shrugs) I heard San Luis Obispo. LLOYD (ignoring the sailor) He bought two cows. And a calf. But the other ones died on the way. MAN What good’s one cow to anyone? Cow needs a stud. LLOYD Chief Factor wants milk in his tea. (putting on airs) Like a proper Englishman. MAN Like a proper lady. They laugh. SAILOR This ain’t a place for cows. God would’ve put cows here if it was. 18 LLOYD No place for white men either then. Cookie listens, imposing himself into the cow’s part. As he sips his drink and eavesdrops, a BIG, TOUGH-LOOKING MAN walks into the saloon. With him is a BABY, swaddled, in a basket. They sit beside Cookie at the bar. The big guy orders a beer. He sets the baby on the bar. Cookie keeps to himself, making eyes with the baby. But behind him, a bar patron, PAT, has noted the new arrival and can’t keep his mouth shut. PAT Look who’s here. Brilliant William. Hey, I need a few sun beams, William. Can you gather me up a dozen sun beams? Any old beams will do. The big guy ignores the show off, Pat. He drinks and stares at the bar. PAT (CONT’D) Here’s a question. What does a tongue taste like? You ever think about that? I bet you have some distinct notions about what your tongue tastes like. I do. Some of the other men in the saloon laugh. William is not pleased but stays focused on his dri",
      "dialogue_count": 0,
      "word_count": 2439
    },
    {
      "scene_number": 3,
      "slugline": "EXT. WOODS - DAY Cookie walks in the woods with his basket, gathering herbs and berries. EXT. CLEARING NEAR CHIEF FACTOR’S HOUSE - CONTINUOUS Beyond the trees, in a clearing, is the cow, grazing. Cookie stares at the cow. It’s eyes are big and brown. It’s coat shines in the sun. The cow is a glorious creature, even more beautiful so far from home. INT. KING-LU’S HUTCH - LATE AFTERNOON Cookie cooks. King-Lu is mending a pair of pants. COOKIE I found the cow today. KING-LU Did you now. King-Lu keeps mending. COOKIE It isn’t far from the Chief Factor’s house. In a meadow. I’d like some of that milk. KING-LU I’m not a milk drinker. Doesn’t agree with me. COOKIE I wouldn’t drink it. I’d use it for cookies, or scones. There’s nothing better than buttermilk biscuits. I’m tired of this water and flour bread. King-Lu finishes mending. He cuts the thread with his teeth. KING-LU So’s everyone. King-Lu shakes out his pants and steps into them. He gazes down at the hem of his pants. 29",
      "characters": [],
      "action_text": "KING-LU (CONT’D) (staring at his feet) What else would you need for good biscuits, Cookie? COOKIE Flour, some sugar, salt, baking soda. KING-LU (looking towards Cookie) How long does it take to milk a cow? COOKIE Not long. KING-LU Make much noise? COOKIE No. KING-LU Can cows give milk at night? COOKIE As long as she wasn’t milked after dinner. An idea is hatched as King-Lu looks deviously at Cookie. Cookie shakes his head, no. King-Lu shakes his head, yes. EXT. WOODS NEAR CHIEF FACTOR’S HOUSE - NIGHT An owl hoots. Cookie and King-Lu sneak through the woods with a bucket. They keep moving and soon arrive at the edge of the cow’s meadow. They find the cow in the moonlight. EXT. EDGE OF COW MEADOW - CONTINUOUS - NIGHT King-Lu climbs a tree at the edge of the clearing to stand guard. 30 KING-LU (whispering) If I see anything, I’ll give a call. I’ll do an owl. Who-who. COOKIE (looking up) All right. EXT. COW MEADOW - CONTINUOUS - NIGHT Cookie gently approaches the cow. The cow lows softly. Cookie speaks to her softly. COOKIE How are you? Didn’t expect company so late at night, did you? Well. Here we are. Cookie kneels and begins milking the cow. COOKIE (CONT’D) Sorry about your husband. I heard he didn’t make it all the way. And your calf... That’s a terrible thing. Terrible. But you’ve got a nice place here. Nice grass. Nice trees. You’ve got a very nice little place here, don’t you? The cow is happy to have Cookie nearby. EXT. TREE - CONTINUOUS - NIGHT From the branches, King-Lu watches vigilantly. Across the meadow, the dim lights of the Chief Factor’s house. Down below, Cookie milks. The streams of milk splash in the bucket. EXT. COW MEADOW - CONTINUOUS - NIGHT Cookie rises. He nods at King-Lu. COOKIE (to cow) Thank you. 31 King-Lu descends. They retreat back into the forest. INT. KING-LU’S HUTCH - BEFORE DAWN Cookie makes biscuits. He turns the butter using a small makeshift churn. He mixes the ingredients. He cooks the batch in a Dutch oven in the stone hearth. EXT",
      "dialogue_count": 0,
      "word_count": 1445
    },
    {
      "scene_number": 4,
      "slugline": "INT. KING-LU’S HUTCH - LATER - AFTERNOON Cookie and King-Lu are back home, their money stacked on the rustic table. KING-LU Fifty silver, three gold. A pretty little package for a few day’s work. COOKIE You could buy an acre in California for that. KING-LU Or build something on the property we’ve got staked here. It’s a start all right. It won’t last much longer, though. COOKIE No? KING-LU No, they’ll get tired of it. And more milk cows will be here soon. We’ve got a window here, that’s all. Make hay while the sun shines. They regard their money. KING-LU (CONT’D) This is too much to keep in the house, Cookie. We need a bank. COOKIE How about the cottonwood tree? There’s a good hole in the trunk. King-Lu concurs. They walk outside. EXT. KING-LU’S HUTCH - CONTINUOUS - AFTERNOON King-Lu goes over and puts the money in the tree as Cookie watches. King-Lu has to climb onto a piece of wood to reach the hole. COOKIE I wish I could buy a real butter churn. 37",
      "characters": [],
      "action_text": "KING-LU Wish you could, too. I’ll help with the churning tonight. COOKIE What now? KING-LU Swim? EXT. RIVER - DAY Cookie and King-Lu romp in the cold water, enjoying their afternoon of leisure. EXT. FLEA MARKET - NEXT DAY Cookie and King-Lu arrive at their spot. A GROUP OF CUSTOMERS is already waiting for them. They begin to set up when Lloyd, the Company man, draws near. Thomas staggers behind him. LLOYD (to Cookie) Hold one out today. The Chief Factor wants one. He’ll be here soon. Cookie hears him. His gaze seeks King-Lu. He lights the fire. Behind Cookie, Lloyd smacks Thomas on the back of the head for loitering about. LLOYD (CONT’D) (to Thomas) Don’t you have some work you should be doing. King-Lu is already selling to the gathered men. EXT. FORT - SOON The gate opens and the CHIEF FACTOR emerges from the fort. He’s a stately, imposing figure, older and more dignified than anyone else in the territory. He has wild white hair and mutton chops, and wears a waistcoat with starched collar. He walks the short path from the fort with a decorative cane. 38 He nods to some passing CITIZENS, but walks directly to the oily cake area and comes to a stop. Cookie and King-Lu look at him expectantly. CHIEF FACTOR I’ve heard about your cakes. I’d like to try one, if I may. How much? KING-LU Yes, sir. For you, only ten silver pieces. He pulls his purse from his coat and pays. Cookie prepares him an oily cake. COOKIE A little cinnamon is nice. Cookie offers a small sprinkle of cinnamon. The Chief Factor eats. He loves it. CHIEF FACTOR I taste London in this cake. A bakery in South Kensington I once knew... Astonishing. How did you do this? COOKIE I was indentured to a baker in Boston, sir. He taught me the trade. CHIEF FACTOR He was a good baker. COOKIE Indeed. He was. CHIEF FACTOR What was his name? COOKIE Barnaby Furnace. CHIEF FACTOR Never heard of him. I commend you on a delicious baked good, sir. I hope you won’t be moving on too soon. 39 KING-LU We have no plans. The Chie",
      "dialogue_count": 0,
      "word_count": 2664
    },
    {
      "scene_number": 5,
      "slugline": "EXT. MEADOW - CONTINUOUS - NIGHT The cow is a little skittish. She shuffles away from Cookie. COOKIE There, there. Shhhh. The sound of the milk spraying in the bucket. Shhh. Shhh. Cookie milks. EXT. TREE - CONTINUOUS - NIGHT In his tree, King-Lu watches the shadows from above. In the meadow, Cookie milks, lightly pressing his head against the cow’s side. Over at the house, a small flicker of light from a single window. INT. SERVANT’S BEDROOM - CONTINUOUS - NIGHT The servant lays in bed reading by the light of his lantern. He lowers his book and lies listening, thinking.   Finally, he gets out of bed, putting on his slippers. EXT. TREE - CONTINUOUS - NIGHT King-Lu watches the small light move from one room in the house to the next. The back door opens and out steps the Chief Factor’s servant, holding his lantern. EXT. CHIEF FACTOR’S HOUSE - CONTINUOUS - NIGHT The servant peers into the darkness. SERVANT Psst. (Whispering) Come on back. Come on back you stupid cat. Psst. Psst. He shines his light about the area, landing on the cat. The cat’s eyes open wide. SERVANT (CONT’D) Ah, there you are... The cat runs into the night. 52",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 205
    },
    {
      "scene_number": 6,
      "slugline": "EXT. TREE - CONTINUOUS King-Lu gives the warning call. KING-LU Who.. EXT. MEADOW - CONTINUOUS KING-LU Who... Cookie stops milking. EXT. CHIEF FACTOR’S HOUSE - CONTINUOUS - NIGHT In his slippered feet, the servant walks further towards the meadow. SERVANT Inside before you get me in trouble. A CRACKING SOUND FROM THE MEADOW. The Servant holds his light out in the direction of the cow. SERVANT (CONT’D) Who’s there? EXT. TREE - CONTINUOUS - NIGHT King-Lu keeps very still. EXT. MEADOW - CONTINUOUS - NIGHT Cookie is hunched low behind the cow. The meadow and surrounding woods are as silent as they can be. EXT. CHIEF FACTOR’S HOUSE - CONTINUOUS - NIGHT The servant stands weary, holding his lantern higher... Another long CRACK... 53",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 125
    },
    {
      "scene_number": 7,
      "slugline": "EXT. TREE - CONTINUOUS - NIGHT A branch breaks! A thrashing, clunking tumble as King-Lu falls from the tree. KING-LU Argh! King-Lu hits the ground with a loud thud. He can’t help but groan. EXT. CHIEF FACTOR’S HOUSE - CONTINUOUS - NIGHT The servant runs inside. EXT. MEADOW / TREE - CONTINUOUS - NIGHT Cookie abandons the bucket and stool and goes to King-Lu. COOKIE (whispering) Are you all right? King-Lu grunts. KING-LU (in pain) Shhh. EXT. CHIEF FACTOR’S HOUSE - CONTINUOUS - NIGHT In his nightgown and slippers, the servant runs back outside, and across the yard in another direction, towards a bunk house. INT. BUNK HOUSE - CONTINUOUS - NIGHT The servant pushes open the door and kicks the man sleeping on the bottom bunk. It’s Lloyd. LLOYD What? SERVANT Something, someone in the meadow! An attack. A SET OF LEGS fall down from the bunk above Lloyd, knocking him in the head. 54",
      "characters": [],
      "action_text": "LLOYD Goddamn it, Thomas! SERVANT I’ve alerted the house. Get dressed, hurry! The servant rushes out in the same flurry he came in. Lloyd pulls on his pants. Grabs his guns. Thomas jumps down from the upper bunk and starts putting on his boots. LLOYD Just where the hell do you think you’re going? Lloyd laughs at the idea of it. EXT. MEADOW NEAR THE TREE - CONTINUOUS - NIGHT Cookie and King-Lu crouch in fear. King-Lu in pain, too. He clutches his shoulder, getting his breath back. COOKIE Can you move? We have to go! The cow is between them and the house. The Chief Factor comes out of the house with his gun in hand. And the Captain. King-Lu holds his hand up to stop Cookie from talking. CHIEF FACTOR You there. Come out! They stare at each other in silent, appalled communication. The Chief Factor fires his gun. Time to run. Cookie and King-Lu get to their feet and make a run for it. EXT. CHIEF FACTOR’S HOUSE / MEADOW - CONTINUOUS - NIGHT The Chief Factor and the Captain run out across the meadow to where the cow stands. EXT. WOODS - CONTINUOUS - NIGHT Cookie and King-Lu plunge into the woods. 55",
      "dialogue_count": 0,
      "word_count": 364
    },
    {
      "scene_number": 8,
      "slugline": "EXT. CHIEF FACTOR’S HOUSE / MEADOW - CONTINUOUS - NIGHT The Chief Factor and Captain arrive at the cow, followed by the servant, out of breath, carrying holsters, guns and the Chief Factor’s pants. The Chief factor puts on his pants. Lloyd arrives. Cookie’s milking stool and bucket lay on the ground. Amused, the Captain rights the stool with his boot. CAPTAIN It would appear someone has been milking your cow. CHIEF FACTOR (seeing the stool) Mr. Figowitz! EXT. WOODS - CONTINUOUS - NIGHT Cookie and King-Lu run. Cookie bends onto the path leading home. But King-Lu grabs him. KING-LU No. Not home. Keep going. They run deeper into the woods. EXT. WOODS - CONTINUOUS - NIGHT They make their way through the brush. The sound of a distant gun shot. EXT. WOODS / CLEARING / CLIFF - CONTINUOUS - NIGHT They come to a clearing before a cliff. Down below is a rushing river. The moonlight shines in the current. Behind them, rising sounds. 56",
      "characters": [],
      "action_text": "Without a word, they agree to jump. They need a good start to clear the bank below. Cookie looks doubtful. King-Lu looks resolved. They back up for a running start. They run, full tilt. King-Lu jumps off the cliff into the night. Cookie is too afraid. He doesn’t jump. Peering over the edge, into the darkness, he hears the splash of King-Lu’s landing. EXT. RIVER / SHORE - CONTINUOUS - NIGHT King-Lu emerges. And begins thrashing towards shore. He scrambles ashore. King-Lu looks around realizing Cookie hasn’t jumped. He looks up in the darkness, he can almost make out Cookie, He gestures for Cookie to jump. EXT. CLIFF ABOVE THE RIVER - CONTINUOUS - NIGHT Cookie stands at the edge of the cliff unable to see his friend below, still unable to make himself jump. EXT. RIVER SIDE BELOW CLIFF - CONTINUOUS - NIGHT King-Lu gestures again, more angrily. Unable to see Cookie, he gives up and flees. EXT. WOODS / CLEARING / CLIFF - CONTINUOUS - NIGHT Cookie, hearing the approaching men, hides in a bush. From his hiding place, he can see The Chief Factor, the Captain and Lloyd as they arrive at the clearing. THE CAPTAIN Which way? They are looking about for movement, listening for sound. Lloyd notices footprints. With his lantern, he follows the prints to the edge of the cliff. 57 They all go to the cliff and look over. Lloyd keeps snooping, following another set of prints over to the edge of the brush. Cookie lays low and still as the lantern light sweeps above him. CHIEF FACTOR (OS) Lloyd, you get down there. There’s a path upriver. I’m going to kill that little invert so help me god. Stealing my milk. The men split up. The Chief Factor and The Captain run right by Cookie’s head. When things settle down, Cookie creeps from the bush and heads in the other direction. Behind him, the known world recedes. EXT. WOODS - NIGHT King-Lu passes looming trees, pushes through thick ferns. The sound of the river close by. EXT. WOODS - ELSEWHERE - NIGHT The forest is dark. Cookie hikes, fearful",
      "dialogue_count": 0,
      "word_count": 608
    },
    {
      "scene_number": 9,
      "slugline": "EXT. WOODS NEAR A RIVER - NIGHT A cloud passes over the moon and the world is thrown in shadow. In the same silence, King-Lu pauses to gain his bearings. Beyond the trees, the water barely seems to move. King-Lu waits, listening, smelling, sensing the best path through the hidden world. INT. COTTAGE - PRE DAWN Cookie awakens in a humble cottage. His face is bruised and swollen. Through his dimming consciousness An OLDER COUPLE comes into view. Across the room, the man sits in a chair, smoking a pipe. The woman brews a poultice on the stove. They have white hair, shabby but dignified clothes, and an air of almost spooky peace. The room darkens, Cookie is out again. INT. COTTAGE - MORNING Cookie again opens his eyes. Through a watery softness, he sees the couple hovering over him. They appear Hawaiian. The woman offers him a bowl of steaming fluid. Cookie smells it and recoils. WOMAN Drink, drink. It will make you feel better. Cookie drinks, wincing. He’s thirsty. COOKIE (discombobulated) Where am I? WOMAN No one will find you here. COOKIE Who are you? WOMAN Have a drink. You’ll feel better... 59",
      "characters": [],
      "action_text": "Cookie takes a few more sips, then resting his throbbing head. He struggles against sleep but the room quickly dims. INT. COTTAGE - DAY Cookie awakens. He is alone. Cookie touches his swollen face, his cracked head. He looks around, trying to focus. A round mirror hangs on a post across from his bed. Through it, he can see the old man outside a window. He is doing tai chi. The motions are slow and mysterious. The old woman is at the stove. Cookie watches her from his sick bed as she stirs a large pot, her shadow large on the cottage walls. Cookie speaks to the woman from his sick bed. The sound of his own voice rings in his head. COOKIE I... I need to find my friend. WOMAN You are safe here. Nothing can harm you. The man continues his slow, deliberate motions in the mirror. COOKIE But... my friend doesn’t know where I am. The woman finally turns to face him. She is suddenly young, looking like an angel. She holds a baby in her arms. WOMAN He wants you to rest. If he is a true friend. EXT. WOODS / RIVER SIDE - DAY Feet walk on the rough ground. King Lu emerges from the woods. He goes and sits by the river. He takes off his shoes and soaks his sore feet. 60",
      "dialogue_count": 0,
      "word_count": 425
    },
    {
      "scene_number": 10,
      "slugline": "EXT. RIVER SIDE - DAY King Lu keeps to the river’s edge as he continues his journey up river. He maneuvers the rocks and tree roots. EXT. RIVER SIDE - DAY King-Lu comes around a bend in the river. He spots a beached canoe. He ponders the canoe. A small, wooden one. A LARGE DOG sits inside it. No one else is around. King-Lu goes closer to the canoe and admires it. He keeps his distance, unsure of the dog. He is thinking how to steal the canoe, when a CHINOOKAN MAN emerges from the brush. The man stands and watches him grimly. King-Lu greets him in the trade jargon. They speak in the shared trade jargon. KING-LU Good day. CHINOOK MAN Hello. KING-LU I need to get upriver. Can you take me in this canoe? CHINOOK MAN I don’t think I can. No. KING-LU I need to go. CHINOOK MAN How much would you pay? KING-LU I don’t have much on me. What do you want? CHINOOK MAN A knife? 61",
      "characters": [],
      "action_text": "KING-LU I don’t have a knife. CHINOOK MAN How about a bell? KING-LU A bell? CHINOOK MAN One of those metal cups with the little tongue inside and when you shake it it makes the sound: dinga ling a ling? KING-LU No, I don’t have a bell either. CHINOOK MAN What do you have? King-Lu looks himself over. Nothing. CHINOOK MAN (CONT’D) Those buttons. The Chinook man nods at his buttons. King-Lu looks down. King-Lu pulls all the buttons from his coat. The Chinook man seems pleased enough. EXT. RIVER - CONTINUOUS - AFTERNOON The dog rides up front as they slide over the water. The Chinook man paddles steadily from the rear. King-Lu is relieved to be moving. EXT. RIVER - CONTINUOUS - AFTERNOON They continue paddling along. The Chinook man is uncommunicative. KING-LU I’m going near the fort. Not to the fort. But near. The Chinook man seems to hear. 62 He keeps paddling. In the distance: another canoe. The Chinook man sees the distant canoe. He raises a hand in greeting. The ROWER in the distant canoe raises a hand in greeting. They call out to each other over the water. The Chinook man alters course. They head for the other canoe. KING-LU (CONT’D) Wait. What are you doing? I need to get upriver. Quickly. CHINOOK MAN Don’t worry. They continue towards the other canoe. King-Lu has no way out. EXT. RIVER - CONTINUOUS - AFTERNOON King-Lu and the Chinook man pull up next to the other canoe. In the other canoe is a young Chinook man with a few large fish. The two Chinook men talk in their native tongue. King-Lu waits in anger and disbelief. At last, the other canoe starts to move. And Cookie’s canoe follows. KING-LU What are we doing? They head for the opposite shore. KING-LU (CONT’D) You’re taking me upstream. I paid you. CHINOOK MAN I am. I am. 63",
      "dialogue_count": 0,
      "word_count": 492
    },
    {
      "scene_number": 11,
      "slugline": "EXT. OPPOSITE RIVER BANK - CONTINUOUS - AFTERNOON The canoes beach. The dog jumps out and goes to shore. The Chinook men get out, the one with his fish. King-Lu grudgingly waits. EXT. RIVER SLOUGH - CONTINUOUS - AFTERNOON The Chinook men walk into a reedy part of the river. A YOUNG WOMAN with a BABY tied to her back is digging for wapato roots in the marshy earth. The Chinook men call greetings to the woman, she vaguely greets them back. King-Lu’s ride goes over and talks to the younger women. EXT. CANOE - CONTINUOUS - AFTERNOON The afternoon is wearing on. King-Lu watches his ride talk to the young woman. Frustrated, he gets out of the canoe and goes to catch up with his ride. EXT. RIVER SHORE - CONTINUOUS - LATE AFTERNOON The other man, meanwhile, goes under some trees and takes a nap. EXT. RIVER SLOUGH - CONTINUOUS - LATE AFTERNOON King-Lu approaches the Chinook man, watching as he hovers around the young woman collecting her wapato. She doesn’t respond to the Chinook man, he appears unhappy. EXT. SHORE - CONTINUOUS - AFTERNOON The Chinook man goes over to ANOTHER WOMAN who kneels on the shore. He starts talking to her. She responds to him without stopping her work or turning to face him. She doesn’t seem to tell him what he wants to hear. 64",
      "characters": [],
      "action_text": "King-Lu waits politely while the two continue talking. It goes on and on until King-Lu can’t stand it any longer. KING-LU I need to go upriver! Take me or give me back my buttons! Hearing King-Lu’s voice, the woman turns around. The Chinook man looks at King-Lu without expression. He takes the buttons from his pouch and hands two of them back to King-Lu. KING-LU (CONT’D) All of them. CHINOOK MAN I took you part way. KING-LU I’m not any closer than I was! CHINOOK MAN You are. The woman comes over to inspect the buttons in King-Lu’s hand. KING-LU (his hand open) I’m not. I’m on the wrong side of the river. Give me all of them. This wasn’t the deal. Reluctantly, the Chinook man gives King-Lu back the rest of the buttons. King-Lu is despondent. The woman says something to the Chinook man. He says something back. The Chinook man turns back to King-Lu. CHINOOK MAN Give me the buttons back. I’ll take you upriver. KING-LU I need to go right now. CHINOOK MAN Good. KING-LU No waiting. No other stops. 65 CHINOOK MAN Good. KING-LU (sensing his new advantage) I’ll give you three buttons. CHINOOK MAN All the buttons. KING-LU Three buttons. I’ll give you two more when we get near the fort. CHINOOK MAN Three buttons. KING-LU Depends on how fast we get there. Fast, three. Slow, one. The Chinook man ponders, displeased. He looks at the woman. Grudgingly, he agrees. EXT. RIVER - LATE AFTERNOON The canoe skims across the water. King-Lu grimly watches the horizon. INT. COTTAGE - NIGHT Cookie rises. His head throbs. The couple sleeps. Agonizingly, he leans over to put on his shoes. He creeps outside. EXT. COTTAGE - CONTINUOUS - NIGHT Cookie makes his way through the darkness to the edge of the clearing. He stands before the wall of trees. He stares blearily into the blackness, hearing the howls of hungry animals. Nearby wolves. Distant coyotes. 66 The trees stretch and bend taking on the shape of the wind. The eyes of many beasts shine in the rolling waves of the ferns and tall brush. Af",
      "dialogue_count": 0,
      "word_count": 747
    },
    {
      "scene_number": 12,
      "slugline": "EXT. KING-LU’S HUTCH - CONTINUOUS - MORNING King-Lu approaches the hutch. Before anything, he stops at the cottonwood tree. He gets a round of wood to stand on to retrieve the money sack from the hole. He can’t quite reach it. He pulls it part way out and it snags on a branch. Now the bag is hanging from the tree. He tries to unsnag it but he pauses, suddenly alert. He hears something. He looks into the distance. He jumps down. He kicks away the round of wood. Just in time, he scurries away and hides back in the bush he just came out of. THREE COMPANY SOLDIERS, led by Lloyd, are marching in his direction. They enter King-Lu’s abode. King-Lu can hear things breaking, smashing, thumping around. A few items fly out of the door and window. He watches as the soldiers finally exit, laughing. They loiter for a moment, the money sack hanging over them the whole time. A soldier goes and pisses on the cottonwood tree, the money bag over his head. At last, they disappear. King-Lu remains in hiding, crouching in fear and contemplation. EXT. KING-LU’S HUTCH - SOON - MORNING Finally, King-Lu approaches the now-ruined hutch. INT. KING-LU’S HUTCH - CONTINUOUS - MORNING King-Lu goes inside. The house is a shambles. He begins to put a few things in bags. 68",
      "characters": [],
      "action_text": "He lifts Cookie’s broken churn. He puts it aside. He picks up Cookie’s whisk, also broken. He sets down the bags. No point in saving any of it. He picks up a fire poker. EXT. KING-LU’S HUTCH - CONTINUOUS - LATE MORNING He uses the fire poker to fetch the money bag. He calls: “Who Who.” No answer. And he wanders into the woods. INT. COTTAGE - DAY Cookie awakens. He is alive. He is also alone. The old couple are gone. In the dim light of day, the cottage is less terrifying. The fire is out. There is no sign of the night’s horror. But a weird emptiness. Cookie rises. He looks around. The cottage is dusty, filled with many interesting things. The decor is part native, part Pacific Islander, part antique European, part everything. Strange masks, stuffed birds, hanging herbs and dried roots. The cobwebs cover the objects as if they haven’t been touched in a very long time. He sees a jug on the table. He goes to drink. But it’s dry. He goes to the door. Something is blocking it from opening more than a few feet. He slips out. EXT. COTTAGE - CONTINUOUS - DAY The door is blocked by overgrown weeds and vines. The whole yard is unkept. No sign of the couple here, either. Cookie pauses at the outskirts of the cottage’s clearing. He turns to look back at it. 69 The feeling in the clearing is eerie. The wind is alive, moving leaves and needles on the dry ground. It has the feel of a place that has been deserted for a long time. Cookie creeps away into the woods. The boughs of the trees close behind him. He is leaving for good. EXT. STREAM - DAY YOUNG Thomas stands behind a tree watching Cookie who is across the stream. Unaware he is being watched, Cookie lays on the ground drinking the cool water. He washes the dark dry blood from his head. He stares into the stream. As the water stills, his reflection takes shape. He touches his sore head, rubs his jaw. He hears a sound and sits up, looks around. Thomas remains unseen behind his tree. EXT. WOODS / BLUFF - DAY Cookie climbs throu",
      "dialogue_count": 0,
      "word_count": 679
    },
    {
      "scene_number": 13,
      "slugline": "EXT. KING-LU’S HUTCH - CONTINUOUS - AFTERNOON The hutch has clearly been violated. Scattered possessions litter the ground. Cookie goes over to the cottonwood tree. He approaches the knothole. The money is gone. He’s dismayed. Cautiously, he enters the hutch. INT. / EXT.   KING-LU’S HUTCH - CONTINUOUS - LATE AFTERNOON With sorrow, Cookie surveys the damage. Broken furniture, tangled rugs, spilled supplies. Already, an air of dilapidation and abandonment is settling in. He hears a faint noise and drops to the floor. He crawls over to the window, and takes a peep. He spots motion among the trees, his head throbs, his double vision returns. At last: a figure emerges. Is it King-Lu? It is King-Lu. King-Lu holds the sack of money in one hand and a jug in the other. He looks at his home with a mournful expression. He doesn’t come any closer, but simply watches, shaking his head. Cookie stands and goes to the door. The men see each other. They both smile. Their happiness is overflowing. Silently, joyfully, King-Lu closes the distance. They stand in the open doorway and embrace. COOKIE I thought you were gone. KING-LU I thought you were gone. 71",
      "characters": [],
      "action_text": "COOKIE I’m only late. KING-LU You’re right on time. King-Lu’s smile fades. KING-LU (CONT’D) You’re hurt. It’s not good here. We need to get away from here. They start off, putting the ruined home behind them. EXT. WOODS - LATE AFTERNOON They walk together. KING-LU There’s a port at the mouth of the river. We’ll go downstream and catch the first clipper south. How about that? COOKIE That sounds fine. KING-LU You made it all right? COOKIE I’ll tell you another time. Cookie concentrates on walking. EXT. WOODS / CLEARING - SOON - DUSK Cookie has trouble keeping up with King-Lu. King-Lu waits, concerned. Cookie is clearly hurting. King-Lu gives Cookie the water jug. Cookie drinks. King-Lu watches him. KING-LU This is a good place to rest. No one can find us here. COOKIE We haven’t gone very far. 72 KING-LU We need a rest. COOKIE I’m fine. We should be on our way. KING-LU We should travel at night. Better to stop now and wait for nightfall. This is a good place. Lie down. Cookie accepts the argument, whether true or not. KING-LU (CONT’D) Good. Lie here. On the needles. I’ll keep first watch. Exhausted, Cookie lies down on the dry needles. Immediately, he falls asleep. King-Lu sits down next to Cookie, realizing he too is exhausted. He lets out a deep sigh of relief. King-Lu stares at the trees, keeping watch. He strains to hear the world outside their spot. In the far distance, he hears the faintest calls. Or does he? He can’t tell. He sees a bird. It’s only a bird. They are alone. The sun is getting low. King-Lu looks at Cookie sleeping. He looks at trees, feeling the money sack in his hand, weighing his options. At last, King-Lu puts the money in the small sack he carries. He lies down beside Cookie. KING-LU (CONT’D) We’ll go soon. I’ve got you. They clasp hands. King-Lu closes is eyes. In a moment, he’s asleep. The light is dimming. An owl calls. 73",
      "dialogue_count": 0,
      "word_count": 535
    }
  ]
}