{
  "slug": "first-man-2018",
  "title": "first man",
  "genre": "drama",
  "format": "film",
  "scenes_count": 18,
  "characters_count": 3,
  "characters": [
    "ELLIOT SEE",
    "HODGE",
    "MIKE COLLINS"
  ],
  "total_words": 34309,
  "total_dialogue": 3,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. X-15 COCKPIT, HIGH RANGE, ABOVE EDWARDS AFB - DAY  A pair of   BLUE EYES.   TICKING   back and forth.   Rapidly.   We’re knocked out by this FIRST IMAGE, by the eyes, oblivious to the RAW and FRIGHTENING   WALL OF SOUND   all around us. JOE (COMMS)  Data check?   NEIL (O.C.) 2 APU on.   Cabin pressure is good, 3500 on #1, 3355 on #2. Platform internal power.  PULL BACK   TO FIND   NEIL ARMSTRONG , 31, in a silver pressure suit and helmet. Neil is INTENSE and INTENSELY FOCUSED, impressive given the SEVERE TURBULENCE that bangs him around the cockpit. JOE (COMMS)  What’s your mixing chambers?   NEIL (INTO COMMS) -44 and -45. BUTCH (COMMS)  Two minute point.   NEIL (INTO COMMS) MH circuit breakers on... Neil flips a switch on the low tech console.   He glances up from the analogue dials and out the cockpit window...   and if the plane looks like a   ROCKET , it’s ‘cause it is .  This is the   X-15 .   And as we're about to see, it's the FASTEST FUCKING AIRCRAFT EVER MADE. But just now, it isn't flying... or rather, not flying alone. Neil’s X-15 is attached to the wing of a B-52 --   BALLS 8 , a four engine BEHEMOTH that’s shaking even more than the X-15. It’s more than a bit terrifying, but Neil calmly hits another switch as he’s   KNOCKED   across the cockpit. NEIL (INTO COMMS) Protocol is off.   Little bumpy. It’s classic Armstrong understatement; underscored as we see the B-52 pilot (BUTCH)   TOSSED   against the window of his plane. BUTCH (COMMS)  Worst it's ever been, real rough up here, fluctuating a half degree each side . This just drives Neil into deeper focus.  3.",
      "characters": [],
      "action_text": "NEIL (INTO COMMS) Velocity 900 fps, altitude 44,500, pitch attitude level.   JOE (COMMS)  Copy.   Neil, we're reading your heart rate at 145.  No reply.   Neil’s eyes   TICK METHODICALLY   from gauge to gauge. JOE (COMMS)  Neil, we’re reading your heart rate at 145, do you copy?  NEIL (INTO COMMS) Copy Joe.   Igniter ready to light. Neil’s not gonna engage.   Whatever adrenaline spike his body is experiencing, Neil’s determined to remain detached. A beat.   We can almost hear   JOE WALKER , on the other end of the comms, debating whether to abort.   At last, he relents. JOE (COMMS)  Okay.   Arm switch lite checks.   NEIL (INTO COMMS) Going to prime.   Ammonia up. In the bumpy cockpit, Neil springs back into action. BUTCH (COMMS)  Twenty seconds to drop --   NEIL (COMMS) Rog, precool on, lox pump bearing plus eight. BUTCH (COMMS) (CONT’D)  Ten seconds --   NEIL (INTO COMMS) Igniter idle, ready to launch on 3, 2, 1, release... Suddenly the X-15 is   RELEASED   from the wing of the B-52. Through the cockpit window, we see the B-52   RISE SHARPLY   as the X-15   DROPS IN FREE FALL ... A FREE FALL we feel in our gut because   WE’RE NOT CUTTING AWAY .  And if you haven’t figured it out by now, WE’RE GONNA BE IN THE COCKPIT WITH NEIL FOR THIS ENTIRE HEART-POUNDING RIDE.  So.   We’re   DROPPING .   FAST .   Neil   PUNCHES   the igniter... the rocket LIGHTS and WE HEAR THE ROAR OF   57,000 POUNDS OF THRUST . NEIL (INTO COMMS) And I got a good lite and aw... The words are literally left behind and Neil’s   THROWN   back into his seat as the rocket TAKES OFF at a   VIOLENT   RATE.   Neil  FIGHTS OFF   6 G’s, reaching for the stick. NEIL (INTO COMMS) Roll.  4. He tilts the stick slightly and the plane   BUCKS   TO THE RIGHT,  TOSSING   Neil like a RAG DOLL and TAKING OUR BREATH AWAY. JOE (FAINT, COMMS)  Good on track, 15 seconds.   NEIL (INTO COMMS) Pulling up, I’m indicating Mach 3. Neil pulls on the stick and   RISES SHARPLY   towards the heavens. He’s   PRESSED   into his se",
      "dialogue_count": 0,
      "word_count": 5039
    },
    {
      "scene_number": 2,
      "slugline": "INT. CONFERENCE ROOM, MANNED SPACE CENTER - HOUSTON, TX - DAY GRAINY FOOTAGE   of the Russian cosmonaut program.   Two Vostok capsules blasting off, one after the next... AGENT WELSH (O.C.) Two weeks ago, the Soviets put two manned spacecraft in orbit.  PULL BACK   to find NEIL in the flickering light.   He sits at a small desk, taking   COPIOUS NOTES   as CIA AGENT JOHN WELSH narrates from beside the REEL-TO-REEL PROJECTOR. AGENT WELSH Vostok 3 and 4 were launched the same day and, at one point, orbited within 75 miles of each other. Near Neil, Elliot See looks   GRIM , but Neil remains analytical as Welsh finishes and Deke flips on a VU-GRAPH PROJECTOR.  DEKE The Soviets are ahead of us on rendezvous and everything else. Which would scare the hell out of me if I weren’t so pissed off. Resolute, Deke puts a transparency on the overhead and   DRAWS  (yep, it’s 1962)   two circles.   He labels them (EARTH, MOON) then   SKETCHES   a rocket flying from one to the other... DEKE The rocket Von Braun’s building is big, it should get us to the moon. Course, a monkey could fly it.   But to get to the surface and back...  PUSH IN   on Neil as Deke draws a SMALL SHIP flying from the rocket to the surface ,   then   returning to the original craft.  DEKE ...we’ll need men trained to catch another ship in orbit and dock. This is the primary mission of Project Gemini. Deke writes   RENDEZVOUS .   DOCKING .   Neil,   INTENT , takes it down. DEKE Proving men can live in space for the week it will take to get to the moon and back, proving men can survive and work outside the space craft... these are secondary goals.  22.",
      "characters": [],
      "action_text": "DURATION .   EXTRA VEHICULAR ACTIVITY   ( E.V.A. ) .   Neil’s eyes TICK from Deke to the screen to his notes, getting it down... DEKE Only if we master these tasks can we move on to Apollo and consider trying to land a man on the moon. Gilruth flicks on the lights, revealing the nine Gemini men, including Ed White and Pete Conrad, who we met baiting Neil. Now Ed and Pete look   TENSE , as do the rest of the men.   And like Neil and Elliot, they’ve all taken COPIOUS NOTES. GILRUTH None of you need incentive.   But this is very much a race -- DEKE And we’re already more than a dick’s length behind the other guy. GILRUTH ...point is, the nine of you need to stay focused, despite the new pressures and the temptations that will invariably come your way. PETE CONRAD So anything we can eat, drink or screw within 24 hours, right? Ed and some of the other men smirk.   Deke, Gilruth do NOT. ED WHITE We know the drill, we’re used to this kind of attention. GILRUTH Due respect, Mr. White?   You’re not. As he says this, we see something on Neil’s face we haven't seen before.   TREPIDATION .   We hear a crowd   ROAR   and   SMASH TO --  INT. CULLEN AUDITORIUM, UNIVERSITY OF HOUSTON - DAY  An 1,800 seat auditorium, filled to capacity.  Introduction of NASA Astronaut Group 2 September 17, 1962  REPORTERS and CAMERA CREWS from the three major networks, the major radio broadcasting systems, the wire services and dozens of domestic and international newspapers and magazines.  23. GILRUTH (O.C., ON LOUDSPEAKER)  Neil A. Armstrong.   Frank F. Borman, Jr.   Charles ‘Pete’ Conrad...  ON STAGE, Deke is with Gilruth, who introduces the astronauts. They walk out, all in blue suits save Conrad, in white linen. GILRUTH (ON LOUDSPEAKER)  James A. Lovell.   James A. McDivitt. Elliot M. See.   Thomas P. Stafford. Edward H. White, II.   John W. Young. These are The New Nine.   This is Project Gemini.  The crowd applauds, dozens of flashbulbs POP.   TIGHT ON   Neil, a smile frozen on his face, eyes",
      "dialogue_count": 0,
      "word_count": 2027
    },
    {
      "scene_number": 3,
      "slugline": "INT. FLOTATION TANK ROOM, ELLINGTON AFB - CONTINUOUS  Neil and the astronauts stand at the edge of a pool with a few TECHS, watching as the submerged capsule SHAKES in the water. EGRESS SUPE 15 seconds... 25 seconds... The EGRESS SUPE eyes his stopwatch.   No one emerges.   CONCERN  creeps across Neil's face... then Conrad surfaces, GASPING. PETE CONRAD Piece of cake. Conrad sees the look on Neil’s face, REALIZES.   And DIVES for Elliot.   Neil glances over at Deke, who doesn’t move. EGRESS SUPE 45 seconds... Neil STARES at the water.   He can’t see what’s happening.   His eyes   TICK   from the rescue techs, to the Egress Supe, to Deke, back to the water again.   He scans it, his hand   CLENCHING . EGRESS SUPE 60 seconds, Deke. At last, Deke nods to the rescue techs, who dive... just as Conrad   EMERGES   with Elliot,   SPUTTERING .   Neil and others reach down to pull him out of the pool as Deke jots down a NOTE. DEKE Lovell, Armstrong, suit up. Neil hovers for a moment over Elliot. DEKE Armstrong, get your ass in gear!  SMASH TO -- INT. CAPSULE (GONDOLA), JOHNSVILLE CENTRIFUGE - DAY CLOSE ON NEIL   in a low-tech capsule.   STRAINING, his features  STRETCHED WIDE   by the g forces.   HOLD   TIGHT   on him, STRUGGLING to breathe, trying to muscle it out.   SMASH TO   --  INT. CENTRIFUGE ROOM, JOHNSVILLE CENTRIFUGE - MOMENTS LATER  Neil VOMITS beside the capsule, which is at the business end of a   MASSIVE CENTRIFUGE .   PALE, Neil looks up as the next victim approaches... it’s Elliot. Elliot clocks how wrecked Neil is.   And   BLANCHES .   SMASH TO   --  30.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 270
    },
    {
      "scene_number": 4,
      "slugline": "INT. CLASSROOM, MANNED SPACE CENTER - CONTINUOUS  Neil, EXHAUSTED, collapses into a desk.   As the other Gemini men sit, Neil opens the   THICK BINDER   in front of him.  Physics of Rocket Propulsion - Rocket Vehicle Performance 1.   Equations defining stage performance 2.   Theoretical optimization of stages 3.   Practical techniques using digital computers 4.   Trajectory losses (drag, gravity, potential energy velocity)  A man in a suit (HAMMOCK) walks in, turns on the vu-graph. HAMMOCK Gentlemen, I’m David Hammock, I’ll be walking you through basic rocket physics.   We’ll just cover the first chapter tonight. Neil flips through the chapter.   It's 75 pages.   Jesus.  INT. HALLWAY, MANNED SPACE CENTER - EARLY EVENING CLOSE ON   a wall clock.   10pm.   A lone janitor mops the hall. It’s QUIET... then the classroom door   OPENS .   Neil and the others stumble out, totally spent.   They start to exit when... DEKE (O.C.) A couple of you have been asking about assignments. Neil and the others turn.   Deke and Kraft stand behind them. The men are suddenly WIDE AWAKE. KRAFT The first missions will test basic functionality of the new capsule. We’ve made selections accordingly. You could hear a pin drop. DEKE Back ups will train alongside primary crews for now.   But there’ll be plenty of flights for everyone. The list is outside my office. A beat.   Then the men GRAB their packs and   RUSH INTO   --  INT. ASTRONAUT OFFICES, MANNED SPACE CENTER - CONTINUOUS  Pete leads the way, Ed and the others at his heels, crowding like high school kids around the LIST posted by Deke’s door.  31.",
      "characters": [],
      "action_text": "FRANK BORMAN White, you lucky bastard. Ed inches forward.   Smiles broadly.   We see the list...  Mission   Prime   Backup GT-3   Grissom-Young   Schirra-Stafford GT-4   McDivitt-White   Borman-Lovell GT-5   Cooper-Conrad   Armstrong-See  PETE CONRAD Shit, I’m flying with Gordo?   JIM LOVELL Punishment fits the crime... The men laugh as Neil walks out.   Elliot turns to him. ELLIOT SEE We’re backup.   Gemini 5. NEIL Great. Unfazed, Neil exits with Elliot, not bothering to check the list.   Ed clocks this, puzzled...   not getting Neil at all .  INT. KITCHEN, ARMSTRONG HOUSE - NIGHT  Neil’s at the dinner table.   It's late, he eats alone, but Janet sits with him, the new baby ( MARK ) asleep in her arms. JANET Rick had a nice time playing with little Ed next door... the White’s boy?   They seem like nice folks. It’s not oppressive, like after Karen died, but Neil’s distant.   Maybe he is upset about the backup assignment?  JANET Neil? NEIL Sorry... There was this lecture on orbital mechanics.   About how to rendezvous with the Agena?   If you thrust, you wind up going slower because it puts you in a higher orbit.   You need to reduce thrust and drop to a lower orbit to catch up.   It’s backwards from what you learn as a pilot but if you work the math, it follows.   It’s kinda neat.  32. Janet reacts.   Trying not to laugh. NEIL Well, it is. JANET Yes, I’m sure that’s how all the other guys feel. Neil smiles.   Then chuckles,   RELAXING .   A nice, shared moment... atypical these days.   Off Janet, ENJOYING it --  INT. BATHROOM, ARMSTRONG HOUSE - NIGHT  Neil stands in boxers and a T-shirt, BRUSHING his teeth. Perfect little circles on each tooth.   His mind elsewhere. Janet, in a nightgown, slips up behind him.   Her hand reaches around his stomach... then DOWN into his boxers. At first, Neil doesn’t notice.   Then his mind and brush   SLOW . His eyes   TICK   to Janet in the mirror.   CONSIDERING .   Janet looks up at him.   Insistent . A beat, then Neil turns, kissi",
      "dialogue_count": 0,
      "word_count": 1363
    },
    {
      "scene_number": 5,
      "slugline": "INT. UPSTAIRS GUEST ROOM, ED & PAT WHITE’S HOUSE - CONTINUOUS  By the window, Janet holds the baby and a CHARRED WEDDING ALBUM.   She looks down at a half destroyed PHOTO, Neil in a tuxedo.   BEAMING .   Lighter than we’ve ever seen him. Janet glances out the window, at what’s left of her house, at a very different Neil picking through the rubble. She FIGHTS to contain her emotions.  PAT We can put Rick in with Ed Jr.   If this is big enough for you all? Janet pulls herself together, closing the album and turning to Pat, who’s walked in with sheets and towels. JANET Of course.   Deke is already working on finding us a rental, so it shouldn’t be too long. PAT WHITE Hush.   It’ll be nice to have a few more voices ‘round the house.   Not like Ed’s ever home. Janet smiles, appreciative as a doorbell RINGS.   CUT TO   --  INT. FOYER, ED & PAT WHITE’S HOUSE - MOMENTS LATER  Ed opens the door, finds Elliot and his wife   MARILYN SEE , 30s. Marilyn holds a brisket; Elliot, his baby son and a bag. Elliot and Ed aren’t that friendly; it’s a bit   AWKWARD . ED Elliot. ELLIOT SEE We heard Neil and Janet were--   JANET Marilyn, Elliot? Pat and Janet walk in.   Marilyn holds out the brisket. MARILYN It was the least we could do. ELLIOT SEE And the girls insisted on sending some of their things. He holds out a bag of Barbie dolls.   Janet laughs, touched.  36.",
      "characters": [],
      "action_text": "ELLIOT SEE Where’s Neil? JANET He’s still over at the house. ED I thought we got everything. JANET You did. Off Ed, CONFUSED, CUT TO --  INT./EXT. ARMSTRONG HOUSE - DAY  Neil in the rubble with a FIRE INSPECTOR, 50s, nonchalant. FIRE INSPECTOR Probably a short in the wiring. I’ll write it up, send it over to the insurance company. The inspector starts to go, but Neil doesn’t move. NEIL Fire came from the family room, we’d just replaced the ceiling panels... FIRE INSPECTOR I’m sure they’ll cover it, Mr. Armstrong. But Neil takes out a logbook and kneels, SCANNING the rubble. The inspector   STARES   and we... ED (O.C.) ...the hell?  PULL BACK   to find Ed and Elliot at the edge of the yard. ELLIOT SEE Uh, he’s trying to -- `   ED I know what he’s doing. Ed shakes his head.   A beat, then he has an idea. ED Let’s take a ride. They head off and we TIME CUT TO --  37.",
      "dialogue_count": 0,
      "word_count": 417
    },
    {
      "scene_number": 6,
      "slugline": "EXT. ARMSTRONG HOUSE - DAY  Sunset.   Wide on the house.   Against the setting sun, the  SILHOUETTE   of a man... Neil inspecting the rubble.   TIRELESS. A beat, then we see Neil bend down...  ANGLE ON   a   BLACKENED BRACELET   amidst ruined keepsakes in the rubble.   Neil wipes it off.   K A R ... the rest unreadable.  CLOSE ON   Neil’s eyes -- a HINT of emotion.   Then he stands. MOVING ON.   Inching over the collapsed roof, looking for something else.   And then bending down again... NEIL Looks like it started here, probably was one of the paneling nails. FIRE INSPECTOR So we’re good? The exhausted inspector walks over, wiping his forehead. NEIL Yep.   We just have to find the nail. The inspector, EXASPERATED, stares as Neil digs into the roof. ED (O.C.) Neil! Ed’s in the yard with Elliot, holding the bag.   He waves Neil over.   A beat, then Neil joins them.   Ed holds out the bag. ED Present. Neil, confused, takes the bag.   He opens it, pulls out a brand new ‘IONIZATION CHAMBER SMOKE DETECTOR.’ ED Smoke enters the chamber, it disrupts the current, thing screams like a son of a bitch. ELLIOT SEE He got one for every house in the development. A beat.   Neil looks up at Ed, SURPRISED.   And GRATEFUL. ED How ‘bout a break?  38.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 218
    },
    {
      "scene_number": 7,
      "slugline": "INT. DINING ROOM, ED & PAT WHITE’S HOUSE - NIGHT  The three couples sit eating, kids playing in the family room. Janet’s had a few glasses of wine. PAT I can’t imagine how frightening it must have been, waking up like that. JANET It would’ve been worse if I hadn’t. MARILYN Well, sure.   But you’re just handling this so well.   Both of you. She smiles at Neil.   He nods, awkward. NEIL At this point it’s just an inconvenience.   Time spent on things which aren’t very productive.   Like getting into another house. JANET Yes, I’m sure it’ll take up a lot of your time. Neil blinks, SURPRISED.   Elliot laughs. MARILYN What are you laughing at? ELLIOT Nothing. JANET (to Pat and Marilyn) Do you think this is how the cosmonauts treat their wives? PAT Maybe it’s how the female cosmonauts treat their husbands. ED That’s enough. PAT No, I think we’ve hit on something. Maybe this is the problem. MARILYN No female astronauts?  39.",
      "characters": [
        "ELLIOT SEE"
      ],
      "action_text": "PAT Why do you think we’re behind? ED We’re not behind. PAT Right.   The Russians are sending women up in space and I can’t even attend a launch at the Cape. MARILYN Really?   JANET What? PAT No wives at the Cape.   I asked about Ed’s flight, that’s what Deke said. ED It’s NASA policy. PAT ‘Cause God forbid there’s a photo of me reacting if the rocket explodes. This is starting to get uncomfortable. ED Deke and Chris just don’t want any distractions. PAT From what I understand, there are all sorts of distractions. ED Honey --   PAT Don’t   honey   me. NEIL This reminds me of a story. They turn to Neil, surprised. NEIL A fella I know made plans to play golf on his wedding anniversary. His wife got very upset.   They had a spat, as couples do.   She accused him of loving golf more than her. And the fella, well, he shrugged. (acting it) “ I love you more than tennis .”  40. A beat.   It’s not particularly funny, but from Neil it’s surprising. And hilarious.   The table bursts out laughing.  EXT. ED WHITE’S HOUSE - NIGHT WIDE   ON   the yard.   The house cozy, the windows casting warm light, the yard dotted with fireflies.   And then over the crickets, we hear faint STATIC.   And chatter... in   RUSSIAN .  PAN UP   to the stars above.   HOLD ON   them as the Comms continue. Chilling, spooky.   And as we wonder what it means,   PRELAP   -- RICK ( PRELAP ) I’m on the lookout for Dr. Zin.  EXT. PORCH, WHITE’S HOUSE - NIGHT CLOSE ON   Rick crouching by the porch with a walkie talkie. RICK (INTO WALKIE) I’m on the lookout for Dr. Zin.   Copy?   ED JR (OVER WALKIE)  Roger, I’m flying to you.  Nearby, Neil watches Rick, CALM.   Elliot holds up a   SEXTANT . ELLIOT Vega, Rigel.   8 degrees.   Check me? Neil nods, takes Elliot’s sextant.   Surveys the two stars. NEIL Yes.   8 degree angle. ELLIOT You want to do Antares and Nunki? Neil nods, takes a reading.   Ed walks outside with beers.   He sees Neil with the sextant and SHOOTS a look at Elliot. ELLIOT We head to Morehead on T",
      "dialogue_count": 1,
      "word_count": 3531
    },
    {
      "scene_number": 8,
      "slugline": "INT. LIVING ROOM, ELLIOT AND MARILYN SEE'S HOUSE - NIGHT  Neil, tense, moves through the gathered mourners, eyes darting, SEARCHING for Janet.   We   CUT INTO NEIL’S POV --  ...eyes ticking past   WIVES   raising hands in greeting... ...past   ED   waving, calling to Neil from across the room... ...pausing on   ELLIOT’S PHOTO   on the mantle...  Neil KEEPS GOING until he spots Janet.   He moves SWIFTLY into--  INT. KITCHEN, ELLIOT AND MARILYN SEE’S HOUSE - NIGHT  Janet lays cookies out on a tray.   Neil rolls up beside her. NEIL Let’s go. JANET I told Pat I’d help put out dessert. NEIL (quiet) I need to go. JANET Okay.   It’ll just be another minute. She keeps plating cookies... until she realizes Neil’s gone. JANET Neil? She turns.   We hear the car start before we see it.   Neil pulling away and driving off.   Off Janet --  INT. ED WHITE’S CAR (MOVING) - LATER  Close on Janet.   In the backseat.   Upset and embarrassed. JANET I’m sorry.   I hate to be a bother. PAT It’s no bother. Ed drives.   Pat beside him.   A beat. JANET Has he ever talked to you about her? About Karen?  55.",
      "characters": [],
      "action_text": "ED No.   Not really. JANET I talk about her.   But never to him. Janet stares out the window.   Off Ed, processing, we --  EXT. ARMSTRONG BACK PORCH - LATER  Neil stands under the stars, taking readings with the sextant. Practicing.   Jotting notes down in a logbook beside him. ED Hey. Ed walks up.   Neil just keeps taking readings.   A beat. ED Lovell said Buzz was mouthing off. Certainly wasn’t the place for it. Neil glances over.   Something not sitting well. ED You know Deke had doubts about Elliot.   Deke moved him off Eight. NEIL Deke wanted him for command. ED Neil.   Elliot always flew too slow. (then) I mean, it’s tough to blame a guy for his own death.   And Aldrin’s an asshole. But you of all people know-- NEIL (hot) No.   I don’t.   I didn’t investigate the crash, I didn’t study the flight trajectory, I wouldn’t pretend to know what happened. Ed’s surprised.   Neil’s   DARK , more emotional than we’ve seen. NEIL You all want to make yourselves feel better, but this had, it had nothing to do with Elliot.   You know the odds, this... it happens, it’ll happen again and if you can’t handle it... you should do something else.  56. Neil contains himself, turns away.   Starts taking readings. ED Neil.   Hey, we’re all broken up here, I didn’t mean to --   NEIL I need to practice. ED What? NEIL We’re going to be the first to dock, I need to practice. ED Shit.   You should be with your wife, playing with your kids -- NEIL And you should be minding your own damn business .  He’s COLD.   Ed reacts.   Then walks off.   As he goes, we see... Janet.   In the window, a tired look in her eyes.   She watches as Neil takes another reading.   He seems unmoved.   Exhausted, Janet turns away, and we   RACK FOCUS   back to... Neil.   SHAKING .   As   RATTLED   as we’ve seen .   He lowers the sextant... and stares down at the small label.   “ E .   SEE .”  INT. UPSTAIRS FOYER, ARMSTRONG HOUSE - NIGHT  Neil walks up the stairs.   He turns off the light and starts to head into t",
      "dialogue_count": 0,
      "word_count": 1555
    },
    {
      "scene_number": 9,
      "slugline": "EXT. GEMINI VIII, SUBORBITAL SPACE - SAME TIME  From afar, it looks like the rocket is   EXPLODING ... NEIL (COMMS)  We’re having Wally’s fireball here.   DAVE SCOTT (COMMS)  ...uh, yeah.  We see the first stage fall away.   The second stage   LIGHTS...  then   ROCKETS   forward and we realize...   Jesus, this is normal . NEIL (COMMS)  Fuel cells are solid, the second stage is a real good machine.  SMASH BACK INTO -- INT. GEMINI VIII COCKPIT, PAD 19, KSC - SAME TIME  Dave   REELS   as Neil calmly refocuses on the gauges.   A beat. KSC CAPCOM (COMMS)  Gemini 8, you’re go from the ground. Mark.   V/VR = point zero eight.  NEIL (INTO COMMS) Okay.   Mode 3.   DAVE SCOTT (INTO COMMS) (following Neil’s lead) Burn stop. Neil flicks off the engines and the men are   JOLTED FORWARD,  tossed into   MICROGRAVITY .   Dave lets out a GRUNT... as a mission checklists FLOATS across the cabin. Engines off, it’s eerily QUIET.   Dave takes a breath, glances out the window.   The world’s UPSIDE DOWN, sky at his feet, horizon ABOVE his head.   STRUCK, he nudges Neil... Neil looks up.   It’s the view from the X-15, but FOUR TIMES HIGHER.   PUSH IN   on Neil’s eyes, a surprising   SENSE OF WONDER . JIM LOVELL (COMMS)  I alpha time is 15:06, orbit is 87 by 147, hold for plane adjust...  INT. MISSION CONTROL CENTER (MCC), HOUSTON - SAME TIME CLOSE ON   a hand   PINNING   a PAPER GEMINI onto a RUDIMENTARY ORBITAL MAP.   A PAPER AGENA is already tacked on the map. PUBLIC AFFAIRS OFFICER (ON LOUDSPEAKER)  This is mission control, Houston, we will now begin rendezvous maneuvers.  62.",
      "characters": [],
      "action_text": "The room is BUZZING.   Kraft and Flight Director   JOHN HODGE , 37, British, gray, stand over a gaggle of MPAD ENGINEERS. HODGE I need the transfer arc, gentlemen.  CLOSE ON   a DIAGRAM of the two ships in orbit... SLIDE RULES... CALCULATORS... PENCILS doing complex math... One of the engineers   QUICKLY   SCRIBBLES   on a transparency and  RUNS   it through a door under the BIG SCREEN up front, into...  THE PROJECTION ROOM .   A DOZEN VU-GRAPHS behind the screens.  Clearly another era .   Our engineer throws the slide up on a Vu- Graph; it's BOUNCED off a mirror and --  IN MISSION CONTROL   the hand drawn transparency APPEARS on the big screen.   Hodge nods to Jim Lovell at the CapCom Console. JIM LOVELL (INTO COMMS) Gemini 8, Houston CapCom.   I have a Plane-Adjust update.   DAVE (COMMS)  ...uh, stand by, Houston.  INT. GEMINI VIII COCKPIT - SAME TIME  Helmets, checklists, and mission rule books   FLOAT   about the cabin.   Neil and Dave, helmets off, look OVERWHELMED. DAVE SCOTT Where’d the flight book go? Dave turns to look, accidentally   CLOCKS   Neil in the head. DAVE SCOTT Shit, sorry.   LOVELL (COMMS)  Let me know when you’re ready, 8.  Neil spots the book, hands it to Dave. DAVE SCOTT (INTO COMMS) Houston, Gemini 8, go ahead. LOVELL (OVER COMMS)  GET B: 02:45:50; 26.2 burn time, yaw 90 right, pitch O.  DAVE (INTO COMMS) (writing it down) Roger.   Prepping for burn.  CLOSE ON   hands setting the YAW DIAL to 90 right; PITCH at 0; THRUSTERS on.   Neil’s eyes   TICK   to the clock.   2:45:28, 29... NEIL Give me the call.   DAVE SCOTT 10... 5, 4, 3, 2, 1, Now!  63. Neil hits the thrusters.   POP POP POP!!   The craft   RUSHES   TO THE RIGHT.   The mission plan SMACKS against the wall. NEIL Time check.   ...Dave?   DAVE SCOTT (disoriented) 20 seconds... 25... 30, 31, 32, 33, 34... cut off. Neil lets go of the thrusters.   It's QUIET; the mission plan FLOATS off the wall.   Neil’s eyes   TICK   over the instruments. NEIL I think we overdid it a little. He GRABS a",
      "dialogue_count": 0,
      "word_count": 3217
    },
    {
      "scene_number": 10,
      "slugline": "INT. BRIDGE, COASTAL SENTRY QUEBEC - SAME TIME CLOSE ON   a needle,   QUIVERING   at   530°/second.   Men crowd around Fucci, staring.   And sweating. LOVELL (COMMS)  CSQ, is there a status update?  INT. MCC - SAME TIME  The men stand frozen, worried.   It’s SILENT.   Lovell looks to Kraft, Deke and Hodge.   Conrad and others crowd round.   GRIM . LOVELL (INTO COMMS) CSQ, this is Flight.   Can you --  STATIC   cuts him off.   Then, faintly... DAVE (COMMS)  ...regaining control... RCS direct.   CONRAD Motherfucker. As the group lets out a collective breath,   SMASH BACK TO   --  INT. GEMINI VIII COCKPIT - SAME TIME  Dave, foggy, unsettled, watches Neil calmly pulsing the RCS, eyes on the DROPPING roll rate gauge...   300°... 250°... 200°...  NEIL Keep an eye on our RCS fuel. Dave nods, eyes the fuel gauge.   The sun stops strobing, the flight plans stop whipping about the cabin... FUCCI (COMMS)  8, CSQ.   How are you doing?   DAVE (INTO COMMS) We are pulsing the RCS pretty slowly so we don’t-- it’s all roll right, we are trying to kill our roll rate. FUCCI (COMMS)  Okay.   Everything’s okay.   DAVE (to Neil) You believe this guy? NEIL Move us back to one ring. Off Neil,   CUT BACK TO   --  INT. MCC - SAME TIME  Hodge leans in.  75.",
      "characters": [
        "HODGE"
      ],
      "action_text": "like it’s ‘under control.’   You're a bunch of boys making models from balsa wood, you don’t have anything under control.  TEARS WELL ...   Embarrassed and ANGRY, she   STALKS OFF . DEKE Take her home, will ya? ED What do we say to the press? Deke doesn’t follow. ED The Life guy, Morse, he was with Jan, he leaked it to --   PAO (O.C.) Deke, I need a statement. The Public Affairs Officer RUNS up. PUBLIC AFFAIRS OFFICER We’re getting calls from the networks, the papers, local news... Shit.   Off Deke,   CUT BACK TO - -  INT. GEMINI VIII COCKPIT - SAME TIME  It's quiet, a checklist floating calmly, the roll stopped. FUCCI (COMMS)  8, Flight’s told me to relay that they're looking into 6 or 7 dash 3 area at this time.   Please enter re- entry Module 4 in the ATM computer.  Dave hesitates, realizing they're terminating the flight.   But Neil just pulls out a map, surveys the landing area. NEIL Right in the middle.   Okinawa.   That was the third choice, remote areas. (then) I’d like to argue.   About the going home.   But I don’t know how we can. The slightest hint of frustration.   But there’s nothing to do. DAVE SCOTT I’ll get started on re-entry. Downcast, Dave turns to the basic computer, starts punching numbers in when...   POP! POP! POP!   Dave STIFFENS, SPINS...  77.  JANET (CONT'D) ...to find Neil   FIRING   the OAMS thrusters. DAVE SCOTT What are-- we’ll start to spin again! NEIL Only way to find the culprit. Off Dave,   UNNERVED ,   CUT TO   --  INT. MCC - SAME TIME  The room BUZZES, prepping for re-entry.   Gilruth huddles with Deke and Kraft.   A beat.   Then we hear Lovell -- LOVELL (O.C., INTO COMMS) 8, we’re showing your roll rate back up to 90 degrees.   Confirm?   Neil? The men turn,   ALARMED .   Hodge and Lovell look TENSE. LOVELL Neil?   NEIL (COMMS) (beat)  Checking OAMS, thruster 8 failed open at present.  NEIL (COMMS)  This could have been true at the time of the incident, although we cannot verify that at this time.  Is he nuts?   Hodge leans into",
      "dialogue_count": 1,
      "word_count": 1806
    },
    {
      "scene_number": 11,
      "slugline": "INT. KITCHEN, ARMSTRONG HOME - DAY  CLOSE ON Neil on the phone.   As   AGITATED   as we’ve seen him. NEIL (INTO PHONE) It’s, it’s, it’s sensationalist. It’s not appropriate, it’s not an appropriate title for the piece! Neil holds an ADVANCED COPY of a LIFE MAGAZINE article: “ Our Wild Ride in Space! ”   by Neil Armstrong . NEIL (INTO PHONE) (CONT’D) I’m not interested in how the other magazines are framing the story! Now we see the Wall Street Journal on the kitchen table.   A headline below the fold:   Moon Race: Can’t Machines Do It?  NEIL (INTO PHONE) Well then... then maybe my name shouldn’t be on the damn article! Neil   SLAMS   down the phone.   Janet, plating dinner, looks up. JANET Neil? But he walks out.   Off Janet, CONCERNED,   PRELAP   a DOORBELL --  EXT. ED WHITE’S HOUSE - DAY  Ed opens the front door.   And finds Janet. JANET Can you come over? ED Not sure that’s gonna help. JANET Please. She’s insistent.   Ed hesitates but Pat, at the door as well, nudges him.   He heads across the yard.   Pat offers a smile. PAT My sister married a dentist.   I used to wonder what it was like.   He’s home by six every night.   And every three months my sister calls to say she wishes he weren’t. Janet manages a laugh.   A beat.  83.",
      "characters": [],
      "action_text": "JANET I keep hoping it’ll be better.   If things go right.   When they do.  INT. NEIL'S BASEMENT OFFICE, ARMSTRONG HOUSE - EARLY EVENING  A LARGE DESK.   Covered with   SCHEMATICS   of the Agena,   DATA   from Gemini 8,   DIAGRAMS   of the Gemini’s sixteen OAMS thrusters.  FIND   Neil hunched over it all with an ENGINEER'S PAD.   HOLD ON  him, studying the malfunction, working the problem.   We hear a   RUMBLE   and Neil looks up... Ed rolls down the stairs. ED Back to work? NEIL I’m trying to find a way to isolate a single thruster. It’s   AWKWARD , the fight still not really behind them.   A beat. ED I was gonna go over to Dave’s. No response from Neil.   Ed, giving up, starts to retreat... NEIL ...I could use a break. Ed pauses.   He and Neil share a look.   Detente .   WE HEAR the Second Movement of   Dvorak's New World Symphony   and   CUT TO   --  INT. KITCHEN, DAVE SCOTT’S HOUSE - NIGHT  Neil and Ed sit drinking with Dave Scott.   They listen to an   8- TRACK , Dvorak washing over them.   Off the music -- NEIL Felt a little like that, right? Being up there? ED How much did you have to drink? Neil tosses a empty beer can at Ed.   Ed laughs.   So does Neil. DAVE SCOTT I will say one thing.   It’s all I can think about.   Getting back up. Neil nods.   Ed eyes his beer, an odd look on his face.  84. DAVE SCOTT (CONT’D) What? ED Gus grabbed me earlier.   He and Deke want me on the team. NEIL For the first Apollo mission? Ed nods, tentative.   Dave explodes, thrilled for him. DAVE SCOTT Holy shit.   That’s huge!   NEIL (CONT’D)  That Saturn’s a monster. It’s gonna be a helluva ride. Neil’s SMILING, genuinely excited. DAVE SCOTT You know Deke wants Gus to be first one on the moon, so that first team-- ED Let’s not get ahead of ourselves.  NEIL (CONT’D)  Okay, but it is pretty exciting. Heck, just to be the first to test the new capsule -- ED Yeah, Gus is already bitching. DAVE SCOTT I’ll bet. NEIL Well, I can’t wait to hear about it. ED Gus bitching?   You will. The",
      "dialogue_count": 0,
      "word_count": 1197
    },
    {
      "scene_number": 12,
      "slugline": "INT. KITCHEN, ARMSTRONG HOUSE - MORNING  Janet holds up a BLUE SUIT.   Irritated. JANET Neil Alden Armstrong, you cannot wear a suit! Neil, in an   APRON , makes pancakes.   PERFECT HALF DOLLARS. NEIL It said Black Tie   Optional . JANET You’re one of three astronauts representing NASA, Deke specifically told me it was   not   optional . Neil frowns as Ed walks in the front door with a duffle. ED  Nice apron.   Manly.  JANET Would you tell him he’s got to wear a tuxedo to the White House? ED I dunno, maybe he should wear the apron.  NEIL Don’t you have a plane to catch?  Ed laughs.   And notices SCHEMATICS on the table.   DIAGRAMS for the   LUNAR LANDING TEST VEHICLE , an odd, free-flying trainer that’ll simulate lunar gravity.   And yes, it’s an update of the diagram that inspired Neil to join Apollo   back on   P.19 . ED Is this the lunar landing Sim? NEIL Gene and the folks at FRC have been having a heck of a time with it. ED (off the diagrams, impressed) It’s completely fly by wire?  89.",
      "characters": [],
      "action_text": "NEIL Does a decent job simulating lunar gravity but if the electrical system craps out or you get a good 20 knot wind, it’s a real hairy deal.   Deke asked me to take a look but I think the thing’s just too damn dangerous. ED This from the ‘Hero of Gemini 8’? Neil grimaces.  JANET Don’t get him started again.   He’s been grumbling about the trip all morning. NEIL How ‘bout we trade and I go to the Cape?  ED  No, you got the guts, you gotta go enjoy the glory.  INT. BEDROOM, ARMSTRONG HOUSE - LATER CLOSE ON   an OPEN SUITCASE.   Socks, underwear and A TUX; packed METICULOUSLY.   Neil adds a dopp kit then hesitates.   He picks it up.   Eyes   TICKING   over the toothbrush, toothpaste... JANET You already repacked it.   Twice. Neil looks up flustered,   AGITATED .   Janet moves to him. JANET When you meet the President, just look at his shoes.   It’ll be okay. Neil looks up, nods.   Janet leans in, kisses his cheek, starts to go... but he pulls her back. NEIL I, uh, I know I, since I got back... JANET It’s okay. It isn’t really.   But she wants to be strong for him.   Neil, VULNERABLE, pulls her in.   Holds tight.   Off Janet,   CUT TO   --  90.",
      "dialogue_count": 0,
      "word_count": 393
    },
    {
      "scene_number": 13,
      "slugline": "INT. LIMOUSINE - LATE AFTERNOON CLOSE ON   Neil.   In a TUXEDO.   Stiff.   Uncomfortable. PETE CONRAD (O.C.) Looks like he was born in a tux.  REVERSE   to Conrad and Jim Lovell, across from Neil.   Conrad SMIRKS at Neil as the limo stops and the door opens on... A RED CARPET.   REPORTERS line the entrance to   THE WHITE HOUSE . As Pete gets out, WAVING, we   HOLD ON   Neil... uneasy. PRESIDENT JOHNSON ( PRELAP ) We have never succeeded in freeing our planet from war.  INT. EAST ROOM, THE WHITE HOUSE - EARLY EVENING  CLOSE ON a formal international document:   The Treaty on Outer Space, January 27, 1967 .   As LBJ’s familiar voice rolls on...  ...REVEAL   a room of DIGNITARIES.   LBJ sits at a signing table. We’re   BEHIND HIM   with Neil and the other astronauts. PRESIDENT JOHNSON (O.C.) But this treaty means the moon will serve only the purposes of peace... and that astronaut and cosmonaut might meet on the moon as brothers. LBJ hands a pen to a heavyset AMBASSADOR wearing a SICKLE PIN. As he moves to sign the treaty, Conrad whispers to the others. PETE CONRAD What a load of horseshit. Neil turns, but before Pete can go on, they’re overwhelmed by APPLAUSE and FLASHBULBS.   As Neil flinches, we   FLASH TO   --  INT. EAST ROOM, WHITE HOUSE - LATER  Lovell and Neil talk to a Senator.   Neil clings to a beer. LOVELL ...we’re very bullish on Apollo. SENATOR I should hope, given the time we’ve spent developing it. Neil looks uncomfortable.   The congressman notices.  91.",
      "characters": [],
      "action_text": "SENATOR Commander Armstrong?   You disagree? NEIL We learned to fly sixty years ago. So if you consider the technological development in the context of history -- SENATOR I’m considering it in the context of taxpayer dollars. Neil doesn’t know what to say.   Lovell steps in... LOVELL So are we, Senator.   And between us, if the capsule passes plugs out, we’ll have a heck of a launch next month.   I’m sure Mr. Gilruth would be happy to discuss it in detail. Lovell leads the Senator across the room to Gilruth... and away from Neil.   Neil awkwardly drifts toward the bar. He stands there for a moment, totally out of place... when a PRETTY STAFFER appears at his side with a FLIRTY SMILE. PRETTY FEMALE STAFFER Aren’t you someone I should know? NEIL ...uh, probably not. She walks off, confused. CONRAD We need to get you a stronger drink. Neil sees Conrad’s beside him.   Conrad waves for a beer. CONRAD No stomach for political theater? NEIL ...that what this is? CONRAD We’ve got more troops on the ground in Vietnam every day.   You think LBJ wants astronaut and cosmonaut to ‘meet on the moon as brothers’?  92. NEIL Then why sign the treaty? CONRAD You can’t lose a race you don’t run. (off Neil) We’re still neck and neck with the Russians, and for what?   ICBM’s have made space irrelevant, militarily. Why break the bank on the moon when you could spend it in Saigon? NEIL ...you think he’d just drop Apollo? CONRAD Oh yeah.   If LBJ wasn’t from Texas we’d already be dead. Neil stares at him. CONRAD Jesus, Armstrong, where’ve you been? Did you see the polling on Apollo? ARMSTRONG No.   I didn’t. CONRAD Well, it’s not good. LOVELL Knock it off, Pete. Lovell walks up, nods to the bartender for a beer. LOVELL We launch Apollo, nobody’s going to cut our funding.   That shiny new capsule’s gonna have every kid in the country dreaming about a trip to the moon. CONRAD That shiny new capsule hasn’t passed plugs out. LOVELL Talk to me in an hour. He takes a drink, then leans into Neil ",
      "dialogue_count": 0,
      "word_count": 891
    },
    {
      "scene_number": 14,
      "slugline": "INT. APOLLO COCKPIT, PAD 34 - SAME TIME CLOSE ON   another ratchet tightening a latch. ED (O.C.) That’s all of ‘em.  FIND   Ed in the familiar Apollo cockpit.   He glances at the OTHER FIVE LOCKED LATCHES, puts away the ratchet. GUS (INTO COMMS) Ready for oxygen purge. We hear the   HISS   of oxygen... and   SNIPPETS   of conversation over Comms.   Gus, beside Ed, hits the comms button. GUS (INTO COMMS) Guys, we’ve got an open mic.   LAUNCH DIRECTOR (COMMS)  Uh, let’s hold the countdown.  A beat.   The crew looks annoyed. DEKE (COMMS)  Sorry guys, we’ll get this squared.  GUS (INTO COMMS) How are we gonna get to the moon if we can’t talk between two buildings?   LAUNCH DIRECTOR (COMMS)  ...Gus, we didn’t get that.  As Gus, pissed, shakes his head, we   CUT TO   --  INT. HALLWAY, GEORGETOWN INN - WASHINGTON, DC - SAME TIME  An elevator   DINGS .   Lovell, Conrad and Neil get off. PETE CONRAD I’m gonna get outta this monkey suit and head to the bar. LOVELL I’m in.   Neil? NEIL I think I’ll check in with the Cape. PETE CONRAD You hell raiser, you. Neil peels off.  95.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 191
    },
    {
      "scene_number": 15,
      "slugline": "INT. ROOM, GEORGETOWN INN, WASHINGTON, DC - MOMENTS LATER  Neil walks in, neatly hangs his jacket in the closet.   He pulls at his tie, sits on the bed and reaches for the phone, DIALING then taking off his shoes as he waits for... PETRONE (OVER PHONE) Rocco. NEIL (INTO PHONE) It’s Neil.   How’s it going there? PETRONE (OVER PHONE) We’re on a hold.   Glitch in the Comms, about ten away, I think. NEIL (INTO PHONE) Huh.   Okay.   How’s the capsule look? PETRONE (OVER PHONE) Oh, she’s a beaut. Neil can’t help but smile.   Excited for Apollo.   For Ed. PETRONE Happy to give you guys a holler a bit later with a status report. NEIL (INTO PHONE) That’d be great.   Thanks, Rocco. Neil hangs up, grabs the remote... a Zenith   ‘SPACE COMMANDER.’  He blinks at the name... then snaps on the TV and settles in.  INT. APOLLO COCKPIT, PAD 34 - LATER  Ed looks over a manual, clearly BORED. DEKE (COMMS)  A few more minutes, we’ve just about got it sorted.   GUS (INTO COMMS) Shit, we’re gonna be here all night. ED (INTO COMMS, to Roger) He’ll turn the corner.   In half an hour he’ll be singing Sinatra. GUS (INTO COMMS, to Ed) Stop screwing around, wouldya?  96.",
      "characters": [
        "MIKE COLLINS"
      ],
      "action_text": "DEKE (COMMS)  Easy, everyone just cool it.   GUS (INTO COMMS) Get the damn comms working and we’ll cool it. TECH (COMMS)  I got a surge in the AC Bus 2 Voltage.   LAUNCH DIRECTOR (COMMS)  Try resetting the meter.  Gus, happy to have something to do, looks over the gauges. GUS (INTO COMMS) Rog, you see anything on the dials? Chaffee turns to look and notices a   SMALL FLAME   on the floor. Before he can react... the flame   JUMPS . CHAFFEE (INTO COMMS) Hey! The flame   FLASHES   through the cockpit,   FIRE   BLAZING   around all three of them.   Ed and Gus react -- it’s frighting, but they stay CALM, HUSTLING through evacuation procedures... Ed reaches for the hatch... the latches are   TIGHT .   He grabs a ratchet,   STRUGGLES   to loosen a latch, but his arm is   ENGULFED  by fire.   He   KEEPS WORKING ... even as his suit starts to   MELT . Ed GRIMACES.   The latch isn’t budging.   His eyes   DART   to the other five latches.   As he starts to PANIC,   SMASH TO   --  INT. BLOCKHOUSE, PAD 34, CAPE CANAVERAL - SAME TIME  A FAR VIEW of the CAPSULE from 400 feet below.   It looks fine. PETRONE   (INTO COMMS) Gus?   Can you hear us up there? LAUNCH DIRECTOR ROCCO PETRONE, 40, eyes the capsule on the B&W MONITOR.   We’re in a makeshift   LAUNCH COMMAND   at the base of the rocket.   Deke walks up with a cup of coffee. DEKE Comms are still out? TECH Should have been fixed by now. The tech at the comms shrugs.   Petrone tries again. PETRONE (INTO COMMS) Gus, can you hear --   ED (COMMS)  We got a fire in the cockpit!  97. Petrone pauses, eyes the monitor... as the hatch window   LIGHTS UP , turning   WHITE .   Deke remains calm. DEKE Okay.   Get them out of there. PETRONE (INTO COMMS) Hey crew, can you egress at this time?   Confirm it. No response.   Deke takes the Comms. DEKE (INTO COMMS) Guenter, get in there and help them. Deke looks up.   High above, techs move towards the capsule. PETRONE (INTO COMMS) Crew did we get verification? Can you egress at --   CHAFFEE (COM",
      "dialogue_count": 1,
      "word_count": 7124
    },
    {
      "scene_number": 16,
      "slugline": "INT. APOLLO CSM, TRANSLUNAR SPACE - SAME TIME  Mike looks to the earth,   FURTHER AWAY   than he’s ever seen it and   SWIFTLY RECEDING   into the distance... the magnitude of what they're doing now clear. It's   HUMBLING .   FRIGHTENING . MIKE COLLINS Wish I’d thought to bring music. Neil reaches into the hold, pulls out an   8-TRACK   and floats it to Mike.   Mike surprised, grabs the 8-track, hits play as Neil grabs a   SEXTANT , starts checking their alignment... We hear the 2nd movement of   DVORAK'S NEW WORLD SYMPHONY .   The purposeful, optimistic opening giving way to drums and a  LONELY CLARINET .   It   SWIRLS   around the men... ...and now Buzz stops working, catching sight of the   RECEDING EARTH   in the window.   He and Mike STARE, struck by how   FRAGILE  the earth looks, how   SMALL . Mike glances at Neil, taking readings, checking calculations,  not taking even a moment to note the majesty or the grandeur . As the   HAUNTING CLARINET   moves us through time and space, the earth getting smaller in the window, Neil fails to notice. As he mechanically lifts ELLIOT’S SEXTANT for another reading--  TIME CUT TO -- MISSION DAY THREE   (00:29:36) .   CLOSE ON   a small compartment door closing and a hand writing on it.   SMELLY WASTE.  REVEAL   Mike, GRIMY flight suit, thick STUBBLE, red eyes.   He floats past wires taped with soiled duct tape over to a grubby CALENDAR scrawled on the wall.   He crosses off day 3 of 9. Mike wipes his brow, already sick of the DANK cabin and floats over to Buzz and Neil (flight suits, stubble).   They hover over a TOPOGRAPHICAL MAP of the moon. DEKE (COMMS)  ...the landing area is beyond the Maskelyne series, it should be flat. Which is good cause you won’t have much wiggle room.   That fuel tank’s a bitch ,   if you’re not under 100 feet at 20 seconds to bingo --  NEIL We will be.  125.",
      "characters": [],
      "action_text": "He’s dismissive.   Buzz notes it.   Uneasy. CAPCOM (COMMS)  Hate to interrupt, but we’ve played back the LOI 2 burn, it looks good, we got an orbit at 65.4 by 53.9.  As he says it, a   DARK OBJECT   fills THREE QUARTERS of the hatch window.   It’s our first close view of   THE MOON , its barren surface   STARK   and   FORBODING .   As the men take it in,   CUT TO   --  EXT. THE CAPSULE, LUNAR ORBITAL INSERTION - CONTINUOUS  The craft floats   BACKWARDS   in orbit around the moon. BUZZ (O.C.) Man, look at it. The moon is no longer an image in the window but a   FULL-SCALE PLANETARY BODY .   The sight of the craft orbiting it is both viscerally REAL and unbelievably UNREAL.   It's   STARTLING . MIKE COLLINS (O.C.) Boy, look at that son of a bitch. Mike's voice   PULLS US BACK INTO   --  INT. THE CAPSULE - CONTINUOUS  Mike and Buzz stare out at the moon, in   AWE ... but Neil’s already focused on what’s next. NEIL Buzz. (points, all business) We just passed Mount Marilyn.   We're coming up on Maskelyne series, coming into the landing area.   We roll right here at this... that crater, the big one.   Duke Island. MIKE COLLINS ...that’s US 1, I guess. NEIL The flat area, that’s our target. BUZZ Sure is eerie looking. MIKE COLLINS There must be nothing more desolate than inside some of these craters.  126. They stare.   Buzz and Mike clearly both   ANTSY . CAPCOM (COMMS)  Apollo 11, this is Houston, do you read?   The spacecraft is looking good to us on telemetry.   Flight is requesting a burn status report.  Mike and Buzz move to comply, but Neil stares out the window.  PUSH IN   on his eyes, resolved.   More   INTENSE   then ever.  INT. APOLLO 11, BOTTOM DECK - DAY 3 (14:30:37)  The cabin lights are dim.   Mike TAPES UP the windows to keep out the sunlight and the bright moonshine. MIKE COLLINS I thought today went pretty well. If tomorrow and the next day are like today, we’ll be safe. BUZZ (O.C.) Absolutely. The camera   FLOATS DOWN   to the lower deck, Buzz and Neil s",
      "dialogue_count": 0,
      "word_count": 809
    },
    {
      "scene_number": 17,
      "slugline": "INT. APOLLO 11 CSM (COLUMBIA) - DAY 4 (00:03:00)  Mike,   ON EDGE , works a fuel cell purge, a camera set up and an auto maneuver.   Neil collects his pack, preps to enter the LM. MIKE COLLINS All this food and stuff up here, you going to take it with you?   Chewing gum, you want any of that? Neil shakes him off.   Mike, sweaty, wrestles a storage bin. MIKE COLLINS This is a damn three-ring circus.   I got a fuel cell purge in progress, I gotta watch an AUTO maneuver and -- The storage bin   POPS   open, film rolls FLOAT in all directions. MIKE COLLINS (trying to grab them) Christ!   You son of a bitch, you! NEIL Mike. Mike tries to SETTLE, clearly nervous about being left alone. MIKE COLLINS Come back, will you? Neil nods, grabs his PLSS pack and FLOATS TO the open hatch at the TOP of the CSM.   STAY WITH NEIL as he   FLOATS   INTO -- THE CONNECTING TUNNEL .   We look up... from Neil’s POV, Buzz is  STANDING UPSIDE DOWN   in the Lunar Module.   It's   DISORIENTING . Neil BLINKS away the vertigo, pulls himself into --  INT. LUNAR MODULE (EAGLE) - CONTINUOUS  We follow Neil in,   ROTATING   with him until what was just upside down is RIGHT SIDE UP.   Neil glances at Mike,   now upside down in the CSM , then closes the hatch. BUZZ (INTO COMMS) Columbia, Eagle.   Have you got the -- got to the tunnel vent step yet? MIKE COLLINS (COMMS)  I’m just coming to that.   BUZZ (INTO COMMS) Well, we’re waiting on you. Buzz, ANTSY, looks at Neil, calmly stowing his gear.  128.",
      "characters": [],
      "action_text": "BUZZ I heard Conrad was taking bets before we left.   He told me our odds were about 10 to 1.   The guy actually had the audacity to ask me which way I wanted to bet. Neil doesn’t say anything.   It makes Buzz   MORE FIDGETY . MIKE COLLINS (COMMS)  I’m going to start to depressurize. We got just about a minute to go, you guys all set?  Buzz looks to Neil.   Neil nods. BUZZ (INTO COMMS) Maneuver us to undocking attitude.   MIKE COLLINS (COMMS)  Roger.  We hear the CSM THRUSTERS repositioning the combined craft... the moon   TURNING SLOWLY   in the window. MIKE COLLINS (COMMS)  Maneuver on target.   15 seconds.  Neil reaches for the throttle.   PUSH IN   on his tired eyes...  JUMP CUT   to his WATCH... seconds ticking by... until at last we HEAR the probe above them   RETRACT . MIKE COLLINS (COMMS)  There you go.  Neil   PUSHES   the thruster.   The LM slowly moves from the CSM. CAPCOM (COMMS)  Eagle, we see you on the steerable.  Neil looks towards the waiting moon.   PUSH OUT INTO   --  EXT. LUNAR MODULE, LUNAR ORBIT - CONTINUOUS FROM AFAR   we see the LM slowly BREAKING AWAY from the CSM... NEIL (COMMS)  Roger.   The Eagle has wings.  The gas jets   ROTATE   the LM, pointing the landing gear forward. CAPCOM (COMMS)  Go for powered descent.   MIKE COLLINS   (COMMS)  Go for PDI, Eagle.  129. BUZZ (COMMS)  Roger.   We read you.  But Buzz sounds   CONCERNED   as we   PUSH BACK INTO   --  INT. LUNAR MODULE - SAME TIME  Neil   STRUGGLES   with a BREAKER on the console.   It’s come LOOSE,   Neil tries to JAM it back into place. NEIL ...cottonpicker won’t stay.   CAPCOM (COMMS)  Eagle, Houston. Alignment is go.   One minute to ignition.  BUZZ We should report the breaker. Neil doesn’t respond, just keeps working on it. CAPCOM (COMMS)  40 seconds.   BUZZ Protocol says we should --  BANG!   Neil   POUNDS   the breaker back in.   It stays. NEIL Let’s prep for descent. Neil gets to work, like nothing happened.   For a moment, Buzz stands, staring...   UNEASY , knowing his life",
      "dialogue_count": 0,
      "word_count": 3494
    },
    {
      "scene_number": 18,
      "slugline": "EXT. QUARANTINE FACILITY, MSC - AUGUST 10, 1969, NIGHT (9PM)  Three BLACK CARS parked in front of the building.   Doors open and Mike, Buzz and Neil exit with duffels, MILITARY ESCORTS. The men BREATHE IN the fresh air... then walk to the cars.  INT. TOWN CAR (MOVING), MSC GATE   - NIGHT  Neil sits in back, quiet, as the car pulls up to the MSC gate. The escort beside him rolls down the window, hands papers to a GUARD.   He starts to wave them through... but can't resist. GUARD Mr. Armstrong, you make us proud. Neil nods, AWKWARD.   The escort rolls up the window and the driver pulls forward.   A beat, then... ESCORT He’s right, you’re a real hero.   I bet you’re the most famous man in the world. Neil gives the escort a tight smile, his eyes   TICKING   to a NEWS VAN that starts to tail them.   Off Neil,   TENSE ,   CUT TO   --  EXT./INT. TOWN CAR (MOVING) - NIGHT  The town car turns off the main road into a suburban development.   THREE NEWS VANS now follow behind.  INSIDE THE CAR   Neil’s ANTSY.   The car turns a corner and we see... a   HUGE MEDIA CIRCUS .   TV trucks, reporters, fans camped out at Neil’s house.   Neil’s jaw goes   TIGHT   as the car stops. ESCORT I’ll clear a path. The escort opens the door.   Neil steps out and is   SWARMED ...  INUNDATED   with questions,   BLINDED   by an ARSENAL of CAMERAS.  PUSH IN   on Neil as he presses through it, eyes down... until a  LITTLE GIRL   steps forward.   With a model rocket.   Neil   PAUSES . FATHER Would you mind signing it for her? Neil’s eyes   TICK   from the girl to her father.   A beat, then he takes the model.   The reporters   QUIET .   One hands him a pen. NEIL Uh, what’s your name?  142.",
      "characters": [],
      "action_text": "GIRL ...it’s Katherine. Neil blinks at her.   The WONDER in her eyes is oddly   DAUNTING . Awkward, he signs the rocket.   But when he hands it back... MULTIPLE FANS (calling out) Can I get an autograph, Neil? / Can I get a picture, Mr. Armstrong? Neil BLANCHES.   The calls grow into a   ROAR , TAKING US TO   --  INT./EXT. CONVERTIBLE, NEW YORK CITY - AUGUST 13, 1969, 10AM  A RIVER of HUMANITY.   A huge crowd gathered for the largest  TICKER TAPE PARADE   we’ve ever seen.   The   DIN   is   DEAFENING New York City - August 13, 1969  Find Neil in an OPEN-TOP CONVERTIBLE with Buzz and Mike. Neil’s eyes have   DARK CIRCLES   underneath; they   DART   from the crowds on the streets, to the men and women hanging out of building windows, tossing down stacks of IBM punch cards... Buzz and Mike enjoy it more than Neil, but even they seem OVERWHELMED.   Off Neil, smile   PLASTERED   to his face,   CUT TO -- INT. CENTURY PLAZA HOTEL, BALLROOM - LA - AUGUST 13, 1969  A packed ballroom.   Black tie.   President Nixon, forty odd Governors, Hollywood Stars and dozens of other dignitaries. A gala to end all galas.   Everyone   GIDDY   in anticipation. From BEHIND the empty head table, we see GOVERNOR RONALD REAGAN clink his glass into the mic at the rostrum. GOVERNOR REAGAN (O.C.) Ladies, Gentlemen, I understand our guests of honor have just arrived. If you’ll take your seats... As the crowd sits, we   PUSH INTO   --  INT. GREEN ROOM, CENTURY PLAZA HOTEL - SAME TIME  Neil, Buzz, Mike and their wives stand, waiting to be introduced.   Neil is at the back,   SWEATING   now. DEKE Who wants a beer? Deke walks in with beers for the men.  143. GOVERNOR REAGAN (O.C.)  How about a California welcome for Command Module Pilot Mike Collins!  MIKE COLLINS Put mine on ice, will ya? As Mike heads off, Deke pulls Neil off to one side. DEKE Everything okay? NEIL I got the itinerary.   25 countries? DEKE The whole damn world wants to give you guys a hug. NEIL When can we get back to work? DEKE Thi",
      "dialogue_count": 0,
      "word_count": 767
    }
  ]
}