{
  "slug": "flatliners-2017",
  "title": "flatliners",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 16,
  "characters_count": 0,
  "characters": [],
  "total_words": 19070,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. CHARLES RIVER - DAY Harvard BOAT CREWS out there practicing.   Classic Ivy League scene. INT. FACULTY CLUB RECEPTION HALL - DAY Stately and clubby.   Windows overlook the Charles River. Some faculty awards reception going on.   A DOCTOR drones on at the podium.   MEDICAL SCHOOL FACULTY, most of them middle- aged or older, gathered with cocktails.   MED STUDENTS have been drafted into working the event.   Jamie and Priya -- doctor coats gone -- manning a drinks table in the back. JAMIE It’s all so self-congratulatory. These stodgy old docs with their white wine and lifetime achievement awards. PRIYA What’s wrong with all that? JAMIE It’s yesterday’s thinking.   I certainly didn’t come to Harvard to spend the next forty years doing prostate exams. (a doctor stops at the table) Try this chardonnay, Dr. Greenberg, just a hint of oakiness. (the doctor moves on with the drink) Today it’s all about being an entrepreneur.   Fifteen percent of our class will be graduating with a second professional degree along with their MD. PRIYA You’re making me more nervous than I already am. JAMIE I’m just saying, there’s major money to be made out there.   Why practice medicine when you could run a hedge fund or start a bio- tech company?   Or write a book. Give Ted lectures.   Go on CNN.  18.",
      "characters": [],
      "action_text": "Priya’s got her phone out, looks at her watch, snaps a quick, joyless photo of herself -- JAMIE (CONT’D) “Hi, Mom.   It’s my six p.m. check- in.” PRIYA Lay off, okay?   There’s nothing I can do about her right now. JAMIE Did she really move to Boston just to keep tabs on you? PRIYA I don’t think she came for the clam chowder. LOUNGE AREA Marlo at the fringes of the reception, accompanied by SAM, her handsome, stock-broker fiance.   He’s restless. SAM Why did you drag me to this thing? MARLO So you could savor the Thai shrimp skewers.   Sam, I asked you here so we could see one another for more than twenty minutes each day. SAM (absorbed with his phone) I should get back to the office. Market’s still open. MARLO I hate to break this to you, but the wedding’s not going to happen on its own.   We have to start making some decisions. SAM No, we don’t.   I got you the name of that wedding planner my sister used.   Who wants to waste time debating roses or tulips for the centerpieces? MARLO Wars have been fought over roses versus tulips as centerpieces.  19. SAM Holy crap. (seeing someone across the room) That guy over there manages a huge pension fund.   I’ve been chasing him for months. MARLO But... He hurries off.   Marlo left there. INT. CAFETERIA - MGH - DAY A huge dining complex.   Courtney hesitating there by the salad bar.   Eyeing someone out in the dining room. Jamie at a table.   He’s wolfing down ice cream as he checks sports scores on his phone. COURTNEY You got plans tonight? Courtney wanders up.   Trying to be casual as she sits down with a plate of fruit. JAMIE First years are having a wing-ding. Dorm punch and a DJ, but I’m not above it.   I can’t wait for the anesthesia rotation.   Those guys have access to the best drugs. COURTNEY I was thinking maybe we could meet up later.   You and me. JAMIE What, to study? COURTNEY Not exactly. Jamie taken aback. JAMIE What the hell, why not?   A little stress relief. COURTNEY Midnight.   Basement sublevel C.  20. J",
      "dialogue_count": 0,
      "word_count": 984
    },
    {
      "scene_number": 2,
      "slugline": "INT. IMAGING ROOM - BUNKER COMPLEX - NIGHT A small room but it houses an entire radiology department. There’s a workstation of screens.   Two MRI imaging scanners. And they’re powered up.   Courtney’s turned on the equipment but kept the room dimly lit.   As if for a seance. Courtney sticks a FLASH DRIVE in a computer. ON THE MONITORS BRAIN SCANS coming up.   Several of them proliferating across all the screens. Priya taking this all in.   The mystery of it. PRIYA What exactly are you up to? JAMIE Wow, two of you? Priya turning -- startled -- Jamie appears in the doorway. PRIYA Jamie?   What are you doing here? JAMIE She didn’t tell me about you, either, okay? (sauntering in) But I’m open to a three-way. Priya perplexed.   Looking to Courtney for an explanation. JAMIE (CONT’D) I like it.   Scanners.   Cameras. Our choice of beds.   We can be as loud as we want. PRIYA Courtney, what’s going on? COURTNEY I asked for his help, too.   He probably misinterpreted. JAMIE Wait, we’re not going to get it on? PRIYA What are you talking about?  23.",
      "characters": [],
      "action_text": "COURTNEY I need both of your help. (the imagery on the screens) These are post-mortem brain scans of patients who have died here in the hospital.   I’ve been searching for the region of the brain responsible for generating the so- called near-death experience. JAMIE Is there any circumstance under which you would have sex with me? COURTNEY Near-death experiences are similar across cultures.   White light. Floating up.   Powerful sensation of well-being.   Over and over, the stories come back the same way. Therefore, ergo... there has to be a chemical -- a protein -- that’s responsible for it.   A compound that transitions us from life to whatever comes next. PRIYA What do you mean ‘what comes next?’ We’re dead.   Nothing comes next. COURTNEY It’s the last sensation our brain provides us.   If we can spot the protein, isolate it, analyze it... JAMIE Then you’ll make quite a name for yourself. COURTNEY The goal is to understand what happens to us chemically.   You heard Wolfson.   We’re here to tackle big challenges not rubber stamp our diplomas. JAMIE (to Priya, excited now) See?   This is what I was talking about earlier.  24. COURTNEY Medical knowledge has always gone dark at the moment of death.   The brightest minds throw up their hands, admit their own ignorance and helplessness.   But it doesn’t have to be that way.   We can push back on it, lift the veil, for seconds, minutes even, see what’s there. JAMIE So you think there’s some protein hiding in the brain that no one else has discovered? COURTNEY We can’t know for sure until we observe exactly what happens in the brain at the time of death.   So I’d like you two to stop my heart. Nothing.   No response.   They don’t understand. COURTNEY (CONT’D) I’ll be in the imaging scanner. We’ll get real-time pictures of my brain’s neuro-chemical activity. Give it a minute or two, then bring me back. She’s laying out supplies now.   Syringes.   Full steam ahead. JAMIE Stop your heart.   You’re serious. COURTNEY (a syrin",
      "dialogue_count": 0,
      "word_count": 3020
    },
    {
      "scene_number": 3,
      "slugline": "INT. CONFERENCE ROOM / NEUROLOGY UNIT - MGH - DAY Whole neurology team’s assembled for another morning meeting. And there’s a large basket of HOMEMADE BREAD on the table. Dr. Wolfson takes a bite.   Marvels at the taste.   Most others in here enjoying the bread, too. Jamie and Marlo, hazy from lack of sleep, eye Courtney, who sits there showered, bright and perky.   Priya, meanwhile, slogs through a case presentation.   Despite the adventures of last night, they all still have to perform at a high level. PRIYA We’ve been ramping Miles Evergreen up on meds for 12 hours but his epilepsy hasn’t been getting any better.   Now he’s developed a skin rash. RESIDENT It’s a mystery.   The drugs should be working. COURTNEY Carbamazepine. PRIYA What? COURTNEY Carbemazepine has an eleven-percent chance of reacting negatively with lamotrigine, which is Miles’s other drug. DR. WOLFSON Good catch, Courtney.   We’ll check on that.   Next case, Priya. PRIYA Adele Gunther, 44-years-old, admitted with mild confusion, claims her family and friends are impostors, she doesn’t recognize them.   She’s too young for dementia, we’re sending it out to psychiatry for a consultation -- COURTNEY It’s Capgras Syndrome. They all turn.   Courtney caught.   Again, no real intention of speaking.   Just slipped out.  39.",
      "characters": [],
      "action_text": "DR. WOLFSON Go on. COURTNEY Capgras is an impairment of the brain’s facial recognition center. DR. WOLFSON And a very rare diagnosis. COURTNEY V.S. Ramachandran, in his book Phantoms of the Brain, links frontal cortex dichotomies like this to Capgras. DR. WOLFSON That book’s not on the syllabus. COURTNEY It was optional reading in my first year. Perplexed silence.   Dr. Wolfson doesn’t quite know what to make of Courtney. DR. WOLFSON Well.   This is more like it. INT. RESIDENTS ROOM - NEUROLOGY UNIT - DAY Priya bursts in here, distraught.   Courtney following, trailed by Jamie and Marlo. PRIYA You pulled that carbemazepine crap out of nowhere.   Drug warnings run twenty pages long.   How could you possibly remember reading it? MARLO It’s like your brain rewired itself.   You’ve got access to everything you ever learned. RAMON I thought we were done with this. Ramon coming in.   Shuts the door for privacy. MARLO Obviously not.   Whatever happened in there changed her.  40. RAMON I don’t care what happened or didn’t happen.   I worked too hard to get in trouble over some morbid fixation you guys have. MARLO Would you like some chalk to break? RAMON You all think you’re medical pioneers?   You’re just rich kids screwing around before you become wealthy specialists with Harvard bumper stickers on your Mercedes. JAMIE I was with you until the end.   No one puts a bumper sticker on a Mercedes. Ramon a brick wall.   Yanks open the door to leave. RAMON This ends right now. INT. OCCUPATIONAL THERAPY ROOM - MGH - DAY The rehab wing.   THERAPISTS work with PATIENTS on balance beams, resistance balls.   Courtney, meanwhile, sits at an old, upright PIANO.   She’s working her way through a piece of classical music.   Tentative at first, then with increasing speed and confidence. Marlo, Priya and Jamie entering.   Seeing this. COURTNEY I haven’t played the piano since I was twelve. It’s improving with every second.   Courtney delighted. Nearby, the others quietly confer.   Uneasy ",
      "dialogue_count": 0,
      "word_count": 3053
    },
    {
      "scene_number": 4,
      "slugline": "INT. SWIMMING POOL Marlo drowning.   Dying.   This is what it feels like. BOTTOM OF THE POOL Painted there on the bottom -- a long NUMERIC SEQUENCE -- too much to take in -- 414000270929221 INT. IMAGING ROOM - NIGHT KA-THUNK -- Ramon -- the defibrillator again -- COURTNEY Nothing. All flatlines.   Ramon rattled.   Grabbing an oxygen mask now. Struggling to untwist its straps and -- JAMIE I got this, chief. Jamie taking the oxygen mask.   Steadier hands.   He slips the mask over Marlo’s face, then takes up the defibrillator. JAMIE (CONT’D) One more time, okay?   Charge 300. Clear!  THUNK!  INT. SWIMMING POOL Marlo sinking.   No more fight.   No strength.   Just drifting down.   Turning away from the numbers to see -- A DEAD WOMAN FLOATING ABOVE HER The woman’s eyes hideously open -- tongue out -- long tangled hair floating crazily -- a shocking grotesque and -- MARLO -- she SCREAMS IN TERROR and -- INT. IMAGING ROOM - NIGHT Marlo coughing under the mask -- heart monitor BEEPING --  55.",
      "characters": [],
      "action_text": "JAMIE We got her! EXT. ROOF - MGH - NIGHT Cold wind.   Marlo wrapped in a blanket and lying in Courtney’s lap.   Marlo’s pale and shaking violently.   Ramon nervously checking her with a stethoscope and eye light. RAMON Her temp’s low.   And her pulse is still racing. COURTNEY Maybe three minutes was too long. JAMIE She had a bad trip.   It happens. RAMON Like you’re an expert. JAMIE More than you. PRIYA (O.S.) Is she okay? They turn.   Priya coming out here, breathless, like she’s run all the way to the hospital. COURTNEY Where have you been, Priya? JAMIE Marlo’s fine.   She’ll be okay. PRIYA Then I’m going next.   Right now. COURTNEY Right now? PRIYA I made up my mind. COURTNEY There’s no time.   Cleaning crew comes down there in twenty minutes. PRIYA Don’t argue with me.   I’ve finally gotten up the courage. (MORE)  56. I saw what you did during rounds. And Courtney, too.   Flatlining made you better doctors, made your minds work faster. RAMON Aren’t three flatlines enough? What else do you need to find out? This isn’t science.   It’s Russian Roulette. MARLO Let her do it. They turn.   Marlo sitting up.   White as a ghost.   Hair wild. A weird intensity. MARLO (CONT’D) It’s her choice. EXT. EARTH’S UPPER ATMOSPHERE - NIGHT Flying -- fast -- over a hemisphere darkened with nighttime. Cities below -- clusters of light -- like fairy dust and -- THE HORIZON -- this vast turning arc -- then SUNRISE flaring over the continent -- And we’re dropping down now -- landscape flying beneath us -- descending over fields -- trees -- a CHURCH STEEPLE -- streets -- houses -- it’s MORNING over a SMALL NEW ENGLAND TOWN -- a SCHOOL BELL’S RINGING -- as we drop down into -- EXT. HIGH SCHOOL - MORNING HIGH SCHOOL STUDENTS milling around before class.   As a CAR pulls up -- INT. CAR - MORNING Drop-off time.   PRIYA’S MOTHER is ten years younger here. Beside her is 15-YEAR-OLD PRIYA.   Even here she’s worn down. PRIYA’S MOTHER A B-plus on a biology exam is not acceptable.   Do you under",
      "dialogue_count": 0,
      "word_count": 537
    },
    {
      "scene_number": 5,
      "slugline": "INT. HALLWAY - HIGH SCHOOL - DAY Bustling with kids.   As the school’s INTERCOM comes on with a whine of feedback, then -- 15-YEAR-OLD PRIYA (V.O.) Attention everyone -- and now a reading from the diary of Irina Wolshack -- INT. JANITOR CLOSET - HIGH SCHOOL - DAY Locked door.   15-YEAR-OLD PRIYA in here, accompanied by two FRIENDS.   There’s an open DIARY on Priya’s lap, a page of which she reads into a MICROPHONE she’s pulled in here -- 15-YEAR-OLD PRIYA April 10th.   My mother won’t stop nagging me day and night.   Now she says I’m dangerously thin.   She’s threatening to take me back to the doctor. INT. HALLWAY - MIDDLE SCHOOL - DAY Kids now paying attention -- amazed -- 15-year-old Priya’s snappy voice reverberating everywhere in the school -- 15-YEAR-OLD PRIYA (V.O.) (intercom) I haven’t eaten in two days and the very thought of food disgusts me. We feel the electricity in the crowd -- excited looks -- all these teenagers -- sensing blood in the water -- INT. JANITOR CLOSET - MIDDLE SCHOOL - DAY 15-year-old Priya going for it -- pure delight -- finding a release in this -- and her giggling friends egging her on -- 15-YEAR-OLD PRIYA And only I know that no matter how many times I throw up, I will always look in the mirror and see someone bloated and disgusting.  58.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 231
    },
    {
      "scene_number": 6,
      "slugline": "INT. CLASSROOM - MIDDLE SCHOOL - DAY Priya’s voice going on and on -- everything has stopped -- twenty-five smirking HIGH SCHOOL FRESHMEN utterly frozen as -- IRINA WOLSHACK -- there she is -- poor-girl -- 15 years old -- isolated -- surrounded -- helpless -- humiliated -- And finally she runs from the room as -- INT. CORRIDOR - BUNKER COMPLEX - MGH - NIGHT THUD.   A freight elevator arrives.   We’re back to the present.   The hospital.   And a JANITORIAL CREW comes out of the elevator pushing cleaning carts into the corridor as -- INT. IMAGING ROOM - BUNKER COMPLEX - NIGHT Jamie -- panic -- sprinting over from the doorway -- JAMIE -- cleaning crew’s here! -- get her out! -- Mad scramble -- the scanner’s bed retracting Priya from the imaging dome -- Ramon grabbing the paddles -- RAMON -- clear! -- KA-THUNK -- the shock -- Priya’s chest heaving -- COURTNEY -- nothing -- MARLO -- starting compressions -- RAMON (works a syringe) -- one cc epi -- in -- The two of them working fast on the unresponsive Priya -- Courtney bagging up equipment -- powering down screens -- JAMIE (at the door) -- that’s it -- we’ve gotta go -- MARLO (doing chest compressions) -- come on, breathe! --  59.",
      "characters": [],
      "action_text": "RAMON -- where’s the blanket? -- COURTNEY -- what’s taking so long? -- RAMON -- you want to take over, be my guest -- Jamie suddenly running out of the room -- COURTNEY -- hey -- where the hell’s he going? -- Marlo’s stopped the chest compressions -- out of breath -- MARLO -- please God -- please bring her back -- RAMON -- good thinking, doctor -- I’m sure that’ll help -- He’s pushing her aside -- no nonsense -- the defibrillator -- KA-THUNK -- Priya jolted -- nothing -- INT. CORRIDOR - BUNKER COMPLEX - NIGHT Jamie arriving here in the shadows as -- The CLEANING CREW heading for the imaging room.   Only seconds away from discovering them and -- Jamie thinking fast -- darts out and PULLS THE FIRE ALARM -- INT. IMAGING ROOM - BUNKER COMPLEX - NIGHT Lights.   Sirens.   All hell breaking loose from the alarm as -- THUNK!   The defibrillator one more time and -- COURTNEY -- that’s it -- she’s back! -- Ramon scooping Priya up in his arms -- they’re rushing out of here as --  60.",
      "dialogue_count": 0,
      "word_count": 402
    },
    {
      "scene_number": 7,
      "slugline": "INT. BUNKER COMPLEX CORRIDORS - NIGHT SECURITY OFFICERS emerging from the elevator now.   Hard to know if Jamie’s made things better or worse and -- INT. BASEMENT STAIRWELL - MGH - NIGHT Courtney and Marlo hurrying up the stairs.   Ramon carrying Priya in his arms.   Alarms screaming. INT. PARKING GARAGE - MGH - NIGHT A door bangs open.   Marlo leading them to her parked AUDI. INT. AUDI - NIGHT Marlo slides behind the wheel.   Ramon tucking Priya in the back.   The others piling in.   Marlo guns the engine -- RAMON -- should you really be driving? -- Marlo drops it in gear -- tires squealing -- zooming forward down the ramp when -- COURTNEY LOOK OUT!!! SOMETHING FLASHES IN FRONT OF THE CAR BAM! It’s JAMIE -- he’s hit -- tumbles up onto the windshield -- WHAM! Jamie rolls back off the hood -- up again -- miraculously okay -- someone opens a door and he’s diving in -- RAMON You okay? COURTNEY You bastard, you ran out on us! JAMIE The hell I did!   I sprang you all! COURTNEY You what?!  61.",
      "characters": [],
      "action_text": "Security Guards now spilling out of the stairway -- RAMON Go! Marlo floors it -- Audi screeches away -- Jamie, Priya and Courtney laughing in crazy delight -- EXT. PARKING GARAGE - MGH - NIGHT A gate arm -- POW! -- SMASHED to bits -- THE AUDI squirting out of here -- skidding -- bouncing -- sparks flying as -- EMERGENCY VEHICLES arriving -- the Audi nimbly weaving between FIRETRUCKS and -- INT. AUDI - NIGHT The Audi ripping through gears -- Marlo -- laser focus -- pushing it towards 100 m.p.h. -- adrenaline flying -- MARLO Where are we going? And now the sound of a DANCE BEAT as we CUT TO: INT. BALLROOM - HARVARD SOCIAL CLUB - NIGHT A cavernous, vaulted ballroom PACKED WITH MED STUDENTS dancing and cutting loose.   Open bars, drunken misbehavior, a DJ presiding. CAMERA FINDING Brad Poitras, the preening third-year we’ve seen around the hospital, dress shirt unbuttoned too far, cocktail in hand, leads Marlo and the rest of them through the crowd. MARLO (over the music) Whose party is this? BRAD Jerry Tsai! Across the room, a plastered JERRY TSAI being bourne aloft by a mob of friends on the dance floor. BRAD (CONT’D) You didn’t hear?   He’s a fourth year.   (MORE)  62. Invented a pacemaker app that Medtronic just paid $18 million for. EXT. BACK YARD - HARVARD SOCIAL CLUB - NIGHT The party spilling out here.   The walls of the massive house lit up by -- A BONFIRE An impromptu blaze built-up in a fire-pit.   Sparks swirl up into the starlit sky.   STUDENTS dance in the shadows and firelight.   All these bodies surging around.   And the smoke and the dance beat and the shriek of laughter. And there they are -- JAMIE, PRIYA, MARLO and COURTNEY. Dancing in the middle of it all.   Sensing each other’s strange, shared energy and -- PRIYA AND JAMIE Getting close -- caught up the hormonal rush -- MARLO As she dances.   Transported.   Immortal.   It’s better than any drug.   Vision clearing a moment -- looking around to see -- RAMON On the sidelines.   The periphery.   Left to",
      "dialogue_count": 0,
      "word_count": 2090
    },
    {
      "scene_number": 8,
      "slugline": "INT. SAILBOAT SHOWER - NIGHT Jamie naked, showering.   It’s a tiny, cramped space, almost no room to move in here but he’s used to it. Suddenly everything goes dark.   The water stops. Jamie stands there soaped up, dripping.   Huh?  GALLEY The boat is now dark.   Silent. SHOWER Jamie baffled.   He curses.   Flicking dead switches. JAMIE Shit. He wipes the soap from his face and prepares to step out of the shower when he hears -- A CREAK.   OUTSIDE THE SHOWER DOOR. MORE CREAKS NOW.   SOMEONE’S COMING DOWN THE GALLEY STAIRS. Jamie frozen there.   Fear edging into his voice as -- JAMIE (CONT’D) (calling out) Who’s there? CLOP.   CLOP.   FOOTSTEPS APPROACHING THE SHOWER.   Literally this thing is just outside the door! Silence now.   Jamie hesitating there.   Naked.   Helpless. THE SHOWER DOOR The doorknob begins to twist -- CLICK! -- Jamie quickly slides the locking bolt closed. JAMIE (CONT’D) I’m calling the cops! (then) Get the hell off my boat! Twist -- twist -- twist.   The person on the other side struggling to force the locked door open.   Fuck! He’s caught.   Looks around.   Grabs a large bottle of bath gel.   Not much of a weapon.  72.",
      "characters": [],
      "action_text": "His hand on the lock now.   Readying himself to throw open the door and clobber whoever it is.   Three... two... one... THE WHOLE SAILBOAT STARTS ROCKING BACK AND FORTH Like it’s been lifted up by some huge beast and shaken -- Jamie shouting -- pure terror -- he’s a blur -- tossed and slammed around like a shoe inside a washing machine -- And then it’s over.   The boat settles back.   Comes to rest. Jamie grunting there, battered, traumatized, when -- The power runs.   Lights.   Shower.   Music playing again. Click.   The shower door falls open.   No one there. INT. COURTNEY’S APARTMENT - NIGHT Movement -- it’s Courtney -- stumbling from room to room -- escaping something -- shallow breathing -- frightened -- eyes blood-shot -- something seems to be chasing her -- this terrifying home invasion -- and we can’t see what it is -- Courtney barreling down the hall -- full flight -- white hot terror -- dashing into the LIVING ROOM and -- THE FIRE ESCAPE Her closest way out.   Agonizing seconds as she fumbles with the window latch -- don’t look back -- The window flies open -- Courtney squeezes through -- onto the FIRE ESCAPE -- this ICY, IRON PLATFORM -- she slips -- falls out of frame -- CRIES OUT AND -- CUT TO BLACK. EXT. BEACON HILL NEIGHBORHOOD - PREDAWN Those handsome townhouses.   Not a light on. INT. BEDROOM - MARLO’S TOWNHOUSE - PREDAWN All is quiet.   A Tiffany clock ticks on Marlo’s nightstand. Marlo lies in Ramon’s arms. MARLO I hope this doesn’t become awkward.  73. RAMON Too late. MARLO You must think I’m a terrible person. RAMON Why? MARLO First I tell you I’m responsible for the death of a patient.   Then I go and cheat on my fiance. (sitting up) Seriously.   What do you see in me? We fight all the time.   We disagree on everything.   What do you like about me?   Beyond the obvious fact I’m really hot. RAMON I guess it’s your humility I’m drawn to. MARLO Shut up. She settles back down.   Like she’s not going to get anything out of him.   Ramon gets up.   Ga",
      "dialogue_count": 0,
      "word_count": 1835
    },
    {
      "scene_number": 9,
      "slugline": "EXT. SAILBOAT - BOSTON MARINA - NIGHT On deck now.   THICK MIST everywhere.   Dark vessels surround the boat.   Their rope lines creak.   Jamie comes up the galley steps.   Poised there.   Knife visible in the dim light. His flashlight goes on.   Peering forward.   Scanning the boat. He’s moving forward now.   Threading his way through the lines.   Flashlight beam playing over the bow.   The water. The dock.   Then up into the mast.   The shrouds. Jamie now at the bow.   Senses tingling.   Can feel this kid. ALEX  Wood and clay will wash away, wash away, wash away...  He spins.   Alex is two feet away. ALEX (CONT’D)  Wood and clay will wash away --  Alex’s big face in his shaking flashlight.   Jamie gulping there.   Backing away slowly.   Finding his voice -- JAMIE Okay... Easy, kid... What do you want -- Jamie slips -- falls overboard -- DARK WATER Jamie surfacing there.   Shouts from shock of the cold water. He’s swimming for the dock.   Finds a handhold and starts pulling himself up when -- SLAM! Jamie’s hand -- it’s IMPALED BY HIS OWN SAILOR KNIFE -- he SCREAMS -- ALEX -- right there on the dock -- he’s just stabbed him -- Alex walking away into the night. INT. BASEMENT - MGH - NIGHT Long, stark hallway.   Marlo creeping around down here. Checks to make sure she’s alone and enters --  81.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 228
    },
    {
      "scene_number": 10,
      "slugline": "INT. HOSPITAL MORGUE - NIGHT An eerie still-life.   Tiled walls.   Steel sinks.   Hanging scales.   Drains in the floor. Marlo casting an uneasy eye around.   Then, her phone out, dialing a number -- A PHONE RINGING IN HERE.   It jolts her.   Marlo walking into the room, trying to hone in on Courtney’s hidden phone. There.   A FILE CABINET.   Marlo curses as she finds it locked. COURTNEY (V.O.) Hi, this is Courtney.   Leave a message. Marlo hangs up.   Goes to a DESK.   Opens a drawer.   Spots a KEY.   And now she hears a RUMBLING SOUND -- she turns -- A GURNEY -- out of nowhere -- it comes barrelling right at her -- she jumps aside -- BAM! The gurney smacks into a wall. Marlo eyeing the room.   The equipment.   The areas hidden by shelving.   Nothing moves.   What the fuck? Moving fast now, unlocks the file cabinet.   Finds a plastic bag inside.   Courtney’s clothes.   Bundled and sad there. She casts a quick eye on the gurney again.   The room.   Then, steeling herself, she searches through the bag of Courtney’s personal effects.   Finds Courtney’s cell phone.   Relief as she pockets it.   Done.   Get out.   Walking out when -- OVERSIZE DRAWERS there on the wall.   Body drawers.   Marlo staring at them.   Sadness welling up.   Before she can stop herself, she hauls open a drawer and -- Drawer’s open now.   She doesn’t want to look.   But does and -- HER POV COURTNEY’S FACE -- gruesome close-up -- the features frozen in a grimace of horror. Marlo shocked.   Will never get that sight out of her head. Ever.   She continues to stare when -- BEHIND HER  82.",
      "characters": [],
      "action_text": "A FREEZER DOOR SWINGS OPEN Marlo hears it creaking.   Turns around. The freezer door now stands open.   Inside the freezer, the FAN from an air-conditioning unit slowly turns. MARLO It’s all in your head. She’s walking forward now.   Determined to get the better of all this. Drip.   Drip.   Drip. WATER leaking out from the freezer.   Spreading over the floor. MARLO (CONT’D) All in your head... As Marlo nears the freezer, we see further into its tiled room... the floor-to-ceiling shelves holding DEAD BODIES WRAPPED IN PLASTIC TARPS... And just as Marlo arrives in the doorway with the intention of shutting the freezer door -- WHACK! A FAT ARM FLOPS DOWN FROM A SHELF AND SMACKS HER IN THE FACE INT. BASEMENT - MGH - NIGHT The morgue’s doors bang open -- Marlo racing out of there. EXT. IRISH PUB - NIGHT Cozy little place hidden away on a quiet corner.   Cold wind blowing as Ramon walks up.   Jamie arriving at the same time. RAMON What happened to your hand? Jamie’s hand -- it’s now bandaged up. JAMIE Just get inside.  83. A furtive look around, like it’s a secret meeting, and they both head into the pub. CUT TO: CELL PHONE VIDEO FOOTAGE There’s Courtney, in her apartment, facing the screen.   She’s making a video.   She’s exhausted.   Traumatized. COURTNEY (on the phone, talking back to the camera) Monday.   March 22nd.   2:15 a.m. There has to be an explanation for what’s happening to me. Hypothesize hallucinations brought on by neurochemicals released by flatlining. (struggling to think straight, clinging to reason) Option two, rewiring of the frontal cortex, impairing perception. She stops.   Sudden.   Sharp turn.   As if hearing something. PULL BACK TO REVEAL -- INT. IRISH PUB - NIGHT Ramon, Jamie, Courtney and Marlo all gathered here.   They’re watching the video on Courtney’s phone. ON THE SCREEN She’s creeping through her apartment now.   Phone-camera in front.   Filming as she goes.   The HOLE in the wall.   Gaping there. Then down a hallway.   Empty space has ne",
      "dialogue_count": 0,
      "word_count": 2619
    },
    {
      "scene_number": 11,
      "slugline": "EXT. OFFICE PARK - NEWTON, MASSACHUSETTS - DAY We’re now in a quiet Boston suburb.   Priya’s rental car pulling into the parking lot.   A tech firm’s logo out front. JAMIE You’re sure it’s the same Irina? INT. LOBBY - TECHNOLOGY COMPANY - DAY A posh, hi-tech firm.   Priya waiting in a quiet, glass- enclosed reception area.   A RECEPTIONIST hangs up a phone. RECEPTIONIST She’s coming out. Priya nods.   Fidgeting there.   Then rises as someone comes out to meet her. PRIYA Irina? This is IRINA WOLSHACK.   She works here.   A lovely young woman of 24.   But she doesn’t quite know who her visitor is. IRINA Yes? PRIYA It’s Priya.   From North Hadley. (Irina doesn’t react) We were in high school together. Irina looking her over.   And the surprise giving way to unease.   It’s not a happy reunion. PRIYA (CONT’D) I know it’s been forever, but I need to talk to you. (just going for it) I stole your diary and read it to the school over the intercom. Remember? Of course Irina remembers.   But she’s at a loss right now. Ambushed by this encounter. INT. RENTAL CAR - DAY Doors locked.   Windows up.   Jamie hunched in the passenger seat.   Waiting here in the parking lot.   Edgy.   Paranoid.  95.",
      "characters": [],
      "action_text": "SLAP! A HAND SMACKS HIS WINDOW FROM OUTSIDE ALEX RIGHT THERE LOOKING IN ON HIM! Jamie -- pure heart attack! -- lunges away -- across the inside of the car and -- EXT. RENTAL CAR - DAY -- the driver door flies opens -- Jamie comes lurching out -- hanging onto the door -- catching his breath -- He looks over.   Nothing there.   His shoulders sag.   Nerves shot.   Half laughing, half crying. EXT. OFFICE PARK - DAY The two women walking on a path through manicured grounds. IRINA It was a long time ago, okay? PRIYA It was an awful thing to do.   I keep asking myself why I did it. It was so unlike me. Irina just looking at her.   Then Priya realizing. PRIYA (CONT’D) No.   You’re right.   It was like me. IRINA What do you want from me? PRIYA I’d like you to accept my apology. IRINA That’s not necessary.   I moved on. PRIYA Please.   It’s important.   I want to make amends. IRINA What you did to me was humiliating and cruel.   It was one of the worst days of my life.   But I’m not 15 anymore.   I grew up. (MORE)  96. And I’m sorry, but you have no right to come find me years later because now you suddenly feel bad about it. (done here) I have to get back to work. Irina walking off.   Priya despairing there.   About to call out to her -- But doesn’t.   Doesn’t feel she has the right. IRINA (CONT’D) Priya! Irina by the doors.   Turned back.   Reconsidering.   Then smiles.   Sudden.   Open.   Letting go. IRINA (CONT’D) I forgive you. Priya taking that in.   To her very core. INT. RENTAL CAR - DAY They’re driving back to Boston.   Priya marvelling at it. PRIYA All those years I was carrying that. Sudden grace.   Priya turns to him. PRIYA (CONT’D) That’s all it’s about.   Atonement. EXT. HARVARD MEDICAL SCHOOL CAMPUS - DAY Marlo in her nicest clothes.   Approaching the imposing central building.   Her anxiety growing with each step. Having to force herself forward. INT. DEAN’S OUTER OFFICE - HARVARD MEDICAL SCHOOL - DAY An august space.   Walls crowded with photographs, portrait",
      "dialogue_count": 0,
      "word_count": 830
    },
    {
      "scene_number": 12,
      "slugline": "EXT. BOSTON STREET - DAY The rental car parked near the hospital.   Jamie and Priya getting out as Ramon runs up.   Stricken. PRIYA (sensing trouble) What is it? RAMON Marlo didn’t show up for call.   Her phone and pager are sitting in her bag in the residents room. JAMIE It’s Courtney all over again. RAMON Don’t say that. PRIYA I’ll check her house.   Ramon, try the other wings of the hospital. JAMIE I’ll cruise the neighborhood. Maybe she’s out walking around. They’re splitting up, running off. EXT. MARLO’S TOWNHOUSE - DAY Priya trying Marlo’s front door.   Locked.   Goes over to peer in a window.   The place completely shut up and quiet. INT. SKYBRIDGE - MGH - DAY Ramon hurrying through here.   Scanning the faces.   A lot of ground to cover. EXT. BOSTON STREETS - DAY Jamie on his motorcycle.   Rolling slowly down the block. Scanning the sidewalks, cafe windows, park benches. INT. RESIDENTS ROOM - NEUROLOGY UNIT - MGH - DAY Ramon enters.   Looks around the room.   Marlo’s expensive totebag there.   He sets it on the table.   Going through it. Removing things.  99.",
      "characters": [],
      "action_text": "Her iPad.   As he activates the screen, the number shimmers up in a search field -- 414000270929221 This cryptic sequence.   He gazes at it.   Just as stymied as she was. EXT. BOSTON STREETS - DAY Jamie’s motorcycle idling at a red light.   Across the street, a CITY BUS picking up some passenger at a BUS STOP. HIS POV QUICK GLIMPSE -- passengers getting on the bus -- among them, a WOMAN with a YOUNG BOY -- Jamie startled there.   The boy looks a lot like ALEX, the ghost from his flatline. And now the bus pulling away -- Green light.   Jamie kicking his motorcycle into gear, zooming after the bus. INT. RESIDENTS ROOM - NEUROLOGY UNIT - MGH - DAY Ramon pondering the number on the white board.   Then turning away.   Wandering the empty room.   Staring out the window. Then he sees it.   Tossed on the couch.   A HARVARD SWEATSHIRT. He picks it up.   Stares at the HARVARD MEDICAL SCHOOL LOGO. Then back at the number on the iPad. RAMON Gene sequence, my ass. He pulls up the website for Harvard med school. ON SCREEN -- That Harvard logo.   Sign-in page. ENTER   STUDENT   ID: He keys in THE NUMBER.   It fits exactly. ENTER   PASSWORD: He hesitates.   Stumped.  100.",
      "dialogue_count": 0,
      "word_count": 392
    },
    {
      "scene_number": 13,
      "slugline": "EXT. BOSTON STREETS - DAY Jamie’s motorcycle in the lane next to the bus, keeping pace with it.   He’s looking in the windows at the passengers. INT. MAIN LOBBY - MGH - DAY Ramon striding through the crowded concourse. INT. CAFETERIA - MGH - DAY Ramon grabs a dinner roll from the case.   He’s got some sort of plan here.   Walks to the CASH REGISTER. REGISTER CLERK (rings him up) Two fifty-nine. RAMON I left my wallet up in surgery. Can I charge it to my student ID? REGISTER CLERK What’s the number? RAMON (has it by memory now) 414000270929221. The clerk puts the number into the touch screen.   Ramon twists the screen to have a look -- a STUDENT PHOTO there -- RAMON (CONT’D) Brad Poitras.   Motherfucker! He’s bolting out of here and -- EXT. STREET CORNER BUS STOP - DAY Passengers unloading from the bus.   And here’s ALEX.   And not a scary ghost-Alex but a sweet six-year-old kid in a Spider Man jacket.   And with him is ALICIA -- 25 -- a single mother, distracted, dulled by hardship, just trying to get by. They’re both headed up the sidewalk when -- JAMIE Alicia. They look over.   Jamie’s parked his motorcycle.   Removing his helmet as he hurries up, out of breath.   Rattled.  101.",
      "characters": [],
      "action_text": "JAMIE (CONT’D) It is you. (relieved) I wasn’t sure.   I’ve was back there following. She’s staring at him.   Knows who he is.   Alex just standing there by her side. JAMIE (CONT’D) So.   Been a while, huh?   How’ve you been these past years? (to Alex, attempt at friendly) Who’s this? Alicia not having it.   Grips Alex’s hand tight. ALICIA What do you want, Jamie? JAMIE To apologize.   It’s my fault.   I took off on you.   I’ve been in school, actually.   A lot of school. (stumbling on) That summer -- I was stupid.   I got scared.   I panicked.   I should’ve been there for you. (can’t take his eyes off Alex) And I want to make amends.   Do what’s right.   Help you out. Money.   Anything.   Tell me what you need, Alicia. ALICIA I don’t need anything from you. (she’s turning to go) JAMIE Wait -- Alicia -- please -- (last ditch) Is he my son? She freezes.   People, traffic passing them by.   Jamie waiting there.   It’s life or death. But now Alicia’s leading the boy away.   It’s over.   Alex glancing back, confused. And Jamie stranded there.   Crushed.   A still point in a swirling world.  102.",
      "dialogue_count": 0,
      "word_count": 407
    },
    {
      "scene_number": 14,
      "slugline": "INT. CONFERENCE ROOM - NEUROLOGY UNIT - DAY A NEUROLOGY RESIDENT goes over some charts with med student BRAD POITRAS. NEUROLOGY RESIDENT His ICP’s still elevated.   See when he was last given an anticoagulant. INT. CORRIDOR - NEUROLOGY UNIT - DAY Brad emerging from the conference room -- back to work when -- RAMON Hey, Brad. Ramon.   Right there.   Weirdly solicitous. BRAD Hey, buddy. RAMON A few months back you had an ER rotation with Marlo.   Remember? There was a patient.   Shirley Gudgeon. BRAD Listen, I’m slammed right now, can we catch up later? Ramon -- very quick -- grabs him -- INT. FILE ROOM - NEUROLOGY UNIT - NIGHT Ramon propelling Brad in here -- BRAD -- what are you -- what the hell?! Door shuts.   Ramon in his face. RAMON What happened? BRAD -- what? -- RAMON The ER.   You.   Marlo.   Shirley Gudgeon.   Something happened.  103.",
      "characters": [],
      "action_text": "BRAD I don’t know what you’re talking about. WHAM.   Brad’s down.   Punch to the gut from Ramon. INT. CORRIDOR - NEUROLOGY UNIT - NIGHT The locked door.   Nurses gather in confusion.   Muffled GRUNTS from inside. INT. FILE ROOM - NIGHT Brad on the ground.   Catching his breath. RAMON You’d better talk. Brad silent.   Shocked. RAMON (CONT’D) Fine.   Maybe this will jog your memory -- (goes to pummel him--) BRAD Wait! Brad stunned there.   Incredulous. EXT. MAIN ENTRANCE - MGH - DAY Ramon walking out here.   On his phone.   Leaves a message. RAMON Priya, where are you?   I just found something out about Marlo.   Call me back. INT. MARLO’S TOWNHOUSE - NIGHT Curtains drawn.   Priya here.   Marlo working feverishly.   Last ditch plan.   Priya eyeing several mysterious containers. PRIYA What’s going on, Marlo? MARLO I’m going to find Shirley Gudgeon.  104. PRIYA What? MARLO I need to reach her.   She needs to hear my apology. Marlo lowering the shades.   Starts unpacking supplies.   Priya still putting it together in disbelief. PRIYA Marlo, that other place, it doesn’t go by our rules. MARLO I made it through once.   I can make it through again. PRIYA No.   It wants you.   You go in again, it’ll claim you. MARLO Not if you keep hold of the rope. INT. SKYBRIDGE - MGH - NIGHT Ramon staring out into the night.   Wrought with worry.   And now his PHONE lighting up with an incoming call -- INT. MARLO’S TOWNHOUSE - NIGHT Priya on her phone.   Anguished. PRIYA -- she just went in -- I tried to talk her out of it -- EXT. MAIN ENTRANCE - MGH - NIGHT Ramon bursting through the doors -- racing out of here -- EXT. CAMBRIDGE STREET - NIGHT One block down.   Ramon in a furious sprint along the wide street.   Eyeing the traffic.   Buses.   Taxis.   All these different options occurring to him, but in the end he settles on his own two legs to carry him and --  105.",
      "dialogue_count": 0,
      "word_count": 476
    },
    {
      "scene_number": 15,
      "slugline": "EXT. CEDAR STREET - NIGHT Old-world street lamps hiss.   We’re into the quiet residential neighborhood of Beacon Hill now.   Snow flakes drift down.   And Ramon -- lungs burning -- running on adrenaline now -- up this steep narrow lane -- slipping over cobblestones and -- INT. MARLO’S TOWNHOUSE - NIGHT Priya opening the door -- Ramon tearing in here -- gasping -- RAMON My God... There’s Marlo.   She’s lying motionless on her dining room table.   Dead.   An improvised flatline in progress.   No CT scanner.   No crash cart.   Just bare-bones.   IV bag.   Couple electrodes. Ramon pushing away the fear -- struggling to focus -- RAMON (CONT’D) We’re bringing her out. (grabs the defibrillator kit) PRIYA It’s been eight minutes already. Ramon not caring -- the paddles -- KA-THUNK!   He administers a powerful shock.   Marlo slumps back on the table.   Priya with the stethoscope to Marlo’s chest -- shakes her head -- INT. SWIMMING POOL We’re in Marlo’s flatline now.   The swimming pool drained. Cracked.   Covered in mold.   Marlo walking the bottom of the pool.   Comes to a GURNEY.   Shirley Gudgeon lying there in her sopping wet bathing suit. MARLO Shirley?   I made a mistake.   I’m the reason you died. Shirley opens her eyes. INT. MARLO’S TOWNHOUSE - NIGHT KA-THUNK!   Another shock.   The paddles sizzling from the voltage.  106.",
      "characters": [],
      "action_text": "PRIYA Still nothing! Ramon ripping off his jacket.   Rising desperation as he grabs supplies. RAMON Start compressions.   We’ll do a double dose of epi. INT. SWIMMING POOL Shirley Gudgeon sitting up on the gurney.   Weirdly animated. Neither alive nor dead.   This big-boned woman. MARLO Forgive me.   I failed you. On Shirley’s face.   Her closed eyes suddenly JAM OPEN -- Shirley’s hand shoots up -- grips Marlo by the throat -- INT. MARLO’S TOWNHOUSE - DAY Ramon listening with the stethoscope -- bad news -- RAMON It’s not working.   We need oxygen. (then -- furious) Continue compressions! But Priya’s stepped away.   Quiet now. PRIYA There is no oxygen.   We’ve shocked her.   Given her 800 cc’s epinepherine.   Chest compressions. RAMON Then do something else! PRIYA There’s nothing else.   It’s over. RAMON We can’t let her die! PRIYA Sometimes it’s not up to us. Ramon incredulous.   Stalled there.   Cycling in neutral.  107.",
      "dialogue_count": 0,
      "word_count": 367
    },
    {
      "scene_number": 16,
      "slugline": "INT. SWIMMING POOL Shirley rising out of the gurney.   Both hands now locked around Marlo’s neck -- choking Marlo to the floor.   Marlo losing strength -- can’t break Shirley’s iron grip -- Marlo fading there -- fading out -- this brutal ending -- INT. MARLO’S TOWNHOUSE - DAY Silent.   Still.   Marlo dead there.   No more interventions. Priya stumbles away.   Weeping quietly.   Ramon left staring down at Marlo.   Full of fury.   Talking to Marlo. RAMON Marlo.   It wasn’t your fault. Shirley Gudgeon wasn’t your fault. She wasn’t taking Taxol.   Brad Poitras gave her Taxol -- by mistake.   Brad screwed up.   He screwed up and he knew it and he didn’t tell anybody.   None of it’s your fault. INT. SWIMMING POOL Marlo slumped there.   Dead.   Shirley Gudgeon standing over her.   Wicked satisfaction. INT. MARLO’S TOWNHOUSE - NIGHT Ramon smooths her hair.   He’s in despair.   In a way we never thought possible with him. RAMON But that’s not why you have to come back.   I care about you, Marlo. I’ve never met anyone like you. This whole experience has shown me that I want to be with you.   I should’ve realized it sooner.   I should’ve told you.   I should’ve... He can’t believe what he’s about to say.   But he takes her hand.   Full concentration of will. RAMON (CONT’D) Come back.   It’s not your time to die.   Do you hear me, Marlo? (eyes shut, last ditch) I beg you.   I implore you.   Come back.  108.",
      "characters": [],
      "action_text": "The room.   A still life.   Marlo motionless there.   Ramon beside her.   Kneeling there.   Beat to shit.   Nothing left. Then -- Marlo -- her little finger twitches slightly and -- Beep. Priya turning around.   What was...? Beep -- beep -- beep -- it’s the vitals monitor. RAMON (CONT’D) Pulse. Disbelief.   Ramon staggered.   Priya moves in.   Takes over. PRIYA Marlo? Marlo stirs.   Opens her eyes.   Priya here to witness it. DISSOLVE TO: EXT. HARVARD YARD - NIGHT Dusted with fresh snow.   A hush has fallen over the world. EXT. MEMORIAL CHURCH - HARVARD YARD - NIGHT Harvard’s iconic old church fronting the quad.   Marlo, Priya and Ramon walking up to the church.   Its four massive, Federalist columns rising up and -- Jamie sitting up on the church’s steps.   No one else out here.   Priya ascending the steps to him. JAMIE I found the boy.   And her. (cautious faith) Maybe that’s all I had to do. He looks out over the Yard.   This beautiful place.   As it settles on him. JAMIE (CONT’D) I have to take responsibility for my life, don’t I? Priya quiet there.   Glad they’re all together. RAMON AND MARLO  109. Standing apart.   Just the two of them. RAMON You going to be okay? Marlo looking him over.   Thankful for him in a way she can’t understand. And now Priya and Jamie walking down the steps to join them. All quiet for a moment.   Everything they’ve been through. PRIYA Another snowfall. JAMIE It’ll all turn to slush in the morning. PRIYA You may not believe this, but we’ve got rounds in two hours. MARLO Think anywhere’s open for breakfast yet? RAMON Any place but the hospital is fine with me. They’re heading down a path now.   The four of them.   Bent against the cold. DISSOLVE TO: INT. BASEMENT STACKS / HARVARD LIBRARY - DAY Deep underground.   Priya lifts away a stack of old, leather- bound volumes from a shelf to reveal a LAPTOP hidden there. PRIYA I’ve been hiding this. Ramon there.   Puts it together. RAMON Courtney’s laptap.   You had all her flatline data? PRIYA",
      "dialogue_count": 0,
      "word_count": 1599
    }
  ]
}