{
  "slug": "fleabag-201-episode-2-1-2019",
  "title": "fleabag 201 episode 2 1",
  "genre": "comedy",
  "format": "series",
  "scenes_count": 2,
  "characters_count": 0,
  "characters": [],
  "total_words": 5908,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. COOL RESTAURANT BATHROOM - NIGHT 1 1   1  Frank Sinatra’s ‘Strangers in the Night’ plays.  WIDE SHOT of FLEABAG from behind as she stands at a sink. Her  head is bowed down as she is washing her hands. We can’t see  her face.  She looks up into the mirror.  We see that there is blood all over her mouth.  She takes a damp towel and wipes most of the blood off her  mouth and nose.  There is a bang on the door. She ignores it.  MAN (O.S)  Can I do anything?  FLEABAG  No, thank you.  MAN (O.S.)  They’ve gone, so...  She grabs a few tissues and hands them casually to a NEEDY  WAITRESS, who we discover is sitting, slumped on the floor  with blood on her face and a bruised eye.  NEEDY WAITRESS  (grateful, sweet)  Thank you.  Fleabag smiles at her. She checks her hair in the mirror.  Takes a breath.  FLEABAG  (to camera)  This is a love story.  Titles: Fleabag  (Soaring choral music over Titles and perhaps next scene,  rather than the discordance of last series)  INT. RESTAURANT - NIGHT 1 2   2  Earlier that evening.  CLOSE ON FLEABAG. She is sat at a restaurant table holding a  glass of champagne. She looks well.",
      "characters": [],
      "action_text": "We can’t see who else is at the table. We can only see the  restaurant glittering and bustling behind her.  FLEABAG  (to camera)  You know when you’ve done...  everything.  (beat)  When you’ve been all -  FLASHBACK   EXT. PARK - DAY A 3   3  FLEABAG is doing squats in a park with a DRILL SERGEANT kind  of guy. He is shouting at her.  DRILL SERGEANT  SQUAT. SQUAT.  INT. RESTAURANT - NIGHT 1 4   4  Back at the table with FLEABAG.  FLEABAG  (to camera)  And -  FLASHBACK   INT. CAFE - DAY D 5   5  Shot of a piece of rye bread / pumpernickel with sliced  avocado and feta cheese and chopped baby tomato on it.  FLEABAG chops it in half and looks at the camera very  seriously.  INT. RESTAURANT - NIGHT 1 6   6  Back at the table with FLEABAG.  FLEABAG  You’ve even -  EXT. ARSEHOLE GUY’S FLAT - NIGHT 1 7   7  Close on ARSEHOLE GUY looking seductively at FLEABAG.  ARSEHOLE GUY  Wanna have sex?  Beat. Fleabag is conflicted.  2. FLEABAG  No.  She turns and runs away down the street.  ARSEHOLE GUY  (calling after her,  desperate)  Can I at   least   go down on you!?  FLEABAG  NO!  INT. RESTAURANT - NIGHT 1 8   8  Back at the table with FLEABAG.  FLEABAG  You’ve done   everything.   And you  feel   great.  INT. PUB - EVENING 9   9  Fleabag laughing with a bunch of ‘friends’ we’ve never seen  before and will never see again.  INT. RESTAURANT - NIGHT 1 10   10  Back at the table with FLEABAG.  FLEABAG  You’re not even thinking about -  FLASHBACK   EXT. PARK - DAY G 11   11  BOO putting a tiny hat on Hilary’s head and looking up at us,  very pleased with it. Fleabag’s dialogue cuts it off again.  INT. RESTAURANT - NIGHT 1 12   12  Back at the table with FLEABAG.  FLEABAG  You don’t even   think   about -  3. FLASHBACK FROM SERIES 1   EXT. CLAIRE’S HOUSE - NIGHT 13   13  MARTIN kissing FLEABAG on Claire’s birthday from the last  series.  INT. RESTAURANT - NIGHT 1 14   14  FLEABAG passes bread across to her left -  FLEABAG  (to camera)  And even though your sister still  hates you.  We",
      "dialogue_count": 0,
      "word_count": 3404
    },
    {
      "scene_number": 2,
      "slugline": "INT. RESTAURANT. DIFFERENT AREA - NIGHT 1 27   27  FLEABAG approaches MARTIN, as he necks a whiskey and hands  the empty glass to the NEEDY WAITRESS.  MARTIN  Thank you. You’re an   exceptional  waitress.  Fleabag passes. He’s aware she has caught him.  FLEABAG  Apple juice?  MARTIN  Yeah.  She passes him. He stops her.  MARTIN (CONT’D)  I - I just wanted to say.  (beat)  I’m so intrigued to see how you’re  going to make this whole evening  about you.  He smiles. They move off at the same time. He touches her  shoulder.  MARTIN (CONT’D)  No, no. We probably shouldn’t  arrive at the table together.  He walks ahead of her. Fleabag looks at us with cold fury.  INT. RESTAURANT -   NIGHT 1 28   28  Back at the table with CLAIRE, PRIEST, DAD and GOD MOTHER.  God Mother is mid-flow with the Priest, as MARTIN and FLEABAG  come in. Claire notices them arrive together.  GOD MOTHER  (to Priest)  A lot of people would say praying  is just talking to yourself in the  dark.  PRIEST  (he laughs)  Prayer is just more about  connecting with yourself at the end  of the day. It takes a bit of  effort but it’s a positive way to -  26.",
      "characters": [],
      "action_text": "CLAIRE  Yes, I completely agree. Positive  energy takes work. In the last six  months I have excelled. I just take  all the negative feelings and just  bottle them and bury them. And they  never come out.  PRIEST  That’s not really / how I would -  CLAIRE  I’ve basically never been better!  She looks at Fleabag.  GOD MOTHER  Us neither.  MARTIN  I feel fantastic.  PRIEST  You’re a very positive family, I  have to say.  DAD  Absolutely.  CLAIRE  I think it’s   all   about positivity.  It takes real commitment to be this  happy. It’s not just drinking and  eating well either. Putting pine  nuts in your salad doesn’t make you  a grown up.  FLEABAG  (to camera)  Fucking does.  CLAIRE  It’s about - it’s about - well in  Finland they have a saying that I  can’t quite remember now, but it’s  about being open to the people who  want to love you.  MARTIN  And she is wide open these days.  PRIEST  What do you do?  27. CLAIRE  I work in finance.  DAD  What?  FLEABAG  (to camera)  What?  CLAIRE  Across two firms. One in Finland  and one here.  FLEABAG  (to camera)  No, no, she’s a lawyer.  GOD MOTHER  I thought you were a lawyer?  CLAIRE  No.  MARTIN  What?  CLAIRE  I work WITH lawyers. I am not a  lawyer.  DAD  Darling you’re a   solicitor .  CLAIRE  I went to   business   school.  (suddenly to Fleabag)  You’re being SO quiet. Why aren’t  you   saying   anything?!  Pause. They look at each other.  FLEABAG  (gently)  What do you want me to say?  CLAIRE  Anything - what’s that in your  hand?  DAD  Um... She doesn’t have to -  28. FLEABAG  Birthday present from Dad.  GOD MOTHER  It’s a nice thing, Claire.  MARTIN  Chunk of change?  DAD  No. It’s-  CLAIRE  What is it?  FLEABAG  I don’t know.  She starts opening it.  DAD  Um... No you don’t need to-  PRIEST  Love presents. Never get presents.  She pulls out the piece of paper and reads it.  DAD  It’s just because you - you’re -  um.  FLEABAG  It’s a voucher for a counselling  session.  Beat.  FLEABAG (CONT’D)  Thanks, Dad.  Everyon",
      "dialogue_count": 0,
      "word_count": 2504
    }
  ]
}