{
  "slug": "focus-2015",
  "title": "focus",
  "genre": "romance",
  "format": "film",
  "scenes_count": 11,
  "characters_count": 1,
  "characters": [
    "OWENS"
  ],
  "total_words": 22572,
  "total_dialogue": 1,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. HOTEL ELEVATOR - NIGHT Nicky waits for the elevator.   He notices a MOTHER and her SON approaching from down the hall. He watches them. DING! The doors open. Nicky enters the elevator, presses the lobby button.   The mother rushes for the elevator. MOTHER Coming... Nicky pays no mind and doesn’t register the woman’s astonished face as the doors SHUT on her just inches away. MOTHER (O.C.) (CONT’D) Really?! No reaction. INT. HOTEL LOBBY - NIGHT Nicky approaches a comely CONCIERGE. He turns on the charm. NICKY Hi, how are you tonight? CONCIERGE I’m fine, thanks- how can I help you? NICKY Weren’t you working this morning? You must be exhausted. I hope they’re paying you enough. CONCIERGE Well, no, but thank you for noticing. NICKY I know Elegio is reservation only, but do they still accept walk-ins at the bar? CONCIERGE Yes, but at eight it may not be worth your time... NICKY That’s why I wanted to talk to you. (smile) 8. (MORE)",
      "characters": [],
      "action_text": "Could you call them and tell them Chef Julien Bardolejo of Las Losos in Barcelona was hoping they’d save a spot for him at the bar? CONCIERGE (smiles knowingly) I suppose I could give it shot. NICKY You have a wonderful night. He finishes with a wide smile that satisfies her. It quickly fades as he heads for the door- passing a group of TOURISTS posing for a photo. One of them EXTENDS A CAMERA to him. TOURIST Would you mind...? He keeps walking, pretending not to hear. INT. ELEGIO RISTORANTE - BAR - NIGHT A high end hotel restaurant with a crowded bar- Nicky seated prominently at the head of it, enjoying a glass of wine as a WAITER places a PLATE of finely prepared food before him. NICKY Gracias, señor. He cuts into his food, takes a bite. ON THE KITCHEN DOOR: A CHEF and SOUS CHEF sneak looks at him, awaiting a reaction to their food.   Nicky reaches for the SALT.   The chef is crushed. CHEF Dammit... The sous chef tries to console him as he skulks off. BACK ON NICKY: Looking around the bar, taking in the faces of the strangers.   Eventually, at the far end of the bar-- A beautiful young woman (JESS BARRETT) shoos off the advances of a DRUNKEN STRANGER. We can’t hear, but reading her lips-- JESS I’m waiting for someone. He’ll be here any minute... 9. NICKY (CONT'D) Nicky watches the drunk lean in close to her. She looks around trying to ignore the clingy suitor, making brief eye contact with Nicky.   She SMIRKS at him as she gently PUSHES the drunk away with a laugh. Nicky smiles and returns to his food. He salts it again. CHEF (O.S.) (distant, from kitchen) FUCK! This amuses Nicky, until- JESS (O.S.) Are you a serial killer? CUT WIDE to reveal JESS is standing next to him. NICKY No. Not anymore, at least. She smiles. JESS Can you be my boyfriend for a minute? NICKY Sure. Waiting for someone? JESS Not really. No. NICKY Join me for dinner? JESS Love to. He turns to the bartender to order when she suddenly grabs his plate and starts eating. NICKY I was going to-- (the",
      "dialogue_count": 0,
      "word_count": 3518
    },
    {
      "scene_number": 2,
      "slugline": "EXT. LUXURY HOTEL - NIGHT MONTAGE CONTINUES as Jess and Nicky emerge from a cab. NICKY There’s a flight landing every two minutes at Miami International. Average of 200 passengers per flight.   Whoevers not here for the game is here for the party- every one of them looking to drink big, bet big, cheat on their spouse-- and it all costs money... And as they enter the-- INT. HOTEL LOBBY - NIGHT A busy lobby. PEOPLE mill about, OTHERS are lined up at the registration desk with their luggage. NICKY (checking his watch) There’s boost teams at all the major hotels. They hit quick and get out before anyone knows what happened... Nicky suddenly stops short and YELLS at Jess. NICKY (CONT’D) IF YOU THINK I’M GONNA LET YOUR MOTHER TALK TO ME THAT WAY YOU’RE FUCKING CRAZY! THE ENTIRE LOBBY TURNS. Jess stands there perplexed and ready to hit him.   But as Nicky keeps YELLING-- QUICK CUTS all around the LOBBY as THIEVES DISGUISED AS TOURISTS take advantage of the situation with amazing speed: BY A GIFT SHOP: A passing thief SWAPS OUT a GUCCI SHOPPING BAG at the feet of a rich woman, stealing hers. ON THE REGISTRATION LINE: A “GUEST” places a FALSE BOTTOM SUITCASE over someone else’s SMALLER SUITCASE and calmly walks away with it inside. All around, SWAPS AND LIFTS play out within seconds to other unsuspecting people. BACK TO NICKY and JESS.   Nicky is suddenly contrite: 28.",
      "characters": [],
      "action_text": "NICKY (CONT’D) Sorry sweetie, me and my temper... He hugs her.   She’s mystified. JESS What the hell was that? NICKY Don’t worry about it. They resume their walk across the lobby. JESS Did I miss something...? INT. HOTEL SUITE - EARLIER THAT DAY CONTINUE MONTAGE as a group of HUSTLERS and CARD SHARPS hang out in a room.   It’s a cheater’s gymnasium-- some practice double deals, others shuffle cards with staggering dexterity. NICKY (V.O.) There’s card games everywhere and they let anyone with enough cash in. Chances are at least one of those guys you don’t know is a mechanic who can work a deck like Jascha Heifetz doing Tedesco... A CARD MECHANIC shaves down the side of a card deck with sandpaper. A HUSTLER passes out STACKS OF CASH to the others. NICKY (V.O.) Guys will shave down the entire deck except for the aces so they can feel them when they shuffle and pull them out when they need them. ANOTHER CARD SHARP puts in a CONTACT LENS. NICKY (V.O.) Some guys use marked cards you can only see with polarized contacts and glasses... CUT TO: CARD SHARP POV: A PLAYER across from him holds a FIVE CARD HAND. The value of his cards are CLEARLY MARKED IN RED on the backs. 29. PLAYER Trips... CUT TO REVEAL WE’RE AT-- INT. PENTHOUSE SUITE - NIGHT A HIGH STAKES GAME at a raucous high end party in a penthouse. A huge pile of chips and cash is in play. The Card Sharp is opposite the PLAYER, shaking his head in disbelief as he lays down FOUR OF A KIND. POKER PLAYERS Whoa! Shit! Etc... CARD SHARP I swear, I’ve never had a four of a kind before! The Player as well as TOBEY MAGUIRE and LEBRON JAMES suffer a huge loss as the “surprised” Card Sharp rakes in the chips. MONTAGE CONTINUES as CAMERA DRIFTS from the table to REVEAL that Nicky and Jess are watching nearby. NICKY Come with me... CAMERA CONTINUES past them, THROUGH THE WALL to reveal-- INT. HOTEL SUITE / HALLWAY - CONTINUOUS A MARK and BUXOM WOMAN are about to fornicate when-   SLAM! The door to the room is kicked open by a BIG",
      "dialogue_count": 0,
      "word_count": 1326
    },
    {
      "scene_number": 3,
      "slugline": "INT. BUNGALOW - LATER THAT NIGHT A few of THE CREW stack MERCHANDISE AND MILL ABOUT. Jess and Farhad sit at his computer, looking at something. JESS Awww- who’s that? FAT ASS FARHAD That’s my little girl Mina. JESS Cute. FAT ASS FARHAD (click) My son, Dani. JESS Sweet. FAT ASS FARHAD (click) That’s my wife Lida. JESS Pretty. FAT ASS FARHAD (click) That’s my dick. JESS (ignoring) Uh huh... FAT ASS FARHAD Sorry about that. (click) That’s my dog... JESS Awwww. They click through a few more.   Then- JESS (CONT’D) So you’ve known Nicky a long time? FAT ASS FARHAD Yeah. Ten years or so... JESS Are you friends? 35.",
      "characters": [],
      "action_text": "FAT ASS FARHAD Yeah I guess I’m about the closest thing he got to a friend. JESS How long have you known him? FAT ASS FARHAD Uh- ten years? Why? JESS Just wondering. FAT ASS FARHAD Okay you got me-- we’re sleeping together okay? Like the Ancient Greeks. It’s so beautiful. Jess laughs. FAT ASS FARHAD (CONT’D) Actually, I don’t know. I like the guy. I do. Trust him.   But people just aren’t his bag. JESS I guess you can’t blame him. I mean he told me about that thing with his dad and his grandfather. Crazy. Farhad is surprised to hear this.   A moment, then- FAT ASS FARHAD He told you that? (then) I mean- I’ve heard that story, but- never from him. HORST (O.S.) Jess? Horst is at the threshold. HORST (CONT’D) Are you Jess? JESS Yes. Hi. HORST Horst. Nice to meet you. Nicky says you’re quite a gifted wire. 36. JESS Never said that to me, but I’ll take the compliment. HORST He’d like to see you. EXT. BUNGALOW - BACK PORCH - NIGHT Jess comes out to the dim porch to find Nicky sitting on some old patio furniture watching a HORSE RACE on a small TV. JESS Who you rooting for? NICKY The wrong horse. He gets up. NICKY (CONT’D) Horst runs the whiz.   He’s the cannon and the steer.   He’s also your boss if you still want in. JESS Really!? Yes! Yes! Thank you! She bounces and gives him an impulsive hug. NICKY Don’t thank me. You’ve got a busy week coming. He reaches into an envelope, hands her a CREDIT CARD. NICKY (CONT’D) Here’s a clean card. Jenny will make you a Florida ID. JESS (regards card) Ooh, Platinum. You know a good hotel? I don’t know Miami really. NICKY I already got you a place. She’s pleasantly surprised. JESS Really? Is it nice? 37. NICKY Not bad. I think you’ll like it. JESS Thanks. How do I get there? NICKY Need a car? JESS I don’t really drive. New Yorker... NICKY Oh... Need a ride? JESS Really? Sure... A moment as both of them think about this. A long beat. JESS (CONT’D) (a little nervous) I mean... If that’s okay with you... He looks at her, thinks. INT. SETA",
      "dialogue_count": 0,
      "word_count": 2063
    },
    {
      "scene_number": 4,
      "slugline": "INT. SKYBOX 18 - LATER The game is in full swing as Nicky and Jess enjoy themselves and watch from their prime seats on the balcony. JESS How’d you get these tickets? He points out seven foot six YAO MING inside the suite. They share a wave. NICKY Yao Ming’s a friend. Jess and Nicky turn their attention back to the field. JESS Is this a bad time to mention I don’t really like football? I mean it just seems like a lot of standing around all the time... NICKY Lots of standing, with brief moments of head trauma. An awkward beat, he looks to the crowd. NICKY (CONT’D) Well, if you don’t like football we can still make it fun... (sees something) Okay, look- He points to the STANDS BELOW where a VENDOR is preparing to toss a HOT DOG to a FAN eight seats down the row. NICKY (CONT’D) Dollar says that guy misses the catch. JESS (smiling, game) Let’s make it a sawbuck. NICKY Done. THEIR POV:   The Vendor THROWS. The fan MISSES the hot dog. JESS AH!! How’d you know? 46.",
      "characters": [],
      "action_text": "NICKY That guy can’t throw. A ROAR as the crowd starts to DO THE WAVE on the other side of the stadium. JESS (searching the crowd) Okay- there-   shirtless guy with the body paint.   Sawbuck says he’s too drunk to get up for the wave. NICKY You sure? His team is on a drive. JESS You in or out? NICKY In. The WAVE COMES AROUND-   the man does not get up. JESS Yessss!!   I know my drunks. NICKY Nice. They’re having fun.   Nicky spots another opportunity. NICKY (CONT’D) Okay-   there- the mamacita in the short shorts... In the stands below, a shapely CUBANA is making her way from her seat down the row TOWARD THE AISLE. NICKY (CONT’D) How many guys will check her out on the way up the aisle? Closest without going over wins. JESS End seats only?   At least ten. NICKY There’s a play on.   I say three. VOICE (O.S.) Six. They turn to see a CHINESE INDUSTRIALIST sitting nearby. 47. INDUSTRIALIST Can I get in on this? JESS Sure.   Ten bucks- Mister...? INDUSTRIALIST Liyuan. I say six guys look. Sure thing. They nod in agreement and turn their attention to the Mamacita as she steps onto the aisle.   The FIRST GUY she passes checks out her shorts. JESS (O.S.) That’s one. THEIR POV: A SECOND GUY looks. Then a THIRD. Then a FOURTH. NICKY Damn... A FIFTH, A SIXTH. She climbs to the last step, exiting- LIYUAN It’s six! But at the last second a SEVENTH MAN turns and rubbernecks. JESS SEVEN! Yes! (to Liyuan) You’re over! Whooo! I know my letches too!! Money money money! She holds out her hand and Mr. Liyuan pays with a smile. LIYUAN (playful) I want justice! I want my money back! Make another bet. NICKY / JESS Sure... okay... LIYUAN Which team draws the next foul? NICKY Offense. JESS Uh- I don’t know football... you boys play. 48. LIYUAN (to Nicky) Okay, defense. A thousand dollars? A moment. Unexpected, but Nicky is game. NICKY Good. CUT TO: ON THE FIELD: The play begins. In moments WHISTLES are blown, a YELLOW FLAG FLIES. The LEAD OFFICIAL announces the penalty. LEAD OFFICIAL Holdin",
      "dialogue_count": 0,
      "word_count": 2136
    },
    {
      "scene_number": 5,
      "slugline": "EXT. STADIUM PARKING LOT - DAY Nicky and Jess walk with hastened pace to a waiting LIMO. INT. LIMO - CONTINUOUS Nicky can finally relax as they drive off and Jess can no longer contain herself. JESS I’m going to kill you!!! NICKY You did great. She SWATS him repeatedly and excitedly. JESS How did you do that?!! NICKY Liyuan is a legendary gambler. Bets on everything. Anything. Huge cash bets all the time. Once- the Bellagio kicked Bill Gates out of the High Roller Suite because they heard Liyuan was flying in. He’s the perfect vic. JESS But how did you know who he was gonna pick!? NICKY Because we told him to.   We’ve been telling him all day long... CUT TO: INT. FIVE STAR HOTEL CORRIDOR - EARLIER THAT DAY BEGIN FLASHBACK SEQUENCE of earlier that day-- Liyuan exits his suite with bodyguards, enters the ELEVATOR. NICKY (V.O.) From the moment he left his room this morning we’ve been priming him- programming his subconscious. He’s been seeing the number fifty five all day long... 59.",
      "characters": [],
      "action_text": "IN THE ELEVATOR, an large ADVERTISEMENT for a WINE BAR in the hotel named “55 Degrees”. Liyuan pays it little mind. NICKY (V.O.) On the elevator, in the lobby... IN THE LOBBY, Liyuan is briefly CUT OFF by a group of FANS (actually GARETH and some others we recognize from the con- team). They are all WEARING #55 JERSEYS. NICKY (V.O.) ...even the stickpin on the Doorman. AS HE EXITS, Liyuan is greeted by HORST, dressed as a DOORMAN. PUSH IN ON HIS LAPEL to see a #55 STICK PIN. I/E. LIMO AND MIAMI STREETS - DAY Liyuan rides in a limo, occasionally glancing out the window. NICKY (V.O.) ...Not only that, we loaded his route from the hotel to the stadium. He looks out the window, primers are everywhere. VARIOUS CUTS- seemingly EVERYDAY EVENTS outside the limo are given a CLOSER LOOK. Undercover ACCOMPLICES are everywhere: As PEDESTRIANS in JERSEYS, as PROTESTERS wearing matching color TEES with 55 on their SIGNS, BILLBOARDS featuring FARHAD, etc... NICKY (V.O.) ...He doesn’t see it, but he does. Team colors, fifty fives, even Farhad... AT A TRAFFIC LIGHT: HONKING gets Liyuan’s attention.   He turns to see FARHAD DRIVING A TAXI- honking and yelling. NICKY (V.O.) Suggestions are everywhere- the number of flowers in a vase, the tramp stamp on the hooker we sent to his room last night. FLASH CUT TO A NAKED WOMAN’S LOWER BACK as Liyuan fucks her from behind. The number 55 is disguised as a TRIBAL TATTOO. 60. INT. SKYBOX 18 - EARLIER THAT DAY An ACCOMPLICE replaces the iPod in the suite’s iPod DOCK and PRESSES PLAY. NICKY (V.O.) It’s also what he hears- from the words I choose, to the music in his suite. FLASHBACK of Nicky challenging Liyuan to the big bet as SYMPATHY FOR THE DEVIL plays on the iPod DOCK. NICKY (V.O.) The Mandarin word for five is ‘woo’.   There are 124 woo-woos in ‘Sympathy For the Devil’... FLASHBACK ON LIYUAN looking through the binoculars, scanning the field and eventually spotting Farhad. NICKY (V.O.) He doesn’t register it, but its all there. And when he ",
      "dialogue_count": 0,
      "word_count": 640
    },
    {
      "scene_number": 6,
      "slugline": "INT. LIMO - DAY BACK IN THE PRESENT, Jess’ excitement is unabated. JESS (delighted) You are such an asshole!! He laughs as she continues to swat at him. JESS (CONT’D) There’s no way that can really work! NICKY Quick- what continent is Kenya on? JESS Africa. NICKY What are the colors of a chess board? JESS Black and white? NICKY Name an animal. JESS Zebra.   NICKY Zebra. Jess is amazed. NICKY (CONT’D) 85 percent of the time people say zebra. The human brain. Hackable. JESS So you had an 85 percent chance? NICKY Farhad had it at about 59%. Better odds than Vegas. JESS What if he picked wrong? NICKY Just double down again until it happens. It’s probabilistic. 62.",
      "characters": [],
      "action_text": "JESS Well you’re still an asshole. NICKY You wanted to learn- welcome to the grift. She swats him again. He fights back a little as things become more playful. He gets a hold of her arms, neutralizing her attack until-- She darts forward, KISSING HIM HARD. He quickly reciprocates. It’s a long kiss, but they break for air eventually-   staring at one another for an extended beat-- heaving breaths, eyes speaking unheard doubts and desires. Then-- They resume- passionately and intensely. The chemistry is undeniable, it’s real. It’s intimate. It’s building. They manage the occasional comment between kisses. NICKY (CONT’D) I’ve wanted this a long time. JESS What the hell were you waiting for? They’re consumed by one another instantly. Hands greedily fumbling with clothing. He reaches sensually into her hair and pulls her away from him for a brief moment- admiring her. NICKY Didn’t know if I could trust you... He leans in, she holds him back for a beat. JESS And now...? It burns in his eyes. He pulls her into a passionate kiss. INT. SETAI HOTEL - JESS’ SUITE - NIGHT Their two bodies lie still, facing one another, intertwined in the sheets of Jess’ suite. We move in slowly, closing in on Jess’ sleeping face. CAMERA ARCS AROUND to reveal Nicky, awake and gazing at her. 63. Jess stirs.   Her sleepy eyes opening for a moment to find him there.   A small smile, then- JESS Go to sleep... She reaches to pull him closer-- NICKY You go to sleep... She gives him a little kiss. She sleepily prods him-- JESS Such a jerk... made me look like an idiot... NICKY Next time you’ll be in on it. JESS Promise? NICKY Promise. JESS Next time, you’re the idiot... She smiles. He gives her a kiss and she drifts back to sleep. Nicky reflects pleasantly.   But soon his expression changes. There’s concern. Conflict. FADE OUT. INT. SETAI HOTEL - JESS’ SUITE - MORNING OPEN WIDE as sunlight floods the room, eventually REVEALING Jess in the bed, alone. She wakes, notices immediately he’s gone. Rising sli",
      "dialogue_count": 0,
      "word_count": 5547
    },
    {
      "scene_number": 7,
      "slugline": "EXT. BUENOS AIRES AIRPORT - DAY Nicky pulls up outside the baggage claim area in his SUV, glancing inside. I/E. BUENOS AIRES AIRPORT - CONTINUOUS CLOSE ON rolling LUGGAGE and FEET, purposefully walking to the exit, PASSING THROUGH THE SLIDING DOORS and approaching Nicky’s car. INT. CAR - MOMENTS LATER Fat Farhad sits in the back of the car as Nicky drives. FAT ASS FARHAD Is the chimichurri good? Love that shit. NICKY I’ll take you for asado. I owe you one. FAT ASS FARHAD What’s with the coach seat? NICKY Sorry, last minute. FAT ASS FARHAD Godamnned connection in Sao Paolo? Airport’s like JFK if it was in Mogadishu.   Orange fucking tile gives me a headache. NICKY I’ll make it up to you. FAT ASS FARHAD Damn right. They had me squeezed between two fat guys.   I swear we flew at a 45 degree angle the whole way down. NICKY Are you done complaining? There’s a time issue. FAT ASS FARHAD Don’t question my professionalism. If I have a pulmonary embolism, let it hang on your head. 92.",
      "characters": [],
      "action_text": "NICKY I told you to get up and walk every hour.   Did you get up and walk every hour? FAT ASS FARHAD Why? So I can stand in front of a bathroom door I can’t fit through? Me and the fat guys were pissing in Aquafina bottles like long haul truckers. NICKY Sorry. Are you done? FAT ASS FARHAD You better have booked me a nice hotel too. NICKY Motel. FAT ASS FARHAD Motel?! NICKY It’s actually nice. I checked it out.   Now are you done? FAT ASS FARHAD Yeah, just had to vent. (then) Where’s this going down? Nicky points to a GPS like device, tracking something. NICKY Not sure yet. Mark is on the move. Public though. FAT ASS FARHAD You sure about this? This isn’t my speciality- NICKY Why are you still complaining? I’m giving you a cut- FAT ASS FARHAD I haven’t heard from you in a year. And you haven’t gigged in three from what I hear, so forgive me my impertinence. 93. Nicky isn’t going to argue anymore. EXT. PUBLIC SQUARE - DAY A busy public square lined with shops, cafes, merchants, etc. Nicky pulls in and parks. INT. NICKY’S CAR - DAY Nicky and Farhad scan the sea of crowded tables outside. NICKY Back there- next to the guy in the yellow. (then) You got the piece? FAT ASS FARHAD In my bag. EXT. SQUARE - DAY Farhad carries a small bag as he works his way through the crowded area.   He negotiates his way past tables, eyeing passersby wearily. He turns his gaze ahead, locking in then palms the side pocket of his bag, checking for the mysterious contents. FARHAD POV: The crowd parts, revealing his mark at a table-- FAT ASS FARHAD Hey there. It’s JESS. She looks up to see him, pleasantly surprised. JESS Farhad! FAT ASS FARHAD Jess. She leaps to her feet and they hug. JESS Oh my god! You’ve lost so much weight! He looks exactly the same. 94. FAT ASS FARHAD I did a cleanse. JESS You here with Nicky? FAT ASS FARHAD Sort of.   Can I bend your ear? JESS Sure, sit down... They do. FAT ASS FARHAD You’ve got Nicky all nuts. JESS I do? Good. FAT ASS FARHAD I’ve never seen him like this",
      "dialogue_count": 0,
      "word_count": 849
    },
    {
      "scene_number": 8,
      "slugline": "EXT. CAMINITO LA BOCA DISTRICT - DAY Jess and Nicky walk along the blocks of brightly painted homes in the historical neighborhood. The mood is a bit awkward, but it’s a start. JESS So I’m here. What’d you want to say to me? NICKY This feels like a job interview. JESS I don’t have all day. NICKY So cold. You’ve changed. JESS No. This isn’t how I treat people, it’s how I treat you. NICKY So you’re saying I have a special place in your heart? JESS I don’t know about my heart. Something south of that. It might be pollups. NICKY You’re making this so easy. JESS No problem. I can’t wait for the sucking sound of your empty platitudes. NICKY You are so mean. I hope you’re not a pet owner because you are definitely a kick the dog type. JESS I have a lizard. You’d get along. NICKY Again with the mean. Have pity. She stops him and makes eye contact. 97.",
      "characters": [],
      "action_text": "JESS You. Are. A dick. She turns and walks away. NICKY I totally lost it, okay? She stops. Turns around. NICKY (CONT’D) Never happened to me before. Never. (stream of conscious) I was laying there that night and I couldn’t sleep and I was just looking at you and I was totally prepared to tell you anything. Whatever you wanted to hear. Everything. All my secrets... JESS Oh Jesus... NICKY That’s never happened to me.   I- I - I had images of us, like... like... JESS What? NICKY Like... together. JESS Like sexy stuff? NICKY No! Like normal stuff! Like camping at Yosemite. Driving to Big Sur. Eating crab at Fisherman’s Wharf. It was all in California for some reason-- which is weird because I’ve only been there once when I was eight and I’m allergic to shellfish. JESS I’m allergic to shellfish. NICKY Really? See how well we’re hitting it off? 98. JESS Okay- we need to find someplace to sit ‘cause I think you’re having a meltdown. EXT. PLAZOLETA DE LOS SUSPIROS - A SHORT TIME LATER Jess and Nicky sit at the edge of a QUAINT WHARF overlooking a harbor at the edge of the neighborhood. Colorful tugs and fishing boats are moored nearby as Jess PUTS THE NECKLACE ON. NICKY Looks nice. Jess accepts the compliment but changes the subject. JESS Farhad said you didn’t work for a long time... NICKY Couple years, yeah.   Didn’t feel right. Actually started feeling bad about doing it... which is not something you want in a professional con artist. Empathy, a heart... what a disaster. JESS Yeah. God forbid. NICKY Seriously. Not so much about the rich guys.   But I think about some of the ones when I was little.   My dad and I would run this scheme at these churches. I’d speak in tongues and he’d translate for a donation. What happened to those people? Or when I was 15, I ran a credit card scam on this video store in Pennsylvania- back when they had the carbon paper slips? I drove back there last year and it’s not there. Video store was gone. JESS Don’t you think that was online stream",
      "dialogue_count": 0,
      "word_count": 2323
    },
    {
      "scene_number": 9,
      "slugline": "EXT. BUENOS AIRES OUTSKIRTS - DAY MUSIC as Nicky drives his rental car with 3 million dollars in a bag at his side.   He dials his cell, awaits an answer. NICKY (into phone) Mr. Garriga?   It’s done. I wish you the best of luck. GARRIGA (O.S.) With friends like you? Who needs luck? Nicky smiles as Garriga LAUGHS. He hangs up and speeds down the road. EXT. BUENOS AIRES INDUSTRIAL PARK - DAY MUSIC CONTINUES as Nicky pulls into a high end industrial park arriving at the open garages of the LOTUS RACING TEAM. He’s greeted by the LOTUS HEAD ENGINEER. INT. LOTUS WORKSHOP - DAY Nicky, the Head Lotus Engineer and a Lotus Tech sit before monitors that display the Garriga information. The Engineer smiles broadly and slaps him on the back. LOTUS ENGINEER Worth every penny. A bag of cash is placed in front of Nicky.   He shakes hands with the Engineer. NICKY It’s been a pleasure, Mr. Gallagher. I wish you the best of luck. LOTUS ENGINEER With friends like you, who needs luck? The Lotus guys laugh at his joke. Nicky joins in. 109.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 189
    },
    {
      "scene_number": 10,
      "slugline": "EXT. BUENOS AIRES HIGHWAY - DAY MUSIC CONTINUES as Nicky drives his rental car with 6 million dollars in the TWO BAGS at his side.   He speeds down the road with a satisfied grin. EXT. TEAM RED BULL-RENAULT PIT - DAY Nicky, the Head RENAULT ENGINEER and a RENAULT TECH sit before monitors that display the Garriga information. RENAULT ENGINEER C’est magnifique! A bag of cash is placed in front of Nicky.   He shakes hands with the Engineer. NICKY It’s been a pleasure, Monsieur. I wish you the best of luck. RENAULT ENGINEER With friends like you, who needs luck? The Renault guys laugh at his joke. Nicky joins in. INT. DIVE BAR - DAY A man in a FERRARI JACKET slides a bag of money to Nicky. FERRARI ENGINEER With friends like you, who needs luck? They both LAUGH at his joke. SMASH CUT TO: INT. HRT RACING TEAM WORKSHOP - DAY Nicky LAUGHS with the HRT TEAM OWNER. SMASH CUT TO: EXT. TEAM INDIA PIT - DAY Nicky LAUGHS with the HEAD OF TEAM INDIA. SMASH CUT TO: 110.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 182
    },
    {
      "scene_number": 11,
      "slugline": "INT. MARUSSIA TEAM OFFICES - DAY Nicky LAUGHS with the HEAD OF TEAM MARUSSIA. SMASH CUT TO: EXT. PARKING GARAGE - DAY Nicky stuffs money into a duffel bag in his trunk, zips it closed and SLAMS THE TRUNK SHUT. SMASH CUT TO: INT. THIRD FLOOR CORRIDOR - NIGHT DING.   The elevator doors open and Nicky emerges with TWO FULL DUFFEL BAGS, headed for his suite. INT. BUENOS AIRES HOTEL - NICKY’S ROOM - NIGHT Nicky enters his suite and as the door shuts behind him-- NICKY Hello? No response. He walks into the living area. NICKY (CONT’D) Jess? He looks at his WATCH: 7:05.   He continues on to the bedroom.   No sign of her.   He’s concerned. Anxious. INT.   NICKY’S SUITE - LATER THAT NIGHT Nicky is seated on the bed, waiting.   Still anxious. He glances at his watch: 7:30.   This time it’s him who’s been left alone. Nicky chokes back his emotions and refocuses.   He marches to the front foyer, grabs the bags and opens the door to reveal: JESS, luggage in hand, ready to go. JESS Sorry I’m late. He’s relieved, but doesn't speak. 111.",
      "characters": [
        "OWENS"
      ],
      "action_text": "JESS (CONT’D) What...? A smile. INT. FARMACIA - NIGHT CLOSE ON hulking GORDON, McEwen’s bodyguard, squinting, looking for something, getting frustrated. REVEAL he’s staring at a shelf of medical supplies.   Finally he finds what he’s looking for. A NIGHT GUARD mouthpiece. CUT TO: AT THE REGISTER, the CHECKOUT GIRL tallies up his items: NIGHT GUARD, NECK BRACE, DUCT TAPE, A MARS BAR, RUBBING ALCOHOL, GAUZE... INT. BAR - NIGHT Gordon enjoys a small meal at the bar, watching futbol on the TV and drinking a cerveza. ANNOUNCER (ON TV) Goooooooooooooooooallllllll! The bar patrons explode with joy, but not Gordon. GORDON Fucking twats... BEEP.   His cellphone gets a text.   He reads it, then matter of factly motions for his check. GORDON (CONT’D) Cuenta... And as he shovels down a few more bites-- EXT. BAR - NIGHT Gordon exits the bar and heads for his SUV. He notices a dent in his bumper. GORDON Ah bloody hell... He’s pissed, looking for a culprit. Then, a beat later, he LAUGHS to himself-   as if hearing a joke in his head. 112. He disregards the dent, gets in the vehicle and drives away. INT. GORDON’S CAR - NIGHT Gordon drives on a HIGHWAY, tuning in the game on the radio. BEEP. Another TEXT. He reads it out of the corner of his eye. He continues to drive a bit, then puts on his blinker and EXITS AN OFF RAMP. INT. GORDON’S CAR - LATER THAT NIGHT Gordon drives down a city street, looking for street signs. Eventually he makes a turn and digs through the shopping bag next to him until he pulls out the NIGHT GUARD he purchased. He tries to open the packaging with great difficulty, finally tearing it apart with his teeth. He PUTS THE MOUTHPIECE IN. Still driving, LOUDLY BREATHING through the hole in the mouthpiece. He reaches back into the bag for the NECK BRACE. HE PUTS IT ON, turns up the game on the radio and SLAMS HIS FOOT ON THE PEDAL. VROOM! Within moments he’s moving at INCREDIBLE SPEED down the city street. CAMERA HOLDS ON GORDON as the car gets faster and faster, th",
      "dialogue_count": 1,
      "word_count": 3799
    }
  ]
}