{
  "slug": "foxcatcher-2014",
  "title": "foxcatcher",
  "genre": "action",
  "format": "film",
  "scenes_count": 16,
  "characters_count": 0,
  "characters": [],
  "total_words": 21405,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. UNIVERSITY OF WISCONSIN GYM - VERY EARLY MORNING  MARK SCHULTZ (27, 180 lbs., cauliflower ears) lifts a human-  sized, leather WRESTLING DUMMY from the mat to stand in front  of him. He performs a series of repetitive moves - hooking  one arm under the dummy’s arm, then the other; one side, then  other. Again and again. It looks almost as if he’s dancing  gently with it.  Then, very fast, Mark spins quickly around behind the dummy,  grabs it in a bear hug, arches his back, lifts and SLAMS it  to the mat, landing on top.  QUICK CUTS: Mark spinning, lifting and slamming the dummy -  first one way, then the other - first one hold, then another -  SLAM. SLAM. SLAM. SLAM. SLAM - over and over and over again.  CUT TO:  I/E. BARABOO SCHOOL/PARKING LOT - LATE MORNING  Mark pulls his beat-up car into a space in the parking lot of  this nondescript, 1960s-era suburban brick-facade school.  He’s freshly showered, wears a short-sleeve dress shirt, clip-  on tie, slacks. He reaches behind the front seat and pulls  out a battered BROWN VINYL BRIEFCASE.  CUT TO:  INT. BARABOO SCHOOL/PRINCIPAL’S OFFICE WAITING ROOM - DAY  Mark waits alone in a chair he’s much too big for, his brown  vinyl briefcase on his lap. A portrait of President Reagan  hangs on the painted cinder block wall. A clock ticks.  CUT TO:  INT. BARABOO SCHOOL/AUDITORIUM - DAY  Mark’s on stage. An audience of 4th, 5th and 6th graders.  MARK  Why do I do it? Why do I push  myself to my limits - of pain, of  exhaustion - every day of my life?  Why do I wake up every morning and  make the commitment? Why do I do  it?",
      "characters": [],
      "action_text": "The students are open-mouthed - they have no idea what to  make of him. Mark’s not being willfully over-the-top with  these kids. This is just what’s on his mind. All the time.  MARK (CONT’D)  In 13 months - if I train right, if  I push myself - I’ll be going to  Seoul - that’s a city in South  Korea. Does anyone know why?  Because that’s where the Olympic  games are.  Mark reaches into the briefcase at his feet and pulls out a  RIBBON with a MEDAL dangling from it.  MARK (CONT’D)  Does anyone know what this is?  As a couple of kids start to raise their hands --  MARK (CONT’D)  Olympic gold medal. I won it three  years ago at the ‘84 Games in Los  Angeles. My brother, Dave Schultz -  my best friend, my older brother,  my best friend - won one too, just  23 hours and 16 minutes before I  did. That’s unprecedented - two  brothers winning at the same  Olympics.  (then)  Would you like me to win another  one? Would you like me to win  another gold medal - for us, for  America? Would you like to see me  and my big brother - Dave Schultz -  both win gold medals? Who here  wants to see the two brothers win  again?  Silence. A couple of the kids tentatively raise their hands.  The rest are completely frozen.  MARK (CONT’D)  Well we’re going to give it  absolutely everything we’ve got.  CUT TO:  INT. BARABOO SCHOOL/PRINCIPAL’S OFFICE WAITING ROOM - DAY  A SCHOOL SECRETARY writes out a check as Mark stands in front  of the desk, placing his medal back in his briefcase.  2. SCHOOL SECRETARY  Twenty... and... no one-hundreds...  She tears off the check and hands it to Mark. He takes the  check, holds out to her a SIGNED 8x10 PHOTO of himself with  his arms raised, in a USA WRESTLING SINGLET just after  winning his Olympic gold.  MARK  And this is for the trophy case.  SCHOOL SECRETARY  I’m sorry?... For what?  MARK  For the trophy case.  (beat)  With the trophies.  SCHOOL SECRETARY  It’s an elementary school.  As Mark holds out the photo, WE HEAR:  FAST FOOD KID (V.O.)  Can I t",
      "dialogue_count": 0,
      "word_count": 1163
    },
    {
      "scene_number": 2,
      "slugline": "INT. MARK’S APARTMENT - DAY  An ink-stained directory of Wisconsin Public Schools lies  open on the kitchen table.  MARK (ON PHONE)  I won a freestyle wrestling gold  medal at the ‘84 Olympics.  Mark, the phone tucked against his shoulder, slips a BLANK  TAPE into a cheap VCR. He slides a HAND-LABELED TAPE into a  second VCR, wired to the first. We can read the label: “THE  MARK SCHULTZ WRESTLING CLINIC.” He starts making a copy.  MARK (ON PHONE) (CONT’D)  I’m arranging a clinic in your area  next weekend, and I wanted to  invite you and some of your  wrestlers to join...  JUMP CUT TO:  MARK (ON PHONE) (CONT’D)  That’s Dave, my brother. I wrestle  at 180... No, he won’t be there,  just me... Okay - well, good luck  with your season, coach.  JUMP TO:  On the screen is a montage of highlights from Mark’s career:  take downs, pins. He’s an animal - powerful, aggressive.  MARK (ON PHONE) (CONT’D)  Yes, there’s a small fee.  JUMP TO:  MARK (ON PHONE) (CONT’D)  S-C-H-U-L-T-Z....  JUMP TO:  On the screen, Mark wrestles Resit Karabajak, a Turkish  wrestler, in his first round match at the ‘84 Olympics.  MARK (ON PHONE) (CONT’D)  A unique, character-building  opportunity for young wrestlers....  Yes, a small fee...  Mark throws Karabajak to the mat. Pins him. Walks away, arms  raised. Crowd cheers. Karabajak’s on the mat, hurt.  6.",
      "characters": [],
      "action_text": "MARK (ON PHONE) (CONT’D)  Dave’s my brother...  On screen, Mark does a back flip.  JUMP TO:  MARK (ON PHONE) (CONT’D)  Olympic Champion...  Mark does a back flip.  MARK (ON PHONE) (CONT’D)  Dave’s my brother...  JUMP TO:  Mark’s holds the phone on his lap, just watching himself on  the screen, wrestling... winning... match after match...  EXT. MARK’S APARTMENT/OUTSIDE WALKWAY   - EVENING  Mark’s outside at the second floor railing of this two-story  stucco building, looking out over the bleak landscape: a 7-  11, an Auto-Zone. He eats a hard-boiled egg. He watches a CAR  pull into the lot below. Dave gets out, looks up.  DAVE  Where were you today?  CUT TO:  INT. MARK’S APARTMENT - MOMENTS LATER  Dave fills two mismatched glasses with tap water from the  faucet.  DAVE  How far’d you run? Ten?  Mark’s on the tattered couch. He shrugs, though we should see  that he loves the fact that Dave is concerned about him.  DAVE (CONT’D)  More than ten? Dragging weight the  whole way?  (Dave turns off the water)  You’re a sick fuck, you know that?  Dave turns to look at Mark, sitting in the bare living room.  7. DAVE (CONT’D)  Place is looking good, by the way.  I like what you’ve done with it.  Dave notices the Public Schools Directory on the table.  DAVE (CONT’D)  You setting up clinics?  MARK  Talked to some coaches.  Dave comes toward Mark, handing off a water glass, dragging  the folding chair over to sit across from him.  DAVE  I hope you don’t have anything  booked for Saturday.  MARK  Why?  DAVE  I need a favor. This school called  me months ago to do a gig but now I  can’t. Nancy’s got a thing all day  so I gotta watch the kids. You  free?  MARK  I’ll check.  He goes into the bedroom, looks at the calendar. There’s  NOTHING WRITTEN DOWN for any of the days.  MARK (CONT’D)  You said Saturday or Sunday?  DAVE  Saturday.  MARK  Saturday could work.  He comes back in.  DAVE  Good. Thank you.  Dave looks at the BACK OF HIS HAND, where he’s written down a  name and phone num",
      "dialogue_count": 0,
      "word_count": 3741
    },
    {
      "scene_number": 3,
      "slugline": "I/E. MARK’S APARTMENT - MORNING  Mark packs his apartment - trashing just about everything,  tossing it in the dumpster - stuffing the few essentials in  his AMC GREMLIN.  CUT TO:  EXT. DRIVING - DAY  Mark drives across Ohio.  CUT TO:  EXT. FILLING STATION - DAY  Mark gets gas. The attendant - clearly a HIGH SCHOOL WRESTLER  - shakes his hand.  CUT TO:  EXT. FOXCATCHER ESTATE - DAY  Mark pulls onto the estate grounds.  CUT TO:  EXT. FRONT DOOR/BIG HOUSE - DAY  Mark rings the doorbell. No answer. He goes to ring it again  and the door is opened by a UNIFORMED MAID.  MARK  Hi. I’m Mark Schultz.  Silence. That means nothing to her.  MARK (CONT’D)  I’m here to see John du Pont?  UNIFORMED MAID  Is Mr. du Pont expecting you?  MARK  Yeah. Well - not today exactly,  but, yes. This week. Sometime.  UNIFORMED MAID  Just a moment, please.  24.",
      "characters": [],
      "action_text": "MARK  In the meantime can I use the -  She SHUTS the door, leaving him outside. He turns and looks  out over the VAST LAWN of the estate. Far off, it’s being  mowed by a gardener.  UNIFORMED MAID  (opening the door)  Please.  CUT TO:  INT. BIG HOUSE/FOXCATCHER - CONTINUOUS  They walk just a few feet and she gestures toward a door.  MARK  (confused)  Is he? He’s in there?  UNIFORMED MAID  The washroom.  CUT TO:  INT. ROCOCO WASHROOM/BIG HOUSE - MOMENTS LATER  Floral wallpaper, gold fixtures and faucet. Mark pisses -  mouth open, eyes half shut. He flushes.  He looks at a dish holding little pastel horseshoes. Soap? He  picks one up, smells it. Washes his hands - monstrous with  the tiny soap. He wipes his hands on his pants, avoiding the  neatly hung towelettes. He opens the door.  UNIFORMED MAID  Mr. Beck will see you now.  Mark doesn’t know who Mr. Beck is.  CUT TO:  INT. STAN BECK’S OFFICE/BIG HOUSE - MINUTES LATER  Mark is let into a large third floor office with a big desk,  wood filing cabinets, LAW BOOKS lining the bookshelves.  STAN BECK (mid-forties, no-nonsense, suit and tie) rises from  behind the desk as Mark enters.  25. STAN BECK  Come in, sit down.  MARK  Thanks.  STAN BECK  Thank you, Rosie.  UNIFORMED MAID  You’re welcome, Mr. Beck.  She exits, closing the door behind her.  STAN BECK  Okay. Okay. So. Mark   Schultz ,  correct?  MARK  Yes.  STAN BECK  (opens a folder, writing)  S-C-H-U-L-T-Z?  MARK  That’s right.  STAN BECK  ... M-A-R-K?  Mark just looks at him. Beat. Then he nods.  STAN BECK (CONT’D)  All right. Mark. I manage affairs  for Mr. du Pont. Look after his  interests. If you have a problem,  you come to me. If Mr. Du Pont has  a problem, I’ll come to you. Okay?  MARK  Sounds okay.  STAN BECK  Let’s talk about what you’re doing  here. I’d like to make sure we all  understand each other. Does that  sound like a good policy to you?  MARK  That could be a good policy.  26. STAN BECK  Good. I think so, too. First thing  I can tell you is that M",
      "dialogue_count": 0,
      "word_count": 2817
    },
    {
      "scene_number": 4,
      "slugline": "INT. HALLWAY OUTSIDE DAVE’S ROOM - SAME TIME  Mark knocks again. We HEAR Nancy’s voice yell from inside:  “It’s open!” Mark opens the door.  INT. DAVE’S HOTEL ROOM - CONTINUOUS  Noisy, chaotic. The wrestlers glance over “Hey, Mark” “What’s  up”.... Mark’s focused on Dave, who wrestles with Alex -  MARK  Dave.  DAVE  - a scrambled-egg!... a feather-  pluck!...  Dave’s plucking Alex and Alex is cracking up.  MARK  Dave.  DAVE  Hey, Mark --  MARK  Come meet Mr. du Pont.  Dave sweeps up Alex and throws him over his shoulder,  carrying him to the door. He SHAKES du Pont’s HAND.  DAVE  Hi. Dave Schultz.  DU PONT  John du Pont. It’s a pleasure to  meet you in person finally.  MARK  (to Dave)  I told him how excited you were to  meet him.  DAVE  This is Alex, that’s my wife,  Nancy, our daughter Danielle.  (to Nancy)  Hey, Nance. John du Pont.  Nancy waves from over near the window -  NANCY  Hey.  39.",
      "characters": [],
      "action_text": "DU PONT  Hello.  DAVE  Come on in. Can I get you a drink -  DU PONT  No no.  DAVE  You sure - ?  DU PONT  Thank you. No. I need to be getting  back. But, don’t worry - we’ll make  a Foxcatcher out of you yet.  (he laughs awkwardly)  Until tomorrow.  And he’s GONE. Beat. Dave shrugs.  DAVE  Well, I know what I need.  MARK  What?  DAVE  Turkey drumstick!  He throws Alex on the bed and jumps on him. Alex SQUEALS.  Mark heads for the TV across the room. Pops in his video.  MARK  Dave, check out the tape I have on  Nanev -  DAVE  (still wrestling)  Yeah -  MARK  I want to show you this downblock -  DAVE  Cue it up.  As the tape cues up, Mark glances at Nancy.  MARK  Too difficult to come say hello to  Mr. du Pont?  40. NANCY  I said hello.  (lights a CIGARETTE)  I’m watching my kid.  MARK  It’s John du Pont. One of the most  generous men in America. He’s gonna  save USA Wrestling.  (re. cigarette)  Can you not do that in here?  NANCY  Do what?  MARK  Smoking.  NANCY  Smoke?  MARK  I wrestle tomorrow.  NANCY  It’s my room, Mark. You don’t have  to be here.  MARK  I’m trying to get advice from my  brother, get ready for the finals -  NANCY  Go get ready -  MARK  You start smoking - ?  NANCY  You can leave. Go to your own room -  MARK  - Your   kids   are in here -  She BLOWS SMOKE at him.  MARK (CONT’D)  What the hell is that?  DAVE  Mark. Calm down.  MARK  I’m not the one frigging smoking.  41. DAVE  The window’s open. Relax. Show me  what you want me to look at.  Mark looks around the room. At Alexander giggling on the bed,  at Danielle bouncing, Nancy BLOWING SMOKE RINGS. It’s all too  much. He pulls out the videotape and WALKS OUT the door.  CUT TO:  INT. ARENA/CLERMONT-FERRAND - DAY  VARIOUS SHOTS: Final matches in progress, intense and brutal.  CUT TO:  INT. LOCKER ROOM - SAME TIME  Mark sits, alone, head in his hands.  CUT TO:  INT. ARENA/CLERMONT-FERRAND - SAME TIME  Faces in the crowd watching; strained faces of the wrestlers.  Mark Schultz and Alexander Nanev’s n",
      "dialogue_count": 0,
      "word_count": 2048
    },
    {
      "scene_number": 5,
      "slugline": "INT. DINING ROOM/BIG HOUSE - CONTINUOUS/DAY  The furniture has been pushed to the walls in the huge formal  dining room, and a large WHITE SCRIM has been erected at one  end. A FASHION PHOTOGRAPHER who could double as a member of  Devo, stands at a video monitor with du Pont.  PHOTOGRAPHER  He wears the singlet -  DU PONT  - and the gold medal -  PHOTOGRAPHER  - and, of course, the gold medal.  And a lot of oil.  Mark’s in a dressing area wearing his FOXCATCHER SINGLET and  Olympic gold. Two assistants stuff his crotch with a bit of  padding.  PHOTOGRAPHER (CONT’D)  A lot of oil. Please. More oil. It  defines the musculature.  Mark walks to his spot in front of the scrim. The two  assistants slather baby oil on his arms and chest and legs as  the photographer SHOWS him the pose on the monitor.  PHOTOGRAPHER (CONT’D)  You’re winning the gold medal.  You’re raising your arms in  triumph. You’re also feeling  humility.  Du Pont is hanging back, but staring intensely at Mark. Mark  looks over to him.  MARK  You good with this?  DU PONT  It’s wonderful. It’s exactly what I  needed from you.  The photographer takes his place behind the camera as the  assistants finish with the baby oil and clear away.  PHOTOGRAPHER  Good! Now. Mark. You’re winning the  gold medal! And you are humbled!  Mark raises his arms and glances down. FLASH. FLASH.  49.",
      "characters": [],
      "action_text": "PHOTOGRAPHER (CONT’D)  Good! And again!  JUMP TO: Du Pont, in his Foxcatcher sweatsuit, is now in  front of the scrim with Mark (still in his singlet.) Mark  starts to hug du Pont for a photo -  DU PONT  I think you were below me by a  couple of steps when you hugged me  at the Worlds.  PHOTOGRAPHER  It’s true.  DU PONT  Maybe if you kneeled.  MARK  Kneeled now? On the floor.  (unsure)  Really? It won’t look...  DU PONT  No. No. You should kneel.  Mark kneels in front of du Pont. Hugs him. FLASH. FLASH.  DU PONT (CONT’D)  I think you were crying.  CUT TO:  EXT. FOXCATCHER LAWN - TWILIGHT  Mark and John, wearing TUXEDOS, board a large helicopter.  It’s cold out.  CUT TO:  INT. HELICOPTER (AIRBORNE) - EVENING  Mark and John are flown southwest toward Washington DC by  Larry the pilot.  John takes a folded piece of paper from his jacket pocket,  hands it to Mark.  DU PONT  Brandon and I prepared some  remarks.  50. Mark takes the paper and reads it over. He looks worried.  DU PONT (CONT’D)  Don’t be nervous. You’ll do great.  Mark’s not so sure. Then he HEARS a SNIFF. He looks over at  du Pont: he’s got a COCAINE BULLET in one nostril. Du Pont  inhales, then OFFERS the bullet to Mark. Mark’s frozen -  DU PONT (CONT’D)  What? You’ve never done this?  (Mark shakes his head)  It helps put everything in  perspective. Trust me....  Mark. It’s just cocaine. Trust me.  Mark takes the coke bullet, examines it for several moments,  then holds it to one nostril. He INHALES.  DU PONT (CONT’D)  Nice. You brought the medals?  (Mark nods)  Good. Try the speech.  MARK  Read it?  DU PONT  Read the speech.  MARK  (reading)  John Eagle du Pont, highly  respected ornithologist, author,  world explorer, phil... phila...  DU PONT  Philatelist.  The helicopter nears the LIT UP city of WASHINGTON D.C.  CUT TO:  INT. HILTON HOTEL, DC/COCKTAIL AREA - NIGHT  LARGE SIGN on an EASEL by the entrance reads: “CITIZENS’  DEFENSE OF PATRIOTS FUND - 1st ANNUAL GALA AND AUCTION”.  Loads of tuxedoed Repu",
      "dialogue_count": 0,
      "word_count": 603
    },
    {
      "scene_number": 6,
      "slugline": "INT. HILTON HOTEL, DC/COCKTAIL AREA - LATER/NIGHT  DU PONT (O.C.)  That’s   the one! That’s the one I  need!  A FINGER is jabbing at a military photograph of an M-113  ARMORED PERSONNEL CARRIER (APC).  We’re in a corner of the reception. Du Pont stands with Steve  Graham, looking at a set of PHOTOS. Mark’s nearby, chewing  vigorously on a straw.  STEVE  In that case, the Grand Old Party  wants to help find you one.  Graham calls over to the 3-star GENERAL in full dress uniform  who’s chewing on a cigar and drinking gin with a Senator.  STEVE (CONT’D)  General, any of these models  available?  GENERAL  Which? We might have a couple of  those left on the lot.  (to du Pont)  You gonna need financing?  Everyone laughs. Du Pont smiles.  DU PONT  What I need is the gun turret.  Don’t send me one without that MK-  19 mounted on top.  GENERAL  Uh... I don’t know there, son.  Civilians don’t usually get 40mm  blowback grenade launchers.  STEVE  General, John du Pont is hardly  your usual civilian.  The General turns back to the Senator, grumbling -  GENERAL  Am I supposed to get him a 12-pack  of live fucking grenades, too?  CUT TO:  52.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 200
    },
    {
      "scene_number": 7,
      "slugline": "INT. HILTON HOTEL, DC/BANQUET HALL - NIGHT  Mark’s on stage, at the podium, READING from his Brandon-  prepared remarks with - shall we say - some   vigor ...  MARK  ... highly respected ornithologist,  author, world explorer, phil...  phila...  Du Pont watches from the wings, whispers:  DU PONT  Philatelist.  Mark looks over at him blankly - he has no idea what du Pont  just said.  DU PONT (CONT’D)  Philatelist.  (Mark just looks at him)  Philat--  (giving up)  Stamp collector.  MARK  Stamp collector, and former  pentathlete.  Jean, in the audience, in her wheelchair, almost  imperceptibly shakes her head.  MARK (CONT’D)  Mr. Du Pont will be making his  return to competitive sports in the  over-50 category at the Masters’  League du Pont Wrestling  Invitational in Phoenix, Arizona  this March.  Scattered applause, though no one has any idea what he’s  talking about. Du Pont watches from the wings. Mark reads.  MARK (CONT’D)  I’m so proud to introduce my  mentor. He has the ability to look  at me and see where I am in life.  He knows how to motivate me. I feel  his love for me as an athlete and  as a human being. My mother and  father were divorced when I was two  years old. I spent a lifetime  looking for a father...  53.  (MORE)",
      "characters": [],
      "action_text": "and I found one in the Golden,  uh... the Gold Eagle of America -  John du Pont.  Applause as du Pont strides onstage, hugs Mark. Du Pont  turns, beaming (and a little hopped-up) to the audience -  DU PONT  Mark Schultz. Thank you, son.  (waves to Jean in  audience)  Hello, Mother.  (to them all)  The gold medal Mark won in 1984 was  tarnished. Tarnished by Jimmy  Carter. Tarnished by the  unpatriotic acts of that democrat  administration. He caused the  entire Eastern bloc to boycott our  Los Angeles Games. Mark will have  an opportunity to shine up that  medal at the World Championships in  just a few short weeks. To prove  his worth in front of the assembled  nations of the globe...  CUT TO:  EXT. FOXCATCHER ESTATE - ESTABLISHING/LATE AFTERNOON  Some time has passed. Lights are on in the windows of the  Field House Gym.  CUT TO:  INT. FOXCATCHER GYM - LATE AFTERNOON  Mark kneels on the mat with du Pont, holding him in the  starting position. Mark is talking du Pont through the moves  for an escape.  We get the sense that this is not the first of these lessons.  MARK  Ready? Go.  Du Pont clumsily attempts the escape. Mark is incredibly  gentle with him, even tender, easing him through the moves.  54.  MARK (CONT’D) MARK (CONT’D)  Okay. Let’s try it again.  CUT TO:  INT. THE CHALET - NIGHT  Mark’s HAIR IS NOW CUT SHORT AND BLEACHED WHITE. He’s in  shorts - no shirt - on the phone. He’s sipping a beer,  walking around the living room -  MARK (ON PHONE)  Yeah. I’m good. Yeah.... All good.  INTERCUT with Dave in the U of W gym office, looking out over  a wrestling team night practice.  DAVE (ON PHONE)  You working hard?  MARK (ON PHONE)  Yeah. No, I’m kind of giving myself  a bit of a break right now. I’ll  ramp it up again as the trials come  closer.  DAVE (ON PHONE)  All right. How close?  There a KNOCK on Mark’s window. Mark looks over and sees du  Pont standing outside, an eager look on his face. He beckons  to Mark and moves TWO FINGERS as if cutting his own hair",
      "dialogue_count": 0,
      "word_count": 2120
    },
    {
      "scene_number": 8,
      "slugline": "EXT. FOXCATCHER LAWN - DAY  Mark walks quickly across the vast lawn toward the Big House.  CUT TO:  INT. OFFICE ENTRANCE/BIG HOUSE - DAY  Mark enters the Big House through the rear office entrance.  No one’s in the reception area.  MARK  Hello?... Hello?  He starts up the stairs, two at a time. Stan Beck comes out  of his office, meets him at the top.  STAN BECK  Mark. How are things?  MARK  I need to see John.  STAN BECK  Mr. du Pont’s not available right  now.  MARK  Stan, please. I need to see him.  STAN BECK  He’s got a very full schedule this  afternoon. But I’ll let him know  you stopped by.  MARK  (more and more upset)  Listen - I - something happened.  There was a - misunderstanding. I  think I did something wrong and I  really need to talk to him about it-  STAN BECK  - Mark, I hear you. But Mr. du  Pont’s away for the afternoon on  business. He’s simply not here.  Mark doesn’t move.  STAN BECK (CONT’D)  You’re going to have to do this  later.  63.",
      "characters": [],
      "action_text": "Mark’s frozen, not knowing what to do, where to go...  PRELAP: KNOCKING on a DOOR...  CUT TO:  INT. BEDROOM/THE CHALET - THAT NIGHT/LATE  Mark awakens with a start to the sound of someone KNOCKING at  the front door. He looks at the clock. It’s 3 a.m.  CUT TO:  I/E. FRONT DOOR/THE CHALET - NIGHT  Mark opens the door to find du Pont standing there, in his  SWEATS. He clearly hasn’t been to bed. And it’s clearly an  artificial stimulant that’s been keeping him awake.  DU PONT  New moves. Wrestling moves. Need to  try them out.  MARK  Oh, uh -  DU PONT  In the gym.  Beat. Mark forces the cobwebs from his head.  MARK  Yeah, of course. Just... just give  me a minute.  CUT TO:  INT. FOXCATCHER GYM - NIGHT  Mark and du Pont are down on the wrestling mat. Du Pont on  top. He’s both weirdly aggressive with Mark - trying to get  him in various holds - and also, in the bizarre way he’s  pressing against Mark, quasi-sexual. Mark is BLANK-FACED.  Just waiting for it to end.  FADE OUT.  64.",
      "dialogue_count": 0,
      "word_count": 361
    },
    {
      "scene_number": 9,
      "slugline": "EXT. FOXCATCHER ESTATE - DAY  WIDE SHOT of the Foxcatcher estate. In the distance, a  HELICOPTER approaches, the rotors getting louder and louder.  CUT TO:  EXT. FOXCATCHER LAWN - DAY  The helicopter has LANDED, the rotors still WHIRRING LOUDLY.  (We won’t hear dialogue in the following sequence.)  DAVE and NANCY and the kids descend from the helicopter,  GREETED warmly by the wrestling team. MARK IS ABSENT.  Du Pont emerges from the Big House, trailed by Brandon. WE  SEE du Pont notice what a warm reception Dave gets from the  team. He comes down the steps, greets Dave and the family.  CLOSE ON: Mark, who’s at the very far end of the lawn, just  inside the ring of trees, WATCHING. His HEAD is COMPLETELY  SHAVED.  MARK’S POV: Brandon and the team escort Nancy and the kids  toward their new home. Du Pont and Dave ascend the Big House  steps together. Du Pont puts his arm around Dave’s shoulder.  Far away, the Big House front door CLOSES.  CUT TO:  I/E. FRONT DOOR/THE CHALET - EARLY EVENING  The door OPENS. Mark has opened it from the inside. He’s  looking out at: Dave, on his porch. Beat.  DAVE  Hey.  MARK  Hey, Dave.  DAVE  How you doing?  MARK  Good. I’m good.  DAVE  I hadn’t seen you yet. I just want  to make sure everything’s okay.  65.",
      "characters": [],
      "action_text": "MARK  Yeah. I’m just concentrating.  Trials are in 50 days.  Silence.  DAVE  You know, Nancy and the kids are  here.  MARK  How they doing?  DAVE  Good. You should stop in, say hi.  MARK  I will.  (beat)  I will.  As the brothers stand in the doorway looking at each other,  PRELAP: the sound of a GUNSHOT.  CUT TO:  EXT. FOXCATCHER WOODS - DAY  A deer STAGGERS. It’s been hit by a rifle shot. It stumbles,  starts to move away.  REVERSE onto Dave, holding his RIFLE. He’s hunting with Dan  Bane and TWO WRESTLERS we don’t recognize (recruited by him  in the few weeks he’s been there.) Dave FIRES again.  HEAR: opening of THE DOOBIE BROTHERS’ “ Listen to the Music”  CUT TO:  EXT. BACKYARD/DAVE AND NANCY’S HOUSE/FOXCATCHER - DAY  A BOOMBOX plays The Doobie Brothers. The deer CARCASS hangs  from a large tree. Dave SKINS it with a long knife. Dave’s  son, Alex, sits on the picnic table, watching. Danielle runs  around the yard with some of the other wrestlers’ kids.  CUT TO:  66.",
      "dialogue_count": 0,
      "word_count": 395
    },
    {
      "scene_number": 10,
      "slugline": "EXT. BACKYARD/DAVE AND NANCY’S HOUSE - EVENING  MUSIC in the background. The (now dozen or so) wrestlers and  their families are gathered around the picnic table, the keg,  the roasting deer on the SPIT over the fire.  Du Pont is at the table. Mark stays very much ON THE  PERIPHERY of the group. Dave’s holding court at the table -  in front of a huge platter of venison steaks -  DAVE  There’s this big match between an  American and a Russian. The Russian  is a monster, never lost, kills  everybody with this hold called   The  Pretzel . So the American coach  tells his wrestler, “Listen,  whatever you do don’t let this guy  get you in   The Pretzel   or you’re  dead.” Sure enough, match starts,  the Russian gets him in   The  Pretzel .  There are smiles around the table.  DAVE (CONT’D)  The coach buries his head in his  hands because he know’s it’s all  over. Suddenly, he hears the crowd  roar. When he looks up the Russian  is flying through the air - he  lands on his back, the American  jumps him. Pins him. Boom. The  match is over.  Du Pont is studying Dave intently, fascinated by the hold he  has on people - the attention he gets.  DAVE (CONT’D)  “Nobody’s ever gotten out of   The  Pretzel ,” the coach says afterward,  “How’d you do it?” “Well, Coach, I  was just about to give up when I  opened my eyes and there was this  big hairy pair of balls right in  front of my face. I had nothing to  lose, so with my last ounce of  strength I craned my neck and bit  those babies as hard as I could.”  (some laughs)  The coach says, “And that did the  trick?”  (low)  67.  (MORE)",
      "characters": [],
      "action_text": "“Coach, you’d be surprised how  motivated you get when you bite  your own balls.”  Everyone CRACKS UP. Du Pont WATCHES, trying to discern what  makes this man so effortlessly magnetic.  Then du Pont laughs loudest of all.  CUT TO:  INT. FOXCATCHER GYM - DAY  The dozen wrestlers are spread out on the mats, in pairs,  wrestling. Dave walks among them. He moves close to Springer,  giving instruction. Du Pont, in sweats and a whistle, lurks  nearby.  Mark’s off against the wall, putting on weightlifting gloves.  DAVE  He gives you opportunity, jump on  it. Hard. Drive him down.  DU PONT  No mercy!  Dave looks at du Pont, surprised by the comment - that John’s  actually behaving as if he’s coaching. Dave looks at some of  the wrestlers, realizes this is the norm. He laughs, pats du  Pont on the back.  DAVE  (to the wrestlers)  Okay. Okay. You heard the Head  Coach. No mercy.  Mark walks out of the wrestling room to the weight room.  Du Pont is thrilled to be validated for a moment. Then -  DAVE (CONT’D)  (to du Pont)  Would you give us a little room?  Just stand over there for a sec...  (turns to Springer)  Springer -  Du Pont obeys, SHUFFLES off to the side.  Fluidly, expertly, Dave talks and wrestles through a series  of moves with Springer.  68.  DAVE (CONT’D)  (MORE) - when he grabs for your elbow,  goes for head position - your hand  on his wrist needs to come up  immediately, suck his arm to your  chest, right hook over the top for  the headlock, take him down,   drive  him down -  Du Pont watches the master work for several moments.  DAVE (CONT’D)  - you see him commit you make him  pay -  Du Pont clearly has nothing to contribute. He claps.  DU PONT  Keep it up, gentlemen.  Largely ignored, he drifts off into the weight room.  CUT TO:  INT. WEIGHT ROOM/FOXCATCHER GYM - CONTINUOUS  Mark sits on the LEG-PRESS, pressing an enormous amount of  weight - repeatedly - straining, pushing himself.  Du Pont enters. Mark tries to ignore him, continues to press  the huge sta",
      "dialogue_count": 0,
      "word_count": 1214
    },
    {
      "scene_number": 11,
      "slugline": "INT. FOXCATCHER GYM - SAME TIME  The wrestlers train on the mats. Du Pont patrols the  perimeter, REPEATEDLY LOOKING TOWARD the doorway.  Du Pont SEES someone entering and immediately begins acting  coach-like, SHOUTING instruction, CLAPPING encouragement.  WE NOW SEE who has entered: Mrs. Jean du Pont. She’s WHEELED  in by an attendant; another wheels the oxygen tank she’s  attached to. They park themselves by the wall.  INTERCUT: Mark SPRINTS through the woods, breathing hard.  BACK IN THE GYM: The wrestlers notice Jean, begin to stop  what they’re doing. Du Pont BLOWS HIS WHISTLE too loudly-  DU PONT  And.... break! Gentlemen, well  done! Listen up. Team. Listen up.  Several wrestlers GLANCE toward Dave to check his reaction to  this. Dave NODS his head in du Pont’s direction.  DU PONT (CONT’D)  A number of you will be travelling  with me to the Olympic Trials in  Pensacola next week. From the  moment you leave these hallowed  training grounds, you will be in  competition. There’s no lying in a  fight. Who you think you are in the  moments leading up to a fight, and  who you are when the fight begins -  the truth will become abundantly  clear.  Jean du Pont watches her son.  DU PONT (CONT’D)  Raul Garcia, come up here for a  moment.  No one moves. He gestures at Garcia.  DU PONT (CONT’D)  Raul. Gecko. Come.  GARCIA  (mutters under his breath)  My fucking name’s Roberto,  dickweed.  73.",
      "characters": [],
      "action_text": "Springer smiles. Garcia stands. He’s clearly the SMALLEST  WRESTLER in the room. He approaches du Pont.  INTERCUT: Mark sprinting through the woods.  BACK IN THE GYM:  DU PONT  Muchas gracias, compadre.  (gestures to the mat)  Por favor.  Garcia gets in the down position. Du Pont kneels next to him,  his arms hovering over him, not yet grabbing on.  DU PONT (CONT’D)  The period begins   before   the  whistle blows, when the other  wrestler feels you above him,   feels  your purpose.  Jean watches her son, not betraying any emotion.  DU PONT (CONT’D)  Then... the whistle blows!  Du Pont grabs onto Garcia. Tries to flip him. He can’t move  him at all. TOTAL SILENCE, except for Du Pont grunting.  Mrs. Du Pont, stoic - watches her son. Then she signals to  her attendant to take her away. She’s wheeled out.  Du Pont sees her go.  FADE OUT.  INT. WRESTLING ARENA/PENSACOLA - DAY  Dave wrestles. He’s having trouble with a younger wrestler.  Mark stretches by the wall, alone, trying to concentrate on  his upcoming match. He keeps glancing over at his struggling  brother, and at du Pont in Dave’s corner.  CUT TO:  Du Pont FANS Dave with a towel in between periods, “coaching  him”, giving “advice”. He’s BEING FILMED BY A CAMERA CREW.  CUT TO:  End of Dave’s match. Mark watches the ref raise the other  wrestler’s hand. Mark’s stunned.  74. ANNOUNCER (OVER P.A.)  That’s the second - and final -  loss for David Schultz.  Dave graciously HUGS the other wrestler. ON MARK, watching,  devastated,  CUT TO:  INT. WRESTLING ARENA/PENSACOLA - LATER/DAY  Mark’s on the mat, battling a college wrestler, Rico  Chipparelli. Mark’s struggling. We see a vulnerability we  haven't seen before - something lost or disoriented. Dave  shouts from the corner.  DAVE  Get after him, Mark! Shoot low!...  Du Pont, BEING FILMED, claps, calls out instruction -  DU PONT  Need to get after him, there. Low  low low.  CUT TO:  In between periods, Mark sits in the chair in his corner  while Dave gets in his face",
      "dialogue_count": 0,
      "word_count": 1987
    },
    {
      "scene_number": 12,
      "slugline": "EXT. FOXCATCHER ESTATE - EARLY EVENING  VERY WIDE SHOT of the field between the Main House and the  stables. A distant figure - tall, thin - makes his way across  the field. “All the Tired Horses” PLAYS.  CUT TO:  I/E. FOXCATCHER STABLES - EARLY EVENING  The doors to the stables are wide open.  “All the Tired Horses” PLAYS.  The horses peer out from their stalls, confused, wild-eyed.  Du Pont goes from stall to stall, throwing open the gates. He  waves the horses out, slapping them, waving his arms,  shouting wildly, forcing the horses outside.  CUT TO:  EXT. STABLES - CONTINUOUS/EARLY EVENING  “All the Tired Horses” PLAYS. The horses CHARGE OUT from the  stables and onto the fields. Du Pont follows them out, waving  at them drunkenly, falling, getting up, falling again.  CUT TO:  EXT. FOXCATCHER ESTATE/ENTRANCE - AFTERNOON  Dave’s Subaru turns off the road, onto the main driveway of  Foxcatcher. Nancy’s driving, Dave next to her, Mark in the  back seat. A GUARD emerges from a makeshift guardhouse near  the entrance gates to stop them. Nancy rolls down window.  GUARD  Can I help you?  DAVE  (leaning across Nancy)  What’s going on?  GUARD  How can I help you?  DAVE  We live here. We’re part of Team  Foxcatcher.  82.",
      "characters": [],
      "action_text": "GUARD  Your names?  DAVE  What’s going on?  GUARD  New security plan. Names?  DAVE  Dave and Nancy Schultz. Mark  Schultz.  GUARD  Can I see some picture ID’s?  DAVE  Are you serious?  GUARD  Please.  They hand over their driver’s licences. Mark reaches to hand  his over from the back seat -  DAVE  (to Guard)  - this guy just made the Olympic  team.  No response. The Guard takes the ID’s into the guardhouse.  Mark looks out his window: patrolling the roof of the main  house, we can see PLAINCLOTHES SECURITY GUARDS. One of them  speaks into a microphone in his cuff.  The Guard returns. Hands back their ID’s. And hands Dave an  ENVELOPE.  GUARD  This is for you, sir.  CUT TO:  EXT. FOXCATCHER ESTATE/THE CHALET - AFTERNOON  Mark lifts his duffel bag from the back of Dave’s car. He  comes around to Dave’s open window.  MARK  Tomorrow morning?  83. DAVE  Yeah -  MARK  7 o’clock -  DAVE  Yeah.  MARK  I’ll pick you up tomorrow, 7am.  DAVE  You got it.  Mark starts off, then turns quickly -  MARK  Wait - your house, right?  Dave has to laugh.  DAVE  Congrats, my brother.  As Mark walks into the Chalet, he looks over toward the Big  House, where he can see a SECURITY DETAIL fanned out on the  lawn, sweeping the ground with metal detectors.  IN THE CAR: Dave looks down at envelope in his hand.  NANCY  What you got, baby?  Opens it. Beat.  DAVE  John wrote me a check for ten  thousand dollars.  CUT TO:  EXT. FOXCATCHER - MORNING  WIDE SHOT as du Pont trudges across the lawn toward the Field  House in Foxcatcher sweats. After a few moments, he’s  followed by a LARGE PLAINCLOTHES SECURITY GUARD in a dark  suit... and by Stan Beck.  CUT TO:  84.",
      "dialogue_count": 0,
      "word_count": 500
    },
    {
      "scene_number": 13,
      "slugline": "INT. FOXCATCHER GYM - MORNING  Wrestlers warm up, work out, lift weights. Dave and Mark  train intensively together, doing TAKE-DOWN DRILLS. Mark  executes, Dave murmurs instruction to Mark, they do the drill  again.  Du Pont WALKS IN THE GYM, trailed by the his Plainclothes  Security Guard and Stan. Du Pont looks like he hasn’t  showered in a few days.  Dave moves toward John, offering greetings and condolences --  “How you doing there, Coach,” “Sorry to hear about your  mother, sir,” etc.  Du Pont brushes off the offers of sympathy -  DU PONT  No no. All’s fine. There’s work to  be done.  (claps)  Back to work, gentlemen.  As they go back to their drills, John stays on the perimeter,  watching Mark, STARING at them. It’s disconcerting.  Dave moves back to work with Mark.  DAVE  Mark. Focus. Look at me.  (Mark looks at him)  Focus on me.  (Mark nods)  You here?  (Mark nods)  Let’s run it again.  Mark tries to run the takedown, Dave escapes, he spins on  Mark and takes him down hard. As they stand up, Dave smacks  Mark -  DAVE (CONT’D)  Get your head on straight and do  this.  Du Pont walks over. Mark can barely look at him. Du Pont  stops close to Mark.  Mark looks to Dave to save him from this. Dave’s clearly  caught in the middle.  Mark looks down, closes his eyes as if in pain. Du Pont moves  close to Dave, speaking to him so Mark can hear -  85.",
      "characters": [],
      "action_text": "DU PONT  If you and I can’t get him there,  no one can. We’re in this together.  After a long moment, du Pont moves off the mat. He starts to  stretch nearby. As Dave tries to get Mark back to work, du  Pont starts to JOG around the perimeter of the gym. Mark’s  trying to keep it together, but it’s clearly driving him  insane. As du Pont jogs and jogs -  PRELAP:  DU PONT (V.O.)  Our challenge... as coaches... as  leaders. I have coached... and  psychologically prepare... Our Mark  Schultz. To capture Olympic Gold...  CUT TO:  INT. DU PONT’S OFFICE/BIG HOUSE - DAY  C/U of du Pont. HE’S SPEAKING DIRECTLY TO CAMERA. We’re not  sure where we are yet. He speaks haltingly, with effort,  trying to be authoritative.  DU PONT  ...I wear many hats. I am leader.  Mentor. Father figure. Brother.  Older brother. At times the  younger...  INT. DU PONT’S OFFICE/BIG HOUSE - DAY  From a WIDER ANGLE, we see that he’s being FILMED for the  documentary. He wears his Foxcatcher sweat jacket with HEAD  COACH and JOHN ‘Eagle’ du PONT” stitched onto it.  DU PONT  It will not be easy. We have  built... our family. Our  obligation... is to build...  winners... In life. To teach the  secret... To build men who will...  think of... Who will understand...  the character traits... We must  teach them... whether they will  listen or no.  86. He’s finished. Silence. He stares steadily into the camera.  Then he twitches.  CUT TO:  EXT. FOXCATCHER ESTATE/VARIOUS - NIGHT  A SECURITY TEAM taps on the outside of the main house, listen  to the walls with what look like giant STETHOSCOPES.  THE CHALET: A HORSE, its mane unkempt and knotted, eats grass  in the side yard. Lifting its head, it noses the side window.  CUT TO:  INT. BIG HOUSE/DU PONT’S OFFICE - AFTERNOON  FRED COLE, with TWO OTHER OFFICIALS from USA WRESTLING, sits  across from du Pont’s desk. Dave’s there, as is Stan Beck.  John sits at his desk, CLEANING and OILING his pistol. A  glass of SCOTCH next to it.  FRED COLE  We’re so very sorry a",
      "dialogue_count": 0,
      "word_count": 1732
    },
    {
      "scene_number": 14,
      "slugline": "INT. FOXCATCHER GYM - SAME TIME  Dave is being interviewed for the documentary. He stands in  his workout clothes, in front of the camera crew. Some of the  wrestlers work out behind him. Dave’s reading much of what he  says from CUE CARDS held near the camera.  DAVE  My name's Dave Schultz. I'm Coach  and head of recruiting here at  Foxcatcher, under Head Coach John  “Eagle” du Pont -  CUT TO:  EXT. FOXCATCHER ESTATE - SAME TIME  Dave’s voice continues -  DAVE (V.O.)  - Coach du Pont, uh, understands  excellence, he represents...  excellence, he expects it from his  athletes -  Du Pont drives the APC over a little ridge and starts down a  long slope toward the POND.  CUT TO:  INT. FOXCATCHER GYM - SAME TIME  DAVE  (halting; trying so hard)  - His... commitment to this sport  is complete. He’s made himself um,  an... an expert in the sport of  wrestling...  Dave, who’s been so good at playing along, takes it too far  even for himself. As he says the next bit, he stumbles over  his words -  DAVE (CONT’D)  Eagle is indispensable to - uh -  what it... to - what we’re trying  to accomplish here.  (looks down,  uncomfortable)  We... consider John...  (quietly)  one of us.  94.  (MORE)",
      "characters": [],
      "action_text": "(so quietly)  One of us.  CUT TO:  EXT. FOXCATCHER ESTATE - SAME TIME  Du Pont drives the APC down the slope, into the POND. He  continues driving as the tank goes lower and lower in the  water -- the water covers the vehicle, then his torso, his  neck, his head. And he’s gone. Completely submerged.  Beat. Beat. The surface of the water is still. Beat.  Du Pont BREAKS the surface. He looks around, then swims  slowly to shore. The tank remains on the bottom of the pond.  CUT TO:  INT. DU PONT’S OFFICE - DAY  Dave and Mark sit on the couch across from Stan Beck and du  Pont. Dave is firm and clear, but entirely diplomatic. Du  Pont looks dishevelled, he won’t meet anyone’s gaze. We can  see the POSTER of Mark hanging on the wall.  DAVE  I’ll commit to remaining at  Foxcatcher so long as John wants me  here, but only if my brother is  taken care of.  STAN BECK  Taken care of how?  DAVE  So long as I’m here, Mark will  continue to be paid.  STAN BECK  Paid what?  DAVE  His full salary.  STAN BECK  You want him paid even if he  leaves? What if he quits?  DAVE  Whether or not he chooses to stay.  That’s right.  95.  DAVE (CONT’D) Stan’s incredulous. He glances over at du Pont, but his boss  doesn’t make eye contact. Stan turns back to Dave.  STAN BECK  You’re making quite an assumption  about the value of your presence  here.  DAVE  You’re welcome to test the theory.  STAN BECK  What does that mean?  DAVE  We can see how many wrestlers stay  if I decide to go.  (beat)  I hope it doesn’t come to that.  (beat)  I’d also ask John to understand the  delicate nature of the lead-up to  Seoul, and please allow Mark some  space. Let him train just with me.  Du Pont winces at this, but keeps quiet.  STAN BECK  (to Mark)  You’re that determined to leave?  Mark doesn’t respond.  DAVE  He’d like the option.  Stan leans over to du Pont and WHISPERS in his ear. It goes  on for several seconds. Finally, du Pont NODS very slightly.  STAN BECK  First of all, Mark has always been  free to ",
      "dialogue_count": 0,
      "word_count": 1054
    },
    {
      "scene_number": 15,
      "slugline": "INT. OLYMPIC STADIUM - MINUTES LATER  Mark wrestles, struggling - eyes lost, mouth open, gasping.  The drive, the poetry, it’s all gone.  REFEREE blows the whistle. The match is over. The wrestlers  stand. Referee RAISES THE BULGARIAN’S hand. Mark looks lost.  Du Pont is STARING at him. Dave hangs his head.  Ref turns the wrestlers around and raises the Bulgarian’s  hand again. Du Pont watches the small Bulgarian contingent in  the crowd - cheering, dancing, waving the Bulgarian flag.  CUT TO:  I/E. DRIVING - DAY  C/U on Mark. He’s driving. We don’t know where he is, where  he’s driving. CAMERA stays close on him for some time.  CUT TO:  EXT. DRIVEWAY/FOXCATCHER ESTATE - CONTINUOUS  Mark turns a RYDER VAN onto the Foxcatcher estate. He stops  at the GUARDHOUSE, in front of the mechanical arm which  blocks his way. The guard slides open the guardhouse window.  GUARD  Name?  On Mark, looking at him.  CUT TO:  EXT. THE CHALET/FOXCATCHER - DAY  Mark walks out of the house, arms full of belongings, past a  pile of crap he’s leaving heaped on the porch. He tosses his  things in the back of the van, slams the doors shut.  CUT TO:  EXT. BIG HOUSE/FOXCATCHER - MINUTES LATER  POV from THIRD FLOOR WINDOW OF THE BIG HOUSE: Mark driving  his van away.  REVERSE SHOT: We see who’s POV this is: John du Pont,  watching from his third floor window.  99.",
      "characters": [],
      "action_text": "DU PONT’S POV: Mark’s Ryder van drives toward the front gate,  toward the guard house...  Mark drives past it... and off the estate.  REVERSE: Du Pont, in the window, closes the curtains.  FADE OUT.  EXT. FOXCATCHER ESTATE - DAY  Birds sit in the BARE BRANCHES of an oak tree; THREE HORSES,  long-haired and un-groomed, paw at the snowy ground, looking  for grass; the American FLAG hangs limply on the flagpole.  CUT TO:  INT. BIG HOUSE/FOXCATCHER - DAY  A SERIES OF SHOTS: The EMPTY ROOMS of the Foxcatcher Big  House. Former grandeur, now devoid of life, dusty.  OVER the last of these shots, WE HEAR a DEEP, OVERLY DRAMATIC  VOICE coming from a TV:  VIDEO ANNOUNCER (V.O.)  ... He’s coached national and world  champions with his unique blend of  passion and inspiration...  C/U of a TV SCREEN: a SERIES OF IMAGES: Mark Schultz winning  matches (one of the images is the one that became the  Foxcatcher poster); Dave winning; Dan Bane winning.....  THEN, on screen, is the scene of du Pont “teaching” Mark a  wrestling move:  DU PONT  From the under hook, pivot sideways  while pulling down on his arm.  Kneel between his legs and take him  to the mat.  Mark lets du Pont take him down, though it’s abundantly  apparent how much Mark is gritting his teeth through this.  INT. LARGE EMPTY ROOM/BIG HOUSE - CONTINUOUS  WE SEE where we are: a huge empty room - once used for grand  dances.  100. In a corner: du Pont and the Documentary Director sit on two  chairs in front of a TV hooked up to a VCR. The Director is  screening “The John du Pont Story” for his boss.  Du Pont has a PISTOL tucked in his waistband.  ON THE VIDEO: A SHOT OF: Mark finding du Pont in the stands  at the Worlds and hugging him tightly.  A SHOT OF: Mark winning the Olympic Trials and Dave HUGGING  and LIFTING his brother into the air.  A SHOT OF: du Pont watching this from the stands and raising  his fist in the air.  A SHOT OF: Dave talking to the camera in the Foxcatcher gym:  DAVE  He’s made himself an - an expe",
      "dialogue_count": 0,
      "word_count": 1396
    },
    {
      "scene_number": 16,
      "slugline": "INT. THE CAGE/UFC ARENA - NIGHT  Mark fights a Japanese martial artist. Mark’s destroying him  in a brutal, uninhibited display of aggression. He’s got his  opponent on his back and he pounds his bloody face repeatedly.  The REF stops the fight. Mark stands.  He’s completely still, except for his heavy breathing. The  other man’s blood is on him. The crowd is wild, CHANTING,  SCREAMING --   “U.S.A.... U.S.A.... U.S.A.... U.S.A....”  SCREEN GOES BLACK.  105.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 74
    }
  ]
}