{
  "slug": "frankie-2019",
  "title": "frankie",
  "genre": "drama",
  "format": "film",
  "scenes_count": 8,
  "characters_count": 0,
  "characters": [],
  "total_words": 20837,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. QUINTA DE SÃO THIAGO/PAUL’S ROOM - DAY 1   1  We are in a simple, small but comfortable hotel room with bare white walls and worn out but well-kept hardwood floors. There’s a small bed with someone seemingly asleep in it; a desk and a chair in the corner. Around the window, we see a faint frame of early morning light, but the curtains are drawn closed, keeping the room dark and tranquil. After a few seconds, we notice a quiet but steady sound “ drip... drip... drip... ” breaking the absolute silence. On the bed, PAUL GAGNE has his eyes open, awake in the darkness. A light-haired Frenchman in his mid 30’s, he listens to the steady beat of water falling one drop after the next into a lonesome metal can. He can hear a piano start to play in the distance.  EXT. STREETS/SINTRA - DAY 2   2  It’s morning of a Fall day in Sintra, the ancient Portuguese city on the hills, not far from Lisbon. For centuries, this was the summer retreat for the local aristocracy. The ornate towers of various castles, each in its own architectural style, are seen above the more typical Colonial-era buildings that make up the heart of the town. There’s green all around from its famous lush gardens. The effect is romantic - almost fairy tale. The streets are still quiet in town. It’s early in the morning. The tour buses have not yet arrived. The lucky tourists who managed to get a room in town are still asleep. Well, not all of them. JAMES “JIMMY” MANUS, a robust Irishman, early 60’s, tall and gentle, strolls amongst a few LOCALS. Looking down, hands in his pockets, he is deep in thought. It’s a beautiful day in Sintra, but Jimmy is unaware of his magnificent surroundings.  EXT. FONTE DOS NOIVADOS/SINTRA - DAY 3   3  As Jimmy turns the corner, something makes him slow down. It’s nothing more than an old fountain adorned with beautiful tile work. He stops to listen to the sound of the working fountain and, as if hit by a wave of nostalgia, he slowly approaches the water stream. And as Jimmy touches the water, his eyes fill up with tears. TIAGO (O.S.) We call that   Fonte dos Noivados   - The Engagement Fountain.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 384
    },
    {
      "scene_number": 2,
      "slugline": "EXT. OVERLOOK/SINTRA - DAY 4   4  Standing on top of a sloped street, an elegant older man with silver hair, adjusts his BINOCULARS, trying to get the scene down below, of Jimmy at the fountain, into focus. The friendly looking Frenchman in his early 60’s is MICHEL GAGNE. Next to him is TIAGO MIRANTE, a striking, young Portuguese guide. TIAGO (O.S.) The tile work is from the late 18th Century, from the reign of Dona Maria I. At that time, unmarried girls would come from all over the region to drink from this ancient fountain. They’d do this pilgrimage because there was a belief that the waters would help them find a good husband. Michel lets his binoculars fall to his chest, and hang from their straps. MICHEL And did it work? TIAGO They say so. MICHEL How magnificent. If only it was so easy. Tiago smiles benignly, then starts down the street, watched by Michel. MICHEL (to himself)  Magnifique.  EXT. QUINTA DE SÃO THIAGO/SWIMMING POOL - DAY 5   5  Blue water. The surface of transparent blue water trembles, projecting abstract forms. A woman’s hand touches the water, a reflection of her face, still abstract, fills the screen. She seems to be looking at herself... or at the bottom of the pool.  2.",
      "characters": [],
      "action_text": "FRANÇOISE “FRANKIE” CREMONT, kneeling by the pool, dips one hand into the water, then the other one, making sure both wrists are wet and cool. As if part of a ritual, she then splashes water on the back of her neck. Once, twice. Frankie gets up and, meditative, keeping her eyes down at the water, takes a deep breath. She’s a striking woman, with a very short haircut, messy like a boy’s, accentuating her strong features. CUT TO: MAYA, 15, light-skinned black, in shorts and a tank top, is lying on a lounge chair by the pool reading   Wuthering Heights . She looks up from her book, inquisitive, recognizing something, or someone she knows. CUT TO: Frankie drops the bathrobe. She’s topless, wearing only the bottom part of a bikini. Another deep breath, and she dives into the swimming pool. Maya puts her book down, and watches as Frankie swims under water, and comes to the surface close to her. FRANKIE Good morning. MAYA (British accent) There’s people in the hotel, you know. FRANKIE I don’t see anyone. MAYA They can take pictures. FRANKIE That’s okay. I’m very photogenic. Maya observes as Frankie swims away, her semi-naked body moving gracefully under the water.  INT. PORTUGUESE BAKERY - DAY 6   6  A traditional Portuguese bakery with glass shelves filled with the freshest, most delicious pastries. It’s all so fresh you can almost smell it. Behind the counter is LUCIANA, serving Jimmy, placing pastries in a takeaway box. Jimmy is sipping an expresso.  3. JIMMY So that’s four   queijadas . And now, let’s see... six   pastéis , please. LUCIANA You look tired today. Did you not get enough sleep? JIMMY Well thank you very much. Another SALESWOMAN, standing next to Luciana, laughs at what she’s just heard. SALESWOMAN Luciana! JIMMY So nice to hear first thing in the morning! The Saleswoman laughs some more. Luciana blushes. LUCIANA Sorry, I didn’t... anyway, tired is sexy! Luciana hands him his box of pastries. JIMMY I’ll pretend I believe you. LUCIANA (in Portuguese)  His ey",
      "dialogue_count": 0,
      "word_count": 613
    },
    {
      "scene_number": 3,
      "slugline": "INT. QUINTA DE SÃO THIAGO/IAN & SYLVIA’S SUITE - DAY 7   7  IAN ANDOH, 46, an Englishman, black, solidly built, sits on the bed, wearing shorts, holding a running shoe. He tries to put the shoe on, but it’s too tight. He picks it up again, and as he loosens up the shoe laces, working meticulously from the top part down, a recurring thought manifests itself. IAN The whole thing is so unfair. I can’t get over it. They’re one of the happiest, most perfectly romantic pairs I have ever known. Ian’s wife SYLVIA ANDOH, late 30’s, stands across the hotel suite, dressed in pants and a bra, picking up a shirt from an open suitcase. They must have been a happy couple at some point. Now, approaching middle age, something sets them apart. SYLVIA There’s no perfection there. They have their grievances. Ian puts on the running shoe. SYLVIA Have you seen my yellow cashmere sweater? IAN To think that one is suddenly taken away from the other by this... thing, this horrible thing, makes me lose faith in love itself. SYLVIA So romantic, all of a sudden! IAN Don’t be cynical. We’re seeing your father go from romantic bliss to tears and despair. Ian stands up and grabs a T-shirt, but before he puts it on, he looks at himself in the mirror, and grabs his own love handles. IAN I have to stop with the bread. SYLVIA Why?  5.",
      "characters": [],
      "action_text": "IAN I’ve gained weight. SYLVIA Don’t start. Please. Ian puts the T-shirt on. Sylvia closes down the suitcase, frustrated that she can’t find what she was looking for. SYLVIA What day is it today? Thursday? IAN Wednesday. She goes in the drawer, grabs the first shirt she sees and puts it on. SYLVIA It’s impossible to pretend we are enjoying this trip. It’s a brutal idea she had. For us all to come here at a time like this. IAN You sure it wasn’t your father’s idea? SYLVIA What do you think? Sylvia goes out the door, leaving Ian alone with his weight and his shoes.  EXT. PORTUGUESE BAKERY - DAY 8   8  Jimmy is walking out with his box of pastries when he runs into Michel and Tiago. MICHEL You beat us this morning! JIMMY “I’d woken early, and I took a long time getting ready to exist.” Michel isn’t sure he understands. MICHEL I’m sorry?  6. JIMMY Fernando Pessoa. I just can’t help it. My mind swims with him whenever I’m here. MICHEL Jimmy, you are the only actor I know who reads anything but their reviews. Jimmy laughs, and then offers his box of pastries. JIMMY  Queijadas   anyone? Or a   pastel ? MICHEL How is she this morning? JIMMY She’s good, thanks. Fine. MICHEL And you? JIMMY I’m here in this magical town with the people I love most. I have no right to complain, do I? MICHEL I believe everyone always has a right to complain, don’t you, Tiago? TIAGO Certainly. The three men smile at each other awkwardly.  INT. QUINTA DE SÃO THIAGO/FRANKIE & JIMMY’S SUITE - DAY 9   9  Frankie, already dressed, her hair still wet, goes to the dresser and picks up a cardigan sweater. FRANKIE Will this one do? As Frankie hands Sylvia the sweater, Sylvia notices a bracelet Frankie has on her wrist, and grabs her hand to take a better look. SYLVIA Wait a minute...  7. FRANKIE Isn’t it gorgeous? SYLVIA Is it real? FRANKIE Pink diamonds, Colombian emeralds. It’s Bulgari, vintage. SYLVIA How come I’ve never seen this one before? FRANKIE It was given to me by a man I knew between Michel an",
      "dialogue_count": 0,
      "word_count": 4493
    },
    {
      "scene_number": 4,
      "slugline": "EXT. PENA PARK/PONTE PÉRGOLA - DAY 14   14  An exquisite park, with old stone gates, small lakes and views. Sylvia carries the flower bouquet Paul bought, while he walks next to her. SYLVIA Are you excited about New York? PAUL I’m looking forward to it. But excited? I can’t be excited about anything at the moment. SYLVIA Did you get the sublet? PAUL I’m not sure. SYLVIA How come? PAUL I haven’t sent the documents yet. SYLVIA Why not? PAUL Since I got the news, I haven’t been able to concentrate. I can’t work, I can’t think about anything else. SYLVIA When you get bad news, you should focus on the practical stuff. PAUL It’s too overwhelming. SYLVIA There’s nothing better to remedy an overwhelming situation than having to fill out paperwork. Did you call the number I gave you, the tax lawyer? PAUL Yes, I called him. What an arrogant guy.   (MORE)  29.",
      "characters": [],
      "action_text": "He says I should try to convince my mother to incorporate with me and Jimmy. SYLVIA I’ll talk to my dad. You should talk to Frankie. PAUL This is the last subject I want to bring up with her. SYLVIA Then you’ll have to pay the ridiculous inheritance tax. PAUL You’re so... SYLVIA Pragmatic? PAUL That’s one word for it. SYLVIA It’s just life, Paul. I don’t make as much money as you do. And when you have a teenage daughter, you get practical. PAUL Maybe. Sylvia takes a long pause, and then braves it. SYLVIA I’m going to leave Ian. PAUL How many times have I heard this? SYLVIA This time is for real. I can’t do it anymore. PAUL Is that why you’re calculating your inheritance? SYLVIA Stop it. You can’t say that to me.  PAUL (CONT'D)  30. PAUL It’s just that I’ve been hearing you say this for so long. The timing is interesting. SYLVIA You are so fucking self righteous. PAUL Come to New York. SYLVIA Why would I come to New York? PAUL New life, new city. SYLVIA It’s not that easy. PAUL No, it’s not. They look at each other, understanding. SYLVIA This is all just so horrible. I can’t believe it, really. I just can’t. Paul puts his arm around her, and Sylvia welcomes the gesture, and returns the affection. That’s when Paul tries to kiss her. It’s a surprise for Sylvia, and she pushes him away, dropping the bouquet of flowers to the ground. SYLVIA You know... that might have been romantic when we were teenagers. PAUL Even better now. We have more life experience. SYLVIA Sometimes I really hate you. PAUL I’m serious about you coming to New York. I need the pragmatism. You need to get away from Ian.  31. SYLVIA Oh, you have no sense of your privilege. If I could get a job in banking, maybe I would. But they’re not hiring philosophy majors at Credit Suisse these days. PAUL You wouldn’t want a job at Credit Suisse. SYLVIA Oh, wouldn’t I? Don’t make too many assumptions. You want to help me? Do me a favor. Talk to your mother about the incorporating idea. It’ll save everybody a lot ",
      "dialogue_count": 0,
      "word_count": 3228
    },
    {
      "scene_number": 5,
      "slugline": "EXT. SANTA EUFEMIA - DAY 22   22  Tiago stands at the side of the church, checking his phone. JIMMY (O.S.) You don’t really believe in all this, do you? Tiago smiles. TIAGO I don’t know,   Senhor . Whatever helps can’t hurt you. JIMMY I guess that’s right. Tiago pulls out a pack of cigarettes. TIAGO You mind? JIMMY Not at all. Tiago offers one from the pack to Jimmy. JIMMY No, no, thank you. Tiago lights up, and they stand together, quietly. JIMMY Are you married, Tiago? TIAGO Yes, I am. I have a wife and a son. They live in Braga, in the North. JIMMY I see. You’re separated then? TIAGO No, no, no. Just for five months a year. I come down here for the tourist season. JIMMY I imagine that can be difficult. TIAGO To be honest, it is. It’s very hard. My wife, she’s like my police.   (MORE)  47.",
      "characters": [],
      "action_text": "I love her, but she doesn’t even like me sitting next to another woman. You can imagine what it’s like when I’m here in Sintra. JIMMY Hmm. TIAGO That’s why I look so tired today. I went out to dinner with a friend last night, another guide, and when I called my wife later to say “goodnight, I love you”, she already knew where I’d been, what I drank, and who else was at the restaurant. It was incredible. We stayed up for hours on the phone, which is not good for my business. I have to be alert, and the days are not short, you know? Tiago takes a long drag. TIAGO (CONT'D) Sometimes I don’t even know why I stay married. Jimmy just looks at Tiago. He doesn’t know how to respond. TIAGO (CONT'D) I’m sorry, Señor. It’s not to bother you. I am good. I am fine. Shall we move on? I will go see about your friend now, make sure we didn’t lose him. This is not really a place for tourists, and it’s quite difficult to find the spot of the “miraculous waters.” Tiago walks away, leaving Jimmy alone with his thoughts.  EXT. TAPADA DA ROMA - DAY 23   23  Frankie sits on the bench, next to ERMELINDA, a beautiful, older lady in her 80’s, surrounded by the whole family, who move around loudly, rearranging themselves around the two women. Ermelinda leans over to Frankie.  TIAGO (CONT'D)  48. ERMELINDA J’ai vu votre photo dans le magazine. Celle qu’ils ont prise à l’hôpital. Vous vous êtes battue comme une lionne, Madame. ERMELINDA  I saw your photo in the magazine. The photo in the hospital. You fought a tough battle, Madame.  Frankie’s doesn’t know how to react to her comment; she smiles, with no conviction. A young man, FELIPE, her great nephew, stands in front of the crowd with a camera, a real camera, ready to take a photo. FELIPE Tia, um pouquinho mais pra direita. Isso. Gustavo, fica parado! FELIPE  Auntie, go to the right. Gustavo, stay put!  Ermelinda continues her whispers to Frankie. ERMELINDA Ma meilleure amie a vécu la même chose. C’était une femme d’une force exceptionnelle, ",
      "dialogue_count": 0,
      "word_count": 7733
    },
    {
      "scene_number": 6,
      "slugline": "EXT. CAMINHO DA FONTE DOS AMORES/BOIÇA ROAD - DAY 36   36  Gary walks down a remote, long road, alone, oblivious to everything around him. An OLD PORTUGUESE MAN walks by with his DOG, and as they pass by, the dog barks at Gary, bringing him back to the moment. OLD PORTUGUESE MAN (to his dog)  Quieto! Não faça isso.  (to Gary)  Desculpe.  Gary smiles politely, as the Old Man and the dog pass by. And now, with the dog’s bark far away, there is a strong silence surrounding Gary. He can hear the trees move, and the wind, with piercing clarity. He is alone with himself in this beautiful place, in Sintra.  EXT. QUINTA DA BOIÇA - DAY 37   37  Ilene comes out of the house, onto the terrace. She takes in the view of the lush valley below, a moment on her own to reflect on the tough news of the day. GARY (O.S.) Ilene! It’s Gary, coming towards her, from the front gate of the Quinta. As he approaches her, Ilene walks towards him and, unexpectedly, she falls into his arms. GARY Oh, baby. Gary, surprised by her emotions, tightens his embrace. GARY (CONT'D) Oh, honey, sweet girl. Don’t worry. It’s okay. It’s okay. ILENE It’s not... GARY Shhh...You don’t need to say anything.  84.",
      "characters": [],
      "action_text": "ILENE When I came here... I wasn’t expecting so much. GARY I know. Me either. This place is really more to dream than to talk about. She looks at him with compassion. GARY (CONT'D) I don’t know if it’s the mountain air, or these beautiful surroundings, I don’t know... but I realized today that love is all that matters. Not money. Not jobs, or movies. Or even companionship. I know it’s cliché, but for the first time I understand it’s only love that matters. Ilene listens intently. This is turning out differently than she expected. GARY (CONT'D) I’m going to leave, Ilene. ILENE But we still have a couple days off. GARY I know we do, but I’ll stay in Lisbon for a night or two. It’s supposed to be a great town. ILENE Gary, I’m sorry- GARY There’s no need to apologize. My feelings for you... if it’s not reciprocal, it’s silly to pretend. I’m too old for that. Besides, I understand how much you value your independence. Stay here and enjoy your friends. That’s what you came here for. ILENE Gary, when you shoot your film, I’ll come work on it.  85. GARY No, I don’t think that’s a good idea anymore. I hope you understand. ILENE Oh. Of course I do. I understand. Gary turns to go. GARY I should go pack. I have a car coming soon. He goes into the house, leaving Ilene alone on the terrace.  INT. QUINTA DE SÃO THIAGO/FRANKIE & JIMMY’S SUITE - DAY 38   38  In her hotel room, Frankie is sleeping. Her pale white skin barely covering the veins below, she looks fragile, vulnerable, and so different than she has throughout. Jimmy sits in a chair by the bed, watching her closely, listening to every movement, every breath. After a long moment, he stands, and starts to take off his clothes. He carefully hangs his pants on the back of a chair, then his shirt on a hanger. He goes to the bed, and gets in beside Frankie. Then he turns, and puts his arms around her. She feels his body close to hers, and turns towards him. They start to make love, quietly, passionately.  EXT. TRAVESSA DE SANTA ",
      "dialogue_count": 0,
      "word_count": 2375
    },
    {
      "scene_number": 7,
      "slugline": "INT. QUINTA DE SÃO THIAGO/LIBRARY - DAY 43   43  The grand library with an old piano in its center, where Frankie is playing music she knows so well. A CLEANING LADY from the hotel, walks by carrying a bag full of laundry. Frankie smiles, but the lady lowers her head, shy and discreet. Jimmy enters, and stays by the door frame, admiring the scene, as Frankie continues to play. Her hands glide through the different keys with the ease of someone who’s trained, but not a professional. She makes a slight mistake, but keeps going, as Jimmy comes to sit next to her on the stool. She moves a bit to give him space. JIMMY Beautiful. Frankie looks into his eyes, as she keeps playing, and sees that he’s actually crying, under a forced smile. JIMMY (CONT'D) I’m sorry. FRANKIE Don’t be. It’s sad. It’s very sad, indeed. JIMMY Yes. The song comes to a natural end, and Frankie reaches to close the piano, but Jimmy stops her. JIMMY (CONT'D) How about one more. FRANKIE No, I’m going to go for a walk, if you don’t mind. I’ll meet you all at Peninha. Frankie gives Jimmy a small kiss on his head, then gets up from the stool and leaves. Jimmy, alone with the piano, the empty room, and the silence. Until he strikes a key, any key.  95.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 230
    },
    {
      "scene_number": 8,
      "slugline": "EXT. QUINTA DE SÃO THIAGO/FRONT GATE - DAY 44   44  Frankie comes out of the Quinta, and heads up the long sloping driveway towards the road.  EXT. PRAIA DAS MAÇÃS/TOWN - DAY 45   45  Maya runs through the streets of the small beach town.  EXT. CAMINHO DOS CASTANHAIS/SINTRA - DAY 46   46  Frankie goes up a path towards Sintra, bordered by an old stone wall, with graffiti etched into the rock. As she goes up the steep incline ahead of her, she pauses for a second, catching her breath, but soon starts again, with determination.  EXT. TRAMWAY - DAY 47   47  Sitting on the tram, Maya is lost in her own thoughts, of the beach, and the day, behind her.  EXT. SEQUOIAS ROAD - DAY 48   48  Leaving the woods behind, Frankie walks onto the road where, earlier, she had her argument with Paul. After she takes a few steps on the road, she sees something that makes her pause. In front of her, the beaten up bouquet of flowers is still on the ground, oblivious to the people and the traffic that pass by. Frankie picks it up, and smells the flowers. The scent of lavender instantly brings memories back to her.  INT./EXT. TRAM/TRAM STOP - DAY 49   49  The tram makes its way back into the city of Sintra. INSIDE THE TRAM: Maya sits on the aisle, looking at sights. MAYA’S POV FROM THE TRAM: The little center of town has been taken over by TOURISTS and BUSES, its cafés and gift shops filled with people from all over the world. Ian is coming around the corner towards the final Tram Stop.  96.",
      "characters": [],
      "action_text": "INSIDE THE TRAM: Some people start to get up and gather their things. Maya recognizes someone on the street, and waves. Ian waves, but notices that Maya is waving at someone else. He looks in that direction, and sees Sylvia coming his way. She waves to Maya. Ian and Sylvia, husband and wife, meet, and wait together for the tram to come to a stop. Maya steps off, and onto the platform. She embraces her mother so tightly, that Sylvia is a little thrown.  EXT. PENINHA SANCTUARY - DAY 50   50  Ilene walks beside a long wooden rail covered in moss of various tones, going up the hill, creating a dirt path. As she enters the canyon, Ilene runs into Jimmy, surrounded by magnificent rocks in this mostly desolate area. The wind is constantly blowing, and a mist has started to form. ILENE How did you find Frankie? JIMMY Beyond recovered. ILENE She’s a star. JIMMY Yes, I know. It’s wonderful... and complicated. ILENE I can imagine. JIMMY You know, people seldom say “no” to Frankie. ILENE I know. She must have been very disappointed with my visit. JIMMY She wasn’t expecting you’d show up with a boyfriend. ILENE Ex-boyfriend.  97. Jimmy looks at Ilene, and raises his eyebrows. Ilene laughs. ILENE (CONT'D) As soon as we got here, he proposed to me. JIMMY And? ILENE He’s going back to Lisbon, tonight. JIMMY Poor Gary. ILENE Oh, I don’t know. Don’t get the wrong idea about me, or anything. I’m not some kind of femme fatale. JIMMY You must do as you feel. ILENE Did someone famous say that? Jimmy laughs. JIMMY (CONT'D) No, just me. ILENE I guess it’s true. I have to be true to myself. But now I admit I regret it a little. It means I’ll have to start up again that phase of drinks and meals, and dates with men I hardly know. I’m starting to think maybe I’m too old for it. JIMMY Careful there. If you’re old, what am I. ILENE It’s completely different for you, men. The older you are, the more attractive you get. JIMMY Is that right?  98. ILENE Oh, you must know. I’m not going to name name",
      "dialogue_count": 0,
      "word_count": 1781
    }
  ]
}