{
  "slug": "frank-2014",
  "title": "frank",
  "genre": "drama",
  "format": "film",
  "scenes_count": 5,
  "characters_count": 6,
  "characters": [
    "BARAQUE",
    "JON",
    "FRANK",
    "CLARA",
    "DON",
    "SIMONE"
  ],
  "total_words": 18752,
  "total_dialogue": 24,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. SEAFRONT ROAD - MOMENTS LATER Jon has wound his way up from the beach, just as the paramedics are loading the half-drowned keyboard player into the ambulance. For a moment the two men lock eyes. For an unnerving moment it seems as if THE DROWNED MAN IS TRYING TO TELL JON SOMETHING - as if sensing some link? Then he’s gone. Jon stares at the closing doors of the ambulance. JON (Beat) Is he going to be ok? PARAMEDIC He’ll be fine. JON (Suddenly worried) He’ll still need to spend the night in hospital though, right? PARAMEDIC He swallowed a lot of seawater. He’ll have to have his stomach pumped. JON (Relieved) Plus I suppose there’ll be a whole suicide risk assessment thing. The paramedic looks faintly disgusted at Jon, climbs into the ambulance. Jon watches as it drives away. EXT. STAGE DOOR - 9PM Jon is politely knocking. JON Hello? Nothing. Jon looks at his watch. 9pm. Jon knocks harder. The door creaks open. He nervously enters. INT. BACKSTAGE - DRESSING ROOM - CONTINUOUS Jon walks down the corridor and finds himself in a grimy dressing room. There’s no one there. JON Hello? Jon looks around.  7.  (CONTINUED)",
      "characters": [
        "BARAQUE",
        "JON"
      ],
      "action_text": "On the table there’s a SCRATCHING STICK with a very long, curved arm. There’s also some bottles of beer, one with an EXTREMELY long straw sticking out of it. Jon frowns, perplexed. Suddenly we hear a STRANGE BANGING NOISE from inside the hall. It sounds like someone is repeatedly hitting something. Jon pauses, listens, puzzled. He realizes - this must be the band. He walks towards... INT. WINGS - BACKSTAGE - MOMENTS LATER Jon watches from the shadows. ON STAGE A MIDDLE-AGED WOMAN is repeatedly banging some kind of BIZARRE PERCUSSION INSTRUMENT. This is NANA. A very YOUNG MAN stands playing bass. This is JEAN BARAQUE. A furious looking woman stands provocatively at the front of the stage, eating a pear. She tosses it aside and stalks over to an odd, vast contraption covered in knobs and dials and a MAD JUMBLE of coloured wires - an early-1970s analog synthesizer. This is CLARA. She eats the pear, tosses it aside and raises her hands over the dials. She begins to play. Together they’re making an EXTREMELY EXPERIMENTAL collection of sounds. The audience watch this odd trio uncertainly, waiting for something to happen. And out of the darkness of the wings someone Jon hadn’t noticed emerges... He’s doing a weird jerking, shuffling dance to the music. Strangest of all - he’s wearing a large FAKE HEAD, with a SMILING FACE painted onto it. This is FRANK. Jon and the audience gawp at the strange apparition dancing across the stage before disappearing into the shadows of the opposite wings. Then he wheels around and dances back on. Jon becomes aware that Don is standing next to him in the wings. They look at each other for a moment. Then Don gently pushes Jon onto the stage.  8.  CONTINUED:  (CONTINUED) Frank, Nana and Baraque ignore him, playing relentlessly on. Clara glares at him but doesn’t move. Jon stands there, not sure what to do next. Then he notices a BATTERED OLD KEYBOARD set up near the back. He walks over, stares down at it. CLOSE ON JON’S FACE - a faint frown, t",
      "dialogue_count": 3,
      "word_count": 3568
    },
    {
      "scene_number": 2,
      "slugline": "INT. HALLWAY OUTSIDE BATHROOM - NIGHT Nana queues for the bathroom. Jon exits, a towel draped over him in a manner so ‘studied bohemian’ he’s making no attempt to cover his penis. A horrified Nana puts her hands over her eyes and shrinks away, VERY UPSET. JON (V.O.)  Although one still has to be aware of the limits.  LATER Don is telling Jon off. Nana still looks upset. At the end of the corridor, regarding the scene, is Frank. JON (V.O.)  And at the heart of the beautiful madness is Frank. Frank. How to describe Frank?  INT. VETNO - JON’S BEDROOM - EARLIER Jon is unpacking his overnight bag. He looks up to see Frank standing in the doorway, watching him, his big painted smile, his hands on his hips. Jon smiles at him. JON (V.O.)  Sometimes he seems friendly.  Frank slips into the shadows. JON (V.O.)  But at other times more ...menacing...  Frank reappears in the doorway. Something in his body language makes him seem more threatening this time. Maybe it’s because he no longer has his hands on his hips. They’re hanging limply at his side. Jon looks at him nervously, then instinctively lowers his eyes. JON (V.O.)  But then ...friendly again.  Jon looks up again to find that Frank has his hands on his hips again.  25.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 221
    },
    {
      "scene_number": 3,
      "slugline": "INT. VETNO - LIVING ROOM - EARLIER Frank is watching a stupid Swedish comedy programme, shaking with laughter. Jon watches from the doorway. JON (V.O.)  Also quite ...childish?  LATER Frank is still shaking with laughter - although it’s now harder to see why, as he’s watching a gardening programme. JON (V.O.)  Disconcerting. But mostly...  INT. DINING ROOM - VETNO - EVENING Frank is ADDRESSING the band at dinner. FRANK Clara. Don. Nana. Baraque... Frank looks at Jon. FRANK (CONT’D) (Coughing) Mhwr. JON (Politely) Jon. Frank stretches out his arms. FRANK (With enthusiasm) Jon. Here, in Vetno, on our own land, we will make music that has never been made before. We will journey to the furthest corners and grab hold of the music we find there. We are, every one of us, amazing. Here in Vetno we will become   even more amazing . And we will capture it, here in Vetno, on our   first ever album . JON (V.O.)  ... mostly inspiring.  26.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 164
    },
    {
      "scene_number": 4,
      "slugline": "INT. VETNO - JON’S BEDROOM - NIGHT Jon is finishing writing his blog. Moonlight pours in through the window. JON (V.O.)  So settling into communal living isn’t easy. New people, new rules. But it’s worth it because of Frank. I'm happy to be part of this. Just... happy.  Jon presses send. He closes his laptop. A beat of silence. Then from outside comes a sudden CRY. Silence. Then another muffled shout of distress. Jon looks out the window. EXT. VETNO - MOMENTS LATER Jon comes out the back door of the house wearing his coat and boots but no trousers. He sees Don, NAKED, running towards the tree-line at the bottom of the grounds and the frozen river beyond. In the distance, near the river, Clara plays her outdoor Theremin. FRANK (Shrieking - in the doorway) Don! Get back here! (To Jon) Don’t let him get to the river! Jon runs after him, chasing Don as he zig-zags across the snow, but he’s too slow to catch him. Don shakes him off. Don is almost at the river when Clara stoops from behind her Theremin, picks up a lump of WOOD and hurls it at him. It catches Don on the side of the head and he spins to the ground, rolling over and over in the snow. ON DON ...as he lies crying. Frank approaches. DON Let me do it Frank! I don’t want to be me. Nana and Baraque are standing a little way off, looking scared.  27.  (CONTINUED)",
      "characters": [
        "FRANK",
        "CLARA",
        "JON",
        "DON"
      ],
      "action_text": "Frank gives Don a sad hug, although the size of Frank’s ‘head’ makes hugging quite an awkward experience for the person being hugged, so Don has to crane his neck right back. INT. VETNO - LIVING ROOM - LATER Frank sits alone on the sofa. Jon watches him from the other side of the room. FRANK (Sadly) Did he tell you about the mannequins? JON Yeah. FRANK I met one once. Caroline Cuntley. He offers Jon a handshake, as if he has no memory of ever meeting him before. FRANK (CONT'D) I’m Frank. JON (Beat) I’m Jon. They shake hands. JON (CONT'D) (Beat) Does he still ...with the mannequins? FRANK No, he has relationships with real women now. But ...it’s hard you know? He has to try and convince them to lie completely still, so...   (He shrugs)   Don’t tell Don I said anything. He might think it’s a shameful secret or something. But I say Tell Everyone Everything! Why cover anything up? Beat. Jon glances at the fake head encasing a real head. JON Can I ask you something? FRANK Sure.  28.  CONTINUED:  (CONTINUED) Frank leans forward, his ‘head’ in his hands. JON (Indicating the head) Why do you...? FRANK You think it’s weird? JON A bit. FRANK Well normal faces are weird too. The way they’re smooth... Frank mimes with his hands the curvature of Jon’s cheeks. FRANK (CONT'D) ...smooth...smooth...and then... Frank mimes with his hands Jon’s eyes, nose and mouth - a mime of utter chaos. FRANK (CONT'D) ... bleurewwweurgh ... There’s something lovely but slightly unnerving about Frank’s way of speaking. The words tumble out of him, like he’s a passenger in his own thought process. FRANK (CONT'D) All bumpy and holes and I mean what are EYES like? Like a science-fiction movie. And don’t get me started on lips. They’re like the edges of a very serious wound. JON (Thoughtfully) That’s true. But your head is still sort of ...intimidating. FRANK Underneath I’m giving you a welcoming smile. JON (Beat) Are you? FRANK Like this! The same static expression.  29.  CONTINUED:  (CONTINUED) A drea",
      "dialogue_count": 13,
      "word_count": 6280
    },
    {
      "scene_number": 5,
      "slugline": "INT. RENTAL VAN - TEXAS DESERT - DAY. Jon looks out of the window. JON Wow. It’s like Paris, Texas. So, okay, I’ve booked us a warm-up show in Houston. Very low key. Just to ease our way back into the world. And then straight to South By Southwest... FRANK Pull over, Jon. Frank roots around in the back of the van. JON What are you looking for? FRANK Don. EXT. TEXAS DESERT - DAY The band stand watching as Frank with a bag of Don’s ashes. FRANK Don, I remember you saying that the desert here was your favorite place in the whole world. After Sea World, San Diego. And I know you were homesick, Don. I know there were times you wanted to come back here, but you didn’t because of me. Well you’re home now Don. And we’re going to make sure that those sacrifices you made weren’t in vain. It’s your album we recorded Don - and we’re going to share it with the world. He opens the bag and tosses the ashes into the air. There’s no wind and they land with a CLUMP on the sand in front of them. I/E. DRESSING ROOM - MUSIC VENUE - TEXAS - EVENING It’s a down-at heel place in a Houston suburban strip. Baraque, beard gone, head shaved, is busy shaving the rest of the band’s heads. It makes them look even more like a cult. Nana is painting over Frank’s painted hair, so that he too looks shaved.  62.",
      "characters": [
        "SIMONE",
        "FRANK",
        "JON"
      ],
      "action_text": "THE WINGS The band watch Frank, waiting for the word from him, like soldiers waiting for their Captain. FRANK In this moment only the five of us know what the whole world is about to know. That we have found the music that will change   everything . The band look determined, almost grim. They march out onto the stage to be met by a faint welcoming applause. They glance at each other, understanding the huge significance of the moment. Nana and Baraque begin to play. After a moment Clara and Jon join in. Frank stands in the wings, listening. And very slowly his head begins to GLOW. As the head reaches MAXIMUM ILLUMINATION he BOUNDS OUT onto the stage, jerking and shuffling to the beat. He sings. DISSOLVE TO: A MONTAGE of moments from the live show. It twists and turns with overwhelming, beautiful oddness. Finally the music ends in a gigantic crescendo. We await the inevitable roar from the crowd. But instead... ...the SMALL, BAFFLED AUDIENCE offer a tiny SMATTERING of UNINTERESTED APPLAUSE. The band stare at the crowd. They can’t believe it. LATER The band sit behind a STALL, failing to sell any copies of the Vetno album. The AUDIENCE - ORDINARY LOOKING MEN and WOMEN - walk past them without showing any interest. FRANK (CONT’D) We got the music wrong. CLARA The music’s right. They’re wrong. Fuck them. Our American adventure is over. We go back to Europe. JON No! Forget these hick conformist fucks.  63.  (CONTINUED) PASSER-BY (Overhearing) Nice. JON Sorry. (Beat) South By Southwest booked us because they   already know and love us ! Frank looks at Jon. JON (CONT’D) Things will be different at South By Southwest. Trust me, Frank. They love us already there. Frank. They love us already. EXT. MAIN STREET - SOUTH BY SOUTHWEST - DAY The band, just arrived, make their way through the buzzy festival CROWDS. The atmosphere is much more bohemian and hipsterish than at the warm-up show. A HIPSTER BAND plays on a nearby bandstand. HIPSTERS in nerd glasses hand out fliers for thei",
      "dialogue_count": 8,
      "word_count": 8519
    }
  ]
}