{
  "slug": "free-guy-2021",
  "title": "free guy",
  "genre": "action",
  "format": "film",
  "scenes_count": 18,
  "characters_count": 0,
  "characters": [],
  "total_words": 21741,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. CITY STREET - DAY  A BONA FIDE SQUARE-JAWED ACTION STAR -- Cool haircut. Cooler sunglasses. Leather jacket. -- runs down a city street with a sly smirk and a briefcase stuffed with money. GUY (V.O.)  Everybody thinks they’re the main character in their own life story.  He slides across the hood into a MUSCLE CAR and speeds off. GUY (V.O.) (CONT’D)  But someone’s gotta be the bad guy, the overbearing mother, the love interest.  A COP chases after him, a BEAUTIFUL WOMAN swoons. GUY (V.O.) (CONT’D)  All I’m saying is that maybe some of us are the supporting characters in someone else’s cooler, funnier, action-packed adventure.  We RACK FOCUS behind the swooning woman to settle on -- -- A RANDOM BYSTANDER walking through the background.   This is   GUY   (30’s).   Well-kept.   Blue button-up shirt.   Clean cut. Just an average, nothing spectacular kind of guy. GUY (V.O.) (CONT’D)  Sometimes I sure feel that way.   I mean, otherwise my life would make for one boring story.  EXT. FREE CITY - DAY  A Northern metropolis hums with life -- a small cluster of skyscrapers, old and new, surrounded by urban sprawl. Bridges extend over rivers that stream out to a busy harbor. Highways are jammed with rush hour traffic. There’s a big city park with a small zoo and a sizable lake. A theater district with a flashy city square.   Elevated trains and subway stations.   Doormen stand outside million dollar condos and bodegas sell lottery scratchers.  INT. GUY’S BEDROOM - DAY  An ALARM CLOCK goes off.   Guy wakes up.   Goes through his  well-worn routine.   Showers.   Brushes his teeth.",
      "characters": [],
      "action_text": "Makes a muscle in the mirror - tries to make it look bigger. Stares at the two suits and three blue oxfords in his closet. GUY (V.O.) (CONT’D)  Every day I do this shit.  INT. GUY’S LIVING ROOM - DAY  Guy exercises along with A CHEESY WORKOUT WEB VIDEO on his laptop to a DUMB POP SONG.   Going through the motions.  FITNESS INSTRUCTOR Left, right, left, right, up, up, down, down, punch, punch, kick!  INT. GUY’S KITCHEN - DAY  Guy eats a bowl of cereal.   Plays a dumb game on his phone. GUY (V.O.) (CONT’D)  I was given the gift of life and this is how I spend it.  INT. COFFEE SHOP - DAY  Guy stands in line for coffee.   The BARISTA is ready for him. BARISTA Medium coffee.   Cream.   Two sugars. Guy smiles, trying to mask the shame of predictability. GUY (V.O.)  Pathetic.  EXT. MAIN STREET - DAY  Guy window shops.   Admires a RED SPORTS CAR in a showroom. Gawks at COOL SNEAKERS on sale for “$200” at “SOONAMI SHOES.” GUY (V.O.) (CONT’D)  I have dreams...  EXT. ATM MACHINE - DAY  Guy checks the ATM Machine.   His balance is “$197.03”. GUY (V.O.)  But I can’t achieve them.  2.",
      "dialogue_count": 0,
      "word_count": 465
    },
    {
      "scene_number": 2,
      "slugline": "EXT. CITY STREET, FINANCIAL DISTRICT - DAY  Guy walks to work in a CROWD OF COMMUTERS with his best friend,   BUDDY   -- sweet, oafy and nervous.   Always distracted. GUY (CONT’D) You ever feel like we’re just going through the motions?   Never deviating out of our comfort zones. Never making decisions that can actually enrich our lives. Buddy thinks about it. BUDDY Mmm.   Nope. They watch a STREET KID breakdancing on the sidewalk for tips.   A GIRL RIDES BY on a cool skateboard. GUY Maybe we should take up a new hobby.   Rock climbing! BUDDY No. GUY Yeah, that’s dumb.   We can try cooking classes.   It’d be a good way to meet girls. BUDDY Yeah.   No. BLAM-BLAM!   GUN SHOTS.   They whip around to see a THIEF tear out of a CONVENIENCE STORE. GUY We should probably do something. The criminal pulls AN OLD LADY out of her car and drives off. Throws a 40oz out the window.   It explodes at Guy’s feet. BUDDY Don’t get involved. GUY This whole city is going down the tubes.   Seems like every day we see another flagrant crime go down in broad daylight. He looks up at an “FCPD” CHOPPER backlit by the SUN.  3.",
      "characters": [],
      "action_text": "BUDDY Yeah, well there’s nothing we can do about it.   The cops are in the pockets of the criminals. GUY Says who? Buddy points to the newspaper headline on the STAND: “POLICE IN POCKET OF CRIMINALS.” BUDDY Don’t make waves, Guy.   You know, I heard of this guy -- not you   Guy   -- but a guy who tried to stop a crime once.   Tried to be a hero... Guy waits for the punchline. GUY And... LONG PAUSE.   Buddy clearly has no details beyond that. BUDDY Let’s just say he   regretted it . Guy concedes and follows Buddy into work.  INT. FREE CITY BANK - DAY  Guy works as a bank teller.   Cranks through the routine of stamping the deposit slip. He helps a slick DOUCHEBAG make a transaction.   A BEAUTY hanging on his shoulder.   Guy sees on his receipt that the Douche has hundreds of thousands of dollars in his account. BEAUTY (to Douchebag) You are sooo hot. She bites his ear, playful.   Guy watches, jealous. DOUCHEBAG (obnoxious, to Guy) Hello... GUY Sorry.   Have a great day. Guy passes him a WAD OF CASH and receipt through the window. Buddy works at the next station over.  4. GUY (CONT’D) We’re good people.   We play by the rules.   Pay our taxes.   But it doesn’t make a difference. Buddy looks at his friend, annoyed. BUDDY You think too much.   That guy I was telling you about...   He thought too much too.   And look where it got him. GUY Where? BUDDY (beat) You don’t wanna know. GUY Actually, I would like to -- BLAM! BLAM! BANK ROBBER Everybody down on the ground! A BANK ROBBER wearing COOL SUNGLASSES and a leather jacket fires a shotgun into the ceiling.   The OLD SECURITY GUARD lays down like a submissive puppy. GUY Here we go again. Guy and Buddy SIGH, roll their eyes, and get down on the ground.  BEHIND THE COUNTER  The Robber leads the MANAGER around with a shotgun in her back as he empties the cash drawers. BANK ROBBER Don’t anybody try to be a hero. The bank’s insured so sit tight and this will all be over soon. Guy and Buddy lay on the ground. BUDDY (calm, to Gu",
      "dialogue_count": 0,
      "word_count": 2332
    },
    {
      "scene_number": 3,
      "slugline": "EXT. CITY PARK - CONTINUOUS  The Bank Robber shoulders a PEDESTRIAN and sends her running. Pump fakes AN OLD MAN.   This is a bad dude. Guy cuts him off at the pass.   Puts a hand up. GUY I --   I’m making a citizen’s arrest.   You’re gonna come with m-- BLAP!   The Robber pops him in the face with a quick jab.   Guy drops like a sack of potatoes and The Robber takes off. Guy shakes off the punch, woozy, and gets to his feet. GUY (CONT’D) Stop him!   Stop thief! Nobody listens.   Guy takes off after him.   People look at him like he’s got twelve heads. PEDESTRIAN What the hell are you doing? PEDESTRIAN #2 Just let him go. PEDESTRIAN #3 Don’t be a hero! Guy’s too slow.   He’s breathing heavy.   He watches as The Robber jumps down some stairs to a lower walkway. This is Guy’s chance.   If he wants to get ballsy. GUY This is for Buddy! Guy veers off the trail, through the park and LEAPS OFF A TWENTY FOOT WALL. GUY (CONT’D) Ahhh! Landing on the robber but hitting the ground awkward. GUY (CONT’D) Ow. THE ROBBER’S COOL SUNGLASSES FLY OFF. BANK ROBBER Hey!   You can’t do that!  15.",
      "characters": [],
      "action_text": "The Robber is disoriented.   Guy grabs him by the collar. GUY You hurt my friend. And now you’re-- THWAP!   The robber cracks Guy across the jaw.   WHACK!   WHACK! THUD!   He thumps him with a few sloppy punches and runs off, disoriented and confused. Everything happens quickly, but to us it almost looks like The Robber   disappears   behind the trees.   Guy yells after him. GUY (CONT’D) And let that be a lesson to you! He rights himself.   His eye is raw and banged up.   Cut upper lip.   But he notices:  THE ROBBER’S SUNGLASSES . Guy picks them up.   Gets his bearings.   The Robber is gone. PEDESTRIANS walk past as if nothing happened. GUY (CONT’D) (to pedestrians) Thanks.   Really.   Thanks for all your help.  INT. BUS - DAY  Guy rides the bus home.   Nurses his wounds.   The other PASSENGERS don’t seem to care. Guy fidgets with the sunglasses.   Sun cuts through the window and shines in his eyes.   Without giving it too much thought he puts the sunglasses on and:  FROM GUY’S POV:  HE CAN SEE FULL LED READOUTS ON THE LENSES. UPPER LEFT CORNER:   Has a “HEALTH STATUS” bar that’s dwindling in the mid-yellow range. UPPER RIGHT CORNER:   Has a picture of a FIST.   $197.03 in cash with a green status bar next to it.   And a timer. LOWER RIGHT CORNER has a GPS MAP of the ten block radius around his location.  OBJECTIVE POV:  Guy reacts.   Rips off the glasses, shocked.  16. GUY The hell? He looks around to see if anyone noticed.   Pockets the glasses.   Feels guilty for some reason.   Nobody cares. Settles into the idea and takes the sunglasses back out. From all appearances, they just look like normal sunglasses. He puts them back on and looks around. GUY (CONT’D) Whoa. Besides the readouts, there’s nothing exceptional about them until he glances DOWN THE AISLE and notices: A FIRST AID KIT -- -- floating two feet off the ground at the back of the bus. Slowly spinning.   A small spotlight on it. Guy reacts.   Looks around.   Is this some kind of joke?   What should he d",
      "dialogue_count": 0,
      "word_count": 698
    },
    {
      "scene_number": 4,
      "slugline": "EXT. BUS STOP - CONTINUOUS  DING!   The bus stops and Guy runs off, freaking out. GUY Calm down, Guy.   Just keep it together. He thinks about it and puts the sunglasses back on.   It looks like just a normal day except for: A WAD OF CRISP $100 BILLS -- -- floating two feet off the ground by the newsstand.   A little spotlight makes it stand out. A PEDESTRIAN passes right through it, buys some gum and leaves, without noticing the money. Guy rubs his mouth.   Approaches the stack of money.   Looks at it, just floating there. NEWSSSTAND MAN Can I help you, sir? GUY Mmmm.   No.   Just looking. Guy reaches out and touches the stack of money and -- -- BRRRRRUP!   The MONEY STATUS BAR on his glasses jumps by TWO THOUSAND DOLLARS.   Guy rips the glasses off.   Can’t believe it. GUY (CONT’D) No.   That --   This is just not -- It can’t be --   These are just --  EXT. ATM MACHINE - DAY  Guy punches his code into the ATM and checks his balance. Sure enough --   he has TWO THOUSAND MORE DOLLARS in his account than he did a few minutes ago. He puts a fist to his mouth.   This can’t be real.  Reaches out, hits the ‘withdrawal’ button and -- -- CH-CH-CH-CH!   The machine spits out hundreds of dollars. He stuffs his pockets, guilty, and gets out of there fast. RUNS DOWN THE STREET and sees:  18.",
      "characters": [],
      "action_text": "”SOONAMI SHOES” from earlier.   The pair of sneakers he was admiring are still in the window.   Guy raises an eyebrow. CUT TO:  INT. SOONAMI HEADQUARTERS - DAY  A modern loft-like office space with a different color palate then anything we’ve seen so far.   Clearly a tech company of some sort.   ”SOONAMI CORP”. Dozens of cubicles are filled with busy PROGRAMMERS.   Some work on monitors, some use VR headsets.   The bulk of them are Millennials and dressed casually.  INT. PROGRAMMER’S DESK - DAY  A twenty-something programmer,   PUNIT , sits in front of a computer, on his phone.   Reclining. PUNIT (on the phone) C’mon, let’s get a date on the books already.   I’ll come to you. I’ll cook you dinner.   I’ll upgrade your home system.   I’ve got this playlist I’ve been working on -- BEEP!   Something on his monitor requires his attention. PUNIT (CONT’D) Sorry.   I gotta deal with something here.   But think about it. He hangs up and opens: “USER COMPLAINT #4521.”   He clicks on it and reads the complaint.   Routine.   Clicks to another screen and we see: FREE CITY.   Surveillance video of the whole city. He scans the view from different angles.   Can’t seem to find anything wrong until -- something catches his attention. THE SHOE STORE.   Punit zooms in and reacts, surprised. PUNIT (CONT’D) Hey, dude.   Come look at this. A pudgy, disheveled programmer sitting next to him rolls his chair over.   This is   GARETH .   He glances at Punit’s monitor.  19. GARETH What am I looking at? PUNIT Blue Shirt Guy. He points and they watch as a REALISTIC ANIMATED VERSION OF GUY is buying the pair of sneakers he likes.   Gareth reacts. GARETH Let’s see the coding. Punit hits a button that turns the feed of Guy shoe shopping into PROGRAMMING CODE.   Hits it again to switch it back. GARETH (CONT’D) Huh. PUNIT You ever see something like this before? GARETH Noop. Gareth takes a closer look.   Reacts. GARETH (CONT’D) He’s got our sunglasses on. Punit checks it out and confirms.   Whoa .   ",
      "dialogue_count": 0,
      "word_count": 1721
    },
    {
      "scene_number": 5,
      "slugline": "EXT. MULTIPLAYER CAFE - DAY  He walks outside, hyperventilating.   He looks up into the sky and around the city.   It will never look the same to him again.   His entire world is rocked. Mac, the homeless man, yells at people on the street. MAC You’re living in a game!   This is all just a game! Guy starts to put it all together, floored and -- --   WHAM!   A POLICE CAR mows him down.   Lights out. CUT TO:  INT. GUY’S BEDROOM - DAY  The ALARM CLOCK goes off and Guy snaps out of bed as if from a nightmare. GUY Ah! He feels his body, frantic.   He’s in one piece.   Whew .   Runs to the mirror.   He’s fine.   But remembers. GUY (CONT’D) The sunglasses!  EXT. NEIGHBORHOOD - DAY  Guy jogs through the neighborhood the cops chased him through yesterday.   Ends up at the same corner where the Multiplayer Lounge should be but now: THE LOT IS EMPTY.   Exactly what it looked like with the glasses off yesterday. Guy sees THE TOP OF THE BRIDGE in the background.  EXT. BRIDGE - DAY  Guy walks out of the city across the bridge, determined.  EXT. NEIGHBORHOOD - DAY  Guy makes a beeline away through brownstone suburbs.  26.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 204
    },
    {
      "scene_number": 6,
      "slugline": "EXT. MARSHLAND - DAY  He pushes through dense marshland but always comes out of the weeds staring at the same view of the Free City skyline.  EXT. WATERFRONT - DAY  Guy jumps in a small motorboat. Drives it away from the city. He moves past buoys and boats until he’s out in open water. Looks back at the skyline.   He realizes -- GUY It’s not getting further away. -- he’s inexplicably treadmilling in place.   A BUOY besides him stays in place.   His boat isn’t caught on anything. He throws the engine in reverse and the boat glides again back towards the city.  EXT. CITY PARK - DAY  Guy sits on a bench, watching the city with new eyes.   He realizes that there are ONLY A DOZEN DIFFERENT TYPES OF PEDESTRIANS walking around the area at any one point. GUY Man in black business suit. Old lady in shawl. Chubby dude. Hipster mustache. Slob in a wife-beater. They all say ONE PHRASE to each other as Guy walks past. BLACK BUSINESS SUIT Hey! OLD LADY Watch where you’re going! CHUBBY DUDE Do you mind? STREET COP Move along, people. A GANGBANGER pushes past and they REPEAT THE SAME LINES. Guy clocks that The Gangbanger is wearing -- GUY Sunglasses.  27.",
      "characters": [],
      "action_text": "The same kind that he had.   The Gangbanger pulls A MAN out of his car, screaming, and drives off, BLASTING THE RADIO.  EXT. CONVENIENCE STORE - DAY  Guy watches a robbery in progress.   A GUY IN A MASK is holding up a convenience store. He’s wearing the same exact -- GUY Sunglasses.  EXT. BUSY CITY STREET - DAY  A JAPANESE SCHOOL GIRL steps out of a car with a MISSILE LAUNCHER and BLOWS UP A FALAFEL STAND.   She too wears -- GUY Sunglasses!  INT. TIMMY’S BAR AND GRILL - NIGHT  Guy runs into the bar and finds HIS SOFTBALL TEAM, drinking after their game.   Everybody is in their same seats.   Even Buddy, a little banged up, but fine. BUDDY Guy!   Where’ve you been?   You didn’t come to work. TEAMMATE We had to forfeit the game. Incomplete roster. GUY Buddy!   Are you alright?   You got beat up pretty bad yesterday. BUDDY Oh.   It’s nothing. GUY Buddy, it’s   not   nothing.   There’s something I need to tell you. BUDDY Guy, just give it a rest. GUY No.   This is important. Guy climbs up on a stool.   Announces to the entire bar.  28. GUY (CONT’D) Listen.   Everyone.   I don’t know quite how to say this.   But -- This bar --   Everything in the --   Us   -- It’s all just a game.   We’re living in a real, actual --   I mean, I think a video game of some sort -- for another, dimension?   And we’re like --   We’re not the players. The people with the sunglasses are. We’re, like,   the background people!  BUDDY Guy!   Knock it off. GUY You were right, Buddy.   They don’t want us to rock the boat.   In fact, the whole reason we’re here is to be screwed with by the sunglasses people.   For their sick amusement -- that’s so messed up -- but I’m gonna figure it out! I just need to talk to this girl. MolotovGirl! But I need to get the sunglasses first-- BUDDY You’re acting crazy. GUY That’s just the thing.   For the first time in my life I feel completely sane.   I can see the world with perfect clarity.   I -- MAC (O.S.) Freedom is just an illusion! Guy looks outside the windo",
      "dialogue_count": 0,
      "word_count": 857
    },
    {
      "scene_number": 7,
      "slugline": "EXT. ALLEY - LATER  The garage opens and a JACKED HIPSTER walks out wearing the glasses.   He looks around, not noticing:  UP ABOVE  Guy is carefully lowering a makeshift hook.   He’s just about to hook the glasses when the jacked hipster notices.   Pulls out a GUN and OPENS FIRE.   Guy runs away. GUY My bad!  I/E. VARIOUS ATTEMPTS  Guy charges players from behind, throwing things, tripping them, timing it wrong, missing entirely. GUY Sorry.   Sorry!   Sorry. He hits a player on the back of the head with a TWO-BY-FOUR. GUY (CONT’D) Sorry! TINK!   The glasses bounce across the pavement, unscathed. Guy can’t believe it.   While the player runs around, disoriented, Guy puts them on and sure enough: THE READOUTS APPEAR.   Yes!  CUT TO:  INT. ACCOUNTING OFFICE - DAY  A mousy secretary sits behind a desk.   Her hair covers half her face.   Librarian glasses.   She clutches the top of her blouse, protective.   Mid-twenties.   This is   MILLIE . BOSS (O.S.) Millie!   I need the Fentons’ W-2’s on my desk now!  INT. OFFICE KITCHEN - DAY  Millie tries to make copies and the machine craps out on her. She opens a side door, frustrated and PLOOF!   A cloud of black ink sprays all over her.  31.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 204
    },
    {
      "scene_number": 8,
      "slugline": "EXT. MAGAZINE STAND - DAY  Millie picks out A TECH MAGAZINE and pays for it.   The CLERK leers at her and she clutches her blouse. Avoids eye contact. CREEPY CLERK S’up girl?  EXT. HIGHWAY - DAY  HONK!   A terrible traffic jam.   Millie sits in her tiny Honda.   She’s about to move forward when someone cuts her off and gives her the finger.   She quietly takes it.  INT. SUBURBAN HOME - DAY  Millie runs into a house and darts directly upstairs. MOTHER (O.S.) Millie!   I thought we were gonna talk when you got --  INT. MILLIE’S ROOM - DAY  SLAM!   Millie locks herself in her room and takes a DEEP BREATH, finally safe. She takes out the Tech Magazine she bought earlier and leafs through a profile on: “SOONAMI’S ILLUSIVE CEO,   ANTWAN HOVACHELIK , HIS UNSTOPPABLE GAMING EMPIRE AND THE LAUNCH OF THE LONG-AWAITED SEQUEL, FREE CITY 2.” It features a skinny, young guy in his mid-twenties. She   sticks a tack right into his forehead   on: A CORKBOARD FILLED WITH CLIPPINGS ABOUT ANTWAN and FREE CITY. We see words like: “CHEAT CODES” and “UNHACKABLE PLATFORM”. She sits down at her desk, sets up her takeout food, ritualistically, and puts on A VIRTUAL REALITY HEADSET.  INT. MULTIPLAYER LOUNGE - DAY  Millie appears in the Multiplayer Lounge as MOLOTOVGIRL4482 -- the kickass avatar she uses in Free City.   A tall, confident version of Millie with a few cosmetic enhancements.  [Note: Millie and her avatar are played by the same actress, so we’ll just call her Millie from now on.]  32.",
      "characters": [],
      "action_text": "She turns heads here.   She’s in her element. ANONAMOU$E Hey...   MolotovGirl. She sits down at a corner table with   ANONAMOU$E   - a shady dude who wears a trenchcoat and motorcycle face mask.   Talks with a MODULATED VOICE. MILLIE You got that thing for me? ANONAMOU$E It’s in a briefcase on this shipping container. He slips a “SHIPPING MANIFEST” across the table.   She reaches for it and he grabs her wrist. ANONAMOU$E (CONT’D) This   thing   is strong enough to take down the whole game.   I’d like to know what it’s gonna be used for. MILLIE I’ve got my reasons. She JAMS A KNIFE INTO HIS HAND and kicks the table over. Tosses a wad of cash onto his lap as he tries to get unstuck. ANONAMOU$E You know they’re about to release the sequel!   In a few days it’s all gonna be gone anyway. MILLIE That’s why I don’t have any time to lose with a-holes like you. She gets up to leave when GUY RUNS INTO HER. GUY Hey, there.   Not sure if you remember me from the other day but, I was wondering if I could bother you for a sec -- MILLIE Um, no. She walks away and he scurries after her. GUY Ha.   No, but really --  33. She looks at his username.   “GUY (NPC) Level 1”. MILLIE Sorry, I don’t talk to newbs.   I’m not even sure how you got in here. GUY Yeah.   Well, that’s kind of what I want to talk to you about -- She’s already out the door.  EXT. CITY STREET - DAY  Millie struts down the street.   Guy follows her. GUY It’s just that you seem like someone who knows a thing or two about this place. MILLIE I thought I told you to get lost, newb. GUY Yeah, but, um.   And a newb is... She spots an ARMORED TRUCK up ahead. MILLIE Wow, you really are a newb.   You’re like a newby-newb, newb. GUY So true.   So true.   But, really. She’s captivating and graceful as SHE PULLS THE PIN OFF A GRENADE and tosses it underneath a parked car. MILLIE I don’t associate with anyone under Level Fifty. KABOOM!   The parked car launches off the ground from the explosion and everyone runs off, screaming. MI",
      "dialogue_count": 0,
      "word_count": 1665
    },
    {
      "scene_number": 9,
      "slugline": "EXT. BASEBALL FIELD, PARK - DUSK  Guy’s softball team stand on the field.   Silent.   Waiting. Totally confused.   It’s an eerie scene. TEAMMATE We don’t have enough players. BUDDY Guess we gotta forfeit   again . GUY (O.S.) Not just yet. All heads turns as -- -- Guy drives up alongside the field in the Ferrari. Everybody watches him, stunned speechless.   Guy saunters over and grabs the baseball bat.   Reacts. GUY (CONT’D) Well?   What’re you all standing there for?   Let’s play ball! The Green Hat’s Pitcher shrugs and gets ready to pitch.   Guy points a finger out towards center field, calling the shot. The Pitcher is caught off guard.   Hunkers down.   Pitches the ball and just before it leaves his hand -- GUY   (PRELAP) (CONT’D) Drinks are on me!  INT. TIMMY’S BAR AND GRILL - NIGHT  The Blue Team CELEBRATES.   Guy is the center of attention. TEAMMATES You did it! / That was amazing! / Where’d you get those clothes anyway, Guy? GUY Oh.   These old things.   Picked ‘em up this morning at Soonami’s. TEAMMATE And that car.   It probably costs twenty times what you make in a year.  40.",
      "characters": [],
      "action_text": "GUY I got the original owner to part with it for pennies on the dollar. Buddy looks him up and down as if he were an alien.   Afraid.  GUY PULLS BUDDY ASIDE  GUY You okay, Bud? BUDDY I’ve been waiting for you every morning.   You don’t show.   You’re not at your apartment.   You don’t come to work.   And then you just show up in the middle of a game and expect everything to be okay. GUY I’m sorry.   I’ve been busy. BUDDY Guy, what the heck is going on? Buddy is practically in tears.   Guy feels bad for him. GUY You really wanna know? BUDDY I think so -- I’m not sure --   No. I guess not. Guy takes off his sunglasses and hands them to Buddy. GUY Here.   Give these a try. BUDDY What do you mean? GUY Put ‘em on. BUDDY Why? GUY Trust me.   Just put on the sunglasses. Buddy is having a hard time with it.  41. BUDDY But it’s nighttime. GUY That’s not the point -- (frustrated) -- Buddy, what do you remember of your childhood? BUDDY (thinks) Nothing.   I have a bad memory. GUY Me too!   That’s all a part of it. But from what you can remember, I’ve always been your friend, right? BUDDY Well, yeah.   Sure. GUY So, who are you gonna trust more than me? BUDDY (beat, realizing) Nobody. GUY Right.   So, put on the sunglasses. BUDDY Why do you want me to put on the sunglasses? Guy pounds the bar. GUY Buddy!   They’re   sunglasses.   You wanna know how I got this stuff? How I hit that home run.   It’s because of the glasses!   Just -- He tries to force the glasses on Buddy.   Buddy struggles to push him away. BUDDY No!   Stop it!   GUY Would you just!   Hold still! Guy relents.   Backs off.  42. GUY (CONT’D) It’s okay.   It’s fine.   But just remember -- that’s the difference between us.   That’s why you’ll always just be a rat in a cage. BUDDY You’re acting cuckoo right now, Guy.   Even for you. Guy looks around the room and spots THE HOT GIRLFRIEND OF THE DOUCHEBAG in the corner booth.   Guy opens his notebook and eyes an empty box on his list, “GET LUCKY.” GUY Well, if you’ll ex",
      "dialogue_count": 0,
      "word_count": 679
    },
    {
      "scene_number": 10,
      "slugline": "INT. PENTHOUSE - NIGHT  The lights from the city twinkle outside the sickest penthouse view.   Guy and Beauty are making out. BEAUTY You are so hot. GUY You too. BEAUTY You are soooo hot. GUY Yeah.   Same. He tries to undo her bra but can’t find the latch. BEAUTY You are so hot. Now Guy’s a little annoyed. GUY Yep.   Got it. BEAUTY You are sooooooo hot. GUY ‘kay, but maybe we should just like, concentrate on the kissing stuff. She nods and they get back into it. BEAUTY You are soooooooooo hot! Guy undoes her bra latch and -- --   DING!   The Level above his head jumps to “49”.  INT. FREE CITY BANK - DAY  Guy strolls into the bank next day with an ear-to-ear grin. Dressed in an expensive suit.   Rocks a Rolex and nice shoes. GUY Maury.   How’s it hanging?   Jessica, looking good.   Looking good.  44.",
      "characters": [],
      "action_text": "They all stare like he has nine heads as he takes his place behind the counter.   Buddy just can’t understand. BUDDY You’re late.   You know that? Guy checks the computer.   Looks at his own account screen: He has over TWENTY MILLION DOLLARS.   He chokes on his coffee. BUDDY (CONT’D) Management’s calling for your head. GUY Yeah.   Well, what management wants is really not that big of a concern for me anymore. BANK ROBBER (O.S.) Everybody down on the ground! BLAM-BLAM!   A new BANK ROBBER strolls through the doors. Everyone gets down on the ground.   Guy just smirks. BUDDY Guy!   What are you doing?   Get down.   On the ground. GUY Not today. BUDDY You remember what happened to that one guy who tried to be a hero... GUY He saved the day and everybody loved him for it? BUDDY No.   No,   the opposite . The Robber notices Guy. BANK ROBBER Hey!   I thought I told you to get down on the ground. GUY Yeah, I’m not gonna do that.   You see, I need to talk to this really attractive militant girl from another dimension.   But she won’t give me the time of day unless I’m Level Fifty.  45. The Robber reacts, puzzled. BANK ROBBER I’m giving you to the count of three to kiss that floor or I’m gonna smash your mouth in. GUY That so? BANK ROBBER Yeah.   That’s -- WHUNK!   Guy grabs the gun by the barrel, jams the robber in the face with the stock and knocks him out. GUY This is my bank, bitch. The robber’s duffle bag hits the ground and... THROUGH GUY’S POV: DOZENS OF CASH WADS fly across the floor. He walks through them and BLOOP-BLOOP-BLOOP!   His money count jumps through the roof. Guy glances in an ORNATE DECORATIVE MIRROR and the Level number above his head ticks up to: “LEVEL 50”. He reacts and BA-WONGGGG! A SHIP’S HORN SOUNDS (PRELAP).  EXT. DOCKS - DAY  A JAPANESE CARGO SHIP is docked, stacked with containers. YAKUZA GANGSTERS stand guard around the ship with UZIs.  EXT. CARGO SHIP - CONTINUOUS  TWO ARMED YAKUZA stand along the railing, stoic, when -- -- FFT-FFT!   They’re h",
      "dialogue_count": 0,
      "word_count": 1972
    },
    {
      "scene_number": 11,
      "slugline": "INT. PARKING GARAGE - DAY  Millie shows Guy the commercial on a SMARTPHONE.   The graphics are better, the city is bigger.   He even spots a BETTER LOOKING VERSION OF HIMSELF in the background. ANNOUNCER (V.O.)  So play Free City while you still can.   Because in two weeks, it’s gonna be gone for good to make room for something a whole lot better.  Guy is freaking out.   Looks out at the city. GUY So like, this whole city -- everybody who lives here -- is gonna be shut down?   Gone. MILLIE Finito.   Yep.   It’s entirely stored in the cloud, so it takes up too much room on Soonami’s servers to have both. GUY This is bad.   This is really bad. MILLIE No kidding.   Antwan’s gonna make a gazillion dollars from it too. GUY Who’s Antwan? WHUKKA-WHUKKA-WHUKKA!   The ground starts to RUMBLE and: A CHINOOK HELICOPTER lowers down to their level.   Guy and Millie stumble backwards, caught off guard. GUY (CONT’D) Uh-oh. MILLIE Guy, that’s no ordinary FCPD helicopter.   That’s a military- grade assault chopper. They scramble down to the next level only to see: A CAVALRY OF POLICE CARS heading towards the parking garage. Millie turns to Guy, even more puzzled.  54.",
      "characters": [],
      "action_text": "MILLIE (CONT’D) Who are you? RAT-AT-AT!   The chopper fires and Guy dives behind a HUMVEE. GUY I’ll tell you everything when we meet up again. If we meet up again. MILLIE The Multiplayer Lounge. GUY No.   At the first place you stopped to watch me.   The game in the game. KABOOOM!   The chopper launches a missile and blows up the HUMMER.   Millie is visibly shaken and scrambles away.  IN THE CHOPPPER  Punit and Gareth’s COP AVATARS pilot the helicopter. PUNIT/COP I can’t tell if we got him. GARETH/COP Well, you just blew the entire second floor to kingdom come. Gareth/Cop pulls up computer code on a touch-screen monitor. GARETH/COP (CONT’D) His permissions are ‘blocked’. He’s still playing. PUNIT/COP Then we need to smoke him out. The helicopter starts firing on Guy’s arsenal of cars. Blowing them up one by one down the line.   BOOM! BOOM! BOOM! Punit/Cop smiles gleefully at the controls. PUNIT/COP (CONT’D) I’ve worked here so long I forget how fun this game is sometimes. GARETH/COP Uh, Punit? Gareth/Cop points --  55. IN THE GARAGE  Out of the cloud of smoke -- -- A TANK appears.   Its canon aimed at their chopper. PUNIT/COP Oh, crap -- KABOOM!   The tank blows the helicopter out of the sky and plows through the garage’s upper level wall.   The tank speeds away, BLASTING HEAVY METAL MUSIC.  IN THE TANK  Guy is at the helm.   Croons along with the METAL SONG.   He plows right through a line of POLICE CARS. GUY Woo!   C’mon, dickheads.   Follow me.  EXT. CITY STREET - DAY  The city hums with rush hour traffic. THE TANK barrels down the street, trailed by a parade of cop cars.   One pulls out in front and the tank mows it down. Pedestrians run out of the way, yelling their reaction lines. PEDESTRIANS Hey! / Watch where you’re goin’! / Do you mind? / Nothing to see here.  EXT. STREET CORNER - DAY  Buddy waits on the street corner where he usually meets Guy to walk to work.   Checks his watch, concerned. Perfectly timed, the tank cruises down the street.   Guy pops out ",
      "dialogue_count": 0,
      "word_count": 1573
    },
    {
      "scene_number": 12,
      "slugline": "EXT. FREE CITY TOWER ROOF - DAY  Guy waves his blue shirt to the sky.   Hoping. GUY C’mon!   Talk to me!   You need to talk to me!   Just -- FOOM!   Guy reacts, horrified, as... THE ENTIRE FREE CITY TOWER BELOW HIM DISINTEGRATES. The whole building is   deleted right out of existence   in an instant and he’s left floating there until -- -- GUY FREE FALLS BACKWARDS, through thin air, a hundred stories down.   The whole city, all the programmers watching, amazed, until he hits the gr--  INT. GUY’S BEDROOM - DAY  Guy snaps up in bed without freaking out, fully aware of where he is and what just happened.   And he’s pissed.  INT. SOONAMI HEADQUARTERS - DAY  Back in the Soonami offices, Punit and Gareth work head-to- head on their laptops in the war room.   The PROGRAMMERS around them APPLAUD. PUNIT Don’t pop that cork just yet.   We need to isolate him now before he can get our glasses again.  INT. GUY’S LIVING ROOM - DAY  Guy runs out of his room to the front door, about to open it. KNOCK-KNOCK-KNOCK!   Someone on the other side pounds and turns the knob. GUY Shit. The pounding stops and then the DOORKNOB starts fidgeting. Someone on the other side is picking the lock. Guy looks out his window:  62.",
      "characters": [],
      "action_text": "A PADDY WAGON from the “FREE CITY HOME FOR THE MENTALLY ILL” is parked outside his building.   Out the other window: A SWAT TEAM moves up the alley.   Guy is trapped.   But he’s not gonna go down like this.   Opens his closet and looks around.   There’s a small door in the ceiling for the attic.  BACK AT THE FRONT DOOR  BLAM!   Punit and Gareth, now using ORDERLY AVATARS, break in. GARETH/ORDERLY Hello!   Anybody home? They quickly search the tiny apartment and realize he’s gone. PUNIT/ORDERLY Search the bedroom! Gareth checks the closet and eyes the attic door.   Shoves it open and sticks his head up inside. GARETH/ORDERLY Set up a perimeter.   He couldn’t have gotten far!  INT. STREET CORNER - DAY  A STREET KID waits for the bus, chunky headphones.   Black jacket.   Hoodie.   Guy taps him on the shoulder. GUY You wanna make a hundred and ninety seven dollars?  EXT. CITY STREET - DAY  Punit/Cop and Gareth/Cop walk down the street, shoving pedestrians, looking for Guy. PEDESTRIANS Hey! /   Watch where you’re goin’! / Do you mind? / Move along people. That’s when Punit spots Guy’s signature BLUE SHIRT. PUNIT/COP There!   There he is.   Move in. From behind, Guy walks down the street when THE TROOPS MOVE IN. Within seconds he has a hundred rifles aimed at his face.  63. SWAT OFFICER Freeze!   Hands behind your head! Down on the ground! The person turns around and reveals that   IT’S NOT GUY .   It’s the Street Kid dressed in his clothes. STREET KID I didn’t do anything!   I know my rights! Punit/Cop reacts, angry. PUNIT/COP We got the wrong guy.  EXT. CITY STREET - DAY  Guy makes his way down the street in the street kid’s clothes.   Keeps his head down.   Hood up. Looks away from CAMERAS on every corner.   Avoids eye contact with COPS CANVASSING the neighborhood for him. TV SHOWS in windows feature video of Guy on News Segments and “WANTED” Posters litter the town.   “Reward $100”.  EXT. ALLEY - DAY  He peeks around into the alley where the players usually come out. ",
      "dialogue_count": 0,
      "word_count": 1895
    },
    {
      "scene_number": 13,
      "slugline": "INT. CONFERENCE ROOM, SOONAMI - DAY  DING!   Punit gets a TEXT on his phone.   Checks it out, covertly.   It’s the text from “MOLOTOVGIRL4482”. He pumps his fist, excited.   Types back. BIGBURRITO: Yo, girl. Take me up on dinner and I’ll tell you. MOLOTOVGIRL4482: Is it a hack? Punit grimaces.   Annoyed. BIGBURRITO:   Yours truly is on top of it. Just you watch.  INT. MULTIPLAYER LOUNGE - DAY  Millie gets another text in the chain from Punit. BIGBURRITO: Now about that dinner... She shuts the computer off and thinks.   Recalls what Guy said to her in the parking garage. MILLIE (to herself) The game inside the game. She looks at images of Guy.   One of them has him wearing his BASEBALL HAT.   It hits her.   She knows where to find him!  EXT. BASEBALL FIELD, PARK - NIGHT  Millie walks into the park late at night.   The baseball diamond is empty. She stands at the chain link fence where she first watched Guy playing softball. GUY (O.S.) Psst. She whips around and GUY APPEARS OUT OF THE SHADOWS. GUY (CONT’D) (re: the baseball field) I can’t believe you knew what I was talking about. MILLIE I stopped here a few times. Watching that game.  71.  (MORE)",
      "characters": [],
      "action_text": "I remember thinking how sad it seemed.   These virtual people stuck playing a baseball game in, like, this infinite time loop. GUY Funny.   I thought the same thing. MILLIE It’s even weirder that you’re a  player   hacking a background character, playing a baseball game in an infinite time loop. GUY We all have our idiosyncracies.  EXT. PLAYGROUND - LATER  Guy and Millie sit on swings in an empty playground.   Guy looks around, nervous.   Up in the sky. GUY I’m glad you came.   Things have gotten a little out of hand. MILLIE I’ve been playing for a while now but --   I haven’t seen anything like this.   You really put them through the ringer. GUY I was just trying to get the creators’ attention. MILLIE Well, it worked.   Antwan’s gotta be freaking out of his mind right now. GUY Antwan.   You mentioned him earlier. MILLIE Antwan Hovachelik.   He’s the misogynistic pig that designed this stupid game. Thinks he’s God’s gift to programmers but all he did was create another way to get people to endlessly empty their wallets. People who couldn’t handle the smallest semblance of confrontation in the real world.   Like him.  72.  MILLIE (CONT'D) GUY Sounds like you know him. MILLIE Well, we were sorta   together   for a long time.   I basically supported him while he worked on the game and the second he got funded, he split. Dumped me on my ass and started dating a Victoria’s Secret model. Would only talk to me through lawyers. GUY That sucks.   But then -- why come here?   And spend money on the game that your ex boyfriend created? She considers if she should tell him. MILLIE Because I wanted to find a way to take the game down.   To hurt him where it counts.   To make him realize how much he hurt me.   I guess that sounds really lame. GUY Not at all. She looks at Guy, not sure what to make of him. MILLIE But the bigger question is why are  you   doing it? GUY I’m trying to stop the sequel.   I want to keep Free City like it is. With a few modifications. MILLIE Well, this ",
      "dialogue_count": 0,
      "word_count": 1191
    },
    {
      "scene_number": 14,
      "slugline": "EXT. AQUEDUCT - NIGHT  A PEDESTRIAN NPC wearing the sunglasses makes his way through the brambles to the piece of plywood.   “FREE GUY” is spray- painted on it. PLAYER’S POV: Shows he’s arrived at the RED MISSION PIN on the map.   The NPC KNOCKS and Millie slides it open. MILLIE Come on in.  EXT. BETAVILLE - NIGHT  Betaville is now filled with CITIZENS OF FREE CITY all wearing the sunglasses.   Hundreds of them crowded into the primitive space of the Beta Version. The citizens react to it, unable to believe that it’s real.  AT THE ENTRANCE  Guy waits as Millie lets the last NPC through. GUY Maybe this was a bad idea.   Maybe this backfires and makes things worse. MILLIE Remember what you said to me at the garage.   About making a difference. Well, here’s your chance.  MAKESHIFT STAGE  Guy climbs up on a dumpster, trying to build his nerve.   The crowd is restless, confused. GUY Hello.   Um.   Excuse me.   Um -- MAC (to the crowd) Shaddup!   Let the guy speak! The crowd silences.   All eyes are now on Guy. GUY Hey, everybody.   Thanks for coming. My name’s Guy.  77.  (MORE)",
      "characters": [],
      "action_text": "I imagine if you’re here, you’re probably starting to figure out what’s going on...   Free City is anything but free.   We’re the supporting cast of colorful characters there to be used, abused or totally ignored by people we will never really know.   Or see face to face.   People who have something we’ve never had -- the ability to make their own decisions.   To enrich their lives. To have a say in how to run their own communities. BANK MANAGER Maybe you’re a part of it! TOUGH GUY There’s a hundred dollar bounty on your head! CHUBBY DUDE Tell us why we shouldn’t turn you in! GUY There’s a bounty on my head?  BEHIND THE CROWD  Millie stands with ANONAMOU$E - the hacker from earlier. ANONAMOU$E Strangest hack ever. MILLIE Shut up.   He’s trying to activate their dormant line of code. ANONAMOU$E Yeah, well -- it’s not working. People are getting restless.   It’s going poorly.  MAKESHIFT STAGE  Guy is losing them. GUY Look.   If you just let me explain.  78.  GUY (CONT'D) People crowd the stage.   Reach for his legs.   Guy is about to bail when he sees something at the back of the crowd: BUDDY. He enters Betaville, sheepish.   Nervous.   Guy sees his friend and suddenly all of his anxiety melts away. GUY (CONT’D) I’ve lived in Free City for as long as I can remember.   We’ve had to put up with a lot of screwed up stuff living here but this is our home.   And if we don’t do something about it, it’ll all be gone. Everything you know and love will cease to exist to make room for this -- He shows them A POSTER FOR FREE CITY 2. GUY (CONT’D) Well, I for one refuse to just sit back and let that happen.   Freedom doesn’t come free.   It’s something you have to earn. The crowd responds, positive.   Millie watches, impressed. GUY (CONT’D) Now, I know that everything inside of you is telling you to put your head down and not ask questions. To not rock the boat.   But it’s time for us to step out of the fringes and become the heroes of our own stories.   If we want to take our cit",
      "dialogue_count": 0,
      "word_count": 587
    },
    {
      "scene_number": 15,
      "slugline": "EXT. CONVENIENCE STORE - DAY  A THUG IN GLASSES strolls into a store with a GUN. THUG Gimme all the money in the register. He grabs the cash and turns around only to see: EVERYONE IN THE STORE STARING AT HIM.   Eerie. THUG (CONT’D) Huh?   Is this some kind of a -- He sidesteps outside, creeped out.  EXT. CITY STREET - DAY  People are still staring at him.   The tension builds until -- THUG Look, you’re not supposed to -- PEDESTRIAN Get him! They descend on the thug all at once.  INT. ALLEY - DAY  A PLAYER’S POV:   As they exit into an alley.   They find themselves faced by a group of WOMEN WITH BLOWTORCHES. They engulf the player in flames.  INT. FREE CITY BANK - DAY  The quiet bank is interrupted by a BANK ROBBER who charges in with a duffle bag and a shotgun. BANK ROBBER Alright!   Everybody down on the ground.   The bank’s insured so -- BLAM!   The SECURITY GUARD shoots him.   Everyone reacts, stunned, until the old guard blows the smoke on his barrel. Everyone in the bank CHEERS.  80.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 185
    },
    {
      "scene_number": 16,
      "slugline": "EXT. FREE CITY SQUARE - MONTAGE  Everywhere you look, the citizens of Free City fight back against the players.  EXT. SOONAMI HEADQUARTERS - DAY  The Soonami offices seems quiet compared to the chaos happening on the streets of Free City until -- -- A SKY BLUE BUGATTI pulls up in front.   The suicide door flips open and someone walks out.   All we can see is their WHITE SNEAKERS.  INT. SOONAMI HEADQUARTERS - DAY  Programmers scramble to fix the game. WE FOLLOW THE SNEAKERS down the hall and everyone stops in their tracks at the sight of the wearer. SOONAMI EMPLOYEE Antwan./ It’s Antwan./ Hey Antwan!  INT. CONFERENCE ROOM, SOONAMI - DAY  Punit and Gareth work furiously. PUNIT Take down all the blocks between Fourth and Main.   I’ll cover the Hill Section and -- They freeze as the sneakers enter the room. PAN UP TO REVEAL: A scrawny guy in his mid twenties.   Not what you were expecting the big boss and CEO of Soonami to look like. Backwards baseball cap.   This is   ANTWAN   and he looks pissed. PUNIT (CONT’D) Antwan. GARETH Hey, buddy.   You know, you didn’t have to come in.   We almost have things under control. The monitors behind Gareth tell a different tale.   Fires, angry mobs, it’s a city wide riot.  81.",
      "characters": [],
      "action_text": "ANTWAN Don’t look that way to me. Antwan stands over Punit who realizes that he wants him to move.   Punit scurries away and Antwan sits down at his laptop.   Gets right into it. ANTWAN (CONT’D) Have you done a hard scan of the batch files? PUNIT Yep and we’re redirecting dataflow through our security team. ANTWAN Did you reboot the system? They react, surprised he would even suggest it. PUNIT Well, no.   We were trying to follow protocol and avoid a shutdown. Antwan points to the chaos on the screens. ANTWAN You think this is preferable to a shutdown?   If Free City is in chaos, we can’t release the sequel. Users stop spending their money. We stand to lose everything!  EXT. ROOFTOP - DAY  Guy and Millie watch the revolution from a rooftop. GUY It’s kinda beautiful. MILLIE You did it.   Now they have to take us seriously. GUY And this is only the beginning.   I got a present for you. Guy pulls out A PIECE OF PAPER and hands it to her.   She sees that it has a PARKING SPACE NUMBER scrawled on it.  82. GUY (CONT’D) That parking space holds the car that was on that shipping container.   The briefcase you’ve been looking for is in the trunk. MILLIE How did you find this? GUY NPC’s are the eyes and ears of this place.   I just had to ask a few background peeps and voila... MILLIE I can’t believe it. GUY Now you can use whatever it is to get Antwan’s attention yourself. She considers this.   It’s what she’s wanted for so long, but now she has mixed feelings. MILLIE You know.   It’s funny.   I’ve spent more time in Free City this past year than I have in my own life. GUY Sometimes I feel like I live here. MILLIE It’s just I feel like I’m more myself here than anywhere else. GUY That’s good. Cause I like this you. KABOOM! Another building in the background goes up in flames. MILLIE Whatever happens.   Maybe we should meet up. Y’know.   Outside   Free City. (vulnerable) That is, if you’d share your deets with a complete stranger you only know through a video game. She looks ",
      "dialogue_count": 0,
      "word_count": 1445
    },
    {
      "scene_number": 17,
      "slugline": "EXT. SAN FRANCISCO - DAY  A gorgeous view of the bay.   Golden Gate Bridge in the background.   Very obliviously   not   Free City. Punit strides down California Street with a spring in his step.   Looks around and finds what he’s looking for: A busy internet cafe.  INT. “CYBER COFFEE” - DAY  Punit walks through the coffee house where HIPSTERS work on their laptops.   He’s looking for someone.   Thinks he spots them, sitting alone.   Punit slowly approaches the table. PUNIT Um.   Hey.   MolotovGirl? It’s Millie.   As mousy and insecure as ever. MILLIE Thanks for meeting me here. PUNIT Are you kidding?   I’ve been wanting to --   I mean, it’s great to finally see you in person. She sits there quiet, awkward. PUNIT (CONT’D) I gotta say, you look nothing like - MILLIE My avatar? He course corrects. PUNIT Nothing like I was   expecting .   But I bet you get that a lot. She hides behind her hair.   Clutches her shirt. MILLIE Actually.   You’re the first person from the game that I’ve met -- face to face.   Sorta.  89.",
      "characters": [],
      "action_text": "PUNIT Wow.   It’s an honor or --   Cool. So.   What are you --   Can I get you a --   You already have one.   But -- She saves him from his awkward spiral. MILLIE So, what happened yesterday? PUNIT I know, right?   Bonkers.   Things were outta control but I finally had to make the tough call. (showing off) Rebooted the system.   Now everything’s humming again. Shouldn’t have any more problems before -- well, I have a gift for you actually. He reaches into his bag and gives her A GAME BOX: “FREE CITY 2.” PUNIT (CONT’D) You won’t be able to use it for two more days when we shift our servers over to the new game. She stares at it, concerned. MILLIE Thanks.   But the person who was causing all the problems.   The hacker.   You wouldn’t happen to have some sort of info on who it was?   An IP address or -- Punit visibly sags, realizing the real agenda here. PUNIT Oh.   Yeah.   Well, that’s kind of complicated.   I could get in a lot of trouble if I gave any user information. She’s desperate.   Touches his hand, pleading. MILLIE Please.   It’s important. Punit’s a sucker for personal contact.  90. PUNIT Well, between you and me.   It -- It wasn’t a person. Millie reacts.   Confused. PUNIT (CONT’D) It was an NPC.   A little background detail for the game that just -- sorta went haywire.   He’s a glitch. A mistake.   That’s been   corrected . MILLIE Nuh-uh. PUNIT Nuh-huh.   That’s what Antwan gets for cheaping out on Q.C.. Mille goes pale.   She can’t believe it.   But now so many things make sense. MILLIE So does that mean Guy is stuck in the game forever? PUNIT Who the hell is Guy? She stares out into space.   Punit tries to break the silence. PUNIT (CONT’D) Um.   I’m gonna get a coffee.   Let me buy you something.   Like a muffin or -- She’s in her own world.   Barely shakes her head. He gets up.   Goes to the counter.   Turns back to ask her something and -- -- MILLIE IS GONE.  INT. STREET CORNER - DAY  Guy walks down the street and suddenly notices something: THE EMPTY ",
      "dialogue_count": 0,
      "word_count": 2328
    },
    {
      "scene_number": 18,
      "slugline": "INT. ANTWAN’S OFFICE - CONTINUOUS  Antwan realizes what he’s doing. ANTWAN He can’t know that.   There’s no way he can know that. PUNIT It’s the cheat code.  EXT. PARKING LOT - CONTINUOUS  Guy pushes buttons on the briefcase in the exact sequence of the routine that he has dialed into memory. GUY Left, right, left, right, up, up, down, down, punch, punch, kick. And with that -- BAWWWWWWWWWWONGGGGG!   Reality freezes. Guy is instantly healed.   Immaculate.   Glowing.   The sunglasses are gone. Reborn, he rises up out of the ashes of the wreckage and floats ten feet off the ground. A CROWD OF NPCS watches him in awe. Mac is among them, still clean cut -- but he gets a wild gleam in his eye. MAC Hey.   I know that guy... Guy motions his hand at the next wave of cops and they all go flying away like rag dolls. He swipes his hand gently across his field of vision, and all the destruction reverts back to normal.   Charred cars return to their original state.   The fountain is repaired. Next Guy looks to the sky and SNAPS HIS FINGERS.  INT. ANTWAN’S OFFICE - DAY  ALL ELECTRICITY at Soonami Headquarters shuts down. Antwan struggles in vain to turn on his computer.  101.",
      "characters": [],
      "action_text": "ANTWAN This can’t happen.   I’m locked out. KABOOM!   His computer explodes.   He runs over to another and BLAP!   The screen cracks and smoke pours from its drive. Punit watches amazed. PUNIT Shit just got real. GUY (O.S.) Antwan.   Over here. Antwan looks around, stunned. A SINGLE MONITOR BLINKS ON.   Guy is on the screen, looking back -- as if he can see him. GUY (CONT’D) Let’s talk. ANTWAN No.   This isn’t -- You’re not real. GUY I know exactly how you feel.   We have a lot in common actually. Antwan notices one other light on down the hall... THE LIGHTS ON THE SERVERS are blinking like crazy.   Working overtime.   Antwan gets an idea. ANTWAN You wanna talk?   Let’s talk. He charges out of the office and his cronies follow.  EXT. SOONAMI HEADQUARTERS, REAL WORLD - DAY  Millie pulls up in her Honda at the Soonami HQ Main Gate. The Guard stops her. GUARD Sorry, ma’am.   Systems dead. Nobody gets in or out. MILLIE Please.   It’s important. GUARD No can do.   Now, just back--  102. DING!   THE GATE RAISES and Millie punches through.   The Guard reacts, amazed.   Runs after her and -- the gate slams down in his face.   Guy is helping her out on the other side.  INT. SOONAMI HEADQUARTERS - DAY  The offices are dark, but MONITORS BLINK ON with the same image of Guy as Antwan passes each one. GUY What are you afraid of, Antwan?   It doesn’t have to be like this. Antwan yells at the screens. ANTWAN You can’t tell me how it is.   I made you.  INT. SERVER WAREHOUSE - DAY  Antwan runs into the warehouse with racks of servers.   The programmers close behind. Antwan finds what he’s looking for: A PLUG that powers the first rack of servers.   Punit and Gareth realize what he’s doing and tries to hold him back. PUNIT Antwan.   Let’s just stop for a moment and take a few deep breaths-- GARETH You’re gonna delete the whole game if you do this.   Permanently. ANTWAN It’s my game.   I can do anything I want with it. Antwan pulls out a pocketknife, cuts a server cord and --  INT. FR",
      "dialogue_count": 0,
      "word_count": 1740
    }
  ]
}