{
  "slug": "fresh-2022",
  "title": "fresh",
  "genre": "drama",
  "format": "film",
  "scenes_count": 7,
  "characters_count": 0,
  "characters": [],
  "total_words": 24655,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. CAR - EVENING NOA, (late 20’s/early 30’s) sits in her parked car in front of a small strip mall. It’s the kind of strip mall that looks a little gross but has some cool hipster restaurant in it. Noa is cute with curves. A real woman’s body none of this Instagram model bullshit. She’s dressed in a t-shirt and jeans but wears it well. She’s perfected the “natural” look that definitely takes a lot of makeup. Her car is cluttered but clean. A few empty water bottles and bags of things litter the passenger seat and floor. She takes a deep breath and stares for a moment at a few people standing outside a restaurant chatting and smoking cigarettes. She picks up a La Croix out of her drink holder and looks at it. She takes a sip immediately disgusted. Warm and flat. She opens her door and spits it out. She pulls down the car mirror and inspects her face. She takes a tweezer and leans in close to the mirror plucking out an eyebrow hair or two, maybe a chin hair. She grabs a lip balm and puts it on as we hear the sound of a text message coming in. She picks up her phone to look. TEXT: Chad: “Fyi, this place is cash only.” She audibly scoffs and picks up her phone quickly typing. We see her send a text. NOA: This dude just texted me “Fyi, this place is cash only.” After a split second the thought bubble appears. MOLLIE: Fuuuuuuuck that. Just leave. NOA: I’m already here. Hopefully it will make for a good story. MOLLIE: That’s why I do most things. She smiles and puts her phone away. She gets out of the car as we watch her walk away from us to the entrance. INT. TRENDY DIVEY THAI PLACE- A LITTLE WHILE LATER. We’re close on Noa’s face. She nods and smiles, pretending to be interested but is clearly zoned out.",
      "characters": [],
      "action_text": "We don’t hear what’s being said for a moment it just sounds like muffled Charlie Brown characters. Finally we hear the scene around her come into focus. CHAD .... Even though it gives me terrible acid reflux. We now see who Noa is sitting across from. Her date Chad is cute but wears a t-shirt and scarf around his neck. Noa takes a small bite of her dish. NOA (chewing) Oh. Yeah. That sucks. CHAD But I don’t care cause I love it. NOA Yeah I guess for me it just depends on the spice. I love Wasabi but Thai spices, forget it. A waitress stops by. WAITRESS You guys good? NOA Yeah thanks. I’m pretty much done. CHAD Cool. We’ll wrap all this up. Noa looks down. There isn’t much left of their larger shared plates. The waitress walks away. Chad takes out his wallet. CHAD (CONT’D) You bring cash? NOA Yup. You reminded me. The waitress stops by and drops to-go containers. Chad starts dumping the meal in. CHAD My brother’s coming to town so if it’s cool I was gonna snag the leftovers and then you can just leave a couple bucks less on the tip, make sense?  2. Noa stares at him a beat. What a gentleman. NOA Your scarf is dipping into the Pad See Ew. Chad looks down. It is. CHAD Oh shit I love this scarf. He pulls it out and starts wiping it off with a wet napkin. CUT TO: EXT. RESTAURANT- FEW MOMENTS LATER We watch through the glass window from inside the restaurant looking out as Noa and her date say goodbye. It’s obvious from Noa’s body language that she’s done but her date Chad is clearly not picking up on it. CHAD This was awesome. You’re really cute. NOA (polite disinterest) Thank you. CHAD (flirty) We should do this again. Normally Noa would just fake it and smile and say “totally” and then ghost through text but she seems, fed up. NOA (politely) Yeah, I don’t know if we’re really a match, ya know? Chad seems caught off guard. He scoffs. CHAD Well, whatever. I was just being polite. You’re not even my type. Noa can’t help but laugh. This makes Chad angrier. CHAD (CONT’D) Oh ",
      "dialogue_count": 0,
      "word_count": 8834
    },
    {
      "scene_number": 2,
      "slugline": "INT. STEVE’S KITCHEN - DAY TIME The song blasts as we see the back of Steve wearing an apron at his kitchen island wiggling his butt happily to the music. We hear a buzzing. THIS ENTIRE SCENE PLAYS OUT TO THE SONG. As we face him we see he’s using an electric knife to slice into a LARGE calf. It’s tough but working decently. His apron has two big cookies on it where breasts would be and it says “Check out these cookies.” It’s splattered in blood. He’s slicing the meat off of it and putting it into a bag that’s filled with other meat slices. His gloved hands are slightly bloody. He licks his fingers. He vacuum seals the bag and tosses it into a large box filled with ice packs. He sings GLORIA to the calf. On the kitchen table is a stack of photos. On the top is a photo of a woman in one of those INSTAGRAM museums giving a peace sign and smiling. Next to that is a folded tank top. He momentarily takes off his gloves and goes into a purse sitting in a chair. He pulls out a small perfume and sprays the tank top. He smells the tank top. Perfect. Quick cuts of him filling coolers with dry ice and packaged meats. A few different packages. More quick cuts of other boxes filled with meat and items from women. Photos, clothing, jewelry, makeup. These boxes are wrapped with fancy tissue paper and a bow. After we watch these boxes be filled we cut to them lined up near the front door. Steve opens a flip phone. He dials and talks briefly on the phone but we don’t hear it over the music. CUT TO: EXT. STEVE’S HOUSE - SOMETIME LATER A large dark SUV pulls up. A man comes out and takes all of the packages placing them meticulously in his trunk.  42.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 322
    },
    {
      "scene_number": 3,
      "slugline": "EXT. OPEN ROAD- LATER The SUV drives and drives. Through day and night. CUT TO: EXT. SUBURBAN STREET- AFTERNOON The man pulls up to a gigantic house. A cop car is parked in the driveway. We watch the man bring the package to the door. An older white man answers the door and takes it, shaking hands with the driver. He quickly leaves. CUT TO: EXT. MEGA CHURCH - NIGHT TIME The SUV pulls up. The driver goes to the back office of a mega church. A black man answers in a brightly colored suit. You get the feeling he’s the preacher at this mega church. He takes the package and brings the driver into an awkward hug. CUT TO: EXT. OPEN ROADS - EARLY MORNING The SUV continues to drive. EXT. SUBURBAN STREET- DAY TIME The SUV pulls up to another massive gaudy mega-house. In the front yard is a political sign to vote GREG SMITH for City Controller with a man’s smiling face giving a thumbs up in one corner. The driver spots this and rolls his eyes. The door opens and it’s the guy on the sign. He takes the package and gives the driver a condescending pat on the arm as he walks off and back to the car. As the door shuts the song abruptly ends and the scene cuts out. INT. STEVE’S KITCHEN - EVENING Steve is at his kitchen sink scrubbing his hands aggressively with soap.  43.",
      "characters": [],
      "action_text": "Suddenly a very low voice is heard. More sounds. The voice comes into focus more. NOA (O.S.) STEVEEEEEE!!! STEVE!!!! He exhales slightly annoyed and cleans up a bit. He picks up a wrapped up calf and walks down a hall to a nearby door and opens it. It’s a walk in freezer. Different body parts sit on shelves. A leg, a torso, breasts. He puts the calf in it. As he walks out and shuts the door he hears Noa again. NOA (O.S.) (CONT’D) STEVE!!!!! PLEASE!!!! CUT TO: INT. NOA'S NEW DIGS Noa sits in front of a half eaten plate of food. Pasta with cream sauce, a large piece of cake with frosting, french fries. A small vase with flowers. She taps it against the table. It’s plastic. She looks different. A little angrier. She hears the footsteps and softens her face. The door unlocks. STEVE Hi sugar. Did you like your meal? She nods emotionless. STEVE (CONT’D) Good. NOA Do you think I can shower upstairs now? I smell. He stares at her a beat. STEVE Well that’s no good. Are you gonna be a good girl? She nods. Click, her eyes go to his shirt. Tiny blood stains. Click, down his shoes, same thing.  44. STEVE (CONT’D) (flirty) Are you gonna need help in the shower? She stares at him, blinking, is he fucking serious? She’s careful with her answer. NOA (emotionless) No. I don’t think so. STEVE I wish you’d loosen up a little. If you could relax it’d make everything easier. For you too, I promise. Come on, gimme a smile. She stares at him blankly then gives him a smile only with her mouth not with her eyes. STEVE (CONT’D) There she is. He takes out handcuffs and implores her to stand up. STEVE (CONT’D) Put your hands out in front of you. He walks up and handcuffs her hands together. They walk out of the room. CUT TO: TOP OF THE STAIRS - CONTINUOUS He walks out of the stairwell closing the door behind him and locking it. The sound of her heartbeat. Getting faster. She can hear it so loudly in her ears. She tries to control her breathing. We hear it slow a bit. He holds her arm as they wa",
      "dialogue_count": 0,
      "word_count": 5099
    },
    {
      "scene_number": 4,
      "slugline": "INT. STEVE’S OTHER HOUSE - SAME TIME Ann is standing in her son’s bedroom doorway next to the light switch. The light is dim and he’s tucked into bed. On his night table is an owl night light projecting stars onto the ceiling. ANN Ok honey, tell me when. SON Will Dad be back soon? ANN Later on after you’re asleep. But I’ll make sure he comes and gives you a kiss. SON Ok. Can you leave the door open a little? ANN Of course. SON Ok. I’m ready. Ann clicks off the light. ANN Sweet dreams jelly bean. SON Love you. ANN Love you. She closes the door leaving it open a crack and walks down the hall. She passes another door that’s cracked open and peeks in. She sees her daughter sleeping peacefully and shuts the door all the way. We follow her into her bedroom and into the master bath. She stares into the mirror a moment, taking her face in. Her eyes now look cold and empty. She looks closely inspecting every inch of her face and every tiny wrinkle. She pulls her skin back imagining what she’d look like with a face lift.  64.",
      "characters": [],
      "action_text": "After a moment she starts taking off her jewelry and putting it in a small dish on the counter next to the sink. Her gigantic diamond earrings, her diamond necklace, her rings. She starts the shower. It gets hot quickly as steam begins to rise. She takes off her shirt. She unbuttons her pants and starts to pulls them off. As she pulls them down just a bit we see past her hip on the right side she has an entire prosthetic leg from her groin down. She rubs her hand on the smooth surface of the leg a moment. From the back we see her unhook her bra and pull off her underwear. After everything is off she unscrews the leg and hops over to the shower. Now without the jewelry and sleek outfit and hair back she’s just a vulnerable woman missing a leg. There’s a large ledge type seat in the shower and she expertly holds on the towel bar and shimmies herself in. INT. NOA'S ROOM - SAME TIME Noa is practicing walking around the room. She’s gotten much better. She tries to do some lunges. It looks painful. There’s a knock at her door. She flinches as the little window in the door is opened. Steve’s eyes appear as Noa gives him an innocent smile. STEVE Whatcha doin? NOA Not much! STEVE I have a surprise for you. Noa tries not to react. Steve opens the door and is holding pants and a shirt folded. STEVE (CONT’D) I got some of your clothes from your suitcase. Thought you might want to change. Steve walks in with them and puts them on her cot. NOA Thank you. I appreciate it.  65. STEVE So, I keep thinking about what you told me. About your, curiosity. NOA (embarrassed) Yeah. Sorry. Honestly forget I said anything. I want that part of my brain to disappear. STEVE Don’t be sorry. That’s how it started for me. I knew you were special Noa. I wanted to see if you’d like to have dinner with me tomorrow night. Learn a bit more about this life. You’ll need to be handcuffed though. NOA I understand. I’d, love to. STEVE And maybe we can work on regaining some trust. NOA (innocently) I’d like t",
      "dialogue_count": 0,
      "word_count": 7148
    },
    {
      "scene_number": 5,
      "slugline": "INT. STEVE’S BEDROOM. Steve has wiped most of the toothpaste out of his eyes now. His eyes are red and he still winces in pain as he runs toward the door. He can’t open it. He pushes and runs into it. From the outside we see the chair moving a bit. If he runs and pushes hard enough it may eventually break the wooden chair. INT. BASEMENT - SAME TIME Mollie and Noa are now together. Noa gives her Steve’s shoes so she’s not barefoot. She fumbles with the keys to Penny’s room. She finally opens it and runs over to Penny quickly leaning down. INT. BASEMENT HALLWAY - CONTINUOUS Noa and Mollie run out of Penny’s room. Penny is now seated on a blanket as they drag her down the hallway and she holds on with her hand. NOA Melissa’s gone. We’re the only ones left. PENNY Let’s murder this fucking guy! UP THE STAIRS FROM THE BASEMENT They swing open the door right as Steve starts rushing the stairs from the hallway. A broken chair behind him near the bedroom door. They run into the kitchen. STEVE You worthless fucking cunts! Mollie and Noa rush him as they both kick and punch and scratch him as they FIGHT FOR THEIR FUCKING LIVES. Noa grabs a knife out of the wood block and starts stabbing him wherever she can manage. Mollie grabs a pan next to the sink within reach. She beats him over the head with it. Penny punches and scratches at his legs with her one arm.  97.",
      "characters": [],
      "action_text": "There are no clever cut aways just messy bloody in the moment fighting. He grabs the pan away from Mollie and pulls her by the hair and punches her in the face. Noa tries to grab his arm back from punching Mollie and drops the knife to Penny who is sitting on the ground. PENNY My turn you piece of shit! She picks up the knife and starts cutting him in the shins. He leans down screaming and tries to kick her protecting himself. As he does Noa and Mollie start pushing and punching him. NOA Over here! Noa nods her head to the basement door. Noa opens as they get him to the edge and both PUSH. CLUNK CLUNK CLUNK etc. He falls violently down the stairs as they close and lock it. Noa runs down the hallway. MOLLIE What are you doing we gotta get the fuck out of here! Noa gets to a door and after some fumbling unlocks it with the keys. It’s the meat freezer. She comes back dragging a leg wrapped in cellophane that has a label on it “PENNY”. PENNY My leg! They lift Penny back onto the blanket and she holds on. Noa quickly runs over to the small bowl on the table near the door to grab his car keys. FUCK! They aren’t there. She looks all over the table and floor but there isn’t time. NOA Ok ok ok no car keys. New plan! MOLLIE We need to fucking run! NOA WAIT! She runs back into the room with all of the women’s stuff. She messily and quickly swipes and dumps all she can into a bag she finds in a corner leaving only a few things.  98.",
      "dialogue_count": 0,
      "word_count": 550
    },
    {
      "scene_number": 6,
      "slugline": "INT. BASEMENT - SAME TIME Steve bloody and battered at the bottom of the stairs manages to stand up wobbly and bleeding all over from stab wounds but starts crawling back up the stairs as he pulls out his cell phone and starts dialing a number. UPSTAIRS Noa runs out of the room holding the bag and they run toward the back kitchen door dragging Penny behind them. Noa grabs a knife before they leave. It’s a little slower with Penny and her holding the leg but they’re making it work. NOA There’s a house in the distance a few city blocks away through the woods. I’ve seen the lights out the window. They get out the back door but have to lift her up and take her down the stairs first. Once they’re down the stairs they put her back on the blanket and start running as fast as they can muster. INT. BASEMENT STAIRS- TOP -SAME TIME Steve has made it to the top of the stairs and fumbles with his own keys. EXT. STEVE’S HOUSE - BACKYARD - NIGHT Noa and Mollie are dragging Penny in eerie silence except for their heavy breathing and the sound of crunching leaves beneath their feet. The yard stretches back littered with lots of trees. The girls breathe heavily and try to keep up speed seeing the lights of a house in the distance but they’re exhausted from fighting and weak from all of it. Noa turns to Mollie. PENNY Why is your mouth so bloody? NOA I chomped into his dick. MOLLIE How did you even-  99.",
      "characters": [],
      "action_text": "PENNY That’s fuckin dope. Noa chuckles a bit. She looks at Mollie who looks like a shell of herself. NOA I ate your tit. I’m sorry. Penny lets out a laugh. Mollie turns to her. She’s hard to read. MOLLIE You did what you had to. Was it good at least? NOA Fuck no. PENNY Hate to break up this touching moment but we should really move faster. Sorry I’m a gimp. They try to speed up. Suddenly the sound of the Steve’s back door in the distance. He comes out limping and bleeding with a gun. He spots them in the distance. PENNY (CONT’D) This fucking guy! STEVE You vile little chunks of flesh! With pure adrenaline he begins to speed up and starts shooting. NOA Fuck! They try to duck and move and get out of the way. MOLLIE Split up! We gotta zig zag and shit I saw it on Dateline! PENNY What about me?!  100. We see Steve watching as they disperse and move in different directions as he runs closer. Mollie drags Penny and Noa goes a different way. He keeps shooting and holds a big ass knife in his other hand. He squints trying to see but between the trees and the darkness they’ve disappeared. He runs closer but slows down as it becomes eerily silent. The leaves crunch under his feet. He stops and looks around waiting for something. A movement, a sound, anything. STEVE (calling out) I’m sad Noa! I guess we won’t be going to Joshua Tree after all! He keeps looking around as he walks. STEVE (CONT’D) (calling out) Now I’m just gonna have to kill all of you and make it super fucking painful. Behind a tree but it’s hard to tell where Noa sits crunched into a fetal position scared and motionless. She tries to quiet her breathing as best she can. Steve waits. Suddenly, music.... “Thank you for being a friend. Travel down the road and back again. Your heart is true you’re a pal and a confidante...” It echos against the silence of the woods as he chuckles and runs toward it before it stops abruptly. As he gets closer and is about to start shooting he sees the phone still lit up near a tre",
      "dialogue_count": 0,
      "word_count": 1241
    },
    {
      "scene_number": 7,
      "slugline": "EXT. STEVE’S HOUSE- CONTINUOUS The two of them walk into the backyard shining the flashlight. They walk for a few moments in silence shining it everywhere until a heap catches their eye. They approach it. It’s Steve’s badly beaten and shot dead body. Ann stares and then bends down next to him. Her lip quivers. She gets choked up but tries to stay strong. ANN We need to clean the house immediately of anything connecting us. MAN Yes M’ayam. He watch as Anne holds his hand and silently cries for a moment. It’s brief. She pushes down all the emotion. ANN (composed again) Ok. We’ll get his body on ice before the meat goes bad. The man tries to hide is shock. ANN (CONT’D) He’d want to be eaten. She stands up. Suddenly something catches her eye. A light in the woods a bit of a distance going back and forth. She watches a beat. ANN (CONT’D) (to herself) This bitch. (to the guy) Stay here. Ann walks away into the woods. The guy is left alone with Steve’s body. He looks down at it. Gulp. He takes out a cigarette. We see his hand shake with the lighter and he lights it. He’s not as strong as he’s pretending to be. The whole situation is getting to him. DEEPER IN THE WOODS Our trio of girls walk in silence exhausted. Noa’s iPhone flashlight shines back and forth in front of them. They’re closer to the lights now and run full speed (as best they can) toward it.  104.",
      "characters": [],
      "action_text": "As they get right up to it they are hit with the shittiest of realizations. It’s a medium sized greenhouse. They try to open the door. It’s locked. Noa jiggles the handle helplessly. NOA Hello! Hello! HELP! PLEASE! They peer inside. Tons of Cannabis plants are growing. A shovel and small ladder sit next to the door which has a little light overhead. Lights are on inside shining on the plants. NOA (CONT’D) This is just torture right now. All this weed and no one to smoke it. PENNY Coming from someone who was just tortured I agree. It smells good as hell. MOLLIE Let’s call 911. Mollie takes out her phone to dial. Noa lifts her phone and tries as well. MOLLIE (CONT’D) Fuck! Mine doesn’t have service. Noa tries to call 911 on her phone. The service isn’t strong enough. NOA Damn it! It’s not going through. She tries again. Nothing. She hands Mollie the bag of the women’s stuff and grabs her phone. NOA (CONT’D) (to Penny and Mollie) Ok turn these phones on. See if any have service or battery and try to call 911. I’m gonna walk back into the woods a little ways where we called my phone. I’ll be right back. She grabs Mollie’s phone from her. MOLLIE Ok. Come right the fuck back. Keep your flashlight on.  105. NOA (obviously sarcastic) No I’m gonna turn it off for fun. Noa turns it on and shines it in front of her as she walks away. Mollie and Penny reach into the bag and start trying to turn on phones. Noa walks deeper into the woods. It’s eerily silent except for the crunching of leaves under her feet. She holds up a phone as she walks and shines the light from the other. NOA (CONT’D) Come on. She switches phones. We see the bars almost non existent. EXT. STEVE’S HOUSE - BACKYARD The man is still standing there smoking a cigarette along in the eerie darkness. He hears something and jumps a bit. Then he looks down at Steve’s body again. He lightly kicks at him with his foot, maybe making sure he’s dead, maybe trying to believe this is all real. INT. WOODS- SAME TIME Noa move",
      "dialogue_count": 0,
      "word_count": 1461
    }
  ]
}