{
  "slug": "freuds-last-session-2023",
  "title": "freuds last session",
  "genre": "comedy",
  "format": "film",
  "scenes_count": 6,
  "characters_count": 0,
  "characters": [],
  "total_words": 16330,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT.   FREUD’S GARDEN, ENGLAND - SAME 18   18  Freud steps into his own gardens followed by a curious Lewis. EXT.   GARDENS, VIENNA - SAME 19   19  Freud’s POV, as he passes colleagues and friends. His wife, MARTHA, matronly, claps proudly. DR. ERNEST JONES, 50, British, neurologist and psychoanalyst, applauds from the end of his aisle.   Dr. Jones looks across the aisle, noticing Anna. She senses his gaze, meets his eyes, and then quickly turns back to- DOROTHY BURLINGHAM, 48, seated beside Anna.   She is an American heiress to the Tiffany fortune.   Pretty, with short cropped hair, there is an intimacy apparent between her and Anna, not lost on Freud. MAYOR (O.S.) Es ist mir eine große Ehre... Freud joins the MAYOR on the platform stage in front of the garden’s large fountain flanked by Luminaries. MAYOR (CONT’D) Herrn Dr. Sigmund Freud heuer die Goethemedaille zu verleihen. (It is my honor to present this year’s Goethe Prize to Dr Sigmund Freud.) The Mayor hangs the ribbon holding the GOETHE MEDAL around Freud’s neck.   To Freud’s side is a huge AUSTRIAN FLAG. MAYOR (CONT’D) Herzlichen Glückwunsch, Doktor! (Congratulations Doctor!) MOMENTS LATER Freud makes the rounds, when he is pulled aside by Dr. Jones. DR. ERNEST JONES They’ve never given the Goethe Prize to a Psychoanalyst before. EXT. GARDEN, ENGLAND - SAME 20   20  Lewis watches Freud, concerned. 12.",
      "characters": [],
      "action_text": "FREUD They’ve never had Psychoanalysts in Germany before. LEWIS, confused, notices Freud’s sudden disorientation. He takes the doctor’s arm. LEWIS Dr. Freud? Are you? FREUD What! FREUD is startled. He finds human contact unpleasant.   As if waking from a sleep, still disoriented, staring into space as if he had been watching those people, those memories of Anna, all the while. The OS voices - his memory of the two women - Anna and Dorothy laughing so many years before. Echoes and Distortions. EXT. GARDEN, VIENNA - SAME 21   21  Freud’s POV.   Quick Flash back to Anna, carrying a bouquet. Dorothy watches them, from behind.   Freud sees Dorothy, then stares at his daughter. FREUD Here is my prize... EXT.   GARDEN, ENGLAND - SAME 22   22  FREUD CONT. ....with whom I am always happy. In front of him is the azalea bush. Then suddenly free of hallucination. Back in the present moment. His favorite flower, the azalea!   He notices LEWIS, but manages to cover his brief lapse. FREUD My favorite flower, azalea. Freud reaches into his pocket for a small penknife/flower clippers, and plucks two azaleas from the bush. Much to LEWIS’s surprise, the Doctor presents an azalea to him. Almost a gesture of friendship and respect. He threads the stem into the lapel button hole of LEWIS’ jacket, then attempts to fix the other flower into his own. 13. LEWIS helps him. It could symbolize Freud’s only bond of friendship and trust. Suddenly, he is conscious of this ‘too close’ moment of ‘intimacy,’ and the formidable and rigid mask, sternness returns his face. FREUD (CONT’D) Since we have so little time we should come to the reason I wrote you. He begins to trudge back to the house. Lewis, unsure, follows. LEWIS Of course. My book, “Pilgrim’s Regress.” FREUD It’s a parody, yes?   A parody on “Pilgrim’s Progress”, yes? LEWIS Yes. FREUD A clever idea if anyone still reads Milton. LEWIS I understand that what I’ve written offends you. FREUD Offends me?   Why? LEWIS My satirizing you with the “",
      "dialogue_count": 0,
      "word_count": 5660
    },
    {
      "scene_number": 2,
      "slugline": "EXT.   BACK YARD - NIGHT 62   62  Lewis steps outside, taking in the night, lighting a cigarette.   Janie comes out after him, interrupting. JANIE MOORE You don’t get off that easy.   What does it mean for us? LEWIS I don’t understand. JANIE MOORE This is all terribly convenient for you.   You want me on my knees lighting candles? Embroidering the Ten Commandments on our pillows? Lewis meets her eyes. Things are now different. LEWIS No need, Janie...   We both know them. The words sit in the air.   He stares at her, can see the sadness filling her eyes. It’s a betrayal.   She is shaken. JANIE MOORE You coward. She turns away and rushes back inside.   Lewis is left standing there, reeling.   The sound of a phone ringing. FREUD (O.S.) Yes, right away. Thank you, Anna. INT. FREUD’S STUDY - CONT. 63   63  Freud hangs up the phone, turns on the radio. FREUD Chamberlain! CHAMBERLAIN (O.S.) Up to the very last it would have been possible to have arranged a peaceful and honorable settlement between Germany and Poland, but Hitler would not have it. Lewis grows increasingly aggravated. 42.",
      "characters": [],
      "action_text": "CHAMBERLAIN (O.S.) (CONT’D) His actions show convincingly that there’s no chance of expecting this man will ever give up his practice of using force to gain his will. INT. INSTITUTE - FACULTY LOUNGE - SAME 64   64  Anna listens along with staff and students, who crowd the room to hear the news. CHAMBERLAIN (V.O. CONT.) He can only be stopped by force. Now may God bless you all. May He defend the right. Dorothy enters and finds Anna.   She goes over to her, can see her concern. Anna whispers in her ear. ANNA The talks broke down. DOROTHY God help us. As Chamberlain concludes, Anna tightly grips Dorothy’s hand. CHAMBERLAIN (V.O., CONT.) It is the evil things that we shall be fighting against – brute force, bad faith, injustice, oppression and persecution. Dorothy glances at Anna. Chamberlain could be talking about the two of them. CHAMBERLAIN (V.O.) And against them I am certain that the right will prevail. The broadcast ends.   Anna glances at Dorothy, they walk out. INT.   HALLWAY – CONT. 65   65  Chaos in the hallway as STUDENTS argue about England’s entry into war.   ANNA and DOROTHY move through them. DOROTHY Are you alright? 43. ANNA I wanted to believe we’d be safe when we left Vienna. DOROTHY We don’t know how Hitler will respond. ANNA I do. I’ve seen the kind of men he created. They won’t stop until they get everything they want. (beat) They didn’t with me. Dorothy knows what she’s referring to, doesn’t argue. INT. FREUD’S STUDY – CONT. 66   66  Freud listens, grim.   Lewis is shaken. BBC ANNOUNCER (V.O.) You have been listening to a broadcast from 10 Downing Street- Freud turns his radio off in disgust, walking away from it, stopping at the doors to the garden. FREUD So it begins. Freud is distressed, but Lewis appears even more so. LEWIS Again. FREUD The First War taught me nothing. I underestimated Hitler. LEWIS Everyone did. It’s hard to believe such a hideous man exists. FREUD I’ve found little that is good about human beings. In my experience, mankind i",
      "dialogue_count": 0,
      "word_count": 1487
    },
    {
      "scene_number": 3,
      "slugline": "INT. FREUD FAMIY HOME - LATER 71   71  Freud’s father, Jacob, reads from Deuteronomy. JACOB (in Hebrew) For you are crossing the Jordan, to come to possess the land which the Lord, your God, is giving you. And you shall keep to perform all the statutes and ordinances that I am setting before you, today. Jacob kisses the prayer book, then looks up to see Freud making the sign of the cross.   He can’t believe his eyes. JACOB (CONT’D) (shocked) Was war das? (What was that?) EXT. FREUD FAMILY HOME – MOMENTS LATER 72   72  The front door opens and Jacob Freud is putting Ilsa out on the street.   Jacob is furious, she equally so. Jacob roughly hands Ilsa her suitcase. Ilsa sees Young Freud standing behind his Father. This stops both their tirades.   She leans down to him. ILSA You must pray for your Father so he can go to heaven. JACOB There is no heaven! ILSA Not for you there isn’t! JACOB GO! NOW! She turns, leaving them.   Jacob grabs his son by his arm. JACOB (CONT.) (CONT’D) DO NOT PRAY FOR ME! EVER!   SIGMUND! DO YOU HEAR ME? Freud doesn’t answer, devastated, as he watches his nanny walk out of his life. 50.",
      "characters": [],
      "action_text": "INT. FREUD’S STUDY – CONT. 73   73  Freud paces the room. FREUD Battling Bibles. Love our neighbors as ourselves? You heard the radio, it’s a simple minded impossibility. LEWIS I disagree- FREUD Of course you do! Your faith collapses otherwise! Freud grows more and more irate. He takes out his handkerchief, sometimes raising it to wipe his lips. FREUD (CONT.) (CONT’D) Turn the other cheek? Should Poland turn the other cheek to Hitler? Should they love their neighbors as German tanks crush their homes? His speech becomes slurred, his pain obvious. FREUD (CONT.) (CONT’D) Do you think it coincidence that Jesus demands his followers must be like children to enter Heaven? It’s because man has never matured enough to face that he is alone in the universe and religion makes the world his nursery! I have two words for you, GROW UP! Freud begins to cough into his handkerchief, turning away. Lewis rises and goes to him. Freud raises his hand to keep Lewis away.   He turns, wiping his mouth.   There is a spot of blood on his handkerchief. FREUD (CONT’D) Oral surgery. Then, badly fitting dentures. I worry constantly I will sneeze my teeth out. I need my medicine- LEWIS Sit. Lewis pulls a chair to him. 51. FREUD They never fit properly. Anna calls it “The Monster.” I must clean it and call her to readjust it. LEWIS When will your wife be home? FREUD No one but Anna touches it. LEWIS Not even your doctors? FREUD Especially not my doctors! INT. VIENNA HOSPITAL – FLASHBACK - THREE YEARS PREVIOUS 74   74  Out of surgery, Freud is being pushed down the hallway on a gurney. FREUD (V.O.) Endless operations and I should have learned from the first. He’s still sedated, with a white towel under his chin. Sounds of the hospital echo as if they are coming from far away. Unintelligible voices, oddly colored shapes. ETHER DREAMS: THE CORRIDOR IS LINED BY TOWERING VERSIONS OF THE GODS FROM FREUD’S OFFICE, EROTIC, SURREAL. THE GURNEY PASSES A MARBLE STATUE OF A BEARDED GOD AND A YOUNG WOMAN COP",
      "dialogue_count": 0,
      "word_count": 2467
    },
    {
      "scene_number": 4,
      "slugline": "EXT.   THE SOMME, FRANCE - NIGHT 88   88  A YOUNG LEWIS, 19, already war-worn, and his friend PADDY MOORE, 20, march towards the front. The night sky lights up before them in bursts of artillery. It is loud and foreboding. PADDY MOORE You alright, mate? Lewis just stares out, he is anything but alright. EXT. TRENCH - NIGHT 89   89  Rainwater has filled the trench they are crouched in, huddling under their coats.   They listen to the rifle fire. Clusters of bombs exploding, screams from down the line. Paddy pulls out a photo, stares at it. PADDY MOORE I suppose I should have some starlet’s pic. Just me mum. LEWIS If I still had a mum I’m sure I’d do the same. PADDY MOORE JESUS! He jumps aside, a small army of rats run over his shoes, past Lewis. LEWIS There goes dinner. They both laugh, despite the misery. PADDY MOORE Lewis? Make me a promise. If something happens to me, take care of my Mother. And if anything happens to you I’ll do the same for your Father. Lewis just nods, a pact. 64.",
      "characters": [],
      "action_text": "INT. FREUD'S STUDY –   CONT. 90   90  Freud continues to question Lewis, who is determined to get away from the subject. FREUD How much of that night do you remember? LEWIS (dismissive) Little to none...   It was chaos from the outset... Lewis instinctively looks at the door, then forces himself to steady and look back at Freud, who is waiting patiently. Lewis is not getting out of this. LEWIS (CONT’D) It was my last time going over the bags...   Paddy and I made it into no man’s land... THE COMMANDER’S WHISTLE SOUNDS EXT. NO MAN’S LAND - CONT. 91   91  Smoke and fog fill the battlefield.   Artillery and gun fire sound out but Lewis and Paddy are lost in the haze, racing forward. Lewis and Paddy leap forward into a ditch from a mortar blast. LEWIS is breathing heavily. They crouch low, pinned down. Before Lewis are remnants of the roots from a tree once there. Lewis touches the roots- and for a brief moment he is back in his Fantasy Forest. STILLNESS AND SILENCE A baby deer approaches Lewis timidly. He smiles. Coming closer, the fawn looks up to him with her huge, trusting eyes - THEN JOLTED BACK to reality by a mortar blast and Lewis falls backwards- PADDY MOORE (V.O. Jack!   You all right?! 65. Lewis nods, trying to catch his breath.   The volume of the gunfire is deafening.   Gunpowder floats in the air. PADDY MOORE (CONT’D) (shouting to be heard) They’ve got all of Berlin over there!   We can’t stay here! Lewis, covered now in mud, wipes his eyes, raises up and begins firing.   He looks over to Paddy when-- A DIRECT HIT BY A MORTAR SHELL. Lewis reels, in shock, ears ringing, he looks around him frantically only to find Paddy lying dead. Lewis forces himself to take his personals, including the photo of Paddy’s mother.   He looks back at his friend a last time and turns to run - ANOTHER EXPLOSION This one sends Lewis sliding, falling down into a cave beneath no man’s land. He lands hard, jammed against a wall, surrounded by dead bodies, claustrophobic, still grip",
      "dialogue_count": 0,
      "word_count": 1797
    },
    {
      "scene_number": 5,
      "slugline": "INT.   FREUD’S PARLOR - CONTINUOUS 100   100  Dr. Jones watches as Freud rises, looking out the window. FREUD Has Anna ever given you any indication she would be interested in a relationship? JONES No, but...   I’ve spent little time with her, socially.   She has many responsibilities, I understand- FREUD Or perhaps she is disinterested. JONES I think she could only benefit by a wider circle of professional and personal acquaintances. FREUD Beside myself. JONES (reddens) I didn’t mean to infer- FREUD Of course not. JONES Perhaps we could talk again after you’ve had some time to think. FREUD Not necessary. JONES (hopeful) I can speak with her, then? FREUD No. JONES Can I ask why? FREUD Anna and I have an understanding that she will not consider any relationship until we both feel it is suitable.  (MORE)  74.",
      "characters": [],
      "action_text": "You are twenty years older than her. Anna is still a girl, she is too young to even experience sexual longing. JONES (stunned) Do you even hear yourself?   Anna spent years in psychoanalytical treatment for a masturbation complex, which proves she is capable of sexual longing.   A complex that most often stems from her unhealthy paternal attachment. Not that you need concern yourself, doctor.   Primum non nocere.   I’m sure you remember that. Freud glares at Jones, knows he’s right. EXT. STREET - CONT. 101   101  Anna is in a cab. ANNA Hurry, please. The cab picks up speed, Anna sinks back in her seat. INT.   FREUD APARTMENT, VIENNA - FLASHBACK 102   102  Anna waits nervously as the door to her father’s study opens. Out walks Dorothy, looking a little frazzled. Anna follows her, sees their Viennese housekeeper watching. DOROTHY Don’t. ANNA What could I possibly ask? DOROTHY My therapy session are mine alone. Find your own therapist. ANNA I just might...   You do look like a bit flushed.   I wonder what you could have talked about that would have caused that.  FREUD (CONT'D)  75. DOROTHY Wouldn’t you like to know. Dorothy gives her a sideways glance.   Anna suppresses a grin as she follows her out into the hallway and closes the door. INT.   STAIRWELL - CONTINUOUS 103   103  Dorothy walks up the stairs.   Anna follows. ANNA It must be very convenient to live upstairs from your analyst. DOROTHY I could say the same of you having me so close. ANNA I do find it very convenient.   But I wonder what you could have possibly discussed that has aroused such a physical response. DOROTHY Wouldn’t you like to know. (off Anna) Everything to do with you and nothing at all. ANNA So then he knows? They come to Dorothy’s door.   She takes a beat, turns back to Anna, takes her hands. DOROTHY He knows. Anna swallows hard.   Dorothy opens her door to see her two small children.   Anna smiles to herself, follows Dorothy inside as the children rush to hug her, and the door shuts. INT.   ",
      "dialogue_count": 0,
      "word_count": 4257
    },
    {
      "scene_number": 6,
      "slugline": "INT. FREUD’S STUDY – CONT. 132   132  Freud opens his desk drawer.   He takes out the pill case containing the dark pill he took earlier from the medicine cabinet - the same pill he had given to Anna in Vienna, when she was taken by the Brownshirts. Clutching the pills in his hand, he places them back in the bathroom, locking them away. Freud then turns on the radio, sitting in the nearest chair. KING GEORGE’S SPEECH has already begun. KING GEORGE (RADIO) This is the ultimate issue which confronts us. For the sake of all that we ourselves hold dear, and of the world order and peace, it is unthinkable that we should refuse to meet the challenge. INT. FOYER - CONTINUOUS 133   133  Anna opens the front door and enters with Dorothy. CUT TO: INT. TRAIN/FREUD’S STUDY - CONTINUOUS 134   134  Lewis settles into a seat of the train car. The train begins to move, its clatter getting louder and louder. Lewis closes his eyes. LEWIS’ FANTASY, He’s back in his toy forest, this time not as a child but as a man. He stares ahead into endless, forbidding shadows. KING GEORGE (V.O.) There maybe be dark days ahead. And war can no longer be confined to the battlefield. CUT TO: C.U. Freud listening to the KING. 99.",
      "characters": [],
      "action_text": "KING GEORGE (RADIO) But we can only do the right as we see the right. And reverently commit our cause to God. Freud sighs at another “GOD” reference. CUT TO: LEWIS, 135   135  Seeing a tiny speck of light far ahead, then vanishing. Intrigued, his pace quickens. The toy trees he passes become real ones. CUT TO: FREUD 136   136  Leaning back, staring at the ceiling. In the hallway outside the study door, Anna and Dorothy appear. KING GEORGE (CONT.) If one and all we keep resolutely faithful to it, ready for whatever service or sacrifice it may demand, then with God’s help we shall prevail. Anna surprises Dorothy by taking her hand. CUT TO: FREUD 137   137  Opening his hand and seeing the pill he holds. BBC ANNOUNCER (CONT.) We will return to the BBC Orchestra, featuring tonight, on their musical program, Percy Whitlock’s “Battle of the Wood Creatures” Freud rises, reaches for the dial to turn the radio off as the music begins. And hesitates. He turns the music up. 100. Movement catches his eye: He turn to see Anna and Dorothy enter. They stop. Anna takes Dorothy’s hand in hers. For a moment, Father and Daughter stare at each other. Saying nothing, Freud goes back to his chair beside the radio, surreptitiously slipping the “suicide” pill into his pocket, then half-turns, waving them nearer. Anna and Dorothy walk slowly across the study, passing rows of Gods watching them. Freud doesn’t move from the radio as Anna and Dorothy sit close to him. MUSIC swells - Anna looks to her Father, surprised to see him listening to music. He turns, meets her eyes. Freud then stares at the radio, listening intently, trying to decipher what he should feel. CUT TO: LEWIS 138   138  The FOREST is golden now, shimmering between reality and fantasy. The brightness of the single beam of light stops him. He shields his eyes, trying to see- His expression changes, astonishment, awe, at what he- CUT TO: THE TRAIN 139   139  Its brakes scream as the train slows. Lewis, jolted, opens his eyes as ",
      "dialogue_count": 0,
      "word_count": 662
    }
  ]
}