{
  "slug": "fury-2014",
  "title": "fury",
  "genre": "action",
  "format": "film",
  "scenes_count": 13,
  "characters_count": 0,
  "characters": [],
  "total_words": 23002,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. BATTALION AREA - DAY  A farmer’s field has been overrun by a travelling circus of death - An American Armored Battalion. A couple thousand men. A couple hundred vehicles. The TIRED MEN load TIRED VEHICLES for another day on the attack. Months of spearheading into Germany have taken their toll. A BOOMING ARTILLERY BATTERY pumps rounds into German targets miles away. The BLACK DRIVERS of the Redball Express Trucks unload heaps of supplies from their trucks. MECHANICS, CLERKS, COOKS and MPs move with purpose. INFANTRYMEN clean weapons. A CHAPLAIN gives last rites outside the surgery tent as MEDICS line up more litters of  WOUNDED MEN.  A hundred GERMAN PRISONERS sit listlessly behind barbed wire. A BULLDOZER plows a heap of dead Germans into a pit. A ROW OF FIFTEEN SHERMAN TANKS -- Their busy CREWS ready them for another day’s push into Germany. The tankers stop working and stare in amazement. HERE COMES THE FURY -- Driving up fast, it deftly spins and parks perfectly alongside the newer, cleaner tanks. SERGEANT DAVIS, commander of the Lucy Sue shakes his head.  SGT. DAVIS  Thought you were dead Collier.  WARDADDY  The Devil watches over his own. Wardaddy jumps down. A pair of MEDICS approach the tank with a litter. Wardaddy and Gordo haul Red’s corpse out of the tank and lay him onto the litter.  WARDADDY (CONT’D)  Take care of him. He was a good man. The Medic SEES the top of Red’s head is gone.  MEDIC  You said you had wounded. We’re not graves registration.  WARDADDY  Take good care of him. Or I’ll take good care of you. (CONTINUED) 8.",
      "characters": [],
      "action_text": "Wardaddy pats his assault rifle with menace. The Medics trade looks and depart with the body. Gordo crawls under the tank and passes out in the mud. LIEUTENANT PARKER approaches Wardaddy. Young and fresh, he has just a month with the outfit. He’s intimidated by Wardaddy, this tough tanker hard tempered by war’s hammer.  LT. PARKER  Sergeant I was afraid you were dead. I’m awful sorry about T-5 Conley.  WARDADDY  It’s Red. We call him Red.  LT. PARKER  Sure. Where’s the rest of Third Platoon?  WARDADDY  We’re it.  LT. PARKER  What happened out there?  WARDADDY  Another goddamned green Lieutenant happened.  LT. PARKER  What do I tell the Captain?  WARDADDY  Tell him we drove straight into a strongpoint. Two Kraut tanks were dug in like pillboxes. I got ‘em both. After they got everyone else.  LT. PARKER  We’re moving again. Headquarters section’s already folding. You’re in my Platoon now. We’re assigned to check out a town while main unit bypasses.  WARDADDY  A goddamned flank guard mission? Wardaddy nods at the Fury. Looking even more ragged in the daylight. CONTINUED: (CONTINUED) 9. WARDADDY (CONT’D)  Lieutenant, I gotta short in the master switch box. Steering linkage is rattling. Engine’s losing compression. Oil’s in the radiator. Bogies need rubber. There’s a 75 gouge on the turret that’ll take twenty pounds of welding rod to fill in. She’s a mess. So’s my crew.  LT. PARKER  Make ready to depart the company area on my order.  WARDADDY  Yessir. Fuck my life. The young officer spins on his heels and walks off. Wardaddy looks at Bible and Coon-Ass, staring at him from atop the tank. Just crushed. Beaten, exhausted. Spent.  COON-ASS  Parker’s douchebag. We working for that Yankee fool now?  WARDADDY  Don’t you worry about him. You work for me. Restock ammo and rations. Wake up Gordo. Have him top off the water and gas. Do what you can about the mechanical issues. Wardaddy walking away.  BIBLE  Where you going?  WARDADDY  The latrine to take a shit. I ain’t shit in a ",
      "dialogue_count": 0,
      "word_count": 3121
    },
    {
      "scene_number": 2,
      "slugline": "EXT. INTERSECTION - DAY  The five tanks turn onto a paved road. It is crowded with REFUGEES - A long ragged column of German civilians fleeing the bombings and marauding Russians to the East. OLD MEN, WOMEN, CHILDREN, once proud faces not dirty and scared. ON WARDADDY - Warily eying the flood of refugees. There’s a 19th Century carriage being pushed by women. A car is pulled by horses.  WARDADDY  Okay. Button up. There might be a wolf hiding in the sheep. Kid, cast an eyeball on ‘em. Anyone makes a move you cut them right in half. Do what you need to do. If people are in the way, that’s their problem. You copy?  NORMAN  I copy.  INT. FURY (MOVING) - DAY  Gordo and Norman close their hatches. Norman looks at the machine gun. Hesitant. Gordo reaches over and cocks it for him - KERCHACK!  GORDO  Gun’s ready. Just pull the trigger. Every five rounds is a tracer. So you can see what you’re hitting. Remember, short bursts. That way you’ll harvest more meat per bullet. Norman REACTS. Looks through his periscope. NORMAN’S PERISCOPE POV - The world as seen through a rectangular piece of glass. He just sees a tired mass of people. Pathetic and harmless.  EXT. PAVED ROAD - DAY  The Refugees move aside for the tanks. Among them are a dozen SOLDIERS - Schoolboy draftees - With no appetite for a fight. They toss aside their weapons and raise white handkerchiefs. Wardaddy, from his position high in the turret towers over them, aims his assault rifle at them. (CONTINUED) 23.",
      "characters": [],
      "action_text": "WARDADDY  (in German) Keep walking. American lines are that way. Keep going. Hands up high. There you go. Move. Lt. Parker is 50 feet ahead in his tank, he handsignals for Wardaddy to speed up. The tanks speed past the line of refugees. Tanks don’t like people near them.  I/E. FURY (MOVING) - DAY  Gordo opens his hatch. Norman does the same. Grateful he didn’t have to shoot anyone. They pass a pretty girl on a bicycle. She smiles at Norman.  GORDO  There you go, boy. She’ll let you fuck her for a chocolate bar.  NORMAN  That’s not true.  GORDO  That’s not true? Okay. It’s not true.  COON-ASS  It’s true. You can liberate her ass for a D-Ration bar. Or some smokes. Don’t give her a whole pack. Four will do it.  BIBLE  Ignore them. Don’t disappoint Christ. Don’t let them lead you astray.  WARDADDY  We can kill ‘em but we can’t fuck ‘em. Right? Cuz it’s in the bible.  BIBLE  I’m done trying to convert you heathens. Mind if I continue invading Germany?  WARDADDY  You think Jesus loves Hitler? CONTINUED: (CONTINUED) 24. BIBLE  I would assume so. And if Hitler accepted Jesus in his heart and got baptized, he’d be saved. Won’t save him from man’s justice.  WARDADDY  What about your regular issue Nazi line trooper? He going to heaven?  BIBLE  You’ve been asking these same dumb questions for three years. You know where I stand.  COON-ASS  Please save me. Sing me a hymn. Sing me “The Old Rugged Cross”. Sing it boy. Coon-Ass tickles Bible. For all their back and forth, they’re closer than brothers.  BIBLE  Stop, fool. I’ll shoot you.  WARDADDY  Knock off the horseplay. (a beat, then) Boyd, you think Hitler would fuck one of us for a chocolate bar?  BIBLE  I hope so. I’d give it to him good. Slide this cannon right up his backside and punch out a Supercharge. Send the sonofabitch straight to Hell.  COON-ASS  That’s awful Christian of you.  EXT. PAVED ROAD - DAY  The 5 tanks steadily approach their objective. Telegraph poles line the road. From those poles hang four YOUNG BOYS, a",
      "dialogue_count": 0,
      "word_count": 2606
    },
    {
      "scene_number": 3,
      "slugline": "EXT. FARMER’S DIRT ROAD - DAY  The four tanks move in a column. Shielded from the enemy by a small low hill. Fury leads the way - An OLD SERGEANT standing behind the turret mans the .50 Cal.  WARDADDY  You know what’s waiting for us?  OLD SERGEANT  Yeah, I know. Wardaddy smiles at the old leathery bastard.  WARDADDY  (into radio) All tanks this is Wardaddy. Form a shallow right echelon on me. When we hit the flat ground spread out to a hundred yard interval. On my signal we’ll drop the doughs and roll up that 75. Everyone copy?  SGT. DAVIS  Love One-Three copies. Wilco.  SGT. PETERSON  One-Four. Roger all.  SGT. BINKOWSKI  This is Five. We got you Daddy. The column accelerates.  EXT. FURY (MOVING) - DAY  Wardaddy grinds his teeth in anticipation. The column is now coming around the low hill...  WARDADDY  All thanks halt! The tanks stop. To the Old Sergeant...  WARDADDY (CONT’D)  Get ‘em off.  OLD SERGEANT  You heard the man. Everyone off! (CONTINUED) 35.",
      "characters": [],
      "action_text": "Soldiers spill off the tanks and take a knee. Close to the front line they stay low and wary. Some of the older salts immediately start digging foxholes.  WARDADDY  All tanks! Move out! Button up! The column begins to roll again. Hatches are closed. Only the TANK COMMANDERS expose their heads.  EXT. BATTLEFIELD  The tanks churn up dirt as they enter the field. Spread out in the field is a PLATOON OF AMERICAN INFANTRY, laying in shallow trenches they scraped into the dirt between the furrows. They are pinned down by German machine guns. Several are wounded or dead.  WARDADDY  Okay! Fast left! Fast left! Let’s go! Start squirting them trees and bushes. The tanks fire their MACHINE GUNS - Streams of TRACERS from the four tanks probe at any possible hiding place for German men and armor. This is called recon by fire...  INT. FURY (MOVING) - DAY  Norman stares through his periscope. Trying to make sense of the world outside the small glass rectangle.  NORMAN  Do I shoot?  GORDO  Yes. Start shooting.  NORMAN  What do I shoot at?  GORDO  Anywhere Nazis might hide. Norman pulls the trigger. The machine gun jackhammers violently. Adding to the deafening noise of the developing battle. Once over the initial shock of firing the weapon, he smiles, empowered, and hoses every tree and bush in sight. CONTINUED: (CONTINUED) 36. GORDO (CONT’D)  Don’t sit on the trigger! You’ll burn out the barrel! ON BIBLE - His face pressed against his gunsight. He fires bursts from the coaxial machine gun using the foot switch. BIBLE’S GUNSIGHT POV - His tracers rake the distant ditches and bushes.  SGT. BINKOWSKI  One-Five for Wardaddy. I see a bunch’ Krauts a hundred yards to my right.  WARDADDY  That’s our troops. Do not shoot them.  SGT. BINKOWSKI  Yeah. Okay I copy.  EXT. BEET FIELD - DAY  The Fury and the other three tanks drive abreast through the field toward a row of hedges and trees... There are two BURNING HALF-TRACKS - The source of the black smoke we saw earlier - Jagged holes in thei",
      "dialogue_count": 0,
      "word_count": 1262
    },
    {
      "scene_number": 4,
      "slugline": "INT. FURY (MOVING)  Norman loading a fresh belt of ammo... GORDO’S PERISCOPE POV - A GERMAN SOLDIER stands up and aims a Panzerfaust at the Fury.  GORDO  Get him! Kill him! Norman finishes loading the belt. COCKS the gun. Looks through his periscope. NORMAN’S PERISCOPE POV - BRDDDDT! Bible shreds the German Soldier with the coaxial machine gun. Beating Norman to the punch. Gordo glares at Norman.  GORDO (CONT’D)  Do your job. Do what you’re here for. Do it now.  NORMAN  I was loading the gun. Norman grits his teeth and begins firing. Moving the gun from side to side. Utterly lacking in finesse.  EXT. BEET FIELD - GERMAN FOXHOLES - DAY  The four tanks hose down the foxholes with their machine guns. Several Germans jump up and wave white handkerchiefs in surrender. They are shot down. Wardaddy SEES a machine gun position - Three GERMANS cower behind their dug-in heavy machine gun.  WARDADDY  Machine gun, twelve o’clock. Gordo! Run them bastards over! Gordo guns the engine. The Fury lurches forward. The three Germans try to flee from their foxhole. It is too late - Two of them are crushed. The third man cringes at the bottom of the deep hole. Gordo stops over him. Works the steering levers back and forth... The tank turns from side to side, grinding apart the German position, burying the last man alive. The four tanks continue firing their machine guns into the foxholes. Chewing apart the huddle GERMAN SOLDIERS. 41.",
      "characters": [],
      "action_text": "INT. FURY (MOVING)  Gordo turns to Norman.  GORDO  Squirt them Krauts there. On yer left. See ‘em? NORMAN’S PERISCOPE POV - There is a cluster of dead German Soldiers, cut down when they tried to run for it.  NORMAN  The dead bodies? They’re already dead.  GORDO  You a doctor? How you know they’re dead? Hit ‘em. So they can’t jump up and shoot us in the ass. Norman looking at Gordo. He just can’t do it. Gordo shakes his head in frustration. And turns the tank toward the bodies and runs them over. Norman begins to cry. Not simply a tear down the cheek but a roar of anguish, good honest pain...  NORMAN  I can’t be here. I can’t be here.  WARDADDY  Turn your goddamn intercom off it you’re gonna ball like that!  EXT. BEET FIELD - GERMAN FOXHOLES  The Fury turns side to side grinding dead Germans into the mud. Wardaddy gets on to the big .50 Cal machine gun... RAT-AT-AT-AT-AT-AT! He fires into the foxholes, chewing up dirt, men, and equipment. Soon the German dead have all been adequately “double tapped” by the four tanks. An everyday procedure. The firing slackens. And stops. Just the occasional burst from a tank’s BOW or COAX MACHINE GUN.  WARDADDY  All tanks. Let’s hold here. One- Four. You better take care of that fire. (CONTINUED) 42. The packs on Love 1-4 are still burning. Wardaddy looks behind them and SEES the pinned Platoon from Baker Company rise to their feet. These are the men the tanks have just rescued. There is no celebration. No back slapping. The Infantry Soldiers know that only more hard fighting awaits them. The men they dropped off have moved up. The two platoons of soldiers inspect the Kraut foxholes... A couple CREWMAN in Love 1-4 douse their burning packs with fire extinguishers. Then cut them off.  WARDADDY (CONT’D)  Wardaddy for Love-Four and Five. Pull up there fifty yards and cover that road.  SGT. PETERSON (V.O.)  Love one-four wilco.  WARDADDY  Love One-Six for Baker Six. We cleared out the machine guns and the anti-tank. You’re fine to roll",
      "dialogue_count": 0,
      "word_count": 1764
    },
    {
      "scene_number": 5,
      "slugline": "EXT. OUTSIDE A GERMAN TOWN - DAY  The column has halted. The four tanks are spread out abreast. The Infantry Soldiers have dismounted from the tanks and take shelter behind them. Wardaddy scans the town with German binoculars. His jaw muscles ripple as he grinds his teeth. WHAT HE SEES - A typical small North German village. Houses and shops clustered around a couple intersections. He gets on the company net...  WARDADDY  Baker Six from Love One-Six. I don’t see white sheets. And nobody’s out. I think we’re looking at a fight. Over.  CAPTAIN WAGGONER (V.O.)  Baker Six copies. Higher wants this place secured by fifteen hundred German O’clock. Go ahead and get in there. Mortar section’s standing by. They’re all we got so don’t get in trouble.  WARDADDY  Baker Six from Love One-Six. Wilco. Commencing assault from LOD now. Over. Wardaddy grabs the mike for the Platoon net.  WARDADDY (CONT’D)  All tank. Listen up, we’re going in. Move out. And let’s button up until we know what’s in there. Love One-Three, take the right, outside that line of buildings. One Four, you take the left, I’ll take point on the wedge. Binkowski, you’re on me. Stay twenty yards off my ass. The four tanks move forward toward the town. Love 1-3 and Love 1-4 leave the road and split off around either side of the village. The tanks move slow - so the Platoon Soldiers on foot can keep up. 48.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 243
    },
    {
      "scene_number": 6,
      "slugline": "EXT. GERMAN TOWN - DAY  The Fury enters the sleepy rural village. Nobody is in sight. Except for a bent OLD MAN in a doorway.  WARDADDY  (German) Grandpa. Where are the German soldiers? The Old Man points at a HOTEL down the road. POW! A single rifle shot his the Old Man, dropping him instantly. Wardaddy grabs the hands of his .50 Cal and lets it rip on the Hotel building. RAT-AT-AT-AT-AT-AT-AT! Thumbsized armor piercing bullets smash into the Hotel. Blasting off chunks of masonry.  WARDADDY (CONT’D)  Bible, follow my burst. Throw a round of HE into that open second story window.  BIBLE  On the way - KABOOM! The cannon fire, the round impacts the building. BOOM! The round EXPLODES dropping most of the second story facade - exposing 6 GERMAN SOLDIERS, stunned by the blast. POW-POW-POW-POW-POW! The Platoon Soldiers crouched behind the Fury eagerly light them up with their rifles.  INT. FURY (MOVING)  Norman’s face is pressed against his periscope. NORMAN’S PERISCOPE POV - A GERMAN SOLDIER runs right in front of the tank. Without thinking Norman opens fire. BRDDDDDDDT! Dropping the German to the street. His rifle CLATTERS across the cobblestones. Norman realizes what he did. He leans back and takes a deep breath. Gordo pats his shoulder.  GORDO  That’s all it is. Keep going. (CONTINUED) 49.",
      "characters": [],
      "action_text": "WARDADDY  Good one, kid. Keep stacking ‘em up. Norman wipes the sweat from his brow. Settles in behind the periscope. Hunting for more targets.  EXT. GERMAN TOWN  Platoon Soldiers take cover in doorways. Staying close to walls. They kick in doors and methodically clear each building. The Fury and Love 1-5 slowly advance. Wardaddy is two stories high in his turret... ON HIS LEFT - A GERMAN SOLDIER in a second story window aims a submachine gun at him... Wardaddy - Almost face to face with the German - Grabs his assault rifle and aims. BRDDT - Killing the soldier. Wardaddy scans the upper stories around him for more threats. BRDDDDT! A German heavy machine gun opens up. It is cleverly dug into a cellar in the base of a building. Its chainsaw roar echoes off the buildings. Its deadly tracers rake the street... Two Platoon Soldiers are hit and drop - The Machine gun is too close to the Fury for the tank to get a good shot.  WARDADDY  Binkowski, see that Kraut stinger in the cellar there? Mind giving him what for?  SGT. BINKOWSKI  Sure, Daddy. I’ll slap him around. You better button up. Wardaddy gets inside the turret. Closes his hatch.  INT. FURY (MOVING)  Wardaddy watches through his periscope... KAPOW! 1-5 fires a High Explosive shell right next to Fury... CONTINUED: (CONTINUED) 50. BOOM! The shell blasts a hole in the building’s exterior wall. Silencing the machine gun. Falling brickwork lands on the Fury...  EXT. GERMAN TOWN  Wardaddy opens his hatch, bricks cover the tank. A German Soldier staggers out of the exposed building. Bleeding from the ears and disorientated... Wardaddy pulls his .45 And takes careful aim - POP! Drops him with one shot - Then out of nowhere: BOOM-KTANG! A German anti-tank shell glances off the turret with a SHOWER OF SPARKS and smashes into the building. Wardaddy is stunned by the close call. Wiping his eyes, choking on brick dust... NEW ANGLE - A Small German antitank gun is hidden inside a tailor shop. The crew frantically reloading.  WA",
      "dialogue_count": 0,
      "word_count": 1466
    },
    {
      "scene_number": 7,
      "slugline": "INT. GERMAN TOWN - NAZI HEADQUARTERS - DAY  Wardaddy pushes the door open. He and Norman gaze upon a shocking sight... WHAT THEY SEE - There are several dead men and women. The men wear Nazi Party Uniforms, middle-aged fat bureaucrats. The women wear party dresses. Presumably their wives. Empty booze bottles everywhere. Several of the men hold pistols.  WARDADDY  They knew we were coming. So they got drunk as Lords and shot themselves at sun up. A beat as Norman stares at this man tableau...  NORMAN  Why are you showing me this?  WARDADDY  You know why. Wardaddy walks away. Norman follows.  EXT. GERMAN TOWN - CENTRAL SQUARE  Wardaddy and Norman head down the street. Two GIs pass them clutching wine bottles - both wear top hats and sunglasses.  WARDADDY  Keep doing what I say. You do that and you’ll get through this thing. CRASH! - SOLDIERS searching a building heave a dumpster out the window. It bursts open on the cobblestone street. Wardaddy SEES a face in the window on the upper floor of a nearby apartment building. He quickly heads for it.  WARDADDY (CONT’D)  C’mon.  NORMAN  What’d you see?  WARDADDY  Krauts. Wardaddy grabs Norman’s greasegun - cocks it and hands it back. He takes the safety off his assault rifle and boots the front door. 55.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 219
    },
    {
      "scene_number": 8,
      "slugline": "INT. GERMAN TOWN - APARTMENT BUILDING - DAY  Wardaddy quickly charges up the stairs... Norman follows. They reach an apartment door on the top story. Wardaddy POUNDS it with the stock of his assault rifle. A WOMAN opens the door - Her name is IRMA - The fear on her face is plain as day.  WARDADDY  (in German) Who’s in here?  IRMA  (in German) Just me.  WARDADDY  Bullshit. Wardaddy forces his way inside.  INT. GERMAN TOWN - WOMAN’S APARTMENT - DAY  It has surprisingly modern furniture and decor. Wardaddy quickly searches the place. Norman follows his around like a puppy. Wardaddy checks closets. Cupboards. Anywhere a human being can hide. He enters a bedroom and looks under the bed - SOMEONE is hiding underneath.  WARDADDY  (in German) Get out of there. Right now. Hurry up. Norman watches a gorgeous young lady slide out from under the bed. This is EMMA - she’s 18 - Norman’s age. Wardaddy helps her up. Norman is transfixed by her. Wardaddy drags Emma from the bedroom by her wrist. Wardaddy turns to Norman.  WARDADDY (CONT’D)  Close the door and lock it! Norman freezes - Things are going to a bad place.  WARDADDY (CONT’D)  Lock the fucking door! Norman complies. Slowly closing and locking the front door. Irma is just sick with fear. (CONTINUED) 56.",
      "characters": [],
      "action_text": "IRMA  (in German) Please, leave her alone.  WARDADDY  (in German) You said nobody was in here. You could have gotten her killed.  IRMA  She’s my cousin. I’m sorry. Please. I was afraid of --  WARDADDY  -- I know what you were afraid of. Wardaddy pushes Emma onto the couch. Then sits down in a chair. He takes off his helmet. Leans his rifle against the wall. Suddenly looking very tired. He looks at Irma.  WARDADDY (CONT’D)  Get me some hot water. For shaving. (to Norman) Sit the fuck down. Put the gun away. You make me nervous. Norman stiffly sits on the couch with Emma. It’s awkward. Like a bad blind date.  WARDADDY (CONT’D)  What’s your name young lady?  EMMA  (in German) Emma.  WARDADDY  Emma, you know how to cook? The girl nods: yes. Wardaddy reaches in his musette bag. Digs out a soap dish. He opens it and carefully unwraps four eggs - Precious rare eggs. Then he takes out a can of coffee. And a can of bacon. He offers the rare treasures to Emma. Her eyes light up and she joyfully accepts them. As a bonus Wardaddy gives her two packs of smokes. She happily joins Irma in the kitchen. Norman relaxes. Wardaddy isn’t here to rape and kill them. Norman takes off his helmet. And takes off his jacket. CONTINUED: 57. INT. GERMAN TOWN - WOMAN’S APARTMENT  In the kitchen - Irma savouring an American cigarette as she cooks bacon and eggs. She sips from her cup of fresh coffee. The first in years. Norman is asleep on the couch. Wardaddy stands before a pot of steaming hot water. He has peeled off his jacket, overalls and shirt - Hideous burn scars cover his back. Emma crosses to Norman and gently wakes him, offers him a steaming cup of coffee. Norman smiles at her. He likes her. She smiles back. She likes him. She sits next to him. Thigh to thigh. Norman SEES Wardaddy’s burns and REACTS - Embarrassed by them, Wardaddy puts his shirt back on. Emma holds Norman’s hand. Then tries to pull him off the couch. Norman realizes where this is going. And blushes. He shakes his head: ",
      "dialogue_count": 0,
      "word_count": 1540
    },
    {
      "scene_number": 9,
      "slugline": "INT. GERMAN TOWN - WOMAN’S APARTMENT - DAY (LATER)  Norman, Wardaddy, Coon-Ass, and Bible sit at the table eating bacon and eggs. Emma toast thin slices of black bread. Irma pours the men little glasses of Schnapps. She sets a glass in front of Wardaddy. He pushes it away with his finger.  WARDADDY  (in German) No thank you.  GORDO  You like horses?  NORMAN  I told you, I’m a city kid.  GORDO  Don likes horses. Right, Don?  WARDADDY  I’m eating. We’re eating.  GORDO  In France we hit the beach right after D-Day and fought through all those fucking hedgerows. We finally broke out into open country. And bypassed all these Kraut divisions. We linked up the Canadians and British and trapped an entire Kraut Army pulling back to Germany. We fucked them up. With planes and artillery. Dead Krauts and horses and busted up tanks and cars for miles. Miles. Your eyes see it but your head can’t make no sense of it. We go in there. And for three whole days we shot wounded horses. All day long. Sun up to sundown. Putting down horses. Hot summer days. Ain’t smelled nothing like it. The sound of it. Those fucking horses screaming. Black clouds of flies buzzing. Like being in a giant bee hive. Norman’s eyes bug. He’s lost his appetite.  WARDADDY  That’s really a fine story. Pleasant meal time talk. Thank you. (CONTINUED) 63.",
      "characters": [],
      "action_text": "COON-ASS  It’s what happened. And what happened, happened. And what’s gonna happen is gonna happen. And playing house with a couple bitch Krauts won’t change much, will it?  WARDADDY  Shut the fuck up.  COON-ASS  The seventh seal’s broken, buddy. You can’t put the shit back in the horse. Wardaddy pulls his .45 And SLAMS it on the table. Coon-Ass backs down. A painfully tense silence follows. Wardaddy’s fork scrapes against his plate as he shovels eggs and bacon into his mouth. Finally he looks at Norman. Smiles warmly.  WARDADDY  Your mama a good cook?  NORMAN  She’s a really good cook.  WARDADDY  How’s her fried chicken?  NORMAN  She doesn’t fry chicken. She roast it with stuffing. Or makes chicken and dumplings. That’s my favorite. She bakes too. Pies and cakes and -- A KNOCK at the door. Norman gets up and answers. It’s the  COMPANY MESSENGER. COMPANY MESSENGER  Where’s Love One-Six?  WARDADDY  Right here.  COMPANY MESSENGER  Old man wants you.  WARDADDY  How come?  COMPANY MESSENGER  You got a mission. CONTINUED: (CONTINUED) 64. The men look at each other. Their short respite is over. Wardaddy finishes his coffee. Pushes his chair back and stands. His men stand too.  WARDADDY  (in German) If you’ll excuse us, please. (to the guys) Let’s go. He crosses, grabs his helmet and weapon.  IRMA  (in German) Where are you going?  WARDADDY  To take the next town. And the next one. And the next one. Until you people quit.  IRMA  What’s going to happen to us?  WARDADDY  I don’t know. Irma stands stoically. Hands folded in front of her. Lips pursed. Norman grabs his greasegun. Slips on his helmet. It’s hateful to leave. Just hateful. Emma runs to him and holds on to him for dear life. Coon-Ass grabs the boy by the scruff and drags him away.  COON-ASS  There’s a lot more of them. To the Company Messenger, on his way out - RE: the women...  WARDADDY  Make sure none of the boys give them a hard time.  INT. GERMAN TOWN - COMPANY COMMAND POST - DAY  Inside a nice house with antiq",
      "dialogue_count": 0,
      "word_count": 4858
    },
    {
      "scene_number": 10,
      "slugline": "INT. FURY (MOVING)  It was a damn hard whack -- Dust and smoke fill the interior. Rations and ammunition spill from its racks. SPARKING electrical shorts.  COON-ASS  Fuck! Another Tiger!  WARDADDY  Calm down. It’s a mine. We hit a mine is all. Gordo shakes it off. The engine stalls. He restarts it. Puts it in gear. Lets up the clutch. The tank starts turning in a circle.  GORDO  We threw a track.  EXT. FURY - DUSK  Wardaddy aiming his .50 Cal at the nearby buildings. Coon-Ass exits the turret. Examines the broken track and the smoking crater the mine made.  COON-ASS  She’s broke as fuck. Busted a shock too.  WARDADDY  You fix it?  COON-ASS  Yeah. Why not?  WARDADDY  Norman! Get out here! Norman exits his hatch - He’s afraid to jump down to the road...  NORMAN  What about mines?  WARDADDY  They’re for vehicles. You ain’t heavy enough to set one off. Go with Coon-Ass and check out those buildings. I’m covering you. Go on. (CONTINUED) 85.",
      "characters": [],
      "action_text": "Norman looks at Coon-Ass, who shrugs. They approach the Old House just up the road...  INT. OLD HOUSE - DUSK  WHAM! - Coon-Ass kicks the door. Norman joins him inside. Both men freeze... WHAT THEY SEE - The interior of the house is filled with mines. Big round anti-tank mines to be exact. Stacks of them. It’s being used as a munitions depot. Coon-Ass slowly backs out of there...  COON-ASS  Don’t touch nothin’.  NORMAN  Not planning on it.  EXT. CROSSROADS - DUSK  Gordo and Bible have started unbolting a section of track from Fury’s side. Coon-Ass shouts to Wardaddy:  COON-ASS  Whole thing’s full of mines. Good thing you didn’t shoot the shit out of it or we’d be drinking whiskey with Jesus.  WARDADDY  Maybe I will anyway. I could use a drink. Keep going. What’s in the other house?  INT. BEER HALL - DUSK  WHAM! Coon-Ass kicks the door. Enters with Norman. This place is disturbing in a different way. There is dried blood everywhere. Bandages. Medical supplies. Cut off bloody uniforms and boots. Amputated limbs. Flesh. Organs. And a half-dozen DEAD GERMAN SOLDIERS who succumbed to battle wounds. This was a temporary field hospital.  COON-ASS  At least there ain’t no live Krauts to worry about. CONTINUED: (CONTINUED) 86. It is beyond creepy in here...  NORMAN  Can we go now?  EXT. CROSSROADS - DUSK  Coon-Ass and Norman return to the Fury. Gordo uses a track breaking tool to remove the damaged track links. Bible probes the road around them for more mines.  WARDADDY  Anything?  COON-ASS  Naw, nothing.  WARDADDY  Kid, head up by those trees. You go outpost guard. Norman nods and heads up the road.  EXT. ROAD SENTRY POSITION - NIGHT  Norman sits in the roadside ditch. He checks his greasegun. It’s loaded. He sets it in his lap. He adds drink powder to his canteen. Shakes it. He opens a can of crackers with his little GI can opener. He chews the hard crackers and washes them down with his canteen. He yawns widely. He’s physically and emotionally drained from his first day as",
      "dialogue_count": 0,
      "word_count": 812
    },
    {
      "scene_number": 11,
      "slugline": "EXT. ROAD SENTRY POSITION - NIGHT  Wardaddy and Norman move low along the ditch. Wardaddy SEES the approaching troops - Silhouettes in the darkness. He can just hear their hobnailed boots CRUNCHING the road. He grabs Norman’s arm and drags him out of there.  WARDADDY  ... C'mon...  EXT. CROSSROADS - NIGHT  Wardaddy and Norman come running.  WARDADDY  There’s a goddamned SS battalion headed this way.  GORDO  Bullshit. Bible sees he’s dead serious...  BIBLE  Where are they?  WARDADDY  Marching this way. Wardaddy’s mind is racing - They face hopeless odds.  COON-ASS  Let’s get out of here. They’ll never see us in the dark. Let ‘em pass through.  WARDADDY  We’re not running. We’re fighting it out. We’ll hold this damn crossroad. His men look at him like he’s insane. This is unlike anything they have ever done.  COON-ASS  You wanna sit here in a busted tank and hold off an SS battalion? (CONTINUED) 89.",
      "characters": [],
      "action_text": "WARDADDY  No I don’t want to. But it’s what we’re doing. Mount up. Take your fighting positions. Wardaddy climbs aboard the Fury. His jaw tenses. It’s okay with him. He double checks his .50 Cal.  WARDADDY (CONT’D)  Go on. Get outta here. Norman looks at the other guys. Then at Wardaddy. He crosses to the Fury and stands by it, looking at the others with crossed arms. With that show of bravery, Gordo, Coon-Ass and Bible have no choice but to follow suit. The three men approach the Fury. No one has any illusions - This somber, sober choice means their deaths. Wardaddy smiles. As much of a smile as he can muster. Then he’s all business.  WARDADDY (CONT’D)  We’re gonna play dead, like we’ve done before. Let ‘em march right up. Then open up with all we got and splatter the assholes all over the road. (to Coon-Ass) Grab us one of them dead Krauts.  COON-ASS  We gonna have a pig roast?  WARDADDY  Something like that. Coon-Ass rushes off toward the Old House... Wardaddy grabs his knife and cuts several packs and dufflebags off the tank. He hands Norman a gas can...  WARDADDY (CONT’D)  Give ‘em a good soaking. Norman pours the gas on them. Gordo grabs extra boxes of ammo from the storage racks and shoves them into the tank. Bible is in the turret singing a hymn. He resets the fuzes on the cannon shells for close-in work. He wipes the main gun breech down. Cleans his optics. Oils the machine gun. CONTINUED: (CONTINUED) 90. Here comes Coon-Ass dragging a body...  WARDADDY (CONT’D)  Hurry up with that sack ‘a shit. Wardaddy jumps down to help. He tosses the body on the front of the tank. Pulls off his jacket and puts it on the body.  WARDADDY (CONT’D)  Toss me that helmet. Norman tosses him an American helmet. Wardaddy straps it on the corpse’s head. He grabs the gas can from Norman. Splashes the body with it. Wardaddy lights a smoke with a match. Then tosses the match on the body - FWOOMP! Wardaddy lights another match and tosses it on the packs in the road - FWOOMP! Satisfie",
      "dialogue_count": 0,
      "word_count": 4450
    },
    {
      "scene_number": 12,
      "slugline": "EXT. CROSSROADS - NIGHT  SS Troopers everywhere. Their medics attend to their wounded. They swarm over the Fury. Open her hatches. Aim their weapons inside and... BRDDDT-BRDDDDT! - Make sure all the occupants are dead.  EXT. CROSSROADS - UNDERNEATH THE FURY - NIGHT  A YOUNG TROOPER looks beneath the tank with a flashlight. Norman, nearly entirely buried, follows the path of the light beam with his one exposed eye... The light plays across the undercarriage. Norman’s HEARTBEAT feels excruciating loud. Blood pounding in his ears. An SS  OFFICER SHOUTS... SS OFFICER  (in German) Let’s go! We’re behind schedule! Move it! Hurry up! Let’s move! The Young Trooper turns off the light. He stands and walks away. Iron boot heels crunching the road... Norman thanks his higher power. He may just survive this thing. Then the boots stop. And return... Norman tries to be one with the roadbed. The Trooper lays down - CLICK - Shines the light directly in Norman’s face. He’s been discovered. ON THE YOUNG TROOPER - Now we see his face. He’s a kid, younger than Norman. A boy in uniform. He looks Norman in the eye. Norman slowly lifts his hands in surrender. His oil and blood soaked fingers emerging from the dirt and dust. The Young Trooper smiles weakly - “I won’t hurt you.” Then turns off the light and walks away. Norman sags with anxious relief. Shrill WHISTLES. SHOUTING as the Sergeants get their squads on the march again. Jackboots CRUNCH the road as the SS formation continues down the road. 109.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 259
    },
    {
      "scene_number": 13,
      "slugline": "EXT. CROSSROADS - UNDERNEATH THE FURY - NIGHT  The SS Troops are marching away in the distance. On a pointless and doomed mission against overwhelming Allied Armies steamrolling across Germany. Now it’s quiet. Dead quiet. Norman, buried in his hole, finally succumbs to exhaustion. His eyes close. He passes out curled in his womb of dirt.  EXT. CROSSROADS - FURY - DAWN  Distant ROOSTERS CROW. The escape hatch slowly opens. It’s Norman - He slips inside the Fury. He forces his way past Gordo’s body. Then covers Gordo with a jacket. He moves to Coon-Ass and covers him. Then Bible, he gently crosses his arms over his chest. There’s Wardaddy. Sitting there. The grenades have made a mess of him. Norman takes off his jacket and covers him up. He pauses. Gently picks up Wardaddy’s big calloused hand. He looks at his palm. Traces the line a moment. As if to confirm something he already knew. Then he sets it down. Norman finds Wardaddy’s knife on the floor of the turret basket. He picks up the knife and runs his thumb along all the notches. Norman HEARS something. Movement outside the tank. And VOICES! He freezes. Unsure what to do. This kid is traumatized, he’s in no condition to fight Nazis... Alone and scared. Norman sits there trembling, holding Wardaddy’s knife for protection... The hatch opens - It’s a SOLDIER... An American Soldier - One we recognize - The Huge Dirty Soldier from Baker Company - He looks at Norman with war weary eyes. Wipes his nose on his sleeve and shouts to his buddies.  HUGE DIRTY SOLDIER  One’s alive!  EXT. CROSSROADS - DAY  The Fury is shot to hell, burnt and scarred. Baker Company soldiers are gathered around her. (CONTINUED) 110.",
      "characters": [],
      "action_text": "Norman is pulled out of the hatch and laid onto a stretcher. Two MEDICS carry Norman to a waiting Half-Track.  MEDIC  You’re a hero. You know that? Norman doesn’t know what that means. Or really care. It is clear from the churning angst in his eyes he will never, ever be the same. CRANE UP - Until we look straight down on the crossroads and see the true scope of the fight, of the carnage... Laid out in a ring around the tank for fifty yards are a couple hundred dead SS Troopers... Norman is loaded into the Half-Track. It slowly drives away.  -- THE END --  CONTINUED: 111.",
      "dialogue_count": 0,
      "word_count": 402
    }
  ]
}