{
  "slug": "futurama-101-space-pilot-3000-1999",
  "title": "futurama 101 space pilot 3000",
  "genre": "sci-fi",
  "format": "series",
  "scenes_count": 9,
  "characters_count": 0,
  "characters": [],
  "total_words": 6006,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. MIR SPACE STATION - NIGHT  Through the porthole, we see TWO COSMONAUTS toasting with vodka glasses. A tiny corner of the solar panel is on fire. RUSSIAN COSMONAUTS Vosem!  EXT. GREAT PYRAMIDS - NIGHT  EGYPTIAN CROWD Sabah!  EXT. PARTHENON - NIGHT  GREEK CROWD Eksi!  INT. CRYOGENIC LAB  A lonely Fry his watch, pulls a noisemaker from his pocket, and puts it in his mouth.  EXT. GREAT WALL OF CHINA - NIGHT  CHINESE CROWD Wu!  EXT. TAJ MAHAL - NIGHT  INDIAN CROWD Chaar!  EXT. MASAI CAMP - NIGHT  MASAI CROWD (LOUDER) Thathu. 4.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 94
    },
    {
      "scene_number": 2,
      "slugline": "EXT. TOKYO - NEON LIT STREET - NIGHT  TOKYO CROWD (LOUDER) Ni!  EXT. EARTH (AS SEEN FROM SPACE)  HUMAN RACE (V.O.) ONE! / UNO! / UNI! / EIN! / E!/ ICHI! / ECHAD! / WAHID! / ET!  INT. CRYOGENIC LAB - NIGHT  Fry, leaning back in his chair, blows his noisemaker. It unfurls with a   CRINKLY PAPER SOUND   and a pathetic   BRAAAP . The recoil tilts him backwards, and he flips head over heels into an open cryogenic tube. The lid SNAPS shut, and the dial   CLICKS   to \"1000 Years\". A horrified Fry peers out, still clutching his beer can. FRY Uh-oh. A dribble of beer suddenly freezes solid, as does Fry.  MONTAGE FUTURISTIC SOUND EFFECTS   (an extended lead-in to our theme.) Generally build. Fry's contorted face remains motionless in the foreground as the rotating timer   CLICKS   faster and faster. Through the window, days, years, and centuries past as we dissolve from one image to the next: A. Glorious fireworks Illuminati the sky. B. The next day, sanitation men with push brooms sweep up trash, party hats, and a few bodies. C. The sun and moon race overhead, more and more rapidly. D. Fly saucers crosses from left to right, destroying the city with lasers. E. A jungle grows amid the ruins of the city. F. The city is rebuilt with medieval castles. G. Flying saucers cross the city right to left, destroying the city with lasesr once again. H. Buildings rise and fall in indistinct blurs. The small overall effect is that the steet level rises. (CONTINUED) 5.",
      "characters": [],
      "action_text": "IN A CLOSE UP, the timer   dings.   The door   POPS   open, and the beer re-liquefies and   DRIBBLES   on the floor. A dazed Fry wobbles out. FRY   (cont'd) (GROGGY NOISES) He turns and gazes out upon   New   New York City.  FRY'S POV  It's a wonderland of futuristic buildings, hovering cars, blazing advertisements, tubeways and rockets overhead.  BACK TO SCENE  Fry's eyes widen. FRY   (cont'd) (Surprised) Holy sh-  MAIN CUT TO: THEME MUSIC   and opening title. CONTINUED:   6. ACT I  FADE IN: INT. CRYOGENIC LAB - MORNING - CONTINUOUS  FRY - -it!  FRY'S POV  We see pedestrians in futuristic garb, flying cars, monorail schoolbuses, winding tubebways, blue traffic lights, advertisement for Slurm, billboards of Mom, etc. FRY   (cont'd) (AMAZED) Whoa, I must have been frozen for months. LEELA (O.S.) Good morning. Fry turns.  FRY'S POV  He looks down at a pair of boots. Then he gaze slowly moves up a shapely female body. FRY (V.O) (INTRIGUED SOUND) We continue   panning up, then come to an abrupt stop... the woman, Leela, has only ONE LARGE EYE in the middle of her forehead. FRY (V.O.) (ALARMED SOUND)  BACK TO SCENE  LEELA I'm Leela. (CONTINUED) 7. FRY Hello, I'm Fry. She enters this into an electronic notepad. LEELA I'll be your guidance councilor. My job is to help you adapt to the-- FRY (INTERRUPTS) Can I ask you a question? LEELA Sure, as long as it's not about my eye. FRY Uh... (FALLS SILENT) LEELA It it about my eye? FRY Sort of. LEELA All right, just ask the question. FRY What's with the eye? LEELA (SLIGHTLY ANNOYED) I'm an alien. (CONTINUED) CONTINUED:   8. FRY Whoa, cool. Welcome to Earth. If you ever need someone to show you around... He gestures at himself as if to say \"I'm your man.\" LEELA (SMILES) I'll keep that in mind. FRY Well I should go, Mr. Panucci is going to be P.O.'d Fry turns to go. Leela gently turns him to face a digital wall calendar, which reads \"Dec. 31, 2999\" FRY   (cont'd) Oh, no. Oh, no! Please tell me that calendar cost twenty-nine, ninety ",
      "dialogue_count": 0,
      "word_count": 2519
    },
    {
      "scene_number": 3,
      "slugline": "EXT. STREET - A MOMENT LATER  Fry and Bender are running for their lives. BENDER Come on, this way! He turns and runs up the steps of an impressive, pillared building. Lettering above the main doors reads \"MUSEUM.\" Bender's wiry legs take four steps at a time. Fry struggles to keep up.  INT. MUSEUM - HALLWAY - SECONDS LATER  Fry and Bender push through a door labeled \"20th Century.\"  INT. MUSEUM - 20TH CENTURY GALLERY - CONTINUOUS  They quickly duck behind some shelving units. Fry lifts his head cautiously and looks around.  FRY'S POV  The shelves are lined with rows of HEADS IN JARS. Each has a name plaque under it. Some of the nearby heads include \"Dennis Rodman\", \"Oprah!\" and \"Matt Groening.\" FRY Where the hell am I? LENARD NIMOY'S HEAD Welcome to the Head Museum. I'm Lenard Nimoy. FRY Wow, Lenard Nimoy. Do the thing... Fry makes the Spock \"Live Long and Prosper\" sign with his hand and presses it against the jar. LENARD NIMOY'S HEAD I don't do that anymore. (CONTINUED) 22.",
      "characters": [],
      "action_text": "FRY So what's the deal with being a head in a jar? LENARD NIMOY'S HEAD We share our wisdom with those who seek it. It's a life of quiet dignity. An attendant enters. ATTTENDANT Feeding time! She begins shaking fish food into the jar. Nimoy and the other heads rise to the surface and begin feeding like hungry goldfish. We hear a door   OPEN.   Fry whirls nervously.  NEW ANGLE  Leela enters the hall and looks around.  LEELA'S POV  We pan along a shelf of heads. Among them are Fry and Bender, who are attempting to blend in with the heads. We pan past them, then quickly WHIP back to them and ZOOM in. Fry smiles cheesily. FRY Uh... welcome to the Head Museum. Bender leans over and whispers in Fry's ear. BENDER I'll see you in the gift shop. Leela approaches. (CONTINUED) CONTINUED:   23. LEELA Thanks for only freezing me for five minutes. That was relatively considerate. FRY Let's just say you owe me. She   SLAPS   him across the face. FRY   (cont'd) Ow. [NOTICES SOMETHING] Hey! We see Leela brandishing the Chip Implanter. LEELA Sorry, Fry, but I have to install your chip. I'm just doing my job. You gotta do what you gotta do. Fry backs off, nowhere to run, until he is against a shelf. A sign reads \"U.S. Presidents - Do Not Tap On Glass.\" We see several Presidents in jars, including \"F.D.R.\" \"NIXON\" and \"CLINTON.\" They're surrounded by a number of Secret Service heads with earpieces and sunglasses. Fry backs up one step further and hits the shelf, shaking it. F.D.R./NIXON/CLINTON HEADS Whoa-oa-oa / [WORRIED SOUNDS] LEELA Look out! Nixon's jar falls and hits Fry in the head. FRY/NIXON'S HEAD [PAINED GRUNT] The jar smashes open, and Nixon's head drops to the floor. An   ALARM   sounds. (CONTINUED) CONTINUED:   24. NIXON'S HEAD That's it! You just made my list! Fry bends down to help Nixon, but the crazed   GROWLING  President bites down on his arm, latching on. Fry tries to shake him loose. FRY Hey I'm on your side! My dad said I was conceived during your resignation speech",
      "dialogue_count": 0,
      "word_count": 792
    },
    {
      "scene_number": 4,
      "slugline": "INT. MUSEUM - BACK ROOM - CONTINUOUS  Bender hits the bolt button, and the door   LOCKS.   He and Fry looks around to see they are in a smaller room with only a single barred window. Fry tries the bars on the window, with no success. FRY Great, we're trapped. Why would they lock a bunch of heads up like this? Bender points to a sign. BENDER It's the hall of criminals. We see that a row of heads that includes John Dillinger, Manuel Noriega, Dorothy Hamill (other heads for Freeze- Framers include John Gotti in a luxary jar, D.B. Cooper who's jar is empty, and Bonnie and Clyde in a jar riddled with bullet holes. CRIMINAL HEADS [HOOTING AND HOLLERING] / Fresh meat! BENDER Let's turn ourselves in. We hear a   BANGING   on the door. LEELA (O.S.) Give it up, guys. FRY [POINTS] Wait a second! You just have to bend the bars. (CONTINUED) 27.",
      "characters": [],
      "action_text": "BENDER I'm only programmed to bend for construction purposes. What the hell do you think I am, a de- bender? FRY Who cares what you were programmed for?! If someone programmed you to jump off a bridge, would you do it? BENDER I'll have to check. [THINKS, THEN] Yup. Leela   POUNDS   on the door again. FRY Come on, Bender! You have the power to do whatever you want. That's what separates people -- and robots -- from animals. And robot animals. Bender looks up at Fry, as if considering. BENDER You're full of crap, Fry. Bender turns away, accidentally bumping his antenna into a bare lightbulb. There's a loud   ELECTRIC ZAP   as Bender's head pulses with electricity. He suddenly turns back, excited. BENDER   (cont'd) You make a persuasive argument, Fry. (CONTINUED) CONTINUED:   28. Bender grabs a bar in each hand. He begins to pull them apart with tremendous force. BENDER   (cont'd) [STRAINING SOUNDS] FRY Come on Bender, you can do it! Metal   CREAKS   as the bars slowly bend... further and further, until they   SNAP   off completely. BENDER I did it! Look at those 31 degree angles. You set me free, Fry! There's nothing I can't do! He raises the bent bars in victory.   TRIUMPHANT MUSIC   swells. Then both his arms fall off and   CLATTER   to the floor.  FADE OUT:  END OF ACT II CONTINUED:   29. ACT III  FADE IN: INT. MUSEUM - BACK ROOM - CONTINUOUS  Fry is attempting to reattach Bender's arms. BENDER From now on, I'm going to bend what I want, when I want, who I want! [TURNS TO FRY] How those arms coming? FRY Don't worry. I was in A.V. Club. BENDER I don't know how to thank you, meatbag. I'd kiss you, but you'd get electrocuted. Also people might think you're a robosexual. Benders arms   SNAP   into place. Suddenly Leela   KICKS   in the door. FRY/BENDER [FRIGHTENED SCREAMS]  EXT. ALLEY - SECONDS LATER  Fry and Bender climb out the window into an alley. Bender quickly bends the remaining bars to block off Leela. She arrives at the window, but can't get through. Fry and B",
      "dialogue_count": 0,
      "word_count": 669
    },
    {
      "scene_number": 5,
      "slugline": "EXT. DOWNTOWN - CONTINUOUS  They   LAND   in a pile of rungs. Fry dusts himself off, then looks up at his surroundings. FRY [HUSHED] Oh my God...  FRY'S POV  We see the ruins of old New York City. Some buildings (including the Chrysler) lie on their sides, strewn as rubble; others (including the Empire State Building), remain standing and pierce the ceiling at street level. The area is dimly lit by light streaming through cracks high above. A couple of large lizards scramble over the wreckage. BENDER Hey, it's the ruins of everything you ever knew and loved. This must cheer you up. Fry nods for a second, then bursts out   CRYING . FRY It's all gone. Yesterday it was here, and now it's gone. Even the urine smell is gone! It's like some horrible nightmare!  EXT. DOWNTOWN - A FEW BLOCKS AWAY - A LITTLE LATER  Fry and Bender are seated at the steps of the same office building seen in the cold opening. To one side, we see the rusty wheel of Fry's old bike still locked to the lamp post. FRY [SADLY] I've got nothing left. No home. No family. (CONTINUED) 32.",
      "characters": [],
      "action_text": "BENDER No friends. FRY [SNIFFLE] You don't know what it's like to be so alone. He puts his head in his hands and   SOBS   quietly for a beat. LEELA I'll tell you what it's like to be alone. We widen to see Leela standing nearby. LEELA   (cont'd) But you don't see me crying my eye out. FRY [DEFEATED SIGH] Oh, great. LEELA I was abandoned on Earth as a baby. I don't even know what galaxy I'm from. BENDER You want alone? I'm one of only four hundred thousand identical units. LEELA [GRADUALLY BUILDING] I'm a one-eyed woman in a two-eyed man's world.I'm a freak and I'm thirty and I don't (MORE)   (CONTINUED) CONTINUED:   33. have a date for New Year's LEELA   (cont'd) Eve.[FIGHTS BACK A TEAR, THEN QUIETLY] I know how it feels. FRY I guess you do. [SNIFFLES] Leela sits down next to Fry and puts her hand on his. Neither speaks for a beat. Then Bender puts his hand on top of theirs. FRY   (cont'd) [DISGUSTED] What are you doing? BENDER [SHRUGS] I just wanted to be part of the moment. LEELA [ANNOYED] Hey, you stole my ring! BENDER [LOW, QUICK] Sorry. Bender returns the ring. Leela puts it back on. FRY Look, Leela, you understand this world better than I do. If you really think I should be a delivery boy. I'll trust you. Fry holds his hand out. He closes his eyes and winces like he's about to receive a shot. Leela raises the chip installer and moves it towards his hand. Dramatic   MUSIC  starts to play. Suddenly she turns the device around and presses the rear \"claw end\" to her own palm and slowly pulls a chip out. (CONTINUED) CONTINUED:   34. LEELA [SLIGHTLY PAINED NOISE] FRY What are you doing? LEELA I'm quitting. FRY Why? LEELA You gotta do what you gotta do. BENDER Well this calls for a drink. And maybe a smoke. And a quickie lube job. LEELA I'm not sure we should be celebrating. We're all job deserters now. We're unemployed and have nowhere to go. FRY Relax, you just described every other year of my life. BENDER So you're saying we should head for the nearest suicide boo",
      "dialogue_count": 0,
      "word_count": 1209
    },
    {
      "scene_number": 6,
      "slugline": "INT. PROFESSOR'S CONFERENCE ROOM - CONTINUOUS  LEELA Can't we get away in the ship? PROFESSOR [CONSIDERING] I suppose it is technically possible... Leela motions Fry and Bender toward the ship. Bender picks up the Professor and carries him out of the room after them.  EXT. SPACESHIP HANGER - CONTINUOUS  PROFESSOR ...though then again, I am already in my pajamas. I suppose if you give me ten or twenty minutes to move my-- Bender carries him to the ship and the hatch   CLOSES .  INT. PROFESSOR'S SHIP - CONTINUOUS  They rush in, and Fry steps up to an impressive-looking control panel. FRY I'll get us out of here! Fry pulls a lever and presses a couple of buttons. A paper cup drop into a slot in front of him and start   FILLING   with coffee. PROFESSOR Can anyone drive stick? Leela sits down in the pilots chair and tries out the gear shift. The others takes seats and fasten their seatbelts. The ship begins to   POWER UP . They all brace themselves. 41.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 172
    },
    {
      "scene_number": 7,
      "slugline": "EXT. PROFESSOR'S TOWNHOUSE - CONTINUOUS  The police are setting up several terrifying-looking laser Howitzers. URL If they try to take off, give them an ass full of laser.  INT. PROFESSOR'S SHIP - CONTINUOUS  The ship is   SHAKING   as the engines continue powering up. We see Fry holding his cup of coffee. A few drops splash on his lap. FRY Ow! Son of a--  NEW ANGLE  PROFESSOR Don't worry about the warning lights. Those things are always going on and off. LEELA Prepare for lift-off. [CHECKS TIMER] Ten.  EXT. TIMES SQUARE - NIGHT - CONTINUOUS  The crowd watches a giant counter click from 9 to 10. NEW YORK CROWD Nine!  EXT. GREAT PYRAMIDS - NIGHT  The pyramid hovers and rotates (CONTINUED) 42.",
      "characters": [],
      "action_text": "EGYPTIAN CROWD [IN ARABIC] Eight!  EXT. EIFFEL TOWER - NIGHT  The Eiffel Tower now has futuristic fins and tubes on it. PARIS CROWD [IN ENGLISH] Seven!  INT. ALIEN KEG PARTY - NIGHT  Several bizarre aliens watch a timer click from one unrecognizable symbol to another. BIZARRE ALIENS Blglgl!  EXT. PROFESSOR'S TOWNHOUSE  The police man their laser guns SMITTY Prepare to fire.  INT. PROFESSOR'S SHIP  Bender sits stiffly in his chair, looking terrified. He grips his armrests so tightly that they begin to bend.  CLOSE UP - TV  DICK CLARK'S HEAD Five!  INT. ROBOT GET-TOGETHER - NIGHT  Numerous robots stand around holding bottles of beer. ROBOT CROWD [SOME MECHANICAL VOICES] Four! CONTINUED:   43.",
      "dialogue_count": 0,
      "word_count": 234
    },
    {
      "scene_number": 8,
      "slugline": "INT. MUSEUM - NIGHT  There's a party hat perched on Leonard Nimoy's jar. LENARD NIMOY'S HEAD Three.  INT. SHIP - CONTINUOUS  PROFESSOR Two... BENDER One... LEELA Ignition... FRY Blastoff! The spaceship   SHUDDERS.   The roof of the hangar opens and the ship   ROCKETS   upward.  EXT. TIMES SQUARE - CONTINUOUS  The full moon illuminates with a   SPARKLING   \"3000\". NEW YORK CROWD [CHEERS] A massive display of   FIREWORKS   goes off, completely blanketing the sky.  EXT. PROFESSOR'S TOWNHOUSE - CONTINUOUS  NIXON'S HEAD Fire, damnit! Fire! The confused sharpshooters   FIRE   in all directions, hopelessly thrown by the bursts of fireworks. The Professor's ship disappears into the beautiful, swirling colors. 44.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 106
    },
    {
      "scene_number": 9,
      "slugline": "EXT. HIGH ABOVE EARTH - CONTINUOUS  The ship emerges from the fireworks unscathed. It hurtles away from Earth and out into space. FRY/LEELA/BENDER/PROFESSOR (V.O.) [HAPPY CHEERS] The ship passes Mars, Saturn, and Pluto, then moves out into the void; they drift silently past beautiful nebulas. As the ship passes across the screen, we see Fry with his face pressed to the window. FRY (V.O.) [BEAT; THEN, QUIETLY] Whoa.  EXT. PROFESSOR'S TOWNHOUSE - NIGHT  Smitty and Url turn to Nixon's head. SMITTY We failed, Mr. President. We want us to send a killbot and [AIR QUOTES] \"arrest\" them? NIXON'S HEAD No, let 'em go. It's New Year's Eve, goddamnit. I'm issuing a full pardon. C'mon, I'll take you boys out for a slice of poundcake.  INT. SHIP - CONTINUOUS  Fry turns to the Professor. FRY So what kind of ship is this? An adventure ship? (CONTINUED) 45.",
      "characters": [],
      "action_text": "PROFESSOR That's right, it's a cargo ship. It's a little side business I started to fund my research. FRY And what's my job going to be? PROFESSOR You'll be responsible for ensuring the cargo reaches its destination.  EXT. SHIP - CONTINUOUS  FRY (V.O.) [UNSURE] So I'm a delivery boy? PROFESSOR (V.O.) Exactly. FRY [BEAT; THEN] [HAPPY CHEERS]  FADE OUT:  END OF EPISODE CONTINUED:   46.",
      "dialogue_count": 0,
      "word_count": 211
    }
  ]
}