{
  "slug": "game-of-thrones-510-mothers-mercy-2015",
  "title": "game of thrones 510 mothers mercy",
  "genre": "thriller",
  "format": "series",
  "scenes_count": 5,
  "characters_count": 0,
  "characters": [],
  "total_words": 11072,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. STANNIS' CAMP - MORNING  A melting icicle hangs from a tent flap, refracting the rising sun. A rivulet of thawing snow flows from the tent into the camp. A pair of red shoes crosses through it. MELISANDRE walks through the tents, toward Stannis’ command tent. Much of the snow has melted in the night. Melisandre is pleased. The sacrifice of Shireen has paid off. MELISANDRE (SOUND ADVANCE) The Lord of Light has made good on his promise, my king.  INT. STANNIS' TENT - MORNING  MELISANDRE (V.O.) His fires have melted the snows away. The flaming heart of the Lord of Light engulfs the Baratheon stag in Stannis’ sigil -- seen in close-up on his breastplate, as STANNIS BARATHEON finishes putting on his armor. Melisandre is the only other person in his tent. She stands behind him, by the fire. MELISANDRE The way ahead is clear. He does not turn to look at her. He does not want to think about the price he paid for his incipient victory. STANNIS We ride for Winterfell. Melisandre steps toward him, reassuring him.   He tightens the straps on his epaulets. MELISANDRE And you will take it. He believes her. He maintains a single-minded focus on what he is: a King, about to take a major step toward his rightful throne. He straps on his sword belt. He pulls his sword partway from his scabbard, checks its edge, returns it to its scabbard. (CONTINUED) GAME OF THRONES   \"MOTHER'S MERCY\"   EP 510   1.",
      "characters": [],
      "action_text": "MELISANDRE The Lord has shown me Bolton banners burning. She is close to him now. He still does not look at her. He puts on a gauntlet. MELISANDRE You will receive what is yours by right. She reaches for his shoulder. But his purpose has eclipsed everything, even his desire for her. He finishes putting on his second gauntlet and strides forward, out of the tent. After a beat, she follows.  EXT. STANNIS’ CAMP - DAY  Stannis marches through his camp with purpose, Melisandre by his side -- until his forward motion is cut short by a BARATHEON GENERAL who hurries over. BARATHEON GENERAL Your Grace. STANNIS Prepare to form up... But something is wrong. Stannis is confused, thrown off balance by the man’s dire expression in a way he rarely is by anything. He is marching off to victory; his officers are not supposed to have dire expressions on their faces. STANNIS Tell me. BARATHEON GENERAL The men... many deserted before dawn. Stannis stares at him in disbelief. STANNIS How many? The man really doesn’t want to be the one to tell Stannis Baratheon this. BARATHEON GENERAL Nearly half. All the sellswords with all the horses. Stannis looks at Melisandre. Her triumphalism is gone. Another BARATHEON SOLDIER approaches. If possible, he looks even more tense than the first. CONTINUED: (CONTINUED) GAME OF THRONES   \"MOTHER'S MERCY\"   EP 510   2. BARATHEON SOLDIER Your Grace... I... With forbeboding, Melisandre looks between the soldier and Stannis. STANNIS Speak up. Can’t be worse than mutiny. The soldier’s face tells us that it is.  EXT. WOODS - DAY  THREE BARATHEON SOLDIERS (the above man and two others) lead Stannis into the snowy woods beside the camp. The Baratheon general walks by his king’s side. He lets the soldiers lead, at first. Then he sees something. What they brought him to see. He steps between the men and walks ahead of them. They fall back, giving him his space. Following Stannis, we begin to see what he’s seeing: a hint of a human outline, peeking out around the s",
      "dialogue_count": 0,
      "word_count": 7389
    },
    {
      "scene_number": 2,
      "slugline": "EXT. MEEREENESE BATTLEMENTS - DAY  From a vantage point where the Meereenese masters once watched Dany, Jorah and Daario approach their city, Tyrion now watches Jorah and Daario leave it, lighting out north followed by a small contingent of Second Sons. Tyrion stands on the walls of a strange city, on the far end of the world, alone. VARYS (O.S.) Hello, old friend. Tyrion turns, startled, and sees his old chum approaching. VARYS I thought we were so happy together. Until you abandoned me in Volantis. VARYS joins Tyrion at the wall. TYRION I suppose there’s no point asking how you found me? VARYS The birds sing in the west, the birds sing in the east. If one knows how to listen. (gazing over the ramparts) I hear you had many adventures without me. TYRION Someday I’ll write an account.  Travels Through Essos: a Lannister Abroad.  VARYS That will be a great delight for tens of readers. (beat) They tell me you’ve already found favor with the Mother of Dragons. TYRION Well, she didn’t execute me. So that’s a promising start. He nods in the direction of Jorah and Daario. TYRION Now the heroes are off to find her, and I’m stuck here, trying to placate a city on the brink of civil war. (CONTINUED) GAME OF THRONES   \"MOTHER'S MERCY\"   EP 510   33.",
      "characters": [],
      "action_text": "VARYS A city you’ve called home for... how many days? TYRION Any advice for an old comrade? VARYS Information is the key. You need to learn your enemies’ strengths and strategies. You need to learn which of your friends are not your friends. TYRION If only I knew someone with a vast network of spies. VARYS If only. (looking around) A grand old city, choking on violence, corruption, and deceit. Who could possibly have any experience managing such a massive, ungainly beast? Tyrion smiles. TYRION I did miss you. VARYS Oh, I know. A beautiful friendship continues, as the two men watch Jorah and Daario disappearing over the hill, heading towards…  EXT. HILLTOP - DAY  The ground is strewn with burnt and broken bones. DAENERYS TARGARYEN, her beautiful clothes in tatters, stares into the distance.   She has no idea where she is. She turns and sees DROGON stretched out beside her, licking the torn membranes in his wings. DANY We have to go home. She walks over to him and strokes his long neck. DANY My poor sweet thing. Does it hurt? CONTINUED: (CONTINUED) GAME OF THRONES   \"MOTHER'S MERCY\"   EP 510   34. He stares at her with his great golden eyes. There is intelligence there. He stares at her for a beat and then returns to licking his wing. She continues to stroke his neck, gentle, gently, gentleness. DANY We have to go home. Drogon ignores her, far more concerned with his wounds than whatever gibberish she’s spouting. DANY Drogon. Can you take me back to Meereen? She realizes speaking to a dragon is probably insane. She sighs and looks around the bare, lonely hilltop. DANY How far did you carry me? She stands and approaches him. DANY (sterner) Drogon! We need to return. My people need me. Drogon couldn’t care less. Dany decides to take charge of the situation. She tries to climb onto his back. Drogon shifts his position, sending Dany tumbling to the ground. She stands and glares at him. He stares right back at her. He’s not in the mood for flying. DANY You need to heal? Is",
      "dialogue_count": 0,
      "word_count": 638
    },
    {
      "scene_number": 3,
      "slugline": "EXT. GRASSLANDS - DAY  Dany wanders through the grasslands, looking for something to eat or drink. A shudder goes through the grass. It's not a breeze; the ground beneath her feet is thrumming. A rumble, low and ominous as distant thunder. Looking to the horizon, Dany sees a lone DOTHRAKI RIDER crest a rise, his braid black and shiny. He sees her immediately. They stare at each other in silence for a long beat. Two more Riders crest the rise, ten more, hundreds more, thousands, tens of thousands, all on horseback. Surreptitiously, Dany removes one of her queenly rings and lets it drop into the grass beside her. Because she’s very smart. A vast Dothraki horde to end all hordes closes in on Dany. Dozens of them circle her at speed, a vortex of Dothraki screamers and their horses, with Dany in the center, and Drogon nowhere in sight.  INT. CERSEI’S CELL - DAY  CERSEI LANNISTER lies curled up on the thin pallet of her cell. Her hair is dirty and tangled. She is sleep deprived, hungry, thirsty, her lips chapped, her eyes bloodshot. She hears footsteps outside the cell. She hears a key in the lock. She shivers beneath the blanket. SEPTA UNELLA steps into the room and makes the same demand she’s been making periodically for the last several weeks. UNELLA Confess. Cersei closes her eyes for a long beat. When she opens them again we see no trace of the fury, pride and ambition that always drove her before. She is a beaten woman. UNELLA Confess. Cersei nods. GAME OF THRONES   \"MOTHER'S MERCY\"   EP 510   36.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 270
    },
    {
      "scene_number": 4,
      "slugline": "INT. SEPT OF BAELOR - ANCIENT CHAPEL - DAY  Cersei kneels before the HIGH SPARROW, who sits on a simple wooden stool. CERSEI I have sinned. I see that now. How could I have been so blind for so long? The High Sparrow watches her. Slightly amused? Skeptical? Bored? Hard to tell. CERSEI I want to be clean again. I want absolution. Nothing from the High Sparrow. Cersei forges on. CERSEI The Crone came to me with her lamp raised high, and by its holy light I saw-- HIGH SPARROW You wish to make a confession? Cersei wants to say the right thing. She wants to get out of here. CERSEI Once I’ve confessed, will I be free to-- HIGH SPARROW Your Grace will be dealt with according to her sins. Cersei sees no hint of flexibility in the High Sparrow. She lowers her eyes. CERSEI Mother have mercy, then. I lay with a man outside the bonds of marriage. I confess it. HIGH SPARROW Name him. Cersei hesitates. CERSEI Lancel Lannister. HIGH SPARROW Your cousin. And the King’s squire. She nods, staring at the floor. (CONTINUED) GAME OF THRONES   \"MOTHER'S MERCY\"   EP 510   37.",
      "characters": [],
      "action_text": "CERSEI I was lonely. And afraid. HIGH SPARROW You had a husband. CERSEI (a flash of old Cersei) A husband off whoring every chance (he got--) HIGH SPARROW (interrupting) His sins do not pardon your own. She lowers her eyes again, reverts to her meek mode. CERSEI May the gods forgive me. HIGH SPARROW Other men? CERSEI No. HIGH SPARROW No others? Cersei hesitates. She doesn’t know what the High Sparrow knows. CERSEI No. HIGH SPARROW Speaking falsehoods before the gods is a great crime. You understand this? CERSEI I do. The High Sparrow looks at her for an uncomfortably long beat. HIGH SPARROW There are some who say your children were not fathered by King Robert, that they are bastards born of incest and adultery. CERSEI A lie. A lie from the lips of Stannis Baratheon. He wants the throne but his brother’s children stand in his way, so he claims they are not his brother’s. CONTINUED: (MORE) (CONTINUED) GAME OF THRONES   \"MOTHER'S MERCY\"   EP 510   38. That filth... there is no shred of truth to it. I deny it. The High Sparrow stands. HIGH SPARROW Good. Lord Stannis has turned from the truth of the Seven to worship a red demon, and his false faith has no place in these Seven Kingdoms. Cersei nods. This seems like good news. HIGH SPARROW But these are terrible charges, and the realm must know the truth of them. If Your Grace has given honest testimony, a trial will prove your innocence. CERSEI A trial? I have confessed. HIGH SPARROW To a single sin, yes. Others you have denied. Your trial will separate the truths from the falsehoods. CERSEI (lowering her eyes again) I bow to the wisdom of your High Holiness. But if I might beg for just one drop of the Mother’s mercy... I haven’t seen my son... I don’t know how long it’s been. I need to see him. (beat; pitiable) Please. HIGH SPARROW You have taken the first step on the path back to righteousness. In light of that I shall permit you to return to the Red Keep. Cersei begins to cry, honest tears of relief. CERSEI Thank you. ",
      "dialogue_count": 0,
      "word_count": 1409
    },
    {
      "scene_number": 5,
      "slugline": "EXT. NARROW STREET - DAY  The going is slower here. The street is narrow and crowded. The onlookers press in on her now. Some try to grab her but the Faith Militant push them back, keeping a narrow path open for Cersei. UNELLA Shame, shame, shame. BYSTANDERS Whore!/Cunt!/Sinner! Men flash their pricks at her. FLASHER #1 I’m a Lannister! Suck me off! FLASHER #2 Come hear me roar! A HEAVYSET WOMAN gets close enough to Cersei to spit in her face before the Faith Militant can push her back. The Faith Militant want Cersei to make it to the Red Keep alive, but they’re content to let her get abused along the way. And the abuse keeps coming. An egg thrown from on high strikes her in the back, making her flinch, and the crowd cheers the direct hit. Her feet bleed on the cobblestones, her pale skin is covered with excrement, piss, splattered fruit, spittle. She endures a humiliation out of nightmares. But she endures it. She walks on, leaving a trail of bloody footprints on the stones behind her.  EXT. RED KEEP ENTRANCE - DAY  Finally Cersei sees the entrance to the Red Keep. The mob cannot enter; a line of GOLD CLOAKS block the way. Cersei moves faster, running from the horror all about her. She makes it through the doors, away from the jeering crowd and the Septas and the Faith Militant.  EXT. RED KEEP - INNER COURTYARD - DAY  The doors are barred shut behind her. Her uncle KEVAN LANNISTER and GRANDMAESTER PYCELLE stand quite still, making no move to help, staring at her with cold disgust. A dozen LANNISTER GUARDS stand behind Kevan. None of them help Cersei, either. (CONTINUED) GAME OF THRONES   \"MOTHER'S MERCY\"   EP 510   43.",
      "characters": [],
      "action_text": "But QYBURN rushes forward, red cloak in hand, the first friendly face Cersei has seen in miles. He wraps the cloak around her and Cersei finally lets herself weep, undone by this simple act of kindness. She cries into his chest and his arm is around her shoulders. He speaks to her quietly, softly, a father comforting his daughter after she’s awakened from a nightmare. QYBURN Your Grace. It’s good to have you back. Come, we’ll take you inside. I need to have a look at those feet. Cersei nods. She’ll go anywhere Qyburn wants. Qyburn signals to someone off screen. We hear the slap of steel on stone as an armored man approaches. A shadow falls over Cersei and Qyburn. She looks up and sees the biggest man in the Seven Kingdoms, clad in armor that hides all sight of him. QYBURN May I have the honor of presenting the newest member of the Kingsguard. The huge man lifts her as if she were an infant. Cersei stares into the visor of the helmeted beast, trying to see his face. She can’t. He carries her toward the Red Keep, Qyburn walking alongside. QYBURN If it please Your Grace, he's taken a holy vow of silence. He has sworn that he will not speak until all of His Grace's enemies are dead and evil has been driven from the realm. As this monstrous, silent knight carries her away, we see a spark in Cersei's eyes. A spark that the septas and the High Sparrow and hunger and humiliation could never extinguish. It's a spark that says: Vengeance will be mine.  EXT. CASTLE BLACK - DUSK  DAVOS SEAWORTH walks across the courtyard with Jon. They are in the midst of a heated argument. CONTINUED: (CONTINUED) GAME OF THRONES   \"MOTHER'S MERCY\"   EP 510   44. DAVOS Who came to your aid? Stannis. Now he needs you. JON We don’t have enough men to make any difference. DAVOS The wildlings will make (a difference.) JON (interrupting) The wildlings will never fight for Stannis. I told him before-- DAVOS (interrupting) You saved their bloody lives! If they’re gonna live in the Seven Kingdoms, safe ",
      "dialogue_count": 0,
      "word_count": 1366
    }
  ]
}