{
  "slug": "game-night-2018",
  "title": "game night",
  "genre": "action",
  "format": "film",
  "scenes_count": 10,
  "characters_count": 0,
  "characters": [],
  "total_words": 20061,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. PUB - NIGHT MUSIC BLARES.   We move past people drinking, playing POOL, DARTS, BEER PONG and land on... MAX (30’s) sitting with a team in matching T-shirts.   (His says, “CAPTAIN.”)   It’s a rowdy PUB TRIVIA NIGHT.   Max pounds a drink and yells at his team: MAX (slightly slurred) Who cares about winning?!   Let’s get drunk! His team CHEERS.   Max walks over to the BARTENDER, dead sober: MAX (CONT’D) I need four shots of Everclear and four shots of water. (throwing down some bills) Send the real ones to the other team.   Give us the water. The Bartender snorts and starts pouring. TRIVIA EMCEE (O.S.) What former Supreme Court Justice-- MAX (spinning around) Oliver Wendell Holmes! Max’s team CHEERS. TRIVIA EMCEE (annoyed) That is correct.   Again, I’d like to ask the players to allow me to-- MAX --finish the question! His team laughs and cheers again. Across the room, also wearing a “CAPTAIN” shirt, ANNIE (30’s) glares at her TEAMMATES, including BILL, a schlubby guy. ANNIE Come on, guys.   Focus.   This isn’t a game! BILL It literally is. ANNIE Bill, I swear to god--",
      "characters": [],
      "action_text": "TRIVIA EMCEE For triple points: what is the name of the purple Teletubby? The room quiets...   There’s an intense beat then-- MAX Tinky Winky!   * ANNIE Tinky Winky!   * Max and Annie lock eyes, sparks flying. MAX (intense) He always carried a-- ANNIE (unblinking) --red purse.   I know. There is a definite connection here. INT. SUBWAY - NIGHT Max and Annie stand in the middle of a subway car, furiously making out.   The car suddenly comes to a stop and the couple goes FLYING INTO A METAL POLE. In a MONTAGE, Max and Annie WIN different GAME NIGHTS as their relationship progresses: --A SMALL STUDIO APARTMENT, playing the board game RISK with another COUPLE, DAN and LINDA. ANNIE If you take Kamchatka and I take Mongolia, we can trap Linda in the middle. MAX Starve out her army.   Smart. LINDA Hey!   You can’t form alliances. ANNIE Worked for Hitler. They high-five. LINDA You’re high-fiving Hitler?! --In A NICER APARTMENT, playing PICTIONARY.   Max haphazardly DRAWS a RECTANGLE.  2. ANNIE “The Best Exotic Marigold Hotel”! Other players protest.   Max and Annie kiss. --IN THEIR MODEST SUBURBAN HOUSE, playing CHARADES with Bill. Max points to Bill and Annie guesses-- ANNIE (CONT’D) Bill.   Overweight.   Single.   Out of work. BILL What the fuck? ANNIE Hairy? (Max touches his nose) Hairy.   Carry.   Mary. (Max touches his nose) Mary! (Max points to himself) You!   Me! Max gestures to put it together. ANNIE (CONT’D) Marry me! Annie does a crazy/cute victory dance but then: ANNIE (CONT’D) Wait--   What? She turns back and sees Max on one knee, holding a ring. MAX Marry me, Annie. Annie jumps into Max’s arms, laughing and kissing him.   Bill is still stinging from their insults. BILL (half-hearted) Congrats.   Happy for you guys. --AT THEIR WEDDING RECEPTION, Max and Annie play a DANCING VIDEO GAME in their tux and wedding dress.   Dancing in unison, as their score mounts.   The SONG crescendos to... TITLE UP:   “ GAME NIGHT ” INT. WAITING ROOM - DAY CLOSE ON a paper football",
      "dialogue_count": 0,
      "word_count": 1358
    },
    {
      "scene_number": 2,
      "slugline": "INT. KITCHEN - MAX AND ANNIE’S HOUSE - NIGHT Max and Annie enter.   He peeks outside from behind a curtain. ANNIE Now if he sees the others we’re screwed. MAX Well, I told everyone to park far away and sneak in quietly. (then, changing course) Are we being dicks?   Should we just keep inviting him?   It seems like he really wants to play. ANNIE No!   Debbie was our friend.   Gary was just the creepy husband we had to put up with.   And he’s only gotten worse since the divorce. He’s like the butler at a haunted house. MAX Yeah, you’re right.   We don’t actually owe him anything.   He can always find people like himself to play with.   Y’know, other weirdos. Just then, a kitchen window opens and a VERY HOT 20-SOMETHING GIRL, MADISON, crawls in.   Max and Annie regard her. ANNIE Can we help you? MADISON (vocal fry) I’m okay. RYAN, 30’s, hoists himself in after her. RYAN Hey. MAX Why are you coming in the window? RYAN You said to sneak in so Robocop wouldn’t see us. MAX I meant sneak in the door but, okay... could you get your boot off our cutting board? 9.",
      "characters": [],
      "action_text": "RYAN Well, you were super vague about how we should sneak in-- Just then, another window slides open and KEVIN, 30’s African-American, starts climbing inside. ANNIE Jesus.   It’s like “Night of the Living Dead” in here. Kevin helps his wife, MICHELLE, 30’s, African-American, climb in. MICHELLE I am not dressed for this nonsense. KEVIN Yeah, you’re asking a lot of us, Max. MAX I didn’t tell anyone to come in the window. RYAN Guys, this is Madison.   Madison, this is Max and Annie.   Kevin and Michelle. ANNIE Yeah, you brought her last week. (to Madison) You work at Forever 21, right? Ryan gives Annie a “what the fuck” look. MADISON (vocal fry) I work at Sephora. ANNIE I’m confused. MAX (sotto to Annie) Different girl.   Same look, same voice. ANNIE Oh.   Hi.   Nice to meet you. MADISON You too. 10. Madison holds out an awkward limp hand, like a dead fish. Max and Annie try to figure out what to do with it.   Annie shakes it awkwardly.   Max kisses it. MADISON (CONT’D) Do you guys have a bathroom? MAX Yes we do.   Right down the hall. MADISON On the right or the left.   I don’t want to go in the wrong room. ANNIE It’ll be the one with the toilet. MADISON ‘Kay. Madison exits. MICHELLE Where’d you meet her?   At a TED talk? RYAN Don’t judge me.   Brains and personality aren’t everything. KEVIN Aren’t you sick of losing game night every week ‘cause of the dates you bring? RYAN They’re not always bad.  FLASHBACK TO:  --Ryan plays charades.   He frantically mimes a clue for his partner, HOT DATE #1.   We REVEAL she isn’t paying any attention to him.   Instead she’s on SNAPCHAT, taking a selfie with the “licking dog” filter.   On it she’s written “Game night.   Bored AF.” RYAN (CONT’D) Come on, Heather!   How many pictures of you as a dog do you need? The others look embarrassed. --Ryan’s HOT DATE #2 puts down a word in Scrabble and claps happily. 11. ANNIE “Dennis” isn’t a word. HOT DATE Uh, yeah, it is.   It’s my daddy’s name, so... The group roll their eyes. --Ryan and a",
      "dialogue_count": 0,
      "word_count": 5397
    },
    {
      "scene_number": 3,
      "slugline": "INT. HALLWAY - NIGHT Kevin and Michelle are still puzzling over the clue. KEVIN What has shiny fangs that bites white things together? MICHELLE (getting it) A stapler!   The white things are paper! KEVIN Yes!   I would kiss you but I don’t know where those lips have been. She rolls her eyes. MICHELLE Look around for a stapler. They move down the hall and enter INT. BROOKS’ STUDY - CONTINUOUS A windowless room with a skylight in the ceiling.   Lots of bound books, a desk, etc. KEVIN Found one! He grabs a stapler off the desk and opens it.   Inside is a FLASHDRIVE. MICHELLE Here.   Put it in the desktop. Kevin plugs it into the computer and a text box opens. KEVIN Another riddle. MICHELLE (reads) “ I am brown and old by day, white and young by night, my eyes are glass, I have nine faces but no head.   I sing to the sky but I have no voice.   I am everywhere and nowhere--”  KEVIN What the fuck is that?! 41.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 173
    },
    {
      "scene_number": 4,
      "slugline": "INT. MAX’S CAR - NIGHT Annie drives while Max uses FIND MY IPHONE on Brooks’ iPad-- ANNIE Are they still on Route 18? MAX Yup.   We’re catching up. ANNIE Can you imagine Brooks’ face when we find him so fast? MAX It’s gonna be so good.   Y’know, I think I can actually feel my sperm coming back to life. ANNIE Perfect.   We’ll win your brother’s car and then go make a baby in it. MAX Yeah!   And we’ll make him watch us! ANNIE What?   I don’t want to do that. MAX I don’t either.   I don’t know why I said that. INT. BROOKS’ HOUSE - BEDROOM - NIGHT Jillian finishes her call. JILLIAN (into phone) Great.   Thank you. (hangs up) Let’s go.   I got the game company’s name and address. RYAN Yes!   You rock. He goes to hug her.   Expecting a high-five, she puts up a hand.   It’s awkward.   He ends up hugging her hand. INT. HALLWAY - CONTINUOUS Ryan and Jillian head toward the living room.   They pass the study where Michelle and Kevin are.   Ryan stops. 42.",
      "characters": [],
      "action_text": "RYAN Hey, guys, just wanted to wish you the best of luck tonight. Kevin and Michelle look at him quizzically as he shuts the door to the study and PROPS A CHAIR UNDER THE HANDLE. JILLIAN What are you doing? RYAN Oh, being a dick. He heads out.   She follows. INT. BROOKS’ STUDY - CONTINUOUS Kevin tries the door but it won’t budge. KEVIN That son of a bitch. (calling through door) You son of a bitch! He throws his shoulder against the door.   Nothing.   He spots some candles on a shelf. KEVIN (CONT’D) Hand me those matches.   I’m gonna burn down this door. MICHELLE You’re gonna light a fire in a windowless room that we’re trapped in? KEVIN (pouty) Fine.   Don’t hand me the matches. MICHELLE (looking up) What about that? He looks up to see a SKYLIGHT twelve feet overhead.   His eyes narrow. INT. MAX’S CAR - NIGHT CLOSE ON an iPad screen.   The BLIP of Brooks’ phone stops moving, then disappears. MAX Hold on.   Brooks’ phone just disappeared. 43. ANNIE Crap.   Where did you last see it? MAX Corner of 5th and Kenmore. EXT. PARKING LOT - MINUTES LATER They pull into a deserted lot in a sketchy neighborhood. They get out of the car and look around. ANNIE Where could he be? Max notices a dumpster that sits behind an unmarked building. He crosses to it and glances in.   Inside he spots a cell phone.   He retrieves it. MAX Found it.   It’s turned off. ANNIE He must’ve known we were tracking him. MAX Damn it.   They outsmarted us. (noticing) Hang on... He points across the street to where Ponytail is finishing a cigarette outside of a dive bar.   He heads back inside. ANNIE Isn’t that one of the actors? MAX Yeah.   I guess they’re not that smart. They high-five each other. ANNIE We are nailing this!   Come on! They head across the street, instinctively staying low. MAX Why are we crouching? ANNIE I don’t know.   Feels right? 44.",
      "dialogue_count": 0,
      "word_count": 512
    },
    {
      "scene_number": 5,
      "slugline": "INT. DIVE BAR - NIGHT Max and Annie enter, trying to look casual.   There’s a BURLY BARTENDER, a half-asleep DRUNK GUY, and in a corner booth, facing away from them is Ponytail. MAX (sotto, re: Ponytail) There he is.   Don’t let him see you. They take a seat at the bar.   Max signals to the tattooed bartender. MAX (CONT’D) Sir?   You wouldn’t happen to have seen a guy brought in here.   Looks a bit like me with a stronger chin, higher cheekbones. BARTENDER So, a better looking guy? MAX Okay, well, that’s not necessarily-- Annie gives the bartender a look to say “kind of, yes.” BARTENDER I didn’t see nothing. He moves off.   Max’s eyes narrow. MAX “Didn’t see nothing”?   That double- negative felt a bit forced, huh? ANNIE I bet he’s in on it.   Look at how fresh his tats are.   Probably fake. MAX Let’s test him.   We’ll order drinks only a real bartender would know how to make. ANNIE Smart. (calling) Barkeep? BARTENDER Yeah? ANNIE Can I have a vodka tonic, please? 45.",
      "characters": [],
      "action_text": "MAX Really? ANNIE I choked. MAX (to Bartender) I’ll take a Harvey Wallbanger. The bartender looks at him, annoyed.   Then goes to make the drinks. ANNIE This is kinda fun, isn’t it? MAX Yeah.   It is nice to get out of the house.   Y’know, we won’t be able to do this kind of thing when we have a kid. ANNIE Why not? MAX ‘Cause when you have a kid, you stop living for you and you start living for them.   That’s why Brooks has got it made. ANNIE So, what are you saying? Max just shrugs as the bartender sets down their drinks. BARTENDER Vodka tonic.   Harvey Wallbanger. Max takes a sip. ANNIE Did he get it right? MAX I don’t know.   I realize I’ve never actually had one.   But it’s tasty. Tart. Suddenly, Max reacts as Bald Guy exits a back room, locks it, then tosses the keys to the Bartender.   Behind him, we catch a brief glimpse of a man tied to a chair.   It’s Brooks. MAX (CONT’D) Holy shit.   Brooks is back there. We’re about to win this thing! 46. Bald Guy has crossed over to Ponytail.   He has noticed Max and Annie and he’s pointing them out to Ponytail. ANNIE Uh oh.   They made us. MAX You think they’re gonna try and stop us? ANNIE We already know they take their roles pretty seriously.   But the good news is, so do I. She reaches into her purse and pulls out the GUN BROOKS DROPPED EARLIER. MAX What the-- where did you get that?! ANNIE It’s the fake gun Brooks “dropped” in the fight. MAX How do you know it’s fake? ANNIE You think your brother would use a real gun in a fake fight with actors he hired? MAX Good point.   So, what are we gonna do? ANNIE Follow my lead. She gets to her feet and points the gun at the men. ANNIE (CONT’D) (shouting) Any of you fucking pricks move, and I'll execute every motherfuckin' last one of you! MAX “Pulp Fiction.”   Nice. PONYTAIL What the fuck is this? MAX Hand over the keys.   We’re taking my brother. 47. BALD GUY Bullshit. Caught up in her role, Annie gets closer to Bald Guy and aims her gun right at him. ANNIE You know what’s ",
      "dialogue_count": 0,
      "word_count": 2082
    },
    {
      "scene_number": 6,
      "slugline": "INT. BACKROOM - CONTINUOUS They quickly lock the door behind them and turn to Brooks, who is tied to a chair and gagged with tape.   His eyes go wide when he sees them. MAX Oh, look at that face.   That is priceless. ANNIE You did not expect us this early, did you? Brooks frantically grunts and tries to scream through his gag. MAX I’ve gotta capture this moment. He takes out his phone, poses beside Brooks with Annie on the other side and snaps a selfie of the three of them.   Just then, the phone rings.   It’s Ryan.   He shows Annie. MAX (CONT’D) Probably begging for help. He hits “ignore.” MAX (CONT’D) I feel like maybe we should call that company and complain because this wasn’t much of a mystery. Brooks MOANS wildly, practically JUMPING OUT OF HIS CHAIR trying to communicate. ANNIE All right, all right... She yanks off Brooks’ gag. BROOKS (as soon as the gag’s off) THIS ISN’T A GAME! BANG!   Someone begins kicking the door from the other side. MAX Why, because we kicked your ass? BROOKS Max, THOSE ARE NOT THE GUYS I HIRED! 57.",
      "characters": [],
      "action_text": "MAX Oh I get it.   Now you’re trying to change the rules on us? BANG!   The door shakes. BROOKS Listen to me.   I’m not a venture capitalist.   I’m a smuggler! MAX A smuggler?   What the hell are you talking about? BROOKS (scared) I fucked up.   I sold the Bulgarian’s egg to a different guy and now I have to get it back or he’s gonna kill me. MAX Ooh, the Bulgarian’s egg.   Did you trade it for the Maltese Falcon? ANNIE Wait.   This isn’t the end? MAX You said whoever found you got the car.   Game over. BROOKS I’m telling you.   This isn’t a game!   It’s all real! SMASH!   The door starts to splinter. MAX Uh huh.   Those shitty actors are real?   That fight was real? ANNIE This gun is real? She points the gun at the ceiling... BROOKS Annie, stop! ANNIE Oh no.   Bang bang-- She pulls the trigger.   BANG!   A REAL BULLET SHATTERS the hanging florescent light above them. 58. Startled, Annie drops the gun.   It hits the floor and FIRES AGAIN.   BANG! MAX OW! Max looks down at his arm.   It looks okay... until a red circle of blood appears through his shirt.   Annie just shot him.   A stunned beat, then-- ANNIE AAAAHHHHH!!   MAX (CONT'D) WHAT IN THE FUCK!! ANNIE OH MY GOD I SHOT YOU!! MAX YOU FUCKING SHOT ME!!! BROOKS I told you!   Untie me!   Quick! Annie unties Brooks, her hands shaking as Bald Guy and Ponytail burst into the room. They spot the bag with their weapons and go for it as Max, Brooks and Annie run to the rear emergency exit door. Ponytail and Bald Guy retrieve their guns and FIRE in their direction. BROOKS (CONT’D) GO! EXT. DIVE BAR - NIGHT Annie, Max and Brooks sprint across the street to their car, still screaming. MAX You shot me! ANNIE I know!   I feel terrible! Annie runs over to the driver’s side and unlocks it, getting behind the wheel.   Brooks jumps in the backseat as Annie peels out with Max in the passenger seat. Bald Guy and Ponytail race to their van, firing wild shots at the car as they go. ANNIE (CONT’D) STOP!! (another gunshot) STOP DOING T",
      "dialogue_count": 0,
      "word_count": 5738
    },
    {
      "scene_number": 7,
      "slugline": "EXT. ANDERTON ESTATE - NIGHT Max and the others run toward Kevin’s minivan.   Anderton and his guests pour out the door in pursuit.   A soaking wet Boomer leads the charge as our group piles into the Odyssey. KEVIN Come on!   Get in! He floors it and they speed down the driveway and out to the street. INT. KEVIN’S CAR - NIGHT Everyone catches their breath as Kevin speeds along.   Max holds the egg. ANNIE Well, that was unusual. Jillian turns to Ryan who looks dazed. JILLIAN You really saved me back there. RYAN Yeah.   Why did I do that?   It’s like I saw you were in trouble and this feeling came over me.   Like I wanted to help you even if I didn’t get anything out of it. ANNIE Sounds like love, Ryan. RYAN What?   Ew.   No, it doesn’t. JILLIAN Yeah.   Gross, Annie. But as they blow off the moment, we can see both Ryan and Jillian are in uncharted territory. MAX (tense) Two minutes to twelve.   Where’s this bridge? KEVIN GPS says it’s right around here but I don’t see it. ANNIE (points) There it is!   4th Street. 87.",
      "characters": [],
      "action_text": "Seeing they’re passing the bridge, Kevin SLAMS ON THE BRAKES. In SUPER-SLOW MOTION, we see the egg fly out of Max’s hands. MAX Fuuuuuuuuuuuuuuuuuccccckkkkkkk! The egg passes between the front seats and SHATTERS AGAINST THE FRONT WINDSHIELD.   Jewels and enamel fly all over the dashboard.   After a beat, KEVIN Oh my. MAX That’s it.   They’re gonna kill my brother. RYAN Hang on.   Maybe we can fix this... Ryan picks up a few shards of egg and tries piecing them together but they fall apart in his hands. RYAN (CONT’D) This is more fragile than a real egg. (then) Did they specifically say it had to be in one piece? Michelle examines some of the tiny gems on the dashboard. MICHELLE I’m not an expert, but these gems look kinda plastic to me. Max leans forward and examines some of the pieces.   Inside one he notices a small sticker. MAX (reading) “Made in China”?   Is this thing not even real? RYAN Maybe just that sticker was made in China. JILLIAN (quietly) Let’s let them talk. KEVIN Why would the Bulgarian ask Brooks to get him a fake egg? 88. Annie notices something amidst the shattered egg.   A TINY ROLLED UP PAPER.   She picks it up and examines it. ANNIE I don’t think he wanted the egg at all.   I think he wanted what was inside of it. INSERT on the roll of paper.   It’s a list of names and addresses in tiny type.   At the top is a header: “WITSEC.” MAX “WITSEC”?   What is that? JILLIAN We can ask them. She points to the opposite end of the bridge where we can see a black van coming to a stop.   Ponytail and Bald Guy step out, open the rear door and drag out a frightened Brooks. Our group steels themselves as they climb out of the minivan. Ryan scoops the shattered egg pieces into a travel mug. Jillian looks at him. RYAN In case they ask for it. EXT. BRIDGE - NIGHT Max, Annie and the others move nervously to where the thugs stand in the middle of the bridge holding guns on Brooks. BALD GUY You tell anyone you were coming here? MAX No.   I swear.   Listen, we’ve got y",
      "dialogue_count": 0,
      "word_count": 3158
    },
    {
      "scene_number": 8,
      "slugline": "EXT. RUNWAY - CONTINUOUS The totaled car spins out, coming to a halt on the runway. INT. KEVIN’S CAR - CONTINUOUS Max and Annie take a breath. MAX Well, at least I got to drive it for ten minutes. Annie sees the door of the jet open as one of the armed Bodyguards steps out. ANNIE Quick.   Come on! EXT. RUNWAY - NIGHT She jumps out of the car and heads across the tarmac away from the approaching Bodyguard. Max moves to follow but the Bodyguard is already looking in his direction.   Max ducks behind the Stingray just in time. The Bodyguard peers inside the car then heads right toward where Max is hiding. Just as he’s about to find Max, Annie stumbles and makes a noise.   The Bodyguard turns toward the sound as Annie ducks for cover behind a baggage conveyor belt loader parked alongside the tarmac. The Bodyguard toward her.   Annie hides on the other side of the loader as the Bodyguard looks for her.   She and Max lock eyes from their hiding places. Frantic to help her, Max suddenly notices a LARGE CRATE perched at the top of the elevated conveyor belt directly above the Bodyguard. Max points at the crate and silently mouths “turn on the belt.”   She doesn’t know what he’s talking about. He takes out his cell phone to text her: No service. MAX Shit. He gets an idea.   He begins to CHARADE to her.   He holds up three fingers.   It takes a second but Annie gets it. ANNIE (to herself) Three words. 104.",
      "characters": [],
      "action_text": "Max does the first word.   He spins in a circle. ANNIE (CONT’D) Spin.   Turn. Yes.   Second word: he puts one hand on top of the other. ANNIE (CONT’D) On.   Turn on what? Max points to his belt. ANNIE (CONT’D) Belt.   Turn on belt. She catches on.   She sneaks around to the control panel of the loader and finds the activation switch. She’s about to hit it but Max gestures for her to wait.   The Bodyguard circles around the loader.   Annie scurries around it, ducking out of his view. Finally, the Bodyguard returns to the spot beneath the crate. Max signals.   Annie turns on the conveyor... ...which starts up with a DEAFENING GROWL of its gas engine. The conveyor CREEPS UP SUPER-SLOWLY giving the Bodyguard ample time to see the crate and step out of the way as it smashes harmlessly to the ground.   Max throws up his hands. But while the Bodyguard is distracted, he is BONKED in the head by Annie wielding a fire extinguisher she removed from the loader.   He goes down hard. Annie grabs the Bodyguard’s gun and runs to join Max. MAX You saw what I was going for there? ANNIE Of course.   If that guy had been deaf and paralyzed it totally would’ve worked. (re: the gun) You want this? MAX I know I don’t want you to have it, Calamity Jane. He takes the gun and they sneak over toward the jet. MAX (CONT’D) Look.   There’s a hatch on top of the plane!   Maybe I can get the drop on them. 105. Max puts the gun over his shoulder and carefully begins climbing up onto the wing. ANNIE “The drop”?! MAX Get to the hangar.   See if you can find a cop or something.   I’ll be okay. ANNIE (whisper yell) You’re not Jack Reacher! INT. JET - CONTINUOUS THE BULGARIAN We’re sitting ducks here.   Get out there, kill those fuckers and find me another plane! BODYGUARD #2 (re: Brooks) You okay with him? The Bulgarian picks up his knife. THE BULGARIAN Oh, we’ll be fine. As the Bodyguard hurries out of the plane, the Bulgarian approaches Brooks. THE BULGARIAN (CONT’D) No more waiting.   I’m getting my",
      "dialogue_count": 0,
      "word_count": 885
    },
    {
      "scene_number": 9,
      "slugline": "INT. JET - CONTINUOUS The fight spills back into the cabin as the Bulgarian spots the gun Max dropped on the floor.   He clambers toward it. Brooks sticks out his leg and TRIPS HIM AGAIN. THE BULGARIAN Stop tripping me! Max notices a BUNGEE CORD dangling from an overhead compartment.   He grabs it and wraps it around the Bulgarian’s neck.   But the Bulgarian is determined.   He continues to crawl to the weapon as the cord tightens around his throat. Just as his hand grasps the gun, he collapses on the floor, unconscious from lack of oxygen. Max quickly ties him up with the bungee cord so he can’t move.   He cuts Brooks free with the Bulgarian’s knife. The two brothers stand there as they collect themselves. BROOKS Look at that. ANGLE ON the Bulgarian.   Max has wrapped him so his head is nearly in his own crotch. BROOKS (CONT’D) You get a bungee cord in your hand and you go straight to the pervy place, don’t you? Annie hurries onto the plane and hugs Max. MAX You okay? ANNIE Yeah, yeah.   I mean, I’m changed forever but I’m fine. (then) Is that a knife in your bullet hole? MAX It’s nothing.   Listen, I want us to have a baby. ANNIE You sure? MAX Look at us.   We did things tonight we never would’ve imagined we could do.   And we were awesome. (MORE) 108.",
      "characters": [],
      "action_text": "I thought I wanted to be like Brooks but it turns out Brooks is a low-life and a loser. BROOKS Guilty. MAX Plus, think of all the dum-dums having babies out there.   Ours is going to be so much better.   It’ll beat them at everything. ANNIE (getting into it) Totally.   Our baby’s gonna crush every other baby! MAX We’re gonna raise the Jason Bourne of babies. ANNIE But without all the creepy Treadstone flashbacks. MAX Right, no.   Obviously. Brooks starts slow-clapping.   They look at him. BROOKS And that is how you throw a game night. Max and Annie stare. MAX What? BROOKS It went exactly as I planned. (to the Bulgarian) Trevor, you can get up now. Max and Annie exchange an incredulous look and turn to the Bulgarian.   He doesn’t move.   There’s a beat. BROOKS (CONT’D) I’m just fucking with you.   That would’ve been cool though, right? MAX Such a dick. MAX   (CONT'D) 109.",
      "dialogue_count": 0,
      "word_count": 389
    },
    {
      "scene_number": 10,
      "slugline": "EXT. BROOKS’ HOUSE - NIGHT  SUPER: “3 MONTHS LATER”  Max and Annie head toward Brooks’ rented house. INT. BROOKS’ HOUSE - LIVING ROOM - NIGHT Max and Annie enter to find a game night in progress.   Kevin, Michelle, Ryan and Jillian play “Pictionary.”   We see the player at the easel is Gary. They all yell greetings.   Brooks hands Max a drink. BROOKS Thanks for letting me host again. MAX It’s not like we have a choice. REVEAL that Brooks is wearing A BLINKING HOUSE ARREST ANKLE BRACELET. BROOKS Only for another 36 months. Brooks sits down on the sofa and puts an arm around DR. CHIN, the fertility doctor. DR. CHIN Hi guys! MAX Hey, Dr. Chin. KEVIN (re: Gary’s drawing) “The Crying Game”? We see Gary’s drawing is of a man crying. JILLIAN “Boys Don’t Cry”? MICHELLE “Cry-Baby”? Ryan’s phone BUZZER sounds. RYAN Time’s up. GARY It was “The Green Mile.” 110.",
      "characters": [],
      "action_text": "RYAN How is that “The Green Mile”?! GARY That’s me at the Regal Cinema, crying, as I did through much of the film. KEVIN How are we supposed to know that, Gary?! GARY I assume everyone cried during “The Green Mile.” RYAN (whispering to Kevin and Michelle) How long till we can stop inviting him again? BROOKS Who’s next? ANNIE I’ll go. Annie gets up and grabs the pen.   She pulls out her clue, reads it, tosses it behind her, nods for the timer, and starts drawing a bread roll. MICHELLE A rock.   A ball. MAX A burger.   A bun! She nods, then draws an oven around the bun. GARY Wait, is this a motion picture? She ignores him. MAX Baking a bun.   In an oven.   There’s a bun in the oven! Annie touches her nose, smiling.   Max jumps up, celebrating his win, but then: MAX (CONT’D) Wait-- what? He turns to Annie: she’s holding her stomach. 111. MAX (CONT’D) You’re pregnant? ANNIE We did it. Max smiles and hugs her as everyone cheers and congratulates them.   WE MOVE OUT A WINDOW where the happy tableau plays out in the living room. Suddenly, an ominous BLACK VAN pulls to a stop in front of the house as we SMASH TO BLACK.  THE END   * 112.",
      "dialogue_count": 0,
      "word_count": 369
    }
  ]
}