{
  "slug": "game-of-thrones-609-battle-of-the-bastards-2016",
  "title": "game of thrones 609 battle of the bastards",
  "genre": "thriller",
  "format": "series",
  "scenes_count": 4,
  "characters_count": 0,
  "characters": [],
  "total_words": 9876,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. MEEREEN - SLAVER’S BAY - DAY  The ships in the slaver armada bombard the city with their trebuchets. Volleys of flaming projectiles soar over the beach and into the city.  INT. GREAT PYRAMID - PENTHOUSE - DAY  The sound of the impacts and the distant chaos they cause are audible throughout this scene between DAENERYS TARGARYEN and TYRION LANNISTER, adding further pressure to an already pressurized situation. Tyrion flinches each time a projectile lands near the pyramid, because he’s human and it’s a natural human reaction. Dany never flinches. She is not the same woman who flew away from Daznak’s Pit on the back of a dragon. She is changed, changed utterly, a terrible beauty glaring at Tyrion. BOOM! TYRION Despite appearances, I think you’ll find the city’s on the rise -- BOOM! That one was close. TYRION Perhaps we should take shelter. DANY The city is on the rise? TYRION Meereen is strong. Commerce has returned to the markets. The people are behind you-- BOOM! Dany watches Tyrion flinching, regarding him as the snake regards the mouse. TYRION Well, not all the people, of course. No ruler who ever lived had the support of all the people. But the rebirth of Meereen is the cause of this violence. BOOM! (CONTINUED)  GAME OF THRONES   BATTLE OF THE BASTARDS   1.",
      "characters": [],
      "action_text": "TYRION The Masters cannot let Meereen succeed. Because if Meereen succeeds-- a city without slavery, a city without Masters-- BOOM! TYRION --it proves that no one needs a Master. Dany nods. He’s finally starting to make sense. BOOM! Tyrion flinches again, and is a bit embarrassed when he sees Dany coolly regarding him with a slight smile. DANY Good. Shall we begin? TYRION Do we have a plan? DANY I will crucify the Masters. I will set their fleet afire, kill every last one of their soldiers, and return their cities to the dirt. That is my plan. (beat) You don’t approve. Tyrion knows he must tread carefully here. TYRION You once told me you knew what your father was. BOOM! TYRION Did you know his plans for King's Landing, when the Lannister armies were at his gates? BOOM! TYRION Probably not. He told my brother, and Jaime told me. Do you know what wildfire is? (off Dany’s nod) He had caches of it hidden under the Red Keep, under the guild halls, the Sept of Baelor, all the major thoroughfares. CONTINUED: (CONTINUED)  GAME OF THRONES   BATTLE OF THE BASTARDS   2. BOOM! TYRION He would have burned every one of his citizens, the loyal ones and the traitors, every man, woman, and child. That's why Jaime killed him. DANY This is entirely different. TYRION You’re talking about destroying cities. It’s not entirely different. (beat) I'd like to suggest an alternate approach. BOOM! That one hit the balcony. Outside, smoke and fire. Debris flies in through the window.  EXT. PLATEAU OUTSIDE MEEREEN - DAY  An elevated plateau outside the city with good views of both Slavers Bay and the Meereenese skyline. RAZDAL MO ERAZ, BELICHO PAENYMION, and YEZZAN, the slaver envoys from earlier in the season, stand with a dozen BODYGUARDS. Dany stands with Tyrion, MISSANDEI, GREY WORM and a dozen UNSULLIED. Razdal smiles at Dany. RAZDAL Once before I offered you peace. If you had not been so arrogant, you could have returned to your homeland with a fleet of ships. Instead you will flee Slaver",
      "dialogue_count": 0,
      "word_count": 861
    },
    {
      "scene_number": 2,
      "slugline": "EXT. SKIES ABOVE MEEREEN - DAY  She flies past Daznak’s pit, past other landmarks of Meereen, toward the Great Pyramid.  EXT. BASE OF PYRAMID - DAY  Unsullied STRONGMEN roll back the giant stone blocking the entrance to the dragon prison, and hurry the fuck out of the way. We move in slowly on the dark entrance. VISERION emerges into the daylight, smashing the stone entryway on his way out. RHAEGAL follows. They look a lot healthier than they did the last time we saw them. They blink in the strong sunlight. And hear their brother’s calls overhead. They flap their wings, testing. They haven’t flown in a long time. Viserion goes for it taking four quick steps and taking to the air. Rhaegal follows. The first few flaps are halting, but they quickly find their balance again, and head toward their mother and brother overhead.  EXT. SKIES ABOVE MEEREEN - CONTINUOUS  Dany watches them fly towards her, crying their delight in their freedom. She and Drogon lead them across the sky, toward the bay, and the warships.  EXT. GATES OF MEEREEN - DAY  Panicking and disorientated, KATHE, a freed slave, careers into the SONS OF THE HARPY outside Meereen as they continue to mow down any FREEDMEN trying to escape the city. Quickly, she tries to push past them, but she’s not fast enough and they're quite good at butchering unarmed civilians. She’s stabbed in the back and falls to the ground before she can get very far. A sound like distant waves crashing on the shore forces the Sons of the Harpy to turn, en masse. A tsunami of DOTHRAKI SCREAMERS gallops toward them, earning their names with their bloodcurdling screams. 40,000 fighting men on horseback, arakhs raised. And in the front of this blood tide, DAARIO NAHARIS, leading the charge. (CONTINUED)  GAME OF THRONES   BATTLE OF THE BASTARDS   5.",
      "characters": [],
      "action_text": "We don’t see the full attack play out, because the conclusion is foregone. A severed masked head spins into the air.  EXT. SHIP - DAY  The SAILORS and SLAVER MERCENARY SOLDIERS aboard stare up fearfully, as Drogon and the other two dragons head toward the ships. Toward their ship. Three huge dragons, circling in the sky above their ship. Too late, the sailors and soldiers realize what horrible career choices they have made.  EXT. SKIES ABOVE MEEREEN - DAY  DANY  Dracarys . Drogon breathes fire upon the warship. The other two dragons follow suit. It’s an awe-inspiring sight. Three columns of flame, thick as tree trunks, reducing boat and crew to ash in a matter of seconds.  EXT. SLAVERS BAY - DAY  The rest of the Slaver navy gets the message loud and clear. SAILORS abandon ship en masse, jumping into the water and swimming for safety wherever they can find it. Weighed down by armor and weapons, many of them go under.  EXT. PLATEAU - DAY  The Unsullied on the plateau shift their spears to attack mode in one synchronized move. Grey Worm addresses the Envoys’ bodyguards. GREY WORM (in Valyrian) You men have a choice. Fight and die for Masters who would never fight and die for you. Or go home, to your families. Beat. The bodyguards glance at each other. CONTINUED: (CONTINUED)  GAME OF THRONES   BATTLE OF THE BASTARDS   6. They throw down their weapons and run. TYRION (to the envoys) Thank you for the armada. Our queen does love ships. (beat) Now. The last time we spoke we made a pact. You violated that pact. You declared war upon us. And though our queen has a forgiving nature... this cannot be forgiven. The envoys have not quite processed their new reality yet. They look between Tyrion and the Unsullied spearheads, pointed right at their hearts. MISSANDEI Our queen insists that one of you must die, as punishment for your crimes. TYRION It always seems a bit abstract, doesn’t it, other people dying? RAZDAL (pointing at Yezzan) Him! He should die. BELICHO (re: Yezzan) Yes",
      "dialogue_count": 0,
      "word_count": 6814
    },
    {
      "scene_number": 3,
      "slugline": "EXT. BATTLEFIELD - JON MOMENT  Fighting his way out, Jon clambers to the top of the body pile where he has a perfect view of the carnage: Bolton men in red X helmets, grinding up Starks in an atrocity mill. The crush of men desperately trying to stave off the inevitable. The Bolton soldiers have finally worked out how to deal with their giant problem. It requires the force of two men per pike but they surround Wun-Wun and spear him like a woolly- mammoth.   Wun-Wun fights back but the odds are overwhelming. It’s only a matter of time now. The battle is lost.  EXT. BATTLEFIELD - RAMSAY MOMENT  Atop his horse, Ramsay takes in the lay of the land: The pile of the dead. The Stark forces enclosed by the body pile and the Bolton infantry. A tightening circle of flesh and steel that will inevitably kill the Stark forces. Ramsay has a moment of deep contentment. And his contentment turns to confusion as a war horn sounds in the distance.  EXT. BATTLEFIELD - TORMUND MOMENT  The war horn sounds again, and Smalljon makes the mistake of looking to its source. The instant of distraction is all the battered Tormund needs to sink his teeth into Smalljon’s ear. Smalljon roars with pain as Tormund rips his ear off, and releases his grip on Tormund, who grabs a dagger from his belt and pops Smalljon’s eyes like eggs.  EXT. BATTLEFIELD - JON MOMENT  The Vale horn sounds again. Jon sees the source of the war horn: The VALE CAVALRY is emerging from the woods flying the House Arryn sigil, two thousand strong, galloping against the glare of the sun as it rises above the treetops.  EXT. BATTLEFIELD - RAMSAY MOMENT - DAY  Ramsay sees the Vale cavalry riding in to ruin his day.  GAME OF THRONES   BATTLE OF THE BASTARDS   34.",
      "characters": [],
      "action_text": "EXT. TREELINE - SANSA/LF MOMENT  High above the battlefield from the safety of the treeline, two spectators watch from horseback: Sansa. And LITTLEFINGER. Below them, the Vale cavalry rushes toward the Bolton flank. We see all this from above, through the magic of VFX: The Bolton circle dissolves as if by centrifugal force as the Vale cavalry approaches.  EXT. BATTLEFIELD - RAMSAY MOMENT  Ramsay sees all this from his vantage point. He may be furious, but he is smart: he knows it’s all falling apart. He turns and looks at Jon, atop the body pile. A beat where the two glorious bastards glare at each other from a distance.  EXT. BATTLEFIELD - JON MOMENT  Jon glares at Ramsay.  EXT. BATTLEFIELD - RAMSAY MOMENT  Ramsay doesn't sit and wait for checkmate. He whistles to two remaining generals. He turns to ride for the castle, and his generals follow.  EXT. BATTLEFIELD - JON MOMENT  Tormund comes up beside Jon on the body pile, with Wun-Wun behind him. In the background the Vale make short work of the already weary Bolton army. Together, they see Ramsay getting away.  EXT. TREELINE - SANSA/LF MOMENT  From Sansa’s high and wide perspective, we see Jon, Tormund and Wun-Wun tearing after Ramsay, with Wun-Wun in the lead. But Ramsay will get to Winterfell first. Even from this distance, Sansa knows who she’s watching. The situation does not look good to her.  GAME OF THRONES   BATTLE OF THE BASTARDS   35.",
      "dialogue_count": 0,
      "word_count": 554
    },
    {
      "scene_number": 4,
      "slugline": "EXT. WINTERFELL COURTYARD - CONTINUOUS  A reserve force of Bolton men has remained in Winterfell, and three of these close the gate behind Ramsay. BOLTON ARCHERS man the walls. Ramsay makes the best of the situation, speaking to his general as he dismounts. A SQUIRE takes his horse’s reins and leads it away, just beyond the courtyard arch. RAMSAY Their army is gone. BOLTON GENERAL Our army is gone. RAMSAY We have Winterfell. They don’t have the men for a siege. All we have to do is wait. Some commotion on the walls draws Ramsay’s attention. A few archers start firing. A loud   boom , as something hits the gate. The archers manning the battlements over the gate signal for the archers in other positions to come and help them.  Boom. Boom. Boom. BOOM . The first hole appears in the gate, made by Wun-Wun’s cinderblock fist. Seeing the giant’s fist, Ramsay understands. All the archers have come around to the battlements overlooking the main gate, firing down at the giant. Still the hammering continues, as Wun-Wun batters down the gate, splintering its ancient wood.  EXT. WINTERFELL COURTYARD - DAY  Ramsay backs away, leaving his increasingly terrified soldiers to defend the gates alone. Up on the battlements the archers rain arrows down on the unseen giant beyond the wall. We hear Wun-Wun roar and the huge gates rattle with every impact. More holes appear. Wun-Wun is breaking through; we see his bloody face through the shattered boards. There’s not much fight left in him, but he spends it all here. (CONTINUED)  GAME OF THRONES   BATTLE OF THE BASTARDS   36.",
      "characters": [],
      "action_text": "He starts smashing into the compromised gate with his shoulder.   Smash, smash, smash.  Archers in the courtyard shoot at Wun-Wun through the holes in the door. Wun-Wun howls and his siege stops abruptly. Silence follows. Is it over? Yells from the archers above suggest the contrary. A series of thunderous footsteps and Wun-Wun finally comes crashing through the gate into the courtyard, covered in so many arrows he looks like a porcupine. Wun-Wun falls to his knees, his blood seeping into the dust. Wildling archers and Northern infantrymen stream in around him. The Bolton archers have no more cover and the wildlings are great shots. Bolton archers get a few Stark loyalists, including a hapless MORMONT INFANTRYMAN but the Bolton archers are not long for this world. Tormund and Jon enter the courtyard. As the wildlings clean up the Bolton archers, Tormund and Jon go to Wun-Wun, who is gasping, his lungs penetrated by arrows. And from the far end of the courtyard, an arrow drills deep into Wun-Wun’s eye, a foot from Jon’s face. Wun-Wun collapses to the dirt. Jon and Tormund look to the source of the kill shot: Ramsay Bolton, standing beneath the archway with its defaced direwolf relief. Bow in hand, quiver on his back. Jon is wounded, exhausted. Only hate keeps him standing. RAMSAY You suggested one-on-one combat, didn’t you? I’ve reconsidered. I think that sounds like a wonderful idea. Jon takes an unsteady step toward Ramsay. Tormund speaks low: TORMUND Don’t. Jon doesn’t hear him, or doesn’t listen. He stoops to pick up the Mormont man’s shield, and walks toward Ramsay. Ramsay pulls and arrow, nocks, draws and shoots. Jon catches the arrow with his shield. He lowers the shield and keeps walking, and gains focus as he goes. CONTINUED: (CONTINUED)  GAME OF THRONES   BATTLE OF THE BASTARDS   37. Ramsay pulls another arrow, more hurried this time. He nocks, draws, shoots. Jon blocks; the arrow punches through the shield, its point an inch from Jon's face. Jon keeps walk",
      "dialogue_count": 0,
      "word_count": 1647
    }
  ]
}