{
  "slug": "geostorm-2017",
  "title": "geostorm",
  "genre": "sci-fi",
  "format": "film",
  "scenes_count": 13,
  "characters_count": 11,
  "characters": [
    "HANNAH'S VOICE",
    "HANNAH",
    "HECTOR",
    "CNN ANCHOR",
    "VOICE",
    "DEKKOM",
    "KAGAWA",
    "MAX",
    "DUSSETTE",
    "JAKE",
    "UTE"
  ],
  "total_words": 25767,
  "total_dialogue": 13,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. SPACE - INTERNATIONAL SPACE STATION IV - SAME  Just below the BAY DOORS a HATCH beneath the craft opens up  and another satellite, exactly like the one retrieved, is  SHOT OUT of it, hurtling away from the craft.  INT. ISS - RETRIEVAL BAY - CONTINUOUS  Workers remove several large PANELS off the side of the  recovered satellite as MAKMOUD HABIB, East Indian, early  30's, nervously rushes over.   Another TECH moves over to help  and Makmoud dismisses him.  MAKMOUD  I've got it.   Please go make sure  they depressurize the fuel intake.  The Tech nods in agreement and moves on.   Alone, Makmoud  pulls out his HoloFrame but doesn't snap it open.   Instead  he presses it against a contact point on the panel.  Making sure no one is watching, he pulls out an RFID badge  from his pocket and presses it against another contact point.  Several lights BLINK on the folded HoloFrame.   When all the  lights turn GREEN, he quickly pockets it and moves over to a  nearby table.   Picking up an armful of papers and binders,  he exits.  INT. ISS HALLWAY - SAME  Nervous and sweating, Makmoud hurries down the narrow  corridors winding through the station.  INT. ISS - MEN'S LOCKER ROOM - CONTINUOUS  Makmoud tries to disguise his anxiety as he makes his way  through the crowded locker room.   A dozen SCIENTISTS and  ENGINEERS are in various states of dress; one shift ending,  another beginning.  Stopping at a locker, Makmoud dumps several binders inside.  He closes the locker, turns, and locks eyes with a rugged,  humorless man - RAY DUSSETTE, French, 40's, tough.  Makmoud tries his best to force a casual nod and moves off.  Dussette eyeballs him with suspicion.  INT. ISS - RECREATION ROOM - MOMENTS LATER  We're starting to get an idea of how big this place really  is.   In the Rec Room people shoot pool, play video games,  watch television, read hologram books on couches, etc.  9.  (CONTINUED)",
      "characters": [
        "HANNAH'S VOICE",
        "HANNAH",
        "HECTOR"
      ],
      "action_text": "Makmoud enters and hurries through the crowd.   A young,  Cockney, geek-ish technician, DUNCAN TAYLOR, playing video  games, waves him over.  DUNCAN  Makmoud!   Sorry mate, I'm about to  obliterate your record.  MAKMOUD  I have to do some re-coding.  Perhaps later.  Duncan goes back to his game as Makmoud heads through a  doorway.  INT. NARROW HALLWAY - MOMENTS LATER  Hustling through this narrow hallway, Makmoud's jog evolves  into a run.   Suddenly, a doorway several yards ahead SLAMS  SHUT.   A RED LIGHT goes off as the door SEALS and LOCKS.   A  warning alarm goes off.  Quickly Makmoud takes out his RFID badge and places it on the  lock, but the word \"OVERRIDE\" appears on the door lock.  Makmoud fears the worst.   He panics, turns and heads back  the other direction.   Before he gets far, another door SLAMS  SHUT in front of him, trapping him inside.  Makmoud whips his head around in time to see the ACCESS PANEL  DOORS BLOWING AWAY, one by one,   EXPOSING THIS SECTION OF  HALLWAY TO OUTER SPACE .  Immediate decompression.   Panicked, Makmoud backs away from  the exposed doorways but the effects of exposure happen  quickly.  His body starts to convulse, THE BENDS.   His body begins to  BLOAT as he SCREAMS OUT IN PAIN.  We PULL OUT through an open access door, farther and  farther...  EXT. SPACE - INTERNATIONAL SPACE STATION IV  Makmoud's SCREAM continues as his image gets smaller and  smaller as we see the ISS IV in its entirety.   We CRANE UP  around the craft, seeing it from an angle we haven't seen  before.  As we LIFT UP we notice hundreds   if not thousands of  SATELLITES below the Space Station, completely surrounding  the EARTH below.   It's a breathtaking sight.  10.  CONTINUED:  (CONTINUED) HANNAH  Sight!!   I meant \"Line of Sight\".  The Teacher smiles and jots his answer down as the parents  applaud again.   Hannah sighs, glad it's over.   Jake beams.  JAKE (O.S. PRE-LAP)  A \"C+\"!?!  INT. SCHOOL HALLWAY - LATER  Jake has cornered the Teacher, is in his ",
      "dialogue_count": 3,
      "word_count": 2122
    },
    {
      "scene_number": 2,
      "slugline": "INT. ELECTRIC SMART CAR - CONTINUOUS  Nearly faint from heat, Hector reaches over for his glove  compartment. The metal door handle BURNS his hand.   Before he  can even scream out, he SWERVES OFF THE ROAD to avoid two  cars in front of him that COLLIDE.  Another FIRE TORNADO erupts.   Hector PUNCHES the accelerator  to avoid driving into it.   He moves back onto the clear road,  not much traffic in front of him.  He checks the rear view mirror and SEES, a city on fire  behind him, buildings crumbling and FLAMES everywhere.  Relatively safe as he distances himself from the disaster  behind him, Hector breathes a sigh of relief when suddenly,  WHOPPP , all the windows INSTANTLY CLOUD OVER WITH  CONDENSATION; no visibility in ANY DIRECTION!  Hector SLAMS the brakes as the Smart Car goes SKIDDING and  SPINNING across the roadway.   Finally the car comes to a  stop.   A terrified Hector tries to wipe the windows with his  hands, but the condensation is TOO THICK.  The thermometer catches his eye; the numbers DROPPING  rapidly, below 100 degrees and descending quickly.   Unable to  see outside, Hector cautiously opens the car door and exits.  EXT. ROAD - JUST OUTSIDE OF CITY - CONTINUOUS  Hector emerges from his car, notices several other drivers  doing the same. Everyone's cars have fogged up, everyone  sharing looks of horror and awe.  P.O.V. HECTOR - RIO DE JANEIRO  Rio burns. Several more FIRE TORNADOES dance across the land.  But where Hector and the others stand, the air is cool and  breezy.   One very large FIRE TORNADO catches his eye as it  climbs higher and higher, up into a cloud.  Hector reaches into his glove compartment and retrieves a  pair of very high tech binoculars.  P.O.V. THROUGH LENSES  Telemetry scrolls on the side as we ZOOM IN higher and  higher, following the flame as it rises impossibly high into  the atmosphere.  18.  (CONTINUED)",
      "characters": [
        "CNN ANCHOR",
        "VOICE",
        "DEKKOM"
      ],
      "action_text": "DEKKOM  No, Sir.   Assistant Deputy Lawson  was just leaving.  MAX  Sorry, I didn't realize you... I'm  just gonna go...  President Litton smiles.   Turns to Dekkom.  PRESIDENT LITTON  Bring him.  DEKKOM  To the debrief?  PRESIDENT LITTON  He's the new Assistant Deputy  Secretary.   He's gotta learn your  job sometime.  The President turns and continues down the hall, the staffers  on his heels.   Dekkom shoots daggers at Max.   Sheepishly, Max  smiles and follows the group.  INT. HALLWAY OUTSIDE OF SITUATION ROOM - MINUTES LATER  As the group marches towards the Situation Room, Max spots  some angry looking Generals standing nearby.   Max leans close  to Dekkom.  MAX  Brass always look this peeved?  DEKKOM  They've been pissed ever since  Climate Change took over as our  greatest national threat.   Suddenly  the nerds became the most important  guys in the room, and the jocks  don't like it.  (pointedly)  How'd ya think a keyboard jockey  like you got to be in the Defense  Department in the first place?  Dekkom smiles as Max nods nervously to a four star General he  passes as the group enters the situation room.  INT. SITUATION ROOM/WHITE HOUSE - LATER  President Litton sits at the center of a long oval table  surrounded by large screens.  20.  CONTINUED:  (CONTINUED) Seated beside him are the   Secretary of State, Dekkom,  several other top CABINET MEMBERS and several GENERALS.  Max sits with several lower ranking military officers on  folding chairs in a corner of the room.   GENERAL HAROLD  WHICKHAM, 50's, dry and solid, leads the debrief.  Behind him, on the large screens, we see a replay of the  opening scene from helmet cams and satellite video imagery.  GENERAL WHICKHAM  ...When the team passed through the  dust storm, they arrived at the  village of Kandestnar.  On the SCREENS we once again see the FROZEN VILLAGE from the  many camera angles of the soldiers as they enter the town.  Seeing the frozen citizens of the village, President Litton  gasps, the imag",
      "dialogue_count": 3,
      "word_count": 4208
    },
    {
      "scene_number": 3,
      "slugline": "EXT. LAUNCH SITE - ROCKET SHIP - LATER  The launch site for Kennedy Space Center.   As we HEAR the  ominous countdown, we see the rockets fire... there is  nothing like a night launch.  As the spacecraft lifts off amid balls of smoke and fire, we  PUSH IN....  INT. SHUTTLE MODULE - SAME  Jake Lawson strapped in... his body shakes with the rumble of  the launch... his face is pensive, almost worried, but  then... a smile... a kid on his first flight.  EXT. HANNAH'S HOUSE - SAME  We can SEE Hannah, upstairs, her telescope pointed out her  bedroom window.   She leans close, looking for her father.  HANNAH'S P.O.V. - THROUGH TELESCOPE  We see Jake's shuttle in the distance as it darts up beyond  the clouds.  INT. NASA COMMAND CENTER - MISSION CONTROL - SAME  We SEE Jake on a monitor.   Technicians work the computers,  monitoring every moment of Jake's trip.   Mike steps up to the  comm.  MIKE  In about five seconds you should be  able to see the Testudo Net.  INT.\\EXT. SHUTTLE MODULE - SPACE - SAME  Jake looks up from the comm and out the bay windows.   Sure  enough, there it is in all its glory:  THE TESTUDO NET  The thousands of satellites surrounding and encompassing the  Earth.   The Shuttle gently passes through the net.  Up close, we see the incredible satellites as well as the  brilliance of the aluminum connective materials that both  bind the satellites together and reflect sunlight away from  the planet.   An engineering marvel.  Seeing it this closely has an enormous impact on Jake.   Just  then the International Space Station comes into view.   Jake’s  jaw drops.  38.  (CONTINUED)",
      "characters": [
        "KAGAWA"
      ],
      "action_text": "The Shuttle approaches this amazing city in space.   It’s  overwhelming.  JAKE  (sotto)  My God.   It's... incredible.  MIKE  You're surprised?   Didn't you build  that thing?  JAKE  In sections.   I've never seen it  all put together.   Up close it's...  different.  EXT. SHUTTLE BAY - INTERNATIONAL SPACE STATION - SAME  Enormous Bay Doors open as the Shuttle approaches.   As it  lands inside we see dozens of other Shuttle-type crafts;  different shapes, sizes, marked by their countries of origin.  The Bay Doors close and the airlocks kick in.  INT. SHUTTLE BAY - INTERNATIONAL SPACE STATION - SAME  Ute Fassbinder marches over and meets Jake as he climbs out  of the Shuttle.  UTE  Mr. Lawson, good to see you.   I  trust your journey was uneventful.  JAKE  Not exactly how I'd put it.   You  look different in person.   Taller.  Ute leads Jake towards the exit.  UTE  Things are not always as they seem.  Ute walks ahead.   Jake follows, checking her out.   Likes what  he sees.  INT. RECREATION ROOM - SPACE STATION - MINUTES LATER  Ute and Jake enter to find GOJI KAGAWA, 30’s, a Japanese  version of Jack Black; Ray Dussette; Duncan; and ALUKO, late  30’s, a tall, beautiful, African woman.  UTE  This is the team assigned to help  in your investigation.  39.  CONTINUED:  (CONTINUED) They don't stand when they see Jake coming.   Jake can sense  their resentment.   Ute makes introductions.  UTE (CONT’D)  Mr. Lawson, this is Goji Kagawa, he  oversees the robotics unit.   Ray  Dussette, Security and SatComm.  Duncan Taylor, systems analyst.  And finally, Eni Aluko, our lead  structural engineer.  No one says a word, just hostile stares.  JAKE  You guys have a problem with me  leading this investigation?  KAGAWA  Just wondering why they put the  construction coordinator in charge.  JAKE  You and me both, kid.   But they did  and I expect you all to respect  that.  DUNCAN  And why should we?  Jake tries hard to come up with a retort. Finally--  JAKE  I got nothing.  UTE  You are ",
      "dialogue_count": 1,
      "word_count": 2883
    },
    {
      "scene_number": 4,
      "slugline": "EXT. STREET - BRAZIL - SAME  The Soldiers reach the cab just as it begins to roll away.  Rico pushes them aside and peers into the cab - seeing no  one, he directs the Soldiers to follow him down the street  the other way.  Hector pops up from the DRIVER'S SEAT FLOOR - looks through  the back window as the cab drives off.  CUT TO:  INT. SPACE STATION - MANUFACTURING HULL - MORNING  A forklift dumps the last of the Satellite debris onto the  floor in front of Jake and his team.   They stare at the  wreckage in disbelief.  JAKE  Think we can retrieve anything out  of the hard drives?  DUNCAN  If there's flash memory left in the  components.   But, I mean, look at  it, Gov.  ALUKO  Even if we find code corruption,  how do we know it wasn't caused in  the wreck?  Duncan turns towards Kagawa.  DUNCAN  If your bleedin' robots didn't  malfunction we--  KAGAWA  It's not my robots fault!  DUNCAN  It fell all by itself, did it?  KAGAWA  Don't blame this all on me!  There's not a damned part of this  ship that hasn't had malfunctions.  NOTHING works, okay!   Air locks  shut down, anti-gravity portals  malfunction and fucking access  panels blow out for no reason!  Jake turns, gets an idea.  52.  (CONTINUED)",
      "characters": [
        "MAX"
      ],
      "action_text": "JAKE  What did you just say?  KAGAWA  Nothing works on the ship you  built?  JAKE  Satellites, air locks, anti-gravity  portals and access panels.   What do  they all have in common?  Duncan is the first to catch on.  DUNCAN  They all use the same operating  system for command codes.  UTE  So if we find the same corruption  in any of them that we found in the  satellite, we can trace back the  source.  KAGAWA  Well we ain't gonna find anything  in the crane.   It's totalled.  ALUKO  The Air locks and anti-gravity  portals that failed have already  been flushed and replaced.  JAKE  What about the access panels that  blew.  DUNCAN  Halfway to Andromeda by now.   Blew  right off the ship, they did.  DUSSETTE  Not all of them.  Everyone turns to Dussette who's already over at a wall  monitor, punching up some security video.  DUSSETTE (CONT’D)  When I was reviewing the video of  the accident that killed Makmoud, I  saw that one of the panels that  blew got trapped onto the bottom of  the comm tower.  53.  CONTINUED:  (CONTINUED) We SEE a replay of the access panels blowing off the ship.  One camera FOLLOWS one of the panels as it bounces off the  surface of the ship and wedges into a TOWER on the far end.  DUNCAN  I'd wager it's a pile of rubbish  just like this Sat and crane.  Dussette FREEZES the image and ZOOMS IN.   We can see that  part of the door is intact.  JAKE  Look!   The seal locks are intact.  If we're lucky the last commands  are still in the flash memory.  CUT TO:  INT. RIO DE JANEIRO-GALEÃO INTERNATIONAL AIRPORT - NIGHT  A nervous Hector dials at a pay phone.   He puts it to his  ear, then spies TWO ARMED FEDERALES moving through the gate  area.   He tries to make himself invisible by backing into a  corner.  MAX (ON PHONE)  Hello?  HECTOR  (into phone, sotto)  Max, thank God.  INT. WHITE HOUSE - CONTINUOUS  Max is walking down a corridor.  MAX  (into phone)  Hector?   Good news.   I'm bringing  in your Satellite--  HECTOR (FILTERED)  --Not on the phone,",
      "dialogue_count": 1,
      "word_count": 1796
    },
    {
      "scene_number": 5,
      "slugline": "INT. SPACE STATION - AIRLOCK - CONTINUOUS  Ute and Jake tumble back inside the Space Station, the  airlock hatch shutting behind.   Once locked, Dussette and  some workers rush inside.  DUSSETTE  Get them out of their suits, I'm  going to get that hatch repaired.  Dussette exits the airlock as the Workers begin the process  of removing Jake and Ute's EVA suits.  And then a LOUD RUMBLE.   Everyone turns in time to see the  ACCESS PANEL DOORS BLOW OUT just like with Makmoud.  Two WORKERS are EJECTED INTO SPACE.   ANOTHER ONE IS HANGING  ON, BUT HER BODY QUICKLY EXPLODES FROM THE EXPOSURE.  Ute and Jake hold onto the ship -- the fact they're still in  their suits the only thing keeping them alive.   BUT JAKE'S  SUIT IS LOSING PRESSURE.  UTE  Hold onto me!  Jake does and Ute makes her way toward the airlock exit...  when another RUMBLE IS HEARD AND MORE OF THE WALLS BEGIN TO  IMPLODE.  Ute gets Jake out of the Air lock just as a huge section of  wall CRASHES DOWN WHERE THEY WERE.  INT. SPACE STATION - MIDDECK - CONTINUOUS  Ute rips her helmet off, does the same for Jake.   He doesn't  look good.   Another RUMBLE.   Dussette bursts in.  DUSSETTE  Are you alright?  UTE  He's not well.  JAKE  I can make it.  Dussette helps Jake out of his suit and the three try to get  through the next portal door as pieces of the interior crack  and break all around them.  Ute stumbles, Dussette picks her up.   They get through  another portal.  61.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 256
    },
    {
      "scene_number": 6,
      "slugline": "INT. SPACE STATION - HALLWAY - CONTINUOUS  Ute, Jake and Dussette.   EVERYTHING STILL SHAKING LIKE AN  EARTHQUAKE.   Kagawa, Aluko and Duncan appear.  UTE  Status report.  KAGAWA  Status is fucked!  ALUKO  There was a malfunction in the air  lock.   We're overriding it.  And the rumbles stop.   Everyone exhales.  KAGAWA  Oh my God, oh my God.  DUNCAN  But you lost the door panel, so  that means no drive codes, right?  Ute is about to answer, when Jake interrupts.  JAKE  Yeah, that's right.   We lost 'em.  Ute shoots him a look.   Doesn't know why he's lying but goes  along.  DUSSETTE  So we are back to square one.  Everyone is deflated.   Ute is still trying to figure out  Jake.  CUT TO:  EXT. GEORGETOWN - DAY  The heart of Georgetown.   People on the streets, having lunch  on patios, music plays.   Not a storm cloud in the sky.  Max walks along the cobblestones, eyeing a corner place  called CONNELL'S.   Max pauses, smiles when he sees --  Hector steps out from behind Connell's.   He looks nervous,  unsure.   Max starts toward his friend.  A group of people exit Connell's.   Led by a GUY IN A RED  HOODIE, they're loud, rowdy.   A black SUV comes around the  corner just as --  62.  (CONTINUED)",
      "characters": [],
      "action_text": "The group of rowdies stumble into Hector, and he's pushed  STRAIGHT INTO THE SUV'S PATH!  The SUV slams into Hector, CATAPULTING HIS BODY UP AND OVER  THE VEHICLE.   HE SLAMS DOWN ON THE STREET.  People scream.   The SUV pulls over down the street.   Max gets  to Hector - bones broken, blood everywhere, barely alive.  Hector tries to speak, but only blood escapes his mouth.  MAX  Call 9-1-1!  In the ensuing chaos and people crowding around to help, Max  catches a glimpse of the guy in the red hoodie climbing into  the SUV before it rolls away.  HECTOR  (barely audible)  Max...  MAX  Hang on, buddy.   Hang on.  Hector grabs Max, pulls him close.   Dying words...  HECTOR  Alcon... Pentagon servers.   It's  all about Alcon...  Hector convulses and dies.  MAX  Hector!  Sirens in the distance as we CRANE UP AND BACK on the scene.  CUT TO:  INT. SPACE STATION - HALLWAY - LATER  Ute races to catch up with Jake.   They walk with purpose.  UTE  Why did you lie to them?  JAKE  You think all that was just one  coincidence after another?  UTE  What are you saying?  63.  CONTINUED:  (CONTINUED) JAKE  Someone just tried to kill us.  UTE  Not one of our--  Jake stops, turns to Ute.   Pulls the drive out of his pocket.  JAKE  I don't know who.   But someone  didn't want us seeing what's on  these drives.   So for now, I don't  trust anyone.  UTE  You trust me.  Jake turns away from her and walks off.   Ute follows.  INT. UTE'S LAB - SPACE STATION - LATER  A small science lab.   Ute locks the door while Jake examines  the contents of the drives, which are now hooked up to  several machines.   A screen above shows the findings.  UTE  We will be safe in here.   This is  my private lab.  JAKE  I love what you've done to the  place.  (seeing something)  Holy shit.  Ute rushes over to see.  UTE  You found a match to the  corruption?  JAKE  There's no corruption in here at  all.  UTE  And that's bad?  JAKE  What is in here are the last  command codes that were sent.  These doors didn't ac",
      "dialogue_count": 0,
      "word_count": 948
    },
    {
      "scene_number": 7,
      "slugline": "INT. MAX'S WASHINGTON TOWNHOUSE - CONTINUOUS  He locks the door behind him and rushes down into his  basement.  INT. BASEMENT - MAX'S TOWNHOUSE - CONTINUOUS  Max has some very sophisticated computer equipment here.   He  pulls a flash drive out of his pocket and plugs it into his  system.  A life sized HoloFrame comes off the wall and a somewhat  smaller version of JAKE appears in 3D.   Max hits PLAY.  JAKE (FILTERED)  Someone   might think that we   just  lost focus but we   tried   our  damnedest and best   to   recover the  information.   I would   kill   to get  it back.   All of   us   regret it.  Max PAUSES the image.   He types and the numbers 1-555-672-  3254 ex 15567.   Jake's speech plays backwards.  As it plays back, the words he speaks TYPES out in 3  dimensional space.   The FIRST word is UNDERSCORED, then the  5th, the next 5th word, the next 5th, then the 6th, then 7th  and so on, following the same pattern of the phone number.  MAX  Computer.   Edit.  Jake rewinds and his speech is chopped up.   A jumped cut  version plays back.  JAKE  Someone just tried to kill us.  You must investigate highest level  of government.   Trust no one.  Max freezes the image, worried and torn.  CUT TO:  INT. SPACE STATION - HALLWAY - NIGHT  Jake and Ute hurry down the hall, speaking in hushed tones.  UTE  Where are we going?  JAKE  I want to play back the security  cameras without alerting anyone.  67.  (MORE)  (CONTINUED)",
      "characters": [
        "DUSSETTE",
        "DEKKOM"
      ],
      "action_text": "Someone killed Makmoud.   Why?   We  find that out, we'll know who's  behind this.  UTE  You can't access the cameras  without it being logged.  JAKE  That's why we're going to the back  up server room.  UTE  You can access the security cams  from there?  JAKE  I had them put in a back door  remote access just in case.  He gets to a door, and enters a code.  JAKE (CONT'D)  See, comes in handy that I built  the place.  The door opens exposing access to a stairwell.   Jake is  confused.   Ute opens a door on the opposite side of the hall.  UTE  Yeah, but I live here.  Begrudgingly, Jake follows her inside.  INT. SERVER ROOM - SPACE STATION - LATER  The image of Makmoud in the Retrieval Bay replays on a  monitor.  UTE  I was there.   Makmoud helped prep  diagnostics on the retrieved sat  while we launched the replacement.  We SEE Ute initiating the launch of the replacement sat as  Makmoud and the Tech inspect the sat.   The Tech is sent off  and Makmoud is left alone with the sat.  JAKE  Isn't there supposed to be two  techs with the sat at all times?  68.  CONTINUED:   JAKE (CONT'D)  (CONTINUED) Ute nods and Jake FREEZES the video.   He ZOOMS in on Makmoud,  close, and lets the video play.   We WATCH as he pulls out his  HoloFrame and presses it against the sensor.  JAKE (CONT'D)  He pulled something off the sat.  UTE  Think they killed him to get it?  JAKE  Or to make sure no one else did.  We WATCH Makmoud move down a hall and into the men's locker  room.  UTE  There's no cameras allowed in the  locker rooms.  JAKE  Then let's take a look for  ourselves.  INT. OUTSIDE MEN'S LOCKER ROOM - SPACE STATION - LATER  Ute waits at the door until Jake reappears from within.   He  gives her an \"all clear\" nod and she enters, shutting the  door behind her.   From outside, a sign appears:   CLOSED FOR  MAINTENANCE.  INT. MEN'S LOCKER ROOM - LATER  Ute and Jake are searching the empty locker room, looking for  a hiding place.  UTE  According to the time codes, he  entered in th",
      "dialogue_count": 2,
      "word_count": 4056
    },
    {
      "scene_number": 8,
      "slugline": "EXT. AIRPORT - AIRFORCE ONE - LATER  We see a large contingent of OFFICIALS and AIDES boarding  Airforce One.   Max, dragging his bag, comes rushing over to  the plane.   A PRESIDENTIAL AIDE stops him.  PRES. AIDE  Max, you're not on the travel memo.  MAX  (out of breath)  Last minute-- New figures for the  NDS report-- Have to update the  President's speech-- The convention  tonight--  The Pres. Aide looks around to see if anyone overhears.  PRES. AIDE  Go on.   If anyone asks, you snuck  on the plane.  The Pres. Aide waves him through.   Max boards.  INT. AIR FORCE ONE - CONTINUOUS  Max enters the crowded plane.   Everyone is on board, from the  Vice President, Cabinet members, Members of Congress and in  the distance he SEES President Litton conferring with Dekkom.  Nearby, Sarah catches sight of Max.   Her eyes go wide;   what  are you doing here?   Max shrugs and looks for a seat.  CUT TO:  INT. UTE'S LAB - SPACE STATION - SAME  Dussette rushes in.   Ute and Jake hover over the computer.  DUSSETTE  Any luck?  JAKE  It's wiped clean.   Trying to  recover something, anything.  UTE  What did you find on the security  cameras?  DUSSETTE  Nothing.   Whoever did this blocked  out every camera on this section of  the deck.  87.  (CONTINUED)",
      "characters": [
        "JAKE",
        "UTE"
      ],
      "action_text": "Just then the wall comm BUZZES.   Ute answers.  UTE  Yes?  MICKEY (FILTERED)  Commander.   Something's going on  with the satellites.  Ute and Jake share a look of dread.  UTE  We'll be right there.  Ute rushes out.   Jake and Dussette are right behind her.  INT. SPACE STATION - COMMAND CENTER - MOMENTS LATER  The place is in chaos.   Warning lights flashing everywhere.  Ute rushes over to Mickey and several other TECHS.  On the wall we SEE a digital representation of the entire  Testudo Net.   Hundreds of sats FLASH RED.  MICKEY  We have nearly two hundred  satellites reporting malfunctions.  We've lost all control over every  one of them.   Several of them are  nearing critical--  JAKE  Pull up the satellite closest to  critical overload.  Up on the wall monitor we ZOOM into a digital avatar of the  satellite, the word BEIJING flashes beneath.  EXT. BEIJING, CHINA - SAME  Dark, horrible storm clouds plunge the city into darkness.   A  torrential rainstorm pounds the city.   Pedestrian traffic  hidden under umbrellas held tightly in harsh wind.  An OLDER CHINESE WOMAN, stops as her umbrella RIPS.   She  inspects the umbrella and SEES a half dollar coin sized hole.  Just then another part RIPS as a fist sized HAIL shoots  through.  Quickly BASEBALL SIZED HAIL begins to pelt around her.  Several people are HIT and go down.   The Older Woman begins  to RUN.  88.  CONTINUED:  (CONTINUED) Shop windows BLOW OUT as huge chunks of HAIL SMASH through.  It's as if enormous ICE CANNON BALLS were being shot out of  machine gun.   It's intense and unreal.  The Older Woman nearly makes it inside a building when she's  BLOWN TO PIECES by a BLAST OF HAIL.  The intensity of the HAIL continues to INCREASE!   Cars begin  to get ripped to shreds, crashing, EXPLODING.  The entire sides of building begin to TEAR APART from the  firepower of the hailstorm.  As the streets empty, the HAIL BLANKETS everything in sight,  quickly FREEZING the entire environment.  The added weight of ice with",
      "dialogue_count": 2,
      "word_count": 3155
    },
    {
      "scene_number": 9,
      "slugline": "EXT. CONVENTION CENTER - SAME  The storm has gotten much worse.   Dozens and dozens of  LIGHTNING STRIKES hitting the city and surrounding area.   An  unnatural amount of lightning.   The THUNDER sounds like bombs  going off.  INT. BACKSTAGE - CONVENTION CENTER - WAITING LOBBY - SAME  Another Secret Service Agent, DIXON, gets a message over his  ear piece.  DIXON  Understood.  He nods to several other Agents who heard the same message.  They spread out into the crowded waiting lobby.  Dixon approaches Vice President Packer who is chatting with  the Speaker of the House.  DIXON (CONT’D)  I'm sorry to interrupt, Sirs, but  we've just been told that we're  evacuating the building and moving  you to a secured location.  VP PACKER  You've been prepping this place for  months.   It's not secured?  Just then the SOUNDS of the relentless THUNDER get louder,  shaking the building.  DIXON  It's the storm, sir.   They want to  get you out of the city before  we're trapped here.  VP Packer reluctantly nods.   He and the Speaker follow him to  a nearby elevator.   As they wait for the elevator to arrive,  they're joined by the Secretary of Treasury and the President  pro tempore of the Senate.  INT. GREEN ROOM - SAME  The President is conferring with several AIDES.   Sarah stands  watch by the door when Lammy enters, turns to her.  LAMMY  They want to move POTUS.  SARAH  I heard.  102.  (CONTINUED)",
      "characters": [],
      "action_text": "LAMMY  I'll take advance, Hernandez will  escort the President with you.  Sarah nods.   She turns to SEE that Agent Hernandez is  actually RICO, the white haired agent from Rio.   Lammy  whispers to the President, then exits the room.  President Litton nods to Sarah and heads out.   Rico follows  behind.  INT. BACKSTAGE - CONVENTION CENTER - BY ELEVATORS - SAME  The elevator finally arrives.   The Vice President, our group  of dignitaries and the Secret Service Agents all step inside.  The doors close.  INT. HALLWAY - BACKSTAGE - NEAR GREEN ROOM - SAME  Lammy walks several yards ahead of Sarah who leads the  President with Rico in the rear.   Sarah is tense.   She knows  it will happen soon but she doesn't know when and from where.  INT. PARKING GARAGE - ELEVATORS - SAME  The elevator arrives and the doors open.   Before the VP or  anyone else can step out MACHINE GUN FIRE blasts into the  elevator, ripping into everyone inside.  Emptying his Machine Gun, the GUNMAN (also Secret Service),  nods to his co-hort (another Secret Service guy) who tosses  in a grenade.  The elevator EXPLODES and BURNS.   There are no survivors.  GUNMAN  (into his comms)  The Vice President and his team  have been secured.  INT. HALLWAY - BACKSTAGE - NEAR GREEN ROOM - CONTINUOUS  Far enough ahead of Sarah, Lammy taps his ear piece.  LAMMY  Copy.   And the others?  Sarah, who hears everything over her comms, knows something  is off as she overhears--  GUNMAN (FILTERED)  Everyone has been removed.  103.  CONTINUED:  (CONTINUED) LAMMY  Copy.  Lammy goes through a door at the end of the hallway as Rico  discretely draws his weapon behind the President.   Sarah  slows and the President nearly bumps into her.   She whispers  SARAH  I hope you trust me.  Before the President can respond, Sarah SPINS, knocking the  President out of the way, REVEALING Rico has already lifted  his weapon.  Before he can pull the trigger Sarah fires three shots, point  blank into his head.   Rico sails backwards.  No",
      "dialogue_count": 0,
      "word_count": 744
    },
    {
      "scene_number": 10,
      "slugline": "INT. ZIP CAR - CONTINUOUS  The President is surprised to see Max sitting there, waiting  for him.   Sarah reaches for the steering column but there is  none.  SARAH  An electric cab?!   Seriously?  MAX  It was the only car around I could  hack.   Pull the release to override  auto drive.  Sarah finds a release lever and PULLS.   Like a mini-  transformer, a steering wheel emerges from the dash which  folds over to reveal dials and controls.  SARAH  That's more like it!  She jams it in gear and peels out.  PRESIDENT LITTON  Max, what the hell is going on?!  Max pulls out his HoloFrame with Alcon playing on it.  MAX  I'll explain everything, Sir.  EXT. CONVENTION CENTER - SAME  The car speeds away as the exit door blasts open, the  remaining Shooter emerges and rushes into the street and  FIRES at the retreating car.   Lammy stumbles out behind him,  yelling into his comms.  LAMMY  Eagle has flown!   Repeat, Eagle's  flown!!  EXT. NEWS STATION - SAME  Dekkom, Cassandra and two GUARDS exit the News Station and  head towards a waiting car.  DEKKOM  (into comms)  Lammy, you catch that bird, you  understand!  105.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 190
    },
    {
      "scene_number": 11,
      "slugline": "EXT. CONVENTION CENTER - SAME  A government town car pulls up, the two Gunmen from the  parking structure inside.   Lammy and the Shooter get in and  give chase.  LAMMY  We're on the hunt!  EXT. NEWS STATION - SAME  Dekkom angrily rips out his ear piece.  DR. JENNINGS  What the hell are we going to do?  DEKKOM  They're in the epicenter, they  won't get far.  DR. JENNINGS  And if they know the way out?  DEKKOM  We'll be waiting.  Dekkom gets into the car.   Dr. Cassandra Jennings turns back  for a look at the city.   The SOUND of Thunder sounds more  like machine gun fire.   She climbs in the car and it takes  off.  As the car drives off we CRANE UP and get a wider view of the  city.   We SEE literally hundreds of LIGHTNING BOLTS firing  into the city, ripping into buildings and streets.   Small  fires erupting everywhere.  The only path that seems relatively safe is the road the car  drives away on.  CUT TO:  INT. SPACE STATION - HALLWAY - SAME  Hundreds of station workers are rushing down the hall,  evacuating.   Jake helps carry equipment, caught up in the  mass exodus.  Just then an EXPLOSION ROCKS the Station.   Everyone is  knocked around, panicking.  CREW MEMEBER  What the hell was that?  106.  (CONTINUED)",
      "characters": [],
      "action_text": "JAKE  Cargo hold!   Hurry, we can still  make it to the shuttles in time!  Fighting his way upstream from the mob, Kagawa rushes past  Jake.  JAKE (CONT’D)  Kagawa!   Where're you going!  KAGAWA  I left my remote case.   I gotta get  it--  JAKE  There's no time--  But Kagawa is gone.   Jake hands off the equipment he holds  and fights his way against the crowd to go after Kagawa.  JAKE (CONT’D)  Kagawa!  INT. MAINTENANCE BAY\\HALLWAY - SPACE STATION - SAME  Dussette hustles a group of Technicians and Mechanics out of  the Bay.   Aluko follows him.  DUSSETTE  Hurry, go straight to Shuttle Bay--  Just then another EXPLOSION rocks the station.  DUSSETTE (CONT’D)  Hurry!  They all run out and down a hallway.   Aluko and Dussette in  the rear.  ALUKO  Have you seen Duncan?  DUSSETTE  He's vanished.   Lawson figured out  he was the traitor.  ALUKO  I can't believe it.  DUSSETTE  I've saved the security footage.  We'll figure out who he was working  with.  107.  CONTINUED:  (CONTINUED) Suddenly Aluko doubles over in pain, collapses to her knees.  Everyone stops running.  DUSSETTE (CONT’D)  (to the others)  Go!   I've got her.  (to Aluko)  Are you alright?  ALUKO  My stomach--  Aluko steals a glance to see that they're alone.   In a flash,  she pulls her weapon and shoots Dussette, point blank.   He  never saw it coming.  Aluko checks to make sure she's unobserved, then takes off  running towards the shuttle bay.  INT. RETRIEVAL BAY HALLWAY - SPACE STATION - SECONDS LATER  People are still hustling to get off the ship.   Jake enters  against the stream, passing Mickey on her way out.  MICKEY  Jake!  He ignores her and keeps pushing forward.   Aluko appears at  the end of the hallway on her way out.   She SEES Jake.  MICKEY (CONT’D)  Where're you going?  JAKE  Gotta get Kagawa.   Don't wait for  me!   Go!  Making a quick decision, Aluko follows Jake from a distance.  INT. CONTROL ROOM ABOVE RETRIEVAL BAY - MOMENTS LATER  Kagawa is finishing up as he disconnects his \"control c",
      "dialogue_count": 0,
      "word_count": 1832
    },
    {
      "scene_number": 12,
      "slugline": "EXT. ORLANDO STREETS - SAME  The intensity of the Electric Firestorm is overwhelming.   The  electric cab struggles.   Sarah races to a PARKING STRUCTURE  to hide from the intensity.  INT. PARKING STRUCTURE\\ELECTRIC CAB - CONTINUOUS  Sarah pulls the car to a stop.   Through the windshield they  watch the devastation and destruction happening outside.  Even parts of the Parking Structure are affected.  PRESIDENT LITTON  How far?  MAX  Not very.   Just a few blocks more.  SARAH  We can't go back out in there.   We  have to wait for a break in the  storm.  Max walks to the edge to the structure.   He can SEE the  boulevard in the distance.   No lightning strikes hit it.  MAX  If they knew that was the only way  out for them--  SARAH  Then they know its the only way out  for us as well.  They both turn to the President who shares a look of worry.  Just then the rear of the parking structure COLLAPSES under  the pressure of a HUNDRED LIGHTNING STRIKES.  Quickly they jump back into the electric cab.   They dart off  as the ceiling behind them collapses; barely escaping.  EXT. UNDERPASS - MOMENTS LATER  Farther down the road, on the other side of an underpass, we  SEE the Gunman from the Parking lot waiting on one side of  the Road, hiding.   He jams a large clip into his automatic  and NODS to--  --the Shooter who waits in hiding on the other side of the  road, equally well armed.  115.",
      "characters": [],
      "action_text": "ANGLE - TOWN CAR - DOWN THE ROAD  Blocking the roadway, just down from the underpass, is  Dekkom's town car.   He and Dr. Jennings wait behind it.  Dekkom prepares his automatic weapon as well.  We can see that they are JUST on the outside of the storm.  There are no lightning strikes anywhere on this side of the  underpass.  Dr. Jennings looks sick, terrified.   The SOUND of a high  pitched WHISTLE is heard through the distant SOUND of  thunder;   the signal .  DEKKOM  Here we go.  Dekkom stands up and sets his automatic over the roof of the  town car, taking aim down the road.  ANGLE - UNDERPASS  Over the shoulder of the Gunman we SEE the electric   cab  approaching.   The Shooter and Gunman give each other a NOD  and just as the electric cab nears--  The Shooter and Gunman step out and FIRE INTO THE ELECTRIC  CAB - SHREDDING IT.  The Electric Cab goes into a SPIN and CRASHES into several  parked cars, FLIPPING OVER AND SKIDDING TO A HALT.  The two assassins march towards the wreckage and continue to  fire into it's carcass.  ANGLE - TOWN CAR  Dekkom, pleased, takes his eye away from his gun's scope and  smiles.   CLICK.   A pistol is placed next to his skull.  SARAH  Don't move, Mr. Secretary.   You're  under arrest.  Dekkom turns to see Sarah has the drop on him.   Before he can  make a move--  SARAH (CONT’D)  I know what you're thinking.   She's  just a girl.   I can take her.  (beat)  Try it.  116.  (CONTINUED) The cold, deadly look in Sarah's eyes intimidates Dekkom.   He  knows he's beat.  The SOUND of a HELICOPTER approaches.   SIRENS from  approaching Police vehicles.  BULLHORN (O.C.)  ...put your weapons down and place  your hands behind your heads.  Sharpshooters and policeman appear out of nowhere.   The  Gunman and Shooter drop their weapons and oblige.  As policemen surround the town car, Max and the President  appear from their hiding places, walking over towards Dekkom  as he's being hand cuffed.  DEKKOM  But how--?  The President pulls out his cell",
      "dialogue_count": 0,
      "word_count": 1687
    },
    {
      "scene_number": 13,
      "slugline": "INT. SUPPLY ROOM - SAME  Jake makes his way over to one of the space suits, like the  one he used in the space walk and quickly puts it on.   Not  easy in zero gravity.  INT. EXPOSED HALLWAY - SPACE STATION - MOMENTS LATER  Wearing the space suit, Jake reopens the door to the hallway,  which is now exposed to open Space.   Again he pulls himself  down the hallway until he gets to a side access passageway.  Jake enters a code on a pad next to the door, he opens it and  floats inside, sealing the door behind him after he enters.  INT. ACCESS PASSAGEWAY - CONTINUOUS  Weightless and with the environment slowly turning around  him, it's very disorienting as Jake pulls his way forward.  He makes his way to a circular chamber where several access  passageways meet here.  He quickly pulls himself towards a door with a round glass  portal.   He looks inside and SEES the ship's mainframe  computer, several display screens around it inside.  Jake works the keypad, but can't gain access.   He tries  again, same result.   He starts to panic.   Tries to force the  door handle, can't.  He looks again at the mainframe, the HoloFrame in his hand.  So close!   He can't fail now!  UTE (O.S.)  Need a hand, cowboy?  Jake turns and sees UTE, also adorned in a Space Suit,  floating over to him.  JAKE  What are you doing here?  UTE  Helping you get in the mainframe.  She goes over to a hidden panel box, slides it open,  revealing another keypad and enters a code.  UTE (CONT’D)  Try it now.  Jake does and the mainframe door OPENS.  123.  (CONTINUED)",
      "characters": [
        "KAGAWA"
      ],
      "action_text": "JAKE  How did you--?  UTE  I have told you.   I live here.  Jake follows Ute inside.  INT. MAINFRAME - SPACE STATION - CONTINUOUS  Ute goes right to a nearby keyboard as Jake inserts the  HoloFrame into it's docking station.  Several monitors LIGHT UP, with the words DEACTIVATION  PROTOCOL COMMENCING flashing across the screens.  Ute and Jake turn their attention to another screen showing a  schematic of the entire Testudo Net.   We SEE avatars of  satellites going DARK, one by one.  CUT TO:  EXT. TESTUDO NET - SPACE  We watch as satellites, sequentially, begin to POWER DOWN.  All the lights on each going dark.  EXT. MUMBAI - SAME  The ARMY OF TORNADOS have just entered the city.   Buildings  are SHREDDED.   Then, suddenly, the Tornados SLOW and SHRINK.  Eventually they vanish altogether, only the outskirts of town  damaged.   The rest of the city saved.   People come out from  their hiding places, terrified but relieved.  EXT. DUBAI - SAME  The BOILING WATER is now RISING and FLOODING into the  streets, when suddenly it begins to recess.  The waters around the city quickly calm.  EXT. MOSCOW - SAME  Though all the snow is gone, we WATCH as the Orange BEAM of  light vanishes from above the city.   Returning the  temperatures to normal.  CUT TO:  INT. MAINFRAME - SPACE STATION - SAME  The monitors show the entire system shutting down.  124.  CONTINUED:  (CONTINUED) UTE  It's working!  JAKE  Once the last one cycles down, we  have to reboot the entire system.  That should flush out the virus.  Jake pulls out the HoloFrame and moves over to another part  of the mainframe.   Ute watches the monitors closely.  UTE  Five to go.   Three.   Two and One!  Jake manipulates several machine inputs.   All the monitors go  BLANK then DARK.   Ute and Jake exchange a look of worry.  After a short beat, all the monitors and the mainframe itself  RE-POWER BACK UP.   We can see on the schematic that the  satellites are rebooting as well.  CUT TO:  EXT. TESTUDO NET - SPACE  One by one,",
      "dialogue_count": 1,
      "word_count": 1890
    }
  ]
}