{
  "slug": "ghosted-101-pilot-2017",
  "title": "ghosted 101 pilot",
  "genre": "action",
  "format": "series",
  "scenes_count": 2,
  "characters_count": 0,
  "characters": [],
  "total_words": 6062,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. THE GROVE / OUTDOOR SHOPPING CENTER - NIGHT  Leroy is sadly locking up a guard station at the mall.  IN SPLIT SCREEN:   We’re on Max and Leroy’s faces. Sadness.  Exasperation. Just as two large SYRINGES plunge into their  respective necks. They both fall from frame.   BLACK.  INT. BUREAU UNDERGROUND / INTERROGATION ROOM  Leroy groggily wakes up. He sees Max next to him. Both tied  by the wrists to matching armchairs in the middle of the  room. A white desk sits before them. A giant knife on the  desk...  MAX  Oh good. You’re awake. Sorry. Hi.  I’m Max. God, I thought you would  NEVER wake up.  Leroy is slowly gaining consciousness.  MAX (CONT’D)  Looks like we’ve both been  kidnapped. But no one’s come in.  Leroy just stares at him.  MAX (CONT’D)  Strong silent type. I get it. This  is stressful. I agree. Hey, I don’t  mean to pry, but you don’t have any  snacks or anything? It’s just I  skipped breakfast and--  LEROY  You like blueberry pancakes?  MAX  What? Um, yeah.  LEROY  Because I have a stack of blueberry  pancakes in my pocket. You good  with the silver dollar ones? Oh,  but you know what? No syrup.  MAX  Oh. You’re teasing me. I get it.  LEROY  I do have some maple butter,  though. Creamy as hell--  5.",
      "characters": [],
      "action_text": "Suddenly a stylish woman, in workout clothes, drinking a  large latte and talking on a bluetooth enters. This is...  CAPTAIN DEMI LAFREY.  She’s flanked by BARRY SHAH, a jacked up, overeager tech bro  in a wheelchair drinking an big energy drink and DELILAH  KEMPER, a seemingly sweet, but extremely driven and overly  blunt, young doctor.  CAPTAIN LAFREY  (ON PHONE)  ...tell her you want more time.   No  I’m not going to do it for you.  You’re 9 years old. Find her  weakness and exploit it.  LEROY  Who are you? What is going on?  CAPTAIN LAFREY  What does it look like? We  kidnapped you.  (INTO PHONE)  Okay, love you and tell Dad not to  overcook the chicken parm again--  LEROY  What do you want?!  BARRY  HEY DUMBASS! She’s talking to her  daughter. That’s her angel, her  everything. Respect that or I will  MESS you up, homey.  DELILAH  (aside, re: energy drink)  I thought you quit drinking those.  They’re bad for your blood  pressure, plus they can’t help with  your insomnia-  BARRY  Whatever, it’s fine, I’m allowed.  LaFrey takes the energy drink from him.  CAPTAIN LAFREY  No, you’re not. Listen to her,  she’s smarter than you.  (then)  Gentlemen, I’ll make this quick.  6.  (MORE) We’re a NASA based special-ops  intelligence outfit called The  Bureau Underground. I’m Captain  LaFrey and this is my forensisc  pathologist, Delilah Kemper and  tech specialist, Barry Shah. We  investigate the paranormal –  anything outside the scientific  realm.  MAX  Oh that is awesome.  CAPTAIN LAFREY  Two days ago, one of our own, Agent  Mike Checker, disappeared. Checker  had recently come to believe he’d  found a way to travel between  universes, or the “multiverse”-  MAX  Wait, you know I wrote a paper  proving the existence of the  multiverse--  CAPTAIN LAFREY  Yes, Checker was going through your  research when he disappeared.  MAX  Well that’s always nice to hear.  But we’re hundreds of years away  from developing the technology to  travel through the multiverse.  CAPTAIN LAFRE",
      "dialogue_count": 0,
      "word_count": 4084
    },
    {
      "scene_number": 2,
      "slugline": "EXT. WAREHOUSE - NIGHT  Standing beside the car, Max rubs his wrist from the cuffs.  MAX  ...And I was attacked. There was a  bright light and a thing. And the  yell--  LEROY  What attacked you?  MAX  I don’t know! But I think it was  the same thing that attacked  Checker. It had the same glow. So  we gotta go in there now.  Max makes a move to go up there.   Leroy blocks him.  LEROY  No, no, no.   You’re not going  anywhere.  MAX  You’ve been fighting me the whole  time. You work alone. You don’t  need me. I get it. You don’t want a  partner. Well guess what?! You  almost made sure of that tonight!  LEROY  Don’t push me, man.  MAX  I almost died back there. Because  you left me!  LEROY  DON’T PUSH ME.  MAX  WHY’D YOU DO IT THEN? WHY’D YOU  LOCK ME UP?!  LEROY  I WAS RESPONSIBLE FOR MY PARTNER’S  DEATH!  (then)  That what you want to hear? That I  made the call to move in without  backup. That I could have warned  him when he was about to get shot?  27.  (MORE)",
      "characters": [],
      "action_text": "But in that moment I FROZE UP. That  what you want to hear?  Max is shocked - a moment of vulnerability for Leroy.  LEROY (CONT’D)  And I locked your ass to the car  because I didn’t want it to happen  again.  In that moment, Max understands. He sees Leroy’s pain.  MAX  Still. You could have at least  turned on the radio.  Their standoff is interrupted by a LOUD NOISE from high up in  the warehouse. They look up and see A SWIFTLY MOVING LIGHT  zigzagging up the warehouse stairwell.  MAX (CONT’D)  That’s the thing! The thing that  attacked me and that attacked  Checker, I know it. We gotta go up  there. Checker might be in there.  He might be in danger--  LEROY  No. I’m not doing this again. We  call for backup. We coordinate and  then we move in.  MAX  The key to both our lives could be  in that warehouse. And I’m going  in. With or without you.  Leroy CHECKS the clip on his gun. Looks dead at Max.  LEROY  Get your skinny ass in line behind  me. Let’s do this.  He SLAMS the clip it back into his gun, we CUT TO:  INT. ABANDONED WAREHOUSE / HALLWAY  A long hallway with large rooms off to either side. It’s  clearly an unoccupied space, fallen into complete disrepair.  From the end of the hallway, a slight glow emanates from the  TRANSOM WINDOW above one of the doors.  28.  LEROY (CONT'D) AT THE DOOR  LEROY  Lift me up.  MAX  Yeah. Just logistically, maybe we  try it the other way around.  LEROY  Why?  MAX  Ummmm--  LEROY  Got you, dude.   Here.  Leroy gives Max a boost up to the window. As Max’s eyes crest  the ledge of the window - he sees a glimpse of Mike Checker,  eyes closed, strapped onto a medical gurney. Standing over  him, obstructing Max’s full view of Checker, is the GUY WHO  WAS FOLLOWING CHECKER on the security feeds.   He cleans a  SURGICAL KNIFE.  MAX  Wait, is that...  LEROY  What?  MAX  Checker. He has Checker.  The Guy suddenly puts the surgical knife down and TAKES OFF  HIS OWN HEAD. Max recoils, BANGS into the window. The Guy  quickly turns toward t",
      "dialogue_count": 0,
      "word_count": 1978
    }
  ]
}