{
  "slug": "gilmore-girls-101-pilot-2000",
  "title": "gilmore girls 101 pilot",
  "genre": "drama",
  "format": "series",
  "scenes_count": 3,
  "characters_count": 1,
  "characters": [
    "RORY"
  ],
  "total_words": 5358,
  "total_dialogue": 1,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. LORELAI'S PORCH - NIGHT  LORELAI (muttering) What do I do, what do I do, what do I do... SOOKIE You can have anything I own. My car. Sell my car. LORELAI Oh, sweetie...no one wants your car. SOOKIE You know, you might want to consider asking... LORELAI No. SOOKIE But it seems like the only option. LORELAI Sookie, there are several chapters from a Stpehen King novel that I would re- enact before I'd resort to that option. SOOKIE But... LORELAI Sookie, please. SOOKIE Okay. It's dropped. Rory comes out of the house wearing the plaid skirt. RORY (indicating the skirt) So, what do you think? SOOKIE Wow. It makes you look smart. RORY Okay, no more wine for you. Mom? LORELAI You look like Laura Ingalls Wilder. RORY Fine. You can hem it. A little. Only a little.",
      "characters": [],
      "action_text": "LORELAI Thank you. Lorelai and Sookie follow Rory into the house.  INT. LIVING ROOM - CONTINUOUS  Sookie goes into the kitchen. Lorelai gets her sewing basket and starts pinning the skirt up. RORY I can't believe tomorrow is my last day at dormancy high school. I was so excited today, I dressed for gym. LORELAI You're kidding. RORY And I played volleyball. LORELAI With other people? RORY And I learned that all this time I was avoiding group sports? LORELAI Yeah? RORY Was very smart because I suck at them. LORELAI Yeah, you got that from me. Sookie comes back out of the kitchen wearing an apron. SOOKIE Where's the pate? LORELAI At Zsa Zsa Gabor's house. Sookie goes back in the kitchen. Lorelai finishes pinning the skirt. LORELAI Okay. Go see what you think. RORY I love being a private school girl. Rory runs off excitedly. Lorelai sits on the couch. She looks over at a photo on the table next to her. ANGLE ON a picture of a six-year-old Lorelai standing in front of a brick house with an unusually ornate iron door. ANGLE ON Lorelai as she picks up the picture. ANGLE ON the picture which fills the screen. We DISSOLVE TO:  EXT. SAME BRICK HOUSE WITH THE ORNATE DOOR - DAY  ANGLE ON Lorelai across the street from this house. She's drinking from a coffee container and pacing back and forth. She drinks the final swig, and takes a deep breath. CUT TO: BLACK SCREEN. A door opens to reveal Lorelai standing there. LORELAI Hi Mom. We open out to find EMILY GILMORE holding the ornate door open. Emily is a distinguished looking woman in her early sixties. Her dress is impeccable, her hair is perfect and the pearls are real. She looks absolutely astonished to see her daughter. EMILY Lorelai. My goodness. This is a surprise. Is it Easter already? LORELAI I just got finished with my business class and I thought I'd stop by. EMILY To see me? LORELAI Yes. EMILY Well. Isn't that nice. Come in. LORELAI Thanks. Lorelai enters and Emily closes the door.  INT. GILMORE HOUSE - DAY  A far cry ",
      "dialogue_count": 0,
      "word_count": 562
    },
    {
      "scene_number": 2,
      "slugline": "INT. GILMORE LIVING ROOM - CONTINUOUS  The living room is even more imposing then the entry way. Portraits of Emily and Lorelai's father Richard hang on the walls. Another portrait of a mischievously smiling little Lorelai also hangs on the wall. The women sit down stiffly. LORELAI So, how are the girls at the bridge club? EMILY Old. LORELAI Well...good. EMILY You said you were taking a business class? LORELAI Yeah. I take a business class at the college twice a week. I'm sure I've told you. EMILY Well, if you're \"sure\" then you must have. An awkward beat passes. LORELAI So...I'm executive manager at the Inn now. EMILY Really? LORELAI I run the whole place. EMILY You must be busy. LORELAI It's just a matter of time before I can buy my own inn. EMILY Well, won't that be something. The two women lapse back into silence for a beat. EMILY Would you like some tea?",
      "characters": [
        "RORY"
      ],
      "action_text": "LORELAI I'd love some coffee. We hear the front door open. A gruff voice calls out. RICHARD (O.S.) Emily? I'm home. EMILY We're in here. RICHARD GILMORE enters. Richard is a tall, strong, opinionated man of few words. He doesn't need that many. He stops in his tracks when he sees Lorelai. RICHARD What is it, Christmas already? LORELAI Hey, Dad. EMILY Lorelai was taking a business class at the college today and decided to drop in to see us. RICHARD What business class? EMILY Well, she told us about it dear, remember? RICHARD No. He crosses to his very Blake Carrington bar and pours himself a drink.   (to Emily) Is she staying for dinner? LORELAI No, she's not. Look, I actually came here for a reason. Dad, could you maybe sit down for a minute? Richard stands at the bar going through the mail. RICHARD (not looking up) You need money. LORELAI I have a situation. RICHARD You need money. LORELAI Would you please just let me get this out? Please? Rory's been accepted to Chilton. EMILY Chilton? Oh, that's a wonderful school. It's only five minutes from here. LORELAI I know it is. I've been trying for two years to get her in there. And now there's an opening and we just found out about it. She can start as early as Monday. The problem is I have to put down an enrollment fee plus this semester's tuition and I have to do it immediately or she loses her spot. RICHARD (beat, then without looking up) So, you need money. LORELAI (small) Yes. Richard puts the mail down. He and Emily look at each other. LORELAI It's not for me, okay? It's for Rory. This is a great opportunity for her, and it would simply be a loan, I fully intend to pay you back every cent. I just can't let miss out on something this important. I don't ask for favors, you know that. EMILY Oh, yes. (pointedly) We know. Richard and Emily look at each other again. RICHARD I'll get the checkbook. LORELAI Thank you. I can't tell you...thank you. EMILY On one condition. LORELAI A condition? EMILY Yes. Since we are now fi",
      "dialogue_count": 1,
      "word_count": 4235
    },
    {
      "scene_number": 3,
      "slugline": "INT. DINING ROOM - CONTINUOUS  The voices are crystal clear. EMILY (O.S.) If it weren't for your ridiculous pride your life could've been better. But no. You were too proud to take anything from anyone. You were always too proud to accept anything from anyone. LORELAI (O.S.) I wasn't too proud to come here to you two, begging for money for my kid's school, was I? Rory looks up, stunned. This is big news to her.  INT. KITCHEN - CONTINUOUS  EMILY No, but you're too proud to let her know where you got it from, aren't you? Well, fine. You have your precious pride. And I have my weekly dinners. Isn't that nice? We both win. Emily exits back in to the butler's pantry. Lorelai stands there exhausted.  INT. DINING ROOM - CONTINUOUS  Rory doesn't know what to do now. She turns toward her Grandfather. ANGLE ON: Richard. His head dropped. He's fast asleep.  INT. CAR - NIGHT  Lorelai drives silently. Rory looks at her mother a beat. RORY So...you want to get a cup of coffee? LORELAI Desperately.  INT. LUKE'S - NIGHT  Lorelai and Rory enter. They sit at their usual table. RORY So, nice dinner at the grandparents house.",
      "characters": [],
      "action_text": "LORELAI Yep. Her dishes have never been cleaner. RORY You and Grandma seemed to have a nice talk. LORELAI How much did you hear? RORY Oh, not much. You know, snippets. LORELAI Snippets. RORY Little snippets. LORELAI So you heard everything. RORY Basically. Yes. LORELAI (sighs) Well, the best laid plans. RORY I think it was very brave of you to ask them for money. LORELAI I so do not want to talk about it. RORY How many meals is it going to take till we're off the hook? LORELAI I think my funeral will be the last one.   (beat, then realizing) Oh, wait, does this mean... RORY I can't let a perfectly good plaid skirt go to waste. LORELAI You won't be sorry. Luke comes over. He's dressed in a clean button up shirt and a good pair of 501's. He cleans up good. LORELAI Wow. You look...nice. Really nice. LUKE Oh, I had a meeting earlier. At the bank. They like collars. You look nice too. LORELAI Yeah, well, I had a flagellation to go to. LUKE So, what'll you have? LORELAI Coffee. In a bowl. RORY I'll have Coffee also. And chili fries. LUKE That's quite a refined palate you got there. Luke walks off. Lorelai watches him go a beat. She then turns back to Rory. LORELAI Behold the healing powers of a shower. (turning back to Rory) So. RORY What? LORELAI Tell me about the guy. RORY You know what's really special about our relationship? The total understanding about the need for one's privacy. I mean, you really understand boundaries. LORELAI (beat) So, tell me about the guy. RORY Mom... LORELAI Is he dreamy? RORY Oh, that's so Nick at Nite. LORELAI I'm going to find out anyhow. RORY Really, how? LORELAI I'll spy Luke brings over the coffee and the fries. LUKE Fries and coffee. I can't stand it. This is so unhealthy. Rory, please, put down that cup of coffee. You do not want to grow up to be like your mom. RORY Sorry. Too late. Lorelai smiles at Rory, then sips her coffee happily as we: FADE OUT:  END OF SHOW",
      "dialogue_count": 0,
      "word_count": 561
    }
  ]
}