{
  "slug": "girls-trip-2017",
  "title": "girls trip",
  "genre": "drama",
  "format": "film",
  "scenes_count": 10,
  "characters_count": 0,
  "characters": [],
  "total_words": 21340,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. PLANNED PARENTHOOD - DAY - FLASHBACK 4   4 Sasha, Ryan and Lisa sit in the waiting room -- ominous STD posters are on the wall. RYAN (V.O.) Mistakes... Dina bursts out of the door of the doctor’s office giddy, arms in the air, signalling victory. DINA It’s chlamydia! I got the shit you can cure! They all cheer. EXT. BOTANICAL GARDEN - DAY - FLASHBACK 5   5 RYAN, gorgeous in her wedding gown, says her vows to STEWART in a story-book perfect wedding ceremony. RYAN (V.O.) Weddings... The girls wear bridesmaids gowns and necklaces shaped like “FP.” They all dab their eyes as Ryan and Stewart kiss. EXT. LISA’S HOUSE - DAY - FLASHBACK 6   6 Lisa’s baby shower. The Flossy Posse watch a very pregnant Lisa opens gifts. Her man looks disinterested as he drinks a beer in the background. Lisa clocks it, but plays it off. RYAN (V.O.) Babies... INT. COURTROOM LOBBY - DAY 7   7 The ladies wait, somber. Lisa exits the courtroom, wiping away tears. They embrace her and walk out. RYAN (V.O.) Divorces... We were ride or die. INSERT: A PHOTO MONTAGE 8   8 The Flossy Posse at Essence Fest over the years with a Chyron indicating each passing year. Official White 6-15-16   2.",
      "characters": [],
      "action_text": "RYAN (V.O.) But sometimes, words go unsaid. Disagreements go unresolved. You still talk on the phone, keep up on social media, but a year goes by where you don’t see each other. That year turns into five. Life doesn’t feel right without them. And that’s when you realize the Flossy Posse needs to ride again. We end on the last Essence photo, dated 2012 and CUT TO: INT. WAREHOUSE PHOTO SHOOT - DAY - PRESENT DAY 9   9 RYAN PIERCE, 30s, beautiful, poised, and perfectly put together, strikes poses as a Photographer snaps pictures and a FEMALE PRINT REPORTER interviews her. RYAN Relationships take work. Our biggest challenge as women is finding the balance of marriage, career, kids, life in general -- FEMALE PRINT REPORTER I agree! RYAN We’re told we have to choose between the personal and the professional. But I never believed that. I control my own destiny. I am strong, I am powerful, I am beautiful. If I will it, I can have it all. FEMALE PRINT REPORTER And it appears you do. Reveal Ryan’s handsome husband STEWART PIERCE, 30s, her equal in every way. He steps in with a loving embrace for his wife. INT. RADIO STATION - DAY 10   10 A DJ is in mid-interview with Ryan and Stewart. DJ Stewart, how does a former all-pro tight-end link up with the second coming of Oprah? Official White 6-15-16   3. STEWART Ryan’s strength has always been making others their best selves. I knew I needed that in my life. (looking at her) So, I pursued her and I got lucky. RYAN He sure did. Everyone laughs. She looks at him with love. RYAN No. I’d say we both did. INT. TV STUDIO - DAY 11   11 A national news show -- Ryan and Stewart are being interviewed by TAMRON HALL. TAMRON So Ryan, how did he propose? RYAN With barbecue. TAMRON (surprised) Excuse me? STEWART It was this little hole in the wall spot off campus with some serious pulled pork. Our favorite spot when we didn’t have any money. RYAN He told me he didn’t know where his football career would take him, but that it wouldn’t mean anythi",
      "dialogue_count": 0,
      "word_count": 1091
    },
    {
      "scene_number": 2,
      "slugline": "EXT. LOFT - DAY - MOMENTS LATER 13   13 An out of breath Sasha runs up to a gross, sweaty TOW TRUCK DRIVER, hooking up her car to his truck. SASHA That’s my car! TOW TRUCK DRIVER Not anymore, bae bae. SASHA Dude, come on, I need my car! TOW TRUCK DRIVER Yeah, I feel you, but the bank ‘needs’ their money. Sooo, you know. The Tow Truck Driver continues hooking up Sasha’s car. Sasha is desperate. SASHA What if we could work something out? You look like a man who appreciates a woman with curves. TOW TRUCK DRIVER Oh, I do... If you let me tie you up, strip you down, and then take a shit on your titties, I’m one hundred percent in. SASHA (stunned) Who thinks that? Let alone says it. Fuck that, your nasty ass is out of control. I’ll take Uber. TOW TRUCK DRIVER Suit your self. Good luck gettin your whip back, bae-bae. He hops in his truck. As he drives off, Sasha screams-- SASHA Wait, what if I whip out a titty? Will you settle for a titty?! Sasha watches, frustrated, as he pulls off with her car. A 12- YEAR-OLD BOY rides by on his bike, stopping. 12-YEAR-OLD BOY Whatever you’re selling? I’m buyin. Official White 6-15-16   7.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 217
    },
    {
      "scene_number": 3,
      "slugline": "INT. TOTAL PAPER - TED’S OFFICE - DAY 14   14 DINA, 30s, hot tempered and always looking for a cause to fight (justified or not), sits across from her boss, TED, 50s, stern-faced and full of disappointment. TED Dina, throwing staplers at co- workers is not only frowned upon here at Total Paper, it’s also illegal. It’s a form of assault. DINA That’s why I aimed for his lower body and not his face. TED Not the point. You’re lucky Vikram decided not to press charges. DINA And he’s lucky I aimed low. So we’re both lucky. All good. TED (sighing) Dina, I’m going to have to let you go. For everyone’s safety. I hope you understand. Dina shrugs this off. She does not understand. DINA Totally. Won’t happen again. We’re all cool. TED Dina, listen to me. We’re not all cool. I’m letting you go. DINA Okay, okay, I feel you, Big Ted. It’s water under the bridge. Gonna get back to work. TED Dina. There’s no bridge and you should not get back to work. Now, please acknowledge you understand that you’re fired. DINA Ted, I get it. You’re upset. I shouldn’t thrown things in a... (MORE) Official White 6-15-16   8.",
      "characters": [],
      "action_text": "(using air quotes) “place of work”. TED Why are you making air quotes? This is a place of work. Dina stands. DINA Lesson learned. By the way? I’m going to Essence Fest with my girls this weekend. So I’m gonna need Friday off. TED Dina, you can have all the days off. You’re fired. As in you don’t have a job. Do you understand me? DINA Yep, see you bright and early Tuesday. So glad we did this, Ted. I feel like this is progress. Dina exits. A banged-up Vikram spots her in the hallway and runs in the other direction. Flustered, Ted calls after her. TED Dina! Don’t make me call security! INT. LISA’S HOUSE - DAY 15   15 LISA COOPER, 30s, Type A, no nonsense, wearing nurse’s scrubs, reviews a very detailed list. LISA Here’s their schedule: bath time, snack time, homework time, ten minutes of TV, bed time. DELORES, 60s, watches Family Feud, barely listening to Lisa. DELORES Steve Harvey could get it on the Lord’s day. While I was at church. LISA Mom! Focus! DELORES Will you calm down?! I have raised kids before. DINA (CONT'D) (MORE) Official White 6-15-16   9. (then, re: Lisa) Although not without their issues. LISA You know what? Forget it. I’m staying. I can’t take a chance on them deviating from their bed time. Before Delores can protest in walks Dina, shades and Mardi Gras beads on, blasting Lil Wayne from her phone. LISA How’d you get in here? DINA Fuck a locked door. You ready to get turnt? LISA I can’t go. There’s just too much going on -- DINA Nope. Nope. Nope. DELORES For once I agree with Dina. Delores calls out into the hallway. DELORES Austin! Riley! Come say goodbye to your Mom! She’s going off to have fun so she won’t be so grouchy all the time. Lisa gives her mom a look as AUSTIN, 6, and RILEY, 4, run in. Lisa kneels down, pulls them into a tight, dramatic hug. LISA Do not let Meemaw let you stay up late. And do not forget how much I love you. DINA Bitch, you ain’t going off to war. Dina grabs Lisa’s bag and walks out. Lisa still hugs them. DELORES Go! I beg",
      "dialogue_count": 0,
      "word_count": 4695
    },
    {
      "scene_number": 4,
      "slugline": "INT. MONTELEONE - LOBBY - DAY 33   33 RYAN Then we’ll just get another hotel. SASHA I’ve called. All the four and five stars are booked. RYAN You know what? I came here to have fun with my girls, not hang out in the hotel. Let’s do this! INT. EMPRESS STAR HOTEL – LATER 34   34 The dirtiest, shittiest motel room ever. SASHA I’m thinking there’s been a few chalk outlines on this floor. RYAN Oh, someone’s definitely been murdered here. Lisa pulls Clorox wipes from her bag and wipes everything. LISA Just don’t let your bare skin touch anything. DINA No mini-bar? The fuck? I feel like that one-star was mad generous. SASHA You just had to cause a scene, huh? Classic Dina. Can’t go anywhere without some drama. DINA Classic Sasha. Can’t let shit go. LISA (itching) Stop fighting! I think I have scabies. There’s a KNOCK at the door. DINA We expecting anyone? Official White 6-15-16   33.",
      "characters": [],
      "action_text": "The others shake their head no. Dina opens the door. A drunken HOBO stands there. HOBO Rochelle here? DINA Nah, man. You got the wrong room. She starts to shut the door. HOBO This where I meet Rochelle every night. DINA Rochelle ain’t here. You got to go. HOBO It don’t have to be Rochelle. I’ll take one of you. He holds up a five dollar bill. The ladies look at each other, horrified. SASHA Are we staying at a motel where five dollar hookers do their business? DINA (kidding) Lisa, you game? Might as well turn a profit on dick number one tonight. The Hobo eyes Lisa’s scrubs. HOBO Not if she wearing that -- Lisa slams the door and puts on the chain. LISA We are done talking to this fool. Just then the Hobo SLAMS HIS NAKED JUNK up against the window. HOBO (through the window) You don’t want some of this? Official White 6-15-16   34. The women shriek as Sasha quickly closes the curtain. They all look at each other -- then CRACK UP. SASHA Did anyone else just flash back to Ft. Lauderdale? Senior year? RYAN Come to think of it, this room may be an exact replica. DINA Except the junk smashed against the glass belonged to some fine ass Omegas, not some crackhead with cole slaw in his pubes. RYAN Wow, you really took a good look, didn’t you? DINA I’m don’t miss shit. INT. SHITTY MOTEL ROOM - LATER 35   35 Music blasts from Dina’s phone. The women model their party outfits for the each other like they’re on a runway. Ryan looks stunning in a hot dress. Dina models her short dress. Sasha shows off her designer outfit. Ryan notices Sasha has a tag sticking out of her dress. RYAN Sash, hold up, you got a tag hanging out. She goes to pull it out and Sasha jumps away. SASHA No!   (off Ryan’s look) Just tuck it in. I made a deal with the designer that I’d Instagram it this weekend. Taste-maker shit. DINA Lis, hurry up! Maxwell ain’t gonna wait all night to meet me, the man’s got shit to do! Official White 6-15-16   35. Lisa emerges from the bathroom wearing a boxy cotton blouse, a l",
      "dialogue_count": 0,
      "word_count": 3825
    },
    {
      "scene_number": 5,
      "slugline": "INT. CONVENTION CENTER - LOADING DOCK - DAY 55   55 Ryan rides in a golf-cart being driven by a festival assistant. Bouncing up and down, sunglasses on, hungover AF. She burps loudly. A hot mess. INT. SUGAR MILL (CONVENTION CENTER EXTENSION) - DAY 56   56 Ryan pulls up in the golf cart. A bit disheveled and frazzled. Maybe still a little drunk. Stewart shakes his head. STEWART Nice of you to show up. You want to maybe comb your hair? RYAN What? I don’t look pretty? How’s my breath? She breathes on him. We can tell by his reaction that it’s toxic. STEWART What’s wrong with you? Elizabeth walks up. ELIZABETH Whoa -- Somebody had some adult beverages... (worried) Let’s get you some coffee... And hair and makeup. A GLAM SQUAD TEAM of HAIR, MAKE-UP, and WARDROBE set up. ELIZABETH Just so you know -- Bethany from Calmart will be in the audience. She wants to get your vibe before the meeting. Ryan’s vibe right now is hungover as fuck. She puts on a smile. RYAN Then I guess I should brush my teeth -- She makes a face at Stewart who gives her a “will you quit playing now?” look. Official White 6-15-16   55.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 206
    },
    {
      "scene_number": 6,
      "slugline": "INT. RITZ CARLTON - GIRL’S SUITE LIVING ROOM - DAY 57   57 Lisa, Sasha and Dina eat breakfast, hungover. LISA Look, you guys, I’ve been out of the game for too long. He’s been with girls who know tricks I don’t. SASHA Please... there’s no tricks you don’t know. DINA You ever grapefruited? Sasha looks just as confused as Lisa. DINA Neither of you tricks have grapefruited? LISA Okay, explain. Dina picks up a grapefruit from the fruit basket. DINA (demonstrating) You cut a hole in each end of the grapefruit and make a tunnel -- then put the grapefruit on his dick while you suck it. Sasha sets down her forkful of grapefruit. SASHA/LISA What??? Dina picks up a banana to use in place of a dick. DINA But you gotta make sure you twist and squeeze -- that way your man feels like he’s getting sucked and fucked at the same time. She twists it up and down the base of the banana while she sucks on the top.   Slurping noises included. Sasha and Lisa’s mouths are agape as she demonstrates. Dina raises her head from the banana. Official White 6-15-16   56.",
      "characters": [],
      "action_text": "LISA Where’d you even learn that? DINA The Internet. You want a trick? There you go. You’re doing your man and getting your Vitamin C. SASHA And a protein shot -- They all laugh hysterically. EXT. FRENCH QUARTER STREET - LATER 58   58 Dina, Lisa and Sasha walk down the street where people are already drinking. Lisa and Sasha stop to linger in a funky clothing store as Dina is lured by two street VENDORS who vie for her attention. VENDOR #1 Hurricanes! Two for twenty- five! VENDOR #2 Extra special, authentic Hurricanes. Two for twenty over here! Dina heads for Vendor #2, when Vendor #1 calls out. VENDOR #1 Don’t go to him, beautiful. I’ve got something special for you. DINA Oh, now I’m beautiful...? Do tell... VENDOR #1 Baby, you can get Hurricanes anywhere. But I’m the only place in New Orleans you can get this... He pulls out a shiny bottle of ABSINTHE. Dina’s eyes light up like a kid. He’s got her. DINA The fuck is that? VENDOR #1 It’s two hundred year old pure wormwood absinthe. Green Fairy. DINA I want it! Official White 6-15-16   57. Excited, Dina reaches for the bottle, but he pulls away. VENDOR #1 I just want to make sure you know what you’re getting-- DINA I don’t give a fuck. That shit is green and shiny and looks like it will get us hella bent! VENDOR #1 It will. A tiny splash will have you seeing in 3-D. Dina stares at the bottle, transfixed, not listening. VENDOR #1 (CONT’D) Just a splash, got it? Any more than that-- DINA Nigga, just give it to me. VENDOR #1 This bottle should probably last you four or five years-- DINA Yep, got it. Five weeks. VENDOR #1 No. Five years. DINA Five days. Understood. VENDOR #1 I feel like you’re not listening. This has hallucinogenic properties-- Dina hands over some cash, grabs the bottle, cuts him off. DINA Thank you. This will be used very ignorantly. As Dina walks away, the Vendor shakes his head, knowingly. INT. SUGAR MILL (CONVENTION CENTER EXTENSION) - DAY 59   59 “THE   ESSENCE   OF COOKING” banner hangs above Ryan",
      "dialogue_count": 0,
      "word_count": 2884
    },
    {
      "scene_number": 7,
      "slugline": "INT. SWANKY LOUNGE - NIGHT 69   69 ACROSS THE PARTY Ryan, now sweaty and dizzy is in a VIP booth with Stewart, Elizabeth and Bethany trying her best to focus. BETHANY I just loved your cooking demo today. The way you two played off of each other was fantastic. So much fun. RYAN We’re all about fun. Funnn Funnn! Ryan starts rubbing ice cubes on her face. BETHANY Are you feeling okay? RYAN I’m just so thirsty -- Ryan takes a sip of water and completely misses her mouth. STEWART Let me get you a napkin. He dabs her forehead with it. Whispering to her -- STEWART What the hell are you on?! RYAN What?! Nigga chill out -- Bethany is taken aback as is Stewart, but then his attention is caught by -- ACROSS THE ROOM Dina walking across the room taking off her clothes. DINA Why it so damn hot? ON RYAN She looks up at the WAITRESS, who now appears to be Simone, but only to Ryan. WAITRESS Can I get you anything? Official White 6-15-16   72.",
      "characters": [],
      "action_text": "RYAN (to Stewart) What the hell she doing here? STEWART She’s here to take our order. WAITRESS/SIMONE I can come back-- RYAN Don’t. You. Dare. The waitress scurries off. Stewart leans into Ryan. STEWART What the hell’s gotten into you? RYAN The devil--? STEWART (to Bethany) So, tell me more about the Calmart philosophy. BETHANY Well-- Suddenly, Elizabeth starts laughing hysterically. Ryan tries to step in and address a confused Bethany. RYAN So you were saying, Bethanyyiiii!!! Bethany’s eyes begin to BUG OUT like they’re animated. RYAN Oh, shit! Elizabeth continues laughing then starts pecking at Stewart’s shoulder like a chicken. He shrugs her off and she starts doing it to Bethany. BETHANY I’m not sure what’s happening here... Ryan looks around the party. There’s SIMONE. She blinks her eyes. And there she is dancing, then by the bar drinking, in a booth eating, chatting on a couch -- everywhere Ryan looks, Simone is there. Official White 6-15-16   73. RYAN Excuse me. I need some fresh air. Ryan takes off, leaving Stewart there to cover on the fly. STEWART My apologies, Bethany. Ryan’s been taking a new allergy medicine and it’s had some side effects. BETHANY (referring to Elizabeth) What’s her excuse? Elizabeth is on the ground in fetus position laughing hard. ACROSS THE PARTY Sasha, Dina and Lisa are trying to get to Ryan. But they’re moving in slow motion. Barely covering ground. SASHA We’ve gotta save Ry! If we’re trippin, she’s trippin. DINA I’m not tripping, but I’m feeling niiiiice Ryan spots them. RYAN We need to leave! Now! The tsunami has hit! The tsunami has hit! EXT. FRENCHMEN STREET - NIGHT - MOMENTS LATER 70   70 On the street, the Flossy Posse are all clearly still on the absinthe high. Guzzling water from a street vendor. Ryan turns to Dina, pissed. RYAN What the hell did you put in those drinks?! DINA Love. RYAN Dina, I’m not playing! Official White 6-15-16   74. DINA ... and a little absinthe. I may have over poured. SASHA None of y’all saw the be",
      "dialogue_count": 0,
      "word_count": 5818
    },
    {
      "scene_number": 8,
      "slugline": "INT. THE RITZ CARLTON - GIRL’S SUITE BAR AREA - DAY 95   95 Ryan gets dressed for the keynote speech, trying to keep it together. The TV’s on in the background. WENDY WILLIAMS (V.O.) Hot Topics! So this picture of Stewart Pierce slobbing down this Instagram skank has me floored! Who’da thought there was trouble in paradise? Poor Ryan, right? Ryan snatches up the remote, pressing a button. The screensaver comes on. Past Essence Fest photos of the girls pop up on screen. Pictures of them in much happier times. Ryan watches for a beat, then powers it off. EXT. RITZ CARLTON - POOL - DAY 96   96 Sasha stares at her laptop screen. WENDY WILLIAMS ...Honestly, I don’t know how Ryan’s gonna survive this. Especially as a quote-unquote  relationship   expert. Sasha turns it off. Andra Day’s “Rise Up” plays as we see a MONTAGE OF THE GIRLS: EXT. CAFE DU MONDE - DAY 97   97 Lisa watches GROUPS OF FRIENDS laughing and pass her. She sobs and drowns her sorrows by eating BEIGNETS. Finally, she pulls out her phone. Texts Dina: “Where are you?” INT. RITZ CARLTON HOTEL ELEVATOR 98   98 Ryan and Stewart meet in the elevator, staring straight ahead, no words. Ryan tries to keep her head high. INT. NEW ORLEANS DIVE BAR - DAY 99   99 Lisa enters, sees Dina sitting at the bar sharing a pitcher of beer with the Hobo. LISA Now I know you’re as upset as I am. Official White 6-15-16   103.",
      "characters": [],
      "action_text": "DINA I know y’all probably only keep me around for laughs, but I love you bitches and would die for each one of you. Lisa tears up. LISA I know you would and that’s why we keep you around. You’re the most fiercely loyal friend we’ll ever know and we’re lucky to have you. Laughs or not. They hug. DINA We need to go see Ry’s speech. She’s hurting right now and she needs us. LISA Let’s go -- DINA And guess what we’re wearing? INT. RITZ CARLTON - POOL - DAY 100   100 Sasha records a video for her blog. SASHA (V.O.) This morning I decided I no longer want to be part of a process that tears people down in order to profit. INT. LIMO - DAY 101   101 Ryan looks flawless despite everything. She rides in silence next to Stewart, who looks equally stylish. The limo stops. Ryan puts her game face on, then exits. EXT. STREET - CONTINUOUS 102   102 Ryan flashes her million dollar smile to the crowd like a pro as REPORTERS and PAPARAZZI surround her and Stewart. Official White 6-15-16   104. REPORTER #1 Ryan, is it true that you’ve already filed for divorce? REPORTER #2 Stewart, how many mistresses do you have? Ryan and Stewart, hand in hand, walk through, poised. EXT. NEW ORLEANS STREET - DAY 103   103 Lisa and Dina’s phones PING. They stop to listen to Sasha’s video post. INT. ESSENCE VENUE - DRESSING ROOM - DAY 104   104 Alone, Ryan stares at herself in the mirror, misty-eyed, repeating her mantra for strength. At her lowest point. RYAN I am strong, I am powerful, I am beautiful... She sees a bottle of champagne with a card from Bethany that reads “Congratulations to the woman who ‘has it all’!” Ryan’s phone BUZZES. She picks it up, sees Sasha’s tagged her in a post. Ryan listens. SASHA (V.O.) Effective immediately, “Sasha’s Secrets” is no more. INT. RITZ CARLTON - MEZZANINE LEVEL - DAY 105   105 Sasha crosses the lobby with her bags in town, a plain outfit- * not trying to floss- and what’s left of her dignity. As she * rounds the corner -- Sasha looks up, surprised. Lisa and D",
      "dialogue_count": 0,
      "word_count": 1012
    },
    {
      "scene_number": 9,
      "slugline": "INT. CONVENTION CENTER - MAIN AUDITORIUM - DAY 110   110 Every seat is filled. Julian sits down in the back. Ryan and Stewart walk out hand in hand. Ryan surveys the crowd for her girls. They’re not there. Ryan sighs, disappointed, as Stewart walks on stage. EXT. CONVENTION CENTER DRIVE - DAY 111   111 The pedicab weaves in and out traffic as the ladies draw nearer to the convention center. EXT. ERNEST MORIAL CONVENTION CENTER -- CONTINUOUS 112   112 They climb out the cab and run through throngs of people to push inside. INT. CONVENTION CENTER - MAIN AUDITORIUM - DAY 113   113 A very composed Stewart begins speaking into the mic. STEWART It’s my honor and privilege to introduce this year’s Essence Keynote Speaker. Together, we’ve weathered many storms and overcome some of the toughest challenges. (then) Please welcome my rock, the woman I’m proud to call my wife... Ryan Pierce! The crowd cheers as Ryan walks on stage. Stewart plants a kiss on her cheek, then takes a seat. RYAN Thank you, Stew, for that wonderful introduction. Thank you Essence for the honor of speaking today. And last but not least, thank you all for coming out to support me... Ryan reads Elizabeth’s prepared statement from a Teleprompter. RYAN (CONT’D) As most of you know, there’ve been many questions about the status of my marriage. And I’d like to put those rumors to rest... The picture that surfaced this morning isn’t (MORE) Official White 6-15-16   108.",
      "characters": [],
      "action_text": "real. All allegations of infidelity are false. My husband and I are in a loving, faithful marriage. INT. CONVENTION CENTER - HALLWAY - SAME TIME 114   114 The ladies, sweaty and out of breath, run down the hall. Sasha spots the main auditorium doors. They’re closed. SASHA Oh no, it’s already started... Dina reaches for the handle. A VOLUNTEER halts them. VOLUNTEER Sorry, ladies. No late entries. Lisa and Sasha look to Dina, knowingly. INT. CONVENTION CENTER - MAIN AUDITORIUM - MOMENTS LATER 115   115 With a loud BANG the back doors open abruptly as Dina kicks them in, the ladies tumble inside, causing a scene. VOLUNTEER (O.C.) I’m calling security!   DINA I said step back, fool! Ryan stops. EVERYONE turns and looks toward the commotion. Dina straightens her clothing. Lisa smiles politely. LISA Please... Continue. Ryan smiles, taking in the sight of her girls. She looks into the audience, sees VARIOUS WOMEN she’s encountered over the weekend. Women who look up to her. Ryan tries to continue. RYAN In fact, my husband and I are stronger than ever... Ryan pauses for a long beat. Her emotions catching up. SASHA (sotto) Come on, Ry... The crowd waits. Ryan wrestles with her conscience. Then looks at her girls, her support system, the Flossy Posse. RYAN (CONT’D) Official White 6-15-16   109. RYAN (CONT’D) My agent wrote a very convincing statement for me to read to you. And I really thought I could go through with it... because I’ve done a really great job of pretending so many times before. But sometimes you reach a point when you just can’t anymore. And I can’t. I’m tired of all the lies... Stewart looks nervous as hell. He stands, trying to stop her. STEWART Ry, let’s take a minute here-- RYAN (CONT’D) Stewart, sit down. Please. STEWART Ryan, baby. Be careful-- RYAN Sit your ass down. Now. (to the audience) The picture is real. My husband is having an affair. When I found out, I felt a lot of things: Anger. Heartache. Betrayal. But mostly,  fear . Fear that my marriage ",
      "dialogue_count": 0,
      "word_count": 1258
    },
    {
      "scene_number": 10,
      "slugline": "INT. ATLANTA CLUB - VIP AREA - NIGHT 120   120 Club PATRONS laugh, drink and have a good time. Dina walks around, checking on the CIROC GIRLS. Running the show. She sees Diddy across the club and gives him a nod. RYAN (V.O.) ...who are fearless. Dina pulls out her Essence Fest Photo on her smart phone and admires it. INT. RYAN AND SASHA’S OFFICE - DAY 121   121 Empty office. Boxes everywhere. Sasha hangs up a framed, blown up VARIETY article that reads: “OWN picks up Ryan Pierce and Sasha Franklin’s Women’s Empowerment series.” RYAN (V.O.) ...who share your goal to contribute to the world... Sasha sets the Essence Fest photo prominently on her desk. INT. CONVENTION CENTER - CENTER STAGE - DAY 122   122 Ryan sits, thoughtful and introspective. RYAN ...Having it all means surrounding yourself with people who love and support you. And who won’t let you be afraid to go after the life you want. TAMRON HALL Well put. But I do have to ask, now that the divorce is final, are you dating anyone special? RYAN I learned my lesson the first time-- I’m not talking about my love life! I will say this though, I’m the happiest I’ve been in a long time. She gives a genuine smile as we CUT TO: In the Convention Center Audience we see Julian waits all smiles. Official White 6-15-16   114.",
      "characters": [],
      "action_text": "CONVENTION CENTER - CENTER STAGE BACKSTAGE 123   123 Ryan approaches Julian standing with Sasha, Dina and Lisa. RYAN (CONT’D) So... how was I? JULIAN You’re still the shit. He kisses her as Lisa, Sasha and Dina walk up together. LISA/SASHA/DINA There she is!/Bring it in, girl/You one brilliant bitch! As they hug, we know the Flossy Posse will always ride. FADE OUT. CREDITS ROLL OVER: 124   124 The Pinettes, an all-female brass band leads a second line march and our ladies down Bourbon Street as they play a brass band version of I’m Every Woman . Official White 6-15-16   115.",
      "dialogue_count": 0,
      "word_count": 334
    }
  ]
}