{
  "slug": "glow-101-pilot-2017",
  "title": "glow 101 pilot",
  "genre": "drama",
  "format": "series",
  "scenes_count": 2,
  "characters_count": 0,
  "characters": [],
  "total_words": 6766,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. CONFERENCE ROOM - DAY  RUTH WILDER, 30s, wearing a gorgeous black and white  geometric power suit, stands at the head of a large  conference table. She looks strong, sexy and in charge.  Behind her: Giant glass windows that look out onto  downtown Los Angeles. She addresses the unseen group.  RUTH  In this world there are good guys and bad  guys. And we are the good guys.  You see that name on my door? That’s my  father’s name, sonofabitch. But this  isn’t about him. This is about justice.  This is about holding on to what is ours.  This is about my firm, and my name.  Ruth pounds the table. She holds the moment, in full  control of the room.  RUTH (CONT’D)  And I will not be bullied into  submission.  REVEAL MALLORY, the casting director,(50s) a blousy woman  in leopard print stilettos, and an ASSISTANT working an  ENORMOUS camcorder. Ruth breaks character.  RUTH (CONT’D)  Can I just say-- Thank you so much for  bringing me in. There aren’t parts like  this for women right now. It’s great.  Really powerful.  Ruth smiles broadly.  MALLORY  You were reading the man’s part.  RUTH  I was? Oh. God. I’m sorry. I figured Mel  was short for Melanie. And then the other  part was-- Okay.  MALLORY  Would you like to start again?  RUTH  Yes. I would.  Ruth stands there. The Casting director’s assistant reads  off camera with little expression. We stay on Ruth.",
      "characters": [],
      "action_text": "CASTING ASSISTANT (O.C.)  This is about my firm and my name and I  will not be bullied into submission.  A beat. Then.  RUTH  Sorry to interrupt. Your wife is on line  2.  A pause. And that’s it.  CASTING DIRECTOR  Okay. Thank you Ruth.  RUTH  Thank you so much.  Ruth takes the long walk down the conference room past  the Casting Director. She pulls open the very heavy door.  It’s hard to get out of there.  INT. WAITING ROOM - DAY  Ruth walks out into the waiting room. It’s full of  beautiful actresses, all dressed in business suits, all  reading the sides. Ruth takes this in as she walks by.  INT. LADIES ROOM - DAY  Ruth stands in a stall. Alone. After a moment we hear the  door open and the click, click, click of high heels  running into a stall next to Ruth. Ruth checks out the  shoes. Leopard print stilettos. The door clicks closed  and the woman begins to pee. After a beat.  RUTH  Hey Mallory.  The peeing stops abruptly.  RUTH (CONT’D)  It’s Ruth Wilder. I was hoping to get  some feedback on my audition.  MALLORY  Have you been hiding in here for two  hours?  RUTH  Yes.  Ruth exits the stall. Waits by the sink. Mallory finishes  peeing and then opens the stall door. Already irritated.  2. MALLORY  You know that I wait until the end of a  casting session to pee. Out of respect to  the actors. If you want feedback, call  your agent.  RUTH  I don’t have an agent. Turns out if you  don’t work for two years people stop  caring about you. I do have an answering  machine.  MALLORY  Still. This is extremely unprofessional.  RUTH  You call me in a lot and you never cast  me. If there’s something I need to change  I want to change it.  MALLORY  (deep breath. Then.)  Every director says “Get me someone I  don’t know. Someone I haven’t seen. I  want a girl who’s   real .” I bring you in  so they can see that they don’t actually  want the thing they think they want.  Ruth takes this in.  MALLORY (CONT’D)  What I think? If it was 1940, you’d work.  But it’s 1985. Everyone wa",
      "dialogue_count": 0,
      "word_count": 5079
    },
    {
      "scene_number": 2,
      "slugline": "INT. SAMUEL FRENCH BOOKSTORE - LATER  We move across a rainbow of slender book-spines, hundreds  of plays. We pan over the shelves to a circle of folding  chairs — a scene study class. An assortment of actors  sit, watching intently as Ruth reads a scene with another  MUCH YOUNGER, MUCH SMALLER ACTOR. She’s holding the  script but she doesn’t need it. She’s really good. The  camera moves in and stays close on Ruth. She’s so good  you get lost in her performance.  RUTH  Oh Brick. I get so lonely. Living with  someone you love can be lonelier than  living entirely alone when the one you  love doesn’t love you. You can’t even  stand drinking out of the same glass can  you? … No! No, I wouldn’t. Why can’t you  lose your good looks Brick? Most drinking  men lose theirs. Why can’t you. I think  you’ve even gotten better looking since  you weren’t on the bottle. You were such  a wonderful love. … You were so exciting  to be in love with. Mostly I guess  because you were … If I thought you’d  never never made love to me again, why  I’d find me the longest sharpest knife I  could and I’d stick it straight into my  heart. I’d do that. Oh Brick how long  does this have to go on, this punishment?  Haven’t I served my term? Can’t I apply  for a pardon? … Is it any wonder. You  know what I feel like? I feel all the  time like--  Ruth looks up and her breath catches as she sees  something. Tears spring into her eyes. Then we see it.  Her TEACHER (50s) is sitting in his chair, sound asleep.  Ruth looks around. She’s back in the depressing scene  study class. Ruth walks up, stands right in front of him.  RUTH (CONT’D)  LIKE A CAT ON A HOT TIN ROOF  MOTHERFUCKER. WHY THE FUCK ARE YOU  SLEEPING? I PAID FOR THIS SCENE STUDY  CLASS. THIS IS THE ONLY PLACE I GET TO DO  WHAT I WANT TO DO. THERE ISN’T ANYWHERE  ELSE I CAN GO.  The teacher looks up at her. Apologetic.  TEACHER  I’m so sorry Ruth. My kids were both sick  last night. I was up til 4.  25.  (MORE)",
      "characters": [],
      "action_text": "And then I was on set doing extra work,  my call was 5 a.m. I’m tired. I’m sorry.  You’re a wonderful actor.  The class applauds anemically. Ruth is at the end of her  rope. This is too fucking depressing. She’s gotta fight.  INT. RUTH’S HOUSE - NIGHT  Research montage! A video of the 1984 WWF Heavyweight  Championship plays on TV. PAN to Ruth sitting on the  floor, eating Twizzlers, cutting out images from various  pro wrestling magazines she just bought.  GORILLA MONSOON (V.O.)  “From Venice Beach, California. Weighing  303 pounds. The incredible... Hulk Hogan!  (THE CROWD GOES NUTS)  INT. RUTH’S BATHROOM - NIGHT  Ruth tries on make-up. Glittery eye shadow and black  lipstick.  GORILLA MONSOON (V.O.)  ... And his opponent, from Tehran, Iran  (THE CROWD BOOS)... Weighing 258  pounds... The World Wrestling Federation  Heavyweight Champion... The Iron Sheik!”  INT. RUTH’S BEDROOM - NIGHT  Ruth goes through her closet, looking for costume ideas.  We hear the sound of a tape fast-forwarding. Then:  HULK HOGAN (V.O.)  Train! Say your prayers! Eat your  vitamins!  INT. RUTH’S BATHROOM - NIGHT  Ruth paints cat whiskers on her cheeks. She makes a  fierce cat face. Growls.  HULK HOGAN (V.O.)  Be true to yourself! True to your  country!  INT. RUTH’S HOUSE - NIGHT  Ruth studies a match between Ric Flair and Kerry Von  Erich on the TV. She takes thorough notes on a legal pad.  26.  TEACHER   (CONT'D) HULK HOGAN (V.O.)  Be a real American! Hoo!  INT. RUTH’S BEDROOM - NIGHT  Ruth has emptied her closet. Clothes and shoes are strewn  everywhere. She’s exhausted. Frustrated. She plops down  on the bed. The sound of a VHS rewinding. Then:  HULK HOGAN (V.O.)  ... Be true to yourself! True to your  country! Be a real American! Hoo!  She lies there. Defeated.  RUTH  Hoo.  INT. WATTS GYM - DAY  Sam leans on the ropes. Girls mill about waiting for  final callbacks to begin.  SAM  Five minutes, people.  Then, the doors BURST open and Ruth struts in, clad in  neon spandex, high boots, tea",
      "dialogue_count": 0,
      "word_count": 1687
    }
  ]
}