{
  "slug": "godzilla-2014",
  "title": "godzilla",
  "genre": "drama",
  "format": "film",
  "scenes_count": 24,
  "characters_count": 0,
  "characters": [],
  "total_words": 24875,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. BIKINI ATOLL - DUSK The animals are going wild.   Geiger counters are spiking off the charts.   The steady RUMBLES are getting louder, closer. TINNY SPEAKERS  Fiver, four, three...  As the whole lagoon LIFTS upward with a massive swell -- TINNY SPEAKERS  Two, one...  GODZILLA RISES LIKE A LIVING WATERFALL, completely SHROUDED by a torrent of cascading surf.   We can only barely, briefly glimpse his silhouette, before -- A FLASH OF BLINDING LIGHT consumes us.   Silence.   Whiteness. Then slowly, almost gracefully, an epic MUSHROOM CLOUD unfurls into Nature’s pure blue peaceful sky. It is a long, strangely quiet moment before -- the BONE- RATTLING SHOCK-WAVE CRASHES IN, obliterating our entire POV. TITLE CARD:  G   O   D   Z   I   L   L   A  Then a BLIZZARD OF ASH ENGULFS THE TITLE, as we MATCH CUT: EXT. SIBERIAN TUNDRA - NIGHT The whiteout of a blinding snowstorm.   A UNITED NATIONS HELICOPTER is making its way across the windswept steppe.   In the distance looms a sprawling subarctic MINING CAMP. SUPERIMPOSE:  KRASNOKAMENSK, SIBERIA - TEN YEARS AGO  ANGLE ON PROFESSOR HONDA (40s), Riding in a cockpit.   An austere Japanese man with a pensive, almost brusque demeanor.   He carries a small BRASS POCKET WATCH, fiddling with it absently as he studies the horizon: BLACK SMOKE billows to the sky.   The camp is a disaster site. EXT. DEVASTATED MINING CAMP - NIGHT A LOCAL RESCUE CREW is already here, scouring the wreckage: CORRUGATED HANGARS crunched like tin cans; decimated MEGA- DOZERS; gigantic DRILL-BORES, snapped like twigs...   At least a dozen RECOVERED FROZEN CORPSES lay chilling in the snow. 3.",
      "characters": [],
      "action_text": "The new arrivals are a UNITED NATIONS “MUTO” RESEARCH TEAM of international origin.   Some wear uniforms with an IDENTIFYING EMBLEM we will come to recognize.   They chatter in a MULTI- LINGUAL BABEL as they unload SCIENTIFIC EQUIPMENT -- But their leader, Honda, does not say a word.   A man of science, at once captivated and unnerved by what he sees. INT. MINING HANGAR - NIGHT Half the ROOF has been shorn away by violent force, giving onto a sky of frigid wind and moonlight.   An EXPERT (DR. STABLER, 30s) leads the way with a HALIDE FLASHLIGHT. DR. STABLER The Russians were surveying for uranium ore and found a radioactive hot-spot.   But when they started drilling, it wasn’t uranium they found...   Our Geneva office got the call this morning. Honda follows close at hand.   Still not a word. RUSSIAN RESCUE WORKER (SUBTITLE) Over here!   This one is conscious! A surviving MINER is hunkered in the corner.   Bug-eyed, catatonic, still shuddering from hypothermia and terror. RUSSIAN RESCUE WORKER (SUBTITLE) What was it?   What did this? But Honda silences the RESCUE WORKER, kneeling to face the traumatized survivor.   He takes the miner’s shaking hand. RUSSIAN MINER (SUBTITLE) (amid pained breaths) One -- was -- alive -- The miner is staring blankly at the BLOWN-OUT ENTRANCE TO A MINE SHAFT.   Repeating the same phrase over and over again. HONDA (to Rescue Worker) Take us in, please. INT. UNDERGROUND CAVERN - DAY THREE ROPES DROP IN FROM ABOVE, as Honda and his team absail down into a vast, hollow chamber in the earth. 4. Several dozen RESCUE WORKERS are already here, flashlights sporadically illuminating what seems to be a kind of giant nest.   Hardened secretion surrounds TWO ENORMOUS OVAL SPORES. One appears to be intact.   The second has already “hatched.” Honda studies it all with measured fascination, noticing a set of DEEP GROOVES in the rocky wall.   Claw marks? DR. STABLER The rescue workers found it like this.   One spore is still intact. The other, well -- (",
      "dialogue_count": 0,
      "word_count": 2022
    },
    {
      "scene_number": 2,
      "slugline": "INT. VIDEO GAME ARCADE - NIGHT A high-decibel neon maze, teeming with JAPANESE TEENAGERS. Ford is firing a PLASTIC M-16 at the ON-SCREEN MONSTERS of a “first-person shooter” game.   Then his avatar gets stomped. Game over.   He hooks the rifle.   Noticing -- A GROUP OF TEENAGE JAPANESE GIRLS, giggling at him in a high- pitched hormonal squeal.   He smiles back.   Elle notices. ELLE How come you don’t try learning Japanese? FORD Don’t have to.   Six months from now, I’ll be in college, playing ball and partying on weeknights. He winks roguishly.   But the teenage girls JUST GIGGLE LOUDER.   Chattering in Japanese. ELLE That doesn’t help you now, though. FORD (a beat, she’s right) Alright, you win, gimme something. Elle thinks a moment, then WHISPERS SOMETHING IN HIS EAR. Ford listens, then steps over to the giggling teenage girls. And REPEATS THE LINE ALOUD IN JAPANESE -- Instantly, the giggling girls GO SILENT.   Then:   ONE GIRL smacks Ford hard across the cheek.   They all stalk off. Elle doubles-over, CACKLING at her prank. FORD You are so dead! He takes off RUNNING AFTER HER. EXT. BUSY MAIN STREET - NIGHT Ford and Elle burst out past OTHER PATRONS, laughing as they go, until at last Ford corners Elle and pins her, tickling furiously until she keels over to the sidewalk, LAUGHING HERSELF TO TEARS.   Neither of them noticing at first -- -- a SMALL PUDDLE OF WATER BUBBLING from a THIN CRACK in the pavement.   Slowly, the crack itself is SPLITTING WIDER. 12.",
      "characters": [],
      "action_text": "ELLE (sees it, breathless) Ford --?   Wait, wait! Then suddenly -- the GROUND RUMBLES SLIGHTLY WITH A TREMOR. ELLE Look! The tiny crack is BRANCHING UP THE SIDEWALK in the direction of the distant reactor towers.   Oddly, the night sky above the towers glows with a HAZE OF GREENISH AURORAL LIGHT. Ford and Elle look on for a beat, transfixed.   Then -- HIS CELL PHONE BUZZES.   Call from:   “ MOM. ”   Ford answers. LINDA (PRE-LAP) Ford?   Are you there --? EXT. NUCLEAR POWER PLANT - NIGHT Outside the REACTOR TOWERS.   The tremor has stopped.   PLANT WORKERS glance about, then hustle off with purpose.   As Linda returns to the station wagon, on her phone.   Looks anxious. LINDA I tried the house line.   Are you guys okay? EXT. BUSY MAIN STREET - NIGHT Ford has helped Elle to her feet.   Distracted by the strange “northern lights” in the sky above the distant plant. FORD What?   Yeah.   Just stepped out into the yard...   Mom, are you still at the plant, what’s going on? INT. STATION WAGON - NIGHT Linda tries to start the car.   But the ignition REVS AND CLICKS strangely. LINDA Of course, yeah.   Brody says it’s not a big... The ignition suddenly STARTS UP WITH A REV, as her CAR KEYS BEGIN TO CLATTER TOGETHER.   As if magnetically attracted. 13. LINDA (unnerved) I’m coming home. EXT. MAIN STREET - NIGHT Ford snaps to attention.   Home?   Already?   Grabs Elle. FORD ‘Kay mom, seeya in a minute. He starts to hang up. LINDA (ON PHONE) Hey. (this stops Ford) Aren’t you forgetting some- The word cuts off as THE LINE GOES DEAD. FORD Mom? Suddenly, THE GROUND SHAKES MASSIVELY. INT. PLANT CONTROL ROOM - NIGHT Pandemonium.   The entire matrix of control panels instantly GOES HAYWIRE. TAK Lost power to reactor two!   BRODY Shut down, shut down! Then the entire building RUMBLES.   And out the window behind Brody -- THE GIANT REACTOR TOWERS SHIFT ON THEIR FOUNDATIONS. EXT. MAIN STREET - NIGHT Ford and Elle watch as the reactor towers on the horizon SHIFT AGAIN, UNLEASHING A FORCEFU",
      "dialogue_count": 0,
      "word_count": 1416
    },
    {
      "scene_number": 3,
      "slugline": "INT. MARINE RESERVES OFFICE - SAN FRANCISCO - DAY PFC FLACO (20s) occupies one half of a desk in a downtown San Francisco office with windows onto the city.   Ford has just arrived in uniform, and sets his gym bag by his desk. PFC FLACO Fit tests like yours, you’d make Spec Ops in a cinch.   Why not see the world? Ford sits down and looks at a PHOTO ON HIS DESK:   EARLY-20s ELLE at her COLLEGE GRADUATION.   She went instead. FORD Lance Corporal, I just did three tours in two years.   Right now it’s just nice to be home.  Ding .   The door chimes as a PIMPLY NEW RECRUIT walks in. PIMPLY RECRUIT Private First Class Murphy, sir, here to register for duty. FORD We’re happy to have you, PFC, welcome to the Corps. EXT. SAN FRANCISCO STREET - DUSK Ford parks his ‘75 Camaro at the curb.   Kills the engine and climbs out with a BAG OF GROCERIES.   Then stiffens, seeing -- Brody, now 50, with many miles on the same kind face.   He is waiting on the stoop of FORD AND ELLE’S VICTORIAN ROW HOUSE. FORD (after a beat) Elle’s not home. Ford moves past him to the door.   Unlocking it. BRODY Actually, I came to see you. Ford looks back from the door.   Clearly less than thrilled by the prospect.   Then walks in.   Leaves it open. 18.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 232
    },
    {
      "scene_number": 4,
      "slugline": "INT. FORD AND ELLE’S APARTMENT - DUSK A warm space, clearly furnished with Elle’s touch.   Ford sets the groceries in the adjoining kitchen, as Brody steps in. Noticing a few framed FAMILY PHOTOGRAPHS on the credenza. FORD Bourbon, is it? BRODY Just some water. Ford reacts to this.   Brody not drinking.   That’s a new one. Ford begins to fix a cup of water from the faucet.   As Brody lingers in the foyer with the photos.   He takes them in. FRAMED PHOTO:   18-YEAR-OLD FORD, in dress blues at his basic training graduation, along with a smiling 13-YEAR-OLD ELLE. All the photos post-date the Hokkaido years.   Linda is in none.   Brody regards a recent portrait of Ford in uniform. BRODY Double chevron.   What’s that, a sergeant now? FORD Corporal. BRODY Right, Ellie told me.   She’s so proud.   Your mother would be, too. Ford tenses a bit.   Then sets the water on the counter. FORD You want to tell me why you’re here, Brody? A beat.   A deep breath.   He approaches the ADJOINING KITCHEN. BRODY Right. (trying to find the words; he digresses, re: photos) They evacuated us so fast, you know I don’t even have a picture of your mom? FORD (not having it) Look, Brody -- 19.",
      "characters": [],
      "action_text": "BRODY I lied. Just like that.   This is what he came to say.   The headline, anyway.   It takes a beat to formulate the rest.   Struggling. BRODY I lied, Ford.   They made me sign something saying it was my fault... But it wasn’t. FORD What are you talking about? BRODY It wasn’t normal.   There was an anomaly, a signal.   They tried to tell me it was nothing, but I know what I saw...   And now it’s happening again. FORD What is? BRODY It doesn’t matter.   Look, I put some money aside for you guys.   In this account. He pulls out a BANK LETTER.   Ford - not this again. FORD We don’t need your money, Brody. BRODY Please, I promised your mother. Family was everything to her.   I just need you to have it now, in case I don’t come back. This throws Ford off-guard.   A first hint of concern. FORD Hang on, back from where? But just then --   Ding-dong-ding-dong!   THE DOORBELL RINGING. FORD (to Brody, forceful) Wait right here. He moves to the front door, opening it to find -- 20. ELLE, 21 wearing the scrubs of a TRAINEE NURSE, while her affable friend REGGIE (30s) waits in a RUNNING CAR at the curb.   She BARGES PAST FORD IN A HURRY.   Talking fast on the run. FORD Um --   ELLE Hey, sorry, Reg is waiting in the car!   I just came to change, we’re meeting some friends for drinks... FORD Elle, wait! But Elle makes it into her REAR BEDROOM and shuts the door. We HEAR the sounds of RUSTLING CLOTHES as she hollers back. ELLE (O.S.) I know, I know, keep your phone on and call if you’re gonna stay out late...   Thanks mom. She continues on like this, as Ford rushes back to the kitchen to find -- Brody’s bank letter resting on the counter.   But Brody is nowhere to be seen.   The back door swings open on its hinges. FORD Shit! ELLE How do I look? As Elle at last appears behind him in her dress.   Oblivious. ELLE (PRE-LAP) How could you just let him leave? EXT. TRAILER PARK - NIGHT Ford follows Elle up the porch of a DILAPIDATED MOBILE HOME. Newspapers are piled on the steps, perh",
      "dialogue_count": 0,
      "word_count": 1028
    },
    {
      "scene_number": 5,
      "slugline": "INT. HALLWAY - NIGHT Ford moves down the hall, DUFFEL on his shoulder.   He pauses at Elle’s open door, regards her momentarily.   Fast asleep. Then Ford moves on, walking out. INT. SAPPORO AIRPORT - HOKKAIDO, JAPAN - NIGHT A CUSTOMS AGENT inspects an OPEN PASSPORT.   Glances up.   At Brody.   Smiling back.   The agent stamps the book. JAPANESE CUSTOMS AGENT Thank you, Mr. Brody, welcome to Japan. EXT. SHAKOTAN PENINSULA COASTLINE - NIGHT A tall ELECTRIC FENCE skirts the rocky coastal ridge.   Sheer bluffs plunge down to a cave-like OCEAN INLET -- SUPERIMPOSE:  QUARANTINE ZONE PERIMETER - HOKKAIDO, JAPAN  Where a SMALL SKIFF is tied up, idling.   As Brody climbs out with an EQUIPMENT BAG.   A GRUFF SMUGGLER pockets cash.   Then revs the engine and motors off into the night.   Calling back. JAPANESE SMUGGLER (SUBTITLE) One hour. As Brody unzips his equipment bag. EXT. DESERTED OUTSKIRTS - NIGHT The SOUND OF GAS MASK BREATHING.   Brody treks along the long- deserted rural highway in a HAZMAT RADIATION SUIT.   He carries a CLICKING GEIGER COUNTER and a TELEPHOTO CAMERA. Abandoned trucks and cars still jam the road, long-since overgrown by weeds and vines.   Frostbitten sunflowers have sprouted up through DEEP CRACKS in the pavement.   Brody plucks one and seals it in a jar.   Tucking away the specimen for further study.   This world has been reclaimed by nature. EXT. COASTLINE - NIGHT As the SPOTLIGHT of a PATROL BOAT sweeps the rocky shore. Passing right over the CLIPPED SECTION OF ELECTRIC FENCE... 24.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 250
    },
    {
      "scene_number": 6,
      "slugline": "INT. BRODY-MADDOX HOUSE - NIGHT A FLASHLIGHT pans the dark, deserted house.   Apart from a layer of dust and cobwebs, the home appears exactly as we saw it last.   Still stuck in time.   Brody warily steps in. INT. FORD’S BEDROOM - NIGHT Brody’s flashlight illuminates Ford’s room, still in boxes, except that University of California poster on the door, now half-peeled and filmed in dust.   An old dream, long lost. INT. MASTER BEDROOM - NIGHT Brody’s flashlight settles on a spot on the floor.   His necktie, still right where Linda left it.   A FRAMED PHOTO has fallen on its face beside it.   Brody kneels to retrieve it -- It is a WEDDING PHOTO of the family.   Linda in her gown and Brody in his tux beside her.   Along with a beaming 8-YEAR-OLD ELLE and a somewhat surly-looking TEENAGE FORD.   Brody slides the photo it from its frame.   Regarding it for an extended beat.   Everything he lost.   Tears welling in his eyes. When suddenly, the PICTURE FRAME STARTS RATTLING.   Shifting slowly at first, then skittering fast across the floor -- into the base of a METAL LAMP.   It clamps there.   MAGNETIZED. All at once, THE LAMP BEGINS TO FLICKER WITH LIGHT. LINDA’S HAIR DRYER whirs to life.   Attracting nearby HAIRPINS with the same magnetic force.   Around the room, every electrical object in sight has strangely become MAGNETIC. Brody goes still, unnerved. EXT. DESERTED SUBURBAN NEIGHBORHOOD - NIGHT Brody emerges from the house to find the entire street of homes is affected by the phenomenon.   Long decrepit street- lamps flicker.   Cars in driveways REV THEIR ENGINES. TELEVISIONS and RADIOS blurt staticky bits of programming. Over the horizon where the nuclear plant once stood, the night sky glows and swirls with GREENISH AURORAL LIGHT. Captivated for a moment, Brody forgets himself.   Then remembers his Geiger counter:   it’s oscilloscope is spiking wildly.   He PULLS OUT A NOTEBOOK, capturing the pattern.   As: 25.",
      "characters": [],
      "action_text": "Click!   The BARREL OF A RIFLE levels at his temple.   Aimed at the other end by a UNITED NATIONS GUARD IN HAZMAT GEAR. THREE MORE GUARDS converge as well.   They wear EMBLEMS with the same insignias we saw on the experts in Siberia. CUT TO: Brody sits cuffed and hooded in the back seat of an ARMORED HUMVEE as it rattles down a SCRUB-COVERED ACCESS ROAD... EXT. MUTO BASE CAMP - NIGHT Where the Jancorp Nuclear Power Plant once stood.   The sinkhole that swallowed its reactors is now surrounded by an immense MATRIX OF SCAFFOLDING.   FLOODLIGHTS illuminate a STAGING AREA OF UTILITY BUILDINGS, abuzz with EXPERTS and TECHNICIANS in Hazmat gear, wheeling equipment to and fro. AMONG THEM, Honda, now 50, moves with purpose.   Accompanied by several colleagues we recognize from the mine disaster in Siberia. DR. STABLER The charge is fluctuating heavily, wild swings.   Bayer has transport waiting for the containment island. Honda furrows his brow with concern. HONDA Let’s just hope containment is an option. GUARD 1 hustles up to catch them. GUARD 1 Dr. Honda, we have a situation. INT. UTILITY BUILDING - NIGHT Brody has been locked behind a pane of one-way glass.   He paces agitatedly.   Hollering at his unseen captors -- But all we hear is MUFFLED SHOUTING.   As Honda sorts through BRODY’S WALLET and effects:   ID card; a PHOTO of Elle in nurse’s scrubs; another of Ford in uniform. GUARD 1 He’s been like this since we brought him in.   Says he used to work here, safety engineer... 26. But Honda stops him.   Intrigued by BRODY’S NOTEBOOK.   Flips past the FAMILY PHOTO FROM THE ABANDONED HOUSE to find -- a schematic map of the world, with DATA POINTS IN UNITS HERTZ. HONDA He seems to know the signal.   He’s been recording it.   But look here -- A second schematic map with similar data points.   But this one is not of Japan.   It centered on the desert of Nevada. HONDA (concerned) -- he shows the same pattern coming from Nevada? Just then, a KLAXON on the PA sounds. LOUDSPEAKERS",
      "dialogue_count": 0,
      "word_count": 1249
    },
    {
      "scene_number": 7,
      "slugline": "EXT. MUTO BASE SCAFFOLDING - NIGHT ALERT KLAXONS begin to sound.   Fascinated scientists and guards peer from catwalks.   Catching glimpses of: THE MUTO COCOON as it PULSES FASTER with its inner glow, briefly silhouetting the gigantic twisted embryo within.   Its limbs SHIFT, like a hatchling in its shell.   Ready to awaken. LOUDSPEAKERS  All personnel, please clear the first perimeter.  Some technicians back away.   Others are too rapt to move.  SKRRRIT!   A CRACK SPIDERWEBS THE TOP OF THE COCOON, spraying huge chunks of hardened yellow shell. Technicians stagger back on all the catwalks.   But still they stare.   Not a soul can peel his eyes away. As A LONG, PREHENSILE LIMB SHATTERS FROM THE SHELL.   And then, in a single surge, the CREATURE EXPLODES UPWARDS from its cocoon.   About to engulf the catwalks high above -- But before it can, EXPLOSIVE BOLTS unleash a HUGE WIRE CAST NET, ensnaring the ENORMOUS ANIMAL.   HIGH-TENSILE CABLES snap taut from a hundred points.   Trapping it.   As POWERFUL FLOODLIGHTS clank on, illuminating: THE HOKKAIDO MASSIVE UNIDENTIFIED TARGET ORGANISM, AKA: “THE HOKMUTO,” writhing and HISSING ANGRILY beneath its net...   STATIC ELECTRICITY ripples across its hide.   But the animal has been captured; a giant, mutant specimen contained. ON THE SCAFFOLDING, scientists and technicians erupt in CHEERS.   Trading handshakes, backslaps, marveling at their “catch.” INT. CROW’S NEST CONTROL BOOTH - NIGHT But high above them, Honda is on edge.   As a confident Bayer beams with pride. BAYER Magnificent.   Prepare to stun. The technicians amp a set of voltage dials. 30.",
      "characters": [],
      "action_text": "ANGLE ON THE HOKMUTO As a POWERFUL ELECTRIC CHARGE jolts through the wire snare, electrocuting the creature in its net.   The animal SCREECHES LOUDLY, then ERUPTS IN ANGER, straining at its bonds.   Far from stunned, the creature seems even stronger now.   High- tensile CABLES STRETCH TAUT AGAINST THEIR WINCHES. ANGLE ON HONDA Looking on in rising dread. HONDA It’s absorbing the electricity. Just like the gamma spectrum. BAYER Go to full power. But as ANOTHER JOLT OF ELECTRICITY ripples through the netting, THE HOKMUTO REARS UP ON ITS HIND LEGS AND GLOWS WITH BIOLUMINESCENCE, as if charging some internal capacitor -- THEN IT SLAMS DOWN WITH A BLOOD-CURDLING HOWL so powerful it splits the air like lightning, generating a SHOCK-WAVE OF AURORAL LIGHT THAT SHORTS OUT EVERY CIRCUIT IN THE BASE CAMP. INT. UTILITY BUILDING - NIGHT As the loud SNAP echoes, the lights go out. Guards quickly rush outside, forgetting -- Brody, still behind the one-way glass.   The MAGNETIC DOORLOCK to his cell has lost its power, too.   Its LED blinks out. EXT. MUTO BASE CAMP - NIGHT Brody emerges to find a scene of chaos.   He has put back on his Hazmat suit and the ECHO OF ITS GAS MASK BREATHING muffles the ALARM KLAXONS and DESPERATE SHOUTS, as DROVES OF TECHNICIANS AND GUARDS COME FLEEING FROM THE SCAFFOLDING. A HUGE APPENDAGE SMASHES THROUGH THE NEAREST CATWALKS, obliterating them in a frightening hail of twisted steel. Brody is knocked to the ground and trapped beneath the rubble.   Injured, but still conscious, he looks up to see -- The Hokmuto, towering high above on six gigantic, articulated limbs.   And as the mutant monster SMASHES THROUGH THE CAMP... 31.",
      "dialogue_count": 0,
      "word_count": 531
    },
    {
      "scene_number": 8,
      "slugline": "INT. JAPAN AIRLINES 747 - FLYING - NIGHT A fasten seat-belt sign lights up with a gentle “ Ding! ” Ford’s eyes flutter open as PASSENGERS jostle to their seats. A JAPANESE BOY, 8, is making “shooting noises” as he aims a finger gun at Ford across the aisle.   Just the normal chaos. JAPANESE BOY  Ban-ban-ban!   Ban-ban-ban!  Ford strains to hear the announcement on the PA SPEAKER. PA SPEAKER (V.O.)  Due to events on the ground at our destination, we will be making an unplanned landing in Honolulu.   Please remain seated with your...  FORD (confused, to STEWARDESS) Wait, what?   Already? INT. HONOLULU AIRPORT - ARRIVALS TERMINAL - NIGHT The large arrivals terminal is in a state of utter bedlam. GROUNDED TRAVELERS crowd around the customer service desk, barking questions at a single harried EMPLOYEE. AIRLINE EMPLOYEE (for the umpteenth time) It was an earthquake, all flights to Japan have been diverted. Ford is angling for attention. FORD Earthquake?   Where in Japan? But other travelers press closer to the desk in front of him. Ford steps back, unsettled.   Noticing: A FLAT SCREEN TELEVISION ON THE WALL has just cut to BREAKING NEWS.   EMERGENCY VEHICLES speed past the Hokkaido Quarantine Zone border.   A scrawl announces:  “9.0 EARTHQUAKE ROCKS JAPAN...   HOKKAIDO Q-ZONE HIT AGAIN...”  Off Ford, a look of deep concern. CUT TO: STRETCHERS MOVING PAST and loaded onto a MEDEVAC HELICOPTER -- WHERE WE FIND an unconscious Brody, alongside DOZENS OF OTHER INJURED VICTIMS FROM THE REACTOR BASE.   Shutting the doors. 32.",
      "characters": [],
      "action_text": "NAVY MEDIC (shouts above the rotors) We’ve got beds waiting on the base at Pearl Harbor, go, go! EXT. PACIFIC OCEAN - NIGHT The MEDEVAC CHOPPER lifts off the REAR LAUNCH DECK of a US NAVY HOSPITAL SHIP, plying the waters of the North Pacific. It is a big ship, surrounded by a large fleet of MILITARY VESSELS.   Two destroyers, a missile cruiser, and a Nimitz- class nuclear-powered SUPERCARRIER:   USS Harry S. Truman . SUPERIMPOSE:  USS HARRY S. TRUMAN - NORTH PACIFIC OCEAN  EXT.   USS HARRY S. TRUMAN   - FLIGHT DECK - NIGHT A KESTREL EXECUTIVE TRANSPORT HELICOPTER has just landed on the flight deck, rotors spinning down, as an entourage of HIGH-LEVEL MILITARY BRASS is hustled out, led by: ADMIRAL STENZ, 50, Vice Chairman of the Joint Chiefs of Staff.   He carries a “TOP SECRET” BRIEFING BOOK. The CAPTAIN salutes him, which the Admiral waves off brusquely.   Already walking fast towards the TOWER BRIDGE. Words cannot be heard above the HELICOPTER ROTOR BLAST. INT.   USS HARRY S. TRUMAN   - TOWER SUPERSTRUCTURE - NIGHT ADM Stenz and his CSO (LT CMDR HAMM) are on the move, talking fast as they follow the captain up ladders, entourage in tow. ADM STENZ Earthquake?   How the hell long do we expect to keep that cover? LT CMDR HAMM The Hokkaido zone was already quarantined, so the creature burrowed to the ocean without passing through a population center.   This battle group has been following its last known course since then, heading East towards Hawaii, but the thing plays broke- dick with our sonar. They arrive at a bulkhead hatch, ducking into -- 33.",
      "dialogue_count": 0,
      "word_count": 520
    },
    {
      "scene_number": 9,
      "slugline": "INT.   USS HARRY S. TRUMAN   - TAC-OPS CENTER - NIGHT The large briefing room is packed with haggard EXPERTS from the reactor base, all arguing loudly across the table. BAYER Our fault?   That kind of electrical attack is unprecedented. DOCTOR STABLER No it isn’t.   Pistol shrimp emit a static charge strong enough to short a circuit. Extrapolate that out to something this size and imagine what it can do. BAYER Look, we planned for every predictable contingency. HONDA But disasters are the contingencies we can’t predict. ADM STENZ (entering) GENTLEMEN! ADM Stenz silences the clangor with a TWO-TONE WHISTLE, as he steps through the door.   Followed by his staff. ADM STENZ Who’s in charge here? Bayer rises to his feet, imperiously.   Extends a hand. BAYER Professor Bayer, director of the United Nations’ Special MUTO Unit. That’s “Massive Unidentified...” ADM STENZ (cuts him off) “Target Organisms,” I know what it is.   It’s the Black Ops black hole that’s been swallowing my budget for the last ten years. BAYER Longer, actually.   Evidence of large-scale pre-Jurassic organisms predates the current -- ADM STENZ I read the briefing.   Stick to this one...   “Hok-muto.” 34.",
      "characters": [],
      "action_text": "BAYER For Hokkaido.   It burrowed there from Siberia ten years ago after a crew of uranium miners discovered its spore inside a much larger carcass in the ice. MONITORS DISPLAY ARCHIVE FOOTAGE as they talk.   We glimpse bits as the scene proceeds:   the Siberian mining camp from high above.   An EXCAVATION CREW busies about the vague dark shape of a GARGANTUAN FOSSIL IN THE ICE. PARTIAL VIEWS suggest the larger creature’s features:   maple leaf-shaped dorsal fins, extended tail. MORE CUT FOOTAGE:   SCIENTISTS examine the REMNANTS of the one hatched spore; as the SECOND INTACT SPORE is crane-lifted out of the huge carcass in the Siberian ice. BAYER DNA confirmed the spores were laid inside the larger creature - by these smaller animals. VIEWS show TWO SMALLER FOSSILS (ADULT “MUTOS,” MALE AND FEMALE), entwined around the massive creature in the ice. All three fossils are extremely decomposed, but on the “FEMALE MUTO” we may glimpse -- WHAT LOOK LIKE WINGS. Honda breaks in for the first time. HONDA We believe the MUTOs killed the larger creature to use its body as a host for their young. BAYER (beleaguered) Admiral Stenz, meet Professor Honda. HONDA And parasites are host-specific. So the Hokmuto will be hunting for another like it. ADM STENZ Like the -- (motioning to the larger fossil) What’s it called? 35. HONDA “Jira,” after the Japanese for “whale.” ADM STENZ Fine. (bungles the pronunciation) But these “Zilla” things are all extinct? HONDA Maybe not.   There was one, sixty years ago.   First sighted after the bombings of Hiroshima and Nagasaki. We believe the nuclear radiation affected him somehow.   He became the bane of your atomic fleet.   At first, you thought it was the Russians, they thought it was you, eventually both countries made a pact to kill it.   All those nuclear tests in the South Pacific?   They weren’t tests. BAYER (chimes in; old news) But that creature was killed at Bikini Atoll in   nineteen fifty- four .   There’s been no sign since. Honda qui",
      "dialogue_count": 0,
      "word_count": 4269
    },
    {
      "scene_number": 10,
      "slugline": "EXT. PACIFIC OCEAN - DAY The CARRIER BATTLE GROUP has been reduced by several ships. Those that remain trek the waters of the North Pacific -- Following a DARK SHAPE moving beneath the water up ahead. Three rows of jagged dorsal fins, a whip-like tail: GODZILLA IS SWIMMING EAST, as UAVs skim just above the surface, like a flock of seabirds dogging an Orca.   The naval fleet follows at a safe distance. SUPERIMPOSE:  USS HARRY S. TRUMAN - 500 MI EAST OF HAWAII  LT CMDR HAMM (PRE-LAP) The creature has been swimming due East for the last twelve hours. As the Kestrel transport touches down upon the flight deck. INT.   USS HARRY S. TRUMAN   - TAC-OPS CENTER - DAY MONITORS display the view of Godzilla swimming up ahead. ADM STENZ And we’re sure this is the same one we nuked at Bikini -- (bungles it again) What was it, God-zilla? BAYER  Gojira .   Yes, Admiral.   It matches all the size data in our records. During this, Honda sits apart.   With BRODY’S NOTEBOOK AND EFFECTS.   He flips past:   PHOTOS of Elle in scrubs; Ford in uniform; the FAMILY PORTRAIT.   Finding the SIGNAL DATA: It is a map showing the “ INCIDENCE OF EXTREMELY LONG WAVE SIGNALS .”   One cluster in Hokkaido; the second in Nevada. Each signal bears a TIME AND DATE.   Honda studies these. ADM STENZ But I don’t get it, I thought the Hokmuto would lure it as a host. Instead, it got its tail whipped. BAYER The fossil records in Siberia suggest this Muto species usually hunts in pairs.   This one was alone - clearly just out-matched. 52.",
      "characters": [],
      "action_text": "ADM STENZ Thank god for that. Honda has begun to scribble on a pad.   Under the header “ MUTO SIGNALS ” he labels two columns:   “ HOKKAIDO   /   NEVADA .”   And begins to COPY THE MUTO SIGNALS.   Ordering them by date -- First one in Hokkaido...   Next one in Nevada...   Then Hokkaido...   Then Nevada...   Hokkaido...   Nevada... Honda flags down Dr. Stabler, showing him the data. HONDA It’s a second set of signals. DR. STABLER Where’d you get this, that guy at the plant?   He was a quack. HONDA No, it’s a pattern, look.   The Hokmuto’s signal from Hokkaido... Then another from Nevada, the next day.   It goes on like that. DR. STABLER (realizing) Like a call response. HONDA (nodding, “yes”) A conversation.   Starting the same week that the Hokmuto roused from hibernation. DR STABLER You think there’s a mate? HONDA (leaps up, urgently) Mr. Bayer! But Bayer is busy briefing Stenz across the way. BAYER Just a moment, Mr. Honda. HONDA I need to know where we disposed of the second MUTO spore. BAYER (distracted) In the desert.   Why? 53. HONDA Where in the desert? BAYER It was radioactive, Honda, we put it... (a beat, as the terrifying realization dawns) In the same place we store all our nuclear waste. Their eyes lock.   The awful gravity of this sinking in. CUT TO: A CARAVAN OF GOVERNMENT VEHICLES speeds along a DESERT HIGHWAY, past a FADED ROAD SIGN:  “WELCOME TO NYE COUNTY, NEVADA BIRTHPLACE OF THE ATOMIC BOMB”  The desolate SANDSTONE FACE OF YUCCA MOUNTAIN rises over the horizon.   Razor wire surrounds more SIGNAGE:   “ KEEP OUT! ”   A GUARD BOOTH sits abandoned.   Cold coffee on a desk. SUPERIMPOSE:  AREA 25 - NEVADA NATIONAL SECURITY SITE  EXT. YUCCA MOUNTAIN CONTAINMENT FACILITY - DAY As the CARAVAN ARRIVES, a CREW OF CONTAINMENT PERSONNEL in Hazmat gear rush out to find -- The SECURITY GUARD, slumped outside the OPEN HATCH TO THE CONTAINMENT TUNNELS -- clearing trying to escape from something inside.   One HAZMAT CREW MAN checks his pulse; deceased.   As the re",
      "dialogue_count": 0,
      "word_count": 962
    },
    {
      "scene_number": 11,
      "slugline": "INT. CASINO FLOOR - LAS VEGAS, NEVADA NIGHT The glare and clatter of Sin City.   GAMBLERS sit at slot machines, feeding in their salaries.   When suddenly -- CHA-CHING!   A fruit-machine spits COINS INTO A CUP. GAMBLER 1 Jackpot! Heads turn.   But just then, unbelievably, ANOTHER SLOT MACHINE pays out.   And then another.   And another...   All down the line.   Every machine in the casino is paying out. Then all at once, the LIGHTS IN THE CASINO DIM AND FLICKER. A moment later, there is a DISTANT HOWLING ROAR. EXT. OUTDOOR PEDESTRIAN ARCADE - NIGHT OUTDOOR MUSIC drowns the roar.   SPECTATORS are gathered below a VAULTED SCRIM, as a DAZZLING LASER LIGHT SHOW plays across the starry sky.   But then:   THE LIGHTS AND MUSIC STOP. The spectators are left in darkness, silence.   But just as an impatient murmur starts -- THE DAZZLING LIGHT SHOW RESUMES. Filling the entire sky above them.   Brilliant colors, brighter than before, so bright the spectators must squint. Because it’s not the show at all.   It is THE BIOLUMINESCENT UNDERBELLY OF ANOTHER GIANT MUTO STRADDLING THE STREET ABOVE. A FEMALE MUTO (”THE FEMUTO”), even larger than the last.   And as SHE ROARS -- EXT. LAS VEGAS STRIP - NIGHT Every single light on the Las Vegas strip GOES OUT. INT. FORD AND ELLE’S APARTMENT - SAN FRANCISCO - DUSK Elle is pacing on the phone, Reggie still glued to the TV, still tuned to CNN.   Where FOOTAGE CUTS to the Nevada desert. NEWS ANCHOR (ON TV)  Live to Nevada, just moments ago, where multiple reports are...  But Elle shuts it -- as her call rings through to VOICE MAIL. 56.",
      "characters": [],
      "action_text": "FORD (ON PHONE) (recorded)  This is Ford.   Leave one.  Elle, exasperated, tosses down the phone. REGGIE Hey.   You know it’s just the tower down.   He’ll be okay, babe. ELLE He wouldn’t have gone if not for me.   I pushed him into it.   It’s my fault, after everything he’s -- Just then, RIGHT OUT THE WINDOW ON THE STREET BEHIND HER --  WHAM!   FOUR CARS smash together in the intersection. EXT. SAN FRANCISCO INTERSECTION - DUSK Elle and Reggie sprint out down the sidewalk, as the four cars SPIN TO A STOP in a shower of broken glass.   The DRIVERS stagger to their feet, a few cuts and bruises but intact. DRIVER 1 What are you, nuts, you had a red? DRIVER 2 So did you, the lights went out! Indeed, EVERY TRAFFIC LANTERN IN THE AREA IS BLINKING RED. ELLE (rushing up) Is everyone okay? But the drivers are suddenly distracted by something up above -- A MILITARY HUMVEE SLOWLY PARACHUTING FROM THE SKY.  Thunk!   The humvee creaks down at the center of the junction. Its enormous parachute gently floating in.   And now we see: DOZENS OF SOLDIERS parachuting into downtown San Francisco.   They hit the street and quickly arm themselves while stunned PEDESTRIANS look on. The war is coming home. LT CMDR HAMM (PRE-LAP) We just lost Nellis on the comm, the creature is bearing west. 57.",
      "dialogue_count": 0,
      "word_count": 501
    },
    {
      "scene_number": 12,
      "slugline": "INT.   USS HARRY S. TRUMAN   - TAC-OPS CENTER - NIGHT SCREENS show FOOTAGE of THE FEMUTO at Nellis Air Force Base outside Vegas.   As CHOPPERS and FIGHTER JETS unleash a hell- storm of ammunition...   But nothing seems to faze the thing. It OBLITERATES A TANK. ADM Stenz can take no more, stands up and turns away. SUPERIMPOSE:  USS HARRY S. TRUMAN - 900 MI WEST OF CALIFORNIA  ADM STENZ Someone please explain this to me. If we knew these things could feed on radiation, why the hell did we bury it in a nuclear waste dump? BAYER With all due respect, sir, we believed that spore was dead. HONDA Dormant.   It’s not the same. ADM STENZ Obviously not. (a beat, collects himself) If the last one lured Godzilla as a host, will this one do the same? Honda indicates a GEOSPATIAL MAP tracking the progress of Godzilla from Hawaii, in a straight line towards California. HONDA He’s already headed towards California.   I’m guessing he’s heard her call. ADM STENZ Hang on, “her” call?   You’re saying this one’s a female? HONDA I’m not sure... PULLS UP IMAGES of the Siberian carcasses in the ice.   The Adult Male and Female MUTOs.   One of them HAS WINGS. HONDA I would have expected it to have wings - given the earlier specimen. 58.",
      "characters": [],
      "action_text": "ADM STENZ Well, let’s be glad it doesn’t. Where’s it going? Bayer brings up a GEOSPATIAL MAP.   Tracking the progress of the Femuto -- following A ZIG-ZAG PATTERN WEST. BAYER This is the new Muto’s course so far.   Now if we bring up nuclear site locations on the GIS... RADIATION HAZARD SYMBOLS POP UP ACROSS THE MAP, indicating each nulcear facility.   The Femuto’s course lines up exactly. ADM STENZ She’s following the radiation. HONDA Except here, this is wrong. (indicates a RECENT TURN) If she continued on a straight path, she’d reach the nuclear plant at Morro Bay.   Instead she turns to the north.   Into the mountains. Honda traces the path still farther.   To a GRAYED OUT SECTION OF THE MAP DUE EAST OF SAN FRANCISCO.   A LABEL READS:  “NORAD - RESTRICTED ZONE”  The military brass trade knowing, troubled looks. HONDA What are you keeping here, Admiral? LT CMDR HAMM Sir, the contents of that facility are highly... ADM STENZ (cuts him short, doesn’t care) We’ve got two hundred and fifty ballistic missiles in that arsenal. It’s not exactly public record. This hangs a beat. HONDA Well it is to her. 59. ADM STENZ (to Hamm) Get those missiles out of there and get techs working to shield the electronics against these things. EXT. TWENTYNINE PALMS MARINE BASE - TARMAC - DAY The C-17 has landed.   Marines deplane.   As Ford checks his cell phone for a call from Elle:   “ NO SERVICE .”   Approaching a SERGEANT (WALTZ) waiting by a CHINOOK TRANSPORT CHOPPER. SUPERIMPOSE:  TWENTYNINE PALMS MARINE BASE - CALIFORNIA  FORD Corporal Maddox, sir, I’m looking for a transpo up to San Fran? But SGT Waltz is busy on his radio.   Receiving orders. SGT WALTZ Yessir.   Platoon of reserves just got here... (grabs Ford) You got cammies in that bag, marine?   Get in the chopper. FORD Sir, I’m not deployed, just headed home. SGT WALTZ If we don’t do this job, soldier, you may not have a home to head back to. A beat.   Ford glances back at the cell phone in his hand -- then shoves it back i",
      "dialogue_count": 0,
      "word_count": 1160
    },
    {
      "scene_number": 13,
      "slugline": "INT. FAMILY STATION WAGON - DAY The car is piled with CLOTHING and BELONGINGS.   HORNS BLARE outside as a MOTHER and FATHER bicker in the front seat. FATHER (O.S.) I’m trying, I’m trying!   No one’s moved an inch... Their YOUNG DAUGHTER clutches a TEDDY BEAR in back.   The first to hear the CHIME of RAILROAD WARNING BELLS.   Then -- The RAILWAY CROSSING GATE ARM lands directly on their windshield.   Their car is on the tracks.   As the ICBM FREIGHT TRAIN rounds a nearby bend -- bearing in. The Father slams the gas, but his TIRES SPIN IN MUD.   As OTHER PASSENGERS abandon their cars entirely.   Ding-ding-ding- ding!   The train is closing in.   But just as it does -- The tires grab and the car BUCKS FORWARD, clearing the inbound train by inches as it SCREAMS PAST THE LEVEL CROSSING -- smashing through the other cars abandoned on the tracks. ANGLE ON FORD Standing guard aboard the ICBM arsenal train.   As it speeds past the highway, affording him a brief full view of the exodus -- a line of vehicles, stretching to the far horizon. Ford and Tre trade looks as the gravity sets in.   The train drawing past a veil of trees, leaving the exodus behind. EXT. ARSENAL TRAIN - DUSK BLACK SMOKE looms above the dense sequoia forest on either side of the tracks, as the TRAIN WINDS UP A MOUNTAINSIDE. WEAPONS TECHNICIANS are working on ONE ICBM WARHEAD.   They have an access panel open.   They are retro-fitting it. WEAPONS TECH 1 (shouts to his team) Alright, this one’s shielded. Close her up and let’s get to the next one! Ford and his platoon stand guard alongside the GIANT ICBM, reacting nervously to the POUND OF ARTILLERY in the distance. SGT WALTZ Don’t look so worried.   They’re modding-up these things to withstand Armageddon. 63.",
      "characters": [],
      "action_text": "To prove his point, the SGT POUNDS HIS RIFLE BUTT against the giant ICBM FUSELAGE.   It clangs harmlessly.   Echoing. Yet Ford and Tre trade looks, uneasy. EXT. MOUNTAIN PASS - NIGHT  SCREECH!   The train jolts as it brakes to a stop outside a NARROW RAILWAY TUNNEL through the rocky mountainside ahead. The SOUNDS OF BATTLE are closer now.   Dense smoke hangs low. The SGT leans over to his RADIO OPERATOR. SGT WALTZ What’s the status on the track ahead? The radio operator tweaks his dials, scanning through WAVES OF INTERFERENCE.   A few crisp VOICES come through: VOICES (ON RADIO) (filtered, distorted)  Mayday!   Mayday!   Mayday!  Then the SOUND OF SCREAMING.   Then silence.   Even the shelling in the distance stops.   A long beat passes.   Then: STATIC SNAPS THE AIR LIKE LIGHTNING, causing the TRAIN’S LAMPS TO GO DARK.   The radio shorts out, too, leaving us in silence, darkness.   The soldiers tense their bodies. Ford has been through this before.   Instinctively, like a child in a lightning storm, he starts counting softly: FORD One-Mississippi, two-Mississippi, three-Mississippi... Tre, a city boy, just watches him, unnerved. TRE What’cha doin’, man? FORD Summer storms.   Mom used to say you could tell how far away it was by counting off between the lightning and the thunder. TRE So how far is it? 64. THE FEMUTO’S CHILLING HOWL echoes from the distance, RICOCHETING FROM SIDE TO SIDE ACROSS THE MOUNTAIN PASS.   Soldiers stiffen, aiming their M16s in all directions.   Uncertain where it came from. Tre glances at Ford, jittery.   Then STATIC SNAPS THE AIR AGAIN.   This time, Tre joins in counting with him. TRE One-Mississippi, two- Mississippi, three- Mississippi... FORD One-Mississippi, two- Mississippi, three- Mississippi... THE FEMUTO’S HOWL CUTS THEM OFF AGAIN.   Louder this time. FORD It’s close. Ford regards the flashlight on his rifle.   Smoke threads from its BURNED OUT FUSE.   Ford uncaps it, replacing the burned fuse with his spare.   The light comes on.  ",
      "dialogue_count": 0,
      "word_count": 1087
    },
    {
      "scene_number": 14,
      "slugline": "INT. LOCOMOTIVE ENGINE ROOM - NIGHT CONTROL PANELS LIGHT BACK UP, as the ENGINEER replaces a final fuse.   Tre’s “All clear” filters in over the radio. ENGINEER That’s an all clear.   Remember this thing senses electricity.   Build up some steam then coast the bridge with the engines off.   Lights out. EXT. ARSENAL TRAIN - NIGHT The massive Diesel engines churn to life.   Marines astride the ICBM missiles pass the order verbally: MARINES Lights out!   Lights out! Flashlights and radios are switched off.   The train CHUGS FORWARD, picking up a head of steam, as it ENTERS THE TUNNEL. INT. RAILWAY TUNNEL - NIGHT Then THE ENGINES CUT.   The train coasts through the tunnel in total darkness, just the SPARKS OF WHEELS ON TRACK.   Soldiers tense as the train slowly glides on toward the fog ahead. EXT. UNDER THE BRIDGE - NIGHT The SGT and Rifleman look up as the bridge BEGINS TO TREMBLE with the train’s approach.   Then suddenly, the SGT pauses. Something JUST MOVED inside the nearest stand of trees.   The two men duck for cover behind a huge sequoia.   But then THE ENTIRE TREE UPROOTS ITSELF FROM THE GROUND.   Looking up, we realize it was no tree at all, it was THE FEMUTO’S GIANT LEG. SGT WALTZ HOT ZONE!   TAKE COVER! THE GIANT BEAST ABOVE THEM trundles through the river toward the trestle bridge. EXT. TALL TRESTLE BRIDGE - NIGHT Ford and Tre freeze stock-still, laying on their backs in perfect silence.   As the Femuto dips in right below them. Her SENSORS GLOW with luminescence as she “SNIFFS” the air. 67.",
      "characters": [],
      "action_text": "Sensing their electric currents. Tre’s FLASHLIGHT FLICKERS.   Terrified, he grips his rifle tighter.   Preparing to roll over for a shot -- but Ford reaches out and stops him with a hand.   THEN SHUTS THE LIGHT. Putting a finger to his lips to signal silence.   Stay cool. After a moment, the Femuto seems to lose their scent.   She backs her head out from under the bridge.   Instead, she RISES TALLER ON HER GIANT LEGS -- and STEPS RIGHT OVER THE BRIDGE ITSELF.   Straddling it.   ONE HUGE LUMINESCENT SPORE hangs just above Ford’s head.   Then the Femuto starts to move off. But the BRIDGE BEGINS TO RATTLE LOUDER.   The train is coming from the tunnel.   THE FEMUTO PIVOTS QUICKLY, sensing it. EXT. ARSENAL TRAIN - NIGHT Marines clench their M16s as the train emerges from the tunnel into a peaceful world of mist.   They all look forward. Failing to notice THE GIANT SILHOUETTE GLIDING IN ABOVE THEM. EXT. TRESTLE BRIDGE - NIGHT Ford and Tre take off running towards the fog-bank. FORD STOP THE TRAIN!   TRE LOOK OUT! But A HUGE ROAR drowns their shouts.   Followed by the POP AND FLASH OF GUNFIRE within the fog.   All hell has broken loose. Then suddenly.   The RUNAWAY TRAIN COMES CHARGING TOWARDS THEM, flames pluming from its burning engine as the huge Femuto ravages the rail cars from above, snatching up the ICBM MISSILES like so many giant pick-up sticks. Ford and Tre take off running from the train -- but Tre’s boot catches in a gap between the slats, just as a GIANT LIMB SWIPES THROUGH, OBLITERATING THE SECTION WHERE HE STOOD. With nowhere to go and the train barreling in, FORD LEAPS -- OFF THE BRIDGE, and PLUNGES TO THE CHURNING RIVER DOWN BELOW, as an entire rail car stacked with ICBMs crashes down behind him.   Ford can only glimpse the carnage before the CURRENT DRAGS HIM UNDER.   The last SOUND he hears is THE FEMUTO’S HELLISH HOWL. SMASH CUT TO: 68.",
      "dialogue_count": 0,
      "word_count": 592
    },
    {
      "scene_number": 15,
      "slugline": "EXT. NORTH PACIFIC OCEAN - NIGHT The   USS Harry S. Truman   and its battle group trail behind -- Godzilla, still swimming due East across the North Pacific. As CHOPPER SPOTLIGHTS illuminate his jagged dorsal ranges. SUPERIMPOSE:  USS HARRY S. TRUMAN - 500 MI WEST OF CALIFORNIA  LT CMDR HAMM (PRE-LAP) Godzilla seems to be correcting course with each adjustment by the female Muto -- INT.   USS HARRY S. TRUMAN   - TAC-OPS CENTER - NIGHT The bad news registers with all concerned. LT CMDR HAMM At this rate, they’ll both reach San Francisco Bay by sunup. HONDA And they will fight.   And if she kills him, she will use his body as a host to reproduce. ADM STENZ What are my options, gentlemen? We’ve already seen what damage one of these can do... BAYER Our nukes are much stronger these days than they were at Bikini Atoll. HONDA Are you insane?   Nuclear weapons started this.   They won’t end it. ADM STENZ (adds, confused) And I thought these things ate nukes for breakfast. BAYER The radiation, yes.   But given a direct hit, the blast itself might well decimate them physically. LT CMDR HAMM Both these things play havoc with our guidance systems. 69. (MORE)",
      "characters": [],
      "action_text": "We fire off a nuke at them, it’s just likely to come back and land on us. BAYER Not if we get in close enough on land.   If we can somehow insert a hardened warhead on a timer -- ADM STENZ Are you actually suggesting we detonate a nuke on our own soil? BAYER Depending on wind-speed and direction, and with a fast evacuation -- HONDA (interrupts) This is madness.   Never mind the human risk, we’re talking about the balance of nature.   Gojira   is an alpha predator.   Without him, there is no telling what else may come. ADM STENZ So you’re suggesting what, we just sit back and hope he wins? BAYER And suppose he does.   Then what? We cheer and wait for him to swim away?   What if he doesn’t? HONDA We   made   this mess by tampering with Nature.   It needs to right itself. LT CMDR Hamm looks up from the comm.   His face pale. LT CMDR HAMM Sir, the train carrying our shielded arsenal has just gone missing.   We have teams scouring the area...   But we don’t have time to retrofit another nuke. ADM STENZ (as this registers) Get that city cleared regardless. And keep looking. (beat) 70. LT CMDR   HAMM   (CONT'D) (MORE) And patch me through to NORAD and the White House. INT. SAN FRANCISCO GENERAL HOSPITAL - EMERGENCY ROOM - NIGHT Elle and Reggie are fast at work, triaging an influx of INJURED CITIZENS sent back from the “front.” MEDIC CHIEF I’m looking for a Maddox, Elle? Elle barely hears it above the frenzied bustle. ELLE (without looking up) Little busy here. But the Medic Chief calls back to his PARTNER -- MEDIC CHIEF Looks like we got next of kin! ELLE Next of --? Elle suddenly turns pale, looks up, as the MILITARY MEDICS wheel in A BODY ON A GURNEY. ELLE (rushing up) Ford? MEDIC CHIEF Just got back here from Hawaii... He woke up on the medevac. And now we see:   It isn’t Ford at all.   It’s Brody.   Smiling weakly.   But swelled with joy to see her. ELLE Brody!   I was so worried... As she embraces him. BRODY It was Ford, he found me there. ELLE (a look of concern) I h",
      "dialogue_count": 0,
      "word_count": 982
    },
    {
      "scene_number": 16,
      "slugline": "EXT. RIVER DELTA - NIGHT A HELICOPTER SPOTLIGHT SCANS the muddy river delta, strewn with military hardware and trestle parts like Lincoln Logs. The BODY OF A MAN lays lifeless, half-buried, caked in mud. And then his eyes blink. Ford has washed up on the shore.   He squints at the helicopter spotlight up above him.   Opening his mouth to speak, but nothing comes except a raspy, sandy whisper. FORD Help... But before the word is out, the spotlight has passed him by -- ILLUMINATING an ICBM MISSILE lodged in the muddy delta bank. A CHINOOK TRANSPORT HELICOPTER LANDS and a RECOVERY CREW sprints out.   BOOTS SPLASH RIGHT PAST Ford as they rush to the ICBM.   This is what they came for. RECOVERY CREW 1 We got a live one! Ford slowly staggers to his feet to get their attention, but just then freezes.   Noticing.   A FAMILY STATION WAGON buried upsidedown inside the muck.   The TEDDY BEAR inside it.   The family from the railroad crossing. MOMENTS LATER, NEARBY The recovery crew has secured the ICBM inside the chopper. As Ford’s ghostly form steps up, caked in mud.   They see him. RECOVERY CREW 1 Quick, get a medic! INT.   USS HARRY S. TRUMAN   - STATEROOM - NIGHT Honda slams the door in visible frustration.   Brody’s notebook and effects are open on the desk.   Along with FILES from Hokkaido.   He regards it all a beat.   Then gets to work: Rifling past Brody’s PHOTOS OF THE FAMILY:   Ford in uniform; Elle in scrubs; all of them as they once were, with Linda. Honda studies Brody’s data sets.   Comparing them to his own. Then ARCHIVE PHOTOS of the MUTO COCOON, the SIBERIAN CARCASS, the FALLEN CORPSE OF THE HOKMUTO IN HAWAII.   This last one captures his attention.   Something here is not quite right. CUT TO: 74.",
      "characters": [],
      "action_text": "A SHIPBOARD NAVIGATION SYSTEM flickers strangely. MAERSK NAVIGATOR (PRE-LAP) What the hell. INT.   MAERSK NORD   CABIN - NIGHT The NAVIGATOR taps the screen.   Then the flickering stops. He glances at his COORDINATES CHART:   THE CONTAINMENT ISLAND. MAERSK CAPTAIN Problem? The navigator shrugs.   Guess not. SUPERIMPOSE:  MAERSK NORD - PACIFIC OCEAN, 48°52’S 123°23’W  EXT.   MAERSK NORD   - SOUTH PACIFIC OCEAN - NIGHT It is the same large cargo ship that left Hawaii.   The HUGE CHARRED CORPSE OF THE HOKMUTO has been tied and battened to the deck of the gigantic freighter.   Tarpaulins flap in the cold night wind, revealing glimpses of the carcass. A SAILOR in a pea coat stands the watch, swigging a belt of fortifying whiskey.   He does not notice as A LARGE CHUNK OF THE CREATURE’S OUTER SKIN SLOUGHS OVERBOARD INTO THE WATER. Pieces of the outer shell are hardening and shedding off. The flesh beneath it GLOWS FAINTLY WITH BIOLUMINESCENCE. LT CMDR HAMM (PRE-LAP) Our crew just found an ICBM, sir. INT.   USS HARRY S. TRUMAN   - TAC-OPS CENTER - DAWN All conversation stops.   ADM Stenz can feel his heart sink. LT CMDR HAMM The techs believe the shielding’s still intact.   It seems to be the only one the female didn’t get. This is good news.   And yet. ADM STENZ Get me a status on the evac.   I need to know that city’s clear of every civilian when we insert that nuke. 75. MONITOR FOOTAGE:   Godzilla swims on, disappearing into the EARLY MORNING FOG outside the GOLDEN GATE OF SF BAY. EXT. GOLDEN GATE BRIDGE - DAWN The bridge is hopelessly snarled with EVACUATING VEHICLES. DRIVERS blast their horns, jostling futilely for inches. As a COAST GUARD HELICOPTER hovers in above. HELICOPTER VOICE (ON PA)  Please leave your vehicles and clear the bridge, immediately.  National Guards drag drivers from their vehicles.   The civilians struggle, kicking and shouting.   Until suddenly. An AWFUL SCREECHING ECHOES FROM THE FOG-BANK OUT TO SEA. Then A GIANT FLOCK OF SEAGULLS FLIES SCREECHI",
      "dialogue_count": 0,
      "word_count": 1845
    },
    {
      "scene_number": 17,
      "slugline": "EXT. ICBM TRANSPORT VESSEL - DAY The ICBM transport glides up onto Alcatraz island’s shoals. Accompanied on both sides by landing crafts of ARMED MARINES. The weapons techs are almost finished with their task. WEAPONS TECH 2 Prepare to engage.   WEAPONS TECH 3 Prepare to engage. They stop.   Their eyes meet.   No turning back from here... Then they TURN THEIR KEYS IN UNISON.   A DIGITAL TIMER STARTS:  45:00:00...   44:59:00...   44:58:00...  WEAPONS TECH 2 Alright, get this cone locked on, and take this eagle in, we have T- minus forty-five to clear the Bay! The techs quickly refasten the missile cone.   Locking the warhead deep within its giant rocket casing.   None noticing -- the INTER-SHIP COMMUNICATIONS SYSTEM, which sputters static. EXT. ALCATRAZ ISLAND - DAY FLASHLIGHTS flicker, too, as Marines trek deeper inland from their landing craft.   The shelling has stopped.   Godzilla has gone silent.   His HUGE FORM COMPLETELY SHROUDED IN THE HAZE, from the perspective of those on the ground looking up. MARSOC LEADER We’ve lost visual, stay tight. As they proceed, a DARK FORM TAKES SHAPE INLAND, THROUGH THE FOG.   The marines clutch their rifles, taking aim.   Then the dark shape resolves into dozens of smaller shapes: It is ANOTHER MARINE PLATOON converging from the opposite side of the island.   Confused, they lower their weapons.   As dense mist parts TO REVEAL THE RUBBLE OF THE FORMER PRISON. But no Godzilla...   The creature has escaped back to the Bay. MARSOC LEADER (stops short) What the... Suddenly.   There is a SNAP OF STATIC THROUGH THE AIR.   Their RIFLE BARREL-LIGHTS GO OUT.   And a moment later -- 81.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 267
    },
    {
      "scene_number": 18,
      "slugline": "EXT. OAKLAND BAY BRIDGE - DAY Both levels and all ten lanes have been closed to outside traffic.   ARMORED HUMVEES escort a LONG MOTORCADE OF EVACUATION AMBULANCES.   Crawling East like ants across a log. Then all at once, their ENGINES JOLT TO A STOP on the bridge. INT. ELLE AND BRODY’S AMBULANCE - DAY The ENGINE DIES AND DOME LIGHTS BLINK OUT.   The ambulance has stalled in the middle of the bridge.   For a moment, there is silence.   Raindrops pattering the rear bay windows. BRODY Look! The entire ELECTRIFIED SKYLINE OF SAN FRANCISCO BLACKS OUT. And just then, finally -- A MUTO’S DISTANT HOWL ECHOES IN. INT.   USS HARRY S. TRUMAN   - TAC-OPS CENTER - DAY THE VIDEO FEEDS from San Francisco SPUTTER OUT. LT CMDR HAMM (into COMM) Flag ship, come in, come in! Interference whines on every channel.   They lost the fleet. HONDA It’s the Muto. ADM STENZ Already?   I thought we had more time. BAYER (re: GIS MAP, confused) We should.   Our seismic stations are reporting activity on the Calaveras fault line, East of Oakland.   The female isn’t here yet. ADM STENZ Well something is. LT CMDR Hamm gets word nearby. 82.",
      "characters": [],
      "action_text": "LT CMDR HAMM We’re picking up a radar anomaly by Bolinas Bay. ADM STENZ Tell our subs to form a hard line. HONDA (but that’s the thing) It won’t be in the water. EXT. OAKLAND BAY BRIDGE - DAY All along the bridge, PARAMEDICS are out on foot, replacing BLOWN OUT FUSES.   Reggie works the engine on their rig. REGGIE (calling back to Elle) Alright, hit it! INT. ELLE AND BRODY’S AMBULANCE - DAY But Elle is studying the pedals in consternation.   The ambulance is a stick shift.   She never learned. ELLE Which one’s the clutch again? BRODY (from behind her) Left pedal. REGGIE (from outside) On the left! Ambulance by ambulance, the convoy is coming back to life behind them -- while theirs remains stalled in its lane. Elle finds the left-most pedal. ELLE Okay, try again! Just then:   Whoosh!   A SQUADRON OF F-18 SUPER HORNET JETS COMES SCREAMING PAST THE BRIDGE ABOVE.   Heads turn in awe. EXT. CLOUDY SKIES ABOVE THE BAY - DAY The squadron flies in tight formation through DENSE CLOUDS. SUPER HORNET PILOT 2 (ON RADIO) CAG, my nose is cold.   Repeat, lost radar. 83.",
      "dialogue_count": 0,
      "word_count": 386
    },
    {
      "scene_number": 19,
      "slugline": "INT. F-22 RAPTOR COCKPIT - DAY As a SHADOW FALLS ACROSS THE SKY ABOVE THEM -- SQUAD LEADER (ON RADIO) Um, I don’t think you’ll need it. THE GARGANTUAN UNDERSIDE OF AN ENORMOUS FLYING CREATURE:   THE HOKMUTO, FLYING THROUGH THE AIR ON FOUR GIGANTIC WINGS, where once its hind legs were attached.   It is the ADULT MALE MUTO. As the jets rise up from below like mid-air escorts -- THE HOKMUTO’S BODY STARTS TO CHARGE WITH A BIOLUMINESCENT GLOW. The sky around it swirling with a green auroral light. SQUAD LEADER (ON RADIO) Right wing, prepare to engage. But just then -- THE CONTROLS IN THE COCKPIT FLICKER. INT. ELLE AND BRODY’S AMBULANCE - DAY  VROOM!   Elle’s ignition catches and the engine roars to life. BRODY That’s it, you got it! OUTSIDE ON THE BRIDGE AHEAD, Reggie gives a thumbs up and shuts the hood.   Winding up his jumper cables to return them to ANOTHER AMBULANCE ahead. REGGIE Just a second, keep it running! But Brody sits up in his cot.   Seeing something -- BRODY Elle? JUST OUT THE WINDOW:   A FIGHTER PILOT FLOATS DOWN IN AN EJECTION SEAT.   Parachuting slowly, a captivating sight. Elle turns to look.   But before there’s time to process: THE HOKMUTO FLIES OUT FROM THE CLOUDS ACROSS THE BAY. ELLE Oh my... ANGLE ON REGGIE Drops his jumper cords.   Agape.   And just then -- 84.",
      "characters": [],
      "action_text": "REGGIE ...god. A FIGHTER JET SLAMS DOWN INTO THE BRIDGE BESIDE HIM, obliterating Reggie and the other ambulances where he stood. INT. ELLE AND BRODY’S AMBULANCE - DAY Elle screams as the fireball plumes toward her windshield. ELLE REG! THE ENTIRE FIGHTER SQUADRON IS RAINING FROM THE SKIES. EXT. ALCATRAZ ISLAND - DAY Marines dive aside as the JETS MEET GROUND, shelling the island in a bone-rattling succession of FIREBALLS. EXT. ICBM TRANSPORT VESSEL - DAY A jet hits the FLIGHT TOWER, launching a spray of flaming wreckage onto the fuselage of the ICBM on the deck. Weapons techs scramble to protect the FRAGILE MISSILE CONE. But just then a SHADOW LOOMS ACROSS THEM FROM ABOVE.   They look up just in time to see: THE HOKMUTO PLUMMETING DOWNWARD with its jaws agape, like a dive-bombing predator.   He PLUNGES right down through the vessel -- VANISHING WITH IT UNDERNEATH THE WATERS OF THE BAY. A long beat passes.   The Bay is left in silence. Then the Hokmuto EXPLODES UP FROM THE BAY like a bird with its prey, CLENCHING THE GIANT ICBM MISSILE IN ITS JAWS.   And emits a PIERCING, HOWLING CALL.   It soars back into the sky. INT. ELLE AND BRODY’S AMBULANCE - DAY The ENGINE GRINDS as Elle struggles to get it into gear.   She is still in shock, tears streaming.   Just trying to focus. The vehicles behind her HONK and jostle in a panic -- but her ambulance just revs its engine, stuck in its lane.   Up ahead, the wrecked jet burns across the lane divide not twenty yards ahead.   Flames lick the INTACT MISSILES ON ITS BROKEN WING. 85. ELLE Come on, come on, dammit Ford! (the gears connect) GO! But the rig lurches BACKWARD.   She has put it in reverse. Elle quickly slams the brakes.   But now the traffic behind her has just enough space to squeeze right past, RAMMING HER AMBULANCE ASIDE AS THEY SWERVE AROUND ONTO THE BRIDGE AHEAD. ELLE Wait!   Help! But just then, the INTACT MISSILES ON THE FIGHTER JET IGNITE.  BOOM!   The explosion swallows up the fleeing vehicles ahead -- causing ",
      "dialogue_count": 0,
      "word_count": 1976
    },
    {
      "scene_number": 20,
      "slugline": "INT. V-22 OSPREY JUMP PLANE - DAY Then he tucks it in the Velcro pocket of his JUMP SUIT.   The plane is FILLED WITH SOLDIERS IN HALO JUMP GEAR.   All of them performing similarly sentimental rituals.   Only the DRONE OF ENGINES CAN BE HEARD as a PRIEST shouts prayers from a Bible. But a JUMP SGT is repeating orders, drowning out the prayer: PRIEST And he will send his angels with great trumpets! JUMP SGT One more time!   No chute release until below one thousand feet!   Locate the ICBM!   Cover the techs while they deactivate the warhead! A DEAFENING BLAST OF AIR cuts this short, as the REAR BAY DOORS glide open.   It is shockingly loud.   JUMP MASTERS guide the HALO JUMPERS, one-by-one out into the great beyond. Ford reaches his turn and just begins to INTAKE A BREATH -- when the JUMP SGT SHOVES HIM OUT THE BAY BEFORE HE CAN. EXT. 25,000 FEET ABOVE THE CITY - DAY Instantly, the world goes quiet.   Just the peaceful whistle of thin air above the clouds.   Hundreds of SOLDIERS FREE-FALL FROM THE SKY.   As Ford sails down past DENSE CLOUD COVER -- THE CITY OF SAN FRANCISCO draws into view below.   From Ford’s POV, the damage wrought is mind-boggling.   Fires blaze through plumes of smoke. A HUGE WAKE OF DESTRUCTION cuts across the Embarcadero and up Telegraph Hill -- where THE FEMUTO SITS IN HER “NEST.”   As GODZILLA AND THE HOKMUTO BATTLE amidst the city’s high-rises. It is a fair fight, but not an even one.   Godzilla is far stronger.   Pestered by the flying parasite, yet hardly fazed. As the Hokmuto dive-bombs for Godzilla -- Godzilla lashes out with an agile tail-whirl, smacking his opponent from the sky. THE HOKMUTO TUMBLES DOWN BROADWAY IN A SWATH OF DEVASTATION. MEANWHILE, PARACHUTING IN ABOVE THEM, Dozens of soldiers have pulled their chutes too soon and are drifting down right on top of the fighting monsters.   Some are smacked aside or sliced in half by flailing talons. As Ford looks on in horror, still 10,000 feet above the city. 92.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 347
    },
    {
      "scene_number": 21,
      "slugline": "EXT.   USS HARRY S. TRUMAN   - VULTURE’S ROW - DAY ADM Stenz has stepped out to find Honda standing at the rail - - gazing out upon the SMOKE-FILLED SKIES OF SAN FRANCISCO. The MONSTER BATTLE IS ONLY VAGUELY VISIBLE THROUGH HAZE. Honda holds his OLD BRASS POCKET WATCH.   A rail conductor’s time piece, its glass face cracked.   His fingers work it automatically.   Winding and winding it in endless turns.   But THE HANDS HAVE LONG SINCE STOPPED.   They tell a time:   “ 8:15 ” HONDA It was my father’s. ADM STENZ (sees it, knows the time) Eight fifteen in the morning.   That was the time of the Hiroshima blast. Honda continues gazing out.   Remembering. HONDA It was noon when he came to.   Lying on his back under the summer sun. Bodies everywhere he looked, scattered across what used to be the school yard.   Blue fires were flying in the air...   Phosphorus from all the burning bones.   He said it was the only color in the world, anymore.   Everything else was black.   Black and burned and filled with unimaginable death.   He shut his eyes, wishing it was a dream.   And when he woke again it was night. (pause) At first he thought a snow had fallen.   Everything that had been black was white now.   And moving. And then he felt them.   All up and down his legs, the burnt flesh. There were maggots, millions, everywhere, covering the city like a winter snow.   He told me in that moment he knew that it was nature, life, rising back from death.   From one hundred and fifty thousand women and children and men. (looks to Stenz) That day we burned the world.   That night, nature took it back. 93.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 286
    },
    {
      "scene_number": 22,
      "slugline": "EXT. DOWNTOWN SAN FRANCISCO - DAY Ford touches down with a not-too-graceful stutter-step at the center of the rubble-strewn Financial District.   He quickly ditches his parachute and hustles round a corner to find -- A dozen soldiers already assembled, with FOUR WEAPONS TECHS. The JUMP SGT signals fast to follow him.   No time to wait. JUMP SGT This way, this way! They move off briskly, as Ford readies his rifle on the run. EXT. COLUMBUS-BROADWAY INTERSECTION - DAY The site of the sinkhole is now a crater piled with debris. The Femuto is burrowed in her “NEST.”   Secretion oozes, encrusting the ICBM and HER BIOLUMINSECENT SPORE. Eerily, electricity around the female sparks and flickers with sporadic life.   A CAR RADIO sputters out discordant pop. MORE SOLDIERS are now converging from all sides of the wide intersection. Trading forlorn looks.   Ford glances to the SGT:   What now? EXT. FINANCIAL DISTRICT - DAY Godzilla pins the Hokmuto against a LARGE, MULTI-STOREY CAR- PARK, pummelling him brutally -- until the structure collapses, burying the parasite in rubble. Looming over the Hokmuto, Godzilla opens his mouth as wide as it will go, emitting a turbulence current of shimmering thermal waves.   There is just enough time to register LIGHT SPARKING within his cavernous maw, and then as he ROARS -- -- something happens we have not yet seen in person: GODZILLA VOMITS OUT A FOUNT OF BLINDING BLUE-WHITE FIRE! INT. TRANSAMERICA TOWER LOBBY - DAY Elle holds Brody close as -- GODZILLA’S ATOMIC BREATH BLISTERS DOWN LIKE NAPALM ON THE STREET OUTSIDE. 94.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 259
    },
    {
      "scene_number": 23,
      "slugline": "EXT. FINANCIAL DISTRICT - DAY The Hokmuto flaps up into the air to escape Godzilla’s brutal incendiary assault -- but FREEZES MID-TAKE-OFF.   Godzilla’s JAWS HAVE CLAMPED DOWN ON ONE OF ITS FOUR SMOLDERING WINGS. The Hokmuto HISSES, then FLUTTERS INTO A FRENZY, trying to loose its wing.   The animal BUCKS and TWISTS, pelting the area with BROKEN SCALES and SALIVA -- but Godzilla holds. Enraged, the Hokmuto FLINGS ITSELF AWAY IN PAIN -- WITHOUT ONE WING!   The massive appendage, shed clean, REMAINS IN GODZILLA’S MOUTH.   Godzilla drops the wing, which is still WRITHING.   He SNARLS at the Hokmuto:   “ I DID THIS TO YOU .” The Hokmuto HOWLS DEAFENINGLY IN AGONY. EXT. COLUMBUS-BROADWAY INTERSECTION - DAY The creature battle is audible from here, but the Femuto remains motionless.   Still crouched above the ICBM.   Until suddenly:   THE HOKMUTO’S HOWL OF PAIN ECHOES across the city. THE FEMUTO SPRINGS TO ATTENTION, quickly lifting her enormous frame on her four hind legs and trundling off in the direction of her pained mate’s call... Ford and the other soldiers dive aside to dodge her CRUSHING FOOTFALLS, several unsuccessfully -- But with the Femuto gone, the “nest” is left unguarded.   Four weapons technicians immediately descend the crater towards the ICBM, wedged in next to the Muto’s GIANT SPORE. They get to work as Ford and the other troops surround the burrow, standing watch.   The SGT checks his stop-watch:  08:34:00...   08:33:00...   08:32:00...  INT.   USS HARRY S. TRUMAN   - TAC-OPS CENTER - DAY The same TIMER COUNTING DOWN.   As Honda and Stenz return to look on, breathlessly.   Along with Bayer and the others.   No adversaries, anymore.   Everyone just praying for survival. EXT. FINANCIAL DISTRICT - DAY Godzilla FURTHER BULLIES a downed Hokmuto, body-checking and tail-lashing the grounded parasite until, finally, he stands above his soon-to-be vanquished opponent. 95.",
      "characters": [],
      "action_text": "Fury flashes in Godzilla’s eyes.   But this time as Godzilla unhinges to unleash a final, fatal blast of atomic fire -- THE BLUE FLAMES SNUFF OUT COMPLETELY.   The ignition current in his throat SHORT-CIRCUITS with a FEEBLE CLICK-CLICK. ANGLE ON GODZILLA Smoke seethes from his nostrils.   But now he is confused. Turning slowly back to see -- THE FEMUTO HAS ARRIVED; it was her magnetism that shorted out his flame.   She HISSES ANGRILY -- while the Hokmuto flaps up behind Godzilla on his three remaining wings, incensed. Godzilla is trapped between them. FEMUTO SLAMS DOWN HER GIANT FORELIMBS, as HOKMUTO CLAPS HIS MASSIVE WINGS -- generating a COMBINED SHOCK-WAVE so intense it STUNS GODZILLA where he stands.   He staggers, dazed. Then BOTH MUTOS POUNCE. EXT. COLUMBUS-BROADWAY INTERSECTION - DAY Ford and the other troops stiffen on their rifles, LISTENING to the monstrous cacophony.   It is clear even from a distance that the tide has turned.   While down in the “nest” -- THE WEAPONS TECHS are dismantling the CONE TIP OF THE ICBM TO EXPOSE -- THE INNER NUCLEAR WARHEAD.   They carefully LIFT IT BY ITS HAND- HOLDS and slide it from the larger missile tube. Its COUNTDOWN TIMER ticking down:  06:55:00...   06:54:00...   06:53:00...  As the techs continue on their work; a long, complex process. ANGLE ON FORD Glimpsing the monster battle through the smoke beyond.   A growing aspect of concern. EXT. FINANCIAL DISTRICT - DAY GODZILLA PIN-BALLS DOWN THE RUBBLE-LINED STREET, choking on a blizzard of swirling ash -- but THE HOKMUTO AND FEMUTO allow no respite, out-matching him from land and air. 96. THE FEMUTO SINKS HUGE FANGS INTO HIS TAIL.   Payback for her mate .   Godzilla lets out a PAINED ROAR as electricity ripples his body, preventing him from summoning his atomic breath. HONDA (PRE-LAP) The female is shorting out   Gojira ’s heat release. INT.   USS HARRY S. TRUMAN   - TAC-OPS CENTER - DAY SATELLITE FEEDS provide partial glimpses of the action. HONDA If they keep him on la",
      "dialogue_count": 0,
      "word_count": 1373
    },
    {
      "scene_number": 24,
      "slugline": "EXT. FISHERMAN’S WHARF - DAY Sparks fly off the bottom chassis of the warhead, as Ford and the soldiers drag it, bumping down the PIER and onto -- THE DECK OF A “SEE-THE-BAY TOURS” BOAT tied up in a slip.   Ford runs into the cabin.   The key hangs in the ignition.   The ENGINE REVS to life.   Ford jams the throttle -- but the boat just LURCHES FORWARD TO A STOP. It is still hitched to its DOCK LINE! EXT. WHARF DOCK - DAY Ford leaps out, scrambling for the dock line, but just then, the tour boat’s ENGINE SHORTS OUT WITH A SIZZLING SPARK. The dock line goes lax. THE FEMUTO has arrived, towering above the wharf.   STATIC FLICKERS across her hide, shorting out the tour boat’s engines. ON THE TOUR BOAT, the other soldiers open fire, unloading their M16s in a final, futile hail of glory -- But the Femuto casually CLEARS THEM ALL WITH A SINGLE, FATAL SWIPE, shearing the covered top clean off the tour boat. FORD IS LEFT ALONE, stranded on the dock.   His M16 RUNS OUT OF AMMO.   Then he drops it limply, and slumps, exhausted to his knees. The battle is over. THE FEMUTO LOWERS IN, her enormous head sniffing at him.   Sensing Ford by electro- receptivity.   Saliva oozes from her fangs. Ford has no place left to go, nothing left to do but face this monster nose to nose.   And glare.   But just then... Ford’s expression shifts.   Almost the hint of a smile. Sensing something there behind her. 100.",
      "characters": [],
      "action_text": "FORD (to himself, in disbelief) King of the fucking monsters. AND AS THE FEMUTO UNHINGES HER UNGODLY, SLAVERING JAWS TO ROAR -- -- THE ROAR OF ANOTHER MONSTER CUTS HER OFF, INSTEAD, drowning out her feeble howl with a deafening, commanding bellow accompanied by blistering waves of heat. IT IS GODZILLA, KING OF THE MONSTERS! Swaying on his feet behind the female, bleeding and battered, many of his dorsal plates cracked or broken off completely. Like a twelfth-round boxer, ready for his final stand. And if the Femuto could make an “Oh, shit” expression, it would be right now, as --  WHAM!!!  GODZILLA SWIPES CLEAN THROUGH THE FEMUTO with a single, fatal blow, SNAPPING THE HEAD CLEAN OFF HER NECK.   The enormous parasite crumples, crashing to the wharf -- deceased. Then the great Godzilla drops to a knee, exhausted. INT. BART SUBWAY PLATFORM - DAY The massive tremor echoes from the street above, as terrified citizens huddle in the darkness.   But then, unexpectedly: ELECTRICITY FLICKERS BACK throughout the station.   LIGHTS COME ON AGAIN.   With the MUTOs dead, the power has returned. INT.   USS HARRY S. TRUMAN   - TAC-OPS CENTER - DAY SATELLITE FEEDS return as well, as ADM Stenz, Honda and the rest look on.   The COUNTDOWN TIMER IS STILL TICKING:  00:45:00...   00:44:00...   00:43:00...  EXT. WHARF DOCK - DAY From his position on the dock, Ford watches as ELECTRICITY RETURNS, block-by-block across the San Francisco skyline. Then suddenly. 101. Vroom!!!   The tour boat’s engines whir to life!   The boat jolts forward, pulling taut again against its DOCK LINE. Ford, startled, reaches out and slips the dock line free. AND THE TOUR BOAT shoots out onto the waters of the Bay, racing fast away from shore.   Carrying the warhead.   But will it be fast enough? INT.   USS HARRY S. TRUMAN   - TAC-OPS CENTER - DAY On the GEOSPATIAL MAP, a RED DOT follows the location of the warhead as it travels out into the Bay.   Its BLAST RADIUS creeps out with it, receding towards the city’s ",
      "dialogue_count": 0,
      "word_count": 1335
    }
  ]
}