{
  "slug": "good-omens-101-in-the-beginning-2019",
  "title": "good omens 101 in the beginning",
  "genre": "horror",
  "format": "series",
  "scenes_count": 11,
  "characters_count": 0,
  "characters": [],
  "total_words": 11503,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. TOP FLOOR BT TOWER. LIFT - NIGHT The lift dings, and Crowley and the Guard step out. The floor is empty. Night lighting. But we hear a SCRATCHING. Crowley looks around. Every surface is alive. A nose. Sharp teeth. A twitch of a tail. RATS. Hundreds of them! Tiny sinister red eyes glowing at us from all over. A beat, then they move -- they are coming towards us! The Guard steps back into the lift. GUARD 2 You know. I’m just going to wait here. CROWLEY I don’t blame you. The lift door closes. Crowley walks forward. He takes out his thermos, unscrews the top, pours himself a cup of steaming tea. And Crowley... smiles. CROWLEY (CONT’D) Beautiful job! Thank you all, so much men! A lady rat chirps angrily. CROWLEY (CONT’D) And, yes, obviously, ladies too. Nice job! You can all go home. And, yeah, stay cool. INT. COMPUTER ROOM - NIGHT He walks into a room filled with computer and BT equipment. All of it old-fashioned and out-dated equipment: the computers of yesteryear, and some cables. Lots of green and red lights flashing. Crowley pours his tea onto the unit. Then he pours the rest of the tea from the thermos. All around the room CONSOLE Lights start to flicker. Something electronic buzzes.  6.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 219
    },
    {
      "scene_number": 2,
      "slugline": "INT. BT TOWER LIFT - NIGHT Crowley enters the lift. GUARD 2 That was quick. CROWLEY Left something back in the van. CUT TO: INT. COMPUTER ROOM - NIGHT CONSOLE Lights flickering. And then they start to GO OUT. EXT. BT TOWER STREET - NIGHT Crowley walks out of the lobby. On the pavement is a BUSINESSMAN on an old-fashioned pre-smartphone phone. BUSINESSMAN No, I understand. That’s why we have to close this now. So. Seventy grand. Our final offer. What do you say? And then he shakes the phone. Tries redialling, and we follow Crowley, who is taking off his jacket, past people on the pavement, a WOMAN, WOMAN No Arthur, you can pick me up here. I’m on the corner of... can you hear me? Hello? ...a TEENAGE BOY... TEENAGE BOY Look, I know I kissed her at the party. But I mean, that doesn’t mean I wanted to dump you. I’m really sorry. I’m really hullo? Hullo? Over this we can hear a telecom voice saying “ We are sorry. All circuits are busy .” And Crowley is smiling. What a wonderful day. Checks his beautiful black watch, and stresses a little. He’s late.  7.",
      "characters": [],
      "action_text": "He reaches his car, a beautiful vintage Bentley Sports Car , and pulls out onto the road. INT. CROWLEY’S BENTLEY - NIGHT He fumbles with the radio, and to the beat of either KILLER QUEEN by QUEEN, or a seriously rocking cover of Buddy Holly’s “EVERY DAY”, he starts driving through the London streets at ridiculous speeds. And as he drives, we see a Title Card with GOOD OMENS on it, and hear our NARRATOR: NARRATOR (V.O.) Good Omens. Being a Narrative of Certain Events occurring in the last eleven years of human history, in strict accordance, as shall be shown, with The Nice and Accurate Prophecies of Agnes Nutter. CUT TO: EXT. A GRAVEYARD - NIGHT A small country churchyard. Possibly ruined. Rather creepy. We move through it slowly... It’s misty, and brrr. NARRATOR (V.O.) It wasn’t a dark and stormy night. It should have been, but that’s the weather for you. But don’t let the fog, with rain later, fool you. Just because it’s a mild night doesn’t mean the forces of evil weren’t abroad. They’re everywhere. That’s the whole point. And by now we’ve reached two very evil-looking gentlemen, standing in the shadows. One squat and monstrous, LIGUR. One tall, thin and monstrous, HASTUR. They have something -- a box-shaped object -- behind them, in the dark shadows. Hastur has been hand-rolling a tobacco cigarette. He puts it in his mouth, lights it with a flame from his fingertip. In the flame’s light, we get a good look at them. They don’t have horns, they wear vintage suits and shabby raincoats, but they aren’t human. Weird eyes.  8. Skin like frogs, or pitted with terrible acne. They are trying hard to pass for human, but not even the fog is helping. NARRATOR (V.O.) Take these two. They’ve been lurking in the fog for an hour. But they’ve been pacing themselves, and could lurk until dawn. LIGUR Gissa drag. Hastur hands him the cigarette. HASTUR Bugger this for a lark. He should have been here an hour ago. NARRATOR (V.O.) His name is Hastur. He is a Duke of Hell. LIGUR You tru",
      "dialogue_count": 0,
      "word_count": 631
    },
    {
      "scene_number": 3,
      "slugline": "EXT. POLICE CAR - NIGHT Two POLICE OFFICERS are thrilled to be doing a high-speed chase in the fog. No, really they are. POLICE 1 The nutter’s doing a hundred and ten. In the fog. You know what this means? POLICE 2 We get to do a hundred and fifteen. Brilliant. What the hell kind of car   is   that? POLICE 1 Vintage Bentley, I think. Come on, nutter. Pull over. CUT TO: INT. CROWLEY’S BENTLEY - NIGHT The noise of the siren is starting to get to him. Crowley, irritated, snaps his fingers. INT. POLICE CAR - NIGHT POLICE 2 (into police radio) In pursuit of a speeding vehicle. Vintage Bentley. And we’re... The Police Car engine makes a whining sound, and then it slows down and stops. POLICE 2 (CONT’D) We’re having mechanical problems. Over. EXT. POLICE CAR - NIGHT The police car, on the side of the road. Fog. The car’s steaming. They open the bonnet. We move from police officer to police officer: they look horrified and confused. And now we look at the engine. Where the engine ought to be is just GREEN GOO, steaming and bubbling gently.  10.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 194
    },
    {
      "scene_number": 4,
      "slugline": "EXT. A GRAVEYARD - NIGHT Ligur and Hastur, still lurking. Hastur crushes the dog-end under his foot. We can see a little more of the object behind him. A car’s headlights approach in the fog. HASTUR Here he comes now, the flash bastard. LIGUR What's that he's drivin'? HASTUR It's a car. A horseless carriage. Didn’t they have them last time you was up here? LIGUR They had a man walking in front with a red flag. HASTUR They've come on a bit since then. A car door SLAMs. LIGUR What’s he like? HASTUR Crowley? Been up here too long. And he wears sunglasses, even when he dunt need to. We look from Hastur’s TOAD-LIKE eyes to Ligur’s FLY-EYES, and we suspect why Crowley might want to wear Sunglasses. Crowley is Sauntering up the path. He stops. They stare at him. HASTUR (CONT’D) All hail Satan. LIGUR All hail Satan. CROWLEY Er. Hi guys. Sorry I'm late, but, well, you know how it is on the A40 at Denham, and then I tried to cut up towards Chorleywood --  11.",
      "characters": [],
      "action_text": "Hastur interrupts him. HASTUR Now we art all here, we must recount the Deeds of the Day. CROWLEY (”we do? Oh, I remember this.”) Of course. Deeds. Yeah. HASTUR I have tempted a priest. As he walked down the street and saw the pretty girls in the sun, I put Doubt into his mind. He would have been a saint, but within a decade we shall have him. Ligur makes approving guttural throaty noises, as if this is the best thing he’s ever heard. CROWLEY (politely) Nice one. LIGUR I have corrupted a politician. I let him think a tiny bribe would not hurt. Within a year we shall have him. Hatsur hisses approval. They stare at Crowley. Him next. But that’s good, because he has the BEST one... CROWLEY You'll like this. We look at their faces and know that they won’t. CROWLEY (CONT’D) I brought down every London area mobile phone network tonight. There is a baffled silence. HASTUR Yes?  12. CROWLEY It wasn’t easy. I had to send rats into the BT Tower, and I had to pour tea into the network controller, while the backup system was offline for maintainance... HASTUR And what exactly has that done to secure souls for our master? CROWLEY Oh come on! Fifteen million pissed- off people? Who take it out on each other? Who take it out on everyone else? Ruined days. Ruined nights. The knock-on effects are incalculable... LIGUR It’s not... craftsmanship. CROWLEY Head office don’t seem to mind. They love me down there. Guys, times are changing. So, what’s up? Hastur reaches down and picks up the object at his feet. Some kind of wicker basket. He hands it to Ligur, who grins unpleasantly... HASTUR This is. CROWLEY No. LIGUR Yes. CROWLEY Already? HASTUR Yes. CROWLEY And it’s up to me to...? LIGUR Yes.  13. CROWLEY You know. This sort of... well, it really isn’t my scene. LIGUR Your scene. Your starring role. Take it. HASTUR Like you said. Times are changing. LIGUR They’re coming to an end, for a start. CROWLEY Why me? HASTUR They love you down there. And what an opportunity. Ligur here would give",
      "dialogue_count": 0,
      "word_count": 1512
    },
    {
      "scene_number": 5,
      "slugline": "EXT. HOSPITAL - NIGHT A green Morris Traveller is driving cautiously along the Road outside the hospital. Inside the Car are Deirdre Young and her husband, Arthur Young. He is in his forties, she is in her late thirties and hugely pregnant. This is her first child. But everything’s very normal... NARRATOR (V.O.) This was perfectly correct on every count except for the bit about the salads. DEIRDRE Are we there yet? Arthur? Seven minutes apart. MR YOUNG It’s definitely this way. It’s just the roads look all different int he dark... DEIRDRE The nuns said to come in when they were seven to ten minutes apart. MR YOUNG It’s a bit, um. Well. Nuns. DEIRDRE Do we have any egg and cress sandwiches? Mrs Young reaches for a sandwich, and as she does so, has a contraction... A Sirening MOTORCADE zooms past them -- an ambulance, followed by three black cars. DEIRDRE (CONT’D) Arthur. Just follow them. INT. AMBULANCE - NIGHT Suddenly Rapid-cutting, ultra-adrenaline: The Ambulance is going at speed. In it is HARRIET DOWLING, the movie-star- beautiful wife of the American Cultural Attache to London. Very pregnant. Standing near her, and being thrown around are TWO SECRET SERVICE AGENTS. Holding a video screen, and a video camera. It’s a pre-skype Video hookup from the old days.  19.",
      "characters": [],
      "action_text": "On the video screen we can see TAD (THADDEUS J) DOWLING, cultural attache, back in the US, soon to be presidential hopeful, in a White House meeting. He’s talking to her: TAD DOWLING Breathe, honey. Just breathe. HARRIET I am breathing, goddammit, Tad. Why aren’t you here? TAD DOWLING Honey. I’m with you. I’m just also here with the President. PRESIDENT BUSH Hey Harriet. Sorry we had to borrow your husband. TAD DOWLING Hon, I’d better get back to the strategy conference. HARRIET You are meant to be with me, you useless sonofabitch (Contraction). TAD DOWLING Honey, you’re going to the best place we could find at short notice. The, uh... SECRET SERVICE #1 St Beryl’s Convent Birthing Hospital, sir. TAD DOWLING St Beryl’s. Right. Honey, you just keep on having the baby. I’ll be right here with you. Birth is the single most joyous co-experience that two human beings can share, and I’m not going to miss a second of it. PRESIDENT BUSH Tad. If we can return to the matter in hand? TAD DOWLING I’ll get back to you honey. And the screen goes blank. Mrs Dowling bites back some really impressive swearing.  20.",
      "dialogue_count": 0,
      "word_count": 416
    },
    {
      "scene_number": 6,
      "slugline": "INT. ST BERYL’S CONVENT - NIGHT An old convent, part of which has been converted into a small birthing hospital. We are looking at a dozen NUNS. The Mother Superior is facing them. The SATANIC nature of the place is given away by the upside-down Cross on the wall beside the Mother Superior. MOTHER SUPERIOR The child of the American Cultural Attache. Everything is ready. Tonight, it begins. SISTER MARY LOQUACIOUS Excuse me Mother Superior but I was wondering where the other baby was going to come from, not the American baby, I mean that’s obvious, that’s just the birds and the bees, but the, you know -- MOTHER SUPERIOR Mr Crowley is on his way with our dark master to be, Sister Mary Loquacious. Now. We are Nuns of the Chattering Order of Saint Beryl. And tonight is what our order was created for. We can hear the ambulance Siren drawing up outside. MOTHER SUPERIOR (CONT’D) Places! And the Nuns begin to move, and as they do, they begin to chat to each other, each one saying whatever’s on her mind. Mother Superior reaches out and tips the upside down cross right-way up. And she SMILES. EXT. ST BERYL’S CONVENT - NIGHT Behind the Ambulance and the Motorcade of Black Cars, we see a Green Morris Traveller. DEIRDRE Right.  21.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 222
    },
    {
      "scene_number": 7,
      "slugline": "INT. ST BERYL’S CONVENT RECEPTION - NIGHT We watch as two things are happening at the same time. Harriet Dowling is wheeled in, followed by a secret service man with a video camera, OTHER SECRET SERVICE MEN saying things like “Clear!” into their earpieces, and all is commotion... Meanwhile Mr and Mrs Young walk up to the front desk. He’s carrying a little suitcase. DEIRDRE Excuse me. Deirdre Young. I phoned. Contractions now five minutes apart. SISTER TERESA GARRULOUS Welcome to St Beryl’s. We’re all ready for you. Room Three. Deirdre turns to Mr Young, takes the Suitcase. DEIRDRE Obviously Arthur will be with me, while I’m in labour... SISTER TERESA GARRULOUS I don’t think so. We believe fathers just... complicate the process for everybody. DEIRDRE But-- Mr Young looks relieved. MR YOUNG Not going to argue with Nuns. Nurses. Know what they’re doing, Deirdre. I’ll be. Um. He produces his pipe, from his pocket. Deirdre glares at him as she is swept off in a storm of nuns... CUT TO:  22.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 173
    },
    {
      "scene_number": 8,
      "slugline": "EXT. ST BERYL’S CONVENT - NIGHT Mr Young walks out into the driveway to smoke his pipe. He tamps down some tobacco -- clearly a man for whom the rituals of smoking are more important than actually smoking itself. He starts looking for his lighter... NARRATOR (V.O.) It may help to understand human affairs if you notice that most of the great triumphs and tragedies of history are caused, not by people being fundamentally good or fundamentally bad, but by people being fundamentally people. And a Vintage Bentley pulls up. Crowley gets out, grabs the carry-cot, and heads towards us. CROWLEY Has it started yet? MR YOUNG They made me go out. CROWLEY Any idea how long we've got? MR YOUNG I think we were, er, getting on with it, Doctor. CROWLEY Got it. What room is she in? MR YOUNG We're in Room Three. INT. ST BERYL’S CONVENT CORRIDOR - NIGHT We’re in the Corridor. Looking at Sister Mary, from the POV of the baby in the carrycot. SISTER MARY LOQUACIOUS Is that him? CROWLEY Yup. SISTER MARY LOQUACIOUS Only I'd expected funny eyes. Or teensy-weensy little hoofikins. Or a widdle tail.  23.",
      "characters": [],
      "action_text": "She’s taken the baby out of the carrier and is turning it over... CROWLEY It’s definitely him. SISTER MARY LOQUACIOUS Fancy me holding the Antichrist. And counting his little toesy- wosies... Do you look like your daddy? I bet you do. I bet you look like your daddywaddykins.... CROWLEY He doesn’t. Take him up to Room three. CUT TO: INT. HOSPITAL ROOM THREE - NIGHT Watching Sister Mary outside the room, with a three on it -- from further down the corridor the Secret Service Men glare at her suspiciously. Mary goes in, with the antichrist baby, to the room in which Deirdre Young is asleep. Mrs Young has BABY B in a bassinet sleeping soundly beside her. Sister Mary carefully takes the ID tag off the Young’s baby, and just as carefully attaches it to the Antichrist Baby. Sister Mary looks at the two babies. They look quite similar, don’t they? She puts on the kettle. A HESITANT KNOCK on the door. Mr Young. MR YOUNG Has it happened yet? I’m the father. The husband. Both. MARY Ooh yes. Congratulations. Your lady wife’s asleep, poor pet. Mr Young looks down at the babies. Baby B and the Antichrist baby. MR YOUNG  Twins?   Nobody said anything about twins.  24. MARY Oh, no! This one's yours. The other one's... someone else's. Just looking after him. No, this one's definitely yours, your ambassadorship. From the top of his head to the tips of his hoofywoofies - which he hasn't got. MR YOUNG All, er, present and correct, is he? MARY Oh, yes. Normal. Very,   very   normal. You don't have much of an accent. Have you been over here long? MR YOUNG About ten years. The job moved, you see, and I had to move with it. MARY It must have been very different where you were before. She’s making tea. MR YOUNG Er... MARY Taller buildings, for one thing. MR YOUNG There’s the Alliance and Leicester offices. (he’s given tea) Oh, thank you. MARY And I expect you go to a lot of HER garden parties. MR YOUNG Well, fetes mainly. Deidre makes jam for them, you know. And I sometimes have to help wit",
      "dialogue_count": 0,
      "word_count": 789
    },
    {
      "scene_number": 9,
      "slugline": "INT. CORRIDOR - NIGHT Pounding music. Sister Teresa Garrulous isn’t actually running down the corridors, but she is moving as fast as she can, scanning every open room as she passes... CUT TO: INT. HOSPITAL ROOM THREE - NIGHT Sister Mary is presenting Mr Young with a selection of pink iced biscuits. SISTER MARY LOQUACIOUS Now these are what we call “bis- cuits”, but you’ll be looking at them and going (fingerquotes) “cookies”! MR YOUNG No, I definitely call them biscuits. BLAM! The door opens, Mrs Young stirs in her bed, and Sister Teresa enters, to see: Sleeping Baby B... Mr Young... Sleeping the Antichrist Baby... Sister Mary... Sleeping Mrs Young... Her puzzled glance returns to the babies... Sister Teresa looks furious, but only for a second. She looks at Sister Mary and WINKS. Sister Mary points at Baby B and WINKS. Sister Teresa looks happy, wheels the bassinet with baby B in it out of the door, and TAKES OFF DOWN THE CORRIDOR WITH IT... Sister Mary smiles happily. FREEZE FRAME. The Narrator walks in front of the frozen frame, holding a long pointer. NARRATOR As methods of human communication go, the wink is quite versatile. For example, Sister Teresa’s wink meant,  27.",
      "characters": [],
      "action_text": "Sister Teresa comes through the door, furious: SISTER TERESA GARRULOUS Where the hell have you been? We're ready to make the switch, and here's you in the wrong room with the Adversary, Destroyer of Kings, Angel of the Bottomless Pit, Great Beast that is called Dragon, Prince of This World, Father of Lies, Spawn of Satan, and Lord of Darkness, drinking tea. Do you realize I've nearly been shot? NARRATOR And, as far as she was concerned, Sister Mary's answering wink meant: Sister Mary looks up from her tea, and says, sharp, sexy and out of character (the voice could be done by Sister Teresa): SISTER MARY LOQUACIOUS This child is the Adversary, Destroyer of Kings, Angel of the Bottomless Pit, Great Beast that is called Dragon, Prince of This World, Father of Lies, Spawn of Satan and Lord of Darkness. But I cannot speak freely now because there's this outsider here. NARRATOR Sister Mary, on the other hand, had thought that the orderly's wink was more on the lines of: Sister Teresa is now voiced by Sister Mary. SISTER TERESA GARRULOUS Well done, that Sister Mary - switched over the babies all by herself. Now indicate to me the superfluous child and I shall remove it and let you get on with your tea with his Royal Excellency the American Culture. NARRATOR And therefore her own wink had meant:  28. SISTER MARY LOQUACIOUS There you go, dearie; that one’s Baby B, now take him away and leave me to chat to his Excellency. He’s telling me all about the Queen and her elephants. Back to reality: SISTER MARY LOQUACIOUS (CONT’D) Have you picked a name for him yet? INT. DELIVERY ROOM FOUR - NIGHT Sister Teresa hands Baby B to Mrs Dowling: SISTER TERESA GARRULOUS Here’s your little man back. All cleaned up and weighed. The Secret Service men edge forward nervously. One is still filming: Mrs Dowling shows the baby to his camera. MRS DOWLING Look, honey. Our son. THADDEUS DOWLING He’s beautiful, hon. What a little tyke, huh? Seeing him makes me understand what’s important in life. It’",
      "dialogue_count": 0,
      "word_count": 4249
    },
    {
      "scene_number": 10,
      "slugline": "EXT. A HILLSIDE ABOVE THE HOSPITAL - NIGHT A storm has begun. There’s a motorcade, ready to take the Dowling baby away. Mrs Dowling comes out of the Door, with the baby. We pull back: From the top of a nearby hill, Hastur steps from the shadows. The Mother Superior and Sister Grace Voluble runs up the hill. MOTHER SUPERIOR Our Mission is done, Lord Hastur. The baby is in place. HASTUR No need for the convent any longer, then. Or for the Order. MOTHER SUPERIOR I’m afraid I -- HASTUR Your order is dissolved. MOTHER SUPERIOR We’re what? SISTER GRACE VOLUBLE Now hang on a moment. We did everything that was asked of us. What about our rewards? HASTUR You irritate me. You talk too much. SISTER GRACE VOLUBLE We are a chattering order. We say exactly what is on our mind, and right now, what’s on my mind is that you can’t treat us like -- Hastur reaches out and puts his hand over Sister Grace’s mouth, and squeezes. She dies. Hastur looks at the Mother Superior. HASTUR Do you want to tell them the order is dissolved? Or do you want them all to perish in the fire. MOTHER SUPERIOR (shaken) Fire?  49.",
      "characters": [],
      "action_text": "Hastur gestures. Lightning strikes the roof of the Hospital. The Mother Superior looks at him, and then runs back down the hill. Hastur begins to laugh, and it’s absorbed by the thunder. The lights of the fire brigade are coming... DISSOLVE TO: MONTAGE: We hold on the fallen body of the late Sister Grace Voluble. And then we move from her to the fallen bodies in the African Village Square. From there to Sherryl the supermodel from the restaurant, in bed, dead. From there to dead fish, floating in an oil spill... And from there back to the Weedkiller boat, and we close in on the death’s head on the POISON signs. The sign of the grinning skull. Title:   IV  Over all this: NARRATOR And there’s a Fourth. He’s everywhere, and what he does is what he is. He isn’t waiting. He’s working. Although in a manner of speaking, he’s waiting for us all. CUT TO: EXT. WARLOCK’S RESIDENCE - DAY It’s fancy, and there are secret service men outside. We see a Mary Poppins style NANNY walking towards the house, with her back to us. The doorbell is pressed. The door is opened. And the Nanny, wearing dark glasses, reminds us of Crowley. She’s sexy and domineering. NANNY I understand you need a nanny.  50.",
      "dialogue_count": 0,
      "word_count": 423
    },
    {
      "scene_number": 11,
      "slugline": "EXT. WARLOCK’S BACK DOOR - DAY The back door is opened. A saintly friar-like GARDENER, big victorian gaffer sideburns, angelic, with a spade, who perhaps reminds us a little of Aziraphale, possibly chewing a grass-blade, raises his hat and says, GARDENER They do say as you moight be lookin’ for a gardener. EXT. WARLOCK’S RESIDENCE GARDEN - DAY TITLE CARD:   SIX YEARS AGO  A small boy in a garden. Brother Francis, the gardener, is feeding the birds... YOUNG WARLOCK, aged about 5, wanders over: YOUNG WARLOCK Hello Brother Francis. GARDENER Hullo, Young Warlock. My, you’re growing fast. You must be all of... YOUNG WARLOCK Five. I’m five. What’s that? GARDENER Brother Sparrow. And here’s Brother Snail... Sister Slug. Remember, Warlock, as you grow, to have love and reverence for all living things. YOUNG WARLOCK Nanny says Living things are only fit to be ground under my heels, Brother Francis. GARDENER Don’t listen to her. Listen to me. INT. WARLOCK’S BEDROOM - NIGHT Nanny has wound up the SPOOKY MUSIC BOX and the thing that casts SCARY SHADOWS ON THE WALL. Young Warlock is in bed.  51.",
      "characters": [],
      "action_text": "YOUNG WARLOCK Will you sing me a lullaby, Nanny? NANNY Of course, dear. (sings)  Go to sleep and dream of pain/ Doom and darkness, blood and brains/ Sleep so sweet, my darling boy/ You will rule, when Earth‘s destroyed.  YOUNG WARLOCK Francis says that I must be kind and nice to everybody. And hug them. Even Brother slug. And not destroy the earth. NANNY Don’t listen to him. Listen to me. EXT. LONDON BUS - DAY The top deck of a bus. Aziraphale is reading a paper. Crowley sits down next to him. CROWLEY He’s too normal. AZIRAPHALE Not at all. It’s working. The Heavenly influences are balancing out the hellish. A no score draw. CROWLEY I hope you’re right. Six years to go. INT. LIFTS - DAY Cut between Crowley and Aziraphale entering lifts, and pushing buttons for the top floor and the bottom. INT. OFFICE HELL - DAY Crowley gets out of the lift. He saunters over to reception. Muzak in background. CROWLEY Er. Crowley. Annual report.  52. RECEPTIONIST Room Five. Crowley walks down a dull corridor, past identical doors. Door Four opens, and Hastur comes out, along with a blast of fire and screams from inside. He’s dusting himself off. CROWLEY Hastur. HASTUR Crowley. They both go through door 5. INT. DOOR 5 - NO DAYLIGHT It’s an office. It’s shadowy, which is good, as we do not want to see the entities to whom Crowley is reporting in too much detail. DAGON Tell uss about the boy Warlock. CROWLEY He’s a remarkable child. HASTUR Is he evil? CROWLEY Fantastically evil. LIGUR Killed anyone yet? CROWLEY Not yet. But there’s more to evil than just killing people. Vague noises of agreement from hellish entities: Crowley has a point. LIGUR Yeah. But it’s fun. INT. HEAVENLY OFFICE - DAY We’re at the top of a skyscraper, looking out over London. Aziraphale’s meeting is very similar. Nicer decor. The incredibly well-dressed, nice men and women he’s talking to have faces that seem slightly burned out by light.  53. AZIRAPHALE And I feel that, on a deep level, the child is being influen",
      "dialogue_count": 0,
      "word_count": 2675
    }
  ]
}