{
  "slug": "green-room-2015",
  "title": "green room",
  "genre": "action",
  "format": "film",
  "scenes_count": 14,
  "characters_count": 1,
  "characters": [
    "TIGER"
  ],
  "total_words": 17590,
  "total_dialogue": 1,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. TAD’S APARTMENT - LIVING ROOM - MORNING 16   16  A compact DIGITAL RECORDER blinks RED on a coffee table. The Band sits huddled on a couch, plates of scrambled eggs on their laps. Tad sits opposite, cross-legged on the floor. TAD ...working on anything new? SAM A few songs. Maybe enough for a seven-inch. TAD Sweet! Will you actually press one? REECE If we can afford it. TAD I dig the analogue style. Which brings me to the fact: you guys are hard to find. Why no social media presence? Pat contains a wince. Sam turns to face Tiger. REECE Because booking more shows and selling more records would blow. TIGER It’s not hard-rock. SAM Says the one who gets smashed and plays Darby Crash at the shows I book on my phone... Tiger looks to his plate, eats some eggs. PAT No one wants to starve, but if you take it all virtual, you lose... the texture. TAD What do you mean, texture? PAT Just- you gotta be there. The music is for effect. It’s time and aggression and...  Pre-Production Draft v.2 (9/07/14)   9",
      "characters": [],
      "action_text": "REECE Technical wizardry. PAT ...t’s shared-   live . And then it goes away. The energy- it can’t last. SAM Unless you’re Iggy Pop. PAT And good for him. I just don’t think I’ll be in my 70’s still listening to Minor Threat. REECE Tiger will. Right? TIGER I won’t live to be seventy. Reece and Sam blurt out mocking laughs, Pat drifts. TAD Okay, so this is a good segue into one of my traditions. For each of you, name your ‘desert island’ band. Reece rolls his eyes. TIGER Only one? REECE If I were to say Black Sabbath, would I get Ozzy   and   Dio? TAD No caveats- just name   the   band . Sam, Reece, Pat and Tiger size each other up... TIGER Misfits. No, The Damned. Misfits. SAM Poison Idea. PAT (under breath) Shit man...  Pre-Production Draft v.2 (9/07/14)   10 REECE Cro-Mags. Pat, shaking his head, stressing out. REECE (CONT’D) Just say something, dude. TIGER Steely Dan. SAM Candlebox. REECE He’s a Juggalo. PAT Ah, man. (rubs face) Will this be edited? TAD I’ll chop it up a bit. TIGER Let it go raw. SAM When will this air? Shouldn’t we plug the show? TAD (thrown) Yeah... He turns off the recorder. TAD (CONT’D) My last show at the muni center didn’t end well. Lots of vomit. Some fecal matter. Tiger smiles. TAD (CONT’D) County commissioner got wind and pulled my permit. You were already en route. REECE Damn dude. We need a kill fee.  Pre-Production Draft v.2 (9/07/14)   11 SAM We went 90 miles out of our way. TAD I’ve got a backup lined-up. Lunch, 50% cut on the door, and you guys would headline. SAM Anyone else still on the bill? TAD They bailed. Deadpan from the Band as GUITAR FEEDBACK BUILDS... INT. MEXICAN RESTAURANT - DAY 17   17  A waterside mexican cafe. No frills except strung-up CHRISTMAS LIGHTS. THE BAND BLASTS OUT A CHARGED, RAPID-FIRE PUNK SONG. Sam teases FEEDBACK from an AMP with his LES PAUL. Pat on BASS, eyes trained on the floor. Behind a DRUM KIT, Reece strikes with precision. TIGER SCREAMS into a MIC. ON THE ETHNICALLY DIVERSE CROWD: Less than a doze",
      "dialogue_count": 0,
      "word_count": 1339
    },
    {
      "scene_number": 2,
      "slugline": "EXT. TWO LANE ROAD - DAY (AERIAL) 23   23  FROM ABOVE, TRACKING THE VAN as it’s swallowed by woods. EXT. RESIDENCE - DAY 24   24  FROM BEHIND a closed ENTRY GATE, with a SIGN facing the road. The van whips by... INT. CONVERSION VAN - DAY 25   25  THROUGH THE WINDSHIELD: the narrow road opens into a cul-de- sac of dirt and trampled grass. On the far end lies THE VENUE, a converted public utility building of brick and sandstone with a cheap-siding addition extending from the rear. The lot is cluttered with 4x4s, WEATHERED SEDANS and TRICKED- OUT HATCHBACKS. ROCKERS and SKINHEADS trickle into the venue. EXT. THE VENUE - LOT - DAY 26   26  The van rolls up and the Band dismounts, gulping fresh air as they’re greeted by DANIEL (27), bomber jacket, boots and grown-in buzz cut, breaking from a group of TAILGATERS admiring a pale gold ‘65 PONTIAC RAGTOP at the lot’s edge. DANIEL You guys Tad’s friends? SAM We- he sent us. Cousin Dan? DANIEL (shaking hands) Daniel. You guys look hammered. GABE (30s), crew cut and a general disdain, approaches cradling a clip board. SAM One night at Tad’s will do it. And if your girl is crashing t- Daniel grabs Sam and presses their foreheads together. DANIEL (quiet, through a smile)  Do not mention that .  Pre-Production Draft v.2 (9/07/14)   17",
      "characters": [],
      "action_text": "SAM I was- DANIEL  No worries whatsoever. Just shut the fuck up about him and me and her . Daniel releases shaken Sam with a friendly pat. GABE (arriving) Who’s the Drummer? REECE Me. GABE Just bring your cymbals- you’re using the house kit. REECE Okay. Tiger motions to a church-style SIGN out front: In encased changeable letters: ‘1PM DOORS: COWCATCHER, KOKYTUS,   AREN’T   RIGHTS’ Before Tiger speaks up, Pat calls him off with a look. INT. THE VENUE - BACKSTAGE - DAY 27   27  HARD ROCK over the PA. MOVING DOWN A DARK NARROW HALLWAY: lugging gear, the Band follows Gabe through a backstage corridor. Gabe rounds a corner and gestures to BIG JUSTIN (26), a tattooed heavyweight who dutifully steps aside for the procession. Gabe stops at a graffiti-covered door. GABE (over music) STAGE IN HERE. KEEP THE HALLWAY CLEAR- OWNER DOESN’T FUCK AROUND WITH FIRE CODE. SOUND CHECK IN FIFTEEN, YOU’RE ON IN TWENTY. SAM GOT IT.  Pre-Production Draft v.2 (9/07/14)   18",
      "dialogue_count": 0,
      "word_count": 393
    },
    {
      "scene_number": 3,
      "slugline": "INT. GREEN ROOM - DAY 28   28  MUFFLED ROCK. A fluorescent-lit interior with carpet remnants, a ratty couch, a bare-bulb Formica makeup counter, and a coffin-sized bathroom with curtains for a door. Two- decades of history told in BAND STICKERS and SHARPIE SCRAWL. Sam yanks ELECTRIC HAIR CLIPPERS from the counter-top outlet and plugs in his cell phone charger. CHIRP. PAT You okay? SAM Yeah. Are these guys not creeps? Tiger and Pat strap on GUITARS, scanning the GRAFFITI SCRAWL. Tiger finds a SWASTIKA, looks to Pat. REECE (stacking cases) Run a tight ship. TIGER But it’s a U-boat... PAT Hey ya’ll. I got a dumb idea. INT. THE VENUE - STAGE - DAY 29   29  Sun pours through the high casement windows, side-lighting the gathering crowd. Lots of shaved heads and bomber jackets. STAGEHAND Where’d you say the power suppl- SAM’S CRUNCHING GUITAR INTERRUPTS. Sound check fiddle-faddle as the PA MUSIC fades out. STAGE MANAGER It’s like a mini-transformer, with three females- like an XLR, but not- Pat plays a familiar BASS RIFF. STAGEHAND GOT IT. More GUITAR CRUNCH. Then a LOW, RHYTHMIC TOM DRUM MARCH.  Pre-Production Draft v.2 (9/07/14)   19",
      "characters": [
        "TIGER"
      ],
      "action_text": "TIGER (into mic) TEST. ONE-TWO. MEOW. More guitar on mine, please. His monitor turns up, then a look to Reece. Reece nods back. The DRUM MARCH BUILDS. TIGER (CONT’D) (into mic) Thank you. TUNING guitars, Sam and Pat lean in for an off-mic aside. PAT WE’RE NOT, ARE WE? SAM YOUR IDEA. YOU BACK OUT NOW, I TELL THEM YOU’RE JEWISH. (to Tiger) GO! TIGER (into mic) Okay, everybody! We’re the Ain’t Rights. Or the   Aren’t Rights . Either one- TWO-THREE-FOUR!!!  THE BAND GRINDS STRAIGHT INTO a classic DEAD KENNEDYS SONG: TIGER (CONT’D) (singing into mic)  Punk   ain't   no   religious   cult Punk   means   thinkin’   for   yourself You   ain't   hardcore   ‘cuz   you   spike   your hair ,   When a jock still lives inside your head...  The crowd barely sways, those who know the song give cold stares... TIGER (CONT’D)  Nazi   punks,   Nazi   punks Nazi   punks-   Fuck   Off!  Nazi   punks,   Nazi   punks Nazi   punks-   Fuck   Off!  Now some BOOS and middle fingers.  Pre-Production Draft v.2 (9/07/14)   20 NAZI   PUNKS,   NAZI   PUNKS NAZI PUNKS- FUCK OFF!  The rowdy crowd SHOUTS BACK. Another BOTTLE flies on stage. TIGER  You'll   be   the   first   to   go You'll   be   the   first   to   go You'll   be   the   first   to   go Unless   you   think!  AND THEY GRIND TO A HALT, sweat drenched, tension in the air. TIGER (CONT’D) (into mic) Thank you. That was a cover. (off mic to the Band) Whaddya wanna do next? Reece pounds a BROODING DRUM BEAT. The Band trades looks, shrugging acceptance. Sam and Pat TUNE DOWN their guitars, and the tone goes   evil ... TIGER (CONT’D) Here’s a treat... THEY PLUNGE INTO   CORONARY - A FOOT-STOMPING, HARDCORE ASSAULT. The BREAKDOWN hits and   the CROWD ERUPTS:  LIVE SOUND IS CONSUMED BY A SUBLIME, QUIET DRONE: AND WE GO SLOW-MO... THRASHING BODIES. HARD-LIT SWEAT. SILENT SCREAMS. THE BAND ON STAGE, ELECTRIFIED. TIGER. SAM. PAT. REECE. PERFECT SYNC. THE PIT ON FIRE... INT. THE VENUE - BACKSTAGE - DAY 30   30  PUSHING DOWN THE HALLWAY, THE DRONE F",
      "dialogue_count": 1,
      "word_count": 4559
    },
    {
      "scene_number": 4,
      "slugline": "EXT. THE VENUE - EDGE OF LOT - LATE AFTERNOON 50   50  The driver’s door of the conversion van opens, Gabe climbs in, Darcy steps back. DARCY Meet me by the utility shed. Gabe checks under the visor, feels for keys in the ignition. A V-8 ENGINE CHUGS AND STARTS. Confused, Gabe looks to Darcy, who’s tracking the sound. EXT. THE VENUE - EDGE OF LOT - CONTINUOUS 51   51  Daniel fidgets in his ‘65 ragtop, the engine idling, suddenly anxious to see Darcy and Gabe close in. DARCY This the new ride? DANIEL Yeah, just turning it over. Think it’s getting choked. Wrong filter. DARCY She’s a beaut. Daniel locks eyes with Gabe, kills the engine. DANIEL What’s up? DARCY Need some of the squad. Red laces only. DANIEL Tonight? DARCY Now.   (to Gabe) That list... Gabe hands over the POST-IT. DARCY (CONT’D) This is   everyone   who knows? GABE Yes. Including the band.  Pre-Production Draft v.2 (9/07/14)   46",
      "characters": [],
      "action_text": "DANIEL Knows what? DARCY (handing back the Post-it) Manageable. From here on out, not a single name gets added... Daniel climbs out of the convertible. DARCY (CONT’D) ...unless they’ve got red laces. GABE There’s eighty people in there. DARCY (to Daniel) You, plus four. Daniel turns, shoving his keys in his pocket. DARCY (CONT’D) Give Gabe your keys. Daniel pivots, flustered. DARCY (CONT’D) In case we gotta play valet. Daniel folds the keys up in the sun visor. DARCY (CONT’D) (nodding) We’re losing light. INT. GREEN ROOM - LATE AFTERNOON 52   52  BUZZING LIGHT FLICKERS DEAD AS A 4’ FLUORESCENT BULB IS TWISTED FROM ITS CEILING BALLAST. Tiger hands the bulb to Sam, who places it on the counter. SAM Watch out, those could be live... TIGER That’s speaker wire. Tiger yanks down an ALUMINUM DROP CEILING T-BAR. Pat watching, turns to Amber.  Pre-Production Draft v.2 (9/07/14)   47 PAT You don’t have a phone, do you? AMBER They took it. Pat gestures to the corpse. AMBER (CONT’D) ...hers too. PAT (reverently) I’m going to search her, okay? A flash of protest, then a nod. Pat crosses. Reece sits on the floor by the couch, revolver in hand, eyes on Big Justin. Big Justin sits cross-legged in the corner, eyes on Pat. Pat kneels by the body, digging through pockets. He pulls out a LIGHTER, sets it on the floor. TIGER We could start a fire? Pat pulls out a PACK OF CIGARETTES, sets it down. SAM That’ll give us the upper hand. Pat pulls out the FOLDED NAPKIN, unfolds it. ON THE NAPKIN, in bleeding blue ink: ‘ Fleischwolf ’. SAM (CONT’D) Got something? PAT (showing napkin) ’Fleish...wolf’? Amber eyes Big Justin. SAM Fleish is flesh, or meat. Like a fleish salad. It’s German. With sausage. PAT Meat-wolf?  Pre-Production Draft v.2 (9/07/14)   48 Sam turns his attention as Tiger plops a DUSTY CEILING TILE in his hands. SAM (blowing breath) Careful! This could be asbestos... Tiger shoots back a look as Sam sets the tile down. TIGER All concrete. PAT Nothing here. He stands over the corp",
      "dialogue_count": 0,
      "word_count": 1279
    },
    {
      "scene_number": 5,
      "slugline": "INT. THE VENUE - OFFICE TRAILER - MAGIC HOUR 55   55  GABE You’re not worried they’ll talk? Darcy shuts a SECURITY SAFE, turns to present two STAMPED BAGS of HEROIN. DARCY They’ve got priorities. EXT. THE VENUE - OFFICE TRAILER - MAGIC HOUR 56   56  WALK AND TALK, Darcy and Gabe head for Cowcatchers’ sedan. DARCY Tell them the party is on us if they hole up for a few days. Put this fire out first... GABE (reading stamp) ‘Grove Street’? DARCY My dope, nigger stamps- in case one of these meatheads gets booked for possession. (arriving at sedan) Let’s get y’all somewhere safe! EXT. THE VENUE - AROUND BACK - MAGIC HOUR 57   57  The conversion van is pushed along quiet dirt. A Skin hops in the open door and steers it to a stop. INT. GREEN ROOM - EVENING 58   58  Sam eyes Tiger, crouching with a SHARPIE, drawing a large ‘X’ on the floorboards. SAM Treasure? TIGER Daylight. Underneath. Eyes find Amber. She shrugs ignorance. MUFFLED, THROUGH THE DOOR: ROLLING, SCUFFS and THUMPS.  Pre-Production Draft v.2 (9/07/14)   54",
      "characters": [],
      "action_text": "REECE Our gear... KNOCK KNOCK. DARCY (O.S.) GENTLEMEN? PAT YES. DARCY (O.S.) WE’RE LOADING YOU OUT. SAM ARE THE POLICE HERE?! DARCY (O.S.) THEY’VE COME AND GONE. GOT A LITTLE COMPLICATED. SAM We’re so fucked. DARCY (O.S.) I’M GETTING HOARSE. (clearing throat) Can you hear me at this volume? SAM YES.   PAT Yes. DARCY (O.S.) (CONT’D) Good. And can we elect a single voice? Sam yields, Pat inches closer to the door. PAT Yes. DARCY (O.S.) You are trapped. This is not a threat, just a fact. PAT (to door) We have the gun. Loaded. Also just a fact. DARCY (O.S.) We’ve got plenty more guns on hand, but we want you out, not harmed.  Pre-Production Draft v.2 (9/07/14)   55 Pat shoots a look back at the band. DARCY (O.S.) (CONT’D) That firearm you have is not registered. I wanted it out of the picture before the authorities arrived. You refused, and so here we are... REECE (whispering) Bullshit. Pat looks for consensus, there is none. PAT (to door) ...here we are. DARCY (O.S.) I do apologize for my associates. They panicked. PAT No shit! And we’re in a r- DARCY LISTEN. No one’s trying to wipe this clean. Whatever you saw or did is not now my concern. Tell whoever you want whatever you want. All I ask is that you understand you were held here for your own safety. Before you were let go. A crossfire of looks, a surge of hope. PAT (to door) Yes. Thank you. To be clear, the police are coming back? DARCY (O.S.) They have come and gone. PAT (to door) That’s what concerns us. DARCY (O.S.) Just need that gun out of the picture...  Pre-Production Draft v.2 (9/07/14)   56 Pat crosses between Reece and Big Justin, towards the center of the room. REECE (tipping gun barrel away) Careful. Sam and Tiger join Pat in the center, Amber hovers close. IN A HUDDLE,   HUSHED . PAT  What do we do ? TIGER  Dig through the floor . SAM  While they just wait? They could shoot us anytime . PAT  But they haven’t. How do we even know th-  AMBER They have guns. No question. SAM SHHH.  We’re going to trust   y",
      "dialogue_count": 0,
      "word_count": 3628
    },
    {
      "scene_number": 6,
      "slugline": "EXT. THE VENUE - SIDE ENTRANCE - CONTINUOUS 68   68  ALAN OH SHIT?! Gabe pulls Alan back. GABE Save it. Reece slumps to the ground with glazed eyes, BLEEDING OUT as Gabe searches his pockets. INT. THE VENUE - BAR - CONTINUOUS 69   69  TIGER SPLAYED ON THE FLOOR, THE PIT (BROWNIE) GNAWING AT HIS NECK. Clark steps up, WHAPPING BROWNIE with his break stick. CLARK Aus! Aus! BROWNIE releases, lapping blood, tongue swinging. CLARK (CONT’D) Las es... VORAN! HOLD ON TIGER, his drifting eyes catch something... STRAPPED UNDER THE BAR COUNTER: A SAWED-OFF PUMP SHOTGUN. ON TIGER: just an observer now, calmly nearing lifelessness. INT. THE VENUE - STAGE - CONTINUOUS THE PIT BULL (BROWNIE) DARTS TOWARDS THE STAGE... Amber launches from behind a speaker stack, sprints across. BROWNIE EFFORTLESSLY MAKES THE FOUR FOOT LEAP UP THE STAGE. HE BRIDGES THE DISTANCE IN SECONDS, CLAMPING ON AMBER’S LEG. AMBER AHHHWWW... She crumples to the stage floor, BROWNIE SINKS HIS BITE AND THRASHES.  Pre-Production Draft v.2 (9/07/14)   77",
      "characters": [],
      "action_text": "CLARK (keeping his distance) FASS! FASS! Amber topples a MIC STAND and starts BLUDGEONING BROWNIE with its WEIGHTED BASE. Little effect. As she thrusts and winds up, the attached MICROPHONE contacts the FLOOR MONITOR SPEAKER, causing FEEDBACK SURGES. BROWNIE twitches at the sound, anxiously finds new footing. BETWEEN AMBER’S JABS, A HAND REACHES DOWN BEHIND HER, SNATCHING THE MICROPHONE FROM THE STAND. IT’S PAT, scared shitless. He presses the microphone to the monitor. The FEEDBACK SWELLS TO AN EAR-SPLITTING FREQUENCY. BROWNIE RELEASES HIS GRIP AND CIRCLES, MAKING ERRATIC LUNGES. AMBER CLUNKS HIM ON THE HEAD AND HE SCAMPERS OFF. Amber, spent, looks back to Pat, the SCREECHING FEEDBACK like music to their ears. Taped below the monitor is COWCATCHER’S SET LIST. Pat crinkles a brow, peels it up. INT. THE VENUE - BACK HALLWAY - CONTINUOUS 70   70  FEEDBACK, FARTHER AWAY. Sam unhooks a wall-mounted FIRE EXTINGUISHER. Fumbling, he snaps the plastic seal around the trigger pin. He creeps along, settling at the back entrance. He pulls the safety pin. Crouching, he kicks open the door. SCUFFLING. PFFFSHHHH. SAM TRIGGERS THE EXTINGUISHER, UNLEASHING A JET OF PROPELLENT AND FIRE RETARDANT. KYLE (O.S.) Fuck! COUGHING AND GASPING AS KYLE’S MACHETE BLADE CUTS THROUGH THE BILLOWING CLOUD AND CLANKS AGAINST THE DOOR.  Pre-Production Draft v.2 (9/07/14)   78 SAM Shit! Sam kicks back, dragging the extinguisher, crawling to a run. The door SLAMS behind him. A MUFFLED EXCHANGE OUTSIDE. INT. THE VENUE - BACKSTAGE - MOMENTS LATER 71   71  Pat and Amber converge with Sam at the Green Room. Sam grips the extinguisher, Amber the mic stand. SAM They’re everywhere- you see Reece? Amber and Pat solemnly shake their heads. THE FEEDBACK PERSISTS. INT. GREEN ROOM - MOMENTS LATER 72   72  Sam, Amber and Pat drop their gear and shove the couch against the battered door. SAM Here we are... Pat picks the napkin off Emily’s corpse, hands Sam the COWCATCHER SET LIST. PAT Third one down. SAM (reading s",
      "dialogue_count": 0,
      "word_count": 523
    },
    {
      "scene_number": 7,
      "slugline": "EXT. THE VENUE - LOT - CONTINUOUS 73   73  Darcy pacing, Clark leading the BLOOD-BATHED PIT (BROWNIE) up the tailgate of his truck and into a CRATE. CLARK (patting dog) So ist brav... DARCY You retiring him? CLARK He’s worked up. DARCY Send another. Send two. Finish it. CLARK Kill that feedback first. (locking crate) And if I send in two fighting dogs, whaddya think they’ll do? Darcy digests that thought, Daniel steps up. DANIEL Send me in there. I’ll finish up. Darcy considers. DANIEL (CONT’D) Just give me the rules. CLARK Alright. Blades only. Sloppy is fine, but try not to hit the bone. DANIEL (already moving) Okay. DARCY Take Jonathan. Jonathan joins Daniel, they clasp hands. JONATHAN Brute squad. DANIEL (to Clark) Keep them caged ‘till we tag out?  Pre-Production Draft v.2 (9/07/14)   80",
      "characters": [],
      "action_text": "AROUND THE SIDE: Gabe rounds the corner, pulling REECE’S BODY by the feet. He spots Daniel and Jonathan heading into the venue, machetes in hand. DARCY (re: the body) He breathing? GABE (turning) Little, yeah. DARCY Let him bleed- later is better with time of death. Keys? Gabe shakes‘no’. INT. THE VENUE - MAIN ENTRANCE - NIGHT 74   74  RINGING, DISTORTED FEEDBACK... TRACKING BEHIND DANIEL AND JONATHAN, MACHETES IN HAND... Moving fluidly past the bar, Daniel goes straight for the green room, Jonathan hops onto the stage, yanks the microphone from the monitor speaker and kills the switch. INT. GREEN ROOM - NIGHT - CONTINUOUS 75   75  THE FEEDBACK STOPS. Sam, Amber and Pat look to the door. AMBER They’re coming. MUFFLED FOOTSTEPS up the hallway... SAM I can’t do this... PFFUMP. PFFUMP. CRACK. The door is succumbing to BOOT STRIKES. Sam readies his fire extinguisher, Pat steps back. Amber grips the mic stand.  Pre-Production Draft v.2 (9/07/14)   81 PFFUMP. CRUNCH. SPLINTERING AROUND THE DEADBOLT. CRACK! DANIEL BUSTS THE DOOR OPEN, sliding the couch inward. SAM FIRES HIS EXTINGUISHER, FORCING DANIEL BACK. The CLOUD envelops the room. ZERO VISIBILITY. They hear Daniel SCUFFLING his way back inside. PAT GET BACK! SAM FIRES ANOTHER JET OF RETARDANT, but Daniel is on him and snatches the extinguisher away. DANIEL KICKS SAM TO THE FLOOR. DANIEL WHERE’S EMILY? Daniel wafts the air, sweeps the ground, pulling the jacket off BIG JUSTIN’S GUTTED CORPSE. AMBER Daniel! Jonathan enters, thrown off, the CLOUD settling. JONATHAN Fuck are you doing? PAT He’s the one... Pat holds up the napkin, looks to Amber. PAT (CONT’D) ...gave her this. Daniel pulls the blanket off EMILY’S CORPSE. JONATHAN Hey! Daniel white-knuckles the machete, acknowledging Amber. DANIEL Which one did it? AMBER  Werm   did it.  Pre-Production Draft v.2 (9/07/14)   82 DANIEL Bullshit. Which one? Sam COUGHS, covered in fire retardant, disappears down the hole in the floor. Jonathan observes with mounting confusion.",
      "dialogue_count": 0,
      "word_count": 585
    },
    {
      "scene_number": 8,
      "slugline": "EXT. THE VENUE - EDGE OF LOT - NIGHT 77   77  ON THE VISOR OF DANIEL’S ‘65 RAGTOP. Darcy flips it down, catches the keys. TRACKING WITH HIM AS HE OPENS THE TRUNK. INSIDE THE TRUNK: Packed to the hilt with BOXES, BEDDING, RECORDS, ARTIFACTS. ONE SIDE:   HIS . ONE SIDE:   HERS . Darcy swipes a FRAMED PICTURE from one of the boxes. THE PICTURE:   Emily and friends, way back when . DARCY Little love birds... Darcy reaches to shut the trunk, notices something tucked deep inside, pulls it out... AN ALUMINUM BASEBALL BAT, WRAPPED IN A CLEAR GARBAGE BAG. It’s weathered, spattered with DRIED, FLAKING BLOOD. EXT. THE VENUE - LOT - NIGHT 78   78  Darcy approaches Gabe with the bat, still wrapped in the bag. Gabe frozen with dread. DARCY Recognize this? GABE No sir. DARCY Course not. You were handing out leaflets when these boys made their bones. (offering the bat) It’s from last Easter. And it was supposed to disappear after the boot party... Jonathan pushes out the exit, walking briskly with his machete, dusted with FIRE RETARDANT.  Pre-Production Draft v.2 (9/07/14)   84",
      "characters": [],
      "action_text": "JONATHAN He just started   talking ? Amber’s alive, saying Werm did it- DARCY (to Jonathan) Never mind that. Darcy steps to Gabe... DARCY (CONT’D) You... ...and kisses his forehead. DARCY (CONT’D) ...Werm- just saved us all. INT. UNDERGROUND LAB - NIGHT 79   79  Pat is lowered by his good arm from the hole above, his feet hit the floor. PAT Sam? Just the empty lab. PAT (CONT’D) It’s okay. Amber drops down behind him. Then Daniel. PAT (CONT’D) I mean, it’s not   okay , but he’s with us. We gotta split. Pat continues towards the adjacent shipping container. Daniel takes in the operation. AMBER You didn’t know either. DANIEL Not where. INT. UNDERGROUND LAB - SHIPPING CONTAINER - CONTINUOUS 80   80  Pat steps in, finds Sam sizing up an INDUSTRIAL FAN.  Pre-Production Draft v.2 (9/07/14)   85 SAM This has a wider duct. I think. (turning) Reece was full of shit. Sam, swollen puffy eyes. PAT We won’t fit through there... SAM Signed with Battletorn. That’s why he was so pressed. All his calls- lining up a big winter tour... PAT Daniel can help. SAM Why? Who’s he? DANIEL (stepping in) A traitor. If they didn’t already know, they know now. I can get us out. SAM Wow, a conspiracy? DANIEL No, just a clusterfuck. EXT. THE VENUE - LOT - NIGHT 81   81  Darcy addresses the crew, Clark paces with his PIT (JD). DARCY Light has been shed. Daniel and Emily, it appears, had ill intentions... Darcy holds up the bat. Some MURMURS from the Skins. DARCY (CONT’D) So it is with renewed vigor we will see this through. Everything is at stake, and for us all. Gabe presents the milk crate, the Skins retrieve the .25 AUTO, the .38 SNUBNOSE. Darcy picks up the .454 RUGER.  Pre-Production Draft v.2 (9/07/14)   86 DARCY (CONT’D) We’re still blades and fangs for the visitors, but we’re getting lean on time. If you   have   to shoot- shoot once. More than once- keep a tight grouping cuz you’ll be digging the slugs out yourself. As for Daniel and Am- wait... Gabe uncaps a pen, ready to amend his POST-IT",
      "dialogue_count": 0,
      "word_count": 2657
    },
    {
      "scene_number": 9,
      "slugline": "INT. GREEN ROOM - CONTINUOUS 100   100  Jonathan and Kyle get their bearings. The SPEAKER WIRE above the ceiling tile has been YANKED AND ROUTED to the ‘90s CABINET STEREO SYSTEM, a WIRED MICROPHONE PROPPED AGAINST A SPEAKER, KARAOKE LIGHTS FLASHING. Jonathan yanks the microphone, zeroes the MIXER. THE FEEDBACK REVERBERATES INTO SILENCE. Kyle lifts the plugged-in HAIR CLIPPERS from the counter. KYLE It’s them. BELOW: PAT’S HAIR CLIPPINGS LITTER THE FLOOR. Jonathan squats by the smashed-up hole in the floor. JONATHAN Gimme the shotgun. KYLE I got the shotgun. JONATHAN Then go down this fucking hole. Kyle hands over the shotgun, Jonathan sets the .25 down and scoots to the edge... JONATHAN (CONT’D) (checking the breach) Three shots? KYLE Yup. JONATHAN You hear me fire twice, you come down no matter what. KYLE This is a trap. JONATHAN No shit. You wanna go tell Darcy? Kyle shaking his head, cowed.  Pre-Production Draft v.2 (9/07/14)   99",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 157
    },
    {
      "scene_number": 10,
      "slugline": "INT. UNDERGROUND LAB - CONTINUOUS 101   101  Jonathan drops down, surveys. HEARS THE CLANKING MACHETE. JONATHAN ...he’s gonna be pissed. (up to Kyle) Watch my back. Jonathan creeps forward... INT. GREEN ROOM - CONTINUOUS 102   102  A WIDE OF KYLE PERCHED ABOVE, LOOKING BELOW. BEHIND HIM, THE COUCH PILLOWS SLOWLY PART AND PUSH UP. CREEPING IN, as he grabs the .25, checks the safety. INT. UNDERGROUND LAB- CONTINUOUS 103   103  Jonathan follows the CLANKING, shotgun at the ready... Until he stops in his tracks. JONATHAN Fuck this. And backs up to Kyle, shotgun towards the CLANKING. JONATHAN (CONT’D) Get Gabe, man! We need two down here and one up there. (turning to Kyle) Who’s got the thirty-eight? WE TRACK FROM BEHIND JONATHAN, PUSH PAST AND UP TOWARDS KYLE, VISIBLE THROUGH THE HOLE. KYLE Yeah, somethi-AUQ.. THE BOX CUTTER SWIPES TWICE ACROSS KYLE’S NECK, A GLIMPSE OF AMBER BEHIND HIM, ALSO IN SHARPIE ‘WAR PAINT’. JONATHAN WATCHI-...! Jonathan swings and levels the shotgun- IN HIS SIGHTS: KYLE, SPILLING BLOOD, EYES ADRIFT, FIRES THE .25 INTO THE FLOOR AND SLUMPS TO THE SIDE.  Pre-Production Draft v.2 (9/07/14)   100",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 187
    },
    {
      "scene_number": 11,
      "slugline": "INT. GREEN ROOM - CONTINUOUS 104   104  Amber, scoots back, prying the gun from Kyle’s grip. AMBER PAT! HE’S GOT THREE SHOTS. INT. UNDERGROUND LAB- CONTINUOUS 105   105  ON JONATHAN, patiently waiting for his shot. JONATHAN ...bitch. PAT CREEPING BEHIND HIM IN WAR PAINT, MACHETE RAISED... BMPT! PFFF! POP! AMBER FIRES THE .25 AT JONATHAN FROM ABOVE. PAT SCRAMBLES BACK AS BULLETS WHIZZ AND RICOCHET. BOOM. JONATHAN FIRES, SHREDDING THE EMPTY HOLE WIDER. BEHIND A CONTAINER WALL: Pat, faltering, cowering. JONATHAN (O.S.) (CONT’D) GABE! INT. THE VENUE - MAIN ENTRANCE - CONTINUOUS 106   106  ENVELOPED BY NOISE, grimacing Gabe POWER-WASHES behind the bar. The SHOP-VAC WHISTES up BLOODY WATER and SOAP. THE CORPSES OF DANIEL AND THE BARTENDER lie in the foreground, wrapped in HEAVY DUTY TARP. INT. GREEN ROOM - CONTINUOUS 107   107  Amber eyes the door, sprawled on the floor with the .25. PAT (O.S.) (low, through the floor) AMBER! She turns to the hole in the floor. AMBER YEAH?  Pre-Production Draft v.2 (9/07/14)   101",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 168
    },
    {
      "scene_number": 12,
      "slugline": "INT. UNDERGROUND LAB- CONTINUOUS 108   108  PAT Nevermind... Pat rises to his feet. INT. GREEN ROOM - CONTINUOUS 109   109  Amber grabs the fire extinguisher, crawling to a crouch as she EMPTIES IT INTO THE HOLE... AMBER TWO SHOTS LEFT. INT. UNDERGROUND LAB- CONTINUOUS 110   110  Jonathan swings the shotgun towards the DOWNWARD JET OF PROPELLANT AND FIRE RETARDANT. THROUGH THE SWELLING CLOUD, HE MAKES OUT DANGLING FEET. JONATHAN AIMS AS THE LEGS DROP DOWN... He takes his eyes off the sights. JONATHAN NICE FUCKING TRY. KYLE’S BODY DROPS TO THE FLOOR. AMBER (O.S.) (muffled) Go fuck yourself. Jonathan turns from the CLOUD, Pushing through the thick plastic curtain into the next- WHOMP. The MACHETE CUTS THROUGH CURTAIN AND HITS JONATHAN SQUARE IN THE CHEST. HE STAGGERS BACK, HITS THE GROUND AND FIRES. BOOM. THE PLASTIC CURTAIN SHREDS. HE PUMPS THE SHOTGUN. AMBER (O.S.) (CONT’D) (muffled) ...fuck me...PAT! HALF-VISIBLE THROUGH THE THINNING CLOUD, UNMISTAKABLY FEMALE LEGS DANGLE JUST ABOVE THE FLOOR. JONATHAN PIVOTS ON HIS BACK AND FIRES.  Pre-Production Draft v.2 (9/07/14)   102",
      "characters": [],
      "action_text": "BOOM. A LEG BLOWS APART AT THE KNEE. THE BODY DROPS, THE .25 AUTO CLATTERING NEXT TO IT. Jonathan checks the breech of his shotgun: EMPTY He tosses the shotgun and goes for the .25 AUTO. Picks it up, slides the action. SEES THERE’S NO MAGAZINE. JONATHAN LOOKS UP: AMBER IS ABOVE, HOLDING THE MAGAZINE. AMBER (CONT’D) ZERO! JONATHAN LOOKS DOWN: SEES EMILY’S MUTILATED BODY. JONATHAN LOOKS BACK: SEES PAT TURNING OUT HIS POCKETS, DROPPING .12 GAUGE SHELLS, HANGING ON TO ONE... JONATHAN Shit. JONATHAN CHARGES PAT... PAT SLAPS IN THE SHOT SHELL, PUMPS THE ACTION ONE-HANDED... JONATHAN CHUCKS THE EMPTY .25 AT PAT... PAT FIRES MID-FLINCH. BOOM! MISSING BY A MILE... PAT FUUUUUUCK! JONATHAN GRABS THE SHOTGUN, BUT PAT CLINGS ON FOR HIS LIFE. FROM AFAR, in a PILE of CARNAGE, Amber drops down. She quietly closes in as Jonathan throttles Pat like a rag doll, clinging in agony. She picks up the .25 and loads it... Jonathan grabs a SHOT SHELL from the floor. POP. POP. SHE DROPS JONATHAN WITH TWO POINT BLANK SHOTS TO THE SIDE OF THE HEAD. Amber and Pat, faces in ridiculous Sharpie scrawl. AMBER Got him.  Pre-Production Draft v.2 (9/07/14)   103 PAT Totally.. (pained breath) ...flabbergasted that motherfucker. INT. GREEN ROOM - MOMENTS LATER 111   111  PULLING OUT FROM THE HOLE IN THE DUSTY FLOOR. The shotgun is tossed up through it, CLATTERING to the floor. GABE WATCHES FROM THE DOORWAY with his POWER WASHER and SHOP VAC. Amber gets to her feet, locks eyes with Gabe. GABE If I had any ide- She reaches for Pat, helps him up to his feet. AMBER Any more dogs? GABE No. PAT People? GABE Not here. Up the road. AMBER AND PAT, looking like hammered shit. GABE, dropping his gear. GABE (CONT’D) I wanna go to jail. SUBTLE, BROODING MUSIC... INT. VENUE - DAWN 112   112  PUSHING THROUGH THE BACKSTAGE HALL, The greenroom door opens. PUSHING ALONG THE STAGE, we hear FOOTSTEPS. PUSHING THROUGH THE MAIN FLOOR, FIRST LIGHT spilling in. PUSHING PAST THE BAR, towards the main entrance.  Pre-Production Dr",
      "dialogue_count": 0,
      "word_count": 1769
    },
    {
      "scene_number": 13,
      "slugline": "EXT. ORCHARD - MORNING 125   125  MIGRANT WORKERS, men and women, mostly Latin, harvest HONEYCRISPS from a row of manicured TREES. Gabe, BLOOD STAINED and ragged, approaches from a fence. The HIGHWAY is audible nearby. GABE We need police. INT. TAD’S APARTMENT - BEDROOM - MORNING 126   126  A DOOR OPENS OFF SCREEN, spilling sunlight on THE CLUSTER OF FRAMED CAT PHOTOS. MOVING ALONG THE DRESSER, A NOTE:  D- See you after my shift. I hope you both like eggs. -T  INT. WERM’S HOUSE - BASEMENT - MORNING 127   127  Specks of light penetrate bedsheet-covered windows. The Guitarist and Drummer are on the floor by the couch, frozen in TIGHT-JAWED RIGOR MORTIS, a NEEDLE IN THE GUITARIST’S ARM. SOMEONE behind them, rocking in front of the TV. It’s Werm, in cool, fuzzy light, eating a BOWL OF CEREAL. Hard to tell if the CREEPING SIRENS come from the TV... EXT. MAIN ROAD - MORNING 128   128  The conversion van remains IDLING by the road, doors agape. INT. CONVERSION VAN - CONTINUOUS 129   129  ON THE RADIO, the driver’s door open in the background. RATTLING QUIETLY,   Tad’s Ain’t Rights INTERVIEW on FM 85.5.  A SHAPE OUTSIDE THE VAN MOVES LOW ACROSS FRAME.  Pre-Production Draft v.2 (9/07/14)   112",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 207
    },
    {
      "scene_number": 14,
      "slugline": "EXT. THE RESIDENCE - DRIVEWAY - MORNING 130   130  Amber and Pat are seated on the gravel, heads resting against the bumper of Clark’s truck. They see the shape: The wounded PIT (JD), BLOOD SOAKED AND GNARLY. It stalks up the driveway towards them... Amber and Pat raise their guns. CLICK. CLICK. CLICK. All three of them on their last leg, the PIT (JD) limps past, sniffs out Clark’s body and curls up next to it. The Presa Canario whimpers from its tethered line. Pat and Amber slump back, quiet takes hold. The van’s RADIO barely audible. PAT ...I know what it is. AMBER (eyes ahead) What   what   is... PAT My desert island band. Two beaten, half-assed warriors in the late summer breeze. AMBER Tell somebody who gives a shit. CUT TO BLACK.  Pre-Production Draft v.2 (9/07/14)   113",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 139
    }
  ]
}