{
  "slug": "guardians-of-the-galaxy-vol-2-2017",
  "title": "guardians of the galaxy vol 2",
  "genre": "sci-fi",
  "format": "film",
  "scenes_count": 18,
  "characters_count": 0,
  "characters": [],
  "total_words": 26881,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. THE SOVEREIGN - OUTER SPACE  An artificial, golden planet, made of interlocking orbs, revolves around a blue sun. We PUSH IN on THUNDEROUS INTERDIMENSIONAL CRACKS on one small patch of planet. SUPER:   THE SOVEREIGN M49 5IOL339P21+H9LNI31  I/E. POWER STATION - DAY  A DIMENSIONAL CRACK SNAPS in the sky overhead.   PETER QUILL looks from it to an old MATTEL ELECTRONICS FOOTBALL GAME converted into a tracker.   A RED DOT APPROACHES. QUILL Showtime, a-holes! It’ll be here any minute! GAMORA (O.S.) Which will be its loss. Quill turns toward GAMORA, loading a rifle.   DRAX, ROCKET, and BABY GROOT also ready themselves for battle in this grand, open-air power station. Dozens of BATTERIES are couched in conductor towers encircling them. Quill, Gamora, and Rocket wear flying rigs. QUILL Is that a rifle? GAMORA You don’t know what a rifle is? QUILL I thought your thing was a sword. GAMORA We’ve been hired to stop an interdimensional beast from feeding on those batteries’ energy, and I’m going to stop it with a sword? QUILL (mumbling to himself) Don’t look at me like I’m stupid. You’re the one being all inconsistent. A LOUDER, LARGER CRACK: something seems to be fighting its way through the sky.  3  ©   Marvel",
      "characters": [],
      "action_text": "GAMORA Drax, why aren’t you wearing one of Rocket’s aero-rigs? DRAX It hurts. GAMORA Hurts? DRAX (muttering) I have sensitive nipples. Rocket, who is working on a pair of speakers wired to Quill’s Walkman, LAUGHS HARD at this. Drax points at him. DRAX (CONT’D) What about him?! What’s he doing?! ROCKET If I finish this, we can listen to tunes while we work. DRAX How is that a priority? ROCKET Blame Quill! He’s the one who loves music so much! QUILL I agree with Drax. It’s hardly important right now. ROCKET Oh, sure, okayyyy, Quill. Rocket WINKS at him. QUILL No, I really agree with him. ROCKET Sure, I know. Rocket WINKS some more. DRAX I can clearly see you winking. ROCKET Damn. I’m using my left eye?  4  ©   Marvel Rocket hears a small GROWL. He looks down and sees Baby Groot - newly unpotted, only nine inches tall or so - angrily THROWING ASIDE some foraging Orloni.   Then he looks up at Rocket, explaining: GROOT I am Groot. ROCKET They were not looking at you funny. AN EVEN LARGER CRACK! Rocket swirls as a GIGANTIC BEAST - a hundred-foot-long Lovecraftian monstrosity - BREAKS THROUGH THE INTERDIMENSIONAL RIFT.   THE ABILISK is the color of a pinkie mouse with kaleidoscopic and deadly SPLATTER MATTER pulsing from its maw. ROCKET (CONT’D) Well. That’s intense. Rocket, Quill, and Gamora JET-PACK OUT OF THE WAY, while they BLAST at the creature.   Drax HOLLERS, CHARGING it with his twin blades. Quill TURNS ON his mask. But we FOCUS on baby Groot, who trots up to the stereo speakers and Walkman. He fiddles with two wires.   They SPARK, the stereo POWERS UP, and “MR. BLUE SKY” by ELECTRIC LIGHT ORCHESTRA PLAYS as -  THE CREDITS START  Baby Groot DANCES IN-FOCUS in the foreground as the Guardians get PUMMELED by the beast OUT-OF-FOCUS in the background. Baby Groot’s dancing is arrhythmic and many of his “dance moves” are nonsensical mixtures of trembling, swaying, and making weird faces. But it is joyous. As Groot struts, Quill comes ROLLING behind him. As he stands, he ",
      "dialogue_count": 0,
      "word_count": 3259
    },
    {
      "scene_number": 2,
      "slugline": "INT. SOVEREIGN PILOT BAY - DAY  One after another the SOVEREIGN PILOTS screens go blank, and they FALL BACK, angry and upset. PUSH IN on Ayesha, barely containing her fury.  I/E. MILANO FLIGHT DECK - OUTER SPACE  Quill FLIPS the controls back, so he’s piloting again. ROCKET What are you doing?! QUILL I’ve been flying this rig since I was ten years old. ROCKET I was cybernetically engineered to pilot a spacecraft! Rocket FLIPS the controls back to him. QUILL You were cybernetically engineered to be a douchebag. Quill FLIPS the controls back to him. GAMORA Stop it! ROCKET Quill, later on tonight you’re gonna lay down in your bed and there’s gonna be something squishy in your pillowcase and you’re gonna be, like, ‘what’s this?’ and it’s gonna be because I put a turd in there. Rocket FLIPS the switch back. QUILL You put your turd in my bed, I shave you. ROCKET Oh it won’t be my turd, it will be Drax’s. Drax LAUGHS cheerfully. Gamora glances at him. He explains:  20  ©   Marvel",
      "characters": [],
      "action_text": "DRAX I have famously huge turds. GAMORA We’re about to die, and this is what we’re discussing? DRAX They raise havoc with the pipes. That’s why I do all the plumbing. I take responsibility for my actions. Unlike some people... Drax eyes baby Groot. QUILL Groot, he’s right, you have to start aiming inside the box. Groot looks ashamed. Quill FLIPS the controls back. GAMORA Stop it. Rocket SWITCHES it back. Quill SWITCHES it back. They’re nearing the end of the Asteroid Field when both go to switch it at the same time and -- WHAM! A LARGE ASTEROID SMASHES THROUGH the stern of the Milano.  I/E. MILANO LIVING AREA - OUTER SPACE  A CHUNK OF THE REAR OF THE CRAFT DISAPPEARS. Nebula IS SUCKED toward the hole - but, fortunately, her arms are shackled to a post, so she doesn’t fly out. Her face and body cover with frost.  I/E. MILANO FLIGHT DECK - OUTER SPACE  Everything FLIES AROUND THE SPACECRAFT, RUSHING THROUGH THE HOLE. Groot GOES FLYING, but Quill CATCHES HIM, and casually TOSSES him back to Drax -- So that he can punch in a code, causing -  21  ©   Marvel",
      "dialogue_count": 0,
      "word_count": 371
    },
    {
      "scene_number": 3,
      "slugline": "I/E. MILANO LIVING AREA - OUTER SPACE  A PROTECTIVE ENERGY SHIELD SLIDES UP in front of the hole. Nebula COLLAPSES to the floor. She yells upstairs -- NEBULA Idiots!  I/E. MILANO FLIGHT DECK - OUTER SPACE  Everyone catches their breath, relieved. ROCKET Well, that’s what you get when Quill flies. Gamora THROWS SOMETHING HARD at the back of Rocket’s head. ROCKET (CONT’D) Ow! GAMORA There’s still a Sovereign craft behind us! The electronics FLICKER. QUILL Our weapons are down! GAMORA Twenty clicks to the jump. The Mean Pilot BLASTS at them from the sole Sovereign Craft, TAKING OUT another part of a wing. The Milano is TREMBLING. Drax starts climbing down into the living area. QUILL Where’s he going?  INT. SOVEREIGN PILOT BAY - DAY  A group of pilots have gathered around the Mean Pilot, rooting him on, like kids at a video arcade. FRIGHTENED PILOT Come on, Zylak, you can do this.  I/E. MILANO LIVING AREA - OUTER SPACE  Nebula sees the bowl of yaro root has spilled in front of her.  22  ©   Marvel",
      "characters": [],
      "action_text": "She reaches for a piece, but it’s KICKED OUT OF HER WAY. She looks up to see Drax, grabbing a cable on a spool attached to the wall. DRAX It’s not ripe. Drax HOOKS the cable to his belt. A folder on the wall reads  SPACESUITS FOR EMERGENCY   and, below that, in Rocket’s scrawl:  OR FOR FUN . Drax pulls a small disk from the folder.   He slaps it between his shoulder blades and a SHIMMERY SHEATH COVERS HIS ENTIRE BODY - a thin force-field spacesuit.  I/E. MILANO FLIGHT DECK - OUTER SPACE  Gamora watches THE MAP leading to the jump point. GAMORA Fifteen clicks. Another BLAST from the Sovereign craft HITS them.  INT. SOVEREIGN PILOT BAY - DAY  The pilots rooting on the Mean Pilot erupt into CHEERS.  I/E. MILANO LIVING AREA - OUTER SPACE  Drax grabs a huge rifle. He punches buttons on the wall. A SECOND PROTECTIVE SHIELD OPENS UP between him and Nebula, and THE FIRST PROTECTIVE SHEATH OPENS, exposing him to space --  INT. SOVEREIGN PILOT BAY - DAY  The Mean Pilot watches in awe as Drax JUMPS OUT the back of the Milano.  I/E. MILANO LIVING AREA - OUTER SPACE  Drax smiles. The cable UNSPOOLS and SNAPS TAUT when it reaches its end. Drax is DRAGGED HAPHAZARDLY by the Milano like a water sled on a boat.  I/E. MILANO FLIGHT DECK - OUTER SPACE  ON THE MAP, the jump point gets closer.  23  ©   Marvel GAMORA Ten clicks.  I/E. MILANO LIVING AREA - OUTER SPACE  The Mean Pilot BLASTS WILDLY at Drax, missing him by mere inches. Drax brings the sight to his eye.   Aims at the ship. DRAX Die, spaceship. And he SHOOTS, BLASTING the Sovereign ship.  INT. SOVEREIGN PILOT BAY - DAY  The Mean Pilot SCREAMS as his lights go out. The Frightened Pilot shakes his head in disgust. FRIGHTENED PILOT You suck, Zylak. Zylak is really sad.  I/E. MILANO FLIGHT DECK - OUTER SPACE  As Quill and Rocket leave the asteroid field, it seems for a moment they’re scot-free... GAMORA Five clicks! Then DOZENS OF OMNICRAFT pull around them on both sides. QUILL Son-of-a-! They went around the field!  INT. SOVEREI",
      "dialogue_count": 0,
      "word_count": 1503
    },
    {
      "scene_number": 4,
      "slugline": "INT. IRON LOTUS SUITE - DAY  YONDU UDONTA is staring out the window as he puts on his pants.   He looks utterly disconnected and alone. Behind him are three ROBOT COURTESANS.   One pushes a button on her neck and she POWERS DOWN. TULLK (O.S.) Yondu! Come on down! Yondu looks down at the street where an older Ravager, TULLK, drunkenly dances, waving for him to join.  INT. IRON LOTUS - MOMENTS LATER  Yondu exits his suite. Two bodyguards, BRAHL and HALF-NUT, salute and follow him as he descends the stairwell. At the bottom of the stairs a group of RAVAGERS in BLUE UNIFORMS LAUGH. A gruff, older warrior, STAKAR, and a man seemingly made of diamonds, MARTINEX are among them. Yondu stops when he sees them. He’s struck. Stakar LAUGHS as he tells a story - STAKAR And I was like, Aleta, I love you, but you’re crazy now, you always been - Yondu approaches Stakar with trepidation. YONDU Stakar. Stakar is surprised to see him. YONDU (CONT’D) Been some time. I’d - STAKAR Seems like this establishment is the wrong kind of disreputable. The blue-coats turn and walk away. YONDU Stakar... Stakar glances at the PROPRIETOR as he passes her.  30  ©   Marvel",
      "characters": [],
      "action_text": "STAKAR There are a hundred Ravager factions, Sneeper. You just lost the business of ninety-nine by serving one. PROPRIETOR Please, sir! Sir! Yondu stands there for a moment, hurt, as they head out the door. But, little by little, his hurt turns to rage and he FOLLOWS.  EXT. IRON LOTUS - DAY  Yondu trots quickly toward Stakar and the others. YONDU You all can go to hell! I don’t care what you think of me! Stakar swirls toward him, furious. STAKAR Then why you following us for?! YONDU ‘Cause you’ll listen to what I got to say! STAKAR I don’t got to listen to nothing! You betrayed the code! Ravagers don’t deal in kids! YONDU I didn’t know what was going on - STAKAR You didn’t know ‘cause you didn’t want to know, ‘cause it made you rich! YONDU I demand a seat at the table! I wear the flames same as you! STAKAR You may dress like a Ravager but you won’t hear no Horns of Freedom when you die, boy, and the Colors of Ogord will not flash over your grave!   (MORE)  31  ©   Marvel You think I take some pleasure in exiling you, you’re wrong. You broke all our hearts. Stakar and the others storm away.   Martinex stays a moment, staring at Yondu, and then moves on too. Yondu is left alone, shaken as the WHITE SNOW FALLS GENTLY on his blue face. NEARBY, a MONSTROUS RAVAGER leans in toward Kraglin, Tullk, GEF THE RAVAGER, OBLO, and RETCH. As he eyes Yondu, he WHISPERS: MONSTROUS RAVAGER First Quill betrays us and Yondu just lets him go, scot-free. Now he’s getting all riled over nothing. We followed him ‘cause he was the one wasn’t afraid to do what needed to be done. Seems like he’s going soft. KRAGLIN If he’s so soft why you whispering for? MONSTROUS RAVAGER You know I’m right, Kraglin. TULLK You best watch what you say about the Cap’n, Tay - RETCH Who the hell is that?! Tullk stops when he sees High Priestess Ayesha approaching beside them. The Chambermaids ROLL OUT a LONG BLUE CLOTH so she doesn’t touch unconsecrated ground. She STOPS at the carpet’s end. Does her best to forc",
      "dialogue_count": 0,
      "word_count": 608
    },
    {
      "scene_number": 5,
      "slugline": "EXT. CAMPFIRE/CRASHED MILANO - NIGHT  Quill sits around a campfire with Ego, Mantis and the others, eating. Ego indulges heartily. EGO (CONT’D) I would have done so myself, but I was in the midst of an outlandish adventure at the time, battling demonic forces to save this dimension or some such nonsense - I can’t quite recall, it all bleeds together after awhile. But instead of returning you, Yondu kept you. I have no clue as to why. QUILL Because I was a skinny kid who could squeeze into places adults couldn’t, making thieving easier. EGO I’ve been trying to track you down ever since. DRAX I thought Yondu was your father. QUILL What? Drax stares at him. QUILL (CONT’D) We’ve been together all this time and you thought Yondu was my actual, blood relative? DRAX You look exactly alike. ROCKET One’s blue. QUILL He wasn’t my father. Yondu was the guy who abducted me.   He’d beat the crap out of me so I’d learn how to fight and he kept me in terror threatening to eat me. EGO Eat you?!  33  ©   Marvel",
      "characters": [],
      "action_text": "QUILL Yes. EGO That son-of-a-bitch. GAMORA How’d you locate us now? EGO Even where I reside, out past the edge of what’s known, we’ve heard tell of the man they call Star- Lord. He stands, handing his dish to Gamora. EGO (CONT’D) Say we head out that way now? Your associates are welcome, even that triangle-faced monkey there. Rocket, self-conscious, feels his nose. EGO (CONT’D) I promise you, it’s like no place you’ve ever seen. And there I can explain your very special heritage, and finally be the father I’ve always wanted to be. (almost teary) ‘Scuse me. I gotta take a whizz. Ego leaves.   Quill looks at Gamora. QUILL Not buying it. GAMORA Peter, we need to take a walk.  EXT. CAMPFIRE/CRASHED MILANO - NIGHT  Ego is WHISTLING “BRANDY” and PEEING into the bushes. Mantis looks at Drax. She GRINS, or at least her best attempt at grinning. It’s kind of creepy. MANTIS I am Mantis. DRAX What are you doing?  34  ©   Marvel MANTIS Smiling. I hear it is the thing to do to make people like you. DRAX Not if you do it like that. MANTIS Oh. I was raised alone on Ego’s planet. I do not understand the intricacies of social interaction. She points at Rocket. MANTIS (CONT’D) Can I pet your puppy? It is adorable. DRAX (mischievous) Yes... She goes to pet Rocket: startled, he SWIRLS and SNAPS at her. MANTIS AHH! She pulls back her hand. Drax LAUGHS, heartily. DRAX That’s called a practical joke! She GIGGLES. MANTIS I liked it very much! They both LAUGH together. Nebula shakes her head with disbelief.  EXT. BESIDE CRASHED MILANO - MOMENTS LATER  Quill and Gamora enter this private spot; the campfire flickers through the trees beyond them. QUILL Give me a break! After all this time, and he just expects to be my Dad all of the sudden! GAMORA I hear you.  35  ©   Marvel QUILL I mean, this could be a trap - the Kree purists, the Ravagers, now the Sovereign - they all want us dead. GAMORA I know, but - QUILL But what? GAMORA What was that story you told me about Zardu Hasselfrau? QUILL Who",
      "dialogue_count": 0,
      "word_count": 2539
    },
    {
      "scene_number": 6,
      "slugline": "EXT. CRASHED MILANO - CLEARING - NIGHT  The Ravagers have entirely encircled Rocket.   There’s no chance of escape.   Though upset, he mostly holds it in. YONDU Pretty easy to find you, since we put a tracer on your ship back during the War over Xandar. ROCKET You give me your word you won’t hurt Groot, and I’ll tell you where the batteries are. YONDU Lucky for you my word don’t mean squat. Otherwise I’d actually hand you over. MONSTROUS RAVAGER Otherwise you’d what?! Yondu scowls at the Monstrous Ravager. YONDU We’ll take the batteries. They’re worth a a quarter mil on the open market - MONSTROUS RAVAGER That priestess offered us a million! A quarter is only one third of that! YONDU A quarter ain’t one-th - OBLO A quarter is four times a million! We’re in the money! GEF THE RAVAGER No, idiot. A quarter is twenty- five. YONDU No - GEF THE RAVAGER We can’t even buy a pair of boots with twenty-five units!  46  ©   Marvel",
      "characters": [],
      "action_text": "YONDU The point is, we aren’t stupid enough to help kill the Guardians of the Galaxy. We’d have the whole Nova Corps on us. KRAGLIN (realizing) That ain’t right. I just gotta say it this one time, Cap’n. Everyone looks at Kraglin. KRAGLIN (CONT’D) No matter how many times Quill betrays you, you protect him, like none of the rest of us much matter. I’m the one what sticks up for you, me and Tullk. MONSTROUS RAVAGER Damn straight, lad. You’re right: he’s going soft. S’pose it’s time for a change in leadership! KRAGLIN Uh - The Monstrous Ravager points his weapon at Yondu. Others follow his lead. A handful of others, including Tullk and the Innocent Ravager, raise their weapons in their Captain’s defense, so that the whole circle are aiming at one another. Kraglin is confused. TULLK Put you damn guns down! Rocket is in the center of the potential crossfire. ROCKET Hold on! There’s got to be some sort of peaceful resolution here! Or even a violent resolution, where I’m standing over there. Yondu glares at the Monstrous Ravager.   His FIN LIGHTS UP and he starts to WHISTLE when - A GUNSHOT RINGS OUT; THE FIN IS BLOWN OFF THE TOP OF YONDU’S HEAD.   The arrow CLATTERS to the ground.  47  ©   Marvel Rocket watches as Yondu, confused, TOTTERS there for a moment, and then COLLAPSES -- REVEALING NEBULA behind him, clutching a smoking pistol. Rocket looks at her, dead-eyed: really? She SHOOTS HIM WITH A BLAST OF ELECTRICITY, knocking him unconscious. The Ravagers gape at Nebula. NEBULA Well, hello, boys. She takes a bite from a piece of yaro root she stole from the Milano. As she chews, she becomes disgusted. She spits it out. NEBULA (CONT’D) It’s not ripe.  EXT. RED PLANET - MOMENTS LATER  Ego’s ship ARRIVES at a bold red planet, twisting in front of an enormous yellow sun, so close it seems like the sun is about to devour it. “MY SWEET LORD” BY GEORGE HARRISON PLAYS. SUPER:   EGO’S PLANET G52 22C848T12F+E16UC22  INT. EGO’S SHIP - SLEEP CHAMBER - OUTER SPACE  Mantis sets her h",
      "dialogue_count": 0,
      "word_count": 3042
    },
    {
      "scene_number": 7,
      "slugline": "EXT. PALACE - DAY  Drax and Mantis sit here, soaking in the sun and gazing at the lush, flowing hills, like something an alien Maxfield Parrish would paint. DRAX How did you get here? MANTIS Ego found me in my larva state, orphaned on my homeworld. He raised me by hand, and kept me as his own. DRAX So you’re a pet? MANTIS I suppose. DRAX People usually want cute pets. Why would Ego want a hideous one? MANTIS I am hideous? DRAX You’re horrifying to look at, yes. Mantis seems sad about this.   Drax notice this, feels bad. DRAX (CONT’D) But it is a good thing. MANTIS Oh? DRAX When you are ugly and someone loves you, you know they love you for who you are.   Beautiful people never know who to trust. MANTIS Well, then I am certainly grateful to be ugly! (thinking) Poor Gamora. She can never trust anyone. Drax nods and stares out at spattered patches of water.  61  ©   Marvel",
      "characters": [],
      "action_text": "DRAX Those pools remind me of a time I took my daughter to visit the Forgotten Lakes on my homeworld. She was like you. MANTIS Disgusting? DRAX Innocent. Drax stares out at them without expression. Slowly, Mantis TOUCHES his shoulder. And, as she does, TEARS INSTANTLY FLOW DOWN HER CHEEKS. She stares with Drax at the hills.   They feel the sadness together: she cries while he’s stoic. MANTIS I have never met anyone like you, or your friends. You are filled with such... love.   It is a thing I did not know existed, not like this, and I think... I think it may be the very finest of all things. It both hurts and soothes the heart. She looks at Drax. There is something she wants to say, but she is torn. MANTIS (CONT’D) Drax, there is something I must tell - GAMORA (O.S.) What’s going on? Drax and Mantis turn to see her behind them. She smiles. MANTIS I am learning many things. Like I am a pet and ugly. GAMORA You’re not ugly. (admonishing) Drax. Drax, confused, points at Mantis, as if her ugliness proves itself.  62  ©   Marvel GAMORA (CONT’D) Mantis, can you show us where we’ll be staying? I’m getting eye-strain in this place. Mantis nods, yes.  EXT. PATH TO SLEEPING QUARTERS - MOMENTS LATER  Gamora, Drax, and Mantis walk across the sunset. GAMORA Why are there no other beings on this planet? MANTIS The planet IS Ego. A dog would not invite a flea to live on his back. GAMORA And you’re not a flea? MANTIS I’m a flea with a purpose. I help him sleep. Gamora curls around Mantis, cutting her off. GAMORA What were you about to say to Drax before I walked out? Mantis looks around, worried. MANTIS Nothing. Gamora and Drax share a look: why is she so scared? Mantis moves on. MANTIS (CONT’D) Your quarters are this way.  INT. ECLECTOR CELL - OUTER SPACE  Rocket HITS THE GROUND, hard.   Yondu LANDS equally hard on the ground beside him. They look up to see Taserface, Gef the Ravager and an OBTUSE RAVAGER locking the cell door.  63  ©   Marvel TASERFACE We’ll deliver you to the Kr",
      "dialogue_count": 0,
      "word_count": 895
    },
    {
      "scene_number": 8,
      "slugline": "INT. BAR/QUADRANT FLIGHT DECK - OUTER SPACE  Baby Groot is wearing a tiny Ravager uniform. He reacts to clothes like a cat, struggling to take them off but unable. Ravagers are gathered around him, drunk and LAUGHING. They are CHANTING “MASCOT.” RETCH Lil’ feller’s all worked up! Needs a drank! Retch POURS ALCOHOL on him. The Ravagers LAUGH MORE as others POUR DRINKS on him as well. Groot SCREAMS at them, furious but helpless. RETCH (CONT’D) Lookit how cute it is when it’s all riled up! HALF-NUT It’s Goddang precious!  INT. ECLECTOR CELL - LATER  Groot, in shadows, MOPES down the hallway, looking traumatized. His clothes are torn and he’s soaked in alcohol. As he passes the cell, he hears - YONDU (O.S.) Hey, twig. C’mere. Groot sees Yondu and Rocket looking at him in the cell. He steps toward them. ROCKET Oh, man. What’d they do to you? YONDU Hey, you wanna help us get outta here? Groot NODS.   Rocket looks unsure. Yondu speaks slowly. YONDU (CONT’D) There’s something I need you to get, and bring back to me. Groot NODS. YONDU (CONT’D) In the Cap’n’s quarters, there’s a prototype fin, like the thing I wore on my head.  66  ©   Marvel",
      "characters": [],
      "action_text": "Groot NODS. YONDU (CONT’D) There’s a drawer next to the bunk. It’s inside that.   It’s red.   You got it? Groot NODS EMPHATICALLY and DARTS OFF to get it.   Yondu looks at Rocket, pleased. Rocket looks more than a bit uncertain.  INT. CAPTAIN’S QUARTERS - MOMENTS LATER  Baby Groot CREEPS into this dark room.   DRUNKEN RAVAGERS are sprawled everywhere. He spots a bureau.   A drawer is half open. His face lights up.  MOMENTS LATER  Baby Groot stands outside of the cell, beaming, holding A PAIR OF SHORTS. YONDU That’s my underwears. ROCKET Yeah, I was pretty sure he didn’t know what you were talking about. You have to explain it more careful. YONDU All right. It’s a prototype fin -  MOMENTS LATER  Groot is back in front of the cell, holding a wriggling ORLONI in his hands. ROCKET That’s an orloni. It’s a fin, Groot. YONDU You explain it this time. Rocket starts to speak -  67  ©   Marvel MOMENTS LATER  Groot looks hopeful, holding out a CYBERNETIC EYE. YONDU That’s Vorker’s eye. He takes it out when he sleeps.   Go look again. Groot starts to SLINK OFF - ROCKET But leave the eye here. YONDU Why? Rocket CAN HARDLY SPEAK he finds it so funny. ROCKET He’s gonna wake up tomorrow and he’s not gonna know where his eye is!  MOMENTS LATER  Groot is DRAGGING a LARGE PIECE OF FURNITURE to the cell. ROCKET That’s a desk. We told you it was this big. Rocket shows him how small it is with his hands. Groot makes a face like “Oh!” as if NOW he gets it. It’s all coming together.  MOMENTS LATER  Groot is holding a SEVERED TOE. ROCKET Tell me you guys have a refrigerator somewhere with a bunch of severed human toes. Yondu SUBTLY SHAKES HIS HEAD. ROCKET (CONT’D) Okay, then let’s just agree to never discuss this. Yondu RIPS the Ravager patch off his jacket.  68  ©   Marvel YONDU The drawer you want to open. Has this symbol on it, okay? Groot takes it. He looks at Yondu and NODS. And then, slowly, HE PLACES IT ON TOP OF HIS HEAD. YONDU (CONT’D) What? No. ROCKET He thinks you want him to we",
      "dialogue_count": 0,
      "word_count": 2233
    },
    {
      "scene_number": 9,
      "slugline": "EXT. DESERT - DAY  The Quadrant POPS into a blue sky above a DESERT with two fighting KRONANS.  INT. QUADRANT FLIGHT DECK - VARIOUS OUTER SPACE LOCATIONS  Inside the ship, Rocket, Yondu, Kraglin, and baby Groot hold on for dear life as the ship VIOLENTLY SHAKES and THE LOCATIONS OUTSIDE OF THE WINDOW RAPIDLY SHIFT. Their bodies DISTEND SLIGHTLY. Yondu is furious. YONDU It ain’t healthy for a mammalian body to hop over fifty jumps at a time. ROCKET I know that. YONDU We’re about to do seven-hundred. Rocket looks bummed.  EXT. PINK SKY - AMOEBA BLOBS - OUTER SPACE  The Quadrant pops out of a jump point into this Pepto Bismol pink land, SMASHING THROUGH an AMOEBA-LIKE BLOB, and then through the next jump point.  INT. QUADRANT FLIGHT DECK - VARIOUS OUTER SPACE LOCATIONS  Kraglin, Yondu, Rocket, and Baby Groot all SCREAM, their entire faces and bodies distorting as if in some evil funhouse mirror.  EXT. RED PLANET LANDSCAPE - VARIOUS  The yellow sun CURVES SLOWLY WEST TO EAST over this magnificent landscape. “BRING IT ON HOME TO ME” BY SAM COOKE PLAYS.  EXT. SLEEPING QUARTERS - VERANDA - DAY  TILT DOWN to Quill, on this veranda, gazing out at the beauty.   The Walkman is connected to small, jerry-rigged speakers nearby, PLAYING SAM COOKE. QUILL So I guess this could all be mine someday.  77  ©   Marvel",
      "characters": [],
      "action_text": "Gamora isn’t paying attention. She’s fooling with a communications device, which has no reception. GAMORA Rocket? Rocket, you there?   Dammit. Quill comes up behind her, messing with her. GAMORA (CONT’D) What are you doing, Peter? QUILL Dance with me. GAMORA No. I’m not -- QUILL Come on. This is Sam Cooke, one of the greatest Earth singers of all time. Gamora lets out an exasperated SIGH, but, reluctantly, starts DANCING with him. She is incredibly light on her feet. Quill smiles and Gamora, despite herself, does as well.   He TWIRLS HER AND BRINGS HER BACK IN. This is definitely not the first time they’ve done this. QUILL (CONT’D) Drax thinks you’re not a dancer. GAMORA If you ever tell anyone about this, I’ll kill you. They look at each other. QUILL When are we going to do something about this... unspoken thing between us? GAMORA What unspoken thing? QUILL This Cheers-Sam-and-Diane-guy-and- girl-on-a-TV-show-who-dig-each- other-but-never-say-it-’cause-when- they-do-the-ratings-would-go-down sort of thing?  78  ©   Marvel GAMORA There is no unspoken thing between us. QUILL Well, that’s a Catch-22. Because if you said there was, it would be spoken, and then you’d be a liar. So by saying there isn’t, you’re telling the truth, and admitting there is. GAMORA That’s not -- Gamora PULLS AWAY. GAMORA (CONT’D) What we should be discussing right now is that something about this place doesn’t feel right. QUILL What are you talking about? You were the one who wanted me to come here! Gamora moves into --  INT. SLEEPING QUARTERS - DAY  GAMORA That girl, Mantis. She’s afraid of something. Quill follows her.   He stops, staring at her, hurt and frustrated. QUILL Why are you trying to take this from me? GAMORA I’m not -- QUILL He’s my father. He’s blood - GAMORA You have blood on earth. You never wanted to return there.  79  ©   Marvel QUILL Again - you made me come here! And Earth?! Earth is the place my mother died in front of me. GAMORA No, it’s because that’s real, and this is",
      "dialogue_count": 0,
      "word_count": 2326
    },
    {
      "scene_number": 10,
      "slugline": "INT. TWISTING CAVERNS - NIGHT  Gamora and Nebula move further down the cavern, stepping into light, getting closer. EGO And that is when I came to a profound realization.  INT. PALACE - NIGHT  EGO My innate desire to seek out other life was not so that I could walk among that life. Ego looks at his son, moved by the memories. EGO (CONT’D) Peter, I had found meaning. Quill is taken aback. But Ego sets his finger lightly on his forehead, and the white light bursts through his son’s body. We see THE COSMOS IN QUILL’S EYES. He looks ecstatic, far beyond where he stands, and seems to finally understand. QUILL I see it. Eternity.  INT. TWISTING CAVERNS - NIGHT  Gamora and Nebula stop, in horror. GAMORA Oh my God. They are staring at piles and piles of skeletons of various species, thousands of them, seeming to go on forever. NEBULA We need to get off this planet.  EXT. GALAXY/UNIVERSE - OUTER SPACE  We see traces of the UNIVERSAL NEURAL TELEPORTATION NETWORK, the Quadrant a blinking light POPPING IN and OUT on a trail across the cosmos - And then ZOOM BACK FURTHER TO THE UNIVERSE, the same blinking light making its way while ROCKET, YONDU, and KRAGLIN SCREAM.  89  ©   Marvel",
      "characters": [],
      "action_text": "EXT. ASTEROIDS - OUTER SPACE  WATCHERS swirl to the Quadrant SWISH past them and JUMPS OUT. They turn back to STAN LEE, in a spacesuit with a fishbowl helmet. STAN LEE Anyway, before I was so rudely interrupted, that time I was a World War II vet -  EXT. RED PLANET - OUTER SPACE  THE QUADRANT POPS INTO SPACE, EGO’S PLANET nearby.  INT. QUADRANT FLIGHT DECK - OUTER SPACE  Yondu, Kraglin, Rocket and Groot FALL OUT OF THEIR SEATS, RETCHING, clutching their stomachs. YONDU What the hell you doing, boy?! ROCKET I could tell by how you talked about him - this Ego is bad news. We’re here to save Quill. YONDU For what? (derisively) For ‘honor’? For ‘love’? ROCKET No! I don’t care about those things! I want to save Quill so I can prove I’m better than him! I can lord this over him forever! Yondu LAUGHS bitterly as he pulls himself up to the controls. Rocket yanks himself up beside him. ROCKET (CONT’D) What are you laughing at me for?! YONDU You can fool yourself and everyone else but you can’t fool me. I know who you are. ROCKET You don’t know anything about me, loser.  90  ©   Marvel YONDU I know everything about you. I know you play like the meanest and the hardest ‘cause you actually the most scared of all. ROCKET Shut up. YONDU I know you steal batteries you don’t need and you push away anyone who’s willing to put up with you, ‘cause just a little bit of love reminds you how big and empty that hole inside you actually is! ROCKET I said, shut up. YONDU I know the scientists what made you never gave a rat’s ass about you - ROCKET I’m serious, dude - ! YONDU Just like my own damn parents, who sold me, their own little baby, into slavery! I know who you are, boy, because you’re me. They stare at each other there, a mirror. ROCKET What kind of pair are we? YONDU The kind that’s about to go fight a planet I reckon. ROCKET All right, okay, that’s - Wait. Fight a what?  INT. DRAX’S SLEEPING QUARTERS - NIGHT  Gamora, furious, BURSTS into the room.   She sees Mantis standing with ",
      "dialogue_count": 0,
      "word_count": 2943
    },
    {
      "scene_number": 11,
      "slugline": "INT. SOVEREIGN PILOT BAY - DAY  AYESHA Dive! OVERHEAD SHOT: On the screens in all the pods, the envoys DIVE toward the planet from slightly different directions.  I/E. QUADRANT FLIGHT DECK - OUTER SPACE  Kraglin, in shock, watches the massive fleet of envoys diving downward. He grabs the comm. KRAGLIN Uhh... Cap’n? No answer. KRAGLIN (CONT’D) Cap’n?  INT. LASER DRILL/CRACK IN THE PLANET - SUNRISE  Yondu doesn’t hear the CRACKLING SPEAKER beside him as they maneuver down through the fissure. Quill eyes him. YONDU So why’d Ego want you here? QUILL He needs my genetic connection to the light to help destroy the universe. He tried to teach me how to control the power. YONDU So could you? QUILL A little. I made a ball. YONDU A ball? QUILL I thought as hard as a could, that’s all I could come up with. YONDU You ‘thought’? Quill nods.  105  ©   Marvel",
      "characters": [],
      "action_text": "YONDU (CONT’D) You think when I make this arrow fly I use my head? QUILL What do you use? They look at each other instead of where they’re going, and the CRASH into an overhanging piece of rock. The entire side door is RIPPED OFF. As the SCREECH through a smaller space and into --  INT. PLANET’S HOLLOW/LASER DRILL - DAY  The Laser Drill DROPS into this enormous open space within the planet. The Guardians gather on the side of the ship open to the hollow, gazing out at its stunning beauty, lit by Ego’s white glow running throughout it. GAMORA Whoa. Mantis turns, looking through the portholes on the other side. MANTIS There! Thats Ego’s core. Mantis points at the Self Chamber, down below them.   They twist down towards it. GAMORA That ore’s thick. Rocket, we’re gonna need to use the big laser. Rocket nods, FLICKS switches. All the small lasers on the sides move through grooves to combine into one huge laser in the center of the ship: the MEGA-LASER. MANTIS We must hurry. It will not take Ego long to find us. ROCKET Keep it still!  106  ©   Marvel Quill steadies the craft as best he can beside the Self Chamber.   But it’s an unwieldy beast, built for power, not precision. Rocket powers up the mega-laser and holds tight to the SHUDDERING CONTROLS as it DRILLS, BURNING a HOLE into the protective sheathe. It melts and drips down. QUILL We drill into the center, we kill him. Quill holds tight to the steering wheel. Yondu notices the BLINKING LIGHT on the comm. He taps it. YONDU What is it, Kraglin? KRAGLIN (O.S.) Um, remember that Ayesha chick? YONDU Yeah, why? Yondu looks out the window where AYESHA’S SQUADRON is SWOOPING OUT OF the cracks in the ceiling all around them. YONDU (CONT’D) Aw, hell. Quill PULLS AWAY from the envoys. But the Sovereign envoys start BLASTING AT THE CRAFT all at once; the LASER LOSES POWER and the VEHICLE TURNS SIDEWAYS - Drax, Mantis, and Gamora GO TUMBLING from the hole in the side. Nebula and Groot grab onto the floor.  INT. BELOW SELF CHAMBER",
      "dialogue_count": 0,
      "word_count": 767
    },
    {
      "scene_number": 12,
      "slugline": "INT. BELOW SELF CHAMBER - DAY  Mantis is worried about something else entirely; the entire chasm begins TREMBLING and the walls start to MUTATE. MANTIS He’s coming. DRAX Didn’t you say you could make him sleep? MANTIS When he wants! He’s too powerful! I can’t! DRAX You don’t have to believe in yourself because I believe in you. They look ahead. They see, on the enormous wall in front of them, the LIGHT-FORM of a giant EGO SCREAMING ANGRILY. His SCREAM becomes a TUNNEL OF ROCKS RUSHING TOWARDS THEM like a train. Mantis sees a nerve bundle on the ground coming from Ego’s Core. Although afraid, she grabs it. MANTIS SLEEP! She SCREAMS with effort and some pain as energy travels through the bundle and into the core, where it darkens. The LIGHT LEAVES THE ROCK FORMATION and it SLAMS into the ground in front of them, SPLASHING DIRT OVER THEM. But they are safe, shivering. Drax and Gamora look at each other. DRAX I never thought she’d be able to do it. With as skinny and weak as she appears to be. Mantis’s arm is TREMBLING. MANTIS I don’t know how long I can hold him!  109  ©   Marvel",
      "characters": [],
      "action_text": "GAMORA You need to, girl. If you don’t keep Ego at bay, we all die.  INT. OPENING OF BLAST HOLE - DAY  Rocket shines a powerful PEN-LIGHT inside the cavity, exposing the interior, spattered with Swiss-cheese-like holes glowing with light. ROCKET The metal is too thick! For the bomb to work we’d actually need to place it on Ego’s core.   And our fat butts ain’t gonna fit through those tiny holes. QUILL Well... Quill slowly eyes Groot, who is playing with a leaf on his arm and thinking about something else entirely. ROCKET That’s a terrible idea. QUILL Which is the only kind of idea we got left. Rocket SIGHS. He puts Groot on his back and MOVES with Groot deeper into the blast hole, mumbling to himself: ROCKET Unbelievable. ‘Rocket, do this. Rocket, do that.’ Quill turns toward the opening. PUSH UP AND IN ON QUILL. QUILL Uh, what a day. He jumps out into the fray.  INT. PLANET’S HOLLOW - DAY  Quill FLIES UP as a ship FLIES in toward him BLASTING, and he’s about to fire back.   MAN VS. SPACESHIP. This is most likely the beginning of the biggest, baddest fight scene ever, but instead we CUT TO -  110  ©   Marvel",
      "dialogue_count": 0,
      "word_count": 406
    },
    {
      "scene_number": 13,
      "slugline": "INT. INSIDE BLAST HOLE - DAY  Quiet. Blasts in the deep background. Rocket places a tiny bomb in front of Groot.   It is a small, simple device with two switches and two buttons.   He explains, very carefully: ROCKET All right. First you flick this switch, then this switch. That activates it.   And then you push this button, which will give you five minutes to get out of there. Whatever you do don’t push this button, because that will set off the bomb immediately, and we’ll all be dead. Now repeat back what I just said. GROOT I am Groot. ROCKET Uh huh. GROOT I am Groot. ROCKET That’s right. GROOT I am Groot. ROCKET No! That’s the button that will kill everyone! Try again. Groot thinks. GROOT I am Groot. Rocket nods. GROOT (CONT’D) I am Groot. Rocket nods. GROOT (CONT’D) I am Groot.  111  ©   Marvel",
      "characters": [],
      "action_text": "ROCKET No! That’s exactly what you just said! How is that even possible?! Which button is the button you’re supposed to push?! Point to it. Groot thinks. And he points to the one that will kill everyone. ROCKET (CONT’D) NO!!! QUILL (O.S.) Hey, you’re making him nervous! Rocket runs to see, at the end of the hole, a sliver of the outside as Quill peeks in while SHOOTING at envoys. ROCKET Shut up! And give me some tape! Does anyone have any tape out there!? I want to put some tape over the death button! QUILL I don’t have any tape.   Let me check. Quill disappears from the hole.   As Rocket waits, he hears, amongst the chaos, faintly - QUILL (O.S.) (CONT’D) Yo, Yondu, do you have any - ow! - do you have any tape?! O.S. GUN BLASTS. We hear VOICES GRUMBLING. Rocket and Groot look around, waiting. Rocket is impatient. He coughs. Groot is like a bored kid in a waiting room.   He shifts around and plays with the wires on the bomb. Quill reappears outside the hole, SHOOTING an envoy. QUILL (CONT’D) No one has any tape. ROCKET Not a single person has tape?  112  ©   Marvel QUILL You have priceless batteries and an atomic bomb in your bag! If anyone had tape it would be you! ROCKET That’s exactly my point! I have to do everything! QUILL Dude, you’re wasting time! Rocket turns back to Groot, who has already taken the bomb and is heading towards the hole. He makes a “WHEEEEEE” sound and smiles brightly as he HOPS into the hole and SLIDES down as if on a water slide. Rocket, heavy-lidded, watches him go. ROCKET We’re all gonna die.  INT. PLANET'S HOLLOW/LASER DRILL - DAY  Yondu and Nebula, in the cockpit, are being overcome as blasts come through the walls. YONDU We’re done for without the generator. Nebula MOANS, frustrated. She flips open a section of the dashboard, then a part of her arm.  INT. PLANET'S HOLLOW/LASER DRILL - DAY  The remaining Sovereign envoys have ENCIRCLED the battered Laser Drill, BLASTING IT TO BITS. Quill FLIES into the Laser Drill, SLAMMING into the wall",
      "dialogue_count": 0,
      "word_count": 762
    },
    {
      "scene_number": 14,
      "slugline": "INT. PLANET'S HOLLOW/LASER DRILL - DAY  Quill sees FLAMING CHUNKS FLY into the rig... And FIRE SPILLING toward the ship’s engine, dripping fuel. QUILL We’re gonna blow! Yondu WHISTLES as the FLAMES HIT THE FUEL -  INT. BELOW SELF CHAMBER - DAY  Gamora watches as the ENTIRE LASER DRILL EXPLODES.   She is stricken. GAMORA Peter? She sees a tiny body flying from the ship - it’s Nebula, who LANDS across from her on her feet. Gamora looks at her, worried.   Nebula gives her what might be a little smile, and looks upward. Gamora follows her line of sight. Quill is FLYING FROM THE EXPLOSION on his aero-rig. Yondu is holding onto a flying arrow: his one arm up straight, his heels touching. Quill looks at him and SNICKERS. YONDU What? QUILL You look like Mary Poppins. YONDU Is he cool? Quill looks at the man who raised him. He smiles. QUILL Yeah. He’s cool. Yondu looks out at the Guardians as he comes in for a landing. YONDU I’m Mary Poppins, y’all! Quill and Yondu LAND beside Nebula. Gamora sees Quill and MARCHES TOWARD HIM.  115  ©   Marvel",
      "characters": [],
      "action_text": "The CAMERA CIRCLES GAMORA AND QUILL, FIERY SHIP FRAGMENTS RAINING DOWN AROUND THEM IN SLOW-MOTION, as if this is the greatest heavy metal video of all time. The other Guardians enter, one by one - Nebula, Drax, Yondu, Rocket FLYING DOWN on his aero-rig, and finally, Mantis, staring forward with concentration until -- A HUGE CHUNK OF SPACESHIP FLIES IN FROM THE SIDE, FLATTENING MANTIS. The others all look down at her in shock. QUILL Oh. Wow. Mantis, UNCONSCIOUS BENEATH a ship fragment, has lost hold of Ego. THE ENTIRE HOLLOW AROUND THEM BEGINS TO RUMBLE.   THE GROUND AND WALLS THEMSELVES SHIFT and WAVER. The whole cavity is alive. Drax checks on Mantis. DRAX She’s just unconscious.  INT. SELF CHAMBER TUNNELS - DAY  Groot RUNS and HOPS through the tunnels. He comes to a crossroads. He sees a COSMIC LIGHT emanating from one tunnel.   He dashes off toward it.  INT. BELOW SELF CHAMBER - DAY  QUILL How long before the bomb goes off? ROCKET In the unlikely event Groot doesn’t kill us all, about six minutes. Yondu speaks into the comm on his lapel. YONDU Kraglin.  INT. QUADRANT FLIGHT DECK - DAY  Kraglin, NODDING OUT, abruptly wakes. YONDU (O.S.) We need the Quadrant for extraction in T-minus five minutes.  116  ©   Marvel KRAGLIN Aye, Cap’n!  EXT. BELOW SELF CHAMBER - DAY  Our heroes peer up to see the SURFACE OF THE PLANET UNFOLDING ABOVE THEM, so that THE BRIGHT SKY SHINES THROUGH. QUILL Someone needs to be up top when Kraglin arrives. Drax, take Mantis. Drax nods. He picks up Mantis.   Quill grabs the aero-rig off himself and SLAPS it on Drax’s back, which AUTOMATICALLY WRAPS around his upper body. DRAX Ahhh! My nipples! He FLIES UPWARD. The ground around them SPLITS INTO ENORMOUS CRACKS. Gamora sees a CRACK IN THE EARTH RUSHING TOWARD her and Quill, and she turns toward him. And Gamora’s side CRUMBLES AWAY, GAMORA FALLING DOWN with it. QUILL Gamora!! HUGE BURSTS OF EARTH SHOOT UP all around Drax, Yondu, Rocket, and Quill. The planet has formed GIANT TENTACLES THAT HURT",
      "dialogue_count": 0,
      "word_count": 615
    },
    {
      "scene_number": 15,
      "slugline": "EXT. BELOW SELF CHAMBER - DAY  Quill BLASTS a tentacle. Yondu WHISTLES, the ARROW WEAVING THROUGH TENTACLES around them. Rocket TOSSES a bunch of tiny bombs at some, which they stick to and EXPLODE. But they are by no means winning this fight.  EXT. PLANET SURFACE - DAY  The giant Quadrant LOWERS toward the surface.  EXT. LOWER RIFT - DAY  Gamora looks at Nebula. GAMORA We have to get up to the extraction point! They look over the edge and see a huge RIFT OF LAND RISING QUICKLY.   They look at each other and JUMP - They GRAB ONTO THE EDGE of the rising rift, CLUTCHING TO IT as it FLIES upward toward the open space above them.  EXT. PLANET SURFACE - DAY  Drax FLIES UP onto the surface; he sees the Quadrant waiting for him there.   He DARTS for the ship.  INT. QUADRANT FLIGHT DECK - DAY  Kraglin opens the LOADING DOOR  EXT. PLANET SURFACE - DAY  But huge swatches of the planet reach up and GRAB onto the Quadrant, YANKING IT DOWN.  INT. QUADRANT FLIGHT DECK - DAY  Kraglin, freaking out, throws the thrusters into high gear.  I/E. PLANET SURFACE/QUADRANT LOADING BAY - DAY  The thrusters FLARE as the massive ship STRUGGLES to free itself from Ego’s tendrils.  118  ©   Marvel",
      "characters": [],
      "action_text": "And it does PULL ITSELF UP for a moment, but the tendrils tighten, SLAMMING it back down. The whole Quadrant starts to TIP OVER. Kraglin falls down against the side of the ship. Drax sees the ship FALLING TOWARDS HIM and he RUNS away from it in fear. But he arrives a the edge of a cliff.   He crouches as the ship CONTINUES DOWN toward him, about to SQUASH both he and Mantis -- But Kraglin heroically CRAWLS his way back up to the controls as he dangles from them.   He pushes on the thrusters, so that the ship goes back upright. Drax turns and again RUNS toward the Quadrant.  EXT. PLANET’S HOLLOW - DAY  Gamora and Nebula are still rising on the rift when they SLAM into a wall near the opening in the surface of the planet.  EXT. BELOW SELF CHAMBER - DAY  Quill turns and sees Ego, in his terrifying SKELETAL LIGHT FORM, STROLLING DOWN TOWARDS HIM as the land around him PARTS LIKE THE RED SEA. As Ego walks, THE DIRT AND MOLECULES AROUND EGO FORM ORGANS IN HIS BODY, piecing himself back together. Quill sees a tentacle SLAM Yondu to the ground and COVER HIS ENTIRE BODY. He turns to see Rocket HOLLERING as he FIRES at tentacles, but they OVERWHELM him.  EXT. PLANET SURFACE - DAY  The earth WRAPS AROUND Drax’s legs like quicksand, pulling him and Mantis down into it.  EXT. PLANET’S HOLLOW - DAY  Gamora and Nebula scramble, trying to CLIMB BACK UP, when TENDRILS WRAP AROUND THEM, stopping them from going further.  INT. SELF CHAMBER TUNNELS - DAY  The walls are tightening around Groot. He grows his branches to try to stop them, but they aren’t working.  119  ©   Marvel He begins to CRY, like an actual baby, terrified, on the brink of suffocating.  EXT. BELOW SELF CHAMBER - DAY  Ego approaches his son. He is fully formed, and he is more truly “himself.” Alien. Dark eyes and pale skin. EGO I told you I don’t want to do this alone.  EXT. BELOW SELF CHAMBER - DAY  EGO You cannot deny the purpose the universe has bestowed upon you! And once again, the LIGHT TENDRILS STAB THROUGH QUI",
      "dialogue_count": 0,
      "word_count": 1401
    },
    {
      "scene_number": 16,
      "slugline": "INT. SELF CHAMBER TUNNELS - DAY  The tunnel around Groot SNAPS BACK to what it was. Once more he can see the light at the tunnel’s end, and one looks like a GIANT BRAIN composed of prismatic light. He RUNS forward.  INT. INSIDE BLAST HOLE - DAY  Rocket flies up and yells at Groot. ROCKET Groot! Groot, if you can can hear me, hurry up - I’m not sure how long Quill can keep him distracted!  INT. SELF CHAMBER CORE - DAY  Groot ARRIVES at the end of the tunnel, and stops there. The center of the core holds a huge cosmic placenta, and, within that, EGO’S TRUE SELF, the COSMIC BRAIN.   It ROILS FURIOUSLY, the reflection of its fight with Quill, thrashing around within this womb. Although afraid, Groot places the bomb on the placenta. Groot stares at both buttons, scared - he doesn’t know which one to pick. Groot makes a decision on which button to press. He goes to push the death button. Then his finger STOPS just millimeters from the button, TREMBLING.   He thinks... And then changes the course of his finger, PUSHING THE CORRECT BUTTON. THE COUNTDOWN CLOCK COMMENCES. Baby Groot turns, terrified, and RUNS.  I/E. PLANET SURFACE/QUADRANT LOADING BAY - DAY  Drax moves with Mantis into the loading bay.   He throws her down and climbs up a ladder. THE CAMERA SWINGS TO GAMORA AND NEBULA, climbing up to the surface in the dirt storm.  124  ©   Marvel",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 244
    },
    {
      "scene_number": 17,
      "slugline": "INT. PLANETS HOLLOW - DAY  Ego RISES on his own MOLECULAR TORNADO and STRIKES BACK at Quill.   He YELLS as he SLAMS Quill against the wall, DRAGGING his face along the wall. He TOSSES Quill into a another wall.  EXT. BELOW SELF CHAMBER/PLANET’S HOLLOW - DAY  QUILL brings his ARM FILLED WITH LIGHT away from the wall, so that he causes a WAVE OF LIGHT AND ROCK around the interior of the hollow, FLYING TO EGO and knocking him aside. Yondu protects his face as DIRT SWIRLS in the wake of the Quill/Ego battle. Rocket, carrying Groot, FLIES BACK DOWN beside him. ROCKET Yondu! We’re about to blow! YONDU Get to the ship. ROCKET Not without Quill. YONDU You gotta take care of the twig. ROCKET Not without you. YONDU I ain’t done nothing right my whole damn life, rat. You need to give me this. Rocket, hesitantly, nods.   He grabs some things from his bag. He hands them to Yondu. ROCKET A space suit and an aero rig. I only have one of each. Yondu nods. Rocket nods too. Rocket starts to go, but STOPS and looks at Yondu. He wants to say something, but he doesn’t know what. Baby Groot does.  125  ©   Marvel",
      "characters": [],
      "action_text": "GROOT I am Groot. YONDU What’s that? ROCKET He says welcome to the frickin’ Guardians of the Galaxy... only he didn’t use ‘frickin’. YONDU Bye, twig. Groot waves. And Rocket FLIES UP toward the surface. Rocket mutters to Groot. ROCKET We’re gonna need to have a discussion about your language.  EXT. BELOW SELF CHAMBER/PLANET’S HOLLOW - DAY  Ego SLAMS Quill back against a wall. Ego pulls the huge rocks away from the wall, FLYING THEM TOWARDS HIM and BATTERING HIM THERE. Ego and Quill FLY TOWARDS each other. Ego uses the LIGHT TO BRING ROCKS TO HIS BODY, forming a giant AVATAR OF HIMSELF. Quill brings YELLOW ROCKS to his body, forming a GIANT PAC- MAN. Ego’s form flies into Pac-Man’s mouth, so hard there’s a SONIC BOOM. They fall, TUMBLING, still striking one another on the way down. They LAND HARD.  INT. SELF CHAMBER CORE - DAY  The timer counts down.   A minute left.  I/E. PLANET SURFACE/QUADRANT LOADING BAY - DAY  Gamora and Nebula are caring for Mantis as Rocket and Groot ARRIVE.  126  ©   Marvel GAMORA Where’s Peter? Rocket doesn’t answer. Or he can’t answer. GAMORA (CONT’D) Rocket, where is he?! Rocket looks down at a timer in his hand. The time is almost there. GAMORA (CONT’D) Rocket?! Rocket, look at me! Where is he?! Rocket just shakes his head a little. But Groot points sadly outside. GAMORA (CONT’D) I’m not leaving without him. Gamora hardens. She stands and SNATCHES A RIFLE off the wall. She COCKS IT. She STARTS OUT the bay door -- When AN ELECTRICAL BLAST HITS HER from behind. She FALLS OVER, unconscious, REVEALING Rocket with his gun. ROCKET I’m sorry. I can only afford to lose one friend today. (into comm) Kraglin, GO!  INT. QUADRANT FLIGHT DECK - DAY  Drax looks uncertain as Kraglin presses thrust. DRAX Wait. Is Quill back? (into comm) Rocket, where’s Quill?!  I/E. PLANET SURFACE/QUADRANT LOADING BAY - DAY  Rocket looks sadly out the bay door as it CLOSES; Drax’s voice echoes on his comm. DRAX (O.S.) Where’s Quill?!   WHERE’S QUILL?! 251   251  127  ©  ",
      "dialogue_count": 0,
      "word_count": 554
    },
    {
      "scene_number": 18,
      "slugline": "EXT. BELOW SELF CHAMBER - DAY  Quill and Ego are exhausted, on their knees and leaning against one another like boxers after too many rounds.  INT. SELF CHAMBER CORE - DAY  The timer reads 00:26 seconds  EXT. BELOW SELF CHAMBER - DAY  Ego reaches for the core.. EGO No, we need to stop it! Quill throws him to the ground. But Ego comes back up, grasping his son’s jacket, pleading with him now. EGO (CONT’D) Listen to me! You are a god! If you kill me, you’ll just be like everyone else! QUILL What’s so wrong with that? Ego looks at his son, scared. EGO NO -  INT. SELF CHAMBER CORE - DAY  The countdown reaches zero.   The brain EXPLODES.  I/E. EGO’S NERVOUS SYSTEM - DAY  The explosion causes the life forces to BURST THROUGH THE ENTIRE PLANET.  EXT. BELOW SELF CHAMBER - DAY  Everything around Quill is EXPLODING. He looks down at his hands, where the glow FADES and DISAPPEARS. He gazes up at the mammoth walls around him as they BLOW UP and COLLAPSE. He lowers at head, at peace with the death that’s coming, when, from the side, through the debris --  128  ©   Marvel",
      "characters": [],
      "action_text": "YONDU IS FLYING TOWARDS HIM ON AN AERO-RIG. Yondu GRABS him, almost a tackle, really, LIFTING HIM up and FLYING AWAY.  EXT. PLANET'S HOLLOW - DAY  As Yondu and Quill FLY UPWARD, the planet EXPLODES behind them, flames licking their heels, huge stretches of the planet caving in.  EXT. SKY - DAY  Yondu holds a surprised Quill as they SOAR up into the sky, YONDU He may have been your father, boy. But he wasn’t your daddy. QUILL What? YONDU I’m sorry I didn’t do it right. I’m damn lucky you’re my boy. Quill is touched. Yondu SLAPS the SPACESUIT disk onto Quill; THE SHIMMERY SHEATHE COVERS HIM. QUILL What? Yondu breathes out as completely as he can, emptying his lungs.   And they EXIT THE PLANET’S ATMOSPHERE, bursting into -  EXT. SPACE - OUTER SPACE  Quill struggles to get free, but Yondu holds him there, trapping him, but it is also an embrace. The ENTIRE PLANET is COLLAPSING BEHIND THEM. QUILL Yondu, you can’t!   What are you doing?   What are you doing?! Yondu’s jet pack expires its supply of fuel, and they STOP THERE, in space, FLOATING. Yondu’s grip weakens. Quill turns to face him. QUILL (CONT’D) Yondu. Yondu, no!  129  ©   Marvel Yondu grabs his son’s face with both hands, looking and touching him with love. QUILL (CONT’D) No. And Yondu’s FACE EXPANDS and his BODY GOES LIMP as he DIES there.   And he starts to DRIFT AWAY.   Quill grabs onto his shirt. He is CRYING. QUILL (CONT’D) No! And, suddenly, behind Quill, Rocket and Drax PROPEL themselves toward him in aero-rigs, GRABBING him.  FADE TO BLACK INT. ECLECTOR CREMATORY - LATER  Yondu’s body lies on a plank here: Various colored cloths are laid in strips over his body and face, yaro lilies beneath him, red-fired pyres and Yondu’s toys all around. Rocket, Groot, Drax, Gamora, Mantis, and Kraglin surround the table.   Quill is at the head. He has to say a few words. But it is not easy. QUILL The other day I told Gamora how I used to pretend my dad was David Hasselhoff. Rocket and Drax exchange a look. QUILL (CONT",
      "dialogue_count": 0,
      "word_count": 2413
    }
  ]
}