{
  "slug": "gunpowder-milkshake-2021",
  "title": "gunpowder milkshake",
  "genre": "action",
  "format": "film",
  "scenes_count": 8,
  "characters_count": 0,
  "characters": [],
  "total_words": 21692,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. A DINER - NIGHT A shiny metal diner, straight from the fifties. WAITRESSES in white hover around the last few PATRONS.  ROSE   the waitress (20’s) places a frothy chocolate milkshake on a tray. She brings it to a booth, where a little girl sits all by herself - Meet   EVA . She’s only eleven years old, but her eyes are so much older and wiser. She stares out the window, at the drops of rain smashing against the glass. Rose puts the milkshake in front of Eva. ROSE I put in an extra scoop for my favorite client. EVA Thanks, Rose. Eva’s glance never leaves the window. ROSE I’m sure she won’t be long. EVA You clearly don’t know my mother very well. Rose puts her hand on Eva’s shoulder and looks at her with sadness. She walks away. Eva stares at the thick Milkshake. At the two straws sticking out of it. A BELL rings as the front door opens. ROSE (O.S.) Hey stranger, can I lighten your load? FEMALE VOICE (O.S.) Not carrying today, Rose. ROSE (O.S.) First time for everything, I guess. She’s over there. FEMALE VOICE (O.S.) Thanks for keeping an eye on her.",
      "characters": [],
      "action_text": "The woman who entered sits down in the booth, across from Eva. Eva stares out the window defiantly. FEMALE VOICE (CONT’D) We’re doing this again? EVA You said you’d be here in thirty minutes. FEMALE VOICE So I’m a few minutes late- EVA Three hours! Eva turns, enraged, towards her mother -   SCARLET   (30’s). SCARLET Really? Time flies when you’re having fun. Scarlet looks like she’s been through hell. She tries to hide it behind a playful smile. But Eva sees everything: Her mother’s tired eyes. Her pale face. The blood stains peeking from beneath her coat. EVA You’re bleeding. SCARLET Just another day at the office, sweetie. Did you bring it? Eva pulls a large hardcover book from her backpack and hands it to her mother. Scarlet looks at the cover: Louisa May Alcott’s LITTLE WOMEN. Scarlet smiles. SCARLET (CONT’D) Anna May can sure pick’em. Scarlet opens the book. There’s a large hole in the pages. A 9mm handgun sits inside it. EVA It’s loaded. SCARLET Good girl. Now listen, I’m going to go away for awhile. EVA Go where? I’m coming with you.  2. SCARLET You can’t. Not this time. Nathan will pick you up soon. He’ll take care of you while I’m gone. EVA I don’t want to go with Nathan. I want to stay with Anna May and the others. SCARLET It’s not safe for you there anymore. You need to listen to me! I’m doing this for your own good- EVA Bullshit! SCARLET Language, Eva! EVA What’s going on? What did you do? SCARLET It’s complicated- EVA Tell me! I’m not a kid anymore. Scarlet stares at Eva with sadness, trying to remember every inch of her child’s face. SCARLET No, you’re not. Scarlet looks at the milkshake. SCARLET (CONT’D) You haven’t touched the milkshake. EVA I didn’t want to drink it without you. Scarlet looks at Eva, touched. She grabs a straw. Eva takes the other one. They lean down and drink from the glass, eye to eye, heads almost touching. Their ritual. Scarlet lets go of the glass. She leaves a blood smear on it. Eva notices. She softens up. EVA (CONT’D) Mom-  ",
      "dialogue_count": 0,
      "word_count": 3245
    },
    {
      "scene_number": 2,
      "slugline": "INT. LE BONBON LOVE HOTEL/CORRIDOR - NIGHT Eva walks fast, inspecting the room doors. Every door is decorated with its own atrocious theme. Willem trails behind. Eva stops in front of ROOM 114. Its door is decorated with hearts. Bingo. She points to the door next to it. The leopard print one. EVA That one. WILLEM Are you sure? One-twenty-six has a Jacuzzi big enough for two. EVA Positive. WILLEM As you wish, my lady. He unlocks the door and holds it for Eva. She walks in. He follows. WILLEM (CONT’D) Welcome to the jungle. INT. LOVE HOTEL/THE JUNGLE ROOM - CONTINUOUS Quietly, without Eva noticing, Willem locks the door behind them. He slips the key into his pocket. Eva walks to the bed and throws her duffel bag on it. The full horror of the decor is exposed: Leopard print bed, fur covered chairs and mini-fridge, plastic palm trees. It’s like a jungle threw up in here. Willem throws a switch. Jungle sound FX begin. Bird calls. Monkey howls. Whistling, Willem struts to the fridge and takes out a tiny bottle of champagne. He pops it open. Eva unzips the duffel bag. Willem pours the champagne into a glass. He sneaks a PILL into it. Its fizzle disappears among the champagne’s bubbles. He hands the roofied glass to Eva and lies down on the bed. WILLEM Champagne. On the   house.  18.",
      "characters": [],
      "action_text": "EVA Go sit in the chair. WILLEM Yes, ma’am. He sits down in the furry chair, staring at her expectantly. Eva puts the glass on the dresser. She takes out a pair of black gloves and begins to put them on. Willem’s eyes pop out of their sockets. WILLEM (CONT’D) OK! EVA Give me a cigarette. WILLEM Sorry, you can’t smoke in here. (points up) Smoke detector. Safety first. EVA Always. Eva takes out a lightweight KEVLAR vest and puts it on. Willem’s not sure what he’s seeing, but he rolls with it. WILLEM Nice. Very Kinky. Eva takes out a roll of BLACK DUCT TAPE. She slowly begins pulling the tape loose. WILLEM (CONT’D) Rock n’ roll. She starts wrapping the tape around him, tying him to the chair. She’s not delicate. WILLEM (CONT’D) Oww! That’s a little too tight, babe. Eva takes the cigarette pack from Willem’s pocket. She takes one out and shoves the pack in his mouth. She duct tapes over it. EVA Hold this for me. Eva pulls a SILENCED 9MM out of her bag. It’s at this point that Willem begins to really FREAK OUT.  19. She lights the cig and takes a puff. She then places the lit cigarette between Willem’s legs. Smoke begins to rise. Willem stares at it in horror. Eva pulls the room key from his pocket. She unlocks the door and walks out. Willem squirms in terror as the flame rises, trying to put it out. But this only makes it worse. INT. THE HEARTS ROOM - NIGHT Eva unlocks ROOM 114 with Willem’s key and sneaks in, gun in hand. The sound of running water is heard from behind the closed shower door. Eva peeks into the room. It’s Filled with hearts of different sizes. Hearts wallpaper. Heart pillows.  THE BRIEFCASE   sits on the heart-shaped bed. A white Hello Kitty phone lies beside it. Eva walks over and picks up the briefcase. She turns to walk to the door. Easy peasy lemon - Kachaaaaaaaaaaa!!!!!! The HELLO KITTY phone comes to life! Playing a disgustingly catchy Japanese pop song. The shower door flies open. A man in his forties runs into the room. Wet, a heart pattern tow",
      "dialogue_count": 0,
      "word_count": 1719
    },
    {
      "scene_number": 3,
      "slugline": "INT. THE DINER - CONTINUOUS Nathan still sits in the same booth. He slams his phone against the table. THREE GOONS in expensive suits sit opposite him, squeezed into the booth. They stare in fear at his tantrum. They’re not used to seeing Nathan lose control. Nathan takes a deep breath. He addresses the goons. NATHAN Go to the Gutterball. Try to reason with her. Bring me back the briefcase. The three goons stand up. NATHAN (CONT’D) Wait! They sit down. NATHAN (CONT’D) When I say reason with her, I mean no guns, no knives. She comes back alive. Understood? GOONS Yes. The goons get up. NATHAN Wait! They sit back down - again. NATHAN (CONT’D) And for god sake’s be careful. Remember who you’re dealing with. The goons look at each other. Is it OK to get up now? NATHAN (CONT’D) What the hell are you waiting for? GO! The goons scramble to their feet and hurry to the door.  26.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 163
    },
    {
      "scene_number": 4,
      "slugline": "EXT. BOWLING ALLEY PARKING LOT - NIGHT Eva gets out of her car and stares at the building. A neon sign says THE GUTTERBALL. Letters flicker on and off, making the sign read GUT ALL. It’s past opening hours. The place is closed. INT. BOWLING ALLEY - NIGHT Eva walks into the deserted hall, BRIEFCASE in hand. Neon signs and score screens flood the place with eerie, unnatural light. The HELLO KITTY phone comes to life, playing its Japanese song. Eva answers. CREEPY VOICE (O.S.) Who the fuck are you? Eva looks around. Whoever this is, THEY CAN SEE HER. EVA Just someone who has your briefcase. I want the girl. CREEPY VOICE (O.S.) Where’s daddy? EVA He had...an accident. He sent me. You want your briefcase or not? Click. The creepy voice hangs up. The look in Eva’s eyes says it all. Shit. But she stands her ground. They’re watching her. INT. A DARK ROOM - CONTINUOUS A CCTV monitor shows the bowling alley. It zooms on Eva and follows her as she looks around. Eventually, she spots the surveillance camera. She waves. We pull back to reveal a shadowy figure staring at the monitor. INT. BOWLING ALLEY - CONTINUOUS A long, tense moment before the Japanese song blasts out of the phone. Eva answers.  27.",
      "characters": [],
      "action_text": "The terrified screams of a YOUNG GIRL explode in her ear, sending shivers down her spine. They’re cut abruptly. CREEPY VOICE (O.S.) The girl got to this point alive. If you as much as sneeze without my permission, that can be easily rectified. EVA Got it. CREEPY VOICE (O.S.) You have another phone on you? Eva takes it out and shows it to the camera. CREEPY VOICE (O.S.) (CONT’D) Smash it! Eva drops her phone on the floor. She takes a bowling ball from a nearby rack and drops it on the device. CREEPY VOICE (O.S.) (CONT’D) Very cute. Go to the lockers. There’s an open one. Eva walks to the only open locker. CREEPY VOICE (O.S.) (CONT’D) Take the clothes out. Eva picks up the clothes they’ve prepared: Gym shorts and a T-shirt celebrating a regional bowling championship. CREEPY VOICE (O.S.) (CONT’D) Weapons go in the locker, along with what you’re wearing now. Slam it shut and it will lock. You leave it all behind. Then go to The westfield mall across the street. Arrive on foot. Ten minutes. You, the briefcase, new clothes. Got it? Eva looks from the new clothes to the camera. EVA Dinner and a show, uh? CREEPY VOICE (O.S.) Don’t flatter yourself. We were expecting the father. Ten minutes. He hangs up.  28. Eva takes her gun and drops it in the locker. Same with her knives. She turns on the timer on her watch. 10:00. As she begins changing clothes we- CUT TO: EXT. BOWLING ALLEY PARKING LOT - NIGHT Nathan’s goons have landed. They get out of the car and open the trunk. They pick their weapons. Meet the lads: The one grabbing the BASEBALL BAT will be called   YANKEE. CROW   will be handling the CROWBAR. And   SHOCKER   grabs two ELECTRIC CATTLE PRODS. They walk into the building. INT. BOWLING ALLEY - NIGHT Eva, wearing her new clothes, grabs the briefcase and heads out when- YANKEE (O.S.) Hello, Eva. She turns to see Yankee waving his baseball bat. EVA Bonehead. Shocker (cattle prods) and Crow (crowbar) appear from opposite sides, brandishing their weapons. Eva spots them. E",
      "dialogue_count": 0,
      "word_count": 2388
    },
    {
      "scene_number": 5,
      "slugline": "INT. THE CLINIC/ROOM 1 - NIGHT NATHAN’S GOONS are scattered around the small room:  Yankee   sits in a wheelchair with his broken leg.   Crow   sits in the dental chair, his broken hand dangling to his side.  Shocker   sits on the floor, nursing his smashed-in nose and broken foot. They’re a mess. But they don’t seem to notice since they are too busy passing the LAUGHING GAS MASK between them like teens who found their parents’ pot. The three begin to snicker as the DOCTOR walks in. He looks at the goons, laughing their wounded asses off. RICKY I see you assholes found my stash. SHOCKER (inhales) This is some good shit, doctor. You should be very proud. Shocker cackles like one of ROGER RABBIT’S HYENAS and passes the mask to Crow, but the doctor grabs it from him. RICKY This is for medicinal use! It is not a toy! (inhales) So who fucked you up like this? SHOCKER A girl! The goons burst out laughing. It’s painful and it shows. RICKY A GIRL made the three of you look like something out of the walking dead? SHOCKER (imitates zombies) Grrrrrrr..... CROW (giggling) I never felt pain like this.  38.",
      "characters": [],
      "action_text": "YANKEE (howling with laughter) This girl got us good, doc. I’m not sure I will ever walk again. RICKY Must be an epidemic. Got a guy in the next room with the same symptoms. Yankee gets as serious as he can, under the circumstances. YANKEE Did he tell you what she looked like? RICKY Didn’t have to. The WITCH brought him in. The goons look at each other. Can it be? YANKEE Keep talking, Doc. INT. EVA’S CAR - CONTINUOUS Eva drives in silence. Her world has crumbled. She has to make a new plan. She needs to think. Emily leans forward and turns on the radio. A country song BLASTS out of the speakers. Click. Emily changes the station. A seventies rock number. Click. She changes it again. A hip-hop beat. EVA Just pick one! EMILY What? EVA Just pick a station already! EMILY I can’t hear you. The music is too loud! And Emily continues changing stations, finally landing on-  39. KATY PERRY’S FIREWORK. The girl power anthem seems to hit the spot because, baby, she is a firework. Emily nods her head to the music. Eva can’t take it. She turns off the radio. EMILY (CONT’D) (sulking) Music helps people who’ve been through a traumatic experience. EVA Look, in ten minutes I’m going to return you to your daddy and you’re gonna be his problem. Until then, you can do anything you want as long as it doesn’t involve TALKING, MOVING or PUSHING buttons. EMILY Fine. EVA Fine. They continue driving in silence. INT. THE DINER - NIGHT Nathan’s sitting in his booth, talking on his phone. Yankee is on the other end. He tries to remain angry but he’s too high on laughing gas. NATHAN Are you sure it’s her? YANKEE Yeah, she’s a frequent flyer over here. Dropped in some schmuck she shot. Said she’ll come back to pick him up. NATHAN And the briefcase? YANKEE She had it the last time we saw her. NATHAN Right before she sent you to the ER?  40. YANKEE We wouldn’t be here if you weren’t so goddamn sentimental. NATHAN I think you forget who you’re talking to. Yankee did. He stutters, suddenly terrified. ",
      "dialogue_count": 0,
      "word_count": 8454
    },
    {
      "scene_number": 6,
      "slugline": "INT. THE LIBRARY - CONTINUOUS Eva sees the self help section in front of her. But there’s an open space between her and the much-needed weapons. The thugs are patrolling the aisles. She has to risk it. She runs towards the shelves, keeping low. Eva reaches the self help section. She pulls out a book, HE’S JUST NOT THAT INTO YOU, and throws it open. Foreign passports tumble to the floor. She grabs another book: WOMEN WHO LOVE TOO MUCH. Hundred dollar bills scatter from within its pages. THE THUGS close in on her. Eva counts them. Ten. She can do ten. Probably. If she could just find a fucking gun! A thug charges at her, gun in hand. He’s a few feet away. Eva opens a copy of WHEN LIFE GIVES YOU LEMONS. A knife sits inside it. That will do. She throws the knife at the thug’s throat. It buries itself deep in his flesh. He falls to his knees and lets out a shot. THE FLASH of gunfire signals Eva’s location to the nine other thugs. And here they come, waving knives and hatchets. Coming all at once. One of them screams: THUG (in Korean) No guns! Get her alive or Mr. Park will butcher us all! Eva grabs another book. It pulls her down to the floor, heavy beyond belief. A GOLD BAR falls out. 27 pounds of metal in a small package. A thug lifts his butcher’s knife to bring it down on Eva’s back. Eva grabs the GOLD BAR and smashes his face with it, breaking bones. She turns and hurls it at another thug’s head, destroying his lovely smile for good. A thug grabs her leg from behind, bringing her to the floor. She pulls out a hardback copy of THE SECRET from a shelf and hits him in the face with it. But the thug doesn’t let go. Another one takes the opportunity and grabs her other leg. They begin dragging her back. Towards the others.  82.",
      "characters": [],
      "action_text": "As she’s dragged along, Eva tries to pull out books. Finally she manages to hold on to one. She opens it - A shiny new 9MM HANDGUN sits inside. Eva turns to the two thugs. Their triumphant smile fades. She empties the gun into their torsos. They fly back.  IN THE BASEMENT   - the women freeze at the sound of gunfire coming from above.  IN THE LIBRARY   - There are five thugs left. They form a circle around Eva, closing in. Eva’s out of bullets. She’s breathing heavily. On the verge of defeat. INT. THE LIBRARY BASEMENT - CONTINUOUS The van is fully loaded. The women take their places inside. Florence is in the driver’s seat. Madeleine sits in the back, her arms wrapped around Emily, comforting her. Anna May, rifle in hand, is about to climb in the passenger seat. Scarlet walks over to her. Anna May looks away. SCARLET I have to go help her. ANNA MAY And you need my permission? SCARLET I can’t bail on her again. ANNA MAY Why? You’ve gotten pretty good at it. SCARLET I thought I was doing the right thing. For her. Anna May lets out a breath, letting go of fifteen years of anger. She turns to Scarlet. ANNA MAY You were doing the right thing.  83. SCARLET (surprised) What? ANNA MAY I mean look at this place. That’s no way to raise a kid. Scarlet is overwhelmed. There are so many things she wants to tell Anna May. SCARLET I missed you. ANNA MAY (in a good way) Oh, fudge you. SCARLET Fudge you. Anna May takes Scarlet’s hand. ANNA MAY Just meet us at the diner. Come back in one piece, OK? Both of you. Scarlet nods and lets go of Anna May’s hand. She takes one last look at Emily and turns away. ANNA MAY (CONT’D) Wait. Anna May pulls an ornate wooden box from the van. She hands it to Scarlet. ANNA MAY (CONT’D) I kept the girls ready for you. Scarlet opens the box. Inside it sit TWO BEAUTIFUL IDENTICAL HANDGUNS. White, etched with floral engravings. A gorgeous song starts playing. DAUGHTER’s YOUTH. It’s the only thing we hear as - A SLOW MOTION SEQUENCE BEGINS  IN THE LIBRARY ",
      "dialogue_count": 0,
      "word_count": 1813
    },
    {
      "scene_number": 7,
      "slugline": "INT/EXT. THE SCHOOL BUS/HIGHWAY - NIGHT The bus drives away from the city, on a dark, empty highway. Eva and Scarlet sit next to each other in the back seat of the bus. Their hands are tied behind their backs. They are surrounded by Korean thugs. They talk quietly. EVA You should have stayed with the girls. SCARLET And you should have stayed away from this line of work. EVA Are you kidding me? You left. Killing people was the only thing I knew how to do. SCARLET OK, maybe in retrospective, it wasn’t the best environment to raise a child in. EVA You think? SCARLET But it made you who you are. EVA At least we can agree on that. SCARLET It made you a strong, smart, incredibly impressive young woman. Eva looks surprised. SCARLET (CONT’D) I’m really glad I got to see you work, Evey. EVA (touched) Thanks, mom. Both smile.  90.",
      "characters": [],
      "action_text": "SCARLET So, any new developments in torture techniques since I retired? Are we still talking pulling nails and electrical shocks? Or should I expect some fancy-shmancy new age crap? Suddenly, Eva sees something through the window: The librarians’ van, driving beside them. Madeleine waves to Eva from the back seat, Emily in her arms. EVA I think we might have to take a rain check on the torture. Scarlet follows Eva’s gaze. She sees the van. In the driver seat, Florence holds up three fingers. Scarlet knows the sign. A countdown. Scarlet hugs Eva. Well, as close to it as she can with her hands tied behind her back. Eva is caught by surprise. She lets herself enjoy the emotional gesture from her mom. She closes her eyes. SCARLET Grab my hair stick with your teeth. Careful, it’s sharp. Drop it in my hand. Eva realizes that of course, her mother always has a plan. Eva grabs the top of the hair stick with her teeth and begins pulling it out, inch by inch. Florence signals to Scarlet from the van, holding two fingers. SCARLET (CONT’D) Hurry up! EVA (through clenched teeth) Aaam trying! SCARLET Try faster. Thugs look back at the hugging mother and daughter.  91. SCARLET (CONT’D) (to thugs) She’s emotional. You know how we women get. That seems to appease the thugs who turn back. Eva pulls the hair stick out. She drops it behind Scarlet’s back. Scarlet grabs it. It’s razor sharp with a serrated edge. She starts cutting the ropes tying her hands. Florence signals to Scarlet from the van - One finger. SCARLET (CONT’D) Did you map all their weapons? EVA Yep. I’ll grab the hatchet from the big one. SCARLET Good choice. I’ll take the knives from the guy with the limp. Scarlet cuts through her ropes. She’s free SCARLET (CONT’D) Hold still. She begins cutting Eva’s ropes. In the van, Florence raises a closed fist. This sign makes Scarlet start cutting faster. SCARLET (CONT’D) Ten. Nine. Eight. Scarlet accidently cuts into Eva’s arm. EVA Owww! SCARLET I said hold still! Six. Five. E",
      "dialogue_count": 0,
      "word_count": 3089
    },
    {
      "scene_number": 8,
      "slugline": "INT. CABIN IN THE WOODS - MORNING Eva wakes up with a gasp. It was only a dream. She catches her breath. INT. THE CABIN’S LIVING ROOM - MORNING WE FOLLOW Eva as she walks downstairs. She peeks into the living room and sees: Anna May sits at a table, reading a book. Scarlet walks out of the kitchen. One hand in a splint, the other holding a cup of coffee. She walks over to Anna May and hugs her from behind. They move together to music coming from a nearby radio. Scarlet kisses Anna May’s neck. EVA Will you two get a room? The two women laugh. SCARLET Oh, please. You’ve seen worse. FLORENCE (O.S.) God knows I have. Florence lies down on the couch, reading a newspaper, an eyepatch over one of her eyes. EVA It’s too early for any of this, mom. Can I get a coffee? SCARLET Get your own goddamn coffee. EVA Mother of the year. They should give you a trophy. Eva walks to the pot. She pours herself a cup. SCARLET You’re cranky today. EVA I had a bad dream. Emily...She shot me in the head with my gun.  104.",
      "characters": [],
      "action_text": "SCARLET And? EVA What do you mean AND? SCARLET Sweetie, being terrified of your kid is part of the deal. You scared the shit out of me when you were her age. EVA Really? SCARLET Welcome to parenthood. Eva looks around. EVA Vert funny. Where is she? I need to talk to someone normal. SCARLET Out front. EVA Smart girl. Eva heads to the door. SCARLET (lovingly) Fudge you, sweetie. ANNA MAY AND FLORENCE Fudge you. EVA Fudge the whole lot of you. EXT. CABIN IN THE WOODS - CONTINUOUS Eva walks out. Emily sits on the porch steps, holding a PUPPY in her arms. It’s asleep. Eva sits beside her. EVA Picked a name yet?  105. EMILY I think I’ll call her Madeleine. EVA (touched) I like that. How’s Madeleine doing today? EMILY She only sleeps and poops. It’s cute. She holds the puppy towards Eva. EMILY (CONT’D) Wanna hold her? EVA Maybe later- Too late. Emily sticks the sleeping puppy in Eva’s arms. Eva looks down at the puppy for a silent moment. She looks at Emily. There’s something she needs to say. EVA (CONT’D) I’m so sorry I killed your father, Emily. If I could take it back... EMILY I know. But you tried to save him. EVA Still. EMILY And you saved me. Emily’s forgiveness touches Eva. There’s nothing she can say except- EVA Thank you. Emily’s face toughens up. She looks Eva in the eyes. EMILY Besides, I know you just pull the trigger. I know it’s someone else who tells you what to do. (beat) Who sent you to my father? Eva sighs. She owes Emily that much.  106. EVA There’s a group of men, called THE FIRM. They’ve been running things for a long, long time. INT. A FANCY HOUSE - DAY Gothic architecture. Dark wood and old leather. Taxidermy. EVA (V.O.) They make all the rules and change them when it fits their needs. The sound of a DOORBELL echoes through the huge house. A man sitting in an armchair turns towards the sound.   Nathan . EVA (V.O.) They think they’re untouchable. They think they can get away with anything. Nathan walks to the door. Through the semitransparent glass he",
      "dialogue_count": 0,
      "word_count": 821
    }
  ]
}