{
  "slug": "gypsy-101-the-rabbit-hole-2017",
  "title": "gypsy 101 the rabbit hole",
  "genre": "sci-fi",
  "format": "series",
  "scenes_count": 6,
  "characters_count": 0,
  "characters": [],
  "total_words": 9504,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. NEW YORK CITY - MURRAY HILL - LATER Jean and Larin stroll, talking over the chaos. LARIN You know I used to think Daryl was cheating on me. We’d have sex and he’d close his eyes and I would just try to imagine who he was picturing the whole time. How fucked up is that? And then it would actually turn me on... JEAN You’re crazy. And cynical. LARIN You’re telling me you’ve never thought about cheating? JEAN I don’t have time, even if I wanted to. Larin rolls her eyes. LARIN My point is I could be the best therapist in the world but I still can’t cure someone’s issues with monogamy. Just get them to acknowledge it, which might be even worse. Ignorance, man - it’s underrated. They turn onto Park Avenue, arriving at a GREEK FOOD TRUCK. JEAN I don’t know. If I were Hunter, I’d want to tell that poor girl to run for the hills... and tell my patient to find someone who satisfies him. LARIN Yeah but then Hunter would be fucking fired. And he’s the only eye candy in that office, so no thank you. At the front of the line, LARIN (CONT’D) The combo with lamb.  10.",
      "characters": [],
      "action_text": "JEAN I’ll have the Greek salad? Dressing on the side. Thanks. They move over, waiting for their order. LARIN So Friday, I’m having people over. Gotta christen that view. JEAN Can’t believe you moved back here. LARIN Can’t believe you left. Jean shields her eyes from the sun. JEAN Friday’s tough. We have dinner at the Faitelsons. LARIN Are you serious? I thought you hated that crew. JEAN I mean they’re not my favorite people in the world, but they’re amusing. And convenient. LARIN You know if I was your therapist, I’d tell you that you need to let go a little. I can’t remember the last time we did something real. JEAN That’s not true... LARIN I don’t bullshit you, my dear. They grab their food- LARIN (CONT’D) My next patient’s not til 4 and I need a Brazilian. Want to come uptown? JEAN Cause that’s so fun? I have a 2 o clock. I should head back.  11. LARIN Okay, good girl. See you later. Larin smiles, turning the corner, leaving Jean standing alone. A TAXI cutting really close to her on the sidewalk. INT. THERAPIST’S OFFICE - LATER A TEENAGER, 19, sits in the roomy chair, her leg shaking. Eyes close together, straggly hair. This is ALLISON. ALLISON Your office is so corporate. JEAN Thank you? ALLISON I would think you’d want to make it feel warm or something. JEAN On the phone you said it was urgent- ALLISON Well, my friend Drew said her mom came to you. And you were like a miracle worker. Jean nods, keeping her tone serious. JEAN I’m not a miracle worker. Therapy is a serious commitment, which begins with communication. So let’s start with, why are you here? ALLISON It’s kind of a brutal story. Are you sure you can take it? Jean sits up, concealing any discomfort. JEAN I’m listening. ALLISON I don’t want to offend you. You seem quite... conservative. JEAN This is a safe space, Allison.  12. ALLISON Well, listen, I’m not like a druggie or anything. I’m a smart kid. Okay? JEAN Allison... I’m not judging- ALLISON So I got into Fordham, okay? And I’m studying like histo",
      "dialogue_count": 0,
      "word_count": 2122
    },
    {
      "scene_number": 2,
      "slugline": "EXT. JEAN’S HOUSE - SUBURBAN CT - LATER The RANGE ROVER pulls up to the two-story colonial house. Red brick and perfectly suburban. An American flag out front. Dolly jumps out of the car. JEAN (yelling after her) Homework, pajamas, then dinner! Jean walks in, grabbing a ton of mail under her arms - bills, catalogues, magazines. An ENGLISH COCKER SPANIEL comes running through the house, which looks like a WAR ZONE. Jean notices dog piss on the floor, under her heels. JEAN (CONT’D) Perfect. INT. KITCHEN - JEAN’S HOUSE - LATER A mess. The sink overloaded with dishes. Jean pushes a frozen pizza in the oven, still in her work clothes. Bare feet. Her hands graze the oven in the process. Ow. Fuck. The DOOR opens. MICHAEL, 41, distinguished in a suit and tie, enters. He undoes his tie. He’s tall and lean with a full head of hair. He seems to only get more attractive with age. MICHAEL Smells good! What are you making? JEAN Don’t get too excited. Just put a pizza in the oven. MICHAEL Candy said you were cooking. JEAN Oh, is that what “Candy said?” MICHAEL Stop it. He plants a kiss on her cheek. JEAN I was going to do a whole shop, but figured I’d go with the car.  22.",
      "characters": [],
      "action_text": "MICHAEL Is Dol upstairs? JEAN Yup. How did it go? MICHAEL Bill’s taking over the case. JEAN That’s good. Right? MICHAEL I guess, though it means more to do for the Procter and Gamble suit. JEAN But you’re still okay for the trip? I really think we need to book soon- He flips through the mail, throwing out a bunch. JEAN (CONT’D) I spoke to Mrs. Finnigan. Even with the extra time, her scores haven’t improved. And she’s not focusing. MICHAEL Have you made an appointment yet? JEAN We’re not giving her ritalin. All these doctors overly prescribe it. MICHAEL I didn’t say anything about drugs. But if she has ADHD- JEAN That’s what they do! I don’t want our seven year old on drugs. How is it I along with everyone else I knew was fine without drugs? UPSTAIRS, sounds of DOLLY playing. Michael rushes up the stairs, like a grown-up child. MICHAEL Is that my favorite ninja? JEAN Dinner’s ready in a minute!  23. Michael finds Dolly at the top of the stairs, attacking her with kisses. Jean watches the timer on the pizza count down the last minute. Her eyes heavy. Her teeth clenched. INT. JEAN’S HOUSE - SUBURBAN CT - LATER The three of them sit around the table, sharing the pizza. Dolly in her Star Wars pajamas. Jean flips through the mail, casually. Michael has tomato sauce on his chin. DOLLY This pizza’s sexy. Michael and Jean look at each other. JEAN Honey, where did you learn that word? DOLLY From Holden. His sister taught him. JEAN Do you know what it means? DOLLY Yes. MMMM... cool. Like Star Wars. Star Wars is soooo sexy. JEAN Actually honey, it’s an adult word that’s used to describe a person if they are uh... pretty. DOLLY Are you sexy, daddy? Michael smiles. MICHAEL Eh. I’m mediocre. But do you know who’s very sexy? DOLLY Who? MICHAEL Your mom. He shoots Jean a playful look. She rolls her eyes, but clearly enjoys his attention.  24. DOLLY Am I sexy? Jean jumps in- JEAN One day you will be, sweetie. But not for a very very very long time. This seems to work... DOLLY When do",
      "dialogue_count": 0,
      "word_count": 1086
    },
    {
      "scene_number": 3,
      "slugline": "INT. HOLLOWAY HOUSE - BATHROOM - MOMENTS LATER Jean applies moisturizer to her skin. She notices a red scaly patch on her chest. Tries to rub it off, but it’s permanent. She takes out the FLYER for the band. Buries it in her medicine cabinet. A secretive smile. She turns off the light. INT. APARTMENT - NIGHT A HAND taps a bedside lamp on. Sam sits up. He’s sweating. He gets up, walking through the simple space, his feet bare. Hooks line the walls, but no photos or art remain. He rips open a large box. Digs something out. An old blue vintage tee shirt. Too small to be his. He carries it back into his bedroom, holding it close to him, breathing in the smell. Content. EXT. CAR - DOLLY’S SCHOOL, CONNECTICUT - MORNING Jean adjusts a pin on Dolly’s shirt that reads: “I DRESS MYSELF.” She tries to kiss her, but the seven year old squirms out of her grip. JEAN Bye, sweetie! She watches Dolly run freely ahead, joining a few seven year old boys, her baggy jeans riding low, a backwards hat on her head. She doesn’t look back. INT. SUPERMARKET - LATER Jean slowly moves through the aisles, looking at her shopping list. She stops in front of the various cans of TOMATOES. Crushed. Diced. Whole. She inspects each one. She chooses diced. On second thought, crushed. She just stands, debating. A HISPANIC MALE EMPLOYEE, 20s, walks by. EMPLOYEE Can I help you, miss? Jean considers. JEAN It doesn’t matter.  28.",
      "characters": [],
      "action_text": "She throws one in the shopping cart, carelessly. INT. HOLLOWAY HOUSE - BEDROOM - MORNING Jean digs through her clothing. Preppy sweaters, wraps, slacks. Business casual. She casts them aside, displeased. INT. HOLLOWAY HOUSE - CLOSET - CONTINUOUS Tucked deep in the back, Jean pulls out clothing. Colorful dresses, cool vintage looking pieces, short sequin mini skirts. She removes a pair of skin tight black pants. A sexy silky tank-top. She uncovers a pack of CIGARETTES. She stares at the outfit, a mischievous look. INT. BLOOMINGDALES - MALL - LATER Jean stops at a PERFUME COUNTER, sorting through the various Chanel bottles. She holds a CLUB MONACO BAG. Her phone rings. She silences it. Jean clears her throat, interrupting an AFFECTED FEMALE EMPLOYEE, 40s, who does her make-up. JEAN Hi, I was wondering if you carry Chance by Chanel? EMPLOYEE That’s a line from like 2003. JEAN Has it been discontinued? EMPLOYEE You could try our newer, more popular options. Chanel No. 5 or our new, Coco by- JEAN I’m just looking for that one. The woman types away, annoyed. Jean catches her reflection in a small magnifying mirror, smoothing out her wrinkles. EXT. MALL - CONNECTICUT - LATER Jean carries a bunch of bags, as she looks for her car.  29. On her phone, a NOTIFICATION from FACEBOOK. A friend request. The overweight face of CLAIRE ROGERS staring back at her. She hits IGNORE. Her phone rings. MICHAEL’s photo comes up - a sweet photo of him and Dolly as a baby in a swimming pool. JEAN Hey - I just got you the cutest- CANDACE (V.O) It’s Candace. JEAN Oh, Candace. Sorry, I was just shopping for ties. You know... CANDACE (V.O) Dolly’s school called- JEAN Is everything alright? CANDACE (V.O) Yes, yes. JEAN You should start with that. CANDACE (V.O) They need you to go down there. Nothing serious, but something happened with a girl in her class. JEAN Where’s Michael? Can I- CANDACE (V.O) He just stepped into a meeting. They tried calling you, but said your phone was off. JEAN I was just",
      "dialogue_count": 0,
      "word_count": 863
    },
    {
      "scene_number": 4,
      "slugline": "INT. CAR - GREENWICH CT - NIGHT Michael drives, tired and worn out. Jean fiddles with the bottle of wine in the passenger seat. JEAN He was basically implying she’s either trans or a lesbian. MICHAEL Let’s not jump to conclusions. This could be a phase. For now, we have to just support her. JEAN Obviously. I’m not going to send her to aversion therapy. Jesus. Jean’s phone CHIMES. A text from Larin:   You still on with the real housewives tonight?   Jean laughs aloud. MICHAEL Who’s texting you? JEAN Larin. About her thing tonight. JEAN responds:   Yes... But will try to duck out if I can.  The BMW pulls up to an ULTRA MODERN MANSION. Jean trudges out of the car, eyeing the house. JEAN (CONT’D) Ugh, I’m not in the mood for this. MICHAEL You were the one who suggested it- JEAN At the time, I thought it was a good idea. They arrive at the front door. Jean rings the DOORBELL. MICHAEL Are you okay? You seem- The door swings open... KAREN FAITELSON, 40s, bubbly, well-dressed, warmly hugs them. KAREN FAITELSON Jean! Michael!  32.",
      "characters": [],
      "action_text": "Jean, all smiles. JEAN Karen, hi! Michael shakes his head at Jean, as she follows after. INT. THE FAITELSONS HOUSE - GREENWICH CT - LATER Ornate and overly grand. Fancy art intermixed with photos of their two dorky sons, ages thirteen and seven. Jean and Michael sit at the pristine dining table, across from Karen and Dennis. Dennis, 48, overweight and red-faced, drinks scotch. Bottles of wine already open. Another preppy couple, BLAIR and ADRIAN SALTZ, early 40s, pass around Karen’s slide-show of PHOTOS from their Turkish vacation. They are both skinny brunettes. Karen flips through the iPad. Jean sips her wine, fiddling with the glass, not particularly engaged. KAREN Best decision not to bring them. They were fine with Julie and this way, we could go out at night, eat dinner on the Bosphorus... This was the main pool. It was a slice of heaven. Literally. BLAIR All I keep hearing about is Istanbul. I feel like it’s the new Greece. Michael tries unsuccessfully to make eye contact with Jean across the table. ADRIAN (to Michael) Aren’t you guys going somewhere tropical? MICHAEL Belize. Soon, actually. BLAIR It’s so hard with the kids. KAREN You know, I’m always happy to watch Dolly or Ella.  33. BLAIR That’s so sweet. DENNIS Where are you guys staying? MICHAEL I think a lodge, like the Victoria or something. Is that right, babe? Jean looks over, her mind elsewhere. KAREN You need to stay at Blancaneux. It’s in the middle of this jungle. Francis Ford Coppola owns it. The wine, the view. It’s where you stay that makes your trip. DENNIS It’s incredible. JEAN We just have a few days. Michael’s sister Brooke is watching Dolly... KAREN It’s life changing. You can’t miss it. A moment. MICHAEL Well, alright, send us the info. I mean, we’re not opposed to incredible, right darling? Jean shoots Michael a look, but smiles politely at the group. JEAN We all aspire to incredible. INT. FAITELSONS HOUSE - KITCHEN - LATER Jean stands back while Karen and Blair prepare the souffle. She",
      "dialogue_count": 0,
      "word_count": 848
    },
    {
      "scene_number": 5,
      "slugline": "INT. FAITELSONS HOUSE - LATER They are just finishing dinner. It’s a lighter, more festive mood. Jean picks up a bottle of wine, but it’s empty. DENNIS I’ll get some more- JEAN Actually, do you guys have any bourbon? Michael looks at her, curiously. DENNIS Since when are you into bourbon, Jeannie? JEAN I don’t know, feel like a change. KAREN Adventurous. DENNIS I have Makers, Woodford reserve. Do you drink it straight? JEAN On the rocks? DENNIS Your wife is a tiger, Michael. MICHAEL That’s why I married her. He smiles at her, adoringly. INT. BATHROOM - FAITELSON’S HOUSE - LATER A pristine marble bathroom. Candles arranged next to roses on the back of the toilet seat. As she flushes, Jean’s phone vibrates. A TEXT from LARIN:   Has the gossip killed you yet? We’ll be here late so no excuses.  Bring Michael, of course.   A few enthusiastic EMOJIS follow.  37.",
      "characters": [],
      "action_text": "EXT/INT. STUDY- FAITELSONS HOUSE - LATER As Jean passes the study, she notices the door still open. The laughter of Karen, Dennis, and Michael audible from the other room. She creeps inside. At the desk, she tears a few sheets from Dennis’ prescription pad. Stuffs them in her pocket. EXT. FAITELSON’S HOUSE - LATER Michael walks with Jean down the lit walkway. MICHAEL On a scale of one to ten, how painful tonight? JEAN I don’t know why we need the info on those hotels. You’re far too accommodating. MICHAEL No, I’m strategic. It’s easier sometimes to just appease someone. Jean shrugs. JEAN Well, that souffle was to die for. Definitely a ten. MICHAEL I know. Should have married Karen. JEAN Go for it! I’d love to see that. MICHAEL I’d rather eat frozen pizza the rest of my life than live with that woman. Jean laughs, hobbling into the car. JEAN So I think I can make it. MICHAEL Where?  38. JEAN To Larin’s. Remember? She’s having a small thing at her new place. Michael looks at her, slightly confused. MICHAEL You’re going now? JEAN Just for a few hours. She said they’ll be hanging til late. She flips her hair back. Her eyes flitting nervously. MICHAEL You’re drunk. JEAN No I’m not. MICHAEL You don’t think I know you by now? JEAN Well, you say it like I’m breaking the law. I’m of age, you know. She stares at Michael until he looks away, surrendering. MICHAEL You really want me to take you to the train station now? Like this? JEAN Like what? She gives him a harsh look, then turns her attention out the window. Her reflection blurred by the streetlights, half bathed in lightness, half in darkness. INT. TRAIN - LATER From a distance, we watch as Jean walks out of the bathroom to her seat. She now wears the black skinny pants and the tight yellow shirt. She holds her large pocket book, pushing her clothes from earlier inside. She sits. Using her iPhone camera, Jean applies lipstick. A dark shade of red. She opens her purse and pulls out the Chanel Chance perfume. She sprays he",
      "dialogue_count": 0,
      "word_count": 3256
    },
    {
      "scene_number": 6,
      "slugline": "EXT. NEW YORK CITY STREET - UPPER WEST SIDE - EARLY AFTERNOON Jean walks, on the phone. JEAN Hi Candace. Is Michael around? INT. OFFICE - CONTINUOUS CANDACE He’s just finishing up a call. Can I have him return? EXT. NEW YORK CITY STREET - UWS - CONTINUOUS Jean runs across the street against traffic. JEAN It’s kind of important. I wanted to see if he booked the hotel. CANDACE I’m just waiting for the go ahead to book it. His schedule got a bit turned around with the Procter and Gamble case since Bill- JEAN Can you just tell him it’ll take a second? I’m worried it’s going to get full. INT. OFFICE - CONTINUOUS Candance struts into Michael’s office. She mouths, JEAN, BELIZE. Michael nods. CANDACE Putting you through. EXT. NEW YORK CITY STREET - UWS - CONTINUOUS JEAN Thanks, Candace. Have a good- MICHAEL Hey, honey.  54.",
      "characters": [],
      "action_text": "JEAN (to a cyclist) Fucking watch it! INT. OFFICE - CONTINUOUS Michael swivels around. Candace still stands in the doorway. MICHAEL Whoa. What- JEAN (V.O) Hey. I don’t mean to keep nagging you, but I really want to book the hotel and the flights before they get crazy. You have no idea how much I’m looking forward to it and- MICHAEL Babe, we’re gonna need to push. EXT. NEW YORK CITY STREET - UWS - CONTINUOUS Jean’s face falls. JEAN Are you serious? Brooke’s already coming. I took off my days. Can’t you get someone to cover? MICHAEL I really can’t. Bill’s heading out of town and it’s just terrible timing. I’m so sorry, honey. I know you were excited. So was I. I promise we’ll go soon. INT. OFFICE - CONTINUOUS Michael plays with the tip of his ball point pen... MICHAEL Do you have a patient now? Why don’t we meet for lunch? We can discuss when- JEAN No. I don’t want to talk about it. MICHAEL Please don’t be mad.  55. Candance looks at him, flashing him a sweet smile. JEAN I’m not mad. Just disappointed. EXT. NEW YORK CITY STREET - SALON - CONTINUOUS Jean stands in front of a SALON, pacing. JEAN Okay, I’m at my appointment. We’ll talk at home. INT. OFFICE - CONTINUOUS Michael hangs up, sullen. CANDACE That sounded like it sucked. MICHAEL It did. CANDACE Well, I’ll take   you   to lunch, if you need some cheering up. Michael looks down, shaking his head. MICHAEL Not sure I’ll be very good company. CANDACE I don’t mind. She smiles at him, encouragingly. INT. SALON - LATER Jean sits under a dryer, hair wet, full of dye. A WOMAN sits down beside her, late 30s, suit, typing on her blackberry. JEAN I thought I was the only one who dyed my hair during lunch. WOMAN It’s like my salvation. Jean smiles casually, her hand shaking slightly on her lap.  56. EXT/INT. JEAN’S OFFICE - LATER Jean walks into her office, closing herself in. Quiet. Her lunch untouched. She removes a PILL BOTTLE from her desk drawer. We notice the label: KLONOPIN. On second thought, she returns it to its pl",
      "dialogue_count": 0,
      "word_count": 1329
    }
  ]
}