{
  "slug": "hacksaw-ridge-2016",
  "title": "hacksaw ridge",
  "genre": "drama",
  "format": "film",
  "scenes_count": 16,
  "characters_count": 1,
  "characters": [
    "RENNELLI"
  ],
  "total_words": 23598,
  "total_dialogue": 1,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. LIVING ROOM, DOSS HOUSE - MOMENTS LATER CLOSE ON AN ILLUSTRATION OF THE TEN COMMANDMENTS The Doss house doesn’t contain much art work, and this wouldn’t qualify as art to most people; it’s more like a cartoon, illustrating each of the ten commandments. Desmond’s eyes drift over the illustrations; but then they settle on one that has particular relevance:   THOU SHALT NOT KILL, depicted by Cain holding a bloody club, standing over the prostrate body of his dead brother, Abel.   There is a look of utter horror on Cain’s face. BERTHA DOSS (O.C.) Murder is the worst sin of all. We’re all brothers and to take another man’s life is the most grievous thing there is in the Lord’s sight. Nothing hurts His heart so much. INT. LIVING ROOM, DOSS HOUSE - CONTINUOUS Bertha kneels on an old worn sofa with Desmond and Mark standing beside her. They are both looking at a framed illustration of the Ten Commandments hanging on the wall. Bertha turns and pulls Desmond down into her lap but his red- rimmed eyes never leave the print. DESMOND Why did Cain kill Abel? BERTHA DOSS Oh, he was mad, I suppose. Or he wanted what his brother had. It doesn’t matter why - it’s always wrong. Mark is silent, but Desmond is transfixed, unable to stop staring at that gruesome primal scene of the first murder. EXT. DOSS HOUSE - FRONT PORCH - EVENING The sun’s going down, and Tom Doss is sitting on his front porch, bored and sullen.   He reaches to the firewood box beside his chair, and from behind it he draws a Masan jar half full of clear liquid--moonshine.   He takes a sip. From inside he hears Mark’s voice.  3.4.13   5.",
      "characters": [],
      "action_text": "MARK DOSS Daddy?!   Can we get down now?! He tucks the jar away quickly and wipes his mouth. TOM DOSS Ask your Mama, she’s the one didn’t want to whip you! INT. DOSS LIVING ROOM - EVENING Mark hops off the chair, leaving Desmond still in the position where their mother left them.   Mark heads into the kitchen... INT. DOSS HOUSE - KITCHEN - EVENING Mrs. Doss is cooking dinner as Mark comes in, wearing an expression of exaggerated pennance. MARK Mama, can we stop staring at the Commendments? BERTHA Commandments.   Are you sorry? MARK Yes’m. BERTHA Tell Desmond. MARK (without moving) SORRY, DESMOND! BERTHA Okay, you can go. Bertha stands for a moment wondering why she hasn’t heard a response from Desmond. BERTHA (cont’d) Desmond? (beat) Des? She moves into the living room, and finds her youngest son now standing, staring straight at the picture.  3.4.13   6. BERTHA (cont’d) Desmond?... FROM THE POV OF THE PICTURE, we see Desmond’s stare, his entire soul fixed on it. He’s staring at CAIN, A LOOK OF HORROR ON HIS FACE at what he’s done. There are tears in Desmond’s eyes. And BERTHA realizes with a certainty what she has always suspected:   Desmond feels things in a unique way. EXT. RAILROAD TRACKS, VA, SEPTEMBER, 1941 - DAY Title:   Fourteen years later.  Lynchburg has always been a railroad town; tracks cut through the gorges and span ridges. Twenty-five year old Desmond now walks alongside the tracks. He’s grown into a thin but wiry man with a pleasant but crooked smile. His senses are keen; he hears the chirp of a bird and his blue eyes catch sight of a bright red Cardinal high in a hickory tree.   He’s a true country boy, at one with nature. INT. HOSPITAL ROOM - LATER Desmond waits his turn. Fascinated by all things medical, he can’t help but poke around in the shelves and cabinets. The door behind him opens and Desmond whirls around, embarrassed to be caught snooping. He’s even more embarrassed as sees his attendant is an attractive nurse, DOROTHY SHUTTE, early 20’s",
      "dialogue_count": 0,
      "word_count": 1663
    },
    {
      "scene_number": 2,
      "slugline": "INT. COFFEE SHOP - NIGHT Desmond and Dorothy chat furiously across the table, barely having time to take bites of their food.   Something Desmond says cracks Dorothy up. INT. HOSPITAL - LOCKER ROOM - DAY Dorothy opens her locker to find an orange and a note from Desmond.   Her look of confusion on finding the orange turns to a smile as she reads the note. EXT. LYNCHBURG FOREST - DAY The leaves are falling from the tress as Desmond and Dorothy walk through the woods, talking.   The MONTAGE ENDS as Dorothy puts her head on Desmond’s shoulder. EXT. NATURAL BRIDGE, VA - WEEKS LATER - AFTERNOON A glorious late Fall day with just a bit of color lingering on the trees.   Desmond and Dorothy are walking with other tourists, gazing up at Natural Bridge. DESMOND They say George Washington threw a silver dollar over it. DOROTHY Seems like a waste of a dollar to me. DESMOND I doubt anybody’s throwing money at it these days! (more seriously) The plant foreman told me the other day that I’m doing such a good job, they might raise me up a notch. Salary too. Hope that doesn’t sound too much like bragging. DOROTHY So, you’re gonna be a man of means, Mr. Doss? DESMOND I’m a man who means to be one. She looks at him, realizing he’s planning a future, one that’s built around her.   Slowly, happily, they kiss.  3.4.13   13.",
      "characters": [],
      "action_text": "EXT./INT. COUNTRY ROAD / DESMOND’S CAR - AFTERNOON Desmond and Dorothy drive back to town - they are both aglow with their love. As they pull into town, Dorothy notices several cars pulled over to the side of the road and people crowded around the doorway to a coffee shop. DOROTHY Desmond... She doesn’t even need to finish her thought; Desmond has already started to pull over. EXT./INT. LYNCHBURG DOWNTOWN COFFEE SHOP - CONTINUOUS Desmond and Dorothy join the crowd that has gathered at the coffee shop, just within earshot of the door.   Everyone looks nervously at the radio inside, listening to President Roosevelt. PRESIDENT ROOSEVELT (ON RADIO) ...the United States of America was suddenly and deliberately attacked by the naval and air forces of the Empire of Japan! Roosevelt’s speech continues as we CUT TO: EXT. ARMED FORCES RECRUITING STATION - DAY A long line of men are already waiting their turn to sign up. We move through the line of faces, some older, some younger, everyone wanting to do their part as Roosevelt’s speech plays over.   Men continue to join the line, some obviously have come from work, both in suits and in uniforms. PRESIDENT ROOSEVELT (V.O.) ...As commander in chief of the Army and Navy, I have directed that all measures be taken for our defense. But always will our whole nation remember the character of the onslaught against us. No matter how long it may take us to overcome this premeditated invasion, the American people in their righteous might will win through to absolute victory. CEMETERY SEQUENCE...  3.4.13   14. We see various CLOSE SHOTS OF GRAVESTONES, from a low angle, jabbing up into the sky... We PAN ACROSS them, a whole forest of stones, like a whole army of soldiers who have become stone slabs as they died in battle.   We are... EXT. LYNCHBURG CITY GRAVEYARD - DAY The cemetery is in the very heart of the town, on a hill top, surrounded by brick walls.   And Desmond Doss’s father, Tom, is standing among the grave stones. It’s an old a",
      "dialogue_count": 0,
      "word_count": 5527
    },
    {
      "scene_number": 3,
      "slugline": "INT. COLONEL CUNNINGHAM’S OFFICE - DAY - ONE WEEK LATER Cunningham sits at his desk, Sgt. Howell standing beside him. A line of men stretches through the office as each member of Company B applies for, and gets, his long awaited “Two Week Furlough.”   Bored, Cunningham glances at each man’s papers and routinely stamps them.   Until Desmond reaches the desk. COLONEL CUNNINGHAM Private Doss. I can’t authorize your pass. DESMOND Respectfully, sir, I’m long overdue.   And I’m getting married this afternoon... COLONEL CUNNINGHAM ...I’m not interested in your sob story.   You’re not rifle qualified. Cunningham smiles, enjoying this. DESMOND I’m not required to carry a gun, sir.   Colonel Stelzer... COLONEL CUNNINGHAM Colonel Stelzer’s determination was... (reading from report) “Doss must be allowed to work as a Combat Medic provided he qualifies in all other areas of his training. ”  (closes file) You have not qualified on the rifle range, Private. Silence.   Everybody in line - Smitty and the rest of Company B - knows that Cunningham has put Desmond in a box. COLONEL CUNNINGHAM (cont’d) Show me you know how to handle a rifle and I’ll sign your furlough. Sergeant?   Hand Private Doss your firearm. Sgt. Howell offers Doss his rifle. DESMOND Sir. I will not touch a gun, sir.  3.4.13   39.",
      "characters": [],
      "action_text": "COLONEL CUNNINGHAM I am not asking you, Private.   That is a Direct Order. And there it is. Desmond doesn’t move. COLONEL CUNNINGHAM (cont’d) Pick up the rifle. (Doss remains still) I want you to think very carefully here, Doss.   Pick up the gun; get your furlough and have a happy honeymoon.   Refuse to pick up the gun and I will court martial you, and you will spend the next five years in the stockade. Desmond is tempted but... DESMOND No, sir. COLONEL CUNNINGHAM Sergeant, you will note that Private Desmond Doss has disobeyed a direct order from his superior officer.   Arrest him! Sgt. Howell leads Desmond out, past the other men of Company B. Desmond neither seeks their pity nor their help. Smitty watches Desmond as he is led out.   Disbelief.   Anger. Confusion.   What the hell is it about this guy? EXT. STOCKADE - DAY As the GUARD leads Desmond in, Desmond pleads-- DESMOND I’ve got to make a phone call. Please. GUARD No prisoner who’s been insubordinate gets phone calls. The Army lawyers will come to you.  3.4.13   40.",
      "dialogue_count": 0,
      "word_count": 393
    },
    {
      "scene_number": 4,
      "slugline": "INT. STOCKADE CELL - EVENING A bare cell - a cot, a sink, a toilet.   Desmond sits on the cot, reading the Bible Dorothy gave him.   Desmond looks at his wrist watch:   five minutes past six. INT. 7TH DAY ADVENTIST CHURCH - LYNCHBURG, VA - SAME Dorothy stands at the altar in her wedding gown, her parents beside her.   Next to them are Desmond’s parents. A tableau of embarrassment and concern. MINISTER (quietly) How much longer would you like to wait, Dorothy? Dorothy speaks without a hint of doubt in her voice. DOROTHY I think this is long enough. The Minister whispers to Dorothy. MINISTER I’m so very sorry... DOROTHY I’m sure there’s a reason he’s not here.   We’ll call you on Monday to reschedule. INT. STOCKADE CELL - NIGHT Desmond paces in his cell, his knuckles clenched white with barely contained fury. Suddenly, the dam bursts with a SCREAM - a wrenching roar of frustration and pent-up anger.   He grabs his cot and smashes it against the floor.   He rips the sink off the wall.   He smashes his hands against his steel door until his knuckles are bloody.   Exhausted, he slumps down to the floor. INT. STOCKADE CONFERENCE ROOM - NEXT DAY Desmond’s lawyer, CAPTAIN DANIELS, is a nervous young man with a mustache so meagre it seems painted on. CAPTAIN DANIELS Private, outbursts like last night don’t help.  3.4.13   41.",
      "characters": [],
      "action_text": "Desmond shrugs, sunk in misery. CAPTAIN DANIELS (cont’d) There is some good news.   They’ve indicated if you plead guilty, the Army will give you a dishonorable discharge, and you can go home. How’s that sound? DESMOND If that’s the good news, I sure don’t want to hear the bad. CAPTAIN DANIELS Look, Doss, Military Justice is a whole different animal.   We’re at war!   The needs of a Conscientious Objector are hardly a priority. Take the deal and be grateful. INT. DESMOND’S CELL - DAY Desmond sits on his cot, reading Dorothy’s Bible.   The door opens and to Desmond’s surprise, Captain Glover enters. Desmond stands and salutes.   Glover ignores his salute. CAPTAIN GLOVER Sit down. Desmond sits, uncertain.   Glover looks out the window at the parade ground, at the men training outside.   He sees Desmond’s Bible; picks it up. CAPTAIN GLOVER (cont’d) This your Bible? DESMOND New Testament.   My fiance gave it to me when I joined up. Glover shakes his head and puts the Bible back down on the bunk. CAPTAIN GLOVER You probably think I’m a real son of a bitch who cares more about regulations then he does about his men. DESMOND No, sir.  3.4.13   42. CAPTAIN GLOVER Did I give you permission to speak? (beat) The U.S. Army didn’t always arm its medics.   Did you know that?   The Geneva Convention expressly allows Medics to be armed and to use their weapons in defense but some nice fellow at the Pentagon decided, like you, that he knew better.   But after we invaded Attu last year, a thousand Japs armed with rifles and home-made spears launched a banzai attack in the middle of the night directly on the hospital tents where the medics and their wounded lay sleeping.   Our boys fought back as best they could with whatever they could find but hundreds died. Captain Glover looks at Doss. CAPTAIN GLOVER (cont’d) I don’t give a rat’s ass about your principals because the Japs don’t. One of them comes at you and some wounded soldier what are you gonna fight him with, Doss?   Your New T",
      "dialogue_count": 0,
      "word_count": 3932
    },
    {
      "scene_number": 5,
      "slugline": "EXT. ROAD HEADING SOUTH - DAY It’s a very different Company on the march today.   Several men have been killed or wounded and the true nature of the abyss which yawns before them has been glimpsed.   Desmond glances up at the terrain around them. They are crossing an open valley, half a mile wide.   A series of gradual slopes lead to their ultimate objective up ahead: a long, high rocky escarpment: HACKSAW RIDGE The jagged Ridge runs west, to their right, all the way to the sea.   The top of the ridge is protected by a SHEER CLIFF which is 70 feet high. At the eastern end of the ridge, to the Company’s left, is a series of sharp ROCK PINNACLES, 480-500 feet tall, which dominate the entire formation. With the sun behind it, throwing its enormous shadow out towards the men, the entire structure feels oppressive and malevolent. The Company has stopped - every man in it absorbing their first glance of the obstacle ahead. CAPTAIN GLOVER Let’s go! The Company reluctantly begins to move forward. They come upon the first of several unburied JAPANESE CORPSES- -bloated, decomposing bodies drawing clouds of flies. Their faces are stretched tight, jaws open, as if the dead are still screaming. A cloud-like dread begins to descend on the men. Desmond notices the FOOTPRINTS of Rennelli in front of him.  T he stream trickling down the middle of the road is changing color, getting redder.   Blood red. And then it dawns on Desmond that the ground is so SATURATED WITH BLOOD that they are literally walking through a stream of it. As every man comes to the same shocking realization. HOLLYWOOD Is that...?   It’s not a stream, it’s blood!  3.4.13   58.",
      "characters": [
        "RENNELLI"
      ],
      "action_text": "The two companies will then link up on top and establish a new defensive perimeter which we will hold at all costs. Glover hesitates. CAPTAIN GLOVER (cont’d) We need Okinawa as a staging area for the invasion of Japan but the entire movement of the Army has been held up, right here.   Our Navy is stuck off the coast getting hit by Kamikaze attacks and losing a ship and a half a day.   Hacksaw Ridge is the key to their defences. We take Hacksaw, we get Okinawa. We get Okinawa, we take Japan.   So the sooner we get this done, the sooner we can all go home. Questions? The men are silent. CAPTAIN GLOVER (cont’d) OK.   See you on top. Everyone start to leave. CAPTAIN GLOVER (cont’d) Doss. Desmond returns.   Glover waits until they are alone. CAPTAIN GLOVER (cont’d) That damn ridge has cost us so many Americans we don’t even have an accurate count yet.   When we attack, the only hope any man has of surviving is to kill every Jap he sees without hesitation. Whatever nonsense you believe, you keep it to yourself--and do your job.   You understand me? DESMOND Yes, sir. EXT. COMPANY B LINES - 1700 HOURS The men wait nervously in their positions, checking their weapons and ammunitions.   Some men have short six foot LADDERS and heavy CLIMBING ROPES with GRAPPLING HOOKS.  3.4.13   60.  CAPTAIN GLOVER (cont'd) Over their heads, U.S. mortars and artillery shells arc in and explode on top of the Ridge. As medics, Desmond and Schecter wait the standard 10-15 feet behind the men.   They will follow the attack from this position so they can better see when someone goes down. Schecter goes over his supplies obsessively. Desmond closes his eyes and says a silent prayer.   Several of the other men notice.   Desmond whispers “Amen” and takes his New Testament from his pocket, running his fingers over its cover. Suddenly, the artillery barrage stops.   Desmond opens his eyes and nervously tucks his Bible away in his breast pocket. Captain Glover looks at his watch.   It’s time.   He hand ",
      "dialogue_count": 1,
      "word_count": 1180
    },
    {
      "scene_number": 6,
      "slugline": "EXT. CLIFF FACE - TEN MINUTES LATER Desmond hauls himself up the last few feet of rope and onto... EXT. HACKSAW RIDGE - PLATEAU LIP - CONTINUOUS The edge here is maybe fifteen feet wide and two to six feet deep.   Dotted with boulders and stumps of shattered trees, it rises up towards the plateau in a small BERM.   This tiny protected area is all the shelter the plateau offers. Captain Glover and the rest of the men are huddled behind the berm, peering cautiously over the edge. Desmond reaches them just as Glover gives the signal to move forward across the berm and onto... EXT. OPEN PLATEAU - CONTINUOUS The plateau, seemingly open, is actually crisscrossed by numerous cunningly hidden small RAVINES and GULLIES, and still smoking from the pre-assault bombardment.   There are no Japanese forces or defensive structures visible.   That doesn’t mean they aren’t there.   As Glover and his men move out into the open, all hell breaks loose. HEAVY MACHINE GUN FIRE from three cleverly camouflaged positions rakes the top of the plateau. Simultaneously, there is a shower of HAND GRENADES from individual Japanese Soldiers hidden in natural folds and man- made trenches in the ground, or popping out of camouflaged “Spider Holes.” Japanese KNEE MORTARS, 81 MM MORTARS, and even 47 MM guns launched from positions hidden in the rear of the Ridge - the “Reverse Slope” - fall among the Americans with devastating results. The Company responds with their own grenades, carbines, and BAR but the enemy is so well hidden it’s hard to find a target.   Immediately, the Company starts taking casualties. In front of Desmond, a SOLDIER takes the full blast from a Japanese mortar shell and is tossed up into the air and backwards, slamming into the ground. Desmond launches himself over the berm and runs to the downed man, ignoring the firing and explosions all around him.   The man has lost both his legs from the knees down.  3.4.13   62.",
      "characters": [],
      "action_text": "Schecter runs past Desmond and glances down at the wounded soldier.   He shakes his head. SCHECTER Waste of time! Come on! The wounded soldier grabs Desmond’s arm. WOUNDED SOLDIER Don’t leave me!   Please, God, don’t leave me! Desmond leans close to the soldier - he can’t be more than nineteen. DESMOND I’m not going anywhere!   What’s your name? Desmond quickly injects the soldier with morphine and ties a tourniquet around the stumps of his legs. WOUNDED SOLDIER S.s..s..Stevens.   Private J. Stevens. DESMOND Where you from, Private Stevens? WOUNDED SOLDIER Buffalo. DESMOND That’s near Niagara Falls, right? Always wanted to see that.   OK, I’ve got to get you off of here. Arms around my neck; hold on now! Desmond picks up the Wounded Soldier and carries him to the cliff edge.   Desmond looks down. It’s seventy feet straight down.   It didn’t seem so far climbing up but it looks like the bottom of the Grand Canyon from here. Desmond wraps a bandage around his right hand and grabs one of the climbing ropes, while he simultaneously tries to secure the soldier with his left hand. Suddenly, there is an ear-splitting ROAR, like a freight train approaching, moving down towards him.   Desmond looks up to see...  3.4.13   63. A huge JAPANESE SPIGOT MORTAR SHELL, the size of a garbage can, stuffed with twenty pounds of high explosives, arcing down directly towards him. Desmond looks around in terror.   To jump from the cliff would kill both him and his patient.   Desmond pushes the Wounded Soldier down and covers him with his own body... The shell passes within six inches of Desmond and lands at the base of the cliff -   and fails to go off!  Desmond shudders with relief. Shakily, Desmond secures the wounded Soldier, grabs the rope with his one free hand, and using his feet to slow his descent, jumps off the cliff and slides down the rope. Desmond can’t control their motion very well and the rope begins to swing, throwing them into the cliff face. Desmond tries to put himself ",
      "dialogue_count": 0,
      "word_count": 1530
    },
    {
      "scene_number": 7,
      "slugline": "EXT. BASE OF THE RIDGE - DAWN Desmond, Smitty, and Jones wait in the relative security of the foot of the cliff.   Each man ties a rope to his waist, the end of which is secured to one end of two cargo nets lashed together.   Finished, the men pick up their climbing ropes with the grappling hooks.   They’re ready. Glover notices a COMBAT PRESS team approaching. CAPTAIN GLOVER (incredulously) What do you want? COMBAT PHOTOGRAPHER For the folks back home. Glover shakes his head and nods at his three rope men. CAPTAIN GLOVER Smile pretty for the camera, fellas. Desmond, Smitty and Jones force themselves to smile for the photographer. Glover signals and his men prop three makeshift ladders up against the cliff face.   Desmond and the two others begin to climb as fast as they can while the ropes attached to them are carefully played out. The other soldiers in the unit watch in surprise and even admiration as Desmond scoots up the ladder, all the while mumbling a prayer.   He leaves Smitty and Jones struggling slowly behind. Near the top, Desmond throws his grappling hook up and secures a hold, then hoists himself, hand by hand, up over the... EXT. HACKSAW RIDGE - PLATEAU LIP - CONTINUOUS Being sure to keep his head down beneath the height of the berm, Desmond quickly removes the rope from his waist and loops it around a thick tree stump. Lying back on the ground, feet braced against the stump, Desmond pulls with all his might to hoist the cargo net up the cliff face.   By this time, both Smitty and Jones are on either side of him, pulling up their loads.   From below, Desmond can hear Glover call:  3.4.13   68.",
      "characters": [],
      "action_text": "CAPTAIN GLOVER Tie it off! Desmond wraps the line around the tree trunk one last turn for extra measure and then secures it with a knot.   He moves to the edge of the cliff and looks down. He is fearless. Below him the Photographer is clicking away.   Smitty joins Desmond, grinning and posing for the camera. SMITTY Like frickin’ Iwo Jima! CAPTAIN GLOVER Alright, ladies, get down offa there before you get your movie star asses shot to pieces. EXT. COMPANY COMMAND POST - DAY Glover lays out the refined attack plan for the squad leaders, medics, and the Combat Press Team.   On the ground in front of him, Glover has constructed a crude diagram of the plateau using twigs and stones. CAPTAIN GLOVER Company A will start the assault on the pinnacles to draw their focus and then we head up under covering mortar fire   to keep the Japs pinned down.   Soon as we’re in position, we pour in small arms fire while the Demo Squad gets close enough to toss in a satchel charge on the main bunker.   Bunker blows, we move in fast on the other two, just like we trained it.   Questions?   All right, lets-- Tex raises his hand. TEX Sir... I’d like Doss to pray for us before we go up. Glover is stunned, but no more surprised then Desmond. CAPTAIN GLOVER “Pray for us?”  3.4.13   69. TEX The Company. CAPTAIN GLOVER You gotta problem with that, Doss? DESMOND (uncomfortable) No, sir. CAPTAIN GLOVER Well - I guess it can’t hurt. EXT. BASE OF THE RIDGE - DAY Beneath the overhang, every man in Company B has assembled for the assault.   Above them, Army mortars are continuously blasting the top of the ridge. Titles:   Second Assault on Hacksaw Ridge.  Glover gestures unenthusiastically to Desmond who removes his helmet and kneels, as do Tex and some of the other men. Smitty hangs back but he watches everything closely. Desmond himself is nervous; this is not something he wants to do, or is comfortable with. DESMOND Lord.   We pray - that you give our officers here, especially Captain Glover, wisdo",
      "dialogue_count": 0,
      "word_count": 746
    },
    {
      "scene_number": 8,
      "slugline": "EXT. HACKSAW RIDGE - PLATEAU LIP - DAY Careful to stay below the berm, they crawl on their hands and knees and spread out along the edge of the cliff in good order. Desmond watches as Captain Glover quietly signals over the radio to the mortar teams below.   Almost immediately, the Mortar barrage stops. That’s the signal for Company B to attack.   As one, the men throw grenades over the berm and then rise up and begin a concentrated FIRE across the plateau. Smitty focuses his BAR on the MAIN BUNKER while... The DEMO MAN crawls out onto the plateau, beneath the bullets of his own men, carrying a twenty pound satchel charge of dynamite.   When he is within ten feet of the Main Bunker, he pulls the fuse and throws his satchel on top of the bunker. There is a tremendous EXPLOSION, blowing a hole in the Bunker roof. As the men are waiting for the dust to clear-- A SNIPER SHOT hits Schecter in the leg.   He yells once and falls.   Immediately, Desmond kneels beside him. SCHECTER Oh, man, that hurts!   How bad? Desmond looks down at Irv’s leg and sees a severe, but survivable entrance wound.   The exit wound, however, is much worse. DESMOND Million dollar wound, Irv.   You’re going home. Desmond starts to give Schecter a morphine injection. SCHECTER No--No morphine.   I’m good!   Save it for somebody who needs it. Desmond hesitates a moment, considering how tightly to wrap the tourniquet.   He glances at the wound once more and wraps a loose tourniquet around Schecter’s leg as a Stretcher Team hurries up alongside.   They pick up Schecter and carry him off; Schecter gives Desmond the thumbs up as he goes.  3.4.13   71.",
      "characters": [],
      "action_text": "Glover gestures and then leads a charge of the entire Company, yelling and screaming... Desmond hurries after his Company as they race-- ACROSS THE PLATEAU ...towards the now vulnerable bunker. Several men toss grenades into the hole.   Within the bunker, explosions shudder the ground in rapid succession.   SCREAMS echo up from inside. A soldier releases a searing blast of LIQUID FIRE from his flame-thrower into the Bunker’s gun port and the screams inside intensify. Having demolished the Main Bunker, the Company splits into TWO PRE-ASSIGNED TEAMS and each team attacks one of the two remaining bunkers with grenades, satchel charges, and flamethrowers.   The Company sweeps the Ridge - victorious. EXT. BASE OF THE RIDGE - DAY Desmond climbs down the cargo net to find a group of his fellow soldiers waiting for him.   The men smile at him and pat and touch his shoulder affectionately. SOLDIERS Heya, Doss!/Thanks, buddy!/ Way to pray./Bless you, man./You saved us! Desmond smiles tightly and nods--uncomfortable with their praise. INT. MEDIC STATION - AFTERNOON The usual chaos as overworked doctors and nurses tend to the newly wounded.   Desmond glances around and grabs a passing surgeon. DESMOND What happened to Schecter--medic in company B?   He came in just as we started the assault. The Surgeon looks at Desmond and shakes his head. DESMOND (cont’d) (stunned) He wasn’t hurt that bad!  3.4.13   72. SURGEON The tourniquet must’ve come loose, he was bleeding profusely, went into shock.   At least you gave him morphine. Desmond’s face drains. DESMOND He didn’t want any. The surgeon moves on, hurried. Desmond is devastated, guilt- ridden for letting his friend die in pain. INT. COMPANY B COMMAND POST - EVENING Captain Glover is on the radio with his superior officer, Lt. Colonel Cooney, at First Battalion HQ. CAPTAIN GLOVER Company B accomplished its objective today and we have secured a foothold on the plateau. INTERCUT AS NECESSARY-- INT. FIRST BATTALION HQ - LT. COONEY’S ",
      "dialogue_count": 0,
      "word_count": 852
    },
    {
      "scene_number": 9,
      "slugline": "EXT. BEHIND THE COMMAND POST - NIGHT Engineers are cutting SHEETS OF TIN with metal snips and bending them around empty artillery shells to make long U- SHAPED SECTIONS.   Other Engineers connect the sections into six-foot-long units using a hand punch and metal brads for fasteners.   There’s something medieval about the image, like blacksmiths preparing strange Gothic siege equipment. INT. COMPANY COMMAND POST - SAME Captain Glover’s primitive map diagram reflects the day’s success and tomorrow’s objective. CAPTAIN GLOVER Every man should take pride in what we did today.   Company B achieved something that no other unit in the 381st or the 307th has managed in the last four weeks. There are murmurs of satisfaction among the men.   Some whistle quietly, or nudge each other in approval. Only Desmond is quiet. CAPTAIN GLOVER (cont’d) It looks like we broke the back of Hacksaw’s defensive line.   However, Chief noticed a cave opening hidden behind those three pillboxes. There’s some speculation that this may lead to the heart of the Japanese fortifications. SGT. JONES It’s too big for satchel charges. CAPTAIN GLOVER Exactly.   So I’ve got Engineering building us a metal trough we can carry up in sections and assemble on top.   I figure we poke the end of the trough into that cave and pour a dozen Jerry cans of gasoline and diesel fuel down their throats-- and then throw in a phosphorus grenade or two. SGT. JONES Fry the sumbitches. The men nod, spoiling for revenge.  3.4.13   75.",
      "characters": [],
      "action_text": "CAPTAIN GLOVER Any luck, we’ll be done with Hacksaw Ridge by tomorrow afternoon and headed to the coast. EXT. THE PLATEAU - DESMOND & SMITTY’S FOXHOLE - NIGHT Both men are crouched in their foxhole, waiting for first light.   Desmond whispers... DESMOND You hear something? Smitty shakes his head but he lifts his gun.   Both men lean forward but the darkness is impenetrable. SMITTY May be just a rat. There is another SOUND now, clear to both men, off to their left.   Smitty slides a round into the chamber of his rifle. Suddenly, they are swarmed by JAPANESE SOLDIERS!   Smitty shoots one but the second soldier bayonets him in the gut. Desmond ducks a savage thrust from a third soldier and clobbers him in the side of the head with his metal helmet. Desmond tries to get to Smitty but another soldier steps between them and fires his gun so close that the heat of the blast scorches the side of Desmond’s face.   Desmond grabs the barrel and pulls the Jap soldier forward, swinging his elbow wildly into the man’s face and shattering his nose. Desmond gets hit in the back and knocked to the ground.   His fingers search blindly for any kind of weapon and he finds a broken rifle in the mud.   He staggers to his feet, swinging the rifle like a bat but a JAPANESE OFFICER steps forward, pistol extended, pointed at Desmond’s heart. Without thinking, Desmond raises his rifle but a FLARE goes off overhead, bathing the battlefield in a eerie green light and in that split-second Desmond realizes that the Japanese Officer looks weirdly familiar... He looks like -   no, he is - Desmond’s Father! Tom Doss smiles at Desmond as he pulls the trigger and the bullet tears into Desmond’s chest and... SMASH CUT TO:  3.4.13   76.",
      "dialogue_count": 0,
      "word_count": 552
    },
    {
      "scene_number": 10,
      "slugline": "EXT. HACKSAW RIDGE - PLATEAU FOXHOLE - NIGHT Desmond wakes up in a cold sweat; his heart pounding.   He is back in his foxhole on top of the Ridge at night.   Smitty sits across from him, smoking a cigarette and carefully cupping the burning ember so as not to give away their position.   Desmond breathes deeply.   Shudders. SMITTY Hell of a dream. Desmond nods.   Drinks some water from his canteen.   Rubs his stiff neck. Smitty’s rifle is propped up within easy reach and Desmond finds he can’t take his eyes off it.   Smitty notices; picks the rifle up. SMITTY (cont’d) It won’t bite, you know. DESMOND Yes, it will. Desmond takes a breath. DESMOND (cont’d) My dad was a drunk.   He fought it for years but it got ahold of him hard.   Made him mean. Desmond pauses.   And Smitty knows he’s hearing a raw story. SMITTY How mean? DESMOND He use to beat me and my brother just because the sun rose and about as often.   I could take that.   But when he laid his hand on my momma... FADE TO: EXT. DOSS HOUSE - FRONT PORCH - EVENING Bertha sits on the front step, SOBBING, one hand to her bloodied face.   Eight year old Desmond huddles beside her, protectively, one arm around her shoulder. In the yard, Tom argues violently with Bertha’s brother, UNCLE ARTHUR.   Both men are drunk and angry.  3.4.13   77.",
      "characters": [],
      "action_text": "TOM Get your damn nose out of my business!   You hear me? ARTHUR Touch my sister again, and see what happens. TOM GET OUTTA HERE! Tom swings at Arthur, catching him off-guard, but Arthur comes roaring back with a flurry of punches which drive Tom stumbling backwards.   Tom trips and falls. Arthur kicks at him but Tom grabs Arthur’s foot and brings the bigger man down.   They roll over and over across the yard, punching and gouging. Tom staggers to his feet and pulls a PISTOL out of his jacket pocket!   Bertha leaps up. BERTHA TOM!   DON’T! With no thought for her own safety, Bertha throws herself between the two men. Desmond watches from the porch, an eight-year-old boy, frozen with fear. DESMOND Momma! Tom’s hand is shaking but he continues to hold the gun out in front of him - now pointed directly at Bertha.   She moves towards Tom, her eyes never leaving his face. BERTHA Give me that gun, Tom.   Please. Give it here, before somebody gets hurt. Tom hesitates.   In the distance, there is the SOUND of an approaching Police Siren. BERTHA (cont’d) You kill him, and they’ll hang you for sure.   You know they will. Tom’s courage deserts him and he hands the gun over to Bertha.  3.4.13   78. BERTHA (cont’d) Desmond!   You take this and get rid of it somewhere.   Throw it in the river! Desmond runs over and takes the gun from Bertha. BERTHA (cont’d) Go on, now!   Hurry before the police get here! Desmond takes off running. EXT. PLATEAU FOXHOLE - RETURN TO PRESENT SMITTY You throw it away? This is very hard for Desmond; he’s never told anybody this before.   Ever. DESMOND That’s what I told my momma. SMITTY What’d you really do? DESMOND Hid it.   In the woods. SMITTY How come? EXT. DOSS HOUSE - FRONT YARD - THE PAST Desmond returns back to the house just as the POLICE load his handcuffed father into a police car in front of gawking neighbors. Bertha is weeping, hugging Tom, but he ignores her.   Over her shoulder, Tom can see Desmond, watching his father’s public shame - a",
      "dialogue_count": 0,
      "word_count": 3128
    },
    {
      "scene_number": 11,
      "slugline": "EXT. HACKSAW RIDGE - BEHIND JAPANESE LINES - SAME A member of one of the machine gun units spots Desmond and excitedly waves to his partner who rachets back the return on his weapon and sprays Desmond’s position with a quick burst. Desmond hugs the ground with everything he has.   The bullets whistle over his head, inches away. INT. CAVE WITHIN PLATEAU - SAME Simultaneously, from inside one of the Japanese underground firing positions hand carved out of the limestone, a JAPANESE SNIPER also glimpses Desmond. He carefully slides into position, his rifle poking out of a six inch wide gun port. The magnified cross-hairs of his sniper scope slide over the rocks until they settle on Desmond’s head. Desmond ducks down. The sniper takes a breath. Only a matter of time before Desmond raises his head again. EXT. HACKSAW RIDGE - PLATEAU - SAME Desmond, still focused on the machine gun position (and oblivious to the sniper now stalking him) racks his brains, trying to think of a way to get to the two wounded men. He glances at one of the dead Japanese soldiers beside him and an idea forms.   Desmond takes off his helmet and rips off the tape hiding the Red Cross symbol.   He straps his helmet on the dead Japanese Soldier and then very carefully pushes the dead man forward so that his head and trunk appear above the rock outcropping. A single shot rings out - the sniper strikes Desmond’s helmet dead center.   Desmond hadn’t expected that - the sniper - but he has the presence of mind to fling the dead soldier out from behind the rocks, to the side away from his American wounded. Both Jap machine gun emplacements rake the corpse. Simultaneously, Desmond rolls out the other side, rises to his feet and sprints like crazy while the machine gun teams reload.   Desmond swoops down, grabs the second American soldier by the collar, and drags him off.  3.4.13   89.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 329
    },
    {
      "scene_number": 12,
      "slugline": "INT. CAVE WITHIN PLATEAU - SAME The SNIPER realizes he’s been tricked but by the time he can put another round into the chamber and get his sights on Desmond, the American has disappeared.   The Sniper curses a blue streak in Japanese, and then moves to find a better vantage point. The Sniper half runs, half crawls, through a SERIES OF TUNNELS until he reaches... INT. ANOTHER GUN PORT - CAVE WITHIN PLATEAU - CONTINUOUS A dead Japanese Soldier lies slumped against the port.   The Sniper shoves him to the floor and takes his place, rifle at the ready... EXT. HACKSAW RIDGE - PLATEAU - SAME Desmond moves as fast as he can, darting from rock to rock, dragging his wounded soldier behind him.   He’s only ten yards away from the edge of the cliff. INT. GUN PORT - CAVE WITHIN PLATEAU - SAME The Sniper smiles as Desmond comes right into his sights.   He slowly squeezes the trigger and - the gun jams!   Furious, he works the rifle bolt to eject the offending shell but when he peeks again through the hole...Desmond is gone again. EXT. BASE OF THE RIDGE - COMPANY B CAMP - SAME What’s left of Company B has fallen back to a position of relative safety behind the Command Post.   The men are in a state of shock.   Some, like Tex and Hollywood, just sit and stare into space, lit cigarettes dangling uselessly from their trembling fingers.   Others weep shamelessly. Chief runs up and crouches down beside Tex and Hollywood. CHIEF DRUCKER (quietly) Desmond is still up there. TEX Doss? Hollwood’s ears perk up. HOLLYWOOD Wait.   On Hacksaw?  3.4.13   90.",
      "characters": [],
      "action_text": "Chief nods.   The three men look at one another.   They rise stiffly to their feet and head back towards Hacksaw Ridge. EXT. HACKSAW RIDGE - PLATEAU - DAY Desmond has returned to get the third soldier.   He’s deliberately approached him from yet another direction but even from here, the wounded man is still well covered by the two Japanese machine gun emplacements. Desmond inches his way through a field of American and Japanese corpses when one of the Japanese dead moans. Desmond stops and glances over at the Japanese soldier.   The man has been shot in the shoulder but he’s not bleeding badly.   Left alone, he will surely die but if bandaged, he might survive.   Desmond hesitates - then begins to crawl away towards his intended goal, the wounded American. The Japanese soldier moans again.   Desmond stops.   He can’t let him die.   Desmond moves back alongside the Japanese soldier and begins to dress his shoulder wound. INT. TUNNEL - SAME The Japanese Sniper moves from one shooting port to the next, searching for Desmond.   He stops.   Smiles.   He puts his gun up to the port and wipes the sweat off his face and then screws his eye to the sniper scope. POV SNIPER SCOPE The cross-hairs move across the landscape...and find Desmond. The cross-hairs start up toward Desmond’s forehead, but something he glimpsed confuses the sniper; he moves the crosshairs   down to the wounded soldier Desmond is tending and his Japanese insignia comes into clear focus. The sniper recoils in astonishment.   For a moment, he is bewildered.   He puts his eye back to the scope. EXT. HACKSAW RIDGE - PLATEAU - SAME Desmond wipes the Japanese soldier’s bullet wound with alcohol and sprinkles sulfa powder over it; he knows he’s exposed here and he’s working as quickly as he can.   Every second could be his last.  3.4.13   91.",
      "dialogue_count": 0,
      "word_count": 584
    },
    {
      "scene_number": 13,
      "slugline": "INT. TUNNEL - SAME The sniper lifts his eye from the scope again; what Desmond is doing has caused him to scan across the whole field of ruptured bodies, both Japanese and American.   But he’s a soldier, and whispers to himself-- SNIPER (in Japanese) What are you waiting for?! He takes a breath, lowers his eye to his scope, and takes careful aim. SERIES OF SHOTS: --He lines the cross-hairs up on Desmond’s head. --Close on sniper’s finger curling slowly around the trigger. --Close on sniper’s mouth as he gently exhales --He squeezes the trigger. --Through the scope, he sees Desmond taping the final bandage in place when a mortar shell lands between Desmond and the Sniper! The debris shatters the Sniper’s scope and blinds him.   He staggers back from the port, blood pouring down his face. Another mortar shell lands even closer and the tunnel shakes. The Sniper turns to run and a third mortar shell falls directly on his position and as he screams, the tunnel disintegrates around him, burying him alive. EXT. HACKSAW RIDGE - PLATEAU - SAME Desmond is oblivious to the fate of the sniper as mortar shells are now falling thick and fast all over the plateau. Knowing that any Japanese in the area are as much at risk from these random rounds as he is, Desmond makes a calculated decision to go for it.   He rises to his feet and sprints to the third wounded American. Desmond reaches him and pulls him up to his feet, drapes the man’s left arm around his own neck, and begins to stagger/run towards the ridge.  3.4.13   92.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 272
    },
    {
      "scene_number": 14,
      "slugline": "EXT. CLIFF EDGE - DAY Desmond has roped up the third man and just lowered him down to safety.   Desmond crouches there on his hands and knees, shaking with exhaustion. Behind him, in the distance, he hears another American voice calling for help.   Desmond closes his eyes. DESMOND (quietly) Just one more.   Please. MONTAGE A SERIES OF SHOTS as the sun moves overhead across the sky, and Desmond moves across the plateau, saving one life at a time, dragging/carrying each soldier to the edge of the cliff, roping him up and lowering him down to safety. DESMOND (V.O.) Let me get one more... FADE TO: EXT. BASE OF THE RIDGE - TWILIGHT Glover, Hollywood, Chief, Tex and dozens of soldiers from other companies watch silently as Desmond lowers one last man down from Hacksaw Ridge...but this one is already dead... We see this last man’s face...it’s Smitty.   As the body slowly descends, we realize Desmond’s last act was to retrieve Smitty’s body. And with that, Desmond finally leaves Hacksaw Ridge.   Slowly, painfully, he climbs down the rope alone. When Desmond reaches the bottom, he fights not to collapse into the arms of the men waiting at the base of the cliff. His uniform is completely soaked with blood and mud, and flies swarm around him but he’s too tired to bat them away with his torn and bleeding hands.   The men stare at him like he’s a ghost as Desmond glances down at his uniform, straining to move his head to look up again. Captain Glover is one of them. CAPTAIN GLOVER Is he wounded?  3.4.13   93.",
      "characters": [],
      "action_text": "TEX He’s not shot. DESMOND (barely audible) Sorry. CAPTAIN GLOVER For what? DESMOND I think... CAPTAIN GLOVER They’re all down, Desmond.   You got’em all. (to the others) Go him to the aid station. INT. AID STATION - TWILIGHT Everyone has heard about Desmond’s heroics.   The surgeons, stretcher teams, and nurses all watch silently as Desmond changes his bloody uniform for a replacement uniform - a washed and bleached uniform of a dead soldier. Carefully, he removes his pocket Bible, taking a moment to try and wipe off the blood that stains its front cover. Something on the blouse he’s about to put on catches his eye. The lettering is faded but it looks like... ”Schecter.”  For just a moment, everything swims in front of his eyes. EXT. DESMOND’S FOXHOLE, BELOW THE RIDGE - NIGHT Raining.   Along with the usual sporadic Japanese mortar fire. Desmond sits - alone - in the dugout he once shared with Smitty.   Tex scurries up out of the dark.   He puts a can of K- rations down in front of Desmond. DESMOND What’s this? JOSH “TEX” ROYAL (quietly) Peaches.   Never liked’em all that much. Tex leaves.   A moment later, Hollywood comes over and sets down another rare can of non-meat K rations.  3.4.13   94. HOLLYWOOD Here.   I’m full. From all over, Company B survivors come up to Desmond, one by one, and silently lay cans of non-meat food in front of him and then disappear into the dark.   Desmond stares at the pile of food. FADE TO: INT. COMPANY COMMAND POST - SAME It is a very subdued meeting of a much reduced leadership team.   The men are exhausted; completely worn out mentally and physically. CAPTAIN GLOVER (barely audible) Okay. (louder) Okay.   Word is...word from HQ is, we gotta go back up on Hacksaw tomorrow.   And we gotta take it, this time. The men are silent, close to mutiny.   In the rear, someone groans. CAPTAIN GLOVER (cont’d) I know, I know.   Look, they know what we’re up against and they’ve promised us a full company of reinforcements, and a massive bombardme",
      "dialogue_count": 0,
      "word_count": 910
    },
    {
      "scene_number": 15,
      "slugline": "EXT. HACKSAW RIDGE - DAY Explosion after explosion tears into the Ridge from a variety of American guns:   mortars, howitzers, off-shore Naval batteries and Army rockets.   Marine F4U Corsairs bomb and strafe the rugged terrain.   Occasionally, a secondary explosion indicates some lucky round has found its mark - an ammunition or fuel dump. Titles:   Hacksaw Ridge.   Third Assault.  Smoke, dust, and debris rise into the air in a dark cloud lit with flame as if the Ridge were an erupting volcano. EXT. ASSEMBLY POINT BENEATH THE CLIFF - SAME The men of Company B - resigned veterans and nervous replacements - wait in their pre-assault positions.   But their focus is not on the Ridge.   They are all looking backwards, toward the rear of the line. INT. COMPANY COMMAND POST - SAME Glover smokes a last cigarette while he gets an earful from HQ over the Company field telephone. INTERCUT AS NECESSARY-- INT. FIRST BATTALION HQ - LT. COONEY’S OFFICE - DAY LT. COLONEL COONEY (ON PHONE) What the hell is your delay, Captain?!   You were supposed to begin that assault ten minutes ago! The entire 307th Infantry and the whole 7th Fleet is cooling its heels for you! CAPTAIN GLOVER We’re waiting, sir. LT. COLONEL COONEY Waiting for what?! Captain Glover glances towards the rear of the line where in the distance, a long figure kneels. CAPTAIN GLOVER We’re waiting for Private Doss to finish praying.  3.4.13   97.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 239
    },
    {
      "scene_number": 16,
      "slugline": "EXT. ASSEMBLY POINT BENEATH THE CLIFF - SAME On his knees, Dorothy’s Bible in his hands.   The strain and horror of the last ten days is etched in his face. Haltingly, Desmond tries to work this out with his God. DESMOND (quietly) I’ve done my best to...to be faithful to you, and the promises I made.   I gotta...break one of those promises now and I’m asking your forgiveness. It may be a wrong thing but I can’t let my men go up there alone.   And if that is a sin then I take it on my heart, alone. Amen. Chief nudges Hollywood and points to where Desmond Doss is walking towards them. INT. COMPANY B COMMAND POST - SAME Captain Glover sees Desmond coming, rejoining the line. CAPTAIN GLOVER (into field telephone) Company B is ready to go, sir. EXT. ASSEMBLY POINT BENEATH THE CLIFF - MOMENTS LATER Above them, the bombardment suddenly stops.   The SILENCE is deafening.   Every man left in Company B - including Desmond - is ready.   On their faces, each and every one, is a fierce look of quiet determination. Captain Glover looks to Desmond.   Desmond nods. DESMOND (quietly) Let’s go. Glover leads his men climbing up the cargo nets.   Desmond follows behind. BELOW THE LIP OF THE PLATEAU Glover and his group leaders hang for a moment on the cargo nets as they pull grenades out of their pockets.   They yank the pins and lob the grenades over their heads onto the plateau.  3.4.13   98.",
      "characters": [],
      "action_text": "As soon as the grenades begin exploding, Glover and the men are climbing as fast as they can. EXT. HACKSAW RIDGE - PLATEAU LIP - CONTINUOUS Glover leads his men in a wild charge up and over the edge of the cliff and onto.... EXT. HACKSAW RIDGE - THE PLATEAU - CONTINUOUS The men of Company B quickly sweep past the stunned Japanese positions and overwhelm the few defenders unlucky enough to be caught above ground.   The Americans push on towards the southern edge of the plateau and... THE BIG CAVE OPENING The ASSAULT TEAMS move with grim efficiency.   Riflemen throw smoke grenades, shielding their work from the Japanese mortar squads on the southern hills. BAR Squads keep the defenders pinned down within the cave complex entrance... EXPLOSIVE TEAMS inch forward under fire to throw their satchel charges inside. As soon as the explosions erupt, Glover sends in the FLAME- THROWER TEAMS who douse the opening with long searing plumes of fire. Following them, Chief, Tex, and Hollywood run up with opened JERRY CANS OF GASOLINE, one after another, which they throw into the mouth of the cave and the shaft below. Glover edges close to the entrance and throws in two phosphorus grenades igniting an ENORMOUS EXPLOSION that can only mean that somewhere inside, a major ammo dump has caught fire. Suddenly, the entire ridge SHAKES like an earthquake. SMOKE billows out, not just through the cave entrance but through dozens and dozens of different SNIPER HOLES and cunningly hidden ASSAULT ENTRANCES scattered all over. Tasting blood, Company B sweeps past the Big Cave entrance SCREAMING with battle lust and moves down...  3.4.13   99. THE REVERSE SLOPE A tide of lethal efficiency sweeping everything before it.  Hacksaw Ridge is finally falling. EXT. THE REVERSE SLOPE - LATER THAT AFTERNOON Desmond follows Tex, Chief, and Hollywood as they continue to secure the southern flank of the Ridge. Suddenly, to their left, a JAPANESE SOLDIER rises from his spider hole, pistol in one hand and gren",
      "dialogue_count": 0,
      "word_count": 1761
    }
  ]
}