{
  "slug": "hail-caesar-2016",
  "title": "hail caesar",
  "genre": "comedy",
  "format": "film",
  "scenes_count": 7,
  "characters_count": 0,
  "characters": [],
  "total_words": 18046,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. LINEN TRUCK - DAY  BLACK  Baird Whitlock’s head lolls in the foreground, waggling with  the motion of the vehicle. His body——he is still in wardrobe,  leather skirt and a breastplate over his white  tunic——stretches away into the background: he is laid out,  unconscious, on a paddy-wagon style bench. At the end of the  bench in the background we see, cropped and soft, a goon in a  double-breasted suit, his forearms on his knees, smoking.  EXT. HOLLYWOOD BLVD - DAY  THE STREET  Hollywood Boulevard. The truck roars by. Its paneled side  says “Al’s Linens.”  EXT. STUDIO GATE - DAY  Hobie Doyle is pulling up in a chauffeured car. The guard  looks in the back window and is surprised to see the Western  star.  GUARD  How ya doing, Hobie.  HOBIE  Lo there, Scotty.  GUARD  They got you shooting on the lot?  HOBIE  Wul, Mr. Mannix pulled me off the  Western, says I’m doin’ a movie on  a soundstage. They built a drawing  room.  GUARD  Ya don’t say.  INT. STAGE / TANK - DAY  UNDER WATER  A bathing beauty in a sequined mermaid suit swims free-armed  but wriggle-tailed, constrained by her fake nether-parts.  From our underwater perspective we hear burbling music.  24.",
      "characters": [],
      "action_text": "After a beat of her swimming solo many bodies shoot down into  the water to join the mermaid, entering foreground and  background in headfirst dives that leave bubble-trails. The  beauties swim loops and then wave themselves back up toward  the surface, smiling.  But the mermaid remains.   She approaches a foreground sunken  treasure chest.   Atop its gold coins sits a silver crown  which the mermaid seems to recognize as her own.   She reaches  for it, smiling-but as she does so a shadow travels over her,  near-to-deep.   And then great jaws hinge closed behind her,  capturing her-and the lens-in the black belly of a whale.  We linger in black.   Water surface slowly emerges from the  black: we are high above the water now, looking straight  down.   With our change in perspective the music now blares  undistorted.  In the tank below us the bathing beauties spin in a formation  that goes through constant kaleidoscopic change.   In   the  center of the circle formed by the beauties a dark shape  begins to resolve itself: something is surfacing amid the  girls.  It is the whale.   As it breaches amid the swimmers its  blowhole, directly beneath the lens, spouts.   Jetting water  rises toward us.  Something else is rising, borne up by the jetting water: a  sundae-cup coach of sorts.   In it rides the mermaid,  triumphantly ascending.  Her ascent ends high, high, high above the tank.   The  spouting water recedes but her sundae cup remains magically  suspended in air.  She opens the cup's gate-door and looks down at the water,  far, far below.   As a drum roll builds she prepares to dive.  And does dive.  She splashes into the water and is lost from view.   A  suspenseful hold, on nothing.  And now she emerges from the water, rising again, now on a  pedestal and now wearing her silver crown, recovered in what  offscreen neptunian rite who can say.  The mermaid is proud of herself, proud of her crown, proud of  her bathing-beauty minions-but then pride evaporates.   Some",
      "dialogue_count": 0,
      "word_count": 1124
    },
    {
      "scene_number": 2,
      "slugline": "INT. STAGE / DRAWING ROOM - DAY  People in formal-wear lounge, chatting.  Hobie Doyle enters stiffly in a tuxedo. He tugs at his  collar.  A distinguished-looking man, middle-aged, well dressed but  not in wardrobe, hastens to greet Hobie. He is the director,  Laurence Laurentz.  LAURENCE LAURENTZ  My dear boy, you look wonderful,  how do you feel?  HOBIE  Well this here collar is a little  tight.  LAURENCE LAURENTZ  No no, nicely fit, looks a marvel,  just takes a little getting used  to. Now you enter here, Hobie,  having just seen Biff’s valise in  the foyer——in spite of Allegra’s  claim that he hasn’t been to the  house.  HOBIE  I’m sweet on Allegra.  LAURENCE LAURENTZ  Indeed you are.  HOBIE  But I seen Biff’s grip.  LAURENCE LAURENTZ  Indeed you have. And so here we  find you haunted by unspoken  suspicions.  HOBIE  Haunted. By Biff’s grip.  LAURENCE LAURENTZ  By his valise, yes, but then here  is Dierdre,  (indicates actress on  couch who coldly examines  Hobie —— a veteran with no  patience for the rookies)  ... harboring deep feelings for  you , and sensing opportunity.  29.",
      "characters": [],
      "action_text": "HOBIE  Dierdre.  LAURENCE LAURENTZ  Dierdre, yes. So at her  importuning, you join her on the  couch, and conversation ensues.  Hobie is concerned.  HOBIE  (troubled)  So now she’s gonna   importune , Mr.  Laurence?  LAURENCE LAURENTZ  Lau rentz .  HOBIE  Oh, I’m sorry. She’s gonna  importune? Is that somethin’ I  should, uh, be concerned about——  LAURENCE LAURENTZ  She’ll simply ask you to join her  on the couch, is all I mean to say,  and conversation ensues.  HOBIE  Okay, I gotcha.  LAURENCE LAURENTZ  Very good, very good, let’s try one  shall we?  HOBIE  Sure, I’ll give her a go.  LAURENCE LAURENTZ  Wonderful, splendid.  (turns away but turns back  with a thought)  The only thing I would suggest is,  before your first line, you respond  to   her   line with a mirthless  chuckle.  HOBIE  A mirthless chuckle.  LAURENCE LAURENTZ  Yes, given your unspoken suspicions  about Allegra, a mirthless chuckle.  30. HOBIE  Okay, Mr. Laurence, I’ll give it  a——  LAURENCE LAURENTZ  Laur entz .  HOBIE  Oh, gosh, I’m sorry, Mr. Laurentz.  I’ll give it a shot.  THROUGH FILM  A clapper-boy ID’s and whacks a slate on “Merrily We Dance.”  Laurence Laurentz’s voice calls “Action!”  Those assembled in the parlor come to life in a pantomime of  civilized conviviality, chatting and laughing.  Hobie enters, an uneasy backward glance referring perhaps to  the unseen grip.  DIERDRE  Oh, Monty! Come join me on the  divan!  Briefest who-me confusion from Hobie. With a quick recovery  he manages a fairly casual saunter to the couch where he  plants himself——not close to Dierdre. She slides over to  close the gap between them, and she is now all warmth and  sympathy. Her voice is musical and upper-crust:  DIERDRE (CONT’D)  It seems Allegra's a no-show, which  is   simply   a   bore , but I can partner  you in bridge.  ( reacting to him )  Why the pout?  Gazing at the floor, Hobie gives a short loud laugh that  sounds like a Heimlich-expulsion. A flinch from the actress.  Hobie’s grin abruptly ",
      "dialogue_count": 0,
      "word_count": 9782
    },
    {
      "scene_number": 3,
      "slugline": "EXT. A SPANISH-STYLE HOME - EVENING  Glowing in the early evening.  Reverse on its drive. Hobie Doyle leans against a parked limo  with his arms folded, waiting, gazing at the mansion. A long,  still beat, and then he abruptly sflffs a bunch of sunflower  shells out of his mouth.  He gazes idly around.  He has a thought.  He opens the back door of the limo and takes out a length of  rope.  He starts twirling, creating a nice big loop. He expertly  tips his wrist to make the loop spin level with the ground at  a height of half a foot. He hops in and out of the loop.  VOICE  Hello Hobie.  Startled, he muffs a hop-out and the rope dies against his  shins.  HOBIE  Oh hello Carlotta.  CARLOTTA  Am I late?  He coils the rope.  HOBIE  Aw no it ain’t nothin’. Thanks an  awful bunch for goin’ to this  picture with me, I don’t know if  you like livestock but I think it’s  got moments I really do. You look  var purty.  CARLOTTA  Well, thank you, Hobie. I’m sure  I’ll like the picture——I like all  of your pictures.  HOBIE  Well I like yours too, they are  just the craziest things. Is it  hard to dance with all them bananas  on your head?  81.",
      "characters": [],
      "action_text": "She plants her purse on her head as she demonstrates a rhumba  move:  CARLOTTA  Oh no, anyone can do it, is all  inna hips anna-lips anna-eyes anna-  thighs!  She finishes with a kick and a head-tip that launches the  purse backwards off her head to be grabbed by one hand behind  her back.  INT. MANNIX’S KIDS’ BEDROOM - NIGHT  We hear a door opening and hallway light fans onto an  adorable little girl asleep in bed.  Eddie looks down at her, smiles, stoops to adjust the doll  she holds against her face. He rises to gaze down for another  beat, then moves.  The opposite bed: an adorable little boy. Eddie eases the  askew coonskin cap off of the boy, stands looking down.  Top of the boy’s wardrobe. Baseball pennants are on the wall  behind it. Eddie’s hands enter to place a soaring airplane on  a peg on a pedestal.  Top of the girl’s wardrobe. Dolls are seated on it leaning  against the wall. Eddie’s hands enter to place a folded  maroon uniform, and, on top of the uniform, a maroon cap with  “Stewardess” stiched in gold.  INT. MANNIX’S KITCHEN - NIGHT  Eddie is at a plateful of dinner. His wife bustles as he  eats.  MRS. MANNIX  Little Eddie wanted me to tell you  about his baseball game. They won.  EDDIE  That’s terrific. Gosh, I never  called the coach! Eddie played at  shortstop?  MRS. MANNIX  Mm, and he did so well he wants to  stay there now.  82. EDDIE  Great, it took care of itself.  MRS. MANNIX  And Darlene did very well on her  Spanish test.  EDDIE  That’s good, she was worried about  that. Thanks for heating up the  roast.  MRS. MANNIX  Warm glass of milk?  EDDIE  No, thanks hon——coffee. Gotta run  back to the studio, a few things to  take care of.  MRS. MANNIX  Gee, another late night.  Eddie is ruminative:  EDDIE  Mm. You know... Lockheed improved  their offer. Darned good money. And  the hours wouldn’t be crazy like  this, either.  MRS. MANNIX  It’s nice to be wanted.  EDDIE  Yeah, sure, but——what do you think?  They wanna know tomorrow.  MRS. MANNIX  I ",
      "dialogue_count": 0,
      "word_count": 1492
    },
    {
      "scene_number": 4,
      "slugline": "INT. JOE SILVERMAN’S OFFICE - NIGHT  Eddie taps at the door.  It is opened by Sid Sieglestein, the studio lawyer. An inner-  office door, standing open, shows Joe Silverman sitting at  his desk; mid-thirties and, like his office, low-rent but  neat and utterly without character.  DeeAnna Moran sits across from him in a cream-colored dress  that matches her car outside, and a black hat and veil. She  has a cigarette in one hand and with the other signs a  document in multiple places as Joe, leaning across the desk,  turns pages and points.  SID  We just got started——I’ve been  taking DeeAnna through this.  They are joining the two in the inner office, Sid now  addressing DeeAnna.  ... So Joseph has done——well, just  a whole lot of good work for us in  the past. Whenever we’ve needed a  witness or a third party for, I  don’t know——a petition of grievance  or alienation of affection.  DeeAnna sneaks looks at Joe as she signs pages.  DEEANNA  And he’s reliable?  The man shows no resentment of the question and indeed no  affect at all:  JOE  I’m bonded, miss.  SID  Joe is the most reliable human  being on the planet, in our  experience. When Chubby Cregar was  intoxicated and hit a pedestrian on  Gower, we had his vehicle title  transferred to Joe’s name and Joe  did six months in the LA County  lock-up.  DEEANNA  But you’re off the sauce now?  88.",
      "characters": [],
      "action_text": "JOE  I never touch it, miss. It was a  legal fiction.  EDDIE  That’s exactly right. When the  studio needs somebody who meets the  legal standard of, uh——how did you  put it, Sid?  SID  Personhood.  EDDIE  Yeah. Joe steps in and acts as the,  uh... person.  DEEANNA  So you’re a professional——p erson ?  JOE  That’s right, miss. And initial  here, and here.  SID  Joe will be the foster parent until  such time as you adopt the child,  which you can do as soon as Joe  takes possession of it.  DEEANNA  And he’s reliable?  JOE  I’m bonded, miss.  SID  The release papers you’re signing  are not public record. All these  documents remain sealed until the  year two thousand and fifteen.  Joe takes the document and slides its last page into an  embosser and squeezes.  DEEANNA  No one the wiser?  SID  No one the wiser. No fans, no court  officials——not even a notary  public.  89. EDDIE  Joe himself is the notary.  DeeAnna examines Joe who is tensed, squeezing with both  hands.  DEEANNA  You must have strong forearms. Is  it hard, squeezing like that?  JOE  It’s part of the job.  EXT. STUDIO GATE - NIGHT  Scotty the guard leans out, tipping his cap, as the Packard  pulls up.  SCOTTY  Late night, Mr. Mannix?  EDDIE  Late night for both of us. Will you  call Projection Seven and have’m  lace up yesterday’s dailies on  “Hail, Cæsar!”  SCOTTY  Sure thing.   Yesterday’s .  EDDIE  Yeah, thanks Scotty.  INT. SCREENING ROOM - NIGHT  Eddie Mannix sits slumped, hand cupped to forehead, light  flickering onto him from the screen. Natalie sits on his far  side with her clipboard, waiting for his attention.  EXT. WELL OF JEHOSAPHAT SET - DAY  Onscreen: we pull Baird Whitlock, in his Roman tribune's  wardrobe, as he marches angrily up a line of parched and  dusty slaves clamoring for water. Baird curses and exclaims  “Romans before slaves!” as he bats aside those waiting.  As he reaches the front of the line our pull back has brought  into frame the man giving out water with a dipper. This m",
      "dialogue_count": 0,
      "word_count": 3195
    },
    {
      "scene_number": 5,
      "slugline": "INT. HOBIE’S CAR - NIGHT  HOBIE AND BAIRD  In Hobie’s car they make the right turn from the beach access  road to head south on the coast highway. Hobie hums “Lazy Ol’  Moon” as he drives; Baird gazes placidly out.  Baird is struck by a thought. He looks at his watch, winces.  BAIRD  Late. I am in the doghouse.  Hobie glances at him as Baird thinks.  BAIRD (CONT’D)  Know what, better forget my place.  Drop me at the Beverly Hills  Hotel——that okay?  HOBIE  Sure.  Both men look, attention drawn by sirens: an oncoming line of  police vehicles, their rooflights spinning.  The cars whoosh past.  Baird turns to track them and Hobie looks in his rear-view.  The vehicles skid into a left turn at the “Fish Shack” sign.  Baird faces forward again.  A beat.  BAIRD  Huh!  FADE OUT  FADE IN SOUND: Morning birds, intermittent car-bys.  EXT. STUDIO GATE - MORNING  FADE IN PICTURE: Studio gate.  We are looking across the street at the main gate. There is  little traffic at this early hour. A cab pulls up and stops  curbside. Its passenger gets out.  103.",
      "characters": [],
      "action_text": "The cab pulls away and we see the discharged passenger: Baird  Whitlock. Still in breastplate and leather skirt, he saunters  toward the walk-through by the guard shack, whistling.  EXT. ROAD TO CAVALRY - DAY  We track laterally with an Assistant Director who, intent on  a clipboard, slowly walks past a foreground crucifix, the  occupant of which, facing away from us, is in frame only to  the extent of his two crossed feet. The A.D., still studying  his clipboard, slows to a halt just as we bring another  crucifix into the foreground. Its occupant too we see only  from the ankles down.  The A.D. now looks up from the list on his clipboard to the  unseen man on the foreground crucifix.  A.D.  Who’re you?  VOICE  Todd.  The A.D. looks down his list. He shakes his head, still  unclear; he looks back up.  A.D.  Do you get a hot breakfast or a box  breakfast?  VOICE  I don’t know.  The A.D. rolls his eyes.  A.D.  Are you a principal or an extra?  Beat. Then:  VOICE  I think I’m a principal.  INT. EDDIE’S OFFICE - DAY  Baird, in wardrobe, is in the chair in front of Eddie’s desk  with his legs crossed, hands clasped behind his head, the  picture of cheerfulness.  104. BAIRD  So I’m thinkin’, “What the hell!  I’ve woken up in strange houses  before but never without a broad  next to me!”  Eddie glares.  EDDIE  (tight)  Uh-huh.  Baird, oblivious, thinks he has an audience.  BAIRD  These guys were pretty interesting,  though. They’ve actually figured  out the laws that dictate,  well—— everything , history,  sociology, politics, morality.  Everything. It's all in a book  called “Kapital.”  EDDIE  That right.  BAIRD  Uh-huh. With a K. And you’re not  gonna believe this, but it even  explains the stuff we do here at  the studio. Because the studio is  actually nothing more than an  instrument of capitalism!  EDDIE  Uh-huh.  BAIRD  So it blindly follows these laws  just like any other institution,  the laws that these guys’ve figured  out. The studio makes pictures to  serve th",
      "dialogue_count": 0,
      "word_count": 1521
    },
    {
      "scene_number": 6,
      "slugline": "INT. CONFESSIONAL - DAY  Light wipes onto Eddie, rosary in hand.  EDDIE  Bless me, Father, for I have  sinned.  VOICE  How long since your last  confession, my son?  EDDIE  It’s been, uh...  (looks at watch)  What, twenty-seven hours?  VOICE  It’s too often, my son. You’re  really not that bad.  Eddie grimly shakes his head.  EDDIE  I don’t know, Father. I snuck  another cigarette. Or two. I didn’t  make it home in time for dinner.  And I, uh... I struck a movie star  in anger.  A sigh from the unseen priest.  VOICE  All right. Five Hail Marys.  EDDIE  Okay. Okay. Father...  Eddie is struggling.  VOICE  Yes my son?  EDDIE  May I ask you something, Father?  FATHER  Of course, my son.  EDDIE  If there’s something that’s   easy ...  is that   wrong ?  111.",
      "characters": [],
      "action_text": "VOICE  Easy?  EDDIE  Easy to do, easy to——an easy  job——not a   bad   job, it’s not bad.  But then there’s another job,  that’s... that’s not so easy. In  fact it’s hard. It’s so hard,  Father, sometimes I don’t know if I  can keep doing it. But it seems  right . I don’t know how to explain.  Silence.  Then:  VOICE  God wants us to do what’s right.  EDDIE  Yeah...  (thinking, nodding)  Yeah, course He does.  VOICE  The inner voice that tells you it’s  right——it comes from God, my son.  Eddie glances at his watch again.  EDDIE  Yeah, got it.  VOICE  It’s His way of saying that——  EDDIE  (rising)  Yeah yeah, I got it.  EXT. CALVARY - DAY  Autolochus is gazing up and off-camera as we pull him through  a crowd of Israelites, his face transfigured in wonderment.  As he reaches the front of the crowd he sinks to his knees.  The camera pulls up and away to frame him before three  crucifixes on the mount.  Gracchus, familiar from our epic’s first scene, approaches.  112. GRACCHUS  Why on your knees before this  Hebrew, Autolochus?  Baird rises, turning his attention to his friend and placing  a comradely hand on his shoulder.  AUTOLOCHUS  I encountered him before, Gracchus,  beside the well of Jehosaphat. And  what manner of man!  Gracchus doesn’t understand:  GRACCHUS  He is a priest of the Israelites,  despised even by the other priests.  AUTOLOCHUS  No. On yesterday’s march, punished  by the dust of the road, I sought  to drink first at the well——before  the slaves in my charge, whose  thirst was greater than my own.  GRACCHUS  (uncomprehending)  A Roman drinks before a slave.  AUTOLOCHUS  This man was giving water to all.  He saw no Romans, no slaves. He saw  only men——weak men——and gave  succour. He saw suffering, which he  sought to ease. He saw sin, and  gave love.  GRACCHUS  “Love,” Autolochus?  AUTOLOCHUS  He saw my own sin, and greed, and  thirst, Gracchus.   But in his eyes  I saw no shadow of reproach.   I saw  only light.   The light of God.  GRACCHUS  You mean",
      "dialogue_count": 0,
      "word_count": 675
    },
    {
      "scene_number": 7,
      "slugline": "EXT. CAPITOL LOT - DAY  EDDIE MANNIX AND NATALIE  They stride across the lot, Natalie following Eddie with her  notepad as at the beginning of the movie.  NATALIE  Gloria DeLamour checked herself out  of Our Lady of Perpetual Rest and  showed up for work in good shape.  EDDIE  Nn.  NATALIE  Still raining in Gallup, New  Mexico, and the “Tucumcari!” crew  has shot all the plates we need for  “Came the Rain.”  EDDIE  Then——just shoot the showdown in  the weather and we’ll retitle it  “Tucumcari Tempest” “Desert Squall”  “Hold Back the Storm”...  He momentarily casts about.  VOICE-OVER  The stories begin. The stories end.  EDDIE  I dunno——bounce it off the writers.  VOICE-OVER  So it has been.  NATALIE  Check. Here’s today’s call list.  She hands a sheet forward. He studies it, hands it back.  EDDIE  Add a call to a Mr. Cuddahy at the  Lockheed Corporation.  NATALIE  Long call, short?  EDDIE  “Thanks but no thanks”——how long  was that?  115.",
      "characters": [],
      "action_text": "VOICE-OVER  But the story of Eddie Mannix——  NATALIE  Check. Who do we call first?  VOICE-OVER  ——will never end.  Eddie pushes back a sleeve to look at his watch.  EDDIE  New York first. Time to check in  with Mr. Schenk.  VOICE-OVER  For his is a tale written... in  light everlasting.  As they head up the walk to the administration building we  boom up to bring into view the skyline of the lot beyond. In  the middle distance is the Capitol Pictures water tower, one  word painted on its face: BEHOLD.  A slanting sun, hidden by clouds, sends down golden beams.  116.",
      "dialogue_count": 0,
      "word_count": 257
    }
  ]
}