{
  "slug": "halt-and-catch-fire-101-breaking-big-blue-2014",
  "title": "halt and catch fire 101 breaking big blue",
  "genre": "thriller",
  "format": "series",
  "scenes_count": 4,
  "characters_count": 1,
  "characters": [
    "YOUNG GIRL"
  ],
  "total_words": 11405,
  "total_dialogue": 1,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. NEW ORCHARD ROAD -- LATER The Audi ROARS past the company entrance sign: IBM. CUT TO: EXT. RURAL NEW YORK HIGHWAY -- LATER The GROWING ROAR of the Audi. It appears, rockets down a two- line asphalt in a matter of seconds, kicking up dead leaves. INT. AUDI QUATTRO -- CONTINUOUS ANGLE ON MacMillan’s hand, pulling the floor shifter down into fourth gear, the road’s reflection in his glasses. CUT TO: EXT. COASTAL HIGHWAY -- LATER The Audi traverses a wooded lane that opens onto the rocky coast of the Atlantic Ocean. Going faster. INT. AUDI QUATTRO -- CONTINUOUS MacMillan is blank as he throws the car into fifth. The blur of water stretches to the horizon outside his window. THROUGH THE WINDSHIELD, an approaching hard bank turn. Nothing but guard rail. Not a problem at normal speed. ANGLE ON the speedometer climbing... EXT. COASTAL HIGHWAY -- CONTINUOUS The Audi SMASHES through the guard rail somewhere around 110. A direct hit. No swerve. Intentional. The rail gives like paper and the Audi is now a missile being shot out over the white water of the coastline. It sails high, engine REVVED and floored before... THE FRONT END HITS THE WATERLINE LIKE A BRICK WALL DESTROYING half of the car with a THUNDER CLAP. A few seconds pass before lapping waves begin to fold around the vehicle and its driver. No movement within. Completely arrested. END TEASER  2.",
      "characters": [
        "YOUNG GIRL"
      ],
      "action_text": "ACT I INT. HONKY TONK BAR -- NIGHT SUPER: TEN MONTHS LATER An honest to God COWBOY drops in a quarter, makes his punch button selections on a jukebox. Two seconds pass until the machine lets loose with STEEL GUITAR and MERLE HAGGARD. The cowboy takes his mug of beer from atop the juke and actually   moseys   through a late night crowd of legitimate and gregarious country western folk spanning generations. ANGLE ON the bar itself, tracking across its patrons--all tough men in hats, jeans--ladies with perms, chewing gum, heavy eyeshadow. THE LAST MAN AT THE BAR sticks out like a sore thumb. He isn’t country; hell, he ain’t much of anything. Ragged hair, big glasses, thick unkempt mustache. Lots of empty mugs. This is GORDON CLARK (31). CLARK (to bartender) Can I get another Shiner? A fresh mug of beer slides his way but it doesn’t seem to cheer him up any. A YOUNG BUCK (early 20’s) sallies up next to him, square head in a wide-brimmed hat. YOUNG BUCK (calling back) HEY, WHATCHOO WANT? A chubby YOUNG GIRL (same age) appears next to him, jostling Clark as she squeezes in. YOUNG GIRL (thick accent) I dunno, gimme a beer or somethin’. The young buck holds up two fingers for the bartender. Then glances over at Clark. He has to talk over the music: YOUNG BUCK You down an’ out, friend? CLARK Guess you could say that.  3. I’m sad because right now I’d rather be in Northern California living the sweet life, as opposed to sitting in some Hee Haw rerun. (pause) No offense. I’m having a bad night. YOUNG GIRL California! Ain’t Reagan from California? That’s one good thing come out of the Left Coast. CLARK Reagan? You know he opposed equal rights for women, right? That’s real enlightened. (swigs beer, to girl) You are a woman, aren’t you? The young buck’s face drops, as does the girl’s. Clark takes another gulp of beer as the buck steps toward him, ready. YOUNG BUCK You wanna apologize to the lady? CLARK Would it make a difference? The buck seizes Clark by the shirt, pulls him to h",
      "dialogue_count": 1,
      "word_count": 2030
    },
    {
      "scene_number": 2,
      "slugline": "INT. CLARK’S GARAGE -- MOMENTS LATER ANGLE ON a record player, sitting atop a 1970s receiver with a blue lit-up dash. Nothing digital here as the needle hits the groove on Supertramp’s “Crime of the Century.” “BLOODY WELL RIGHT” LOUDLY PLAYS THROUGH THE SPEAKERS ANGLE ON Clark as he cracks a beer and lets loud stoner rock wash over him. He closes his eyes... ANGLE ON the garage space. The family cars never come in here. This is a Silicon Valley DIY workshop right out of 1975. A sanctuary and homage to the life Clark once led. Mixed in with the landscaping tools and power drills are pristine circuit boards, monitors, monstrosities of electronics. Apple II’s, Atari 2600’s, Altairs, TI-99’s in various states of functionality, assembly. The MUSIC continues as we... CUT TO: INT. MACMILLAN’S CONDO -- LATE NIGHT Sleek, all-business housing of the new Reagan-era. This unit is sprawling, but has hardly any furniture. A handful of cardboard moving boxes lie on the floor unopened. A tube TV on the floor has silver-haired Johnny Carson on mute. ANGLE ON one moving box as MacMillan--in suit pants and a white undershirt--rips open the top. He pulls out a back issue of   Byte   magazine. CLOSE ON the vicious scars down his left arm. Far worse than the superficial glance near his eye. INTERCUT -- MACMILLAN’S CONDO / CLARK’S GARAGE -- Clark sits at a fold-out card table, working on an original Apple I hooked to an old tube TV... -- ANGLE ON the screen, almost all the light in the room coming from the glow of BASIC as it scrawls across the screen, Clark rapidly typing out the programming language... -- ANGLE ON MacMillan sitting at small table eating a peanut butter and jelly sandwich, drinking a glass of milk as he reads under a single overhead light,   Byte   next to him... -- LATER, Clark pulls apart a Commodore computer box in his lap, his face betraying the joy of a kid opening a Christmas present...  12.",
      "characters": [],
      "action_text": "-- CLOSER ON the article MacMillan reads. Entitled: IBM’S TROJAN HORSE: HOW OPEN ARCHITECTURE WILL UNDO BIG BLUE The phone RINGS. A cordless plugged in on the floor. MacMillan looks up. Goes to it, answers. MACMILLAN Hello? (long pause) Yes, I cancelled the prescriptions. (long pause) Because I don’t need them anymore. -- ANGLE ON a big brimming tool box as Clark looks for just the right screwdriver. He checks a few drawers, finds one, then finds a rolled-up bag of choice pot... -- ANGLE ON MacMillan as he hangs up. Returns to the table. Stares off for a moment. Then comes back to the magazine. -- ANGLE ON Clark now grooving more easily to the music as he furiously types more lines of BASIC into the Apple I... -- ANGLE ON Donna, reading in bed. She puts her book on the night stand, turns the lamp off. The digital clock reads 1:35 a.m. She rolls over. No one there. Only MUFFLED SUPERTRAMP still coming from the garage. -- ANGLE ON MacMillan as he continues to read. CLOSER ON the magazine byline. MacMillan takes a red pen and underlines the name until the paper grows wet and soft with ink. It reads... “By Gordon Clark.” END ACT I  13. ACT II INT. CARDIFF GIANT OFFICES -- DAY Fluorescent lights, cubicles, retro colors. Just like the  Post   in All the President’s Men, The Daily Planet in Donner’s Superman. ANGLE ON Clark at the break counter. He’s wearing the same shirt, tie, pants as last night. Looking like he just rolled out of bed. He pours WAY too much sugar into his coffee. AL KOWALSKI (45) nears--a man who’s parked it in management, a bit bloated from booze and food and glory days. AL Jesus, Gordon, you look like garbage. CLARK Thanks, Al, duly noted. AL (withering) I’m not asking you. ‘Pajamas at work’ might’ve flown back in Frisco, but this is a professional workplace. When I see you again, you better be wearing   at least   a clean shirt. Understand? Clark lowers his eyes to his coffee as Al walks away. ANGLE ON MacMillan, in his black suit, a perfect contrast",
      "dialogue_count": 0,
      "word_count": 3043
    },
    {
      "scene_number": 3,
      "slugline": "INT. UNIVERSITY LECTURE HALL -- DAY An older PROFESSOR (58) stands in front of a large class of about 75 students. Their vibrant 80’s youth clashes with boredom as the professor clears his throat. PROFESSOR We will be postponing today’s discussion on vacuum tubes, as we have a special guest who’s in town on business for today only. He contacted the Department of Electrical & Computer Engineering this morning and requested to stop by and speak to some of our best and brightest about the current state of the computer industry... Students have started to take notice. One is CAMERON HOWE (22), a young woman with ice blonde hair cut very short. Big black-rimmed glasses and exposed collar bone, fashionable, post-punk. She has a pattern of rubber bands currently wrapped around her fingers. PROFESSOR (CONT’D) So without further ado, please welcome Joseph MacMillan from Cardiff Giant Computer Systems. MacMillan, looking his shaved and showered best, trots into the room amidst half-hearted applause. ANGLE ON Cameron as she immediately tosses the rubber bands off her fingers, very interested in what this man might say. MACMILLAN Good afternoon, UT. Let me start off with a question: How many of you desire to be professional computer engineers? About 50 hands go up in the class. MACMILLAN (CONT’D) Now I’m going to list off several categories. When you hear a category that you don’t have hands- on experience in, put your hand down. (pause) Electrical engineering. Software design.  28.  (MORE)",
      "characters": [],
      "action_text": "Hardware-software integration. Circuit design. Microprocessing. Already, half the class has their hands down. MACMILLAN (CONT’D) Firmware design. Very Large Scale Integration. Operating systems. Down to about eight people now. MACMILLAN (CONT’D) FPGA configuration. Hardware description languages. Personal computer design. Three people have their hands raised. One is Cameron. MACMILLAN (CONT’D) Reverse engineering. Cameron’s hand goes down, as does another, leaving only one smiling, cocky male student. MACMILLAN (CONT’D) Okay, let’s go back one. Both hands go up again and the cocky kid loses his grin. MacMillan points to a FAT BALDING GUY first. MACMILLAN (CONT’D) Tell me one thing that will be true about computers 10 years from now. FAT BALDING GUY (mouth-breathing) Computers will exist as ocular headsets that plug into the back of our cerebral cortexes-- MACMILLAN Okay, thanks. (pointing to Cameron) You? CAMERON Um... Computers will likely be connected together over a vast network and able to communicate with each other by alternately modulating and demodulating digital data over an electric system of some kind--  29.  MACMILLAN (CONT’D) MACMILLAN Like phone lines. CAMERON Probably phone lines. MACMILLAN Can you see me after class, Miss. uh...? CAMERON Yes. Cameron Howe, yes. CUT TO: INT. ARCADE -- LATER A hallmark of the early 80’s coin-op craze. Hazy from smoke and the crowd’s a bit older, college drinkers. Cameron and MacMillan have stationed themselves before a Frogger cabinet. MacMillan, tie loose and suit sleeves pushed up short, deftly carries four tequila shots over to the controls. CAMERON I’m great at this game, I’ll whoop your ass. MACMILLAN But there are rules. Every time you lose a frog... (holding out a glass) You take a shot. CAMERON I can handle that. She goes for the joystick, but he stops her. MACMILLAN And one to kick us off. They both down a shot. He never takes his eyes off her. LATER She plays intently while he interviews her. CAMERON I don’t ",
      "dialogue_count": 0,
      "word_count": 1118
    },
    {
      "scene_number": 4,
      "slugline": "INT. GLASS-WALLED OFFICE -- DAY (FLASHBACK) Barnes’ office. This is the first scene we saw. Joe is there, livid. Barnes hides all emotion, plays it cool. MACMILLAN You told me it wasn’t worth anything. BARNES It   wasn’t   worth anything, Joe, what do you want me to say? It’s a wire path about the size of a period, for God’s sake. White hot silence. MACMILLAN (trembling) Two days later...   we   patent it. Two days later. BARNES We have to protect our interests. That’s our technology. It was developed on company time. We rejoin the opening shot. A long pause. BARNES (CONT’D) C’mon, Joe. It’s just business. CUT TO: INT. MACMILLAN’S CONDO -- PRESENT MacMillan reaches back into the moving box. Pulls out a baseball. Examines it for a moment. Then he tosses it up... SWINGS THE BAT AND CONNECTS Sending a line drive into the wall opposite him with a CRACK. The ball dents the dry wall, then rolls back across the floor to MacMillan’s feet. He picks it up again, tosses it... SWINGS THE BAT AND SMASHES THE BALL THROUGH A LAMP Destroying the shade and blowing the light bulb apart as the base falls off another moving box. He picks the ball up again... SWINGS THE BAT, SENDS THE BALL OUT THROUGH HIS BALCONY WINDOW With an EXPLOSION of glass.  34.",
      "characters": [],
      "action_text": "The cool morning air flutters over his loose tie as he gazes out onto the horizon. CUT TO: INT. CARDIFF GIANT OFFICES - MACMILLAN’S OFFICE -- DAY MacMillan sits at his terminal in an office that hasn’t even been set up yet. He types methodically, focused. ON THE SCREEN We see what he’s working on. In green letters against black, it begins: “To: John Bosworth, Cardiff Giant Executive Team, et al It is with sadness that I submit my formal resignation to the company...” MacMillan’s finger hovers over the ‘Print’ button. GORDON CLARK ENTERS wearing beat up Ray-Ban Wayfarers, carrying a large box adorned with the IBM logo. He sets it down on MacMillan’s desk. CLARK (taking glasses off) Do you know how much one of these things costs? (pause) Monday’s a holiday, so we can spend the three-day weekend in my garage. (pause) What do you say? MacMillan stands. Opens the box, revealing a brand new IBM PC. A small smile appears on his face, perhaps for the first time. MACMILLAN This isn’t just about Cardiff. We’ll wake a sleeping giant at IBM. They’ll come at us with everything they have. Clark nods. Then looks back up at MacMillan. CLARK Let’s turn this thing inside out. END ACT III  35. ACT IV INT. CLARK’S GARAGE -- NIGHT MacMillan and Clark, still in their work clothes, stand over the IBM PC, removed from its packaging and vulnerable under the light. MacMillan works a screwdriver on its sides... SLIDES OFF THE METAL BOX, REVEALING ITS INSIDES MACMILLAN From here, you’re in the driver’s seat. CLARK A personal computer--like any computer, really--is just a nothing box full of electronic switches; hardware. The IBM, Apple II, the Altair, it’s all the same junk. MACMILLAN Get to the good part. BEGIN MONTAGE -- REVERSE ENGINEERING Clark and MacMillan slave over the machine, pulling it apart, examining it... -- Clark carefully unscrews circuit boards and slides them out of the PC, laying them next to each other. CLARK (V.O.) You can buy all this stuff off the shelf right now. That’s",
      "dialogue_count": 0,
      "word_count": 5214
    }
  ]
}