{
  "slug": "happy-101-saint-nick-2017",
  "title": "happy 101 saint nick",
  "genre": "thriller",
  "format": "series",
  "scenes_count": 5,
  "characters_count": 0,
  "characters": [],
  "total_words": 10897,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. BROOKLYN - NIGHT Snow falls over the city. Covering dirt and soot and grime with fluffy white sugar. Almost beautiful if you don’t look too close. A homeless man raises his head to the night and puts out his tongue, catching snowflakes. As nearby: A moth-eaten, ragged man in a Santa Claus costume rings a bell outside a MALL -   we will know him as  VERY BAD SANTA. The mall bleeds garish colored light.   Soulless Christmas music echoes from inside. And now a little girl - HAILEY HANSEN (8) - is drawn like a moth to the flame of the cheap and glittering facade - She attempts to make eye contact with SANTA as her mom drags her toward the entrance.   But SANTA does not turn to watch her - with bad intent - until she’s already past. INT. THE MALL HAILEY’S eyes go wide as she is swept into the throbbing pulsing pop music-driven flashing capitalist sideshow inside! For the first time we see MOM: AMANDA HANSEN (30) The crowd crushes in - signs and video are hyping up a personal appearance by SONNY SHINE - 40s, a Willy Wonka-style, grinning TV personality. Surrounded by a colorful menagerie of costumed furry friends known as the WISHEES. CROWD So-nny Shine! So-nny Shine! AMANDA is impatient, irritated; people are bumping them, pushing past.",
      "characters": [],
      "action_text": "HAILEY I can’t see! AMANDA Don’t worry sweetheart... She lifts HAILEY and tries to hold her up as over the PA: M.C.  They call him the man who MADE Christmas for thousands of underprivileged young Americans.  Music rises, a roar from the crowd. M.C.  He’s America’s best pal! The man who makes the sun shine!  The crowd surges forward. AMANDA is forced to put HAILEY down. She clutches her hand tightly in the chaos - AS: SONNY SHINE makes his entrance - - descending on a giant golden cartoon sun on cables, “radiating” shimmering tassles... A pale, sickly child sits in his lap, grinning wildly.   SHINE is lowered to the stage - - where bizarre costumed creatures - think Barney the Teletubby - romp and play, tossing glitter and brandishing giant candy canes.   These “Wishees” seem as much the rock stars as Sonny himself in the eyes of the screaming kids. M.C. SONNY SHINE! The crowd goes wild. Sonny throws out gifts. SONNY Not just ONE! Not just TWO! Everyone yells, joins in the catch phrase. SONNY It’s THREE WISHES! HAILEY (joining in) THREE WISHES! They are being crushed from all sides.  2. AMANDA Screw this. She drags HAILEY back, away from the surge. AMANDA I’m sorry, sweetheart but - Looks down: she is holding a different child’s hand.   A little boy looks up at her, confused. AMANDA Oh my God ... Hailey? Another MOM appears, yanks the little boy away from her. MOM Get your hands off my son! AMANDA (searching the crowd) I’m sorry, I - MOM Don’t you know children are being snatched left and right these days? I ought to report this - AMANDA shoves the outraged woman aside. AMANDA HAILEY! AS: HAILEY moves forward, through the crowd, almost hypnotised. Then she STOPS - she seems to be speaking to an invisible playmate. HAILEY We’ll go back. As soon as I see Sonny. (reacts to a voice only she can hear) But I only want one wish - (frowns) That’s not true. Don’t be mean. Just then - the SONNY spots her in the crowd. He smiles and waves.  3. HAILEY  Mr. Sunshine! I only need",
      "dialogue_count": 0,
      "word_count": 749
    },
    {
      "scene_number": 2,
      "slugline": "EXT. THE CITY - NIGHT A VESPA zips through city traffic, blasting through updrafts, zagging across curbs. Driven by A COURIER (20s), hoodie under a parka, backpack loaded up. He passes Christmas trees, lights, happy families - a winter wonderland of holiday cheer. MUSIC: A chorus of children sing JINGLE BELLS -  Jingle Bells, Jingle Bells, Jingle all the way!   Oh, what fun it is to--  SMASH CUT TO: INT. BATHROOM - NIGHT NICK SAX is projectile vomiting into a urinal. Oh, what fun! He steadies himself, wipes his mouth with a sleeve.   Look at this guy: 40s. A 6’2” locomotive wreck in a worn out trenchcoat -- He steadies himself in the mirror... this is the face of a man who’s lost it all. Skin flaking with eczema; dead-eyed - but with something volcanic smoldering down deep behind them - SAX Well ain’t I just a peach. He belches. Stumbles out into-- INT. DOWNTOWN DIVE BAR - NIGHT -- a mostly empty bar.   Dive does not begin to describe this place. He leans on the bar, motions to the bartender. SAX Cleansing my palette. Where were we? The bartender grimaces at the smell, pours SAX another shot.  5.",
      "characters": [],
      "action_text": "SAX Right. How could I forget? (making eye contact with an unfortunate patron) The hell you looking at? SAX focuses - outside the window, the VESPA has pulled up to the curb. It idles there, puffing exhaust. EXT. CITY STREET - NIGHT SAX kicks the door open, lurches out onto the street to the VESPA. SAX Well ho, ho, ho.   What’s Santa got for me tonight? The COURIER regards him flatly - digs into his backpack and hands SAX a BIG YELLOW ENVELOPE. COURIER Cheers. SAX opens the envelope, takes a peek.   Three photos.   We don’t see them. But they raise SAX’S eyebrows. SAX Interesting. Verrry interesting. He claps the COURIER on the back, too hard. SAX Gonna be a busy holiday season for you and me both by the looks of it. COURIER Don’t know nothin’ about it, Satan. He zips away. SAX Hey, Merry X... ah fuck it. PRELAP over SAX’S ravaged face: PAL (O.S.)  Nick Sax... is a CUNT.  CUT TO:  6.",
      "dialogue_count": 0,
      "word_count": 365
    },
    {
      "scene_number": 3,
      "slugline": "INT. BACK ROOM - NIGHT The 3 FRATELLI BROTHERS - PAL (28), BEPPO (25) and PAULIE (32) - gathered around a table. Archetypal Jersey boy punks. A noisy, steamy CHINESE KITCHEN bustles through a half open door. A YELLOW ENVELOPE sits in the middle of the table -   just like the one we just saw SAX receive.   A photo sits next to it: SAX. Black and white. Not so flattering. PAL See, some guys are pussies. Then you got your dicks, your assholes - but Sax? Nick Sax is a professional, stone-cold, cast-iron cunt. BEPPO I heard he used to be a cop. PAL (nods) Eight, nine years ago. I’m not talking some ass jockey on the beat. I’m talking Dirty Harry/ Steve McQueen/ TJ fuckin Hooker-- BEPPO So what happened? PAL Usual. Trouble with some cooze. Got his ass thrown off the force and ended up down here in the dirt with rest of us. These days he’ll pull a trigger for anyone who’s got the lettuce. (collective shrug)  Dude lost it all.   You feel me? He don’t got nothing else to lose. And you better believe - a son of a bitch with jack shit to live for is the toughest son of a bitch to kill. BEPPO It’s ironic when you put it that way. So why ice him?  7.",
      "characters": [],
      "action_text": "MIKEY (O.S.) Maybe he knows too much. MIKEY FRATELLI (21) - the 4th FRATELLI brother - enters the room. MIKEY is slicker than the others.   Gucci scarf, designer pea coat; shiny shirt/skinny tie underneath.  Eyes way too haunted for a guy that young.   He hangs his coat on a hook. PAL Mikey? ALL TOGETHER MIKEY! They are on their feet, giving him kisses and back slaps. PAL Welcome home, Mikey. Back from the old country. We missed ya, bro. PAULIE No one knew you was back. MIKEY (nervous) I left straight from the funeral. Uncomfortable beat. The brothers raise glasses. BEPPO A moment of silence for Don Columbo, God rest his soul. And to think: (claps his back, too hard)  our little Mikey,   sittin right by the bedside as the Great Man passed on to his just reward. They drink - slam the glasses down on the table. PAULIE Looks like the four Fratelli Bros are gonna kick some ass tonight. Just like old times.  8. PAULIE slides the yellow envelope across the table. MIKEY glances at it - loosens his tie; looks a little sick. He knows what it means. MIKEY Count me out. I got something for Uncle Blue. Straight from the Don. It can’t wait. BEPPO Bro. Priorities. A little ballistic therapy first. Then you go kiss the ring. Uncle Freaky ain’t goin’ noplace. MIKEY (uncomfortable) For Christ sake, I ain’t even unpacked yet. PAULIE S’a matta, baby bro? Afraid of gettin blood on your Dolce and GafuckinBana? INT. THIRD FLOOR APARTMENT - NIGHT A run down room. Radiator clanking out a losing battle. A man dressed in a full sized PRAWN COSTUME - pink legs, antennae - leans back in a chair, getting blown by ANGEL - 20s, strung out - a hooker in a cheap Halloween ANGEL COSTUME.   HALO on a spring over her head, rocking to and fro. This is every kind of wrong, and getting worse by the second. PRAWN MAN So it turns out they used - research - statistical shit - ANGEL Listen pal, could ya hurry it up? I got an 11 o’clock, supposed to be here any minute- He gently directs her back to business. ",
      "dialogue_count": 0,
      "word_count": 8607
    },
    {
      "scene_number": 4,
      "slugline": "INT. HOSPITAL KITCHEN - NIGHT, CONTINUOUS - the hospital kitchen, waving his gun. SAX What the hell are you people looking at? I have to perform an emergency surgery in five minutes and I’m dead drunk! (grabs a worker by the lapels)  It’s a colon resection, God damn you!  HAPPY They ain’t buying it, Nick. NICK I need coffee, you bastards! Now! A worker hands SAX a coffee pot - SAX snatches it away - HAPPY Careful, Nick!   Hot! Hot! Caliente!  SAX slams the burning coffee - his eyes widen into circles. HAPPY cringes. SAX collapses against a counter, coughing and spitting steam. HAPPY (hopeful) Better? SAX Actually, yeah. COPS bust in as SAX busts out. INT. HOSPITAL - NIGHT, CONTINUOUS SAX is hauling ass down a corridor. HAPPY goes zipping out in the lead, rounding the far corner ahead of him - - then zips back, eyes wide. HAPPY More bad guys, Nick!  53.",
      "characters": [],
      "action_text": "SAX Well shit then. Cops ahead, cops behind. HAPPY We’re in a family-size jar of pickles, Nick! SAX glances over, sees that they are right in front of the ELEVATORS. He works his fingers between the doors and - with a primal roar - FORCES THEM OPEN. Black. Straight down. HAPPY What the heck, Nick! There’s no elevator and YOU CAN’T FLY! SAX notes the 3 on the side of the doorway. SAX Third floor. HAPPY Ok. You got that loco light in your eyes, buddy. Whatever you think you’re up to,   you can’t help me save Hailey if you’re DEAD-ZO-RONI!  SAX Right. About this “Hailey” you keep yammering about. (dead in the eye) To hell with her. And to hell with you too. Got it? HAPPY looks back at him with the most heartbreaking eyes ever, quivering with emotion.  Sniff. Sniff.   A big TEAR wells up and drops. HAPPY is crying! Everyone, collective:   AWWWWWWWWWWW.  SAX Oh for Christ sake. The THUGS round the corner, guns blazing - TIME’S UP -  54. SAX snarls - Snatches HAPPY out of the air and JUMPS INTO THE BLACK -- leaving blue feathers fluttering. EXT. HOSPITAL - NIGHT From inside, GUNSHOTS.   Then: The glass front doors of the EMERGENCY ENTRANCE   explode outwards -  SAX face-plants in a heap on the icy concrete, broken glass and blue feathers falling all around him. He struggles to his feet as HAPPY flutters up -- HAPPY  Woo-hooooooooo! Are we the best team ever or--?  They charge toward the parking area together, then stop short. HAPPY Uh oh. MERRY is standing in front of them. Gun trained on NICK’S face. SAX Merry. MCCARTHY Nick. She is standing next to her car. Engine idling, puffing white exhaust in the cold night.   Door ajar. SAX I’m gonna need to borrow your car. Sergio Leone moment.   Who will blink first?   Finally: MCCARTHY You son of a bitch. SMASH CUT TO:  55.",
      "dialogue_count": 0,
      "word_count": 476
    },
    {
      "scene_number": 5,
      "slugline": "EXT. HOSPITAL - NIGHT, MOMENTS LATER COPS rush out the front entrance, guns blazing. They empty hot lead into the fleeing car as it burns rubber out of the parking area -- the back window shatters.   As -- MERRY stands by, soberly. Smoking a cigarette. SMOOTHIE appears, shoves the guards out of the way. Glares molten needles of rage at the disappearing car, then at MERRY. MERRY (shrugs) He got past me. She glances down at SMOOTHIE’S piss-stained trousers. MERRY Little accident? CUT TO: INT. MCCARTHY’S CAR - NIGHT SAX takes a hot turn, scattering pedestrians, street carts. HAPPY sits on the dashboard like a PLASTIC JESUS. HAPPY  Hoo boy!   That was a close one! Where we goin, Nick? SAX dead eyes him. SAX “We” are going nowhere. You heard what the nice lady said. I signed my own death warrant when I iced Disco Mikey. Every scumbag in the city will be looking for me by dawn, if they’re not already. HAPPY Yeah, but-  56.",
      "characters": [],
      "action_text": "SAX But, but, but nothing. I’m getting the hell out of town. HAPPY is a ball of fidgety anxiety -- he taps a rapid-fire beat on the dash with his little hooves. Seems to be wrestling with a decision. SAX Can you knock that the fuck off please? HAPPY I didn’t wanna tell ya, Nick... SAX Tell me what? HAPPY (forlorn) I was ‘fraid of scarin’ you away. After all, you left her once before. Maybe you just don’t want to be a daddy. SAX The hell are you yammering about? HAPPY  Why do you think I picked you, Nick?  SAX Lucky I guess? HAPPY You can say that again. Hailey’s your daughter, Nick. BOMB DROP. MONTAGE: EXT. CITY STREET - NIGHT BLUE’S town car is pulled over in front of a row of STREET VENDORS. Souvenirs, toys, knock-offs. The DRIVER/BODYGUARD stands by.  57. BLUE stands behind GERRY, watching his phone ring: MCCARTHY. As -- GERRY browses a stand full of colorful PLUSH TOYS. He pokes fluffy stomachs, tweaks button noses - looking for that special one that cries out BUY ME... No answer. BLUE swears under his breath.   Clicks off, irritated. GERRY This one, daddy. Of all the toys there, GERRY has picked the weirdest: A 12” plush WISHIE - one of SONNY SHINE’S colorful sidekicks. Purple, floppy eared. Tongue wagging. Pinwheel eyes that spin in it’s head. Something twisted about it. Uncomfortable, BLUE picks out a different toy. BLUE What about this little guy? GERRY No, daddy - I want   a WISHIE.  Please? Somewhere, the SONNY SHINE MUSICAL THEME is playing. The snow FLURRIES around BLUE - AS: EXT. CITY STREET - NIGHT AMANDA - eyes streaked with tears - tries without success to hail a cab. The SONNY SHINE THEME plays over outdoor speakers, a warped imitation of holiday cheer. The COURIER zips up to the sidewalk on his Vespa. He goes through his backpack, pulls out a plain envelope. COURIER Ms. Hansen? She nods, mystified. COURIER This is for you. She takes it; he’s gone.  58. From a VOYEUR’S POV we see her look around. She is being watched. She tears open the envelope. It",
      "dialogue_count": 0,
      "word_count": 700
    }
  ]
}