{
  "slug": "happy-death-day-2017",
  "title": "happy death day",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 9,
  "characters_count": 0,
  "characters": [],
  "total_words": 18622,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT.   DR. BUTLER’S SCIENCE CLASS - MORNING  Tree “sneaks” into the rear of the lecture hall.   DR. GREGORY BUTLER (early 30’s, chiseled) jots notes on the chalkboard. GREGORY When extreme agitation occurs, locomotive response in the subjects show an acceleration across the quantum plane, where -- A quiet entrance is ruined by a very loud, squeaky door as Tree slinks into the room. As she takes a seat in the back she makes eye-contact with her professor. Was that a sneer or a smirk he just flashed her?  EXT. LUNCH PATIO - AFTERNOON  A group of Kappa girls have gathered around a table, as Danielle conducts a house meeting with the intensity of a U.N. assembly. To her right, MONICA KEENER, 18, a nervous pledge, diligently takes notes on a legal pad. The other girls, including Tree, absently suck on sugar- free, no whip Mochas OR what they call... lunch.  Visibly absent is Lori. DANIELLE -- and we still need to pick this year’s charity. I can say right now, there is no way we’re doing the Special Needs art fair again. All those tards want to do is hug.  Totally freaked my shit out.  Thoughts? Another pledge, BECKY SHEPARD, 18, a little chunky but doing her best to fit-in, joins the group with her tray. All eyes fall on her food...a sandwich with a side of pasta salad, and a tall glass of chocolate milk. Feeling the weight of their collective stares: BECKY What’s wrong? DANIELLE I don’t know. What’s wrong Tree?  8.",
      "characters": [],
      "action_text": "TREE Nothing. Except for the   buffet   you just dumped on our table. DANIELLE And is that chocolate milk I see? Becky looks horrified. BECKY (ashamed) I missed breakfast. She gets up with her tray and SLAMS into Carter. The chocolate milk slides off the tray and SPLASHES all over Tree. Danielle cracks up. TREE Ass-- She looks up and sees who it is. TREE (CONT’D) --hole. Carter grabs some napkins from the dispenser on the table. CARTER I’m so sorry, Tree. DANIELLE You two know each other? CARTER Yes.   TREE No. They look at each other -- Tree’s eyes could burn holes through him. Carter remembers her threat earlier. CARTER (sheepish) We...had a class together last year. Tree snatches the napkins from him and starts wiping herself down. CARTER (CONT’D) I just came by to return this.  9. He offers Tree her bracelet. CARTER (CONT’D) I didn’t know where you lived-- Tree snatches it back and looks around to see if anybody saw the exchange. Luckily, they didn’t. He waits for a “thank you”. TREE Help you? Carter’s hurt turns to indignation. But he doesn’t bark at her. He’s better than that. CARTER Sorry again about the mess. Carter walks off. DANIELLE What a douche-bag.  INT. CAMPUS BOOK STORE - AFTERNOON  Tree, a BLUE WORK SMOCK over the CHOCOLATE MILK STAIN on her blouse thumbs through a copy of US Weekly. Her boss, LEONARD GILBERT, 40’s, wormy, peers over her shoulder. LEONARD Teresa, I believe you’re supposed to be unpacking the new shipment, not reading about-- (reading the cover) -- Brangelina.  TREE I’m still on my ten. LEONARD Your ten ended ten minutes ago, missy. Tree drops the magazine. As she heads toward the back, she passes a display of school-spirit paraphernalia including a stack of eerie MASKS (the school mascot).  10. INT. STOCK ROOM - AFTERNOON  Fluorescent lights HUM in the sterile room as we find Tree hunched over a pile of text books, stamping the covers with STICKERS that say “REDUCED”. Immersed in the mind-blowing monotony of her job, Tree doesn’t se",
      "dialogue_count": 0,
      "word_count": 6455
    },
    {
      "scene_number": 2,
      "slugline": "INT. TREE’S BEDROOM - EVENING  The dresser slowly lumbers across the floor as Tree pushes it flush against her bedroom door. Along the way, a few items fall off the top -- including Tree’s graduation PHOTO with mom and dad. Tree picks it up, studies the image for a second, tracing her finger over her mother’s smiling face. Suddenly, somebody tries the handle. Tree looks at the door startled. There’s a knock then: DANIELLE (O.S.) Tree? Why’s the door locked? TREE I’m...uh...just need a little privacy. DANIELLE (O.S.) What time are you going to the party tonight? TREE I don’t know...later. Tree looks at the clock --   9:22  Then the digit changes to   9:23  BLACKOUT.  DANIELLE (O.S.) Our tuition dollars at work. The lights turn back on. DANIELLE (O.S.) (CONT’D) Anyhoo...don’t be too late or all the cute Sigma boys will be taken. Tree listens to Danielle’s FOOTSTEPS walking away -- her eyes suddenly filling with purpose...  45.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 159
    },
    {
      "scene_number": 3,
      "slugline": "INT. TREE’S BEDROOM - LATER  Tree has dismantled her Ikea night stand and is nailing the wood panels over the windows. Finished, she gives them a good tug to be sure they’re secure. With the windows sealed-shut and the door locked and securely blocked, she feels “safe”. TV back on, Tree finds the CUPCAKE Lori made for her sitting on her desk. She settles onto her bed and begins peeling the paper off of her treat. About to take a bite, Tree notices the “Road Rules” marathon is still playing. It feels like a bad omen, she opts for a station change. Tree begins searching for the remote but it’s nowhere to be found. TREE (annoyed) Lori...what’d she do with the freagin’ remote? Tree goes to her desk, riffling through loose papers when she comes upon her stack of mail and THE BLACK ENVELOPE. There’s no post mark and the front is blank. Perplexed, Tree opens it... Inside the envelope is one of those 3-D cards featuring a weird little Elf waving a “Happy Birthday” sign attached to a tiny spring. As the sign bounces the Elf GIGGLES through a tiny, hidden voice box. On the blank side of the card, written in black marker, a child-like scrawl reads:  “HOPE IT’S YOUR LAST ONE...”  Disturbed, Tree slowly lowers the card when -- The TV turns off. Tree looks at it. TREE (CONT’D) What the hell? She walks over and turns it back on manually. “Road Rules”. Tree immediately changes the channel.  46.",
      "characters": [],
      "action_text": "CLOSE ON -- THE TELEVISION SCREEN The first station change brings us to the famous opening credits of “The Twilight Zone”. TREE (CONT’D) No shit. She changes the channel again to an unfolding “Breaking Story” on a local news station. A female REPORTER standing outside the entrance to an EMERGENCY ROOM. REPORTER --where suspected murderer Joseph Tombs is being treated for a gunshot wound following a deadly shoot-out this morning that left one officer dead. The story CUTS TO a MUG-SHOT of the menacing killer. REPORTER (CONT’D) Tombs had been the subject of a nationwide manhunt-- The TV suddenly TURNS OFF AGAIN... Tree freezes. In the stillness, we HEAR a scraping noise coming from THE CLOSET. At this moment, it dawns on Tree that she never checked the room before she barricaded herself inside. Picking up the HAMMER, Tree advances slowly toward the closet -- the door is slightly ajar. She grips the handle...raises the hammer, ready to strike... PULLS! ANGLE ON -- THE CLOSET  Empty.  Tree notes a lone wire hanger, gently scraping on the wall.  47. She sighs with relief and closes the door. But as she turns around, Tree’s focus moves to another part of the room... THE BATHROOM. Through the open doorway, she can see the shower -- the opaque curtain is drawn.   Did it just move a little?  Tree crosses the room. IN THE BATHROOM Tree stops at the shower. As she reaches out for the curtain... The TV turns back on! A loud COMMERCIAL blares, scaring the shit out of us! Spinning around, Tree looks at the TV. Her eyes slowly move to the bed and then the slip cover where the sole of a BLACK BOOT is just sticking out from under the fabric.  He’s hiding under the bed!  Tip-toeing back into the bedroom, Tree gingerly kneels down in front of the bed, keeping her hammer at the ready. Looking over Tree’s shoulder, we SEE the shower curtain is OPEN -- as the masked killer emerges from the bathroom! Tree doesn’t see him creeping toward her, the long blade of his knife at his side... Tree ",
      "dialogue_count": 0,
      "word_count": 674
    },
    {
      "scene_number": 4,
      "slugline": "INT. HALLWAY OUTSIDE TREE’S BEDROOM - CONTINUOUS  We HEAR Tree screaming in agony as her blood begins to spill-out under the crack of the blocked door...  SLAM CUT: INT. CARTER’S DORM ROOM - MORNING  The tolling bells outside are drowned out by Tree’s hysterical awakening -- THRASHING and SCREAMING so loud that Carter himself screams from the shock! CARTER What’s wrong?! Jumping out of bed too quickly, Tree suddenly doubles- over in pain. Carter rushes to her side. CARTER (CONT’D) Tree --- She shoves him back. Her cell phone plays “Happy Birthday”. Tree grabs the phone and throws it against the wall. TREE SHUT UP!!! Afraid, Carter jumps back. Tree grabs her head, distraught. TREE (CONT’D)  Ohmygod..ohmygod...make it stop, please make it stop...  Carter tries to approach Tree again. CARTER What’s wrong? Are you sick? TREE Just get away from me! Pain subsiding, Tree pulls the T-shirt off and starts changing into her clothes. Carter spins around. CARTER I don’t know what’s going on but --  49.",
      "characters": [],
      "action_text": "Carter turns around -- Tree’s already out the door. A second later, the lanky freshman peeks into Carter’s room. FRESHMAN  Dude...what’s up the psycho- hottie?  EXT. THE CAMPUS - MORNING  Tree staggers through the crowded thoroughfare -- her eyes darting left and right. Everyone she passes has an air of menace. Anyone could be her killer. TREE’S POV -- VARIOUS “SUSPECTS” STARING BACK... * A PROFESSOR peering at us over the rim of his coffee cup. * A PAINTER, wearing a bandana over his mouth, looks up from his work to tracks us with his eyes. * A STUDENT VENDOR, working behind an espresso kiosk, stares at us through a glass partition. Becoming winded again, Tree stops in the middle of the walk way. The student protester thrusts the petition at Tree! STUDENT PROTESTER Stop global warming! Tree staggers back. The car alarm goes off. Then the sprinklers. Behind her, the FRAT GUYS are singing... FRAT PLEDGES  -- not a Willie or a Sam!   I’m the eighth ole’ man named Henry! Henry the Eighth, I am!  FRAT BROTHER Second verse, same as the first!  50. Tree begins to turn in a circle, the world spinning around her in a kaleidoscopic nightmare! The protester, the car alarm and the frat guy’s voices grow louder and louder! Students begin to stop and stare at Tree, who is caught in the middle like a trapped animal. The world begins to whirl faster and faster... The voices become louder and louder... Until everything builds to a deafening crescendo! And Tree collapses onto the pavement.  INT. TREE’S HOSPITAL ROOM - AFTERNOON  Tree is arguing with DR. ELLIOT WINTER (50’s, kind face). Arms folded, pouting like an indignant little girl, Tree doesn’t want to be here. TREE It’s just a concussion right? That’s not a big deal. Why can’t I go? DR. WINTER Where’s your father? We’ve been trying to contact him but we must have an old number on file. TREE What do you need him for? DR. WINTER We need your full medical history. Our system’s down from the rolling black-outs and we can’t retriev",
      "dialogue_count": 0,
      "word_count": 1818
    },
    {
      "scene_number": 5,
      "slugline": "INT. PARKING LEVEL 1 - CONTINUOUS  The killer slowly rises to his feet as Tree speeds off in Gregory’s car.  EXT. MAIN ENTRANCE -- POTSDAM UNIVERSITY - NIGHT  Racing off the campus grounds, Gregory’s car fish-tails onto the main road.  INT. GREGORY’S CAR - NIGHT  The lights of the isolated campus fade from view as Tree pushes the speedometer past 80. Realizing she’s escaped, Tree is overcome by a wild euphoria. She begins pounding the steering wheel, laughing through her tears. TREE I did it!!! Her celebration is cut short by the sound of SIRENS. Tree glances into the rear-view window as a POLICE CAR closes- in behind her. TREE (CONT’D) Shit. Tree slows down and pulls onto the shoulder. OFFICER BILL SANTORA (40’s, seen too many Clint Eastwood movies) saunters up to the driver’s side and raps his knuckles on the glass. Tree rolls the window down, trying to stay calm. TREE (CONT’D) I know. I was speeding. OFFICER SANTORA Turn the engine off. TREE Sorry, officer. She kills the engine. OFFICER SANTORA License and registration. TREE Um...I don’t have them.  59.",
      "characters": [],
      "action_text": "OFFICER SANTORA Pardon? TREE (blurting out) Someone’s trying to kill me again! OFFICER SANTORA Again? TREE Yes!   (realizing how that sounds) I mean no! I mean...he’s tried before but this time I got away but I didn’t have time to get my clothes and my driver’s license was in my pocket. Santora grabs his FLASHLIGHT and shines it in Tree’s face. She squints back. OFFICER SANTORA Ma’am, are you under the influence of alcohol or any other controlled substance? TREE No! I’m not-- (pause/epiphany) Wait. If I am, does that mean you’ll arrest me and   put me in a jail cell? OFFICER SANTORA That’s usually how it works. Realizing she couldn’t be in a safer place: TREE I’m drunk! OFFICER SANTORA You are? TREE  Wasted!   And I’m high. Pills, weed, you name it man! I’m on it! Santora couldn’t be more confused.  60. OFFICER SANTORA Well...then I’m placing you under arrest. TREE Good idea. She gets out of the car. Santora cuffs Tree’s hands behind her back and leads her to his cruiser. As he opens the back door, Tree looks at him and smiles. TREE (CONT’D) Thank you. Officer Santora:   Weirdo.  He pushes Tree into the backseat. The POLICE RADIO suddenly CRACKLES. DISPATCHER  All units, we’ve got a 187 at the university hospital.  Santora pauses, listening to the homicide report. DISPATCHER (CONT’D)  Suspect is believed to be an escaped patient. Be advised--  As Santora looks at Tree’s hospital gown he’s suddenly flooded by a BRIGHT LIGHT! We HEAR an engine roar! Before he can even turn, Santora is struck by a speeding car! The impact SHEERS the back door right off as Tree SCREAMS in terror! The UNKNOWN VEHICLE makes a hard 180 and stops. Hands cuffed tightly behind her back, Tree struggles to get out of the cruiser. Feet crunching over broken glass, she finally manages to shimmy out. The other car idles...Tree can’t see the DRIVER beyond the blinding HIGH-BEAMS. Then she hears it: a door squeaking open. Footsteps begin to draw closer. Tree looks around, there’s nowhere to hide. Ju",
      "dialogue_count": 0,
      "word_count": 746
    },
    {
      "scene_number": 6,
      "slugline": "INT. POLICE CAR - NIGHT Tree has just been placed into the backseat by Officer Santora. A split-second after he closes the car door... WHAM! Santora is struck by a speeding car as it broad-sides the police car in a flash of scraping metal and flying sparks! Tree screams! Looking though the plexi-glass partition, she can see Santora’s crumpled body, mercilessly displayed in the police car’s headlights. Tree looks for the other car but it’s nowhere to be seen... Suddenly, a pair of HIGH-BEAMS appear -- blinding Tree as the car roars toward her at full throttle! Tree goes for the door handle!   But there is none!  ANGLE ON -- THE SPEEDING CAR! Blazing a head-on collision course! Tree braces for impact but the other car SLAMS on its brakes at the last second! Tires SCREECH! Then... silence.  The cop car is completely flooded with light now. Tree shields her eyes as we HEAR a door open and close outside followed by slow, encroaching FOOTSTEPS. Suddenly a HAND slaps against Tree’s window! Tree yelps as the MASKED KILLER comes into view, peering at Tree like a bug in a jar. TREE What do you want?! He presents something to her... A BIRTHDAY CANDLE?  The killer lights it. What he does next is even more baffling to Tree. He simply turns around and goes back to his car.  63.",
      "characters": [],
      "action_text": "The killer’s car starts to back away...headlights fading until they’re the size of distant FLASHLIGHT BEAMS... TREE (CONT’D) (dumbfounded) Where’s he going?... And then his lights just GO OUT. Beat...  OUTSIDE THE KILLER’S CAR:  The black-gloved hand emerges from the open driver’s-side window holding the birthday candle. He drops it...  WHOOSH!  A FLAME IGNITES! The fire starts at the killer’s car (driver’s side) quickly running toward the police car!  BACK IN THE POLICE CAR:  Tree beats on the glass but, it too, is bullet-proof. Looking toward the rear of the police car, Tree can see the damaged gas tank -- hemorrhaging GASOLINE from the previous collision. ANGLE ON -- THE FLAMES Running faster and faster in Tree’s direction! CLOSE ON -- TREE Face framed in the window as the glass suddenly reflects an ORANGE/RED glow... TREE (CONT’D) Oh Fu--  BOOM!!!  The car explodes into a massive ball of fire! INT. CARTER’S DORM ROOM - MORNING The tower bell rings one last time as Tree’s eyes SNAP OPEN...  64. ECU -- we SEE the FIRE BALL flare and then vanish in the reflection of Tree’s eyes. She sits up and wipes the sweat from her brow. A brief glance around the room reminds her she’s still trapped in the same day. TREE (sighing) Here we go again... The opening bass-line of a White-Stripes- ish   song starts...  BEGIN MONTAGE: EXT. KAPPA DELTA HOUSE - MORNING  The two KAPPA GIRLS (who were X-ing in the bathroom at Tree’s B-Day party) stare up at the second floor as BOOKS, PAPERS, even a LAPTOP fly out of Tree’s bedroom window.  INT. TREE’S BEDROOM - MORNING  Desk cleared of debris, Tree sits down and begins to jot- down a list of NAMES in a small note-pad. The “suspects” include KEITH, STEPHANIE, DANIELLE, and GREGORY...(But she immediately goes back and crosses off Gregory since he already died in front of her.)  EXT. KEITH’S DORM ROOM - NIGHT  On her tippy-toes, Tree peers through a first-floor window. From her POV we can SEE Keith, already fast- asleep in his over-sized Spo",
      "dialogue_count": 0,
      "word_count": 621
    },
    {
      "scene_number": 7,
      "slugline": "INT. CARTER’S DORM ROOM - MORNING  Already, sitting up in Carter’s bed, Tree grabs her ringing cell phone and makes a perfect basket-toss into Carter’s trash can. Carter looks at her:   crazy bitch.  INT. BATHROM -- TREE’S BEDROOM - MORNING  Tree cuts huge chunks of her hair off (which has already been died a hot shade of bright-pink).  EXT. THE PATIO - AFTERNOON  Danielle and the other Kappa girls stare in horror/disgust as Tree (sporting her new-do) sprays a bottle of Cheeze-Wiz into her open mouth.  EXT. GREGORY’S HOUSE - NIGHT  Gregory escorts Stephanie (he’s in a tux, she’s in a gown) out of their up-scale house. CLOSE ON -- THE PAD as Stephanie’s name is crossed out. Gregory’s sedan pulls out of the circular driveway -- Tree is suddenly tackled by her killer! Tree falls backward into a KOI POND. She manages to knock the mask off, but the killer shoves her head UNDERWATER... Tree’s POV -- through the rippling water, she can’t make out the identity of her attacker.  INT. CARTER’S DORM ROOM - MORNING  Tree wakes up and instantly leans over Carter’s bedside to puke a stream of pond-water. On Carter:   gross!  EXT. THE CAMPUS - MORNING  Shot tastefully, Tree strolls down the thoroughfare COMPLETELY NAKED... ANGLE ON -- THE STUDYING PAIR as they look up and see Tree. The sprinklers go off but they don’t even react because they’re too stunned. ANGLE ON -- THE STUDENT PROTESTOR  66.",
      "characters": [],
      "action_text": "STUDENT PROTESTER  Stop global war--  She sees Tree and pulls her clipboard back. ANGLE ON -- THE FRAT PLEDGES who follow Tree’s naked body with shocked grins. So distracted are they, nobody notices when the exhausted brother passes-out. ANGLE ON -- THE STAIRS where Tree crosses paths with Keith. His eyes look like they’re going to shoot out of his head. As Tree streaks by, she winks at him. Keith turns too quickly to follow Tree and loses his footing. He eats shit down the stairs.  EXT. STREET -- ON CAMPUS - AFTERNOON  Tree is walking with Danielle when a student bumps Danielle. A BLACK CARD falls out of her bag. Tree grabs it...it’s just like the one she found in her room earlier. Danielle looks guilty. Tree attacks her and a cat-fight ensues right there on the street. A few BYSTANDERS try to stop them. Danielle and Tree fall off the sidewalk and onto the street. We HEAR a HORN blare one long note... Tree and Danielle both turn as an on-coming BUS speeds toward them. They both scream in unison then --   SPLAT!  INSERT:   Tree’s “suspect list” as Tree crosses off Danielle’s name.  EXT. THOROUGHFARE - NIGHT  Tree, donning army fatigues and camo face paint, makes herself small behind a Tree. She waits, clutching a baseball bat, as we HEAR approaching footsteps... Just as the killer enters her periphery, Tree jumps out and SWINGS!  CRACK!  He goes down. But Tree’s face falls when she realizes it wasn’t the killer. It was just BECKY (her chubby Kappa sister), sneaking onto campus with a box of doughnuts, which are now splayed around her unconscious body.  67. Tree drops the bat and rushes to Becky’s aid. Suddenly, there’s a SNAPPING SOUND behind Tree. She looks over her shoulder and finds the killer hovering over her -- armed with Tree’s own bat! But instead of screaming, Tree just sighs... SLOW MOTION: the bat swings in CLOSE-UP and connects with the side of Tree’s SKULL! Continuing with the motion, Tree’s head slowly tilts out of frame and lands on-- --A PILLOW as we",
      "dialogue_count": 0,
      "word_count": 2674
    },
    {
      "scene_number": 8,
      "slugline": "INT. 2ND FLOOR HALLWAY -- KAPPA HOUSE - EVENING  A vexed Danielle bumps into Tree as she exits Tree’s room, holding Tree’s blouse. DANIELLE Where were you? (off Tree’s blank stare) You ditched our house meeting. TREE Danielle, I’m sorry. I’m just...going through a lot right now. DANIELLE It’s mandatory, Tree. I just finished telling your roommate the same thing. If you guys want to be Kappa sisters you have to stick to the schedule or else you’re out. TREE Then I’m out. Tree yanks her top out of Danielle’s hands and walks off. Danielle is floored. DANIELLE Have fun back in the dorms!  INT. TREE’S BEDROOM - EVENING  Lori is zipping-up a small bag when Tree enters the room. As she flops down on the bed, Tree notices the cupcake sitting on the night stand. LORI She just bitch you out too? TREE I so could care less. LORI You two fighting? TREE Danielle and I?  81.",
      "characters": [],
      "action_text": "LORI No, you and Gregory. He asked where you were. Said you didn’t show up to his class. TREE I can’t even think about that right now. LORI I’m off. I have-- TREE --a double shift. I know. LORI (weird) Right. Lori starts out the door but stops. Something is on the tip of her tongue...but she chickens-out. LORI (CONT’D) See ya later. TREE Bye. Lori leaves. Tree lays back down on her bed. Exhaustion and pain have taken their toll as she easily dozes off.  INT. TREE’S BEDROOM - LATER  Tree wakes up. Looks at the clock... 9:19  Danielle bangs on the door before entering in a huff. She’s all dolled-up   sans   Tree’s totally cute top. DANIELLE Well, it was supposed to be a surprise but since you’re being a  total bitch   I’ve decided to spoil it. The party at the Sigma house tonight is a surprise birthday party for your   ungrateful-ass   so I suggest you suck it up and go. Just don’t even   try   talking to me when you’re there. Got it?  82. Danielle storms out, slamming the door behind her. Instead of getting upset, Tree grabs the cupcake Lori made her and peels-off the paper shell. She’s about to take a bite when...  BLACKOUT.  TREE (in the dark) Damn it! The lights come back on and Tree finds the cupcake resting upside-down on the floor. TREE (CONT’D) So much for that. Tree picks it up and dumps it in the trash. She turns the TV on. The “Road Rules Marathon” is still playing. TREE (CONT’D) Oh for god’s sake, enough already! She changes the channel. The same LOCAL NEWS REPORT is on. But this time, she’s catching the beginning of the story. Tree instantly recognizes the HOSPITAL in a WIDESHOT -- it’s the one on campus. REPORTER  I’m standing outside Potsdam University Hospital where suspected murderer Joseph Tombs is being treated for a gunshot wound following a deadly shoot-out this morning that left one officer dead.  Tree slowly rises from her bed as they CUT TO Tombs’ mug- shot. REPORTER (CONT’D)  Tombs was the subject of a nationwide manhunt that ended after a fiv",
      "dialogue_count": 0,
      "word_count": 4761
    },
    {
      "scene_number": 9,
      "slugline": "EXT. KAPPA DELTA HOUSE - CONTINUOUS  Glass and wood EXPLODE as Lori sails though the window! Her body bounces off the ledge, before flipping over backwards! There’s a skull-crushing   THUD   as Lori hits the stone walkway two-stories below.  INT. TREE’S BEDROOM - CONTINUOUS  Danielle’s door-pounding has intensified with all the commotion. DANIELLE (O.S.)  What the hell was that?  ANGLE ON TREE -- BATTERED AND FADING TREE (winded) Lori...ate...my birthday cupcake. We can HEAR some of the sorority sister’s SCREAMS outside as Tree’s eyes roll back into her head and she passes out cold.  FADE IN: EXT.   POTSDAM UNIVERSITY HOSPITAL - MORNING  It is a beautiful, sunny morning. Half a dozen LOCAL and NATIONAL NEWS VANS parked out front, all covering the story of the day.  INT.   INTENSIVE CARE WARD - MORNING  Tree wakes up in the hospital bed. Beside her is Carter and her dad. TREE What... day is it? DAVID Wednesday, you slept all night. TREE Wednesday?   The nineteenth?  107.",
      "characters": [],
      "action_text": "DAVID That’s right. TREE (relieved) I made it. She smiles... starts to get up, but can’t. CARTER You’re not supposed to move. You’ve been banged up pretty bad. She lets them lower her back down. CARTER (CONT’D) Do you remember anything? TREE Lori? She’s dead? He shakes his head. DAVID The police know everything. They found her journal. She takes Carter’s hand.   Then her Dad’s. Tree is grateful. Just then, Dr. Winter appears. DR. WINTER She needs her rest. You can visit her later. DAD I love you. TREE I love you, too. As dad starts off, Carter steals a little kiss, adding: CARTER You still owe me a date. Tree smiles. They leave.   Alone with Dr. Winter: Tree winces. TREE Can I get something for the pain?  108. DR. WINTER In your condition, I’m afraid anything I would prescribe could be dangerous. You might need to put up with some pain for a day -- can you do that? Tree smiles. TREE I can handle one day. Believe me. Dr. Winter excuses himself. Tree closes her eyes, soaking in the sunlight of this new day, pouring through the window -- -- when she’s suddenly aware of a shadow over her. She sees the silhouette of a nurse standing over her. The woman is preparing a syringe. Tree raises her hand to try to get a look at the nurse. TREE (CONT’D) Excuse me.   What are you doing? NURSE It’s for the pain. The nurse brings the syringe to the I.V. tube. TREE But... the doctor said no. The nurse steps closer...  It’s Stephanie -- Gregory’s wife.  STEPHANIE Not your pain, Teresa. Mine. Did you think you’d get away with screwing my husband? Stephanie empties the syringe in the intravenous. TREE You’ve got to be kidding me.  109. ...whispers Tree, even as she begins to convulse...  SLAM CUT: END CREDITS *ALTERNATE ENDING* INT. CARTER’S DORM ROOM - MORNING  The bell tolls outside. Tree stirs from her slumber. She sits up...notices she’s wearing the same oversized T- shirt. TREE No... She spies Carter -- bent over, in front of the couch putting something away. Tree’s eyes go wide wi",
      "dialogue_count": 0,
      "word_count": 714
    }
  ]
}