{
  "slug": "harriet-2019",
  "title": "harriet",
  "genre": "drama",
  "format": "film",
  "scenes_count": 21,
  "characters_count": 0,
  "characters": [],
  "total_words": 24258,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. ARMY ENCAMPMENT - SOUTH CAROLINA - NIGHT - 1863 100 BLACK UNION SOLDIERS are assembled, bayonets pointed at the starry sky.   A legend tells us this is...  South Carolina, 1863 - Two years into the Civil War...  A small black woman, HARRIET TUBMAN, 40, addresses the troops.   We hear her before we see her... HARRIET Suppose there’s a snake coiled at your feet, and it shoots up to bite you. We catch glimpses of her through their bodies as she paces in front of them.   Her plain face with its habitual scowl, her eyes alive with passion. HARRIET (CONT’D) Folks get scared and send for a doctor to cut out the bite.   But the snake, he rolled up there and while the doctor cutting, he bites you again, in a new place this time.   The doctor makes another cut, the snake spring up and bites again.   Finally you realize the snake ain’t gon’ stop til someone kills him. A white commanding officer, COLONEL MONTGOMERY, watches intently as Harriet continues... HARRIET (CONT’D) Slavery is still alive.   Those rice fields downriver are feeding Rebel troops, with the toil of a thousand slaves still in bondage.   Our mission is to free those slaves.   We’ve waited years to be allowed to fight in this war, against our own enslavement.   And   it will not be won without us!   Now is our time! Are you ready to kill the snake? The men shout, YES, their eyes fierce, emotional. Harriet nods in approval.   As we watch, she retreats into herself, as if listening to inner music, or voices we can’t hear.   INSECTS CHIRP in an eerie chorus, taking us into...  FLASHBACK VISION:   A SERIES OF IMAGES   - monochromatic, out of sync and nightmarish -",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 289
    },
    {
      "scene_number": 2,
      "slugline": "EXT. BRODESS FARM -   FLASHBACK/VISION  TWO YOUNG BLACK WOMEN in their early twenties, LINAH AND SOPH, faces twisted anguish, as they are ripped away from their family at gunpoint by WHITE MEN and dragged to a slaver’s carriage, where other SLAVES are shackled.   Their mother, RIT, wails in grief as-- HORSES’S HOOVES pound, carrying them away, their expressions of despair seared into our memory.   The chorus of insects grows louder, until it becomes overwhelming, like every insect chirping at once... We hear A VOICE, eerily present, otherworldly...   MINTY!  SLOW FADE IN:  EXT. BRODESS FARM - BUCKTOWN, MD - CLOVER PATCH - DAY -   1849  ON “MINTY” ROSS (YOUNG HARRIET) mid-twenties, a distinct dent in her forehead, from a wound long healed.   Her eyes flutter. A handsome black man, JOHN, 28, is shaking her awake.  JOHN Minty! Her eyes open, taking him in... deep brown skin, full lips, eyes sparkling with excitement... MINTY John... She’s lying in a clover patch in the field.   He pulls her to her feet and kisses her above her scarred forehead.   Minty is small and muscular, a foot shorter than John. JOHN Least you ‘member my name.   I’m always scared you’ll wake up from one a them spells and forgit it. MINTY Johnny, Johnny, Johnny... JOHN Guess what I got, Minty-mine? He pulls a document from his pocket and waves it.   Her face lights up.   She grabs for it. MINTY Oh, Lord, is it...?  (CONTINUED)  2.",
      "characters": [],
      "action_text": "He holds it above her head.   Minty jumps into his arms.   He checks to make sure no one’s looking and then spins her, kissing her deeply.   A stolen moment. Minty’s father, BEN, 60, handsome and wiry, stands a discreet distance away, letting the lovers have their space.   She runs to him. MINTY (CONT’D) Daddy!   We got it!   We got de letter! What it say, John?   Read it to me! JOHN Don’t need to, got it remembered. (reciting)  “...I, Joshua Abrams, having reviewed the original last will and testament of Atthow Pattison...”  As Minty walks away between Ben and John, their voices are lost beneath a louder, soulful voice, singing... REVEREND GREEN (PRELAP)  Hold on!  SLAVES (PRELAP)  Hold on!  REVEREND GREEN (PRELAP)  Hold on!  SLAVES (PRELAP)  Hold on!  EXT. BRODESS FARM - HOUSE - LATER A plantation house is situated scenically in fields of wheat and corn.   20 Slaves are gathered in front of the wide veranda where... REVEREND GREEN, 55, black, is leading them in a slave spiritual. REVEREND GREEN  Keep your hand on the plow and hold on! Wanna get to heaven I’ma tell you how; Keep your hand on the gospel plow. Keep your hand on the plow and hold on!  Amongst the slaves are Minty, John and Ben, along with other members of the ROSS FAMILY; Ben’s wife, “RIT,” 57, fierce and emotional;  (CONTINUED)  3. their children, ROBERT, 32, tall and muscular, BEN JR “JUNYAH”, 26, HENRY 18, and RACHEL, 20, heavily pregnant and with a toddler in hand.   All singing with mournful passion. REVEREND GREEN (CONT’D)  Hold on!  SLAVES  Hold on!  REVEREND GREEN  Hold on!  SLAVES  Hold on!  REVEREND GREEN & SLAVES  Keep you hand on that plow and hold on!  Keep you hand on that plow and hold on!  EDWARD BRODESS, white, 46, watches from the porch of the big house with his wife, ELIZA, 44; his son, GIDEON, 26, handsome with piercing eyes; twin boys, VINCE and VICTOR, 12, and a girl of 10, BECKY. REVEREND GREEN I leave you today with these words, from Colossians 3:22.... “Slaves, obey your earth",
      "dialogue_count": 0,
      "word_count": 4711
    },
    {
      "scene_number": 3,
      "slugline": "EXT. RIVER BANK - DAY Gideon, Foxx and the dogs search the river’s edge.   Down river, Morris shakes his head and draws a hand across his neck.   She must be dead. EXT. RIVER BANK - DOWNSTREAM - AFTERNOON Minty wakes, sprawled at the edge of the river bank.   She pushes onto her hands and knees, vomiting water.   After a moment, she crawls to her feet.   Her shoes are gone, along with her head wrap, the knife, everything but her tattered dress, which hangs indecently from her battered body. She searches frantically in her pocket for the figurine of her father, giving a sob of relief when she finds it. Barefoot, hair wild, she trudges off. EXT. FARMLAND - MARYLAND-DELAWARE BORDER - LATE AFTERNOON Minty runs through wide open farmland, exposed in the afternoon light, searching desperately for a place to hide. She sees... A FARM HOUSE in the distance.   Another across the road, field- hands with the cattle, slaves working the fields. Minty sees a farm cart, covered with a tarp.   She sprints towards it... EXT. FARM CART - SAME The cart is piled high with wheat and hay.   Minty crawls beneath the tarp and tucks herself between bales of hay. She rests.   Her breathing slows, her eyes closing... EXT. FARM CART - PRE-DAWN ON MINTY - She opens her eyes.   The cart is moving!   Minty peeks from underneath the tarp... EXT. COUNTRY ROAD - CONTINUOUS MINTY’S POV - The farm cart bumps along a country road, passing...  (CONTINUED)  22.",
      "characters": [],
      "action_text": "SLAVE CATCHERS, heading the opposite direction... THREE RUNAWAY SLAVES tied together in the back, passing close enough to see their despair. EXT. COUNTRY ROAD - JUST BEFORE SUNRISE The cart stops.   Minty peeks from underneath the tarp... The farmer dismounts.   He looks up at the stars.   He speaks softly, almost to himself. FARMER I know you’re there.   I’m heading to market, just up the road.   Best get out now. Minty jumps from the wagon and darts into the trees.   She watches as the farmer climbs on his horse and drives off. The sky breathes with dawn’s first light.   Minty finds the North Star and runs. EXT. DELAWARE - RIVERFRONT - DAY The sky is just clearing after a downpour.   Minty is soaked and shivering, hiding at the corner of a tavern near a sparsely populated stretch of waterfront. MINTY’S POV - A WHITE COUPLE kiss in front of the tavern, 20 feet away.   Minty looks past them to... A BLACK BOAT WORKER docking his skiff. As the couple moves off, Minty makes a dash for the river, approaching the black boatman. MINTY Suh... You know a blacksmith round here, name of Garrett? The boatman, JASPER MARLEY, looks down at the tiny figure in the drenched, torn dress.   He quickly whips off his rough cloak and throws it around her shoulders. JASPER Careful, girl.   You half dressed, look half dead.   Anyone with eyes can see what you are.   The man you looking for is on the corner of 4th and Shipley.   No more than half a mile west.  (CONTINUED)  23. Minty pulls the cloak around her.   It drags the ground.   She looks up into the sailor’s rough, worried face. MINTY Thank you, suh. She staggers off.   Jasper watches with concern. INT./EXT. GARRETT HOUSE AND SHOP - SHIPLEY STREET THOMAS GARRETT, a youthful and robust white man in his fifties, dressed plainly in the manner of the Quakers, polishes a set of fire irons, an assortment of ironworks on display around him. He hears a rustling and looks up, jumping as he sees Minty, shrouded in the dripping cloak, like dea",
      "dialogue_count": 0,
      "word_count": 1253
    },
    {
      "scene_number": 4,
      "slugline": "EXT. PHILADELPHIA - STREET - DAY The bustling city of Philadelphia.   A carriage passes, revealing Minty.   She looks around her in wonder. BLACK VENDORS roast oysters, chestnuts and corn, or peddle matches and flowers to fashionable WHITES. Minty feels conspicuous, fighting the urge to duck when whites look her way.   She approaches a VENDOR. MINTY “Please, suh... I lookin’ for de Pennsylvania Antislavery Society. VENDOR Corner of 5th and Arch Street, bout half a mile down. He looks her over, realizing. VENDOR (CONT’D) (he lowers his voice) Don’t be afraid, there plenty of us here in Philadelphia.   Walk like you got a right to, won’t nobody pay you no mind. Minty nods gratefully and continues on, trying to walk like she’s got a right to. INT. PENNSYLVANIA ANTISLAVERY SOCIETY - DAY PRINTING PRESS - A pamphlet is being copied. WILLIAM STILL, 28, black and dashingly handsome, carefully pulls a pamphlet from the press, the ink still wet.   He hangs it up to dry next to others on a rack.   The pamphlet is titled,   ANTI-SLAVERY REFORM.  Minty enters.   William peers through the pamphlets. WILLIAM STILL May I help you? She checks the daguerreotype against the man in front of her. MINTY Suh, are you Mr. William Still? WILLIAM STILL I am.   And you are...?  (CONTINUED)  27.",
      "characters": [],
      "action_text": "MINTY (she hesitates) ...A white man name of Garrett sent me. A beat.   William looks at her with clinical interest. WILLIAM STILL Please, have a seat. William leads her to a chair by a desk.   He disappears into a back room and returns a few moments later with a cup of water and a weathered copper case, from which he removes a marbled NOTEBOOK.   He puts the cup in front of Minty and opens the book, dipping a pen in ink. Minty drinks the water, gratefully. WILLIAM STILL (CONT’D) What is your full name and where are you from? She hesitates.   He tries to put her at ease. WILLIAM STILL (CONT’D) This book is full of fugitive slave histories.   I keep a record of most of the slaves that come through Philadelphia.   Some I have to find, most find me, as you have. MINTY My name Araminta Ross Tubman.   Folk call me Minty.   I come from Dorchester County, Maryland, farm of Edward Brodess. WILLIAM STILL Edward Brodess is your master? MINTY Massa Brodess dead.   His wife, Miz Eliza, own me and my family. WILLIAM STILL Not you, not anymore. Minty is quiet as she tries to grasp this concept. WILLIAM STILL (CONT’D) Where are the others? MINTY Weren’t no others.  (CONTINUED)  28. WILLIAM STILL You can tell me, Minty.   I’m a friend. Who did you escape with? MINTY I left my husband an family.   T’was jus me, an de Lord. William takes this in, blown away. WILLIAM STILL You’re... a brave and lucky girl, Minty. I don’t know if you realize how extraordinary it is, what you’ve done. By some near miraculous means, you’ve made it 100 miles, alone, to freedom. (collects himself) Would you like to choose a new name, to mark your freedom?   Many ex-slaves do. Whatever name you want. MINTY (thinking) Dey call my mama Rit, but her name Harriet.   I want my mama name, and my husband.   Harriet Tubman. We see the name,   Harriet , as he writes it in his book.   From now on, we will call her Harriet.  WILLIAM STILL Very good.   So, tell me, Harriet, how would you characterize your master?   Wha",
      "dialogue_count": 0,
      "word_count": 1346
    },
    {
      "scene_number": 5,
      "slugline": "INT. ROOMING HOUSE - KITCHEN - EVENING Marie carries a pot of hot water from the fire and pours it into a copper tub, already half-filled. MARIE BUCHANON I’ll warm your plate.   You need anything, just let me know. A folding screen separates the tub from the kitchen, offering a bit of privacy. Harriet takes off the dress and underclothes and lets them fall to the floor.   She catches her reflection in a piece of mirror.   A map of scars, both old and new, covers her lean, muscular body. Marie catches a glimpse of Harriet’s body as she lowers herself into the bath. MARIE BUCHANON (CONT’D) You got a man?  BEHIND THE SCREEN - Harriet sinks lower in the tub, delighting in the sensual warmth of the bath.  HARRIET My husband, John.   He free like you.   He was gon run wit me, but I’s scared if we get caught, dey take his freedom.   So I left ‘im. She watches the dust dance in the fading light. HARRIET (CONT’D) Now I wish he was here wit me.   Must’a been hard on him when dey found me gone. MARIE BUCHANON The boatmen, the “black jacks,” travel up and down the Delaware and Chesapeake Bay. Maybe they can get word to him that you made it.   Then he can come to you. Harriet brightens.   She sits up, splashing. HARRIET Thank you, ma’am.  (CONTINUED)  33.",
      "characters": [],
      "action_text": "MARIE BUCHANON Call me Marie.   Wash up good.   Tomorrow we gonna get you a payin’ job. Harriet grins at the thought.   She soaps her hair, vigorously.   Then puts her head under the water. INT. HOTEL ROOM - SUMMER - 1850 - DAY A BROWN HAND polishing wood until we can see reflected... Harriet, in a maid’s uniform, hair tamed, furiously cleaning. Time has passed and she looks healthy and fit, but there’s something manic about the way she works, as if she’s trying not to think.   A tear hits the polished wood.   She wipes it away. A young black woman, JESSE, pauses outside the open doorway, watching her. JESSE Slow down, Harriet.   They don’ pay us by the bushel! Seeing her mood, Jesse comes in and helps Harriet make the bed, looking across at her with concern. JESSE (CONT’D) Come to the social tonight.   You might have fun.   Would that be so terrible? Harriet doesn’t answer.   Jesse looks at her, knowingly. EXT. DOCK - AFTERNOON Harriet hurries down a narrow street to the river.   She’s grown more confident in her manner, no longer fearful.   She spots a boat worker she knows and waves... It’s Jasper, the black sailor she met in Wilmington. JASPER Hello, Miss Harriet! HARRIET Jasper!   Any word from my family? JASPER Yes, ma’am.   Brought some lumber from the Eastern Shore.   Your husband and family know you safe.  (CONTINUED)  34. HARRIET My husband send word back? JASPER No ma’am.   No word ‘cept what I tol’ you. Harriet turns and walks away, crestfallen. INT. PENNSYLVANIA ANTISLAVERY SOCIETY - AFTERNOON Harriet barges into the office, barely noticing... The bustle of people, mostly white, engaged in various activities, passing pamphlets, signing petitions... William, writing at his desk, looks up. WILLIAM STILL Harriet!   How are you? HARRIET Mr. Still, I need yo angels to help git my husband an family. WILLIAM STILL That’s not how it works, Harriet.   My “angels” are part of a sophisticated network, not for your personal use. Trust that we are doing what we can,",
      "dialogue_count": 0,
      "word_count": 2441
    },
    {
      "scene_number": 6,
      "slugline": "EXT. THOMPSON’S MILL - TREE GROVE - DUSK Harriet runs into the grove of trees, reckless, consumed with anguish.   She howls, devastated. HARRIET Why, Lord?   I listen for your voice!   You tol’ me come, I came!   You led me back here!   Why bring me all dis way to rub mud in my face?   Why you let me live? She contemplates the gun in her hand... The sound of insects grows louder... Harriet arches backwards and falls to the ground, twitching in spasms.  HARRIET’S VISION - A RAVEN stands in front of her.   She hears THE VOICE:   Harriet!  EXT. BRODESS FARM - VISION A strange dark cloud throws an eerie shadow over HARRIET’S BROTHERS in the fields. EXT. WOODS - DAY - VISION Harriet runs, FEET skimming the earth.   Other BROWN LEGS follow; men, women, children... EXT. ORCHARD - VISION  THE RAVEN looks at her.   LEAD THEM.  EXT. THOMPSON'S MILL - ORCHARD - NIGHT Harriet wakes and stands shakily. BEN (O.S.) John told me you was here. BEN sits close by, back against a tree, kerchief tied over his eyes, Harriet’s satchel at his feet. HARRIET Daddy... He reaches for her and she pulls him to his feet, falling into his arms, heartbreak washing over her.  (CONTINUED)  44.",
      "characters": [],
      "action_text": "HARRIET (CONT’D) Johnny don’ love me no more. Ben takes her shoulders, shaking her. BEN Minty, some things ain’t meant to be. But you here now is a miracle - I got your brothers hidin’ in the corncrib. Miz Eliza fixin’ to sell ‘em. Harriet is sobered by this, realizing the significance of her vision... Ben hands her the satchel. EXT. CORNCRIB - NIGHT Harriet leads her father to the corncrib. BEN They been waitin’ on Robert.   Mary’s in labor and he won’t leave her til she delivers. He unlatches the door and Harriet’s brothers - Junyah and Henry climb out. HARRIET Junyah... Junyah hugs her tight. JUNYAH Minty!   Cain’t believe it’s you. HARRIET Henry! Henry’s face lights up as he joins in the hug. JANE, a slender girl disguised as a boy, climbs gingerly from the corncrib.   Junyah goes to help her. JUNYAH Minty... this my fiancee, Jane.   From Horatio Jones farm.   Her massa been beatin’ her bad.   She comin’ wit us. Henry helps a woman, PHOEBE, 20, with a baby in arms.  (CONTINUED)  45. HENRY Phoebe asked to come too.   She scared of bein’ sol way from her baby. PHOEBE My husband pass last Spring.   She all I got. Harriet looks at the infant sleeping in Phoebe’s arms. PHOEBE (CONT’D) When I hear you made it to freedom, I name her Araminta.   Maybe she see freedom too. Harriet takes them in, overwhelmed.   She looks at Baby Araminta.   Phoebe is desperate. PHOEBE (CONT’D) She’ll be good, I promise.   Your sister, Rachel, she stole Miz Eliza’s laudanum, to keep her quiet. HARRIET Where is Rachel?   Where my sister? HENRY Rachel too scared to run, Minty.   She say Miss Eliza got a hawk-eye on her. Harriet turns to her father. HARRIET And mama? BEN Rit wit me. ANGLE ON - BEN’S CABIN in the distance, where they can see Rit moving slowly about inside. BEN (CONT’D) Miss Eliza let me buy her freedom.   Ain’t have much use for her.   Rit ain’t been right since she heard you drownt.   Her heart would burst, she knew you was here, bout to run again, wit the boys.   I’ll take c",
      "dialogue_count": 0,
      "word_count": 1024
    },
    {
      "scene_number": 7,
      "slugline": "EXT. WOODS - NIGHT The freedom seekers follow Harriet through trees.   They approach a clearing by a body of water.   The baby starts to cry.   They freeze.   Robert is instantly protective of the child. ROBERT She hungry.   She gotta eat. POV - The fugitives sit amongst the trees as Phoebe breast- feeds the baby.   Someone is watching... We hear a scratching sound... A DARK FIGURE crouches in the trees, gangly and nappy-haired, capturing the scene in a sketchbook. EXT. REV. GREEN'S CHURCH - NEAR DAWN Harriet and the freedom seekers approach through the graveyard.   Robert is skeptical.   He won’t go further. ROBERT I don’ like dis, Minty.   Reverend say der a special place in Hell for runaways.   I don’ trust ‘im. HARRIET You trust me? Robert looks at her a beat.   Begrudgingly, he nods. Harriet knocks on the door of the church.   A few beats later, Reverend Green ushers them in.   He takes Harriet by the shoulders. REVEREND GREEN It’s good to see you, girl.   Heard you’d come back.   Almost didn’t believe it. He hustles them into the sanctuary. INT. REV. GREEN'S CHURCH - SANCTUARY - NEAR DAWN Reverend Green and Henry move aside the pulpit, revealing a trap door underneath.   Green pulls it up... REVEREND GREEN Go on.   You’ll wait out the day down there.   You’ll be safe. 49.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 221
    },
    {
      "scene_number": 8,
      "slugline": "INT. REV. GREEN'S CHURCH - CELLAR - CONTINUOUS Harriet peers down.   There’s candlelight coming from below. We see FACES, peering up. REVEREND GREEN There’s others.   Word spread. THREE SLAVES are huddled in the dark - a young man, ISSAC; his father, JOE, and Joe’s mother, MIZ LUCY.   They look up at her, eyes full of fear, uncertainty and hope.   Harriet is overwhelmed. EXT. BRODESS FARM - MORNING We hear angry screaming.   Slaves in the field look at the house with anxiety. INT. BRODESS HOUSE - PARLOR - SAME Eliza rages in her dressing gown, smashing plates and vases against the walls by Foxx’s head.   He ducks, resigned. Gideon watches his mother’s tantrum, grimly. ELIZA FIND THEM, I SAID!! FOXX We will, ma’am. The twins, Vince and Victor, rush in followed by Becky. VICTOR Ma, what is it? GIDEON We had five slaves run off. ELIZA 5 slaves - over $2000!   This whole farm ain’t worth but $5000.   We got a rat in our pantry, and it will starve us if we don’t trap it and kill it!   RACHEL!! Rachel appears, holding a baby.   A brown-skinned girl of four, ANGERINE “ANGER”, trails behind her.   Rachel quickly hands Anger her baby brother and looks at her mistress pleasantly. RACHEL Yessum.  (CONTINUED)  50.",
      "characters": [],
      "action_text": "Eliza backhands her, sending her into the wall.   Anger wails. ELIZA Don’t you “yessum” me, you black bitch! Your brothers run off! Gideon grabs Rachel by the neck and pins her to the wall. GIDEON What’s your part in this, girl? RACHEL I don’ know nothin’, I swear!   I don’ even know what you sayin’!   Who run off? He tightens his grip. GIDEON I’ll snap your neck. RACHEL (choking) I... don’... know nothin’.   I swear... Gideon releases her.   She slides down the wall. He turns towards Anger and the baby... GIDEON Foxx, take these pickaninnies to market and sell ‘em. FOXX Yessuh. RACHEL T’was Minty! Something like hope lights in Gideon’s eyes.   Almost tenderly, he takes the squirming baby from Anger’s arms, turning to Rachel. GIDEON Minty’s dead, you lyin’ wench. RACHEL She alive.   She come back. GIDEON You seen her? RACHEL I hear tell.  (CONTINUED)  51. FOXX Niggers’ tales.   Like haints in the marsh.   She’s lying! GIDEON I hope it’s true.   Good Lord, I hope it is. Gideon releases the baby into Rachel’s arms.   Anger runs to her mother, burying her face in her dress.   Rachel clings to her children. GIDEON (CONT’D) Foxx, round up some men and meet me out at Poplar Neck. Foxx nods curtly and runs out.   Eliza collapses into angry tears. ELIZA How could your father leave me with his debts and his mutinous slaves?! Gideon goes to his mother. GIDEON Hush, Mama, try not to upset yourself. I’m gonna find ‘em for you - Minty too. Rachel, give her a dose of laudanum for her nerves.   I’ll deal with you when I get back. Rachel nods, terrified, thinking of the laudanum she gave Phoebe. EXT. BRODESS FARM - MINUTES LATER Gideon, on horseback, thunders toward the gate. A BLACK YOUTH steps in his path.   WALTER is gangling and nappy-haired, between 18 and 20, dressed in buckskin britches and work boots. Gideon almost runs him over, his horse rearing. GIDEON What the hell is wrong with you, boy! Outta my way! WALTER You looking for some runaways, suh? Gideon circles Walter men",
      "dialogue_count": 0,
      "word_count": 2611
    },
    {
      "scene_number": 9,
      "slugline": "INT. ROOMING HOUSE - WASHROOM - EVENING Harriet is in the tub.   Marie sits on a stool behind her, combing the knots from her freshly washed hair.   Harriet stares into shadows. HARRIET His wife a free woman, big wit his chil’. John din’ wan my babies.   Couldn’t bear de thought his chil’ren be born slaves. Every time dey tried to grow, he’d go cold an quite... and one by one dey died in my womb. MARIE BUCHANON Harriet... you are so far beyond any man I’ve ever met.   What’s a man to a woman touched by God? Harriet goes still. HARRIET You making fun a me, Marie? MARIE THIBIDEAUX Not whatsoever.   But I do have questions. You say God’s voice guides you.   What’s that like? Harriet contemplates a beat. HARRIET Sometime it sting, like a smack in de face.   Other times it soft like a breeze, gone before you sure you felt it.   Like a dream dat fly off soon as you woke.   Seem like I learn to see an hear God, like some learn to read a book.   I put all my attention on it, and act, ‘thout question, ‘fore I can wonder if I heard it at all.   ‘Fore I even understand what it mean.   I thought God meant me to go git my husband.   But John was just a way to steer me where I was needed.   Maybe God don’t want me loved.   That’s why he made me strong, not pretty.   Truth is, it probably would’a never worked, runnin’ wit John.   Men need to believe dey de boss. MARIE BUCHANAN Umhmm.   Even the best ones think they’re smarter than they are.   And better in bed.  (CONTINUED)  63.",
      "characters": [],
      "action_text": "Marie laughs.   A brief smile tugs at Harriet’s lip. MARIE BUCHANAN (CONT’D) Where’s Mr. Still taking you? Harriet shoots her a sharp look. MARIE BUCHANON I know, he’s married, but that’s a fine- looking man! HARRIET I din’ notice. (beat) He say he taking me to some kinda meeting.   Say he got folks he wanna ‘quaint me wit. Maria’s interest is piqued. EXT. PHILADELPHIA ALLEY - NIGHT Harriet, once again well-groomed and looking smart, walks down a dark alley off the main street with William Still. HARRIET There I was, wit a suit, but no husband. I felt a fool. WILLIAM STILL He’s the fool. For a second their eyes meet. HARRIET God have other plans for me, Mr. Still. WILLIAM STILL I’m starting to believe that.   That’s why I’m bringing you here. They come to what appears to be an abandoned warehouse door, guarded by a man, wearing a pistol. Harriet looks at William, eyes questioning.   Still nods to the guard. WILLIAM STILL (CONT’D) Good evening, Martin. GUARD Evening, Mr. Still.  (CONTINUED)  64. The guard opens the door.   William leads Harriet into the darkened warehouse, past dusty kegs of wine. INT. WINE CELLAR/MEETING ROOMS - CONTINUOUS William leads Harriet down a narrow stair and into a series of rooms, well lit, with many candles fixtures on the walls and tables. Inside is a bigger interracial crowd than Harriet’s ever seen.   It’s mostly black men, but there are whites as well, some women too, conversing and socializing, as if it were normal.  Several anterooms lead off from the main room, stacked floor to ceiling with wine bottles.   On one long wall hangs a huge map of the United States, showing free and slave states and the territory open to slavery or freedom by the repeal of the Missouri Compromise. HARRIET Who are these people? WILLIAM STILL This is the Committee.   The organizers and officers of the Underground Railroad, dedicated to helping slaves escape bondage.   No one sees this.   Only the initiated. Near the map is a blackboard, which reads: “CON",
      "dialogue_count": 0,
      "word_count": 2142
    },
    {
      "scene_number": 10,
      "slugline": "INT. PENNSYLVANIA ANTISLAVERY SOCIETY - NIGHT Harriet and William are alone, in mid-argument. HARRIET My sister’s in danger!   You tol’ me you’d rescue her! WILLIAM STILL I said I’d try, and we have!   She works in the Brodess house.   She’s been impossible to reach. HARRIET I can reach her! WILLIAM STILL I’ve told you, it’s too dangerous to go back there.   I forbid it! HARRIET You   forbid   it?   Do you know who I am? William sighs, with exasperated affection. WILLIAM STILL Harriet, these are dangerous times. Everyone is looking for you! HARRIET They looking for   Moses ! EXT. BALTIMORE MEETING HALL - AFTERNOON A large crowd of slaveholders, and lawmen are gathered on the steep steps.   Tempers run high as the planters demand action. A mutton-chopped slave owner, GUS VERN, is speaking. GUS VERN What’s going to be done about Moses?! This fiend is threatening our very existence! SLAVE OWNER They say he’s black as the night! GUS VERN If he was a black, we would’a caught ‘im. He’s one of those white abolitionists in blackface! Reveal Gideon, amongst the crowd.  (CONTINUED)  73.",
      "characters": [],
      "action_text": "SLAVE OWNER I don’t really care what he looks like. My family has personally lost thousands of dollars worth of labor.   Moses must be stopped now! INT. BALTIMORE MEETING HALL - DAY Men in dark pants and expensive shoes, marching towards the door... EXT. BALTIMORE MEETING HOUSE - CONTINUOUS A group of POLITICIANS in black coats and hats exit the doors, and stand at the pillared entry.   Everyone quiets in anticipation as... A LOCAL STATESMAN comes to the top of the stairs, waving a telegraph in one hand. LOCAL STATESMAN I have the results of the vote in congress, that you’ve been waiting for. The Fugitive Slave Act has just been voted into law!!   From now on, nowhere in these United States will a slave find safe harbor!   You are free to pursue your property, with the aid and protection of the law, wherever they may be! Ecstatic CHEERING drowns out the Local Statesman. Slaveholders throw hats in the air and smack each others’ backs.   Now we see Gideon, standing amongst them.   As the crowd begins to disperse... Gideon sees Bigger Long standing in an alley.   Bigger jerks his chin to Gideon.   Gideon pushes through the crowd and approaches. EXT. ALLEY NEAR BALTIMORE MEETING HALL - AFTERNOON Gideon joins Bigger. GIDEON Do you have news? BIGGER LONG A slave out at Vern’s farm heard a rumor that the gal that led your slaves off - one you lookin’ so hard for - is the slave they call Moses.  (CONTINUED)  74. GIDEON (he laughs) Moses ain’t a nigger and he certainly ain’t no woman.   He’s an abolitionist in blackface. BIGGER LONG Or maybe she’s a little black thing, bout so high, named Harriet Tubman. GIDEON I don’t know no nigger named Harriet Tubman. BIGGER LONG What about Araminta Ross? Gideon goes still.   He stunned. GIDEON Impossible.   There’s no conceivable... He falls into thought.   Bigger watches him process. BIGGER LONG My price just went up. GIDEON Only if you find her. BIGGER LONG Hear she’s hiding out in Philadelphia. EXT. BRODESS FARM - DUSK ON HARRIET, at",
      "dialogue_count": 0,
      "word_count": 1973
    },
    {
      "scene_number": 11,
      "slugline": "EXT. JASPER’S DOCK - DAY Terrified black families crowd the dock, some with everything they own, others with nothing - uprooting their lives to move to Canada. All the boats are full of passengers.   William Still looks anxiously for Harriet as Jasper tries to block more frantic people from coming onboard. JASPER No More!   We’re full up! A old man with a long white beard and striking eyes, JOHN BROWN, stands on a rise, preaching fire and fury. JOHN BROWN DO NOT RUN!   STAY AND FIGHT!   IN THE NAME OF GOD, YOU HAVE THE RIGHT TO BE FREE! Several ARMED MEN guard him, while his SONS and supporters hand out pamphlets to the crowd.   His piercing eyes meet Harriet’s. JOHN BROWN (CONT’D) STAY AND FIGHT!   GOD IS ON YOUR SIDE! For a moment Harriet is mesmerized, wanting to stay and avenge Marie’s death.   She doesn’t see... Gideon and Bigger pushing through the crowd, elbowing their way to her-- William sees them and calls to her. WILLIAM STILL HARRIET! Harriet turns and locks eyes with Gideon.   He pulls out a gun... One of Brown’s men slams into Gideon, smacking the gun in the air.   It FIRES!   CHAOS -- people duck and run. John Brown’s men face off against Gideon and his crew, shotguns raised. William reaches Harriet and pushes her to the boat. WILLIAM STILL (CONT’D) Get on the boat!   Now! HARRIET Marie... Those bastards killed her!  (CONTINUED)  83.",
      "characters": [],
      "action_text": "Jasper pulls Harriet aboard, shouting to his FIRST MATE to set sail.   As the boat pulls away, Harriet takes in the scene... The desperate faces of those left behind, John Brown’s fury... William’s stricken face... Her eyes meet Gideon’s... Gideon tips his hat.   It’s not over. EXT. BOAT - DAY Jasper puts an arm around Harriet. JASPER It’s alright.   You safe now. Harriet’s eyes swim with tears.   A pamphlet is clenched in her hand.   It reads:   JOHN BROWN, ABOLITIONIST. JOIN THE FIGHT FOR FREEDOM!  EXT. BOAT - RIVER - DAY As the sails catch wind and the boat speeds on...  SLOW DISSOLVE TO:  EXT. ST. CATHERINE’S - CANADA - DAY - 1851 A small rural enclave of displaced blacks and runaway slaves. INT. ROSS COTTAGE - ST. CATHERINE’S - DAY In the small, well-kept kitchen, 8 PIES cool on a counter. Harriet takes a pot from the stove and pours hot fruit into a crust... Suddenly she’s seized by a formidable sense of dread.   She collapses to the floor.   The hot berry mixture splashes, staining the floor like blood. As Harriet lies on the floor, a scene of tragedy playing itself out before her eyes, we hear REVEREND GREEN’S VOICE... REVEREND GREEN (OVER)  Dear Harriet and family, it breaks my heart to write you with such sad news, but I am obliged to keep you informed about your family still in bondage.  84.",
      "dialogue_count": 0,
      "word_count": 472
    },
    {
      "scene_number": 12,
      "slugline": "INT. ROSS COTTAGE - LATER Harriet sobs in Robert’s arms, with Henry, Jane and Junyah nearby.   Jane strokes her head as Reverend Green’s voice continues... REVEREND GREEN (OVER)  Your sister, Rachel, has gone to meet that good friend of the slave, the angel of death.   I am content that she has found peace at last.   I pray for her children.  INT. CARRIAGE - DAY ON HARRIET, awash in grief, eyes turned inward. REVEREND GREEN (OVER)  Yours with affection and sorrow, Reverend Samuel Green.  EXT. SEWARD ESTATE - AUBURN NY - 1851 Carriages arrive at the secluded estate in the rural and remote upstate town. ARMED GUARDS greet the guests, both black and white.   We recognize members of the Underground Railroad. Harriet is helped from a carriage by a guard.   She’s dressed in all black, wearing her grief like a gilded mantle.   It’s become her superpower. William Still rushes to meet her. WILLIAM STILL Harriet! He embraces her deeply, holding her tight. WILLIAM STILL (CONT’D) I’m so terribly sorry about your sister. The look in her eyes chills his bones. HARRIET I failed them, William.   We failed them. A silver-haired white man in his 50’s, SENATOR SEWARD, hurries over to be introduced.  (CONTINUED)  85.",
      "characters": [],
      "action_text": "WILLIAM STILL Harriet, this is Senator William Seward. SENATOR SEWARD Miz Tubman, it’s an honor to welcome you to my home. (taking her in) My condolences.   How can I help? Harriet allows herself to be led inside. INT. SEWARD ESTATE - MAIN HOUSE - DAY The main floor is crowded with Committee members, including Douglass, Garrett, Sydney Howard Gay, Lewis Napoleon and John Clay, plus many abolitionists.   Douglass greets her warmly. INT. SEWARD ESTATE - MAIN HOUSE - LATER The Committee stands around a map of the United States and Canada. SYDNEY HOWARD GAY 500 miles from the Mason-Dixon line to Canada - an unimaginable distance. JOHN CLAY Slave catchers are monitoring all the northbound travel.   God help the man without free papers.   I’ve read of freedmen being pulled from trains as far north as New Bedford and Boston. WILLIAM STILL How are we going to get our passengers from the southern farms and plantations all the way to the Canadian border? The room falls into depressed silence. FREDERICK DOUGLASS We can’t keep trying to outrun them. John Brown is right.   We have to fight. The only way to make the Fugitive Slave Law a dead letter is to make half a dozen or more dead slave catchers!   That will cool their ardor! WILLIAM STILL Perhaps civil war is our only hope. Harriet looks at them, incredulous.  (CONTINUED)  86. HARRIET We cain’t just give up and wait for war. We gotta get back to work, bringing slaves to freedom.   By train, carriage, horseback - by foot if necessary! WILLIAM STILL Harriet, it’s 600 miles from Maryland to the Canadian border.   Your longest trip so far has been 100 miles.   It would take months, not weeks.   You can’t-- HARRIET I ain’t givin’ up rescuing slaves because it’s far! She walks around the room, looking people in the eye. HARRIET (CONT’D) Many a you don’t know slavery first hand. You were born free, or maybe you been free so long, you forget what it’s like. She looks at Douglass. HARRIET (CONT’D) You got comfortable and important...",
      "dialogue_count": 0,
      "word_count": 837
    },
    {
      "scene_number": 13,
      "slugline": "INT. SEWARD ESTATE - MAIN HOUSE A meeting of the Committee is in progress.   It’s just the core group, mostly black, plus Senator Seward and a few hardcore abolitionists.   William bursts in. WILLIAM STILL Where’s Harriet?! THOMAS GARRETT Good God, friend!   What is it? Harriet walks into the room.   William’s relief is palpable. WILLIAM STILL John Clay has been captured in Maryland! Everyone reacts, their worst nightmare come true. WILLIAM STILL (CONT’D) Harriet, they know your identity.   Who knows what else he gave up.   We must assume everything.   We have to go dark while we assess the damage. ON HARRIET pondering this. HARRIET Poor John... William continues talking, but his voice is lost under the  eerie sound of insects...  Harriet falls slowly, almost gracefully to the floor.   The others surround her as she twitches and spasms. EXT. SEWARD ESTATE - GUEST HOUSE - LATER - NIGHT A more modest house on the property.   Lanterns illuminate the windows. INT. SEWARD ESTATE - GUEST HOUSE - NIGHT William Still and Harriet are mid-argument. WILLIAM STILL When were you going to tell us? HARRIET I thought you knew.  (CONTINUED)  89.",
      "characters": [],
      "action_text": "WILLIAM STILL (exasperated) That my star conductor has seizures?   I did not!   Good God!   It’s a miracle you’re still alive. (beat) Well, it’s over.   With Clay captured... HARRIET ...you need me more than ever. WILLIAM STILL Harriet, every slave-catcher in Maryland is looking for you.   If they catch you, whatever they did to Clay, they’ll do worse to you.   You can’t... (catches himself.) Senator Seward has offered you this home on his property, for you and your family. You’ll be protected here.   You can be a stationmaster. HARRIET I’m a conductor. WILLIAM STILL I won’t have you captured and killed. I’m removing you from the network. HARRIET I got my own network.   I’ll team up with John Brown.   He’s... WILLIAM STILL Mad? HARRIET Fearless. WILLIAM STILL I can’t lose you. HARRIET You tol’ your wife that? WILLIAM STILL Don’t be cruel. HARRIET You de cruel one. WILLIAM STILL If I had met you first...  (CONTINUED)  90. HARRIET I’m not your type. WILLIAM STILL How could you be?   I never dreamt God made such creatures. Harriet is moved.   They stand close to each other, the air electric between them, dwelling for a moment in intoxicating possibility... before reality sobers them. HARRIET You should... WILLIAM STILL Yes, I suppose I should.   Please be safe. The movement needs you, Harriet. Goodnight. HARRIET Goodnight, William. William goes to the door.   Harriet goes upstairs. INT/EXT. GUEST HOUSE - BEDROOM - MOMENTS LATER Harriet watches from the window as William lingers outside the front door.   He looks up at her window, meeting her eyes for a long beat, then he turns and strides off into the night. Tears pool in Harriet’s eyes.   We see William’s daguerreotype on the desk, next to the carved figurine of her father. INT. GUEST HOUSE - BEDROOM - LATE NIGHT Harriet is asleep in bed.   We float down on her... Suddenly, Harriet’s eyes open.   INTERCUT...  INT. BEN’S CABIN - THOMPSON’S MILL - HARRIET’S VISION - The WOODEN FIGURES on her father’s shelves are lit by ",
      "dialogue_count": 0,
      "word_count": 541
    },
    {
      "scene_number": 14,
      "slugline": "INT. GUEST HOUSE - BEDROOM - NEAR DAWN Harriet is up, dressing quietly, tucking the revolver at her waist. She grabs the figurine of her father. INT. REV. GREEN'S CHURCH - DORCHESTER COUNTY - DAY Rev Green is giving a sermon to a small gathering of local blacks. Walter enters the church and slides into a pew next to an OLD WOMAN in a bonnet... It’s Harriet.   He whispers. WALTER Your daddy bout to be arrested for harboring a group of fugitives heading to Dover.   One of ‘em got caught and confessed.   They on their way to arrest your daddy now! Harriet and Walter slip out of the church.   Rev Green watches them leave, making the sign of the cross. EXT. REV. GREEN'S CHURCH - DAY Harriet and Walter come out. HARRIET You build what I asked for? WALTER Close as I could. He gestures to his horse, rigged with something like a sled tipped at an angle with a board for a seat. EXT. BEN’S CABIN - THOMPSON'S MILL - AFTERNOON Harriet approaches.   On a rocking chair outside we can see Rit, kneading her hands as she rocks. CLOSER - Too much grief, abuse and worry have taken their toll.   She seems an old woman, frail of body and mind. Suddenly the chair is grabbed from behind, a hand slapped over her mouth.   Rit’s eyes go wide in terror. Behind her, Harriet whispers...  (CONTINUED)  92.",
      "characters": [],
      "action_text": "HARRIET Mama, it’s Minty.   Don’t scream.   I come to git you.   We gon’ git daddy too.   I’ma let go, but you cain’t scream, alright? Rit nods, tears of hope in her eyes.   Harriet lets go and turns Rit to face her.   Rit screams, falling to her knees. RIT Oh, sweet Jesus, take me!!   I’m ready to go.   Take me home!   I wanna see my daughters!   I wanna see my babies! HARRIET Mama, I’m no angel come to take you to heaven.   It’s Minty, come to take you North. Harriet takes off the bonnet from head and pulls her mother to her feet.   Rit studies her daughter’s face, spellbound. RIT You ain’t my Minty.   My Minty jus a plain gurl.   If you not an angel, what are you? HARRIET I’m Harriet Tubman, mama.   I’m Moses. Rit’s eyes widen.   Harriet hugs her, burying her cries. HARRIET (CONT’D) That’s right, I’m Moses, the slave stealer.   I need you to come wit me, an do exactly as I say.   Where’s daddy? EXT. THOMPSON’S MILL - LATE AFTERNOON Ben is down by the waterfall, repairing a damaged chunk of stone and mortar.   A pebble hits him on the shoulder.   He looks up... Harriet is hidden amongst the trees.   She reveals herself, gesturing to him frantically. HARRIET Daddy! Ben climbs up the fall towards her. 93.",
      "dialogue_count": 0,
      "word_count": 457
    },
    {
      "scene_number": 15,
      "slugline": "EXT. WOODS NEAR MILL FALL - LATE AFTERNOON   -   MOMENTS LATER  Ben embraces her.   He dares a look at her, for the first time since her escape. BEN Minty!   I can’t pull my eyes away.   I need to look at’ya. (tear in his eyes) It’s good to see you, gurl. He wrenches his eyes away. BEN (CONT’D) Who you come for? HARRIET You, daddy.   You been harboring fugitives? He looks at her, surprised she knows. HARRIET (CONT’D) One of ‘em got cau ght and talked.   They coming for you.   We gotta go right now! EXT. WOODS OUTSIDE THOMPSON’S MILL - DUSK Harriet and Ben join Walter at the cart, where he’s strapping Rit into the rig. RIT Ben!   Our Minty’s Moses!   One everyone carryin’ on bout. He gets into the cart beside her and pats her hand. BEN I know. HARRIET I’ma take you north to see Robert and Henry and Junyah.   But first I need you and daddy to go wit Walter to Rev Green’s church.   You’ll be safe there. Through the woods, they can see MEN WITH TORCHES in the distance approaching Ben’s cabin. HARRIET (CONT’D) Hurry.   Then meet me at Brodess Farm.  (CONTINUED)  94.",
      "characters": [],
      "action_text": "WALTER Yes, boss. Walter gets on the horse and drives off. INT. BRODESS FARM - BEDROOM - DUSK Eliza lies in bed, in the throes of an anxiety attack, stress and financial burden having taken their toll, Gideon sits by her bed, stroking his mother’s hair. A pitifully thin slave girl, Rachel’s daughter, ANGER, 8, brings in a tray, balancing the pot and cup carefully.   She goes to tip some drops of laudanum into the tea. ELIZA No more.   I don’t want it! GIDEON It’s for your nerves, mother. ELIZA I don’t want it! She knocks the tray from Anger’s hands, spilling the scalding tea, the pitcher shattering on the floor.   Anger silently bends to pick up the broken china. ELIZA (CONT’D) That girl is trying to poison me.   She blames me for her mother... They’re all conspiring against us. Gideon’s eyes catch Anger’s, her expression unreadable. GIDEON Mama, you’re just anxious. ELIZA I’m suffocating in this place.   It’s like a prison where I’m awaiting my execution, surrounded by hostile, black-faced guards. We hear a BANGING at the door... Gideon and Eliza exchange a look.   Gideon goes to the window. A GROUP OF MEN stand below in the yard.   Gideon gives his mother a look of quiet alarm and runs out. Eliza gets up, pushing past Anger to the window. 95.",
      "dialogue_count": 0,
      "word_count": 419
    },
    {
      "scene_number": 16,
      "slugline": "EXT. BRODESS HOUSE - DUSK Gus Vern and other PLANTERS we’ve seen at slaveholder meetings stand at the door.   Gus bangs again. GUS VERN Gideon! Gideon opens the door and faces the mob. GUS VERN (CONT’D) You and your mother need to come with us. We gotta discuss this Moses business, and what you intend to do about it. GIDEON My mother’s not well. But Eliza comes down behind him, pulling on a cloak. EXT. WOODS - NIGHT We see a circle of torches... A large group of planters are gathered in the woods, including Vern.   The mood is dangerous. Eliza and Gideon are in the center of the circle. GUS VERN Seeing as how Moses has been discovered to be a nigger girl from your farm, we think it’s only appropriate that you pay us restitutions for our lost property. GIDEON We don’t have that kind of money!   We’re going through hard times, like the rest of you. PLANTER Then you gon’ have to sell the farm! ELIZA NO! Eliza is fierce, eyes glittering with tears of rage.   It’s a performance, and she knows her life depends on it. ELIZA (CONT’D) We are victims of this diabolical nigger just like you are!   She ran off with 5 of our best slaves!   Our crops are meager.  (MORE) (CONTINUED)  96.",
      "characters": [],
      "action_text": "Our fortune all but gone!   My livelihood - my very health - has been ravaged.   We are   victims   like you!   We need to work together to find this thief and burn her at the stake like Joan of Arc! Angry cheers from the planters. ELIZA (CONT’D) If we work together, we can catch her.   I have a plan... She’s got their attention. ELIZA (CONT’D) I’ll put her sister’s child up for auction.   We’ll post notices everywhere. Harriet Tubman will come to rescue her niece and we’ll be waiting for her!! The planters cheer this plan.   She’s won them over.   Gideon looks at his mother with admiration.   She meets his eyes. EXT. BRODESS HOUSE - SAME Harriet sneaks up to the house and slips inside. INT. BRODESS HOUSE - BECKY’S BEDROOM - NIGHT Anger stands on a stool, combing Becky’s hair.   Vincent and Victor stand in the doorway, drunk and surly. VINCENT Where’s mama? ANGER Out wit Massa Gideon. Vincent and Victor look at each other in confusion. VICTOR She went out?   At night? VINCENT (to Anger) Girl, go get us some brandy from the storeroom! ON HARRIET, with the Colt revolver, at the other doorway. HARRIET I got a better idea.  ELIZA (CONT’D) (CONTINUED)  97. The boys turn. VINCENT Hey!   It’s-- Harriet points the gun in their face.   Becky screams. Anger looks at Harriet in terror. HARRIET (to Anger) Don’t be scared, Anger.   I’m your mama’s sister.   We family. Anger runs to Harriet, clinging to her dress. HARRIET (CONT’D) Where your brother, Anger? ANGER Trader carry ‘im off.   Dey kep us lock out in de smoke house, on’y let us out to bury mama, den de trader took ‘im. Harriet takes this in, gun aimed at the Brodess kids. INT. BRODESS FARM - OUTHOUSE - SAME Foxx is on the shitter.   The door slams open.   Walter has a gun pointed in Foxx’s face. FOXX Who the hell are you? WALTER Call me whatever you want, that’s what you white folks do. INT. BRODESS HOUSE - BECKY’S BEDROOM - MINUTES LATER Anger aims the Colt with shaking hands while Harriet finishes gagging and tying the",
      "dialogue_count": 0,
      "word_count": 793
    },
    {
      "scene_number": 17,
      "slugline": "INT. BRODESS HOUSE - BECKY’S BEDROOM- NIGHT Eliza opens the bedroom door and sees her three children tied to the bed and gagged.   She SCREAMS and faints-- The children look at their mother in dismay.   Gideon appears behind her. GIDEON GODDAMMIT!! EXT. ROAD - NEAR DAWN Gideon and a large group of LAWMEN and PLANTERS have gathered - some on horseback, some on foot - including Gus Vern, Bigger Long, Atwood and other slavers, SHERIFF NED UTLEY, Marshal, Deputies and Police.   All heavily armed and out for blood. SHERIFF NED UTLEY We will break into teams and cover this whole area, from Bucktown to Cambridge. I want law enforcement in each group. The letter of the Law must be obeyed and every precaution taken to bring this dangerous wench in alive, so she can face her full punishment!   I know some of you are itching to have a chance at her; to make her pay for what she done to your fortune and family.   Rest assured, she will be tried and executed by the harshest methods available, as dictated by the laws of the State of Maryland! The crowd cheers, some grumbling too, as the men break into groups. GIDEON Bigger and Atwood, come with me!   Let’s pay an early visit to Rev Green! The posses split up and gallop off. EXT. ROAD - DAYBREAK A covered freight wagon approaches up the road.   A single driver steers the horses. Walter steps in front of it, two guns pointed at the driver. The driver puts his hands up in panic. 100.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 261
    },
    {
      "scene_number": 18,
      "slugline": "INT. REV. GREEN'S CHURCH - MORNING Rev Green watches wearily as Gideon’s posse ransacks his church once again. The storeroom is empty.   Rev Green manages to look indignant and vindicated.   Gideon’s frustration is evident.   He spots a pamphlet on the floor, picks it up. GIDEON Look what we have here - a copy of Uncle Tom’s Cabin.   You’re in possession of banned abolitionist material, Reverend. Deputy, arrest this man! As the deputy handcuffs Green, his eyes meet Gideon’s, defiant and smug. EXT. ROAD - DAY A slender WHITE MAN drives the freight wagon with haste.   The horses seem skittish and uneasy.   It’s the light-skinned slave, Tilly, wearing Walter’s clothes, skin ash-whitened, kinky hair jammed under a hat. IN THE BACK - the wagon is filled with ears of corn, moving mysteriously as the wagon bounces along. EXT. BRIDGE - DAY Heavily guarded by lawmen.   Pedestrians have gathered to watch the inevitable capture, the air alive with excitement. SHERIFF NED UTLEY They gonna have to come this way.   We got every other way blocked off. EXT. ROAD - NEAR BRIDGE - SAME The covered wagon bounces towards the bridge, Tilly, nervous as a cat, slows the horses to a trot. TILLY I’m gonna wet myself! Harriet coaches her, voice muffled beneath the corn. HARRIET You know your massa better than de lines in your hand.   Be him.  (CONTINUED)  101.",
      "characters": [],
      "action_text": "Tilly steels her courage and drives the horses towards the bridge, doing her best to channel her master as the wagon approaches the roadblock of lawmen. TILLY (lowered voice) Gentlemen, good day.   What’s all this? A LAWMAN steps forward. LAWMAN Slave stealers on the loose.   That devil Moses.   We got a surprise for her. TILLY I hope you catch that bitch and hang her, fer mine git any ideas.   Any of ‘em even breathe that name on my farm, I’ll beat ‘em into Sunday.   Don’t let none of ‘em past the gates - not anymore.   Strange times, when a man can’t trust his own slaves.   Best o’ luck to you. Tilly starts forward.   The Lawman stops her. LAWMAN We’re gon’ have to check the cart, sir. Sorry to inconvenience you. Tilly freezes, in sirupy terror.   The Sheriff strides over, scrutinizing Tilly, something troubling him. SHERIFF NED UTLEY You related to Luther Grant? Tilly, who is, gives a shaky and ironic smile. TILLY Yes, sir.   He’s my daddy. The sheriff laughs.   He puts a foot up on the side of the wagon. SHERIFF NED UTLEY Thought I saw the resemblance!   You tell your daddy he owes me a whiskey!   Tell him Ned Utley hasn’t forgotten.   With all this corn, he should be able to afford it!   Y’all have a nice day! He waves them through. TILLY You too, sheriff.  (CONTINUED)  102. Tilly tips her hat and drives the cart over the bridge. EXT. DESERTED ROAD - MINUTES LATER Harriet and Walter, in Tilly’s dress, uncover the rest of the Freedom Seekers, who emerge from the corn, stretching cramped limbs.   Harriet pulls corn silk from Anger’s hair.   Ben rubs Rit’s shoulders. Tilly, weak with nerves, leans over her knees, trying not to vomit. EXT. BRIDGE - DAY Gideon and his posse ride up.   Gideon bristles as the lawmen chat and smoke.   He approaches the Sheriff. GIDEON Any sign of them? SHERIFF NED UTLEY Not yet.   Just the usual foot and horse traffic and a few farmers.   Luther Grant’s son came by with a freight wagon full of corn.   A good yield, by the look of it. G",
      "dialogue_count": 0,
      "word_count": 681
    },
    {
      "scene_number": 19,
      "slugline": "EXT. RIVERFRONT - DAY Harriet, her family, and the freedom-seekers are huddled in a small grove of trees by the waterfront. Ben is asleep holding Anger on his lap.   Harriet strokes her mother’s hair. RIT Tell me, one mo’ time. HARRIET (speaking softly) Senator Seward sold me a nice house on his property - big enough for everybody. You and daddy, Robert, Henry, Junyah and Jane, and Anger too.   We gon’ be together.   An no massa forcin’ us to do nothin’.   I’m gon’ spoil you and take care a you.   I love you, mama. Tears run down Rit’s cheeks.   She grips Harriet’s hand. RIT I love you too, Minty. A BOAT glides into view.   Walter waves from the deck. EXT. COUNTRY ROAD BY THE RIVER - SAME The freight wagon is abandoned by the side of the road, the horses eating grass.   Over it we see... Gideon and Bigger riding up.   The wagon is clearly empty. GIDEON They ditched it! Gideon searches the treeline, Bigger gallops ahead. EXT. WATERFRONT - SAME Harriet hands Anger up to Walter and helps the last of the freedom-seekers onto the boat.   As she prepares to climb aboard... She feels the familiar flutter in her chest, her whole body buzzing with it...   DANGER.  HARRIET Get everyone below deck.  (CONTINUED)  104.",
      "characters": [],
      "action_text": "Walter hustles the family below.   Harriet goes to the edge of the trees and peeks out... In the distance we see... Bigger galloping towards them, Gideon in the distance. Harriet ducks back into the trees and dashes for the boat. HARRIET (CONT’D) Hurry, get ‘em out of here!   We got company. Walter reaches a hand to pull her up. WALTER Alright, let’s go! She takes a step back. HARRIET Walter, promise me you’ll get Anger and my parents to safety. WALTER Why?   What’re you--? HARRIET I can’t have Gideon coming after ‘em, Walter!   If you want to help me, help my family.   Get ‘em to safety!   Promise me!  A beat.   Walter nods.   He unties the boat and pushes off. EXT. WOODS NEAR RIVER - DAY Harriet emerges from the tree-line and steps into the road, waiting for them to notice her. EXT. WOODS NEAR RIVER - ON GIDEON - spotting her tiny figure in the distance.   He shouts to Bigger. GIDEON There she is!   Get her! Harriet dashes away from the river.   Gideon and Bigger gallop after her... 105.",
      "dialogue_count": 0,
      "word_count": 395
    },
    {
      "scene_number": 20,
      "slugline": "EXT. WOODS NEAR RIVER - MOMENTS LATER Gideon and Bigger search the woods.   They’ve lost her. Gideon puts a finger to his lips. GIDEON I want her alive. Bigger nods.   They split up. EXT. ROCKY TERRAIN - DAY Harriet scrambles up a rock face, breathing hard. Below her BIGGER rides into view... He sees her and draws his gun.   She ducks as he FIRES!   A bullet hits the rocks. EXT. WOODS - SAME Gideon reacts to the gunfire, riding in the direction of the sound-- EXT. ROCKY TERRAIN ON HARRIET - Crouched against the rocks, gun aimed--FIRING!! Bigger’s hat flies off his head.   Damn close, but not close enough.   As Harriet frantically reloads her revolver, Bigger aims at her with murderous rage. BIGGER LONG You gone die bitch. GUNFIRE-- Bigger falls forward and slides off his horse, shot in the head. ON GIDEON - emerging from the woods behind him, rifle smoking. GIDEON I said I want her alive. GIDEON’S POV - As Harriet scrambles down the rocks, swinging herself onto Bigger’s horse... GIDEON (CONT’D) MINTY!  (CONTINUED)  106.",
      "characters": [],
      "action_text": "Harriet takes off.   Gideon gallops after her, HORSE’S HOOVES thundering past BIGGER’S DEAD BODY. EXT. WOODS - DAY Gideon chases Harriet through the woods, up an incline, both riding hard.   At a distance, she looks back at him... GIDEON I’m coming for you, Minty! EXT. WOODY PLATEAU - LATE AFTERNOON Gideon emerges onto a wooded plateau, starkly beautiful in the late afternoon light. Bigger’s horse is grazing some distance away, riderless. Gideon looks around.   No sign of Harriet... GIDEON MINTY! Suddenly she appears behind him, Colt revolver pointed at his head. HARRIET Toss your gun.   Easy. Gideon slowly removes his rifle and tosses it to the ground at her feet -- quickly drawing a   revolver   from his holster-- Harriet SHOOTS the gun from his hand!   Gideon howls in pain, a fleshy hole by his thumb. HARRIET (CONT’D) Off the horse. Gideon slides from his horse, cradling his bloody hand.   He faces her, breathing hard.   The two of them only yards apart, the closest they’ve been since the day she jumped from the bridge.   She tucks her revolver at her waist, picks up his rifle and trains it on him. HARRIET (CONT’D) On your knees. He sinks to his knees, looking up at her, teeth clenched in pain.  (CONTINUED)  107. GIDEON It didn’t have to end like this, Minty. You could’a stayed with us, if you only knew how to behave.   But you were so damned insolent.   Unruly and untamed.   I guess that’s what I liked about you.   And you liked me too, I know you did.   You prayed over my bed, when I was sick.   You asked God to make me well. She looks at him with something like empathy. HARRIET I asked God how a sickly little boy could think he owned me. Gideon’s eyes turn hard. GIDEON I do own you, Minty.   Even now, you’re mine.   You’re just a damn runaway. HARRIET I was never yours, Gideon.   I was never nobody’s property!   That was a lie you told yourselves.   Since the day your daddy sold my sisters I prayed for God to make me strong enough to fight, and that’s what I’v",
      "dialogue_count": 0,
      "word_count": 872
    },
    {
      "scene_number": 21,
      "slugline": "EXT. COMBAHEE RIVER - SOUTH CAROLINA - DAWN - 1863 A GUNBOAT, THE JOHN ADAMS, looms large in the background as dozens of ROWBOATS row away from it. ROWBOATS - BLACK UNION TROOPS onboard, rowing stealthily towards the shore. HARRIET stands in the prow of the lead rowboat, like a figurehead.  EXT. COMBAHEE RIVER AND PLANTATIONS - DAYBREAK As the sky breathes with light we can see the shore and tree- line.   Beyond that, the distant plantations. Harriet begins singing, in a loud commanding voice... HARRIET  WADE IN THE WATER, WADE IN THE WATER CHILDREN... WADE IN THE WATER, GOD’S GONNA TROUBLE THE WATER!  For a moment nothing changes.   Then we see... FEET RUNNING as... SLAVES begin pouring from the woods, running for the beach... towards the armed black troops in the rowboats. HUNDREDS OF SLAVES, carrying their children and meager belongings on their backs, splashing through churning water towards the boats and FREEDOM! Their voices join hers, singing triumphantly... HARRIET & SLAVES (OVER)  WADE IN THE WATER, WADE IN THE WATER CHILDREN!   WADE IN THE WATER!   GOD’S GONNA TROUBLE THE WATER!  Harriet watches from the lead rowboat, arms spread wide, tears streaming. Soldiers raise their weapons, prepared to defend the slaves or die trying.   Their voices join Harriet’s... HARRIET, SLAVES, SOLDIERS (OVER)  WHO ARE THOSE CHILDREN ALL DRESSED IN RED?   GOD’S GONNA TROUBLE THE WATER! MUST BE THE ONES THAT MOSES LED!   GOD’S GONNA TROUBLE THE WATER!  (CONTINUED)  110.",
      "characters": [],
      "action_text": "SLAVEHOLDERS and FOREMEN race from the trees, weapons aimed at the fleeing slaves. The SOLDIERS take aim -- GUNFIRE. EXT. SEWARD ESTATE - HARRIET’S HOUSE - AUBURN, NY - DAY HARRIET’S VOICE CONTINUES, singing alone soulfully as... Harriet walks wearily to her house, on the Seward Estate. HARRIET (OVER)  Wade in the water... Wade in the water children!   Wade in the water... God’s gonna trouble the water!  Rit is sitting outside on a rocker.   She sees Harriet and screams.   Harriet’s family spills out into the yard, greeting her ecstatically.   Rit and Ben, Henry, Robert, his new wife and their children, Junyah and Jane and their children, a teenaged Anger - family whose freedom she’s made possible. HARRIET (OVER) (CONT’D)  God’s gonna trouble the water!   God is gonna trouble the water!  They pull her inside and close the door. CODA:  Harriet Tubman was the most famous conductor on the Underground Railroad, helping over 70 slaves to freedom. After the UGRR disbanded at the start of the Civil War, Harriet became a spy for the Union army.   On June 2, 1863, Harriet Tubman led 150 black Union soldiers in the Combahee River Raid, freeing over 750 slaves from the rice plantations.   She is the only woman to lead an armed expedition during the entire Civil War, and one of the few women to have done so in US history. After the Civil War, Tubman remarried and dedicated her life to helping impoverished former slaves, the elderly and the women's suffrage movement. She died surrounded by loved ones on March 10, 1913, at approximately 91 years of age. Her last words were, “I go to prepare a place for you.”  111.",
      "dialogue_count": 0,
      "word_count": 519
    }
  ]
}