{
  "slug": "helix-101-pilot-2014",
  "title": "helix 101 pilot",
  "genre": "thriller",
  "format": "series",
  "scenes_count": 4,
  "characters_count": 0,
  "characters": [],
  "total_words": 11226,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. CDC - DAY  Farragut storms towards his car. Walker follows.  FARRAGUT  You sat there saying nothing. You  owe me more than that.  Walker’s face -   I owe you?  FARRAGUT (CONT’D)  I was set up.  WALKER  Set up how? They came to you  because he’s family -  FARRAGUT  Fort Bragg doesn’t operate on  courtesy. They came to me because -  WALKER  You’re the best?  (then)  Don’t flatter yourself. I could do  this on my own.  FARRAGUT  Then do. Because I’m not going.  Walker grabs him by the arm.  WALKER  I know you’re upset. I also know  you   want   to   go.  The two stare at each other - and we know Walker’s right.  Farragut shakes her off, gets into an old Volvo, and drives  off.  INT. FARRAGUT HOUSE - DAY  A Victorian home in the final stages of being packed up.  Farragut enters quietly, stands in the doorway, and watches  his wife -  MARGARET (29), good natured, pretty, but slightly too thin,  pack a box of wedding photos. She moves about her task with  an excitement that breaks Farragut’s heart. Finally -  FARRAGUT  Hi.  9.",
      "characters": [],
      "action_text": "Margaret looks up, smiles. She clearly loves him too.  MARGARET  You’re home early. Good, I could  use another pair of hands.  Farragut walks over, kneels beside her. But instead of  helping, he just sits there.  She looks up, smiles again. He smiles back, sadly. And with  that one look, she knows...  EXT. FARRAGUT’S BACKYARD - DAY  Farragut sits with his wife on a porch swing. She’s curled up  against him, trying to act braver than she actually feels, as  they rock back and forth.  FARRAGUT  I don’t   have to go.  MARGARET  He’s your brother.  FARRAGUT  But we hadn’t even spoken in twenty  years. The guy didn’t even come to  our wedding.  MARGARET  You   almost didn’t come to our  wedding.  For a brief moment, both laugh. These two have a long  history. She takes his hand.  MARGARET (CONT’D)  I’ll be fine.  FARRAGUT  You deserve better than this. I  keep saying that but -  MARGARET  One last case isn’t going to kill  us.  Margaret immediately regrets her choice of words, buries her  head into him.  FARRAGUT  I   don’t   have to go.  10. MARGARET  - but you should.   You know you  should.  More silence.  FARRAGUT  You’re the only family that matters  to me.  MARGARET  You’re the only family that’s   ever  mattered to me.  She wraps up against him even tighter. Then -  MARGARET (CONT’D)  When do you leave?  Farragut starts to answer, then stops. Runs his hand through  her hair. And she, knowing him all too well -  MARGARET (CONT’D)  There’s a car waiting outside,  isn’t there?  HARD CUT TO:  INT. ARMY HELICOPTER - TWILIGHT  Farragut, now in a military jump suit, sits with Walker,  Major Balleseros, and...Sarah Jordan?  Jordan, thick reading glasses now fogged over, looks even  skinnier in gear. She shakes from the cold. Walker removes  her own jacket, hands it to Jordan, revealing a frame that’s -  Feminine, shapely, but   ripped . If we had to fight any of  these four, Walker would be last on the list.  And she knows it.  FARRAGUT  We’re going to follow normal  expe",
      "dialogue_count": 0,
      "word_count": 924
    },
    {
      "scene_number": 2,
      "slugline": "EXT. AREA 32 INTERNATIONAL RESEARCH BASE - DAY  The helicopter touches down and our foursome are immediately  greeted by Pederson and Hataki. Now without their suits on -  Pederson is beyond huge. He could play football for the Jets.  Hataki, meanwhile, is extremely handsome, with sharp features  and deep eyes - the Japanese George Clooney.  Both men are clearly unhappy to have visitors. Pederson steps  forward.  PEDERSON  Colonel Frank Pederson, Army  Procurement.  Pederson and Balleseros salute one another.  PEDERSON (CONT’D)  Sorry there’s no red carpet, but we  didn’t know you were coming till an  hour ago. We’re not really used to  having guests.  FARRAGUT  Well here we are.  HATAKI  Hiroshi Hataki. Roland  Pharmaceuticals.  Farragut and Walker exchange a look.  HATAKI (CONT’D)  Both the deceased and the surviving  patient are sequestered inside.  Follow me.  Suddenly, the helicopter starts to lift off. Walker spins,  concerned.  PEDERSON  It’s too cold to keep the copter  stationed here. Besides -  Pederson gestures to black SIGNS in several languages marking  the facility as a QUARANTINED RESEARCH AREA.  PEDERSON (CONT’D)  - we don’t need the pilots any more  spooked than they are already. Camp  Eisenhower is just forty miles  south. They can be here at a half  hours notice.  14.",
      "characters": [],
      "action_text": "All six start approaching the entrance, but Jordan can’t take  her eyes off the signs.  WALKER  (quietly to Farragut)  Big pharma working with the  military?  Hataki,   thirty feet away   but still overhearing her -  HATAKI  We’ll tell you everything inside.  From Walker’s now creeped out face, we seriously doubt this.  INT. AREA 32, INDUSTRIAL LIFT - DAY  A private glass elevator slowly moves floor by floor down the  center artery of the complex. As they descend, they see  SCIENTISTS moving about the facility.  Our team changes into AREA 32 SCRUBS while Pederson explains.  PEDERSON  One hundred and six doctors,  including Hataki and me, work the  two hundred and fourteen thousand  square foot complex. On top of the  research, we handle all cooking,  cleaning, and facility maintenance.  Think of us like a space ship. But  with way better technology.  Jordan appears slightly uncomfortable changing out in the  open.  PEDERSON (CONT’D)  Relax, it’s one way glass.  (then)  It’s important for you to keep a  low profile. Our research,   and   the  way we conduct ourselves, has  political implications.  WALKER  How? What is this place?  Hataki starts to answer while Pederson pulls out a tray with  four DEX SYRINGES. Farragut, Walker, and Jordan immediately  inject themselves. Balleseros just stares at the needle.  15. HATAKI  We’re a research lab. Just like you  were told. A place for the private  and public sectors to come together  across countries to create new  partnerships.  As they descend further and further, the number of scientists  radically thins out, replaced by COMPUTER MAINFRAMES, then  HEAVY SEALED DOORS. Doors that are impossible to see past.  HATAKI (CONT’D)  I’ve been overseeing Area 32’s  research since it’s inception in  hopes of piggy backing on anything  that has commercial applications.  Needless to say, it’s an extremely  delicate operation, all the more  reason we need you to -  FARRAGUT  We got it. But right now, we’re  wasting time.  (to Balleser",
      "dialogue_count": 0,
      "word_count": 3302
    },
    {
      "scene_number": 3,
      "slugline": "INT. SLAMMER OBSERVATION ROOM - DAY  Farragut sits at a table with Walker. She clearly wants to  keep discussing the connection with the brother, but one look  from Farragut’s face wards her off.  WALKER  Fine.  (then)  Where’s Ballerseros then?  FARRAGUT  Late.  WALKER  Figures.  FARRAGUT  Meaning what?  WALKER  Meaning we know nothing about him.  FARRAGUT  He’s just doing his job. And nobody  likes to inject themselves with  needles. We’re the freaks.  She relaxes - he’s always a step ahead of her in the  conversation.  WALKER  Speaking of, where is Jordan?  FARRAGUT  Preparing the samples.  WALKER  She do okay?  FARRAGUT  Better than you your first time.  WALKER  And the...remains?  FARRAGUT  Too early to say. Based on what I  saw in the bag, the virus is  foreign to anything we’ve ever seen  before.   Looks man made.  WALKER  Big pharma messing around in the snow.  30.",
      "characters": [],
      "action_text": "FARRAGUT  Don’t read into it. You know what  else is man made? Tylenol. People  die from over-the-counter meds all  the time. He could have been sick  before he even arrived here.  (then)  You find anything?  WALKER  Six transmission candidates, one  especially good one. An African  Doctor.  (then)  Why am I assigned to -  FARRAGUT  Because you’re good at coaxing  information out of men. I imagine  it has something to do with the one  way nature of the attraction.  Walker tries to suppress her smile.  FARRAGUT (CONT’D)  This stuff always has more to do  with people than pathogens. You  know that. These interviews are our  best chance of solving this thing.  WALKER  The first one starts in an hour.  FARRAGUT  Then let’s get this over with.  And with that, Farragut hits a switch, revealing DR. MARK  LIGORIA on the other side of the glass. The man is catatonic,  but stable. He’s loosely restrained by leather bands -  reassuring given the man has the build of a professional  wrestler, and the stare of a dead man.  WALKER  Look at his eyes.  FARRAGUT  Disease crazy? Or “crazy cause they  locked me up here and no one’s told  me anything”?  Point made. Farragut hits a button, speaks into a microphone -  31. FARRAGUT (CONT’D)  Dr. Ligoria, my name is Dr. Alan  Farragut, of the United States  Center for Disease Control. My  colleague, Dr. Katherine Walker,  and I have reviewed the account you  gave Dr. Hataki, and we have some  follow up questions. If you  understand what I’m saying, please  respond in the affirmative.  The man lifts his eyes.  FARRAGUT (CONT’D)  You stated that you had zero  interaction with Dr. Paul Farragut  in the week prior to noticing your  initial symptoms. Is that correct?  The man nods.  FARRAGUT (CONT’D)  And in the report you describe  those initial symptoms as minor  hallucinations, feeling numb to  pain, followed by slight  hemorrhaging in the gum line, and a  progressive fever. May I ask why  you took twelve hours to report  your condition to y",
      "dialogue_count": 0,
      "word_count": 6085
    },
    {
      "scene_number": 4,
      "slugline": "INT. MAIN FLOOR - DAY  She weaves in and out doctors like a running back, stopping  over and over to scan the facility.  But because of the chaos, NO ONE is where they’re supposed to  be. All doors that should be closed are open. All rooms that  should be full are empty.  Where the hell is he?  She takes a left, passes through the -  INT. DINING HALL - NIGHT  Plates of FOOD sit along tables, abandoned by the diners now  working their stations.  It feels like a ghost town. She passes through the also empty  kitchen, into the -  INT. BOILER ROOM - NIGHT  Rows of PISTONS and WATER TANKS creak as they move up and  down. Almost like a maze.  Walker picks her way through it, and in the distance, sees -  A BLACK MAN with his back to her, playing with a THERMOSTAT.  She darts towards him, hurdling around two boilers, spins him  around.  BLACK SCIENTIST  What the -  But it’s not him.  WALKER  Shit.  BLACK SCIENTIST  Who the hell are -  But she’s already off to -  INT. DORMITORY - NIGHT  Walker runs past more empty rooms, looking for Babington’s.  Finally, she finds it.  60.",
      "characters": [],
      "action_text": "LOOKS IN -  It’s empty. Someone under the sheets. Not moving.  Walker whips off the sheets to see -  DIRTY LAUNDRY.  She exits - keeps moving. Faster and faster. But where else  to look?  She runs up a ladder, looks over the entire floor. This place  is   way too   big. She’s starting to give up when -  She sees a communal bathroom. Heads in -  INT. BATHROOM - NIGHT  Walker scans the room - white, huge, bright overhead  lighting. It’s rare to see a shared bathroom this empty.  Eerie almost.  A FAUCET runs in the distance.  She walks towards it. Peering around as she moves. It’s so  quiet compared to what’s going on outside. And with each few  feet she sees HERSELF, over and over again, in a different  above sink mirror.  She sees her own eyes. She looks rawer than ever.  And fierce.  She stops in front of the faucet, turns it off.   But...WATER  is still running somewhere. She scans the row of faucets. All  off.  She then turns, sees -  BABINGTON. COVERED IN BLOOD. Lying DEAD under a still running  SHOWER.  Walker gasps, falls to her feet.  She looks up. A panel in the roof’s been displaced. As if  someone’s climbed back up.  Shaking, she moves closer to the naked body. It’s been  punctured in two different places. And ORGANS have been  removed.   This can’t be happening.  And then, she sees it.  61. A BONE SAW.   Farragut’s   BONE SAW .  Also covered in blood. Left. Like a calling card.  INT. APEX LABORATORY - DAY  It’s a new lab to us, with high ceilings, and an especially  large discharge duct in the upper corner of the room.  Farragut stares down a microscope through his gas mask. It’s  like he’s in love with whatever he’s looking at...  ON SLIDE  We’re zoomed in at 1,000,000xp. And what we see is - a  SIMPLE, PURPLE, VIRAL STRAND. And yet...it’s stunning.  Farragut talks into a MIC -  FARRAGUT (O.S.)  Six hours ago my team and I arrived  at Area 32 to explore the  possibility of a retrovirus. We  found one.  He keeps staring while the virus ROTATES LIKE A BALLE",
      "dialogue_count": 0,
      "word_count": 915
    }
  ]
}