{
  "slug": "hell-or-high-water-2016",
  "title": "hell or high water",
  "genre": "action",
  "format": "film",
  "scenes_count": 6,
  "characters_count": 0,
  "characters": [],
  "total_words": 9976,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. BEST WESTERN -- VERNON, TEXAS -- NIGHT. Marcus wakes to a terrible pain in his upper chest. He sits up. Reaches for a bottle of Tums on the night stand. Grabs a hand full. PARKER You okay? MARCUS Heart burn. I’ll be fine. Marcus rises, goes to the sink. Gets a drink. The pain hits him. Tries to shake it off. Stares at himself, suffering in the mirror. EXT. BEST WESTERN -- VERNON, TEXAS -- NIGHT. Marcus, dressed in his undershirt, jeans, and boots, steps outside and walks toward the field behind the motel. He looks out over the mesquites and cactus. The warm air helps. Or maybe its just the walk. He looks up at the sky -- clouds and ten thousand stars carpet the night. An owl hoots. Flies over him. He watches the dark image move silently over him. Marcus walks toward a barbed wire fence, rests against it. The warm air blows against him, pushing him like a tattered sail. Marcus looks to the stars as he leans into the wind and tries to laugh off his suffering. MARCUS This is the thanks I get? Rotting from the inside out. After all I done for you ... He looks out over the mesquites, who answer back in an angry whistle as the wind whips through their leaves. CUT TO: INT. COMANCHE RED RIVER CASINO -- HOTEL ROOM -- NIGHT. Toby brushes his teeth as Tanner lays in bed, the hotel clerk beside him, reading LORD OF THE PLAINS. TANNER Boy, you Comanches were the real deal.   (MORE)  63.",
      "characters": [],
      "action_text": "(To Toby) You wanna hear what they did to the people they took captive? TOBY No. TANNER Damn right you don’t. Not a inch of mercy in them. (To the girl) You gonna show me any mercy, darlin’? CLERK Not an inch. TOBY You’re right ... I’m gonna go see my boys tomorrow. Toby climbs into his bed and rolls away from Tanner and the clerk. Tanner clicks off the lamp. The clerk climbs on top of him. Though she still wears her shirt, she is completely naked from the waist down. She presses her pelvis into him as she kisses him deeply. CLERK I’m expecting a lot from you. Tanner presses into her and she moans. TANNER What do you call that? Toby knows there will be no sleep with this a bed over. He sits up, pulls his jeans back on ... EXT. COMANCHE RED RIVER CASINO -- NIGHT. Toby walks through the parking lot, past semi’s and motor homes, toward the edge of the prairie. From here, it extends out forever. He walks through the grass, looking up at the same stars Marcus pondered. Looks back at the casino, its harsh neon lights violating the horizon. He turns back to the solace of the dark plains, and keeps walking ... TANNER (CONT'D)  64.",
      "dialogue_count": 0,
      "word_count": 480
    },
    {
      "scene_number": 2,
      "slugline": "EXT. BEST WESTERN -- VERNON, TEXAS -- DAWN. Marcus sits in a cheap lawn chair in front of the motel, watching the sun come up over the highway. A few trucks blast by as he watches. The motel room door opens. PARKER stands in boxers and a t shirt. PARKER What’re you doing? Marcus talks without looking back at him. MARCUS Watching the sun rise. Sitting on a porch. Practicing for my future. PARKER It’s a dangerous thing we do for a living. You’re lucky to have seen it through to the end. Hope I’m that lucky. MARCUS Without me by your side, I doubt you’ll get close enough to a criminal to ever be in danger again. PARKER’s face clouds. PARKER Just when I was staring to feel sorry for you. Marcus stands, and looks at PARKER for the first time. MARCUS Indians ain’t supposed to feel sorry for cowboys. It’s the other way around. PARKER looks into Marcus’s eyes, red and swollen from crying. Marcus brushes past him and walks into the motel room. EXT. USED CAR LOT -- LAWTON, OKLAHOMA -- DAWN. We stare at the engine of a red Pontiac Grand Am as it revs. Toby is beneath it with a flashlight, studying. It is far too early for anything legal to be happening on a used car lot.  65.",
      "characters": [],
      "action_text": "TOBY Put it in gear. We hear it kick into drive. Toby stands up. TOBY (CONT’D) Sounds good. Let me give it a spin. Tanner gets out of the driver’s seat. Toby gets in and drives the Pontiac off. Standing across from Tanner is BUSTER MEADE, 45, used car salesman in every sense. BUSTER We doing this one the same? TANNER You got plates for it? BUSTER Ain’t got no more Texas plates. I got Arkansas, Kansas, New Mexico -- TANNER New Mexico works. Don’t report this stolen till Friday. BUSTER Friday, okay. Toby pulls back in. TANNER How is it? TOBY Runs good. Don’t like that it’s red. TANNER He’s got New Mexico plates for it, though. Toby takes that in. TOBY Okay. TANNER We’re in business.  66. Buster walks off to start the paperwork. Tanner goes to the Blazer, grabs the duffel and the rifle cases, and tosses them in the Grand Am. TOBY You okay meeting the guy from Chevron by yourself? TANNER You okay seeing Debbie by yourself? TOBY I’ll manage. Remember, this guy ain’t the enemy. TANNER Oh, the oil man’s the enemy, make no mistake, he just ain’t ours. TOBY I’ll be back to the ranch by dark. TANNER I’ll be there. TOBY (Points at the Grand Am) Arrest me red. You better drive like a school teacher. Toby climbs in the Blazer and drives off. CUT TO: INT. THE T-BONE CAFE -- COLEMAN, TEXAS -- DAY. Marcus and PARKER sit at a table. The ceilings are easily twenty feet high, old cedar beams criss crossing it, ceiling fans hanging down, circulating hot air. Through the large bay window, we see a FIRST TEXAS BANK. On the wall hangs a plaque dedicated to the soldiers from Coleman who have fought and died for this country. So many names, one would think the whole town died for our freedom. PARKER What’s the plan? MARCUS We’re gonna watch that bank like a deer feeder ...  67. Marcus scans the restaurant, looks out the front window and over the little square with almost no life in it. MARCUS (CONT’D) This little town fits their bill, based on the ones they hit so far. Got a bank and not mu",
      "dialogue_count": 0,
      "word_count": 2320
    },
    {
      "scene_number": 3,
      "slugline": "EXT. T BONES CAFE -- COLEMAN, TEXAS -- DAY. The sun is setting as Marcus and PARKER sit on a bench under a Texas Porch that runs the length of the block. MARCUS All these little towns. Dying. What do you think’ll happen to ‘em? PARKER This is your plan? Just sit here and see if this is the branch they rob next ... Marcus looks over at him. MARCUS Not much of a thinker, are you? PARKER Do you want to live here? Old hardware store that charges twice what Home Depot does? One restaurant with a rattlesnake for a waitress? How are you supposed to make a living here? MARCUS People made a living here for a hundred and fifty years. PARKER People lived in caves for a hundred thousand years, but don’t do it no more, and they’re the better for it. Beat. MARCUS Maybe your people did. Marcus smiles. PARKER You’re people did too. Long time ago, your ancestors was the Indians and someone else came along and killed ‘em or broke ‘em down and made you into one of them. A hundred and fifty years ago, all this was MY ancestors’ land. Everything you can see. (MORE)  78.",
      "characters": [],
      "action_text": "Everything you saw yesterday. This was all Comancheria. Till the grandparents of all these folks took it. Now it’s being taken from them. Except it ain’t no army doing it. (PARKER points at the bank) It’s that son of a bitch, right there. Marcus studies his partner. MARCUS And here I am thinking you was slow as a two-legged turtle. PARKER I may be. But that don’t make it any less true. Silence. MARCUS These boys should’ve hit this branch by now. PARKER Then why are we still sitting here? MARCUS Just cuz ... I like this little town. PARKER I know what you’re doing. You’re tryin’ to make this last as long as you can. Cuz the longer it lasts the farther you are from your front porch ... That ain’t fair -- MARCUS To who? The bank? Only thing we can do is wait for these boys to make a mistake, and so far they ain’t. So relax. Enjoy this little town. From everything I see, it’ll die long before I do. They look out over the empty square, watching squirrels feasting underneath the pecan trees in the empty town square as the sun dips below the horizon. CUT TO: PARKER (CONT'D)  79.",
      "dialogue_count": 0,
      "word_count": 409
    },
    {
      "scene_number": 4,
      "slugline": "EXT. HANSON RANCH HOUSE -- NIGHT. Toby and Tanner sit on the porch, staring at the stars as a pack of coyotes whimpers and yips somewhere in the distance. TANNER Thinking about tomorrow? TOBY Ain’t you? Tanner shakes his head. TANNER That little hotel clerk. Why’s it always the sweet ones that’s such devils when you get ‘em revved up? TOBY I don’t know. Never been with a sweet one. Tanner laughs. TANNER That’s right. You like ‘em pissed off and looking for someone they can blame it on. Toby smiles. TOBY Sure seems that way, don’t it? TANNER This is a good thing you’re doing. You know that? TOBY We’re doing it. Tanner grins and winks. TOBY (CONT’D) Go easy on the tellers tomorrow, okay? TANNER I’ll be as gentle as young nurse. Tanner stands up, stretches, and yawns.  80.",
      "characters": [],
      "action_text": "TANNER (CONT’D) Wake me up at five. TOBY Yep. Tanner disappears inside. Leaving Toby alone. He sits back, his mind running all the possibilities. How it can go right. How it can go wrong. CUT TO: EXT. T BONES CAFE -- COLEMAN, TEXAS -- NIGHT. The crickets are chirping so loud, it echoes off the old, stone building. It doesn’t appear Marcus has moved in hours, still staring out over the square. Across the way, PARKER is carrying his suitcase into a motel. Marcus takes out his can of Copenhagen, packs it, and places a pinch in his cheek. Ready for a long night of reflection. INT. HANSON RANCH HOUSE -- KITCHEN -- NIGHT. The wall clock says ten after five in the morning. Toby sits, dressed like a gang banger, pistol and three magazines for it on the table. He sips coffee as Tanner walks in dressed the same. TANNER I’ll never understand how those gang bangers can walk around with their pants like this, dangling off their asses. No wonder they always get caught when they run from the police. Toby slides him a cup of coffee. Tanner sits. They drink their coffee in silence. TOBY Want some breakfast? Tanner thinks that one over. TANNER Yeah. Breakfast sounds good. Toby stands and heads to the fridge. Pulls out bacon and a carton of eggs. Crosses over to the stove. Tanner watches his brother as he cooks.  81. TANNER (CONT’D) Did you do this for mama? TOBY Every morning. She didn’t eat much the last month. TANNER Did you used to cook breakfast for your boys? Toby stops. TOBY Yeah ... Been a long time, though. Tanner sits back in his chair, like a child, patiently waiting for his meal. TANNER You do the bacon first, then the eggs in the grease, right? TOBY Yep. That’s the way. Tanner watches his brother and sips his coffee as the bacon begins to sizzle. CUT TO: EXT. TEXAS HIGHWAY -- DAWN. Two cars move toward us. The blazer and the Grand Am. Headlights on, though morning is breaking. They come closer. Closer ... EXT. T BONES CAFE -- COLEMAN, TEXAS -- DAY. PARKER stands over us, ",
      "dialogue_count": 0,
      "word_count": 1174
    },
    {
      "scene_number": 5,
      "slugline": "EXT. MAIN STREET -- POST, TEXAS -- DAY. There are actual signs of life here. A few cars in front of the grocery store. Pick up trucks in front of the diner. Cars and trucks at the gas station. The FIRST TEXAS BANK sign looms in the distance. INT. GRAND AM -- CONT. TOBY This town looks busy. TANNER Little bit. Look at the bank though. Not a car in front of it. TOBY We do this quick. TANNER Gotta take the hundreds this time. TOBY Make sure they fan ‘em out in front of you. If an ink pack gets in the bag, that money’s useless. TANNER Yep. They park in front of the bank. No other cars around. We watch from a distance as they get out and hurry inside, pulling on their masks. We DOLLY down a side street, now looking at the bank’s red wall. We CONTINUE until we are looking at First Texas Bank’s parking lot. Which is full. INT. FIRST TEXAS BANK -- POST, TEXAS -- CONT. We stare at Toby and Tanner who stand frozen. We see what they see -- Two dozen people staring at them. Frozen as well. No one moves. No one knows what to do. Then it all happens in a blur. TANNER GET ON THE FUCKING GROUND!!! EVERYBODY.  86.",
      "characters": [],
      "action_text": "Tanner raises his pistol, pointing it frantically at everyone. All the people hit the deck. Toby is cemented to the place where he stands. Tanner jumps the counter, pressing his gun hard to the face of the teller. TANNER (CONT’D) Open the drawers! Every teller open their drawer and take three steps back. Tanner spots his brother not moving. TANNER (CONT’D) HEY!!!! Toby snaps to, and covers the customers who are sitting and laying on the bank floor. Tanner begins grabbing the money himself from the teller drawers. TANNER (CONT’D) All of ya’ll on your fucking knees. NOW. All the tellers drop to their knees. ANGLE ON: A girl, in her twenties, laying on the floor, discreetly sending a text on her phone. It reads: THEY R ROBBING THE BANK Tanner is frantically scraping money from the drawers, one after the other, when an old SECURITY GUARD comes around the corner, his pistol raised. He cocks the hammer -- Tanner spins and fires round after round into him. He falls back as everyone screams. Another man stands and pulls a pistol from his boot, fires at Toby and misses. Toby turns and fires while he ducks. They aren’t thirty feet from each other, but the twisting and ducking is sending bullets into the wall, the ceiling, everywhere but their intended target.  87. Tanner takes aim and places a round in the side of the man’s head, dropping him to a heap on the floor, like a jacket falling from a coat rack. Tanner leaps over counter. TANNER (CONT’D) Let’s go! EXT. FIRST TEXAS BANK -- POST, TEXAS -- CONT. Toby and Tanner push through the doors and are met by a hail of gunfire. The windows behind them shatter as they fire back and duck behind the Grand Am, which is taking a beating. TOBY I DIDN’T SEE ANY POLICE! TANNER IT AIN’T. IT’S THE WHOLE FUCKING TOWN SHOOTIN’ AT US! Sure enough, across the road, hidden behind pickups, are locals with deer rifles, shotguns, whatever was in the gun rack when they heard shooting inside the bank. Tanner unlocks the passenger door, lays against ",
      "dialogue_count": 0,
      "word_count": 2638
    },
    {
      "scene_number": 6,
      "slugline": "INT. TOBY’S ROOM -- INDIAN CASINO -- RIUDOSA -- NIGHT. Toby stares at the ceiling, chip trays stacked full on the night stand. He looks at his cell phone. Nothing. He’s been resisting this. Once he knows, there’s no more hope. But he must know. Can’t put it off any longer. He turns on the TV. A TV reporter stands in the city square of Post, a flurry of activity behind her. REPORTER ... When the townspeople of Post confronted the robbers, a shoot out reminiscent of the old west broke out right here, in the city square. The locals chased the robbers out of town, but not before three of their own were killed inside the bank and on these city streets. And like a story from a dime store novel, both members of the Texas Highway Patrol and locals chased the robbers to a hillside twenty miles east of town where the gunfight continued. Three highway patrolmen were injured, two critically, and one Texas Ranger was killed before Ranger Marcus Hamilton killed one of the gunman with a rifle he borrowed from a resident of this rugged little town. NEWS ANCHOR What information do we have on the bank robber that was killed? REPORTER His name is Tanner Joseph Hanson, from Hamlin, Texas. He was convicted of an armed robbery back in 1997, and served twelve years of an eighteen year sentence. NEWS ANCHOR Any word on his accomplice? REPORTER No word yet. Officials speculate he is hiding somewhere in the canyons that surround this area. (MORE)  98.",
      "characters": [],
      "action_text": "They will continue the search through the night and are warning residents that he is armed and extremely dangerous. But as of yet, nothing is known about the accomplice and officials are hoping that someone will come forward and give them information that will lead to identifying who the other part of this duo that has caused so much havoc over the past few days. NEWS ANCHOR Thank you, Kate. Wow. What a shocking story coming out of West Texas. In other news -- Toby shuts it off. Returns to staring at the ceiling, expecting it to fall on top of him. Tears build in his eyes and run back to the mattress below him. CUT TO: INT. FIRST TEXAS BANK -- CHILDRESS, TEXAS -- DAY. Toby, showered and decently dressed, sits across from the LOAN OFFICER who looks at the two checks from the casinos. LOAN OFFICER (Dry as a bone) Lucky guy. TOBY Mmhmm. LOAN OFFICER Just in the nick of time too ... What are the odds. Beat. TOBY Not great. He punches some numbers on his computer. LOAN OFFICER This satisfies both the reverse mortgage loan and the back taxes that we paid on your mother’s behalf. We do that as a courtesy. TOBY I’m sure. REPORTER (CONT'D)  99. Toby hands Billy’s business card to the Loan officer. TOBY (CONT’D) You can fax the release of Lien to this number. LOAN OFFICER (Looking over the card) An attorney. TOBY Yeah. The loan officer nods. LOAN OFFICER You’re aware that you can sell mineral rights separate from the surface rights of a property. TOBY That a fact. LOAN OFFICER Yeah. The odds there are actually minerals to extract are, well, it’s highly unlikely, but I can check and see what value the rights have and -- TOBY Long odds are working pretty good so far. The release of lien, that’s all I want. LOAN OFFICER I’ll get that faxed over to your attorney by the end of the week. The loan officer smiles. Toby doesn’t. TOBY It is the end of the week. I want to watch you do it. Beat. LOAN OFFICER It take a little time to prepare. TOBY I got all day. Beat.  100. LOAN OFFICER V",
      "dialogue_count": 0,
      "word_count": 2955
    }
  ]
}