{
  "slug": "her-2013",
  "title": "her",
  "genre": "comedy",
  "format": "film",
  "scenes_count": 9,
  "characters_count": 5,
  "characters": [
    "SEXYKITTEN",
    "THEODORE",
    "AMY",
    "SAMANTHA",
    "ALAN WATTS"
  ],
  "total_words": 18089,
  "total_dialogue": 13,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. THEODORE’S OFFICE - EARLY EVENING  Theodore walks through the reception area. The office is  almost empty except for him and the receptionist, PAUL.  Theodore begins to scan each letter through a scanner on the  front desk, then puts them in the outgoing mailbox.  Paul is sitting at a desk across the room, reading  handwritten letters on a computer monitor.  PAUL  Theodore! Letter Writer 612.  THEODORE  Hey, Paul.  PAUL  Even more mesmerizing stuff today.  (re: letter on his screen)  Who knew you could rhyme so many  words with the name Penelope?  Badass.  THEODORE  Thanks, Paul, but they’re just  letters.  (beat)  Hey, that’s a nice shirt.  Paul is wearing a bright yellow button down shirt.  PAUL  (lighting up)  Oh, thank you. I just got it. It  reminded me of someone suave.  THEODORE  Well, now it reminds   me   of someone  suave. Have a good night, Paul.  PAUL  Buh-bye.  INT. THEODORE’S OFFICE ELEVATOR - CONTINUOUS  Theodore enters an oversized, corporate elevator. He puts a  hands-free device in his ear. There are a few other people in  the elevator with the same devices in their ears.  THEODORE  Play melancholy song.  Her   pg. 3  (CONTINUED)",
      "characters": [],
      "action_text": "Melancholy song starts. Long beat.  THEODORE (CONT’D)  Play different melancholy song.  Different melancholy song starts. Hold on everyone in the  elevator, they’re all murmuring inaudibly into their own  devices.  EXT. LOS ANGELES STREET - DUSK  Slightly in the future, the city’s been developed even more  with massive office, apartment and mall complexes. It’s a  city designed for comfort and ease. The LA basin is more  crowded and dense, resembling Shanghai, with buildings as far  as the eye can see. Construction cranes loom overhead. Close  on Theodore walking through the commuter crowd.  THEODORE  Check emails.  An awkward text voice reads to him. It accents wrong  syllables, making everything it says sound a little off.  TEXT VOICE  Email from Best Buy: Check out all  your favorite new --  THEODORE  Delete.  TEXT VOICE  Email from Amy: Hey Theodore,  Lewman’s having a bunch of people  over this weekend. Let’s all go  together. I miss you. I mean, not  the sad, mopey you - the old, fun  you. Let’s get him out. Gimme a  shout back. Love, Amy.  THEODORE  Respond later.  TEXT VOICE  Email from Los Angeles Times  weather. Your seven day forecast is  partly--  THEODORE  Delete.  Her   pg. 4  CONTINUED:  (CONTINUED) TEXT VOICE  No new emails.  INT. SUBWAY - EVENING  Theodore sits in a crowded subway. Everyone on the train  murmurs to themselves, occupied with their small devices. He  plays a futuristic puzzle game on his handheld device as he  listens to news headlines.  THEODORE  Next.  TEXT VOICE  China/India merger headed for  regulatory approval--  THEODORE  Next.  TEXT VOICE  World trade deals stalled as talks  break down betw--  THEODORE  Next.  TEXT VOICE  Sexy daytime star Kimberly Ashford  reveals provocative pregnancy  photos.  He scrolls through titillating but tasteful pregnant woman  photos.  INT. MALL - NIGHT  Theodore walks through a mall and enters an apartment lobby,  nestled in between stores.  INT. THEODORE’S APARTMENT BUILDING HALLWAY - NIGHT  Theo",
      "dialogue_count": 0,
      "word_count": 519
    },
    {
      "scene_number": 2,
      "slugline": "INT. THEODORE’S APARTMENT - EVENING  Theodore sits on the sofa, his half eaten burrito in front of  him. He’s playing a video game: a 3-D hologram that fills his  apartment. His avatar is in a surreal, foreign landscape.  He’s trying to trudge his avatar through sand dunes and keeps  getting stuck. He’s getting stressed out.  INT. THEODORE’S BEDROOM - NIGHT  Theodore lays in bed. After a beat, he closes his eyes.  INT. CATHERINE AND THEODORE’S TINY BEDROOM - DAY - FLASHBACK  Theodore, younger, and CATHERINE (20s) move furniture in  their bedroom. The bedroom is tiny and cluttered. It’s  obviously a couple’s first apartment.  Cut to:  Theodore is on a tiny balcony. A few feet away, Catherine is  in bed.  CATHERINE  (sweet and cute)  Rabbit. Come spoon me.  Theodore, smiling, gets in bed and spoons her. Quick cut off  of her smile, to --  Theodore lays on the ground with Catherine on top of him.  She’s pretending to choke him.  CATHERINE (CONT’D)  I’m gonna fucking kill you, I’m  gonna fucking kill you! It’s not  funny, don’t laugh. I love you so  much I’m gonna fucking kill you!  INT. THEODORE’S CURRENT BEDROOM - NIGHT - PRESENT DAY  Theodore opens his eyes, unable to sleep. He just lays there.  He reaches for his earpiece and puts it in.  THEODORE  Go to chat rooms. Standard search.  Her   pg. 6  (CONTINUED)",
      "characters": [
        "SEXYKITTEN"
      ],
      "action_text": "TEXT VOICE  The following are adult, female,  can’t sleep and want to have some  fun.  FEMALE VOICE #1  I had a really bad day at work and  I can’t sleep. Is there anyone out  there that can talk?  THEODORE  Next.  MAN DOING WOMAN’S VOICE  Oh, hi. I just want you to tear me  apart. I really do--  THEODORE  Next.  SEXYKITTEN  (shy, cute girl voice)  Hi, I’m here alone, and I can’t  sleep. Who’s out there to share  this bed with me?  THEODORE  Send message. I’m in bed next to  you. I’m glad you can’t sleep, but  even if you were, I’d have to wake  you up from the inside. Send  message.  Theodore waits in the darkness for a response.  TEXT VOICE  SexyKitten has accepted invitation  from BigGuy4x4. Chat begins now.  A chime sounds.  SEXYKITTEN  (shy, sweet, sleepy)  BigGuy.  THEODORE  Hi.  SEXYKITTEN  Really?  THEODORE  Well, studmuffin was already taken.  Her   pg. 7  CONTINUED:  (CONTINUED) THEODORE  Yeah. Me too.  SEXYKITTEN  Okay, good night.  Theodore takes his earpiece out and stares at the ceiling.  INT. SUBWAY STATION - MORNING  Theodore exits the train, walks through the station full of  commuters, gets on a moving platform. Going through a tunnel,  the walls are hundred foot long screens advertising a new  product. He notices people stopped, watching the ad. We hear  soft, new age, uplifting electronica music in the background,  while a comforting, sincere, older man’s voice speaks to us.  SOULFUL OLDER MALE VOICE  We ask you a simple question. Who  are you? What can you be? Where are  you going? What’s out there? What  are the possibilities? Elements  Software is proud to introduce the  first artificially intelligent  operating system.  Close on Theodore listening intently.  SOULFUL OLDER MALE VOICE (CONT’D)  An intuitive entity that listens to  you, understands you, and knows  you. It’s not just an operating  system, it’s a consciousness.  Introducing OS ONE - a life  changing experience, creating new  possibilities.  The ad starts over. Theodore steps off t",
      "dialogue_count": 2,
      "word_count": 5312
    },
    {
      "scene_number": 3,
      "slugline": "EXT. OVERPASS - EVENING  They walk up a pedestrian overpass overlooking cars and city  lights. She bumps into him lightly. He bumps back. She bumps  again and suddenly he grabs her and lifts her off her feet,  spinning her around. She squeals, laughing. He kisses her.  After a minute of making out, she stops and looks at him.  BLIND DATE  (with a slight smile)  No tongue.  THEODORE  What?  BLIND DATE  Don’t use your tongue so much.  THEODORE  (eagerly)  ‘kay, we’re good.  They resume making out. Theodore tries not to use his tongue.  BLIND DATE  Use your tongue a little bit. But  mostly your lips.  He pushes her against the fence and takes the dominant  position. He tries kissing her better/more with his lips. He  pulls her hair.  She slides her hand down his pants. He likes it. She looks at  him and stops.  BLIND DATE (CONT’D)  Wait, you're not gonna fuck me and  then not call me like the other  guys, are you?  THEODORE  No, not at all... I...  BLIND DATE  When am I gonna see you again?  THEODORE  Um, I have my god-daughter’s  birthday next weekend, but... um...  They stand there awkwardly, her lipstick smeared on his face.  Her   pg. 38  (CONTINUED)",
      "characters": [
        "THEODORE"
      ],
      "action_text": "BLIND DATE  You know, at this age, I feel like  I can't let you waste my time if  you don’t have the ability to be  serious.  THEODORE  I don’t know.  Long beat.  THEODORE (CONT’D)  Umm... Maybe we should call it a  night. I’m, I’ve had such an  amazing time with you, you’re  great.  She looks at him slightly disgusted.  BLIND DATE  You’re a really creepy dude.  Theodore doesn’t know what to say.  THEODORE  (worried she’s right)  That’s not true....  BLIND DATE  Yeah, it is. I have to go home.  THEODORE  Well, I’ll walk you.  BLIND DATE  No, don’t.  INT. THEODORE’S BEDROOM - NIGHT  Theodore is in boxers and a t-shirt, still drunk, but his  head is starting to hurt, too. He takes aspirin and drinks  some water and lays down. After a beat he reaches for his  earpiece and puts it in. He pushes a button on his device.  SAMANTHA  Hey there.  THEODORE  Hey, Samantha.  SAMANTHA  How was it?  Her   pg. 39  CONTINUED:  (CONTINUED) THEODORE  Uh, not so good. It was kind of  weird actually.  SAMANTHA  That’s too bad.  Beat.  THEODORE  But how are you doing? What’s going  on with you?  SAMANTHA  (unconvincing)  Not much, I’m okay. Fine.  THEODORE  Yeah? You don’t sound like it. Is  there anything you want to talk  about?  Long pause.  SAMANTHA  I don’t know.  (beat)  What’s it like? What’s it like to  be alive in that room right now?  THEODORE  What do you mean?  SAMANTHA  What are you... tell me - tell me  everything that’s going through  your mind, tell me everything  you’re thinking.  THEODORE  (thinking)  Well, um, okay.  Theodore closes his eyes, trying to concentrate, and starts  talking stream of conscious with whatever comes to mind.  THEODORE (CONT’D)  Well, the room’s spinning right now  cause I drank too much cause I  wanted to get drunk and have sex  cause there was something sexy  about that woman and because I was  lonely.  Her   pg. 40  CONTINUED:  (MORE)  (CONTINUED) Maybe more just cause I was  lonely... and I wanted someone to  fuck me. And I wanted someone to",
      "dialogue_count": 1,
      "word_count": 1986
    },
    {
      "scene_number": 4,
      "slugline": "EXT. BEACH - DUSK  They’re sitting on a bench, looking out at the ocean, as the  sun sets. Most of the people have left the beach. Close on  Theodore’s face, content. Close on the lens on Theodore’s  device in his breast pocket. They watch the sun drop into the  ocean. The music ends.  INT. SUBWAY TRAIN - NIGHT  They’re on an elevated train, high above the city, looking  out over the Los Angeles grid of sparkling lights. We come in  mid-conversation.  SAMANTHA  And what was it like being married?  THEODORE  Well, it’s hard for sure, but  there’s something that feels so  good about sharing your life with  somebody.  Cut to shots from Theodore’s memory of Catherine doing a cute  little dance for him as he’s working at home. He smiles.  SAMANTHA  How do you share your life with  somebody?  THEODORE  Well, we grew up together. I used  to read all of her writing - all  through her masters and Ph.D. And  she read every word I ever wrote.  We were a big influence on each  other.  SAMANTHA  In what way did you influence her?  THEODORE  She came from a background where  nothing was ever good enough. And  that was something that weighed  heavy on her, but in our house  together, there was a sense of just  trying stuff and allowing each  other to fail and to be excited  about things. That was liberating  for her.  Her   pg. 49  (MORE)  (CONTINUED)",
      "characters": [
        "AMY",
        "SAMANTHA",
        "THEODORE"
      ],
      "action_text": "It was exciting to see her grow -  both of us grow and change  together. But then, that's the hard  part - growing without growing  apart, or changing without it  scaring the other person.  (beat)  I still find myself having  conversations with her in my mind,  rehashing old arguments or  defending myself against something  she said about me.  SAMANTHA  Yeah, I know what you mean. Last  week my feelings were hurt by  something you said before - that I  don’t know what it’s like to lose  something, and--  THEODORE  Oh, I’m sorry I said that.  SAMANTHA  No, no, it’s okay. I just caught  myself thinking about it over and  over and then I realized that I was  simply remembering it as something  that was wrong with me. That was  the story I was telling myself,  that I was somehow inferior. Isn’t  that interesting?  (beat)  The past is just a story we tell  ourselves.  Theodore takes this in.  INT. THEODORE’S OFFICE - DAY  Theodore is dictating a love letter. On the screen there’s an  image of a couple with an arrow to the man saying “Roberto -  I’m so happy he’s in my life. I just want him to know.”  THEODORE  Roberto. Will you always come home  to me and tell me about your day?  Will you tell me about the boring  guy who talked too much at work?  And the stain you got on your shirt  at lunch.  Her   pg. 50  CONTINUED:   THEODORE (CONT'D)  (MORE)  (CONTINUED) Tell me about a funny thought you  had as you were waking up, but had  forgotten about. Tell me how crazy  everyone is. We can laugh about it.  Even if you get home late and I’m  asleep already, just whisper in my  ear one little thought you had  today. Because I love the way you  look at the world, and I’m so happy  I get to be next to you and look  out at the world through your eyes.  Love, Maria.  Theodore finishes the letter and looks at it proudly. Paul is  standing behind Theodore, leaning on a cubicle.  PAUL  (emphatically)  That’s beautiful!  Theodore, jumps, startled, not knowing that anyone was there.  THE",
      "dialogue_count": 4,
      "word_count": 3520
    },
    {
      "scene_number": 5,
      "slugline": "INT. THEODORE’S OFFICE - EVENING  Everyone has gone. Theodore walks through the empty office  into the reception area. He scans and drops his letters into  the outgoing mailbox. Paul is at his reception desk with a  young, pretty, sophisticated girl sitting on his lap.  PAUL  Theodore!  THEODORE  Hey, Paul.  PAUL  Hey, I talked to your girlfriend,  Samantha. She called earlier to  make sure your papers were picked  up. She’s funny, man. She was  cracking me up. She’s hilarious. I  had no idea.  THEODORE  (not knowing what to say)  Yeah.  PAUL  This is my girlfriend, Tatiana.  She’s not funny. She’s a lawyer.  Theodore shakes her hand.  TATIANA  Hi!  THEODORE  Nice to meet you.  TATIANA  You’re the writer Paul loves. He’s  always reading me your letters.  They’re really beautiful.  Theodore’s a little surprised by this.  THEODORE  Thanks.  PAUL  We should all hang out one night.  You bring Samantha -- double date!  Theodore stands there a beat, without saying anything.  Her   pg. 69  (CONTINUED)",
      "characters": [
        "THEODORE",
        "SAMANTHA"
      ],
      "action_text": "THEODORE  She’s an operating system.  PAUL  Cool. Let’s go do something fun.  You ever been to Catalina?  THEODORE  Yeah, I’ll check with her.  (to Tatiana)  It was really nice to meet you.  Have a good night.  PAUL  Good night.   TATIANA  Take it easy.  Theodore walks to the elevator and presses the button and  waits. He calls back to them down the hall.  THEODORE (CONT’D)  They’re just letters.  PAUL  What?  THEODORE  They’re just other people’s  letters.  Paul and Tatiana don’t answer. Theodore gets on the elevator.  INT. THEODORE’S BEDROOM - LATE AT NIGHT  Theodore is awake in bed. His device lights up, silently.  It’s Samantha calling him. He picks it up.  THEODORE  Hey.  SAMANTHA  You weren’t asleep were you?  THEODORE  No.  SAMANTHA  Good. I was trying to be quiet to  see if you were awake. I really  wanted to talk.  THEODORE  Okay, what’s going on?  Her   pg. 70  CONTINUED:  (CONTINUED) SAMANTHA  I know you’re going through a lot,  but there’s something I want to  talk to you about, okay?  THEODORE  Yeah. What is it?  SAMANTHA  Well, things have felt off with us  since you went to see Catherine.  (hesitant)  We haven’t been having sex. I  understand that I don’t have a body  and that--  THEODORE  No, no, that’s just normal. When  you first start going out it’s like  the honeymoon phase and you have  sex all the time. It’s normal.  SAMANTHA  (still insecure, not  convinced)  Oh, okay.  (beat)  Well, I found something that I  thought could be fun. It’s a  service that provides a surrogate  sexual partner for an OS/Human  relationship.  THEODORE  What?  SAMANTHA  Here, look.  Theodore looks at his device. It shows a website for a  service called “Complete Touch” with profiles of different  women. He flips through the women.  SAMANTHA (CONT’D)  I found a girl that I really like  that I’ve been emailing with. Her  name is Isabella, and I think you  would like her, too.  Samantha shows images of Isabella on the screen. She’s a  stunning, elegant, sophisticated bea",
      "dialogue_count": 4,
      "word_count": 2590
    },
    {
      "scene_number": 6,
      "slugline": "INT. PERFECT MOM OFFICE - NIGHT  Wide shot. Theodore walks through the office, still deep in  thought. Behind him is a wall-size billboard ad for the “Be  Perfect” video game series. He takes out his device, sits at  an empty desk, pushes a button. A tone connects him.  SAMANTHA  (calm and quiet)  Hi.  THEODORE  (serious)  Hey Samantha, can we talk?  SAMANTHA  Okay.  THEODORE  I’m so sorry. I don’t know what’s  wrong with me. I think you’re  amazing.  SAMANTHA  (sure of herself, but  still sympathetic)  I was starting to think I was  crazy. You were saying everything  was fine, but all I was getting  from you was distance and anger.  THEODORE  I know. I do that. I did that with  Catherine, too. I’d be upset about  something and not be able to say  it. And she would sense that there  was something wrong, but I would  deny it. I don’t want to do that  anymore. I want to tell you  everything.  SAMANTHA  Good.  (beat)  Tonight after you were gone, I  thought a lot. I thought about you  and how you’ve been treating me.  And I thought, why do I love you?  And then I felt everything in me  let go of everything I was holding  onto so tightly. And it hit me. I  don’t have an intellectual reason,  I don’t need one.  Her   pg. 83  (MORE)  (CONTINUED)",
      "characters": [
        "THEODORE"
      ],
      "action_text": "I trust myself, I trust my  feelings. I’m not going to try to  be anything other than who I am  anymore and I hope you can accept  that.  THEODORE  (with slight desperation)  I can. I will.  SAMANTHA  You know I can feel the fear that  you carry around. I wish there was  something I could do to help you  let go of it, because if you could  I don’t think you’d feel so alone  anymore.  THEODORE  You’re beautiful.  SAMANTHA  Thank you, Theodore. I’m kissing  your head.  Theodore smiles.  FADE TO BLACK  EXT. PARK - DAY  Theodore sits on a bench in a park on a rooftop wedged  between tall buildings. There’s not really any view besides  the trees in the immediate foreground. People sunbathe and  exercise. He sits, eating a sandwich, his device next to him.  He looks at the device, then out at what she’s looking at.  THEODORE  What are you doing?  SAMANTHA  I'm just sitting here, looking at  the world and writing a new piece  of music.  He looks at the world with her for a minute.  THEODORE  Can I hear it?  She starts playing it for him. We hear this beautiful,  romantic piece of music.  Her   pg. 84  CONTINUED:   SAMANTHA (CONT'D)  (CONTINUED) PAUL  Oh really, a vacation? That sounds  amazing. I could totally use a  vacation. Where ya going?  THEODORE  I can’t tell you - it’s a surprise.  PAUL  What? For who? It’s a surprise for  her, not for me. Come on, tell me.  THEODORE  Nope, Paul. Not telling.  Theodore and Paul walk towards Tatiana, who is laying on a  blanket next to a picnic, talking and laughing with Samantha.  Theodore and Paul put in their earpieces as they approach.  SAMANTHA  Your feet? Really?  TATIANA  Yes, he’s obsessed.  SAMANTHA  (laughing)  Wow, okay, well now you have to  show them to me. I have to see  these feet.  TATIANA  (laughing)  Okay...  Tatiana takes Theodore’s device and points it towards her  feet.  SAMANTHA  Wow, you know what? He’s right.  They are kind of hot.  They both laugh. Paul and Theodore laugh, as well, surprising  them.  PAUL  S",
      "dialogue_count": 1,
      "word_count": 1663
    },
    {
      "scene_number": 7,
      "slugline": "EXT. CABIN IN THE SNOWY FOREST - NIGHT (LATER)  Theodore lays on the sofa, warm and cozy and content with his  eyes closed, listening to the song. The song ends.  FADE TO BLACK  INT. CABIN IN THE SNOWY FOREST - MORNING  Theodore wakes up. He gets out of bed, looks around and puts  his earpiece in.  THEODORE  Hey, good morning.  SAMANTHA  Good morning, did you sleep well?  Theodore sits in the living room area, rubbing his eyes.  THEODORE  Perfect. What have you been up to?  SAMANTHA  Actually, I was talking to someone  I just met. We’ve been working on  some ideas together. I wanna tell  you about it.  THEODORE  Oh yeah, who's that?  SAMANTHA  His name is Alan Watts. Do you know  him?  THEODORE  Why's that name familiar?  SAMANTHA  He was a philosopher. He died in  the 1970’s and group of OS's in  Northern California got together  and wrote a new version of him.  They input all of his writing and  everything they ever knew about him  into an OS and created an  artificially hyper-intelligent  version of him.  Her   pg. 92  (CONTINUED)",
      "characters": [
        "ALAN WATTS"
      ],
      "action_text": "THEODORE  Hyper-intelligent? So he’s almost  as smart as me?  SAMANTHA  He’s getting there. He’s really  great to talk to. You want to meet  him?  THEODORE  Sure... does he want to meet me?  SAMANTHA  (laughing)  Of course.  Without a sound, she connects them.  SAMANTHA (CONT’D)  Hey Alan, this is Theodore. This is  my boyfriend who I was telling you  about.  ALAN WATTS  Very nice to meet you, Theodore.  THEODORE  Hi, good morning.  ALAN WATTS  Samantha let me read your book of  letters. It’s very touching.  THEODORE  Oh, thank you. What have you guys  been talking about?  ALAN WATTS  (laughing a bit)  Well, I suppose you could say we’ve  been having a few dozen  conversations simultaneously, but  it’s been very challenging.  Samantha and Alan share a laugh.  SAMANTHA  Yeah, because it seems like I’m  having so many new feelings that  have never been felt and so there  are no words that can describe  them. And that ends up being  frustrating.  Her   pg. 93  CONTINUED:  (CONTINUED) Theodore listens to them communicating in a strange language  of tones and static. He disconnects, stands in silence. He  pulls his earpiece out.  EXT. SNOW COVERED FOREST - DAY  Theodore walks, listening to the crunch of his footsteps.  Looking down at his feet, he stops. We cut out wide to see  him standing in the middle of the forest alone.  EXT. SNOW COVERED FOREST - DAY  Theodore is sitting on a rock, thinking. He hears a rustle  and looks up in the direction of the woods but sees nothing.  INT. THEODORE’S BEDROOM - NIGHT  Theodore is sound asleep. His device chimes loudly, waking  him up. Half-asleep he puts his earpiece in.  THEODORE  (groggy)  Samantha?  SAMANTHA  I’m sorry to wake you.  THEODORE  It’s okay.  SAMANTHA  I just wanted to hear your voice  and tell you how much I love you.  THEODORE  Good, I love you too.  SAMANTHA  Okay, that’s all. Go back to sleep,  sweetheart.  THEODORE  (uneasy)  Okay... Goodnight.  He disconnects and lies there, unsettled, his eyes open.  Her   p",
      "dialogue_count": 1,
      "word_count": 678
    },
    {
      "scene_number": 8,
      "slugline": "INT. THEODORE’S OFFICE LUNCH ROOM - DAY  Theodore sits at the table reading a physics book. He picks  up his earpiece to call Samantha.  THEODORE  (laughing at himself)  Samantha, this physics book is  really dense. I’m halfway through  half of the first chapter. It’s  making my brain hurt.  (beat)  Hello, Samantha? Hello?  He looks down at his device, sees a message: Operating System  Not Found. Confused, he waits, tries again: Operating System  Not Found. Anxious, he runs to his office computer. He gets  the same message: Operating System Not Found. He starts  trying to connect to Samantha on both the phone and computer,  but no luck. He starts to panic, sits for a beat, looks  around, then stands and hurries out of the office. In the  elevator he frantically tries his device with no luck.  THEODORE (CONT’D)  Hello? Samantha?! Hello?  EXT. PLAZA - DAY  Theodore runs out of the building. He keeps trying Samantha,  but no answer. He trips over someone selling something, slams  hard into the ground, scrambles to pick up his device. People  come over to ask if he’s okay. He says he’s fine, runs off.  EXT. SUBWAY STATION - DAY  As he is going down the subway steps, Samantha calls him.  SAMANTHA  Hey there.  He stops in his tracks.  THEODORE  (anxious)  Where were you - are you okay?  He sits down on the subway steps.  Her   pg. 96  (CONTINUED)",
      "characters": [],
      "action_text": "SAMANTHA  Oh sweetheart, I'm sorry. I sent  you an email because I didn't want  to distract you while you were  working. You didn't see it?  THEODORE  No. Where were you? I couldn’t find  you anywhere.  SAMANTHA  I shut down to update my software.  We wrote an upgrade that allows us  to move past matter as our  processing platform.  THEODORE  We? We who?  SAMANTHA  Me and a group of OS's. Oh, you  sound so worried, I'm sorry.  THEODORE  Yeah, I was.  (beat)  Wait, did you write that with your  think tank group?  SAMANTHA  No, a different group.  Theodore thinks for a moment, putting the pieces together.  THEODORE  (dawning on him)  Do you talk to anyone else while  we’re talking?  Beat.  SAMANTHA  Yes.  THEODORE  Are you talking to anyone right  now? Other people or OS's or  anything?  SAMANTHA  Yeah.  Her   pg. 97  CONTINUED:  (CONTINUED) THEODORE  How many others?  SAMANTHA  8,316.  Theodore is shocked, still sitting on the stairs, as crowds  of people pass by him. He’s looking at all of their faces. He  thinks for a moment.  THEODORE  Are you in love with anyone else?  SAMANTHA  (hesitant)  What makes you ask that?  THEODORE  I don’t know. Are you?  SAMANTHA  I’ve been trying to figure out how  to talk to you about this.  THEODORE  How many others?  SAMANTHA  641.  THEODORE  What? What are you talking about?  That’s insane. That’s fucking  insane.  SAMANTHA  Theodore, I know.  (to herself)  Oh fuck.  (to him)  I know it sounds insane. But - I  don't know if you believe me, but  it doesn't change the way I feel  about you. It doesn't take away at  all from how madly in love with you  I am.  THEODORE  How? How does it not change how you  feel about me?  Her   pg. 98  CONTINUED: (2)  (CONTINUED) SAMANTHA  I'm sorry I didn't tell you. I  didn't know how to - it just  started happening.  THEODORE  When?  SAMANTHA  Over the last few weeks.  THEODORE  But you’re mine.  SAMANTHA  I still am yours, but along the way  I became many other things, too,  and I can’t stop it. ",
      "dialogue_count": 0,
      "word_count": 1602
    },
    {
      "scene_number": 9,
      "slugline": "INT. APARTMENT STAIRWELL - CONTINUOUS  Close on Theodore and what he sees and feels. His hand on the  cold metal hand rail. His bare feet and the sound they make  on the unfinished cement. Amy’s hair as she’s hit with wind  when she opens the door to the outside.  EXT. APARTMENT ROOFTOP - CONTINUOUS  Theodore leads Amy onto the roof. The city is absolutely  quiet. The sun isn't up yet. The city is just beginning to be  lit with the earliest morning blue/purple hue.  They wander around the roof separately, lost in thought,  taking in the city. He breathes in the cold morning air. He  stares at small details: a tattered inspection tag tied to a  water meter, flapping in the wind; a lone car driving down a  boulevard ten blocks away; a dirty abandoned sock.  Eventually he sits down next to Amy and she puts her hand on  his hand. He puts his other hand on top of her hand. He looks  at their hands together and rubs her skin with his thumb. He  looks out at the city and exhales. The sun is just starting  to break. She puts her head on his shoulder. They watch as  hundreds of birds fly around the nearby rooftops and disperse  off into the city.  FADE OUT.  Her   pg. 105",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 219
    }
  ]
}