{
  "slug": "here-and-now-101-eleven-eleven-2018",
  "title": "here and now 101 eleven eleven",
  "genre": "comedy",
  "format": "series",
  "scenes_count": 7,
  "characters_count": 0,
  "characters": [],
  "total_words": 11102,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. SPIN LAUNDRY LOUNGE - DAY. RAMON PULLS UP in front of the   SPIN LAUNDRY LOUNGE,   parks his bike in a RACK. HENRY (O.S.) Who was she? INT. SPIN LAUNDRY LOUNGE - CONTINOUS - DAY. “BRAND NEW” CONTINUES over the sound system in this COMBO LAUNDROMAT AND CAFE. Barista   HENRY   BERGEN   (20)   is behind the counter in BLACK PANTS, WHITE SHIRT and some sort of VEST with a NAME TAG. Beard, tattoos. Cocky, handsome, gravitates toward a simpler existence. Doesn’t need much, appreciates what he has. He efficiently makes ESPRESSO DRINKS as Ramon recounts his dream. RAMON No idea. She looked like she was from an old Mexican movie. But she wasn’t speaking Spanish. I don’t know what language it was. And she said my name. Then she tore her face open. HENRY They say everybody in your dream is actually you. RAMON Huh. So I have a secret desire to tear my own face open? HENRY You tell me. RAMON All I know is she wanted something from me. And she wanted it bad. HENRY You are way deeper than I am. I just dream I’m at work with no pants. RAMON Do you have a boner? HENRY In the dream, or right now? Here, Now - Episode #101 - \"Eleven Eleven\" - 2.",
      "characters": [],
      "action_text": "RAMON Either. HENRY Sadly, no. RAMON Tease. HENRY You wouldn’t know what to do with me if you had me. RAMON You’re probably right. RAMON’S HEAD SUDDENLY TURNS, AS IF MOVED BY AN OUTSIDE FORCE, and he sees - RAMON’S POV: A DIGITAL CLOCK on the wall. It’s   11:11 . HENRY (O.S.) Dude. You give up too easy. RAMON That was weird. It felt like somebody just took my head and moved it so I would see that clock. Henry looks at the clock.   11:11   CHANGES to   11:12 . RAMON (CONT’D) Like it was completely involuntary. It did it on its own. It wanted me to see that clock. HENRY What wanted you to? RAMON Eleven eleven. Doesn’t that mean something? HENRY It... sounds like it should, because of, you know, nine eleven. And seven eleven. RAMON Hold on, my pants are vibrating. HENRY Now who’s a tease? Here, Now - Episode #101 - \"Eleven Eleven\" - 3. Ramon pulls a PHONE from his pants pocket, checks the screen, sighs. Answers. RAMON Hey, Mom. Intercut with: INT. HYBRID SUV - CONTINUOUS - DAY.  AUDREY   BLACK   (50s)   drives, PHONE to her ear; Ramon’s sister  KRISTEN   BLACK-BISHOP (15) in the passenger seat, texting on her own PHONE. Both Caucasian. Audrey is impeccably put together, steely, hyper-alert, and always just a little bit anxious. Kristen is awkward, self-conscious, maybe a little overweight, and actually quite pretty, but you will never convince her of that. AUDREY Honey, I need you to do me a big favor today - KRISTEN Put him on speaker. AUDREY I don’t know how, it’s a new phone, I need to get the I-T guy from the firm to - KRISTEN You don’t know how to connect a Bluetooth device? AUDREY No, and that does not make me a terrible person. KIRSTEN This is why millenials are so angry. RAMON Helloooooooooooooooo - AUDREY Ramon, on your way over tonight, I need you to stop by the dry cleaners and pick up Dad’s grey silk blazer I want him to wear. RAMON Mom, seriously? Here, Now - Episode #101 - \"Eleven Eleven\" - 4. AUDREY Of course, seriously. Why would I not be serious? RAMON",
      "dialogue_count": 0,
      "word_count": 2135
    },
    {
      "scene_number": 2,
      "slugline": "INT. CHEAP HOTEL - DAY.  GREG   BISHOP (60) fucks FAMIKO (20s), a young Japanese woman. Golden boy and athlete when he was younger, Greg’s gone a little doughy; but he fucks her like a teenager. INT. CHEAP HOTEL - LATER - DAY. Famiko, still naked, lolls on the bed picking at ROOM SERVICE as Greg finishes dressing - jeans, sneakers, shirt & tie, blazer. FAMIKO Happy birthday. GREG You remembered. FAMIKO I got you something. She gets up, rummages through her PURSE, pulls out a small BOX, gives it to him. He opens it, pulls out - GREG A cock ring? FAMIKO It’s a cock sling. (demonstrates) You put your cock and balls through here, and then this part presses up against your taint. GREG What a thoughtful gift for a distinguished old fart like me. FAMIKO Oh, please. You’re better than twenty-year-old clients of mine. GREG (startled) You have twenty-year-old clients? FAMIKO I once had a client who was fourteen. His dad was Russian mafia I think, he bought me for his kid’s fourteenth birthday. That kid was hung like a giraffe, and he had no clue what to do with it. (MORE) Here, Now - Episode #101 - \"Eleven Eleven\" - 14.",
      "characters": [],
      "action_text": "(nuzzles him) Unlike you. GREG I really should go - He pulls out his WALLET, peels off BILLS, which he hands to her. FAMIKO  Arigatou.  GREG  Ariga-tou.  She smiles, opens the door for him. GREG (CONT’D) Same time next week? FAMIKO Whenever you want. He kisses her cheek, she smiles, he leaves, she shuts the door and counts the money, is pleased by what he gave her. INT. PRIUS - LATER - DAY. Greg drives, listening to NPR. Suddenly BURSTS INTO TEARS. He pulls over to the shoulder, stops the car. Holds onto the steering wheel, racked by heaving SOBS of genuine despair. EXT. PRIUS/ROAD - CONTINUOUS - DAY. FROM ABOVE, PULLING BACK: The Prius, alone on the road’s shoulder. Greg’s SOBS CONTINUE. WORKOUT MUSIC FADES UP - INT. GYM - DAY. WORKOUT MUSIC BLARES as we MOVE down A LINE OF ELLIPTICAL CROSS TRAINERS to FIND RAMON on one, legs pumping. He’s in the zone. He glances down at: HIS POV: The elliptical’s DIGITAL DISPLAY. The TIME COUNTER increases by seconds -  11:08 - 11:09 - 11:10 - 11:11 ...  The TIME STOPS INCREASING. IT STAYS STUCK ON   11:11.  FAMIKO (CONT'D) Here, Now - Episode #101 - \"Eleven Eleven\" - 15. ON RAMON. Looks like he might laugh. He presses buttons randomly, trying to get the time counter unstuck, but nothing works. SLOW PUSH IN ON RAMONE, looking at: SLOW PUSH IN ON   11:11 , unchanging. RAMON Get. Out. He pushes buttons a few more times, finally stops, as he realizes this number is not going to change... and that’s when - The TIME COUNTER jumps to   11:23 - 11:24 - 11:25 -  OFF RAMON.   Weird . INT. BLACK-BISHOP HOME - KRISTEN’S ROOM - DAY.  CLOSE ON A COMPUTER SCREEN: JUMP CUTS as someone creates a new FACEBOOK PAGE. First name   ANGELA   - Sex   FEMALE   - Relationship status   SINGLE   - Interested in   MEN   -  AUDREY (O.S.) (from downstairs) Kristen! I need you to come down here and help me!  The FINISHED FACEBOOK PAGE shows us a beautiful COLLEGE-AGED GIRL with a perfect body in tiny running shorts and a sports bra. She smiles at us radiantly. ",
      "dialogue_count": 0,
      "word_count": 618
    },
    {
      "scene_number": 3,
      "slugline": "INT. BLACK-BISHOP HOME - GREAT ROOM - DAY. MOVING PAST FACES of CATERING WORKERS, FLORISTS, PARTY SETUP CREW, HOUSE CLEANERS - mostly Latino - listening to: Audrey has assumed a place on the stair landing so that she’s higher than all the workers below her. AUDREY (in Spanish,   subtitled )  You all need be out of here and in your cars by six o’clock, which only gives you eighty-five minutes, so let’s hurry! Thank you.  The house is tasteful, comfortable, rustic, eclectic, warm. PLANTS everywhere. All kinds of multicultural ART. Tons of BOOKS, lots of TEXTURES. Kristen comes down the stairs as the workers disperse. KRISTEN Are you making them leave because you don’t want people to know the party is catered? AUDREY No. I just think it will be a warmer, more intimate party for Dad without zombies in vests lumbering around with canapés. KRISTEN You sure it’s not because you want people to think you did all this yourself? AUDREY (stung) You want to tell me what this ongoing hostility toward me is about? KRISTEN (LAUGHS) That was wasn’t even close to hostile. AUDREY Kristen. Honey. I promise I will understand anything you are going through. Because I’ve already been through it. Why not utilize my experience and wisdom? (MORE) Here, Now - Episode #101 - \"Eleven Eleven\" - 17.",
      "characters": [],
      "action_text": "Most girls don’t have that luxury. I know I didn’t. KRISTEN You said you needed me. What for? AUDREY It’s biologically determined, you know, this instinct to reject your family of origin - KRISTEN Oh dear God. Don’t you ever stop talking? AUDREY What the fuck is wrong with you? KRISTEN Mom. I really think you should consider the benefits of medical marijuana. AUDREY I do not need a crutch, Kristen, And unlike practically everyone else alive today, I don’t want one. She hands Kristen a SHOPPING BAG, inside of which are several AROMATHERAPY CANDLES IN TINS. AUDREY (CONT’D) Put one of these in each bathroom, but do not light them yet. KRISTEN (examines candle) Patchouli and Frankincense Organic Soy Candle. Ew. Flashback to the Red Moon party. AUDREY I can’t believe you still haven’t forgiven me for that. KRISTEN I will never forgive you for that. AUDREY For celebrating your first menstrual cycle in a maternal and sex-positive context instead of letting society shame you for it? Yeah, that’s unforgivable. AUDREY (CONT'D) Here, Now - Episode #101 - \"Eleven Eleven\" - 18. KRISTEN People at school heard about it. They taped maxi-pads to my locker. (on her way out) And that party wasn’t even for me. It was for you and your old hippie friends so you could get drunk in the hot tub and grab each other’s tits. AUDREY (temper flares) Don’t knock it ‘til you’ve tried it! She closes her eyes and breathes, chastising herself for letting Kristen get to her. EXT. PORTLAND STATE UNIVERSITY - DAY. Establishing. We HEAR someone KNOCKING ON A DOOR. INT. HALLWAY/GREG’S OFFICE - DAY. ON A DOOR, as a GRAD STUDENT knocks. LETTERS ON THE OPAQUE GLASS read:  H. Gregory Bishop PhD Chair, Philosophy Dept.  INSIDE THE OFFICE: Cramped, but with high ceilings. Books everywhere. Greg sits behind his desk, swiping on an IPAD, focused and intense. GREG Yes? The door opens and the Student pokes his head in. GREG (CONT’D) Michael, what’s up? MICHAEL Hey Doc Bishop, do you have a minute? GREG Ah... Here, ",
      "dialogue_count": 0,
      "word_count": 1992
    },
    {
      "scene_number": 4,
      "slugline": "EXT. PORTLAND STREETS/INT. PRIUS - DAY. Greg drives, grips the wheel tightly. On the RADIO: The semi- annual PUBLIC RADIO PLEDGE DRIVE. Greg starts to hyperventilate. Closes his eyes and rigorously shakes his head, trying to circumvent a full blown panic attack - and not really succeeding. He suddenly SCREAMS, a scream of primal terror and rage. HENRY (O.S.) I’ve been to Colombia before. INT. HENRY’S APARTMENT - DAY. Ramon and Henry in bed, post-sex. Henry’s place is sparse, monk-like. Sara Hartman’s “STRANGER IN A ROOM” from Bluetooth SPEAKERS. Ramon uses his PHONE to take a few pictures of Henry. HENRY  Caño Cristales. Bahia Solano . RAMON That means nothing to me. HENRY You don’t have any memories of it? At all? RAMON I was sixteen months old when they adopted me, so... I dream about it sometimes, but I think it’s just some made-up version based on shit I’ve seen on TV. HENRY Do you speak Spanish? RAMON Oh,   si.   Lo hablo muy bien . My mom insisted on it. HENRY (in Spanish,   subtitled )  Did you not want to learn Spanish?  RAMON (in Spanish,   subtitled )  No, I wanted to learn German, because the German teacher at my school was very hot.  Here, Now - Episode #101 - \"Eleven Eleven\" - 28.",
      "characters": [],
      "action_text": "HENRY  Spanish is better. It’s spoken more and it’s a beautiful language...  Henry’s hand reaches under the sheet... RAMON  What are you doing?  HENRY  You speaking Spanish has made me very aroused.  We HEAR A DOORBELL - INT. BLACK-BISHOP HOME - STAIRS/GREAT ROOM - DAY. THE FRONT DOOR OPENS TO REVEAL AUDREY, rollers in her hair, some sort of skin-revitalizing MOUSSE on her face. Her face lights up. AUDREY Well, hello! What is the best and smartest little girl in the world doing on my front porch? Malcolm and Haylee stand on the porch. Audrey takes Haylee in her arms, practically ignores Malcolm as he follows her in. AUDREY (CONT’D) You sweet thing.   Mamacita   is going to just eat you up. HAYLEE No! AUDREY  Por favor ? HAYLEE No! MALCOLM I thought I’d come a little early, see if there’s anything I can do to help. AUDREY There are tons of things you can do. Where’s Ashley? MALCOLM She got held up at work. Here, Now - Episode #101 - \"Eleven Eleven\" - 29. ASHLEY (O.S.) They named me Subeedo. INT./EXT. MERCEDES/BAR PARKING LOT - SAME TIME - DAY. Ashley, Duc and Randy are in Ashley’s parked MERCEDES outside the bar. Randy in the driver’s seat, Ashley in the passenger seat, Duc in the back. ASHLEY SNORTS A LINE OF COCAINE off a MAKEUP MIRROR, hands it to Duc. ASHLEY Some African name that nobody even knows what it means. RANDY Sounds like Speedo. ASHLEY Exactly. By middle school people were calling me the grape smuggler. Or sausage casing. Or chock fulla nuts. So on my eighteenth birthday, I had my name legally changed to the whitest name I could think of. DUC I kept mine. I like it. It sounds kinda badass but it means “virtue.” Duc hands the mirror to Randy, who snorts a line. ASHLEY (checks her watch) Shit, it’s almost seven. We need to get going. (to Randy) You’re not going to wreck my car, are you? I love my car. DUC Do you even have a driver’s license? RANDY (cranks car) Of course I do. WIDE: As the MERCEDES BACKS OUT AND PULLS OFF: ASHLEY (O.S.) I’ve got Listerine ",
      "dialogue_count": 0,
      "word_count": 1558
    },
    {
      "scene_number": 5,
      "slugline": "INT. BLACK-BISHOP HOME - KRISTEN’S ROOM - SAME TIME - DAY. Kristen shows the hipster’s FACEBOOK PROFILE to Ramon. RAMON Okay, you need to block this guy. KRISTEN Oh come on. What real serial killer would advertise it online? I’m sure it’s just one online persona of many. It’s like, performance. RAMON No. You need to block this guy. KRISTEN I’m never going to meet him! You think I want to see his face when the hideous beast that is me shows up instead of hot Angela Milton? RAMON Okay, first, you are so not hideous. KRISTEN Says the beautiful caramel-colored Colombian boy. RAMON You - KRISTEN It’s okay. I’ve made my peace with being the pasty white chick of the family. RAMON Not listening. And you need to be really careful, Kristen, there are real psychos out there. I hooked up with one once. KRISTEN Really? Was it hot? RAMON Uhm, no. It was creepy. He made this face during sex that was terrifying. He looked completely insane. Here, Now - Episode #101 - \"Eleven Eleven\" - 36.",
      "characters": [],
      "action_text": "KRISTEN That’s it? He made a weird face? RAMON It was more than weird. I could smell the crazy. Like he might go all Jeffrey Dahmer. I kind of put the brakes on hooking up for a while after that. KRISTEN How often do you hook up? RAMON How often do you? KRISTEN I’m fifteen, dumbass. Like never. Yet. And do not judge me. I’m not waiting for the perfect, you know, whatever. I just have not met anyone particularly interested. I mean interesting! Uh-oh. Was that a Freudian slip? Might I have just revealed my abysmally low self- esteem? RAMON You’re unusually forthcoming tonight. KRISTEN I’m high. I’m always high. RAMON Is that a plea for help? KRISTEN Dear God no, I love it. Check out my new vaporizer. She pulls a VAPORIZER PEN from a drawer. RAMON I got you this. KRISTEN Oh, right. Thank you! She offers it to him; he partakes. Here, Now - Episode #101 - \"Eleven Eleven\" - 37.",
      "dialogue_count": 0,
      "word_count": 345
    },
    {
      "scene_number": 6,
      "slugline": "INT. BLACK-BISHOP HOME - DINING ROOM/GREAT ROOM - NIGHT. Audrey makes her way through the crowd, checks the food table, adjusts something, adjusts something else. An academic- looking WOMAN approaches her. WOMAN Audrey, did you do all this yourself? I can’t believe you. AUDREY Well. I had help. WOMAN Where did you find the time? AUDREY I made the time. She spots Henry sampling food, heads toward him, alarmed. AUDREY (CONT’D) Do I know you? HENRY I don’t think so. I’m Henry. AUDREY (sotto) If you’re catering staff, I made it explicitly clear to your employer - HENRY No, I’m here with Ramon. What is this I’m eating, it’s amazing. AUDREY That’s - I’m not sure what that is. Figs with goat cheese and something else. In what capacity? (off his blank look) Are you here with my son? HENRY Oh, you’re Ramon’s mom! Hey. I guess I’m his... date? AUDREY (thrilled) Really?! HENRY Really. Here, Now - Episode #101 - \"Eleven Eleven\" - 38.",
      "characters": [],
      "action_text": "AUDREY (hugs him) It is such a pleasure to meet you, Henry! Come, I want to learn everything about you... As she drags him toward a sofa in the great room, we FIND ASHLEY AND HAYLEE off to the side. Haylee sits in her mother’s lap. HAYLEE It was a dog. ASHLEY Oh, a dog! Did it have a name? HAYLEE No! ASHLEY Was he friendly? HAYLEE His tail went like this. She wags her hand back and forth. ASHLEY That means he was happy to meet you. And who wouldn’t be? (looks at her, then) Oh, you know who I need to take a picture of right now? Because she is so smart and adorable and so. Much. Fun? HAYLEE Me! ASHLEY You! She pulls her PHONE from her purse, takes a selfie of her and Haylee. Ashley may be drunk and coked up, but she is a terrific mother. ON DUC AND RANDY, watching THEM from across the room. RANDY Dude, your sister? I don’t think she’s going to fuck me tonight. DUC I’d be very surprised if she did. Here, Now - Episode #101 - \"Eleven Eleven\" - 39. RANDY So why did she even bring me? She just likes playing with fire? DUC Ashley likes to play near fire. Without ever getting actually close enough to get burned. RANDY I mean, I get it. Her husband’s hot. I would do him. Oh well. (scopes the room for other prospects) Everybody here is pretty old. DUC It’s... a sixtieth birthday party. RANDY Aren’t there any caterers? People suddenly start CLAPPING as GREG DESCENDS THE STAIRS, wearing a BLACK HUGO BOSS BLAZER. He motions for everyone to stop the applause. ON AUDREY, Henry still in her grip, spotting Greg’s blazer. That’s not the one she wanted him to wear. GREG Welcome everyone... uh, and thank you for being here tonight to celebrate this step forward toward my inevitable oblivion... Some awkward LAUGHTER, but mostly silence. Greg LAUGHS, tries to lighten the moment. GREG (CONT’D) What do they say, sixty is the new fifty? Of course, they also said fifty was the new forty, forty was the new thirty, thirty was the new twenty. So I guess I’m about to be born any minute now... H",
      "dialogue_count": 0,
      "word_count": 1599
    },
    {
      "scene_number": 7,
      "slugline": "INT. BLACK-BISHOP HOME - FOYER - NIGHT. Audrey spots a COAT that’s fallen off the coat rack and is crumpled on the floor. She retrieves it, hangs it back on the coat rack, discovers GREG’S GREY JACKET IN THE DRY-CLEANING BAG, left there by Ramon. INT. BLACK-BISHOP HOME - GREAT ROOM - NIGHT. The room is filled with the BUZZ of the HUNDRED OR SO GUESTS here. FOLLOW AUDREY as she moves between people, carrying the jacket, headed toward Greg, who’s speaking to an academic- looking man. AUDREY Mind if I grab him for a bit? (as she leads Greg away) How are you doing? GREG I’m great. I’m drunk. AUDREY (takes his drink) Okay, only seltzer for the rest of the party. (holds jacket up) And that’s not the jacket I wanted you to wear. GREG I know. It’s the one I wanted to wear. She looks at him sharply; he looks back at her, steady. AUDREY Wear whatever you want. She walks away. INT. BLACK-BISHOP HOME - POOLHOUSE - NIGHT. Looks like it hasn’t been used in a while. POOL CLEANING EQUIPMENT is draped over some of the FURNITURE. The DOOR OPENS, LIGHTS COME ON as Kristen and Randy enter; SHE’S STILL WEARING HER HORSE HEAD. SHE SHUTS THE DOOR AND LOCKS IT. Turns to Randy. KRISTEN You should probably know... I’m a virgin. Here, Now - Episode #101 - \"Eleven Eleven\" - 47.",
      "characters": [],
      "action_text": "RANDY Oh.  (then) Okay, we’ll need a towel - As Kristen looks for one - INT. BLACK-BISHOP HOME - STAIRS/GREAT ROOM - NIGHT. Ashley, Duc, Ramon, Henry, Malcolm seated together. Malcolm holds a sleepy Haylee. ASHLEY Daddy looks happy. DUC Dad looks drunk. RAMON Come on. It’s his birthday, he gets to be drunk. ASHLEY God knows, he was always drunk at mine. DUC Do you have siblings, Henry? HENRY Nope. Only child. DUC Lucky. ASHLEY Oh hush. You love it. RAMON (looks around) Where is Kristen? She really wanted to meet you. INT. BLACK-BISHOP HOME - POOLHOUSE - NIGHT. Kristen lies on her back, pants-less, but STILL WEARING HER HORSE HEAD. Randy lies on top of her, his pants down around his ankles, his legs between hers. RANDY Let me know if I need to stop... or slow down... Here, Now - Episode #101 - \"Eleven Eleven\" - 48. KRISTEN I will. RANDY Just breathe. SLOW PUSH IN ON THE HORSE HEAD as Randy gently thrusts above her. We HEAR a sharp INTAKE OF BREATH from inside the mask. AUDREY (O.S.) Can I have everyone’s attention? INT. BLACK-BISHOP HOME - GREAT ROOM - NIGHT. Audrey has assumed a place on the stair landing so that she’s higher than everyone below her. As THE CROWD QUIETS DOWN... AUDREY We’re here to celebrate the birth of my dear husband Greg, who I met when we were both at Columbia many, many centuries ago. (holds for LAUGHTER) I had never met a boy who was so comfortable around me. Some people say I can be a real... handful. (holds for LAUGHTER) But Greg wasn’t intimidated. Or put off. He allowed me to be myself. In fact, he celebrated me. And he’s done so every day of mine and our four children’s lives, and we love him for it, as I’m sure you all do. PEOPLE CLAP. Greg waves it off. The CLAPPING DIES DOWN. Greg stays where he is, looks up at Audrey, smiling. ON AUDREY, smiling back.   Get up here, goddamnit . AUDREY (CONT’D) Greg, my darling, the love of my life, wouldn’t you like to say a few words? ON GREG, smiling back at her. He really wouldn’t. But guests SHOU",
      "dialogue_count": 0,
      "word_count": 2855
    }
  ]
}