{
  "slug": "hidden-figures-2016",
  "title": "hidden figures",
  "genre": "action",
  "format": "film",
  "scenes_count": 18,
  "characters_count": 11,
  "characters": [
    "WHITE COP",
    "RUSSIAN SCIENTIST",
    "PA ANNOUNCER",
    "RUTH",
    "AL HARRISON",
    "KATHERINE",
    "PASTOR AYRES",
    "JOHN GLENN",
    "NEWSCASTER",
    "PAUL STAFFORD",
    "JOYLETTE"
  ],
  "total_words": 24702,
  "total_dialogue": 14,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. PRINCIPAL’S OFFICE - CONTINUOUS  Katherine’s parents sit across from the school’s principal,  MR. MARION SMITHSON and Katherine’s teacher, MS. SUMNER.  MARION SMITHSON  West Virginia Collegiate Institute is the  best school for Negros in the state.  MS. SUMNER  It’s the only school, past the eighth  grade, anywhere close to here.  JOSHUA COLEMAN  Katherine’s in the sixth grade.  MS. SUMNER  They want to take her early.  MARION SMITHSON  They’re offering a full scholarship.   All  you have to do is get there.  Joshua and Joylette are overwhelmed.   They grasp each other’s  hands.  MS. SUMNER  Joshua, Joylette...we took up a  collection amongst the teachers and such,  a few parents.  Ms. Sumner hands Joylette an envelope.  MS. SUMNER (CONT’D)  It’s not a whole lot, but it’ll surely  help get you settled in.  Joylette accepts the envelope.  JOYLETTE COLEMAN  That’s beyond kind, Ms. Sumner.  MS. SUMNER  In all my years of teaching, I’ve never  seen a mind like the one your daughter  has.   You have to go.   You have to see  what she becomes.  Joylette starts to tear.   The kindness of people.   Joshua  puts his arm around his wife.  Hidden   Figures   -   5/9/2016   -   Shooting   Draft   -   2   .",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 195
    },
    {
      "scene_number": 2,
      "slugline": "EXT. ROAD - INSTITUTE, VIRGINIA - DAY  The Coleman family car, hauling a trailer with all their  belongings, drives past a pasture dotted with COWS.   A road  sign reads: Welcome to Institute, Virginia.  INT. COLEMAN FAMILY CAR - DRIVING - DAY - CONTINUOUS  Katherine’s crowded in the back seat with her siblings  (CHARLES, MARGARET and HORACE.)   She stares out the window,  studying the cows whizzing by, the patterns on their hides  forming shapes in her mind.   She studies the shapes, only now  she’s...  INT. WEST VIRGINIA COLLEGIATE INSTITUTE - ANOTHER DAY  ...staring out another window in a new classroom.   A fancy  classroom in a prestigious academy.   The class is full of  OLDER STUDENTS dressed in the best they have.  Unbeknownst to Katherine, her new teacher, PROFESSOR GRAVES,  is standing right in front of her.  PROFESSOR GRAVES  Ms. Coleman.  Katherine whips back to reality.   Embarrassed.  PROFESSOR GRAVES (CONT’D)  You find something out there more  interesting than quadratic equations?  KATHERINE (@8 YEARS OLD)  Yes, sir.   I mean no, sir.  Professor Graves holds out a piece of chalk.  PROFESSOR GRAVES  Why don’t you figure out the equation on  the board?  Katherine looks at the chalkboard.   The equation looks Greek:  symbols, signs, parentheticals.  Professor Graves pushes the chalk closer.  PROFESSOR GRAVES (CONT’D)  Go on.  Katherine takes the chalk.   Stands.   Walks sheepishly to the  front of the class.   Every eye on her.  Hidden   Figures   -   5/9/2016   -   Shooting   Draft   -   3   .  (CONTINUED)",
      "characters": [
        "WHITE COP"
      ],
      "action_text": "She stands in front of the blackboard, the equation.   Studies  it for the longest time.   Inspecting every number, sign,  symbol.   Wheels churning.  Then she starts to write.   Slow and meticulous at first.  Then fast.   Faster.   With passion and fury.  The Students crane their heads.  Professor Graves rubs his temple.  And Katherine writes on, chalk dust dropping like snow from  her chalk stick.   On and on and on...until she’s at the very  bottom, far side of the board.   She circles the answer.  Stands and faces the class.   The equation behind her dwarfing  her in stature.   She clears her throat...  KATHERINE (@8 YEARS OLD)  If the product of two terms is zero, then  common sense says at least one of the two  terms has to be zero to start with.   So,  if you move all the terms over to one  side, you can put the quadratics into a  form that can be factored, allowing that  side of the equation to equal zero.   Once  you’ve done that, it’s pretty straight  forward from there...  You can hear a pin drop.   There’s nothing to say.   Katherine  shuffles.   Adjusts her glasses.  KATHERINE (@8 YEARS OLD) (CONT’D)  ...sir.  Katherine walks back to her desk.   We push in on the  equation.   The numbers.   The endless, endless numbers.   The  title fades up:  Hidden Figures  EXT. ROAD - DAY  We float down towards a lone stretch of road in the middle of  nowhere.   Infinity in all directions.  A 1955 Chevy Impala sits on the shoulder, the hood up.  THE CAR - DAY - CONTINUOUS  KATHERINE GOBLE (now 38) sits in the passenger seat, staring  out the window.   Up into space.  Titles over: Hampton, Virginia, 1961  Hidden   Figures   -   5/9/2016   -   Shooting   Draft   -   4   .  CONTINUED:  (CONTINUED) A holler crashes the silence:  DOROTHY (O.S.)  Try and turn it over!  Outside, a pair of legs poke out from under the car.  DOROTHY (O.S.) (CONT’D)  Katherine?!  DOROTHY VAUGHAN (40s) slides out from under the car.   No-  nonsense, brilliant, tough, mechanically gifted.  DOROT",
      "dialogue_count": 1,
      "word_count": 1420
    },
    {
      "scene_number": 3,
      "slugline": "EXT. NASA - LANGLEY RESEARCH CENTER - DAY - LATER  The sprawling campus of NASA: hangars, wind tunnels, research  buildings, surrounded by tall, barbed wire fences and  SECURITY.  The police car slows, pulls to the shoulder, as Dorothy’s car  speeds past.   The White Cop waves them on.  And our camera floats up to...  EXT. SPACE - DAY  From the vast blackness of space...looking down on Planet  Earth.   Quiet.   Picturesque.   Peaceful.  Then: a rumbling sound creeps up.   And the camera pans to  find...a massive ROCKET burning up through the earth’s  atmosphere.   Atop the rocket, a capsule shakes, rattles,  grinds.   The noise is deafening.  We then hear a RUSSIAN VOICE, military-esque.   The VOICE then  translates into TURKISH...matter of fact.   And finally: The  CRACKLING VOICE of a radio communication in English.   Not  happy at all.   Tense.  CRACKLING VOICE (ON RADIO)  Approximate speed: 17,400 mph.   Ascend  angle: 42.46.   Closing.  INT. THE WHITE HOUSE - CONTINUOUS  The Oval Office.   President Kennedy is handed a briefing doc.  He’s worried.   The VOICE OF AN AIDE:  PRESIDENT’S AIDE (O.S.)  Latest intelligence on the Soviet booster  rocket still in relay, Mr. President.  INT. US CENTRAL COMMAND - CONTINUOUS  A room packed with US MILITARY BRASS.   JIM WEBB, NASA  ADMINISTRATOR, a hard, powerful man, is front and center.  All eyes are on the radar screen plotting the rocket’s  trajectory.  CRACKLING VOICE (ON RADIO)  Disengage booster rocket.   We are go.  SPACE - CONTINUOUS  The booster rocket falls back to Earth, as the dislodged  capsule floats at us, into the black of space.  Hidden   Figures   -   5/9/2016   -   Shooting   Draft   -   10   .",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 262
    },
    {
      "scene_number": 4,
      "slugline": "INT. NASA TRACKING CONTROL ROOM - HAMPTON, VA - CONT.  Al Harrison stands in a control room packed with ENGINEERS.  He leans forward, owl-eyed on the massive screens tracking  the rocket.   And then:  CRACKLING VOICE (ON RADIO)  Orbital entry is...go.  SPACE - CONTINUOUS  The capsule twists on axis, revealing...the blood-red hammer  and sickle of the Soviet Union.   This is Korabl-Sputnik-4.  The Russian Military Communication crackles in:  RUSSIAN MILITARY ANNOUNCER (O.S.)  (in Russian, with English subtitles)  All systems safe.   Confirmed.   Orbital  entry is established.  THE OVAL OFFICE - DAY - MOMENTS LATER  President Kennedy rubs his eyes.  US CENTRAL COMMAND - DAY - MOMENTS LATER  Dire mood.   Jim Webb picks up a ringing phone.  NASA TRACKING CONTROL - HAMPTON, VA - CONTINUOUS  Harrison, distraught, walks out of the room.  A SCREENING ROOM - DAY - CONTINUOUS  A black and white film reel plays.   It’s a Russian Press  Conference.  A RUSSIAN SCIENTIST is holding a small, wiry dog in a  cosmonaut vest.   This is ZVEZDOCHKA, the world’s first space  traveler: a Jack Russell Terrier mix.   He barks.  RUSSIAN SCIENTIST  (in Russian, subtitled in English)  Zvezdochka is ready to go again.  (motions to his side)  So is our comrade, Ivan.  Next to the Scientist: a mannequin with a placard, IVAN  IVANOVICH, is propped up in a chair, dressed as a cosmonaut.  The Russian press laughs.  Hidden   Figures   -   5/9/2016   -   Shooting   Draft   -   11   .  (CONTINUED)",
      "characters": [
        "RUSSIAN SCIENTIST"
      ],
      "action_text": "Webb walks out.   A mass exodus.  EXT. HALLS OF NASA (IBM COMPUTER HALLWAY) - CONTINUOUS  Footsteps echo off the marble floor, as Harrison walks with  Paul Stafford, Sam Turner, Ruth, and the rest of the TEAM.  AL HARRISON  (to Stafford)  How did that feel in there, Paul?   Do you  think you enlightened the Administrator?  Stafford has no response.  AL HARRISON (CONT’D)  He didn’t look enlightened to me.  Harrison stops.   He cleans his glasses.   Addresses SAM.  AL HARRISON (CONT’D)  He look enlightened to you, Sam?  SAM TURNER  Not particularly.  Paul nods.   Harrison walks away.   The Team keeps up.  AL HARRISON  And just so you know, he’s not wrong  about what he said in there.   You know  that, right?   Because now that they can  get up there, a bomb will follow.   That’s  what happens to all our good ideas.  Harrison stops again.   Stands in front of a window staring at  something we can’t see.   He’s quiet for the longest time.  AL HARRISON (CONT’D)  Where’s the machine?  RUTH  Any day now, Mr. Harrison.  AL HARRISON  Any day now.   What’s it called?   The  initials...the letters  RUTH  IBM.  PAUL STAFFORD  International business machine.  Hidden   Figures   -   5/9/2016   -   Shooting   Draft   -   13   .  CONTINUED: (2)  (CONTINUED) Harrison jots a note in a mini notebook.  AL HARRISON  Space is business.   I need a  mathematician.  RUTH  I’ll put in another request, sir.  AL HARRISON  Another request.   Jesus Christ.   We don’t  have a single person, in this entire  building, that can handle Analytic  Geometry?  RUTH  That’s what I’ve been told.  AL HARRISON  Well, tell me something else, Ruth.   Like  we’re going to find such a person, before  the Russians plant a flag on the damn  moon.  He walks off again.   Mumbling.   The Team hustles after him.  We stay at the window Harrison was staring into.   It’s a  stark white clean room.   Bright...and empty.  EXT. THE WEST COMPUTING GROUP - BUILDING - LATER  Nondescript brick.   A sign reads: West Computing Gr",
      "dialogue_count": 1,
      "word_count": 1431
    },
    {
      "scene_number": 5,
      "slugline": "EXT. WIND TUNNEL - NASA COMPOUND - DAY  The sun bounces off the massive, silver spheres that house  the wind tunnels.   Mary, arms loaded with reports and  worksheets, walks briskly underneath the turbines.  INT. HALLWAY TO THE WIND TUNNEL - DAY  Mary scoots down the hallway leading to the tunnel.   She  stops at the edge: for the first time she sees the Mercury 7  prototype capsule suspended in mid-air.   Her eyes twinkle at  the sight.  THE WIND TUNNEL - CONTINUOUS  Mary ambles under the Mercury 7 capsule.   She inspects every  single bolt, every shingle.   This is why she’s here.   This is  why she works at NASA.  A PA announcement jars her back to reality:  PA ANNOUNCER  Mach 2 tunnel test, T-minus one minute.  Red lights flash, a siren spins.   Mary hustles off, through  the tunnel.   As fans start to whir.   Wind builds.  She’s almost at the end, when she missteps off the path.   One  of her high heels gets caught in the grating.  THE WIND TUNNEL CONTROL ROOM - CONTINUOUS  Chief Wind Tunnel Engineer: KARL ZIELINSKI, 50s, Polish Jew,  stares down from the glass control booth.   He sees Mary  struggling with the shoe.  THE WIND TUNNEL - CONTINUOUS  The wind picks up.   Mary’s in a state.   Fighting with the  shoe.   A voice over the PA shocks her:  ZIELINSKI (OVER THE PA)  No shoe is worth your life.  Mary looks up at the control booth.   Sees Zielinski staring  down at her.  PA ANNOUNCER  Mach 2 tunnel test, T-minus ten, nine,  eight...  Mary pulls her foot out of the shoe and runs one-shoed,  hobbling toward the exit.  Hidden   Figures   -   5/9/2016   -   Shooting   Draft   -   18   .  (CONTINUED)",
      "characters": [
        "PA ANNOUNCER",
        "RUTH",
        "AL HARRISON"
      ],
      "action_text": "Coupled with rising temperatures on re-  entry, the contacts soften.   We could  consider another fastener other than  bolts.  Zielinski nods approval.   Inspects another section of the  capsule.  ZIELINSKI  There’s another opening in the Engineer  Training Program.  She’s heard this before.   Deflects.  MARY  Flat head rivets could reduce wind drag.  He turns to her.   Serious.  ZIELINSKI  Mary...a person with an engineer’s mind  should be an engineer.   You can’t be a  Computer the rest of your life.   That  would be a tragic waste of your ability.  MARY  Mr. Zielinski, I’m a Negro woman.   I’m  not going to entertain the impossible.  ZIELINSKI  And I’m a polish Jew whose parents died  in a Nazi prison camp.   Now I’m standing  beneath a space ship that’s going to  carry an astronaut to the stars.   I think  we can say, we’re living the impossible.  Let me ask...if you were a white male,  would you wish to be an engineer?  Mary doesn’t need to think.  MARY  I wouldn’t have to.   I’d already be one  INT. NASA HALLWAY - LATER  Vivian Mitchell leads Katherine down an endless white  hallway.   Briefing her:  VIVIAN MITCHELL  Skirts must be worn past the knee.  Sweaters are preferred to blouses.   No  jewelry.   A simple pearl necklace is the  exception.  Hidden   Figures   -   5/9/2016   -   Shooting   Draft   -   20   .  CONTINUED:  MARY (CONT'D)  (MORE)  (CONTINUED) Your supervisor is Mr. Al Harrison,  Director of the Space Task Group.   You’ll  write research, proof calculations, so  forth.   Don’t talk to Mr. Harrison lest  he talks to you.   Not many Computers last  more than a few days, he’s been through a  dozen in as many months.  (hands her a lanyard)  Your clearance.  Katherine takes the lanyard.   She’s overwhelmed.   They arrive  at steel doors labeled: Space Task Group.  VIVIAN MITCHELL (CONT’D)  They’ve never had a colored in here  before, Katherine.   Don’t embarrass me.  Vivian walks off, leaving Katherine alone.   She takes a deep  breath.   Walks int",
      "dialogue_count": 3,
      "word_count": 2883
    },
    {
      "scene_number": 6,
      "slugline": "EXT. NASA GROUNDS - NIGHT  Katherine pushes out a door, into the parking lot.   She’s  relieved to see: Dorothy and Mary leaning on the back of  Dorothy’s car.   Katherine smiles in relief.  DOROTHY  We’ve been waiting for hours.   Next time  you catch a bus.  Dorothy steps into the car, starts it up.   Mary holds a door  open for Katherine.  MARY  (re: Dorothy)  She’s in a mood.  Katherine and Mary hop in the car.  INT. DOROTHY’S CAR - LATER  Dorothy drives.   Katherine’s in back.   Mary’s shotgun, with  her feet on the dash.   The car is their sanctuary.  DOROTHY  I haven’t been late one day in ten years.  Haven’t been out sick. Haven’t  complained.   My work’s on time.   It’s  done right.   It’s done well.  MARY  It’s not fair, that’s a fact.  DOROTHY  What’s not fair is having the  responsibility of a Supervisor, but not  the title or the money.   Watching you all  get moved on.   Now don’t get me wrong,  any upward movement is movement for us  all.   It just isn’t movement for me.  KATHERINE  Truth be told, Dorothy, I don’t know if I  can keep up in that room.   I’ll be back  with the Computers in a week, or out of a  job entirely.  DOROTHY  Oh, please.   You’re better with the  numbers than anyone in there and you know  it.   Make that pencil move as fast as  your mind does, you’ll be fine.  Hidden   Figures   -   5/9/2016   -   Shooting   Draft   -   31   .  (CONTINUED)",
      "characters": [
        "KATHERINE",
        "PASTOR AYRES",
        "JOHN GLENN"
      ],
      "action_text": "Dorothy swats Mary’s feet off her dashboard.  DOROTHY (CONT’D)  And you.   Have some respect.   Get your  damn feet off my dash board.   This isn’t  your living room.  Mary sits up straight.   Katherine sinks back in her seat.  It’s quiet.   For a long time.   Then:  DOROTHY (CONT’D)  I sound like a supervisor, don’t I?  Dorothy smiles wryly.   Mary and Katherine breathe.  MARY  A mean, ole salty one.  KATHERINE  Riddled with authority.   No question.  DOROTHY  You don’t mess with, Mrs. Vaughan.  Dorothy turns the music up.  EXT. KATHERINE’S HOUSE - NIGHT - LATER  Katherine’s tiny, single-family brick house is modest but  well-appointed.   She drags up the walkway, waves goodbye to  Dorothy and Mary pulling off the curb.  INT. KATHERINE’S HOUSE - LIVING ROOM - CONTINUOUS  Katherine steps inside.   The only light shines from the  kitchen, where her mother, JOYLETTE, is doing dishes.  JOYLETTE COLEMAN  My word, Katherine.   I was fixing to call  the National Guard.  Katherine kisses her mom.  KATHERINE  Sorry, Momma.   New assignment.   The Space  Task Group.  JOYLETTE COLEMAN  That sounds important.   It’s a promotion?  KATHERINE  It’s important and overwhelming...maybe a  slight promotion.  Hidden   Figures   -   5/9/2016   -   Shooting   Draft   -   32   .  CONTINUED:  (CONTINUED) Joylette smiles at her daughter.   Always the encourager.  JOYLETTE COLEMAN  You want the job, right?  KATHERINE  I think so.   It’s a challenge.  JOYLETTE COLEMAN  Nothing you can’t do, Katherine.  Katherine lights up.   Joylette’s happy to see a spark in her  daughter’s eye.  KATHERINE  Are they sleeping already?  JOYLETTE COLEMAN  They’re pretending to.   They want their  Momma.  Katherine smiles.  INT. KID’S BEDROOM - CONTINUOUS  Katherine peeks into the tiny bedroom.   One unoccupied double  bed.   And one twin bed where her daughter JOYLETTE (10) is  pushing back against CONSTANCE (8), and KATHY (6), who are  trying with all their might to shove Joylette from the bed.  Katherine ste",
      "dialogue_count": 3,
      "word_count": 3705
    },
    {
      "scene_number": 7,
      "slugline": "INT. AL HARRISON’S OFFICE - DAY - LATER  Stafford’s pacing in front of a seated Katherine.   Sam and  Ruth are behind him, along with a UNIFORMED US MILITARY  OFFICER.  PAUL STAFFORD  It’s classified information.  SAM TURNER  It’s top secret.  Across from them is a distressed Katherine.  KATHERINE  It’s not a mystery why the Redstone tests  keep failing.   It’s fine for sub-orbital  flight, but it can’t handle the weight of  the capsule and push it into space.   The  numbers don’t lie.  Pan over to: Al Harrison.   He’s been standing quietly off to  the side, studying the redacted report.  AL HARRISON  And you figured that out with this?   Half  the data is redacted.  KATHERINE  What’s there tells the story if you read  between the lines.   The distance from  launch to orbit is known.   The Redstone  mass is known.   The Mercury Capsule  weight is known.   And the speeds are  there in the data.  Impressive.  AL HARRISON  You did the math.  KATHERINE  Yes, sir.   I looked beyond.  AL HARRISON  Then how did you know about the Atlas  rocket?   That’s not math.   That data’s  not here.   Like he said, it’s classified.  Harrison waves the report at her.   Katherine pauses.  KATHERINE  I held it up to the light.  Hidden   Figures   -   5/9/2016   -   Shooting   Draft   -   49   .  (CONTINUED)",
      "characters": [
        "AL HARRISON"
      ],
      "action_text": "Really.   Harrison holds the report up to the light.   Squints  at the redaction.   Sees: “Atlas.”  AL HARRISON  Yep.   There it is.  He shakes his head in disbelief.  AL HARRISON (CONT’D)  What’s your name?  KATHERINE  Katherine Goble.  AL HARRISON  Are you a spy, Katherine?  KATHERINE  Am I what?  AL HARRISON  Are you a Russian spy?  KATHERINE  No sir, I’m not Russian.  Harrison looks to Ruth.  RUTH  She’s not Russian, sir.  AL HARRISON  All right then, we have nothing to lose  here.   Let’s get her everything she needs  to work on Shepard’s trajectories.  Without redaction.   Are we clear on that?  Nods and agreement.   Stafford objects:  PAUL STAFFORD  Are we sure about this?  AL HARRISON  What’s the issue, Paul?   You heard  her...she’s not a spy.  PAUL STAFFORD  I just don’t think it’s a good idea.  AL HARRISON  You know what I think is a good idea?  Harrison tosses the redacted documents in the trash.  Hidden   Figures   -   5/9/2016   -   Shooting   Draft   -   50   .  CONTINUED:  (CONTINUED) Vivian sees the women.   B-lines over.   She drops the file in  front of Mary.  VIVIAN MITCHELL  NASA doesn’t commission females for the  Engineer Trainin’ Program.  Mary ruffles up.  MARY  That position is open to any qualified  applicant.  VIVIAN MITCHELL  Right. ‘Cept you don’t have the  educational requirements.  MARY  I have a Bachelors Degree in Mathematics  and Physical Sciences.   Same degree as  most engineers ‘round here.  Vivian does not like to be challenged.  VIVIAN MITCHELL  We now require advanced extension courses  through the University of Virginia.   It’s  in the Employee Handbook.   An addendum.  She slides a copy on the table.  VIVIAN MITCHELL (CONT’D)  ‘Case you haven’t read it.  Mary can’t control her frustration.  MARY  Every time we have a chance to get ahead,  ya’ll move the finish line.  Vivian tightens up.  VIVIAN MITCHELL  I just follow the rules around here.   And  I expect those who work for me to follow  ‘em as well.   There are no special",
      "dialogue_count": 1,
      "word_count": 1099
    },
    {
      "scene_number": 8,
      "slugline": "EXT. HAMPTON COUNTY COURTHOUSE - DAY  A Civil Rights protest in progress.   DOZENS OF BLACK MEN AND  WOMEN holding desegregation signs march outside the  Courthouse, chanting.   A LINE OF WHITE POLICE OFFICERS block  the sidewalk.  Levi Jackson’s smack in the middle of the fray.   A POLICE DOG  rares up, knocking Levi to the ground.   He bounces up, full  of fire.  Turning the corner, Dorothy and her two youngest: Leonard (9)  and Kenneth (6), walk down the opposite sidewalk.  KENNETH  What’s happening over there?  DOROTHY  Don’t pay attention to all that.   We’re  not part of that trouble.  Dorothy looks across the way, sees Levi in the thick of it.  She pulls her boys up the steps of:  EXT. HAMPTON PUBLIC LIBRARY - CONTINUOUS  They climb the stone stairs of the “Colored Entrance.”  INT. HAMPTON PUBLIC LIBRARY - LATER  Dorothy’s in the middle of an aisle of reference books.  Searching titles.   The boys are at her feet, fussing.  DOROTHY  (taps Leonard on the head)  I told you no fussing around.  Dorothy hands them a book.  DOROTHY (CONT’D)  Read together.   Be quiet.  They do as told.   Dorothy keeps searching the racks.   She  finds what she’s looking for, a book titled:   Fortran, The New  Language of Computers .  She pulls it off the shelf.   A WHITE LIBRARIAN in the next  aisle stares back at her.  WHITE LIBRARIAN  We don’t want any trouble in here.  Hidden   Figures   -   5/9/2016   -   Shooting   Draft   -   55   .  (CONTINUED)",
      "characters": [],
      "action_text": "DOROTHY  I’m not here for any trouble.  WHITE LIBRARIAN  What are you here for?  DOROTHY  A book.  WHITE LIBRARIAN  You have books in the colored section.  DOROTHY  It doesn’t have what I’m looking for.  WHITE LIBRARIAN  That’s just the way it is.  EXT. LIBRARY - MOMENTS LATER  A SECURITY GUARD escorts Dorothy and her boys, not so gently,  out of the library.   The Guard grabs the kids’ shoulders,  moving them along.  DOROTHY  Get your hands off my boys.   Don’t touch  them.  She pulls her boys away from the Guard.   Gathers her dignity.  Turns back.   Grits a smile.  DOROTHY (CONT’D)  You have a blessed day.  INT. CITY BUS - LATER  We push past SEVERAL WHITE PASSENGERS to the back of the  bus...where we find Dorothy between her boys.  DOROTHY  Separate and equal are two different  things.   Just cause it’s the way, doesn’t  make it right.   You understand?  THE BOYS  Yes, Momma.  DOROTHY  You act right, you are right.   That’s for  certain.   Understand?  THE BOYS  Yes, Momma.  Hidden   Figures   -   5/9/2016   -   Shooting   Draft   -   56   .  CONTINUED:  (CONTINUED) She smiles at her little men.   Settles in.   Then...pulls the  Fortran Computer book out of her purse.  LEONARD  You took that book, Momma?  DOROTHY  Son, I pay taxes.   And taxes pay for  everything in that library.   You can’t  steal what you already paid for.  She opens the book and starts reading to them:  DOROTHY (CONT’D)  Fortran is a new and exciting language  used by programmers to communicate with  computers...  Titles over: April 12, 1961  INT. DOROTHY’S HOUSE - DAY  A birthday party: Leonard Vaughan’s turning 9.   The place is  packed with FAMILY, FRIENDS and CHILDREN.  Little Leonard stands, eyes closed (making a wish) in front  of a sprinkled cake.   He opens his eyes.   Blows.   Misses a  few.   Blows again, way too close.  DOROTHY  Cake’s already got sprinkles, baby.  Doesn’t need a shower.  Dorothy gives him a small hug.   Everyone LAUGHS and CLAPS.  Dorothy starts cutting cake.   Ka",
      "dialogue_count": 0,
      "word_count": 1961
    },
    {
      "scene_number": 9,
      "slugline": "INT. KATHERINE’S HOUSE - DINING ROOM - LATER  Katherine, Jim and the Girls are sitting at the table.  Plates of food in front of them.   The Girls are sizing up  every fiber of this new man in their house.  Heads bow for grace.   Jim offers Katherine his hand.   She  takes it.  END OF MONTAGE  EXT. NASA GROUNDS - ANOTHER DAY  Rain pelts the campus.  INT. SPACE TASK GROUP - CONTINUOUS  Harrison barrels out of his office.   Juggling worksheets.  Beyond stressed.  AL HARRISON  Ruth, get the Cape on the line.  Shepard’s trajectories need to be  updated.  He looks over to Katherine’s desk.  AL HARRISON (CONT’D)  Where is she?!  Ruth shrugs.   Harrison, frustrated, walks off.  INT. COLORED RESTROOM - DAY - CONTINUOUS  Katherine’s washing her hands.   She grabs a stack of  worksheets and rushes out.  EXT. NASA GROUNDS - CONTINUOUS  Pouring rain.   Katherine runs across campus, back to the East  Building.  INT. SPACE TASK GROUP - MOMENTS LATER  Katherine’s soaked like a wet rat.   She walks back to her  desk.   Stafford’s staring at her.   Ruth’s staring at her.  The whole damn place seems to be staring at her.  AL HARRISON (O.S.)  Where the hell have you been?   Everywhere  I look you're not where I need you to be.  And it's not my imagination.  Hidden   Figures   -   5/9/2016   -   Shooting   Draft   -   64   .  (CONTINUED)",
      "characters": [],
      "action_text": "Katherine turns, Harrison’s on the floor.   Katherine freezes.  AL HARRISON (CONT’D)  Where the hell do you go everyday?  KATHERINE  (quietly)  The bathroom, sir.  AL HARRISON  The bathroom!   The damn bathroom!  KATHERINE  Yes, sir.   The bathroom.  AL HARRISON  For 40 minutes a day!?   What do you do in  there!?   We are T-minus zero here.   I put  a lot of faith in you.  Katherine can barely speak.   She whispers:  KATHERINE  There’s no bathroom for me here.  AL HARRISON  There’s no bathroom?   What do you mean  there’s no bathroom for you here?  Katherine can’t take it anymore.   Her voice rises.  KATHERINE  There’s no bathroom here.   There are no  COLORED bathrooms in this building or ANY  building outside the West Campus.   Which  is half a mile away!   Did you know that?  I have to walk to Timbuktu just to  relieve myself!   And I can’t take one of  the handy bikes.   Picture that, with my  uniform: skirt below the knees and my  heels.   And don’t get me started about  the “simple pearl necklace” I can’t  afford.   Lord knows you don’t pay “the  coloreds enough for that.   And I work  like a dog day and night, living on  coffee from a coffee pot half of you  don’t want me to touch!   So excuse me if  I have to go to the restroom a few times  a day!  You can hear a pin drop.   Katherine takes her purse,  personals and walks off.   Leaving everyone’s jaws on the  ground.  Hidden   Figures   -   5/9/2016   -   Shooting   Draft   -   65   .  CONTINUED:",
      "dialogue_count": 0,
      "word_count": 475
    },
    {
      "scene_number": 10,
      "slugline": "EXT. COLORED RESTROOM HALLWAY - LATER  BANG!   BANG!   BANG!   The sound of hammering, tearing.  A SECURITY GUARD runs down the hallway and arrives upon a  scene: a crowd of TECHS and ENGINEERS block the corridor.   He  pushes through the crowd to the front...where...Ruth holds up  her hand, stops him.   There in front of the group:   an  inflamed Al Harrison, wielding a crow bar, is bashing the  “Colored Restroom” sign on the wall.  AL HARRISON  Damn thing!  On the other side of the corridor...the entire West Computing  Group, including Dorothy and Mary watch in wonder.   Katherine  makes her way through, landing between them.  Harrison flails away at the sign.   Bang!   Bang!  AL HARRISON (CONT’D)  For Christ’s sake!  Harrison keeps at it.   Rip.   Bang.   The sign’s holding on,  with all it’s might.   Imagine that.   He takes a final  successful WHACK!   And the sign crashes to the floor.  AL HARRISON (CONT’D)  There you have it!   No more colored  restrooms.   No more white restrooms.  Just plain old toilets.  Harrison looks over.   He sees Katherine.  AL HARRISON (CONT’D)  Go wherever you damn well please.  Preferably closer to your desk.  Harrison snatches up the sign.  AL HARRISON (CONT’D)  At NASA we all...pee the same color!  He stumbles off.   Straight through the Crowd.   Shock and  pride and justice for all those watching.   Katherine nods  approval.  Titles over: May 5, 1961  EXT. ROAD - LATER  Jim and Katherine drive down a picturesque road in a  convertible.  Hidden   Figures   -   5/9/2016   -   Shooting   Draft   -   66   .",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 249
    },
    {
      "scene_number": 11,
      "slugline": "EXT. SIDE OF THE ROAD - LATER  The convertible’s parked on the side of the road.   Katherine  and Jim are sitting on a blanket in front of the car.   A road-  side picnic.   Jim pours Katherine a Chianti.  JIM JOHNSON  I think it’s high time that I kissed you,  Mrs. Goble.  KATHERINE  Oh.   And why’s that?  JIM JOHNSON  Figure you’re attracted to me the same as  I to you.  KATHERINE  Is that right?  JIM JOHNSON  Yes.   Or you would have told me to get  going a long time ago.  Jim leans in and kisses Katherine.   She doesn’t flinch.   Jim  leans back.  KATHERINE  Haven’t kissed a man in a long time.  Almost forgot how.  Jim leans in again.   They kiss again.  DOROTHY’S LIVING ROOM - CONTINUOUS  Everyone (our Gals, Levi, Howard, Jim, all the Kids) is  gathered in front of the TV to watch...  TV REPORTER (LIVE FEED)  We’re just moments away from Alan  Shepard’s maiden flight as the first  American in space.  Food is passed around.   People sit on the carpet.   It’s the  biggest show on Earth.  INT. FREEDOM 7 CAPSULE - DAY  Shepard’s sitting in the tight ‘can’ he’s named: “Freedom 7.”  America’s first space capsule.   Even through the glass of his  helmet, you can feel the sweat, the tension.  Hidden   Figures   -   5/9/2016   -   Shooting   Draft   -   67   .  (CONTINUED)",
      "characters": [
        "NEWSCASTER",
        "PAUL STAFFORD"
      ],
      "action_text": "ALAN SHEPARD  Any day now, Capcom.   Fix your little  problem and light this candle!  NASA TRACKING CONTROL - HAMPTON, VA - CONTINUOUS  NASA command is wall to wall with ENGINEERS, TECHS, SUPPORT.  The room laughs at Shepard’s anxiety, a little release of the  taut energy of the moment.  Fellow Mercury 7 Astronaut, Gordon Cooper, is Shepard’s  Capcom (Capsule Communicator.)  GORDON COOPER (V.O.)  Roger that, Freedom 7.   Standby.  Gordon looks over at Harrison.  AL HARRISON  Move to final countdown sequence.  DOROTHY’S LIVING ROOM  Dorothy, Katherine and Mary are locked on the screen.   Even  the Children are quiet.   Rapt.  TV REPORTER (LIVE FEED)  And we’re at T-minus 10, 9...  NASA TRACKING CONTROL - HAMPTON, VA - CONTINUOUS  Gordon counts down.  GORDON COOPER  8, 7, 6...  THE FREEDOM 7 CAPSULE - CONTINUOUS  Shepard braces himself.  GORDON COOPER (IN ALAN’S EAR)  5, 4, 3...  DOROTHY’S LIVING ROOM - CONTINUOUS  They countdown along with the Reporter:  DOROTHY’S HOUSE FULL  2, 1, 0.  Hidden   Figures   -   5/9/2016   -   Shooting   Draft   -   68   .  CONTINUED: NASA TRACKING CONTROL - HAMPTON, VA - CONTINUOUS  Pins and needles.   Gordon:  GORDON COOPER (INTO MICROPHONE)  You’re go for launch.  CAPE CANAVERAL - FLORIDA - CONTINUOUS  In the background...the rocket roars up off the launchpad,  fire spewing from its base.  TV REPORTER (LIVE FEED)  And we have liftoff!  THE FREEDOM 7 CAPSULE - CONTINUOUS  Alan Shepard is shaking with the blast.   Crushed into his  seat by the extreme G.  NASA TRACKING CONTROL - HAMPTON, VA - CONTINUOUS  The Command Team watches the rocket shoot up into the sky.  DOROTHY’S LIVING ROOM - CONTINUOUS  Katherine pushes the rocket with her words:  KATHERINE  Get up there.   Go on.  THE FREEDOM 7 CAPSULE - CONTINUOUS  Alan Shepard breaks through the atmosphere.  ALAN SHEPARD  This is okay.  NASA TRACKING CONTROL - HAMPTON, VA - CONTINUOUS  The Command Team finally breathes.   Shepard’s voice:  ALAN SHEPARD (OVER INTERCOM)  Yaw is OK.   Switch",
      "dialogue_count": 2,
      "word_count": 3397
    },
    {
      "scene_number": 12,
      "slugline": "INT. SPACE TASK GROUP - NIGHT  Katherine’s at the chalk board.   Working the math.  Determined.   Exhausted.  INT. SPACE TASK GROUP HALLWAY - ANOTHER DAY  Harrison, Stafford, Sam and Team are walking to the Pentagon  briefing.   Katherine catches up to them, report in hand:  KATHERINE  Launch parameters for Friendship 7, sir.  PAUL STAFFORD  It’s all moot.   We’re altering the window  on the capsule.  KATHERINE  When did that happen?  PAUL STAFFORD  6 minutes ago.   The mass is changing.  Start over.  Katherine’s irked, all her hard work...pointless.  KATHERINE  Sir.   If I could attend these  briefings...I’d be able to stay current-  PAUL STAFFORD  We’ve been through this, Katherine.   It’s  not possible.   There’s no protocol for  women attending.  KATHERINE  There’s no protocol for a man circling  the Earth either, sir.  Stafford hands her report back to her.  PAUL STAFFORD  That’s just the way it is.  He walks off.   Katherine keeps her head high.   Harrison  clocks it all.  INT. SPACE TASK GROUP - ANOTHER DAY  Katherine’s high on the ladder at the chalkboard.   One leg  dangling as she computes.   Chalk dust flies.  Harrison’s in his office on the phone, looking out at her.  Hidden   Figures   -   5/9/2016   -   Shooting   Draft   -   83   .",
      "characters": [],
      "action_text": "INT. SPACE TASK GROUP - ANOTHER NIGHT  Katherine’s at her desk typing a report.  INSERT - The cover page.   Typing: ”Friendship 7 (John  Glenn,) Launch Projections,” By Paul Stafford.   Again, she  adds: “and Katherine Goble.”  She pulls the sheet out and slaps it on top of the rest of  her report.  INT. SPACE TASK GROUP HALLWAY - ANOTHER DAY   (FORMERLY 161)  A familiar site: Harrison, Stafford, Sam and Team are walking  to the daily briefing.   Katherine intercepts:  KATHERINE  (to Stafford)  Colonel Glenn’s launch coordinates  accounting for the window change, sir.  She hands her report to Stafford.   Stafford sees her name on  the cover.  PAUL STAFFORD  I’ve told you this: Computers don’t  author reports.   Fix it.  He shoves the report back at her.   She won’t take it.  KATHERINE  Those are my calculations.   My name  should be on it.  He pulls the cover page off.   Katherine reaches for the  report now.   A tug-of-war.  PAUL STAFFORD  That is not the way it works.  Harrison turns back.   He’s watched this long enough.  AL HARRISON  Paul.   What’s happening here?  Katherine let’s go of the report.   Addresses the bigger  issue:  KATHERINE  Mr. Harrison, I’d like to attend today’s  briefing.  Hidden   Figures   -   5/9/2016   -   Shooting   Draft   -   84   .  (CONTINUED) AL HARRISON  Why’s that?  KATHERINE  Well, sir, the data changes so fast.   The  capsule changes.   The weight and the  landing zones are all changing daily.   I  do my work, you attend these briefings  and I have to start all over.   Colonel  Glenn launches in a few weeks.   And we  don’t have the math figured out yet.  Harrison weighs it out.   He turns to Stafford.  AL HARRISON  Why can’t she attend?  PAUL STAFFORD  She doesn’t have clearance, Al.  Harrison nods.  KATHERINE  I cannot do my work effectively without  having all of the data and all of the  information as soon as it’s available.   I  need to be in that room, hearing what you  hear.  PAUL STAFFORD  Pentagon Briefings are not for ",
      "dialogue_count": 0,
      "word_count": 1791
    },
    {
      "scene_number": 13,
      "slugline": "INT. SPACE TASK GROUP - NIGHT  Once again...Katherine is among the last “men” working.  She’s standing in front of the chalkboard, staring at the  numbers.   Stuck, for the first time in her life.  Stafford stops at his desk.   Looks over at Katherine.   Stares  at her work on the board.  He walks past her, without a word.  EXT. MARY’S HOUSE - DUSK  Dusk light bathes Mary’s house.  INT. MARY’S HOUSE - ANOTHER NIGHT  Mary’s sitting on the bed, putting on her stockings.   Levi  enters, holding a small box.  MARY  I don’t know when I’ll be home.   The  class ends at 9.  Levi just stands there.  MARY (CONT’D)  You have something to say?  He hands her the box.  LEVI JACKSON  Thought you might need these.  Mary opens the box.   A set of mechanical pencils.  LEVI JACKSON (CONT’D)  You can refill ‘em with any weight lead  you want.  Levi sits next to her.   Demonstrates how they work.  LEVI JACKSON (CONT’D)  Just pull the eraser off, like this, drop  the new lead down through here.  Mary watches him, not the pencil.   He takes her hand.  LEVI JACKSON (CONT’D)  You’re going to make a fine engineer.  MARY  You think so?  Hidden   Figures   -   5/9/2016   -   Shooting   Draft   -   92   .  (CONTINUED)",
      "characters": [],
      "action_text": "LEVI JACKSON  Yes.   Nobody dare stand in the way of  Mary Jackson’s dreams.   Myself included.  MARY  Amen.  Levi kisses her.   Mary touches his face.  MARY (CONT’D)  Don’t make me mad again.  LEVI JACKSON  Yes, Ma’am.  They kiss again.  EXT. HAMPTON HIGH SCHOOL - NIGHT - LATER  A city bus pulls away, leaving Mary standing in front of  Hampton High School.   She stares at the building, takes a  deep breath and walks toward the entrance.  INT. HAMPTON HIGH SCHOOL - NIGHT - MOMENTS LATER  Mary walks down the darkened hallway of this typical High  School.   A lone light shines from the one open door at the  end of the hall.  INT. CLASSROOM - CONTINUOUS  Mary steps into the classroom.   TWO DOZEN WHITE MALE STUDENTS  look up at once.   The PROFESSOR turns from the board.  MARY  Good evening.   Is this Quantum Mechanics?  PROFESSOR  Yes.  Mary approaches, hands him a copy of her petition.  MARY  I’m Mary Jackson.   I’m enrolled.  The Professor scans the petition.   It’s official.   He’s  genuinely confused.  PROFESSOR  Well.   The curriculum is not designed for  teaching...a woman.  She’s unstoppable:  Hidden   Figures   -   5/9/2016   -   Shooting   Draft   -   93   .  CONTINUED:  (CONTINUED) MARY  Well, I imagine it’s the same as teaching  a man.  (she smiles at him)  I don’t see a colored section.   Should I  take any seat?  He nods.   Mary turns to the class.   A few seats left.   Few on  the back row.   Few in the middle.   One on the front row.  Mary steps forward, all eyes on her.   She considers her  choices.   Then...she plops down.   First row.   Dead center.  She pulls out her notebook.   Let’s go.  INT. SPACE TASK GROUP - ANOTHER DAY  Al Harrison sits at his desk, tortured.   Studying.   He turns  to his board, the math.   The camera pushes past him to the  numbers.  INT. SPACE TASK GROUP - ANOTHER DAY  Katherine’s back at the board in front of a chalked drawing  of the capsule’s orbits.   Stafford’s sitting on the desk  behind her.   Sam and other Team Memb",
      "dialogue_count": 0,
      "word_count": 1234
    },
    {
      "scene_number": 14,
      "slugline": "EXT. KATHERINE’S HOUSE - NIGHT - LATER  Katherine slugs up the walkway to her house.   She waves  goodbye to Dorothy and Mary pulling away.  INT. KATHERINE’S HOUSE - LIVING ROOM - CONTINUOUS  Katherine steps in to find, Joylette (Mom,) Joylette (10,)  Kathy and Constance sitting at the dinner table wearing their  best dresses.   The table is set, the room bathed in  candlelight.  KATHERINE  Please tell me I didn’t miss a birthday.  Jim Johnson steps in from the kitchen, wearing an apron,  holding a frying pan.  JIM JOHNSON  Good evening, Mrs. Goble.  KATHERINE  (hmmm.)  Jim.  The girls help Katherine take off her coat, lead her to the  table.  CONSTANCE  Madame...your seat.  KATHERINE  Is it   my   birthday?  The girls giggle.   Katherine sits.   Constance pushes her seat  in.   Kathy puts a napkin in her lap.   Katherine looks to her  Mom.  KATHERINE (CONT’D)  Are you going to say anything?  JOYLETTE COLEMAN  It’s not my place.  Jim sits next to Katherine.   It’s quiet.   Katherine looks  them all over.   Then:  KATHERINE  Okay, I’m not going to do this all  night...  Hidden   Figures   -   5/9/2016   -   Shooting   Draft   -   98   .  (CONTINUED)",
      "characters": [
        "JOYLETTE"
      ],
      "action_text": "The Girls eye motion to something sitting on the table right  in front of Katherine.   She finally looks down...and sees a  small box damn near under her nose.   She knows what it is.  KATHERINE (CONT’D)  Oh, mother of mercy.   That’s for me.  Everyone nods.   Jim takes the box.   Then...gets down on one  knee.   Instant tears come to Katherine’s eyes.  KATHY  Are you sad, Momma?  The girls comfort her.  JOYLETTE (10)  It’s okay, Momma.  CONSTANCE  He’s a good man.  KATHERINE  I know.   I know.   I just.   I can’t help  it.  More tears.  KATHY  He hasn’t even asked you yet.  KATHERINE  He’s going to.  She looks at Jim.  KATHERINE (CONT’D)  Is that what you’re going to do?  JIM JOHNSON  If anyone will let me.  CONSTANCE  Go on then.   She’s already crying.  Jim opens the box: a classic, handmade diamond ring.  JIM JOHNSON  This was my mother’s ring.   She and my  father were married-  Joylette (10) cuts him off.  Hidden   Figures   -   5/9/2016   -   Shooting   Draft   -   99   .  CONTINUED:  (CONTINUED) JIM JOHNSON  I didn’t ask you yet.  Katherine kisses Jim.   She folds into his arms.   The girls  wrap their arms around the two of them.   A family is born.  INT. NASA HANGAR - ANOTHER DAY  A group of Engineers and NASA Techs surround the Mercury  Capsule.   As we push through the crowd, we find AEROSPACE  ARTIST, CECELIA BIBBY, painting “Friendship 7” on the side of  the capsule.  John Glenn’s sitting in the capsule’s hatch, dressed in full  gear.   As a camera flash bulb pops, capturing the moment.  EXT. NASA GROUNDS - ANOTHER DAY  Raining.   A gray day in every way.  INT. HARRISON’S OFFICE - LATER  Harrison is surrounded by piles of work.   Katherine steps in.  KATHERINE  You wanted to see me, sir?  AL HARRISON  Have a seat.  This is serious.   She obliges.  KATHERINE  Something wrong, Mr. Harrison?  AL HARRISON  No.   There’s nothing wrong.   In fact our  IBM is churning out numbers in fractions  of the time any human can.   Present  company included.  KATHERINE",
      "dialogue_count": 1,
      "word_count": 1955
    },
    {
      "scene_number": 15,
      "slugline": "EXT. NASA GROUNDS - MORNING  Katherine and Sam run.   Katherine turns sharply, she knows  the inside track.   Sam catches up.  NASA TRACKING ROOM HALLWAY - MOMENTS LATER  Katherine and Sam race toward the Tracking Control Room.  NASA EMPLOYEES jump out of the way.   Sam wraps on the door.  Bang!   Bang!   Bang!  OUTSIDE THE TRACKING CONTROL ROOM - CONTINUOUS  Another Assistant Engineer opens the door.   Katherine hands  him the work:  KATHERINE  Here you go.  Sam steps inside.   And before Katherine can get a word in,  the door closes in her face.   She’s locked out.  She stands there, decompressing.   All that work.   All that  energy.   Never an ounce of satisfaction.  Eventually...she walks away.   Down the hallway.  Crash!   The door springs open.   Harrison steps out into the  hallway:  AL HARRISON  Katherine.  She turns at the familiar voice.   He holds up a lanyard: a  special clearance badge.  TRACKING CONTROL ROOM - CONTINUOUS  Harrison escorts Katherine into the room: the Engineers at  control stations, the massive screens, the live feeds,  tracking stations, tech details, etc.   The energy.  Katherine’s in awe.   This is the culmination of her work.  SAM TURNER  (calls out to Harrison)  Sir, we’ve got Pad 14 at the Cape on the  line.  Harrison hits a button on the intercom.  Hidden   Figures   -   5/9/2016   -   Shooting   Draft   -   108   .  (CONTINUED)",
      "characters": [],
      "action_text": "AL HARRISON (ON MIC)  This is Langley.   We have the coordinates  confirmed .  INTERCUT WITH:  PAD 14 - CONTINUOUS  Scott Carpenter’s on the Pad phone.  SCOTT CARPENTER (ON PHONE)  (to John Glenn, at the prep pad)  Langley’s on the phone.  JOHN GLENN  Right on time.  John Glenn stalks over.  SCOTT CARPENTER (ON PHONE)  What do you say, Langley?  Harrison pipes up:  AL HARRISON (ON MIC)  We can confirm the Go/No Go point for  re-entry is 16.11984, -165.2356. The  launch window is a go.   The landing  coordinates match.  John Glenn answers himself.  JOHN GLENN (ON PHONE)  Good to hear that, Al.   Hard to trust  something you can’t look in the eyes.  The whole Team lights up at the sound of John Glenn’s voice.  AL HARRISON (ON MIC)  That’s right, Colonel.   Katherine did  manage to calculate a few decimal points  further than that hunk of metal.  JOHN GLENN (ON PHONE)  I’ll take every digit ya got.   Be sure to  thank her for me.  AL HARRISON (ON MIC)  Copy that.   Good luck,   Friendship 7.  We’ll see you in the Bahamas.  JOHN GLENN (ON PHONE)  God speed, Langley.  Hidden   Figures   -   5/9/2016   -   Shooting   Draft   -   109   .  CONTINUED:",
      "dialogue_count": 0,
      "word_count": 413
    },
    {
      "scene_number": 16,
      "slugline": "INT. WEST COMPUTING ROOM - CONTINUOUS  Dorothy, Mary and the West Group are glued to the TV.  NEWSCASTER (ON TV)  T-minus 10 seconds.   9.   8.  THE FRIENDSHIP 7 CAPSULE - CONTINUOUS  John Glenn is laser focused.   Still.   Calm.  MISSION CONTROL COMMANDER (IN JOHN’S EAR)  7.   6.   5.  SHOTS OF THE ENTIRE NATION COUNTING DOWN - CONTINUOUS  -- The throngs of people at Cocoa Beach.  -- People in front of a TV Store in Times Square.  TRACKING CONTROL ROOM - CONTINUOUS  Harrison turns away from the screens.   Doesn’t care to watch.  Katherine’s riveted.  MISSION CONTROL COMMANDER (ON INTERCOM)  4.   3.   2.   1.   Ignition.   Go for  liftoff.  CAPE CANAVERAL - CONTINUOUS  The rocket blasts off the pad.   Heads toward the heavens.  People stare in awe.  JOHN GLENN (V.O.)  We’re programming into a roll.  MISSION CONTROL COMMANDER (V.O)  Roger that.  JOHN GLENN (V.O.)  It’s getting bumpy along here.  MISSION CONTROL COMMANDER (V.O.)  Roger that.   You are in Max Q.  THE WEST COMPUTERS - CONTINUOUS  No one moves:  JOHN GLENN (V.O.)  Roger that, smoothing out real fine.  Hidden   Figures   -   5/9/2016   -   Shooting   Draft   -   110   .  (CONTINUED)",
      "characters": [],
      "action_text": "MISSION CONTROL COMMANDER (V.O.)  Twenty seconds to SECO--  HARRISON, KATHERINE AND THE TRACKING TEAM - CONTINUOUS  JOHN GLENN (V.O.)  Zero G.   Feeling fine.   I feel fine.  Harrison rubs his eyes.  MISSION CONTROL COMMANDER (V.O.)  Go for SECO.  The rocket becomes an indiscernible blaze high in the air on  the screen.  JOHN GLENN (V.O.)  Roger that.  And then...it’s gone.  CAPE CANAVERAL - CONTINUOUS  The crowd is silent.  HARRISON, KATHERINE AND THE TRACKING TEAM  Harrison cracks his neck.   The silence is torture.   Then:  JOHN GLENN (V.O.)  Oh, that view is tremendous.  And, John Glenn’s in space.   A collective sigh of relief.  MISSION CONTROL COMMANDER (V.O.)  Roger, that, Friendship 7.   You are go  for orbit.  The journey has just begun.   Harrison finally turns to the  screens.  AL HARRISON  10.5 hours to go.   If we make 7 round  trips.  He sits down.   A rare event.  AL HARRISON (CONT’D)  I need a coffee.  Assistants scramble.  Hidden   Figures   -   5/9/2016   -   Shooting   Draft   -   111   .  CONTINUED:",
      "dialogue_count": 0,
      "word_count": 346
    },
    {
      "scene_number": 17,
      "slugline": "INT. WEST COMPUTER ROOM - LATER  The Computers are packing up for the day.   Heading home.  Dorothy’s the last.   She shuts off the TV.  Vivian Mitchell enters.   Envelope in hand, she holds it out.  VIVIAN MITCHELL  New assignment came down the pike.  Dorothy takes the envelope.   Doesn’t want to open it.  VIVIAN MITCHELL (CONT’D)  Always changin’ ‘round here.   Hard to  keep up.  Dorothy opens the envelope.   Reads.   Poker-faced.   She looks  up to Vivian.  VIVIAN MITCHELL (CONT’D)  Seems like they’re gonna need a permanent  team to feed that IBM.  DOROTHY  How big of a team?  VIVIAN MITCHELL  30 to start.  They stare at each other for the longest time.   An  understanding between them.   Some growth.   But  mostly...respect.  DOROTHY  Thank you for the information, Mrs.  Mitchell.  VIVIAN MITCHELL  You’re quite welcome...Mrs. Vaughan.  Mrs. Vaughan?   Yes.   She called her Mrs. Vaughan.   Vivian  walks out.  Dorothy opens the letter and re-reads:  INSERT - Dorothy Vaughan, Transfer Assignment to: IBM  Computing Lab.   Position:   Supervisor .  She walks to the door.   Turns back.   Takes one last look at  her old digs: the adding machines, the mismatched desks...and  finally the “Colored Computers” sign.   And...she shuts off  the lights.  Hidden   Figures   -   5/9/2016   -   Shooting   Draft   -   112   .",
      "characters": [
        "NEWSCASTER",
        "JOHN GLENN"
      ],
      "action_text": "TRACKING CONTROL ROOM - CONTINUOUS  Harrison’s drinking coffee.   Katherine’s sitting in a chair.  Stafford is talking to TECHS.   Zielinski’s eating a sandwich.  Suddenly, a warning light blinks red.  JOHN GLENN (V.O.)  Capcom 7, I have a warning light.  THE FRIENDSHIP 7 CAPSULE - CONTINUOUS  John Glenn inspects his console.  MISSION CONTROL COMMANDER   (IN JOHN’S EAR)  Standby, Friendship 7.  TRACKING CONTROL ROOM - CONTINUOUS  Zielinski turns to Harrison.  ZIELINSKI  It’s the heat shield lock, Al.  AL HARRISON  What are we looking at, Stafford?  STAFFORD  The heat shield may have come loose.  MISSION CONTROL COMMANDER (V.O.)  7, will you confirm the landing bag is in  the OFF position?  THE FRIENDSHIP 7 CAPSULE - CONTINUOUS  John Glenn checks:  JOHN GLENN  Affirmative, Capcom.  MISSION CONTROL COMMANDER (IN JOHN’S EAR)  Have you heard any banging noises or  anything of this type at higher rates?  JOHN GLENN  That’s a negative.  TRACKING CONTROL ROOM - CONTINUOUS  Stafford is a mess:  Hidden   Figures   -   5/9/2016   -   Shooting   Draft   -   113   .  (CONTINUED) STAFFORD  We need to get him down,   now .   We could  burn up on re-entry.  Harrison considers.   Then:  AL HARRISON  Get Hawaii Capcom.  EXT. GRAMMAR SCHOOL - CONTINUOUS  Mary’s outside her kids’ school, scanning the dozens of  children for her little ones.  Levi, Jr. and Carolyn Marie break through the crowd.   Hug  their Momma.  MARY  Gotta hurry, bunny rabbits.   There’s a  man in space.   We don’t want to miss it.  Mary stops in her tracks.   Across the street: a CROWD is  gathering in front of an appliance store window full of TVs.  Anxiety.   Worry on faces.   A MAN yells:  MAN  Something’s wrong with Glenn.  Mary pulls her kids that way.  APPLIANCE STORE WINDOW - CONTINUOUS  The TV Newscaster:  NEWSCASTER  We’ve just learned, the Friendship 7 is  in danger of losing its heat shield.  Mary and her kids, step up to the window.   This is bad.  MARY  (talks to the TV)  Tell them not to jettison the",
      "dialogue_count": 2,
      "word_count": 1453
    },
    {
      "scene_number": 18,
      "slugline": "EXT. UNIVERSITY OF VIRGINIA CAMPUS - ANOTHER DAY  Mary’s in cap and gown, post graduation.   She runs into the  waiting arms of: Katherine and Dorothy.   Happiest day of her  life.   The women celebrate, laugh.   Karl Zielinski tips his  hat to Mary.   Smiles at her.  Mary takes off her cap and throws it high into the sky.  Titles over:   “Mary Jackson went on to obtain her Master’s  degree in engineering from the University of Virginia.  She became the first female engineer...of any color at NASA.”  INT. DOROTHY’S CAR - LATER  Dorothy’s driving home.  Titles over:   “Dorothy Vaughan became the Head of Langley’s  centralized Electronic Computing Group, as NASA’s first black  Supervisor.   In   1964 she joined the Scout Team, working to  send unmanned explorers to Mars.”  INT. IBM COMPUTER ROOM - SOME TIME LATER  Dorothy’s standing in front of the mainframe, her sleeves  rolled up.   Vivian Mitchell walks in with a GROUP OF TRANSFER  EMPLOYEES.   Black and white.   All women .  VIVIAN MITCHELL  Girls.   This is Mrs. Vaughan.   Your  supervisor.   She’ll show you how things  work.  Dorothy looks over her new employees.  DOROTHY  Ladies...better roll those sleeves up.  This here is manual labor.  TRACKING CONTROL ROOM - CONTINUOUS  A celebration.   Engineers hug each other.   Cigars are lit.  Somewhere champagne pops.   Harrison walks over to Katherine.  AL HARRISON  Nice work, Katherine.  He offers her his hand.   They shake.  KATHERINE  You too, Mr. Harrison.  Hidden   Figures   -   5/9/2016   -   Shooting   Draft   -   120   .  (CONTINUED)",
      "characters": [],
      "action_text": "He smiles, for the first time.   Ever.   Underneath it  all...Harrison’s a kid:  AL HARRISON  You think we can get to the moon?  Katherine nods, with all the certainty in the world:  KATHERINE  We’re already there, sir.  Titles over:   “In 1962 Katherine Johnson became a permanent  member of the Space Task Group.   She went on to perform the  calculations for Armstrong, Aldrin and Collins’s,   Apollo 11  flight to the moon.   A year later, her backup calculations  proved critical to the successful effort to rescue the  astronauts in the damaged   Apollo 13   spacecraft.   In 2015,  Katherine was awarded the Presidential Medal of Freedom.  INT. SPACE TASK GROUP - A YEAR LATER  The Space Task Group is all but empty.   Katherine finishes  typing a report: “Notes on Space Technology” by, Paul  Stafford...and...Katherine Johnson.   She pulls the cover page  out of the typewriter, sets it on top of the rest of the  manuscript.  Stafford walks over, puts a cup of coffee on Katherine’s  desk.   Picks up the report.   He walks off.  Katherine sips her coffee.   Another day at work.  FADE OUT.  The end.   *  Hidden   Figures   -   5/9/2016   -   Shooting   Draft   -   121   .  CONTINUED:",
      "dialogue_count": 0,
      "word_count": 433
    }
  ]
}