{
  "slug": "his-dark-materials-101-lyras-jordan-2019",
  "title": "his dark materials 101 lyras jordan",
  "genre": "action",
  "format": "series",
  "scenes_count": 10,
  "characters_count": 0,
  "characters": [],
  "total_words": 11604,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. QUAD. JORDAN COLLEGE - NIGHT 1 1   1 Title: “Jordan College, Oxford.” Title: “Twelve years ago.” It’s raining. We’re close on some pitch black water. We pick out gargoyles of medieval figures with their animal daemons wrapped around them. We hear the noise of whirring rotors and then lights start dancing on the drowned world. A GYROCOPTER sets down on floats, dispersing the flood water. A door to the gyrocopter opens and a SNOW LEOPARD dives into the water. We travel with her, deep in the dark murk, as she swims. This is STELMARIA. A man follows. We pull back to see ASRIEL, bearded, tired, glorious, with a BABY carefully held in his coat. He has the intense eyes of his leopard daemon. ASRIEL looks around. STELMARIA does the same, they always look in opposite arcs. Both stand perfectly still for a moment. Listening. Then they wade on. ASRIEL bangs on a large door set between two elegant windows. There’s a silence. ASRIEL bangs again. ASRIEL Open the door. There’s the sound of bolts being unlocked. The door is pulled open, the water sluices through and light is showered onto the quad. A BUTLER, elderly, elegant, looks out into the night. ASRIEL (CONT’D) Lower your bloody lamp. ASRIEL enters and quickly pounds up a staircase. INT. MASTER’S LODGING. JORDAN COLLEGE - NIGHT 1 2   2 STELMARIA is the first to look into the room. He scopes it quickly and then returns to the fast approaching ASRIEL. STELMARIA It’s safe. ALICIA, a raven, flies at them as they enter - but flies up when she sees who it is, and replacing her in shot is THE MASTER, a grey, anxious and yet imperious man. MILTON - EP 1 SHOOTING SCRIPT PINK REVS 13.06.18   1.",
      "characters": [],
      "action_text": "THE MASTER What in the world - ASRIEL puts the baby in THE MASTER’s arms. ASRIEL This is Lyra. THE MASTER Asriel.... ASRIEL Secundum legem de refugio scholasticorum - THE MASTER Scholastic sanctuary? You can’t be serious. ASRIEL - protectionem tegimentumque huius collegii pro hac puella Lyra nomine reposco. ASRIEL, relieved to have said his piece, looks at the THE MASTER - and quickly corrects how he’s holding the child. ASRIEL (CONT’D) Out there she’s in danger, Francis. THE MASTER Jordan College is a place of learning, it’s not suitable for a child - ASRIEL And this is hers... ASRIEL takes an alethiometer from a black velvet bag and places it upon the Master’s study table. THE MASTER looks at it, astonished and distracted. THE MASTER An alethiometer? ASRIEL uses this distraction to make good his exit. ASRIEL I’ve no choice. Keep her safe. THE MASTER looks down at the baby. The baby LYRA and her tiny pine marten daemon, PANTALAIMON. PANTALAIMON chirps up at THE MASTER and then the baby starts to cry. We close on her face. MILTON - EP 1 SHOOTING SCRIPT PINK REVS 13.06.18   2. His Dark Materials. Episode One. Roger.  EXT. PORT MEADOW - DAY 2 3   3 And then we cut to another face. And there’s something about the eyes, or the face shape that tells us that maybe this is the same child. She’s now 13, puckish and fierce. Beside LYRA is an adult pine marten, PANTALAIMON. She lights a match and holds it above her head. Next to her is 12-year old ROGER, anxious and kind. His daemon SALCILIA, a ferret. ROGER What are you doing? LYRA Wind’s north-easterly, which means favour your right side. ROGER Lyra, are you sure? With these Gobblers about... LYRA You said Gobblers are a myth. ROGER I said that yesterday, when we were safe in college. We cut to their POV: a 7-year-old boy, BILLY COSTA, jittery and decent, sits whittling wood beside his squirrel daemon, RATTER, in the last of the sun. Another 15-year-old, TONY COSTA, restless and driven, is on a large Gyptian boat moored amo",
      "dialogue_count": 0,
      "word_count": 4194
    },
    {
      "scene_number": 2,
      "slugline": "INT. RETIRING ROOM PANELS. JORDAN COLLEGE - EVENING 2 19   19 But most engaged of all is LYRA, who moves closer to get a better angle. ASRIEL (O.S.) This is the first of the discoveries I made... Again, the panels creak. This time one or two of the fellows look toward the heating unit, irritated. PANTALAIMON If you move again, they will find us. LYRA I need to see what he’s showing them. PANTALAIMON That is not our job. ASRIEL loads a picture into the projector. It shows a dark wooden hut in the middle distance, in front of it a MAN in furs - his hand raised in greeting - and to one side of him a smaller figure. INT. RETIRING ROOM. JORDAN COLLEGE - EVENING 2 20   20 ASRIEL This photogram was taken with a standard silver nitrate emulsion. But I took two pictures that day... ASRIEL loads a second photo, the picture is darker now, and in the centre of it the MAN has altogether changed - he’s bathed in light and a fountain of glowing particles appears to be streaming from his hand. CHAPLAIN That light, is it going up or coming down? ASRIEL It’s coming down, but it isn’t light. It’s Dust. There’s sudden incredulity among the gathered fellows. They know how dangerous talk of Dust is. FELLOWS But how -/Surely -/It can’t. ASRIEL, pleased by the response, glances over at LYRA’s hiding place. MILTON - EP 1 SHOOTING SCRIPT PINK REVS 13.06.18   18.",
      "characters": [],
      "action_text": "ASRIEL It’s Dust. It registered as light on the plate because particles of Dust affect this emulsion as photons affect the silver nitrate emulsion. As you see, the figure of the man is perfectly visible. Now I’d like you to look at the shape to his left. The figure that seems almost to have merged into the darkness. THE MASTER That’s not the man’s daemon? ASRIEL No, that shape you can dimly see is a child. CHARLES A severed child - ? The fellows wince and shake their heads. ASRIEL An entire child. Which, given the nature of Dust, is precisely the point, is it not? He makes clear eye contact with THE MASTER - both are aware how dangerous this is. ASRIEL (CONT’D) We - as adults - are surrounded by Dust. In fact, we’re almost consumed by it. But children - they’re not. Or barely at all. Gentleman, I believe this is proof Dust is exclusively attracted to adults. THE MASTER Asriel, be very careful. ASRIEL And this is where it gets really interesting... One of Grumman’s last messages to the Academy in Berlin spoke of a certain natural phenomenon only seen in the lands of the North. I believe this is what he was referring to - He changes the slide, the next picture is of a small group of tents dimly outlined against a vast horizon of colour. It is the Aurora. MILTON - EP 1 SHOOTING SCRIPT PINK REVS 13.06.18   19. CHAPLAIN The Aurora. The Northern Lights. ASRIEL Yes, when seen with the ordinary emulsion. Now I’d like you to look at it taken with the special emulsion. INT. RETIRING ROOM PANELS. JORDAN COLLEGE - EVENING 2 21   21 We watch with LYRA as she determinedly peers at the picture. Beyond the Aurora, in the sky, is the unmistakable outline of a city: towers, domes, walls, buildings. All the fellows are amazed. She looks at PANTALAIMON, an ermine now, staring out just as intently as her. INT. RETIRING ROOM. JORDAN COLLEGE - EVENING 2 22   22 CHAPLAIN That looks like - a city. ASRIEL It does, doesn’t it? A city in the sky. CHAPLAIN Is this the Barnard-Stokes other world",
      "dialogue_count": 0,
      "word_count": 1163
    },
    {
      "scene_number": 3,
      "slugline": "INT. LYRA’S ROOM. JORDAN COLLEGE - NIGHT 2 28   28 ASRIEL gently places LYRA on her bed, we realise (but he does not) she’s awake. LYRA pretends to stay asleep as he carefully removes her shoes and puts blankets over her. He thinks a moment and then he makes to leave. PANTALAIMON raises a sleepy head and LYRA stirs. LYRA Did they vote to give you the money? ASRIEL smiles. ASRIEL Now you wake up. Yes. They did. He makes to leave again. LYRA What’s Dust? ASRIEL Nothing to do with you. LYRA It   is   to do with me. You told me to spy for you, so now you have to tell me what I was spying about. ASRIEL There are some things you are better not understanding yet. LYRA doesn’t like that answer, but she nods. LYRA Can I see the man’s head? ASRIEL Why would I let you do that? LYRA thinks. LYRA You were right. The Master. He didn’t like what you were saying. Don’t trust him. ASRIEL I don’t trust anyone. Go to sleep Lyra. ASRIEL stands looking at her for a moment more, something approaching affection on his face, and then he dismisses all thoughts and leaves the room. LYRA is left. MILTON - EP 1 SHOOTING SCRIPT PINK REVS 13.06.18   23.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 218
    },
    {
      "scene_number": 4,
      "slugline": "EXT. MASTER’S LODGING. JORDAN COLLEGE - NIGHT 2 29   29 A match flares and a lamp is lit. THE MASTER and CHARLES are in the drawing room of his lodgings. INT. MASTER’S LODGING. JORDAN COLLEGE - NIGHT 2 30   30 The MASTER stands looking drained at the window. THE MASTER Of course he knew, I have no idea how, but he knew, and he spilled the decanter himself. CHARLES One of his spies? ALICIA perches on THE MASTER’S shoulder watching CHARLES or SERENA for the slightest movement, neither flinch. And then SERENA licks her own eyeball to stay cool. THE MASTER That got into a locked room before he entered it? CHARLES Forgive me, Master, but I can’t help being relieved. I was never happy about the idea. Of murder. THE MASTER You think that’s what I wanted? This is what I came from New Denmark for? Not for academia but poisoning? CHARLES I - know it’s not a decision you’d have taken lightly. THE MASTER hesitates, he looks at CHARLES. He pours a decanter of brantwijn. Beside the decanter we pick out the alethiometer and the Book of Everything. THE MASTER The alethiometer warns of appalling consequences if Lord Asriel continues his research. Apart from anything else, the child will be drawn in and - CHARLES Lyra? This is about Lyra? But she’s just an innocent girl - MILTON - EP 1 SHOOTING SCRIPT PINK REVS 13.06.18   24.",
      "characters": [],
      "action_text": "THE MASTER And she needs to stay one. Which has meant making sure this college was unimpeachable. But there is little chance that tonight’s hotbed of heresy will not get back to them. CHARLES You’re saying we have to let her go? THE MASTER The alethiometer says Lyra has to make a journey. CHARLES What kind of journey? THE MASTER One which, I’m afraid, includes - a great betrayal. CHARLES Who’s going to betray her? Asriel? THE MASTER That’s the saddest thing, she will be the betrayer. CHARLES looks up, shocked. CHARLES We can keep her here. We must. THE MASTER downs the brantwijn, he looks at his friend with tired eyes. THE MASTER No. All we can be is scared for her. And scared of her. INT. LYRA’S ROOM. JORDAN COLLEGE - DAY 3 31   31 Light creeps in through her curtains. LYRA stirs. She turns over. PANTALAIMON nestles into her. An ermine. Her nose twitches as PANTALAIMON’s tail brushes against her face. LYRA Pan... PANTALAIMON pulls his tail in. LYRA settles back to sleep. There’s a cough. MILTON - EP 1 SHOOTING SCRIPT PINK REVS 13.06.18   25. LYRA looks up, the cough is coming from within the room. PANTALAIMON immediately turns into a growling dog. He yelps in protective alarm. LYRA twists to see ROGER sitting in the corner of the room. LYRA (CONT’D) Roger? ROGER Didn’t want to wake you ‘case you’d had a late night. LYRA So you thought instead you’d just sit in the corner of my room. ROGER Door weren’t locked. LYRA You’re a bit creepy you know that? LYRA starts to put on her shoes. ROGER Two bits of news you need to know, one, Billy Costa’s gone missing, word is the Gobblers got him. LYRA looks up, shocked. ROGER (CONT’D) So from now on we stick in the college and only the college. Please, Lyra. LYRA What’s the second bit of news? ROGER Your uncle’s loading up an airship, he’s about to fly. LYRA looks at him and then thrusts her bed covers off. LYRA You should have woken me. EXT. COLLEGE GARDENS. JORDAN COLLEGE - DAY 3 32   32 LYRA runs hard across the college garde",
      "dialogue_count": 0,
      "word_count": 647
    },
    {
      "scene_number": 5,
      "slugline": "EXT. FIELD. OXFORD - DAY 3 33   33 Ahead of LYRA an AIRSHIP sits, with lots of people loading supplies and scientific instruments. She pushes past, looking for one man. And then she sees him, supervising the stowing of his camera equipment. LYRA You’re not leaving. ASRIEL looks up. PANTALAIMON wraps himself around LYRA’s throat protectively as an ermine. ASRIEL Unfortunately I have to, the Magisterium will know everything by now. LYRA So you’re leaving me? You’re leaving me with a murderer? ASRIEL The Master would never hurt you. LYRA No. No. You’re not - She pulls some equipment from his hand. He pulls it back. ASRIEL Dirty fingernails. Don’t they make you wash in this place. LYRA The librarian’s fingernails are always dirtier than mine. ASRIEL Charles is a learned man. What’s your excuse? LYRA My uncle shut me in a wall! ASRIEL yanks the equipment from her. ASRIEL Study hard, Lyra. Try to learn something. I’ll see you when I next come through. MILTON - EP 1 SHOOTING SCRIPT PINK REVS 13.06.18   27.",
      "characters": [],
      "action_text": "LYRA I once found a rook on the Library roof. It had a hurt foot. I was going to kill it and roast it but Roger said we should help it get better. So we gave it scraps of food and some wine and then it got better and flew away. ASRIEL I’m presuming this fiction has a moral? LYRA (this is hard for her) Kindness... leads to people - things - rooks - getting better. If you just could be, occasionally - ASRIEL looks at her a moment more, as if analysing her. Then he swallows and turns away. ASRIEL I’m sorry, I just don’t have time for you right now. LYRA You could take me with you, then we’d have lots of time. ASRIEL The North is no place for a child. LYRA looks at him, she knows she can’t win. LYRA Does this look like it? The airship my parents died in? ASRIEL No. That was smaller. LYRA looks at him a second more, he doesn’t wilt, he stays full of steel. She walks hard away. ROGER and ASRIEL remain. ROGER She’s better than you think she is. She’s - special. ASRIEL looks at him for a moment. ASRIEL Oh, everyone’s special. ASRIEL looks out to watch LYRA walk away. His face betrays him for a moment, but then he turns away. MILTON - EP 1 SHOOTING SCRIPT PINK REVS 13.06.18   28.",
      "dialogue_count": 0,
      "word_count": 411
    },
    {
      "scene_number": 6,
      "slugline": "INT. CLOISTERS. JORDAN COLLEGE - DAY 3 34   34 LYRA is upset and very anxious not to show it, she clutches the ermine PANTALAIMON to her. ROGER trots after her. His daemon a dog. ROGER Lyra... Lyra... will you wait? But LYRA is not for waiting, she turns left and then right. And then she opens a door, and she starts to descend down some stairs. INT. WINE CELLAR. JORDAN COLLEGE - DAY 3 35   35 ROGER runs past wine racks that span the length of the room. ROGER Lyra... Lyra... ROGER tries to follow her footsteps. SALCILIA sniffing out her trail. He doesn’t like the dark much, he doesn’t like the cellars much, he doesn’t like running much, he doesn’t like any of this much, but he ploughs on regardless. Suddenly, he sees light, he picks up his pace. INT. CRYPT. JORDAN COLLEGE - DAY 3 36   36 LYRA sits on the edge of a series of coffins. ROGER enters and slows to a stop.   Neither say anything for a moment. ROGER carefully walks over, and is surprised to see the coffins are open. ROGER These coffins’ve got skeletons in ‘em! LYRA All coffins have got skeletons in them Roger, it’s sorta the point. ROGER But I can see these skeletons. We pick out SALCILIA and PANTALAIMON for a moment nearby, a dog and a cat playing affably in the corner. LYRA Not all of them. Only the ones with the open caskets. Makes you think what’s behind the ones that are closed, doesn’t it? MILTON - EP 1 SHOOTING SCRIPT PINK REVS 13.06.18   29.",
      "characters": [],
      "action_text": "ROGER I wasn’t thinking that, no. LYRA smiles as ROGER shivers. And then he looks at her and reluctantly smiles. ROGER inspects the coffins. They’re all marked with dates and an engraving of their daemons. LYRA Who do you think these were when they were alive? Probably Scholars, I reckon. Or the coffins are Masters, and the Scholars just get one of these skulls. LYRA indicates the shelves around the room. ROGER takes a step back, as he sees row upon row of skulls staring at him. LYRA picks one of them up. ROGER What you doing? You en’t supposed to touch ‘em. A coin drops out of the bottom of the skull. ROGER (CONT’D) Oh no, you’ve broken it. LYRA bends and picks up the coin. ROGER (CONT’D) A coin - might be treasure? LYRA It’s like the ones on the coffins. It’s his daemon. Must be. She takes the coin out, examines it. LYRA (CONT’D) A chaffinch. Must have been a dreamer. ROGER You think at all? Bout what yer Pan will settle as? LYRA carefully replaces the skull and the coin. LYRA Yeah. I think about it. Pan and I talk about it. Pan thinks he’ll be a lion - PANTALAIMON I don’t. MILTON - EP 1 SHOOTING SCRIPT PINK REVS 13.06.18   30. LYRA I think he’ll be a vulture. Or a screech owl. PANTALAIMON You think I’ll be a fox. LYRA And you? What do you think Salcilia will be? ROGER Oh, a house marten or a house cat? LYRA Something to do with houses then? ROGER Maybe if Pan is a fox, Salcilia will be a vixen. There’s a silence. ROGER knows he’s said something quite bold. He rubs his nose. ROGER (CONT’D) Or a badger. Or a mole. I think Salcilia could be a happy mole. He looks at LYRA, who nods, anxious for this not to be horrible for him. LYRA Then let’s drink on that. She pulls out a twisted green bottle - it’s open. ROGER Lyra! LYRA What? Weren’t gonna run past all that wine and not take a bottle! To foxes and vixens! She drinks from it, winces, and then takes a longer slug. She laughs and surreptitiously spits the wine out. As she does, PANTALAIMON changes shape four times, t",
      "dialogue_count": 0,
      "word_count": 1089
    },
    {
      "scene_number": 7,
      "slugline": "INT. DINING HALL. JORDAN COLLEGE - DAY 3 38   38 There is a bang on a gong. THE MASTER Benedic, Domine, nos et dona tua, quae de largitate tua sumus sumpturi, et concede, ut illis salubriter nutriti tibi debitum obsequium praestare valeamus, per Christum Dominum nostrum. LYRA is standing, PANTALAIMON an ermine beside her. She looks across the room and sees ROGER, in uniform. They both mouth the words along with THE MASTER. They smile. And then she sits, along with the FELLOWS and SCHOLARS. She turns to her left and is surprised to see a GOLDEN MONKEY beside her, staring up at a portrait of a MASTER and his daemon. MRS COULTER (O.S.) Now I’m not used to the grandeur of this at all. LYRA turns around to MRS COULTER, who holds out an arm for the GOLDEN MONKEY to climb onto her shoulder. He looks around, spying the room. When he’s looked in every direction, she sits. LYRA Oh. Hello. MRS COULTER You’ll have to show me what knife and fork to use. I don’t want to make a fool of myself. PANTALAIMON makes careful eyes with THE GOLDEN MONKEY, working him out. He descends onto LYRA’s lap. LYRA Are you - a female scholar? MRS COULTER You seem surprised. LYRA Female scholars don’t dress like you. MRS COULTER laughs. The GOLDEN MONKEY climbs under the table. MILTON - EP 1 SHOOTING SCRIPT PINK REVS 13.06.18   34.",
      "characters": [],
      "action_text": "MRS COULTER I’ll take that as a compliment. (beat) Not really, I’m a member of St Sophia’s college, but most of my work takes place outside Oxford. ROGER comes past with a water jug, he fills LYRA’s glass, she doesn’t notice him. He trudges on. MRS COULTER (CONT’D) But I’m not interesting, you are. Tell me about yourself, Lyra. LYRA Nothing to say! MRS COULTER So reports that you stole a Gyptian barge are completely false, are they? LYRA laughs. LYRA How did you hear about that? ROGER turns back to see LYRA absolutely absorbed in the glittering warmth of MRS COULTER. EXT. RIVERBANK. OXFORD - EVENING 3 39   39 There’s a muster of boats on the water. Ropes are being untied, ready for use. The gyptians are making to leave. MA COSTA charges through it, her face wild. She sees FARDER CORAM, she heads hard towards him. MA COSTA Readying the boats? You think we’re leaving Farder Coram? My son is still out there. A big man with a bull neck turns around, he has a regal air, and a fighter’s physique. This is JOHN FAA. JOHN FAA Farder Coram’s done nothing, I’m halting the search. At the sight of JOHN FAA, MA COSTA drops to her knees. JAL joins her on the floor. JOHN FAA pulls her up. JOHN FAA (CONT’D) No need for that Ma Costa. MILTON - EP 1 SHOOTING SCRIPT PINK REVS 13.06.18   35. JOHN FAA’s crow daemon, BERENICE, comes to rest on his forearm. She looks at JAL wistfully. MA COSTA Then I can speak free - you may be the Western King - but my son is worth more time than - JOHN FAA (interrupting) The children call them Gobblers. MA COSTA There’s nothing saying he’s with them. There’s nothing saying they even exist. SOPHONAX approaches JAL and sits by him, loyally. JOHN FAA Billy’s a good boy. He’s strong because you’ve been a strong and good mother to him, Maggie. And if he could, he’d have found his way back to us. But he hasn’t. MA COSTA He’s just lost his way and he needs us to find him. JOHN FAA They’ve taken sixteen of our children so far, and that number keeps growing. Sear",
      "dialogue_count": 0,
      "word_count": 1339
    },
    {
      "scene_number": 8,
      "slugline": "EXT. MA COSTA’S BOAT - DUSK 3 41   41 MA COSTA is sitting with a glass of spirits in front of her. She hears a noise, JAL turns, JOHN FAA is standing at the side of the boat. She nods, and he climbs on board. JOHN FAA It’s changed since I knew it. MA COSTA It’s been a long time since. That’s a barb and he knows it. JOHN FAA We’re not giving up Maggie. She looks up at him bitterly. TONY COSTA comes out of the boat. JOHN FAA (CONT’D) We’re going to London and then we’re - TONY COSTA Going to fight the Gobblers aren’t we? JOHN FAA looks at TONY COSTA, interested. TONY COSTA (CONT’D) I’d play my part. MA COSTA You will not. JOHN FAA If we can find anything to fight, yes, we’ll fight those Gobblers. And that’s how we’ll get your son back Maggie. EXT. ROOFTOPS. JORDAN COLLEGE - DUSK 3 42   42 LYRA is looking at ROGER, outraged. PANTALAIMON, a cat at her feet, sniffs at SALCILIA as a ferret. LYRA But you got to. He looks back, full of consternation. ROGER Lyra, don’t do this - MILTON - EP 1 SHOOTING SCRIPT PINK REVS 13.06.18   40.",
      "characters": [],
      "action_text": "LYRA London Roger, and after London - the North. ROGER And I knew you wanted to get there eventually - but... until eventually - I thought you’d be happy here. LYRA I’m not and you’re not either. ROGER Of course I am! This place is great! We got the claybeds, and the river, and the gardens and the college and the - so much - and - LYRA But I’ve seen all of that. You’re really telling me you don’t want to come? ROGER’s face tells her all she needs to know. ROGER The thing is - the Gobblers are in London they say and - LYRA You’re just scared Roger, scared to leave your cosy little life and - ROGER This is our home. LYRA Stay here then. Become like all the servants - Salcilia will become a dog and you’ll maybe rise as high as butler and - PANTALAIMON hisses, LYRA turns to him, he walks away from her, disappointed. ROGER wipes a tear from his eye. LYRA sees his heartbreak and PANTALAIMON’s disapproval and stops herself. But she doesn’t retreat. LYRA (CONT’D) You’ll realise - first thing tomorrow I’ll find you outside my room and you’ll say let’s go together. You will. MILTON - EP 1 SHOOTING SCRIPT PINK REVS 13.06.18   41. ROGER Or you’ll realise you’re not as ready as yer think you are. You talk a big game Lyra, but deep down, I know you’re just as scared as I am. SALCILIA turns into a bird who flies up defiantly at LYRA’s face. LYRA faces her down, but there’s a hesitation. LYRA See you tomorrow. She stalks away. INT. LYRA’S ROOM. JORDAN COLLEGE - NIGHT 3 43   43 LYRA shuts the door with a hearty bang. Then she looks around her room. PANTALAIMON turns into a cat. LYRA First thing in the morning. He’ll be here and then we’ll - go with her - (hesitating) - we will. PANTALAIMON knows the hesitation she won’t admit to. LYRA starts to take down her pictures and posters. LYRA (CONT’D) This can’t be our home anymore, and my Uncle never comes here, so... so let’s try something new. She looks at PANTALAIMON. LYRA (CONT’D) Our lives have just changed for the better Pan and Roge",
      "dialogue_count": 0,
      "word_count": 1583
    },
    {
      "scene_number": 9,
      "slugline": "EXT. ROOFTOPS. JORDAN COLLEGE - DAY 4 51A   51A LYRA searches across the rooftop. Looking desperately down onto the college quads. LYRA But where is he? INT. CRYPT. JORDAN COLLEGE - DAY 4 52   52 LYRA runs through the crypt. PANTALAIMON flies, still as a falcon above her. She’s trying not to show how scared she is. LYRA Roger? You down here? Don’t pretend you like it here now. She stops by the skulls. She thinks, and then resets the coins in the right order. She stops - for a moment of pure atonement. LYRA (CONT’D) Sorry. She hesitates a moment more and then runs on. EXT. QUAD. JORDAN COLLEGE - DAY 4 53   53 LYRA looks left and right, the panic now clear. LYRA They’ve got him, haven’t they, Pan? PANTALAIMON, a falcon above her, flies anxiously. EXT. ENTRANCE. JORDAN COLLEGE - DAY 4 54   54 LYRA looks out of the college entrance. LYRA Roger? ROGER! ROGER! Her shouts echo down the streets. MRS COULTER Oh good. I thought for a moment you weren’t coming... LYRA looks at her, bewildered. MRS COULTER (CONT’D) The airship. MILTON - EP 1 SHOOTING SCRIPT PINK REVS 13.06.18   47.",
      "characters": [],
      "action_text": "LYRA They’ve got Roger. The Gobblers have got him. I know they have. MRS COULTER bends beside LYRA. She takes out her handkerchief and gently dries LYRA’s eyes. MRS COULTER Then you need to come with me - now. LYRA Now? MRS COULTER The Gobblers are in London, as everyone knows. With my connections you may stand a chance of getting him back. LYRA looks at her, panicked. LYRA But I haven’t packed, I haven’t said goodbye... MRS COULTER You’ve got all you need. Come now, we already risk missing our flight. MRS COULTER turns and walks, expecting LYRA to follow. PANTALAIMON Lyra - LYRA Pan, you heard her? We’ve no choice. LYRA starts to walk, but PANTALAIMON is revealed as a monkey digging his paws into the ground. He doesn’t move. LYRA keeps walking. LYRA (CONT’D) Stop that. PANTALAIMON resists following her, she yells out in pain. LYRA (CONT’D) You’re hurting me. PANTALAIMON looks at her. PANTALAIMON I’m hurting both of us. Lyra, the Master - MILTON - EP 1 SHOOTING SCRIPT PINK REVS 13.06.18   48. LYRA And why would we trust him? He tried to poison my Uncle, remember? PANTALAIMON (with finality) Roger said we weren’t ready and I don’t think we are. LYRA looks at her daemon soulfully. LYRA Roger’s gone. We’ve no other choice. PANTALAIMON looks up at her tearfully and nods. He runs to her, changing into an ermine as he jumps into her arms. They both cry. LYRA (CONT’D) It hurt so much when you were pulling away from me. PANTALAIMON I know. I know. I just - LYRA I know. And I’m scared too. EXT. CUSTOMS HOUSE. LONDON - DAY 4 54A   54A ROGER is hauled by two MEN into a broken-down looking building. INT. CUSTOMS HOUSE. LONDON - DAY 4 55   55 ROGER is deposited in a warehouse and the door is locked behind him. He looks around at the glassy-eyed kids, it’s warm and glowing in the room but something is - wrong. BILLY COSTA (O.S.) Roger? ROGER looks up, and so does SALCILIA, now a ferret. She runs up ROGER’s leg and into his arms. ROGER Billy? Billy Costa? BILLY looks lost, RATTER ",
      "dialogue_count": 0,
      "word_count": 597
    },
    {
      "scene_number": 10,
      "slugline": "EXT. FIELD / AIRSHIP. OXFORD - DAY 4 56   56 An airship stands waiting on the grass. LYRA walks towards it, pulls back... and then steels herself and walks forward. INT. PASSENGER AIRSHIP - DAY 4 57   57 MRS COULTER looks around herself, and then takes some papers out of her bag. She begins to read and notate. LYRA takes an uneasy seat opposite her, PANTALAIMON a mouse. LYRA So where do we start looking for Roger - MRS COULTER Lyra, airships aren’t safe places to talk. LYRA But we need to - The GOLDEN MONKEY looks around the airship anxiously, at a CONDUCTOR and a small group of professionally-dressed PASSENGERS. MRS COULTER We’re together now Lyra. We’ll have plenty of time to discuss whatever you wish. A bit of quiet now will be best. Beat. LYRA looks up, as if suddenly unsure. MRS COULTER (CONT’D) I am pleased you’re coming with me though. I think it’s the right decision for both of us. LYRA I’ve never been in an airship before. My parents died in - MRS COULTER I heard. But that was a long time ago. Technology has vastly improved. Beat. She looks up at LYRA. MRS COULTER (CONT’D) You’ll be safe now. LYRA looks down at the gleaming steeples and spires. She looks, surprised, at a pattern of boats leaving Oxford. MILTON - EP 1 SHOOTING SCRIPT PINK REVS 13.06.18   50.",
      "characters": [],
      "action_text": "LYRA The Gyptians. They’re leaving too. But MRS COULTER doesn’t look up, she stays immersed in her paperwork. LYRA nods, accepting the rebuke. EXT. RIVER - DAY 4 58   58 A flotilla of boats make their way down the river. JOHN FAA’s boat leads, and he stands at the prow, looking concerned. INT. PASSENGER AIRSHIP - DAY 4 59   59 PANTALAIMON, a mouse, nibbles LYRA’s ear. LYRA turns from the gyptians, reaches up and strokes PANTALAIMON’s back. And then she looks down at the alethiometer, just visible in her pocket. She thinks. She looks up, she sees MRS COULTER looking at her. Interested by the decision they’ve both made. LYRA pushes the alethiometer further into her pocket. CREDITS. MILTON - EP 1 SHOOTING SCRIPT PINK REVS 13.06.18   51.",
      "dialogue_count": 0,
      "word_count": 363
    }
  ]
}