{
  "slug": "hold-the-dark-2018",
  "title": "hold the dark",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 23,
  "characters_count": 0,
  "characters": [],
  "total_words": 23698,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. MAIN ROOM - CORE’S HOME - NIGHT A PAINTING OF A WOLF, an amateur work. From O.S., we hear a MAN, apparently leaving a voicemail message... MAN’S VOICE (O.S.) Hi, sweetheart. Uh. It’s me. Again. There are in fact several WOLF PAINTINGS here. Dozens. Different angles and settings but...the same animal? MAN’S VOICE (O.S.) (CONT’D) I’d heard you got Associates, huh? I read that,   Northern Light   had a blurb on it. Tenure committee gets one right, at last. Heh. I’m uh...I am so proud of you. We drift over the DESK and COMPUTER, BOOKS and PAPERS hoarded neatly. Titles like   Canis Lupus Migration Study ,   American Nature Journal ,   Arctic Grey In Decline.   An academic’s lair. MAN’S VOICE (O.S.) (CONT’D) I know you’re busy, but...I hope we’ll talk sometime. You can call whenever. I hope uh... Here’s a PHOTO OF A YOUNG BEARDED MAN in muddy camping gear, grinning hugely, a caption on it:   Yellowstone, 1979 . MAN’S VOICE   (O.S.) (CONT’D) Anyway. I’m going to see your mother tomorrow. She sends her love. We find him in his overstuffed recliner, the TV muted, his microwave dinner on a tray. His name is RUSSELL CORE (50s), the guy from the photo. But there’s silver in his hair now, more in his beard. This is a tired man. He carries ghosts. CORE And...so do I. He holds the phone to his ear a beat longer...and hangs up. Aims the remote, turns up the news a bit:   Iraq, circa 2004.  TV NEWS VOICE ... while   Coalition   forces   advanced   on   the town   of   Falujah   under   heavy   fire. .. But Core isn’t really watching, is he?  3.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 274
    },
    {
      "scene_number": 2,
      "slugline": "INT. BATHROOM - NIGHT Core sits in the steaming bathtub, the water to his chin. Staring at something. Grimly contemplating it. A RAZOR BLADE. Resting there on the edge of the tub. Waiting. He stares. Takes a deep breath for courage. Or maybe defeat. And reaches for the blade... His dripping hand hovers over it in sudden indecision. The moment extends. Until... He retracts his hand after all. Leaves the razor there. Exhales and looks away. EXT. REST HOME - WALLOWA, OREGON - DAY It’s bright and sunny. Not the cold-diamond sunshine of Keelut but sunshine with some actual warmth. Trees are green. CORE’S COMPACT CAR pulls up, parks, and he heads inside. INT. RECEPTION HALLWAY - REST HOME - DAY As Core passes the Christmas-decorated DESK, the young NURSE in a Santa hat gives him a small, sweet smile. CORE Hi, Kelly. NURSE Hi, Mr. Core. She’s having a good day. He smiles back, as best he’s able. INT. CORE’S WIFE’S ROOM - REST HOME - DAY A WOMAN’S HAND, gnarled into a frozen claw on a hospital bed. It’s CORE’S WIFE, her mouth agape, eyes clamped shut to give the impression that she’s perpetually   moaning . But she’s not, of course, she’s been paralyzed and unconscious for years. Core sits bedside her, reading a novel. He bites a candy cane, the   crunch!   like a bone breaking in this quiet room. A soft, involuntary glottal noise gurgles in his Wife’s throat. He looks up at her for a long beat but, when no other sound comes, he returns to his book.  4.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 264
    },
    {
      "scene_number": 3,
      "slugline": "INT. FOYER - CORE’S HOME - DAY THE PILE OF MAIL on the welcome mat is pushed aside as the front door opens and Core’s LIGHTWEIGHT HIKING BOOTS step in. He hangs up his windbreaker, drops his keys, bends with a grunt to collect the mail, pausing then to look at his-- ANSWERING MACHINE, with ‘ 0 ’ messages waiting for him. Which is deeply disappointing. INT. MAIN ROOM - DAY Core settles into his recliner, thumbing idly through the mail until...this one LETTER in particular.  KEELUT, AK , reads the return address. A childlike scrawl. Confused, he opens it, unfolds the single page, begins to read. And the color drains from his face. MACRO ON THE LETTER, we’re reading it, ‘ DEAR MR. CORE, THREE DAYS AGO MY SON BAILEY WAS TAKEN BY WOLVES ’ even as we hear-- MEDORA (V.O.)  Dear Mr. Core, Three days ago my son Bailey was taken by wolves.  He reads, horribly spellbound... MEDORA (V.O.)  This happened twice already here. I tried to track them but could not. No one in the village will hunt them. I am alone here now. I have read your book. I know you have done this before. In my heart, I know that you are able to do it now. I do not expect you to find my son alive. But you could find his bones and maybe slaughter the wolf that took him. My husband will come home from the war soon. I must have something to show him. I can’t just have nothing. I know you have sympathy for this animal. Please don’t. Come and kill it to help me. My son’s bones are in the snow.  He sits there, surrounded by all those paintings.  5.",
      "characters": [],
      "action_text": "MEDORA (V.O.)  Sincerely yours, Medora Slone.  A stunned, silent beat. He refolds the letter, sets it aside. And looks away. INT. BATHROOM - DAY CORE’S HANDS, scrubbing vigorously under the sink. IN THE MIRROR, Core blots his brow, finds his own anxious eyes for a moment. Takes a deep breath and then, oddly... A MAN with luggage passes behind him. Oh. He’s not at home. INT. PORTLAND AIRPORT - DAY Core emerges from the MEN’S ROOM with his small rolling suitcase, heads towards the bustling CHECK-IN COUNTER. INT. SMALL AIRLINER - NIGHT JET NOISE drowns everything as we find Core in a window seat, dozing. His eyes slit open and, vaguely disoriented, he gazes out at the dreamy purple sky. And he’s holding MEDORA’S LETTER, folded into quarters. DISSOLVE TO: INT. AIRPORT - NIGHT Core moves through this minor almost-empty hub, passing some HUNTERS headed the other way. INT. CAR RENTAL DESK - AIRPORT - NIGHT Core fills out paperwork as the sullen CLERK provides keys. CORE Four wheel drive? CLERK (’ of course ’) Yessir. CORE And uh...GPS?  6. CLERK Where you headed? CORE Keelut. CLERK GPS won’t work out there. Here... (passing him a MAP) ...this one the more accurate ones. Core regards the map and... EXT. ROAD OUT OF TOWN - DAWN CORE’S RENTAL SUV drives away on a salt-crusted strip of road that runs to infinity, brown-white tundras spreading to either side. The sky is an ominous golden-pink, like a great inverted bowl refracting weird light. The truck grows small beneath it. INT./EXT. RENTAL SUV - REMOTE ALASKAN ROADS (VARIOUS) - DAY Core drives one-handed, uncertainly consulting the map and scanning for landmarks. Scanning for   anything . The SUN remains low in the sky. Long shadows, fewer buildings to be seen, much more snow. He sees distant shapes of CARIBOU moving along frozen water. He sees WHIRLS of snowy wind, miniature sideways tornados. He sees a LONE FIGURE in a DOG SLED whisking across the plains, drawn by a bounding team of HUSKIES. He drives onward. Medora’s FOL",
      "dialogue_count": 0,
      "word_count": 681
    },
    {
      "scene_number": 4,
      "slugline": "INT. RENTAL SUV (MOVING) - DAY THIS ROAD is unpaved and snowy, so Core drives slow, hunched over the wheel. Drifts like seawalls rise on either side. He slows now, squinting-- THROUGH THE WINDSHIELD at the road curving upwards into a HILLY WOODED PASS, seeming to disappear before him. With a frustrated hiss he re-checks the map.   Useless . He wipes his fogged-over window, scanning as he drives--  Wait . He stops suddenly. EXT. REMOTE ROAD - SAME THE SUV backs up, pausing beside a tree with a small RECTANGULAR SOMETHING nailed to it. Core rolls down his window for a better look at... The faded, hand-painted WOODEN SIGN.   “Keelut.”  EXT. KEELUT - DAY A TOTEM POLE rises into the sky: the carved faces of bears, owls, dogs, and devils keeping solemn watch over all. Below it we find ILLANAQ (80s), looking out in watchful expectation. Filthy anorak, long braided hair. She’s   Yup’ik,  the indigenous people of Keelut. CORE’S RENTAL SUV appears slowly up the main (indeed, the  only ) road of Keelut, pausing now below the totem pole. He rolls down his window, calls up to her... CORE Excuse me... She just stares at him. CORE (CONT’D) The Slone cabin? Her cracked-leather face splits into a smirk and... ILLANAQ (gesturing) At the end.  8.",
      "characters": [],
      "action_text": "Core nods   thanks , but warily, and drives on. Illanaq watches him go. INT./EXT. RENTAL SUV (MOVING) - KEELUT - SAME The truck jounces on the rocky ground. Core scans the village, little more than two rows of buildings and the road between. Nobody’s out that doesn’t need to be. He sees: A-FRAMES and STURDY CABINS, solid and stubborn, every chimney working, radio antennae spiking from every roof. Animal skins tacked to doors and stacks of cordwood close by. SNOW-MOBILES and CHAIN-TIRED TRUCKS with electric blankets draped over their engines, nosed into massive muddy drifts. PLYWOOD KENNELS for teams of HUSKIES chained by their SLEDS, indifferent to the cold, gnawing on bones. A FEW YUP’IK KIDS dart across the road, shouting. A TALL YUP’IK MAN (30s), his long hair drawn back into a ponytail, unloading supplies from his truck, scowling at Core as he passes. There’s a CHURCH, a SCHOOLHOUSE, a WOODEN WATER TOWER and a sorry-looking PUB. The GENERATOR SHACK grumbles and smokes. Pure functionality and self-reliance. Zero gloss. And now he sees it. Up ahead at the edge of Keelut, almost  outside   of Keelut...the SLONE CABIN. EXT. SLONE CABIN - CONTINUOUS The road ends. He parks and glances around before wading through knee-high snow up towards the cabin where... A RUSTY RED TRUCK is parked. Caribou antlers hang over the door. Maybe a welcome, maybe a warning. As he gets closer... The door opens. Medora Slone appears, uncertainly, holding a dog-eared PAPERBACK BOOK to herself. A moment, the two of them looking at each other across the distance to her door. FROM OVER MEDORA’S SHOULDER, we see her lift the book, consult the AUTHOR’S PHOTO on the back:   it’s that Yellowstone picture we saw in Core’s house.  9. And just beyond it, there’s Core in the flesh, but stooped slightly and breathing hard as he approaches. INT. SLONE CABIN - DAY THE KITCHEN TABLE is stacked with dishes of food villagers have brought: caribou soup, fry bread, pies and canned fruit. Core sits by the woo",
      "dialogue_count": 0,
      "word_count": 1426
    },
    {
      "scene_number": 5,
      "slugline": "EXT. FROZEN POND - DAY As Medora and Core crest a low rise and inch sideways down towards the ice... CORE You met your husband in this village? MEDORA I never met him anywhere. I knew him my whole life, I don’t have   a memory he isn’t in. Something bitter comes into her voice,   hissing   almost-- MEDORA (CONT’D) And he left me here with a sick child. CORE Well...the war. MEDORA Someone on the radio said it’s not a real war. CORE It’s real enough. People are dying. MEDORA He said he’d never leave me. Words can’t be worthless like that. They stop there and she points out across the pond. MEDORA (CONT’D) That’s where the first boy was taken. OUT THERE, snowy wind skirls over the surface of the pond, the WOODS beyond looming in shadow. MEDORA (CONT’D) After that, they had men with rifles on the high points. And they walked the children to school. But it didn’t matter for Bailey. EXT. SMALL HILL - DUSK Medora and Core stand atop the hill as the day fades into greyish half-light.  15.",
      "characters": [],
      "action_text": "MEDORA The second was a girl, here. Cheeon’s daughter. She was sledding and the wolf came from behind her. Core glances behind them, then up at the disappearing sun. CORE From the North, again. (back to her) Does Cheeon live nearby? MEDORA Yes. My husband’s friend. CORE Do you suppose I could speak with him? She makes a noise, an unhappy little snort. MEDORA No. I don’t suppose you could. So Core tries to move on from that... CORE Did uh...did Bailey like to sled? MEDORA No. He wasn’t the right one. CORE I’m...not sure what that means. But it’s like she didn’t even hear him. Just staring out. CORE (CONT’D) You said he was sick? MEDORA He stopped going to school after my husband left. CORE That sounds normal. MEDORA There was nothing normal about my son.  16. CORE I just meant...my daughter went through that when she was Bailey’s age. She flinches, looks away. CORE (CONT’D) I’m sorry. That’s not what-- MEDORA Stop apologizing to me. (back to him) How did it feel to shoot that female wolf? CORE I had no choice. But it felt very bad. MEDORA Even though she’d taken a child, too? (off his reluctant nod) Because you think it’s the natural order? He chooses his words more carefully. CORE They’re not what you think, Mrs. Slone. Wolves attacking people, that’s not...what happened here does not happen. MEDORA What happened here happened to   me . She turns and trudges off. He stands there a moment, looking down the hill where all those sled tracks crisscross and interlace. INT. SLONE CABIN - NIGHT Core sits by the stove, slurping the last of some hot soup, mopping the bowl with fry bread. As he sets it aside... Medora appears before him, hands him a CIGARETTE and MATCHES, and then a CHOCOLATE BAR. She watches as he lights the smoke, takes a drag, has a bite of chocolate. Savoring all of it.  17. CORE (re: the cigarette) I’d quit when my daughter was born but... MEDORA Will she expect you home soon? CORE (sadly admitting) I don’t know what she expects of me these days. She gla",
      "dialogue_count": 0,
      "word_count": 1023
    },
    {
      "scene_number": 6,
      "slugline": "EXT. DESERT ROAD -   IRAQ   - DAY A CITY BURNS IN THE DISTANCE. A horizon of jagged smoldering teeth, great slow plumes of smoke climbing into the sky. TILTING DOWN until the faceless face of A SOLDIER fills the frame. In his goggles and dust mask he looks insectile, alien, manning the .50 CAL TURRET atop a SPEEDING HUMVEE. The whole world vibrates.   VRRRRRRM.  UP AHEAD OF THEM, appearing for milliseconds then disappearing again in gusts of road dust, a FLEEING PICKUP TRUCK. Glimpses of head-wrapped FIGHTERS in the back. The HUMVEE accelerates. The SOLDIER sights along his .50. UP AHEAD, the TRUCK swerves and fishtails, FLIPS AND ROLLS. Surreal, because we can’t hear it happen, but we see BODIES flying away from the tumbling wreck like dolls. The HUMVEE screeches to a halt ten yards out. The overturned TRUCK ignites into FLAMES. Doesn’t explode, just burns. A BURNING MAN scrambles away from the wreck, waving his arms. THE SOLDIER tracks him for a beat, two beats, and then--  BRAAAPT.   THE .50 ROARS, chops the man down, cleaving limbs as if with an invisible axe. TRACER ROUNDS like burning threads. ANOTHER MAN staggers towards them out of the smoke, bleeding, moaning soundlessly, wildly FIRING his Kalashnikov.  PING!PING!   SHELLS RICOCHET off the Humvee, the SOLDIER pivots, fires a prolonged blast.   BRAAAAAAAAPT.  Destroys the man, sweeps the area, chews the truck,   ends it . In the ensuing smoke-swirling silence, a GRINNING CORPORAL hops out of the Humvee, trots towards the spread of carnage. The .50 Soldier lowers his mask, lifts his goggles to reveal a pair of blank pale eyes. This is VERNON SLONE (27), lithe and powerful, calmly lighting a cigarette as-- OUT THERE, the Corporal kneels over a child-sized BODY, adjusting it, bringing   something   out of his pack... Slone smokes. Watches. OUT THERE, the Corporal takes a grinning selfie with his CAMERA, flashing the peace sign, posing with the CORPSE.  20.",
      "characters": [],
      "action_text": "Slone smokes. Watches. EXT. MAIN STREET - IRAQI CITY - DAY Smoke. Rubble. Post-battle chaos. HEAVY ARMOR moving through. Slone stalks along: helmet, body armor, M-4 CARBINE at low ready. EXT. ALLEYWAY - CONTINUOUS He turns down this narrow passage, alert,   searching . He pauses, like sensing the air. Hears something. Moves. INT. BOMBED-OUT BUILDING - SAME A soft WHIMPER and a GRUNT, some kind of STRUGGLE out of focus in the foreground as Slone appears in the doorway. That same CORPORAL has his pants down, thrusting himself into an IRAQI WOMAN bent over a desk.   Unh, unh, unh.  From across the room, the Woman makes terrified eye contact with Slone, who has no reaction at all other than to briefly double-check out the doorway and then--  BAM . Shoot the Corporal between the shoulder blades. He spills off the Woman, gasping and bleeding on the floor. The Woman scuttles back,   more   terrified now. Trapped. Expressionless, Slone draws his KA-BAR KNIFE, steps forward. She inhales to scream but...he holds out the KNIFE to her, handle first. She’s astonished. Shaking, she takes it. He tips his head towards the Corporal. Nods. EXT. ALLEYWAY - DAY TRACKING BACK with Slone as he walks calmly but briskly away. EXT. MAIN STREET - CONTINUOUS TRACKING HIM as he returns to the churn of activity, VEHICLES and SOLDIERS wiping the background. He keeps moving, unperturbed, though the DIN of this place is suffocating. STILL TRACKING HIM, a long shot, all the way down the block as the NOISE builds to a feverish intensity until--  21. POP . ALL SOUND CUTS OUT AS A DIME-SIZED HOLE SUDDENLY APPEARS IN SLONE’S NECK WITH A MIST OF RED. We stay with him as he collapses, semi-conscious, bleeding. IN THE BACKGROUND, we glimpse SOLDIERS FIRING at the unseen sniper, OTHERS rushing up to Slone. All in total silence. He just lays there, blinking glassily as we... FLASH TO: BAILEY Only a few frames of him, a wisp, staring   at   us   with   his faintly blue skin. RESUME: As the others roughly lif",
      "dialogue_count": 0,
      "word_count": 782
    },
    {
      "scene_number": 7,
      "slugline": "INT. SLONE CABIN - PRE-DAWN Which is Medora pulling off a length of DUCT TAPE, which she then wraps around the barrel of the AR-15. Across the room, Core again pulls on SLONE’S HEAVY BOOTS. Medora opens a duffel, unpacks a CARIBOU-HIDE SUIT: a thick and heavy one-piece covering, like a hooded poncho. She presents it to Core as weak light simmers outside. EXT. BACK DOOR - SLONE CABIN - PRE-DAWN Core steps outside in the caribou suit, a PACK and the AR-15 slung over his shoulders, SNOWSHOES on the big boots. Behind him, Medora cinches her robe. A light dusting of SNOW is falling. Core looks up at it, shudders... CORE So much for ‘too cold to snow.’ MEDORA What’s that mean? CORE Just something I heard. MEDORA It’s never too cold to snow. (glancing up) There’s something wrong with the sky. He gives her a look, consults the COMPASS he’s holding in his THICKLY-GLOVED HAND.  North,   the needle shows. He nods to her. She nods back. And... From afar, we see Core trudge away from the cabin, towards where that wolf came from, and Medora disappears back inside. EXT. WOODS AT THE EDGE OF KEELUT - DAWN Core moves along, head down, making good time. But slowing as he sees something ahead... Glimpsed through a spiderweb of branches, a FIGURE and a FIRE, some kind of SMALL HUT.  23.",
      "characters": [],
      "action_text": "Closer, he realizes it’s ILLANAQ. She’s burning trash items in an oil drum, another FIRELIGHT glowing inside her hut. Drawing up to her, she speaks without looking at him... ILLANAQ You know the name of this village? CORE Keelut. ILLANAQ Say its meaning. CORE I don’t know its meaning.  Now   she looks at him, that nasty teeth-missing grin. ILLANAQ “Evil spirit disguised as dog. Or wolf.” CORE Why would they name it that? ILLANAQ (shrugs, returns to her work) You’re the wolf expert, I hear. Annoyed and discomfited, Core continues on past her. She calls to his back... ILLANAQ (CONT’D) That girl knows evil. She’ll tell you. CORE (without stopping or turning back) What that girl knows is grief. Have a good day, ma’am. ILLANAQ You’re going the wrong way. Go back the way you came. He ignores her and she watches him fade into the woods.  24.",
      "dialogue_count": 0,
      "word_count": 380
    },
    {
      "scene_number": 8,
      "slugline": "EXT. OPEN WILDERNESS - DAY VERY WIDE, Core is barely a speck out there, an ant scooting across a dimension of white. Beautiful landscape, terrifying in its vastness. CLOSER, Core stomps through drifts, wearing GOGGLES now, sinking slightly despite the snowshoes. Winded, he pauses and turns in a full slow circle, taking in this place, catching his breath. He consults the compass and continues. EXT. DEEPER INTO WILDERNESS - DAY Core gulps thirstily from his thermos, drains it and then packs snow in to refill it. He gnaws on some jerky. He bends at the waist, stretching out his legs and back as best he can before re-shouldering his pack and the rifle. EXT. THE HOT SPRING - DAY A THICK MIST wafts across frame as Core enters this clearing, his head tilting in confusion because... The snow is   all melted   here, a circular area of wet bare ground that radiates from a HILLSIDE CAVE up ahead, the mouth of which issues a steady trickle of STEAM. That momentary stutter in his stride must be him recognizing this place from Medora’s words. He approaches... INT. THE HOT SPRING - SAME And from deep within this steamy slick-walled darkness, we see Core’s silhouette bend into view, peering in. His heavy breathing echoes, mixes with a steady   drip-drip-dripping . He glances down, sees... A HARD WHITE SUBSTANCE, frozen in rivulets through the cracks of the cave floor.   Is that wax?  He wonders at this a moment...and continues on his way.  25.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 250
    },
    {
      "scene_number": 9,
      "slugline": "EXT. DEEP HILLY WOODS - DAY Core walks slow, face flushed, ice crusting his beard. His breath billows raggedly. He scans the forest floor... But the snowy surface is perfectly unbroken.   No tracks.  Even behind the goggles, he looks discouraged. He continues. EXT. ROCKY BLUFF - DAY THE SUN shrieks down, directly overhead. Core shuffles into view, stoop-shouldered,   exhausted . He clambers awkwardly to a low exposed boulder and sits/collapses. Gulps deep breaths and slips off his pack and rifle, raises the goggles. He rests, bent forward, eyes shut.   Wincing . We hold on him a long beat as his breathing slowly settles until... A HOWL.   His eyes snap open. He straightens, looks over his shoulder. It was faint but unmistakable:   wolves.  EXT. RIDGE OVER A SNOWY PLAIN - DAY CORE’S FACE inches over the crest, wide-eyed, looking out at-- THE SNOWY PLAIN spreading before him after the STEEP DROP-OFF directly below: a great, dead valley floor. And far out there, strange against the frozen stillness of it all, there are TINY MOVING SHAPES. He puts his FIELD GLASSES to his eyes and... CORE’S BINOCULAR POV shows a PACK OF SNARLING GREY WOLVES, six or eight, hackles up, hard to say exactly how many the way they’re darting and thrashing around   something . Core crawls to a better vantage point and looks again. (And was that a flash of actual   excitement   in his eyes?) CORE’S BINOCULAR POV now shows a better angle of the WOLVES, the pink fur around their mouths...and the WOLF PUP CARCASS they’re fighting over, ripping apart, gobbling down. With the field glasses still to his eyes, we can see in Core’s mouth how whatever excitement he felt turns sour. He lowers the glasses, holds there, looking off as the BARKING and HOWLING of the wolves come echoing in.  26.",
      "characters": [],
      "action_text": "And finally, he looks away and begins to scoot back the way he came except--  KUNCH . THE ICY BLUFF CRACKS FREE AND CORE TUMBLES DOWN THE STEEP DROP-OFF. Rolling over and over, uncontrolled in a whorl of powdery whiteness. HE LANDS HARD WITH AN INVOLUNTARY CRY OF PAIN-- CORE  UHH!  AND FAR OUT ON THE PLAIN, the ALPHA WOLF hears that. Looks back towards the ridge, tall ears straightening. AT THE BASE OF THE DROP-OFF, Core struggles up out of the snow, GRUNTING painfully, battered. And quickly realizing...  He’s lost the AR-15 . He swats at his shoulders but it’s gone. He looks all around him in the tufts of disturbed snow made by his fall.   Oh Jesus, where is it?   And then... A STRONG GUST OF WIND BLOWS FROM BEHIND CORE, ruffling the fur on his hood, gusting the SNOW about him-- WHICH WE FOLLOW AS IT SPEEDS OUT ACROSS THE PLAIN. We   are   the wind and we’re blowing right up to-- THE WOLVES, the rest of which all look in the same direction as the Alpha,   back towards Core . Their noses twitch and a low collective GROWL rumbles from the pack. ON CORE, even three hundred feet away he’s able to tell that the Wolves have stopped feasting and are now clocking   him . He stares out at them, frozen in rapidly mounting fear. THE ALPHA GROWLS, long teeth exposed, eyes wild and fixed. CORE catches something in his periphery,   look -- THE AR-15, jammed into the snow barrel-first, ten feet away. This moment: Core and the Pack facing each other over the plain. No motion. No sound but their soft GROWLS in the wind. CORE LUNGES, clawing through snow for the rifle. THE PACK CHARGES, bounding at him with the force of rockets. BIRD’S EYE VIEW OF THE PLAIN, that speck on the left is Core, the cluster rapidly approaching from the right are Wolves.  27. CORE snags the rifle, jerks it out, tugs at the DUCT TAPE around the barrel but his bulky GLOVES make it impossible. THE WOLVES, charging in, snouts low, huge paws churning snow. CORE sees this, frantically gnaws a glove off and pulls",
      "dialogue_count": 0,
      "word_count": 3016
    },
    {
      "scene_number": 10,
      "slugline": "INT. BAGGAGE CLAIM - AIRPORT - NIGHT Cheeon stands next to the baggage carousel, himself resembling the Keelut totem pole. Slone approaches and, by way of a greeting, Cheeon hands him a SHEATHED BOWIE KNIFE, which Slone tucks under his coat at the small of his back. No words, no handshake... They just continue on towards the exit, side by side. INT. CHEEON’S TRUCK (MOVING) - NIGHT The RADIO plays an upbeat country number and Cheeon drives them out of the AIRPORT PARKING LOT as Slone cracks the window, lights a cigarette, stares out at the darkness. INT. BREAK ROOM - MORGUE - NIGHT A NOVELTY PAINTING of a moose wearing red lipstick and a Marilyn Monroe wig. Cheeon stares at this as if pondering a calculus equation. Slone sits at the table, smoking, staring blankly at-- Russell Core, who sits slouched in the corner, unable to meet Slone’s gaze, dabbing his runny nose with a tissue. It’s a little drop-ceiling room: hard furniture, coffee and stale donuts on the counter. After a quiet beat... SLONE Are those my boots? Core looks down, swallows as he remembers that they are. CORE Yes. SLONE You’re the one found my boy? CORE Yes. Slone exhales smoke, stubs the cigarette out, nods slowly. SLONE Thank you. Core doesn’t know how to respond.  40.",
      "characters": [],
      "action_text": "Marium and the two Deputies enter: all three, to varying degrees, are visibly nervous in Slone’s presence. FAT DEPUTY We got leads, Vern. Got her picture out, been in touch with the Mounties, we’re coordinating. We’re gonna find her. She’ll answer for it. Marium shoots the Deputy a look,   Cool it . Cheeon looks from them to Slone, who listens to all this without expression. MARIUM Vernon. You have my-- all of our  deepest condolences. This is...I can’t even imagine. Slone nods in acceptance, lights a new smoke. Marium clears his throat. MARIUM (CONT’D) Mr. Core was called here by your wife. He was the last one to see her and he’s been very helpful to us so far. We asked him to be here in case you had questions for him. Cheeon looks at Core. Slone looks at Core. Eventually... SLONE Can you raise the dead? CORE No, sir. SLONE Then I have no questions for you. Core looks away. Everyone except Slone and Cheeon shifts uncomfortably. MARIUM Can you think of anyone she might run to? Relatives? A friend? Anything at all? Slone pulls a long drag, really thinking...but finally has to shake his head   No.   And then he looks up at Marium... SLONE Now?  41. Marium’s face clouds over. MARIUM Alright. INT. “COLD ROOM” - MORGUE - NIGHT Slone approaches the steel table with a sheet-covered  something   resting atop it in a bright pool of light. His face is ever impassive...but he’s breathing faster than usual. Marium and the two Deputies stand back by the door. The CORONER waits for a subtle look from Marium and then draws back the sheet. We don’t need to see Bailey. We hold on Slone’s face. We can hear his breath rattle inside his nose. We can see the tight clench of his jaw. In time, he’ll begin to sob. INT. HALLWAY - MORGUE - NIGHT Core is waiting outside on the church-pew bench when, from inside the DOUBLE DOORS marked   Restricted,   comes a SCREAM so anguished and bitter it barely sounds human. It startles him out of near-sleep and he blinks fearfully at the doors, then look",
      "dialogue_count": 0,
      "word_count": 913
    },
    {
      "scene_number": 11,
      "slugline": "INT. MARIUM’S TRUCK (MOVING) - NIGHT The WIND whistles outside the cab, some bluesy classic rock on the RADIO. But even so, Marium glances briefly in the rearview.   Did I hear something back there?  He turns the RADIO down, frowning into the rearview. But it’s just black silence out there now. CORE What? MARIUM Nothing. Core coughs, dabs his nose. Looks like shit. Marium notices. A NEW SONG begins and Core reaches for the radio dial... CORE Do you mind? ...turns it back up when Marium shrugs,   Go ahead.  CORE (CONT’D) I like this one. Marium drives on, listening to the song. MARIUM Me too. EXT. TRAPPING ROAD - NIGHT Pitch-blackness is split by HEADLIGHTS crawling towards us, revealing this hidden pass through thick woods. CHEEON’S TRUCK jerks to a halt, splashing its LIGHTS onto a MASSIVE ICY DRIFT. Slone and Cheeon hop out,   moving fast.  A PICK AXE and a SHOVEL are yanked out. CHOPPING into the ICY HILL in a tight, steady rhythm-- kak, kak, kak, kak --until a SHALLOW SLOT is cleared. Cheeon shoulders a RECTANGULAR WOODEN BOX from the truck bed, plain but expertly crafted, and fits it into the slot. And then Slone moves to the truck, slowing as he bends to remove BAILEY’S BLANKET-WRAPPED BODY. He lays him gently inside the BOX, folds the blanket back, removes his glove...and lays his hand on Bailey for a moment.  44.",
      "characters": [],
      "action_text": "He replaces the blanket and turns away, blasted white in the HEADLIGHTS as he moves back towards the truck while Cheeon, in the background, power drills a lid onto the box.   VZZZZZ!  EXT. KEELUT - NIGHT CHEEON’S TRUCK glides through Keelut like a black shark. A FACE in a cabin peers at them passing, quickly looks away. INT. CHEEON’S TRUCK (MOVING) - NIGHT Cheeon pulls up to the end of the road, to the Slone Cabin, throws it in park and passes Slone a SET OF KEYS. CHEEON Heat shed behind the school. Registered to a cousin. Full tank. If you gotta go to ground, Shan’s still got his place. SLONE I won’t. They clasp hands, eyes locked, and share a tiny nod. This is communion. But just before Slone pops the door... SLONE (CONT’D) I am sorry about Alasie. Cheeon blinks once but otherwise might as well be stone. SLONE (CONT’D) It’s not right you don’t have her body. CHEEON Right’s got nothing to do with anything. You know this. Yes, Slone   does   know this. EXT. SLONE CABIN - NIGHT THE FRONT DOOR is sealed with an X of yellow police tape and Slone passes by, circling back to--  45.",
      "dialogue_count": 0,
      "word_count": 436
    },
    {
      "scene_number": 12,
      "slugline": "INT. SLONE CABIN - NIGHT THE REAR DOOR where he enters, another wad of police tape in his hand. He moves in a sure but unhurried way. We follow him, catching fast glimpses of what he does. Time is broken. INSTANT COFFEE, boiling water going into a mug. A SANDWICH, hard bread and cold cuts slapped together, Slone chewing mechanically, gulping coffee. IN THE BEDROOM MIRROR he peels off his bandage and applies antiseptic cream to his HEALING GUNSHOT WOUND. A CUPBOARD is opened and Slone (now with a fresh bandage on his neck) retrieves a 9MM HANDGUN and BOX OF AMMO. A DUFFEL BAG is opened and the 9MM, a 12 GAUGE AUTOLOADER, a REMINGTON RIFLE, the AR-15 and VARIOUS AMMO go inside. THE COMPOUND BOW is grabbed, a QUIVER of arrows. FROM A FOOTLOCKER, socks, leggings, Maglite, binoculars. FROM A DRAWER, a POLAROID PHOTO:   Medora , posed on the edge of a river in hiking gear, smiling awkwardly. A WICKER BASKET, pawing inside it until he brings back a pair of MEDORA’S UNDERWEAR. He inhales them,   precisely . And then sees something else, bends to get it...one of BAILEY’S LITTLE T-SHIRTS. His hand closes tightly on it. EXT. ILLANAQ’S HUT - NIGHT ILLANAQ waits before her hut, FIRELIGHT crackling behind her for a semi-silhouette. She sees something and shuffles back inside because... Slone is coming this way, inexorably, through the snow. INT. ILLANAQ’S HUT - SAME Illanaq sits by her fireplace, a halved oil drum turned on its side. Pelts, cordwood, leather-bound books as furniture. She holds a faceless HEX DOLL for comfort. THE WIND stirs sparks and then Slone is sitting across from her, firelight gleaming on the blade of his Bowie knife.  46.",
      "characters": [],
      "action_text": "ILLANAQ You come to punish the old witch, Vernon Slone? I’m no witch. You think I knew? You think I could have   stopped   her? An old woman? Slone says nothing. She spits on her own floor, smirks. ILLANAQ (CONT’D) Go to your father’s grave and ask him. Take your wrath to the gods, to the wolves. To   yourself   and end it. Slone says nothing. She rattles the hex doll at him, as if to scold him. ILLANAQ (CONT’D) That boy’s fate was foretold in the ice. So was hers. And yours. You should have died there in the sand but you did not accept that. You came home to see. Slone says nothing. She shifts, growing less sure, less haughty. She reaches for a PILL BOTTLE, swallows one dry. ILLANAQ (CONT’D) This is not the first time the wolves came. Before, the white men called it   influenza . We called it  peelak.   I was a little girl.   Half the village, their bodies in igloos on the hill, for proper burial after breakup. I pulled them there on my father’s sled. But the wolves came at night and broke the igloos. In the morning, the hillside was scattered with the pieces of their bodies. There is no proper burial after that. That is our history here. Slone says nothing. She pleads in a whisper... ILLANAQ (CONT’D) You cannot blame an old woman for it. Slone rises, his body filling the smoky space of the hut.  47.",
      "dialogue_count": 0,
      "word_count": 533
    },
    {
      "scene_number": 13,
      "slugline": "EXT. DEEP WOODS - NIGHT A 4x4 is tucked into this dark, hidden turnaround, lights off but its ENGINE idling, exhaust smoke swirling around it... INT. 4X4 - SAME Vernon is curled inside it under many quilts, eyes shut tight with BAILEY’S SHIRT clamped over his nose, breathing it in. Even with the heat on, his breath fogs. FADE TO BLACK. INT. HOTEL ROOM - DAY THE MUTED TV SHOWS A PIXELATED IRAQ, the terrible green strobe of a shock and awe bombing campaign. TEACHING ASSISTANT (PHONE V.O.)  Good afternoon. Linguistics.  CORE (O.S.) Professor Core, please. TEACHING ASSISTANT (PHONE V.O.)  Who’s calling?  CORE (O.S.) Her father. TEACHING ASSISTANT (PHONE V.O.) (chilly, after a beat)  One moment.  THE SIDE TABLE is cluttered with snotty tissues, half-empty NyQuil, paper cups of cold tea. A half-eaten chocolate bar. We can hear the crackly HOLD MUSIC over the phone line. AN OFFICIAL POLICE FORM,   ‘Statement of Witness’ , blank except for Core’s contact information, lays on the chair with a pen. The hold music cuts and-- TEACHING ASSISTANT (PHONE V.O.) (CONT’D)  I’m sorry, she’s not available, may I take a message?  CORE (O.S.) (quiet defeat) No, thank you.  48.",
      "characters": [],
      "action_text": "Click.  Core lays curled and sweaty in bed, gazing at the television. Fearfully hypnotized. He coughs softly, rolls away from it... CLOSE ON CORE as he stares straight ahead at something   else , something in near focus. His expression remains the same. CLOSE ON CORE’S WIFE, curled beside him, her frozen-moan face only inches away from his. CLOSE ON CORE, staring at her, his face tightening with some impossible question. CLOSE ON MEDORA, who is now the one curled beside him, looking back at him with a plain, answering kind of look. HIGH SHOT, looking down on Core in bed, tangled in the thrashed-up sheets. He is, of course, all alone here. A long beat like that, and then... He pushes himself up, reaches for the police form and pen. A FLASH OF THE FORM:   ‘...is true to the best of my knowledge,’   with a space for writing below. He considers this, vexed, like it’s a foreign language. And then, as if on autopilot, slowly at first... He begins to write, hunched there on the bed. FLASHES OF HIS HANDWRITING:   MEDORA SLONE...   LETTER... TO KEELUT...  His scribbling intensifies, the pen SCRAPING on the form. FLASHES OF WRITING:   ATTRIBUTED TO WOLVES... HIKED NORTH / NORTHWEST...  And intensifies further, hard SLASHING pen strokes. FLASHES OF WRITING:   EMPTY HOUSE... BODY ( BAILEY SLONE )... ALERTED NEIGHBORS...  And intensifies further still, growing almost   violent   until-- He stops. Stares curiously at the page for a long beat. A FLASH OF HIS WRITING:   ELDERLY WOMAN  He stands abruptly, is momentarily dizzied and has to steady himself before he can grab and dial the phone.  49. OPERATOR (PHONE V.O.)  Police operator, what’s your emergency?  CORE I-- no, I don’t have an emergency, it’s...I need to speak with the Sheriff’s station, please. As the line goes silent without another word... CORE (CONT’D) Hello? A RINGING is followed by a NEW VOICE, noticeably   tense -- NEW OPERATOR (PHONE V.O.)  Sheriff’s.  CORE Detective Marium, please. He can hear AGITATED VOICES in ",
      "dialogue_count": 0,
      "word_count": 2558
    },
    {
      "scene_number": 14,
      "slugline": "EXT. CHEEON’S HOUSE - SAME Walking towards Marium, Core’s eyes flick to something behind him and he points up in sudden terror-- CORE  Watch--  Marium jerks aside as--  BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.  THE FACE OF   THE COP   NEXT TO MARIUM EXPLODES IN A RED SHERBET. MARIUM DIVES TO THE GROUND. CORE STARTLES IN PLACE, HANDS FOOLISHLY COVERING HIS HEAD. OTHER COPS RETURN FIRE,   Bang. Bang. Bang. Bang.  But all is overwhelmed by the brutal authority of the M-60: the SOUND of it is DEAFENING and CEASELESS, one prolonged uninterrupted blast. See? It’s   still   going on.  BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.  MARIUM CRAWLS BEHIND A TRUCK. WINDOW GLASS ATOMIZES, SPRAYS. CORE DROPS TO HIS HANDS AND KNEES AS A LINE OF BULLETS SHEARS INTO THE ROAD BESIDE HIM.   BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.  IN THE ATTIC WINDOW, Cheeon swivels calmly,   still firing --  BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.  A LINE OF COPS ARE CUT DOWN, blood misting left to right, their body armor punched through like paper mache. BEHIND A TRUCK, Marium huddles next to ARNIE and ANOTHER COP, both cowering. BULLETS stream into the engine block and it sounds like HAMMERS STRIKING ANVILS in rapid succession.   Pung!Pung!Pung!  IN THE ROAD, Core wriggles behind ANOTHER TRUCK just as a COP drops before him, clutching a BLOOD-SQUIRTING THROAT HOLE. Core crawls to the Cop, presses his hands to the wound but--  BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.  A SPRAY OF METAL AND GLASS AND DIRT SENDS HIM SCUTTLING AWAY.  60.",
      "characters": [],
      "action_text": "IN THE ATTIC WINDOW, an INCOMING ROUND punches the wall behind Cheeon-- KAK! --and he swivels to-- THE TREES AT THE EDGE OF HIS YARD, where he spots a blip of DARK MOVEMENT in the branches and sprays the M-60 there--  BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.  THE TREE ERUPTS SNOW, looks like an explosion of pure white fire that spills out the POLICE SNIPER’S SHREDDED BODY. BEHIND THE TRUCK, Marium has his SIDEARM out-- MARIUM  Arnie. Arnie. Listen to me.  ARNIE just gapes at Marium, blinking wildly as--  BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.  THE OTHER COP directly beside Arnie is SHOT THROUGH THE BODY OF TRUCK, metal shards splitting his chest and face. Marium hisses, blood-spattered, peeks out to see-- AN EXPOSED BOULDER BY THE TREELINE, like a giant’s skull emerging from the ground, the size of a car. He whips back to panic-frozen Arnie-- MARIUM (CONT’D) WE HAVE TO GO. ARNIE (nodding ferociously) Okay. MARIUM (when Arnie doesn’t move)  NOW.  ARNIE I-I don’t want to. BEHIND ANOTHER TRUCK, Core is flat on the ground, looking out from underneath it, shaking, awestruck-- He sees DEAD AND WOUNDED COPS splayed before CHEEON’S HOUSE with MUZZLE FLASHES flaming out of the ATTIC WINDOW.  BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK. A PANICKING COP   DIVES INTO A BULLET-RIDDLED TRUCK, THROWS IT INTO REVERSE, SPINS THE TIRES TRYING TO BACK UP-- VRRRRRR!  61. IN THE ATTIC WINDOW, Cheeon swivels onto this and--  BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.BAK.  HE POURS BULLETS INTO THE TRUCK UNTIL THE RADIATOR EXPLODES AND IT ROLLS LAZILY BACKWARDS DOWN THE ROAD. FROM BEHIND   HIS   TRUCK, Core watches it roll slowly by like some lumbering beast gushing steam, not five feet away. For the first time in what seems like hours, the shooting pauses. Wounded men WHIMPER but the relative silence   booms . FROM BEHIND   THEIR   TRUCK, Marium drags Arnie with him. MARIUM  Move.  INTO THE OPEN, Marium and Arnie spr",
      "dialogue_count": 0,
      "word_count": 2494
    },
    {
      "scene_number": 15,
      "slugline": "EXT. THE CAMPFIRE - NIGHT The DRIFTER (20s) lifts his scabby, bug-bitten face from the fire: one milky eye, long stringy hair from under his woolen watch cap, brown teeth-nubs showing in a kindly smile as... Slone approaches the ring of firelight. Staring down at the grinning Drifter in appraisal. A moment like that, the fire crackling between them, and Slone tosses down a FOOD SACK. SLONE That’s bread and cheese. It’s dropping low tonight, first snows are coming, so you need to move on from here. DRIFTER Termination dust won’t come on tonight. Night or two before that. SLONE You a weatherman? The Drifter’s smile shines and spreads. DRIFTER You could say I know something about what’s coming. (beat) You got a name? SLONE My name’s got nothing to do with you. DRIFTER Not yours. The boy’s. Slone’s eyes sharpen and narrow. He seems to   coil . SLONE What do you know about that? DRIFTER Just a feelin’. The Drifter smiles past Slone’s shoulder, out at THEIR CABIN where MEDORA is silhouetted in the orange-lighted window. DRIFTER (CONT’D) Looks warm. SLONE Best find a home of your own, then.  71.",
      "characters": [],
      "action_text": "DRIFTER I don’t mean the house. His tone is not lascivious, though, it’s damn near   reverent . But Slone leans closer, his voice dropping to a low monotone. SLONE Look into my face now. Believe what I tell you.   I will end your every day.   Do you believe me when I say that to you? The Drifter nods, placating.   Sure, sure.  SLONE (CONT’D) Move on. Slone rises and heads back. The Drifter watches him go. INT. BEDROOM - SLONE CABIN - NIGHT, LATER Medora lays asleep on the bed, curled on her side under a quilt in the mostly-dark room. Slone watches her from the doorway with something almost like  fear . EXT. WOODS BEHIND THE SLONE CABIN - NIGHT Slone is a wraith cutting through the woods, quick and silent, garbed in black. The DYING CAMPFIRE glows just beyond the trees: he’s circling around   behind   it. EXT. TREELINE - THE CAMPIRE - SAME Slone melts out of the forest, his BOWIE KNIFE a shining sliver in one fist as he angles in on the DRIFTER’S TENT. He crouches,   listening.  INT./EXT. DRIFTER’S TENT - SAME Slone snaps open the flap but-- It’s empty. Looking closer, he sees-- Resting on the filthy sleeping bag, crudely carved from a bar of soap, a tiny FERTILITY FIGURE.  72. Dread pooling on his face, Slone looks back to the cabin. INT. BEDROOM - SLONE CABIN - NIGHT CLOSE ON MEDORA, a film of perspiration on her face, wincing in discomfort as she comes blearily half-awake to see... A SHAPE in the doorway, looking in at her. MEDORA ...what’re you doing, baby? THE SHAPE doesn’t answer. She sits up, achingly holding her belly. MEDORA (CONT’D) ...oh God...something’s happening. And now, her eyes adjusting, she sees that it’s   not   Slone standing in the doorway. Her face hardens in terror. MEDORA (CONT’D) There’s money in a jar by the sink. Fifty dollars. And food. The Drifter’s manner is calmly sympathetic,   comforting   even. DRIFTER I came to warn you. The boy can’t live. She flinches as he reaches into his coat, pulls SOMETHING out and tosses it onto the bed bef",
      "dialogue_count": 0,
      "word_count": 1482
    },
    {
      "scene_number": 16,
      "slugline": "EXT. ABANDONED MINING CAMP - NIGHT LOOKING UP the slope of the valley wall to a CAVE MOUTH: animal-skin curtains and FIRELIGHT shimmering inside. TILT DOWN to find SLONE hiking steadily up towards it. INT. HUNTER JOHN’S CAVE - NIGHT HUNTER JOHN (60s) looks up from a steaming stew pot, grinning in welcome. Imp-eyed, skeletal and bald with a beard to his chest, dressed all in animal skins. Slone enters, stooping low and unzipping his coat in the claustrophobic warmth of several smoking braziers. It’s packed with   stuff : bear skins and hunting rifles, folk art and motor parts, old   National Geographics   and   Playboys . And MASKS. Dozens, various crude ANIMAL FACES of wood and cloth and pelt, displayed on the wall. Slone sees them. HUNTER JOHN Come eat. He ladles up a second bowl for Slone, offers a spot to sit. Slone takes a bite, watches Hunter John slurp the broth. Eventually... HUNTER JOHN (CONT’D) She knows you’re coming for her. She told me what she did, too. That’s why she came to me. For counsel. She had one of my masks. I don’t know how she got it. I share them with travelers and they find their way to who needs them. SLONE You let her go from here. HUNTER JOHN Not my business what she did. There’s no decree in the country. It don’t reach here. I help who comes asking. He peers across at Slone, a small knowing smile. HUNTER JOHN (CONT’D) I remember you, traveler. Just a little tyke last time you were here. All that yellow hair?  78.",
      "characters": [],
      "action_text": "SLONE Why did we come? HUNTER JOHN To see me. Your father wanted wolf’s oil. It was for you. Did you know that? He said you were unnatural. That was his word. An Indian witch from his village said wolf’s oil could cure you. Did it work? I gave him the oil. Slone stares at him. He-- what?   For just an instant there it looked as if he might shed tears. He clears his throat. SLONE (so soft) Where did she go? HUNTER JOHN Not my business. I traded her my truck and I’d say I got the better deal. Fixed her up with some boots I’d made. She left her mask, though. Hunter John gestures vaguely with his spoon into a corner. HUNTER JOHN (CONT’D) You’re welcome to it, boy. As Slone looks back and RISES OUT OF FRAME, Hunter John returns his attention to his meal... HUNTER JOHN (CONT’D) When was the last time   you   wore a mask? I can see you need to let the wolf out a little. We all do, out here. It’s truth. Hunter John looks up to see Slone, hunched beneath the low cave roof with his back to him. But turning slowly around now...with MEDORA’S WOLF MASK on his face and the 9MM PISTOL in his hand. They stare at each other in flickering firelight. EXT. ABANDONED MINING CAMP - NIGHT LOOKING UP AT THE CAVE as-- bang.bang. --GUNSHOTS ECHO from the dancing light within and wash down over the camp.  79.",
      "dialogue_count": 0,
      "word_count": 515
    },
    {
      "scene_number": 17,
      "slugline": "INT. INN - NIGHT The Innkeeper looks up from a magazine, hearing the shots. EXT. HUNTER JOHN’S CAVE - NIGHT Slone-as-Wolf emerges, his eyes black pits in the mask, an OUT OF CONTROL FIRE JUMPING TO LIFE IN THE CAVE BEHIND HIM. EXT. ROAD - ABANDONED MINING CAMP - NIGHT Slone-as-Wolf stalks towards the INN, the gun in his hand, a DISTANT FIRE blazing in the cliffside high above him. He nears the INN, raising the GUN as he PASSES HIS 4x4 when--  BAM.   WINDOW GLASS EXPLODES AND SLONE BUCKLES:   HE’S HIT.  THE INNKEEPER STEPS FROM   BEHIND THE INN , AIMING A RIFLE ON HIM, HER EYES WILD WITH FEAR.   BAM. BAM. BAM.  SLONE WRIGGLES INTO THE TRUCK AS BULLETS PUNCH ITS DOORS AND GLASS SPRAYS HIS FACE.   BAM.   BAM.   BAM.  THE INNKEEPER ADVANCES, FIRING ON THE 4X4 AS--  INSIDE IT , Slone fumbles the keys into the ignition with BLOODY FINGERS and grinds the starter-- KRRR! OUTSIDE , THE INNKEEPER STEPS INTO THE ROAD, FIRING ON THE 4x4 AS IT FISHTAILS AWAY FROM HER IN GREAT TWIN-GEYSERS OF SNOW.  BAM.   BAM.   BAM.  CUT TO BLACK. INT. KITCHEN - MARIUM HOME - NIGHT Susan prepares a plate at the stove: spaghetti and sauce and bread. She brings it over and sets it down for... Marium, waiting at the table with his hands steepled before his face. Band-Aids on his face. Sunken.   Haunted.  She joins him with her own plate, eyeing him, concerned but understanding.   Oh,   he notices his food there. MARIUM ...thank you... She touches his hand. He gives her a frail, phony smile.  80.",
      "characters": [],
      "action_text": "She frowns at that,   don’t , and he lets the smile go. Lets her see the grief in his face. Holds her hand tightly. A moment like that and then they both look up to... Core, returning to his plate, carefully replacing his napkin in his lap. He looks a   shell   of himself ,   utterly depleted. Susan reaches for the bottle of wine, gestures to pour him some. Core hesitates then slides his glass over with a nod .  He takes a sip, looks around at this modest, new-model house. Cream-colored paint and particle-board cabinets. CORE Your home is lovely. Susan smiles but it doesn’t quite reach her eyes. They eat. Utensils clink on plates. SUSAN Donald says you’re a writer. CORE I write. Yes. SUSAN What kinds of stories? CORE I write about nature. I’m not sure if that’s a story. SUSAN Is it fulfilling? She was maybe asking to be polite but Core stares intensely down into his plate, like the truth might be hidden there. CORE You do a thing and...at some point that’s what you are. I don’t know if that’s the same. But I loved wolves very much. I used to study them. Lived with them for a time. Near them, anyway. (he’s   seeing   them now) They were very beautiful. Marium looks up from his food, glances at Susan: this naked emotion is awkward at the dinner table. Core realizes this, is embarrassed.  81. CORE (CONT’D) (gesturing,   your baby ) Um. How much longer do you have? Susan can’t help but to smile, touching her big belly. SUSAN February. Core smiles in a vague and longing kind of way. CORE Almost here. (beat) Do you know what you’re having? She shakes her head, adding... SUSAN He wants a boy though. Now Marium can’t help but to smile. MARIUM No, a girl is good, too. A fogey like me having his first kid? Anything is fine. CORE What are you...forty? MARIUM Forty three. CORE “Fogey.” Hah. I’ll trade with you. A beat, the two men regarding each other, Susan watching. MARIUM Are you a father? Core blinks. Swallows hard. CORE Yes. SUSAN What’s his name? Her name? Core swallows. ",
      "dialogue_count": 0,
      "word_count": 3312
    },
    {
      "scene_number": 18,
      "slugline": "EXT. AIR STRIP - DAWN SLONE’S BOOTS stride mechanically forward. But of course it’s Core wearing them. He and Marium, side by side in heavy outdoor gear, come briskly down the TARMAC. They see: A SMALL PLANE taking off, ANOTHER ONE already taxiing into position. Tense COPS visible in the windows. COPS in weather gear jogging by in the background.   Full deployment.  Up ahead, there’s a cluster of STATE POLICE CARS, where some older RANKING OFFICERS are waving Marium over. As Marium jogs ahead to confer with those men-- A STIFF WIND BLOWS, Core turns into it and blinks in awe at-- DENALI, a black mass at once distant and enormous, swelling out of the horizon line, conjuring a STORM to its peak. He is hypnotized, swaying. Marium comes jogging back, pointing Core off towards a-- TWO-SEATER CESSNA PROP PLANE, waiting nearby, with just a few AIRPORT WORKERS buzzing about it but   no police . Core joins him, glancing around, realizing... CORE Just us? As Marium loads his gear, moving urgently-- MARIUM An old KA of Slone’s was found this morning with a mail slot through his skull. Half the men are working  that , the rest are assisting the camp search so I’m afraid, yeah, it’s just us. You eyeball it, I’ll call it in. Marium climbs into the plane, checking controls and slipping on the headset with practiced familiarity. He looks out to Core as he starts the engine,   VRR-RRR-RRMM!  MARIUM (CONT’D) (shouting over the noise)  Besides...only two seats in this sucker!  96.",
      "characters": [],
      "action_text": "Suddenly dizzy, Core stares at the mountain, gulping deep breaths. With the deafening ENGINE NOISE between them, Marium gives him a questioning look.   You ready?  Core nods,   Yes . It’s a lie. He climbs into the plane anyway. The MUSIC is a dread-fueled, ramming-speed wall of sound. EXT. TARMAC - DAY TRACKING THE CESSNA as it speeds down the runway and, as if plucked up by some invisible giant, gently leaves the ground. EXT. AERIAL - DAY The MUSIC crescendos into a teeth-rattling   doooooom   as... THE CESSNA FLIES TOWARDS DENALI. Though it’s maybe fifty miles away, the plane looks like an insect before a great dark ziggurat. The sky all around is swollen and evil. INT. CESSNA (FLYING) - SAME Core gapes at the storm gathering off the mountain... MARIUM (headset filtered) Locals call it Weathermaker. CORE (also) McKinley? MARIUM  Denali . Please. You Lower 48ers... CORE Can we beat that storm? MARIUM We’ll get out of its way. But Marium glances out the window and maybe isn’t all that confident. He urges the throttle up and--  97.",
      "dialogue_count": 0,
      "word_count": 434
    },
    {
      "scene_number": 19,
      "slugline": "EXT. AERIAL - SAME BIRD’S EYE VIEW OF THE CESSNA AT 500 FEET, moving parallel to a thin stripe of ROAD cutting through the WHITENESS BELOW-- --but now VEERING OFF TO THE RIGHT, the road disappearing beneath them, no more man-made landmarks of any kind. INT. KEELUT - DAY THE WHITE HAIRED YUP’IK MAN (we saw him earlier, with his boy, returning from a hunt) is readying his SNOWMOBILE when--  VRRRRRM.   He looks up to see the CESSNA pass over him at low altitude, vanishing as quickly as it appeared. INT. CESSNA (FLYING) - SAME Marium flies in the weird half-light, the increasing cloud cover making for a kind of morning dusk. Core peers out the window through binoculars, scanning the ground. He gestures to Marium,   That way . Marium banks the aircraft. EXT. AERIAL - SAME THE CESSNA FLIES LOW OVER WILDERNESS, a windy stretch we might recognize from Core’s trek earlier. INT. CESSNA (FLYING) - SAME Looking through the binoculars, Core suddenly straightens-- CORE’S POV passes over an incongruous BLACK RECTANGLE with man-made angles, down there in the whiteness. CORE I think that was a snow machine. MARIUM Moving? CORE No. MARIUM See anyone?  98.",
      "characters": [],
      "action_text": "CORE No. MARIUM I’m gonna loop back-- CORE  Wait--  Core lowers the binoculars, eyes fixed on a near point outside the window. He taps the glass-- CORE (CONT’D) There. Beyond that ridge. OUT THE RIGHT WINDOW, distant but plainly visible within a LOW FLATNESS surrounded by WOODED RIDGES and CRAGGY CLIFFS... ...there is an almost perfect CIRCLE OF DARK SNOWLESS GROUND with a thread of STEAM bending upwards from its center. CORE (CONT’D) That’s it. Marium looks, sees it, gauges the terrain... MARIUM I can set us down over there. He said it like an offer, a possibility. He looks to Core... Who is terrified. But he nods.   Do it.  MARIUM (CONT’D) I’ll be gentle. CORE Fuck. Marium banks it hard. EXT. AERIAL - SAME THE CESSNA CURVES AROUND, ANGLES DOWN TOWARDS THE FLATNESS. INT. CESSNA (FLYING) - SAME Core grips his straps two-handed, wincing away from the inevitable crash as Marium guides them in--  99.",
      "dialogue_count": 0,
      "word_count": 354
    },
    {
      "scene_number": 20,
      "slugline": "EXT. FLATNESS - SAME THE CESSNA GLIDES   GRACEFULLY   DOWN TO THE GROUND UNTIL-- KAM! --  THE BRUTAL LANDING CONTACT   VIOLENTLY JERKS   THE WINGSPAN. INT. CESSNA (MOVING) - SAME  WAM!   Core is SLAMMED into the window as Marium PULLS BACK-- EXT. FLATNESS - SAME THE CESSNA BRODIES, SHEARS UP A MASSIVE WAVE OF SNOW, SLIDES TO A LONG GROANING HALT. And the PROPELLER winds down,   wak-wak-wak-wak-wak-wak ... EXT. FLATNESS - DAY Marium cinches the strap of his SCOPED WEATHERBY RIFLE over his thick ORANGE COAT, brings up his BINOCULARS, scans the landscape. MARIUM’S POV, the icy FLATNESS extending to craggy RIDGES and CLIFFS in the distance, the telltale STEAM rising beyond. He looks over to... Core, climbing out of the Cessna and tromping this way. Marium digs into his pocket, hands something to him as he arrives... It’s a pair of CHARCOAL POCKET WARMERS. Core nods in thanks, snaps them and slips them inside his gloves. WIDE on the TWO MEN hiking away from the Cessna, across the plain of pure white as the sky turns to slate above them. Far away, THUNDER rumbles. EXT. RAVINE - DAY Rock walls tower over us, left and right, as Marium and Core appear at the far end and come this way. ICE SHEETS cascade down either side, glittering in some places, opaque in others, like waterfalls stopped in time. Core marvels up at them, towering over their heads, a stripe of sky visible up there.  100.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 244
    },
    {
      "scene_number": 21,
      "slugline": "EXT. BELOW A RIDGE - DAY They emerge from the ravine, a ROCKY RIDGE rising to one side, DENSE WOODS spreading to the other. Suddenly... Core stops, bends to looking down at something. Marium senses it, looks back to see the-- WOLF TRACKS, several sets of them spotting the snow. MARIUM How fresh are they? CORE An hour or two, I’d say. Four of them, adults. A hundred pounds apiece, give or take. MARIUM Four. Where’s the rest of the pack? CORE Not far, I’d guess. Their den must be nearby. They glance about uneasily, ahead of and behind them. MARIUM Little bit further? Core’s eyes are ringed with fear but... CORE Yeah. MARIUM We see anything...we’ll turn back, call it in. CORE Right. They crunch onwards towards the woods. A gust of SNOWY WIND stirs a sparkling whiteness around them. Core glances over his shoulder, the RAVINE receding behind them like a sideways mouth. He looks upwards, the crooked edge of the RIDGE above them...  Something moves up there . A dark wisp, a split-second blur.  101.",
      "characters": [],
      "action_text": "Core stops, staring up, his breath fogging slowly. He brings out his own BINOCULARS, squints through them... Marium stops, looks back. MARIUM What? CORE I saw something move. Marium looks up in the same direction. A long beat, the two of them side by side, looking up at the ridge. The WIND makes its faint flute-noise. CORE’S BINOCULAR POV, panning along the ridge, pausing at various places, seeing   nothing ...and   nothing ...and   nothing ... And then seeing Slone-As-Wolf, standing on the ridge, looking down at them   with his bowstring already drawn back.  He lets the bowstring go and in CORE’S BINOCULAR POV it’s perfectly silent, just the slightest twitch of movement. CORE (CONT’D)  He’s--  There is a sound like HANDCLAP and when Core looks over-- Marium is taking a single shocked step backwards with AN ARROW STICKING THROUGH HIS THROAT. Core gapes in horror as-- Marium flutters his hands around the shaft of the arrow, like swatting at flies, BLOOD GURGLING OUT OF HIS MOUTH. Core pulls him down to some kind of safety behind some ROCKS, throwing his own body of Marium’s, trying to press his gloves over the wound... CORE (CONT’D)  Donald.  But Marium’s already dead, his eyes fixed and startled. Panting in terror, Core peeks over the rocks but-- UP ON THE RIDGE, there is no sight of Slone or anything else. Core wrestles the RIFLE from Marium’s shoulder and... HE RUNS, awkwardly, bounding over snowy ground towards--  102. THE RAVINE, yawning ahead of him. EXT. RAVINE - SAME Core hurtles through the passage, caroming off the icy walls, his RASPY BREATHING making surreal echoes in here. EXT. FLATNESS - SAME WIDE, the small shape of Core dashes back towards the plane. AT THE CESSNA, Core arrives gasping, a MOAN of despair leaking out of him as he sees... THE ENGINE HOUSING has been opened, the cables and plugs inside torn loose. He peers inside the opened door to see... THE CONTROL PANEL has been hacked apart, INSTRUMENTS smashed...and the RADIO WIRES have been cut. He",
      "dialogue_count": 0,
      "word_count": 665
    },
    {
      "scene_number": 22,
      "slugline": "EXT. RAVINE - DAY Core comes towards us, the rifle to his shoulder, aimed forward. Terrified but moving at a steady, determined pace. EXT. BELOW THE RIDGE - DAY MARIUM’S BODY lays ahead, already frosting over. The pool of blood under his neck is red ice. As Core passes by, there is a HOWLING nearby, several wolf voices joining with the shrill wind. He glances up but... UP ON THE RIDGE, there is no movement, no sign of anyone. He continues. EXT. THE HOT SPRING - DAY THE STEAMING CAVE MOUTH looms ahead as... Core enters the clearing, scanning left and right with the rifle, approaching that strange dark spot in the Earth. More HOWLING, closer now. INT. THE HOT SPRING - SAME Core’s silhouette appears in the cave opening, bending to come inside. He blinks rapidly, edging forward, trying to adjust his eyes. There’s that WAXY SUBSTANCE in the cracks of the floor. His eyes track it back, deeper into the cave until he sees... SOME LIT CANDLES. Flickering in the cold breeze. And A FIRE CIRCLE, just ashes now, with the toothpick bones of a HARE scattered beside it. He sees CANNED FOOD stacked to one side, a dirty SLEEPING ROLL, a small .22 RIFLE. It was Bailey’s once, wasn’t it? He sees a PAIR OF PELT BOOTS standing next to the HOT POOL...and then realizes that they’re connected to   legs . She’s barely visible in the dimness. Just a shape there, but he can hear her BREATHING.  104.",
      "characters": [],
      "action_text": "CORE Medora Slone. She doesn’t answer. CORE (CONT’D) Are you injured? She takes a step forward, closer to the light. Now he can see her: dressed in animal skins, her sunken cheeks, her filthy skin and wild hair and bright, shining eyes. CORE (CONT’D) Listen to me...we have to leave. We have to leave   now . He is coming.  He’s coming for you.  The light in the cave changes and her face seems to   twist   as she caws in dread. Core turns. Slone-As-Wolf is there, his compound bow drawn back.   FWIPT!  THE ARROW PIERCES CORE THROUGH THE COLLAR-BONE, PUNCHES THROUGH THE OTHER SIDE OF HIM.  Time and sound turn dreamy   as he sinks to his knees, reaching uncertainly for the arrow, afraid to actually touch it. Medora stands there with tears in her eyes. Slone-As-Wolf drops the bow, regarding her through his wolf face, his breath steaming out of the snout. He stalks slowly towards her. She moans but it almost sounds like   relief.  He steps   over   Core, who watches from the cave floor as... Medora sobs, opens her arms to Slone, nodding him forward.  Come to me.  Slone reaches out, puts both hands around her throat (she is  still   nodding)... HE LIFTS HER OFF THE GROUND, SLAMS HER AGAINST THE CAVE WALL. Core’s mouth moves soundlessly, wanting to call out but knowing that he’s dying. Slone-As-Wolf pins Medora, his black eye holes empty and pitiless as he squeezes her air off.  105. And still she nods,   Yes, yes, yes.  He squeezes. Her mouth wags like a beached fish. Not much longer. But then her hands move to his mask, her fingers spidering over the fur, pulling it back to reveal his face... Which is full not of rage...but of   bottomless   tear-streaked anguish . Their faces are inches apart. Their white-blonde hair, their grey-gold eyes. Core sees this. A terrible understanding. She pulls Slone’s face to hers. Puts her mouth on his. They breathe into each other, making animal noises of hurt and hunger. She claws at Slone’s clothing. He claws at hers. They sink down toge",
      "dialogue_count": 0,
      "word_count": 1160
    },
    {
      "scene_number": 23,
      "slugline": "EXT. BELOW THE RIDGE - DAY FRAGMENTED IMAGES, CORE’S HAZY POV: SNOW BLOWS SIDEWAYS and THUNDER RUMBLES. A GOGGLED FACE bends down towards us out of the storm,  inspecting   us. And now we see... A SNOWMOBILE, nearby, where two FIGURES are hauling a DEAD ELK CALF off of the attached SLED. GLOVED HANDS drag us towards this sled. EXT. SNOWMOBILE (MOVING) - DAY THE ENGINE RUMBLES and Core slides along the ground, bouncing, bundled under a tarp. He cranes his neck to see... It’s the WHITE-HAIRED YUP’IK MAN driving the snowmobile, hunched into the wind, with his BOY riding behind him. As they near the RAVINE, Core catches a brief glimpse of... SCRAPS OF SHREDDED ORANGE COAT IN A SMEAR OF BLOODY SNOW. The Boy looks back, peers at Core through his dark goggles. Says something that can’t be heard over the engine. CORE ...what? THE BOY  They spared you.  Core lays back, stares up into the churning sky as... THE SNOWMOBILE IS SWALLOWED BY THE RAVINE. INT. HEALING HUT - SOME OTHER TIME CORE, naked on a cot in some DARK CABIN as SEVERAL YUP’IK WOMEN wash him by firelight. They use plastic water bottles with holes in the caps to squirt water over him, wiping away the blood with sponges. Someone cleans the ARROW WOUND with alcohol, slathers antibiotic ointment on it. Core doesn’t feel it. The fire throws crazy shadows. The air is hazed with smoke. His head tips sideways and he sees...  109.",
      "characters": [],
      "action_text": "AN OLDER BLONDE WOMAN (60s) watching from the corner without expression. She’s tall and gaunt, in a tattered old anorak. Tired grey-gold eyes. The only other white person here. She comes near, looks wearily down at Core a long moment. And then bends down to pick up... SLONE’S BOOTS, waiting beside the cot with the rest of Core’s blood-soaked clothes. Core watches her turn and leave the cabin, his view of her now obscured by the Yup’ik Women and their cleaning of him. CUT TO BLACK. INT. HOSPITAL ROOM - DAY Clean-shaven now, Core fades back to consciousness, disoriented and weak. Hospital sounds, beeps and murmurs. His lips are chapped and split, the skin of his cheeks pink and flaking, a bruise puffed under one eye. Hurts to swallow. His eyes fall on something and he stares at it for a long, long beat. If he   never   looked away, that would be fine. A WOMAN (30s), asleep in a chair by his bedside in a holiday sweater and horn-rimmed glasses, a newspaper in her lap. The moment stretches, Core gazing at her in love and sadness. CORE Amy. She wakes with a start, sees him, makes a smiling sob sound of relief and concern as she rises and... Kisses him on the cheek. Holds his hand, tightly. AMY  What happened?  He’s smiling...but a hint of shadow falls over his face. CORE I’ll tell you. CUT TO BLACK. IN BLACKNESS, a WOLF’S HOWL carries from far away, a lone interminable note of sorrow. END.  110.",
      "dialogue_count": 0,
      "word_count": 502
    }
  ]
}