{
  "slug": "home-economics-101-pilot-2021",
  "title": "home economics 101 pilot",
  "genre": "drama",
  "format": "series",
  "scenes_count": 2,
  "characters_count": 0,
  "characters": [],
  "total_words": 5518,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. 3   3 CONNOR’S HOUSE - ESTABLISHING   (D1)   *  TOM (V.O.)   *  ...but many zeroes of net worth apart  was Sarah’s younger brother Connor.  INT.   CONNOR’S HOUSE - KITCHEN - CONTINUOUS (D1) 4   4  Connor and GRETCHEN eat breakfast and clink little champagne  glasses of orange juice.  TOM (V.O.)  Connor had   just moved to the Bay Area  with his wife and daughter. They were  in the one   percent of the one  percent. Connor   made a fortune in  private equity -- or maybe it was a  hedge fund ?   -- so much that he   bought   *  his new house from Matt Damon. Yes,  that Matt Damon.  As   he talks we see glimpses of his house: A framed photo on  the   wall of Connor, his wife and daughter holding hands (but  facing away from the camera). A fancy piece of artwork. And  finally, a framed Japanese poster for a Matt Damon movie.  TOM (V.O.)   (CONT’D)  They even hired a live-in nanny.  Housekeeper/nanny LUPE hands Connor a plate of pancakes.  CONNOR  Lupe, can you do the thing?  Lupe   takes some whipped cream and draws a face on the  pancakes.  TOM (V.O.)  A nanny who took care of   all   of them.  GRETCHEN  Daddy, when do the cousins get here?  (CONTINUED)  HOME   ECONOMICS #101R \"PILOT\"   NETWORK PROD DRAFT (FULL GREEN)   02/04/21   3.",
      "characters": [],
      "action_text": "CONNOR  Soon, baby   girl. Today is going to be  epic . The whole family together.  GRETCHEN  Yeah, i t’s going to be   baller !   *  CONNOR  proud (   )  That’s my girl.  He   high-fives Gretchen. Then he holds up his palm for Lupe  to   high-five. She leaves him hanging at first, then  perfunctorily taps his palm with her spatula.  EXT.   TOM’S HOUSE - ESTABLISHING (D1) 5   5  TOM (V.O.)  In between   Connor and Sarah was the  oldest sibling, Tom.  INT.   TOM’S HOUSE - OFFICE - CONTINUOUS (D1) 6   6  Tom   is at his desk, typing on a laptop. He has been writing  the   narration we’ve been hearing.  TOM  “He was middle-class, but definitely  not middlebrow.”  The   sound of a TODDLER CRYING.  TOM   (CONT’D)  Yeah, you’re right, that’s terrible.  Reveal next to his desk is a crib with his toddler son,  ALEJANDRO. (Alejandro reacts with funny faces over the  following.)  TOM   (CONT’D)  How about this.  as he types (   )  “Tom grew up the golden child of the  family, and became a best-selling  novelist. But his latest novel sold only  about five   copies, as the public failed  to appreciate its subtlety and the  digital marketing was just the worst.  With expenses piling up, he now faced  the humiliation of having to borrow  money from   his rich little brother.”  Another TODDLER CRIES. Reveal that there is another CRIB on  the   other side of Tom with a SECOND TODDLER -- Alejandro’s  twin   ESTEBAN. Tom’s “office” is the nursery.  (CONTINUED)  CONTINUED: 4   4  HOME   ECONOMICS   #101R \"PILOT\"   NETWORK PROD DRAFT (GOLDENROD REVS)   02/05/21   4. TOM   (CONT’D)  “He also had too many kids.”  CAMILA runs across frame.  INT.   TOM’S HOUSE - LIVING ROOM - MOMENTS LATER (D1) 7   7  MARINA listens to a podcast while folding laundry. Camila  passes her.  MARINA  Camila, por qué no me ayudas a doblar  la ropa?  CAMILA  Por qué yo   no   want to?   *  MARINA   *  to self   * (   )  At least she’s using Spanish.   *  Tom   enters.  TOM   *  Welp, got in   almost half a page ",
      "dialogue_count": 0,
      "word_count": 5328
    },
    {
      "scene_number": 2,
      "slugline": "INT.   TOM’S HOUSE - LIVING ROOM - CONTINUOUS (D2) 20   20  Marina, Denise and the kids are eating pizza and playing  MONOPOLY. Tom, Connor and Sarah rejoin. [This is the same  scene that began the episode.]  CONNOR  All right.   Where were we?  GRETCHEN  Uncle Tommy, you owe my daddy a bunch  of money.  TOM  Ugh. Just like real life.  CONNOR  Aw, just sell your new book and  you’ll be able to pay me back.  DENISE  What’s the   book about, anyway?  MARINA  raising an eyebrow (   )  Yeah Tom, what’s it about?  Tom   hesitates, about to tell them the truth.  TOM  I haven’t figured it out yet.  SARAH  Well, don’t forget to put a woman in  it.  TOM  nods, into phone (   )  “Add woman   to novel.”  Everyone laughs and groans.  TOM (V.O.)  As Tom looked at his family, he felt  closer to them than ever before. It  was a feeling he knew would last...  until they   found out he was writing a  novel about them and then they’d want  to punch him in the face.  END OF EPISODE  HOME   ECONOMICS #101R \"PILOT\"   NETWORK PROD DRAFT (FULL GREEN)   02/04/21   34.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 190
    }
  ]
}