{
  "slug": "horrible-bosses-2-2014",
  "title": "horrible bosses 2",
  "genre": "action",
  "format": "film",
  "scenes_count": 10,
  "characters_count": 0,
  "characters": [],
  "total_words": 21091,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. HIGHWAY - MORNING From overhead, we see a Toyota Prius chugging along down the highway. NICK (V.O.) When you’re the president of the 98th largest financial services company in America you need to project a certain image.   An image of boldness, strength and confidence. Suddenly, a brand new, shiny black Porsche Boxster convertible ZOOMS around the Prius, leaving it in the dust. As we move in, we see the driver of the Porsche is NICK HENDRICKS.   Sunglasses.   Top down.   Wind in his hair.   He looks pretty cool. NICK (V.O.) You’re not gonna get that image driving a Prius. EXT. COMNIDYNE PARKING LOT - MOMENTS LATER Nick pulls into the lot and takes a reserved spot near the entrance with a sign that reads “NICK HENDRICKS, PRESIDENT.” He gets out of the Porsche and removes the dealer’s paper floormat from under the pedals. NICK (V.O.) I put in a lot of years to become president of Comnindyne and now I’m earning a lot more and working a lot... more.   The strange thing is, when I finally made it to the top, I realized that I’d actually only made it to the   bottom   of the top. Nick heads toward the building, passing several parking spots with much more expensive sports cars (Ferrari, Porsche 911 Turbo, Mercedes SLR McLaren) each with a sign bearing a name and the title “PRESIDENT.” NICK (V.O.) Turns out Comnidyne has seven presidents.   And I’m the most junior. INT. CONFERENCE ROOM - MINUTES LATER Nick enters to find his more senior COLLEAGUES in their  morning meeting.",
      "characters": [],
      "action_text": "NICK Hey, sorry I’m late. (holding up keys) Had to stop by the dealership to pick up a little something. The others all react, impressed.   PETER, 40’s, squat, gnome- like, heads to the window which looks down at the parking lot. PETER Well done.   Hendricks got himself some big boy wheels. Another colleague, ARTHUR, 60’s, joins them at the window. ARTHUR (looking outside) Which one is she? NICK (pointing) Right there.   She’s the Porsche. PETER Barely.   You got a Boxster? NICK Uh huh.   Two-thousand thirteen. A sallow-looking woman, JEANINE, 50’s, chimes in. JEANINE Cost you that much? The others all laugh derisively. NICK It’s a great little car. PETER That’s adorable.   You’re a great little man. GLEN, 50’s, hairpiece and jowls, steps up. GLEN I got my daughter a Boxster for her Sweet 16.   Made me take it back. Said it was “too girly.” They all laugh again.   Nick grits his teeth. NICK Okay.   Maybe we should get to work.  2. ARTHUR You couldn’t at least spring for the Carrera? NICK Figured I’d go with the classic. PETER Uh, the Boxster was introduced about forty years after the Carrera.   So, not exactly “a classic.” JEANINE (patting him on the shoulder) Don’t worry, Nick.   Another ten years here, you’ll be able to afford a real car. Nick stares at her. ARTHUR All right, guys.   Looks like the Swiss are about to change their drawdown regs, so we need to talk about a new home for our master feeder fund. The presidents turn back to the piles of paperwork on the table in front of them and resume their dreary work.   As they talk, the sound drops down and we PUSH IN on Nick as he stares at his colleagues. NICK (V.O.) You know what’s at the top of the corporate ladder?   Another goddamn ladder.   I may be a president, but I’m really just a fucking corporate tool. FREEZE ON Nick’s forlorn expression as the words appear over him:  FUCKING CORPORATE TOOL  EXT. BACKYARD POOL - DAY We find KURT BUCKMAN sitting poolside on a chaise lounge, reading   US Weekly   and sipp",
      "dialogue_count": 0,
      "word_count": 1139
    },
    {
      "scene_number": 2,
      "slugline": "EXT. DR. SLOCUM’S OFFICE - SHORT TIME LATER Dale pulls into the parking lot, passing a sign that reads “DR. HARLEN SLOCUM, PEDIATRIC DENTIST” above an image of a cartoon TOOTH having its own tooth pulled by another TOOTH dressed as a dentist. DALE (V.O.) I quit my dental assistant job and got a new job.   As a dental assistant.   But for a really sweet man. INT. DR. SLOCUM’S OFFICE HALLWAY - MOMENTS LATER Dale walks down a hallway, passing framed photos of DR. SLOCUM in his dental scrubs at age 35... 45... 55... 75... 80-something. DALE (V.O.) A really sweet, really, really old man. INT. WAITING ROOM - CONTINUOUS Dale enters a world of CHAOS populated by screaming KIDS and a handful of exhausted PARENTS.   Toys lie strewn everywhere. A group of TODDLERS tear the upholstery out of a sofa cushion.   A RECEPTIONIST sits at a desk, oblivious. Dale takes a step and TRIPS over something off-camera.   He looks down and picks up the CRYING INFANT he stumbled on. DALE Okay, whose baby is this?   You can’t just leave your babies on the floor. A harried MOTHER takes the baby from him as he carefully picks his way across the kid-covered floor. INT. EXAMINATION ROOM - MOMENTS LATER Dale enters to find a 4 YEAR-OLD BOY, GABE, hollering miserably as DR. SLOCUM, 80’s, sits slumped asleep with dental tools still inside Gabe’s open mouth. DALE Not again. Dale hurries over and nudges the dentist awake.  7.",
      "characters": [],
      "action_text": "DALE (CONT’D) Dr. Slocum!   Wake up.   You’re with a patient. DR. SLOCUM (groggy) What?!   I know.   What?! Dale gently removes the tools from Gabe’s mouth.   Gabe stops yelling. DALE (to Gabe) You’re okay, buddy. (checking) Nothing bleeding here. GABE I have to pee. DALE Okay.   Bathroom’s down the hall. GABE Someone has to take me. DALE Where’s your mommy? GABE She’s at Target. DALE Oh.   Okay, I’ll take you. DR. SLOCUM Hang on.   I’ve got to check his lower left cuspid. DALE He’s gotta go to the bathroom, doctor. DR. SLOCUM Fine. Dale escorts the boy out. INT. HALLWAY - CONTINUOUS Dale leads Gabe to the bathroom door. DALE Okay.   Here you go.  8. GABE You have to come in and help me. DALE Help you?   What do you mean? GABE You have to unbutton my pants. DALE I don’t think that’s a great idea, Gabe. GABE Please!   I have to go! Dale looks around furtively. DALE Okay, come on. (hustling him inside) Quick, quick, come on. INT. BATHROOM - CONTINUOUS Dale and Gabe enter.   Dale locks the door behind them and starts uncomfortably undoing Gabe’s pants. DALE (mumbling) It’s just that I recently had something expunged from my record. It was a big misunderstanding. Empty playground.   No kids anywhere.   But I really shouldn’t be doing this... He gets the pants open and heads for the door. DALE (CONT’D) Okay.   You’re good to go.   I’ll wait outside. GABE No!   You have to aim for me. DALE What?!   No one’s taught you how to aim? Gabe shakes his head. DALE (CONT’D) What kind of parenting--   Is your mom always at Target?  9. GABE I’m gonna go in my pants! DALE I’m gonna go to jail! Gabe does a desperate pee pee dance. GABE Please!   It hurts! DALE Aw man.   You’re really gonna make me do this? (sighs) All right.   Let’s get it over with. Dale takes a latex glove from his dental scrubs and pulls it on his hand.   With his arm outstretched and looking the other way, he helps Gabe aim (off-screen).   We hear the sound of peeing. DALE (CONT’D) There you go. (to himself) This ",
      "dialogue_count": 0,
      "word_count": 3542
    },
    {
      "scene_number": 3,
      "slugline": "INT. DR. SLOCUM’S EXAM ROOM - DAY Dale sits on his stool making detailed, yet crudely drawn, sketches on a steno pad of the proposed “Shower Buddy” device.   He smiles, pleased, then looks up to see Dr. Slocum has fallen asleep and the dental chair is empty. He looks around frantically and gasps when he spots the PATIENT, a five year-old girl, who has climbed halfway out the window.   Dale hurries over to rescue her. EXT. OFFICE BUILDING - LATER Dale’s car pulls up to a sleek, modern building. INT. DALE’S CAR - CONTINUOUS Dale wears a slightly tattered business suit.   He takes out of his pocket the International Venture Partners card that Denny Paul gave them and double checks the address. INT. MR. NAGOPIAN’S OFFICE - LATER Dale sits on a couch in a well-appointed office and finishes his pitch to someone offscreen.   Beside him stands an easel with his Shower Buddy sketch tacked to it. DALE The Shower Buddy eliminates the endless cycle of washing and rinsing and washing and rinsing. It’s not just a time saver.   It’s a life saver.   My team is ready to move on this with or without your help.   But the only way we can do that is with your help. REVERSE ON ALEX NAGOPIAN, 40’s, well dressed, confident and slightly intimidating (think Liam Neeson).   Beside him sits JOYCE, 30’s, an attractive colleague.   Nagopian considers Dale’s pitch for a beat. MR. NAGOPIAN You’re a funny little man, Dale. DALE Go on. MR. NAGOPIAN As far as your idea, this “Shower Buddy”? (beat) I love it.  27.",
      "characters": [],
      "action_text": "DALE Seriously?! MR. NAGOPIAN Yes.   It’s smart, it fills a niche. What do you think, Joyce? JOYCE Sounds like the kind of product we like to fund. MR. NAGOPIAN Of course, our due diligence people will have to make sure no one else has done it. DALE Well, we googled it and didn’t find anything. MR. NAGOPIAN I see.   And why aren’t your partners here with you? DALE They’re very busy men.   We all are. Very busy.   Men. MR. NAGOPIAN But you have power of attorney to sign on their behalf? Dale stares at him for a beat. DALE ...yes. (then) Does this mean we’re in business? MR. NAGOPIAN That depends.   How much do you need to get the Shower Buddy off the ground? DALE Do you have a piece of paper? MR. NAGOPIAN Why? DALE So I can write down the amount and slide it across the table to you. Nagopian looks mildly annoyed.   He nods to Joyce, who tears a piece of paper off a pad and hands it to Dale.  28. DALE (CONT’D) Great.   Thanks.   I’ve always wanted to do this. Dale scribbles on the paper and slides it across the coffee table.   Nagopian looks at it. MR. NAGOPIAN I can’t read this.   Is this a “2”? JOYCE (leaning in) Looks like a “G.” DALE No, that’s a “9.” MR. NAGOPIAN Then I don’t understand this number.   You have two commas next to each other. DALE No, no, that’s not a comma.   That’s also a nine--   you know what?   Let me write it again-- MR. NAGOPIAN Why don’t you just say the number? DALE (tentatively) Nine hundred ninety-nine thousand, nine-hundred, ninety nine dollars? MR. NAGOPIAN Why not an even million? DALE It sounds like less? MR. NAGOPIAN This isn’t the Radio Shack.   A million is fine. DALE (floored) Fuck me. (then, covering) Wonderful. MR. NAGOPIAN Joyce here will bring you to our legal department to sign the necessary paperwork. Nagopian stands and shakes Dale’s hand.  29. MR. NAGOPIAN (CONT’D) Congratulations, Dale.   We look forward to a long and profitable relationship with you and your Shower Buddy. (beat) That name?   Is it a little gay? DALE Nop",
      "dialogue_count": 0,
      "word_count": 6343
    },
    {
      "scene_number": 4,
      "slugline": "INT. OFFICE - CONTINUOUS What was Venture Partners International is now the west coast corporate headquarters of Quiznos Sandwiches. DALE Wait a minute.   What floor is this? NICK Five. DALE This wasn’t here.   This was Nagopian’s office! KURT Are you sure we’re in the right building? DALE Yes!   I pitched Nagopian right here! Dale points to the room we saw earlier, but it’s now occupied by a middle-aged executive, TIM, at a desk. TIM Hi, you must be my five o’clock. DALE You’re not Nagopian. TIM No... Are you my five o’clock? HAGAN (to the guys) You’re telling me you dragged me clear across town to visit some goddamn sandwich company? TIM We also have salads and flatbreads. HAGAN This is some bullshit. DALE (to Tim) How long have you been in this office? TIM Since the building opened last week.   We’re the first tenants. (then, realizing)  62.  (MORE)",
      "characters": [],
      "action_text": "You’re not my five o’clock, are you? Hagan shakes his head and goes to leave.   The guys hurry after him. KURT Wait.   You can’t just leave. HAGAN Watch me. EXT. OFFICE BUILDING - MOMENTS LATER It’s dark now and it’s begun to drizzle as Hagan crosses to his car with the guys on his heels. NICK Detective, if you go, we’re as good as dead. HAGAN Since I’ve known you three, nothing you’ve told me has been true.   Why would I listen to you now? DALE Can’t you at least give us some police protection? HAGAN Protection from what?   Your own foolishness? Hagan climbs into his car. KURT So you’re just going to drive away and leave us riding a cat without a candle?! HAGAN The hell you say? KURT It’s an expression. HAGAN No it isn’t. Hagan slams the door and drives off. NICK I don’t understand.   If Quiznos was the first tenant, how was Nagopian’s office there?  63.  TIM (CONT'D) DALE I know how.   Quiznos is in on this. I didn’t see a single sandwich up there.   And who puts a Quiznos on the fifth floor of an office building--? Kurt puts a hand over Dale’s mouth and keeps it there. KURT (to Nick) What do we do now? NICK Let’s figure it out in the car. There’s no point standing out here in the rain. SMASH CUT TO: INT. KURT’S CAR - MINUTES LATER Kurt drives.   Nick is up front and Dale in the back.   Without the benefit of a windshield or a sunroof, WIND-DRIVEN RAIN soaks the guys as they drive.   Kurt shields his eyes with his hand so he can see.   They yell over the wind. KURT Glad we got out of the rain! The windshield wipers flop ridiculously across the dashboard. NICK Maybe we should all stay together tonight!   Might be safer! DALE Good idea!   But not my place!   I don’t want my pregnant wife to get blown up! NICK Kurt, your apartment is probably the most secure! KURT Okay, we can-- Just then, a wet PLASTIC BAG flies through the open windshield and sticks to Kurt’s face.   The car VEERS wildly as he tries to pull the bag off.   Nick and Dale scream.  64.",
      "dialogue_count": 0,
      "word_count": 521
    },
    {
      "scene_number": 5,
      "slugline": "INT. PARKING GARAGE - LATER Still damp, the guys exit the car and head for the stairs. Kurt absentmindedly locks his windowless car.   BEEP. NICK It’s good that you locked it. They head for the stairs to Kurt’s loft. DALE We’ve got to establish a secure perimeter at your place.   Booby traps, an early warning system... I’m going to need twine, small bells, thumb tacks, mousetraps-- KURT Calm down, Macaulay Culkin.   I’ve got an alarm system. DALE I guess that’ll work. INT. KURT’S LOFT - MOMENTS LATER The door to Kurt’s loft opens and the guys enter. DALE So what exactly will we do if they show up? NICK We’ll figure that out.   The main thing is that we’re ready for them if they do come. Kurt flips on the lights and they all gasp as they see Nagopian’s thug, Ghoukas, sitting on the sofa, pointing a gun at them.   Another armed THUG appears behind them in the hall. DALE Oh god. NICK (to Kurt) I thought you said you had an alarm. KURT I never turn it on. GHOUKAS Let’s go. Ghoukas and the other thug usher them back out.  65.",
      "characters": [],
      "action_text": "KURT Can I at least feed my dog first? GHOUKAS Your dog doesn’t need to be fed anymore. KURT (horrified) You killed my dog?! GHOUKAS I fed him. KURT Oh.   (beat) Thanks. EXT. CONSTRUCTION SITE - NIGHT An SUV pulls up to a construction trailer which is set up beside an unfinished 10-story office building.   Ghoukas and the other thug open the door and escort the guys toward the trailer. Kurt notices a sign reading “Nagopian Construction.” KURT (to the guys) He’s also got a construction company? NICK That’s probably how he set up in that other building before it opened. DALE Wow.   Construction, venture capital, mob boss.   He’s a real Renaissance man. INT. NAGOPIAN’S CONSTRUCTION TRAILER - MOMENTS LATER Nick, Kurt and Dale stand across from Nagopian who sits at a metal desk covered in blueprints.   Ghoukas and the other thug hover nearby. MR. NAGOPIAN So you don’t have my money? NICK It’s just not possible to double a million dollar loan in one month.  66. MR. NAGOPIAN Not normally, no. KURT Come on, man.   There has to be a more reasonable payment plan option. MR. NAGOPIAN Of course there is.   It’s called “The Ghoukas Kills You” plan. Ghoukas snickers. MR. NAGOPIAN (CONT’D) Here’s what I’m thinking... (to Kurt and Nick) On your way home, you two will die in a terrible car accident.   Your bodies will be so badly burned, it will be impossible for forensics to know that you were already dead before the car crashed. KURT Jesus.   NICK So specific. DALE (nervously) What about me? MR. NAGOPIAN You? (considers, then) Auto-erotic asphyxiation. DALE Wha? MR. NAGOPIAN The police will find you hanging from a belt with your cock in your hand. DALE Aw, man!   Can’t I just be in the car with them? MR. NAGOPIAN No. DALE Well, isn’t there another way I can die?  67. MR. NAGOPIAN Fine. (beat) The police will find you with your head in the oven. DALE That’s better. MR. NAGOPIAN ...and your cock in your hand. DALE C’mon! KURT Wait.   You don’t want to kill us. Dale’s wife is pregnan",
      "dialogue_count": 0,
      "word_count": 1426
    },
    {
      "scene_number": 6,
      "slugline": "INT. DIVE BAR - NIGHT The guys sit in their regular booth across from MOTHERFUCKER JONES. MOTHERFUCKER You three clowns just can’t abide by the law, can you? NICK Clearly, some bad decisions were made.   Now can you please help us, Motherfucker Jones? MOTHERFUCKER What’d you call me? NICK Motherfucker Jones.   Isn’t that your name? MOTHERFUCKER Not anymore.   I changed it when I got married. KURT Oh, congratulations. MOTHERFUCKER Thank you. DALE Your wife didn’t like the name “Motherfucker”? MOTHERFUCKER No, bitch.   She didn’t like the name “Jones.”   I took her last name. KURT Really. DALE (to Motherfucker) So what’s your name now? MOTHERFUCKER Motherfucker Quang.   She’s Chinese. The hot kind.   Not the big round head kind. NICK So she was okay with “Motherfucker” but she didn’t like “Jones”?  74.",
      "characters": [],
      "action_text": "MOTHERFUCKER I’m pretty sure she doesn’t know what the word “motherfucker” means. She doesn’t know what a lot of words mean. DALE She sounds nice. KURT But why did you take her last name? MOTHERFUCKER Because I respect women and I believe in equality. KURT That’s fair. MOTHERFUCKER And because she does everything I tell her to do.   No matter how fucked up. DALE (to himself) That took a weird turn. NICK Okay, we don’t have a lot of time here.   So we need to know if you’ll help us, Motherfucker... Quang? MOTHERFUCKER I’ll help you.   But it’ll be fifty large. KURT Here we go. NICK No.   It’s not going to be fifty large.   It’s not going to be anything large.   It’s going to be small. MOTHERFUCKER (sighs, then) All right.   Gimme your watch. NICK This is a Tag Heuer. MOTHERFUCKER I know what it is.  75. KURT Just give it to him, Nick. Nick rolls his eyes and gives Motherfucker the watch. MOTHERFUCKER Thank you.   From here on out, I’m going to be your heist consultant. They all ad lib “no’s” as they usher him out of the booth. EXT. URBAN NEIGHBORHOOD - LATER The guys stand with Motherfucker across from the strip club parking lot. MOTHERFUCKER I don’t know about this.   You didn’t tell me these guys had tattoos on their faces. KURT You have tattoos on your head! MOTHERFUCKER That’s different.   I grow out my hair, I look like everyone else. They grow out their hair, they look even crazier. NICK We can’t turn back now. MOTHERFUCKER I can. He turns and starts to walk away. NICK Wait!   We’ll give you stock in Nickurdale. MOTHERFUCKER (shocked) Nigger what?! NICK/KURT/DALE No, no!/That’s not--/Oh boy. DALE Ni-Kur-Dale.   It’s the name of our company.  76. MOTHERFUCKER Yeah, you gotta change that name. (beat) How much stock? NICK A thousand shares. MOTHERFUCKER Ten thousand. NICK Done. DALE (leaning in to Nick) I didn’t know we have stock. NICK (sotto) We don’t. KURT Okay, here’s how I see this going down.   Motherfucker and I will stage a fight in the club.   As soon as ",
      "dialogue_count": 0,
      "word_count": 1714
    },
    {
      "scene_number": 7,
      "slugline": "INT. STRIP CLUB - CONTINUOUS Oscar goes down the stairs and into the war zone of the club. As he heads for the back door, he is completely unfazed by the violence around him.   He’s like Robert Duvall in “Apocalypse Now,” but instead of explosions, he walks through flying chairs and bottles. EXT. TRUCK - CONTINUOUS The 18-wheeler sits in the lot.   A very faint light can be seen coming from inside the cab. DALE (O.S.) We’re looking for a red wire with a green or yellow stripe. INT. TRUCK CABIN - CONTINUOUS Nick and Dale crouch on the floor of the truck.   Nick holds a handful of wires from under the steering column while Dale follows instruction on his smartphone. NICK I see a blue wire with a yellow stripe-- DALE No!   Don’t touch that one! NICK Calm down.   We’re not defusing a nuclear warhead. DALE Right.   Sorry.   I’m a little jumpy. NICK Here’s a red wire. DALE Okay good.   According to this wiki, that should be the power wire.   We need to connect that to the starter wire. NICK Which is the starter wire? DALE Hang on, it’s loading. (beat) Loading...  84.",
      "characters": [],
      "action_text": "NICK Come on, Dale. DALE I can’t help it.   It’s 3G. (beat) Loading... Suddenly, they hear a door bang shut outside. NICK What was that? Dale peeks up out the window and sees Oscar emerging from the club and looking around suspiciously. DALE (whisper yell) Someone’s coming! NICK Get down! Nick yanks Dale down below the window. EXT. PARKING LOT - CONTINUOUS Oscar notices Dale’s jacket wedged into the bottom of the chain-link fence.   He tosses away his cigarette as he crosses to the back of the truck.   He takes out his keys, unlocks the rear door and opens it.   He checks out the contents of the trailer (we don’t see what’s inside). INT. TRUCK CABIN - CONTINUOUS Nick and Dale huddle together, terrified. DALE What’s he doing back there? NICK Shhh. Just then, they hear the rear door slam shut. CLOSE ON the jumble of exposed wires.   The slight movement of the cabin from the door slamming causes the red wire to make contact with a brown one.   The two wires SPARK and we hear: SFX: Truck ignition starting DALE (hushed) Yes!  85. NICK (hushed) No! EXT. TRUCK - CONTINUOUS Oscar reacts startled to the sound of the truck starting up. OSCAR ¿Qué diablos? He crosses to the driver’s side door and pulls it open revealing... No one. INT. TRUCK CABIN - CONTINUOUS Oscar climbs into the driver’s seat and examines the ignition.   As he does, we REVEAL Nick and Dale cowering in the backseat directly behind Oscar. Oscar is about to turn in their direction when Dale spots a six-pack of Coke on the floor.   Without thinking, he grabs a can and BASHES Oscar over the head with it. OSCAR Augghhh! Oscar crumples over in the front seat.   Nick and Dale exchange a look of shock. NICK Jesus, Dale! Before Dale can reply, Oscar sits up. OSCAR What the fuck was that--?! Dale hits him again.   Coke spritzes out of the dented can. OSCAR (CONT’D) (still conscious) Ow!   My head! CLONK!   Dale slams him again. OSCAR (CONT’D) You son of a-- CLONK! OSCAR (CONT’D) Fuck!  86. Nick and Dale can’t believe ",
      "dialogue_count": 0,
      "word_count": 968
    },
    {
      "scene_number": 8,
      "slugline": "INT. TRUCK CABIN - CONTINUOUS Kurt slams the door shut as he takes a seat behind Nick and Dale. KURT Took you long enough.   Do you have any idea what was going on in there? NICK Do you have any idea what was going on in here?! DALE Where’s Motherfucker? KURT He took off.   Couldn’t take the heat. (then, noticing Oscar) Who’s this gentleman? DALE He’s in the gang.   We knocked him out with cans. KURT No shit?   That’s cool. NICK We should probably tie him up or something. Kurt finds some bungee cords and proceeds to tie Oscar’s hands behind his back. NICK (CONT’D) Are they following us? DALE (looking out the side window) I don’t see anyone. (then) Hey, what do you think is in this truck anyway? NICK No idea.   Could be anything. Drugs, weapons... KURT Sex slaves. DALE I hope it’s not sex slaves.  89.",
      "characters": [],
      "action_text": "NICK It’s not our business.   The less we know the better. (beat) I’ll go easier on the turns in case it’s sex slaves. SFX: Dale’s cell phone rings DALE (into phone) Hey, honey.   What’s up? INTERCUT WITH: INT. DALE’S HOUSE - SAME TIME Flushed and out of breath, Stacy is on all fours on the floor of the kitchen. STACY (into speaker phone) Dale?!   Where are you?!   It’s four in the morning. DALE Uh... got stuck at the office. STACY Well, it’s time! DALE Time for what, hon? STACY Time for three babies to come out of my body! DALE Right now?   Are you sure?! She glances over at a huge puddle of water on the floor next to her. STACY Pretty sure. (groans) Ohhhhh god! DALE Breathe, Stacy!   Are you dilated? Is your vagina dilated?! Kurt and Nick exchange a look.  90. STACY I can’t see my vagina, Dale. DALE Right.   Okay.   We’ll be right there!   Just hang on! He hangs up. DALE (CONT’D) We’ve got to take Stacy to the hospital. NICK What? DALE She’s in labor.   We’ve got to pick her up. KURT In a stolen truck full of sex slaves? NICK Not to mention the man with the dragon tattoo back there. KURT Can’t she call a cab? DALE (steely) You listen to me.   My wife and babies are the most important things in the world to me.   And nothing’s going to stop me from being there for them.   So you either drive this fucking rig to my house and pick up Stacy or I will. He holds a Coke can and glares at Nick threateningly.   Nick glances over at Kurt who shrugs. EXT. STREET - CONTINUOUS Nick takes a hard left.   The trailer SCRAPES against a parked car, nearly totalling it. EXT. DALE’S HOUSE - MINUTES LATER Dale and Kurt carefully help Stacy to the truck.  91. STACY What is this?   What are you driving? DALE It’s a truck. (thinking fast) It’s the Nickurdale company truck. INT. TRUCK CABIN - MOMENTS LATER Dale helps Stacy recline in the back seat as Kurt climbs in the front and Nick pulls away from the curb. NICK Hey, Stacy.   How you feeling? STACY Hey Nick.   I didn’t know you knew how",
      "dialogue_count": 0,
      "word_count": 2130
    },
    {
      "scene_number": 9,
      "slugline": "EXT. TRUCK - CONTINUOUS Nick JAMS ON the brakes and the truck SQUEALS to a stop. INT. TRUCK CABIN - CONTINUOUS NICK (to Oscar) You’re the gang leader?! OSCAR What do you think this fucking tattoo on my forehead says? DALE Jeffy.   Isn’t your name Jeffy? OSCAR  Jefe.   It means “boss”!   Didn’t any of you take Spanish in school? DALE I took French. KURT (to Nick and Dale) Why did you guys kidnap the gang leader?! NICK He got in the truck.   We didn’t have a choice. DALE What do we do with him? OSCAR You let me go. KURT We’re not letting you go. (then, quietly to Nick) Should we let him go? Dale leans forward to listen. NICK I don’t know.   If we take him to Nagopian he’ll probably kill him. KURT Yeah.   But if we let him out, he’ll kill us. DALE How?   His hands are tied.  102.",
      "characters": [],
      "action_text": "NICK They won’t be tied forever, Dale. (then) Maybe we can make a deal with him. We let him go and Nagopian doesn’t kill him.   And in return for saving his life, he lets us off the hook. KURT Seems reasonable. (turning to Oscar) How does that sound, Jeffy? They all look to see the rear truck door is open and Oscar is gone. KURT (CONT’D) Where did he go?! EXT. TRUCK - CONTINUOUS Dale and Kurt get out of the truck and look around. DALE He’s gone. (calling) Jeffy?! KURT You think he’s going to come back if you call him? NICK (O.S.) Forget about him.   The sun is coming up.   Let’s get this damn truck back. DALE How did he open the door with his hands tied?   He’s like a Dominican ninja.   A Dominja. We hear horrible GRINDING SOUNDS from the transmission and Kurt and Dale climb in as the truck jerks forward. EXT. CONSTRUCTION SITE - DAWN The sun is just rising as the 18-wheeler pulls up to Nagopian’s office trailer.   Nagopian and Ghoukas exit the trailer as Nick, Kurt and Dale step down from the truck. MR. NAGOPIAN You actually made it?   No fucking way.  103. NICK Yes, fucking way.   Here’s your truck.   Are we done now? MR. NAGOPIAN One moment.   Ghoukas. Ghoukas crosses to the back of the truck. MR. NAGOPIAN (CONT’D) How did you get past the Dominicans? KURT You ever see “Oceans 11”? MR. NAGOPIAN With Catherine Zeta-Jones? DALE (frustrated) No. Ghoukas returns with a Dora the Explorer doll and hands it to Nagopian. DALE (CONT’D) What is that? NICK That’s what was in the truck. KURT (to Nagopian) Why did you need a bunch of dolls so badly? Nagopian yanks the head off the doll and pulls out a baggie filled with powder. KURT (CONT’D) Ah.   Right.   Drugs of some sort. That makes more sense. NICK (leaning in) We gave them to that cop’s daughter. KURT (sotto) Ooh.   Probably shouldn’t have, huh? MR. NAGOPIAN I have to admit, I’m impressed.   I didn’t think you mongoloids would pull it off.  104. DALE Thank you. NICK So, are we... good? MR. NAGOPIAN Well, since you did b",
      "dialogue_count": 0,
      "word_count": 3141
    },
    {
      "scene_number": 10,
      "slugline": "INT. NICK’S SHOWER - DAY ANGLE ON THE FLOOR of the shower where the Shower Buddy has left a thick and DANGEROUSLY SLIPPERY accumulation of soap, shampoo and conditioner.   Nick shifts his weight and his feet SLIP out from under him.   He goes down hard. INT. KURT’S SHOWER - DAY Kurt turns and also falls on his ass, pulling the shower curtain down with him. INT. DALE’S SHOWER - DAY Dale, still holding his three babies, slips.   From outside the shower, we hear him hit the floor, followed by the sound of THREE BABIES CRYING. INT. MOTHERFUCKER’S SHOWER - DAY Motherfucker and his wife are already on the floor, struggling to stand but having no luck in the slippery mess. INT. PRISON SHOWER - DAY It’s total chaos as naked INMATES slip and slide on the cement floor, trying desperately to get their footing.   A couple GUARDS try to help, but wind up falling into the writhing mass of nude criminals. FADE OUT. THE END  119.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 167
    }
  ]
}