{
  "slug": "how-to-build-a-girl-2020",
  "title": "how to build a girl",
  "genre": "drama",
  "format": "film",
  "scenes_count": 14,
  "characters_count": 0,
  "characters": [],
  "total_words": 18582,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. STUDIO - NIGHT 12   12 Johanna steps onto set and is greeted by Wilko. She’s so panicky she can’t hear anything. We can’t hear anything - like Benjamin underwater in   The Graduate.   We just see Wilko’s mouth opening and closing: WILKO ... Johanna Morrigan, from the Warstones Estate, in Wolverhampton! Her poem was inspired by her family’s   unusual   business - breeding Border Collie dogs! Take it away with tonight’s last “Poem About Friendship”, Johanna! Johanna stares at the poem for a moment. Total silence. INT. TV STUDIO - NIGHT 13   13 She starts - insanely nervous, fluffing lines everywhere. JOHANNA “My Best Friend. By Johanna Morrigan. My father sells your babies/You howl when you’re alone/We do not know who your parents are/And all you want to do is “bone”. Wilko looks nervous. JOHANNA (CONT’D) For my best friend is Bianca - my dog!/Despite her mental health seeming fragile/And when it comes to scaring off assailants, or yobs/She has proven less than agile/You cannot hug me with your paws/I know Bianca/I’ve tried/Dog anatomy lacks rotator cuffs/You can’t open your forelegs that wide/But Bianca, I know you can always hug me ... hug me   with your eyes. .. Sorry, sorry - I’m so nervous. Pat is standing off-camera, watching in horror. Puts his head in his hands. WILKO Don’t worry - knowing one million people are watching you   is   nerve- wracking!  14.",
      "characters": [],
      "action_text": "JOHANNA I’m just... mad anyway, to be honest, Alan. That’s what everyone says. Just a mad lonely teenager, and her dog. INT. MORRIGAN FRONT ROOM - NIGHT 14   14 Whole family, including Bianca and the puppies, in front of the TV - agonised watching her. INT. TV STUDIO - NIGHT 15   15 JOHANNA But we’re like... Shaggy, and Scooby Doo. Best friends forever, against the world! Wilko still says nothing. Johanna starts to gabble JOHANNA (CONT’D) Ri ruv my rog! Revverybody ruvs my rog. Another pause. Johanna now out of her mind with panic. JOHANNA (CONT’D) Scooby Dooby Do! Scooby Dooby Dooo! There’s a pause. Wilko collects himself, and then turns to the camera, opening an envelope. WILKO And so to the winner - Lee Veltman, from Trysull. INT. VW VAN - NIGHT 16   16 Johanna sits slumped, horrified. Pat is clearly wrestling with how to break the silence. With what advice to give. Finally: PAT (almost kindly) The thing is, Johanna - your name’s “Morrigan.” Not “Twat.” JOHANNA (whispering) Morrigan - not twat. Morrigan - not twat.  15.",
      "dialogue_count": 0,
      "word_count": 411
    },
    {
      "scene_number": 2,
      "slugline": "INT. JOHANNA AND KRISSI’S BEDROOM - NIGHT 17   17 Johanna lying in bed, wide awake, staring up at the ceiling. Sleepless. Biting her fist. JOHANNA (whispering) Morrigan - not Twat. Morrigan - not Twat. EXT. STREET OUTSIDE - DAY 18   18 Johanna, Krissi and Lupin are walking to school. Johanna drags behind, miserable and panicked looking. JOHANNA Oh god. Oh god. EXT. SCHOOL PLAYGROUND - THE NEXT DAY 19   19 Krissi and Johanna hover by the school gates, too scared to go in. Johanna - black circles under her eyes - terrified. KRISSI Okay - we’re going to keep a tight formation, and you’re going to remember Krissi’s Crisis Mantra. JOHANNA “Everyone can suck a big bag of dicks.” KRISSI Good girl. Come on. Krissi puts his hood up. They walk forward. No-one seems to notice them. JOHANNA Maybe no-one saw it? Then, one by one, the kids in the playground turn around and see her - stare. Finally - AN EXPLOSION OF LAUGHTER. KIDS Scooby Dooby Dooooooo! Krissi, angrily, drags Johanna into school. KRISSI Fuck them all. WHOLE PLAYGROUND Scooby Dooby Doooooo!  16.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 185
    },
    {
      "scene_number": 3,
      "slugline": "EXT. STREET OUTSIDE MORRIGAN HOUSE - DAY 20   20 Johanna, Krissi and Lupin come up the road. A group of four or five yobs are following behind them, throwing things at them. KARL BODEN You want Scooby Snacks? Here’s your Scooby Snacks! The gravel hits their back. They draw level with the house - Pat is on the doorstep, with Bianca. Sees what’s happening. Stares at the kids. PAT Is that Karl Boden? He is Karl Boden. PAT (CONT’D) Karl Boden! I fucked your mum. ‘72. Send her my regards. This statement scares and discombobulates the gang. They melt away. Pat looks at Johanna - pity. PAT (CONT’D) Come inside, babba. Your tea’s ready. Your mum’s garnishing the toast with beans. A smart-looking car pulls up outside the house. No-one notices. A woman gets out of the smart-looking car - approaches Pat. SMART WOMAN Pat Morrigan - you have puppies for sale? PAT Famous pups - as immortalised in poetry on Midlands Today, yes! He does the thumbs-up to Johanna. Johanna does them back. The woman brings out her ID. SMART WOMAN I’m from the DSS - we’re investigating allegations you’ve been illegally claiming disability benefit whilst breeding Border Collie dogs. Johanna looks incredibly guilty.  17.",
      "characters": [],
      "action_text": "PAT Not me, love. Bianca barks. At her call, dozens of puppies start streaming out of the house. Pat stares the SMART WOMAN in the eye. PAT (CONT’D) Rats, though. Big rat problem here. She stares at him. The jig is up. INT/EXT. OUTSIDE MORRIGAN HOUSE - DAY 21   21 Two men are loading the Morrigan’s television into a van, while the family watch on, unhappy. Pat is signing documents, looking pissed off. Angie is leaning comatose-like, in the doorframe. LUPIN They’re taking our mother! ANGIE I’m happy to go instead. Everyone glares at Johanna. JOHANNA I’m so sorry. INT. MORRIGAN DINING-ROOM - DAY 22   22 Everyone sitting around the table. There is very, very little food on the table. Everyone furious with Johanna. It’s very quiet. Angie comes in with a big dish of sausages. ANGIE Eat up. What there   is.   Lupin - only one slice of bread. ONE SAUSAGE, Krissi. I don’t own a frigging sausage tree. Johanna looks at everyone, for a minute. Absolutely sick with guilt. JOHANNA I’m not hungry, thanks. She leaves the room. Krissi spears her sausage from the serving plate. KRISSI Where God closes a door for Johanna, he opens a sausage for me.  18.",
      "dialogue_count": 0,
      "word_count": 409
    },
    {
      "scene_number": 4,
      "slugline": "INT. JOHANNA AND KRISSI’S BEDROOM - DAY 23   23 Johanna is lying under the bed, staring up at the mattress. JOHANNA I shall feast only on my misery. Johanna takes a pot of jam and a spoon and starts eating it, awkwardly, under the bed. Spoon sideways into her mouth. JOHANNA (CONT’D) ...and jam. This is my   thinking  jam. I need the jam, to think. She stares up at the underside of the bed. JOHANNA (CONT’D) What have I done? What have I done? I’ve brought ruin upon our family.  I think I’m dying.  FREUD You are not dying, Johanna. This is called “anxiety”. Cortisol is streaming through your body, leading to physical symptoms of fear. JOHANNA Will jam make it better? FREUD No. Jam will not make it better. I’m afraid you must just accept it. Anxiety is part of the human condition. JOHANNA The thing is, I don’t think my main problem   is   anxiety, Mr Freud. I just need money. Money for the family. Bitch gotta pay rent. DONNA SUMMER (singing, with full orchestration) “She works hard for the money! She works hard for the money!” The rest of the God Wall nods. JOHANNA But I am, now, a failed artist. And when you’re a failed artist, there’s only one thing you can do. You have to die.  19.",
      "characters": [],
      "action_text": "GOD WALL GASP! No! You have so much to live for! SYLVIA PLATH I’ve got some good tips on how to do it. ELIZABETH TAYLOR Not now, Sylvia Plath. Krissi busts into the room. The God Wall becomes silent. KRISSI Whatcha doing? JOHANNA Working out how to die. KRISSI Fair enough. JOHANNA Ask me why. KRISSI I know why. I would want to die, if I had shamed myself, and plunged my family into poverty. It’s fair enough. I would have advised it myself. JOHANNA Maybe I could make the ultimate sacrifice - cut my hair off, like Jo March, and sell it. KRISSI Yeah - not sure Cash Convertors have a Hair Department, Johanna. He sighs. Chucks her a copy of   D&ME.  KRISSI (CONT’D) Stop moping. Try this. They’re looking for writers. Under the bed, Johanna reads out the advert. JOHANNA “Live and breathe music? Know your KLF from your EMF? Worked out what Don McClean’s “American Pie” actually means?   D&ME   are hiring hip young gunslingers. Show us what you’ve got.” I am none of those things.   You   should do this.  20. Krissi is sticking his fanzine together. He waves a copy at her. KRISSI I’m not a corporate sell-out whore. Those guys only write about what they think is cool. I write about what I love. It just happens that everything I love   is   cool. Johanna’s not listening. She scrambles out from under the bed, reading a review in D&ME. JOHANNA Ha - a   ten year old   could be a rock critic! I just need some modern rock, to critique. She goes over to Krissi’s side of the room - hundreds and hundreds of cool albums by cool bands. There are intricate trip-wires, and a bell. She tries to take a KLF record, and a bell rings. KRISSI TOUCH THAT AND DIE! Back on her side of the room, Johanna looks at her tiny collection of cassettes. Crowded House, ABBA, the soundtrack to “The Muppet Movie.” Nigel Kennedy’s “The Four Seasons.” It’s not a cool collection. She takes a cassette out: MUSIC: Tomorrow, OST, “ANNIE”. Krissi laughs. KRISSI (CONT’D) My God. JOHANNA This is a   classic.  Johanna ma",
      "dialogue_count": 0,
      "word_count": 847
    },
    {
      "scene_number": 5,
      "slugline": "INT. HALLWAY - DAY 27   27 Music: “Tomorrow”. Angie holding out the phone to Johanna. She takes it, listens to what someone is saying - Johanna reaction: OH MY GOD! AMAZING NEWS! She mouths to Krissi, “interview”, he shrugs. She points to herself, miming, “sell-out corporate whore” - he gives her the thumbs- up. MUSIC: slam-cut from “tomorrow” to “Hobo Humpin’ Slobo Babe” - Whale. EXT. WOLVERHAMPTON TOWN CENTRE - DAY 28   28 Johanna, rucksack on back, RUNNING, super-fast through the town centre. Kinetic, exciting. EXT. WOLVERHAMPTON TRAIN STATION - DAY 29   29 Johanna, running flat out. Hurry, hurry, she’s late. INT. TRAIN - DAY 30   30 The good people of Wolverhampton fill the carriage - women passing around a bottle of cherry brandy. A couple of old fellas with Wolves scarves on and thermos flask. Indian family cracking out six thousands Tupperware containers, having lunch. Johanna looks at her reflection in the train window, and pinches her cheeks, to try and look beautiful for London. Rehearsing “grown-up” expressions. INT. LONDON STATION - DAY 31   31 Johanna gets off the train - taking in the hugeness of London. London - all hard lines, monochrome, and massive scale. Business men and glamorous women. Hustle. EXT. BRIDGE - DAY 32   32 Johanna passes buskers in mariachi outfits are playing the accordion, and singing. She applauds wildly - this is AMAZING! We pull back to see passersby bored/annoyed by the buskers, because they are Londoners. Johanna - loving everything -   keeps clapping.  23.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 251
    },
    {
      "scene_number": 6,
      "slugline": "EXT. D&ME BUILDING - DAY 33   33 The MUSIC comes to an end as we find Johanna outside the CP UK skyscraper. Vast edifice. And then, at the bottom of the tower - a girl. INT. LIFT - DAY 34   34 Full of guys in suits. Johanna stands amongst them, a foot shorter than everyone else. INT. CORRIDOR - DAY 35   35 Johanna comes along. MUFFLED MUSIC is audible from the end of the corridor. There’s a glass door plastered with POSTERS and STICKERS. A sign reads ‘ DISC & MUSIC ECHO ’. Another reads ‘WHOEVER YOU ARE - FUCK OFF.’ A U2 7” nailed to the door. Johanna peers through the glass at a lot of MEN. AGAIN. Cigarette smoke, talking, laughing. Scary looking adults in black leather jackets. Standing with their legs apart, like Lord Flashheart. MEN. INT. D&ME - DAY 36   36 Johanna walks in. The men ignore her for a minute - and then DERBY (28) looks up. DERBY Just 17 is on the 23rd floor, love. JOHANNA Thank you. But no. I am - I am Johanna Morrigan? I have... an interview? For the job? “hot young gunslinger”? DERBY looks her up and down - joined by the others. DERBY Fucking hell. ANDY ROCK I know. KENNY The kid manifests! DERBY There goes a tenner. He hands over ten pounds to ANDY ROCK, who kisses it, and puts it in his pocket.  24.",
      "characters": [],
      "action_text": "DERBY (CONT’D) We didn’t think you were... real, love. JOHANNA What? DERBY Sixteen-year-old girl reviewing the soundtrack to   Annie.   We thought it was the dicks at   NME,   winding us up. Well, live and learn. JOHANNA I am very much corporeal. DERBY So I see. He sighs, and turns away. JOHANNA But - but did you think my writing was... good? DERBY Yeah. Funny. Made us laugh. But it’s not really - He gestures around the room. DERBY (CONT’D) ...us. PAUSE. JOHANNA So - I go? DERBY I guess. Here - you’ve come a long way. Have a free t-shirt. He hands her a t-shirt. It says “Fast Piss Blues - Come” on it. It’s too small. JOHANNA Thank you? She backs out of the room - completely humiliated. INT. BATHROOM - MOMENTS LATER 37   37 Johanna is staring at herself in the mirror, gripping the sink tightly, having a full-on panic attack. She splashes water onto her face, to cool down - realises, too late, it’s fucking up her eyeliner, which runs down her face.  25. JOHANNA I was right the first time. I am not cool. I should just die. She crawls under the counter-top, and sits behind the bin. Sighs. Stares up at the underside of the countertop. A big girl stuck in a small space again. BJORK (O.S.) Do you know what cool people are, Johanna? Johanna looks up - sees that a poster of Bjork on the wall has animated. Bjork is standing in front of an amazing waterfall, in Iceland. Snow blows out of the poster, filling the room. BJORK (CONT’D) “Cool” like the people in that room? Cool people are the worst. They don’t dance, they wear uncomfortable little trousers, and they are constantly misquoting Kerouac. Have you read   On The Road,  Johanna ?  JOHANNA No. BJORK Don’t bother. It’s a very long book about a man getting a lift. Do you know what a good book is? JOHANNA No. BJORK  Little House on The Prairie.   She makes her own knickers, and her dad shoots a bear.   That’s   a story. Come on. Give your face a rinse, draw your eyes back on, and   dance  back into that office. JOHANNA I’m to",
      "dialogue_count": 0,
      "word_count": 1468
    },
    {
      "scene_number": 7,
      "slugline": "EXT. STREET OUTSIDE SCHOOL - DAY 44   44 Track down to a pair of battered but fabulous Doc Martin boots as Johanna leaves. INT. BATHROOM - DAY 45   45 Carnage - the basin is covered in red hair-dye. Johanna is drying her hair, the towel soaked red. Angie comes into the bathroom, carrying a plate with fried egg and chips on it, and a Georgette Heyer novel. Pulls down jeans, sits down on the toilet, starts eating egg and chips and reading her novel, whilst peeing. ANGIE (weakly) Out. This is my “me time.” I’ve got - She looks at her watch. ANGIE (CONT’D) - approximately six and a half minutes before something starts screaming for me. And if this - She gestures to the dye everywhere. ANGIE (CONT’D) - isn’t all gone soon, I will... I will... She closes her eyes, and grinds to a halt. JOHANNA Mum? Mum? There’s a snore. She has fallen asleep mid-sentence. Johanna gently covers her with a towel, steals a chip, and tip-toes out. INT. JOHANNA AND KRISSI’S BEDROOM - DAY 46   46 Johanna is kneeling on the floor. Picks up a brown lipstick - starts putting it on. The GOD WALL animates - Elizabeth Taylor clearly distressed by Johanna’s choice of lipstick. ELIZABETH TAYLOR Earth-mouth? You are not a worm. Under Taylor’s guidance, Johanna starts plucking her eyebrows. It’s painful. She puts the tweezers down, crying -  31.",
      "characters": [],
      "action_text": "BOUDICCA Coward! Pain is facing down the Roman army! Not removing a single hair. Johanna starts plucking again, then applying eyeliner. She doesn’t know how to do it. Looks like she’s going to give in. MARIA VON TRAPP (pointing to Cleopatra). Observe the world’s greatest eyeline! A drawing of Cleopatra - with heavy eyeliner - awakens. Johanna looks at it, carefully, and then starts applying eyeliner, looking exactly like Cleopatra. Awesome. We see her with her back to us, looking in the mirror. INT. FRONT ROOM - DAY 47   47 Johanna walks in. Top hat, cherry-red hair, black velvet frock-coat, frilly blouse, shorts, tights, Doc Marten boots, winged black eyeliner, white foundation. She is made. TA- DAH!!!!! Family reaction: shock and confusion. KRISSI Good God, it’s the Child-Catcher. Lupin cries. JOHANNA No. Johanna Morrigan is dead. This - this is the   legendary   Dolly Wilde. INT. VW VAN - NIGHT 48   48 Pat driving, Johanna beside him. Pat’s demo plays - “Dropping Bombs”, but a new rave-y version. Pat is dancing to it. Johanna dancing with him, gleefully. Neither of them really know “rave moves.” PAT You like this one? I’ve done it rave-style. I’m “on one” now, love. I’m BACK! Next Live Aid, I’m getting the Phil Collins slot. Both of them. Three. Fuck it. I’ll do Africa, too. JOHANNA DAY-O!  32. The demo finishes - Pat puts in another tape: Dire Straits, “Brothers In Arms.” Pat pulls over, into a lay-by, and they look down, across the valley, over the deserted industrial landscape. PAT Look at that. The Midlands. “The Workshop of the World.” Or it used to be... They look down the valley: silent, dark. Empty factories. PAT (CONT’D) When I was your age, that valley was on fire. Foundries, forges, ironworks. The potteries. The whole place glowed. Sheets of sparks, fifty foot high. The fires never went out. Ten hours a day, shoveling coal. All of this was for men. He looks down into the valley - empty now. PAT (CONT’D) If you want to come home a hero, either become a ",
      "dialogue_count": 0,
      "word_count": 4789
    },
    {
      "scene_number": 8,
      "slugline": "INT. PLANE - DAY 75   75 Johanna getting on the plane, sitting in her seat, in a daze. EXT. OUTSIDE MORRIGAN HOUSE - DAY 76   76 Johanna, staring at her house, in a trance-like state. Johanna rings on the doorbell with her head - her hands full. Pat answers, in too-small pink dressing gown. PAT You alright? JOHANNA I am irreversibly in love. It’s like being on fire. PAT Arrrr, nice one. I’ve got a gammon on the go if you wanna slice? Johanna passes Pat the thing she has carried back with her from Dublin - a pint of Guinness, wrapped in clingfilm. JOHANNA I brought you a proper pint! From Dublin! Like you always wanted! Pat looks at her, takes off the clingfilm, takes a sip. PAT Christ, that’s flat. INT. JOHANNA AND KRISSI’S BEDROOM - NIGHT 77   77 Johanna is constructing a shrine to John Kite in a big cardboard box. She’s filled it with glossy PR 8x10 shots of Kite, and three of his cigarette-stubs sit in the centre. His album is glued to the turntable. She puts the empty packet of nuts onto her table, next to the typewriter. Touches them, reverently. JOHANNA (sighing) John’s nuts. She stares at the paper in her typewriter. JOHANNA (CONT’D) I don’t know what to write! The God Wall animates.  53.",
      "characters": [],
      "action_text": "EMILY BRONTE (on a very wuthering moor, in comically pissing rain) The ecstatic torture of love! KARL MARX The socio-economic conditions that lead to the dominance of working- class rock ’n’ roll! All hail the proletariat! JO MARCH Just... write from the heart, Johanna, into the bank-balance. Johanna nods, and starts typing, whilst speaking out loud. JOHANNA “John Kite interview, Dublin. By Dolly Wilde. Some people aren’t just people, but a place - a whole world. Sometimes, you find someone you could just... live inside for the rest of your life. She stops again. Sighs. Stares at a picture of him as we go into a dream sequence.... INT. VENUE - NIGHT 78   78 Dream sequence John Kite is on stage - pinned in the spotlight - performing. A gospel choir behind him. Johanna at the side of the stage. Kite holds his hands out to her. The room is silent - reverent. She walks to the centre stage, where Kite looks at her with utter love. Pulls her close. Inhales the top of her head. She looks up. He starts to kiss her - the most perfect kiss ever kissed. The audience start throwing flowers at the stage - as they hit the spotlight, they burst into a thousand petals. JOHANNA You   - are the whole world. She looks out into the audience - they hold their hands out to her. KITE Jump, baby. Let yourself go. We want you.  54. She leaps into the crowd. As she crowd-surfs, they all touch her, lovingly, stroking her face, her legs, her breasts. She looks orgasmic. All, save one - as she turns to her left, there is a thunder- faced KRISSI, staring at her. KRISSI Johanna. JOHANNA Go away. She tries to lose herself in the crowd’s touch again. Turns to her right - another Krissi. KRISSI JOHANNA. JOHANNA Go   away.  Overhead, the PA comes into life. KRISSI (on PA) JOHANNA! LET ME IN. JOHANNA! INT. JOHANNA AND KRISSI’S BEDROOM - NIGHT 79   79 Johanna is draped on her chair, masturbating, with a dreamy look on her face. Krissi is banging on the door. KRISSI (O.S) Let me in! I’ve just had a flir",
      "dialogue_count": 0,
      "word_count": 2377
    },
    {
      "scene_number": 9,
      "slugline": "INT. GIG - NIGHT 100   100 A Sick Joy esque, thrashy, indie band are playing. Johanna waltzes in past the doorman - Five hot boys come over to talk to her, ask for autographs. Johanna is beaming. She’s made it! EXT. OUTSIDE GIG - NIGHT 101   101 Johanna pressing a hot boy up against a wall - kissing him hard. He finally breaks free. HOT BOY Do you want to - JOHANNA Yes. HOT BOY But I didn’t - JOHANNA Yes. Now. Absolutely. She takes him by the hand, and leads him away. The MUSIC ENDS INT. JOHANNA AND KRISSI’S BEDROOM - NIGHT 102   102 Krissi and Johanna are in bed - on either side of the partition wall. Johanna - in a theatrical whisper - mid-flow. JOHANNA .... and so, you don’t need to worry about that hymen any more, Krissi! It’s gone! I’ve literally taken one for the team! The Team of Sex! I am post-virginity! And turns out - I’m really good at it! FLASHBACK: INT. ON BED - NIGHT 103   103 Hot groupie boy bursts out of wardrobe, naked, banging his fists on his chest, a la Kong, as Johanna lies on the bed, eating crisps, and smiling appreciatively.  64.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 205
    },
    {
      "scene_number": 10,
      "slugline": "INT. JOHANNA AND KRISSI’S BEDROOM - NIGHT 104   104 She does a special knock on the partition door - then lifts up a photo of David Bowie. There is a hole underneath it. We see Krissi’s angry eye appear at it. JOHANNA  Everyone   wants a piece of Dolly Wilde. And God wisely made enough to go around. So I am entering my inevitable period of intense sexual experimentation. Krissi puts his hands over his ears. And gets back into bed. JOHANNA (CONT’D) As it turns out, I’m very broad- minded. I’ve done it with someone from West Bromwich. INT. ON BED - NIGHT 105   105 West Brom poster on the wall above the bed Johanna is lying in. He’s wearing a West Brom top. INT. JOHANNA AND KRISSI’S BEDROOM - NIGHT 106   106 JOHANNA I’ve done it with a freaky foot guy. INT. ON BED - NIGHT 107   107 Johanna sitting on edge of bed, as a man takes off her Doc Martens, and sniffs them, erotically. INT. JOHANNA AND KRISSI’S BEDROOM - NIGHT 108   108 JOHANNA I did it with a man who faints every time he sees a nipple. INT. ON BED - NIGHT 109   109 Johanna, back to us, takes off her bra. The man walking towards us hits the deck, hard. INT. JOHANNA AND KRISSI’S BEDROOM   - NIGHT 110   110 JOHANNA So, as you can tell, my sexual tastes are admirably varied. (MORE)  65.",
      "characters": [],
      "action_text": "My genitals are basically the United Nations. And just last night - FLASHBACK: INT. ON BED - NIGHT 111   111 Al is kneeling on the bed, with his back to us. Johanna is kneeling, facing us. Al is undoing his jeans. Johanna looks excited. JOHANNA (V.O.) - I encountered something that I didn’t think was possible. Al undoes his jeans, and his penis comes out with a definite “THUMP” sound. JOHANNA (V.O.) A penis that was   too big!  Johanna’s face - alarm. Followed by cheerful resolve. JOHANNA (V.O.) Luckily, I’m a quick learner - Johanna lies down, and Al climbs on top. They start having sex. She gets up, and turns over, onto all fours. JOHANNA (V.O.) Turns out - in “doggy”, you can essentially keep... crawling away from the penis. Al roars, and comes. INT. JOHANNA AND KRISSI’S BEDROOM - NIGHT 112   112 On his side of the partition, Krissi gets out of bed. JOHANNA (her eye still peering through the hole) Kris? Kris? You can share some of  your   sexual experiences, such as they may be. Tell me about John Kellog’s anaemia! Krissi flicks a v-sign. KRISSI You, need to be more repressed. He walks out, slamming the door. JOHANNA (CONT'D)  66. Johanna sighs and turns to the God Wall. JOHANNA So, anyway, between us girls, in all of this, the only thing I haven’t learned yet is this: how does a man make you come? It hasn’t happened yet. Donna Summer and Elizabeth Taylor are laughing. All the men look a bit uncomfortable. ELIZABETH TAYLOR You asked the big question! HAHAHAH! CHARLOTTE BRONTE Well,   we   managed without. EMILY BRONTE I just walked across a moor, wuthering. DONNA SUMMER You’ve got to love to love   you,  baby. Johanna looks confused. Elizabeth Taylor translates. ELIZABETH TAYLOR You just have to have a little fiddle with yourself, darling. SYLVIA PLATH And then you don’t feel so bad! Maria Von Trapp nods enthusiastically. Johanna looks relieved. JOHANNA That’s exactly what I did! She puts her two wanking fingers up, and does “gun fingers” at them. They cheer. INT",
      "dialogue_count": 0,
      "word_count": 2882
    },
    {
      "scene_number": 11,
      "slugline": "INT. FRONT ROOM - DAY 128   128 Family war council. Pat, Krissi and Angie are sitting on the sofa. Angie is going apeshit at Johanna. ANGIE What is this? What is going on? Six months ago, you were a happy, quiet girl actually being useful around the house. Now I’ve got   him -  She gestures to Pat. ANGIE (CONT’D) - telling me you’ve cock-blocked his career - PAT I never said - ANGIE -   him   - She gestures to Krissi ANGIE (CONT’D) - in tears - KRISSI To be clear, they were intellectually-justified tears of  rage -  ANGIE - saying you’ve treated him like a... a... KRISSI - indolent hobbyist - ANGIE - and now your teacher on the phone saying you’ve “resigned”. So my question to you, Johanna, is: when did you lose your fucking mind? JOHANNA Hmmmm. Let me think. I guess it was around the time I stopped being your daughter, and became your rent. The same time, I like to think, you all became absolutely disqualified from criticising me. PAT We’re your parents. We can always criticise you.  79.",
      "characters": [],
      "action_text": "JOHANNA Not if   you -  She points to Angie, with her cane. JOHANNA (CONT’D) - aren’t actually doing any parenting of me, and   you -  She points to Pat with her cane. JOHANNA (CONT’D) - are selling cars I bought, in order to fund Springtime For Hitler: A Jazz Odyssey. Pause. She holds her hand up to her ear. JOHANNA (CONT’D) Oh my God! And there’s   still   no-one saying “Sorry Johanna,” or “Well done, Johanna,” or “Things must have been hard for you, Johanna,” or “Thank you, Johanna.” Do you think all this is normal? Do you think   I’m   normal? Well it’s not! None of this is normal! She lights a fag. Smokes angrily. PAT Now, now - I   invested   that money, in our future ... JOHANNA It’s not our future! You’re not the future! Don’t you understand? Here’s what happened when I played them your record dad - because I have tried,   so hard,   to help you: They   shot   it, Dad. They laughed at it, first, obviously - and then they threw it off the roof and   shot  it. Pat shrugs, cold. Johanna is becoming furious now. JOHANNA (CONT’D) Don’t you get it? I’m the future! I’m paying for everything! I’M THE DADDY NOW! ANGIE Johanna, just to get things clear, how much do we owe you for crucifying your dad just then? What’s your usual word-rate?  80. She takes twenty quid out of her pocket, and gives it to Johanna. ANGIE (CONT’D) Will this cover it? Johanna looks at the money in her hand for a minute. Trying to stay icy-calm. JOHANNA Well, mum, the good news is that, for this kind of money, you get a  whole lot more copy!   So here’s my review of this family. Dad: deluded, draining family of cash. Krissi: jealous sexually-repressed Salieri envying the Mozart with the big hair. Mum: overly-pregnant woman spirals into emotional unavailability due to undiagnosed post-natal depression. ONE STAR, Morrigan family - I give you all ONE STAR. I quit school, I quit this family, and I quit this whole life. I’m gone! I’m going solo! Let’s see how you manage without me, Ringo, Ringo and ",
      "dialogue_count": 0,
      "word_count": 2380
    },
    {
      "scene_number": 12,
      "slugline": "INT. HOSPITAL CHILDREN’S WARD - DAY 138   138 Music: “Family Coach”, by The Lilac Time. Close on Johanna’s face - smudged eyeliner, glitter still on her face. Pulling back, we see her head is bandaged, and her arm has a huge dressing on it. She’s in a bad state. Pulling back further, we see she’s on The Children’s Ward - bright pictures of pixies on the wall. She just stares, blankly. Nurses fussing over her - she sees, across the ward, sick kids on drips. A dawning look of “What have I done?” A magician, accompanied by a fairy assistant, approaches the bed, and does close hand magic “at” her. She is mortified. This really is rock bottom. A nurse passes by. JOHANNA I find close-hand magic very stressful. Can I smoke   - ? Nurse shakes her head. INT. HOSPITAL CORRIDOR - DAY 139   139 Pat and Angie are standing, scared and exhausted. Krissi sits to the side holding the twins with Lupin curled asleep on a chair. ANGIE (to Pat) We’ve screwed this up. Angie looks through the glass panel in the door, at Johanna, sitting there, in bed. She looks very, very young. PAT What do we do, bab? Angie has no idea. The nurse comes over to the door - tells them to come in. Angie shakes her head. Pat goes in alone. INT. HOSPITAL CHILDRENS’ WARD - DAY 140   140 Johanna looks up. Watches him sit. He is beyond mortified. Starts automatically rolling a ciggie - then realises where he is. Stops. Johanna looks away. Doesn’t know what to say. Pat: thinking. Finally works out what he’s going to say. Opens his mouth. Johanna looks to him. Expects a big speech.  90.",
      "characters": [],
      "action_text": "PAT Remember you’re a Womble. Johanna stares at him: what? Pat is out of his depth. He kisses her on the forehead. Gives her that roll-up. PAT (CONT’D) I’ll get your mam. Pat goes out. INT. HOSPITAL CORRIDOR - DAY 141   141 Pat, pats Angie on the arm. PAT Went pretty well. Your turn. Angie doesn’t move. PAT (CONT’D) Come on love. Angie takes a deep breath. Enters the room. INT. HOSPITAL WARD - DAY 142   142 Angie sits down next to Johanna. Huge silence. Eventually: JOHANNA Mum, please talk to me. Angie looks at her - so sad. Finally: ANGIE I don’t   want   to talk to you. Johanna starts crying. ANGIE (CONT’D) I don’t want... you to feel like I feel, Johanna. Starts crying. ANGIE (CONT’D) You are my magic, happy girl. You  used   to be. Happy girls shouldn’t talk to sad, old, scared women. You might... catch it. Johanna tries a smile.  91. JOHANNA Too late... Angie comes over, hugs her awkwardly at first, and then climbs into the bed and hugs her properly: a mother with her little girl. Through the window, Krissi, Pat, Lupin and the twins look in - see things are better. Angie whispers in her ear: ANGIE Bab, don’t hurt yourself. The bastard world will do that anyway. Angie kisses the top of her head. The rest of the family come into the room. Krissi sits next to her - gestures if it’s okay to look at the cuts and gently peels the dressing back. KRISSI “U2”? Johanna: confusion. JOHANNA What? Krissi pushes her arm towards her. She looks. KRISSI “U2”. You’ve written what looks like “U2” on your arm. Johanna looks - horrified. JOHANNA No, I didn’t mean to! It’s a typo. They were just meant to be bold, agonised slashes! KRISSI You look like you tried to kill yourself   - for Bono.  Johanna starts sticking the dressing back down, breaking into her first smile for weeks. There are toys in the corner of the room - including a small, plastic drum-kit. Pat climbs behind it, and starts drumming. PAT And now, let’s take the bastards into a jazz break ... Goes off on one, beaming",
      "dialogue_count": 0,
      "word_count": 654
    },
    {
      "scene_number": 13,
      "slugline": "INT. JOHANNA AND KRISSI’S BEDROOM - DAY 143   143 Music: “Only Love Can Break Your Heart”. Johanna is in her room - arm bandaged - attending her God Wall. She takes down her bad reviews, her pictures of Tony Rich, her pictures of herself. She heaps them all into a metal bin and - with a fag and a can of Elnett - she sets fire to the lot. There is a satisfyingly large blaze. As it burns, she turns to admire her Heroes, restored. JOHANNA Awake, wall of Gods. Speak! Feel! Breathe! LIVE! They all animate - a babble of voices, back in the room. Johanna beams. ELIZABETH TAYLOR Honey! What did we miss? What month is it? JOHANNA I became evil! But it’s July now, and I’m over it. Elizabeth Taylor nods. Krissi enters the room, dragging his mattress. Flops it onto the empty frame. KRISSI I’m applying for the job of flat- mate. Johanna: beaming. JOHANNA Well, I’m applying for the job of trainee writer on... whatever it’s called. Your mag. She hands Krissi a sheaf of papers. He lies on the bed, looking through them. Looks up. KRISSI Okay. You’re hired. JOHANNA My word-rate - He pulls her onto the bed, and monkey-scrubs her.  93.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 210
    },
    {
      "scene_number": 14,
      "slugline": "INT. HALLWAY - DAY 144   144 Johanna is on the phone. She’s looking at a notepad. JOHANNA Hello? Hello - is that Rob Allan? Lead singer of The Hallows? It’s Dolly Wilde here. She holds the phone away from her ear, as a string of expletives come out of it. JOHANNA (CONT’D) Yes. Yes. Yes, I know. You are absolutely within your rights to call me a - She listens JOHANNA (CONT’D) “Goblin’s penis.” Actually, that’s why I’m calling. I wanted to apologise to you for the review. Calling you - She consults her notepad JOHANNA (CONT’D) - “a shit-wizard; a weasel in a waistcoat making musical limescale” was wrong, and I apologise.And to your mother. She did not give birth to Satan. She puts the phone down. Ticks something off the list. We see she has the names of fifty-seven bands on there. Nine have been ticked off. Out of the corner of her eye, she sees Pat and Angie through the kitchen - dancing to a song on the radio. Johanna smiles - love! EXT. SCHOOL GATES - DAY 145   145 Johanna and Krissi are selling his fanzine. John Kite is on the cover, under the headline “The REAL John Kite story.” Doing a roaring trade. John Kellog comes over to buy one. Krissi deals with him. As soon as he leaves: JOHANNA So! What’s happening with him? KRISSI We broke up. But - Holds up the bag.  94.",
      "characters": [],
      "action_text": "KRISSI (CONT’D) I got custody. INT. JOHANNA AND KRISSI’S BEDROOM - DAY 146   146 Johanna at her typewriter. She has a sheaf of neatly-stacked papers by the typewriter - adds the last one to it. The title of the piece: “Too Old For The Children’s Ward, Too Young For The Adult Ward - Why Sixteen Is The Worst Age To Self-Harm.” We go close-up on the piece of paper - and when we pull back out again, it’s in Johanna’s hands as she - EXT. STREET OUTSIDE “THE FACE” MAGAZINE - DAY 147   147 Stands outside, girding her nerves. She pushes the door. INT. “THE FACE” OFFICE - DAY 148   148 Johanna sits on a chair, nervous. The glass door opposite her says EDITOR. Staring through glass. AGAIN. But the door opens and a MIDDLE AGED WOMAN appears. She’s beautifully dressed: AMANDA WATSON, the EDITOR. She smiles. AMANDA Johanna? God you’re young. Come in. INT. AMANDA’S OFFICE 149   149 Johanna takes a seat opposite Amanda, across the desk. Amanda picks up a sheaf of A4: JOHANNA’S PIECE. AMANDA I didn’t think it was possible to laugh so much given the subject matter. And cry. And laugh again. We were passing it around the office like drugs, or a baby.   This  is what you should be writing. Do you know what you look like tearing apart pop records in the music press? An Olympic swimmer in a bathtub. But   this   -   this,   we’d like to run in the next issue. JOHANNA Why, thank you very much, Ma’am. AMANDA ...and then start you with a monthly column. (MORE)  95. A monthly letter, from you, telling us what you’re up to. “Building A Girl”, by Dolly Wilde. Would you like that job? JOHANNA Ma’am, I am more obligated than I can express. AMANDA Are you, in fact, pretending to be Elvis right now? Johanna thinks. JOHANNA No. I think this   is   me, now. For now. EXT. STREET OUTSIDE FACE OFFICE - MOMENTS LATER 150   150 Johanna comes out. Stands for a minute. Then punches the air. YES! YES! She celebrates for thirty seconds - then pulls out the laminate round her neck, and looks at it. Starts wa",
      "dialogue_count": 0,
      "word_count": 1514
    }
  ]
}