{
  "slug": "how-to-train-your-dragon-2-2014",
  "title": "how to train your dragon 2",
  "genre": "action",
  "format": "film",
  "scenes_count": 5,
  "characters_count": 0,
  "characters": [],
  "total_words": 12641,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. DRAGON MOUNTAIN - TUNNEL - DAWN (Scene 1400 - A New Family) CLOSE ON Hiccup, flustered, winded, chasing VALKA through tightly winding corridors. HICCUP Hold on! Wait just a minute! Come back here! VALKA This way. Come. HICCUP You can’t just say something like that and run off! You’re my  mother?!   I mean, what the -- do you grasp how INSANE it sounds?! (beat) I have questions! VALKA Come. Quickly! Hiccup follows her over the difficult terrain. He tries to clamber over a tall rock, unsuccessfully. HICCUP Where have you been all this time? Toothless boosts him over. Hiccup lands on the other side. HICCUP (CONT'D) What’ve you been doing?! They said you were   dead!   Everyone thinks you were eaten by... Hiccup trails off as he enters... INT. DRAGON MOUNTAIN - OASIS - CONTINUOUS ... a stadium-sized chamber teeming with ferns, waterfalls, hot springs and THOUSANDS of new DRAGONS. Hiccup wanders in, basking in the in the amazing sight: a dome of sweating ice capping a geothermal micro climate, filled with dragons of every shape and kind. He spots Valka clinging to a basalt overhang, watching him.  HTTYD 2 (D. DeBlois) - FINAL DRAFT - 05/05/14   39 .",
      "characters": [],
      "action_text": "HICCUP This is where you’ve been for twenty years? She nods from her perch. HICCUP (CONT’D) You’ve been rescuing them. She nods again, this time with a smile. HICCUP (CONT’D) Unbelievable. VALKA You’re not upset? HICCUP What? No. I don’t know. It’s a bit much to get my head around, to be frank. It’s not every day you find out your mother is some kind of crazy, feral, vigilante dragon lady. Valka chuckles, and using her dragon’s wing, lowers herself to the ground like a skilled acrobat. VALKA At least I’m not boring... right? HICCUP I suppose there is that... (feeble, trailing off) ... one... specific... thing... Excited dragons rush up to greet Hiccup and Toothless. Hiccup pets a few, marveling at the vast dragon utopia before him. VALKA Do you like it? HICCUP I don’t have the words. Toothless SNARLS in annoyance as the curious, smothering dragons SNIFF every part of him. VALKA Can I... ? He’s beautiful! She reaches out to stroke Toothless, who PURRS at her touch.  HTTYD 2 (D. DeBlois) - FINAL DRAFT - 05/05/14   40 . VALKA (CONT’D) Incredible. He might very well be the last of his kind. She inspects his talons as Toothless rolls onto his back, nuzzling her. VALKA (CONT’D) And look, he’s your age! No wonder you get along so well. Hiccup smiles, astounded by Toothless’ affection for Valka. She checks his teeth. They recede into the gums at her touch. VALKA (CONT’D) And retractable teeth? Ah! How did you manage to-- HICCUP --I found him in the woods. He was shot down and wounded. She winces and offers a sympathetic nod as she stands to caress a few of her own rescued dragons. VALKA This Snafflefang lost his leg to one of Drago Bludvist’s iron traps. This Raincutter had her wing sliced by razor netting. And this poor Hobblegrunt was blinded by a tree snare... then left to die alone and scared. (re: Toothless’ tail) And what of this? Did Drago or his trappers do this, too? HICCUP Heh. Well, crazy thing is... I’m actually the one who shot him down. She glares, confused. H",
      "dialogue_count": 0,
      "word_count": 1968
    },
    {
      "scene_number": 2,
      "slugline": "EXT. SKY - EARLY MORNING (Scene 1600 - Momma's Boy) BEGIN MONTAGE Hiccup and Toothless follow Valka and Cloudjumper over a majestic fjord in the long rays of the low Arctic sun. Hiccup peers over his shoulder to see that a thick flock of dragons -- nearly all of Valka’s rescues -- are close on their tail. He turns back to his mother, confused. HICCUP Hey, I thought we were going to eat? VALKA (with a mischievous grin) Oh, we are. She directs his gaze below, where in the choppy water of the fjord, a group of Seashocker dragons are corralling a dense shoal of fish near the surface. Suddenly, the Bewilderbeast rises from deep below, scooping the fish up in its vast mouth as its tusks break the surface. It breaches just below Hiccup and Toothless, giving them a fright before spitting the fish into the air and crashing back down into the sea. Valka laughs at Hiccup’s surprise as the hungry dragons race for the flailing fish, scooping them out of the air. Hiccup gestures to Toothless to join in and he gladly scoops up a mouth full. EXT. SNOWY SHORELINE - LATER MONTAGE CONTINUES... Hiccup has his map spread out in the snow, explaining the various lands he’s discovered during his explorations. HICCUP And from Dragon Island, I found this archipelago... He looks up to see that Valka is no longer next to him, but she has sketched out the rest of the northern land masses in the snow, wowing Hiccup with just how far and wide she has explored.  HTTYD 2 (D. DeBlois) - FINAL DRAFT - 05/05/14   49 .",
      "characters": [],
      "action_text": "She returned to Hiccup’s side with a smile. But his amazement is interrupted by Toothless joining in, drawing all over Valka’s map with a giant icicle. Hiccup simply shrugs as his mother giggles, and Cloudjumper sneers. EXT. WINDSWEPT CLIFF - LATER Valka and Hiccup rise on their dragons, carried skyward by a strong coastal wind that thrusts vertical up shoreline cliff. One by one, dragons leap from the cliff and catch the strong updraft, popping their wings open like kites. They ride the wind and orbit around each other in a colorful, mesmeric dance. It’s clearly a form of dragon play. Hiccup, lifted off of his saddle by the force of the wind, laughs giddily as he watches Valka walk across Cloudjumper’s wing and onto several others, dragon-hopping from one to another, until she gracefully crosses Toothless from wing tip to wing tip. She then drops out of sight, reappearing a moment later standing atop Cloudjumper. Hiccup is in utter awe of her. Valka breathes in the frigid air. Lets it out blissfully. VALKA When I’m up here, I don’t even feel the cold. I just feel... HICCUP Free. She smiles at Hiccup. He gleams back. VALKA This is what it is to be a dragon, Hiccup. Hiccup LOCKS the pedals in the flared tail position and unbuckles himself. Valka watches, curious. HICCUP It’s all well and good to call yourself a dragon. Hiccup RUNS OFF of Toothless, pulling his stowed wings. HICCUP (CONT’D) But can you fly? They catch the air, SNAPPING OPEN... and sending him GLIDING.  HTTYD 2 (D. DeBlois) - FINAL DRAFT - 05/05/14   50 . Valka GASPS, astonished. She flies her dragon alongside him, marvelling, as... ... Hiccup SOARS, riding the wild air currents like an eagle, the image of freedom. Toothless descends steadily with him, hovering protectively. Hiccup grins, pleased at having impressed Valka... until he realizes that he is once again racing toward a collision with a fast approaching mountain top. HICCUP (CONT’D) Oh no. Toothless! But, with his tail locked, Toothless can’t",
      "dialogue_count": 0,
      "word_count": 2247
    },
    {
      "scene_number": 3,
      "slugline": "INT. DRAGON MOUNTAIN - OASIS - MORNING (Scene 1800 - Family Reunion) Hiccup reattaches his flight suit while standing on a ledge overlooking the utopian nest, teeming with dragons. Several babies race in to hassle Toothless as he naps. HICCUP (determined) Well, bud, we can’t wait around for Drago to attack this place. We’ve gotta find him first. Let’s go. Suddenly, a thick hand clamps down over Hiccup’s face -- muffling his scream! Toothless whirls around to find STOICK, towering over Hiccup. He calms Toothless with a touch and releases Hiccup. STOICK Easy now. HICCUP Are you kidding me? How’d you get in here? STOICK The same way we’re getting you out. HICCUP We? Gobber appears in the arch of a tunnel. GOBBER All clear! STOICK Toothless. Come. They hurry back into the winding corridor. HICCUP Dad! There’s something you need to know! STOICK Yeah, yeah, tell me on the way. HICCUP This isn’t an on-the-way kind of update, actually...  HTTYD 2 (D. DeBlois) - FINAL DRAFT - 05/05/14   59 .",
      "characters": [],
      "action_text": "STOICK I’ve heard ENOUGH, Hiccup. HICCUP ... more of the earth-shattering development variety. STOICK Yeah, just add it to the pile. HICCUP Dad, unlike most surprises I spring on you, this is one you’ll like. I promise! You just have to handle it delicately, so... They round a tight bend in the corridor to find Gobber staring blankly at something unseen in the next chamber. He shuffles past Stoick and Hiccup, dazed. GOBBER Uh, you might want to take this one. Oh, boy. Stoick draws his SWORD, then braves into the chamber ahead. HICCUP Dad, can you put the sword away... please? Stoick GASPS as if seeing a ghost... and drops his sword with a clatter. Valka stands some twenty paces ahead of him, blocking the path. She lets out an audible SHUDDER upon seeing him. He removes his helmet slowly as Hiccup, Gobber, and Toothless appear at Stoick’s side. VALKA (rattled) I know what you’re going to say, Stoick. How could I have done this? Stayed away all of these years. And why didn’t I come back to you? To our son. Stoick steps towards her, wide-eyed and speechless. Dragons emerge from the recesses behind Valka, hissing protectively. VALKA (CONT’D) Well, what sign did I have that you could change, Stoick? That anyone on Berk could? (MORE)  HTTYD 2 (D. DeBlois) - FINAL DRAFT - 05/05/14   60 . I pleaded so many times to stop the fighting, to find another answer, but did any of you listen? GOBBER This is why I never married. (beat) This and one other reason. Stoick continues to close the gap, mesmerized. With every step, Valka becomes increasingly flustered. She backs into an ice wall, with nowhere to go, and Stoick just a few paces away. VALKA (tearful) I know that I left you to raise Hiccup alone... but I thought he’d be better off without me. And I was wrong, I see that now, but... Stoick gently reaches a hand toward her face. VALKA (CONT’D) Oh stop being so stoic, Stoick. Go on... SHOUT, SCREAM, SAY SOMETHING! STOICK You’re as beautiful as the day I lost you. His words snuff ",
      "dialogue_count": 0,
      "word_count": 4574
    },
    {
      "scene_number": 4,
      "slugline": "EXT. DRAGON MOUNTAIN - LAGOON - DUSK (Scene 2100 - Viking Funeral) A KEEL grinds against the shoreline pebbles as a listing, battered ship is pushed into the still iceberg-filled lagoon. GOBBER (V.O.) May the Valkyries welcome you, and lead you through Odin’s great battlefield. May they sing your name with love and fury, so that we might hear it rise from the heights of Valhalla... and know that you’ve taken your rightful place at the table of kings. Bows and pitch-dipped arrows are gathered from the battlefield. Gobber hands a set to Hiccup, meeting his eyes with sympathetic glance. GOBBER (V.O.) For a great man has fallen. A warrior. A chieftain. A father. A friend. Hiccup dips his arrowhead in a smoldering chunk of wreckage, igniting the pitch that coats the tip. He releases his arrow, which sails through the air and lands on the deck of the ship, where Stoick is laid out on a pyre, covered by a sail, his axe upon his chest. The others follow Hiccup’s lead. They DRAW BACK in unison and LOOSE their arrows, filling the sky with crisscrossing, flaming streaks. They arc over the lagoon and set the ship alight. ON HICCUP, fighting back emotion and losing the battle. HICCUP I’m sorry, Dad. He eyes the engulfed ship. HICCUP (CONT’D) I’m not the chief that you wanted me to be. And I’m not peacekeeper I thought I was. I don’t know... Valka watches him, her heart breaking. She steps forward.  HTTYD 2 (D. DeBlois) - FINAL DRAFT - 05/05/14   81 .",
      "characters": [],
      "action_text": "VALKA You came early into this world. You were such a wee thing. So frail, so fragile. I feared you wouldn’t make it. Hiccup lowers his eyes, but Valka lifts his chin. VALKA (CONT’D) But your father... he never doubted. He always said you’d become the strongest of them all. (beat) And he was right. (beat) You have the heart of a chief and the soul of a dragon. Only you can bring our worlds together. That is who you are, son. Hiccup meets her bolstering stare. He turns to the ship and watches it in silence, silhouetted in its glow. HICCUP I was so afraid of becoming my dad. Mostly because I thought I never could. How do you become someone that great? That brave? That selfless? (beat) I guess you can only try. (to the others) A chief protects his own. We’re going back. TUFFNUT Uh, with what? RUFFNUT He took all the dragons. HICCUP Not all of them. EXT. ICE CHANNELS - MOMENTS LATER (Scene 2200 - Hatchlings to the Rescue) WHOOSH! WHOOSH! WHOOSH! JUVENILES BLUR past, like flying raptors, ZIGZAGGING wildly. Riding bareback, Hiccup & Co. HURTLE through the narrow ICE CHANNELS -- created by massive splits in the iceberg shelves.  HTTYD 2 (D. DeBlois) - FINAL DRAFT - 05/05/14   82 . RUFFNUT Fly straight! FISHLEGS I don’t want to die! TUFFNUT We can’t fly these things! FISHLEGS Yeah, no kidding! Fishlegs barrels into a snow bank, sending several chunks right into Eret’s face as rides inverted and HOLLERING. ASTRID But won’t that Bewilderbeast just take control of these guys, too? HICCUP They’re babies. They don’t listen to anyone! TUFFNUT Yeah, just like us! Gobber follows up the rear clumsily, STRUGGLING for control. GOBBER This... is... very dangerous! He PULLS ALONGSIDE Hiccup and Valka. GOBBER (CONT’D) Some might suggest this is poorly conceived. HICCUP Well, it’s a good thing that I never listen. A SHARP RIDGE RUSHES up at them. They’re going to CRASH. Hiccup ROUNDS one side of it, and Gobber flies down the other side. They shout through gaps in the iceberg. GOBBER So wh",
      "dialogue_count": 0,
      "word_count": 860
    },
    {
      "scene_number": 5,
      "slugline": "EXT. GREAT HALL - CONTINUOUS Vikings pour out of the Great Hall as all of Berk’s dragons fill the night sky and join the ranks of Drago’s growing DRAGON ARMY. The Bewilderbeast rises out of the sea, bearing down on the people of Berk as Drago hovers on Toothless, leading the charge. The Vikings stare, aghast. DRAGO Your chief is dead. Waves of shock and whispers of “Stoick?” spread through the crowd. DRAGO (CONT’D) No one can protect you now. He thrusts his bull-hook, commanding the Bewilderbeast to fire. The Vikings watch in horror as the Bewilderbeast opens its yawning jaws and BLASTS. EXT. SKIES/BERK - NIGHT Dragon roars grow louder as Hiccup & Co. approach through clouds, racing against time. They collectively GASP at the sight of Drago’s Bewilderbeast having now covered most of the village in explosions of ice. Berk’s now commandeered dragons circle in a huddle behind him, joining Valka’s flock, and corralled by Drago’s armored dragons. HICCUP No... FISHLEGS He took all the dragons! HICCUP (fuming) Distract the alpha. Try to keep his focus off of Toothless. TUFFNUT Uh... how? ERET Have you forgotten who you’re riding with? He brazenly aims his baby dragon toward the Bewilderbeast.  HTTYD 2 (D. DeBlois) - FINAL DRAFT - 05/05/14   85 .",
      "characters": [],
      "action_text": "ERET (CONT’D) There isn’t a dragon alive that I can’t wrangle! His baby dragon dives toward the sea instead. ERET (CONT’D) Except for this one! SNOTLOUT Amateur. The others shrug and follow. As they get closer, the Bewilderbeast looms bigger and BIGGER. Berk’s Vikings in hiding notice Hiccup and the others as they approach. VIKING #1 Look, it’s Hiccup! The Vikings CHEER. ON DRAGO, surprised to see Hiccup and the others approaching. DRAGO What? With an irate HUFF, the Bewilderbeast focuses on Hiccup, gaining ever closer to Toothless. Suddenly, a SHEEP appears in its sight, rising and falling out of view. The Bewilderbeast blinks, confused. It looks down to see Eret catching the falling sheep and reloading it into the game launcher, as Tuffnut cocks the mechanism and Ruffnut pulls the trigger. RUFFNUT Keep ‘em coming! Snotlout tosses the black sheep to Tuffnut. SNOTLOUT Black sheep, baby! Exasperated, the alpha inhales, about to blast, when... HONK! The game horn blares, breaking his concentration. He turns, finding the horn unmanned. The Bewilderbeast then returns his focus to the sheep launcher, until the BLACK SHEEP LANDS on the his face, bouncing down his facial spines and becoming lodged.  HTTYD 2 (D. DeBlois) - FINAL DRAFT - 05/05/14   86 . SNOTLOUT (CONT’D) Ten points! The Bewilderbeast shakes the black sheep off and prepares to blast again. SNOTLOUT (CONT’D) Uh-oh... HONK! The alpha whips around -- still no one at the horn. ON FISHLEGS, giggling and hiding behind the game horn. The Bewilderbeast finally lets loose the ice blast, covering the entire horn in jagged spikes... as Fishlegs leaps from the platform. FISHLEGS I’m okay! BACK TO HICCUP as he reaches Drago, hovering directly in Toothless’ sights. DRAGO You certainly are hard to get rid of. I’ll say that. Hiccup ignored him and focuses on Toothless’ slitted pupils. HICCUP Toothless? It’s me, bud. It’s me. I’m right here. Come back to me. TOOTHLESS’ POV: Hiccup appears as an unfamiliar red blur, still firm",
      "dialogue_count": 0,
      "word_count": 2992
    }
  ]
}