{
  "slug": "how-to-train-your-dragon-the-hidden-world-2019",
  "title": "how to train your dragon the hidden world",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 2,
  "characters_count": 0,
  "characters": [],
  "total_words": 11391,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. NEW BERK - DAY  Sequence 1801 - Automatic Tail  Astrid walks up, eyeing schematic drawings of a new prosthetic tail, pinned up on a wall. She studies them curiously. ASTRID Oh, someone hasn’t slept. Hiccup grabs a handful of black Toothless scales and drops them into a mortar. He mashes them up with a pestle. HICCUP Well, that Light Fury won’t let me within a mile of her. And neither of us will be getting any sleep or finding the Hidden World until Toothless takes over. Hiccup is toiling away at a makeshift workbench as Toothless hovers over him, panting. As Hiccup peers through a magnifying glass, Toothless pushes his face aside to look, steaming up the glass. HICCUP (CONT’D) Hey! What do you think of that? Yeah! ASTRID You tried this once before. He didn’t want it. HICCUP Until now, he didn’t have a reason to. Right, bud? Hiccup holds up the mortar to Toothless. On cue, Toothless SPITS into it, adding slobber to the mixture. Astrid smiles. Hiccup grabs a paintbrush and meets her eyes. HICCUP (CONT’D) What? ASTRID No, nothing. I’m impressed. I mean, look at you, embracing change. I’m proud of you. Hiccup shrugs, painting the tail.  HTTYD: The Hidden World - 12/05/18 - Final (DeBlois)   56 .",
      "characters": [],
      "action_text": "HICCUP Well, he’s my best bud. I want him to be happy. (beat) Besides, it’s just until he brings her back. Astrid rolls her eyes. Hiccup finishes coating the tail in paint. He lifts and splays it in front of Toothless. Toothless GURGLES in awe. HICCUP (CONT’D) Alright. Fire when ready! Toothless produces a small fireball. It washes over the paint, drying it instantly. He then holds it up for Toothless, who blasts it with fire. He folds the tail, revealing Gobber, covered in soot and glowing embers. GOBBER Well. I guess you know the   tail   is fireproof. Hiccup cringes as Toothless runs around, frantically. HICCUP Okay, Toothless! Okay, yes I know, I know -- shh shh shh. Okay, I know. He attempts to fit the new prosthetic as Toothless wags his tail excitedly. HICCUP (CONT’D) Please. This is not helping. Eret walks up, carrying an armload of construction logs. ERET Well, well, well! Someone’s excited. HICCUP Fresh off of his first date. Now, he’s love-crazed. GOBBER Only WE’RE the ones going crazy. The sooner he brings back that Light Fury, the better!  HTTYD: The Hidden World - 12/05/18 - Final (DeBlois)   57 . HICCUP Yeah but to do that, he'll need to fly without me. So time to give this new-and-improved baby a shot. Toothless dances in place, excitedly. Hiccup straddles his tail, bracing it between his legs, and attaches the prosthetic, affixing the matching brace to Toothless’ natural half-tail. HICCUP (CONT’D) Attaboy! Lookin’ sharp, Toothless! So, what do you think, bud? Toothless flares, tilts, and collapses his half-tail. The automatic prosthetic mirrors every movement with geared precision. HICCUP (CONT’D) Bring her home. (aping Stoick) By sundown at the latest. Toothless smiles, gurgling excitedly. He wipes a slobbery tongue across his face. HICCUP (CONT’D) Pfft! Save it for your girlfriend! Go on, get out of here! Toothless bounds off -- then pauses, suddenly aware of the magnitude of his newly gifted independence. He turns back to Hiccup, looking uncertai",
      "dialogue_count": 0,
      "word_count": 3366
    },
    {
      "scene_number": 2,
      "slugline": "EXT. NEW BERK - PLAZA - DAY  Sequence 2191 - We Need Him  Stormfly touches down in the center plaza, carrying Astrid and Hiccup, as Gobber approaches, grimacing. GOBBER Thor almighty! Guess we won’t be needing this then, huh? He gestures toward a handmade cage behind him. The returning rescue team follows sheepishly, looking battered, sooty, and disheveled on the heels of the botched mission. HICCUP I led us right into his trap. Hiccup shakes his head, frustrated. Tuffnut SNICKERS. TUFFNUT Yeah, nice work,   Chief.   Right, Ruff? Silence. He looks over to see Barf’s empty saddle. HICCUP Wait. Where   is   Ruffnut? Tuffnut stares at the empty saddle, straining in thought. FISHLEGS (panicked) We left her behind? ASTRID How could you not notice she was missing? You ride a two-headed dragon. TUFFNUT Oh yeah. (beat) I feel like how Ruffnut is   every  day. Dumb. GOBBER Odin be spanked! This just gets better and better. Hiccup tries to calm the upset, VOCAL crowd.  HTTYD: The Hidden World - 12/05/18 - Final (DeBlois)   70 .",
      "characters": [],
      "action_text": "TUFFNUT I try to avoid looking at her. It gives me acid reflux. HICCUP Okay, guys, just keep your helmets on. Toothless and I will fly-- HOARK Toothless has the Light Fury now. He’s probably not even coming back. HICCUP What? ASTRID You gave him his freedom, Hiccup. What were you expecting? HICCUP I never thought he’d stay away for  good.  He SIGHS, crestfallen. HICCUP (CONT’D) I..I... (beat) Look, I - I’ll figure it out. I just need more time. He shuffles off, defeated. Astrid watches Hiccup and SIGHS. Valka approaches. VALKA He thinks he has to lead alone, because his father had to. He doesn’t realize the strength you have together. Astrid turns to her. VALKA (CONT’D) Do you still believe in him? ASTRID Of course. I wish he did. But he thinks he’s nothing without Toothless. VALKA Then help him realize the truth.  HTTYD: The Hidden World - 12/05/18 - Final (DeBlois)   71 . BACK TO HICCUP, walking away from the crowd, rubbing his brow. He looks up to see Stormfly bounding up to him cheerily, with Astrid in the saddle. Stormfly SQWAKS, enthusiastically. ASTRID Get on. We’re going to find him. Hiccup lights up, relieved. HICCUP Really? He climbs onto the saddle, calling back to the weary crowd. HICCUP (CONT’D) Everybody stay put. We will get Ruffnut back. Don’t worry. He joins Astrid in the saddle as Stormfly takes to the air. TUFFNUT Puh. Worry? If they’re stuck with Ruffnut, I’m more worried about  them.  CUT TO: INT. RAVEN POINT TRAPPERS’ FORT - DAY  Sequence 2195 - Ruffnut Freed  Grimmel is looking down at his map, trying to concentrate. RUFFNUT (O.S.) Why the long face? She SNICKERS. RUFFNUT (CONT’D) I mean, mine’s long, but yours is  really   long. All face and no brain. Like you got stretched at birth. Do you have a twin too? Tuffnut took up all the room in Mom’s belly. Otherwise I’d have a rounder head and more brains. That’s science. Grimmel sneers, trying to ignore her. The silent Warlords exchange glares of exhaustion. Ruffnut toys with her braids, weaving ",
      "dialogue_count": 0,
      "word_count": 8025
    }
  ]
}