{
  "slug": "i-dont-feel-at-home-in-this-world-anymore-2017",
  "title": "i dont feel at home in this world anymore",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 27,
  "characters_count": 0,
  "characters": [],
  "total_words": 20013,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. BACKYARD - NIGHT  BLACK TREE LIMBS spread against a less-black sky. The STARS  beyond are vast and dim. BATS dip and wheel chaotically. We  can hear their wings: a desperate-sounding   chk chk chk.  RUTH KIMKE (38) stares up at them, very still, very uneasy.  She has a watchful, owlish vibe. She’s slightly   wall-eyed .  Her hair is long and plain and she appears fearfully  hypnotized by the bats. Or maybe it’s the stars.  She tips a BEER up, nearly kills it without blinking.  WIDER, we see her yard: a weedy little square enclosed by a  tall rickety fence. MUSIC and VOICES drift faintly from  elsewhere, some other yard. Somebody SHRIEKS in delight.  Ruth looks in that direction, all alone back here.  She glances down at her hand...which is SHAKING.  Then back to the dark sky as an OMINOUS TONE sounds and we--  CUT TO BLACK.  TELEVISED IMAGES fill the screen, pixelated and washed-out,  with SOFT HAPPY ELEVATOR MUSIC eating all the sound:  A huge TRASH ISLAND bobs in the ocean. SOLDIERS fire machine  guns in the Middle East. A WHITE COP clubs a BLACK KID.  INT. BEDROOM - CARE CENTER - DAY  PULLING OUT from the T.V. as Ruth enters in pink scrubs,  eyeing it before addressing the person at which it’s aimed.  RUTH  How ‘bout I change this, huh?  It’s MRS. HAMBLE in the bed, ninety if she’s a day. Skeletal  and unblinking. Oh shit...she might be dead already.  RUTH (CONT’D)  Mrs. Hamble?  She moves to the bedside, fearing the worst, but--  MRS. HAMBLE  (a weak rasp)  ...look at these goddamn monkeys...  So instead Ruth adjusts the covers, the fluid drip.",
      "characters": [],
      "action_text": "RUTH  No, now...shh.  MRS. HAMBLE  ...if my husband Wilson Kenneth  Hamble ever lived to see the way  they managed to flush this country  right down the fuckin stinker, he’d  like to never stop throwing up, you  never heard a bigger helping of  shit in all the years of woe-is-me,  God o’ mighty, put the chicken and  hubcaps down and keep your gigantic  monkey dick outta my good pussy...  RUTH  Okay, now. Just. Okay.  MRS. HAMBLE  ...Christ help us...  RUTH  Okay.  MRS. HAMBLE  ...why won’t nobody fuck me good?  RUTH  Shh. C’mon, now.  But then, as she works, the silence prompts her to look.  Mrs. Hamble has gone slack.   Actually   dead this time.  INT. WAITING AREA - CARE CENTER - DAY  Ruth and a DOCTOR stand with MRS. HAMBLE’S SON, other crying  FAMILY in the background.  SON  Did...did she have any last words?  The Doctor looks to Ruth for the answer. She considers.  TITLE CARD LANDS WITH A LOW THROBBING   BOOOM .  TRAFFIC NOISE, VOICES, COMMERCIAL JINGLES: a din of shrill  anxiety. As SPARSE MINOR-KEY MUSIC tip-toes into the mix...  2.",
      "dialogue_count": 0,
      "word_count": 454
    },
    {
      "scene_number": 2,
      "slugline": "EXT. RUTH’S CAR (MOVING) - DAY  ...we see Ruth through the windshield of her ancient JUNKER,  a rusty ‘76 Ventura. Inching along. Her mind elsewhere.  VEHICLES wipe the foreground, blurs, endlessly blocking her.  NEWS RADIO (V.O.)  ...and   the   Governor   calling   it   ’a  horrific   but   ultimately   unpreventable  tragedy’   after   the   schizophrenic   man  brought   his   registered   AR-15   into   the   day  care   and   opened   fire.   Sports   is   next.  Up ahead, a DAY-GLO PICKUP belches a BLACK SMOKE from its  dual smokestacks onto the other cars. Rollin’ coal.  She’s quietly mystified.  EXT. PARKING LOT - DAY  Hard sunlight blasts off of chrome and glass. Ruth moves  through this maze of cars, preoccupied. She wears jeans,  sneakers, an old baseball shirt. Has her own shopping bag.  A MINIVAN backs out, nearly clips her but stops short. She  waits, gestures   go ahead . Which the minivan is happy to do.  INT. GROCERY AISLE - DAY  A SLOPPY MAN drops a bag of chips, leaves it on the ground.  Ruth comes along in his wake and, without thinking, bends  down to put them back on the shelf.  INT. ‘15 ITEMS OR FEWER’ CHECKOUT LINE - DAY  Ruth waits patiently with her rotisserie chicken behind a  TIRED WOMAN who’s stacking thirty or forty items on the belt.  INT. DIVE BAR - DAY  An OLDIE purrs on the juke (“Hully Gully Calling Time” by The  Jive Five!) as we PUSH DOWN THE BAR to find...  Ruth, sitting by herself at the far end of with a beer and  her chicken dinner, absorbed in a FANTASY NOVEL.  Someone LAUGHS and she looks up.  3.",
      "characters": [],
      "action_text": "Down the bar, a cluster of YOUNG DUDES, bullshitting amongst  themselves. But ONE of them is looking at her, kinda smiling.  Back to her book. A moment later, he’s still looking at her.  YOUNG DUDE  Is that the Elsewhere Saga?  She straightens, smiles in spite of herself.  RUTH  Yeah. ’ King   of the Hidden Dark.’  YOUNG DUDE  Book two. Read those a while ago.  RUTH  I’m at the, they’re getting ready  for the Battle of the uh--  YOUNG DUDE  Battle of the Tanhauser Gate?  RUTH  Right! I’m like...  She makes a face:   biting my nails!  YOUNG DUDE  Totally. Yeah. So good.  (beat)  You know her father’s actually the  War Mage.  Ruth’s smile stays absolutely in place.  RUTH  Captain Deo is...?  YOUNG DUDE  Kieran’s real father. Yeah. That’s  coming up. Blew my mind.  And stays in place.  RUTH  Wow.  YOUNG DUDE  Clues were there, y’think about it.  And with that, he returns to his buddies.  Ruth looks down at the bar top, but not quite at her book.  4.",
      "dialogue_count": 0,
      "word_count": 433
    },
    {
      "scene_number": 3,
      "slugline": "EXT. FRONT YARD - RUTH’S HOUSE - DAY  Ruth pulls into the driveway of her tiny RANCH HOUSE. Heading  inside, she sees something in the patchy yard that stops her.  A PIZZA FLYER tucked in her door is angrily yanked out.   Fft!  THE DOG TURD on her grass is grabbed using the flyer.   Splrt.  HER TRASH CAN has   many   such dog shit/pizza flyer wads already  in it and here’s one more.   Wump! Slam!  THE SMALL HANDMADE SIGN on her lawn-- a dog shit inside a red  circle-slash with ‘ PLEASE!’ --is angrily straightened.  INT. FRONT ROOM - RUTH’S HOUSE - DAY  Ruth heels the door shut, drops her book on a side table.  INT. KITCHEN - CONTINUOUS  THE FRIDGE OPENS, leftover chicken goes in, a beer comes out.  Ruth leans against the counter, pops the beer, takes a sip. A  dim, quiet little house. A little cluttered but not dirty.  SLOWLY PUSHING IN as she stares grimly at nothing. There’s a  soft repetitive   bmp bmp bmp   somewhere. But then...  Her eyes land on something and she stiffens. That   bmp bmp bmp  seems louder suddenly. She moves forward, confused because...  HER BACK DOOR IS AJAR. She touches it as if to confirm what  she’s seeing.   BMP BMP BMP.   Just beyond is--  INT. SUN ROOM - CONTINUOUS  --this small glassed-in porch, with its own BACK DOOR which  also hangs wide open, bumping against the house.   BMP BMP BMP.  She steps out there, breathing faster as she peers out into--  EXT. BACKYARD - CONTINUOUS  --which is empty. Somewhere distantly a LAWN MOWER buzzes, a  DOG barks. But nobody in sight. She pulls the door shut--  5.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 274
    },
    {
      "scene_number": 4,
      "slugline": "INT. KITCHEN - CONTINUOUS  --and comes back through the SUN ROOM into the house where  she GASPS, her hands flying to her mouth because--  --she sees for the first time that SHE’S BEEN RANSACKED. All  drawers pulled out of her credenza, the contents spilled.  She gapes, immobilized. But before she can decide what to do--  Sktch.   A soft noise. She freezes.   Whatwasthat?  DOWN THE HALLWAY, the opened BEDROOM DOOR spills sunlight.  She stares at it, perfectly still, her eyes bright with fear.  CLOSER ON THE BEDROOM DOOR, sunny, quiet... but then a wisp of  shadow moves in there.  At that, she INHALES sharply and takes a reflexive step  backwards but...she stops. And her lips curl from her teeth.  Without taking her eyes off the hallway--  HER HAND slides off a KITCHEN KNIFE from the rack.   Sksshh!  INT. HALLWAY - CONTINUOUS  Ruth advances slowly, the KNIFE held before her, SHAKING.  THE BEDROOM DOOR looms ahead... a shadow moves again.  She’s terrified....yet inches forward, vibrating.  She leeeeans in, millimeter by millimeter, to peer into...  INT. BEDROOM - CONTINUOUS  ...which is empty. Some DRAWERS have been opened and pawed  through but there’s nobody here.  Just outside the WINDOW, a LOOSE GUTTER dangles there in the  breeze:   that’s the shadow.   Just to be sure she peeks into--  THE BATHROOM, which is also empty, but the MEDICINE CABINET  is opened, the contents wiped out onto the floor.  Her fight-or-flight tension uncoils itself.   Exhaaale.  RUTH  The   fuck , man.  6.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 245
    },
    {
      "scene_number": 5,
      "slugline": "INT. BATHROOM - SAME  GLOVED HANDS brush BLACK FINGERPRINT POWDER onto the medicine  cabinet door.   Psh, psh, psh.  VOICE (O.S.)  Various prescription medications...  INT. SUN ROOM - SAME  GLOVED HANDS peel LIFT TAPE from the powder-dusted DOORKNOB.  Shkk.  VOICE (O.S.)  A laptop computer...  INT. KITCHEN - SAME  A PHOTOGRAPHIC FLASH strobes her ransacked credenza.   Klik!  VOICE (O.S.)  And then the silverware in here...  This is a UNIFORMED OFFICER who couldn’t appear more bored as  she jots this all down on a clipboard and pops her gum.  OFFICER  Anything else?  Ruth is kind of hugging herself with her PHONE in one hand.  RUTH  I don’t uh...not that I can see.  (beat)  The silver was my grandma’s.  The Officer ignores that.   Pop .  BENDIX (O.S.)  Were they painkillers?  Ruth looks over to DETECTIVE BENDIX (50s), who could use a  nap, inspecting the back door as an EVIDENCE TECH wraps up.  BENDIX (CONT’D)  The medications.  RUTH  No, it was uh...Clonazepam.  (beat)  And Lexapro.  7.",
      "characters": [],
      "action_text": "He looks at her blankly, sucks his teeth.  BENDIX  You try one of those location apps?  RUTH  (gesturing with her phone)  I tried that. The laptop was off.  BENDIX  They’ll probably wipe it, anyway,  unless they’re morons. Got a hide-a-  key? Fake rock thing?  RUTH  No.  BENDIX  That gate to your backyard, there’s  no lock on that?  RUTH  No, it’s just...like a latch.  BENDIX  (re: the back door)  You leave this unlocked, you go  out?  RUTH  Mmno. Not usually.  BENDIX  But you did today.  RUTH  I don’t remember. I thought I’d  locked it, but...  BENDIX  Wasn’t a forced entry, I mean.  Ruth has no answer for that. Bendix and the Officer exchange  a bland look and Officer lowers her clipboard.  EXT. FRONT YARD - RUTH’S HOUSE - TWILIGHT  Ruth comes outside, clutching a REPORT FORM, watching as--  Bendix heads to his UNMARKED CAR and the UNIFORMS head to the  PATROL UNIT with its LIGHTS TURNING.  8. RUTH  What should I do now?  Bendix turns back, perplexed.  BENDIX  About what?  RUTH  I mean...do you call me, or...?  BENDIX  If anything is recovered, someone  will be in contact. Your case  number’s on that form if you have  renter’s insurance.  RUTH  But you’re gonna look, right?  He looks as if she spit on his shoe.  BENDIX  What?  RUTH  You’re...gonna look?  BENDIX  Miss, we’ll do everything we’re  able to but in the meantime I  suggest you pay a little closer  attention to your home security.  Lot of this kind of thing going on,  drug people and whatnot. Don’t give  ‘em an opening.  He continues on. She glances at the report in her hand.  RUTH  Thank you.  He gives a tight little smile as he gets into his car.  THE PATROL CAR LIGHTS switch off as it pulls away and Ruth  stands there in the half-light, watching them go.  INT. FRONT ROOM - SAME  Ruth comes back in, closes the door. Locks the deadbolt, too.  Pink (mm/dd/yyyy)   9.",
      "dialogue_count": 0,
      "word_count": 485
    },
    {
      "scene_number": 6,
      "slugline": "INT. KITCHEN - SAME  She kneels to clean up the DRAWERS...but finds herself  staring down that SHADOWY HALLWAY. Looks like a tomb.  She brings out her phone, dials hurriedly.  RUTH  (into phone)  Hey. I’m not bothering you, am I?  INT. A DIFFERENT BEDROOM - NIGHT  CLOSE ON RUTH, staring off in heavy contemplation. Simmering.  RUTH  It’s the violation, man. The stuff,  that’s replaceable--I mean, the  silver’s not but what really hurts  is the fucking violation. They were  inside my house,   you know?  She’s talking to JANA, who is six, in bed, in her pajamas.  JANA  Can we...finish the story?  RUTH  Sorry.  Ruth, sitting at Jana’s bedside, re-opens the PICTURE BOOK  she’s holding,   “Our Universe” , and begins to read...  RUTH (CONT’D)  Rays from the sun are thousands of  years old before they reach your  eyes. Human bodies are made of dust  and gasses from inside of stars.  The universe is fourteen billion  years old. No one knows what came  before. No one knows how big the  universe actually is. It...it could  be   infinite - -  And she starts SOBBING, just totally dissolves.  RUTH (CONT’D)  Jesus ...  And   that   in turn terrifies Jana--  JANA  W-why are you crying?  10.",
      "characters": [],
      "action_text": "--and now they’re BOTH CRYING, a perfect storm of CRYING.  RUTH  The fuck kinda book is this?  INT. HALLWAY - ANGIE’S HOUSE - A BIT LATER  Abrupt silence as ANGIE HUFF (40) slides out of JANA’S  BEDROOM, pulling the door closed behind her and looking at--  INT. KITCHEN AREA - LIVING ROOM - CONTINUOUS  Ruth, spent and red-eyed but composed now, drooping in  contrition as she sees Angie returning--  RUTH  I’m sorry.  --who gestures   no problem   (even though we can see that it   was  kind of a problem) and waves her to the couch.  ANGIE  She’s fine. Don’t worry.  RUTH  I’m so sorry.  Ruth sits, preoccupied and distressed, as Angie packs a BOWL--  ANGIE  A fucked-up thing happened to you.  You’re allowed to be upset.  --which she is   just about   to hit when--  RUTH  It’s not that.  And so Angie lowers the bowl, sensing an impending deluge.  ANGIE  What uh...what is it?  RUTH  Patient died today. I was in the  room. She was there and then...she  wasn’t.  Angie passes the bowl and Ruth hits it, deep-deep-deep.  ANGIE  Oh. She was special, huh?  11. Ruth holds the hit, thinking hard.  RUTH  (a burp of smoke)  No. She sucked.  ANGIE  Oh.  RUTH  This old...shithead...  ANGIE  Uh huh.  RUTH  ...bat...  ANGIE  Yeah.  Angie takes the bowl back, hits it herself, settling in for--  RUTH  (a dreamy stream)  But it just kinda clicked.   It  doesn’t matter.   They’ll roll her  into a cooker and then she’ll be  smoke. Just carbon and stuff. My  grandma Sally--that was her silver  they took--she was a war nurse. She  literally breathed life into people  who’d been exploded. Spent her  retirement bringing dinner to shut-  ins, folks with cancer...  (Angie exhales a long patient jet of smoke.)  RUTH (CONT’D)  ...and then she had a stroke and  was just carbon and stuff, too.  Exactly the same. And now I’m the  only one left who remembers any of  that and pretty soon I’ll be carbon  and stuff, too...so none of it  matters. You could be a saint, you  could be awful, whatever, it’s like",
      "dialogue_count": 0,
      "word_count": 936
    },
    {
      "scene_number": 7,
      "slugline": "INT. LIVING ROOM - EARLY MORNING  CLOSE ON RUTH, curled on the couch under a quilt, semi-awake.  A SMALL HAND holds a sheet of PAPER before her. She props  herself up to look at it...  A CHILD’S DRAWING:   a WOMAN riding a BIG GREEN LIZARD-THING.  Jana stands there, solemnly gnawing on a magic marker.  RUTH  Is this me?  Jana nods.  RUTH (CONT’D)  Is this a dragon?  JANA  Stegosaurus.  Ruth considers it some more.  RUTH  I fuckin’ love it.  EXT. RUTH’S CAR (MOVING) - DAY  VAGUELY TENSE MUSIC skitters in the background as Ruth  drives, her eyes fixed dead ahead.  EXT. RUTH’S HOUSE - DAY  She pulls into the driveway, heads for the door, but   stops .  And stares down at her lawn. Anger crackles on her face.  There is, indeed, a fucking DOG TURD. Right next to the sign.  She whirls in place, looking up and down--  THE STREET, where a few houses down there she can see A MAN  walking away with a DOG on a leash.  A FRESH PIZZA FLYER is snatched from her door handle.   SKTCH!  INT. STREET - SAME  TIGHT ON THE DOG MAN, seen from behind: his HOODIE with the  METALLIC COBRA on the back.  15.",
      "characters": [],
      "action_text": "HIS DOG struts along beside him. If a dog can look dumb, this  one surely does.  HIS WATER SANDALS go   sk! sk! sk!   on the pavement beneath the  camo cut-offs he’s wearing.  HIS SODA POP gets   slurped   as he walks. He’s maybe 30, froggy,  and we can hear the HEAVY METAL in his HEADPHONES.  TRACKING WITH HIM so we can see Ruth SPRINTING up behind him,  clutching a FLYER/DOG SHIT WAD.  The Dog Man is unaware, his HEADPHONE MUSIC drowning  everything out, even as Ruth gets within ten paces and--  HURLS THE WAD AT HIS HEAD. It misses by a mile-- wump! --but he  turns to see her there behind him, hunched and fuming.  They face off like gunfighters.  DOG MAN  Why’d you do that?  RUTH  You’ve been shitting in my yard.  DOG MAN  I have not.  RUTH  Your dog. I saw you. I have a sign  there, says   No Shitting .  DOG MAN  Where?  RUTH  (pointing furiously)  Right there, man!  DOG MAN  It says that?  RUTH  It’s a   picture   but that’s what it  means!  DOG MAN  Well...I didn’t see it.  RUTH  YOU SHOULDN’T NEED A SIGN! WHAT’S  WRONG WITH YOU?  Pink (mm/dd/yyyy)   16. Ruth glares. Dog Man frowns. The dog pants happily. Finally--  DOG MAN  Fine.  And he trudges away, slower.   Sk. Sk. Sk.   Pausing to pick up  the flyer wad as he goes.  Ruth watches him go. Utterly astonished. She looks down at--  HER HAND, which is as steady as can be.  INT. FRONT ROOM - RUTH’S HOUSE - DAY  Ruth strides to her STEREO and drops on an OLD SOUL BOOGIE  (let’s say ”Twine Time” by Alvin Cash & The Crawlers) which  carries us through--  INT. BEDROOM - SAME  Ruth SCRUBBING hard at the sticky FINGERPRINT POWDER RESIDUE.  INT. BATHROOM - SAME  Ruth GATHERING the spilled leftover medicine items.  INT. KITCHEN - SAME  Ruth SLIDING the spilled drawers back into place.  INT. SUN ROOM - SAME  Ruth DRILLING a BRASS SLIDING BOLT onto the screen door.  INT. KITCHEN - SAME  CLOSE ON THE POLICE REPORT, snatched off the table.  THE BUSINESS CARD stapled to the corner of it,   Sgt. William  Bendix - Robbery Frau",
      "dialogue_count": 0,
      "word_count": 982
    },
    {
      "scene_number": 8,
      "slugline": "INT. CHECKOUT LINE - ART STORE - DAY  Ruth and a SULLEN TEENAGER get there at the same moment, but  Ruth defers, ‘ After you ’, holding a PACKAGE OF PLASTER.  INT. KITCHEN - DAY  Ruth whisks WHITE POWDER and WATER in a bowl.   Wk!wk!wk!wk!wk!  EXT. BACKYARD - DAY  LIQUID PLASTER is poured into the FOOTPRINT.  Ruth waits. Bugs BUZZ. She bites a nail. Glances at the sky,  tentatively, like she might see something terrible there.  INT. KITCHEN - DAY  Less-than-impressed, Ruth looks down at--  THE PLASTER FOOTPRINT MOLD she’s made: terribly misshapen and  crusted with dirt. Looks like a burnt jellyfish.  But looking closer she discerns A FLAT STRIPE ACROSS THE  SOLE, the tread pattern interrupted for two inches.   Weird .  And its unusual LIGHTNING BOLT LOGO is visible in relief.  EXT. RUTH’S HOUSE - DAY  Ruth comes outside, WALKS RIGHT INTO CAMERA,   Cape Fear -style,  looks up and down the block...  ...and EXITS FRAME as that same SOUL BOOGIE kicks back in  LOUD. (We can call it RUTH’S ACTION THEME from now on.)  EXT. STREET - DAY  TRACKING BESIDE RUTH, propelled by HER THEME though this  LOWER MIDDLE CLASS NEIGHBORHOOD: small houses in need of  paint, chain link fences, old trucks. She turns up to--  EXT. SHABBY BUNGALOW - CONTINUOUS  Nok-nok!   AN OLD MAN sucking on a squeeze yogurt appears  behind the screen door, squinting out at her.  Pink (mm/dd/yyyy)   20.",
      "characters": [],
      "action_text": "OLD MAN  Yah?  RUTH  I’m sorry to bother you, sir. I’m  your neighbor over there. My house  was robbed yesterday.  OLD MAN  No!  RUTH  Yeah.  OLD MAN  Sonsabitches.  RUTH  Yeah. It was sometime between nine  and six thirty, I don’t suppose you  saw anything?  OLD MAN  Well, I’ll tell you something...  But instead he just takes a long   slurp   of his yogurt, kinda  loses his thought. She waits patiently.  RUTH  What is it?  OLD MAN  (’this?’)  It’s just regular yogurt you can  sip on.  ( SLURRP! )  ...hey, fuck it...  RUTH  What did you want to tell me?  OLD MAN  Oh. It’s all going to hell.  Ruth smiles tightly in thanks and heads off.  OLD MAN (O.S.) (CONT’D)  You know that, dontcha?  EXT. DUPLEX - DAY  Now it’s a YOUNG MOTHER with her BABY on her hip.  21. YOUNG MOTHER  I don’t know nothing about no  robbery.  RUTH  Maybe you saw a strange car. Or  someone acting furtive.  YOUNG MOTHER  Furtive?  RUTH  Sneaky.  YOUNG MOTHER  I know what furtive is. I’m sorry  that happened but I don’t know  anything to tell you.  Ruth nods, disappointed, and looks at the baby.  RUTH  What’s her name?  YOUNG MOTHER  Khaleesi.  RUTH  (tired but genuine)  That’s beautiful.  EXT. JUNK HOUSE - DAY  Now it’s a GEARHEAD with CAR PARTS and TRASH strewn about his  yard, wiping his hands and wolfishly looking her up and down.  GEARHEAD  Suspicious?  RUTH  Or just, like, out of place.  GEARHEAD  Oh, for sure. Just this mornin’ a  Dominican fella came ‘round with a  tree saw and a push mower. Told’m,  ‘I can take care my own lawn ,  thanks,   but good try.’ He knew to  keep moving.  RUTH  I bet.  Pink (mm/dd/yyyy)   22. GEARHEAD  You could gimme your number. If I  thinka something.  RUTH  (turning to leave)  You won’t.  But her ACTION THEME is sounding echoey and distant by now...  EXT. SIDE STREET - DAY  Ruth rounds the corner, uncertainly. Unfamiliar territory.  EXT. OVERGROWN HOUSE - DAY  She crosses the jungle yard, comes up the porch,   nok-noks   on  the door. There’s no answer but...  ",
      "dialogue_count": 0,
      "word_count": 1559
    },
    {
      "scene_number": 9,
      "slugline": "EXT. GROVE STREET - NIGHT  FROM THE STREET SIGN, ‘ Grove Street ’, WE TILT DOWN as RUTH’S  CAR pulls up with its running lights on.  She double-checks HER PHONE, her face eerily green in the  screen’s glow, and looks across at--  129 GROVE STREET , a trashed-out party hovel at the end of a  GRAVEL DRIVE. YOUNG FOLKS milling in the dark yard. RAP  fuzzes from inside, people HOOT and CACKLE down there.  RUTH glances up and down THIS BLOCK of dark shabby houses,  craggy low-hanging trees, deep shadows. Spooky, all of it.  She swallows, returns her attention to--  129 GROVE, where a GIRL now clumsily TWERKS in the yard as  SEVERAL BOYS film her with their phones, itching themselves.  On Ruth.   Hmm.  129 GROVE, where one of the BOYS is now doing PUSH UPS with  ANOTHER GIRL balanced on his back, sloshing her drink.  GIRL  (distantly)  Wooooooo!  On Ruth.   Hmm.  129 GROVE, where A BOY is arranging a WATERMELON before  ANOTHER BOY who is spraying a AEROSOL into a “POTATO GUN” (a  homemade contraption of PVC PIPE.)  On Ruth,   Hmmm , just opening her door when--  BAM!   THEY   FIRE   THE POTATO GUN AND THE WATERMELON   EXPLODES .  On Ruth,   HOLY SHIT , slamming the door and SPEEDING AWAY.  EXT. TONY’S HOUSE - NIGHT  Tony opens the door. Ruth looks wild-eyed. Fast dialogue--  RUTH  I need back-up.  TONY  (zero hesitation)  Okay.  Pink (mm/dd/yyyy)   29.",
      "characters": [],
      "action_text": "RUTH  You got those ninja sticks?  TONY  Nunchaku   is an Okinawan weapon--  RUTH  Fine--  TONY  “Ninjas”, as you call them, are--  RUTH  Right, okay--  TONY  I got something better.  RUTH  Fine. I just--  TONY  Do you know what a morning star is?  RUTH  I just-- no, I--  TONY  Lights out.  RUTH  I just need you to ride with me.  TONY  Right on.  RUTH  I’m Ruth.  TONY  I’m Tony.  RUTH  Nice to meet you.  TONY  Coooool.  EXT. GROVE STREET - NIGHT  RUTH’S CAR pulls up again: Tony is driving now (with Brian  panting in the back), Ruth sits shotgun, pointing--  Pink (mm/dd/yyyy)   30. RUTH  There.  129 GROVE, where the party appears to have moved inside. One  lone longhair SMOKER lingers by the front door.  Tony nods, all business, but then...bows his head, steeples  his hands under his chin, WHISPERS to himself.  Ruth watches in confusion.  EXT. 129 GROVE STREET - NIGHT  ON THE DRIVEWAY, Ruth and Tony walk towards us:   kunch kunch  kunch   on the gravel. He carries a MORNING STAR FLAIL and his  BELT BUCKLE contains a THROWING STAR.  She looks profoundly anxious as--  RUTH  Were you   praying ?  TONY  You asked for help. I asked for  help. That’s how things get done.  (with a sidelong smirk)  Don’t worry...I’m not gonna let  anything happen to you.  TRACKING WITH THEM as they approach the HOUSE. Up ahead, the  SMOKER sees them coming, takes a wary drag.  They arrive. A long beat of nobody knowing what to say.  RUTH  My computer is inside this house.  SMOKER  Say what?  She shows him her PHONE with the blinking LOCATION APP but--  SMOKER (CONT’D)  I don’t know what the fuck that is.  RUTH  I don’t want trouble. My computer  was stolen, this says it’s in  there, I just want it back. No  questions. Can you please get it?  SMOKER  I can get deez nuts.  31. RUTH  (perfectly confused)  You   can get these nuts?  TONY  Okay, tough guy, you had your  chance--  And then this all happens very fast:  TONY DROPS INTO A FIGHT STANCE AND   SPINS   THE MORNING STAR--  BUT SMOKER   IN",
      "dialogue_count": 0,
      "word_count": 1823
    },
    {
      "scene_number": 10,
      "slugline": "EXT. UPSCALE NEIGHBORHOOD - NIGHT  Christian walks briskly down the block, out of breath. His  shirt has a little bit of blood on it.  He glances back at the DISTANT VOICES back there...  VOICES (O.S.)  Oh my God! Call 911!  ...and sprints onward to the VAN parked in the shadows.  EXT. SECLUDED LOT - NIGHT  THE VAN pulls in, the lights cut off. Christian hops out.  EXT. DARK WOODS - NIGHT  The SILHOUETTE of Christian drifts towards us, pausing now to  listen, head cocked like a bird.  CHRISTIAN  Marshall?  A SHIMMERING FEMALE FACE glows out of the blackness, briefly  illuminated by her cigarette cherry. Her name is DEZ (20s),  hippie-child wraith with strange serpentine eyes.  She gestures   c’mon   and melts away in a swirl of smoke.  EXT. THEIR CAMP - NIGHT  Dez leads Christian over a ridge to a LOW CLEARING where...  A MAN-SHAPE is hunched beside a small CAMPFIRE. Sucking a  THIN GLASS PIPE, setting it down with a euphoric exhale.  He runs a comb through his greasy hair. Homemade CAT TATTOOS  on his hands. This is MARSHALL (50s): maybe a hobo, maybe a  ghoul in his ratty car coat and shredded cowboy boots.  Dez stretches out on her sleeping bag, watching as...  Marshall pats the ground beside him. Christian sits and  brings out the STOLEN ITEMS, offers them to Marshall who  holds them in the firelight for inspection. He is pleased.  MARSHALL  Now   we’re cooking with gas.  38.",
      "characters": [],
      "action_text": "And Christian, in turn, is pleased. He’s a good puppy. In  fact, Marshall literally scratches him under the chin.  PUSHING IN ON MARSHALL as he smiles his yellow teeth at Dez.  PUSHING IN ON DEZ as she blows smoke, gives him a kissy face.  INT. FRONT ROOM - EARLY NEXT MORNING  The CEILING FAN whirs. Ruth rises into frame: peering down  through her red-eyed hangover at--  Tony, dead asleep on the couch, drooling freely.   Snrr.  She drops back out of frame again.  INT. KITCHEN - DAY  Ruth and Tony quietly eat pancakes. Occasional furtive  glances at each other. Forks   clink   on plates.  Brian pants on the floor, looking from one to the other.  After a bit, Ruth digs into her pocket, brings out that  NAPKIN, stares at it a moment...and slides it across.  Slowly chewing, Tony stares at it.  SILLS , reads the scribble,   RR 2   BOX 19 .  He lifts his eyes to hers. He nods one time. She nods back.  EXT. KILLER SILLS’ PLACE - DAY  ON A RURAL ROUTE MAILBOX, ‘ 19 - SILLS Salvage Consignment’,  which we PAN OFF OF as RUTH’S CAR pulls into this DUSTY LOT,  parks next to an EMPTY SPOT.  Ruth and Tony get out, glance about, and we TRACK WITH THEM  past ROWS OF TABLES stacked with all manner of SECOND-HAND  JUNK. Hot sun and dust, FLIES buzzing steadily over it all.  A handful of SHOPPERS, poor folks with sunburns, quietly pick  through old baby clothes and used sewing machines.  The nexus of it all is a corroded BARN, its high doors  opening into a cave of blackness. As they drift that way...  39. TONY  (hushed)  Maybe we should hold hands.  (off her ‘ huh? ’ look)  Like we’re engaged.  So, hand in hand now, they approach the BARN. She notes:  THE WEIRD SYMBOLS, burned into the transom:   porcupine logos  and Evil Eyes and Masonic pyramids.  A FADED ‘TRUTHER’ POSTER: the burning WTC and   ‘Do the Math!’  A DISUSED CAROUSEL HORSE leaning against the barn.   NOT A REAL  HORSE , the hand-scrawled sign informs us.  INT. BARN - KILLER SILLS’ PLACE - SAME  As they enter the dim int",
      "dialogue_count": 0,
      "word_count": 1315
    },
    {
      "scene_number": 11,
      "slugline": "EXT. KILLER SILLS’ PLACE - SAME  Christian hustles out, counting the bills as he moves.  Ruth follows, hugging the SILVER SET, hypnotized by him.  INT. RUTH’S CAR - SAME  Tony twists in his seat to see her trailing   slowly   along--  TONY  C’mon, c’mon, c’mon...  EXT. KILLER SILLS’ PLACE - SAME  TRACKING RUTH through the tables, Christian angling away from  her, towards the VAN when--  KILLER SILLS (O.S.)  Hold on there...  She looks back to see Sills coming after her, pointing.  INT. RUTH’S CAR - SAME  Through the back window, Tony watches Sills approaching Ruth--  TONY  Oh, no, no, no...  --and now notices Christian hopping into the VAN’S DRIVER  SEAT, Marshall giving him an oily salute as they BACK OUT.  EXT. KILLER SILLS’ PLACE - SAME  Seeing the VAN start to pull away--  RUTH  STOP! HALT!  --she breaks into a TROT, still hugging the silver set.  And seeing   this , Sills now RUNS after her.  KILLER SILLS  OH NO YOU DON’T!  SHOPPERS watch idly as the hobbity old man scrabbles after  the young woman awkwardly jogging away with the wooden box.  44.",
      "characters": [],
      "action_text": "KILLER SILLS (CONT’D)  JUST STOP RIGHT THERE!  RUTH  THIS IS STOLEN PROPERTY.  KILLER SILLS  C’MERE!  RUTH  NO!  Sills swoops in, CLUTCHES HER ELBOW--  A FLASH OF IMPULSIVE RAGE: RUTH JERKS FREE AND-- SMAK! --BASHES  SILLS IN THE FACE WITH THE BOX. SILVERWARE FLIES LOOSE.  He staggers, stunned, BLOOD in his mouth.  Wide-eyed SHOPPERS saw this happen:   oh shit, she’s evil.  Ruth sways, aghast:   what have I done?  RUTH (CONT’D)  Oh...no...I didn’t....  Sills turns his face up to her and we see it change, filling  with RAGE of his own, and he LASHES at her like a viper--  KILLER SILLS  YOU HIT ME!  Awkward and instantaneous, SHE THROWS UP ONE ARM TO WARD HIM  OFF BUT HE GETS HOLD OF HER MIDDLE FINGER AND-- SNAP!  They break apart and the color drains from Ruth’s face as--  SHE LIFTS HER HAND,   SEES HER FINGER BENT BACK NINETY-DEGREES .  RUTH  Guh.  Tight on Killer Sills, livid--  KILLER SILLS  Now look what you made me do--  THUP!   TONY’S FOOT IMPACTS THE SIDE OF HIS FACE AND SILLS  DROPS LIKE A SACK OF WET LAUNDRY.  TONY  SIDE KICK.  45. Tony hurriedly tosses whatever SILVER he can back into the  box, quaking with giddy adrenaline over what he just did.  Sills is out cold, mouth agape, SNORING as FLIES buzz him.  Ruth is hunched over, clammy-grey, gazing miserably out at--  THE VAN DISAPPEARING AROUND A DISTANT CURVE IN THE ROAD.  As Tony helps her to her feet--  TONY (CONT’D)  That was a side kick.  A few Shoppers are stealing shit now and running away.  INT. EMERGENCY ROOM - DAY  CLOSE ON RUTH’S HAND as a splint is applied to her finger.  CLOSE ON THE DOCTOR, focusing on his work for a bit. Then...  DOCTOR  The uh...that   mail slot , huh?  CLOSE ON TONY, observing from the sidelines, tight-lipped.  CLOSE ON RUTH, looking sad and exhausted.  RUTH  Yeah.  A beat.  DOCTOR  Must’ve really slammed it hard.  Her lip quivers, almost crying but not. Softly...  RUTH  Slammed the shit outta it.  CLOSE ON A BOX OF ‘ PERCODAN’   being opened.   Rip!  CLOSE ON RUTH’S HAND, ",
      "dialogue_count": 0,
      "word_count": 1712
    },
    {
      "scene_number": 12,
      "slugline": "EXT. THE VAN - ROADHOUSE PARKING LOT - SAME  VUMP!   The van door slides open and Donkey Dick sets the PAPER  BAG inside with a   clink!   A semi-private staging area.  Christian and Dez are hanging back, but they crane to see--  As Marshall opens the bag, practically salivating.  It’s TWO HANDGUNS (a 4-INCH .38 REVOLVER & a .45 AUTO) and a  SAWED-OFF DOUBLE-BARREL SHOTGUN. Loose SHELLS in Ziploc bags.  Marshall works the action on the shotgun,   klik! k-klak!   It’s  kind of rusty and banged up, not the cleanest weapon.  MARSHALL  Action’s a little janky.  DONKEY DICK  Gonna do brain surgery with it? Get  whatcha pay for n’ you could barely  pay for this.  Donkey Dick swats him and Marshall hands over the CASH.  As Donkey Dick counts it, Marshall gives a satisfied nod to  Dez and Christian and slides the bag out of sight.  MARSHALL  (turning to Donkey Dick)  Very happy that we could finally--  WAK!   DONKEY DICK SLAPS MARSHALL SO HARD ACROSS THE FACE THAT  HIS DENTURES POP OUT AS HE FALLS.  Christian steps forward but Dez subtly blocks him:   don’t .  Donkey Dick pockets the money, shakes his hand out.  DONKEY DICK  Bring my Mom into it.  The kids wait until he’s stomped off before...  Dez scoops Marshall’s DENTURES out of the dirt, reaches into  the van for a bottle of Pepsi to rinse them off.  Christian helps Marshall stand. He can’t help but look  diminished, accepting his teeth and slipping them back in.  But he rallies, a brittle little smile, a hoarse chuckle...  MARSHALL  Eggs and omelets, like they say.  53.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 265
    },
    {
      "scene_number": 13,
      "slugline": "INT. FRONT ROOM - TONY’S HOUSE - DAWN  Ruth stirs out of a deep, sweaty, painkiller sleep on the  couch. Her first movements bring a GASP of pain.  She remembers her BROKEN FINGER, winces at it. Then at...  The plate of AMERICAN CHEESE SLICES (wrapped) and a SODA POP  that Tony put out for her. A faint smile at that.  But next to it is her SILVER SET, badly scratched, some bent  utensils sticking out. And her expression hardens.  TONY (O.S.)  How’s the finger?  WIDER, Tony’s shirtless in the kitchen doorway with a bowl of  CEREAL, sweaty from a workout. Ruth stares at her silver.  RUTH  (almost to herself)  Fuckers got away.  TONY  Yeah, but...you got it all back,  right?  RUTH  They were inside my house.  TONY  (philosophical shrug)  So give the cops the tag number.  Doubt they can do anything...but  you never know.  RUTH  (clenched teeth)  I didn’t   get   the tag number.  TONY  (mouth full of cereal)  Oh, I did.  She swivels slowly to face him. He chomps, open faced.  TONY (CONT’D)  Didn’t I say that?  INT. TONY’S BEDROOM - DAY  HIS COMPUTER is clicked on.   Bzzt!  54.",
      "characters": [],
      "action_text": "SCREEN GLOW REVEALS BRIAN, panting happily in the darkness.  TONY SPINS in his chair to face us, bathed in SCREEN GLOW.  TONY  It’s all just ones and zeroes.  Binary data connected by threads,  like a web.  RUTH  Yeah. It’s... called   the Web.  She glances around the DIM MESSY ROOM: dirty socks, microwave  popcorn, a samurai sword. Heavy CURTAINS keeping the sun out.  TONY  (like he didn’t hear her)  Just gotta know how to dodge the  spiders.  He TYPES, hard and fast, “The Master Hacker” apparently.  TONY (CONT’D)  (under his breath)  You’re so sly, but so am I...  ON SCREEN, a waterfall of PORNO POP-UPS.   Amateur Slutz! , etc.  TONY (CONT’D)  (hastily rebooting it)  Oops.  SECONDS LATER, he’s TYPING hard again, totally focused.  TONY (CONT’D)  (under his breath)  Open sesame...  ON SCREEN, it’s just GOOGLE: “ look up a license plate? ”  TONY (CONT’D)  Oh. Need a credit card.  SECONDS LATER, Ruth’s reading her VISA as he TYPES along--  RUTH  Eight. Four. Six. Nine. Five. Zero.  Zero. Zero. One.  TONY  And the expiration?  RUTH  Eleven, nineteen.  55. TONY  CVC code?  SECONDS LATER, he   clicks!   the mouse and they both lean in.  TONY (CONT’D)  (under his breath)  Gotcha.  ON SCREEN, a results page for   WWW.TagSearch.COM,   which reads  VEHICLE REGISTRATION:   RUMACK, CHRISTIAN S. , 8800 LAKE CIRCLE.  RUTH  (like spitting out acid)  Christian Rumack.  INT. BENDIX’S CUBICLE - POLICE STATION - DAY  Ruth sits anxiously, watching Detective Bendix gloomily poke  at her PLASTER FOOT MOLD with his pen. Eventually...  BENDIX  What do you do, Miss Kimke?  RUTH  I’m a nursing assistant.  BENDIX  Do you enjoy it?  Her answer takes a moment to bloom, unhappily.  RUTH  I don’t know anymore.  BENDIX  Mm. Suppose I came to where you do  that, your hospital--  RUTH  It’s a post-op facility.  BENDIX  Okay, suppose I came there and  said, you know, maybe not that  medicine, Ruth, maybe this one  instead, dontcha think?  RUTH  That’s not what I--  Pink (mm/dd/yyyy)   56. BENDIX  Yo",
      "dialogue_count": 0,
      "word_count": 1321
    },
    {
      "scene_number": 14,
      "slugline": "INT. MAIN ROOM - RUMACK MANSION - DAY  Meredith leads them into the expansive, immaculate home,  genuinely delighted to have visitors, relentlessly cheerful.  MEREDITH  Y’all care for some coffee?  RUTH  No, thank you--   TONY  Not necessary.  MEREDITH (CONT’D)  No trouble, I just press a button  on the machine-- boop!   It’ll do a  cappuccino, too, it’s like A.I.  RUTH  In that case...   TONY  Do you have cashew milk?  MEREDITH (CONT’D)  I bet I can find something!  Meredith breezes off, leaving them in this vast show of  wealth. Tony lingers over a PHOTO of Meredith, beauty pageant  winner, ages ago.  Ruth gazes at ANOTHER PHOTO, A TAN BLOND MAN in pastel racing  leathers, posing himself before some outre CONCEPT CAR.  RUTH  I need to talk with Christian  Rumack. Is he here?  INT. KITCHEN - RUMACK MANSION - SAME  As Meredith works the fancy COFFEE MACHINE...  MEREDITH  Well, he’s   stilll   out. Y’know, with  his “friends.” I expect him back  who knows when. Talk about what?  RUTH (O.S.)  Choices he made.  ...she adds a few fingers of SHERRY to her own cup.  MEREDITH  I oughta make sandwiches, then.  That could take all day.  61.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 191
    },
    {
      "scene_number": 15,
      "slugline": "INT. MAIN ROOM - SAME  As Meredith sets out the COFFEE TRAY for everyone...  RUTH  Do you know Christian’s whereabouts  the day of--  TONY  (sipping his cappuccino)  A machine did this?  MEREDITH  Yup.  TONY  Huh. I worked at a Borders.  MEREDITH  The bookstore?  TONY  Yes, but they had a cafe, too. I  got pretty good with the steamer.  Could do smiley faces, winking  faces, uh, peace symbols, hearts...  MEREDITH  Wow.  TONY  Oak leaves. Just takes practice.  RUTH  Would you happen to know  Christian’s whereabouts the day  before yesterday?  MEREDITH  I’d barely know his whereabouts   any  day. He comes and goes, y’know?  Ruth glances around, vaguely confused.  RUTH  But...he does have a job?  MEREDITH  Some’d argue that’s all he has.  RUTH  What’s he do?  Meredith looks at Ruth over the rim of her cup.   Gulp, gulp.  Pink (mm/dd/yyyy)   62.",
      "characters": [],
      "action_text": "MEREDITH  (air quotes)  “Lawyer.” You know.  RUTH  Is...he in his van now?  MEREDITH  Oh...  At “van”, her vibe shifts: smirky disdain to curious concern.  MEREDITH (CONT’D)  That’s Chris   Junior   you’re talking  about. Christian got him that van  for his sixteenth if he got all  B’s. He flunked but got to keep it  anyway. Just sayin’.  Ruth processes.  RUTH  Do you know where your son is now?  MEREDITH  Step -son. I have no idea where he  is. We haven’t seem him in, jeez,  almost a year? He got into drugs,  was in jail a little bit, started  running around with people he met  in there. Creeps. His father  finally cut him off, just recently,  cancelled his ATM cards,  everything. Tough love and whatnot.  (dropping her voice)  TMI but Chrissy always made me  kinda nervous, even before all  that. You ever see   The Omen ?  RUMACK (O.S.)  The hell is this?  CHRIS RUMACK (50s), a WASP God, the race car man from the  photo, apparently at the end of an all-night bender, glares  unsteadily from the vestibule with CESAR (40s), his flunky  with the dead-eyed look of private security.  MEREDITH  The police are asking about  Chrissy.  Rumack pointedly zips his fly, which was down, and...  Pink (mm/dd/yyyy)   63. RUMACK  (to Ruth/Tony)  That your shitbox out front?  RUTH  Y-yes, sir, but--  Fast: Cesar draws a GLOCK 9MM from a concealed carry holster  and levels it on Ruth and Tony--  CESAR  HANDS.  Their hands go up so fast   both   coffee cups go flying.   K-kash!  MEREDITH  (’ the rug .’)  Ohh.  Cesar darts forward to quickly pat them both down, and--  CESAR  DO NOT MOVE.  --he darts from the room in a tactical crouch as Rumack  watches them, nastily amused, polishing his half-tints.  Ruth and Tony: both visibly freaked out.  RUTH  Sir--  He puts a finger to his lips.   Hush . And she does.  He takes a moment, pulls his tie the rest of the way off,  rubs his red, puffy eyes, smacks his lips. And finally...  RUMACK  Meredith. Are you retarded?  MEREDITH  Don’t you   dare   ",
      "dialogue_count": 0,
      "word_count": 1411
    },
    {
      "scene_number": 16,
      "slugline": "INT. VAN - DOWN THE ROAD - SAME  Christian, Marshall, and Dez watch RUTH’S CAR vanish around  the bend. As her ENGINE fades in the distance, Marshall looks  sternly to Christian, as if expecting an explanation.  CHRISTIAN  I...I have no idea.  MARSHALL  Yeah? Cause they were at the place  yesterday, too.  CHRISTIAN  What? No, they weren’t--  DEZ  Yeah, they were. The girl yelled at  us.  Christian gapes, flummoxed and airless.  CHRISTIAN  I mean...fuck it, let’s just do it,  he’s finally there now--  MARSHALL  (pointing after Ruth)  I’m not doing a damn thing until I  know what   their   piece in this is.  They’re on us yesterday, they’re  here today, she’s obviously nuts,  you telling me you’re   comfortable  with that? We already got the  security man to think about. You  wanna walk into some kinda dog-fuck  n’ take another fall?   Cause ol’  Marshall will not be there this  time to put a coat on ya, that’s  for certain.  CHRISTIAN  Okay. Fine. What’m I supposed to do  about it?  DEZ  Ask her.  He looks to Marshall, whose blank look co-signs the order:   do  it . So Christian pops it into gear...  70.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 190
    },
    {
      "scene_number": 17,
      "slugline": "INT. RUTH’S CAR (MOVIN) - DAY  Who drive in moody silence with the TIGER frozen mid-roar  behind them. The silence stretches. Eventually...  RUTH  What?  TONY  What do you mean,   what ?  RUTH  What’s your problem?  TONY  That’s not your lawn tiger.  RUTH  Did you hear that guy?  TONY  I heard him. But he’s not the one  that broke into your house and  that’s not your lawn tiger. If I’d  known that was gonna be the, the,  y’know, the objective...  RUTH  I get it.  TONY  Of the mission.  RUTH  I get it.  Long beat.  TONY  I wouldn’t have participated.  RUTH  Yeah, I get it.   And thanks for the  backup in there.  TONY  The--? All I’ve   done   is back you  up.  RUTH  ‘Til now.  He doesn’t know how else to say it, so...  71.",
      "characters": [],
      "action_text": "TONY  That’s not your lawn tiger.  She hasn’t looked at him the whole time and she doesn’t now.  RUTH  (under her breath)  Right. ‘What would Jesus do’, huh?  Ouch.   He turns away. Moody silence resumes, big time.  EXT. STREET - TONY’S HOUSE - DAY  RUTH’S CAR pulls over at Tony’s house. Can a car look morose?  Tony gets out without a word. Ruth watches him go: she’s  cooled off and she feels rotten.  RUTH  Tony...  He gives a little   forget it   wave without looking back and  disappears inside.  EXT. FRONT YARD - RUTH’S HOUSE - DAY  CLOSE ON THE ‘NO DOG SHIT’ SIGN, as RUTH’S CAR jerks to a  halt in the out-of-focus background, and out-of-focus Ruth  then wrestles the TIGER out...  She KICKS the sign in anger as she passes it.   Thup!  INT. FRONT ROOM - RUTH’S HOUSE - DAY  THE BAG with the HEAVY PLASTER MOLD drops on the table.   THUD.  THE TIGER is hurled into the room.   Pash!  Ruth KICKS IT only to stub the shit out of her toe-- wak!  RUTH  FUCKING...THING.  She flops onto the couch, drops her face into her hands,  clutches fistfuls of her hair: some old fashioned seething.  In time, she deep-breathes herself out of the red zone and  stares out the window a while. What a fucking mess.  ALL IN ONE SHOT NOW, she gets up and heads into...  72.",
      "dialogue_count": 0,
      "word_count": 362
    },
    {
      "scene_number": 18,
      "slugline": "INT. KITCHEN - HALLWAY - CONTINUOUS  ...with her OPENED FRONT DOOR visible in the background until  she veers off to the fridge. Opens it. Gets a beer.  Gulping deeply from the can, WE TRACK WITH HER BACK THE WAY  SHE CAME, her FRONT DOOR reappearing in the background and...  CHRISTIAN is now standing just outside it, this dark  background shape she wisps by without noticing and heads into-  INT. BEDROOM - CONTINUOUS  Where she peels out of her sweaty shirt, slips on a fresh  one, pauses to gulp more beer. Feeling a little better.  INT. KITCHEN - HALLWAY - CONTINUOUS  She comes back but pauses suddenly, looking at...  THE EMPTY FRONT DOOR which, eerily,   is just now shutting   the  last few slow inches on its pneumatic closer.   Pssshh-click.  She stares at that. Walks towards it.  INT. FRONT ROOM - CONTINUOUS  LEADING HER towards the door as she looks out, up and down  the block, but sees nothing. Huh. Weird.  BEHIND HER, Christian materializes in the KITCHEN DOORWAY.  He’s right there, inside the fucking house. That crazy grin.  Her back is to him, taking a sip as he walks towards her.  Twelve feet away. Eight feet. Five feet...  CHRISTIAN  What’d you tell my Dad?  GASP!   She WHIRLS at his voice--  HER DROPPED BEER crashes to the floor-- KAK!  TERROR REFLEX: SHE GRABS THE PLASTIC BAG WITH THE HEAVY  PLASTER MOLD IN IT AND SWINGS IT IN A BRUTAL ARC AND--  SHAK!   THIS MAKESHIFT FLAIL CRUSHES HIS LARYNX.  This was all maybe three-quarters of a second. Christian  staggers, astonished, both hands jerking to his throat which  is making a horrible, reedy, WHISTLING NOISE.  73.",
      "characters": [],
      "action_text": "Ruth, pulsing with shock and adrenaline, steps aside as--  Christian lurches past her, struggling for air he can’t get,  giving an almost reproachful look of   Why’d you do that?   as--  EXT. FRONT YARD - STREET - SAME  --he stumbles outside, heaving and buckling, his FACE QUICKLY  TURNING BLUE before our very eyes. Remember Luca Brasi in   The  Godfather ? Like that. Nightmare stuff.  Ruth steps out after him, stunned into inaction, watching in  helpless horror as--  Christian staggers down the MIDDLE OF THE ROAD, like he can  somehow outrun his own suffocation. Scared to death.  INT. VAN - DOWN THE STREET - SAME  Marshall and Dez, watching this unfold from a distance--  MARSHALL  Ahh fuck...  EXT. STREET - RUTH’S YARD - SAME  In his dying panic, Christian has picked up some speed,  hobble-lurching towards the INTERSECTION up ahead...  His face is PURPLE, clawing his throat, GURGLING pitifully...  Ruth is at the edge of her yard but still basically frozen,  weakly shaking her head like   wait wait wait--  IN THE DISTANCE, CHRISTIAN DARTS PAST THE   TWO-WAY STOP SIGN  INTO THE ROAD AND IS   INSTANTLY CREAMED BY A FAST-MOVING BUS .  We actually cut away one frame before the moment of impact  but IT SOUNDS LIKE A ROAST BEEF DROPPED FROM A SKYSCRAPER.  At once: Ruth’s SCREAM, the terrible SCREECH of bus brakes--  INT. VAN - DOWN THE ROAD - SAME  MARSHALL  Hoo boy.   DEZ  God damn.  74.",
      "dialogue_count": 0,
      "word_count": 509
    },
    {
      "scene_number": 19,
      "slugline": "EXT. FRONT YARD - SAME  ON RUTH, barely upright under the shock of this moment,  digging into her pockets with clumsy hands as, from the O.S.  ACCIDENT SCENE, we hear a clamor of SCREAMS...  VOICES (VARIOUS O.S.)  DON’T TOUCH HIM! / --AN AMBULANCE!  / --RAN OUT IN FRONTA ME!  She gets her PHONE out, trying to remember how to work it--  INT. VAN - DOWN THE ROAD - SAME  Jerking it into gear--  DEZ  She’s calling, she’s calling--   MARSHALL  I see it, I see it--  EXT. FRONT YARD - SAME  Ruth turns away from the CHAOS DOWN THE STREET, gulping for  breath, the PHONE to her ear--  PHONE V.O.  911 operator, what is your  emergency?  RUTH  Uhhhhhhhh.  PHONE V.O.  Ma’am?  RUTH  He just, he was just, he he he--  There’s a NEW SCREECH of tires, very close behind her, and--  DEZ (O.S.)  I can help you, honey.  Ruth turns around just in time to see--  DEZ SWINGING THE BUTT OF A SHOTGUN AT HER FACE.   KRAK.  CUT TO BLACK.  Pink (mm/dd/yyyy)   75.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 173
    },
    {
      "scene_number": 20,
      "slugline": "INT. VAN (MOVING) - DAY  BLACKNESS. Occasionally penetrated by SMEARS OF LIGHT.  MARSHALL (V.O.)  She mighta said our names.  DEZ (V.O.)  She doesn’t know ‘em.  MARSHALL (V.O.)  She knew Chrissy’s alright.  DEZ (V.O.)  We oughta kill her anyway, then.  MARSHALL (V.O.)  Ask her when she wakes up.  DEZ (V.O.)  Oh, she’s awake now.  CLOSE ON RUTH, jouncing on the floor of the van, a SWOLLEN  GASH above her eye. Stripes of SUNLIGHT wipe her face,  rhythmically. She’s terrified. She squirms but...  HER WRISTS are bound with duct tape.  Painfully, she cranes her neck around to see--  MARSHALL AND DEZ: THEIR HEADS MADE OUT OF CLOTH. Homemade  masks, t-shirts with eyeholes. Creeeeepy.  Marshall drives. Dez stares back at her, holding her PHONE.  DEZ  What’d you tell ‘em?  RUTH  Nothing.  DEZ  Promise?  RUTH  I don’t know who you are.  Dez chucks the phone out the window.  DEZ  How’d you find Chrissy?  76.",
      "characters": [],
      "action_text": "RUTH  C-computer.  DEZ  And what? You just went after him  on your own?  RUTH  I   tried   to tell the cops.   Before.  But they didn’t listen. I swear.  DEZ  What about his dad?  RUTH  He didn’t care either!  Dez stares at her, like trying to see inside her brain.  DEZ  (to Marshall)  Whatcha think?  MARSHALL  (gloomy & fatalistic)  Soon as they peel Chrissy outta  under that bus there’s gonna be  people coming over anyway...what a  buncha bullshit.  DEZ  Better hustle then.  CLOSE ON RUTH AGAIN, drooping back down, eyes clamping shut.  RUTH  (barely audible)  ...please...  INT. FRONT ROOM - TONY’S HOUSE - DAY  SLOWLY PUSHING IN ON TONY, slumped there on the couch. His  eyes land sadly on something O.S. and he reaches for it.  Crinkle, crinkle.   He lifts the now-unwrapped slice of  American cheese to his mouth for a sad nibble.   Chew, chew,  chew.   Washes it down with some soda.  Ahh . There. He feels a little better now. Looks over at...  Brian, curled in the corner, staring back as if in  anticipation. Tony’s expression becomes serious again.  77.",
      "dialogue_count": 0,
      "word_count": 330
    },
    {
      "scene_number": 21,
      "slugline": "EXT. ACCIDENT SCENE INTERSECTION - DAY  THE BUS AND VARIOUS COP CARS as out-of-focus foreground  elements. LIGHTS FLASHING and BLURRY OFFICIAL HUBBUB.  IN THE BACKGROUND, at the rear of the small CROWD at the  yellow tape, TONY’S HEAD pops up above them, scanning as--  IN THE FOREGROUND, a STRETCHER goes by, a BODY under a sheet.  Tony questions an ONLOOKER, who gestures at the cops and bus.  EXT. RUTH’S HOUSE - DAY  Tony approaches and gives a light   knock-knock   but...THE DOOR  was a little bit opened already.  INT. FRONT ROOM - RUTH’S HOUSE - SAME  He steps inside, hesitantly.  TONY  Ruth?  No answer. He looks over at...  THE TIGER, sideways on the floor, silently snarling at him. A  DOOMY SCORE kicks in and carries us over to...  EXT. THE VAN - WOODED DRIVE (MOVING) - DAY  THE VAN pushing ominously through the woods.  INT. VAN (MOVING) - DAY  Ruth rocks forward as the van comes to a halt.  Marshall looks back at her, the .45 loose in his hand.  Dez loads the RUSTY SHOTGUN.   She has to force the shell in .  Ruth shivers, waiting for whatever’s next. She watches as...  Marshall WHISPERS something in Dez’s ear, who listens, her  eyes on Ruth. She WHISPERS something back. It’s decided.  With his free hand, Marshall brings out the REVOLVER and aims  it at Ruth’s face. Cringing away from it...  78.",
      "characters": [],
      "action_text": "RUTH  Don’t don’t--  He pulls the trigger, she SHRIEKS, it makes a dull   click .  MARSHALL  You’ll carry this one, okay?  RUTH  W-why?  MARSHALL  Cause we’re shorthanded. Which is  on you.  RUTH  I don’t want to.  For a second, Marshall’s eyes look damn near sympathetic.  MARSHALL  That’s what life is, darlin. Buncha  stuff we don’t wanna do.  RUTH  You could leave me here. I-I-I’ll  be so quiet. I promise.  His eyes turn hard and demonic inside the mask. His gestures  accentuate those CAT TATTOOS on his hands.  MARSHALL  Get them to open the door. Point  that at whoever it is so nothing  happens. We’ll get what we need and  we’ll leave and that’s it.  RUTH  But how do I know you won’t,  won’t...  She can’t even finish the thought.  MARSHALL  You know that I   will   if you   don’t .  DEZ  It’s karma, for Chrissy...  Dez holds up a SWITCHBLADE and-- snikt! --pops it open.  DEZ (CONT’D)  That shit’s for real, sister.  79.",
      "dialogue_count": 0,
      "word_count": 392
    },
    {
      "scene_number": 22,
      "slugline": "EXT. FRONT YARD - RUMACK MANSION -DAY  The most hopeless version of RUTH’S THEME echoes faintly as  we TRACK HER ACROSS THE LAWN. A long march towards oblivion.  HER HAND shakes violently. Making a fist doesn’t help.  THE REVOLVER is tucked into the small of her back.  THE RATTAN YARD ANIMALS, the now-trunkless elephant and the  giraffe, seem to watch her as she passes by.  She swallows heavily to keep from throwing up.  EXT. FRONT DOOR - RUMACK MANSION - CONTINUOUS  ON RUTH, seen from behind, standing at the door.  PULLING BACK, there’s Marshall and Dez on either side of her,  pressed against the house, out of sight, GUNS READY.  Ruth hesitates. Marshall twitches his gun. So she knocks.  CLOSE ON THE PEEPHOLE, which suddenly goes dark.  Ruth attempts a smile. Looks like she drank vinegar.  RUTH  It’s me again. Sorry.  CLOSE ON MARSHALL, off to the side with the .45 up. The cloth  of his mask flutters with his breath.  CLOSE ON DEZ, to the other side, with the shotgun. Her eyes  are cold and steady inside the mask.  THE PEEPHOLE goes clear. The DEADBOLT goes   click-clack .  CESAR opens, eyeing Ruth warily, clocking her EMPTY HANDS.  CESAR  Yeah?  RUTH  Please don’t do anything.  SHE DRAWS THE GUN ON HIM, on   us , that big barrel swinging  right up into the lens.  And Cesar   almost   makes a move but, no, his hands go up.  80.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 237
    },
    {
      "scene_number": 23,
      "slugline": "INT. FRONT ROOM - RUMACK MANSION - CONTINUOUS  Ruth walks Cesar back as Marshall and Dez slip in behind her,  fanning out, already forgetting the still-open front door.  Dez covers the INTERIOR HALL as Marshall snags Cesar’s 9mm  and tosses it aside.  CESAR  I’m compliant.  PAK!   Marshall whacks him behind the ear with the barrel of  his .45 and Cesar drops to his knees, GROANING.  Ruth GASPS at this sudden violence and at that exact moment--  Meredith comes from the kitchen, sees masked people with guns  and-- oops! --turns promptly on her heel to exit again but--  DEZ  Stop.  Fuck.   At least she manages to guzzle her drink even as she  lifts her hands, now recognizing Ruth...  MEREDITH  You.  RUTH  I’m so sorry. This isn’t my fault.  MEREDITH  You took my tiger.  RUTH  That   was me, yes, but not   this--  MEREDITH  You’re pointing a gun.  RUTH  No, I know, but--  MARSHALL  Shut the fuck up. Sit.  CESAR  (from the ground)  Do what they say, Meredith.  As she flops onto the couch in a semi-sober pout...  MEREDITH  ...unbelievable...  81.",
      "characters": [],
      "action_text": "Marshall nudges Cesar to the couch as well but--  MARSHALL  You too. Over there.  --he doesn’t move fast enough so MARSHALL KICKS HIM.   WUNK.  RUTH  Don’t do that!  Meredith reacts to Ruth’s shaken protest-- huh?-- as Cesar  crawls to the couch, hugging his maybe-busted ribs.  Dez keeps the shotgun aimed down the HALLWAY into the house  as Marshall squats before Meredith, hissing--  MARSHALL  Where is he?  MEREDITH  Sleeping one off.  MARSHALL  Call him.  MEREDITH  If you’re here for what you think  you’re here for, your timing  stinks.  CESAR  Meredith, be quiet.  MARSHALL  Call him.  He touches the gun to her chin.  RUTH  Just do it. Please.  Meredith glares hard at Marshall, at Ruth, and then...  MEREDITH  (”happy”)  Hey, Chris?  (beat)  CHRIIIIIS.  RUMACK (O.S.)  (from upstairs)  What?!  Pink (mm/dd/yyyy)   82. MEREDITH  C’MERE.  RUMACK (O.S.)  For whaaat?  MEREDITH  COME HERE.  Angry THUDS and STOMPING from upstairs. Everyone tenses as  FOOTSTEPS come   fump, fump, fump, fumping!   down the stairs.  Dez slides to the side of the HALLWAY DOOR, so she’s poised  right there   but   out of sight from DOWN THE HALL, where--  Rumack now appears, cinching a robe, irritated and confused.  RUMACK  Is Christian here?  MEREDITH  No.  DOWN THE HALLWAY, Rumack is coming towards us but he slows...  RUMACK  His van’s parked out front.  FROM WITHIN THE HALLWAY, RUMACK’S POV: the empty room looming  ahead of him, no sign of anything amiss there. But still...  His eyes narrow. Wondering at the silence. He backs away.  WHILE IN THE FRONT ROOM, Marshall gestures in frustration,  Say something!   At which Meredith shrugs savagely,   Like what?  MEREDITH  Uh. Maybe he’s waiting for you to  come outside? You know he doesn’t  like me too much.  DOWN THE HALLWAY, Rumack reappears but now on   full alert , a  CHROME .38 held before him as he advances.  RUMACK  Cesar?  IN THE FRONT ROOM, Marshall aims at Cesar, finger to his  lips,   shhh!  Ruth just stands off to the side, shaking in p",
      "dialogue_count": 0,
      "word_count": 1708
    },
    {
      "scene_number": 24,
      "slugline": "INT. FRONT ROOM - RUMACK MANSION - SAME  Ruth scrabbles to Tony, fluttering over his wounds--  RUTH  Tony! Tony!   TONY  Oooh she got me good...  IN THE BACKGROUND, Marshall staggers bloody-faced to his  feet... and he is now between them and the front door.  His eyes snap to the .25 AUTO on the ground. He SNATCHES it.  Ruth catches this movement and HEAVES TONY TO HIS FEET--  As Marshall fumbles the gun, racks the slide, aims it--  She shoves Tony out into the--  INT. HALLWAY - CONTINUOUS  BAM! BAM!   SMALL CALIBER GUNSHOTS POP INTO THE WALL directly  behind them as they stumble/flee away, Ruth powering Tony  forward like a busted shopping cart.  EXT. BACK DOOR - RUMACK MANSION - SAME  Ruth and Tony burst outside and she scans frantically for an  escape route, propping him up as he hugs his bloody middle.  INT. FRONT ROOM - RUMACK MANSION - SAME  Look at all this fucking blood. Dead Cesar. Dead Rumack.  Marshall crouches over Dead Dez: silently sobbing and undone.  Wanting to touch her face, her mouth, but afraid to, because  she’s a spirit now.  EXT. REAR GROUNDS - RUMACK MANSION - DAY  TRACKING RUTH AND TONY, most of his weight supported on her  shoulder as they lurch desperately AROUND THE HUGE HOUSE...  EXT. FRONT YARD - RUMACK MANSION - CONTINUOUS  COMING AROUND THE HOUSE, Ruth heaves and strains under Tony’s  bloody semi-limp bulk, but freezing suddenly because--  89.",
      "characters": [],
      "action_text": "MARSHALL, out there in the front yard, crazed and spattered  and   blocking their way to the road.   He spots them, HISSES  like a poisonous toad and LIMP-RUNS towards them.  RUTH JERKS TONY back around the house.  EXT. WOODS - SAME  TRACKING RUTH AND TONY DOWN THIS STEEP INCLINE, weaving  through the brush and tree cover. Tony can barely stand and  Ruth can barely keep him going.  But her face is set: hard and determined.  Behind them, echoing in the forest, the MOON HOWL of a rabid  animal. That’d be Marshall, screaming insane nonsense.  Ruth urges Tony faster. He trips, FALLS, dragging her down  with him, CRYING OUT in renewed pain.  She recovers, helps him up, looks frantically up the hill:  There’s nobody in sight...but she can hear SOMETHING crashing  this way through the brush. It HOWLS again.  MARSHALL (O.S.)  Gonnna get yoooooouu!  RUTH  Tony. Get up. Let’s go.  She powers him up, moves him forward, faster, faster, hurry.  UP AHEAD,   what’s that? , some kind of MIRRORED LIGHT glints  strangely through the veil of old pines.   Water?  EXT. POND - SAME  They burst onto a SMALL SANDY BEACH to see that it’s a  curving tree-lined pond with a FORESTED ISLAND maybe a  hundred yards out there...or perhaps it’s the far banks?  A WOODEN DOCK extends from the beach, with a SMALL OUTBOARD  FISHING SKIFF moored there, as well as a FLAT-BOTTOM ROWBOAT.  Ruth scans: to either side of the beach is just a clog of  roots, brush, eroded earth. Another HOWL behind them,   closer.  RUTH  Come on.  90. She bulls Tony onto the DOCK, lets him sag there as she hops  into the MOTORBOAT where--  She YANKS the motor pull cord. It SPUTTERS and RUMBLES...but  doesn’t turn over. She yanks again. And again.   Nothing.  Her eyes snap to the ROWBOAT.  EXT. ROWBOAT - POND - SECONDS LATER  Tony collapses into the bow, whimpering, as Ruth uses an OAR  to push them off the dock, braces her feet on the hull...  And ROWS LIKE HELL. She has adrenaline super-powers and the  little boat slides out ",
      "dialogue_count": 0,
      "word_count": 795
    },
    {
      "scene_number": 25,
      "slugline": "EXT. MARSHY ISLAND - CONTINUOUS  THE ROWBOAT’S BOW crunches against soft land. Ruth startles,  didn’t realize she was so close, she scrambles into the bow--  SHE DRAGS TONY OUT and grabs the balled-up GREEN WEATHER TARP  as she goes, glancing out at--  THE MOTORBOAT, zooming in, forty feet away, thirty five. She  can see the details of Marshall’s blood-caked face.  DEEPER IN THE BRUSH, she leads Tony to a MOSSY OVERHANG,  presses him down onto the ground, pulls the WEATHER COVER  over him like a kid home sick from school--  RUTH  (frantic whisper)  Stay here. Don’t move. Don’t make a  sound. He’s coming.  TONY  ...w-why?  RUTH  We know who he is.  SHE TEARS HER SLEEVE OFF, presses it to his wounds, presses  his   hands down on top of it...  RUTH (CONT’D)  Keep pressure there, okay? I’ll be  back.  She starts to cover him but he grabs at her hand--  TONY  I’m scared.  RUTH  Me too. Don’t move.  She kisses his forehead, pulls the cover over him and wipes  an armful of DEAD LEAVES over it. Not exactly invisible but  it’ll have to do...  RUTH EMERGES FROM THE TREE LINE and waves her arms just as--  RUTH (CONT’D)  Hey, fuckface!  THE MOTORBOAT RUNS AGROUND and Marshall comes hobbling over  the bow, waving that .25 wildly in her direction.  SHE RUNS back into the TREES,   away from Tony , as--  Pink (mm/dd/yyyy)   92.",
      "characters": [],
      "action_text": "BAM! BAM! BAM!   BULLETS WHIZ OVER AND AROUND HER.  SHE SPRINTS THROUGH THE DARK TANGLE OF VEGETATION.  Her feet SUCK into saturated ground. BRANCHES slash at her  face.  BEHIND HER, Marshall takes steady aim at her quickly  vanishing form and-- BAM!BAM!BAM! Click.  Blowing in frustration, he tosses the empty weapon aside and  dashes after her.  EXT. DEEP INTO THE MARSHY ISLAND - SAME  RUTH LEAPS DOWN A LOW HILL, stumbles, unable to control her  momentum and--  SPLASH!   DROPS INTO BLACK CHEST-DEEP WATER. The layer of  leaves on the surface made it practically invisible.  Gasping and sputtering, she reaches about for something to  hold onto... there!   A ROOT dangling into the pool...  Taking hold, she pulls herself forward... but she freezes.  If her expression was one of frightened determination before,  it is now replaced by a sort of   existential cosmic terror .  CLOSE ON THE BROWN BEADY-EYED SNOUT OF A   COTTONMOUTH SNAKE ,  calmly winding its way across the surface of the dark water.  CLOSE ON RUTH, locking eyes with this evil, alien thing.  A BIRD’S EYE VIEW ON THE POOL:   where Ruth holds perfectly  still and the undulating S-shape of the snake’s body glides  within striking distance of her face . It takes forever but...  ...it passes her by. Not exactly breathing again, she inches  her way up out of the pool, pulling herself on the root.  On solid ground again, shuddering, she looks back to see...  MARSHALL, emerging from the forest, this limping curl-handed  troll. He sees her. His eyes blaze with hate and killin’.  HE LIMP-TROTS towards her.  SHE SCRAMBLES UP A MUDDY RIDGE, taking the high ground.  TRACKING WITH RUTH as she moves along the ridge but, DOWN  BELOW, Marshall keeps pace with her.  93. MARSHALL  I see you, girl.  RUTH DOUBLES BACK but Marshall keeps pace again.  MARSHALL (CONT’D)  Gonna get ya.  SHE HIDES BEHIND A TREE, stooping to grab a BASEBALL-SIZED  ROCK out of the muck at her feet. Catching her breath.  IN THE BACKGROUND, BELOW THE RIDG",
      "dialogue_count": 0,
      "word_count": 1247
    },
    {
      "scene_number": 26,
      "slugline": "EXT. DEEP WOODS - TWILIGHT  Marshall crawls along the forest floor, slug-like, lost. His  face is HUGELY SWOLLEN around black FANG MARKS, a vivid  scarlet hue. His TONGUE lolls wetly in his yellow mouth.  He howls but of course we can’t hear him.  In the sky above, CROWS are already circling.  EXT. MOTORBOAT (MOVING) - TWILIGHT  THE SONG CONTINUES as Ruth angles the boat full-throttle  across the water, tears spilling down her cheeks but wholly  focused on the task of getting them back to shore.  Curled in the bow like a rag doll, Tony could almost be  asleep.  INT. DETECTIVE CUBICLE - POLICE STATION - NIGHT  THE SONG CONTINUES over this CLOSE-UP ON THREE DMV PRINTOUTS:  driver’s license shots of Marshall, Dez, and Ruth.  A HAND slides the shots of Marshall and Dez to one side...and  then taps the shot of Ruth.  It’s MEREDITH, her eyes puffy from crying but in control. She  taps Ruth’s photo again and simply shakes her head.   Not her.  INT. BENDIX’S CUBICLE - POLICE STATION - NIGHT  THE SONG CONTINUES as we find Ruth sitting here, a BANDAGE  over her brow, numbed by grief. She’s very still, just  watching as...  Detective Bendix intently reads over a series of REPORT  SHEETS. He finally sets them aside, nodding to himself.  Ruth stares at him. He stares back. Exhales hugely, about to  make a huge pronouncement.  BENDIX  My wife and I are going to give it  another shot.  He nods sagely, as if this must answer any and all questions.  Ruth stares at him.  97.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 258
    },
    {
      "scene_number": 27,
      "slugline": "INT. BEDROOM - CARE CENTER - DAY  THE SONG CONTINUES and some time has passed now, because Ruth  just has a regular small BAND AID over her brow.  She listlessly strips an empty bed, wadding up sheets that  have a small smear of blood on them. Robotic in her work.  INT. RUTH’S CAR (MOVING) - DAY  THE SONG CONTINUES as we find Ruth though the windshield,  staring numbly out at...  THAT ROLLIN’ COAL PICKUP, ahead of her in traffic again,  blowing its black sooty smoke into the air.  She has no reaction.  INT. CHURCH - DAY  THE SONG CONTINUES as we PUSH DOWN THE AISLE, past rows of  CHURCHGOERS, to find Ruth sitting all alone in the back pew.  She’s staring off, maybe listening to the sermon, maybe not.  EXT. BACKYARD - TWILIGHT  THE SONG FADES AWAY now and we find Ruth sitting in one of  her outdoor chairs, gazing out contemplatively.  An upbeat OLDIE (”Don’t Hang Up” by The Orlons) plays on a  portable speaker somewhere, but sounds distant and faint.  She sips a SODA POP, Tony’s brand. We realize that she is  looking at...  JANA, by the fence, watching a blinking chorus of FIREFLIES.  Not trying to capture them, just watching, delighted.  Angie is in the chair next to Ruth, a fresh drink in her  hand. They sit in silence a moment. Angie eyes her.  ANGIE  You okay?  Ruth nods absently.  ANGIE (CONT’D)  Be gentle with yourself, okay? You  got all the time in the world.  Ruth takes a deep breath, nods again, but...  Pink (mm/dd/yyyy)   98.",
      "characters": [],
      "action_text": "RUTH  I don’t know what that means.  Angie looks out at Jana, shrugs...  ANGIE  It’s just something people say.  Ruth sniffs, a tired little laugh. And then she turns her  head. Sees something. Stares at it a bit.  TONY smiles at her from within a   white Heavenly mist . A dream  or a ghost or a vision.  Ruth smiles back.  WIDER, oh, okay, it actually   is   Tony, for real: he uses a  cane now, and he’s working the smoking grill, just   burning  the shit   out of some hamburgers.  Dan looks on in obvious disapproval, shaking his head.  Tony points the spatula at Ruth, gives an assured thumbs up.  She smiles and looks back to...  THE FIREFLIES. Look at ‘em glow and vanish in the fade.  CUT TO BLACK.  As “I Love You, Honeybear” by Father John Misty takes us into  the credits...  END  Pink (mm/dd/yyyy)   99.",
      "dialogue_count": 0,
      "word_count": 406
    }
  ]
}