{
  "slug": "i-saw-the-light-2016",
  "title": "i saw the light",
  "genre": "drama",
  "format": "film",
  "scenes_count": 18,
  "characters_count": 5,
  "characters": [
    "HANK",
    "FRED ROSE",
    "AUDREY",
    "SONNY",
    "BOBBI JETT"
  ],
  "total_words": 24637,
  "total_dialogue": 9,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. BOARDING HOUSE - CONTINUOUS AUDREY (O.S.) (from inside) You think you're so high and mighty and it’s all you ... Well, I got ambition too and ... YOU   quit goddamn acting like I can’t sing. Hank lights a cig, his back to the door. Suddenly one of his boots nails him in the back. He calmly bends down and picks it up. The other one sails out. He just puts it on and moves out of range. HANK (calling out) Yeah, that's a helluva song Audrey, now why don't you work on your sense of humor. INT. ROADHOUSE CLUB - NIGHT Decent crowd. Music is number three on the list of important things in a joint like this: 1) illegal liquor 2) fighting, then music. HANK (O.S.) (POSSIBLY HONKY TONK BLUES HERE INSTEAD) “And we’ll go honky tonkin’ honey baby, honky tonkin’ honey baby We’ll go honky tonkin’ around this town Camera SNAKES THROUGH THE CROWD that has the air of danger that comes after midnight on a state highway in the middle of the summer. Heavy smoke parts REVEALING creased faces and dirty fingernails; sandpaper hands cup beers and coke bottles filled with cheap clear whiskey. HANK (cont’d) When you and your baby have a falling out Call me up sweet mama and we’ll go stepping out and We’ll go honky tonkin’ ‘round this town ...” These are young rugged farmers and factory workers in their 20’s, watching their women   eat up   Hank while they stroke their girl’s thighs. 7. (CONTINUED)",
      "characters": [],
      "action_text": "HANK ON STAGE. He wears a Stetson, a regular suit and a loosened tie. Behind him is a version of his band the  DRIFTING COWBOYS.   Through the years the name would always stay the same, but the players would change 20 times. For now DON HELMS 20’S on pedal steel guitar and LUM YORK, 20’S on bass; JERRY RIVERS, 20s and one other player (considering Sammy Pruitt). Hank hunches over the microphone, all 150 pounds of him. As he sings, his knees buckle, his hips thrust. For   these days , it’s unique. Visceral. And the sexuality cannot be denied. He yodels, a WOMAN shrieks. Rest of crowd laughs at that. IN THE WINGS is Hank’s MOTHER, LILLIE, 40’s, intense, formidable and nearly as tall as her 6 foot son. She wears a  simple   black dress and ARGUES with Audrey. They don’t now, and never have, liked each other. Lillie FLIPS THROUGH the last bills of “ tonight’s take. ” Then actually starts   counting   the crowd. AUDREY How much we got there,   Miss Lillie ? LILLIE I’m under no obligation to you. AUDREY Right, that goes both ways ... he’s drinking like a fish tonight. LILLIE You think so ... ON HANK. Finishes the song, glimpses over at the two of them. Nods for Audrey to join him. She’s pleased, Lillie’s not. AUDREY Don’t worry Lillie, Hank will hand it over to me before we even get home ... LILLIE I’d be careful little girl, that’s a tinder box out there. Hank grabs a coke bottle full of liquor off the floor. Nearly falls as he does. Big swig, then drapes his arm around Audrey. He kisses her cheek, she leans into him. They roll into   “BLUES COME AROUND”   together .  A SCARY GUY stands up in the crowd. 8. CONTINUED: (CONTINUED) SCARY GUY Hey Williams, you sound like a billy goat. So does she. Hank ignores him. AUDREY ... sit down you horse’s ass. Hank shakes his head at her. She knows better. The Man’s WIFE pulls him back to his seat. SCARY GUY So you hidin’ behind a woman ... You hear me you, you skinny little shit. Hank stops, shares a look with Audrey, a quick glance",
      "dialogue_count": 0,
      "word_count": 809
    },
    {
      "scene_number": 2,
      "slugline": "INT. LILLIE’S BOARDING HOUSE / BEDROOM - DAWN Only a touch of morning light. Hank snores heavily. His pillow is spotted with blood. He has a Band-Aid on his cheek. Audrey is next to him, snoring even louder. The door opens and Lillie enters, stares, then gently shakes Hank. Audrey stirs. Hank reaches over to wake Audrey. Lillie quickly stops him. She does not want   her   along. I/E. ROAD / CHEVY - DAWN TIGHT ON Lillie’s face as she drives fast. Her eyes a study of reflection. LILLIE I know I birthed you Hank ... I was there. (chuckles to herself) But where you came from, how you got what you got and why you have it ... I swear no one knows that. Maybe the Lord ... Maybe. Hank now barely visible in the backseat. Hat pulled over his eyes. HANK (a hoarse whisper) She’s going to be pissed about this. LILLIE Think I care ... I’m doing everybody at the station a favor. That woman doesn’t have clue who’s the star ‘round here. And I haven't been driving you all over the state for 10 years, booking joints and schoolhouses to see her sweep in like she’s the Queen of England. HANK Yeah ... know why you and Audrey don't get along, cause one of you’s afraid the other’s gonna beat her to my pocket when I get drunk. LILLIE How can you say that? That’s hurtful, son. Lillie takes a corner and tires squeal. 10. (CONTINUED)",
      "characters": [],
      "action_text": "HANK Hey, I'm whupped ... that's all. LILLIE Wish that   was   all. When’s the last time you ate? HANK I can’t recall. They barrel in silence. Hank tries to get comfortable, stretches, puts his jacket under his back. Can’t. He’s clearly in pain. LILLIE Your back sore? HANK It’s fine ... INT. JEFFERSON DAVIS HOTEL / WSFA STUDIO - MONTGOMERY - DAY A small studio on the second floor of the hotel. A MICROPHONE says   WSFA/NBC . The band is stretched out on folding chairs behind it. Waiting. They sip coffee and smoke. Hank enters carrying his guitar case and is immediately confronted by the Station Owner, HOWARD PILL. PILL Williams, where you get off wasting twelve minutes of air time? That shit’s not gonna work. Hank turns, stares, says nothing. PILL (cont’d) ... And you smell like a damn still. All of you. The guys stifle laughs, as Hank moves to the mic. Finally. HANK I’m sorry Mr. Pill. PILL Well, that don't mean anything to me. Hank opens his guitar case while signaling to the engineer to get things rolling. The band gathers their instruments. 11. CONTINUED: (CONTINUED) Engineer, SEBIE SMITH, peers through the booth glass to Pill, who has no option. Pill signals “OK” start the show. PILL (cont’d) I’ll boot you, I swear to god, I will. This is a business we’re running, asshole. HANK (dripping sarcasm) Oh I surely know that, Mr. Pill. Sebie counts it down ... HANK (cont’d) Hey, a fine very early good morning to all you friends out there. This is ol’ Hank and the Drifting Cowboys ... we’re awful sorry we’re getting a late jump, but well, last night we   got jumped ourselves   out on Highway 31. (the band LAUGHS) I got a sore head and some other fellows in Alabama got some cracked heads. And oh yeah, there’s one more thing. This looks like it’s gonna be our last program here at WSFA. Hank smiles at Pill who’s staring back at him with disgust. HANK (cont’d) And if any of you out there have enjoyed it, well, we’d like to sure hear from you.   Now how about a little song I",
      "dialogue_count": 0,
      "word_count": 1808
    },
    {
      "scene_number": 3,
      "slugline": "EXT. ALABAMA ROAD - LATE AFTERNOON/DUSK A ‘42 Plymouth rolls across a country bridge. FRED ROSE (V.O.) So I told him I was a Christian Scientist, which he was not likely not to know, and we assert that humanity is spiritual rather than material. That ... that faith has helped me through some dark times ... and he should call me if he needed me. I/E. ALABAMA ROAD / PLYMOUTH - DUSK Don Helms drives, a woman next to him. Hank is stretched out in the backseat, head in Audrey’s lap, bare feet out the window. Radio plays low.(Probably a baseball game). Goes on a bit, then ... DON A damn publishing deal. A publishing deal. AUDREY Ten dollars per song, plus royalties. DON Officially ... a   paid   songwriter. HANK That’s right, so I suggest you address me as Mr. Hiram Williams. Audrey leans over, tips up his baseball type cap . DON Where the hell   did   “Hiram” come from? HANK My old man. Got it from King Hiram in the Book of Kings. And then misspelled it on the birth certificate. Put in an extra “I.” That’s why they used to call me “Harm.” 19. (CONTINUED)",
      "characters": [],
      "action_text": "AUDREY Boy, Lillie never mentions your daddy at all, like he never existed. HANK Well, she put him in the Veterans Hospital in Pensacola when I was six. War injury from France or something, but some cousin told me it was from a truck accident at the lumber yard. Anyway, he was messed up and that was about it for us... after that ... well, I was pretty much my own daddy. Audrey takes a beat, strokes his temple. AUDREY I’m so glad we’re taking a couple of days. HANK Yeah, me too. WOMAN IN CAR Don’t you just love lightning bugs? AUDREY Love ‘em. DON Who doesn’t? HANK Lizards ... ‘cause that   light juice  kills ‘em when they eat ‘em. They laugh. DON Man, can’t wait to get out in that boat and do some real fishin’. HANK And just think, if you knew how , how much fun it’d be. DON I’ll have two in the wet well before you have a worm on the damn hook. 20. CONTINUED:",
      "dialogue_count": 0,
      "word_count": 369
    },
    {
      "scene_number": 4,
      "slugline": "INT. LAKE COTTAGE / BEDROOM - NIGHT Screened SLEEPING PORCH. Hank, bare-chested, scrawny and in boxers, lies on the bed, smoking. Audrey is propped up on her elbow in a cotton nightgown. AUDREY Come on baby ... what’ya doing over there? A mosquito buzzes around Hank. He swats at it. Misses. He sits up, then gets up, comically trying to clap it out of the air. HANK Hold on. Audrey stares at the BONY LUMP on his lower back. Finally, he nails it. HANK (cont’d) Night, night lil’ bastard. Before he lies back down, he empties several aspirin from a bottle on the bedside table and gulps them. Audrey gently touches the bump. HANK (cont’d) I think we might have a little bronco riding tonight. AUDREY Really, says who? HANK Says ol’ Hank. AUDREY Well, I look forward to that event. HANK You should. AUDREY (teasing) Especially since you're not drinkin’. HANK Now darling, that’s uncalled for. He turns off the light. IN THE DARK. 21. (CONTINUED)",
      "characters": [],
      "action_text": "AUDREY You’re right. C’mon climb up cowboy. HANK Nah ... too sore, you be in the saddle tonight. Sheets rustle, then she gets on top of him. AUDREY You love me? HANK You love me? AUDREY Do you love me,   honey?  HANK Hmmm, most of the time, I do. They laugh, start rocking. Squeaking bed. HANK (cont’d) You know what I want Auds? AUDREY Me. HANK All the marbles. AUDREY What? ... what about my marbles? HANK They’re included ... AUDREY Good thinkin’. HANK Baby, nothin’s gonna stop me. Really. Nothin’. Moaning from Audrey, grunts from Hank. AUDREY Yes, nothing’s gonna stop us baby. (beat) Now ... really , can you not stop. 22. CONTINUED:",
      "dialogue_count": 0,
      "word_count": 283
    },
    {
      "scene_number": 5,
      "slugline": "INT. CASTLE RECORDING STUDIO (NASHVILLE) - DAY SOUND BOOTH. Fred and Hank are there alone. Band is fiddling around in the background. HANK You never been in the doghouse have you Pappy? FRED Not if I can avoid it son ... it’s certainly been a long while. HANK Well, I kinda think you’re the exception . Most of the men I know end up there sometime. FRED Then you go out there and make them feel better about themselves. Hank stands slowly, smiling ... HANK Yessir, yessir ... INT. STUDIO Hank enters and looks at Don. DON Move It On Over? Hank nods. DON (cont’d) Any ideas chief? HANK You know what to do. Hank counts it down, Don strums the pedal steel and the band rips into the blues-y, rocking tune. HANK (cont’d) “Came in last night at half-past ten That baby of mine wouldn’t let me in So move it on over Move it on over 23. (MORE) (CONTINUED)",
      "characters": [
        "HANK"
      ],
      "action_text": "Move over little dog ‘cause the big dog’s movin’ in”  “Move It On Over “   plays over beginning of next scene, then slowly fades . EXT. HANK & AUDREY’S HOUSE (STEWART ST., MONTGOMERY) - DAY Hank and Audrey have moved into a small home. Audrey stands out front, instructing a WORKMAN who’s installing bright- colored metal awnings over the windows. INT. KITCHEN - CONTINUOUS Hank at the kitchen counter, looking out at Audrey. He smokes a cigarette, pours a coffee. Then notices a note on the counter. Doesn't read it. He opens the fridge. It’s ALMOST EMPTY. He picks up a bottle of milk, smells it. Sour. Puts it in the sink. Walks to the kitchen table and sits down. A FUR COAT lays conspicuously over one of the chairs. Audrey enters. He motions for her to sit on his knee. Before she does, she   slips   the fur coat over her summer dress.   The Montgomery Examiner   NEWSPAPER is spread open on the table. HANK (smiling) You see this ... “Where the inspiration for   ‘Move it On Over ’ came from, Hank couldn't say. It’s surely not his own married life. Mr. and Mrs. Hank Williams have a model domestic life.” AUDREY (smiling) You think that’s funny? HANK Kinda, don’t you? ... also says here “we’ve sold over 90,000.” As Hank adjusts how he’s sitting, his back tweaks a it. Audrey notices and gets off his lap. She stands up, then looks closer at the article. AUDREY If it’s even half true, I wonder what kinda money that   really   adds up to. 24. CONTINUED: HANK (cont’d) (CONTINUED) HANK Adds up to Hiram Williams is a big damn deal. AUDREY Well big deal, you see that note on the counter? Howard Pill called, making sure we’re   at the station tomorrow. HANK Hell with that show. I should have never gone back. INT. JEFFERSON DAVIS HOTEL / WSFA STUDIO - MORNING Hank stands at one mic. There’s another one next to it that Audrey walks up to. HANK ... so folks say you're milkin’ a cow or just going to the store for some extra feed or supplies we sure appreciate you listening to us... reall",
      "dialogue_count": 1,
      "word_count": 2798
    },
    {
      "scene_number": 6,
      "slugline": "EXT. LAKE - DAY Don and Hank, side by side, dueling spinning rods, casting into a quiet lake EXT. SHREVEPORT MUNICIPAL AUDITORIUM - NIGHT OUTSIDE SHREVEPORT MUNICIPAL AUDITORIUM. Night time. 100’s are lined up. Hank, arm around Audrey stands under the MARQUEE, pointing up - Johnnie and Jack, The Bailes Brothers, Curley Kinsey and Hank Williams . EXT. ROAD - SOMEWHERE IN THE SOUTH - DAY The band car pulling a trailer, cruises a Dixie highway. 8MM   FOOTAGE ENDS  INT. BAND CAR - NIGHT Everyone is asleep, save Don, who is driving. Hank rides shotgun but can’t get comfortable. After a beat, he searches his pockets, brings out a hand full of aspirin and an INHALER. Takes a snort. The label says   Benzedrine.   He offers it to Don, who shakes it off.  EXT. GARAGE APT - EARLY MORNING Hank walks up rickety metal stairs. INT. GARAGE APT. - DAY Hank stands at the kitchen sink washing his face. He the walks down hall and enters bedroom. Audrey stirs. He moves to the bed, pulls off his boots. Collapses backwards. HANK (closes his eyes) Mornin’ darlin’. AUDREY How’d the road go, you alright? HANK It all went fine, but I’m pretty beat ... Sorry I woke you. 37. (CONTINUED)",
      "characters": [
        "HANK"
      ],
      "action_text": "AUDREY You didn't. I haven't been sleeping worth a damn. HANK No? Well I know about that ... AUDREY ... Nah, haven't. HANK Well you getting up? Cause I’m going down ... or try to. AUDREY In a sec. She stares over at him. In near sleep, he’s a boy. She brushes his cheek. AUDREY (cont’d) Hank ... HANK Yeah. AUDREY You listening? HANK I’m kinda driftin’ off honey. AUDREY I was gonna tell you somethin’ HANK (barely) Yeah. AUDREY You’re gonna be a daddy. Hank lies there for a moment. Sits up. HANK Audrey Mae ... She just nods. HANK (cont’d) My god, we’re gonna have a baby. Really? 38. CONTINUED: (CONTINUED) AUDREY Really. He puts his hand on her belly. She moves it away. Raises her nightgown and then puts his hand back. He gently rubs her flat belly. HANK Can’t tell. AUDREY You will. HANK Oh Audrey ... I love you. AUDREY I love you. HANK This is gonna be great, goddamned great. He’s gonna have a real dad. Yeah ... not like I had it, not like it was for me. No, he’s gonna have family. They’re giddy. AUDREY How do you know it’s a boy? HANK Well, whatever it is,   he’s   gonna have a real family. He gently lowers his cheek to her belly. EXT. GARAGE APT. / DRIVEWAY - DAY Hank and Don beside the trailer TOSSING stones at a magnolia tree. HANK Shag, the other day Pappy said seems I’m running out of ideas. DON I’ve got no sense of that, but you are “smiling” more. Maybe happy is  too   hard on you. HANK That’s kinda frightenin’. 39. CONTINUED: (2) (CONTINUED) DON Yeah, well ... Hank considers this. HANK (only half joking) Well, you know I think I’d rather be unhappy than unsuccessful. DON (laughs) I believe you would. HANK Anyway, he wants me to head up to Cincinnati for a session. DON Yeah. When? HANK Next week. DON I’m good. HANK Yeah ... (beat) Look, Pappy says he wants to try out some other boys to back me up for this one. DON What the hell, what’d you tell the man? HANK His call. DON (beat) I don’t like that much. HANK Didn’t figure you would. But that's the way it’s gotta",
      "dialogue_count": 1,
      "word_count": 2858
    },
    {
      "scene_number": 7,
      "slugline": "EXT. RYMAN AUDITORIUM / ALLEY / POTENTIALLY BACK STAGE- NIGHT Alone for a moment, Hank smokes a cigarette in the alley. He looks towards Fourth Avenue. A sexy young GIRL, framed against headlights, walks towards him. GIRL Hey. HANK Hey. GIRL I liked your song. HANK Yeah. GIRL You done for the night? HANK You trouble? GIRL Depends ... besides you're married. HANK Yeah. GIRL Happily? HANK Is there such a thing? GIRL I don't know, I’m too young for that stuff. HANK Me too. He drops the cig. Rubs it out. Stares at her, his eyes intense above a crooked smile. NEWS REEL FOOTAGE - MUSIC? JAZZ? EDITH PIAF?  NEWS OF THE WORLD B&W FOOTAGE  IMAGES MATCH THE NARRATION  52. (CONTINUED)",
      "characters": [],
      "action_text": "COMMENTATOR ... And the destruction toll from the August 5th, Ecuador Earthquake just keeps rising. At last count over 6000 people have perished and 50 towns and villages have been destroyed ... ... The newest in photograph technology, the Polaroid Instant Camera went on sale for the hefty price $89.95... Gasoline hit 17 cents a gallon ...  IMAGES OF HANK AND GROUP surrounded by TROOPS-- THEIR WIVES AND HUSBANDS ARE WITH THEM - AUDREY AND HANK ARE VERY COZY.  ... And finally a troupe of Grand Ole Opry stars toured several US Air Bases in Germany this month. The extremely popular country style music is just what the homesick troops ordered ... there’s Roy Acuff, Minnie Pearl and Hank Williams, the “Lovesick Blues boy,” a young man really on the rise ... they say ‘he’s singing what people’ are thinking ... here’s Hank arriving at his new Nashville home with his wife Audrey ...  IMAGES  FLICKER   OUT  INT. HANK AND AUDREY’S HOUSE / LIVING ROOM - NIGHT “ It’s Beginning To Look A Lot Like Christmas” plays.   Loud. So are the laughter and the conversations. A soup ladle slops through a punch bowl with gardenias floating in it. A WOMAN’S HAND grabs a cocktail wiener off a messy tray. Two kids, one of them Lycrecia, are a blur as they thread their way through the 50 people filling the house. A full-on Christmas party. A TREE with colored lights blinking and a few straggler gifts. Other than Fred Rose and a few others, almost everyone else is in their TWENTIES/early thirties. A series of vignettes play: Hank talks to Fred. 53. CONTINUED: (CONTINUED) HANK Nashville, Pappy. (Big smile) Nashville. FRED Yep, Hank, Nashville ... Nashville. Audrey talks to Don. DON I took my wife to see   The Heiress . AUDREY Oh, I saw it was at the Bellmead. Did you like it?” DON She loved it ... I thought it was too long. Don picks up a guitar and starts to play. Audrey passes Hank and she spins him around like they’re going to start dancing. Fred and Hank talk. FRED I hope it’s a great year for",
      "dialogue_count": 0,
      "word_count": 910
    },
    {
      "scene_number": 8,
      "slugline": "INT. FRANK WALKER’S OFFICE (NEW YORK CITY) - DAY An impressive office. Walls adorned with FRAMED RECORDS. Standing at a window, looking out at the SNOW falling on a busy Manhattan street, 20 floors below, is FRANK WALKER, 40’s. He is listening to ...  A record that’s playing, but the song is SPOKEN, as a ‘poem.’ Hank recorded these recitations as LUKE THE DRIFTER  HANK (spoken with minimum accompaniment)  “You’ll meet a man just like me along life’s busy street With shoulders stooped and heads bowed low and eyes that stare in defeat ... For souls that live within the past, where sorrow plays all the parts, For a livin’ death is all that's left for men with broken hearts”  FRANK, like Fred Rose, is being interviewed by the reporter we never   see on camera. Come in mid sentence ...  FRANK WALKER We didn't,   and neither did Fred,  want to put these recitations out under Hank’s name. Not really jukebox material. So we compromised and he released several songs under the pseudonym of “Luke the Drifter.” REPORTER (O.C.) How did they do? FRANK WALKER They didn’t sell well, but they seemed to offer Hank emotional relief. Fred said, “They were almost apologies.” REPORTER (O.C) Could you tell us who you are. FRANK WALKER Frank Walker. I run MGM Records and I signed Hank Williams to a contract two years ago in 1947. 57. (MORE) (CONTINUED)",
      "characters": [],
      "action_text": "Hank’s first record for us was “Move It On Over.” Our second session he recorded “I Saw The Light.” REPORTER ... and these sold quite well ... FRANK WALKER ... yes, Hank has made a lot of money selling records and writing songs ... several years now, of more than $100,000 dollars. REPORTER (O.C.) ... And Audrey Williams, did you work with her? FRANK WALKER No, we don't work with Audrey. But how do I say this, we were happy to have Decca release them. FADING UP ... LUKE THE DRIFTER  “You have no right to judge, to criticize and condemn. Just think, but for the grace of God it would be you instead of him.”  INT. HANK AND AUDREY’S HOUSE/ LIVING ROOM - MORNING (POSSIBLY PUT LYCRECIA IN HERE) Audrey sits on the sofa, drinking a cup of coffee and reading Billboard.   She reads it carefully and every few beats circles something with a red pen. Junior tries to grab the paper and she gently pulls it away. AUDREY Miss Ragland ... Miss Ragland ... MISS RAGLAND, portly 30’s, enters wearing a dressing gown. AUDREY (cont’d) Take the child, please. Audrey sets the paper and crosses to the telephone. She picks up a note-pad, checks a number and dials. MAN’S VOICE (O.S.) Sheridan Hotel. 58. CONTINUED: FRANK WALKER   (cont'd) (CONTINUED) AUDREY Room 237 again. MAN’S VOICE (O.S.) Yes, of course, I’ll try once more. INT. HOTEL ROOM - MORNING The bed. A mess. A suitcase, some clothes out. A tray of uneaten eggs. A woman’s purse next to them. Several beer bottles, an half empty whiskey quart. The sound of the SHOWER running. Phone RINGS. A WOMAN'S hand picks up the purse. She crosses ... only a blur of her dress can be seen. RING, RING. INT. HOTEL BATHROOM Shower still on. Steamy. Behind the curtain, we hear Hank singing his ass off as he’s working out a song ... and he’s going very bluesy with it. CAMERA close on the tear drops of water. HANK (O.S.) “I went down to the river to catch me a big ‘ol fish, Went down to the river to swig me some dirty ass water, I went down to the river to w",
      "dialogue_count": 0,
      "word_count": 1309
    },
    {
      "scene_number": 9,
      "slugline": "INT. HANK AND AUDREY’S HOUSE (FRANKLIN RD.) / HALLWAY - DAY Darkness, cut by a single hall light. EERILY QUIET except for the plaintive sound of Audrey WEEPING. EXT. MUSIC FESTIVAL / STAGE - DAY REAR OF STAGE, Nowlin walks up steps. Disappears out front. Two other men follow, then Hank; glazed and deliberate. At the top of the steps he shares a look with Don. W.B. NOWLIN (O.C.) (through a buzzing mic) Ladies and gentleman I have an announcement. Mr. Hank Williams is here ... and ready to give you the show you been hopin’ for ... Loud cheers, drown him out. He turns, stares back, waiting for Hank. W.B. NOWLIN (cont’d) Hank Williams folks ... Hank moves slowly towards the microphone. Behind him the band pick up their instruments and begin to move into an opening number ... HANK POV Trying to focus ... crowd faces, angry, confused, some smiling, laughing, sweating, smoking ... His blurred gaze drops to the floor. He leans on the mic. The crowd starts clapping. He looks back at Don, who is not sure what to play, then turns back to the crowd. HANK You know friends I wonder how many homes are broken tonight, just how many tears are shed by some word of anger that never should have been said. ... (struggling) Hmmm ... folks ... hey ... do any of you out there know my very good friend Luke the Drifter ... well, Luke wrote these words ... Audience is now both captivated and confused. 63. (CONTINUED)",
      "characters": [
        "HANK",
        "FRED ROSE"
      ],
      "action_text": "HANK Yeah. DON I was thinkin’ ... HANK Uh oh. DON Maybe I haven’t been much of a   real  friend ... maybe been too reluctant to speak up about some things, hard things. HANK You been fine. Whatya goin’ do? After a moment. HANK (cont’d) You know my Uncle told me that Grant was drunk every afternoon by 3:00 ... but he still took Vicksburg. DON Yeah, I guess he did ... (beat) I’ll see you then. HANK See ya. Hank climbs slowly out and walks towards the entrance. INT. NASHVILLE GENERAL HOSPITAL / ROOM - EVENING Audrey sleeps. A half-eaten tray of food next to her. No flowers, no cards. Hanks sits in the shadows staring at her through lidded eyes. She wakes up. HANK Hey. AUDREY How long you been here? HANK A little bit. 65. CONTINUED: (CONTINUED) AUDREY Took you long enough. HANK Just got off the road, came straight here... How are you? She doesn’t answer, looks away. AUDREY How’d you do? HANK Made out okay... How’s my boy? AUDREY He’s okay... How much? HANK Where’s he at? AUDREY The house, where you think? HANK Billboard says we did 11,000 paid last week ... AUDREY Heard you and Luke had some trouble in Texas. HANK (tries to smile) Yeah ... (long beat) What is it, baby? You gonna be okay? AUDREY Hell, you come home whenever you please from wherever you are and then we sleep together ... You don't have a damn clue. He tries to make sense of this. He’s swimming. AUDREY (cont’d) You did this to me, Hank Williams. You're the bastard caused me to suffer like this. 66. CONTINUED: (CONTINUED) HANK What are you saying ... AUDREY You’re barely here. You're barely even a father now and you can’t handle being more of one. HANK My god ... what did you do? You can’t, you can’t do that without me. AUDREY It’s done. We got nothing. You and I got nothin’. Hank squeezes his eyes shut, so hard, so pained, hoping when he opens them he’s not even here. The flowers lay across his lap. INT. FRED ROSE’S OFFICE - DAY  Another time, same Interview style -  A RECORD is carefully placed on a turnt",
      "dialogue_count": 2,
      "word_count": 1365
    },
    {
      "scene_number": 10,
      "slugline": "INT. MONTGOMERY COW COLISEUM / BELOW THE STAGE - DAY Hank palms a cigarette. His FATHER. LON WILLIAMS, 58, looks 70, his face with a slight paralysis, is also there. A long  silence . LON How many folks out there, son? HANK Around 9000 they say. Lon nods in amazement. They sadly search for something, anything, to say. Filtering in from above. HANK SNOW (O.C.) He’s my very very good friend, a young man with talent to burn. HUGE ROAR from crowd. Hank takes a long drag. HANK SNOW (O.C.)(cont’d) Maybe the finest songwriter I've ever had the pleasure to know. EXT. MONTGOMERY COW COLISEUM - DAY BACK UP ON STAGE Everyone there,   all the family and friends , now wait anxiously. HANK SNOW Two number one hits on the charts right now, in fact. Let’s welcome at his   Montgomery homecoming DAY  ... a great and loyal son of Alabama, Hank Williams. INT. MONTGOMERY COW COLISEUM / BELOW THE STAGE - DAY LON I’m real proud of you Hank. HANK Thanks Daddy, I appreciate it. A beat. Lon looks at Hank as the crowd sounds continue to build. It’s obvious he wants to reach out to his son. Hank cuts a look up at the noise. 70. (CONTINUED)",
      "characters": [],
      "action_text": "LON It’s awful good to see you. We probably should’ve done it more. HANK Yeah, don’t you worry about it, we got plenty of time ... LON I’m sorry son, I swear I am. He’s getting a little thick in the throat. This is hard. HANK C’mon now ... aren’t we all (then) I better get up there... (smiles) ... ‘Fore they figure I’m too drunk to show. LON You probably got that right. Hank drops his smoke, crushes it. LON (cont’d) You look after yourself, okay? You look a little tired. HANK (tight smile) Nah, I’m tip top. LON Sure you are ... (then) Hiram, thanks for allowing me to be here. Lon holds his hand out and Hank shakes it gently. CROWD CLAPPING LOUDER, INTENSE. Hank walks up the stairs followed at a distance by Lon. EXT. MONTGOMERY COW COLISEUM - DAY CAMERA FLOATS ABOVE THE AUDIENCE, PUSHING IN ON THE STAGE. Audrey comes over, makes a show of kissing Hank. Lillie follows with an embrace. Hank moves to stage front. 71. CONTINUED: (CONTINUED) HANK Well, hello Montgomery. It sure is good to be back here and thank you all so much, thank you. And I much appreciate the warm welcome you’ve given my family, my mother Lillie, my wife Audrey, my big boy Bocephus. APPLAUSE with each of the intros. Junior now just runs to Lon, who scoops him up. Audrey quickly and with authority takes him away. Lon lets go easily. HANK (cont’d) Here’s a little song been awful good to me and the family and the fellows behind me, The Driftin’ Cowboys ... It’s earned us quite a few beans and biscuits. It’s called  “Good   Lookin’   You Got Anything  Cookin’ , how’s about   cookin’  somethin ” up with me  Hank stares at a crowd which is   lost   in him. Then turns to those behind him; the faces that rely on him most. Audrey ... Junior. Holds the gaze as his son smiles so sweetly. Then turns back to a throng, whose love for him is as unadulterated. It is a moment of true pleasure and peace. EXT. CBS BUILDING (NEW YORK CITY) - DAY Hank and Don seen from across 52nd Street in Manhattan. Amidst a crowd of m",
      "dialogue_count": 0,
      "word_count": 2736
    },
    {
      "scene_number": 11,
      "slugline": "EXT. HANK AND AUDREY’S - DAY Two men climb out of a BLUE SEDAN. JIM DENNY, Opry manager, 30’s and HAROLD, 40’s. HANK (O.S.) Okay, sure, I know I can’t make D.C or Baltimore, Jim. But why can’t we just tell ‘em the truth and live with it? Harold goes around to the trunk, opens it and begins taking out AUDIO RECORDING equipment. JIM DENNY (O.S.) I’m sorry Hank, but I think we got to do it this way. INT. HANK AND AUDREY’S HOUSE / BEDROOM - DAY Hank sits up in bed as Harold arranges a microphone in front of him, then sets up the tape recorder at the vanity. Jim, no nonsense and hating this, stands at the foot of the bed. Hank is angry. He KNOCKS the mic to the floor. HANK You don’t hear me, I don't wanna do it. And I sure as hell don't want Audrey standing in for me or anybody else at the show. Jim tries to remain calm. Picks up the mic, hands it to Harold. JIM DENNY I don't see a way around it. HANK Simple ...   I couldn't make it because I’m laid up.   I’ll get the boys as soon as I can and go there on my own money... Make it right. JIM DENNY Connie Gay is putting these shows on. He and I go back forever. Now, there’s nobody else available. I got the Opry spread all over on New Year’s Eve ... Toledo, Baltimore, Raleigh. 84. (CONTINUED)",
      "characters": [],
      "action_text": "Hank reaches over, takes A VIAL and pours out SEVERAL pills. Washes them down. Jim watches, casts a glance at Harold. HANK Says one every three hours. I figure three every hour ought be that much better ... (beat, intensely) ... it’s ‘cause I need it, Jim, and that’s why with this back I shouldn't be there. People need to know that. Harold wishes he were invisible, but he winds the tape. JIM DENNY Harold you good to go? HAROLD Yes sir. JIM DENNY Look, you don't show, everyone there will think it’s the whiskey talking and Connie Gay will be stuck bad. Now whether you like it or not I represent the Opry and as fond of you as I am, if you want to stay part of this you got to do it. HANK Sounds like a threat. JIM DENNY It’s a fact, Hank. You need to record this, we’ll play it that night. Hank takes his time. HANK You’ve always been a son of bitch, JD. JIM DENNY May be, but it’s ‘cause I have to be. But I always been solid by you. He hands Hank a typed piece of paper. Hank glances at it, turns it over to the blank side. 85. CONTINUED: (CONTINUED) HANK Give me a pen. I think I can write my own damn apology. He starts scribbling. INT. ARMORY (WASHINGTON D.C.) - NIGHT A huge New Year’s Eve crowd. Listening intently. THE STAGE Empty. But over the PA SYSTEM, Hank’s voice. HANK (V.O.) “...   I had really been lookin’ forward to visiting you folks in Washington today but a couple weeks ago I had to have a operation on my back. It had gotten to where I couldn't even walk. Truth is, it was just deformed or broken when I was a child and it just wore out.  STAGE WINGS. Audrey whispers to an unknown musician. But as Hank’s words echo through the auditorium, she can’t help herself, so she turns and stares across the crowd’s faces. Her own a portrait of love and loss. She closes her eyes. HANK (V.O.)  ... Fact is I was on that operating table for over three hours ... I’ve been in bed a couple weeks and well, I sure am sorry I couldn't be there tonight ...  INT. HANK AND AUDREY’S HOUSE",
      "dialogue_count": 0,
      "word_count": 701
    },
    {
      "scene_number": 12,
      "slugline": "INT. HANK AND AUDREY’S HOUSE (FRANKLIN RD.) / LIVING ROOM - CONTINUOUS Audrey calls out. AUDREY Hank ... Hank... Miss Ragland! AUDREY’S FRIEND Doesn’t appear anyone’s here to greet mommy. They laugh. They’ve had a cocktail or two. Audrey heads towards the bedroom. AUDREY Hank. Suddenly the LOUD REPORT of a PISTOL. The women jump, terrified, not sure what to do. They listen for another second. Then Audrey gathers her courage and walks towards the back of the house where the gun shot came from. She peers around the door to the back porch. EXT. HANK AND AUDREY’S HOUSE / PORCH - CONTINUOUS The porch is now glassed in. Furnished with bamboo, tiki style. Hank sits in a chair rocked back on its hind legs. His  back to her.  The door to the yard is open. The chair is in that doorway. Hank spins a 38 caliber pistol cowboy style. The trees are bare. The other women creep up behind Audrey. Hank carefully points the gun at a tin can and several bottles and FIRES. HITS the bottle which explodes in slow motion. He turns and stares at the three women. HANK So how was our nation’s capitol? AUDREY What are you doing? HANK Killing bottles waiting for my loving wife to come home. AUDREY Well I’m home now. 87. (CONTINUED)",
      "characters": [
        "AUDREY"
      ],
      "action_text": "HANK Hi ladies. OTHER WOMEN Hi Hank. AUDREY Are you drunk? HANK Are you? AUDREY You think you can wait until we’re alone before you start up? You really have no couth. The women start backing out. HANK Well, I suppose you’re right, dear. Hank turns all the way around and FIRES a SHOT into the sofa right next to her. She jumps back and scrambles away. The other women SCREAM from another room. Hank laughs and fires three more into the furniture. HANK (cont’d) Now draw you god awful tiki wiki shit. A moment passes. Audrey steps back on to the porch. She walks slowly towards Hank, who just stares, the pistol hanging by his side. Close enough to embrace, but a thousand miles away from each other. She holds his gaze. AUDREY Hank Williams ... I’ll never live another day with you ... never. She turns and walks away. He stares after her, watching until she’s long out of sight, then SHOOTS the sofa in an act of desperate frustration. INT. FRED ROSE’S OFFICE - DAY  The Documentary style interview of Fred Rose continues.  88. CONTINUED: (CONTINUED) FRED ROSE Yeah well, he moved in with Ray Price. Ray was a bit younger and innocent in many ways and really looked up to Hank as did many of the guys ... The house was a nice place in the Natchez Trace area of Nashville. One thing’s for sure, Ray wasn’t ready for what Hank was bringing. INT. NATCHEZ TRACE HOUSE - NIGHT Past midnight. Layer of smoke. House full of people. Drinking, playing guitars, singing. RAY PRICE, 20’s, true, warm face, is among them. Conversations drift in and out. In the corner of the DINING ROOM, some people are looking in a FOOT LOCKER. It’s full of GUNS. Hank walks up carrying a beer. A man takes out a pistol and holds it up, spins it. HANK Vice squad guy in El Paso gave me that one ... but be careful now buddy, lot of folks get killed with  unloaded   pistolas. Hank goes to a pretty young blonde, 28, BOBBI JETT.   She stares at him sweetly and reaches for the beer he’s holding. Instead, he takes a long slow ",
      "dialogue_count": 1,
      "word_count": 2164
    },
    {
      "scene_number": 13,
      "slugline": "INT. RYMAN AUDITORIUM / STAGE - CONTINUOUS CAMERA FOLLOWS behind Hank as he threads his way to front of stage. He joins Red Foley. HUGE applause. RED FOLEY M.C. I hear you got a new song there Hank. HANK Yep Red, I gotta brand new song ain't never been aired. RED FOLEY M.C. Ain’t never been aired? HANK No, and it might need it. Red laughs. The crowd eats it up and the BAND KICKS IT OFF. HANK (cont’d) “Today I passed you on the street and my heart fell at your feet I can’t help it if I'm still in love with you Somebody else stood by your side and he looked so satisfied I can’t help it if I'm still in love with you ...” Hank may be more and more raggedy, but it doesn’t matter. On the   last verse.   Hank scans the crowd. On the FRONT ROW, a pretty girl, 20’s stares knowingly, then breaks into a sweet smile. He smiles back. She loves it. UNTIL Hank turns towards an AREA where the OPRY GUESTS sit. And there he sees BILLIE JEAN ESHLIMAN, a 19 year-old VISION. Ravishing auburn hair, hypnotic green eyes. An off the shoulder dress does nothing to hide her voluptuous body. Hank actually   can’t look away . The girl in the front row; her face betraying confusion as she knows she's lost his attention. She gazes towards the other seats, but from where she stands, she can’t see anything. Hank finishes the song and Red steps in for a commercial break. 98.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 260
    },
    {
      "scene_number": 14,
      "slugline": "INT. RYMAN AUDITORIUM / GUEST BOOTH - NIGHT Billie chatting. Cross conversations. Hank comes up. Squats down next to her chair. She ignores him. He smiles in a way we’ve seen far too rarely. HANK Girl, who you here with? Billie turns, takes her time. BILLIE JEAN Faron Young. She turns back to the woman next to her, resumes their conversation. HANK The boy guesting up here from Shreveport? Without looking at Hank. BILLIE JEAN Yeah, that’s him... and that’s him right over there behind you. Hank turns to see FARON YOUNG, handsome, maybe 22, staring. Hank smiles. Turns back to Billie, then back to Faron. Faron forces a smile back. Hank signals him to come on over. Reluctantly Faron heads that way. FARON YOUNG Hey Billie ... Hank. HANK Son, you gonna marry this girl? Faron can’t help but laugh. But he thinks about it for a second. FARON YOUNG Not likely, she’s far too good lookin’ for a wife. BILLIE JEAN What did you say? HANK’ Well, if you ain’t going to marry her ol’ Hank just might. 99. (CONTINUED)",
      "characters": [],
      "action_text": "BILLIE JEAN Oh really? Nervous laughter from the others in the booth. Hank stands, puts his hand on Faron’s shoulder and leans in closer. HANK I hope I’m not causing you any pain. Faron not sure how to handle all this with the   biggest name  on the Opry. Then with mild resignation ... FARON YOUNG Nah ... Don’t worry about it. Hanks pats his shoulder turns back to Billie Jean. HANK You’re like an angel.  SONG TO BE DETERMINED FOR UNDER THIS SCENE  EXT. MR. JONES’ HOUSE / BACKYARD - DAY Beautiful late spring afternoon. Billie’s daughter, JERI LYNN, 2, runs joyously around a small suburban backyard. Billie Jean watches. She gets chased by her Uncle, SONNY JONES, 25, one of Billie Jean’s two brothers. MR. JONES, 40’s, Billie’s DAD, wears a BOSSIER CITY POLICE uniform, drinks a beer. Two other lawn chairs; one occupied by Billie’s MOM, the other by Hank. MR. JONES Pregnant at 16, so Jeri Lynn there. MRS. JONES Married and pregnant,   Mister   Jones. MR. JONES Well, I’m not selling her short, she is pretty tough ... But at 19 what the hell do you know? I could barely tie my shoes then. Hank smiles, doesn’t respond, isn’t compelled to. MR. JONES (cont’d) My boys over there, Alton and Sonny, big fans of yours. 100. CONTINUED: (CONTINUED) HANK I’ll surely take all of them   I can get. Jeri Lynn runs over and hops up on Hank’s swinging leg. Nestles against his boot. He lifts her up. MRS. JONES We love this little bug. HANK I like children a lot. I got one of my own and my former wife had one, too. Billie walks up. Puts her arm around Hank. Everyone smiles. BILLIE JEAN Handsome, talented and loves kids. How about that, daddy? MR. JONES I appreciate you coming out here to see us, Hank. HANK Yessir. Billie leans in, kisses Hank. Genuine and loving. While he and Billie kiss, he lifts Jeri Lynn on his leg. She squeals. EXT. NATCHEZ TRACE HOUSE - DAY FROM A DISTANCE Hank and Billie Jean walk towards Ray’s house. HANK Well, I got Lafayette, Homer, Opelousas, then Orange, Brownwood ",
      "dialogue_count": 0,
      "word_count": 951
    },
    {
      "scene_number": 15,
      "slugline": "INT. NATCHEZ TRACE HOUSE - DAY Pretty empty. Packing boxes around. Jim Denny stands at the screen door. He knocks, no answer, slowly enters. JIM DENNY Hank... Hank. Hank, looking tired, walks into the room. HANK Hey Jim. JIM DENNY Hank. HANK Want sumpin ... cup of coffee? JIM DENNY No thanks... where’s Ray? HANK Moved out. Jim nods, takes his time. So does Hank. JIM DENNY I don’t want to know where you were, or why you weren't at the show ... HANK (interrupts) I’m sorry, J.D. JIM DENNY I’m sure. But sorry don’t mean shit anymore. We’re grown men here. As always, Hank’s temper is a blink away. HANK I see. Should I be taking notes on this lesson? JIM DENNY Opry is a brand and you’re pissin’ on it Hank. It means something to a lot of people ... music, family ... 104. CONTINUED: (CONTINUED)",
      "characters": [
        "HANK",
        "SONNY",
        "BOBBI JETT"
      ],
      "action_text": "CROWD FACES. Happy, beautiful, old, young, map of America in the smooth cheeks and wrinkled eyes. Excited, as they file through the front doors. PINNED to one side of each door is the NIGHT’S LINEUP. Handwritten. Red Foley, Hank Snow, Minnie Pearl, Hank Williams. INT. RYMAN AUDITORIUM / BACKSTAGE - NIGHT Jim Denny. Alone. Stares down the bustling hallway. Hoping against better judgement. MOVE IN ON HIS EYES.   HOLD THERE until we reverse PULL BACK. We are now ... INT. RYMAN/ OFFICE - DAY Jim hangs up the phone. Stares at it. Closes his eyes, squeezes them shut. When he opens them, they’re holding back tears. He looks up to see Red Foley standing in the doorway. JIM DENNY Jambalaya hit number one today, you know that? RED FOLEY M.C. You alright? Jim shakes his head, looks out the window. JIM DENNY I had to do it, Red. I had to let Hank go. EXT. NATCHEZ TRACE HOUSE - DAY FROM A DISTANCE - Hank sits on the front porch. MOVE IN slowly. A piece of newspaper blows across the lawn. Leaves fall in the same breeze. CAMERA finally settles on his face. He looks like he’s been shot. His eyes are hooded, empty, lost. After a LONG MOMENT, he stands and walks back into the house. INT. MR. JONES’ HOUSE / HALLWAY - DAY Phone rings, rings. 106. CONTINUED: (CONTINUED) BOBBI JETT We could get married. HANK Baby, you don’t want to marry me. BOBBI JETT I will. HANK That’s different. He stands, looks out at the lake. HANK (cont’d) (sardonic laugh) Boy, I’m a professional at making a mess of things ... BOBBI JETT If we got married Hank things would be more stable. And just think ... we’d have this new little one right here. HANK Bobbi, I love you, you’re a great gal ... but not like that, not that way. The sadness of this plain truth washes across her face. HANK (cont’d) I’m gonna marry Billie Jean. She steels herself. Takes a breath. BOBBI JETT She know that? HANK Not exactly (beat). But darlin’ I’ll look after this little baby. I’ll give you money and I’ll be its poppa even ... but there",
      "dialogue_count": 3,
      "word_count": 1006
    },
    {
      "scene_number": 16,
      "slugline": "INT. MR. JONES’ HOUSE / HALLWAY - MORNING The phone on the wall, hangs by the cord. Billie enters in a cotton nightie. CLOSE ON her sensuous mouth as it brushes the phone. BILLIE JEAN Hello. HANK (O.C.) I got a date picked out. INTERCUT   CLOSE   on their faces. BILLIE JEAN Yeah. HANK. Unshaven. HANK October 19th. BILLIE JEAN And what are you gonna do then? HANK Marry you. BILLIE JEAN That’s nice. HANK I know. BILLIE JEAN I think I'm getting my hair done that day. HANK Change it to the 18th and it’ll all work out perfectly. BILLIE JEAN I’ll think about it. Silence. HANK Billie, I love you. You hear me? I love you ... I love you ... and if you’re still there, I still love you. 110. (CONTINUED)",
      "characters": [
        "HANK"
      ],
      "action_text": "BILLIE JEAN Hank. HANK What? BILLIE JEAN I love you, too. INT. FRED ROSE’S OFFICE - DAY  The Documentary style interview of Fred Rose continues.  FRED ROSE The Opry ... yeah, the Opry ... getting the boot ... devastating Nearly as much for me as him ... We’d worked so hard for it ... But there was a small part of me thought, maybe it might get us on a better road ...  JUMP CUT  FRED ROSE (cont’d) In the end, I pulled every string. I had to get him back where we started, on the Louisiana Hayride in Shreveport. The money was less, but he wouldn’t be idle. And they did have an easier way down there, not protecting an image so much. (lights a cigarette, takes a long drag) His back was still bad and we were concerned about the medications. Especially on the road ... I couldn’t imagine that aspect would get worse ... and then it did.   By way of man named Toby Marshall. INT. OKLAHOMA CITY HOTEL ROOM - NIGHT Hank lies on the bed. He’s in severe pain. And drunk. Billie sits in chair looking worn down. Worried. HANK It’s not just my back baby, I feel like my chest is getting jumped on. PHONE RINGS. She answers, listens. Hangs up. 111. CONTINUED: (CONTINUED) Every bone in her body wants these MEN to go away. Anyone would. They feel wrong. She holds her ground, doesn't move. HANK (shouting) Let the man in. Marshall steps around her. Moves to the bed. He takes Hank’s hand and simply holds it for   a long time .  All  SOUND   slowly FADES AWAY. Slow Tempo Instrumental Version  “I’m So Lonesome I Could Cry ” FADES UP.  Marshall now leans down, opens his bag, takes out a rubber strap and begins wrapping it around Hank’s upper arm. Fred Rose’s VOICE comes in. FRED ROSE (O.S.) Chloral Hydrate. Ever heard of it? It’s what’s in a “Mickey Finn”... knock-out pills. So powerful they use them to sedate circus animals. Never supposed to be administered with alcohol or to someone with a heart condition, which Hank likely had. INT. FRED ROSE’S OFFICE - DAY  Back to the Fred Rose interview.  ",
      "dialogue_count": 1,
      "word_count": 3627
    },
    {
      "scene_number": 17,
      "slugline": "INT. CANTON MEMORIAL AUDITORIUM - DAY The crowd is thrilled, pulsating with anticipation. The New Year is coming in right. CAMERA moves among, between and around the JOYOUS FACES. IT sweeps past a few COUPLES in their 20’s and lands on the beaming face of a 12 YEAR-OLD BOY in a cowboy hat. He stares up at the stage in wonderment. INT. CANTON MEMORIAL AUDITORIUM / BACKSTAGE - DAY Behind the curtain   all   the PERFORMERS, including Don Helms, are unexpectedly gathering. Most are quiet, a few whisper, others are quietly weeping. The show’s EMCEE, CLIFF ROGERS, 30’s, walks slowly past them. Head down. Stops at Don, whose 27 year old face wears a 100 years of pain. They share a final look, then Rogers moves to where the curtains meet up and slips out onto the stage. INT. CANTON MEMORIAL AUDITORIUM / STAGE - DAY The crowd HOOTS, HOLLERS, “Happy New Years” are SHOUTED ... THE STAGE Rogers walks to the microphone. Clears his throat. Looks out over the crowd. CLIFF ROGERS Ladies and gentlemen, I’ve been in show business almost twenty years, and I’ve been called upon to do many difficult things in front of an audience. But today I’m about to perform the most difficult task I have ever done. In the audience, nervous laughter, a few shouts, “ I bet”, “like what”...  CLIFF ROGERS (cont’d) This morning on his way to Canton to do this show, Hank Williams died in his car. There are even a few more laughs from those who can only believe this must be part of an act. 128. (CONTINUED)",
      "characters": [],
      "action_text": "CLIFF ROGERS (cont’d) Ladies and gentlemen, this is no joke. (steels himself) ... Hank Williams is dead. With that, Rogers slowly walks away from the mic. The house lights DIM one by one. A SINGLE SPOT hits the solitary microphone. From behind the curtain, come the powerful voices   of the WHOLE CAST as they begin SINGING. CAST  “I wandered so aimless, life filled with sin I wouldn't let my dear Savior in Then Jesus came like a stranger in the night Praise the Lord I saw the light.”  The curtain FOLDS BACK revealing the cast, still in shock, washed in pain, but singing with all their hearts. They remain at the rear of the stage, while the SINGLE LIGHT stays on the microphone in the front. ON THE CROWD As this impossible news sinks in ... Gradually, family by family, strangers and friends, all begin to stand, and as they come to their feet, many sobbing, they join in the singing. The auditorium now rings fully with the beauty and power of Hank’s words. EVERYONE  “Just like a blind man, I wandered alone Worries and fear I claimed for my own Then like the blind man that God gave back his sight Praise the Lord I saw the light, I saw the light, I saw the light No more darkness, no more night Now I’m so happy, no sorrow in sight Praise the Lord I saw the light.”  FADE TO BLACK. COME UP ON: 129. CONTINUED:",
      "dialogue_count": 0,
      "word_count": 514
    },
    {
      "scene_number": 18,
      "slugline": "INT. FRED ROSE’S OFFICE - NIGHT Fred’s face, half lit, a study in sorrow. His head down, his hands trembling. Under this ... A RADIO ANNOUNCER (O.S) (deep baritone, static laced) “Sunday, January 4th, 1953, hillbilly singer and composer Hank Williams was buried in Montgomery, Alabama. His tragic death, at the age of 29, was presumed to be the result of heart failure ... Fred looks up, stares into the   INTERVIEWER’S CAMERA. Holds his gaze.  RADIO ANNOUNCER (O.S) ... A crowd estimated at 20,000 stood outside the city auditorium. 2750 friends, family and fans were inside. DISSOLVE TO: ACTUAL DOCUMENTARY FOOTAGE OF HANK’S FUNERAL FADES UP. RADIO ANNOUNCER The casket was brought in at 1:00 p.m. and opened at 1:15. Hundreds filed past. The musical program was organized by Roy Acuff. In addition to the many Opry stars, The Southwind Singers, a Negro gospel quartet performed. This was the first time something of this nature had occurred in Alabama. At 2:30 the doors closed.”  FOOTAGE FADES  BLACK  130.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 169
    }
  ]
}