{
  "slug": "i-think-were-alone-now-2018",
  "title": "i think were alone now",
  "genre": "drama",
  "format": "film",
  "scenes_count": 23,
  "characters_count": 0,
  "characters": [],
  "total_words": 16314,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. TOWN - DAY The perfect portrait of New England in springtime bloom, awash in a soft mid-morning light. All is deathly quiet. EXT. MAIN STREET - DAY Every streetlight extinguished. Not a car on the road. Not a soul to be seen. Rows of shops closed for business. Their storefront windows eerily pristine, adorned with classic Americana kitsch. Two empty rocking chairs tremble in the breeze. A flock of sparrows coasts overhead, beyond the web of tangled branches. A v-formation of little black and brown specks soaring the skies, returning home for the season. PRE-LAP: Tick. Tick. Tick. INT. FOYER - FIRST HOUSEHOLD - DAY A wall clock, keeping time. It’s cozy in here, but not warm. A palpable chill hangs over the lived-in parlor. Nobody’s been by in some time. Four beaming, airbrushed faces in a framed photograph on the mantelpiece. Father, mother, two-point-five kids. The glass on the frame is just barely frosted over. ANGLE on the FRONT DOOR. From outside: A pair of muted FOOTSTEPS. The adjacent window QUIVERS as a small SCREWDRIVER slides in underneath the sill. It’s a tight fit. The screwdriver’s shaft SCISSORS back and forth, slowly forcing its way through. GRINDING the sill’s hardwood base into FLAKES, misting through the air like snow. A GLOVED HAND reaches into the newly formed crevice, angling  its way toward the front door. TWISTING the LOCK...",
      "characters": [],
      "action_text": "The door swings open, revealing a MAN, early 30s, on the porch. He wears a fleece jacket, baggy workman jeans and hiking boots. Thick-framed glasses. Average build. This is DEL. He scuffs his boots on the floor mat. Surveys the room. His eyes land on the ticking wall clock. He plucks the clock from its moorings. Removes the batteries. The ticking sound abruptly dies. He re-hangs the clock. Straightens it. He deposits the batteries in a zip-lock bag. Folds the bag into the front pocket of a worn Kipling backpack. Swings the backpack over his shoulder. The ape keychain dangles at Del’s side, open-mouthed in a state of perpetual awe. INT. VARIOUS - FIRST HOUSEHOLD - DAY Del rummages clinically through the empty home. He strips the batteries from the smoke alarm. From Daddy’s electric toothbrush. From the kids’ toy RCs and night lights and mobile gaming consoles. From Mommy’s vibrator. He neglects the wad of cash on the dresser. The jewelry. The flat-screen television. He scans the bookshelf, index finger outstretched. Plucks out the more obscure titles. He removes the family portrait from its frame. Sets the frame upright just where he found it. EXT. FIRST HOUSEHOLD - DAY Del kneels in the grass, a surgical mask over his nose and mouth. He’s spray-painting a large white   X   across the lawn. He gets to his feet. Brushes the dirt from his knees. Strips off his gloves, revealing two pale, bony hands. We pull back to see every single house on the block, all the way to the end of the street, marked with the exact same   X .  2.",
      "dialogue_count": 0,
      "word_count": 501
    },
    {
      "scene_number": 2,
      "slugline": "EXT. LAKE - DAY Del stands at the edge of the water, stark naked, hosing himself down with a portable camping shower. EXT. DEL’S TRUCK - DAY Six buckets of fresh lake water rattle in the rear enclosure of Del’s pick-up truck. Del brakes at an intersection. Looks both ways. Continues on. INT. GROCERY STORE - DAY Del coasts the aisles with a shopping cart. Most of the grocery’s stock is still in place, though the fluorescent lights, fridges and freezers are down. He checks expiration dates. Takes only what he needs. EXT. LIBRARY - DAY Del’s truck pulls to a stop outside the town library. INT. LIBRARY - DAY Del replenishes the AAA batteries in his Brother P-Touch® Label Maker. He traverses the stacks, adding the books from his haul to the library’s inventory. Labeling them with their proper Dewey Decimal codes. INT. GREENHOUSE - DAY A wide assortment of plants, shrubs and vegetation. Del circulates, spritzing each of them with water. He listens closely. The roots purr and gurgle under their soil, lapping up the new liquid. He savors the sound. EXT. MAIN STREET - DAY Del pilots a heavy-duty street sweeper up and down the road, its twin brushes WHIRRING and GRINDING.  3.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 207
    },
    {
      "scene_number": 3,
      "slugline": "INT. READING ROOM - LIBRARY - DAY Del sits on the floor, piecing together a complicated jigsaw puzzle of a nautical tableau. We pull back to discover the room is carpeted with a seemingly endless collection of puzzles, all completed. EXT. SOUND - DAY The sun’s last light casts intense and powerful streaks across the sky. A lone sailboat bobs on the ocean’s surface. Del’s bare feet hang from the boat’s edge as he reads one of his books. His nose swathed in layers of sunblock. His fishing rod STIRS. Del JUMPS. He abandons his book, grabbing hold of the rod and reeling in his line, mad with excitement. INT. BACK ROOM - LIBRARY - NIGHT A toy aquarium, battery-operated, filled with plastic clownfish and glowing neon blue water. Del’s curled up on a hammock in the darkness, munching on a well-balanced meal of cooked fish, brown rice and veggies. He watches an old screwball comedy on a laptop. Chuckles through mouthfuls of food. He keeps an eye on the laptop’s battery power. It’s dwindling at nineteen percent. A mammoth pile of unused laptops and portable DVD players rests beside his hammock, stacked like pancakes. EXT. ROOFTOP - LIBRARY - NIGHT Del spreads out on a blanket, gazing up at the nighttime sky. Every single star is visible, every constellation defined, an awesome natural panorama that belongs to Del and Del alone. He falls asleep smiling.  4.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 238
    },
    {
      "scene_number": 4,
      "slugline": "INT. BATHROOM - LIBRARY - DAY Del shaves in the mirror. Clips his fingernails. Tweezes his eyebrows. Swabs the wax from his ears. He pops two gummy vitamins. EXT. STREET - DAY Del jogs past rows and rows of suburban houses marked with his white   X . He crosses into a new part of town, where the front lawns are still bare. Unexplored territory. Del stops to catch his breath. He scans the area. Listens. Hears movement. He turns, alarmed. It’s the window blinds from a nearby house. They’re rustling, scratching softly against the glass... Somebody’s inside. Del approaches the porch, moving furtively. He presses his ear to the door. From the other side -- something’s CLAWING against the door’s paneling. Something low to the ground. Del thinks. He turns the knob. The door’s unlocked. He pushes it open... A small DOG bursts forth, wild with newfound freedom. Pawing frantically at Del’s leg. Eyes wide and watery. It’s a pug, and a fat one at that. Filthy. Rabid with energy. And its sharp talons, long ungroomed and ill-maintained, CUT DEEP into Del’s SKIN... Del shakes the thing off his leg. Nudges it outside with his leg. Shuts the door behind him. INT. SECOND HOUSEHOLD - CONTINUOUS Del instantly GAGS. This place REEKS. It’s PUTRID.  5.",
      "characters": [],
      "action_text": "Flies circling in droves. Dog shit everywhere. Del whips the surgical mask over his nose and mouth. He breathes heavily, his eyes pooling from the stench. He makes his way through the house. Steps over a big, bulging bag of DOG KIBBLE -- year’s supply -- it’s been CLAWED INTO. He proceeds cautiously into the kitchen. The flies’ buzzing amplifies, grows DEAFENING... There it is. Slumped across the tiled floor, contorted in an awkward, awful position... a BODY. A woman. Very old. Very dead. Del processes the gruesome scene. He continues into the living room. There’s a second body, slouched over in a leather armchair. Head facing away from Del and toward the defunct television. A halo of flies overhead, almost angelic. The husband. Also very old. Also very dead. The TV remote still locked in his hand. Del pulls away the surgical mask. Squats down to meet the rotting corpse face-to-face. The man’s eyes are marbled over, glazed white. Del shimmies the remote from the man’s ice-cold hand. Pops out the batteries. Pockets them. INT. SECOND HOUSEHOLD - DAY Del hops over the woman’s body to the trash drawer. Extracts the garbage bags all at once. He sweeps up the mess. Scrubs the floor. Collects the doggie droppings and scattered pet food into the bags. He yanks the rug out from under the furniture. Tears out the shower curtain. Wraps the bodies into them, burrito-style. He pulls the couple’s yellowed wedding portrait from its frame. They look youthful, happy. He replaces the empty frame on the bureau.  6.",
      "dialogue_count": 0,
      "word_count": 475
    },
    {
      "scene_number": 5,
      "slugline": "EXT. SECOND HOUSEHOLD - DAY Del takes out the trash. He pauses at the sight of the fat pug dog, sitting eagerly on the curb. Staring back at him. Tail wagging. INT. DEL’S TRUCK - DAY Del loads the bodies into the back of his truck. The dog’s seated in the passenger seat, gazing out somberly at the newly sprayed white   X   on its owners’ lawn. EXT. WOODS - DAY Del off-loads the bodies into the dirt. EXT. WOODS - LATER Del digs a hole with a well-worn shovel. The dog watches at his side, panting. INT. DEL’S TRUCK - DAY Del returns to his truck. He looks in the side mirror. The dog’s pacing the woods in circles, sniffing around at the patch of fresh grave. Del starts his car. The dog looks up. Del turns away. Starts driving. The dog barks, strained. Chases after the truck with effort, its stubby legs giving out easily. Del accelerates, staring forward. The dog’s barking grows distant in his wake. He flinches. Takes his foot off the gas. Allows the dog to catch up to him. EXT. LIBRARY - DAY Del dumps a bucket of water over the dog.  7.",
      "characters": [],
      "action_text": "He grooms the dog’s nails with a small pair of scissors. He peeks under the dog’s hood. It’s male. He prints out a label. Affixes it to the dog’s new collar. “NAME: DEWEY.” INT. STREET - DAY Del walks Dewey on a leash. Dewey circles a fire hydrant with mild interest. EXT. BEACH - DAY Del and Dewey play fetch. Dewey moves very slowly. INT. LIBRARY - NIGHT Del eats a home-cooked meal at a cluster of desks, reading a library book on pet care. Dewey lingers at his feet. Del feeds him a baby carrot. INT. CHILDREN’S SECTION - LIBRARY - NIGHT Del installs Dewey in an enclosed pen outfitted with bean bag cushions and a bowl of water. Dewey roams the perimeter, restless. Del exits. INT. DRUG STORE - DAY Del picks from an assortment of colorful chew toys. Tests their squeaking capabilities. INT. CHILDREN’S SECTION - LIBRARY - DAY Del returns to Dewey’s pen with a shopping bag filled with toys and treats. He stops. The bean bags are TORN APART. Beans EVERYWHERE. Water bowl OVERTURNED. The pen’s BREACHED... Dewey’s GONE. Del rounds a corner. A shred of paper catches on his shoe. He inspects it -- it’s a page from a picture book. Ripped apart. Destroyed.  8. He looks ahead. Sees the remnants of an entire stock of children’s books, all RIPPED to SHREDS. Del panics. He sinks to his hands and knees. Tries to gather the scraps and re-order them. It’s a hollow task. They’re all ruined. Del starts to tear up. He turns. Dewey’s gazing at him. Munching on one of the pages. Unrepentant. Del takes a deep breath. INT. DEL’S TRUCK - DAY Del drives, steadfast. In the passenger seat: An overflowing trash bag filled with every last one of the pet supplies. He peers in the rearview. Dewey stares back at him, curious. EXT. LIBRARY - NIGHT Del parks his car for the evening. He’s alone now. INT. CHILDREN’S SECTION - LIBRARY - NIGHT Del surveys the empty space where Dewey’s pen once was. He smooths out the creases in the carpet. INT. LIBRARY - NIGHT Del re-files the books on pet care. INT. BACK ROO",
      "dialogue_count": 0,
      "word_count": 580
    },
    {
      "scene_number": 6,
      "slugline": "EXT. SOUND - DAY It’s a windy day at sea. Del’s sailboat rocks with the waves, swaying up and down. Del shrouds himself in a blanket. INT. LIBRARY - NIGHT Del eats dinner in silence. INT. BACK ROOM - LIBRARY - NIGHT Del stares at the plastic fish in his toy aquarium, swimming back and forth, smiles etched on their faces. He turns on his side in the hammock. Tries to sleep. Just then: A low RASP. Barely audible. Del perks up. He scrambles to his TRANSISTOR RADIO. Tunes it to the correct frequency. The sound sharpens. It’s a VOICE. WOMAN (O.S.)  Hello?  Del’s eyes widen. WOMAN (O.S.) (CONT’D)  Can anyone hear me?  Del watches the radio in awe. WOMAN (O.S.) (CONT’D)  Please. Please, somebody be there.  Del grabs the radio. Holds down the talk button. Opens his mouth to speak... He falters. DEL (weak) No. Del takes his finger off the button. DEL (CONT’D) No. He SMASHES the RADIO.  10.",
      "characters": [],
      "action_text": "DEL (CONT’D) No. He chokes. Hyperventilates. Inhales sharply. DEL (CONT’D) Oh god. Oh god. Suddenly: BANG. BANG. BANG. From outside. Sounds like a HAIL of GUNFIRE. Del BOLTS. EXT. ROOFTOP - LIBRARY - NIGHT Del rushes out onto the roof, just in time to catch the mighty FIREWORKS DISPLAY on the HORIZON. The night sky is RIDDLED with TECHNICOLOR. The stars flushed away, overwhelmed by the dramatic BARRAGE of LIGHT and SOUND. Rockets soaring upward and rippling through the atmosphere, exploding violently, shredding the heavens... It’s BLINDING. Del shields his face. Covers his ears. Screams. His voice is DROWNED OUT. INT. BATHROOM - LIBRARY - NIGHT Del barricades the door. Blacks out the window with thick strips of duct tape, immersing himself in TOTAL DARKNESS. We can still hear the fireworks in full force outside. Del locks himself in a stall, curling his knees up into his chest. He gropes a SWITCHBLADE in his hand. His grip is shaky, unstable. The knife drops to the floor, landing with a small CLINK. Del shuts his eyes. Takes a series of deep breaths. DEL (in SOTTO) Please. Please no.  11.",
      "dialogue_count": 0,
      "word_count": 350
    },
    {
      "scene_number": 7,
      "slugline": "INT. BACK ROOM - LIBRARY - NIGHT The radio, smashed into pieces, crackles quietly. WOMAN (O.S.) (distorted)  Can you hear me now?  The receiver light fizzles out. INT. BATHROOM - LIBRARY - DAY Del wakes up. It’s quiet outside. He takes a peek through the window. The skies are clear. EXT. LIBRARY - DAY Del sidles out from the library’s double doors. There’s no one in sight. He listens closely. Hears a sound, very distant. It’s a CAR ALARM. EXT. STREET - DAY A terrible wreck. There’s a STATION WAGON up on the curb, FLATTENED under a felled LAMPPOST. Windshield SMASHED IN. Engine FUMING. The alarm BLARES. Del approaches cautiously, knife outstretched. The driver’s incapacitated. Maybe dead. Del squints for a better look. The driver is female. Almost certainly the woman from the radio. He edges closer. She’s young. Late teens or so. Gash on her forehead. Looks nasty. Probably dead. Del opens the car door.  12.",
      "characters": [],
      "action_text": "The body slumps out into Del’s arms. He checks for a pulse... Her eyes flicker open. They stare at one another. WOMAN You’re here. She smiles. WOMAN (CONT’D) I’m gonna fuck you into the next dimension. She laughs. Slips back into unconsciousness. Del sets her down in the grass, taking care not to bang her head. Returns to the car. The dash is papered with deflated potato chip bags and empty liquor bottles and stray undergarments. He looks in the backseat, spots her transistor radio. Her leftover fireworks. A Polaroid camera. A GameBoy. Two bulging floral-print suitcases, frayed at the seams. He pops the glove compartment. Finds a small HANDGUN, buried among loose papers. He peers over his shoulder at the young woman splayed out on the grass. Contemplates his next move. INT. LIBRARY - DAY Del unzips the suitcases. Sifts through the wrinkled clothing and toiletries. He uncovers a weathered PHOTO of a FAMILY. Taped together in places -- it looks as if it’s been torn up before. The girl. Her mother, father, little sister. All smiles. Underneath, he finds a newer series of overexposed Polaroid selfies taken at various iconic national landmarks. In each of them, the girl mugs for the camera with a ridiculous face. He lingers on a photo taken at the crest of the Grand Canyon. She’s sticking her tongue out at him. This is GRACE.  13.",
      "dialogue_count": 0,
      "word_count": 390
    },
    {
      "scene_number": 8,
      "slugline": "INT. BEDROOM - ABANDONED HOUSE - DAY Grace stirs awake. Her vision stabilizes. She’s in a BEDROOM, sparsely decorated. The windows are BOARDED SHUT from the outside. A sliver of DAYLIGHT pours in from a neglected crack. She sits up with pain. Runs her hand through her hair. Her forehead’s dressed in layers of GAUZE. It STINGS. She gets to her feet. Feels DIZZY. Grabs a trash can, digs her head in. HURLS. GRACE Ugh. Fuck me. She wipes her mouth. Heads to the door. Reaches for the knob. It’s LOCKED. She RAPS her FISTS on the DOOR. GRACE (CONT’D) Hello? Hello--? Nothing. She flings open the dresser drawers. They’re all EMPTY. The room’s been cleaned out completely. The only spare item a bottle of hand sanitizer on the night stand. She hears a pair of FOOTSTEPS. Turns back to the door. Sees a shadow pass across the small round PEEPHOLE. DEL (O.S.) Is there anyone else? GRACE What’s going on? DEL (O.S.) Answer my question, please. GRACE What’s your question? DEL (O.S.) Is there anyone else? GRACE It’s just me in here. DEL (O.S.) I know that already.  14.",
      "characters": [],
      "action_text": "GRACE Oh, so it’s my fault your question was fucking stupid. The shadow disappears from the peephole. GRACE (CONT’D) Wait! DEL (O.S.) Is there anybody else? GRACE There’s no one else. DEL (O.S.) Anywhere? Grace’s eyes narrow in on the door. GRACE Are you not-- DEL (O.S.) Anywhere? There’s a hint of panic in his voice. Grace processes. She exhales slowly. GRACE Anywhere. DEL (O.S.) It’s just you? GRACE Just me and you. DEL (O.S.) That’s all? GRACE Yeah. That’s it. We’re it. A long pause on the other end. DEL (O.S.) Why are you still alive?  15.",
      "dialogue_count": 0,
      "word_count": 289
    },
    {
      "scene_number": 9,
      "slugline": "INT. HALLWAY - ABANDONED HOUSE - CONTINUOUS Del stands on the other end of the door, watching Grace through the peephole’s fishbowl POV. Grace looks directly at him. GRACE Why are you? INT. BEDROOM - ABANDONED HOUSE - DAY Grace waits. Finally, Del speaks up. DEL (O.S.) What about the gun? GRACE Gun? Which gun? DEL (O.S.) The gun in your glove compartment. GRACE Oh, that gun. I found it on the road a few months back. I figured maybe it’d come in handy one day. DEL (O.S.) Against who? GRACE Well... who’s to say they don’t all come back from the dead and try to eat our brains? DEL (O.S.) That won’t happen. GRACE Why not? DEL (O.S.) Because it doesn’t happen. GRACE And the entire human population of earth dropping dead in a single instant on a Tuesday afternoon, does that not happen either? No response.  16.",
      "characters": [],
      "action_text": "GRACE (CONT’D) Will you let me out? DEL (O.S.) I can’t yet. GRACE Come on, man. (a pause) I’ll make it worth your while. She lets the last word linger. DEL (O.S.) I’m going to unlock the door. That’ll cue you to start counting to fifteen Mississippi. I’ll be counting too, from farther away. After fifteen Mississippi you can open the door. I won’t be here. Don’t look for me. GRACE Hold on. DEL (O.S.) There’s a car outside, it’s got a full tank of gas and all your belongings, minus the gun. You shouldn’t have that. GRACE Dude, what the fuck--? DEL (O.S.) You have to leave. You have to leave and forget you were ever here and never come back. Please. GRACE But... we’re all that’s left. DEL (O.S.) I’m going to start counting now. GRACE Are you listening to me? I said we’re the only ones still out here! We’re the sole fuckin’ survivors, man! You can’t just ghost me like we’re in fucking middle school--! DEL (O.S.) One Mississippi.  17. The doorknob CLICKS. DEL (O.S.) (CONT’D) I’m leaving now, two Missi-- Grace opens the door. Meets Del head-on. Smirks. GRACE You’re tall. DEL What are you doing? GRACE You sounded shorter. DEL Please go back inside and close the door, this isn’t right. It’s not what we talked about. GRACE You’re bossy too. We can work around that. DEL There’s nothing to work around. You’re leaving. GRACE You think it’s a coincidence we found each other? DEL No. You were drinking and you crashed your car on my street. GRACE Ah, that’s right. DEL It’s not funny. In your drunken binge you took down a lamppost, and now I have to fix it. That’s going to require substantial renovations and-- and considerable labor-- GRACE Labor. DEL Yes. Manpower.  18. GRACE Man-power. DEL Stop that. GRACE C’mon. You know as well as I do why He kept the two of us alive. DEL Who? Who kept us alive? Grace points upward. DEL (CONT’D) Wow. Okay. GRACE Haven’t you ever heard of “be fruitful and-- DEL --and multiply,” yes. It’s from the King James Bible, Genesis 1:28, call two twenty f",
      "dialogue_count": 0,
      "word_count": 1308
    },
    {
      "scene_number": 10,
      "slugline": "EXT. LAKE - DAY Del fills his buckets with water. Grace appears beside him. GRACE I can help clear the bodies. DEL I don’t need help. I’m 92% done. GRACE You’ll get done a lot quicker with an extra pair of hands. And we can start planning our expansion. DEL Expansion? GRACE To the next town. And the next one after that. I bet we can clear the whole county in no time. DEL I’m not interested in clearing the county or any of the other towns. He gets to his feet. DEL (CONT’D) My obligation starts and ends with this town. It’s my home. It’s been my home as long as I’ve lived. The least I can do is keep it clean. GRACE But there’s so much else out there. DEL That’s a subjective opinion. GRACE When was the last time you left? DEL I’m not sure how that’s important. GRACE That long, huh? Del doesn’t respond. He hauls the buckets to his truck. Grace grabs two herself.  25.",
      "characters": [],
      "action_text": "GRACE (CONT’D) I’m staying here whether you like it or not. DEL Why? I’ve been nothing but rude to you all morning. GRACE I’m an extrovert. I wasn’t built to be alone. You can ignore me all you want, give me the silent treatment, whatever. I don’t need to talk to you. Just let me talk at you. He looks to her. GRACE (CONT’D) I need to know there’s someone else that can hear me. INT. LIBRARY - DAY Del files books with a pair of noise-cancelling headphones clamped over his ears. Grace trails. He pays her no mind. GRACE (voice raised) I was making my way up the coast. My aunt got me this guide of the fifty U.S. landmarks you need to see before you die. One per state, and it ends at Niagara Falls. Have you been to Niagara Falls--? He walks right past her into the next aisle. Grace pulls a book from the nearest shelf and inserts it elsewhere, out of alphabetical order. She catches up to Del. Removes his headphones. GRACE (CONT’D) You like books? DEL Yeah, I do. GRACE Me too!  26. DEL That’s great. He fastens the headphones over his ears once more. GRACE We should start a book club! EXT. BEACH - DAY Grace watches from the shore as Del sails. She polishes off a beer, crushes the can and chucks it into the water. She raises one hand to eye level. Pinches the sailboat with her index and middle fingers. INT. LIBRARY - NIGHT Del prepares an intricate sushi platter for himself, complete with wasabi, ginger and soy sauce. Grace observes the meal in awe. GRACE Are you eating fish? DEL It’s salmon sashimi. He nips at the fish with a pair of chopsticks. GRACE Some apocalypse this is. She gets up. Browses the stacks. GRACE (CONT’D) So why do you think it happened? Why did everyone die like that? DEL No use in speculating. I doubt we’ll ever know for sure. GRACE Maybe it was the Rapture. DEL Maybe. Probably not. He sucks his chopstick clean.  27. GRACE Where were you when it--? DEL I was sleeping. GRACE You were sleeping at two-thirty on a Tuesday afternoon? DEL I worked nights. GRACE",
      "dialogue_count": 0,
      "word_count": 2346
    },
    {
      "scene_number": 11,
      "slugline": "INT. BEDROOM - THIRD HOUSEHOLD - DAY Del searches the bedroom. GRACE (O.S.) You charged her seven hundred dollar late fees on a single book? He yanks open the bedside drawer. Nothing but old trinkets and travel brochures. DEL This was a special book. Are you familiar with Tolstoy? GRACE (O.S.) Was he the one they stabbed in the eye with an ice-pick? DEL No, that was Trotsky. Leo Tolstoy was one of the greatest writers to ever walk the earth. GRACE (O.S.) Never heard of him. DEL Regardless. Six years ago Mrs. Lipschitz checked out our best edition of   War and Peace . Call five eighty-three sixty or so. Fourteen hundred pages. Leather-bound. He reaches deep into the recesses of the adjacent closet. DEL (CONT’D) She claimed our records were wrong, that she never checked it out in the first place. Eventually we were forced to write it off as a loss. But I always had a feeling... No luck. He withdraws his hand. DEL (CONT’D) Shit. GRACE (O.S.) Found it. Del turns.  39.",
      "characters": [],
      "action_text": "DEL Really? INT. STUDY - THIRD HOUSEHOLD - DAY Del returns downstairs. DEL Where is it? Grace nods to a giant tome propping up the sofa’s bum leg. Del’s face falls. GRACE I guess Tolstoy’s not for everyone. She digs out the book. The sofa collapses on one side. GRACE (CONT’D) Here you go. One big, fat copy of  War and Peace . She hands Del the book. He looks down at it sadly. DEL She stretched out the leather. GRACE Ready to go? DEL Almost. He bends down, lifts the sofa and replaces the weak leg with a small wooden block. DEL (CONT’D) There. INT. FOYER - THIRD HOUSEHOLD - DAY Grace lingers in the house. Through the window behind her, we catch a glimpse of Del spray-painting the front lawn. Her gaze lands on an empty picture frame, sitting upright on the mantelpiece. She peers out the window. Watches Del work.  40.",
      "dialogue_count": 0,
      "word_count": 330
    },
    {
      "scene_number": 12,
      "slugline": "EXT. WOODS - DAY Grace stands at the precipice of a freshly dug grave. Del prepares to bury the deceased homeowner. GRACE Shouldn’t we say a few words? DEL We don’t have time. Grace grabs the shovel from Del’s hands. GRACE You knew her. She was a person. Not just some piece of trash. DEL You really believe that? GRACE Yeah, I do. DEL So all those bodies you saw lying in the streets, the ones you told me got caught up in your tires wherever you went-- you didn’t say words for any of them, did you? GRACE No. DEL Exactly. GRACE But I held my breath. DEL What? GRACE Every time I saw one of them I held my breath for ten seconds. Like I was driving through a tunnel or something. If I stopped before ten seconds I’d make myself start over from the beginning. It was just this stupid thing I did. I’m not even sure why.  41.",
      "characters": [],
      "action_text": "DEL And what happened when you saw clusters of them all at once? GRACE I held for longer. Del nods. DEL Okay. He straightens his posture. Inhales deeply. Holds. Grace takes a second to catch on. She follows his lead. They wait. They exhale. GRACE Bye, Mrs. Lipschitz. She lowers the first mound of dirt into the hole. EXT. LAKE - DAY Del enjoys a shower by the lake. Behind him, the water’s surface begins to RIPPLE ever so slightly. He doesn’t notice. GRACE Boo! Grace POPS OUT from UNDER the WATER. Startled, Del TOPPLES into a nearby BUSH. GRACE (CONT’D) Whoops. Sorry. INT. GROCERY STORE - DAY Grace paces the frozen food aisle, all but cleared out. She frowns at a stray pint of gelato, melted and shriveled. GRACE Man. What I wouldn’t give for some Neapolitan ice cream right now.  42. At the next aisle over, Del examines the granola selection with a discerning eye. DEL What’s that? GRACE You’re joking, right? The three flavors. You know what this is. DEL Maybe. I haven’t got much of a sweet tooth. GRACE You’re lucky. Since I’ve been on the road my two primary food groups are Pop Tarts and potato chips. You should’ve seen what I looked like before the apocalypse. No ass whatsoever. Now? Now I have a   donk . DEL I hadn’t noticed. Grace reaches the wine and spirits aisle. It’s pristine. Not a bottle missing. GRACE Hey Del, you a big drinker? DEL Not so much, no. GRACE All right. More for me then. She clears the tequila shelf. INT. GREENHOUSE - DAY Grace admires the plant life. GRACE I can’t believe you’ve been able to keep these alive for so long. Del brushes past her, watering a nearby row of gardenias. DEL They’re owed most of the credit. These are the sole survivors of a particularly harsh winter.  43. Grace pokes gently at a bright pink orchid flower. DEL (CONT’D) I do my part in feeding them, but every last plant in this habitat had to make a case for itself. And under suboptimal conditions, they each managed not only to survive but to thrive. Trust me, they wouldn’t",
      "dialogue_count": 0,
      "word_count": 658
    },
    {
      "scene_number": 13,
      "slugline": "INT. LIBRARY - NIGHT Del powers up one of his laptops, inserts a DVD disc. He turns to Grace, who munches quietly on a bowl of popcorn. DEL Tonight’s film is   Africa Screams  from 1949, starring the great Bud Abbott and Lou Costello. Keep your eyes peeled for Max Baer and Shemp Howard in supporting roles. He takes a breath. DEL (CONT’D) The film has a total runtime of eighty minutes, but we’ll enjoy a brief intermission at forty-five minutes as we switch to a new laptop with more battery life. Grace gives a thumbs-up. DEL (CONT’D) Thank you. He sits down beside Grace. The film begins. INT. LIBRARY - LATER Del and Grace watch as Abbott and Costello bumble around the jungle in ill-fitting safari gear. Del chuckles heartily at each wisecrack. Grace takes a long sip from her wine glass. GRACE I’ll be right back. Del doesn’t seem to care. Grace heads off into the stacks. She roams aimlessly, arms swinging at her sides. Bored. She stumbles upon a door that reads EMPLOYEES ONLY. A faint neon blue glow pours out from underneath, soaking her toes. She inches closer. Opens the door. Peeks her head in.  45.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 200
    },
    {
      "scene_number": 14,
      "slugline": "INT. BACK ROOM - LIBRARY - CONTINUOUS Grace wanders inside the makeshift bedroom. Sees the toy aquarium, the hammock, the pile of laptops. She probes the space. Her gaze falls on a large stack of PHOTOGRAPHS hidden in a dark pocket of the room, bound together with a thick rubber band. She takes a look at the woman in the first photo. It’s Mrs. Lipschitz, on vacation in Italy. The missing photo from the picture frame. Grace pulls off the rubber band. She sifts through the photographs one by one. The first few are familiar to us: the elderly couple’s wedding portrait, the airbrushed nuclear family. They’re the newest in a stack of hundreds. Grace opens a nearby filing cabinet, revealing an impossibly comprehensive collection of similar PHOTOGRAPHS... A town’s worth of people smiling back at her. EXT. ROOFTOP - LIBRARY - NIGHT Del and Grace gaze up at the stars from a picnic blanket. GRACE I never knew there were so many. DEL I did. GRACE Why do you keep doing that? DEL What? GRACE Never mind. She stretches out on the blanket. GRACE (CONT’D) You know I used to pray every night before I went to sleep?  46.  (MORE)",
      "characters": [],
      "action_text": "Me and my sister, we’d kneel down at our beds, clamp our fingers together and we’d pray. My parents too. Real ride-or-die God-fearing folk, we were. My dad was a pastor. He died on the toilet. I’m not really sure what that means... Del turns to her. DEL Do you still believe? GRACE I have no idea. I’m in the market if you’ve got anything good. Del shrugs. DEL Just the basic thermodynamics. GRACE Y’know, Del, I envy you. DEL Why? GRACE You were asleep. All you had to do was wake up, walk outside and find the world changed. DEL I guess. GRACE Yeah. Must have been nice. She chugs her wine bottle dry. Sets it off to the side. GRACE (CONT’D) I’ll bet it never even crossed your mind what I was doing when it happened. DEL I figured it’d be impolite to ask. Grace grins stupidly. She’s drunk. GRACE I was with a boy.  47.  GRACE (CONT’D) She gives Del a knowing glare. He slides away from her. DEL It’s getting late. GRACE You don’t want to hear my story? DEL Maybe tomorrow. Grace edges closer. GRACE You ever fuck a girl in the back of your truck? Pull her panties down over her knees, take her from behind--? DEL Come on. Don’t do that. GRACE What? DEL Don’t take this to a vulgar place. We were having a good time. GRACE I can get you off. DEL That’s a bad idea. GRACE Oh, I think it’s an excellent idea. She reaches for him. He gets to his feet. Grace’s smile fades. GRACE (CONT’D) What’s wrong? DEL You’ve had too much to drink. GRACE I know what I’m doing. You don’t have to treat me like a child.  48. DEL Then stop acting like one. Grace stands up. GRACE I get that you’re nervous. It’s okay. I can help you. DEL You should get some sleep. We have a long day ahead of us tomorrow. GRACE Wait. DEL Take any of the marked houses. The doors are unlocked. He disappears inside. INT. BACK ROOM - LIBRARY - NIGHT Del paces the room, breathing quickly. His face grows FLUSH. His hands ball into FISTS. DEL Fuck. Fuck you. Piece of shit--! He HURLS a dead laptop AGAINST THE WALL, where it SMASHES ",
      "dialogue_count": 0,
      "word_count": 669
    },
    {
      "scene_number": 15,
      "slugline": "INT. BATHROOM - LIBRARY - DAY Del brushes his teeth. Spits. His eyes are lined with dark circles. EXT. LIBRARY - DAY Del walks out into the daylight. He searches the block. No sign of Grace anywhere. INT. BEDROOM - NEW HOUSE - DAY Grace changes into a sweatshirt. Stuffs stray belongings into her suitcase. Forces the old thing closed. Zips. She examines the tattered photo of her family. Folds it gently into her back pocket. She peers out the northernmost window. Sees the library across the street. Sees Del. He’s standing on the curb, searching. He looks uneasy. Grace’s eyes dart to her suitcase. Back outside. To her surprise, Del’s staring directly up at her. He chances a wave from the curb. Grace thinks. She waves back. INT. BASEMENT - FOURTH HOUSEHOLD - DAY Pairs of HANDPRINTS coat the walls in UV green and purple. All shapes and sizes. Glow in the dark, psychedelic basement decor. The only hint of life in this otherwise shadowy tomb. From above, the door CREAKS OPEN. A beam of LIGHT streaks through the dark abyss, exposing the musk and rotting vapor below. Grace descends the stairs with caution. We catch quick glimpses of her face, in green and purple hues, as she passes the glowing handprints.  50.",
      "characters": [],
      "action_text": "She reaches blindly. Knocks over a lava lamp. She aims her flashlight down at her feet. The shards of broken glass. The wax congealed in a fat, solid glob. It almost sounds like it’s wheezing. From upstairs: DEL (O.S.) Everything all right? GRACE Yeah. I’m good. She bends down and removes the batteries from the base of the broken lamp. EXT. SOUND - DAY Multiple fishing rods perch from the rim of Del’s sailboat, each with a line cast out to sea. Del glares up from his book. Grace sits across from him in a bathing suit top and floppy hat, engrossed in a magazine. She turns the page. Adjusts her aviators. Ignores Del. Del resumes his own reading. Suddenly, the rod at Grace’s side WOBBLES. She lowers her magazine. Looks to Del. The line TIGHTENS. The rod’s SLIPPING. Del’s eyes widen. DEL Go--! Grace LUNGES for the ROD, the sunglasses FLYING from her face. She GRINDS IN the REEL... Another line CATCHES. Del SPRINGS to ACTION. INT. STAFF KITCHEN - LIBRARY - NIGHT Del filets a tuna with a sharp knife. He cuts the hunk of fish into small slices.  51.",
      "dialogue_count": 0,
      "word_count": 407
    },
    {
      "scene_number": 16,
      "slugline": "INT. LIBRARY - NIGHT Del and Grace eat an elaborate sushi dinner. Grace maneuvers her chopsticks awkwardly, struggling to find the right grip on the slippery fish. Del watches her with mild amusement, using his own pair with an expert’s dexterity. Grace succeeds in guiding the tuna over her sauce tray. She gives Del a self-satisfied smirk. Her chopsticks’ hold FALTERS. The tuna PLOPS into the tray, DRENCHING HER in SOY SAUCE. Grace sighs. She looks up at Del. Del neatly sets his own chopsticks aside. Reaches for the fish with his bare hands. Grace smiles. Abandons her chopsticks. Digs in. INT. LIBRARY - LATER Del and Grace watch another old comedy. On the screen, some poor buffoon topples down a flight of stairs and lands in a trash can. Grace’s eyes shift to Del. He’s laughing. She follows his cue. Erupts in a belly laugh. Oversells it. Del turns to her, startled. EXT. BEACH - DAY Del and Grace play a spirited game of ping-pong. They’re both oddly adept. The ball zooms back and forth over the net, their strokes intensifying with each volley. Del hits a pop-up. Grace goes in for the kill. Puts it away. Throws her fists overhead in victory. INT. GREENHOUSE - DAY Grace scatters seeds in a pot of soil. She adorns the pot with a smiley-face sticker. Nearby, Del picks heirloom tomatoes from one of his plants.  52.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 236
    },
    {
      "scene_number": 17,
      "slugline": "INT. BACK ROOM - LIBRARY - DAY A finely detailed town map hangs on the wall. Each of the cleared lots is marked with a white   X . INT. LIVING ROOM - FIFTH HOUSEHOLD - DAY Grace tosses Del a rolled-up trash bag, javelin-style. He catches it with one hand. EXT. FIFTH HOUSEHOLD - DAY Grace pushes a wheelbarrow packed with corpses across the front lawn. She winds past Del, who mows the grass. INT. LIBRARY - DAY Del files new books into the collection. Grace whirls behind him on a hoverboard, leafing through a dense manual on solar energy. EXT. ROOFTOP - LIBRARY - DAY Del and Grace attempt to install a set of solar panels on the roof. They prove increasingly unwieldy. EXT. MAIN STREET - DAY Del teaches Grace how to drive the street sweeper. She SLAMS her FOOT on the GAS. The vehicle HURTLES FORWARD, nearly RAZING another LAMPPOST. EXT. YARD - DAY Grace chases after a stray chicken. Panicked, the chicken averts Grace’s clutches. EXT. PARK - DAY Del and Grace eat scrambled eggs on a park bench. Grace offers a bite to the chicken, who nips at it happily.  53.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 197
    },
    {
      "scene_number": 18,
      "slugline": "INT. ROOFTOP - LIBRARY - DAY Del adjusts the angle on one of the solar panels. INT. LIBRARY - DAY Grace reads a magazine, feet propped up on the table. Overhead, a single light bulb SPARKS TO LIFE. Grace stares up in awe. Basks in the artificial glow. INT. BACK ROOM - LIBRARY - DAY The white   X es multiply across the map. EXT. STREET - DAY Grace rides her bike through the neighborhood. Every lawn is marked, some of the   X es paled with time. She stops for a quick stretch. Notices something strange off in the distance. Squints for a better look. Directly beyond her lies a DRIVEWAY partially obscured by a curtain of overgrown WEEDS. Blending into the scenery. Grace wheels her bike forward. Pushes past the weeds. The driveway is ripe with cracks and fissures, a bedrock of greenery fighting its way out from underneath. The path ends at the foot of a decrepit HOUSE. The front door dangles off its hinges. Windows shattered. Lawn unkempt with tufts of dead grass. Grace whips out her RADIO. GRACE Del? I found something. Over. She waits. GRACE (CONT’D) Come in, Del. I’m on Putnam Avenue, off of Young O. Over. Static. Grace holsters her radio. She approaches the house slowly, abandoning her bike on the ground.  54.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 220
    },
    {
      "scene_number": 19,
      "slugline": "INT. LAST HOUSEHOLD - DAY Grace wipes past a veil of cobweb. Sidesteps overturned furniture, long decayed and worn through by termites. Among the ruins: Dead plants strewn across the coffee table. Early ‘80s-era television with the screen bashed in. A goldfish lying belly-up on the surface of muck green water. EXT. BACKYARD - LAST HOUSEHOLD - DAY Grace wanders into the backyard, which sits at the threshold of a vast wooded wilderness. She navigates the minefield of crushed beer cans, cigarette butts and crumpled trash. An empty can of lighter fluid. Her eyes are drawn to the grill. Caught between the grates are charred flecks of paper. The mutilated remains of pages, covers, bindings... They’re BOOKS. Or were. Grace turns. She comes face-to-face with a MAN, stooped in a plastic lounge chair on the patio. He stares directly at her. His eyes are a pair of lifeless orbs, glazed translucent white. His mouth hangs open, showcasing a set of rotten teeth. Grace absorbs the gruesome sight. Her gaze strays downward. She spots a lone photograph, old and faded, discarded among the garbage and dead leaves. It’s a BOY, pre-teen, standing at the edge of a lake. The same lake Del frequents. His eyes are closed. DEL (O.S.) This is Millburn. Not Putnam. Grace looks up. Sees Del. DEL (CONT’D) I told you not to go into any of the unmarked houses alone. I told you that. GRACE I’m sorry.  55.",
      "characters": [],
      "action_text": "DEL You were never supposed to be here. GRACE We can clean it up. We can clear it together, just like the others. DEL I don’t want it cleared. This house doesn’t get cleared. He shifts his gaze to the man in the lawn chair. His mouth twists into a grimace. DEL (CONT’D) This makes no fucking sense. GRACE It’s just a house. DEL Not the house. You. You were never supposed to be here in the first place. It was just-- it was just supposed to be me. GRACE What? DEL This, all of this, it wasn’t ever the Rapture or the bubonic plague or any of that. How do you not get it by now? (a pause) It was me. Grace’s head stirs. GRACE What are you talking about? DEL I wanted them all to go away. I wanted them to leave me alone and be gone forever. That’s what I wished for. And that’s how it happened. He sniffs in the cool air.  56. DEL (CONT’D) I closed my eyes and I concentrated with every fiber of my brain and I wished for this. Exactly this. GRACE Del. DEL It’s like you said. Afterwards all I had to do was wake up and find the world changed. He laughs to himself. Grace stares at him. DEL (CONT’D) I had it all worked out. It all made so much sense. Until you. See, for the life of me I can’t seem to wrap my head around just why in hell you’re still here too. He shifts his balance. Rocks back and forth on his toes. DEL (CONT’D) You know the first thing I saw when I woke up that day? The playground behind the old elementary school. Same school I went to as a kid. They were out for recess. His eyes start to mist. DEL (CONT’D) I couldn’t just leave them there like that. What kind of person would-- who would-- He falters. Grace takes a step toward him. GRACE You didn’t do this. DEL I did. I did it. GRACE No you didn’t. Because then you’d really be all alone. I’d be dead with the rest of them. Del smiles sadly, lips pursed.  57. DEL Yeah. GRACE Mhm. Grace kicks into high gear. Claps her hands together. Ties her hair up in a ponytail. GRACE (CONT’D) Now I don’t know about you, but I’m gonn",
      "dialogue_count": 0,
      "word_count": 792
    },
    {
      "scene_number": 20,
      "slugline": "EXT. BACKYARD - LAST HOUSEHOLD - DAY Del and Grace heave the man’s petrified corpse from the lounge chair into an open body bag. Grace musses back the man’s unruly hair. Del zips the bag shut. EXT. DEL’S TRUCK - DAY Del and Grace ride in silence. EXT. WOODS - DAY Del slides the body into a fresh grave. He looks to Grace. She digs the shovel into the earth. DEL Wait. He peers down into the hole. He inhales through his nose. Grace does the same. Ten seconds pass. They exhale through their mouths simultaneously. GRACE Is that all? DEL Yeah. That’s all. He takes the shovel. Starts burying. EXT. WOODS - LATER Del marches back to the truck. Grace catches up to him. GRACE Del? He whisks around to face her. She takes hold of his hand. Clasps it tight.  59.",
      "characters": [],
      "action_text": "He glares down tensely at their intertwined fingers. Looks back up at Grace. She’s staring deep into his eyes. They’re inches apart now. Del pulls her in close. Kisses her. He withdraws quickly. DEL I’m sorry. GRACE Why? He thinks. DEL I don’t know. INT. BEDROOM - GRACE’S HOUSE - NIGHT Del’s asleep. Peaceful. Grace lies beside him, wide awake. She veers away from him. Stares ahead solemnly. In the distance, we hear the very faint hum of a CAR ENGINE. EXT. SOUND - DAY The sun edges slowly over the horizon. The first rays of daylight flicker off the ocean’s surface. INT. BEDROOM - GRACE’S HOUSE - DAY Del’s eyes sway open. He shifts to Grace’s side of the bed. She’s not there. Del checks his watch. Gets up. Gathers his clothes. He hears a series of murmurs through the wood panelling in the floor. Vaguely distorted. Coming from downstairs. It’s a voice. But it’s too low to be Grace’s. He listens closer. The voice is MALE.  60.",
      "dialogue_count": 0,
      "word_count": 313
    },
    {
      "scene_number": 21,
      "slugline": "INT. STAIRWELL - GRACE’S HOUSE - DAY Del pads down the stairs. The man’s voice grows sharper. MAN (O.S.) That’s amazing. That’s really tasty. Is that cilantro? Del approaches the dining room. He sees Grace seated at the table, her back to him. MAN (O.S.) (CONT’D) Hello? GRACE Yes. MAN (O.S.) It is cilantro? GRACE Yes. MAN (O.S.) I knew it. Just like they have back at the club.   Cee-lan-tro . Mm. Del stops in the doorway. Grace turns to him. A full breakfast spread out on the table. Scrambled eggs and hash browns. Three place settings. Three people. Across from Grace, a MAN and a WOMAN, both late 40s. Napkins folded neatly into their laps. They exchange a quick look with one another. MAN (CONT’D) Hi there! The man gets up from his chair. His collared shirt is tucked into his pants, girding a beer belly. MAN (CONT’D) Grace didn’t mention she had company. I’m Miles. Miles Mercer. Miles extends his hand outward. Del stares past him.  61.",
      "characters": [],
      "action_text": "MILES This is my wife Violet. Violet smiles politely. Del doesn’t reciprocate. Miles lowers his hand. He cranes his head to Grace. MILES (CONT’D) He’s not deaf, is he? GRACE No. VIOLET I think maybe he feels we’re encroaching. MILES Ah. Well, we certainly didn’t mean to cause any trouble. We’ll be out of your hair just as soon as we’re done with our breakfast. Del glares up at him. He nods. MILES (CONT’D) Would you care to join us? Grace here prepared one hell of a meal. It’d be a shame to see it go cold. VIOLET Don’t be shy. Have a seat. Del sits at the table, his nerves flaring. MILES (to Grace) Go on. Make him a plate. Del peers over at Grace. She avoids him. MILES (CONT’D) Grace. Grace abruptly grabs a plate. Shovels it full of eggs. MILES (CONT’D) So what’s your name? DEL Del. MILES Del what?  62. DEL Just Del. MILES Come on. Del’s the name of my laptop. It’s gotta be short for something, hasn’t it? Let’s see. Stop me when I’ve got it. Delroy? Delbert? Delano--? DEL I’m just Del. MILES Well, if you say so. Violet turns to Del. She speaks slowly. VIOLET This is a lovely town, Del. Do you live here all on your own? DEL Until recently. Yes. VIOLET And your bodies? DEL Buried. VIOLET That’s nice. MILES It’s like exactly how we do in Houston, isn’t it? Albeit on a much smaller scale-- I’m sure Grace’s told you all about Houston-- Del flinches. MILES (CONT’D) Did I say something wrong? DEL (to Grace) Who are they? Grace gazes down at her plate. MILES Well, we’re the Mercers. I think we already covered that.  63. VIOLET Grace, don’t bite your fingernails. Grace retracts her hands from her mouth. MILES So Del, what exactly are your intentions with our daughter? Del tightens. GRACE Excuse me. She gets up. MILES Sit down. She does so, reluctantly. MILES (CONT’D) (to Del) You seem surprised. Has Grace not told you about us? Miles turns to Grace. MILES (CONT’D) She’s never once mentioned having had parents? No? Didn’t come up? DEL I don’t understand. MILES What’s there to ",
      "dialogue_count": 0,
      "word_count": 2582
    },
    {
      "scene_number": 22,
      "slugline": "EXT. ROOFTOP - LIBRARY - DAY Del cracks open a bottle of vodka. Raises it to his mouth. Chugs. Chugs. Chugs. He chokes. Erupts in a coughing fit. Lets the bottle drop to the ground, shattering at his feet. His eyes are watery. Bloodshot. He teeters his way to the solar panel. Paws at it with both hands. Rends it from its hinges. EXT. STREET - DAY Del urinates on a patch of lawn. Crudely traces the spray- painted lines of the white   X . Hums a tune to himself. He hasn’t shaved in days. EXT. LAST HOUSEHOLD - DAY Del staggers down the unpaved street. Surveys the sad house at the end of the driveway. He reaches sloppily into his waistband... Draws the HANDGUN from Grace’s glove compartment. He cocks the gun with effort. Steadies his aim. His finger curls the trigger... BANG. A window BURSTS INTO PIECES. He feels the rush. He fires again. Again. Again. The gunshots echo through the empty wood. Birds flee to the skies, squawking in excitement. He keeps snapping the trigger long after the chamber’s expended. His face twisted into something awful. He chucks the gun at the house. DEL Fuck--! He loses his balance. Lands squarely in the dirt. DEL (CONT’D) Fuck you. Fucking...  77.",
      "characters": [],
      "action_text": "He tries to get up. His world is SPINNING... His legs give out underneath him. He falls right back down. He’s filthy. Drenched from head to toe in mud and glass and snot and shit. Blistered. Bleeding. It’s not a good look. Slowly, he reclaims his wits. Focuses on breathing. Staccato and irregular grows deep and pronounced. Regaining consistency. Or a measure thereof. He cups his hands together. Spits. Rubs down his eyes with his palms... His vision begins to steady... He hears a BARK. He tilts his head up. Perks his ears. Listens. Just then: A second BARK. Low. Strained. But definitely there. He looks forward. His eyes narrow. A few yards away, we can just barely make out the hazy outline of a DOG... A fat, old PUG. It’s Dewey. Del stares in awe, speechless. The corners of his mouth threatening the slightest of smiles. He chances a blink. Looks again. The dog’s gone. Disappeared without a trace. Del processes, dumbfounded. INT. BACK ROOM - LIBRARY - NIGHT Del ransacks his stockpile of battery-operated gadgetry. At long last, he locates his transistor radio. Mangled from the earlier abuse. Taped together. Still workable. He powers it up. Puts his mouth to the receiver. DEL Hello? He listens. Hears STATIC. Toggles to the next frequency.  78. DEL (CONT’D) Hello? He waits... More STATIC. It’s quiet out there. EXT. MAIN STREET - DAY The once-clean street is littered haphazardly with crumpled papers, empty bottles and myriad miscellaneous trash. On the adjacent sidewalk, Del sits cross-legged in one of the two rocking chairs. The other remains empty. He rocks gently back and forth. His face is sunburnt, his lips chapped. We get the impression he’s been stationed here for the better part of the day. Maybe longer. EXT. LAKE - DAY Del splashes his face with water. The liquid revives his cracked skin, catches in his graying beard. He submerges the buckets one by one. INT. GREENHOUSE - DAY Del ambles through the rows of plants, spritzing each with less care than usual. His gai",
      "dialogue_count": 0,
      "word_count": 2430
    },
    {
      "scene_number": 23,
      "slugline": "INT. FOYER - MERCER RANCH - DAY Del hastens to the front door, leaving behind a trail of blood-soaked shoe prints. DEL Are you coming? Grace remains in the hallway, the gun limp at her side. DEL (CONT’D) Grace--? GRACE We have to get rid of them. She turns to Del. GRACE (CONT’D) When they find the bodies, they’ll open an investigation. They know who I am. They’ll come after us. DEL Who will? GRACE Do you really want to know? Del considers this. GRACE (CONT’D) We have a few hours before anyone else shows up. We need to make it look like they left town. DEL Okay. GRACE There should be trash bags and cleaning supplies in the garage. They might have some extra paint back there too. DEL Where’s that? Grace points. Del heads for the door. GRACE Hey Del? I’m sorry I shot them. Del stops. He looks back at her.  89.",
      "characters": [],
      "action_text": "DEL No you’re not. GRACE Is that okay? DEL I think so. Yeah. INT. VARIOUS - MERCER RANCH - DAY Del yanks out the shower curtain. He and Grace slide Violet’s body onto the plastic. Her head is covered with a SKI MASK drenched in BLOOD. They roll her into a tight cocoon. Secure it in place with one, two, three layers of packing tape. They fold Miles’s body into a bearskin rug. His head, or lack thereof, also MASKED. Grace sprays the floor with a cleaning solution. Sops up the bloody footprints with a fat sponge. Del picks at the flecks of brain matter in the wall with a pair of tweezers. Deposits them in a trash bag. Grace dances around him, erasing any and all traces of blood with a fresh coat of white paint. Del peruses Miles’s library. Picks out a book he doesn’t recognize. Reads the dust jacket. Tosses it in his backpack. Grace powers down the medical equipment. Changes the sheets on her bed. Smooths out the creases in the fabric. Del heaves two bulging trash bags into the back of his truck. Miles and Violet’s burritoed bodies are already buckled in. Grace jerks the plug from the digital picture frame. Mi and Vi’s smiling faces ZAP to BLACK. Del activates the kitchen faucet. Marvels at the sight of running water. Cranes his head downward... Lets the liquid flow freely over his face. Drinks. EXT. MERCER RANCH - DAY Del exits the house. He sees Grace in the front yard, the paint bin at her side.  90. He walks over to her. She holds out a damp brush. Del thinks. He takes the brush from Grace. Kneels into the dirt. Paints a long, thick STRIP of WHITE. Then ANOTHER. He pulls back, revealing an   X . DEL Ready? GRACE Almost. INT. KITCHEN - MERCER RANCH - DAY Grace beelines to the freezer. Flings the drawer open. From FREEZER POV, we look up at Grace’s face, awash in a soft orange light. She smiles wide. INT. DEL’S TRUCK - DAY Del and Grace hit the road. The city skyline fades to nothingness in the back windshield. Grace cradles a mammoth bucket of Neapolitan ice cream i",
      "dialogue_count": 0,
      "word_count": 596
    }
  ]
}