{
  "slug": "im-dying-up-here-101-pilot-2017",
  "title": "im dying up here 101 pilot",
  "genre": "comedy",
  "format": "series",
  "scenes_count": 9,
  "characters_count": 0,
  "characters": [],
  "total_words": 13450,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. SUNSET TOWER HOTEL - DUSK CHYRON 1973 Los Angeles, California MUSIC CUE: ‘I’LL TAKE YOU THERE’ by the STAPLE SINGERS INT. SUNSET TOWER HOTEL - LOBBY - DAY CLAY APPUZO, 26, good looking in an Al Pacino/Serpico kinda way, a little disheveled, a little scruffy, makes his way through the lobby carrying only an old gym bag and two six packs of Bud. INT. SUNSET TOWER HOTEL - REGISTRATION DESK - CONTINUOUS Clay pulls some crumpled cash from his front pocket. Smoothing out each bill, a smiling Clay pays the CLERK who looks on mildly annoyed. INT. SUNSET TOWER HOTEL - ROOM - SHORT TIME LATER Clay walks down the hallway to his room. The hotel is chaos. 70’s ROCK AND ROLLERS with long hair and sunglasses saunter by with their GROUPIE CHICKS, smoking a joint as the BELLBOY tries to keep up. TWO FEMALE GROUPIES, one crying while the other comforts her, are blocking the door to Clay’s room. He works around their histrionics, unlocking the door before disappearing inside. WE SEE QUICK CUTS WHILE THE MUSIC CONTINUES TO PLAY getting louder and louder. Clay ENTERING his room and throwing the gym bag onto the bed. Clay GRABBING A BEER. Clay OPENING the curtains as the late afternoon sun filters into the room. EXT. SUNSET TOWER HOTEL - BALCONY - CONTINUOUS Clay LOOKS OUT over Hollywood’s famous Sunset Strip. CLAY places the bottle cap against the lip of the railing and in one motion punches down on it. The cap flips off and we watch as it makes its way down to the parking lot fifteen stories below. Clay takes a swig as he leans his forearms on the railing, all of Sunset Blvd. spread before him. END MUSIC CUE INT. SUNSET TOWER HOTEL - SHOWER - LATER",
      "characters": [],
      "action_text": "Clay is taking a shower. He holds himself up as the hot water pours down over him shrouding him in steam. FLASHBACK: 1972 eight months earlier INT. CLAY’S APARTMENT - SHOWER - NIGHT Clay stands in the shower washing CASSIE HARRINGTON’S back. 26, cute, a Texas girl with a bit of a Holly Hunter drawl that comes and goes depending on how tired she is, revels in her boyfriend’s touch. Cassie’s eyes glaze over as Clay’s hands move down out of frame. INT. CLAY’S APARTMENT - BEDROOM - LATER Clay lies on his back as a half nude Cassie straddles him, post coital smoking a joint. She leans down and shot-guns the smoke into his mouth. She sits back up, stoned, smiles. CASSIE What do you think happens to us when we die? CLAY (chuckles, coughs) Where the hell did that come from? Cassie laughs. She climbs off Clay and lies on her back. CASSIE I don’t know... grass makes me introspective. (playfully slaps his arm) Don’t make fun of me... CLAY Well... from what I’ve read... you shit yourself... then I think it’s anybody’s guess. CASSIE (laughs) Jerk. (then, jokingly) They say when you orgasm you die a little. Is that why you don’t want to come anymore? You afraid of dying? Clay laughs her off inquiry.  2. CASSIE (CONT’D) It’s not so crazy. You’re family were church goer’s, maybe you’re afraid God might get mad at you for having sex out of wedlock and smite you... Your not coming is some kind of... fucked-up loophole. Clay chuckles and takes the joint away from Cassie. CLAY No more Red for you. CASSIE I knew a guy who had so much God guilt about sex that all his masturbation fantasies were of him being forced to have sex at gunpoint or they’d kill his mother. CLAY Fear of God is not my issue. Fear Of irrelevancy... now that scares the shit out of me. CASSIE So, why don’t you come with me anymore? Clay relights the joint over the following: CLAY You know who Edmund Hillary is? CASSIE The guy who climbed Everest? CLAY Uh-huh. Took him years to prepare for that climb. He risked everyth",
      "dialogue_count": 0,
      "word_count": 1500
    },
    {
      "scene_number": 2,
      "slugline": "INT. GOLDIE’S - MAIN STAGE AUDIENCE - CONTINUOUS CARL HODGE, a marginal at best talent manager, 60’s, balding, wearing a somewhat dated suit and tie, approaches ARNIE BROWN, 30, bird-like, not a particularly funny comic but a Goldie lackey who does a little of everything at the club. Carl taps Arnie on the shoulder. Arnie turns, his face drops. Not this pain in the ass. ARNIE What’s up, Carl? CARL Someone’s sitting at my table’s what’s up. WE ANGLE ON: A YOUNG COUPLE sitting at a small two-top up front. ARNIE Fuck. (then) Can I sit you somewhere else? Just this once? CARL You know who I’m meeting here tonight? Charlie -- ARNIE/CARL Callas... CARL That’s right smart guy. You want to tell an American treasure he’s got to sit in the back? Arnie storms off to move the couple. CARL (CONT’D) (calling after) I’ve had that table since the joint opened. Should fucking know better. INT. GOLDIES - BAR AREA - CONTINUOUS A small black and white television set glows ghostly gray images at the end of the bar. Set away from audience this is where a lot of the comics hang between sets. Several mill around the set as ‘THE TONIGHT SHOW’ theme music starts up. At the other end of the bar is KAY, small, cute, early twenties as she gives orders to the BARTENDER.  7.",
      "characters": [],
      "action_text": "KAY Three Michelobs and a Singapore Sling. And ask the kitchen where the fuck my chicken wings are? (then to comics) Somebody call me when Clay goes up. A moment later Kay exits the bar and crosses through the middle of the main room chaos. With a tray of drinks and chicken wings, she darts through the patrons who seem to be spilling out into every available nook and cranny. KAY (CONT’D) Coming through... We follow KAY OUT AND DOWN A HALLWAY. The deeper we go the quieter and emptier it gets until we enter a much smaller much more subdued space... INT. - GOLDIE’S - THE CELLAR - CONTINUOUS Cassie is at the mic in the not-so-main-room of Goldie’s known as the CELLAR. A direct contrast to the main room. The cellar is smaller, dank and looks like its name. It’s where the overflow ends up when the main room fills. No one wants to be here including the comics. Part nursery, part elephant’s graveyard, its inhabitants are usually green comics starting out or comics who’ve been around awhile but aren’t good enough for the big room. Seating about a hundred, tonight there are about forty drunks in attendance. Goldie enters and watches from the back. At the mic, a bubbly Cassie is leaning heavily on her southwestern accent. CASSIE ...I grew up in Wink, Texas. Wink is really small, really hot and really disgusting. It’s like if your armpit could produce oil and field a High School football team. MALE HECKLER Show us your tits! Cassie shields her eyes and spots a THREE-HUNDRED POUND, BEARDED DRUNK HECKLER sitting with some BUDDIES. His pals crack up encouraging him. CASSIE You first, Sir. The room laughs at Cassie’s comeback.  8. CASSIE (CONT’D) Looks like there’s a buncha y’alls. What’s the occasion? MALE HECKLER Bachelor party. CASSIE Well, what’re you doing sitting around here? That hooker in your trunk ain’t gonna bury herself. MALE HECKLER Hey, c’mere and suck my dick! Again, the obese drunk heckler and his friends crack up. CASSIE Tempting but... what if there’s a cave in wh",
      "dialogue_count": 0,
      "word_count": 1361
    },
    {
      "scene_number": 3,
      "slugline": "INT. GOLDIE’S OFFICE - CONTINUOUS Goldie’s grin broadens as she watches Clay settle in next to Carson. Arnie stares at the set. Unabashed envy plastered across his mirthless face. ARNIE He got the couch... that’s all she wrote. GOLDIE I told Frank Johnny’d eat him up. INT. SUNSET TOWER HOTEL - ROOM - CONTINUOUS JOHNNY CARSON Very funny stuff. So, do you get back to Boston much? CLAY I try to make it back for all the major funerals. You can fly free if someone dies so I plan all my vacation trips around dying relatives. (mimes phone call) Uncle Sal’s not doing so good, eh? Yes, very sad. Any chance of him hanging in there till opening day? The audience and Johnny laugh. We cut over to Clay lying on the bed, he smiles, pleased. INT. GOLDIES - MAIN STAGE AUDIENCE - LATER THAT NIGHT Goldie crosses through passing Carl’s table. She puts her hand on his shoulder. Carl startles, takes it and kisses it. CARL Sit. GOLDIE Funny. Goldie remains standing. This is obviously a courtesy stop. CARL Adam Proteau. What do you think? GOLDIE I think I’ve got more hair on my lip than he does on his nuts.  13.",
      "characters": [],
      "action_text": "CARL He’s ready, Goldie. GOLDIE He’s a sapling. CARL (sighs) Can you stick him in the Cellar? GOLDIE Fleisher and Stevenson open mic’d for over a year. Defeated, Carl nods. GOLDIE (CONT’D) Trust me. If the ship builders put in a little more time and sweat into the Titanic, the word would still just mean big. Goldie stops Kay as she passes. GOLDIE (CONT’D) Another Rob Roy neat for Carl. KAY Got it. INT. SUNSET TOWER HOTEL - LOBBY - SHORT TIME LATER A WHISTLING Clay makes his way through the lobby headed to the exit. He smiles at the DOORMAN who opens the door for him. Clay slips him a five. The doorman nods in appreciation. EXT. SUNSET BLVD - STREET - CONTINUOUS Clay stands at a red light on a corner of Sunset and takes a deep breath of air. Cars come to a halt as the ‘WALK’ sign appears. What people are there, cross while Clay waits and lights a cigarette. After a beat, the light TURNS GREEN and cars start to accelerate as the flow of traffic picks up. Just as a SPEEDING bus FLIES through the light, Clay flicks his cigarette into the street while simultaneously stepping off the curb directly into the path of the oncoming bus. The bus SLAMS into Clay sending him FLYING, he PINBALLS off an oncoming car before landing on the side of the road, DEAD. CLOSE on Clay’s LIFELESS BODY, eyes open as he stares blankly towards the night sky. A PROSTITUTE APPROACHES and screams. PROSTITUTE Somebody call an ambulance!  14. PEOPLE scatter to call for help. The prostitute then quickly starts rifling through Clay’s pockets while we ANGLE BACK ON THE CROSSING SIGN that now FLASHES “WALK.” MUSIC CUE: ‘IT’S YOUR THING’ by the ISLEY BROTHERS. EXT. BOSTON   COMBAT ZONE - CONCURRENT CHYRON: Boston Massachusetts Combat Zone 1973 3:30 AM CLOSE ON: The grotesquely frozen grin of A DRUNKEN HOMELESS MAN, as a body bag zips shut over his face. TWO PARAMEDICS lift him like a slab of meat and place him onto a stretcher. We PAN UP TO SEE A GIANT FLUORESCENT EYEBALL AND THE WORDS ‘THE NAKED EYE’, SP",
      "dialogue_count": 0,
      "word_count": 2003
    },
    {
      "scene_number": 4,
      "slugline": "INT. GOLDIES - BAR - LATER THAT MORNING Cassie, staring off, snaps out her trance when Bill lays his hand on her shoulder. Eyes red, she places her hand over his letting her cheek rest on it. Sully, Ralph and a NUMBER OF OTHER COMICS huddle silently at the bar. Goldie and Arnie sit on stools a few feet away trying to make sense of things. A different place during the day, Goldie’s is eerily silent except for a YOUNG BAR BACK who wheels a keg through, a reminder that this is still a place of business. SULLY Should we have some sort of a... memorial service...? TIM AWREY, 20’s, starts to giggle. Everyone looks at him. TIM Sorry... sorry... BILL The whole thing is so fucked up. One minute he’s killing on Carson -- Tim snorts, breaking up laughing. Everyone looks at him annoyed. TIM I’m sorry, I dropped two hits of blotter at 3 AM so I’m still fucked up. But this is terrible... please go on with your memorial arrangements for Clay. Tim dissolves into another fit of giggling. TIM (CONT’D) (regaining control) I’m sorry... sorry. CASSIE I’m picking Clay’s parents up at the airport in a couple hours. I’ll see if they’re open to us having some sort of... ceremony or -- Tim starts giggling again. BILL Jesus, wait out fucking-side will you, Tim?  22.",
      "characters": [],
      "action_text": "TIM I didn’t know Clay died when I took the shit. I thought I’d be baby- sitting my nephews now. We watch H. R. Puffenstuff together on Saturdays... Sully gets up and walks the giggling Tim out. SULLY Come on, Timmy... Let’s go get you that ‘Uncle of the Year’ mug. GOLDIE Maybe we can all say a few words... have a little food... ARNIE Should I get us a church? GOLDIE (tamps out cigarette) Fuck no. We’re in one. INT. CASSIE’S DODGE DART - THAT AFTERNOON Cassie is driving CLAY’S PARENTS, GUY AND ANGIE APPUZO. Guy is on the passenger side while Angie sits in the back. Both in their 60’s, they are obviously distressed and sleep deprived as Cassie drives them to Clay’s apartment. From her rear view mirror she sees CLAY’S APPARITION smirking from the back seat. Cassie comes to a stop on at a light on Sunset. Guy spots TWO PROSTITUTES standing on the corner. They both wink and wave. Guy rolls up his window, disgusted. GUY God willing... some day all this will be ashes. Clay’s apparition chuckles. CLAY’S APPARITION You know they hate you, right? The only thing they hate more than you is the idea of driving around Los Angeles lost. EXT. 101 HIGHWAY - CONTINUOUS A YELLOW CAB makes its way down the 101.  23.",
      "dialogue_count": 0,
      "word_count": 453
    },
    {
      "scene_number": 5,
      "slugline": "INT. CAB -   LA - CONTINUOUS Eddie and LARRY sit in the backseat of the cab. The cab takes the VINE STREET EXIT. LARRY Is that Vine Street as in “Hollywood and Vine?” The CABBIE looks at them half awake having pulled a double. CABBIE Tourists? LARRY Comics. From Boston. The Cabbie chuckles. LARRY (CONT’D) What? CABBIE Nothing. LARRY Come on, let us in on the joke. CABBIE At the risk of blowing my dime tip, I’ll tell you. Ever since Carson moved his outfit from New York to here, every asshole who thinks he can tell a joke is circling Burbank like a fucking vulture. LARRY Nice to meet you too. CABBIE You asked. EDDIE Where’d you pick us up? CABBIE Airport. Is this a bit? EDDIE The airport. Not in the middle of nowhere, not some podunk shit can town... You picked us up at the airport because that’s where the work is. Same difference.  24.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 159
    },
    {
      "scene_number": 6,
      "slugline": "INT. LADY OF THE PALMS CHURCH - LATER Adam is juggling for a group of IMMIGRANT TODDLERS. They’re all laughing and trying to grab the balls from Adam who plays along with them. He’s a natural. From the back FATHER JACOB, mid 30’s watches. INT. LADY OF THE PALMS CHURCH - FATHER JACOB’S OFFICE- LATER Father Jacob counts out the fifty bucks as Adam watches. FATHER JACOB You certainly have a way with children, Adam. ADAM Is it me Father, or do little kids smell? It’s like there’s a... “tang” to them. Father Jacob smirks, hands him the fifty bucks. Adam takes the money and counts it while Father Jacob studies him. FATHER JACOB You religious, Adam? ADAM Too young. I figure I’ll find Jesus after I’m drafted or while careening off an overpass. FATHER JACOB A conversion based on fear isn’t a conversion, it’s insurance. ADAM Nice, Father. If the Catholic Church starts doing fortune cookies I think you’re their man. (then, off money) Any chance you get to talk to the powers that be about my raise? FATHER JACOBS Sorry Adam. ADAM You sure there’s no way they could throw a little more bread my way? Father Jacobs studies Adam a beat. Then:  25.",
      "characters": [],
      "action_text": "FATHER JACOB There are... other ways of supplementing your income here. ADAM Done. What and how much? FATHER JACOBS It’s not for everybody, Adam. It comes at a great personal compromise. For everyone. ADAM I’m still waiting on the figure. FATHER JACOB Two-hundred. ADAM Dollars? FATHER JACOB It pays a lot Adam, because it costs a lot. Off Adam, his curiosity piqued... INT. CLAY’S APARTMENT - DAY - CONTINUOUS Cassie, along with Clay’s parents, look around the apartment. Cassie is barely holding it together, hanging back she lights a cigarette. Clay’s mother fights back tears, every artifact a conduit. His father moves slowly, stoically, refusing to remove his winter jacket. Angie opens the refrigerator, it’s practically empty. ANGIE (to herself) He wasn’t eating. (to her husband) He wasn’t eating. She shuts it and moves out of the kitchen. INT. CLAY’S APARTMENT - BEDROOM - CONTINUOUS Guy wanders into Clay’s bedroom. Small, poorly lit, he opens a dingy shade to let light in. The bed is unmade. Angie enters with Cassie following and instinctively starts making the bed. Guy grunts as he pulls open a window. In the middle of making the bed, Angie stops. She pulls the sheets up close to her face. She inhales them then buries her face in them, crying. The reality of it all hitting her head on, she lets it all out while Guy sits next to her and holds her.  26. Cassie shifts uncomfortably before crossing and gently resting a hand on Angie’s shoulder not sure if it’s welcome or not. From outside we hear a loud knock on the door. EXT. HALLWAY CLAY’S APARTMENT - CONTINUOUS Cassie answers the door revealing Eddie and Larry with overnight bags, she looks at them blankly. EDDIE Yeah, hi. Clay here? CASSIE Who are you? EDDIE We’re friends of his out from Boston. He said we could crash with him when we came to town. So... here we are. (holds out his hand) I’m Eddie Ziedel, and this is my friend, Larry Shack -- Too exhausted and emotionally drained for tact: CASSIE I’m sorry... Clay’s",
      "dialogue_count": 0,
      "word_count": 995
    },
    {
      "scene_number": 7,
      "slugline": "INT. SUNSET TOWER HOTEL - CLAY’S ROOM - CONTINUOUS Cassie enters Clay’s hotel room escorted by the MANAGER. MANAGER There’s not much really... a change of clothes... half a pack of cigarettes... hardly worth you coming over here but it’s hotel policy. On top of the change of clothes is a postcard. Cassie picks it up and reads it. It’s a postcard of NAPLES ITALY from Clay ADDRESSED TO CASSIE. On it are just two words: “Fa Napoli.” INT. GOLDIE’S - LATER The place is nearly empty. Arnie sits at the bar going over the liquor list for that night. Eddie and Larry enter in mid conversation. EDDIE What kind of God does something like that? You work your ass off, kill on the ‘Tonight Show,’ get the fucking couch, then that very night you’re hit by a bus? LARRY Your friend got hit crossing against a green. That’s not God, that’s either Darwin or Budweiser. EDDIE You’re real cunt sometimes, you know that? Larry smiles at Eddie as they approach Arnie. LARRY S’cuse me? Who do we talk to about stage time? Arnie jerks his head toward the north end of the bar. ARNIE Amateur night’s Monday. Sign up sheets by the register. LARRY We don’t do open mic. We’re pros.  30.",
      "characters": [],
      "action_text": "ARNIE That’s different. Richard Pryor’s coming Thursday. I’m sure he won’t mind if we bump him for a couple pros. EDDIE He didn’t mean any offense. We’re working comics from Boston. We came out to stay with a friend who was gonna set us up here, but unfortunately he... uh... died last night. ARNIE Clay? EDDIE Clay Appuzo, yeah. LENNY -- Anyway, we’ve got no place to crash and we spent everything to get out here, so if you could just help us get some stage time... ARNIE You some kind of Rowan and Martin? EDDIE No. Separate acts. ARNIE Amateur nights the best you’re gonna do. No one plays the big room without Goldie’s blessing. Even open mic’s got a three week wait. LARRY Fuck. ARNIE In the meantime if you need a place to crash, I might be able to help. Eddie and Larry look at one another. Finally, a break. BILL’S APARTMENT - SHORT TIME LATER Cassie knocks urgently on Bill’s door. A half awake Bill answers as Cassie barges through.  31. BILL It’s the middle of the fucking night... CASSIE It’s four o’clock in the afternoon. Read this. Cassie hands Bill the postcard. He rubs his eyes reading it. BILL “Fa Napoli?” He flips it back and forth looking to see if there’s anything else written. He hands it back to her. BILL (CONT’D) Next time just mail it. It’s a postcard not a telegram. (then) I’m going back to bed... CASSIE It’s a suicide note. From Clay. Bill stops. He looks at Cassie. She’s serious. He takes it back from her and looks at it again. BILL How is this a suicide note? CASSIE It’s a Goethe quote. “See Naples and die.” Clay said it all the time. It meant after seeing Naples there was nothing left to do but die because nothing would ever compare to that moment. Bill contemplates this a beat before handing it back to her. BILL It’s a postcard, Cass. CASSIE ...That he left on a nightstand at the Sunset Towers Hotel. Why would he even stay at a hotel he lived two blocks away from? BILL I don’t know... Look, you want to play Mod Squad, fine. Pull this shit with someon",
      "dialogue_count": 0,
      "word_count": 4898
    },
    {
      "scene_number": 8,
      "slugline": "EXT. GOLDIE’S - PARKING LOT - CONTINUOUS As Clay’s parents are leaving, they cross by A YOUNG, OBVIOUSLY PREGNANT WOMAN CARRYING A BASEBALL BAT as she starts SMASHING the windshield of a car that’s parked in the lot. The comics come to the door when they hear the commotion. Sully sees this. SULLY Oh shit... Sully runs out and tries to grab the bat. Betty swings at him and misses. SULLY (CONT’D) Honey... what are you doing?! You know the doctor said no destruction of property until after the baby. A crying Betty rips a piece of paper from her pocket and throws it at him. Sully bends over to pick it up. BETTY It’s the receipt for your crab lotion! If you found out this morning, then why is the receipt from two days ago you sonofabitch?! Again Betty comes down on Sully’s windshield with her baseball bat. At the door Kay and Goldie watch. After a beat. KAY Mind if I grab a beer? GOLDIE I’ll join you. The two women head inside passing Adam who girds his loins and stops Goldie. ADAM Goldie? Hi... Adam Proteau. GOLDIE I know who you are. ADAM I know this isn’t the time -- GOLDIE I said I know who you are. Quit while you’re ahead. Goldie continues back inside her club.  53.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 223
    },
    {
      "scene_number": 9,
      "slugline": "INT. CASSIE’S APARTMENT - NEXT MORNING Cassie sits on a beat up sofa smoking a cigarette. She stares off blankly. Beside her, Clay’s Apparition puffs away on a cigarette also. CLAY’S APPARITION Where are you in all this, Cass? (fake southern accent) All those stories about your mom and how hard it is being a single gal from Wink Texas trying to make it in big ole LA... Clay’s apparition leans back blowing out smoke rings a beat. CLAY’S APPARITION (CONT’D) It’s shit, Cass. Jokes. Fuck, the bartender can tell jokes. Real laughter... it’s... cathartic. It’s the current that runs through an audience when some truth about who you are -- who they are is revealed. Trust me, you’ve got to go out there and put your arms around that messy part of yourself and... Clay mimes as though squeezing it in a deep hug, then releasing it with an, “Ahhhhhhhh.” CLAY’S APPARITION (CONT’D) Family cares too much, Cass. Only strangers can handle the truth. Only they can set you free. So figure out what it is you really want to say, then go out there, open a vein... and say it. Cassie continues to stare off as she brings the smoldering cigarette to her lips. INT. GOLDIE’S OFFICE - LATER THAT WEEK Goldie, cigarette dangling, is counting out cash. There’s a knock, as Cassie pokes her head in. Goldie keeps counting. GOLDIE Come in, Sweetie. Cassie enters and sits as Goldie continues counting.  54.",
      "characters": [],
      "action_text": "GOLDIE (CONT’D) You look tired. You need a bump? CASSIE I want to go up tonight. GOLDIE The Cellar’s yours. Name the time -- CASSIE Not the Cellar. The big room. Goldie stops counting her cash and studies the determined looking Cassie. She tamps out her cigarette, staring. GOLDIE What are you? CASSIE What? GOLDIE I have no idea what the fuck you are. CASSIE I’m a comedian -- GOLDIE No, what are you? You’re funny I’ll give you that. Phyllis Diller, I know what she is. Joan Rivers I get, Moms Mablee... but you? Not a clue. You’ve got no point of view. You’re all over the map. You’re sexy -- which is not a plus. They don’t hear half your jokes because they’re too busy staring at your tits. You go a little blue sometimes and when you don’t you’re all awe shucks and cow shit. I have no idea what your female perspective is. CASSIE There is no one female perspective just like there’s no one guy perspective. GOLDIE We’re not them, honey. Look, you wanna go on the “Tonight Show?” Then let me help you. Find a voice that women can relate to...  (MORE)  55. That sheds light on our mutual experiences, then I’ll stick you on the main stage front and center, my right hand to Carson. Cassie sits back. CASSIE Is Kaufman like Letterman, or Leno like Pryor? GOLDIE That’s not my point -- CASSIE Yet they all fit up there on your stage. Why are women different? There’s room for me, too. I just need your stage to prove it. GOLDIE When you’re ready. Cassie lights a cigarette over the following. CASSIE Word has it the ‘Tonight Show’s’ laying off young comics for awhile. That the circumstances surrounding Clay’s death has got them re- thinking things. GOLDIE Your point? CASSIE The LA Times is doing an interview with me tomorrow about Clay. About his death. They want me to set things straight. The truth. GOLDIE And what is the truth? CASSIE You tell me. Goldie smirks at Cassie. She leans in with her own cigarette and lets Cassie light it. She sits back. GOLDIE Well, at least now I know what y",
      "dialogue_count": 0,
      "word_count": 1858
    }
  ]
}