{
  "slug": "ingrid-goes-west-2017",
  "title": "ingrid goes west",
  "genre": "drama",
  "format": "film",
  "scenes_count": 13,
  "characters_count": 0,
  "characters": [],
  "total_words": 23129,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. LOBBY - THE MEADOWS - DAY  Ingrid is waiting at the front desk clutching a faded L.L. Bean backpack with her name   stitched across the top.   She makes sure no one is watching then reaches over the counter and slides a stamped envelope into the OUTGOING MAIL bin. INGRID (V.O.) Hopefully someday you and I can look back on all of this and laugh. A NURSE appears, handing Ingrid a plastic bag filled with her personal items.   Ingrid opens the bag, taking out her IPHONE. CLOSE on the phone.   We SEE Ingrid’s face reflected in the glass.   She cradles it in her hand, caressing the screen. INGRID (V.O.) Your friend, always -- FEMALE VOICE (O.S.) Ingrid! Ingrid turns, snapping out of her reverie. HER POV - Ingrid’s sister, ERIN, 32, pregnant and dressed in catalog casual, stands in the lobby.   She waves, hopeful.  I/E. ERIN’S SUV (MOVING) - DAY  Erin drives while Ingrid rides shotgun with her head out the window, staring out at the Pennsylvania suburbs as they pass by.   She notices a Corona billboard with the slogan “ Find Your Beach ” and smiles. ERIN Sorry I’m late.   I had to pull Logan out of karate class.   His sensei had a cold sore. Ingrid turns towards the backseat, still glowing. INGRID How’s my little black belt, huh? Erin’s son, LOGAN, 4, sits in the back with headphones on, staring at his iPad.   He doesn’t look up. ERIN Oh, by the way, if anyone asks, we told people you were at a yoga retreat. 5.",
      "characters": [],
      "action_text": "Ingrid looks at Erin, confused.   She laughs uncomfortably. INGRID For eight weeks? ERIN We thought it’d be easier for you to not have to keep explaining to everyone where you were. INGRID Yeah, the thing is... a big part of the healing process is learning how to talk about what happened and not care what other people think. ERIN Totally get it.   Keith and I just feel like all the hospital stuff might be a little heavy for Logan. He’s only in Pre-K. INGRID So what?   You want me to pretend like everything’s perfect? ERIN No!   Of course not.   You can talk about it as much as you want.   Just as long as we’re talking about yoga and not, you know... Ingrid is silent.   This doesn’t sit well with her. ERIN (CONT’D) So... do you want to talk about it? INGRID Not anymore. They continue driving in silence.   Ingrid turns back towards the window, her glow fading a bit.  EXT. ERIN AND KEITH’S HOUSE - ESTABLISHING  A single-story Colonial house with a big yard.   A police motorcycle is parked next to Erin’s SUV in the driveway. 6.",
      "dialogue_count": 0,
      "word_count": 445
    },
    {
      "scene_number": 2,
      "slugline": "INT. NURSERY - ERIN AND KEITH’S HOUSE - DAY  The door opens and Erin’s husband KEITH, 39, enters wearing a short-sleeved cop uniform, his shirt unbuttoned revealing a white tee underneath.   He flicks on the light. KEITH -- and last but not least, I give you the Ingrid Suite.   Voila . Ingrid enters, looking around, with Erin close behind. HER POV - A baby’s nursery has been transformed into a temporary guest room.   There is a cozy-looking bed with fresh flowers on the nightstand, a flat-screen TV, a basket filled with snacks and a banner that reads: “WELCOME HOME, INGRID!” INGRID (touched) You guys, this is so nice. ERIN Stay as long as you want. KEITH Our casa is su casa. INGRID You didn’t have to do all this. I’ll only be here a few days. Ingrid sets down her backpack and opens the closet.   Erin and Keith exchange a worried look. ERIN Where were you planning on going? INGRID (read: obviously) Back to Mom’s house?   Where all my stuff is? Ingrid turns on the closet light and pauses.   It’s filled with clothes and cardboard boxes labeled: “INGRID” ERIN We were gonna wait until you were settled in to tell you but -- KEITH (ripping off the band-aid) We sold the house, Ingrid. 7.",
      "characters": [],
      "action_text": "Ingrid stares at them, completely blindsided. CUT TO: Erin and Keith are standing outside the bathroom door. INGRID (O.S.) Half that house was mine!   She left it to both of us! ERIN Exactly.   Which is why we put half of the money in a checking account under your name. KEITH Big ol’ chunk of change, Ingrid. No response. ERIN We figured you could use it.   How else were we supposed to pay for all your medical bills? The door flies open and Ingrid appears, eyes red. INGRID Don’t you mean my   yoga retreat ?! KEITH Easy, Ingrid -- INGRID No!   Ever since Mom died, you guys have been waiting to kick me out. You just couldn’t help yourselves, could you?! ERIN Ingy, that house was a dump.   It was not a healthy environment for you. Ingrid sits on the bed and closes her eyes, doing a breathing exercise, trying to calm herself. INGRID I’d like to be alone now, please. KEITH (to Erin) Why don’t you tell her how much we got for it? 8. INGRID Why don’t you go fuck yourself? Silence.   Erin gives Keith a look telling him to wait outside. KEITH Okey-dokey. Keith exits.   Erin sits next to Ingrid on the bed. ERIN Look, I know how close you were with Mom.   I can’t even imagine how hard that must have been for you. And after what happened with Charlotte -- INGRID Erin... ERIN My point is, try and see this as an opportunity.   A chance to put all that negativity behind you and start fresh.   You can build a whole new life for yourself.   The life you always wanted. INGRID I don’t know what life I want. ERIN Don’t worry.   It’ll come to you. Ingrid says nothing.   Erin takes her cue and exits, leaving behind a BANK FOLDER with Ingrid’s name on it. Ingrid buries her face in a pillow and SCREAMS.   She lies there for a moment, then tosses the pillow aside, pulling out her phone and powering it on.   The warm glow of the screen lights up her face as she stares at it longingly. ON THE SCREEN - She opens Instagram and searches  @badcharlotte .   Charlotte’s profile appears with a messag",
      "dialogue_count": 0,
      "word_count": 608
    },
    {
      "scene_number": 3,
      "slugline": "INT. DRUGSTORE - DAY  ECU: A series of items being scanned -- an at-home facial kit, a bag of gummy worms, the latest issue of   Vanity Fair,   a six-pack of Corona, a bottle of prescription pills... Ingrid stands at the pharmacy counter with her earbuds in, listening to an audiobook while a PHARMACIST rings her up. MELODY BEATTIE (V.O.)  Maybe our pain is showing us we need to set a boundary.   Maybe it’s showing us we’re going in a wrong direction...  Ingrid looks up to see two of CHARLOTTE’S FRIENDS (JENNY and NICOLE) walking past.   They make knowing eye contact with Ingrid, who quickly turns the other way. The pharmacist hands Ingrid a plastic bag.   She grabs it, throwing down cash and making a beeline for the exit. MELODY BEATTIE (V.O.)  It’s okay to feel hurt; it’s okay to cry; it’s okay to heal; it’s okay to move on to the next feeling, when it’s time...  Ingrid is almost to the door when she sees Jenny and Nicole rounding the corner right in front of her.   Ingrid hides behind a cardboard display filled with candy. We HOLD on Ingrid’s face as she waits for them to pass, removing her earbuds so she can hear them whispering -- JENNY (O.S.) -- what is up with her hair? NICOLE (O.S.) Seriously.   Who’s your stylist? Helen Keller? They laugh.   Ingrid touches her hair self-consciously. JENNY (O.S.) Didn’t they send her to an insane asylum? NICOLE (O.S.) Yep.   Her sister told everyone she was at a yoga retreat. JENNY (O.S.) So dark. 10.",
      "characters": [],
      "action_text": "They disappear around a corner.   Ingrid puts her earbuds back in and heads for the exit, trying not to show any emotion. MELODY BEATTIE (V.O.)  Today, I will not strike out at those who cause me pain.   I will feel my emotions and take responsibility for them...  I/E. NICOLE’S CAR - MOMENTS LATER  A popsicle stick picture frame with a photo of Nicole and her family dangles from the rearview mirror. We RACK FOCUS to Ingrid through the windshield as she exits the drugstore, recognizing Nicole’s car. ANGLE - OUTSIDE THE CAR Ingrid makes sure no one is watching, then reaches into her purse and pulls out Erin’s CAR KEY.   She drags the key along the length of Nicole’s car, leaving a jagged white scratch.  I/E. ERIN’S SUV - EVENING  Ingrid is parked in a suburban housing development, eating gummy worms and staring out the window. HER POV - A brand-new two-story home.   Charlotte and her husband exit, carrying a wrapped gift and a bottle of wine. As they get into their car, Charlotte glances over at us -- Ingrid ducks down.   She peers over the steering wheel. HER POV - Charlotte is squinting in our direction.   She whispers to her husband, who looks over at us, alarmed. Ingrid throws the car into reverse, knocking over a garbage bin.   She jams on the gas and peels off, tires squealing.  INT. BATHROOM - ERIN AND KEITH’S HOUSE - NIGHT  Ingrid is lying in the bathtub, drinking a Corona, wearing a green face mask and flipping through her copy of   Vanity Fair . She pauses on an article featuring a photo of a confident, bohemian-looking young woman in faded overalls sitting cross- legged on her front porch.   The headline reads:  MEET TAYLOR SLOANE, YOUR NEWEST GIRL CRUSH  11. CLOSE on the photo of TAYLOR SLOANE, 29.   Her elegant beauty is offset by an effortless style and laid-back warmth. CLOSE on Ingrid’s face.   Something inside her has shifted. She is transfixed.   Who is this perfect-looking creature?  INT. NURSERY - ERIN AND KEITH’S HOUSE - MINUTES LATER  Ingrid is i",
      "dialogue_count": 0,
      "word_count": 1636
    },
    {
      "scene_number": 4,
      "slugline": "EXT. ERIN AND KEITH’S HOUSE - NIGHT  The house is asleep.   A window opens on the top floor and Ingrid’s backpack is tossed out onto the lawn followed by a duffel bag.   Ingrid climbs out, carefully lowering herself to the ground.   She grabs her bags and runs to a waiting CAB. DISSOLVE TO:  EXT. VENICE BEACH - SUNRISE  The Pacific Ocean shimmers under a pink and orange sky, waves crashing against the shoreline. We PULL BACK to reveal Ingrid sitting in the sand with her bags, staring out at the sea.   She looks down at her phone. ON THE SCREEN - Ingrid is creating a new Instagram account. The cursor blinks in the empty ‘Username’ field.   She thinks for a moment, then types in the words: INGRID (V.O.)  Ingrid Goes West.  Her new profile POPS UP.   A completely blank canvas. Ingrid raises her phone, snapping a picture of the sunrise. She pauses, thinking of the perfect caption. She glances around, her eyes landing on a CORONA AD plastered to the side of a nearby building, then types: INGRID (V.O.)  Finally found my beach.   Happy face emoji.  ECU: Ingrid’s thumb presses the ‘Share’ button.  EXT. VENICE STREETS - DAY  QUICK SHOTS of Ingrid pedaling a brand-new beach cruiser through the streets of Venice, soaking it all in. She pauses in front of an old Victorian house.   There is a brand-new black pick-up truck parked out front with a Batman symbol in place of the Toyota emblem.   A sign posted in the yard reads:   “AVAILABLE: 1 BR + 1 BATH ” 17.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 261
    },
    {
      "scene_number": 5,
      "slugline": "INT. GUEST HOUSE - DAY  Ingrid looks around while the owner, DAN PINTO, 34, rides a two-wheeled scooter around, talking on his phone and puffing on a vape pen.   He wears a flat-brim hat, an XXL Jordan Bulls jersey, board shorts and Adidas slides with tube socks. DAN PINTO (into phone) Last night was haywire, dude.   You see that girl I was talking to? Total smoke show.   Bounced her back to my place for some YouTube and chill.   We were up all night. Pinto glances over at Ingrid, clearly saying this for her benefit, but she isn’t paying attention at all. DAN PINTO (CONT’D) Nah, we didn’t hook up, but it’s all good.   I’m juggling too many bitches right now anyway.   Gotta whittle down my body count -- Ingrid clears her throat.   Pinto lowers his voice. DAN PINTO (CONT’D) Hey listen, I gotta run but hit me up later if you wanna blaze. (awkward beat) Okay, yeah, no worries.   Maybe some other time -- (beat) Hello...?   Jeremy? Pinto hangs up and turns to Ingrid. DAN PINTO (CONT’D) Bad connection. (extends his hand) Hey.   Dan Pinto. INGRID Ingrid. (confused beat) Are you the landlord? DAN PINTO I don’t really like the term landlord.   Just think of me as the chill guy who lives next door and collects rent every month. 18.",
      "characters": [],
      "action_text": "INGRID But... this is your place, right? DAN PINTO It’s really more of a side hustle to keep me cash-positive while I pursue my true passion. Pinto hands her a card that reads “DAN PINTO // SCREENWRITER” in   Batman Forever   font with all of his social media handles. INGRID You write movies? Pinto nods, exhaling a thick cloud of smoke from his vape. INGRID (CONT’D) Anything I’ve seen? DAN PINTO You familiar with Batman? INGRID Wow.   You wrote that? DAN PINTO Not exactly.   But I am working on a script for a new installment in the franchise.   It ain’t exactly “authorized” but my producer Jeremy used to be Joel Schumacher’s assistant and he pretty much guaranteed he’d forward it along once I finish this new draft. Ingrid has already stopped listening and is making her way into the bedroom.   Pinto chases after her. INGRID How much is this place? DAN PINTO All business, huh?   C’mon, Ingrid. (Dr. Evil voice)  Throw me a frickin’ bone here!  Pinto grins, expecting a laugh.   Ingrid looks uneasy. DAN PINTO (CONT’D) (clearing his throat) It’s, uh, twenty-nine hundred a month plus two month’s security deposit.   No pets allowed but we are most certainly 420-friendly. 19. Pinto offers Ingrid a hit of his vape pen. INGRID No thanks. DAN PINTO Very cool.   I’ll just run a quick credit check and I’ll also need some proof of income -- INGRID Can I pay you in cash? Silence.   Pinto seems impressed and a little turned on.  INT. PINTO’S HOUSE - DAY  The place is a glorified dorm room filled with wall-to-wall Batman merchandise, framed posters of classic 90s movies like “The Matrix” and “12 Monkeys” and a giant fish tank. Pinto watches as Ingrid digs through her backpack, counting out nine grand in cash on a table littered with weed jars. DAN PINTO Don’t take this the wrong way, but... are you a prostitute? INGRID Nope. DAN PINTO Drug dealer? (no response) ‘Cause if you were, my producer Jeremy has a legit hook-up -- INGRID I’m not a drug dealer, okay?   My mom died and she left",
      "dialogue_count": 0,
      "word_count": 2879
    },
    {
      "scene_number": 6,
      "slugline": "INT. TAYLOR’S HOUSE - MOMENTS LATER  Taylor and Ezra lead Ingrid through their house.   It’s even more perfect in real life -- Midcentury modern furniture, color-coordinated bookshelves, macrame plant hangers, Moroccan rugs, and tons of natural light. TAYLOR Can we get you something to drink? INGRID I’d love a Corona. Taylor laughs.   Ingrid joins in on a slight delay. TAYLOR I think we can do better than   that . EZRA Taylor makes a killer South Side. TAYLOR It’s the same recipe they use at the 21 Club in Manhattan. INGRID (so confused) Um... sure.  INT. KITCHEN - TAYLOR’S HOUSE - DAY  Ingrid watches as Taylor pours freshly-made cocktails into copper mugs, adding muddled lime and a sprig of mint. TAYLOR Sorry, we’ve been so stressed about Rothko that I haven’t had a chance to run to the farmer’s market. Ingrid looks over at Ezra, searing a fresh piece of tuna with a blowtorch.   He places the wilted dandelion greens atop the plate of seared tuna using a pair of tweezers. EZRA Hope you don’t mind if we improvise a little. Ingrid seems slightly intimidated by how nice everything is. INGRID I feel like I’m at a restaurant. Taylor smiles, handing the finished drink to Ingrid. 32.",
      "characters": [],
      "action_text": "TAYLOR More like   Kitchen Nightmares . Ingrid takes a sip.   It’s the best drink she’s ever tasted. INGRID Holy shit.   This is amazing. Taylor stares at Ingrid with a flicker of recognition. TAYLOR Have we met before? INGRID (nervous) No.   Definitely not. TAYLOR Huh.   Your face looks so familiar. Awkward silence.   Ingrid is desperate to change the subject. INGRID You mind if I use your bathroom?  INT. HALLWAY - TAYLOR’S HOUSE - DAY  Ingrid wanders down the hallway towards the bathroom. She pauses, eyeing a cluster of photos on the wall.   Each one is of Taylor and Ezra in a different desirable location -- on a beach in Tulum, standing atop Machu Picchu, eating sushi with Jiro, wearing costumes at Burning Man... Ingrid leans in closer, noticing a graduation photo of Taylor and her brother, NICKY, a handsome puckish young dude. Ingrid notices an open door.   She peers through the crack. HER POV - A bright, minimalist bedroom with a few art pieces on the walls and even more books and plants.   Ingrid scans the room like a Terminator, taking note of every detail.  INT. BATHROOM - TAYLOR’S HOUSE - DAY  Ingrid turns the faucet on full blast.   She throws back the shower curtain, opens the medicine cabinet and digs through the trash can, snapping pictures with her phone.   Perfume, shampoo, make-up, candles, feminine hygiene products -- 33. INT. KITCHEN - TAYLOR’S HOUSE - MOMENTS LATER  Ingrid sits back down.   Taylor snaps her finger, realizing. TAYLOR I know where I saw you! (off Ingrid’s look) The Echo Park Craft Fair!   You were selling those Bolivian clay pots. INGRID I actually just moved here a week ago. EZRA Maybe you’re confusing her with one of your crazy internet fan-girls. Ingrid tenses up.   Taylor touches her arm, reassuringly. TAYLOR He’s giving me shit because I happen to engage with people on social media like the rest of the known universe.   My husband suffers from chronic technophobia. EZRA That’s not true.   I just don’t want someone forming an op",
      "dialogue_count": 0,
      "word_count": 2332
    },
    {
      "scene_number": 7,
      "slugline": "I/E. PINTO’S TRUCK - EVENING  ECU: A fingernail with a tiny palm tree painted on it dips into the baggie of cocaine. The truck is parked outside a desert bar called PAPPY & HARRIET’S.   Ingrid watches Taylor do a lady-like bump off her nail, tipping her head back to sniff the drip like a pro. INGRID (alarmed) Do you do this a lot? TAYLOR Not anymore.   I went through a brief coke phase in college but I haven’t done any since Burning Man. I know Ezra and I may   seem   like a couple of old fogies but we still know how to cut loose every once in a while.   Have you been to Burning Man?   You should totally join our camp next year. Taylor rubs her gums as she passes Ingrid the bag of coke. TAYLOR (CONT’D) I’m so glad we came here, by the way.   Pappy’s is the best.   The crowd’s a bit sketchy but they always have great live music and the most amazing desert vibes -- Ingrid’s phone DINGS repeatedly from inside her bag. TAYLOR (CONT’D) Um, is everything okay? Ingrid reaches into her bag and subtly checks her phone. ON THE SCREEN - Ingrid’s has 13 MISSED CALLS from Pinto and a series of frantic text messages:   “Is everything OK Ingrid?” “Why aren’t u answering ur phone??!!”   “Helloooooooooo .” INGRID Just Dan checking up on me. TAYLOR That is so sweet.   Ezra never texts me when I’m out of town.   His communication skills are atrocious. Ingrid’s phone LIGHTS UP with another call from Pinto. 44.",
      "characters": [],
      "action_text": "TAYLOR (CONT’D) Come on, let’s dance! Taylor hops out.   Ingrid hesitates for a beat, then presses  “Decline”   and powers her phone OFF.   She dips her nail into the bag of blow and accidentally does a HUGE BUMP as we -- CUT TO:  INT. PAPPY & HARRIET’S - NIGHT  Ingrid and Taylor are at the bar, toasting margaritas. Taylor holds up her phone, snapping a photo of them together. CUT TO: Taylor and Ingrid are on the dance floor.   Taylor moves her body with a sexy confidence, while Ingrid shuffles around self-consciously, trying to imitate Taylor. CUT TO: Ingrid and Taylor are doing Fireball shots by the pool tables with a group of DRUNK MARINES.   Taylor snaps another photo. CUT TO: Ingrid, Taylor and the Marines are all on the dance floor. Ingrid is starting to get loose.   One of the Marines tries grinding with Taylor but Ingrid wedges herself between them. CUT TO: Ingrid, Taylor and two of the Marines are crammed inside the bathroom stall, doing lines.   Taylor is talking non-stop while Ingrid nods, hanging on her every word. CUT TO: The Marines have formed a circle, cheering as Taylor and Ingrid tear up the dance floor.   Ingrid lets herself go, her body erupting into a series of bizarre spasms.   Taylor follows Ingrid’s lead, allowing her own moves to get bigger and weirder.   They jump up and down, sweating and laughing.  I/E. PINTO’S TRUCK (MOVING) - NIGHT  Ingrid and Taylor are tearing down a desert highway, smoking cigarettes and singing along to Seal’s “KISS FROM A ROSE”. We hear HONKS off screen.   The Marines from the bar pull up alongside them in a Jeep, whistling and cat-calling. 45. TAYLOR Watch this. Taylor lifts her shirt and FLASHES the soldiers her breasts. TAYLOR (CONT’D) Spring break!   Woo! The Marines are cheering and HONKING like crazy.   Ingrid turns and lifts her shirt, taking both hands off the wheel. INGRID Spring break, bitches! Taylor looks ahead, eyes widening. TAYLOR Ingrid!   Look out! HER POV - A RABBIT is standing in the middle of th",
      "dialogue_count": 0,
      "word_count": 1294
    },
    {
      "scene_number": 8,
      "slugline": "EXT. TAYLOR’S HOUSE - DAY  Pinto’s truck rolls to a stop in front of the house.   Taylor gives Ingrid a big warm hug.   She pauses before she gets out. TAYLOR Hey, so... about last night. INGRID Oh no, don’t worry about it. TAYLOR All that stuff about Ezra -- INGRID My lips are sealed. TAYLOR Thanks.   And tell Dan sorry about the truck.   Can’t wait to meet him! Taylor exits.   Ingrid’s smile disappears as reality sets in.  I/E. PINTO’S TRUCK (MOVING) - MINUTES LATER  Ingrid pulls onto her block to see a COP CAR parked outside of Pinto’s house.   Pinto is talking anxiously to a pair of COPS, gesticulating wildly and chain-vaping his e-cig. Pinto sees his truck and a look of angry relief washes over him.   He runs over as Ingrid pulls up in front of the house. DAN PINTO Ingrid!   Where the fuck were you?! INGRID I’m so sorry.   I can explain. Ingrid parks the car and jumps out.   Pinto turns to the cops. DAN PINTO Sorry, fellas.   False alarm. The cops shake their heads and walk back to their car.   Pinto sticks his head inside the truck, sniffing the air. DAN PINTO (CONT’D) Were you smoking in here?   I specifically said “No Smoking”! INGRID My friend might have had, like, one cigarette -- 50.",
      "characters": [],
      "action_text": "DAN PINTO Your   friend ...?! INGRID My friend Taylor.   I told you she was coming with me. DAN PINTO No.   You didn’t. Ingrid nervously watches Pinto make his way around the truck. INGRID So... how was the table read? DAN PINTO Cancelled, obviously. Pinto sees the damage and freezes, lowering his vape pen in shock.   Ingrid tries to remain upbeat. INGRID You can buff that right out. (no response) It was an honest mistake. (more silence) Don’t worry, I’ll pay for it. Pinto leans against the truck with his head down, fighting back tears.   He bites his lip, trying to remain gangster. DAN PINTO Anything else I should know about? INGRID Well... we may have found something in the glove box -- DAN PINTO Are you fucking kidding me?! INGRID One thing led to another -- DAN PINTO You stole my coke too?! The cops, still idling in their car, both look up at Pinto. DAN PINTO (CONT’D) Thanks again, officers! Pinto angles Ingrid away, leading her back to the house. 51. DAN PINTO (CONT’D) I don’t know what to say to you right now, Ingrid.   I trusted you. INGRID I said I was sorry! Pinto looks away, shaking his head. DAN PINTO I thought you were Catwoman.   Turns out you were Two-Face all along. Pinto storms back to his house, SLAMMING the door behind him. Ingrid stands there, feeling guilty.   DING!   She looks down at her phone.   A new notification:  “@welltaylored has tagged a photo of you.”  Ingrid opens her Instagram excitedly. ON THE SCREEN - A PHOTO of her and Taylor standing under the Roy’s Motel & Cafe sign, looking like best friends. TAYLOR (V.O .) Feet on the ground, head in the sky.   Twin Ladies Emoji.  ECU: The photo already has 2,487 ‘Likes’ while the COMMENTS section is littered with phrases like   “Great shot! ” and  “beauties ” and   “#squadgoals ” and   “Inspiring!! ” CLOSE on Ingrid as an elated smile spreads across her face. INGRID (V.O.) Dear Erin. MUSIC CUE:   MOZART’S “EXSULTATE, JUBILATE, K.165”  INT. GUEST HOUSE - DAY  QUICK SHOTS of Ingrid printing out ",
      "dialogue_count": 0,
      "word_count": 602
    },
    {
      "scene_number": 9,
      "slugline": "EXT. VENICE BEACH - MORNING  Ingrid is wearing a brand-new halterneck swimsuit, straw hat and sunglasses, reading Norman Mailer’s   The Deer Park . INGRID (V.O.) Well, I decided to take your advice and give myself a fresh start in beautiful, sunny Los Angeles. Her phone BUZZES.   She lifts her sunglasses, squinting at it. ON THE SCREEN - A text from Taylor reads:   “Gallery opening tonight.   Wanna come?”   Ingrid replies with a Thumbs Up   emoji.  EXT. ART GALLERY - NIGHT  Through the front window, we see Taylor and Ezra introducing Ingrid to a bunch of hip L.A. people. INGRID (V.O.) L.A. is the best.   I found an amazing house right by the beach and I can’t believe how nice and cool everyone is.  INT. CAFE GRATITUDE - DAY  Ingrid is having brunch with Taylor and a group of her girlfriends.   Ingrid cracks a joke about their waiter and everyone laughs.   She smiles, feeling a little boost. INGRID (V.O.) I’m making a ton of new friends.  INT. GENERAL STORE - DAY  Taylor leads Ingrid through the store, helping her pick out stuff for her apartment.   She hands Ingrid a ceramic pendant lamp, gushing over how amazing it is.   Ingrid waits until Taylor walks away then peeks at the price tag: $1,350. INGRID (V.O.) My friend Taylor’s been helping me explore my creative side, a part of myself I never knew existed. 53.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 231
    },
    {
      "scene_number": 10,
      "slugline": "INT. GUEST HOUSE - DAY  The ceramic pendant lamp now hangs from the ceiling.   The apartment has been transformed into a miniature version of Taylor’s house, with Ezra’s “SQUAD GOALS” painting hanging prominently on the wall amidst books and hanging plants. Ingrid holds up her phone, snapping a photo of her space. INGRID (V.O.) Lately, I’ve been getting really into photography. IN QUICK CUTS we see Ingrid add a filter to the photo, post it to Instagram, and watch as it starts racking up ‘Likes’. INGRID (V.O.) You should follow me on Instagram. I have almost a thousand followers and I’m adding new ones every day.  EXT. PINTO’S HOUSE - DAY  Ingrid walks up to the front porch, leaving an envelope labeled “INGRID RENT” on the door mat. INGRID (V.O.) I have a boyfriend now too.   His name is Dan and he’s an absurdly talented screenwriter. Ingrid walks away, glancing back over her shoulder. HER POV - Pinto is spying on her from a second-floor window. He quickly disappears behind the curtain. INGRID (V.O.) He’s writing the new Batman movie. How cool is that?  INT. GUEST HOUSE - DAY  Ingrid unzips the L.L. Bean backpack.   There is noticeably less cash than before.   Ingrid frowns and quickly zips it back up, trying not to think about it. INGRID (V.O.) Turns out you were right.   All it took was some money and I finally have the life I always wanted. 54.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 240
    },
    {
      "scene_number": 11,
      "slugline": "EXT. VENICE STREET - DAY  ECU: A letter with no return address drops into a mailbox. INGRID (V.O.) With love, always... Ingrid. Ingrid pedals away on her bike, wearing a light-colored sundress, a bottle of rosé in her front basket.   We hear LOUD ROCK MUSIC blasting from an approaching car as -- A red Mustang convertible blows through the stop sign just as Ingrid is crossing the intersection.   She swerves, crashing into a row of trash cans and flipping over the handlebars. Ingrid sits up just in time to see the driver, a DUDE in a backwards “ Make America Great Again ” hat, speeding away. INGRID Fucking asshole!  EXT. TAYLOR’S HOUSE - LATER  Ingrid walks up, flustered, her dress covered in dirt.   She pauses, noticing the RED MUSTANG parked in the driveway.  EXT. BACKYARD - TAYLOR’S HOUSE - MOMENTS LATER  Ingrid enters to see Taylor laying out food on a small table surrounded by floor pillows.   Ezra is crouched in the corner, flipping through a crate of LPs.   Taylor looks up, concerned. TAYLOR What happened to you? INGRID Some idiot ran a stop sign and almost killed me. (re: Mustang) Whose car is that in the driveway? The screen door slams O.S.   Ingrid turns to see the DUDE in the Trump hat (NICKY SLOANE, 29) emerge from the house wearing Chubbies shorts and a Patagonia fleece, drinking milk from the carton.   Ingrid freezes, instantly recognizing him. NICKY God I love L.A.   I just saw two homeless chicks on the street duking it out bumfight-style. Nicky notices Ingrid and stares at her, confused. 55.",
      "characters": [],
      "action_text": "NICKY (CONT’D) Who are you? TAYLOR Nicky, this is Ingrid.   Ingrid, this is my brother Nicky.   He flew in from Paris this morning without telling us. Nicky nods at Ingrid indifferently. NICKY ‘Sup. Ingrid flashes Nicky a tight-lipped smile. INGRID So nice to meet you.   How long are you in town for? NICKY (shrugs) Haven’t decided yet.   I figure at least a few weeks. EZRA (looking up, alarmed) A few weeks? Taylor smiles, hugging Nicky and leaning on his shoulder. TAYLOR Best surprise ever. CUT TO: Brunch is underway.   Nicky is dominating the conversation, chain-smoking and drinking La Croix.   Taylor is hanging on his every word while Ezra feigns interest.   Ingrid glares at Nicky, eyes filled with contempt for this unwelcome intruder. NICKY -- so I’m in the Ritz lobby minding my own business, when I happen to strike up a conversation with this Chinese billionaire named Bruno. TAYLOR (to Ingrid) Nicky and I took Mandarin in college. Nicky says something to Taylor in Mandarin that makes her CRACK UP.   Ezra and Ingrid both watch, feeling excluded. 56. NICKY Anyway, next thing I know, we’re at some random wedding with our shirts off, having a push-up contest.   I’m winning, obviously, when all of a sudden the groom’s dad grabs us from behind and jacks us up by our throats like he’s Darth Vader or some shit.   So I decide it’s a good idea to take a swing at him -- EZRA You were sober during all this? NICKY (raises his right hand) Scout’s honor.   Of course the cops show up and everyone scatters.   I end up hitching a ride to the airport only to realize I left my credit card at the hotel.   So there I am, stranded at De Gaulle with my dick in my hand, when who do I see? Nicky pulls his eyes into two slits. NICKY (CONT’D) Herro, Nicky! Ingrid blanches.   Taylor’s smile fades a little.   Ezra looks like he’s had enough, standing up. EZRA Great story, Nicky.   If anyone needs me, I’ll be in my studio. Ezra walks into the garage, the door slamming behind him. Nicky rolls ",
      "dialogue_count": 0,
      "word_count": 6977
    },
    {
      "scene_number": 12,
      "slugline": "EXT. VENICE STREET - NIGHT  Ingrid rides her bike home, looking spun out.   She pauses at a stoplight and stares up at a billboard. HER POV - A battered woman’s face with the caption , “IF YOU CAN SEE IT, YOU CAN CHANGE IT.   DON’T TURN A BLIND EYE.”  She hears laughter nearby, noticing a group of TEENAGE BOYS smoking weed at a playground across the street.  EXT. PLAYGROUND - NIGHT  The boys all look up, whispering as Ingrid approaches. FAT BOY Can we help you? INGRID I’ll give one of you two hundred bucks to punch me in the face. Silence, then... the boys burst out laughing. FAT BOY Yo, get the fuck outta here! Ingrid pulls out two hundred in cash.   The boys get quiet. INGRID If you pussies can’t handle it I’ll find someone else. The boys all shake their heads, muttering to themselves. Ingrid is about to leave when one the boys steps forward. TALL BOY Fuck it.   I’ll do it. The other boys start shouting and covering their mouths. OTHER BOYS Oh shit!   Hell yeah! INGRID (to Tall Boy) You ready? TALL BOY Let me see that money first. Ingrid hands him two hundred dollars.   One of the other boys starts filming the whole thing with his cell phone. 93.",
      "characters": [],
      "action_text": "INGRID Hit me as hard as you can.   Right in the face. The Tall Boy readies himself, having second thoughts. TALL BOY You sure about this? Ingrid nods, closing her eyes.   The Tall Boy winds up and PUNCHES HER RIGHT IN THE FACE... Ingrid doubles over, clutching her face and moaning.   The Tall Boy feels guilty.   He puts his arm on Ingrid’s back. TALL BOY (CONT’D) You okay? Ingrid nods.   She stands, revealing her face.   It’s bright red and she has a cut on her nose that is bleeding profusely. OTHER BOYS Oh shit!   Damn!   You got fucked up! Ingrid gets in the Tall Boy’s face, egging him on. INGRID That all you got, bitch? TALL BOY (backing away) Yo, let’s get the fuck out of here. The boys look disturbed, turning and sprinting away. PRE-LAP:   A fist pounding urgently on a door.  EXT. PINTO’S HOUSE - LATE NIGHT  Pinto opens his door, rubbing the sleep out of his eyes. DAN PINTO Ingrid?   It’s four in the morning-- His expression falls when he sees Ingrid, now sporting a prominent shiner under her left eye and crying profusely.  INT. PINTO’S HOUSE - NIGHT  Ingrid is on the couch, wrapped in a blanket and sipping a Monster Energy Drink while Pinto paces back and forth. 94. INGRID -- when I got home, I turned on the lights and Nicky was there waiting for me.   He seemed drunk or on drugs or something.   I asked him for my phone back but he wouldn’t give it to me.   He said he wanted fifty thousand dollars. DAN PINTO Are you fucking serious right now?! INGRID I told him I didn’t have that kind of cash, but he didn’t believe me. He said you told him about the money my mom left me. (hurt) Is that true? Pinto is speechless. DAN PINTO I mean... I don’t know!   We were so fucked up!   I may have mentioned it at some point -- INGRID Dan!   Why would you do that?!   I told you how dangerous he was! DAN PINTO Fuck it.   I’m calling the cops. Pinto reaches for his phone but Ingrid stops him. INGRID No!   He said he’d kill me if I told anyone.   Please.   You don’t know what he",
      "dialogue_count": 0,
      "word_count": 3101
    },
    {
      "scene_number": 13,
      "slugline": "EXT. 22 FLAMINGO LANE - MORNING  The door opens.   Ingrid steps outside and freezes. HER POV - Pinto’s truck has been keyed with various curse words and derogatory terms for the female anatomy. Ingrid turns, looking back at the house. A WIDER ANGLE reveals the word s “EAT SHIT AND DIE”   have also been spray-painted across the entire front of the house in the same font that Ezra used in his artwork. MUSIC CUE:   THE LOUVIN BROTHERS “SATAN IS REAL”  INT. 22 FLAMINGO LANE - DAY  We TRACK through the living room, revealing the place is a Grey Gardens-style mess.   The house is falling apart and there are clothes and fast food wrappers strewn around. Dirty dishes are piled in the sink and swarming with flies. REVEAL Ingrid sitting on the toilet, talking on the phone. She has no make-up on, her hair is a mess and she’s wearing a designer dress covered in food stains. INGRID I sent you a check two weeks ago. CUSTOMER SERVICE AGENT (V.O.) Unfortunately, your account is still showing as past due. INGRID Look, just give me one more week. CUSTOMER SERVICE AGENT (V.O.) Ma’am, this is simply a courtesy call.   If you don’t pay your bill in the next twenty-four hours we’re going to have to shut off your electricity.   Now, we do offer a payment plan for customers experiencing financial hardship -- Ingrid hangs up the phone. INGRID Asshole. She reaches for the toilet paper but the roll is empty.   She sighs, looking around for something she can use. 108.",
      "characters": [],
      "action_text": "HER POV - Her vintage copy of Joan Didion’s   The White Album  is sitting on the floor. CUT TO: Ingrid plunges the toilet, angrily.   The book lies open on the floor, a handful of pages torn out.  INT. CONVENIENCE STORE - DAY  Ingrid is at the register.   A teenage CASHIER rings her up. CASHIER Fourteen eighty-six. Ingrid empties her pockets, dumping a handful of crumpled up bills and coins on the counter.   The cashier watches as she sifts through.   It’s clear that she does not have enough. CASHIER (CONT’D) Maybe we can take something off? Ingrid looks at her items.   A six-pack of Corona and a big thing of toilet paper.  I/E. PINTO’S TRUCK (MOVING) - DAY  Ingrid is driving up to her house when she notices a rental car parked out front.   As she pulls into the driveway, she sees Erin and Keith are standing in front of the house with the word s “EAT SHIT AND DIE ” hanging above them.  EXT. 22 FLAMINGO LANE - DAY  Ingrid gets out of the truck with her grocery bag, confused. INGRID What are you guys doing here? ERIN We hadn’t heard from you.   We just wanted to make sure you were okay. INGRID Didn’t you get my letter? ERIN Yeah, but you haven’t responded to any of our calls or emails. 109. INGRID Things have been pretty crazy. (quick beat) How did you find me? KEITH Your name popped up on a police database after you bought this place. (re: plastic bag) What you got there, Ingrid? INGRID Just some groceries. CLOSE on the plastic bag which contains a six-pack of Corona and nothing else.   Ingrid looks uncomfortable. INGRID (CONT’D) Come on in.   I’ll give you the tour. Ingrid heads inside.   Keith and Erin exchange a look.  INT. 22 FLAMINGO LANE - DAY  Ingrid unpacks her “groceries” while Erin and Keith take a look around, reacting to the squalor. INGRID Sorry about the mess.   I’ve been doing all the renovations myself. (pause) Can I get you guys anything? KEITH I’d love a water. INGRID My water’s on the fritz right now. How ‘bout a Corona instead? Ingrid pops the top",
      "dialogue_count": 0,
      "word_count": 2523
    }
  ]
}