{
  "slug": "inherent-vice-2014",
  "title": "inherent vice",
  "genre": "drama",
  "format": "film",
  "scenes_count": 5,
  "characters_count": 2,
  "characters": [
    "BIGFOOT",
    "CROCKER FENWAY"
  ],
  "total_words": 10607,
  "total_dialogue": 2,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. DOC'S OFFICE - LATER 70   70 DOC is making them some coffee.   CLANCY is sitting by TARIQ, encouraging his sharing with Doc... PETUNIA here, too. TARIQ Alright... When I came here first time, I should've told you the whole thing.   Too late now, but I still could've trusted you more... DOC Tell me what? CLANCY (to Tariq) You need to tell him the whole thing... TARIQ Glenn didn't owe me money... DOC ... What did he owe you? TARIQ Guns.   For my people at WAMBAM. Small arms... and some bazookas. DOC I can dig why you didn't want to get too specific... WAMBAM being? TARIQ Warriors Against The Man Black Armed Militia.   Glen said he had friends who could score us guns and we're still waiting for our shipment as the revolution rolls on... DOC And who were these ‘friends’ of Glen's that were arranging the arms deal? TARIQ Some bunch of honky dentists out on lower Sunset.   Worked out of some weird-ass building look like a big tooth. DOC Uh-huh.   Well.   Maybe I can think of one or two places to look. CUT TO:  74.",
      "characters": [
        "BIGFOOT"
      ],
      "action_text": "OMITTED 71   71 INT. PLASTIC NICKEL DINER - NIGHT 72   72 He's out to a dinner with Clancy and Tariq, who are both in the bathroom.   THOMAS JEFFERSON's face is on a NICKEL emblem all over this restaurant.   THOMAS JEFFERSON appears, sitting in a booth next to DOC, drinking coffee, says: DOC (You look familiar -- are you the guy on the nickel?) THOMAS JEFFERSON Thomas Jefferson.   So.   Guns and Opium.   The Golden Fang not only traffic in enslavement, they peddle the implements of liberation as well. DOC Yeah... but as a founding father, don't you get freaked out a little with this revolution talk? THOMAS JEFFERSON The tree of liberty must be refreshed from time to time with the blood of patriots and tyrants. It is its natural manure. DOC Yeah, and what about when the patriots and tyrants turn out to be the same people? THOMAS JEFFERSON As long as they bleed is the thing. Doc deep in thought... THOMAS JEFFERSON A nickel for your thoughts... DOC Glen Charlock...   If Glen was tight with the Golden Fang, could they be the ones who took him out?   Is he just another Rudy Blatnoyd, DDS who touched some acupressure point on the mysterious body of the Golden Fang so uncomfortably he had to be dealt with?  75. THOMAS JEFFERSON  Nobody   trusted Glen -- the Aryan Brotherhood had him shitlisted as a traitor to his race, the Vigilant California was more than eager to help -- and the raid on Channel View Estates was a cover for the hit on Glen -- DOC And so Mickey Wolfmann...? THOMAS JEFFERSON Mickey was a witness -- he walked in on something he shouldn't have the V.C. commandoes hustled him off -- Then the Feds found out, here's an acid-head billionaire ready to give away all his money -- and of course, they had their own ideas on how to spend it.   As long time associates of the Golden Fang by way of scag-related activities, they got Mickey programmed into Ojai for a little brain work -- DOC Wait, wait, wait -- how do you know all this? THOMAS JEFFERSON I'm on the nickel.  ",
      "dialogue_count": 1,
      "word_count": 2132
    },
    {
      "scene_number": 2,
      "slugline": "EXT. CHRYSKYLDON - DAY C77   C77 Arrival and greeting, handshakes outside... CUT TO: INT. DINING ROOM - DAY 77   77 Doc walking through with DR. THREEPLY and staff... DR. THREEPLY This is our Administrative Lounge... Our Chenin Blanc comes from the   Institute's own vineyard... Hand's steady as a rock today, Kimberly? KIMBERLY So happy you noticed, Dr. Threeply... more soup, Dr. Igor? DR. IGOR Thank you, Kimberly. INT. OTHER AREA - DAY 78   78 Tour continues... picture of Sloane Wolfmann... sign under construction that partially reads, \"Made Possible Through The Selfless Generosity Of A Devoted Friend Of Chryskylodon.\" DOC What's in here? DR. THREEPLY A brand new wing for housing our Noncompliant Cases Unit... Doc sees a bunch of kids cleaning the place... etc... Photo of Sloane, etc... SORTILEGE (V.O.) Doc was visited by the creepy feeling that somewhere close by, in some weird indeterminate space whose residents weren't sure where they were, inside or out of the frame, might indeed be some version of Mickey, not quite in the same   way that the lady with the big check was a version of Sloane, but altered and -- he shivered -- maybe mentally or even physically compromised.   If Sloane was endowing looney bins with Mickey's money, why not take some credit?   Why be anonymous?  85.",
      "characters": [],
      "action_text": "DOC Nice. DR. THREEPLY Come, let's continue... INT. MOVIE THEATER - LOBBY/HALLWAY - DAY A79   A79 Walking the hallway -- TWO VERSIONS -- with dialogue and without. STAFF ASSISTANT Have you been with us here before, Mr. Sportello?   I know I've seen your face... DOC First time I've been down here... normally I don't get much south of South City. DR. THREEPLY And   ab -normally? DOC What? DR. THREEPLY I only meant that with any number of qualified facilities in the Bay Area, why bother coming all the way down here to us? DOC I believe that just as chakras can be identified on the human body, so does the body Earth have these special places, concentrations of spiritual energy, grace, if you will, and that Ojai, for the presence of Mr. J. Krishnamurti alone, certainly qualifies as one of the more blessed of planetary chakras, which regrettably cannot be said for San Francisco or its immediate vicinity... Burke Stodger? DR. THREEPLY Part of our Burke Stodger marathon.   All Burke, all day.   24 hours of Stodger.   It's quite popular with our patients... Doc and the tour poke their heads in... BURKE STODGER on the screen... Doc watches all the kids watching Burke Stodger... CUT TO:  86.",
      "dialogue_count": 0,
      "word_count": 422
    },
    {
      "scene_number": 3,
      "slugline": "INT. STEAM TUNNEL - DAY 79   79 Doc and tour continue... DR. THREEPLY Come... see our Advanced Therapy Group... Doc advances, sees a bunch of chanters in white robes... ... THE SOFT SOUND OF DISTANT CHANTING.   A group of six or so in flowing robes/hoods... Doc looks a little closer -- one of them is Coy Harlingen... A BIG ORDERLY is sitting in a nearby chair.   He's rolling his TIE up under his chin, holding it there, then lifting his chin and letting the tie fall back down..... DOC'S POV THE TIE unrolls, revealing HAND PAINTED NAKED SHASTA WITH HER ASS STUCK OUT.   Straight from Mickey's Tie Collection.   The orderly rolls the tie back up to his chin... Doc's POV TILTS UP FROM the tie to see the SWASTIKA ON TOP OF THE ORDERLY'S HEAD... is this Puck Beaverton???? BACK TO SCENE DR. THREEPLY Any questions? DOC Does that man have a swastika on his head? DR. THREEPLY No, he doesn't.   That's an ancient Hindu symbol meaning ‘all is well.’   It brings good fortune, luck and well-being, what do you mean? DOC Only that it looks like a swastika to me... DR. THREEPLY He isn't a regular employee of the Institute, perhaps you should pay no attention to that man... DOC Ah-huh.  87.",
      "characters": [],
      "action_text": "A MOMENT OF EYE CONTACT between ORDERLY/PUCK and DOC... CUT TO: INT. LOBBY 80   80 Doc continues on tour... DR. THREEPLY Next, we'll see the Institute's own Zen garden imported from Kyoto.   Each pebble, each grain of white sand was transported and reassembled here exactly in place... A STAFF ASSOCIATE RUNS UP. STAFF ASSOCIATE Doctor -- there's a problem with the volt generator in the Dungeon... (ALTERNATE) Doctor, there's a broken volt generator in the Dungeon... (ALTERNATE) Doctor -- the electroshock machine is acting fussy again... DR. THREEPLY Excuse me, Mr. Sportello... He leaves.   Doc goes snooping... INT. HALLWAY - DAY 81   81 Kids cleaning hallways... Doc walks down... O.S. voice \"pssssssst.\"   He goes into a -- ROOM Coy is there... COY Thinking of checking yourself in? DOC More like lookin' for a way to get outta here.   Couldn't afford it. I thought you were supposed to be clean these days -- what are you doing here? COY Bi-monthly checkup.  88. DOC Why can't you just leave, Coy? COY It's part of the job, it's part of being dead... DOC You can't go back to your family, because if you did...? COY It would be my ass.   I've told you. DOC Or maybe you’re as addicted to this as you were some other things... COY This is a higher discipline. They saw something in me I didn't know I had. DOC You're a snitch, man. COY I have a gift for projecting alternate personalities -- DOC A spy and a weasel -- COY I have an addictive personality. DOC You're a stool pigeon, what about your girls, then?   What about THAT? COY Why are you mad at me? DOC I'm not mad at you... COY What else was I gonna do?   The baby was gonna die -- DOC -- you made a choice, Coy -- COY I made the only one I had, man -- doesn't everybody wish they had a different life?  89. DOC I'm not mad at you, Coy, I'm just -- what the fuck? With that, COY is gone again... DOC hears CHANTING AGAIN... Something draws Doc to the window... he sees:   PUCK BEAVERTON... leading the group of CHANTERS IN ROBES... SO",
      "dialogue_count": 0,
      "word_count": 3227
    },
    {
      "scene_number": 4,
      "slugline": "EXT. WASTE A PERP SHOOTING RANGE - DAY (OR INT. PHONE 94   94 CALL) Doc comes to see Bigfoot who's in the Chicano/Negro/Hippie section. BIGFOOT Mrs. Bjornsen sends her regards. DOC Can I say something out loud, is anybody listening? BIGFOOT Everybody.   Nobody.   Does it matter? DOC Alright, then:   Correct me if I'm mistaken, Bigfoot, but it's clear to me that you're desperate to have a word with Adrian Prussia but can't let on, because otherwise you're in deep shit with powers unnamed -- so you're using me instead -- have I got that more or less right? BIGFOOT We're in sensitive territory here, Sportello. DOC Well, somebody's gonna have to be less sensitive for a minute and just wipe off their chin and stand up and   deal   with it.   If there's something you need, just come on out and say it, how hard can that be? BIGFOOT Pretty hard.   Internal Affairs has it all locked down. DOC Internal Affairs, what does Internal   Affairs have to do with this? BIGFOOT Figure it out.   Use what's left of your brain.   The trouble with you people is that you never know when somebody's doing you a favor -- you think you're entitled because you're cute or something.   Go look in the mirror sometime.  104. (MORE)",
      "characters": [],
      "action_text": "‘Dig’ yourself, ‘man,’ till you understand nobody owes you anything.   Then get back to me. CUT TO: INT. HALL OF JUSTICE - DAY 95   95 DOC comes into see current girlfriend:   PENNY KIMBALL. Her cubicle mate is a straight-looking DA RHUS FROTHINGHAM. RHUS Are you all right?   Should I call security? PENNY (to Doc) Am I? DOC Only wondering when you'd be free for dinner.   Didn't mean to freak you out.   I'll even spring for it. PENNY I'm fine, Rhus, thank you. (as he leaves) Listen, would you mind if we just went back to my place? DOC Wait... what? PENNY And we can pick up a pizza on the way. DOC A pizza? PENNY I can hear you getting a hard-on. DOC Well, okay, I'll see you back at your place -- no, no, no, wait a minute, I came here for a reason -- PENNY What is it? DOC I need to look at somebody's jacket.   Ancient history, but it's probably under lock and key...  105. BIGFOOT   (CONT'D) PENNY That's it?   No big deal, we do that all the time. DOC What, break into officially sealed records?   And here I had all this faith in the system. PENNY Oh, Doc.   Grow up.   What's the name? DOC Adrian Prussia. PENNY Ewwwwwwww.   Really?... that'd be an Internal Affairs file. DOC Internal Affairs?   What does Internal Affairs have to do with this? PENNY Adrian Prussia has been booked on murder one charges more times than I can remember... and each time, he's walked... DOC So what are   you   guys doing wrong? PENNY Last time was called a justifiable homicide of one of the LAPD's very own... DOC Who? PENNY Your friend’s partner... DOC What's that?   Which friend?   Hang on. PENNY Bigfoot. DOC What what now? PENNY Adrian's like the LAPD'S own personal hitman, doing deeds for them that they won't do themselves...  106. DOC And you know all this because...? PENNY Everyone does.   State Attorney General's office has been after him for years but nobody can touch him, partly because of this interesting portfolio of IOUs he has -- and that's always enough to guarantee obedience. DOC O",
      "dialogue_count": 0,
      "word_count": 2703
    },
    {
      "scene_number": 5,
      "slugline": "INT. DENIS' APARTMENT - NIGHT 105   105 Doc has put the heroin into an CARDBOARD TV BOX.   Denis is here with Jade... they hide it in Denis' apartment. DENIS What is it? JADE A new TV!!!! CUT TO: INT. DOC'S PLACE - MORNING 106   106 It's the next morning.   DOC is sitting on his couch. He's waiting for the phone to ring, drinking coffee. TV playing something... JOHN GARFIELD,   He Ran All The Way.   THE PHONE RINGS. DOC Hello? MALE It's sure been a long time... DOC And your name was... MALE This is Crocker Fenway. DOC Japonica's dad?   Japonica's gone missing again? CROCKER FENWAY (V.O.) You have something that belongs to some people I represent and they'd like it back... DOC So not that it's any of my business, but you're a principal in all this? CROCKER FENWAY (V.O.) It's only because of me and our small transaction over Japonica that you're still alive... DOC Ever so grateful, sir... so what do we do?   I'd come to your house, but don't you live behind a gate in an already gated community?  118.",
      "characters": [
        "CROCKER FENWAY"
      ],
      "action_text": "But I mean, what dentist doesn't, it's some oath they all have to take in dentist school, and anyhow that's a long way from strange and weird sex.   Isn't it? CROCKER FENWAY How about when he forced my little girl to listen to   original cast albums   of Broadway musicals while he had his way with her? DOC Japonica's legal age now, isn't she? CROCKER FENWAY In a father's eye, they're always too young. BEAT.   They look at each other. CROCKER FENWAY To the matter at hand. DOC So I suppose you want your drugs back.   And I also suppose you think I want some money -- but what if it didn't have to be in the form of money... CROCKER FENWAY Well, money would be a lot easier. DOC I've been more concerned about the safety of some people. CROCKER FENWAY ... How much of a threat are they to my principles? DOC There's a saxophone player named Coy Harlingen, who's been working undercover for different antisubversive outfits, including the LAPD.   He's come to feel lately that he made the wrong career choice.   It lost him his family and his freedom.   Like you, he has an only daughter. CROCKER FENWAY Please. DOC Okay, well, anyway, now he wants out.  120. DOC   (CONT'D) (MORE) I think I can square it with the heat, but there's this other bunch called Vigilant California and... well, whoever's running them, of course. CROCKER FENWAY My guess is that they'd prefer he didn't disclose any confidential information. DOC Last thing he'd ever do. CROCKER FENWAY Your personal guarantee. DOC I'll go after him myself he tries anything. CROCKER FENWAY That's all you wanted.   No money, now, you sure? DOC How much money would I have to take from you so I don't lose your respect? CROCKER FENWAY People like you lose all claim to respect the first time they pay anybody rent. DOC And when the first landlord decided to stiff the first renter for his security deposit, your whole fucking class lost everybody's respect. CROCKER FENWAY Ah, so you're looking for what?   A refund?   Plus how many year",
      "dialogue_count": 1,
      "word_count": 2123
    }
  ]
}