{
  "slug": "initiation-2016",
  "title": "initiation",
  "genre": "action",
  "format": "film",
  "scenes_count": 7,
  "characters_count": 0,
  "characters": [],
  "total_words": 15715,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. WOODED BACK ROAD - DAY 5   5  Up ahead, a VAN wheels out from a dirt path. It turns towards  Simon, also moving oddly fast for this road.  INT. SIMON’S CAR - DAY 6   6  Simon grips the wheel tightly. Glances in the rearview again.  That SUV is getting close.  EXT. WOODED BACK ROAD - DAY 7   7  The VAN SWERVES across the road and brakes, blocking Simon’s  path.  INT. SIMON’S CAR - DAY 8   8  Simon simply reacts, shifting into reverse.  EXT. WOODED BACK ROAD - DAY 9   9  But the SUV behind him similarly turns and blocks his  retreat.  DALE   (20s) , all wiry energy, gets out of the van and points a  gun at Simon.  MAROK (late 30s) , the tough man in charge, does the same.  INT. SIMON’S CAR - DAY 10   10  Simon sees he’s cornered and reluctantly puts his hands up.  EXT. WOODED BACK ROAD - DAY 11   11  Dale advances to the door.  DALE  Get the fuck out of the car!  Simon hesitates.  SIMON  I don’t have any money, you can  have the car.  Dale chuckles at Simon.  2.",
      "characters": [],
      "action_text": "DALE  I don’t want your piece of shit  car. Now get out!  Simon gets out.  Dale leads Simon to the back of the van, searches him and  takes his cell phone, then opens the double back door.  There are already five other guys in there, huddled at the  far end.  Dale holds his gun up to them.  DALE (CONT’D)  Stay the fuck back.  Then he turns to Simon.  DALE (CONT’D)  Get in.  Simon gives Dale a look that says “no way”.  Dale PISTOL WHIPS Simon and KICKS him in the stomach. Simon  keels over and the two assailants SHOVE him into the van and  CLOSE the door behind him.  EXT. WOODED BACK ROAD - DAY 12   12  The van and SUV take off. The entire operation has taken less  than two minutes.  INT. VAN - DAY 13   13  Simon rises up still in pain. He tries to un-hatch the back  door but it is locked from the outside. Giving up, he turns  and looks at the other men in the van. They are:  WAYNE (late 20s)   - he’s got enough tattoos and scars that  it’d be fair to assume he’s some sort of gang member or ex-  con. And you’d be right.  ERIC (late 20s)   - a squirrelly thin guy who looks like he  should be providing IT support but still makes it to the gym  a couple times a week.  ROB (late 20s)   - clean cut and dressed a bit nicer than the  rest. Seems like he’s trying to sit in a dignified way,  ridiculously.  3. SEAN (late 30s)   - a kind, timid, mild-mannered man,  incredibly scared.  DENNY (late 20s)   - the most athletic of the group. Also the  quietest.  Sean whimpers in pain to the side.  A tense beat between them. Then:  SIMON  What’s going on?  ERIC  None of us know.  WAYNE  These mother fuckers are dead.  That’s what I know.  Simon glances around the interior of the van, trying to get  any clue he can.  SIMON  How long have you been in here?  ERIC  I was the first. That was a long  time ago.  SIMON  How long?  ERIC  What time is it now?  SIMON  Around three.  ERIC  I was headed to work. That was nine  hours ago.  Simon looks towards the front. The van is built such that ",
      "dialogue_count": 0,
      "word_count": 1109
    },
    {
      "scene_number": 2,
      "slugline": "EXT. VAN - NIGHT 14   14  The van continues, day has bled into night.  INT. VAN - NIGHT 15   15  Silence. Sean’s puke slides around the floor of the van.  ROB  There must be some common factor  amongst us.  (to Eric)  What do you do for a living?  ERIC  I’m in sales. Timeshares.  WAYNE  Reason enough to kill you right  there.  ROB  I’m guessing you earn your money a  little differently.  WAYNE  Look down your nose at me again,  and I’ll break it off.  SIMON  Easy. Do you have a nine to five?  WAYNE  I work in a warehouse.  SIMON  (to Rob)  And you?  ROB  I work for my father.  Wayne looks at Rob’s clothes.  WAYNE  Is your father Bill Gates?  ROB  We’re well off, okay? But that  still doesn’t explain why they took  you all.  8.",
      "characters": [],
      "action_text": "SIMON  (To Sean)  How about you?  Sean, miserable to the side, looks up.  SEAN  I teach kids. Elementary school.  Silence.  ERIC  (to Simon)  And you?  Simon falls back to sit. A delay, then:  SIMON  I’m between jobs.  ERIC  What do your parents do?  SIMON  My mother’s dead. My father’s a  retired Marine.  ERIC  Wish he was here.  Simon doesn’t respond:  INT. CAR - DAY (FLASHBACK) 16   16  Simon sits next to an older man who is SIMON’S FATHER.  SIMON’S FATHER  You’re sure?  SIMON  Yes.  SIMON’S FATHER  You can’t do it for me, or for your  grandfather. It has to be for you  or it won’t mean anything.  SIMON  I know.  9.",
      "dialogue_count": 0,
      "word_count": 249
    },
    {
      "scene_number": 3,
      "slugline": "EXT. MARINE TRAINING GROUNDS - DAY (FLASHBACK) 17   17  A number of RECRUITS stand in front of a large tree log. One  of them is Simon.  They are across from   STAFF SERGEANT RAYNOR (40s) .  Staff Sergeant Raynor does not suffer fools. Nor does he  enjoy causing men pain. He simply does what needs to be done.  STAFF SERGEANT RAYNOR  Recruits! Today is not going to be  fun. Tomorrow is not going to be  fun. If you are somehow able to  complete your training and gain  entry into my Marine Corps, most of  the days of the remainder of your  lives will not be fun. But that’s  why we are who we are. That’s what  separates us. We have the strength  to do what other men cannot. We do.  I’m not sure if YOU do.  He looks over the faces of the men.  STAFF SERGEANT RAYNOR (CONT’D)  Our activities out here will not  end soon. There will be the bare  minimum of down time. If you injure  yourself, do not act like a big  hard sumbitch, because you surely  are not one. Inform me immediately.  Is that understood?  RECRUITS  Yes, Staff Sergeant!  STAFF SERGEANT RAYNOR  Good. Let’s get going. Hoo-ah.  RECRUITS  Hoo-ah!  Staff Sergeant Raynor gestures towards the log in front of  the recruits.  STAFF SERGEANT RAYNOR  When I say “lift” you will, as a  group, raise the log in front of  you to chest level. When I say  “press” you will raise it above  your heads.  10.  (MORE)",
      "characters": [],
      "action_text": "When I say “march” you will perform  a circular march, twenty paces to  the left, then turning ninety  degrees and repeating until you  return to your starting point. Is  that   understood?  RECRUITS  Yes, Staff Sergeant!  STAFF SERGEANT RAYNOR  Lift!  Simon and the others bend down and raise the mammoth log.  STAFF SERGEANT RAYNOR (CONT’D)  Press!  With difficulty the men manage to get the log above their  heads. Various men GRUNT and CURSE in doing so.  STAFF SERGEANT RAYNOR (CONT’D)  March!  The men slowly move to the left with the log. RECRUIT 2491  behind Simon mumbles under his breath.  RECRUIT 2491  Last time I checked Marines didn’t  spend a lot of time carrying logs.  Simon simply grimaces and keeps moving.  END FLASHBACK:  INT. VAN - NIGHT 18   18  The men sit in silence in the van.  ERIC  (to Wayne)  Are you in a gang or something?  Wayne simply glares at Eric.  ERIC (CONT’D)  I’m asking because I’m wondering if  you’ve ever heard of anything like  this.  11.  STAFF SERGEANT RAYNOR (CONT'D) WAYNE  Kidnapping a bunch of complete  strangers for no reason? No, I’ve  never heard of anything like this.  Silence again.  SEAN  They’re going to cut us up and eat  us, aren’t they? I read an article  about cannibalism in America. It  said-  SIMON  Quiet.  Sean shuts up.  SEAN  They’ll probably kill us either  way.  ERIC  If they were doing this just to  murder us why take such a long time  to do it?  WAYNE  They want to take us someplace  where they can enjoy it.  This strikes a dark chord with the group.  LATER  All the men have stopped talking and sit in silent anger.  The van abruptly STOPS.  The back doors open.  Standing there are Dale, Marok and... Denny. Denny is holding  a handgun too now.  WAYNE (CONT’D)  ...the fuck?  DALE  Out of my van, ladies.  The men slowly file out of the van. They’re in the middle of  nowhere, the end of a dirt road deep in the woods.  12. MAROK  Line up next to each other.  They do.  Denny addresses the men, now speaking with a co",
      "dialogue_count": 0,
      "word_count": 902
    },
    {
      "scene_number": 4,
      "slugline": "INT. HOUSE - NIGHT 22   22  Plebe Green and Marok carry him inside.  From what little he can see when his eyes blink open between  moments of unconsciousness, it looks fairly normal, like an  average person’s house.  INT. HOUSE - BASEMENT - NIGHT 23   23  Simon enters a bare room with brick walls and a concrete  floor.  Simon is practically thrown into a cage, where Wayne, Sean,  Rob and Eric already reside.  The door is locked behind him.  The basement itself is almost totally bare.  Marok and Plebe Green head upstairs and close the door behind  them.  Simon is shaken out of his stupor by Wayne.  WAYNE  You get your ass kicked?  Simon doesn’t respond, winces in pain as he stands up.  WAYNE (CONT’D)  How far’d you get?  SIMON  Not far enough.  Simon looks to the other men.  SIMON (CONT’D)  I saw my car, there was a few of  them.  ROB  Where?  SIMON  They’re close.  WAYNE  Could you find them again?  15.",
      "characters": [],
      "action_text": "SIMON  Where are we in relation to the  van?  WAYNE  They blindfolded us.  SIMON  Do you remember the direction you  walked?  WAYNE  Maybe.  SIMON  If I can get to where the van was I  can find our cars.  WAYNE  I’ve got a gun in my glove  compartment.  SIMON  What kind of car?  WAYNE  Black pick up.  SIMON  What do you remember about the walk  over here?  WAYNE  Straight line more or less, west  from the van. I’d say two hundred  yards or so if I had to.  They are shut up by the sound of the door to the basement  opening.  Denny enters with Marok.  Marok focuses on Simon.  MAROK  (to Simon)  I hope you learned something.  SIMON  I did, you swing like a girl.  Marok laughs.  16. MAROK  You’re going to have a fun night..  The captives are confused. Denny gestures to everyone.  DENNY  Wallets. IDs. Watches.  The men are reluctant to comply.  MAROK  That was not a yes or no question.  Give them up.  The men finally acquiesce.  ERIC  Who are you guys? Seriously? Some  sort of cult?  DENNY  Who we are is not for you to know.  SIMON  You’re nothing but a bunch of crazy  people with a house and a van.  We’re real impressed.  DENNY  You’re not important enough to  deserve impressing. The only reason  you’re not face down in a ditch  right now is that I didn’t feel  like expending the effort to catch  another one of you.  Marok meets Simon’s gaze. He almost smiles.  MAROK  You want to know who we are? In  ancient Rome they used to flood the  colosseum and reenact famous naval  battles. Hundreds would die in the  performance.  He takes a step closer.  MAROK (CONT’D)  Most people, even today, are either  dying, or watching the show...  We’re the ones who decide who goes  on the boat.  Denny collects the wallets and other personal items.  17. DENNY  Don’t worry, we’ll be back soon.  He exits with Marok.  Wayne looks at Simon.  WAYNE  They know who we are now. Even if  we could escape, they’d have a much  better chance to track us down.  Simon looks around the barren room.  SEAN",
      "dialogue_count": 0,
      "word_count": 632
    },
    {
      "scene_number": 5,
      "slugline": "INT. HOUSE - OFFICE - NIGHT 24   24  Marok sits behind an ornate desk in a well-appointed office.  Dale and Denny stand across from him.  MAROK  Let’s pair the runner with Plebe  Gold.  DALE  Serves the son of a bitch right.  Dale grins.  INT. HOUSE - CEREMONY ROOM - NIGHT 25   25  Five men are lined up side by side.  They are blindfolded.  A long table is set up in front of them. On it is a dossier,  marked Plebe Green, Plebe Gold, etc. All different colors for  each man.  Marok and Dale stand in front of the men.  MAROK  Very few men have stood where you  stand today. Few are chosen, and  even fewer pass the test. You have  a chance to do both tonight. After  this last challenge - if you  succeed - you will have crossed the  final threshold. Remember that  every one of us has gone through  what we’re asking you to go  through.  He looks over the men.  MAROK (CONT’D)  We don’t want simply the biggest  man or the strongest man. Because a  big man or a strong man can fail.  But a man of will can never truly  be defeated.  INT. HOUSE - BASEMENT - NIGHT 26   26  The men look edgy, desperate.  19.",
      "characters": [],
      "action_text": "ROB  Maybe I can bribe them.  SEAN  That’s a good idea.  WAYNE  They don’t care about money.  SIMON  How do you know?  Wayne pulls out a wad of bills from one pocket and some loose  change from the other.  WAYNE  There’s a big difference between  someone who’s hard and someone  who’s just plain crazy.  INT. HOUSE - CEREMONY ROOM - NIGHT 27   27  Marok lights a cigarette.  MAROK  Trust. Trust is a critical part of  what we do. You must trust your  fellow member as you trust  yourself.  He steps forward to   PLEBE GOLD   - who looks like he could  probably pick Marok up and eat him, so muscular and powerful  is his frame.  MAROK (CONT’D)  Plebe Gold. Do you trust me?  PLEBE GOLD  Yes, sir.  MAROK  Hold out your hand.  Plebe Gold does.  MAROK (CONT’D)  Do not make a sound. 28   28  Marok extinguishes the cigarette in Plebe Gold’s hand, he  winces in pain but doesn’t cry out.  Marok holds court in front of the recruits.  20. MAROK (CONT’D)  Remove your blindfolds.  The men do. In front of each of them is a small black  notebook laying on top of a manila folder. The books have an  emblem engraved as well as a COLOR, respectively of the five  Plebes.  MAROK (CONT’D)  Before each of you, you will find  your Member’s Code. This book  defines what it means to be a  brother in this organization. On  the back page, you will find your  funded membership benefit card,  which will become active as of the  end of your initiation, if you pass  your final test.  The men flip through the notebook, see the BLACK card on the  back.  MAROK (CONT’D)  Now, open the folder in front of  you.  All the men flip open the folders on the table in front of  them. In it are photos of the captives (a variety of photos,  the kind you might find on Facebook) along with copies of  their driver licenses.  The sound of someone screaming is heard.  ROB (O.S.)  Guard!  The cry is barely audible in the room.  Marok smolders.  He turns to Dale and gestures for him to go.  IN THE BACK  Two Plebes, PLEBE SILV",
      "dialogue_count": 0,
      "word_count": 5987
    },
    {
      "scene_number": 6,
      "slugline": "INT. HOUSE - OFFICE - NIGHT 55   55  Marok and Plebe Red walk in.  MAROK  How you feeling?  PLEBE RED  Kinda like I just got fucking shot.  MAROK  Do you think you can fight?  PLEBE RED  Are you kidding? Screw that! I’ll  wait till’ next year.  MAROK  It’s not that simple actually,  everybody is given one attempt at  the final challenge... it’s an  unfair situation, I know.  PLEBE RED  I can’t fight.  MAROK  That guy you’re against is nothing,  I doubt he’s ever been in a real  fight. I have some pain pills  they’ll help you...  PLEBE RED  Are you listening? I’m not doing  it! If that means I can’t get  initiated then so be it!  MAROK  Here’s the thing, you swore by the  code to accept your final  challenge.  PLEBE RED  So what!?  MAROK  So it means you have to go through  with it.  PLEBE RED  And if I don’t? You gonna kill me?  53.",
      "characters": [],
      "action_text": "MAROK  This is how it works, the rules are  not suggestions, that’s how it’s  always been... If you don’t do this  I can’t protect you.  Plebe Red is panicky now.  PLEBE RED  So, so... So, you just let me  leave, you can say you don’t know  where I went.  MAROK  I can’t do that.  PLEBE RED  This is insane! I can barely lift  my arm, there’s no way I can fight!  Marok opens a drawer in the desk and pulls a pill bottle out.  PLEBE RED (CONT’D)  Look at me. I’m your brother. Your  actual brother, does that not mean  anything to you?  MAROK  This is bigger than you and me. You  need to accept that this is  happening and focus on getting  yourself through it. I’m sorry.  Marok hands Plebe Red the bottle of pills.  INT. HOUSE - BASEMENT - NIGHT 56   56  The Plebes and recruiters descend. Plebe Red wears a shirt  that covers his bandaging.  He takes his position in the center of the fight circle.  IN THE CAGE  Simon smiles.  SIMON  They really are crazy.  He nudges Wayne.  SIMON (CONT’D)  That’s the one I shot.  54. WAYNE  Which shoulder.  SIMON  Left.  WAYNE  Good.  Dale approaches the cage.  DALE  (to Eric)  Let’s go, twiggy.  Eric, hanging back, looks up as if to say, “Who, me?”.  He looks from Dale to Simon and Wayne.  WAYNE  Bury that motherfucker.  Eric reluctantly exits the cage.  IN THE RING  Eric steps in. Marok officiates as before.  MAROK  Fight!  Plebe Red approaches, clearly favoring his right arm.  Eric raises his fists, with the awkward stance of someone who  has never fought before.  Plebe Red takes a swing with his right, but when he does his  left hand sags, leaving him vulnerable to a counter-punch.  IN THE CAGE  Simon focuses on that shoulder.  SIMON  Left shoulder, Eric!  IN THE RING  Eric dodges the blows, but misses the opening to counter.  Plebe Red becomes more aggressive, getting closer and  throwing multiple punches.  55. Eric takes a nasty shot on the chin and reels, but keeps his  feet.  He manages to get a punch in...  ...right to Plebe Red’s ",
      "dialogue_count": 0,
      "word_count": 5468
    },
    {
      "scene_number": 7,
      "slugline": "INT. HOUSE - BASEMENT - NIGHT 83   83  Simon RIPS the knife out from his own side and grips it.  Simon attacks.  Marok parries and dodges a series of knife thrusts from  Simon.  Marok intercepts Simon’s swinging arm and bashes the elbow  backwards with his knee. The knife falls to the ground.  Simon YELPS in pain but recovers.  EXT. MARINE TRAINING GROUNDS - WOODED PATH - NIGHT 84   84  (FLASHBACK)  Simon limps ahead through the woods with the other recruits.  STAFF SERGEANT RAYNOR  Only twelve miles to go. This is  like a god-damn pleasure stroll!  Up ahead a recruit simply drops.  Staff Sergeant Raynor approaches him.  It’s Recruit 1318.  STAFF SERGEANT RAYNOR (CONT’D)  Stand up, recruit.  Recruit 1318 just keeps shaking his head, no words come out.  Simon is barely able to muster the energy to look.  END FLASHBACK:  INT. HOUSE - BASEMENT - NIGHT 85   85  Marok keeps hammering Simon.  Simon fights back as best he can, but the combined toll of  his fight with Plebe Gold and now the stab wound is taking  its effect.  Marok nails Simon with a gut shot with his fist, doubling him  over.  MAROK  Where are your jokes now?  83.",
      "characters": [],
      "action_text": "Marok CLOCKS Simon, knocking him down.  SIMON  Says the man who brought a knife to  a fistfight.  Marok straddles him.  MAROK  We’re having a fistfight now.  He PUNCHES Simon.  MAROK (CONT’D)  How’s it going for you?  And AGAIN.  MAROK (CONT’D)  I’d say not great.  He raises Simon’s limp face with one hand gripping his hair  and gives a final PUNCH.  Simon is catatonic on the floor.  EXT. MARINE TRAINING GROUNDS - WOODED PATH - NIGHT 86   86  (FLASHBACK)  Simon keeps marching.  Behind him on the path, Recruit 1318 unloads his pack and  watches with shame. He’s quit.  Simon continues.  But his steps slowly decline in speed.  It’s pitiful to watch. He struggles to put one foot in front  of the other.  He leans forward, willing his body to continue, trying to use  the weight of the pack to his advantage.  But it just makes him fall.  He sprawls out on the ground.  Does not get up.  STAFF SERGEANT RAYNOR (O.S.)  Look at me.  84. Simon rolls over awkwardly, the pack impeding him.  Staff Sergeant Raynor stands above him. He might as well be  one hundred feet tall.  STAFF SERGEANT RAYNOR (CONT’D)  You need to stand up.  Simon labors to speak.  SIMON  I... I...  Staff Sergeant Raynor offers Simon his hand, but Simon  doesn’t take it.  STAFF SERGEANT RAYNOR  What do you want to do? Who do you  want to be?  Simon doesn’t answer.  STAFF SERGEANT RAYNOR (CONT’D)  Think about your father. Think  about his father. Your name means  something out here.  SIMON  No more.  STAFF SERGEANT RAYNOR  Not an acceptable answer.  SIMON  No...  STAFF SERGEANT RAYNOR  You’re THIS close to finishing this  out. You want to tell me after it  all you’re really just a piece of  shit? A guy who can’t push through  when it matters most, to survive?  SIMON  Can’t...  STAFF SERGEANT RAYNOR  Then I don’t want you in my Corps,  getting my men killed. You get to  do one of two things right now.  Stand up and keep walking or say “I  quit”.  85. SIMON  It’s...  Simon looks ahead, some of the other recruits, ",
      "dialogue_count": 0,
      "word_count": 1368
    }
  ]
}