{
  "slug": "insecure-101-insecure-as-fuck-2016",
  "title": "insecure 101 insecure as fuck",
  "genre": "comedy",
  "format": "series",
  "scenes_count": 4,
  "characters_count": 0,
  "characters": [],
  "total_words": 4569,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. RESTAURANT - NIGHT Issa listens as Molly vents. MOLLY ...We were just going with the flow. It came out of nowhere. I thought we were having a good time. ISSA Whose idea was it to go with the flow? MOLLY It was mutual. Issa gives a look. MOLLY (CONT’D) Ok, bitch! It was his. But I was cool with it. ISSA Did going with the flow include fucking him? MOLLY What the fuck else flow is there? ISSA Was he hairy? MOLLY He was Arab. ISSA So, yes. MOLLY So, then he went from calling me everyday to texting me... ISSA Aww, damn. MOLLY ...and THEN this muthafucka TEXTS me, “Sorry, I’m not looking for a relationship right now. Sad face.” ISSA He did NOT leave a SAD face! I will slap you right now.  10.",
      "characters": [],
      "action_text": "Molly holds her the text message up to Issa’s face, sad-face Emoji included. Issa can’t believe it. ISSA (CONT’D) What the fuuuuuuck? MOLLY My life. ISSA Welp. That’s what you get for fucking 9/11. MOLLY That sand nigga can go terrorize somebody else’s pussy. They CRACK up in between “Bitch you’re racist” accusations, Issa notices a MIDDLE EASTERN COUPLE behind them. She turns back to Molly. ISSA Oh shit, what if they heard you say “sand nigga?” Molly stares at her drink, silent. ISSA (CONT’D) You OK? MEGAN It’s your birthday, I don’t want to make it all about me. ISSA Girl, stop. What’s going on? And then suddenly, she starts crying. It’s a silent, devastated cry more than an outburst. MOLLY It doesn’t matter what I do. I can be the total girlfriend. If I’m into him: “Too smothering.” Then if I’m taking my time or if I try to give them room: “Didn’t think you were into me.” Sex right away: lose interest. Wait to have sex: lose interest. If I don’t have sex...fuck that shit--I’m a grown ass woman, I didn’t sign up for that.  11. ISSA Yeah. Issa takes a moment to let Molly collect her tears. She contemplates whether or not she should say what she’s about to say. Fuck it-- ISSA (CONT’D) I think...maybe your pussy’s broken. Molly’s head snaps up. MOLLY What?! ISSA Your pussy is sad. I think it’s had enough. If it could talk, it’d make that sad Marge Simpson groan. Molly knows exactly what she’s talking about it. MOLLY (Marge Simpson groan) Hmmmmmghhghghhhhhhhh. Issa bursts out laughing. ISSA That’s it! That’s your pussy! The Middle Eastern Couple turns around. They definitely heard that. Molly starts laughing, in spite of herself. They both start making the Marge Simpson noise back and forth, as the WAITER approaches the table. WAITER You ladies ready? They both laugh. ISSA No, we’re still not ready. I promise we will be the next time. The waiter nods and leaves. They pick up their menus. ISSA (CONT’D) So...I’m thinking about ending things with Lawrence. Molly nearly c",
      "dialogue_count": 0,
      "word_count": 656
    },
    {
      "scene_number": 2,
      "slugline": "INT. STUDIO APARTMENT - NIGHT Issa takes a deep breath and opens the door. Before she can say anything, she finds a depressed LAWRENCE, 32, on the couch in his boxers, watching YouTube videos of people doing Crossfit. He halfway turns his head toward her. LAWRENCE Happy birthday, bae. Issa closes the door behind her, trying to hide her irritation. ISSA Thanks. Why aren’t you dressed? The show starts at 10, right? Lawrence pats a spot on the couch. Issa reluctantly walks over and sits. LAWRENCE I bombed the interview. ISSA Geez. LAWRENCE I just got nervous, and started saying stuff that didn’t make sense. I didn’t talk about anything that I could bring to the table. I just spit words out. ISSA I’m sure it wasn’t that bad. LAWRENCE No, I literally spit on him. Then I spilled hot coffee all over his desk. ISSA Nevermind. LAWRENCE I’m really sorry for ruining your birthday, but can we please just RedBox a movie or something? He takes her hand. LAWRENCE (CONT’D) I promise I’ll make it up to you.  14.",
      "characters": [],
      "action_text": "Issa nods. He gives her a peck on the lips. LAWRENCE (CONT’D) Thanks. Let me just finish this video and then we can go to 7/11. He presses play and the BODYBUILDER on screen shouts at the camera. BODYBUILDER You want pecs? You want these abs? It takes fucking discipline! Stop making excuses and do it. Make it happen. It’s not gonna happen from sitting on your ass... Issa pulls out her phone and scrolls to her Facebook messages. She clicks on Donnell’s message and responds:  “Thank you. I miss you, too.”  INT. MOLLY’S APARTMENT - LIVING ROOM - NIGHT Molly pours some dog food into a bowl and places it on the couch. MOLLY Flavor Flav! An ancient BLACK TERRIER saunters over to the couch and crawls up to the bowl of food as Molly scrolls through her DVR. She clicks on an episode of “The Real Sidechicks of Boxers.” Molly settles into a comfortable position on her couch, cuddled next to Flavor Flav. INT. WE GOT YOU! - CONFERENCE ROOM - NEXT DAY Issa and Frieda stand at the front of the conference room as Joanne and other EMPLOYEES listen. It is apparent that Issa and another Indian employee, SARAH, are the only faces of color. Frieda is leading the presentation. FRIEDA ...And these poor, poor children need our guidance more than anything. They were so intent on not acknowledging the burdens that face them every day, that they focused mostly on Issa’s love life...which, I must say, served as a great icebreaker.  15. The employees chuckle. Issa does not. FRIEDA (CONT’D) Thomas Jefferson Middle School’s statistics state that 40% will not graduate from high school, 20% will be teen parents and 45% will be involved with gang activity. We absolutely have to intervene... As Frieda speaks, Issa hears differently. FRIEDA (CONT’D) Educated Black women are highly unlikely to get married the more education they have. On the bright side, many black women are work- focused and find happiness in their careers. And then there’s a small percentage of pathetic women who have neither. They a",
      "dialogue_count": 0,
      "word_count": 1278
    },
    {
      "scene_number": 3,
      "slugline": "INT. STUDIO APARTMENT - LIVING ROOM - NIGHT Issa walks out of the bathroom to find Lawrence eating cereal in their kitchen. He reacts to her outfit. LAWRENCE Wow. What are you getting dressed up for? ISSA I’m taking Molly out tonight. LAWRENCE On a date? Should I be jealous? ISSA She’s just really upset and I want to make her feel better. LAWRENCE What’s wrong with her? ISSA She doesn’t think she’ll ever get married. Lawrence almost spits out his cereal laughing so hard. Issa shakes her head and goes to get her purse and keys. LAWRENCE She might be onto something. ISSA Don’t be a dick. LAWRENCE (still amused) Tell me she’s not dramatic. ISSA You don’t even know what she’s going through! Dating is hard. LAWRENCE Not if she stops taking it so seriously. Plus, her standards are way too high. ISSA Yeah, maybe she should lower them, like I did. Oops. Did she say that out loud? Lawrence looks offended.  20.",
      "characters": [],
      "action_text": "LAWRENCE What the fuck? ISSA Nevermind. Sorry. LAWRENCE What does that mean? ISSA It means, sometimes I wonder what the fuck we’re doing. LAWRENCE We’re together. ISSA Yeah, but where are we going? Is this it? Are we already here? LAWRENCE Bae-- ISSA Because maybe I didn’t know it before, but I know now that I don’t want to just sit on the couch and wait for something to happen for the rest of my life. LAWRENCE What are you talking about? Nobody’s just sitting on the couch. I’m just getting my shit together. ISSA You’ve been “getting your shit together” for four years! I feel like we’re both wasting our time, and I DON’T HAVE TIME TO WASTE! Lawrence is taken aback. So is Issa. She can’t believe she’s saying this. LAWRENCE So what are you saying? ISSA I’m saying...maybe we should get our shit together separately and see what happens. Issa’s phone rings. It’s Molly.  21. LAWRENCE You want to break up with me? ISSA Molly’s downstairs. I’m gonna spend the night at her house. We can talk about it tomorrow. LAWRENCE Issa. Issa bolts out of the door, leaving Lawrence bewildered with his bowl of cereal. INT. CASEY’S - NIGHT Molly and Issa enter Casey’s and survey their surroundings. GROWN ASS THUGS and WANNA-BE RAPPERS crowd the stage and the bar area. Molly turns to Issa, this is not what she expected. MOLLY Issa, why are we in 1997 Inglewood? ISSA I didn’t know! I’ve never been here before. But I’ve heard really good things... MOLLY From who? Some of your middle school Crips? Issa turns to Molly. ISSA Can you stop being all judgmental? We’re supposed to have fun tonight. I could’ve taken you to some stuck up Hollywood spot with a bunch of assholes, but we’re here. Let’s just have fun tonight. Molly glares and gives Issa the Broken Pussy/Marge Simpson groan and nods in agreement. MOLLY Fine. You’re buying me a drink. INT. CASEY’S - BAR - MOMENTS LATER Molly sips her drink as Issa takes a Kamikaze shot and listens to an EMOTIONAL RAPPER on stage.  22. MOLLY So are y’all bro",
      "dialogue_count": 0,
      "word_count": 1611
    },
    {
      "scene_number": 4,
      "slugline": "INT. ISSA’S CAR - NIGHT Issa and Molly sit in silence. Molly stares out of the window, fuming and shaking her head. ISSA I’m really sorry. It wasn’t even about you. Donnell dared me to do it, and you know how we were talking about this being the last year of my 20’s, and feeling like I have to make the most of it. I don’t know what came over me, but I just...went up there and DID. THAT. SHIT. And-- I don’t know, you tell me-- but I felt like I was actually  good   up there. Issa turns to Molly. Nothing. Okay. They drive for a couple more blocks until Issa pulls up to Molly’s apartment and puts the car in park. More silence. ISSA (CONT’D) So...am I still spending the night...Or nah...? MOLLY Can you shut the FUCK up? Issa is caught off guard as Molly shakes her head and opens the door to let herself out. ISSA What did I say? MOLLY The only reason why we came to this hoodrat ass club tonight is because YOU wanted to see Donnell. ISSA Huh? No, I didn’t even know-- MOLLY Bitch, stop. You knew. This was always about you. ISSA It was about you, too! MOLLY Is my life a joke to you? I’m already dealing with trifling niggas and untraditional niggas on a daily basis and now I have to worry about a trifling best friend? (MORE)  29.",
      "characters": [],
      "action_text": "You made my heartbreak a joke up there. ISSA I didn’t mean to. I didn’t think about it like that. MOLLY Yeah, that’s the damn problem. You don’t think about how the shit you do affects others. ISSA Are you kidding?   My whole life   is about how stuff affects others! My job, my boyfriend--you! I always listen to you! I care about how shit affects you, too! MOLLY You only listen to me because I make you feel better about you! Issa’s phone goes off. It’s a text from Donnell: “I want to see you right now. Come thru.” It takes all of Issa’s energy to keep a blank face. She tries to maintain eye contact with Molly while re-reading the message. Eyes darting to the phone, while she nods her head. MOLLY (CONT’D) ...You should’ve seen how fast Jared left. What if he was the one? Oh! That’s right. I’ll never know! Issa types, responding to the text and simultaneously trying to show Molly that she’s paying attention. Just as she presses “SEND” Molly notices. MOLLY (CONT’D) Bitch, I   know   you didn’t just respond to that motherfucking text. ISSA I didn’t! MOLLY You’re LYING. Did you send a text?! ISSA I swear on my life and my brother’s life I did   not   send a text! Issa’s phone lets off a “Message Sent” sound. Molly is enraged. MOLLY (CONT'D)  30. ISSA (CONT’D) Ok, NOW it’s technically sent. But it’s Donnell, he disappeared and-- MOLLY Fuck you. And if you fuck Donnell, you’re as much of a dumb bitch as I am. Molly slams the door in Issa’s face and storms into her apartment building. Issa briefly looks remorseful, then starts her car. INT. CAR/EXT. DONNELL’S APARTMENT Issa pulls up to Donnell’s apartment and takes a moment in the car. This is it. She could go back home to Lawrence or she can go upstairs and be a “dumb bitch.” Issa thinks about it; laughs at herself and starts the car. She’s not doing this. As she starts to pull off, Donnell knocks on her car window. Issa is startled. DONNELL Hey! Where you going? ISSA Oh. I shouldn’t be here. DONNELL What? Come on. You’re ",
      "dialogue_count": 0,
      "word_count": 1024
    }
  ]
}