{
  "slug": "inside-out-2015",
  "title": "inside out",
  "genre": "horror",
  "format": "film",
  "scenes_count": 17,
  "characters_count": 0,
  "characters": [],
  "total_words": 19092,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. HEADQUARTERS A happy memory (golden) rolls in. The others leave Joy alone at the console with Sadness. JOY (V.O.) And you’ve met Sadness. She... well, she... FLASH CUTS of Riley crying: broken toy, spilled ice cream, tantrum in the supermarket, wanting out of her car seat. JOY (V.O.) I’m not actually sure what she does. And I’ve checked, there’s no place for her to go, so she’s good, we’re good. It’s all great! Sadness exits. Joy turns to the wall of golden memories. JOY (V.O.) Anyway! These are Riley’s memories-- and they’re mostly happy, you’ll notice, not to brag. She inspects one of the golden memories: Riley and her friend MEG (both age 3) going down a slide. She REWINDS it, relishing the happy moment. JOY (V.O.) But the REALLY important ones are over here. I don’t want to get too technical, but these are called CORE MEMORIES. Joy pops up the CORE MEMORY HOLDER. Inside are five intensely bright golden memories. JOY (V.O.) Each one came from a super- important time in Riley’s life. Like when she first scored a goal? That was so amazing! EXT. MINNESOTA LAKE, WINTER - DAY Two-and-a-half-year-old Riley shoots a hockey puck across the ice. She trips and accidentally scores a goal. INSIDE OUT   6 .",
      "characters": [],
      "action_text": "MOM/DAD (cheering) Heeey! Would you look at that?! We got a future center here! INT. HEADQUARTERS A super-bright CORE MEMORY rolls in. It rolls to the Core Memory Holder.   Clicking into position, a LIGHTLINE shoots out.   The Emotions follow it to the back window and watch a new ISLAND OF PERSONALITY form. JOY (V.O.) And each core memory powers a different aspect of Riley’s personality. Like Hockey Island! Five ISLANDS OF PERSONALITY float in space, miles from Headquarters, connected by LIGHTLINES -- their power sources. JOY (V.O.) Goofball Island is my personal favorite. INT. MINNESOTA LIVING ROOM - NIGHT Toddler Riley runs naked from the bathroom, underpants on her head, laughing wildly. Dad chases her with a towel. DAD Come back here, you little monkey! INT. HEADQUARTERS Goofball Island activates: lights, movement, etc. INT. MINNESOTA LIVING ROOM Naked Riley does the goofy dance on the sofa. INT. HEADQUARTERS JOY (V.O.) Yup, Goofball is the best! Friendship Island is pretty good too. Joy looks at FRIENDSHIP ISLAND. INSIDE OUT   7 .",
      "dialogue_count": 0,
      "word_count": 384
    },
    {
      "scene_number": 2,
      "slugline": "EXT. SIDEWALK - DAY Riley and Meg walk leg over leg, arms linked, laughing. INT. HEADQUARTERS Joy inspects Honesty Island. JOY (V.O.) Oh, I love Honesty Island! And that's the truth! INT. MINNESOTA HOUSE - DAY A guilty Riley stands by a broken plate.   She reveals a HAMMER from behind her back. INT. HEADQUARTERS Joy examines Family Island. JOY (V.O.) And, of course, Family Island is amazing. EXT. MINNESOTA KITCHEN TABLE - DAY The family decorate cookies together. Riley stuffs one into Dad's mouth. INT. HEADQUARTERS The Emotions look out over the Islands of Personality. JOY (V.O.) The point is, the Islands of Personality are what make Riley... Riley! INT. BATHROOM Riley splashes in the bathtub. YOUNG RILEY Look out, mermaid! INSIDE OUT   8 .",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 126
    },
    {
      "scene_number": 3,
      "slugline": "INT. MINNESOTA LIVING ROOM Riley climbs the couch. She looks at the floor. INT. HEADQUARTERS Joy projects an IMAGINATION of LAVA onto the screen. INT. MINNESOTA LIVING ROOM YOUNG RILEY Lava! Riley jumps from couch to chair to avoid the lava. INT. MINNESOTA HOUSE Riley draws. Pull back to reveal she’s drawing on the wall. YOUNG RILEY (singing) Who’s your friend who likes to play? Bing Bong, Bing Bong... EXT. MINNESOTA LAKE - DAY Six-year-old Riley skates across the ice backwards. MOM/DAD Hey! Very nice! Where did you learn that? INT. HEADQUARTERS Joy skates around the room, in sync with Riley. EXT. MINNESOTA FRONT STEPS - DAY Riley and Meg slurp frozen drinks. Riley grimaces: ice headache! INT. HEADQUARTERS FEAR Brain freeze! The Emotions scream as Headquarters freezes over. INSIDE OUT   9 .",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 134
    },
    {
      "scene_number": 4,
      "slugline": "EXT. MINNESOTA LAKE - DAY A kids’ hockey game. Riley takes a shot and scores! INT. HEADQUARTERS JOY Yaaay! INT. RILEY’S MINNESOTA BEDROOM - NIGHT Parents tuck Riley into bed and turn off the light. DAD Good night, kiddo! RILEY G’night, Dad. She looks up at the stars on her ceiling and falls asleep. INT. HEADQUARTERS Joy watches the screen go DARK. She inspects the shelves mostly populated with GOLDEN MEMORIES. JOY And... we’re out. That’s what I’m talking about: another perfect day! Nice job everybody! Let’s get those memories down to Long Term. Joy pulls a lever. Memories cascade down the shelves. FEAR All right, we did not die today! I call that an unqualified success. The memories pachinko down the shelves and up a tube. Joy runs to the back window to watch them glide through the distant tubes towards Long-Term Memory like falling stars. JOY (V.O.) And that’s it! We love our girl. She’s got great friends and a great house. Things couldn’t be better. After all, Riley’s 11 now. What could happen? CUT TO: INSIDE OUT   10 .",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 183
    },
    {
      "scene_number": 5,
      "slugline": "EXT. MINNESOTA HOUSE FRONT YARD - DAY Moving sign: Sold! INT. HEADQUARTERS JOY Wha...? SADNESS/FEAR/ANGER/DISGUST AIIIIIGHH!!! EXT. DRIVEWAY - DAY SLAM! A packed car hatchback closes. INT. HEADQUARTERS JOY Huh? SADNESS/FEAR/ANGER/DISGUST AIIIIIGHH!!! EXT. MINNESOTA STREET - DAY VROOM! A moving van drives away. INT. HEADQUARTERS JOY OK, not what I had in mind. SADNESS/FEAR/ANGER/DISGUST AIIIIIGHH!!! EXT. AMERICAN HIGHWAYS A SERIES OF SHOTS: the family car drives across America.   The car passes corn fields and rolling hills. TITLE CARD: A PIXAR ANIMATION STUDIOS FILM Riley sleeps in the back seat.   The car zips around a mountain curve, down a desert highway. Riley looks out the back window. INSIDE OUT   11 .",
      "characters": [],
      "action_text": "The car emerges from a tunnel onto the GOLDEN GATE BRIDGE. TITLE CARD: INSIDE OUT The car drives across the bridge. Riley looks out the window. JOY (V.O.) Hey look! The Golden Gate Bridge! Isn’t that great?! It’s not made out of solid gold like we thought, which is kind of a disappointment, but still! The car drives past the Ferry Building. INT. HEADQUARTERS FEAR I sure am glad you told me earthquakes are a myth, Joy. Otherwise I’d be terrified right now! Everyone eyes each other behind Fear’s back. JOY Uh... yeah. EXT. LOMBARD STREET - DAY The car is stuck in traffic. Cars HONK and people YELL. INT. HEADQUARTERS ANGER These are my kind of people! EXT. MARKET STREET - DAY DAD All right, just a few more blocks. We’re almost to our new house! INT. HEADQUARTERS ANGER Step on it, Daddy! INSIDE OUT   12 . DISGUST Why don't we just live in this smelly car? We've already been in it forever. JOY Which, actually, was really lucky, because that gave us plenty of time to think about what our new house is going to look like! Let’s review the top five daydreams. Joy plugs in DAYDREAMS showing fantasy houses: tree house, water-slide house, etc. FEAR Ooh! That looks safe! JOY Ohh, this is will be great for Riley! Oh, no, no, no, THIS one. A gingerbread house. DISGUST (O.S.) Ugh, Joy. For the last time, she cannot live in a cookie. A castle. ANGER THAT’S the one! It comes with a dragon! EXT. SAN FRANCISCO HOUSE - DAY JOY (O.S.) Now we’re getting close, I can feel it. Here it is, here’s our new house... and... The car stops and Riley steps out. REVEAL: a run-down Victorian. Nothing like the daydreams. INT. HEADQUARTERS Everyone looks slackjawed. JOY Maybe it’s nice on the inside. INSIDE OUT   13 .",
      "dialogue_count": 0,
      "word_count": 421
    },
    {
      "scene_number": 6,
      "slugline": "INT. SAN FRANCISCO HOUSE - CONTINUOUS Riley steps inside. The room is dark, dusty, uninviting. ANGER (V.O.) We’re supposed to live here? SADNESS (V.O.) Do we have to? DISGUST (V.O.) I’m telling you, it smells like something died in here. INT. HEADQUARTERS A disgust memory rolls in. FEAR Can you die from moving? JOY Guys, you’re overreacting. Nobody is dying-- DISGUST A DEAD MOUSE!!! ON THE SCREEN: A dead mouse in the corner. DISGUST (O.S.) (CONT’D) I’m gonna be sick... ANGER (O.S.) Great, this is just great. FEAR (O.S.) Ahhhhh!! It’s the house of the dead! What are we gonna do?! We’re gonna get rabies!!! Fear jumps into Anger’s arms. Anger fires up the flames. ANGER GET OFFA ME!!! Fear runs around on fire. Joy puts him out with a fire extinguisher. JOY Hey, hey, hey, all through the drive Dad talked about how cool our new room is. Let’s go check it out! INSIDE OUT   14 .",
      "characters": [],
      "action_text": "FEAR/ANGER/DISGUST (O.S.) You’re right, Joy/Yeah!/That’s right!/Yes, yes, yes! INT. SAN FRANCISCO HOUSE Riley dashes up the stairs. INT. RILEY’S ROOM - CONTINUOUS It’s tiny. Depressing. FEAR/DISGUST/ANGER   (O.S.) No, no, no, no, no./I’m starting to envy the dead mouse./Get out the rubber ball, we’re in solitary confinement. INT. HEADQUARTERS SADNESS Oh, Riley can’t live here. ANGER She's right.   FEAR Really bad. DISGUST It’s the worst. It’s absolutely the worst. ANGER This house stinks. Memories roll in: anger, disgust, fear. JOY Hey, it’s nothing our butterfly curtains couldn’t fix. I read somewhere that an empty room is an opportunity. ANGER Where did you read that? JOY It doesn’t matter. I read it and it’s great. We’ll put the bed there. And the desk over there... Joy projects an IMAGINATION of Riley’s furniture. FEAR The hockey lamp goes there... INSIDE OUT   15 . ANGER Put the chair there.   DISGUST Well, the trophy collection goes there. SADNESS Posters...   FEAR Stars! I like that. JOY Now we’re talking! Let’s go get our stuff from the moving van! INT. SAN FRANCISCO HOUSE - DAY Riley dashes down the stairs as Mom and Dad enter the house. Dad is on the phone. DAD Alright. Goodbye. (hangs up; to Mom) Well, guess what? The moving van won’t be here until Thursday. MOM You’re kidding. INT. HEADQUARTERS FEAR The van is lost?! This is the worst day ever! ON THE SCREEN: Mom and Dad ARGUE. MOM You said it would be here yesterday! DAD I know that’s what I said.   * That’s what they told me! FEAR (O.S.) Mom and Dad are stressed out! FEAR/ANGER/DISGUST/SADNESS They’re arguing!/What are we going to do?/This is so stressful./What is their problem? Joy runs to storage and grabs what looks to be a LIGHTBULB. JOY I’ve got a great idea! She clicks the IDEA into the console. INSIDE OUT   16 .",
      "dialogue_count": 0,
      "word_count": 467
    },
    {
      "scene_number": 7,
      "slugline": "INT. SAN FRANCISCO LIVING ROOM - DAY Riley’s face lights up. Riley grabs her hockey stick. Puts a wad of paper in play. MOM Did you even read the contract? DAD Honey, you act like this is my fault--   * RILEY Andersen makes her move. She's closing in! DAD (grabbing a broom) Hey! Oh, no you’re not! RILEY She’s lining up for the shot! DAD Coming behind you! Watch out! She slides past him. Knocks the “puck” into the fireplace. RILEY She shoots and she scores! Yeah! INT. HEADQUARTERS The Emotions cheer. Out the back window, Family Island runs. INT. SAN FRANCISCO LIVING ROOM - CONTINUOUS RILEY (taunting Mom) Come on, Grandma! MOM Ha! “Grandma?” INT. HEADQUARTERS JOY Uh-oh, she put her hair up, we’re in for it! INSIDE OUT   17 .",
      "characters": [],
      "action_text": "INT. SAN FRANCISCO LIVING ROOM They all play hockey, Mom using a pillow to guard the “goal.” Dad picks her up to shoot past her. MOM (laughing) Woo! Hey, put me down! Dad scoops up Riley, too. Riley giggles. INT. HEADQUARTERS A happy memory rolls in. Joy’s back in charge. INT. SAN FRANCISCO LIVING ROOM Dad’s cell phone beeps. DAD Ugh. Sorry, hold on, hold on. (answers) Hello? INT. HEADQUARTERS JOY Wait. Wha--? INT. SAN FRANCISCO LIVING ROOM DAD You’re kidding. All right. Stall for me, I’ll be right there. (hangs up) The investor’s supposed to show up on Thursday, not today! I gotta go. INT. HEADQUARTERS Joy is disappointed. INT. SAN FRANCISCO LIVING ROOM MOM It's okay. We get it. INSIDE OUT   18 . DAD You’re the best. Thanks, Hon. (to Riley, as he leaves) See you, Sweetie. INT. HEADQUARTERS FEAR Dad just left us. SADNESS Oh, he doesn’t love us anymore. That’s sad. I should drive, right? JOY BLOCKS HER. SADNESS (CONT’D) Joy? What are you doing? JOY Uh, just uh, gimme one second... You know what I’ve realized? Riley hasn’t had lunch! (takes a memory off the wall and plays it) Remember? MEMORY: A PIZZA SHOP. INT. SAN FRANCISCO LIVING ROOM RILEY Hey I saw a pizza place down the street. Maybe we could try that? MOM Pizza sounds delicious! INT. HEADQUARTERS FEAR/ANGER/DISGUST Yeah!/Pizza!/Good idea, Joy. Joy smiles. INT. PIZZA PLACE - DAY Riley and Mom get their pizza. On it: broccoli. INSIDE OUT   19 .",
      "dialogue_count": 0,
      "word_count": 382
    },
    {
      "scene_number": 8,
      "slugline": "INT. HEADQUARTERS FEAR/JOY/DISGUST What the HECK IS THAT?!/Who puts broccoli on pizza?/That’s it. I’m done. ANGER Congratulations, San Francisco, you’ve ruined pizza!   First the Hawaiians, and now YOU! EXT. SAN FRANCISCO STREET - LATER Mom and Riley walk home. Riley looks disappointed. MOM What kind of a pizza place only serves one kind of pizza? Must be a San Francisco thing, huh? INT. HEADQUARTERS Joy glances at the wall of multi-colored memories. She sighs: things are not going well. EXT. SAN FRANCISCO STREET - CONTINUOUS MOM Still, it’s not as bad as the soup at that diner in Nebraska. RILEY Oh yeah. The spoon stood up in the soup by itself! That was disgusting. INT. HEADQUARTERS Joy looks out the back window. Family Island is going. JOY Oh good. Family is running. EXT. SAN FRANCISCO STREET MOM The drive out was pretty fun, huh? What was your favorite part? INSIDE OUT   20 .",
      "characters": [],
      "action_text": "INT. HEADQUARTERS ANGER Spitting out the car window! DISGUST Definitely not when Dad was singing. FEAR Wearing a seat belt! JOY What about the time with the dinosaur! Joy pulls up a memory. SADNESS/FEAR/ANGER/DISGUST Yeah./Yup./That’s the one. ON THE SCREEN: Riley and Mom pose in front of a roadside cement dinosaur in Vernal, Utah. DAD (ON SCREEN) Say cheese! Behind Dad, the car rolls down the hill. No brakes! RILEY (ON SCREEN) Dad! Dad! Look behind you. MOM (ON SCREEN) Honey. The car! The car! DAD (ON SCREEN) Hold still. Huh? (runs off after the car) Stoooop! No no no nononono!! Stegosaurus tail through the back window. The family laughs. Enjoying the memory, Joy and the others chuckle. FEAR Nice one, Joy. EXT. SAN FRANCISCO STREET RILEY (smiling) I liked that time at the dinosaur. That was pretty funny. INSIDE OUT   21 .",
      "dialogue_count": 0,
      "word_count": 297
    },
    {
      "scene_number": 9,
      "slugline": "INT. HEADQUARTERS Joy’s cheer is cut short when the dinosaur memory TURNS BLUE. EXT. SAN FRANCISCO STREET - DAY Riley’s smile fades. INT. HEADQUARTERS JOY Wait. What? What happened? Joy looks back. Sadness is touching the memory. FEAR She did something to the memory. Joy tries to fix the memory. JOY What did you do? SADNESS I just touched it. JOY That shouldn’t make it change. FEAR Change it back, Joy! Joy rubs it, but the memory stays blue. JOY I’m trying. ANGER You can’t change it back? JOY No, I guess I can’t! DISGUST Good going Sadness. Now when Riley thinks of that moment with Dad, she’s gonna feel sad. Bravo. SADNESS I’m sorry Joy... I don’t really know-- I thought maybe, if you-- if I-- if... I mean... INSIDE OUT   22 .",
      "characters": [],
      "action_text": "DISGUST Joy, we've got a stairway coming up. EXT. SAN FRANCISCO STREET - DAY Riley runs towards a stairway and handrail. INT. HEADQUARTERS JOY Just don’t touch any other memories until we figure out what’s going on. SADNESS Okay. JOY (stepping up to controls) Alright. Get ready, this is a monster railing, and we are riding it all the way down! EXT. SAN FRANCISCO STREET - CONTINUOUS Riley sits on the railing, ready to slide. INT. HEADQUARTERS Joy looks back: GOOFBALL ISLAND is whirring like crazy. EXT. SAN FRANCISCO STREET Riley goes to slide... but hops off and walks down instead. INT. HEADQUARTERS JOY Wait, what? What happened? Suddenly a CORE MEMORY ROLLS up to Joy’s feet. FEAR A core memory! JOY Oh no! INSIDE OUT   23 . Out the back window, GOOFBALL ISLAND GOES DARK. Joy rushes to the Core Memory Holder. JOY (CONT’D) Sadness! What are you doing? SADNESS It looked like one was crooked so I opened it and then it fell out! Joy pops the memory back in. GOOFBALL ISLAND comes back on. EXT. SAN FRANCISCO STREET Riley jumps back on the railing and slides down. RILEY Woo hoo! INT. HEADQUARTERS SADNESS It’s just that... I wanted to maybe hold one. She reaches out to touch one, AND IT STARTS TO GO BLUE. FEAR JOY! Joy pushes Sadness away before she can touch it. JOY Whoa, whoa, whoa! The core memory TURNS BACK TO YELLOW. JOY (CONT’D) Sadness! You nearly touched a core memory. And when you touch them, we can’t change them back! SADNESS I know. I’m sorry. Something’s wrong with me. It’s like I’m having a breakdown. JOY You are not having a breakdown. It’s stress. INSIDE OUT   24 . SADNESS I keep making mistakes like that. I’m awful... JOY Nooo, you’re not. SADNESS ...and annoying. JOY Well... uh... You know what? You can’t focus on what’s going wrong. There’s always a way to turn things around, to find the fun! SADNESS Yeah. Find the fun. I don’t know how to do that. JOY Okay. Well, try think of something funny! Long pause. SADNESS Oh! Remember the funny movie where the dog di",
      "dialogue_count": 0,
      "word_count": 2319
    },
    {
      "scene_number": 10,
      "slugline": "INT. SAN FRANCISCO HOUSE - CONTINUOUS MOM Very cute! You gonna be okay? You want us to walk with you? INT. HEADQUARTERS DISGUST Mom and Dad? With us in public? No thank you. JOY (operating console) I’m on it. INT. SAN FRANCISCO HOUSE RILEY Nope, I’m fine. Bye Mom! Bye Dad! DAD (covering phone) Have a good day at school, Monkey! All three make monkey sounds at each other. INT. HEADQUARTERS Goofball Island works out the back window. INT. SAN FRANCISCO HOUSE Riley giggles as she exits. MOM Have a great day, sweetheart. EXT. SCHOOL - MORNING Riley walks up to her new school. New kids everywhere. She hesitates. FEAR (O.S.) Are you sure we want to do this? JOY (O.S.) In we go! INSIDE OUT   37 .",
      "characters": [],
      "action_text": "FEAR (O.S.) Okayyy! Going in! Yes. Riley perks up and walks in. INT. CLASSROOM - MORNING Riley sits at her desk and looks at the other kids in class. DISGUST (O.S.) Okay, we’ve got a group of cool girls at 2 o’clock. INT. HEADQUARTERS - CONTINUOUS JOY How do you know? DISGUST Double ears pierced, infinity scarf... A group of makeup-wearing girls look back at Riley. JOY Whoa. Is she wearing eye shadow? DISGUST Yeah, we want to be friends with them. JOY Let’s go talk to ‘em! DISGUST Are you kidding?? We’re not TALKING to them, we want them to like us. JOY Oh!  (then) Wait, what? FEAR (drops a giant stack of paper on the console) Almost finished with the potential disasters. Worst scenario is either quicksand, spontaneous combustion, or getting called on by the teacher. So as long as none of those happen... INSIDE OUT   38 . INT. CLASSROOM TEACHER Okay, everybody. We have a new student in class today. INT. HEADQUARTERS FEAR Are you kidding me?! Out of the gate? This is not happening! INT. CLASSROOM TEACHER Riley would you like to tell us something about yourself? INT. HEADQUARTERS FEAR Nooooooo! Pretend we can’t speak English! JOY Don't worry. I got this. Joy pushes a lever. INT. CLASSROOM RILEY Uhh... okay. My name is Riley Andersen. I’m from Minnesota. And now I live here. TEACHER And how about Minnesota?... Can you tell us something about it? Well you certainly get a lot more snow than we do. INT. HEADQUARTERS JOY (laughs) She’s hilarious! She turns a lever. INSIDE OUT   39 . INT. CLASSROOM Riley smiles, in spite of all the eyes on her. RILEY Yeah, it gets pretty cold. The lake freezes over, and that’s when we play hockey. I’m on a great team. We’re called the Prairie Dogs. My friend Meg plays forward. My Dad’s the coach. Pretty much everyone in my family skates. INT. HEADQUARTERS Joy recalls a MEMORY: the family skating together. INT. CLASSROOM Riley “watches” the memory, smiling. RILEY It’s a kind of family tradition. We go out on the lake almost every weekend. IN",
      "dialogue_count": 0,
      "word_count": 661
    },
    {
      "scene_number": 11,
      "slugline": "INT. CLASSROOM RILEY But everything’s different now. Since we moved... TEARS stream down Riley’s face. INT. HEADQUARTERS FEAR Oh no! We’re CRYING AT SCHOOL!!! Joy turns to the console. SADNESS IS DRIVING. JOY What? No! Sadness, what are you doing? Joy finally yanks the memory out. She runs to the console and pulls Sadness away from the controls. SADNESS Oh no, I'm sorry... I... oh... PING! A memory is created. BRIGHT BLUE. JOY Huh? ANGER Whoa! FEAR It’s a core memory! DISGUST But it’s blue! The bright blue core memory rolls through the memory shelf and STARTS TOWARDS THE CORE MEMORY HOLDER! JOY No wait... stop it! No! Ahh! Joy leaps to the holder and pops it open, preventing the new blue core memory from going in. Joy grabs it. She pushes the end-of-day “memory flush” button. The tube comes down from the ceiling. INSIDE OUT   42 .",
      "characters": [],
      "action_text": "SADNESS (trying to take her memory back from Joy) Joy, no. That’s a core memory, Joy! JOY Hey! Stop it. Let go. As they struggle, they bump into the Core Memory Holder, KNOCKING ALL OF THE CORE MEMORIES OUT onto the floor. FEAR/DISGUST/ANGER Ahh!   FEAR The core memories! Out the window, the ISLANDS OF PERSONALITY GO DARK. INT. CLASSROOM Riley, her face tear-stained, looks up. INT. HEADQUARTERS JOY Ahh! Joy tosses the blue core memory aside to collect the yellow core memories. Sadness grabs the blue core memory and heads to the Core Memory Holder to plug it in. Joy lunges, knocking the blue core memory out of Sadness’s hands. It’s SUCKED UP the vacuum tube. Joy trips backward. In the chaos a yellow core memory rolls toward the tube. JOY (CONT’D) No, no, no, no! She reaches to grab it and gets sucked up the tube herself, along with the other core memories -- and Sadness! Fear, Anger and Disgust now stand alone in Headquarters.   A stunned silence as the tube retracts. INT. CLASSROOM Riley sits and wipes her tears. INSIDE OUT   43 . TEACHER Thank you, Riley. I know it can be tough moving to a new place, but we're happy to have you here. Alright everyone, get out your history books and turn to chapter seven. Riley hides behind her book. INT. HEADQUARTERS ANGER Can I say that curse word now? INT. TUBE Joy and Sadness scream as they rocket down the tube. Joy desperately tries to hold on to the core memories. The blue core memory is sorted to a side tube. EXT. LONG-TERM MEMORY CLIFF EDGE Joy lands in a bin of memories. Sadness crashes next to her. JOY Oh no... (gathering memories) One, two, three... okay, got ’em. Wha-- where are we? Joy takes in the shelving around her. JOY (CONT’D) Long-Term Memory...! Joy grabs the core memories and jumps out of the dumpster. She sees GOOFBALL ISLAND, silent and dark. JOY (CONT’D) Goofball Island. Joy surveys the islands beyond. They’re all dark. SADNESS Hoh... Riley’s Islands of Personality. They’re ALL down! This is bad. INSIDE OUT  ",
      "dialogue_count": 0,
      "word_count": 7603
    },
    {
      "scene_number": 12,
      "slugline": "INT. HEADQUARTERS FEAR What’s going on? INT. STAGE B - CLASSROOM SET Joy and Sadness run around, Joy licking students and barking. Through the reality distortion they look like a happy puppy. Joy looks at the sleep indicator: Riley is still asleep. INT. RILEY’S ROOM - CONTINUOUS Riley is sound sleep. INT. STAGE B - CLASSROOM SET JOY (to Bing Bong) Psst. You’re on! Go! Bing Bong pulls a rope. Balloons drop! A colorful backdrop! JOY (CONT’D) Woo! Let’s party! Let’s dance. Woo! INT. HEADQUARTERS FEAR Hey, a party! INT. RILEY’S ROOM Riley is still sound asleep. INT. STAGE B - CLASSROOM SET On stage, Joy and Sadness run in circles, barking. SADNESS Joy, this isn’t working. Bing Bong knocks over a light, causing spooky uplighting. Sadness tries to stop.   The dog costume RIPS IN HALF. INSIDE OUT   91 .",
      "characters": [],
      "action_text": "INT. HEADQUARTERS Fear does a spit take. On screen, a real dog is in two pieces. INT. STAGE B - CLASSROOM SET Joy runs after Sadness. JOY Huh? Sadness, what are you doing?! Come back here! INT. HEADQUARTERS On screen, the front half of a dog chases the rear half. FEAR It’s just a dream, it’s just a dream, it’s just a dream... INT. RILEY’S ROOM Riley stirs in her sleep. INT. STAGE B - CLASSROOM SET DREAM DIRECTOR They’re trying to wake her up! Call security! INT. HEADQUARTERS Bing Bong appears on screen. BING BONG (O.S.) Hi Riley, it’s me! Who’s your friend who likes to play? Bing Bong, Bing Bong! FEAR Bing Bong? INT. STAGE B - CLASSROOM SET Bing Bong slips, tipping over the set wall. INSIDE OUT   92 . JOY Sadness! You are ruining this dream! You’re scaring her! SADNESS But look, it’s working! The SLEEP INDICATOR is starting to tip. Joy’s eyes widen. JOY Whoa! But before she can do anything, Security enters. DREAM DIRECTOR (to Security) They are not part of this dream! Get them! Sadness pulls Joy out of harms way as guards GRAB Bing Bong. DREAM PRODUCTIONS COP #1 Stop right there! BING BONG Ow! Hey! DREAM DIRECTOR (to camera operator) Pan away! Pan away! The camera pans away to Rainbow Unicorn making off with a giant cupcake platter from the craft services table. INT. HEADQUARTERS FEAR Booooo! Pick a plot line! INT. STAGE B - CLASSROOM SET Joy and Sadness watch as guards haul off Bing Bong. EXT. STAGE B Joy and Sadness exit Stage B. BING BONG (O.S.) Ow! Ow! Cut that out. Ow! Please... you can’t do this! (MORE) INSIDE OUT   93 . Do you like candy? You look hungry. I can get you candy! Please! Ow. Ow. Ow. Joy and Sadness watch Bing Bong being dragged far off to the dark, menacing entry of SUBCONSCIOUS. JOY No, no no no, there go the core memories...! The door opens. SPOOKY LIGHT spills out. BING BONG I can’t go in there. I’m scared of the dark. Please! He’s thrown in and the door SLAMS SHUT. Joy and Sadness head after him, down the long stairway. EXT. SUBCONSCIOUS STAI",
      "dialogue_count": 0,
      "word_count": 1190
    },
    {
      "scene_number": 13,
      "slugline": "INT. STAGE B The set begins to shake. BLAAAM! Jangles crashes in. JANGLES WHO’S THE BIRTHDAY GIRL?!?! INT. HEADQUARTERS Fear SHRIEKS, bashes a button and passes out. INT. RILEY’S ROOM - NIGHT Riley bolts upright in bed. INT. STAGE B The meter reads “AWAKE.” Joy and Sadness do a happy dance. BING BONG Come on, let’s go! They bolt, leaving Jangles gleefully demolishing the sets. EXT. TRAIN STATION - MOMENTS LATER Our trio leap aboard just as the train picks up speed. JOY Ha ha! We made it!   * SADNESS Whoo-hoo! Ha ha!   * JOY Guess who’s on their way to Headquarters?! Joy grabs Sadness and picks her up in celebration. SADNESS We are! INT. RILEY’S ROOM - NIGHT Riley sitting up in bed after being scared awake. INT. HEADQUARTERS - MORNING Anger and Disgust come out looking tired, rumpled... INSIDE OUT   99 .",
      "characters": [],
      "action_text": "DISGUST What is going on? ANGER He did it again. FEAR (huddled on the floor) We were at school, and we were naked, and there was a dog, and his back half was chasing him... and then we saw Bing Bong. ANGER You idiot! It was a DREAM! This is ridiculous, we can’t even get a good night sleep anymore. Time to take action. He goes and gets the Idea Bulb he held up earlier. ANGER (CONT’D) Stupid Mom and Dad. If they hadn't moved us, none of this would've happened. Who’s with me? Fear stammers nervously. Anger looks to Disgust. DISGUST Yeah, let's do it. Anger plugs the Idea Bulb in. INT. RILEY’S ROOM - NIGHT Riley gets the idea. She takes out her computer. INT. HEADQUARTERS ANGER She took it. There’s no turning back. DISGUST So, how’re we gonna get to Minnesota from here? ANGER Well, why don’t we go to the elephant lot and rent an elephant? INSIDE OUT   100 . FEAR Hey! That sounds nice! ANGER We're taking the bus, nitwit! INT. RILEY’S ROOM - NIGHT On her laptop, Riley pulls up the Transway Bus Lines website. INT. HEADQUARTERS ANGER There’s a bus leaving tomorrow. Perfect. DISGUST A ticket costs money. How do we get money? ANGER Mom’s purse. DISGUST You wouldn’t. ANGER Oh, but I would. Where was it we saw it last? He punches up a memory. It comes up and plays. GUM MEMORY (O.S.) Tripledent gum will-- ANGER NOOOO!!! (slams his fist, canceling the memory) It’s downstairs somewhere. Mom and Dad got us into this mess. They can pay to get us out. INT. RILEY’S ROOM - NIGHT Riley’s face grows angry. EXT. MIND WORLD - MORNING The train speeds ahead. The trio look out the train door. INSIDE OUT   101 . BING BONG How about this, huh? Isn’t this nice? You can see everything from up here! Look, there's Inductive Reasoning. There's Deja Vu. There's Language Processing! There's Deja Vu. There's Critical Thinking! There's Deja Vu. Hey look at this, guys! Memories! Bing Bong ducks inside the train. Joy looks over to Sadness. JOY Hey, that was a good idea. About scaring Riley awake. You’re ",
      "dialogue_count": 0,
      "word_count": 959
    },
    {
      "scene_number": 14,
      "slugline": "INT. HEADQUARTERS Fear is driving. FEAR Wait, wait, hang on, guys. Are we really doing this? I mean, this is serious. Anger pushes Fear aside and works the console. ANGER (O.S.) Look. We have no core memories. You want Riley to be happy? Let’s get back to Minnesota and make more. INT. RILEY’S ROOM Riley’s worried face goes angry. She packs and exits. EXT. LONG-TERM MEMORY CLIFFS SADNESS If we hurry, we can still stop her. (points) JOY Family Island. Let’s go! The trio run along the cliff edge towards the last island. INT. SAN FRANCISCO HOUSE - STAIRWAY - DAY Riley walks downstairs. EXT. LONG-TERM MEMORY CLIFFS Family Island shakes and crumbles. SADNESS Joy! Joy! It’s too dangerous! We won’t make it in time! JOY But that’s our only way back! The rumbling causes an END CAP of a nearby shelf to break, exposing an open tube.   A memory gets sucked up and shot towards Headquarters. INSIDE OUT   105 .",
      "characters": [],
      "action_text": "JOY (CONT’D) A recall tube! SADNESS We can get recalled! They run towards it. INT. SAN FRANCISCO HOUSE - DAY Riley goes to the front door. Mom and Dad are in the kitchen. MOM Have a great day, sweetheart. DAD See you after school, monkey. MOM We love you! Riley doesn’t respond. She turns and walks out the door. EXT. LONG-TERM MEMORY CLIFFS Family Island rumbles. A LARGE CHUNK of cliff edge breaks off behind them, driving Joy and Sadness forward. JOY Go! Run! RUN! Joy steps into the disconnected TUBE, ready to sail up to Headquarters. Sadness tries to climb in, but there’s not enough room; she jostles, pressing against the satchel. The CORE MEMORIES start to turn blue. JOY (CONT’D) Woah woah! Sadness! (pushing her back) Sadness, stop! You’re hurting Riley! Joy pulls a core memory from the satchel. It is BRIGHT BLUE, but slowly fades back to normal. SADNESS Oh no, I did it again... INSIDE OUT   106 . JOY If you get in here, these core memories will get sad! Joy watches FAMILY ISLAND crumble. She looks down at Sadness. Joy, pained, decides. JOY (CONT’D) I’m sorry. Riley needs to be happy. She pulls the tube closed and starts up alone. Sadness and Bing Bong watch, betrayed and despondent. Joy looks guilt-ridden, but looks on towards Headquarters. Suddenly, the cliffside rumbles. Joy’s tube BREAKS. Joy FALLS! Bing Bong runs forward to help her, but the ground beneath him crumbles away. Joy and Bing Bong tumble into the abyss. SADNESS Joy!!! EXT. SAN FRANCISCO ALLEY - DAY Riley walks off into the fog. EXT. MEMORY DUMP - MOMENTS LATER Joy falls, clutching the satchel of core memories. She lands hard, rolling down a hill of faded memories. She sits up, looks around. The satchel! All the memories are still there. Panicked, Joy runs up the hills of memories. Off in another part of the dump, Bing Bong comes to. BING BONG Joy? Bing Bong notices his hand beginning to fade. He gasps. BING BONG (CONT’D) Joy! He finds Joy desperately clawing her way up the hill. INSIDE OUT   107 . ",
      "dialogue_count": 0,
      "word_count": 1320
    },
    {
      "scene_number": 15,
      "slugline": "EXT. SAN FRANCISCO STREET - EVENING Riley walks through a sketchy part of the city. INT. HEADQUARTERS FEAR This is terrible. Wait. Is that someone walking towards us? Let’s cross the street. Riley’s cell phone rings. MOM is calling. INT. HEADQUARTERS FEAR It's Mom! She's on to us! Where's my bag? Fear finds a paper bag and breathes into it to calm himself. DISGUST What do we do? ANGER Riley needs to get core memories. We keep going. EXT. SAN FRANCISCO STREET - CONTINUOUS Riley ignores the call and walks on. EXT. LONG-TERM MEMORY Joy runs through the Long-Term Memory stacks. JOY Sadness! She sees Family Island rumble, pieces beginning to break off. She frantically continues on. EXT. BUS DEPOT - EVENING Riley walks into the bus depot. INSIDE OUT   112 .",
      "characters": [],
      "action_text": "EXT. LONG-TERM MEMORY Joy runs through a long corridor. JOY Sadness? Sadness? (no answer; desperate) C’mon Sadness, where are you? Okay. If I were Sadness, where would I be? Joy slumps to the ground. She kicks a leg up in the air. JOY (CONT'D) (Sadness voice) Ohhh... everything is awful and my legs don’t work and you have to drag me around while I touch all the-- Joy stops. Something has caught her eye. REVEAL: a path of blue memories on the bottom shelves. Joy follows the path. EXT. BUS DEPOT - MOMENT LATER Riley walks out of the bus depot and into the advancing line. Her cell phone rings again: “Mom.” INT. HEADQUARTERS Fear breathes faster into his paper bag. DISGUST Oh no. It’s Mom again. What do we do?! ANGER Uh... Uh... Boom! Family Island rumbles behind them. QUICK INTERCUTS between the line getting shorter, Riley declining Mom’s call, and Family Island crumbling. Finally... INT. HEADQUARTERS Fear’s bag POPS. INSIDE OUT   113 . ANGER This is madness! She shouldn’t run away! DISGUST Let’s get this idea out of her head. They rush to unplug the idea. INT. LONG-TERM MEMORY Joy runs, following the path of blue memories. JOY Sadness! Joy rounds a corner and spots Sadness far down the next row. JOY (CONT’D) Sadness! Sadness turns around. SADNESS Joy? Inexplicably, Sadness turns and runs away. JOY Wait, Sadness! Joy chases after her. Sadness doesn’t stop. SADNESS Just let me go! Riley’s better off without me! Joy follows Sadness straight into... INT. IMAGINATIONLAND, FRENCH FRY FOREST Sadness topples giant french fries in Joy’s path. JOY Come back! Joy uses a super-long fry to vault over the mound of fries. INSIDE OUT   114 . INT. IMAGINATIONLAND, CLOUD TOWN Two MIND WORKER COPS are questioning a CLOUD WITNESS. MIND WORKER COP #1 So you’re saying your husband was blown away by an elephant. The Cloud Witness nods. Sadness runs past the crime scene. They don’t notice. MIND WORKER COP #1 (CONT’D) Was he with anyone? CLOUD WITNESS Yes! And there she is! Joy runs right thr",
      "dialogue_count": 0,
      "word_count": 1446
    },
    {
      "scene_number": 16,
      "slugline": "INT. HEADQUARTERS The Emotions watch the screen in anticipation. EXT. SAN FRANCISCO STREET - NIGHT Riley runs back towards home. INT. SAN FRANCISCO DINING ROOM - NIGHT Mom sits at the table, on the phone. Dad hovers. MOM (on phone) Alright. Thank you. We will. (to Dad) Her teacher hasn’t even seen Riley all day. DAD What? I can't believe this. MOM What was she wearing last? Do you even remember what-- The door opens. Riley walks in. They rush over to her. MOM (CONT’D) Riley! DAD Riley, there you are! Thank goodness! MOM Oh, we were worried sick! Where have you been? It’s so late... INT. HEADQUARTERS Sadness drives. Joy walks to her, holding the golden core memories.   She hands them over to Sadness. The core memories turn BLUE. Sadness places one in the recall unit. THE MEMORY PLAYS ON SCREEN: Young Riley and young Meg walk side by side. INSIDE OUT   122 .",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 156
    },
    {
      "scene_number": 17,
      "slugline": "INT. SAN FRANCISCO DINING ROOM - CONTINUOUS Riley remembers. INT. HEADQUARTERS Sadness places another blue memory in the recall unit. MEMORIES PLAY ON SCREEN: Young Riley makes cookies with Mom and Dad. Riley runs around with underpants on her head, Dad chasing. Riley scores her first goal. Riley skates with Mom and Dad. Sadness places her hand on the console. It turns BLUE. INT. SAN FRANCISCO DINING ROOM Riley cries. RILEY I know you don’t want me to but... I miss home. I miss Minnesota. Mom and Dad, concerned, listen quietly. RILEY (CONT’D) You need me to be happy, but... I want my old friends, and my hockey team... I wanna go home. Please don’t be mad. MOM Oh sweetie... DAD We’re not mad. You know what? I miss Minnesota too. I miss the woods where we took hikes. MOM And the back yard where you used to play. DAD Spring Lake, where you learned to skate. Riley cries harder. DAD (CONT’D) Come here. INSIDE OUT   123 .",
      "characters": [],
      "action_text": "He pulls Riley towards them.   The three hug. INT. HEADQUARTERS Joy steps forward with one more gift for Sadness: the blue core memory. Sadness pulls Joy by the hand and places it on the console. INT. SAN FRANCISCO DINING ROOM Still in an embrace, Riley smiles through her tears. INT. HEADQUARTERS BING! Joy and Sadness hear the sound of a new memory being produced. It’s a NEW CORE MEMORY: BLUE AND GOLD, swirled together. A first. The Emotions react in awe. The memory travels down the track and into the holder. A lightline extends out the back of Headquarters. It is a new FAMILY ISLAND, bigger than before. Joy and Sadness turn back to the console together. INT. SAN FRANCISCO DINING ROOM Riley, Mom and Dad embrace. INT. HEADQUARTERS Watching the screen, Joy rests her head on Sadness. They’re a team. INT. HEADQUARTERS - DAYS LATER We see many new, multicolored core memories in the Core Memory Holder. The Emotions admire the new Islands of Personality. FEAR Hey, I’m liking this new view. INSIDE OUT   124 . ANGER Friendship Island has expanded. Glad they finally opened that Friendly Arguments section. SADNESS I like Tragic Vampire Romance Island. DISGUST Fashion Island. Everyone shut up! FEAR Boy Band Island. Hope that's just a phase. JOY Say what you want, I think it’s all beautiful. WORKER FRITZ Alright! The Emotions turn to see workers at a new, larger console. WORKER FRITZ (CONT’D) There you go. Your new expanded console is up and running. The new console lights up. JOY/SADNESS/FEAR/ANGER/DISGUST Whoa! DISGUST Cool. Upgrade! JOY Ooohh. Fear leans on the console. BEEP! FEAR Hey! Whoa! Whoops, wait. Did I just do that? DISGUST (re: a warning light label) Hey guys? What’s “pub-er-ty?” JOY I don’t know. It’s probably not important. INSIDE OUT   125 . ANGER Whoa. I have access to the entire Curse Word Library! This new console is the sh-- BEEP! FEAR Sorry. I did it again. My bad. DISGUST (pointing to screen) They’re getting to the rink! EXT. HOCKEY RINK - DAY The same rink",
      "dialogue_count": 0,
      "word_count": 1044
    }
  ]
}