{
  "slug": "insidious-chapter-2-2013",
  "title": "insidious chapter 2",
  "genre": "horror",
  "format": "film",
  "scenes_count": 19,
  "characters_count": 0,
  "characters": [],
  "total_words": 21918,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. LIVING ROOM, LORRAINE’S HOUSE - NIGHT Elise re-enters, pacing the living room to the front door. YOUNG JOSH Colder... Elise wanders over to the stairwell. YOUNG JOSH (CONT’D) Warm... She takes a step, then another, marching up the stairs. INT. UPSTAIRS CORRIDOR, LORRAINE’S HOUSE - CONTINUOUS Elise gapes into the darkened hall that yawns in front of her. YOUNG JOSH (V.O.) (from walkie) Warmer. She passes a door. She opens it - it is Lorraine’s bedroom. INT. LORRAINE’S BEDROOM, LORRAINE’S HOUSE - CONTINUOUS Elise leaves the light off, stalking through the dark. YOUNG JOSH (V.O.) (from walkie) Cold. INT. CORRIDOR, LORRAINE’S HOUSE - NIGHT Elise steps back into the corridor. At the end of the hall is a door decorated with colorful stickers. The door is ajar. A light is on inside. Elise is drawn to the door, hesitating in front of it. YOUNG JOSH (V.O.) (from walkie) Very warm. Elise prods the door. It keens as it opens. The cluttered room of a pre-teen boy greets her. INT. YOUNG JOSH’S BEDROOM, LORRAINE’S HOUSE - CONTINUOUS Elise troops inside. She scans the room. It is devoid of life. A bedside lamp provides the only light.  7. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library",
      "characters": [],
      "action_text": "Elise floats to the window, peering through. She stoops down and lifts the bed sheets...unveiling the mess under the bed. YOUNG JOSH (V.O.) (from walkie) Cold. The closet door behind her CREAKS as it moves outwards slightly. Elise turns to face the closet. Steps towards it. YOUNG JOSH (V.O.) (from walkie) Hot... Elise treads closer. YOUNG JOSH (from walkie) Hotter... She draws the closet doors open. A row of baseball jersey’s dangle on coat-hangers inside it. YOUNG JOSH (V.O.) (CONT’D) (from walkie) Very hot. Elise cleaves the row of clothes in half. She gropes outwards, reaching into the pitch dark space beyond the coat hangers. Slowly. INT. LIVING ROOM, LORRAINE’S HOUSE - SAME TIME Josh JOLTS, still in a trance. He turns, eyes still closed, facing into the far corner of the room, into the shadowy corners where the drapes are. YOUNG JOSH This door stays locked until I come out of my shell. CLICK. The camera rolls out of film. A garbled, whispered voice spits out of the walkie. Carl holds it to his ear, listening. It’s Elise. Her whispering is barely audible, distant.  8. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library ELISE (V.O.) (from walkie) ...what do you want?...why? Lorraine carefully approaches Josh. Bends in front of him. LORRAINE Honey? Are you okay? Honey? ELISE No. He’s not okay. Lorraine whips around to see Elise, descending the stairs. LORRAINE What did you see? ELISE I saw what haunts him. LORRAINE What was it? ELISE It was a parasite. I spoke to it. LORRAINE What does it want? ELISE It wants to be him. (beat) Your son has a gift, Miss Lambert. When he sleeps at night, he is able to explore another world. But it can be a dangerous gift. He can attract the attention of the darkest part of that world. LORRAINE What can you do to stop it? ELISE I could wipe his memory of his gift. Make him forget how to visit that world. Lorraine turns to face her boy, still in a trance state. Her fea",
      "dialogue_count": 0,
      "word_count": 998
    },
    {
      "scene_number": 2,
      "slugline": "INT. LIVING ROOM, NEW HOUSE - NIGHT (FLASHBACK) Renai scurries into the living room. She is confronted by the frozen death mask of Elise, stock-still on the couch. With horror, Renai seizes a flashlight and flits down the corridor. RENAI (O.S.) Josh! Josh! Renai returns to the living room. She rakes up a digital camera from the floor. An image an Old Woman is burned into the viewing window. Renai GASPS, her hand flying to her mouth. Another hand grips her shoulder from behind. JOSH (O.S.) Renai...I’m right here. Renai STARTS, wheeling around. She sees Josh, dread in her tear-brimmed eyes. She reels away from him. RENAI No! Josh is alarmed by her fear. JOSH What? What?! Renai keeps backing away. His mother, LORRAINE, and son, DALTON, run into the room, startled by Renai’s screaming. LORRAINE Renai? Renai says nothing - just points to Elise. Josh locks his eyes on Elise, his face dropping. He seems horrified. JOSH Oh Jesus...Elise... He rushes to her. JOSH (CONT’D) Mom, get Dalton out of here! Lorraine shields him, hustling him out of the room, returning quickly. She squats next to Josh, feeling Elise for a pulse. JOSH (CONT’D) No...no...call an ambulance!  12. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library",
      "characters": [],
      "action_text": "LORRAINE She’s gone. JOSH She could be -- LORRAINE She’s dead. Josh seems like he might faint. He staggers back, then looks up at Renai. Her eyes are locked on him. JOSH Why are you looking at me like that, Renai? She backs against the wall. JOSH (CONT’D) You think that I did this? (beat) Why are you looking at me like that? Renai holds out the digital camera, showing him the pixilated image of the Old Woman. Josh takes the camera, stunned. RENAI It’s Elise’s camera. It was by her feet. That’s the last picture she took. JOSH Oh my God...this face. I know this face. (beat) This is the face that haunted me as a child. INT. INTERVIEW ROOM, POLICE STATION - DAY (PRESENT) Sendal studies Renai intensely. Her every twitch. SENDAL So he claims he was out of the room when it happened? RENAI Yes. SENDAL Do you believe him?  13. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library RENAI He’s my husband. SENDAL That’s not what I asked. RENAI Yes, detective. I believe him. SENDAL You know, ninety per cent of detective work is looking for nose hairs at a crime scene. The rest is people watching. I have to say, your body language right now tells me that you don’t believe him. RENAI There were...strange things happening in our house that night. SENDAL I’m not interested in ghosts, Mrs. Lambert. I’m interested in the living people who create ghosts. Sendal pushes the file aside, sitting back. SENDAL (CONT’D) It’s been a long night, so I’m going to end it there for now. But you should know that our forensics team has already claimed a result from the fingerprints on Elise’s neck. Renai holds her breath. SENDAL (CONT’D) The fingerprints did not match your husband’s. EXT. CEMETERY - DAY The sun flares down on a large congregation of mourners. They are gathered around an open grave. A casket is lowered into the grave. Lorraine, Josh, Renai and Dalton hover over it. Renai cradles Cali, and FOSTER slinks behind Josh, who is",
      "dialogue_count": 0,
      "word_count": 4623
    },
    {
      "scene_number": 3,
      "slugline": "INT. SPARE BEDROOM, LORRAINE’S HOUSE - MORNING Renai opens her eyes. She is alone in bed. Josh and Cali are gone. She glances at the alarm clock - it reads 10:07 AM. Renai sits upright, listening. Hears voices outside. INT. KITCHEN, LORRAINE’S HOUSE - MORNING Renai shuffles through the door. Through the kitchen window she sees JOSH, playing with Foster in the backyard. Josh is on his knees, pushing trucks around. Renai smiles. Dalton zombie-walks into the kitchen, tired. He sits at the kitchen table, eyes down. He looks afraid. RENAI Morning honey. What do you want for breakfast? She kisses the top of his head. He doesn’t react. RENAI (CONT’D) Come on, it’s the weekend. You get to have whatever you want. Take advantage of this one-time only opportunity. DALTON I don’t care. Renai turns to him, concerned. Sees the fear on his face. RENAI What’s wrong, honey? Still no answer. Renai sits opposite him. RENAI (CONT’D) Are you okay? (beat) Come on, you can tell me. What’s the matter? DALTON I had a bad dream. A look of real fear ripples across Renai’s face. Dalton’s bad dream has far deeper implications after all that’s happened.  33. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library",
      "characters": [],
      "action_text": "RENAI I’m sorry. What did you dream about? DALTON I dreamt that...I was in my bed at night and Grandma walked in. INT. YOUNG JOSH’S BEDROOM, LORRAINE’S HOUSE - NIGHT (DREAM SEQUENCE) The bedroom is dark. Foster is fast asleep. Dalton lies in his bed, eyes open, facing the ceiling. Lorraine steps inside the room, easing onto the edge of his bed ( we are seeing a repeat of last night’s scene ). Dalton stares at her, paralyzed. She leans over and pecks his arm with a kiss. Seems not to know that Dalton is awake. LORRAINE Please don’t leave us again. From Dalton’s POV, we see a figure STANDING BEHIND Lorraine, draped in shadow. Dalton’s eyes are FILLED WITH TERROR. DALTON (V.O.) I could see someone else in my room. I told her. DALTON There’s someone standing behind you, Grandma. Lorraine turns her head, flooded with fear. The figure leaves the room. Lorraine sees that no one is there and then exits herself. DALTON (V.O.) I got up to look for the person who was in my room. Dalton creeps out of bed. INT. CORRIDOR, LORRAINE’S HOUSE - NIGHT (DREAM SEQUENCE) Dalton tip-toes down the corridor. A figure stands at the end of the hall - the same shadow he saw in his room. Dalton gets nearer, the silhouette sharpening into clarity. It is JOSH.  34. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library DALTON (V.O.) It was daddy. He was the one in my room. He was talking to someone. Josh does not see Dalton. He is talking to another figure, someone we cannot see or hear - only Josh’s responses. JOSH Yes...I understand...I will, I promise. The figure talking to Josh leans in and whispers something in Josh’s ear. We see that the figure is a woman - THE SAME WOMAN Lorraine saw. Josh turns and faces Dalton, eyes burning with rage. DALTON (V.O.) Then daddy saw me and he came after me. Josh charges down the hallway towards Dalton, a look of fury etched on his face. Dalton retreats, scrambling backwards down the hall. INT. ",
      "dialogue_count": 0,
      "word_count": 3144
    },
    {
      "scene_number": 4,
      "slugline": "INT. BATHROOM, LORRAINE’S HOUSE - NIGHT Possessed Josh enters, leaning into the mirror and prying his lip up, examining the crater in his gum where the tooth was. He looks down at the tooth in his palm. As he does, he curls his fingers around it. The fingernails are yellowing. Parched. With TERROR, he turns his hand over. The skin is withered, wrinkled. Not to an alarming degree, but enough for someone this close to notice it. His fingerprints are different. These are not the hands of a young man, but the aging hands of the elderly. He eyes the mirror. Sees a patch of GREY HAIR at his temple. POSSESSED JOSH No...not yet. Not yet. Please no... EXT. OUR LADY OF THE ANGELS HOSPITAL - NIGHT This hospital has been around for a hundred years, but many additions have modernized it. INT. FRONT DESK, OUR LADY OF THE ANGELS HOSPITAL - NIGHT A normal, bustling hospital. Lorraine waits with Specs, Carl and Tucker at the reception station. A man in surgeon’s scrubs approaches. This is IAN NANKERVIS (52), a longtime resident of this hospital. IAN Hey stranger. LORRAINE Hey yourself. They hug. LORRAINE (CONT’D) You look great, Ian. IAN Thanks. Who knew that exercise had its benefits, huh? LORRAINE These are my friends Steven, Tucker and Carl  47. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library",
      "characters": [],
      "action_text": "Ian shakes hands with them all. IAN I was pretty intrigued by what you said on the phone. LORRAINE Well, was I right? Most of my work was in the East Wing right? IAN Right, but it’s all closed now. For two years. Eventually they’re demolishing it, if they ever get their act together, and they’re putting up a whole new building. LORRAINE So we could we take a look around? IAN Let me get security up here. You’ll need a someone with you, but I don’t see why not. INT. EAST WING OF HOSPITAL - NIGHT This section of the hospital has been closed and emptied out. There are scattered pieces of equipment, but the halls are eerily empty. Trash and dust everywhere, a place neglected. Lorraine, Specs, Carl and Tucker wander down the hall with a Hispanic SECURITY GUARD, JESUS (38). JESUS You can take a look around, just be careful, there’s some rough spots. LORRAINE Thanks. Jesus stays behind at the nurses station, and the trio keep ambling down the long corridor, poking their heads into various abandoned rooms. They round a corner, losing sight of Jesus. LORRAINE (CONT’D) I don’t know what we’re looking for.  48. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library SPECS Now that we’re here, forget the actual hospital and think about the name Philip. LORRAINE I mean, I saw hundreds, thousands of patients. It’s impossible to pick out a name like that. They wander, Specs and Tucker splitting off, examining different rooms. Some sunlight streams in, but there are also darker sections without windows. We stay with Lorraine and Carl as they roam the halls. They round a corner, facing another long corridor. They shuffle down it. Lorraine is melancholy, flooded with memory. LORRAINE (CONT’D) This is kind of overwhelming. I walked up and down these hallways for a long time, spending every minute of my day trying to keep people from dying. I thought I was doing good. (beat) Now I’m under attack from the other side. From the",
      "dialogue_count": 0,
      "word_count": 936
    },
    {
      "scene_number": 5,
      "slugline": "INT. PATIENT ROOM 2 - DAY (FLASHBACK) An older man lies on the bed, asleep. This is PHILIP (50s). Lorraine indicates to Josh to keep quiet, checking the chart at the end of the bed. Josh fiddles, bored. He approaches the sleeping man, then glances over the personal belongings piled beside the bed. There is a FRAMED PHOTO of a WOMAN (60’s). She stares into the camera with a vacant, spectral glare. THIS IS THE WOMAN THAT SLAPPED RENAI. Josh giggles. LORRAINE Shhh. Lorraine gives him the death glare, then busies herself with his chart. Josh turns his attention back to the photo. YOUNG JOSH This lady looks weird. IN THE SAME SHOT, he turns back to the sleeping patient -- -- suddenly FACE TO FACE with Philip! He is sitting up in bed, scowling at Josh, inches from his face! Josh SCREAMS. PHILIP Her name is Michelle! Josh WAILS as Lorraine rushes to separate them. Lorraine struggles to pry his fingers away. Another male nurse rushes in, pinning the patient down. PHILIP (CONT’D) She wouldn’t let me leave!! I was just a boy! The crazed patient keeps his eyes fixed on YOUNG JOSH as he screams, spittle flying. The nurse injects him and he calms slowly. INT. PATIENT ROOM - DAY (PRESENT) Lorraine shakes the memory off. Specs and Tucker wander in.  51. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library",
      "characters": [],
      "action_text": "SPECS Anything? LORRAINE I had a patient in here once. In this room. I remember I brought Josh into work with me one day and this man, this patient of mine, he screamed at Josh. TUCKER When was this? LORRAINE It was...right around the time Josh started having nightmares. TUCKER Do you remember anything about him? LORRAINE He had cut himself. At first, he said it was an accident. We suspected that he did the cutting himself. CARL What happened to him? Lorraine glares down at the bed. LORRAINE A few days later I saw him again. FLASHCUT TO: INT. ELEVATOR, OUR LADY OF THE ANGELS - DAY (FLASHBACK) Lorraine rushes for the elevator, grabs it just in time. She depresses the button for the lobby. It lurches and descends. She pivots and claps eyes on the ELDERLY MAN WHO SCREAMED AT JOSH, PHILIP. He is the only other person on the elevator. He stares at Lorraine with eerily unblinking eyes. LORRAINE Good to see you. Feeling better I see, up and about. PHILIP Yes.  52. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library LORRAINE That’s good. Are you checking out? PHILIP Yes, I am. LORRAINE Well, great. That’s good. PHILIP I very much enjoyed meeting you. And your son. LORRAINE I’m sorry about everything that happened with him. He was being a nosy kid. I shouldn’t have brought him on my rounds. PHILIP That’s quite alright. I have a temper. I’d like to make it up to him. Lorraine gives an uneasy look, masked with a smile. LORRAINE He’s okay. He’s learned his lesson. PHILIP What I wouldn’t give to be his age again. LORRAINE Wouldn’t we all? PHILIP To have that bedroom filled with toys, and all those finger paintings on the wall. Lorraine’s smile fades a little. The elevator stops and the doors open. LORRAINE How did you...? Philip alights the elevator, walking away into the corridor. INT. FRONT DESK, OUR LADY OF THE ANGELS HOSPITAL - DAY(FLASHBACK) Spooked, Lorraine navigates the crowd to the nurses station at the ",
      "dialogue_count": 0,
      "word_count": 946
    },
    {
      "scene_number": 6,
      "slugline": "INT. LIVING ROOM, LORRAINE’S HOUSE - NIGHT The front door opens and Renai enters with Foster and Dalton. Josh appears from the kitchen. FOSTER Dad! POSSESSED JOSH Hey buddy, come here. Foster scrambles to him and they hug. POSSESSED JOSH (CONT’D) Did you have fun with mom? FOSTER Yeah. POSSESSED JOSH Did anything exciting happen? FOSTER Hmmm...no. POSSESSED JOSH You sure? Maybe you got in a fight? He playfully wrestles Foster to the floor, attacking him. Foster cackles, loving it. POSSESSED JOSH (CONT’D) I’m gonna eat you! RENAI Stop it, guys. You’ll break something. POSSESSED JOSH Boo. You’re killing our fun. Foster gathers himself up off the floor and sprints away. Josh notices his hand - it is a little wrinkled. He hides it with his sleeve as Renai leaves. Only Dalton is left. POSSESSED JOSH (CONT’D) Hey son. DALTON Hey dad.  56. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 156
    },
    {
      "scene_number": 7,
      "slugline": "INT. KITCHEN, LORRAINE’S HOUSE - NIGHT Renai tidies up. She seems a million miles away, lost in her own thoughts. Possessed Josh enters, hugging Renai from behind. RENAI Your mom hasn’t come home. POSSESSED JOSH I know. RENAI I’m worried. POSSESSED JOSH Don’t be. He rubs her stomach, kissing her neck and her ear. RENAI This isn’t... POSSESSED JOSH This isn’t what? A sly smile breaks out on her face. He leads her away. INT. SPARE BEDROOM, LORRAINE’S HOUSE - NIGHT Possessed Josh and Renai push into the bedroom, closing the door behind them. They fall back onto the bed. Renai giggles. Possessed Josh isn’t laughing - he is caught up in the moment. He kisses her neck and her body, growing more intense. RENAI Josh, calm down. He doesn’t, clamping a hand over her mouth and nose. She rips his hand away and sits up. RENAI (CONT’D) What is wrong with you? POSSESSED JOSH What? Forgive me for wanting to have sex with my wife. RENAI I can’t breathe when you do that.  57. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library",
      "characters": [],
      "action_text": "POSSESSED JOSH You’re going to leave me here like this? RENAI It’s your own fault. POSSESSED JOSH You know, I’m getting tired of you, Renai. You have your son back and you’re still not happy. You skulk around here all day like a miserable, ungrateful bitch. RENAI That’s because these things... they’re never going to leave us alone. We’re surrounded by ghosts. (beat) It’s like we’re already dead. POSSESSED JOSH No. It’s not. This house, this light, it’s nothing like being dead. I know. I know what it’s like where these things exist. I’ve seen it. They want what you have - life. That’s all they want. There is a grim certainty to Josh’s words that scares Renai. POSSESSED JOSH (CONT’D) So you have no idea how much you’re wasting your life by being afraid of them, because very soon...you’ll be one of them. And you’ll realize you should’ve been happy for your brief little moment in the sun. RENAI Well, unlike you, I’m not thinking about myself. I’m thinking about our kids. In case you’ve forgotten, one of those things nearly took our boy from us. And they’re still here and I’m scared to death they’re going to try and do it again. (beat) So forgive me if I can’t enjoy the sunshine with you, but from where I’m standing, things still look pretty dark. She leaves, slamming the door.  58. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library",
      "dialogue_count": 0,
      "word_count": 432
    },
    {
      "scene_number": 8,
      "slugline": "EXT. LORRAINE’S HOUSE - NIGHT The house is dark. INT. KITCHEN, LORRAINE’S HOUSE - NIGHT The monotonous rhythm of a dripping faucet. INT. LIVING ROOM, LORRAINE’S HOUSE - NIGHT Curtains lull in a breeze. INT. YOUNG JOSH’S BEDROOM, LORRAINE’S HOUSE - NIGHT Lights out. Dalton and Foster sleep like the dead. CLOSE ON DALTON - his eyelids twitch. A voice slithers out of the darkness, barely audible. VOICE (O.S.) Dalton... Dalton rouses. VOICE (O.S.) (CONT’D) Dalton, wake up. Dalton opens his eyes. Listens. VOICE (O.S.) (CONT’D) Dalton... Dalton turns and sees the CUP that Foster fashioned a phone out of, resting on his pillow near his head. The voice is coming from the cup. VOICE (O.S.) (CONT’D) (from cup) Dalton... Perturbed, Dalton scoops up the cup, annoyed to be woken. He sits up, squinting across the room at Foster, unable to see him. It’s too dark. He speaks into the cup. DALTON (INTO CUP) What?  59. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library",
      "characters": [],
      "action_text": "He presses his ear to the cup. VOICE (O.S.) (from cup) I want to show you something. Dalton clamps his flashlight, aiming it at Foster’s bed and flicking it on. He sees that Foster is FAST ASLEEP. With dread, Dalton traces the flashlight beam down to the string that leads from his cup. It trails along the floor...Dalton keeps following it...all the way to... ...the closet. The string leads up into a GAP in the closet doors. Someone is holding onto the other end inside there. VOICE (O.S.) (CONT’D) (from cup) Dalton... Dalton is a statue of terror - eyes locked on the closet. He finally lifts the cup to his mouth. DALTON (INTO CUP) Who are you? VOICE (O.S.) (from cup) An old friend. DALTON (INTO CUP) What do you want? We CLOSE IN on the closet. Dalton turns his ear to the cup again, straining to hear the sibilant whisper. VOICE (from cup) What’s mine. Dalton turns back to face the closet - and SHRIEKS!!!  Perched on haunches at the end of Dalton’s bed is the RED FACED DEMON who terrified Dalton, leering like a harlequin!  Dalton scrambles backwards, a cry of terror reverberating through the house. He rips the bed sheets over his face.  60. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library The door opens and Renai barrels in, flicking the light on. RENAI Honey, are you okay? What’s wrong?! Dalton tears the sheet away, still numb with fear. Dalton locks eyes with her. Renai stares with mortal dread into her son’s eyes. She hugs him, pressing him tight. Dalton stares over her shoulder. His father enters the room...or what looks like his father. Dalton is afraid of him. EXT. PHILIP’S HOUSE - NIGHT Pale headlights arc across a wrought iron gate. Tucker’s van pulls up outside a neglected estate. An aging mansion looms out of the sable surroundings beyond the gate, at the head of a short driveway. INT. TUCKER’S VAN - SAME TIME Tucker squints at the grounds in front of them. TUCKER Gate’s open. EXT. PHILIP’S",
      "dialogue_count": 0,
      "word_count": 1065
    },
    {
      "scene_number": 9,
      "slugline": "INT. MASTER BEDROOM, PHILIP’S HOUSE - NIGHT Lorraine steps closer. SPECS Josh was haunted by an old woman. Lorraine leans in very close. LORRAINE Not by her. I’d say this woman’s only been dead about three weeks. Maybe a month. She looks about eighty. There is a large locket around her neck. Tucker opens it - inside is a PHOTO. Tucker pries it free. It is a shot of the woman they see with a young boy, around 11. On the back, the words MICHELLE AND PHILIP. CARL This is Michelle. Philip is her son. INT. UPSTAIRS CORRIDOR, PHILIP’S HOUSE - NIGHT The gang cluster back into the hall, approaching another door. INT. PHILIP’S BEDROOM, PHILIP’S HOUSE - NIGHT A large bedroom unveils itself in the pale glow of the flashlights. The room is large, with a soaring ceiling and a fireplace. Toys are gathered in one corner - dozens of dolls and a rocking horse. A bed rests against a window, the sheets decorated with frilly lace. Immaculately made, but sodden with mold. Specs peeks in through the window of a DOLL HOUSE, seeing eerily still figures sitting at a dining table. Carl steps into the center of the room. WHAT NO ONE IN THE GROUP SEES is a PAIR OF EYES staring at the group over a CABINET. Someone is crouching behind it.  64. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library",
      "characters": [],
      "action_text": "CARL This must be Philip’s room. LORRAINE It looks like a girls bedroom. As they face the wall, a TEENAGE GIRL EMERGES FROM behind the cabinet, marching outside the room. They do not see it. The floorboards creak and Carl wheels on the sound. All is then quiet again. Carl approaches the doorway...slowly...slowly... THE TEENAGE GIRL RUNS PAST THE DOORWAY! CARL LEAPS BACK WITH A YELP! He bolts outside the room, following the girl. INT. UPSTAIRS CORRIDOR, PHILIP’S HOUSE - CONTINUOUS The group trample out of the bedroom, following the Teenage Girl. They hear her scampering down the stairs and they follow her -- INT. LIVING ROOM, PHILIP’S HOUSE - CONTINUOUS -- down into the cavernous living room. Furniture is covered. They huddle together, whipping their flashlights around. SPECS Look... They snap their attention to a CAT. Sitting in the center of the living room, STARING AT THE WALL. The cat pays no attention to them, fixated on the wall. CARL What’s she looking at? Tucker sets his case down, pulls his goggles on and steps up to the wall. Through his POV - the bone-white wall flicks between different shades of UV light. CLICK...CLICK...CLICK... Then, in one of the filters - a messy collage of dark HANDPRINTS is SUDDENLY VISIBLE. All of the handprints are concentrated in ONE AREA OF THE WALL. Tucker JOLTS, then lifts the goggles.  65. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library TUCKER There’s something here. Handprints. Tucker and Specs runs their fingers over the wall, finding nothing. Tucker pushes on the wall. A HIDDEN DOOR CLICKS OPEN. Tucker pushes the door open, a vault of air escaping it. A pitch black room lies beyond it. Tucker aims his flashlight into it. Carl steps closer, then staggers back. PALPABLE TERROR blazes in his eyes. CARL No...no...I can’t go in... He falls onto a couch, shaken. Stares up at them. CARL (CONT’D) There’s too much suffering in there. TUCKER It’s okay. We’ll go. ",
      "dialogue_count": 0,
      "word_count": 908
    },
    {
      "scene_number": 10,
      "slugline": "INT. LIVING ROOM, PHILIP’S HOUSE - CONTINUOUS The trio fumble backwards, slamming the door behind them. EXT. PHILIP’S HOUSE - NIGHT They stand outside the house, spooked. Unsure of what to do next. LORRAINE We’ve got to know for sure that something is wrong with Josh before we do anything. CARL I’ll do it. You get him alone in the house, take his wife and kids away. (beat) If I look him in the eye, talk to him...if there’s something wrong I’ll sense it. INT. FRONT DOOR, LORRAINE’S HOUSE - NIGHT The lock jiggles, grunting as it is opened. Lorraine edges inside, keeping quiet. INT. UPSTAIRS CORRIDOR, LORRAINE’S HOUSE - NIGHT Lorraine kicks off her shoes, skittering barefoot down the hallway. She stops herself when she reaches the guest room where Renai and Josh are sleeping. She opens the door. INT. SPARE BEDROOM, LORRAINE’S HOUSE - CONTINUOUS Renai is asleep with Dalton and Foster beside her, her arms curled around Dalton. Josh is not in the bed with them. INT. YOUNG JOSH’S BEDROOM, LORRAINE’S HOUSE - NIGHT Lorraine inches stealthily into the dark bedroom. With each step, the floor CREAKS. She winces. She stands over the slumbering Josh, at the foot of the bed, watching her son.  68. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library",
      "characters": [],
      "action_text": "She leaves.  INT. SPARE BEDROOM, LORRAINE’S HOUSE - NIGHT (THE FURTHER)  Renai twitches in her sleep. We are CLOSE ON her face. She opens her eyes. The room is unnaturally quiet. She sits up, sleepy. Her children are gone. She is alone in bed. RENAI Dalton? Foster? She strains to see in the dripping black around her. Then she sees it - Dalton is standing at the end of the bed. Staring at her. RENAI (CONT’D) Honey? Dalton walks sluggishly around to the side of the bed. He takes Renai’s hand, pulling her out of bed. He leads her through the door.  INT. CORRIDOR, LORRAINE’S HOUSE - NIGHT (THE FURTHER)  Their footsteps do not make a sound as they walk. Dalton leads Renai into the dark. RENAI Where are you taking me? DALTON Into the dark place. He points towards the end of the corridor. DALTON (CONT’D) They’re over there. Renai glares into the dark, seeing Josh, talking to someone, just as Dalton described in his dream. Josh turns and sees Renai. INT. SPARE BEDROOM, LORRAINE’S HOUSE - NIGHT Renai opens her eyes with a start, awakened from her dream. Dalton is lying next to her, as is Foster.  69. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library Fast asleep. INT. SPARE BEDROOM, LORRAINE’S HOUSE - MORNING Possessed Josh opens his eyes. Sunlight streams through the window. He turns over - Renai is gone. INT. BATHROOM, LORRAINE’S HOUSE - MORNING Possessed Josh hobbles into the bathroom, closing the door. He is hunched over, as if his bones were shrinking. With horror, he glares into the mirror at his aging reflection. The grey hair has advanced, wrinkles cutting deeper lines into his face. His skin is pale. His fingers on his left hand are curled inwards. He struggles to straighten them, gritting his teeth as the BONES CRACK. With his other hand, he reaches up and claws a handful of his hair out at his temple, leaving an exposed scalp. Tears come to his eyes. Tears and terror. We PAN PAST HIM -- -- seeing ",
      "dialogue_count": 0,
      "word_count": 697
    },
    {
      "scene_number": 11,
      "slugline": "INT. FRONT DOOR, LORRAINE’S HOUSE - DAY Possessed Josh opens the door, faced with a somber Carl. He has a carry bag slung over his shoulder. POSSESSED JOSH Can I help you? CARL My name’s Carl. I know that you don’t remember me, Josh. Elise and I did our best to make sure of that. POSSESSED JOSH You’re right, I don’t remember you. CARL I haven’t spoken to you since you were a young boy. Your mother called me when you started experiencing...some problems. I worked as a psychic at the time. And I came to your house, this house, and what I saw scared me so badly that I called Elise. (beat) Now Elise is gone. And I know that you were there when she died. So I was wondering if you could help give me some closure? I need it. A long beat...then Possessed Josh steps aside. INT. LIVING ROOM, LORRAINE’S HOUSE - DAY Possessed Josh leads Carl into the living room. CARL Why is it that places always seem so much smaller than we remember them? POSSESSED JOSH Have a seat. Carl does. He studies Possessed Josh. The greying hair and pale skin. CARL Are you feeling okay?  71. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library",
      "characters": [],
      "action_text": "POSSESSED JOSH I’m fine. CARL I suppose I wanted to ask you if you have any idea what happened to her? POSSESSED JOSH No. I don’t. CARL I’m sorry to ask something like that so bluntly, but I want to remind you that I’m not the person who’s going to look at you funny if you tell me something...unusual. Carl removes his glasses. CARL (CONT’D) I’ve seen things with my own eyes that most people have to go to sleep to imagine. POSSESSED JOSH Elise did a great thing. She helped me get my son back. She sent me to a place...I saw faces there that won’t leave my field of vision. It was terrifying, but I got my son back. As he talks, Carl subtly glances down at Josh’s hands. POSSESSED JOSH (CONT’D) Everything was good for about ten minutes. I left the room, and when I came back, Elise was gone. She was strangled. CARL Horrific. POSSESSED JOSH Yes. It was. CARL When you were a boy, you said it was an old woman who haunted you. Did you see that old woman when you were visiting that other world you talked about?  72. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library POSSESSED JOSH No. CARL Okay. (beat) You also said when you were young that you were a big football fan. Are you still? POSSESSED JOSH Yes. Still a fan. Carl nods. He gets up, moving to the wall of photos. As he passes Possessed Josh, Carl grabs his arm. CARL Haven’t lost that arm? POSSESSED JOSH Not one bit. Carl looks into his eyes, then lets go and moves to the wall of photographs. He zeroes in on the SAME PHOTO Elise studied when she first visited this house. When he is out of Possessed Josh’s line of sight, his expression melts into one of fear. POSSESSED JOSH (CONT’D) Would you like a coffee? I’m making one for myself. CARL Sure, absolutely. Possessed Josh leaves the room. When he does, Carl quietly unzips the shoulder bag he is carrying and removes a CAMERA. WHAP!! With sudden, shocking violence, a black garbage bag is wrapped around Carl’s f",
      "dialogue_count": 0,
      "word_count": 2235
    },
    {
      "scene_number": 12,
      "slugline": "INT. SPARE BEDROOM, LORRAINE’S HOUSE - NIGHT The door to the bedroom opens with a groan. The pale light from the hallway reveals Josh fast asleep on the bed. Grimacing with each creak of her footsteps, Renai treads inside the bedroom...very slowly...closing the door behind her. In the darkness, we can BARELY make her out, tip-toeing to the foot of the bed. She waits, holding her breath. She raises the camera, pointing it at Josh. She depresses the trigger. The flash ignites, lighting the whole room. Renai checks the viewing window -- -- AND JOLTS WITH TERROR. On it, she sees an EMPTY BED. Josh is no longer there. Renai backs up in the dark. She holds up the camera again, hitting the button. The flash explodes again. This time on the viewing window, there is a FACE FILLING THE SCREEN - A HYBRID OF JOSH’S FACE AND THE OLD WOMAN’S (there is less of the Old Woman transposed over his face than there was before - SHE IS SLOWLY TAKING OVER, assimilating with him). Renai looks up - coming FACE TO FACE with Possessed Josh. Renai staggers away from him. POSSESSED JOSH I wanted to stay so much longer... the feeling of being alive again. You cannot comprehend how good it feels. To breathe. To eat. All the little things that you brush off, like a fly. But she wanted me to kill you. Possessed Josh shakes his head, tears in his eyes, scratching at his thinning hair. POSSESSED JOSH (CONT’D) She wouldn’t stop. Wouldn’t stop pushing me to do it. Just like when I was a boy. She wouldn’t let me be a normal little boy.  82.  (MORE) Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library",
      "characters": [],
      "action_text": "She made me kill. And now you’ve just given her exactly what she wants once again. He opens his mouth - revealing BLOODIED GUMS where two more of his teeth have fallen out. Renai BREAKS into a run and Possessed Josh streaks after her. She barrels into -- INT. KITCHEN, LORRAINE’S HOUSE - CONTINUOUS -- the kitchen, hurling a pan at him as she goes. He deflects it, fury in his eyes. POSSESSED JOSH Come here! Renai SNATCHES up a kitchen knife, whirling around and slashing him. He WINCES, grabbing the knife. They struggle with each other, but he overpowers her, SLAPPING her viciously. She falls to the ground. He towers over her with the knife, examining his wound. POSSESSED JOSH (CONT’D) The pain feels good. It’s been such a long time since I felt real pain. I miss it. He wrenches Renai’s head up by the hair. POSSESSED JOSH (CONT’D) But not as much as I miss the feeling of inflicting it on others. He holds the knife to her throat. POSSESSED JOSH (CONT’D) Goodbye, Renai, and welcome to my world. SMASH!! A baseball bat SLAMS into Possessed Josh’s head. He TURNS to see DALTON, standing in the doorway. DALTON Get off her! Possessed Josh snarls and GRABS him, easily pinning him to the floor.  83.  POSSESSED JOSH (CONT’D) Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library Renai scrambles to her feet in the melee, snatching up the strewn pan she threw at Josh and SMACKING IT into his head. Blood spurts from the wound and Possessed Josh rolls off Dalton, stunned. He is still conscious, but dazed. Renai grabs Dalton’s hand and bolts into the -- INT. CORRIDOR, LORRAINE’S HOUSE - CONTINUOUS -- hallway, running with him to the bedroom where Foster is sleeping. INT. FOSTER’S BEDROOM, LORRAINE’S HOUSE - CONTINUOUS Renai charges in, waking up Foster. RENAI Foster, get up! We’re leaving. INT. SPARE BEDROOM, LORRAINE’S HOUSE - NIGHT Renai charges in, snatching Cali out of her crib. INT. KITCHEN, LORRAINE’S HOUSE - SAME T",
      "dialogue_count": 0,
      "word_count": 750
    },
    {
      "scene_number": 13,
      "slugline": "INT. BASEMENT, LORRAINE’S HOUSE - CONTINUOUS -- a darkened stairwell. Possessed Josh SCREAMS, increasing in speed, LUNGING at them as Renai SLAMS the basement door. She SNAPS a lock shut just as Possessed Josh BARRELS into it, WALLOPING the full weight of his shoulder into the wood. Renai backs down the stairs, her children behind her, then pushes a SHELF directly opposite the basement door at the top of the stairs into the door. The shelf SMASHES down, leaning against the door and blocking it. The door frame SHUDDERS as Possessed Josh POUNDS it, whaling on it with animal fury. Renai retreats all the way to the bottom of the stairs, finding herself in a murky concrete bunker. She hits the light switch and a bare bulb dangling above her sheds a pale pool of light onto the environs. Foster cries as the door WHOMPS against the shelf. Renai hugs him to her thigh. FOSTER Why is daddy angry at us? RENAI That’s not daddy. FOSTER I’m scared. RENAI It’s okay. I won’t let anything happen to you. Cali cries as Renai hugs her children to her. Possessed Josh POUNDS against the door again and Foster SCREAMS.  INT. BLACK VOID (THE FURTHER)  Josh, Carl and Elise lope through the unfolding dark. The sound of a scream spirits towards them. Faint. Distant. DALTON (V.O.)  ...mommy...help me...  85. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library",
      "characters": [],
      "action_text": "JOSH Did you hear that? DALTON (V.O.)  ...make him stop...  JOSH That’s my son. Anguish floods Josh. JOSH (CONT’D) Please God, no....I’ve got to help them. I’ve got to help them, that thing is going to kill them! He charges into the dark, literally screaming into the void. JOSH (CONT’D) You bastard! Leave them alone! Elise joins him, struggling to calm him. ELISE Listen to me, Josh, we’ve got to help them from here. There’s nothing you can do physically. JOSH He’s killing them! I can hear my son, don’t you understand that? I need to get to them, I need to help them, he’s -- ELISE No. Listen to me now. If you wander into the dark screaming, then he’s won. You’ve got to focus and come with us, destroy him from here. That’s all you can do. CARL She’s telling you the truth. It’s all we can do now. A long beat passes. Elise leads Josh into the dark. INT. READING ROOM, ELISE’S HOUSE - NIGHT Lorraine, Specs and Tucker pace the room. Lorraine dials her cell phone. The call goes straight to voicemail.  86. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library CARL (V.O.) (from phone) You’ve reached Carl Stanaway, leave me a message. LORRAINE Carl, it’s me again. Please call me as soon as possible. Thanks. She hangs up, anxious. LORRAINE (CONT’D) That’s my third try. I’m gonna try my house. She dials again. This time the phone rings. INT. LIVING ROOM, LORRAINE’S HOUSE - NIGHT The house phone bleats, ringing throughout the house. Possessed Josh ceases pounding on the door, scanning around for the phone in the cradle. He picks it up. POSSESSED JOSH Hello? Mom? LORRAINE (V.O.) (from phone) Josh, sorry to call so late, I was...wondering if you saw Carl today. POSSESSED JOSH Who’s Carl? LORRAINE (V.O.) (from phone) He’s an old friend of mine. So I’m guessing he didn’t stop by from the sound of that? POSSESSED JOSH No. He didn’t. No one by that name. LORRAINE (V.O.) (from phone) Really...okay. POSSESSED JOSH You haven",
      "dialogue_count": 0,
      "word_count": 1055
    },
    {
      "scene_number": 14,
      "slugline": "INT. BASEMENT, LORRAINE’S HOUSE - NIGHT Renai JOLTS with each THUMP against the door. She whisks to her feet, whipping her head around the basement, seeing a row of tools. She plucks a CHISEL from its slot, scurrying up the stairs and STABBING it into Josh’s arm. INT. CORRIDOR, LORRAINE’S HOUSE - SAME TIME Possessed Josh YELPS in pain, jerking back...then laughs. POSSESSED JOSH I enjoy the pain. He storms down the corridor, then lurches to a stop in front of a wall mounted mirror. Even in the dark, he can see his reflection. With horror, he sees that he looks decidedly more AGED now; haggard, haunted. Hair stringy and grey, spine arched. INT. BASEMENT, LORRAINE’S HOUSE - NIGHT Renai keeps the flashlight focused on the beams of wood above them. Dalton steps up beside Renai. His resolve has grown even more. He whispers in her ear. DALTON I can go and find daddy. Out in the dark place. If I go to sleep. Renai holds his gaze. DALTON (CONT’D) Let me find him. I can bring him here. RENAI No...I can’t let you do that. It’s too dangerous. I nearly lost you once, I’m not letting it happen again. A long, resolute beat. Then: RENAI (CONT’D) I’ll go. She hunkers down to his level.  90. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library",
      "characters": [],
      "action_text": "RENAI (CONT’D) You took me into that place last night, didn’t you? DALTON Yes. RENAI Do it again. Can you do that? Dalton nods apprehensively. DALTON Close your eyes. She does. Dalton does the same. INT. LIVING ROOM, LORRAINE’S HOUSE - SAME TIME Possessed Josh staggers back into the house, carrying an AXE. He roosts a couch aside and WRENCHES a huge rug back, exposing the thick wooden floor boards. He holds the AXE high, then arcs it over his head, burying the blade in the wood. Like a madman, he swings it down, one blow after another, wood splinters flying. INT. BASEMENT, LORRAINE’S HOUSE - SAME TIME Chips of wood flutter down from above each time the axe strikes. Renai and Dalton are facing each other, eyes closed. We CLOSE IN ON RENAI’S FACE. She opens her eyes. The impossible quiet and dark of the dead enfolds her.  INT. BASEMENT, LORRAINE’S HOUSE (THE FURTHER)  Renai is sitting opposite Dalton. He takes her by the hand, standing up and hauling her to her feet. Dalton gestures out into the dark above the basement stairs. DALTON Out there. Call his name. Renai glides up the stairs.  91. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library",
      "dialogue_count": 0,
      "word_count": 437
    },
    {
      "scene_number": 15,
      "slugline": "EXT. LORRAINE’S HOUSE (THE FURTHER)  Renai glares out into the pitch black environs of The Further. She moves into them, mist swirling around her. Thunder growls. RENAI Josh! Her cry echoes back to her, swallowed by oblivion.  INT. BLACK VOID (THE FURTHER)  Josh, Carl and Elise FREEZE suddenly. JOSH Listen. RENAI (O.S.)  Josh...  JOSH That’s Renai. ELISE My god...she’s here. They surge forward into the void.  INT. BLACK VOID (THE FURTHER)  The sound of a baby crying spirits towards Renai from the darkness. She turns to see THE ORIGINAL VICTORIAN HOME where this all began for her. RENAI Josh! Renai trots towards the door. She WALLOPS into it. It is locked. It won’t budge. She PUMMELS the door with her fists. INT. MASTER BEDROOM, LAMBERT HOME - NIGHT (FLASHBACK)  ( We are now watching a scene from the original film )  Josh and Renai are in bed. They hear someone pounding on the front door.  92. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library",
      "characters": [],
      "action_text": "JOSH Who the hell is that? There is another round of desperate knocks on the door. JOSH (CONT’D) Stay here. He bounds out of bed, jostling through the door. INT. UPSTAIRS LANDING, LAMBERT HOME - NIGHT (FLASHBACK) Josh paces into the hall. What he doesn’t see is the LONG HAIRED FIEND, standing beside the doorway to Cali’s bedroom.  EXT. LAMBERT HOME - NIGHT (THE FURTHER)  Renai tries the door handle again. No good. INT. CALI’S BEDROOM, LAMBERT HOME - NIGHT (FLASHBACK) In Cali’s room, the Fiend hovers over her crib. He reaches in, touching the baby. She gurgles. Renai suddenly appears in the doorway to Cali’s room - - AND SCREAMS!!!  EXT. LAMBERT HOME - NIGHT (THE FURTHER)  Renai hears a SCREAM. With all the power she can summon, she BLASTS her fists into the front door. It flies open, the burglar alarm wailing instantly.  INT. FRONT DOOR, LAMBERT HOME - NIGHT (THE FURTHER)  Renai stampedes inside the former Lambert home, hastening up the stairs in a blur. RENAI Josh!! As the alarm squeals, we follow her into --  93. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library",
      "dialogue_count": 0,
      "word_count": 361
    },
    {
      "scene_number": 16,
      "slugline": "INT. CALI’S ROOM, LAMBERT HOME - NIGHT (THE FURTHER)  The Further version of Cali’s room. There is no furniture or decorations in here except for Cali’s crib. The room is dark, tentacles of fog writhing along the floor. The Fiend looms over the crib, cackling. RENAI Where is Josh? The Fiend CANNONS TOWRDS HER, arms outstretched, ATTACKING. Renai SHRIEKS.  EXT. LAMBERT HOME (THE FURTHER)  Josh leads the charge, following Renai’s scream all the way to the front door of the house. He barrels through it.  INT. CALI’S ROOM, LAMBERT HOME (THE FURTHER)  Josh charges in, confronted with the sight of the Long Haired Fiend assaulting his wife. Josh HURLS himself at The Fiend, attacking with all his strength. WHAM! Josh socks the Fiend in the face, trading devastating blows with him, his fury providing strength. He PICKS THE FIEND up, hurling him THROUGH THE WINDOW. The Fiends’ screams recede into The Further. Josh embraces Renai, tearful. INT. BASEMENT, LORRAINE’S HOUSE - NIGHT Foster hovers over Dalton and Renai, who lie on the floor, out cold. Foster clings to his mother. INT. LIVING ROOM, LORRAINE’S HOUSE - SAME TIME SLAM!!  94. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library",
      "characters": [],
      "action_text": "The axe penetrates the wood, gash by gash. A hole has formed, not yet big enough for an adult to worm through. He raises the axe again, then -- -- headlights hit the darkened wall opposite him, bleeding through the drapes. Someone is pulling up outside. Possessed Josh ceases chopping, darting to the window.  EXT. PHILIP’S HOUSE (THE FURTHER)  A shape forms in front of Elise - the foreboding estate where Philip and his mother reside. CARL That...that’s it. That’s Michelle’s house. Elise, Renai, Carl and Josh float towards the front door of the house.  INT. CORRIDOR/LIVING ROOM, PHILIP’S HOUSE (THE FURTHER)  Elise leads Carl, Renai and Josh down an empty corridor. It is exactly as the house was that Carl visited - seen from the other side.  INT. LIVING ROOM, PHILIP’S HOUSE (THE FURTHER)  They push into the living room. Dozens of GHOULISH FIGURES stand in the room, glacially still. They are all YOUNG GIRLS, ranging from teenagers to women in their early twenties. Their eyes are hollow, skin sallow. They don’t look at the four intruders, stunned eyes fixed on some unseen depravity. Elise weaves through the bodies, careful not to touch them. Josh shields Renai, weaving through with her. It is a human maze. JOSH Who are they?  95. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library ELISE Murder victims. That’s what The Further is - a black hole where all of the suffering from a life can continue on in eternity, like an echo. The souls here either don’t know or can’t accept that they’re dead. They simply wander the dark. Lost. She turns to face Josh, brushing one of the ghouls. ELISE (CONT’D) The people who die without being murdered at the hands of another, who die peacefully at the hand of nature...they don’t know this place exists. They go to the light. But if there’s light, there must also be dark. And that’s where we are. EXT. LORRAINE’S HOUSE - NIGHT Lorraine, Specs and Tucker climb out of Tucker’s va",
      "dialogue_count": 0,
      "word_count": 636
    },
    {
      "scene_number": 17,
      "slugline": "INT. ENTRY WAY/LIVING ROOM, LORRAINE’S HOUSE - CONTINUOUS The trio blunder into the house, Tucker first. He gropes forward in the dark. Specs follows Tucker with a flashlight. The light illuminates pockets of a desolate living room. No signs of life. INT. BASEMENT, LORRAINE’S HOUSE - SAME TIME Dalton blinks awake, coughing. Renai is still lying next to him, out cold. Dalton stands, reborn with strength. INT. LIVING ROOM, LORRAINE’S HOUSE - NIGHT Specs and Tucker keep treking forward. All is quiet. WHOMP!! Tucker falls, his right leg spilling through the hatch that Possessed Josh rended in the floorboards. He slams down to the ground. TUCKER Ah, damn it! Specs ferries Tucker out of the hole. Tucker WHEELS around - coming face to face with Possessed Josh! Possessed Josh PROPELS a knife forward, embedding it in Tucker’s chest. The blade shears into his flesh and he cries out in PAIN, his body folding. Specs ATTACKS, swinging his flashlight, SMASHING IT down. It connects with Possessed Josh’s face, CRACKING against his jaw bone. Teeth go flying, clattering on the wooden floor. Possessed Josh recovers, smiling. He wrenches Specs’ forward, smashing his head down against a desk. He falls. Lorraine SCREAMS and takes off down the hall. INT. CORRIDOR, LORRAINE’S HOUSE - CONTINUOUS She BOLTS up the corridor, dialing 911 as she runs. Frantic.  97. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library",
      "characters": [],
      "action_text": "Possessed Josh dives for her, landing on her back and pinning her. He crushes the phone against the wall. INT. LIVING ROOM, LORRAINE’S HOUSE - MOMENTS LATER Possessed Josh uses nylon rope to tie up Lorraine, coiling it around her ankles and wrists. Hog-tied. She stirs, coming out of her daze. POSSESSED JOSH I’m going to leave you alive. But I’m going to make you watch. He hales her along the floor to the lip of the hole he cut.  INT. UPSTAIRS CORRIDOR, PHILIP’S HOUSE (THE FURTHER)  Josh keeps Renai close to him, advancing down the corridor. Finally, they reach a DOOR. A heavy oak door, it is guarded by a GHOUL, his head bowed. A demon. There is nowhere left to go. Josh marches forward, trying to pass him - but the monstrous man blocks his path with a thick forearm. DEMON The key. INT. LIVING ROOM, LORRAINE’S HOUSE - NIGHT Possessed Josh BLUDGEONS the axe down, the hole gaping now. INT. BASEMENT, LORRAINE’S HOUSE - SAME TIME Possessed Josh peers into the hole. POSSESSED JOSH Now it’s all over.  INT. DOWNSTAIRS CORRIDOR, PHILIP’S HOUSE (THE FURTHER)  Josh leans into the ear of the demon, whispering. JOSH Michelle.  98. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library The demon reaches out with taloned fingers, gripping the door handle and opening the door. Josh steps inside.  INT. YOUNG PHILIP’S BEDROOM (THE FURTHER)  The same bedroom that Carl first explored reveals itself. The same eloquent dollhouse’s and child’s drawings. It is obviously the bedroom of a young girl. Josh’s eyes sweep the room, coming to rest on the young girl in question. She sits with her back to Josh, slumped on a stool, facing the wall. Her hair is long and combed into twin pig-tails. Her dress is decorated with fanciful trimmings. Her feet dangle above the floor. Josh approaches the young girl, very slowly. The girl doesn’t move. He reaches out to touch her shoulder. JOSH Michelle? The girl suddenly SPINS around -- revealing",
      "dialogue_count": 0,
      "word_count": 1642
    },
    {
      "scene_number": 18,
      "slugline": "INT. LIVING ROOM, LORRAINE’S HOUSE (THE FURTHER)  The duo stagger inside, seeing the dark, empty living room. The floor has been torn up, and all the damage Possessed Josh caused is plainly visible. INT. BASEMENT, LORRAINE’S HOUSE - NIGHT Lorraine cradles Renai. LORRAINE Renai, please wake up!  INT. BASEMENT, LORRAINE’S HOUSE (THE FURTHER)  FROM JOSH’S POV - we fly through the pitch space of the basement, only two bodies visible in it - Josh and Renai. Both bodies lie prone on the basement floor. Our POV RUSHES TOWARDS Josh’s body. INT. BASEMENT, LORRAINE’S HOUSE - NIGHT Renai COUGHS suddenly, her eyes blinking. She snaps to attention. RENAI Dalton! Renai locks her arms around him and they embrace - but only for a second. Dalton stands over his father’s body. Josh SITS BOLT UPRIGHT suddenly, sucking in a huge BREATH, coughing. Lorraine and Renai instinctively shield the children and stand back, ready for another attack. An agonizing wait as Josh arches forward, gathering his breath, spitting and coughing. He finally calms the fit of expelling his lungs, taking deep breaths. He looks up slowly. Renai stares at him without expression. Waiting. Tears come to Josh’s eyes and he smiles. JOSH Renai...it’s me. It’s me. We see that he is no longer AGED. The wrinkles have melted away, the color returned to his formerly undead pallor. Renai joins him in shedding tears of joy.  104. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library",
      "characters": [],
      "action_text": "FOSTER Daddy! Foster bolts towards his father, wrapping his arms around him. Renai is more cautious. She leans down, studying the eyes of her husband. JOSH You know it’s me. Somehow, Renai can see his soul. Something has changed about him. Renai can’t hold it anymore - her arms enfolding him. They are together again. Josh looks over Renai’s shoulder at Dalton, who is still afraid. JOSH (CONT’D) Come here son. Dalton joins his mother and Dalton in the embrace. Lorraine watches on...happy once again. INT. LIVING ROOM, LORRAINE’S HOUSE - NIGHT Renai tends to Tucker, whose shirt is bloodstained. Specs gathers himself, nursing a sore head. JOSH I’ll call an ambulance. FOSTER No, dad, stay with us! JOSH I’m not going anywhere. EXT. LORRAINE’S HOUSE - NIGHT Specs wanders back to Tucker’s van, carrying Tucker’s goggles. He pries open the back of the van, climbing up onto the lip and slotting the flashlights back into their allotted case. And then he stops. Because he hears something. Brow furrowed, he trains his ears on it. A low, hissy whisper. Intrigued, he ransacks the mess stacked in the van. He finally lands on the GAS MASK device. The whispering is coming from the headphones attached to it. Specs lifts them to his ears...hearing a slight, barely audible hiss. A singular voice swims within the white noise.  105. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library Specs snatches a pen and paper, jotting down what he hears. VOICE (V.O.) (from microphone) ...goodbye... Specs writes the single word down. GOODBYE. FADE TO BLACK. EXT. LORRAINE’S HOUSE - DAY The sun shines down on Lorraine’s house. INT. KITCHEN, LORRAINE’S HOUSE - DAY Renai spoons a paste into Cali’s mouth, who squeals happily. INT. LIVING ROOM, LORRAINE’S HOUSE - DAY Renai strays into the living room. She halts when she spies a sheet hiding a large object in the middle of the room, a bow adorning it. She approaches the object, seeing a card a",
      "dialogue_count": 0,
      "word_count": 715
    },
    {
      "scene_number": 19,
      "slugline": "INT. YOUNG JOSH’S BEDROOM, LORRAINE’S HOUSE - DAY Renai pads inside. It is dark, the blinds drawn. RENAI Dalton, don’t forget to finish packing everything up for the... She trails off, gaping up and spotting a trail of CRAYON ON THE WALL, running erratically over the white paint. Renai follows it with her eyes, all the way until her eyes find DALTON. He is slumped at the desk, his back to her. RENAI (CONT’D) Honey...? She lurches closer. Dalton seems to be using one of the crayons to DRAW on his own face. RENAI (CONT’D) What are you doing? Dalton PIVOTS TOWARDS HER - - and with DREAD, Renai sees that he is running a CRAYON over his face, coloring it BRIGHT RED. As he stabs at his sanguine face with the crayon, his features morph into an eerie and terrifying expression of pure homicidal intent. A grimace from the pits of HELL. Renai WAILS a blood-curdling cry of FEAR AND ANGUISH as we -- CUT TO BLACK.  107. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 182
    }
  ]
}