{
  "slug": "into-the-woods-2014",
  "title": "into the woods",
  "genre": "drama",
  "format": "film",
  "scenes_count": 12,
  "characters_count": 0,
  "characters": [],
  "total_words": 22795,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. BAKER’S COTTAGE - DAY CLOSE-UP on a ball of dough. The BAKER’S thick hand pounds it. BAKER (V.O.) ... and a childless baker... ANGLE ON THE BAKER AND HIS WIFE Hard-working and honest, he is kneading the dough which she then takes and puts in the oven. BAKER/BAKER’S WIFE I WISH... BAKER (V.O.) ... with his Wife-- “ BAKER MORE THAN ANYTHING... WIFE MORE THAN THE MOON... BAKER/BAKER’S WIFE I WISH... INT. CINDERELLA’S HOUSE - KITCHEN - DAY CINDERELLA scrubs a huge pot. CINDERELLA THE KING IS GIVING A FESTIVAL. INT. BAKER’S COTTAGE - DAY The WIFE rolls the dough as the BAKER stokes the hot oven. BAKER/WIFE MORE THAN LIFE... INT. JACK’S FARMHOUSE - DAY Inside the tiny cottage, the COW stands bewildered as JACK tries to   milk her without success. JACK (to Milky-White) I WISH... INT. CINDERELLA’S HOUSE - KITCHEN - DAY CINDERELLA I WISH TO GO TO THE FESTIVAL--  2",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 155
    },
    {
      "scene_number": 2,
      "slugline": "INT. BAKER’S COTTAGE - DAY BAKER/WIFE MORE THAN RICHES... INT. CINDERELLA’S HOUSE - KITCHEN - DAY CINDERELLA -- AND THE BALL... INT. JACK’S FARMHOUSE - DAY JACK I WISH MY COW WOULD GIVE US SOME MILK. INT. BAKER’S COTTAGE - DAY The WIFE lifts a heavy sack of flour. WIFE/CINDERELLA MORE THAN ANYTHING... The BAKER takes bread from the oven. BAKER I WISH WE HAD A CHILD. INT. JACK’S FARMHOUSE - DAY Now leaning his shoulder against the cow for more leverage as he squeezes her udders. JACK PLEASE, PAL. INT. BAKER’S COTTAGE - DAY WIFE I WANT A CHILD. INT. JACK’S FARMHOUSE - DAY JACK (frustrated) SQUEEZE, PAL... INT. CINDERELLA’S HOUSE/JACK’S HOUSE/BAKER’S COTTAGE - DAY She is now scrubbing the floor in front of a large fireplace. CINDERELLA I WISH TO GO TO THE FESTIVAL. JACK I WISH YOU’D GIVE US SOME MILK/ OR EVEN CHEESE... BAKER/WIFE I WISH WE MIGHT HAVE A CHILD. ALL I WISH...  3",
      "characters": [],
      "action_text": "CINDERELLA’S STEPMOTHER moves towards her threateningly. INT. CINDERELLA’S HOUSE - KITCHEN - DAY CINDERELLA’S STEPMOTHER dressed in a robe, her blonde hair rolled in rags, carries herself with an air of disgust; like a medieval Orange County housewife. STEPMOTHER YOU WISH TO GO TO THE FESTIVAL? BAKER (V.O) The poor girl’s parents had died-- Her two daughters, also blonde, FLORINDA and LUCINDA, appear on the stairwell. They’re junior versions of Mom. STEPMOTHER YOU, CINDERELLA, THE FESTIVAL?/ YOU WISH TO GO TO THE FESTIVAL? FLORINDA and LUCINDA move to join their MOTHER. FLORINDA (overlapping) WHAT,   YOU,   CINDERELLA? THE FESTIVAL? THE FESTIVAL? LUCINDA WHAT, YOU WISH TO GO TO THE FESTIVAL? STEPMOTHER/STEPSISTERS THE FESTIVAL?!/ THE KING’S FESTIVAL!?? BAKER (V.O.) And now she lived with her stepmother... STEPMOTHER THE FESTIVAL?!!! BAKER (V.O.) ...who had two daughters of her own. CINDERELLA rises and shyly retreats, but the STEPSISTERS sweep around her menacingly. FLORINDA (grabbing her hand) LOOK AT YOUR NAILS! LUCINDA (pulling on her) LOOK AT YOUR DRESS! STEPMOTHER PEOPLE WOULD LAUGH AT YOU! CINDERELLA NEVERTHELESS--  4 STEPMOTHER/STEPSISTERS/CINDERELLA SHE/YOU/I STILL WANT(S)/ WISH TO GO THE FESTIVAL--/ AND DANCE BEFORE THE PRINCE?! They roar in derision. BAKER (V.O.) All three were beautiful of face, but vile and black of heart. EXT. JACK’S FARMHOUSE - DAY JACK’S MOTHER, bedraggled, takes in the laundry. BAKER (V.O.) The young lad had no father, and his mother-- JACK’S MOTHER I WISH... BAKER (V.O.) Well, she was at her wit’s end-- JACK’S MOTHER I WISH MY SON WERE NOT A FOOL./ I WISH MY HOUSE WAS NOT A MESS./ I WISH THE COW WAS FULL OF MILK./ I WISH THE WALLS WERE FULL OF GOLD--/ I WISH A LOT OF THINGS. INT. JACK’S FARMHOUSE - DAY - CONTINUOUS JACK’S MOTHER enters the house and stops dead in her tracks when she sees the cow. JACK’S MOTHER What in heaven’s name are you doing with the cow inside the house? JACK I thought if he was nice and warm he might produce s",
      "dialogue_count": 0,
      "word_count": 810
    },
    {
      "scene_number": 3,
      "slugline": "EXT. CINDERELLA’S HOUSE - DAY We see the BIRDS swarming and flying down the chimney. INT. CINDERELLA’S HOUSE - KITCHEN - DAY CINDERELLA opens her eyes to greet the birds that now surround her. CINDERELLA QUICK, LITTLE BIRDS,/ FLICK THROUGH THE ASHES./ PICK AND PECK, BUT SWIFTLY,/ SIFT THROUGH THE ASHES./ INTO THE POT... The BIRDS spread out and begin their task. EXT. JACK’S FARMHOUSE - DAY JACK sits atop MILKY-WHITE as if she were a horse, his arm WHIRLING as he releases a sling and sends a STONE hurtling towards a TIN CUP on top of the door frame. There is a loud “CLANG”. JACK Bullseye! JACK’S MOTHER was just exiting the house. The CUP falls down, narrowly missing her. JACK’S MOTHER What are you doing? Stop your pretending! She grabs JACK’S sling and pulls him away from the COW. JACK’S MOTHER (CONT’D) Now listen to me well, son. Milky-White must be taken to market. JACK Mother, no-- he’s the best cow in the world-- JACK’S MOTHER Was. She’s been dry for weeks. We’ve no food or money and no choice but to sell her. JACK But Milky-White is my best friend! JACK’S MOTHER Look at her! THERE ARE BUGS ON HER DUGS./ THERE ARE FLIES IN HER EYES./ THERE’S A LUMP ON HER RUMP/ BIG ENOUGH TO BE A HUMP! JACK But--  7",
      "characters": [],
      "action_text": "JACK’S MOTHER WE’VE NO TIME TO SIT AND DITHER/ WHILE HER WITHERS WITHER WITH HER--/ AND NO ONE KEEPS A COW FOR A FRIEND! Sometimes I wonder what’s in that head of yours. INT. BAKER’S COTTAGE - DAY LRRH gives the BAKER a coin as his WIFE looks on adoringly. She loves having the little girl here. The Baker, not so much. LRRH INTO THE WOODS, IT’S TIME TO GO,/ I HATE TO LEAVE, I HAVE TO, THOUGH./ INTO THE WOODS-- IT’S TIME, AND SO/ I MUST BEGIN MY JOURNEY. INTO THE WOODS AND THROUGH THE TREES/ TO WHERE I AM EXPECTED, MA’AM,/ INTO THE WOODS TO GRANDMOTHER’S HOUSE... She shoves the entire bun into her mouth. LRRH (CONT’D) (with her mouth full) INTO THE WOODS TO GRANDMOTHER’S HOUSE... WIFE You’re certain of your way? As LRRH sings, she begins to help herself to all the buns she can lay her hands on. LRRH THE WAY IS CLEAR,/ THE LIGHT IS GOOD,/ I HAVE NO FEAR,/ NOR NO ONE SHOULD./ THE WOODS ARE JUST TREES,/ THE TREES ARE JUST WOOD./ (to the Wife) I SORT OF HATE TO ASK IT,/ BUT DO YOU HAVE A BASKET? The WIFE reaches for a basket, while the BAKER tries to wrest away a bun or two from the girl. BAKER I don’t suppose you’re planning on buying any of these? The WIFE gives the BAKER a look, then hands LRRH a basket. WIFE Now, don’t stray and be late! BAKER And you might save some of those sweets for Granny.  8",
      "dialogue_count": 0,
      "word_count": 484
    },
    {
      "scene_number": 4,
      "slugline": "EXT. THE VILLAGE - DAY - MOMENTS LATER The BAKER, and his WIFE are in front of their shop, watching as LRRH skips down the lane. LRRH (to herself)) INTO THE WOODS AND DOWN THE DELL,/ THE PATH IS STRAIGHT, I KNOW IT WELL./ INTO THE WOODS, AND WHO CAN TELL/ WHAT’S WAITING ON THE JOURNEY?/ INTO THE WOODS TO BRING SOME BREAD/ TO GRANNY WHO IS SICK IN BED./ NEVER CAN TELL WHAT LIES AHEAD,/ FOR ALL THAT I KNOW, SHE’S ALREADY DEAD. Her path takes her through an ancient GRAVEYARD and on towards the forest’s edge. LRRH (CONT’D) BUT INTO THE WOODS,/ INTO THE WOODS,/ INTO THE WOODS/ TO GRANDMOTHER’S HOUSE/ AND HOME BEFORE DARK! INT. CINDERELLA’S HOUSE - KITCHEN - DAY The BIRDS are dropping the last of the lentils into the pot. LUCINDA (O.S.) Cinderella! FLORINDA (O.S.) Get up here! CINDERELLA FLY BIRDS,/ BACK TO THE SKY,/ The BIRDS begin to make their way out through the fireplace and windows as CINDERELLA sings her incantation. LUCINDA (O.S.) We are waiting! CINDERELLA BACK TO THE EAVES/ AND THE LEAVES/ AND THE FIELDS/ AND THE-- INT. CINDERELLA’S HOUSE - DRESSING ROOM - DAY A room of mirrors. LUCINDA and FLORINDA, dressed in their ball gowns, study themselves side by side, reflected over and over. CINDERELLA enters through a mirrored door, breaking the image. FLORINDA HURRY UP AND DO MY HAIR, CINDERELLA! FLORINDA pulls at one of LUCINDA’S bows. FLORINDA (CONT’D) ARE YOU REALLY WEARING THAT?  9",
      "characters": [],
      "action_text": "LUCINDA grabs CINDERELLA. LUCINDA (pointing to her sleeve) HERE, I FOUND A LITTLE TEAR, CINDERELLA! LUCINDA eyes FLORINDA’S hair. LUCINDA (CONT’D) CAN’T YOU HIDE IT WITH A HAT? CINDERELLA grabs a stool and brings it next to FLORINDA. CINDERELLA YOU LOOK BEAUTIFUL. She stands on the stool and begins fixing FLORINDA’S hair. FLORINDA I know. LUCINDA She means me. FLORINDA No, she didn’t! The two STEPSISTERS bicker as CINDERELLA brushes and twists their hair into tight curls: CINDERELLA (V.O.) (internal) MOTHER SAID BE GOOD,/ FATHER SAID BE NICE,/ THAT WAS ALWAYS THEIR ADVICE./ SO BE NICE, CINDERELLA,/ GOOD, CINDERELLA,/ NICE GOOD GOOD NICE-- FLORINDA Tighter! CINDERELLA obliges and becomes more aggressive with the hair styling, her emotions building as she thinks to herself: CINDERELLA (V.O.) WHAT’S THE GOOD OF BEING GOOD/ IF EVERYONE IS BLIND/ ALWAYS LEAVING YOU BEHIND?/ NEVER MIND, CINDERELLA,/ KIND CINDERELLA--/ NICE GOOD NICE KIND GOOD NICE-- FLORINDA screams, bringing CINDERELLA back to reality. FLORINDA Ow! Not that tight! Clod! She reels around and smacks CINDERELLA who stands stunned. The STEPSISTERS giggle and snort.  10",
      "dialogue_count": 0,
      "word_count": 427
    },
    {
      "scene_number": 5,
      "slugline": "INT. BAKER’S COTTAGE - DAY - LATER The BAKER and his WIFE are cleaning up after their day’s work. There is an unexpected knock at the door. They stare at one another momentarily. BAKER Who might that be? WIFE (calling out) We’ve sold our last loaf of bread! The BAKER opens the window a crack to see who is at the door. BAKER (alarmed) It’s the Witch from next door! The DOOR pops off its frame and goes flying across the room in a giant puff of smoke. The BAKER and his WIFE scream and cower in a corner. As the fog clears, we see the WITCH for the first time and she’s not a pretty sight. MICE and other vermin drop from beneath her cape and scatter through the cottage. WIFE We have no bread. WITCH I don’t want your bread. BAKER Then what is it you wish? WITCH It’s not what I wish. It’s what you wish. She moves towards the WIFE as the BAKER tries unsuccessfully to protect her. She points her gross finger towards her belly. WITCH (CONT’D) Nothing cooking in that belly now, is there? And there will never be... She looks away. WITCH (CONT’D) Unless you do exactly as I say. In three days’ time, a Blue Moon will appear. Only then can the curse be undone. WIFE What curse? WITCH The one I placed on this house!  11",
      "characters": [],
      "action_text": "BAKER What are you talking about? WITCH In the past, when you were no more than a babe, your father brought his young wife and you to this cottage. They were a lovely couple. But not lovely neighbors. You see, your mother was with child and she developed an unusual appetite. She admired my beautiful garden and she told your father that what she wanted, more than anything in the world was-- GREENS, GREENS, AND NOTHING BUT GREENS:/ PARSLEY, PEPPERS, CABBAGES AND CELERY./ ASPARAGUS AND WATERCRESS AND/ FIDDLEFERNS AND LETTUCE--!/ HE SAID, “ALL RIGHT,”/ BUT IT WASN’T, QUITE,/ ‘CAUSE I CAUGHT HIM/ IN THE AUTUMN/ IN MY GARDEN ONE NIGHT! EXT. WITCH’S GARDEN - NIGHT - FLASHBACK WITCH’S POV In the moonlight, we see the BAKER’S FATHER, wearing a hunting jacket, scale over the WITCH’S wall and into her garden. From behind a wooden trellis, she WATCHES him as he gathers her greens: WITCH (V.O.) HE WAS ROBBING ME,/ RAPING ME,/ ROOTING THROUGH MY RUTABAGA,/ RAIDING MY ARUGULA INT. BAKER’S COTTAGE - DAY - PRESENT WITCH AND/ RIPPING UP THE RAMPION/ (MY CHAMPION!/ MY FAVORITE!) I SHOULD HAVE LAID A SPELL ON HIM RIGHT THERE--/ I COULD HAVE TURNED HIM INTO STONE/ OR A DOG OR A CHAIR.../ BUT I LET HIM HAVE THE RAMPION/ I’D LOTS TO SPARE. EXT. WITCH’S GARDEN - NIGHT - FLASHBACK Again, only seeing the WITCH from behind, she confronts the BAKER’S FATHER as he sheepishly holds the stolen vegetables. WITCH (V.O.) IN RETURN, HOWEVER,/ I SAID, “FAIR IS FAIR:/ YOU CAN LET ME HAVE THE BABY/ THAT YOUR WIFE WILL BEAR,  12",
      "dialogue_count": 0,
      "word_count": 504
    },
    {
      "scene_number": 6,
      "slugline": "INT. BAKER’S COTTAGE - DAY - PRESENT WITCH AND WE’LL CALL IT SQUARE.” BAKER I had a brother? WITCH No. But you had a sister. BAKER Where is she? WITCH She’s mine now and you’ll never find her! Small price to pay for what else your father stole from me. It cost me my youth, my beauty. My mother warned me she would punish me with the curse of ugliness if I ever lost them. WIFE Lost what? WITCH (impatient) The beans! BAKER/WIFE Beans? WITCH THE SPECIAL BEANS! EXT. WITCH’S GARDEN - NIGHT - FLASHBACK The BAKER’S FATHER steals the WITCH’S beans and pockets them. WITCH (V.O.) I LET HIM GO,/ I DIDN’T KNOW/ HE’D STOLEN MY BEANS! WITCH’S POV - the BAKER’S FATHER scales his way back over the garden wall. WITCH (V.O.) I WAS WATCHING HIM CRAWL/ BACK OVER THE WALL,/ WHEN BANG! CRASH!/ THE LIGHTNING FLASH!/ Lights suddenly illuminate the BAKER’S FATHER as if it was a flash from the Hiroshima blast. A look of horror crosses his face. BAKER’S FATHER’S POV  13",
      "characters": [],
      "action_text": "Light illuminates the WITCH as she walks back towards her house. Suddenly her youthful hands morph before our eyes into those of an aged hag. The CAMERA PANS UP to find her withered face. INT. BAKER’S COTTAGE - DAY - PRESENT A LIGHTNING FLASH rips through the Baker’s cottage. WITCH WELL, THAT’S ANOTHER STORY--/ NEVER MIND./ ANYWAY, AT LAST/ THE BIG DAY CAME/ AND I MADE MY CLAIM./ ”OH, DON’T TAKE AWAY THE BABY,”/ THEY SHRIEKED AND SCREECHED,/ INT. BAKER’S COTTAGE - NIGHT - FLASHBACK We see the WITCH’S gross hands snatch the baby from a cradle. WITCH (V.O.) BUT I DID, AND I HID HER/ WHERE SHE’LL NEVER BE REACHED. INT. BAKER’S COTTAGE - DAY - PRESENT WITCH AND YOUR FATHER CRIED/ AND YOUR MOTHER DIED,/ WHEN FOR EXTRA MEASURE--/ I ADMIT IT WAS A PLEASURE--/ I SAID, “SORRY, I’M STILL NOT MOLLIFIED.”/ AND I LAID A LITTLE SPELL ON THEM--/ YOU TOO, SON--/ THAT YOUR FAMILY TREE/ WOULD ALWAYS BE/ A BARREN ONE... The WIFE falls into the BAKER’S arms, weeping. BAKER How could you do that to me? WITCH And when your mother died, your father deserted you. Your father was no father -- so why should you be? BAKER (to his WIFE) I’m so sorry... WITCH NOW THERE’S NO MORE FUSS/ AND THERE’S NO MORE SCENES/ AND MY GARDEN THRIVES - / YOU SHOULD SEE MY NECTARINES!/ BUT I’M TELLING YOU THE SAME/ I TELL KINGS AND QUEENS: The WITCH grabs some magical looking beans from a SMALL SATCHEL she carries across her body. She displays them.  14 WITCH (CONT’D) DON’T EVER NEVER EVER/ MESS AROUND WITH MY GREENS!/ ESPECIALLY THE BEANS. EXT. JACK’S FARMHOUSE - DAY JACK with his cow stands outside with his MOTHER. JACK Why do I have to go to the next village? JACK’S MOTHER Because everyone in this village knows the cow hasn’t given a drop of milk in weeks. JACK But that’s cheating. JACK’S MOTHER We’re starving, Jack. Don’t you understand that? You’re not to take less than five pounds for her. Are you listening to me? JACK (he’s not) Yes. JACK’S MOTHER How much are you to ask? JACK No more than five pounds. Sh",
      "dialogue_count": 0,
      "word_count": 1369
    },
    {
      "scene_number": 7,
      "slugline": "EXT. CINDERELLA’S HOUSE/EXT. VILLAGE - DAY - INTERCUT CINDERELLA has thrown a shawl around herself and is heading out the back of the house. She places a ladder against the stone wall and begins to climb. The BAKER and his WIFE leave the village and begin moving towards the woods. CINDERELLA/BAKER INTO THE WOODS, IT’S TIME TO GO,/ IT MAY BE ALL IN VAIN, YOU (I) KNOW./ INTO THE WOODS-- BUT EVEN SO,/ I HAVE TO TAKE THE JOURNEY. WIFE INTO THE WOODS/ THE PATH IS STRAIGHT,/ YOU KNOW IT WELL, BAKER BUT WHO CAN TELL--? WIFE (giving him a little push) INTO THE WOODS TO LIFT THE SPELL-- EXT. CINDERELLA’S HOUSE - DAY CINDERELLA climbs over the wall. CINDERELLA INTO THE WOODS TO VISIT MOTHER-- EXT. DIRT ROAD BY JACK’S FARMHOUSE - DAY JACK’S MOTHER watches from the distance as JACK leads MILKY- WHITE up the path. JACK’S MOTHER (calling after him) INTO THE WOODS TO SELL THE COW-- JACK TO GET THE MONEY!-- EXT. CINDERELLA’S HOUSE - OTHER SIDE OF THE WALL - DAY CINDERELLA drops down from the wall and runs off. CINDERELLA TO GO THE FESTIVAL-- EXT. WOODS - NATURAL ARCHWAY/STREAM - DAY LRRH enters an archway that frames the entrance into the woods. LRRH INTO THE WOODS TO GRANDMOTHER’S HOUSE.../ INTO THE WOODS TO GRANDMOTHER’S HOUSE...  19",
      "characters": [],
      "action_text": "INTERCUTTING: THE BAKER entering the same archway; CINDERELLA crossing a stream; and LRRH weaving her way down a gully. CINDERELLA/BAKER/LRRH THE WAY IS CLEAR,/ THE LIGHT IS GOOD./ I HAVE NO FEAR,/ NOR NO ONE SHOULD./ THE WOODS ARE JUST TREES,/ THE TREES ARE JUST WOOD./ NO NEED TO BE AFRAID THERE-- All THREE of them stop with sudden trepidation. BAKER THERE’S SOMETHING IN THE GLADE THERE. The BAKER walks deeper into the woods. EXT. DIRT ROAD BY JACK’S FARMHOUSE - DAY The carriage carrying the STEPFAMILY crosses a small country bridge, then passes JACK’S MOTHER. One of the wheels turns in a puddle and splashes her with mud. ALL INTO THE WOODS WITHOUT DELAY,/ BUT CAREFUL NOT TO LOSE THE WAY./ INTO THE WOODS, WHO KNOWS WHAT MAY/ BE LURKING ON THE JOURNEY? EXT. WOODS - NATURAL ARCHWAY - DAY JACK enters the archway into the woods with his COW. ALL INTO THE WOODS TO GET THE THING/ THAT MAKES IT WORTH THE JOURNEYING. EXT. WOODS - DAY VARIOUS ANGLES on each of our CHARACTERS in different woodland surrounds. STEPS INTO THE WOODS TO SEE THE KING-- JACK TO SELL THE COW-- BAKER TO MAKE THE POTION-- QUICK INTERCUTS between the characters: ALL TO SEE--/ TO SELL--/ TO GET--/ TO BRING/ TO MAKE--/ TO LIFT--/ TO GO TO THE FESTIVAL--! The CAMERA slowly rises through the trees as the vast forest swallows up our intrepid travellers.  20 ALL   (V.O.) INTO THE WOODS!/ INTO THE WOODS!/ INTO THE WOODS,/ THEN OUT OF THE WOODS,/ AND HOME BEFORE DARK! EXT. CINDERELLA’S MOTHER’S GRAVE - DAY A large willow tree stands tall. BAKER (V.O.) Deep within the woods, Cinderella had planted a branch at the grave   of her mother. And she visited there so often, and wept so much, that her tears watered it until it had become a magnificent tree. CINDERELLA kneels in prayer. CINDERELLA I WISH... She begins to cry. MUSIC. In the reflection, CINDERELLA sees the tree slowly twist and turn taking on the shape of her MOTHER, who looks down upon her. C’S MOTHER What is it that you wish, child? CINDERELLA looks up ",
      "dialogue_count": 0,
      "word_count": 708
    },
    {
      "scene_number": 8,
      "slugline": "EXT. WOODS - FLOWERED PATH - DAY LRRH walks along the path. BAKER (V.O.) On her path to Granny’s, the little girl suddenly found herself in a very unusual part of the wood. WOLF’S POV Branches and leaves rush by in a blur. Suddenly, the CAMERA stops, and in the distance we see LRRH strolling down a path of exotic flowers as she munches on a treat. We hear HEAVY BREATHING. The CAMERA continues stalking its prey, moving closer towards LRRH through the brush. ANGLE on LRRH, as she continues walking and eating. WOLF (O.S.) Good day, young lady. She turns around and what she sees - through a CHILD’S EYES - is a super-slick, good-looking guy. What she doesn’t notice is his curiously low hairline, something of a snout, and a tail peeking from his waistcoat. LRRH Good day, Mr. Wolf. WOLF Whither away so hurriedly? LRRH To my Grandmother’s. WOLF And what might be in your basket? LRRH It’s bread for Grandmother so she’ll have something good to make her strong. WOLF And where might your Grandmother live? LRRH (pointing) A quarter of a league further in the woods; her house stands inside a great oak tree. She continues on the path. The WOLF looks after her longingly.  22",
      "characters": [],
      "action_text": "WOLF MMMMH.../ UNHH.../ LOOK AT THAT FLESH,/ PINK AND PLUMP./ HELLO, LITTLE GIRL.../ TENDER AND FRESH,/ NOT ONE LUMP./ HELLO, LITTLE GIRL.../ THIS ONE’S ESPECIALLY LUSH,/ DELICIOUS... With inhuman speed, he manages to suddenly be back in front of the girl on the path. WOLF (CONT’D) HELLO, LITTLE GIRL,/ WHAT’S YOUR RUSH?/ YOU’RE MISSING ALL THE FLOWERS./ THE SUN WON’T SET FOR HOURS,/ TAKE YOUR TIME. LRRH MOTHER SAID,/ ”STRAIGHT AHEAD,”/ NOT TO DELAY/ OR BE MISLED. She continues moving forward, he slithers around her. This WOLF has some smooth moves. WOLF BUT SLOW, LITTLE GIRL,/ HARK! AND HUSH- / THE BIRDS ARE SINGING SWEETLY./ YOU’LL MISS THE BIRDS COMPLETELY,/ YOU’RE TRAVELLING SO FLEETLY. He drops behind again, thinking to himself. WOLF (CONT’D) GRANDMOTHER FIRST,/ THEN MISS PLUMP.../ WHAT A DELECTABLE COUPLE./ UTTER PERFECTION:/ ONE BRITTLE, ONE SUPPLE-- Racing ahead and then darting out from a tree. WOLF (CONT’D) ONE MOMENT, MY DEAR-- LRRH MOTHER SAID,/ ”COME WHAT MAY,/ FOLLOW THE PATH/ AND NEVER STRAY.” WOLF JUST SO, LITTLE GIRL--/ ANY PATH./ SO MANY WORTH EXPLORING./ JUST ONE WOULD BE SO BORING./ AND LOOK WHAT YOU’RE IGNORING... He ushers LRRH off the path to a lush meadow blanketed with exquisite purple flowers and wild berries.  23 WOLF (CONT'D) (working himself up) THINK OF THOSE CRISP,/ AGING BONES,/ THEN SOMETHING FRESH ON THE PALATE./ THINK OF THAT SCRUMPTIOUS CARNALITY/ TWICE IN ONE DAY.../ THERE’S NO POSSIBLE WAY/ TO DESCRIBE WHAT YOU FEEL/ WHEN YOU’RE TALKING TO YOUR MEAL! The WOLF picks a flower and hands it to LRRH. WOLF (CONT’D) For Granny. LRRH MOTHER SAID/ NOT TO STRAY./ STILL, I SUPPOSE,/ A SMALL DELAY--/ GRANNY MIGHT LIKE/ A FRESH BOUQUET.../ Goodbye, Mr. Wolf. WOLF Goodbye, little girl./ AND HELLO... The WOLF climbs to the top of a precipice where he is silhouetted by the red hot sun. He lets out a mighty howl. EXT. WOODS - FLOWERED PATH - DAY - CONTINUOUS LRRH goes about her business picking flowers further from her path. ANGLE ON THE BAKER wh",
      "dialogue_count": 0,
      "word_count": 3753
    },
    {
      "scene_number": 9,
      "slugline": "EXT. JACK’S FARMHOUSE - THE NEXT DAY - DAYBREAK A STRAGGLY ROOSTER crowing, the sun cutting across its path. INT. JACK’S FARMHOUSE - DAYBREAK - CONTINUOUS JACK’S MOTHER is woken by the rooster crow to find something ticking her nose. She opens her eyes, brushing the “something” away -- then sees that it’s a huge LEAF pushing in through an open slat in the wall. EXT. JACK’S FARMHOUSE - DAYBREAK - EXTREME WIDE SHOT The cottage, now dwarfed by a giant BEANSTALK. JACK’S MOTHER, a tiny figure from this distance, comes running out of the house, takes one look at the giant plant and screams. EXT. WOODS - TALL TREES - DAY Various angles of JACK, running feverishly through the woods in search of the BAKER. He carries a huge sack of LARGE-SIZED COINS over his back. He occasionally calls out: “Mr. Baker!” The BAKER, peacefully asleep is curled up in a large root, clutching the red cape like it was his blankie. Suddenly JACK leaps from atop calling his name and waking him. JACK (shouting) Mr. Baker!   Mr. Baker! BAKER (half asleep) What? JACK Good fortune! Good fortune, sir! Look what I have! Five gold pieces. BAKER (skeptical) How would you come by five gold pieces?! JACK THERE ARE GIANTS IN THE SKY!/ THERE ARE BIG TALL TERRIBLE GIANTS IN THE SKY! JACK throws him the bag and begins to scale up the root of the tree. JACK (CONT’D) WHEN YOU’RE WAY UP HIGH AND YOU LOOK BELOW/ AT THE WORLD YOU’VE LEFT AND THE THINGS YOU KNOW,/ LITTLE MORE THAN A GLANCE IS ENOUGH TO SHOW/ YOU JUST HOW SMALL YOU ARE.  40  (MORE)",
      "characters": [],
      "action_text": "WHEN YOU’RE WAY UP HIGH AND YOU’RE ON YOUR OWN/ IN A WORLD LIKE NONE THAT YOU’VE EVER KNOWN,/ WHERE THE SKY IS LEAD AND THE EARTH IS STONE, EXT. BEANSTALK - DAY - FLASHBACK JACK is now climbing the BEANSTALK. JACK (V.O.) YOU’RE FREE TO DO/ WHATEVER PLEASES YOU,/ EXPLORING THINGS YOU’D NEVER DARE/ ’CAUSE YOU DON’T CARE,/ WHEN SUDDENLY THERE’S EXT. WOODS - DAY - PRESENT JACK is half-way up the tree with the BAKER below. JACK A BIG TALL TERRIBLE GIANT AT THE DOOR. BAKER A giant? JACK A BIG TALL TERRIBLE LADY GIANT SWEEPING THE FLOOR./ AND SHE GIVES YOU FOOD/ AND SHE GIVES YOU REST,/ AND SHE DRAWS YOU CLOSE/ TO HER GIANT BREAST,/ JACK (in the tree). JACK (CONT’D) AND YOU KNOW THINGS NOW THAT YOU NEVER KNEW BEFORE,/ NOT TILL THE SKY. The BAKER listens intently. JACK (CONT’D) ONLY JUST WHEN YOU’VE MADE A FRIEND AND ALL,/ AND YOU KNOW SHE’S BIG BUT YOU DON’T FEEL SMALL,/ SOMEONE BIGGER THAN HER COMES ALONG THE HALL/ TO SWALLOW YOU FOR LUNCH. AND YOUR HEART IS LEAD AND YOUR STOMACH STONE/ AND YOU’RE REALLY SCARED BEING ALL ALONE,/ AND IT’S THEN THAT YOU MISS ALL THE THINGS YOU’VE KNOWN/ AND THE WORLD YOU’VE LEFT AND THE LITTLE YOU OWN. EXT. BEANSTALK - DAY - FLASHBACK JACK scurries down the BEANSTALK, with the large SACK OF COINS over his shoulder, occasionally looking up to see if he is being followed. JACK (V.O.) THE FUN IS DONE./ YOU STEAL WHAT YOU CAN AND RUN!  41  JACK (CONT’D)  (MORE) AND YOU SCRAMBLE DOWN/ AND YOU LOOK BELOW,/ AND THE WORLD YOU KNOW/ BEGINS TO GROW: EXT. WOODS - DAY - PRESENT JACK looks down to the BAKER. JACK THE ROOF, THE HOUSE, AND YOUR MOTHER AT THE DOOR./ THE ROOF, THE HOUSE, AND THE WORLD YOU NEVER THOUGHT TO EXPLORE./ AND YOU THINK OF ALL OF THE THINGS YOU’VE SEEN./ AND YOU WISH THAT YOU COULD LIVE IN BETWEEN,/ JACK now scurries down the tree. JACK (CONT’D) AND YOU’RE BACK AGAIN,/ ONLY DIFFERENT THAN BEFORE,/ AFTER THE SKY. THERE ARE GIANTS IN THE SKY!/ THERE ARE BIG TALL TERRIBLE AWESOME SCARY/ WONDERFUL GIANTS IN THE SKY! JACK jumps from the",
      "dialogue_count": 0,
      "word_count": 5207
    },
    {
      "scene_number": 10,
      "slugline": "EXT. VILLAGE -   NIGHT - CONTINUOUS TRUMPETS sound. The C-PRINCE, the STEWARD and the RETINUE ride through the town, as VILLAGERS open their windows and rush out of their houses. STEWARD Let it be known that his Royal Highness the Crown Prince will be visiting every house in this   village tonight. INT. CINDERELLA’S HOUSE - KITCHEN - NIGHT - CONTINUOUS CINDERELLA has only just got back. Grubby again, and wearing her old clothes, she bundles her beautiful dress into a chest. STEWARD (O.S.) All young maidens are hereby commanded to remain in their home until they are visited by the Royal Guard. CINDERELLA goes to the window and looks out. EXT. CINDERELLA’S HOUSE - NIGHT - CONTINUOUS CINDERELLA’S POV: The C-PRINCE and the royal RETINUE arrive in the entry courtyard. BACK ON CINDERELLA. She smiles to herself. INT. CINDERELLA’S HOUSE - KITCHEN - NIGHT The entire STEPFAMILY has assembled, in various stages of undress. LUCINDA stands and watches as the STEPMOTHER tries to force FLORINDA’S large foot into the tiny slipper. BAKER (V.O.) As the Prince anxiously waited, the Stepmother took matters -- and Florinda’s foot -- into her own hands. FLORINDA CAREFUL, MY TOE--! STEPMOTHER DARLING, I KNOW-- FLORINDA WHAT’LL WE DO? STEPMOTHER IT’LL HAVE TO GO./ BUT WHEN YOU’RE HIS BRIDE,/ YOU CAN SIT OR RIDE./ YOU’LL NEVER NEED TO WALK! The STEPMOTHER takes a handkerchief and stuffs it into the girl’s mouth and then pulls a large kitchen knife from her pocket and raises it over her foot--  63",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 253
    },
    {
      "scene_number": 11,
      "slugline": "EXT. CINDERELLA’S HOUSE - ENTRY COURTYARD - NIGHT Standing lanterns have been set up outside the house, bathing the area in light. The STEPFAMILY watches as the STEWARD helps FLORINDA up on to the back of the Prince’s horse. In pain, she grits her teeth in a frozen smile. BAKER (V.O.) Minus one toe, Florinda mounted the Prince’s horse, unaware of the blood dripping from the slipper. As the STEWARD steps back, he notices a tiny speck of blood on his white glove. He looks up to the PRINCE to show him his hand. The PRINCE looks back to FLORINDA who shrugs sheepishly. INT. CINDERELLA’S HOUSE - KITCHEN - NIGHT This time the STEPMOTHER tries to force LUCINDA’S foot into the slipper. FLORINDA looks on with a smirk. BAKER (V.O.) Lucinda was next. LUCINDA WHY WON’T IT FIT? STEPMOTHER DARLING, BE STILL./ CUT OFF A BIT/ OF THE HEEL AND IT WILL./ (she pulls out knife) AND WHEN YOU’RE HIS WIFE/ YOU’LL HAVE SUCH A LIFE,/ YOU’LL NEVER NEED TO WALK! QUICK SHOTS: FLORINDA’S hand over LUCINDA’S mouth. The KNIFE raised up by the mother. LUCINDA’S eyes in fear as we hear a muffled scream and the “WOOSH” of a knife-- EXT. CINDERELLA’S HOUSE - ENTRY COURTYARD - NIGHT The PRINCE and STEWARD wait impatiently in the torchlight. BAKER (V.O.) Minus a heel, Lucinda did her best to swallow the pain. At last, LUCINDA appears, masking her pain with a smile, and limps towards the PRINCE. She is followed by her MOTHER and SISTER.  64",
      "characters": [],
      "action_text": "STEPMOTHER It’s a perfect fit, Your Highness! LUCINDA winks at the PRINCE flirtatiously, then promptly faints to the ground with a thud. The shoe falls from her foot. The PRINCE nods to the STEWARD who walks over and gingerly picks up the bloody slipper. C’S PRINCE Have you no other daughters? STEPMOTHER Only a little stunted kitchen wench, which her late father left behind but she cannot present herself. She is too dirty. Out of the shadows, CINDERELLA appears. The STEWARD hands the slipper to the Prince, who kneels down in front of CINDERELLA and easily slips it on her foot. C’S PRINCE I would recognize these beautiful eyes anywhere. This is the true bride! The PRINCE sweeps CINDERELLA off her feet and leads her to his horse. The two of them ride off. FLORINDA and LUCINDA watch, not at all happy. Then they hear a CAWING (the sound of birds) overhead. They look up, alarmed. BIRD’S POV. Far below, FLORINDA and LUCINDA cower together, dreading what is to come as the CAMERA rushes towards them. BAKER (V.O.) As punishment for their cruelty, Cinderella’s birds swooped down upon the Stepsisters... and blinded them. The BIRDS enter the picture frame, more and more, their CAWING rising to a crescendo until their flapping wings are all we see. EXT. MARSHLAND - NIGHT - CONTINUOUS RAPUNZEL is alone in a mossy bower on an isolated island in the middle of swamp waters filled with POISONOUS SNAKES. She hums a sad refrain. BAKER (V.O.) As for Rapunzel, the Witch had banished her to a swamp in the darkest depths of the forest. ANOTHER ANGLE. The R-PRINCE with a ragged scarf wrapped around his now blinded eyes, sits slumped over on his horse as the animal navigates its way through the marshy expanse. The R-PRINCE lifts his head as he hears RAPUNZEL’S singing.  65 Could it be? The horse, seemingly knowing the way, follows the sound as the R-PRINCE calls her name. R’S PRINCE Rapunzel? Rapunzel? ANGLE ON RAPUNZEL She looks up and cries with delight when she sees her PRINCE across the ",
      "dialogue_count": 0,
      "word_count": 4247
    },
    {
      "scene_number": 12,
      "slugline": "EXT. WOODS - C-MOTHER’S GRAVE - DUSK We TRACK with the BAKER before he comes upon CINDERELLA crying at what’s left of her MOTHER’S GRAVESTONE and tree. BAKER Four eighty two... four eighty three...   (beat) Excuse me, ma’am. Have you seen a boy...   (notices she is crying) I’m sorry, may I be of some service? She looks to the BAKER and immediately turns her head for fear she will be recognized. CINDERELLA The tree has fallen. Mother’s grave, destroyed. BAKER (confused) Oh. I’m sorry. CINDERELLA I shouldn’t complain. I’m sure others have suffered worse after the earthquake. BAKER Earthquake? It’s no earthquake -- there’s a giant terrorizing the kingdom! CINDERELLA Well, I’m sure the Prince will see to it that the Giant is rid from our land. BAKER Hah, the Prince? No doubt he’s off somewhere seducing some young maiden. CINDERELLA (She turns to him) What? BAKER You look just like the Princess -- but dirty. Oh no, you are the Princess! He drops to his knees and bows. CINDERELLA Please. Please... Get up! I’m not a princess here. BAKER I’m sorry. I didn’t recognize you.  85",
      "characters": [],
      "action_text": "CINDERELLA I had to disguise myself. I’m not permitted to leave the palace unescorted. CINDERELLA looks away towards the wreckage of her mother’s grave. BAKER If you’d like you can come with me. You will be safe in our company. CINDERELLA thinks for a moment, then nods. CINDERELLA Thank you. BAKER This way. EXT. WOODS - ROOT HOLLOW - DUSK The C-PRINCE is wrapped in an embrace with the WIFE. He suddenly breaks away. C’S PRINCE I must leave you. She looks at him confused. He walks over to his horse and mounts it. C’S PRINCE (CONT'D) Now I must go off to slay a giant. I shall not forget you. How brave you are to be alone in the woods. And how alive you’ve made me feel. And just like that, he rides off leaving a cloud of dust in his wake. WIFE What was that?/ WAS THAT ME?/ WAS THAT HIM?/ DID A PRINCE REALLY KISS ME?/ AND KISS ME?/ AND KISS ME?/ AND DID I KISS HIM BACK? WAS IT WRONG?/ AM I MAD?/ IS THAT ALL?/ DOES HE MISS ME?/ WAS HE SUDDENLY/ GETTING BORED WITH ME? WAKE UP! STOP DREAMING./ STOP PRANCING ABOUT THE WOODS./ IT’S NOT BESEEMING./ WHAT IS IT ABOUT THE WOODS? BACK TO LIFE, BACK TO SENSE,/ BACK TO CHILD, BACK TO HUSBAND,/ NO ONE LIVES IN THE WOODS./ THERE ARE VOWS, THERE ARE TIES,/ THERE ARE NEEDS, THERE ARE STANDARDS,/ THERE ARE SHOULDN’TS AND SHOULDS.   (she stops for a moment)  86  (MORE) WHY NOT BOTH INSTEAD?/ THERE’S THE ANSWER, IF YOU’RE CLEVER:/ HAVE A CHILD FOR WARMTH/ AND A BAKER FOR BREAD,/ AND A PRINCE FOR WHATEVER--/ NEVER!/ IT’S THESE WOODS. She begins retracing her steps. WIFE (CONT’D) (she continues) FACE THE FACTS, FIND THE BOY,/ JOIN THE GROUP, STOP THE GIANT,/ JUST GET OUT OF THESE WOODS./ WAS THAT HIM? YES IT WAS./ WAS THAT ME? NO, IT WASN’T,/ JUST A TRICK OF THE WOODS. JUST A MOMENT,/ ONE PECULIAR PASSING MOMENT... MUST IT ALL BE EITHER LESS OR MORE,/ EITHER PLAIN OR GRAND?/ IS IT ALWAYS “OR”?/ IS IT NEVER “AND”?/ THAT’S WHAT WOODS ARE FOR:/ FOR THOSE MOMENTS IN THE WOODS. She stops to catch her breath and make sure she’s on the right path. ",
      "dialogue_count": 0,
      "word_count": 4878
    }
  ]
}