{
  "slug": "it-2017",
  "title": "it",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 9,
  "characters_count": 0,
  "characters": [],
  "total_words": 23432,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. BILL’S HOUSE - DAY Georgie hurries downstairs, catching a glimpse of their mother SHARON DENBROUGH (30s) in the parlor playing piano, an earthy beauty transported to another world while she plays. INT. KITCHEN - BILL’S HOUSE - DAY George’s stomach sinks as he comes face to face with THE CELLAR DOOR -- the only thing between George and the monster in the basement of his imagination. INT. CELLAR DOORWAY - CONTINUOUS Flinging the door open, George ventures his arm into the DARK VOID. He gropes around and finds the LIGHT SWITCH. Nothing. George snatches his arm back. The dark basement glares back at him, taunting.   One... Two...  Walkie CRACKLES. Georgie jumps, startled. BILL (over walkie) C’mon! H-Hurry up! Recovering, Georgie scrambles down the steps to THE CELLAR SHELF. Sifts through junk as fast as he can: a BROKEN FLASHLIGHT, TURTLE WAX, a bag of colored BALLOONS. He grabs the BOX OF PARAFFIN near the back of the shelf, and hurries back up the stairs as we quickly track towards him, about to pounce. The door slams in our face. INT. BILL’S BEDROOM - DAY Bill melts a chunk of paraffin with a match in a ceramic bowl, then dips his finger into the hot liquid and smears the wax along the sides of the boat. BILL There you go. She’s all ready, Captain. They both grin, the cozy room full of cheerful brotherly love. George kisses Bill on the cheek, startling him. GEORGIE Thanks, Billy. 2.",
      "characters": [],
      "action_text": "BILL D-Don’t forget to put on all your rain stuff before you go out or mom’ll blow a circuit. He goes. Bill looks to the rain-lashed window, piano still playing. He’s suddenly filled with a sense of foreboding. EXT. BILL DENBROUGH’S HOUSE - DAY Holding his boat, George exits through the Front Door. Once more, the Walkie in his Slicker’s Pocket CRACKLES to life -- WILL (through Walkie) Be careful. George stops and looks up at his Brother in the window looking down on him. Georgie gives a little wave. EXT. WITCHAM STREET - LATER A DEAD TRAFFIC LIGHT sways overhead, its black lenses gazing back at A BOY IN A YELLOW SLICKER AND RED GALOSHES. George races down the street past dark houses after his PAPER BOAT, which sluices along a gutter swollen with rushing rainwater toward the intersection. Angle on the dripping street signs: WITCHAM & JACKSON. Rain taps on George’s hood sounding to his ears like rain on a shed roof, a comforting almost cozy sound. The buckles of his galoshes make a merry jingle as he goes. The boat whistles past a blockade of sawhorses marked   DEPT OF DERRY PUBLIC WORKS.   Georgie ducks under one to keep up with his boat. Continues to run, head down until --  SMACK!   He runs right into one of those sawhorses, cutting off his path. Georgie falls back while the Boat sails on. GEORGE No! George gets back to his feet. Chases after his paper boat, reaching it just as it surfs up to the drain, circles around twice, and is swallowed up. George looks ready to cry. GEORGE (CONT’D) Oh, Bill’s gonna kill me. 3. He peers into the storm drain, water falling into darkness. A dank hollow sound comes from within, the boat kicking in and out of the shadows. George snakes his arm through the grate, reaching for the boat, his nose pressed against the curb. Just as he’s about to get it a face appears. A GREASY WHITE FACE George recoils from the storm drain, spooked. That’s when a VOICE, a sad voice, rises up. PENNYWISE This your boat? George looks around, hoping someon",
      "dialogue_count": 0,
      "word_count": 3012
    },
    {
      "scene_number": 2,
      "slugline": "INT. BILL DENBROUGH’S HOUSE - DAY Dust collects on the piano in the living room.   A stale quiet suffocates the house. The only sound the ticking of a clock and the distant yelling of playing children. EXT. BILL DENBROUGH’S HOUSE - DAY Bill walks up his driveway as -- BILL He th-th-thrusts his fists against the po-po-po-po-SH-SH-SHIT... Breathe deep, Bill. Take it slow. BILL (CONT’D) He th-thrusts his fists against the po-posts... B-but still insists he s-sees the ghosts. Skids to a stop at the mailbox. He opens it and sifts through mail, coming across a BROCHURE FOR ACADIA NATIONAL PARK. His face lights up. BILL (CONT’D) Hey Ma. She’s watering their planters, mind a million miles away. Only when one overflows and spills onto her shoes does she snap out of it -- SHARON Damn it, Bill. You could’ve said something. She goes to the spigot and turns off the hose. ZACH (O.S.) Bill! That you?! Bill pushes his bike up to the GARAGE, brochure in hand. Sees his dad, ZACH DENBROUGH (40), sits at his woodworking bench whittling a lump of wood into a DUCK DECOY. Behind him dozens of colorfully painted decoys are arranged on display. BILL Western Grebe. Want help painting -- ZACH I thought we agreed. 16.",
      "characters": [],
      "action_text": "He points to the corner, which is taken up by an elaborate, labyrinthine, scale model of the Derry sewers made out of yellow plastic hamster tubes. BILL Before you say anything. ZACH Bill -- BILL Just let me show you something first... Bill grabs a G.I. JOE ACTION FIGURE off the tool bench and sticks it in the tubes. He turns on the hose, sprays it at the model, and G.I. Joe goes sweeping through the plastic tunnels. Shooting onto the drain marked “Barrens.” BILL (CONT’D) The Barrens. It’s the only place -- ZACH He’s gone, Bill. BILL But if the storm swept Georgie in, we should’ve -- ZACH He’s gone. He’s dead. What’s done is done. Now please take it down. Zach folds a SEWER MAP that Bill had stapled above. ZACH (CONT’D) And next time you take a sewer map from my workshop ask permission. Gut punched. Bill looks to a HAMSTER IN AN EMPTY CAGE. BILL Guess you get your tunnels back. As he starts disassembling the model -- quietly, to himself -- BILL (CONT’D) He thrusts his fi-fists... against the po-posts... Water leaks from the mouth of the hose and pools slowly at his feet. A sinister tremor disturbs its surface, or the reflection of a face... 17.",
      "dialogue_count": 0,
      "word_count": 425
    },
    {
      "scene_number": 3,
      "slugline": "EXT. COSTELLO AVENUE MARKET - LATER Mike exits and hops on his bike. Doesn’t notice Victor’s Trans Am pass him on the street. But we do. And as Mike takes off in the other direction we keep with the Trans Am as it stops and makes a slow U-Turn. Uh-oh... EXT. EDGE OF TOWN - DIRT ROAD - LATER Mike on his bike. On his own. Working his way back to the Hanlon Homestead when -- Victor’s Trans Am appears behind him. INT. VICTOR’S TRANS AM - CONTINUOUS Victor behind the wheel. Travis reaches over and HONKS the horn. Mike turns.   “Oh shit... ” all over his face. EXT. EDGE OF TOWN - DIRT ROAD - CONTINUOUS Mike pedals fast as the Trans Am screams up on him, like it’s going to chew ‘im up and spit him out. At the last second -- Mike turns off the road. Losing control of his bike. Leaps off but its speed keeps it upright and it CRASHES into -- A GNARLED, LIFELESS TREE. Trans Am blasts past Mike. Amazing you can even hear their laughter over the roaring engine. Leaning out of the window -- TRAVIS Stay the fuck out of my town! Trans Am disappears around the bend. But it isn’t until the sound of the engine fades that Mike gets back to his feet. Collects himself. Walks back to his bike, half-hidden in the bushes. Rips it free from the brushwood and kneels to examine it. Bent rim, broken spokes, snapped chain. As he inspects the tires, he freezes. Like he senses a presence behind him. He turns right as --  Something   darts into the bushes. Can’t be sure what it was but it looked like a messy mass of MELTED HANDS. 18.",
      "characters": [],
      "action_text": "Not wanting to investigate further, Mike stands and starts to quickly push his bike back onto the road and out of town. INT. DERRY SYNAGOGUE - DAY Stanley reads from the TORAH as the RABBI -- aka Stanley’s Dad -- watches over his shoulder. Waiting for a fuck up. STANLEY  Baruk atah Adonai, eloheynu meleek...  There it is. RABBI  Melehk.   Start again. Trying harder -- nervous -- STANLEY  Baruk atah Adonai, eloheynu melehk... melehk...  Oy vey -- RABBI  Ha‘olam...  STANLEY  Ha’olam, asher bahkar mikal..  RABBI  Banu mikal!   You’re not studying, Stanley. You’re not studying and yet this is exactly what this time is about... Taking responsibility for one’s own religious life. If you don’t want to study for you, think of your mother. Think of me. How is it going to look if the Rabbi’s son can’t even finish his reading? Do you want to bring shame on me and your mother, after all we’ve done for you? STANLEY No, sir. RABBI Or on people of this Synagogue? STANLEY No, sir. 19. RABBI On yourself? Stanley shakes his head. STANLEY No, sir. RABBI Your actions say otherwise. Stanley’s eyes well up with tears. Doesn’t want to be a disappointment. Not to his Father. Not to anyone. The Rabbi hands Stanley the scroll. RABBI (CONT’D) Put the scroll away. No one up here is using it anyway. INT. DERRY SYNAGOGUE, DOWNSTAIRS - MOMENTS LATER Ashamed, Stanley walks down the old, molding stone stairs to the basement of the synagogue. He finds his DAD’S OFFICE A scholar’s study. Rabbinical papers, journals, and books. So many books. On one of the walls hangs a PAINTING:   Judith.  Standing naked, holding her sword in one hand and the decapitated, bloody head of Holofernes in the other. Stanley glances up at Judith as he passes with the scroll. Like he can’t help himself. Even though he’d rather not.  Creak...  Behind him, the Door to the Mikveh OPENS. A darkness beyond, seems to beckon him. Stanley steps toward. Like he might enter. But instead -- He SLAMS the door shut. Spooked. EXT. NEIBOL",
      "dialogue_count": 0,
      "word_count": 6904
    },
    {
      "scene_number": 4,
      "slugline": "INT. BEVERLY’S APARTMENT, LIVING ROOM - NIGHT ...into her father, who comes charging up the hall. She screams again, recoiling away. MR. MARSH You okay, Bevvie? BEVERLY The bathroom! In the bathroom-- He places his hand on her cheek, tender. MR. MARSH Daddy’s here now. It’ll be okay. He takes her hand.   They step into... INT. BEVERLY’S APARTMENT, BATHROOM - NIGHT Mr. Marsh looks around, eyes wide, blood splattered everywhere, but the blood doesn’t register with him. MR. MARSH Bevvie, child, what’s my tape measurer doin’ outta my toolbelt? He steps over and grabs the BLOOD-COATED TAPE, clipping it onto his belt, blood on his hands now too. MR. MARSH (CONT’D) You should ask me if you want to touch my things. I ask you, don’t I? BEVERLY I-- I-- He doesn’t seem to see any of it. Only Beverly can.   She realizes this. He pulls back the shower curtain, leaving behind bloody fingerprints.   A spider scurries toward the drain. MR. MARSH Was that it?   A spider? Bev’s speechless.   She staggers back.   He catches her wrist. MR. MARSH (CONT’D) Bevvie, you okay? 51.",
      "characters": [],
      "action_text": "BEVERLY Yes. That’s it. The spider. MR. MARSH (smiling) I thought so. They can’t hurt you. You know that don’t you? He crushes the spider under his boot, grinding it in. BEVERLY Yes, sir. I’m sorry for waking you. He comes over to her, smoothing out her hair over her forehead, proprietary.   The blood on her face like finger paint.   This is when he scares her the most. MR. MARSH You worry me, Bevvie. You worry me a lot. BEVERLY I know, daddy. He rests his forehead against hers, breathes in her scent. MR. MARSH You’re growing up so quickly. He looks her up and down. MR. MARSH (CONT’D) You were Daddy’s little girl, now, you’re changing. Tell me you’re still Daddy’s little girl? She averts her eyes, nods, placating. Satisfied, he goes back down the hall to his game. Beverly darts into her bedroom, slamming the door behind her. INT. DETAIL ON CEILING - NIGHT ANGLE ON a wet, dark spot as it grows on a white plaster ceiling, the first droplet of water forming. SLOW MOTION as it breaks away and falls through space... SMASH CUT TO: INT. BILL’S BEDROOM - NIGHT ...onto Bill’s face. He doesn’t stir. More droplets follow.  Tap, Tap, Tap.   Finally, Bill awakes. Looks up at: 52. A leak in the ceiling. Bill flips back his covers. INT. BATHROOM HALLWAY - NIGHT Bill grabs a bucket from a utility closet and walking back sees the door open to the GEORGIE’S ROOM, a light on... INT. GEORGIE’S BEDROOM - NIGHT Bill enters, the room frozen in time. GEORGIE’S TOY BOX is open, a Lego Turtle standing next to it, as if taken out to play. Bill picks it up and sits down, Turtle in hand. He indulges in the sadness that has engulfed his home for months. The loss of his brother hitting him full force, he closes his eyes to fight back the tears, but cannot. He cries for Georgie. Photographs of Georgie, illuminated by passing cars, seem to watch him from the walls. A SHADOW seems to stretch across Georgie’s room from the doorway. Bill looks up but no one is there. INT. CORRIDOR - BILL’S HOUSE - NIG",
      "dialogue_count": 0,
      "word_count": 1118
    },
    {
      "scene_number": 5,
      "slugline": "INT. TRAVIS BOWERS HOUSE, TRAVIS’ BEDROOM - DAY Travis puts cream on FRESH BELT LASHES across his back.   All around him on the walls are posters of monster trucks. A HONK from outside. He throws down his shirt and goes into the LIVING ROOM Passing his father, Officer Bowers. In his knock off La-Z-Boy drinking a beer and watching the newest episode of ‘COPS’. OFFICER BOWERS Where you off to? TRAVIS Out with the guys. Travis goes to pass him. Officer Bowers reaches out and stops his son from going any further. Travis straightens. Knows the routine all too well -- TRAVIS (CONT’D) Vic’s house. Probably stop at Red Apple first, pick up some things. Officer Bowers stares him down. Like he isn’t sure what to do with his son. Most likely knock him around some more. But nah, too much work right now. OFFICER BOWERS Get me another beer from the fridge before you leave. EXT. TRAVIS BOWERS HOUSE - MOMENTS LATER Travis runs out to Victor and Belch waiting in Victor’s Trans Am. Belch is in the Passenger Seat. TRAVIS Out. BELCH I thought-- TRAVIS Did I fuckin’ stutter? Belch gets in the back. 56.",
      "characters": [],
      "action_text": "BELCH You hear from Hockstetter any? Vic and I are wondering -- TRAVIS Who cares. VICTOR What about your dad? He get on you about the knife? TRAVIS That fat ass knows he touches me I’ll rip his head off. Now can you fucking drive please and thank you very fucking much? BELCH Where to? And as if to answer to his question, Mike rides by on his bike. Off to collect more payments. TRAVIS Go. EXT. LOWER MAIN STREET - CONTINUOUS Bill and Richie wait as Ben, Stanley and Eddie join them. STANLEY What’s going on? BILL Bev called. She’s freaked out about something... Sh-sh-she told us to wait out here until -- Beverly bursts out of the Apartment Building. BEVERLY You made it. I need to show you guys something... BEN What is it? RICHIE Did we just win the Publishers Clearing house ten million dollar sweepstakes? If Ed McMahon is in there I’m to going to lose my sh-- 57. BEVERLY I just need to know I’m not crazy. But my Dad will kill me if he finds out I had boys in our apartment. BILL We’ll leave a lookout. Richie? RICHIE Yeah, whatever. Ed McMahon can wait... Bill, Stanley, Ben and Eddie go with Beverly. INT. BEVERLY’S APARTMENT - DAY Beverly opens the door. Afternoon sunlight illuminates floating dust motes as Bill, Ben, Stanley and Eddie follow her to the closed BATHROOM DOOR. BEVERLY In there. STANLEY What are we about to walk into? BEVERLY You’ll see. She has no intention of going in. Bill pushes past Ben and opens the door. EDDIE Oh God. Oh God. THE BLOOD Still there, faded into maroon clouds on the mirror and wallpaper. Eddie reels back into the hallway with Beverly. She looks from Ben to Bill. BEVERLY You see it? Bill nods. BILL What happened? Beverly is so relieved she almost cries. 58. BEVERLY The sink. It came out from there. My Dad couldn’t see it. I thought I was going crazy... BILL You’re not going crazy. I saw something too. STANLEY You did? BILL Georgie. EDDIE Like a ghost? BILL N-no. He tried to get me to go into the basement with him. It wasn’t just him eithe",
      "dialogue_count": 0,
      "word_count": 674
    },
    {
      "scene_number": 6,
      "slugline": "EXT. BEVERLY’S HOUSE - DAY Eddie and Richie stand lookout on the curb below. Eddie still disturbed by what he saw. EDDIE So much blood... INT. BEVERLY’S BATHROOM - DAY While Ben and Stanley carry out trash bags of soaked towels, Bill and Beverly pour the last bucket of pink water down the bathtub drain. The bathroom now as clean as it ever was. The bucket is filled with blood stained rags. BEVERLY January embers... BILL Huh? BEVERLY The poem? BILL (embarrassed) I don’t really know much poetry. He turns on the faucet to flush out the sink. BEVERLY Oh. Nevermind then. I was just... They watch the water cyclone around the drain. Hoping the awkwardness will get flushed away too... BEVERLY (CONT’D) It’s not true, y’know. What they say about me... BILL I know. I never b-believed it. None of us do. We like ha-hanging with you... Beverly smiles. Relieved. Shuts off the water. BEVERLY Thanks, Bill. 60.",
      "characters": [],
      "action_text": "BILL Don’t thank me too much. Unfortunately according to most people hanging with us makes you a loser... INT. BEVERLY’S APARTMENT, BEDROOM - CONTINUOUS Ben stands, stunned at the wonder of being in   her   room. He hears a giggle and looks out into the hall. Sees Bill and Bev at the end of it, having their moment. CUT TO: A PUDDLE. Reflection of the Losers’ ripple away as they push their bikes through it, walking along the stretch of KANSAS STREET That borders the Barrens. Beverly looks over at Bill. His brow furrowed. Like he’s trying to solve a complicated math problem in his head. BEVERLY What is it, Bill? BILL All that blood at your place, and you s-say your folks didn’t see any of it... Last night at my house, with Georgie and the water, my Dad just acted like everything was normal... I think if you’re a grown up... EDDIE They can’t see It. RICHIE Can’t see what? BEVERLY It. BILL That’s why the cops won’t help, our parents, teachers... They stop. Because up ahead they see VICTOR’S TRANS AM. Parked on the side of the road. 61. EDDIE We should -- BILL Wait. He points to MIKE’S BIKE tangled in the weeds next to it. BILL (CONT’D) Isn’t that Mike’s? BEVERLY We have to help him. RICHIE We do? BILL If we don’t, who will? That could be any one of us... CUT TO: A PILE OF FRESH, GROUND MEAT. Raw, bloody. A fly buzzes around it. Like,   jackpot...  TRAVIS (O.S.) Eat it. Belch and Victor continue laughing as -- Travis’ WORK BOOT pushes Mike’s head closer to the meat in the dirt. Mike tries to resist. But Travis pushes harder. We’re in the BARRENS TRAVIS (CONT’D) Eat it, ya fucking mutt. Mike’s nose touches the wet meat. The faintest   squish.  Travis pushes down again -- Mike’s hands slip in the gravel --  splat!   --   his face goes into the meat. Travis and his Boys whoop it up. Still flat on the ground, Mike wipes the meat off his face. And even in the midst of this, something BRIGHT RED in the brown and green Barrens catches his eye. A CLOWN?! 62. Watching from the fr",
      "dialogue_count": 0,
      "word_count": 5590
    },
    {
      "scene_number": 7,
      "slugline": "INT. KEENE’S PHARMACY - DAY -- above the door as Eddie enters, his arm still in a cast. He sees Greta at the Cash Register reading a SEVENTEEN MAGAZINE. She watches him, amused. Because she’s bored. MR. KEENE Here for the refills, Eddie? Eddie nods. Mr. Keene sighs and disappears in the back. Once they’re alone -- GRETA No friends, huh? Eddie looks around. She talking to me? GRETA (CONT’D) Your cast. No signatures or anything... So sad. Eddie looks down at his cast. White. Plain. And yeah, sad. EDDIE I didn’t want to get it dirty... Greta leans on the counter. Casts a quick look over to the back counter. Where her father could appear any minute. GRETA You know it’s all bullshit. EDDIE Um, what is? GRETA Your medication. They’re placebos. EDDIE What does placebo mean? Greta shakes her head. This kid just doesn’t get it... GRETA Placebo means bullshit. Just what I said... MR. KEENE (O.S.) Okay, here we are Mr. Kaspbrak... Eddie looks over as Mr. Keene comes back with his Medication.  Ringggg.... Rinnggg....  90.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 180
    },
    {
      "scene_number": 8,
      "slugline": "INT. BEVERLY’S APARTMENT, BEDROOM - CONTINUOUS  Rrrrrrin--  Beverly picks up the phone. BEVERLY Hello? BILL (on phone) Hey. It’s me. Beverly smiles. But still -- BEVERLY You know not to call me here... What happened to our signal? INTERCUT: INT. BILL’S BEDROOM - CONTINUOUS Bill stands at his desk. Below him through the floorboards, we can just make out his parents arguing. BILL You answered before I could hang up. You okay? BEVERLY I’m fine. BILL Y-you hear from anyone? BEVERLY No. You? Bill doesn’t answer. Doesn’t need to... BILL Feel like doing something? I d- don’t like you being alone... BEVERLY I don’t like you being alone either... As they talk, we drift out of the Bedroom and down the Hallway and into the KITCHEN 91.",
      "characters": [],
      "action_text": "To find Mr. Marsh listening on the other line. BEVERLY (CONT’D) Usual spot? Ten minutes? BILL See you then. He hangs up. EXT. TRAVIS BOWER’S BACKYARD - CONTINUOUS Travis does everything he can not to cry. VICTOR You okay, Travis? An odd wind stirs through the grass there, a yellow menacing gathering of clouds overhead. Travis suddenly notices... A BALLOON, bobbing over his mailbox, string connected to something stuffed inside. Travis pushes past his two cronies and goes over to the mailbox. Inside he pulls out THE RAMBO KNIFE. The one he lost at the beginning. A murderous look screws onto Travis’ face as he turns his attention to his house. And his Dad inside. Travis snaps the string and starts toward the front door with the knife. The Balloon rises up. INT. BEVERLY’S APARTMENT, BEDROOM - CONTINUOUS Beverly stands in front of the mirror, buttoning up her shirt. Freezes when she sees behind her -- C reeeeeeaaaak . Of her Bedroom Door as it opens. In the reflection, she can see her Father standing at the threshold. BEVERLY H-Hi, Daddy... MR. MARSH You’re looking prettied up, Bevvie. BEVERLY I’m not prettied up, Daddy. I wear this almost every day... 92. MR. MARSH Who was that you was talkin’ to just now? BEVERLY A friend. Mr. Marsh enters the room. MR. MARSH Is that the boy you been running around with? BEVERLY He’s just a friend. Mr. Marsh sits on the edge of her bed. MR. MARSH Well come over here, give your daddy a minute. She reluctantly goes over. Gives him a kiss. He snatches her wrist as she pulls away. MR. MARSH (CONT’D) You know I worry about you, Bevvie. I worry a lot. BEVERLY I know daddy. She tries to go, but he holds on to her wrist. MR. MARSH People in town got to saying some things to me.   About you.   Sneakin’ around all summer long with a pack of boys. Only girl to the pack. BEVERLY They’re just friends Daddy, I swear... MR. MARSH I know what’s in them boy’s minds when they look at you, Bevvie. All too well... He squeezes harder. It begins to hurt. BE",
      "dialogue_count": 0,
      "word_count": 2282
    },
    {
      "scene_number": 9,
      "slugline": "INT. BASEMENT - CONTINUOUS The Boys search the shadows of the basement for Bill. Somehow it seems more sprawling than the house above them. Near Eddie. A ‘ did I just hear that ?’ WHISPER -- BILL (O.S.) Eddie! Eddie turns. Where’d that come from? EDDIE Bill? He creeps further into shadow. Stops. Senses something off. Looks down at his feet as the floor opens up under him. He drops into a SMALL ROOM Like we’re inside a tumor. Walls made of SCABS and SCARS. Floor cobbled with WARTS and ULCERS. Eddie groans. EDDIE (CONT’D) I think I’m gonna be sick... Behind him, the Hobo appears and grabs him. HOBO I already am. Eddie SCREAMS. INT. BASEMENT - CONTINUOUS Ben turns, realizing -- BEN Where’s Eddie? He was just here. STANLEY It’s separating us. We need to get help... They move toward the stairs. But Travis appears at the top. He starts to descend. Blood-caked Knife in hand. TRAVIS Baaaa... Baaaa... 103.",
      "characters": [],
      "action_text": "RICHIE Guys -- it’s never good when the person with the knife starts making animal noises -- especially when that person is Travis... Ben turns. Searches for a way out. Finds a Rotted Piece of Plywood blocking the bottom of a rusted COAL CHUTE. BEN Here! Climb up! The Others race over. As Travis steps off the stairs, Mike guards the chute with the Stunbolt as the other squeeze themselves in and up -- BEN (CONT’D) Mike! Let’s go! Mike crawls in. But the Others aren’t yet out. STANLEY Shit... Mike... MIKE Just go. Find the others. I’ll hold Travis off... RICHIE Mike -- MIKE (re: Stunbolt) I came prepared, remember? Mike ducks back out of the Chute. And faces his nemesis. EXT. MACROVERSE - CONTINUOUS Beverly continues through the thick fog of suffocating blackness. Sticks to her like cobwebs. She stops. Sees a FLICKERING CAMPFIRE in the distance illuminating -- A DECREPIT 19TH-CENTURY CIRCUS WAGON. The same we saw in a daguerreotype of the Old Ironworks in the Libary. Its peeling billboard promises   “PENNYWISE THE DANCING CLOWN!”   Tattered children’s clothes, toys, and bones are scattered all around its small painted wooden wheels. From the WELL nearby, she hears -- 104. BILL (O.S.) HELLO? ANYONE? BEVERLY BILL! She races over to the Well. Looks inside and sees a GLOWING ORANGE LIGHT. Its dim but the longer we look, the brighter it gets... Beverly tries to back away but --  ClankSnap! ClankSnap!   Chains WHIP OUT and WRAP around her. Holds her there. She can’t look away. Her face goes slack. PENNYWISE (O.S.) Come float with us, Bevvie... INT. SEWER - CONTINUOUS Bill runs through the sewers. Desperate. Up ahead, he hears Eddie SCREAMING. He races in the direction of his howls. BILL EDDIE! Stops at a Derry Public Works MAINTENANCE DOOR. Keep out. Bill looks through the small grated window to see -- The Hobo wrangling Eddie. His Hand of Disease smothering Eddie’s mouth as Eddie hyperventilates. Or tries to. BILL (CONT’D) FIGHT IT, EDS! FIGHT IT! Seeing Bill, Eddie’s eyes",
      "dialogue_count": 0,
      "word_count": 3247
    }
  ]
}