{
  "slug": "it-follows-2015",
  "title": "it follows",
  "genre": "romance",
  "format": "film",
  "scenes_count": 17,
  "characters_count": 4,
  "characters": [
    "KELLY",
    "YARA",
    "JEFF",
    "JAY"
  ],
  "total_words": 24474,
  "total_dialogue": 4,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. SUBURBAN STREET - NIGHT 1   1  ANNIE (20) stumbles out the front door of her parent's  lakeside home.   She's in her pajamas, - wearing red pumps. She  moves with urgency and a primal fear.  She looks back as she runs, turning onto the street.  We hear the screen door open and close again.  Annie slows down, a few houses down.   She stops and turns  towards her home, standing in the center of the street.  Street lamps and oak trees line the block.  It's quiet.   Annie stares ahead - seeing something - she  starts to back up.  One step.   Then another. Click of heels on concrete.  Slowly, tracking backwards, Annie remains focused on something  - fearful.   We see nothing.  Nearby, a young couple, pulling groceries from their car  notice Annie walking in the street.   The WOMAN steps towards  the sidewalk - concerned.  WOMAN  Hey, are you ok?  Annie nods to the woman, but remains focused on something  else.  WOMAN  You need some help?  ANNIE  No.  The woman shrugs to her husband and turns away.  Annie turns - aware of something closing in.   She continues  stepping backwards.  A door opens.   ANNIE'S FATHER steps onto his front porch,  frazzled.   He looks around and sees Annie in the street.  ANNIE'S FATHER  Annie!   What are you doing?  Annie looks to her dad, then back to the street - continuing  to move away.  ANNIE  I'm fine, dad.  (CONTINUED)",
      "characters": [],
      "action_text": "ANNIE'S FATHER  Where are you going?  ANNIE  Nowhere.  Annie looks back to her dad and the open door.   She sprints  forward, rounding her imagined chaser.  Annie races across the lawn towards her father.  ANNIE'S FATHER  What the hell, Annie?  She hops onto the porch, flashes a smile to her dad and runs  into the house.   Confused, her father follows her.  It's quiet again outside.   The couple carry their groceries  inside.  Moments later, Annie runs out the front door, keys in hand - a  purse over her shoulder.  She sidesteps across the porch and climbs into her car.  Starting the engine, Annie speeds away as her father runs  outside once more.  INT.   ANNIE'S CAR - NIGHT 2   2  Annie drives down a dark street - with wild abandon.  The radio is on.  Her cell phone rings from inside her purse on the passenger  seat.  EXT.   LAKE ST. CLAIRE - NIGHT 3   3  Annie's car is parked at the edge of a beach. The driver's  side door is open. The headlights are on.  Near the water, Annie sits alone in the wet sand, facing the  car.  A ring tone chimes - muffled through the cloth of her purse.  She stares.   Focused.   Terrified.  Annie looks ahead at the shadow-filled horizon of sand. Late  night mist flows across the beams of her car headlights.  Reaching into her bag, Annie grabs her cell phone and presses  a button.   She's nearly crying as she holds the phone to her  ear.  2.  CONTINUED: 1   1  (CONTINUED) ANNIE  Dad?   Hi.   I love you...  She listens - watching her surroundings. The water continues  to splash lightly behind her.  ANNIE  I know.   I know.   I just wanted you  and mom to know how much I love you.  Annie stares ahead. We see her point-of-view - headlights  beaming down across the sand, illuminating her footprints. The  dark trees shift and sway.  We hold on this frame, even as Annie continues to speak...  ANNIE  I'm sorry I can be such a shit to you  sometimes.   I don't know why I do  that.   Just know that I love you, ok?  I just really... love you both",
      "dialogue_count": 0,
      "word_count": 820
    },
    {
      "scene_number": 2,
      "slugline": "EXT.   JAY'S BACKYARD - DAY 4   4  JAIME \"JAY\" HEIGHT, a pretty 19 year old girl, relaxes in her  hot tub - sipping a cola. Droplets of sweat dot her cheeks and  forehead.  A breeze pushes a swarm of white dandelion seeds through the  air, swirling past the young woman's face.  Jay stares up at a couple of birds hopping along the telephone  wire overhead.   She smiles as they hop and peck - sharing some  food.  A squirrel races along the wire causing the birds to fly away.  Jay looks down - stretching her arms out in the hot water.  She looks at her hands and legs immersed in bubbles. The  bright sun reflects against the surface.  Something irritates her shoulder. Jay turns her head and looks  at her upper arm just above the water. She sees a tiny red ant  moving toward her elbow.  She watches it closely for a moment, then lowers her arm into  the water, dispelling the tiny insect in a swirl.  The glass door slides open - KELLY, Jay's 17-year-old sister,  leans out from the doorway in her summer clothes - it’s an  Indian Summer.  KELLY  Hey Jay.  JAY  What's up?  KELLY  Nothing.   Paul and Yara are here.  We're gonna watch a movie if you feel  like it?  JAY  Thanks, I'm going out actually.  KELLY  That guy?  JAY  Yeah.  Kelly swings a bit - hanging onto the door handle.   She flips  her hair up with a goofy smile and looks to her sister.  KELLY  I like him.  4.  (CONTINUED)",
      "characters": [],
      "action_text": "JAY  Yeah me too.  Kelly steps inside and slides the door half-shut.  Across the backyard fence, Jay notices movement in the  neighboring yard.  Looking closely, she sees two pairs of eyes peeking out from a  pile of lumber. The NEIGHBOR BOYS spy on her through the chain-  link fence.   A couple dumb little kids - ages 8 and 11.  Jay gives them a dirty look and points.  JAY  I see you.  The boys duck down out of view.  JAY  Don't you have a video game to play or  an animal to torture?  Jay slides deeper into the tub.   She holds her mouth just  above the surface of the water.  INT. JAY'S HOUSE - DAY 5   5  Jay walks inside, wrapped in a towel, her hair wet.  In the adjoining living room, Kelly sits with her friends  watching a bad comedy. They're sprawled across the furniture.  On tv: a man talks with his English-speaking dog about the  woman he loves.   The dog offers bad romantic advice.  PAUL, 17, eats cheese curls on the lounge chair.  YARA, 17, is slumped into the couch cushions with her legs  across the coffee table; a pair or glasses on her nose. She  reads an ebook on her pink-shell-compact smartphone, still  managing to laugh at the television.  Jay stops alongside Kelly and watches a moment of the movie.  Jay smiles and waves to Yara, who glances up just long enough  to see who's around.  JAY  What are you reading?  YARA  The Idiot.  5.  CONTINUED: 4   4  (CONTINUED) JAY  Is it good?  YARA  I don't know yet. It's about Paul.  Paul makes a face toward Yara - irritated.  Jay leans over the couch, letting water drip onto her sister's  face. Kelly swats her away.  PAUL  Hey Jay.  JAY  (smiling at the bunch)  Hey Paul.  MRS. HEIGHT, Jay's mom, drinks wine and smokes in the dining  room - chatting on the telephone.   Laughing.  MRS HEIGHT  (into phone)  Oh no I'd love to.   That sounds fun.  I could come over and cook for you if  you'd like. I make a really delicious  quiche. Do you like quiche?  The woman continues to flirt and smile through the telephone  rece",
      "dialogue_count": 0,
      "word_count": 729
    },
    {
      "scene_number": 3,
      "slugline": "INT.   JAY'S BEDROOM - DAY 6   6  Jay adjusts her blouse in the mirror.   She looks at herself -  admiring and critiquing.  Leaning close to her reflection, she puts on her make-up.  A polaroid on the mirror shows her drinking a beer with Paul  at a dark indoor swimming pool - much younger.  Dirty clothes hang from chairs or sit in piles along the  floor. Old dolls boxed in a corner. A scuffed and dirty  yearbook. Things covered in dust - all bathed in the green &  orange haze of summer light through curtains and a nearly  imperceptible post-adolescent mist.  Jay moves a lock of hair across her forehead - finessing its  placement - being picky.  She laughs at herself and blows a gust of air up - causing her  bangs to flip.  From across the room we watch the rest of the scene:  Jay walks to her dresser and grabs a pill bottle from atop it.  She opens the plastic container, pops out a pill and swallows  it.   No water necessary.  Jay sets the bottle down and re-examines her outfit and shoes  in the mirror.  A pose - how does my ass look?   Ok.  A coy glance at herself.   A funny bug-eyed face. A raspberry  from buzzed lips and exhaled air.  We hear a deep rumbling as the camera pushes in towards the  mirror, moving tightly on Jay's lips as she covers them in  dark pink lipstick.  EXT. MOVIE THEATER - DAY 7   7  Jay stands alongside her date, HUGH (21), waiting in a long  line to buy tickets.   They stand under the marquee, looking  out at the street and the passing crowds.  Hugh has a look of contentment on his face.   The couple kiss.  A woman behind them glares and makes a face - jealous and  irritated by their public affection.   They don't notice - only  us.  JAY  You ever play the \"trade game\"?  7.  (CONTINUED)",
      "characters": [],
      "action_text": "HUGH  No.   What is it?  JAY  It's a people watching game.   My  sister and I used to play it when we  were bored.  HUGH  (teasing)  You're bored right now?  Jay smiles and shakes her head in playful frustration.  JAY  (stern but loving)  No.   Shut up.   Let me finish.  HUGH  Alright, how do we play?  JAY  OK.   You start by watching the crowd -  casually scope out the people around  us.  Hugh turns and looks at the people at the rear of the line -  then toward a group near the lobby.  HUGH  Ok.  JAY  Now without telling me, pick one  person that you'd like to trade places  with.   It could be anybody.   For  whatever reason.  Hugh nods and scans the crowd.   Jay does the same.  HUGH  Ok.   I got one.  JAY  So now I get 2 guesses to figure out  who you picked and why you want to  trade places with 'em.  HUGH  Alright.   Good luck.  Jay looks around the crowds of people on the street.   She  zeroes in on a very large man with a long beard.  8.  CONTINUED: 7   7  (CONTINUED) JAY  Him.  Jay giggles and points casually at the big man.   Hugh looks  and laughs, shaking his head.  HUGH  No.  JAY  You could pick up cars and throw them  if you were that guy.  HUGH  Yeah, but he's not my pick.  INT. MOVIE THEATER LOBBY - DAY 7A   7A  Waiting in line for popcorn with Hugh, Jay looks around the  elegant lobby. She notices a well dressed, good looking guy  talking to a hot blonde in a short dress.  JAY  That guy.  Hugh shakes his head - no.  JAY  I figured you'd wanna sleep with the  hot blonde.  HUGH  Nope.   She's not even cute.  Jay rolls her eyes.   Hugh is clearly lying about the woman's  attractiveness.  JAY  Ok.   Who was your trade?  Hugh looks over at a couple standing by the stairs with their  little boy - feeding him movie theater junk food.  HUGH  Him.  JAY  The dad?  HUGH  No.   The son. How cool would it be to  have your whole life ahead of you?  Jay shrugs - thinking about it.  9.  CONTINUED: (2) 7   7  (CONTINUED) JAY  Come on. It's not like you're an old  man.",
      "dialogue_count": 0,
      "word_count": 1294
    },
    {
      "scene_number": 4,
      "slugline": "INT. '67 FORD GALAXY - NIGHT 11   11  Hugh's car is parked on the street near Jay's house.   The pair  are making out passionately.  Mid-kiss, Hugh peeks out the window, looking into the dark  night.  Jay pulls away from the kiss and reaches for Hugh's pants  zipper.   He gently guides her away.  HUGH  I want to, but...  Jay looks at Hugh - worried that she did something wrong.  HUGH  My stomach... still...  Jay gets it.   She smiles and nods.  JAY  Ok.  HUGH  I'll see you soon?  JAY  Yeah.  HUGH  Bye.  JAY  Bye.  Jay climbs out and jogs up to her front porch, pulling out her  keys.   Hugh drives off with a wave.  INT. JAY'S CAR - MORNING 12   12  Jay drives her car along the crowded I-75 expressway - into  the city.   Detroit is grey and flat.  A radio DJ comments on the Indian Summer.  EXT.   WAYNE STATE UNIVERSITY CAMPUS - MORNING 13   13  With backpack over shoulder, Jay walks along the half empty  path.   Campus buildings loom.   Old architecture resting on  broken sidewalks.  13.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 176
    },
    {
      "scene_number": 5,
      "slugline": "INT.   STUDENT CENTER - DAY 14   14  Jay eats fast food alone at a table.   She watches other  students pass through the large modern corridor.  Jay chews and looks down at her drink.   A paper cup.   A  plastic lid.   A straw.  The chatter mixes together into a blur of voices.  EXT.   NEIGHBORHOOD STREET - DAY 15   15  A LITTLE GIRL on a distant porch covers her eyes and counts to  10. Her friends run and scatter behind bushes and garbage  cans.  LITTLE GIRL  7...8...9...10... here I come!  A bunch of LITTLE KIDS are playing FREEZE TAG on a distant  front lawn. They scream and laugh as they run from each other.  Once tagged, they stand frozen, until someone else crawls  under their legs and frees them.  Jay walks with Kelly down the sidewalk, drinking Slurpees -  They pass by the children's game in progress.  Kelly pulls out a pack of cigarettes and lights one.   She  takes a drag.  KELLY  Thanks for walking with me.  The two girls step leisurely down the block.  JAY  Mom knows you smoke.  KELLY  Yeah, but she'll cry if she actually  sees it happening.  JAY  Or she'll steal your cigarettes.  Kelly shakes her head.  Jay takes a sip from her drink.   She looks out at the green  lawns and clean suburban stretch ahead of her.  KELLY  How's it going with Hugh?  14.  (CONTINUED)",
      "characters": [],
      "action_text": "JAY  Good.   Mostly.   He was acting kind of  weird last night.  KELLY  Why?  JAY  I don't know.   He said he wasn't  feeling good, but it seemed like  something was on his mind.  Kelly exhales - stepping down the street.  KELLY  Have you... um...?  Jay looks at her sister.  JAY  No.   I know he wants to... but last  night... he seemed different.  Kelly starts to laugh at her sister.  KELLY  (teasing dryly)  Maybe he's a virgin?  JAY  He's not.   I mean, I don't know for a  fact, but... no.  KELLY  So what's the problem?  JAY  I don't know.  An old woman approaches, walking her dog.   The girls pet the  animal as it passes.  OLD WOMAN  (looking at her dog)  She loves the attention.  JAY  Yeah.  The woman walks on and the girls resume their journey home.  JAY  You're still... ?  15.  CONTINUED: 15   15  (CONTINUED) KELLY  Me?  Jay nods.  JAY  You haven't... ?  Kelly looks at Jay - then finally understands what she's  getting at.  KELLY  I haven't slept with anybody.   Not for  any real big reason or anything.   I  will... eventually.   Maybe soon. Any  minute now.  JAY  Whenever.  KELLY  Yeah.  JAY  What about Paul?  KELLY  Ehhh.   We kissed once and it didn't  feel right.   He's more like a  brother... although he's kind of in  love with you. So I don't know what  that means.  Jay smiles and thinks about it for a moment.  JAY  It'd be like fucking my step-brother.  Kelly starts to laugh.  KELLY  Gross.  The two sisters smile and share a laugh.  They pass before a modest house with a pristine lawn. A  fighting couple - possibly a girl mid-tantrum - can be heard  inside. We see Jay's POV as she stares at the brick ranch  home, passing it slowly. She shakes it off and continues down  the suburban block. The yelling fades.  Kelly takes a final drag, then tosses her cigarette into the  street.  16.  CONTINUED: (2) 15   15  (CONTINUED) KELLY  Do I smell bad?  Jay leans over and smells her younger sister.  JAY  You smell like cherry coke, banana  nicotine.  KELLY  That's m",
      "dialogue_count": 0,
      "word_count": 1250
    },
    {
      "scene_number": 6,
      "slugline": "EXT. DARK LOT - NIGHT 19   19  The old Ford sits at the back of a dark, dirt lot.   Woods and  an old factory surround the car.   We watch from a distance as  faint silhouettes move within the vehicle.  One of the back doors opens and Hugh climbs out, pulling up  his boxers.   He walks around the car and opens the trunk.  Partially obscured, we wait as he attends to something at the  back of the car.  The clinking of bottles and junk. The sound of a beer can  opening.  JAY  It's funny, I used to daydream about  being old enough to go on dates and  drive around with friends in their  cars.  Some viewers might notice the absence of a license plate.  INT. '67 FORD GALAXY - NIGHT 20   20  Jay lays across the length of the back seat, resting on her  stomach.   She kicks her heels up playfully as she pokes her  head out the open door.  We hear the trunk close. The sound of footsteps.  JAY  I had this image of myself holding  hands with a really cute guy,  listening to music on the radio and  driving along a pretty road... maybe  somewhere up north... after the trees  started to change color.  Opening the opposite rear door, Hugh crawls inside the car,  laying across Jay.   He kisses the back of her neck.   Caresses  the side of her bare waist.  Jay grins as Hugh kisses her.   She rests her cheek on the  leather seat.   Deep and slow breaths.  JAY  It was never about going anywhere...  just having some kind of freedom I  guess. Now we're old enough, but where  the hell do we go right?  Then with force and quickness -  20.  (CONTINUED)",
      "characters": [
        "KELLY"
      ],
      "action_text": "Hugh pushes a small cloth over Jay's mouth.   She tries to move  away, but he holds her head down until her eyes close.   She  stops struggling.  Jay rests quietly again - a cheek on the leather seat.   A half  open mouth.   A drop of drool.   A long and deep breath.  Darkness.  The sound of wood being dragged across a concrete floor.  A metal door closes.  Footsteps.   Breathing.  Jay slowly opens her eyes.  INT. ABANDONED FACTORY - NIGHT 21   21  Jay looks around the old factory floor.   A giant open space  lit dimly by moonlight and distant street-lamps.   Several  stories up, treetops line the windows.  Hugh walks along the far edge of the space, waving a  flashlight out windows and down long running hallways.  Jay half-focuses her eyes.   She takes a few deep breaths.  The girl is drowsy - still under the chemical spell of an  inhaled narcotic.  Looking down, Jay sees her arms and legs tied tightly to a  wheelchair.   She squirms and pulls but she can't move.   Her  body isn't fully responsive.  Hugh looks back from across the warehouse floor.  HUGH  Jay?   Are you awake?  Jay stares across the darkness at Hugh as he slowly walks  over.   She tugs lightly against the rope and cloth bonds.   Her  eyes sag within their sockets.  Hugh stops in front of her.   He leans down and looks at her  face.   He looks frightened.   His eyes are watery.   His face is  red - like he's been crying.  HUGH  I'm sorry.  Jay tries to talk.   Drool edges out the crease of her mouth.  JAY  Whuuuttt aarrhhh youuhhh doingggggg?  21.  CONTINUED: 20   20  (CONTINUED) HUGH  I'm not gonna hurt you.   Don't worry.  Jay stares at him with deep fear.  Hugh turns and shines his flashlight into the darkness.   He  scans the room.   Jay watches.  She opens her mouth as if to yell, but it's nothing but a  hollow gasp - a mimic of a dry heave.  Hugh shushes her with a gesture and continues waving the beam  of light around the warehouse.  HUGH  You won't believe me, but I need you  to remember what",
      "dialogue_count": 1,
      "word_count": 4731
    },
    {
      "scene_number": 7,
      "slugline": "INT.   MRS. HEIGHT'S BEDROOM - NIGHT 49   49  Jay's mom is asleep on her bed.   She's sprawled across the  crumpled comforter in her night robe.  A bottle of wine and empty glass sit on the dresser.  INT.   JAY'S ROOM - NIGHT 50   50  Changing into bedtime clothes, Jay glances out her window.  Across the alley, she sees the 11 year old neighbor boy spying  on her from his bedroom window.  Jay jumps out of surprise. She covers herself and pulls the  blinds down as the neighbor boy hides behind his own curtains.  Bothered and momentarily frightened, Jay sits on the floor  next to the window, listening to the television echo from the  hallway.  INT.   LIVING ROOM - NIGHT 51   51  We follow behind Jay as she carries her blanket and pillow  down the hallway into the living room.  Still awake and watching a midnight movie, Paul sits up and   *  fixes his hair as the pretty girl plops down on the smaller  love-seat across from him.  JAY  I can't sleep - not in there.  PAUL  That's ok.   Sleep here.  Jay smiles and pulls the covers over herself.  They sit together - quiet - watching the television.  PAUL  You really ok?  Jay pauses - then looks at Paul.   She shrugs her shoulders.  PAUL  Everything's gonna be cool.  Jay nods her head. On the television, several soldiers lure a   *  giant monster into an electrical trap.   *  PAUL  It's funny, I haven't spent the night  over here since we were kids.  40.  (CONTINUED)",
      "characters": [
        "YARA"
      ],
      "action_text": "JAY  There's a reason for that.  The pair crack smiles.  PAUL  Shut up.   I'm serious.   It's cool to  spend time with you.  JAY  Yeah.  PAUL  We used to hang out all the time.  Remember?  Jay nods.   *  PAUL  At some point, it must've been weird  for you having a guy friend that was  younger than you.  JAY  I don't know.   I think we just grew  apart, right?   Or you and Kelly got  close.   It's not a big deal, is it?  PAUL  No.   Not a big deal.   *  On the tv, a soldier flips a switch and sends a giant arc of   *  electricity into the towering monster.   *  JAY  You were my first kiss, you know.  PAUL  I know.  JAY  Was I not yours?  PAUL  No.   You were.   *  JAY  And you kissed Kelly.   She told me.  You kissed two sisters... that's kind  of gross.  Paul grins.   *  The monster in the movie shrinks and disappears under the   *  electrical charge.   *  41.  CONTINUED: 51   51  (CONTINUED) PAUL  Do you remember that time we found all  the porno magazines in the alley by  Barry's Pizza?  JAY  Yes.  Jay shakes her head with a smile - silly memories.   *  PAUL  We were such stupid kids.  JAY  Ridiculous.   *  PAUL  We're all sitting on Greg's front lawn  with a dozen dirty magazines sprawled  everywhere and we're laughing...  Jay chuckles at the memory.  JAY  We had no idea how terrible it was.  Paul starts to laugh.   *  PAUL  And Greg's mom?!   Remember her face  when she came outside and saw us all  sitting around reading that shit?  Jay laughs along with Paul.   *  JAY  She scooped them up so fast.   Called  my mom too.   Me and Kelly got a sex ed  lecture the next day.  PAUL  I got one too.   *  Jay and Paul smile to each other from across the room.   *  They hear the sound of glass breaking.  PAUL  What the fuck?  Paul stares at Jay - worried.  JAY  Go look.  42.  CONTINUED: (2) 51   51  (CONTINUED) Paul hesitates.   He jumps up and steps to the edge of the room  - trying to determine where it came from.  Jay watches, scared, behind the covers on the love-seat",
      "dialogue_count": 1,
      "word_count": 2688
    },
    {
      "scene_number": 8,
      "slugline": "INT. KITCHEN OF HUGH'S DETROIT HOME - DAWN 62   62  Yara opens the fridge and makes a funny face at the sight of  open leftovers and rotten fruit.  YARA  I don't think he spent a lot of time  here.  INT. BATHROOM OF HUGH'S DETROIT HOME - DAWN 63   63  Kelly notices a crack in the wall of the bathroom.   She runs  her hand along the split in the dry-wall.   Kelly applies some  pressure and a large piece of wall falls away - revealing a  hole leading to the adjoining room.  Jay peeks through the hole to her sister.  JAY  He told me never to go into a room  that didn't have more than one way  out.  Kelly shakes her head - surprised by the oddness of the  situation.  INT. BEDROOM OF HUGH'S DETROIT HOME - DAWN 64   64  Paul enters the upstairs bedroom. Water-stains line the wall.  An old mattress sits on the floor. Debris and clothes boxes  fill the space.  Paul digs carefully through the cardboard boxes - sorting  through a few remaining articles of clothes. A couple pairs of  socks. Some underwear.  INT. KITCHEN OF HUGH'S DETROIT HOME - DAWN 65   65  Standing on the counter, Yara digs through the upper cabinets,  using her cell phone to illuminate the junk inside. Greg stops  nearby, looking up at her legs. Admiring.  Yara peeks into the cabinet. Pushing aside a dusty row of  mugs...  A cockroach runs out and scampers across her hand.  YARA  Ehhh!!   Fuck!  Yara shakes her hand in disgust. Greg chuckles.  53.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 256
    },
    {
      "scene_number": 9,
      "slugline": "INT. BASEMENT OF HUGH'S DETROIT HOME - DAWN 66   66  Kelly walks alone through the garbage filled cellar. The  camera pushes slowly through the dusty shadows toward a ground  level window. There's tension as we near the sun-misted glass.  Nothing passes.  INT. BEDROOM OF HUGH'S DETROIT HOME - DAWN 67   67  Under some crumpled and stained tissue paper, Paul discovers a  small stack of porn magazines.  He lifts them and sits on the edge of the bed, sifting through  the various covers.  He selects one and casually flips through the magazine -  perusing a nude woman's pictorial.  Jay enters the bedroom and sees him. She shakes her head and  moves to the bedroom's far window. It's taped over with  newspapers and comic book pages. A few tears allow some  morning light into Hugh's grim-looking sleep quarters.  Jay peeks through a hole in the comic book page, looking down  at the nearby field. She sees a homeless man walking through  the tall grass. He disappears behind a tree. Jay backs away  quickly, bumping the string of cans with her arm.  Paul turns another page and finds a loose photo wedged inside.  He pulls the picture out and examines it.  PAUL  Hey, look at this.  JAY  What?  PAUL  Is this him?  Jay moves to the bed and looks down at the photo in Paul's  hand. She sees a younger, teenage-version of Hugh with some  old girlfriend. They both have bad haircuts. The girl, a  cheerleader, is wearing a boy's oversized high school  letterman jacket. It reads: Lawson Vikings.  PAUL  Do you recognize the letterman jacket?  JAY  Lawson High School.  Paul nods in agreement.  54.  (CONTINUED)",
      "characters": [
        "JEFF"
      ],
      "action_text": "PAUL  Somebody's gonna know his real name.  Jay looks closely at Hugh's smiling face.  INT. LAWSON HIGH SCHOOL HALL - DAY 68   68  Down a long, locker-filled hallway, Greg and Jay walk together  towards the main office.  A few kids pass them, walking to class - dodging work.  INT. LAWSON HIGH SCHOOL HALL - DAY 69   69  Through a medium-sized window in the hall, we see a couple  high school kids making out behind a tree - only pieces of the  action from a distance.   A teen boy in ugly clothes walks by  eating an apple.  The camera pans, crossing the hall and focusing on the nearby  main office.  INT. LAWSON HIGH SCHOOL OFFICE - DAY 70   70  Through the glass we watch as Jay and Greg speak with a couple  of school employees.   The photo sits on the counter between  them.  One woman grabs a large book from a shelf, opens it and flips  through pages as a man types slowly on his old computer.   Greg  watches.  Jay stops and turns, looking out past us and the camera,  scanning the area - she is constantly on guard.  Jay turns back and listens as the woman talks.  The camera pans again, back towards the window.  Outside, the couple are still kissing behind the tree.  A YOUNG WOMAN WITH RED HAIR is walking towards the building,  carrying a backpack.  A few teen girlfriends cross the window, laughing and  chatting.  INT.   GREG'S CAR - DAY 71   71  Paul and Kelly sit in the back seat of the car like kids  waiting for their parents. Yara sleeps on Kelly's shoulder.  Greg and Jay open their doors and hop into the front.  The high school building is visible through the front window.  55.  CONTINUED: 67   67  (CONTINUED) PAUL  Did they know?  GREG  Yup.  JAY  His real name's   Jeff .  In the distance, the young redhead with a backpack is visible  walking towards the car.   She's quite far away.   No one sees  her.  PAUL  Not Hugh?  GREG  (shaking his head)  Jeff Redmond.  KELLY  Do we tell the police?  Greg starts the car.   The radio comes on - quiet.   A seat-belt  alarm ding",
      "dialogue_count": 1,
      "word_count": 2259
    },
    {
      "scene_number": 10,
      "slugline": "EXT.   HIGHWAY - MORNING 79   79  Greg's car drives up the scenic, northern stretch of I-75.  Giant stretches of forest and clear lakes line the road.  The sun rises higher over the trees.  OMITTED 80   80  OMITTED 81   81  OMITTED 82   82  EXT.   GREG'S LAKE HOUSE - MORNING 83   83  Greg's car arrives in front of a lake house surrounded by open  fields.  Beyond the house is a medium-sized lake.  The gang start to climb out, stretching in the morning sun.  Greg unlocks the door and steps inside.  INT. LAKE HOUSE LIVING ROOM - MORNING 84   84  Jay and Paul string bells and bottles over the windows and  doors. Sitting on the floor - threading old soup cans with  string, Jay speaks into an old 70’s-style phone receiver.  JAY  (into phone)  Hello, yes, um, this is Mrs.   Height .  I’m calling to let you know that my  daughter Kelly is sick with the flu  and she’s gonna be out for a few days -  uh   maybe longer.  (beat)  Uh huh.   Yeah.   I know. It’s the season  change I guess.  (beat)  Ok well, thank you. Bye.  Kelly fries bacon at the stove, while making pancakes for the  group. She watches her sister from across the room.  A radio on the counter plays an old AM rock tune.  Yara dances by herself to the music, snacking on bacon as she  reads her ebook. Swaying and stepping - her moves are  intentionally silly.  Greg drinks a beer on the couch, staring at Yara's ass  whenever possible.  64.  (CONTINUED)",
      "characters": [],
      "action_text": "Family photos of Greg and his parents line the walls. Old  remnants of joyful times litter the room.  Hanging up the phone, Jay stands at the edge of the kitchen,  looking out the window. She watches the empty field, driveway  and lake.  Birds chirp happily in the distance.  EXT. OLD SHED - MORNING 85   85  Greg unlocks the door to a shed behind the house. He pulls a  metal case from the dusty shelf.  Inside, he finds a small HANDGUN and some bullets.  Greg closes the case, and tucks it under his arm.  EXT.   FIELD - DAY 86   86  Greg stands next to Jay as she fires the handgun at a far-off  row of canned goods and mini cereal boxes.  He helps to adjust her aim.  Kelly and Paul watch from the distant grass - as shots ring  out and echo. Yara reads from her phone.  Paul seems irritated.  GREG  It sucks sticking around after  everyone's gone, huh?  JAY  It's a bit lonely.  GREG  I'm right across the street you know.  JAY  I remember.  BANG! A full size box of Fruity Fun Cereal is hit, causing a  trickle of colorful rice to pour from the bullet hole.  EXT. BOAT & LAKE - DAY 87   87  The boat is anchored in the center of the lake.   The water is  calm.  The breeze passes like a whisper across Jay's bangs.   She  turns onto her back and lays out across the front of the boat -  feeling the warm sun.  65.  CONTINUED: 84   84  (CONTINUED) Greg dives into the water, while Paul cannonballs in.  Kelly sits near her sister, while Yara dips a toe in the lake  from the safety of the rear ladder - sipping a beer and eating  snack chips.  JAY  I feel safe out here.  KELLY  We'll stay as long as we can. Mom  doesn't care.  JAY  I wonder how long it'll take before it  gets here.  KELLY  Jay, there's nothing coming, ok?  Jay looks back towards the shore and watches the tree-line and  the open field.   She stares deeply at the land.   Nothing  moves.  EXT. BOAT & LAKE - DAY 88   88  Yara dives underwater, kicking her feet above the surface.  Loud splashes.  Kelly holds on to the anchor",
      "dialogue_count": 0,
      "word_count": 1687
    },
    {
      "scene_number": 11,
      "slugline": "EXT. EDGE OF FIELD - CONTINUOUS 95A   95A  Greg is still far off - approaching along the edge of the  clearing.   We track behind him as he watches the odd sight:  Jay is backing away - screaming, pointing and staring at  nothingness.  INT. LAKE HOUSE - CONTINUOUS 96   96  Jay picks up the hand gun and runs to the door.  KELLY  What're you doing?!  Jay raises the gun up.   She aims at the thing.   Yara stares  back at her. Mouth open.  Paul is almost hyper-ventilating at the edge of the room. He  sees nothing but a frightened and hurt young woman aiming a  gun into the air. He hides behind the couch.  Jay waits until it gets near.   She aims at its face - Jay  pulls the trigger.  Bang!!!  Greg dives down - taking cover in the grass.  PAUL  Fuck!  The bullet slices through Yara’s forehead and ricochets out  her temple.   Blood pours from her skull as she slumps to the  ground.  GREG  (in distance)  Stop shooting!!  Greg jumps up, arms in the air. He starts to come closer.  KELLY  Jay, please!!  The bloody Yara rises and continues walking towards Jay as  though nothing happened.  71.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 197
    },
    {
      "scene_number": 12,
      "slugline": "EXT. FIELD - CONTINUOUS 96A   96A  As Greg moves toward Jay with his arms in the air, she raises  her pistol once again.   She fires several times - the bullets  coming right at us. Greg dives for cover.  Jay steps back and pulls the front door closed.  INT. LAKE HOUSE LIVING ROOM - CONTINUOUS 96B   96B  Jay locks the front door and slumps onto the ground.   She  starts to cry.   Kelly tries to hold her but she can't be  consoled.  Paul lifts his shirt and sees a swollen red welt across his  abdomen.  Jay peeks up toward the front window.   She sees a large man  looking in through the glass.   He shuffles slowly to the side -  out of sight.  Smash!!!  There's a loud pounding from the front door.   The wood shakes.  It hits again.   The banging gets louder.  A foot breaks through the bottom of the door.  The women scream.   Paul jumps in fear.  Yara watches as wood splinters from the center - seemingly  without cause.  Jay watches as the foot kicks out a medium chunk of paneling  from the bottom of the door.   The foot retracts and  disappears.  Silence - except for the soft crying within the room.  The friends and siblings look to the door - waiting.  Slowly... we push in... closer on the hole...  Greg appears, looking in through the broken door - his head  tilted at an angle.  GREG  What the hell are you guys doing?!  JAY  Greg, it's outside!   YARA  Don’t open the door!  72.  (CONTINUED)",
      "characters": [],
      "action_text": "GREG  What did you do to the door?!  JAY  It's trying to get in!   PAUL  We didn’t do it!  GREG  There's nothing out here!  JAY  Yes there is!  Greg pounds his fist into the door. He pulls away and  disappears from view.  GREG  (O.S.)  What the fuck... son-of-a...  KELLY  Greg, did you kick the door?  Was it you?  Silence.  We hear only Jay, Kelly, Yara and Paul, breathing deeply.  Frightened and labored breaths.  Outside... it's quiet.  JAY  Greg?  He doesn't respond.  JAY  Greg, are you ok?  Jay leans closer to the door, peeking into the hole.  Suddenly...  A very LITTLE BOY WITH A STRANGE FACE pokes his head into the  opening. Jay screams and jumps as the little kid crawls  through the hole in the door.  KELLY  Jay, what do you see?!  The innocent looking boy stares at Jay and screams loudly -  like an elderly woman.  Jay flinches and covers her ears. She pulls herself up and  scrambles away, grabbing the car keys from the table.  There's a pounding from the other side of the house.  Jay runs toward the rear door.  73.  CONTINUED: 96B   96B  (CONTINUED) Now inside, the little boy steps across the room.  Paul follows Jay as she unlocks the back door, revealing Greg -  pounding on it.  GREG  What is going on?!!  Jay pushes past him, moving outside.  PAUL  I don't know!  Greg stares into the lake house with anger and confusion - we  don't see anything other than hysterical teenagers.  GREG  (muttering to himself)  What the fuck...  Yara is crying on the floor, while Kelly stands shaking - in  shock. Greg marches past them.  EXT. LAKE HOUSE - CONTINUOUS 97   97  Jay runs to the car, fumbling with the key fob, unlocking the  door.  As Jay climbs into the driver's seat, Greg emerges from the  front door of the lake house. He inspects the crack in the  door.  INT. GREG'S CAR - CONTINUOUS 98   98  Starting the car, Jay sees a young woman, Annie, walk past  Greg and the others - staring at her from a distance.  Greg is shouting - trying to calm everyone down.  Jay continu",
      "dialogue_count": 0,
      "word_count": 1288
    },
    {
      "scene_number": 13,
      "slugline": "INT.   HOSPITAL ROOM - DUSK 100   100  Jay opens her eyes again...  She sees her mother sitting in a nearby chair. The door is  closed.  Paul, Greg, Kelly and Yara lay around the room - scattered in  odd places:   chairs, the end of the bed, the window sill.  The television is on, but no one is watching it.   It's nothing  but a half-muted light source in an otherwise dim room.  We hear voices - whispering around us. Nothing sounds right.  MRS HEIGHT  (muted)  Was she taking her medicine?  KELLY  (muted)  I don't know.   I think so.  Jay begins to cry.  Mrs. Height moves close, holding her hand against her  daughter's forehead.  MRS HEIGHT  Jay, you ok?  Jay's face shows exhaustion and fear.   Her crying intensifies.  The young woman sobs and wails like a hurt child.   Her mother  holds her, while Kelly wipes tears away from her cheek.  JAY  (whispers)  I don't wanna die.  MRS HEIGHT  You're not gonna die.   You're ok.   It  was a bad accident.   That's all.  You'll be home in a few days.  Jay continues to cry. Greg stares from his seat.  JAY  (whispers)  It's gonna catch me.  Jay sees Greg.   She looks to him for help.  78.  (CONTINUED)",
      "characters": [
        "JAY"
      ],
      "action_text": "We sit with Jay for a few moments as she takes a sip of water  and then looks down at her hospital gown.   Her legs.   The cast  on her arm.  Jay waits for something to happen.   She watches the empty  doorway.  INT.   COLLEGE FOOD COURT - DAY 104   104  Greg eats a sandwich, fries and coke while chatting with some  girls at a table.   Many people cross by.  Greg laughs with his mouth half-full.  INT.   HOSPITAL WAITING ROOM - DAY 105   105  Kelly rests on a small couch - magazines on her lap.  Paul sits in a chair - watching across the hallway - looking  into Jay's room.   He watches Greg smile and chat with her -  casually eating applesauce from Jay's food tray.  Jay's face is partially hidden by the edge of the doorway.  Paul stares with obvious envy.  INT.   JAY'S HOSPITAL ROOM - CONTINUOUS 106   106  Flowers line the window sill - the sun shines brightly inside.  JAY  You haven't seen it?  GREG  Nothing.  Greg takes another bite of applesauce.  JAY  Really?  GREG  (eating)  Yeah.   I'm waiting.   Looking.   It's  been 3 days...  Jay nods her head - unsure.  GREG  I don't think it's coming.  Jay rests in her hospital bed.  80.  CONTINUED: 103   103  (CONTINUED) JAY  You believe me right?   You're not just  playing along?  GREG  No.   I believe you.  Jay nods.  GREG  I just don't think it's... following  me.  Jay stares at Greg. Worried.  GREG  Isn't that good?  JAY  Yeah.  Jay's face doesn't seem relaxed.   She takes no comfort in  Greg's words.  JAY  I'm sorry about your car.  GREG  It's just a car.  He smiles and takes one more bite of applesauce - licking the  spoon.  EXT.   JAY'S BACKYARD - DAY 107   107  Jay sits in the hot tub, with her cast hanging over the side -  looking out at the neighboring yards. A dullness in her eyes.  The back door is half-open.  A small television rests on the deck - playing the local news.  On the tv: Bodies are carried from a collapsed building.   The  news announcer chatters away about the incident.  Jay stares out at her bac",
      "dialogue_count": 1,
      "word_count": 899
    },
    {
      "scene_number": 14,
      "slugline": "INT. JAY'S ROOM - DAY 109   109  Opening the bedroom door, Jay notices that her dresser drawer  is open. The underwear drawer.  Looking across the room, she sees her bra, underwear and a  pair of socks laid out across her bed - as though mimicking a  body.  Fear crosses her face.  JAY  Kelly!? Mom!?  No one answers. Jay looks around for an intruder.  Walking towards the bed, Jay passes a dresser, a mirror and  various posters on the wall.  She reaches the bed and picks up her bra. She leans down and  peers out the window.  Nothing.  Standing up, Jay sees a BOY reflected in the mirror. Startled,  she screams - spinning around - falling back against the bed.  It's the 11 year old neighbor boy - hiding against the wall -  panties in his hand. He takes a step forward - arm extending -  worry on his face.  NEIGHBOR BOY  I just wanted to see you. I'm sorry.  JAY  Get out of here!!  The boy drops her underwear on the floor and runs out of the  room - into the hallway.  Jay sits there. Catching her breath.  EXT. JAY'S HOUSE - DUSK 110   110  Kelly and Paul sit on the porch talking, drinking and  listening to music. Near the garage - Yara is chatting with  someone on her pink cell phone.  Greg walks out from his front door.   He crosses the street and  approaches the gang on the porch.  GREG  How are you guys?  82.  (CONTINUED)",
      "characters": [],
      "action_text": "KELLY  OK.  Paul nods - choosing not to speak.  Yara closes her phone and joins her friends - sitting down  near Paul.  GREG  How's Jay?  Greg looks in the direction of the house - where Jay is. Kelly  shrugs her shoulders.  KELLY  Not great.  PAUL  Have you seen anything?  Paul stares Greg down - letting him know that he knows.  Yara covers her tiny grin - they're all in on it.  Greg silently shakes his head.   Nope.  The group is quiet for a moment as they consider this.  GREG  Is it cool if I go in?  KELLY  I don't think so. She doesn't want to  open her door. She's just hiding in  there.  GREG  I thought she'd be doing better.  Greg looks towards the closed doorway. Kelly stares at him -  waiting for something back.  KELLY  I can have her call you later.  GREG  Yeah ok.  Paul watches silently - a brooding stare from the corner of  the porch.  YARA  You really haven't seen anything?  83.  CONTINUED: 110   110  (CONTINUED) GREG  Nope.  PAUL  She didn't make it up.  GREG  We'll know sooner or later, right?  Greg looks around - thinking about the possibility.   He scans  the empty street and the rows of manicured lawns extending  into infinity.  PAUL  That chair cracked in mid-air,  something knocked me over, and the  door... it didn't break on its own.  GREG  Something happened, but... it's not  what she thinks.  KELLY  What do you think it was then?  Greg shrugs his shoulders and steps off the porch.  GREG  I'll see you guys.  KELLY  Bye, Greg.  YARA  Bye.  Greg walks across the street.   Paul watches him go - happy to  see him leave.  EXT. SUBURBAN PARK - NIGHT 111   111  The dark trees of the park sway in the night breeze.  EXT. SUBURBAN STREET - NIGHT 112   112  A dog barks from behind a fence.   The houses sleep.   The  street is quiet.  EXT. NEIGHBORHOOD - NIGHT 113   113  We see the full neighborhood from above.  Scattered house lights and street-lamps form pools of  illumination across the flat Michigan suburbs.  84.  CONTINUED: (2) 110   110",
      "dialogue_count": 0,
      "word_count": 596
    },
    {
      "scene_number": 15,
      "slugline": "INT.   JAY'S ROOM - NIGHT 114   114  Jay sits by her window in pajamas, watching the dark  neighborhood.  Empty yards.  A car passes.  Jay yawns - a hand over her mouth.  Near silence.   Some crickets.  Jay sees Greg walking slowly down the sidewalk.   He turns and  heads up the path to his house.  Jay knocks on her window, trying to get his attention.  Greg reaches the front door, but it won't open for him.  Jay watches - a bit confused.  Greg picks up a large stone and walks towards the front window  of his house.  Jay realizes something is wrong.   She grabs her 80’s handset  phone and dials Greg's number.   It goes straight to voice-  mail.  Greg breaks the glass and begins to crawl into his home  through the opening.  Jay leaps up and stumbles out her bedroom door.  EXT. GREG'S HOUSE - NIGHT 115   115  Sprinting to Greg's front yard, Jay pounds on the door - pulls  at the handle.  JAY  Greg!   Open the door!   Greg!  There's no sound from within.   Jay looks to the broken front  window - she runs to it and begins to crawl through.  INT. GREG'S HOUSE LIVING ROOM - CONTINUOUS 116   116  Falling to the carpet, Jay clutches her cast-covered arm and  looks around the dark room.   She stands up and moves through  the house.  JAY  (running)  Greg!   It's in the house!  85.  (CONTINUED)",
      "characters": [],
      "action_text": "We hear a soft and distant tapping from above. A clock chimes.  GREG  (O.S. - distant)  Jesus, mom!   I'm sleeping!  Jay runs through a dark hallway reaching the base of the  stairs.   She goes up.  INT. GREG’S HOUSE UPSTAIRS - CONTINUOUS 116A   116A  Running up the stairs, Jay hears the sound of knocking -  louder.   A \"tap tap tap\" on wood.  JAY  Greg!   Watch out!  Reaching the top of the stairwell, Jay stops.   Ahead of her,  at Greg's door is his mother, Mrs. Hannigan.  Mrs. Hannigan is knocking on the door.   She looks over at Jay  as she continues to knock.  Jay stares - suddenly understanding what's happening.  GREG  (from inside - groggy)  What the fuck is going on? Fucking son-  of-a...  JAY  Greg, it's outside your...!  Greg opens his bedroom door - wearing only boxers.   He sees  his mother standing before him in her open bathrobe - breasts  half-exposed.  GREG  (groggy)  What the fuck, mom?  Mrs. Hannigan puts her arms around Greg. Her legs climb up -  feet clawing - wrapping herself around him. He falls backwards  disappearing into the bedroom.  Jay circles the doorway, looking in.   She sees the woman  straddling Greg, holding tightly as he convulses - his eyes  rolled back - revealing white and veins. A fallen lamp  flickers and strobes. The room appears to shake.  The mother pushes herself against Greg - bare legs - a loose  robe - indecent. His hand struggles against hers - their  fingers intertwined.  86.  CONTINUED: 116   116  (CONTINUED) A heavy rush of fluid pours down onto Greg’s boxers - soaking  the carpet.  The young man stops moving.   He's dead and pale - his tongue  edging out the side of his mouth.  The thing looks back at Jay and stands.   It begins to follow  her as she backs up along the hall landing - down the stairs.  Jay runs to the front door - fleeing the house.  INT. JAY'S CAR - NIGHT 117   117  Jay pulls out of her driveway wildly.   She drives down the  street as Greg walks out of his front door - staring at her.  INT.   JAY'",
      "dialogue_count": 0,
      "word_count": 780
    },
    {
      "scene_number": 16,
      "slugline": "EXT. CLEARING AT LAKE - DAWN 123   123  Stepping out of the woods, Jay finds herself along the edge of  Lake St. Claire.   She looks out at the deep waters as a  motorboat slows in the distance.  A few shirtless YOUNG MEN drink beer in the boat as it rocks  and sways.   Listening to music, they don't notice the young  woman on shore.  Jay focuses on the men.   A thought crosses her eyes.  Jay takes off her pants and shirt as she steps into the lake.  She moves out, bracing herself against the cold - letting her  cast drop carelessly into the water.  She swims further.   The boat is ahead.   The young men grow  closer and closer.  Jay slows and stops.   She's near the boat now.   The music and  laughter is louder.   She looks up at the figures of men -  considering.   She starts to call out, but stops.   Her eyes  show melancholy as she paddles in place.  I can't do this.  Jay exhales and drops down into the water.  She's gone.  We sit on the surface of the lake watching the young men on  the boat drink and laugh.   Eventually, they start the engine  and cruise off along the horizon.  A flock of birds fly overhead.  The water is still.  Jay pops up several yards away - nearly out of frame - gasping  for air.   She fights to swim back.  EXT.   JAY'S HOUSE - MORNING 124   124  Jay drives the car down her street - her hair still damp - the  cast soaking wet.   As she pulls into her driveway, she sees  Kelly and Yara sitting on the porch - haggard and sad.  INT.   JAY'S BEDROOM - DAY 125   125  Jay is resting on the floor of the darkened room. A towel is  wrapped around her cast.   Some light peeks in through the half-  drawn shades.   Kelly and Yara are sleeping on the bed - passed  out - a space of mourning.  Yara snores a little.  88.  (CONTINUED)",
      "characters": [],
      "action_text": "The old sandwich sits untouched on its plate. The bread has  grown moldy. The pickle is dry. The Doritos remain orange and  unchanged.  The television is on. Old commercials sell products.   *  There's a knock at the door.   Jay opens her eyes.  JAY  Who is it?  PAUL  Paul.  JAY  Hang on.  Jay gets up and pulls the chair away from the door, she  cautiously opens it, peeking out into the hallway.   She sees  Paul - alone.  He steps into the room.   Jay quickly closes the door and  barricades it.  Paul sits down on the floor next to Jay's nest of blankets and  clothes.   She sits alongside him, pulling her t-shirt down as  she stretches her legs across the blanket with little regard  for modesty.   Her focus is singular - a melancholy has settled  in her eyes.  They sit in silence together for a moment.   Yara's snoring  quietly rattles from the mattress.  JAY  It's gonna be here sooner or later.  Paul takes a breath - he's thought about it.   He speaks in  whispers.  PAUL  You could pass it on.  Jay shakes her head.   She won't.   Not again.  PAUL  You did once.  JAY  I shouldn't have.  Jay looks ahead at the black dress slung over her chair.  PAUL  I could...  89.  CONTINUED: 125   125  (CONTINUED) Jay looks at Paul - direct eye contact.  JAY  No.  A moment passes.   Paul stares at Jay's profile.   She watches  the window.  PAUL  I liked you too, ya know.  Jay takes a breath, fidgeting with her t-shirt.   She knows.  PAUL  Why did you pick Greg?  Jay looks down at her legs.   She pulls them closer to her  chest - she taps her knee lightly.  JAY  I thought he would be ok.  (beat)  He wasn't scared.  Paul listens.  JAY  We slept together in high school.   It  wasn't a big deal.  Paul nods - not agreeing but feeling the need to respond  somehow.  He leans in and starts to kiss Jay.   She pulls away  immediately.  Paul reaches over and touches Jay’s fingers - extended just  beyond the edge of the damp cast.   She maintains her gaze on  the window - with a soft sigh - ex",
      "dialogue_count": 0,
      "word_count": 4054
    },
    {
      "scene_number": 17,
      "slugline": "INT.   PAUL'S BASEMENT REC ROOM - NIGHT 140   140  A chair is propped against the door.   *  Jay and Paul are laying on the couch - an old blanket covering  their bodies.  Jay looks into his eyes and waits for a sign. He nods his head  with love and anticipation.  Jay moves on top of him - sitting up, pulling the blanket over  herself. They fumble underneath and begin to make love.  Paul nervously touches her face. Staring up lovingly.  She kisses him - holding her cast to her side.  They stare into each others eyes. For the first time they are  thinking only of each other.  A moment of connection through the physical. Rain against the  basement window.  They move slowly with pleasure.  JAY  I feel like I’m hurting you.  Paul looks up at her.  PAUL  You’re not.  Jay nods and continues.  She pushes harder against him - exhaling - smiling down at  him.  Paul stares at Jay’s face.  We watch from across the room now. The quiet basement. A  thunderstorm outside. The young lovers on an old couch.  INT. PAUL’S BASEMENT REC ROOM - NIGHT 140A   140A  Wrapped in the blanket, holding each other, Jay and Paul rest.  Faces close together. Whispering.  PAUL  Do you feel any different?  Jay shakes her head. No.  JAY  Do you?  104.  (CONTINUED)",
      "characters": [],
      "action_text": "PAUL  No.  Jay kisses Paul.  INT. JAY'S BEDROOM - NIGHT 137   137  Jay lays under her sheets - a cartoon bandaid across her  temple - a new cast on her arm.   Mrs. Height sits on the edge  of the bed, rubbing her back.   Softly.  On the dresser, we see a glass of wine and an old family  portrait.   Jay is a young girl.   Kelly is a baby.   Their  mother, young and pretty smiles alongside Jay's father, a  middle-aged man with salt and pepper hair.   He grins happily  into the camera.   His smile is identical to the one he offered  Jay at the pool.  INT. PAUL'S CAR - DUSK 142   142   *  Paul drives through a run-down neighborhood within the inner   *  city.   He stares at a row of prostitutes.   Tight skirts.   *  Revealing tops.   *  They eye him.   Paul watches them as he passes.   The women   *  appear to move in slow motion.   *  INT.   HOSPITAL - DAY 138   138  Jay sits across from Paul in Yara’s hospital room. He lays   *  back in a chair - eyes closed and napping.   *  Yara is eating in bed, as she reads something from her phone.  YARA  (reading with food in  her mouth)  \"When there is torture there is pain  and wounds, physical agony, and all  this distracts the mind from mental  suffering, so that one is tormented  only by the wounds until the moment of  death.\"  Yara pauses to take a sip of milk through a straw - noisily  she slurps.  105.  CONTINUED: 140A   140A  (CONTINUED) YARA  (taking a bite of food)  \"The most terrible agony may not be in  the wounds themselves but in knowing  for certain that within an hour, then  within ten minutes, then within half a  minute, now at this very instant -  your soul will leave your body and you  will no longer be a person, and that  this is certain; the worst thing is  that   it is certain .\"  Jay looks at Paul's handsome face.   She tilts her head a bit -   *  watching the young man at rest.   *  Yara takes another large bite of food.  OMITTED 139   139   *  OMITTED 141   141   *  INT. OLD POOL BUILDING - DAY 141A   1",
      "dialogue_count": 0,
      "word_count": 770
    }
  ]
}