{
  "slug": "its-always-sunny-in-philadelphia-201-charlie-gets-crippled-2006",
  "title": "its always sunny in philadelphia 201 charlie gets crippled",
  "genre": "thriller",
  "format": "series",
  "scenes_count": 2,
  "characters_count": 0,
  "characters": [],
  "total_words": 4037,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. CHARLIE’S APARTMENT - CONTINUOUS - N/1 7   7  The party enters Charlie’s apartment. The strippers go get  comfortable.  FRANK  Do you have anything to drink in  here, Charlie?  CHARLIE  (out of breath)  Yeah.   Check... under the bed.  FRANK  Thanks.   I’ll put on some music.  This is great, guys.   Really great.  I feel so much better!  MAC  Awesome, yeah!  Frank walks off.  MAC (CONT’D)  We gotta get him outta here.  CHARLIE  (out of breath)  What?   Why?  MAC  There’s two of them and three of  us.   Plus he’s like eighty.  CHARLIE  (out of breath)  Oh, come on man, have a heart.   The  guy’s going through a divorce.  MAC  Since when do you give a shit about  people?  CHARLIE  (out of breath)  Maybe   you   should be the one who  leaves.  MAC  You’re the gimp.  IT'S   ALWAYS   SUNNY   IN   PHILADELPHLA   -   EP.   201   -   \"THE   GANG   GETS   CRIPPLED\"   2/6/06   14.",
      "characters": [],
      "action_text": "CHARLIE  I’m the reason the girls are here  in the first place.  MAC  How are you still out of breath,  dude?  Frank walks over.  FRANK  What are you guys fighting about?  MAC  Nothing.  FRANK  Could you do it out in the hall?  You’re killing the vibe.  MAC  Yeah, sure.   Sorry, Frank.  Charlie and Mac go out to the hall.  CUT TO:  INT. CHARLIE’S HALLWAY - CONTINUOUS - N/1 8   8  Mac and Charlie walk back out to the hall.  MAC  Alright let’s flip a coin.   Loser  leaves.  CHARLIE  I think we both know that there’s  only one way to settle this like  men.  They look each other dead in the eyes.  CUT TO:  INT. CHARLIE’S HALLWAY - SECONDS LATER - N/1 8A   8A  Mac and Charlie race down the hall.   Charlie wins in a  landslide.  MAC  The ground’s on a slant!   It’s  slanted!  IT'S   ALWAYS   SUNNY   IN   PHILADELPHLA   -   EP.   201   -   \"THE   GANG   GETS   CRIPPLED\"   2/6/06   15.  CONTINUED: 7   7 CHARLIE  I won!   I won again!  MAC  Goddamnit!   Why are you so fast?!  How do those freakish little arms  move like that?!  CHARLIE  I am so fast!  Mac starts down the hall.  MAC  Fine.   Fine!   But there will be a  rematch!   Do you hear me?!   A  rematch!  CHARLIE  Loud and clear, sucka!   Anytime you  want you want a piece of this  action you let me know!  (to himself)  Chump.  He turns the doorknob.   It’s locked.   He knocks.  CHARLIE  Hey, Frank!   The door’s locked.  The door opens and Frank peeks his head out.   He’s shirtless  and the girls can be seen in the background, in their  underwear, having a pillow fight.  FRANK  Hey, Charlie.   Could you give me  like forty-five minutes in here?  I’ll tell you what...here’s five  dollars, go down to the Wawa and  pick us up a couple of sodas.   I  have a feeling I’m gonna be pretty  thirsty after this.   Thanks, pal.  He slams the door.  CHARLIE  But-  We hear the door lock again, and the party continues.  FADE OUT.  END OF ACT TWO  IT'S   ALWAYS   SUNNY   IN   PHILADELPHLA   -   EP.   201   -   \"THE   GANG   GETS   CRI",
      "dialogue_count": 0,
      "word_count": 3473
    },
    {
      "scene_number": 2,
      "slugline": "INT. DENNIS’ CAR - SAME TIME - N/2 21   21  Mac and Dennis are carousing in the car.   We start on Mac.  MAC  (slurring)  That’s right, we’re going to the  strip club!   Strip cluuuuuuub!  Pan over to Dennis.  DENNIS  I’m gonna buy you a lap dance! I’m  gonna buy me a lap dance! I’m gonna  buy everyone a lap dance!  PAN OVER TO MAC:   He’s passed out. Cold. Drool is already  cascading down the side of his mouth.  PAN BACK OVER TO DENNIS:   He’s also passed out.   Cold.  CUT TO:  EXT. STRIP CLUB - SAME TIME - N/2 22   22  Frank and Dee are standing on the curb screaming at each  other.   The Male Employee stands near.   Charlie is in the  street, trying to stand.  CHARLIE  Help me.  SWEET DEE  You can’t just come back into my life  and start treating me like a child!  FRANK  If you’re gonna behave like a  child, you’re gonna get treated  like a child!  SWEET DEE  I can behave whatever way I want!  FRANK  So can I, Deandra!   Have you ever  thought about-  Dennis’ careening Range Rover fires down the road, skips the  curb and BOOM!   We:   CUT TO:  BLACK.   END OF ACT TWO  IT'S   ALWAYS   SUNNY   IN   PHILADELPHLA   -   EP.   201   -   \"THE   GANG   GETS   CRIPPLED\"   2/6/06   34.",
      "characters": [],
      "action_text": "TAG  FADE IN:  INT. HOSPITAL - LATER - D/2 23   23  Frank, Dee, Dennis, Mac and Charlie are in a hospital room.  All of them are busted-up, bruised and either on crutches or  sitting in a wheelchair.  DENNIS  I think I drank too much.  DEE  Yeah.   I think so.  MAC  We are so lucky that none of us  died.  DEE  Well, Dennis is lucky that nobody  died ‘cause he’s the one that hit  everybody.  DENNIS  You were standing out in the middle  of the road!  DEE  You were passed out!  DENNIS  I was not passed out!   You’re the  one who was passed out!  DEE  That doesn’t even make-  FRANK  Shut up!   Do the two of you ever  stop fighting and shut the hell  up?!  Dennis and Dee hang their heads.  FRANK (CONT’D)  This is serious here.   Really  serious.  DENNIS/DEE  Yeah.  IT'S   ALWAYS   SUNNY   IN   PHILADELPHLA   -   EP.   201   -   \"THE   GANG   GETS   CRIPPLED\"   2/6/06   35. MAC/CHARLIE  Yeah.  FRANK  I think that we should all be thankful  that this didn’t turn out worse than it  did.   I mean, yes, we’re all a little  banged up.   And we may have thousands  of dollars worth of medical bills but  we’re alive and that’s what matters.  Kids, sometimes, in life, you get lucky  and things work out for the best.   This  is one of those times.   But it could’ve  gone the other way just as easily.   You  need to think about that.  MAC/CHARLIE  Yeah.  DENNIS/DEE  Yeah.  They reflect on this parental tiding for a sec.   Then:  FRANK  Now, who wants ice cream?  MAC/CHARLIE  I do.  DENNIS/DEE  I do.  FRANK  Alright, let’s go enjoy some ice  cream and be thankful that no one  important got seriously hurt.  The gang files out.   As they go, we pan with them, eventually  stopping on:  The Male Employee.   He’s unconscious, bandaged to the hilt  and hooked up to every machine in the motherfucker.  He opens his eyes.  MALE EMPLOYEE  What a bunch of assholes.   FADE OUT.  END OF EPISODE  IT'S   ALWAYS   SUNNY   IN   PHILADELPHLA   -   EP.   201   -   \"THE   GANG   GETS   CRIPPLED\"   2/6/0",
      "dialogue_count": 0,
      "word_count": 564
    }
  ]
}