{
  "slug": "izombie-101-pilot-2015",
  "title": "izombie 101 pilot",
  "genre": "thriller",
  "format": "series",
  "scenes_count": 3,
  "characters_count": 0,
  "characters": [],
  "total_words": 11350,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. SEATTLE POLICE MORGUE - NIGHT - RESUME Ravi continues examining Liv. LIV That’s when all hell broke loose. EXT. LAKE WASHINGTON - NIGHT - FLASHBACK We return to the moment of Liv hiding under the boat railing surrounded by zombie chaos. Liv makes a break for it. RESUME OUR SLOW MOTION SHOT of Liv sprinting across the boat, leading us right up to our original freeze frame... BUT THIS TIME, a hand reaches out, grabs Liv and spins her around. The last person she sees is BLAINE who is now a zombie. He’s left a bloody scratch down her arm. Liv wrenches free, but in doing so, bangs her head against the side of the boat and slips into the water. EXT. LAKE WASHINGTON, SHORE - DAY (FLASHBACK) TOTAL BLACKNESS. We begin to hear an URGENT RUSTLING SOUND, THEN THE SOUND OF CLAWING ON PLASTIC. Suddenly, the blackness rips open revealing the NIGHT SKY and FLASHING RED LIGHTS. REVEAL LIV, pale-as-hell, but intact, as she jolts up into a seated position and begins coughing up lake water. She looks down to find her lower body still zipped into A BODY BAG. Confused, displaced, she attempts to catch her breath as she looks around. A look of horror takes over her face. PULL BACK TO REVEAL LIV is surrounded by DEAD BODIES, some in body bags, some exposed. A ROOKIE EMT stares at her agape, holding part of the MANGLED CORPSE he was trying to bag. INT. SEATTLE POLICE MORGUE - RESUME Liv finishes up her story. LIV So, I hung out a while, chatted with the EMT. Made sure he had the correct spelling of my name. (off Ravi’s stare) I’m kidding. I took off. Ravi breaks his stare and looks to the nearly empty syringe. Blood doesn’t flow into it like it would for a normal human. RAVI Your current condition certainly makes drawing blood a challenge. 11",
      "characters": [],
      "action_text": "LIV (embarrassed) Just so you know, regarding my unique dietary needs...I do it as infrequently as possible. If I don’t eat I become dumber. Meaner. I start to fall apart. I’m afraid if I let it go long enough, I’ll go all George Romero. RAVI So you feel normal after you feed? LIV (smirks)  Feed?   -- like an animal? RAVI Sorry -- poor word choice. LIV No worries. It’s probably accurate. Truth is... I never feel normal. I don’t think I’ve slept in five months... And trust me, zombie-ism has its side effects. RAVI The Tabasco? LIV Pretty much the only way I can taste anything is if it would have at least six chili peppers next to it on a menu. The morgue door OPENS, startling them both. In walks CLIVE BABINEAUX, (30s, think Jordan Peele.) CLIVE Dr. Death. What’s the story with my Jane Doe? You ID her, yet? RAVI Not yet, detective. We put her prints in the system and got nothing back. I’ll process her dental records next. Did you find anything that could help us in the dumpster? Please say vomit! Ravi crosses his fingers hopefully. Clive digs into his pocket, holds up a set of handcuffs in a plastic bag. 12 CLIVE These. CAMERA PUSHES IN ON LIV as she stares at the handcuffs. Her eyes seem to focus on something far away. CLIVE (CONT’D) One of her hands was cuffed when they found her. They’re not police issue. They’re novelty. INT. CONVENIENCE STORE - NIGHT (LIV VISION)  FIRST PERSON POV of a convenience store counter. On it is a 12 PACK OF LABATTS. On a rack in front of it is THE VANCOUVER SUN. The headline reads: US Elects First Black President. VANCOUVER POLICE OFFICER (heavy Canadian accent) I am arresting you for shoplifting. You have the right to retain counsel without delay. You have the right to free and immediate legal advice from duty counsel... We hear the distinctive sound of handcuffs being tightened.  INT. SEATTLE POLICE MORGUE - RESUME As Liv processes what she just saw in the vision. Ravi eyes her curiously. Clive is looking over Ravi’s report. CLIVE Say",
      "dialogue_count": 0,
      "word_count": 3755
    },
    {
      "scene_number": 2,
      "slugline": "INT. CLIVE’S UNMARKED CAR - MOVING - NIGHT Clive is on his CELLPHONE. Ravi sits in the passenger seat. Liv sits in the back playing with a SNOW GLOBE. CLIVE (INTO PHONE) (surprised) None? Really? Thanks for checking. (hangs up, then to Ravi, Liv) No escort operating under the name Paulina has ever been processed by Seattle PD. (to Liv) Can you hit fast forward on your “vision” tape and see if the weatherman killed the girl? LIV That’s not how it works. CLIVE How does it work, then? LIV After I... uh... examine the body. Visions just come to me. I see something the deceased saw. Or hear something the deceased heard. Or smell something... and it just hits me with no warning. CLIVE My great aunt Billie had something like what you got. Nine grandkids. She predicted the sex of each one. Eight for nine, actually. She said my cousin Marcus was going to be a girl, but if you knew Marcus, you’d know she didn’t miss by much. LIV That’s not exactly like-- CLIVE She also speaks to the dead. When I want to talk to my mom, I go see Aunt Billie. Ravi sneaks a look back to Liv in the back seat. Whoa. INT. SEATTLE POLICE MORGUE - EVENING Ravi and Liv sit at Ravi’s computer station watching Robert Carlyle get chased by a zombie horde in 28 WEEKS LATER. 27",
      "characters": [],
      "action_text": "LIV I guess I should be grateful there’s only one of me. If my zombie movie research has taught me anything it’s that being part of a horde would suck. RAVI Are you sure about being the only one? There were other survivors. LIV I’m not positive -- one of the things that keeps me up at night. But it’s been five months. I think there’d be a buzz on the street if we were mid zombie apocalypse. CLIVE (O.S.) Zombies! Liv and Ravi jump. They turn and see Clive has entered. They had the TV on too loud. Clive eyes the TV SCREEN. CLIVE (CONT’D) I would be a dangerous man after the zombies came. I wouldn’t be making any rookie mistakes. Is that a scratch on my grandmother. (mimes cocking a shotgun) BLAM! Hasta la vista, Mee-Ma. LIV Chivalry is dead. CLIVE But Clive is alive. Got an hour? To do. That voodoo. That you do. LIV I haven’t had any more visions. CLIVE You said they’re triggered when you see stuff the victim saw or heard or smelled, so I made an appointment with Paulina’s friend Tess. LIV So? CLIVE So, I’d like you to come with me and smell and listen and see.  (MORE)  28 (off her disinterest) It won’t take long. A couple of sniffs and a quick look-see and it’s back to your lair, Dark Princess. Liv raises an eyebrow. He did not just say that. LIV Say what? CLIVE Ya know, cuz’ you’re all... I don’t know, what are you? ...Emo? ...Goth? Which is the one that’s too tortured to go on living? LIV What I am is a   doctor   who is too busy to do your job for you. CLIVE You’re a doctor who is watching a movie. RAVI You should go. Technically, helping with the investigation is part of the job. Off Liv, sighing heavily. INT. TESS’ APARTMENT BUILDING, HALLWAY - DAY Clive knocks on the apartment door. Liv maintains her disinterested demeanor. She does not want to be there. CLIVE This Tess girl also has a clean record. That’s two girls who come up on the first page of a Google search for Seattle escorts and not an arrest between them. LIV Maybe cops should Google more. Clive looks",
      "dialogue_count": 0,
      "word_count": 3210
    },
    {
      "scene_number": 3,
      "slugline": "INT. LIV’S CAR - SAME Liv checks her reflection in the rear view mirror. She has used makeup to reduce the effects of her zombie state. LIV (V.O.) You almost feel like you’re working towards something. But there’s no hope. So you’re not. CLIVE PUSHES OPEN THE DOOR TO REVEAL A RANSACKED APARTMENT. CLIVE SEES SOMETHING THAT MAKES HIS BLOOD RUN COLD... REVEAL AN OPEN DOOR LEADING TO A BALCONY, THE CURTAINS FLUTTERING IN THE WIND. CLIVE RUSHES TO THE BALCONY, LOOKS OVER THE RAIL AT THE SEVEN STORY DROP, TURNS BACK TOWARD CAMERA, CONCERN ON HIS FACE. EXT. MAJOR’S HOUSE - SAME Liv, looking lovely, stares up at the front porch steps. LIV (V.O.) Major once asked if there was a chance for us. I thought I was being noble quashing any chance of that. But what if there is hope? Even if it’s dim and somewhere in the nebulous future -- it’s a hope I need in order to survive. Liv pauses on the top step. LIV (V.O.) But what about what Major needs? Can I really ask him to wait for a day that may never come? Liv pauses as she makes a decision. She turns back around and then she hears something -- a WOMAN’S SQUEAL. Liv, appearing terribly vulnerable, peeks in the window. LIV’s POV FINDS MAJOR and the NERDY BUT CUTE GIRL from the haunted house cuddled on his couch playing a first-person shooter Zombie game. They’re flirty and familiar. Liv stands there, frozen. The hope drains from her face as she watches Major and the girl blasting the heads off APPROACHING ZOMBIES. We can hear the video game sounds and Major and Nerdy’s laughter as Liv turns and heads down the stairs.  END OF ACT FOUR  42",
      "characters": [],
      "action_text": "ACT FIVE  INT. MONICA'S APARTMENT - NIGHT Clive searches Monica’s ransacked apartment. He opens closets. He opens a medicine cabinet. He flips through a UNIVERSITY OF PHOENIX COURSEBOOK open on a table, considers. He takes note of a dog bowl. INT. LIV'S APARTMENT - NIGHT PAN OFF LIV’S DIGITAL CLOCK which reads 3 a.m. and FIND LIV in bed staring at the ceiling, tortured. LIV (V.O.) When you die, life goes on without you. If you’re among the living dead, you get to watch. Liv reaches for a nearby REMOTE CONTROL and turns on the TV. LIV (V.O.) You can’t expect people to wait for you when you’re not you anymore. Trying to salvage bits of your old life? Holding onto whatever scrap of being a person you can? It’s pathetic. Pointless. Paulina won’t be any less dead if I help find her murderer. Neither will I. Off Liv, staring mindlessly at the TV. INT. POLICE STATION, LIEUTENANT’S OFFICE - DAY Clive enters, finds the LIEUTENANT and Pratt waiting for him. CLIVE You wanted to see me, Lieutenant? LIEUTENANT Pratt here has a CI who says your dead girl was in deep to the human trafficker who brought her here from the old country. He’s gonna run the case from here on out. CLIVE (deflating) But I’m so close, Sir. The killer was one of Paulina’s johns. The john’s ring was stolen, and he killed her trying to get it back. Only she didn’t have it.  (MORE)  43 The night it went missing he was with three call girls. I believe he is now tracking down the other two girls who have gone into hiding. I have a witness that says one got out of Dodge with a suitcase. It seems the other left with her dog. PRATT Three call girls? Are we looking for Superman? Ron Jeremy? CLIVE I’ve got a lead on the girls. One of them is enrolled at University of Phoenix. She logged into her economics class an hour ago. I got an IP address on the computer. The nerds in computer forensics are working on a location for me. We need to find the girls before the killer does. LIEUTENANT Maybe Pratt will let you tag alo",
      "dialogue_count": 0,
      "word_count": 4385
    }
  ]
}