{
  "slug": "jackie-2016",
  "title": "jackie",
  "genre": "drama",
  "format": "film",
  "scenes_count": 2,
  "characters_count": 0,
  "characters": [],
  "total_words": 14529,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. STAGING ROOM - WHITE HOUSE (1962)- CONTINUOUS  ** This is the legendary White House tour, broadcast by CBS on February 14, 1962, to an audience of 56 million people**  CHARLES COLLINGSWOOD of CBS NEWS narrates over black and white footage. COLLINGSWOOD (V.O.) This is the White House as seen from its South Lawn. For the next hour Mrs. John F. Kennedy invites you to visit the President’s House and see some of the restorations she’s made in its interior. Mrs. John F. Kennedy, third youngest of the twenty-nine wives to live in the White House. Jackie's beauty has been magnified ten-fold.   Her nerves have vanished.   She smiles, radiant, and the show is on... COLLINGSWOOD Mrs. Kennedy I want to thank you for letting us visit your official home. (beat) This is obviously the room from which most of your work on it is directed... All around them, ANTIQUE FURNITURE is arranged in various states of restoration and disrepair. JACKIE (playful) Yes, it's attic and the cellar all in one. Since our work started we received hundreds of letters every day. This is where we evaluate all of the finds and see if we want to keep them if they’ll fit into our budget. COLLINGSWOOD Mrs. Kennedy, every first lady and every administration since President Madison's time, has made changes greater or smaller in the White House. Jackie steals a glance off-camera.   With a quiet gesture -- Nancy reminds her to smile. 6.",
      "characters": [],
      "action_text": "COLLINGSWOOD (CONT’D) Before we look at some of the changes you've made...What's your basic plan? A beat, as Jackie considers her motivation.   And then, from the heart -- JACKIE Well, I really don't have one. Because I think this house will always grow and should.   It just seemed to me such a shame when we came here, to find hardly anything of the past in the house.   Hardly anything before 19-2. Off-camera Nancy looks at her notes, nodding along to Jackie’s words. COLLINGSWOOD Now suppose you and your committee were to acquire some of the things that are in this room, what happens when the next President’s wife comes into the White House? JACKIE Well if they don’t want it...in the past, you see, they could sell it or throw it out. CUT TO:  EXT. KENNEDY COMPOUND - DECK- DAY  Jackie continues the interview with the Journalist. JOURNALIST And the talk of the tax payer money being wasted? JACKIE I raised every dime privately that we spent on that restoration. I loved that house and wanted to share it with the American people. To impart a sense of America’s greatness. (beat) (MORE) 7. Objects and artifacts last far longer than people and they represent important ideas in history, identity...beauty. He scribbles down her remarks -- all cold, abstract ideas. And then, probing, trying to find the emotion... JOURNALIST I’m sure the readers would like to know... What it’s like to be a member of your family? Jackie thinks -- and then... JACKIE Imagine a little boy surrounded by all this. Having his older brother die in battle and then going off to that same war and coming home a hero. People see that little boy, born to wealth, privilege, willing to sacrifice everything for his ideals and service to his nation. JOURNALIST Royalty. You make it sound like royalty. JACKIE Well for royalty you need tradition. And for tradition you need time. JOURNALIST Well I guess it has to start somewhere, right? There has to be a day one? CUT TO:  INT. EAST ROOM - WHITE HOUSE (1962)  Jackie ",
      "dialogue_count": 0,
      "word_count": 12769
    },
    {
      "scene_number": 2,
      "slugline": "INT. KENNEDY COMPOUND - KITCHEN - LATER  The Journalist paces as Jackie rewrites furiously. JOURNALIST You left your mark on this country, Mrs. Kennedy. These past few days...That’s the story. (long beat) Losing a President is like losing a father.   And you were a mother to all of us. And that’s a very good story. (beat) The entire country watched the funeral from beginning to end. Decades from now, people will remember your dignity, and the majesty... (beat) They’ll remember you. CUT TO:  INT. MONROE ROOM - WHITE HOUSE (1962)  Collingswood and Jackie have reached the end of the tour -- the Monroe Room on the second floor. JACKIE It will serve a definite purpose. (beat) My husband has so many meetings up here, in this part of the house. All the men who wait to see him, now sit in the hall, with baby carriages going by them.   So they can sit in here and have a conference around this table, waiting for him. COLLINGSWOOD Well, he’s going to come in and-- PRESIDENT KENNEDY -- handsome, resplendent -- enters the room. COLLINGSWOOD (CONT’D) (excited) Mister president... They shake hands. 76.",
      "characters": [],
      "action_text": "PRESIDENT KENNEDY Mister Collingswood. COLLINGSWOOD Mrs. Kennedy has been showing us about the White House and all the changes she has made therein. What do you think of the changes that she’s made? PRESIDENT KENNEDY Well, I think that the great effort she’s made has been to bring us much more intimately in contact with all the men who lived here. Of course, I think anyone who comes to the White House as a President desires the best for his country. CUT TO:  INT. STAIRWAY - WHITE HOUSE  Nancy leads Jackie down the stairs, out of the White House for the last time... PRESIDENT KENNEDY (O.S.) And I think he receives stimulus from the knowledge of living in close proximity to the people who are legendary but who actually were alive and were in these rooms. Jackie notices -- down the hallway, Lady Bird reviews new fabric swatches with Walton. Walton catches her glance.   A hint of shame in his eyes -- but this is no longer her home. Jackie looks down and exits.  EXT. PORTICO - WHITE HOUSE - DAY  Caroline and John Jr head into a waiting limousine. All around them, the chaos of the MOVERS continues. NANCY Everything will be held in storage until you decide where to settle. The two women embrace. Jackie finally enters the car. 77. She looks back through the window to the home she devoted so much of her life. Echoing the first scene of the White House tour -- Nancy encourages her to smile. CUT TO:  INT. KENNEDY COMPOUND - LIVING ROOM  The Journalist watches Jackie from across the room. JACKIE There’s one last thing -- more important than all the rest... (beat) You know every night before bed, we had this old Victrola.   We'd listen to a couple records.   And his favorite was   Camelot . JOURNALIST The musical? JACKIE Oh, I'm so ashamed of myself. Every quote out of Jack’s mouth was either Greek or Roman.   And that last song, that last side of  Camelot   is all that keeps running through my mind. (beat) \"Don't let it be forgot, that for one brief shining moment there was a C",
      "dialogue_count": 0,
      "word_count": 1760
    }
  ]
}