{
  "slug": "jojo-rabbit-2019",
  "title": "jojo rabbit",
  "genre": "drama",
  "format": "film",
  "scenes_count": 8,
  "characters_count": 0,
  "characters": [],
  "total_words": 23012,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. JOJO’S HOUSE - MORNING We open with QUICK DETAIL SHOTS of a young boy dressing: - a brown shirt buttoned. - badges pinned. - belt tightened. - neck kerchief tied. - shoelaces tied and shoes polished. - socks pulled up to knees. - hair combed. - eye-pencil applied above top lip...?? - Shoes clicked together at the heels, one foot stomps down hard on the floor. He is dressed. We PULL to a CLOSE-UP, coming face to face with our HERO... JOHANNES BETZLER, (JOJO), a cute 10 year-old Boy. He stares into a full-length mirror. He has drawn a HITLER moustache on his upper lip. JOJO Jojo Betzler, ten and a half years old. Today you join the ranks of the Jungvolk. This is a great day, for you, for your family, and for all of Germany. And as “BREATHLESS” by NICK CAVE kicks in, we PULL OUT to reveal Jojo is dressed impeccably in a HITLER YOUTH uniform. He does a little dance on the spot and then looks over to a wall covered with pictures, posters and drawings of ADOLF HITLER. Jojo tries to WINK at a prominent poster of the Führer however he can’t close one eye independently so it’s more of a scrunched up BLINK. He tries again, not happening. He turns back to the mirror and does the NAZI SALUTE. JOJO (CONT’D) HEIL HITLER!!!  SUPER: “VIENNA, 1944”  EXT. STREET - DAY With a confident stride Jojo walks down the street admiring himself in store windows. He greets everyone he meets with the  Hitler salute.",
      "characters": [],
      "action_text": "JOJO Heil Hitler, Herr Josef! (beat) Heil Hitler, Frau Kirsch! He is joined by his best friend YORKI, 11 years old, geeky, fat and clumsy. They embrace. YORKI Jojo! JOJO Yorki! Heil Hitler! YORKI Heil Hitler! They continue walking with excited energy. JOJO Looking good Yorki. YORKI You too, Jojo. Did you bring your books? JOJO Of course. Now Yorki we must make a big effort this weekend. It’s rare for we Jungvolk to be allowed at a Hitlerjugend training weekend and I want to make a good impression. They may promote us to Hitler’s Special Guard early. Only the best of the best get to do that. YORKI Yes, you and I will be best of the best. JOJO The best Nazi’s the whole world has ever seen. They look a bit awkward and nerdy as they continue down the street. They scream another Heil Hitler at each other, scaring the shit out of an elderly woman walking past. EXT. WOODS - HITLERJUGEND CAMP - DAY Jojo and Yorki sit with other clean cut young children aged between 10 and 13.  2. CHILDREN (singing)  I swear to devote all my energies and my strength to the saviour of our country, Adolf Hitler. I am willing and ready to give up my life for him, so help me God.  A group of older kids, true HITLER YOUTH, are gathered nearby. A group of girls from the LEAGUE OF GERMAN GIRLS (BDM) march past on their way to a separate training area. Jojo sneaks a quick look at a pretty girl, GUDRUN (12). She returns a smile as CAPTAIN KLENZENDORF, weathered, over looking after kids, steps forward. He is accompanied by his camp, awkwardly enthusiastic assistant, SUB-OFFICER FINKEL (20’s). Captain Klenzendorf addresses the young crowd. KLENZENDORF Heil Hitler! FINKEL Heil Hitler! KLENZENDORF Jungvolk, welcome to our Hitlerjugend training weekend in which we will make men and women of you all. My name is Captain Klenzendorf - you may call me Captain K. FINKEL Captain K! Woohoo! KLENZENDORF ...and this is Sub-Officer Finkel. You may only call him Sub-Officer Finkel. Over the next two days you will ge",
      "dialogue_count": 0,
      "word_count": 2676
    },
    {
      "scene_number": 2,
      "slugline": "EXT. WOODS - TRAINING GROUND - DAY The older boys are getting instructions from Captain Klenzendorf on throwing hand-grenades. They stand around within a sort of trench set-up. The young kids sit back, behind the trench at a safe distance. Finkel stands nervously to the side, sort of hiding behind Klenzendorf. KLENZENDORF Now lads, the hand-grenade is one of the most effective weapons in the German army. It can blow off a leg, maybe 2 legs, definitely a head. It is very dangerous. Just quietly, I prefer the rounder, egg-shaped version used by the British and Americans. I dunno, it just seems silly that our ones look like sticks. FINKEL Sticks... pff. He continues talking in the background as Jojo approaches the young kids and sidles up next to Yorki. YORKI Are you alright Jojo? JOJO Absolutely, I was just doing some push- ups for my muscles. YORKI I thought you were crying. JOJO Nope. Push-ups. (flexing his tiny arm ) And don’t just assume that because water comes from someone’s eyes that they are crying, okay? Are you a tear- drop specialist? YORKI No. JOJO Case closed. Now, Yorki Dorky, it’s time for Jojo to show these big pip- squeaks who is a coward. I mean, NOT a coward - me. You’ll see what I mean. He takes a deep breath and scurries off into the bushes.  13.",
      "characters": [],
      "action_text": "YORKI (loud whisper) Jojo! Where are you going? Don’t you want to watch the hand-grenades? We are back with the older group. KLENZENDORF Now you little kids stay all the way over there and watch the action. (to the older kids) Each of you will be given the opportunity to arm and throw a grenade. ONE AT A TIME. I will personally be supervising each-- Suddenly, in a flurry of noise and action, Jojo bursts out of the bushes and onto the scene. JOJO Jojo rabbit! Jojo rabbit! Hunting carrots, Jojo rabbit! He runs past the boys, grabs one of the GRENADES from the open box and darts out, over the top of the trench and into the HOT ZONE - a wooded area stretching out before the group. KLENZENDORF You! Get back here with that!!! But Jojo is off, he runs from the group. Adolf Hitler runs beside him, goading him on, screaming things like “Jojo Rabbit!” They reach a little clearing where Jojo pulls the PIN on the grenade and screams an ungodly war-cry. JOJO JOJO RABBIIIIIIIIT!!! He hurls the grenade like a war hero. It flies through the air, bounces off a tree, hits another one, deflects off a nearby branch and ricochets backwards, landing only 6-feet away from Jojo. ADOLF Scheisse. He bolts, getting clear and leaving Jojo standing alone, the grenade at his feet. JOJO Ooh, scheisse... KABOOM!!! Jojo goes flying in an explosion of smoke and debris.  14. SFX: HEAVY BREATHING... FADE OUT. INT. HOSPITAL CORRIDOR - DAY JOJO’S POV - The next couple of minutes are small glimpses as Jojo comes in and out of consciousness. - Bright lights in an operating room. A doctor hovers over us, we see INSTRUMENTS. A concerned Adolf Hitler peeks in, smiles and gives us the thumbs up. Jojo’s BLOODIED THUMB comes into view. - Over BLACK, we hear voices. Fade up to see a concerned male doctor and Captain Klenzendorf. KLENZENDORF It was one of those stick-shaped ones, not the superior oval type. Do you know the ones I mean? Finkel holds up one a stick grenade. FINKEL Like this. KLENZENDORF Exactly. An",
      "dialogue_count": 0,
      "word_count": 2126
    },
    {
      "scene_number": 3,
      "slugline": "EXT. TOWN - STREET - DAY Jojo pins up some posters of HITLER in a stoic pose, looking off into the distance. Below him is the propaganda slogan:  ONE PEOPLE, ONE EMPIRE, ONE LEADER  Jojo smiles at this image of the mighty Führer. He gives a happy “Heil Hitler” to people who pass by, but we get the feeling the public are losing enthusiasm in their salutes. JOJO Heil Hitler, Frau Baumer! FRAU BAUMER Hmm? Oh yes, Sieg Heil. JOJO Heil Hitler, Herr Koch. HERR KOCH Hmm?   (seeing Jojo’s injuries) Oooh, yikes. EXT. TOWN SQUARE - FLORIDSDORFER SPITZ - DAY Jojo jauntily walks through a large town square where he sees a number of locals grouped near some trees. He gets closer and sees they are gathered before a make-shift GALLOWS. About FIVE BODIES, men and women hang from the GALLOWS while onlookers stare or take photos. There are signs around their necks but we don’t see what is written on them. Jojo moves on, taking occasional glimpses back. I/E. GRUSCH GROCERY - DAY He reaches a small GROCERY STORE. He enters and approaches the quiet and sad-eyed Herr Grusch. JOJO Heil Hitler, Herr Grusch. HERR GRUSCH (seeing Jojo’s injuries) What happened to you? JOJO War wound. I’ll probably get a medal. (then)  23.  (MORE)",
      "characters": [],
      "action_text": "Herr Grusch, I have here a conscription notice for your son. Wait, is his name Klaus? Herr Grusch sighs. HERR GRUSCH Yes, it is, but he already joined. JOJO Where is he? The old man points upwards. JOJO (CONT’D) Oh, I’m sorry. The Führer would be proud. HERR GRUSCH That’s comforting. (Taking the letter) Klaus is also my name. JOJO But you’re... HERR GRUSCH They’re recruiting us veterans of the Great War now. There are no more young people left. This whole thing is becoming very flimsy. I don’t know how to operate a flame-thrower or anti- tank gun. So stupid. He throws his conscription down. JOJO (turning) You are more able than I Herr Grusch. Everyone must do their part and that includes you. I hope I do not need to tell the authorities of your indolence. (beat) Heil Hitler! A long beat. Herr Grusch smiles warmly and nods. HERR GRUSCH Bye Johannes. Jojo turns on his heels and leaves.  24.  JOJO (CONT'D)",
      "dialogue_count": 0,
      "word_count": 380
    },
    {
      "scene_number": 4,
      "slugline": "INT. JOJO’S HOUSE - DINING ROOM Jojo arrives home. JOJO Mama! I’m home. He drops his satchel and heads for the kitchen. JOJO (O.S.) (CONT’D) Maaaama, Field Marshall Jojo is home. He returns. JOJO (CONT’D) Mama Lion? We hear a noise from upstairs. A small THUD. Jojo looks up. INT. JOJO’S HOUSE - INGA’S BEDROOM - LATER Jojo slowly makes his way down the upstairs hall, looking in rooms. He moves towards his sister’s room. He takes a moment before stepping into the room and wandering around. He looks at a photo of INGA, she is beautiful. He smiles and puts it down, and then... BANG! The door slams shut. Jojo stands. He turns to see the window is open, the drapes blowing. He breathes a small sigh of relief, sits on the bed. He examines an array of Inga’s things on the dresser in front of him, RIBBONS, DRAWINGS, PINS and MINIATURES. He then inspects himself in the DRESSER MIRROR. He doesn’t like his face. THEN, in the background of the reflection, he notices the opposite wall. Jojo is at the wall now, it is bare. On the ground sits a picture in a frame. He picks it up and is about to re-hang it when HE SEES IT. The wall is scratched, there is a thin cut in the wallpaper that measures from his shoulder to the ground. He traces the line of the cut and sees that it moves at right angles. It is a DOOR. The hook it would hang on is also used as a handle to pull the door open. Jojo takes his trusty DJ KNIFE and pries the door out a little, at the same time holding the hook and pulling the door OPEN. The light from the opposite window doesn’t illuminate everything but it does cast a wide beam into the darkness. As Jojo’s eyes momentarily adjust he begins making out objects. At first it’s only BOOKS.  25.",
      "characters": [],
      "action_text": "JOJO Mama, the bad books. It’s not allowed. Then he sees a candle, bedding, a plate, a fork, and then a PALE, LONG HAIRED CREATURE hunched in the corner, its face partially hidden beneath dishevelled long black hair, its dark eyes staring back at him. Jojo jumps at the sight and backs away, tripping on the rug and stumbling to the opposite wall which he bumps into DROPPING HIS KNIFE on the ground. He stays still, frozen in fear, watching. He can only see the darkness of the secret rooms interior now, that thing is around the corner, hidden from view. Footsteps. Slowly, with listless energy and no real purpose, a pale skinny little girl emerges from the darkness. This is ELSA KORR (15) She stops at the doorway, and casually leans her thin arm, against the frame. She wears a simple knee-length dress, brown and dirty, and has bare feet. ELSA You come to kill me, little boy? JOJO I... He can’t say anything. A pause, and then she giggles. It is cute and disarming at the same time. There’s something attractive and alluring about her. Jojo can’t speak. LEAVING HIS KNIFE he scuffles out the door, getting out as fast as he can, down the hall, down the stairs. He stops in the bottom hall and turns, listening. ELSA (O.S.) Joooooo-jooooooo... STOMP. STOMP. STOMP. Footsteps on the stairs get louder. Eventually Elsa rounds the corner and sits on the top stair, they have distance between them. JOJO Who are you? What do you want? Are you a ghost? ELSA (smiling, spooking him) Yesssssssssss... a ghost. She splays her arms out like a ghost.  26. JOJO Get out! Get out of my house! ELSA (normal) Johannes, that’s no way to treat a ghost. JOJO Why do you live upstairs in the wall?! ELSA Where else should a ghost live? JOJO Not here! He runs towards the front door but is too slow. Elsa jumps from her position and bounding like a cat she reaches him as he gets to the front door. She grabs him by the scruff of the neck and slams him into the wall, breathing heavily from the effort. ELSA Don’",
      "dialogue_count": 0,
      "word_count": 1390
    },
    {
      "scene_number": 5,
      "slugline": "INT. JOJO’S HOUSE - JOJO’S BEDROOM - DAY Back in his bedroom, the door firmly shut. ADOLF Great, now she’s got TWO knives! JOJO I know! ADOLF How are you going to chop up stuff?! JOJO I don’t know! ADOLF And she’s still up there! JOJO You’re the expert, you think of something! Hitler lights another cigarette, offers it to Jojo. JOJO (CONT’D) I don’t smoke! Stop offering me fucking cigarettes! I’m TEN! ADOLF Sorry, sorry, this is stressful. They start pacing, thinking, pacing, thinking... Hitler produces a CAN OF GASOLINE and some MATCHES. Jojo waves it away. They pace and think some more... As Jojo paces back he turns to see Hitler has made a giant MOUSETRAP CONTRAPTION. He gestures “What about this?” Jojo shrugs, “Maybe”... and paces some more. ADOLF (CONT’D) Okay, let’s talk like turkeys. I guess you can’t tell your mother or the Jew will cut off your Nazi head. No real way around that right now. But y’know, there’s no reason this thing in the attic needs to ruin your life. I think you could use it to your advantage. JOJO How? ADOLF Well, when someone tries to use mind- powers on me, you know what I do?  31.  (MORE)",
      "characters": [],
      "action_text": "(beat) Use mind powers back on them. Jojo perks up. ADOLF (CONT’D) Remember last year when that pirate, Von Stauffenberg tried to blow me up with a bomb? JOJO Yeah, but you survived. ADOLF Correct-a-mundo. But the only reason I survived, apart from having bomb-proof legs, is because I outwitted old Von Stauffy. I let him think I was dead when in actual fact I was fine. By pretending I was dead I drew out all the traitors. So, what are you going to do? JOJO Pretend I’m dead? ADOLF Exactly. Wait. No. I think what I mean is this: Make her feel safe and she will drop her guard and then you will be the one in control. JOJO Is that “Reverse Psychology”? ADOLF Umm, I don’t think so. Let’s not complicate things. Stick with my idea - use mind-powers back on her - and you’ll be fine. (checks his watch) I gotta go. Good luck and remember the old saying: a Jew living in your wall is better than a two Jews flying around eating innocent Nazis. He climbs out the window. ADOLF (CONT’D) And don’t give her any more KNIVES! He winks and is gone. Out on Jojo’s worried face.  32.  ADOLF (CONT'D)",
      "dialogue_count": 0,
      "word_count": 412
    },
    {
      "scene_number": 6,
      "slugline": "INT. JOJO’S HOUSE - LIVING ROOM - EVENING Jojo sits in the living room, a look of utter fear and confusion covers his face. The house is silent save for the ticking of a clock. INT. JOJO’S HOUSE - KITCHEN - EVENING Jojo stands in the kitchen holding a piece of bread in his hand, still staring into space. A tap drips to the same rhythm of the clock. EXT. JOJO’S HOUSE - FRONT DOOR - EVENING Jojo waits on the steps of his house. The sound of dripping is replaced by a man walking down the street in hard shoes. Across the road a neighbour peers through their curtain. INT. JOJO’S HOUSE - FRAU BETLZER’S ROOM - EVENING Jojo sits in his mother’s room on the bed. The house is silent save for the ticking of Jojo’s watch. We hear a car pull up, the door close, footsteps. Frau Betzler enters the house. Jojo runs to meet her... INT. JOJO’S HOUSE - FRONT DOOR - CONTINUOUS He meets his mother at the front door. JOJO Mama! FRAU BETZLER Darling, darling, why are you still up? Did you eat? JOJO It’s 10 o’clock. Where have you been?! FRAU BETZLER Oh cub, I was just taking a long walk and having a think. I lost track of time. JOJO Mama you should be careful. They frown upon those who display sneaky behaviour.  33.",
      "characters": [],
      "action_text": "FRAU BETZLER Sneaky?! You goose. I promise things will be back to normal soon. Trust me. How was the Hitlerjugend? Did you get some helpful work done today? JOJO Yes. Mama, I need to have a grown-up conversation with you. (under his breath) And what did   you   achieve? No answer, Frau Betzler notices one of Jojo’s laces are untied again. FRAU BETZLER (crouching to tie them) Oh, your laces, you really must-- JOJO I heard the her. FRAU BETZLER (jumping) What? Jojo keeps watching, trying to work her out. JOJO (staring at his mother) Inga. Her ghost is here. FRAU BETZLER (laughing) Oh for Heaven’s sake what are you talking about? JOJO Noises. FRAU BETZLER Oh come on. You mean the RATS?! We have rats in the attic and yes, I’ve heard them too. Honestly, ghosts?! Actually, I’ve been meaning to say; you probably shouldn’t go up there till I’ve caught them all, they have diseases and I don’t need you getting sick. Okay? (beat) Okay? Jojo nods.  34. JOJO Okay mama. FRAU BETZLER Now, I left my gloves in a dream, could you be a darling and go get them for me? INT. JOJO’S HOUSE - JOJO’S ROOM - MOMENTS LATER Frau Betzler tucks Jojo into bed. JOJO Mama, do you miss papa? FRAU BETZLER Like the sun misses the moon. JOJO And you miss Inga. FRAU BETZLER Like the moon misses the sun. JOJO Are you going to bed now? FRAU BETZLER Of course. I need to tidy up some things before bed. JOJO What things? FRAU BETZLER Mama things. Boy, you really have to trust me, I’m the boss here. A beautiful smile appears across her face, she WINKS. Jojo can’t help a tiny smirk, he tries a return wink but can’t. FRAU BETZLER (CONT’D) Like this. She demonstrates and winks again, Jojo attempts a return wink but isn’t getting it. FRAU BETZLER (CONT’D) Yeah, but with just one eye. You can do it.  35. They continue this hopeful exchange a few more times. She eventually places a finger over one of his eyes. He blinks his other eye. FRAU BETZLER (CONT’D) There you go! You got it! Now go get my gloves, will ya? I l",
      "dialogue_count": 0,
      "word_count": 4698
    },
    {
      "scene_number": 7,
      "slugline": "INT. JOJO’S HOUSE - INGA’S BEDROOM - LATER Jojo is back. He knocks lightly on Elsa’s wall. JOJO Hi. He knocks lightly again. JOJO (CONT’D) Are you still alive? ELSA (O.S.) Barely. JOJO Oh, well that’s good. Um, don’t open the door because it’s risky today. So I actually forgot there was a second letter. I forgot I had it. I’ll just read it. (reading) Dear Elsa. I just wanted to say that I don’t want to break up with you now. I changed my mind because I don’t want you to kill yourself over me which a couple of girls have done in the past and it gives me nightmares. (beat) So, let’s still get married sometime - even though I truly am unemployed and have nothing much going for me. I don’t even know how to tie a knot or read a map. Yours, Nathan. (then) No X’s or O’s I’m afraid but it still seems pretty positive. A beat. Elsa’s door opens to reveal her sitting, staring at Jojo, a peaceful look on her face. This Jojo kid’s a character. He gives a tiny smile. INT. JOJO’S HOUSE - INGA’S BEDROOM - LATER CLOSE UP on Jojo, mid-discussion with Elsa. JOJO Beethoven. ELSA Einstein.  57.",
      "characters": [],
      "action_text": "JOJO Bach. ELSA Gerschwin. JOJO Brahms. Mozart. Wagner. ELSA All musicians, is that all you have?! JOJO (laughs) Freud then. ELSA Ha! You dare take Freud?! (waving a finger) No, no, no, never. He’s ours. JOJO (laughing) He’s German! ELSA (laughs) No Freud for you! Or Proust. JOJO Rilke. ELSA Oh of course, your favourite, Rilke. Jewish mother. JOJO Well no one takes Goethe. ELSA Keep him, we have Kafka. JOJO Durer. ELSA Pah... Chagall shits on Durer. A big Russian shit on your boring Durer. They laugh some more.  58. JOJO Marlene Dietrich, then. ELSA (smiling, clicking her fingers) Houdini. JOJO Nooooo... impossible. ELSA Believe it brother. Just ask Pissaro, Modigliani, Max Jacob, Man Ray, Henschel, Nimzowitsch, Gertrude Stein, Mr. Moses and Jesus Christi, Amen. JOJO You’re just saying any old name now. I’ve never heard of these people and now I’m fed up. He stands and leaves the room. We stay with Elsa, after a while... ELSA Night. EXT. FOOD RATION STORE - DAY Frau Betzler stands in line to receive her food allowance. She hands three RATION CARDS to the STOREMAN. STOREMAN Three? I remember you only used two in the past. FRAU BETZLER Ah, yes, but I have developed a more efficient system. I now use 3 ration cards, taking enough for 2 to eat, but then we take twice as long to eat it, you see? 3 for 2, which makes 6. But here’s where it gets interesting; you take the original number times it by 3, carry the 7, subtract 2, then add 2 again (because secretly you need the 2), then divide the whole thing by the potatoes. (smiling) Simple, no?  59. The Storeman looks puzzled and a couple of other people in line watch the exchange suspiciously. Jojo helps his mother with the shopping and they leave. FRAU BETZLER (CONT’D) Excuse me, look out, German coming through. EXT. TOWN - RIVER - EVENING Jojo and his mother sit with some locals on the banks of the river as a small, pathetic parade of RETURNED SOLDIERS go by. Frau Betzler looks to the sky. FRAU BETZLER Once there were fir",
      "dialogue_count": 0,
      "word_count": 11201
    },
    {
      "scene_number": 8,
      "slugline": "EXT. JOJO’S HOUSE - CONTINUOUS Jojo and Elsa stand on the front steps of the house. Elsa looks at Jojo and then back out to the street. Yorki sits nearby, he waves, smiling. On the opposite corner we see a couple of British soldiers crossing the road talking casually, in ENGLISH. An AMERICAN and RUSSIAN FLAG can be seen hanging from a building in the distance. Realising what is going on, Elsa drops her bag. Jojo shuffles his feet nervously. After a while, he does a small fist pump. JOJO Yes... (then) We made it. Long pause. The silence is cut by David Bowie’s “HEROES” and we FADE OUT. SUPER:  Let everything happen to you, Beauty and Terror, Just keep going, No feeling is final.   RILKE END.  113.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 129
    }
  ]
}