{
  "slug": "judas-and-the-black-messiah-2021",
  "title": "judas and the black messiah",
  "genre": "action",
  "format": "film",
  "scenes_count": 10,
  "characters_count": 0,
  "characters": [],
  "total_words": 21353,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. BLACK PANTHER HEADQUARTERS - CLASSROOM - DAY 9   9 Fred strikes and lights a match, bringing it to the tip   * of his cigarette, the epitome of confident cool. FRED Somebody define war for me. ANOTHER ANGLE BOBBY RUSH (22) distributes photocopies to a classroom of about ten Panthers including JIMMY PALMER (21), JAKE WINTERS (19), DOC SATCHEL (19), and JUDY HARMON (20), the sole woman present, always wearing combat boots.   Written behind Fred on the chalkboard -- “War vs. Politics.” Winters enthusiastically waves his hand in the air. Palmer calls out -- PALMER War is violent conflict between two or more parties. FRED Would you say we at war with the   * pigs, Comrade Palmer?   * PALMER Chairman, I’d take it a step further and say that every ghetto across the nation should be considered occupied territory. His assertion is greeted with scattered “right on’s.” FRED Right on. How ‘bout politics?   * Fred addresses a waving Winters. FRED How would you define politics, brother? WINTERS Uh, y’know... elections... FRED Elections   can be   a part of politics, certainly.   But we in the party ascribe to Chairman Mao’s definition of politics. (MORE) (CONTINUED)  Rev. mm/dd/yy (Tan)   13.",
      "characters": [],
      "action_text": "He said war is politics with   * bloodshed and politics is war   * without bloodshed.   Say it with   * me, y’all. GROUP  War is politics with bloodshed and   *  politics is war without bloodshed.   * FRED What that mean?   It mean every   * time the pigs shoot down an unarmed brother or sister in the street, Mayor Daley pulled the trigger.   It mean Tricky Dick   * Nixon is the fattest, most filthy pig in the pen! The group laughs. FRED So how do we win this war?   What’s our most lethal weapon?   Guns? Grenades?   Rocket launchers? Tucked deep in the back of the classroom we REVEAL O’Neal; above his eye, a two-week old patch of bloodstained gauze. O’NEAL (excitedly whispering to himself) These niggas got rocket launchers?   * O’Neal looks confused when Fred writes the answer on the blackboard:   “The People.” FRED There’s strength in numbers --   * power anywhere there’s people. And in order to overthrow this racist, fascist, nefarious U.S. Government, it’s gonna take everybody.   * EXT. LATINO NEIGHBORHOOD - DAY 15   15   * POV viewed FROM ACROSS the street, we observe Fred   * pitching papers with zeal.   Doc sells papers on the same   * side of the street at the opposite end of the block.   * FRED   *  Black Panther   paper!   Free your   * mind for just a quarter!   * CONTINUED: 9   9 FRED   (CONT'D) (CONTINUED)  Rev. mm/dd/yy (Tan)   14. COACHMAN   * Sorry, I’m on my way to work.   * FRED   * I’m at work, sister.   I work for   * you.   * Fred walks alongside the woman, BETTY COACHMAN,   * persisting until she parts with a quarter.   * FRED   * Information is raw material for   * new ideas. You got kids? Your   * friends got kids?   * COACHMAN   * Yeah.   * FRED   * We got a breakfast program feeds   * near 100 kids a week.   * REVEAL:   The POV is O’Neal’s.   He shivers, a bundle of   *  Black Panther   newspapers in his hands.   * FRED (V.O.)   * Because we’ve grown so accustomed   * to being poor that we think it’s normal for our kids to go to school hungr",
      "dialogue_count": 0,
      "word_count": 6360
    },
    {
      "scene_number": 2,
      "slugline": "EXT. CHURCH (LINCOLN PARK) - DAY B41   B41 A mass of Puerto Rican funeral mourners spills out of a church, carrying a casket to a hearse.   Among them, JOSÉ “CHA CHA” JIMÉNEZ (20) and members of the YOUNG LORDS:   a Puerto Rican gang donning purple berets. FRED (V.O.)   * Well guess what? America is on   * fire right now. And until that   * fire is extinguished, don’t   * nothing else mean a Goddamn thing!   * * Cha Cha looks across the street.   A contingent of Panthers march forward in formation.   * OMITTED 42   42 SAME SCENE - MOMENTS LATER A43   A43   * O’Neal, the only black diner, eats a steak across from Mitchell who jots notes in his book. MITCHELL (incredulous) So... Rednecks and Puerto Ricans?   * In Chicago? O’NEAL That mufucka Fred, man... he could sell salt to a slug.   * Mitchell slides five twenties across the table to O’Neal. FOCUS ON:   Mitchell’s book.   Written inside “Panthers + Patriots + Lords = ???” MITCHELL   * Nice work, Bill.   * FRED (V.O.) (pre-lap; over megaphone) Chicago is the most segregated city in America... OMITTED 44   44  Rev. mm/dd/yy (Tan)   42.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 191
    },
    {
      "scene_number": 3,
      "slugline": "EXT. POLICE PRECINCT - DAY 45   45 Fred stands on the precinct steps next to Cha Cha, Fesperman, and a coalition of PANTHERS, PATRIOTS, and YOUNG LORDS.   A mass of protesters gather before them, carrying signs that read “Justice For Manny!,“ “Strength In Unity,“ and images of a pig with an “X” drawn through it.   Riot cops with helmets and batons bar the entrance. Fred addresses the crowd. FRED (on megaphone) ...Not Shreveport.   Not   * Birmingham.   But we’re here to change that.   The Black Panthers, the Young Lords, and the Young Patriots are forming a Rainbow Coalition of oppressed brothers and sisters of every color!   Cha Cha, tell ‘em why we’re gathered here today. Fred hands Cha Cha the megaphone. JIMÉNEZ (on megaphone) Last week, our brother, Manuel Ramos, was shot in the head and killed by an off-duty pig.   So we -- caught the pig, and turned him over to his fellow pigs.   And for some reason we expected justice. Well, let’s see what they do now   * that we’re in front of the pigpen   * and we demand an independent   * investigation! A cheer emanates from the crowd.   Fesperman takes the megaphone and leads a call and response. FESPERMAN No more pigs in our community! CROWD Off the pigs! As Fred takes in the mass of protesters, he can’t help but feel a small semblance of progress if not victory. He and Deborah lock eyes and share a clandestine moment of genuine connection. FESPERMAN No more pigs in our community! (CONTINUED)  Rev. mm/dd/yy (Tan)   43.",
      "characters": [],
      "action_text": "CROWD Off the pigs! FESPERMAN   * No more pigs in our community!   * CROWD   * Off the pigs!   * FESPERMAN   * No more pigs in our community!   * INT. FRED AND DEBORAH’S APARTMENT - BEDROOM - DAY   * Fred and Deborah lie in bed together.   * DEBORAH   * Your feet are cold. Why your feet   * so cold?   * FRED   * My feet cold? Your feet are cold.   * That’s socialism, man. You gotta   * warm ‘em up. How you think Mao did   * the long march? Chinese warming   * these feet left and right.   * Deborah laughs.   * DEBORAH   * You saying I’m a foot capitalist?   * You really done call me a foot   * capitalist, Chairman?   * CUT TO BLACK: FADE IN: INT. NONDESCRIPT OFFICE - DAY (1989) C46   C46 O’Neal’s interview -- INTERVIEWER (O.S.) So... Summer of ‘69.   The Rainbow   * Coalition is in full swing. Fred’s influence is growing.   What happens next? INT. FBI HEADQUARTERS - AUDITORIUM - DAY   * Hoover stands in front of the projector.   * CONTINUED: 45   45 (CONTINUED)  Rev. mm/dd/yy (Tan)   44. HOOVER   * I want him off the street! Charge   * him with something! Anything! But   * get his Black ass off the street!   * Mitchell sits in the audience, listening.   * * SMASH CUT TO: INT. BETTER BOYS FOUNDATION - LARGER CAFETERIA (1969) D46   D46 The breakfast program has expanded to close to 60 kids. OFFICER MARONEY (30s), white, plainclothes and OFFICER   * CAPLE (30s), black, plainclothes, handcuff Fred.   * Harmon holds Deborah back.   * DEBORAH Y’all don’t see there’s kids in here? Huh? Course you’re gonna go   * to a free breakfast program, pull   * something like this. Bunch of   * cowards. You disgust me.   * FRED   * Show some discipline. Tell Rush to   * get me a lawyer.   * Fred allows himself to be cuffed.   Several of the kids are crying as he’s escorted out. FRED Don’t worry, y’all, I’ll be right   * back. Deborah and most of his comrades follow Fred outside. INT. NONDESCRIPT OFFICE - DAY (1989) 47   47 O’Neal’s interview -- O’NEAL Ice cream... He was accused of tak",
      "dialogue_count": 0,
      "word_count": 854
    },
    {
      "scene_number": 4,
      "slugline": "INT. PANTHER HEADQUARTERS - CLASSROOM - CONTINUOUS ACTION A48   A48 -- emerging in the OUTER OFFICE, where Winters and Palmer are gathered around GEORGE SAMS (23), who quiets as O’Neal approaches -- SAMS Who is that?   * O’NEAL Security Captain Bill O’Neal,   * motherfucker.   Who are you?   * SAMS George Sams -- Security Captain of the New Haven chapter.   Pardon the paranoia -- WINTERS We got a rat! O’Neal tries to quell the distress roiling inside of him. O’NEAL What? WINTERS They smoked one out.   In New Haven. O’NEAL (barely calming down) How? How?   * PALMER Put the squeeze on that   * motherfucker, that’s how.   * SAMS I didn’t say that.   I said, the brother got some discipline, in   * the areas of the nose and mouth.   * And the brother started to show   * cowardly tendencies.   So... we   * boiled some water and gave him a little more discipline. (off O’Neal’s horror) We held a trial first.   * O’NEAL Shit, where he at now?   * SAMS He’s at the bottom of the river   * with the rest of the trash.   * (CONTINUED)  Rev. mm/dd/yy (Tan)   47.",
      "characters": [],
      "action_text": "Sams laughs, inspiring the others to mirth -- O’Neal’s is clearly forced, belying his growing panic. O’NEAL   * Shit, I would’ve killed that   * motherfucker too. Killed him dead.   * I’d have beat the shit outta that   * nigga too. Boy. I woulda shot that   * nigga, stabbed his ass. Man, y’all   * lucky I wasn’t there. I woulda...   * boy... bitch motherfucker.   * EXT./INT. MITCHELL’S CAR - DAY 49   49   * Mitchell smokes a cigar, parked.   After a moment, O’Neal’s car pulls up next to his.   O’Neal hops out and climbs inside Mitchell’s car. O’NEAL Does anybody else know about me?   * MITCHELL   * No.   * O’NEAL   * From the Bureau.   * MITCHELL No. (off of his mistrustful look) My superiors know I have a man on the inside.   But...   * O’NEAL   * Huh?   * MITCHELL   * My superiors know I have a man on   * the inside but that’s it.   No one   * knows your identity.   * O’NEAL Are you sure?   * MITCHELL I swear on my kids. Okay?   What’s   * got you all spooked? O’NEAL This Panther from New Haven came   * down. He talkin’ about they caught   * an informant, and they tortured   * him, and they killed him, Roy.   * CONTINUED: A48   A48 (CONTINUED)  Rev. mm/dd/yy (Tan)   48. MITCHELL Who did?   * O’NEAL His name is George Sams.   * Mitchell pulls out his notebook and begins jotting notes. MITCHELL And who’s the fella they killed, this informant? O’NEAL His name’s Alex Rackley.   Out of   * New York. I don’t know, I never   * met him. Shit.   * MITCHELL Where’s Sams hiding now?   * O’NEAL He’s hiding at the office. Saying   * he’s gonna skip town and, you   * know, get out of here.   * MITCHELL Okay, I need you to draw me up a   * floor plan of the office.   With this intel, I can get authorization for a raid. O’NEAL   *  What?   * MITCHELL   * (off of O’Neal’s uneasiness) Don’t worry; I’ll give you a heads- up so you can make yourself scarce. O’NEAL   * Roy, are you fucking listening to   * me right now? They poured boiling   * water   all over   this motherfucker.   ",
      "dialogue_count": 0,
      "word_count": 1395
    },
    {
      "scene_number": 5,
      "slugline": "INT. MENARD STATE PENITENTIARY - FRED’S CELL - CONTINUOUS 62   62   * ACTION   * Fred writes, as before.   * FRED (V.O.)   * Pardon the delay in writing you.   * It’s not by choice.   * VOICE (O.S.)   * C.O.! C.O.!   * Fred’s ears prick.   He stops writing and hides the letter   * under the bed.   * FRED (V.O.)   * The pigs do everything in their   * power to keep us isolated.   * Because they know the day we get   * organized, it’s over for their   * asses.   * When the guard walks past Fred’s cell, he’s in the midst   * of doing push-ups.   * INT. MENARD STATE PENITENTIARY - CAFETERIA - DAY 64   64   * The men eat in total silence.   Fred looks around at the   * despondent faces before him.   * FRED (V.O.)   * Not having books I find myself   * playing old speeches in my head. I   * keep coming back to this line from   * Dr. King. Let us not wallow in the   * valley of despair. Because make no   * mistake, Comrade.   * Fred locks eyes with one prisoner who doesn’t eat.   The   * man’s nose wound, oozing puss.   * FRED (V.O.)   * This is the fucking valley. But   * where some see despair, I see   * ground zero for the revolution.   * 2,000 brothers who know who the   * enemy is. Who don’t need the   * contradictions to be heightened,   * because in Menard, the   * contradictions don’t get more   * Black and white.   * Fred gives the man a nod and rises to his feet along with   * the other prisoners.   * (CONTINUED)  Rev. mm/dd/yy (Tan)   54.",
      "characters": [],
      "action_text": "He furtively withdraws the letter he’s been writing from   * inside his waistband and tucks it underneath his tray   * before exiting in single file.   * FRED (V.O.)   * A lot of these brothers came here   * politicized too. They just need   * organizing.   * As the men file out, it is revealed that the man with the   * nose injury is naked and chained to a chair; carved into   * his chest the words “RABBLE ROUSER.”   He watches DENNIS   * COMPTON (39), part of the clean up crew, who picks up   * Fred’s tray, retrieves the letter, and continues bussing   * trays.   * OMITTED 65   65   * OMITTED 66   66   * * INT. MENARD STATE PENITENTIARY - CORRIDOR - DAY 63   63   * The inmates are lined up in front of their cells.   * FRED (V.O.)   * By the time I’m through, I might   * fuck around have the pigs reading   * Fanon.   * A C.O. attacks Fred, and he fights back, punching the   * C.O. in the face. Fred is forced to the ground.   * INT. FRED AND DEBORAH'S APARTMENT - LIVING ROOM - NIGHT   * Deborah opens an envelope from Fred.   * FRED (V.O.)   * I have so many questions about how   * you’re doing. About how the   * party’s doing. But ain’t no way   * you’re getting a kite to me in   * this Hellhole.   * But there’s no letter inside.   * CONTINUED: 64   64  Rev. mm/dd/yy (Tan)   55.",
      "dialogue_count": 0,
      "word_count": 516
    },
    {
      "scene_number": 6,
      "slugline": "INT. FEDERAL BUILDING - MITCHELL’S OFFICE - DAY 68   68   * FOCUS ON:   Fred’s handwritten letter, placed on top of a   * photocopier.   * FRED (V.O.)   * God forbid one of the party   * members get sent on, they could   * let me know how y’all are faring.   * But I’d rather be left in the   * dark. The last thing I want is   * y’all up in here with me. Or   * worse.   * The copier closes and turns on.   REVEAL:   Mitchell   * standing above it.   * EXT. STREET CORNER NEAR A DELI (WEST SIDE) - NIGHT 53   53 Palmer smokes a cigarette.   * FRED (V.O.)   * Tell the comrades to be careful.   * Especially when they’re out   * patrolling the pigs.   * He spots a group of COPS entering a deli.   * FRED (V.O.)   * Brother who just got in told me   * they’ve been vamping extra heavy   * since the summer started.   * Palmer storms down the block.   * FRED (V.O.)   * Y’all stay safe. In revolutionary   * love, Chairman Fred.   * Palmer reaches the deli. INT. DELI - CONTINUOUS ACTION A53   A53 Inside, the police have lined up a HALF-DOZEN mostly older black men. PALMER Officers? Now what crime have   * these brothers perpetrated?   * Valentino whirls around, a hand on his pistol.   * (CONTINUED)  Rev. mm/dd/yy (Tan)   56.",
      "characters": [],
      "action_text": "VALENTINO Get the fuck outta here. Palmer places his hand on the .38 in his waistband. PALMER No, see I live here. Now y’all get   * the fuck outta here. Valentino looks at Hester in astonishment. Valentino suddenly draws his pistol and shoots Palmer in   * the abdomen.   Palmer FIRES back, striking Valentino, who spins around, clutching the side of his head.   Hester draws his weapon, but before he can fire, Palmer SHOOTS him in the shoulder.   Palmer takes a moment to assess his wounds.   He’s bleeding from the stomach.   Unbeknownst to him, Valentino isn’t seriously wounded.   He shoots Palmer in the shoulder, causing him to fall on his back.   * INT. HOSPITAL - STAIRCASE - DAY A68   A68   * Winters, carrying several books under his arm, climbs the   * steps of the hospital where he spots REG (30s) operating   * a dust mop.   * REG   * Jake!   * WINTERS   * Hey, Reg.   * REG   * The fuck you doing up in here? I   * sure as shit know a square like   * you ain’t got the clap.   * WINTERS   * Nah, man. Comrade Palmer got shot   * by the pigs.   I’m looking in on   * him.   * REG   * (somewhat uneasy)   * Alright, Blood.   Be careful.   * INT. CERMAK HOSPITAL - CONTINUOUS ACTION 69   69   * Winters walks down the hallway carrying several books   * under his arm.   He reaches a hospital room with a   * HOSPITAL POLICE OFFICER (50s) seated next to the   * entrance, reading a newspaper.   The door is closed.   * CONTINUED: A53   A53 (CONTINUED)  Rev. mm/dd/yy (Tan)   57. Winters opens his mouth to address the cop but before he   * can --   * HOSPITAL POLICE OFFICER   * No visitors allowed.   * WINTERS   * The nurse told me visiting hours   * aren’t ‘til 10 PM.   * HOSPITAL POLICE OFFICER   * Not for your pal, here.   * WINTERS   * Can I at least leave him the   * books?   * HOSPITAL POLICE OFFICER   * You may not.   * Winters fumes.   Refusing to be stymied, he opens up a   * paper and begins READING ALOUD to Palmer on the other   * side of the door.   The cop looks up ",
      "dialogue_count": 0,
      "word_count": 1676
    },
    {
      "scene_number": 7,
      "slugline": "EXT. PANTHER HEADQUARTERS - ROOF - DAY 75   75 O’Neal bursts outside and looks around.   There’s no accessible adjacent roof to jump to.   SIRENS WAIL.   * ANOTHER ANGLE A75   A75 O’Neal peers over the edge at THREE APPROACHING COP CARS careening down the street. EXT. PANTHER HEADQUARTERS - STREET - DAY 76   76 Williams spots O’Neal on the roof, shotgun at his side. WILLIAMS Sniper! He fires the first shot... at O’Neal. INTERCUT: EXT. BLACK PANTHER HEADQUARTERS - ROOF - CONTINUOUS A76   A76 ACTION O’Neal ducks behind the brick facade.   Bullets scatter bits of brick and dust everywhere.   The sound of O’Neal’s comrades returning fire is heard from below.   He scuttles back to the roof entrance and ducks inside -- INT. BLACK PANTHER HEADQUARTERS - STAIRWELL - CONTINUOUS B76   B76 ACTION O’Neal starts to run down the stairs.   White, previously manning the back entrance downstairs, runs up to join his comrades in the firefight.   O’Neal hides in the shadows. He creeps downstairs past the Panthers, their muzzle flashes lighting up the room.   As O’Neal makes his way to the first floor, we REMAIN ON the second floor and TRACK INTO the room, UP TO the window.   White and Harmon crouch on the floor as wood splinters and glass breaks around them.   Ten cops are visible outside the window.  Rev. mm/dd/yy (Tan)   64.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 223
    },
    {
      "scene_number": 8,
      "slugline": "EXT. PANTHER HEADQUARTERS - BACK ENTRANCE - CONTINUOUS 77   77 ACTION O’Neal emerges, tosses his shotgun, and speed-walks nonchalantly along the back street. EXT. PANTHER HQ - FRONT - DAY (LATER) 78   78 Close to twenty cops TRADE SPORADIC GUNFIRE with the Panthers, the windows of the second floor totally blown out.   A CROWD has assembled around the periphery to watch, including Deborah, Hicks, and several other Panthers who cheer their comrades on.   Deborah can’t help but think about what would have happened had she remained inside that building. INT. PANTHER HEADQUARTERS - ARMORY - CONTINUOUS ACTION A78   A78 Harmon and White take cover and fire.   As Harmon digs into a box of shells and reloads, she observes that they’re rapidly running out of ammo. White is shot in the shoulder.   * HARMON   * White! You okay?   * Her and White share a concerned glance.   * HARMON   * I’m out!   * EXT. PANTHER HEADQUARTERS - FRONT - CONTINUOUS ACTION - B78   B78 DAY White’s jacket WAVES from the blown-out window --   * CAPTAIN JAMES BYRNE (30s), white, takes a BULLHORN --   * BYRNE (on bullhorn; addressing his officers) Cease fire!   Cease fire! Goddamn   * it! Goddamn it, cease fire!   * (as the cops stop shooting) Come out with your hands up! The Panthers anxiously await for their comrades to exit the building.   After a tense beat, Harmon and White emerge, hands raised, miraculously unharmed. (CONTINUED)  Rev. mm/dd/yy (Tan)   65.",
      "characters": [],
      "action_text": "HARMON   * We’re comin’ out! We’re comin’   * out, don’t shoot!   * BYRNE   * Cease fire!   * The crowd lets out a cheer that immediately turns to screams of anguish as the two Panthers are assailed by rifle butts and boots. DEBORAH   * No!   * The bulk of the cops storm the office while the rest attempt to calm an increasingly unruly crowd, now throwing bottles and rocks.   A cop pulls one such thrower from the crowd and beats them savagely.   Winters forces his way to the front, having just shown up, mouth agape. WINTERS What the fuck happened? A cop marches towards the building with a gas can. Deborah observes the scene that’s about to unfold. Harmon is forced into the back of a police truck.   * DEBORAH They’re gonna burn it down! No...   * No! She tries to run past the blockade but Winters prevents   * her. DEBORAH   * Get off of me! Get off of me!   * INT. BLACK PANTHER HEADQUARTERS - GROUND FLOOR - C78   C78 CONTINUOUS ACTION Cops go berserk, destroying everything in sight.   A match is lit.   WOOSH.   A fireball engulfs the space as the cops run outside. EXT. BLACK PANTHER HEADQUARTERS - GROUND FLOOR - D78   D78 CONTINUOUS ACTION The crowd screams, shouts, cries angry tears.   The Panthers stare at the burning building in disbelief.   * CUT TO BLACK. CONTINUED: B78   B78 (CONTINUED)  Rev. mm/dd/yy (Tan)   66. OVER BLACK WE HEAR THE SOUND OF A METAL SLOT OPENING. FADE IN: INT. MENARD STATE PENITENTIARY - THE BOX 79   79 It’s so dark we can barely make out Fred, naked, sitting on the floor, knees to his chest. WARDEN (O.S.) It’s over. After a beat, the Warden sticks a folded piece of paper through the slot.   It takes Fred a moment to crawl over to it, as disoriented as he is.   He unfolds the paper, in his hands a news clipping:   a photograph of the scorched Panther headquarters beneath the headline “Cops Torch Terrorist Haven.”   He eyes it in disbelief, fighting back the tears welling in his eyes.   * Unconvinced, he unfolds the paper frantically and peers",
      "dialogue_count": 0,
      "word_count": 723
    },
    {
      "scene_number": 9,
      "slugline": "EXT. PAY PHONE NEAR DELI - DAY 81/80pt   81/80pt O’Neal is in the phone booth.   A duffel bag sits just outside of it. O’NEAL (on phone) Don’t tell me to fucking calm down, alright!   I was almost   * killed!   Now Fred’s in jail.   I   * did the damn job. And I’m out!   * * MITCHELL That’s not how it works -- O’NEAL ‘Fuck you mean that’s not how it   * works? Gimme one good reason why I   * don’t just book it outta here   * right now?   * MITCHELL Because, as I’ve mentioned, it’s a   * year and a half for the stolen car and five years for impersonating a federal officer. And if you run, I   * will hunt you down --   * O’NEAL   * Man, shut the fuck up.   * O’Neal slams the phone down, to Mitchell’s surprise.   * O’NEAL   * FUCK!   * RUSH (PRE-LAP)   * What do we need?   * INT. PANTHER HEADQUARTERS - POST-FIRE SECOND FLOOR - DAY 83   83 The entire floor has been burned to a crisp.   Rush, Winters, Deborah, and Hicks sort through the ruins.   When O’Neal enters, Hicks and Deborah eye him in shock. RUSH   * You the handyman. Oakland says   * rebuild immediately.   What do we   * need? O’Neal laughs. (CONTINUED)  Rev. mm/dd/yy (Tan)   68.",
      "characters": [],
      "action_text": "O’NEAL We need a Goddamn white flag,   * Bobby. You don’t see this shit?   * TWO KIDS enter from outside.   * YOUNGEST KID Goddamn.   They burnt the shit out this motherfucker. OLDEST KID Watch your mouth, man.   * (addressing the Panthers) Y’all need help? Rush shoots O’Neal a look like, “This is how we rebuild.” O’Neal scoffs as Rush digs in his pocket for a few bills. RUSH Yeah, little brother.   Run down to the store and get us a couple of   * trash cans... That’s how you   * rebuild, Comrade.   * INT. PANTHER HEADQUARTERS - SECOND FLOOR - DAY 85   85 Headquarters has been gutted to the beams and is in the process of being rebuilt by people from the community, including Rainbow Coalition members.   O’Neal finishes framing a wall and has a cluster of folks help him erect it.   Older women distribute trays of cookies and punch to the laborers. Rod Collins (the Crown Fred debated in the pool hall) enters with a contingent of Crowns in tow.   The Panthers, O’Neal especially, bristle. O’NEAL (addressing Collins) Hey! Can I help y’all?   * COLLINS Came to ask y’all that.   Got some   * bodies if you need ‘em. I know   * y’all got an army and all that but   * figured you could use some   * reserves.   * DOC   * (surprised) Right on. CONTINUED: 83   83 (CONTINUED)  Rev. mm/dd/yy (Tan)   69. A shocked O’Neal finds himself delegating repair tasks to the Crowns. O’NEAL   * Y’all know how to use a tape   * measure? This needs measuring   * right here. And then that dry wall   * right there needs to be measured   * out and flush. The rest of y’all   * can grab some of these paper rolls   * and help them with that wall.   * Right there.   * INT. FBI HQ (CHICAGO) - CARLYLE’S OFFICE - DAY 84   84   * Mitchell has joined Carlyle and Hoover at the desk.   * HOOVER   * (gesturing towards   * homicide photos)   * Los Angeles leaders Bunchy Carter   * and John Huggins. Former leaders.   * Chalk marks. All that’s left.   * (re:   surveillance   * photo)   * Our friend Mr. Cleaver, on",
      "dialogue_count": 0,
      "word_count": 2868
    },
    {
      "scene_number": 10,
      "slugline": "EXT. REG’S HOUSE - NIGHT A93   A93 Winters sits outside Reg’s trailer home.   Reg, the   * janitor from the hospital, arrives carrying a coke.   * REG Winters? The fuck you doing here?   * WINTERS ... Looking for some answers. REG   * Answers to what?   * WINTERS   * Remember I saw you not too long   * ago? At the hospital?   * REG   * Yeah.   * WINTERS   * The pigs took my man outta there --   * REG I don’t know about that.   * He starts going inside.   Winters follows him up the steps of the house. WINTERS ...I was thinking maybe you could   * ask a couple questions -- REG And fuck my money up?   Nigga, do   * you have any idea how treacherous them crackers is down there? I   * want no parts of that.   * WINTERS Reg, Reg, please man.   * REG   * Look man. I’m cold and I’m hungry.   * Now get out of my way.   * Reg steps toward the building but Winters stops him.   The   * men look one another in the eye, a confrontation brewing. WINTERS Come on, brother.   * (CONTINUED)  Rev. mm/dd/yy (Tan)   83.",
      "characters": [],
      "action_text": "REG I ain’t your brother.   Now get the   * fuck off my porch before you end up like your boy there.   * That does it.   Winters tries to stop Reg from going   * inside but Reg is stronger and angry. Reg shoves Winters   * hard to the ground, which causes the rifle previously hidden beneath his coat to fall to the ground.   Reg’s eyes grow wide.   As Winters bends down to retrieve it, Reg slams the door shut. WINTERS I just want to know what happened -   * -   Reg! Ay! Reg! I just want to   * know what happened to my friend!   * Reg!   * A frustrated Winters backs away from the door. REG (O.S.)   * (on phone)   * Across the street from the oil   * refinery. Londale and 45th. Yes.   * He’s got a gun. A big one.   * Winters scrambles down the hill.   * INT. FRED AND DEBORAH’S APARTMENT - BEDROOM - NIGHT 94   94   * Fred retrieves a cigarette and lighter from his pants.   * He’s about to spark when he notices a small journal on the floor with a collage of black, feminine, revolutionary images culled from magazines/newspapers taped to the front. He glances in the direction of the bathroom before opening the book.   He flips through it.   More collage work.   A photo of Betty Shabazz.   And then a journal entry titled:   “Are you a bad motherfucker?   Or just a bad mother?” DEBORAH (O.S.) What are you doing? That’s   * private.   * Fred looks up to discover Deborah back in the room.   * FRED You think you’re gonna be a bad   * mother? DEBORAH ...It was a question.   * CONTINUED: A93   A93 (CONTINUED)  Rev. mm/dd/yy (Tan)   84. FRED Why you gotta ask yourself then?   * DEBORAH I don’t know.   Maybe the fact that I’m bringing a child into a war zone?   These aren’t considerations you have to make.   You get to go up there and talk about dying a revolutionary death and how your body belongs to the revolution because you don’t have another   * person growing inside your body. Fred considers her point. FRED (pause) So you regret it?   * DEBORAH What? FRED Having my baby? The ",
      "dialogue_count": 0,
      "word_count": 6547
    }
  ]
}