{
  "slug": "just-mercy-2019",
  "title": "just mercy",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 16,
  "characters_count": 0,
  "characters": [],
  "total_words": 33809,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. GEORGIA STATE PRISON - VISITATION ROOM - DAY 6   6 Framed through the Plexiglas of a metal door, BRYAN STEVENSON (early-20s), eyes that never stop thinking, stands nervously in an old suit as a GUARD opens the door. He hesitates before entering the 20-foot room, stools bolted to the floor, metal mesh for walls.   It’s obvious he’s not used to being in a place like this.   As the door SLAMS behind -- INT. GEORGIA STATE PRISON - VISITATION ROOM - DAY (TWENTY 7   7 MINUTES LATER) Bryan sits, staring at a used notebook, WHISPERING his introduction to himself, preparing for what’s ahead. Then -- chains CLANGING from outside the door, the HAUNTING SOUND increases with his anxiety until -- CLANK!   The door opens and a GUARD walks in with the prisoner, HENRY DAVIS.   He looks about Bryan’s age, black, and just as worried as he is.   As Bryan looks at him, he averts his gaze. As the Guard UNLOCKS his chains, Bryan notices how weighed down Henry is -- handcuffs on his wrists, chain around his waist, shackles on his ankles. Taking off the last shackle, the Guard looks up at Bryan. GUARD You got one hour. The door CLANGS shut behind the Guard.   Bryan takes a BREATH. BRYAN Hi, Mr. Davis.   I’m Bryan. Henry finally glances at him, nods. HENRY Henry. Bryan hesitates, nerves getting the better of him before -- BRYAN I’m here to, uh... sorry.   I mean...  JUST MERCY - Rev. 4/25/19 (Tan Add'l Photog)   4B. (MORE) (CONTINUED) 8FLiX.com SCREENPLAY DATABASE FOR EDUCATIONAL USE ONLY",
      "characters": [],
      "action_text": "BRYAN (CONT'D)  I don’t really have a lot of information to tell you right now .. . HENRY (worried) Something wrong with my case? BRYAN No, no.   It’s fine.   It’s, uh -- (clears his throat) The Southern Prisoners Defense Committee sent me to tell you that they don’t have a lawyer for you yet, but they hope to soon. HENRY (confused) You not a lawyer? BRYAN Uh, no... I’m still in school, I’m just interning here for the summer. Henry doesn’t hide his disappointment. HENRY So, you can’t tell me nothin’ about my case? BRYAN Oh, um.   I am supposed to tell you that... you’re not at risk of execution any time in the next year. Henry stares.   Bryan can’t read his expression.   Henry puts his head down, lets out a long EXHALE, speaks without looking up -- HENRY Can you say that again? BRYAN (hesitant) You’re not at risk of execution any time in the next year. Henry takes a BREATH, slowly nods to himself.   When he finally looks up, he has tears in his eyes as he holds his hand out. HENRY Best news I’ve heard in a long time.  JUST MERCY - FULL YELLOW   5. CONTINUED: 7   7 (CONTINUED) 8FLiX.com SCREENPLAY DATABASE FOR EDUCATIONAL USE ONLY Bryan grips his hand, surprised as he’s pulled in for a hug. HENRY Didn’t want my wife and the kids showin’ up if I had an execution date comin’.   Now they can come visit. (sincere) Thank you. Bryan nods, more at ease.   Henry looks at him curiously. HENRY You the first person I met in two years that ain’t a inmate or a guard. (off Bryan’s surprise) How old are you? BRYAN Twenty-four. HENRY (nods) Me, too. Pre-lap:   Their LAUGHTER takes us to -- INT. GEORGIA STATE PRISON - VISITATION ROOM - DAY 8   8 The two men sit, LAUGHING, mid-conversation -- HENRY Serious, my ma made me join our church choir when I was like four. I was lead baritone all through high school. BRYAN I used to play piano for my church back home. HENRY A.M.E.? (off Bryan’s nod; playful) God is good... BRYAN (plays along) All the time.  JUST MERCY - FULL YELLOW   6. CONTIN",
      "dialogue_count": 0,
      "word_count": 6562
    },
    {
      "scene_number": 2,
      "slugline": "INT. EVA’S HOUSE - LIVING ROOM - EARLY MORNING B32   B32 Eva walks through the living room, steps over papers scattered across the floor as she enters the -- INT. DINING ROOM C32   C32 REVEAL:   Bryan at the table, surrounded by papers, bloodshot eyes, a mad scientist in the middle of his work. EVA (sarcastic) You look rested. Bryan looks up, exhausted but still energized. BRYAN I don’t think McMillian did it. INT. EVA'S HOUSE - DINING ROOM - LATER 32   32 Bryan at the table with an almost-empty box, papers sprawled around.   Eva sits beside him, drinking coffee. BRYAN They have no motive, no physical evidence, no corroborating circumstances.   The State based its entire case on the testimony of one man.   Ralph Myers. Bryan hands her a photograph of RALPH MYERS (40s), a frail, white man with burn scars across half his face and neck. BRYAN He’s been in and out of prison most his life.   When he testified, he was on trial for a different murder, which he ended up getting thirty years for. EVA Sounds like a pretty good deal. Bryan nods as he flips through a transcript, full of notes.  JUST MERCY - FULL YELLOW   30. (CONTINUED) 8FLiX.com SCREENPLAY DATABASE FOR EDUCATIONAL USE ONLY",
      "characters": [],
      "action_text": "BRYAN In his statement, he said Johnny D approached him at a gas station and forced him at gunpoint to drive to Jackson Cleaners because his arm was hurting. EVA (sarcastic) That seems logical. BRYAN When they get there, Johnny D tells him to wait in the truck while he goes inside.   Then, while he waits for his   kidnapper , instead of running, or going to the police, he drives to a liquor store for cigarettes, and then comes   back   to the crime scene. EVA Seriously? BRYAN Then he hears gunshots, goes inside, and sees the body of Ronda Morrison lying face-up on the floor and Johnny D standing over her with some older white man who he claimed was the one ‘in charge.’ EVA And where’s   that   guy?   Anyone looking for   him ? Bryan shakes his head -- exactly.   Nothing makes sense. He grabs another paper. BRYAN They have   one   other witness to back his testimony, a young black man named Bill Hooks.   Says he saw Johnny D’s lowrider truck leaving the cleaners around the time of the murder.   That’s it. Eva lays out photos of Ronda Morrison, Ralph Myers, and McMillian as she tries to wrap her mind around it.  JUST MERCY - FULL YELLOW   31. CONTINUED: 32   32 (CONTINUED) 8FLiX.com SCREENPLAY DATABASE FOR EDUCATIONAL USE ONLY EVA So, an eighteen-year-old white girl is murdered in broad daylight and the Sheriff can’t solve the crime for how long?   * BRYAN Almost a year. EVA (looks at Ralph’s photo) Then some guy charged with a different murder says he can tell them who did it   if   they give him a lower sentence.   And the guy who did it happens to be a black man from a poor community that no one would think twice about. Both can feel the energy here.   Something is horribly wrong with this conviction.   Bryan looks in the now empty box. BRYAN There’s gotta be more than this. (beat; considers) I want to set a meeting with the D.A. EVA Tommy Chapman just took over for Pearson a few months ago.   He used to be a public defender. BRYAN So maybe he’s not aligned with th",
      "dialogue_count": 0,
      "word_count": 3174
    },
    {
      "scene_number": 3,
      "slugline": "INT. WALTER’S HOUSE - LIVING ROOM - LATER 43   43 Bryan takes notes beside Darnell and John.   Walter’s immediate family crowds around, Jackie among them. JOHN You heard of Bill Hooks, right? BRYAN He testified that he saw Johnny D’s truck at the cleaners that morning. DARNELL Bill didn’t see shit.   He made the whole thing up. BRYAN How do you know? DARNELL ‘Cause I was with him.   We was workin’ at the shop together. BRYAN The morning of the murder? DARNELL Yes, sir.   We was changing the head gasket on a Camaro from eight in the morning till we closed after lunch.   He was right next to me when them sirens was goin’ off. BRYAN Why would Hooks lie? JOHN ‘Cause the snitch cut a deal with the cops.   They had ‘im locked up for burglary, and the day he gave his statement, they let ‘im out, all charges dropped. Bryan looks at Darnell, steady and calm as -- BRYAN Would you be willing to sign a statement that we could use in court? Darnell thinks long and hard.   Fear seeps in as -- DARNELL The police would see my name?  JUST MERCY - FULL YELLOW   44. (CONTINUED) 8FLiX.com SCREENPLAY DATABASE FOR EDUCATIONAL USE ONLY",
      "characters": [],
      "action_text": "BRYAN It would be in the record. Darnell looks at John and Walter’s family, scared.   Bryan sees his fear, empathizes.   A beat before -- BRYAN I know exposing yourself like this isn’t easy.   But with your testimony we can file a motion to reopen Johnny D’s case.   If we can prove Bill Hooks is lying, it might be his best chance. Bryan’s words connect, but Darnell still hesitates. Minnie grabs his hand, nods.   Darnell sees what this means to her. He looks to John, then back at Bryan.   He slowly nods, willing to cooperate, hoping he won’t regret it. EXT. EVA’S PORCH - NIGHT 44   44 Bryan sits on the porch with Eva as she drags on a cigarette. BRYAN They said it would have been better if he was out hunting somewhere, so it’d at least be possible he was guilty.   But they were all with him. Eva shakes her head, takes a drag, a beat before -- EVA I can’t imagine what it would feel like to know I was at home with my husband, and have a judge say,   no, you weren’t... your truth is wrong.  Bryan takes this in, processing everything before -- BRYAN This isn’t just about Johnny D.   * (off her look) We’re representing that whole community.  JUST MERCY - Rev. 8/31/18 (Green)   45. CONTINUED: 43   43 (CONTINUED) 8FLiX.com SCREENPLAY DATABASE FOR EDUCATIONAL USE ONLY Eva can see how deep this goes.   Silence falls, both pondering the weight of what’s ahead. EXT. ALABAMA RIVER - DAWN A45   A45 Bryan runs along the river, still processing his time with Walter’s family. INT. HOLMAN PRISON - VISITING ROOM - DAY 45   45 Bryan stands, hoping he can get Walter to engage this time, waiting as the guard UNLOCKS Walter’s cuffs and leaves the room.   Walter looks at Bryan. BRYAN I know our last meeting didn’t go the way I hoped it would, but -- WALTER You met my family. BRYAN (beat; surprised) I did. WALTER You drove down that long dirt road, crammed into my little house with all my people, and told ‘em you was gonna fight for me. (off Bryan’s stare) That means a lot. Bryan nods.   Wa",
      "dialogue_count": 0,
      "word_count": 3065
    },
    {
      "scene_number": 4,
      "slugline": "INT. EJI - BRYAN’S DESK - A NEW DAY   * INSERT:   Bit stack of client files on Bryan’s desk, see   * the names “Walter McMillian,” “Herbert Lee Richardson,”   * “Jesse Moore,” “Charlie Coleman,” “Norris Thomas,”   * “Vivian Clark” (the point is to make it clear there are   * many cases being juggled).   * INSERT:   Bryan pulls off Herbert Lee Richardson’s file   * (and a photo clipped to it) and opens it... REVEAL   * Herbert’s name here.   * TIGHT ON:   Bryan at his desk on the phone, passionate   * despite the obvious burden of the Goliath task at hand.   * BRYAN   * My client, Herbert Richardson, was   * recommended for a Medal of Valor   * for disarming a bomb, and I’m   * looking for any documentation you   * might have on that.   * JUMP CUT TO:   * SAME SCENE - LATER   * INSERT:   Bryan pulls off the Jesse Moore file and opens   * it... REVEAL Jesse’s name here.   * BRYAN   * I was told you were one of Jesse   * Moore’s foster parents years ago,   * and I’m hoping you could tell me   * what his childhood was like.   * JUMP CUT TO:   * SAME SCENE - LATER   * INSERT:   Bryan pulls off Albert Johnson’s file and opens   * it... REVEAL Albert’s name here.   * Bryan at his desk on the phone --   * BRYAN   * Charlie’s 14 years old, sir, and   * he’s been abused in that adult   * prison for the past three nights.   * He does not belong there.   * JUMP CUT TO:   *  JUST MERCY - Rev. 4/25/19 (Tan Add'l Photog)   57. 8FLiX.com SCREENPLAY DATABASE FOR EDUCATIONAL USE ONLY",
      "characters": [],
      "action_text": "SAME SCENE - LATER   * INSERT:   Bryan pulls off Vivian Clark’s file and opens   * it... REVEAL Vivian’s name here.   * BRYAN   * Vivian Clark was one of the   * teenagers who were sexually abused   * at your facility, and I’m looking   * for records on any of the staff   * who were prosecuted.   * INTERCUT WITH:   * Eva at her desk on the phone.   * EVA   * We know he attended your school   * from sixth to eighth grade and I   * was hoping we could get any school   * records you might have on file.   * JUMP CUT TO:   * SAME SCENE - LATER THE SAME DAY   * Eva at her desk on the phone.   * EVA   * Well, we got a tip that there were   * witnesses to back his alibi and   * wanted to confirm that he was   * clocked in from midnight to 8 the   * next morning.   * SAME SCENE - LATER THE SAME DAY   * Eva at her desk on the phone.   * EVA   * No, ma’am, it’s not a trick, we   * will not charge you or your family   * for anything, and we never will.   * (beat)   * No, ma’am, I’m not a lawyer, but I   * promise, your son is in very good   * hands.   *  JUST MERCY - Rev. 4/25/19 (Tan Add'l Photog)   57A. 8FLiX.com SCREENPLAY DATABASE FOR EDUCATIONAL USE ONLY",
      "dialogue_count": 0,
      "word_count": 505
    },
    {
      "scene_number": 5,
      "slugline": "INT. EJI (EQUAL JUSTICE INITIATIVE) - DAY A58   A58 BRENDA (30s, black) shakes hands with Eva and Bryan and sits across from them at a conference table, a job interview. INT. EJI - A NEW DAY B58   B58 Brenda and Eva stack the shelves with law books. Brenda’s now a part of the team as:   PRE-LAP -- The phone RINGS. INT. EJI - DAY C58   C58 The place is now a functioning, messy office.   Brenda STOPS TYPING to pick up the RINGING phone -- BRENDA Equal Justice Initiative, this is Brenda. (quick beat) Okay -- just -- one moment, ma’am. (covers phone; to Bryan) Hey, Bryan, Mrs. Coleman has called three times this morning about her grandson.   Sounds desperate. OFF Bryan’s nod -- INT. EJI - MOMENTS LATER D58   D58 Bryan sits at his desk, phone to his ear, listening to MRS. COLEMAN on the other end talking through panicked tears. MRS. COLEMAN (V.O.) (on phone)  That man was drunk again, beatin’ on my daughter so hard my grandson thought he killed her.   Charlie’s a good boy, he was only protectin’ his mama.   He did what he thought he had to do.   Now he’s in jail with all those men, and it’s not right.   He’s only thirteen years old.  Bryan empathizes with her pain, but stares at the vast stacks of paperwork that already surround him.   Carefully responds --  JUST MERCY - Rev. 4/25/19 (Tan Add'l Photog)   57B. (CONTINUED) 8FLiX.com SCREENPLAY DATABASE FOR EDUCATIONAL USE ONLY",
      "characters": [],
      "action_text": "BRYAN Mrs. Coleman, I’m so sorry about what Charlie’s going through, but our organization focuses on death penalty cases, and he doesn’t fall into that category.   We can try to find another lawyer for you... MRS. COLEMAN (V.O.) (on phone; suddenly praying)  Dear Lord, please help me find the words to lead this man to see my grandson.   Tell me what to say, Lord --  As she prays, Bryan looks at Eva and Brenda at their desks. BRYAN She’s praying. BRENDA Grandma knows what she’s doin’. EVA (nods to Brenda) Impressive. As Mrs. Coleman finishes her prayer, Bryan gives in -- BRYAN Okay, ma’am... I don’t know if I can   take   the case, but I’ll go to the jail and check on him. MRS. COLEMAN (V.O.) (on phone)  Oh, thank you, Mr. Stevenson! Thank you, Jesus.   Thank you for watchin’ over my baby boy.  Bryan can’t help but smile at her vibrant passion. INT. COUNTY JAIL - COMMON AREA - DAY E58   E58 FOLLOW TWO JAIL GUARDS THROUGH an area filled with INMATES, grown men in jumpsuits, playing cards and hanging out. TILT DOWN TO REVEAL:   The PRISONER they are escorting is just a 13-year-old boy, CHARLIE (black), so small they had to alter his jumpsuit to fit him in it.  JUST MERCY - FULL YELLOW   58. CONTINUED: D58   D58 8FLiX.com SCREENPLAY DATABASE FOR EDUCATIONAL USE ONLY",
      "dialogue_count": 0,
      "word_count": 474
    },
    {
      "scene_number": 6,
      "slugline": "INT. COUNTY JAIL - MEETING ROOM - DAY F58   F58 Bryan looks over a file, glancing up from the table as the guards usher Charlie in.   Bryan stands, shocked at   * the thin, terrified child in handcuffs that stands in front of him. As one of the guards uncuffs Charlie, he exchanges a look with Bryan of shared concern for how young and frail he is. INT. COUNTY JAIL - MEETING ROOM - MOMENTS LATER G58   G58 Bryan sits across from Charlie, who still hasn’t made eye contact, completely retreated into himself. BRYAN Charlie?   Are you okay? (off his silence) Your grandma asked me to come and see you.   I’m a lawyer.   Can you tell me how old you are? (off his silence) Charlie, can you answer me? Charlie gives nothing.   The silence is unnerving. BRYAN I know what happened was really terrible.   I’m sure you’re worried about your mom.   She’s doing okay, and she wants you to be okay, too. (off Charlie’s silence) The court wants to try you as an adult, but I don’t think you should be in here with all these men.   I want to help you, but you have to talk to me, Charlie. Charlie looks at the wall, then back down.   Still, he gives Bryan nothing.   Bryan hesitates, then slowly stands. BRYAN You mind if I sit over here? Charlie remains silent as Bryan walks carefully around the table and sits beside him, shoulder-to-shoulder. Charlie leans forward, avoiding him.   That’s when Bryan sees a DARK BLOTCH on the back of his neck.   He softens his voice.  JUST MERCY - Rev. 8/31/18 (Green)   59. (CONTINUED) 8FLiX.com SCREENPLAY DATABASE FOR EDUCATIONAL USE ONLY",
      "characters": [],
      "action_text": "BRYAN Charlie, are those bruises on your neck? Charlie scoots away from him, hiding his tears.   Bryan can tell something is terribly wrong.   He speaks very gently. BRYAN Did somebody in this jail do that to you? Charlie can’t hold it in anymore.   He looks away and begins to SOB, wipes away tears as he barely forms the words -- CHARLIE I wanna go home. Bryan’s heart breaks, as he puts his arm around him, determined to do whatever it takes to help this child -- BRYAN It’s going to be okay, Charlie. INT. JUDGE’S CHAMBERS - LATER H58   H58 JUDGE BUREN (50s, white) leans against his desk as   * Bryan’s frustration burns beneath the surface. BRYAN Your order put a thirteen-year-old   * boy in a pen of grown men, and for the past three nights they’ve been systematically raping him, and   * he’s going to carry that for the rest of his life. JUDGE BUREN   * I’m not responsible for what happens in that jail. Bryan takes a beat, can see he’s not getting through.   He shifts his tactics, searching for common humanity. BRYAN If we look away when a child is hurting, we’re all responsible, sir.   (beat) You have the authority to move him to a juvenile center right now.  JUST MERCY - Rev. 8/31/18 (Green)   60. CONTINUED: G58   G58 (MORE) (CONTINUED) 8FLiX.com SCREENPLAY DATABASE FOR EDUCATIONAL USE ONLY If you can do that, Your Honor, I can tell you without a doubt that you would be saving that boy’s life. Judge Buren looks at Bryan, his words have clearly gotten   * through.   A beat as he ponders. INT. BRYAN’S CIVIC - LATER I-58   I-58 Bryan gets into his seat and SLAMS the door, a flash of the anger he was hiding, breaking through the surface. Then, he takes a BREATH, shakes it off, and starts the car. INT. COUNTY JAIL - COMMON AREA - LATER J58   J58 Inmates continue to stroll around the area until -- From a back door, Bryan walks out, the two guards behind him.   Charlie clings to his coat, leaning into him, shields his eyes from all the faces as Bryan guides him through the",
      "dialogue_count": 0,
      "word_count": 4265
    },
    {
      "scene_number": 7,
      "slugline": "INT. EJI OFFICE - NIGHT 81   81 Eva and Brenda at the table, pore over the photocopied files. Bryan at his desk listening to the tapes on headphones -- faint VOICES bleeding through.   Something grabs his attention.   He jots a note.   Hits STOP.   REWIND.   PULLS off his headphones -- BRYAN You gotta hear this. He unplugs his headphones and hits PLAY so they can hear as RALPH’S VOICE fills the air -- RALPH (V.O.) (on tape)  I understand that, Sheriff...  BRYAN That’s Myers. RALPH (V.O.) (on tape)  That’s what I’m trying to tell you, because I’m gonna be honest, I don’t know a damn thing.  SHERIFF TATE (V.O.) (on tape)  Is that right?  BRYAN That’s Tate. RALPH (V.O.) (on tape)  Yes, sir, it’s righter than anything I’ve ever said.  SHERIFF TATE (V.O.) (on tape)  And you would take a polygraph to the fact that you do not know who killed Ronda Morrison.  RALPH (V.O.) (on tape)  That’s right, sir, I will.  JUST MERCY - FULL YELLOW   78. (CONTINUED) 8FLiX.com SCREENPLAY DATABASE FOR EDUCATIONAL USE ONLY",
      "characters": [],
      "action_text": "SHERIFF TATE (V.O.) (on tape; beat; frustrated)  And you would face the person that could testify --  RALPH (V.O.) (on tape; firm and strong)  I will face any damn body in this world on that, ‘cause it’s a stone lie.   And if you askin’ me to frame a innocent man for murder, that just ain’t somethin’ I’m willin’ to do.  Bryan STOPS the tape, looks to Brenda and Eva, stunned until -- EVA Holy shit. INT. JUDGE FOSTER’S OFFICE - DAY 82   82 Bryan and Tommy across from JUDGE FOSTER (60s), white, formidable, and commanding, finishing his lunch. BRYAN Your Honor, we’ve submitted this statement with another motion for a new trial, but all of our work so far has been without any access to the State’s files -- TOMMY Askin’ the State to furnish these broad, generalized requests is a waste of all our time and taxpayer money.   None of the requested materials are relevant to this case. BRYAN (to Tommy) Your main witness contradicting his own trial testimony seems pretty relevant to me. TOMMY Those tapes were taken from a completely different investigation!  JUST MERCY - FULL YELLOW   79. CONTINUED: 81   81 (CONTINUED) 8FLiX.com SCREENPLAY DATABASE FOR EDUCATIONAL USE ONLY BRYAN (looks to the judge) This is about whether or not the State withheld critical exculpatory evidence, which would require a new trial.   Brady vs. Maryland entitles us to see   * everything else they have. OFF Bryan’s charged stare -- INT. EJI OFFICE - DAY A83   A83 Bryan and Brenda walk in with TWO BOXES in hand.   Eva takes them from Brenda and stacks them in the conference room with   MORE BOXES -- they won the motion. INT. EJI OFFICE - LATE NIGHT 83   83 Brenda writes labels on yellow stickies, cataloging a vast inventory of new evidence.   Eva pulls a stack of files from a box, hands it to her. Bryan FLIPS through a THICK, RED BINDER.   He finds something. BRYAN (reads) Walter McMillian, admitted to Holman Prison’s death row on August 1, 1987, over a year before his trial.   Signed by the warden. They",
      "dialogue_count": 0,
      "word_count": 1685
    },
    {
      "scene_number": 8,
      "slugline": "INT. HOLDING ROOM - LATER 92   92 Electric clippers BUZZ through Herbert’s hair.   A GUARD mans the clippers, shaving off everything. INT. HOLMAN PRISON - WITNESS ROOM - LATER 93   93 Jeremy and a CHAMBER GUARD set up folding chairs in the small witness execution room. Jeremy looks THROUGH the viewing window to see another GUARD checking the straps on the yellow electric chair. CHAMBER GUARD (off Jeremy’s nerves) First time in the chamber, huh? JEREMY Yeah. CHAMBER GUARD (matter-of-fact) Don’t think too much, or you’ll lose your shit. Jeremy nods, tries to be strong as he unfolds another chair. INT. HALLWAY/EXECUTION WAITING CELL - LATER 94   94 A FEMALE GUARD leads Bryan into a holding cell to find Herbert sitting alone, all his hair and eyebrows are completely shaved off. As the Guard enters, Herbert looks up, shaken and humiliated. FEMALE GUARD Need anything, Mr. Richardson? HERBERT You still gonna play my song? FEMALE GUARD We got it cued up and ready. HERBERT Thank you. She leaves.   Herbert shakes his head as Bryan approaches.  JUST MERCY - FULL YELLOW   86. (CONTINUED) 8FLiX.com SCREENPLAY DATABASE FOR EDUCATIONAL USE ONLY",
      "characters": [],
      "action_text": "HERBERT This been a strange day... More p- people ask how they can help me today than ever asked in my whole life. He looks at Bryan, seemingly for the first time. HERBERT Do I look funny?   I didn’t know they was gonna s-s-shave off everything. BRYAN (beat; tender) You look fine. Bryan sits down beside Herbert.   Remains calm for him. HERBERT Most people d-don’t get to think all day about it bein’ their last day alive. (beat) It’s different than Nam... least I had a chance there. BRYAN (beat; finds the words) I’m sorry, Herbert. Herbert looks at him, nothing but gratitude in his eyes. HERBERT You the only one that c-cared enough to fight for me. The statement hits Bryan hard, fighting back his emotions as -- HERBERT I t-told the Army to send my flag to you, if that’s okay. BRYAN I’d be honored. Herbert smiles through his pain.   Then, a scared beat before -- HERBERT Can you pray with me?  JUST MERCY - FULL YELLOW   87. CONTINUED: 94   94 (CONTINUED) 8FLiX.com SCREENPLAY DATABASE FOR EDUCATIONAL USE ONLY BRYAN (beat) Of course. Herbert nods his thanks, letting go of his fear for just a moment as they bow their heads. INT. HOLMAN PRISON - CONTROL ROOM - CONTINUOUS ACTION 95   95 The Female Guard enters, nods to the CONTROL ROOM GUARD. FEMALE GUARD They’re ready. He turns, PUSHES PLAY on a small boombox aimed at the intercom microphone as -- INT. WALTER’S CELL - CONTINUOUS ACTION 96   96 Walter sits on the floor, silent as ELLA FITZGERALD’S version of “OLD RUGGED CROSS” begins to play over the P.A. SYSTEM. INT. EXECUTION HALLWAY - CONTINUOUS ACTION 97   97 “Old Rugged Cross” echoes through the empty hallway as -- The cell door opens.   Herbert steps out, handcuffed, led by the WARDEN, followed by Jeremy, the older guard, and the PRIEST.   They begin the long walk to the chamber. INT. DEATH ROW WALKWAY/WALTER’S CELL - CONTINUOUS ACTION 98   98 “Old Rugged Cross” continues.   EVERY DEATH ROW PRISONER stands at the bars of their cells, all SILENT, WAITING SHADOWS. INSIDE",
      "dialogue_count": 0,
      "word_count": 1141
    },
    {
      "scene_number": 9,
      "slugline": "INT. WITNESS ROOM - WINDOW - NIGHT 108   108 Bryan can barely watch, the ghostly IMAGE of Herbert’s pulsing body reflected dimly in the glass as -- INT. WALTER’S CELL - NIGHT 109   109 Walter stops clanging his cup, staring in Herbert’s direction, feeling the loss of his friend. EXT./INT. HOLMAN PARKING LOT/BRYAN’S CIVIC - NIGHT 110   110 Eva sits on the hood of her car, numbing her stress with a cigarette.   A few GUARDS and REPORTERS walk to their cars. Eva finishes her smoke as, across the parking lot, Bryan slowly approaches.   She can clearly see his shock and pain from what he just witnessed.   A long beat, then -- EVA You okay? Bryan shakes his head, can’t even speak.   He opens the passenger door and gets in.   Worry etched across her face, Eva gets into the driver’s seat and sits beside him. She doesn’t start the car.   Sitting in a long silence until -- Bryan tries to say something, but words don’t come, caught in his throat, the emotion hits him suddenly like a storm, a dam breaking as all of his clients’ pain pours out of him. Eva burns with compassion for this man who has become her friend.   She reaches over and wraps her arm around him, allowing him to let it out. INT. EJI OFFICE - LATE NIGHT 111   111 Bryan sits alone at his desk, back to doing the one thing he knows -- disappearing into his work, poring over transcripts and files from Walter’s case. INSERT PAPERWORK -- Walter’s mug shot (OR A PHOTO FROM   * HIS FAMILY PHOTOS), or paper that says Walter McMillian   * (something that makes it clear he’s looking at Walter’s   * case.)   *  JUST MERCY - Rev. 4/25/19 (Tan Add'l Photog)   91. (CONTINUED) 8FLiX.com SCREENPLAY DATABASE FOR EDUCATIONAL USE ONLY",
      "characters": [],
      "action_text": "As he reads, something grabs his attention.   He stands, grabs the THICK, RED BINDER, the intake log from Holman Prison.   He DROPS it on the table and FLIPS through pages. He stops at a page.   Whatever he’s looking at, it’s big.  JUST MERCY - Rev. 4/25/19 (Tan Add'l Photog)   91A. CONTINUED: 111   111 8FLiX.com SCREENPLAY DATABASE FOR EDUCATIONAL USE ONLY",
      "dialogue_count": 0,
      "word_count": 363
    },
    {
      "scene_number": 10,
      "slugline": "INT. ST. CLAIR CORRECTIONAL - VISITING ROOM - DAY 112   112 BOOM!   The door SLAMS behind Ralph Myers. Bryan sits at the table in the EMPTY ROOM, he doesn’t stand or have the space for any bullshit.   As Ralph approaches -- RALPH Hope this important news of yours comes with somethin’ to eat, ‘cause I’m starvin’. BRYAN (calm but firm) Sit down, Mr. Myers. Ralph sees how serious he is, takes his seat. RALPH You was a lot nicer last time. BRYAN That was before I saw my friend executed. Ralph is sobered.   News of executions hit every prisoner hard. RALPH You knew that guy? Bryan nods, lets this sit for a moment before continuing. BRYAN I heard the recording of the first statement you made on June 3.   The one they didn’t present in court. (off Ralph’s surprise) You told the Sheriff you didn’t know anything about Johnny D or the murder.   You told him you didn’t want to frame an innocent man.   Do you remember saying that? Ralph looks at him like a deer in headlights. Speechless.  JUST MERCY - FULL YELLOW   92. (CONTINUED) 8FLiX.com SCREENPLAY DATABASE FOR EDUCATIONAL USE ONLY",
      "characters": [],
      "action_text": "BRYAN What I’m wondering, is how you went from knowing nothing about the murder on June third, to becoming the State’s key witness three months later?   What changed your mind? After a beat, Bryan grabs the THICK, RED BINDER and places it on the table, begins to flip through it.   Ralph watches, can’t help his curiosity. RALPH What’s that? BRYAN The intake log for Holman Prison. Ralph watches him stop at a page. BRYAN On August 1, 1987, Sheriff Tate transferred two inmates from county jail to death row.   Walter McMillian... He spins the binder around to face Ralph. BRYAN ... and you. Ralph’s face drops, his nerves firing.   Bryan looks at him with compassion, aware of the pain he’s been put through. BRYAN Did they move you to death row because you didn’t want to testify against him? Something shifts in Ralph, suddenly looks like a child. The fear in his eyes makes it obvious the answer is yes. BRYAN They executed Wayne Ritter just a few weeks after you got there. Isn’t that right? Ralph looks at him, his wall beginning to crack as he nods. BRYAN I was in the witness room when they killed Herbert Richardson Thursday night.  JUST MERCY - FULL YELLOW   93. CONTINUED: 112   112 (MORE)   (CONTINUED) 8FLiX.com SCREENPLAY DATABASE FOR EDUCATIONAL USE ONLY It was the worst thing I’ve ever experienced. (beat; caring) I’m sure Ritter’s execution wasn’t easy for you, either. Ralph can see how much it affected him.   Their shared experience breaks down his defense.   He shifts in his seat, remembering, finally feels safe enough to speak. RALPH They put me in the cell closest to the kill room... (long beat; fidgets) Middle of the night, everybody started screamin’ and bangin’ on the bars.   And then... then come the smell of his skin burnin’. Ralph points to the burn scar on his face. RALPH I know that smell. BRYAN (careful) Can I ask what happened? RALPH I was sleepin’ in my foster mom’s basement and her heater blowed up, catched my PJs on fire.   I screamed for two minutes st",
      "dialogue_count": 0,
      "word_count": 889
    },
    {
      "scene_number": 11,
      "slugline": "EXT. BALDWIN COUNTY COURTHOUSE - MORNING A113   A113 SUPERIMPOSE:   APRIL 16, 1992 ALICE BROOKS (REPORTER) speaks into the camera in front of the courthouse.   PEOPLE (black and white) file in behind her. ALICE BROOKS The tension is high this morning here at the Baldwin County Courthouse, where a hearing is being held to see if the man convicted of killing Ronda Morrison deserves a new trial. Miss Morrison was only eighteen years old when she was murdered at   * Jackson Cleaners in Monroeville, Alabama.   Many have taken the two- hour drive here from Monroeville to show their support. (beat) Extra security precautions were implemented due to the highly emotional nature of this case. BLACK FOLK stream out of a church bus.   Minnie, John, Jackie, and Evelyn walk from their car, dressed in Sunday best.   Bryan, Eva, and Brenda exit his car and head in, focused. INT. BALDWIN COUNTY COURTHOUSE - LOBBY - MOMENTS LATER B113   B113 A CROWD (all black) files through a metal detector, 2 GUARDS standing by.   Another GUARD holds a German shepherd as it BARKS at a WOMAN who jumps back in fear. Sheriff Tate enters the courtroom with Tommy and his ASSISTANT ATTORNEY. INT./EXT. HOLDING CELL - MOMENTS LATER C113   C113 Walter exits the holding cell in leg irons and a waist chain, guided by Jeremy and ANOTHER GUARD. INT. BALDWIN COUNTY COURTHOUSE - HALL - LATER 113   113 FOLLOW Walter, Jeremy, and the other guard down a hallway.  JUST MERCY - Rev. 4/25/19 (Tan Add'l Photog)   96. (CONTINUED) 8FLiX.com SCREENPLAY DATABASE FOR EDUCATIONAL USE ONLY",
      "characters": [],
      "action_text": "ALICE BROOKS (V.O.)  Ronda Morrison’s parents said they have no doubt Mr. McMillian is the man responsible for the murder of their daughter.  JUST MERCY - Rev. 4/25/19 (Tan Add'l Photog)   96A. CONTINUED: 113   113 (MORE) (CONTINUED) 8FLiX.com SCREENPLAY DATABASE FOR EDUCATIONAL USE ONLY But members of McMillian’s family claim they have the wrong man. Much of today’s hearing is hinging on the testimony of Ralph Myers, a   *  convicted felon, who was the key   *  witness against McMillian in the original trial.  Walter tries to keep himself together as they push through the door, walk into -- INT. BALDWIN COUNTY COURTHOUSE - COURTROOM - DAY 114   114 Everyone turns to Walter as he tries to stand tall, keep his dignity, but fear is evident in his eyes. The place is PACKED WITH PEOPLE (WHITE and BLACK). At the front, Tommy and his assistant attorney sit at the prosecution table, Sheriff Tate in the seat behind them. Bryan’s at the defense table, nervously checking his notes. Walter’s eyes land on Minnie in the first row.   Eva and Brenda sit beside her, John and Jackie on her other side. Behind them, all of Walter’s FRIENDS AND FAMILY, giving him strength with their nods and smiles. Walter shares a look with Minnie laced with love and pain.   Then he nods to John, who sits up tall, trying to be strong. He reaches the defense table.   As Jeremy unlocks Walter’s cuffs, Bryan exchanges a reassuring look with him, though it’s impossible for either man to hide his nerves. INT. BALDWIN COUNTY COURTHOUSE - COURTROOM - MOMENTS 115   115 LATER Jeremy takes his place in the back as Judge Foster, stern and commanding in his robe, looks up from his seat in front. JUDGE FOSTER What we’ll be talking about today   * is obviously an emotional issue.   * And if any of y’all don’t think you can maintain a reasonable degree of decorum, then I would ask you to leave now. (beat) All right, if we are ready, then, we will proceed.   Mr. Stevenson?  JUST MERCY - Rev. 9/14/18 (Goldenrod)   97.",
      "dialogue_count": 0,
      "word_count": 2871
    },
    {
      "scene_number": 12,
      "slugline": "INT. BRYAN’S RENTAL - NIGHT 126   126 Bryan sits at the keyboard, taking a rare break from his work to play a slow, JAZZY RIFF.   His spirit lifts with every note. PUSH IN ON a new addition to his bookshelf -- beside a photo of Herbert as a young soldier:   an American flag, folded in a triangle, in a display case that reads, “In loving memory of, Herbert Richardson, United States Army, Vietnam Veteran.” EXT. BALDWIN COUNTY COURTHOUSE - DAY 127   127 SUPERIMPOSE:   ONE MONTH LATER Full parking lot, but most of the people are already inside.   JUDGE FOSTER (V.O.) (pre-lap) Upon the reading of my decision, I expect the rules of decorum within this courtroom to be upheld... INT. BALDWIN COUNTY COURTROOM - CONTINUOUS ACTION 128   128 EVERYONE is seated.   Walter beside Bryan, nervous. Eva and Brenda are with Walter’s family behind them. John is too nervous to look, lowers his head, arms on his knees.   Minnie tenderly rubs his back with her hand. Tommy sits with his assistant, Tate behind them.   Judge Foster, sitting at the bench, continues reading his decision --   JUDGE FOSTER Ralph Myers took the stand before this court, swore to tell the truth, and proceeded to recant most, if not all, of the relevant portions of his testimony at trial.   Clearly, he has either perjured himself at trial or in front of this court. (beat) After careful review, it is this court’s opinion that conclusive evidence has   not   been provided that Ralph Myers perjured himself at the original trial, and that pressure put on him since his trial testimony could tend to discredit his recantation.  JUST MERCY - FULL YELLOW   108. (CONTINUED) 8FLiX.com SCREENPLAY DATABASE FOR EDUCATIONAL USE ONLY",
      "characters": [],
      "action_text": "A MURMUR from among Walter’s friends and family. JUDGE FOSTER Therefore it is ordered, adjudged, and decreed that the trial testimony of Ralph Myers is not found to have been perjured testimony, and no new trial shall be granted at this time.   Walter McMillian shall be returned to Holman Correctional Facility where he is to face death by electrocution. A WAVE OF DESPAIR sweeps through Walter’s family and friends.   Walter puts his head down, Bryan puts his hand on his back, exchanges a devastated look with Eva. Behind them, John suddenly STANDS with tears in his eyes -- JOHN You can’t do this to us again, Judge. JUDGE FOSTER (beat; firm) Sit down, young man. John shakes his head, more broken than defiant.   He looks from the Judge to Walter, quivering with emotion. JOHN That’s my dad, sir.   He ain’t done nothin’ wrong. A hint of empathy flashes over Judge FOSTER before -- JUDGE FOSTER Sit down right now, or you’ll be arrested in contempt of court. Bryan stands, tries to manage the situation. BRYAN Your Honor, please give us a minute. WALTER (firm) Listen to the judge, son. Minnie pulls on John’s arm to sit, but he pulls away, the situation quickly escalating.  JUST MERCY - FULL YELLOW   109. CONTINUED: 128   128 (CONTINUED) 8FLiX.com SCREENPLAY DATABASE FOR EDUCATIONAL USE ONLY JUDGE FOSTER I won’t say it again.   Sit down. John stares at JUDGE FOSTER, body trembling, tears streaming, but unable to move.   He shakes his head, totally broken. JOHN Not if you gonna kill my dad for no reason... WALTER That’s enough, Johnny. Bryan sees the Judge nod to TWO OFFICERS.   John doesn’t stop. BRYAN Judge, please.   Let me deal with this. A GUARD steps up to Bryan, blocks him from moving. Behind him, Jeremy and the other Holman guard move toward Walter. JOHN You killin’ our family, sir. Walter sees the Officers approaching John. WALTER Shut your mouth and sit down, boy! John looks right at his dad, shakes his head, so broken it’s the only thing he can do as -- OFFICER #1 gra",
      "dialogue_count": 0,
      "word_count": 1171
    },
    {
      "scene_number": 13,
      "slugline": "INT. DEATH ROW - STAIRS - DAY 131   131 TWO GUARDS run towards them -- INT. ANTHONY’S CELL, THROUGH THE DOOR - DAY A132   A132 THROUGH the door.   Anthony shouts through his door slot -- ANTHONY HEY!   WHAT THE HELL’S GOIN’ ON? INMATES up and down the row begin to CALL OUT TO WALTER -- INT. WALTER’S CELL/DEATH ROW - DAY 132   132 As Walter FLAILS on the floor -- Jeremy rushes down, pinning Walter to the ground with the second guard as he lets out an ANGUISHED SCREAM. END ON Walter, level with the floor, uncomfortably close. INT. WALTER’S CELL/DEATH ROW - LATER 133   133 WIDE SHOT, OUTSIDE LOOKING IN -- Empty.   Then we see -- Jeremy cleans up the aftermath of the struggle, picks up some books and pens and puts them back on Walter’s desk. He stops suddenly, eyes on the floor, staring at something we can’t see.   He bends down to pick it up as -- INT. SOLITARY CONFINEMENT - LATER 134   134 A small, empty cell.   No bed, no window.   Walter sits, back against the wall.   He stares ahead.   Lost.   Then -- The slot in the door SLIDES open.   Walter looks up to see Jeremy looking at him through the small window. A beat before -- he slides something through the slot. Jeremy gives him a nod and walks away.   Walter hesitates, then stands, walks to the door, and reaches into the slot to find -- The family photos Minnie gave him long ago, faded with age.  JUST MERCY - FULL YELLOW   112. 8FLiX.com SCREENPLAY DATABASE FOR EDUCATIONAL USE ONLY",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 266
    },
    {
      "scene_number": 14,
      "slugline": "INT. SOLITARY CONFINEMENT - MOMENTS LATER 135   135 Walter sits on the floor again, flipping through the photos one-by-one until -- He reaches the picture of himself with John.   Suddenly, his anger fades, replaced by tears fighting to break free. He turns the photo over to see in his wife’s handwriting -- “This is you.   Love, Minnie.” Walter stares at the words for a long beat, wondering if he will ever be able to believe them again. INT. BRYAN’S RENTAL - NIGHT 136   136 Bryan lies in bed, wide awake, his brain spinning out. He looks at the clock -- 2:23 AM.   No point trying to sleep. He sits up, might as well get some work done -- INT. BRYAN’S RENTAL - MOMENTS LATER 137   137 Bryan sits at a small table, covered in papers and files. He tries to work, but he can’t get his mind off the frustration of Walter’s case.   He rests his foot on the table, leans back, covers his face, draws a long, frustrated BREATH. Then BOOM!   He suddenly KICKS the table, a brief but shocking burst of anger, spraying a few stacks of files to the floor. He sits there another beat, still, broken, silent.   Then, he stands and starts to methodically clean the mess up. EXT. ALABAMA RIVER - LATER 138   138 Bryan sits with Eva on a bench overlooking the wide, flowing river.   In the distance, a large dinner boat,   The Harriet , a “historical” recreation of the riverboats used during the time of slavery. ADD SHOT OF BRIE WALKING UP AND SITTING BESIDE BRYAN.   * Bryan watches the boat move slowly toward them.   Then --  JUST MERCY - Rev. 4/25/19 (Tan Add'l Photog)   113. (CONTINUED) 8FLiX.com SCREENPLAY DATABASE FOR EDUCATIONAL USE ONLY",
      "characters": [],
      "action_text": "BRYAN Nobody wants to remember that this is where thousands of enslaved people were shipped in and paraded up the street to be sold.   Ten miles from here, black people were pulled from their homes and lynched and nobody talks about it. (beat) You can talk about the civil rights movement, but only the good parts.   Can’t talk about schools becoming as segregated now as they were in the ‘50s.   Can’t talk about one out of every three black men ending up in prison.   Can’t talk about the fact that nobody ever apologized, or even acknowledged that they did something wrong. Bryan stops here, the facts of the past threatening to overwhelm.   Eva can see his pain, his eyes tight before -- BRYAN And now this   black boy   from Delaware is walking into their courtrooms, expecting them to admit they convicted an innocent black man. (looks off; beat) I promised that whole community I’d bring him home.   * * Bryan shakes his head, looks off, tears welling.   * BRYAN How was I so naive to think we could ever change anything? Bryan closes his eyes.   Eva looks at him with compassion.   *  JUST MERCY - Rev. 4/25/19 (Tan Add'l Photog)   114. CONTINUED: 138   138 (CONTINUED) 8FLiX.com SCREENPLAY DATABASE FOR EDUCATIONAL USE ONLY EVA   * I’ve heard a lot of lawyers say   * it’s never a good idea to get too close to your clients.   Distance is healthy. (beat) But working with you showed me that’s bullshit.   You choose to get close to every one of them, and you love them like family. And when your family is hurting, so are you... (beat)   * There’s no way I could ever fully   * understand what you’re going   * through.   But I’m pretty sure you   * mean a lot more to this community   * than you think.   * Bryan thinks about that for a moment, watching   The Harriet   continue across the river.   * * INT. CHURCH - DAY A139   A139 A vibrant GOSPEL CHOIR lifts their voices to God in a church filled with BELIEVERS. Bryan stands among them, watching his people SING to a Higher Power.   He",
      "dialogue_count": 0,
      "word_count": 2462
    },
    {
      "scene_number": 15,
      "slugline": "INT. BAR (MONROEVILLE) - CONTINUOUS ACTION 148   148 Sheriff Tate drinks with some off-duty COPS, all watching -- ON TV:   Ed Bradley sits with Ralph Myers, in his prison uniform. RALPH (V.O.) (on TV)  I told them I had seen a young girl laying on the floor with her mouth open.   Johnny D standing over her.  ED BRADLEY (V.O.) (on TV)  Did he have a gun?  RALPH (V.O.) (on TV)  Yeah, I had told the court that, yeah.  ED BRADLEY (V.O.) (on TV)  Was it true?  TIGHT ON Tate, fuming as -- RALPH (V.O.) (on TV)  No, sir, not at all.   Nowhere near true.  ED BRADLEY (V.O.)  Why should anyone believe you now? When you’re taking back what you said at the trial, under oath.  RALPH (V.O.) (on TV)  Well, it’s like this.   I don’t know the words for that, but I can tell you this much... Right is right, and wrong is wrong.   And for a man to straighten his own life out, he must tell the truth. He must try to do what is right, and that’s what I’m tryin’ to do.  JUST MERCY - FULL YELLOW   123. 8FLiX.com SCREENPLAY DATABASE FOR EDUCATIONAL USE ONLY",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 198
    },
    {
      "scene_number": 16,
      "slugline": "INT. TOMMY CHAPMAN’S HOUSE - LIVING ROOM - CONTINUOUS 149   149 ACTION Tommy sits with his WIFE and TWO YOUNG SONS (8, 10), eating and watching the TV -- ON TV:   Tommy responds to a question from Ed Bradley. ED BRADLEY (V.O.) (on TV)  How would you characterize Ralph Myers?  TOMMY (V.O.) (on TV)  Ralph’s about as low as you can get.   He’s a scum.  ED BRADLEY (V.O.) (on TV)  A liar?  TOMMY (V.O.) (on TV)  Yes, sir, I’d characterize him a liar, particularly now.  Cut to Bryan, mid-interview: BRYAN (V.O.) (on TV)  I’m sure Ralph Myers would agree that any threat he was under in prison, is nothing like the threat he’s under now, having recanted his testimony and opened himself back up to perjury charges, to capital murder charges.   What Myers has done is take a pretty radical risk.  TOMMY (V.O.) (on TV)  What’s wrong with our criminal justice system is the fact that, um, people want to come back sometime and second-guess juries. Uh, I don’t think there been any law enforcement misconduct in this case, I don’t think anyone’s proved it.  JUST MERCY - FULL YELLOW   124. (CONTINUED) 8FLiX.com SCREENPLAY DATABASE FOR EDUCATIONAL USE ONLY",
      "characters": [],
      "action_text": "BRYAN (V.O.) (on TV)  The prosecutor’s job is not to obtain a conviction, it’s to achieve justice.   And one of the greatest tragedies about this case, is that somebody in Monroe County has literally gotten away with murder.  ED BRADLEY (V.O.) (on TV)  If an execution date is set for McMillian, and that day comes and it’s time for him to go to the electric chair, would you be comfortable?  TOMMY (V.O.) (on TV)  Yes... I’d be comfortable with it.  ED BRADLEY (V.O.) (on TV)  You think it’s, fair, just, he had his...  TOMMY (V.O.) (on TV)  He had his day in court.   He, uh, was tried by a jury and they heard the testimony and they believed it.  HOLD ON Tommy as he chews on his dinner, pondering his role in this story as -- OVER “60 MINUTES” AUDIO: INT. EJI OFFICE - DAY 150   150 Bryan types a motion as Eva brings a law book to his desk for reference. EXT. STATE JUDICIAL BUILDING - DAY 151   151 Bryan walks up the steps of the grand entrance, ready for court.  JUST MERCY - FULL YELLOW   125. CONTINUED: 149   149 (CONTINUED) 8FLiX.com SCREENPLAY DATABASE FOR EDUCATIONAL USE ONLY BRYAN (V.O.) (on TV)  Next we’ll be presenting our evidence to the Alabama Supreme Court, hoping they’ll see what we think is very clear, that Walter McMillian is innocent.  BACK TO TV A final shot of Walter escorted to his cell. ED BRADLEY (V.O.) (on TV)  McMillian’s fate is now in the hands of the Alabama Supreme Court, which is expected to decide soon if he’s entitled to a new trial.  EXT. EJI OFFICE - DAY (ESTABLISHING) A152   A152 SUPERIMPOSE:   3 MONTHS LATER INT. EJI OFFICE - DAY 152   152 TRACK Eva THROUGH the busy main room of the office.   She drops a file on the desk of a new, MALE LAWYER #1 (20s, black). EVA Lunch vote.   Chris’ or Martha’s?... Hands up for Chris’? MALE LAWYER #2 (20s, white) stops TYPING to raise his hand along with male lawyer #1. EVA Martha’s? Brenda raises her hand, along with FEMALE LAWYER (20s, black), standing at the copy machine spewing out pages. EVA Bryan!  ",
      "dialogue_count": 0,
      "word_count": 4718
    }
  ]
}