{
  "slug": "kevin-can-f-k-himself-101-living-the-dream-2021",
  "title": "kevin can f k himself 101 living the dream",
  "genre": "thriller",
  "format": "series",
  "scenes_count": 7,
  "characters_count": 0,
  "characters": [],
  "total_words": 7406,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. STREET - NIGHT - 3C Kevin and Allison are walking down a tree-lined, backlot street with hot dogs. Though Allison’s isn’t eaten at all. KEVIN I’d hold your hand right now, but I have this condition where they permanently sweat around you. Allison smiles and grabs his hand anyways.  BACK TO: EXT. WORCESTER STREET - NIGHT - 1C Allison smiles a little to herself, then it fades. She hugs her coat closer to her. ALLISON (O.S.) Most people just drift off and wake up with one less tumor or appendix or leg. But some people feel every slice. She goes into a liquor store. BACK TO:  EXT. STREET - NIGHT - 3C Allison and Kevin, still holding hands. A car moseys past them and a GUY leans out of the driver’s side window. GUY (to Allison) DAT ASS. And the car speeds off. Kevin immediately takes off after it. KEVIN HEY DAT’S NOT YOUR ASS TO APPRECIATE, PAL! But he’s slow and has to stop. He throws the remainder of his hotdog in the direction of the retreating car. KEVIN (CONT’D) He got the message.  10.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 188
    },
    {
      "scene_number": 2,
      "slugline": "INT. KEVIN’S HOUSE - LIVING ROOM - NIGHT - 3C Allison sits in her small living room with four other WOMEN, all about her age. Snacks and wines of the lighter variety cover the coffee table. Everyone looks a little uncomfortable, and we see it’s because Kevin has wedged himself into the middle of the cramped couch between two of Allison’s friends. He throws his hands up, frustrated at the television. KEVIN He can’t seriously be giving a rose to Brandy. INT. KEVIN’S HOUSE - BEDROOM - NIGHT - 3C Allison is sleeping with an eye mask on as Kevin is jumping up and down at the end of the bed, trying to get Allison’s attention. KEVIN Sex, please! Sex, please! Allison doesn’t stir. KEVIN (CONT’D) It’s your birthday, I want sex! PETER (O.C.) (through the wall) Not how that works. BACK TO:  EXT. WORCESTER STREET - NIGHT - 1C Allison exits the liquor store with cash, a 40 oz, and a scratch off. She immediately scratches the ticket, holding her breath, but it’s worth nothing. Her shoulders sag. ALLISON (O.S.) They have hands digging around in their chest cavities or wherever... She tosses the ticket on the street, then cracks open the 40 and glugs. She keeps walking. Her final destination is elsewhere. 11.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 216
    },
    {
      "scene_number": 3,
      "slugline": "EXT. MAIN STREET - NIGHT - 1C She passes a greasy spoon diner, BEV’S, and pauses. She’s noticed a HELP WANTED sign. ALLISON (O.S.) But they’re trapped, completely immobile. Can’t even scream.  INT. DIY DUI LAW FIRM - OFFICE - NIGHT - 3C From the decorations around the room, it looks like there was a Christmas party well underway, but the room is only occupied by three people: Allison, who looks different than we’ve seen her. Professional-adjacent in a TJ Maxx suit. She stands before a buttoned-up OLDER WHITE MAN, eyes cast down. And there’s Kevin next to her, sheepish, absolutely drenched in some viscous-looking substance. It’s not totally clear what happened, but no one looks pleased. OLD WHITE DUDE Allison, I think it’s best if you don’t come to work on Monday. Or ever again. KEVIN Listen, buddy-- Kevin takes a step forward, but slips on whatever he’s covered in and grabs onto the older guy. They both fall with a SPLAT. BACK TO:  EXT. MAIN STREET - NIGHT - 1C Allison, jaw set, moves on from the diner.  INT. KEVIN’S HOUSE - BEDROOM - NIGHT - 3C Kevin and Allison kiss on their bed. Kevin is wearing a shirt and boxers. Allison looks like a goddamn goddess in whatever she’s wearing. BACK TO:  12.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 217
    },
    {
      "scene_number": 4,
      "slugline": "EXT. WORCESTER STREET - NIGHT - 1C Allison walks the dicey streets of the neighborhood. ALLISON (O.S.) I didn’t feel anything when I was under. Worcester RESIDENTS are hanging out idly on their stoops, staring at Allison as she passes. She doesn’t look like she belongs here, but she’s also not intimidated by the neighborhood. She pulls out her cell phone and turns it OFF. CUT TO:  INT. KEVIN’S HOUSE - LIVING ROOM - DAY - 3C Allison and Kevin are standing in their living room, mid- fight, as two COPS leave, shaking their heads.  ALLISON (O.S.) But I kind of think that the one in a thousand is lucky.  KEVIN --I’m not tracking you. At least not anymore than the government is. But the GPS said you were on the highway towards Philly. Of course I called the cops! INT. KEVIN’S HOUSE - BEDROOM - NIGHT - 3C Kevin is on top of Allison in bed. T-shirt still on. INT. KEVIN’S HOUSE - LIVING ROOM - NIGHT - 3C Kevin and Allison sit in front of the television. The coffee table is once again covered in snacks and chilled wines. But Kevin has the couch to himself. Allison sits alone to the side.  ALLISON (O.S.) I mean, at least they’re aware.  KEVIN No! You can’t give her a rose, she has a nanny.  13.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 226
    },
    {
      "scene_number": 5,
      "slugline": "INT. KEVIN’S HOUSE - BEDROOM - NIGHT - 3C Kevin rolls off of Allison, finished and breathing hard. Shirt still on. Shirt always on. KEVIN Seven and a half out of ten stars.  EXT. WORCESTER STREET - NIGHT - 1C Allison is musing to a Casey Affleck-looking guy on the corner, MARCUS. ALLISON The rest of us? We just sleep. Completely oblivious of what’s being taken from us. Marcus looks at her like she’s a long division problem. MARCUS This numbs shit, but not like that. Allison stares at him a beat, tired. She low-key hands him the cash and gets a small bag of cocaine in return. She wets her pinky, dips it in the bag and spreads it across her gums. MARCUS (CONT’D) Bitch, not here. ALLISON Shut the fuck up, Marcus. She pockets the bag and walks away. EXT. KEVIN’S HOUSE - NIGHT - 1C Allison ascends the stairs to her row home. A few yards away next door, a woman (30s, big hair, adorned in bright colors) smokes on her front stoop. This is PATTY O’SULLIVAN. They barely make eye contact as Allison passes. PATTY Hey. ALLISON Hey. Allison takes a beat. She licks her gums and heads inside.  END OF ACT ONE  14.",
      "characters": [],
      "action_text": "ACT TWO  INT. KEVIN’S HOUSE - BEDROOM - NIGHT - 3C Kevin sits on the edge of the bed, getting undressed. Though his version of undressed is boxers, gray t-shirt, and socks. KEVIN I’m just saying, you could have picked up the case of beer while you were out. Allison comes out ready for bed, still looking gorgeous. She probably has lip gloss on. ALLISON I picked up the first case of beer that you stole. This is now your job. KEVIN Think I can get worker’s comp for this, too? Allison CHUCKLES at his joke. She passes a rough hole in the plaster. ALLISON What’s this? KEVIN (by way of explanation) Sports Center just keeps airing highlights from the last Super Bowl. I was channeling my frustration in a healthy way.  (beat)  Besides, that’s a great hole. Clean. Means I’m buff. She gives him a look. ALLISON This place is definitely made of crate paper. They climb into bed and share a perfunctory kiss. Allison moves to turn off the light but Kevin stops her. KEVIN Hey. I was thinking...  15. He raises his eyebrows. Allison hesitates. ALLISON Now? KEVIN You are ovulating. ALLISON I am? How do you know that? KEVIN I talked to your gyno and she told me what your cycle is. ALLISON That’s supposed to be confidential. KEVIN Why wouldn’t you want me to know? ALLISON It’s weird. KEVIN So now it’s weird for a man to know what time of the month to have the kitchen stocked with Mallowmars? ALLISON You always have the kitchen stocked with Mallowmars. And I don’t eat them. KEVIN It’s the thought that counts. Besides, if it were up to you to figure this stuff out, we’d never get pregnant. You’re not great with numbers. ALLISON I did the books for DIY DUI. Kevin gives her a LOOK. ALLISON (CONT’D) It’s still good math if the numbers are supposed to be fudged. He smiles and kisses her. Kevin gets on top of her, shirt still on, and fumbles for the bedside light. He turns it OFF.  CUT TO BLACK 16.",
      "dialogue_count": 0,
      "word_count": 560
    },
    {
      "scene_number": 6,
      "slugline": "INT. KEVIN’S HOUSE - BATHROOM - NIGHT - 1C A light switch flicks ON, illuminating a small bathroom. Allison stands in front of the mirror and tames her sex hair. As she fixes herself, she begins to examine other parts of her body, picking at problem areas that don’t seem to exist. She then turns to the side, arching her back in, to create the illusion of a full stomach. Or, more accurately, a full uterus. She puts a hand on her distended mid-section and considers it. ALLISON No fucking way. Allison bends down and puts her entire arm into the cabinet under the sink, groping. She emerges with a pack of birth control pills. She pops one out, and swigs it down in a gulp of water from the faucet. She then replaces the pack in the back of the cabinet. This is not her first rodeo.  INT. KEVIN’S HOUSE - LIVING ROOM - DAY - 3C Kevin and Neil sit in their usual spots on the couch in front of the TV, this time with Patty (the woman from the next stoop over) on a nearby chair. KEVIN Six out of ten stars. Would not bang. NEIL Are you kidding? She looks like a hot White Walker. KEVIN I’m not about used goods. Hard pass on Morning Joe’s been-there-done- that coffee grounds. NEIL That’s a good point. You always make the best points. PATTY And whether or not Mika would ever touch you is no part of this game? When Patty talks, it’s in the same accent. More pronounced, if possible.  17.",
      "characters": [],
      "action_text": "KEVIN I’m a consistent over-performer. Allison comes down the stairs in workout clothes. PATTY Not arguing. ALLISON (to Kevin) Have you apologized to Clyde yet? KEVIN Yup. ALLISON Then why are there more garbage bags on the lawn? KEVIN I didn’t say he accepted the apology. ALLISON So not only is he refusing to pick up our trash, but he’s now throwing other people’s crap on our lawn? Kevin, we’re gonna get fined. KEVIN I’ll figure it out, don’t you worry. ALLISON Please, please just buy him a new case of beer. KEVIN Roger that. ALLISON Thank you. She picks up her purse and a mat. ALLISON (CONT’D) Okay, I’m going to yoga. KEVIN Gotta keep it tight. NEIL Amen.  18. Patty looks the two men up and down. PATTY I’ve never seen anything looser in my entire life. KEVIN You’re so shrill. You need a man in your life to keep you in check. (beat, nods to Neil) Other than your brother. NEIL God knows I’ve tried. She doesn’t respect my authority. PATTY You have no authority. You live with me. You’re supported by your little sister. NEIL The safety I provide by living there is priceless. PATTY I’ll try to remember that the next time you steal cash from my purse. NEIL Come on, Kevin. Let’s go next door and leave the ladies to themselves. Since they can do everything on their own and don’t need a man ever. They try to make a show of getting up, but it’s difficult for both of them. Neil is able to extricate himself from his seat first and pulls Kevin up to go with him. They jut out their chins in defiance as they go. KEVIN Good luck opening any salsa jars while we’re gone. ALLISON Don’t forget the-- Neil and Kevin walk out the front door and--  SMASH TO: 19.",
      "dialogue_count": 0,
      "word_count": 576
    },
    {
      "scene_number": 7,
      "slugline": "INT. KEVIN’S HOUSE - LIVING ROOM - CONTINUOUS - 1C ALLISON Beer. Allison and Patty are left alone in the living room. The space is darker. Silent. They stand a room’s distance apart and do nothing to close the gap. Allison decides she should speak. ALLISON (CONT’D) Can I get you a cup of coffee? We got one of those Keurig machines now. Patty barely meets her eye. ALLISON (CONT’D) It’s no Dunkie’s but it’s pretty good. Cream, sugar, right? PATTY (curt) I don’t drink coffee. ALLISON Ah. Another HEAVY silence drops. These two women don’t know each other in the least. PATTY So yoga. Is that, like, a big part of your day? ALLISON Excuse me? PATTY I always wondered what it’s like to have the day to yourself. (beat) Every day. A small break in Allison’s expression. She recovers. ALLISON (Stepford) It’s a full time job keeping up with Kevin. Patty almost looks disappointed. 20.",
      "characters": [],
      "action_text": "PATTY Mm. I bet. (beat) See ya. Patty leaves. Allison looks down at her yoga clothes, reconsidering them. EXT. MAIN STREET - DAY - 1C Allison walks with a yoga mat under her arm. She passes that same diner, BEV’s, displaying a HELP WANTED sign. She backtracks. She considers the sign, then looks up at the gaggle of women with yoga mats heading into a storefront down the street. She takes a deep breath and she walks into the diner. INT. BEV’S DINER - DAY - 1C Allison sits in a booth, tapping her nail on a sturdy ceramic mug. She takes a nervous sip of her coffee. She makes a face; it’s good. This coffee may be the best thing in her life. She takes another sip. Mid-swig, SAM BEVERLY (35, handsome in a rustic, could-be-the- Brawny-Guy kind of way) sits down with a clipboard in front of Allison. She looks up at him and chokes on her coffee. SAM It’s no Dunkie’s, but I didn’t think the coffee was that bad. Allison wipes her mouth and coughs. ALLISON No, no. Not bad. Just...hot. Sam smiles. ALLISON (CONT’D) (still coughing) What are you doing here? SAM I heard you’re looking for a job at my diner. 21. ALLISON This is your-- Bev’s? (hears it as she says it) Beverly. Sam Beverly. Got it. SAM I was told that people respond more to diners where they think there’s a woman cooking the food. ALLISON Can’t imagine why that is. Well, I’ll be running away now. She moves to leave but Sam stops her. SAM You don’t want to interview? ALLISON Like you’d actually consider hiring me. SAM I need a waitress. High school was a long time ago. ALLISON (defensive) Not that long. SAM First question: Do you have any experience waiting tables? Allison gives him a look--he already knows her answer. ALLISON Newton Yacht Club wait staff, summers after junior and senior year. SAM Right, good. And you enjoyed the work? ALLISON Well the staff had fun. They share a small smile. ALLISON (CONT’D) But waiting on the wealthy-adjacent wasn’t exactly my calling-- 22. SAM And what was? Your calling? She’s caught",
      "dialogue_count": 0,
      "word_count": 5423
    }
  ]
}