{
  "slug": "killing-eve-101-nice-face-2018",
  "title": "killing eve 101 nice face",
  "genre": "thriller",
  "format": "series",
  "scenes_count": 2,
  "characters_count": 0,
  "characters": [],
  "total_words": 12556,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. BERLIN. ICE-CREAM PARLOUR - EVENING 1   1 An old florescent light flickers in a small, tired ice-cream parlour. Faded pastel wallpaper and enthusiastic posters exclaim flavours in German: “Vanille! Schokolade!” A few people walk past on the street outside. The vendor, a teenage boy, stands numbly at the counter. A mother and daughter(7) sit by the window. There is an eerie quiet about the scene. Then we see her. Sitting alone and upright at a small, plastic table is a petite, striking, impossibly chic young woman. Her black hair falls lightly down her back. Her precise yet subtle make-up hardly noticeable. Her eyes totally unreadable. She is impeccable and impenetrable. On her table is a passport, and an airline ticket. By her feet, a weekend case and two high-fashion shopping bags. She neatly eats a large, elaborate ice cream. Three flavours with all the trimmings. This is Villanelle. The little girl stares at her from her window-side table, while her mother rifles through her handbag. Villanelle and the girl stare at each other for a moment. Both eating their ice creams. Eventually Villanelle smiles awkwardly at the girl. The girl does not smile back, but continues to stare suspiciously, shovelling ice-cream into her mouth until she moves her gaze to the young man at the counter. He notices and smiles at her. A huge chocolatey grin peels across the girls face in response. She giggles at him. Villanelle observes the easy exchange: the dipping of the boys head, the crinkle of his eye, the kind, wide smile. She frowns. She turns to the little girl who is watching her again. Villanelle smiles at her again, but this time identically mimicing the dipping of the boys head, the crinkle of his eye, the kind, wide smile.",
      "characters": [],
      "action_text": "The girl now smiles back. Satisfied, Villanelle looks at her watch, spoons the last her ice-cream and picks up her bag. She drops some change into the tip jar as she passes the boy. VENDOR (blushing) Danke. She nods and heads to the exit. He watches her admiringly from the corner of his teenage eye, already in love. As she passes the grinning little girl she hesitates. deliberately knocks the small pot of ice-cream into her lap. The little girl screams. Villanelle exits with a small smile. INT. LONDON. EVE’S BEDROOM. 5.45AM. 2   2 A mobile phone rings relentlessly. Eve (41, smart, sardonic, a touch of ennui) sleeps. She yells into the room from her pillow. Her husband, Niko (40s, Polish) puts a pillow over her head in protest of her groan. She pushes her hand out, leans over the side of the bed and rummages through her bag to find her phone. She answers. EVE (into the phone) Somebody famous better be bleeding on a street somewhere. (beat, serious) Oh. Wow, shit, ok. No, no I’ll be there. Yes, I’m already up. She puts the phone down and immediately curls back up to a sleepy Niko. NIKO National emergency? EVE (into his shoulder) Yup. INT. THAMES HOUSE, HEADQUARTERS OF MI5. CORRIDOR. EARLY 3   3 MORNING. Caption: MI5.  2. Eve, now in a badly fitting suit, trying to cover her shirt with her jacket because she forgot to put a bra on in the rush to get ready, balancing a folder and a briefcase walks quickly down a corridor with her deadpan assistant, Elena, who is eating a croissant. EVE (stressed) I forgot to put a bra on. ELENA You look like shit. EVE Thanks. What’s going on? Did you get me a croissant? ELENA No. Want the rest of this? EVE Of course I want the rest of that. Elena stuffs it all in her mouth. Eve watches her. EVE (CONT’D) I could actually cry. ELENA (grinning) Sorry. Ok, from what I could eavesdrop on, Germany is here. Their department fucked up in Berlin and a Balkan sex-trafficking politician has been murdered - EVE (sarcastic) Oh no! ELENA I know, bum-",
      "dialogue_count": 0,
      "word_count": 3021
    },
    {
      "scene_number": 2,
      "slugline": "EXT. PALERMO. STREET MARKET - CONT. 13   13 Villanelle walks through the incredible, bustling food market. Fresh fish and vegetables pour off the stands and people are yelling for deals and sales. She carries a small bag of food. She picks up an oyster from the icey counter it sits on. She necks it and hands the shell back to the vendor. Beat. He stares at her. Waiting for her to offer money for it. VILLANELLE (sweetly, in Italian) Delicious! Thank you! VENDOR (in Italian)  Hey! You pay for that!  Villanelle just turns flirtaeously VILLANELLE (in Italian) I said thank you! She walks off. He can’t help but laugh at her. VENDOR  No!?  She smiles again and disappears into the crowd. The confused vendor is too stunned and distracted by demanding customers to fight. We follow her through the streets. She is very watchful. She absorbs it all. The heights of the buildings, the sound of her shoes on the floor. She studies everything. A young bronzed man walks past her. She eyes his body. But pulls herself away from the temptation. She has work to do. INT. METROPOLITAN POLICE. OUTSIDE INTERVIEW ROOM - LATER. 14   14 Eve dashes up the corridor. PC MAX HARPER greets her and hands her a file. She looks through a door at a strung out, heroin-chic teenager hanging her head between her legs on a chair in an interview room. ETHEL, translator, 60s, stands near them. EVE Thanks for holding on to her Max, I owe you a favour.  14.",
      "characters": [],
      "action_text": "PC MAX HARPER No mate, we’re quits now. EVE (remembering what she did for him once, she laughs) Oh shit yeah! Brilliant. Show me the girl. PC MAX HARPER Irena Milczarek, 17, Polish, very high. She’s all yours. (introducing) This is Ethel. She’ll translate. Be quick though. Got to release her in an hour. INT. METROPOLITAN POLICE. INTERVIEW ROOM. LATER. 15   15 Sat almost comatose in her chair is Irena. Eve sits with the PC HARPER and ETHEL. IRENA garbles incoherently. Then stops. Eve and PC HARPER look at Ethel who is squinting. ETHEL I’m sorry. She’s unintelligible. I don’t recognise any of these words. Beat. Eve rubs her eyes then turns to Max. EVE Does anyone in the department speak heroin Polish? Beat. EVE (CONT’D) I’m serious. Irena kicks off with the garbling again. Ethel struggles to keep up. Irena occasionally looks up and makes gestures. She is somewhere between laughing and crying and passing out. ETHEL I think she is saying they were drunk or - or she’s drunk now - she mentioned someone, a plank of wood? No, or a thin - he was thin - God, I’m sorry. EVE Ask her if it was a man or a woman. ETHEL (in Polish)  Did you see a man or a woman?  15. Irena garbles again. Ethel looks hopelessly at Eve EVE Ok.   (she stops the recording and takes the tape) Can we see if we can get her cleaned up. Max nods. Eve leans over to Irena EVE (CONT’D) Rusz dupe do Iozka. Irena looks up at her and seems to nod. Eve leaves the room. Ethel with her. INT. METROPOLITAN POLICE. OUTSIDE INTERVIEW ROOM. CONT. 16   16 PC MAX HARPER You speak Polish? EVE No. But my husband is Polish. So I’ve picked up one or two phrases. She smiles and walks off. PC MAX HARPER What did she say? ETHEL “Get your ass into bed”. EXT. SICILY. PALERMO. B&B. DAY. 17   17 Villanelle enters the small, unremarkable reception. A very chirpy, keen teenage girl stands at reception. GIRL (in Italian)  Good afternoon!  VILLANELLE (exactly the same)  Good afternoon!  Beat. The girl looks like she is about to say somet",
      "dialogue_count": 0,
      "word_count": 9535
    }
  ]
}