{
  "slug": "kill-the-messenger-2014",
  "title": "kill the messenger",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 15,
  "characters_count": 2,
  "characters": [
    "WEBB",
    "IAN"
  ],
  "total_words": 23931,
  "total_dialogue": 2,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. CITY MORGUE - SACRAMENTO, CA - DAY 1   1  Languid. Dreamlike. A slow-moving camera pushes into a refrigeration room of a MORGUE. A DETECTIVE, TWO UNIFORMED COPS, a MORGUE attendant, and the CORONER, are on the periphery of frame. Their conversation is indiscernible.   At the center of frame is a MAN’S BODY lying on a slab, half in, half out of the morgue refrigerator. We do not see his face. THE CAMERA APPROACHES. SLOW. Past the group of people in the room. It moves up and over the body. IMAGE IS UPSIDE DOWN. Then-- -- CAMERA RIGHTS ITSELF. We find ourselves looking squarely into the face of GARY WEBB: 42, handsome, masculine. Two bullet wounds to his face and head. WE SMASH CUT TO -- -- a kaleidoscope of jump cut images and footage from the War on Drugs, both familiar and distant-- (UNDER AND THROUGH OPENING CREDITS)  (2-10) STOCK FOOTAGE 2   2  TO PRESIDENT RICHARD NIXON opening the \"War on Drugs\"... PRESIDENT NIXON/FOOTAGE Drugs are public enemy number one-- TO NANCY REAGAN delivering her “Just Say No” speech... TO DEA AGENTS SEIZING a mountain of hundred-dollar bills... TO PABLO ESCOBAR in jungle fatigues, next to a plane loading hundreds of pearlescent white bricks... PRESIDENT REAGAN/FOOTAGE (OVER) ...These twin evils – narcotics and terrorism – represent the most insidious and dangerous threats to the hemisphere today. TO A ROCK HOUSE IN THE NICKERSON GARDENS PROJECTS, WATTS, LA ... detritus and urban decay ...   Powder cooked into rocks by  MOTHERS, their KIDS playing with the vials around their feet.",
      "characters": [],
      "action_text": "TO A LINE OF JUNKIE MOTHERS wrapping the rock house... TO LAPD GANG UNITS - helmets and truncheons - bracing a wall- ful of corner hooks, look-outs and pimps. TO AFRICAN-AMERICAN CORPSES - women, children trapped in cross-fire - lying akimbo in an LA playground. TO WATTS ON FIRE ... blocks of flames ... urban warfare.  EXT. FAUX SPANISH MANSION - MISSION VIEJO, CA - SIMULTANEOUS 11   11  TITLE:   JULY 15, 1995  A MAN walks up to the door: 37, longish ash-blond hair, ruddy handsome. Notebook in back pocket. GARY WEBB. Vibrant. Alive. Door opens on RONNY QUAIL, 40, nose collapsed from a lifetime of blow. LITTLE HOTTIE, 19, topless and G-string, in tow. QUAIL Who the fuck are you? WEBB Gary Webb. San Jose Mercury-News. QUAIL What do you want? WEBB You called me, remember? Story on government seizure of property of, uh, accused narcotics dealers-- QUAIL (hands over heart) Yeah yeah that’s me. The accused ... c’mon in...  INT. FAUX SPANISH MANSION 12   12  Quail walks Webb in. No furniture. Webb sniffs. Cleaning and paint equipment piled in the corner. WEBB This the house they’re taking?  2.  KILL THE MESSENGER SALMON DRAFT-   7/16/13 QUAIL I remain optimistic. WEBB (checks his notebook) You said you were charged with conspiracy-- Something’s off. The light. Nothing’s coming through the windows. Because they’re all covered in tin foil. WEBB (CONT’D) What’s with the foil? QUAIL Signals, man. Blocks microwave and radio. The girl rolls her eyes and - topless - crosses to the coffee machine. Webb can’t stop looking at the girl’s ass. QUAIL (CONT’D) But what they don’t seem to get is they can’t get me-- Webb takes in the girl. All of her fantastic body. QUAIL (CONT’D) What the hell’re you doing? Webb displays his left hand. A shiny ring. WEBB Relax. Married. QUAIL So what. So am I. Momentary tension. Then they share a look, an understanding, maybe a smile. Brothers ... and--  EXT/INT FAUX SPANISH MANSION - POOLSIDE - TIME JUMP A13   A13  They’ve been walk-and-talking for a wh",
      "dialogue_count": 0,
      "word_count": 1096
    },
    {
      "scene_number": 2,
      "slugline": "EXT. WEBB’S HOUSE - LIESEL CT., SACRAMENTO - LATER THAT DAY 14   14  A local HOCKEY CREW - post game - and WIVES around Webb’s pool. Still in their jerseys. Webb at the grill, knuckles raw, upper lip smeared with dried blood. And there’s Ian, now 16. Spitting image of the old man. In a Jersey, too. And Sue - now 34, with their other two kids, ERIC, 12; and CHRISTINE, 9. AC/DC playing in the b.g. DAVE (laughing at Webb’s face) You are the picture of graceless  and out-of-control, a danger to your kind. BOB The guy just had a shotgun in his ear. Give him a break. (to Webb) So how’d that feel? WEBB Cold-- DAVE Did he really tin foil his whole   *  house?   *  SUE (from across the yard; always listening) Tell them about the half naked   *  girl. Was she old enough to drive?   *  BOB Man, I wish I had your life. SUE Cuz you want to be married to me? BOB Cuz Gary’s my idol. And yeah-- (glancing at his own wife) That thing about you. You’re a rock star, too-- SUE Uh huh--  7.  KILL THE MESSENGER BUFF PAGES-   7/21/13",
      "characters": [],
      "action_text": "Dave puts a beer in Ian’s hand. SUE (CONT’D) Your son is sixteen, Gary! Just f.y.i.-- WEBB C’mon, check this, fellas. (leads them to--)  INT./EXT. WEBB’S HOUSE - GARAGE - CONTINUOUS 15   15  There’s Webb’s Honda Interceptor, hottest of motorcycles. And an old wheezy Triumph. In need of love and spare parts. IAN Awwright, Dad! WEBB We’ll rebuild it together. Ian hugs Webb hard. Webb puts the kid in a headlock. WEBB (CONT’D) Infant day before yesterday. Sue sticks her head in. Phone in hand. SUE Hey. Yeah you. Hotshot. (face falls at the sight of the second bike) Goddammit we talked about this! WEBB I changed our mind. It’s a two-year project. Minimum. Webb tangos across the garage. Sue warding him off. WEBB (CONT’D) I’ve waited for this, you know? The perfect ride. S’been sitting up here in my head for fourteen years. My boy and me riding to the mountaintops and touching the sky. Then I watch him, my kid, head over the horizon.  8.  KILL THE MESSENGER SALMON DRAFT-   7/16/13 BOB God, that’s beautiful. SUE Shut up, Bob. (to Ian) You ready for all that, Ian? To be full of shit like your dad? IAN Yeah. I wanna ride to the hills and- SUE Touch the sky. I know. (she grabs Webb’s nuts) Something happens to my kid on that thing I’ll cut these off while you’re sleeping. DAVE (toasts with a pint of motor oil) And here’s to the happy couple! Ain’t life grand! BOB I thought you already cut   *  them off.   *  Sue hands him Webb phone. Whoever was on the other end heard the whole thing. SUE (CONT’D) It’s the paper.  INT. WEBB’S HOME OFFICE / BASEMENT - CONTINUOUS 16   16  Webb heads down the basement steps to his office. It’s a reporter's lair, a quasi-organized chaos of boxes and files .  A slew of journalism awards, including a Pulitzer. Framed stories from the   Kentucky Post   and   Cleveland Plain-Dealer.  Dirty aquarium gurgles in the corner. Poster hangs over it:  “If it's in the Kentucky Post, it's the truth”.  INT. NEWSROOM - SAN JOSE MERCURY NEWS - SAN JOSE   - CONTINU",
      "dialogue_count": 0,
      "word_count": 880
    },
    {
      "scene_number": 3,
      "slugline": "INT. WEBB’S HOUSE - KITCHEN - DAY 19   19  Sue starts doing eight things at once, kids’ lunch, breakfast, dishes. Webb tries to help but mostly in the way. IAN (reading Webb’s story; island of calm) Dad, you hang with some insanely bad people. WEBB Funny thing. Bad guys are usually more honest than good guys. And more fun. It’s an inside-out world. SUE Life lessons by Gary Webb. IAN Mom, you have to read this. Sue says nothing. Webb plants a kiss on the back of her neck. WEBB Gotta go gotta go gotta roll, munchkins! CHRISTINE Daddy’s taking us?!   *  WEBB Train leaves in five ... four ...  INT./EXT. WEBB’S HOUSE - LIVING ROOM - LIESEL CT. 20   20  Sue watches the kids pour into the shitty little car. Fights back a smile. Then picks up the paper. And starts to read.  INT. NEWS BUREAU - SACRAMENTO - DAY - ESTABLISHING 21   21  Webb bangs around a square of hallways housing the California bureaus of the major national newspapers. Bustling and loud. Past the Los Angeles Times suite (huge, lots of REPORTERS); New York Times (plush and stately); Washington Post (beautiful and big). And into--  12.  KILL THE MESSENGER BUFF PAGES-   7/21/13",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 205
    },
    {
      "scene_number": 4,
      "slugline": "INT. SAN JOSE MERCURY NEWS BUREAU - SACRAMENTO - SAME 22   22  The Merc. Cramped and thread-bare, country cousins to the majors. TOMMY FARRAGHER, 30's, doughy Irish guy. Webb’s office has an actual door. FARRAGHER Yo. I know how bad you wanna do the Guv today. Real reporter work. WEBB (grabbing a stack of pink ‘While-you-were-outs’) How that crap gives you satisfaction I’ll never know. FARRAGHER Meat and potatoes, King Shit. Someone’s gotta do it. (then) Hey, Fancy. That story this morning. That was a big one, son. WEBB But not the “Big One”. FAR Curious. Does the Big One have a sound? Does it go ‘woosh’? WEBB It’s like a bullet with your name on it. You never hear it coming. They look up. A young kid in his 20’s is in the doorway. He   *  heard that.   *  RICH KLINE Hey.   *  WEBB Boy Wonder, Rich Kline, L - A -   *  Times. What can I do for you?   *  RICH KLINE Hardly Boy Wonder. My editor’s pissed we missed that story. WEBB He should be.   *  13.  KILL THE MESSENGER BUFF PAGES-   7/21/13",
      "characters": [
        "WEBB"
      ],
      "action_text": "RICH KLINE Amazing job, by the way. Any advice   *  for me? WEBB Yeah, don’t let the assholes win.   *  (his phone rings) Gotta go, kid.  INT. WEBB’S OFFICE - MERC BUREAU - SACRAMENTO - SAME 23   23  The room a wreck of controlled chaos. Webb shuffling through the while-you-were-outs. Three from a “CORAL BACA”. WEBB (calls out there) Who the hell is Coral Baca and why does she keep calling me--? (dialing; into phone) This is Gary Webb. CORAL/PHONE He finally calls. Her accent Latina. Sultry. CORAL/PHONE (CONT’D) I like your work. WEBB You follow my work? CORAL/PHONE I do now. WEBB What can I do for you? CORAL/PHONE It’s what I can do for you. WEBB Okay, what can you do for me? CORAL/PHONE Your story today. I thought you might be interested in a follow-up.  14.  KILL THE MESSENGER BUFF PAGES-   7/21/13 WEBB You called me five times this morning for a   follow-up ? CORAL/PHONE Three times. I’m a woman. And I wanted something. (then) My boyfriend Raffie’s in prison for cocaine trafficking. That’s Rafael Cor-ne-jo. WEBB (starts doodling) Colombian? CORAL/PHONE Nicaraguan. Absentmindedly scrawling “Cornejo”. Doodling around it. CORAL/PHONE (CONT’D) He has this gorgeous house the government just took. Twenty- thousand-dollar Italian couch I designed myself. Handmade wallpaper. Good story, no? WEBB Yeah. I just wrote it. CORAL/PHONE Raffie’s story is different. He sold drugs for the government. WEBB (pencil freezes) Can you say that again? CORAL/PHONE He brought four tons of cocaine into the country.   For the government . Webb scrawls a big question mark, underlines it, circles it. Stares at it --   nah   -- finally scrawls a thick X over it. WEBB That’s, um, a little-- CORAL/PHONE Crazy?  15.  KILL THE MESSENGER SALMON DRAFT-   7/16/13 WEBB That’ll work. CORAL/PHONE You think I’m one of those conspiracy nut jobs, don’tcha? WEBB You have a nice voice, Coral. Thanks for calling. (about to hang up--) CORAL/PHONE What if I can prove everything? I’ve copied every piece of pap",
      "dialogue_count": 1,
      "word_count": 3236
    },
    {
      "scene_number": 5,
      "slugline": "EXT. SANTA MONICA, CA - DAY - ESTABLISHING   (STOCK FOOTAGE) 37   37  A bright sun-bleached shore line. In-line skaters, volleyball and bikinis.  INT. ALAN FENSTER’S LAW OFFICE/WAITING ROOM - SANTA MONICA - 38   38  DAY  Webb waits perspiring outside a law office. ALAN FENSTER - dapper, mid-level slip-and-fall guy, 50's - comes out. FENSTER Sorry about the air conditioning. Come on in. They back walk into his office.  INT. ALAN FENSTER’S LAW OFFICE -- CONTINUOUS 39   39  FENSTER What can I do for you? Fenster sits behind his desk. WEBB You represent Ricky Ross. The crack dealer. FENSTER  Alleged   crack dealer. WEBB (reads from a paper)  ‘Freeway Ricky Ross. Biggest dealer in Los Angeles, the epicenter of the national crack epidemic--’  (shows him the paper) L.A. Times. FENSTER Who do you write for again? WEBB San Jose Mercury-News. FENSTER Never heard of it.  32.  KILL THE MESSENGER SALMON DRAFT-   7/16/13",
      "characters": [],
      "action_text": "WEBB How’s your case going? FENSTER What do you actually want, Mr.   *  Webb?   *  WEBB Russell Dodson is the prosecutor on   *  your case. FENSTER That’s public record. Yes. WEBB What about Danilo Blandon? Heard of him? FENSTER Maybe. WEBB I think he’s about to testify against your client. FENSTER You have that backwards. Blandon is a friend and associate of my client. If he’s going to testify it’ll be   for   Ricky. WEBB That would be awkward.   *  FENSTER Why? WEBB Because he’s a government informant. FENSTER Well that’s bullshit-- WEBB Yeah okay except I have a Grand Jury transcript. Released on discovery. By mistake. By our Mr. Dodson. (Fenster leaning now) In it is Blandon’s drug distribution network. Distribution outlet number one is your client--  33.  KILL THE MESSENGER BUFF PAGES-   7/21/13 FENSTER (almost explodes)  He’s   the informant??   Blandon??  God dammit ! Jesus does that make sense. If you only knew the horseshit Dodson puts me through every time I ask who his secret weapon is. WEBB It’s not just Ricky. He’s probably testifying against a half dozen guys-- FENSTER Shit. They block everything I ask   *  for, claiming - get this - national   *  security. WEBB National security and crack cocaine in the same sentence. Does that not sound strange to you? FENSTER (interested now) What do you really want?  INT. ENTRANCE - LOS ANGELES DETENTION CENTER - LOS ANGELES - 40   40  DAY  They arrive at a hallway of interview rooms. Waiting inside one is a fit black man, 35, with a cropped beard and wide burning eyes: “FREEWAY” RICKY ROSS. ROSS Who’s this cracker? FENSTER A reporter. ROSS Fuck you, Finster. FENSTER Fenster. You need to hear what he has to say. WEBB Gary Webb, San Jose Mercury-News.  34.  KILL THE MESSENGER BUFF PAGES-   7/21/13 ROSS The   what?  WEBB It’s in northern California. ROSS I know where San Jose is. Small time. Why would I talk to small time? FENSTER Have the conversation, Ricky. WEBB What do you know about Danilo Blandon? (no reply, so",
      "dialogue_count": 0,
      "word_count": 2909
    },
    {
      "scene_number": 6,
      "slugline": "INT. COURTHOUSE - SAN FRANCISCO - MORNING A45   A45  Rafael Cornejo, tan, country club whites, and Coral Baca, walk through the lobby of the court house. They find -- -- Webb standing against a column. WEBB Hi. CORNEJO   *  So what do you want?   *  WEBB Norwin Meneses. CORAL I thought I told you to be happy. WEBB I need to talk to him.   *  CORNEJO He don’t talk to nobody. WEBB You think they’re done with you, Raffie? They’ll give it a little time, til they think you’ve forgotten. Then they’re coming back around. And this time I won’t be there. Cornejo looks at him. Then-- CORNEJO You fuck Coral?   *  WEBB Nope. CORNEJO You think about it? WEBB Yep. Coral. Glimmer of a smile. She knows what she is.  49.  KILL THE MESSENGER BUFF PAGES-   7/21/13",
      "characters": [],
      "action_text": "CORNEJO Norwin’s in a prison in Managua,   *  Nicaragua.   *  WEBB (unflinching)   *  I want to see him. I want you to   *  tell him I’m coming.   *  CORNEJO   *  That’s it?   *  WEBB   *  No. Make sure he wants to see me.   *  EXT. NICARAGUA. DAY (STOCK PHOTOGRAPHY) A46   A46  Aerial shot. The camera moves over the hills of Nicaragua. (Stock Photography)  INT/EXT. MANAGUA STREETS. DAY B46   B46   *  Webb in the back of a taxi on a crowded city street.  EXT. TIPITAPA PRISON - MANAGUA, NICARAGUA - DAY 46   46  Fortress walls. The taxi pulls up to the front of the prison. Webb gets out.  EXT. VISITOR’S WAITING AREA - TIPITAPA PRISON - DAY 47   47  A courtyard outside the prison walls. There’s a long line of visitors waiting to get in. Armed GOONS with AK-47s guard the area. Webb’s at the back of the line. He spots the Warden, flashes his card from a distance. The WARDEN waves him to the front. Webb, nervous, hands the WARDEN his card. Under the card, folded to the same dimensions, are three hundred-dollar bills.  50.  KILL THE MESSENGER SALMON DRAFT-   7/16/13 INT./EXT. TIPITAPA PRISON - DAY 48   48  A prison guard escorts Webb down a corridor just outside of the prison yard. Seated there, a tanned MAN dressed in silk and slippers. Reading Borges. NORWIN MENESES, 45. The inmate potentate. A YOUNG INMATE beside him. Even the guards attend to him. This prison is his. MENESES (perfect English) What took you so long? (then) No other journalist has tried to find me. Don’t you find that surprising? WEBB Yes. Yes I do. MENESES Do you play golf, Mr. Webb? WEBB   *  No, I play Hockey.   *  INT. PRISON COURTYARD - TIPITAPA PRISON - DAY 49   49  Meneses leads Webb into the sun-bleached prison yard. He   *  walks over to a Guard that is minding his golf clubs. He asks   *  the guard for a FIVE IRON in SPANISH.   *  He takes it, walks over to Webb.   *  MENESES   *  A five iron. It is perfectly   *  designed to pull off any shot, if   *  you use it properly. A tool that   *  can c",
      "dialogue_count": 0,
      "word_count": 1173
    },
    {
      "scene_number": 7,
      "slugline": "EXT. WAREHOUSE - JUNGLE AIRSTRIP - CONTINUOUS 50   50  The airstrip long, for big planes, mostly overgrown. The Nicaraguan mountains are seen in the distance. They drive up to a skeleton of a warehouse half-collapsed, sun-bleached. Webb gets out, stares at what’s left of the warehouse. WEBB How many of these? BOSCH (recalling) In total, maybe fifty transport depots. From Colombia to Nicaragua. And from there, to here, to your country-- WEBB Weapons in there? BOSCH Weaponry. Girlfriends for the   *  generals. And then for transport back the other way, north --   *  cocaine. Lots and lots of cocaine.   *  The desolate privacy of the place is numbing, to Webb, and to us. HOLD, then-- -- Webb and Bosch turn. TWO vehicles speeding toward them. A group of Nicaraguan MEN with GUNS jump out of the vehicles. They’re ragtag, Nicaraguan militia. SOLDIER 1 (guns pointed)  What are you doing here?   You’re trespassing!  BOSCH (to Webb) Don’t answer that. SOLDIER 1 (to Bosch)  Shut up!  ( to both of them )  Identification!  55.  KILL THE MESSENGER BUFF PAGES-   7/21/13",
      "characters": [],
      "action_text": "Webb hands them his passport and press card. Bosch hands them his ID. SOLDIER 1 (CONT’D)  Prensa--?  (hands it back)  There’s no stories here. This is private property. If you want to live. Leave. Now!  Webb and Bosch carefully take back their credentials and walk across the field to their car. The armed men watch. It’s tense. CUT TO:  EXT. TAXI. WASHINGTON DC. DAY 51   51  Webb in a taxi traveling through DC. The CITY is reflected in the window as he’s looking out.  EXT. GOVERNMENT BUILDING - WASHINGTON, DC - DAY 52   52  Webb gets out of cab, walks up to the entrance of a government building. CUT TO: Moments later. He’s on the phone with Anna. He keeps an eye   *  on the entrance to the building. ANNA/PHONE   *  You’re where? WEBB/PHONE DC. I’m starting to understand the what. I just don’t have the why yet.  56.  KILL THE MESSENGER TAN PAGES   8/05/13 ANNA/PHONE (OVER)   *  Upstairs is getting nervous. You’re supposed to be back here. WEBB/PHONE You   want   me here. Nicaragua leads to Washington, not California. ANNA/PHONE (OVER)   *  But the drugs came here? WEBB/PHONE I’m not talking about drugs. (Beat) Look. I changed planes in Miami. I kept all the receipts. I’ll pay my own flight back if you want. But we can’t do this on the phone. I don’t want to do this on the phone. Webb spots who he’s looking for. A small owlish man, 40ish. Glasses around his neck: FRED WEIL. WEBB I have to go. He hangs up, crosses through the crowds to Weil. Webb falls into step beside Weil. WEIL Who are you? WEBB Gary Webb, San Jose Mercury-News. WEIL Never heard of it. (keeps going) I don’t talk to the press. Call public affairs. WEBB I don’t think you’d want them to know. Weil slows, gets a good look at Webb’s ragged clothes. Then the thing in Webb’s hand. The GJ transcript. He stops. WEIL Dammit.  57.  KILL THE MESSENGER TAN PAGES   8/05/13",
      "dialogue_count": 0,
      "word_count": 512
    },
    {
      "scene_number": 8,
      "slugline": "EXT. CAPITOL BUILDING- WASHINGTON, DC - DAY 53   53  Webb and Weil sitting on the edge of the Reflecting Pool. Capitol building in the background. A parade of joggers and tourists passing by. Weil looks grim. WEIL Can I eat my lunch at least? (the papers on Webb’s knee) That’s classified. How did you get it? WEBB A drug dealer gave it to me. WEIL Perfect. (disgusted, throws his lunch away) Listen, I was John Kerry’s lead   *  investigator on the senate sub   *  committee that investigated this.   *  It’s a nightmare. You have no idea   *  what you’re getting into. WEBB   *  So then you tell me.   What am I   *  getting into?   *  WEIL I’m on the National Security Council now. And I have the trust of the President and his cabinet. It took me ten years to get back to that place. (grabs the papers) Everyone who touched this was destroyed. I lost my marriage, my job. My ex convinced the court my kids were in jeopardy just being in proximity to me. I lost them too for a while. WEBB Your name goes nowhere near this. We never spoke. I give you my word. Pause. Weil looks at him. WEIL What do you want from me?  58.  KILL THE MESSENGER SALMON DRAFT-   7/16/13",
      "characters": [],
      "action_text": "WEBB Tell me about Blandon and Meneses. WEIL They’re the symptom, not the disease. Joggers approach. Weil waits, then: WEIL (CONT’D) We started hearing things about a particular government agency. Ludicrous impossible things. WEBB The CIA. WEIL (nods)   *  It turned out it wasn’t so ludicrous. Or impossible. I underestimated -   badly   - how much the White House wanted to win that brutal little war. WEBB You’re telling me the US government actually got money from the drugs? WEIL It was just the Agency. But they weren’t pocketing the money. They were too clever for that. They let it detour south, flow into Central America, to the rebels, to the Contras. WEBB It’s too stupid to be true. WEIL Unless you were the Reagan White House, or the CIA, where it was a whole lot of true. WEBB Why doesn’t everyone know about this?  59.  KILL THE MESSENGER BUFF PAGES-   7/21/13 WEIL Because for the first time in the history of our country the United States government launched a propaganda campaign against itself, and against the American people. By the time they were done, they had everyone - Congress, the entire Washington press corps - convinced that my investigators and I were all bat-shit crazy. WEBB Hold on a second-- WEIL Not the New York Times, not CBS news, not the Washington Post - would touch it with a ten-foot pole. It just went away like it never happened. (after a long beat)   *  Ever do anything like this before? (Webb shakes, No) Has your paper? WEBB Not that I know of. WEIL This is fancy information you have. And dangerous. I’d be remiss if I didn’t tell you that other reporters have gone down this rabbit hole. Seasoned reporters who knew their way around Washington and Central America. WEBB What are you telling me? WEIL I’m telling you that I had an American citizen, a rich Republican Party fund-raiser,   a White House favorite , in my office, upset about what he was hearing. He believed in freedom and defeating communism, but not laundering narcotics money for gu",
      "dialogue_count": 0,
      "word_count": 1299
    },
    {
      "scene_number": 9,
      "slugline": "INT. OFFICE CORRIDORS/CONFERENCE ROOM - DAY 58   58  A man in a suit guides Webb down a hallway with no signage or   *  information. It seems rented. They enter a conference room -- -- TWO FEDERAL AGENTS (DEA) dressed in SUITS are seated   *  around a table. Two we recognize from court. There’s a man dressed in a button up shirt and khakis seated off to the side. MILLER   *  Gary. Thanks for coming. I’m agent   *  Miller. This is agent Jones.   *  The KHAKIS MAN is not introduced. MILLER (CONT’D)   *  Can we get you a cup of coffee? How   *  about one of those cappuccinos? We just got a new espresso machine, probably cost the taxpayers thirty grand. WEBB I’m fine. MILLER (to Agent) Get him a cappuccino. (beat) So okay. We have a conundrum. We fucked up. JONES We didn’t fuck up-- MILLER We fucked up. (throws Jones a shut-the- fuck-up look) We don’t agree with everything that happens in our Agency, so this is a little awkward for us. But you’re getting into some sensitive areas. There are ongoing operations you’re in danger of exposing. Operations that have taken months and years to set up. Thousands of man-hours. Millions to fund.  65.  KILL THE MESSENGER SALMON DRAFT-   7/16/13",
      "characters": [],
      "action_text": "They expect Webb to say something. He doesn’t. Then he does. WEBB How do you know that? MILLER Well, we know you were in Nicaragua. We know you saw Meneses. But obviously so much more-- WEBB Am I being followed? JONES What’s your angle, Webb? That your government uses scumbags to catch bigger scumbags? Newsflash-- WEBB I was under the impression   you   had something you wanted to say to   me.  But since you asked, No. My angle is that the American government helped put drugs on its streets to fund an illegal war.   *  JONES What you want to say happened never happened. WEBB Then why am I here? (points at the silent agent) Why is   he   here? MILLER We’re not the bad guys. Meneses is a bad guy. Ricky Ross is a bad guy-- JONES What do you think, we work shitty hours and miss our kids’ soccer games and birthdays for crappy government pay to sit in a bunker somewhere where we figure out all the ways we can fuck with the American people?  66.  KILL THE MESSENGER SALMON DRAFT-   7/16/13 MILLER Why not just let the past stay in the past? WEBB (flash of anger) But you guys keep making the same mistake. When do you learn how   not  to screw things up? MILLER American kids, American soldiers, were going to die. WEBB American kids did die. They’re still dying. Just not the ones you care about. That lays there like an armed grenade. KHAKIS MAN (menacing) We’d never threaten your children, Mr. Webb. WEBB (head snaps around; then) This was a mistake. (and he’s up, headed to   *  the door)   *  MILLER What if we can deliver something even better than Blandon? WEBB Are you people even allowed to be doing this? Webb is out the door.   *  67.  KILL THE MESSENGER BUFF PAGES-   7/21/13 MILLER (as Gary leaves) Glad we had a chance to meet, Gary.  INT. CONFERENCE ROOM, MERC NEWSROOM, SAN JOSE, CA - DAY 59   59  We’re at a conference table. Webb, Anna Simons, Jerry Ceppos,   *  Managing Editor, JONATHAN YARNOLD, and other SUITS. Webb and Anna shoulder to shoulder. Webb fiery. A focused, ",
      "dialogue_count": 0,
      "word_count": 1829
    },
    {
      "scene_number": 10,
      "slugline": "EXT. WEBB’S HOUSE - LIESEL CT. -   MOMENTS LATER 78   78  Webb follows the Suit into the street. Sue is right behind him. Webb’s NEIGHBORS staring hostilely at him now. WEBB (as the Buick drives off) Hey! Get back here! The Suit crosses to a Buick, gets in.   (Same car parked down the block.) WEBB (CONT'D) I know that car! SUE Let it go, Gary. (calming him) Let it go.  INT. LIVING ROOM, WEBB’S HOUSE - LIESEL CT. - LATER 79   79  Almost dawn. Eric asleep on the couch. Sue rocking Christine. Webb sits with his arm around a wired Ian. SUE You want Ian to kill someone with a hockey stick? Because he’ll do anything for you. WEBB This is my job. SUE Your first job is not the world’s bullshit. It’s   our   bullshit. We had a deal.   Never   bring this home. She carries her sleepy daughter back to her bedroom.   *  INT. WEBB’S HOME OFFICE - NEXT DAY 80   80  Webb unearthing documents from boxes, dozens of notebooks, facts and dates and names on torn squares of paper and taped up to walls. Moving them, building the building of the story.  74.  KILL THE MESSENGER SALMON DRAFT-   7/16/13",
      "characters": [
        "IAN"
      ],
      "action_text": "Follow this through a barrage of overlapping JUMP CUTS, superimposed faces (Blandon, Meneses)...and planes and hangars and boxes and bricks of dope, bricks of cash.  INT. WEBB’S HOME OFFICE - NIGHT 81   81  The cigarettes pile up and the windows go dark with night...  OMITTED 82   82   *  INT. WEBB’S HOME OFFICE - NIGHT 83   83  ...and dark again... Sue in the doorway watching. Then she’s not. Then she is. Now in her clothes. Then Ian’s there. Forlorn. Because--  INT. WEBB’S HOUSE - GARAGE - NIGHT 84   84  The motorcycle, that piece-of-shit Triumph, is taking shape. First the frame. Then the engine. Ian is good at this. But alone at this. All under the flutter of keyboard clacking, which comes in gusts, until we--  INT. WEBB’S HOME OFFICE - NIGHT 85   85  HIS COMPUTER SCREEN FILLS OURS: Webb’s fingers typing the header:   “DARK ALLIANCE”   ... and his byline:   “by GARY WEBB” . Webb on the phone with Anna. WEBB/PHONE I’m about to press send. ANNA/PHONE (OVER) We’re ready. All hands on deck. WEBB/PHONE Don’t over-edit it.  75.  KILL THE MESSENGER GRAY PAGES   8/12/13 ANNA/PHONE (OVER)   *  Don’t worry. WEBB/PHONE Anna.   *  ANNA/PHONE (OVER)   *  Yes, Gary. I got it. Go enjoy your family. DISSOLVE TO:  EXT. LAKESIDE CABIN - DAY 86   86  The entire Webb family enjoying themselves by the lake.  INT. LAKESIDE CABIN - NIGHT 87   87  In the Kitchen area, Webb and Sue among the hockey crew. Bob, wives, spawn. Reefer and beer. Progeny asleep on couches. IAN (o.s.) Dad! It’s up! It’s online! In the DEN -- Dave, Gary’s other hockey buddy, at a computer. IAN is with him. PUSH on the screen where we see a graphic of a man smoking a crack pipe superimposed over the seal of the CIA. The Mercury News website. Now Webb’s story:  “DARK ALLIANCE BY GARY WEBB FOR THE BETTER PART of a decade, a west coast drug ring sold tons of cocaine to the Crips and Bloods street gangs of Los Angeles and funneled millions in drug profits to a Latin American guerrilla army run by the U.S. Central Int",
      "dialogue_count": 1,
      "word_count": 2840
    },
    {
      "scene_number": 11,
      "slugline": "INT. BODEGA. MANAGUA, NICARAGUA - DAY 101   101  DOUG FARAH - a reporter from the WASHINGTON POST. He’s on a HOUSE PHONE speaking with --  INT. CONFERENCE ROOM - WASHINGTON POST - WASHINGTON DC - 102   102  SIMULTANEOUS  -- Zuckerman in a conference room. Speaker phone on the table.   *  ZUCKERMAN Jackson Diehle’s here with me, from   *  foreign.   *  ANGLE - JACKSON DIEHLE, 50, Foreign Desk Editor. INTERCUT FARAH (Managua) AND ZUCKERMAN & DIEHLE (DC). FARAH It’s checking out, Walter. I found the banker. He met with Webb. He confirmed. He laundered drug money for the Contras. Other money came from the north. He sent it where it was needed. Blood to a wound. Zuckerman and Diehle exchange worried glances. ZUCKERMAN Where in the north did it come from? FARAH According to the this guy, it happened the way Webb said it did. JACKSON DIEHLE Are these sources reliable enough - for the Post, I mean? They’re all drug dealers-- FARAH The banker isn’t a drug dealer. And two of the others were bag men for Oliver North.  88.  KILL THE MESSENGER SALMON DRAFT-   7/16/13  (MORE)",
      "characters": [],
      "action_text": "There’s also an American ex-pat who’s had a ranch in the jungle for thirty years, and he let the planes land and take off on his airstrip, and he let them store dope on his property. So yeah, I’d say the story’s reliable. ZUCKERMAN I’m not buying it. You’re talking to drug dealers and money launderers. I’m talking to Langley. FARAH There’s nothing to buy. It’s staring you in the face. We gotta eat this one. ZUCKERMAN I have better information that says otherwise. FARAH Well, I’d like to see it. (then) You gonna cut my copy, Walter? Long silence. Farah shoves his hands in his pockets, enraged. FARAH (CONT’D) Anyway, I’m filing. You guys do whatever you want with it. Farah hangs up. JACKSON DIEHLE So what’s our point of view? ZUCKERMAN That Webb is trying to make two plus two equal ten. That the CIA would never use those low-lifes, and in fact denies it unequivocally. And that Webb’s practices borderline journalistic malfeasance. Basically, he’s a fraud, and so’s this story. JACKSON DIEHLE I’ll take that upstairs and see if it’ll fly.  89.  KILL THE MESSENGER SALMON DRAFT-   7/16/13  FARAH (CONT'D)",
      "dialogue_count": 0,
      "word_count": 381
    },
    {
      "scene_number": 12,
      "slugline": "INT. WEBB’S HOUSE - LIESEL CT. - DAY 103   103  Webb, Sue and the kids are watching the network news. New furniture added to the old. Big new color TV. Overscene we hear a newscaster -- NEWSCASTER/TV (o.c.) Our lead story tonight is a Senate hearing looking into allegations made by a California reporter, Gary Webb, that the CIA has been trafficking in cocaine-- Webb sits up. NEWSCASTER/TV (OVER) (CONT’D) And that the CIA is responsible for the crack epidemic. SUE Gary. They’re twisting your words. TV CUTS TO FOOTAGE OF CONGRESSIONAL TESTIMONY BY FRED WEIL WEIL (TV) We found no evidence that the African-American community was specifically targeted by a plot to sell crack cocaine, or that high U.S. officials had an   official  policy of supporting the Contras through drug sales. SUE That’s not what he said, asshole! What do they mean ‘specifically targeted’? You never said that! NEWSCASTER/TV (OVERSCENE) In other news... SUE Wait ... where’s the rest? (stands) Where the hell’s the rest!? WEBB They hacked it up. They edited Weil’s testimony.  90.  KILL THE MESSENGER SALMON DRAFT-   7/16/13",
      "characters": [],
      "action_text": "OMIT 104   104  OMIT 105   105  EXT. BANQUE SWISSE - MANAGUA, NICARAGUA - DAY 106   106  Another hot day in Central America. The banker, Bosch, crosses a crowded sidewalk to his car and DRIVER. He’s suddenly intercepted by TWO MEN IN WINDBREAKERS. They take his elbows and forcefully and without fuss guide him in another direction.  INT. WEBB’S HOUSE - LIESEL CT. - BEDROOM - PRE-DAWN 107   107  Still dark. Clock reads 4 a.m. Webb props himself up. The phone. Webb stares at it. A beat. It keeps ringing. Sue stirs. WEBB (picks up) Hello? WEIL/PHONE Gary, it’s Fred Weil. INTERCUT  INT. WEIL’S KITCHEN - PRE-DAWN 108   108  Weil sitting in his kitchen in the pre-dawn dark. In front of him are copies of the Post, L.A. Times and New York Times. WEIL Well, you did get far. (realizing; grim) You haven’t seen the east coast papers yet. WEBB It’s four a.m.. Big silent beat. The other shoe about to drop.  91.  KILL THE MESSENGER SALMON DRAFT-   7/16/13 WEIL I was you once, Gary. I started down this road, though nowhere near as far as you are. They tried to kill me. I didn’t tell you that part. My brakes failed. Brand new car. Imagine that. (then) Then they saw I wasn’t going to stop, so they ‘controversialized’ me. Do you have any idea what I’m talking about? WEBB No. WEIL They turn you into the story. You have a history of schizophrenia, you’re a liar, you’re a homo, you beat your dog, you fuck around on your wife, you’re a pedophile. It doesn’t matter if none of it’s true. The point is no one remembers what you found, they just remember you, and you’re nuts. You cease to exist. Out the window, the sky beginning to brighten. WEIL (CONT’D) They edited my testimony, Gary. WEBB I know. WEIL They cut the tape and rearrange it, and have me say any old thing they want. (then) WEIL (CONT’D) But this is why I called. I wanted to tell you something my father told me. He was an Air Force pilot, and when things got ugly for me he reminded me that you get the most flak when you’re right ov",
      "dialogue_count": 0,
      "word_count": 1958
    },
    {
      "scene_number": 13,
      "slugline": "INT/EXT. WEBB’S HOUSE - LIESEL CT. - DAY 115   115  Ian watches from the doorway as Anna gets into her car.   Gary   *  walks back up to the house. Stops in front of his son.   They   *  hold a long look.   *  IAN   *  (straight, undeterred)   *  What happened in Cleveland?   *  INT. WEBB’S HOUSE - GARAGE - LATER 116   116   *  They have set up two old Barcaloungers before the Triumph, as if for this purpose. Webb brings Ian a beer. They sit. WEBB There’s no such thing as a little mistake. One tiny tear in a parachute means you plunge to the earth. A pin-hole in a submarine can crush and sink you. You turn wrong, then you’re lost, you turn trying to get home, and sometimes you just get more and more lost and farther from home. IAN You sound like a writer. I’m asking my father what happened in Cleveland. WEBB I screwed up. IAN Who was it? WEBB A reporter in the newsroom. She was pretty and she fell in love with me. IAN What was her name? WEBB Why does that matter? IAN It matters to me.  101.  KILL THE MESSENGER TAN PAGES   8/05/13",
      "characters": [],
      "action_text": "WEBB Barbara. IAN Did you love her? WEBB No. IAN Did you love mom? WEBB I loved your mother. I love your mother. (Ian confused) I was lazy...and greedy. I was greedy. You always regret greed. Every time. IAN For how long? WEBB A year. IAN Dad.   (then) Which year? WEBB You were twelve. Ian starts to cry. WEBB (CONT’D) I broke it off. You and your mother were -- are -- my entire life-- IAN And then. Long pause. This part’s hard. Webb finishes his beer. WEBB She committed suicide. IAN (stunned) That’s really shitty.  102.  KILL THE MESSENGER SALMON DRAFT-   7/16/13 WEBB (struggling to keep his composure) Yes it was. IAN That’s why we’re here, in California? (Webb nods) You ran away. WEBB We needed a new start. IAN We were fine. We had friends. Grandpa and Grandma. Cleveland was fine. WEBB Well, it’s behind us now. IAN I’m disappointed in you. Mom’s amazing There it is. The deepest cut. From his son. WEBB I understand. Webb looks up. He hadn’t seen her-- Sue, in the doorway, or just outside it. Ian slips past her toward the house. SUE (brushes the boy’s shoulder) You okay, honey? IAN Fine. (he’s not; he goes in) She stands there staring at Webb for a beat. She then walks away.  103.  KILL THE MESSENGER SALMON DRAFT-   7/16/13",
      "dialogue_count": 0,
      "word_count": 426
    },
    {
      "scene_number": 14,
      "slugline": "INT. MERCURY NEWS NEWSROOM, SAN JOSE - DAY 117   117  Webb enters. Makes his ‘g’mornings’. Tight averted smiles. He crosses to the conference room. Other side of the glass wall, a big crew awaits: Ceppos, Anna, Yarnold, Krim,   *  Counsel. Two or three other SUITS we’ve never seen. Another REPORTER (PETE CAREY, 38). Eight in total.  INT. CONFERENCE ROOM - MERCURY NEWS, SAN JOSE - DAY 118   118  Webb enters, eyes on Anna. She looks away--   *  WEBB I think I have this figured out-- (clocks Carey; at first a smile, then a suspicion) Pete. When did you get in from Washington? ANNA   *  Just have a seat, Gary. Anna puts a cup of coffee in front of Webb. Webb sits. After   *  a beat of awkward silence: CEPPOS There’s no good way to say this, so I’m just going to say it. (then) We’ve made a difficult decision, Gary. We’re going to print an open letter saying mistakes were made. WEBB Anna, what’s he talking about?   *  She averts her eyes. KRIM We had Pete backtrack some of your leads. WEBB Why the hell didn’t you tell me? CEPPOS Everybody’s on the line, Gary.  104.  KILL THE MESSENGER TAN PAGES   8/05/13",
      "characters": [],
      "action_text": "YARNOLD We’re out of our comfort zone. WEBB Yeah, okay, I know. But why the hell didn’t you   just tell me ? Long beat. No one wants to say what’s next. KRIM We didn’t like some of what Pete came back with. (Webb waits) Some of your sources have changed their stories. WEBB I’m sure they did. KRIM They’re saying they never said what you have them saying. WEBB Yeah, that’s how they operate. KRIM “They”? WEBB The Agency. They deny.   Everything . Everyone who works with them   denies everything.  OUTSIDE COUNSEL Did you ever get an actual CIA operative on the record? WEBB What? No. (to Anna)   *  You know I didn’t. It’s impossible-- OUTSIDE COUNSEL Did you ever get   anyone   who works for the CIA on the record? WEBB Who is this guy? CEPPOS Outside counsel.  105.  KILL THE MESSENGER TAN PAGES   8/05/13 Webb pauses. Takes in the sudden change in air pressure. WEBB Then as long as we’re outside our comfort zone, let me remind you that the CIA doesn’t just use   *  people who work for the CIA. They   *  use people who   DO work   for the CIA,   *  Get the difference?   *  All seem embarrassed for Webb. OUTSIDE COUNSEL We don’t operate in a courtroom, or in absolutes, Gary. We operate in shades of grey. Everybody in this room is tried by the power of public opinion. WEBB I didn’t get that memo. I didn’t realize the truth is a shade of grey. OUTSIDE COUNSEL It’s not what you can prove; it’s what people say they remember. Your word against theirs. WEBB Against the word of an army of convicted felons and liars. CEPPOS Would have been nice if we had some innocent people on the record, Gary. Beat. Can’t deny it. He’s right. WEBB Call Norwin Meneses in Nicaragua. CAREY He said he never spoke to you. Webb, stunned, drifts into his seat.  106.  KILL THE MESSENGER IVORY PAGES   8/19/13 WEBB What are you talking about? I was down there for three days-- ANNA   *  I know you were in Managua, Gary-- WEBB It took me two days just to get inside that prison-- CAREY He said you never got i",
      "dialogue_count": 0,
      "word_count": 1370
    },
    {
      "scene_number": 15,
      "slugline": "INT. MERC BUREAU - STRIP MALL, CUPERTINO - TIME CUT A123   A123  Webb at his desk, on the phone. One of the reporters across from him plays a noisy annoying video game on his computer. WEBB (into phone) --Yeah, the Mercury-News. Look, I’m told the police department is having trouble keeping it’s troopers’ horses healthy-- (then) Well what I heard was bowel trouble -- constipation-- (reaches for a notepad) Is that the entire troop, or just a few horses in particular--?  INT. MOTEL ROOM - CUPERTINO - NIGHT 123   123  PAN THE WALLS Where Webb has reassembled the entire Dark Alliance story. And more. The massive jumbled wallpaper of notes - but tripled. Names, a dates, numbers. Webb on the bed. Has been on the phone. Dialing for dollars. A list of names before him. All but a few crossed out. He   *  dials a number. Recording -   this phone line has been   *  disconnected - beep beep -   and he hangs up. Dials another   *  line, checks his notes. The line rings and rings.   *  He gets up, walks to the wall. Moves a few cards around.  INT. MOTEL ROOM - CUPERTINO - ANOTHER NIGHT 124   124  Another night. An open bottle of wine sits to the side. Webb and Sue naked under the chintzy covers. He leans into her, kisses her neck. Nothing happens. Sue looks at him. They make a feeble attempt at foreplay. It’s not happening. A longer beat. Still nothing happens. WEBB I’m sorry. SUE About what?  112.  KILL THE MESSENGER SALMON DRAFT-   7/16/13",
      "characters": [],
      "action_text": "She gets up, wraps herself in a towel. She wanders to the wall. To his paper maze of connections and theories. It’s grown. Maybe by a third. She sees a PHOTO of CORAL BOCA next to RAFFIE CORNEJO. SUE (CONT’D) I thought it was horses. WEBB I filed a mesmerizing exclusive this morning about pot-hole fillage. She then sees the box. The one she gave him full of their family stuff. Tape still sealed. Unopened. SUE You didn’t even open it. WEBB Open what? SUE Didn’t even take us out of the box. Webb gets out of bed, walks to the wall. He looks at all of his work. WEBB (re: the story) I need more time. SUE And then what? WEBB And then it’s done. Sue sits down on the bed. SUE And then what? Long beat. WEBB I didn’t choose what’s happening.   *  I don’t want to be here. In this   *  shit place.  113.  KILL THE MESSENGER SALMON DRAFT-   7/16/13 SUE Do you remember the letter you wrote me when we first met? WEBB The one where I corrected your grammar. You hated that. SUE No. A sweet smile. Then -- SUE (CONT'D) It’s the one where you wrote --  “Words were created to tell of inner happenings, not feelings. What I feel for you is too important and delicate for words. A touch or a look between us is the only way to really know what’s true.”  She takes his hand. SUE (CONT'D) You were eighteen. We were eighteen. WEBB I remember. SUE You already knew what was true. (then) I just wanted you to want me as   *  much as you want all of that. (re: the story, Coral)   *  But I know it’s never going to   *  happen. Stop. There it is. SUE (CONT’D) You are who you always were, Gary. No blame. No judgement. It’s just a fact. (then) It’s me who changed. WEBB What are you saying?  114.  KILL THE MESSENGER SALMON DRAFT-   7/16/13 SUE I don’t know. WEBB Yes, you do. Then: SUE You’re right, I do. She gets dressed.  EXT. MOTEL - CUPERTINO - ANOTHER DAY 125   125  Now Webb’s motorcycle is parked next to his car. Webb is out   *  there cleaning it. More Christmas stuff. Tinsel.   *  INT. MOTEL ROOM - ",
      "dialogue_count": 0,
      "word_count": 3817
    }
  ]
}