{
  "slug": "kill-your-darlings-2013",
  "title": "kill your darlings",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 24,
  "characters_count": 0,
  "characters": [],
  "total_words": 17216,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. RIVERSIDE PARK - NIGHT  Underwater.  Shafts of eroded light slice into the depths of the Hudson  River. The ghostly melody of “Lili Marlene,” the ache of the  war-time lover, plays as a strange SHADOW drifts into view.  We realize it is a BODY.  ALLEN (V.O.)  Some things, once you’ve loved  them, become yours forever.  The body BREAKS the surface and we see the face of its owner  —— DAVID KAMMERER, 33, bearded, handsome. He is clothed, open  white shirt, khakis. Dead.  ALLEN (V.O.)  And if you try to let them go...  Suddenly, a breath:   he comes back to life .  David floats back to LUCIEN CARR, 20, (blonde, beautiful,  shirtless and terrified), waist deep in the water.  The scene is playing in REVERSE MOTION.  ALLEN (V.O.)  They only circle back and return to  you.  David’s body LIFTS into the young man's arms. We see David’s  feet and hands are TIED together with shoelaces. Stones rise  back into his pockets.  ALLEN (V.O.)  They become part of who you are...  A stain of blood on David’s chest shrinks, vanishes.  David’s eyes OPEN.  CUT TO:  INT. THE TOMBS - DAY  LUCIEN  ...or they destroy you.  From behind the bars of a jail cell, Lucien Carr (the young  man from the opening) finishes reading from a paper  MANUSCRIPT in his hand.",
      "characters": [],
      "action_text": "Lucien, furious, crumples it up.  LUCIEN  You can’t show this to anyone.  We PULL BACK to reveal the author of the manuscript: a  eighteen-year-old ALLEN GINSBERG. Unslept and exhausted. But  determined.  Allen stares defiantly at Lucien from the other side of the  bars.  ALLEN  Then tell the truth, Lu.  LUCIEN  You weren’t even there. It’s your  truth. It’s   fiction .  Allen grabs for his manuscript back, but Lucien pulls it out  of reach.  LUCIEN  You wanted him gone too. You sent  him to me.  Allen reaches through the bars and SNATCHES the paper.  Lucien won’t let go -- it’s a tug of war between the two  boys, two wills. Allen yanks the paper from Lucien’s grip and  wins. Lucien, panicking.  LUCIEN (CONT’D)  Please. You'll kill me with that.  Allen turns and races towards the exit of the prison.  Desperate, Lucien calls out after him.  LUCIEN  Allen! No!  Allen doesn’t turn. An alarm HAMMERS through the prison.  LUCIEN  Allen!   No!   DON’T...!  CUT TO BLACK.  INSERT TITLE: KILL YOUR DARLINGS  CUT TO:  2.",
      "dialogue_count": 0,
      "word_count": 390
    },
    {
      "scene_number": 2,
      "slugline": "EXT. GINSBERG HOME - NIGHT  SUPER: PATERSON, NEW JERSEY. 1943. ONE YEAR EARLIER.  Over a strip of working-class row homes, we hear the sounds  of a radio announcer giving a dispatch from the war front.  RADIO ANNOUNCER (V.O.)  American daylight bombers were busy  again, as our liberators with  fighter escort continue the air  offensive with another sock at  German coastal installations in  France.  INT. GINSBERG HOME - NIGHT  The radio continues playing to a modest home. We see a young  man cleaning house, sweeping in the background.  RADIO ANNOUNCER (V.O.)  But the Germans report a big new  red army push toward Romania. This  is World War news.  As the war report ends, a stuffy musical piece begins. We  hear a groan from the young man.  From out of the background emerges Allen Ginsberg (now 17,  fresh-faced, horn-rimmed glasses, dutiful son). The kind of  kid who takes care of everything.  He storms up to the radio, switches the station to a fast-  paced boogie-woogie number. He smiles and dances joyfully to  the up-beat number with his broom.  The door slams. Allen looks up, caught in the act, to see his  father LOUIS (40's, school teacher, Jewish working-class  poet) home from work. Allen accidentally drops the broom.  LOUIS  How was she today?  Louis turns off the music. The playful mood dies. Allen spots  the mail in his father’s hand.  ALLEN  Fine. Anything for me?  LOUIS  Why? You expecting something?  Allen looks down, a bad liar.  3.",
      "characters": [],
      "action_text": "ALLEN  No.  Suddenly, from upstairs, the sound of glass shattering. Then  a woman whimpering in pain. Allen, worried, looks off, dread  in his face. His father just sighs.  LOUIS  I told you it wouldn’t work.  Allen rushes upstairs.  INT. MASTER BEDROOM, GINSBERG HOME - NIGHT  Allen runs into a dark room, flips on the light.  ALLEN  Mom?  His mother NAOMI (early 40's, Jewish, deep personality  disorder) squats in the corner of the room, in a dirty  bathrobe. Her knuckles are bleeding.  NAOMI  You’ve got to get me out of here.  He nailed the windows shut while I  was in the bath.  She motions to the shattered window pane across the room.  Allen sees her blood on the sill, where she tried to escape.  He moves towards her, to console her. What he’s good at.  ALLEN  Dad didn’t do that. I nailed the  windows. Because you’re not right.  Naomi, in the midst of a paranoid attack, puts her finger to  her mouth.  NAOMI  Shhh...Allen. He can hear you!  Allen wraps his mother’s hand with a dish towel.  ALLEN  You have to rest. Clear your head.  Do you want to go back to  Greystone?  NAOMI  He wouldn’t dare put me back there.  4. ALLEN  Then listen to me.  NAOMI  SHHHH. He can hear you!  She’s losing it. Allen quickly thinks, turns to her bureau.  He pulls out a RECORD, starts the phonograph and turns up the  volume.  ALLEN  Can he still   hear me?  A BRAHMS WALTZ plays.  NAOMI  What did you say?  Allen turns the music up all the way. Allen mimes deafness.  Finally, she understands: their sounds are drowned out by the  music.  Allen reaches for her. She finally softens, takes his hand.  As mother and son   waltz   together with the music, Naomi  clutches Allen to her, like he’s the only thing keeping her  sane. Because he is.  NAOMI  Don’t ever leave me.  Allen, trapped, over her shoulder.  From the doorway, we see that Louis has been watching the  whole time.  EXT. GINSBERG FRONT PORCH - NIGHT  Overwhelmed, Allen shakes on the front stairs. She’s not  well. The faint sound of j",
      "dialogue_count": 0,
      "word_count": 1717
    },
    {
      "scene_number": 3,
      "slugline": "INT. LUCIEN CARR’S DORM ROOM - NIGHT  A mattress lies on the floor, a phonograph on top. Candles  light the room. Books for furniture. And Lucien on the floor,  reading the   Times   and smoking.  ALLEN  Brahms?  Allen walks inside. Lucien looks up, surprised.  LUCIEN  Finally. An oasis in this  wasteland.  Nervous, Allen tries to make conversation.  ALLEN  How come you're not at the social?  LUCIEN  Only the most anti-social have to  go to an event actually called one.  Libation?  Lucien rises and grabs a wine bottle corked with a sock.  Allen looks nervously towards the door.  ALLEN  You drink in your room?!  LUCIEN  How does a horrible bottle of  Chianti sound?  Lucien inverts two small glasses and pours. Allen stares. He  doesn’t break the rules.  ALLEN  I don’t drink.  LUCIEN  Freshman?  ALLEN  Yes.  Lucien hands him his glass.  LUCIEN  Excellent. I love first times. I  want my whole life to be composed  of them. Life is only interesting  if life is   wide .  12.",
      "characters": [],
      "action_text": "Lucien toasts Allen’s glass.  LUCIEN  To Walt Whitman, you dirty bastard.  Allen, mortified, not sure how to take that reference as  Lucien knocks his wine back in one gulp.  LUCIEN  How's your Yeats? Have you read   A  Vision ?  He tosses Allen a BOOK. Dog-eared, underlined and crumbling.  ALLEN  Never heard of it.  LUCIEN  It's completely brilliant and  impossible. He says life is round:  we're stuck on this wheel. Living.  And dying.  Allen opens the book, looks through the old pages, sees a  strange symbol: a diagram of a celestial WHEEL.  LUCIEN  An endless circle. Until. Someone  breaks it. You came in here, you  rupture the pattern. Bang: the  whole world...  ALLEN  Gets wider.   LUCIEN  Gets wider.  Lucien looks at Allen, amazed.  LUCIEN  How did you...?  ALLEN  Consonance. Reiteration of themes.  Lucien, intrigued, circles in close.  LUCIEN  Are you a writer? Because I’ve got  a job for a writer.  Allen, mesmerized.  ALLEN  No. I'm not.  13. LUCIEN  Well, you’re not anything yet.  This boy so close, the rush of contact. From down the hall...  HALL MONITOR (O.S.)  Ginsberg?!  Allen doesn’t even register his name. Lucien smirks.  LUCIEN  Isn't that you?  HALL MONITOR (O.S.)  Ginsberg?!  Allen groans, snaps out of it.  ALLEN  What?!  HALL MONITOR (O.S.)  Phone call!  Allen reluctantly hands Lucien back the BOOK.  ALLEN  I’ll be back.  INT. DORM HALLWAY - CONTINUOUS  The Hall Monitor hands Allen the phone.  ALLEN  Hello?  NAOMI (O.S.)  I found the wires.  INT. HALLWAY, GINSBERG HOME - NIGHT  Naomi grips the phone desperately. We see she has stripped  the wallpaper from the wall and pulled the telephone wire out  from underneath.  NAOMI  He’s trying to get inside my head.  ALLEN (O.S.)  Dad is not trying to get inside  your head, okay? Put him on.  14. NAOMI  He’s not home. He left.  INT. DORM HALLWAY - NIGHT  Allen, confused. Up the hallway, a door locks.  ALLEN  Where’d he go?  INT. GINSBERG HOME - NIGHT  Naomi looks out the window, does not want to answer.  N",
      "dialogue_count": 0,
      "word_count": 600
    },
    {
      "scene_number": 4,
      "slugline": "INT. GINSBERG HOME - NIGHT  Naomi, clutches the phone, deadly serious.  NAOMI  You need to promise.  INT. DORM HALLWAY - NIGHT  Lucien slides down the stairway rail. Allen watching him  disappear.  ALLEN  Yes. Ipromiseloveyoubye.  Allen hangs up on his mother and races after Lucien.  INT. STAIRWELL - NIGHT  Allen, breathless, storms down a flight of stairs, catches up  to Lucien. Lucien turns, loving this. The puppy following his  new master.  LUCIEN  Coming?  EXT. COLUMBIA ENTRANCE - NIGHT  Lucien throws his jacket over Allen’s shoulder and leads him  into the wild city around the corner.  LUCIEN  Welcome to the edge of the world.  The sound of the IRT screeching takes us to the SUBWAY MAP  from Allen’s dorm room which comes to life.  A RED LINE glides down the map from Columbia University all  the way...to Greenwich Village.  CUT TO:  INT. STAIRS/APARTMENT, 48 MORTON STREET - NIGHT  Allen, anxious, follows Lucien up a crowded staircase to a  West Village apartment.  The sounds of a party spill out onto the landing and beyond.  It’s pure bohemia here.  16.",
      "characters": [],
      "action_text": "Smoke, artists flirting, arguing. Allen sees...  A black man making out with a white woman. An older, elegant  woman sharing a cigarette with a boy half her age.  She stares seductively at Allen. Lucien enjoying himself  immensely. This is what a first time looks like.  LUCIEN  Allen in Wonderland.  Lucien grabs a DRUNK YOUNG GIRL from the crowd, kisses her  passionately. Then lets her go, keeps walking.  ALLEN  Do you know her?!  LUCIEN  No, and I don't plan on it. She  tasted like imported sophistication  and domestic cigarettes.  INT. BATHROOM, 48 MORTON APARTMENT - NIGHT  A makeshift bar in a sink full of ice. Lucien scavenges  through empty bottles in the sink, looking for any remaining  alcohol.  LUCIEN  (calling out)  Dave! Where’s the liquor?! I'll be  right back.  As Lucien walks off, Allen tries to make himself  inconspicuous and sits down on the tub.  BILL (O.S.)  Hrffrff hrffrfffrfrfrrf.  Allen looks down to see WILLIAM BURROUGHS (aka BILL, 29,  tall, gaunt, wry), in a suit, sprawled out in the bathtub: a  gas mask over his mouth. Bill motions to the side of the tub.  BILL  (through the mask)  You're...pinching...  Allen stands up, realizing his foot is on a snaking black  tube leading to a metal canister of gas.  ALLEN  Sorry. Are you all right?  17. BILL  (long exhale)  Artifacts in the visual field, some  light-headedness. Motor  hyperactivity.  ALLEN  What is that?  BILL  Nitrous oxide, for narcoanalysis.  Know thyself. And beshit thyself.  Ever done that?  Allen shakes his head no. Bill turns off the gas. Offers a  joint to Allen.  ALLEN  Oh no, thanks. I don't do...the  cannabis.  Bill eyes Allen, skeptically.  BILL  Show me the man both sober and  happy, and I'll show you the  crinkled anus of a lying asshole.  Allen raises an eyebrow. Lucien returns with a paper in hand.  LUCIEN  Allen, Willy. Willy, Allen, Lucien  reefer.  Lucien takes the joint.  Bill puts the tube of gas back in his mouth, back to  business. Lucien grabs Allen's hand, pulls hi",
      "dialogue_count": 0,
      "word_count": 1606
    },
    {
      "scene_number": 5,
      "slugline": "EXT. GINSBERG FRONT PORCH - NIGHT  Allen escapes outside where Lucien is sitting, smoking. Allen  sits beside him, notices: Lucien has been crying.  ALLEN  Complicated enough?  LUCIEN  At least you have her. My father  left me when I was four.  A beat of understanding between them. Lucien lays down. Allen  takes his cigarette, lays next to him.  ALLEN  I’ve been thinking about what Yeats  said. To be reborn, we have to die  first.  Allen hands him back the smoke. Lucien perks up.  LUCIEN  So what do you suggest?  INT. LUCIEN CARR’S DORM ROOM - NIGHT  Candlelight flickers on Allen's face.  ALLEN  I've spent my life making other  people happy.  We PULL BACK to see a noose around Allen's neck. A suicide is  underway.  ALLEN  It's time I find happiness the only  way I see possible.  LUCIEN (O.S.)  Oh please. Die already.  We PULL BACK again to see Lucien beside, also with a noose  around his neck. Both of them on chairs. Their nooses are  attached to the same pipe.  LUCIEN  Where's the verve? The brio?!  From atop the chair, Lucien kicks his record player with his  foot. Grand classical music screeches to a start.  26.",
      "characters": [],
      "action_text": "LUCIEN  If it be that I am indulging my  self-consciousness in justifying  myself, or if it be--  ALLEN  That's a run-on.  LUCIEN  Don’t edit me!  Lucien shoves Allen. Allen trips off the chair, the noose  snaps tight...and suddenly he’s hanging in mid-air. He  struggles. Lucien tries to help, but falls off his own chair.  The pipe starts to bend.  Allen and Lucien panic as they swing through the room,  suspended in air.  The pipe BREAKS. They crash to the ground.  A beat of relief -- are we alive? -- and the two break out  into hysterics.  DIRTY BE-BOP JAZZ PLAYS OVER...  A RED LINE TRAVELS   UP   THE SUBWAY MAP FROM COLUMBIA UNIVERSITY  TO HARLEM BRINGING US TO...  INT. HARLEM NIGHTCLUB (MINTON’S PLAYHOUSE) - NIGHT  The black crowd claps for the same jazz singer and band we  saw earlier, now on their home turf. Allen, Lucien and Bill  watch from a table.  ALLEN (O.S.)  The New Vision declares--  LUCIEN (O.S.)  “Proclaims” is better--  INT. DAVID’S APARTMENT (48 MORTON) - DAY  Lucien and Allen pace while Bill reclines on the sofa. They  riff on the   The New Vision   manifesto.  ALLEN  Proclaims   the death of morality.  And...  27. LUCIEN  The expression of self.  ALLEN  The true, uninhibited, uncensored  expression of the self.  BILL  Words, boys. Empty words.  LUCIEN  Then what do you suggest?  BILL  The derangement of the senses.  CUT TO:  INT. JAZZ CLUB - NIGHT  Allen bopping his head to the new rhythms in this club - the  place where be-bop jazz is being born.  CUT TO:  INT. 48 MORTON APARTMENT - DAY  Bill cracking open a Benzedrine canister and removing the  soaking strip from inside.  He drops it into three coffee cups. The boys knock it back,  Lucien pushing Allen to finish the whole drink.  CUT TO:  INT. DORM - DAY  Allen furiously typing up the manifesto at his school desk.  BILL (O.S.)  What do you hate from the pit of  your gut?  INT. 48 MORTON APARTMENT - DAY  Allen, Lucien pacing with increasing excitement.  LUCIEN  Institutions.  28. ALLEN  Paterson",
      "dialogue_count": 0,
      "word_count": 651
    },
    {
      "scene_number": 6,
      "slugline": "INT. 48 MORTON APARTMENT - DAY  Allen stopping Lucien in his tracks.  ALLEN  Really?  LUCIEN  It’s how we make the world wider.  Allen considers, agrees.  ALLEN  You are an extraordinary man.  Lucien beams.  LUCIEN  Well, thank you.  INT. 48 MORTON APARTMENT - AN HOUR LATER  Bill at David’s bookcase, removing classic art and literature  books and throwing them to Allen.  BILL (O.S.)  “Return of the Native.”  “Leviathan.” Tear ‘em up boys.  Destroy the old and build the new!  Allen, with scissors, cuts up pages of the books. Hands them  to Lucien who nails them to the wall.  It’s a frantic assembly-line: Bill whips books to Allen,  Allen tears out sections, and Lucien hammers them up.  We PULL BACK to see the entire wall is   covered in words .  INT. HARLEM NIGHTCLUB - NIGHT  Time suddenly slows. The music tapers, the hands of the  drummer taper down to a still. Allen looks around, scared and  confused. What is happening?  A spotlight cuts through the room, capturing the singer’s  sweaty ecstasy, the bassist’s fingers mid-plucking. The room  freezes.  Unlit cigarette dangling from his lip, Allen turns to Bill.  30.",
      "characters": [],
      "action_text": "Bill holds up his finger - it is on fire. He lights Allen’s  cigarette with the flame. We have entered into another  universe.  Lucien stands -- the only thing moving -- and Allen follows.  He steps into the frozen moment. And it’s beautiful.  LUCIEN  Watch this.  Lucien leans over a young woman, a statue at a table with a  young man in military attire.  LUCIEN  (whispered in her ear)  Go .  The girl comes to life and clambers over the young man to a  second, more attractive soldier. And kisses him. The pair  erupt into life, into desire.  Lucien and Allen sit on the stage beneath the frozen  musicians. Lucien pulls out a BOY SCOUT KNIFE.  Wraps Allen's hand in a fist around the blade.  He pulls the knife free. Allen winces in pain.  Lucien does the same to his own palm, then presses their two  bloody hands together. A ceremony. Allen's eyes roll back.  David appears in a janitor uniform. The Technicolor fades.  DAVID  What the hell is this?  CUT TO:  INT. 48 MORTON APARTMENT - NIGHT  Allen, the nitrous oxide mask over his face inhaling from a  tank of gas. He has been   adrift   in a hallucination.  Lucien presses Allen’s hand back and forth, both unharmed.  BILL  Time slows down as you drift deeper  and deeper into your cave...  Bill notices David, turns off the gas.  31. BILL  We are exploring the avenues of  Allen’s mind.  David looks around the mess of his living room, his pillaged  library of books, papers all over the floor.  DAVID  Dimly-lit, I am sure. What have you  done   to my apartment?  Allen struggles to his feet, moaning. Lucien steps between  David and their wall of clippings.  LUCIEN  David, don't touch anything. We  have to write it all down.  Bill stands up, woozy. Calls out to David.  BILL  Get this man a pair of scissors!  DAVID  This is not your revolution, this  is my life.  BILL  What kind of life is it?  DAVID  It’s mine. Not everyone gets an  allowance.  (beat)  Leave. Get out!  Allen stumbles out of the room, scared. David approaches  Luc",
      "dialogue_count": 0,
      "word_count": 2859
    },
    {
      "scene_number": 7,
      "slugline": "INT. COLUMBIA DEAN’S OFFICE - DAY  Lucien in a leather-backed chair. The DEAN (40’s, sardonic)  overlooks Lucien’s record. Lucien’s mother, MARION CARR, a  fallen matriarch, smokes with dispassion.  DEAN  Your attendance record here is  abominable. You've ignored curfew.  Your papers, when you bother to  turn them in, exceed the assigned  page limit. Can you explain why  you’re at Columbia?  LUCIEN  Same reason you’re here.  DEAN  What’s that?  LUCIEN  Loose Barnard girls.  Marion Carr looks at the Dean with a weary smile.  DEAN  I know about your difficulties.  About what happened in Chicago.  A pale comes over Lucien’s face. Which becomes absolute fury.  LUCIEN  (to Marion)  You told him?!  MARION CARR  He’s not the enemy.  DEAN  See, the University acts in loco  parentis. You are our  responsibility. We’re trying to  find someway to make this all work.  Lucien EXPLODES.  LUCIEN  Who said anybody could know  anything about anything?!  MARION CARR  Lucien, your temper!  47.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 154
    },
    {
      "scene_number": 8,
      "slugline": "INT. HALLWAY, OUTSIDE COLUMBIA DEAN’S OFFICE - DAY  Allen sits back as he hears someone approaching.  Louis Ginsberg rounds the corner with an unfamiliar woman.  LOUIS (O.S.)  Allen? What the hell is going on?  ALLEN  Who’s she?  The woman, EDITH (early 30s, Jewish, shy), waves nervously.  EDITH  Hi. I’m Edith Cohen.  ALLEN  What’s she doing here?  EDITH  I’ll go wait outside.  Edith exits down the stairs.  ALLEN  (smirks)  So that’s why you locked mom up.  Louis SLAPS his son.  Lucien storms out of the Dean’s office, followed by Marion,  putting on her fur coat. Marion inspects her son’s new  accomplice then races after her son. Louis motions to Lucien.  LOUIS  Did   he   put you up to this?  Allen stares down his father. Gathering courage to defy him.  ALLEN  No. I stole the boat. And it was  tremendous.  EXT. SEMINARY GARDENS - NIGHT  In the quiet, Lucien smokes and stares up -- he looks  ravaged. A suitcase beside him.  Allen approaches, surprised.  ALLEN  Where are you going?  48.",
      "characters": [],
      "action_text": "LUCIEN  You know me now. I'm only good at  beginnings.  ALLEN  You’re dropping out?  LUCIEN  Best of luck.  Allen GRABS Lucien’s suitcase and sits beside Lucien. This  explodes out of him.  ALLEN  My father shows up yesterday with  some new woman. And in the middle  of the Allen’s-a-screw-up  monologue, all of a sudden, I  realize: I don’t care. I’ve never  not cared. So, I told them it was  my idea. To steal the boat.  LUCIEN  Why?  ALLEN  Because I don’t want to be the  person they think I am. I’m on  academic probation. I could be  kicked out. You can’t leave. You  started something and I have no  idea what I’m supposed to do next.  Lucien, moved.  ALLEN  It’s our turn. Let’s show them what  we can do.  At the thought of payback, Lucien awakens. Allen grins.  ALLEN  You in?  INT. LIBRARY, MAIN HALL - DAY  A hard STAMP on a library request: RESTRICTED.  PERMISSIONS LIBRARIAN  You must not drink while you’re  handling it. And no writing in it.  49. Allen, Lucien, Jack and Bill spy on the PERMISSIONS LIBRARIAN  and a female PAGE at the main desk. The librarian places a  KEY RING in a drawer.  PERMISSIONS LIBRARIAN  It must come back exactly as you  found it.  The Permissions Librarian heads off. Seeing the young page  alone, Jack tucks in his shirt, SLICKS his hair down. Jabs a  piece of gum from his mouth into Lucien’s palm.  JACK  No telling Edie, got it?  Jack strolls up to the desk. Winks at the page.  JACK  I see you checking out all these  books. And I’m asking myself: do  you ever get checked out?  She radiates. Bill looks at his watch.  BILL  25 seconds. Masterful.  But then, another page, GWENDOLYN (20, sweet and saucy),  joins the first.  LUCIEN  Damn! Shift’s over.  Jack looks back, shrugs as he walks off with the first page.  Lucien groans, plan's 86'd. But Allen sits up.  ALLEN  I'll go.  INT. PERMISSIONS DESK, LIBRARY, MAIN HALL - DAY  Allen walks up to the desk.  ALLEN  Hi.  Gwendolyn looks up. Allen is smiling nervously.  ALLEN  I wondered if you cou",
      "dialogue_count": 0,
      "word_count": 841
    },
    {
      "scene_number": 9,
      "slugline": "INT. ROW, LIBRARY STACKS - CONTINUOUS  Lucien hands the keys to Bill. Bill PLACES it into a clay  molding and makes an impression.  GWENDOLYN (O.S.)  No. Why don’t you take it off?  INT. STACKS, LIBRARY - CONTINUOUS  Allen takes off her sweater. Gwendolyn, just in a bra. This  is as close as Allen has ever come to sex. He’s breathless.  GWENDOLYN  It's not like I'm a virgin. I've  done it with three guys already.  You're a virgin, huh?  She KISSES him. Cold lips. He’s terrified.  GWENDOLYN  You’re kind of a virgin, though,  huh?  ALLEN  No.  GWENDOLYN  Liar. If you have done it before,  you'll last for thirty seconds.  Start counting.  She opens his fly, then lowers herself down. Allen tries to  stop her, but it's too late. He sighs.  ALLEN  1...2...  Lucien returns and see Allen reluctantly getting his first  blowjob. Lucien leans against the books and watches.  ALLEN  3...4...  Lucien flashes Allen a wicked grin.  ALLEN  5...6...  Over Gwendolyn's head, Allen watches Lucien staring at him.  He starts to get aroused.  53.",
      "characters": [],
      "action_text": "ALLEN  7...8...9...  Allen and Lucien holding eye contact, Allen thrusts into her  mouth, comes. Gwendolyn rises back up, unimpressed, drops her  sweater.  GWENDOLYN  I knew it.  She grabs the KEYS that are now back on the shelf. Allen  looks to find Lucien. But he is   gone .  GWENDOLYN  I bet you don’t even read.  Gwendolyn walks off. Allen lifts his pants, ties his belt.  ALLEN  I do.  EXT. COLUMBIA LIBRARY - NIGHT  Shots of the darkened church-like building. Deserted.  Timeless.  LUCIEN (O.S.)  This is it guys. Our Bastille. No  chickening out.  INT. CARD CATALOGUE AREA, LIBRARY - NIGHT  The light from the boys’ flashlights SLICES through the dark  as they enter into the library through a heavy door.  Bill reaches into Jack’s mouth and takes the chewing gum from  inside it. Jack shoots a glare at him - what the hell?  Bill presses the sticky gum into the strike plate of the door  -- blocking the door from being able to close shut.  The boys look at each other, give each other the silent nod,  then split -- Lucien and Jack sneak off to the main hall,  Bill and Allen up to the stacks.  Behind them, the chewing gum slips, falls from the strike  plate. The door shuts.  And LOCKS.  54.",
      "dialogue_count": 0,
      "word_count": 385
    },
    {
      "scene_number": 10,
      "slugline": "INT. STACKS - NIGHT  Outside a gated “RESTRICTED ACCESS” room, Bill grabs the  padded LOCK and fits in his molded KEY. Allen watches as he  turns it...  The lock CLICKS open.  INT. LIBRARY, MAIN HALL - NIGHT  Jack and Lucien unscrew the glass from the VITRINES encasing  the historic books and manuscripts we saw earlier.  EXT. LIBRARY - NIGHT  Walking into the light of the street lamp outside the library  is   David . He approaches two campus security GUARDS on the  night patrol.  DAVID  Excuse me. I think I saw some light  or movement in the library.  The security guards FLASH their lights at the facade.  INT. RESTRICTED ACCESS ROOM - NIGHT  Bill throws open the metal gate between them and the  restricted books inside.  An ALARM explodes into the quiet.  Bill and Allen look at each other: this was unexpected.  INT. LIBRARY, MAIN HALL - NIGHT  Jack and Lucien jolt as the alarm goes off, look up from the  vitrines to each other. What is going on up there?  EXT. LIBRARY - NIGHT  The guards hear the alarm coming from inside the library.  They race to unlock the CHAIN holding the doors locked  together.  55.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 197
    },
    {
      "scene_number": 11,
      "slugline": "INT. RESTRICTED ACCESS ROOM - NIGHT  Bill rushes past the gate, shines his flashlight searching  the books until he finds a box marked RESTRICTED CONTENT.  He empties it, tossing the books to Allen. We’ve seen this  move before.  INT. LIBRARY, MAIN HALL - NIGHT  Allen, carrying the restricted books, runs up to Jack and  Lucien at the vitrines which are now wide open and empty.  JACK  (whispered)  What just happened?  Jack and Lucien grab the books from Allen and start to set  them in the cases. The alarm suddenly STOPS.  SECURITY GUARD (O.S.)  We know you’re here!  The footsteps of the guards approach. Game over. Their work  not done, the boys RACE back to the door they came through.  All EXCEPT LUCIEN. He ducks behind the vitrine, hiding. He  clicks off his flashlight.  The guards ENTER the main hall, searching for the culprits.  INT. CARD CATALOGUE AREA - CONTINUOUS  Allen, Jack and Bill reach the closed door. They can’t open  it.  JACK  What the hell, Bill? It’s locked!  No way out. Allen turns, notices Lucien is missing.  INT. LIBRARY, MAIN HALL - CONTINUOUS  The guards step right past Lucien and STOP. Lucien ducks,  rounds to the side of the case.  GUARD  Did you hear that?  56.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 207
    },
    {
      "scene_number": 12,
      "slugline": "INT. CARD CATALOGUE AREA - CONTINUOUS  Bill, Jack and Allen slide along the wall of card catalogs,  back to the main hall looking for another exit.  Through the arch leading inside, they can see the guards  canvasing the room with flashlights.  SECURITY GUARD  We know you’re here!  SECURITY GUARD #2  Come on out!  Across the room, Bill spots TWO GLASS DOORS leading out to a  balcony. He points at the doors.  Jack WHIPS his flashlight in a tremendous arc to another  room. It clatters noisily, a distraction.  It works. The guards CHASE after the noise.  Jack, Bill, Allen BOLT to the glass doors. They throw them  wide open. Allen is about to leave, but stops Jack.  ALLEN  Wait. Lucien.  Allen turns and sees Lucien, still furiously working, books  under his arm.  Jack shakes his head, follows Bill and races out the door.  Alone, Allen RUNS back to Lucien who is madly placing the  books in the vitrines. He is a man possessed.  ALLEN  Lu that’s enough. Come on! What’s  wrong with you?  LUCIEN  (deadly serious)  No. Not yet, we have to finish.  A FLASHLIGHT finds them. Allen and Lucien, caught. The guards  pull out BILLY CLUBS.  SECURITY GUARD  Don’t move. It’s over.  The guards GRAB Lucien. Drag him by the collar. But Allen  flees, breaks free. Lucien struggles, enraged.  LUCIEN  Get off of me! Allen! Help!  57.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 228
    },
    {
      "scene_number": 13,
      "slugline": "INT. CARD CATALOGUE AREA - CONTINUOUS  Allen stops, terrified. He sees: a   console   of switches on the  wall. Desperate, he reaches for them. Flips them all on.  INT. LIBRARY, MAIN HALL - CONTINUOUS  All the lights in the whole library come on at once. A  BLINDING flash.  The guards squint and look for Allen.  INT. CARD CATALOGUE AREA - CONTINUOUS  Allen THROWS down all the switches.  INT. LIBRARY, MAIN HALL - CONTINUOUS  The room PLUNGES into complete darkness.  Lucien realizes: this is his moment.  He wriggles out of his coat and RUNS. Allen JOINS him and the  two, reunited, run around the corner.  The guards give chase.  INT. ENTRANCE FOYER - CONTINUOUS  Allen and Lucien race into the vestibule between the doors  leading out to the city -- and the doors back into the  library.  Lucien presses against the exit doors: they’re locked.  The GUARDS turn the corner, see the boys stuck between the  two sets of doors.  Allen blocks the library doors with his shoulder. The guards  POUND on the door.  A SOUND from outside: the padlock unlocking. Suddenly: the  exit door opens. It’s Jack and Bill, with lock-picking gear  in hand.  They YANK Allen and Lucien out.  58.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 201
    },
    {
      "scene_number": 14,
      "slugline": "EXT. LIBRARY - NIGHT  Jack slams the door, Bill runs the chain back through the  handle and LOCKS it.  The door BULGES as the guards bang into it.  SECURITY GUARD  Open the goddamn door! Open this  up!  The boys turn and RUN down the grand steps leading back to  the campus. Glee on their faces.  CUT TO:  EXT. LIBRARY - DAY  The same grand steps the next morning. Students walking up  and down it to class, socializing, as if nothing happened  there the night before.  INT. LIBRARY, MAIN HALL - DAY  Inside, the pompous TOUR GUIDE from earlier showing off the  vitrines to a new crowd of parents and incoming students.  TOUR GUIDE  The South Hall library is a church,  and these are the sacraments.  The crowd mumbles, then laughs. The guide, confused, looks  inside them to see the   Kama Sutra   opened up to a particularly  salacious page.  The explicit images from a Grecian urn.  Lady Chatterly’s Lover ,   Ulysses , all the books banned,  restricted, kept from public eye.  And lastly:   Tropic of Cancer . By Henry Miller.  The prisoners have come out to play.  TOUR GUIDE  Oh. My. God.  And a note, left on the glass: \" The New Vision .\"  59.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 205
    },
    {
      "scene_number": 15,
      "slugline": "INT. WEST END BAR - DAY  Four shot glasses. Four hands.  LUCIEN  To literacy.  Allen, Bill, Jack and Lucien throw back their drinks in  celebration.  The Mills Brothers   \"You Always Hurt The One You Love\"   on the  jukebox plays over this lazy, drunken afternoon.  Allen’s eyes scan the wall above them, Columbia’s “Hall of  Fame”: newspaper headlines, yearbook photos...  ALLEN  Jack, that’s you, isn’t it?  He sees a framed photo of Jack in a football play, mid-catch.  JACK  Yep. Last year. They still won.  LUCIEN  Look at them!  And we do: we see FLASHES of the photos: ribbon-cuttings,  team-photos, graduations: life in a thousand fake smiles and  stagings.  LUCIEN  Souvenir history. To make people  think they left some mark on the  world. Because otherwise nobody  would ever know.  (beat)  I don’t   ever   want to end up on this  wall.  JACK  Have no fear. You never will.  Suddenly,   David   appears in the bar. The group looks at each  other, mystified.  ALLEN  What’s he doing here?  David walks briskly over to Lucien.  DAVID  Since you didn't show up earlier, I  just hoped to give you this.  60.",
      "characters": [],
      "action_text": "David drops a TERM PAPER on the table: “On the Decline of the  West.”   Allen leans over the table, inserting himself into  the conversation.  ALLEN  Maybe he didn't want to see you.  DAVID  I think he can speak for himself.  LUCIEN  Yup. And he says we should all have  another round...  Lucien stands up to get a drink. David grabs his arm. Lucien  tries to push him off.  DAVID  You've had plenty of time to  celebrate. Your library hijink made  the morning paper. I'm sure you're  all very proud.  Allen, Jack and Bill glance at each other suspiciously, then  at David.  ALLEN  How did you know it was us?  DAVID  Did he use that \"Bastille\" line?  Cause I gave it to him.  Allen, Jack and Bill look at Lucien, shocked.  LUCIEN  I haven't seen you for days.  David throws down Lucien’s cravat to the table. The one we  remember him wearing when we first met him in the library. A  private power move.  DAVID  You left this at my place.  ALLEN  (to David, a guess)  You told the guards we were there.  No one else knew.  David does not respond. Jack suddenly jolts up. Shoves David  back.  61. JACK  You little fink!  Lucien explodes at David.  LUCIEN  You wanted me to get kicked out?!  You ratted on me!  DAVID  Stop, Lu. You’re losing control  again. You know what comes next. I  know what comes next.  ALLEN  Yeah.  (to Lucien)  Cut him off.  Lucien gives David a fatal look.  LUCIEN  Best of luck, Janitor.  DAVID  Excuse me?  LUCIEN  We are over.   Leave .  Lucien spindles the paper and plunges it into a beer. David  in shock, begins to shatter in front of them.  DAVID  Look at me, Lu.  Tears well in David’s eyes. Lucien sits back down, ignores  him. Bill stands up, tries to lead David away.  BILL  Let's go.  DAVID  (from his wound, breaking)  You said I was everything to you.  You   are   everything to me.  Everything to me. Do you hear me?  David fractures. Utterly vulnerable. This is it: the real  uninhibited, uncensored self.  BILL  Let’s go. Time and place, David.  62. DAVID  ",
      "dialogue_count": 0,
      "word_count": 2176
    },
    {
      "scene_number": 16,
      "slugline": "INT. TAVERN - NIGHT  Allen sees a young man in a Merchant Marine outfit, blond,  the bar lamps casting a golden halo around his head. Could it  be?  ALLEN  Lu?  Allen races to him. The man turns and Allen’s heart sinks. It  is a SAILOR, a distant echo of Lucien.  The Sailor eyes Allen gently, seductively.  Allen walks up to him.  INT. 118TH STREET APARTMENT - NIGHT  Edie breaks the embrace.  EDIE  This came for you today.  She hands Jack a package from the mail. A new record.  JACK  Sammy...  Jack places it on the record player and listens, clutching  Edie. He knows immediately there won’t be another record.  SAMMY (V.O.)  Jack, old chum. I'm on a hospital  ship now. My guts all tore up.  INT. CRAPPY HOTEL, 42ND STREET - NIGHT  Allen undresses, terrified, as the sailor does the same.  SAMMY (V.O.)  Anzio’s going to be the last place  I ever see with my eyes .  INT. BILL’S APARTMENT - NIGHT  Bill with Norman, his dealer, in his apartment. Norman  injects himself with a morphine syrette. Bill watches,  fascinated.  72.",
      "characters": [],
      "action_text": "SAMMY (V.O.)  A mortar round came and found me in  my tent.  Norman offers the box of morphine to Bill. Bill handles it.  Considering.  EXT. RIVERSIDE PARK - NIGHT  Lucien walks, guzzles from his flask. David follows. They are  visibly arguing.  SAMMY (V.O.)  I can feel metal under my skin some  places. Some went clean through.  INT. 118TH STREET APARTMENT - NIGHT  Jack continues to listen to Sammy, his heart sinking. He  knows this is headed to a dark place.  SAMMY (V.O.)  They’re not even trying to take it  out no more.  INT. CRAPPY HOTEL, 42ND STREET - NIGHT  Allen’s heart in his throat as he steps out of his pants. He  is nearly naked. Vulnerable.  EXT. RIVERSIDE PARK - NIGHT  Lucien throws his flask into the woods, LASHES out at David.  INT. BILL’S APARTMENT - NIGHT  Bill injects the syrette into his wrist. And presses the  oblivion in.  SAMMY (V.O.)  The nurses gave me the same  morphine I gave to dying boys...  INT. CRAPPY HOTEL, 42ND STREET - NIGHT  Allen, naked, lays on the bed. He turns off the light.  73. SAMMY (V.O.)  ...when I didn’t know what else to  do.  The sailor climbs on top of Allen, turns it back on.  EXT. RIVERSIDE PARK - NIGHT  David LUNGES for Lucien and Lucien throws him off, spins  away.  He pulls out his Boy Scout knife.  David stares at Lucien, stunned.  INT. CRAPPY HOTEL, 42ND STREET - NIGHT  Allen turns to face the sailor. Looks him in the eye.  SAMMY (V.O.)  Wake, melancholy mother. Wake and  weep.  Allen reaches to kiss the sailor.  EXT. RIVERSIDE PARK - NIGHT  Lucien STABS David, plunges the blade into his chest.  INT. CRAPPY HOTEL, 42ND STREET - NIGHT  The sailor enters Allen.  INT. BILL’S APARTMENT - NIGHT  Bill drifts backwards, into the high.  SAMMY (V.O.)  Quench within thy burning bed, thy  fiery tears.  EXT. RIVERSIDE PARK - NIGHT  David looks up from his chest. Blood pumps from the gash.  David, clutching his shirt, his chest...  74.",
      "dialogue_count": 0,
      "word_count": 514
    },
    {
      "scene_number": 17,
      "slugline": "INT. 118TH STREET APARTMENT - NIGHT  SAMMY (V.O.)  And let thy loud heart keep--  The record runs out, the stylus scratches. Jack, trembling.  EDIE  What is that?  JACK  It’s Shelley’s elegy for Keats.  EDIE  What’s that mean?  JACK  It means he’s dead.  FADE TO BLACK.  INT. GROUP SHOWERS, SEMINARY - THE MORNING AFTER  FADE UP ON: Allen, alone in the shower. He’s completely  blank, eyes on the tile.  Realizing what he did the night before and how it felt so  natural -- now he knows exactly who he is.  INT. DORM HALLWAY - DAY  Allen steps out in a bathrobe, to see a POLICEMAN and a  DETECTIVE whispering outside Lucien’s room.  POLICEMAN  He didn’t come back here  afterwards. Nobody on the floor  saw.  They stare at Allen, studying him. Other students whisper.  POLICEMAN  We have two in custody. We’re still  getting names.  Allen   makes his way down the hall. Custody? What happened to  Lucien?  DETECTIVE  So what do we know about this Carr  kid? Did we have any friends? We’re  gonna have to speak to all of them.  75.",
      "characters": [],
      "action_text": "Allen looks down and races to the hallway phone.  INT. SCHOOL HALLWAY - DAY  Allen dials a number. Nervous. Edie picks up.  ALLEN  Edie? Is Jack there?  EDIE (O.S.)  You don't know?  ALLEN  Know what?  INT. 118TH STREET APARTMENT - DAY  Edie searches for the words.  EDIE  The police took him down to the  Tombs. As an accessory. Bill too.  ALLEN (O.S.)  What happened?  Edie shocked, unable to speak.  CUT TO:  INT. THE TOMBS - DAY  The BLARE of a prison horn. A guard opens a heavy gate and  Allen walks onto the hall of cells. It’s a long, dank walk.  Allen spots Lucien in a small unremarkable cell, behind bars,  reading. Allen can’t believe he’s here.  Lucien sits up from his cot and rushes to the bars.  LUCIEN  Allen, thank God.  Allen’s skeptical face makes Lucien change tactics.  ALLEN  How could you?  LUCIEN  He wanted to hurt me, I had no  choice.  76. ALLEN  You could have run. Called the  police.  Lucien looks Allen fiercely in the eye.  LUCIEN  Listen. Somehow he found me at the  Marine Hall.  Allen looks away, realizing he is potentially complicit.  LUCIEN  He said no matter where I went, he  would follow. When I confronted  him, he exploded. I had to defend  myself. He wouldn’t stop.  ALLEN  But how did Jack and Bill get roped  into this?  CUT TO:  EXT. HARLEM SIDEWALK - DAWN  Lucien drops the bloody Boy Scout knife down a grate. Jack  stands guard.  LUCIEN (O.S.)  I went to Jack first. He told me to  get rid of the knife. To forget the  whole thing.  They hear footsteps and turn. A black woman watches them  suspiciously.  INT. BILL’S APARTMENT - DAY  LUCIEN (O.S.)  But then I went to Bill. He told me  to get a lawyer.  Bill fingering David’s pack of Lucky Strikes in his bathroom.  David’s blood on his hand.  LUCIEN (O.S.)  To say it was an act of self-  defense.  Lucien watches Bill light one of the bloody cigarettes and  inhale. The last flare of his friend.  77. Bill flushes the rest of the pack down the toilet.  CUT BACK TO:  INT. TOMBS - DAY  Lucien, de",
      "dialogue_count": 0,
      "word_count": 1117
    },
    {
      "scene_number": 18,
      "slugline": "INT. BURROUGHS’S APARTMENT (69 BEDFORD) - NIGHT  The zip of a suitcase. Bill, undoing his den, packing away  clothes, books. He’s also leaving town. Allen’s come for  answers —- from the only person who knew the real David.  BILL  Contrary to reports, prison is not  a tonic for the spirit.  We are now realizing it’s the end of a chapter for all of  them.  BILL  All the district attorney cared  about was if David was queer.  Allen gulps. The heart of the issue, thrust into the light.  ALLEN  And what did you tell them?  Bill sees the box of morphine from his night with Norman. He  decides to take it with him, hides it under a pile of shirts.  BILL  I said yes.  ALLEN  Did David do something Lu in  Chicago?  BILL  Christ Allen, please don’t get  involved.  ALLEN  I have to be. I’m helping him write  his defense.  Bill paces, then turns to face Allen.  BILL  David was my friend. But he’s dead.  And did Lucien tell you how he  died?  Allen shakes his head. He has no idea.  CUT TO:  81.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 184
    },
    {
      "scene_number": 19,
      "slugline": "EXT. RIVERSIDE PARK - NIGHT (FLASHBACK)  The moment right after Lucien stabbed David. What we have not  seen yet. The story continues.  David trembles on the ground, bleeding from the knife would.  Lucien stands above, realizing what just happened.  Car headlamps swipe across Lucien’s face. Terrified, Lucien  scans the park for witnesses.  BILL (O.S.)  He might not have wanted you to  know, Allen. He tied David up.  Lucien DRAGS David’s body from the park under a railing to  the shoreline.  He unties his shoes, LASHES David’s hands together with the  shoelaces. Ties them tight.  David groans and gurgles blood. Still very much ALIVE.  Lucien rustles through David’s pockets -- pulls out anything  side. He tosses David’s pack of Lucky Strike cigarettes, now  speckled with blood - to the sand.  Lucien collects stones from the riverbank, STUFFS them into  David’s pockets.  BILL (O.S.)  He put stones in his pockets to  weigh him down.  Lucien panics, looks around. He takes off his Merchant Marine  clothes. Fully naked, he drags a bound David into the dark  waters of the Hudson River.  David moans and struggles but is no match for Lucien.  BILL (O.S.)  And dragged him into the Hudson  River.  ALLEN (O.S.)  What?!  BILL (O.S.)  David was alive, Allen, until  Lucien made him drown.  The sound of a door slamming open brings us...  BACK TO SCENE  82.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 225
    },
    {
      "scene_number": 20,
      "slugline": "INT. BILL’S APARTMENT - NIGHT  MR. BURROUGHS (60s, patrician, wealthy), Bill’s father enters  his son’s apartment, causing Bill to stop telling the story.  Mr. Burroughs eyes Allen suspiciously.  MR. BURROUGHS  Who are you? Is he part of this  business.  BILL  Leave him alone, Dad.  MR. BURROUGHS  I paid your bail. Don’t talk to me  like that.  Bill looks down, obedient. The rebel silenced by his father.  BILL  Yes, sir.  MR. BURROUGHS  The car leaves in five minutes.  As Mr. Burroughs exits, Bill furiously SLAMS his suitcase  closed.  BILL  The libertine circle has come to an  end.  Allen looks at Bill, lost at what to do next. Bill leans in  close.  BILL  Go back to the beginning.  THE RED LINE LEADS US, ONCE MORE, DOWN THE SUBWAY MAP FROM  COLUMBIA...  TO THE EDGE OF THE WORLD. WHERE IT ALL STARTED.  INT. BATHROOM, DAVID’S APARTMENT (48 MORTON) - DAY  The window bangs open. Allen climbs into David’s apartment  from the fire-escape.  He opens the door to the living room. Sunlight filtering into  a dusty, silent apartment.  83.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 176
    },
    {
      "scene_number": 21,
      "slugline": "INT. DAVID’S APARTMENT (48 MORTON) - DAY  It is eerie. The place of someone who just left the world.  Allen looks around, unsure what he's looking for.  His eyes fall on the bookshelves. Memories flood back,  raveling and unraveling.  FLASHCUT TO:  INT. DAVID’S APARTMENT (48 MORTON) - DAY  Books LEAP into Bill’s hands and he places them back on the  shelves.  Allen UNSUTURES the pages of books, returning back to their  original condition.  Lucien TAP nails out of the wall handing the pages back to  Allen.  Allen scouring his memories, just like when he wrote his poem  earlier.  Time runs in reverse.  BACK TO SCENE  INT. DAVID’S APARTMENT (48 MORTON) - DAY  Allen searches through the steamer trunk of the apartment.  Nothing. He ruffles through the console table. Again nothing.  He notices David’s SUITCASE. The one David packed before  planning on leaving by boat with Lucien.  Allen opens it. He digs through it, searching for some clue,  any clue -- something to shed light on the past.  He pulls out a pile of clothes and underneath them...a book.  It’s a copy of Yeats’ A VISION, covered in notes. It’s  David’s.  It’s the   same   edition of the copy that Lucien showed Allen in  his room.  FLASHCUT TO:  84.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 208
    },
    {
      "scene_number": 22,
      "slugline": "INT. DAVID’S APARTMENT (48 MORTON) - NIGHT  Time shifts into reverse -- we realize this Allen’s mind at  work: rummaging for details, clues, snatches of life.  We see the first night Allen met David -- David circling his  finger around his wineglass, his speech about life as a  circle,slipping through time...  FLASHCUT TO:  INT. DAVID’S APARTMENT (48 MORTON) - DAY  Allen opening the book to find the legend that Lucien once  showed him, the picture of Yeats’s WHEEL.  A stack of PAPERS fall from the book. Allen rifles through  them.  And finds a faded pink hospital “ADMIT” form.  Cook County Hospital, Chicago. March 1943 .  He scans down the page: “ Carr, Lucien. Suicide Attempt. Gas  Inhalation. Admitting Person: D. Kammerer.”  At the bottom, the form reads “ Next of Kin .”  Beside is the name:   David Kammerer.  Below, Allen sees POSTCARDS, PHOTOS. Photos of the beach, of  Lucien and David, reclining together. It’s their trip to  Mexico.  In photo, the two of them, posing for the camera together.  Smiling. Looking very much like a couple in love.  Lucien’s signature red CRAVAT hangs around   David's   neck.  On the backside, written by hand is:  LUCIEN (V.O.)  The perfect day.  Allen, shocked. The puzzle pieces have fallen into place.  CUT TO:  INT. HALLWAY, GREYSTONE - DAY  INSERT: A photo of Lucien in   The New York Times .  85.",
      "characters": [],
      "action_text": "The headline: “STUDENT IS SILENT ON SLAYING FRIEND. HELD  WITHOUT BAIL. AWAITING DEPOSITION.”  The sound of footsteps.  Allen looks over the article. He’s on a bench in the hallway  of an old sanitarium.  His mother, Naomi, approaches, tentatively. The first time  they have seen each other since she was taken from home.  Both of them scared to make the first move towards re-  connection.  Naomi steps towards her son, takes his face in her hands.  Allen melts in her arms.  EXT. GARDEN, GREYSTONE - DAY  Allen and Naomi, in the courtyard of the hospital. Patients  being led through the sanitarium’s gardens by nurses behind.  Naomi, looks remarkably more calm then the last time Allen  saw her.  NAOMI  He would leave me alone in the  house. I was going to die there.  ALLEN  No, Mom. That’s not true.  NAOMI  Yeah, I know it.  Naomi sinks inside herself, dark thoughts returning.  ALLEN  Mom, stop.  NAOMI  Hey, I’m okay now. I’m your mother.  And I’m okay.  She notices the bags under his eyes. His weary face.  NAOMI  But you’re not.  Allen, a kid out of his league.  86. ALLEN  I’m in over my head. Someone I know  killed a man. And I don’t know what  to do. He wants my help. And I  don’t know if I should give it to  him. I don’t know if it’s right.  It’s just a mess.  NAOMI  Let him go. Don’t help him.  ALLEN  I can’t, mom. He’s my best friend.  NAOMI  Listen to me.  Naomi pulls her son closer. With more strength than she has  displayed in years.  NAOMI  The most important thing your  father ever did was fail me.  (beat)  You understand?  Allen, realizing what he has to do.  INT. DORMROOM - NIGHT  Late night. Allen, back at the typewriter where he wrote the  poem for Lucien.  He inserts a blank page. The task before him feels huge.  The events of the night in question -- the night of David’s  murder -- ravels and unravels in his mind’s eye.  FLASHCUT TO:  David, stabbed, gasping at Lucien with horror. The knife  being pulled back, the wound closing back up.  FLASHCUT TO:  Da",
      "dialogue_count": 0,
      "word_count": 1330
    },
    {
      "scene_number": 23,
      "slugline": "INT. JAIL - DAY  ...the same circle finds Lucien as he RIPS the bedsheet into  strips. Frantic...  INT. DISTRICT’S ATTORNEY’S OFFICE - DAY  The circle discovers Allen, unable to sit still. The weight  of his decision crushes him...  INT. JAIL - DAY  ...Lucien fashions a noose around his neck. He ties the sheet  to one of the cell bars. We glide past him back to...  INT. DISTRICT’S ATTORNEY’S OFFICE - DAY  ...Allen spies the shadow of the District Attorney behind  frosted glass of his office...  INT. JAIL - DAY  ...the circling suddenly STOPS at Lucien as the knot on the  noose catches. He is hanging, choking, desperate to die and  yet fighting for life.  But the knot on the cell bars releases. Lucien FALLS to the  ground.  Alive.  INT. DISTRICT’S ATTORNEY’S OFFICE - DAY  The secretary hangs up the phone.  SECRETARY  Mr. Ginsberg. He's ready for you.  She looks at the chair. No one is there.  SECRETARY  Mr. Ginsberg?  The sound of the door closing. Allen is   gone .  MALE VOICE (O.S.)  How did you expect us to react to  this?  92.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 183
    },
    {
      "scene_number": 24,
      "slugline": "INT. COLUMBIA DEAN’S OFFICE - DAY  Allen’s manuscript HITS the Dean’s desk.  The deposition’s title page now reads “The Night in Question  by Allen Ginsberg.” It’s been refashioned into a novella.  Allen sits in the same chair where Lucien was reprimanded.  Professor Steeves sits silently beside the Dean at his desk.  DEAN  No, please tell me. Professor  Steeves says you submitted it as  your final.  Allen, nervous in the chair.  DEAN  Well, then, let me tell you. It is  smutty and absurd.  ALLEN  But you finished it.  The Dean loses his patience.  DEAN  You’ve taken incompletes in two  classes. And you are already on  academic probation. There are rules  you agreed to upon admittance into  this university. And you have  managed to break and   keep   breaking  them. You don’t seem to have much  respect for this institution. So  you may either retract this fiction  as your final. Or you may choose to  be expelled. What will it be?  Professor Steeves eyes Allen.  ALLEN  Fine.  Allen stands, making his decision.  ALLEN  Consider me expelled.  Allen reaches for his manuscript. The Dean SLIDES it out of  reach.  DEAN  This remains with us.  93.",
      "characters": [],
      "action_text": "Professor Steeves keeps a close eye on Allen as he leaves the  office.  INT. GINSBERG HOME - DAY  Back in the Ginsberg residence, but the house is quiet now,  peaceful. No Naomi. The radio playing softly in the living  room. Louis jotting down verse on the back of the mail.  Allen, shirt untucked, composing a poem on the back of a  bill.  They both reach for their cigarettes at the same time.  Louis looks at Allen writing. A mirror between father and  son. A moment of warm appreciation.  Louis hands Allen a package from the mail pile.  LOUIS  This came for you today.  The package is from Columbia University. Allen opens it,  mystified as to what it might be.  It’s his manuscript.  On it, a note: \"Walt Jr.: Keep this, Keep Going. - Professor  Steeves.\"  The music on the radio suddenly stops for a news broadcast.  RADIO ANNOUNCER (V.O.)  This is Bill O’Connell reporting  from Paris and these are the sounds  of liberation.  Over the radio comes the sound of a ROARING CELEBRATION.  RADIO ANNOUNCER (V.O.)  Crowds have assembled in the  streets.  Allen takes in the historic news. He looks at his father. The  world, forever changed.  RADIO ANNOUNCER (V.O.)  This is the end of a long darkness.  France and Europe are finally free.  Crowds ERUPT in whistles and cheers. Allen takes it in. The  moment Lucien had dreamed of.  94. The Mills Brothers’ “You Always Hurt The One You Love” starts  to play.  EXT. RIVERSIDE PARK - DAY  Sun streaming on Allen, standing at the bank of the Hudson  River, at the place where David died.  ALLEN (V.O.)  Another lover hits the universe.  But the night here has passed, a new day begun. It’s now  pastoral, shimmering. Strolling couples, families walk by.  Allen closes his eyes.  ALLEN (V.O.)  The circle is broken.  INT. WEST END BAR - DAY  A raucous crowd now fills the boys’ old haunt. Soldiers, New  Yorkers of all kinds, pouring champagne, toasting the end of  the Second World War.  ALLEN (V.O.)  But with death comes rebirth.  The camera searche",
      "dialogue_count": 0,
      "word_count": 862
    }
  ]
}