{
  "slug": "kin-2018",
  "title": "kin",
  "genre": "action",
  "format": "film",
  "scenes_count": 17,
  "characters_count": 0,
  "characters": [],
  "total_words": 27482,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. HIGHLAND PARK - DETROIT - DAY  Eli makes his way across the 1-75 OVERPASS now. Into wide swaths of DERELICT CITY which follow. Open expanses of VACANT LOTS, ABANDONED HOMES and FACTORIES. Remnants of a different era. Epic. Dystopic. Eli a SPECK in this wild.  EXT. DERELICT SHIPPING SITE - DAY  Interconnected shells of buildings TOWER past barb-wire gates. Abandoned. Busted glass, scorched pavement and litter. Eli SWOOPS PAST into view, stashes his bike near an overpass, peels back a section of perimeter fencing --  INT. DERELICT SHIPPING SITE - MAIN BUILDING - DAY  Almost cathedral-like. Eli enters. Ahead, a wide section of the roof has collapsed under decades of heavy snow. Vines and greenery swallow fossilized machinery guts now in the hot and humid months. Dancing across ruin.  INT. DERELICT SHIPPING SITE - SECOND BUILDING - DAY  ECHOES.   Eli uses a CROWBAR from his bag to CHIP away at walls. He slows -- peers into the hole he’s just burrowed. He knew it. Begins TUGGING out dirty COPPER WIRE. Begins excavating ALUMINUM PIPING next. Piece by piece. An expert.  ANGLES:   stuffing his backpack. Searching. Hacking. REPEATING the process. AGAIN. AGAIN. AGAIN. His haul growing...  INT. DERELICT SHIPPING SITE - THIRD BUILDING - DAY  SHIMMYING beneath a half-collapsed door. Further inside now. Eli sets his nearly-full backpack down for a beat -- -- and reaches into his pocket to grab an INHALER. A PUFFER we recognize as the type carried for asthma. Eli uses it. Takes a deep BREATH reaches for his CROWBAR --  Then stops.   Beat.   His breath is visible.   It's cold in here. Eli turns. Spots a DARKENED CORRIDOR ahead. A small frozen wind brushes past. Eli removes a MAGLIGHT from his backpack.  4.",
      "characters": [],
      "action_text": "INT. DARKENED CORRIDOR - MOMENTS LATER  MOVING through total blackness. Eli clicks on the flashlight as --   KKAA-RRUUNG.   A NOISE faraway -- dust shakes loose above. -- Eli LOOKS. Listens a beat. Nothing follows. His breath FOGGING the air thicker.   It’s summer outside. It should be an oven in here . Eli shines his light --   crystalline formations of ice are visible along the floor at his feet and along walls.   He moves around a final bend, frost crunching underfoot, into --  INT. MASSIVE FROZEN CHAMBER - MOMENTS LATER  A MASSIVE DERELICT CHAMBER. Enters. Cautious -- Eli sees something that takes him --   and us   -- a moment to process. This cavernous space like all the others except: Whispers of light snow levitate past -- Adding an ethereal aura to what looks like DAMAGE done by some kind of WEAPONS FIRE. Slits of natural light cut through BLAST HOLES EVERYWHERE.  Not done by bullets. Something else.  Eli, heart beginning to thunder -- steps forward. And sees --  BODIES. A half-odd dozen of them or more -- All in ADVANCED, MENACING, OTHERWORLDLY ARMOR -- lying strewn about the space in varying configurations of carnage.  Eli has somehow wandered into the aftermath of an O.K. Corral scenario.   Only we can’t be sure the players are from Earth.  HOLY. FUCKING. SHIT.  This was an ugly fight too. Eli turns. Half expecting sirens or some adult to burst into the room and take charge...  Only silence and frozen wind call back.   Eli hesitates. Wades even closer... ... from the look of these ARMORED BODIES, there were TWO DISTINCT SIDES. ONE has sleeker-looking ARMOR, the SECOND is rough-etched. Utilitarian beneath bits of battered garb. Both sides WEAR MECHANIZED HELMETS. Concealing their features.  5. Eli sloooowly approaches the closest MOTIONLESS BODY, splayed out across a pile of RUBBLE -- he stares at the helmet and carefully wipes away a thin layer of frost from the visor -- -- and slows. At Eli’s feet:   IS SOME KIND OF METALLIC DEVICE.  One of theirs.   Its",
      "dialogue_count": 0,
      "word_count": 883
    },
    {
      "scene_number": 2,
      "slugline": "EXT. HROBSKY HOME - DAY  Eli ushers his BMX up the drive of a tiny, sturdy home. Built originally for auto-workers in the 1920s. Stashes his bike.  EXT. BACK OF THE GARAGE - MOMENTS LATER  And moves for the back of the garage to an overturned WHEEL- BARROW. Lifts it to reveal a BOX FILLED with SCRAP metal. Eli deposits what’s left in his backpack and --  INT. HROBSKY HOME - LIVING ROOM - DUSK  Eli.   Quiet.   Motionless. Mind still churning. Replaying events in his head atop a sofa in this working man's living room. HEADLIGHTS of an early nineties PICKUP TRUCK pull into the driveway outside. Booted FOOTSTEPS approach -- HAROLD HROBSKY, or HAL (late 50s), white, enters. A battered old Polack. Face and hands like granite. Hard lines. Wearing a well-used Red Wings jacket. HAL Finish your homework? ELI Summer break started. HAL (recollects, looks around) And now you’ve, what? Forgotten how to read? Hal points to a NOTE. Hand-scrawled in bossy all-caps:   DO YOUR CHORES!  HAL Get your shoes on, I need help with something.  EXT. HROBSKY HOME - DRIVEWAY/GARAGE - DUSK  Eli straining, helping Hal move a shitload of cut lumber from his truck to the garage in the dark. This sucks. HAL -- that rush gig in Corktown. They change their minds every day last minute, had to -- pick all this up for tomorrow --  7.",
      "characters": [],
      "action_text": "They set down the last piece. Eli realizes -- ELI We gotta load all this back   in ? HAL At six thirty a.m. That is correct. (off Eli’s   look ) Somebody’ll steal it. Hal passes en route for the garage. Eli silently protesting -- ELI Who’s gonna steal a buncha wood? HAL (sends him a look) You seen my maglight?  That would be the flashlight Eli abandoned earlier.   Oops. ELI Not lately... Hal CURSES in Polish, scans the place one more time in vein and crosses back to the truck for invoice slips. Sits on the lift-gate. Squints and scribbles. Eli quiet. Clearly annoyed and looking to slip back inside -- HAL What’s with you today? Huh? You forget your chores, I can see you giving me lip -- Hal looks at Eli. Regards him. Motions him over. HAL You know if I’m hard on you, it's cause the world’s hard. I’ve seen that. (beat) And a good man? Accounts for himself. He shoulders responsibility, even when he doesn’t want to. Eli nods, but it’s to get Hal off his back. Hal holds on that a moment. Shifts. Preoccupied with something unsaid... HAL We need a third place for dinner. (beat) Your brother's on his way.  8. Hal HOLDS on Eli. Says this next part with significance. HAL Be careful around him.  INT. HROBSKY HOME - VARIOUS - NIGHT  Sizzling frying pans and simmering pots fog the air as Hal COOKS. Eli removes a new plate and utensils from a cupboard -- The DOORBELL RINGS. Eli turns to Hal, who nods.   Get it.   Eli goes. Opens the front door to get our first look at -- JIMMY HROBSKY (20s), white, handsome with a dash of scumbag. Stands on the stoop, lean, tattooed and cool with a bag slung over his shoulder. Jimmy bears a familial resemblance to Hal -- genetic   only . JIMMY Eli. ELI Hey. JIMMY  Man.   Six years didn’t seem like such a long time until just now -- Jimmy brushes past. Rustles Eli’s hair as he goes -- Eli wincing. Jimmy enters the living room, looks around as though sizing it up, and slows. Then. Jimmy sees, crosses toward Hal in the kitchen. JIMMY Pops. Hal looks",
      "dialogue_count": 0,
      "word_count": 2523
    },
    {
      "scene_number": 3,
      "slugline": "INT. DERELICT SHIPPING SITE - MINUTES LATER  Eli enters. Moving through the MASSIVE SPACE. Every step an ECHO in the black. Eli wades further --  INT. DERELICT SHIPPING SITE - O.K. CORRAL - NIGHT ANGLE:   HAL'S MAGLIGHT. Right where it was dropped. Eli picks it up. CLICKS it on and TURNS, SCANS the open air and --  The aftermath of what we witnessed earlier is 100% GONE.  No ice formations. No strange, FALLEN ARMORED ALIEN SOLDIERS.  Like no one was ever here.   Eli WHIRLS. Aims his flashlight at the walls, the ceiling, the floor -- SCORCH MARKS and HOLES left by the WEAPONS’ FIRE remain, but if we're being honest --  A naysayer could call those anything . Eli turns to   THE OPEN ELEVATOR SHAFT.   Where THE WEAPON went SLIDING... he crosses -- leans over the edge --  Three stories straight down into shadow.   Eli wavers... GRIPS his DUFFLE. CLIMBS down and in. SCALING.  INT. ELEVATOR SHAFT - MOMENTS LATER  Eli DROPS to a safe landing, into decades of dust and debris. Pitch black. Eli fumbles. CLICKS on the MAGLIGHT. Lighting up the bottom of this space around him -- SEES   THE WEAPON DEVICE.   Still down here.   Lying in the dirt. Eli reaches for it -- but before he can touch it, LIGHTS illuminate across the DEVICE. Eli recoils, startled for a second, then -- slowly -- he reaches... picks it up. Once again, it CHIMES. As though this thing has recognized him --   THE WEAPON COMES TO LIFE.  Lighting up the darkness down here with an OTHERWORLDLY GLOW. THE OUTER SHIELD OPENS.  RECONFIGURING.   PIECES of its EXTERIOR   RETRACT   AND   FOLD BACK  on their own to REVEAL a TRIGGER, BARREL -- a 3D TARGETTING system flickers into view, glowing, summoned out of thin air.  Impossibly cool. The weapon HUMMING. Talking to him.   Eli takes in the sight of what’s now held in his hands...  19.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 316
    },
    {
      "scene_number": 4,
      "slugline": "EXT. CITY STREETS - MOVING - NIGHT ANGLE:   that DUFFLE BAG NOW FULL. Slung over Eli's shoulders as he PEDALS. THE WEAPON inside.  EXT. HROBSKY HOME - UP THE BLOCK - NIGHT  Eli comes RACING up the street. SWERVES for cover behind bushes as -- a CAB pulls up to Hal's house ahead --  Jimmy.   Eli watches Jimmy get out, his footsteps a tipsy march. Climbing the front stairs of the house...  INT. HROBSKY HOME - NIGHT  Jimmy enters. Sees HAL. Still up watching Red Wings highlights. Beat. HAL Where'd you go? JIMMY Ended up at the Polish Sea League, um. Knew the bartender from ham high, she -- (drunk, smiles) Bought me some celebratory shots. Another beat. Jimmy's fumbling a little with the sleeves of his coat. Hal, watches this -- and -- HAL You need anything? Jimmy slows. Hal’s looked up from the TV at him. Jimmy’s unprepared for the civility. Cautious. JIMMY Erm. Water? Tylenol?  EXT. HROBSKY HOME - CONTINUOUS THE FOLLOWING IS ALL ONE SHOT:   Eli silently walks his bike up the driveway, DUCKS as Hal crosses past in the window above -- -- holds. Eli stashes the bike and crosses, climbs a nearby garden stoop. Up along the back of the house. Up. Up. Up. Eli reaches, grips the gutter above --  AND FREEZES.   As Hal re-emerges in view. Slows to a STOP in the window above the sink. Goes. Once he’s gone, Eli looks --  20.",
      "characters": [],
      "action_text": "Scales the rest of the way up to his bedroom window --  INT. HROBSKY HOME - LIVING ROOM - CONTINUOUS  Hal returns to Jimmy with the glass of water, offers it along with two tablets of store brand ibuprofen. Jimmy accepts... JIMMY Gonna need, uh -- He fumbles. Smiles again. Stuffs the pills into his pocket. JIMMY -- these bad boys in the morning. And Hal watches   his own son.   Drunk. Making hangover jokes... something stirs deep down. Just trying to put it right. HAL Jimmy. I wanna help you, okay? I do. But you got a decade’s worth of bad decisions under your belt, and you gotta make up for that first. You gotta be ready to work jobs you don’t like, earn experience, earn trust -- Jimmy nods. Bleary. Pounding the glass of water. Hal eyes this -- maybe now’s not the time. HAL But, uh. Let’s talk in the morning. Hal nods, moves for the stairs. And as he goes -- JIMMY No. We should talk now. Hal slows. Something was   different   in Jimmy’s voice right there -- he turns back...  INT. ELI'S ROOM - CONTINUOUS  Eli slides the DUFFLE BAG with THE WEAPON under his bed -- rises. Hearing VOICES in the living room below...  INT. HROBSKY HOME - LIVING ROOM - CONTINUOUS  Jimmy thumbs that empty water glass a moment -- shaky... and he looks back at Hal. For the first time in a while. Jimmy’s eyes are   glassy.   With more than booze.  21. JIMMY Sixty K. I need to borrow sixty K. Sorry but it’s gotta be you. Jimmy’s eyes are glassy with   fear.   Hal’s unsure how to react. HAL From me? Are you kidding? Jimmy I don’t have that kind of -- JIMMY It’s a whole   thing. It’s the reason I’m alive right now. You gotta hear me out   -- HAL --   no. I don’t . Hal’s interrupted Jimmy. He holds on his son. HAL Not in my own home. Whatever this is, I’m not interested. Not anymore. Hal turns again. Moves determined up the stairs now -- JIMMY What about the safe? (beat) The one you keep at work sites. -- and Hal STOPS. JIMMY One time, cash goes missing. I'll never ask you for a thing again, I ca",
      "dialogue_count": 0,
      "word_count": 939
    },
    {
      "scene_number": 5,
      "slugline": "EXT. HROBSKY HOME - PRE-DAWN  Eli STRAINS again. Loading lumber back into Hal's truck. Hal slams a piece into place. Visibly grumpier than usual. Hal hands Eli a piece of paper en route to closing up the garage. SLAMMING it shut. HAL Here. Things I need done today.  Before   I get home. Eli looks. It's a LIST of chores like a million miles long. ELI  Today?   Ever since Jimmy -- HAL -- Jimmy’s got nothing to do with it. I'm keeping you out of trouble. Hal climbs into his truck without another word, starts up and pulls away. Eli watches him go a moment.   What the hell?  INT. HROBSKY HOME - UPSTAIRS HALLWAY - BEDROOM - MORNING IN THE HALLWAY:   We HEAR THE WEAPON power to life behind Eli’s closed bedroom door. PULSATING.  ANGLE:   ELI in his room. Holding it up now. Its SIGHTING SYSTEM flickers into view. He grins, inspecting its contours up close... And moves to a STANDING MIRROR ahead. MUGS at his reflection with THE WEAPON. MASSIVE in his hands. Eli poses with it a few times --   and grins.   Begins QUICK-DRAWING with the SPACE WEAPON on his own reflection.   SHWIP! SWHIP! SHWIP!  He stops.   Beat.   Listening for the sound of Hal’s truck, and -- ELI What’d you say? (DRAWS REAL FAST) Want summa this, huh?  INT. HOTEL ROOM - DAY  One of those dumps along 8 mile near Woodward. Jimmy, hungover at the edge of a shoddy bed -- eyes the ibuprofin Hal gave him. Looking like death. Searching the air for options.  24.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 259
    },
    {
      "scene_number": 6,
      "slugline": "INT. HROBSKY HOME - LIVING ROOM - DUSK  The place is spotless. Eli’s watching TV when Hal ENTERS -- CROSSES and DROPS an arm-load of SCRAP METAL onto the CARPET. Eli JOLTS -- HAL My maglight mysteriously reappears right where it's supposed to be -- and I'm not gonna get curious? Took me all of five seconds to find that stash behind the garage.   Explain.  Eli’s trapped. Locks up -- debates denying it until he sees the look on Hal’s face -- thinks better of it. ELI ... there’s a couple scrap yards that pay money for -- HAL --   scrapping?   You’re   scrapping?  Where did all this come from? ELI A place off Grand River. HAL Did this   place, like my lot,   have a fence around it that said   stay out ?  EXT. HROBSKY HOME - DUSK  Eli STOMPS down the stairs of the front stoop behind Hal. Both of them headed for Hal's truck -- HAL I've got a directory of property developers at the site. You're gonna call every single one you’ve broken into, tell them what you did and pray to God they accept your apology -- And Eli STOPS. In disbelief of how bad Hal is freaking out -- ELI WHY? It’s just a bunch of old metal -- HAL -- that wasn’t yours, Elijah! None of it.  25.",
      "characters": [],
      "action_text": "Now get in the truck, or do I call the police instead? Your decision.  EXT/INT. HAL'S TRUCK - WOODWARD AVE - NIGHT  Hal and Eli ride. Eli not speaking. Angry, humiliated. After a moment, he GRUMBLES something as we JOSTLE with potholes... HAL What'd you say? Eli doesn’t respond. HAL I catch you stealing but I’m the bad guy? That’s it? ELI I didn't   hurt   anybody -- it’s stuff that’s been sitting there for years -- HAL Everything that’s ever been stolen  ever   was something that was just sitting there. ELI I don’t even know why I listen to you. HAL You don’t have a choice, I’m your father -- ELI No you’re not. Only reason I’m here is cause you guys wanted some kinda replacement kid --  Hal looks at Eli.   HOLDS. Driving. Throws on his blinker.  EXT. CONSTRUCTION SITE - CORKTOWN - NIGHT  The epicenter of Detroit’s more recent gentrification. Hal pulls up to a CONSTRUCTION SITE. A condo high-rise for rich kids moving in from the burbs. His TRUCK rumbles to a stop -- HAL Where’d you hear that? Someone tell you that? Eli doesn’t answer.  26.  HAL (CONT'D) Hal puts it in park. Collects himself. HAL I’m gonna say this to you once, and I want you to hear me. You are nobody’s replacement. Hal goes quiet a moment. Chooses his words carefully, but with conviction. HAL You’re not somebody’s guilt trip. You’re not some booby-prize. (then) You’re   our   son. But your mother’s gone now, so it’s my job to pull you as far back from the ledge’a bad decisions as possible -- and I’m doing the best I can without her. This may not always make us best buddies, but hopefully it’ll mean the difference between you turning out okay -- and you not. That’s why we’re here. That’s why I’m hard on you. Beat. Eli softens -- but only a little. Hal holds on him. Silence passes. Eli’s unmoving. Hal shakes his head. EXHALES.  EXT. CONSTRUCTION SITE - CORKTOWN - CONTINUOUS  Hal and Eli get out, crossing up the street towards a sign labeled SOUTH ENTRANCE. Hal pulls out HIS KEYS -- -- and sees the CH",
      "dialogue_count": 0,
      "word_count": 652
    },
    {
      "scene_number": 7,
      "slugline": "INT. HAL'S TRUCK - CONSTRUCTION SITE - NIGHT  Eli, alone now, locks the doors and begins FLIPPING through HIP HOP stations -- the street beyond quiet --  EXT. CONSTRUCTION SITE - CONTINUOUS  Hal moves cautiously. Towering steel columns lift up and away into darkness. He rounds a bend to see HIS WORK TRAILER. The LIGHT is ON inside. Music can be heard. An ANCIENT RADIO scratching out Joni Mitchell’s copacetic hymnal:   HELP ME.  Hal moves for this, fast and --  INT. CONSTRUCTION SITE - MANAGER'S TRAILER - CONTINUOUS  -- opens the trailer door. It SWINGS open and Hal lays eyes on JIMMY and the SIX-ODD SHADY CRIMINALS in here with him. A SAFE behind Hal’s desk has been BROKEN OPEN. The last of the CASH that was in his safe is being stuffed into a BLACK GARBAGE BAG -- JIMMY  Dad   -- what the FUCK -- Beat. Hal grips the crowbar TIGHT at his side -- Taylor, who’s taken Hal’s seat behind his desk, rises -- TAYLOR This is dad? Hey   dad . HAL (to Jimmy only) What are you doing in here? TAYLOR Taking money from this safe. HAL (points the crowbar) That's not yours. JIMMY  Dad I'm serious   -- turn around and walk the fuck outta here NOW -- we’ll talk about this later. Hal’s not gonna do that. He zeroes in on Taylor. Nods to the black garbage bag --  28.",
      "characters": [],
      "action_text": "HAL I don't know what my kid promised you, but that’s not his to give or yours to take. TAYLOR It isn’t? JIMMY Please -- Dad -- TAYLOR Shh. Jimmy. Your father’s talking.  And Taylor’s no longer smiling.   Sizing Hal up. A distant glaze settling over his expression. TAYLOR You were saying? HAL I don't have a gripe with you. TAYLOR But we gotta put this money back. Hal swallows a lump in his throat -- squeezes the crowbar -- HAL -- Yeah. TAYLOR Huh.  BLAM.   Taylor DRAWS his weapon and FIRES on Hal. Blood spatters. The round catches Hal in the chest -- JIMMY NO -- Taylor’s AIMING again. All instinct, JIMMY RUSHES. DESPERATE. GRABS for TAYLOR’S GUN as it   FIRES . SENDS a ROUND through a window --   and   --  BLAM.   Taylor SQUEEZES the trigger again as he and Jimmy STRUGGLE.   BLAM . A SHOT EXPLODES right through DUTCH'S NECK. Dutch goes gurgling WIDE EYED BACKWARD. SCREAMS of shock. EVERYONE DRAWS THEIR WEAPON. So Jimmy BEGINS   SQUEEZING   the TRIGGER of Taylor's gun.   BLAM.  Renny SHRIEKS. SHOT through the WRIST --   BLAM.   RENNY SHOOTS the GUY NEXT TO HIM through the foot who   BLASTS   the ceiling --  all of this a whirling berzerko nightmare --  29. Jimmy trying to DRAIN the CLIP -- FIRING -- WRESTLES --  INT. HAL’S TRUCK - CONTINUOUS  As Eli sits in Hal’s truck, nodding along to BLASTING HIP HOP -- we can see what he doesn’t: faint, distant MUZZLE FLASHES in the FARAWAY darkness behind him --  INT. CONSTRUCTION SITE - MANAGER’S TRAILER - CITY STREETS  Taylor manages to WRENCH Jimmy’s hand DOWNWARD, trying to grab the gun and   BLAM.   A ROUND goes through Taylor’s LEG. Taylor SCREAMS -- Joni Mitchell’s ballad CRESCENDOS --  CRACK ! HEAD-BUTTS Jimmy. Sends him backward. Taylor collapses as well, grabbing his THIGH and SCREAMING -- And he SEES -- DUTCH. GURGLING in the corner ahead with blood bubbling out of the dime-sized HOLE in his neck -- TAYLOR (scrambles for him) N-nn-no -- nnn-no-no-no -- Panting, fumbling, Jimmy looks --   sees Hal.   On the ground. Eye",
      "dialogue_count": 0,
      "word_count": 721
    },
    {
      "scene_number": 8,
      "slugline": "INT. HAL'S TRUCK - CONTINUOUS  MUSIC PLAYS, drowning out the OUTSIDE -- Eli distracted --  INT. CONSTRUCTION SITE - MANAGER'S TRAILER - CONTINUOUS  Dutch's eyes don’t close, but the last of his gurgling dwindles into silence. Still, Taylor tries to stem the bleeding -- holding -- mumbling -- TAYLOR Dutch? Dutch? Nothing. Taylor lets out a weird SOB -- brings his forehead forward into Dutch's... TAYLOR Dutch, Dutch, Dutch, Dutchy...  EXT. CONSTRUCTION SITE - CORKTOWN - CONTINUOUS  Jimmy SKIDS through the entrance gate -- moves to tear across the street and hop a fence -- when he -- Sees HAL'S TRUCK. Parked up the block.   Eli . Inside.  FUCK.   This can’t be FUCKING HAPPENING --  Jimmy turns back to the CONSTRUCTION YARD. The sound of FRANTIC VOICES can be heard. Taylor and his guys. They’re coming this way. They’re gonna spot Eli and they’ll -- Unspeakable scenarios spin through Jimmy’s head. He looks once more to his path of escape -- he could go, but he -- Turns back. Heads for the truck. Frantic. Trying to force back the overwhelming emotion drowning him --  INT. HAL'S TRUCK - NIGHT  Eli JOLTS as Jimmy APPEARS at the driver’s side door. Pale. But he sends Eli a big shakey smile. Eli unlocks the door. Jimmy clamors in FAST -- JIMMY Whattup kid, ahh... Jimmy STARTS UP the truck without explanation, frantically shifts into drive and PEELS OUT -- SPEEDING AWAY --  31.",
      "characters": [],
      "action_text": "ELI W -- wait, what’re you doing? Jimmy looks at Eli. Racing. Everything spinning. Stammers. No clue what to say to this kid -- JIMMY Ah. Didn’t -- I mean -- Jimmy looks at Eli. Floundering. White as a sheet. Stuttering. JIMMY Dad didn’t call you, ah. Too? To -- (searching) To let you know about -- what happened? ELI Dad won’t let me have a phone. Jimmy proffers an   oh yeah smile   but he just looks weird. GUNNING it away. LOOKS to the rear view --  EXT. CONSTRUCTION SITE - CORKTOWN - CONTINUOUS  Taylor STAGGERS through the gate just in time to see HAL'S TRUCK speed away in the distance. His leg streaming blood, bleary with rage. Renny, his arm gushing blood as well, is STRUGGLING to keep up, full blown panic -- RENNY Tay, TAY man we gotta go! Cops’ll be coming -- T ay   -- we gotta get outta here we GOTTA --  BLAM . Taylor SHOOTS Renny in the face. Reaches for his cell. Dialing. Turns back into the site. Moving. Into the phone: TAYLOR Get the boys. Get the boys and get the guns. JIMMY (PRE-LAP) There was a, ah -- a break in...  INT. HAL'S TRUCK - SPEEDING - CITY STREETS - NIGHT  His attempts to appear normal are getting a little better -- but still, Eli's not vibing with it --  32. JIMMY At the site, the south gate, right there... (thinking) You didn’t see the chain cut? ELI No -- Jimmy’s forming all of this in real time. JIMMY Somebody broke in -- stole a ton of gear, two trucks. And. Just trashed the place -- get this, they -- ah -- (got it!) Dumped something like -- twenty thousand cubic yards of concrete at the base. Twenty   thousand   -- can you believe that? Jimmy TAKES a HARD TURN, still gunning it -- ELI And he called   you   to pick me up? Jimmy eyes Eli’s skepticism. Feigns indignance. JIMMY  Of course   he did, why wouldn’t he? ELI I heard you two arguing last night -- Jimmy keeps it up. Dodges. JIMMY Yeah. We got into it -- (looks at Eli) -- how much did you hear? ELI I saw you leave. JIMMY We can argue, but -- does that mean he can’t call me when an ",
      "dialogue_count": 0,
      "word_count": 1268
    },
    {
      "scene_number": 9,
      "slugline": "EXT. I-75 - CONTINUOUS  A scary ass DELTA 88 and a CUTLASS CIERA cut past us. Flying. En route for the Caniff EXIT RAMP. INSIDE the latter, packed in along a new group of PEERS, Taylor and his entire crew are loading bullets into clips.  INT. HROBSKY HOME - KITCHEN - CONTINUOUS  ELI Dad’s cool with this? -- and so Jimmy makes his final gambit... JIMMY Yeah, man. You wanna call him -- ask him yourself? Go ahead. ... Jimmy offers Eli his cell phone. Eli takes it... JIMMY Heads up, though -- I think I might just go either way. I’ve been locked inside too many small rooms for too damn long. (then) So you want adventure or chores? Your call. Moment of truth. Eli eyes the phone in his hands... ...   and doesn’t call.   Hands it back to Jimmy. Who CLAPS. JIMMY Get your shit. Five minutes. Go. ELI Now? JIMMY Let’s go! Eli moves. Jimmy watches him go... the veil receding.  INT. ELI'S ROOM - NIGHT  Eli sets to it. He stuffs a couple shirts, socks, tooth-brush into his backpack --  37.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 186
    },
    {
      "scene_number": 10,
      "slugline": "INT. HROBSKY HOME - BASEMENT - NIGHT  Jimmy TUGS an OLD TRUNK free from storage. Pulls it open to find -- clothing. A little dated but whatever. Boots. Shades.  INT. ELI’S ROOM - NIGHT  Eli drops down to peer beneath the bed. At the DUFFLE BAG. He considers.   Bring it or no ... Eli does. Begins to PACK over  THE WEAPON .  INT. HROBSKY HOME - BASEMENT - NIGHT  Jimmy searches out a satchel. STUFFS the PISTOL in first. Then the BLACK GARBAGE BAG. Then clothing. Whatever fits --  EXT. HROBSKY HOME - NIGHT ANGLE:   Eli's backpack and the DUFFLE BAG with THE WEAPON are tossed in the truck next to Jimmy’s satchel -- he strains -- JIMMY Damn, Eli. Brought your whole room --  MOMENTS LATER:   Jimmy's gunning it away. HAL'S TRUCK a set of tail-lights just as -- the camera loiters -- PANS -- to the OTHER SIDE of the BLOCK. The opposite direction... TWO SETS OF HEADLIGHTS come   TEARING   AROUND the far CORNER. The DELTA and CUTLASS come THUNDERING UP.  INT. HROBSKY HOME - NIGHT  The front door is KICKED OPEN. Taylor enters, still blood spattered, dragging his leg along now, with EIGHT MORE CRONIES at his side.   It's quiet.  TAYLOR Toss this shit. SNICK (20s), a biker prospect looking type, STEPS forward --  EXT. HROBSKY HOME - CONTINUOUS ANGLE:   PULLING slowly off the porch as the sound of destruction begins. As everything in this well-loved home is SMASHED. LOUDER and --  38.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 247
    },
    {
      "scene_number": 11,
      "slugline": "EXT. DERELICT SHIPPING SITE - NIGHT  Silence . And we return to this MONSTROSITY of a structure. The MASSIVE CHAMBER where Eli first stumbled across THE WEAPON.   And we're not alone.   TWO FIGURES move into frame.  Silent. Eerie.   Hard to make out in the darkness --  ONE OF THEM   tosses a fistfull of what look like MARBLES into the air --   where they stay .   Mechanical . HOVERING. Then. They FAN OUT. ILLUMINATING the darkness. And   WE REVEAL:  The two FIGURES are wearing the same type of OTHER-WORLDLY ARMOR we saw on the ALIEN BODIES Eli discovered here earlier. We'll call these figures   THE CLEANERS.   And we can take a guess as to what they're looking for.  They move through the space, each using SCANNING DEVICES as they go. One slows -- keys a command in and --  FOOTSTEPS in gravel and dust illuminate.   Eli's footsteps.  SEVERAL of the marble-like devices SWOOP IN overhead, slow -- TRACING Eli's footpath forward. To the ELEVATOR SHAFT --  INT. DERELICT SHIPPING SITE - ELEVATOR SHAFT - NIGHT  One of the Cleaners DROPS STRAIGHT down to the bottom. A WHIRRR sounds from his MECHANIZED BOOTS. SHOCK SUPPORT -- The Cleaner turns. No sign of THE WEAPON --  INT. DERELICT SHIPPING SITE - EXIT - NIGHT  The other Cleaner approaches a window. Looks out through broken glass. Over distant city lights and THE REST OF OUR WORLD...  INT/EXT. HAL'S TRUCK - FREEWAY - IOWA - PRE-DAWN  HAL'S TRUCK SAILS PAST us into wide horizons of midwest farm- land. The distance beginning to glow. A new day on approach. Jimmy’s at the wheel,   looking like straight up death.  A face that’s clearly just driven through the night. His expression a void. His eyes lost. Alone with proverbial blood on his hands. Eli sleeps peacefully, riding shotgun.  39.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 302
    },
    {
      "scene_number": 12,
      "slugline": "INT/EXT. HAL'S TRUCK - FREEWAY - IOWA - LATER  The truck JOSTLES a moment and Eli stirs. Groggy. Lifts his head up off the hoodie he was using as a pillow -- JIMMY Rise and shine. Welcome to Iowa... Eli looks up. Sees infinite expanses of farmland. That's it. JIMMY ... home of, ah -- fields? Lots of fields... the amish, maybe? I dunno. (sees, up ahead) And...   oh shit ...  INT. SUPER TRUCK STOP - DAY  Jimmy enters, smiles -- Eli following close behind -- JIMMY All-in-one trucker paradise coves. These places are really weird but awesome. Need a shower? Nap? Fifty different types of jerky? They got you. Jimmy pointing as he goes. Eli takes the strangeness of this place in... like a sprawling compound for crazies... JIMMY Most importantly though -- Jimmy halts at the SIGHT OF THIS PLACE'S ANCIENT ARCADE. JIMMY Fully functional   old school arcades.  INT. SUPER TRUCK STOP - ARCADE - DAY  Jimmy and Eli are playing the TERMINATOR 2 ARCADE GAME. You remember it. Don't even lie. Jimmy's enthralled... JIMMY You gotta picture coming up to this thing in 94 at like a roller rink or something -- a game that had  machine guns   you could use to shoot  evil cyborgs   -- Eli doesn’t really get it. And maybe he’s got a point. In truth, it really hasn’t aged well...  40.",
      "characters": [],
      "action_text": "JIMMY -- this thing gave me sooooo many nightmares, I’m telling you. ELI Really? Jimmy shoves a fist full of quarters into Eli’s hand. JIMMY Here. Take over. I’ve gotta grab something from the truck --  EXT. SUPER TRUCK STOP - DAY  Jimmy’s HOISTED a clunky toolbox out of Hal’s extended cab. Reaching for a SCREWDRIVER, he crosses the lot -- cautious. He moves for a CAR parked in silence around the side -- -- leans down fast and begins unscrewing its PLATES.  INT. SUPER TRUCK STOP - CHECK-OUT - A SHORT TIME LATER  Jimmy now grips a carton of smokes, energy drinks and a bag of chips on the counter. He turns as Eli walks up -- JIMMY What'd you get? -- Eli tosses in a bag of combos and a 20 oz coke. Jimmy pays hurriedly with a new hundred dollar bill -- Eli idles, meanwhile, looks into a nearby dining area -- Where A FAMILY OF FOUR, a MOTHER, FATHER and TWO SONS right around Eli’s age, are eating together. Gabbing.  Very likely also on vacation.   But in a way that tells us:  This is a happy, functional family.   The moment’s INTERRUPTED as Jimmy slaps Eli’s combos and soda into his hands -- JIMMY C’mon -- the open road is calling.  INT. TATTERED HOUSE - KITCHEN - DAY ANGLE:   we’re moving up the short hallway en route toward’s Taylor’s gross and disgusting kitchen. TAYLOR -- with his leg crudely bandaged, is seated atop his battered, cigarette burned table, facing away from us.  41. The curtains are closed.   Light from outside fights its way in via JAGGED SLIVERS here and there -- What sounds at first like LOUD BREATHS coming from Taylor become SOBS. Weird whimpers GASPING out between --  WE MOVE   around him now until we can see his face. Tears and hurt and loss swilling outward past bloodshot eyes and a tweaker’s stare. Taylor STANDS, PACES -- movements erratic. Growing moreso. Caged. Until he turns, EXPLODES -- FLIPS his TABLE -- as it CARTWHEELS we CUT TO --  INT/EXT. HAL'S TRUCK - IOWA FREEWAYS - DAY  Jimmy and Eli DRIVE. TRAVERSING the featureless endlessness tha",
      "dialogue_count": 0,
      "word_count": 4882
    },
    {
      "scene_number": 13,
      "slugline": "EXT. ROCKIES - BACK ROADS - NIGHT  And HAL'S TRUCK RACES PAST   -- JIMMY (PRE-LAP) Stop -- stop the truck -- now --  EXT. BACK COUNTRY - GRAZING FIELD - COLORADO - NIGHT  Headlights break the surreal silence of high-mountain cattle country -- Milly pulling over... The extended cab door JOLTS open and Jimmy, looking like half- mashed shit, tumbles out. White as a sheet -- stumbles off a few steps. Stops. Milly following Jimmy out, Eli too -- MILLY Hey! Get back in, we gotta -- JIMMY No -- MILLY You need to get to a hospital -- Jimmy's staring at Eli -- points -- to THE WEAPON -- JIMMY What the fuck is that?!? ELI It's a gun. JIMMY  That   is not a gun. Guns shoot bullets -- that thing just exploded a goddam pool table   --  (freaking out) What is it?? Where did you get it?? ELI I found it. In this old warehouse where I'd been going for scrap... JIMMY You found that in a vacant? (nevermind, crosses) Let me see. Jimmy grabs THE WEAPON and yanks it away before Eli can protest. Still wobbling. He begins fiddling with it --  61.",
      "characters": [],
      "action_text": "MILLY  Jimmy.   You're drunk and you might have a concussion -- I don’t think -- JIMMY I'm f-fine. Just wanna look -- Jimmy hoists THE WEAPON up. Aims sloppily at a nearby HAY ROLL used for cattle grazing -- pulls the trigger -- instantly, the weapon seizes -- MAKES AN ALERT SOUND -- -- glows a BURNING RED and -- Jimmy SCREAMS. YELPS. Drops the weapon. Throws it down -- his hands singed -- waving them off fast, cursing -- JIMMY The HELL -- Jimmy looks at Eli. Not understanding. Then to Milly -- MILLY Maybe it doesn’t like you. JIMMY You try then. MILLY I'm not touching that thing. Beat. Jimmy's rubbing his hands. Eli crosses, slow and -- picks it up again. Sotto. Looks at Jimmy. Unburned. JIMMY So it likes you just fine, huh? ELI I told you, I just found it. I didn't even know what it could do until back there. JIMMY Had a pretty good idea though, didn't you? Beat. Jimmy holds there in stunned disbelief. Turns. Eyes the large HAY-ROLL... JIMMY Don’t just stand there, let’s see it again -- in action. Go on.  62. Eli blinks. Looks to Milly then back to Jimmy. Activates the weapon, aims -- and BLOWS the HAYROLL into a sky-born TUFT of EMBERS, some of the HAY on FIRE -- fucking awesome -- Jimmy recoils, and despite his injuries and state -- whoops. JIMMY (points to another) Well don’t stop there, man -- Eli takes in his older brother’s floored but wowed expression and grins as well. Okay. Takes aim and BLASTS THE HELL out of another one -- Jimmy cackles -- looks at Eli, impressed -- JIMMY I can't believe you just left that in the back of the truck -- ELI What? You want me walking around with it?  Beat.   And Jimmy HALTS mid-thought. Remembers -- WHIRLS, looking back down the road -- begins stumbling -- JIMMY Oh no. Please, no, no, no, no, no -- MILLY What? Jimmy! WHAT? JIMMY My bag. The satchel I was carrying. All my money's in it -- I left it at the table -- Everyone exchanging looks. MILLY How much are we talking? JIMMY I dunno -- 60? 70? Thousand... Eli looks to Jimm",
      "dialogue_count": 0,
      "word_count": 3928
    },
    {
      "scene_number": 14,
      "slugline": "INT. AUCTION ROOM - LIVESTOCK CENTER - CONTINUOUS  Jimmy and Eli BREACH the doorway into a LARGE ROOM -- JIMMY Alright -- hands up -- HANDS UP -- (gun out) Up-up-up-up-up-UP!! NOBODY MOVES -- You know what THIS IS -- -- a room FILLED with four tables of HULKING, INTIMIDATING RURAL MEN. Each gripping HANDS OF CARDS, drinks and tobacco. JIMMY Everybody reach for it! REACH for the tits'a god and hold em there or get FUCKIN blasted by my little friend -- LEE, his nose visibly broken, is seated at the head of the farthest table. Glaring. Jimmy eyes him -- -- terrified, but holding ground and feigning calm -- JIMMY Hey Lyle -- tell all your buddies about what happened at the club? You let us know if you need another demonstration -- do ya? Lee looks to Eli. Staring death. Eli, scared shitless but managing his gameface, stares right back... holds... ... Lee shakes his head no. JIMMY Clever. Here's how this goes -- me and this guy are gonna walk to the pot... Jimmy looks to Eli. Both are breathing HEAVY. Jimmy sends Eli a shaky nod.   This is your part now. Be cool.  JIMMY And the rest of you are gonna play the FUCKING STATUE GAME. Clear? (then) Lyle. I’d like my money back. On your feet. Jimmy MOVES. MOTIONS Lee up and forward. Keeps his distance. Lee begrudgingly leads the way into a small kitchen beyond... Leaving Eli alone with TWENTY ODD SCARY LOOKING MEN --  79.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 254
    },
    {
      "scene_number": 15,
      "slugline": "INT. KITCHEN - LIVESTOCK CENTER - CONTINUOUS  Lee leads the way. Hands out and visible at his sides. JIMMY Where we going? Tell me first before you do shit. LEE There's a safe. Under the sink. Moving for an INDUSTRIAL SINK against a nearby wall. Slow. Lee has to crouch to get at the cabinet doors below, to reveal -- sure enough -- there’s a SAFE. Lee moves -- -- and Jimmy inches the barrel up to the back of Lee's head. Takes a DEEP BREATH. LEE I'm just gonna open it. JIMMY Two things first. One. I told you tell me before you make any moves. Do that again I'll blow your head clean off. Two. My barrel's staying right here until I see my money coming outta that thing   only . If. If -- from one thief to another -- you’ve done what I’d do if I were you -- and there's a pistol stashed in there for just this occasion? I want you to know: your life is right now, at very serious risk. (beat) Now. I can give you a way out of that scenario -- but you gotta let me know   before   you open it so we can work out a plan. So. Think real hard about your buddies in there, about any family you got -- and tell me: (another beat, re: safe) Is there a pistol waiting for you? Lee's quiet for a long moment. We can see a world of thought churning in his expression...  WITH ELI : the pock-marked face of the room's SCARIEST PLAYER is GLARING at Eli now.   Clearly debating a MOVE for something at his waistline   -- the SILENCE BUILDING --  WITH JIMMY & LEE:   Hovering over the safe...  80.",
      "characters": [],
      "action_text": "LEE There’s a 38. JIMMY (nods, beat) Okay. Dial the combo -- unlock it, but don't pull back the door.  WITH ELI:   The SCARIEST PLAYER'S hand FLINCHES. Eli sees it.  Looks at the player.   Who glares right back.   Without a word -- a mutiny is beginning to swell in this room...   OTHERS saw that gambit -- now contemplating moves of their own...  ... without a word, we know it. Eli’s losing control.  WITH JIMMY:   The safe POPS open. Lee doesn't open it. He slowly stands and steps aside. Able to   see the pistol.   Lee’s eyes waiting for Jimmy to make a false move so he can lunge -- But Jimmy doesn't take his eyes or aim off Lee. He maneuvers and reaches backward with his free hand for the safe until he's able to GRIP the PISTOL. Jimmy JAMS it into his coat POCKET -- JIMMY Take the bag behind you. Step back over here and fill it. -- Lee's expression now GLARING.  WITH ELI:   Someone’s gonna reach for a WEAPON.  WITH JIMMY:   watching Lee fill the bag with -- There's A LOT of money coming out of THAT SAFE. More than what was taken from Jimmy. A LOT MORE. Jimmy HOLDING ON --  -- the sheer amount of money about to be his.   Lee FINISHES. OFFERS the TAKE OUT BAG to Jimmy.   Murderous.  JIMMY (motions) I'll take that hat on your head too.  WITH ELI : unspoken messages are now being conveyed everywhere around him. Looks, then -- a nod from the SCARIEST PLAYER -- Eli nervously adjusts his aim -- from one heavy to another -- -- the SCARIEST PLAYER slowly and quietly easing a PISTOL out from his waistline --  81. Click. Jimmy reaches down. TAKES the pistol out of the Scariest Player’s hands, turns to the room -- JIMMY Nothing's changed, folks! Keep em UP! UP! UP! -- Jimmy shakily nods to Eli. Sends Eli the   all-good wink   and nods.   Go first.   Eli begins BACKING AWAY. Toward the exit -- And HAULS it. A fast walk down the exit hallway as Jimmy ditches the Scariest Player’s gun and PUSHES Lee forward toward Eli's former position at the door...  WITH JIMMY:   Holding a pisto",
      "dialogue_count": 0,
      "word_count": 830
    },
    {
      "scene_number": 16,
      "slugline": "EXT. LIVESTOCK CENTER - NIGHT BOLTING   into the SHIPPING LOT. MILLY comes SWERVING UP just past the FENCING AHEAD -- no time to CLIMB -- THE SOUNDS of ANGRY VOICES CALL OUT behind them. JIMMY The GATE -- shoot the GATE! Eli, running, takes SLOPPY AIM with THE WEAPON and --  BOOOOOM!   INCINERATES the gate in their path. CHUNKS go SLIDING away across asphalt in SPARKS -- Eli and Jimmy RACE UP TO HAL'S PICKUP and --  Eli stops.   He turns. Looks back toward the sound of their PURSUERS -- Eli HOLDS -- JIMMY Eli -- COME ON! (clamoring in) Let’s GO MAN WE GOTTA GO!! -- Lee and the men with him, GIVING CHASE, emerge into view on the other side of the parking lot. Seeing HAL’S TRUCK -- JIMMY ELI GET IN THE CAR -- Here they come. Several men taking aim -- and this is exactly what Eli was waiting for. Weapon ready, he takes aim at a PARKED FARM TRUCK just adjacent to Lee’s APPROACH and --  BOOOOOOOM!   Eli LIGHTS the TRUCK up. Literally sends it airborne before CRASHING back down to Earth roof-side down. Sending a crystalline message to Lee and the goons with him --  Do not follow us.   And no one does. Eli makes a quick turn. JUMPS into HAL’S TRUCK alongside a WHOOPING JIMMY -- JIMMY Eli! You big-balled motherfucker! -- MILLY GOES TEARING AWAY into pitch black RURAL roads.  INT/EXT. HAL'S TRUCK - PAVED ROAD - ROCKIES - NIGHT  Milly TURNS ON the HEADLIGHTS as Hal's truck SWERVES back onto a paved roadway now. A glow exchanged between our heroes as Milly breaches the silence --  83.",
      "characters": [],
      "action_text": "MILLY Was I right? How much did you get?? Jimmy and Eli sweating bullets. Panting. Jimmy looks back, without a word, opens the bag -- slaps Lee's HAT onto his head -- and begins grabbing at BILLS, HOLDING them up -- smiling WIDE -- JIMMY I dunno -- ah -- you tell me? Jimmy looks at Eli, beat, breaking into a laugh, endorphin rushed -- and THROWS a FISTFUL of bills at Eli. Eli smiles, PANTING -- until --   he senses it . Goes fishing into his pockets for the INHALER -- MILLY Did you do it? Give him the message?  No inhaler.   Eli’s now checking his other pockets. His breaths beginning to RASP -- re-checking his pocket again -- ELI Jimmy -- JIMMY (still talking to Milly) I fuckin did. Got him real good too, it was -- ELI (wheezing) Jimmy -- That last rasp has gotten his attention. Jimmy turns around in his seat to see Eli. His eyes wide -- JIMMY What, what’s wrong? ELI My -- my -- haler -- Eli’s gesturing at his chest. Having trouble talking now. What transpires next happens fast -- JIMMY Inhaler? What’s wrong with it? Where’d you put it -- (off Eli) -- where’d you put it? You lose it?  84. Eli doesn’t know. And now he’s scared. Fighting to BREATHE. Jimmy JUMPS. UP. SCRAMBLES. Over the seat and bails into the back next to Eli, searching for it -- MILLY What’s happening? What’s wrong? JIMMY He’s got asthma, he’s got -- this inhaler, but I can’t -- he must’ve dropped it -- MILLY WELL -- is he okay?? Jimmy jolts. A MASSIVE WAVE of panic is JOLTING through him. JIMMY No HE’S NOT OKAY now just -- just -- DRIVE cause we can’t stop -- Eli? Eli? Help me out, man. Where do you keep it? Did you lose it? Eli’s breaths have now become very scary RATTLES. He gestures frantic to his pocket -- Jimmy FREAKING at the sight of Eli. He’s starting to lose color. Jimmy trembling. Eli PANICKING -- Jimmy slows -- -- Eli could die. MILLY What’re you gonna do?? What do we do? JIMMY -- JIMMY (exhales, focuses) Calm down, we’re all gonna CALM DOWN -- that’s what we’re gonna do. (searching) Okay",
      "dialogue_count": 0,
      "word_count": 7111
    },
    {
      "scene_number": 17,
      "slugline": "EXT. BLUE FALLS POLICE STATION - LOBBY - CONTINUOUS  Jimmy chances a glance into the lobby now. And sees it. Blue and red lights. Flashing in through every window. Jimmy curses. Inches forward, low -- peaks a look out to see --  A PARKING LOT FILLED WITH COPS.  JIMMY Ah man -- Jimmy turns. Sinks down along the wall. Face wracked.   No clean exit.   Beat. He looks to Eli. Face long --  OUTSIDE:   and Jimmy can see them GEARING UP out there. Ready. Morgan can be seen coordinating. Doling out ORDERS. JIMMY Looks like we’ll have more company pretty shortly... ELI What’re they gonna do? A long silence follows. Jimmy's expression far off and away. Then. He looks back at Eli and smiles, sad. JIMMY They’re probably gonna come in here and take us away. Could be the last time we see each other for awhile -- Beat. Jimmy looks at Eli. JIMMY -- I'll go away for good. You'll be alone again. I’m sorry, I -- it was never meant to be like this. Dad was right. Be more like him, okay? (then) Less like me. Eli looks up at Jimmy. Quiet. And there we have it. Jimmy nods. Sober. Lays the pistol down. Like releasing some great weight. Slides it away. Looks at Eli. Silence lingers. JIMMY You and me’ll always be brothers. Like it or not. And I’ll always be there for you. Best as I can. Okay?  111.",
      "characters": [],
      "action_text": "Jimmy strains. Gets to his knees, puts his hands atop his head -- ready to be arrested. Eli sets down THE WEAPON nearby... gets on his knees... JIMMY They like it when you link your fingers. Just like this. (then) They’ll be everywhere real soon. I want you to do everything they tell you, okay? Eli copies. Scared. Holding back tears. JIMMY Elijah. You’ll be fine.  AND WE HOLD:   on two brothers. Side by side. Listening to the sound of BOOTS like a gathering storm outside --  EXT. BLUE FALLS POLICE STATION - NIGHT  Officers RACE up. From EVERY SIDE. GUNS DRAWN, SWARMING -- and that’s when we hear it. STREET BIKES. In BREAKNECK approach. Coming right this way -- Morgan, amidst the STORMING POLICE, turns -- NEARBY OFFICER Ma’am? OTHER POLICE look as well. Taking in the TWO HEADLIGHTS as they come SAILING IN. WAY TOO FAST AND -- It's THE CLEANERS. They DRAW WEAPONS. ONE PULLS and aims what looks like a HANDGUN version of Eli’s WEAPON, FIRES -- BLASTING straight through BARRICADES. POLICE go LEAPING AWAY. BULLETS BOUNCE OFF their ADVANCED ARMOR -- IGNORING incoming fire. Heading right for THE STATION --  INT. BLUE FALLS POLICE STATION - LOBBY - CONTINUOUS  Jimmy hears this -- looks -- Eli too --  EXT. BLUE FALLS POLICE STATION - CONTINUOUS  Morgan CHARGES. YELLS to POLICE --  112. MORGAN GO!! Hit the DOOR! Don’t let them past you into the STATION! Morgan and POLICE RUSH THE DOOR as OFFICERS BEHIND them attempt to SLOW the BIKES -- The SWAT BATTERING RAM SWINGS.  FOOOSH.   The SECOND CLEANER   FIRES   SOMETHING past Morgan. Into the POLICE STATION'S MAIN WINDOW. A CANNISTER or --  INT. BLUE FALLS POLICE STATION - CONTINUOUS  Eli and Jimmy watch as THE DOOR BUCKLES under the WEIGHT OF THE BATTERING RAM -- -- as the GRENADE-SHAPED INCENDIARY ricochettes off the wall beside Eli and --  BLAAAAAAAAAAAAAAAM! The PROJECTILE EXPLODES.  Jimmy is HURLED straight backward by the BLAST -- The POLICE rushing in VANISH in BLINDING LIGHT -- As Eli’s form is CONSUMED BY SHOCKWAVE -- he c",
      "dialogue_count": 0,
      "word_count": 2181
    }
  ]
}