{
  "slug": "kings-of-summer-2013",
  "title": "kings of summer",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 12,
  "characters_count": 2,
  "characters": [
    "PATRICK",
    "JOE"
  ],
  "total_words": 18867,
  "total_dialogue": 2,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. PATRICK’S HOUSE - DAY Joe waits on the stoop.   The door opens to reveal MRS. MCGUIRE, 42.   Patrick’s mom. JOE Patrick home? MRS. MCGUIRE Come in, Joseph. INT. PATRICK’S HOUSE, GROUND FLOOR - CONTINUOUS A modest country-theme home.   Thomas Kinkade and Precious Moments abound. MRS. MCGUIRE (calling upstairs) Patrick!   Joseph’s here. PATRICK’S VOICE I’m coming down. MRS. MCGUIRE Stay where you are!   He will come to you! PATRICK’S VOICE I’m fine, ma! At the top of the stairs, PATRICK MCGUIRE comes into view. Though also 14, he’s a brick shithouse, a man by any physical standard.   There’s an AIR CAST on his left foot.   He hops down one step at a time. MRS. MCGUIRE Mother Cabrini, protect my son. PATRICK Stop praying, ma. Another few steps.   Painstaking. MRS. MCGUIRE Look at you!   You’re sweating. You’re sweating from the pain! PATRICK I’m sweating from you, ma. Two more stairs.   He’s winded now.  5.",
      "characters": [
        "PATRICK"
      ],
      "action_text": "MRS. MCGUIRE I’m getting you a cold washcloth. PATRICK I don’t want one. MRS. MCGUIRE Well it’s happening.   How about you, Joseph?   Would you like a cold washcloth? JOE I would take one, yeah. PATRICK No one is getting a cold washcloth. INT. PATRICK’S HOUSE, LIVING ROOM - LATER On TV: “STREET FIGHTER 2” for Super Nintendo.   The boys sit in spitting distance of the screen, concentrating. PATRICK My mom reminds me of Blanka. JOE Because she wears cutoff jeans? PATRICK No, because everything she says, in my head, sounds like Blanka’s crazy victory roar.   Listen. On TV: After a knockout, BLANKA stands on his hind legs and roars three times. PATRICK (CONT'D) That’s the sound I hear whenever she speaks.   Just the jibberish of an undisciplined animal. JOE You hear that all day? PATRICK All day. He pauses the game. PATRICK (CONT'D) I have to get out of this house, man.  6. JOE What do you mean? PATRICK I mean I can’t stand another minute of it.   Of them.   They’re down my throat all day.   They don’t stop. JOE Well, you’ll be back at school Monday, right?   You can tough it out. PATRICK No, you don’t get it.   They’re killing me.   Like, I’m getting hives. JOE No you’re not. Patrick lifts his shirt: a few small hives are scattered on his torso. JOE (CONT'D) Shit. PATRICK Yeah, shit is right. INT. JOE’S HOUSE, KITCHEN - NIGHT Family dinner.   Joe sits with his father, FRANK (51), and his sister LISA (19), who wears a college-team hoodie. LISA Daddy, can Colin come tomorrow?   He really wants to meet you guys. FRANK Can I get some sweet potato casserole? (then) Who’s Colin? LISA He’s my boyfriend of seven months. FRANK Hm.   What are his prospects?   How does he plan to support you?  7. LISA He’s Sri Lankan. FRANK Right, right.   Aren’t we all. (passing food) Put that back over by you.   Move the water. JOE Speaking of tomorrow -- can you drive me to Wolf’s Pond at like 8? Joe notices Frank staring at him in mild shock. JOE (CONT'D) What? FRANK Tomorrow.   Thursday nigh",
      "dialogue_count": 1,
      "word_count": 5349
    },
    {
      "scene_number": 2,
      "slugline": "INT. HOUSE IN THE WOODS, “UPSTAIRS” - NIGHT Darkness.   Joe throws Patrick his used towel, then unrolls a sleeping bag. PATRICK (drying off) Where’s Biaggio? JOE I haven’t heard from him in 3 days. But every instinct in my body tells me he’s already up here. PATRICK Get the fuck out of here.   Gimme the flashlight. JOE You’re not gonna like the outcome of this. Patrick shines the flashlight around the room. JOE (CONT'D) I feel like he’d be right next to you. Patrick turns the beam to his immediate left and, sure enough, Biaggio stares back at him, a ghastly figure. Patrick SCREAMS.   Soundbridge to: EXT. TOTTENVILLE HIGH SCHOOL - MORNING The MORNING BELL, over an establishing shot. INT. TOTTENVILLE HIGH SCHOOL - MORNING Series of shots in various classrooms: A)   Spanish class. The teacher reads from an attendance book. SPANISH TEACHER Lacertosa?   (check) Laffin? (check) McGuire? Nothing.   We see an empty seat.  36.",
      "characters": [],
      "action_text": "SPANISH TEACHER (CONT'D) McGuire? B)   History class. HISTORY TEACHER Toy?   Joe Toy? C)   English. ENGLISH TEACHER Anyone hear from Joseph Toy? D)   Concert Band. BAND TEACHER Patrick McGuire here?   McGuire? The teacher looks to an empty seat in the trombone section. BAND TEACHER (CONT'D) Think you can handle first trombone today? A young trombonist slides into Patrick’s chair. TROMBONIST I think so, John. BAND TEACHER Once again people, we do not call teachers by their first names. E)   Health class. HEALTH TEACHER Toy? H)   Gym. GYM TEACHER McGuire? (silence)   Okay...Miller? (check)   Moscato? Cut to Moscato raising his hand.   He does have a weak chin. A phone RINGS... INT. MCGUIRE HOUSE, BEDROOM -- DAY A hand shoots into frame; Mrs. McGuire’s.  37. MRS. MCGUIRE Hello? AUTOMATED VOICE Hello, parent of (human voice) -- “Patrick McGuire” -- this is Tottenville High School calling to inform that your child was absent from one or more scheduled classes, and will require a written note -- She hangs up.   Reveal her laying in bed.   It seems as though she’s been there a bit. The door opens.   Mr. McGuire peeks in. MRS. MCGUIRE It was just the school. MR. MCGUIRE Okay.   If you want to come down...the police seem optimistic. She nods and rolls over, despondent. INT. MCGUIRE HOUSE, LIVING ROOM -- DAY Mr. McGuire at the table, sifting through photos of Patrick with a PLAIN CLOTHES detective.   Behind them, CAPTAIN ARTY DAVIS (50s) looks around. PLAIN CLOTHES Wrestler, huh? MR. MCGUIRE Yes.   A good one. CAPT. DAVIS (delicate) Did you notice if Patrick had been running with any new friends?   A different group than usual?   Anyone give you a bad feeling? MR. MCGUIRE No.   He had good friends.   He was popular, people liked him... He stares into space.  38. MR. MCGUIRE (CONT'D) My wife would know more about that. I don’t know if she...it’s just the shock of it. CAPT. DAVIS Honestly, I see a lot of these, and you guys are doing great.   You’re a tough bunch. Mr. McGuire t",
      "dialogue_count": 0,
      "word_count": 2980
    },
    {
      "scene_number": 3,
      "slugline": "INT. FRANK’S CAR - CONTINUOUS He starts the engine.   Then kills it. FRANK (to himself) Fuck you!   Pussy. EXT. MANSION - MOMENTS LATER He rings the bell.   Waits. An attractive, middle-aged brunette answers.   She’s taken aback to see Frank there. FRANK Clarissa. INT. CLARISSA’S KITCHEN - DAY They sit over coffee.   Opposite sides of the table. CLARISSA Had you guys been fighting? FRANK He called 911 over a Monopoly game. CLARISSA See, I don’t like that.   That’s a regression. Twin 19 year-olds, JOSH and JAKE, enter and raid the fridge. JOSH Ma, Denise is coming over later. CLARISSA Fine.   Just clean the basement. Without provocation, Jake backhands his brother in the crotch.   Josh doubles over, mostly in shock. JAKE Dick’d ya! JOSH Oh!   Dick’d ya! Josh chases Jake into the living room.   Clarissa sighs.  54.",
      "characters": [
        "JOE"
      ],
      "action_text": "FRANK I guess they don’t know. CLARISSA No, they know. (then) So, what?   The police came? FRANK Yeah, but it doesn’t...I mean, all we do is fight, Clarissa. CLARISSA Boys and their fathers clash, Frank.   It’s normal. (then) You didn’t get along with your father for decades, right?   And now you love and respect him dearly. FRANK Yeah, because he’s dead. (takes a sip) Joe wasn’t always like this.   This angry, this moody. Frank stirs his drink.   Uncomfortable silence. CLARISSA If you try to put this on me, the conversation is over. FRANK I’m not putting anything on you. I’m just saying.   He’s difficult. CLARISSA Every teenager is moody. FRANK Yeah.   One time we had a fight over his grades.   He told me my mother “sucked cocks in hell.” CLARISSA He did not say that. FRANK Verbatim. CLARISSA Hm...it’s from The Exorcist though. It’s not his original thought.  55. FRANK I think we can agree it’s not the number one thing to say about your grandmother. Silence.   She can’t argue that. FRANK (CONT'D) I’m gonna say something, because it has to be said.   And you have to hear it. (then) I think if you came back, Joe would too.   There it is. Clarissa nods. EXT. MANSION - MOMENTS LATER Frank stands facing the door, as it slams.   He stands there for a beat. EXT. TOTTENVILLE HIGH SCHOOL - DAY School’s out.   AARON waves goodbye to some friends, and breaks away.   He walks alone down the a street behind the school bleachers. The other side of the street is woods. INT. WOODS - CONTINUOUS Joe’s POV: Aaron, through trees. JOE Psst! No response. JOE (CONT'D) Psssst! Aaron keeps walking, content in whatever he’s thinking about. Joe picks up a rock and chucks it without aiming.   It hits Aaron just above the eye and ricochets out of frame. Aaron moans and drops to one knee.   He looks around, confused and in pain, putting up a desperate hand to ward off further attacks.  56. I know Biaggio desperately wants a dog. BIAGGIO It’s all I dream about. JOE Yes, but why do you want a dog",
      "dialogue_count": 1,
      "word_count": 4414
    },
    {
      "scene_number": 4,
      "slugline": "EXT. WOODS - CONTINUOUS Joe walks off, no longer smiling, his face red and flush. From behind him: PATRICK Joe.   Joe, wait up. JOE (smiling again) What’s up?   Why’d you leave her? Go back. PATRICK Joe...look man.   Nothing’s going on, okay? JOE It’s fine.   You win.   The best man won. PATRICK What does that mean?   She just likes me.   We get along. JOE Cool.   I guess she likes everyone though.   So I mean, if she likes everyone, she likes no one.   You know? Patrick snatches the bottle from Joe. PATRICK What the fuck is this shit... Arizona Iced Tea?   You’re sober, Joe.   Why are you acting like a weird lawyer or something? JOE You’re so young. (then) Listen, if you and your girlfriend want, come over later for dinner and a board game.   Okay? PATRICK “Come over”? JOE If you want. Biaggio will be there too.   Good times, good times.  80.",
      "characters": [],
      "action_text": "Joe stumbles off.   Patrick stares after him, bewildered. EXT. WOODS, SCENIC OVERLOOK - MOMENTS LATER Patrick and Kelly sit, facing each other. KELLY We’re not doing anything wrong. PATRICK I know. Patrick looks down, futzing around with a twig, thinking. KELLY Do you want to...do something wrong? PATRICK Very much so. He chucks the twig over the cliff.   She approaches and sits in his lap.   He puts his arms around her.   He’s easily twice her size.   They look in the same direction, over the trees. KELLY So did it work? PATRICK Did what work? KELLY This.   The house.   Are you happier out here? PATRICK I mean...I’m just happy to be where my parents are not. KELLY They can’t be that bad.   I mean what did they do, anyway?   Everyone at school thinks they were like molesting the shit out of you. PATRICK (laughs) “Molesting the shit out of me”?   No no. I would have stayed for that. (she laughs) No...it was nothing that sinister.  81. He thinks about it. PATRICK (CONT'D) They weren’t bad people, they were just always...there.   Down my throat, all day, every day. Constant and unyielding. I was getting hives.   The top of my head would tingle.   I thought I was gonna have a heart attack. KELLY So, they were down your throat... like everybody else’s parents. PATRICK No, “not like everybody else’s.”   I do not accept that. KELLY (laughing) Everybody else’s. PATRICK I’m fourteen.   My mom offered to cut my nails six months ago. She sits up, facing him. KELLY Every single morning, my parents set out three dollars and twenty- five cents.   The three dollars is for lunch.   The twenty five cents is so I can call and tell them I got to school okay. (beat) And I’m fifteen. PATRICK They watch me eat.   Sometimes they don’t say anything.   They get pleasure out of it. KELLY They watch me sleep.   Like serial killers.   I wake up, and they’ll be standing at the doorway. Patrick laughs.  82. KELLY (CONT'D) That’s just parents, Patrick.   All of them.   You have to, like, humor th",
      "dialogue_count": 0,
      "word_count": 678
    },
    {
      "scene_number": 5,
      "slugline": "EXT. WOODS - DUSK Moonlit.   An OWL leaves its perch, gliding over the trees. Bringing us to a wide shot of the HOUSE. INT. HOUSE IN THE WOODS - NIGHT A small thimble lands on CHANCE.   Kelly reads a card.   She and Patrick face Joe and Biaggio.   They all sit on the floor. KELLY Ooh -- advance to Indiana.   I’ll buy that. Biaggio smashes the floor in anger.   He and Joe smoke CIGARS. JOE Easy does it. (to them) He likes the red. BIAGGIO The color of blood.   The color of passion. PATRICK (to Kelly) I’ll give you B&O for both your utilities. KELLY Really?   Okay. PATRICK And your Get Out of Jail Free card. KELLY Yeah...but if I need it, can I have it back? PATRICK Yes, you can have it back. JOE That’s a smart trade. PATRICK Huh? JOE All four railroads for the utilities.   Saavy.  84.",
      "characters": [],
      "action_text": "KELLY And a Get Out of Jail Free card. Joe rolls his eyes. PATRICK Just play your game.   Don’t worry about us. Tense beat between Joe and Patrick.   Kelly’s eyes shift between the friends. KELLY ...Are you two alright? JOE (polite smile) We’re golden. (rolls die) Monkey. Joe moves his piece to FREE PARKING. Biaggio claps. KELLY Good job, Joe. PATRICK He didn’t do anything.   It’s dice. JOE I’m gonna put one more house on... Joe stops and looks at the board. JOE (CONT'D) Actually...Biaggio, I will give you Park Place and Baltic, and both my railroads, for both your oranges. Biaggio thinks about it. BIAGGIO I want a thousand dollars. JOE I will give you...a hundred fifty. BIAGGIO Yahtzee. They trade.   Patrick shakes his head.   This is catastrophic.  85. JOE (to Patrick)   Property manager, can I get hotels on orange? PATRICK You just gave him the corner, dickhead.   What’s the matter with you? Patrick puts the hotel on orange...then pauses.   He looks at his own piece.   He’s in jail.   A roll away from the oranges. Patrick looks at Joe. PATRICK (CONT'D) What’s up, Joe? JOE Nothing’s up. (big smile) It’s your roll, Tum Tum. PATRICK Joe, if I roll a six, eight or nine it’s gonna get very bad in here. KELLY (looking at board) Oh...yeah. JOE Well, I don’t know what to tell you.   Think of all the other numbers in the world. Joe leans back and exhales cigar smoke.   A woodland Bugsy. KELLY Well let’s just take a minute and relax.   It’s a game, right? JOE I’m relaxed.   Biaggio? Biaggio nods, gagging on cigar smoke. PATRICK What’s your fucking problem, man?? KELLY Just roll, Patrick.   Don’t let it get to you.   You’ll be fine.  86. A tense moment of silence.   Patrick rolls. EXT. HOUSE IN THE WOODS - MOMENTS LATER Wide.   A beat of nothing...then, the monopoly board flies out the window. INT. HOUSE IN THE WOODS - CONTINUOUS Joe retreats to the corner.   Patrick is trying to move toward him, as Kelly tugs his arm. JOE I have a cigar!   Be careful!   This whole place is",
      "dialogue_count": 0,
      "word_count": 948
    },
    {
      "scene_number": 6,
      "slugline": "INT. HOUSE IN THE WOODS - CONTINUOUS Joe sits on the sofa, back to the downed wall, taking in the ruin of his house. EXT. WOODS, PATH - NIGHT Various shots of Patrick, struggling on his bad foot, through brush and over huge, gangly roots.   He uses a large branch as a WALKING STICK. He sits on a rock, massaging his lower leg.   Angry.   Sad. It’s all hitting him. PATRICK Fucking Joe.   Asshole. Suddenly, we hear a RUSTLE.   Patrick looks up. PATRICK (CONT'D) Hello? Nothing. PATRICK (CONT'D) Is someone there?   Kelly? A shadowy figure wipes across the foreground.   We can’t make it out. PATRICK (CONT'D) Biaggio, you’re smarter than this. We hear a GRUNT.   It’s not Biaggio.   Patrick rises, moving down the path as quickly as his bum foot will allow. Then, a TUFT OF ORANGE HAIR catches his eye.   What is happening? Patrick limps faster now, panicking, out of breath.   A snarling ROAR. PATRICK (CONT'D) (to himself) Oh fuck.   God.   Jesus. FOOTSTEPS.   Whatever it is, it’s getting closer. Patrick STUMBLES on a root, and falls against a tree.   He turns, hiding behind it.  90.",
      "characters": [],
      "action_text": "Patrick takes his sneaker off, jamming the walking stick inside it to simulate a leg.   He sticks it out into the path as bait.   Nothing bites. Silence. He turns to look at the path.   It’s empty.   As he doubles back behind the tree: We reveal a huge, green 2-D computer-animated monster -- it’s BLANKA from “Street Fighter.” Standing on hind legs, it ROARS 3 TIMES in Patrick’s face. Patrick SCREAMS and, instinctively, SMASHES BLANKA IN THE FACE with his walking stick. Upon impact, Blanka transforms into what he actually is -- a small tree with a shock of red-orange leaves at the top. Patrick has cracked it in half. PATRICK (CONT'D) Huh. He stares at it, his head cocked.   He blinks.   Just a tree. Nothing scary about it. EXT. MOUTH OF THE WOODS - NIGHT Kelly, walking on a dark street.   Alone.   Unhappy.   We hear the clacking of her shoes. Then from behind her: PATRICK’S VOICE Kelly! She stops.   He limps/runs toward her, catching up.   They stand face to face for a beat. KELLY (blurting) I didn’t want any of this to happen I don’t want to come between friends I’ve just liked you for months and I figured if I came out here and we got to-- He kisses her.   She returns it.  91.",
      "dialogue_count": 0,
      "word_count": 401
    },
    {
      "scene_number": 7,
      "slugline": "EXT. HOUSE IN THE WOODS - NIGHT Joe tries to lift the fallen wall.   He’s not strong enough. He gives up, looks at it, rubs his shoulder. EXT. HOUSE IN THE WOODS, TABLE - NIGHT Joe picks bits of meat from a clean chicken skeleton. INT. TOY KITCHEN - SAME TIME Frank opens the refrigerator door.   The only option: leftover shrimp with lobster sauce.   Christ knows how old it is. Quick cuts: He picks the shrimp out and places them over some white rice. Pops the bowl in the microwave. Eats in front of the television. INT. FRANK’S ROOM - NIGHT Frank, alone in a king-size bed, staring at the ceiling. INT. HOUSE IN THE WOODS, UPSTAIRS - NIGHT Joe pulls the sheets up to his chin.   He rolls over, trying to get comfortable.   Sounds of the forest occasionally startle him. EXT. HOUSE IN THE WOODS - CONTINUOUS Extreme wide.   The house, a small and vulnerable structure in the huge, dark forest. INT. PATRICK’S ROOM - MORNING Patrick wakes up.   In his own bed.   He rolls over: His parents are watching from the doorway.   Disbelieving. Overcome. MRS. MCGUIRE We didn’t want to wake you.  92.",
      "characters": [],
      "action_text": "PATRICK You were watching me sleep. He smiles to himself. EXT. TOTTENVILLE, MAIN STREET - DAY Tilt down from the sky to a festive SMALL TOWN PARADE. Families, teenagers, the elderly, all line the curb. Marching down the street: attractive women in red, white & blue leotards.   Members of the local Chamber of Commerce inch behind the twirlers in a vintage Cadillac. Banners read “HAPPY MEMORIAL DAY.” ANGLE: A group of college-age kids, set back from the crowd, sit around an SUV, drinking, grilling. An adorable, long-legged girl in sparkle-y FACE PAINT (21) makes eyes at... A dangerous looking guy in a VISOR (26), standing way in the corner, with his back to the WOODS.   He takes a sip of beer. She looks away.   Then looks back. EXT. WOODS - DAY They make out against a tree.   The parade isn’t too far away, we can still hear faint music, applause. VISOR (takes her hand) Come on. FACE PAINT Where are we going? He leads her deeper into the woods.   They pause every few trees to kiss some more. EXT. WOODS, WATERING HOLE - MOMENTS LATER Shoes, flip-flops come off.   Unzipping; they are both stepping on their shorts, prying them off their ankles. Breaking the kiss, he takes her shirt off, chucks it.  93. VISOR Let’s go. FACE PAINT Wait wait wait.   Hold on. She dips her toe in, testing.   He grabs her, pulls her close, more kissing, kinda sloppy.   As they pull apart, a shape emerges drifts on the water behind them trees behind them: JOE.   Asleep in the tire.   Looking like shit, sun-blasted, filthy and too thin. They see him. FACE PAINT (CONT'D) Ohmigod! Joe wakes up. JOE (groggy) Wha...?   Pat--oh, Jesus-- Joe averts his eyes. The girl grabs her shirt, looking to cover up quickly. VISOR Kid!   What the fuck man! He and her dart off into the woods. JOE (to himself) Sorry... They’re gone.   Joe looks at the empty spot where they disappeared into the woods. EXT. WOODS - DAY Joe wanders, tossing twigs around, aimless.   Stumbling about, like a man who’s been in the desert fo",
      "dialogue_count": 0,
      "word_count": 581
    },
    {
      "scene_number": 8,
      "slugline": "INT. HOUSE IN THE WOODS - DAY He opens the cooler.   Scraps of odd, unidentifiable meat. Four berries in the bottom of a basket.   A rotten apple. EXT. WOODS - LATER Overcome by hunger, he closes his eyes and eats a bunch of PURPLE BERRIES. EXT. WOODS, STREAM - LATER Wide.   Joe VOMITS some purple stuff into the stream. INT. HOUSE IN THE WOODS - DAY Joe looks in the petty cash box.   Just some change.   Not even quarters. JOE Shit. INT. HOUSE IN THE WOODS, UPSTAIRS - MOMENTS LATER Frenetic camera.   Joe searches the pockets of his shorts, pants, everything he brought with him.   He pulls the pockets inside out.   Two nickels in one.   The rest are empty. His expression grows dire. In one of the pockets, we hear the crisp rustle of money -- he pulls something from a pocket, but it’s not cash: it’s an old   Boston Market order, scribbled onto a torn sheet of paper.   Shit.   He chucks it aside. He dumps out the contents of his DUFFEL BAG.   Rummages through the pile.   Beneath some junky housewares, he unexpectedly finds... The library books.   Still unopened.   “WALDEN.”...“105 OUTDOOR RECIPES”...“SO YOU WANT TO BUILD A CABIN”... And most appropriately: “I’D RATHER BE HUNTING.” Joe regards it with curiosity...  95.",
      "characters": [],
      "action_text": "CAPT. DAVIS’S VOICE From a statement given by Patrick McGuire... INT. POLICE STATION, CAPTAIN’S OFFICE - DAY Frank sits across from CAPTAIN ARTY DAVIS (45).   Frank leans against the wall behind them, watching.   The Captain reads from a file. CAPT. DAVIS “May 12th.   We had a fight.   Over something stupid, but...you know. It got out of hand.   I came home; there was no point in going on if we were fighting. (then) The destination was Tallahassee. It was Joe’s choice, he told me he liked the word, liked that it had three double-letters.” FRANK Hm.   Seems arbitrary. CAPT. DAVIS (nodding) Patrick continues: “I don’t pretend to understand the guy.   I just want him to be okay.   Let me know what you find out.” Davis closes the file.   Frank frowns. CAPT. DAVIS (CONT'D) I know.   But I looked in his eyes, Mr. Toy.   He was telling the truth. FRANK And the other kid? INT. POLICE STATION, OBSERVATION ROOM - DAY Frank and the Captain look through a two-way mirror: Biaggio stands next to a chair, across from two seated COPS. CAPT. DAVIS Biaggio Verga.   McGuire says he was with them the whole time.  96. (MORE) I’m afraid he’s given us nothing so far...he has a contempt for the law I’ve never seen in a minor. The captain presses a speaker button on a console.   We hear the conversation in the interrogation room. COP 1 Why don’t you sit down so we can have a nice discussion.   We’re all pals, right?   No reason not to be. CAPT. DAVIS (to Frank) He won’t sit.   Won’t deflate the room.   It’s actually very sophisticated. Biaggio walks to the two-way mirror and stares through it. He knows he’s being watched. CAPT. DAVIS (CONT'D) This kid is in my head. Biaggio returns to the chair, picks it up and walks calmly toward the glass.   The two cops quickly move toward him. COP 1 Whoa whoa whoa.   None of that. They wrestle the chair from him. CAPT. DAVIS He knows something.   Maybe a lot. Frank stares at Biaggio. EXT. WOODS - DAY Wide. To establish. EXT. WOODS - DAY A EUROPEAN STARL",
      "dialogue_count": 0,
      "word_count": 1272
    },
    {
      "scene_number": 9,
      "slugline": "INT. BIAGGIO’S KITCHEN - DAY Biaggio enters.   His FATHER sits at the table, shucking clams.   The following dialogue is in Italian, subtitled. BIAGGIO Dad? FATHER Sit. He pushes a bowl of closed clams toward Biaggio, and hands him a shucking knife.   Biaggio goes to work. BIAGGIO Have you ever quit at anything? FATHER Of course. BIAGGIO ...and did it hurt? FATHER Well, there’s good quitting and bad quitting.   I quit drinking soda: good quitting.   I quit law school: bad quitting.   Do you see? BIAGGIO Yes. (then) Did you ever quit on a friend? FATHER You should never quit on a friend, Biaggio. BIAGGIO But say you did.   Say you abandoned him, left him alone even after you swore your allegiance...would you go to hell for that? FATHER Of course. Biaggio nods.   He already knew this.  101.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 137
    },
    {
      "scene_number": 10,
      "slugline": "EXT. BIAGGIO’S HOUSE - DAY Long lens.   Biaggio walks outside, and into his yard.   Pull back to reveal a REARVIEW MIRROR in the foreground... We’re watching from Frank’s car.   Biaggio blasts out of his backyard on a bicycle.   Frank shifts into gear. EXT. MOUTH OF THE WOODS - DAY Biaggio parks dismounts, and walks it into the woods.   Once Biaggio has wiped frame, reveal Frank’s car PULLING UP in the background... EXT. HOUSE IN THE WOODS - DAY Biaggio emerges from the path, sighs with relief at the sight of the house.   Biaggio’s POV: The house looks better than ever.   Refinished.   Fire burning.   The colors seem more vibrant, the angles of incident more square. FRANK’S VOICE Kid, what the fuck is this. Biaggio turns around; his eyes could not be wider. INT. HOUSE IN THE WOODS - SAME TIME On Joe’s face: Asleep, slumped against the wall.   In the same clothes as the last time we saw him. FRANK’S VOICE How long?   The whole time?? Joe startles AWAKE. BIAGGIO’S VOICE Omerta.   The Sicilian code of silence. FRANK’S VOICE No!   No Omerta! Widen out: He’s sitting on the floor, as he was when the snake was there...but there’s no snake. FRANK’S VOICE (CONT'D) Joe?!  102.",
      "characters": [],
      "action_text": "JOE Dad!   Don’t come in!   Seriously! FRANK’S VOICE It’s over Joe!   It’s the end of the world! Frank barges through the door, holding Biaggio. JOE Dad, I mean it!   There’s a snake in here-- FRANK Bullshit, Joe!   Start explaining.   From the beginning. Then: BIAGGIO  Infamata . The serpent is COILED AT BIAGGIO’S FEET.   Staring at him. FRANK Whoa... JOE (hushed) Biaggio.   Be still.   Be calm. BIAGGIO I’m going to run.   I feel that I have to. JOE Biaggio, do not run. A beat of tension.   WE hear hissing.   Then...Biaggio runs. JOE (CONT'D) Shit-- The snake is upon him instantly.   Biaggio trips over himself and falls into the corner. Biaggio’s POV: the copperhead, coming straight for him. He SCREAMS.   It bites him in the CHEEK. On Joe: horror. FRANK (nauseous) Oh.   Oh my fucking Christ. Biaggio faints.  103. The snake turns toward Frank, and Frank immediately breaks into a run. JOE Dad!   No-- Frank throws furniture and debris, trying to deter it. FRANK The fuck is wrong with this thing?! The snake is upon him.   Frank braces himself... Suddenly, JOE’S SHOE pins the snake to the floor, landing just beneath its head.   It can’t move, can’t bite.   A machete enters frame, decapitating it.   Snake blood everywhere. Joe drops the machete, panting.   A shaken hero. FRANK (CONT'D) Joe... They stare at each other, overwhelmed.   Then: BIAGGIO’S VOICE Hello. Of course, Biaggio.   They rush to him; he’s flush, breathing heavy.   Bleeding from the puncture wounds in his cheek. BIAGGIO Did it get me? JOE A little bit. (to Frank) Dad, bury the head and body outside in two separate holes.   The loose venom can attract other ones. But Frank doesn’t move.   He still has so many questions. JOE (CONT'D) Now, Dad. Joe moves to the cooler. JOE (CONT'D) How do you feel? BIAGGIO Very different.  104. Joe hands him a plastic bag holding a bloody cut of raw meat. JOE Here.   You need protein. EXT. HOUSE IN THE WOODS - CONTINUOUS Frank scoops dirt over the snake’s body.   He emits va",
      "dialogue_count": 0,
      "word_count": 649
    },
    {
      "scene_number": 11,
      "slugline": "INT. HOUSE IN THE WOODS - CONTINUOUS Biaggio crawls to the sofa.   Joe helps him over, rubs his back. JOE Okay, okay.   Let it all out. (to Frank) Can you pull the car up to here?? FRANK Impossible... JOE` (to Biaggio) Hey -- do you feel up to a little walk, buddy? Biaggio closes his eyes and pisses himself again. FRANK He’s really...he can’t hold it, huh. JOE You’ve gotta carry him, Dad. Frank grimaces at Biaggio, who is soaked in himself. JOE (CONT'D) Dad, he will die. FRANK Joe, come over here.   Come here. Joe walks over. FRANK (CONT'D) Yes, we could carry him.   We could drive him to the hospital and hope for the best.   We could put him through all that.   Or we could just choose to remember him as he was. JOE Dad! JUMP CUT TO: Frank lifts Biaggio off the sofa, across his shoulders.   He flares his nostrils, nauseated.  106.",
      "characters": [],
      "action_text": "FRANK Ah fuck.   He smells like vinegar. EXT. WOODS - MOMENTS LATER Frank carries Biaggio through the woods.   Joe runs just ahead of them.   Biaggio bumps around, moaning.   It’s not a happy time in his life. INT. FRANK’S CAR - MOMENTS LATER Joe and Biaggio in the backseat.   Frank speeds, slaloming through traffic.   The windows are open. FRANK Keep him awake, Joe!   Keep him talking! BIAGGIO (weak) Wash me... JOE He keeps asking me to wash him! FRANK Godammit Biaggio!   We can’t wash you!   We don’t have the tools! BIAGGIO Clean my skin.   Make my skin clean. Frank’s POV - he blows through a yellow that just turned red. The camera flashes.   He will get a ticket. FRANK Fuck. In the backseat: BIAGGIO I’m open, Joe. JOE I know buddy.   I know you’re open. BIAGGIO Joe...what if I start to do other things, Joe?  107. JOE What are “other things”? BIAGGIO Other things.   Ass things. JOE Ass things... FRANK What’s he saying?   He gonna shit the car?? BIAGGIO I don’t want to shit the car. JOE None of us want that.   We’re all on the same team here. FRANK You gotta fight this thing, buddy. JOE Just don’t think about it.   Keep talking to me.   Just talk. We’re almost there and then you’ll get medicine and the pain will stop. BIAGGIO (at death’s door) Joe...I’m sorry...I’m sorry I led him here... JOE It’s okay man.   You didn’t know. BIAGGIO I didn’t know...I’m not...I would never betray you...I’m not like Patrick... JOE Yeah... Joe looks out the window.   A beat of sadness. JOE (CONT'D) Biaggio, do you-- But something’s wrong.   Biaggio’s eyes are CLOSED, his mouth foaming.  108. JOE (CONT'D) Oh God.   Oh Jesus.   His mouth, Dad! He’s foaming at the mouth! FRANK Uh...That’s good!   That means his body’s   fighting it. JOE Biaggio!   Fuck!   Dad, he’s dead! FRANK (truly worried) Okay, we’re here.   We’re here Joe. It’s out of our hands.   Just, I don’t know.   Pray for him. They SWERVE into the hospital parking lot. INT. EMERGENCY ROOM - MOMENTS LATER Frank rushes Biaggio ",
      "dialogue_count": 0,
      "word_count": 1407
    },
    {
      "scene_number": 12,
      "slugline": "EXT. HOUSE IN THE WOODS - DAWN END CREDITS ROLL over a wide shot of the house.   The forest teems around it.   Animals wander in and out, confused.   Light shifts as hours pass. In time, the sun sets on the empty house, though the fire still burns. THE END.  115.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 51
    }
  ]
}