{
  "slug": "king-richard-2021",
  "title": "king richard",
  "genre": "drama",
  "format": "film",
  "scenes_count": 13,
  "characters_count": 0,
  "characters": [],
  "total_words": 27877,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. PALOS VERDES COUNTRY CLUB - VARIOUS SHOTS - MORNING Richard’s garbled Louisiana drawl continues as he strolls the manicured grounds, collecting stray balls as he goes. He plucks them from trash as WHITE CLUB MEMBERS play. RICHARD (V.O.) ...when I’m interested in a thing, I learn it. How it works. How the best people in the world do it. That’s what I did with tennis and the girls. INT. RICHARD’S VW BUS - DAY Richard’s now at the wheel listening to a homemade tape as he drives to another club through postcard L.A. BUD COLLINS (V.O.)  If you look at the biggest servers.   Sampras.   Lendl. Connors.   You’ll see the break of their wrists is like a smack. Like a high-five.   That’s what you’re looking for when you hit it.   That pop.  Richard practices as he drives in his van, which is a character itself. Part mobile tennis clinic, part mobile home, it’s filled with schoolbooks, cassette tapes, audiobooks on parenting and self-help like   RICH DAD, POOR DAD , along with a ridiculous accoutrement of tennis shit.   Drill cones. Broken rackets.   Milk crates filled with hundreds of collected USED BALLS.   Like Richard, it’s charming and one-of-a-kind. RICHARD (V.O.) Now all we need is a club. EXT. FANCY TENNIS CLUB - DAY We now understand we’ve been hearing a sales pitch, which Richard is giving to an UNINTERESTED PRO at another fancy club. He hands him a HOMEMADE BROCHURE. RICHARD For training. And Clinics.   The whole deal.   Everything the girls need to go from prodigy to pro. 2. 8FLiX.com   SCREENPLAY   DATABASE FOR   EDUCATIONAL   USE   ONLY",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 265
    },
    {
      "scene_number": 2,
      "slugline": "EXT. ANOTHER FANCY TENNIS CLUB - DAY Richard’s presentation continues to BUD COLLINS (60), the Bob Hope of tennis, listening graciously, poolside. RICHARD I wrote me a 78-page plan for their whole career before they was even born. Bud laughs, quite amused and -- EXT. ANOTHER FANCY TENNIS CLUB - DAY Richard continues at another FANCY CLUB, following a very DISMISSIVE PRO. RICHARD It was 1977 and I had watched this tennis match, and I seen them give this girl - Virginia Ruzici -- 40 thousand dollars for four days work, and since I knew I’d only made $52,000 all year, I knew I was in the wrong business.   Went home that night, told the wife we need to make two more kids. OFF the DISMISSIVE PRO, just fucking flabbergasted and -- RICHARD (PRE-LAP) So that night I wrote up the plan. EXT. ANOTHER FANCY TENNIS CLUB - DAY Richard’s now cornered ANOTHER BAFFLED PRO at practice. RICHARD One for Venus.   One for Serena. Covered their tennis.   Educations. Foreign languages.   Everything. And now that plan says it’s time for us to come see you so you can help turn them into champions. He hands the pro the brochure and -- EXT. COUNTRY CLUB - POOLSIDE - DAY Bud flips through it too. A HOMEMADE PAMPHLET FULL OF NUMBERS, GRAPHS, and CHARTS.   The girls’ “FUTURE EARNINGS.”   Bud reads it in disbelief as --  (CONTINUED)  3. 8FLiX.com   SCREENPLAY   DATABASE FOR   EDUCATIONAL   USE ONLY",
      "characters": [],
      "action_text": "RICHARD Now, I know what you’re thinking. This family is from the ghetto. How they going to pay old me? EXT. ANOTHER FANCY TENNIS CLUB - DAY Richard’s on the court with the Baffled Pro. RICHARD Well, don’t you worry ‘bout that. We’re not here to rob you.   We’re here to make you rich. EXT. FANCY TENNIS CLUB - DAY The Uninterested Pro hands the brochure back to Richard. UNINTERESTED PRO You ever think about basketball? EXT. COUNTRY CLUB - POOLSIDE - DAY -- and Bud hands it back too. BUD COLLINS Best of luck to ya. RICHARD OK. You making a mistake but I’m gonna let you make it. Them pants look expensive. BUD COLLINS Oh, they are. EXT. ANOTHER FANCY TENNIS CLUB - DAY -- and finally, the Baffled Pro returns Richard’s pamphlet as well with some last words of advice. BAFFLED PRO If I had a dollar for every crazy parent who told me their kids’ll be number one, I’d be a rich man. RICHARD You look pretty rich to me. BAFFLED PRO Well, there you go.  CONTINUED: (CONTINUED)  4. 8FLiX.com   SCREENPLAY   DATABASE FOR   EDUCATIONAL   USE   ONLY The Baffled Pro serves. His STUDENT returns it. Richard can’t help but pipe in. RICHARD You need to open up your stance a little more. Your stance too closed. Off Richard’s frustration, heading off the court back to-- EXT. COMPTON, CALIFORNIA - VARIOUS SHOTS - DAY A different world.   A diverse, working-class neighborhood made infamous by gangs, drug wars, and NWA. Richard’s bus drives past the Compton Swap. D&K Donuts. Louis Burgers. Liquor stores on the corners. Cops on the streets.   Lowriders booming the latest tracks of the day. And right in the heart of it, we meet -- EXT. WILLIAMS’ HOME (COMPTON) - DAY TWO young BLACK GIRLS (8 and 9) lugging PHONE BOOKS from their front lawn. Both are adorable, in braids and glowing smiles.   The TALLER one carries THREE BOOKS.   The LITTLE one, not to be outdone, carries FOUR, barely seeing over the top. VENUS (TALLER GIRL) Serena, what are you doing?   Those books are bigger than you are. SERENA (L",
      "dialogue_count": 0,
      "word_count": 6840
    },
    {
      "scene_number": 3,
      "slugline": "INT. WILLIAMS’ HOUSE (COMPTON) - DAY (A FEW HOURS LATER) Oracene is sewing and Lynn’s doing homework when Richard and the girls arrive, holding their cards, the mood very low.   Oracene, prepared for the worst and then -- VENUS We got a coach. The room explodes in celebration.   The girls huddle off with their sisters.   Oracene hugging Richard. ORACENE Pete Sampras’ coach?   So he’s going to do it for free. RICHARD Well -- he said he can’t do two for free. He’s only gonna teach Venus. That hits like a brick.   They look back to see Serena, celebrating with her sister, reliving the scene -- SERENA You all shoulda seen Venus.   Pete Sampras was there.   I don’t think he could beat her at all. Oracene understands. ORACENE Did you tell Serena? RICHARD (shakes his head) You want to? She does not, watching Serena, unaware of the blow coming, dancing around with her sisters singing -- ALL THE GIRLS We gotta coach!   We gotta coach! Oracene watches her. It’s bittersweet because -- EXT. WILLIAMS’ HOME (COMPTON) - MORNING A few mornings later, Serena, now aware, watches sadly as Richard and Venus load their tennis gear into the van. SERENA It’s not fair. I wanna go with you.  (CONTINUED)  34. 8FLiX.com   SCREENPLAY   DATABASE FOR   EDUCATIONAL   USE   ONLY",
      "characters": [],
      "action_text": "VENUS I know.   I want you to, too. Meeka, Daddy said he’s gonna record everything and then we can watch it together.   He has a plan, OK? SERENA (under her breath) Yeah, for you. The girls hug on the steps when Richard comes over. RICHARD Ok, Meeka.   Your mom ready.   Y’all gon’ to practice today. SERENA I can’t practice on her court. She always hits slices. RICHARD That ain’t nothing but a few minor adjustments.   You got to stay prepared for whatever is unpredictable.   Ok, now give your Daddy a kiss.   Don’t put no mean on my face. C’mon Venus, let’s go. Serena kisses his cheek and then watches sadly as he and Venus pull off in the bus and -- INT. WILLIAMS' HOME (COMPTON) - MOMENTS LATER Serena enters to find Oracene with a crate of balls, dressed for practice, ready to leave. ORACENE I know you’re feeling left out, but you’re not left out. You got something great too. SERENA What? ORACENE Me. Come on, we got work to do. SERENA Right now? ORACENE Yeah, right now. I didn’t raise no poop butts. We got work to do.  CONTINUED: (CONTINUED)  35. 8FLiX.com   SCREENPLAY   DATABASE FOR   EDUCATIONAL   USE   ONLY Off Serena, a little lifted as -- EXT. AGOURA SPRINGS HOTEL - TENNIS COURT - DAY SCREECH!   SCREECH!   SCREEH!   The SQUEAKING OF SNEAKERS echoes across the court where -- Paul leads Venus through a grueling sprint work out. Suicides and sweet sixteens. PAUL What you’re going through is the Paul Cohen First Strike Strategic Tennis System.   It’s gonna make you a killer.   You’re going to learn to think of this tennis court as a chess board, with 228 shots. You will learn to perfect them all. Venus sees why.   She’s gasping for air. PAUL Go, go, go! Did I say stop? Center. Venus looks to her father who sets up his CAMCORDER on the sidelines.   A new situation for them both.   He nods his support and she takes off sprinting again and -- EXT. EAST COMPTON PARK - TENNIS COURTS - DAY Serena’s running ball-less drills on the court with her racket in hand while Oracene",
      "dialogue_count": 0,
      "word_count": 4861
    },
    {
      "scene_number": 4,
      "slugline": "EXT. EAST COMPTON PARK - A SHORT WHILE LATER Practice is done.   So is the rain.   Richard leads his daughters back toward the van.   All sopping wet. RICHARD Well, at least don’t nobody have to take no bath tonight. Just then, TD and two other gangsters pull up the van in their black lowrider.   Everyone freezes. Richard places himself in between the men and his daughters, readying for a fight, but TD looks at Venus -- TD I see what you all doing out there. Keep bringing those trophies home to Compton. Off Richard and the girls surprise -- EXT. WILLIAMS’ HOME (COMPTON) - NIGHT The VAN arrives home.   Still wet, the family heads inside when Richard sees a SHERIFF’S VEHICLE parked in his spot. VENUS Why are the police here?   RICHARD I don’t know. His dander up, Richard heads for his door and -- INT. WILLIAMS' HOME (COMPTON) - THAT MOMENT -- they enter the house to find -- 2 DEPUTY SHERIFFS and A SOCIAL WORKER going through their kitchen.   Searching the refrigerator while Oracene waits in the living room, ready to snap. RICHARD What’s goin’ on? Everybody OK? ORACENE They got a call, said there was trouble in the house and we were being rough with the girls and they needed to look. RICHARD Gotta call from who?  (CONTINUED)  55. 8FLiX.com   SCREENPLAY   DATABASE FOR   EDUCATIONAL   USE   ONLY",
      "characters": [],
      "action_text": "ORACENE (they both know; but) Not at liberty to say. RICHARD Oh, OK. You all need to look around? You can check in the cupboards. Maybe you can check under the beds. Make sure there’s no monsters. SOCIAL WORKER A little wet for practice, don’t you think?   Don’t they have school work to do? ORACENE They do their homework.   Tunde’s first in her class.   Isha and Lynn are too. RICHARD Girls, spell civilization. ALL THE SISTERS C-I-V-I-L-I-Z-A-T-I-O-N SOCIAL WORKER Mr. Williams?   This isn’t really necessary. RICHARD You wanna check on the kids? Let’s check on the kids. We got future doctors and lawyers, plus a couple tennis stars in this house. Now, I understand you got to do your job, even if some crazy-ass neighbor do call talking foolishness, and I don’t even mind you saying we hard on these kids, you know why? ‘cause we are.   That’s our job. To keep them off these street. You wanna arrest us for that, fine. But what you not gon’ never do is come knock on this door to say you blew our daughters’ damn brains out ‘cause they been hanging with hoodlums and doing drugs and things. That’s what you not never gon’ say in this house. You wanna arrest us for that? That’s fine. You need to be arresting the parents at them tennis matches.  CONTINUED: (MORE) (CONTINUED)  56. 8FLiX.com   SCREENPLAY   DATABASE FOR   EDUCATIONAL   USE   ONLY That’s who need to be gettin’ arrested. OFF the officers, realizing they got a bad lead -- EXT. WILLIAMS’ HOME (COMPTON) - NIGHT A short time later, Richard and Oracene are united on their porch watching the Sheriffs pull away revealing Ms. Strickland, watching from her lawn, then disappearing inside.   Oracene’s already heading that way. RICHARD Hey, where you going? ORACENE I’ll be back. And Oracene marches across the street and knocks on her door.   Ms. Strickland reluctantly opens up. ORACENE Hey Betty. MS. STRICKLAND Oracene. ORACENE I’ve never been over here before. That’s a shame. MS. STRICKLAND It is. ORACENE I know you know how har",
      "dialogue_count": 0,
      "word_count": 3704
    },
    {
      "scene_number": 5,
      "slugline": "EXT. WILLIAMS’ HOUSE (COMPTON) - DAY Lynn reads outside in the yard, yelling excitedly when a TAXI appears on their street. LYNN He’s here!   He’s here! She runs to the house where Richard leads the whole family out onto the porch to greet their guest. RICHARD Ok, ok.   Everybody come here and get in position. They align themselves at the door as Richard greets -- RICHARD Mr. Macci.   Welcome, welcome. Rick Macci stepping out of the cab, tennis bag in hand. MACCI Hello everybody. Richard shakes his hand and introduces him to the family. RICHARD Richard Williams.   This is my wife.   This is Brandi. MACCI It’s an honor. ORACENE Glad to see you. RICHARD This is all of our kids.   This our family.   This is Venus, Serena, Tunde, Lynn, Isha.   Thanks for coming.   We know you’ve come a long way, so don’t want to waste your time.   Wanna get over to the club? MACCI Let’s get it started. Venus and Serena head off to the bus. ORACENE Be good.   Be great.  (CONTINUED)  72. 8FLiX.com   SCREENPLAY   DATABASE FOR   EDUCATIONAL   USE   ONLY",
      "characters": [],
      "action_text": "A little shell-shocked, Macci follows them to the van and sits shotgun next to Richard, looking back at the girls. MACCI So uh, tell me one more time. Which one of you is uh -- RICHARD Big one Venus.   Little one Serena. MACCI Ok. I think I can handle that. Macci tries to put on his seatbelt as Richard pulls out. It doesn’t work. RICHARD Oh don’t worry about.   Don’t need that.  (honks the horn) We got Rick Macci in Compton! Macci, starting to realize, he’s in for a hell of a ride. EXT. EAST COMPTON PARK - DAY Parked at the courts, Richard starts to unload the van. MACCI Close her down, Richard? RICHARD Yeah, you can close it up. Macci lends a hand, following Richard onto the court when the gang members roll up in their car, like security. TD Hey hey hey!   Slow down haircut. Hell you think you’re going? Macci turns. MACCI Just uh, came to play some tennis. TD Hey Richard -- this Jimmy Connors- looking cracker with you? RICHARD Uh yeah yeah, white boy’s with us.  CONTINUED: (CONTINUED)  73. 8FLiX.com   SCREENPLAY   DATABASE FOR   EDUCATIONAL   USE   ONLY TD Ok, he’s cool. RICHARD Yeah, he just white. The gang steps aside, allowing Macci to pass. RICHARD See.   Promised you wouldn’t get shot, Rick. MACCI Appreciate it.   This is it, huh? RICHARD This is it.   Compton Country club. Macci’s just wide-eyed as the girls take the ratty courts, throwing footballs, tossing rackets, while Richard sets up his camera. The scene is surreal but Macci’s full of excitement, here on a quest.   A prospector on the hunt and... A FEW MOMENTS LATER Macci drills with the girls and once they start to hit, Rick knows he’s struck gold. MACCI Forehand.   Get there, good! Backhand.   Hey!   There you go, excellent.   Come on youngster, let’s see what you got.   Put some mustard on that hotdog. Go get it. Forehand. Backhand. Move! Fast feet. Good recovery! Good, good, again! Hey, I like it! Find the slot, rip the shot! He’s a goofball and they like him immediately.   Richard watches, stepping",
      "dialogue_count": 0,
      "word_count": 1410
    },
    {
      "scene_number": 6,
      "slugline": "EXT. RICK MACCI ACADEMY - VARIOUS SHOTS - DAY Moving at his quick, puppy-dog clip, Macci greets the Williams’ family warmly -- MACCI There they are. Wow, look at that. Hello everybody. Welcome to the Sunshine State. Gosh it’s great to see you guys. How was the trip? VENUS AND SERENA Long! But everyone’s just staring, mouths agape, at the club. MACCI (re: a golf cart) Richard, you see that blue bad boy there? I call it the comet.   I like to ride it around, makes me feel like I own the place, which is crazy, ‘cause I do. OFF their excitement, Rick leads The Family (everyone except Tunde) through his impressive facilities, passing PLAYERS and COACHES on the way, CHATTING everyone up as they pass: COURTS #7 AND #8 where YOUNG STUD MEN and WOMEN drill in the heat.   FOUR PLAYERS to a COURT.   PROS feeding from shopping carts. The pace is grueling and it looks like a boot camp.   The boys practice shirtless as JOCK ROCK SONGS blare. MACCI That’s Tommy Ho over there.   Won the U.S. JUNIOR NATIONALS at 15. He’s a top 50 pro.   Over there’s Eric Taino and John Roddick.   Both top 5 in the country for their age group.   Now Johnny’s got a little brother named Andy who’s a savage. He breathes fire. He’s good, but wait til I get my hands on him. The Williamses look on in awe, arriving now at -- COURTS #9 AND #10 Where a fitness session’s underway.   Sweat-dripping PLAYERS run through ladders, doing sprints, jumping rope.  (CONTINUED)  79. 8FLiX.com   SCREENPLAY   DATABASE FOR   EDUCATIONAL   USE   ONLY",
      "characters": [],
      "action_text": "MACCI This is it right here. You hear that sound? That sound is effort. I love effort. That’s my happy place. Very impressed, the family moves on to -- EXT. THE PATIO AREA - MACCI’S ACADEMY - MOMENTS LATER Snacks. Food. Drinks. You name it, it’s here. MACCI This is where we eat. Best french fries in Florida. Now look, this place will always be open and available to you guys. You help yourselves to whatever you want. LYNN Good, cause I’m hungry. ISHA (running after her) For real? We just ate. ORACENE Quite a place you have here Rick. MACCI It just got a lot better today. Oracene, Lynn and Isha head towards the food but -- Venus and Serena can’t think about food. They’ve got tennis on the brain. Macci sees. MACCI Come on, let me show you something. Macci leads them to the edge of the patio, now overlooking his kingdom, where they see -- COURTS #14 AND #15 Which are currently empty.   From the patio, Macci turns to admire them as to his left, Richard sees some... LESS IMPRESSIVE PLAYERS drilling on COURTS #9 and #10. RICHARD Whatchu got over there?   Chum?  CONTINUED: (CONTINUED)  80. 8FLiX.com   SCREENPLAY   DATABASE FOR   EDUCATIONAL   USE   ONLY MACCI Good eye. You know how it works. You need a few cheeseburgers to pay for the sirloin. You sell enough sirloin, you get to the filet mignon. (pointing to courts #14 and #15) This is Mecca.   Where you will be living and breathing.   Every day. You and me.   And the best pros we got.   This is where we hit the horn and pop the corn. And when we pop it, we pop with extra butter, right? They have no idea what this means, but it’s all incredibly exciting as finally -- MACCI Now, I got a little surprise for ya. This won’t happen every day, but since she’s here, I thought you might like to hit. Macci turns to the left where on CENTER COURT, a 15-YEAR- OLD GIRL takes a water break from her practice. She’s on court with a HITTING PARTNER and a COACH. MACCI Jennifer! Venus and Serena recognize her immediately.   #6 in the World,",
      "dialogue_count": 0,
      "word_count": 3094
    },
    {
      "scene_number": 7,
      "slugline": "EXT. RICK MACCI TENNIS ACADEMY - COURTS 14 AND 15 - DAY Arriving for practice, Macci walks on the court to find Barry and another assistant serving balls to each other. MACCI Let’s go! What do ya say, what do ya say, it’s time to get sharp for L.A.   Little steps, big results. Where is everybody? (as nobody speaks up) Somebody know something? What’s going on? BARRY (reluctantly) Disney World.   Richard said practice was canceled for today. Macci shakes his head in disbelief, hitting a ball out of frustration that soars off to the moon and then -- EXT. WILLIAMS’ HOUSE (FLORIDA) - DAY Macci leans against the hood of his NISSAN 300Z, parked outside, waiting as Richard’s MINIVAN pulls up the drive. Richard, Oracene, Venus, Serena, Lynn, and Isha get out of the car.   The girls wear MICKEY MOUSE EARS. MACCI Everyone have fun? SERENA I rode on Space Mountain. MACCI Space Mountain?   That’s great. Richard, a minute. ORACENE Come on, girls.   You’ve got homework. Oracene leads the girls away, leaving Richard with Rick. Aware a decision is looming, Venus lingers to eavesdrop. MACCI We had a practice scheduled. Tournament’s just a few weeks away. So we gotta practice. Venus and Oracene listen in.  (CONTINUED)  93. 8FLiX.com   SCREENPLAY   DATABASE FOR   EDUCATIONAL   USE   ONLY",
      "characters": [],
      "action_text": "RICHARD Yeah. I decided we not playing that tournament. VENUS Daddy, what? Why, what happened? RICHARD It’s ok Junior. I’m not letting him burn you out like he did with Capriati. MACCI I’m sorry. Like I did with what? RICHARD You were her coach, right?   That’s all you been saying.   Look at Jennifer.   Look at Jennifer. Well, we looking. She on TV. Shoplifting.   Arrested.   Venus is not gonna be cracked out in some alley ‘cause she got pushed there by you. Venus, not wanting her father to see her cry, heads off toward the house.   Oracene follows her in. Richard clocks their exit as he continues with Macci. MACCI You proud of yourself, now?   You just broke her heart. (about to leave it at that, but then) I’ll tell you what, man. You got a better curve ball than Greg Maddux. RICHARD Nothing personal, Rick.   Just gotta keep ‘em off balance. MACCI Not your teammates, you don’t. I’m pretty tired of these games. RICHARD What games? Macci shoots him a look -- are you serious?  CONTINUED: (CONTINUED)  94. 8FLiX.com   SCREENPLAY   DATABASE FOR   EDUCATIONAL   USE   ONLY MACCI You showed up here, first thing you did, you pull ‘em out of Juniors. Now you pull them out of practice for music lessons or homework or church or -- RICHARD They gotta get A’s if they want to play tennis.   That’s the rules. MACCI -- or you pull ‘em out to train with other coaches behind my back. RICHARD They needed work on their volleys. MACCI I’M WORKING ON THEIR VOLLEYS!   I’m their goddamn coach! RICHARD I’m roundin’ out their game, Rick. They’re not gonna get there doing drills that every Junior in America is doin’.   I’m just lookin’ out for my kids. Macci just shakes his head.   Unbelievable. MACCI You’re looking out for yourself. All I hear from you is pressure, pressure, pressure. Know what I see, every day, on TV?   ‘The Richard Williams Show.’   A million dollars.   Number one.   The greatest ever.   You don’t think that adds pressure? RICHARD It’s confidence. MACCI It’s bullshit.   And",
      "dialogue_count": 0,
      "word_count": 1883
    },
    {
      "scene_number": 8,
      "slugline": "EXT. BANK OF THE WEST TOURNAMENT - DAY (VARIOUS SHOTS) A drone shot pushes in on the bustling grounds of a PROFESSIONAL TENNIS TOURNAMENT as we hear -- ESPN REPORTER (V.O.) Welcome to Oakland, California, for the Bank of the West Classic, where tomorrow, world number one and reigning US Open champion, Arantxa Sanchez Vicario, will face a tough draw of challengers all hoping to take home the $400,000 purse. An ESPN REPORTER broadcasts as we see -- - TICKETED FANS entering the event through the turnstiles, making their way excitedly into -- - The massive event. PACKED PRACTICE COURTS where PRO PLAYERS warm up. THEIR COACHES looking on. PRESS covering the event. FANS watching, getting AUTOGRAPHS as -- INT. TUNNELS -- OAKLAND COLOSSEUM - DAY (VARIOUS SHOTS) A Madonna-esque, BLEACHED-HAIRED WTA OFFICIAL - (ANNE - CEO WTA TOUR) - leads Venus and her entire family through the backstage tunnels of the ARENA as the report continues -- ESPN REPORTER (V.O.) Among them, 14-year-old Venus Williams, who takes the court in her first ever professional match. On their walk, they pass -- ARANTXA SANCHEZ VICARIO, the Spanish superstar and #1 seed, speaking to a TOURNAMENT OFFICIAL, who treats her like a queen as -- ESPN REPORTER (V.O.) In fact, it will be the first match Williams has played at any level in over three years since her father made the controversial decision to pull her out of junior tournament tennis, which is the normal conduit to Tennis Superstardom. 101. 8FLiX.com   SCREENPLAY   DATABASE FOR   EDUCATIONAL   USE   ONLY",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 257
    },
    {
      "scene_number": 9,
      "slugline": "INT. LOCKER ROOM - OAKLAND COLOSSEUM ARENA - DAY Venus makes her way through a locker room filled with A DOZEN OTHER VERY ADULT, INTERNATIONAL PLAYERS and TOURNAMENT OFFICIALS waiting for their matches to begin, speaking ALL DIFFERENT LANGUAGES.   The record scratches when they see -- The teenager, looking a lot like a kid.   Venus pans over their skeptical faces and -- EXT. PRACTICE COURTS - DAY (VARIOUS SHOTS) The scrutiny and attention continues as Venus (wearing a RAIDERS HAT) practices on the courts with Macci while PRESS and FANS watch intently. ESPN REPORTER (V.O.) And many questions remain about how this talented youngster will now fare under the pressure and spotlight of the professional tour against veteran players after so long away from competition. A worry even her outspoken father cannot hide. Among the onlookers, land on Richard, coaching from the sidelines as we cut to: EXT. PRACTICE COURTS - OAKLAND ARENA - DAY Richard, interviewed ON CAMERA by the ESPN REPORTER. RICHARD You’ve been working for this day for nine long, hard years and you be saying, well, we gonna get there.   We gonna get there and, finally, you get there like today and you find out -- WOW! -- we don’t belongs here.   We belongs someplace else.   We belong back in the ghetto! Slowly, we back to reveal -- INT. MARRIOTT HOTEL (OAKLAND) - WILLIAMS' SUITE - NIGHT We are viewing the NEWS REPORT on a TV inside a hotel suite where Richard and Macci watch the segment wrap up.  (CONTINUED)  102. 8FLiX.com   SCREENPLAY   DATABASE FOR   EDUCATIONAL   USE   ONLY",
      "characters": [],
      "action_text": "ESPN REPORTER (V.O.) A genius? A huckster? Tomorrow, we’ll finally see. Is his dream only hype, or is his daughter, in fact, what the tennis world has been waiting for? MACCI You light a heck of a fire man. (flicking off the TV) Last year this tournament gave out 24 media credentials. This year, 200. They should hire you to promote it. His self-satisfaction is paused by a KNOCK on the door. Everyone jumps to action. MACCI We should get Venus, right? It’s go time guys. Look alive. RICHARD The Nike man’s here. Get in your positions. Macci opens the door to reveal PATRICK, A NIKE REP. MACCI Good to see you, my man. (then - introducing) Richard Williams -- Patrick and Richard shake hands as he introduces the family. RICHARD This is my wife Oracene. (then Venus) You know who that is. That’s who you brought the briefcase for. PATRICK (taking a seat) I’m sure it’s been a long trip and you’ve got a big day tomorrow so I am not going to take up too much of your time. I hope it’s clear how highly we regard your daughter. We’d love to take her off the table right now. Patrick presents them with AN OFFER.  CONTINUED: (CONTINUED)  103. 8FLiX.com   SCREENPLAY   DATABASE FOR   EDUCATIONAL   USE   ONLY PATRICK That’s THREE MILLION DOLLARS.   A signature line, a signature shoe. We’ll build our women’s brand around Venus and make her a marquee player. How does that sound? Patrick looks for an answer from Richard, who for once, confers with Oracene. They’re in silent agreement and -- RICHARD I don’t know why you’re looking at me. She’s the one you’re pitching. He’s pointing to Venus. Pat’s wrong-footed, recalibrates. PATRICK What do you think, Venus?   That’s a generous deal.   That’s one million more than Capriati got before she went pro, plus a real commitment to invest in the charity and outreach programs you and your family support.   We believe you are going to have a tremendous career and we’d like to help you start building it today. Sounds great.   Venus is silent.   Patrick t",
      "dialogue_count": 0,
      "word_count": 4024
    },
    {
      "scene_number": 10,
      "slugline": "EXT. OAKLAND COLOSSEUM ARENA - NIGHT Back in the arena, Venus still bounces in place, watching the COURT CLOCK TICK. 5 minutes... 6 minutes... Oracene turns to Macci in the stands. ORACENE What’s taking her so long? MACCI She’s icing her. ORACENE What?! She can’t do that?! There’s not a rule? MACCI There’s nothing they can do. She can just say that she’s in there using the toilet. It’s a dirty old trick. The family steams. The crowd bristles. Venus hops up and down, alone on the court, with nothing but her thoughts for what seems like an eternity.   A lifetime to consider and to start getting tight as -- The clock just keeps on ticking. Sucking the energy and momentum right out of the stadium until finally -- Venus does something she hasn’t done yet. She sits. INT. HALLWAY - OAKLAND COLOSSEUM ARENA - NIGHT Back in the tunnel, Richard watches his daughter killing time on TV, growing increasingly angry. RICHARD That’s eight minutes already. Eight minutes. (still nothing) Nine minutes. Come on, Junior. Get up. Because Richard understands exactly what’s going on and -- He’s shaking with anger when Vicario finally exits the bathroom, looking calm and unhurried as she heads back to the court. Richard just shakes his head as -- 119. 8FLiX.com   SCREENPLAY   DATABASE FOR   EDUCATIONAL   USE   ONLY",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 223
    },
    {
      "scene_number": 11,
      "slugline": "EXT. OAKLAND COLOSSEUM ARENA - NIGHT The crowd claps as Vicario returns, feigning apologies. CHAIR UMPIRE Time!   Let’s go. Venus looks at the clock.   10 minutes have passed.   It feels like an eternity. She rises up from the bench, but when she steps back up to serve, the energy has changed. It’s clear that she’s tight. She manages to get in her first serve, starting another long rally, but it ends when Venus -- very tight, short arms a backhand into the net. Richard watches, tries to clap, show support, but he’s attuned to a change and -- On the next point, Venus pockets the first serve into the net and carves in a slow second which -- BOOM! -- Vicario blasts it off the court for a winner.   A message shot.   Venus gets it. So does the crowd.   The air’s gone from the building.   Macci can feel it. Richard can too, knowing where this ends. Trying to will Venus on. RICHARD You still got this. You fine. And Oracene claps her up too only -- As Venus prepares for her serve, we see the nerves have arrived. She misses the first badly. Carving in a slow second. Vicario returns hard to her forehand and -- Venus misses badly in the net. CHAIR UMPIRE Game. Vicario. Williams is leading three games to two. But it doesn’t feel quite like she’s leading. The crowd can sense blood. Macci can too. And two very quick games later -- Venus is serving again, trying to regain her composure, but her mojo is gone. Vicario’s taken it. She’s waiting on the other side of the net with a scowl.  (CONTINUED)  120. 8FLiX.com   SCREENPLAY   DATABASE FOR   EDUCATIONAL   USE   ONLY",
      "characters": [],
      "action_text": "Venus tosses her serve, smacks it clean but Vicario’s there -- winding up, salivating, ready to knock the cover off the ball and -- WE COULD FREEZE IT RIGHT THERE.   Because Venus doesn’t win another game for the rest of the match. IN THE TUNNEL, Richard watches Vicario take control, winning point after point and game after game. CHAIR UMPIRE Game, Vicario. (again) Game, Vicario. (finally) Second set, Vicario. Venus never stops fighting, taking a nasty fall on the court, rising back to her feet, but knows the moment has passed. IN THE TUNNEL, Richard hurts for his daughter. Knowing it’s slipping a way. His eyes turn to the exit as -- ON COURT, Vicario moon-balls her way through another long rally that Venus finally ends, sailing a backhand long. Venus shakes her head in disgust. Feeling frustrated and alone until Venus looks up in surprise to see -- In the stands, there’s her father -- taking the empty seat beside Oracene for the rest of the match. Watching, not running. Venus understands. So does Oracene. She takes Richard’s hand and together, they support their daughter as -- In what feels like no time, the score reads:   6-2.   3-6. 0-5.   Venus is serving but it’s match point Vicario. After the return, Venus sails a forehand long and, like that, it’s all done.   She has lost. Just like that dignified girl back in juniors, Venus walks graciously to the net and shakes Vicario’s hand. It’s a moment of chivalry and Richard is proud, only -- The rug still has been pulled out.   The crowd is applauding but the bubble’s been burst.   The defeat feels enormous. They bet the house and they lost. HOLD ON Richard, clapping stoically, applauding his daughter, but knowing she’s hurting and -- END MONTAGE.  CONTINUED:  121. 8FLiX.com   SCREENPLAY   DATABASE FOR   EDUCATIONAL   USE   ONLY",
      "dialogue_count": 0,
      "word_count": 591
    },
    {
      "scene_number": 12,
      "slugline": "INT. LOCKER ROOM - OAKLAND COLOSSEUM ARENA - NIGHT Once she’s inside, the door’s closed, her disappointment pours out like the 14-year-old kid that she is. Her parent arrive, cloaking her in their arms as she cries. VENUS I shoulda won tonight. All the deals, the respect. You were counting on me. RICHARD Don’t you worry about those deals. I bet outside out that door, the hallway’s full of fools just fighting to hand you a check but that’s not what’s important. (beat) Look at me. You just went toe to toe for two hours with the best player in the world and you made her knees shake and you did it with grace. You don’t have respect for yourself now, you ain’t gon’ never have none. You’re a champion, Venus Williams, and the whole world knows it. Walk out with your head up. (finally) I have never been more proud of a person in my whole life. Venus smiles for her father’s sake, but she’s holding back tears, afraid he isn’t right and -- RICHARD Let’s go. Richard grabs Venus’ bag and they head for the door but -- VENUS Daddy. I’ll take my bag. RICHARD I’ll carry it Junior. VENUS No. I got it. Richard understands. He hands Venus her bag and she carries it herself out into -- 122. 8FLiX.com   SCREENPLAY   DATABASE FOR   EDUCATIONAL   USE   ONLY",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 230
    },
    {
      "scene_number": 13,
      "slugline": "EXT. OAKLAND COLOSSEUM ARENA - MOMENTS LATER The now empty arena where Venus reunites with her sisters, waiting for her in the stands. Richard leads his family across the vacant court, STADIUM LIGHTS beginning to shut off above them as -- They scale the steps of the empty arena, arriving at the exit where they open the arena doors to discover -- EXT. PLAYERS’ EXIT - OAKLAND COLOSSEUM ARENA - NIGHT A MASSIVE CROWD OF FANS, many of them YOUNG BLACK GIRLS, wait outside just for a chance to see Venus.   They explode in applause as she appears, chanting her name. CROWD VENUS!   VENUS!   VENUS!   VENUS! (and then seeing) SERENA!   SERENA!   SERENA! Venus is moved to tears at the sight.   Serena is, too. RICHARD It looks like they know. Go ahead, don’t keep them waiting. Full of gratitude, Venus kisses her father and heads out to meet her fans.   Serena follows, too. Richard and Oracene watch in amazement as their little girls shake hands, sign autographs, and inspire. They are moved to tears themselves.   And to cap it all off, Macci appears, flushed with excitement. MACCI Richard! Richard. Nike’s back on the line. They’re coming out of the woodwork. Puma. Fila. Reebok. They all wanna meet and they wanna meet first. (off Richard’s silence) I’m gonna tell ‘em they can kiss my backside. Finally, Richard smiles. He watches his daughters, swelling with pride, everything he’s predicted come true. RICHARD No, I think we’ll talk to those peoples. We’re gonna talk to ‘em.  (CONTINUED)  123. 8FLiX.com   SCREENPLAY   DATABASE FOR   EDUCATIONAL   USE   ONLY",
      "characters": [],
      "action_text": "MACCI Thank you, Richard. She did it. RICHARD Oh yeah, she did it. FREEZE ON RICHARD as these words appear on screen: SUPERIMPOSE:   NINE MONTHS LATER, VENUS SIGNED A CONTRACT WITH REEBOK FOR 12 MILLION DOLLARS. SHE WAS 15.  CUT TO: VENUS WILLIAMS SIGNING EVENT (ARCHIVAL VIDEO FOOTAGE) Venus and Serena, decked out in fly ‘90s REEBOK GEAR, hit balls at a promotional event in the heart of NYC. SUPERIMPOSE:   SERENA JOINED HER ON TOUR TWO YEARS LATER. AS THEIR COACH, RICHARD CONTINUED TO PLACE PATIENCE, FAMILY, AND EDUCATION ABOVE EARLY SUCCESS. NEARLY EVERYTHING HE PREDICTED FOR HIS DAUGHTERS BACK IN COMPTON CAME TRUE.  CUT TO: WIMBLEDON - CENTRE COURT - THE SISTERS (ARCHIVAL FOOTAGE) Two black girls in white braids taking the court before an all-white crowd, curtsying to the QUEEN of ENGLAND. SUPERIMPOSE:   VENUS AT 40, HAS WON WIMBLEDON 5 TIMES. SHE WAS THE FIRST AFRICAN-AMERICAN WOMAN IN THE OPEN ERA TO BE RANKED NUMBER ONE IN THE WORLD. SERENA AT 39, IS 23-TIME GRAND SLAM CHAMPION. SHE IS CONSIDERED BY MANY TO BE THE GREATEST FEMALE PLAYER IN THE HISTORY OF THE SPORT.   JUST LIKE RICHARD PREDICTED.  CUT TO: THE REAL RICHARD WILLIAMS (ARCHIVAL FOOTAGE) He cheers in the stands at the 1999 Lipton Open, holding up a homemade sign that simply reads:   “I TOLD YOU SO.” FADE OUT. THE END  CONTINUED:  124. 8FLiX.com   SCREENPLAY   DATABASE FOR   EDUCATIONAL   USE   ONLY",
      "dialogue_count": 0,
      "word_count": 495
    }
  ]
}