{
  "slug": "krampus-2015",
  "title": "krampus",
  "genre": "drama",
  "format": "film",
  "scenes_count": 9,
  "characters_count": 0,
  "characters": [],
  "total_words": 17724,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. DINING ROOM - NIGHT Sarah enters, hands Tom a sandwich.   He’s sitting by the window.   It’s getting darker outside, colder inside.   We’re starting to see their breaths. TOM It’s the strangest thing... No cars.   No people.   Not even a salt truck.   Don’t suppose you got me a backup generator, did you? SARAH Under the tree, next to your ties and underwear. Sarah sits, wraps a blanket around both of them. SARAH (CONT’D) Hey, what time is it?   Beth should probably be home by now, shouldn’t she? TOM She’s   fine , she’s at Derek’s. SARAH All the more reason to worry. TOM Hon, relax.   Just for once, okay? How’s everyone else doing? SARAH Cranky.   Bored.   Sick of the cold. And each other. TOM Tis the season. Sarah smiles, leans her head on his shoulder.   Tom seems surprised, as if they haven’t been this close in a while.   He gives into it.   Gently kisses her on the head. SARAH I miss us. TOM Me too. Beat.   And then THE WIND ROARS, RATTLING THE HOUSE.   Frozen trees SCRAPE the windows like phantoms. 30.",
      "characters": [],
      "action_text": "SARAH How long can this keep up? TOM Not long.   Not at this rate anyway. MORE WIND.   EVEN HARSHER.   And then... DISTANT SIRENS.   Tom sees Sarah is worried.   He is too, but hides it better. TOM (CONT’D) At least we know there’s someone else out there. MAX Mom?   Dad? Max lingers in the doorway, concerned. MAX (CONT’D) It’s almost dark our -- and Beth isn’t back yet. Tom and Sarah exchange a look, both of them thinking about Beth and the distant sirens they just heard... INT. LIVING ROOM - MOMENTS LATER THE CRACKLING FIRE.   Omi adds some logs.   Then, oddly, sneaks a glance up the chimney, as if anxiously looking for something. The rest of the family is huddled under coats and blankets. Junk food everywhere, Rosie the Bulldog snoring on her back. Howard awkwardly feeds Baby Chrissy a bottle while Howie munches on FRUITCAKE.   Dorothy shivers on the couch, nursing a flask and a good buzz. AUNT DOROTHY Tellya what, if I was one of those bums freezing in the streets right now? (finger across her throat) I’d just end it. Linda wraps a blanket around Stevie and Jordan, who are busy killing zombies on an iPad. LINDA Christ, Aunt Dorothy... 31. AUNT DOROTHY What?   Even on a nice day you wonder why they bother. Tom, Sarah, and Max enter, clearly worried. TOM Hey Howard, think your Hummer can get through this mess? HOWARD Lucinda?   Hell, I could point her due east, hit the gas, and be storming the beaches of Normandy by sunrise.   What’s up? SARAH Beth.   She went to her boyfriend’s earlier but should be back by now. AUNT DOROTHY See, let ‘em out of your sight for one second and BOOM -- shotgun wedding. LINDA Aunt Dorothy, please. AUNT DOROTHY You oughta know... Linda shrinks, stung by the truth.   Max then notices Omi becoming agitated.   Oddly so. TOM It’s probably nothing but I thought we’d pick her up and do a quick swing around town, see what’s going on out there. HOWARD A little recon mission, eh? (hands Chrissy to Linda) Thought you’d never ask. But they turn to",
      "dialogue_count": 0,
      "word_count": 746
    },
    {
      "scene_number": 2,
      "slugline": "INT. HUMMER - NIGHT FWIP FWIP FWIP -- WINDSHIELD WIPERS fight a losing battle with sleet and fog.   Tom rides shotgun while searching for a radio channel, but only finds STATIC. TOM It just doesn’t make any sense... HOWARD Try A.M.? TOM Tried everything. HOWARD Guess the storm knocked out all the stations too. TOM Yeah, guess so... Then Tom funds something -- the familiar long BEEP of the EMERGENCY BROADCAST SIGNAL fighting through HISSING STATIC: AUTOMATED EBS VOICE  --National Weather Ser-- has iss-- a blizz-- warn --entire Central Oh-- area, including Franklin Coun--, Dela-- Chagrin Falls, and Warren Vall-- temper-- negative -- degrees- - urged avoid trav-- seek shelter--  Neither man wants to admit how bad this sounds. HOWARD What I wouldn’t give for some Bing Crosby right about now. Tom quietly agrees when he notices something outside. TOM Wait, wait, slow down.   What is that...? They see a WIDE PATH freshly cut through the street. HOWARD Looks like a plow came through... 34.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 166
    },
    {
      "scene_number": 3,
      "slugline": "EXT. NEIGHBORHOOD STREETS - NIGHT The Hummer turns, followed by the plow trail.   MISTY HEADLIGHTS reveal CARS buried under huge sweeping SNOW DRIFTS. THE HUMMER continues along the carved path.   It’s almost like a frozen canyon, with snow piled high on either side.   Then the Hummer’s beams cut through the eerie mist to reveal: THE SNOW PLOW.   Rammed into a tree. INT. HUMMER - SAME TIME HOWARD Jesus H... Tom and Howard climb out. EXT. STREET - CONTINUOUS They cautiously approach the crashed plow.   Flashlights scan the driver’s door, hanging open.   The plow is empty. Tom finds a SHATTERED WINDSHIELD while Howard notices a trail of FRANTIC FOOTPRINTS scrambling away from the crash. HOWARD Must’ve lost control somehow. Maybe smacked his head on the windshield... stumbled that way? Tom checks inside.   Notices a PHOTO of a MAN AND HIS FAMILY clipped to the visor.   WRAPPED GIFTS in the passenger seat -- all covered in SHATTERED GLASS. TOM I don’t think it was his head that did that, Howard.   Look... Howard now notices the GAPING HOLE was punched INWARD.   On edge, Tom checks his phone again: NO SIGNAL.   Battery 5%. TOM (CONT’D) We gotta find Beth. HOWARD Snow’s too high, Tom.   Lucinda’s a tough broad but she ain’t gonna cut through the rest of this mess. 35.",
      "characters": [],
      "action_text": "TOM Well, Derek’s place is only a few blocks from here.   Same way as those tracks. Howard is already walking back to the Hummer, where he opens a LOCK BOX to reveal a SHOTGUN and .357 REVOLVER. TOM (CONT’D) You really think we need-- HOWARD I ain’t taking any chances. (hands him the revolver) Just point and shoot, my friend. TOM Kinda heavy. HOWARD Yeah, it’s Linda’s. As Howard SLAMS the trunk shut-- CUT TO: EXT. NEIGHBORHOOD STREETS - LATER MOVING WITH TOM AND HOWARD -- flashlights following the erratic footprints.   Looks like there was a struggle.   Then the white snow becomes dotted with red specks leading to A HUGE PUDDLE of icy blood-soaked snow.   Tom and Howard gawk at the frozen blood.   Howard looks down, sickened to realize he’s standing in some of it. HOWARD Sweet Lord... Howard is about to puke or run as Tom kneels down, inspecting some SHREDS OF CLOTHING, A WALLET, and KEYS. HOWARD (CONT’D) Tom, what kind of godforsaken neighborhood do you live in? Tom pockets the wallet and keys, then looks around at all the eerily quiet homes an notices: FONT DOORS ajar.   SMASHED windows.   MORE ERRATIC FOOTPRINTS leading from the porches into yards -- but none of the tracks seem to make it past the sidewalks... 36. Tom’s mind is racing, thinking only of Beth. TOM Come on. HOWARD But... Tom keeps going.   Howard reluctantly follows, gun raised, still glancing back at the puddle of frozen blood as we-- CUT TO: POP, HISS -- a MATCH lights an old SANTA CANDLE, his chubby face already melted into a demented scowl. INT. LIVING ROOM - NIGHT Sarah and Linda light candles, trying to keep things cozy. Max is trying to read a comic book but keeps stealing glances at the Santa candle, oddly uneasy.   His cousins snore nearby. Looking at the Christmas tree, Linda’s eyes light up: LINDA Oh my gosh!   You   had Mom’s angel this whole time? SARAH I thought you knew. LINDA No!   Ohhh, remember how we used to fight over who got to place her? SARAH (smiles) Yeah and you fought dirty",
      "dialogue_count": 0,
      "word_count": 8391
    },
    {
      "scene_number": 4,
      "slugline": "INT. KITCHEN - SAME TIME ...which echoes through the house. Everyone jumps, looks up. LINDA JORDAN?! STEVIE?? Linda runs from the room and into -- INT. LIVING ROOM - CONTINUOUS Linda follows the SCREAMS which seem to come from everywhere. Rosie the Bulldog whimpers and stares up the staircase. LINDA Oh my God where are they?! BABIES?? But the screams abruptly stop. Howard, Sarah, Tom enter as Linda zeroes in on Aunt Dorothy accusingly. LINDA (CONT’D) WHERE ARE THEY?! AUNT DOROTHY They were just here, I think they went to the bathroom! LINDA And you just let them go?! AUNT DOROTHY Was there another option?! LINDA (calls upstairs) JORDAN?! STEVIE?? Just the creaking house and wind. Linda starts up the stairs but Howard grabs her, holding her back. LINDA (CONT’D) Let me go! HOWARD! But Howard smartly senses that something is very wrong. HOWARD Shh. Listen... They hear TINY FOOTSTEPS followed by GIGGLES. LINDA Jordie! Stevie? Oh God, please answer... 74.",
      "characters": [],
      "action_text": "Tom draws his gun. SARAH What are you doing? TOM You guys stay, I’ll check-- LINDA Forget it, those are our kids, Tom. SARAH And no one’s going anywhere in this house alone. TOM Well someone’s gotta stay behind. HOWARD I’ll stay. SARAH You sure? Howard looks at Max, Omi, Dorothy and Chrissy -- the family members who need the most protection. HOWARD Yeah. I’m sure. MOMENTS LATER Each carrying FLASHLIGHTS, Tom, Sarah, and Linda climb the staircase. Tom has the gun, Sarah the axe, Linda a hammer. Linda makes brief eye contact with Howard before disappearing into the shadows. Howard mouths “I love you.” INT. UPSTAIRS HALLWAY - CONTINUOUS Darkness and eerie silence. Tom leads the way, gun raised. They’re all shaking from fear, the cold, or both. TOM (whispers) Stay together. A LOUD CREAK echoes from the attic stairwell, followed by more FOOTSTEPS and WHISPERS. 75.",
      "dialogue_count": 0,
      "word_count": 310
    },
    {
      "scene_number": 5,
      "slugline": "INT. LIVING ROOM - SAME TIME Lit only by fire and candles, Max, Omi, Dorothy and Howard anxiously listen to every sound from upstairs. Dorothy cradles Chrissy, trying to comfort both herself and the baby. Feeling an impalpable sense of guilt, Max turns to Omi. MAX Omi, I think this might all be my fault... Omi gently pulls him closer. And then, BEHIND THEM, we notice something in the firelight. Something on the mantel that wasn’t there a moment ago: A LARGE NUTCRACKER. Designed to look like a TOY SOLDIER, but with eerily realistic teeth. It stands perfectly still, but its appearance is more than unnerving.. Suddenly, a METALLIC CLANG echoes from the kitchen followed by BREAKING GLASS. Howard spins and aims his shotgun. ROSIE growls. Sounds like someone rummaging around. MAX (CONT’D) Uncle Howard? HOWARD Shh. Howard peers down the hall. More CLANGING. Dishes break. HOWARD (CONT’D) Rosie, c’mon girl. But Rosie whimpers and hides behind a couch. HOWARD (CONT’D) Useless turd. (to the others) Alright. Wait here. Howard grabs a KEROSENE LANTERN and heads for the kitchen... INT. ATTIC - SAME TIME Tom leads the way up the stairs. It’s pitch black and even colder up here. A layer of MIST hangs in the air while ICICLES and FROST creep over the walls and piles of junk. TOM Jordan? Stevie? 76.",
      "characters": [],
      "action_text": "They hear a faint MOAN from the far end of the attic -- where it’s darkest. And disturbingly, it’s accompanied by what can only be described as moist CHEWING. They hesitantly follow the sounds, flashlights shaking. INT. LIVING ROOM - SAME TIME Chrissy whimpers. Even the baby can feel the dread. AUNT DOROTHY It’s okay, I got you, we’re gonna be okay... Gripping the fire poker, Max stands guard. But he fails to notice that THE NUTCRACKER that was on the mantel a moment ago... is now gone. INT. KITCHEN - SAME TIME Howard creeps in. Heart racing. Light and shadows playing tricks on his mind. POTS and BROKEN GLASS litter the floor, as if something tore across the counter knocking things over. Howard then inches past the KITCHEN ISLAND, where a GINGERBREAD HOUSE sits. And inside,   something   moves... INT. ATTIC BEDROOM - SAME TIME Weaving their way through a maze of junk, Tom, Sarah, and Linda follow the CHEWING NOISES to the far side of the attic. Tom readies his gun. Linda is shaking so badly that she can barely aim her flashlight. They exchange nervous glances as they slowly peer over some old furniture and boxes. Their flashlights first illuminate what looks like a small WOODEN BOX, a faded JACK-IN-THE-BOX with a tiny handle -- similar to the one Beth found when she was taken. The lid is already open, but instead of a toy,   something else  has emerged from the box. Some sort of “creature”... Flashlights pan across its thick serpentine abdomen -- like a massive fleshly intestine sprawled across the floor, only at least eight feet long and horrifyingly bloated and distended. A scream rises in Linda’s throat, but it isn’t until their flashlights find the Jack-in-the-Box’s torso that the screaming really begins. Because its upper body is that of 77. A CLOWN. A dirty, ragged HARLEQUIN TOY that clawed its way out of a childhood nightmare and into reality. Even worse, the Clown’s stubby arms are clutching JORDAN’S LEGS -- shoving her head first into its dislocated jaws, t",
      "dialogue_count": 0,
      "word_count": 3597
    },
    {
      "scene_number": 6,
      "slugline": "INT. LIVING ROOM - SAME TIME Omi gawks as BLACK SMOKE pours out of the fireplace. The bricks and mantel CRACK as THE MUSIC STOPS, skipping on a static loop as the record has reached its end. Suddenly TWO LONG SKELETAL ARMS reach out form the hearth like pale spider legs covered in ash and soot. TALONED HANDS then clutch the lip of the hearth and PULL the massive body out of the chimney. Bones CRUNCH and SNAP as it twists and contorts to squeeze through. THUD. A HUGE HOOF hits the floor, crushing a Santa Claus ornament. THUD. The other hoof follows. Omi is oddly unafraid as this ancient, old world demon begins to RISE, slowly unfurling itself to stand at its full height. Meet KRAMPUS. His hulking form is draped in heavy layers of pelts and furs, all dark red as if dyed with blood. LONG CHAINS and RUSTY BELLS clank with each step. And while we see his silhouette in the flickering lantern light, we never see the details of his horrid face. We only see a mane of wild hair and a matted beard covered with frost and ice, framing two sunken GLISTENING EYES. Krampus looms over Omi, HISSING with perverse glee. A LONG SERPENTINE TONGUE emerges from his mouth as he caresses her cheek, savoring their reunion. Krampus then turns and opens his huge BAG OF TOYS and a chorus of WHISPERS and SNICKERS rises within... Terror fills Omi’s face as this MISCHIEVOUS CHITTERING grows louder. But before she can scream, a flurry of TINY MONSTROUS FORMS bursts from the bag as we -- SMASH TO: SCREAMING WIND. Reaching its apex, the frigid storm is a deadly combination of snow, sleet, and hail. 91.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 290
    },
    {
      "scene_number": 7,
      "slugline": "EXT. NEIGHBORHOOD STREETS - CONTINUOUS The neighborhood is unrecognizable. Houses and cars are completely buried. Broken trees covered in ice. It looks more like a dark fantasy landscape than suburbia. A LONE FLASHLIGHT pierces the darkness as the muted sound of a CRYING BABY barely rises over the tempest. THE FAMILY wades through waist-deep snow, trying to stay together. Tom leads, doing his best to guide them. Max looks back at their house one last time as its CHRISTMAS LIGHTS FLICKER AND GO OUT. His heart breaks, realizing Omi is gone... WE HEAR NOTHING BUT THE SCREECHING STORM. It’s too cold for the family to even speak. They can only point and gesture. Faces frost-bitten. Hands turning blue. They are freezing. This is a death march. LINDA stumbles, nearly dropping Chrissy, but Max and Stevie help her back up. TOM looks around, trying to get his bearings, when he spots THE CHARRED WRECKAGE of Howard’s hummer, only ten feet away. Which means the snow plow isn’t far... Tom gestures for everyone to follow when they hear THE SNOWBEAST’S ROAR in the distance. Getting closer. They try to move faster, fighting the wind, trying to help each other. Either they’ll all survive this or no one will. SINISTER EYES watch them from the darkness. Prowling in the trees. Crawling across roofs like wolves hunting their prey. Suddenly Max spots SOMETHING MOVING under the snow, tunneling towards them. Max tugs at Tom, frantically pointing. Tom sees it, aims the shotgun and BOOM! THE SNOWBEAST HOWLS in agony but keeps burrowing under the snow... getting closer and closer... Sarah, Linda, Stevie and Max keep running as Tom fires again and again until BOOM! Black blood erupts -- and the monster seems to retreat and disappear. For now. THE FAMILY desperately moves as fast as they can but it’s like running through quicksand. They turn a corner and spot THE SNOW PLOW, only thirty feet away. Their last hope, LIGHTNING FLASHES. And in the burst of light they see 92.",
      "characters": [],
      "action_text": "THE SNOWBEAST coming at them again. TOM waves for the others to keep going as he lingers behind, putting himself between the creature and his family. SARAH cries, begging Tom to come, but he won’t budge. All he can do is mouth   “I love you ”   in the harsh wind. Max watches as his parents gaze at each other in a final heartbreaking good-bye. And then Tom looks at Sarah and Max, hands the keys to Sarah, and urgently mouths   “GO.”  And as much as it pains them -- they do. Tom watches until they fade into the mist. He then scans the darkness, trying to see through the storm, when he spots THE SNOWBEAST, circling him -- TOM FIRES -- SNOW EXPLODES -- Tom keeps shooting until CLICK. He’s empty. Tom closes his eyes, bracing himself. And in a burst of wind... he’s gone. Pulled under the surface. AT THE SNOW PLOW Stevie climbs in first, then helps pull Max up to safety. Linda is lagging, struggling to carry Chrissy. Sarah turns to help when she spots THE CREATURE tunneling at them, closing in. Linda sees it too. Panics. Tries moving faster but it’s impossible. THE CREATURE is fifteen feet away... ten... six... Stevie and Max helplessly watch as the monster descends on Linda and Chrissy, and in the blink of an eye -- mother and daughter are pulled under. SARAH NOOO! Without hesitating, Sarah dives into the snow. A long tense beat as Stevie and Max scan the sea of white. And then-- SARAH RESURFACES next to the plow with Chrissy in her arms. She hands the baby and keys to Max. SARAH (CONT’D) M-m-max... t-t-take it... g-g-go... MAX No-- Mom, you can make it, you can-- 93. Sarah weakly smiles just as she’s PULLED BACK UNDER. Beat. Silence. As Max trembles, clutching the baby. MAX (CONT’D) MOM?! MOM!!! But she’s gone. Everyone is gone. Max and Stevie gaze at each other, realizing they’re the only ones left as we-- SMASH TO: MOMENTS LATER Max slams the door, hands the baby to Stevie. Fumbles with the keys and tries the engine. It sputters but doesn’t start. He tries again... agai",
      "dialogue_count": 0,
      "word_count": 2625
    },
    {
      "scene_number": 8,
      "slugline": "INT. MEGAMART - ON THE CONVEYER BELT - SAME TIME The family is approaching the vat’s edge... INT. MEGAMART - NEAR THE VAT - SAME TIME Max finally lurches for a FIRE AXE on the wall and THWACK! Hits the control box again and again, SHRIEKING WITH RAGE. SPARKS FLY as the giant machine finally clanks to a halt. Max climbs up the conveyer belt and reaches his family, starts shaking them wildly. MAX Mom, Dad - wake up! No one stirs. He hears THE ELVES SCREECHING in the distance, chasing after Beth... they’re getting closer. MAX (CONT’D) Guys c’mon! WAKE UP! SARAH’S EYES POP OPEN. She looks around, about to scream, but Max puts a hand over her mouth --   Shh!  TOM’S HANDS MOVE, frost and ice cracking away. Bleary eyed: TOM Max...? Max smiles, tears brimming as everyone starts to awaken, frightened and disoriented. But -- AN ELF is quietly rising up behind max, wielding a HUGE WOODEN MALLET. SARAH MAX! Max spins around as the mallet comes down, but CRACK! The elf screams as it plummets off the conveyer belt, revealing BETH. Clutching the baseball bat. MAX Help me untie them! Beth and Max start freeing their family, cutting through the ribbon and garland wrapped around their hands and ankles. But an eerie chorus of CHITTERING WHISPERS is building around them. Max looks around to see 101.",
      "characters": [],
      "action_text": "DOZENS OF CREEPY TOYS emerging from boxes and shelves all around the store, like spiders crawling from their nests. MAX (CONT’D) Faster, Beth, faster! BETH I’m trying! THE TOYS start crawling towards the conveyer belt, joined by the bruised and battered elves Beth dispatched earlier. BETH (CONT’D) I almost have it-- But a HUGE SKELETAL HAND suddenly reaches through the smoke and GRABS BETH. An arm hoists her up, revealing KRAMPUS. Looming over them. And this time we finally see him clearly, illuminated by fire and flickering lights. HIS WRINKLED FACE is like a saggy mask made of leathery skin, sewn together to resemble Santa Claus, but with dark hollow eyes that hint at something much worse lurking beneath. In fact, his whole appearance seems to be some sort of perverse DISGUISE to conceal a much more sinister entity. WITH A DEEP HISSSS Krampus gestures to his minions below. The toys and elves scramble to repair the machine. BETH KICKS AND SCREAMS as Krampus curiously inspects her. Sniffs her. HIS SERPENTINE TONGUE emerging from his jaws-- licking his chapped lips. He then turns and dangles Beth over the vat, about to drop her in when a SNOWBALL HITS HIS FACE. MAX LET HER GO! Krampus pauses and looks down at Max -- a tiny angry mouse. Max stares up defiantly, then he throws something else... MAX (CONT’D) I said let her go! THE SLEIGH BELL hits Krampus then bounces to the ground. Krampus cocks his head, considering the demand. Surprisingly, he then places Beth back on the conveyer belt with the rest of the family -- all staring in shock. 102. SARAH Max, what are you doing?! Krampus and max face off like gunslingers. Max is struggling to stay brave. He has nothing up his sleeve, he’s making this up as he goes along. Then an idea hits him. A very difficult one. Softly: MAX Take... Take me instead. The family is stunned. THE FAMILY Max?! No! Are you crazy?! Max ignores them as he walks   towards   Krampus. MAX Let them go. All of them. This is all my fault. TAKE ME! Kra",
      "dialogue_count": 0,
      "word_count": 1020
    },
    {
      "scene_number": 9,
      "slugline": "INT. LIVING ROOM - CONTINUOUS Max races down the steps and into the living room where he’s greeted by THE CHRISTMAS TREE, once again standing tall and bright, surrounded by colorful gifts. BETH About time you got up, we’ve been waiting forever. Beth breezes by and joins THE REST OF THE FAMILY. HOWARD Yeah kiddo, we were worried the sugarplum fairies got ya. A WARM FIRE crackles. BING CROSBY fills the air. Rosie the Bulldog lounges on her back, SNORING. MAX You... you’re all alive... Tom and Sarah look at each other, slightly worried. Aunt Dorothy plops into a chair, pouring rum into her egg nog. AUNT DOROTHY Barely. Haven’t had a hangover like this since the pope died. Trying to make sense of this, Max sits down between his parents as Omi walks by with a tray of hot chocolate. TOM What’s up, champ? You okay? Max stares at Linda, Howard, Jordan, Stevie, Howie and Baby Chrissy... His whole family. All here. MAX Yeah... I... Yeah. Just a bad dream I guess. STEVIE Enough with this sappy crap, let’s open our damn presents! LINDA Okay, okay, I’ve got it... (passes out gifts) Howie! Tom! Aunt Dorothy! Howard! Jordan! Sarah! Dad! Omi! Stevie! 105.",
      "characters": [],
      "action_text": "Ribbons and wrapping paper fly. Max braces himself, half expecting something monstrous to leap from the boxes, but it’s nothing but a sea of toys, clothes, and gadgets. Linda hands Max one final gift. LINDA (CONT’D) This one’s for you, Max. But instead of opening it, Max suddenly gives his parents a BIG WARM HUG. SARAH Whoa, hey -- what’s this for? MAX Nothing, I -- I just... (to everyone) ...Merry Christmas. SARAH (shrugs) Oh. Well, Merry Christmas, Max. TOM Merry Christmas, son. Max finally opens his gift to find THE RUSTY SLEIGH BELL. And his smile drops. In fact, everyone’s smiles fade as they gaze at the bell, dark surreal memories suddenly resurfacing. Memories of something impossible. Something horrifying. The creeping realization that the Christmas magic they all once denied is terrifyingly real. THE FIREPLACE flickers as a DEEP WIND shakes the house. And barely audible somewhere in the air: fading SLEIGH BELLS. The family stares in total silence. All of them remembering. Krampus. His minions. Everything. While ON THE STEREO: BING CROSBY  You better watch out, you better not cry, better not pout I’m telling you why... Santa Claus is coming to town...  We PULL OUT from the puzzled, shaken family... OUT THE WINDOW... and into their FRONT YARD. 106. BING CROSBY (CONT’D)  He’s making a list, and checking it twice, gonna find out who’s naughty and nice, Santa Claus is coming to town...  The Engel house then becomes a new SNOW GLOBE being placed on a shelf by familiar BONY HANDS. BING CROSBY (CONT’D)  He sees you when you’re sleeping, he knows when you’re awake. He knows if you’ve been bad or good so be good for goodness sake!  KRAMPUS’ RASPY BREATHING echoes as we continue pulling out from the snow globe to reveal DOZENS MORE just like it, some new, some old, all lit by candles in a DARK MUSTY WORKSHOP. BING CROSBY (CONT’D)  Oh, you better watch out, you better not cry, better not pout I’m telling you why...  We hold on this odd collection of snowglobes until A H",
      "dialogue_count": 0,
      "word_count": 579
    }
  ]
}