{
  "slug": "krypton-101-pilot-2018",
  "title": "krypton 101 pilot",
  "genre": "thriller",
  "format": "series",
  "scenes_count": 8,
  "characters_count": 0,
  "characters": [],
  "total_words": 11741,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. TRANSIT CORRIDOR - SKULL-SHIP - NIGHT A YOUNG MAN in a torn skinsuit is being beaten to within an inch of his life by THREE ROBOTIC SENTRIES.   Their faces are skull-like, approximating the ship they inhabit. Their victim is SEG-EL (21).   Our hero.   He is bruised, bloody, but unbowed.   Bravely struggling as he fades -- SEG Where is he?! One of the sentries STRIKES Seg across the face.   He reels, forces himself back to his knees -- SEG (CONT’D) WHERE IS BRAINIAC?! The sentries rain blows down on Seg until he collapses.   A sentry grasps his ankle and drags him down the corridor. INT. BRAINIAC’S THRONE ROOM - SKULL-SHIP - NIGHT As Seg comes to, he sees FLICKERING LIGHTS.   Like fireflies. Thousands of them.   And we slowly realize they are actually -- GLASS BOTTLES, DOME-LIKE Suspended in the air by a series of metallic COILS, like pea pods.   Seg stands, inspecting the closest bottle.   He GASPS. There’s a TINY, SPIRED CITY inside, complete with clouds floating above it.   Seg moves to the next bottle.   Inside it, like a snowglobe landscape, is ANOTHER MINIATURE WORLD. Seg moves from bottle to bottle; all of them contain micro- environments.   Landmarks of unusual architecture, bathed in artificial LIGHTS to simulate their native suns. Seg looks up, tracing the metallic coils from the bottles as they weave into a central stalk that feeds down into -- A THRONE-LIKE COMMAND CHAIR With a start, we now realize that a MONSTROUS FIGURE is seated there.   Silhouetted.   Eight feet tall.   A GREEN- SKINNED BEING, bald except for THE COILS connected to his skull, TETHERING HIM to the BOTTLED WORLDS around him. This is BRAINIAC.   Upon seeing him, Seg rushes the throne -- SEG You son of a bitch --! 2.",
      "characters": [],
      "action_text": "-- only to be stopped by a dozen SKULL SENTRIES that step from the shadows and array themselves before the throne. SEG (CONT’D) Where is she?! Brainiac makes a barely perceptible hand gesture -- and Seg drops, compelled by an unseen force.   He tries to rise, but it’s as if a great weight is pressing down on him. And now, Brainiac speaks.   Softly, without emotion: BRAINIAC  You have delivered yourself to me, Kryptonian.   What did you hope to accomplish?  SEG (in agony, with effort) -- destroy you -- BRAINIAC  Destroy me?   I am the Collector of Worlds.   I exist beyond all temporal and spacial boundaries.  Brainiac’s voice suddenly ECHOES ALL AROUND SEG, each of the skull sentries speaking in unison, mouthing the same words: BRAINIAC (CONT’D)  EVERYTHING ABOARD THIS SHIP IS TETHERED TO MY CONSCIOUSNESS!  The unseen pressure on Seg increases, driving him to his chest.   All he can do is keep his eyes locked on Brainiac. SEG -- these people -- these worlds -- they don’t belong to you -- Brainiac’s voice reduces back to a single, silken whisper: BRAINIAC  But they do, young Kryptonian.   I have assimilated them.   Just as I will shortly assimilate your world.  Everyone you have ever known or loved will live on --  Brainiac leans forward, revealing his nightmarish face. BRAINIAC (CONT’D)  -- in me.  3. Seg struggles against the crushing force that pins him.   He reaches to a pouch on his hip, removing something from it -- A CRYSTAL PENDANT OF SOME KIND Shield-shaped.   A distinctive “S” shape etched on its surface.   The glyph we’ve come to associate with Superman. Seg tries to aim it at Brainiac -- BRAINIAC (CONT’D)  The sunstone.   Did you really think that trinket could stop me?  A skull sentry breaks rank, stomping on Seg’s hand, crushing his fingers and simultaneously shattering the crystal. Seg CRIES OUT, both in pain and despair.   Clearly, whatever the crystal represented was his Hail-Mary. The skull sentry moves behind Seg.   A snaking DRILL BIT extends from ",
      "dialogue_count": 0,
      "word_count": 1453
    },
    {
      "scene_number": 2,
      "slugline": "INT. SEG’S HOME - COMMON ROOM - DAY The rest of the home is equally austere.   Seg emerges, now clothed in a simple gray uniform.   The shield pendant where his familial glyph would   normally   be is blank. Charys is working on a piece of needlework.   Like something one would see in a Tibetan temple.   Fifteen years on and she is still beautiful, with kind, dignified features.   Like her son, she wears gray, with a blank pendant on her lapel. CHARYS More nightmares?   Heard you cry out. Embarrassed, Seg looks to her needlework instead. SEG This is beautiful. CHARYS I’m hoping to get a few laureates for it at the market. SEG You’d get ten times that if you were still in the Guild. CHARYS But I’m   not .   So why dwell on it? He nods.   She’s right, of course.   A saint. SEG Where’s dad? CHARYS Already at the courthouse.   You know how Daron gets. SEG Then I should go, too. He bends, kissing her on the cheek, heads for the door. CHARYS Be safe!   And if the Shard happen to stop you -- SEG (grinning) -- I’ll drop and lick their boots. Promise! 8.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 195
    },
    {
      "scene_number": 3,
      "slugline": "EXT. RANKLESS DISTRICT - KANDOR - DAY Seg exits into a cramped and impoverished ghetto.   In Kandor, the richer you are, the higher up you live, literally. He glances up.   Far above, where the air is cleaner, are all those gleaming spires we glimpsed earlier, with DEFENSE CRUISERS and PERSONAL SKIMMERS zipping about. Seg passes an OLD WOMAN selling fruit.   Also rankless. SEG Morning, Mama Zed. She looks to the sky, squinting her eyes, playful. MAMA ZED Is it?   So hard to tell down here in the shadows. (nodding to her fruit) Take one.   You Els were always good to me. SEG You can’t call me by that name. MAMA ZED I’m   old , boy.   I remember a day when a man could take any name he  wanted .   Damned if I’ll forget something just because the Council tells me to. Seg smiles, appreciating the gesture.   Then notices -- TWO SERVITORS (robots) cleaning GRAFFITI: a stylized BLACK ZERO. SEG Black Zero? MAMA ZED Went up last night.   And as soon as those floating garbage cans finish, there’ll be more zeroes in its place. SEG Careful who you say that to, Mama. She waves him off, too old to care.   As Seg starts away, we -- -- FIND A HOODED FIGURE watching from the recesses of a doorway.   The figure falls in behind Seg, who is oblivious. 9.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 228
    },
    {
      "scene_number": 4,
      "slugline": "EXT. TOWER OF JUSTICE - KANDOR CITY CENTER - DAY The city center is gleaming, in stark contrast to the slums. The Tower is one of its crowning jewels, somehow managing to be both inspiring and intimidating. There’s a main entrance for RANKED GUILDSMEN.   But Seg heads for a discreet side door marked “LABORERS AND RANKLESS”. INT. SUB-BASEMENT - TOWER OF JUSTICE - DAY Seg pushes a file cart through a dark and oppressive maze of bookshelves.   Apparently, he’s some kind of gofer. A GREEN LIGHT on a shelf indicates a requested file.   As Seg pulls it, the light extinguishes.   Seg moves on, spotting more GREEN LIGHTS, pulling more files.   It’s monotonous. INT. LAWMAKER OFFICES - TOWER OF JUSTICE - DAY Seg pushes his cart from office to office, dropping off files for various LAWMAKERS, who are all wearing the Kryptonian equivalent of black barrister robes.   Everyone ignores him. INT. TRIBUNAL - TOWER OF JUSTICE - DAY An imposing amphitheater where CRIMINALS are sentenced without a jury.   The RED SHARD, Krypton’s military elite, stand guard.   A few OBSERVERS watch from stadium-seating. Seg pauses at a doorway with his cart, listening in: DARON VEX, The man who sentenced and executed Val-El (now Chief Magistrate) sits on an elevated stone bench. NYSSA-VEX (20s) a junior magistrate, sits dutifully nearby. As SHACKLED PRISONERS are paraded before Daron, a RANKLESS CLERK in gray hands him their files.   Daron perfunctorily reads out each sentence before handing the files back to -- -- the clerk, whom we now realize is Seg’s father, Ter. DARON Prisoner XL5169, ten cycles hard labor in the Mithen moon quarries. Shardsmen escort the prisoner away.   Another file, another prisoner is brought forth -- 10.",
      "characters": [],
      "action_text": "DARON (CONT’D) Prisoner DG7792, three cycles of somatic reconditioning. Just then, Seg happens to notice a SKETCHY-LOOKING OBSERVER in the stands nearby.   Dressed in brown.   A Laborer. BACK AT DARON’S BENCH Another file.   A third prisoner (female) is brought forward. DARON (CONT’D) Prisoner MB3414, comprehensive memory-wipe. The female prisoner SOBS, going weak-kneed.   She has to be forcibly dragged away, thrashing and WAILING the entire time. ON THE LABORER, Making his way to Daron’s bench.   No one but Seg has noticed him.   The laborer pulls a BLINKING DEVICE from his tunic -- SEG He’s got a bomb! Everyone reacts as the man SHOUTS with a zealot’s defiance: DISSIDENT WE MUST BEGIN AGAIN AT ZERO! Seg TACKLES the dissident.   They struggle, but even as Seg wrestles the detonator away the dissident produces a SLUG PISTOL, pointing it at Seg’s head when -- -- GUNFIRE from the nearby Shardsmen cut the dissident to ribbons.   Seg sits back, shaken, blood-spattered, but alive. DARON (PRELAP) Your actions today were commendable, Seg. INT. DARON VEX’S CHAMBERS - TOWER OF JUSTICE - LATER Seg stands before Daron, who has his back to him and is currently being helped out of his barrister robes by -- -- Ter, who shares a surreptitious glance with his son. Nyssa, the junior magistrate, sits primly nearby. Daron turns to face Seg now, taking a seat.   He motions to Ter, who dutifully pours Daron a cup of tea. 11. DARON And yet, I can’t help but register with some irony that Black Zero wouldn’t exist were it not for your grandfather’s actions. SEG He had nothing to do with their movement, Sir -- Ter shoots Seg a warning look: shut the fuck up, son.   But Daron continues, amused by Seg’s subtle act of insolence. DARON Nevertheless, he remains their de facto idol all the same.   You understand now, why the El name had to be expunged?   These dissidents seek to destroy our very way of life.   In Val-El, they see a kindred spirit.   A man who dared to challenge the Council’s auth",
      "dialogue_count": 0,
      "word_count": 3720
    },
    {
      "scene_number": 5,
      "slugline": "INT. GENESIS CHAMBERS - DAY The interior of the chambers is essentially one vast open shaft, ringed by a series of viewing platforms. Within the shaft, MEDUSOID ROBOTS float up and down -- like massive, cybernetic jellyfish -- attending thousands of GLOBULAR CRECHES; each creche containing a DEVELOPING FETUS. ANGLE ON A VIEWING PLATFORM, THIRTY STORIES UP Here we find Seg and Nyssa, looking out into the vertiginous shaft.   The awkwardness between them is palpable. NYSSA It’s strange to think our ancestors carried children in their wombs.   It just seems so -- inefficient. Seg nods, not really sure what to make of that. SEG Well -- should we do this? NYSSA I suppose so. Nyssa steps forward, waving her hand across a light screen set within a console.   In response -- A cylinder ELEVATES upward.   In the center, a thin NEEDLE. Seg pricks his finger on it, drawing a DROP OF BLOOD.   Nyssa does the same.   As their blood COMMINGLES -- A HOLOGRAPHIC IMAGE TAKES SHAPE BEFORE THEM A SPERMATOZOON fusing with an OVUM.   Coalescing into a ZYGOTE, then an EMBRYO, then a FETUS.   A VOICE speaks: ORACLE  The Oracle foresees the product of your union.   The child will be male. His name: Cor-Vex.   Forty-six ro in height, nine deben in weight.  The fetus EVOLVES into a toddler, then a walking CHILD. ORACLE (CONT’D)  He will be of sound health and good character.  The child becomes a MAN, adorned in the robes of the Lawmaker’s Guild.   Rapidly, he begins to AGE. 28.",
      "characters": [],
      "action_text": "ORACLE (CONT’D) Barring unforeseen accidents, he will live one hundred and seventy- three cycles in noble servitude to His Reverence. The “man” succumbs to old age, his body folding into itself, returning to its nascent, cellular form. The hologram dissolves.   The cylinder descends.   A beat of silence.   Then Nyssa deadpans: NYSSA I feel a rush of maternal warmth. Seg can’t help but laugh.   Maybe Nyssa isn’t quite so bad. NYSSA (CONT’D) “Cor-Vex”.   He seemed handsome enough.   There’s that, at least. SEG I guess.   But doesn’t it bother you?   Knowing exactly how his life will play out?   What he’ll look like?   When he’ll die? NYSSA I’m the fifth of   five   daughters, Seg.   It’s a miracle the Council is allowing me to bind with   anyone . I’ll take what I can get. (a playful dig) Even a rankless boy with a chip on his shoulder. SEG But why would your father call in favors for   me ?   He’s magistrate -- NYSSA Are you really that naive?   It’s  political .   You’re the grandson of a traitor.   One the terrorists have adopted as their own.   If he binds you to us, he’s   taming   you.   Proving that even a dreaded El can be coopted and brought into the fold. It’s a blow against Black Zero. SEG So I’m just a game piece. 29. NYSSA  Everyone   in Kandor is a game piece to my father.   Including me. Then, realizing she might have been harsh, she grins -- NYSSA (CONT’D) But you’re not   completely   repellent, so I suppose it could be worse. She reaches up, touching a scrape on his cheek. NYSSA (CONT’D) I heard about the bombing.   Try to stay in one piece, will you? (walking away) At least until our binding is over? Seg smiles at her, but as soon as she’s gone, his smile fades as he looks back to the Oracle console. SEG Oracle, I have another question. ORACLE  Proceed.  Seg pulls the “S” glyph crystal from his satchel, then slips it from the evidence bag and sets it on the light screen. SEG Can you tell me whose DNA is on this? ORACLE  Yours, Citizen Seg.  SEG I kn",
      "dialogue_count": 0,
      "word_count": 3334
    },
    {
      "scene_number": 6,
      "slugline": "EXT. OUTLANDS - NIGHT The skimmer retraces its path back towards Kandor’s force- dome, hugging the ground, using the fog as partial cover. INT. SKIMMER COCKPIT - NIGHT Charys checks the viewscreen, noting the Shard ships.   Now, there are nearly HALF-A-DOZEN converging on them. CHARYS We can’t outrun them for long. We’ll have to ditch our ship as soon as we’re through the dome. Seg nods, anxious.   Charys looks at him -- CHARYS (CONT’D) Seg, whatever happens, promise me you’ll keep the sunstone safe.   You have to activate that projector -- Suddenly, Seg sees SOMETHING MONSTROUS rising before them -- SEG LOOK OUT!!! EXT. OUTLANDS - NIGHT It’s one of the GIANT ICE WRAITHS.   Like a cross between a pteranodon and an orca, rushing to swallow the skimmer. INT. SKIMMER COCKPIT - NIGHT Charys reacts instinctively, rolling the skimmer at a forty- five degree angle, almost missing the beast’s gnashing jaws -- EXT. OUTLANDS - NIGHT -- but its teeth scrape the skimmer’s side, damaging one of its impulsers. Even worse, a PAIR OF SHARD SHIPS are now emerging from the fog, hot on the skimmer’s tail, FIRING at it. INT. SKIMMER COCKPIT - NIGHT Charys fights the controls of the now-crippled craft. 44.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 205
    },
    {
      "scene_number": 7,
      "slugline": "EXT. EDGE OF THE FORCE-DOME KANDOR - NIGHT The skimmer pierces the force-dome, wobbling erratically. EXT. INDUSTRIAL AREA - KANDOR - NIGHT Charys PANCAKES the tiny craft in a deserted street.   She opens the cockpit canopy immediately, urging Seg out -- CHARYS GO! SEG What about you?! Charys is furiously inputting commands. CHARYS I need to wipe the guidance system. I can’t let them use it to trace our path to the Fortress -- Just then, we hear the DOWNWASH of the scout ships, then see their BLINDING SEARCHLIGHTS.   Charys SHOVES Seg, desperate -- CHARYS (CONT’D) GO, SEG!   NOW!!! Seg darts away a second before the SEARCHLIGHTS converge upon the skimmer -- catching Charys in their blinding glare. AMPLIFIED VOICE PUT YOUR HANDS BEHIND YOUR HEAD AND EXIT THE SKIMMER!   LIE FACE-DOWN!!! ON SEG, Having barely managed to hide beneath the carriage of an industrial transport truck.   From his vantage point he sees -- SHARDSMEN ROPING DOWN FROM THE SHIPS They circle Charys, jabbing their rifles at her.   Charys makes eye contact with Seg.   He wants to intervene.   She shakes her head, willing him to remain hidden. The Shardsmen HANDCUFF Charys and roll her back over.   That’s when the leader of the group steps forward into the light. IT’S DEV-EM Just behind him is Lyta.   Upon seeing Charys, her eyes widen in surprise.   Dev-Em points his pistol at Charys’ forehead. 45.",
      "characters": [],
      "action_text": "DEV-EM Well, rankless?   Have you anything to say for yourself? CHARYS (after a moment) We must begin again at Zero. Off Seg’s face -- what the fuck? EXT. FORT ROZZ - KANDOR - NIGHT The imposing citadel we glimpsed outside the Shard training facility.   Part military barracks, part prison. LYTA (PRELAP) How could I have possibly known the trail would lead to your mother? INT. OBSERVATION ROOM - FORT ROZZ - NIGHT Seg and Lyta are standing before an observation window looking out onto an interrogation room where Charys sits. LYTA  Is   she with Black Zero, Seg? SEG (truthfully) I don’t know.   Can I talk to her? LYTA My mother’s already on her way. SEG Just give me a minute with her.  Please , Lyta -- LYTA (equivocating) A minute.   No more. INT. INTERROGATION ROOM - FORT ROZZ - NIGHT A door BUZZES.   Seg enters.   Charys looks up at him, smiling despite her circumstances.   He sits opposite her, whispering. SEG Lyta turned off the sensors.   We don’t have much time. (off her nod)  (MORE)  46. Why did you say you were with Black Zero? CHARYS I had to say   something   provocative. I didn’t want them to find you. SEG So you’re   not , then --? CHARYS No.   But they aren’t wrong about Krypton, Seg.   Something’s rotten with our world.   And it has been for a long, long time. SEG Let me give them the sunstone. Maybe they’ll spare you -- CHARYS You can’t.   This is too important. Your grandfather believed he could save us all.   Now it’s up to you to make that belief a reality. (grasping his hands) You   have   to do this, Seg.   It’s not just Krypton that’s at stake -- The door behind them BANGS open and Alura is there with a contingent of Shardsmen.   She nods to her troops, re: Seg. ALURA Get him out of here. The Shardsmen roughly escorting Seg from the room.   For a moment, the two women are alone, facing each other. ALURA (CONT’D) Charys-El. CHARYS General Zod. ALURA I invoke your family name out of  respect , Charys.   I want you to know that.   Our children love on",
      "dialogue_count": 0,
      "word_count": 2057
    },
    {
      "scene_number": 8,
      "slugline": "INT. FORTRESS OF SOLITUDE - NIGHT As Seg and Lyta enter through the cave door, Lyta comes to a stop, taking in the Fortress in all its moonlit glory. LYTA Oh.   Wow -- SEG Yeah.   It’s a lot to take in.   Come on, the projector’s in the back. Seg leads her past the curiosities, taking her straight to -- THE PHANTOM PROJECTOR Seg indicates the sunstone set within the control panel. SEG (CONT’D) My mother said it was supposed to activate this, but when I tried -- nothing happened. Lyta crouches, inspecting the mechanism.   She has an idea. LYTA It looks like an old hemo-lock. (off Seg) Hold out your hand. Seg does.   Lyta unsheathes her service dagger -- and makes a shallow cut across his palm.   BLOOD wells.   She points to the serpentine “S” inscribed in the stone. LYTA (CONT’D) You see how the glyph is indented? Let your blood fall into it. Seg squeezes his hand, letting his BLOOD fall onto the stone. The blood gradually fills in the “S”, turning the letter RED. After a beat, the negative space around the “S” GLOWS YELLOW. And Seg smiles, remembering something -- SEG “Our blood will bind us together.” My grandfather was giving me a clue.   Even back then. As if in response, the projector BEGINS HUMMING.   Seg and Lyta back away, unsure of what’s about to happen -- 56.",
      "characters": [],
      "action_text": "The rings begin SPINNING, each on their own, independent axis.   The HUMMING INCREASES until the rings are spinning so fast that they are now nearly invisible.   And in the center -- A PLASMA BUBBLE IS FORMING A GHOSTLY FIGURE takes shape within the plasma.   It speaks with KEENING WAIL.   Like a weak signal broadcast from hell. FIGURE  --HeEeeLLlo?  Lyta grips Seg’s arm, frightened out of her wits. FIGURE (CONT’D)  -- Iss-- sSSomeonNe --therRe?  But despite the seeming danger, Seg is compelled forward. There’s something about the ghost that seems --   familiar . SEG Grandpa? The ghostly figure resolves further, peering directly at Seg now.   It’s a man in his 50s.   Handsome, square-jawed -- FIGURE  --wHhoo isS -- tHhhatTt?  SEG It’s   me .   It’s Seg! And like that -- almost as if the emotional connection were the bridge it needed -- the image comes fully into focus. IT’S VAL-EL Having not aged a day since his apparent “death”.   He stares in astonishment at his grandson, his eyes welling with tears. VAL Seg. SEG You’re alive --? Val’s image warbles for a moment, becoming staticky again. VAL  YeSs -- but-- traPped herRe, for the momenNt --  57. SEG (it clicks for him) In the Phantom Zone. Val nods as his image coheres once more.   He looks to Lyta. VAL And who is this? LYTA Lyta-Zod, Sir. VAL (grousing) I hate Zods. Then Val looks back to Seg, a thought occurring to him. VAL (CONT’D) You’re a man now.   What cycle is it?   How long have I been dead? SEG It’s the fifth of Koron. Val’s eyes widen at this, his expression becoming more grave. VAL Shit.   He’s almost here, then. (more assertive now) Alright.   Two things.   First, you have to get me out of here -- SEG What’s the second thing? Val grins as if it were obvious. VAL Saving the god-damned universe from Brainiac. END OF PILOT 58.",
      "dialogue_count": 0,
      "word_count": 549
    }
  ]
}