{
  "slug": "kubo-and-the-two-strings-2016",
  "title": "kubo and the two strings",
  "genre": "drama",
  "format": "film",
  "scenes_count": 4,
  "characters_count": 0,
  "characters": [],
  "total_words": 20872,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. MOUNTAIN PATH - DAWN Kubo scrambles down the rocky path with practiced ease, his shamisen occasionally smacking against his hip with a dull harmonic BUMP, like when you jostle a guitar. In the distance a cluster of buildings peek out from behind a brightly ornate gateway. Kubo plays with his origami samurai   * as he walks.   * Kubo continues along the path over a bridge into the village,   * to a hubbub of activity beyond --   *  (0400 STT) STORY TIME  EXT. CENTRAL AVENUE - DAY It’s later in the morning and the main thoroughfare has become a vibrant pageant of peasantry and peddlers celebrating the second day of the   Obon Festival . -   A puppeteer operates an elaborate dragon marionette over the heads of SQUEALING CHILDREN. - FISHERMEN proudly waggle their pungent produce. Crustaceans crawl over each other in open crates. - A PATIENT DAD AND HIS YOUNG DAUGHTER browse the lanterns being crafted by skilled artisans. -HIGH CLASS LADIES barter and haggle for the most fashionable festival garments. - MERCHANTS pitch their wares to VILLAGERS from dusty carts. - MEN gamble on elaborate tile games. Two old curmudgeons sit in stony-faced contemplation over a chess-like game of   Shoji . And lining the street is the feudal Japanese equivalent of the Venice Beach boardwalk. A row of BEGGARS and STREET PERFORMERS, competing for coins, handouts, and attention: -   A hunched beggar woman, KAMEYO sits in the street, with a   * bowl in front of her. She smiles warmly when she sees Kubo walking toward her. She miraculously straightens up and seems much less woeful. KAMEYO Well hello, Kubo! He slides his shamisen off his shoulder and sits down next to her. Kubo peeks over the lip of the bowl. KUBO AND THE TWO STRINGS   5/92 DRAFT: 01.05.16",
      "characters": [],
      "action_text": "KUBO How is it today? KAMEYO Not a bad crowd. I got two pennies and a lint ball. She fishes around in the bowl and pulls out a clump of fluff. KAMEYO (CONT’D) This is pretty good lint. Kubo CHUCKLES and the old woman turns to him. KAMEYO (CONT’D) And what do   you   have planned today? KUBO Oh, you know. The usual. KAMEYO (grins) Monsters? KUBO Of course. KAMEYO You think you can work in a fire breathing chicken? Kubo fixes her with a look. KUBO The chicken again? KAMEYO (defensive) The chicken is funny. Kubo rolls his eye, but he’s clearly enjoying this. KAMEYO (CONT’D) A touch of comedy to balance the whole thing out. They’re going to be throwing money at you, I just know it. (thinks this over) Or they’ll throw something at you, I don’t know. KUBO (LAUGHS) Okay, I’ll see what I can do. KUBO AND THE TWO STRINGS   6/92 DRAFT: 01.05.16 Kubo stands to leave, but the old woman has one more thing. KAMEYO And do you plan on   finishing   the story this time, young man? Kubo just smiles and walks into the center of the square. In one graceful motion, Kubo drops his bag of origami   * creatures on the ground and spins his shamisen around. He grabs the   bachi pick   from his belt and raises it into the air, ready to strike. KUBO  IF YOU MUST BLINK, DO IT NOW!  He then brings it down across the strings, striking a beautifully resonant chord. With this, the entire dynamic of the marketplace changes. - Mid-haggle, merchants and their customers GASP. - The Shoji players look up from their game. One takes advantage of the distraction and cheats a winning move while the other is facing the other way. - Children watching the puppeteer look over and the puppeteer turns the head of his dragon, to see what is going on before the children cheer and run towards Kubo. SHOUTING ceases, CHATTER trails off. Even the TRILLING of   * songbirds in their cages and a distant dog’s BARKING stop. Everything is silent. All heads are turned. Kameyo moves through the gathering onlookers, pushing a ",
      "dialogue_count": 0,
      "word_count": 7185
    },
    {
      "scene_number": 2,
      "slugline": "EXT. CLIFFSIDE - DAY Fragmented remnants of colossal statues that once guarded the cliffs litter the landscape, dwarfing Monkey and Kubo as they approach, Monkey endlessly lecturing. Enormous heads peek out of snowdrifts. Ancient broken limbs reach among the rocks. MONKEY Tread carefully, Kubo. This   isn’t  one of your stories. Kubo doesn’t like hearing this. He lags behind, clambering up the broken nose to the eye socket of a wind-worn face.   * KUBO How do you know? Maybe it is. And I’m the valiant hero. And you’re the mean monkey.   * Her back to him, Monkey just continues walking. MONKEY You may think you’re the great hero, but heroes come and go. Any   * moment, something terrible could come out of nowhere and... She turns her head to confront Kubo and trails off. The huge eye socket is empty and Kubo is nowhere to be seen. KUBO (O.S.)   *  MONKEYYY!   * Hearing Kubo in danger, Monkey gives a YELL of primal fury,   * and darts across the rocks toward the statue.   * MONKEY Kubo!   * She peers down into the hollow head, catching a glimpse of   * Kubo, twenty feet below, being dragged down a sheer bank of ice descending into the shadowy bowels of the earth.   * Monkey doesn’t hesitate and jumps down into the darkness   * after him.   *  (1800 MEB) MEET BEETLE  INT. UNDERGROUND TUNNELS - CONTINUOUS Monkey slides down the incline into a series of ancient caverns carved with the faces of gods long since forgotten. KUBO AND THE TWO STRINGS   35/92 DRAFT: 01.05.16",
      "characters": [],
      "action_text": "Spotting Kubo and kidnapper in the distance, she takes off again, a breakneck pursuit through a dank, crumbling labyrinth that hasn’t heard footfalls for hundreds of years. Eventually, Monkey turns a corner and skids to a sudden stop. INT. BEETLE’S CAMP - CONTINUOUS Crouching in front of her is the creature. Part giant beetle, part human, shell mimicking the silhouette of samurai armor. Monkey gives a furious ROAR and rushes toward the creature. KUBO MONKEY! WAIT! Kubo suddenly steps out of the darkness right in front of her, hands raised, causing her to stop in her tracks. KUBO (CONT’D) He wasn’t trying to hurt me. He just wanted... Hanzo. Kubo motions down to the beetle and it becomes clear the creature was not crouching low to fight, but to get a better look at Little Hanzo, there on the ground. BEETLE (muttering to himself)  Hanzo?   Hanzo... Monkey, still wild-eyed and catching her breath, glares from Kubo to the creature. MONKEY I still think I am going to stab him. They watch as Beetle, utterly transfixed, reaches out a claw to gently touch Hanzo Origami. The figure seems to like him, strolling right on to his arm. KUBO Why must you always assume the worst? MONKEY Well, pardon me for misjudging this giant, spiky, insect-monster that just kidnapped you. Kubo ignores her. He’s watching Beetle intently. KUBO AND THE TWO STRINGS   36/92 DRAFT: 01.05.16 BEETLE Hanzo! Yes! I   remember   him. I think maybe... he was my master! KUBO What? What did you say? For the first time, Beetle appears to register Kubo and Monkey’s presence. He looks up at them, and there’s something a little unhinged about his eyes. BEETLE We had a crest! A samurai crest! He suddenly leaps up and enthusiastically digs into the pile of scavenged objects, pulling loose the fabric which he flourishes in front of Kubo and Monkey. It’s a large samurai war banner, emblazoned with the familiar beetle emblem. BEETLE (CONT’D) Have you seen this crest before? Wordlessly, Kubo turns to show Beetle the sa",
      "dialogue_count": 0,
      "word_count": 7056
    },
    {
      "scene_number": 3,
      "slugline": "INT. CAVE THAT REMINDS US OF HOME - NIGHT Kubo, and Beetle sit around a campfire, their attention is fixed on Monkey as she fusses around the cave, trying to avoid eye contact. After a while the weight of their collective gaze provokes a   * response. MONKEY You’re staring. Let me guess. You   * have questions.   * Monkey SIGHS and stops what she’s doing. Kubo and Beetle nod   * their heads in unison. KUBO Why-   * BEETLE I’ll start. First question, if I’m   * Beetle, and you’re Monkey, why isn’t he called “Boy”? MONKEY Oh boy. Questions can wait. We need sleep. Monkey spots Kubo’s eye on her and for a moment she holds his gaze. She smiles, but it is tinged with sadness, as though she would like to explain further but can’t find the words. KUBO Tell us your story. Then we can sleep. Please? Hearing this last word, Monkey hesitates. She smiles and   * relents, shaking her head in defeat as she knuckles closer. MONKEY Okay. Perhaps you can help me... She takes Kubo’s shamisen from beside his bag and slides it across the ground toward him. He picks it up, and plucks a couple of notes. MONKEY (CONT’D)   * The night I met your father... She hesitates. KUBO Mother? KUBO AND THE TWO STRINGS   65/92 DRAFT: 01.05.16",
      "characters": [],
      "action_text": "Monkey takes a deep, solemn BREATH. MONKEY My sisters and I went to the Temple of Bones to kill Hanzo.   * A moment of stunned silence. Kubo is still staring, in shock,   * bachi pick poised upon the shamisen strings. Monkey raises her eyebrows at him and clears her throat.   * KUBO Oh. Right. He begins plucking the shamisen strings again, and a delicate tune begins to play. Immediately all around the cave,   pebbles and twigs and fish bones and stalactites all begin to tremble and move.   Just like when the sail boat formed, they dance and weave through the air to illustrate her story, becoming a kind of makeshift planetarium depicting the night sky .  MONKEY At the bidding of the Moon King, my   * sisters and I had come down from the night sky and killed many noble warriors. Your grandfather told us that any man who found the magical armor would grow too powerful and be a threat to the heavens. That night I arrived at the Temple before my sisters. And there he was. The mighty Hanzo. The objects of the cave form an elaborate tableau of Hanzo first meeting Mother in the Temple of Bones. MONKEY (CONT’D) “You have offended my father,” I told him. “Now you must die.” BEETLE Yeah, that’s so you. Kubo nudges him with his elbow. KUBO Beetle! Shhh! The tableau Hanzo faces Mother, sword drawn. She falls upon him with her own sword, robe and hair writhing about her. KUBO AND THE TWO STRINGS   66/92 DRAFT: 01.05.16 MONKEY We fought. Hanzo was strong. But   * then he stopped. He looked into my eyes and uttered four simple words.   * These words changed everything. A breathless beat. BEETLE “I love you...   Monkey? ”   * MONKEY   * “ You   are my quest,” he whispered. I had seen the wonders of the   * universe, but the warmth of his gaze as I looked into his eyes...  That   I had never known. It was his  humanity   I saw. And it was more powerful than anything in my cold realm! Hanzo and Mother dance, holding each other closely. MONKEY (CONT’D) In recognizing his compassion I r",
      "dialogue_count": 0,
      "word_count": 4585
    },
    {
      "scene_number": 4,
      "slugline": "EXT. CENTRAL AVENUE - NIGHT Grandfather throws open his arms and his entire body breaks apart like a cocoon. We see the blur of a hideous head trailing a long serpentine body as it launches a hundred feet into the air. Seeming smaller than ever, Kubo stands there looking up at this towering beast. The Moon Beast LAUGHS, shaking the very foundation of the devastated village. Kubo YELLS, and runs at the beast, sword held high. It lunges down at him, fangs bared. Kubo leaps, spinning over its head and slashing at its pearly white flesh. The sword connects with a flash of sparks, like metal on metal. The beast recoils, but whether it’s out of pain or surprise is not immediately clear. Kubo is upon it again, a dazzling barrage of blows forcing the monster further back. Gaining the advantage, Kubo lunges with his sword, slicing deep into the creature’s vast white eye. The beast ROARS and thrashes, its enormous tail decimating a scorched building behind it. Furious, the beast twists around and comes at Kubo. He ducks through a charred doorway and somersaults out of a window, the creature bulldozing the entire building behind him. Kubo jumps and weaves as the monster lashes out. Each time he evades its claws or maw, he scores a hit with his sword. The beast relentlessly pursues him through the blackened shells of ruined homes. Despite his agility and tenacity, Kubo is running out of breath. It seems he’s fighting a losing battle. Exhausted, he stumbles, and the beast’s jaws lock down around his body. The armor buckles and cracks around him, and Kubo is spat out, SMASHING through the remains of a wall. Painfully, Kubo crawls back onto his feet, bruised and bloodied. The creature snaps its tail like a whip, coiling around Kubo’s body and pulling him up in front of its terrible face. The spiky tip of its tail hooks under the lip of Kubo’s helmet and flips it off his head. Giant tendrils of saliva fly out of its mouth as it hisses... KUBO AND THE TWO STRINGS   84/92 DRAFT: 01.05.16",
      "characters": [],
      "action_text": "MOON BEAST You want to be human? Then   share  their weakness! The tail around Kubo squeezes tight, crushing him. MOON BEAST (CONT’D)  Suffer   their humiliation! The spiky tail tears the patch off Kubo’s face. MOON BEAST (CONT’D)  Feel   their pain! The beast throws Kubo contemptuously to the ground. He lands in the dust beside the Sword Unbreakable. As Kubo goes for it the Moon Beast strikes him with its enormous tail, flinging him like a rag doll through the air.  (3500 T2S) THE 2 STRINGS  EXT. CEMETERY - CONTINUOUS Kubo CRASHES through branches and bushes, cartwheeling through the undergrowth leading down to the riverside cemetery outside the village. He eventually comes to a stop, barely conscious. His bag lands nearby, its contents strewn around him. In the distance we hear the Moon Beast ROAR as it smashes through the village on its way to finish Kubo off. Kubo blinks. Slowly pulls himself off the ground. He reaches out for his sword. From beneath his robe sleeve the two bracelets around his wrist are exposed. His mother’s hair and Beetle’s bow string. Kubo’s fingers pause over the top of the sword hilt. And then withdraw. And then, as quickly as he can, he deftly begins   re-stringing his shamisen,   using both string and hair. The Moon Beast thunders closer through the woods. Two strings in place, Kubo stares at the empty space where the final string should go. The Moon Beast appears, and finds Kubo kneeling on the ground, shamisen in hand. KUBO AND THE TWO STRINGS   85/92 DRAFT: 01.05.16 MOON BEAST  This is the end of your story. Now take one last look with that lonely eye. One last look at this wretched place you call home.  Kubo stands up. Defiant. KUBO I’m not leaving.  He then reaches up and plucks out a hair from his own head, and stretches it across the shamisen.  The Moon Beast CACKLES. KUBO (CONT’D) For every horrible thing down here there’s something far more beautiful. My mother saw it. So did my father. I see it, even with just one eye. The Moon",
      "dialogue_count": 0,
      "word_count": 2046
    }
  ]
}