{
  "slug": "labor-day-2013",
  "title": "labor day",
  "genre": "drama",
  "format": "film",
  "scenes_count": 32,
  "characters_count": 1,
  "characters": [
    "GERALD"
  ],
  "total_words": 25805,
  "total_dialogue": 1,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. ADELE’S BEDROOM - MORNING 9   9  The MUG OF TEA is placed bedside by a sleeping woman. We hear  the sheets rustle as she awakens.  ADELE (O.C.)  Good morning.  INT. HENRY’S BEDROOM - MORNING 10   10  The same hand goes through a boy’s closet. The clothes are  worn and a little dated and a little youthful for twelve. We  finally pull back to see Henry. He wears his sensitivity and  the anxiety of pre-sexual enlightenment like wet pajamas. As  he looks into his closet, his face reads dilemma.  MOMENTS LATER, he is trying on a pair of pants for Adele. He  clearly outgrew them a year ago. The cuffs are inches above  his ankles. The buckle won’t buckle.  ADELE enters frame and acknowledges the moment with a sigh.  ADELE  Okay. Okay. Pricemart, then.  EXT. DRIVEWAY, ADELE’S HOUSE - DAY 11   11  Adele and Henry hop in a station wagon littered with leaves.   *  It’s clear that Adele doesn’t take the car out often.  All voice over is Henry as a 35 year old adult, present day.  ADULT HENRY (V.O.)  My mother wasn’t a shut in. She had  just shut everyone out.  Adele drops the car into gear, but it slips back into  NEUTRAL. Henry notices and pulls the stick into REVERSE.  INT. ADELE’S STATION WAGON - DAY 12   12   *  Adele drives. Her hands SHAKE slightly as they hold the wheel.  ADULT HENRY (V.O.)  It was just the two of us after my  father left.  3.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 248
    },
    {
      "scene_number": 2,
      "slugline": "EXT. THE TEACUP RIDE, AMUSEMENT PARK - A DAY IN THE PAST 13   13  Henry with his FATHER’S NEW FAMILY. Wife, son, and kid sister  pull the disc in the center of the teacup to spin faster.  ADULT HENRY (V.O.)  He said I should count the new baby  he had with his new wife Marjorie,  as part of my family too, plus  Richard, Marjorie’s son.  INT. HENRY’S BEDROOM, ADELE’S HOUSE - A DAY IN THE PAST 14   14   *  Adele is holding a photo taken of that teacup ride.  ADULT HENRY (V.O.)  For the most part, my mother never  mentioned my father, or the woman  he was married to now.   *  ADELE  (studying the photo)   *  I would think your father would be  worried about the way that baby’s one  eye doesn’t match with the other.  You’d think they’d have her tested.  Does she seem different to you?   *  HENRY   *  ... Maybe a little.   *  ADELE  That baby doesn’t look anything  like you.  ADULT HENRY (V.O.)  I knew my part.  HENRY   *  She cries... a lot.   *  EXT. HOLTON MILLS BRIDGE - DAY 14A   14A   *  Adele drives over the scenic bridge into town.   *  EXT. BANK PARKING LOT - DAY 15   15  Henry hops out of Adele’s station wagon and enters the bank.   *  HENRY  I’ll be back in a sec.  4.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 225
    },
    {
      "scene_number": 3,
      "slugline": "INT. BANK - DAY 16   16  Henry walks up to the teller and hands her a check. We SEE   *  that it’s for CHILD SUPPORT.   *  TELLER  Hey Henry. How’s your mother?  HENRY  Fine.  TELLER  Hope to see her in here one of  these days.  The teller begins counting out twenty dollar bills.  EXT. PRICEMART PARKING LOT - DAY 17   17  Adele’s station wagon pulls in and finds a spot. Inside the   *  car, we see Adele take a deep breath.   *  ADULT HENRY (V.O.)  I understood who my real family  was. Her.  She looks over at Henry. Smiles.  INT. PRICEMART - DAY 18   18  It’s obviously a holiday weekend. Festive supplies are in  evidence. Families are stocking up for BBQs and get-to-  gethers. Adele and Henry push a cart down the aisle.  ADULT HENRY (V.O.)  Even if that meant only leaving the  house once a month to pick up  supplies at Pricemart.  Henry notices a pregnant woman with a basket of baby toys  approaching from afar. He takes control of the cart, pulling  it right, to avoid the pregnant woman.  HENRY  I think it’s this way.  Adele follows.  5.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 191
    },
    {
      "scene_number": 4,
      "slugline": "INT. BOY’S CLOTHES DEPT, PRICEMART - DAY 19   19  MOMENTARY POV through scratched glass of Adele and Henry.   *  We find Adele leafing through corduroys. Henry eyes the COMIC   *  BOOK TURNSTILE twenty yards away. He watches his mom   *  carefully for a moment, deciding whether she is okay.   *  HENRY  Mom, I’m going to go check out the  comic books.  ADELE  Of course. Just don’t wander far.  HENRY  (already stepping away)  Okay, I’ll be right over there.  INT. MAGAZINE RACK, PRICEMART - DAY 20   20  Henry walks past the ADULT MAGAZINES, just slow enough to  catch a glimpse of arms covering cleavage, moaning eyes.  He slows down again at the women’s magazines. COVER OF COSMO:  What Women Wish Men Knew That They Don’t.  Henry reaches for one when he is bumped by a middle aged  woman. Henry flinches and moves on to the COMICS RACK.  He spins the turnstile of superheroes. We’re following his  gaze down past caped crusaders when we find a pair of MEN’S  SHOES. They’re worn in and muddy. Upon closer glance, one is  stained with FRESH BLOOD, trailing from the man’s ankle.  Henry looks up following the legs and torso until he is  staring up at FRANK. He is the illustration in a biology  book, for a page they’d label   Man .  FRANK  Wonder if you could give me a hand  here.  Frank is wearing a RED PRICEMART VEST. Henry notices blood  over Frank’s right ear. Trickling down from his hair line.  HENRY  (careful)  You’re bleeding.  FRANK  ( like nothing )  I fell out a window.  6.",
      "characters": [],
      "action_text": "HENRY  We should get help.  FRANK  I wouldn’t want to upset anyone.  You came here with that woman over  there, right?  Frank nods at Adele, who is just leaving Boys’ Clothes Dept.  HENRY  My mom.  FRANK  What I wanted to ask is, if you  think she’d give me a ride.  We see Henry’s gears turning. Frank takes an awkward step  forward and places a firm grip on Henry’s shoulder.  FRANK (CONT’D)  She looks like the type of person  who would help me.  ADULT HENRY (V.O.)  He was right. That’s exactly the  type my mom was.  CUT TO:  Frank and Henry are walking with purpose in Adele’s  direction. Frank is trying not to limp. He grabs a BALLCAP,  quickly yanks off the tag and puts it on his head. Henry  notices but doesn’t say a word.  They turn a corner. Off comes the Red Pricemart Vest. Frank  grabs a FLEECE and quickly throws it on.  INT. HARDWARE DEPT, PRICEMART - DAY 21   21  Adele is analyzing LIGHT BULBS. Frank and Henry walk up.  HENRY  This is my mother Adele. Mom, this  is Frank. He needs our help.  Adele looks at Frank, quickly studying his face. Then back to  her son’s face - Frank’s muscular hand on his shoulder.  FRANK  You have a good boy here, Adele. He  was kind enough to offer me a ride.  7. ADELE  Oh, well... um. He may have... We  have a big afternoon. I don’t think  we can help you.  Frank reaches into his pocket and pulls out a baseball.  FRANK  (to Henry)  Shame. Thought we could have a  catch.  HENRY  I suck at baseball.  FRANK  Maybe you used to.  (fingering the stitches)  Throw around the ball with your  dad?  HENRY  I only see him on Sundays...   *  ADELE  (cuts Henry off)  I’m sorry, but we really can’t help  you.  For a moment, Frank clenches his teeth in pain. Then, he  MOVES HIS HAND to the back of Henry’s neck. It’s hard to  interpret whether it’s a gesture of kindness or a threat.  FRANK  (to Adele)  (Frankly), this needs to happen.  Adele looks deeply into Frank’s eyes. She makes a decision.  INT. CHECKOUT, PRICEMART - DAY 22   22  Adele’s it",
      "dialogue_count": 0,
      "word_count": 683
    },
    {
      "scene_number": 5,
      "slugline": "EXT. PARKING LOT, PRICEMART - DAY 23   23  Frank opens the rear passenger door of Adele’s car and lays  the fleece across the back seat.  FRANK  Don’t want to stain your upholstery.  ADELE  Thank you.  FRANK  (to Henry)  Why don’t you ride in back with me.  HENRY  (cautious)  Okay.  Henry enters the rear passenger door and slides over. Frank  sits down next to him and shuts the door.  Adele rounds the car, trying not to panic. She enters the  driver’s side door and takes a seat. Shuts the door. Silence.  ADELE  Where do you want to go?  FRANK  Your house.  Adele suppresses a reaction.  FRANK (CONT'D)  Just for a moment to rest my legs.  She looks back and sees her son sitting next to this  commanding and bloodied stranger. She turns the ignition.  INT. ADELE’S STATION WAGON - DAY 24   24   *  Driving back through the suburbs. Strangely calm and quiet.  Just as they pull up to a stoplight, A POLICE CRUISER pulls  up on their left. Henry notices. His heart quickens. Frank  keeps his eyes straight, trying to act calm. Adele looks over  at the cops. She thinks for a second, then puts on her signal  and turns right, pulling away from the cruiser.  They catch a glimpse of each other in the mirror. A moment.  9.",
      "characters": [],
      "action_text": "FRANK  Sounds like the rotors on your  brakes might be a little thin. I’ll  take a look when we get back.  EXT. ADELE’S STREET - DAY 25   25  Adele’s station wagon makes its way down the quiet cul-de-sac   *  and finally parks in the driveway. Frank takes a second to  look around for pedestrians before getting out to help Adele  and Henry with the groceries.  As they’re emptying the car, Henry can’t help but look back  at his neglected home, seeing it through the eyes of a  stranger for the first time in what’s obviously a while.  ADULT HENRY (V.O.)  Other than religious types or  someone with a petition, hardly  anyone ever came to see us. By this  point, my mom was down to basically  one friend and even Evelyn hardly  came by anymore.  Adele opens the front door. Henry goes to hold it for her,  but Frank already has an elbow on it. Smiles -   Get inside.  INT. ADELE’S HOUSE - DAY 26   26  Adele leads the grocery caravan into the kitchen. All the  while, Henry looks around, seeing what Frank is seeing.  ADELE  (quietly)  You’ll have to excuse the mess,  we’ve been busy.  Henry glances at his mother confused.  ADULT HENRY (V.O.)  Busy with what? The Spanish tapes?  We pan across POST IT NOTES with sharpie written Spanish  words like   Mesa, Silla, Agua, Basura...   We can even hear...  SPANISH LANGUAGE TAPE (V.O.)  ... la casa es de color rojo...  ADULT HENRY (V.O.)  Busy waiting to hear from Arak...  10. We pan along a faded photo of an African boy and an obviously  mass produced letter from an Aid Organization.  ARAK (V.O.)  Dear Henry, thank you for your  letter...  ADULT HENRY (V.O.)  Busy with the fox trot... The  waltz...  We move along the DANCE FOOT PATTERNS stenciled on the floor.  FLASH IMAGE: ADELE TEACHING HENRY TO FOX TROT IN THE KITCHEN 27   27  She can really move. Henry follows, concentrating.  ADELE  (into Henry’s ear)  A man should know how to dance...  When a man can dance, the world is  his oyster.  INT. ADELE’S KITCHEN - DAY 28   28  Frank place",
      "dialogue_count": 0,
      "word_count": 919
    },
    {
      "scene_number": 6,
      "slugline": "EXT. HOSPITAL - DAY 31   31  A wide enough shot to see a REAL DANGEROUS FALL.  Frank lands on the ground. His foot hits an uneven piece of  lawn twisting his ankle painfully.   SNAP...   goes a ligament.  INT. ADELE’S KITCHEN - DAY 32   32  Adele hands Frank his coffee. She seems to be taking in every  moment. Every inch of Frank’s face. Every gesture.  FRANK  I’d be grateful if you let me stay  til nightfall. I’d try to help out.  Wouldn’t ask anything of you.  ADELE  (cautious)  You just did.  FRANK  Nothing more than a place to lay  low and rest my leg for a few  hours.  ADELE  How do I know you won’t hurt us?  FRANK  I’ve never intentionally hurt  anyone in my life.  Adele considers this. We want to believe him. Henry observes  his mother carefully.  ADELE  You understand how that could be  hard to believe.  FRANK  I do. How far are the train tracks  from your backyard?  HENRY  Running?  FRANK  Limping.  HENRY  Twenty minutes.  13.",
      "characters": [],
      "action_text": "ADELE  People come over. Often. Randomly.  Friends, salesmen, religious  people...  Frank hides his disbelief.  FRANK  I’ll make a run for the train at  nightfall. I can stay out of the  way...  ADELE  I mean it would be noticed if I  went quiet. Even for a little bit.  FRANK  I just escaped prison. Last place I  want to go is back.  ADELE  (quickly)  I’m stronger than you think.  FRANK  (quicker)  I don’t doubt it.  ADELE  And I won’t let anything happen to my son.  Frank understands the importance of this moment.  FRANK  He’s in good hands.  Adele looks at FRANK’S HANDS.  EXT. HIGH DRIVE, FRANK’S GRANDMOTHER’S FARM - LATE 60’S 33   33   *  FRANK’S HANDS at 18 years old. He’s LOADING HAY. His hands   *  are strong, assured, practiced at what he’s doing.  ADULT HENRY (V.O.)  Frank had good hands. This was  important.  Frank looks up and catches eyes with MANDY, also 18. She’s   *  being toured by Frank’s grandmother. They share a smile.   *  14. INT. KITCHEN - A NIGHT IN THE 70’S 34   34  Adele and Gerald dance. His hand firmly grasps her back. They  are capable of that rare ballroom dancing that looks  effortless and improvised.  ADULT HENRY (V.O.)  So did my father. He knew how to move  a woman around the dance floor. That  meant a lot in my mom’s book.  ADELE (V.O.)  (always teaching)  Some men just set their hand on your  shoulder or against your back.  INT. LIVING ROOM, ADELE’S HOUSE - A DAY IN 1987   *  Adele is teaching Henry to dance.  ADELE  There has to be strong pressure  there...  EXT. FRANK’S GRANDMOTHER’S FARM - LATE AFTERNOON 36   36  Mandy works a fruit stand on the road. Frank drops off a few  pies to sell. Mandy dips her finger in one of them and tastes  it. Frank takes in her dangerous smile.  EXT. FRANK’S GRANDMOTHER’S FARM - TWILIGHT 37   37  18 year old Frank and Mandy are chasing each other through a  field of tall grass towards the farm house. He grabs her.  ADELE (V.O.)  ... Something to push back against.  INT. KITCHEN, ADELE’S HOUSE - A DA",
      "dialogue_count": 0,
      "word_count": 565
    },
    {
      "scene_number": 7,
      "slugline": "INT. INSURANCE OFFICE - DAY 39   39  Gerald speaks to a couple from behind a desk.  ADULT HENRY (V.O.)  Instead my father got a job selling  insurance policies.  INT. KITCHEN, ADELE’S HOUSE - A DAY IN THE PAST 40   40  Adele curled up with a book. Henry watches from the floor.   *  ADULT HENRY (V.O.)  I don’t think losing my father  broke my mother’s heart, but rather  losing love itself...  EXT. BARN, FRANK’S GRANDMOTHER’S FARM - DAY 41   41   *  18 year old Frank leads Mandy into the barn from the high   *  drive. They eye each other in the dim shafts of light.   *  ADULT HENRY (V.O.)  ... The look of someone who thinks  you’re beautiful every day.  INT. ADELE’S BEDROOM - A DAY IN THE PAST 42   42   *  Henry brings Adele breakfast in bed. On the tray is a   *  birthday gift - A homemade coupon book.   *  ADULT HENRY (V.O.)  Even at that age I understood this  and wanted to make up for some of  the neglect. I made her a coupon  book that said “Husband for a day”.  I cleaned...  HENRY SCRUBS THE SLATS BETWEEN THE FORKS AND KNIVES 43   43  ADULT HENRY (V.O.)  ... did little chores around the  house.  HENRY TIGHTENS THE HINGE ON A DOOR  ADULT HENRY (V.O.)  There was a coupon for a shoulder  rub...  16.",
      "characters": [],
      "action_text": "HENRY ATTEMPTS TO MASSAGE HIS MOTHER’S SHOULDERS WITH HIS  SMALL TWELVE YOUR OLD HANDS  ADULT HENRY  ... and a bubble bath.  HENRY POURS LIQUID SOAP INTO A RUNNING BATH  EXT. MOVIE THEATER - A NIGHT IN THE PAST 44   44  Henry walks his mother into the theater.  ADULT HENRY (V.O.)  I even took her on a date.  INT. HENRY’S BEDROOM - NIGHT 45   45  Henry lies awake, keenly aware of the wall behind him.  ADULT HENRY   (V.O.)  At the time I was too young to  understand the part of being  Husband for a Day I was not  equipped to carry out, but I sensed  my own terrible inadequacy...  INT. UPSTAIRS CORRIDOR - NIGHT 46   46  Henry peeks into Adele’s room to see his mother sleeping,  with a pillow between her legs.  ADULT HENRY (V.O.)  I could feel her loneliness and  longing before I had a name for it.  INT. GERALD’S KITCHEN - SOME TIME LATER 47   47  Henry is having a late night bowl of cereal with his dad.  HENRY  Mom’s fine. She just gets sad  sometimes.  Gerald weighs the information.  GERALD  You could come live with Marjorie  and me. And Chloe and Richard.  (a beat)  17.  (MORE) I mean, if that was something you  wanted, we could have her  evaluated.  HENRY  Mom’s great. She’s learning to play  the cello.  GERALD  I just ask because I get the idea  her depression is getting worse.  A moment. Henry could reveal more, but he can tell his father  doesn’t actually want him to move in. He’s just trying to  do/say the right thing.  HENRY  Mom takes care of me great. We do  fun things all the time. Friends  come over. We have hobbies.  (adding)  We’re learning Spanish.  Gerald smiles and nods. Glad that’s taken care of.  INT. KITCHEN, ADELE’S HOUSE - A NIGHT IN THE PAST 48   48  Adele opens the fridge, removes a JUG OF MILK, and begins to  slowly pour the contents on the floor as if she were watering  a pot of flowers.  ADULT HENRY (V.O.)  He was right, but I knew better  than to say. He just wanted to hear  that I was okay.  CUT TO:  ADELE’S TELEVISION - LATE AFTERNOON 49  ",
      "dialogue_count": 0,
      "word_count": 2016
    },
    {
      "scene_number": 8,
      "slugline": "INT. UPSTAIRS CORRIDOR - NIGHT 63   63  Henry crawls up to his mother’s bedroom doorway to find her  asleep - her wrist tied to the bedpost.   He then crawls his  way to the stairs until he has an angle on the living room.  He can see Frank’s boots resting on the arm of the sofa.  Henry inches forward until he can sees Frank’s legs...  Frank’s torso... Frank’s neck... and then Frank’s face,  hidden in the shadows. It takes a moment for our vision to  adjust. We adjust the exposure until we can JUST see Frank’s  open eyes... staring back at us.  Henry’s breath quickens. Frank nods. Henry attempts to calm  himself before tip toeing back to bed.  INT. HENRY’S BEDROOM - NEXT MORNING 64   64  Henry gets out of bed.   Was last night a dream?   He walks over  to his HAMSTER CAGE and feeds his pet, JOE. Then steps out.  INT. TOP OF STAIRS - SAME 65   65  Henry looks into his mother’s room. Adele is sleeping. One  wrist in evidence, still restrained to the bed post.  At the bottom of the stairs, he looks into the living room.  Evidence of Frank having slept the night on the couch.  INT. KITCHEN, ADELE’S HOUSE - SAME 66   66  Henry looks around, but Frank is nowhere to be seen. The back  door is open. The sound of the cicadas whispers in. Henry  wonders for a moment...   Is that it? Is he gone?   We can tell  he kind of misses him when...  Frank emerges from the basement.  FRANK  Couldn’t find any eggs.  Henry whips around as Frank steps over to the oven and opens  it. He’s made a makeshift splint out of a wooden spoon and a  dish rag. Frank strains as he removes a tray of biscuits from  the oven, his appendix scar staining his shirt.  HENRY  We don’t stock up much on  groceries. Mostly canned goods.  Henry walks passed the chair that Adele occupied the night  before, rope still tied to the legs.  25.",
      "characters": [],
      "action_text": "FRANK  You’ve got enough room in back for  chickens. Three or four nice little  Rhode Island Reds.  EXT. FRANK’S GRANDMOTHER’S FARM - 1970’S MORNING 67   67  Frank’s and Mandy’s legs walking through pecking chickens as   *  they drop feed.   *  FRANK (V.O.)   *  Keep you in fresh eggs. Poultry.   *  INT. KITCHEN, ADELE’S HOUSE - DAY 68   68  Henry goes to cut open the biscuit with a knife... Frank  quickly grabs the knife from his hand. For a moment, it seems  like a defensive move, but instead...  FRANK  (appalled)  Never slice a biscuit.  (tearing one open with his  hands)  You want to pull them apart, so you  get all the surfaces.  FLASH: FRANK’S GRANDMOTHER TEARING OPEN A BISCUIT  FRANK & FRANK’S GRANDMOTHER  ... Peaks and valleys...  INT. KITCHEN, ADELE’S HOUSE - DAY 69   69  FRANK  ... More places for the butter to  soak in.  There is something undeniably fatherly about this moment that  is foreign to Henry.  HENRY  We don’t usually keep butter  around. We use margarine.  FRANK  Now that’s a crime.  26.",
      "dialogue_count": 0,
      "word_count": 507
    },
    {
      "scene_number": 9,
      "slugline": "INT. DINING ROOM - DAY 69A   69A   *  Frank notices Henry trying to eye the front of the NEWSPAPER.  It features the prison photo of Frank from TV.  26A.",
      "characters": [],
      "action_text": "FRANK  I don’t blame you for wondering. Just  know, there’s more to this story than  you’ll see in that paper there.  Henry stops looking.  FRANK (CONT’D)  You got brothers or sisters?  HENRY  No, um, my mom tried but...  Frank takes this in without reacting.  HENRY (CONT'D)  I’ve got a stepbrother and a half-  sister. My dad takes me out to  dinner with them on Sundays.   *  FRANK  How does a fellow let a woman like  your mother get away?  HENRY  He got together with his secretary.  FRANK  Huh. Good riddance.  Henry works up the confidence to ask a question.  HENRY  How did you escape?  FRANK  I told the guard at the hospital if  he left, I was going to jump out  the window. He heard that and went  to have a smoke. Nothing misleads  people like the truth.  ADELE (O.C.)  Good morning.  Frank and Henry turn to see Adele enter the room.  ADELE (CONT’D)  What are those?  HENRY  Biscuits. They’re amazing.  Henry’s joy for his breakfast makes Adele cautious.  27. Adele offers her wrists to Frank for binding.   *  FRANK   *  I don’t think we’ll be needing that   *  any longer. But if the day comes   *  when you have to say I tied you up,   *  you won’t be lying.   *  (another thought)   *  Haven’t heard any trains go by.  ADELE  Holiday weekend. Might be a funny   *  schedule.  FRANK  (offering a biscuit)   *  Breakfast?  She wants to resist the invitation.   *  HENRY  You have to try them.  Adele submits to the biscuit. Tries to suppress a smile.   *  INT. LIVING ROOM, ADELE’S HOUSE - DAY 70   70  Henry puts on one of his mom’s folk records. There’s a warp  in the record from sun damage. We can even see the beam of  sunlight that must cut across the record player at times.  Music continues through the following short scenes.  INT. KITCHEN, ADELE’S HOUSE - DAY 71   71   *  Frank brushes his teeth using a dish towel.   *  INT. GARAGE - DAY 72   72  Frank rolls the car into the garage. Later, we find Frank   *  under Adele’s car checking the breaks. Henry sits by,   *  watc",
      "dialogue_count": 0,
      "word_count": 3360
    },
    {
      "scene_number": 10,
      "slugline": "INT. LIVING ROOM, ADELE’S HOUSE - NEXT MORNING 98   98  Henry enters and walks by the sofa where Frank’s pillow and  blanket remain folded. It is clear he slept with Adele the  night before.  He walks to the record player and puts on one of his mother’s  folk albums. Leonard Cohen? Karen Dalton? This music  accompanies us as we see Frank working on the house.  INT. STAIRWELL, ADELE’S HOUSE - MORNING 99   99  Frank hammers down a loose floorboard.  ADULT HENRY (V.O.)  The next day, Frank fixed the loose  floorboard on the stairs.  INT. KITCHEN, ADELE’S HOUSE - MORNING 100   100  Frank sprays the hinges on the kitchen door. Adele hands  Frank a mug of coffee.  ADULT HENRY (V.O.)  He got the squeak out of the  kitchen door.  EXT. ADELE’S BACKYARD - DAY 101   101  Frank finds a patch of tall grass. Adele and Henry help him  flatten it with their feet in a four foot square.  FRANK  Cold weather’s coming, but with  enough straw, chickens winter over  just fine. All they need’s a warm  body to huddle up to in the night.  INT. GARAGE - DAY 102   102   *  The car is up on a jack. Henry rolls the spare tire over.  Frank is loosens the lug nuts.  FRANK  I’ll tell you now, you don’t want  to wait to learn how to fix it. Not  if you’ve got some lady in the seat  beside you when it happens.  43.",
      "characters": [],
      "action_text": "Together they pull the rear tire off and set it down.  CUT TO:  FRANK FOLDING LAUNDRY WITH ADELE 103   103  ADULT HENRY (V.O.)  He did laundry. He ironed. And in  return my mom taught him to Rumba.  ADELE WALKING FRANK THROUGH A FEW MOVES.  ADELE  One, two, three... bring your foot  back, four, five, six... that’s it.  Frank is getting it.  INT. LIVING ROOM, ADELE’S HOUSE - DAY 104   104  Over Frank’s shoulder, we look out the window to see Henry  bike away.  ADULT HENRY (V.O.)  For lunch, Frank thought it only  right that we fire up the barbecue.  So he sent me to pick up groceries.  EXT. ADELE’S HOUSE - DAY 105   105   *  In a shot we will repeat later, Henry comes biking down the  front lawn and continuing down the street.  EXT. SUBURBS - DAY 106   106  Henry bikes past people celebrating the long weekend. Kids  play in sprinklers. Men scrape off BBQs.  INT. CORNER GROCERY - DAY 107   107  Henry is filling a shopping cart. He’s got a grocery list.  Again, we see shoppers dressed for the holiday, preparing for  holiday cook outs.   *  Henry grabs a package of ground beef from the butcher. Then   *  passes a familiar BUDWEISER AD of women staring back.   *  44. BEVERAGE AISLE 108   108  Henry walks past a fourteen year old girl with braided hair  and a bulky sweater over toothpick legs - ELEANOR.  Henry grabs a SIX PACK of Coke.  ELEANOR  You know drinking from aluminum  gives you Alzheimer's.  Henry tries to hide the thrill of being spoken to by a  strange girl. There’s something dark and unusual about her.  HENRY  Is that true?  ELEANOR  Uh huh. It’s the perfect crime  cause you never remember how you  got it.  Henry doesn’t know how to respond.  ELEANOR (CONT’D)  Is there anything to do in this town?  HENRY  There’s bowling?  She isn’t impressed. Before Henry can think of something...  ADULT MAN (O.C.)  Eleanor!... Get over here...  Eleanor waves goodbye then wisps around the corner giving  Henry a chance to gain his breath.  CUT TO:  CHECK STAND 109   109  Henr",
      "dialogue_count": 0,
      "word_count": 1108
    },
    {
      "scene_number": 11,
      "slugline": "INT. KITCHEN, ADELE’S HOUSE - DAY 112B   112B   *  Henry gets closer to the window.   *  FRANK   *  (quietly)   *  Eighteen years in stir. When I saw   *  that open window, I knew there was   *  a reason to jump.   *  EXT. ADELE’S HOUSE - DAY 112C   112C   *  The wheelchair is pulled up Adele’s front steps, one at a   *  time, landing with a thud on each wooden plank.   *  INT. KITCHEN, ADELE’S HOUSE - DAY 112D   112D   *  Henry is now standing right next to the window, inches away   *  from Frank and Adele.   *  WOMAN’S VOICE (O.C.)  Adele?! Where are you?!  Henry shoots a look to the front door, to see EVELYN, walking   *  from the entryway into the living room. There isn’t enough   *  time to warn Frank. He runs through the dining room and into   *  the...  47A.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 144
    },
    {
      "scene_number": 12,
      "slugline": "INT. LIVING ROOM - DAY 113   113   *  Henry catches Evelyn, his mother’s only friend and a   *  demanding harsh one at that.  EVELYN  Oh, hi Henry. Where’s your mother?  HENRY  I don’t know...  EVELYN  I need her to watch Barry.  We pivot around Evelyn, to find her son BARRY outside the front  door sitting in a wheelchair. We quickly can tell by the way  he’s moving his arms that he is developmentally disabled.  EVELYN (CONT’D)  ADELE?  Evelyn goes for the kitchen.  EVELYN (CONT’D)  (to Henry)  Keep an eye on Barry, would you?  HENRY  I think my mom’s upstairs.  Evelyn stops and switches to the stairs. Henry waits a second  for Evelyn to clear the landing, then runs into...  INT. KITCHEN, ADELE’S HOUSE 114   114  Henry runs right into FRANK HOLDING A KNIFE to Adele. Or is  he holding Adele and the knife is just there. The moment is  confusing. He stops Henry and   Shhhh’s....   him. He pushes  Adele out the kitchen.  ADELE  (a little shaken)  Evelyn, is that you?  Henry goes to follow, but Frank grabs him and pulls him back.  HENRY  (explaining)  I said I’d watch Barry.  Frank peaks out the kitchen. He sees a piece of the  wheelchair outside the front door. He thinks. Then nods and  sends Henry out.  48.",
      "characters": [],
      "action_text": "As Henry walks up to Barry, we begin hearing Evelyn asking  Adele for a favor as they descend the stairs.  ADELE  It’s just not the best timing.  EVELYN  They’re not expecting my dad to  hold on long.  ADELE  Normally, I wouldn’t think twice...  EVELYN  I don’t have any other options, Adele.  ADELE  Look, I want to help you, but...  EVELYN  I promise he’ll be good. Come on,  you’re not going anywhere...  They’re back standing next to Henry. Evelyn begins smoothing  down her son’s hair.  EVELYN (CONT’D)  (to Barry)  Do you remember   Heeeeenry   and his  mooooom   and all the good times you’ve  had here?  HENRY  Hey Barry, how’s it going?  Barry gurgles back. Syllables lost in saliva.  EVELYN  Please. One mother to another. I  wouldn’t ask if I wasn’t desperate.  A long beat before Adele drops her shoulders.  ADELE  Okay.  EVELYN  Thank you, thank you, thank you. I  owe you.  (already leaving)  I’ll be back by the end of the  night. It’s about two hours drive.  Just put his chair in front of the  TV. He loves cartoons.  49. And just like that, she’s gone.  Henry pulls Barry’s chair into the entryway and Adele shuts  the door.  Frank walks into the room. We’re not quite sure what he  thinks of all this for a second. And then...  FRANK  Hey Barry, you look mighty toasty  in all those clothes.  Barry is SWEATING in a parka.  ADELE  (taking off the parka)  I swear, she dresses him for winter  in August.  FRANK  (smiles to Barry)  You got here just in time. We  needed a third baseman.  EXT. ADELE’S BACKYARD - DAY 115   115  We see makeshift bases being laid out.  Frank lowers Barry into a LAWN CHAIR, then unbrims his RED  SOX HAT from Pricemart and slides it onto Barry’s head, who  gurgles back with joy.  FRANK  I’m Frank by the way.  Barry GURGLES back a sound that vaguely resembles   FWAANN.  FRANK (CONT’D)  That’s right, Frank. Pleasure to  meet you.  Frank walks over to Henry who is gloving his new baseball.  FRANK (CONT’D)  Alright, let’s see that arm.  HENRY  Don’t ",
      "dialogue_count": 0,
      "word_count": 1009
    },
    {
      "scene_number": 13,
      "slugline": "INT. FRANK’S BATHROOM - THE NEXT DAY 123   123   *  Mandy is setting up her cosmetics.  ADULT HENRY (V.O.)  Her clothes. Her underwear.  Deodorant, hot rollers, nail kit  seemed to all arrive at once.  EXT. FRANK’S GRANDPARENT’S FARM - DAY 124   124  Frank is checking the knee high corn. Mandy comes running up.   *  ADULT HENRY (V.O.)   *  A couple weeks later, she came home   *  from the doctor with news.   *  MANDY  You must-a-bin storing it all up so  long, those sperms of yours were  three times as powerful as regular.  FRANK  Guess our good fortune just came early.  INT. JUDGE’S CHAMBERS - DAY 125   125   *  Frank and Mandy are married in a civil ceremony.  ADULT HENRY (V.O.)  They married in Fall.   *  INT. CORRIDOR, COURT HOUSE - DAY 125A   125A   *  Mandy excitedly shares the news into a pay phone while Frank   *  stands nearby looking on.   *  ADULT HENRY (V.O.)   *  A few months later, the baby   *  arrived. Early.   *  INT. DELIVERY ROOM, HOSPITAL - DAY 126   126  Frank is escorted in by a nurse. He looks at Mandy holding  their baby. The infant has noticeably red hair.  ADULT HENRY (V.O.)  Frank was twenty one years old.  53.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 204
    },
    {
      "scene_number": 14,
      "slugline": "INT. LIVING ROOM, ADELE’S HOUSE - NIGHT 127   127  CLOSE ENCOUNTERS is on TV. The group watches, exhausted from  the day. Henry practices his new grip of the baseball.  Frank enters with a cold washcloth and pats Barry’s forehead.  Then the back of his neck. It’s an incredibly tender act that  has as much effect on Adele and Henry as it does on Barry.  53A.",
      "characters": [],
      "action_text": "The movie fades out and a teaser for the LATE NEWS comes up.  ANCHOR WOMAN 2  Tonight at 11pm, more on escaped  convict Frank Chambers. Our  psychologist weighs in on what to  expect from a murderer on the run  and where he might be hiding...  That and more at eleven.  A commercial comes up. The room gets quiet.  FRANK  I may not be innocent but I am not  a murderer.  ADELE  (wants to believe)  The man I’ve met doesn’t seem  capable.  Adele looks deep into Frank’s eyes. Their bond is so strong  that Henry doesn’t dare move or make a sound. They could stay  like this all night, but HEADLIGHTS cut across the window.  They look outside to see Evelyn’s station wagon pull up  outside. Without a word, Frank begins up the stairs.  ADELE (CONT’D)  Alright, Barry, looks like your  mother is here.  Adele opens the front door as Evelyn makes her way in.  ADELE (CONT’D)  How’s your father?  EVELYN  It’s complicated and not all good,  but he’s under supervision.  (Uses her Barry voice)  Did you have a good time today?  Barry coos.  The TV turns to a NEWS UPDATE. It’s a report on Frank.  ANCHOR WOMAN 2  No further luck in finding escaped  prisoner Frank Chambers today...  The news piece continues. Adele and Henry try not to change  their demeanor. Barry is profile to the TV and hasn’t noticed  Frank’s photo.  54. ADELE  (pushing them to leave)  Well, we’ve had a busy day...  EVELYN  I’ve been on the road for two  hours. Can I trouble you for water?  News footage of a ROAD BLOCK, as police check car after car.  Then, the TV goes full screen on Frank’s photo. Barry’s head  swivels, trying to get comfortable.  ADELE  (trying to stay calm)  Henry, go grab Evelyn some water.  Henry heads to the kitchen.  EVELYN  Was he difficult?  ADELE  Not at all. We had the best time  with Barry. We went outside...  Threw the ball around...  Barry’s head stops. His eyes lock on the TV.  EVELYN  Did you put on sunscreen?  ADELE  Of course... Of course.  BARRY  Fwa...?  Evelyn continues to go on abou",
      "dialogue_count": 0,
      "word_count": 621
    },
    {
      "scene_number": 15,
      "slugline": "INT. BATHROOM, ADELE’S HOUSE - NIGHT 129   129  Henry finishes brushing his teeth. He rinses off the brush  and goes to leave, when he hears murmuring from his mother’s  bedroom. As Henry gets closer to the door, we begin to hear  the conversation.  ADELE (O.C.)  You were so young... Why didn’t you  appeal?  FRANK (O.C.)  Don’t know... Thought I got what I  deserved.  ADELE (O.C.)  You don’t still feel that now...?  FRANK (O.C.)  Now it doesn’t matter.  ADELE (O.C.)  Were you scared?  FRANK (O.C.)  In prison? Sure.  ADELE (O.C.)  No, when you jumped.  FRANK (O.C.)  Oh.   (gives it a thought)  Didn’t even think about it.  Henry slowly opens the door until he can peek into the room.  Frank is lying shirtless on the bed. Adele lies across him,  with her head on his chest. She’s slowly tracing the scar on  his abdomen with COTTON AND ANTISEPTIC.  ADELE  I can’t imagine not being free.  FRANK  Can’t call myself free till I can  walk down the street. Arm around you.  ADELE  I’d like that.  FRANK  Take you on road trips to places we  don’t know a soul.  57.",
      "characters": [],
      "action_text": "ADELE  Like on the run?  FRANK  Yeah, Bonnie. On the run.  This catches Henry’s attention.  After a beat, something occurs to Adele.  ADELE  I bet they wouldn’t care who you  were in Nova Scotia.  FRANK  In Canada?  ADELE  Or Prince Edward Island. Nobody  bothers you up there.  FRANK  You been?  ADELE  Once, when I was little. It’s  beautiful. Villages and beaches and  salt water marshes. Someone could  just   fall in   there.  FRANK  Cold?  ADELE  You’re a tough guy. I think you  could take it.  FRANK  Too cold to grow things?  ADELE  It’s mostly farms.  FRANK  Sounds nice.  Henry begins to imagine it himself.  A beat as they all soak in Prince Edward Island.  58. FRANK (CONT’D)  I noticed a spot under the shower  where the water’s finding its way  under the linoleum. Don’t want dry  rot. Going to tackle that tomorrow.  ADELE  Maybe it doesn’t matter.  INT. HENRY’S BEDROOM - NIGHT 130   130  Henry in bed. Lost in thought. We hear sounds coming from the  next room. Muffled sounds that could be sex, and yet could  easily be something else. And then... We’re in a dream...  INT. CLASSROOM - DAY   *  The same one in which we found Henry checking out Rachel.   *  Only now it’s empty and the girl seated before him is Eleanor   *  from the grocery store. She stands up and turns around.   *  Stares into his naive eyes.   *  ELEANOR   *  What do you want to do?   *  HENRY   *  I don’t know.   *  She unbuttons her blouse, revealing... nothing. Like a ghost,   *  we can see the classroom behind Eleanor between the opening   *  in her blouse. Henry pauses. He simply doesn’t have the life   *  experience to fill in the information.   *  ELEANOR   *  I think you know... Come on... Just   *  say it...   *  We see flashes of women from the covers of magazines and   *  billboards. Women staring with desire in their eyes.   *  Back to Eleanor.   *  ELEANOR (CONT’D)   *  What’s the matter?   *  She laughs.   *  Just as Henry is completely overwhelmed, we...   *  CUT TO:   *  59.",
      "dialogue_count": 0,
      "word_count": 535
    },
    {
      "scene_number": 16,
      "slugline": "INT. STAIRS - MORNING 132   132   *  Henry is walking downstairs, when he again hears Frank and  Adele chatting. This time in the kitchen.  ADELE (O.C.)  I have a little money. After my mom  died, I sold the house. It’s just  sitting in my savings account.  FRANK (O.C.)  Wouldn’t need much to start over.  ADELE (O.C.)  Just someplace safe.  INT. KITCHEN, ADELE’S HOUSE - DAY 133   133  Henry walks in to find Adele sitting on the counter. Frank is  nearby washing dishes.  FRANK  Morning sport.  ADELE  How’d you sleep?  HENRY  Fine. How about you?  Adele and Frank share a laugh. Henry doesn’t quite get it. He  doesn’t like being outside the joke. Particularly when it  comes to his mom.  ADELE  Well, I was wondering if you could  do me a little favor.  FRANK  A little top secret research, if  you follow?  HENRY  (Skeptical. Feeling  replaced)  Research on what?  60.",
      "characters": [],
      "action_text": "ADELE  Just a little trip to the library to  find a book on Prince Edward Island.  It’s a place in Canada your  grandparents used to take me.  HENRY  What for?  ADELE  Well, Frank can’t stay here  forever.  HENRY  You’re going to Canada?  FRANK  (to Henry)  Your mom says it’s beautiful.  ADELE  I’ve always meant to take you there.  Can you pick up the book, Hank?  Henry looks at his mom. Now she’s using the nickname?  FRANK  You’d be doing your mother and me a  big favor.  EXT. SUBURBAN STREET - DAY 134   134  Henry rides his bike. He passes multiple front yard cook  outs. We’re reminded of the long weekend by the amount of get-  togethers and picnics and slip-n-slides.  EXT. LIBRARY - DAY 135   135  Henry pulls up to a weekend library sale. Older literary  types and kids go through bins of used books and tables of  homemade pastries. Henry cycles past and parks in an empty  bike stand.  INT. LIBRARY - DAY 136   136  Henry uses the card catalogue.  Henry follows the Dewey Decimals til he reaches a thin volume  on Prince Edward Island. He also grabs a couple general  Canada books.  61. Henry sits down at a research desk. There’s only one other  person in the room. Eleanor. She sits on a leather chair,  chewing on a braid, reading a book.  HENRY  (a soft try)  So, you found one of our city’s hot spots.  Eleanor looks up and just stares at Henry like he’s crazy.  HENRY (CONT’D)  (immediately embarrassed)  Um... we talked at the grocery...  I’m sorry, I didn’t mean to...  ELEANOR  No, that was good. Confidence is a  very attractive quality in a man.  This throws Henry off further. He attempts small talk.  HENRY  Oh, okay... So, do you go to school  around here?  ELEANOR  I just moved here from Chicago. I’m  supposed to try out living with my  dad this year.  HENRY  Oh, what happened?  A beat as Eleanor considers whether or not to get into it.  ELEANOR  The official reason is I have an  eating disorder and they’re hoping  a new school environment will help,  but really I",
      "dialogue_count": 0,
      "word_count": 2683
    },
    {
      "scene_number": 17,
      "slugline": "INT. BATHROOM, ADELE’S HOUSE - NIGHT 150   150  Frank gives Henry a HAIRCUT.  INT. HENRY’S BEDROOM - NIGHT 151   151  Henry has created a little maze for Joe the hamster using  books and toys. He opens Joe’s cage and watches him scamper  around, understanding his new environment.  Slowly, he begins to place more books within the maze,  sometimes sliding them around Joe, to make the maze  tighter... and tighter... until Joe is confined to a space  the size of his own little body.  INT. HENRY’S BEDROOM - NIGHT 152   152  Henry tries to ignore the sounds from beyond the wall.  EXT.   BLACK LIMBO 153   153  Eleanor removes her sweater and embraces Henry.  INT. HENRY’S BEDROOM - NIGHT 154   154  We begin to hear Frank through the wall...  FRANK (O.C.)  Adele... Adele...  Henry buries himself into the pillow. As we turn with him  into darkness we find...  INT. BLACK LIMBO 155   155  Eleanor whispering something into Henry’s ear. We catch the  look of fear in his eyes that accompanies arousal.  Flashes of more MAGAZINE COVER MODELS. One winks at Henry.   *  FLASH IMAGE: HANDS OPENING UP DARK SOIL AND PLANTING A SEED 156   156  ADULT HENRY (V.O.)  Frank had hoped once the baby came,  things might change, but Mandy had  lost interest in love making.  75.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 216
    },
    {
      "scene_number": 18,
      "slugline": "EXT. FRANK’S GRANDMOTHER’S FARM - DAY 157   157  Reveal that it’s Frank planting outside. He looks back at the  farm house. Mandy is sitting in the window on the phone.  INT. LIVING ROOM, FARM HOUSE - AFTERNOON 158   158  Mandy on the phone with her sister as Frank feeds the baby. A   *  crib in the foreground.   *  MANDY  I keep telling him, we’ve got to  sell off the farm. Yeah, no   *  offense, but what woman wants to   *  come home to husker’s hands?   *  (laughs)  Yeah, I know...  INT. LIVING ROOM, FARM HOUSE - NIGHT 159   159  Frank feeds the baby. Mandy blows a kiss and slips out,   *  carrying a bowling bag.   *  ADULT HENRY (V.O.)  Nights, she’d meet up with friends  and bowl... Or hit the bingo hall.   *  Maybe dance with her sister at the  Wagon Wheel.  EXT. FARM HOUSE - NIGHT 160   160  Mandy’s car peeling out in the dirt driveway.  INT. SEARS PORTRAIT STUDIO - DAY 160A   160A   *  Frank, Mandy, and Frank Jr pose for a studio portrait.   *  EXT. CHURCH RUMMAGE SALE - DAY 161   161   *  Frank pushes the stroller as Mandy shops the tables.   *  ADULT HENRY (V.O.)  It wasn’t the life Frank had hoped  for, but he never questioned it.  They pass another couple. The husband is a young man with red  hair. There’s the most subtle uncomfortable beat.  76.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 233
    },
    {
      "scene_number": 19,
      "slugline": "INT. BATHROOM, FARM HOUSE - NIGHT 162   162   *  Frank drying his baby son’s red hair.   *  INT. KITCHEN, FARM HOUSE - NIGHT 163   163  We slowly push in on a dining table as Frank, Mandy, and  their baby eat in silence.  ADULT HENRY (V.O.)  At least not out loud. What would  be the purpose of that?  INT. HENRY’S BEDROOM - MORNING 164   164  Henry is packing up his toys. He is dividing up the action  figures. After a careful selection, he dumps the survivors on  his bed along with various games and books.  Frank pokes his head into the room.  FRANK  Half.  HENRY  But...?  FRANK  (firm)  Half.  INT. LIVING ROOM, ADELE’S HOUSE - MORNING 165   165  Adele packs a box with photo albums. She says goodbye to a  figurine of a dancer.  INT. DARK BEDROOM, ADELE’S HOUSE - MORNING 166   166  Frank opens the door to a dark bedroom. Inside, he sees the  trim of a nursery. Boxes. A rocking chair under plastic.  EXT. MRS. FARNSWORTH’S BACKYARD - DAY 167   167  Mrs. Farnsworth looks across to see Adele taking in the  clothes that were hanging on the line. Amongst them is a pair  of MEN’S SLACKS. This leaves Farnsworth perplexed.  77.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 203
    },
    {
      "scene_number": 20,
      "slugline": "INT. HENRY’S BEDROOM - MORNING 168   168  Henry goes through loose items on his desk. He picks up his  LIBRARY CARD. On the back is Eleanor’s phone number.  INT. ENTRYWAY, ADELE’S HOUSE - MORNING 169   169  Frank sets a box at the front door. Inside is a photo album.  He picks it up and begins leafing through. He sees FAMILY  PHOTOS of Adele with her ex-husband.  Then a photo stops Frank in his tracks. Adele is standing  with Henry by her side at an ice cream stand. Henry must be  five years old... and Adele looks six months pregnant. Frank  is thinking this over when...  Henry comes WHIZZING BY OUT THE DOOR.  HENRY  I’ll be back in a little bit.  FRANK  Hey, Hank, we still have work to do.  HENRY  I know. I’m almost done.  EXT. BRIDGE, HOLTON MILLS - DAY 170   170   *  Henry bikes past a road block.   *  INT. DINER - DAY 171   171  Henry sees Eleanor in a booth stacking CAPSULES OF CREAM. She  hasn’t noticed him yet.  Henry sits down in the booth. Eleanor starts going through  the mini jukebox pages. She notices Henry’s hair.  ELEANOR  Nice haircut.  HENRY  (self-conscious)  Thanks.  ELEANOR  (back to the jukebox)  What kind of music do you listen to?  78.",
      "characters": [],
      "action_text": "FLASH IMAGE: ADELE SINGING ALONG TO A JONI MITCHELL ALBUM  INT. DINER - DAY 172   172  Henry searches for an answer.  HENRY  You know, the usual.  ELEANOR  I never like the usual. Have you  heard of Sid Vicious?  (upon no answer)  He was a punk rocker who stabbed  his girlfriend and then overdosed  himself because he couldn’t stand  being without her.  HENRY  I’ll check him out.  ELEANOR  I also love Jim Morrison. Someday,  I’m going to go to Paris and see  his grave.  HENRY  He’s French?  ELEANOR  No, but the French adored him so  much, that they wouldn’t release his  body. It’s for the better. They have  better cemeteries there. Say what you  want about the French people - They  know how to celebrate their dead.  The WAITRESS arrives with a coffee for Eleanor. She gives it  to her with skepticism.  WAITRESS  (to Henry)  Anything for you?  HENRY  A Coke?  The waitress is off. Eleanor is already pouring six  consecutive packets of Sweet N’ Low into the coffee.  For the first time, Henry notices the chipped away black nail  polish on her bitten down nails.  79. ELEANOR  I told my dad I was meeting a boy  and he gave me this whole lecture  like we were going to do it in a  coffee shop or something.  HENRY  I hate when my mom tries to talk to me  about sex. Every time she says   stuff ,  it’s like she’s trying to pronounce  some difficult medical term.  ELEANOR  (relates)  That’s so annoying. My dad can’t say  vagina. He literally can’t say it.  (imitating her father)  I trust your mother is covering all  questions relating to your   parts .  HENRY  (imitating his mother)  Henry, never feel shame about  your...   penis . It’s just a body  part. Like an arm.  The waitress shoots them a look from across the diner.  ELEANOR  Like an   arm ?  HENRY  One time, I fell while trying to  hop a fence and she came running  over and was like,   Did you hurt  your penis?  Eleanor cracks up.  ELEANOR  Oh Henry, did you bruise your  penis? We should probably put ice  on it.  The wait",
      "dialogue_count": 0,
      "word_count": 895
    },
    {
      "scene_number": 21,
      "slugline": "EXT. ADELE’S HOUSE - DAY 175   175  Adele gets in her car and turns the ignition. She’s breathing  purposefully. She goes to put the car in gear but her hand  starts shaking.  INT. LIVING ROOM, ADELE’S HOUSE - DAY 176   176  Frank watches from a window. His face turns to concern.  INT. ADELE’S STATION WAGON - DAY 177   177   *  Adele is hyperventilating. She doesn’t look ready to back  down a driveway, let alone leave the country.  Her breathing grows stronger until out of nowhere, Frank hops  in the passenger seat, reaches across, and turns off the car.  Adele looks out the windshield. Then back down at her hands.  FRANK  What’s wrong?  ADELE  Nothing...  FRANK  Because, if you’re not up for this,  I need to know...  ADELE  It’s not that...  FRANK  Then what is it?  A beat and then Adele looks over. She owes an explanation.  EXT. DESERTED GATE, OLD MILL - DAY 177A   177A   *  Eleanor leads Henry through an abandoned guard gate.   *  EXT. OLD MILL - DAY 177B   177B   *  Eleanor leads Henry through the rusted remains of a building.   *  He pauses to observe his surroundings.   *  ELEANOR   *  Come on.   *  83.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 198
    },
    {
      "scene_number": 22,
      "slugline": "EXT. SHALLOW WATER BASIN ADJACENT TO THE MILL - DAY 178   178  Henry and Eleanor walk barefoot through the silt, carrying  their shoes. The giant boarded up mill in the background.  ELEANOR  How did you get out?  HENRY  It’s not like that. He trusts me.  83A.",
      "characters": [],
      "action_text": "ELEANOR  Or maybe he was just waiting for  you to leave the house. So they  could run off together.  HENRY  I don’t think my mom would leave  without saying goodbye.  ELEANOR  It’s just like Bonnie and Clyde.  HENRY  Who?  ELEANOR  They made a movie about them. Bonnie  was this woman who was bored because  she hadn’t had sex in a long time.  This guy Clyde just showed up one day  and took her away. They drove all  around, holding up banks and living  out of their car. Odd thing was,  Clyde couldn’t even have sex, but he  had so much charisma, it didn’t even  matter.  HENRY  What happened to them?  ELEANOR  In the end they got killed.  Henry’s face falls as Eleanor goes on to describe the  gruesome scene from   Bonnie and Clyde.   *  ELEANOR (CONT’D)   *  The federal agents tracked them and   *  gunned them down in an ambush. The   *  part where Bonnie gets killed,   *  there’s so much blood my mother   *  couldn’t even watch.   *  INT. ADELE’S STATION WAGON - DAY 179   179   *  We’re in the back seat. Henry holds his ears as the front   *  seat is shot up. He crouches down, looking up, to see bits of   *  seat fly everywhere.   *  84. ELEANOR (V.O.)   *  They had these machine guns and her  body just keeps jumping all around  the seat of the car as the bullets  keep hitting her all over the  place.  Perhaps we see Adele’s hand hanging over the back of the seat   *  EXT. RUSTED MILL BRIDGE - DAY 180   180  Eleanor and Henry walk along the abandoned bridge. He’s lost  in the evocative imagery.  ELEANOR  Can you imagine if your mom got  killed in an ambush? And you were  right there watching it. They  probably wouldn’t shoot at you  since you’re a kid, but you’d see  the whole thing. It would be pretty  traumatic.  It replays through Henry’s mind. Eleanor stands up.  ELEANOR (CONT'D)  I have this really weird feeling.  There’s this thing I keep wanting to  do only you’d think I was strange.  HENRY  (a lie)  I don’t think you’re strange.  Eleanor licks her lips. Then sh",
      "dialogue_count": 0,
      "word_count": 668
    },
    {
      "scene_number": 23,
      "slugline": "INT. NURSERY - DAY 186   186  Gerald assembles the crib.  86A.",
      "characters": [],
      "action_text": "ADELE (V.O.)  ... Begin setting up the nursery...  INT. BEDROOM - MORNING 187   187  Adele wakes up in pain.  ADELE (V.O.)  ... Only to wake up feeling  betrayed by my own body.  INT. KITCHEN - MORNING 188   188  Adele and Gerald get ready for the day. We can feel the  impact of the miscarriages on their interaction.  ADELE (V.O.)  By my fourth time, we knew better  than to celebrate.   *  INT. CHINESE RESTAURANT - NIGHT 188A   188A   *  Adele and Gerald eat dinner. You’d never know they just found   *  out they found out they were pregnant.   *  INT. GROCERY STORE - DAY 189   189  Adele is shopping. She runs into a friend and they begin a  conversation about mundane things.  ADELE (V.O.)  We knew better than to tell our  friends... Or think of baby names.   *  INT. NURSERY - DAY 190   190  The room remains bare. Gerald crosses without looking.   *  INT. KITCHEN - MORNING 191   191   *  Adele is nine months pregnant. The interaction between her  and Gerald is quiet. Adele feels a contraction. They exchange  a look.  ADELE (V.O.)  We hadn’t even packed a suitcase  for the hospital when the  contractions started.  87.",
      "dialogue_count": 0,
      "word_count": 208
    },
    {
      "scene_number": 24,
      "slugline": "INT. HOSPITAL - DAY 192   192  Adele is in labor. Gerald holds her hand. There’s a joy and  relief that they’ve made it.  ADELE (V.O.)  We had made it.  Adele looks down at the doctor and the delivery nurses. There  is an anxiety in their eyes.  Adele registers this...   What’s wrong?  We see the demeanor of the medical staff turn dour like a  light dimming.  ADELE  Give me my baby...  INT. RECOVERY ROOM - NIGHT 193   193  We see Adele’s silhouette lying in bed. A nurse enters and  hands her the tiny lifeless body of a stillborn baby.  ADELE (V.O.)  Maybe they just took pity on me.  They wrapped her in a pink blanket  and put on a diaper... only one  she’d ever wear. As I stared at  this beautiful little girl. Her  long eye lashes. Her father’s nose.  My chin. The little mouth that  would never take a breath... I knew  there would be no further  conversations. No more attempts. We  were done.  INT. GROCERY STORE - DAY 194   194   *  Adele is shopping.  ADELE (V.O.)  The world became a cruel place.  Adele passes a pregnant woman. Her breath quickens. Her hands  begin to shake... She abandons her cart.  EXT. SUPERMARKET PARKING LOT - DAY 195   195  Adele rushes to her car.  88.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 215
    },
    {
      "scene_number": 25,
      "slugline": "INT. ADELE’S STATION WAGON - DAY 196   196   *  Adele gets in and begins crying.  ADELE (V.O.)  I stopped going for walks... I  couldn’t even open the window at  night... I understand why Gerald  left.  EXT. BACK PORCH - DAY 197   197  Adele and Frank have moved to the back swing. She stares into  space. Frank stares at Adele.  ADELE  I had become a prisoner.  Frank takes her hands.  FRANK  I came to save you, Adele. And  tomorrow, that’s exactly what I’m  going to do.  They kiss.  EXT. ADELE’S HOUSE - DAY 198   198  Henry is walking up the driveway when he finds Mr. Jervis at  the front door. Knocking.  HENRY  Mr. Jervis?  Jervis whips around. He’s carrying flowers. He’s a little  flushed, caught in a romantic gesture.  MR. JERVIS  Oh, hi Henry. Was just looking for  your mother.  HENRY  (quick lie)  Um... She went into town... for a  haircut.  Mr. Jervis takes a step forward. He’s circumspect.  MR. JERVIS  Really.  89.",
      "characters": [],
      "action_text": "HENRY  Yeah... She said it was getting a  little long.  MR. JERVIS  I don’t think you’re telling the  truth, Henry.  Mr. Jervis continues to step forward, backing Henry up.  MR. JERVIS (CONT’D)  It’s a holiday. Salon’s closed. You  want to tell me what’s really going  on here?  Henry freezes up.  MR. JERVIS (CONT’D)  I saw you playing catch in the back  with someone yesterday. You want to  tell me who that was?  Jervis is right up at Henry now, waiting for an answer. Henry  looks at the flowers quickly and back at Mr. Jervis.  HENRY  My mom met somebody. A man.  Mr. Jervis’s face falls.  HENRY (CONT’D)  They’re out together right now.  MR. JERVIS  (crest fallen)  Oh, I see...  Mr. Jervis emotionally reels in, embarrassed. He starts to  cross the street back to his house.  HENRY  Should I tell her you came over?  MR. JERVIS  No, it’s fine Henry. I’m happy for  her.  Mr. Jervis reaches his own driveway. Henry enters his house.  INT. ENTRYWAY, ADELE’S HOUSE - DAY 199   199  Henry steps in. Frank is waiting for him.  90. FRANK  Where’d you go?  HENRY  To see a friend.  FRANK  You didn’t say where we’re going?  HENRY  Of course not.  FRANK  You didn’t say you were leaving?  HENRY  No, I just wanted to see a friend.  FRANK  Don’t forget what’s going on here,  Hank.  Adele enters the room.  ADELE  What did Mr. Jervis want?  HENRY  (to Adele)  He brought flowers for you.  ADELE  What did you tell him?  HENRY  I told him you were out.  ADELE  He believed you?   *  HENRY  I told him you were on a date.  FRANK  Clever.  Adele hugs her son, but his back tightens in the embrace.  Music enters as we begin:  A SHORT MONTAGE AS FRANK, ADELE, AND HENRY PACK THE HOUSE UP.  91. ADULT HENRY (V.O.)  By the end of the afternoon,  everything in the house had been  neatly separated into essentials  and things we’d leave behind.  EVERYONE SWEEPS THE LIVING ROOM FLOOR.  ADULT HENRY (V.O.)  For no practical reason more than  it seemed like the right thing to  do, we cleaned each room.  INT. H",
      "dialogue_count": 0,
      "word_count": 1440
    },
    {
      "scene_number": 26,
      "slugline": "INT. HENRY’S BATHROOM - NIGHT 205   205  Henry picks up his toothbrush, however we...  CROSS CUT TO:  INT. 21 YEAR OLD FRANK’S BATHROOM - 1970’S SUNSET 206   206   *  Frank is brushing his teeth, looking over Mandy’s many  cosmetics. Something occurs to him.  ADULT HENRY (V.O.)  Finally one night, Frank thought  back to the day he came home. Of  all the feminine equipment Mandy  had at the ready to move into his  bathroom, there was one thing  missing.  Frank stops brushing. He begins looking through her things.  ADULT HENRY  As if she knew all along, they  wouldn’t be necessary.  OMITTED 207   207   *  INT. MOONLIGHT LANES - NIGHT 208   208  Frank enters the bowling alley, carrying his infant. There’s  barely anyone there. He walks up to the cashier desk.  FRANK  What time’s women’s league?  BOWLING MANAGER  Women’s league is Tuesday.  Frank nods. Not surprised.  EXT. WAGON WHEEL BAR - NIGHT 209   209  Frank’s truck pulls up. He sees Mandy’s car.  97.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 162
    },
    {
      "scene_number": 27,
      "slugline": "INT. WAGON WHEEL BAR - NIGHT 210   210  Frank enters and moves towards the back, again carrying his  baby boy. He finds Mandy sitting with a young guy in a  baseball shirt with his hand on her knee. Mandy doesn’t seem  ashamed. She gives a surprisingly annoyed look.  FRANK  Come on, let’s go.  MANDY  Don’t act all self-righteous. You  don’t know what’s going on here.  FRANK  This is for home.  INT. STAIRWELL, FARMHOUSE - NIGHT 211   211  Mandy walks down the steps, carrying a baby blanket. Frank is  waiting for her.  MANDY  I’ve met somebody. He’s taking me  away from all this.  FRANK  I’m done with you anyway.  MANDY  He’s a real man.  FRANK  (fuming)  I’m sincerely happy for you.  MANDY  Just so you know. All those times I  acted like I was having a good time  in bed, I wasn’t. Just felt sorry  for you.  Mandy walks passed him. There isn’t enough room on this page  to describe the mixture of fragility, pain, humiliation, and  anger that is brimming inside Frank as he asks...  FRANK  Is he even my son?  Mandy looks at him. She’s been drinking. She breaks into a  cruel smile. And then a laugh. A mean fucking laugh.  Frank steams.  98.",
      "characters": [],
      "action_text": "FLASH BACK - FRANK BRUSHING HIS TEETH. REALIZING. 212   212  INT. STAIRWELL, FARMHOUSE - NIGHT 213   213  Mandy is now lost in laughter. Each laugh - a stab. Each one  saying:   you stupid idiot.  MANDY  You poor sweet fool...  Frank SNAPS - LUNGES forward and SHOVES HER HARD.  Mandy flies backward, trips over a toy, and spins into the  furnace. Her head hits wrong and her neck snaps.  She falls into a pile on the floor. A single drip of blood  trickles down from her ear.  Frank stops.   What just happened...  FRANK  Mandy?  Frank walks over to her.  FRANK (CONT’D)  Mandy...?  He’s just beginning to understand the consequences of his  shove when a drip of water lands on Mandy’s face. Another  drip. It’s coming pretty steady.  Frank looks up. There’s a pool of water in the ceiling.  Frank starts stepping towards the stairs, when he breaks into  a full sprint.  INT. UPSTAIRS HALLWAY, FARMHOUSE - NIGHT 214   214  Frank turns the corner and runs for the bathroom door.  INT. UPSTAIRS BATHROOM, FARMHOUSE - NIGHT 215   215  Frank bursts through the door and stops.  The floor has two inches of water. The bathtub is brimming. A  tiny foot breaks the surface, floating lifeless.  Before Frank can scream, we...  CUT BACK TO:  99.",
      "dialogue_count": 0,
      "word_count": 417
    },
    {
      "scene_number": 28,
      "slugline": "EXT. ADELE’S HOUSE - DAWN 216   216  INT. HENRY’S BEDROOM - EARLY MORNING 217   217  Henry is already dressed. He seals the envelope to his father  and stuffs it in his pocket.  INT. STAIRWELL - EARLY MORNING 218   218  Henry quietly walks down the stairs to find Frank and Adele  doing final preparation.  INT. LIVING ROOM, ADELE’S HOUSE - EARLY MORNING 219   219  Adele looks up at Henry with a mournful look.  HENRY  What’s wrong?  ADELE  It’s Joe. When I went to carry his  cage out to the car, he wasn’t  moving. He was just lying there.  Henry quickly goes to Joe’s cage.  HENRY  It’s fine. Sometimes, he gets tired  in the heat.  Henry looks into the cage. Joe is lying on the newspaper,  dead. Eyes open. One paw stretched out.   *  HENRY (CONT’D)  You killed him.  FRANK  Your mother and I would never do  anything like that.  HENRY  Of course you would. You never  wanted him to come in the first  place.  ADELE  You don’t believe that.  FRANK  I’m very sorry for your loss, Hank.  100.",
      "characters": [],
      "action_text": "Henry shoots Frank a look.  EXT. BACKYARD - EARLY MORNING 220   220  Henry digs a small grave for Joe. Frank goes to help him, but  Adele holds him back. Henry’s face is filled with sadness and  anger. It’s slowly beginning to drizzle.  INT. ENTRYWAY, ADELE’S HOUSE - EARLY MORNING 221   221  Frank and Adele are reviewing a ROAD MAP. Henry comes  hustling by out the door.  ADELE  Where are you going?  HENRY  I’ll be back.  FRANK  Hank...  EXT. SUBURBAN STREET - EARLY MORNING 222   222  It’s still early enough that cars are using their headlights.  The light rain continues to come. Henry walks along the side  of the street, hands in pockets, deep in thought.  EXT. GERALD’S HOUSE - EARLY MORNING 223   223  Henry stands at the edge of the yard. A couple lights are  already on in the house.  ADULT HENRY (V.O.)  My father would be up already,  sitting in the kitchen alone with  his coffee reading the sports page.  Marjorie would come down in a  minute to heat the water for  Chloe’s bottle. Soon, they’d all be  in the kitchen having breakfast.  (a beat)  Apart from me, they were a regular  family.  Perhaps we even see a silhouette walk into the kitchen and  lean over another silhouette for a kiss.  Henry walks over to the mailbox. Opens it. Places the note to  his father. Shuts it.  101. ADULT HENRY (V.O.)  Knowing my father, sometime around  dinnertime, he’d be reading my  letter. By then I’d be someplace in  Canada. On the run.  EXT. SUBURBAN STREET - MORNING 224   224  Henry is walking back home. The rain has gotten heavier. His  clothes are beginning to stick to his skin.  A car begins to slow down next to him. As it gets closer, we  realize it’s a POLICE CRUISER.  The passenger side window lowers, revealing OFFICER  TREADWELL, who we found putting up signs of Frank earlier.  OFFICER TREADWELL  You need some help son?  HENRY  I’m okay.  OFFICER TREADWELL  You want to tell me where you’re  going? It’s pretty early for  someone your age to be out on the  road without a j",
      "dialogue_count": 0,
      "word_count": 777
    },
    {
      "scene_number": 29,
      "slugline": "EXT. ADELE’S HOUSE - DAY 226   226  The rain has dissipated. Through the windshield of the police  cruiser, we see Adele carrying a box from the door.  The cruiser comes to a stop and Henry hops out quickly.  HENRY  Thank you for the ride.  Adele watches the officer as she places the box in the back  of her car. The cop sits there for a brief moment... then  decides to get out.   Shit.   The cop walks up the pathway as   *  Adele returns to the door.  OFFICER TREADWELL  I found him soaking wet on the side  of the road. Did you know he was out?  ADELE  (to Henry)  There you are.  (to the officer)  He said he’d be right back.  OFFICER TREADWELL  He’s got to be in school in a few  minutes, doesn’t he?  ADELE  Sure does.  (trying to end the  conversation)  Thank you for bringing him home.  A beat. The officer notices the boxes.  OFFICER TREADWELL   *  You going on a trip?  ADELE  Hm?  POV of Frank watching from the above window.   *  OFFICER TREADWELL  Taking a road trip?  ADELE  Oh, um, no. Just taking some old  things to sell on consignment.  OFFICER TREADWELL  Need a hand?  104.",
      "characters": [
        "GERALD"
      ],
      "action_text": "ADELE  I’ll be fine. Don’t want to take  you away from your duties.  OFFICER TREADWELL  I think the streets are safe for a  moment.  A long beat.  ADELE  Well, yes, thank you then...  Adele leads Treadwell into the...   *  INT. ENTRYWAY, ADELE’S HOUSE - DAY 227   227  Treadwell looks around, taking the place in. It can’t help  but look a little like he’s scoping the place out.  Henry watches him carefully from the kitchen doorway.  ADELE  (pointing to a box)  That’s the heavy one.  Treadwell tips his hat and picks it up.  OFFICER TREADWELL  You weren’t kidding... What do you  got in here?  ADELE  Some old kitchenware.  He smiles and carries it out the door.  EXT. ADELE’S HOUSE - DAY 228   228  The officer places the box in the trunk of the car. Adele  steps up from behind him.  ADELE  Thank you for your help.  OFFICER TREADWELL  (extends a hand)  Pleasure.  Adele’s hands are in her dress pockets. We know they’re  shaking. She holds back. Just long enough to get a  questioning look from the officer, when...  105. Henry takes the officer’s hand. An odd look for a second.  OFFICER TREADWELL (CONT’D)  That’s a firm grip you got there,  partner.  (tips his hat again)  Have a good day, ma’am.  The officer returns to his cruiser. He takes one last look at  the house before getting in his car and driving off.  Adele exhales.  INT. ENTRYWAY, ADELE’S HOUSE - DAY 229   229  Adele and Henry enter the house as Frank descends from  upstairs. Look out the window just as the cruiser drives off.  FRANK  He seem suspicious?  ADELE  I couldn’t tell. No more than a  policeman usually is, I suppose.  FRANK  We got to get out of here. Take  Henry to the bank, while I finish  up here.  (takes Adele)  We’re going to be fine.  Henry watches as Frank infuses confidence into his mother.  EXT. BANK PARKING LOT - DAY 230   230  Adele sits in the car with Henry. She’s visualizing the whole  transaction in her head. Breathing. Henry watches nervously.  After a moment, she looks at Henry. She’s re",
      "dialogue_count": 1,
      "word_count": 4254
    },
    {
      "scene_number": 30,
      "slugline": "INT. NEW PRISON LIBRARY - DAY 275   275  The unmistakable back of Frank’s head. Hair now peppered  grey. We don’t see his face. He’s at a desk. Writing.  FRANK (V.O.)  Dear Henry. I hope you will  remember me. We once spent Labor  Day weekend together. Five of the  best days of my life.  INT. KITCHEN, PIE SHOP - DAY 276   276  Henry reads along.  FRANK (V.O.)  I had always wondered who you would  become and what you would look like. And  then, one day while flipping through a  magazine, I came across a familiar  looking pie and there you were.  Henry’s eyes begin to moisten.  INT. NEW PRISON LIBRARY - DAY 277   277  We now see Frank. Just as handsome. Somehow prison has not  destroyed all that is good in the depth of his eyes. The  library is so modern, it almost looks like a high school.  FRANK (V.O.)  The opportunities for me to impart  knowledge of any kind have been  limited in my life, so it’s nice to  think I might have contributed some  small piece of wisdom or know-how.  I’m proud of you.  INT. HENRY’S MASTER BEDROOM - NIGHT 278   278  Henry is in bed with his WIFE, a brunette of similar age who  has a similar literary quality to her. They read the letter.  FRANK (V.O.)  I will understand if you choose not  to respond to this letter. Your  silence would be as much word as I  would need, to discontinue any  thought of further communication.  125.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 251
    },
    {
      "scene_number": 31,
      "slugline": "INT. FRANK’S CELL, MODERN PRISON - DAY 279   279  Frank looks out a thin window on a rainy day. The changes in  the prison are enormous. His bed is stainless steel. The  window, a long horizontal slit in the wall.  FRANK (V.O.)  However, I am due to be released  shortly. I’m no longer young, but I  have plenty of good health  remaining, and I’d like to live  much the way we discussed that  weekend, back when we thought we’d  be a family.  Frank hears a knock on his cell door. He passes the sealed  envelope to the mail service.  INT. HENRY’S BEDROOM - NIGHT 280   280  Henry and his wife continue to read the letter.  FRANK (V.O.)  Most likely, your mother has remarried  by now and is living with a husband  somewhere. While this thought haunts  me, I’d be relieved to know that she  had found happiness. She deserves it.  Henry looks to his wife.  FRANK (V.O.)  But on the off chance that she might  be alone, I wanted to ask you whether  I might write her a letter. I promise  you, I would sooner cut off my own  hand than bring any more grief to  Adele.  Henry puts down the letter.  ADULT HENRY (V.O.)  I wrote him back that day to say it  wouldn’t be difficult to locate my  mother. She lived at the same  address.  EXT. ADELE’S HOUSE - MODERN DAY 281   281  As we push in, we notice that the house has deteriorated.  126.",
      "characters": [],
      "action_text": "ADULT HENRY (V.O.)  And it would be far less difficult  to locate his place in her heart.  EXT. MODERN PRISON - MODERN DAY 282   282  A parking lot and a fence.  ADULT HENRY (V.O.)  Sex is a drug, Eleanor had told me.  We see Adele now in her late fifties. She leans against her  car wearing a coat, waiting for the fence to open.  ADULT HENRY (V.O.)  The real drug, I came to believe,  was love.  The fence begins to move. It reveals Frank. Adele sits up.  They see each other for the first time in nearly twenty  years. It’s as emotional as you’d imagine.  EXT. COUNTRY ROAD - MODERN DAY 283   283  We see Frank and Adele driving along a country road.  Everything is quiet and serene.  ADULT HENRY (V.O.)  Rare love, for which no explanation  might be found.  They look at each other, checking to make sure they’re  actually sitting in the same car. She holds his arm.  ADULT HENRY (V.O.)   *  They were two people who could not   *  go out into the world, so they made   *  a world with each other.   *  OMITTED 284   284   *  EXT. FRANK’S FARM - LATE AFTERNOON 285   285  Henry and his wife find the old dirt driveway that leads up  to Frank’s grandmother’s farm. They turn and start up the  bumpy road.  127.",
      "dialogue_count": 0,
      "word_count": 472
    },
    {
      "scene_number": 32,
      "slugline": "INT. HENRY’S CAR - SAME 286   286  Henry takes in the scene. This is obviously his first time  visiting the farm.  EXT. FARM HOUSE - LATE AFTERNOON 287   287  Henry steps out of the car. His wife opens the rear passenger  door and picks up their INFANT out of the carseat.  Henry looks up at the farm house. His mother and Frank  nowhere to be seen.  EXT. FIELD BEHIND THE FARM HOUSE - LATE AFTERNOON 288   288  Henry and his wife come around the back side of the farm  house. Looking down past the field where we once saw Frank  and Mandy run as teenagers, we see a small garden. In the  late afternoon light, we can see Frank and Adele picking  vegetables. Perhaps even a few roaming chickens. After a  beat, they look back up and wave.  Henry smiles as he leads his family down to the garden.  Perhaps rolling up his sleeves.  Adele notices her son approaching and stops.   *  ADELE   *  (almost a whisper)   *  You brought the baby.   *  FADE TO BLACK.  128.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 178
    }
  ]
}