{
  "slug": "lee-daniels-the-butler-2013",
  "title": "lee daniels the butler",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 20,
  "characters_count": 1,
  "characters": [
    "LOUIS"
  ],
  "total_words": 21875,
  "total_dialogue": 1,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. WHITE HOUSE - ENTRANCE HALL - DAY - 2009  CECIL GAINES, 90, kind, elegant and much wiser than he lets  on, sits in the Entrance Hall of the White House. It’s been  many years since he’s been here, but it’s as he remembers.  QUICK CUT TO - an image of two black men HANGING from a pole,  they’ve just been lynched. The American flag waves in the  wind behind their limp bodies.  CUT BACK TO - CECIL IN THE WHITE HOUSE. He is emotionless as  he contemplates his dark past. We hear his voice...  CECIL V.O.  The only thing I ever knew was  cotton.  FADE CUT TO:  EXT. COTTON FARM - DAY - 1926  The sun pounds down on a beautiful cotton field. Brilliant  reds and alabaster whites intermix with green foliage along a  blue river bed. Twenty or so black FIELD WORKERS lace the  cotton field baking in the heat.  CHYRON: MACON, GEORGIA, 1926  CECIL V.O.  It was hard work. But I didn’t mind  because I got to spend all day with  my daddy.  Cecil Gaines, now 8, sits in the field with his dad, EARL  GAINES, 30, tough, who teaches him how to pick cotton.  EARL  ...and you know the cotton is ready  when the bulb splits, and the bulb  is star shaped, like a big old star  in the sky. Like your big ol’ head.  Earl rubs cotton all over young Cecil’s head as Cecil laughs.  EXT. WESTFALL HOUSE - PORCH - DAY - 1926  THOMAS WESTFALL, 25, an attractive white man with bad skin  sits with his grandmother ANNABETH, 70’s, sharp and stern,  reading on the kitchen porch as he heads to the field. Thomas  looks over his property and his workers. It’s a good day.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 292
    },
    {
      "scene_number": 2,
      "slugline": "EXT. COTTON FARM - DAY - 1926  Cecil’s friend, ABRAHAM, 9, holds a worn old camera as Earl  positions his wife, HATTIE PEARL, 25, beautiful, together  with Cecil.  EARL  Hurry up and take this picture.  ABRAHAM  Why don’t everybody smile?  The family barely smiles as Abraham snaps the camera. 2   2  Then - Thomas walks into the field, towards Hattie Pearl.  THOMAS  Hattie, come on. Come on!  Little Cecil and Abraham both look up with concern to Earl.  Hattie Pearl reluctantly follows Thomas to the shed.  CECIL  Pa, where is he taking ma?  THOMAS  Get back to work!  Earl looks frustrated. He goes back to the cotton. His pace  quickens as he picks the cotton. Sweat drops from his lip.  Cecil heads for the shed. Earl snatches him mid-stride.  CECIL  (Yelling)  Mamma!  EARL  Look at me boy. Don’t lose your  temper with that man. This is his  world.   We just be living in it.  You hear me? Now get on back to  work!  Cecil watches his mother enter the shed. Stares a beat, then  sadly goes back to work with Abraham.  We hear some commotion, then Hattie Pearl’s piercing SCREAM.  The workers don’t look up. Everyone continues picking cotton.  Annabeth stands from the porch. She looks towards the shed.  Thomas stumbles back to the field. None of the workers dare  look up except for Earl.  2.",
      "characters": [],
      "action_text": "CECIL  Pa...What you goin’ do?  Earl turns to Thomas defiantly.  EARL  Hey! Don’t you ever do that to my  wife.  Thomas pulls his revolver out.   Cecil looks terrified, as  everyone watches in silence. Then -  Thomas SHOOTS Earl square in the eye!  CECIL  Dad!  The WORKERS on the field freeze.   Little Cecil stares in  shock at his father’s body twitching against the cotton, a  chunk of his head in the dirt.   A fly lands on Cecil’s brow.  Annabeth runs towards the field as Thomas heads back to the  house waving his gun around.  THOMAS  What are you looking at?! Huh? Who  wants to go next? You get back to  work!  Cecil trembles in utter shock as Annabeth approaches him.  ANNABETH  Hey you! Men! Get some of the hands  to help dig a hole for his pa.  She points to an area taken over by weeds near the shed. Then  leans down toward Cecil, feels sorry for him.  ANNABETH (CONT’D)  Stop crying.  (Then)  I’ma have you working at the house  now.  She bends down to face him.  ANNABETH (CONT’D)  I’m gonna teach you how to be a  house nigger.  Little Cecil stares at her in pure sadness.  TITLES  3.",
      "dialogue_count": 0,
      "word_count": 425
    },
    {
      "scene_number": 3,
      "slugline": "INT. WESTFALL HOUSE - KITCHEN - DAY - 1926  PATTY CAKE, 50’s, heavy, arranges baked chicken on a tray.  Cecil pays close attention. Annabeth enters to oversee.  ANNABETH  Quiet when you’re serving.   I don’t  even want to hear you breathe.  A fearful Cecil nods.  INT. WESTFALL HOUSE - DINING ROOM - NIGHT - 1926  Cecil stands behind Patty Cake holding a bowl of potatoes  that she scoops onto Annabeth’s, Thomas’, and her TEENAGE  GRANDSON’S plates. These men appear to be an ungrateful  bunch. Cecil holds his breath, struggling not to make a peep.  CECIL V.O.  It was much nicer working in the  house than in the field.  Thomas grabs Cecil’s arm.  THOMAS  Give me more.  INT. STUDY - DAY - 1926  Cecil pours iced tea for Annabeth who reads   The Adventure of  Sherlock Holmes.   Annabeth examines the tea. Satisfied, she  goes back to her book, flicks her hand at him to leave.  INT. WESTFALL HOUSE - KITCHEN - DAY - 1926  SEQUENCE - TIME LAPSE: Cecil serving throughout the household  as we dissolve from 8 year old Cecil to 15 year old Cecil.  15 year old Cecil bows his head at his father’s grave.  CECIL V.O.  When I got older, I knew I had to  go before he killed me too.  He then heads up the road walking through the poverty  stricken sharecropper’s houses.  CECIL V.O. (CONT’D)  Part of me was scared to leave, it  was the only world I ever knew.  4.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 244
    },
    {
      "scene_number": 4,
      "slugline": "EXT. SHARECROPPER HOUSE - DAWN - 1933  Hattie Pearl sits in the corner, a shell of a woman.   The  years have broken her mind. Cecil goes to his mother, he  holds out an old watch.  CECIL  Ma, I took pa’s watch.  Hattie doesn’t respond.  CECIL (CONT’D)  Ma, I’m leavin’.  She’s too far gone to even notice him. He hugs her goodbye.  CECIL V.O.  My ma never spoke much after that.  I knew she’d miss me. But I also  knew she wanted me to leave that  place.  EXT. PORCH - NIGHT- LATER - 1933  Annabeth sits in the rocker on her porch as she tucks a book  into Cecil’s shirt.  CECIL V.O.  And even though Miss Annabeth never  said it, I knew she’d miss me too.  EXT. SHARECROPPER HOUSE - DIRT ROAD - 1933  Cecil walks down a lonely dirt road by himself.  CECIL V.O.  I don’t think God meant for people  to not have a family. I yearned for  one.  INT./EXT. CULVERT - NIGHT - 1933  A rainstorm hammers down upon the roof of a small culvert.  Cecil cradles his shivering body.   Water drips from the roof  down onto Cecil’s head. DRIP...DRIP...DRIP. With each DRIP of  water, he looks like he’s slowly going mad.  CECIL V.O.  Outside the cotton fields was much  worse than I thought it’d be.  5.",
      "characters": [],
      "action_text": "SEQUENCE: Cecil traveling through the Southern countryside.  He walks through the rain, alone, hungry and desperate.  CECIL V.O. (CONT’D)  No one would give me a job, or  food, or a place to sleep. I was  hungry all the time.  EXT. STREET INTO TOWN - MIDDLE OF THE NIGHT - 1933  Cecil walks into a town and passes by two lynched men hanging  from a pole (the opening of the film). Cecil stares at them,  terrified.  CECIL V.O.  Any white man could kill any of us  at any time and not be punished for  it. The law wasn’t on our side. The  law was against us.  EXT. HOTEL RESTAURANT - MIDDLE OF THE NIGHT - 1933  Cecil creeps down the street through the pouring rain.  Paranoid, he looks over his shoulder. He peers in a window of  the restaurant, sees an elaborate array of succulent pies and  cakes resting on the counter.  CECIL V.O.  And even though I knew the law was  against me...  He gazes in, then suddenly SMASHES the window with his fist!  INT. HOTEL RESTAURANT - NIGHT - 1933  His wrist gashed and spilling blood, Cecil heads toward the  pastry laced counter. He devours a frosted coconut creme  cake.   He sees his blood drip into the frosting.  Cecil catches a glimpse of himself in the mirror behind the  counter. The hunger in his eyes, blood mixed with white  frosting against his black skin are a site of the macabre.  CECIL V.O.  ...I never knew I could be this  hungry.  Then a VOICE calls out from across the room.  6. VOICE  You know what could happen to you  son?  Clutching the cake like a rabid dog, Cecil turns to MAYNARD,  late 50’s, a freckled-faced, gentle-looking light-skinned  black man.  MAYNARD  Get up. I said get up.  EXT. ALLEY WAY - DAWN - 1933  Cecil and Maynard sit on the kitchen stoop outside the  restaurant.   Cigarette dangling, Maynard bandages Cecil’s  wrist.  MAYNARD  I’m going to have to lie to the  boss man about that window.   Good  lord says you aint supposed to lie.  CECIL  Sorry sir.  MAYNARD  Where’s your ma and your pa?  CECIL  My Ma crazy in",
      "dialogue_count": 0,
      "word_count": 1212
    },
    {
      "scene_number": 5,
      "slugline": "EXT. WASHINGTON, DC SKYLINE - NIGHT  SEQUENCE: ESTABLISHING SHOTS of 1950’s Washington DC ending  on the gorgeous Excelsior Hotel.  CECIL V.O.  When I took that job up in  Washington, DC it was the most  beautiful hotel I had ever seen.  INT. EXCELSIOR HOTEL - LOBBY - NIGHT - 1954  A WEALTHY COUPLE, 50’s, white, he in top hat, she in mink,  walk into the stunning lobby. Waiting to greet them is:  Cecil Gaines, now 36. Wearing a black vest and bow tie, he  looks like a different person - filled out, handsome, exudes  class and refinement.  Holding a silver tray with a tumbler of scotch and a glass of  champagne, he gives the wealthy couple an elegant head bow.  CECIL  I hope I wasn’t too presumptuous to  have prepared a few spirits after  your long journey in from Buffalo.  INT. EXCELSIOR HOTEL - STUDY - NIGHT - 1954  Older men in three piece suits are crammed in the hotel’s  study smoking cigars, drinking bourbon. An elegant 36 year-  old Cecil walks in with a tray of martinis.  A LOUD PATRON talking politics sits across from a man with a  CREW CUT, Cecil’s age, he holds a cigar. The Crew Cut Man  searches his pockets for matches.  LOUD PATRON  Best decision that court ever made  was to slow this whole mess down.  Nigger boys in school with white  girls?! Who ever heard of such a  thing? Next thing you know they’d  be fornicatin’. Gentlemen, this  could start another Civil War.  He sets his scotch down close to the table’s edge. Cecil  glances at it, noting how full the other glasses are.  11.",
      "characters": [],
      "action_text": "LOUD PATRON (CONT’D)  Cecil, what do you think about  niggers going to school with white  children?  All eyes on the table turn to Cecil, the Crew Cut Man paying  particular attention as he searches for matches.  CECIL  To be honest with you, Mr. Jenkins,  I tend to not to be too concerned  with American or European politics.  The Crew Cut Man smiles, likes the answer.  LOUD PATRON  Nor should you, Cecil, they’re all  criminals. Earl Warren should be  shot and hanged. That dumb son-of-  bitch is trying to integrate our  schools.  Cecil smiles with kindness and grace, his signature.  CECIL  I think Judge Warren is going to  find that quite a challenge.  The Loud Patron busts out laughing.  LOUD PATRON  Damn right, Cecil! Damn right.  Puffing out smoke, the Crew Cut Man grins at Cecil, taking  note of him, as Cecil walks out of the room with grace.  CECIL V.O.  Never in my life did I dream that I  would work in a place as fancy as  this.  EXT. OTIS PLACE - WASHINGTON, D.C. - MORNING - 1957  Driving in his 1951 Ford, Cecil heads down a quaint street in  a lower-middle class black neighborhood passing two story row  homes that share a common wall. Porches have swings, fences  are painted white. It’s not a wealthy neighborhood, but there  is a collective pride.  CECIL V.O.  I never dreamed my life could be so  good.  12.",
      "dialogue_count": 0,
      "word_count": 507
    },
    {
      "scene_number": 6,
      "slugline": "INT. GAINES HOUSE - MORNING - 1957  Cecil walks into his modest three bedroom home. A small  living room connects to the kitchen. China in glass cases,  immaculate carpets, a portrait of Jesus stares at us.  Smoking her Pall Mall, big curlers in her hair, is GLORIA,  38, tough, brash but full of love. She sits at the kitchen  table peeling potatoes, tapping her feet to “Teardrops From  My Eyes.” Warm biscuits, fat back and eggs on the stove.  CECIL V.O.  Gloria and I met working at the  Excelsior. She was a maid at the  hotel. But now her only job was  raising our two boys. I made sure  that they never laid eyes on a  cotton field.  Their youngest son, CHARLIE, 9, fidgets next to her doing his  homework. He wants out.  CHARLIE  I gotta pee.  Gloria gives him a blank look. She’s so on to him.  GLORIA  Not today. Don’t try that. Finish  that homework.  Cecil stands in the doorway, smiling at his family.  CECIL  Where’s Louis at?  GLORIA  He’s taking the trash out.  Charlie looks at his father, smiles. He’s happy to see him.  CHARLIE  Working late again, huh?  CECIL  Yup.  CHARLIE  How was your shift?  Cecil drops his refined dialect at home.  CECIL  Beats working for a livin’.  13.",
      "characters": [],
      "action_text": "He reaches for the plate of fat back. Gloria pouts sweetly.  GLORIA  I miss you at night, honey.  CECIL  (To Charlie)  Didn’t you say you gotta pee? Go  ahead then. And wash your hands  when you come out of that bathroom  boy.  Coffee in hand, Cecil kisses her passionately.  CECIL (CONT’D)  Good morning!  GLORIA  Good morning sir.  Charlie runs to the bathroom. Happy to be rid of his parents.  LOUIS, 15, smart and very perceptive, enters the room.  LOUIS  Hey dad.  He heads for the kitchen table.  CECIL  Hey Louis. You alright?  LOUIS  Yeah I’m fine.  Gloria goes to get Louis food. She starts pontificating.  GLORIA  That woman whose son got killed,  she’s around doing speeches now.  (to Cecil)  What’s her name, honey?  Cecil starts to answer, Louis chimes in. He knows very well.  LOUIS  Mamie Till.  GLORIA  Mamie Till... I remember that story  just like it was yesterday even  though it was two years ago. It was  dis-damn-graceful what they did to  that boy just for looking at a  white woman...  14.  (MORE) Beat him up, threw his body in the  river... killed him. He was just 14  at the time.  CECIL  Crazy white folks down south.  She starts serving breakfast to her men. Louis takes all of  this in. He is clearly disturbed.  GLORIA  At least we have it a little better  here in DC, huh?  CECIL  Still treating us bad too.  GLORIA  (Yelling to Charlie)  Get on down here Charlie!  Charlie enters from the bathroom.  CHARLIE  Louis said we should stop taking  the white man’s shit.  CECIL  Watch your mouth.   GLORIA  Watch your mouth.  The telephone RINGS. Charlie charges towards the telephone.  CHARLIE (CONT’D)  (picking up the phone)  Hello, Gaines’ residence.  Charlie listens attentively.  CHARLIE (CONT’D)  Uh, yeah... Hold on Mr. Kidgan.  (To Cecil)  It’s the boss man dad.  GLORIA  What’s he calling for?  Cecil snatches the phone.  CECIL V.O.  When the white man called, I always  assumed the worst.  15.  GLORIA (CONT'D) CECIL  Yes sir?  CECIL V.O.  I would have put money",
      "dialogue_count": 0,
      "word_count": 1812
    },
    {
      "scene_number": 7,
      "slugline": "INT. WHITE HOUSE - HALLWAY - DAY - 1957  Cecil and Freddie walk through the White House hallway.  FREDDIE  There are 16 full time maid, 6  butlers, 4 carpenters, 2 painters,  7 electricians, 3 dishwashers, 3  doorman, a full kitchen staff  including pastry chef and 3 full  time calligraphers. 2 painters, 7  electricians and 9 engineers.  They walk the Cross Hall passing Presidential portraits.  FREDDIE (CONT’D)  Here comes Warner.  The Crew Cut Man from the hotel, RD WARNER, cold, walks by.  Cecil’s eyes light up, he steps forward.  CECIL  Mr. Warner, I wanted to thank you  for this opportunity to work in the  Whi--  But RD Warner keeps walking, doesn’t even acknowledge him.  Cecil is surprised by the snub, but Freddie just smiles,  that’s how it is here.  FREDDIE  (Laughing)  Come on. Here we go.  Cecil spots a maid scrubbing the floor of a bathroom.  CECIL  Ma’am, I’m Cecil Gaines, I’ll be  working with you here.  FREDDIE  Mr. Gaines, please don’t do that.  INT. WHITE HOUSE - STATE DINING ROOM - DAY - 1957  Cecil and Freddie stand in the State Dining Room, an elegant  room with ornate gold curtains, gold chandelier and a massive  portrait of Abraham Lincoln. They hover over a dining table  covered in the finest china, crystal and flatware.  FREDDIE  When lifting a plate, never scrape  the bottom.  23.  (MORE)",
      "characters": [
        "LOUIS"
      ],
      "action_text": "You must never listen or react to a  conversation. The room should feel--  CECIL  --empty when I’m in it.  Freddie nods.  INT. WHITE HOUSE - BUTLER’S LOCKER ROOM - AFTERNOON - 1957  A Brooklyn Dodgers game BLASTS from a rickety transistor  radio somewhere in this cramped room. Cecil enters unnoticed  as JAMES HOLLOWAY, 32, intellectual, brushes his teeth as he  listens to CARTER WILSON, 40, brash and crass, tell a story.  CARTER  ...So then she says, “stick a  finger in.” So I stick a finger in.  Then she says, “Stick two fingers  in!”. “Okay!” Then she starts  moanin’ and screamin’ and yells,  “Stick your whole hand in!” So I  put my whole hand in.   Then she  yells out, “Put both hands in!”.  “Okay!” Then she screams, “Now  clap!” I say, “I can’t.”   She looks  up, smiles and says, “See I told  you my stuff was tight.”  Cecil ROARS. Carter notices Cecil.  CARTER (CONT’D)  Hey! There he is! I heard you were  coming. What’s your name brother?  Cecil holds out his hand.  CECIL  Cecil. Cecil Gaines.  Carter shakes his hand first.  CARTER  Cecil Gaines. I’m Carter Wilson,  head butler. Don’t worry about Big  Mo behind you. That brother will  steal your wallet before you even  knew it.   This brother in the  mirror over here, his name’s James  Holloway, he’s my second in  command.  Cecil holds out his hand to Holloway.  24.  FREDDIE (CONT'D) CECIL  Hey James.  HOLLOWAY  Jackie Robinson or Willie Mays?  CARTER  Why don’t you shake the man’s hand  first ‘fore you start asking  difficult questions like that?  HOLLOWAY  I just want to know where the man’s  coming from.  CECIL  Look like the jury is still out on  that one, right?  They shake hands.  HOLLOWAY  That’s right. Welcome. Fancy  Freddie give you the tour yet?  Cecil nods.  CECIL  He did. Are the Dodgers losing?  HOLLOWAY  I might be able to answer that  question if Carter over here stop  running his nasty mouth?  The three men listen through the static. Fast friends.  INT. KITCHEN - LATER - 1957  Wearing his tuxedo",
      "dialogue_count": 1,
      "word_count": 3329
    },
    {
      "scene_number": 8,
      "slugline": "INT. WOOLWORTHS LUNCH COUNTER - 2ND FLOOR - DAY - 1960  The five students walk up to the LUNCH COUNTER. It is half  filled with WHITE PATRONS.  JAMES LAWSON V.O.  With discipline, and a bit of a  sense of humor.  The black students sit down at the counter. The white patrons  immediately look at them, stunned. A WAITRESS drops her tray.  WAITRESS  You know y’all can’t sit here.  LOUIS  We would like to be served, please.  JAMES LAWSON V.O.  This is unprecedented what we’re  talking about. But it needs a  patience that none of us have ever  seen.  WAITRESS  You can order food in the colored  section, but I’m not going to be  serving you here.  The students stare forward. They aren’t going to move.  INT. WHITE HOUSE STATE DINING ROOM - DAY - 1960  All the Butlers prepare for an elaborate state dinner.  INT. WOOLWORTHS LUNCH COUNTER - DAY - 1960  Patrons stare at the students. Every one is giving them  confused and dirty looks. BLACK PATRONS sitting in the  ‘colored only section’ look nervous. The students all look  calm as they stare forward, waiting to be served.  JAMES LAWSON V.O.  We are organized. We have a leader  with every group. We have lookouts,  with pocket change, and the local  phone numbers for ambulances ready.  And when one wave comes off that  lunch counter, what follows?  40.  (MORE)",
      "characters": [],
      "action_text": "A whole ‘nother wave of negro  students sitting right there at  that lunch counter blowing their  minds.  Louis turns to the Waitress.  LOUIS  We would like to be served, please.  She just stares back at him like he’s crazy.  JAMES LAWSON V.O.  Now who wants to role play?  INT. FISK UNIVERSITY MEETING ROOM -   DAY - 1960  We are back during the ‘training session’. Louis is  surrounded by students yelling at him. They are preparing for  the sit-in as James Lawson hovers nearby.  JAMES LAWSON  Attack them. This is an experiment.  So you need to do whatever it takes  to break their spirit.  Lawson turns to a WHITE STUDENT, 19, nerdy.  JAMES LAWSON (CONT’D)  I need to hear nigger coming out of  your mouth. I need to hear coon.  STUDENT  I don’t feel comfortable saying  that.  JAMES LAWSON  You came here to get yourself  prepared, and get her prepared. So  let me hear it, now!  The White Student turns to a GIRL, 19, sitting in a chair.  STUDENT  Nigger.  JAMES LAWSON  Louder! Say the words like you mean  it!  STUDENT  Nigger!  41.  JAMES LAWSON V.O. (CONT'D) JAMES LAWSON  (yelling)  Louder!  STUDENT  (screaming)  Nigger! You are a nigger!  INT. WOOLWORTHS LUNCH COUNTER DAY - 1960  An ELDERLY WOMAN PATRON, 70’s, jumps to her feet, loosing her  patience and temper with the students.  ELDERLY WOMAN PATRON  You need to be sitting in the  colored seating! This is not for  you! You cannot be served here!  INT. FISK UNIVERSITY MEETING ROOM -   DAY - 1960  Back in the training session, the nerdy White Student keeps  yelling at the Girl.  STUDENT  You are a nigger!  JAMES LAWSON  Make her believe it!  STUDENT  You are a nigger!!!  INT. WOOLWORTHS LUNCH COUNTER - DAY - 1960  The Elderly Woman Patron is getting even angrier, she starts  yelling at the restaurant STAFF.  ELDERLY WOMAN PATRON  If you want us to shop in this  establishment, make them go!  She throws up her arms, has had enough.  ELDERLY WOMAN PATRON (CONT’D)  Come on, Robert. Let’s go.  They exit. Louis watches her go",
      "dialogue_count": 0,
      "word_count": 1481
    },
    {
      "scene_number": 9,
      "slugline": "INT. WHITE HOUSE - VARIOUS LOCATIONS - 1961  SEQUENCE: A series of shots of the White House staff packing  up President Eisenhower’s belongings and preparing for the  arrival of the new President.  CECIL V.O.  The President lives at the White  House until the moment the next one  is sworn in. So the staff has  exactly two hours during the  inauguration ceremony to move the  old President out and move the new  one in.  INT. WHITE HOUSE - EAST ROOM- DAY - 1961  The White House Staff are all lined up. Maids, Cooks,  Butlers, Housemen, Engineers. Everyone stands at attention,  very nervous, butterflies are in the air.  Carter whispers to Cecil.  CARTER  They say this new white boy is  smooth.  CECIL  I just need to get my butt home to  Gloria. These hours are killing us.  CARTER  How’s your boy doing, Cecil?  Before he can answer, the front doors open. JOHN KENNEDY, 43,  handsome, and his wife JACKIE, 32, beautiful and astute,  enter.   Movie stars. Jackie holds a three month old JACK, JR.  as CAROLINE, 3, tags behind. They are surrounded by many  AIDES.   Jack flashes the staff an enormous grin.  JACKIE  Where should we start?  JACK  I’m not sure. This end? Maybe over  here? Thank you.  FREDDIE O.S.  Right this way Mr. President.  JACK  Hello everyone.  47.",
      "characters": [],
      "action_text": "ALL STAFF  Hello Mr. President.  JACK  I’m thrilled to be working with all  of you over the next four years.  Jackie is slightly aloof.   She speaks in almost a whisper.  JACKIE  Eight years, Jack.  JACK  (laughing)  Well, you see who wears the pants  around here.  Everyone laughs. Freddie introduces the staff to John one by  one with Jackie in tow. They get to Cecil.  FREDDIE  This is Cecil.  CECIL  Pleasure to meet you, Mr.  President.  Cecil nods to Jackie walking behind Jack.  CECIL (CONT’D)  Miss Kennedy.  Caroline Kennedy drops her doll in front of Cecil. Cecil  bends down to pick it up and hands it to Caroline.  CECIL (CONT’D)  She’s all right. Pleasure to meet  you Miss Caroline.  INT. GAINES HOUSE - BEDROOM - NIGHT - 1961  Cecil is in bed reading a book on Addison’s disease. Gloria  tries not to stumble into the bedroom, clearly drunk.   The  slip that once fit her beautifully now hugs her hips the  wrong way. She crawls up next to Cecil.  CECIL  Why you drinking so much?  GLORIA  I’m not drinking.  48. CECIL  What’s that on your breath Gloria?  Stop, okay? Stop!  Gloria notices the book.  GLORIA  What’s that?  CECIL  Baby, that’s gin on your breath.  GLORIA  (ignoring him)  That says Addison’s Disease.  CECIL  Did you take Charlie to the dentist  today?  GLORIA  Does someone at the White House got  Addison’s disease?  Cecil nudges away from her a bit. Disturbed.  Gloria goes to the vanity table and smacks lipstick on.   She  sticks her butt out and starts to shake it.   Cecil and  Gloria’s eyes lock in the mirror. Then, Cecil turns away.  GLORIA (CONT’D)  No I did not take Charlie to the  dentist today. And what you asking  me about it for? You never home.  Now, you gonna act like you gonna  take Charlie to the dentist? You  ain’t never here, I don’t know how  you gonna take him. His teeth fall  out waiting on you to take him.  CECIL  Go to bed Gloria. I’ll take him  tomorrow.  GLORIA  Hoe many pairs of shoes does she  have?  Cecil ignores her.  GLORIA (CO",
      "dialogue_count": 0,
      "word_count": 3105
    },
    {
      "scene_number": 10,
      "slugline": "INT. GAINES HOUSE - BEDROOM - LATER - 1963  Cecil and Gloria are in bed holding each other.  CECIL V.O.  I knew that Gloria had been unhappy  for some time now. I knew that’s  probably why she drank. She wanted  me to get along better with Louis.  I didn’t know how. But I could cut  back them long hours at the house.  And I did just that.  GLORIA  How many pairs of shoes does she  got...  CECIL  She got about... 125.  GLORIA  125 pairs of shoes...  CECIL  Yeah. I put them in a line from the  blacks, all the way to the whites.  FADE TO BLACK.  INT. WHITE HOUSE - PRESIDENTIAL BEDROOM - CONTINUOUS - 1964  PRESIDENT LYNDON JOHNSON, tough as nails and a bit nutty,  notices the lights on in the room. He screams at Cecil.  LBJ  And I’ll tell you what. The next  time there is a light on in an  empty room, I will fire every sorry  son of a bitch in this house. I  mean it, Cecil, I’ll go back to  Texas and run the country from a  dirt shack if I have to! Is that  what you want?! Who do you think  pays the God-damned bills around  here. I don’t, but you know what I  mean.  CECIL  Yes, sir.  Cecil flicks off the light switch. LBJ instantly flips to a  gregarious, jovial southerner as he slaps Cecil on the back.  He holds out an LBJ tie clip to Cecil.  63.",
      "characters": [],
      "action_text": "LBJ  Oh yeah, I almost forgot. Ladybird  and I want you to have this. It  matches your eyes.  CECIL  Thank you, sir.  LBJ hands Cecil the tie clip.  INT. HOLLOWAY’S HOUSE - LIVING ROOM - EARLY EVENING - 1964  James Brown’s “Out of Sight” plays on the record player.  Cecil, Holloway and Carter play pinochle with their wives.  Everyone but Gloria drinks with abandon. Gloria smokes next  to Holloway’s wife, HELEN, 40, a rotund and lively woman.  HOLLOWAY  I see you baby! You know how daddy  likes it!  Helen smiles at Holloway. Holloway yells at the bathroom.  HOLLOWAY (CONT’D)  Negro! Get out here! Back there  stinkin up my bathroom! Oh Lord,  what you doing?  Carter runs out of the bathroom in a James Brown wig and  DANCES around the room like Brown. He’s really good. Helen  runs over and pulls the wig off his head.  HELEN  Give me my wig! What’s wrong with  you?! This my good wig!  CUT TO - LATER. Seated on the couch, Helen and Gloria are  chatting:  HELEN (CONT’D)  James said Dr. King told the  President that we would be going to  the streets down south for our  right to vote. Didn’t you baby?  The guys are still playing cards.  HOLLOWAY  What?  HELEN  64. Didn’t you tell me that Dr. King  told the President that we was  going down south for our right to  vote? I ain’t make that up.  She looks at her husband. Holloway looks away a little  embarrassed about his breach of confidentiality. Oblivious to  Cecil and Carter’s disappointment in him, she continues on...  CECIL  Is that what you heard?  HELEN  That Dr. King ain’t no joke with  his little militant ass.  Holloway’s embarrassment. Cecil deals the cards. He’s trying  to pay attention to the game.  HOLLOWAY  Who she talking to?  CECIL  Well it look like someone is  talking...  A parrot SQUAWKS. Holloway throws popcorn at it.  HELEN  Leave my bird alone.  GLORIA  You know three kids got killed down  there. Trying to get colored folks  registered to vote.  CECIL  That’s why I didn’t want Louis to  go down there. Tha",
      "dialogue_count": 0,
      "word_count": 1606
    },
    {
      "scene_number": 11,
      "slugline": "INT. GAINES’ HOUSE - LIVING ROOM - NIGHT - 1965  Gloria and Cecil cuddle up next to each other on the couch as  LBJ wraps up his speech.  LBJ (FROM THE TV)  And we shall overcome.  Cecil and Gloria both smile, they know Louis helped make this  happen.  EXT. WHITE HOUSE - GATE - DAY - 1968  HIPPIE PROTESTERS are outside the White House protesting the  Vietnam War.   We hear their enraged chants:  HIPPPIE PROTESTORS  HEY HEY LBJ, HOW MANY KIDS DID YOU  KILL TODAY?! HEY HEY LBJ, HOW MANY  KIDS DID YOU KILL TODAY?!  INT. WHITE HOUSE - RED ROOM - DAY - 1968  A maid cleans a mirror as she hears the chanting:  HIPPPIE PROTESTORS V.O.  HEY HEY LBJ, HOW MANY KIDS DID YOU  KILL TODAY?!  MAID  I wish they’d shut up.  CUT TO - FULL SCREEN ARCHIVAL FOOTAGE - VIETNAM  American bombs drop on the JUNGLES of Vietnam.  INT. LORRAINE MOTEL - MEMPHIS - DAY - 1968  MARTIN LUTHER KING, 38, wise, but weary, stands in the  doorway, various AIDES and STUDENTS fill the hotel room.  Louis sits across from him. They are watching footage of the  Vietnam War on television.  NEWSCAST  “US Casualties are on the rise in  Vietnam, giving fuel to critics who  say there is no end in sight for  what has become a bloody war.”  Martin Luther King shakes his head, frustrated.  71.",
      "characters": [],
      "action_text": "MARTIN LUTHER KING  President Johnson is making a  tragic error in Vietnam.  LOUIS  Why shouldn’t we fight in Vietnam?  MARTIN LUTHER KING  The Vietcong don’t call us niggers,  for one.  Louis and a few of his aides laugh.  MARTIN LUTHER KING (CONT’D)  Seriously, how many of your parents  support this war?  Almost all of them raise their hands.  MARTIN LUTHER KING (CONT’D)  Well my Lord...  (to Louis)  Why do your parents support it?  LOUIS  We haven’t spoken about it  specifically, I just know they do.  MARTIN LUTHER KING  What do your daddy do?  Louis looks at him embarrassed.  LOUIS  He’s a butler.  MARTIN LUTHER KING  The black domestic plays an  important role in our history.  LOUIS  I didn’t tell you that to make fun  of me.  MARTIN LUTHER KING  Young brother, the black domestic  defies racial stereotypes by being  hardworking and trustworthy. He  slowly breaks down racial hatred  with the example of his strong work  ethic and dignified character.  (Then)  72.  (MORE) Now while we perceive the butler or  the maid as being subservient, in  many ways they are subversive  without even knowing it.  Louis stares at him, never thought about his dad in this way.  INT. BLAIR HOUSE - RD WARNER’S OFFICE - DAY - 1966  Cecil sits across from the Chief Usher, RD Warner. Cecil is  nervous, gripping his sweaty palms.  RD WARNER  Come in, Cecil.  CECIL  Good afternoon, Mr. Warner. Thank  you for seeing me.  RD WARNER  What do you want?  CECIL  Since the colored...the black  staff...does just as much work as  the white staff, I believe that our  salaries should reflect our  service, sir.  RD WARNER  ‘Black’ staff?  CECIL  I also feel that we should have  opportunities of advancement. No  black houseman have ever been  promoted to the engineer’s office.  RD Warner stares at Cecil for a long beat. Then -  RD WARNER  You’re very well liked here, Cecil,  but if you’re unhappy with your  salary or position, than I suggest  you seek employment elsewhere.  CECIL  With all due respect",
      "dialogue_count": 0,
      "word_count": 825
    },
    {
      "scene_number": 12,
      "slugline": "INT. ND HOTEL - MEMPHIS - NIGHT  Louis and Carol sit alone in the room, as they watch news  footage of the riots and chaos.  TV ANCHOR  ‘The announcement of King’s death  has sparked riots in cities all  across the country.’  EXT. GAINES HOUSE - PORCH - NIGHT - 1968  Cecil walks up to his porch.   Gloria comes out to greet him  and they both stare at the fires that engulf Washington DC.  There is a deep sadness in their eyes as they watch their  city burn.  INT. GAINES HOUSE - LOUIS’ BEDROOM - LATE AFTERNOON - 1970  The room has been painted pink. Mannequin busts and fabrics  everywhere.   Gloria sits at her new sewing machine.   She  works diligently on a shirt for Cecil.  We hear a voice from the other side of the room.  VOICE O.S.  Ma? My room’s pink.  Gloria looks up to see Louis.   He sports an Afro and a thick  moustache. Wearing black pants, a black leather jacket and a  beret. He’s hardened.  Gloria stares at him, filled with emotions words cannot  describe.  INT. GAINES HOUSE - LIVING ROOM - NIGHT - 1970  The entire family is having dinner. Carol sits looking like a  female version of Louis clad in a black turtle neck and  ANGELA DAVIS AFRO.  Cecil is subdued. He clearly does not like his son’s new  look. Louis has a different energy, he’s edgier. Both he and  Carol exude an angry, aggressive quality.  GLORIA  Make sure you get some of my sweet  potatoes, Carol. I use orange juice  when I make ‘em. That what make ‘em  so tart.  75.  (MORE)",
      "characters": [],
      "action_text": "(to Louis)  How long ya’all been dating?  LOUIS  5 Years.   CAROL  We’re just friends.  Cecil stares at his son, and then at Carol. An awkward  moment. Charlie smirks. This dinner’s gonna be good.   Gloria  changes the subject.  GLORIA (CONT’D)  Is, uh, all the rest of the kids  getting involved in politics too?  LOUIS  There’s been a division, kind of a  split Ma. A few of them like John  Lewis are--  GLORIA  I always liked him.  Cecil looks surprised.  CECIL  How do you know who John Lewis is?  GLORIA  Because I read JET Magazine. I’m  not just sitting up there sewing  for you all day.  Carol takes a sip of grape soda. She BURPS.  CAROL  I’m getting sick and tired of  gettin’ thrown in jail.  CECIL  Yeah? Well that makes two of us,  don’t it?  Carol rolls her eyes. Gloria takes note.  LOUIS  Dr. King’s philosophy ultimately  got him murdered. It worked when we  started, but now it’s time to take  the next step, which is politics.  Charlie grins.  76.  GLORIA (CONT'D) CHARLIE  What, so y’all going to the White  House now? Dad, Louis going to the  White House. You know they ain’t  gonna let you in with them nipples  out. Maybe one, but not both of  them out.  Louis chuckles, only Charlie can make him smile these days.  LOUIS  Nah, we’re more grass roots, one on  one with the community. Although we  have started our own political  party.  Charlie sees that Louis is serious.  CHARLIE  (to Carol)  What’s your party? You like to  party? I like to party. What’s your  party called?  CAROL  The Black Panther Party.  Cecil looks at his son, confused.  CECIL  What kind of name is that? What  that stand for?  Carol is instantly edgy with him.  CAROL  We provide free breakfast for  children, free medical clinics,  free clothing and self defense  classes.  GLORIA  And why y’all need self defense?  LOUIS  We ain’t gettin’ beat no more.  This lands like a hammer. Cecil and Gloria look  uncomfortable, not sure what the implications are.  GLORIA  Me and your daddy saw a wonderful  ",
      "dialogue_count": 0,
      "word_count": 1455
    },
    {
      "scene_number": 13,
      "slugline": "INT. WHITE HOUSE - OVAL OFFICE - DAY - 1970  Cecil brings in tea for Nixon who is deep in conversation  with his advisors - BOB HALDEMAN, 44, crew cut, intense, and  JOHN EHRLICHMAN, 45, balding, boy scout face.  NIXON  I want to know every God damned  domestic policy decision right now  and I want it on the table right  now.  EHRLICHMAN  Did you get the memos we sent last  week?  HALDEMAN  John and I strongly agree that the  time calls for a period of benign--  A fly buzzes around Nixon’s head.  NIXON  There’s a God damned fly. A God  damned fly in here. Jesus fucking  Christ.  HALDEMAN  ...a period of benign neglect.  Cecil pours tea for Nixon.  NIXON  Benign neglect?  EHRLICHMAN  Yes.  NIXON  I like that. I like that.  INTER CUT WITH:  INT. BLACK PANTHER HEADQUARTERS - DAY - 1970  Ten BLACK PANTHERS, all in black jackets and berets, load  shotguns in a smoked filled room. The leader of this group  ELDRIDGE HUDGINS, 29, black, muscular, loads his shotgun.  ELDRIDGE HUDGINS  The pigs in the media describe us  as terrorists.  83.  (MORE)",
      "characters": [],
      "action_text": "A terrorist is one who terrorizes  and frightens others. We’re the  ones getting terrorized! How can we  exist in peace when we scared to  walk down the street to the store?!  INT. WHITE HOUSE - OVAL OFFICE - DAY - 1970  Cecil pours tea.  NIXON  Now there’s this whole black power  movement going on, right? What if  Nixon promotes black power to mean  black businesses, and we find ways  to support black entrepreneurs. We  pass the buck on desegregation to  the courts, but push black  enterprise to get the 20% that  could vote our way...  EHRLICHMAN  Excellent.  HALDEMAN  Excellent, sir.  INT. BLACK PANTHER HEADQUARTERS - DAY - 1970  ELDRIDGE HUDGINS  You don’t know if your ceiling gon’  cave in because your slumlord too  busy running around collecting rent  checks, but he won’t fix your roof.  It’s time that we take a stand  against these injustices that  plagued our community! They take  one of ours? We takin two of  theirs!  INT. WHITE HOUSE - OVAL OFFICE - DAY - 1970  EHRLICHMAN  We just need to make sure that  ‘Nixon’s black power’ doesn’t  equate Nixon with the Black  Panthers.  Cecil pauses for a slight beat.  84.  ELDRIDGE HUDGINS (CONT'D) NIXON  Have you lost your mind!? Did you  read Hoover’s last memo on that?!  EHRLICHMAN  That’s my point.  NIXON  It’s God damned terrifying. No no  no... I gave him the green light to  gut those sons of bitches...  Cecil tries not to show the terror on his face.  HALDEMAN  Absolutely.  NIXON  Round them all up and throw them  down a fuckin’ elevator shaft.  Cecil’s eyes shut in pain.  INT. BLACK PANTHER HEADQUARTERS - DAY - 1970  ELDRIDGE HUDGINS  I don’t proclaim to know  everything. But I promise you,  they’ll always beware of the nigger  with a gun.  A few people in the room laugh, but Louis is uncomfortable.  He looks around at the guns. The smoke. He doesn’t like it.  INT. WHITE HOUSE - OVAL OFFICE - DAY - 1970  Cecil turns to Nixon.  CECIL  Will there be anything else, Mr.  President?  Nixon is silent. Cecil walks out",
      "dialogue_count": 0,
      "word_count": 552
    },
    {
      "scene_number": 14,
      "slugline": "INT. BLACK PANTHER HEADQUARTERS - BACK ROOM - DAY - 1970  Louis is seated in another room, he looks deeply concerned,  doesn’t know what to do. Carol walks into the room and sits  next to him. She knows he’s torn.  LOUIS  What are we doing here? I thought  this was gonna be our community  service?  CAROL  This is community service.  LOUIS  Someone kills one of us, we kill  two of theirs?  CAROL  Community protection.  LOUIS  Are you willing to kill somebody,  Carol? Because I aint.  Carol looks at him, a pain and anger deep in her soul.  CAROL  I am.  LOUIS  Did you ever love me baby?  No response. The answer too painful to say.  Louis gets up and walks out of the room. He takes his beret  off as he exits, his Black Panther days are over.  EXT. OAKLAND STREET - DAY - 1970  Filled with sadness, but also resolve, Louis walks down the  block as we hear a newscast:  NEWSCAST V.O.  A Police raid killed at least 4  Black Panthers in Oakland,  California this week. Marking  another police victory against this  terrorist organization.  CUT TO - FULL SCREEN ARCHIVAL FOOTAGE - SOUL TRAIN A136   A136  Funky SOUL TRAIN DANCERS groove across the stage.  86.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 207
    },
    {
      "scene_number": 15,
      "slugline": "INT. GAINES HOUSE - LIVING ROOM - DAY - 1973  We pull back from a TV to see Gloria dancing to Soul Train  which plays on the television.  Cecil walks into his home. He sees Gloria dancing, she sports  an enormous curly Afro and looks incredible in a velvet bell  bottomed leisure suit. Cecil’s mood has perked.  GLORIA  Hi baby! Happy birthday to you!  CECIL  Well this is the present I want,  right here.  GLORIA  Well, you want it right here?  CECIL  Alright! Kids up? Kids down?  GLORIA  Ain’t no kids in the house no more!  Hey, I made you a birthday cake.  Gloria walks over to the counter and picks up the cake.  CECIL  (smiling)  I got all the cake I want right  here.  GLORIA  No... you don’t... Hey I got some  champagne, cooling in the ice box.  And some ice cream too! Get some  ice cream!  CECIL  You gonna be drinking with me?  GLORIA  You know I don’t drink. I don’t  drink.  CECIL  I was just playing with you. I was  just seeing if it worked. Go ahead.  Gloria dances.  CECIL (CONT’D)  Oh my God!  87.",
      "characters": [],
      "action_text": "Cecil heads to the kitchen and grabs a glass of champagne.  CECIL (CONT’D)  We get any mail from Charlie today?  GLORIA  No. I haven’t heard from Charlie. I  know I got an idea. I think we  should go to Shantay’s tonight.  CECIL  Ohhhhh no... No. I’m too old for  disco.  GLORIA  We not old! Come on! Our boys are  gone! Just you and me! You and me!  We are free- oh! I forgot this. I  forgot this. Now look at us.  Gloria picks up a present and gives it to Cecil.  GLORIA (CONT’D)  A little happy birthday present. I  want you to go put it on, upstairs.  CECIL  Put it on?!  GLORIA  Put it on, and make it snappy!  Bring down my sewing kit because I  need to do some alterations. Make  it snappy!  Gloria continues dancing, adjusting her hoop earrings in the  mirror. The phone RINGS, she answers:  GLORIA (CONT’D)  Hello.  (She whispers)  Hi. Where are you? Where?! You  should call me back because this is  not a good time. He’s here...  Gloria looks nervous. She does a double take upstairs making  sure Cecil is out of ear shot. Cecil comes down stairs  wearing the same velvet disco outfit as Gloria.  CECIL  They fit! We gonna be going out  tonight!  88. GLORIA  (whispers)  He’s home and...  CECIL  Who that?  GLORIA  Call me back...  CECIL  Oh it’s Louis. He’s asking for some  money?  Cecil grabs the phone from her.  CECIL (CONT’D)  (into phone)  Hey Louis. I wasn’t expecting to  hear from you on my birthday. You  should feel ashamed of yourself.  You’re a grown ass man and your  calling your mamma asking for  money.   Well guess what it’s the  butler’s money. It’s Uncle Tom’s  money. And he ain’t giving none out  today. Bye.  He hangs up the phone, pissed. Gloria sits down, pained by  his cold words to Louis.  Then the doorbell RINGS. Cecil answers the door.   Standing in  front of him are -  Two MILITARY OFFICERS. Their eyes are filled with pain and  grief. Cecil immediately knows Charlie is dead, but won’t  accept it.  CECIL (CONT’D)  You got the wrong house... It’s the  wr",
      "dialogue_count": 0,
      "word_count": 846
    },
    {
      "scene_number": 16,
      "slugline": "INT. WHITE HOUSE - HALLWAY - DAY - 1974  As Cecil walks out of the room, Holloway passes by him.  HOLLOWAY  Louis is here looking for you.  Cecil looks surprised.  INT. WHITE HOUSE - BUTLER’S KITCHENETTE - DAY - 1974  Cecil enters the locker room. Carter is in mid-conversation  with Louis. The TV plays a baseball game in the background.  We hear the announcer talk about Hank Aaron’s home run title.  LOUIS  I finished school. I got my masters  in political science.  CARTER  Hey! That’s what I’m talking about.  Get that education.  Carter and Louis stop when Cecil enters. Cecil places his tux  jacket with the dirty clothes. Cecil shakes his head and  waves him away.  CARTER (CONT’D)  There he is! Hey, well I’ma let you  all to it...  CECIL  (to Carter)  Ain’t no need for that, Carter.  Carter stands awkwardly. Cecil continues on with his dirty  clothes. He couldn’t care less.  LOUIS  (sincere)  Hey Dad.  CECIL  Get out of here Louis.  LOUIS  Dad?  CECIL  I said leave.  Carter can’t believe Cecil. Louis heads for the door.  91.",
      "characters": [],
      "action_text": "CARTER  Keep doing what you doing.  LOUIS  Thank you.  Louis leaves.  CARTER  (to Cecil)  Why you do that? Huh? That was  wrong. The boy’s hurtin’ too. You  know he’s just trying to get his  act together.  CECIL  He should be hurting Carter. Boy  didn’t even go to his own brother’s  funeral. He’s full of shit is what  he is. He aint doing nothing right.  CARTER  He just got his masters! What more  you want him to do?!  CECIL  Every grey hair I have is because  of that boy.  EXT. ARLINGTON NATIONAL CEMETERY - DUSK - 1986  Charlie’s grave has been well kept these past 10 years.  Cecil, stands looking at it.  CECIL V.O.  The years started to drift by, but  the pain in my heart never went  away. Through it all, Louis and I  never spoke.  INT. GAINES HOUSE - BEDROOM - DAY - TIME LAPSE 1974-1985  Cecil sits in a chair, watching the TV. We have a MONTAGE  that takes through the years - Gerald Ford, Jimmy Carter,  different TV shows, musical acts and news stories that bring  us to the 1980’s.  Cecil is still watching TV, he’s much older, and completely  bald. On the TV he sees a news report of Louis RUNNING FOR  CONGRESS. Cecil’s eye widen in amazement:  92. LOUIS  (On the TV)  In our district alone, we have 9%  unemployment. The country at large,  14%, are living below the poverty  line. 60% of those are Black or  Hispanic. By the time I’m voted  into Congress, the decrease in  those numbers is gonna be one of my  primary objectives...  INT. GAINES HOUSE - CECIL’S BEDROOM - NIGHT - 1985  From their new TV, Cecil continues to watch TV.   We pull back  to see Gloria and Cecil in bed. On the television is ELECTION  NIGHT news footage.  Cecil is on the phone. Gloria mutes the TV with the remote.  She anxiously waits for news. As Cecil’s eyes drop, so do  hers. He shakes his head, ‘no’, to her.  CECIL (INTO THE PHONE)  Thanks for getting back to me. How  much did he lose by? Really?  Alright then. I appreciate it.  He hangs up, turns sadly to his wife.  CECIL (CONT’D)  Nah, he ",
      "dialogue_count": 0,
      "word_count": 805
    },
    {
      "scene_number": 17,
      "slugline": "INT. WHITE HOUSE - RD WARNER’S OFFICE - DAY - 1986  Cecil stands across from the Chief Usher, RD Warner.  RD WARNER  Morning, Cecil.  CECIL  Morning, Mr. Warner. May I sit  down.  RD Warner’s stare says ‘no’. Cecil remains standing.  CECIL (CONT’D)  I’ve been here for almost thirty  years now, and for all that time,  the black help has been paid a  smaller salary than the white help.  And I just don’t think it’s right,  Mr. Warner. There are black  housemen who should be engineers by  now, they should’ve been promoted  years ago.  RD WARNER  You think so?  CECIL  I’m gonna have to be paid the same  as the white help or I’ma have to  move on.  Silence.  RD WARNER  I guess you’ll be moving on then.  CECIL  I told the President that you’d say  that. He told me to tell you to  take this up with him personally.  Cecil smiles his warm smile. RD Warner is livid.  CECIL (CONT’D)  Excuse me.  Cecil walks out of the room.  INT. HALLWAY - WHITE HOUSE - NIGHT - 1986  NANCY REAGAN, 61, sharp and savvy, walks down the hall toward  Cecil with Reagan’s Treasury Secretary, JAMES BAKER.  95.",
      "characters": [],
      "action_text": "NANCY  I’m not comfortable with all the  foreign policy hawks surrounding  Ronnie, we need more moderates on  his staff.   And I want a summit  with the Russians.   Ronnie needs to  meet with them face to face if we  really want to thaw this ice.  She passes Cecil, but then stops and turns around.  NANCY (CONT’D)  Cecil.  Cecil turns around with a smile.  CECIL  Yes, Mrs. Reagan?  NANCY  (to James)  We will talk.  CECIL  Yes ma’am?  Nancy glances at him with a sharp stare.  NANCY  You’re very popular around here.  Everyone says you’re the man that  got them raises and promotions. I  had no idea.  Cecil smiles with humility.  CECIL  I wish I could take credit for  that.  NANCY  I’d like to invite you to the State  Dinner next week.  CECIL  But I’m going to be there, Mrs.  Reagan.  NANCY  No, not as a butler, Cecil, I’m  inviting you as a guest.  Cecil is confused.  96. CECIL  But...the President prefers for me  to serve him personally.  NANCY  Don’t you worry about, Ronnie. I’ll  take care of that. So we’ll see you  next week? You and your wife.  CECIL  My wife?  NANCY  It’s... It’s Gloria, yes?  CECIL  Yes.  Nancy nods, then continues down the hall. Cecil watches her  go, stunned at the invitation.  INT. WHITE HOUSE - ENTRANCE HALL - DAY - 1986  Gloria and Cecil enter the entrance hall. Gloria looks around  in amazement, Cinderella at the ball. Amused, Cecil wanders  behind her.  CECIL  (to Gloria)  This is the Entrance Hall.  Holloway approaches them with a tray of champagne flutes.  HOLLOWAY  Can I get you a glass of champagne,  Mr. Gaines?  Cecil rolls his eyes.  CECIL  Shut up!  Holloway smirks. Then they hear:  LOUD SPEAKER  Ladies and Gentleman, the President  and First Lady of the United  States.  We hear ‘Hail to the Chief’ as Ronnie and Nancy walk down the  stairs with honor guards to great fanfare.  Gloria stares at Nancy in awe.  97.",
      "dialogue_count": 0,
      "word_count": 520
    },
    {
      "scene_number": 18,
      "slugline": "INT. WHITE HOUSE - STATE DINING ROOM - NIGHT - 1986  Cecil and Gloria are seated at separate tables. He looks  around at all of the butlers serving the room - carefully  setting dishes, refilling water. He looks uncomfortable.  CECIL V.O.  It was different sitting at the  table instead of serving it. Real  different. I could see the two  faces the butlers wore to survive  and I knew I lived my life with  those same two faces. Gloria looked  so happy, but I didn’t feel the  same way. I guess I wished we were  there for real instead of show.  Everyone gets ready to eat.  RONNIE  I think that’s Bon appetite  everybody.  Carter walks by to take a used utensil from Cecil.  CARTER  (whispering in Cecil’s  ear)  You a black motherfucker!  INT. WHITE HOUSE - OVAL OFFICE - DAY - 1986  Ronnie sits with PAT BUCHANAN, 47, jowly, the Communications  Director. They are across from Republican Senator NANCY  KASSEBAUM, 53, and a few other Republican Senators.  Cecil pours tea for Senator Kassebaum who smiles at him.  RONNIE  I want to make myself clear on this  issue. If Congress passes sanctions  against South Africa, I will be  forced to veto those sanctions.  Cecil stops pouring for a split second, then starts up again.  SENATOR KASSEBAUM  Well, Mr. President, we feel that  would be a major mistake. The  brutal repression of South African  black citizens is no longer just a  foreign policy issue, but a United  States racial issue.  98.",
      "characters": [],
      "action_text": "Cecil stands at the back, staring forward, it’s clear he’s  listening. Senator Kassebaum turns to Ronnie with urgency:  SENATOR KASSEBAUM (CONT’D)  We’re Senators from your own party.  That’s why we feel so comfortable  in letting you know that South  Africa is a human rights disaster.  Black people are being beaten,  tortured, gunned down in the middle  of the street. Americans see this  on TV, they’re horrified by  Apartheid.  Ronnie looks frustrated with the Senators.  RONNIE  I’ve made my decision.  Cecil can’t believe his ears.  SENATOR KASSEBAUM  Mr. President, your reputation as a  world leader is at stake. The  United States of America needs to  be on the right side of history on  the race issue.  Ronnie looks at them all with his iron will.  RONNIE  I’ll say it again. If Congress  passes this bill, I will veto it.  Period.  Pat Buchanan smiles at the Republican Senators who just sit  there and stare at Ronnie. Unbelievable.  Cecil stares at Ronnie too, disturbed on a deep level.  CUT TO - COTTON FIELDS - FLASHBACK - CECIL’S DREAM.  He’s a boy in the cotton fields with his father, playing in  the cotton.  CUT TO - THE HOUSE - FLASHBACK - CECIL’S DREAM  Thomas Westfall walks up to 15 year old Cecil who’s reading  on the porch.  99. THOMAS  What? You reading now? Get up and  do the dishes ‘fore I shoot you in  the head.  INT. GAINES HOUSE - BEDROOM - LATER - 1986  Cecil awakens.   Bothered by the State Dinner and Reagan’s  words. He can’t sleep. Restless, he leaves the bedroom.  CECIL V.O.  Nothing seemed right to me after  that State Dinner. I got all  confused.  INT. GAINES HOUSE - LOUIS’ BEDROOM - EARLY MORNING - 1986  Cecil has not slept. But he’s not tired. He’s going through  Louis’ boxes. He looks at his baseball trophies and studies  his various awards. He sees the faded flier:   MAMIE TILL,  MOTHER OF EMMET TILL, SPEAKS OUT!  Then he sees a copy of the civil rights book: ‘RACE, REFORM  AND REBELLION’. He thumbs through it, looks at the pictures  and f",
      "dialogue_count": 0,
      "word_count": 957
    },
    {
      "scene_number": 19,
      "slugline": "INT. WHITE HOUSE - BEDROOM - DAY - 1986  Ronnie looks surprised as he talks to Cecil.  RONNIE  Are you sure about this?  Cecil nods.  CECIL  Yes sir. I just want to be the one  who tell you first, that’s all.  RONNIE  You’re the best butler here. You  are like family, Cecil.  CECIL  It’s been an honor serving you.  RONNIE  Not just for me, I’m sure I speak  for all the Presidents when I say  that you’ve served your country  well.  Cecil humbly grins.  CECIL  Thank you, Mr. President.  Cecil gives a slight bow, then walks to the door to leave.  RONNIE  Cecil?  Cecil turns around to see Reagan looking troubled, there is  clearly something on his mind.  CECIL  Yes, Mr. President?  Reagan pauses, this is tough for him to ask. He motions to  newspapers on his desk with headlines about apartheid.  RONNIE  This whole civil rights issue... I  sometimes fear I’m on the wrong  side of it... that I’m just wrong.  Cecil stares at him, this hits him on a deep level.  102.",
      "characters": [],
      "action_text": "CECIL  Sometimes I think I’m just scared  of what it really means. But I’m  trying to not be so scared anymore.  EXT. SOUTH AFRICAN EMBASSY - DAY - 1986  Hundreds of protestors are outside the South African Embassy  with signs ‘Freedom in South Africa’ and ‘End Apartheid’.  Louis is at the front talking to the crowd.  LOUIS  Who do we want to free?  ALL  Mandela!  LOUIS  When do we want him free?  ALL  Now!  LOUIS  Twenty years ago we marched in this  country for our rights, today we  march to free the people of South  Africa. Ronald Reagan has attacked  or dismantled every civil rights  program that has ever been put in  to place. Aiding the oppression of  black South Africans is absolutely  consistent with his policies on  race issues. Am I right? Am I  right? Am I rig--  Louis stops talking as he sees Cecil watching him from across  the street. Louis is stunned. His father smiles nervously. He  looks frail.  LOUIS (CONT’D)  Excuse me. Steven? Where’s Steven.  Free Mandela Y’all!  Louis hands off the bullhorn to STEVEN and walks up to Cecil.  The two of them stare at each other for a long beat. It’s  been so many years.  LOUIS (CONT’D)  Hi, dad.  CECIL  Hi, Louis.  103. LOUIS  What are you doing here?  CECIL  I’m here to protest with you.  Louis is moved speechless. After what seems like an eternity:  LOUIS  You’ll get arrested dad. You’ll  lose your job.  Cecil looks to the ground.   Mustering up the strength to say:  CECIL  I’ve lost you.  A tear forms in Louis’ eye. Cecil smiles.  CECIL (CONT’D)  I’m sorry...  Through tears, Louis wraps his arms around his dad in a huge  hug. This time he’s the one that doesn’t want to let go.  CECIL (CONT’D)  I’m sorry...  INT. JAIL CELL - DAY - 1986  Cecil and Louis sit side by side in a holding cell crammed  with 20 other protestors. Louis is concerned for his father.  LOUIS  Don’t worry, dad, we’ll be out of  here in a few hours.  CECIL  Who said I was worried?  We PULL BACK on father and son in jail together.  CECIL V.O.  ",
      "dialogue_count": 0,
      "word_count": 1207
    },
    {
      "scene_number": 20,
      "slugline": "INT. GAINES HOUSE - LIVING ROOM - NIGHT - 2008  Cecil sits on his couch watching election night results:  ANDERSON COOPER  “And CNN can now project that  Barack Obama, 47 years old, will  become the President-Elect of the  United States.”  A picture of BARACK OBAMA appears on the screen. Cecil and  Louis stare at it, absolutely stunned. Then Louis walks over  to his father and puts his arms around him.  CUT TO - FULL SCREEN - ARCHIVAL NEWS FOOTAGE:  President-elect Barack Obama makes a speech to the crowd on  election night.  BARACK OBAMA  “If there is anyone out there who  still doubts that America is a  place where all things are  possible; who still wonders if the  dream of our founders is alive in  our time; who still questions the  power of our democracy, tonight is  your answer.”  Cecil and Louis watch the speech, still holding each other.  Then Cecil begins to cry.  INT. GAINES HOUSE - BEDROOM - CURRENT DAY - 2009  Standing in front of a mirror, Cecil wears Kennedy’s tie that  Jackie gave him as he puts on the LBJ tie clip.   He then  grabs his father’s pocket watch.  INT. WHITE HOUSE - ENTRANCE HALL - DAY - 2009  Cecil sits in the Entrance Hall of the White House. He looks  around - everything is exactly as he remembers. He whispers  to himself.  CECIL  Look them in the eye, see what it  is they want, see what it is they  need, anticipate, bring a smile to  the principal’s eyes...  The new Chief Usher, ADMIRAL STEPHEN ROCHON, black, walks up  to him.  108.",
      "characters": [],
      "action_text": "ADMIRAL ROCHON  Mr. Gaines, I’m Admiral Rochon the  Chief Usher.  Cecil looks surprised that he’s a black man.  CECIL  It’s nice to meet you, Admiral.  ADMIRAL ROCHON  The pleasure’s all mine. I just  wanted to tell you what an honor it  is to meet you, sir.  Cecil looks pleased. The two start to walk down the hall.  CECIL  The honor is mine.  ADMIRAL ROCHON  The President so excited to meet  with you.  CECIL  Well that’s just fine.  Admiral Rochon gestures toward the State Dining Room.  ADMIRAL ROCHON  Let me show you the way.  Cecil gives him a look, then tells him:  CECIL  I know the way.  Cecil walks alone down that long hallway toward the State  Dining Room. As he passes the official portraits of the  Presidents we hear their iconic voices:  JFK V.O.  The heart of the question is  whether all Americans are to be  afforded equal rights and equal  opportunities.  He walks past the portrait of LBJ.  LBJ V.O.  It is the effort of American Negros  to secure for themselves the full  blessings of American life.  109. As Cecil turns the corner to meet the first black President  we hear his famous speech:  BARACK OBAMA V.O.  We will respond with that timeless  creed that sums up the spirit of a  people: Yes we can!  FADE TO BLACK.  THE END  110.",
      "dialogue_count": 0,
      "word_count": 488
    }
  ]
}