{
  "slug": "life-itself-2018",
  "title": "life itself",
  "genre": "drama",
  "format": "film",
  "scenes_count": 13,
  "characters_count": 0,
  "characters": [],
  "total_words": 20036,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. STARBUCKS - MORNING Our REAL HERO is writing the bizarre screenplay we’ve been watching.  Note: it’s the Good Samaritan from the accident.  A real NARRATOR (female) takes over: NARRATOR (V.O.) (O.S.) Will Dempsey was thirty-one years old when he finally gave up on his Sam Jackson unreliable narrator screenplay. (beat) He’d been working on it since 7:30 AM. Will looks up at the clock.   It’s 7:47 AM. Will closes the computer, stands, heads to the counter. A way-too-chipper FEMALE BARISTA greets him. BARISTA Top of the morning to you, good Sir!   What can I get for you!? WILL Double espresso, large cup. BARISTA And would you care for anything to eat? WILL A fuck you? BARISTA I’m sorry? WILL (big smile) I said “no thank you.” BARISTA (confused) Oh, okay, right. WILL (”thank you so much”) Fuck you so much. She looks up, confused.   Did she just hear that again?  6.",
      "characters": [],
      "action_text": "But Will is just smiling big at her. She gives up, takes his cash. NARRATOR (V.O.) (O.S.) Will was not well.   But you don’t need me to tell you that. Will stands in the waiting area.   Out of nowhere, he starts SINGING.   Loudly.   People stare. He’s singing Bob Dylan’s   Standing in the Doorway.  WILL (doing Dylan)  I’m walking through, the summer nights/The jukebox, playing low. Yesterday everything, was going too fast/Today it’s moving too slow...  VOICE (O.S.) (calling out) Will!? Will jolts to a stop.   A SECOND BARISTA is holding out his now-ready coffee.   Will approaches. SECOND BARISTA Double espresso, large cup? WILL Yeppers. Will takes the large cup.   Opens the lid. From his back pocket he takes out a small glass BOTTLE OF WHISKEY and pours the whole thing into the cup. He does a long pour.   Announces it: WILL (CONT’D) (loudly) I’m doing a long pour. Everyone in the Starbucks is now watching him. Will reaches into his pocket, takes out a PILL BOTTLE.   He removes a pill, downs it, turns back to the barista. WILL (CONT’D) Want one? SECOND BARISTA No thanks.  7. WILL It’s Xanax. SECOND BARISTA Still no. WILL Boo humbug. SECOND BARISTA (correcting) Bah humbug. WILL That’s what she said. SECOND BARISTA Huh? Will SHRUGS, starts singing another verse: WILL  I got no way left to turn/I got nothing left to burn...  (then) It’s Dylan, people!   Standing in the Doorway !   Third track on   Time out of Mind.   His comeback album. The whole thing’s like a giant fucking Keats poem. (a beat, then) Give it a chance, it’ll grow on you. A STARBUCKS MANAGER approaches. MANAGER Sir? WILL Oh man.   Are you gonna make me leave?   Bah humbug. Will gives a proud thumbs up to the second barista (”nailed it.”) CUE SONG: Bob Dylan’s   Standing in the Doorway.  SLOW MOTION ACTION   as the manager and other Starbucks employees push/carry Will out of the store... Just before he’s out the door, Will yells:  8. WILL (CONT’D) I’m telling you: give it a chance, it will grow on you! Fr",
      "dialogue_count": 0,
      "word_count": 3442
    },
    {
      "scene_number": 2,
      "slugline": "INT. THERAPIST’S OFFICE - DAY Back to present-day/messed-up Will in therapy with Dr. Morris. WILL Abby was in the car.   She was seven. DR. MORRIS Okay. A beat. WILL “Okay” feels like a strange response to that new information. Dr. Morris smiles. DR. MORRIS I was caught off guard. (then) You don’t talk about Abby a lot. WILL You don’t ask about her a lot. DR. MORRIS I ask about her constantly. WILL Tomato, potato. DR. MORRIS (correcting) Tomato, tom-ah-to. WILL Let’s call the whole thing off. DR. MORRIS Your sessions with me are mandated, Will. WILL No, I meant... “tomato, tom-ah-to, let’s call the whole thing off.” DR. MORRIS I’m not following. A beat.  27.",
      "characters": [],
      "action_text": "WILL My God, this is some kind of rhythm we have, huh, Doc?   Maybe this is why I can’t jerk off to you. A really awkward beat. WILL (CONT’D) (apologetic) That was way inappropriate. (explaining) I was institutionalized. DR. MORRIS Why don’t you tell me about Abby, Will?   I’d like to know more about her. WILL Well, then you’ve come to the right place, Doc.   I am the world’s foremost expert on all things Abby. (beat, then) Or I was, I guess. (then) No, I still am, I mean it’s not like someone else learned more about her in the past six months. (then) I mean someone could have, I’ve been locked up and God only knows what she’s been up to wherever she is-- DR. MORRIS Will. WILL Right.   Let me tell you about Abby. INT. DELIVERY ROOM - DAY (THIRTY YEARS AGO) ABBY’S MOM gives birth.   Her FATHER cheers her on.   Will becomes our third narrator (so far)... WILL (V.O.) Abby Lesher was born on June 30th, 1985.   The legend goes that when she was born, she didn’t make a peep. The baby comes out.   The doctor prods it.   Nothing.  28. WILL (V.O) For five minutes, little Abby just sat there, taking in the world. Not so much as a single cry. The baby just sits there, contented. WILL (V.O.) In the years to come, her parents would always say that there was nothing wrong with baby Abby.   She just didn’t have anything to say yet. PRESENT DAY WILL steps into frame with Dr. Morris (the scene participants don’t “see” them). WILL Now keep in mind, I’m getting all this second hand.   I never met any of the people here except Abby. DR. MORRIS Understood. WILL Her parents die.   Pretty soon. Long before I come into the picture. DR. MORRIS No, I know. WILL And it’s not like I know any of these doctors or nurses, why would I? DR. MORRIS Let’s move along, Will. WILL Okay. INT. ABBY’S HOME - YEARS LATER An adorable FIVE-YEAR-OLD ABBY dances in the living room. Her parents sit on a couch, watching and laughing. WILL (V.O) By all accounts, Abby’s early childhood was a happy one.  29. ON HER ",
      "dialogue_count": 0,
      "word_count": 881
    },
    {
      "scene_number": 3,
      "slugline": "INT. THERAPIST’S OFFICE - DAY (PRESENT) Will stares ahead, thinking. WILL Her parents died instantly.   Abby was trapped in the backseat of the car with them for over an hour until they got her out.   Her father... (beat, then) Her father was decapitated by the steering column. A loaded beat. WILL (CONT’D) I know, right!?   That’s always the detail that gets people.   I mean the story in and of itself is tragic, of course, but when you give someone that image - that singular image of a seven year old girl trapped in a car with her decapitated father - then it all really just lands, doesn’t it? (then, chipper) Anyhoo... you asked about Abby so I’ll continue, but be forewarned, her next decade isn’t so great. More SNAPSHOTS from the past.   We start with little Abby (fresh off car accident) in a police station. WILL (V.O.) Abby’s parents didn’t plan on dying together.   So there was no will, and no plan for Abby.   Seeing as all her grandparents were deceased, Abby’s Uncle Joe was given custody. Uncle Joe wasn’t a nice man.   And when I say that, I don’t mean he didn’t hug her.   I mean he bought her a puppy and then killed it when it chewed up his couch.   I mean he sporadically molested her for the better part of six years until at fifteen years old she borrowed a gun from a wannabe gangbanger at her school, put it to her Uncle Joe’s head, and told him in no uncertain terms that... Fifteen-year-old Abby tells her uncle...  32.",
      "characters": [],
      "action_text": "FIFTEEN-YEAR-OLD ABBY I will fucking kill you if you ever touch me again. She lowers the gun... WILL (V.O.) Then she shot him in the knee so he knew she wasn’t playing. She does.   Uncle Joe howls in pain. INT. THERAPIST’S OFFICE - CONTINUOUS Will smiles. WILL Like a movie, right?   I always pictured a young Natalie Portman playing her. DR. MORRIS I don’t know who that is. WILL You don’t know who Natalie Portman is!?   Doc, you gotta get out more. DR. MORRIS I’m sure you’re right, Will. WILL Tell you what, you come over one night, we’ll marathon young Natalie Portman:   “The Professional,”  “ Beautiful Girls,” you’ll understand. DR. MORRIS Please continue, Will. Will SHRUGS. WILL Things got better from there. More SNAPSHOTS from Abby’s past. WILL (O.S.) (CONT’D) Obviously damage had been done. Decapitated father, molesting uncle, you don’t just bounce back from that.   But Abby was smart. (MORE)  33. Determined.   A dreamer.   A reader. She hunkered down, got herself into college, started seeing a therapist on campus who truly changed her life, and even made a really close friend... INT. LIBRARY - EVENING YOUNG ABBY (20) sits in a library studying. Across a few tables, YOUNG WILL throws candy at her.   They starts silently food fighting. Once again, PRESENT DAY WILL steps into frame with Dr. Morris. WILL Look, Doc, it’s me!   This is what I looked like at twenty-one. (then, realizing) Holy shit, my hairline has really receded, hasn’t it? He examines his twenty-one-year old self (who, unaware, continues food fighting with Abby). WILL (CONT’D) Look how much lower my hairline was back then.   Fuck me. DR. MORRIS I think you look very much the same. WILL And I think I look like a different person. DR. MORRIS Tomato-tomahto. Will smiles. WILL Look at us, Doc, look at us.   Maybe we have a chance after all. (then) Anyhow... Will leads Dr. Morris out of the library and through... WILL (O.S.) (CONT’D)  34.",
      "dialogue_count": 0,
      "word_count": 590
    },
    {
      "scene_number": 4,
      "slugline": "EXT. CAMPUS - CONTINUOUS Where we see college-Abby everywhere... playing intermural soccer, reading on the lawn, making out with Will, etc. Will and Dr. Morris walk through these scenes, one after another. WILL Abby came into her own in college. She engaged with the world, became extremely popular, even fell in love (not to toot my own horn but  toot too t).   She graduated top of her class with an English Lit degree, wrote her thesis on... ABBY (PRE-LAP) Will!   Will! Suddenly we are in... INT. FRAT PARTY - NIGHT THREE FRAT BOY IDIOTS hold Will upside down, readying him to chug from a keg. Young Abby rushes over toward Will, nonplussed by the fact that he’s upside down over a keg. ABBY The unreliable narrator! WILL Huh? ABBY (mile-a-minute) My thesis!   Unreliable narrators are considered a “device,” right? Don’t answer, they are.   They don’t get a lot of literary analysis because it’s a gimmick, a trick. I mean yeah,   Canterbury Tales   gets a shout out for having one, but usually it’s the stuff of popcorn crime novels and thriller movies. Agatha Christie,   Usual Suspects , so on and so forth.   But I’m going to argue that by definition,   any  narrator is unreliable. (MORE)  35.",
      "characters": [],
      "action_text": "Because when someone is telling a story, there is always a distance from the actual story to their  telling   of the story.   Therefore,  any   story that has EVER been told has an unreliable narrator.   The only truly reliable narrator would be someone hypothetically telling a story as it happens before our eyes, which is obviously impossible.   And what does that mean? (deep breath) It means that the only truly reliable narrator is life itself. But life itself, by it’s very nature, is an unreliable narrator, too - because it is constantly misdirecting us, misleading us, taking us on a journey where it’s literally impossible to predict what is going to happen next. That’s my thesis: life as the ultimate unreliable narrator. (then) What do you think? WILL I think-- ABBY It’ll make more sense when I write it.   Love you!   Bye! She races off. Will’s friends stuff the spout back in his mouth as he watches her race off. He’s literally upside-down, in love. BACK TO: INT. THERAPIST’S OFFICE - CONTINUOUS Will sits, lost in thought.   He looks up at Dr. Morris. WILL Hey, before, when I invited you over to watch Natalie Portman movies, you know I was just being funny, right? ABBY (CONT'D)  36. DR. MORRIS I do. WILL Because I’m still married.   At least I think I am.   I haven’t signed any papers or anything yet. Don’t know how this works. DR. MORRIS It’s fine, Will. WILL Okay. A long beat. DR. MORRIS Tell me about your marriage? WILL You want me to tell you about my marriage? DR. MORRIS I do. WILL Then you haven’t been listening. It doesn’t matter what I tell you, Doc. His eyes suddenly well with tears. INT. BEDROOM - 6 MONTHS EARLIER We’re back where we first saw Will and Abby together, in bed six months earlier, talking about Bob Dylan. WILL (V.O.) I could tell you all about our marriage.   I could tell you every detail of that morning she left me. We pick up mid-scene (we’ve seen this already). ABBY I’m in a phase, Baby.   C’mon, lean into this with me.   It’s Dylan’s co",
      "dialogue_count": 0,
      "word_count": 2928
    },
    {
      "scene_number": 5,
      "slugline": "INT. DYLAN’S BEDROOM - LATER Dylan comes home, begins tearing the Bob Dylan posters off of her wall. NARRATOR (V.O.) Her mother gets hit by a bus.   Her father commits suicide.   Her grandmother dies of cancer. (then) But it was the death of a mini goldendoodle that ended Dylan Dempsey’s childhood. Dylan turns, looks into lens again. As she does, and as our narrator continues, Dylan slowly - ever so slowly - MORPHS in front of our eyes from an INNOCENT NINE-YEAR-OLD GIRL to a TEENAGER. NARRATOR (V.O.) 2025 to 2033: the Dylan Dempsey Transformation Years.   The years brought puberty.   Puberty brought sexuality.   Sexuality brought anger.   And fear.   And confusion. And when the smoke cleared - where that sweet little girl once stood - there remained only a teenager who scared the absolute shit out of everyone. Dylan turns back to lens, revealing a fully evolved 18-YEAR- OLD DYLAN DEMPSEY. She is a knockout, in a dangerous, way-too-sexy way. She begins throwing stuff in a BACKPACK.  KNOCK KNOCK.  Irwin stands at the door again, aged ten years himself.   He’s thinner.   Older. He may have cut out that red meat, but not the whiskey. He’s holding his ubiquitous glass of it. IRWIN Hey. She doesn’t even turn around.  51.",
      "characters": [],
      "action_text": "DYLAN I’m heading out. IRWIN With who? She grabs a pack of cigarettes from a drawer. IRWIN (CONT’D) You’re not even going to try and hide those from me? DYLAN Aren’t we both better than that? He shrugs in agreement. IRWIN (re: cigarettes) You hear Vermont’s made them illegal? DYLAN Remind me never to go to Vermont. A beat. IRWIN (”little boy”) Can I have one? DYLAN No. IRWIN Just one? DYLAN No, these things will kill you. She pops a cigarette in her mouth.   Irwin cringes at the sight. IRWIN I was hoping we could talk about college. DYLAN We talked about it last night. IRWIN We didn’t get very far.  52. DYLAN Yes we did.   We just didn’t get where you wanted. A beat. IRWIN Promise to be home by eleven? DYLAN I’d rather not lie to you. IRWIN Lie to me. DYLAN I’ll be home by eleven. She walks past him.   He grabs her arm, turns her. IRWIN Dylan. He looks at her.   He looks old, tired. She softens, ever so slightly. IRWIN (CONT’D) Happy eighteenth, Kiddo. He holds out his whiskey glass, as he once did to that adorable little girl. She rolls her eyes, but - after a moment - gives in and CLINKS an imaginary glass against his. At the same time, they both sip and... IRWIN/DYLAN Ahhhhhh. Irwin touches her cheek. And suddenly we see it: sweet innocent Dylan is still in there, somewhere... Then she takes Irwin’s real whiskey glass and downs it in one gulp. DYLAN Peace. She winks, EXITS.  53.",
      "dialogue_count": 0,
      "word_count": 469
    },
    {
      "scene_number": 6,
      "slugline": "INT. CAR - LATER Dylan sits in the backseat of a small SUV. THREE YOUNG MEN (two up front, one in back) sit in the car with them.   Everyone is smoking. In the back of the SUV we see music equipment (instruments, amps, etc.).  It is important to remember: it is 2033 now.   All around us we notice the changes in costume, in vehicles, in technology. Not a paradigm shift by any means - no flying cars - but it’s all part of the landscape.  DRIVER So I say to her - your friend looks lonely.   Why don’t the three of us get to know one another-- As the other bandmates “male bond,” Dylan looks out the window of the car. ON STREET They are passing the very intersection where Dylan’s mother Abby - exactly eighteen years earlier - was struck by that bus. ON DYLAN As the car comes to a stop at a traffic light.   Right at the spot. Dylan lowers the window and sticks her head (and her entire top half of her body, really) out of the car. She hovers over the very spot where her mother died. As the light turns green, Dylan flicks her cigarette out the window... Onto that exact spot. CUT TO: INT. BAR - LATER Dylan is mid-performance, the lead singer for the band. SIGNAGE announces her band’s name:   PB&J.  54.",
      "characters": [],
      "action_text": "Note: their music is the popular underground music of 2032: a violent, electronica-based form of rock ‘n’ roll.  Watching Dylan screaming and flailing on stage is jarring, to say the least. But she’s also a star performer.   Captivating.   Raw. The most damaged people always make for our greatest artists. The song finishes.   The sparse audience CHEERS. Dylan grabs a MUG OF BEER from a nearby ledge and quietly speaks to the crowd, commanding their attention: DYLAN Our last song is kinda personal. My mom died eighteen years ago today, and-- DRUNK Take it off! DYLAN (explosive) FUCK YOU! Dylan calms herself, takes a sip of her beer, continues: DYLAN (CONT’D) They tell me she used to listen to-- DRUNK   #2 Show us your tits!!! Dylan THROWS her mug out at the kid.   It shatters in the distance. Dylan gives up on “context,” simply announces: DYLAN This is our last song. Dylan steps over toward a nearby keyboard, begins playing. Softly she starts singing, beautifully. It’s   To Make You Feel My Love   by Bob Dylan... unplugged.  55. DYLAN (CONT’D) (singing)  When the rain is blowing in your face/and the whole world is on your case/I could offer you a warm embrace/to make you feel my love...  And with that: The band explodes. Suddenly this becomes a violent/thrashing version of the one commercial love song on Bob Dylan’s otherwise perfectly bleak album. Dylan is simply on fire: screaming, stalking the stage, letting out as many of the ghosts that haunt her as possible. CUT TO: INT. BACKSTAGE ROOM - LATER Dylan gives a blowjob to the drummer of the band. If it was hard to watch Will and Abby’s only daughter smoke cigarettes, this is worse. Way worse. Adding to the horror, is the fact that HANGERS-ON and other band members are watching this. Laughing.   Pointing. A NEARBY GIRL is even video-ing the oral sex on her phone. Finally Dylan stands, the act completed. Without missing a beat she grabs the phone from the video- taping girl and SMASHES it. And like that... Dylan calml",
      "dialogue_count": 0,
      "word_count": 4209
    },
    {
      "scene_number": 7,
      "slugline": "EXT. THEATRE - CONTINUOUS Isabel, smiling, approaches Javier. NARRATOR (V.O.) Isabel’s very average life had played out in the very average fashion that everyone had forecasted for her. (then) Until Javier came along. She arrives at Javier.   He hands her the rose.  JAVIER You were amazing tonight. ISABEL Amazing, you say? I was amazing serving tapas and having my ass grabbed by drunks? JAVIER The best I’ve ever seen.  She LAUGHS. NARRATOR (V.O.) Javier had worked hard to undo Isabel’s programming.   Slowly, he believed, she was starting to see that she was special enough to deserve a special life, even if it was to be a simple one.  JAVIER I want to show you something.  EXT. OLIVE GROVE - LATER We push (high speed) through olive trees until we land on... A group of shelters and sheds known, collectively, as a CORTIJO. These are the structures on a farm ( finca ) which house laborers, livestock, mills, etc. The largest building is a two-story structure, the residence for a SENORITO (Javier’s new position). He now stands in front of this charming two-story home, showing it off to Isabel:  75.",
      "characters": [],
      "action_text": "ISABEL  (stunned)  You will live here?   All of this is yours? JAVIER No, Bonita.   Ours.   I would like it to be ours.  She looks at him, surprised.  JAVIER (CONT’D) I can make a life for us now.   I will not be a rich man, but I will be a good one.   I have devoted myself to you since the moment I first saw you, but now I would like to make it official.   Isabel-- ISABEL Yes.  Javier stops.  ISABEL (CONT’D) I answer yes.   Yes to everything.  Javier smiles, grabs her.  CUE: a CANTE JONDO SONG .   Cante Jondo translates as “deep song” - a weighty style of Andulucian Flamenco.   It’s basically the Flamenco blues. There is a staccato vocal driving the song that feels like euphoric celebration one moment, desperate sadness the next. It feels like life. CUT TO: INT. MAIN ROOM - LATER Javier and Isabel dance. As they do, the camera circles them - leaving one of them, picking up the other, over and over again. As the camera circles...   years pass.  Facial hair changes for Javier each time we return to him. Hairstyles for Isabel each time we return to her. Eventually, Isabel becomes pregnant.  76. They keep dancing, her belly growing larger and larger. Eventually, there’s a baby held between them (little Rodrigo). As we continue to circle, and they continue to dance, Rodrigo grows to four years old (the age we first met him at). Throughout this (from outside the large bay window behind them), we sometimes catch MR. SACCIONE, watching them dance. Usually he looks on with a smile, happy for the sweet young lovers. But occasionally, there’s a glint of something different in his eye.   Is it jealousy?   Is he coveting Isabel?   Their love?   Their new son? It’s probably nothing. But if it’s nothing, why does the Flamenco music always sound a little more ominous when the camera finds him? CUT TO: INT. JAVIER & ISABEL’S HOME - MORNING Isabel makes coffee on a small wood-burning stove. She looks towards the small kitchen table where: Mr. Saccione plays with little Rodrigo (4). ",
      "dialogue_count": 0,
      "word_count": 1395
    },
    {
      "scene_number": 8,
      "slugline": "INT. KITCHEN - DAY Javier and Isabel fight.   Angrily. The stress of their unwell child is taking a toll. INT. SCHOOL - DAY Rodrigo (now 6) gets in a fight on the playground with another LITTLE BOY. INT. KITCHEN - DAY Javier and Isabel fight again.   In a heated moment, Javier punches the wall next to Isabel’s head. He recoils at himself. She runs off.   He grabs a BOTTLE and starts drinking. INT. RODRIGO’S BEDROOM - NIGHT Rodrigo, in bed, SCREAMS again... startling himself awake. He has wet the bed, per usual. INT. JAVIER & ISABEL ’S BEDROOM - CONTINUOUS Isabel and Javier lie in bed.   They hear Rodrigo’s SCREAM from the next room and Isabel STANDS to go to him. Clearly this has become routine. She stops at the bedroom door.  ISABEL He is not getting better, Javier. JAVIER I know.  This hangs there.  ISABEL He doesn’t talk about it.   I try but... he can’t.   Or he won’t. JAVIER It was just one moment.   How can one moment just... (MORE)  82.",
      "characters": [],
      "action_text": "(then, convincing himself)  He was so little.   Soon he’ll forget.   Yes, he will get better, Bonita.   I know this.  But Javier’s eyes betray him.  ISABEL We need to get him help. JAVIER We took him to all the doctors-- ISABEL He needs specialists.   In Madrid. The doctors the rich people would go to. JAVIER We are not rich people.  Isabel looks at Javier.   He suddenly gets what she’s asking.  ISABEL He is our son, Javier.   He is our little boy and he is in pain.  Javier looks at his beautiful wife.   She’s pleading with her eyes.   He nods.  JAVIER Okay. ISABEL If you want, I will ask hi-- JAVIER (sharply) No.   (then, loving) No, Bonita.   I must.  INT. MR. SACCIONE’S FARMHOUSE - MORNING Mr. Saccione sits at his desk.  JAVIER (O.S.) Excuse me, Sir?  Mr. Saccione looks up in surprise. As Javier begins to speak, uncomfortable...  JAVIER (CONT'D)  83. NARRATOR (V.O.) The things we do for our children are often the worst things we do to ourselves. INT. MEDICAL FACILITY - DAY Rodrigo works in a room with a THERAPIST.   He draws pictures, plays with toys, etc. ON THE OTHER SIDE OF THE VIEWING WINDOW: Mr. Saccione, Isabel, and Javier watch. NARRATOR (V.O.) Money cannot buy happiness.   Good health, however, is sometimes very much for sale.   And Mr. Saccione spared no expense when it came to helping little Rodrigo Gonzales. CUT TO: INT. THERAPIST’S OFFICE - LATER The Therapist talks to Mr. Saccione and Isabel. Javier is there, of course, but his body language indicates that he’s become a mere support figure. NARRATOR (V.O.) The diagnosis was, as expected, textbook: clinical early childhood trauma at an age when Rodrigo’s still developing brain had been particularly at risk. The Therapist continues talking.   Mr. Saccione asks the bulk of the questions.   Javier blinks, trying to understand. NARRATOR (V.O.) It would take time, but it was treatable.   In therapist speak, Rodrigo would need to learn to create a coherent narrative about what happened that day.   Being abl",
      "dialogue_count": 0,
      "word_count": 707
    },
    {
      "scene_number": 9,
      "slugline": "INT. KITCHEN - CONTINUOUS Javier sits at the table, drinking alone again. NARRATOR (V.O.) Or some might argue, time was simply healing the wound. INT. MR. SACCIONE’S FARMHOUSE - CONTINUOUS Rodrigo (now 9) sits at Mr. Saccione’s desk, writing a letter (in English) under Mr. Saccione’s watchful eye: RODRIGO (O.S.)  Dear Dylan.   My name is Rodrigo Gonzales, but I like to be called Rod.   I am from Spain.   My uncle presented me--  MR. SACCIONE (correcting) Gave me. RODRIGO (O.S)  --gave me your address to write you a letter.  CUT TO: INT. IRWIN DEMPSEY’S BROWNSTONE (NEW YORK) - DAY Irwin (Dylan’s whiskey drinking grandfather, remember him?) walks in the front door of his New York brownstone. He is holding THE LETTER amidst other mail. Rodrigo’s voice covers the following: RODRIGO (V.O.)  I was there the day you were born. I was on the bus.  INT. IRWIN’S KITCHEN - DAY Irwin and Linda (Dylan’s grandmother) read the letter at the kitchen table.  86.",
      "characters": [],
      "action_text": "RODRIGO (V.O.)  I wonder about you every day. Actually, I wonder about you every minute.   I hope you are okay and that you are happy.  INT. DYLAN DEMPSEY’S BEDROOM - DAY Linda reads the letter to Dylan (age six). RODRIGO (V.O.)  I was sad for a long time but my uncle got me a bird which helps. If you are sad maybe you can get a bird.   Please write me back?   I really hope very much that you are okay.   Love, Rod.  CUT TO: INT. DYLAN’S BEDROOM - LATER Now Dylan writes back the letter we saw her writing when we first met her at six years old (after Will’s suicide). We hear her little voice through the following: DYLAN (O.S.)  Dear Rod.   I got your letter and it was very nice.  EXT. OLIVE GROVE - DAY Mr. Saccione runs through the olive grove like a giddy madman. He’s holding Dylan’s LETTER in his hand. DYLAN (V.O.)  You spell really good my Nana says, and you seem like a very nice boy she says too.  Men (working in the field) watch Mr. Saccione run, confused. Javier is amongst them.  87.",
      "dialogue_count": 0,
      "word_count": 352
    },
    {
      "scene_number": 10,
      "slugline": "INT. JAVIER & ISABEL’S HOME - CONTINUOUS Mr. Saccione bursts into the house.   Isabel and Rodrigo turn. He holds up the letter, excitedly. DYLAN (V.O.)  I think you are lucky that you have a bird.   I have a dog.   He is my best friend.  Mr. Saccione hands Rodrigo the letter.   Rodrigo slowly opens it, reads. DYLAN (V.O.)  Do you like pizza?   I mainly like pizza and dogs.   But dogs more.  From, Dylan Dempsey. (then) P.S. - I’m okay.   Thank you for asking.  Rodrigo looks up from the letter, dazed.   Tears well in his eyes.  RODRIGO (realizing) She’s okay.  And in that moment, we can see that Rodrigo is going to be okay, too. He walks over to his mother, repeats:  RODRIGO (CONT’D) She’s okay.  Isabel nods.   Rodrigo hugs his mother and he starts crying. This makes his mother cry, too. Mr. Saccione watches, moved. Rodrigo turns to Mr. Saccione and motions for him to join them. Mr. Saccione hesitates, then does. As they group hug, Mr. Saccione and Isabel share a charged look. OUTSIDE THE BAY WINDOW: Javier watches his family from the spot where Mr. Saccione once stood.  88.",
      "characters": [],
      "action_text": "Literally on the outside, looking in. INT. MR. SACCIONE’S FARMHOUSE - DAYS LATER Mr. Saccione sits at his desk, writing.  JAVIER (O.S.) Do you love her?  Mr. Saccione stops writing.   He doesn’t even turn around.  MR. SACCIONE Yes. JAVIER And Rodrig-- MR. SACCIONE Yes.  Mr. Saccione finally turns to face his accuser.  MR. SACCIONE (CONT’D) I had pure intentions.   You may not believe me, but... (then) Loneliness creates weakness, Javier.   I am not proud. JAVIER But your father certainly would be. You’ve turned out to be your father’s son after all, Sir.  For Mr. Saccione, this cuts deeply. He stands, approaches Javier.   Mr. Saccione looks him dead in the eye, determined.  MR. SACCIONE I give you my word: I will stay away from them.   Your son is healing, he doesn’t need me anymore.   They are your family, Javier.   Not mine.  He walks back to his desk and sits.   But then:  JAVIER (O.S.) No.  89. Mr. Saccione looks up, as confused as we are. CUT TO: INT. JAVIER’S KITCHEN - NIGHT Javier sits at the kitchen table, sipping from a bottle. Isabel enters the room, in a nightgown.  ISABEL Why have you not come to bed?  She notices a SUITCASE next to Javier.  ISABEL (CONT’D) What is this? JAVIER This is goodbye, Bonita.  Isabel looks confused.  ISABEL Where are you going?  Javier stands, approaches her.  JAVIER I see the way you look at him.   And he at you.  Isabel raises a brow.  ISABEL Javier, you are drunk and you are jealous-- JAVIER I see what he has done for our son-- ISABEL He helped him get better-- JAVIER --things I could not do-- ISABEL You did nothing, Javier!  This hangs there.  90. ISABEL (CONT’D)  No?   You disagree?   Were you looking for answers at the bottom of those bottles?  Javier stands.  JAVIER I’ve taken a job up North.   I will send you all the money.   Though I suspect soon, you will not need it--  SLAP! Isabel slaps him across the face. JAVIER (CONT’D) Bonit-- SLAP! Again.  ISABEL So you just gift me to him?   After all we’ve been through togeth",
      "dialogue_count": 0,
      "word_count": 1747
    },
    {
      "scene_number": 11,
      "slugline": "INT. HOSPITAL - LATER Isabel receives chemo. NARRATOR (V.O.) But not always. She looks awful.   Mr. Saccione looks on, confused. This isn’t how it is supposed to go. INT. BEDROOM - LATER Rodrigo tends to his mother, wetting her lips with water. INT. FARMHOUSE - LATER Rodrigo (now sporting a mustache) and Mr. Saccione play chess in silence. Waiting for something to change. EXT. OLIVE GROVE - LATER Rodrigo (now with a young man’s sparse beard) picks olives the same way his father once did... by hand, into a bucket. All around him, men use the more typical (and faster) techniques involving rakes and nets. IN THE DISTANCE Mr. Saccione watches Rodrigo.   He smiles sadly.   For many reasons. INT. FARMHOUSE - LATER Rodrigo reads by the fire.   Mr. Saccione steps into the room. MR. SACCIONE Your mother asks for you. INT. BEDROOM - LATER Rodrigo stops at the door, looks in at his mother. What we see is shocking:  99.",
      "characters": [],
      "action_text": "Isabel has been ravaged by cancer.   Bald.   Almost unrecognizable. She motions for Rodrigo to come closer.   He does.   She speaks quietly.  ISABEL It has been two years, Hijo.   I do not get better.   Vincent spends enough so I do not get worse.   I just... survive.   And you just wait.   It is enough. RODRIGO Mama-- ISABEL  (lovingly)  It is enough, Hijo.  (then)  Listen to me, come here.  She pulls him toward her.   She starts talking, very softly. We do not translate this.   We do not need to.   She is telling him to leave her. And as the mother releases the son from his duty... the son cries. He cries because what she says is powerful and because he knows she is right. It is time for Rodrigo Gonzales to start his life. INT. NYU CLASSROOM - DAY Rodrigo sits in a class, taking notes. NARRATOR (V.O.) Rodrigo entered NYU a twenty-one- year-old freshman.   And as he’d been doing for most of the previous decade, he thrived. EXT. FIELD - DAY A cross-country track meet. Rodrigo bursts from the woods, running in a full sprint.   He flies past camera.  100. It takes ten seconds for anyone else to even emerge from the woods. NARRATOR (V.O.) He lettered in two sports. INT. CLASSROOM - DAY Rodrigo gives a presentation. NARRATOR (V.O.) His marks were at the very top of his class. INT. DORM ROOM - EVENING Rodrigo fools around with an attractive girl. NARRATOR (V.O.) He even embarked on a relationship with a nineteen-year-old Jewish American Princess from Long Island named Shari Dickstein.   She made him laugh.   Usually not intentionally. Shari breaks from their kiss. SHARI Oh my gawd, I totally forgot to tell you, I was at Whole Foods, and Rina Rothman was there - such a pig - anyway-- As Shari continues (and Rodrigo suppresses a laugh): NARRATOR (V.O.) She wasn’t his great love, but she was company, and great love wasn’t his priority at the moment. INT. AIRPLANE - NIGHT Rodrigo sits in economy class, sleeping. NARRATOR (V.O.) He saved every dollar, coveted every vacation. ",
      "dialogue_count": 0,
      "word_count": 521
    },
    {
      "scene_number": 12,
      "slugline": "INT. BEDROOM - MORNING Rodrigo sits by the bedside of his mother, entertaining her. Mr. Saccione sits on the other side of the bed.  RODRIGO She’s from a place called Long Island.   Her name is Shari Dickstein...  He shows a picture from his phone.  ISABEL But what is she like, Hijo?   Tell me.  Rodrigo thinks for a beat, then:  RODRIGO She’s loud.  Isabel and Mr. Saccione explode LAUGHING. NARRATOR (V.O.) Like so many of the biggest years of our lives, it flew by.   But in truth, that year was just a setup - a preamble to the biggest   day   of Rodrigo Gonzales’ life: March 31st, 2032.  CHYRON: MARCH 31st, 2032.  INT. DORM ROOM - MORNING Rodrigo lies next to Shari.   He’s awake. She’s asleep, snoring.   He watches her, thinking. He stands, starts dressing. Shari stirs. SHARI Where you going? RODRIGO Just going for a quick run. A beat. SHARI  Bonita.  102.",
      "characters": [],
      "action_text": "RODRIGO Huh? SHARI When we started dating you called me “Bonita.”   You would have said: “Just going for a quick run,  Bonita .” (then) It always made me feel like Kelly Ripa. A loaded beat, then: RODRIGO Shari-- SHARI I’m pregnant. Fuck.   Rodrigo’s world spins like a top. Shari sits up, starts dressing. SHARI (CONT’D) I know.   Lots to talk about, obvi. Hey - will you take me for brunch? There’s this place I want to try, it’s Vietnamese, I’m assuming that’s like Dim Sum or something but I’m dying to try it. Rodrigo just stands there, speechless. SHARI (CONT’D) We can talk at brunch.   At the Vietnamese place.   I really want to try it. EXT. NEW YORK CITY STREET - LATER Rodrigo and Shari walk down the city street. Shari talks a mile a minute.   Rodrigo just stares, lost. SHARI So I just started feeling shitty a few weeks ago.   I thought I was just getting a really bad period, ever since I got off the pill I’ve been getting bananas periods, you know?   (MORE)  103. But it wasn’t stopping so I went to my gyno and he was like “are you sexually active” and I told him about you and then he did the test thing and blammo.   I hadn’t even thought to   try   an at-home test, for whatever reason my brain didn’t go there what-so-fucking-ever. Beat.   Rodrigo just stares.   She continues, nonplussed. SHARI (CONT’D) Anyways, I know we haven’t been together very long and clearly this is as what-the-fuck as you get.   I don’t really know what your deal is with religious stuff, but I think I should probably just get an abortion. She turns back to him. SHARI (CONT’D) Are you like super against that? Abortion? Shari has stopped out in the street, looking back at Rodrigo. Rodrigo, still speechless, looks to her right. A TAXI is speeding down the side street right at her. SHARI (CONT’D) I know abortion’s a big thing for Christians - you’re Christian I assu-- At the last second, Rodrigo grabs her arm and pulls her back to safety. The CABBIE blares on his horn.   Shari barely notices. ",
      "dialogue_count": 0,
      "word_count": 544
    },
    {
      "scene_number": 13,
      "slugline": "INT. VIETNAMESE RESTAURANT - LATER Shari eats noodles sloppily. SHARI So the way I see it, we have like three options... She SLURPS.   Rodrigo’s brain explodes with each slurp. SHARI (CONT’D) Option One: we have it.   I mean, a mixed race baby with our skin complexions would be amazeballs. My family has batshit money, we could get nannies and stuff, I don’t know, probably a bad idea. SLURP.   Brain explosion. SHARI (CONT’D) Option Two: abort.   But again, I’d like to make that call sooner than later before the thing has a head and stuff. SLURP.   Brain explosion. SHARI (CONT’D) Or Option Three: we can just agree this is all an insane APRIL FOOL’S JOKE!!!! A long beat of silence. RODRIGO (confused) What? SHARI April Fool’s, Bitch! RODRIGO What is that? SHARI Seriously?   You don’t know April Fool’s? Rodrigo stares blankly at her.  105.",
      "characters": [],
      "action_text": "SHARI (CONT’D) On the first day of April you play practical jokes on people and yell April Fool’s! RODRIGO But it’s March 31st. SHARI I thought you’d see it coming if I did it on April Fool’s Day. RODRIGO I didn’t even know what April Fool’s Day was. SHARI Well I didn’t know that. Rodrigo processes. RODRIGO So there’s no baby? SHARI Dude, no!   Oh c’mon, that was funny!   You have to admit, that was funny. Rodrigo puts down his napkin.   Breathes deeply. RODRIGO Shari-- SHARI Oh fuck, you’re going to break up with me aren’t you? NARRATOR (V.O.) He was. As we watch Rodrigo do the deed... NARRATOR (V.O.) Obviously nothing thus far had indicated that March 31st would be the most important day of Rodrigo’s life.   The entire day - as so many of life’s days are - had been a misdirect.   A fake out. Literally... Shari is hysterical.  106. SHARI IT WAS JUST AN APRIL FOOL’S JOKE!!! CUT TO: EXT. FARMHOUSE (SEVILLE) - DAY We take in the familiar farmhouse. NARRATOR (V.O.) No, sometimes the most important days of our lives begin, and we’re not even there to see it. INT. FARMHOUSE (SEVILLE) - DAY A nurse cares for Isabel.   Mr. Saccione helps the nurse.   The room is filled with a quiet desperation. Isabel Gonzales is dying. MR. SACCIONE I must call Rodrigo. Isabel shakes her head. MR. SACCIONE (CONT’D) (pleading) Isabel. ISABEL (weakly) Let him be young for one more day. He will come after. MR. SACCIONE Isabel-- ISABEL No.   Not like this. Isabel touches Mr. Saccione’s arm.   He looks at her for a long, silent beat. ISABEL (CONT’D) You are a good man, Vincent. MR. SACCIONE No, I--  107. ISABEL You are. (then, again) You are. He’s emotional now. They sit there like that for quite a while, just looking at one another, saying a silent goodbye. A silent thank you. And then:  VOICE (O.S.) Hello, Isabel.  They look up. Standing at the doorway is Javier, Rodrigo’s father.   He has aged 13 years since we last saw him. He looks to Mr. Saccione, nods. NARRATOR (V.O.) All of life’s surpr",
      "dialogue_count": 0,
      "word_count": 2251
    }
  ]
}