{
  "slug": "lights-out-2016",
  "title": "lights out",
  "genre": "drama",
  "format": "film",
  "scenes_count": 7,
  "characters_count": 0,
  "characters": [],
  "total_words": 19313,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. PARKING GARAGE - NIGHT When the sliding doors open for Paul, a sodium-vapor lamp awakens, saturating the structure in a dirty amber tint. This garage isn’t a typical parking building. Someone tried to make it look “arty” with its concrete pilings, turning sharp corners into rounded ends, and elongating support beams in logarithmic curves. But at night, the effect is eerie: It looks like you’re inside the ribcage of an enormous Giger-esque monster. Paul’s Toyota sedan is one of maybe three cars still parked at this hour, a hundred feet from the doors. Paul marches for it, keys in one hand, phone in the other. It is a long and tense walk. Paul keeps looking around for signs of other people. His footsteps echo in the cavernous space. Paul gets to the Toyota, unlocking it with his key fob. Behind him, the sodium-vapor security light goes out, drenching the garage in darkness. Paul opens the driver’s door, grateful for the car’s interior light which casts a downward glow on the area around it. He hears something: The sound of the building doors sliding. Paul turns around, unnerved, because the amber security lamp did not wink on this time. At the glass doors to the mall: THE SILHOUETTE. PAUL Who’s there? Silence. Paul leans in, the Toyota squeaking from the weight of his body. He grabs a flashlight from his glovebox and stands up again at the door. His fight-or-flight feelings battle his stubborn need to not be bullied or pranked. He clicks on the flashlight’s bright, narrow beam. Shines it right at the silhouette-- And it’s GONE. Like the light erased it from existence.  6.",
      "characters": [],
      "action_text": "Paul frowns. Confused. Bordering on panic. He lowers the beam of light, shining it on his feet-- And the silhouette has returned. Thirty feet closer. Paul lifts the light again. Directing it at the shadow-form. Again: Just light and garage wall in the distance. Beat. Paul lowers the flashlight beam-- And the silhouette is A DOZEN FEET AWAY. Paul jumps-- emits a partial curse word, and brings that light beam up reflexively. Protectively. Once again, nothing. But now, he hears it. Feet scuffling on the ground. Hurrying in some direction. Paul sweeps the beam left and right, in search of it. Nothing. Then: a slight sound behind him. The Toyota squeaking as something leans against it. Paul looks down. A shadow is cast from the car’s interior light: Something is standing right behind him. Paul starts to whirl around but-- The flashlight shines in our eyes as some hint of a HAND grabs his wrist and-- Another dark-as-ink CLAWED HAND reaches around and covers his mouth and-- THE FLASHLIGHT crashes to the ground, breaking. WIDE ANGLE Darkness. Then the sodium-vapor lamp awakens again, revealing Paul’s mangled body on the ground by his car. CUT TO: MAIN TITLES: A montage of photographs -- family photos, vacation snapshots, candids from different times around the world.  7. In each of them, somewhere, is a vague, humanoid SHADOW. Unattached to any of the people. Sometimes it’s almost a smudge on the photo. In many, it’s distinct; lurking. CUT TO: A POSTER-SIZED ILLUSTRATION Malicious shadows cover a terrified, gorgeous woman trapped in a tomb. PULLING BACK to reveal it’s the cover art for a DEATH METAL album of some Scandinavian band. Somewhere, heavy metal MUSIC plays on low volume. WE’RE IN: INT. BEDROOM - NIGHT More posters of metal bands, artwork from cult comic books. Crappy furniture. A single bed with disheveled sheets, currently occupied by a young COUPLE: REBECCA (20s) and BRET (20s) share a cigarette, staring at the ceiling. Her dark lipstick is smeared, smudges of i",
      "dialogue_count": 0,
      "word_count": 1421
    },
    {
      "scene_number": 2,
      "slugline": "INT. LIVING ROOM - NIGHT Grinning like a girl in love, Rebecca saunters back into this room and crosses the fireplace, leaning down to turn up the music in here. SLOWLY PUSHING IN on a photo gathering dust on the mantle: A much younger Sophie, and a 12-year-old REBECCA together. Snapped in mid-laugh, Sophie surprised by her daughter. No sign of Paul or Martin here. THE PHOTO FILLS THE FRAME-- And then a shadow passes over it, and suddenly it’s not as dusty as it was-- PULLING BACK to reveal-- WE’RE IN: INT. SOPHIE’S LIVING ROOM - NIGHT Another mantle, this one littered with framed photos. Next to the identical photo of Sophie and Rebecca: that photo of Paul, Sophie, and Martin seen earlier on his computer. The collection showcases Martin most of all, but little Rebecca is there quite a lot, too. And then there’s PAUL. Center-stage on the mantle. A handsome portrait... Next to his framed OBITUARY, dated two weeks earlier. INT. MARTIN’S ROOM - NIGHT Martin sits up in bed, still under the covers. He listens. He stares at his bedroom door. It hangs open a crack. He can hear murmured conversation, as if someone is on the phone down the hall. Martin makes a face -- his struggle to be brave plays out in his body language -- and then he hops out of bed.  13.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 231
    },
    {
      "scene_number": 3,
      "slugline": "INT. UPSTAIRS HALLWAY - CONTINUOUS Martin steps into the hall and travels past the upstairs bathroom to another door at the far end. The master bedroom. Half-closed. Martin can hear his mother’s voice in the room. MARTIN (small) Mommy? Martin pushes the door open... revealing... INT. SOPHIE’S BEDROOM A nest of clothes, empty glasses and stray plateware. This is a hoarder’s room. In one corner, the light from the master bathroom offers a crease of light into this otherwise dreary, dark space. In the other corner, SOPHIE stands at the open doorway to the master closet, in profile, muttering to herself. She looks worse than in those photos. The manic is full-blown here. Her hair frazzled. Her nails chewed. SOPHIE I just don’t know what to do about it. And I’m sorry. I really am. MARTIN Mommy? Sophie turns to face Martin, surprised by him. SOPHIE Yes, Martin? MARTIN (beat) Are you okay? SOPHIE I will be. Just not there yet. Did we wake you? Martin tenses at that pluralization. MARTIN What?  14.",
      "characters": [],
      "action_text": "SOPHIE Go back to bed, sweetie. Only ones wandering the halls at this hour should be grown-ups. Sophie stares tiredly at her son. Gives him a slight nod -- “Go on, now.” Martin turns around, takes two steps back for his room... SOPHIE (O.S.) (CONT’D) (sotto) I know. But he means well. Martin looks back, over his shoulder. Sophie’s returned to looking into the closet... Where a SHADOW SLIDES along the door -- could it be cast by Sophie herself? -- And then some floorboard CREAKS inside the closet. Martin’s breath catches. His nostrils flare. He hurries back down the hall, for his door-- INT. MARTIN’S ROOM - CONTINUOUS --rushing in and shutting the door behind him. Locking it. Climbing into bed. Tense, expectant, he stares at his door. Beat. Nothing happens. Martin begins to calm down. CLICK. The hall light goes out. Martin holds his breath. From down the hall: the SOUND of bare feet thumping on the hardwood floor, with the added CLICKING of long nails. Right up to Martin’s bedroom door. Martin grips his blanket like a Spartan’s shield. A tense beat. Quiet. MARTIN ...Mommy?  15. SCRATCHING on the door. Like a cat. THE DOORKNOB jiggles. From way farther down the hall, deep in Sophie’s room: SOPHIE (O.S.) You want a kiss goodnight? Martin’s reply is swift and loud: MARTIN NO. THE DOORKNOB stops jiggling. But there is no sound of receding footsteps. Martin slowly sinks under the covers, looking up at his nightstand lamp. THE BULB burns steadily. HANGING on that bulb, PRESSING IN... did it weaken? Did it just flicker? ON MARTIN, settling in for another sleepless night... INT. SOPHIE’S LIVING ROOM - DAY The land-line phone RINGS. One of those old-fashioned, loud bell tones. No one answers. PULLING BACK, sunlight pierces through the window. Wide open. It’s the next day. The phone stops RINGING. A beat later-- Sophie enters from the garage, carrying a shopping bag. She moves to the big bay window in the living room... And pulls out a heavy fabric from the bag. She bought som",
      "dialogue_count": 0,
      "word_count": 3592
    },
    {
      "scene_number": 4,
      "slugline": "INT. REBECCA’S LIVING ROOM - MORNING Rebecca opens the front door to reveal the figure is EMMA. And she looks sternly at Rebecca. REBECCA Hey. EMMA Did you take Martin? REBECCA What? MARTIN (O.S.) Who is it? Emma pushes past Rebecca, into the apartment. EMMA You can’t do this. MOMENTS LATER Emma sits on the couch, Rebecca paces. REBECCA She’s unstable. It’s not a safe environment for him. For anyone. EMMA Where is he? REBECCA Getting dressed for school. Emma looks to the closed bedroom door, then speaks directly but in a slightly low voice to prevent Martin overhearing. EMMA Think about what you want to do. REBECCA I did. I brought him here. EMMA I’m not talking about some kneejerk reaction. He can’t stay here. REBECCA Sure he can.  34.",
      "characters": [],
      "action_text": "EMMA Not without-- Rebecca, come on. You know why I’m here? She called me. REBECCA So Child Services takes orders from nutjobs now? She’s on triazolam and beta blockers for a reason. Emma stands up like she’s taking the pulpit. EMMA I went there, I stopped by in person to make sure she was lucid, and she was, but you know what? That’s not how this works. REBECCA Why the hell not? EMMA Sophie is his birth mother. His legal guardian. To get Martin from her custody requires you to file charges against her. Take her to court. That’s a long, painful process, and that’s only the first half. To keep Martin from being placed into foster care, you’d need to prove yourself and your home as an appropriate surrogate. (beat) So that’s two major choices for you to make: Declaring war on your mother, and transforming into a responsible guardian for him. Are you ready to do that? Rebecca blinks. She didn’t expect that truth slapped at her this early. REBECCA I can be a responsible guardian. Emma answers by looking past Rebecca, and then around the room, taking it all in. More HEAVY METAL POSTERS. Some with provocative illustrated women. A book on the coffee table about tattoo artists. And finally, a plastic bong on the bookshelf. Emma doesn’t say a word. She doesn’t have to.  35.",
      "dialogue_count": 0,
      "word_count": 361
    },
    {
      "scene_number": 5,
      "slugline": "EXT. REBECCA’S FRONT STOOP - MORNING Emma takes Martin by the hand to her car. Martin looks back at Rebecca who stands at her doorway. He waves at her. MARTIN It’s okay. I got some sleep. I’ll do better tonight. Rebecca waves and smiles wanly. But honestly, the little boy is breaking her heart. INT. REBECCA’S BEDROOM - MOMENTS LATER Rebecca shuffles in, hand over her eyes. Her body language screams, “What the hell am I doing.” She bends down to pick up a t-shirt of hers on the floor. When she does, she freezes. Her attention is riveted to something on the floor... A STICK FIGURE IN A DRESS has been carved into the hardwood flooring, with a name scrawled beneath it:  D I A N A  Rebecca shudders. Crouches down and traces one of the letters with her finger. It’s triggering some memory; her gaze wanders off the floor and up, as if she starts to see it in the same room-- All the while darkness encroaches around her, until-- INT. REBECCA’S CHILDHOOD BEDROOM - NIGHT (FLASHBACK) A young REBECCA (age 10) sleeps in her bed. From somewhere in the room, a nightlight casts a wan glow over her. Then... with a brief BUZZ, the nightlight winks OUT. STAYING ON REBECCA who stirs in her sleep, some part of her aware that the light has changed. A door creaks open. Rustling sounds. Like a rat in a cupboard.  36.",
      "characters": [],
      "action_text": "This wakes Rebecca. She blinks. Sits up. Her bedroom CLOSET DOORS hang open. Inside: pitch black. All is quiet. Then: the rustling continues. A bit clearer now: Paper is involved. Someone handling paper. Coming from the closet. Rebecca gets gooseflesh and her heart rate skyrockets. She reaches over to her nightstand to turn on her lamp-- But the lamp is GONE. A place for a lamp is there, even a footprint on the surface, but it’s not there now. Rebecca turns back to face the closet with renewed fear. There, at the base, on its side: the lamp. Nostrils flaring, Rebecca slips out of the bed. YOUNG REBECCA Mom...? Is that you? Beat. The rustling pauses. WOMAN’S VOICE Sweetheart. Rebecca frowns. Takes a tentative step for the closet. YOUNG REBECCA What are you doing? No answer. Scratching on paper. Then: WOMAN’S VOICE Your mother is going to be fine. Rebecca takes two more steps. The closet interior is a black hole in the wall. WOMAN’S VOICE (CONT’D) I’m here now. Rebecca quickly reaches out and flicks on the closet light-- The closet LIGHTS UP to reveal-- NO ONE INSIDE, but something FALLS from midair--  37. An old sketch pad. And a black crayon. The crayon rolls to Rebecca’s bare foot. Rebecca looks around, utterly terrified there’s no one there. THE SKETCH PAD lies open to an old drawing. A stick-figure trio. Mommy, Daddy, Me. Daddy has been crossed through. And in the same black crayon, a new figure has been added:  D I A N A  Young Rebecca stares down in shock-- INT. REBECCA’S BEDROOM - BACK TO SCENE Present-day Rebecca stares down at the same handwriting carved into her floor. She grabs her phone. Still distracted by the carving, she brings up her voicemail. On speaker, she plays an old message. VOICEMAIL (V.O.) Saved message. Thirty-two days old. BEEP. Then Paul’s voice: PAUL (V.O.) Rebecca. This is your step-father. You know I wouldn’t be calling if it weren’t serious. I just... It involves your mother. Call me? BEEP. Rebecca never called. But she has a grim idea",
      "dialogue_count": 0,
      "word_count": 6289
    },
    {
      "scene_number": 6,
      "slugline": "INT. UPSTAIRS BATHROOM - MOMENTS LATER Rebecca turns on the light and immediately goes to the medicine cabinet. Flings it open, digs around the shelves, checking bottles, getting more and more frustrated-- REBECCA C’mon, c’mon... Finally she exhausts the selection of OTC and prescription bottles in the cabinet and looks around the bathroom in desperation. Her attention is drawn to the small trash bin, by the toilet. Rebecca reaches in and pulls out a narrow pill bottle. Empty. She reads the prescription on the side, and-- REBECCA (CONT’D) (sotto) Shit... The bottle is missing its white lid. Overhead, the bathroom light begins to FLICKER and BUZZ. Rebecca keeps the pill bottle and backs out of the room, suddenly nervous, as if she were being watched. INT. MARTIN’S ROOM - NIGHT Rebecca joins Martin under the covers. Puts a hand on Martin’s shoulder so he knows she’s there. The bedside lamp is on, plus two large candles on the nightstands on either side of the bed. She closes her eyes. Martin is still awake. MARTIN (beat) Rebecca? REBECCA Hmm? MARTIN Did you find her vitamins? REBECCA No. But we’ll figure something out.  69.",
      "characters": [],
      "action_text": "MARTIN You think so? Rebecca opens her eyes. Stares at the ceiling. REBECCA Heliotherapy works, too. We’ll get her out in the sun tomorrow. Go to the beach, maybe. MARTIN That sounds nice... REBECCA (softer) Get some sleep. He closes his eyes, but she lingers on that last question. PRESSING IN on Rebecca, as she drifts to sleep... INT. MARTIN’S ROOM - NIGHT Only a night-light on the far wall sheds light in the room now. And the decor is different; girly. Dolls and pink. In the bed is YOUNG REBECCA, maybe eight years old, huddled under the covers. She’s been crying. She stares at: A PHOTO of her father VICTOR standing with her, holding a pair of fishing rods. Father and daughter out playing. CLOSE ON REBECCA, breaking out of her memory when she hears the CLICKING OF TOENAILS on the hardwood floor. She holds her breath. Terrified. The mattress sinks under the weight of something new. PUSHING IN CLOSER on Rebecca’s face, as... Black HAIR descends near Rebecca’s ear -- that’s all we see of Diana, but then: DIANA’S VOICE  Be my friend...  It’s a gravelly version of the voice we heard on the micro- cassette recording. Young Rebecca is too scared to scream. As if in a nightmare.  70. And with that, Diana starts to CRAWL INTO BED WITH REBECCA, pulling the covers on the far side of the bed. Rebecca closes her eyes even tighter than before and opens her mouth to scream -- INT. MARTIN’S ROOM - NIGHT And Rebecca wakes with a start. Sits up. It was just a nightmare. Or a memory. Before it was Martin’s room it was hers, and she’s back again. Martin sleeps soundly next to her. Rebecca calms down. Somewhere in the bowels of the house -- a distant CLAP. And immediately after, the power goes out. Only the two candles burn in Martin’s room. REBECCA (sotto) Shit... Rebecca grabs a commercial-grade flashlight from her side of the bed, clicks it on, and slips out. INT. SOPHIE’S LIVING ROOM - MOMENTS LATER Rebecca descends the stairs and enters the room, saying in a stage-whisper: REBECCA",
      "dialogue_count": 0,
      "word_count": 3961
    },
    {
      "scene_number": 7,
      "slugline": "EXT. RESIDENTIAL STREET - NIGHT An LAPD squad car comes tearing down the street. As it approaches, half a block before Sophie’s house, the sirens are shut off, and it runs only with the lights. Tailing the squad car: Bret’s SUV. The cops pull to the curb outside Sophie’s house. Bret’s SUV skids to a halt, nearly rear-ending the squad car. Bret climbs out, leaving his headlights on. He still looks bloody, his shirt stained with it. Someone attempted to bandage his neck but it’s clear he left before they could finish the job. Now that he’s back, Bret doesn’t take his eyes off the house. Two LAPD OFFICERS get out of the squad car. One male, one female. Both cool, calm, and collected. The male is OFFICER FORM; 30s, tall, African-American. The female is OFFICER GOMEZ; early 30s, muscular, two stripes on her uniform indicate she’s the senior officer. Bret’s already pointing and talking-- BRET She’s in there, my girlfriend and her family-- OFFICER GOMEZ Sir, please return to your car, you need to get to the hospital-- BRET Listen to me, you need flashlights. OFFICER FORM Get back in your car, sir. Said loudly. Bret backs up. But notices he’s not quite in the light of his SUV’s beams, and takes a side-step into them. The two Officers approach the house. Its front door remains partly open. Officer Gomez speaks into her shoulder radio handset:  89.",
      "characters": [],
      "action_text": "OFFICER GOMEZ Unit eighty-one, we’re at the Marigold house, power grid is out. Over. Officer Form looks back at his partner when they get to the door, then gets his flashlight out and knocks on the door. OFFICER FORM LAPD. Anyone home? The door opens from his knocking. He shines the light into the living room. Overturned furniture from the attack on Bret gives the place the look of a war zone. OFFICER FORM (CONT’D) (louder) Hello? REBECCA (O.S.) (muffled) Help! The Officers hear that. They go inside. INT. DOWNSTAIRS HALL - MOMENTS LATER The Officers reach the hall with the door to the basement. OFFICER GOMEZ LAPD, we’re responding to a domestic disturbance? REBECCA (O.S.) In here! Officer Form springs into action and kicks the door. It doesn’t give on the first kick, so he goes again-- OFFICER GOMEZ (into radio) Unit eighty-one, possible fire at residence, alert LAFD-- BOOM! The door is kicked in. Officer Form shines the light down the stairs at-- Rebecca and Martin, who remain in the corner, Rebecca still holding her gardening spade.  90. A thin veil of smoke displaced from the stove hangs in the room, creeping out into the hall. Like a residual fog. OFFICER FORM You okay? DOWN THE HALL, Diana’s silhouette appears. Gomez notices. Puts a hand on her partner’s shoulder-- Form sees her-- OFFICER FORM (CONT’D) Ma’am? He shines the light down the hall-- but Diana is gone. Officer Form draws his sidearm and advances down the hall with the flashlight before him. Officer Gomez stays at the door where she can keep sight of her partner and call down to Rebecca-- OFFICER GOMEZ Can you move? Rebecca grabs Martin and moves up the stairs, saying: REBECCA Keep the light on us! INT. SOPHIE’S BEDROOM - THAT MOMENT Sophie gets up, a trickle of blood marking a path on her head from where she was thrown. She sets upon the door to the hall, determined. It’s lodged, somehow. Can’t open. So she starts bashing the door with whatever she can find. SOPHIE Diana! You hurt my children and we ",
      "dialogue_count": 0,
      "word_count": 3458
    }
  ]
}