{
  "slug": "lion-2016",
  "title": "lion",
  "genre": "drama",
  "format": "film",
  "scenes_count": 19,
  "characters_count": 0,
  "characters": [],
  "total_words": 24752,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. ALLEY BEHIND ONE-ROOM HOME - MOMENTS LATER (NIGHT)  Guddu wrestles his rickety bicycle from its hiding place. SAROO (O.S.) How long this time? Guddu turns to see Saroo standing there. GUDDU You did good today, Saroo. SAROO I want to come with you. How long? GUDDU A week. You have to mind Shekila. SAROO Kallu will be back. GUDDU You’re too little to carry sacks. It’s very hard work. SAROO I can carry anything! Guddu smiles, amused.   Really?  With great effort, Saroo lifts up the bicycle, holds it aloft above his head, like a weight-lifter. Straining. GUDDU Okay. Put it down. Guddu laughs at the absurdity and sheer balls.  EXT. UNDERPASS AND BUSY STREETS - SOON AFTER (NIGHT)  Travelling at breakneck speed - Saroo joyfully perched on the handlebars - the boys emerge from the underpass. The busy streets whizzing past. Guddu the daredevil. A YOUNG MAN Go, Guddu! On Saroo: so proud of his big brother. This is living!  INT. TRAIN TO BURHANPUR - LATER (NIGHT)  Saroo and Guddu standing on a crowded night train. Hemmed in.  INT. SAME TRAIN - LATER (NIGHT)  The majority of the crowd are disembarking at a station.  4",
      "characters": [],
      "action_text": "In a deftly-practised move, Saroo and Guddu scurry like monkeys under the seats, scavenging for scraps. On Guddu: he finds a peso. (It’s about 1/100th of a Rupee.) GUDDU Peso! On Saroo: he grabs something. A peanut. He cracks the shell - SAROO Guddu! He splits the single peanut in two, and they eat it.  INT. SAME TRAIN - LATER (NIGHT)  The train is moving again. Plenty of seats now. Saroo looks totally exhausted, his head resting on Guddu. Guddu strokes Saroo, dreamily staring out into the blackness.  EXT. BURHANPUR PLATFORM - LATER (NIGHT)  The train pulls into Burhanpur Station. The PASSENGERS disembark. Last off is Guddu, carrying sleeping Saroo. Guddu sits Saroo down on a bench. GUDDU Saroo - wake up! Saroo simply groans, and curls up sideways. GUDDU (CONT’D) You have to walk. SAROO  (whiny)  I’m asleep ... GUDDU You’re too little for late nights! SAROO I’m asleep ... Don’t bother me. Guddu looks around. Annoyed with himself. Back to Saroo: GUDDU I’ll go sort things for tomorrow. Then we can find a place to sleep. SAROO Bring back a thousand jalebis.  5 GUDDU Very funny. Wait here. You don’t move, okay? Guddu leaps off the end of the platform. Familiar with it. ON Saroo: deep asleep in an instant. ON Guddu: tiny figure, hopping his way along the tracks. FADE TO BLACK.  EXT. BURHANPUR PLATFORM - LATER (VERY LATE NIGHT)  FADE UP: Saroo wakes. The platform now all but deserted - empty, haunted. A few scattered, shadowy MEN in the distance. Saroo looks around. Coming to consciousness.   Where is Guddu?  SAROO Guddu? Those shadowy MEN in the distance, huddled, smoking. We feel Saroo’s total vulnerability to this weird open space. A big empty train, standing in front of him. SAROO (CONT’D) Guddu? He looks up at the giant WATER TOWER behind the platform. Looming, almost alive - like some brooding iron monster. What to do? Where on earth is Guddu? One of the shadowy men gives Saroo one of those stares that never break. A moment of decision. CLOSE on Saroo. And just like",
      "dialogue_count": 0,
      "word_count": 885
    },
    {
      "scene_number": 2,
      "slugline": "EXT. TRAIN ON SMALL-TOWN PLATFORM (ESTABLISHING) - CONTINUOUS  WIDE EXTERIOR, we now see what’s actually going on: Saroo’s carriage, the last one, hangs over the end of the platform. Little Saroo, craning at the bars of a window.  INT. CARRIAGE - SECONDS LATER (AFTERNOON)  Saroo is back at the carriage door, trying the handle, on tip- toes trying to get a glimpse out the window. (His POV): just near him, legs dangling over the end of the platform, sits a single STREET URCHIN (10), black with grime. Saroo bangs on the door window. SAROO Help me!  EXT. PLATFORM - CONTINUOUS (AFTERNOON)  From the urchin’s POV: Saroo, trapped behind the dirty pane. SAROO Help me! The urchin stares blankly at Saroo. In his own desolation, he can’t find the energy to even engage, let alone help. SAROO (CONT’D) Please! Help me! But the train begins to pull out. Gathering speed. The urchin turns his head, and gazes at Saroo, receding.  INT. CARRIAGE - CONTINUOUS (AFTERNOON)  As the train continues to gather speed we see, over Saroo’s shoulder, all the people on the crowded platform flashing by. SAROO  (flailing, screaming)  Help! Help! But not a soul notices him - and then the station is gone.  HIGH AERIAL - AFTERNOON  The train continues across the vast landscape, whose colors have shifted now - less ochre, more verdant.  INT. CARRIAGE - LATER (LATE AFTERNOON)  Saroo, just sitting. Weeping forlorn, hopeless tears.  8",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 239
    },
    {
      "scene_number": 3,
      "slugline": "INT. CARRIAGE - LATER (NIGHT)  NIGHT. Saroo on all fours under the seats again, scavenging. He lunges for a peach stone. Well and truly eaten. He gnaws and sucks on it ravenously, getting at the last strands.  INT. CARRIAGE, SLOWING INTO CALCUTTA - LATER (NIGHT)  Saroo watches out the window a dark, unfamiliar CITY streaming past. A vast SHANTY TOWN at night. And such NOISE! The train begins to slow, noticeably. Saroo, pressed to the window, wide-eyed. Scared. But desperate to get off!  INT. CARRIAGE, ARRIVING AT HOWRAH STATION - LATER (NIGHT)  As the train lurches to a stop, Saroo is poised at the door, tensed, wary, alert. PEOPLE crowd the door. To Saroo, they seem frightening, ugly: a Boschean nightmare of faces, all crowding at the door. How’s this going to work? His hand tight on the handle. AUDIO: a HYDRAULIC AIR RELEASE SOUND, and the door unlocks. It slides OPEN, and instantly the CROWDS are PILING IN. Saroo, caught off-guard, pushes forward. THROWS himself into the crowd, like a stage diver. No way he isn’t getting off.  EXT. HOWRAH PLATFORM - CONTINUOUS (NIGHT)  The HORDES push on board as tiny Saroo fights his way out. Desperate. Lunging. Swimming his way through them. He pops clear. Free. But then, before him: the chaos of Howrah, Calcutta’s main terminus - 26 platforms. WIDE, the place is indescribably vast. The size of a small town. He turns in a circle - every direction equally hopeless. He steps up to a WOMAN. SAROO Ganestlay? WOMAN  (waving him off)  I have no money. To a MAN IN RAILWAY UNIFORM walking by: SAROO Ganestlay?  9",
      "characters": [],
      "action_text": "But the man keeps walking. Saroo sees ANOTHER OFFICIAL. He tugs on the man’s trousers. But the man just BATS Saroo away - a real clip on the ears. Turning in a bewildered circle, Saroo spots a STREET KID (5) drinking from a water fountain then walking off. Saroo steps up, tippy-toes, and drinks. And drinks. Two days without food or water. This is the Fountain of Life. Then his eyes search for that street kid.  INT. SUBWAY PLATFORM - MOMENTS LATER (NIGHT)  Up the far end of the platform, the kid sits down with a bunch of STREET KIDS, all of them so blackened with grime. CLOSER: some rowdy, some quiet. Some already asleep. ON SAROO: studying them. Cautiously approaching. He sits, twenty metres away, eyeing them warily. ON THE CHILDREN: a wild, dangerous energy. A WIRY BOY, 10, returns Saroo’s stare. No invitation here. He’s not being accepted. Eyes at ten paces. LATER. Saroo sleeps - sitting up, knees drawn, head drooping. FADE TO BLACK. OVER THE BLACKNESS (PRE-LAP): a SHRIEKING STATION WHISTLE -  EXT. HOWRAH PLATFORM - MORNING  Saroo, standing in front of a packed train about to leave, on the platform where he arrived yesterday. That WHISTLE blows again. The train lurches into movement. Saroo’s mind ticking. Here it is. The chance to go home. At the last possible moment Saroo leaps on the moving train.  INT. CROWDED TRAIN - CONTINUOUS (MORNING)  Saroo pushes inside, stands there holding the pole. Taking everyone in. He tugs on a LADY’s sari. SAROO Ganestlay? The woman grunts -   huh?   - and looks away. Saroo pushes through. Asks a MAN.  10 SAROO (CONT’D) Ganestlay? Nothing. The man just looks away. On Saroo: the invisible boy. Looking up at all these ADULTS.  EXT. TRAIN (ESTABLISHING) - NIGHT  The train hurtles along, now through the night.  EXT. UNNAMED STATION - MORNING  The train pulls into a TERMINUS, where EVERYONE alights. Saroo jumps up from under that seat. Instantly awake, he runs for the door. Excited. This should be Ganestlay. He stands in the doorway - l",
      "dialogue_count": 0,
      "word_count": 962
    },
    {
      "scene_number": 4,
      "slugline": "INT. HOWRAH SUBWAY PASSAGE - LATE AFTERNOON  Saroo, so tiny, as he walks along the VAST, CROWDED subway passage (SINGLE SHOT, WIDE) - a subterranean nightmare.  EXT. TRACKS LEADING OUT FROM HOWRAH - DUSK  CLOSE: Saroo stands bathed in the late afternoon light - gazing out at something. A gentle breeze on his face. He looks left. Looks right. Looks ahead. Then with a resigned slump, he turns and walks off. WIDE: he’s walking back (towards the station) across an ENORMOUS COBWEB of entangled train tracks - an IMPENETRABLE WEAVE that really shows just how impossible getting home is.  EXT. SUBWAY PLATFORM, HOWRAH STATION - NIGHT  LATE; the lost children are curled up, entangled, asleep. Forlorn Saroo sits down - same wary distance as the other night. His eyes tired and red. His grimy face tear-stained. He now looks just like them - the transformation is complete. Eye contact with Wiry Boy, who’s lying on a bed of cardboard. Wiry Boy shifts, nods to Saroo - slides out one of the layers of cardboard that make up his bed. Slides it over to Saroo. Saroo -   I can?   An offer of extraordinary generosity. Saroo walks over, takes it, lies down. A luxury. Saroo nods   Thank-you , smiles shyly. Wiry Boy nods solemnly. As Saroo closes his eyes, we FADE TO BLACK. SILENCE. HARD CUT INTO:  EXT. SUBWAY PLATFORM, HOWRAH STATION - LATE NIGHT  - Saroo is woken by screaming and sudden pandemonium. SHADOWY ADULTS are grabbing at the children - it is terrifying and aggressive and chaotic - ADULTS Come here! Hey! You! - and the children are screaming in terror and scattering. A STATION OFFICIAL casually lights a cigarette. (In his nonchalance, a sense of the machinery of corruption.)  13",
      "characters": [],
      "action_text": "Springing into survival mode, Saroo runs for his life - straight up the end of the platform, and leaps straight off -  INT. TRAIN TUNNEL - CONTINUOUS (LATE NIGHT)  - and into the tunnel. The last thing he sees, as he turns for one last glance, is Wiry Boy being violently taken away. Saroo sprints along the tunnel. A MAN chases. ON Saroo: a heart-pounding chase. Rats scurrying everywhere. BODY SNATCHER Hey! You come here! You come back! Suddenly, danger: a train hurtling towards him. Blinded, Saroo flattens himself against the wall, terrified. The train barely misses him, as it blares past. As Saroo stands there, pinned against the wall amid all the electrical cables, head turned sideways, he sees - - along there, the body snatcher, also pressed to the wall. Now the train is gone - and here comes the body snatcher - - nowhere to go but forward - Saroo keeps sprinting - at last the body snatcher gives up -  EXT. BETWEEN STATION AND RIVER - MOMENTS LATER (LATE NIGHT)  - Saroo emerges into the world outside the station - and sees for the first time what he’s just been inside: - the great red brick edifice that is Howrah - and beyond it, huge HOWRAH BRIDGE. An eerie, haunting 3:00 a.m. Stillness. From INSIDE comes a child’s SCREAM - which propels Saroo to keep sprinting - away from the station - along the road -  EXT. BRIDGE - CONTINUOUS (LATE NIGHT)  - straight up the stairs to a vast forbidding bridge - his tiny legs struggling to keep going upwards, upwards ... He reaches the top of the stairs. He looks ahead. This bridge, stretching into the distance, is the biggest thing he’s ever seen in his life. Few cars on the road. Few PEOPLE on the footpath. Pollution haze like a ghostly fog. It feels haunted. Ahead: a couple of Calcutta’s WILD DOGS potter about. They own this bridge at night. Saroo inches backwards, scared and wary.  14 He looks back down the stairs. No sign of the body snatcher. But ahead, beyond those dogs: it’s too daunting. Too haunted. Through the rails,",
      "dialogue_count": 0,
      "word_count": 2752
    },
    {
      "scene_number": 5,
      "slugline": "INT. CONCRETE HIDEY-HOLE - DAY  Heart-wrenching - Saroo’s attempts at a nest, at belongings. A filthy blanket; water bottle; broken toy car; mussel shell. And another cardboard sheet. Which he’s lying on now, on his belly, a torn Indian   Vogue   propped against the wall. Saroo parks the toy car at the base of the Swiss mountain in a Breitling watch ad. He loads the seashell onto the roof of the car and drives it away, making little-child NOISES. He fills the mussel shell with dirt and tiny pebbles, pushes it to the corner, tips the contents out. Like Kamla’s hod. SAROO Good boy. Good boy. That’s a good boy. Good boy. AUDIO: the rain easing.  EXT. CONCRETE HIDEY-HOLE - SOON AFTER (DAY)  The sun’s out, everything dripping. Saroo clambers down. (We see how ingenious his nest is: a 4-feet-cubed concrete recess between two pylons, 8 feet off the ground, hidden from view.) The crows look down on him from the telegraph wires.  EXT. RIVERBANK - DAY  Saroo fossicks by the shore, where the garbage ebbs and bobs. His little “scavenger bag” slung over his shoulder. A DEAD BODY - a crippled beggar, lips blue, eyes lifeless - stares at the sky in a death grimace. Saroo stares for a moment. And then steps over it. He finds a bent spoon. Inspects it. It looks like some rusted relic from the Raj - an English serving spoon. Pleased, he puts it in the scavenger bag.  EXT. STREET - DAY  Saroo sits in a narrow traffic island in the middle of a crazy busy street - buses and trucks in all directions. He takes out the spoon, studies it again, straightens it. Reaching back into the scavenge bag, he places a few grains of rice and corn on the spoon. Across the road at a cafe table, a MAN (pleasant-looking, a student, 22, a book and cup of chai in front of him) watches - fascinated. Saroo feeds himself off the spoon, imagining a HUGE mouthful.  24",
      "characters": [],
      "action_text": "To the man it’s heartbreaking - he’s drawn in by Saroo’s “play”. At that moment their eyes meet. The man smiles. JUMP CUT:  INT. OFFICE, POLICE COMPLEX - SOON AFTER (DAY)  Saroo sits at a desk, tiny and bewildered in “officialdom”, as the café man speaks to a POLICE OFFICIAL (50). CAFÉ MAN He speaks Hindi - not a word of Bengali - so he must be a long way from home. When I ask where he’s from, he keeps saying “Ganestlay”. It means nothing to me. The official nods, walks over to an old WALL MAP of India. POLICE OFFICIAL  (to Saroo)  Now this ... “Ganestlay” -  (pointing to all of India)  Do you think you might have a   rough  idea where it is? Saroo - the little prince of cluelessness. POLICE OFFICIAL (CONT’D) Do you know which province? It would help us a lot if you knew the province. Even as the words come out of his mouth, he understands the stupidity of the question. But he hovers there, in hope. Saroo stares at the map - that distinct triangle of India - then the official, as if they’re both enormous blank walls. The official sits. Glances at the café man. POLICE OFFICIAL (CONT’D) Let’s try something else. Do you know your family name?  INT. OFFICE, POLICE COMPLEX - SOON AFTER (DAY)  FLASH! Saroo’s photo is taken.  INT. FRONT COUNTER, POLICE COMPLEX - SOON AFTER (DAY)  The official at a counter (Saroo on a bench, B/G, with the café man) as a hardened OFFICER (he’s seen it all) takes approximately five seconds to read Saroo’s two-page FILE. STAMP! He stamps the file “LOST”. Staples the PHOTO to the cover. Pulls out a separate page, Indian-bureaucracy-style.  25 HARDENED OFFFICER  (hands official the file)  That’s for ISSA.  (hands him the page)  That’s for Liluah. POLICE OFFICIAL  (slight frown)  Really? HARDENED OFFFICER  (shrugs; not my problem)  While they process him. ON THE POLICE OFFICIAL: he knows this is not great. He composes himself, turns, smiles to Saroo and Café Man. POLICE OFFICIAL They’ve found him a home - while they look. The man smiles, relieved",
      "dialogue_count": 0,
      "word_count": 2620
    },
    {
      "scene_number": 6,
      "slugline": "INT. QANTAS JUMBO JET - SOON AFTER (DAY)  POV from window: all of Calcutta. So tiny down there.  INT. QANTAS JUMBO JET - LATER (DAY)  The astonishing view from 30,000 feet. Saroo’s been glued to that window for hours. The earth is vast. Saroo pulls down the window blind. Pulls it up again. Saroo turns, looks at his sleeping minder. Looks back at the window. Blind down, blind up. Looks back out the window.  INT. CORRIDOR, HOBART AIRPORT - DAY  We’re CLOSE behind Saroo’s shoulder as the minder guides him along a corridor, flanked by an AIRPORT OFFICIAL. We round the corner of the corridor and enter -  INT. CONFERENCE ROOM, HOBART AIRPORT - CONTINUOUS (DAY)  - where JOHN (32) and SUE (29) BRIERLEY stand up anxiously - Everyone just stands there for a moment - so tentative - MINDER Hello. I’m Swarmina. JOHN  (softly)  I’m John. This is Sue. Saroo has retreated behind Swarmina’s leg - he holds on for dear life and peers out shyly. Wide-eyed. First boy on Mars. Sue kneels gently. A lifetime of waiting brims in her eyes. She looks down on Saroo with as much astonishment as he her. SUE Hi there. Saroo still clutches the half-eaten Cadbury bar from earlier. SAROO  (deadpan)  Cadbury. It doesn’t get more awkward. Or beautiful. SUE It’s a Cadbury, John.  34",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 224
    },
    {
      "scene_number": 7,
      "slugline": "I/E. CAR / THE BRIERLEY’S STREET - DAY  We’re in the car with our new nuclear family, in the back seat with Saroo (POV). He looks at the passing rows of brown suburban homes - neat lawns - sprinklers. So unlike India. Sue watches Saroo in the central mirror: his curiosity and his amazement.  INT. BRIERLEY HOME - MINUTES LATER (DAY)  We’re behind Saroo as he enters the house, awed, alert, curious. Sue and John gently prod - JOHN That’s okay - have a look around - Saroo is goggle-eyed. Sue gives running commentary wherever he goes. Whatever he looks at. SUE This is the living room. That’s the television. [etc...] The clean white benches. The shiny refrigerator. Saroo steps up to the fridge. He looks back to Sue:   May I?  He opens the door. The colourful glory of western groceries. Stands there, mouth open, simply stunned. Shuts it gently.  INT. SAROO’S BEDROOM, BRIERLEY HOME - MINUTES LATER (DAY)  Saroo’s bedroom. A box of toys. Saroo looks up at Sue and John, not quite believing his eyes:   Can I touch these?  SUE They’re yours. JOHN You can play with them. But Saroo just stands there, lost in a moment of fully taking in his parents. John Brierley. Sue Brierley. White Martians. Saroo blinks twice. JOHN (CONT’D)  (kneeling)  Here you go.  (pushing a truck)  You have a go, son. Saroo picks it up. Simply studies its wheels. Spins one. He’s too overwhelmed, too shy, to play immediately. Looks up at his parents again.  35",
      "characters": [],
      "action_text": "JOHN (CONT’D) See how the doors open. Look. Like this. John demonstrates the truck doors. Saroo likes that. He opens and closes the tiny doors. He puts the truck on the ground - pushes it along. Gets lost in the activity. Then he looks up. As he takes in the room once more, something on the wall catches his attention: - a detailed MAP OF INDIA. Saroo recognizes the triangle, all that dense information, though he can no more understand written English than he could the Bengali on that map in the police station back in Calcutta - SUE That’s right. That’s where you came from. Look. This is India. This is Calcutta, here. SAROO  (one word he recognizes)  Cal-cutta. He stares politely at the incomprehensible map.  INT. DINING ROOM, BRIERLEY HOME - NIGHT  Dinner time: Saroo nervous, polite, calm, as they eat. Head barely above the table. Taking in the place settings. As Saroo chews, he looks up at his new parents. Grins. SAROO  (pointing)  Peppa. Sue and John share a proud smile. SUE That’s right. That’s the pepper.  INT. BATHROOM, BRIERLEY HOME - NIGHT  Sue ladles water over Saroo. He’s fascinated with everything: the water, the warmth, this gentle woman, these bath toys. SUE Close your eyes. She motions to him:   close your eyes.  For an instant, he looks at her warily. Remembering Noor.  36 SUE (CONT’D) Go on. It’s okay. He looks into her eyes. He has to trust. He can trust. He closes his eyes. Sue pours a saucepan of water SLOWLY over his head. The STEAM comes off him. It’s like some exotic baptism. You can see his whole body - his whole being - relax. He opens his eyes. SUE (CONT’D)  (eager, encouraging)  Good? Saroo smiles. SUE (CONT’D) You’ve come so far. Haven’t you? My little one. He stares up at her with those huge dark eyes. SUE (CONT’D) I don’t imagine it’s been easy. One day, you make sure to tell me all about it. Tell me everything. Who you are. I’ll always listen. He squeezes the alligator. It SQUEAKS. He pulls back, amused. Sue notices John at the door - he",
      "dialogue_count": 0,
      "word_count": 2337
    },
    {
      "scene_number": 8,
      "slugline": "INT. RMSHM AUDITORIUM, AISLE - LATER  Induction over. The aisle between the seats is crowded. Saroo shuffles along shoulder to shoulder with other students of many races. He hears fragments of Hindi - it strikes him how many Indian students there are. He nods neutral hellos to them. Saroo eavesdrops as an INDIAN STUDENT on her cell phone excitedly calls her Ammi. Saroo is stuck at the end of a row. Opposite him - also stuck - is a beautiful young woman - LUCY (late 20’s). She meets his eye. They step forward together. A mirror-moment.  INT. RMSHM CLASSROOM - DAY  Open MID on Lucy - we’re in a round-robin discussion in a tutorial of about fifteen STUDENTS, assorted ages and backgrounds. A non-Anglo TUTOR. LUCY - so I saw first-hand how the hospitality industry brings infrastructure to communities that really need it. But I also saw the problems that causes. Which is why community groups really need to be involved, every step of the way. And taken seriously. And I thought - I could help give them a voice. Saroo, watching, listening, entranced by this beautiful, idealistic woman. LUCY (CONT’D) Not try to prevent progress, but convince developers there are benefits to being sustainable and community oriented. TUTOR  (amused, encouraging)  Why not think big? LUCY  (laughs)  Absolutely. In return, the labour force would be more consistent and better trained and more motivated. Win-win. TUTOR So you want to be ... The tutor considers.  45",
      "characters": [],
      "action_text": "TUTOR (CONT’D) - a community liaison consultant? LUCY That sounds good! Done. She looks to Saroo: his turn next. SAROO I want to run hotels that put all the profits into my pocket. Some laughter. Some frowns. Saroo was only joking. Lucy grins at him. A tickle of chemistry. TUTOR Let’s start with where you’re from. SAROO Tassie. PRAMA “Tazzy”? SAROO Tasmania. Across the water. TUTOR So born in Australia. SAROO  (resistant)  Umm ... Kolkata. PRAMA I have cousins that live there. They’re quite mad. BHARAT Which part? Saroo’s sudden discomfort. It’s been a long time, and even talking about it is stirring up memories. SAROO I’m adopted. I’m not really Indian. He inadvertently comes across as a little rude - as if he wouldn’t want to be Indian. Bharat and Prama feel it. Lucy dispels the growing tension. LUCY You love cricket though, right? SAROO Of course.  46 BHARAT You don’t support the Aussies, do you? SAROO Only the Aussies, mate. Bharat and Prama look alarmed. BHARAT This is going to be interesting! They all smile. TUTOR  (getting it back on track)  And why are you doing this course, Saroo? What do you hope to get out of it? Saroo refocuses, ponders the question. He smiles at the tutor - trying to find the elusive answer.  EXT. FLINDER’S STREET, MELBOURNE - DAY  Saroo walking in the afternoon light. A metropolis strangely like Howrah. The hum and energy, the traffic, distant train sounds.  INT. SAROO’S STUDENT APARTMENT - DAY  Silence. A sudden sense of isolation. Saroo goes to the window. Ten stories down, the busy city with its enticing energy.  EXT. INDIAN SHARED FLAT - DUSK  Beers in hand, Saroo climbs the exterior stairs of a 70’s block, where a long balcony leads along the third floor. As he reaches the landing, he sees Lucy at the far end - coming up the opposite identical stairs. Like mirrors again. Struck by the serendipity again - and Saroo struck by Lucy’s beauty - they burst into smiles. As they arrive at the door, Bollywood music can be heard. They can’t",
      "dialogue_count": 0,
      "word_count": 3204
    },
    {
      "scene_number": 9,
      "slugline": "EXT. BEACH HOUSE - DAY  An old-fashioned beach house right on the sand. Outdoor stairs lead up to the front door, which is on the first floor.  INT. BATHROOM & BEDROOM, BEACH HOUSE - CONTINUED  Saroo’s in the shower. Singing to himself. Saroo and Lucy’s home - nothing expensive but evidence everywhere of care, taste, and a nesting impulse. Saroo dries himself. Towel around his waist. Walks into the bedroom. Starts up his laptop. ON SCREEN: India. He scrolls randomly along a railway track; then stops at a STATION. The laptop struggles to render the image - the rotating hour- glass spins and spins... Saroo looks frustrated - his old laptop is crap. Lucy hurries in. All dressed up. Corporate. Sparkling. SAROO Wow. Look at you. She does a spin. SAROO (CONT’D) Your hem’s down... LUCY  (panics)  Oh God. It’s so long since I wore this.  (beat)  Have you got a stapler? He gets one. Staples her hem for her. She notices the computer struggling to render. Says nothing. SAROO  (reassures her)  They’ll love you. He starts kissing her neck. LUCY I haven’t got time... Saroo keeps kissing her, nuzzling - Lucy reciprocates. LATER  60",
      "characters": [],
      "action_text": "Saroo’s alone - eating toast - dressed in his Assistant Manager’s suit - name-pin on his lapel. He returns to the laptop - the hourglass is still spinning! He’s incredulous - shakes his head in disbelief.  INT. CONVENTION ROOM, HOBART GRAND HOTEL - DAY  We follow Saroo (in a suit) into a large convention room which is at this moment bursting with activity. The space is filled with STAFF setting big round tables with perfectly starched table cloths, vases, table numbers etc. SAROO Peter - have you got the individual place cards too? PETER I’m on it. SAROO  (to another worker)  Michael - take three people with you to the loading dock. The flowers have arrived. Michael heads off. Saroo stands there surveying his domain. CLOSE: he shifts his tie, stretches his neck. We suddenly see how uncomfortable he looks. Something not quite right. He starts striding FAST out of the convention room -  EXT. STREET OUTSIDE ONE-ROOM HOME, KHANDWA (FLASHBACK)  - and suddenly we’re behind LITTLE Saroo (same camera angle) as he follows a scene of utter CHAOS as three POLICEMEN drag screaming Guddu to a paddy wagon - - Shekila wailing in Saroo’s arms, Guddu kicking and screaming, Kamla grabbing at the policemen - - as they spill from inside the home to the alley outside - GUDDU Ammi! Ammi! [Mummy!] SAROO Guddu! KAMLA You can’t arrest him! Kamla lashes at the policemen - we follow behind Saroo as they drag Guddu up the street to the waiting wagon -  61 INT. HALLWAY, HOBART GRAND HOTEL - MOMENTS LATER (DAY)  - and now (”REVERSE” of previous shot) we LEAD, tracking backwards, as Saroo picks up speed - striding towards us - - and STOPS. Panting. Looks around. Generic hotel doors.  INT. HOTEL ROOM, HOBART GRAND HOTEL - MOMENTS LATER (DAY)  STILL LIFE: an empty high-end hotel room. The door knocks. SAROO (O.S.) Housekeeping.  (beat)  Housekeeping. The door opens. Saroo enters using his swipe card. He sits on the sofa. Still breathing hard.  EXT. STREET OUTSIDE ONE-ROOM HOME, KHANDWA (FLASHBACK) ",
      "dialogue_count": 0,
      "word_count": 1357
    },
    {
      "scene_number": 10,
      "slugline": "INT. SUE’S ART STUDIO, BRIERLEY HOME - NIGHT  CLOSE on small, beautiful watercolors - ethereal landscapes, horizons - stacked around, as Sue and Lucy step into the downstairs sun-room/studio. SUE I don’t usually show anyone these - LUCY They’re beautiful ... SUE I do have fun. My secret hobby. Lucy notices, on a shelf, a jumble of trophies. At a glance, there seem to be about ten different sports here, from soccer to windsurfing to cricket. SUE (CONT’D) Saroo’s. He was good at everything. LUCY I had no idea. SUE He was such a happy boy. Lucy looks away. Spots a framed family photo, picks it up gently. LUCY Wow, look at Mantosh. ON PHOTO: Saroo, Mantosh, Sue and John laughing on the boat. SUE Yep. He was a cheeky little thing... Lucy gazes closer at the snapshot of a lost, happy era. SUE (CONT’D) Pure energy. Impossible to control. But incredible. If he could ever learn to control it, he could do anything. Saroo’s very protective of him. Lucy’s finding this conversation a little difficult. She has so many questions she’d like to ask Sue, about Saroo’s childhood. SUE (CONT’D) I’ve been blessed...  66",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 196
    },
    {
      "scene_number": 11,
      "slugline": "EXT. UPSTAIRS DECK, BRIERLEY HOME - SAME TIME  Saroo on the deck with John, who’s just stacked some freshly cooked chops on a plate. Sausages sizzling away on the grill. JOHN Not partying too hard? Saroo, amused by that. SAROO Not partying at all! JOHN You look a bit tired. SAROO It’s just work. JOHN How’s it with Lucy? SAROO Great. JOHN We love Lucy. SAROO  (entranced by the sausages)  Yep. It’s hard not to. She’s great. Pause. SAROO (CONT’D) I’ll get us another beer. Saroo turns inside. John nods.   Okay.   Prods the meat.  INT. KITCHEN, BRIERLEY HOME - CONTINUOUS  Saroo steps inside. And Mantosh is there, back turned, rolling a cigarette as he props the fridge door open with his leg, inspecting the contents. He turns as he hears the sliding door. MANTOSH  (nervously)  Was wondering where everyone was. His eyes are BLAZING STONED. Saroo takes him in. SAROO Jesus. You couldn’t be a little more wasted?  67",
      "characters": [],
      "action_text": "Mantosh shrugs, grins. Aloof bravado, but fragile underneath. Just holding on: clearly it’s a big effort just to come here. At that moment Sue comes up the stairs with Lucy. Is   very  happy to see Mantosh. SUE Darling - MANTOSH Mum! Sue goes - tentatively - to hug him. Mantosh somehow manages to balance the half-rolled cigarette as she enfolds him. Through the awkwardness, it somehow becomes a warm embrace. SUE  (private, in his ear)  Well done for coming. She breaks the embrace - SUE (CONT’D) This is Lucy ... LUCY  (very friendly)  It’s nice to finally meet you. Mantosh continues to roll his ciggie, licking the paper. SUE  (nervous to confront him)  You have to smoke that outside. Mantosh lights the cigarette, takes a deep toke. MANTOSH No worries. He heads outside to the deck. Saroo, fuming, can’t stand what Mantosh does. He notices Sue, now readying the food in a fussy and manic way. MANTOSH (O.S.) (CONT’D) Hey, Dad! JOHN (O.S.) Son! ON Lucy. Okay. Right. She feels the world, between them all, in that cigarette smoke. All the spaces in between them.  INT. DINING ROOM, BRIERLEY HOME - LATER SAME NIGHT  Saroo, Lucy, John and Sue at the table, serving up. A dark cloud building over Saroo.  68 LUCY  (to Saroo)  I saw all your trophies... SAROO Oh Mum, you didn’t? - LUCY  (re: Saroo)  He never tells me anything about growing up - JOHN That’s just half. I’ve got more in the garage. LUCY  (re: Saroo)  These days I can’t get him off the couch. SAROO  (warns)  Luce - Sue, John and Lucy quite taken aback by his sudden intensity. LUCY Why can’t you tell them what you’ve been doing? - SAROO - don’t - SUE - what’s that, luv? - Mantosh enters, even more stoned, rubbing hands, big grin. MANTOSH Yum, dinner! He sits. Notices the tension. And it’s not from him! MANTOSH (CONT’D) What? What have I missed? SAROO Nothing. MANTOSH  (noticing Lucy)  She looks upset. SAROO She’s not upset.  69 LUCY  (to Saroo)  I can speak for myself. And how do you know how I feel? In his stoned amaze",
      "dialogue_count": 0,
      "word_count": 1830
    },
    {
      "scene_number": 12,
      "slugline": "INT. LIVING ROOM, BEACH HOUSE - DAY  TWO MONTHS LATER. SOUND of the sea. Bright marine light. We track through the house. It’s virtually empty. The atmosphere of a squat. No sign of homeliness, of warmth - of Lucy. A mattress on the living room floor. A master map of India on the wall. Piles of print-outs - lists of railway stations - some marked-up - most still pristine. Images of water towers, train platforms, under-passes. Saroo - long hair, beard - has surrendered to his obsession. MUSIC starts - continues into a series of HARD CUTS: - Scrolling; waiting for the pixels to resolve. - A blue “train station” symbol. - CLOSER IN: a formless, satellite-image town. - On Saroo: studying its features. No, that’s not it. He stands - grabs a blue pin - sticks it into the map. - leans back into the screen. Reads the next town - - enters the name. - blue train station symbol. - Another town, the surrounds of the train station. - He grabs another blue pin - sticks it into the map. - Scroll. Symbol. Station. Pin. - Scroll. Symbol. Station. Pin. It becomes a rapid MONTAGE. Sound of someone hammering on the front door.  EXT. BEACH HOUSE - CONTINUOUS  Mantosh is at the door. He looks nervous, desperate, standing there counting coins in his hand. He bangs harder on the door. MANTOSH Saroo, ya bastard! Silence. Mantosh, listening.  77",
      "characters": [],
      "action_text": "MANTOSH (CONT’D) Saroo!  (beat)  Mate, can you lend us fifty bucks? CLOSE on Mantosh, sweating there at the door. He doesn’t look good. Mantosh gives up knocking, leaves. MANTOSH (CONT’D) Yeah, whatever, dude.  INT. LIVING ROOM, BEACH HOUSE - CONTINUOUS  Saroo spies out of the window. As Mantosh heads off down the beach, he’s joined by a DRUGGIE MATE, who has been lurking somewhere near. The mate looks to Mantosh, inquisitive,   Well?   Mantosh just shakes his head,   No go.   They walk away. Saroo turns. Guddu is there, also watching Mantosh. Saroo and Guddu look at each other. Saroo returns to his search.  INT. STATIONERY SHOP, MALL - DAY  TWO MONTHS LATER. Saroo - his hair longer, his beard wilder - moves slowly down the aisle of a stationery shop - putting boxes of COLOURED FLAG PINS into a basket. He’s out of place in this vivid Charlie & the Chocolate Factory world. He stops at the pen section, testing high-lighters. Throws some different-coloured boxes of those in his basket. At the counter, as the items are scanned, we study Saroo’s face. He looks exhausted. Doesn’t notice when the CASHIER smiles at him. CASHIER Same project? Saroo nods, with an air of defeat.  EXT. SUBURBAN BEACH - DAY  Saroo walks along the sand with his shopping. Past rows of suburban houses, their blank windows reflecting the sea.  78",
      "dialogue_count": 0,
      "word_count": 468
    },
    {
      "scene_number": 13,
      "slugline": "EXT. RAILWAY TRACKS, KHANDWA - DAY (FLASHBACK)  Little Saroo on the tracks, proudly holds his pregnant belly of coal. Guddu bustles over to him. GUDDU Come on, hurry. Little Saroo looks so happy, as they trot off together.  EXT. BEACH HOUSE - CONTINUOUS  Saroo crosses the sand to the house. His face determined now.  I/E. TRAIN CARRIAGE, INDIA - DAY (FLASHBACK)  Saroo’s POV: the world moves past in a watercolour blur - ochre country, hills, mountains, trees -  INT. LIVING ROOM, BEACH HOUSE - DAY  ON SCREEN: tracking railway lines, flying above them - station after station. Saroo ZOOMS in. His hopes up. He counts the platforms with his finger. NO: yet again, that’s not it. Disappointed, he zooms back out. GOOGLE SCREEN JUMP CUTS: train track after train track ... Platform after platform... SOUND of a real train, approaching, coming under us:  EXT. TRAIN LINE, INDIA - DAY (IMAGINED MEMORY)  Kamla walks up to the very edge of railway track just as a train rips past very fast. An endless stream of carriages - the noise and speed violent, crazy, dangerous - but Kamla shows no fear. KAMLA Saroo! Saroo! Her screams drowned out by the racket of the train. She is in hell, but cannot - will not - give up.  INT. LIVING ROOM, BEACH HOUSE - CONTINUOUS  Saroo mirrors her desperation. He gets a beer, stares at the map. A new colour being used now, for a new search zone. About 15% of the search complete.  79",
      "characters": [],
      "action_text": "He’s suddenly aware it’s the dead of night. He feels like the only soul awake.  INT. FOOD COURT, MALL - DAY  TWO MONTHS LATER. CLOSE on a table filled with leftover Chinese food (where some people have just finished and left the table), when a SMALL INDIAN HAND comes into frame, the fingers scooping up the food - - we TRACK up the arm to reveal Guddu - wolfing down the food with bare hands, greatly enjoying it - and all the while staring across to - - Saroo (other side of the food court) - who stares right back, sitting in front of his untouched (western) meal.  EXT. MALL - CONTINUOUS  Saroo steps onto the escalator. The lights and muzak of capitalism definitely not working wonders for him. As he descends: there is someone ascending. It’s Lucy. She looks grounded and somehow resolved. They approach each other. Lucy sees him. Alarm in her eyes. He looks like a crazy man. Saroo swings across, from his escalator to hers. As always, drawn by her vivid gaze, her intense life-force.  INT. LIVING ROOM, BEACH HOUSE - DAY  Lucy follows Saroo up the stairs. She walks in and stops dead at the sight of Saroo’s “Project”. It’s mind-blowing. An entire wall is plastered in charts, train-timetables, station-name-lists, grainy images from Google Earth. On the Master Wall is a big map - surrounded by smaller ones. And all the pins ... The floor layered in books, notes, clothes, take-away containers. We go closer to the Master Wall with Lucy, inspecting it. Dense trails of colored drawing pins on the 400km search radius - different colors for different train lines. WALL KEY: green pin = Mumbai line, red pin = Nagpur line etc. But our dominant visual information: in the past 6 months, Saroo has covered a fraction of the search radius. The inner circle only.  80 Saroo responds to Lucy’s look of fascination and alarm. SAROO Theoretically it’s not infinite. She just stares at him. SAROO (CONT’D) Lucy - I’m sorry.  EXT. BEACH HOUSE - SOON AFTER  Saroo and Lucy sit on the beach. LUCY What w",
      "dialogue_count": 0,
      "word_count": 1241
    },
    {
      "scene_number": 14,
      "slugline": "INT. LIVING ROOM, BEACH HOUSE - DAY  It could be later the same day. It could be another day. Time has blended into something amorphous. Saroo lies on his lonely mattress. All is still; even the sea is calm. Then his past silently weaves into his consciousness, all these vignettes and flashbacks united in their stillness, as his eyes flicker closed:  INT. ONE-ROOM HOME, KHANDWA - EVENING (FLASHBACK)  ON KAMLA - unmoving, sensing Saroo;  INT. DORM ROOM, LILUAH - NIGHT (FLASHBACK)  ON little AMITA, lying in bed, staring.  EXT. CALCUTTA STREET - DAY (FLASHBACK)  ON CAFE GUY - his kind stare through the cafe window (as Saroo sits on that traffic island, fantasizing non-existent food on his rusty bent spoon -  INT. SUBWAY PLATFORM, HOWRAH STATION - NIGHT (FLASHBACK)  ON WIRY BOY - just moments before he decides to offer the cardboard, dignity and generosity - then:  INT. BEDROOM, NOOR’S ROOFTOP HOME, MORNING (FLASHBACK)  ON RAMA - his slow-moving hand along Saroo’s leg ... RAMA You’re a good boy. Are you a good boy? (O/S AUDIO) Whimpering - a scuffle - shouts. A confusing auditory nightmare. Beatings. Cries of anguish. Rape. Liluah.  INT. CLASSROOM, LILUAH - DAY (FLASHBACK)  ON HAUNTED BOY, swaying back and forth, rubbing his hair and forehead, a pressure cooker about to explode. He bangs his head against the wall, over and over.  INT. SUBWAY PLATFORM, HOWRAH STATION - NIGHT (FLASHBACK)  The SOUND of Haunted Boy banging his head carries over into screaming and sudden pandemonium, as the CHILD-SNATCHERS arrive and the URCHINS scream and scatter and WIRY BOY is violently grabbed and wrenched away, screaming -  INT. LIVING ROOM, BEACH HOUSE - LATER  Saroo’s eyes, still flickering. Guddu sits in the dark - it’s dusk or dark now - watching over Saroo. Keeping his distance. Giving Saroo space. He knows the memories are the search...  84",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 311
    },
    {
      "scene_number": 15,
      "slugline": "INT. LIVING ROOM, BEACH HOUSE - DAY  A knock at the door. Saroo wakes and goes to the window. Looks down.  EXT. BEACH HOUSE - INTERCUT  John, looking up. He has a “care package” from Sue. He puts it by the door. He waits. Nothing. JOHN It’s the One Day International tomorrow. Come over if you like. We’ll get some beer and pizzas. Nothing from inside the house. INSIDE: Saroo just stands there, pressed against the wall. Frozen. Conflicted. JOHN (CONT’D) I meant to tell you - I fixed the tiller. Why don’t we take her out, head up the coast? Maybe see if we can round up Mantosh. Pause. John, listening. JOHN (CONT’D) Saroo, your mum’s not - Whatever he was about to say (”Your mum’s not doing so well”), he stops it. Looks down at the care package. JOHN (CONT’D) Your mum’s made a nice cake for you. Put a few other goodies in here too.  (beat)  I think she’d love a visit. He stands there, hoping against hope that Saroo will suddenly appear. JOHN (CONT’D) Right. Take care, son. He turns to walk away.  EXT. BEACH HOUSE - NIGHT  Saroo sits on the beach, a starry night. Watching the water - the ghost-waves marking time like a pulse ...  INT. KITCHEN, BRIERLEY HOME - NIGHT (FLASHBACK)  A night light in the kitchen illuminates Sue, standing at the sink. Her arms hanging limp. Exhausted. Mute.  85",
      "characters": [],
      "action_text": "Five-year-old Saroo steps beside her. Reaches up, takes her hand. She snaps out of it, looks down on him.   It’s all right , says the look on his face. A private communion. The son comforting the mother. Then, as if remembering her duty to look after him, Sue pulls Saroo close, cradles his head. They stand there, a silent tableau.  INT. SUE’S ART STUDIO, BRIERLEY HOME - AFTERNOON  Concern registers on Saroo’s face as he enters the little room. Sue sits in the weak sunlight by the window. She looks pale and unwell, in her dressing gown, nursing a cup of tea. Saroo doesn’t look crash-hot either - months of no sleep or exercise have taken their toll. Two lost souls. But she brightens at the sight of Saroo. SAROO  (hugging her)  I’m sorry. I’m sorry. He sits opposite her. She holds back tears. SUE John just heard, he’s been out on the boats. Doing the lobster run. They’re due back tomorrow. Saroo looks at her, doesn’t want to admit what this means. SUE (CONT’D) So he’ll be flush for cash. And then back on the hard stuff ... Saroo can see in her pain how much she loves Mantosh. She smiles bravely, her pale eyes sparkling. SAROO I’m sorry you couldn’t have your own kids. ON SUE: a misconception, dawning on her. SUE What are you saying? SAROO I mean, we weren’t blank pages, were we? Like your own would have been. You weren’t just adopting us, but our pasts as well.  (beat)  And I feel like we’re killing you.  86 Sue smiles - still holding off the tears. SUE We could have had children. We chose not to. ON SAROO: shocked by this new information. SAROO Wait. You   could   have had kids? SUE Never made that public. Some things need to stay private. Some people would never understand why you’d start a family like ours. We wanted you two in our lives. We chose that. Saroo is moved. Listening intently. SUE (CONT’D)  (smiles, remembering)  I think it’s one of the reasons I fell in love with your dad.  (beat)  We both felt the world had more than enough people in it already. Becaus",
      "dialogue_count": 0,
      "word_count": 2762
    },
    {
      "scene_number": 16,
      "slugline": "EXT. FIELD NEAR DAM, KHANDWA - DAY (FLASHBACK)  CLOSE on little Saroo’s hand, scavenging through the trash, at that moment the YELLOW BUTTERFLY lands on it. As he carefully stands, and spreads his arms: PANORAMIC WIDE of an ochre landscape. Full of yellow butterflies. The YELLOW is fluttering, fluttering, and starts FILLING THE FRAME. AUDIO: very faintly a haunting refrain rises: the lullaby little Amita sang that long-ago night in Liluah.  INT. LIVING ROOM, BEACH HOUSE - CONTINUOUS (NIGHT)  The lullaby carries over to the present - we’re back with Saroo - more ALERT - scrolling on the Google screen - We scroll over fields. Villages. Then a railway line. He does what he’s always done: trace the tracks to find the next station. - A FLASH: POV FROM MOVING TRAIN (from when he was trapped) of those WIDE OCHRE FIELDS - He keeps scrolling, scrolling. And soon enough: the train line enters a mid-sized TOWN. We’re over the centre of the town. He zooms in closer. The Google Earth blue railway station symbol, hovering. The rail lines. The platform. Closer in. Closer. And then, on Saroo:   Huh. What’s that?  ON GOOGLE EARTH SCREEN: it’s blurry. But it looks a little like a water tower. Saroo blinks, looking at it. Zooming in. His head tilts: - this water tower, getting a little clearer as he zooms.  SAROO’S “MEMORY MAP”: FLASHBACK 1 - WATER TOWER (NIGHT)  Little Saroo alone on the deserted platform. Where’s Guddu? Saroo shivers, holding himself. He looks up. At the tower.  INT. LIVING ROOM, BEACH HOUSE - CONTINUOUS (NIGHT)  Saroo, sitting up straight. Looking as spooked as that child.  96",
      "characters": [],
      "action_text": "ON SCREEN: it’s a WATER TOWER. It’s certainly similar. Saroo leans in closer to the screen. His finger touches the platform. And the water tower. Working out the angles.  SAROO’S “MEMORY MAP”: FLASHBACK 1 - WATER TOWER (NIGHT)  We PUSH IN on little Saroo, standing frightened on that haunted platform, looking up at the water tower off-screen. REVERSE: we PUSH IN on the water tower.  INT. LIVING ROOM, BEACH HOUSE - CONTINUOUS (NIGHT)  ON SCREEN: zooming, closer, closer. The satellite resolution becoming clearer. That’s a tower. That’s the water tower. The pixels coarsen and blur as the zoom reaches its limit. SAROO  (a breath)  It can’t be - Saroo actually cups his hands over his mouth. His back is ramrod straight. His nerves on fire - - and suddenly, frantically, he scrolls, scrolls, scrolls -  AERIAL - OCHRE FIELDS - DAY  High in the air, we RUSH across the Indian landscape -  INT. LIVING ROOM, BEACH HOUSE - CONTINUOUS (NIGHT)  [NOTE: CONTINUE RAPID INTERWEAVING BETWEEN THE HIGH AERIAL GLIDES & THE GOOGLE SCREEN SCROLLING ...] - ON GOOGLE EARTH SCREEN: as he scrolls, the pointer races across the landscape in jerks: across ochre fields, across rivers, roads ... sometimes the train line is on screen and sometimes not - because Saroo’s not following the track now   -  he   knows   where he’s going - - he’s going HERE: - it’s a DAM. Holy shit. It’s a dam.  SAROO’S “MEMORY MAP”: FLASHBACK 2 - DAM (DAY)  Guddu’s POV: we’re spinning in a circle, holding onto Saroo with outstretched arms as he too shrieks with laughter. WIDE of same: Guddu twirls Saroo around in the shallow water by the dam, tiny Saroo’s feet barely skimming the surface. Guddu lets go, Saroo flies into the water. He jumps up, laughing. Drenched in golden sunlight.  97",
      "dialogue_count": 0,
      "word_count": 575
    },
    {
      "scene_number": 17,
      "slugline": "INT. LIVING ROOM, BEACH HOUSE - CONTINUOUS (NIGHT)  Saroo’s hands are shaking. Fingers on the track pad, urgent. This cannot be happening. He zooms in closer. ON Google Earth screen, more details: the clay shore, the LONG DAM WALL.  SAROO’S “MEMORY MAP”: FLASHBACK 2 - DAM (DAY)  - a beautiful, sun-drenched moment: five-year-old Saroo sprinting homewards, the dam receding behind him (with its LONG DAM WALL). Elation and urgency mixed together.  INT. LIVING ROOM, BEACH HOUSE - CONTINUOUS (NIGHT)  Saroo keeps scrolling, paying 1000% attention. ON SCREEN: he stops on the town. Saroo, scrolling. Eyes attentive to every detail. ON SCREEN: the name hovering above the town is “Khandwa”. SAROO  (it doesn’t ring a bell)  Khandwa?... But his fingers trace across the screen. There’s the STATION -  EXT. STREET NEAR KHANDWA STATION - DAY (FLASHBACK)  Little Saroo continues running home, past Khandwa Station.  INT. LIVING ROOM, BEACH HOUSE - CONTINUOUS (NIGHT)  Saroo, scrolling along - - ON GOOGLE EARTH SCREEN: the UNDERPASS -  SAROO’S “MEMORY MAP”: FLASHBACK 3 - UNDERPASS (DAY)  Little Saroo continues running home - into the underpass - JUMP CUT: - and pops out the other side -  INT. LIVING ROOM, BEACH HOUSE - CONTINUOUS (NIGHT)  Saroo, scrolling frantically. Nose inches from the screen. ON GOOGLE EARTH SCREEN: we scroll OVER the underpass - out the other side - following roads - [NOTE: CONTINUE TO BLEND WITH RAPID FLASHES OF   REAL AERIAL ] - left, right, right - the roads getting narrower ...  98",
      "characters": [],
      "action_text": "And now, at last: a NAME floats above this part of town.  GANESH TALAI  ON Saroo:   what?? WHAT??!!  ON SCREEN: there it is. Floating. “Ganesh Talai”. SAROO Ganesh Talai. Ganesh Talay. Ganestlay. He gasps. Then an involuntary LAUGH comes from deep in his belly. A feeling that this can’t be happening. And now he picks up speed, and scrolls, ever faster - - ON SCREEN: the streets, narrower and narrower -  INT. GANESH TALAI STREETS - DAY (FLASHBACK)  Little Saroo, sprinting, lungs bursting, joyful, homewards -  INT. LIVING ROOM, BEACH HOUSE - CONTINUOUS (NIGHT)  - Saroo, glued to the screen. Scrolling. Left, right. The streets getting narrower. ON SCREEN: a street so narrow it could only be an alleyway.  SAROO’S “MEMORY MAP”: FLASHBACK 4 - ALLEYWAY TO HOME (DAY)  We FOLLOW over little Saroo’s shoulder as he rounds the final corner to the narrow alley to home: past the house with the lurid aqua walls, past the overflowing bougainvillea -  INT. LIVING ROOM, BEACH HOUSE - CONTINUOUS (NIGHT)  ON SCREEN: We stop. Above a nondescript CLUSTER OF SHACKS. We ZOOM, closer, closer. Towards a single specific BUILDING. Closer. Until the pixels coarsen, and the roof is a blur. Saroo, breathing hard. Staring so intently at the screen. That blurry, pixellated roof fills the entire screen. On Saroo, brimming with emotion. SAROO  (very softly)  Ammi ... - that Hindi word, rising up from the deep. JUMP CUT:  99",
      "dialogue_count": 0,
      "word_count": 485
    },
    {
      "scene_number": 18,
      "slugline": "EXT. SHARE HOUSE - SAME NIGHT  Saroo knocks. Lucy comes to the door. They stare at each other. She looks frightened - what’s happened... SAROO I found home... Her face - doubt, belief, joy for him.   Did you just say what I think you said?  Saroo’s eyes, wide in amazement. That’s a   Yes.  Lucy wraps her arms around Saroo. They embrace tightly - - what does this mean for them? Held in that embrace - rocking gently together - Saroo  breathes .  INT. LIVING ROOM, BEACH HOUSE - NEXT DAY  Saroo holds the door open as Sue walks into the room. John, just arrived in his work clothes, stands there, proud as punch - watching his wife. JOHN You need to look at this - Sue enters slowly, mesmerized by something off-screen. Emotions palpably rippling across her face. REVERSE: we follow her as she walks up to the map - it’s still in disarray from Saroo’s flag pin destruction, but you can see how amazing and methodical it was. Sue studies it. The grandeur, the scope, the epic madness - even in its fractured state. Its magnificence. ON Saroo: watching her, anticipating her response. SUE This is where you’ve been? He nods. SAROO I didn’t want you to feel I was ungrateful... Sue takes it all in, astonished. SUE Saroo. She embraces him, overcome with emotion.  100",
      "characters": [],
      "action_text": "SUE (CONT’D) I really hope she’s there. She needs to see how beautiful you are. John joins in the embrace.  INT. QANTAS A380 TO INDIA - NIGHT  Saroo in his window seat on the plane. Peering out, down into the dark earth. Most everyone else is asleep, and the lights are dimmed. But Saroo’s awake, and deep in thought. And just like that five-year-old - twenty-five years ago, heading off to the unknown - he pulls the shade down, up. But only once.  EXT. DREAM QUARRY - DAY (FLASHBACK)  We’re back in our mythic, prehistoric, dust-shrouded landscape. The washed-out whiteness. The white dust. And again, Saroo running across the sun-baked rubble, white with dust himself. Everything so heightened and surreal. SAROO Ammi! Ammi! He’s carrying something close to his chest, like a bright orange heart. He’s beaming, proud. SAROO (CONT’D) Ammi! And there in the distance, Kamla turns again. Shading her eyes against the sun. Covered in the white quarry dust. SAROO (CONT’D) Look what I’ve got! He reveals his offering: in the middle of all that white - a perfect, bulbous MANGO. Glowing in its perfect orangeness. She reaches out her hand. Touches his face in thanks. What an unimaginable treat. JUMP CUT: Saroo and Kamla sit on the rocky ground, devouring the mango. The juice streaks their dust-caked faces. Sucking at the flesh, the nectar. A playful delight coursing through them. SAROO (CONT’D) I threw a rock. I knocked it out of the tree!  101 KAMLA  (grinning, nodding)  Good boy.  I/E. TAXI / ROAD FROM INDOOR TO KHANDWA - DAY  Saroo in the back seat of the taxi. Peering intently out the window at the landscape rolling by. The fields. The small towns.  INT. HOTEL ROOM, KHANDWA - DAY  We FOLLOW CLOSE behind Saroo as he enters his hotel room and throws the backpack on the bed. Saroo at the window. Looking down on the bus terminal and - further away - train station from this third floor room. POV: all the mad activity down there in the streets.  INT. HOTEL ROOM, KHANDWA - TWENTY MINUTES L",
      "dialogue_count": 0,
      "word_count": 1827
    },
    {
      "scene_number": 19,
      "slugline": "INT. JOHN AND SUE’S BEDROOM - EARLY MORNING  Sue, sitting up in bed - holding her mobile, listening to the message on speakerphone, John beside her listening too - as tears well in their eyes. SAROO’S VOICE ON SPEAKERPHONE My mother thanks you both for raising me. She understands you’re my family. She’s happy just knowing I’m alive.  (long beat)  I found Ammi. But that doesn’t change us. I love you, Mum. So much. And you, Dad. And Mantosh. We’re a family.  EXT. DAM, KHANDWA - LATE AFTERNOON  Saroo stands there by the dam. Taking it all in. He turns.   Up ahead: that ridge where the railway track runs. Saroo starts walking up the embankment to the track.  EXT. RAILWAY TRACKS, NEAR DAM - MOMENTS LATER  Saroo is walking TOWARDS US along the tracks. Stepping on every second sleeper. The dam over there, B/G. REVERSE: MATCH SHOT so it feels like a normal reverse, BUT - ON THE REVERSE: it’s twelve-year-old Guddu and five-year-old Saroo, walking AWAY FROM US down that long stretch of track. Guddu’s arm draped over Saroo’s shoulder. Saroo dragging a stick behind him,   clack-clack-clack   along the sleepers. They’re literally walking off into the sunset. And we CUT TO AERIAL:  HIGH AERIAL - KHANDWA AND BEYOND - CONTINUOUS  - We’re RISING UP into the air - we’re leaving them now - we’re going HIGH - HIGHER - we’re SOARING UP AND AWAY - We’re very HIGH - they’re TINY SPECKS - we’re FADING TO BLACK. In the blackness, SUPERS come up, one after the other:  Saroo Brierley made it back to Ganesh Talai on February 12, 2012. He’d been lost for over 25 years.  108",
      "characters": [],
      "action_text": "He learned that 25 years earlier, on the same night he stepped up into that carriage, his brother Guddu died - hit by a train not far from the platform. Saroo’s mother, Kamla, had never given up hope of Saroo’s return, and had never moved away. She said she was “surprised with thunder” that her boy had come back, and that the happiness in her heart was “as deep as the ocean.” Saroo learned that all those years ago, as a five-year-old, he had been mispronouncing his own name. He was “Sheru” - - “LION”  AND SLAM INTO: - that police station PHOTO of 5-year-old Saroo - the REAL PHOTO, not our actor - We PUSH slowly, slowly CLOSER AND CLOSER into the photo - - into those huge, determined eyes. CUT TO BLACK. [NOTE: at some point soon after CREDITS start rolling, they share the screen with the   60 Minutes   footage of Kamla and Sue meeting and embracing, Saroo joining the embrace - and various other real photos etc ...]  109 F O R   Y O U R   C O N S I D E R A T I O N  www.TWCAwards.com BEST ADAPTED SCREENPLAY  Luke Davies",
      "dialogue_count": 0,
      "word_count": 477
    }
  ]
}