{
  "slug": "live-by-night-2016",
  "title": "live by night",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 21,
  "characters_count": 3,
  "characters": [
    "DION",
    "RD PRUITT",
    "ALBERT"
  ],
  "total_words": 26424,
  "total_dialogue": 3,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. GILLETTE FACTORY - NIGHT Women getting off work pour out of the factory. Some head toward South Station, others toward a barge turned speakeasy down on the dock. JOE (V.O.) Somehow I already felt connected to her. She was Albert White’s girl--but still I thought it might be fate. EMMA emerges from the crowd of women. Joe follows her. JOE (V.O.) Then fate proved me right. EXT. SOUTH STATION - MOMENTS LATER Joe follows Emma into South Station and onto a train. INT. TRAIN, TRAVELING THROUGH THE CITY - CONTINUOUS It clacks along. Joe looks at Emma from afar.   She gets off at her stop--SAVIN   HILL, DORCHESTER. JOE (V.O.) Savin Hill. No wonder she hadn’t gotten rattled with a gun pointed at her. Over here they stirred their coffee with the barrel of a .38. EXT. DORCHESTER STREETS - LATER Joe follows her from a discrete distance. She turns into the doorway on the LOWER LEVEL OF A BUILDING. Joe observes a SLAT OPENING and she says something he can’t make out. The door opens and she is let in. Joe comes to the door, knows he can’t get in without whatever code word she said, the place is clearly a speakeasy. Joe HIDES NEXT TO THE DOOR and waits. Along comes a disheveled looking man to the door. The slat opens. DISHEVELED MAN (into slat) Blacksmith. The door opens.  5.  (CONTINUED)",
      "characters": [],
      "action_text": "Joe waits a beat, looks both ways, seeing no one he approaches the door and knocks. The SLAT OPENS. A BALD MAN WITH A CAULIFLOWER NOSE appears. BALD MAN What? JOE Blacksmith. The door opens. INT. SPEAKEASY - CONTINUOUS This is an unfinished basement with a wood bar in the center of a dirt floor. Joe sits down at the bar. Pulling a kerchief over her head, EMMA EMERGES FROM THE BACK. EMMA You want a beer? JOE Yeah. She pulls out a beer. They don’t seem to have anything else. The place is a dump. EMMA (gives him beer) Who told you about the place? JOE Dinny Cooper. Joe instantly regrets that poor choice of first name. EMMA Dinny? (squints) Don’t know him. JOE He’s from Everett. (beat) Said you served good beer. EMMA Now I know you’re lying. JOE Because he said the beer was good? EMMA Butter doesn’t melt on your tongue, does it?  6.  CONTINUED:  (CONTINUED) JOE I’m not lying miss, but if you want me to leave it’s not a problem. EMMA Now I’m supposed to be impressed that you said you’ll leave and put you as a clear-talk-Charlie? JOE Nope. EMMA Come here. She beckons him closer and talks in his ear. EMMA See those guys over in the corner? They’re my cousins. Know what they do for work? JOE Nope. EMMA They find guys like Dinny Cooper and beat the life out of ‘em. Then they throw them in the river. JOE Nice occupation. EMMA Beats robbing poker games. Joe is frozen. EMMA Say something clever. About putting things in my mouth. Joe is still not moving, assessing the situation now. EMMA They’re watching us right now. If I pull my earlobe you don’t make it out the door. JOE What if I pull this trigger? We see Joe has produced a GUN and is holding it between them. She holds her look to him for a nice long while.  7.  CONTINUED:  (CONTINUED) EMMA I get off at midnight. INT. EMMA’S APARTMENT - LATER Joe and Emma make out in a rather ordinary working class flat in 1927. JOE (V.O.) As soon as I kissed her, there was nothing I wouldn’t do. MONTAGE Joe and Emma- Joe and Emma have sex i",
      "dialogue_count": 0,
      "word_count": 2143
    },
    {
      "scene_number": 2,
      "slugline": "INT. EMMA’S APARTMENT - NIGHT Emma and Joe can see their breath, no heat. The apartment’s only virtue is being empty tonight. JOE And go where? EMMA Somewhere warm. JOE My brother Danny’s out in California. EMMA Where? JOE I haven’t seen him in ten years. EMMA I’d go to California. JOE I don’t know much about honest work. EMMA Who says it needs to be honest? We do what we want to do. Go where we want to go. Sleep by day, live by night. He looks at her, won over. JOE We got this job on Saturday. You free Saturday? EMMA To leave? JOE Yeah. EMMA I have to see you-know-who on Saturday. JOE Fuck him. EMMA That’s the idea. Quiet.  17.  (CONTINUED)",
      "characters": [],
      "action_text": "EMMA What’s the alternative. You want me to end up in the Charles? Joe says nothing. EMMA I’m supposed to meet him at the Statler on Saturday. Turns him on to see me when his wife’s on his arm. After that he’s going to Detroit for a week. Can you clean yourself up and get to the Statler by seven? JOE I should be done by then. EMMA Sure? JOE (smiles) I wouldn’t lie to you. EXT. PITTSFIELD BANK - SATURDAY MORNING The Bartolo Brothers come CRASHING OUT THE DOOR TO THE BANK and jump in Joe’s waiting GETAWAY CAR. JOE (V.O.) It’s true I was thinking about her. But I was always thinking about her-- so it’s possible I would have fucked up, anyway. Joe tries to put it in drive but instead BACKS UP and SMASHES INTO A LAMPPOST. DION Fuck! Joe drives FORWARD as a GUARD emerges from the bank. He extends his arm and Joe can see it jumping in the rear view. The side mirror SHATTERS and the glass falls to the dirt street. Joe picks up speed. Turns east into an alley and turns again parallel to the railroad tracks. Joe crosses the tracks and pulls up to a burned out FOUNDRY. TWO CARS ARE WAITING.  18.  CONTINUED:",
      "dialogue_count": 0,
      "word_count": 340
    },
    {
      "scene_number": 3,
      "slugline": "EXT. FOUNDRY - CONTINUOUS The guys all jump out. Dion TURNS ON JOE, GRABS HIM. DION What the fuck is wrong with you? JOE Get your hands off me. DION You’re fucking up. Joe takes the HATS and KERCHIEFS AND GUNS and puts them in A BAG. He puts the bag in the back of the ESSEX COACH. JOE I know. FOUR POLICE CARS EMERGE FROM A WALL OF BROWN WEEDS behind the foundry revealing a SMALL TENT COMMUNITY behind them. Joe jumps into the Essex and takes off. The Bartolo brothers take off in the Cole, back end sliding as they hit dry dirt. Dirt covers Joe’s windshield. When he leans out to wipe it off he feels a BITE on his ear. When he leans back into the car he reaches up to feel that his EAR HAS BEEN NICKED. Blood starts to run down his jacket. PINGS and THUNKS hit the back window. The WINDSHIELD BLOWS OUT. From inside a cruiser a TOMMY GUN SHOOTING OUT. The cruiser on his right TURNS TOWARD HIM, hits something and RISES UP LIKE LIFTED BY A GUST and lands on its side. The cruiser behind RAMS HIM. He sees a BOULDER in front of him. Joe CRASHES INTO THE BOULDER and is THROWN FROM THE CAR. He SLIDES FIFTY FEET ACROSS CONCRETE, passing out. Joe lies there, covered in glass and pine needles and blood. SMOKE rises through the trees, black and oily. He sees the CRUISER lying on its side. Joe comes across a SERIES OF BURNING TREES. He follows along with them and comes to a POND. EXT. POND - CONTINUOUS He see steam curl along the edges. The POLICE CRUISER had ENTERED THE POND ON FIRE.  19.  (CONTINUED)",
      "characters": [],
      "action_text": "It now sits in the middle of the pond, water up to the windowsills, the rest of it charred, flames still dancing on the roof. The DRIVER hangs out his door. The only thing not charred black about him are his eyes. Joe approaches the car. Looks in. No one else there. He turns and sees behind the car THE OTHER POLICEMAN. Charred and dead, halfway crawled out from the pond. His arm reaches out. JOE (V.O.) He pointed at me like an accusation. The last termite. EXT. K STREET, SOUTH BOSTON, COUGHLIN FAMILY HOME - NIGHT JOE (V.O.) I stole a car in Lenox and replaced it with a Dodge 126 I found in Dorchester. Drove it to my childhood home and considered my options. The Coughlin home is stately. Joe furtively gets out of a car and walks toward it. JOE (V.O.) A woman once asked me how I could come from such a magnificent home. I told her, I came from a magnificent house, not a magnificent home. CLOSE ON: NEWSPAPER HEADLINES: 3 MASS OFFICERS BRUTALLY SLAIN 3 SUSPECTS, next to which are startlingly accurate renditions of Joe and the Bartolo brothers. JOE (V.O.) It was in all the late editions. INT. COUGHLIN FAMILY HOME, FOYER - CONTINUOUS Joe PUTS DOWN THE NEWSPAPERS on a piece of furniture. JOE (V.O.) The real reason those cops were dead was that one of them had been stupid enough to fire a Tommy gun bouncing across open ground. Joe heads upstairs. In a series of shots we see him:  20.  CONTINUED:  (CONTINUED) CHANGING WASHING PUTTING ON A NEW SUIT JOE (V.O.) The third dead cop was a trooper who pulled someone over near the state forest. Shot once in the stomach and twice in the skull. Had to be Dion. INT. THOMAS COUGHLIN’S OFFICE - CONTINUOUS Joe enters goes right for a PLACE ON THE FLOOR. He PULLS UP THE RUG. JOE (V.O.) My father would have seen the pictures by now. He would have seen his son. Party to a cop killing. Joe opens the safe. We reveal BRICKS AND BRICKS OF MONEY. JOE (V.O.) Years of kickback and graft. My father was more of a criminal than I would ever be. I let h",
      "dialogue_count": 0,
      "word_count": 786
    },
    {
      "scene_number": 4,
      "slugline": "INT. STATLER HOTEL LOBBY - CONTINUOUS The Statler was the first hotel in the world to offer in- room radio. It has an extraordinarily baroque lobby. Champagne flows from a fountain in the lobby.   The lobby is filled with every dignitary Boston has to offer. Joe sees ALBERT WHITE and his WIFE. EMMA is just below them, scanning the crowd subtly. She sees him and her eyes light up. She TILTS HER HEAD toward the side of the lobby. Joe heads there immediately. He LOSES her in the crowd. And a guy with a HERALD EXAMINER BADGE seems to recognize Joe as he passes him moving through the crowd. REPORTER (to Joe) Excuse me. Excuse me! At the bottom of the stairs he MEETS UP WITH EMMA. It’s all he can do not to wrap her up in his arms. JOE Keep going. They walk more intently now, pushing their way through. EMMA There’s a service elevator up here.  (beat) I can’t believe you came. JOE What else was I gonna do? EMMA Run. JOE Where? EMMA I don’t know. It’s what people do. JOE It’s not what I do. They turn the corner, from lobby into the SERVICE AREA. INT. STATLER HOTEL SERVICE AREA - CONTINUOUS More waiters and workers moving quickly. Joe and Emma make their way through. EMMA Left, left.  22.  (CONTINUED)",
      "characters": [],
      "action_text": "They go a few more steps and reach the entrance to the service elevator. EMMA (pushing buttons) Shit, shit, shit. The door finally opens and they get in the elevator. INT. ELEVATOR - CONTINUOUS As soon as the doors close they grab one another, kissing groping, releasing of all the fear and pent-up energy. He sees tears coming down her face. JOE Why are you crying? EMMA Because I love you. JOE Then smile. EMMA I can’t. THE ELEVATOR HAS STOPPED. Joe is confused, then it dawns on him. JOE No-- The door is PULLED OPEN BY BRENDAN LOOMIS who yanks JOE OUT BY HIS TIE and REMOVES HIS GUN. Brendan starts HITTING JOE IN THE FACE so mercilessly it’s hard to watch. CRUNCH, we hear Joe’s nose break. Loomis keeps hitting him. He drops Joe on the floor and KICKS HIM IN THE STOMACH repeatedly, the he walks around behind him and KICKS HIM IN THE BALLS. Joe vomits, lying there helpless. He looks up to see ALBERT WHITE. ALBERT I’m sure as you die you’ll tell yourself you did it for love. No, you feel guilty about what you do. So you spent your life hoping someone will punish you for your sins. Well... here I am.  23.  CONTINUED:  (CONTINUED) Albert smiles. Joe rolls on his side in broken agony. When he looks up, he sees something that he wishes he hadn’t: EMMA GOULD on the arm of ALBERT WHITE. EMMA (whispers) I’m sorry. ALBERT She’s sorry. We’re all sorry. (gestures to someone) Take her out of here. EMMA (being escorted) You said you wouldn’t kill him. Albert says nothing. EMMA Albert, that was the deal. ALBERT Don’t worry. EMMA I would never have brought him here if I-- Albert SMACKS EMMA ACROSS THE FACE. ALBERT You think I’m going to be humiliated by a whore? You been replaced. Get me? Someone comes to me, says this asshole’s putting horns on my fucking head? You’re lucky I didn’t cut your tits off and put you in the fucking dump. (indicates) Put her in the fucking car, Donnie. Now. She kicks and scratches at Donnie’s head. EMMA Joe I’m sorry! And she’s gone. A moment of silence. JO",
      "dialogue_count": 0,
      "word_count": 1694
    },
    {
      "scene_number": 5,
      "slugline": "INT. SUFFOLK PRISON, HALLWAY - LATER Joe walks the halls, handcuffed, escorted by two OFFICERS and his father, who gives him his parting wisdom, sotto voce. THOMAS COUGHLIN Someone will threaten you the first week. You’ll see what he wants in his eyes. Someone else will stand up for you. He’ll back the other man down and offer you protection. That’s the man you hurt. You hurt him so he can’t gets strong enough to hurt you. JOE And then they leave me alone? THOMAS COUGHLIN No. JOE When will it stop? Thomas looks straight ahead. Avoiding Joe. THOMAS COUGHLIN Never. JOE (V.O.) The next day I would be transferred to the most notorious prison in the country. INT. PRISON BUS - DAY The bus rambles along. Four PRISONERS are shackled to the floor. A fat RUSSIAN, a BLACK MAN, Joe and a SOFT KID named NORMAN who talks out loud, nervous. NORMAN I been reading the Bible and it says there’s good in even the lowest man so I wouldn’t be surprised to find more good behind these walls that outside but I-- The bus PULLS INTO THE GATES OF THE PRISON. The bus stops and a GUARD, MR. HAMMOND gets on and begins unshackling the men. MR. HAMMOND My name is mister Hammond. You will all be housed in the east wing except the nigger who will be in the south with his kind. Never look a guard in the eye.  31.  (MORE)   (CONTINUED)",
      "characters": [],
      "action_text": "Never touch yourselves or others in an unwholesome manner-- Norman starts to shiver and bubble, tears rolling off his face like sweat. JOE Don’t do that. INT. CHARLESTOWN PRISON CORRIDOR - LATER Joe walks down a row in the worst prison you’ve ever seen. We see DEGENERATES in their cells as Joe passes by. He reaches his cell and the GUARD opens the door. We reveal three CELL MATES: OLIVER, EUGENE and TOOMS. JOE (V.O.) Oliver and Eugene were stickup men and we knew enough people in common not to try to turn me out to make a statement. Joe looks around as his cell mates stare, puts his stuff on a lower bunk. Sits, it sags. He sees a BUCKET FULL OF PISS AND SHIT. JOE (V.O.) Tooms was one of those, you let him be and hoped he did you the same. Tooms staring blankly at Joe, then turns away. EXT. CHARLESTOWN PRISON YARD - DAY Joe walks through the yard. Hundreds of CONVICTS mill around. They entirely avoid Joe. Whoever he walks towards moves off in another direction. He sees NORMAN approaching. Both his eyes are black and his nose looks broken. Joe is about to say something to him when Norman ATTACKS. He throws a punch to Joe’s neck. Then another and another. It becomes a full out brawl. JOE (V.O.) My ribs were still broken and every shot they took it felt like fire. Above we see guards with rifles watching. Norman hits Joe again in the ribs. Joe brings his foot down on Norman’s knee and turns it at an odd angle.  32.  CONTINUED:   MR. HAMMOND (CONT'D)  (CONTINUED) Joe brings in down on his knee again and the whole yard hears it CRACK. Norman lies there crying and wailing. JOE (V.O.) I could have helped him up but that would have been seen as weakness. We see other convicts eyeing Joe. JOE (V.O.) Norman was nothing. Norman was a warm up. INT. JOE’S CELL CHARLESTOWN PRISON - LATER Joe returns to his cell to find it EMPTY. He turns to the guard. JOE Where’d they go? GUARD They went. INT. CHARLESTOWN PRISON, SHOWER LINE - DAY Joe is standing in line with a bunch of other inma",
      "dialogue_count": 0,
      "word_count": 893
    },
    {
      "scene_number": 6,
      "slugline": "EXT. CHARLESTOWN PRISON YARD - DAY Again, Joe is walking the yard alone. A BIG CONVICT comes toward him. We see on Joe’s face that this might be his last fight. He TIGHTENS his shirt around his ribs as the guy approaches. He takes a swing that Joe DUCKS but the next one hits him square in the body. And another. Joe sees stars. He tries to fight defensively but another SHOT from the big guy staggers him back. The big guy approaches when he is BLIND SIDED. Two HUGE ITALIANS hit the big guy high and low. Six or seven shots make short work of him. They walk off as if nothing happened. Joe is panting, barely on his feet. MASO Joseph? JOE Joe. MASO My name is Thomas Pescatore but everyone calls me Maso. He puts his ARM AROUND JOE. People in the yard clock this. MASO Consider yourself under my care. Do you know who I am? JOE Maso Pescatore. You run the North End and liquor coming up from Florida. Your only real rival is Albert White. (beat) And I didn’t ask to be under your care. MASO How many things, good or bad, come to us whether we ask for them or not? He removes his arm, Joe sees cunning in Maso’s eyes. MASO Call me mister Pescatore from now on, Joseph. And give this to your father. Maso walks away leaving Joe looking down at the paper. It reads:   1417 Blue Hill Ave.  35.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 251
    },
    {
      "scene_number": 7,
      "slugline": "INT. CHARLESTOWN PRISON VISITING ROOM - DAY Joe sits across from his father, obvious discomfort. THOMAS COUGHLIN What happened? JOE Guy stabbed me in the leg. Joe SLIDES HIS HAND ACROSS THE TABLE. Thomas sees the PIECE OF PAPER in it. He covers it with his own hand. He takes the piece of paper and places it in his own pocket. THOMAS COUGHLIN I’m to do someone’s bidding? Joe looks up at his father. JOE Maso Pescatore’s. Thomas squints. THOMAS COUGHLIN You’re asking me to get under the thumb of a bunch of Dagos one step removed from a cave. JOE They said its a one time thing. THOMAS COUGHLIN I would be wedded to the Pescatore mob for life. A people that had brought to the shores of this country anarchism and bombings-- and who had overtaken by force the business of illegal liquor. I’m supposed to work for them? Kiss their Dago rings? EXT. CHARLESTOWN PRISON - LATER Thomas makes his way out the gates. Smoke rises from factory stacks. JOE (V.O.) My father knew. You went in a man and left a beast. If you left at all. 1417 Blue Hill was a storage center for the Jew mobs who worked for Albert White in Mattappan. Maso wanted them destroyed.  36.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 215
    },
    {
      "scene_number": 8,
      "slugline": "INT. CHARLESTOWN PRISON VISITING ROOM Joe looks out the window while he is shackled for his return to the cell. EXT. K STREET, SOUTH BOSTON, COUGHLIN FAMILY HOME - DAY Thomas is up on a ladder, fixing some shutters on the second floor of the house. A BLOND FELLOW strolls down the street. He stops at the base of Thomas’ ladder and puts his hand on it. BLOND MAN Sorry. I’m a bit lost. Thomas’ instincts tell him something isn’t right. He sees the man’s HAND holding the ladder. BLOND MAN Do you know where the bathhouse is? Thomas can see the bathhouse from his vantage, it’s a block away. THOMAS COUGHLIN End of the street. BLOND MAN Thanks. Sometimes I can’t get out of my own way. You know what I mean? Thomas waits, holding the look. BLOND MAN They won’t kill him. THOMAS COUGHLIN Excuse me? BLOND MAN They’ll make him wish they did, though. Every day of his life. (beat) He’ll think about suicide. But they’ll keep him alive by promising to kill you. And every day they’ll think of a new thing to try on him. (beat) Afternoon. And he strolls away, leaving Thomas to look after him.  37.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 204
    },
    {
      "scene_number": 9,
      "slugline": "INT. K STREET, SOUTH BOSTON, COUGHLIN FAMILY HOME - DAY Thomas is on the phone, holding the PAPER. We don’t see the other side of the conversation. THOMAS COUGHLIN 1417 Blue Hill Avenue. Supposed to be a warehouse for gaming parlors. (beat) To the last bottle. EXT. MATTAPAN LIQUOR WAREHOUSE - DAY POLICE STORM IN, SMASHING HUNDREDS OF BOTTLES OF LIQUOR. The workers stand by and watch it happen. The violence segues to: EXT. CHARLESTOWN PRISON - NIGHT A FULL SCALE RIOT is taking place under the aegis of a protest. Signs: “free Sacco and Vanzetti” and crowds roar. INT. CHARLESTOWN PRISON JOE’S CELL - SAME Joe lies in bed. He can hear the throng. Then the lights DIM and CRACKLE and SNAP OFF on a number of tiers. Over Joe’s V.O. we see: 1. An inmate getting jumped and having someone STUFF MATERIAL IN HIS EYES. 2. A dead inmate, riddled with stab wounds, hung up like a crucifixion. 3. A young man running like a terrified rat, two LARGER men corner him. JOE (V.O.) The penitentiary spilled blood on itself that summer. A guy stabbed so much they perforated his liver.. Another had shards of glass stuffed in his eyes. And you could hear the rapes upstairs at night. These images play   along with the voice over.  1. Albert White, running his empire. 2. Rum trucks burn like Viking funeral boats. 3. A man has a shotgun put to his jaw-- the trigger is pulled.  38.  (CONTINUED)",
      "characters": [],
      "action_text": "4. A GUARD sits on a park bench, throat slit. Frozen in a death mask. 5. A BUTCHER SHOP EXPLODES, taking the buildings next door with it-- a hairdressers and a haberdashery. 6. A man is HURLED FROM THE ROOF of a building. JOE (V.O.) There was a war going. Over rum. Albert White, deiced to go after Maso while he was in prison. It was the deadliest summer in the history of Boston. They shot it out in town and along the Canadian border.   One of White’s drivers sassed one of Maso’s guys and they blew off his jaw at the hinge. White’s gang set fire to trucks. One night a guard on Maso’s payroll went home with a girl no one had seen before. Maso responded by taking care of Albert’s butcher shop front on Morton street. (beat) No winner. Just a lot of mess. EXT. CHARLESTOWN PRISON ROOFTOP - DUSK The sun is setting and we see an orange moon, as big as the sky itself, is on the rise over the factory smokestacks and fields of ash and black poison. Joe and Maso walk across the roof, Maso’s privilege is to walk the rooftops in the evening-- a small measure of quiet. Joe is his guest tonight. Maso HANDS JOE A PIECE OF PAPER. Joe takes it and furtively tucks it into his coat. MASO Open it. Joe looks at him. Takes the paper out. Reads it. There are two words:   Brendan Loomis . MASO He was arrested last night. Beat a man. They both wanted the same coat. He’s Albert’s right hand. I don’t want it returning to Albert’s right wrist. JOE I know him.  39.  CONTINUED:  (CONTINUED) MASO You hate him? JOE Yes. MASO Good. Give that note to your father. THOMAS COUGHLIN (PRE-LAP) No. INT. CHARLESTOWN PRISON VISITING ROOM - DAY Joe sits across from Thomas. THOMAS COUGHLIN I don’t do murder for hire, Joseph. JOE That’s not what they’re asking. THOMAS COUGHLIN If they give you the name of a man in police custody, they want him found hanging in his cell or shot in the back trying to escape. (beat) Joseph I need you to hear exactly what I have to say. Joe senses a change come over his father. THOM",
      "dialogue_count": 0,
      "word_count": 855
    },
    {
      "scene_number": 10,
      "slugline": "INT. CHARLESTOWN PRISON JOE’S CELL - LATER Joe walks down the corridor and turns into his cell. What he sees makes him STOP. The beds are gone and all the mattresses are on the floor. Three men play cards on the floor. Two are grungy nobodies and the third is BASIL CHIGGIS (30). JOE (V.O.) The guy in the middle was named Basil Chiggis. He ate the fingers of a kid he killed in Weymouth. He would die in prison. The other two I’d never seen before. The men are playing poker with CHICKEN BONES boiled white. “Raise” and “fold” are accompanied by the click- clack of the bones. GUARD Lights out! CHUNK! The lights go out in the cell. Each man lies on his mattress. They lie there,   breathing.  As Joe’s eyes adjust to the dark, he can see all three men STARING AT HIM. JOE (V.O.) Even if I had a shank I couldn’t kill all three of them.   If I said anything I would be begging. And they would just laugh before they killed me. In a flash the three of them move toward Joe, producing SHANKS and holding him down. Knives to his throat. Joe doesn’t move. The door to the cell opens and EMIL LAWSON comes in. JOE (V.O.) Emil Lawson. He was the ringleader of the rape parties upstairs. EMIL LAWSON (to Joe) They said you were pretty. He looks down at Joe, frozen with a shank to his neck. EMIL LAWSON What’s your daddy supposed to do? Joe is silent.  42.  (CONTINUED)",
      "characters": [],
      "action_text": "EMIL LAWSON Answer me or I’ll pluck out an eye and feed it to Basil. A long beat. JOE Brendan Loomis. EMIL LAWSON You’re gonna tell the first Pescatore hood that you know when Loomis is going to be taken care of and he also found out where Albert White is sleeping. And you got the address but you only want to give it to him. Face to face. Emil Lawson handed Joe something wrapped in an oilcloth. He unwraps it to reveal a long SHANK. EMIL LAWSON When you get close enough to Pescatore, you drive that through his fucking brain. JOE I thought you worked for him. EMIL LAWSON I did some jobs for him but now someone else is paying. JOE Albert White. EMIL LAWSON He’s my boss. And now he’s your boss, too. EXT. K STREET, COUGHLIN HOME, BACK YARD - DAY Thomas walks through his garden and takes a seat in his chair. He looks out over the things that have grown in his garden. He feels something and sets down his drink. EXT. CHARLESTOWN PRISON YARD - DAY Joe has found Hippo on the yard. His English is bad. JOE He gave me an address. HIPPO Whose?  43.  CONTINUED:  (CONTINUED) JOE Albert White. HIPPO So give it to me. JOE Tell Maso I’ll bring it to the wall tonight. Hippo looks at him and Joe walks away across the yard. INT. CHARLESTOWN PRISON JOE’S CELL - LATER Joe is now alone in his cell. He THROWS UP. JOE (V.O.) I had the shank tied to my arm and was supposed to move it to between my ass cheeks for the search. We hear a GUARD come to the cell. GUARD Coughlin. You have a visitor. JOE Who? GUARD Said he was your brother. INT. CHARLESTOWN PRISON VISITING ROOM - LATER Joe’s brother, DANNY (mid 40’s), enters the room. He wears a battered three piece suit and looks like a man who had been on the road a while.   He sits. DANNY You look like shit. JOE I’m in prison. What’s your excuse. DANNY Still beat your ass. JOE I don’t know. Learned how to fight dirty in here. Danny has a small smile, he HUGS HIS BROTHER. These men clearly love one another very much. GUARD SIT DOWN, NO CONTACT!  44.",
      "dialogue_count": 0,
      "word_count": 1231
    },
    {
      "scene_number": 11,
      "slugline": "INT. CHARLESTOWN PRISON CORRIDOR - NIGHT We start TIGHT ON THE TOP OF THE CRACK OF JOE’S ASS. A SHANK BOBBING BACK AND FORTH, HELD THERE WHILE HE WALKS. Joe is being led by the same GUARD, who seems in a hurry and keeps getting ahead of Joe. He sees each cell being mopped by a CONVICT-TRUSTEE. JOE (V.O.) I started wondering where all the guards were. On nights when Maso walked the walls they kept it light up here but not every guard was on Maso’s payroll. We see a CLOSER LOOK AT THE CONVICT-TRUSTEES. They are the KILLERS who attacked Joe in his room. JOE (V.O.) Basil’s pointy head tipped me. And the guy pushing the bucket in the tenth cell was Don Pulaski, who burned his wife and kids alive in their fruit cellar. At the end of the hall Joe encounters MASO’s MEN, Hippo and Naldo Aliente. NALDO Hands up. I gotta frisk you. He pats Joe down. We see the HANDLE OF THE SHANK peeking up. Nalso GRAZES it. Doesn’t seem to notice. NALDO He’s clean. Joe goes to pass Hippo, who stops him. HIPPO Your life goes as the old man’s goes. Understand? JOE (V.O.) Whatever happened to me and Pescatore, these men were in the final moments of their life, right now. Naldo opens a door, behind which is a SPIRAL STAIRCASE. EXT. CHARLESTOWN PRISON ROOF - NIGHT Joe emerges from the trap door. He raises an ARM. The spotlight scans him, then goes left, then goes right. All clear.  49.  (CONTINUED)",
      "characters": [],
      "action_text": "Joe sees Maso twenty feet away. He transfers the SHANK into his hand. Joe walks up to Maso who is smoking a cigarette and looking away from him. MASO I’m sorry about your father. This stops Joe cold. JOE What are you sorry about? MASO No man should ever be asked to do what’s against his nature. Joseph. Even to help a loved one. But what’s fucking fair in this world? He took a long drag on his cigarette. MASO I won’t ask anything so hard of you or your father again. I promise you that. JOE Sure you will, Maso. MASO Mr. Pescatore, Joseph. JOE My apologies. With that Joe GRABS MASO’S ANKLES, FORCING MASO OUT OVER THE LEDGE. JOE You scream, I drop you. He stops struggling. JOE Do you have any weapons on you? MASO Yes. JOE How many? MASO Just one. Joe DROPS him a little. Maso WAVES HIS ARMS like he’s going to take flight. Then he whimpers.  50.  CONTINUED:  (CONTINUED) MASO Two. JOE Where? MASO Razor at my ankle, nails in my pocket. Joe yanks the razor out and tosses it. He pulls a set of BRASS KNUCKLES WITH NAILS out of Maso’s pocket. JOE Maso, if I open my fingers, you’re just another dead Guinea. MASO I...I saved you. JOE So you could get to my father. MASO What do you want? His voice is starting to flutter from lack of oxygen. JOE You ever hear of Emma Gould? MASO No. JOE Albert White killed her. MASO I never heard of her. He PULLS Maso up and flips him on his back. Maso lies there, panting. JOE My father died today. Heart attack. I blame myself. I blame you, too though. MASO So kill me. JOE That’s what they want me to do. MASO Who?  51.  CONTINUED:  (CONTINUED) JOE Lawson. He’s got Basil, Chiggis, all his carny freaks. Your guys are tits up by now. MASO You think they’ll let you live? JOE I know Albert. This was his peace offering. Kill Maso and get back on the team. MASO Why don’t you? JOE I don’t want to kill you. I want to kill him. MASO You have my blessing. JOE Don’t need it. MASO So, how do we get back down there? JOE Any of the tower guards faithful to you? M",
      "dialogue_count": 0,
      "word_count": 1237
    },
    {
      "scene_number": 12,
      "slugline": "INT. JOE’S CELL CHARLESTOWN PRISON - DAY Joe sits in a chair. Maso is opposite him, flanked by two thugs. We see Joe’s STUFF IS PACKED. JOE (V.O.) It took Maso three months but he managed to buy out my sentence. MASO It’s hot down there. JOE I don’t mind hot. MASO You ain’t never felt hot like this hot. But judges don’t come cheap. You have to work that off. JOE Why don’t we call it even for not killing you? Maso narrows his eyes. MASO Our friend Mr. White is in Miami. He wants the whole state. I want to take it back from him. I want you to get the rum running again and get a piece of the narcotics. Starting in Tampa. JOE Lou Orimo runs Tampa. MASO He’s gonna decide he doesn’t need the headache. JOE When’s he gonna decide that? MASO Ten minutes after you get there. JOE Look, I need someone I can trust down there. MASO Who? Joe looks at Maso. MASO You sure.  56.  (CONTINUED)",
      "characters": [],
      "action_text": "JOE I’ll vouch for him. Maso takes a beat. Considering... okay. MASO Where is he? JOE Montreal is what I heard. Maso nods. MASO You go down there, make it right, spend the rest of your life living like a king. JOE So, if I take over are we equal partners? MASO No. JOE But Lou Orimo’s an equal partner. MASO Look what’s gonna happen to him. JOE I want thirty percent. MASO Twenty. JOE Okay. Twenty five. MASO You know there’s only two ways to fuck this up. Get killed or try to get funny and get killed. JOE I’m the most loyal guy you’ll ever have. ‘Cause even if you make me hate you, I’ll always hate him more.  (beat) You live with an Irishman in your crew? MASO I’m in prison. I’ve lived with worse.  57.  CONTINUED:",
      "dialogue_count": 0,
      "word_count": 315
    },
    {
      "scene_number": 13,
      "slugline": "EXT. CEDAR GROVE CEMETARY, AUTUMN - DAY The cemetary is now completely empty, in contrast to the multitude of mourners we saw before. Joe stands quietly before a stone we can’t read. JOE (V.O.) My father was gone. And I was no longer a son. BLACK TITLE:   Part II. Ybor. 1929-1933  EXT. TAMPA UNION STATION - DAY We can feel the SWELTERING HEAT. People on the platform are covered in sweat. JOE steps off the train. He looks around. He sees an incredibly beautiful woman (GRACIELA) walk past him, she is an exquisite mix of ethnicity-- Latin and Afro-Cuban. JOE (V.O.) Maybe it was the two years in prison but I was slower than usual and she caught me looking. She sees him and then looks away. JOE (V.O.) I wanted to tell her she had nothing to fear from me. I was out of the heartbreak business. Joe is LIFTED in the AIR, spun around and put down. He knows who it is before he lands. JOE Dion. There stands his old partner, Dion, wearing a lavender shirt and a three-piece suit. DION Joseph. Dion SQUEEZES him again-- so hard Joe fears for his spine. DION (whispered) Sorry about your father. JOE Sorry about Paulo.  58.  (CONTINUED)",
      "characters": [],
      "action_text": "DION Thank you. Dion grabs Joe’s bags and they head toward the parking lot. DION When Lefty Downer found me in Montreal and told me the Pescatores wanted me to come work for them I thought it was a straight bamboozle. Joe smiles. DION Then I thought if anyone could charm the devil, it was my old partner. (slaps Joe’s shoulder) Good to have you back. JOE Good to be out. DION Was it what they say? JOE It’s like the war. I don’t think about it and I’m not too big on going back. They get to a MARMON 34. Dion opens the door for Joe. JOE Get the fuck out of here... DION I work for you now. Boss Joe Coughlin. Joe sits in. Dion gets in the driver’s side. DION Reach under your seat and you’ll find a friend. Joe REACHES DOWN AND DISCOVERS A GUN UNDER THE SEAT-- a Savage .32 Automatic. EXT. YBOR CITY STREETS - DAY Joe and Dion cruise Ybor City. Florida is striking for how empty it is.  59.  CONTINUED:  (CONTINUED) Streets that will one day be filled with strip malls and choked with traffic now look almost like uninhabited jungle by comparison, though the white sky is smeared by factory smoke. DION Cigars built this place. He points to brick buildings with smokestacks. DION What you’re smelling now is probably   bolos   or   empanadas.   Rest of the city leaves us alone. Far as they’re concerned we’re a bunch of dirty spics and wops and we can fuck off and do what we need to do if we leave them alone. They turn on to 7th avenue, a main street. Clapboard sidewalks and second stories with wrought iron. DION You’d think we’d all get along but it don’t work out that way. The Italians and the Cubans keep to themselves. But the black Cubans hate the white Cubans and the white Cubans look at the nigger Cubans like they’re niggers and the both of ‘em high hat everyone else. All Cubans hate the Spaniards and the Spaniards think all Cubans are uppity coons who forget their place since America freed them in ‘98. The Cubans   and  the Spanish look down on the Puerto Ricans and everyone shi",
      "dialogue_count": 0,
      "word_count": 2284
    },
    {
      "scene_number": 14,
      "slugline": "EXT. VEDADO TROPICALE - NIGHT This restaurant/nightclub is alive inside and out. It is a warm evening and the streets are full. ESTEBAN (PRE-LAP) This way. INT. VEDADO TROPICALE - CONTINUOUS ESTEBAN SUAREZ, slim and unblemished, tea-colored skin wearing a dinner jacket and black silk bow tie. His eyes are pale yellow and his hair is slicked back. This is a back area with a small table surrounded by four high wingback armchairs. On the table is a BOTTLE OF RUM and several glasses. ESTEBAN Please, sit down. He passes a glass of rum to Joe and Dion. ESTEBAN I never agreed with the Spanish that the lighter rums were superior. Of course, we Cubans went along because of our obsession that lighter is better in all things. GRACIELA (the woman from the train depot) enters. Joe and Dion SHOOT up out of their chairs. ESTEBAN Dion and Joseph, this is my sister Graciel-- GRACIELA We’ve met. JOE Have we? I’m not sure-- GRACIELA Yes you are. Sit down. Joe and Dion share a furtive look and sit back down. Graciela sits. JOE This rum is incredible. Dion takes a sip. DION Be nice if we could sell it up north.  70.  (CONTINUED)",
      "characters": [],
      "action_text": "GRACIELA When you’re country treats you like adults. JOE No hurry. We’d be out of a job. Small laughter. Joe notices the walls are COVERED IN BLACK AND WHITE PHOTOGRAPHS. Graciela follows his gaze. GRACIELA My brother takes them. ESTEBAN The working people of Miami. It’s a hobby. JOE They’re good. ESTEBAN Maybe someday I’ll photograph you, Mr. Coughlin. JOE Afraid I’m with the Indians on that. Esteban laughs. ESTEBAN Speaking of captured souls, my friends tell me that mister Gary L. Smith was seen boarding the Seabord Limited with his wife in one Pullman and his   puta maestra  in the other. JOE Sometimes a change of scenery gives a man a new lease on life. GRACIELA And you, is that why you came to Ybor? For a new life? JOE I’ve come to distill and distribute the demon rum. But I’m going to have a hard time doing that with an erratic import schedule. GRACIELA We don’t control the tides. JOE The tides haven’t slowed the boats to Miami.  71.  CONTINUED:  (CONTINUED) GRACIELA We know nothing of the boats to Miami. JOE No. Nestor Famosa does. And he assures me the seas this summer have been calm. ESTEBAN And you use Senor Famosa’s name so I worry you could overtake my supply routes. JOE I want to deal with you directly. For that you can raise the price. GRACIELA What would we receive? JOE I have Lou Ormino’s cops and judges-- most of whom won’t talk to you because you’re Cuban. What you receive is access to them. ESTEBAN You would want exclusive access to our molasses? JOE No. But you can’t sell to the White operation. ESTEBAN Albert White is a good customer. JOE Can he offer you what we’re offering? ESTEBAN It’s possible this could bring bloodshed. JOE It will definitely bring bloodshed. EXT. JOE’S HOTEL - LATER A bottle SMASHES into the porch. Reveal it was thrown by Dion, who walks next to Joe. Joe still has some rum left in his and he swings up onto the porch and sits in a chair.  72.  CONTINUED:  (CONTINUED) Joe hears something moving under the netting just off the",
      "dialogue_count": 0,
      "word_count": 1083
    },
    {
      "scene_number": 15,
      "slugline": "INT. MASO’S HOUSE, NAHANT, MASSACHUSETTS - SAME Maso picks up the phone. JOE It’s me. Intercut as necessary between the two. MASO You get your answer? JOE Yeah. MASO And? JOE It wasn’t Dion who told Albert. It was his brother. Maso takes a beat. The silence seems to suggest consent. MASO I keep hearing how much powder is coming through there. Are we getting our piece? JOE Don’t worry. We’ll get our piece. EXT. RIVER - DAY Joe and Graciela, Esteban and Dion take a ride on a BOAT. They travel down an exquisite marsh that becomes a beach, and then a marsh again. Wild animals are in abundance; herons, cranes, alligators, flamingoes and dolphins. It’s extraordinary, wild land. JOE (to Dion) Maybe we should buy some land down here? DION Who the fuck would buy land in Florida? The boat slows as they approach a waterside speakeasy/dance club/restaurant Cuban dance hall. ESTEBAN (to Joe) This, I think you will enjoy. TIME CUT TO:  76.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 167
    },
    {
      "scene_number": 16,
      "slugline": "INT. CUBAN DANCE HALL - LATER Men and women are DANCING. The music is loud, night is falling outside. Esteban is an incredible dancer, he dances on the floor. Dion watches from a corner, unmoving and overdressed. Joe watches Graciela. She dances and smiles but there is a seriousness to her that he is struck by. She takes a break, walks out onto the dock. Joe gets up and follows her. EXT. DOCK OUTSIDE CLUB - CONTINUOUS Graciela walks out to get some air. Joe behind her. GRACIELA If you corner the rum market. You will be a king. JOE Still gotta deal with Albert White. GRACIELA Is this what you’ve always wanted? JOE No. But it’s what I want now. GRACIELA Well, then, congratulations. (beat) But how will you hold the power when you have it. JOE Think I’m not strong enough? GRACIELA I don’t know if you’re cruel enough. (beat) And if you are, then that will be sad. JOE Powerful men don’t have to be cruel. GRACIELA But they usually are. (beat) Who is she?  77.  (CONTINUED)",
      "characters": [
        "DION"
      ],
      "action_text": "JOE Who? GRACIELA The woman you love. JOE She’s gone. GRACIELA She left you? JOE She died. She waits a beat. Maybe he is putting her on? No. GRACIELA I’m sorry. JOE I’m told liquor is only your side business. GRACIELA Is that so? JOE Some people say you give it all away. Some in Cuba... GRACIELA Do you think that’s foolish? JOE No. It’s just not my cause. GRACIELA What is your cause? JOE Rum. And that no man should rule another’s life. GRACIELA You do not want to be a good person? JOE I’ve seen good in bad people and bad in good and seen ‘em both die in the mud. GRACIELA Do you think there is such a thing as a noble man?  78.  CONTINUED:  (CONTINUED) JOE I got nothing against noble people. But they rarely live past forty. GRACIELA Neither do gangsters. JOE Well then I’ve got a few more years. Plus, I’m not a gangster. I’m an outlaw. GRACIELA Do you know what my favorite poem is?   (beat) “We can make our lives sublime and in departing, leave footprints on the sands of time.” JOE You write that? GRACIELA No. JOE But you want to be noble? GRACIELA My nobility is that I love my country. Simple. JOE I love my country too, but... GRACIELA Yes. But your country is something you see out your window. My country is something inside of me. And I love it like you love that dead girl. INT. CLUB - CONTINUOUS Dion watches Esteban dance as Joe and Graciela return. DION I never seen anyone move like that. GRACIELA He was a professional dancer in Havana. Very good. Dion throws Joe a furtive look.  79.  CONTINUED:  (CONTINUED) JOE You’re drunk. She laughs and points across the table. GRACIELA  You’re   drunk. JOE No argument. GRACIELA We will not be lovers. JOE You said that. CUT TO: INT. GRACIELA’S HOUSE - LATER Joe and Graciela come crashing into frame, kissing, pulling at one another’s clothes. When he moves inside her, she bites down on his shoulder. Love like a car crash. DISSOLVE EXT. GRACIELA’S HOUSE - SUNRISE Joe sits in a chair looking out at the sunrise. Graciela sleeps acr",
      "dialogue_count": 1,
      "word_count": 927
    },
    {
      "scene_number": 17,
      "slugline": "EXT. FLORIDA BUSH - DAY Joe, Dion and PORFIRIO DIAZ stand around. Porfirio is gesturing with energy. Speaking Spanish. JOE (V.O.) We made so much money, guys started getting carried away. DION He wants to get a plane. JOE He wants to   buy   a plane? DION To spot the Coast Guard. Most gesturing and talking from Porfirio. DION He thinks we can put a machine gun in the plane. JOE Is that what he thinks? (beat) Ask him if we should get a tank. (to Porfirio) Go home. DION (to Porfirio in Spanish) He says maybe. EXT. RITZ HOTEL - AERIAL As the sun sets on east Florida, we see a half finished hotel, alone on a pristine beach. JOE (V.O.) Maso sent down his son, Digger, to take a look at the casino option I was working on. Digger was one of the dumber sacks of shit but he was the boss’ kid so everyone pretended he knew what the fuck he was talking about. EXT. RITZ HOTEL - SUNSET Joe and Dion walk towards a bluff that overlooks the casino. DIGGER PESCATORE, large and dumb, stands with them as well as FOUR BODYGUARDS.  83.  (CONTINUED)",
      "characters": [],
      "action_text": "JOE The Volstead Act won’t last forever. When it’s over, what do you do? Gambling. We use the connections we put together to get it legalized and we’re the only ones in place to run it. DIGGER This is it? JOE That’s it. Ritz Longboat Key, I sat down with the owners in Sarasota. DIGGER Why do they let us in? JOE Because they can’t get gambling legal and they can’t run a casino. They own the property, we run the casino. Fifty fifty chop on profits. DIGGER Do we have a magic stick for changing laws? (grin) I hear you got Bingo legal. JOE It’s a prerequisite. You can’t get gambling legalized without-- DIGGER Good. Your grandmother can come down and play in the church. A few subtle looks exchanged acknowledging what an idiot Digger is. JOE I got bagmen buying inspectors in Tallahassee and Sarasota. We got men going after Senators and IRS agents who gamble. We get gambling legal we’re rich and legit for the long fucking haul. Digger MEAN MUGS Joe, then breaks into a smile. JOE (V.O.) We were lying to Maso about the drugs but the casino thing was square.  84.  CONTINUED:  (MORE)  (CONTINUED) Men were desperate for jobs all over the US and we had a six million dollar a year business. So what Maso thought didn’t bother me. What did bother me is that we hadn’t heard a thing from Albert. INT. SPEAKEASY - NIGHT The place is half full, mostly African-Americans of Latin descent. There is a small window on the door to the outside. It catches Joe’s attention as it starts to GLOW RED. Joe and Dion head outside. EXT. SPEAKEASY - NIGHT Joe walks out to see a CROSS BURNING and several KU KLUX KLAN riders in white robes, riding horses and adorned with red and white emblems. They all hold rifles. Joe steps forward into the light of the burning cross. Slowly puts his hand in his waist. KLAN MEMBER (RD PRUITT) Ya’ll been warned!! And the gallop off, leaving Joe in the glow of the burning cross. INT. BODEGA, TWENTY SEVENTH ST. - DAY It’s a small speakeasy where a HOLD UP is in progress. A m",
      "dialogue_count": 0,
      "word_count": 1632
    },
    {
      "scene_number": 18,
      "slugline": "EXT. YBOR CITY STREETS - DAY Joe’s guys crawl through the neighborhood in new cars, looking out windows. JOE (V.O.) I sent out crews day and night to find him. But he went hard to the ground. INT. EAST SIDE SPEAKEASY - NIGHT An active club, filled mostly with black Cubans, is in full-swing. Musicians play, people drink and laugh. RD walks in and starts SHOOTING PEOPLE AT RANDOM. He shots FOUR PEOPLE, the crowd fleeing and screaming. He turns around, PUTS A NOTE ON THE BAR, and walks back out the door. JOE (V.O.) Same note. Same message. EXT. CHIEF FIGGIS HOME, FRONT PORCH - DAY Joe, alone, sits on the porch opening and closing his father’s watch. Chief Figgis pulls up, gets out and heads up his walk towards Joe. CHIEF FIGGIS Want a beer? It’s near beer but it ain’t bad. JOE Love one. Figgis goes into the house, Joe waits, he comes back out with a beer. JOE I need to get to RD. CHIEF FIGGIS I expect you would feel that way. JOE You know how this ends if you don’t help me? CHIEF FIGGIS No. I don’t.  92.  (CONTINUED)",
      "characters": [
        "RD PRUITT"
      ],
      "action_text": "JOE More bodies. More writing about cigar city slaughter and you get pushed out. CHIEF FIGGIS You, too. JOE Maybe. CHIEF FIGGIS Difference is, when you get pushed out, someone does it a bullet to the back of your ear. JOE If he goes away, the war ends. CHIEF FIGGIS I’m not selling out my wife’s brother. Joe looks out on the street. JOE I don’t want to do this. CHIEF FIGGIS Do what? JOE What you’re about to make me do. CHIEF FIGGIS I’m not making you do anything. JOE Yeah. You are. Joe removes a BATCH OF PHOTOS. Figgis looks at Joe, then quickly down at the photos and then back up. JOE She didn’t make it to Hollywood. She only made it to Los Angeles. Figgis looks at the second photo then shuts his eyes tight. We see a glimpse of some   pornography   in the photo. CHIEF FIGGIS That’s not right. Then he puts his hands over his face. JOE We’ve got her with a special doctor.  93.  CONTINUED:  (CONTINUED) He lowers his hands, revealing red eyes. CHIEF FIGGIS What kind of doctor? JOE Kind that gets people off Heroin, Irv. CHIEF FIGGIS Do not ever call me by my Christian name. You will call me Chief Figgis for whatever years or days remain in our acquaintance, are we clear? JOE I didn’t   do   this to her. CHIEF FIGGIS Name your price. For telling me where my daughter is. He turns and looks at Joe. JOE In a clean facility. (beat) I can’t tell you where. CHIEF FIGGIS Until? Joe holds his look. Figgis gets up slowly and GOES INSIDE. From outside we HEAR: CHIEF FIGGIS (on phone) RD, you’re gonna meet with this boy again and there ain’t another discussion be to had on the matter. (beat) Yeah, I’ll come too. (beat) Longboat key, by the Ritz tonight at ten. He walks back out. CHIEF FIGGIS When do I get her location? JOE When I walk out from this meeting alive. Joe gets up and walks to his car.  94.  CONTINUED:  (CONTINUED) CHIEF FIGGIS Do it yourself. JOE What? CHIEF FIGGIS If you’re going to kill him be man enough to pull the trigger. Ain’t no pride in having other people do wha",
      "dialogue_count": 1,
      "word_count": 1715
    },
    {
      "scene_number": 19,
      "slugline": "INT. BATHROOM - EVENING Joe is in the tub, scars almost healed. Graciela comes in, slips off a robe and gets in across from him. He looks at her. GRACIELA Can I take your name? JOE You want to marry me? GRACIELA I cannot marry you in a church. JOE Okay. GRACIELA We are married, are we not? JOE Yes. GRACIELA So I would like to call myself by your surname. JOE Graciella Isabella Lunes Martes Miercoles Jueves Coughlin. She laughs, splashes water at him. GRACIELA I don’t have that many names. He kisses her. JOE Graciella Coughlin? GRACIELA I would be honored. They kiss. GRACIELA I have bought some buildings. JOE (smiles) You bought   some   buildings? We get married, right away you start spending my money? He is teasing. She looks at him innocently.  101.  (CONTINUED)",
      "characters": [],
      "action_text": "GRACIELA Three. By the Perez factory. JOE Oh, so just three buildings? GRACIELA I would like to give shelter there to abandoned wives and their children. JOE What happened to Cuban politics for a cause? GRACIELA I fell in love with you. You restrict my mobility. EXT. FLORIDA BUSH, AERIAL - DAY We come off the ocean over a jungle--- and arrive at a small cluster of CASITAS built by Graciela. EXT. CASITAS - DAY Graciella walks Joe through the tent city, teeming with extremely POOR WOMEN AND CHILDREN. GRACIELA The men go up to get milk, they hear a rumor of work and they never come back. Without men to protect them, these women-- She gestures around her. GRACIELA Are raped or turned to basement prostitution. The children enter the streets and news that returns of them is seldom good. Joe looks out over the dismal scene. GRACIELA This can be a model of good to the rest of the world-- JOE I’ve seen some of the world. No one was looking for good. GRACIELA Men can be good and just in this world. Why not?  102.  CONTINUED:  (CONTINUED) JOE Greed. She looks at him, not understanding. JOE Look how we live. GRACIELA Yes. I have become like those who my parents worked for.   But we give back. Look what you gave the Suarez clinic. JOE They saved my life. GRACIELA You built a library the year before. JOE So I could learn to read. GRACIELA The books are in Spanish. JOE Learn to read Spanish. GRACIELA Your Spanish is abominable. JOE I guess we need another library. She smiles. They walk farther along. It’s not all wide- eyed innocents, many of the people look rough. JOE Do you think, if you had nothing, any of these people would take you in? GRACIELA (genuine) Why does it matter? JOE I don’t know. It does to me. GRACIELA I would like to leave some footprints in the sand. JOE I know you do. Look you want to rescue these women and their kids? Good. I love you for that.  103.  CONTINUED:  (MORE)   (CONTINUED) But some people aren’t gonna want to let them go. GRACIELA I know that. That",
      "dialogue_count": 0,
      "word_count": 734
    },
    {
      "scene_number": 20,
      "slugline": "EXT. FAIRGROUNDS - NIGHT A large rally led by Loretta. Throngs of people have turned out to hear Loretta preach, while she wears a nearly see-through dress, exposing her silhouette. Dion and Joe, semi-camouflaged among farmers and various workers, listening rapt. LORETTA FIGGIS In my darkest hours I know I’m too weak. The siren song of sin preys on that which is most appealing to you. Life is full of pain and sinfulness is a false balm to soothe it. But the only true healing comes from God. It is not enough to have the demon rum flowing in our cities, now men would seek to build a house of gambling on our waterfront. Is our virtue that cheap? Dion and Joe look at one another. He rubs his forehead. This isn’t going to go away. DION My virtue’s always been pretty cheap. JOE What virtue? DION Sarasota is going to fucking hate this. JOE Let me deal with it. DION They don’t need this shit. Casino is two percent of their business they don’t need to be the people turning white Christians into junkies. JOE Just let me deal with it. INT. REVIVAL TENT, BACKSTAGE - LATER Joe and Dion enter. Loretta is there, along with a small retinue of others. There is an, “after the show,” concert feel. She notices them come in. Smiles broadly.  105.  (CONTINUED)",
      "characters": [],
      "action_text": "LORETTA FIGGIS Mr. Coughlin! Joe takes her hand. JOE Ms. Figgis. Great show tonight. I appreciate you taking the time to talk. LORETTA FIGGIS Of course. What can I do for you? JOE Well, we’d like to talk about the Ritz. She smiles with a hint of condescension. LORETTA FIGGIS My father says there was once a good man in you. JOE I wasn’t aware he’d departed. LORETTA FIGGIS You do quite a bit for the people here but we both know your good works are mitigated by your evil deeds. JOE How’s that? LORETTA FIGGIS You profit from the illegal addictions of others-- their weakness and sloth and libidinous behavior. But you can free yourself of that. JOE I don’t want to. LORETTA FIGGIS Of course you do. JOE Miss Figgis, you seem like a lovely woman and I hear the flock is up threefold since you took over. A PASTOR holds up   five   fingers. It’s quintupled.  106.  CONTINUED:  (CONTINUED) JOE I sell a product people enjoy so much that an amendment to the US constitution will be overturned within a year. PASTOR That’s not true. JOE More booze was drunk in the last ten years than ever before in this country. Because people didn’t want to be told they couldn’t do it. LORETTA FIGGIS The same could be said of fornication. People want it and they don’t want to be told they can’t have it. JOE Nor should they. LORETTA FIGGIS I’m sorry? JOE If people want to fornicate I see no reason to stop them, Miss Figgis. LORETTA FIGGIS And if they wish to lie down with animals? JOE Do they? LORETTA FIGGIS I’m sorry? JOE Do people want to lie down with animals? LORETTA FIGGIS Some do. And their sickness will spread if you have your way. JOE I’m not sure I see a correlation between drinking and lying down with animals. LORETTA FIGGIS There is a correlation across all sin.  107.  CONTINUED:  (MORE)   (CONTINUED) It is all against the wishes of God and thus all equally offensive. JOE We hoped maybe you would be amenable to omitting the casino issue in your sermons- so we can go forward with a business ",
      "dialogue_count": 0,
      "word_count": 2709
    },
    {
      "scene_number": 21,
      "slugline": "INT. ELEVATOR - CONTINUOUS They get on and are greeted by an OPERATOR, ILLARIO NOBLE. JOE (V.O.) Illario Nobile. Yellow from the hep and he can put a rifle shot through a flea’s ass in a solar eclipse. EXT. TENTH FLOOR HALLWAY - CONTINUOUS The elevator doors open. Joe and Dion are greeted by FAUSTO SCARFONE. He wordlessly escorts them down the hall. INT. MASO’S SUITE - MOMENTS LATER The DOOR OPENS TO REVEAL MASO. MASO How are you, my son? JOE Fine. MASO Fausto, see if Dino needs anything. This is a way of saying Dino waits outside. Joe walks in. INT. GASPRILLA SUITE - CONTINUOUS This is the nicest suite in the hotel. Maso kisses Joe on both sides. Kisses his forehead. Pats his back, an elaborate show. Maso moves over to a table and chairs. Pours Joe a cup of coffee. MASO Salud. JOE Salud. MASO How’ve you been? JOE Good, you? MASO More good days than bad.  120.  (CONTINUED)",
      "characters": [
        "ALBERT"
      ],
      "action_text": "Joe sees DIGGER, silently standing off to the side in the room. Maso looks out the window onto the water. We can hear waves crashing in the far off distance. JOE (V.O.) For such a violent business it was populated with a surprising number of guys who were just putting food on the table. Digger pops an orange slice. JOE (V.O.) Digger wasn’t one of those guys. Maso produces a NEWSPAPER. The cover of which reads DEATH OF A MADONNA. There is a photo of Loretta Figgis. MASO This the philly who fucked up the whole casino thing? JOE Yeah. MASO Why didn’t you clip her then? JOE Too much blowback. MASO That’s not it. (beat) You’re not a killer, Joseph. And that’s the problem. JOE Since when? MASO You’re not a gangster. You’re a bandit in a suit. That’s why you didn’t kill that   puttana pazo.   Now I hear you’re thinking of going legitimate? JOE Thinking about it. MASO Then you won’t mind if I replace you down here?  121.  CONTINUED:  (CONTINUED) JOE When I got here this outfit did a million a year. You know where we are now? MASO Yes, but that’s all rum. You neglected the girls and the narcotics. JOE Bullshit. MASO Excuse me? JOE I focused on the rum because it was the most profitable but I added four houses since in my time here. MASO Yes but you could have added more. And the girls claim they are rarely beaten. JOE Maso, I-- MASO --Mr. Pescatore. Joe lets out a smile sigh. He sees the road turning. MASO I’m making a change. I want Italians and only Italians down here now. JOE I ran Ybor. I ran all of Tampa. Did you ever have a problem? MASO You did more than that. You ran the whole coast. You boxed out Albert, put him in a little piss corner of Miami. I been through the books. You made us a force down here. JOE But now no Irish need apply? What can I be? Digger pipes up.  122.  CONTINUED:  (CONTINUED) DIGGER What I fucking tell you to be. Before you get a fucking pop in the mouth. Maso gives Joe a   don’t mind him   look. MASO  Consigliere.   You teach Digger the ropes. M",
      "dialogue_count": 1,
      "word_count": 5009
    }
  ]
}