{
  "slug": "lodge-49-101-as-above-so-below-2018",
  "title": "lodge 49 101 as above so below",
  "genre": "comedy",
  "format": "series",
  "scenes_count": 8,
  "characters_count": 0,
  "characters": [],
  "total_words": 11451,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. BEACH, LONG BEACH, CA - DAWN  SEAN “DUD” DUDLEY, 30 and white, walks down the strand,  drinking a can of Budweiser and sweeping a metal detector  back and forth. He has a bad limp and he’s wearing board  shorts and a faded T-shirt that says “Dudley & Son Pool  Supply.”  Behind him we see the gritty industrial coast: oil tankers,  cargo ships, drilling islands.  The metal detector beeps. Dud squats down and digs. He pulls  up a ring and brushes off the sand. The ring is gold, with a  medieval beast etched on the side.  FADE TO:  EXT. HOUSE, LONG BEACH, CA - DAWN  Crows gather on the telephone wires outside a small bungalow.  Their terrible squawking echoes through the neighborhood.  ERNIE FONTAINE, 60 and black, walks out of the house and onto  the patchy lawn. He’s in his underwear and pumping an air  rifle. He aims and starts firing. The crows scatter.  FADE TO:  EXT. GAS STATION, LONG BEACH, CA - LATER - MORNING  Dud pulls up to the pumps in his beat-up Volkswagen Thing. He  takes out four crumpled singles from his velcro wallet and  then searches for coins on the floor. He moves an old Big  Gulp cup out of the way and finds some dimes and pennies.  INT. GAS STATION, LONG BEACH, CA  At the counter Dud hands the attendant his money.  DUD  Give me $4.23 on pump six.  Dud turns to leave, but sees a penny on the floor.  DUD (CONT’D)  Nice!  Dud picks up the penny and puts it on the counter.  DUD (CONT’D)  I’d like to add this to my  purchase.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 270
    },
    {
      "scene_number": 2,
      "slugline": "EXT. SEA BREEZE STRIP MALL, LONG BEACH, CA - LATER  Dud pulls into the parking lot. A sign spinner stands on the  corner, wielding a large cardboard arrow that says: “Cash 4  Gold.” This is HERMAN POLA, 20 and Samoan. With a shaved head  and thick arms, he exhibits little enthusiasm for his job.  Dud drives past him and parks.  The strip mall includes a liquor store, laundromat, and donut  shop.   Further down one of the other shops has a “For Lease”  sign in the dusty window. The sign above the shop says  “Dudley & Son Pool Supply.” Dud enters All-STAR PAWN SHOP.  INT. ALL-STAR PAWN SHOP, LONG BEACH, CA  BURT SEMANZA, 50, with dark lifeless eyes, sits on a stool  behind a glass display counter. He’s eating a giant burrito  and reading a racing form.  DUD  I found something.  BURT  Salvation?  DUD  Better.  Dud holds up the ring. Burt puts down his burrito.  BURT  (taps the glass counter)  Put it towards your dad’s watch?  Dud bends down and looks at a gold watch behind the glass.  DUD  No, I need cash.  Dud hands Burt the ring. He looks at it without expression.  BURT  You found this on the beach?  DUD  Yeah.  BURT  (points to the etching of  the beast)  This is a Lynx ring. You have to be  a Lynx to get one.  2.",
      "characters": [],
      "action_text": "DUD  What’s a Lynx?  BURT  They’re a fraternal order. Like the  Masons and the Elks.  DUD  So. What’s it worth?  BURT  (hands the ring back to  Dud)  Nothing. It’s not real gold.  DUD  Really?  BURT  Someday you’ll know the difference.  DUD  (taking a closer look)  There’s an inscription. Do you  speak Latin, Burt?  BURT  I’m fluent.  DUD  “Superus sicut Inferus.”  BURT  That means “Pay up, bitch.”  DUD  I’ve never heard of the Lynx.  BURT  They have a lodge up on Cherry,  past the airport.  DUD  I drive by there all the time. I’ve  never seen it.  Herman pops his head in.  HERMAN  I’m taking a break.  Burt nods and Herman exits.  3. DUD  Can you give me anything?  BURT  If you need cash, I can open up  another line of credit for you.  DUD  89.9%. How do you sleep at night?  BURT  What? Dollar Center’s at 126.6. I’m  a man of the people.  DUD  You’re a parasite, Burt. That’s  what you are.  Burt, without expression, takes the last bite of his burrito.  DUD (CONT’D)  My dad always said you were the  saddest, most pathetic piece of  shit he ever met. And he was right.  Dud puts the ring in the velcro pocket of his board shorts.  He slams the door as he exits.   Burt, totally unfazed, goes  back to reading his racing form. A moment later Dud comes  back inside, with his metal detector.  DUD (CONT’D)  What will you give me for this?  EXT. SEA BREEZE STRIP MALL - MOMENTS LATER  Dud steps outside. He has two crisp twenty dollar bills in  his hands. As he limps past “Dudley & Son Pool Supply” Dud  holds up a fist, as if in solidarity with the sign. He enters  All-American Donuts.  INT. ALL-AMERICAN DONUTS  ALICE VO, eighteen year old Vietnamese girl, sits behind the  counter. Two dishevelled men play chess at a table in the  corner. Herman is drinking a soda and watching them. Alice,  tanned and athletic, looks up from her phone when Dud walks  in.  ALICE  Your sister called here looking for  you.  4. DUD  What did she want?  ALICE  She wants to know when you’re  getting a",
      "dialogue_count": 0,
      "word_count": 4187
    },
    {
      "scene_number": 3,
      "slugline": "INT. ERNIE FONTAINE’S GARAGE - LATER  Ernie carries the wooden box into his messy garage. He clears  space on his workbench and lays down a square of blue felt.  From a cabinet above the bench he takes down a mortar and  pestle, and from the box a bundle of dried herbs, several  glass vials with different colored tinctures, and finally, a  folded piece of yellow legal paper filled with strange  symbols and formulas.  INT. ERNIE FONTAINE’S HOUSE - LATER  Ernie sits on his kitchen floor, holding Fernando and rubbing  green paste into his mangy fur. He lets him go and Fernando  bolts away.  FADE TO:  INT. THE TARTAN ROOM - LATER - NIGHT  Dud sits alone at the bar, watching the door for Beth and  Tim, but it seems clear they aren’t coming. He’s the only  person at the bar not staring at a phone.  We finally see a crack in his demeanor. There’s doubt in his  eyes. He signals the bartender for another round.  FADE TO:  INT. EL CONQUISTADOR MOTEL - NIGHT - LATER  Ernie’s candle sits on top of the TV. The Dodger game is on.  He sits on the end of the bed.   CONNIE MILLS, 56 and white,  paces the room. She’s dressed professionally and wears a gold  ring on her right hand, along with a wedding band on her  left. She’s drinking whiskey and angrily reading a sports  page.  CONNIE  The English language is dead.  ERNIE  No it ain’t.  CONNIE  All the good copy editors are dead.  It’s chaos.   Look ! They mangled half  my sentences and cut like five  graphs from the middle.   None   of  this makes sense.  23.",
      "characters": [],
      "action_text": "ERNIE  Talk to them, baby.  CONNIE  Bunch of sober twenty-five year  olds. They hate me. They hate my  Joie de vivre. They want me dead.  Ernie sips his whiskey and smiles, enjoying Connie’s rage.  CONNIE (CONT’D)  Don’t you dare laugh. It’s not   your  name on the article.  Ernie puts down his drink and takes Connie’s hands. He  massages them and looks in her eyes. She cools down. Connie  kisses his forehead. She takes off her gold ring and wedding  band and places them on the dresser.  CONNIE (CONT’D)  Well, should we do it? Should we  celebrate our filthy anniversary?  ERNIE  (unbuttoning his shirt)  Come on. Don’t call it that.  CONNIE  How’s your back. Do you need to  stretch first?  ERNIE  No, I’m good.  INT. EL CONQUISTADOR MOTEL - NIGHT - LATER  Ernie and Connie relax in bed. Connie is watching sports  highlights on mute. Ernie reads his Egypt travel guide.  ERNIE  In Alexandria, we’d stay right on  the water. Imagine that. The sun  coming up on the Mediterranean.  CONNIE  Stop torturing yourself.  ERNIE  I can’t help it.  CONNIE  I feel bad. Shouldn’t we go see  him?  24. ERNIE  Larry said no visitors. He wants to  make time with the nurses.  CONNIE  It’s a miracle he’s still alive.  ERNIE  Dude’s immortal. He’s gonna outlive  us all.  CONNIE  You sound disappointed.  ERNIE  I love him, but he’s been promising  to step down for a decade. “Get  ready, Ernie. I’m sending you on  the Grand Tour   next   year.” Next  year never comes. I’m sick of it.  CONNIE  Stop whining. It’s unattractive in  a man.  ERNIE  The place is falling apart.  CONNIE  I heard he’s getting the carpets  cleaned.  ERNIE  Just once in my life I want to be  in charge of something.  CONNIE  Hubris.  ERNIE  Hell yeah! I want my goddamn  portrait on the wall!  Connie laughs. Ernie pulls her close and looks in her eyes.  ERNIE (CONT’D)  A year ago. You walked through that  door...I never thought I’d see you  again.  25. CONNIE  And now, here we are. (sweeps her  arm across the shabby motel ro",
      "dialogue_count": 0,
      "word_count": 1077
    },
    {
      "scene_number": 4,
      "slugline": "INT. ERNIE FONTAINE’S HOUSE - NIGHT - MOMENTS LATER  Ernie comes through the front door, followed by Herman, who  begins looking around the living room. Without a word he goes  to Ernie’s new flat screen TV and begins unhooking wires.  ERNIE  I’ve been placing bets with your  guy for   years . This is ridiculous.  Herman ignores him.  ERNIE (CONT’D)  I haven’t even   started   paying for  that yet. I got one of those 18  month financing deals at Best Buy.  Herman ignores him. Ernie approaches him.  ERNIE (CONT’D)  (laughing)  Come on, man. Your guy can’t wait a  few weeks? Let me talk to him. I  know   him. I mean, I know his voice.  We have a relationship!  Ernie puts his hand on Herman’s shoulder. Herman whirls  around and punches him in the stomach. Ernie goes down,  stunned and wheezing. He watches Herman pick up the TV. On  the way to the door he looks down at Ernie.  HERMAN  I’ll come by next week for the  rest. Two grand, OK?  ERNIE  (barely able to get the  words out)  That was a cheap shot.  Herman exits. Ernie sits up and from his jacket pocket pulls  out the joint that Blaise gave him.  FADE TO:  EXT. EMPTY PARKING LOT - LATER - DAWN  Dud, with a black eye forming, lies awake in the backseat of  his Thing. Above him crows gather on a telephone wire.  FADE TO:  28.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 235
    },
    {
      "scene_number": 5,
      "slugline": "INT. ERNIE FONTAINE’S HOUSE - LATER - DAWN  Ernie, with Fernando next to him, lies awake in bed,  listening to the crows.  FADE TO:  EXT. CHERRY AVENUE, LONG BEACH, CA - MORNING  Dud drives along with no expression. He passes one  nondescript building after another. Then his engine cuts out.  He looks at the gas gauge: empty.  The Thing finally rolls to a stop in front of the most  nondescript building of all. It’s two story, roughly the size  of a high school gymnasium, and made of dusty brick.   There  are no windows and the entrance consists of a set of oak  double doors.  Dud puts his face in his hands and drops his head onto the  steering wheel. Doubt has become despair. He sits up and  looks around.  Something on the building catches his eye: a black iron  silhouette bolted to the wall next to the door. It’s a Lynx.  He picks up the ring, still lying amid trash on his front  seat. They match.  Dud, almost in a trance, gets out and walks up to the  building. A small plaque next to the door reads:  THE ANCIENT AND BENEVOLENT ORDER OF THE LYNX  LODGE 49  There’s a look of recognition on Dud’s face. His brightness  is back. He tries the door, but it’s locked. He knocks. Then  he starts pounding the door, as if his life suddenly depends  on it.  DUD  Hello! Is anyone in there?  Finally, the door opens. Ernie is standing there, in his  Members Only jacket, smoking a cigarette. He takes a long  drag, exhales, and looks Dud in the eye.  ERNIE  I’ve been waiting for you.  DUD  (freaked out)  What?  29.",
      "characters": [],
      "action_text": "ERNIE  Are you here to do the carpets?  DUD  No.  ERNIE  Shit. Sorry. There’s supposed to be  a guy coming to do the carpets.  (squints at Dud, taking a closer  look) You look kind of...Do I   know  you?  DUD  I don’t think so.  ERNIE  OK. What do you want? Are you  selling something?  DUD  (in a daze)  No. I just...I found this on the  beach.  Dud hands the ring to Ernie.  ERNIE  OK. I’ll ask around, see who this  belongs to. Thanks.  Ernie starts to close the door but Dud stops him.  DUD  Wait.  ERNIE  Yeah?  DUD  I want to join.  ERNIE  (laughing)  You want to join?  Dud takes a breath and looks around.  DUD  I don’t know how to explain it, but  I feel like I’m supposed to be  here.  30. ERNIE  The carpet guy is   supposed   to be  here. I don’t know what your story  is.  DUD  I’m doing this wrong, aren’t I?  Joining is probably some big secret  thing.  ERNIE  Actually, it’s not. If you want to  join you just have to ask. We’re  obligated by tradition to open the  door for anyone who’s serious.  Dud and Ernie stare at each other for a moment.  DUD  Can I join?  Ernie shrugs and holds open the door for Dud.  INT. LYNX LODGE - LOBBY - MOMENTS LATER  The lobby is old and dusty. The wall facing the front door  has a faded blue tapestry featuring a large golden lynx and  underneath the words “Superus sicut Inferus.” Next to this  are double doors made of oak. A sign above says “Lynx Hall.”  On the opposite side of the lobby a sign above another pair  of double doors says “Lynx Tavern.”  DUD  You have your own tavern?  ERNIE  Full bar. Bud and Bud Light on tap.  DUD  Nice.  Dud looks around and his eyes stop on the doors to the hall.  Something seems to come over him. He steadies himself, like  he’s dizzy.  ERNIE  What’s wrong?  DUD  Nothing. I just feel like I’ve been  here before. I remember the hall.  31. Dud stares at the closed door. Suddenly, we see the grand  hall: sunlight pours in through stained glass, illuminating  marble pillars and vaulted ceilings.   Ther",
      "dialogue_count": 0,
      "word_count": 2320
    },
    {
      "scene_number": 6,
      "slugline": "INT. LYNX LODGE - TAVERN - LATER - NIGHT  Ernie sits at the bar next to Anita Jones, 50. They are both  smoking and drinking from silver tankards engraved with a  lynx. Behind them other Lynx members sit at tables, drinking  and chatting. In the corner, BIG BEN PETERS, 52, plays  pinball, with his giant belly pressed against the machine.  The walls are hung with a mixture of Budweiser signs and  medieval prints with alchemical symbols. One wall features a  glass case containing a skull and hour glass. Blaise is  tending bar.  ERNIE  (to Anita)  I’ve got a good feeling about this  kid. I think he’s special.  ANITA  He just showed up?  ERNIE  Larry hired him to do the carpets.  We got to talking. He was a  signalman in the navy, now he’s  running his own business.  ANITA  Four postulants in   one   week.  ERNIE  It’s crazy.  BIG BEN  (from the pinball machine)  Don’t question it.  ANITA  So on Saturday we’ll have the  carpet guy, and what’s her name?  BIG BEN  Lucy, I think. She works in  cosmetics. Her grandmother was a  Lynx a million years ago in  Milwaukee.  ANITA  A legacy!  BIG BEN  The other guy is a professor at  Long Beach State. Medieval History.  42.",
      "characters": [],
      "action_text": "ANITA  He’ll love   you,   Blaise.  ERNIE  They can bullshit all day long in  the library.  BLAISE  Better than talking to you knaves.  ANITA  Knaves?  BLAISE  You heard me.  Ernie glances over his shoulder. Connie is sitting at a table  with SCOTT MILLS, her husband. He is handsome, nicely tanned,  and wearing a sport coat. Big Ben joins Ernie at the bar.  BIG BEN  So who’s the other kid? The one who  found the ring.  ERNIE  He won’t show. He’s a bullshitter.  I called the home phone number he  left. It was for a donut shop.  BIG BEN  Sounds like a psycho.  The tavern doors open. Larry Loomis enters, looking cheerful  and healthy. He’s wearing plaid Bermuda shorts with sandals.  ANITA  He’s alive!  LARRY  Let’s roll some dice.  INT. LYNX LODGE - TAVERN  The Lynx crowd around four bunco tables, drinking and  cheering each other on. Ernie watches Connie pick up the  dice, but then looks down into his drink.  DISSOLVE TO:  43. INT. LYNX LODGE - TAVERN  On another night, a year ago, Ernie drinks at the bar, having  a good time with Larry and Blaise. Suddenly, cheers go up.  Scott Mills has entered. The Lynx all stand up and clap.  LARRY  Scott, you sneaky son of a bitch!  ANITA  Where is she?  SCOTT  In the bathroom. She’s nervous  about meeting you guys.  ANITA  Let me see the ring.  Scott holds up his silver wedding band.  LARRY  I almost got married in Vegas once.  A bunch of times.  SCOTT  We just figured we had a hell of a  weekend together. Why wait?  ERNIE  This round’s on me.  The Lynx go quiet as they hear footsteps in the lobby. Connie  enters the Tavern. The Lynx gather around her, but Ernie is  frozen. Scott introduces her to everybody, and finally comes  to Ernie. Connie is dumbstruck.  SCOTT  This is Ernie Fontaine.  For a moment, Ernie and Connie can’t speak. Connie collects  herself.  CONNIE  I know. We went to Long Beach Poly  together. A million years ago.  SCOTT  Really?  LARRY  Scholars and Champions!  44. ERNIE  Nice to see you, Connie.  Connie is ",
      "dialogue_count": 0,
      "word_count": 1074
    },
    {
      "scene_number": 7,
      "slugline": "INT. LIZ DUDLEY’S APARTMENT - NIGHT - LATER  Dud and Liz eat in front of the TV, angrily watching House  Hunters. Liz is expertly multi-tasking, watching the show and  scrolling through Twitter.  LIZ  I swear to God, if this guy says  “man cave” one more time...  DUD  They’re going to take the one with  the finished basement.  LIZ  No they’re not. All she did was  bitch about the appliances in that  place.  DUD  She had every right to.  LIZ  Now she’s complaining about the  ceilings ? (pointing her fork at the  TV) Fuck you, you fucking princess!  Dud, enjoying himself, refills their wine glasses.  INT. LIZ DUDLEY’S APARTMENT - NIGHT - LATER  Dud lays on the couch under a blanket. He’s reading the Lynx  pamphlet. Liz turns off the kitchen light and starts down the  hall.  DUD  This is kind of fun, isn’t it?  LIZ  What?  DUD  Us. Hanging out again.  LIZ  (with little enthusiasm)  Sure. I’ll see you in the morning.  DUD  (sits up on couch)  Hey...did Bobby leave behind any  clothes?  48.",
      "characters": [],
      "action_text": "LIZ  (instantly furious)  Please don’t say that name in my  house.  DUD  Sorry. But did he?  LIZ  (with a sigh)  There’s a couple shirts in the hall  closet. Why?  DUD  The Lynx meeting is tomorrow. I  want to look...  LIZ  Not   homeless.  DUD  Right. (sits up) Hey Lizzie,  there’s an initiation fee involved,  and I know you’re going to say “no”  but...  LIZ  No.  DUD  I totally understand.  LIZ  Do you   actually   think these guys  are going to help you?  DUD  I hope so. But it’s not even that.  It’s...  LIZ  What?  DUD  I remember one of mom’s garage  sales. She was selling a mirror.  LIZ  Which she probably bought at  another garage sale. The queen of  commerce!  49. DUD  It was a full length mirror. The  kind you hang on the back of a  door. Dad put it on the lawn.  Remember?  Liz shrugs.  DUD (CONT’D)  I remember standing over it. It was  like I was looking   down   into the  sky. It was the strangest feeling.  Like there was this whole other  world right below us. I wanted to  jump through.  LIZ  Wait. I remember. You   did   jump and  you broke it. Mom had a fit.  DUD  I know, I just...whatever. But that  feeling I had, looking down into  the mirror. That's how I felt when  I walked into the lodge. I have to  go back.  INT. ALL-STAR PAWN SHOP - THE NEXT EVENING  Dud stands at the counter. He’s clean shaven and his hair is  neatly combed. He wears jeans and a nice collared shirt,  tucked in. Burt counts out the last hundred dollar bill.  Ernie’s flat screen is now on display behind him.  BURT  Twenty-five hundred. Do you want me  to go over the terms and  conditions?  DUD  No.(signs papers on the counter)  This is the last time.  BURT  That’s what your Dad used to say.  Dud throws the papers at Burt, who doesn’t react at all.  DUD  You know what? I feel sorry for  you, Burt. No one in this world  gives a shit about you. You’re  gonna die alone.  50. Burt, without expression, picks up his racing form and sits  back on his stool. Dud exits.  EXT. SEA BREEZE ST",
      "dialogue_count": 0,
      "word_count": 679
    },
    {
      "scene_number": 8,
      "slugline": "INT. LYNX LODGE - LOBBY - NIGHT  Dud enters. Walking by the doors to “Lynx Hall,” he hears  faint voices inside. He continues into “Lynx Tavern.”  INT. LYNX TAVERN - MOMENTS LATER  Dud approaches the bar. Arturo is there, in a suit, drinking  water. Next to him is LUCY COLFAX, 38.   She is dressed  sharply in business attire and sits stiffly on her stool,  drinking a cocktail. Next to her, also drinking a cocktail,  is the college professor, NEIL PLUM, 35. He’s wearing a tweed  blazer. Blaise works the bar.  BLAISE  Welcome.  DUD  Sorry I’m late. My car was kind  of...(to Arturo). Hey, man.  Remember me?  ARTURO  No.  DUD  I was here a few days ago when you  were doing the carpets.  ARTURO  Sorry. I don’t remember.  DUD  (shrugging)  OK. Well, I’m Dud.  The others introduce themselves to Dud. Blaise takes a closer  look at Dud.  BLAISE  Have we met? You look really  familiar.  DUD  I don’t think so. Can I get a beer  and a shot?  BLAISE  You bet.  52.",
      "characters": [],
      "action_text": "DUD  (taking out a wad of cash)  And set these guys up with whatever  they want.  LUCY  Vodka tonic. (to Dud) Thank you.  Dud and Lucy exchange a smile.  NEIL  I’ll have your finest ale, sir.  ARTURO  Just water.  DUD  Oh come on! It’s on me!  ARTURO  I’m good with water. Thanks.  BLAISE  (points to Arturo)  Fear death by water.  Neil smiles and gives Blaise a knowing nod.  ARTURO  What?  NEIL  That’s T.S. Eliot.  BLAISE  (delighted)  Yes! You know, it’s funny. I’ve  always been more of a Four Quartets  guy...  ARTURO  I was in the Navy. I’m not afraid  of water.  DUD  (looking around)  No way! They got pinball!  Blaise starts making the drinks. Out in the lobby the doors  to “Lynx Hall” open.   Laughter and voices are heard.  BLAISE  Here they come.  53. The Lynx enter the tavern. They are dressed in dark blue  tunics, with different colored mantles, and several wear  medieval chaperon caps. They approach Lucy, Arturo, Neil and  Dud and warmly greet them with handshakes, introducing  themselves and saying their grade. Dud walks up to Ernie.  ERNIE  (shocked)  You made it.  DUD  I dig your gear.  ERNIE  We only put on the dog once a  month.  DUD  (reaches into his pocket)  I have my fee...  ERNIE  (looks around nervously)  Hey...Not here. Follow me.  INT. LYNX LODGE - OFFICE - MOMENTS LATER  Dud follows Ernie into the office. He holds out the two grand  in cash. Ernie takes it, looks at it for a second, and then  gives it back.  ERNIE  I don’t know you, but I’m pretty  sure you can’t afford this.  DUD  (upset)  You don’t want me here, do you?  ERNIE  No, no...it’s not you, it’s just...  Dud puts the money on the desk...  DUD  Please. Just give me a chance. You  won’t regret it.  Ernie takes a deep breath and concedes.  ERNIE  See you back in the tavern.  54. Dud exits. Ernie looks at the dusty medieval prints on the  wall, alchemists at work in their labs. Then he looks at the  stack of cash on the desk. He picks it up and pockets it.  INT. LYNX LODGE - TAVERN - LAT",
      "dialogue_count": 0,
      "word_count": 1609
    }
  ]
}