{
  "slug": "love-is-strange-2014",
  "title": "love is strange",
  "genre": "drama",
  "format": "film",
  "scenes_count": 14,
  "characters_count": 4,
  "characters": [
    "OFFICIANT",
    "GEORGE",
    "ELLIOT",
    "DOREEN"
  ],
  "total_words": 19486,
  "total_dialogue": 7,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. BEN AND GEORGE’S APT, BEDROOM - EARLY MORNING  The early morning sun fights to get in the bedroom  through the edges of well drawn shades.  BENJAMIN HULL(”Ben”), early 70s, is in bed awake. Next to  him lies GEORGE GAREA, early 60s, turned on his side,  still asleep.  Ben is still. The only movement is in his eyes,  shimmering with expectation.  INT. BEN AND GEORGE’S APT, BATHROOM - DAY  George, handsome, well groomed and with an impeccable  white shirt, is in front of the mirror tying the knot on  his tie. He tries once and, not happy with the result,  repositions the tie around his neck, and tries it again.  Voices can be heard in the background.  Ben enters dressed in a suit and a bow tie - the man has  style. He’s looking in the bathroom for something he  might have lost. He looks on top of a pile of magazines  by the toilet.  GEORGE  What?  BEN  My glasses. I can’t find my  glasses.  Ben looks around the sink where George is, briefly  interrupting his concentration with the tie.  GEORGE  Oh, no. Not today. Please.  Ben walks out, without his glasses. George hasn’t gotten  a good knot on his tie yet.  INT. BEN AND GEORGE’S APT, LIVING ROOM - DAY (CONTINUOUS)  ZLATA, the housekeeper, Polish and in her 40’s, comes in  from the kitchen bringing a big vase of flowers, which  she places on the coffee table.  The living room is spacious, high ceilings, comfortable  furniture. There’s a piano in the corner, art on the  wall, a dining table for 6 people and an umbrella holder  by the front door.  (CONTINUED)",
      "characters": [
        "OFFICIANT",
        "GEORGE"
      ],
      "action_text": "Ben is rearranging books and objects around, while  looking for his glasses. EUGENIA, early 30’s, ZLATA’s  pretty younger sister, is dusting off the book shelves.  She finds a pair of reading glasses - EUGENIA speaks with  a heavy Polish accent.  EUGENIA  I find Mr. Ben.  Ben comes to look.  BEN  Yes! Thank you, sweetie. Where’s  the list?  EUGENIA  (in Polish)  Zlata, you have the list.  ZLATA  It’s in the kitchen.  Ben goes into the kitchen.  INT. BEN AND GEORGE’S APT, KITCHEN - DAY (CONTINUOUS)  Ben is reading a small list on a piece of paper. Zlata is  cutting up more flowers by the sink.  BEN  I think 40 will do. Maybe Eugenia  can go to the grocery for you?  Ben opens his wallet and realizes he only has a couple of  single dollar bills.  BEN (CONT’D)  And the lasagna?  ZLATA  I’ve just put it in the oven.  Ben can’t resist; he goes to take a peek inside the oven.  BEN  Looks delicious.  George comes in, in a suit and a tie, his face and hair  perfectly fresh.  GEORGE  Let me see.  2.  CONTINUED:  (CONTINUED) He can’t resist and also goes to peek at the lasagna in  the oven.  BEN  (to George)  Honey, do you have any cash?  GEORGE  (to Zlata)  It’s not too early to be heating  this up?  ZLATA  Close the door! I know what I’m  doing.  Zlata slaps his hand. George closes the oven.  GEORGE  So how do I look?  Zlata opens a big smile and gives George a hug and a  kiss.  ZLATA  Fabulous. Both of you.  BEN  It’s almost eleven, George. We  have to go.  GEORGE  I’m waiting for you.  BEN  Sure. I need some cash for  Eugenia.  ZLATA  You smell so good too.  George takes out his wallet.  GEORGE  Thank you.  Before George can ask how much, Ben grabs two 20 dollar  bills and leaves them on the counter. George is used to  these kind of dynamics, and simply folds the wallet and  puts it back into his pocket.  BEN  Let’s go. Thank you Zlata.  3.  CONTINUED:  (CONTINUED) GEORGE  We’ll be back around 1:30.  BEN  Honey said she’d stop by before  the ceremony, but I don’t know  whe",
      "dialogue_count": 2,
      "word_count": 2990
    },
    {
      "scene_number": 2,
      "slugline": "EXT. ST. GRACE’S SCHOOL - DAY  St. Grace’s Church and Catholic school in Manhattan.  The School and Church are located on a quiet street in  Chelsea, lined with trees, off the main avenue. There’s  barely any traffic. A small group of HIGH SCHOOL STUDENTS  in school uniform hang out outside, chatting and smoking  cigarettes.  The door opens and out comes George, carrying a backpack  and a heavy shopping bag.  He passes by the students without saying a word.  It’s hot outside. George walks down the street alone,  sweating, passing the shopping bag from one hand to  another. Busy New Yorkers pass by him, not noticing he  has to stop for a moment, placing the heavy bag on the  ground, cleaning the sweat off of his face. After a  moment, he picks it up again, and continues on his way,  disappearing down a busy avenue.  INT. BEN AND GEORGE’S APT - NIGHT  George is pacing nervously by the piano, holding a pen.  He uses an old fashioned calculator that’s on top of the  piano, as he scribbles something on a piece of paper.  GEORGE  Let’s not forget that the real  estate agent gets a first month  commission. The coop board gets  one month also, and charges a 5%  administration fee.  MINDY  A month?  Roberto, Ted, Honey, Mindy, Ben and Kate are sitting in  the living room. Roberto and Ted are both in police  uniforms. They drink soft drinks, water and beer for  Roberto and Ted, but this time, it’s definitely not a  party.  GEORGE  Yes.  MINDY  That’s ridiculous! Why do they  have to charge an administration  fee?  15.  (CONTINUED)",
      "characters": [],
      "action_text": "ROBERTO  They just want to discourage  rentals in the building.  MINDY  I hate coop’s.  HONEY  But it’s so hard to find a condo  in Manhattan.  TED  Nowadays it’s not.  GEORGE  Anyway, I’m just trying to explain  that renting wouldn’t help us,  because...  George is still finishing his calculations.  MINDY  You’ve been to my house, right?  You know how much my real estate  taxes are? 3000. That’s for the  whole year!  BEN  It’s Poughkeepsie, Mindy.  GEORGE  Renting would leave us owing about  a thousand a month. If we can find  a studio for 1,500 dollars, which  isn’t easy, we’d start our month  at almost 3,000. That’s including  the Cobra insurance.  KATE  And you can’t afford that?  GEORGE  Well, between my private lessons  and Ben’s pension...  George is interrupted by a knock on the door.  MINDY  Why did you guys have to go on  such a fancy honeymoon?  Ben gets up and walks towards the door.  16.  CONTINUED:  (CONTINUED) BEN  Mindy!! That’s none of your  business.  MINDY  Of course it is. Otherwise I  wouldn’t be here.  ROBERTO  Shush, Mindy.  MINDY  I’m just saying... there’s nothing  wrong with Provincetown.  Ben opens the door. It’s Elliot.  ELLIOT  Sorry I’m late.  GEORGE (O.S.)  Anyway, we’d still have to pay one  month’s rent to the agent and one  month to the coop board right  away. That’s 4,600 right there out  of our pockets.  BEN  Come in. We’re all in here.  Elliot seems surprised to see everybody there. He notices  the serious mood.  ELLIOT  Everything okay, Uncle?  BEN  Yes, we just want to talk to you.  George stands to greet him.  GEORGE  Sit down. We just want to talk to  you all. We invited you all here  tonight, because you are our  family.  BEN  Do you want something to drink?  Elliot goes to sit next to Kate. She gives him a kiss.  17.  CONTINUED: (2)  (CONTINUED) ELLIOT  Water, please. Are you going to  tell us you’re getting divorced  already?  ROBERTO  Ha! That’s what I thought also.  GEORGE  No. We have to sell the apartment.  We’ve alrea",
      "dialogue_count": 0,
      "word_count": 767
    },
    {
      "scene_number": 3,
      "slugline": "INT. CORRIDOR OF BEN AND GEORGE’S APT - NIGHT  Outside Ben and George’s apartment, the guests say their  goodbye’s to the hosts.  ELLIOT  I’m sorry if I was a bit rough,  Uncle. I’ve had a bad day.  KATE  Let’s go, Elliot.  TED  Think positive, Ben.  HONEY  I love you guys. I’ll call during  the week.  ROBERTO  Hey buddy, thanks for the beer.  MINDY  Good night, sweetheart.  BEN AND GEORGE (O.S.)  Good night. Good night.  The door shuts. The Guests walk down quietly towards the  elevator for a moment. Roberto and Ted stop in front of  another apartment, down the corridor.  ROBERTO  We’re here.  They start to say their good-byes, with hugs and kisses.  HONEY  I feel bad that I can’t help out,  but you guys have seen my  apartment.  MINDY  It’s okay. They can stay with me  for as long as it’s necessary.  HONEY  I just had this feeling that they  were hoping they’d stay with one  of us, here in the city. Didn’t  you guys see the look on their  faces?  Yes, they saw that look on their faces. All but Mindy.  19.  (CONTINUED)",
      "characters": [],
      "action_text": "MINDY  What are you talking about?  HONEY  I’m just saying... They don’t want  to go live Upstate. George and Ben  country boys, all of a sudden? I  can’t see that.  MINDY  It’s temporary!  ELLIOT  Honey is right. Maybe there’s  something else we can do.  MINDY  I thought we had it all figured  out already!  HONEY  Shhh, Mindy. Quiet.  MINDY  Why are we even having this  conversation? I’m the only one  with the extra bedroom.  ELLIOT  It’s not that, Mindy. It’s  Poughkeepsie.  MINDY  When was the last time you were  there?  ELLIOT  Doesn’t matter. George has his  private students here. Ben has his  galleries.  ROBERTO  And they’ll need to look for a new  apartment.  HONEY  It just doesn’t make sense that  they go live 2 1/2 hours away.  MINDY  It’s an hour and a half, actually.  TED  Not by bus, it’s not.  20.  CONTINUED:  (CONTINUED) MINDY  By car.  HONEY  They don’t drive!  MINDY  They can very well learn how to.  HONEY  Are you really serious, Mindy?!  MINDY  Shut the fuck up, Honey. You’re  not even family, so you don’t get  to decide anything!  They realize at this moment that they can’t let their  friends go live with crazy Mindy.  TED  Pshhh... Quiet. They’re right  there.  KATE  Elliot, let’s go. I still need to  do some work tonight.  ROBERTO  Since we’re all here, why don’t  you come inside for a minute?  Roberto puts his key on the door, opens it. Kate holds  Elliot’s hand, signaling that she wants to go.  KATE  (whispers)  It’s almost 10 o’clock.  ELLIOT  Honey, we need to figure this out.  ROBERTO  Come in, please.  TED  Come in.  Reluctantly, Kate follows her husband Elliot. They all go  inside.  21.  CONTINUED: (2)",
      "dialogue_count": 0,
      "word_count": 468
    },
    {
      "scene_number": 4,
      "slugline": "INT. BEN AND GEORGE’S APT, KITCHEN - NIGHT  In the kitchen, Ben is washing the drinking glasses used  by the guests. He washes thoroughly, slowly, taking this  moment alone maybe to reflect, almost meditative.  George comes in quietly carrying two plates. He leaves  the left over cheese on the counter and pours the left  over crackers in the trash. He gives Ben a kiss on his  cheek, then leaves.  After Ben finishes washing the last glass, he turns the  water faucet off and proceeds to wrap the leftover cheese  in plastic wrap, and then puts it inside a zip lock bag.  He turns the water on again, and washes this last item -  the plate that carried the cheese.  Ben turns the water off, finally, and looks around. All  is clean.  INT. CORRIDOR OF BEN AND GEORGE’S APT - NIGHT (CONT.)  George leaves the door to his apartment ajar and walks  down the corridor, carrying a full trash bag. As he  passes by Roberto’s apartment, he seems to hear voices  coming from inside. He continues down towards a door at  the end of the corridor. He opens it and throws the bag  down the chute. On his way back, he stops in front of  Roberto’s apartment for a moment. He can’t make out what  people are saying, but he can definitely hear voices: a  woman’s voice, and then a man’s voice - an argument  coming from inside the apartment. He knows it’s Kate,  Elliot, Roberto. He feels sad that it’s come to this.  George goes back inside his apartment, and shuts the door  behind him.  The empty, silent corridor with its cold light.  FADE OUT.  EXT. PARK SLOPE - DAY  A busy corner in Park Slope, Brooklyn. Old ethnic  restaurants share the street with hip cafés. Young  couples walk by with their kids, as an Older Indian  couple open the doors to their store.  On the street, a couple of teenagers on skateboards rush  by noisily, crossing the screen.  22.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 331
    },
    {
      "scene_number": 5,
      "slugline": "INT. ELLIOT AND KATE’S APT, LIVING ROOM - DAY  The spacious living room of this Park Slope apartment is  bright, with big windows that face a tree-lined street.  The apartment is just high enough so that the leaves of  the trees filter the sun, and cast shadows inside the  apartment in this early fall afternoon.  ELLIOT (O.S.)  We have the crew, plus 4 actors  and 25 extras, so you tell me how  or where we are going to  accommodate this crowd if we can’t  close the street at 7.  Elliot is on the phone, sitting at a desk by the window,  with papers scattered around: a budget sheet, a couple of  actors’ 8 x 10, Polaroids of locations, a shot list.  ELLIOT  (...) You told me we had the  permit already!  Joey shows up at the desk.  JOEY  Dad. Dad. Can I talk to you for a  second?  ELLIOT  James, hold on.  (to Joey)  What’s going on, Joey?  JOEY  That geography presentation I have  to do.  ELLIOT  Which one?  JOEY  The one on sustainable  development. I told you.  ELLIOT  Oh, that one. Yeah?  JOEY  Vlad and I are doing it together,  as a team. They’re painting his  house, so I told him to come here.  23.  (CONTINUED)",
      "characters": [
        "ELLIOT"
      ],
      "action_text": "VLAD  Let’s go to your room?  JOEY  Not yet.  VLAD  Okay. Can I get some water?  JOEY  Yeah.  INT. ELLIOT AND KATE’S APT, KITCHEN - CONTINUOUS  Vlad enters, and sees Eugenia at the sink, doing dishes,  pretty as ever.  VLAD  Hi there.  EUGENIA  (Surprised)  Oh hello. I’m sorry. I didn’t see  you there.  VLAD  I’m Vlad.  EUGENIA  My name is Eugenia.  Vlad’s staring. He makes her a little uncomfortable.  EUGENIA (CONT’D)  I work for Mr. And Mrs. Hull.  VLAD  Are you Russian?  EUGENIA  Yes.  Vlad reaches his han19d out. Eugenia dries her hands on  the towel and they shake.  VLAD  (in Russian)  Very nice to meet you, Eugenia.  EUGENIA  (in Russian)  Nice to meet you too.  25.  CONTINUED: (2)",
      "dialogue_count": 1,
      "word_count": 548
    },
    {
      "scene_number": 6,
      "slugline": "INT. ELLIOT AND KATE’S APT, BEDROOM - DAY  Kate is sitting on her bed, with her laptop on a pillow.  The door is ajar, and Joey enters.  JOEY  Mom.  KATE  Yes?  JOEY  Vlad is here. We have to do our  presentation on Sustainable  Development today.  KATE  Oh wow. I can’t wait to see it.  JOEY  I think we’re going to the  library.  KATE  But isn’t Vlad here?  JOEY  I told you, yes.  KATE  So why don’t you guys just stay  here?  INT. JOEY’S BEDROOM - DAY (CONTINUOUS)  Joey’s bedroom is small, with a bunk bed and a small desk  by the window with a computer. There’s a bookshelf full  of books, photos and some quirky objects. On the wall a  faux vintage poster of the Titanic (the boat, not the  movie).  And there, propped up on the lower of the beds, with an  open book lying on his chest, is Ben. He is shirtless,  and wearing only his boxer shorts underwear. His eyes are  closed, his head tilted to the side - he has fallen  asleep, his reading glasses dangling from his nose.  The door opens, and Joey comes in, followed by Kate. Both  take in the unexpected vision of the old man’s nearly  naked body.  KATE  (whispering)  Wake him gently.  26.  (CONTINUED)",
      "characters": [
        "GEORGE",
        "DOREEN"
      ],
      "action_text": "JOEY  You do it.  KATE  (impatient)  Oh, c’mon, Joey...  She moves gently towards the bed and gives Ben a  tentative poke. He opens his heavy eye lids slowly.  KATE  Uncle Ben. Uncle Ben, hi.   Sorry  to wake you. Joey wants to ask you  something.  JOEY  Mom!  Kate steps back and gently pushes Joey closer to Ben.  JOEY  Uncle Ben, my friend Vlad is here.  We need to do a presentation for  school, and there’s nowhere for us  to study.  BEN  (dazed)  Who?  Vlad steps in from behind Joey, curious to finally see  the old man in person.  BEN  Ah, Vlad, it’s so good to meet  you. I’ve heard a lot about you.  VLAD  Hi.  BEN  I’m sorry, I guess I’ve fallen  asleep.  He sits up, but still doesn’t move to get dressed.  BEN  What time is it?  VLAD  2:05.  BEN  So what is this presentation  about?  27.  CONTINUED:  (CONTINUED) Ben looks at Joey, who’s looking at his mother, who’s  looking at him. Nobody says anything.  INT. ELLIOT AND KATE’S APT, LIVING ROOM - DAY  The desk in the living room now has been taken over by  Kate, and her computer. Elliot is nowhere in sight. Only  a few pages of notes neatly piled up next to the  computer, while Kate seems concentrated, writing away.  BEN (O.S.)  Did I tell you that my gallerist  friend is a big fan of yours?  It takes Kate a moment to register that someone is  talking to her.  On the other side of the room, Ben has created a make-  shift studio, with an easel and a drawing pad.   He has a  few photos tacked to the wall beside him, and a box of  charcoals that he is sketching with.  BEN (CONT’D)  Did I tell you?  KATE  A fan of mine?  BEN  She loves your book.  KATE  That’s nice.  Kate, after this brief exchange, is back to the computer,  trying to finish that one sentence interrupted a moment  ago.  Ben puts his charcoal back in its box.  BEN  I need some tea. Do you want some?  KATE  I’d love some, thanks.  Ben walks towards the kitchen.  BEN  You remember her, right?  Kate types the rest of the sentence before pausing again.  28",
      "dialogue_count": 2,
      "word_count": 6082
    },
    {
      "scene_number": 7,
      "slugline": "INT. ELLIOT AND KATE’S APT, LIVING ROOM - NIGHT  Ben opens the door, and George comes in, all wet from the  rain outside.  BEN  What happened??  George gives him a hug, a very tight hug, and starts to  cry.  GEORGE  I’m sorry. I’m sorry. I’m sorry.  BEN  Stop it. Don’t be silly.  They hug each other tightly, George now crying like a  baby.  Elliot observes the scene from a distance. Kate wants to  step forward to help out, but Elliot stops her from  moving.  INT. ELLIOT AND KATE’S APT, JOEY’S BEDROOM - NIGHT  Joey is at his desk in front of the computer. Elliot  comes in.  ELLIOT  Son, I need to ask you a favor.  JOEY  What is it?  ELLIOT  Do you mind sleeping on the couch  tonight?  JOEY  C’mon, Dad.  ELLIOT  George is here. He’s upset, and  it’s raining. It’s only for  tonight.  JOEY  Why can’t he sleep on the couch?  ELLIOT  Because. Please, son.  59.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 158
    },
    {
      "scene_number": 8,
      "slugline": "INT. ELLIOT AND KATE’S APT, BEDROOM - NIGHT  Kate reads to the light of her bedside lamp.   Elliot is  under the covers, asleep beside her.  INT. ELLIOT AND KATE’S APT, LIVING ROOM - NIGHT  The back pillows of the couch are thrown on the floor,  and Joey is already asleep under a blanket.  INT. ELLIOT AND KATE’S APT, JOEY’S BEDROOM - NIGHT  Ben is in the bottom bunk. George is in the top.   They  are talking very quietly, intimately.  GEORGE  I talked to the Principal there at  PS-216, who seemed very nice and  smart. He really wants to bring  back a music program.  BEN  Do they have the budget for it?  GEORGE  Not right now, but he seems like  he might be very good at raising  money. He has a very attractive  personality.  BEN  That doesn’t really help us much  right now, does it?  GEORGE  I haven’t finished my story. Can I  finish it?  BEN  They don’t have a job for you,  isn’t that the end?  GEORGE  No, it’s not. You’re such a  pessimist.  BEN  I’m being realistic.  GEORGE  Let me finish!  60.  (CONTINUED)",
      "characters": [],
      "action_text": "BEN  Okay. Go ahead.  GEORGE  Thank you. They have all kinds of  kids there: lots of black and  latin, but also white, a few  Asians. This really cute girl,  Filipino, I think she was. She  played Frere Jacques for me on her  flute.  BEN  George, why don’t you come down  here so I can hear you better.  GEORGE  It’s a bunk bed.  BEN  So?  GEORGE  You told me Joey was already  losing his patience with you. Can  you imagine if you broke his bed  trying to shag your husband.  BEN  I have missed having your body  next to mine too much to have it  denied to me for reasons of bad  engineering.  George sits up, and moves to the edge of the bed.   He  awkwardly maneuvers himself on to the ladder and down the  side.  Ben is squished as far as he can be to the wall, waiting  for George with the sheets pulled back.  George gets into the bed with him.  They take each other in for a long moment.  GEORGE  Do you ever blame me for all of  this?  BEN  Why would I blame you? We did it  together.  61.  CONTINUED:  (CONTINUED) GEORGE  But I knew what might happen. I  knew more than you what we were  risking.  BEN  All I know is that after 39 years  it’s hard to fall asleep without  you.   This situation we’ve gotten  ourselves in is really fucking  with my sleeping patterns.  INT. PIANO STUDENT’S HOME - DAY  A YOUNG GIRL plays at the grand Steinway piano, in this  upper middle class apartment. Even though the metronome  on top of the piano is giving a certain rhythm, the Girl  seems to be following no one in her interpretation of  this Prelude by Chopin.  George walks around the Girl, and the piano, listening  carefully. And as soon as the Girl finishes...  GEORGE  What happened?  The Girl looks at him somehow surprised at his reaction  GEORGE  What was that?! That wasn’t what  we talked about last week.  GIRL  Interpretation.  GEORGE  Yes, and I insist that it is  crucial to let the music take you  someplace, to be surprised by it,  even to allow yourself to be  overwhelmed sometimes.",
      "dialogue_count": 0,
      "word_count": 861
    },
    {
      "scene_number": 9,
      "slugline": "INT. ST. GRACE’S SCHOOL/HALLWAY - DAY  Students in the hallways, at their lockers, some running,  while others confering with a teacher, and with each  other.  GEORGE (V.O., CONT.)  Above all, I urge you to take this  opportunity to have a conversation  with your children about whether  or not justice was served here.  INT. ST. GRACE’S SCHOOL/GYMNASIUM - DAY  A basketball court; the boys sweating, playing,  competitive.  INT. ST. GRACE’S SCHOOL/AUDITORIUM - DAY  Students get ready for a dress rehearsal. They put on  their gowns, and walk up the steps of the chorus.  GEORGE (V.O., CONT)  The last thing I want them to take  from this is that they should hide  who they are, or what they think,  if they believe it will get them  into trouble. Life has its  obstacles, but I’ve learned early  on that they will always be  lessened if faced with honesty.  The students arrange themselves on the steps, playfully  at first, but gradually become solemn and organized, as  the new CONDUCTOR seems ready to start the music.  INT. CORRIDOR OF BEN AND GEORGE’S APT - NIGHT  George walks the same corridor of his old apartment,  towards Roberto’s door.  GEORGE (V.O., CONT’D)  I believe the world is a better  place if people aren't lying.  In the words of the apostle Paul  to the Corinthians: “Love does not  delight in injustice, but rejoices  with the truth.” Yours sincerely,  George Garea.  The Chopin Prelude ends as George opens the door, and  goes inside.  64.  (CONTINUED)",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 247
    },
    {
      "scene_number": 10,
      "slugline": "INT. ELLIOT AND KATE’S APT / JOEY’S BEDROOM- NIGHT  The entrance door opens and Ben comes in. He notices that  the living room is mostly dark and quiet, except for a  reading light that was left on in a corner.  He heads to his/Joey’s bedroom. The door is closed.  Ben opens the door to the bedroom.   He sees Vlad and Joey  sitting next to each other on his bed, with some books on  their laps, which they quickly hide however they can.  JOEY  (shouting)  Can I have some private time,  please?  Ben shuts the door. He realizes he’s arrived at a bad  moment.  Back in the living room, Ben looks around and heads to  the kitchen.  INT. ELLIOT AND KATE’S APT, KITCHEN - NIGHT  Ben opens the door and finds Elliot pouring some more red  wine for Kate, seemingly having “a conversation.”  BEN  I’m sorry, I didn’t think...  ELLIOT  Come in.  Ben enters.  ELLIOT  Do you want some wine?  BEN  Why not.  KATE  How was your day?  Ben can feel the tension still in the air between them.  BEN  Nice. George went to church and I  saw a wonderful movie.  65.  CONTINUED:  (CONTINUED)",
      "characters": [],
      "action_text": "KATE  What did you see?  BEN  The Gang’s All Here .  ELLIOT  No way!  BEN  Do you remember?  ELLIOT  (sings)  But the thing that led to love,  was her polka dot gloves,  while the band played the polka  dot polka .  They laugh. It helps clear the air.  KATE  What is that?  BEN  A Busby Berkeley musical.  ELLIOT  It’s like an acid trip with Alice  Faye and Carmen Miranda. The  dancers hold these huge bananas...  (demonstrating)  ...right here on their hips, like  they have huge penises.  BEN  Oh, not really. It’s not like  that.  ELLIOT  Yes it is. It’s totally phallic.  KATE  I know that scene!  BEN  They have a wonderful new print.  And I have to say Elliot, I was so  happy when they came out with VHS,  we could watch all those old  movies again, and I’m glad I  showed them to you. But watching  this in the big screen, it’s  something else. It’s not even the  same movie.  66.  CONTINUED:  (CONTINUED) ELLIOT  I’d love to see it!  KATE  Let’s go tomorrow night?  ELLIOT  Yes! No, shit. I can’t tomorrow.  Kate swallows her frustration with a big sip of her wine.  KATE  Well, maybe I’ll go on my own.  Ben sips his wine, looking at his nephew, and at Kate.  ELLIOT  (to Ben)  Is Joey asleep?  BEN  I think he and Vlad are still  studying.  KATE  Vlad??  ELLIOT  (to Kate)  What is Vlad doing here?  KATE  Not studying.  ELLIOT  I’m going to go check.  BEN  Don’t go.  ELLIOT  What?  BEN  Last year you two were complaining  that Joey didn’t have any friends.  You were worried he was too  antisocial, you even took him to  see a therapist.  KATE  So?  BEN  Now he has a friend.  67.  CONTINUED: (2)  (CONTINUED) ELLIOT  It’s a little strange.  KATE  There’s nothing strange.  ELLIOT  It’s his only friend, and the  guy’s a lot older.  KATE  He’s 16, he just looks older.  ELLIOT  They’re like Yogi Bear and Boo-  Boo.  Ben laughs at that, but Kate doesn’t think it’s funny.  KATE  Don’t be ridiculous.  INT. ELLIOT AND KATE’S APT, LIVING ROOM - NIGHT  Elliot knocks on Joey’s bedroom doo",
      "dialogue_count": 0,
      "word_count": 1006
    },
    {
      "scene_number": 11,
      "slugline": "EXT. ROOFTOP ELLIOT AND KATE’S BDG -- END OF DAY  The light has changed, it’s later in the day now. Ben  applies subtle brush strokes to the canvas in front of  him. With his finger, he rubs the fresh mix of green and  brown on the painting, for effect. He takes a step back  to look.  Ben looks at the sky. A wind blows, sending dead tree  leaves flying through the air.  INT. STAIRWELL - END OF THE DAY  Ben opens the door from the roof to the stairwell loaded  with his painting materials, carrying his canvas, a box  and the easel all at once. The security door to the roof  shuts and suddenly Ben can’t move. The bottom of the  easel is stuck in the door.  He looks down to see the stairwell of the building  looming underneath. He tries to pull the easel past the  door, but it doesn’t move. Little drops of sweat start to  show on his forehead.  He gives up trying to do everything at once, and places  the canvas on the floor, then he kicks the door with his  foot. He is now able to get the easel past the door,  which closes with a loud clank.  He leaves the canvas behind, and carries the easel and  the rest with him down the stairs.  It’s still a lot to carry, and the place is dark. He  stops midway. A drop of sweat rolls down Ben’s forehead.  He gets nervous, and takes a deep breath. His eyes get  foggy, he has a hard time focusing them. The air gets  rarer. Ben feels faint, and takes a deep breath. The  stairs seem to move from under his feet.  First the easel drops, then the box, which opens and all  the painting materials roll down the stairs.  INT. HOSPITAL ROOM - DAY  In the waiting room of the hospital, Roberto, in his  policeman uniform, Kate and George are crowded around the  DOCTOR, all ears on each word he says.  DOCTOR  The shoulder is a ball-and-socket  joint;  71.  (MORE)  (CONTINUED)",
      "characters": [],
      "action_text": "the ball of the upper arm bone  fits into the socket in the  shoulder blade, and is kept there  by the rotator cuff. He had what  we call a full thickness tear, or  a complete tear.  GEORGE  Can he paint?  DOCTOR  No. I don’t want him to even comb  his hair for a while.  GEORGE  Poor Ben.  KATE  His legs are okay?  DOCTOR  Legs are fine.  KATE  It was so hard to get him to stand  up, and move. I thought he had  broken his leg, he was in so much  pain.  DOCTOR  He dislocated the shoulder, which  means his arm came out of the  socket, and that is very painful,  so any action, any movement with  the body, makes it even worse.  ROBERTO  What about surgery?  DOCTOR  I wouldn’t recommend it right  away. First he needs to rest.  We’re going to put his arm in a  sling, and he should just let it  rest for a couple of months. Then  we’ll try some strengthening  exercises and physical therapy.  Now, George, when was the last  time he had a full cardiac  checkup?  GEORGE  We have our regular checkup every  year.  72.  CONTINUED:   DOCTOR (CONT'D)  (CONTINUED) DOCTOR  You have to take him to see a  cardiologist.  GEORGE  Why?  DOCTOR  It’s not okay for anyone to be  having fainting spells, especially  not at his age.  ROBERTO  I thought he’d just fallen down  the stairs.  DOCTOR  No, he fainted.  GEORGE  He’s felt dizzy before.  DOCTOR  And shortness of breath?  GEORGE  Maybe. I think so. Did he complain  to you, Kate?  KATE  No. Doctor, finish, please.  DOCTOR  A heart condition would explain  the dizziness and the fainting  spells, and nowadays heart surgery  is so advanced... Anyway, I’m not  going to speculate here. I’m an  orthopedist, I’m not a  cardiologist.  INT. ELLIOT AND KATE’S APT, LIVING ROOM - DAY  Ben, a large band-aid above his eye, his right arm on a  sling, is propped up on the couch with two pillows,  reading a book.  Kate comes from the kitchen with a glass of water, and  some medication.  KATE  Here. You should take this now.  73.  CONTINUED: (2)  (CONTINUED",
      "dialogue_count": 0,
      "word_count": 901
    },
    {
      "scene_number": 12,
      "slugline": "INT. HIGH SCHOOL, THE PRINCIPAL’S OFFICE - DAY  A small room with books and files everywhere. Kate is  sitting on the guest chair in the Principal’s office. The  PRINCIPAL leans on her busy desk while talking to Kate.  PRINCIPAL  I don’t want you to worry too  much, it’s not a very big deal. We  deal with similar problems every  day here. But it is serious.  KATE  I’m shocked. He’s such a serious  kid, and such a good student. And  so is Vlad.  PRINCIPAL  There’s been some rivalry between  the two senior classes. It started  between two students, but then it  trickled down to everything from  who’s the most popular to who’s  the smartest. Maybe it’s something  related to this, but I don’t  really know. Did you notice  anything different?  KATE  No. Maybe. Actually, now that I  know this...  PRINCIPAL  What?  KATE  Last night he watched a DVD with  me. It was my pick - a French  movie, and Joey usually would  never sit for the whole thing. He  seemed very interested and stayed  until the very end. We even had a  conversation about it after. That  was sort of unusual.  PRINCIPAL  Vlad has confessed that he took  the books out, and gave them to  Joey, but your son denies having  them.  KATE  Vlad seems to have great influence  on my son. Joey doesn’t have that  many friends.  75.  (CONTINUED)",
      "characters": [
        "ELLIOT"
      ],
      "action_text": "PRINCIPAL  Have you noticed any new books in  the house?  KATE  I haven’t paid attention. I’m  trying to finish my new book. And  Elliot’s Uncle Ben is staying with  us, sleeping in Joey’s room. It’s  a bit of a complicated situation.  PRINCIPAL  Well, I don’t understand why they  would steal these books, they’re  all French literature books.  KATE  I have no idea.  PRINCIPAL  Truth of the matter is that the  books need to be returned to the  library. You can tell your son we  won’t ask any questions now. But  if they’re not returned, Joey will  not be able to graduate. Do I make  myself clear?  INT. ELLIOT AND KATE’S APT, LIVING ROOM - END OF THE DAY  Ben, with his right arm in a sling, is lying on the  couch, trying to read a book; it is a hard cover French  edition of Cyrano de Bergerac. He doesn’t seem  comfortable, can’t concentrate.  Ben puts the book down, and raises from the couch with  some difficulty.  The sunset light comes through the window of the living  room. Kate’s desk is empty, neatly clean. All is quiet.  Ben goes to Kate’s desk, and punches a number on the land  line telephone.  BEN  George  (...)  After the operation, I think it’s  better if I go stay with Mindy.  (...)  Yes, George.  (...)  But it’s really not fair with  Elliot and Kate. And poor Joey.  76.  CONTINUED:  (MORE)   (CONTINUED) (...)  You’ll come on the weekends.  (...)  We should have an answer from  those places soon.  (...)  Why not?  (...)  Of course I trust you. But I want  us to have options.  The door suddenly opens and Kate and Joey come in. Joey  runs into his bedroom, without even saying hello, clearly  upset. The door slams shut.  Ben, still on the phone, looks on as Kate goes inside her  bedroom and shuts her door behind her.  INT. ELLIOT AND KATE’S APT, KITCHEN - NIGHT  A tense dinner at the Hull home tonight. The family is  sitting around the table, their plates empty after  dinner. Ben is the only one still eating. It’s only  pasta, but having his right arm on a slin",
      "dialogue_count": 1,
      "word_count": 3227
    },
    {
      "scene_number": 13,
      "slugline": "INT. JULIUS BAR - NIGHT  George and Ben are on stools at the bar. George tries to  catch the BARTENDER’s attention, with no success. They  are a little out of place among the mostly young and hip  PATRONS.  More YOUNG PEOPLE start to arrive, chatting, flirting,  moving around.  The Bartender comes to help Ben and George.  GEORGE  Finally.  BARTENDER  I’m sorry, I’m sorry. You guys  look very thirsty. What can I get  you?  GEORGE  Scotch on the rocks for me. Vodka  tonic with half a lime and no ice  for the gentleman here.  Ben smiles, George knows him well.  GIRLS flirt with GIRLS who dance with BOYS who flirt with  BOYS.  The Bartender brings the two drinks.  GEORGE  How come it’s so busy here  tonight?  BARTENDER  Thank God it’s Friday!  GEORGE  (to Ben)  The kids have taken over our spot.  BEN  Good for them.  BARTENDER  Are you guys new in the  neighborhood?  91.  (CONTINUED)",
      "characters": [
        "GEORGE"
      ],
      "action_text": "BEN  Are you kidding? There was a  famous “sip in” that happened  right here, in this bar, to  challenge the New York State  regulation that prohibited bars  from serving homosexuals.  BARTENDER  Sure, we have a clipping from   The  New York Times   framed here  somewhere.  Ben points the finger to himself.  BEN  1966. Me and four other guys. We  came here accompanied by five  reporters, and when we were denied  service, we denounced the State  Liquor Authority.  BARTENDER  Oh my God! You’re the guy?  BEN  I’m one of the guys.  BARTENDER  Wow. This round is on me, fellows.  The Bartender goes to help other Patrons. George and Ben  pick up their drinks, and turn their backs to the bar.  They try to hold it in, but soon start to laugh.  GEORGE  You’re such a liar!  BEN  What?!  GEORGE  You’ll do anything for a free  drink!  BEN  But I knew the guy who did the sip-  in.  GEORGE  Frank?  BEN  That was his claim to fame.  92.  CONTINUED:  (CONTINUED) BEN  Amazing. I’m sorry I can’t say the  same to you, George. But at least  I’ve always been honest.  GEORGE  Sometimes I think that ignorance  would have been a lot easier.  BEN  I’m sorry, George.  George takes a long sip, observing the young people  around them.  GEORGE  (softening)  But now that I think about it,  some things you couldn’t have  hidden even if you wanted to.  BEN  What are you talking about?  GEORGE  I’m talking about the time you got  crabs.  BEN  Oh, thanks for reminding me.  GEORGE  And a black eye, that night in  Rio.  BEN  That was a crazy motherfucker  trying to rob me!  They laugh. George raises his glass.  GEORGE  To all the strangers!  BEN  Particularly the ones that bring  us a rent controlled apartment in  the Village. Cheers.  A toast, and the party goes on.  The CROWD drink and flirt, swaying to the beat of the  music, a happy bunch.  94.  CONTINUED: (3)",
      "dialogue_count": 1,
      "word_count": 595
    },
    {
      "scene_number": 14,
      "slugline": "EXT. WEST VILLAGE - NIGHT  Ben and George walk silently side by side on the quiet  streets of the West Village at night.  As they’re about to cross the street, Ben stops for a  moment, taking a deep breath. George notices it, and  holds his arm.  GEORGE  Are you okay?  BEN  Felt a little dizzy.  GEORGE  Too much to drink.  BEN  Yes. I’m fine now.  George lets go of Ben’s arm, and they cross the street.  Side by side, they walk on a side street towards 6th Ave.  BEN  George.  GEORGE  What?  BEN  Remember we used to go to Castelli  and Mary Boone, and you’d say that  one day we’d go there to see my  one man show?  GEORGE  And we will.  BEN  No, we won’t, George.  GEORGE  How do you know? Nowadays you read  about a new “hot artist” every  week.  BEN  Okay, maybe it will happen but not  in my lifetime.  GEORGE  How do you know? It’s all a matter  of taste, and trends.  95.  (MORE)   (CONTINUED)",
      "characters": [],
      "action_text": "Some new curator might look at one  of your paintings one day and  think it’s the greatest thing.  BEN  I just would like to know. Is that  disappointing to you?  GEORGE  Not at all. I say it because I  believe it’s a real possibility,  but it’s not important to me. I  love your paintings, and I don’t  really care what other people  think.  BEN  I guess I did make a couple of  good ones, didn’t I?  They arrive at the Subway Station by the Waverly Diner on  6th Avenue.  BEN (CONT’D)  We’ve had our ups and downs,  George, and I know I wasn’t always  the best husband to you.  GEORGE  I’d rather be your husband, Ben,  than anyone else’s in the world.  And if I had a chance to go back  in time, I would live the same  life all over again. I wouldn’t  change a thing.  George takes Ben’s hand, and they walk down the Subway  Station.  INT. SUBWAY STATION / 6TH AVE - NIGHT  There’s minimal traffic this time of night inside the  station. Even then, maybe out of habit, George and Ben  find a dark, private corner to say goodbye, next to an  empty ticket booth.  It’s time for them to separate for the night. They reach  out to embrace each other, made only slightly awkward by  the sling on Ben’s arm.  BEN  Ouch.  96.  CONTINUED:   GEORGE (CONT'D)  (CONTINUED) GEORGE  Sorry.  BEN  Careful with my arm.  A YOUNG COUPLE walks by, without noticing them.  They walk towards the entrance to the trains. Ben passes  though the turnstile with his card.  BEN  Good night George.  GEORGE  Night, Ben.  George watches as Ben waves and disappears down the  platform.  FADE OUT.  EXT. STREETS OF WEST VILLAGE - DAY  George walks alone on the not so crowded streets of the  West Village, crossing South on 7th Avenue.  EXT. STREETS OF WEST VILLAGE / COURTYARD BLDG. - DAY  George turns the corner into a very quiet, tree lined  street in the Village.  He arrives at the old brick building, and goes through  the gate.  EXT. COURTYARD BLDG. - DAY  The sun reflects on the freshly watered garden, which is  nic",
      "dialogue_count": 0,
      "word_count": 1305
    }
  ]
}