{
  "slug": "love-101-it-begins-2016",
  "title": "love 101 it begins",
  "genre": "romance",
  "format": "series",
  "scenes_count": 6,
  "characters_count": 0,
  "characters": [],
  "total_words": 8879,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. MICKEY’S APARTMENT - LOS ANGELES - NIGHT MICKEY (late 20s, bright, tough) hangs a shelf above her bed in a studio apartment. Her CAT hisses at the window. MICKEY (to cat) What’s wrong, Grandpa? Mickey sees a MAN crawling through her open window. MICKEY (CONT’D) Fuckin’ SHIT! Mickey grabs a book and chucks it at the man’s head. MAN Ow! Jesus! MICKEY ... Eric? She turns on a lamp and sees ERIC (20s, scruffy, chubby) squeezing through her window. He falls onto the floor. ERIC Awww mama. Come here. I love you! MICKEY Dude, you’re bleeding. ERIC I am?   (stares at hand, mesmerized) Wow. That’s how much I missed you. My hand’s bleeding, my   heart’s   bleeding-- MICKEY What am I looking at? Acid? ERIC (smiling) Molly. MICKEY Unbelievable. She walks into her KITCHEN and pulls out a first aid kit. ERIC Maybe I cut my hand on your fence? I had  to climb many fences to be this romantic. TV Calling - For educational purposes only",
      "characters": [],
      "action_text": "MICKEY Ring a doorbell next time. No. Don’t. Just go. You’re not supposed to be here. ERIC I need you mama. I don’t wanna break up. Mickey kneels beside Eric to tend his wound. She softens. MICKEY Yeah. This week’s been rough for me too. ERIC But me too though. Kissy? She knows he’s bad but -- fuck it. Mickey kisses Eric. He touches her with his bloody hand. INT. GUS’S BEDROOM - LOS ANGELES - NIGHT Bedtime. GUS (late 20s, goofy, sincere) stands at the foot of his bed doing an interpretive dance to the   Boston Legal   theme on TV. His girlfriend NATALIE laughs in bed. NATALIE I think this is more for you than for me. GUS You’re welcome! Gus crawls back into bed next to Natalie (20s, grounded, conservative). They kiss and turn back to their laptops. GUS (CONT’D) When is your dad’s birthday again? NATALIE November 9th. GUS Cool. I got a fun gift idea for him. (shows laptop screen) Some slippers that look like beagle paws. Natalie turns her laptop to Gus. It’s a WEB-SITE OF RUGS. NATALIE You should get a rug for your place. GUS Uh-huh yeah, I like that red one. NATALIE I liked the green one.  2. TV Calling - For educational purposes only GUS I was just gonna say, green’s probably my second favorite. MOMENTS LATER: Gus and Natalie have mild “relationship sex” in bed. They talk as Gus goes down on her. NATALIE I’ll just get the green rug for my place-- GUS No I like the green rug. It’s a waste to buy two. Let’s buy one...   for one place . NATALIE Are you--do you want to move in together? Gus re-positions and has sex with Natalie doggy-style. GUS I do. Maybe get our own place? Do you? NATALIE Mmmmmm... yes! GUS (faster, more turned on) Then let’s! Move in! TOGETHER! Gus orgasms as the   Boston Legal   end credits theme plays. INT. GUS’S BEDROOM / MICKEY’S BEDROOM - LATER THAT NIGHT Mickey lays awake in bed, next to Eric who is snoring with a bandaged hand --- as Gus lays awake in bed, next to Natalie who is fast asleep. He pulls out his laptop. Gus stares at his laptop’s",
      "dialogue_count": 0,
      "word_count": 833
    },
    {
      "scene_number": 2,
      "slugline": "INT. GUS AND NATALIE’S NEW BEDROOM - NIGHT Gus and Natalie assemble a bed. It falls apart and Gus throws a temper tantrum with angry tears. It’s a huge turn off for Natalie. The bloom’s coming off the rose. INT. MICKEY’S APARTMENT - NIGHT Mickey and Eric hate-fuck. Fast and angry. Eric is basically frothing at the mouth, he’s so high. ERIC I AM GOD’S WARRIOR! MOMENTS LATER: After sex. Mickey, exhausted and relaxed, rolls over in bed. Eric’s up and around, pacing the room - lit cigarette in one hand, phone in the other. MICKEY Who are you texting? It’s so late. ERIC It’s early. He’s right. The sun is about to rise. MICKEY Tell me you’re not texting Remo for blow. Eric ignores her while he shuffles around, opening and closing doors, drawers, etc. ERIC Babe, you still got that travel “Connect Four” thingy? MICKEY Huh? Why? Eric puts on a song. It’s way too loud. MICKEY (CONT’D) ERIC! ERIC I WANT TO PLAY A GAME FROM MY YOUTH! He holds the empty coke bag to the light and flicks it. Nothing. He peels the bag apart and licks the residue. MICKEY Y’know you have a real drug problem Eric.  5. TV Calling - For educational purposes only",
      "characters": [],
      "action_text": "Mickey opens a little jar of sleeping pills and pops one in her mouth. EXT. GAS STATION - DUSK The delivery truck gases up at a pump in the desert. INT. GUS AND NATALIE’S NEW BEDROOM - NIGHTS LATER Gus does an interpretive dance to the   Boston Legal   theme as Natalie watches in bed, not amused. He crawls in bed. NATALIE Have you brushed your teeth? GUS (lying) Yes. Gus kisses Natalie on the cheek. GUS (CONT’D) I love you. NATALIE Egh. GUS What? What’s wrong? NATALIE You... say “I love you” too much. GUS Too much? I say it once in the morning before work and once more before bedtime-- NATALIE -- and at the end of every phone conversation-- GUS Yeah, because if you die, I don’t want my last words to be, like, “I gotta go” or “I see a cop” or whatever. NATALIE  If I die?!   You say “I love you” to me before you leave a room! Sometimes I’ll hear you saying it to my dog. GUS Oh, so fucking sorry to be AFFECTIONATE!  6. TV Calling - For educational purposes only NATALIE That is not affection! It’s pressure! It’s like if I don’t say “I love you” back then it’ll be a huge thing. GUS Well do you? Do you love me? I love you. NATALIE Stop saying that! Gus loses his temper and slams a door over and over. GUS I love you! I love you! I LOVE YOU! NATALIE I CHEATED ON YOU! GUS (crying and slamming) WHO CARES?! I LOVE YOU! I LOVE YOU!!! NATALIE I FUCKED ANOTHER GUY! GUS I LOVE YOU! I LOVE YOU! INT. ERIC’S HOUSE - NIGHTS LATER Eric lays next to Mickey on his couch. MICKEY You’re begging now? ERIC I’m not begging. I just really, really, really would like you to give me a beej right now. Please? I promise it will only take like, one minute. Probably less. MICKEY Ha! That’s funny. MOMENTS LATER: Eric’s pants are around his ankles. Mickey is on her knees. She caved. He moans with pleasure. ERIC Yes. Keep going. Do the swirly thing... He pushes her head closer and she smacks his hand away. At that moment, the DOOR OPENS and ERIC’S PARENTS (old, normal) walk in on them, stupefied.  7. TV",
      "dialogue_count": 0,
      "word_count": 3320
    },
    {
      "scene_number": 3,
      "slugline": "EXT. DINER - MEANWHILE Mickey and Sophie walk to their cars post-breakfast. SOPHIE So hey you want some sleeping pills? MICKEY What are you, my dealer? SOPHIE Yes. I run an Ambien Empire.   I’m a li’l sleepy Scarface . So what’s keeping you up? Eric still texting all the time? MICKEY No. He stopped. Finally. And all it took was two agonizing months of ignoring him. SOPHIE Well that’s great. Good for you. MICKEY Yeah but now he’s stopped texting and there’s nothing left to ignore. It makes me sad-- it makes me sad I’m sad. I thought I was doing better. SOPHIE You are. This is just residual bullshit. All of this proves you’re over him. MICKEY I guess. Still. Okay gimme pills already. EXT. STREET INTERSECTION - DAY, LATER Mickey, driving from the diner, stops at a red light. Across from her, Gus, driving from work, also stops. The light turns green. The two pass unnoticed.   CAPTION: “DAY”  EXT. AIRPORT PARKING STRUCTURE - DAY Gus parks in an AIRPORT PARKING STRUCTURE. INT. AIRPORT BAGGAGE CLAIM - DAY Gus waits at a BAGGAGE CAROUSEL with his friends NICK (bro-ish) and MANNY (big softie). They’re all laughing.  21. TV Calling - For educational purposes only",
      "characters": [],
      "action_text": "NICK Holy shit, this old guy next to us on the plane was hilarious. He kept telling us dirty jokes that always ended with a guy getting his dick cut off or something. GUS Haha. That old guy is my new best friend. MANNY Hey man, thanks for picking us up. I know it was a tight squeeze with your job and-- GUS Nah. Happy to do it. I missed you dudes. NICK We missed you too buddy. It was awesome getting out of the city for a week. How was your big move out of The Springwood? GUS It’s funny. It didn’t end up happening. NICK That one-bedroom fall through? GUS Kinda. There just wasn’t enough time to move all my stuff out of me and Natalie’s place. So. NICK So you’re at Springwood another month? GUS One more month. Then I’m out. Really. NICK Just go over to Natalie’s and grab your stuff. We’ll help. Natalie won’t care. GUS Yeah I dunno. I mean we only lived there for a few weeks so... maybe we need more time. Like what if we get back together? Manny and Nick exchange concerned glances. Silence. Gus points at a suitcase passing by on the carousel. GUS (CONT’D) ... Is that your suitcase? NICK No.   MANNY No.  22. TV Calling - For educational purposes only",
      "dialogue_count": 0,
      "word_count": 429
    },
    {
      "scene_number": 4,
      "slugline": "EXT. MICKEY’S NEIGHBORHOOD - DAY Mickey parks her car and walks up to a beautiful HOUSE -- EXT. BACKYARD - CONTINUOUS -- and into its BACKYARD where a small BUNGALOW resides. REVEAL: Mickey’s studio apartment is a guest-house behind her landlady’s home. Mickey realizes she’s locked out. MICKEY Shit. Mickey peers over at her landlady’s house. INT. GUS’S CAR - MEANWHILE Gus drives with Nick riding shotgun and Manny in back. They sing along to the ‘00s station on satellite radio. GUS So you two had a fun vacation? MANNY Yeah, I mean, at first I was nervous about travelling with Nick’s parents because I didn’t know if they’d like me-- NICK C’mon, my parents love you. MANNY I love them too. But you know. NICK Well I didn’t tell you, but on our first day in Oahu, my dad pulled me aside and said “Me and your mom really love Manny.” MANNY Really? Aw. That’s cool. Nick reaches back and takes Manny’s hand. They have a sweet couple moment. Gus, missing Natalie, gets jealous. GUS So happy for you guys. MANNY Should we tell Gus? NICK Yeah. You want to or should I?  23. TV Calling - For educational purposes only",
      "characters": [],
      "action_text": "MANNY You do it. GUS What’s going on? NICK Dude, Manny and I are getting married! GUS Whoa! Ok! Congrats! Wow. (very overwhelmed) SO HAPPY for you. My two best friends! MANNY I had no idea he was going to propose. NICK Me neither. But there we were in Hawaii with my family and it just seemed right. MANNY The wedding’s next summer. GUS (eyes filling with tears) Like I said. SO HAPPY for you two. NICK Aw buddy. You okay? GUS I’m great! Such happy, HAPPY news. Y’know I always imagined   this summer would be when me and Natalie would get married ... Gus’s hands begin to SHAKE. He GASPS for breath. NICK Fuck. Is this a panic attack? Pull over. GUS Don’t be nuts. There’s no need to--   acck!  Gus’s arms freeze against his chest and his hands come off the wheel. The car SWERVES. They all SCREAM! MANNY We shouldn’t have told him at the wheel! INT. LANDLADY’S HOUSE - MOMENTS LATER A back-door creaks open. Mickey sneaks in her landlady’s house and tiptoes into the kitchen. She scans a key rack.  24. TV Calling - For educational purposes only FEMALE VOICE (O.S.) .... Are you robbing me? Mickey whips around and sees her landlady DANIELLE (mid- 60s, cool but kind of batty) behind her, drinking tea. MICKEY Danielle! Hi. Sorry, I locked myself out. Usually I keep a spare under my mat but-- DANIELLE I took it. I didn’t want any intruders to get in. That’s the first place they look. MICKEY Ah. Ok. Maybe next time, give a heads up-- DANIELLE You don’t want another intruder breaking into your place, right? MICKEY To be fair, he wasn’t really an intruder. More like my boyfriend. But point taken. DANIELLE Well, I got that bill for the damages to my fence, if you can give it to him. MICKEY Y’know what? I’ll pay it. He and I aren’t really talking anymore. DANIELLE Huh. That’s why it’s been so quiet. EXT. VENTURA BOULEVARD - MEANWHILE Gus swerves his car and parks in the middle of the street. He steps out mid-panic attack and walks between busy lanes of honking traffic. Nick and Manny foll",
      "dialogue_count": 0,
      "word_count": 2170
    },
    {
      "scene_number": 5,
      "slugline": "INT. BLISS HOUSE LOBBY - NIGHT Mickey steps into the Bliss House’s crowded, ornate LOBBY. She scans the crowd and texts Eric. MICKEY’S TEXT  “At BH. U here?”  Mickey straightens out her AMBIEN VISION to take in the lobby, filled with people of ALL AGES in CONSERVATIVE clothes.   Definitely not a club. More like a church . Mickey grabs a STRANGER by the arm. MICKEY Excuse me, where am I? STRANGER The Bliss House. (smiles) Is this your first time? Welcome. Mickey backs away for the door--   only to bump into Eric  looking more cleaned-up and happier . He hugs Mickey. ERIC Mickey! I’m so glad you came! MICKEY Yeah. This bar’s fucking weird. ERIC This isn’t a bar. Have you never heard of Bliss House? MICKEY What, it’s like a night club? ERIC No. I like to think of it as a church for all churches. This midnight service is the best one. You’ll love it. MICKEY Shit, I can’t-- I have to get up early in a couple days. Eric takes Mickey’s hand and guides her into... INT. BLISS HOUSE HALL - CONTINUOUS ... a LARGE HALL, with 120 or so people seated auditorium style. Eric guides Mickey to their seats.  33. TV Calling - For educational purposes only",
      "characters": [],
      "action_text": "ERIC Best seats in the house. They sit down. Mickey looks down at a STAGE in the CENTER of the hall, theatre-in-the-round-style with a LECTERN. MICKEY So this is your new jam huh? ERIC I know it might seem strange, but I felt the same way when I first came. But for once,   I’m happy now   and I guess I just wanted to share that happiness with you. MICKEY I can respect that. Let’s do it up. Mickey tries to sober up as HOUSE LIGHTS lower. NEW AGE MUSIC plays and CLERGY in COLORED ROBES enter. One of the HIGH ELDERS addresses the CONGREGATION at the lectern. HIGH ELDER Good evening! Let us gather and celebrate the majesty that is time and space in all its dimensions. If the mind is a cube, which it is, then let us empty our collective cube of all sights, sounds, tastes, and colors.   Enteh enteh!  Eric and the rest of the congregation surrounding Mickey respond in unison: CONGREGATION  Enteh enteh!  Mickey takes this all in. MICKEY Holy fuck. MICKEY AND GUS’S MASS GATHERINGS SEQUENCE: We see Mickey witness a MIDNIGHT SERVICE at BLISS HOUSE as Gus PARTIES at THE SPRINGWOOD in peak fucked-up mode: ... Gus loses himself on the dance-floor, as Mickey warms up to the CHURCH CHOIR’s music and joins in singing ... Gus shares a joint with Reese, as Mickey gets swept up and raises her arms in unison with the CONGREGATION ... Gus and Hailey make out as Mickey stares at a GLOWING ALTAR (and has a momentary religious experience)  34. TV Calling - For educational purposes only ... Mickey and Gus SYNC UP in their individual moments of LOSING THEMSELVES to JOY and ECSTACY: Mickey prays, as Gus and other semi-naked PARTY-GOERS jump into the pool. EXT. SPRINGWOOD BUILDING - LATER SPRINGWOOD SECURITY clears out the party and sends people home. Gus walks with his new friends, wet and giddy. GUS Oh my god, how fun was that?! NATE You’re a fucking maniac. GUS You guys are a fucking maniac. CHRIS Alright, I have to pack. Hailey. Reese. See you on the airport shuttle? REESE Uck. Yes. In four",
      "dialogue_count": 0,
      "word_count": 2016
    },
    {
      "scene_number": 6,
      "slugline": "EXT. MICKEY’S GUEST HOUSE - MORNING A DELIVERY MAN knocks on the door of Mickey’s guest house. There’s no answer. He leaves behind a LONG BOX addressed to “MICKEY DOBBS” outside her door. INT. CONVENIENCE STORE - MORNING We return to Mickey and Gus waiting in line. They’re both silent. Gus speaks up. GUS It’s cold in here. MICKEY Huh? Sorry? GUS Don’t you think it’s cold in here? MICKEY Yeah. They shouldn’t run the air conditioning in the morning. GUS Exactly. The two go back to waiting in silence. And just as they go in for a second look... END CREDITS.  42. TV Calling - For educational purposes only",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 111
    }
  ]
}