{
  "slug": "loving-2016",
  "title": "loving",
  "genre": "drama",
  "format": "film",
  "scenes_count": 14,
  "characters_count": 2,
  "characters": [
    "SHERIFF BROOKS",
    "JUDGE BAZILE"
  ],
  "total_words": 20446,
  "total_dialogue": 2,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. SMALL FARMHOUSE - NIGHT 1   1  Crickets.   A spring night in rural Virginia.  MILDRED(18) seems nervous.   Her eyes cast down.   She’s  beautiful.   A slender, light skinned black woman.   High  cheekbones hint at a mix of Native American ancestry.  She picks her head up and takes a deep breath.   Her big brown  eyes are soft in the light of the front porch.  MILDRED  I’m pregnant.  RICHARD(24) listens.   He’s a white man with close cropped  blonde hair and a dark neck burned from working outside.  He takes in the information.  A smile breaks across his face, revealing a mouth full of  crooked teeth.   He quickly draws his lips over them,  swallowing the smile.   He’s shy, self-conscious of the teeth.  He begins to nod, a more reserved smile coming through.  RICHARD  Good.   That’s real good.  At this, Mildred’s shoulders drop with relief.  They sit close to one another on the front steps of a one-  story wood planked house.  It’s 1958.   They are young, but a rural working life makes  them seem older than their years.  Richard takes her hand.   She leans into him.  An ominous SOUND grows in the distance.   A rumbling like  thunder.   It builds.  EXT. DRAG RACING STRIP - DAY 2   2  The chassis on an early 50’s Chevy rocks back and forth as  gas charges through the idling motor.  VIRGIL(25) continues to rev the car as he steals a glance at  his competition, another bulked up American machine primed to  explode off the starting line.  Virgil is a mustached black man with thick eyebrows.   He  wears a bowler hat and clinches a toothpick in his teeth.   He  catches the OTHER DRIVER’s eye, a white man.   Virgil smiles.",
      "characters": [],
      "action_text": "A Man snaps a rag into the air.  Tires smoke.   Rubber streaks the asphalt as the cars light  out down the strip.  Richard pops off the hood of a parked car and tracks the  race.   He’s part of a GROUP gathered on the dirt swath that  borders the track.  Mildred is with her sister GARNET(20), a woman of similar  features and beauty.   The Group of seven is made up of blacks  and whites.   Most hold cans of beer.   All follow the race.  The two cars race neck and neck, their chrome bumpers  straining for the lead.   Virgil’s car manages to pull ahead.  Standing by Richard are RAYMOND(20), a thick-necked black man  who is easy to smile when not sweating a race, and PERCY(25),  a tall man who watches more than he talks.   At Virgil’s car  taking the lead, Raymond’s hand comes up.  RAYMOND  There goes.  The other Driver leans into the wheel as if to aid his  chances, but it doesn’t help.  Virgil manages a car length lead as he tears across the  finish line.   He yells and punches at the roof.  Richard’s arm flies up, but he’s silent.   Raymond lets out a  whooping sound before swinging out his massive palm which  Richard meets with a slap.   The Group cheers behind them.  Richard walks back to Mildred, but on his way...  RICHARD  Timing’s still off ‘bout two  degrees.  RAYMOND  Looked fine to me.  (to Percy)  What you think?  PERCY  I think we won.  Mildred runs up and gives Richard a big hug.  2.",
      "dialogue_count": 0,
      "word_count": 533
    },
    {
      "scene_number": 2,
      "slugline": "EXT. DRAG RACING STRIP - DAY - LATER 3   3  Virgil and Percy stand in front of the other Driver and his  CREW, all white, as the Driver counts a stack of cash out and  places it in Virgil’s outstretched bowler hat.  VIRGIL  Now that’s just fine right there, I  told them ‘bout ya’ll that you boys  have ya’ll’s, yes keep on now, you  boys have a fast car right there  but ya’ll is fine to let us race  wit you.  Virgil’s words come out in a jumble, making their meaning  nearly imperceptible though their intention is clear.  The money counted, Virgil sets the cash filled hat on his  head and nods at the other Driver.   He cuts a smile at Percy  before they turn back to join their own group.  The disgruntled men rest against their beaten car.   Their  attention is not on Virgil’s collection, but rather on  Richard and Mildred across the track.  Richard holds Mildred close, kissing her proudly.   The Crew  just stares across at them, visibly seething.  EXT. SHOTGUN SHACK - NIGHT A4   A4  A hillbilly house party in full swing.  A few cars come and go, but most are parked in an array  around the yard.   People spill out of the tiny house.  INT. SHOTGUN SHACK - NIGHT 4   4  The shack is brimming with bodies, thick smoke and booze.  Laughter and shouts fill in amidst fast paced fiddles, banjo  and upright bass pounding out a bluegrass stomp.  The crowd is mostly black, though a few whites are mingled  throughout.   Many look to be Native American.  Richard, his arm around Mildred, clutches a beer and  struggles to shout his point into Raymond’s ear.   An  inaudible reply from Raymond brings a red faced gut laugh  from Richard.   Percy looks over to see what was so funny.  Virgil bumps through the crowd half dancing while carefully  balancing his jar of clear liquor.   He bows the drink to  Mildred, but Garnet’s hand swoops in to take it.  3.",
      "characters": [],
      "action_text": "Garnet wags a finger before taking an eyebrow raising sip at  the stout stuff.   She eyes Mildred, who smiles back at her.  Virgil pulls Garnet up to dance not forgetting to reclaim his  drink.   He proceeds to dance in a way that spreads the crowd.  Mildred nudges Richard.  They laugh watching their friends dance, happy in this place.  EXT. BUILDING SITE - DAY 5   5  Mortar is thrown onto a brick and buttered with a jointer  before another brick comes down on top.   It’s a rhythmic  task, done with precision.  Richard stands in front of a growing wall amongst several  OTHER MEN laying brick at a bustling job site.  BRICKLAYER  Damn Richard.   Slow down.  Richard smiles to himself.   He finishes out his course of  bricks and quickly gathers his tools.   Walking away...  RICHARD  All right now.  BRICKLAYER  Where you goin’?  Richard doesn’t answer.   He moves toward a collection of cars  parked nearby.  EXT. UNCULTIVATED FIELD - LATE AFTERNOON 6   6  A light breeze moves through full summer leaves shading a  hillside.   Grass bends in a low-lying field down below.  Richard’s feet move heel to toe, counting out a length.  Still in his work clothes, he pauses and stares out at the  field down below before finally turning to Mildred.  Time has passed since seeing her last.   A growing belly shows  six months of her pregnancy.   She watches him curiously.  RICHARD  Do you like it?  MILDRED  Like what?  4. RICHARD  Right here.   This spot.  MILDRED  You mean this field?  RICHARD  Yeah.  MILDRED  This field not a mile from my house  that I’ve been knowin’ all my life?  RICHARD  Yeah.  She cocks her head at him, puzzled by this.  MILDRED  Yes.   I like it.  Richard breaks away and faces the lower field again.  RICHARD  I’d put the kitchen back here.  MILDRED  Richard stop this.   I don’t know  what you’re sayin’.  RICHARD  I bought it.   This whole acre.   I’m  gonna build you a house right here.  Our house.  Mildred is speechless.   Her eyes wander over the ground as if  s",
      "dialogue_count": 0,
      "word_count": 728
    },
    {
      "scene_number": 3,
      "slugline": "EXT. TOBACCO FIELD - EVENING 8   8  The tobacco field is vast, bordered on one side by a thicket  of trees and falling off to a horizon on the other.  The sun is quickly setting behind the field, but a DOZEN  PEOPLE, black and white, still toil there.   They slouch over  the plants, weeding grass from between thick green leaves.  Mildred emerges from the thicket of trees, moving fast.   She  rushes into the field weaving between rows.  Garnet barely straightens before Mildred has grabbed her by  the hand and pulls her away from her work.  GARNET  What’s this now?  Garnet is led out of the field back into the trees.  EXT. GROVE - EVENING 9   9  Fireflies have begun to rise in the grove.   Mildred is tucked  against a tree in the midst of a whisper to her sister.  MILDRED  Said he’d bought it for me.   And  then he asked me to marry him.  GARNET  No he didn’t.  MILDRED  Yes.  Mildred’s hand covers her mouth trying to contain her  excitement.  GARNET  Right out in the field?   Oh Lord  that man might be crazy.   When you  gonna do it?  MILDRED  He didn’t say.   Soon though.  Before the baby comes.  Garnet’s eyes move upward as she takes in a long breath.   She  seems troubled.  GARNET  He’s gonna take my sister from me.  6.",
      "characters": [],
      "action_text": "MILDRED  No.   We’ll be right down the road.  Garnet takes Mildred’s hand and holds it to her face.  Mildred smiles, which leads her sister to as well.   They  giggle at one another as evening takes hold.  EXT. LOLA’S HOUSE - DAY 10   10  Chickens peck the morning dew in the yard around a tin roofed  shack.   This is one in a collection of houses built together  in a small community.  Richard’s car pulls in next to a rusty pickup.   He climbs out  as LOLA(48), a weathered woman already missing teeth, helps a  very pregnant WHITE GIRL(17) out of the front door.  RICHARD  Hey Momma.  LOLA  They out back.  RICHARD  Here now.  Richard grabs the young Girl’s hand to help her down the  porch steps.   On the ground, she heads to the pickup.  PREGNANT GIRL  Thank you Miss Lola.   We’ll see you  soon.  LOLA  We’ll be here.  As Richard moves around to the back of the house, the Girl  cranks up the pickup and rattles away.  INT. BARN GARAGE - DAY 11   11  The wooden barn has a poured concrete floor showing its  conversion to a makeshift garage.   The walls are lined with  tools and parts.  Raymond takes a bite from a bologna sandwich before ducking  under the hood of their Chevy race car parked inside.  Richard walks in and surveys the work.  RICHARD  How we doin’?  7. RAYMOND  Get that board and get up under  there.   See if you can’t get this  manifold loose.  Richard snags a roller board and wrench from the corner and  slides on his back under the front end.  The two work in tandem, Raymond from above, Richard from  below.   They work in silence for awhile.   Then...  RICHARD  I’m gonna take Mildred up to D.C.  to get married.  Raymond takes this in, but doesn’t stop working.  RAYMOND  You sure about that?  RICHARD  Yeah.  Raymond lifts the part out and carries it to a table.  RAYMOND  Hold on, stay under there.  Raymond returns with another piece that he drops under the  hood.   Richard, with no need for explanation, grabs the piece  and starts to affix it to the car.  RAY",
      "dialogue_count": 0,
      "word_count": 3158
    },
    {
      "scene_number": 4,
      "slugline": "INT. LOLA’S HOUSE - NIGHT 36   36  Lola has cleaned up the room from the birth.  By the light of a bare bulb, she folds a clean sheet and  places it in a large wooden chest.  EXT. LOLA’S HOUSE - CONTINUOUS 37   37  Richard sits alone on a stoop smoking at the back of the  house.   The moon is bright.   His mind works on the problem.  Stumped, he stands with a flick of his cigarette and begins  to pace.   His head moves as if making an argument with no  words.  He finally sits back on the stoop and stares up at the moon.  He rubs his fingers over his face.  From inside, Lola watches her son through the screen of the  back door.   She returns to her work.  INT. CAROLINE COUNTY JAIL - NIGHT 38   38  Mildred tries to straighten a stiff leg while leaning on the  edge of the cot in the cramped cell.   She massages her belly  with a wince.  MAN’S VOICE (O.S.)  HEY!  Mildred flinches at the sound from down the hall.   A shouting  match erupts between two men in the communal cell.  MAN’S VOICE (O.S.) (CONT’D)  GET OFF ME!   I SAID GET OFF ME  NIGGA!  Mumbling.   Someone laughs.   Then silence.  Mildred draws back onto the cot, trying to make herself  small.  INT. CAROLINE COUNTY COURTHOUSE/CLERK’S OFFICE - DAY 39   39  Richard stands in front of the Clerk’s desk already  frustrated by the situation.  CLERK  We told you to come back on Monday  and talk to the Judge.  21.",
      "characters": [
        "SHERIFF BROOKS"
      ],
      "action_text": "RICHARD  I can’t let her be in there ‘til  Monday.   That’s not right.  CLERK  Talk to the Judge.   You’re not  allowed to bail her out.  RICHARD  I get a lawyer?  CLERK  You can.  Richard swallows his frustration and walks out.  EXT. COURTHOUSE/CLERK’S OFFICE - CONTINUOUS 40   40  Richard storms out of the clerk’s office door.   He stops to  take a breath, trying to stay calm.   He moves across the lawn  toward his car parked on the main street.  SHERIFF BROOKS (O.S.)  Hey boy!  Richard stops to see Sheriff Brooks standing outside his  office.   Richard doesn’t move.  The Sheriff beckons him.  SHERIFF BROOKS (CONT’D)  Come on!  Richard watches the Sheriff walk back into his office.   He  looks around, then walks over.  INT. SHERIFF’S OFFICE - DAY 41   41  Richard steps inside to find Sheriff Brooks seated behind his  desk.   They are alone.  SHERIFF BROOKS  Sit down.  Richard takes a seat in front of the desk, apprehensive.  SHERIFF BROOKS (CONT’D)  You back tryin’ to bail her out?  Richard nods.  22. He made a sparrow a sparrow and a  robin a robin.   They’re different  for a reason.  The Sheriff stares him down, just hoping he makes eye  contact, but Richard never does.  SHERIFF BROOKS (CONT’D)  No.   No.   You go on now.   Get on  home.  Richard lifts from the chair but is stopped at the door.  SHERIFF BROOKS (CONT’D)  You send some of her people down  here tomorrow to get her.   I see  you try and bail her out again I’ll  arrest you.  Richard exits.  EXT. CAROLINE COUNTY COURTHOUSE/JAIL - CONTINUOUS 42   42  Richard walks across the lawn.   He looks up at the jail, but  doesn’t stop moving.  EXT. BUILDING SITE - DAY 43   43  Richard lays brick.   He’s off his pace.   His mind wanders.  EXT. CAROLINE COUNTY COURTHOUSE/JAIL/MAIN STREET - NIGHT 44   44  Richard sits alone in his car at night.  The engine is off and light from a distant street lamp barely  illuminates him.  His arm is propped on the door and he holds his head.   He’s  been here awhile.  His eyes ev",
      "dialogue_count": 1,
      "word_count": 1070
    },
    {
      "scene_number": 5,
      "slugline": "EXT. MILDRED’S PARENTS’ FARMHOUSE - DAY 48   48  Mildred gets out of the car.  Garnet rushes off the front porch to give her a hug.   Mildred  accepts this but cranes her neck, searching.   Musiel steps  out onto the porch alone.  MILDRED  Where’s Richard?  Theoliver walks up to the house and doesn’t stop to speak.  THEOLIVER  Moved his things out.  Theoliver continues inside the house.   Mildred looks  confused.   Garnet takes her hand and leads her to the house.  GARNET  Said they’d arrest ya’ll again if  they catch him here with you.  Mildred stops on the porch and looks back to the road.   No  one is there, but it doesn’t stop her from searching.   Garnet  takes her on inside.  EXT. LOLA’S HOUSE - NIGHT 49   49  The sound of crickets fill the warm night air.  Richard steps quietly out the back door of his mother’s  house.   He waits on the top step, scanning the other houses.  There is no one around.  He moves quickly away from the house and disappears into a  treeline that borders the community.  EXT. WOODS - NIGHT 50   50  Richard moves through dark woods.   Branches and brambles pull  at his pants and scratch his arms.  EXT. WOODS/ROAD - NIGHT A50   A50  Richard pauses to survey a road in the distance.  Headlights appear and he crouches.  The car passes without slowing.   Richard waits to be sure,  and then sprints out of the woods.  26.",
      "characters": [
        "JUDGE BAZILE"
      ],
      "action_text": "He crosses the road and enters the treeline on the opposite  side.   He falls out of sight.  EXT. MILDRED’S PARENTS’ FARMHOUSE - NIGHT 51   51  Richard appears from the woods on the side of Mildred’s  parents’ house.  He hangs close to the trees as he maneuvers to a spot where  he can see the dirt drive.   It’s empty.  Richard moves toward the front door.   He eases open the  screen slips inside.  INT. MILDRED’S PARENTS’ FARMHOUSE - CONTINUOUS 52   52  The house is dark and quiet, similar to the night they were  arrested.  Richard makes his way through, wary of his creaking  footsteps.  INT. MILDRED’S PARENTS’ FARMHOUSE/BEDROOM - CONTINUOUS 53   53  Mildred bolts up in bed at the sound of the bedroom door  opening.  RICHARD (O.S.)  Bean?  Mildred tries to get up but Richard is already beside her.  She wraps her arms around him tight.   She’s crying.  RICHARD (CONT’D)  It’s okay.   I got you.  She begins to settle and Richard pulls back to look at her.  RICHARD (CONT’D)  You okay?   Did they hurt you?  MILDRED  No.   I’m just scared.   They said I  couldn’t see you.  RICHARD  I know.  Mildred wipes at her face, letting a hand cradle over the top  of her belly.  27. MILDRED  What are we gon’ do?  RICHARD  I got a lawyer.   They say he’s the  best in the county.   He’ll get it  straightened out.  MILDRED  I don’t know.  RICHARD  It’s fine.   We just gotta keep to  ourselves for awhile.   This’ll blow  over.  Mildred is comforted by the words even though she doesn’t  entirely trust them.   Richard leans in to kiss her.   He keeps  his head close to hers.  RICHARD (CONT’D)  I better go.  Mildred tightens her grip.   It pains him to separate.   They  lean back together on the bed.   He pulls his legs up to her.  They lie together on top of the covers.   His pants and shoes  still covered in mud from the trek over.  They stay this way for a long time.  INT. MILDRED’S PARENTS’ FARMHOUSE - NIGHT - LATER 54   54  Richard gently shuts the door to Mildred’s bedroom.  He maneuve",
      "dialogue_count": 1,
      "word_count": 3434
    },
    {
      "scene_number": 6,
      "slugline": "INT. LOLA’S HOUSE - NIGHT 78   78  Mildred is still in labor.   She is drenched in sweat and  pushing hard.   She’s at the brink of giving birth.  Richard, at home in this situation, holds her hand.   Lola is  by her legs keeping count by tapping her foot.  LOLA  Keep on.   And...bear down.  Mildred pushes.  EXT. LOLA’S HOUSE - NIGHT 79   79  It’s late.   The house is quiet as is the neighborhood.  Richard stands on the front porch smoking.   Lola steps out  side and dumps a bucket of water off the side of the porch.  Richard speaks just before she’s back inside.  RICHARD  Thank you Momma.  Lola pauses in a rare moment of introspection.  LOLA  You never shoulda married that  girl.  Richard doesn’t even turn to answer this.  RICHARD  I thought you liked her.  LOLA  I like a lot of people.   That  doesn’t mean you shoulda gone and  done what you did.   You knew  better.  Richard doesn’t engage.   He takes a pull from his cigarette  and goes back to watching the street.  Lola walks inside.  INT. LOLA’S HOUSE - DAY 80   80  A new baby’s face swaddled tight.  41.",
      "characters": [],
      "action_text": "GARNET (O.S.)  Sidney.   Sidney.  Garnet holds him, speaking gently.  Mildred and Richard sit on the couch watching.   Mildred is  dressed and looking somewhat recovered.  Mildred’s mother is also there.   They all study the child.  Garnet stands and hands the baby back to Mildred.  The SOUND of cars pulling up.  Richard cranes his neck but has to stand to see out front.  He sees two Sheriff’s patrol cars in the front yard.   Sheriff  Brooks steps out of one and the Deputy from the other.  The two men walk forward and stop by the hoods of their cars.  They wait there.  Richard turns to Mildred.  RICHARD  Call Frank Beazely.  Richard walks outside.   Mildred doesn’t move from the couch.  EXT. LOLA’S HOUSE - CONTINUOUS 81   81  Richard steps onto the front porch.   His eyes meet the  Sheriff’s.   He steps down into the yard.  Richard stays several feet back from the men.   He and the  Sheriff stare at one another.  SHERIFF BROOKS  Tell that woman to come out here.  RICHARD  She’s not here.  SHERIFF BROOKS  Boy.   I will split your head to the  white meat and then go arrest every  soul in that house.   I won’t ask  again.  INT. LOLA’S HOUSE - CONTINUOUS 82   82  Mildred kisses the baby on the forehead and hands him over to  Garnet.  42. GARNET  No.  Mildred stands and slips on her coat.   She walks out of the  house.   Lola has appeared at the kitchen door.   She watches  this all.  EXT. LOLA’S HOUSE - CONTINUOUS 83   83  Sheriff Brooks sees Mildred step outside.  Never looking up, Mildred passes behind Richard and heads for  the Deputy’s car.   He opens his door and Mildred takes her  place in the backseat.   The Deputy closes her in.  Sheriff Brooks stares at Richard.   He eventually follows suit  and walks toward Brooks’ vehicle.  INT. DEPUTY’S PATROL CAR - MOVING - DAY 84   84  Mildred sits quietly in the backseat.  The Deputy barely turns his head to speak to her, but given  the circumstances his voice is kind.  DEPUTY  You’re in luck.   The Judge is in  today.   ",
      "dialogue_count": 0,
      "word_count": 1511
    },
    {
      "scene_number": 7,
      "slugline": "INT. COUSIN’S ROW HOUSE IN D.C. - DAY 96   96  Mildred sits on the couch brushing Peggy’s hair.   She is now  two-years-old.  The television plays in front of them.   Images of the 1963  civil rights march on Washington show on the screen.  Laura walks in the front door carrying two grocery bags.   She  pauses in front of the television to watch the march.  A commotion upstairs sends Mildred’s attention there.  MILDRED  You boys stop that wrestlin’!   Come  help Miss Laura with these  groceries!  LAURA  They say over a hundred thousand  people are there.  Laura moves into the kitchen.   From there,  LAURA (O.S.) (CONT’D)  Can you imagine?  Mildred speaks low, to herself.  MILDRED  Might as well be half way ‘round  the world.  LAURA (O.S.)  What?  MILDRED  Nothing.  Laura walks back in holding items from her grocery bags.  LAURA  You know what you need to do?  MILDRED  What?  LAURA  You need to write Bobby Kennedy.  Mildred laughs this off.  48.",
      "characters": [],
      "action_text": "LAURA (CONT’D)  I’m serious.   That’s what he’s up  there for.  Laura goes back into the kitchen, continuing her thought.  LAURA (O.S.) (CONT’D)  All this talk of civil rights.   You  need to get you some civil rights.  Mildred shakes her head at this.   She watches the images.  She notices Peggy’s face, engrossed by the TV.  Mildred’s eyes go back to the images.  EXT. COUSIN’S ROW HOUSE IN D.C. - CONTINUOUS 97   97  A view from the rooftop of their row house in D.C.   The  neighborhood expands into the distance.  A faint din can be heard.   It’s the sound of the civil rights  march, just over a mile from their house.  INT. COUSIN’S ROW HOUSE IN D.C./BEDROOM - DAY 98   98  Mildred stares blankly at the wall.   She’s lost in thought,  and this continues for a long moment.  She sits at a desk in the bedroom holding a pen.   Eventually,  her eyes move down to sheets of loose notebook paper set out  in front of her.  She puts the pen to the paper and begins writing in a  handsome cursive.  It reads:  “Dear Sir: I am writing to you concerning a problem we  have...”  INT. COUSIN’S ROW HOUSE IN D.C. - NIGHT 99   99  Richard enters the dark house carrying his items from work.  His clothes are dusty from a day’s labor.  He walks into the kitchen.  IN THE KITCHEN,  Richard takes a seat at the table.   He sets his lunch pail  and tool bag down.   He’s beat.  49. Mildred enters.   Without a word, she goes to the sink to get  him a glass of water.  RICHARD  They in bed?  MILDRED  Yes.  She places the glass in front of him and moves behind him.  She rubs at his shoulders.   He relaxes at this.  RICHARD  Sorry I missed ‘em.   They ask for  me?  MILDRED  Peggy did, but she went down fine.  Will you get Saturday off?  RICHARD  I hope.  He takes her wrist and guides her around the chair.   She sits  in his lap.   He lays his head on her shoulder, closing his  eyes.   She kisses his forehead.  They sit quietly together in the dark house.  INT. COUSIN’S ROW HOUSE IN D.C. - DAY 100   10",
      "dialogue_count": 0,
      "word_count": 1121
    },
    {
      "scene_number": 8,
      "slugline": "INT. LAW OFFICE - CONTINUOUS 104   104  A SECRETARY sits at a desk just inside the law office.  BERNIE COHEN  Hi, I’m Bernard Cohen.   I’m in from  Richmond.   I talked to Jack about  using his office for a few hours.  SECRETARY  Yes Mr. Cohen, do you know it?  BERNIE COHEN  Third door?  SECRETARY  Yes.  Bernie walks to a connecting hall but turns back on his way.  BERNIE COHEN  My clients are Mr. and Mrs. Loving.  Could you send them down when they  arrive?  SECRETARY  Certainly.  Bernie finds the third door.   There is a name plate there  reading “JACK GREEN.”  Cohen slips the plate out of its holder and places it in his  jacket pocket.   From the same pocket, he produces a plate of  his own and slides it into the slot on the door.  It now reads “BERNARD COHEN.”   He enters.  INT. D.C. LAW OFFICE - CONTINUOUS 105   105  The office is tidy and nicely furnished.  Bernie immediately goes to the desk and begins gathering up a  collection of frames containing pictures of the other  lawyer’s family.  He goes behind the desk and places the frames in the top  drawer.   He lays out a pad and pen from his briefcase.  There is a KNOCK at the door.  Cohen takes a seat in the desk chair and readies himself.  54.",
      "characters": [],
      "action_text": "BERNIE COHEN  Come in.  The door opens and Mildred enters, followed by Richard.  Bernie immediately stands and comes around to offer his hand.  BERNIE COHEN (CONT’D)  Mrs. Loving?  MILDRED  Yes.  BERNIE COHEN  So nice to meet you.   Please, have  a seat.  He turns to Richard and they shake hands.  BERNIE COHEN (CONT’D)  Bernard Cohen.   It’s a pleasure.  Richard sits, staying quiet.   Bernie takes note of his  demeanor as he goes back behind the desk.  BERNIE COHEN (CONT’D)  Thank you for coming in today.   So  as we discussed on the phone, the  ACLU would like to take on your  case.   I was actually a charter  member of the ACLU here in Virginia  which is why they assigned me to  you.   The bottom line is, we want  to get you all some relief.  MILDRED  That’s very generous.   Thank you.  BERNIE COHEN  I took the liberty of contacting  the courthouse in Bowling Green and  have started a file for you.   Now  the first step is to appeal the  sentence in Caroline County.   That  will be our fastest route into  Federal Court.   The problem is...  RICHARD  Federal court?  BERNIE COHEN  Yes, the goal is to try and get the  Federal Court to hear this case so  we can get...  55. RICHARD  ‘Scuse me, but I don’t understand  Federal Court.  BERNIE COHEN  Well I see it as the best route...  RICHARD  Can’t you just go talk to Judge  Bazile?   I mean we aren’t hurtin’  anybody.   Can’t you just go tell  him that?  BERNIE COHEN  I don’t think...  RICHARD  Just talk to him.   Tell him if he  lets us back in the state we won’t  bother anybody.  Bernie takes a moment, recalculating his approach.  BERNIE COHEN  Look, I do not think this is going  to be resolved in Judge Bazile’s  court, or probably any other court  in the state of Virginia for that  matter.   I believe this is a court  battle that could possibly go all  the way to the highest court in the  land.  Richard looks at him blankly.   Bernie gets specific.  BERNIE COHEN (CONT’D)  It is very likely that this case  could go al",
      "dialogue_count": 0,
      "word_count": 2611
    },
    {
      "scene_number": 9,
      "slugline": "INT. KING AND QUEEN COUNTY FARMHOUSE/KITCHEN - DAY 126   126  Richard, dressed for work, enters the kitchen to kiss Mildred  goodbye.  RICHARD  I’ll try and get home ‘fore dark.  MILDRED  We’ll be fine.  Richard is out the door.  Mildred sits at the kitchen table as a pot of something  steams on the stove.  She is in the middle of writing another letter.  A portion of it reads:  “...We haven’t heard anything from you for so long we had  given up hope.”  INT. BERNIE COHEN’S LAW OFFICE - DAY 127   127  Bernie sits behind his desk reading Mildred’s latest letter.  He mouths a collection of the words.  Bernie puts the letter down, frustrated.   He thinks for a  moment and then presses the intercom button on his phone.  BERNIE COHEN  Martha, I need you to call Chet  Antieau’s office at Georgetown and  try to set a meeting.  INT. GEORGETOWN UNIVERSITY/ANTIEAU’S OFFICE - DAY 128   128  A SECRETARY knocks at an office door.  CHET ANTIEAU (O.S.)  Come in.  The Secretary enters and finds CHET ANTIEAU(51) sitting in a  high backed chair talking with PHIL HIRSCHKOP(27), a baby-  faced man with dark hair wearing a neat blue suit.  PHIL HIRSCHKOP  I’d never seen anything like it.  No matter how many times I go down  there I find something that  surprises me.  66.",
      "characters": [],
      "action_text": "ANTIEAU’S SECRETARY  Excuse me.  The Secretary sets a note down in front of Chet who gives it  a glance.  CHET ANTIEAU  Oh yes, please bring him back.  The Secretary exits.  CHET ANTIEAU (CONT’D)  This is good timing.   I want you to  meet a former student of mine.   He  called about a case you may find  interesting.  PHIL HIRSCHKOP  Sure, what’s it about?  At that moment, Bernie Cohen is shown into the room.   He  enters with a smile and a hand extended to Chet.  BERNIE COHEN  Hello Professor, thanks for seeing  me.  Chet stands to shake.  CHET ANTIEAU  My pleasure.   You came at a good  time Bernie.   This is Phil  Hirschkop, he’s a brilliant civil  rights lawyer.  Phil scoffs at this.  CHET ANTIEAU (CONT’D)  Is it all right if he joins us?  BERNIE COHEN  Please.   It’s nice to meet you.  PHIL HIRSCHKOP  (shaking hands)  You too.  Bernie takes a seat in the open chair.  CHET ANTIEAU  So what’s the problem?  67. BERNIE COHEN  Well, I’m a bit stumped.   The ACLU  referred this case to me concerning  an interracial couple that was  married in D.C.   They were arrested  for living together in Virginia and  the judge suspended their prison  sentence under order that they  leave the state for 25 years.   I  filed a motion to vacate the  judgement with Judge Bazile, the  original trial judge in Caroline  County, but he’s stonewalling me.  He’s had my motion under advisement  for months, and I feel like he  could keep it that way until he  retires.   Of course the ACLU sees  this, and I agree, as a potential  contender to repeal anti-  miscegenation laws nationwide.   I  just need to get the ball rolling  as it were.  Chet looks over to Phil, whose eyebrows are raised.  PHIL HIRSCHKOP  That’s a remarkable case.  BERNIE COHEN  I’m stuck.  EXT. GEORGETOWN UNIVERSITY - EVENING 129   129  Bernie and Phil walk through the campus continuing what has  been a very long conversation.  BERNIE COHEN  But that may not solve the issue.  PHIL HIRSCHKOP  It’s a very delicate situation  ",
      "dialogue_count": 0,
      "word_count": 3117
    },
    {
      "scene_number": 10,
      "slugline": "EXT. KING AND QUEEN COUNTY FARMHOUSE - NIGHT 143   143  It’s late.   Richard still stands guard on the porch.  Raymond has taken a seat.   He smokes a cigarette with the  shotgun set across his lap.  RAYMOND  That truck may just been goin’  fishin’.  RICHARD  Could be.  RAYMOND  You ever hear from anyone at your  work about it?  RICHARD  Not to my face.  Raymond studies his friend.   He shakes his head.  RAYMOND  I’ll say this Rich, nobody’s gonna  tell you what you can’t do.  Richard wishes he could smile at this.  INT. KING AND QUEEN COUNTY FARMHOUSE/KITCHEN - DAY 144   144  Peggy eats a Popsicle and stares at the TELEPHONE MAN  installing a phone in their kitchen.  The Man’s head is tucked near the wall finishing some wiring.  He lifts the receiver off its base and finds a dial tone.  TELEPHONE MAN  You’re all set.  Mildred moves from the stove, wiping her hands on an apron.  MILDRED  Thank you.  She opens the back door for the Man to let him out.  PEGGY  Who we gonna call Mamma?  MILDRED  I don’t want you callin’ anybody.  81.",
      "characters": [],
      "action_text": "Peggy stares at the phone finishing off her dessert.  EXT. KING AND QUEEN COUNTY FARMHOUSE - CONTINUOUS 145   145  Mildred steps outside in time to see the Telephone Man’s  truck pulling away.  Another car is parked in the yard.   Garnet and their Mother  are climbing out of it.  Garnet has to balance her weight as she is pregnant and  showing.  MILDRED  How’d that go?  GARNET  Doctor said she’ll be fine.   Just  put her on aspirin.   Who was that?  MILDRED  Telephone man.   Richard had them  install a phone.   Momma you feel  okay?  MUSIEL  Yes.   You have some tea I can  drink?  MILDRED  Come on.  Mildred shepherds her Mother inside as Garnet follows.  EXT. KING AND QUEEN COUNTY FARMHOUSE - LATE AFTERNOON 146   146  Richard parks his car near the house.  He gets out with his tools and studies a van parked in the  yard.   He walks inside.  INT. KING AND QUEEN COUNTY FARMHOUSE/DEN - LATE AFTERNOON 147   147  Richard enters the house and is surprised to see a TWO PERSON  FILM CREW standing in their den.  The INTERVIEWER, a young woman, holds a microphone.   A YOUNG  MAN holds the camera.  They film Mildred on the couch as the children play around  them.  82. RICHARD  Mildred.   Come here.  Richard walks outside on the porch.  EXT. KING AND QUEEN COUNTY FARMHOUSE - CONTINUOUS 148   148  Richard paces on the porch.   Mildred steps outside and he  gets close.   He speaks in a forced whisper.  RICHARD  I don’t want those people here.  I’m done with all these cameras.  Richard steps back, waiting for Mildred to do something.  MILDRED  I think it’s important.   These  people want to help us.  Mildred walks back into the house.  Richard bites at his lip, frustrated.  INT. KING AND QUEEN COUNTY FARMHOUSE/DEN - CONTINUOUS 149   149  Richard walks back inside.   Mildred is on the couch again  being interviewed.  MILDRED  ...it’s the principle.   It’s the  law.   I don’t think it’s right.  And if we do win we will be helping  a lot of people.  Richard walks over and takes a sea",
      "dialogue_count": 0,
      "word_count": 589
    },
    {
      "scene_number": 11,
      "slugline": "EXT. DRAG RACING PARK - DAY 150   150  This strip is big.   It’s a rally with cars lined up waiting  for their turn on the track.  People mingle around, drinking and watching cars race.  Richard stands on the track at the rear of their car.  Raymond is beside him.   Their car idles next to another  vehicle at the starting line.  Percy stands near the front of the car watching Virgil behind  the wheel.  A pole of lights cycle to green and the cars launch off the  starting line.  The race is over quickly, with Virgil barely pulling out a  win.  RICHARD  Car looks good.  RAYMOND  It’s runnin’ all right.  INT. JUKE JOINT - NIGHT 151   151  The small shack is filled with music and people dancing.  Richard sits at a table with Percy, Raymond and Virgil.  They’re well into a bottle of liquor and not bothering with  setups.  VIRGIL  I miss you Rich.   Hell I can say  it.   Percy, don’t you miss Rich?  With a shrug,  PERCY  Yeah.  RICHARD  I miss you too Virgil.  VIRGIL  So what’s with all this?  RICHARD  All a what?  84.",
      "characters": [],
      "action_text": "VIRGIL  What you got.   You just made it too  hard now.  Richard fends this with a half smile and nod.  VIRGIL (CONT’D)  See you think I’m crazy but you  know what hard is now don’t you?  RICHARD  Yeah.  Raymond keeps a watchful eye on Virgil.  VIRGIL  You white Richard.   You think you  like a black man but you white.  You hang ‘round all these black  folks but when you go to work you  still white.   But not now.   Now you  know what it’s like.   You black now  aren’t you?   You a damn fool.  RAYMOND  Come on now.  VIRGIL  He need to hear it.   Every nigga up  in here wish he were you Rich, and  you ain’t got sense enough for it.  But see you got the fix.   I ain’t  got no fix.   Yourn easy.   All you  gotta do is divorce her.   That’s  easy.   That’s all you gotta do.  RICHARD  Divorce her?  VIRGIL  That’s right.   Easy.  Richard smiles and nods.  RICHARD  I’m gonna divorce her.  VIRGIL  That’s all you gotta do.  Richard’s smile fades as he picks up the bottle and pours  another round.   He slams back the drink.  Raymond stares down Virgil, who is oblivious.  85.",
      "dialogue_count": 0,
      "word_count": 382
    },
    {
      "scene_number": 12,
      "slugline": "INT. KING AND QUEEN COUNTY FARMHOUSE/BEDROOM - NIGHT 152   152  Mildred lifts her head off the pillow when she hears Richard  enter the room.  He takes a seat on the end of the bed and removes his boots.  She can’t see his face.  He sits there, quiet.   Until finally mumbling, inaudible.  MILDRED  Come to bed.  RICHARD  We been talking to lawyers near ten  years now.  MILDRED  Let’s go to bed.  Mildred tries to see his face but can’t.  She moves to the end of the bed to sit next to him.  RICHARD  I can take care of you.  Mildred can see he’s drunk and speaks slightly dismissive.  MILDRED  I know that.  She puts her hand on his back.  He finally looks at her.   His eyes have tears in them.   She  has rarely seen him like this.  RICHARD  I can take care of you.  Mildred begins to nod.  MILDRED  I know.  Richard looks down.  INT. KING AND QUEEN COUNTY FARMHOUSE - DAY 153   153  Richard, his heavy coat on, steps outside the front door.  86.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 175
    },
    {
      "scene_number": 13,
      "slugline": "EXT. KING AND QUEEN COUNTY FARMHOUSE - DAY 154   154  The ground is covered in snow.   The fields and trees are all  white with ice.  Richard crunches across the yard to a wood pile and begins  gathering up a stack.  A shiny black Lincoln is parked in the yard.  INT. KING AND QUEEN COUNTY FARMHOUSE/KITCHEN - DAY 155   155  Richard enters the kitchen with the wood.  Bernie and Phil are seated at the kitchen table across from  Mildred.   Bernie sips a hot cup of coffee.  BERNIE COHEN  It’s good.  Richard adds the wood to the stove and takes a seat at the  table next to Mildred.   Bernie can’t contain his smile.  BERNIE COHEN (CONT’D)  So I have some really terrific  news.   The Supreme Court of the  United States has agreed to hear  our case.  MILDRED  Oh!  Mildred’s hands go to her face, ecstatic.  PHIL HIRSCHKOP  Of course, the state of Virginia  will mount their defense, but we  are feeling very good about our  chances here.   You’ve got the full  weight of the ACLU behind this.  MILDRED  It’s a miracle.  Mildred grabs Richard’s hand.   Richard has not moved, nor  smiled.  RICHARD  What’s their defense?  BERNIE COHEN  I’m sorry?  87.",
      "characters": [],
      "action_text": "RICHARD  Virginia.   How are they gonna  defend what they done to us?  BERNIE COHEN  I guess we won’t really know until  the hearing, but it’s expected  they’ll use a defense similar to  something they’ve used before.  RICHARD  And what’s that?  Bernie looks to Phil.   They realize they can’t avoid it.  PHIL HIRSCHKOP  It’s your kids.  RICHARD  Our kids?  BERNIE COHEN  Yes.   The state of Virginia will  argue that it’s unfair to bring  children of mixed race into the  world.   They believe they are  bastards.  Richard stares at Bernie on this point.   It’s rare for him to  make this much eye contact.   Bernie looks down.  After a moment, Bernie tries to pick things up.  BERNIE COHEN (CONT’D)  Now, as the defendants in this  case, you both are allowed to come  hear the arguments.  RICHARD  No.   We won’t need to do that.  BERNIE COHEN  Well it’s a very big honor to sit  in front of the Supreme Court.  Very few people...  RICHARD  No.   That’s fine.   Scuse me.  Richard stands and leaves the room.   Bernie looks at Mildred,  who just smiles.  BERNIE COHEN  Mildred?  88. MILDRED  I wouldn’t go without him.  EXT. KING AND QUEEN COUNTY FARMHOUSE - DAY 156   156  Richard stands on the porch smoking a cigarette.   He looks  out over the cold landscape.  Bernie exits the house and takes a place on the steps.  BERNIE COHEN  You know, Richard, it’s of course  up to you not to attend, but you  should know, the Supreme Court only  hears maybe 1 out of 400 cases.  It’s historic.  RICHARD  Thank you Mr. Cohen.  Bernie is stumped.  BERNIE COHEN  Well.   Is there anything you want  me to tell them, and of course by  them I mean the justices of the  Supreme Court of the United States?  Richard thinks on this for awhile.   He nods.  RICHARD  Yeah.   Tell the judge, tell the  judge I love my wife.  This strikes Bernie.   He understands Richard, possibly for  the first time.  EXT. JOB SITE - MORNING 157   157  Sunlight breaks through just above the horizon.  The snow has all melted.   ",
      "dialogue_count": 0,
      "word_count": 584
    },
    {
      "scene_number": 14,
      "slugline": "EXT. SUPREME COURT OF THE UNITED STATES - DAY 158   158  Several cars idle at the curb.  Phil, accompanied by his FATHER, climbs out of the first car.  Bernie climbs out of the other.   He reaches in for his WIFE  and leans down to address his Secretary, who is driving.  BERNIE COHEN  You’re okay to park?   Thanks  Martha.  Bernie shuts the door.   Both cars drive away.  He turns and is stopped by the sight in front of him.  The Supreme Court of the United States.  It’s a massive stone building with expansive white steps  leading up to it.   It’s both daunting and inspiring.  Bernie looks to Phil, who is also pausing to take in the  breadth of the building.  They look at one another, nervous yet determined, and begin  making their way up the steps.  INT. KING AND QUEEN COUNTY FARMHOUSE - DAY 159   159  Mildred sits in their bedroom at a push pedal sewing machine.  She runs fabric through, pausing occasionally to inspect her  stitching.  INT. SUPREME COURT OF THE UNITED STATES - DAY 160   160  A microphone stands empty atop a lectern.  Phil Hirschkop approaches.   He looks nervous, but speaks with  authority.  PHIL HIRSCHKOP  May it please the court...  EXT. KING AND QUEEN COUNTY FARMHOUSE - DAY 161   161  Sidney scales up a tree in the yard.   He drags a braided rope  up with him and begins tying it around a fat limb.  90.",
      "characters": [],
      "action_text": "PHIL HIRSCHKOP (V.O.)  You have before you today what we  consider the most odious of the  segregation laws and the slavery  laws, and our view of this law, and  we hope to clearly show is that  this is a slavery law.  Donald and Peggy stare up at their brother in the tree.   The  rope begins to dangle of its own accord, and they quickly  take hold.   Swinging, they laugh and shout.  PHIL HIRSCHKOP (V.O.)  We ask that the Court consider the  full spectrum of these laws and not  just the criminality, because it’s  more than the criminality that’s at  point here.  Richard patches a board on one of the out buildings.   He  pauses at the cackling of the children.  PHIL HIRSCHKOP (V.O.)  It’s the legitimacy of children,  the right to inherit land, and  many, many rights...  He watches them playing at the tree.   There couldn’t be a  happier place.  INT. KING AND QUEEN COUNTY FARMHOUSE/KITCHEN - DAY 162   162  Donald stands on a chair at the sink filling a pitcher with  water.  Mildred bounces between the table and the stove.   She sets  plates, stirs a boiling pot, and guides Donald all at once.  MILDRED  Just stir it now.  CHIEF JUSTICE WARREN (V.O.)  Mr. Cohen.  BERNIE COHEN (V.O.)  Mr. Chief Justice may it please the  court...  Donald grabs a big spoon and begins stirring as Peggy runs in  and finds a spot nearby to observe.  Richard enters with his hand on Sidney’s head.   He steers him  toward the table and they take a seat.  91. BERNIE COHEN (V.O.)  What is the danger to the state of  Virginia of interracial marriage?  Peggy helps Donald carry the heavy pitcher over to the table.  Richard leans over in his chair to help make sure it finds  its way onto the table.  BERNIE COHEN (V.O.)  What is the state of the danger to  the people of interracial marriage?  Mildred brings a bowl of food over with her and the family  find their respective spots at the table.  BERNIE COHEN (V.O.)  Marriage is a fundamental right.  Scooping, pouring, passing.   The family eats.  INT. K",
      "dialogue_count": 0,
      "word_count": 1433
    }
  ]
}