{
  "slug": "lucy-in-the-sky-2019",
  "title": "lucy in the sky",
  "genre": "sci-fi",
  "format": "film",
  "scenes_count": 10,
  "characters_count": 0,
  "characters": [],
  "total_words": 14488,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. HALLWAY. JOHNSON SPACE CENTER - DAY Laura walks down a busy NASA hallway. She stops at one door that’s slightly ajar. She turns 180. Walks away. Get’s a few feet down the corridor -- stops. She looks back. CUT TO: INT. MARK’S OFFICE. JOHNSON SPACE CENTRE - DAY KNOCK KNOCK. Laura pokes her head in to see -- -- Mark, fast asleep at his desk. The tinny sounds of Steely Dan coming from an early iPhone on his desk. Laura closes the door quietly and walks over to him. She leans close, getting just inches from his face-- -- and SLAMMING HER HAND ON HIS DESK-- Mark startled awake, gasps a big, shocked breath. Laura laughs. Mark plays cool. MARK I’m awake. I am. Wide awake. LAURA What you doing for lunch? Mark places a paper bag on his desk. MARK Got a packed lunch. She reaches into the bag, pulls out a SIX-PACK OF BUDWEISER. MARK (CONT’D) It’s late notice but I could see if the maitre D has a table for two. CUT TO: EXT. SECLUDED ROAD. JOHNSON SPACE CENTER - DUSK Laura’s SUV parked on a SIDE ROAD in the Johnson Complex. The decommissioned Saturn V Rocket visible from her windshield. Inside, Mark and Laura split an order of fries. Mark pops the top of a can of beer; hands it to Laura. As she sips, a car drives by. Laura repositions to hide the fact she’s drinking. Mark laughs at Laura’s cautiousness. LAURA It’s like we’re back in high school smoking under the bleachers.  44.",
      "characters": [],
      "action_text": "Mark takes a big swig from his can. MARK You never smoked under   no  bleachers. Uh uh. LAURA What? Why? MARK You’re a straight arrow. You never did a wrong thing in your life. LAURA I’ve done plenty of things wrong. MARK I bet you never even came second. Beat. It’s true. LAURA Look, Mr. Know-it-all, I done plenty of tawdry shit, I’m here to tell ya -- MARK Hit me. Laura thinks for a moment but she is genuinely stumped. MARK (CONT’D) How about -- smoking under the bleachers? LAURA Nope. Never did that. Mark laughs and takes another sip. He stares out the passenger window and sighs. He suddenly seems very lost. LAURA (CONT’D) Hey, you okay? MARK Yeah. My kids -- (sighs) -- none of this is easy. Laura nods. She thinks. Then -- LAURA The other night the guys were talking about being in orbit --  45. MARK You felt it right? Up there. Laura stops. This is a step out of her comfort zone. LAURA Felt what? MARK You tell me. Maybe you didn’t. She searches for words to describe the indescribable. LAURA Like being blasted completely apart and put back together and instantly I felt like -- I felt like -- MARK You understood it all. LAURA Yes. Oh my god. Yes. What the hell? MARK A sense that everything’s a part of everything else. All separation between things is illusion. LAURA Out of nowhere. I was looking down. I realized -- I realized -- MARK You realized who you are and why we’re all here. Right? We’re the fringe that feels. Laura is suddenly wide open. She leans and KISSES HIM, fully and deeply -- just as quickly, she pulls away. LAURA God I’m so sorry. I can’t do this. MARK What are we doing? We’re just kids smoking under the bleachers. He leans and kisses her. Laura kisses back. More passionate than the first. She reaches for his belt. They pull at each other. Urgent. Hungry. Unstoppable. As they do EVERYTHING SHAKES around them -- as if they’re strapped to a booster rocket.  46. THE EDGES OF FRAME SLIDE AWAY -- the claustrophobia of her world expanding -- the adrenaline",
      "dialogue_count": 0,
      "word_count": 2418
    },
    {
      "scene_number": 2,
      "slugline": "EXT. TRACK. JOHNSON SPACE CENTER - DAY Laura runs hard, trying to keep her thoughts at bay. Ahead of her she sees ERIN ECCLES, her stride easy, her form good. Laura ACCELERATES. ERIN turns, sees her coming, speeds up. The two women race. Erin’s legs are longer, but she doesn’t have Laura’s drive. Slowly, but surely Laura gains on her, pulls even. CLOSE UP ON ERIN The strain shows on her face. She looks over, uncertain. CLOSE UP ON LAURA She’s in top shape again. If she has to, she’ll run this bitch down for the next ten years. ERIN realizes this, slows, lets Laura pull ahead. CLOSE UP ON LAURA Pulling away. We see the triumph on her face. CUT TO: INT. LAURA’S OFFICE. JOHNSON SPACE CENTER - DAY Laura’s at her desk, annotating technical manuals. She continues reading as she opens her desk drawer and takes out a small bottle. Knocks out two orange pills. Swallows cold coffee and finds a card on her desk. It’s nothing special, just a piece of folded over yellow paper. Inside, the card reads: “ Lunch? My truck or yours ?” CUT TO: INT. MOTEL ROOM. HOUSTON, TX - EVENING Laura and Mark fall back on a tangle of sheets. Laura turns to Mark, watches him as he dozes. It’s possible he’s fallen asleep right there. She whispers very quietly: LAURA I love you. I love you. I love you. -- there’s no way Mark heard it. But then --  56.",
      "characters": [],
      "action_text": "-- he reaches, wraps an arm around her, and pulls her closer. She pushes into him. He whispers in her ear: MARK I love you. I love you. I love you. Laura is ecstatic. They kiss. Like lovers in love. CUT TO: INT. SHUTTLE SIMULATOR. JOHNSON SPACE CENTER - DAY Another drill. Laura is there with Chithra and TWO other ASTRONAUTS. An ALARM rings. MISSION CONTROL Mission fail. LAURA Run it again. CHITHRA Laura, it’s late. LAURA Run it again. CUT TO: INT. ENTRYWAY. WALLACE HOUSE - NIGHT Dark. Everyone has gone to bed. Laura tip toes up the stairs. CUT TO: INT. MASTER BEDROOM. WALLACE HOUSE - CONTINUOUS In the darkness, Laura passes by the bed where Drew is sleeping. We see he is still awake. Laura doesn’t. Drew stares into darkness. Laura goes into the -- INT. BATHROOM. WALLACE HOUSE - CONTINUOUS Laura opens the medicine cabinet. She’s tired, burning it at both ends. She grabs the PILL BOTTLE, shakes out TWO MORE ORANGE PILLS, takes them. Around her, the bathroom light feels too bright. She winces, squints up at it. ANGLE ON THE BULB The light flaring until THE SCREEN FILLS WITH WHITE LIGHT.  57. LAURA Damn, that’s bright. OUT OF TOTAL WHITE-OUT bleached facial features appear. HANK (O.S.) You OK? We are BACK IN SPACE, in widescreen, Laura floating in her space suit. LAURA That’s so bright. The Earth floats below her. LAURA (CONT’D) So bright. Hypnotized, LAURA reaches up, unfastens her helmet, seduced by the view. She LIFTS OFF HER HELMET, lets it float free. Somewhere in her brain she believes she can do this, become a being of pure light, celestial. She takes a DEEP BREATH, and for a second it seems like it will work -- she will transcend mortal bounds -- then her face changes. LAURA BEGINS TO CHOKE, her eyes start to bug out. Inside her body, fluids begin to boil. ICICLES FORM on her eye lashes, her skin turning blue. She tries to scream, but nothing comes out. As we watch she DRIFTS AWAY. We watch her go until she’s just a white dot in the distance, another astral body",
      "dialogue_count": 0,
      "word_count": 3090
    },
    {
      "scene_number": 3,
      "slugline": "EXT. BANANA RIVER VIEWING SITE. KENNEDY SPACE CENTER - DAWN Tourists are gathered near the large countdown clock at the Banana River Viewing Site on Cape Kennedy. Laura’s parked away from people. On the roof of her truck. Nervous. She reaches in a coolbox and cracks a beer. Looks in her hand. One orange pill. Knocks it back with the beer. CUT TO: INT. MISSION CONTROL. KENNEDY SPACE CENTER - SAME TIME Flight Director walks the aisles of mission control, headset on, listening to the calls. Pete is on command: PETE T-minus 4 minutes, stand by for readiness check. MISSION FLIGHT DIRECTOR (O.S.) Roger that Command. CUT TO: EXT. VIEWING SITE. KENNEDY SPACE CENTER - SAME TIME Kids chase each other around. Laura watches them in the sun. She’s chewing gum. Amped. On edge. PETE (V.O.) Cooling systems: Go/no go? MISSION FLIGHT DIRECTOR (V.O.) Go. CUT TO: INT. MISSION CONTROL. KENNEDY SPACE CENTER - SAME TIME The team at work, focused. PETE Fuel cells: go/no go? MISSION FLIGHT DIRECTOR Go. PETE Life support: Go/no go? CUT TO:  72.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 179
    },
    {
      "scene_number": 4,
      "slugline": "INT. COCKPIT. ENDEAVOR SPACE SHUTTLE - SAME TIME We see MARK and the crew, suited up, running their final checklists. MARK Life support is a go. From his face we go to -- CUT TO: EXT. VIEWING SITE. KENNEDY SPACE CENTER - SAME TIME Laura, watching the shuttle, praying for its safe launch. Tension builds. Of all people, she’s knows exactly how dangerous this is. But it’s different sitting on the other side of the fence. Worse. Tannoy starts a direct audio feed. LAURA Oh shit. It’s gonna go. MISSION CONTROL (V.O.) Launch T-minus ten seconds. The large clock rolls backward from ten seconds. The crowd gathered starts chanting numbers backward -- CUT TO: INT. MISSION CONTROL. KENNEDY SPACE CENTER - SAME TIME PETE Ten. Nine. Eight. Seven. Six. CUT TO: EXT. VIEWING SITE. KENNEDY SPACE CENTER - SAME TIME Laura is living every second of this. It’s agony. LAURA Five. Four. Three. Two. PETE (V.O.) --ONE! Solid booster ignition. The countdown clock rolls to   ZERO.   The crowd cheer. Laura winces. Willing a skyscraper to soar. In the distance, a   BRIGHT FLASH   of smoke and light as   Endeavour ’s twin boosters ignite. The lion roar of man. She holds her breath.  73.",
      "characters": [],
      "action_text": "PETE (V.O.) Liftoff. We have liftoff.  Endeavour   arcs skyward, flame reflected on the water of the Banana River. Every inch of ascent costing Laura everything. LAURA Clear the tower. Clear it. Her beating heart the fuel of ascent. Inches past the tower. LAURA (CONT’D) Go. Yes! Go. At this early hour, the booster is brighter than the rising sun. Monstrous plumes of smoke and steam, thousands of feet long billow from the launch site. LAURA (CONT’D) Go. GO! GO!!! The small crowd thinly cheers -- how could they not? Laura -- eyes fixed on the orbiter-- starts laughing with the joy of it all. She looks around herself. Marooned on her home planet. No one she can share anything with. Deeply alone. Over this: NASA FLIGHT CONTROL (O.S.)  Discovery’s three liquid fuel main engines now throttle back to sixty- seven percent of rated performance.  CUT TO: VIDEO FOOTAGE Of the DISCOVERY LAUNCH, weeks earlier. We see the main rockets firing, flames white against the blue sky. NASA FLIGHT CONTROL (O.S.)  -- reducing stress on the shuttle as it breaks through the sound barrier.  We PULL BACK to FIND we are in -- INT. AUDITORIUM. JOHNSON SPACE CENTER - DAY Drew moderates a panel with Laura, Hank, Chithra, Cole and Henckle. There is a mostly packed house of a hundred people in the audience.  74. DREW And Commander Lynch, take us back there for you -- this was your second ride on the big slingshot, right? HANK Yes, I flew Columbia, March 2002. (beat) Look, when you’re strapped to a ten ton rocket full of explosive jet fuel all you can do is hold on tight. On SCREEN we see footage of the astronauts in the cockpit during takeoff. ANGLE ON LAURA Everything -- her time in space, her Nana’s death, the intensity of the affair with Mark, and now his absence literally from the Planet Earth -- is tying her brain in knots. DREW (O.S.) And obviously, Endeavor is up there right now, circling the globe sixteen times a day. Any advice for them? Laura looks out into the audience, sees -- ANGLE ON M",
      "dialogue_count": 0,
      "word_count": 2220
    },
    {
      "scene_number": 5,
      "slugline": "INT. MASTER BEDROOM. WALLACE HOUSE - DAY Laura packs a suitcase, not really paying attention to what she takes. CUT TO: INT. KITCHEN. WALLACE HOUSE - DAY Laura sits at the kitchen table, writing a note. ANGLE ON THE NOTE  Dear Drew .   There’s no easy way to say this. I’ve fallen in love.  She balls it up, throws it. Tries again.  Kids, Mommy needs to take a little time for herself.  ANGLE ON THE CORNER OF THE ROOM Where this note too, crumpled into a ball, flies into frame and comes to rest near the first. ANGLE ON LAURA’S SUITCASE In the hall, as she grabs it. ANGLE ON LAURA OVER THE CRUMPLED NOTES as she hurries out the front door with her suitcase. Her engine is revving too high. Clearly, she’s not thinking straight. CUT TO:  A GIANT “WELCOME HOME!” BANNER  EXT. MARK GOODWIN’S BACKYARD. HOUSTON, TX - DAY Mark’s daughters are throwing a huge welcome back barbecue. Kids splash in the pool, Hawaiian shirts puff cigars, potato salad and deviled eggs is unwrapped. Manning the grill is the man of the hour: Mark. Completely recovered from being in space just hours earlier. MARK No. Uh-uh. Charcoal. You need twenty-two medium-sized charcoals lit in a chimney starter. 22. Let those burn to eighty percent grey and spread it evenly. I’m giving you the keys to heaven here.  85.",
      "characters": [],
      "action_text": "Even Mark’s estranged wife   MARY   seems to be welcoming the hero home. Mark reaches out, playfully swatting her ass. MARY Don’t push your luck, flyboy. MARK There any other way to play? Mary shakes her head, laughing and walks off. MARK (CONT’D) Telling you guys, stint up there, it’s a cure-all. Lets the ladies realize how cool you are and just how much they all miss you. Who wants a burger? Everyone does, especially from an American hero. As Mark hands out charred flesh: LAURA (O.S.) Save one for me? Mark turns to find --   Laura, all dressed up and holding a potted African violet.  LAURA (CONT’D) Welcome home, space-boy. CUT TO: INT. GARAGE. MARK’S HOUSE - MOMENTS LATER Mark pokes his head into the garage to make sure the coast is clear before pulling Laura in with him. As soon as the door closes, Laura goes for a kiss, Mark pushes her away. MARK What the fuck are you doing here? LAURA I left him. MARK What? Have you been drinking? Laura hands Mark the African violet as if that explains it. LAURA It’s a barbecue. You’re back, I brought you this, and I left Drew so we can be together.  86. Mark looks at the potted flower in his hand, the full extent of this finally crashing down on him. MARK Laura, what the fuck? Laura shudders. She presses her hands to her temples. MARK (CONT’D) This is unbe -- VOICE (O.S.) Dad? Emily, Mark’s daughter, stands at the open door. MARK Sweetheart! Hey! Daddy’s just talking here OK? Be right out -- EMILY Momma wants to bring out the cake. MARK OK. Cool. Emily leaves. But the door’s open, they’re entirely exposed. MARK (CONT’D) You just need to leave. Now. LAURA But I -- MARK Right fucking now. He hands the African violet back and storms out. CUT TO: INT. LIVING ROOM. MARK’S HOUSE - MOMENTS LATER Laura rushes through his house, on the verge of tears. She’s desperate to get out before the water works start but the house is one of those big, suburban monsters-- square footage and dining nooks at every turn. But, then-- -- there’s the do",
      "dialogue_count": 0,
      "word_count": 988
    },
    {
      "scene_number": 6,
      "slugline": "INT. HALLWAY. JOHNSON SPACE CENTER - DAY Laura carries the same African violet down the row of offices until she reaches the door marked “GOODWIN”. Outside the door, she stops, listens: is that laughter from inside? When she can take it no more, Laura opens the door -- CUT TO: INT. MARK’S OFFICE. JOHNSON SPACE CENTER - CONTINUOUS  Mark and Erin, a little too close . Mark looks up, surprised-- MARK Heyyy! Laura?! OK. Something suspicious about Mark and Erin’s body language. MARK (CONT’D) Erin’s been having a little trouble with some, uh, shut down protocols. LAURA She had a lot of trouble with them the other day. MARK I said we’d give her a few pointers -- ERIN You’re a peach. Thanks Mark. (to Laura) Bye. Erin passes Laura, their eyes locking. Mark closes the door behind her and turns to Laura. MARK We need to talk. LAURA I’ve just got so much I want to say. I forgot to give you this. She hands him the African violet. He puts it down. MARK What did you say to Drew?  90.",
      "characters": [],
      "action_text": "LAURA Nothing. I left a note. All that matters is that you want me and I want you. I don’t care -- Laura leans in to kiss but he pulls away-- MARK -- see I do. I care. You of all people know that. This, right here, this matters. To me. To us. LAURA I wrote a note. He deserved to know. MARK What? Exactly. Did he deserve? LAURA I told him we were in love. Mark looks as if he’s been shot. MARK You said what? Oh fuck me. We’re screwed. You’ve screwed me. Laura shrinks away from Mark, unsure how things ended up like this. Mark looks at his watch. MARK (CONT’D) Look, I’m not even supposed to still be here. I’ve got to be in Orlando. Flight leaves first thing. When I get back, we’ll fix this. I have no idea how but -- fuck me. LAURA Where are you going? Orlando? MARK Work. It’s a boring trip. Laura grabs Mark desperately. She never wants to let him go. LAURA You have to stay. We have to talk. MARK I can’t. PR junket stuff, Paxton’s breathing down my neck -- no choice.  91. Laura’s heart sinks. She’s heard that line before and it’s enough to make her panic inside. She buries it. MARK (CONT’D) Why? Why mess everything up when it was going so good? Laura can’t respond. She’s overcome. Searches for words -- LAURA I wanted it to be real. Mark shakes his head and goes out the door leaving her alone. Laura stares ahead. No tears. Numb. CUT TO: INT. SHUTTLE SIMULATOR. JOHNSON SPACE CENTER - LATER Laura sits alone in the quiet simulator, the only crisis now inside her head. There is a KNOCK. She looks up. PAXTON Thought I’d find you out here. She looks at him blankly. PAXTON (CONT’D) Just got the word. It’s official: you are selected for crew duty. You’re going back Commander Wallace. LAURA  Atlantis ? PAXTON You betcha. Laura stares straight ahead. No reaction. Flat. Nothing. PAXTON (CONT’D) Not quite what I was expecting -- Laura looks at him as though from deep in a dream. LAURA I don’t know what to say. PAXTON Say thank you. I know how bad you wanted this.  92. LAURA Thank you.",
      "dialogue_count": 0,
      "word_count": 1063
    },
    {
      "scene_number": 7,
      "slugline": "INT. HALLWAY. JOHNSON SPACE CENTER - NIGHT Late. Everyone gone.   Almost   everyone. Laura makes her way toward Mark’s darkened office. She tries the handle:   locked.  Laura reaches into her bag, pulling out a drill hammer and her newly made bump key. She hits it a few times without success -- wincing at the noise -- then.  --   CLICK --  -- the tumblers bump. The key turns. And the door opens. CUT TO: INT. MARK’S OFFICE. JOHNSON SPACE CENTER - CONTINUOUS Laura slips in, shutting the door behind her. Mark’s office is the same as it ever was-- more man-cave than workspace. Two framed pictures-- Mark with his family and Mark with the   Endeavor   crew-- Laura picks up the picture of the crew. She runs her finger across it. She goes through Mark's drawers but doesn't find much more than a few Playboys and a giant tub of cheese puffs. Laura wakes up Mark's computer. Laura eats a few cheese puffs as she leans in, pecking at a few keys. She yanks opens the desk drawer. Mark’s passwords are written on a Post-It taped to the side of the drawer. She logs in. Something catches her eye: an email, sent from Mark. MARK (V.O.)  Hey, space girl --  Laura stops. She checks the address--   ErinHawley@nasa.gov.  MARK (V.O.)  You were unbelievable last night.  Searches the inbox for messages with Erin’s name. Hundreds. She sees the African violet in Mark’s trash can. ERIN (V.O.)  Hey. I miss you! I miss your body. So hot you’re emailing from space.  CUT TO: INT. ERIN’S CAR. HOUSTON, TX - DAY We FLASH to images of Erin and Mark undressing each other. The two of them having sex in the back of Erin’s car.  96.",
      "characters": [],
      "action_text": "MARK (V.O.)  It’s mind blowing out here. I want you to experience this. I want us to share this magic. I only wish you were right here with me.  CUT TO: EXT. BACKYARD. MARK GOODWIN’S HOUSE. HOUSTON, TX - DAY We flash to Mark’s Barbecue. Mark is sticking his hand under Erin’s shirt. She leans into him. In the distance, we see his ex wife and kids preparing the grill. MARK (V.O.)  Can’t wait for our weekend away. You’re gonna love Orlando. There’s this place I know. Can’t get a reservation. I know a guy.  CUT TO: EXT. CLEAR LAKE PARK. HOUSTON, TX - NIGHT Erin and Mark lay in the bed of Mark’s truck with blankets and pillows. They look up at the stars. ERIN (V.O.)  I’ll be on flight UA1946. There’s a two hour layover in Atlanta -- gross -- Gets in at six in the morning. I cannot wait to see you.  CUT TO: INT. MARK’S OFFICE. JOHNSON SPACE CENTER - CONTINUOUS Laura scribbles down   UA1946 . And   4.30am . She clicks email after email, until finally: MARK (V.O.)  Erin I never felt this way my whole life. Since being up here I feel like I have a whole planet of love I want to give you. I want to make you feel as wild and free as you make me feel every second we’re together. Love your Spaceboy.  Laura looks up from the screen. No reaction. No histrionics. Nothing. Flat. Emotionless. Numb. CUT TO:  97.",
      "dialogue_count": 0,
      "word_count": 538
    },
    {
      "scene_number": 8,
      "slugline": "INT. LIVING ROOM. NANA’S APARTMENT - EVENING Dozens of pieces of paper are arranged around the room. On the floor. On furniture. Emails. Printed out. Wrinkled from so much handling. The broken African violet from Mark’s trash, it’s there too, like the sun in her solar system. LAURA PACES. A combination of very animated and oddly calm. Moving fast. But her expression remains utterly flat. She stops her pacing at the kitchen counter and unscrews a vodka bottle. Pours one. Drinks it. Pours another. LAURA DC power -- DC power from fuel cell 1 through the ESS bus source FC 1 switch on panel R1 when the switch is positioned to on and from main DC buses B and C through RPCs when the ESS bus source MN B/C switch on panel R1 is positioned to on. She knocks the second back and winces. LAURA (CONT’D) Positioned to   ON . Positioned to on. ANGLE ON THE DESK We see an ENVELOPE of CASH. Next to it is a CAN OF MACE. And something else -- the .38 SPECIAL, fully loaded. LAURA checks her heartrate with two fingers and the second sweep of her watch. LAURA (CONT’D) Positioned to on. She picks up the bottle of pills and shakes it rhythmically. There should be enough to get her there. Laura goes over to her wall, where she’s pinned ROAD MAPS OF THE SOUTHEASTERN UNITED STATES. ANGLE ON THE WALL There are ROUTES drawn on the MAP. First, a flight path in red Houston to Orlando, with a layover in Atlanta. “ Travel time: 756 minutes. ETA: 08:32 ”  98.",
      "characters": [],
      "action_text": "The other routes are less certain. DRIVING ROUTES, drawn in black marker. Most of them are abandoned halfway, ETAs and travel times crossed out here and there. But now, finally, she might have it. Laura plots small roads across six states. She does a calculation before writing: “ ETA: 05:30. Liftoff in T-6 mins .” CLOSE UP ON LAURA Flight plan filed. LAURA (CONT’D) Positioned to   ON.  CUT TO: INT. TARGET. HOUSTON, TX - DAWN Laura pushes a SHOPPING CART down the fluorescent aisles, grabbing items: -- a hunting KNIFE -- -- an oversized HAMMER -- -- yellow dishwashing GLOVES -- -- a bumper pack of diet sodas -- -- 2 bags of Twinkies -- -- a length of rubber surgical tubing -- -- a PACKAGE of DEPENDS ADULT DIAPERS -- and, finally, from a polystyrene head in the hair products aisle -- -- a BLACK WIG. CUT TO: THE CHECKOUT COUNTER A bored clerk rings her up. CLOSE UP ON LAURA Chewing her lips, antsy. She takes out her pill bottle, pops two pills.  99. CLERK Paper or plastic? LAURA What? CLERK The bag. You want paper or plastic? LAURA Plastic. No, paper. No -- wait -- what’s the tensile strength of both bags, approximately? The clerk stares at her. LAURA (CONT’D) The yield. Have they been stress tested? Maybe double bag the paper. Or -- wait -- this it -- paper inside plastic. Or -- shit, shit. I’ll just -- throw it in the cart. Everything. Come on, get the lead out. CUT TO: EXT. TARGET. HOUSTON, TX - DAY Laura tosses her things into the back of her SUV and slams the door shut. She hurries to the driver’s side. Inside, she tears open the Depends package. She struggles to strip off her pants, to pull on a pair. There’s is nothing irrational to this in her mind. She has a job to do -- drive 800 miles in the fastest time possible. At 80 miles an hour, she can do it in 10 hours. Erin’s flight lands in 10 hours and 20 minutes. Laura can’t afford to take a bathroom break. She gets the diaper on, muscles her pants back on, leaving them unzipped, unbuttoned, starting the car. CUT ",
      "dialogue_count": 0,
      "word_count": 3325
    },
    {
      "scene_number": 9,
      "slugline": "INT. PARKING GARAGE. HOUSTON, TX - NIGHT (FLASHBACK) Laura’s sitting in the wreckage her fight with Erin left behind all around her. She’s deep in a trance until, finally-- -- a distant police siren breaks the silence. --   Laura stands up shakily -- looks around herself -- -- she hastily grabs something up off the ground -- -- and runs . Takes the stairs two at a time. Wild-eyed. Moving as fast as she can. Pulls at the rubber gloves, trying to get them off. Tosses one in a trash can, drops the other and keeps running. But, Laura isn’t going down the stairs.   She’s going up.   She’s not trying to escape, she’s trying to get higher up. Up to -- CUT TO: EXT. PARKING GARAGE ROOF - CONTINUOUS (FLASHBACK) It’s RAINING HARD NOW. Sirens closing in. Panicked, Laura hides the gun behind the rear wheel of a truck axle. MISSION CONTROL (O.S.)  Ten.  CUT TO: INT. SPACE SHUTTLE   DISCOVERY   - DAY We’re close in on Laura’s face. This is it. The FINAL COUNTDOWN. She’s nervous. Apprehensive. We hear the crackle of a headset: MISSION CONTROL (O.S.)  Nine.  CUT TO: EXT. PARKING GARAGE ROOF - NIGHT (FLASHBACK) Laura, soaking wet now, sees a nearby trash can and pulls her 8-inch Gerber folding knife from her boot, tosses that into the can. MISSION CONTROL (O.S.)  Eight.  CUT TO:  114.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 229
    },
    {
      "scene_number": 10,
      "slugline": "INT. SPACE SHUTTLE   DISCOVERY   - DAY As the countdown continues, Laura looks around in a moment of sheer panic. What if this is a terrible mistake? MISSION CONTROL (O.S.)  Seven.  CUT TO: EXT. PARKING GARAGE ROOF - NIGHT (FLASHBACK) Another trash can, Laura removes her wig: tosses it. MISSION CONTROL (O.S.)  Six.  CUT TO: INT. SPACE SHUTTLE   DISCOVERY   - DAY Laura grips the armrests of her seat. MISSION CONTROL (O.S.)  Five.  CUT TO: EXT. PARKING GARAGE ROOF - NIGHT (FLASHBACK) There's no direction to where Laura's going. She's not making any sort of escape. She's just zig-zagging across the parking lot, tossing evidence, as -- MISSION CONTROL (O.S.)  Four.  --   police cars surround her . Laura’s like a cornered animal. Around her, officers get out of their cars, pulling guns. Laura turns and steps up to the ROOF WALL. Ignoring their cries, she climbs on top. The COPS APPROACH, guns drawn. MISSION CONTROL (O.S.) (CONT’D)  Three.  CLOSE UP ON LAURA The ground far below her. She’s staring into the middle distance.  115.",
      "characters": [],
      "action_text": "MISSION CONTROL (O.S.) (CONT’D)  Two.  We PUSH ON her deep blue eyes and -- reflected there -- we see what she’s staring at. ANGLE ON THE PLANET EARTH. further away than it has ever been before and getting smaller. A pale blue dot, insignificant in the vast infinity of space. LAURA (V.O.)  -- to fly into the great unknown --  ON THE WALL Laura raises her hands, but is she surrendering or getting ready to fly? LAURA (V.O.)  -- to see what it’s like.  A RAPID MONTAGE OF FLOWERS OPENING PETALS. LAURA’S CHILDREN. DREW TOUCHING HER HAND. SEEDS SPLIT AND GROW. RAIN SPLASHING ON WATER. LAURA UNDERWATER. A SHOAL OF FISH CHANGE DIRECTION. RUTH DRESSED AS AN ASTRONAUT. THE PICTURE OF LAURA AS A LITTLE GIRL NEXT TO HER NANA. LAURA ON A BEACH LAUGHING. THEN SCREAMING INTO HER HELMET AS SHE EXITS THE ATMOSPHERE. THE CAMERA PANS Away from the pale blue dot into the blackness of space. It finds LAURA floating free, no tether, no ship. Alone in the universe. LAURA  The terror and the joy.  EVEN FASTER CUTS. Her kids. Dancing. A baby’s eyes. Laura floating in the water: looking at the stars. Then sitting on the floor of a JAIL CELL. Equally alone. LAURA (V.O.) (CONT’D)  To feel it all.  A flash of agony. A flash of bliss. EXTREME CLOSE UP ON HER FACE As she stands on the wall, the RAIN running down her face, illuminated by red and blue flashing police lights.  116. This is it, the moment of truth. MISSION CONTROL  One.  CUT TO BLACK THE END  117.",
      "dialogue_count": 0,
      "word_count": 438
    }
  ]
}