{
  "slug": "maggies-plan-2016",
  "title": "maggies plan",
  "genre": "drama",
  "format": "film",
  "scenes_count": 12,
  "characters_count": 0,
  "characters": [],
  "total_words": 19582,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. GREENWICH VILLAGE STREET - DAY 1   1 MAGGIE: We see the back of her blonde head. It’s a beautiful winter day. Now we see her from across the street. We see her feet making determined strides. This is a young woman who knows where she is going. Wide shot: A blind man is tentatively making ready to cross the street. Among the handful of pedestrians about to cross, Maggie is the only one to notice, and helps the man across. EXT. PRODUCE MARKET - DAY 2   2 TONY, Maggie’s best friend, looks a little like Art Garfunkel as a young man: fluffy hair, glasses, dressed in a suit jacket and baggy chinos. He’s pushing a stroller with a reading, fluffy-haired, bespectacled four year old boy in it, wearing a t-shirt with “IMAGINE THERE’S NO FRACKING” written on the front. This boy is too big to be in a stroller, and too young to be reading. Maggie rushes to them. MAGGIE Sorry! Sorry I’m late... Hi! Hi Max! She snuffles the little boy’s neck. MAGGIE (CONT’D) You still have one little corner of baby smell. Right (sniff) there. Max giggles and pushes her away so he can get back to his reading. Maggie straightens up. MAGGIE (CONT’D) Ach, I need a baby! She bites her fist. TONY You need a baby? You’re such an impatient little fuss-budget. MAGGIE I just don’t see why I should wait. TONY For a father, perhaps? (CONTINUED)  1.",
      "characters": [],
      "action_text": "MAGGIE Let’s face it. I’ve never been in a serious relationship that lasted longer than six months. TONY (paying) We were together for two years. They walk. MAGGIE In college. And we made each other miserable for the rest of the time. TONY I admit it. We were miserable. But we were also happy. MAGGIE Yeah. They reach a stand of homemade jams. Tony picks one up. TONY Just so you know. I have little sperm tucked away in a facility uptown, if you’re in a pinch. MAGGIE What?! Why? I thought Felicia didn’t want any more kids. TONY Felicia does not want any more kids. I froze it in case I ever meet anybody nice. MAGGIE No, you didn’t. TONY I didn’t. But I might, you know, save it, like ‘mad money’-style? Maggie has something to tell Tony, and she wants to get it over with fast. MAGGIE (rushing this part) Do you remember Guy Childers, from college? CONTINUED: 2   2 (CONTINUED)  2. A moment as Tony searches for the name in his mind. TONY Wasn’t he the Guy...he’s a pickle salesman? MAGGIE He’s a pickle entrepreneur. And-- he’s agreed to make a donation, so I can inseminate myself. TONY But he has no sense of personal space! MAGGIE So what? He was a math major. Anyway, I’m not marrying him, I’m borrowing his genes. TONY But not his personality I hope. Guy Childers...? MAGGIE (shrugs) Everybody has something a little wrong with them. You think everybody’s honest who fills out those questionnaires at the sperm bank? TONY I can’t believe you’ve been cooking this up all this time and you didn’t even tell me. MAGGIE I knew that you’d yell at me. TONY I’m not yelling at you! Isn’t this sort of thing for women who are like forty-nine and desperate? MAGGIE I don’t want it to be a last resort, I want it to be a choice. CONTINUED: (2) 2   2 (MORE) (CONTINUED)  3. Because I’m ready be a mother, and I don’t believe I’ll find a man who I can stay in love with-- or who can stay in love with me-- for more than six months. I’m just facing the truth about myself. Tony is morose at this news, ",
      "dialogue_count": 0,
      "word_count": 1607
    },
    {
      "scene_number": 2,
      "slugline": "INT. NEW SCHOOL - CAFETERIA - DAY 10   10 Several days later, Maggie is in line with FELICIA, Tony’s wife. Felicia is wearing a t-shirt with “What would Jesus Buy?” Written on it. She and Felicia are mid-conversation when John calls out. The camera pans over to him. JOHN Felicia -- when is that -- that Pike fellowship meeting? FELICIA Thursday at seven. JOHN (sighing) Great, thanks. The women sit. MAGGIE That’s so funny that you know John Harding. FELICIA (eating her soup) We’re on a committee together. He’s a real panty melter. Why? MAGGIE No, we just -- had a check mix-up recently -- because of our names-- Hardin/Harding. FELICIA He’s one of the bad-boys of Ficto- critical Anthropology. Apparently, he was a big deal in Chicago. And now he just does adjunct work here, but they’re really salivating for him to teach full-time. MAGGIE Why won’t he? FELICIA I don’t know. I think it has something to do with his wife. She’s some kind of monster apparently. MAGGIE Where did you hear this? (CONTINUED)  10.",
      "characters": [],
      "action_text": "FELICIA (shrugging) Around. She’s got tenure at Columbia. Georgette Nørgaard. The words ‘Glacial’ and ‘Terrifying’ have been bandied about. Then again I’ve heard myself described as a psychotic bitch, but I think I’m actually pretty nice, so... you can’t believe everything you hear. Maggie is distracted by John’s voice. JOHN -if you say ‘she was, like, terrified’, it’s nothing compared to saying‘ she was terrified’. ”Like” is a language condom. Trust me. Maggie looks back at John, now a far more mysterious character. FELICIA (searching in her salad) Where the fuck is my chicken? EXT. WASHINGTON SQUARE PARK - FOUNTAIN - DAY 11   11 John is nursing a coffee, sitting on a bench, reading the paper, when he notices Maggie, who is circling the fountain with vigorous, calisthenic strides. He watches her circle a couple times. Calls out: JOHN Hey, Hardin? MAGGIE Oh, hi! JOHN What are you doing? MAGGIE I’m taking a little constitutional before my next meeting. John gets up and walks over to her. MAGGIE (CONT’D) Did you get paid yet? CONTINUED: 10   10 (CONTINUED)  11. JOHN No. MAGGIE You’re kidding. JOHN Beverly tells me the check is coming any day now. Maggie and John walk past a man in a fancy suit kneeling to scoop up his dog’s turd. JOHN (CONT’D) I knew this Masai from Tanzania. He was here to run in the Marathon. He took everything in New York City in complete stride. Nothing fazed him until he saw a grown man following his dog, picking up its shit. He started laughing so hard, he wept. MAGGIE I guess that-- custom-- would be strange, like, out of context. Whoops! JOHN What? MAGGIE I overheard part of your conversation. About ‘like’ being a - - language prophylactic. He’s trying to remember saying that. MAGGIE (CONT’D) What is ficto-critical anthropology, anyway? JOHN It’s a way of writing about anthropology that blends ethnographic observation, story telling and, like, theory. A beat. Two smiles. CONTINUED: 11   11 (CONTINUED)  12. JOHN (CONT’D) Do we have to walk in a",
      "dialogue_count": 0,
      "word_count": 4428
    },
    {
      "scene_number": 3,
      "slugline": "EXT. MAGGIE’S BUILDING - NIGHT 30   30 John waiting. He looks like a man about to go into the ring. INT. BATHROOM - NIGHT Maggie pulls on another nearly identical night gown, but this one has sleeves. INT. MAGGIE’S SUBLET - NIGHT 31   31 Maggie streaks into the kitchen holding the jar with the remains of the sperm in it, sticks it in the freezer. Back to the buzzer with paper towels and sterilizing spray, she mops up the mess. At last, having tidied up all evidence, she presses the buzzer. MAGGIE John? Are you still there? JOHN Yeah? Maggie buzzes him in. INT./EXT. MAGGIE’S BUILDING - VESTIBULE - NIGHT 32   32 John comes through the metal gate and approaches the front door. INT. MAGGIE’S SUBLET - NIGHT 33   33 He comes in. He’s very tense, seems upset. They talk in the doorway. MAGGIE Are you okay? JOHN I got locked out. Georgette is in Pennsylvania with the kids... MAGGIE Oh! Do you want to stay on the couch? John looks at the couch. (CONTINUED)  36.",
      "characters": [],
      "action_text": "JOHN Not really. He walks in. Sits on the couch. Maggie, thrown by his presence, starts making conversation. MAGGIE So I’m on chapter five. Now I think Mrs. Jeffries is my favorite character. She’s so pallid and reliable but he finds her so attractive, in spite of her moustache. I just wonder... JOHN What? MAGGIE If maybe the wife’s behavior is getting a little... large? JOHN You should come over to my house. That book is like a documentary. No, I’m sure you’re right. I’m sure I’m exaggerating her behavior. His face is filled with distress. He gets up and paces. MAGGIE No it’s really funny! I don’t want you to change it. Maybe it’s more about, like how much of it you do. I-- JOHN Ah, fuck it! He suddenly falls to his knees at Maggie’s feet and clings to the hem of her long night gown. Maggie is astonished. John looks up at her. JOHN (CONT’D) I’m in love with you. MAGGIE ... JOHN I’m genuinely locked out of my apartment. But I’m also in love with you. CONTINUED: 33   33 (MORE) (CONTINUED)  37. And I don’t want to be married to Georgette anymore. And please could I stay in your bed? She doesn’t say anything, doesn’t move. It is only now really hitting her how she feels about this man. She is finally admitting it to herself. He unbuttons the lowest button of her long night gown. She looks down at him, desire blooming. Another button. Another. All the way up, until we glimpse her naked breasts between the crack in the cloth. They are face to face. He whispers. JOHN I don’t want you to have a baby with the pickle man. MAGGIE ... JOHN I want you to have a baby with me... She wants him terribly but she just has to be honest. MAGGIE I need to tell you something. I...tried already. JOHN When? MAGGIE Recently... JOHN What happened? MAGGIE It didn’t work! It didn’t work. I just had to tell you because... JOHN Because why? MAGGIE Because I love you. I’m in love with you. They look at one another, and they kiss. They move onto the bed. Maggie looks up at John with open, frank se",
      "dialogue_count": 0,
      "word_count": 1049
    },
    {
      "scene_number": 4,
      "slugline": "INT. QUEENS LOFT - BATHROOM - DAY 38   38 Lily is screaming, looking into the toilet. Maggie walks in. LILY Froggy fell in, and then he was hungry. Maggie looks into the toilet. There is a box of Koala Crisps in the toilet, along with half the box of cereal. MAGGIE Wow, Lily. This is a big mess. JOHN (OS talking into the phone) I could send you the next couple chapters... MAGGIE Where is Froggy? LILY Under there. MAGGIE Don’t worry. We’re gonna save him! She retrieves the frog from the toilet and puts him in the sink. LILY Can I wash him, Mommy? MAGGIE Yeah, let’s wash him. Don’t touch him yet... LILY I wanna wash him... MAGGIE See, we saved him! Lily peers over the side of the sink as Maggie washes the frog in hot water. Her little cheeks are tear stained. LILY (whispering) Sorry Froggy. (CONTINUED)  42.",
      "characters": [],
      "action_text": "Remembering her call, Maggie un-mutes the phone. MAGGIE Hello? No one there. Great. John ends his call. He looks happy. They meet outside the bathroom. INT. QUEENS LOFT KITCHEN - DAY JOHN Did you take care of Froggy? MAGGIE (keeping up her good humor) Yeah, but why didn’t you? JOHN That guy from Parallel Press called. MAGGIE Oh great, what did he say? JOHN He wants to meet me at four. MAGGIE But you were taking Lily this afternoon because I have a meeting with a student? JOHN Oh, shit. Sorry. MAGGIE Maybe I can push it. John is hopeful. MAGGIE (CONT’D) But who is going to pick up Paul and Justine? JOHN Oh, fuck. All right. He starts for the phone. CONTINUED: 38   38 (CONTINUED)  43. MAGGIE No--It’s okay -- I’ll reschedule my meeting. JOHN You don’t mind? MAGGIE No. JOHN Really? MAGGIE Yes. JOHN Thanks. She goes back into the bathroom. John makes for his study. The phone rings again. John turns and answers. JOHN (CONT’D) Hello...he what??... All right, hang on. John turns to Maggie, who is still in her rubber gloves. JOHN (CONT’D) Paul twisted his ankle in eurythmics. You’re gonna have to leave now. Close on Maggie as she digests this. EXT. DANISH-AMERICAN SCHOOL - DAY 41   41 This is a nice private school for Danes, nestled in a townhouse. Maggie, Lily on her hip, emerges from the school, opening the heavy door for Paul, who is now nine. He is on crutches and looks very sorry for himself. PAUL Where’s Dad? MAGGIE He’s in a meeting sweetie, but crutches! Wow. Does it hurt a lot? Paul is upset. CONTINUED: (CONTINUED)  44. MAGGIE (CONT’D) We have a while before Justine gets out. Maggie helps the kids into the car, walks to the driver’s side and loads in the crutches. TIME CUT INT. MINIVAN / DANISH-AMERICAN SCHOOL - DAY 42   42 Paul and Lily are laughing hysterically in the back seat. They are making a great deal of noise. Maggie has her eyes shut. The phone rings. Maggie has to answer this one. MAGGIE Hello? Oh thank you so much for calling me back. Excuse me-- Maggie ",
      "dialogue_count": 0,
      "word_count": 801
    },
    {
      "scene_number": 5,
      "slugline": "INT. QUEENS LOFT - LATER 45   45 Chinese food cartons going in the garbage. Maggie is cleaning up the remains of take-out as John flops onto the couch, seemingly exhausted. Maggie sits down at the end of the couch. MAGGIE So how was the meeting at Parallel Press? JOHN I had to push it to Thursday. Georgette was having one of her crises. I couldn’t get her off the phone. MAGGIE What happened? JOHN She got offers from two different UK publishers for her new book and she couldn’t decide. MAGGIE Wow. She doesn’t have anyone else to talk to about something like this except her ex-husband? Especially since her new book is all about our affair and how it ruined her life? JOHN I’m sorry I messed up your day. MAGGIE Not just my day. Komiko -- my student. She’s a fragile person... and I had a meeting set up to discuss her meeting with the toy company. But I had to cancel that meeting because   you   had a meeting. And then you don’t even   go   to the meeting with the publisher because you were talking Georgette out of her tree! Why does nobody ever talk  me   out of   my   tree?! JOHN (with affection) Because you’re never up a tree. (MORE) (CONTINUED)  47.",
      "characters": [],
      "action_text": "And if you were, you would find your way back down all by yourself. MAGGIE Am I so, so capable that I don’t deserve any attention, is that it? Like, the squeaky wheel gets the grease, and the cactus never gets watered? Attempting to defuse her, John takes off one of Maggie’s socks and starts giving her a foot rub. MAGGIE (CONT’D) You have to start thinking of yourself as indispensable, John. JOHN (removing the other long knee sock) But I’m not. I’m totally dispensable. On a practical level, you’d be fine without me. MAGGIE Do you realize that Paul faked the ankle thing today just so you would pick him up from school, and then you didn’t even show. JOHN What do you mean? MAGGIE He ran on it when I asked him to go check on Justine. He forgot. JOHN That’s weird. MAGGIE No. It’s not weird. You want to know why? Because his mother is in Reykjavik right now, studying the maternal techniques of the Icelandic. He needs his father’s attention. So do I. A beat. CONTINUED: 45   45 JOHN (CONT'D) (CONTINUED)  48. JOHN Let’s go away for a couple days when Georgette gets back. Just the two of us. Maggie sighs, looks at him. She doesn’t really want to go away just the two of them at this moment. MAGGIE I’m going to start pouting more. JOHN (relieved at this levity) Georgette’ll give you a tutorial. She’s good at that. Close on Maggie. She smiles a sad, tired, alienated smile. EXT- UNION SQUARE PRODUCE MARKET - DAY 46   46 Maggie walking beside Lily, who is pushing the stroller. MAGGIE Who did you sit with at snack? LILY Alison. GUY (OS) Maggie? Maggie turns as the camera pans to see Guy, the pickle entrepreneur, near-father of her child, king of his booth. MAGGIE Oh hi! Hi, Guy! I haven’t seen you for so long... MAGGIE (CONT’D) (to Lily) This is my friend Guy. Guy comes out of his booth and kneels before Lily, gazing at the little girl with something like reverence. GUY Is that... CONTINUED: (2) 45   45 (CONTINUED)  49. MAGGIE (blank at first, then copping on to his assumption) ? .",
      "dialogue_count": 0,
      "word_count": 2043
    },
    {
      "scene_number": 6,
      "slugline": "EXT. GEORGETTE’S BUILDING - DAY 51   51 Maggie parks outside Georgette’s elegant Harlem brownstone. Justine and Paul get out of the van, Justine lugging a stuffed duffel bag. JUSTINE So now it suits the captors for the little prisoners to be moved. PAUL Aren’t you excited to see Mama? JUSTINE Of course I’m excited to see Mama. I’m just sick of never knowing which house any of my stuff is in. I can’t wait to be a grown up, so I can have kids and push them around. Maggie, not hearing this, stands on the street scrutinizing the parking sign. Paul and Justine watch her, speaking Danish, their secret language. JUSTINE (CONT’D) (in Danish w subtitles) Sometimes I wonder if she is a little dim-witted. What is she doing? PAUL (in Danish) She’s nice. JUSTINE (in Danish) You’re like a dog. You love whoever feeds you. PAUL (in Danish) No I don’t! JUSTINE (in English, to Maggie) Is there a problem? MAGGIE I just can’t believe I actually found a legal parking space right outside your mom’s building. (CONTINUED)  58.",
      "characters": [],
      "action_text": "JUSTINE You’re coming inside? MAGGIE Just to say hi. OMITTED 52   52 INT. GEORGETTE’S APARTMENT - KITCHEN - DAY 53   53 Georgette opens her door. GEORGETTE Hi! Hi--oh, hello, Maggie. MAGGIE John had a meeting so he asked me to-- GEORGETTE Come in. The kids remove their shoes and greet their mother with great affection. Maggie watches this as she removes her penny loafers. Justine is very tender with her mother. Another person. GEORGETTE (CONT’D) (to the kids) I made you a nice snack and you are allowed to watch one single episode of something ghastly while eating it. But no fighting about what it is, Paul. Justine gets to choose. GEORGETTE (CONT’D) The snacks are already in the den. They run up the stairs. Georgette turns to Maggie, who is standing in her socks. Her demeanor is chillier than it was at the book store. GEORGETTE (CONT’D) I was about to make some coffee? Or tea? MAGGIE Coffee would be great. Thank you. CONTINUED: 51   51 (CONTINUED)  59. Maggie follows Georgette toward the kitchen. The living room is a symphony in taupe. Large photographs of Geishas from the 1920’s now dominate the walls. MAGGIE (CONT’D) Your place is really nice. GEORGETTE Columbia housing! INT. GEORGETTE’S KITCHEN - DAY Georgette puts brewed coffee in a blender and holds a stick of butter. GEORGETTE I put butter in mine. It nullifies afternoon sugar cravings. MAGGIE Great. Plop goes the butter. Georgette throws the blender into high gear as Maggie backs out. INT. GEORGETTE’S LIVINGROOM - DAY While Georgette blends the butter next door, Maggie walks through the room, drawn to a beautiful black and white image of a younger John holding Justine. Maggie doesn’t notice Georgette coming up behind her. GEORGETTE That’s a lovely photo, don’t you think? MAGGIE (startled by her) Yes. Thanks. She sips the buttered coffee --ack! Georgette sips hers while maintaining eye contact with Maggie. A sort of “O.K. Corral” moment. MAGGIE(CONT’D) It’s good to finally meet you. GEORGETTE I won’t pretend it",
      "dialogue_count": 0,
      "word_count": 2091
    },
    {
      "scene_number": 7,
      "slugline": "INT. CHINESE RESTAURANT/HOTEL - NIGHT 63   63 John and Maggie stagger up to the front desk. JOHN We’d like a room for the night. MAGGIE This is a hotel? JOHN It is a hotel if you know it’s a hotel. MAGGIE Oh-ho! JOHN Thank you. What do I owe you? A hundred fifty dollars? I got a hundred fifty dollars. Maggie is behind John. She shoves her hands in John’s pocket and fishes out some bills. INT. HOTEL ROOM - NIGHT 64   64 They fall into the room, laughing on the floor. John drags off Maggie’s dress before he’s even closed the door. She bounds onto the bed in her slip. JOHN Take off your clothes! She miaows like a cat, hisses, paws up. JOHN (CONT’D) Five! Four! Three! Two! One! He leaps on her and drags off her tights as she screams with laughter. JOHN (CONT’D) Take off your fucking tights! Close on her feet as she gives way to pleasure. INT. HOTEL ROOM - DAY 65   65 The next morning. John is eating breakfast; Maggie is sitting in a pool of light on the bed. (CONTINUED)  69.",
      "characters": [],
      "action_text": "MAGGIE (exploring-- not imploring) Would you ever want another baby? JOHN (tossing it off) I’ll never finish the book if I don’t knuckle down and concentrate. Four kids is a lot. His reaction feels like a slap in the face. MAGGIE You wouldn’t notice. It’s just one more kid for you to ignore. John stops. JOHN What kind of thing is that to say? MAGGIE It’s a true thing, John. You -- I -- I’m supporting you so you can write and that’s the deal and I accept it but -- I feel like I’m your intern. Or your nanny. JOHN For Christ’s sake. You set all this up! You took over, gave everybody a job. My job is to write my novel so that’s what I’m doing. MAGGIE I know that’s what you’re doing. JOHN You can’t get mad when we all play our parts to perfection. A moment. This stings her. MAGGIE Do you even like me anymore? JOHN What are you trying to get me to tell you? Huh? Maybe I should be asking you that question. He walks out and leaves her there. CONTINUED: 65   65  70.",
      "dialogue_count": 0,
      "word_count": 381
    },
    {
      "scene_number": 8,
      "slugline": "EXT. CHINATOWN- DAY 66   66 John and Maggie walk beside each other in total alienation. OMITTED 67   67 EXT. WASHINGTON SQUARE- DAY The arch reminds us of happier times between John and Maggie. EXT. NEW SCHOOL COURTYARD- DAY The phallic bench reminds us of happier times between John and Maggie. EXT. NEW SCHOOL--DAY A70   A70 Students and teachers flow in and out of the glass doors, creating liquid reflections on the glass. INT. NEW SCHOOL - CAFETERIA - DAY 71   71 Maggie is working on her computer. GEORGETTE May I sit down? Maggie jumps. MAGGIE Sure. Georgette looks around, as if for people she knows, then sits. A moment of silence. Maggie waits for the blow. GEORGETTE In December, I am attending a conference in Canada on Fictocritical Anthropology. MAGGIE ... GEORGETTE Fictocritical Anthropology is John’s field. (CONTINUED)  71.",
      "characters": [],
      "action_text": "MAGGIE I know, but -- You mean... GEORGETTE (cold) I’m in. MAGGIE ...Really? GEORGETTE I have no reason to trust you. On the other hand, I have absolutely nothing to lose. I could easily arrange to have John invited to give a paper at the conference. MAGGIE Do you think he would accept? GEORGETTE Zizek is speaking. He loves Zizek. Maggie takes this in. She can’t quite believe it’s happening. INT. QUEENS LOFT - NIGHT 72   72 Maggie is putting away dishes; John is fixing a lamp. He waits for a while to speak. JOHN I got invited to give a paper at a conference. MAGGIE Really? That’s great. JOHN Yeah--except it’s all the way up in Quebec. So I can’t go. MAGGIE No-- You have to go. JOHN Why? MAGGIE Because you... you would probably like a break. CONTINUED: 71   71 (CONTINUED)  72. JOHN Yeah, but Georgette’s out of town that week, too. I can’t leave you alone with all the kids. MAGGIE Of course you can! I’ll be fine. JOHN Zizek is speaking... MAGGIE Oh you love Zizek! JOHN (baffled) How do you know? MAGGIE I--I think I heard you mention him. EXT. SKY - DAY 73   73 A Canadian Airlines plane flies through a sunny sky. EXT. Quebec HOTEL - DAY 74   74 A stone building, rustic in aspect. A large sign reads: A WARM QUEBEC WELCOME TO THE ASSOCIATION OF FICTO-CRITICAL ANTHROPOLOGISTS John walks into the building. Snow has begun to fall. OMITTED A74   A74 INT. QUEBEC HOTEL - DINING AREA - DAY 75   75 John walks into the dining area. A sprinkling of academics. A young man in a baggy sweater comes up to him. AL BENTWAITHE Excuse me. John Harding? JOHN ? CONTINUED: 72   72 (CONTINUED)  73. AL BENTWAITHE I--I’m reading “Rituals of Commodity Fetishism at the Tail End of the Empire”. JOHN How are you making out? AL BANTWAITHE It’s tremendous. We all came up here just to hear you speak. And Zizek, obviously. JOHN Obviously. AL BENTWAITHE This is a little fetish-y but-- Could you sign my book? JOHN Sure. What’s your name? AL BENTWAITHE Al. As John signs the book, he spies Georgette from b",
      "dialogue_count": 0,
      "word_count": 873
    },
    {
      "scene_number": 9,
      "slugline": "INT. TOY COMPANY CONFERENCE ROOM - DAY The next morning, Maggie is having a meeting with Komiko, the Japanese design graduate student, and some poker-faced toy executives. Komiko demonstrates her patented doll, unzipping it to reveal a string of cloth intestines. MAGGIE Komiko has designed the first patented doll with removable internal organs. KOMIKO (whispery) Sixty percent of children have fears about death. MAGGIE Komiko’s idea is, to relieve children’s fears about the body by helping them see what’s inside. KOMIKO (removing the intestine) They can draw on the organs. MAGGIE But all the elements are completely washable. So...We think this would appeal to parents interested in marriage-based toys. I mean, knowledge. Knowledge-based toys. EXT. QUEBEC HOTEL - DAY 76   76 Snow is falling on the landscape. Whirling. The wind is ferocious. INT. QUEENS LOFT - KITCHEN - DAY 77   77 In New York, it’s two hours later. Maggie is folding laundry with Justine. JOHN (os) There’s no heat. The fucking internet doesn’t work.  77.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 166
    },
    {
      "scene_number": 10,
      "slugline": "INT. QUEBEC HOTEL - DINING AREA - DAY - INTERCUT WITH 78   78 QUEENS LOFT John, depressed, is on his phone in a corner of the bar at the end of the dining room. There is a kerosene lamp beside him. It’s still snowing. Outside, all is white. Intercut with Maggie in the loft. JOHN The generator blew up. My batteries are about to die. And get this. Guess who’s here. Georgette. INT. QUEENS LOFT - DAY Maggie is painting Justine’s fingernails. MAGGIE Really? Wow. How is that? JOHN Her mood matches the weather. MAGGIE Oh. Sorry about that. JOHN How are you guys doing? MAGGIE Everyone’s fine. JOHN (O.S.) I can’t get any information about when the airport is opening up. So it looks like I’m stuck here! They’re breaking out the snowshoes, which, to me, is ominous. INT. QUEENS LOFT - BATHROOM - DAY 79   79 Maggie is having a bubble bath with Lily. They are having fun, blowing bubbles through a little plastic ring. Lily dips the ring into the bottle of bubble stuff, blows a big one and watches it float through the air. MAGGIE Oh that’s a good one... (CONTINUED)  78.",
      "characters": [],
      "action_text": "MAGGIE (CONT’D) I love you so much. LILY How much? Wait, I know, twenty-five three hundred and sixty two! MAGGIE That’s exactly right! They continue to blow bubbles. MAGGIE (CONT’D) I want to live inside a bubble. LILY (watching the bubble float) Me too. MAGGIE ... LILY But I want my own bubble. MAGGIE Okay. We can each have a bubble. LILY And Daddy gets his own bubble too. Maggie blows a huge bubble and looks inside it. MAGGIE I can see Daddy in his bubble. Maggie looks inside the bubble. Slow dissolve into: A snowy landscape/   John and Georgette and a few others are on snowshoes...  EXT. QUEBEC MOUNTAINS - DAY 80   80 Low wide shot: John and Georgette walk in a line of academics on snowshoes. Georgette falls over, letting out a cry. John turns but she waves him off and continues. Closer frontal shot: Georgette falls again. John can’t help stopping to help her up. She dusts herself off grumpily. They both look up the mountain to see the rest of the academics have trudged off without them. CONTINUED: 79   79 (CONTINUED)  79. GEORGETTE Typical. JOHN We can just follow their tracks back. They snowshoe together in silence. Time passes. SOME TIME LATER CLOSE UP OF THEIR SNOWSHOES CUTTING INTO A VIRGIN DRIFT. JOHN Nothing really looks familiar. Does it? MORE TIME PASSES EXT. FORREST - DAY They are trudging along, deep in conversation, totally lost. We see them through the trees. JOHN You know that talk you gave yesterday was just great. I didn’t even know you were working in that direction. GEORGETTE I guess you haven’t seen anything I’ve written for a while. JOHN No, I miss that. GEORGETTE You do? JOHN I used to like that. You know, I miss that, showing each other stuff. CONTINUED: 80   80 (CONTINUED)  80. GEORGETTE (encouraged, plunging in) Forget me -- that talk you gave yesterday was the hit of the conference. JOHN It was just all the old ideas. GEORGETTE You altered that passage on de Tocqueville. JOHN Nothing gets by you! GEORGETTE Your work feels so fresh... No o",
      "dialogue_count": 0,
      "word_count": 2867
    },
    {
      "scene_number": 11,
      "slugline": "EXT. QUEENS LOFT - DAWN A91   A91 The elevated train snakes across the tracks above the store front. INT. QUEENS LOFT - BEDROOM--DAWN 92   92 John walks into the room and turns on the light, starts taking his clothes out of the drawers. Maggie wakes up. MAGGIE John? JOHN Was it a test? MAGGIE ... JOHN To see if I really was in love with Georgette, as you apparently suspected? A pause. Maggie feels a little frightened. JOHN (CONT’D) You happy now? MAGGIE Happy isn’t the right word. JOHN I don’t even know what to say. I’m speechless. MAGGIE We were going to break up. I had a feeling you were still in love with Georgette. And you were, as it turns out. JOHN What about Lily? My daughter. Where does she fit into this plan of yours? MAGGIE If we’re going to break up it’s -- better to do it soon, for her sake. So that’s all she remembers. (CONTINUED)  96.",
      "characters": [],
      "action_text": "John flips. JOHN But I didn’t want to break up! Because, among other things, I was committed to you and we had a child together. MAGGIE Not because you wanted to be with me. JOHN (on a wave of his own thoughts--packing all the while) So this is the fate you’ve picked out for me -- to just ricochet around the tri-state area, ruining one family after another? I don’t accept that. I didn’t choose this. I can’t believe I let you make me feel so -- so guilty about betraying you and wrecking our marriage, when you masterminded this whole thing, manipulated me into falling for my ex-wife, colluded with her to get me invited to that conference, to make me into some absurd patsy, a pawn in your revolting little narrative. Well guess what? Your puppet is cutting his strings. You can both fuck yourselves. MAGGIE You and Georgette never really stopped being together the whole time we were married. JOHN What? MAGGIE I mean, you thought it was over, but it never really was. This is the proof, isn’t it. It’s what you wanted. Be honest. JOHN I think the question really is what do you want? What do you want, Maggie Hardin? CONTINUED: 92   92 (CONTINUED)  97. MAGGIE I want to live honestly. JOHN Well you’re not off to a very good start. MAGGIE I don’t want a marriage that’s a lie. I don’t want to tiptoe around our disconnection anymore. You deserve to be with someone who really -- gives herself over to you. I did what I thought was right. JOHN You’re very ethical. MAGGIE You’re the one who slept with someone else. JOHN (laughing in spite of himself) Are you fucking kidding me? John zips up his bag. JOHN (CONT’D) By the way, just out of curiosity -- did you ever love me? MAGGIE Of course I did. JOHN That’s nice. MAGGIE Where are you going? JOHN I have no idea. MAGGIE What about the kids? JOHN You and Georgette seem to be such good teammates, strategize with her. CONTINUED: (2) 92   92 (CONTINUED)  98. He leaves. Maggie stares at the door he’s walked out of. INT. LILY’S ROOM - DAY 94  ",
      "dialogue_count": 0,
      "word_count": 2741
    },
    {
      "scene_number": 12,
      "slugline": "INT. QUEENS LOFT - BEDROOM - DAY 109   109 Another day. Maggie and Lily play on the floor. INT. QUEENS LOFT KITCHEN - DAY 110   110 Maggie and Lily eat their eggs. A sense of contentment. Absolute love. EXT - PROSPECT PARK - ICE RINK - DAY 111   111 Three weeks later. One shot: Lily is skating between Maggie and John, each holding a little hand. She is wearing a pin that says “I’m Three!” on it. Maggie and John hand Lily to a skating instructor, flanked by Justine. The instructor escorts Lily to a clutch of little girls on skates. LITTLE GIRLS Happy Birthday, Lily! This is Lily’s third birthday party. It’s a skating party. The skating instructor calls out cheerful commands. We follow John as he skates over to Georgette, who is holding onto the railing for dear life. She loses her balance. John catches her. JOHN Winter sports aren’t really your strong suit. GEORGETTE It’s not fair! On skates I’m not able to defend myself. JOHN I’m keeping you on ice for the rest of your life, in that case. He pushes her on the ice as she screams in fear and joy. In the stands, Tony, Felicia, and Max watch this tender scene. Tony is lacing up Max’s skates. Maggie skates up to them and leans on the barrier. TONY (referring to Georgette and John) Has it ever occurred to you that this might have all happened anyway? Even if you hadn’t played Titania and sprinkled fairy dust in everyone’s eyes? (CONTINUED)  112.",
      "characters": [],
      "action_text": "MAGGIE Of course it’s occurred to me. FELICIA You’ll never know if it was you, or the Hand of Destiny. MAGGIE I’ve decided to embrace the mystery of the universe and stop bossing everyone around so much. MAX Good luck with that, bossy pants. Max walks off, toward the ice. Maggie stares after him. MAGGIE He’s been listening to us this whole time? Max is already walking to the skating rink. TONY One day he’s going to write a book about us all. And we are not going to look good. Max skates off--he’s a demon skater. Felicia watches Lily skate by in the gaggle of little girls. LILY (shouting, to Justine) ...fifty-two a hundred!, fifty- three a hundred!, fifty-four... FELICIA What kind of three year old loves numbers that much? TONY Was John good at math? Because you certainly weren’t. MAGGIE I’m not sure... Something is dawning on Felicia, and then it dawns on Tony. But Maggie is skating away already. Maggie backs up on the ice, alone, happy. Stay with her a moment. She’s a good skater. CONTINUED: 111   111 (CONTINUED)  113. Then, she sees: walking over the crest of a hill, making his way toward the rink, skates slung over his broad shoulders, is Guy. The pickle entrepreneur. Who skates every Sunday. Glowing with idiosyncratic appeal. Backing up, Maggie stares at him in surprise, then thoughtfulness, then affection. She backs up till she hits the barrier of the rink. She can’t back up anymore. Move closer and closer to her watching Guy, until she is in a huge close up, on the very edge of her next move.   * CONTINUED: (2) 111   111  114.",
      "dialogue_count": 0,
      "word_count": 535
    }
  ]
}