{
  "slug": "man-on-a-ledge-2012",
  "title": "man on a ledge",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 23,
  "characters_count": 0,
  "characters": [],
  "total_words": 19729,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. PRISON - INTERVIEW ROOM - DAY 11   11  A female PRISON PSYCHIATRIST, 50, cold and detached, sits across from Nick, thumbing his file. Nick’s still in the cast, but his wounds have healed a bit. PSYCHIATRIST So your final appeal has been denied, Mr. Cassidy. (beat) That’s why I’m here. Nick stares off blankly, trying to quell his emotion. PSYCHIATRIST (CONT’D) Your old life is gone. (beat) Not many men, let alone ex-cops, can handle a forty-year sentence. Despair creeps across Nick’s face. NICK Maybe I’m one of the ones who can’t handle it. PSYCHIATRIST This is good.   Recognizing you’ve lost hope is the first step toward accepting the reality of your situation. He just stares off. PSYCHIATRIST (CONT’D) Nick, have you ever considered hurting yourself? NICK Hurting?   No.   Killing?   Every goddamned day. She coldly scratches a note in his file. INT. NICK’S CELL - DAY 12   12  An INMATE arrives outside Nick’s cell with a cart of books. Nick returns one: “The Psychology of Depression.”  4.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 169
    },
    {
      "scene_number": 2,
      "slugline": "EXT. PRISON YARD - DAY 13   13  Nick steps out into the harsh light of the prison yard. The group that nearly killed him before stands across the way, eyeing Nick as a guard shoves him forward. INT. PRISON - VISITATION ROOM - DAY 14   14  PRISON GUARDS keep watch.   PRISONERS speak to LOVED ONES across long steel tables. Nick waits at a table, hands cuffed in front of him, playing with a RUBIK’S CUBE.   His cast is off now, but he’s got a fresh black eye and bruises.   He looks up. MIKE CAVANAUGH, 30s, sharply dressed in a suit and tie approaches to greet him. MIKE Hey, Cass. Nick takes in Mike’s attire as he sits down. NICK Missed you, Mikey.   Been awhile. MIKE Yeah, well.   Getting married... Nick smiles bitterly. NICK I expect everyone else to dry up and blow away.   Not you. Mike looks away. NICK (CONT’D) Hey.   Look at me.   It’s not right I hear from someone else you made detective. Mike gets it. MIKE It’s hard for me, Cass, seeing you like this. NICK I know, Mikey. (beat) Congratulations.  5.",
      "characters": [],
      "action_text": "It’s a nice moment, but then Mike turns serious. MIKE Your brother called me. Nick sets down the cube. NICK He ask for money?   I heard they lost the house. MIKE Your dad is dying. There it is, hard and ugly.   Nick looks away, choked up. NICK How long? Mike shrugs.   Not long. MIKE I’ll talk to the warden, make sure you get a day on the outside with no hassle. Nick smiles grimly.   He picks up the Rubik’s Cube, turning it mindlessly. EXT. PRISON YARD - DAY 15   15  Nick jogs along the razor wire fence, head down, keeping to himself, burning through a rigorous routine. Suddenly a PRISON GUARD stands in his path. Nick stops, staring at the guy.   He knows what’s coming. I/E. SING SING PRISON - GATE - DAY 16   16  A prisoner transport vehicle stands at inspection. A PRISON GUARD drives, racked shotgun beside him. In the cage in the back are another GUARD and Nick, who sits handcuffed to a steel rail, wearing his prison blues. PRISON GUARD #2 Beautiful day. The transport pulls away from the prison.  6. EXT. CEDAR LAWN CEMETERY - SUNSET 17   17  Set up against a set of train tracks, there’s no rolling hills or shady trees here: just brown grass and fumes. Nick stands, hands cuffed before him, next to his brother, JOEY CASSIDY, 30, clean-shaven, a touch brainy with a youthful charm. Neither wants to be here.   And neither wants to be standing next to the other. JOEY’S GIRLFRIEND, ANGIE, 24, holds Joey close, quiet and supportive.   Later we’ll get to know her as an ass-kicking, take-no-shit New York firecracker: down to earth and charming but emotional, the kind of woman you don’t want to cross. Mike’s there with his WIFE, looking slick compared to the rumpled older generation of MOURNERS who watch as FATHER LEO, 60, wraps it up. FATHER LEO ...and when a good soul is taken from us, it can be hard to find reason to believe.   But, having faith in God’s promise - Father Leo looks to Nick; his words are for him... FATHER LEO (CONT’D) - and faith in yourself - is your one tr",
      "dialogue_count": 0,
      "word_count": 1162
    },
    {
      "scene_number": 3,
      "slugline": "INT. PRISON TRANSPORT VEHICLE - CONTINUOUS 18   18  Nick quickly cuffs the guards to the rail. PRISON GUARD #1 You won’t get far. NICK I don’t plan to. EXT. CEDAR LAWN CEMETERY - CONTINUOUS 19   19  Joey runs up as Nick hurries out of the truck. JOEY The hell are you doing? Nick levels the Glock at his brother’s head. NICK Keys. The guards watch as he pushes Joey towards the parking lot. EXT. PARKING LOT - SUNSET 20   20  Joey stands helpless as his brother unlocks his 4x4. JOEY You sure about this?   There’s no going back. He glances at the far end of the cemetery where two police cars enter, then back over at the APPROACHING TRAIN. NICK Yeah. Jumping in the truck, Nick peels out. Joey stands there staring after him as the two police cruisers blow past him. I/E. JOEY’S TRUCK - DRIVING - CONTINUOUS 21   21  Nick floors it, flying through the cemetery, eyeing the train and the cops. Breaking through a chain-link fence, he maneuvers the truck up the berm and across the tracks...  11.",
      "characters": [],
      "action_text": "...as the train roars past, WHISTLE BLARING... ...cutting off the cruisers. EXT. EMPTY ROAD - SUNSET - ESTABLISHING 22   22  Nick’s truck flies down the road. I/E. JOEY’S TRUCK - DRIVING - CONTINUOUS 23   23  One hand on the wheel, he goes through the glove-box.   Coming up with a flip-blade knife, he cuts off his GPS ANKLE- BRACELET and tosses it out the window. Zipping open Joey’s gym bag on the front seat, he rifles through it, gunning the truck faster. In the distance, far behind him, the lights of police pursuit rise. Nick eyes them drawing closer, then turns off on a side road, blowing past a sign that reads “NO OUTLET.” EXT. WASTEWATER TREATMENT PLANT - ESTABLISHING 24   24  This massive plant sprawls across hundred of acres: a maze of pipes and tanks. EXT. WASTEWATER TREATMENT PLANT - SUNSET 25   25  The 4x4 sits abandoned, as police cars pour in surrounding it, SCREECHING to a stop. Cops swarm out, guns ready.   Nick could have gone any number of ways. COP (into radio) Set a perimeter.   He can’t have gone far. BOOM DOWN to REVEAL that he’s standing on a manhole. EXT. WOODED HILLSIDE - ACCESS DOORWAY - NIGHT 26   26  This concrete-framed gated steel door set into this wooded hillside swings open and Nick emerges.   Pulling on a coat from Joey’s gym bag, he disappears into the night.  12. BOOM UP to REVEAL a sea of blue and red flashing lights at the treatment plant a mile away. I/E. MIKE’S SUV - MOVING - NIGHT 27   27  Mike drives, Manhattan’s skyscrapers visible up ahead.   The freeway back into the city is thick with traffic. Janice touches up her make-up as Mike’s phone RINGS. MIKE (into phone) Cavanaugh. INTERCUT - EXT. CEDAR LAWN CEMETERY - NIGHT - CONTINUOUS 28   28  Joey leans on a police car, the crime scene abuzz with activity behind him. JOEY It’s Joey.   Nick’s escaped. MIKE What? JOEY Jacked the guards, took my truck. Mike looks like he just got gut-punched. MIKE Jesus. JOEY I don’t know what to do, Mike. MIKE I got a guy with the Staties. Don’t",
      "dialogue_count": 0,
      "word_count": 818
    },
    {
      "scene_number": 4,
      "slugline": "I/E. BUS - EARLY MORNING 32   32  Transformed, Nick rides into the city with the early-shift of working stiffs. EXT. 49TH STREET & 6TH AVENUE - EARLY MORNING 33   33  The bus stops, doors opening with a pneumatic HISS.   Nick steps out.  This is where we opened.  EXT. 47TH STREET - EARLY MORNING 34   34  Nick walks along 47th, enjoying early morning serenity.   The city is empty and calm: a rare moment before the insanity of eight million people begins again. This is the heart of the Diamond District, where virtually every sign and storefront here is a diamond or jewelry business. Nick pauses to check out his reflection in a store window: straightens his tie, tugs on his cuffs. EXT. 45TH STREET & MADISON AVENUE - EARLY MORNING 35   35  Nick stops walking and looks up at the Roosevelt Hotel... ...and the ledge 21 floors above the street. EXT. ROOM 2105 - DAY 36   36  Nick stands on the ledge as before, poised to jump, eyeing the street far below. A WOMAN SCREAMS. EXT. 45TH STREET - DAY 37   37  A COP runs up the street towards the Roosevelt, looking up. INT. MIDTOWN NORTH PRECINCT - DAY 38   38  A DESK SERGEANT relays commands over the radio.  15.",
      "characters": [],
      "action_text": "DESK SERGEANT I need ESU on scene at the Roosevelt on 45th.   Shut down the block. (shouting out) Call Marcus: we got a man on a ledge. EXT. 45TH STREET - DAY 39   39  OFFICERS unload BARRICADES, slamming them into place, one after another. The street is closed.   Onlookers are corralled at both ends of the block, out of harm’s way. EXT. LEDGE - DAY 40   40  Nick looks down, watching the rapidly expanding action. EXT. 45TH STREET - DAY 41   41  The swelling crowd parts as a FIRE TRUCK pulls in followed by a NYPD ESU CAR.   DETECTIVE BOB DOUGHERTY gets out: 40, brash, self-confident, and New York Irish through and through. Dougherty and the firemen look at Nick 200 feet up. DOUGHERTY That’ll make a mess. INT. ROOM 2105 - DAY 42   42  The bellhop unlocks the door, allowing Dougherty to enter. EXT. LEDGE - CONTINUOUS 43   43  Dougherty pokes his head outside, glancing down 21 gut- wrenching stories: Jesus.   He looks over at Nick standing on the ledge, ten feet away, contemplating the abyss. DOUGHERTY Mr. Walker?   Hang tight, okay?   My name is Bob Dougherty and I’m here to help. Nick just stares down at the street.  16.",
      "dialogue_count": 0,
      "word_count": 411
    },
    {
      "scene_number": 5,
      "slugline": "EXT. 45TH STREET - DAY 44   44  DETECTIVE NATHAN MARCUS, 45, suit and tie, is the competent, intense, get-it-done man in charge: always in control and doesn’t suffer fools. He heads into the Roosevelt trailed by two cops. MARCUS I want mobile command here pronto. Keep the street locked up. Businesses too.   And get more crowd control. (into walkie) Dougherty, report. INT. ROOSEVELT HOTEL - LOBBY - CONTINUOUS 45   45  Marcus points at the waiting manager as he sweeps into the hotel, crossing to the elevators. DOUGHERTY (V.O.) Jumper’s mid-thirties, looks professional.   He’s not talking. MARCUS (to the Manager) I need the doorman, bellhop, room service - anyone who had contact. Marcus enters the elevator, presses “21.” MANAGER Yes sir. The doors close on him. INT. ROOM 2105 - DAY 46   46  Standing at the open window, Dougherty glances over as Marcus walks in.   Out on the ledge, Nick checks his watch. NICK I want a woman. Dougherty pauses.   This is a new one. DOUGHERTY Come inside, I’ll get you whatever you like.   Blonde?   Brunette?  17.",
      "characters": [],
      "action_text": "NICK Officer Anderson.   If she isn’t here in 30 minutes, I’m jumping. You and I are done talking, Bob. INT. ROOM 2105 - CONTINUOUS 47   47  Dougherty walks from the window, Marcus waiting. DOUGHERTY Ready for this?   He wants Anderson. Says he’s going over if he doesn’t get her. Marcus notes Nick’s breakfast spread on the table. MARCUS Last Supper? DOUGHERTY Not a good sign. Marcus thinks it over.   He points to the note on the desk. MARCUS  “I will exit this world just like I entered - innocent.   I’m going home.”  DOUGHERTY To the nut-house if he’s lucky. MARCUS Get a print team in here.   I want an ID. (beat) And call Anderson. DOUGHERTY Seriously? MARCUS You’ll back her up. DOUGHERTY Sure.   Why not?   Everyone loves a good train wreck. Marcus walks out.  18.",
      "dialogue_count": 0,
      "word_count": 312
    },
    {
      "scene_number": 6,
      "slugline": "INT. LYDIA’S APARTMENT - DAY 48   48  Sprawled on the bed in her underwear, LYDIA ANDERSON wakes from the sound of her RINGING phone. She’s 30s.   Beautiful.   And a wreck. Lydia stumbles through the simple apartment, tripping over a half-empty vodka bottle. The place is nicely decorated, but a mess.   There are family pictures: parents, brothers, many of them cops. Pulling the phone from under a pizza box, she answers. LYDIA Anderson. DOUGHERTY (V.O.) Christ, did I wake you up? LYDIA Course not.   Hold on. Lowering the phone, she takes a beat to pull it together. LYDIA (CONT’D) What’s up? DOUGHERTY (V.O.) You’re up. This is the last thing she expected. LYDIA I’m not on the rotation. DOUGHERTY (V.O.) No shit.   The Roosevelt.   Right now.  CLICK.   The line goes dead. She stands there, slightly lost, not sure what to do. LYDIA Crap. EXT. LEDGE - DAY 49   49  Nick checks his watch.  19.",
      "characters": [],
      "action_text": "THE CROWD BELOW continues to grow.   Cops clear a path allowing a TACTICAL MOBILE COMMAND CENTER truck to roll in. INT. MOBILE COMMAND CENTER - DAY 50   50  Two POLICE TECHS sit before a huge array of communications equipment and video monitors as Marcus walks in. POLICE TECH #1 We’ve got links with traffic control, the precinct, and the hotel. MARCUS Get cameras up.   Where’s my crime scene unit? POLICE TECH #2 Almost here. MARCUS Anything on J. Walker? POLICE TECH #2 We’ve got over six hundred of ‘em in the city. POLICE TECH #1 Fire Chief wants a word. EXT. 45TH STREET - DAY 51   51  ELENA OTERO MORALES, 40, with smoldering good looks, eyes the gathering crowd then looks up to Nick on the ledge. Her CAMERAMAN frames them up. ELENA MORALES Let’s burn one. CAMERAMAN In 3... 2... 1... ELENA MORALES Unlucky in love?   Victim of the Stock Market?   A young man contemplates death.   This is Elena Otero Morales reporting live from midtown...  20.",
      "dialogue_count": 0,
      "word_count": 321
    },
    {
      "scene_number": 7,
      "slugline": "EXT. LEDGE / 45TH STREET - DAY 52   52  Nick watches the ESU TRUCK pull up.   The Emergency Services Unit jumps to it, hauling out an INFLATABLE PAD. One hits a switch; the emergency airbag begins to inflate. 20’ x 20’ x 8’. From this height it’s not much bigger than a postage stamp. EXT. 45TH STREET - CONTINUOUS 53   53  The ESU guys beside the inflatable pad look up at Nick, a tiny speck twenty floors up. ESU #1 Helluva a drop. ESU #2 This ain’t gonna help. Cops push back the gathering crowd of construction workers, businesspeople, homeless, students: a cross-section of the entire city.   A heavyset BEARDED GUY is annoyed. BEARDED GUY Don’t shove me, man. Behind him, Lydia steps out of a cab, completely transformed and looking totally professional. She stares up 21 floors at Nick.   It’s a hard, internal moment, seeing him, knowing that she’s about to become responsible for this man’s unraveling life. MARCUS (O.S.) Hey.   You good to work? She turns.   He’s right there with the Fire Chief. LYDIA Of course. INT. ROOSEVELT HOTEL - LOBBY 54   54  Stopped by the officer controlling the front door, she presents her badge. LYDIA Anderson.  21.",
      "characters": [],
      "action_text": "At the announcement of her name it’s like a hush ripples out, silence falling across the OFFICERS and EMERGENCY WORKERS filling the lobby. Head up, ignoring the dozens of pairs of eyes on her, Lydia crosses to the elevators, shoes CLIPPING loudly in the silence. INT. ELEVATOR - CONTINUOUS 55   55  Hitting 21, she turns:   every person in the room is staring at her   as the doors roll closed. INT. ROOM 2105 - CONTINUOUS 56   56  Dougherty and a uniformed cop keep an eye on Nick. MARCUS (V.O.) Anderson’s on her way up. DOUGHERTY Enter the Grim Reaper. INT. 21ST FLOOR CORRIDOR - MOMENTS LATER 57   57  Dougherty waits outside the room as she heads up the hall. DOUGHERTY Welcome back. LYDIA Kiss my ass, Bob. DOUGHERTY He asked for you.   By name. She considers this. LYDIA What’s the scene? DOUGHERTY Suicide note.   Name’s Walker but we haven’t made him yet.   He’s not talking except to say he’s going off in... (checks watch) ...one minute. She turns off the ringer on her cell and enters the room.  22.",
      "dialogue_count": 0,
      "word_count": 379
    },
    {
      "scene_number": 8,
      "slugline": "INT. ROOM 2105 - CONTINUOUS 58   58  Lydia stops, taking in the room: food, note, made beds, empty luggage rack. LYDIA Did he ask for help? DOUGHERTY No. LYDIA Drunk? DOUGHERTY Don’t know. LYDIA Attitude? DOUGHERTY No dialogue. She studies Nick from behind as he leans against the sealed window: posture, stance, attitude. EXT. LEDGE - CONTINUOUS 59   59  Nick checks his watch.   8:41 AM. EXT. 45TH STREET - CONTINUOUS 60   60  A handful of REPORTERS and PHOTOGRAPHERS stand against the barricades photographing Nick and getting street interviews. ANGRY TRAFFIC GUY Anyone who creates this much traffic in midtown should be killed! Elena Morales and her cameraman look up at Nick. ELENA MORALES He jumps soon, we’ll make evening news in London. CAMERAMAN I give him an hour. ELENA MORALES I’ll take the under.  23.",
      "characters": [],
      "action_text": "CAMERAMAN Twenty bucks? She smiles.   It’s on. I/E. ROOM 2105 / LEDGE - DAY 61   61  Two CSI TECHS dust for prints as Dougherty looks on. Lydia eyes the remains of Nick’s breakfast, then glances at the techs working. LYDIA You process this yet? CSI TECH Yeah. She helps herself to some fries. Then she sets her cell phone by the TV, and puts in an ear- piece attached to her radio.   Taking a breath, she moves to the window and leans out. LYDIA Mr. Walker?   I’m Detective Lydia Anderson.   I understand you asked for me. For the first time, Nick turns.   She stands there: quiet, non- threatening, attractive. NICK Did you know part of Asia Minor was once called Lydia? LYDIA Do we know each other? He shakes his head.   She settles comfortably onto the window frame. LYDIA (CONT’D) What brings us out here today? NICK Aside from the view? She smiles.   But then he steps forward, standing rigid, toes just off the lip of the ledge. LYDIA Trust me, this gazing into the abyss stuff isn’t a good idea.  24. NICK Today is the day everything changes.   One way or another. He pins her with an unwavering gaze, bringing every fiber of his soul to bear. NICK (CONT’D) I am prepared to die.   It’s very important that you understand. She nods. NICK (CONT’D) Tell me. LYDIA I understand. NICK That’s all for now. He turns away, expecting her to go.   She doesn’t. LYDIA Why me? NICK Because you were with that jumper on the bridge last month and he died with the whole world watching. This cuts right to her core: she’s stunned, frozen into silence. Turning from the window, she finds Dougherty smiling at her. DOUGHERTY Excellent work.   Very impressive. LYDIA Clear the room. DOUGHERTY Now hold on... LYDIA My scene.   My room.   I want space. Now! Dougherty gives her a look as the techs file out. DOUGHERTY This is on you.  25.",
      "dialogue_count": 0,
      "word_count": 462
    },
    {
      "scene_number": 9,
      "slugline": "INT. COMMAND CENTER - DAY 62   62  All the screens are now up showing a long-lensed view of Nick, plus wider views of the crowd, the street, and the Roosevelt, plus some TV feeds. Putting down a phone, a police techs turns to Marcus. POLICE TECH #2 We’re getting a lot of static from the store owners. MARCUS The street stays locked up ‘til I say so.   I don’t want this poor bastard falling on someone. I/E. ROOM 2105 / LEDGE - DAY 63   63  Lydia takes a seat on the window again, watching Nick standing with his eyes closed, turned away, mumbling. Sensing something, he opens his eyes, sees her, and stops. LYDIA Are you praying? NICK My father died. He holds up the picture from storage of him with Joey and their dad. LYDIA I’m sorry. NICK You have family? LYDIA Parents.   Three brothers. NICK With three brothers, how do you end up a cop? LYDIA They’re cops too.   I was the rebel who got a degree and went into private practice. NICK Leather couch, matching chair, Miro lithograph?  26.",
      "characters": [],
      "action_text": "She smiles. LYDIA Chagall. (beat) It was dull as hell.   Now I’m here. NICK Any regrets? LYDIA Sure.   Things happen.   We make plans, God laughs. Nick pauses, keeping his emotions in check. NICK You have a lot of friends on the force? LYDIA Enough. NICK Not many I bet.   No women in the Boy’s Club. LYDIA You got something against cops? EXT. WOODED HILLSIDE - ACCESS DOORWAY - DAY - CLOSE ON 64   64  Mike.   Showered and sharply dressed, he’s all energy as he paces while keeping an eye on the scene behind him where Nick escaped from the wastewater treatment plant. Officers put up police tape as detectives scour the area and a K-9 unit hunts around. MIKE (into phone) Nothing at JFK?   How about the border? One of the detectives catches Mike’s eye and shakes his head. Mike gives him a nod of acknowledgement. MIKE (CONT’D) (lowers his voice) Tom, I want you to reach out to everyone we know.   Let’s keep this internal.   I want to find him first.   Run everything you get through me.  27.",
      "dialogue_count": 0,
      "word_count": 362
    },
    {
      "scene_number": 10,
      "slugline": "INT. 21ST FLOOR CORRIDOR - DAY 65   65  Dougherty and the techs are standing in the hall when suddenly the room door opens. Dougherty straightens up as Lydia gets in his face. LYDIA Can you do your job or do you need to go? DOUGHERTY Look, Lydia... LYDIA (pointing) I’m primary.   You’re secondary. You’re here to support me.   In or out: nothing in between. Dougherty looks her over icily as the Techs watch stunned, waiting to see what’s going to happen. DOUGHERTY I’ll do my job. She turns and walks back into the room, leaving the door open behind her. INT. ROOSEVELT HOTEL - ENGLANDER’S OFFICE - DAY 66   66  DAVID ENGLANDER, 50s, confident and serene, wearing a five thousand dollar suit, stands at a wall safe, strapping on a gold Brequet Classique 3137, then grabs a pair of massive emerald cuff-links while he talks on a headset. ENGLANDER I’ll tell you what, Monica.   I’ll host a dinner for the gold circle donors.   Use my name.   Whatever you need.   I mean, it’s the children’s wing. (beat) Hell, in this economy, it’s the least I can do.   Of course.   Bye. An ASSISTANT has appeared in the background with a well- dressed 40-year-old Connecticut WASP. ASSISTANT Mr. Henry is here, sir.  28.",
      "characters": [],
      "action_text": "Englander closes the safe and walks through his massive open office in the 22nd floor of the Roosevelt, where architectural models of different developments are laid out on tables. ENGLANDER What do you want, Ted? The man smiles nervously at Englander’s approach. TED I couldn’t do it... (beat) I’ve dealt with the planning commission, but the councilman... it’s too much of a risk for me. Ted sets a Cartier box on Englander’s desk.   Englander stares at it. ENGLANDER The hell is that? TED It’s a gift...   I’m sorry. Englander opens the box, looks at the Pasha watch,   and hurls it against the wall... WHAM!  ENGLANDER I don’t need a fucking watch, Ted! I need you to do the job you agreed to do! TED David... ENGLANDER The   job   that by   not doing   you are fucking me and my partners in a way that cannot be unfucked by some pathetic gesture in a red box which does absolutely nothing but make you feel better! TED I... ENGLANDER Tell me it’s done. TED Please...  29. ENGLANDER TELL ME IT’S FUCKING DONE! TED (breaking) Sure, David.   It’s done. ENGLANDER Thanks for the watch. He watches Ted turn and leave as his assistant appears. ASSISTANT We’ve had to push the presentation thirty minutes: there’s a jumper on the building and they closed 45th. Englander checks the time on his Breguet, exasperated. ENGLANDER Why can’t people just shoot themselves in the head? (beat) Go push him off. The assistant freezes, unsure what to do. ASSISTANT The police are supervising the situation, sir. He grins. ENGLANDER You’d do it?   I   love   that. (beat) Get out of here.   You disgust me. EXT. LEDGE - DAY 67   67  Nick looks over with a bemused smile. LYDIA What? NICK You’re way prettier than I thought you’d be. LYDIA Are you flirting with me?  30. NICK What?   You’re telling me that never comes up in your line of work? LYDIA Not too often.   Most suicidal people have other things on their minds. INT. MOBILE COMMAND CENTER - DAY 68   68  The bellhop is here, talking to Marcus. BELLHOP He ",
      "dialogue_count": 0,
      "word_count": 3802
    },
    {
      "scene_number": 11,
      "slugline": "EXT. LEDGE - DAY 109   109  Nick listens, trying to see it in his head, but Lydia’s talking to him... LYDIA I want you to visualize something positive.   If this wasn’t going on, if you could be anywhere, what would you be doing? JOEY (V.O.) Angie thinks it’s a heat sensor. NICK (to Joey and Lydia) I’m thinking. (to Lydia) Maybe we’d be having coffee. LYDIA Come on.   You can do better than that.   Something to really live for. He looks over at her. NICK Scratch coffee.   We’d have a four star dinner and a couple great bottles of wine. LYDIA That’s a little better. JOEY (V.O.) Talk to me, Nick.   Not the girl. (sotto) Is she hot? O.S. We HEAR Angie SMACK him. JOEY (V.O.) Ow! NICK (to Joey and Lydia) Oh yeah. LYDIA What else? Nick, thinking, remains quiet.  49.",
      "characters": [],
      "action_text": "JOEY (V.O.) Yo Nick?   Nicholas?   Nicky?   Hey, numbnuts. LYDIA What is it? NICK Sometimes I freeze up. JOEY (V.O.) Okay.   How do I do that? LYDIA Freeze up? NICK It’s like all my hopes are extinguished. JOEY (V.O.) Extinguished. NICK It’s like all the oxygen just got sucked out of the room and I just got sprayed with CO2. Lydia’s a little confused by this turn in the conversation. LYDIA That sounds like a horrible feeling. ANGIE (V.O.) Fire extinguisher!   CO2 fire extinguisher! NICK Yes. JOEY (V.O.) Copy that. NICK But then sometimes I know everything’s going to be okay.   You just have to keep moving, because time is running out for all of us. JOEY (V.O.) I hear you, lover-boy.   Just take it easy with the poetry there. It’s a little gay.  50.",
      "dialogue_count": 0,
      "word_count": 277
    },
    {
      "scene_number": 12,
      "slugline": "INT. ENGLANDER JEWELERS - MAIN HALLWAY - CONTINUOUS 110   110  Joey pulls a CO2 fire extinguisher off the wall. He fires a long blast at the sensor, approaching quickly, Angie directly behind him, carrying the bags. Closing in, Joey hoses it down, frosting the sensor up with ice condensing on it as they hurry past. EXT. LEDGE - CONTINUOUS 111   111  LYDIA Why is time running out for you? Nick checks his watch. NICK Because that print you pulled off our cigarette is about to come through. Lydia looks at him in surprise. EXT. STORAGE AREA - DAY 112   112  Mike glances left, glances right, then cuts the lock off Nick’s container with bolt cutters. INT. CARGO CONTAINER - DAY 113   113  Pulling on latex gloves, Mike looks around, noting Nick’s shaving stuff and prison clothes. Rifling through the place, he finds a stack of papers Nick left: mechanical drawings of a building, electrical schematics. MIKE (realizing) Son of a bitch. INT. ENGLANDER JEWELERS - MAIN HALLWAY - DAY 114   114  Joey peeks around the corner with a small hand-held mirror revealing the VAULT HALLWAY with STEEL DOOR at the end. On the ceiling in front of the door is a MOTION DETECTOR. Joey turns back as Angie a takes small Styrofoam ice chest from their bag, painting its rim with rubber cement.  51.",
      "characters": [],
      "action_text": "JOEY Slow and steady. She nods and steps into the hall, moving super slowly. Smooth and even, she starts up the hall, focused on the motion sensor and its little green light. INT. MOBILE COMMAND CENTER - DAY 115   115  Police Tech #1 tears off a printout and hands it to Marcus. POLICE TECH #1 Got a hit on Anderson’s print. Marcus studies the paper, stunned. MARCUS Get a tactical team here now. INT. ROOM 2105 - DAY 116   116  Lydia stands with Dougherty away from the windows. MARCUS (V.O.) Your boyfriend’s an escaped convict.   Nick Cassidy.   Was doing hard time in Sing Sing. Lydia is more pissed than surprised, eyeing Nick through the windows. LYDIA The cop from Midtown North, who stole the forty-million dollar diamond from David Englander. DOUGHERTY I   knew   I recognized him. LYDIA Englander   owns   this hotel.   His offices are here. MARCUS (V.O.) And his Jewelry Exchange is directly across the street. LYDIA Get his police file over here.   I want a line on family.   And have someone to toss his cell ASAP.  52. DOUGHERTY (on the suicide note) “I will exit... like I entered. Innocent.” LYDIA He wants us to think he didn’t do it. DOUGHERTY Good luck with that. LYDIA What escaped felon returns to the scene of the crime? DOUGHERTY Suicidal ones. LYDIA Who’d he ride with? MARCUS (V.O.) Mike Cavanaugh. I/E. CARGO CONTAINER - DAY 117   117  Mike pours gasoline over the contents of the container, pausing to answer his RINGING cell. MIKE Cavanaugh. He listens for a moment, then takes a breath, prepping his performance. MIKE (CONT’D) Jesus.   I can’t believe it.   How’s he doing? INTERCUT - INT. ROOM 2105 - CONTINUOUS 118   118  LYDIA He’s playing it very cool.   Like this is all some sort of game. Mike considers this, worried. MIKE (hesitates) He always insisted he was innocent.  53. LYDIA You believe that? MIKE Look, he was my partner for eight years.   I stood by him... but, you know... She absorbs this, watching Nick, considering. LYDIA You think he’d jump? MIKE He’",
      "dialogue_count": 0,
      "word_count": 1657
    },
    {
      "scene_number": 13,
      "slugline": "INT. ENGLANDER JEWELERS - MAIN HALLWAY - CONTINUOUS 132   132  Beside the cameras, just out of sight of the elevators, Joey has a ceiling panel opened up, desperately stuffing their gear up into the ceiling. JOEY (calling out) How you doing babe? INT. ENGLANDER JEWELERS - VAULT HALLWAY - CONTINUOUS 133   133  Dripping sweat from concentrated effort, Angie continues her agonizingly slow trek up the hall. INT. MOBILE COMMAND CENTER - DAY 134   134  Two cops escort Englander inside the mobile command center. ENGLANDER Who’s in charge? Marcus turns, unflappable as always. MARCUS That would be me. ENGLANDER What is that sonofabitch doing up on my building? MARCUS I don’t know, Mr. Englander.   But I can assure you the situation is under control. Englander almost laughs, looking at Marcus like he’s an idiot. ENGLANDER Have you looked outside? Marcus regards him icily. MARCUS Is there something specific I can do for you? ENGLANDER I want access to my floor of the Jewelry Exchange.  60.",
      "characters": [],
      "action_text": "MARCUS We’re already working with First Line. ENGLANDER And I want that thief off my building! MARCUS We have procedures. ENGLANDER He’s a policeman.   He   knows   your procedures!   You’re letting him manipulate you. Marcus is done being pushed. MARCUS Cassidy isn’t going anywhere except back into custody or splat on 45th. ENGLANDER Wrap this up, or tomorrow you’re sucking fumes on a parking scooter in Staton Island. Englander exits, leaving Marcus staring coldly after him. EXT. ENGLANDER JEWELERS - DAY 135   135  Cho, his partner, and the cops make it through the crowd to the gated door. EXT. LEDGE - CONTINUOUS 136   136  Nick watches as they enter the building. NICK They’re inside. INT. ENGLANDER JEWELERS - VAULT HALLWAY - CONTINUOUS 137   137  Angie continues her walk:   she’s only half-way up the hall. She’s never going to make it.  INT. ENGLANDER JEWELERS - ELEVATOR - CONTINUOUS 138   138  Cho and his team ride up in the elevator.  61.",
      "dialogue_count": 0,
      "word_count": 323
    },
    {
      "scene_number": 14,
      "slugline": "INT. ENGLANDER JEWELERS - MAIN HALLWAY - CONTINUOUS 139   139  Joey jumps for the ceiling, catches it, and pulls himself up. INT. ENGLANDER JEWELERS - RECEPTION AREA - DAY 140   140  DING!   The elevator (not Joey and Angie’s) rolls open revealing Cho and his team, but Cho stops the cops from exiting, and dials his phone. CHO Disarm fifteen, hallway. (beat) Ok.   We’re clear. INT. ENGLANDER JEWELERS - MAIN HALLWAY - CONTINUOUS 141   141  Joey listens to them as he hangs upside-down in the ceiling. JOEY (whisper into radio) Go! INT. ENGLANDER JEWELERS - VAULT HALLWAY - CONTINUOUS 142   142  Angie breaks into a sprint, rounding the corner... INT. ENGLANDER JEWELERS - MAIN HALLWAY - CONTINUOUS 143   143  ...running all-out as... INT. ENGLANDER JEWELERS - RECEPTION AREA/HALLWAY TURN - 144   144  CONTINUOUS ...Cho and the cops stride forward. INT. ENGLANDER JEWELERS - MAIN HALLWAY - CONTINUOUS 145   145  Angie jumps and Joey catches her wrists, pulling her up into the ceiling, her feet disappearing... ...as Joey yanks the pictures from the security cameras... ...just as Cho and the cops round the corner...  ...and stride up the empty hall.  62.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 190
    },
    {
      "scene_number": 15,
      "slugline": "INT. ENGLANDER JEWELERS - VAULT HALLWAY - CONTINUOUS 146   146  Cho and the cops arrive at the steel door. CHO This is where Englander entertains the high-rollers. He enters a long combination sequence into the KEYPAD. INT. ENGLANDER JEWELERS - CEILING - CONTINUOUS 147   147  Joey and Angie lie side by side, surrounded by their gear...  ...watching a hand-held monitor with a view from the tiny camera Joey placed under the keypad hood.  ...as   Joey scrawls the combination on his arm.  INT. ENGLANDER JEWELERS - VAULT HALLWAY - CONTINUOUS 148   148  The door CLICKS open with a HUM. CHO (into phone) Disarm the vault room. He pulls open the incredibly thick steel door... INT. ENGLANDER JEWELERS - MAIN SAFE ROOM - CONTINUOUS 149   149  This well appointed inner sanctum is impressive: wood floors, Persian carpets, Modernist paintings, a well stocked wet-bar, leather chairs and felt-covered tables for handling jewels. There’s also an enormous steel safe along one wall. Cho holds everyone at the door. CHO The floor’s wired with seismic sensors.   And over there we have light sensors and body heat sensors.   And that’s before you ever get to the safe. COP No one’s getting into that beast. Cho swings the door closed and they head back out.  63.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 210
    },
    {
      "scene_number": 16,
      "slugline": "INT. ENGLANDER JEWELERS - MAIN HALLWAY - DAY 150   150  Cho dials his cellphone, pausing as it connects. CHO It’s Cho.   Englander’s is clear, Detective. Overhead, ice on the heat sensor slowly melts.   A couple drops of water have already landed at Cho’s feet. A WATER DROPLET gathers, hanging precariously, ready to drop. INTERCUT - INT. COMMAND CENTER - CONTINUOUS 151   151  MARCUS Good.   I don’t need that sonofabitch crawling any further up my ass. The water droplet falls...   just missing Cho as he starts forward.  CHO Roger that. EXT. 45TH STREET - DAY 152   152  The TACTICAL VAN pulls up next to the Command Center and a bunch of commandos start unloading equipment. INT. MOBILE COMMAND CENTER - CONTINUOUS 153   153  Lydia is already here with Marcus as BAUER, the tactical commander walks in. MARCUS Welcome to the show, Bauer. BAUER I understand this is a fugitive situation. Marcus nods. MARCUS Where are we at? LYDIA I think he really believes that he’s innocent.  64.",
      "characters": [],
      "action_text": "MARCUS Yeah?   What’s that make him? LYDIA Either an honest man or a sociopath. MARCUS He ain’t an honest man.   Can you get him off the dammed ledge? She considers. LYDIA Yeah.   He likes me. MARCUS Get back up there and make it happen. INT. ENGLANDER JEWELERS - CEILING/MAIN HALLWAY - DAY 154   154  Joey opens the panel, peeks out, and drops to the ground. JOEY So other than being a thief, is there anything else you haven’t told me? WHAM!   The big bag hits him in the face, hard. She drops down beside him. ANGIE You know, you’re really starting to chafe me.   You don’t want to know everything.   Nobody does. JOEY Sure I do. ANGIE Boyfriends?   Girlfriends?   Best sex of my life? Joey winces. JOEY Okay!   Stop!  65.",
      "dialogue_count": 0,
      "word_count": 297
    },
    {
      "scene_number": 17,
      "slugline": "I/E. MIKE’S SUV - DRIVING - DAY 155   155  Mike drives like a madman through midtown.   Traffic is a mess. EXT. ROOSEVELT HOTEL - DAY 156   156  Long lens type shot of HOTEL GUESTS leaning out of the windows, craning for a view of Nick. PAN OVER to see Nick, high up on the ledge. EXT. 45TH STREET - DAY 157   157  People in the crowd stare up, rapt.   A carnival atmosphere has taken hold. STREET VENDORS are doing a brisk business in hotdogs and popcorn. A SAXOPHONE PLAYER is playing on the corner. OLD ORTHODOX JEW He should think of his poor mother. OLDER ORTHODOX JEW That’s probably why he’s up there. EXT. 45TH STREET - DAY 158   158  ELENA MORALES The Monarch Diamond was first owned by Charles II, the last King of the House of Hapsburg.   It was held by the Englander family for three generations until it was stolen by the man on the ledge, Nick Cassidy, who’s said to have cut it into untraceable pieces and sold it. INT. ENGLANDER JEWELERS - VAULT HALLWAY - CONTINUOUS 159   159  Joey pulls off the wood panel revealing the rough hole...  ...and the exposed ventilation duct.  INT. ROOSEVELT HOTEL - ENGLANDER’S OFFICE - DAY 160   160  Englander paces on his headset.  66.",
      "characters": [],
      "action_text": "ENGLANDER Because you’re the goddammed Mayor, that’s why.   I want you to get your cops to scrape this turd off my building! MAYOR (V.O.) David, you’re upset, but it’s not like they can just shoot him off. Look, I’ll call and apply some pressure. Englander angrily breaks the connection, and walks to his bar, pouring a short one, and looking out the window... ...across the way at Nick on the ledge. EXT. LEDGE - DAY 161   161  Nick watches Cho, Cho’s partner and the two cops leave the Exchange. Lydia reappears at the window. LYDIA Tactical is on scene.   Your time up here is ticking away. NICK Everything you think you know about me is wrong. LYDIA Englander didn’t steal his own diamond. NICK When someone like him is suddenly out of money, greed begets corruption. LYDIA He’s loaded.   He parlayed his father’s jewelry business in to a real estate empire. NICK Yeah, and after I drove him up to Chappaqua, he stood there smiling while two masked guys pulled me out of the car and knocked my lights out.  67. LYDIA No one believes that. NICK Not even my own lawyer. LYDIA They found diamond chips in your shirt. NICK The Monarch never left Englander’s hands; he’d never part with it. It’s the ultimate symbol of his success. LYDIA So what did he have to gain? NICK He was broke.   Lost thirty million with Lehman.   And at least another twenty in the real estate bust. (beat) Two weeks after my conviction, Lloyd’s of London wired him a forty- million dollar insurance claim. Poof.   He’s back. Lydia weighs it. LYDIA Why put it on you? NICK I could never prove it, but the two guys who clobbered me were cops. LYDIA (disturbed) How could you know? NICK The way they carried themselves. You’d have known.   Any cop would’ve. EXT. 45TH STREET - DAY 162   162  Mike arrives on scene, flashing his detective’s badge and crossing the barricade.  68.",
      "dialogue_count": 0,
      "word_count": 543
    },
    {
      "scene_number": 18,
      "slugline": "INT. MOBILE COMMAND CENTER - DAY 163   163  Hurrying in, Mike’s stunned at the views of Nick on screen. Marcus turns to face him. MIKE How is he? MARCUS Anderson hasn’t killed him yet. MIKE Talking? MARCUS Some.   But I’m getting a lot of pressure to end this. A uniformed COP enters with a blue folder. COP I’ve got some papers from his cell in Sing Sing. MARCUS Take ‘em up to Dougherty and Anderson. Mike glances at the folder. MIKE I’ll take it. EXT. LEDGE - CONTINUOUS 164   164  NICK The thing we’ve got in common, Lydia, is we’ve both been hung out to dry.   You   know   what it means to be on the outside.   You   know   what I’m up against. LYDIA I know you tell a good story. NICK Just like me, today’s the day you get another shot. She weighs it for a long beat.  69.",
      "characters": [],
      "action_text": "LYDIA If you’re fucking with me on this, I’ll push you off myself. INT. ROOM 2105 - CONTINUOUS 165   165  Lydia walks inside past Dougherty, picking up her cell phone. LYDIA Watch him! INT. ENGLANDER JEWELERS - VAULT HALLWAY - DAY 166   166  Joey finishes cutting into the air duct. Angie has stripped down to her underwear and starts pulling on a skintight mylar suit. Joey watches.   She’s smoking hot and she knows it.   He knows he should keep his mouth shut, but... JOEY So... what   was   the best sex of your life? ANGIE You, baby. He can’t decide if she’s fucking with him or not. JOEY Yeah? ANGIE Well, there was this one guy in high school.   He was older... JOEY Don’t even mess with me. Joey zips up her suit.   Angie pulls on a climbing harness and peers into the tiny vent. ANGIE I won’t fit in there. Joey looks to his watch, stressed. JOEY C’mon hon.   There’s no time for this.   Just like we practiced or Nick’ll kill me.  70. ANGIE Not if I kill you first. JOEY Be mad.   But be mad in the vent. INT. ROOM 2105 - CONTINUOUS 167   167  Lydia paces, listening to someone on her cellphone - apparently getting more information about Nick’s case. LYDIA (into phone) When was this?   Did IA have something? (beat) Okay.   Thanks. She hangs up and turns to Dougherty. LYDIA (CONT’D) Are we sure nothing’s happening across the street? DOUGHERTY You can’t steal something twice. Especially not after it’s been diced up into a dozen pieces. SLAM!   Elena Morales bursts through the door with her cameraman in tow, a confused uniformed cop chasing after her, the camera light hitting Lydia in the face. ELENA MORALES Detective Anderson, we’ve heard that Cassidy   chose   you.   That he has a death wish.   Care to comment? Lydia, pissed, controls her emotions for camera. LYDIA Bob, get rid of her. Dougherty and the cop shove Morales and her cameraman into the hallway. DOUGHERTY Move it, sweet cheeks. Lydia picks up her walkie. LYDIA Marcus.  71. INTERCUT - INT. MOBILE COMMAND CENTER - ",
      "dialogue_count": 0,
      "word_count": 1007
    },
    {
      "scene_number": 19,
      "slugline": "EXT. HOTEL ROOF - DAY 175   175  The tactical team bursts out the roof access door and begins setting up. INT. ROOM 2105 - DAY 176   176  Mike flashes his badge, entering the room.   Dougherty gives him a nod. DOUGHERTY Welcome to the party, Cavanaugh. MIKE Got some papers from Sing Sing. Lydia, on her cell phone, walks from the window, takes the blue file from Mike and gives it to Dougherty. MIKE (CONT’D) (to Lydia) I want to talk to him. LYDIA No. Mike’s taken aback. MIKE Why not? LYDIA You were buddies with Jack Walker, right? MIKE The hell does that have to do with anything? Mike tries to walk past her.   She gets in front of him. LYDIA I said no. MIKE That’s my friend out there! Angry, he turns to Dougherty. MIKE (CONT’D) Dougherty?   You wanna fix this? Dougherty weighs it out.  75.",
      "characters": [],
      "action_text": "DOUGHERTY It’s the lady’s call, Mike. Mike’s furious... but then he tucks it away, turns, and walks out. There’s an uneasy beat. LYDIA Thanks. DOUGHERTY (cold) You better know what you’re doing. Suddenly the bellhop appears in the door with a room service cart.   Lydia and Dougherty stare at him. BELLHOP I brought up some food.   Thought the kid might be hungry. EXT. LEDGE - DAY 177   177  The bellhop pokes his head out.   Takes a look at Nick. BELLHOP How you doin, son? EXT. LEDGE - DAY 178   178  Nick munches on a cheeseburger and fries. The crowd watches, rapt.   They’re loving it. INT. ROOSEVELT HOTEL - ENGLANDER’S OFFICE - DAY 179   179  Englander stands at his window, watching Nick eat his lunch on the east tower. Nick gives him a big smile and flips him off. INT. ENGLANDER JEWELERS - AIR DUCT - DAY 180   180  Angie ties a shoelace to the vent screen, pops it out, catches it with the lace and tapes it to the wall. Stressed, she pokes her head out and spots the COMPUTERIZED KEY-PAD on the wall.  76. ANGIE Nick, I’m in. EXT. LEDGE - CONTINUOUS 181   181  Nick glances back through the window into the room, then turns back to face the Jewelry Exchange. NICK Let’s do this fast before that heat sensor catches up with you. INT. ENGLANDER JEWELERS - MAIN SAFE ROOM/VAULT HALLWAY - 182   182  CONTINUOUS Angie clicks on a red LED head lamp and inches forward, slipping out of the vent... ...falling, before the rope catches her... ...jerking Joey forward. JOEY (sotto) Light as a feather. ANGIE I heard that! She maneuvers in front of the panel, flicks open a switchblade, and pops it revealing a tangle of electronics. EXT. LEDGE - CONTINUOUS 183   183  Suddenly Lydia reappears at the window. LYDIA I just threw Cavanaugh out of here. Tactical is setting up on the roof. You need to come in. NICK I can’t yet. ANGIE (V.O.) Nick? LYDIA The whole world knows who you are now.  77.  (MORE) You’ve inspired every reporter in the country to dig into your story. If you’re innocent, it’l",
      "dialogue_count": 0,
      "word_count": 668
    },
    {
      "scene_number": 20,
      "slugline": "EXT. LEDGE - CONTINUOUS 186   186  NICK What do you see, Angie? INTERCUT - INT. ENGLANDER JEWELERS - MAIN SAFE ROOM - DAY 187   187  She looks at the electronics in the panel... ANGIE Mass of wires, four orange ladybugs, two silver cuff-links. Nick closes his eyes, envisioning the layout. NICK Okay, the cuff-links are processors.   We’re going to short one out and take down all the sensors.   Cut the red wire... Under the red light they all look red. ANGIE They’re all the red wire! NICK Pick the reddest. Joey strains on the rope. JOEY You’re doing great, babe. Angie sorts through the spaghetti of wires: she makes a choice and... ANGIE Please God... CLIP!   Nothing happens. ANGIE (CONT’D) Done. NICK Great.   Now bridge it to one of the cuff-links.   It might spark a bit... Angie touches it and gets a huge shock, jerking violently.  79.",
      "characters": [],
      "action_text": "ANGIE Ahhh! INT. ENGLANDER JEWELERS - VAULT HALLWAY - CONTINUOUS 188   188  Joey looses control of the rope... ...dropping Angie with a horrible THUD. JOEY Angie? There’s no response. Pulling back his sleeve, he frantically punches in the combination they lifted from Cho.   Dragging open the door... ...reveals Angie, pissed, standing in the disarmed room. JOEY (CONT’D) It has to be me, right?   That time I took you upstate for the weekend. You actually passed out... She starts stripping out of the suit. ANGIE I’m not speaking to you right now. EXT. 45TH STREET - DAY 189   189  The BOMB SQUAD VAN pulls up across from the hotel. Four BOMB SQUAD GUYS pour out, unloading their gear. INT. ROOSEVELT HOTEL - 21ST FLOOR CORRIDOR - DAY 190   190  Mike paces, on his phone. INTERCUT - INT. MOBILE COMMAND CENTER - CONTINUOUS 191   191  MIKE This chick is   completely   off the reservation! MARCUS Take it easy... MIKE Pull her!   Let me take over.  80. Marcus considers. MARCUS I think you should sit this one out. MIKE Listen to me... MARCUS Mike!   You’re done. Furious, Mike ends the call. EXT. ROOSEVELT HOTEL - ROOF - DAY 192   192  The TACTICAL LEADER studies a TOP-VIEW of Nick on a small hand-held screen of a SNOOP CAM peeking over the roof. Three commandos are harnessed up, ready to go over the edge. TACTICAL LEADER (into radio) We’re in position. INT. MOBILE COMMAND CENTER - CONTINUOUS 193   193  Bauer looks at Marcus. BAUER On your word.   Just need to clear the negotiator for a clean exit. INT. ROOM 2105 - DAY 194   194  Dougherty’s on the radio DOUGHERTY Stand by. (to Lydia) Clear the window.   Tactical’s a go. Lydia can’t believe it.   She doesn’t move an inch. LYDIA (into radio) The hell is this, Marcus?  81. INTERCUT - INT. MOBILE COMMAND CENTER - CONTINUOUS 195   195  MARCUS We’re accelerating. LYDIA This makes no sense! MARCUS It’s not your call. LYDIA Negative.   He’ll go off before he gets taken down. MARCUS That’s assuming our track record is on par with yours. L",
      "dialogue_count": 0,
      "word_count": 598
    },
    {
      "scene_number": 21,
      "slugline": "EXT. LEDGE - CONTINUOUS 196   196  Lydia leans out the window, meeting Nick’s eyes, then glancing up as the commandos appear at the roofline. ...and before anyone can do anything... ... she steps out the window, across the gap, and onto the ledge. Two-hundred feet below, the crowd goes crazy, cheering like a rockstar just took the stage.  INT. MOBILE COMMAND CENTER - CONTINUOUS 197   197  Marcus and Bauer watch it on their screens. MARCUS Jesus. BAUER Hold!   Repeat no go, no go! INT. ENGLANDER JEWELERS - MAIN SAFE ROOM - DAY 198   198  Joey’s sweating hard, drilling a small hole in the safe’s lock mechanism, finally breaking through. JOEY Okay.   Thermos? Angie steps in with heavy gloves, funnel, and a thermos full of LIQUID NITROGEN which she pours into the drill hole. EXT. LEDGE - CONTINUOUS 199   199  Lydia presses against the wall, trying not to look down. LYDIA Well this is scary. Dougherty stares through the window in shock, then starts shouting into a radio as Nick looks at her, stunned. NICK The hell are you doing? LYDIA Just a spur of the moment thing to save your life.  83.",
      "characters": [],
      "action_text": "NICK You’re crazy. LYDIA That’s real funny coming from you. Nick breaks into a big grin. LYDIA (CONT’D) What? NICK You finally believe I’m innocent. LYDIA It’s a possibility. (beat) Just please tell me there’s no bomb. NICK Course not.   I just need ten more minutes. LYDIA Ten more minutes for what? INT. ENGLANDER JEWELERS - MAIN SAFE ROOM - DAY 200   200  The safe door is covered in frost as Angie pours the last of the liquid nitrogen into the hole. ANGIE Batter up. Joey steps up to the plate with the sledge hammer. Joey swings: WHAM!   The combination lock shatters to bits. JOEY Moment of truth, Nick. Angie spins the bolt retractor and the safe swings wide...  ....REVEALING THE MOTHERLODE: trays of gemstones, piles of jewelry, and bars of gold.   It’s absolutely stunning.  Joey dives in, quickly riffling through the drawers of the safe, searching.   Angie presses up against him. ANGIE I am so hot for you right now.  84. She reaches out for the goods; he lightly slaps her hand. JOEY We’re only here for one thing. ANGIE And while that’s true, I suddenly question our plan. INTERCUT - EXT. LEDGE - CONTINUOUS 201   201  Nick turns the Rubik’s Cube,   giving Lydia a wink and...  NICK Talk to me Joey.   Tell me what we’ve got.  Lydia stares at him as he for the first time does not hide the fact that he is talking to someone else.  LYDIA Who the hell are you talking to? (realizes)  You’re stealing the diamond.  Nick grins. NICK Oh yeah. Lydia can’t believe it. Joey’s now systematically turning out every drawer in the safe, dumping them on the floor: riches of every sort... Angie watches as he dumps out the last tray.   No diamond. JOEY No... He starts tapping around the inside of the safe looking for secret panels or anything. Angie’s stunned. ANGIE It’s gotta be here!   What the hell are we going to do? Joey looks lost.   Then he sets his jaw. JOEY We keep going.  85. He hits his comm. JOEY (CONT’D) Nick, it’s not here. The Rubik’s Cube slips from Nick’s grasp... In SLOW",
      "dialogue_count": 0,
      "word_count": 678
    },
    {
      "scene_number": 22,
      "slugline": "INT. ROOSEVELT HOTEL - ENGLANDER’S OFFICE - CONTINUOUS 205   205  Englander stares out at the Jewelry Exchange, the ALARM audible from here. INT. MOBILE COMMAND CENTER - CONTINUOUS 206   206  POLICE TECH #2 We’ve got an alarm at Englander’s! Marcus is stunned. MARCUS Seal that building!   No one gets out! EXT. LEDGE - DAY 207   207  Nick and Lydia stare out across the street. LYDIA Jesus. INT. ENGLANDER JEWELERS - MAIN HALLWAY - DAY 208   208  Englander strides up the hall with Cho and an array of security men and cops. They note the ceiling panel askew where Joey and Angie hid earlier. CHO (into walkie) They’re in here somewhere.   Maybe the ceiling. MARCUS (V.O.) We’re searching it floor by floor. INT. ENGLANDER JEWELERS - MAIN SAFE ROOM - CONTINUOUS 209   209  Striding in past the ripped out panel and vent, they discover tools and the cracked safe, jewels scattered everywhere. Englander walks straight   past the safe   to the back of the room, swiping a magnetic card at a blank spot on the wall... ...and a secret panel slides open revealing a hidden safe and a retinal scanner which lights up.  87.",
      "characters": [],
      "action_text": "Englander has his eye scanned, then punches in a long code and the secret vault CLICKS open. Inside is a single red velvet bag. ENGLANDER (sotto) Thank god. He slips open the bag to check its contents and we glimpse something sparkling, the size of a golf ball. He pauses for a moment, as if to consider whether it was all worth it. Smiling, he tucks it into his pocket and shuts the secret safe then turns to Cho and the cops. ENGLANDER (CONT’D) Tear this place apart. EXT. LEDGE - CONTINUOUS 210   210  Nick and Lydia watch the commotion around Englander’s. He turns to her, nervous and worried. NICK I need you to try something. LYDIA What? NICK You can pull the IA file on Walker. See if there’s anything there. A long moment between them. LYDIA Don’t go anywhere. NICK I’ll do my best. INT. ROOM 2105 - DAY 211   211  Dougherty gives her a hand climbing back inside.  88. DOUGHERTY You got some big balls.   They’re going to hang you by ‘em, but Jesus they’re big. Lydia picks up her cell phone and walks out into the hall. REVEAL Mike standing in the stairwell, watching her go. INT. MOBILE COMMAND CENTER - CONTINUOUS 212   212  A tech calls out to Marcus. POLICE TECH #2 She’s off the ledge, sir! Marcus checks the screens. MARCUS Bauer, get ‘em set. INT. ROOSEVELT HOTEL - 21ST FLOOR CORRIDOR - CONTINUOUS 213   213  Lydia stands at the end of the hallway, on her cell phone. VOICE (V.O.) Internal Affairs. LYDIA Gordon, it’s Lydia.   I need your help.  Behind her, Mike walks into 2105.  INT. ROOM 2105 - CONTINUOUS 214   214  Dougherty looks up as Mike enters. DOUGHERTY What do you want, Cavanaugh? Mike grabs him, propelling him out the door and slamming it behind him. As SHOUTS of PROTEST rises from outside, Mike flips the dead- bolt and the security hasp, then braces a chair under the door handle. He calmly walks to the window, looking out at Nick.  89. MIKE Hey, partner.   You going to jump here or what? Nick glances over, uneasily. NICK We alone here, Mike? Mike smiles. MIKE T",
      "dialogue_count": 0,
      "word_count": 2341
    },
    {
      "scene_number": 23,
      "slugline": "INT. ROOSEVELT HOTEL - ROOM 3 - CONTINUOUS 244   244  Bursting into this room, Nick collides with WOMAN, spilling both of them to the ground as the shouts of pursuit rise. COMMANDO (O.S.) Get down! There’s no connecting door here and Nick breaks for the hallway... INT. ROOSEVELT HOTEL - 22ND FLOOR CORRIDOR - CONTINUOUS 245   245  ...which has two more commandos who open fire, rounds flying past Nick, shattering the room’s windows. INT. ROOSEVELT HOTEL - ROOM 3 - CONTINUOUS 246   246  Nick slams the door, cornered as   closes in from both directions.   He runs past the terrified woman, through the broken window and back out onto the ledge... ...disappearing from sight just as commandos burst in from both sides. Leaning out the open window, MP5 ready, the lead commando just catches a glimpse of Nick disappearing as he climbs up the corner of the building. LEAD COMMANDO He’s back outside! INT. ROOSEVELT HOTEL - STAIRWELL - DAY 247   247  Tactical pounds up the stairs... ...followed by Lydia shouting into her radio. LYDIA You have to call off tactical!  There is no bomb threat.  INTERCUT - INT. MOBILE COMMAND CENTER - CONTINUOUS 248   248  LYDIA (V.O.) Trust me on this, Bauer. Bauer watches a monitor where Nick claws his way up the side of the hotel.  100.",
      "characters": [],
      "action_text": "BAUER (into   radio) Confirmed, he’s still climbing.   I want coverage on every floor. (into police radio) This is nuts Anderson.   I have orders. LYDIA Then where’s Marcus?   Where’s the intel on the threat?   Where’s this supposed trigger? INT. ROOSEVELT HOTEL - SERVICE KITCHEN - DAY 249   249  Angie stands handcuffed to a stove in this now deserted kitchen as... CRACK!   Marcus pistol whips Joey, who’s cuffed to a pole, dropping him to his knees. MARCUS Where’s the diamond? ANGIE Leave him alone! Joey regains his feet, smiling through the blood. JOEY You hit like a girl.   Where are you from, Jersey? Marcus throws a brutal right to Joey’s gut, doubling him over, leaving him gasping for air. Without missing a beat, Marcus fires up a stove burner and grabs Angie by the hair. ANGIE AAAAGH! He forces Angie’s face towards the flames. MARCUS I’m from the Bronx. Joey wrenches at his cuffs. ANGIE No!   Please!  101. JOEY NO! Marcus looks at him.   He’s not fucking around. MARCUS Last chance, kid. EXT. ROOSEVELT HOTEL - CORNER CORNICE - DAY 250   250  Clinging to decorative masonry, Nick struggles, climbing up the corner of the building... ...as below him the CHEERS of the crowd drift up. Dragging himself up to the 24th floor ledge, Nick pauses for a second, looking out at the world: - The crowd below fills the street, gridlocking traffic. - The building across the street littered with homemade banners proclaiming their support.   “NICK CASSIDY” and “MAN ON A LEDGE.” - People on the opposite roof cheering for him. Nick continues his climb. EXT. 45TH STREET - CORNER - CONTINUOUS 251   251  Nick slips, people on the street GASPING... ...but Nick catches himself, and continues. ANGRY TRAFFIC MAN This guy is awesome! Elena Morales reports. ELENA MORALES ...and clearly the mood here has shifted.   Nick Cassidy may be an escaped convict, but today he has provided one of the most heart stopping shows the city has ever seen and the crowd here, well,   they love him...  EXT. HOTEL",
      "dialogue_count": 0,
      "word_count": 2742
    }
  ]
}