{
  "slug": "mandy-2018",
  "title": "mandy",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 8,
  "characters_count": 0,
  "characters": [],
  "total_words": 20552,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. FOREST ROAD - NIGHT 5   5  Beams of light cut through trees casting matchstick shadows as RED drives his battered 1978 BRONCO home through the wilderness. It’s a warm late summer night. WE DISSOLVE TO A WOMAN’S HAND puts FLAME to an evil looking hand carved PIPE and draws a hit. Her mouth exhales a shroud of tendrilous smoke... THE WOMAN’S HAND DRAWING -- Her pencil patiently works a detailed rendering of --  A ravaged electrical box by the side of a forest road. It’s hatch torn asunder. Inside - thick frayed wires. The image fills with color and comes alive as flickering Ralph Bakshi style CELL ANIMATION. The frayed wires hiss and ooze juicy sparks into the night. As the eyes of strange creatures watch from the shadows behind the tree-line. As the Bronco slides by we pan and dissolve back to LIVE ACTION.  Red rolls the radio dial. We hear a staticy voice. PRESIDENT REAGAN (on the radio) ...There's a great spiritual awakening in America, a renewal of the traditional values that have been the bedrock of America's goodness and greatness... He gives the dial a turn. Static hums. VOICES (on the radio) Here’s Cal Worthington and his dog spot. (singing) If you need a car or truck go see Cal.  4.",
      "characters": [],
      "action_text": "If you want your payments low, if you want to save some dough. Go see Cal. Go see Cal. Go see Ca - Red kills the deck as it hisses out with an electric click. He drives on - WE DISSOLVE TO THE WOMAN’S EYES GAZING DOWN AS SHE DRAWS --  CELL ANIMATION OF Headlights pulsing over a giant industrial engine block abandoned in a clearing. Overgrown and rusted in the moonlight it looms like an ANCIENT TEMPLE. Super Title: The Shadow Mountains, 1983 A.D.  EXT. FOREST ROAD / RED & MANDY’S HOME - NIGHT 6   6  Up ahead he can see his HOME in the forest. Glowing warm and yellow through the windows. As the Bronco pulls down the drive way we  WE DISSOLVE BACK TO LIVE ACTION Red pulls up out front, tires crunch softly on the gravel driveway. It’s a WOODEN HOUSE nestled amongst the trees at the end of a long, winding dirt road. The porch light is on. Moths flutter around it. RED gets out of the truck toting and grabs his duffel bag. Heads towards the house. INT. RED AND MANDY’S HOME - NIGHT 7   7  Red and Mandy built this house together over the course of a couple of years out of the ruins of an old cabin.  VOICES (cont'd)  5. It’s a cozy two story wooden structure with lots of windows and they love it. It’s theirs. One of her best works hangs framed above the couch. An incredibly detailed and beautiful drawing of a fantastical landscape dominated by a Hydra. Red comes in. Drops his gear on the floor. He looks into the living room and sees Mandy hunched over the kitchen table drawing. She’s wearing a big pair of headphones and her glasses. Lost in another world. A record spins silently on the stereo. RED MILLER Yo. I’m home. Mandy is startled she pulls of her headphones and spins around. Mandy. Small town girl to the core. Hard upbringing. She exudes a bruised charm. A long thin scar runs down her left cheekbone. She’s been through hell but her eyes are open and exude warmth and intelligence. We can tell right away she’s the kind of woman we’d want to hang out with. MANDY Red! You s",
      "dialogue_count": 0,
      "word_count": 633
    },
    {
      "scene_number": 2,
      "slugline": "INT. RED & MANDY’S HOME, BEDROOM - LATER THAT NIGHT 8   8  A warm, soft light flows in ILLUMINATING the scene. We are looking down at RED AND MANDY lying in bed naked under a knitted blanket. The light in the room is dim and warm. We slowly glide down towards them as they talk. Quietly, intimately and softly. Red lights a smoke with his Zippo passes it to Mandy. Lights another for himself. RED MILLER How was your day? MANDY Pretty good. I was reading that book about the galaxy. RED MILLER That big thick one? MANDY Yeah... it’s pretty awesome. RED MILLER What’s your favorite planet? MANDY Jupiter. No doubt. RED MILLER How come? MANDY The surface of its atmosphere is a storm that’s been raging for thousands of years... and the eye of that hurricane is so huge it could easily swallow up the whole Earth. I think that’s my favorite planet. RED MILLER Wild... MANDY What’s your favorite? Red thinks for a moment.  7.",
      "characters": [],
      "action_text": "RED MILLER Saturn probably. MANDY Yeah... I like Saturn. It was one of the first planets we humans discovered... so there’s lots of ancient myths about it. Red thinks for a moment. RED MILLER I changed my mind... MANDY What?! RED MILLER I like GALACTUS... cause he eats planets! She smiles. He kisses her. She snuggle closer in the warm dim light. EXT. RED AND MANDY’S HOME - NIGHT 9   9  Slowly we leave the warm little house tracking up INTO THE NIGHT SKY. It’s alive with STARS. Soft puffy clouds move by slowly . We pass by them into the blanket of stars. Lush with colors shifting as the galaxy seems to sigh. DISSOLVE TO: INT/EXT. BRONCO/FOREST ROAD - SUNNY DAY - CONTINUOUS 10   10  RED and MANDY speed down a forest road in the BRONCO. Red at the wheel. MANDY leans out the open window. She’s wearing a t-shirt, cutoff jeans and flip flops. She smiles softly, hair whipping in the wind. They zoom down the wide forest road towards the lake. The ROAR of wind and engine fills the soundtrack.  8. The sunlight passes through the trees on her face. DISSOLVE TO: OMITTED 11   11   *  EXT. LAKE - SUNNY DAY 12   12  A LITTLE LATER RED AND MANDY are on a ROW BOAT out on the lake. They relax, drying off in the warm sunlight. RED has his fishing pole rigged up and jutting over the side waiting for a catch. They look happy. Drifting. We zoom slowly out until we are at a Wide high angle. The little boat floats there with them in it, far away. MATCH DISSOLVE TO: EXT. LAKE SHORE - CAMPSITE - NIGHT 13   13  FLAMES. Red sits by the fire of their camp site by the lake, stoking it with a stick. He looks over. Just at the edges of the fire light Mandy is swimming in the dark glassy water.  9. Red goes back to tending the fire. Smoke dangling from his mouth. A moment passes. Red looks up again. Mandy’s Theme begins to shimmer on the soundtrack. Mandy is emerging from the lake. Her body glistening in the light of the fire. Her long hair falling about her bare shoulders. Here and now she looks l",
      "dialogue_count": 0,
      "word_count": 3305
    },
    {
      "scene_number": 3,
      "slugline": "INT. MOTEL ROOM - NIGHT 25   25  Sand and Marlene lie in bed in a dim seedy motel room. The door to the smoky adjoining room is ajar and we can see the rest of The Children hanging out in there watching TV and milling about.  24A.",
      "characters": [],
      "action_text": "Sand is moping into his pillow. Marlene puts her hand on his shoulder. MOTHER MARLENE What’s the matter Jeremiah? Are you alright? When Sand speaks - his voice is reedy and soft. SAND No. I’m not alright. MOTHER MARLENE But why? Did I do something wrong? SAND Wrong? Everything you do is wrong. The last time you did something right was so long ago I can’t even remember what you doing something right looks like. MOTHER MARLENE I’m so sorry Jeremiah. Is there anything I can do to make you feel better? SAND There is nothing that you can do. It’s her. I feel naked without her. Naked. Do you hear me? MOTHER MARLENE I... SAND I said... do you hear me? MOTHER MARLENE Yes, Jeremiah. I hear you. SAND (mimicking her) Yes, Jeremiah. I hear you. Mother Marlene winces. SAND (CONT’D) Really? Because sometimes I don’t think you hear anything at all. I’m truly worried about that.  25. MOTHER MARLENE Jeremiah... I... Sand sighs deeply. SAND Please just be quiet and go fetch me Brother Swan. MOTHER MARLENE Okay... I’ll -- Sand’s entire body tenses and constricts. Marlene pulls away instinctively. SAND I. Said. Go. Fetch. Me. Bruh-ther. Swannnn. Mother Marlene slides carefully off the bed and into the other room. A moment later Brother Swan comes in. He walks quietly over to the bed and kneels down close to Sand. Jeremiah’s eyes are closed. He opens them and sees Swan. His body relaxes. SAND (CONT’D) Ahhhh. There you are. Swan looks at Sand with total respect and admiration. SWAN What can I do for you Jeremiah? SAND I need you to get me that girl. I need her. I need her now. SWAN I will. SAND Do whatever it takes. Leave nothing to chance. I need this. SWAN Consider it done, Jeremiah.  26. SAND Bring me the Horn of Abraxas. Swan digs through a duffel bag and pulls out a gnarled wooden box. Inside swaddled in cloth is an OBJECT. Swan hands the object to Sand who gently parts cloth REVEALING an eleven inch HORN. Twisted Ceylon Ebony. Intricately carved. It feels cursed to the glance. Swan",
      "dialogue_count": 0,
      "word_count": 4853
    },
    {
      "scene_number": 4,
      "slugline": "INT. RED & MANDY’S HOME - HALLWAY - CRIMSON NIGHT 41   41  MANDY flees down the length of a hallway - she barely moves in place. The LOOPING GUITAR, stuck forever in this moment. The CHILDREN looming towards her. EXT. HOUSE BACKYARD - CHAINLINK FENCE - NIGHT 42   42  RED STRAINS WITH ALL HIS MIGHT - The chainlinks FLEX but do not break. His muscles push to a point where it seems like they might tear themselves apart. INT. RED & MANDY’S HOME - HALLWAY - CRIMSON NIGHT 43   43  Mandy moves down the corridor which becomes narrower and narrower bottle necking into one door. Her own home an unfamiliar nightmare maze. She opens the door. A black void beyond. She fumbles for a light switch. Finds it but the bulb is dead. She steps cautiously into the dark. Finds a step. But it bends under her.  We snap back into 24 FPS as - She slips and slides brutally down the flight of stairs into the dark concrete basement. She lands hard. Her ankle and wrist twisted. She manages to get up, moving on a wounded leg. Behind her We hear the stylus get loudly torn off the record. Shouting. Overlapping voices. Turning back she sees shadows at the top of the stairs. They cannot see her yet. Mandy moves into the dark.  48.",
      "characters": [],
      "action_text": "SWAN (off screen) Yooooooooooo Hoooooooooooooo.... Mandy moves as quickly as she can deeper into the small seemingly labyrinthine chambers of the basement, trying to control her breathing. The space is a nightmare cluster of pipes, insulation and strange discarded objects. She hears the creaking wood as their feet descend the stairs. Faintly, in the corner of a small storage room, she sees a FREEZER BOX. A strange WHEEZING RATTLING coming from inside. A FLASHLIGHT flares on and the ghoulish face of MOTHER MARLENE probes the darkness, other figures behind her. Mandy opens the lid. Luckily the lamp is burned out. In the faint light she can barely see clumps of rounded old ice. Bags of frozen vegetables. Vacuum sealed meats. She slowly climbs in, trying not to make a sound. Silently closes the lid. She hears her own BREATHING. Tries to subdue it. Within the freezer, sounds outside are vague rumbles, echoes. SWAN (off screen) Maaaaaannnnnddyyyyyyy..... Slowly the lid creaks as it begins to OPEN. Light SPILLS in. Here she is now, at the bottom of the world, frozen, bathed in harsh white light, on a bed of packaged peas and carrots and tater tots. She SHIVERS. Billowing foggy condensation rises like mist around her. Huddled and shaking, eyes wild with horror and desolation. They look down upon her. Mandy begins to scream with pure ravenous terror.  49.",
      "dialogue_count": 0,
      "word_count": 454
    },
    {
      "scene_number": 5,
      "slugline": "EXT. RED AND MANDY’S HOME, BACKYARD - NIGHT 44   44  RED hears Mandy. His eyes flood with helpless rage. He tries again to free himself. With nothing left. But the more he strains against his bonds the deeper they dig into his flesh. Then, the screaming stops. Red listens for a sound. Hope draining from his eyes. SLOW FADE OUT. INT. RED AND MANDY’S HOME, BATHROOM - NIGHT 45   45  Sand is alone in the bathroom. Sitting on the closed toilet lid. He’s shaken and this disturbs him deeply. Sand gets up. He runs some water and splashes it on his face. He looks up into his own reflection. SAND Tell me what to do. He stares deeply into his own eyes. SAND Tell me... what to do. Tell me what to do. Tell me what to do. Tell me what to do. Tell me what to do. Tell me what to do. Tell me what to do. Tell me what to do... He keeps going until gradually the fear and uncertainty in his eyes transforms into a dead eyed stare. SAND You fucking whore. You’re finished. Whore. He smiles a sickly smile, delighted at having found his answer. EXT. RED AND MANDY’S HOME, YARD - NIGHT 46   46  Red looks up as -  50.",
      "characters": [],
      "action_text": "Sand and Swan come out of the house and stride towards him purposefully. Sister Lucy following behind. SAND   *  You and that ugly little whore think you’re so in love. I’ll show you love. Lucy. The crazed girl approaches. Sand brushes her chin gently. He leans in and whispers in her ear.  51. She nods and smiles. Swan pulls a pearl handled .38 pistol from his waistband and dumps all but one of the bullets in the cylinder out. Snaps it shut. Hands it to Lucy. SAND Kneel. She kneels in front of Red, level with him. SAND (CONT’D) Show him how much you love me, Lucy. Smiling, she puts the gun to her temple. Sand leans in and whispers in her ear. Lucy smiles looking deeply into Red’s eyes. CLICK. The gun dry fires. No bullet. Red flinches. Lucy’s eyes gleam. Tears pour down her face as she laughs joyfully. Swan snatches the gun from her, a little disappointed. Red looks at Sand with pure hatred. Sand notes his reaction. SAND Another pearl wasted before swine. Sand shakes his head. Sand puts out his hand expectantly and Swan hands him a   *  creepy   looking DAGGER   *  SWAN   *  Take a good look numbskull...   *  That’s The Tainted Blade of the   *  Pale Night. Straight from The   *  Abyssal Layer.   *  SAND You poor stupid pigs. Born without souls. Sand leans over and cups Red’s face in his hands and squeezes the skin tight in frustration and rage.  52. SAND Condemning you to hell will at least make you eternal. You really should thank me. Sand whispers in Red’s ear.  52A. SAND You know what Jesus’ big mistake was? He didn’t offer up a sacrifice in his stead. Sand SUDDENLY without ceremony slides the DAGGER deep between   *  Red’s ribs. Withdraws the blade just as quickly. Red groans through his gag as a stream of blood pours from the wound. Sand recoils, hands the dagger to Swan in exchange for a cloth. He wipes his hands. SAND We wasted The Chemists finest on your whore. But I think you both shall see the cleansing power of fire cannot be reasoned with. Bring the slu",
      "dialogue_count": 0,
      "word_count": 1768
    },
    {
      "scene_number": 6,
      "slugline": "INT. RED AND MANDY’S HOME, BEDROOM - NIGHT 53   53  RED comes in and lies on the bed. Trying to pretend nothing happened. He closes his eyes. EXT. FIELD - DUSK 54   54  ROTOSCOPED ANIMATION.   *  MANDY.   *  Her back to us, is standing in a beautiful field of tall   *  grass bathed in the light of the setting sun.   *  The sky is burning with orange and purple.   *  Her hair moves in a gentle breeze, the last rays of the sun   *  shining through it.   *  CLOSER   *  MANDY starts to turn around to face. We want to see her face   *  one last time.   *  She turns backlit by the setting sun.   *  But as our eyes adjust to the light we see   *  That her face is sunken and deteriorated. Dead. Rotting.   *  Her eye sockets are sunken and empty.   *  SLAM CUT TO: INT. RED AND MANDY’S HOUSE, BEDROOM/BATHROOM - NIGHT 55   55  Red’s eyes open. Reality comes flooding back -- Hyperventilating Red clambers into the bathroom. For a moment in the dark he struggles to breathe. He flips on the switch burning the whole room white with light.  59.",
      "characters": [],
      "action_text": "He opens the sink cabinet and digs frantically. Finds a loose board. Flips it open.  59A. Digs in. Pulls out a hidden bottle of Vodka. Hands shaking he twists off the cap. Tears pouring down his face he chugs. Coughs. Burns. His breathing slows. He pounds almost the whole bottle. Calmer now. He looks down at his hands freshly viscous blood pouring from his ravaged hands into the swirling water below. Calmer. Trancelike he pours the rest of the vodka over his head. He looks at his bloody hands. Then over into his own twisted reflection. FADE OUT. BLACK SCREEN. 56   56  A BLACK METAL DIRGE BEGINS TO THROB AND PULSE ON THE SOUNDTRACK. In the darkness FRESH BLOOD begins to FLOW. Its tendrils reaching out through the darkness like the roots of a tree. Gradually they form the TITLE CARD: MANDY The tendrils probe and grow making the word become abstract like a LIVING BLACK METAL LOGO made of blood. INT. WORK SHED 57   57  The DIRGE continues as WHITE HOT SPARKS rain through the dusty air. OUTSIDE the sky is acid white as the sun rises gazing on the landscape like the unblinking eye of an unforgiving god. But time has no meaning here.  60. Hands and torso BANDAGED, RED is GRINDING METAL on a bench grinder. It’s a well stocked work shed with BLACKSMITH TOOLS: small furnace, anvil, trough and vise. There’s also machinist hardware and some motorcycle & car stuff. RED makes his own shit. He stops and lowers a WELDER’S SHIELD MASK. He puts the COLD BLUE LIGHT of an arc welder to CALTROPS   *  (tire spikes).   *  He grinds the points to a gleaming shine.   *  THE FURNACE IS READY, glowing like a noon day in Hell.   *  RED pours MOLTEN METAL into SMITHING MOLD.   *  His bandaged hands shake a little with the effort but he   *  makes do. Rivulets of metal track along the mold like contained lava.   *  Bursting into flame.   *  FIRE is reflected like a vision of hell in his eyes. He HAMMERS red hot steel with a large SMITHING HAMMER.   *  With each blow glowing embers fly.   *  He d",
      "dialogue_count": 0,
      "word_count": 4711
    },
    {
      "scene_number": 7,
      "slugline": "EXT. RANCH HOUSE - NIGHT 70   70  Red exits out the back door of the kitchen and climbs up the wall onto the roof. The night is pitch black, the only light coming from the nearby bonfire. The forest surrounding the grounds is black and wet. He creeps along the rooftop until he finds a good vantage point looking down upon SKRATCH, who stands dark and monolithic before the fire. A spectre of the unsane. ANGLE on SKRATCH: We can hear a strange pulsing drone echoing inside the metal chamber of his helmet. He is deep in a dark trance. Worshipping the flame. Red wraps a rag around the head of the only remaining arrow. Soaks it in lighter fluid. Cracks his neck. NEEDLE DROP --   *  He ignites it with his zippo -- and as he does we flow into - ULTRA SLOW MOTION.   *  He mounts the SECOND bolt on The Reaper.   *  He raises his weapon and carefully takes aim. His eyes gleaming in the light of the fire. He pulls the trigger and - The bolt slides steady and true through the hot night air. Until - The bolt PIERCES through the back of SKRATCH’S NECK and out through his larynx lodging there. The flames spread onto his body igniting his right arm and back. Red lowers The Reaper as he watches. SKRATCH twitches. Red’s eyes widen as  81.",
      "characters": [],
      "action_text": "Strangely SKRATCH does not turn around. He stands entranced. Eerily Still. He reaches up with his right hand and pulls the bolt forward out through his neck. He drops it into the scalding dust. Red can’t believe his eyes. He FEARS this THING. Whatever it is. He throws the reaper aside. He jumps off the roof - Unsheathing The Beast in mid air. He hits the ground running kicking up clouds of dust. SKRATCH slowly draws a brutal looking twelve inch HUNTING KNIFE from his belt. The flames spread from his arm onto THE BLADE. Red continues toward him - Eyes never leaving the blind demon. Now he is upon him. Red swings the blade - but SKRATCH back hands him across the head sending him sprawling into the dirt. Shell-shocked - Red scrambles to get to his feet. SKRATCH’s head twitches. He looks towards the house. UNNATURALLY he SEES through a NARROW CRACK in the curtains of the front room. He sees SIS lying there dead. His mouth opens unnaturally wide in a monstrous silent cry. Red sees his chance he scrambles forward and without thinking, without hesitating - Body checks The Skull with as much speed and force as he can muster using The Beast as a BATTERING RAM. SKRATCH STUMBLES BACKWARDS. Red upper cuts him with The Beast and quickly hits him again with a kick to the chest. This sends Red reeling backwards into the dirt and SKRATCH - PLUNGING INTO THE RAGING FIRE.  82. He is completely and instantly ENGULFED by the RAGING INFERNO. Red clambers to get his bearings - rolling onto his side. A beat as he catches his breath and then - A blood chilling SHRIEK emanates from within the pyre. He looks up to see - SKRATCH Slowly crawling out of the fire on all fours like an animal. Completely consumed by flame. Even as his body is withered away by the flames he keeps crawling forward towards Red. A twitching living carcass. His movements strange. Red gets to his feet and limps to him. He raises The Beast and brings it down clean. Taking off SKRATCH’s head. Instant silence. His flaming ",
      "dialogue_count": 0,
      "word_count": 707
    },
    {
      "scene_number": 8,
      "slugline": "EXT. FOREST ROAD - NIGHT 72   72  The blackness is cut away by headlights in the fog. RED speeds through the darkest of nights on the QUAD. He winds along an uphill road and a valley of darkness lies below. Flashes of low atmosphere NIGHT LIGHTNING STROBE - He has entered a darker, more primeval forest. The trees are no longer green only glimpsed as full grey and black. GOD’S EYE VIEW as RED winds through the strange landscape. DISSOLVE TO: EXT. STRANGE TERRAIN, THE CHEMIST’S PLACE - NIGHT 73   73  Red turns off his headlights and kills the engine in STRANGE TERRAIN. ROLLS TO A STOP. We PAN OVER to reveal THE RUSTY DECAYING RADIO TOWER HE SAW IN HIS VISION. He dismounts and moves towards the small, low one story cinder block building in the distance on foot. He clutches the HUNTING KNIFE. There is a metal garage door open a few feet. Some light from inside, and... a 70s novelty song emanating softly from   *  inside. He kneels down and peers under the door.   *  Then ducks under.   *  INT. THE CHEMIST’S PLACE - NIGHT 74   74  RED rises and looks around. A large empty work space. At the far end of the room stands a wiry man wearing nothing but a black vinyl apron. Slicked back hair. THE CHEMIST  84.",
      "characters": [],
      "action_text": "Florescent tubes cast a pall over the table where he stands before his unusual lab setup. He is dipping a large uncut sheet of card stock, bare handed, in a chemical tray filled with murky grey SLIME. There are stacks of uncut sheets of Lysergic acid diethylamide on another table. Some hang from clothes pins on wires. Sealed Jars with murky dark fluid on some shelves. Aquariums with strange insects. To the right of the room is a VETERINARY CAGE with a MANDRILL in it. It appears very calm. Red enters the room. His boots scraping on the linoleum floor. The Chemist keeps working. THE MANDRILL looks over at Red serenely. RED watches as the CHEMIST’S HAND moves slowly out of the tray and across the counter. His hand slides across the surface onto A LUGER with a lightning bolt inset in the handle. RED grips the handle of his KNIFE and we hear the leather creaking. THE CHEMIST registers this. His hand slides off THE LUGER. Slowly the CHEMIST reaches over and presses the stop button on a TAPE DECK. It clicks and echoes through the room loudly as the music stops. THE CHEMIST It’s cool man... It’s cool.... Slowly THE CHEMIST turns around to face RED. He has a gaunt, pale face. Sunken eyes. We see now that his pupils are EXTREMELY DILATED. His eyes like black holes into the infinite abyss of the universe. He studies RED who looks like some primal beast barfed from the lungs of hell itself. Cut. Bruised. Caked in dry blood.  85. THE CHEMIST A Jovian warrior brought forth from the eye of the storm. He LICKS the Lysergic acid diethylamide from his dripping wet, bony fingers. THE CHEMIST This is my masterpiece... I call it... Blue Unicorn... stripped away now is the ragged bleeding flesh of this dimension. RED stands staring, saying nothing. The CHEMIST gazes at RED, his eyes filling with emotion. THE CHEMIST You... move... me... RED glances over at the MANDRILL. THE CHEMIST That’s Lizzie... If she’s calm... I know it’s good... RED looks back at the CHEMIST. Something comes over T",
      "dialogue_count": 0,
      "word_count": 4121
    }
  ]
}