{
  "slug": "maniac-101-the-chosen-one-2018",
  "title": "maniac 101 the chosen one",
  "genre": "horror",
  "format": "series",
  "scenes_count": 3,
  "characters_count": 0,
  "characters": [],
  "total_words": 8082,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. A CONFERENCE ROOM -- NEW YORK -- DAY  We begin on a face. A nice, human face. A young man, early 30s, clean-shaven, simply-dressed, a little nervous.   He’s framed like a portrait.   Behind him, a glass window, and through it-- Manhattan, 50 stories below. We hear SHUFFLING and a DOOR CLOSING.   Then a voice-- FIRST VOICE Okay, Owen.   Let’s get started. Our human face nods.   This guy we’re staring at is   OWEN MILGRAM , 32, Data Entry Temp, Lonely Soul, Future Hero. Right now he’s stuck in a roomful of lawyers. OWEN Okay. FIRST VOICE The name of the witness is Owen Milgrim, the location of this deposition is the, uh, fifty-second floor of the Watson Building at 217 6th Avenue.   Today’s date is November 12th, 2022. Throughout this, Owen fidgets, looks around the room... FIRST VOICE (CONT’D) Good afternoon, Mr. Milgrim. OWEN Hi. FIRST VOICE Mr. Milgram, can you tell us about the psychotic break you experienced on the night of May 14th, 2013? Owen stares at the asker.   For some time.   Finally-- OWEN Really ?  FIRST VOICE I’m just asking the--",
      "characters": [],
      "action_text": "OWEN Is that how they’re gonna start? (turns to another head) Dad.   Come on.   They don’t even-- SECOND VOICE (quite nasal) We’re actually inside the roleplay now, so you can’t... Owen’s eyes burn holes in whoever just said that.   Eventually he turns to a new head.   His dad’s.   And now a new voice-- calm and collected-- responds: THIRD VOICE (DAD) It doesn’t mean it’ll necessarily happen at the deposition, Owen. This is why we prep. (then) The unexpected. Owen stares for a moment longer.   The unexpected.   Sure. OWEN Okay... (to another head) On that night, May 14th, which was near the end of college for me, during a... super-stressful and difficult time in my life, I... (shrugs) ... I had a delusional episode. After it happened, I was hospitalized, and medicated, and... (shrugs) ... and that was the last delusional episode I ever had. FIRST VOICE What was the nature of the episode? Owen blinks.   And then--  A FLASH -- INT. A ROCKET SHIP -- 3030  Owen SCREAMS a silent M.O.S. scream as a rocket he’s piloting accelerates to 9 Gs, shaking him as he and his 80-ton vehicle exit Earth’s atmosphere. Something’s wrong, though. Somewhere, an alarm flashing.   Yellow lights.   He struggles to UNLATCH himself from his seat, tugging and pulling on the STRAPS and BUCKLES holding him in...  2. A FLASH -- INT. AN AMBULANCE -- 2009  ...and now, inexplicably, one reality bleeding into the other, and Owen’s on a gurney, struggling against RESTRAINTS as a number of PARAMEDICS hold him down as they load him up into an ambulance.   Owen SCREAMS, all still M.O.S., and as the doors of the ambulance close we’re--  INT. A CONFERENCE ROOM -- CONTINUOUS  --BACK, just like that, looking at Owen as he remembers... OWEN I don’t remember. Owen sips his water.   Smiles at someone. FIRST VOICE And you were diagnosed with schizophrenia at that time, correct? (then) After your hospitalization? Pause.   Less anger from Owen now. OWEN During. More shuffles. FIRST VOICE And are you still on any an",
      "dialogue_count": 0,
      "word_count": 2312
    },
    {
      "scene_number": 2,
      "slugline": "INT. A HALLWAY -- OWEN’S APARTMENT COMPLEX -- NIGHT  Evening.   Cramped NYC hallway, Owen trudges up the stairs to the fourth floor.  INT. OWEN’S MICROAPARTMENT -- LATER  Here it is.   The apartment that costs   87 per-fucking-cent of Owen’s annual income.   It’s 200 square feet.   Microapartment. It’s the size of a closet.   His own little ward room. Owen sits on his twin bed, his sole piece of furniture, reading a book and eating broccoli.   At peace.   Home.   His sanctuary, no mater how small it is.  INT. OWEN’S MICROAPARTMENT -- DAWN  LATER.   Owen’s fast asleep on his bed when we hear three loud  KNOCK KNOCK KNOCKs .   His eyes pop open.  KNOCK KNOCK KNOCK!  Owen gets out of “bed,” grabs his robe, shuffles toward the door.   KNOCK KNOCK KNOCK!  OWEN I’m coming!   I’m coming, Jesus. Finally, Owen gets there, pulls the door open.   Before him stands a snappily-clad, exceptionally-put-together   CHARLA BROOKS , Professional Pharma Recruiter. CHARLA Owen Milgrim? OWEN Yeah. CHARLA I’m here to change your life. Owen looks at her, then closes the door. CHARLA (CONT’D) (through the door) Mr. Milgrim.   My name is Charla Brooks.   I represent Neberdine Clinical Labs.   I believe you sent us an application. 12.",
      "characters": [],
      "action_text": "OWEN (through the door) The thing I filled out last night? CHARLA (through the door) I’m here to register you for a study.   Something...   very   exciting has come up. Owen opens the door. OWEN Lady.   It’s dawn. CHARLA You were unreachable.   Digitally. Owen stares for another beat.   Eventually, he steps aside. CHARLA steps in.   She struggles to find anywhere to set up, as the only furniture is Owen’s bed. Near the sink, she moves aside his RUBIK’S CUBE, opens up her briefcase on the kitchen counter, lays out papers.   In a half- daze, quarters cramped, Owen watches. Charla is all business, arranging and organizing everything. She talks rapidly as she does so-- CHARLA (CONT’D) I’m sorry about the furlough.   The timing is difficult for you, yes? If I’m not mistaken, you refuse to take money from your family?   On principle?   Is that true? OWEN How the-- how do you know about the furlough?   I didn’t-- Charla turns to Owen, holding a TABLET to her chest. CHARLA  Now .   What’s crucial for us with regards to this study is that you are not, in fact, on any antipsychotic medications at this time.   Quite   crucial. (then) I know you said so in your application, but I need you to say it out loud.   Here. (then)  (MORE) 13. Go ahead, Owen.   It feels good to tell the truth. She holds her tablet toward Owen’s face.   QUITE   close to his face.   Owen just stares.   This is... super-weird. OWEN I don’t really-- CHARLA According to our research, despite regularly refilling your medications and maintaining to your relatives that you   are   medicated, you stopped taking all anti- psychotic medications in... August of 2019. (off look) Just over two years ago. Owen’s still staring. OWEN How do you know the... date? Charla just waits. OWEN (CONT’D) Are you-- are you a P.I. or something?   Oh God. (realizing) Are you from the   trial ?   Fuck me. Fuck.   Are you, like, one of their lawyers, trying to get me to admit that I-- CHARLA Sir, I’m a recruiter for Neberdine Clinical",
      "dialogue_count": 0,
      "word_count": 3252
    },
    {
      "scene_number": 3,
      "slugline": "EXT. NEBERDINE LABS BUILDING -- QUEENS -- DAY  TIGHT ON the wheels of a ROLLING SUITCASE as it gets dragged up the last steps of a subway exit.   The wheels continue to roll along the sidewalk until we PULL BACK and find--  OWEN .   He stands looking at a nondescript fortress of a building somewhere on Steinway.   NEIBERDINE LABS   -- we see the Triquera on the door.   Queens life all around him.   He holds the handle of the small rolly suitcase at his side. He’s across the street from the building, and he stands looking at it for a beat. He’s about to cross when he glances to his right and sees something... weird.   A couple of DUMPSTERS.   Behind them, a  GINGER-HAIRED   WOMAN . Dressed in a white lab coat, smoking a cigarette, holding a phone (as compact) up with one hand as she tries to arrange her hair in a TIGHT BUN with the other.   There is a STRAND of  SILVER-PINK   hair in her bangs. Owen squints, watching her, because there’s something... familiar... She turns, looks at him, skeeved by his stare. GINGER-HAIRED WOMAN What? OWEN Sorry, I... I thought I recognized you... (beat) From somewhere. GINGER-HAIRED WOMAN You don’t. Owen keeps staring. OWEN Excuse me.   Sorry. (a step) Do you-- do you do ads?   For, uh, golf vacations? She looks again. OWEN (CONT’D) On the subway. 29.",
      "characters": [],
      "action_text": "GINGER-HAIRED WOMAN No.   Go away. (then) I have a gun. She drops her cigarette and goes back to her hair.   Glances, sees Owen is still there. GINGER-HAIRED WOMAN (CONT’D) I’ll kill you. Owen chuckles.   She keeps looking.   Ha ha ha.   Death threat. OWEN Oh.   Cool.   Sorry. He looks for one last beat, then turns, heads across the street to Neberdine Labs.  INT. NEBERDINE LABS -- THE WAITING ROOM -- LATER  Owen sits at a chair in the waiting room, filling out a form on a clipboard.   Seven or eight others are in here doing the same; all of them have bags or suitcases, too. At the desk, a   RECEPTIONIST   behind the counter and glass wall deals with another patient.   To the right of her is a large glass door with a DIGITAL SECURITY LOCK. The entrance to the inner chambers of Neiberdine Labs. Owen scratches at the form, then looks around the room. Assessing the other participants.   [ Note: we’ll meet many and flesh out many in Episode 103. ]   In the corner, sleeping on three chairs, there appears to be a   HOMELESS MAN .   A few seats down there is a woman with Ally Sheedy levels of   CRAZY HAIR , much of it covering her face.   Next to Owen, a   VERY HANDSOME MAN   with his legs crossed. The main doors to the street pop open, and Owen glances. He watches as the Ginger-Haired Woman strides in, heads directly for the SECURED DOOR, and swipes a SECURITY CARD in front of the lock.   Nothing happens. She tries it again. Nothing happens again. No one else has really noticed this, but Owen continues to watch, intrigued. 30. She tries a third time.   It fails again, and she turns and strides out of the room as thought nothing at all happened. After she goes, Owen turns to a VERY HANDSOME MAN   beside him. OWEN Hey.   Hi. The Very Handsome Man glances. OWEN (CONT’D) Did you just see a woman-- like a sciencey lady-- walk in here and, uh... Owen trails off as those main doors open up again.   This time a GROUP OF SCIENTISTS, all of them in white lab coats, walk in together",
      "dialogue_count": 0,
      "word_count": 2518
    }
  ]
}