{
  "slug": "mass-2021",
  "title": "mass",
  "genre": "drama",
  "format": "film",
  "scenes_count": 4,
  "characters_count": 0,
  "characters": [],
  "total_words": 16940,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. SUBURBAN NEIGHBORHOOD - DAWN 1   1 It’s dawn somewhere in America.   The first hint of sunrise glows on the horizon, barely illuminating the otherwise dark suburban street. Red taillights appear as a garage door opens a few houses   * down the road.   An SUV pulls out onto the street. EXT. SHOPPING DISTRICT - DAWN 2   2 The roads are still empty as the sky turns a lighter shade of violet.   The SUV passes local malls and businesses, making its way to the interstate. EXT. INTERSTATE - DOWNTOWN - SUNRISE 3   3 Office lights flicker in the distance as the SUV makes its way out of the city.   Sunlight breaks over the horizon, reflecting off buildings’ glass facades. EXT. INTERSTATE - COUNTRY - MORNING 4   4 Later, the sun casts an even heat over farmlands.   The SUV speeds through the country on a journey that seems to take several hours. Eventually, the flat farmlands give way to foothills. Miles ahead, the hills compound themselves into massive mountains.   The SUV disappears into the rising landscape. CUT TO BLACK: EXT. EMMANUEL EPISCOPAL CHURCH - MORNING 5   5 The modest red brick Gothic revival church sits on the corner of a small town street.   Behind it, built much later, are the church offices and meeting halls. A piano plays inside the church.   It’s a familiar melody, just unsure of itself.   “ Hey diddle diddle, the cat and the fiddle, the cow jumped over the moon... ” An old beat up Subaru parks out front.   JUDY (30’s, nervous but well meaning) exits her car, grabs groceries from the back seat and hurries toward the church.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 272
    },
    {
      "scene_number": 2,
      "slugline": "INT. EMMANUEL EPISCOPAL CHURCH - NAVE - MORNING 6   6 A YOUNG STUDENT struggles to read sheet music as his PIANO TEACHER guides him through the notes.   They play at an upright piano at the foot of the altar. Judy enters at the other end of the nave.   She waves to the teacher as she takes a seat in the back pew dropping her groceries down beside her. After praying, she makes a quick sign of the cross. Collecting her things, she waves goodbye to the teacher and makes her way down a set of stairs and into... INT. EMMANUEL EPISCOPAL CHURCH - BASEMENT - MORNING 7   7 The church basement.   It’s a large but cluttered space. The walls are covered with community flyers and religious plaques. In an open kitchen, ANTHONY (a peculiar young man in his late teens) does dishes. JUDY I’m late. (no response) I know... Judy drops her things on a table as she rushes across the room and up a small flight of stairs into... INT. EMMANUEL EPISCOPAL CHURCH - OFFICES - MORNING 7A   7A The church offices.   She checks the phone for messages and turns on a desktop computer. JUDY (CONT’D) (calling to Anthony) Has anyone called? ANTHONY (calling back) No. JUDY Kendra? ANTHONY No.   No one. (CONTINUED) 2.",
      "characters": [],
      "action_text": "JUDY Okay, good. Judy crosses back to the basement. INT. EMMANUEL EPISCOPAL CHURCH - BASEMENT - MORNING 7B   7B Stopping on the stairs, Judy takes a deep breath. JUDY My son had a game this morning but he wanted me to wait till his dad got there, then I got stuck in traffic on the way back...   Or some accident... ANTHONY You got in an accident? JUDY No I got... stuck in the traffic of an accident. (noticing the dishes) What are you doing? ANTHONY Dishes. JUDY Okay.   Will you help me set up? ANTHONY What do we need to set up? JUDY The room for the meeting. (then) Why are you doing dishes? ANTHONY No one cleaned up from this morning. JUDY Oh, I’m sorry... ANTHONY We got to tell them to clean up after themselves... JUDY We did.   Was this AA? CONTINUED: 7A   7A (CONTINUED) 3. ANTHONY No Al-Anon.   AA clean up after themselves. JUDY Just leave it for now, okay?   I want it all set up when Kendra gets here. He stops and dries his hands.   He leaves the kitchen and makes his way across the basement, brushing past Judy on his way up the stairs. JUDY Thank you... INT. EMMANUEL EPISCOPAL CHURCH - PARISH HALL - MORNING 8   8 It’s a light filled room with an assortment of furniture including a wooden table and chairs placed against a wall featuring the artwork of Sunday School students. Judy and Anthony enter, turn on the overhead lights, and survey the room. JUDY Here... let’s pull the table out. They lift the table and waddle it to the center of the room.   Anthony waits for Judy. JUDY (CONT’D) Thinking.   It’s so... exposed. ANTHONY Table cloth? JUDY Definitely not.   It shouldn’t be so formal. ANTHONY This looks pretty informal to me. JUDY Let’s grab some chairs.   I don’t want it to look so prepared for them, you know? She goes to grab two chairs.   He follows. CONTINUED: 7B   7B (CONTINUED) 4. ANTHONY Then why are we preparing it for them? JUDY Because they asked for the space. It’s part of our service. (remembering) “Unobserved!”   That’s what Kendra said.   “Unobserv",
      "dialogue_count": 0,
      "word_count": 2280
    },
    {
      "scene_number": 3,
      "slugline": "EXT. EMMANUEL EPISCOPAL CHURCH - STREET 15   15 Kendra exits from the office onto the street.   Up the road, the SUV drives away.   Kendra makes a phone call as she heads towards her car. KENDRA Hi Linda... No problem, I’m here. Take your time.... You spoke with the reverend?   Good.   I know she’s   * sorry to miss you...   Well, I’ve   * met the others filling in, yeah. They’re fine.   You don’t have to meet them if you don’t want... We’ll figure it out. Kendra opens the car door and grabs her briefcase. KENDRA How are you feeling?   It’s okay to be nervous.   You’re showing up. How’s Richard?   Okay.   And he’s staying with you?   I think that’s   * nice, Linda.   I do.   Alright.   And you’re walking over now?   Okay. Well, it’ll be good to see you two...   Yeah.   See you soon. She hangs up, takes a deep breath, and looks around at the mountains surrounding her. OMIT 16   16 * INT. THE PERRY'S SUV - MORNING 17   17 The SUV is parked at a dirt turn out by a wooden fence   * that borders a meadow and mountains.   * GAIL Where the hell are we...? Across the road, Jay notices a part of the fence is broken.   Yellow tape tries to pieces together what’s missing, as if some accident happened there. He turns back to Gail. JAY How you doing? (CONTINUED) Rev. mm/dd/yy (Blue)   16.",
      "characters": [],
      "action_text": "Gail avoids eye contact.   She doesn’t look well. JAY (CONT’D) Honey... Gail shakes her head. GAIL I don’t know... JAY Okay... GAIL No.   I don’t think I can...   I don’t think I can do it. JAY (pause, considering) Well.   We don’t have to, I guess.   * We can go.   We can leave right now if you want. GAIL No, I mean... I don’t think I can say it. JAY (understanding) Oh, okay... (beat) You don’t have to.   We can hear   * what they say, right?   But you don’t have to do it. Gail nods weakly, struggling.   Jay looks back across the road, something about the landscape haunts him. GAIL If I don’t...? (turning to him) Would you? She looks at him now, expectantly.   Jay is torn. GAIL (CONT’D) I’m sorry.   That’s not fair. JAY It’s okay.   I don’t...   No, I   * wouldn’t. (beat, an option) But we can. CONTINUED: 17   17 (CONTINUED) Rev. mm/dd/yy (Blue)   17. He shrugs, almost sweetly, trying to make the best of this. JAY (softly) Are you ready to go back? Like it’s the hardest question she’s ever been asked. GAIL Okay... EXT. SECLUDED STREET - THE PERRY'S SUV - MORNING 18   18 The SUV pulls away.   The yellow tape blows in the wind. EXT. EMMANUEL EPISCOPAL CHURCH - MORNING 19   19 The piano music has stopped.   Kendra is back inside.   The church and street appear to wait in anticipatory silence. INT. EMMANUEL EPISCOPAL CHURCH - PARISH HALL - MORNING 20   20 The room is empty but prepared, water bottles and tissue placed.   The coffee finishes brewing with a soft alarm. INT. EMMANUEL EPISCOPAL CHURCH - OFFICES - MORNING 21   21 Kendra works in Charlotte’s office on her computer. Anthony folds leaflets for Sunday Mass. Judy enters from the parish hall having tidied up last minute things.   As she enters the office she notices the SUV pulling up outside the church. JUDY Oh dear... EXT. EMMANUEL EPISCOPAL CHURCH - FRONT ENTRANCE - MORNING 22   22 Jay and Gail exit their car.   They wait for one another and then slowly make their way to the office door. Gail stops to take in ",
      "dialogue_count": 0,
      "word_count": 12851
    },
    {
      "scene_number": 4,
      "slugline": "INT. EMMANUEL EPISCOPAL CHURCH - OFFICES - MORNING 29   29 Moments later...   Everyone is looking for a way to   * protect the flowers.   Linda and Richard stand by the front door.   Gail and Jay stay further inside allowing the others space to look. JUDY Let me see what we have... RICHARD Whatever you can find. JUDY Yeah, no, so you can put them on the floor and not worry about it, I get... KENDRA But nothing too big, right? JUDY And we have more stuff downstairs. GAIL Are you sure...? KENDRA You have newspaper? JAY Yeah, please don’t trouble yourselves... LINDA I’m sorry, I should have thought of that... RICHARD It’s fine, they’ll find something. ANTHONY What about bubble wrap? JUDY I don’t think we have bubble wrap. ANTHONY Yeah we do... KENDRA Something to stuff it right? (CONTINUED) Rev. mm/dd/yy (Pink)   94.",
      "characters": [],
      "action_text": "JAY Is this too much trouble? JUDY How is this?   It’s too big isn’t? ANTHONY They brought the new hymnal books in a box... JUDY Oh yeah, good idea, go check... KENDRA Thank you, guys. RICHARD Yes, thank you. JUDY Of course, and let me see what else is down here.   One second... Anthony and Judy leave. LINDA Well... JAY (gesturing off) Should we wait for...? Linda looks at Richard.   He cannot stay with this. RICHARD If you don’t mind... I should go... JAY Oh, no go ahead... RICHARD Linda, I have to get back... LINDA Okay... He searches for words. RICHARD I can walk back without you... CONTINUED: 29   29 (CONTINUED) Rev. mm/dd/yy (Pink)   95. LINDA No, Richard... RICHARD If you want to...   Okay. LINDA I can come with you. RICHARD Alright. LINDA (to Jay and Gail) We walked over here together... Linda wants to say something more. RICHARD (to Jay and Gail) It was...   please take good care of yourselves. GAIL Thank you... JAY Of course, yeah, take care. Richard leaves.   He doesn’t walk far before turning back to wait for Linda. The women think to hug but something keeps them apart for now. JAY (to Linda and Kendra) Well, thank you.   And you, Kendra. KENDRA It was my pleasure. JAY (to Gail) We’ll stay here? GAIL Yeah... (reaching, confused) We’re always here.   I mean, to stay in touch. CONTINUED: (2) 29   29 (CONTINUED) Rev. mm/dd/yy (Pink)   96. LINDA Good.   I’m... It was nice to see you again. KENDRA Take good care of yourselves. Kendra smiles at the Perry’s and escorts Linda out. Linda and Richard walk away, with Kendra following behind. The Perry’s are alone again.   Judy calls out from the basement steps. JUDY (O.S.) You all want to just come down here and take a look?   With the flowers?   Sorry it just might be easier... JAY Yeah, that’s fine.   Thank you... Jay heads down the stairs.   Gail takes one last look outside before heading down herself. INT. EMMANUEL EPISCOPAL CHURCH - BASEMENT - DAY 30   30 Judy heads back to the kitchen.   Jay and Gail follow. J",
      "dialogue_count": 0,
      "word_count": 1537
    }
  ]
}