{
  "slug": "master-of-none-101-plan-b-2015",
  "title": "master of none 101 plan b",
  "genre": "action",
  "format": "series",
  "scenes_count": 4,
  "characters_count": 0,
  "characters": [],
  "total_words": 6121,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. BEDROOM - NIGHT 1   1 DEV is having sex with RACHEL. DEV Fuck fuck. RACHEL What? What happened? DEV. The condom broke. RACHEL Oh. Okay, do you have another one? Just go put it on, hurry. DEV Well, I’m just worried because it broke and I was kinda all up in there. RACHEL How long were you all up in there with it broken? DEV I don’t know, I just noticed it now. Are you on birth control stuff? RACHEL No, but you didn’t finish, so it’s fine. DEV But aren’t there some little guys in the pre-cum? Should we maybe get a morning after pill to be safe? RACHEL No no, it’s fine. You can’t pregnant from pre-cum. DEV I actually had a friend who was in a situation like this and they got pregnant, so... RACHEL That seems anecdotal.  MASTER OF NONE   “Plan B”   [101]   1. Shooting Draft Second Revised   3/31/15 (CONTINUED) TV Calling - For educational purposes only",
      "characters": [],
      "action_text": "DEV No, no, I knew the person, it’s a real friend. RACHEL That’s what anecdotal means. DEV Oh I thought anecdotal was like a fancy way of saying urban legend. RACHEL No, it means you take one example and apply it to everything. DEV Got it, okay. Well, neither of us are doctors. Isn’t it worth a minute to Google it just to be safe? RACHEL Yeah, okay. Let’s look it up. They are on their phones. RACHEL (CONT’D) Okay, here, pre-cum does not contain sperm. DEV I got the Mayo Clinic here, it says if you’ve ejaculated recently, there could be sperms hanging out in there and the pre-cum might grab ’em on the way. RACHEL Okay, well, when’s the last time you ejaculated? DEV Uh... this is kind of embarrassing, but earlier today. RACHEL With another person? DEV No, I masturbated, I jerked off. RACHEL At the bar?  MASTER OF NONE   “Plan B”   [101]   2. Shooting Draft Second Revised   3/31/15 CONTINUED: 1   1 (CONTINUED) TV Calling - For educational purposes only DEV No, no, before I went out this evening, so as not to get so excited in a situatio-- RACHEL I get it. I get it. Well sperm can live outside the body for 7 days, the motility goes down after 72 hours, and you ejaculated, what? 4 hours ago? Dammit, the little guys might be in me. Let’s go get a pill. INT. CVS - NIGHT 2   2 Dev and Rachel walk up to the pharmacy counter. DEV Hey, so me and this person, we uh... The PHARMACIST grabs a box of Plan B and sets it down. DEV (CONT’D) Great thanks. Is this a good brand? PHARMACIST It’s the best and only brand. DEV Great. You want anything else?   Snacks? Oooh, Martinelli’s apple juice? RACHEL I’m fine. DEV Wait. You’ve never had Martinelli’s, right? RACHEL No. DEV What? It’s like the best juice! Two Martinelli’s as well. Rachel reaches for wallet. DEV (CONT’D) No no, I got this. RACHEL Your treat?  MASTER OF NONE   “Plan B”   [101]   2A. Shooting Draft Second Revised   3/31/15 CONTINUED: (2) 1   1 (CONTINUED) TV Calling - For educational purposes only DEV It’s my treat. INT. CA",
      "dialogue_count": 0,
      "word_count": 1748
    },
    {
      "scene_number": 2,
      "slugline": "EXT. KYLE’S HOUSE - BACKYARD - DAY 5   5 Dev and Arnold walk in to a backyard with parents and little kids, holding gifts. DEV I can’t believe Alex has a kid now. I was having sex with that person and then a baby came out of that same place, very recently. ARNOLD So crazy to imagine that baby’s been in the same spot as my lil’ bud’s hardware. What a world. Dev and Arnold run into KYLE (friendly, well-dressed, put together) and his wife BRENDA welcome Dev and Arnold. BRENDA is holding their one-year-old son ZACH. KYLE/BRENDA   * Hey guys, welcome! Thanks for coming! DEV Thanks for having us. KYLE Can I offer you guys a glass of rosé? Or perhaps a Capri Sun? DEV You know what? Might have to get up on that Capri Sun, son. Kyle grabs him one and goes to put the straw in. ARNOLD On the bottom please, cool-kids style.  MASTER OF NONE   “Plan B”   [101]   9. Shooting Draft Second Revised   3/31/15 (CONTINUED) TV Calling - For educational purposes only",
      "characters": [],
      "action_text": "He places Arnold’s straw on the bottom. Kyle walks off. An EXCITED DUDE comes up to Dev. EXCITED DUDE Yo, are you that dude from the Go-Gurt commercial? DEV Yeah, that’s me. EXCITED DUDE Oh dope. So, you do a commercial like that, you get a hookup on Go-Gurt? DEV No. EXCITED DUDE You gotta talk to your agent about that bruh. My boy did a Combos spot, he got Combos for life. DEV That’s cool. EXCITED DUDE Yeah. But he changed, man. Excited dude leaves. Arnold has squeezed out his Capri Sun. ARNOLD They still air your Go-Gurt ad? DEV Just got a check today! It’s covered rent for years now. ARNOLD That’s such easy money. (mimicking the commercial) “When you’re on the go, grab a Go-Gurt!” I could have done that. DEV Nah, nah, like this. (with more enthusiasm) “When you’re on the go, grab a Go-Gurt!” ARNOLD That was good. I actually do kind of want a Go-Gurt now. Respect. Well, that bounce house is calling my name. Later, Cap.  MASTER OF NONE   “Plan B”   [101]   10. Shooting Draft Second Revised   3/31/15 CONTINUED: 5   5 (MORE) (CONTINUED) TV Calling - For educational purposes only (yelling at a kid) EXCUSE ME! EXT. KYLE’S HOUSE - BACKYARD - LATER 6   6 Dev and Kyle catch up. DEV So weird seeing you hold a kid. How’s fatherhood? KYLE Oh man, it’s great. It’s like I’m part of something bigger now. My whole life has a deeper purpose. DEV Do you miss the single life? Going out and stuff? KYLE The other day, Zach started crying at four AM. I was so tired. I was pissed. But I walked over and turned the light on and I held him. At one point, I looked in his face and he just smiled and laughed at me. And we both started just laughing. I was laughing with my kid, with this person that I created, that I’m going to watch grow up and hopefully do great things as an adult. I can’t think of any night of drinking or partying that made me feel anything even a millionth of that. DEV Fuuuuuuuuuuuuck. (beat) The highlight of my year was when I crashed Zachary Quinto’s Halloween party. Ky",
      "dialogue_count": 0,
      "word_count": 609
    },
    {
      "scene_number": 3,
      "slugline": "INT. HOUSE - DAY 8   8 Dev enters as a   Leave it to Beaver -esque dad. He’s wearing a suit and holding a briefcase and shopping bag. He puts his hat and coat down. Two kids, a boy and a girl, run up and hug him. KIDS Daddy! DEV Oh, what’s this? There’s something in my bag, it’s a little heavier... Dev looks in. DEV (CONT’D) Oh shit! I brought you some toys! KIDS (going apeshit) Yaaaay! SLOW MOTION: Dev picks them up and spins them around as they go nuts. EXT. STREET - DAY 9   9 Dev walks with the kids, leaving school. They have backpacks on. DEV’S DAUGHTER So, then we learned about dinosaurs and we got to draw our favorite dinosaur and I drew an apatosaurus. DEV’S SON (way too excited) I learned what nouns are! DEV Awww, I’m really proud of you guys. Dev looks so happy. He glances over across the street and looks concerned. An older, disheveled Arnold is walking near a YOUNG WOMAN. ARNOLD Any plans later? Maybe a drink, m’lady? YOUNG WOMAN Get away from me! I don’t have any spare change!  MASTER OF NONE   “Plan B”   [101]   12. Shooting Draft Second Revised   3/31/15 (CONTINUED) TV Calling - For educational purposes only",
      "characters": [],
      "action_text": "She quickly walks away. ARNOLD I’m not homeless! I’m just an older, single man who never settled dooooooown! Arnold looks sad.  END FANTASY SEQUENCE.  EXT. KYLE’S HOUSE - BACKYARD - CONTINUOUS 10   10 Dev looks at Arnold bouncing in the house. DEV Man, you could not have been more wrong, I was just talking to Kyle and he seems so happy. His life sounds like it has so much more meaning. It kind of made me want to have a kid. ARNOLD Huh? I can’t talk right now, bud. You’re distracting me from my bounce. A MOM comes up with a small kid. MOM Can you gentlemen get out of the bounce house? You just bounced out my son Tristan. ARNOLD With all due respect m’aam, your son weighs twenty pounds and he got in my bounce space. That’s not on me. That’s on Tristan. Arnold does a big bounce. EXT. KYLE’S HOUSE - BACKYARD - LATER 11   11 Dev sips a Capri Sun. He runs into AMANDA (40, sharp, tough), who’s with her kids GRANT (8) and LILA (5). DEV What’s up, Amanda? AMANDA Hey Dev. Dev leans over to talk to Grant.  MASTER OF NONE   “Plan B”   [101]   13. Shooting Draft Second Revised   3/31/15 CONTINUED: 9   9 (CONTINUED) TV Calling - For educational purposes only DEV Hey Grant. What’s up? You want to arm   * wrestle? GRANT Sure. Grant starts arm wrestling and Dev feigns struggling to win. DEV Noooo! Stop it!! Please!! My arrmmmmm! Grant is laughing. DEV (CONT’D) Lila, I heard you got married last month, why didn’t I get an invite to the wedding? LILA I didn’t get married! DEV Look, I get it, it was a small wedding, but I thought we were close. LILA I’m not married! DEV Sure. Fine. Well I guess I’m going to keep that blender for myself then! Lila laughs. AMANDA Alright guys, go over there and play. Grant and Lila run off. DEV Damn, that’s so cool.   They’re like   * little people now!   * AMANDA Yeah, but they can be dicks sometimes   * too, though.   *  MASTER OF NONE   “Plan B”   [101]   14. Shooting Draft Second Revised   3/31/15 CONTINUED: 11   11 (CONTINUED) TV Calling - For educa",
      "dialogue_count": 0,
      "word_count": 2389
    },
    {
      "scene_number": 4,
      "slugline": "INT. KYLE’S HOUSE - HALLWAY - DAY 23   23 Kyle walks Dev to the bathroom. DEV Man, I was watching those guys for like an hour and I’m destroyed. You’ve had a kid for a year and you seem to be doing great. What’s your secret? KYLE My secret is I’m getting divorced. DEV Hahaha!   * (beat, realizing) Wait, what? You’re serious? KYLE We’ve just been dealing with a lot of issues. We tried to figure things out, but I don’t think it’s going to work. DEV Oh. Oh god. I thought everything was going really well. What about all the fulfillment and higher sense of purpose? KYLE Ugh, that’s just bullshit you tell people at parties. What am I supposed to say? I don’t sleep, I haven’t fucked in a year, I never see my friends, I hate my wife? DEV Damn. Yeah, I guess you can’t say all that. Pretty depressing. I mean, sorry. I know that’s your life, I just mean... it’s not really good party... what’s the word I’m thinking of... (finding the word, snaps) Fodder. KYLE (sighs) It’s tough. We’d only been dating six months, but Brenda got pregnant and it really felt like we could pull it off. It started off okay, but then it got a little rocky. It was just too soon. Then you throw a kid in the mix... (beat)  MASTER OF NONE   “Plan B”   [101]   25. Shooting Draft Second Revised   3/31/15 (MORE) (CONTINUED) TV Calling - For educational purposes only",
      "characters": [],
      "action_text": "Zach’s awesome and we couldn’t love him any more, but it’s just not enough to keep us together. (pointing) The bathroom’s here. Dev opens the bathroom door.   * DEV (way too excited) Oooh! Smells nice in here, you gotta hit me with the deets on this candle. Sorry. Kyle stares at him. KYLE It is a great candle. Kyle stares off into the distance.  FANTASY SEQUENCE:  Dev imagines a nightmare version of having kids. INT. HOUSE - DAY 24   24 Dev is holding a baby. This time it vomits on his face. DEV Ugh! (calling off) It just threw up! INT. HOUSE - DAY 25   25 Dev enters wearing a suit and holding a briefcase.   This time, he looks really haggard and beaten down. He puts his hat and coat down. REVEAL: The room is a disaster -- mustard, ketchup, candy, and flour all over the living room. DEV’S SON We found the flour! You can’t hide it from us! He and Dev’s daughter continue to sling around and spread flour everywhere. SLOW MOTION: The kids are going nuts throwing stuff around and generally creating a huge mess.  MASTER OF NONE   “Plan B”   [101]   26. Shooting Draft Second Revised   3/31/15 CONTINUED: 23   23 KYLE (CONT'D) (CONTINUED) TV Calling - For educational purposes only Dev sits down and tries to eat a sandwich. His daughter knocks it down on the ground and laughs. The laughter is pitch-shifted down and sounds demonic. EXT. STREET - DAY 26   26 Dev is driving in his car with his kids. They are screaming and beating the back of his seat. DEV Put your seatbelts on! Put your seatbelts on! DEV’S SON Nooooooooooooooo! Dev’s son has a big bag of M&M’s and is slinging them around everywhere. Dev is defeated as he pulls up to a stop light. Then, Arnold pulls up beside him in a convertible with three women. ARNOLD Ha! Cute kids, idiot! Arnold honks and drives off.  END FANTASY SEQUENCE.  INT. AMANDA’S HOUSE - DAY 27   27 Dev is sitting with the kids as they play on their iPads .  Amanda walks in. AMANDA Guess who’s home? LILA/GRANT Mama! The kids and Dev all run to hug Ama",
      "dialogue_count": 0,
      "word_count": 1375
    }
  ]
}