{
  "slug": "master-of-none-208-thanksgiving-2017",
  "title": "master of none 208 thanksgiving",
  "genre": "drama",
  "format": "series",
  "scenes_count": 2,
  "characters_count": 0,
  "characters": [],
  "total_words": 6741,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. WATKINS FAMILY APARTMENT - KITCHEN/DINING ROOM - DAY - 3   3  1991 Denise’s mom and grandma, CATHERINE and ERNESTINE, are with Catherine’s friend, JOYCE. They’re prepping for Thanksgiving dinner while watching the   Price is Right . JOYCE Where Denise at? CATHERINE She’s upstairs with her little boyfriend. JOYCE Oh, wait, Denise got a little boyfriend?! CATHERINE Mm-hmm. Two kids, around age 8, run in. It’s KID DEV and KID DENISE. Denise is dressed femininely and conservatively. ERNESTINE Y’all better stop running through this house. KID DENISE Yes, Grandma. CATHERINE Denise, what were y’all doing up there? KID DENISE Watching   Fresh Prince . CATHERINE You weren’t eating candy, were you? KID DENISE No. CATHERINE Dev, do y’all even celebrate Thanksgiving in your house? Is that a thing y’all do in the Indian community? KID DEV We have lunch together. Then my dad watches   The Godfather   and falls asleep. CATHERINE (laughs) Well, you are welcome to come have Thanksgiving with us anytime you want.  (CONTINUED)  MASTER OF NONE   “Thanksgiving”   [208]   1. Pink Revision Pages   10/19/16",
      "characters": [],
      "action_text": "KID DENISE What’s “the Indian community”? CATHERINE Dev is Indian. KID DENISE Wait... I thought Dev was black. KID DEV I’m brown! KID DENISE Black people are brown too! CATHERINE Oh lord. Okay, look, both of you are minorities. KID DENISE What’s a minority? CATHERINE It’s a group of people that have to work twice as hard in life to get half as far. And Denise, you a black woman, so you gonna have to work three times as hard. JOYCE I know that’s right. CATHERINE Mm-hmm. You’re both gonna be disenfranchised. Ma. ERNESTINE I’m coming. KID DENISE Like a McDonald’s? JOYCE What? KID DENISE McDonald’s is a franchise. When people open up their own McDonald’s, they just pay the big McDonald’s man a license fee so they can run it. That’s what a franchise is.  CONTINUED: 3   3  (CONTINUED)  MASTER OF NONE   “Thanksgiving”   [208]   2. Pink Revision Pages   10/19/16 CATHERINE Denise, how the hell do you know what a franchise is, but you don’t know that Dev ain’t black? KID DEV I’m confused. I’m a McDonald’s? Catherine is exasperated. CATHERINE You’re a McDonald’s and Denise is a Burger King. Now, both of y’all sit on down so we can get ready to eat. Denise and Dev sit at the table. JOYCE And I’m a big old White Castle, so... Everyone laughs. JOYCE (CONT’D) Ooh, this looks good. CATHERINE We gonna say grace first. JOYCE Oh. OPENING CREDITS. INT. WATKINS FAMILY APARTMENT - KITCHEN - DAY - 1995 4   4  Catherine, Ernestine, and Joyce do their Thanksgiving prep, circa 1995. JOYCE Ooh, tell your mama to stop smoking in the kitchen. ERNESTINE Child, I’m old. I can smoke wherever I want. JOYCE Dropping ashes all in the potatoes... ERNESTINE It adds flavor. JOYCE I don’t want no Newport potatoes.  CONTINUED: (2) 3   3  (CONTINUED)  MASTER OF NONE   “Thanksgiving”   [208]   3. Pink Revision Pages   10/19/16 ERNESTINE I was trying to help. INT. WATKINS FAMILY APARTMENT - PRE-TEEN DENISE’S ROOM - DAY - 5   5  1995 TIGHT SHOT: A music video on a small TV in Denise’s room: “Brown Sugar” by D",
      "dialogue_count": 0,
      "word_count": 4312
    },
    {
      "scene_number": 2,
      "slugline": "INT. WATKINS FAMILY APARTMENT - KITCHEN - NIGHT - 2015 22   22  Denise and Catherine are in the kitchen cleaning up. CATHERINE I don’t have any appreciation for what was going on at my table. DENISE What are you talking about? CATHERINE If you wanna bring your friend over here, that’s fine, but don’t be making eyes and rubbing backs and getting all fresh. DENISE I wasn’t doing that. CATHERINE Oh, yes, you were. I saw you. I know that look. Oh, you used to make that look for Rachel from Friends. I always thought you were looking at Joey. DENISE Joey? Ma, are you serious? That character was an idiot. CATHERINE Look, you can be lesbian if you want to - but when you come up in here, you gonna respect my house. INT. WATKINS FAMILY APARTMENT - KITCHEN - DAY - 2016 23   23  Thanksgiving 2016 prep with Catherine, Ernestine, and Joyce. INT. WATKINS FAMILY APARTMENT - MODERN DENISE’S ROOM - DAY - 24   24  2016 Dev riffles through old VHS tapes in Denise’s room. DEV  Problem Child Two . Oh, shit. What else we got? Denise and Dev's tap dancer song of nineteen ninety-one? Should we fire this up? You remember the routine? Dev starts tapping. DEV (CONT’D) 'Cause I don't.  (CONTINUED)  MASTER OF NONE   “Thanksgiving”   [208]   25. Pink Revision Pages   10/19/16",
      "characters": [],
      "action_text": "DENISE Man, sit your ass down. DEV When's your boo arriving here? DENISE She should be here in a few minutes. DEV Wow. Thanksgiving invite. Must be serious. DENISE Yeah, man. I really like her. DEV Nice. What's her Instagram name? I want to look her up. DENISE Dude, you're literally gonna meet her in a few minutes. DEV I know. But I want to look it up beforehand, get a vibe. DENISE (sighs) I forgot. DEV You forgot, look it up. DENISE (sighs) NipplesAndToes23. DEV Whoa. What's that? DENISE NipplesAndToes23. DEV Denise! You can't be dating some girl with the Instagram name \"NipplesAndToes23.\" DENISE I know, man. I'm trying to get her to change it.  CONTINUED: 24   24  (CONTINUED)  MASTER OF NONE   “Thanksgiving”   [208]   26. Pink Revision Pages   10/19/16 DEV (scoffs) I’m just surprised there are 22 other NipplesAndToes. Dev goes to her Instagram page. DEV (CONT’D) Let's see what we got here. Oh, wow. These are some provocative photos. DENISE Okay, don't be looking at my girl, man. DEV Ooh. Really into fitness. ANGLE ON: Dev’s phone. We see really racy photos of Nikki in skimpy gym clothes and drinking thick white protein shakes. DENISE She is kinda naked there. DEV Well, maybe I shouldn't just paint it with one brush. She's clearly very political. I just voted. Another photo of her with skimpy underwear and panties on with the caption that reads “I just voted.” Denise leans in to see the photo. DENISE Man. That wasn't for no damn election. That was for   So You Think You Can Dance?  DEV Does she have some sort of intense fabric allergy 'cause she is scantily clad in a lot of these photos, Denise. The doorbell rings. DEV (CONT’D) Oh, shit! NipplesandToes in the building, let’s go! DENISE All right. I'll be there in a second. DEV Okay.  CONTINUED: (2) 24   24  (CONTINUED)  MASTER OF NONE   “Thanksgiving”   [208]   27. Pink Revision Pages   10/19/16 Dev heads out. INT. WATKINS FAMILY APARTMENT - KITCHEN/DINING ROOM - NIGHT - 25   25  2016 Everyone is eating Thanksgivin",
      "dialogue_count": 0,
      "word_count": 2429
    }
  ]
}