{
  "slug": "master-of-none-102-parents-2015",
  "title": "master of none 102 parents",
  "genre": "action",
  "format": "series",
  "scenes_count": 4,
  "characters_count": 0,
  "characters": [],
  "total_words": 6211,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. CASTING OFFICE - AUDITION ROOM - DAY 1   1  Dev finishes his audition. DEV Madam President, Joint Chiefs of Staff, Prime Minister Cho, it’s truly an honor to be here in the Oval Office, though I wish it were under better circumstances. I just came back from a meeting with the world’s top scientists. They’re all dead. The virus, it got them all. I was able to obtain a sample, but it’s not in the vial. It’s... it’s in my blood. CASTING DIRECTOR (very flat) Dr. Vincent, if it’s in your blood. Then that means. The virus. My god. DEV Yes, the sickening... has begun. The casting people look at each other, impressed. CASTING DIRECTOR Wow. Very, very powerful stuff, Dev. That pause you took after “the sickening” was phenomenal! ASSISTANT CASTING DIRECTOR Amazing pause. One of the best pauses we’ve heard all day. CASTING DIRECTOR Thank you so much for coming in. DEV Thank you... (pauses intentionally and dramatically) ...for your time. The room gives him a nice laugh. Dev laughs with them. INT. CASTING OFFICE - HALLWAY - LATER 2   2  The casting director walks Dev out. The room is full of other actors auditioning for Dr. Vincent. CASTING DIRECTOR That was great. Now our director is flying in next week. (MORE) (CONTINUED)  MASTER OF NONE   “Parents”   [102]   1. Shooting Draft   6/16/15",
      "characters": [],
      "action_text": "I definitely want to bring you in for a session with him. My office will be in touch. DEV Thanks, sounds great. Any word on who the leads of the film might be? CASTING DIRECTOR (quietly) Between us, they’re close on Colin Salmon and Kerry Washington. And it looks like we’re going with 50 Cent as the evil senator who looks the other way. DEV Wait, so is this a... like... black virus movie? CASTING DIRECTOR Yes. That’s exactly what it is. INT. RAMESH’S HOUSE - DAY 3   3  Dev’s dad, RAMESH, looks at his iPad and paces back and forth. DEV So yeah, I got a callback for the virus movie, could be cool -- RAMESH (not really listening) Shit. Shit. Shit. Shit. Shit. DEV What? What’s wrong? RAMESH (pointing to his iPad) I just realized my calendar isn’t updating. My friend, Dr. Ramusami, is visiting and I forgot to pick him up at the train station. DEV Uh oh, that’s cold. Guy came all the way from India, seems like you should have picked him up. RAMESH I have all my appointments in the calendar. And the day before, a little “ding” comes up. CONTINUED: 2   2 CASTING DIRECTOR (CONT'D) (MORE)   (CONTINUED)  MASTER OF NONE   “Parents”   [102]   2. Shooting Draft   6/16/15 Ding!” And then I plan my day. I listen to the dings and see what I have to do. There wasn’t a ding! DEV You got a new iPad. You didn’t transfer anything over. RAMESH Why don’t the dings automatically transfer? DEV “Dings” is not a term. You gotta stop saying “dings.” The appointments don’t transfer automatically. You have to transfer them. RAMESH I’ve been calling you to set it up. You never call me back! Now Dr. Ramusami is probably wandering around Penn Station eating pretzels. DEV Ok, you don’t know that he’s eating pretzels. Also that’s an adorable worst case scenario for being lost alone in New York. RAMESH I have to go get him. Can you fix the iPad for me? Dev hurriedly starts leaving. DEV Eh, can I do it later? I’m going to go see X-Men and I don’t want to miss the trailers. Close in on Ramesh’s face... D",
      "dialogue_count": 0,
      "word_count": 843
    },
    {
      "scene_number": 2,
      "slugline": "INT. CLINIC - U.S., 1980 - DAY 7   7  An AMERICAN DOCTOR, not friendly, gives YOUNG ADULT RAMESH a tour. AMERICAN DOCTOR That’s the basic go-round of the facility. (speaking way too slowly and clearly) So - do - you - understand - every - thing? RAMESH Yeah. So someone said when the new doctor comes to town you usually take the family to the steakhouse. Is that tonight? Should I go pick up my wife? The doctor glances at an older doctor, who shakes his head. AMERICAN DOCTOR Oh... no. There... is no dinner. You can just go to the cafeteria and eat. INT. CAFETERIA - U.S., 1980 - NIGHT 8   8  Young Adult Ramesh and Young Adult Fatima have dinner. Very few people are there. INT. HOSPITAL ROOM - U.S., 1980’S - DAY 9   9  1980’s. Baby Dev is born. INT. RAMESH’S HOUSE - U.S., 1990’S - DAY 10   10  1990’s. Ramesh walks in with CHILD DEV. He’s covering Dev’s eyes with his hands. He takes his hands away. RAMESH Your eyes are closed? CHILD DEV Yes. RAMESH Okay, now open them! CHILD DEV A computer! Dev runs up and starts playing with a boxy, 90’s Apple computer. (CONTINUED)  MASTER OF NONE   “Parents”   [102]   5. Shooting Draft   6/16/15",
      "characters": [],
      "action_text": "CHILD DEV (CONT’D) Whoah, thanks Dad! Ramesh looks at Dev’s eyes which are beaming and so happy. We match cut to present day.  END FLASHBACK.  INT. RAMESH’S HOUSE - PRESENT DAY 11   11  Match cut to present-day Dev’s face. DEV Can I just do it later? I’m going to go see X-Men and I don’t want to miss the trailers. I gotta go, I’m not your personal computer guy. RAMESH (disappointed) Okay. Dev sends a text to Brian: “Headed over.” Ramesh watches Dev leave. INT. PETER’S APARTMENT - DAY 12   12  BRIAN sees Dev’s text. He is talking with his dad PETER (60s, quiet, serious). BRIAN Okay, I think I’m gonna head out soon, Dad. PETER Did you read the   Economist   article I e- mailed you? BRIAN No, I didn’t get a chance to do that yet. PETER It exposes how farm subsidies are slowly leading us to a country-wide drought within ten years. BRIAN Sounds uplifting! So, I should go. It was good seeing you. PETER Before you go, can you run and pick me up a package of rice from the store downstairs? CONTINUED: 10   10 (CONTINUED)  MASTER OF NONE   “Parents”   [102]   6. Shooting Draft   6/16/15 BRIAN Sorry, I can’t. I’m meeting Dev to see a movie, and I love answering those movie trivia questions they put up before the show. So I think I’m just going to head out. Brian exits. Off Peter’s face...  FLASHBACK: PETER’S LIFE  EXT. PETER’S CHILDHOOD HOUSE - TAIWAN, 1950’S - DAY 13   13  The house is tiny. It is one room with a dirt floor -- more of a hut than a house. CHILD PETER (age 10) is outside, playing with a chicken. He’s having fun -- he loves it like a pet. INT. PETER’S CHILDHOOD HOUSE - TAIWAN, 1950’S - DAY 14   14  Peter enters. Peter’s parents and two brothers work in the kitchen area. Peter’s dad calls after Peter.  NOTE: All dialogue in Taiwan is in Mandarin and subtitled.  PETER’S DAD Toku. Go get some rice. Child Peter walks off obediently. INT. PETER’S CHILDHOOD HOUSE - TAIWAN, 1950’S - LATER 15   15  Child Peter gives the rice to his dad. PETER’S DAD We want some meat at ",
      "dialogue_count": 0,
      "word_count": 682
    },
    {
      "scene_number": 3,
      "slugline": "INT. PETER’S CHILDHOOD HOUSE - TAIWAN, 1970’S - DAY 18   18  YOUNG ADULT PETER, now in his twenties, and his wife speak with his parents. PETER’S DAD (subtitled Mandarin) If you go to America, you won’t know anyone, you won’t have anything. YOUNG ADULT PETER (subtitled Mandarin) I will have opportunity there. I will have a chance at a better life. EXT. AIRPORT - U.S., 1980’S - DAY 19   19  STOCK FOOTAGE: Peter’s plane lands in America. INT. DINER - U.S., 1980’S - DAY 20   20  Young Adult Peter and his wife are in America. They’re at a diner trying to get seated. HOST Sorry, we just don’t have any tables. They scan the room and see dozen of empty tables. PETER (to his wife, subtitled Mandarin) I think they don’t want to seat us because we’re Asian. The host stares back at them, unmoved. INT. PETER’S CHINESE RESTAURANT - U.S., 1980’S - DAY 21   21  Young Adult Peter and his wife are running a successful Chinese restaurant. Young Adult Peter stands by the door greeting customers. YOUNG ADULT PETER Thank you for coming. Young Adult Peter and his wife stand arm in arm, beaming at the bustling restaurant in front of them. YOUNG ADULT PETER (CONT’D) Business is good. Very good.  MASTER OF NONE   “Parents”   [102]   8. Shooting Draft   6/16/15",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 222
    },
    {
      "scene_number": 4,
      "slugline": "INT. DIFFERENT HOSPITAL ROOM - U.S., 1984 - DAY 22   22  US, 1984. Young Adult Peter is holding his infant son, Brian. He and his wife are overjoyed. He raises baby Brian into the air. PETER (subtitled Mandarin) All our sacrifice is worth it. He will have a better life. Here, he will be able to do anything he wants. Zoom into baby Brian’s eyes...  END FLASHBACK MONTAGE.  INT. PETER’S APARTMENT - PRESENT DAY 23   23  Pull out from adult Brian’s eyes... BRIAN Sorry, I can’t. I’m meeting Dev to see a movie, and I love answering those movie trivia questions they put up before the show. So I think I’m just going to head out. PETER (disappointed) I understand. Enjoy the film. EXT. STREET - DAY 24   24  Dev and Brian are walking after leaving the theater. BRIAN Wow. I gotta say, out of the fifteen   X- Men   movies I’ve seen, that was definitely in the top nine. DEV Yeah. There were like 30 heroes, 40 villains. There are just too many people in these movies now. (checking his phone) Text from my dad: “Please come and fix my iPad. Now it won’t stop dinging.” Does your dad text you to fix stuff all the time? BRIAN I don’t think my dad knows how to text. He also hates talking in person. He averages like three words a week. (CONTINUED)  MASTER OF NONE   “Parents”   [102]   9. Shooting Draft   6/16/15",
      "characters": [],
      "action_text": "DEV Our dads are so weird. I told my dad I made the final round of callbacks on   The Sickening --  BRIAN That black virus movie? That’s great! DEV Thank you! I told him and he’s like “Uh, okay, are you going fix my iPad?” How about “Hey son, I’m proud of you?” or “Hey son, great work!” BRIAN Oh I’ve never heard my dad say the word proud. It’s always like “Oh that’s it? That’s all you’ve done?” If I went to the moon, honestly, he would be like, “When are you going to Mars?” DEV Yeah, like “Brian, you went to the moon? That’s like graduating from community college. When are you going to graduate from Harvard AKA go to Pluto?” BRIAN I just feel like Asian parents just don’t have the emotional reach to say they’re proud or whatever. You ever hang out with white people’s parents? They are crazy nice .   I had dinner with my last girlfriend’s mom once. By the end of the meal, she had hugged me more times than anyone in my family has ever hugged me in my entire life. DEV Yeah, dude, most white families would be so psyched to adopt me. Dev’s phone buzzes. He checks it. DEV (CONT’D) Ugh. Now, my dad wants to come over and have tea with his old friend, Dr. Ramusami. Can you come so I have an easy out to leave quickly? BRIAN You want me to hang out with your dad and  another old Indian man? No. I’m not doing that, it’s nice outside. CONTINUED: 24   24 (MORE)   (CONTINUED)  MASTER OF NONE   “Parents”   [102]   10. Shooting Draft   6/16/15 I’m going go hang out in the park and look at NBA trade rumors on my phone. DEV Hey come on, be a bud here, don’t make me go solo, I’ll be able to leave quicker if we go together. BRIAN Fine, but you have to come hang out with me at the networking mixer for Asian American business professionals that my cousin James is hosting next weekend. DEV Alright, deal. INT. RAMESH’S HOUSE - DAY 25   25  Dev and Brian drink tea with Ramesh and DR. RAMUSAMI (an older Indian man). RAMESH Brian, would you like to try some Indian snacks? (naming the snacks w",
      "dialogue_count": 0,
      "word_count": 4464
    }
  ]
}