{
  "slug": "mayor-of-kingstown-101-episode-1-1-2021",
  "title": "mayor of kingstown 101 episode 1 1",
  "genre": "thriller",
  "format": "series",
  "scenes_count": 3,
  "characters_count": 0,
  "characters": [],
  "total_words": 2565,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. MIKE’S LINCOLN -- MOMENT LATER. Mike races toward the office, pissed. Calls Mitch’s cell -- gets voicemail. MIKE This what you were gonna tell me later?! Those maniacs almost killed me! WHAT HAPPENED! They’re pissed Mitch and getting that letter is gonna be a ton of fucking work. He throws the cell on his passenger seat and floors it. EXT MCLUSKY’S OUTREACH OFFICE -- MORNING. Mike races down the street to find: SQUAD CARS, AN AMBULANCE, CORONER’S OFFICE VAN, and the like. Officers milling about. A decent crowd forming. Mike throws his Lincoln in park and is out the door. Cops avoid his gaze. Ian walks toward him. MIKE What. IAN Let’s sit over here Mike. MIKE (Realizing) What happened?? IAN Come on, Mike. You don’t want to see this. MIKE Fuck you I don’t. IAN Let’s slow down and talk. MIKE How. IAN Gunshot. Back of the head. Real quick, Mike. Hearing it burns. Bad.  37.",
      "characters": [],
      "action_text": "MIKE Know who? They have reached the office. Rebecca sits on her desk, crying. Kyle sits in a chair, flanked by two detectives, making an attempt at consoling. IAN Some banger named Alberto Romos, prints are fuckin’ everywhere. He’s either a class A moron or whacked out of his mind.(Grabs Mike by the arm and turns him) We found Vera Sunter dead in her house. Raped. Beat to shit and strangled. His prints there too. Guy should rent a billboard. Not gonna be able to hide the link. MIKE Not much of a secret. IAN Well ... There’s common knowledge and public knowledge. State, Feds, or the fucking news pick up on it? Just make sure all that stays with Mitch. For you and Kyle. Hell, for everybody... MIKE Yeah. IAN Don’t go in there Mike. Seeing him won’t answer anything. We got this guy. SWAT’S at his house right now. He’s laying on the couch watching fuckin soccer. We got him. Let’s just go outside. MIKE I gotta see... IAN Don’t touch anything. Everybody’s watching on this one. Mike nods and goes in. INT. MITCH’S OFFICE -- CONT. Mike steps in. Scene photographer snaps photos as two guys from the coroner’s office wait with a stretcher and body bag.  38. He sits in the chair across from his brother. STEVIE puts a comforting hand on his shoulder, then gets back to canvasing the room. MIKE stares. Blood on the floor. On the wall. The file cabinet is covered in blood and some type of gray substance. Mike’s hand goes to his face, discreetly covering his mouth. His hand closes to a fist, and he begins to bite into it. He draws blood, and it runs down his hand and disappears under his jacket as he watches Stevie run a large piece of chalk around Mitch’s lifeless form. INT. MCLUSKYS FRONT OFFICE -- MOMENT LATER. Kyle stares ahead, at nothing. Mike drops into the chair beside him. They sit in silence. KYLE Hey, how else could it end? For you too? Help these fucking parasites. Hold everything together for everybody else. It was inevitable. MIKE Yeah. Kyle, his sadness gone. Stands an",
      "dialogue_count": 0,
      "word_count": 900
    },
    {
      "scene_number": 2,
      "slugline": "EXT. ALBERTO’S HOUSE -- DAY. Small, dilapidated, paint-chipped dump. A few houses down are enough cop cars only someone as lost as Alberto would not notice. Mike’s Lincoln pulls up, looking for blood. He is met by IAN and a SWAT CAPTAIN, ROBERT(40S) as the Lincoln parks. IAN Mike, come on, You know how this works. MIKE What I’ve done for you, for every one of you -- give me this. ROBERT Mike, we can’t. There’s no way. MIKE This fuckhead goes to prison -- He’s safe. We don’t do anything for the Mafia, they don’t want our help. They won’t give him to me. This asshole will put his feet up for the rest of his life and laugh about it. IAN Mike, I give you my word -- if he’s alone in there he’ll never leave that couch. Ever. SWAT CAPTAIN Don’t worry, Mike.(He winks) We do this for a living. Mike moves off to IAN’S car as the swat team and detectives move to the side of the house. They creep up to the doorway and we INT ALBERTO’S HOUSE. CONT. ALBERTO is sprawled on the couch, gun on his stomach, a mountain of cash on the coffee table. He takes a pull from a one hitter and holds the smoke. The front door explodes from the hinges. Alberto levitates off the couch. He faces a dozen swat officers, guns trained on him. ROBERT looks him in the eye.  41.",
      "characters": [],
      "action_text": "ROBERT Here’s what you will do. Pick up the pistol. Do it. Not By the barrel, by the handle, you’ve seen too many movies, Alberto. Point it toward the ceiling. Now bring the muzzle down, SLOWLY, in my direction. Alberto is just high enough to comply, as the barrel moves from the ceiling in their direction- THE ROOM ERUPTS IN GUNFIRE. An easy 50 rounds are punched through him. Filling from the cushions explode into frame and rain down. If there are degrees of dead -- he is the deadest you can be. ROBERT (CONT’D) Thank you. EXT. ALBERTO’S HOUSE -- MOMENT LATER. SWAT and detectives file out of the house, relaxed. Even joking. Ian crosses to Mike. IAN (solemnly) It went well, the way you would want it to go. He got to see it coming. MIKE Good. Mike goes to his car and climbs in. INT. GAELIC BAR AND TABLES -- DAY. Any bar open at 11am is a shithole, and this one opens earlier... Mike sits at the bar. A few newly ex cons drink in the back. The BARTENDER pops another Rolling Rock and slides it to him, even though Mike’s is half full. Mike nods at the gesture. A man sits next to him. Late 30’s. Hollow cheeks. Buzzed head. Russian.  42. RUSSIAN How did this happen? MIKE That’s a really good question. RUSSIAN Who has the money. MIKE Police. RUSSIAN Can you get it? MIKE No. The Russian leans into him. Menacing. RUSSIAN That’s a real problem for you -- Mike has broken the beer bottle across the Russian’s face so fast, only the aftermath is truly visible. Mike is instantly behind him. And slams his face into the bar. The other patrons and the bartender all turn away from the chaos. Easier to say you didn’t see anything when it’s the truth. Mike holds the barely conscious Russian up by his coat. MIKE They killed his wife, found the map and THEN killed my brother. If it is a fuck up, it’s yours. Mitch was off limits. To everyone. Milo wants to blame us for this? I’ll have him killed in his cell before midnight, understand me? He drops the Russian to the ground. MIKE (CONT’D) Anyth",
      "dialogue_count": 0,
      "word_count": 638
    },
    {
      "scene_number": 3,
      "slugline": "EXT. MOUNTAIN ROAD -- LATER. Mike’s Lincoln races through a winding mountain road and disappears around a corner. INT. MIKE’S LINCOLN -- CONT. Mike’s cell phone is on the passenger seat. Ringing. As one call goes to voicemail, another call comes in. He jams the accelerator. Another call to voicemail. A different call comes in... Mike SCREAMS in frustration, in agony... He races faster and faster. We see the RECEPTION BARS ON HIS CELL DROPPING, THREE, TWO, ONE ... SEARCHING. SEARCHING ... NO SERVICE. He notices, lets a sigh of relief, and slows down. He has outrun his world. At least for now ... EXT. MIKE’S MOUNTAIN CABIN -- DUSK. Small log cabin. Just one large room really, kitchen in a corner, closet sized bathroom. Mike sits on the porch. A Bud in his hand -- a dozen empty ones at his feet. The sounds of the forest are soothing. A large Robber Jay is perched on an aluminum trash can lid mounted on a broomstick filled with birdseed. Other birds attempt to land, but the Jay refuses to share. A squirrel appears and the Jay relents, flying to a nearby branch. A sliver of a smile crosses Mike’s face. MIKE Showed him. Something moves in the bushes. Mike hears it. So does the squirrel, who hightails it. Pushing through the brush and appearing not 20 feet from Mike’s porch is a bear.  44.",
      "characters": [],
      "action_text": "Not the monster from his fears ... Small. Emaciated. Dirty. Hungry. Mike is frozen in the chair. Half leaning forward, he looks to the Glock he took from the Crip, sitting beside him on an overturned bucket. Then he looks back at the bear, they lock eyes. The bear is guarded. Timid. He moves achingly slow, toward the trash can bird feeder, never taking his eyes off Mike. He reaches it, and slowly stands up. He is maybe 4 feet tall on his hind legs. Harmless. Desperate. He begins feeding, never taking his eyes off Mike. Mike’s body relaxes, he falls back into the chair and the bear stops eating. Looks, with his simple button eyes. No malice. No judgement. Mike barely smiles, as he begins to softly cry. The bear, calmer now, focuses on his meal ... INT. LIVING ROOM -- MCLUSKY HOUSE -- NIGHT. Mariam sits alone in the living room. No tv. No radio. Silence. She sits in a rocking chair. It seems out of place in the room, as if just placed there for this moment. Which it was. She holds a swaddle blanket folded in her lap. She pets it absentmindedly. No tears. EXT. MCLUSKY HOUSE -- DAWN. Mike’s Lincoln pulls up. He is dressed better now. Navy suit jacket, grey pants. He parks and heads to the front door. Starts to ring the doorbell, then simply pushes it open. INT. FOYER -- MCLUSKY HOUSE -- CONT. The lights are off. The door is open. Not good. He steps cautiously in and begins to look around.  45. MARIAM (O.S.) Dawn. Have you ever once made it home before dawn... MIKE Ma, I don’t ... MARIAM I don’t either son. What is there to say? He’s gone. In the manner we all imagined. This will be your way too, you know. There is no anger in her voice. Only sad, passive truth. MIKE We don’t break the law Ma. You know that. We bend it, to keep the peace. For everybody. MARIAM Oh, I’m very familiar with the process -- your father invented it. And don’t delude yourself into thinking any of this is for the common good. You two have worked extremely hard at accomplishing absolutely nothing.",
      "dialogue_count": 0,
      "word_count": 1027
    }
  ]
}