{
  "slug": "me-him-her-2015",
  "title": "me him her",
  "genre": "romance",
  "format": "film",
  "scenes_count": 2,
  "characters_count": 0,
  "characters": [],
  "total_words": 18798,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. HEATHER’S APARTMENT - NIGHT  HEATHER Frost , 23, covered in tattoos, sexy as hell; she’s a girl who knows what to wear and how to wear it, leaning towards punk-goth...stripper.   She’s arm candy for some rich tattoo artist, or rockstar at a douchebag party. Currently, she’s   being SCREAMED AT   by  GABBI Shaw , 23, petite and lean, very pretty but doing her best to look androgynously masculine.   Gabbi wears a tanktop under a jacket, loose fitting jeans; the quintessential butch lesbian, but with a delicate brightness to her that makes her vulnerable. GABBI How could you do this to me?   I don’t understand!   Explain to me, explain to me how you could fucking do this, are you this fucking broken?   Are you just a, just a fucking sociopath- I don’t understand, I need you to explain it to me.   I’m listening,...Explain it to me. There’s a beat. HEATHER Gabbi- GABBI WHAT!? HEATHER I think you should leave. GABBI You think I should leave?   You think   I should leave , really? HEATHER You know that we’re not exclusive, I don’t feel like I owe you any kind of- GABBI I’m sorry, what. HEATHER What? GABBI We’re not exclusive? 6.",
      "characters": [],
      "action_text": "HEATHER ...no? GABBI Two years- two fucking years of my life- HEATHER I told you I didn’t- I wasn’t ready for a relationship- GABBI  TWO YEARS AGO.   WE LIVE TOGETHER-  HEATHER Then you can move out, I just think- GABBI  You WHORE, I HATE YOU,   I can’t- I can’t even- HEATHER I really think you should go, you’re out of control- GABBI You’re just gonna- no!   You’re not kicking me out because I’m mad at you, I- I have a right- I have   a right-  SMASH TO: EXT. WEST HOLLYWOOD NEIGHBORHOOD - NIGHT Gabbi stalks along alone. GABBI (muttering) I have a right- I have a right, I have a- I- Gabbi squats into a ball on the sidewalk and lets out a long, angry scream.   She slumps down onto her butt, and begins sobbing. INT.   LOS ANGELES INTERNATIONAL AIRPORT - BAGGAGE CLAIM We can’t hear anything over INXS’s “Listen Like Thieves,” and it’s clear why after a moment: Cory is listening to it on his iPod, completely zoned out. 7. He notices his bag, and steps forward, kneeing a little indian girl in the face. CORY OH!   Oh... jesus.   Oh jesus.  SNAP TO: EXT. LOS ANGELES INTERNATIONAL AIRPORT - PICK-UP Cory’s waiting for Brendan’s car, which pulls up; a cool convertible.   Brendan pops open the door, smiling. CORY No fuck that shit get out and hug me.   Get out and hug me, there we go. Brendan and Cory hug. EXT. THE 405 - NORTHBOUND - MOMENTS LATER They’re driving. CORY So where’s the LA part of LA? Brendan laughs. CORY (CONT’D) What’s funny? BRENDAN There just...there are a couple different ones. CORY We’ve been driving for like twenty minutes.   We’d be out of Fort Lauderdale by now. BRENDAN Yep.   LA’s like a jigsaw puzzle that someone forgot to assemble, all the pieces are...spread out on the floor. CORY Wow, this sounds great. A passing car honks wildly, and a hot teen girl leans out. 8. HOT TEEN  BRENDAN!   WE LOVE YOU!  Her friends scream from inside, and Brendan smiles. CORY Is that...does that happen often? SNAP TO: At an intersection, a bunch of black girls cat-calling ",
      "dialogue_count": 0,
      "word_count": 18171
    },
    {
      "scene_number": 2,
      "slugline": "INT. CORY’S APARTMENT - BEDROOM Cory sits in his mostly empty apartment.   Indeed, he’s living out of suitcases.   He stares at them, sitting on his bed, deep in thought. INT. CORY’S OFFICE - NIGHT - DAYS LATER Cory sits in his office, finishing a report.   He finishes, slamming closed his laptop.   He stares up at his eleven employee of the month plaques. He sighes, and looks around. CORY Fuck this. INT. THE ABBEY - NIGHT The Abbey, a super fun gay club in WeHo, is jumping off the hook.   Kris and Laura are cuddling by the bar; Brendan, in sunglasses, grabs them more drinks. Gabbi meanwhile, is dancing close and sexy with that pixie cute girl from earlier.   Lots of women eying her. She breaks from the dance, laughing and smiling flirtatiously, and then makes her way to the bar.   As she does, she gets a text.  HEY.   GABBI.  Gabbi’s eyes widen and she smiles nervously, then more legitimately as she reaches the bar. LAURA What’s up? Gabbi shows her the phone.   Laura actually smiles, but then the phone vibrates again.   She stares at it, and then shows it to Gabbi.  I QUIT. SEE YOU IN TWO WEEKS?  Gabbi stares at it, her face totally unreadable, but the hint of a smile touches the sides of her mouth and- 109.",
      "characters": [],
      "action_text": "EXT. CORY’S OFFICE - PARKING LOT Cory is standing out in the parking lot, in the near darkness, watching his employee of the month plaques burn in a bonfire. The phone in his hand buzzes.  FUCK. YES.  Cory smiles, chuckles, and   jumps into the air!  Freeze on Cory’s Victory jump! Unfreeze! Cory comes crashing back down onto the asphalt, hitting his tailbone really hard. CORY OW!   FUCKING- AHH JESUS, MY ASS! WHAT IS THAT!?   WHAT IS THAT ABOUT!?   I WAS DOING MY JUMP! YOU’RE SUPPOSED TO FREEZE ON THE JUMP, IT’S INSPIRING- SLAM TO BLACK. THE END.  AFTER THE CARDS...  INT. E! NEWS BULLETIN They’re showing a picture of Brendan. E! REPORTER -and E! News was live on the scene to catch every minute. They show footage of Brendan coming out and hugging his parents.   There’s also footage of him hugging Steve and Scotty, who look perturbed, but hesitantly happy and supportive. 110. E! REPORTER (CONT’D) Now that the dust has settled, you’ve gotta wonder who he thinks he is.   An A list player like Ehrlick coming out just reeks of a publicity grab. IDIOT ASSHOLE Yeah, I mean, does anyone really care if Brendan Ehrlick is gay? SLAM TO BLACK.  MIDWAY THROUGH THE CREDITS...  We are treated to promos for the new season of   HARD JUSTICE , as well as an online video entitled “ LESBIAN FREAK OUT REMIX ,” featuring Gabbi and Cory’s fight in Beverly Hills, glitch-beat edited and set to thumping techno music. This was what the guy filming for youtube made.  AFTER THE CREDITS...  EXT. MALIBU - LONELY BEACH - SUNSET The   DOOFY LOOKING GUY   who Cory accidentally slashed at the premiere party is on his knees on the beach, looking into the sunset. He now has a giant, scary scar across his whole face.   He looks forlorn and miserable.   A single tear drops down his face. OLD MAN (O.S.) I know you feel lost, and alone, like there’s nothing to hold on to. But I can give your life new meaning, a new purpose. The Doofy Looking Guy looks up, and sees the Old Man standing on the sand next to hi",
      "dialogue_count": 0,
      "word_count": 627
    }
  ]
}