{
  "slug": "mid90s-2018",
  "title": "mid90s",
  "genre": "comedy",
  "format": "film",
  "scenes_count": 2,
  "characters_count": 0,
  "characters": [],
  "total_words": 14188,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. MITSUBISHI MONTERO - MOMENTS LATER The crew is blasting music and talking shit. Fuckshit is driving fast to impress his friends like teenagers do. Stevie is beaming. This is the most freedom he has ever had. STEVIE (whispering to Ruben) I’ve never been in a car without someone’s mom or dad or whatever. This is AWESOME. RUBEN (baffled/irritated) YO! Keep this shit to yourself, Stevie. Fuck! STEVIE (so excited) Sorry. Sorry. The crew smoke cigarettes and blast music as they drive. EXT. ARCO HANDRAILS - DOWNTOWN LA - LATER THAT DAY Jorge busts amazing tricks down the stairs at the spot. Fuckshit does some slightly lesser tricks but still impressive down the stairs. Fourth Grade is filming Fuckshit and Jorge. Stevie watches Fuckshit watch Jorge land an amazing trick. Stevie clocks this making Fuckshit quietly resentful. Ruben is landing kick flips more and more and they’re getting cleaner. Stevie is practicing his ollies intensely and getting CLOSER to landing one. EXT. ARCO HANDRAILS - DOWNTOWN LA - LATER The crew and Stevie sit on the stairs smoking cigarettes and drinking from gallon waters. They’re mid argument. FUCKSHIT Nigga, fuck you! I think you lost your fucking mind? RUBEN What? You know I got those looks though, son. FUCKSHIT There’s no way in hell you are better looking than me, nigga.  52.",
      "characters": [],
      "action_text": "RUBEN I think it’s close, but I’m maybe a point higher. FUCKSHIT What are you? RUBEN Seven. Seven and a half? FUCKSHIT And what the fuck am I?! RUBEN Six. Six and a half. FUCKSHIT What the FUCK?! Fourth Grade is filming and laughing. FUCKSHIT (CONT’D) You got that little ass crusty ass mustache, son. I think you’re fucking crazy. Jorge? Jorge just gives a cocky smile. FUCKSHIT (CONT’D) You got nothing to say here? JORGE (cocky/you already know) Come on, man. FUCKSHIT What? JORGE You guys can argue over being sixes and sevens all day. FUCKSHIT Oh, and what are you nigga? JORGE (cocky) Come on. Don’t make me say it. FUCKSHIT What the fuck is going on here? You think you’re more attractive than me?  53. JORGE Don’t make me have to make it weird. FUCKSHIT No, what the fuck number do you think you are? Beat. JORGE You’re really gonna make me say it? FUCKSHIT YES! JORGE If not a ten. Incredibly close. FUCKSHIT WHAT THE FUCK?! The crew starts laughing. JORGE No disrespect, but come on, I’m clearly the best looking in the crew. FUCKSHIT Nigga, fuck you! You’re pretty like a girl. JORGE I’m marketable, son. I got those marketable looks. That’s part of why I’m gonna blow up once I go pro. FUCKSHIT DOG. You can’t SAY shit like that! And anyway, you’re pretty like, feminine. Like a beautiful girl or some shit. I’m ruggedly handsome. Young Denzel, son. Got that rugged power. The crew laughs. JORGE Young Whoopi Goldberg, son. The crew laughs.  54. FUCKSHIT HA. HA. You look like Selena, nigga. JORGE You’re just jealous. I got those model good looks, though. Fuckshit actually is jealous, but won’t show it. JORGE (CONT’D) Fourth Grade, what number you think you are? Fourth Grade is filming. FOURTH GRADE (shook up/to Jorge) I don’t... who do you think is better looking, Ruben or new kid? Stevie feels very uncomfortable. He is not comfortable with his looks. He can’t even look at Ruben who is a bit uncomfortable even being compared to the new kid. RUBEN (annoyed at the comparison) Oh,",
      "dialogue_count": 0,
      "word_count": 6542
    },
    {
      "scene_number": 2,
      "slugline": "EXT. ANGELA’S BACK YARD - LATER Now the guys and the girls are a little more intermixed. They are passing around a little pipe with weed in it. Fourth Grade is filming people smoke and hang. Stevie goes to hand Ruben the pipe to smoke. A peace pipe if you will. Ruben coldly turns away, grabs his board and skates away. Stevie gives a “well, I tried” look, and smokes some more. Stevie notices Fuckshit watching Jorge flirt with Angela. She is super into it. She wants Jorge. Stevie sees this really upsets Fuckshit. INT. ANGELA’S HOUSE - LATER The boys and girls have mostly paired up with one and other. Ruben and Fuckshit sit on the couch watching cartoons. They are all high and hazy. Stevie notices Jorge take Angela into a room and how sad this makes Fuck Shit. Stevie and Estee stand by the stove in the kitchen. She is taller than him by at least seven inches. Stevie is fucked up for the first time ever. He doesn’t really know how to talk to her. ESTEE I can’t believe you’re in seventh grade. That is so fucking crazy. STEVIE (looking down) Yeah. It’s cool. I fucking hate it actually. She laughs and so does he. STEVIE (CONT’D) School is the worst shit ever. ESTEE (still giggling) Yeah, it’s a fucking nightmare. Especially middle school. Stevie just kind of nods his head. Doesn’t know what to say. ESTEE (CONT’D) How long have you been friends with Jorge and those guys?  82.",
      "characters": [],
      "action_text": "STEVIE (pretty fucked up) Like a couple months. It’s cool. Fuckshit’s my best friend for sure. He’s so cool.   Fourth Grade is cool, he just doesn’t talk a lot and is always filming the stuff we do. ESTEE Cool. STEVIE Ruben and I used to be homies, but he hates me now I think. ESTEE Why? STEVIE I don’t know. Maybe ‘cuz Fuckshit likes me more now I think. Stevie thinks about this. STEVIE (CONT’D) Jorge is so cool. He’s like, the coolest fucking person. But he probably doesn’t think I’m that cool. Like he probably doesn’t want to be best friends or whatever. She smiles at how cute Stevie is. ESTEE You’re so cute. Angela likes Jorge a lot. Do you think Jorge would actually date Angela or just like hook up with her and then like, not talk to her for like a month until he wants to hook up again? And then, like, pretend to be nice again? Stevie really doesn’t know what to say... STEVIE Uh... ESTEE You’re nicer than those guys. You’re, like, naturally nice. Not like, fake nice.  83. Stevie tries to figure out a response. STEVIE Thank you. You’re nice too. ESTEE You’re like at the age before guys become, like, mean. Stevie looks down and smiles. ESTEE (CONT’D) Have you ever done stuff with a girl? Oh shit. Stevie is nervous as fuck. Pulls it together best he can. STEVIE Yeah. Estee looks at Stevie skeptically but with a sly smile. She’s pretty sure he’s full of shit. She grabs his hand and leads him away... Through the living room, where Fuckshit is watching the cartoon show “Doug” on the TV. Fuckshit and Ruben clock Estee leading Stevie... FUCKSHIT (whispers to himself in disbelief) What the fuck? INT. ANGELA’S PARENTS BEDROOM - A LITTLE LATER Stevie and Estee sit on the bed with the lights off. Only the moonlight shows us anything. Stevie is crazy nervous. After a long silence, Estee leans in and kisses Stevie. They start making out... not in a movie way, but just a long early teenage make out. No music, just sounds of making out. After an uncomfortably long time, she sto",
      "dialogue_count": 0,
      "word_count": 7646
    }
  ]
}