{
  "slug": "midsommar-2019",
  "title": "midsommar",
  "genre": "drama",
  "format": "film",
  "scenes_count": 9,
  "characters_count": 0,
  "characters": [],
  "total_words": 33223,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. WOODS - HÄLSINGLAND - DAY 1   1  Hälsingland, North Sweden. We cycle through a series of beautifully composed midday landscapes. None of them feature people or human habitation. A spare Swedish lullaby plays over this quiet montage. This is the song of the Hårgas. When it concludes, we CUT HARD TO:  EXT. HOUSE - MINNESOTA - NIGHT 2   2  A beautiful suburban home, bathed in vivid moonlight. The neighborhood is very quiet.  INT. BEDROOM - NIGHT 3   3  A MAN and WOMAN (early sixties) lay asleep in bed. They are extremely still. The PHONE rings. The Man and Woman do not stir. After a few rings, the ANSWERING MACHINE takes it. ANSWERING MACHINE (V.O.) Hello. You’ve reached -- MAN & WOMAN (V.O.) -- the Ardor residence. ANSWERING MACHINE (V.O.) Please leave your message at the tone. When you’re finished with your message, press pound. BEEP. Enter the voice of a YOUNG WOMAN: YOUNG WOMAN (V.O.) Hey mom and dad, it’s Dani. Sorry I’m calling so late. I’m just checking in to make sure everyone’s okay. I got kind of a scary email from Terri and it sounded like you guys were having some sort of conflict? Anyway, I just got a little worried, so call me when you can, and if there’s anything I can do, just please know that I’m here. Okay. All right. I love you.  INT. BEDROOM - BROOKLYN, NY -   NIGHT 4   4  The young woman lowers the cell from her ear. This is DANI (25), a beautiful but delicate brunette. She hangs up, and turns to her laptop. An EMAIL from   Terri Ardor , titled   “dear dani,”   is displayed. It reads:  i cant anymore - everything’s black - mom and dad are coming too. goodbye.  Dani stares at this, anxiety rising. She picks up her phone, hesitates, and then calls   Christian.  Four rings. CHRISTIAN (25) answers.   The rest of this scene will be shot in a VERY TIGHT CLOSE-UP of Dani.  CHRISTIAN (V.O.) Hi...!",
      "characters": [],
      "action_text": "Dani affects a care-free tone: DANI Hey baby. What you up to? CHRISTIAN (V.O.) Oh, just smoked some resin at Mark’s and now we’re getting pizza. DANI Oh nice. In the b.g., we hear a young man repeating “hi Dani, hi Dani, hi Dani...” CHRISTIAN (V.O.) Yeah - he’s saying hi right now, over and over. DANI Hi Mark!   CHRISTIAN (V.O.) (off-phone) “Hi Mark.” DANI So I was just calling to see if you were still wanting to get together. CHRISTIAN (V.O.) Oh - did we talk about doing something tonight? DANI I mean, not concretely. I was just seeing. CHRISTIAN (V.O.) (ambivalent) Uh, well - okay. Yeah. I should be able to swing by. DANI All right...!   CHRISTIAN (V.O.) Yeah. Okay... How’s the sister situation? DANI  Well . I’ve now sent her three emails and still no response... I’m starting to get a little nervous. CHRISTIAN (V.O.) I’m sure it’s fine. DANI Yeah. Probably. I hope so. CHRISTIAN (V.O.) She does this every other day, Dani. And only because you let her. DANI Well, I don’t LET her. She’s bipolar. CHRISTIAN (V.O.) I know, but you   do , though, babe. You go straight to crisis mode.  2. DANI Well - but she’s my   sister . And even   you  admit this last email was different... CHRISTIAN (V.O.) Okay, but   is   it, though? It’s still another clear ploy for attention - just like every   other   panic attack she’s given you. Dani looks like she wants to argue with this. She stifles it. DANI Okay. Yeah. You’re right. You   are   right. CHRISTIAN (V.O.) The more you respond, the more she’s encouraged to keep this crap up. DANI No, I   do   know you’re right. I just needed to be reminded. Thank you. I’m really lucky to have you. CHRISTIAN (V.O.) Me too.   DANI (CONT'D) I love you. CHRISTIAN (V.O.) ...So do I. DANI Okay. See you later? CHRISTIAN (V.O.) Yup. DANI Okay. “Bye Mark!” CHRISTIAN (V.O.) “Bye Mark.” DANI All right. Love you. Bye. Dani hangs up. Her eyes are wide with insecurity.  INT. KITCHEN - MINUTES LATER 5   5  Dani stands in the kitchen, mid-phone conversation. FR",
      "dialogue_count": 0,
      "word_count": 1048
    },
    {
      "scene_number": 2,
      "slugline": "INT. PIZZA PARLOR - NEW YORK, NY - NIGHT 6   6  A grubby pizza parlor. Outside the window looms a purple NYU sign. CHRISTIAN, very handsome and fit, sits at a booth. Beside him are his friends MARK (26, droll, shaggy hair), JOSH (27, a skinny, sometimes snobbish academic), and PELLE (26), a nice- looking Swedish exchange student. Pelle doodles on his napkin (drawing the flowers on the table). Mark is currently lecturing a despondent Christian. MARK Dude: you need to stop sitting on the fence with this. CHRISTIAN But what if I end up regretting it a week later, and then I can’t get her back? MARK You don’t   want   her back!   CHRISTIAN (CONT'D) I   might!  MARK So then you can bitch to   us   for that week about how much you regret it, and we'll be like “Dude: you’ve been wanting   out   of this absurd relationship for the last   year ,”   and you’ll be like “oh shit, that’s right” and then you can find some   new   chick who actually  likes   sex and who   doesn’t   drag you through a million hoops a day. Christian is thinking about this. Extremely conflicted. JOSH Do you think a masochistic part of you is playing   this   drama out to distract you from the work you   actually   need to be doing? CHRISTIAN (prepared to be offended) And what work do I   actually   need to do, Josh? JOSH Uhhh - your   prospectus   maybe? I dunno. Your   PhD...?  Christian   clearly   doesn’t want to be told his priorities by Josh. Before he can snap back, an attractive WAITRESS (early 20s) brings over the check. WAITRESS Whenever you guys are ready. PELLE (with Swedish accent) Thank you. She SMILES -- at Christian. WAITRESS Thank   you.  5.",
      "characters": [],
      "action_text": "She HOLDS the smile with Christian and walks bashfully off. Mark definitely caught that. MARK Dude. You could be getting that girl pregnant right now. PELLE And don’t forget all the Swedish women you can impregnate in June. MARK (CONT'D) Yeah, dude - don’t forget all the Swedish milkmaids. Christian’s PHONE rings. He checks. It’s DANI. He deflates. MARK (CONT’D) Who is that? Christian doesn’t respond. MARK (CONT’D) That’s not her again? Seriously? Christian lets the call go. MARK (CONT’D) That’s ridiculous, dude. She needs a therapist. CHRISTIAN She has one. MARK So she should call   him!   That’s insane, dude. She’s using you. The phone starts ringing again. Christian checks it. “ Dani again. ” MARK (CONT’D) Oh my God. Christian answers. He rises from the booth to get some privacy. CHRISTIAN Hello? On the other end: an extended, agonized MOAN. CHRISTIAN (CONT’D) Dani? DANI (V.O.) (distantly) ...no, no, no, no, no, no, no... CHRISTIAN Sweetheart? What’s going on? But now there’s only heavy, frightening CRYING on the other end. It’s a deep, horrible cry. One of pure animal grief. CHRISTIAN (CONT’D) (now scared) What’s happening, baby? Please talk to me.  6. The crying has curdled into a sustained WAIL OF ANGUISH.  INT. GARAGE - MINNESOTA - NIGHT 7   7  The house from the beginning (scene 2). Two CARS are parked. Their engines hum quietly. A FIREFIGHTER opens one car’s door and turns OFF the ignition. We now reveal that the end of a GARDENING HOSE has been taped to one car’s EXHAUST PIPE. A second hose has been taped to the other car’s exhaust pipe. Both hoses TRAIL out of the garage and INTO the house...  INT. HALLWAY - CONTINUOUS 8   8  One gardening hose leads to a BEDROOM DOOR. The door is now open, but the end of the hose has been TAPED to the bottom...  INT. BEDROOM - CONTINUOUS 9   9  The bedroom of the sleeping MAN and WOMAN (in their 60s, from the beginning). It is very clear now that they are DEAD. Two police officers survey the room. HARD CUTS to the man an",
      "dialogue_count": 0,
      "word_count": 5204
    },
    {
      "scene_number": 3,
      "slugline": "INT. OUTHOUSE - CONTINUOUS 26   26  The interior of the outhouse is illuminated by CANDLE-LIGHT. It’s very clean. Dani stands here for a moment. DANI This is a coffin. (immediately reprimanding herself) Hey!   No it’s not.  Dani sees a MIRROR on the wall. She looks at it. Hard. DANI (CONT’D) Fuck you. Stop it. Suddenly her skin seems to take on a translucent quality. Her veins become faintly visible. Beneath her cheeks, it looks like organic gears are turning. DANI SQUEEZES HER EYES SHUT. She takes a moment, trying to will that vision away. DANI (CONT’D) Don’t look in the mirror. It’s not your face. (saying that again, under scrutiny) “It’s not your face.” After a long moment, Dani OPENS her eyes again. When they open, TEN ADDITIONAL EYES open simultaneously - all over her face.   Like spider eyes.  Dani SCREAMS and FLEES the outhouse...  EXT. OUTHOUSE - CONTINUOUS 27   27  Dani runs frantically across the field, desperately wiping off her face (as if to wipe off the extra eyes). We CHASE AFTER HER before CUTTING TO:  EXT. FIELD - SAME TIME 28   28  Christian, Josh, Mark and Pelle are still lying in the same spot. They’ve hit the peak of their trip. Twilight is coming. In the b.g., a group has finished setting up LARGE SPEAKERS. CHRISTIAN Where did she   go?  MARK It’s okay.   JOSH (looking at his hands) Why the fuck do we have fingerprints? Christian STANDS, panic starting to build. CHRISTIAN Dani’s gone. We need to find Dani. JOSH I don’t   feel   like standing.   MARK Yeah - I don’t wanna move. CHRISTIAN Hey! Dani’s our friend!  27.",
      "characters": [],
      "action_text": "MARK She isn’t   all   of our friend. CHRISTIAN What? Yes she is. That’s not nice! Why aren’t you ever nice?! You’re being   mean!  MARK (CONT'D) (scared by this)  What?   I   am   nice. (tearing up) I’m   not   being mean! Droning techno begins to THROB from the speakers in the b.g. With every bass punch, the surrounding environment THUMPS visibly. CHRISTIAN Dani’s our   friend . And she’s   sad . MARK But that makes   me   sad! (suddenly angry) And she’s   NOT   our friend! She’s barely   YOUR   friend! You only invited her because you’re too scared to be  honest   with her! Christian pauses, FURIOUS, and then: CHRISTIAN Her family is   dead,   Mark! Do you get that? They all   died!  MARK (suddenly terrified) Why are you saying that? CHRISTIAN (CONT'D) Because they are! They’re  dead!  MARK Why???   JOSH (insistent)  HEY!   NO!   We need to connect back to the   good   things! This is getting bad! Everything’s alive right   now . CHRISTIAN But that’s just so it can die later. MARK (getting sucked into darkness) Oh God...! PELLE But then it gets reborn! Death is just shit fertilizing crops. Everything gets recycled and made new again. Silence. Everyone looks at Pelle, catching up to what he just said. Christian STOMPS OFF. MARK Wait! Christian! We need to stay together!  EXT. WOODS - SAME TIME 29   29  Dani paces in the woods. Muffled techno drones in the distance. DANI  Hello?! ...   HELLO??!!  (redirecting her thoughts) It’s almost your birthday. Fuck.  (MORE)  28. What time is it? (then, PAUSES) You were almost born... You’re a baby. This gets to Dani. She now looks around the woods, fearfully. Like a lost child. DANI (CONT’D) MOMMY?!... DADDY?!... (silently to herself) Mommy daddy mommy daddy... (panicked now)  CHRISTIAN?!  No answer. DANI (CONT’D) No...no.... You’re alone. Then it HITS Dani. Her eyes well intensely with tears. This idea is now horribly significant. DANI (CONT’D) (a revelation)  You’re alone.  Dani sees a DEAD RABBIT. Its innards are splayed. ",
      "dialogue_count": 0,
      "word_count": 5186
    },
    {
      "scene_number": 4,
      "slugline": "INT. FARMSTEAD - LATER 37   37  Everyone has gathered to either sit in chairs or on the grass. They all face the PROJECTOR SCREEN. Dani, Christian, Mark, Josh and Pelle sit crossed-legged in the front. The PLUMP ELDER stands before the screen to announce: PLUMP ELDER And now, for tradition and for fun: a work of antique escapism - (aside, to our group) - and an annual mood-setter, made by one of our own lost Hårgans! The Plump Elder joins the audience, and the projector starts to RATTLE. Before the film starts, Christian WHISPERS to Dani: CHRISTIAN Happy birthday.  ON THE PROJECTOR SCREEN :   A SILENT COLOR FILM begins. It is weathered and grainy. The film seems to have been made in the late 1960s or early ‘70s (shot on a Bolex camera). The TITLE appears (in Swedish):   A Midsummer Romance  The film opens on a beautiful BLONDE GIRL (15) walking through a field with her friends. They pause to admire a GANG OF BOYS. The girl fixes on one BLONDE BOY (15). It’s love at first sight. The group of girls walks over to the boys. They talk.  INTERTITLE   (in Swedish):   -“Hello lads! Happy midsummer to you.” -”Why thank you, girls! And a happy midsummer to you.”  One of the girls looks mischievously to her friends, and then puts an idea to the boys.  INTERTITLE   (in Swedish):   -”Why don’t you lads come to our house for lunch tomorrow? We will prepare a feast and you can be our special guests!”  The boys look to each other and nod. They agree. The NEXT SCENE depicts the girls gathering FLOWERS from a lush MEADOW. They pick these flowers with their left hand as they walk backwards. We cycle through NINE CLOSE-UPS OF DIFFERENT FLOWERS BEING PICKED.  INTERTITLE   (in Swedish):   Nine Flowers Picked   (don’t forget the Orpine!) , and Nine Fences Jumped.  The girls jump over a series of SMALL FENCES. This is done nine times. The NEXT SCENE reveals the blonde GIRL in her bedroom. She puts the nine flowers under her PILLOW, and then lies down in bed. She closes her eyes to SLEEP.  INTERTITLE   (in Swedish):   With the nine flowers under her pillow, she will now dream of the boy she is to marry.  46.",
      "characters": [],
      "action_text": "The blonde girl has fallen asleep, and a CLOUDY DREAM BUBBLE appears beside her head. Inside the bubble, we are given a scene in which the blonde girl is MARRYING the blonde boy. He lifts her BRIDE’S VEIL to kiss her. The NEXT MORNING the girl wakes up. She wears a wicked smile. LATER THAT DAY, the GIRLS are gathered in the KITCHEN. They are cooking. The BOYS all arrive in the living room. Our blonde girl says “hello” to the boy of her dreams.  INTERTITLE   (in Swedish):   “Hello! Can I bring you some coffee while you wait for your pancake?”  The boy nods excitedly. The girl goes off to the kitchen. In the KITCHEN, the girl takes a CUP OF COFFEE and sets it on the floor. She then crouches over the coffee.  INTERTITLE   (in Swedish):   Three droplets of menstrual blood for the spell to take effect.  Three drops of blood DRIP from between the girl’s legs. They LAND in the coffee.  IN THE AUDIENCE,   Dani and Mark WINCE at this. Christian and Josh (along with the surrounding Hårgans) are delighted.  ON THE PROJECTOR SCREEN:   The girl brings the coffee to the boy. She smiles mischievously as he takes a SIP. In the KITCHEN, the girl now props her leg up onto a chair. She takes a pair of SCISSORS and snips between her legs. She pulls a few STRANDS OF PUBIC HAIR from her groin. The girl CHOPS UP the pubic hair into fine pieces. She then sprinkles them into a BOWL OF PANCAKE BATTER. The batter is then poured onto a burning skillet.  INTERTITLE   (in Swedish):   Hair from the vulva will complete the spell.  The girl hands the boy his PANCAKE. He eats the pancake, and then looks up at the girl. SPIRALS appear in his eyes. Spellbound, he moves toward her, like a love-stricken zombie.  INTERTITLE   (in Swedish):   Voilà! The spell was a success.  The boy and girl KISS in Close-Up. We pull out from the CU to reveal that the girl is now PREGNANT with a grossly distended belly. They are surrounded by a huge and adoring CROWD, all wearing identical clothing. Fade to white.   THE E",
      "dialogue_count": 0,
      "word_count": 8605
    },
    {
      "scene_number": 5,
      "slugline": "EXT. HILL - DAY 67   67  ECU of a BABY BULL’S HIND LEGS, tied together with rope. The rope is PULLED SWIFTLY UP. ECU of a LAMB’S HIND LEGS, also tied together. The rope is yanked up. ECU of a BABY HORSE’S HIND LEGS, also tied. The rope pulls UP. We now cut to a WIDE SHOT of the top of a HILL. NINE ANIMALS (lamb, goat, dog, baby horse, baby bull, baby cow, pig, rabbit, and three tied-together chickens) have been STRUNG UPSIDE-DOWN. They are all alive. Each of them is separated by about five feet. The THIN ELDER stands to the side of the line-up. On the other side is SIV. The entire community has congregated at the bottom of the hill. Dani looks very nervous. She turns to Pelle, who already looks concerned for her. DANI Do I want to stay for this? PELLE ...Maybe you should not. Dani looks to Christian. He looks very excited. She turns back to the top of the hill, anxious. Siv speaks exultantly to the air (in Swedish). When she finishes, STEADY PERCUSSION BEGINS. The Thin Elder strikes a different POSE (physically and emotionally) with every percussive hit. The RED-HAIRED WOMAN, reading from the holy book   Rubi Radr,   begins to SING. As we’ve heard before, it is a WORDLESS choral song. Nine YOUNG MEN, each holding a blade, walk up to the animals. Simultaneously, they all SLIT THE ANIMALS’ THROATS. The animals THRASH wildly as BLOOD drains from their necks. (The song has degraded into anguished snarls and cries.) That does it. Dani STORMS OFF. Christian is too awe-stricken to care. Josh, meanwhile, is taking covert PHOTOS with his phone. Beneath each animal, a narrow CHANNEL has been pre-carved into the earth. Each channel winds and loops to eventually converge, thus forming a MASSIVE RUNIC SYMBOL (symbolizing fertility). The blood pours from each animal to run down the separate canals. Soon, the blood has co-mingled to fill the carefully-engineered runic sculpture. It’s horrible and beautiful. Josh and Christian, briefly joined in their excitement, trade looks of amazement. Mark looks mystified. MARK This is fuckin’ weird, no? Pelle now goes after Dani, who is speed-walking away. In the b.g., Simon can be heard saying: SIMON (O.S.) What the fuck did you bring us to?  75.",
      "characters": [],
      "action_text": "Christian looks over at this. SIMON, who looks very scared, is confronting a grinning Ingemar. SIMON (CONT’D) (to Ingemar, aggressively) Why are you smiling, mate?  EXT. FIELD - SAME TIME 68   68  Dani speed-walks (with intermittent running) toward the Main House in the distance. Pelle follows her, glancing over his shoulder to view more of the ceremony.  INT. THE MAIN HOUSE - MINUTES LATER 69   69  Dani enters the Main House, eyes crazed. She goes to her bed and begins hastily packing her bag. Her breathing is erratic and she’s pulling at her neck again (as if to loosen the skin). Pelle enters. PELLE Dani? Dani looks up, teeth chattering with anxiety. DANI I’m really sorry, Pelle. Thank you for inviting me, but I really need to go. Can someone maybe drive me? PELLE (CONT'D) I did warn you this time. I know it looks extreme, but we only do this once every ninety years. It’s - what’s the word...? DANI I understand that it’s momentous. PELLE (that was the word) Right! Exactly! DANI (snapping)  I don’t know why we’re here, Pelle!   I don’t know   why   you invited us! PELLE (CONT'D) Okay: Here: Sit down. Please. He sits Dani down. He plants himself beside her, taking her hands. PELLE (CONT’D) I invited my friends because this is a once-in-a-lifetime   thing   and I wanted to   share   it. Especially with my friends who I   knew   would appreciate it, because I   am   proud of this place. DANI But I’m   not   an anthropologist. I   don’t  have the foundation to understand this. PELLE And yet I was the   most   excited for  you   to come.   *  Salmon Rev. (mm/dd/yy)   76. Pelle has pulled a special POUCH from his pocket. He draws   *  something out.   *  PELLE (CONT’D)   *  Here: smell this. He places a homemade sachet (containing a SPECIAL HERB) under   *  her nose. DANI What is it? PELLE It calms you down. She pauses before smelling it. PELLE (CONT’D) Go on. Inhale. I will, too. Demonstrating, he INHALES the herb deeply. He puts it back to her nose, and she does the sa",
      "dialogue_count": 0,
      "word_count": 5692
    },
    {
      "scene_number": 6,
      "slugline": "INT. SMALL ROOM - CONTINUOUS 93   93  A spare room. Two chairs face each other in the center. Siv takes a seat in one of them. SIV Please. Sit. Christian obliges. Siv’s posture is perfect. Christian self-consciously corrects  his   posture. A long silence, and then: CHRISTIAN I just need to say, I have no idea where Josh went, and I can swear to that on my mother’s life. SIV How do you feel about Maja? Christian pauses. CHRISTIAN About Maja? Siv’s lack of response says “yes.” CHRISTIAN (CONT’D) How do I feel about her   how?  SIV You have been approved to mate with her. You’re an ideal astrological match and she has fallen in love with you. CHRISTIAN We haven’t even spoken. SIV She fell in love with you before you came. Pelle showed her a photo. CHRISTIAN (pause) I have someone here with me. I’m with Dani. SIV Dani will not know. I am not proposing marriage. You wouldn’t be approved for that. CHRISTIAN So...you’re asking me to what? SIV I’m asking you if you care to mate with Maja. It is a one-night offer. CHRISTIAN ...She’s very beautiful. SIV She   is   very beautiful.  96.",
      "characters": [],
      "action_text": "CHRISTIAN I think I ate one of her pubic hairs. SIV That sounds probably right. Beat. Christian doesn’t know what to say. SIV (CONT’D) From an academic perspective, it would also serve as a unique glimpse into our sexual rites. CHRISTIAN Can I not have a unique glimpse with out   participating? Siv smiles at the silly question. CHRISTIAN (CONT’D) Can I think about it? SIV You can think about it here. Tonight is the time of alignment. Then it’s done. A long, conflicted pause. CHRISTIAN I don’t think I can. SIV Okay. Is that your answer? Christian hesitates. He’s very torn.  EXT. SMALL WHITE HOUSE - MINUTES LATER 94   94  Christian emerges from the house in a daze. We track back with him. His eyes are fraught as he wrestles with the moral quandary. But as he continues to walk/think, a vague SMILE sneaks onto his face. Christian looks forward to see the DANCE COMPETITION in the distance. He’s walking toward it.  EXT. FIELD - SAME TIME 95   95  Dani is still engaged in the dance. It’s a dizzying spectacle, and the mounting hallucinations are clearly taking their toll on the dancers. The music STOPS abruptly, and everyone FREEZES. LARGE WOMAN (in Swedish) Around! Everybody turns around to face the OPPOSITE DIRECTION. They switch hands, and the music RESUMES. They now dance in the opposite direction. One woman STUMBLES to her knees, laughing. She is now disqualified. She walks off to sit on the grass and watch.  97. Another WOMAN pulls out of the circle to RETCH nearby. She is also disqualified. Dani, who was having fun, is suddenly disturbed by the retching sound. She feels sick for a second. DANI (thoughts turning) Josh...? The Blonde Woman turns happily to Dani. BLONDE WOMAN Don’t slip! Dani looks to her. BLONDE WOMAN (CONT’D) Can you holding on?! Dani gets a second wind. She’s back. Maja, who is dancing in the outside circle, sees CHRISTIAN arriving. He joins the onlookers. Maja   decisively   feigns COLLAPSE, opting out of the dance. She stumbles over to the onlooker",
      "dialogue_count": 0,
      "word_count": 3124
    },
    {
      "scene_number": 7,
      "slugline": "INT. CARRIAGE - CONTINUOUS 96   96  Dani takes a seat. Outside, several YOUNG WOMEN (including the RED-HAIRED WOMAN) have gathered in front of the carriage. They each take hold of RODS, prepared to pull the carriage. A few other women have gathered to the sides of the carriage. They hold juniper boughs and unlit torches. One girl goes around, IGNITING their torches.  EXT. FIELD - SAME TIME 97   97  Most of the community remains standing at the dining tables. They WATCH as the women pull the carriage away. Christian watches, too. Guilt-ridden. He looks to SIV. She looks unblinkingly back.  INT. CARRIAGE (MOVING) - MOMENTS LATER 98   98  Dani looks out the window as the carriage is pulled through the WHEAT FIELDS. The accompanying women WAVE their torches about, casting away dark spirits.  EXT. FIELD - SAME TIME 99   99  A GIRL begins scattering flowers to create a NEW PATH. This is between Christian and the TEMPLE. All eyes are now on him. Christian, frozen for a moment, RISES. He takes one abrupt step forward, and then continues warily toward the Temple.  INT. TEMPLE - CONTINUOUS 100   100  Christian enters the foyer of the temple. The temple doors are closed. A BEARDED MAN IN A DRESS stands in waiting. He hands Christian a WHITE GOWN. BEARDED MAN IN DRESS Put this. The man gestures to a MODESTY PANEL in the corner (behind which Christian can disrobe).  EXT. WHEAT FIELD - SAME TIME 101   101  The women pulling the carriage have slowed to a STOP. Dani is directed by the Red-Haired Woman to step out. She is handed a flaming torch, and led to a small HOLE in the ground. Dani is handed a sack of GRAIN, a raw STEAK, and an EGG. She is directed to pour the grain into the hole, which she does, and then to drop the steak over the grain. She does this, too. She is then instructed to crack the egg and pour its contents into the hole. The Red-Haired Woman now affects perfect posture. Dani instinctively mimics this. RED-HAIRED WOMAN Repeat now after me. Dani and the Red-Haired Woman are looking directly into each other’s eyes. The Red-Haired Woman begins to SING very slowly, enunciating very carefully, and Dani SINGS ALONG (quite well):  106.",
      "characters": [],
      "action_text": "RED-HAIRED WOMAN (CONT’D)  Vakna upp, vakna upp, både åker och äng Nu har du sovit länge i din säng Nu är det över med snö och med regn Nu har sommarnatten kommit.  The Red-Haired Woman is impressed. As are the onlooking young women. The hole is COVERED UP with soil.  INT. TEMPLE - FOYER - SAME TIME 102   102  Christian has changed into the WHITE GOWN. He steps nervously out from behind the modesty panel. CHRISTIAN What now? The Bearded Man in the Dress holds up a STONE POT. He lifts off the lid to release a WAVE OF STEAM. BEARDED MAN IN DRESS Breathe in. CHRISTIAN What does it do? BEARDED MAN IN DRESS For your vitality. Christian BREATHES IN the vapors. His eyes begin to cloud. He EXHALES heavily. He’s already feeling the effects. His breathing becomes shallow. The Bearded Man now OPENS THE DOORS to the temple.  INT. TEMPLE - CONTINUOUS 103   103  It is dark, save for several burning candles.   *  In the center of the room, lying on a bed of freshly cut   *  birch twigs and WILD FLOWERS, is   MAJA . She is NUDE, lying on   *  her back, legs together. Several OLDER WOMEN, mostly in their 30s and 40s (a few in their 50s and 60s), stand at the back of the room. They are also NUDE. Christian is too stoned to react. He regards the room as he would a dreamscape. Ceremonial MUSIC begins. A few women, reading from the   Rubi Radr , SING in the Hårgas’ wordless, groaning, microtonal tradition. One Woman steps up to draw Christian’s gown OFF of his shoulders. He is fluidly DISROBED. Now standing naked (and erect), he is directed towards Maja, who waits nervously. Christian seems to LEVITATE half-an-inch off the ground and then FLOATS gently across the room (clearly a product of the escalating hallucination). As he approaches Maja, the singing intensifies. Maja’s LEGS timidly PART. Christian, now standing at her feet, looks down at her. Her eyes are closed as she waits to be taken.  Salmon Rev. (mm/dd/yy)   107.",
      "dialogue_count": 0,
      "word_count": 726
    },
    {
      "scene_number": 8,
      "slugline": "EXT. CATTLE HOUSE - SAME TIME 104   104  The sun is less intense now. It is nearing twilight. The carriage has pulled up to the cattle house. Dani, holding a torch, proceeds to bless the livestock (according to the Red-Haired Woman’s instructions).  INT. TEMPLE - SAME TIME 105   105  Christian has descended to his knees. He sits between Maja’s legs, preparing himself. He looks extremely intoxicated. Maja’s eyes are squeezed shut as she anticipates what’s coming. Christian awkwardly leans down to gently KISS her lips. Without opening her eyes, she kisses back - slowly, sensually. The singing rises and falls (out of harmony) with trembling impatience. Christian gently presses himself into Maja. Her mouth opens in anticipation. He ENTERS her. Overwhelmed, Maja digs her nails into his back. Her eyes well with tears. Christian looks unsettled, but he continues... Christian is now MAKING LOVE to Maja, very slowly - almost robotically. She lies motionless, mouth agape. She doesn’t move a muscle, nor does she make a sound, but her expression is one of total, paralyzed ECSTASY. The singing has now HARMONIZED. The Older Women watch this with rapt attention. They are clearly aroused. The lovemaking is dreamily slow. The singing rises steadily. Delayed percussion accompanies each heavy, lagging THRUST. Maja looks back at one of the WOMEN (50s). The woman smiles tenderly at her. This would be touching if it weren’t so   weird . Maja offers the woman her HAND, and the woman supportively takes it into   her   hands. The woman lovingly presses her CHEEK against Maja’s open palm, CARESSING her face.  EXT. FARMSTEAD - MOMENTS LATER 106   106  The carriage has returned to the farmstead. Dani steps uneasily out of the wagon, still under the warping influence of the hallucinogen. The SINGING is heard faintly from the Temple. RED-HAIRED WOMAN We shall go now to Siv’s house. DANI What’s there? RED-HAIRED WOMAN It is a special meeting, only for the Queens. She will bless you. The distant singing persists. Dani looks to the Temple. She seems DRAWN to it. DANI What about there? RED-HAIRED WOMAN Not for us. Dani, attracted by the singing, takes a few steps toward the Temple. The young women look very concerned. The Red-Haired Woman steps up to STAND IN DANI’S WAY.  108.",
      "characters": [],
      "action_text": "RED-HAIRED WOMAN (CONT’D) I think you should not. DANI ...Why? The Red-Headed Woman is not convincing when she says: RED-HAIRED WOMAN It is a ceremony for the men. Dani is now very suspicious. Her expression begs “ What is it really? ” The Red-Haired Woman’s expression says that it’s something that would hurt Dani. The woman’s expression pleads: “ Don’t go inside. For your own sake.”  Dani’s eyes NARROW with paranoia. Now she   must   enter. She PUSHES ahead. The women remain where they are, very worried.  INT. TEMPLE - FOYER - CONTINUOUS 107   107  Dani enters the foyer of the temple. Beyond the closed doors, the singing has reached an operatic intensity. Dani takes a moment to gather herself, and then she bends down to peer through the door’s KEYHOLE. Through the keyhole, Dani sees Christian’s BACK as he “makes love” to Maja. The surrounding women have fallen deeper into their trance. Dani’s eyes go WIDE with horror. Stunned, Dani backs away from the keyhole. She suddenly doubles over and RETCHES. She rushes out of the temple.  EXT. TEMPLE - CONTINUOUS 108   108  Dani runs outside. She VOMITS onto the grass. She’s in a state of shock. Her breathing is shallow and she looks anxiously around, as if confused as to her whereabouts. The young women rush over to Dani. They surround her, touching her, rubbing her. Dani CAN’T BREATHE. She’s panicking. The Red-Haired Woman directs the women to LEAD Dani to the Main House. They all hurriedly guide her in that direction.  INT. MAIN HOUSE - CONTINUOUS 109   109  The young women usher Dani to her bed. They sit her down, gathering intimately around her. Dani struggles increasingly to breathe. The Red-Haired Woman HOLDS Dani’s FACE in her hands. She locks eyes with Dani and affects DEEP BREATHING. Dani’s eyes, unwilling to settle at first, gradually become FIXED to the Woman’s. The Woman continues to affect deep, measured breathing. Dani struggles to follow her. Her breathing trembles to meet the Red-Haired Woman’s example. Fina",
      "dialogue_count": 0,
      "word_count": 3110
    },
    {
      "scene_number": 9,
      "slugline": "INT. SACRED HOUSE - SAME TIME 120   120  The fire has grown considerably. Inside the bear, Christian is now being steam-boiled in the animal’s fluids. The bear’s FUR begins to catch fire. Before long, the whole animal is swallowed in the blaze. Christian’s wretched face becomes invisible behind the flames. Ulf and Ingemar (still smiling) watch this with detached fascination. The fire has now spread to other piles of hay. It has begun to crawl up the walls of the house. Ulf is suddenly consumed by flames. He SCREAMS!  EXT. FIELD - SAME TIME 121   121  Ulf’s screams are heard from the Sacred House. Suddenly, every member of the Hårgan community (who is   not   singing) begins to SCREAM as well. Feeling Ulf’s pain, they emit a horrible chorus of wails. When Ulf’s screams die down, so do theirs. Meanwhile, Ruben has been given paper to PAINT on .   Two elders encourage him. DANI, watching the burning house with fraught eyes, is suddenly met with a wave of conflicting emotions. Her expression curdles into one of sheer HORROR and DISGUST. Then it becomes one of deep SORROW and SHAME. Her eyes well with tears. The singing has now HARMONIZED and has risen to an insane, operatic pitch. We cut to an immense WIDE. Dani’s back is in the f.g. and the burning house is in the b.g. Overcome, Dani buries her face in her hands. Breaking into gentle sobs, she begins to walk aimlessly to the side. We TRACK alongside her, keeping her centered. She is circling the house, pulling at her hair and face in increasing anguish. She is WEEPING now, and the house (ever- present in the b.g.) has become ENGULFED in the raging flames. Dani begins MOANING and SCREAMING. Her howls almost harmonize with the singing in the b.g. The fire ROARS and CRACKLES in the distance. It’s apocalyptic. Soon it’s uncertain whether Dani is crying or LAUGHING. Her legs become weak and she collapses to her knees. Four Hårgans (one of them being Pelle) run into the scene, carrying a LARGE CHAIR - Dani’s throne. The Hårgans lift Dani by the arms and SEAT her in the throne. They then HOIST the chair into the air. On the upward LIFT, we cut to a tight CLOSE-UP of Dani’s face. She is being carried forward. Her expression, which begins as one of great distress, slowly starts to TURN. Her agony subsides into sudden CONFUSION.   What’s happening? Where am I? I’m on this chair, being carried!   Her expression goes from FEAR to EXCITEMENT to CONFUSION again. She suddenly lets out an abrupt LAUGH (which we can’t hear over the music and the now-deafening FIRE). Dani is now being taken over by an   *  invading sense of pride and contentment. This soon evolves into a manic exhilaration. Dani BEAMS. She has been embraced by a new family. She is Queen. She is not alone.  Salmon Rev. (mm/dd/yy)   116.",
      "characters": [],
      "action_text": "A SMILE finally breaks onto Dani’s face. She has surrendered to a joy known only by the insane. She has lost herself completely, and she is finally free. It is horrible and it is beautiful. CUT TO   BLACK  117.",
      "dialogue_count": 0,
      "word_count": 528
    }
  ]
}