{
  "slug": "miles-ahead-2016",
  "title": "miles ahead",
  "genre": "action",
  "format": "film",
  "scenes_count": 8,
  "characters_count": 0,
  "characters": [],
  "total_words": 21749,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. MILES DAVIS' MANHATTAN HOME - DAY  Black.  Then a frozen image - MILES DAVIS (DC), 29, full youthful  glory, on stage on a soundstage, at the mic, in front of the  first great sextet, 1955, beautiful. The image begins to  move, fast forward, whirs (stock), images blurring by to a  performance, many years later -  CREDITS ROLL  MILES DAVIS, 53, speaks in his cool rasp. You have to lean  forward to hear. He really knows how to make you listen.  MILES (O.S.)  This one. Right here...  The tape slows, plays at regular speed. DAVE BRADEN, 38,  speaks.  DAVE BRADEN (O.S.)  Ok. Agartha...  MILES (O.S.)  Osaka, Japan. - '75.  \"Prelude 2 Agharta\" plays. Funky. Nasty. Gutbucket bass,  guitar...  SUPER:   Prelude   Fades up. Fades out... (NOTE: All SUPERS in  the script are Miles Davis songs)  ON STAGE: A trumpet player stands at the center, the hub of a  quintet. Tilt up to reveal: MILES DAVIS, 48, adorned like a  psychedelic pimp-god. Hunched over, horn bell pointed at the  floor, soaked with sweat, his back to the audience,  iconically Miles, searching for something buried in the  music.  DAVE (O.S.)  Funky...  MILES (O.S.)  Yep... Cut the sound down...  TECHNICIAN (O.S.)  Couple more minutes here guys.  DAVE (O.S.)  No, other side, Nick.  A GEAR BELLY wipes frame -",
      "characters": [],
      "action_text": "PULL BACK FAST, 70s style, focus and refocus, revealing Miles  Davis, looking a little older, but clean as grandmom's  chittlins. He sits in a chair while the interview is set-up.  Miles holds a RED TRUMPET, a small mic attached to the bell.  IN THE ROOM   - He noodles on the horn, intermittently playing  with the music during the conversation. (Throughout the  interview the camera plays a modal phrase, its attention  between Miles   here   and the Miles   there   in Japan).  IN JAPAN   - Miles straightens, looks out into the crowd; we  see FANS grooving to the rhythm reflected in HIS SHADES. HIS  POV: a dark void, flashbulbs, shadows, a crowd of   unseen  fans. He starts to play again but stops -   for the first time  in thirty years not knowing what to say . We see the moment  from multiple angles and angels. From high up, Miles looks  small.  Miles looks to the wings, searching... for someone among  those standing around, and beyond... a face he cannot find...  REVERSE ANGLE - POV of Miles from an empty void in the wings,  CAMERA moves a little. Alive...  TWO SHOT   - Miles here and in Japan.   Japan Miles is sitting  over ‘79 Miles’ angel shoulder, but no longer playing in his  ear.  DAVE (O.S.)(CONT’D)  So, Miles, I know it’s always “go  forward, go forward”, but even if  just for   context   we have to get  into (explore) your earlier stuff  and modal jazz’s influence -  MILES  I don't   like   that word; \"jazz\"  DAVE (O.S.)  Nope, I...  MILES  (helping them to “get it”)  That's a made up word. Tryin' to  box somebody in.  (get it)  Don't call my music   jazz .  DAVE (O.S.)  Right .   You refer to it as the music  of the times....  MILES  Social   music.  2 DAVE (O.S.)  Social music. Perfect.  On TV, Miles mashes out an atonal chord with his right hand  and cranks the volume louder and louder, silencing the band.  As the din of the chord reverberates, recedes, he  contemplates the trumpet’s bell, etched with a curvaceous  scroll, his name in bold, flickering b",
      "dialogue_count": 0,
      "word_count": 5054
    },
    {
      "scene_number": 2,
      "slugline": "INT. COLUMBIA RECORDS/ELEVATOR - SAME  Miles sits back against the rail - what these muthufuckas  just made him do. His hip now. Dull persistent ache. Can't  escape himself - his music: the be-bop, uptempo \" Tempus  Fugit \" mocks him from the speakers as a collage of Columbia  covers/artists silently study him. Chief among them is  Frances, again - on the cover of \"Someday My Prince Will  Come\". He wants to look at her, but doesn't, won't...but  she's looking at him. Miles pushes at the back wall of the  elevator and it rolls back on casters opening onto -  INT. LOS ANGELES CLUB - NIGHT 1957  A small group playing on stage, seen from the wings. The  CAMERA moves around the band members - winds, brass, drummer,  the pianist and eventually comes around finding Miles Davis,  18 years younger,   stepping up to the mic, center stage,  killing it   in   this intimate venue. Watch him blow.  SUPER:   Tempus Fugit   Fades up. Fades out...  INT/EXT. CONVERTIBLE CAR - LOS ANGELES 1957 NIGHT  Buddy, 30s, drives. Pretty NORA, black, 20s, up front with  Buddy. Miles, stylish, hair done in a marcel process, is in  back with his beauty, AVA, 20s, white. Miles is high, you can  see that shit in his eyes. Laughs and good times all around.  Ava stands, arms raised, all sexy abandon, starts screaming  as loud as she can. Miles pulls Ava back down, rubber necks  for cops. Zoom...  EXT. FRANCES’ HOUSE - NIGHT  Buddy pulls over to the curb, parks.  BUDDY  Gotta give this little bird a thing  for my friend. Be right back.  Gets a Tiffany's box from the glovebox. Buddy exits the car,  crosses the road to a small APARTMENT BUILDING, open air,  California-style, rings the buzzer.  Miles' attention is snatched away from Ava as Frances appears  at the top of the landing of her building. She walks down the  stairs - those legs. The first time he's laid eyes on her.  Takes his breath away.  23",
      "characters": [],
      "action_text": "As Ava and Nora talk, Miles gets out of the car, leans on it,  lights up a cigarette.  Buddy and Frances greet, he gives her the Tiffany's box,  she's pleased, thanks him, they chat a minute, but her eyes  find Miles across the street, and they lock in a forever  moment sealing their future. Miles turns back to the car,  masking the following: Miles dips into his pocket, comes out  light, only a couple singles.  MILES  (smiles)  Ava, Let me hold Mr. Jackson.  AVA  (giggles)  Sure, Miles...  Ava hands Miles a $20 bill.  MILES  And, hand me that pen.  Ava reaches into her purse, hands Miles her pen. He drops his  cigarette, grinds it out as he strides across the street.  Buddy turns to walk back, Miles passes him and steps up to  Frances.  MILES (CONT’D)  Hi. I'm Miles Davis.  FRANCES  I know. - Frances Taylor.  Miles pulls out the $20, writes his details on it, holds it  out.  MILES  Now you don't have to stare.  Frances smiles, shrugs, let’s him just hang for a beat before  eventually taking the bill. Miles   smiles,   turns,   walking back  to the car cool as shit. Somewhere a phone rings.  MILES (V.O.) (CONT’D)  Hello?  FRANCES   (V.O.)  (soft, smoky)  Come watch me dance, Miles.  24",
      "dialogue_count": 0,
      "word_count": 541
    },
    {
      "scene_number": 3,
      "slugline": "INT. NYC THEATRE/GRAND THEATRE - DAY  Miles steps into the shadows of the wings, smoking a  cigarette, digging the PORGY AND BESS rehearsal; for him it's  all about the lead dancer: Frances.  Standing by Miles is his close friend and arranger, GIL  EVANS, 40s - white, rail thin, a natty argyle style,  contrasting Miles' finely tailored Italian suit.  Frances is playing Bess - lusty, steamy in her moves. She  inspires Miles, she seems to be looking right at him, dancing  just for him - it's all over his face, he's falling in love.  His inspired eyes drift to the TRIO; he ZOOMS IN ON the piano  keys, the ways the musician moves, collecting, co-opting -  and then back to FRANCES, the key to it all -- dancing a sexy  pas-de-deux with the chiseled, handsome LEAD DANCER; Miles  clouds over.  Fran stops the music with a wave of her hand.  FRANCES  Hang on. Let’s do that last section  again. From the diminuendo?  CHOREOGRAPHER  Sure.  Frances cues the pianist, they begin again.  Miles clocks a couple white men (producers/financiers) ,  looking, in Miles’ mind, at Frances like he does - with  desire; he's suddenly jealous knowing the men can see up her  skirt as it flies and flutters around her.  Miles looks threatened, angry, his gut turning, surprised by  his reactions, all new for him, this obsessive desire to  possess   a woman.  Frances spies Miles in the wings, and locks in, relishing her  power over him. She purposefully pushes away from her partner  and pirouettes in Miles’ direction, using him as her spot.  Almost there, she trips... Miles grabs for Frances, but  BEFORE he catches her -  INT. COLUMBIA RECORDS/STAIRWELL - DAY  Dave surfing/tripping down the stairs, “ completes”   Frances’  fall but now in ‘79. Dave hits the landing hard.  DAVE  Ow. Shit -  25",
      "characters": [],
      "action_text": "He scrambles to his feet, continues limping, down the flight  of stairs.  INT. COLUMBIA RECORDS/LOBBY - CONTINUOUS  Miles exits the elevator as Dave emerges from the stairwell,  trailing Miles through the lobby and eventually outside.  EXT. COLUMBIA RECORDS BUILDING - CONTINUOUS  Dave bolts from the building, gets to the car as Miles get  in, the Jag a little boxed in by parked cars -  DAVE  Hey, I got you, it's cool, I'll  drive.  Miles shuts his door. Dave talks through the closed window.-  DAVE (CONT'D)  Look, I should've told you what was  up right off -  Miles sticks the key in the ignition, cranks it but the  ignition won’t turn over -  DAVE (CONT'D)  Look, I understand where you're  coming from with those guys up  there -  The car finally roars to life and Miles put it in reverse  preparing to pull out. Dave rushes in front of the car,  making his case through the windshield.  DAVE (CONT'D)  - it's never enough, right! They  just suck you dry and fuck you  over!  INT/EXT. JAGUAR - CONTINUOUS  Miles looks back to check behind him, the turn itself hurting  - that hip's a bitch today -- and no medicine yet - fuck!  Dave clocks it.  DAVE  Listen, listen, listen, listen -  Sidling up.  26 DAVE (CONT’D)  - fuck the interview, okay? Let's  get   right.   I know what you need,  man. Let me get you   right !  Miles looks at him sideways, eases off the gas a bit.  DAVE (CONT’D)  (mouthing big)  I probably shouldn't shout this  next part.  Dave gambles, creeps around to the drivers side, motions  Miles to crack his window --  DAVE (CONT’D)  I know a guy, gets it like, whooo,  from the root, it's good, not  stepped on, we can go right now.  Beat. They stare at each other. Then Miles gets out of the  car. Dave steps back, makes space for this pissed off man  with a gun.  MILES  You're a crazy, white motherfucker,  you know that?  DAVE  Yeah, I know.  Miles crosses around the Jaguar, gets in the passenger seat.  Daves looks in at him -  DAVE (CONT’D)  So...?  Dave gestures",
      "dialogue_count": 0,
      "word_count": 8368
    },
    {
      "scene_number": 4,
      "slugline": "INT. CELLAR - CONTINUOUS  Junior hits the exit door but the thing won’t budge. When he  turns Dave is running up, inadvertently cornering this  panicked kid with the gun, the busboy stacking boxes seeks  cover.  DAVE  Hey, take it easy!  JR  So what, you gonna shoot now me  over a fucking tape?  DAVE  What?   No, man, he just wants to  talk -  Not shooting? Great. Junior throws a crushing right hook,  connecting with Dave's jaw- Dave stumbles backward - drops  the gun - it goes skittering off. Junior hits him again -  Dave smashes into stuff, recovers, lands two solid punches on  Junior, stunning the kid, pleasing himself. Junior returns  with a combo that lays Dave out.  Junior picks up the gun, stands over Dave (like Miles stood  over Dave with a gun at their initial meeting at the house) -  when Miles comes up behind Junior and puts cold steel to the  back of Junior's head - his mouthpiece. Junior stops cold.  JUNIOR  Okay, okay, be cool...  - Miles reaches around and takes his gun back from Junior.  Junior turns to see Miles - and that he just got played with  that mouthpiece. Damn. Miles pushes him in his back and he  goes tumbling into some boxes in the corner out of breath.  Miles closes in, Dave flanks.  DAVE  Where the fuck's his music, man?  MILES  Lie to me, I'll kill you.  Junior let's out a sigh, a deep, guilty sigh.  JUNIOR  I got it. But I swear, Mr. Davis, I  was just trying to help.  MILES  Don't tell me the lies you tell  yourself. You're a hype.  65  (MORE)",
      "characters": [],
      "action_text": "I can see that shit in your eyes.  George put you up to this.  JUNIOR  Geor- ?   No, Harper just thought -  Waitaminute ,   first lemme tell you  something   - This cat right here is  a crook, Mr. Davis. He was gonna -  DAVE  Ha!   Says the thief.  JUNIOR  You're the fucking - Mr. Davis,  believe me, he's -  MILES  Shut the fuck up. What Harper give  you to snatch my music?  Junior stammers, feeling stupid.  MILES (CONT’D)  Answer me!  JUNIOR  Nothing. Just a... a chance to  maybe get to work with you, you  know. Help you come --   back .  MILES  Right. ‘Cause you just the hype  with the heart of gold, huh?  JUNIOR  (salty)  Yeah. You remember that move,  right?  Miles gestures to the door with the .38 and the trio head  toward the stairs, Dave and Junior glaring at each other.  INT. VANGUARD - CONTINUOUS  The band, crowded around the door scurry back, clearing a  path for the three guys. Junior goes to the stage, grabs his  horn and case.  MILES  And don’t play E flat over that D9.  JUNIOR  Huh?  66  MILES (CONT'D) MILES  You played E flat over that D9.  JUNIOR  So what?  MILES  So don’t. That’s Dm9. And only  sometimes .  Junior snaps his case closed, looking irked.  JUNIOR  I can play Eb there, it’s just a  voicing   thing.  MILES  Man, you don’t know shit.  Miles pushes Junior toward the door.  EXT. TENEMENT BUILDING - A BIT LATER - DAY  Sketchy hood. Jaguar parked at the curb. Miles, Dave and  Junior get out. Passing a couple drunks paper-bagging it, and  a TAGGER, hitting up Dali-esque Miles,   prettying up   the  grime. Seminal Hip-Hop coming out of windows, or is that  modern Jay-Z on the reel to reel?  Miles, Dave and Junior enter the rundown building -  EXT. TENEMENT BUILDING - CONTINUOUS  They take the stairs. Junior puts his key in the door and  opens it - enters the apartment with Miles and Dave.  INT. JUNIOR’S APARTMENT - CONTINUOUS  The place is a little ransacked. Hear CHERYL (2 year-old  girl) crying in the bedroom. Junior quickly heads into the  be",
      "dialogue_count": 0,
      "word_count": 2244
    },
    {
      "scene_number": 5,
      "slugline": "INT. MILES DAVIS' MANHATTAN HOME/LIVING ROOM - SAME  Heavy breathing from both of them, Frances stands over Miles  as he grits his teeth to stand - can’t quite manage yet, that  hip again, throbbing. Frances doesn't offer to help.   Is that  a smile?  Long pause as Miles stands, extricates himself from the  rubble, straightens his clothes, hair. He turns, goes...  An ashtray whizzes by his head and smashes into the wall.  Miles just keeps walking.  Frances puts her face in her hands and weeps.  INT. MILES DAVIS' MANHATTAN HOME/RECORDING STUDIO - MOMENTS  LATER  Miles enters. You can faintly hear her weeping upstairs until  the door closes. He’s looking at his band, “are you my ‘so-  called friends’?”  HERBIE  You okay, Miles?  Miles glares at Herbie. He could kill somebody, or he could  pick up his horn, which he does - sees Frances on the  \"Someday My Prince Will Come\" gold record framed on the wall.  He blows fire. Fueled.  INT. MILES DAVIS' MANHATTAN HOME/BEDROOM - NEXT EVENING  An empty bottle of wine and a glass on the night table.  Frances wakes in bed from a nap, surrounded by presents.  Emerald ring, sapphire bracelet, mink coat, clothes...  Miles is peeking around the circular wall quietly watching  her...  She spots Miles and when she turns further, he sees her black  eye, it jolts him.  MILES  There's a... necklace in there.  Frances nods, cold, unmoved by the gifts - shell shocked.  MILES (CONT'D)  (beat)  Wanna go out? Dinner...dancing, or  something?  76",
      "characters": [],
      "action_text": "Dancing? He didn't even hear it. Frances did. A dagger,  reminding her of everything she gave up.  FRANCES  You don't like to dance.  MILES  You do.  He makes it worse.  MILES (CONT'D)  Okay...  (then touching his eye,  referring to hers)  Maybe you wanna... put on a  little... make-up or something...  Miles comes in, picks up the ruby choker and moves behind  Frances, gently brushing aside her hair and clasping the  thing on her. Love and ownership at the same time. Miles sits  behind her on the bed and pulls her back into him, the blood  red droplets suspended in platinum laying on Frances'. Miles  rubs his neck.  EXT. HARPER HAMILTON’S STUDIO/OFFICE - NIGHT  Junior rubs his neck, getting focused, standing outside the  small warehouse/studio. He pushes the buzzer. Miles and Dave  are hanging back, away from the door.  WALTER/INTERCOM   (V.O.)  Yeah.  JUNIOR  It's Junior.  Junior is buzzed in - Miles and Dave push in behind him,  staying low to avoid the security camera -  EXT. HARPER’S BUILDING - CONTINUOUS  Miles and Dave following Junior across the gangplank, over  the atrium. Dave looking none to sure. They enter the outer  office.  INT. HARPER’S OFFICE - CONTINUOUS  Miles and Dave enter, Miles keeping Junior in front of him,  cautiously looking about.  77 WALTER (O.S.)  Boy’s got a glass jaw, Harper, I’m  telling you. K.O. round 3.  HARPER (O.S.)  Walter, you are dumb but at least  you’re pretty. I love taking your  action...  Miles pushes Junior into -  INT.   HARPER'S OFFICE/STUDIO - CONTINUOUS  The place is the low rent version of Miles' home recording  studio. Photos of Harper with music stars, fighters, movie  stars, framed on the wall. Miles’ tape in the valise is on  the console behind Harper’s desk. Walter sits in a chair. As  \"Go Ahead John\"   plays on the radio, Miles Davis Marathon.  Before Walter can react Miles has his gun pointed 6 inches  from his head. Everyone knows the score. Harper, dressed to  the nines, looks at Junior, the turncoat.  JUNI",
      "dialogue_count": 0,
      "word_count": 3846
    },
    {
      "scene_number": 6,
      "slugline": "EXT. CATHEDRAL - CONTINUOUS  The three jump into the Jaguar and Dave fishtails away from  the curb.  INT/EXT. JAGUAR - CONTINUOUS  Dave and Junior check the mirrors and all around, heads on a  swivel.  JUNIOR  Anybody back there?  DAVE  No, man, we're good, we're good.  JUNIOR  You sure?  DAVE  We’re good.  Beat. Then they start to out-gas, relieved laughter,  oblivious to Miles' state in the back.  JUNIOR  Ho-ly shit... That was, I mean... I  mean, that was -  DAVE  Holy shit...  Miles remains quiet. They finally tune into him.  JUNIOR  Don't worry, Miles, we're gonna get  you right, man.  DAVE  Yeah, yeah...  MILES  (almost a whisper)  No. Take me home.  Junior checks him out, bleeding caked over now. Dave nods -  tugs on the wheel.  Miles stares off as we PUSH IN. Somewhere, a phone rings.  FRANCES (O.S.)  Hello?  93",
      "characters": [],
      "action_text": "MILES (O.S.)  You thought I wouldn't find you?  (silence)  If you make me come out there, the  only thing left is gonna be  bullets.  (beat)  You hear me?  FRANCES (O.S.)  I'm not coming back.  Long beat. Miles breathing.  MILES (O.S.)  I'll... I'll kill myself, Frances.  I swear to God.  (breathing, then)  Frances- - I love you...  FRANCES (O.S.)  I know you do. Goodbye, Miles.  Click. Dial tone.  INT. MILES DAVIS' MANHATTAN HOME - NIGHT  Miles enters first, Junior holding the crook of his arm, Dave  trailing slightly.  DAVE  I'll go find some...gauze,  something-  JUNIOR  Yeah. And some alcohol. Clean that  shit out.  Miles goes to his work area. Junior follows at a respectful  distance as Miles threads the tape and hits play. Tape spools  through the heads.  INT. MILES DAVIS' MANHATTAN HOME - KITCHEN - SAME  Dave goes through the sink cabinet looking for supplies, then  stops, hearing the indecipherable sounds emanating from the  other room.  94",
      "dialogue_count": 0,
      "word_count": 298
    },
    {
      "scene_number": 7,
      "slugline": "INT. MILES DAVIS' MANHATTAN HOME - SAME  Dave returns with the stuff finding Miles sitting at his  station, full concentration, Junior behind him. Dave sidles  in next to Junior. They listen, waiting to hear something  resembling music. But it's just disorganized noise so far;  conversations about music, stops and starts, flirtations with  concepts but nothing concrete.  Dave looks at Junior - \"Am I missing something?\" Junior's  look - \"Give it a minute.\"  Miles fast forwards the tape but even at it's sped up tempo  we can tell he's not running over music. He hits stop. Play.  Listens. It's more of the same.  DAVE  When do you come in?  MILES  I'm already in there.  DAVE  I don't hear any-  MILES  I played organ...  Jesus Christ... Dave squints at Junior - \"This is it?\" Junior  looks at his shoes, crushed, witnessing his hero falter. He  sighs.  Hearing the sound, Miles snaps his head around, sees Dave's  shock, but worse; Junior's look of pity. Pity; Miles Achilles  heel.  Miles stands up, goes to his trumpet case, pops it open. Dave  perks up. Miles Davis' first notes after five years? An  incredible moment about to unfold. But Junior is unchanged, a  horn player knows...  Miles returns to his station, spreads out his musical scrawl.  He pulls out his mouthpiece, pops it on, holds open the spit  valve and blows through the dormant instrument. No spit, no  mist, just dank air. Miles licks his lips, the mouthpiece,  takes a deep breath... and blows...  Nothing. The labored, ragged sound of an atrophied embouchure  after a five year lay off. He tries to play it off, let's out  a dark chuckle.  MILES (CONT'D)  Damn...  95",
      "characters": [],
      "action_text": "Miles licks his lips and blows again gets the same result.  Not funny. Junior looks like he might cry. Miles get pissed  now, tries to overpower the instrument, blows hard, manages  to coax out a squeak. Then silence except for the musical  mish mash playing in the background.  JUNIOR  Aw, that ain't nothing, man. Hit  them scales, right? Your chops come  back. Real quick.  Junior chuckles.  DAVE  Yeah. It's just like... some  practice, right?  Their \"help\", neither solicited nor appreciated, has the  opposite effect. Miles looks at his horn, nods gravely and  lays it down. There's a long uncomfortable silence as Miles  starts to walk away. Junior gently puts his hand on his  shoulder.  JUNIOR  You’ll get it back, man.  Miles digs in his pocket and pulls out the last balloon of  heroin he took from Junior earlier. Hands it to him.  MILES  Bye bye.  Miles flops down onto the couch. Done. Dave starts chuckling,  darkly -  Junior stares at the baggie in his hand, contemplating. He  sits down in front of the spinning reel and the gibberish  poring out of the speakers.  Miles looks over, finds a half drunk bottle of booze, wipes  the top of it with his sleeve and then takes it to the head.  Finshing it off, he let’s out a deep sigh. Dave can’t believe  what he’s looking at.  DAVE  This is not... are you kidding me?  Miles clicks on the TV. Focuses on the fight playing there.  Dave nods, laughs a long hollow, “How’d I not see this  coming,” laugh.  DAVE (CONT’D)  (quietly to himself)  What was I thinking?  96 DAVE (CONT’D)  (to Miles)  Going back in your hole, huh? Guess  I should’ve expected that. It’s a  good thing I came prepared.   You  mind?  Dave pulls out his camera. Snaps a shot. Miles squints,  finally looks back at him.  DAVE (CONT’D)  I gotta hunker down too. Got work  to do. See, I'm coming out with   the  fuckin' story, you better believe  that. Forget about the comeback  piece. It’s dirt time. And I’m  coming   with   it.  Dave gestures sprinkling dirt on hi",
      "dialogue_count": 0,
      "word_count": 1145
    },
    {
      "scene_number": 8,
      "slugline": "INT. MILES’ HOUSE - NIGHT  Miles and Junior at the piano. Dave watching. Tableau. The  tableau then goes away - Dali-esque transition - becoming  Miles in the interview chair. The wraparound. Trumpet leaves  Miles’ lips. A beat then.  DAVE  Yeah. Dig it. That was a better  answer. I was really drawn in.  Beautiful playing, Miles.  MILES  Something clicked.  DAVE  I’ll say. Great. And is there a way  that you can put what you just  played into words?\"  Miles shakes his head, chuckles, rises, puts his trumpet on a  stand, picks up the valise stuffed with staff paper, the  record SMPWC tucked in behind the tape cannister, and walks  off camera.  MILES  (over his shoulder)  Keep rolling...  Dave enters frame, turns to the camera, shrugs; “Is he  fucking serious?” Dave calls out to Miles.  DAVE  Hey, are you coming back?!  Black.  INT. NYC CLUB - FEBRUARY 22, 20-- NIGHT  The stage. The band comes on - Gary Clark Jr. Esperanza  Spaulding, Wayne Shorter, Herbie Hancock...  Miles jumps it all off, stepping up to the mic and firing a  run, looking good now, strong, back. The band locks in and  they begin to run the voodoo down, no one leading, everyone  following, searching for all that is said and unsaid, the  particles that make up the fabric of life itself.  CREDITS ROLL  100",
      "characters": [],
      "action_text": "Miles finishes his solo and steps to the side to watch. PUSH  IN on Miles, you can see it up close, the corners turn up  slightly -- Miles Smiles.  END  101",
      "dialogue_count": 0,
      "word_count": 253
    }
  ]
}