{
  "slug": "millers-girl-2024",
  "title": "millers girl",
  "genre": "romance",
  "format": "film",
  "scenes_count": 4,
  "characters_count": 0,
  "characters": [],
  "total_words": 16781,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. BENSON AGRICULTURAL HIGH SCHOOL - HALLWAY - MORNING Cairo and Winnie walk together. More students and teachers are starting to crowd the halls. CAIRO What was that? WINNIE I’m seducing Coach Fillmore. CAIRO Why? WINNIE Because I can. A group of baseball players walks toward them in the opposite direction. One of the guys whistles at Winnie. JOCK What’s your going rate, baby girl? Been saving up my lunch money. WINNIE (not missing a beat) Finish growing out your vagina and then we can talk. The other jocks laugh at Winnie’s retort and continue on their way. Cairo barely notices. This is old hat to her. CAIRO Coach Fillmore though? He’s a fucking primate. Winnie gestures to the student body around them. WINNIE These are primates. CAIRO You’re a lesbian. WINNIE I’m an opportunist. You jealous? CAIRO If I say yes, will you lay off him? WINNIE If I say yes, will you lay on me?  22.",
      "characters": [],
      "action_text": "INT. JONATHAN MILLER’S CLASSROOM - END OF THE SCHOOL DAY - AFTERNOON Jonathan is attempting to grade papers while simultaneously having a conversation with Boris, who sits on Cairo’s desk, eating a power bar. BORIS This tastes like chalk, why do people eat this shit? He tosses the rest of the bar out the open window. From below we hear student yell “ the fuck? ” BORIS (CONT’D) How’s the book coming? JONATHAN Not fast enough. BORIS Trouble in paradise? JONATHAN No. Yes. No. BORIS Is she putting out? JONATHAN Wow. BORIS Knew it. JONATHAN She’s busy. BORIS Too busy to get busy? Step it up, brah. JONATHAN I’m not going to guilt my wife into sleeping with me. BORIS Why not? JONATHAN Who wants guilt sex?  23. BORIS Guilt sex, make up sex, balloon animal sex... JONATHAN This is why you’re single. You know that, right? BORIS I’m not single, I’m available. And late to practice. What time is dinner? JONATHAN Six. Please take a shower first. BORIS What, you worried Bea’s gonna wanna get with this? (he stands and rubs his body) With this luscious sweaty man-meat? JONATHAN It is actually my worst nightmare. Boris begins to Roger Rabbit out of the room. BORIS You better watch yo’self. I got moves. I got skills. JONATHAN You’ve got brain damage. BORIS (singing as he backs out of the room)  Iiiiiiiiif you want my body AND you think it’s sexy come on darling let me know-  Once alone, Jonathan sings along to himself and resumes grading papers. He dances a little in his seat. Cairo stands in the doorway watching him. He looks up and sees her, and immediately stops mid-lyric. JONATHAN Hey. She tries not to laugh. He tries to be cool.  24. JONATHAN (CONT’D) Hi. Hello. Well that’s embarrassing, isn’t it? CAIRO I won’t tell. JONATHAN That’s generous. Thanks for coming by, I hope I’m not keeping you from anything. CAIRO Nah, I’m just waiting for Winnie. JONATHAN Seems like you’re always waiting for Winnie. CAIRO Sounds like an album title. Waiting for Winnie by the Gin Blossoms. JONATHAN G",
      "dialogue_count": 0,
      "word_count": 4653
    },
    {
      "scene_number": 2,
      "slugline": "INT. CAIRO’S CAR - MORNING Cairo sits in the passenger seat of her own car, while Winnie puts blush on her cheeks. She holds three coffees in a tray in her lap. Winnie sits back to look at her handiwork. WINNIE (admiring) You’re really very pretty. CAIRO Shut up. WINNIE Like actually pretty, not just smart girl pretty. Like full on She’s All That transformative. Goddamn, I’m a genius. Cairo takes a deep breath. CAIRO This is nuts. WINNIE This is   fun . WINNIE (CONT’D) You’re ready. Onward. Cairo gets out of the car. Winnie watches her walk away and rolls down her window to cat call her. WINNIE (CONT’D) (singing) Tryna get to yoooooou and dat booty- EXT. BENSON HIGH SCHOOL - OUTSIDE - MORNING Cairo rounds the corner of the building, carrying the coffees. Her hair is down and she’s wearing a fitted coat, tights, and boots. She looks like an adult. CAIRO Morning. She hands them each a coffee. BORIS What’s this? CAIRO It’s coffee.  51.",
      "characters": [],
      "action_text": "BORIS No, no. What is this I see before me? You look like a girl. CAIRO Thank you? BORIS Yes indeedy Cairo sweetie, you clean up good. Got a big date? CAIRO Nope. BORIS Presentation in class? CAIRO Nope. BORIS Get laid? JONATHAN OKAY. BORIS I like it. JONATHAN Thank you for the coffee. You didn’t have to do that. CAIRO Oh, totally my pleasure. BORIS Muffins, muffin? Boris hands her a white pastry box. She opens it. CAIRO Oh my God these smell amazing. What flavor? BORIS Split fig. Jonathan chokes on his coffee. CAIRO Have you thought about getting some art on these? Like a logo. (MORE)  52. You could sell them to raise money for the team. (Boris laughs) Don’t you laugh! There’s nothing cuter than a boy selling a muffin. You’d buy some, wouldn’t you Mr. Miller? JONATHAN I can’t resist a cute boy with a muffin. CAIRO I know you can’t. You could get Winnie to design it for you! She’s great at stuff like that. Oh my god, you could call yourself the Muffin Man. JONATHAN That is pretty cute. CAIRO Winnie and I could help you with whatever you needed and you could be an experience on our college apps. Cairo lights a cigarette. JONATHAN You smoke? CAIRO Will you tell on me? BORIS No one would believe us if we did. (to Jon) Would you really buy some of my muffins? JONATHAN Why pay for what I already get for free? BORIS Damn. That’s cold. CAIRO I would. All the girls would. CAIRO   (CONT'D)  53. BORIS Okay yeah. I’m the Muffin Man. I’m the motherfuckin Muffin Man. (he jumps up and down) My balls are slowly creeping inward. You coming in? JONATHAN Nah, I’m gonna have one more. You go ahead. BORIS Soon’t yourself, Brohan. Bye Sweet. CAIRO Bye! Boris leaves. Jonathan opens his pack to Cairo. JONATHAN You want one of these? She pulls out her own pack. CAIRO Set higher standards, Mr. Miller. Have a menthol. INT. CAIRO’S CAR - MORNING Winnie sits on her knees in black ripped jeans and a tight tee shirt with a screen print of a Lichtenstein weeping woman. She’s coloring in sharpie o",
      "dialogue_count": 0,
      "word_count": 8092
    },
    {
      "scene_number": 3,
      "slugline": "INT. JOYCE MANNER’S OFFICE - LATER THAT DAY Joyce sits behind her desk. Her educational diplomas and a framed photo of her, her husband, and two teenage daughters hang on the wall. INTERCUT between JONATHAN and JOYCE and CAIRO and JOYCE - two separate conversations that feel like one. CAIRO Mr. Miller asked me to write it. JOYCE Is that true? Jonathan looks uncomfortable. JONATHAN Well, yes and no. The assignment was to write a short story in the style of their favorite authors. So yes, I asked her to do the assignment but I didn’t specify the content. JOYCE And the mid-term is what percentage of the final grade? JONATHAN Twenty percent. JOYCE Henry Miller is not an approved author for public school studies. CAIRO We’re both big fans of his work. Jonathan - I’m sorry - Mr. Miller is enthusiastic about his work. JONATHAN I’m sorry do you have any water? JOYCE How often do you see one another? CAIRO I haven’t been feeling well, so recently not so much. But we used to see each other all the time before school. And in class, of course. And sometimes after school.  100.",
      "characters": [],
      "action_text": "JOYCE Do you smoke cigarettes? JONATHAN Yes. Is that relevant? JOYCE Do you smoke together? CAIRO Oh yeah, all the time. Usually really early in the mornings before class. JONATHAN We have smoked cigarettes together. Yes, on - on the grounds. I mean, we just happened to be in the same place, smoking a cigarette. That’s how it started. Not that there’s anything - I mean that’s how we started smoking together. I’m not explaining this properly Jonathan is sweating. JOYCE Do you see each other socially? CAIRO Sometimes, at his behest. JONATHAN Absolutely not. JOYCE Would you consider yourselves close? CAIRO Mr. Miller’s very involved. JONATHAN God, I’m sorry. I just have the worst cotton mouth. JOYCE Have you ever seen each other outside of school? CAIRO He came to my house once.  101. JONATHAN No. Well, yes. Sort of. It’s so stupid. I suppose I had accidentally picked up her phone on my way out of class. I was just dropping it off. JOYCE Were you alone? JONATHAN My wife was supposed to go with me but she, um - didn’t. CAIRO My parents were out of town. JOYCE And what did you do? JONATHAN Did she tell you we did something? CAIRO We...discussed the assignment. JOYCE You were in the house together, alone? CAIRO He was pretty specific about what he wanted. JONATHAN We didn’t — it’s not like that. Nothing happened. CAIRO Will this effect my standing as valedictorian? JONATHAN (flustered) What did she tell you? That I encouraged this? CAIRO Mr. Miller’s recommendation is so important for my application to Stanford...I just...I really wanted to impress him.  102. JONATHAN  I’m not yelling , I’m just incredibly frustrated. But you’re - I’m sorry. CAIRO I have everything riding on my grade in this class. JONATHAN Joyce, be real with me. How bad is this? CAIRO I don’t want to cause any trouble. JONATHAN If I could just talk to her, if I could just- CAIRO May I go? JONATHAN To protect her. From me. Right. INT. JONATHAN’S HOUSE - KITCHEN - NIGHT Jonathan leans against the sink. Be",
      "dialogue_count": 0,
      "word_count": 2553
    },
    {
      "scene_number": 4,
      "slugline": "INT. CAIRO’S BEDROOM - SHORT STORY - FANTASY The dark haired girl looks out the window. Behind her, the room glows faintly with the soft diffused gray light of a rainy afternoon. The window is open and fat rain drops smack against the sill. We hear a car pull into the driveway. Rain splashes her hand. Her cell phone rings and she answers. The quoted text appears with a blinking cursor. We see what she sees. CAIRO “Hello”,  she said .  JONATHAN (V.O.) I’m here. CAIRO (V.O.)  Alice thought immediately of a slaughtering lamb, though she couldn’t be certain which of them was meant for sacrifice.  Close on a water droplet landing on the white windowsill into... INT. HOTEL BATHROOM - NIGHT - FLASHBACK A drop of water from the running bath has landed on the page Jonathan is reading. He wipes at it and the ink runs. His face is unreadable, his pen unmoving. CAIRO (V.O.)  He was outside. He was inside.  Jonathan blinks. INT. CAIRO’S BEDROOM - SHORT STORY - FANTASY When his eyes open, he stands before her in her bedroom, bag in hand. The text floats over what we see, a reenactment of the story. CAIRO “You gonna plug a dam?”  She said, noting the drugstore bag filled with tampons.  115.",
      "characters": [],
      "action_text": "JONATHAN “I thought this was a fashionable gift for young ladies.”  He said.  CAIRO (V.O.)  She laughed at him. With him. Their rapport was effortless.  (she puts a cigarette in her mouth)  “You want one?” The flame and Cairo are reflected in Jonathan’s pupils. CAIRO (V.O.)  Smoke drifted from her mouth with practiced effort - something she’d picked up in some obscure noir she’d watched with her mother.  JONATHAN It excites you, doesn’t it? The surreptitiousness of it all. CAIRO Is it more romantic for you that way?  Mr. Murphy smiled wide, the lines around his mouth deepening into parentheses that framed his perfect lips into a punch line.  Jonathan’s face fills the frame, looking right at us. JONATHAN This is no romance. I’m sorry to disappoint you. He snatches her wrist and the cigarette falls to the floor, spewing ash and spark from its tip before being crushed with her shoe. INT. HOTEL BATHROOM - NIGHT - FLASHBACK Jonathan’s eyes scan the page. He shifts on the floor. CAIRO (V.O.)  Alice opened her mouth to say something, but the words fell away. Mr. Murphy loomed over her, his Cadillacblue eyes hungry and bored.  116. INT. CAIRO’S BEDROOM - SHORT STORY - FANTASY CU on Jonathan’s mouth as the dialogue spells itself out of his mouth. JONATHAN  In what peril you find yourself.  CU on Jonathan’s face close to Cairo’s. We don’t see their legs, but we see them shift. CAIRO (V.O.)  He pressed the knee of his starched chinos into the space between her legs.  JONATHAN I want you to read to me. CAIRO (V.O.)  Alice watched in slow motion as Mr. Murphy’s tongue undulated when he spoke - pink tide against the bone shore of his teeth.  JONATHAN Read it to me the way you read it to yourself. CAIRO (V.O.)  Their bodies separated like a single cell splitting.  ECU on Cairo’s sticky glossed lips separating in slow motion. CAIRO (V.O.)  Alice took the tattered Henry Miller paperback   off of the bedside table and spread it open on the comforter of her bed.  CU on a large framed ",
      "dialogue_count": 0,
      "word_count": 1483
    }
  ]
}