{
  "slug": "mindhunter-101-episode-1-1-2017",
  "title": "mindhunter 101 episode 1 1",
  "genre": "thriller",
  "format": "series",
  "scenes_count": 3,
  "characters_count": 0,
  "characters": [],
  "total_words": 9475,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. BAR/RICHMOND VA - NIGHT 13   13 A rowdy bar full of CO-EDS, GRAD STUDENTS, cigarette smoke and posters on the walls, a GARAGE BAND playing under a large brick archway. Camera finds HOLDEN drinking at the bar with WILSON, in their suits and ties, Windsor knots, shiny shoes -- conspicuous amongst the scruffy crowd. WILSON is holding forth, HOLDEN listening, both a little drunk. WILSON. Tells the shrink a dog told him to do it. HOLDEN. That’s a pathetic “motive.” WILSON. Yeah, I’m not saying there’s literally no motive, I’m saying it’s not a rational motive. We call it “aberrant behavior” because it’s unlike anything we’ve seen before. We can’t predict it because it’s, by nature, unpredictable. We can’t classify it, because it’s unclassifiable. It’s just somehow “evolved.” HOLDEN. “Aberrant?” WILSON. This is the world we live in now. This is the world Nixon bequeathed us. All bets are off. HOLDEN. I totally agree. WILSON. Thirty years ago it was Bonnie and Clyde. Next thing you know it’s “Zodiac” and this “Son Of Sam.” Crimes change. HOLDEN. What’s next? WILSON. Who the hell knows?  Mindhunter   Ep 1   Blue Working Draft   8/2/18   21.",
      "characters": [],
      "action_text": "HOLDEN. But we’re supposed to know, right? WILSON. That’s our big secret. HOLDEN. What? WILSON. That we don’t. HOLDEN. Jeez... WILSON. Look, we have to, somehow, “evolve” -- HOLDEN. How? WILSON drains his beer. WILSON. I could tell you -- but I’d be bullshitting. With that he grins, slams the empty glass down on the bar and stands. WILSON. (CONT’D) Okay. I gotta split. They shake hands, WILSON goes and HOLDEN stares into space a moment. He notices a girl walk in with her friend - DEBBIE, 23, wearing a short blue jumpsuit and ankle boots. DEBBIE comes to the bar to order, standing right beside HOLDEN. He looks her up and down and she notices, untroubled. DEBBIE. Hey. HOLDEN. Hey... DEBBIE. What are you looking at?  Mindhunter   Ep 1   Blue Working Draft   8/2/18   22. HOLDEN. I just like your outfit. What is that, a jumpsuit? What do you call that? DEBBIE. This? I call it “a jumpsuit.” HOLDEN. Stylish. DEBBIE. What do you call that? (INDICATES HIS SUIT.) You look like a mormon. You look like my dad. HOLDEN. Is he a mormon? DEBBIE. No but he looks like one. HOLDEN. So does mine. He bought me this suit as a matter of fact. DEBBIE. Did he buy you those nice shiny shoes? HOLDEN. I have one brown pair and one black pair. I also have sneakers but I had to buy those myself. DEBBIE. What kind of adult let’s their   * parents choose their clothes for them? He just looks at her, doesn’t have an answer, she waits for bar service. HOLDEN (JOKING.)   * Are you coming onto me? DEBBIE (JOKING.) Sure, that’s my technique: “The emasculating approach.”   *  Mindhunter   Ep 1   Blue Working Draft   8/2/18   23. They smile a little awkwardly, neither sure where to go from here. HOLDEN drinks, DEBBIE doesn’t make eye contact, her friend now busy talking to other STUDENTS. HOLDEN. Having a good time?   * DEBBIE. It’s my birthday today.   * HOLDEN. Happy birthday. How old are you?   * DEBBIE.   * Twenty four.   * HOLDEN.   * You don’t look old enough to be in   * here.   * She looks him up",
      "dialogue_count": 0,
      "word_count": 1622
    },
    {
      "scene_number": 2,
      "slugline": "INT. DEBBIE’S SHARE HOUSE/LIVING ROOM - NIGHT 18   18 Posters on the walls, Persian rugs on the floor, ethnic wall hangings, soft lighting, incense burning. On the coffee table is a bong and a bowl of buds. DEBBIE brings over wine glasses and a wine bottle, opens the wine etc as they talk. HOLDEN is sitting on a couch staring at the bowl. DEBBIE hands him a glass of wine and he drinks. He watches her put on a record, “I Wonder” by Sixto Rodriguez. DEBBIE. So what does a “street agent” in Detroit get up to? HOLDEN. Mostly catch army deserters -- guys   * who’d gone AWOL from Vietnam and were too frightened to go back.   I   * mean they were young guys. Same age   * as me.   * DEBBIE. That must’ve been hard.   * HOLDEN.   * Nice guys some of them.   * DEBBIE.   * Did it make you feel like a snitch?   * HOLDEN.   * There’s worse things than being a   * snitch. When I was in Pittsburgh --   * (HE SUDDENLY STOPS, REFLECTS.)   * DEBBIE.   * What?   * HOLDEN.   * Huh?   * DEBBIE. What happened in Pittsburgh? Did   * you shoot somebody?   * He doesn’t reply. She kicks off her boots, sits beside him and packs the bong.  Mindhunter   Ep 1   Blue Working Draft   8/2/18   31.",
      "characters": [],
      "action_text": "DEBBIE. (CONT’D) Maybe this’ll loosen you up... HOLDEN. You’re making me nervous... DEBBIE. You’re such a goody-goody... She smiles sweetly. He looks at her legs. She crosses them. HOLDEN. What are you, some kind of honey trap? I’ve been warned to watch out for women like you.  Mindhunter   Ep 1   Blue Working Draft   8/2/18   31A. DEBBIE. You mean “normal ones?” She uncrosses her legs, looks at him.   * DEBBIE. (CONT’D)   * Relax. You think I’m gonna “put   * out” before the first date?   * She offers him the bong. He hesitates, takes it a little nervously, she lights it for him and he has a pull... DEBBIE. (CONT’D) Let’s just talk.   * No reply as he takes the bong. He fingers it awkwardly.   * DEBBIE. (CONT’D) Here, I’ll show you... put your   * finger over the hole... She takes the bong -- he watches her put his finger over the   * hole. DEBBIE. (CONT’D) Put your mouth over the other hole.   * He inhales.   * He suddenly coughs his guts up, looks ill.   * FADE OUT. INT. MOTEL ROOM MOCK UP/FBI TRAINING ACADEMY - DAY 19   19 A trio of RECRUITS with clipboards and biros are gathered around an INSTRUCTOR beside a double bed, behind partition walls in a mock up of a MOTEL ROOM. A female RECRUIT in glasses and twin set is sitting on the bed holding a prop ICE PACK to her head, while somebody else holds a tape measure between her head and the bed knob. The INSTRUCTOR talks to them in the bg. INSTRUCTOR 2. ... He says she hit her head on the bed knob having consensual sexual intercourse... she says he knocked her out and dragged her into a motel room to rape her. We know she didn’t hit her head on that bed knob because we’ve measured...  Mindhunter   Ep 1   Blue Working Draft   8/2/18   32. HOLDEN and SHEPARD watch momentarily, then SHEPARD leads HOLDEN away, talking.  Mindhunter   Ep 1   Blue Working Draft   8/2/18   32A. SHEPARD. ... Where would you go? HOLDEN. University of Virginia in Charlottesville. Post grad. SHEPARD. Holden this is your post grad. HOLDEN. Contem",
      "dialogue_count": 0,
      "word_count": 7439
    },
    {
      "scene_number": 3,
      "slugline": "INT. CAR - NIGHT 44   44 They drive in the gloaming, trees and paddocks, farmland and nothingness for miles. Silence, then: TENCH. “The “dark ages?” HOLDEN. We are. TENCH. “A gap in your knowledge?” HOLDEN. I’ve studied everything I can study. I’ve talked to everyone I know at the Academy. I’ve taken the ride out here with you, listened to everything you’ve told me -- but I still think we’re teaching something which we don’t really understand in the slightest. TENCH. I was trying to help you. If you don’t like it Holden, go back to your bed-wetting college kids and we’ll forget all about it. HOLDEN. Mary Jeffrey and her son were killed for reasons we are simply not equipped to understand. It wasn’t “lust murder.” It wasn’t some random thrill killer who was just “born bad.” And it wasn’t a pantie thief who changed things up. It was an aberration. TENCH. Let me tell you something about “aberrant behavior,” Holden: It is fucking aberrant. If we understood it, we’d be aberrant too. Fortunately it is not incumbent upon us to write a dissertation... HOLDEN. Maybe it is.  Mindhunter   Ep 1   Blue Working Draft   8/2/18   71.",
      "characters": [],
      "action_text": "TENCH. Why? HOLDEN. Our job is to give him something he couldn’t have figured out himself. TENCH. I am sticking my neck out for you... HOLDEN. I’m sorry, Bill. No disrespect. At the moment I just don’t think we can say anything to a guy like McGraw with any kind of authority. TENCH. (pause.) Let me ask you something. Where are you from? HOLDEN. I was born in New York but -- it’s kind of a mixed bag... TENCH. Okay. Well that’s what you are right now. “A mixed bag.” A little college education. Some experience on the street. Some insight. A lot of horseshit. HOLDEN. I agree. One step forward, two steps back. TENCH. Let me ask you something else.   * HOLDEN. “A little knowledge is a dangerous thing.” I get it. It’s why we need more. TENCH. Do you have a girlfriend? HOLDEN. I do now, Bill, as it happens.  Mindhunter   Ep 1   Blue Working Draft   8/2/18   72. TENCH. Okay. So. (HANDS HIM A DIME.) Next   * time you’re a long way from home and you flip your shit, you find a pay phone and you tell it to your girlfriend. Okay? HOLDEN. Okay. TENCH. How does that sound? HOLDEN. It sounds okay, Bill. CLOSING CREDITS.  Mindhunter   Ep 1   Blue Working Draft   8/2/18   73.",
      "dialogue_count": 0,
      "word_count": 414
    }
  ]
}