{
  "slug": "mission-impossible-fallout-2018",
  "title": "mission impossible fallout",
  "genre": "action",
  "format": "film",
  "scenes_count": 44,
  "characters_count": 0,
  "characters": [],
  "total_words": 35275,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. SAFE HOUSE - NIGHT 2   2  Ethan's eyes open, waking from his nightmare. He's on a cot in a dark and barren room. Rain batters the dormer windows. A faint knocking snaps him out of bed, pistol in hand.  INT. NARROW STAIRWELL - NIGHT 3   3  A long set of stairs down to a door. Ethan opens it TO REVEAL A SILHOUETTED DELIVERY MAN in a rain slicked coat and hat. MAN Fate whispers to the warrior... ETHAN You cannot withstand the storm. MAN And the warrior whispers back... ETHAN I am the storm. The Man hands over the package and walks off.  INT. SAFEHOUSE - MOMENTS LATER 4   4  Ethan sits at a table and opens the envelope. Inside is a book: Homer’s   The Odyssey . Inside that is a small, REEL-TO- REEL TAPE PLAYER with a tiny needle protruding from a depression in one reel. Ethan presses his finger to it, leaving a drop of blood there. It’s absorbed and the recorder plays. He sucks his finger as a projector pops up from the tape player, displaying images on the wall. The first image is that of SOLOMON LANE.  Cherry Rev. (Nov 16 '17) - 1908   1A.",
      "characters": [],
      "action_text": "VOICE (ON TAPE) Good evening, Mr. Hunt. Despite two years in captivity, Solomon Lane refuses to divulge any details about his network of rogue government agents, formerly known as the Syndicate. INSET: ARMED MASKED MEN in black tactical gear, a hit squad, standing over several DEAD BODIES. VOICE (CONT’D) The CIA’s Special Activities Division has relentlessly hunted Lane’s elite army of hostiles, but many remain unknown and at large. RAPID-FIRE IMAGES OF DESTRUCTION. VOICE (CONT’D) To survive, they have abandoned Lane’s vision of political anarchy and adopted a policy of full-scale terror-for-hire. The members of this extremist splinter cell refer to themselves as “The Apostles.” IMAGE: Thumbnails of emails and text messages stamped NSA: CLASSIFIED. VOICE (CONT’D) Intercepted communiques decrypted by the NSA indicate the Apostles number one client is this man: INSET: A SILHOUETTE of a man, a nothing. VOICE (CONT’D) An unidentified terrorist known only by the code name: John Lark. IMAGE: DOCTORS treat SICK AND SUFFERING CIVILIANS in a second world medical facility. VOICE (CONT’D) One month ago, using information provided by Lark, the Apostles stole the Smallpox virus from the CDC in Reston Virginia.  Cherry Rev. (Nov 16 '17) - 1908   2. IMAGE: A map of the Indian subcontinent. INSET: The region of Kashmir. VOICE (CONT’D) The virus was released in Indian controlled Kashmir, causing an outbreak along the borders of China and Pakistan and threatening one third of the world’s population. The virus has been contained, but evidence suggests this attack was a merely test run for a more ambitious operation... FACING IMAGE: The handwritten pages of a madman’s writings. INSET: DR. NILS DELBRUUK (40s): VOICE (CONT’D) Three weeks ago, Lark contacted this man: Norwegian nuclear weapons specialist Nils Delbruuk. Dr. Delbruuk’s security clearance was revoked after publishing a fiercely anti-religious manifesto. Twenty- four hours after communicating with Lark, Delbruuk vanished. IMA",
      "dialogue_count": 0,
      "word_count": 3555
    },
    {
      "scene_number": 2,
      "slugline": "EXT. AIRFIELD - NIGHT 7   7  TITLES: RAMSTEIN AIRBASE, GERMANY Ethan arrives by car, pulling up to a waiting DIRECTOR ALAN HUNLEY.   Hunley turns, and heads towards a massive C-17 Cargo plane. Ethan hops out and falls in step. Hunley hands Ethan a dossier. The first image is that of a decoded e-mail. ETHAN Sir- HUNLEY That phone you unlocked led us to a server in Iceland where we managed to decrypt a communique between John Lark and this woman: IMAGE: A WOMAN in a hat, sunglasses, not wishing to be seen. HUNLEY (CONT’D) Alana Mitsopolis, activist and philanthropist whose charity work has earned her the name White Widow. It’s just a front for her real trade: arms dealing and money laundering.   Extensive political connections provide her with protection. IMAGE: The stately Grand Palais in central Paris. HUNLEY (CONT’D) Lark and the Widow are meeting tonight to negotiate delivery of an unspecified package which we can only assume is our missing plutonium. They’ll make contact in the private lounger of the Grand Palais in Paris during her annual fundraising event. Details are in the file. If Lark is not at the Grand Palais by midnight, the Widow will leave, and sell the package to the highest bidder. This gives you two hours from now to find Lark. ETHAN Sir, I think there’s something you should know- Hunley stops, faces him.  Cherry Rev. (Nov 16 '17) - 1908   9.",
      "characters": [],
      "action_text": "HUNLEY I’m going to stop you right there. You had a terrible choice to make in Berlin: recover the plutonium or save your team. You chose your team and now the world is at risk. Some flaw deep in your core being won’t allow you to choose between one life and millions. Now, you see that as a weakness, but I see that as your greatest strength.   And that’s how I know I can count on you to cover my ass. Coming over here from the CIA was a lateral move. Some would say a step down. But I did it because of you. Don’t make me regret it. He walks on, stops, turns back. HUNLEY (CONT’D) Oh, and when you’re over in Paris, try to can find out who’s responsible for stealing the plutonium from the Russians in the first place. Beat. Hunley studies Ethan’s expression, realizing: HUNLEY (CONT’D) Oh good God, Hunt. Don’t tell me ...  ETHAN Sir, to catch Lark we needed bait.  Real bait . HUNLEY You   stole   plutonium? From the  Russians ? And then you   lost it?  ETHAN Sir...yes sir. Ethan reluctantly nods. Off Hunley’s shocked expression:  Cherry Rev. (Nov 16 '17) - 1908   9A.",
      "dialogue_count": 0,
      "word_count": 439
    },
    {
      "scene_number": 3,
      "slugline": "INT. CORRIDOR -   NIGHTS 8   8  A WOMAN’S HARD HEELS, followed by A MAN’S LEATHER SOLES. REVEAL:   ERIKA SLOANE, A FORMIDABLY SUITED WOMAN (40s) walks with purpose, followed by A FORMIDABLE MALE (40s). This is WALKER. They approach a door where A MARINE SERGEANT stands guard. MARINE ID, ma’am. WALKER You know who this is, Sergeant? MARINE CIA Deputy Director Erika Sloane, sir. But I still need to s- She snatches the Marine’s ID from his shirt, hands it to Walker and barges past. Walker smiles. WALKER Enjoy Afghanistan... Private. Walker goes after Sloane toward the sound of roaring engines.  Cherry Rev. (Nov 16 '17) - 1908   10.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 109
    },
    {
      "scene_number": 4,
      "slugline": "EXT. AIRFIELD - NIGHT 9   9  Sloane and Walker stride across the tarmac toward the C-17. SLOANE Make the call. Walker dials a cell phone as Sloane focuses on Hunley and Ethan, engaged in intense conversation. Sloane can’t hope to hear them over the engines. But that doesn’t matter. A beat later, the C-17’s engines wind down. Ethan and Hunley are momentarily confused. Then they see Sloane and Walker. HUNLEY Erika, what do you think you’re doing? SLOANE It may be your mission but that's is the CIA’s plane. It doesn’t take off without my say-so. HUNLEY We’d don’t have time for this- SLOANE I have a team in Paris ready to grab Lark as soon as he leaves the Palais. A G5 is standing by to rendition him to Gitmo where a waterboard is waiting.  Salmon Rev. (July 30 '17) - 1400   11.",
      "characters": [],
      "action_text": "HUNLEY Spend twenty-four hours we don’t have pulling a confession we can’t trust from a man we haven’t positively identified yet. No. We need reliable intelligence and we need it now. This scenario is precisely why the IMF exists. SLOANE The IMF is Halloween Alan. A bunch of grown men in rubber masks playing trick-or-treat. (to Ethan) And if he’d held on to the plutonium in Berlin, we wouldn’t be having this conversation. HUNLEY And his team would be dead.  Salmon Rev. (July 30 '17) - 1400   11A. SLOANE Yes. They would. That’s the job. And that’s why I want my own man on the scene to... appraise the situation. (re: Walker) Agent Walker. Special Activities. Both Hunley and Ethan’s expression darkens. HUNLEY His reputation precedes. SLOANE You use a scalpel. I prefer a hammer. HUNLEY The answer is no. I have operational authority here, direct from the President. You have a problem with that, you take it up with him. SLOANE Already have and he agrees with me. My man goes or no one goes. Ethan looks at Hunley. Hunley looks at his watch. They have no choice. Ethan walks up the ramp and into the plane. Sloane turns her back to Hunley, speaking so only Walker can hear. SLOANE (CONT’D) No one comes between you and that plutonium. Not Hunt, not his team, not anyone. Walker nods and heads into the plane.  Cherry Rev. (Nov 16 '17) - 1908   12.",
      "dialogue_count": 0,
      "word_count": 387
    },
    {
      "scene_number": 5,
      "slugline": "EXT. SKY - NIGHT 10   10  The full moon fills the frame until the black silhouette of a giant C-17 Globemaster cargo-plane rises in front of it.  INT. C-17 - NIGHT 11   11  PILOT (ON SPEAKER) Four minutes to decompression. Walker and Ethan in the empty cavern of the plane's belly. A big clock counts down. Ethan checks his gear: A mask making machine, etc. Walker looks at the file Hunley gave to Ethan. One side is the picture of the Widow. On the other, a picture of an ID band. ETHAN The Widow will meet Lark in the VIP lounge at midnight. No one will be admitted without a pre-issued   * electronic ID band. IMAGE: Walker studies a photo of said ID band. ETHAN (CONT’D) We’ve acquired the unique RFID number for Lark’s band, allowing us to locate it with these: Ethan indicates what look like two smartphones. ETHAN (CONT’D) Find that ID band, you find Lark.   * WALKER Then what? Ethan aims a wand at Walker. It projects a grid on his face through his visor. Walker blinks. Ethan gestures to the machine. On the screen is a copy of Walker’s face. ETHAN I assume his identity and make contact with the Widow. She takes us to the package. WALKER Which you’re   hoping   is the plutonium. ETHAN That’s what we have to go on.   *  Tan Rev. (Jan 31 '18) - 1518   12A.",
      "characters": [],
      "action_text": "WALKER (re Mask Machine) People actually fall for this shit? Ethan decides not to answer. Walker sighs. “Whatever.” WALKER (CONT’D) How do you intend on making Lark cooperate? Ethan holds up a small syringe. ETHAN I bump him in the crowd: in ten   * seconds he’ll look like any other   * drunk at the party - incoherent and completely pliable. After I borrow   * his face, you walk him out the   * front door and hand him to Sloane’s   * extraction team. WALKER You’re not getting rid of me that easily, Hunt.   * ETHAN That’s not what this is about. WALKER Sure it is.  Tan Rev. (Jan 31 '18) - 1518   12B. Before Ethan can reply, the plane’s interior lights turn from   * white to soft red. That’s the signal. WALKER (CONT’D)   * I know you don’t want me on this detail, but let’s face it; if you’d made the hard choice in Berlin, I wouldn’t be here. ETHAN And if you didn’t gun down every Syndicate agent they sent you to find, I wouldn’t be here. (off Walker’s look) That’s right. I know all about you. You’re why we don’t have a living witness who can identify John Lark and these Apostles.   * WALKER   * If you have a problem with my   * methods, you can always stay   * behind. You’re mission, should you   * choose to accept it. Isn’t that the   * thing?   * PILOT   * Three minutes to decompression.   * ETHAN   * Suit up.   * And before Walker can reply, Ethan starts stuffing gear into bags. RAPID INTERCUTS: chutes on, helmets on. PILOT (ON SPEAKER) Ten seconds to decompression. Ethan sees Walker’s helmet visor is foggy.   * ETHAN Is your oxygen on? Walker searches for the valve. Ethan grabs it and turns it on. His visor de-fogs just as:   * HISSSSSSSSSSS. The lift-gate opens at the back of the plane, revealing the blackness of night beyond.  Tan Rev. (Jan 31 '18) - 1518   12C. Walker   goes about tightening straps, etc.   * PILOT (ON SPEAKER) 30 seconds to drop zone. Stand by for green light. A ticking clock comes on. Thirty seconds.   Ethan has to make this work. He points to",
      "dialogue_count": 0,
      "word_count": 758
    },
    {
      "scene_number": 6,
      "slugline": "EXT. SKY - NIGHT 12   12  Terminal velocity. The full moon gives everything a cold, lapis-colored sheen. We are coming up fast on the storm.  (NOTE: The following plays in one continuous take, never leaving Ethan.)  Ethan flies past us, chasing after Walker, silhouetted against the storm. He can hear Walker’s breathing hyperventilating - terror on a level few can ever know. ETHAN WALKER- BOOM. Lighting explodes in front of Ethan. He blows through a layer of dissipating ozone, half blind. When his eyes adjust, he realizes Walker is gone. ETHAN (CONT’D) WALKER, DO YOU COPY. A moment later he emerges from the storm layer. But: There is a second storm layer, far below, cracking with lighting. Shit. ETHAN (CONT’D) Walker. Come in. Nothing. Ethan looks left, right, rolls over onto his back to look up. No sign of Walker. He rolls again, facing down. Lightning flashes and by sheer luck he sees: Walker's silhouette plummeting, limp as a rag doll. Ethan dives toward him. He impacts with Walker, misses, tumbles. Ethan recovers, turns, tries again. They collide, stabilize, falling together. Ethan sees Walker has lost his air tank. They plunge into the second storm layer, altimeter spinning. Turbulence. Lightning. Ethan rips the broken hose from Walker's helmet. He takes several deep breaths before attaching his own tank to Walker's helmet. Meanwhile, A RED WARNING LIGHT FLASHES. Lighting explodes all around them. Walker slowly resuscitates. His eyes focus, then go wide: WALKER HUNT. They emerge from the second storm layer over the bright lights of Paris. And they are low. No time.  Cherry Rev. (Nov 16 '17) - 1908   15.",
      "characters": [],
      "action_text": "Ethan yanks Walker's ripcord. Walker is torn up and away. Ethan rolls over and sees a massive, glass roofed building coming up fast - bright lights glaring up from within. He yanks his ripcord.  Green Rev. (June 11, 17)   15A.",
      "dialogue_count": 0,
      "word_count": 311
    },
    {
      "scene_number": 7,
      "slugline": "EXT. ROOFTOP - PARIS' GRAND PALAIS - NIGHT 13   13  The Grand Palais is a massive, elongated, 19th century structure, the roof is made entirely of glass. A giant, spired dome rises from the center. Ethan’s chute barely deploys as he barely misses the spire. He's going to hit hard. Then his chute is impaled on the spire above him. It tears, then snags, yanking him violently to a halt. Ethan stifles the pain. He's still twenty feet above the roof with no other way down. He yanks a release and falls. He slams into the roof, splinter a glass pane. He lays there, winded and in pain. A beat later, Walker drifts past, landing gently. He turns, sees Ethan in a heap, notices: WALKER You lost your oxygen tank. Off Ethan’s look...  EXT. PALAIS ROOF - TIMECUT 14   14  Ethan and Walker make their way along the roof. Despite lightning splitting the sky, fireworks explode around the Eiffel tower. Ethan heads toward a service door and makes short work of the lock.  INT. PALAIS CATWALKS - STAIRS - NIGHT 15   15  Music is blasting and lights are flashing OS. Ethan and Walker drop down from the ceiling, and navigate under an overhanging beam to a catwalk overlooking: The rave from hell - thousands of people moving to driving music. A massive sun-like disk on one end of the space periodically floods the Palais with warm, orange light. From here, Ethan can see a GRAND STAIRCASE below. Underneath it he sees A ROPED OFF PRIVATE ENTRANCE where GORGEOUS WOMEN and WEALTHY, THUGGISH MEN wait in line at the VIP LOUNGE. ETHAN That’s where the Widow is meeting Lark. Ethan can see a winding staircase leading down to the top of the grand staircase.  Cherry Rev. (Nov 16 '17) - 1908   16.",
      "characters": [],
      "action_text": "ETHAN (CONT’D) We need to get to those stairs. WALKER (checking watch) We’ve got 15 minutes. Ethan moves up the stairs. Walker follows.  Cherry Rev. (Nov 16 '17) - 1908   16A.",
      "dialogue_count": 0,
      "word_count": 333
    },
    {
      "scene_number": 8,
      "slugline": "INT. PALAIS CATWALK - NIGHT 16   16  We are inside the ring of the glass dome, 120 feet above a slowly moving vortex of humanity below. Ethan sees the stairwell he needs to reach. One problem: Huge sections of the walkway are missing. Tape, chains and other gear indicate there is construction going on. There is no way to get to the floor below. Ethan looks to his left and spies a steel cable attached to the catwalk just beneath his feet. It is one of four that meet at a small ring in the center of the dome, forming an x. He looks to his right and sees the sloping wall of the Palais and a glass enclosed booth about halfway between him and the ground floor. He makes a mental calculation. Walker impatiently checks his watch. Ethan pulls off his parachute, and gingerly steps out onto the wire. He tests it with his foot - it wobbles, but holds. He slowly reaches down to the cable, grabs it and - slips. He swings underneath the cable, scrambling to bring his legs around it, steadying, then inchworming along the wire. A bewildered Walker watches as Ethan reaches the center ring where he loosens the two cross cables stretching left and right, until they hang on by a thread. He releases his legs, about-faces and continues across with just his hands. He makes it to the far side. He unscrews the cable entirely, and plummets, swinging away from us. CLOSE ON: the center ring. The cross cables strain, barely holding, and he swings back up to Walker. Shocked that this worked, Walker stares. Ethan reaches over, attaches the end of the cable to Walker’s chute harness, puts a knife between his own teeth and pulls Walker off the ledge. Like a pendulum they swing back across, Walker terrified. CLOSE ON: The Center ring. The left and right cables snap, instantly doubly the length of the cable holding Ethan and walker. They swing back in the direction they came, heading for the window booth Ethan spied earlier. Ethan slides down the cable, knife between his teeth, and at the last second, cuts Walker’s harness. Their momentum launches them through space toward the glass enclosed booth.  Cherry Rev. (Nov 16 '17) - 1908   17.",
      "characters": [],
      "action_text": "INT. GRAND PALAIS - STAGING 16A   16A SMASH. Ethan and Walker crash to the floor in a heap. ETHAN Okay... Back on schedule. WALKER Get off me. Ethan stands, offers a hand. Walker swats it away. TIME CUTS: Ethan and Walker unpack their gear from Walker’s chute bag: Change of clothes, mask machine, hypodermic, tracking devices. Ethan checks the mask machine to make sure it’s functioning. He hands it to Walker. ETHAN Be very careful with this. As Walker slips it back in it’s case, Ethan loads the hypodermic. WALKER Do we really need that? Ethan just gives him a look. Walker tears open a vacuum- sealed bag with his clothes inside.  Cherry Rev. (Nov 16 '17) - 1908   17aA.",
      "dialogue_count": 0,
      "word_count": 503
    },
    {
      "scene_number": 9,
      "slugline": "INT. GRAND PALAIS - MAIN FLOOR - NIGHT 17   17  Ethan and Walker emerge from a doorway, having changed from their flight suits. They pull out phones, tracking Lark, and move into the beating heart of the rave. From here, Ethan can see the VIP lounge more clearly. Close on bouncers scanning ID bands of VIPs entering. ETHAN They’re meeting in there in ten minutes. WALKER I’m still not picking him up. Ethan is bumped from behind as a A LONE WOMAN IN A SUIT passes him. Ethan grabs her arm and she turns -- they make eye contact, surprised to see one another. She is ILSA FAUST. Ethan studies her. She wants to say something, but looks at Walker and remains silent. So does he. Neither one can. She backs off, turning into the crowd. Before Walker can ask: ETHAN None of your concern. Walker get’s a buzz on his phone. WALKER I got him. ETHAN Split up. They move off through the crowd, holding the phones at waist height. We stay with Ethan. Ethan turns into the crowd, using his phone to guide him. A flailing raver knocks it out his hands.   It’s lost amongst the seething bodies, kicked away. WALKER (on comm) Ethan...Ethan...if you can hear me...I can see him...  Cherry Rev. (Nov 16 '17) - 1908   17A.",
      "characters": [],
      "action_text": "ETHAN Where? WALKER (on comm) ...heading to the bathroom. Ethan moves upstream, struggling against a crowd ever moving toward the center of the Palais. He manages to find Walker. Walker nods and they head for the restroom.  Cherry Rev. (Nov 16 '17) - 1908   18.",
      "dialogue_count": 0,
      "word_count": 267
    },
    {
      "scene_number": 10,
      "slugline": "INT. RESTROOM - NIGHT 18   18  The bathroom is large, divided down the center by a row of sinks, mirrors everywhere. A RANDOM MAN is washing his hands, speaking in French to ANOTHER MAN at the urinal. They are drunk - a little rowdy. Walker checks his device. Nothing. Ethan and Walker split up, going down separate sides of a partition. The partition makes it difficult to see the whole bathroom at once. Mirrors everywhere add to the confusion. Walker’s device indicate Lark is on the other side of the partition. Ethan and Walker split up, each rounding a different end. And there he is: LARK (40s, Asian, cool), at the middle of five sinks, washing his hands. Ethan palms the needle, steps around the partition to jab Lark when: A THIRD RANDOM MAN steps to the sink between them, oblivious. Ethan has no choice but to step to a sink as well and wash his hands, waiting. Walker rounds the far side of the partition and takes his place at the far sink. Now they are on either side of Lark, waiting for the random man to leave. The other man finally leaves. Ethan watches him go.   He turns back to see Walker, making eye contact directly with Lark. Ethan moves, stabs the syringe at Lark's neck but Lark spins. He slaps the syringe away and slams Ethan into the sink. WHACK. Walker bashes Lark upside the head with the full weight of his messenger bag. Lark drops. The needle is nowhere to be seen. Ethan stands in considerable pain. He recovers and looks for the needle. ETHAN Where’s the needle? WALKER Didn’t need it. LOUD VOICES OS. Someone is coming. Shit. ETHAN Get him up.  Cherry Rev. (Nov 16 '17) - 1908   19.",
      "characters": [],
      "action_text": "They quickly grab Lark and drag him into a stall just as the door opens and THREE MORE FRENCHMEN ENTER, drunker than the French, making crude gesticulations.  INT. BATHROOM - STALL - NIGHT 19   19  Ethan closes the stall door and locks it just in time. Lark is on the toilet, out cold. Walker holds up Lark’s head by his hair, while Ethan pulls out the face mask machine. He rests it on Lark’s lap and opens: The latest mask machine. Sadly, it has a huge dent in it from where it hit Lark’s skull. Ethan shakes his head. Walker mouths “sorry.” Rowdy French voices continue OS. Ethan powers up the machine. It’s screen is cracked, colors bleeding, moving parts sluggish. And a toilet stall for three is not ideal. Ethan takes out a 3D scanner. A red laser grid shines on Lark’s face. ON THE SCREEN: A flickering image of Lark’s face slowly takes shape. On the machine itself, a face is forming. Meanwhile:  INT. BATHROOM - NIGHT 20   20  The first Frenchman turns from the urinal to go to wash his hands. He double takes when he sees: THREE PAIRS OF FEET in the same stall. He stifles a laugh and whistles to his jabbering friends. Now they see the feet. The others turn, and they start laughing approaching the cubicle.  INT. STALL - NIGHT 21   21  Ethan and Walker freeze. A question in French OS. Loud laughter mixed with kissing sounds. Ethan sighs. This is all he needs. Louder knocking, voices. A loud bang. Ethan and Walker press their hands to the door. The French leave. Walker exhales, relieved. Ethsn goes back to scanning Lark when he notices the eyes on the mask are opening. He looks at Lark. REVEAL: Lark’s eyes are opened. Focused. He lunges upward-  Cherry Rev. (Nov 16 '17) - 1908   20.",
      "dialogue_count": 0,
      "word_count": 605
    },
    {
      "scene_number": 11,
      "slugline": "INT. BATHROOM - NIGHT 22   22  Overwhelming both of them, Lark kicks Ethan through the stall door, crashing down to the floor. He and Walker continue to trade blows, Lark smashing the mask machine into Walker’s face. Walker grabs but Lark flips over his arm, bringing Walker down hard. Rising quickly, Lark punches Walker in the throat before kicking Ethan, who stumbles back. Ethan fends off blows trying to hold his ground. Walker recovers and grabs Lark, throwing him through the center mirror. Lark smashes through several sinks and lands heavily. Lark recovers, yanks a metal U-bend from a broken sink, and goes for Ethan. Walker attacks Lark from behind. Lark breaks free, uses the pipe to clothesline Walker to the floor, going after Ethan again. They grapple. Lark ends up behind Ethan, trying to pull the jagged end of the pipe into Ethan’s throat. In the mirror he sees Walker whip off his jacket and advance up behind him, enraged. Lark pivots to bring Ethan between them, but Ethan kicks off the wall, breaking free. Lark punches Ethan in the throat, staggering him. Walker attacks, pressing Lark to the wall, hammering him with body blows. Lark turns the tables, gets the better of Walker. Ethan tries to get back up to help but the moment he stands, Lark kicks him in the chest, sending him down again. Lark finishes Walker, driving him to his knees, kicking him in the face and knocking him out cold before beckoning Ethan. Ethan charges, picking up Lark and smashing him through a wall, landing at the base of the cubicle. They struggle on the floor. Lark spies his gun, grabs it. He and Ethan grapple for the gun. Lark has the upper hand, slowly bringing the gun to Ethan’s face. Ethan desperately tries to force it away. But he can’t win... BANG. Lark falls down dead. Shot in the head. Ethan spins, grabbing the gun, looking for the shooter. REVEAL: Ilsa, standing in the doorway, gun in hand. ILSA Shit.  Cherry Rev. (Nov 16 '17) - 1908   21.",
      "characters": [],
      "action_text": "Beat. Stunned silence. Ethan picks up the needle, staring at it, then at the body. He throws it away. The three survivors gather over the dead man. WALKER Can you... still make a mask? ETHAN I need a   face   to make a mask. ILSA Sorry. I was aiming for his chest. ETHAN What are you doing here? ILSA It’s good to see you too. WALKER I’m sorry.   I’m confused... You are..? ETHAN An old friend. Ethan grabs walkers jacket and bends down, putting it on Lark. Ethan and Walker drag the body inside cubicle. Walker steps out, studies Ilsa. She is a sphinx. Walker pulls a phone from his pocket and dials. WALKER (INTO PHONE) We’re wet. Have extraction stand down. Send sanitation. North men’s room.  Cherry Rev. (Nov 16 '17) - 1908   21A. Meanwhile, Ethan rifles through Lark’s pockets, finding a hotel key card and a cell phone. He pulls the ID band of Lark’s wrist and steps out, facing Ilsa. ETHAN  You didn’t answer my question, what are you doing here?  ROWDY VOICES OS. Ilsa steps to Walker, grabs his face. The door bursts open and THREE REVELERS see: Ethan, Walker and Ilsa standing in a pool of blood. Ilsa hold’s Walker’s head in his hands. ILSA That’s it. Just keep your head back ‘til the bleeding stops. That’s it. Ethan steps toward the Revelers: ILSA (CONT’D)  What, what is it? You want some?  The revelers quickly back out of the room. When they’re gone: ETHAN You’re not here by accident. Who sent you? ILSA I can’t tell you that.  Cherry Rev. (Nov 16 '17) - 1908   22. Ethan puts the bracelet on. WALKER What are you doing? ETHAN I have a date with the White Widow. Ethan removes his jacket, dusts it off. WALKER (re: body)  He   had a date with her.   You   look nothing like him. ETHAN Let’s hope they haven’t met. WALKER  Hope   is not a   strategy . ILSA You must be new. ETHAN The Widow is our only lead. I need to be this guy for five minutes. I just have to make it work. ILSA Don’t do it. They both look at Ilsa. ETHAN What? What is it? (when she hesitates) What aren’t you te",
      "dialogue_count": 0,
      "word_count": 3599
    },
    {
      "scene_number": 12,
      "slugline": "INT. STUDY - WIDOW'S HOME - NIGHT 35   35  We never left. Ethan considers the scenario for a beat: ETHAN   * Kill everyone. That’s your plan.   * ZOLA   * There will be no witnesses.   * * What guarantee do I have that Lane   * walks out of this alive?   * ZOLA   * He’s in an armored box. We’ll pull   * him out when it’s safe. You want   * your plutonium, this is the price.   * Or do you draw the line at killing   * cops?   * Beat. All eyes are on Ethan. He is Lark now and has to play   * the part. He glares at Zola.   * WIDOW   * That’s John Lark you’re talking to.   * Ethan eyeballs Zola.   * ETHAN   * I kill women and children with   * smallpox. I have no line/there is   * no line.   * CLOSE ON The Widow. She is not exactly pleased with this   * situation, but she covers.   * WIDOW   * Sleep well, everyone. Busy day   * tomorrow.   * And she leaves.   *  Tan Rev. (Jan 31 '18) - 1518   34.",
      "characters": [],
      "action_text": "OMITTED 36   36   *  OMITTED 37   37   *  Tan Rev. (Jan 31 '18) - 1518   35-38. *  EXT. TROCADERO - DAWN 37A   37A   *  Overlooking the Eiffel Tower. Deserted in the pre-dawn hours after a rain storm. Walker moves toward a stationary figure across the wide open expanse. The figure turns, REVEALING: Sloane. SLOANE How did Lark die? WALKER A woman. A friend of Hunt’s. I don’t have a name. SLOANE I have a pretty good idea. What about Lane?  Tan Rev. (Jan 31 '18) - 1518   39. WALKER We’ll take care of it. SLOANE (realizing) You have got to be kidding me. WALKER You want Lane out of prison, this is how it gets done. SLOANE I wanted   Lark   to break him out,   not  Ethan Hunt. I wanted   Lark   at the exchange,   not   Ethan Hunt. I wanted information that only Lark could give us. WALKER You may still have the chance. SLOANE Perhaps you’re forgetting the corpse we pulled out of the men’s room at the Grand Palais. WALKER I’m guessing that wasn’t Lark. More likely one of Lark’s recruits. SLOANE Not according to our intelligence. WALKER Intelligence gathered by whom? Beat. SLOANE Hunt. WALKER You’ve long held suspicions that Lark was an American agent. Someone who knew every move we were making. Someone who could come and go like a ghost.  Green Rev. (June 11, 17)   39aA. SLOANE You’re suggesting Hunt is John Lark. (off his look) You’re reaching, Walker. Trying to save your ass. It won’t work. WALKER Think about it. Would a man as careful as Lark really stick his neck out like that? For a face-to- face with the   White Widow ? SLOANE (having to admit) He’d send a proxy. WALKER A   decoy . And if he was really clever, he’d hire his lady-friend to kill that decoy in front of a reliable witness. Me. As Sloane considers: WALKER (CONT’D) The dragnet is closing in on his terrorist alter ego. So he pays a man to play the part of Lark and has him killed. Then, under the guise of serving his country... SLOANE He assumes his own secret identity. WALKER Free to operate at will... With",
      "dialogue_count": 0,
      "word_count": 962
    },
    {
      "scene_number": 13,
      "slugline": "EXT. HELIPAD - DAY 41   41  The roof of Paris’ semi-brutalist finance ministry. In the back of a MILITARY HELICOPTER a man sits, unmoving, his back to us. The heli touches down and the side door opens. TWO SOLDIERS IN TACTICAL GEAR grab the man, lifting him onto the pad to reveal SOLOMON LANE.   Lane wears a faded white straightjacket, his ankles chained to each other. His grizzled beard and tousled mane contradict the intense focus in his eyes. MORE SOLDIERS are waiting for Lane and his escort at the edge of the pad.  Blue Rev. (April 29,17)   40.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 100
    },
    {
      "scene_number": 14,
      "slugline": "INT. FINANCE MINISTRY - CORRIDOR - DAY 42   42  MORE SOLDIERS join. Lane accumulates them as he goes.  INT. FINANCE MINISTRY - PARKING GARAGE 43   43  Lane is led into an armored box truck, in the middle of a motorcade. He sits. The chain running from his wrists to his ankles is bolted to the floor. He’s left alone, the door slamming shut.  INT. ARMORED BOX TRUCK - DAY 43A   43A  Lane sits, contemplating, as the truck drives through Paris.  EXT. FINANCE MINISTRY - DAY 44   44  The box truck emerges into the ministry’s inner courtyard, escorted by armored escort vehicles and police motorcycles. It roars through and exits onto the street. As the motorcade heads for the river we ANGLE ON: A HELMETED, BLACK-CLAD RIDER astride a motorcycle. We are over the rider’s shoulder, watching the motorcade. The Black Rider starts the bike and cruises after it.  EXT. ROOFTOP - DAY 45   45  A THUG watches the approaching motorcade from a rooftop. He says one word into a walkie talkie. THUG (IN FRENCH) Go.  INT. TRAILER TRUCK - DAY 46   46  Over the shoulder of A DRIVER as he starts the engine and proceeds up the street - we see the river up ahead, perpendicular.  EXT. BRIDGE - PARIS - DAY 47   47  The motorcade crosses that same bridge over the Seine river, heading toward the intersection at the far end.  Cherry Rev. (Nov 16 '17) - 1908   41.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 241
    },
    {
      "scene_number": 15,
      "slugline": "INT. TRAILER TRUCK - DAY 48   48  The truck is accelerating steadily as it approaches an intersection - the perpendicularly Seine River is visible just beyond. The Driver is going much to fast to make the turn. That’s the point.  Blue Rev. (April 29,17)   41A.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 46
    },
    {
      "scene_number": 16,
      "slugline": "EXT. INTERSECTION - DAY 49   49  The truck roars out from between two buildings, wheels cranking hard. The truck rolls inevitably, slamming down on it’s side and skidding across the four lane road.  INT. LEAD MOTORCADE VEHICLE - DAY 50   50  The COP driving the lead car sees the accident up ahead just as he’s turning. The road is completely blocked by the accident. The MOTORCYCLE COPS in front of him skid to a halt, fan out, wave the truck to keep moving, go past.  EXT. STREET - OVER MOTORCYCLE COP - DAY 51   51  The motorcade diverts down a ramp to the tunnel by the river. ANGLE ON: The Black Rider drives straight through the intersection, not following the motorcade, but watching as it is diverted.  INT. LEAD MOTORCADE VEHICLE - DAY 52   52  OTS POV as the vehicles barrel down the tunnel.  INT. ETHAN’S TRUCK - CAB - DAY 53   53  Ethan stares at the camera feed. He can see the motorcade approaching. He pulls a hood down over his face until only his eyes are visible. Walker does the same.  EXT. TUNNEL EXIT - DAY 54   54  At the far end of the tunnel, another truck is waiting to block the way. Zola, heavily armed and armored, is at the wheel, watching through a camera of his own. A THUG RIDES SHOTGUN. The Thug opens a slot behind him, gives a thumbs up. SEVERAL MORE HEAVILY ARMED GUNMEN in back charge their weapons. This is going to be ugly.  INT. LEAD MOTORCADE VEHICLE - DAY 55   55  OTS POV down the tunnel. No sign of trouble from here.  Cherry Rev. (Nov 16 '17) - 1908   42.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 280
    },
    {
      "scene_number": 17,
      "slugline": "INT. ETHAN’S TRUCK - CAB - DAY 56   56  The lead truck passes. Ethan’s hands tense on the wheel. Walker sinks deeper into his seat. Ethan punches the gas. Walker inhales. Ethan went too soon.  INT. ETHAN’S TRUCK - BACK - DAY 57   57  The gunmen in the back of Ethan’s truck are slammed against the back of the truck in a heap and-  INT. ETHAN’S TRUCK - CAB - DAY 58   58  BAM - Ethan cuts right through the heart of the motorcade, slamming into the box truck broadside. The impact launches the box truck sideways toward the Seine.  INT. LANE’S TRUCK - BACK - DAY 59   59  IMPACT. Lane is slammed against the side of the truck.  INT. COP CAR - DAY 60   60  In the car immediately following the box truck. OTS POV as THE DRIVER slams on the brakes. On impact, we’re thrown into:  INT. ETHAN’S TRUCK - CAB - DAY 61   61  The box truck flies into the river. IMPACT.  INT. LANE’S TRUCK - CAB - DAY 62   62  We’re thrown into the cab of the box truck. DRIVER and SHOTGUN are rocked as they skid sideways into the water.  INT. LANE’S TRUCK - BACK - DAY 63   63  IMPACT. Lane slams into the wall as the truck hits the river. The vehicle rolls over, immediately taking on water. Lane, you will recall, is chained to the floor.  Cherry Rev. (Nov 16 '17) - 1908   43.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 242
    },
    {
      "scene_number": 18,
      "slugline": "INT. ETHAN’S TRUCK - CAB - DAY 64   64  Ethan sees a cop already jumping out of his car and charging his weapon. Ethan puts the truck in reverse and-  INT. ETHAN’S TRUCK - REAR - DAY 65   65  The Gunman are slammed against the back of the cab again.  INT. ETHAN’S TRUCK - CAB - DAY 66   66  Ethan looks through the windshield as the cop runs after him, firing. Bullets pepper the glass as: IMPACT  INT. GARAGE PORT - DAY 67   67  Ethan’s truck smashes through a rolling steel door at the back of the garage port and onto:  EXT. STREET - DAY 68   68  The truck emerges into morning traffic, skidding sideways.  INT. ETHAN’S TRUCK - REAR - DAY 69   69  The gunmen in back are slammed into the side wall.  INT. ETHAN'S TRUCK - CAB 70   70  Cars skid, horns blare. Ethan takes off.  INT. ETHAN’S TRUCK - REAR - DAY 71   71  The gunmen in back slam into the back doors of the truck. The doors burst open and they spill out onto the street.  EXT. STREET - DAY 72   72  Cop cars and motorcycles emerge from the garage port and give chase. A FEW COPS stop to apprehend the battered gunmen. The rest go after Ethan.  Blue Rev. (April 29,17)   44.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 218
    },
    {
      "scene_number": 19,
      "slugline": "EXT. TUNNEL EXIT - DAY 73   73  Zola drives slowly into the open and stares slack-jawed at the mess down the tunnel. TWO STUNNED COPS emerge from the sinking truck. Cops run around the tunnel in total confusion, screaming into radios. Zola hears it all on a police scanner. Zola’s Thug looks at him, bewildered. Zola guns the engine and takes off.  INT. BOX TRUCK - DAY 74   74  The truck is filling up with water, rolling slowly. Lane is underwater, then above the water, then under again, gasping desperately for air in the rapidly shrinking pocket. And then the air is gone. Lane yanks at the chains on the floor, seconds from drowning when: A BLINDING LIGHT cuts between the two doors. A beat later and they open TO REVEAL: A SCUBA DIVER with a white-hot acetylene blowtorch. He swims in, shoving a regulator in Lane’s mouth. Lane inhales desperately as the diver shoves a black bag over his head. Lane tries to resist, but there’s little he can do. The diver cuts the chain holding Lane to the floor. Then he grabs the chains holding Lane’s wrists and yanks him out of the truck.  INT. ETHAN’S TRUCK - DAY 75   75  Ethan guns it, using the considerable mass of the truck to frighten oncoming traffic out of his way. But he’s also blazing a clear path for his many pursuers.  EXT. SEINE RIVER SURFACE - BRIDGE - DAY 76   76  Under one of the more modern bridges spanning the river. In the distant background, we can see where the truck went in the river. Police boats are circling now. But we’re looking at the boat in the foreground.  Cherry Rev. (Nov 16 '17) - 1908   45.",
      "characters": [],
      "action_text": "It is moored to the bridge, a massive caisson hiding it from the view of the police. A SILHOUETTED FIGURE sits at the front of the boat. REVEAL: LUTHER STICKEL. He’s watching through binoculars. He hears a sound and turns, moving to the side of the boat, and reaches down. A DIVER SURFACES just beside the boat and yanks off his mask TO REVEAL: BENJI DUNN. Lane surfaces just behind him, head still bagged. Luther hauls Lane out of the water. TIME CUT: As Benji strips off his scuba gear, Luther scans Lane with a sensor of some kind. It detects a signal on Lane’s neck. Luther peals back the collar of Lane’s straight jacket, applies an adhesive patch, rescans. No more signal.  INT. ETHAN TRUCK - DAY 77   77  Ethan slams on the brakes, cranks the wheel, skids into:  INT. IMPOSSIBLY NARROW ALLEY 78   78  There’s no way the truck will fit. And that’s the point. IMPACT We are thrown from the vehicle and watch it wedge violently in the alley. Ethan and Walker kick out the windshield and scramble onto the hood of the truck as cops screech to a halt just behind them. But the truck has the alley completely blocked. Ethan and Walker jump on a pair of waiting motorcycles. Walker fires up his engine and takes off around a corner. Gone. But Ethan's bike won't start.  EXT. STREET - DAY 79   79  Walker weaves through traffic, quickly but not conspicuously. He looks back and realizes?  Cherry Rev. (Nov 16 '17) - 1908   46. WALKER Hunt? Where are you?  INT. IMPOSSIBLY NARROW ALLEY - DAY 80   80  Ethan tries the starter again. ETHAN Don't wait for me. Meet me at the garage. WALKER (ON COMM) What is it? What's wrong? ETHAN Meet me at the garage. He looks behind him and sees COPS climbing over the top of their truck. One shouts into a radio. The other aims and opens fire. Ethan's bike starts and he takes off around the corner just as bullets fly. But he's been made. ETHAN (CONT’D) BENJI. DO YOU COPY?  EXT. ICE CREAM TOURIST STREET 81   81  Ethan rounds the corner and onto a wide, four-lane ",
      "dialogue_count": 0,
      "word_count": 758
    },
    {
      "scene_number": 20,
      "slugline": "INT. POLICE CAR - DAY 83   83  OTS POV chasing Ethan across the bridge, through cross- traffic. A COP shouts into a radio.  EXT. UNDER BRIDGE - DAY 84   84  Zola and his gunmen abandon their truck, tossing their gear into the back, tucking guns in the backs of their waistbands. Police scanner in hand, Zola crosses to three waiting cars, listening to the frantic police chatter.   A moment later, Zola and his thugs are driving away.  EXT. STREET - DAY 85   85  Walker drives calmly through the city, looking out for cops. What he doesn't know to look out for is the Black Rider who is following him at a distance.  EXT. BIKE CHASE 86   86  See Chase beats in Scene 89.  OMITTED 86 A   86 A  Cherry Rev. (Nov 16 '17) - 1908   48.",
      "characters": [],
      "action_text": "INT. ZOLA’S CAR 87   87  Zola listening to the police chatter. He speaks into a radio. ZOLA [Spread out. Find Lark before the police do.]  EXT. STREET - PARIS 88   88  Zola’s car drives straight. The TWO CARS following split up, turning left and right.  EXT. BIKE CHASE CONTINUES 89   89  Rue Pyramide - Ethan races through heavy oncoming traffic, without a tail, but sees cops incoming.   He swerves, jumping a curb and heading down into a underground car park.   A cop car follows. Ethan blasts through, narrowly avoiding another car pulling out. The Cop sees it too late, and T-bones it, blocking the path. Ethan shoots back up onto the street, and turns onto Avenue de l’Opera Avenue de l’Opera - Ethan races along the busy street, heading for the Opera house. Two cops pulling in behind him, gaining.   A car swerves out in front of him, so he weaves into oncoming traffic, tunneling between cars stuck in traffic. He breaks clear, just clearing a crossing truck that takes out his pursuers. He angles onto a side street. In the clear, he drives up a quiet street until: Cops skid out of the streets behind him, sirens flashing. He guns it. Ethan rides straight onto the Arc de Triomphe, the wrong way. Weaving through hectic incoming traffic, he makes for the far side, losing the cops in the mayhem. He exits the circle down another street. Narvik - Ethan speeds onto a roundabout and stops, looking around. Cops come from every street. He revs the bike, drifting the back wheel round in a circle toward the only empty side street and goes for it, cops in pursuit.  2nd Blue Rev. (mm/dd/yy)   48A. EXT. MARKET STREET 90   90  Ethan rounds a corner, going like hell toward a perpendicular median.  Cherry Rev. (Nov 16 '17) - 1908   48AA. He looks behind him at two police motorcycles still in pursuit. A car pulls out in front of him. He sees it too late. IMPACT. Ethan t-bones the car and is launched over the roof. He lands hard on the median. Stunned, he pulls a knife from his boot, stagger",
      "dialogue_count": 0,
      "word_count": 1137
    },
    {
      "scene_number": 21,
      "slugline": "EXT. BRIDGE INTERSECTION - DAY 95   95  Cop cars whiz past, none the wiser. We've made it. WALKER The name’s Walker by the way. BENJI Was the little car your idea? Ethan turns down a side street. SLAP. A bullet punches through windshield and the bag on Lane’s head. He slump across the front seat. An instant of stunned horror, then Ethan sees: THE BLACK RIDER on an overpass above a three way intersection up ahead, rifle in hand. Ethan punches the gas, driving TOWARD the rider. The rider opens fire. Bullets pepper the roof and hood of the car until it vanishes under the overpass and out of sight. Ethan slams the brakes, spins the car.  INT. BMW - DAY 96   96  ETHAN Everybody out. Luther, Benji and Walker bail. Ethan guns the engine, taking the car back into the open, left down the three way intersection.  Cherry Rev. (Nov 16 '17) - 1908   51.",
      "characters": [],
      "action_text": "EXT. SIDESTREET 97   97  The road is flanked by a stairwell leading up to the overpass. The black rider is racing down it on the back of a screaming motorcycle, hot on Ethan's tail.  OMITTED 98   98  INT/EXT. BMW 99   99  Ethan looks down at Lane on the front seat, rips the bag off his head, expecting gore. To our surprise, Lane sits bolt upright, hissing in pain. He's been shot through the earlobe. His eyes adjust and he double takes when he sees Ethan. He scowls. Rue de Garibaldi - Ethan pulls into a long narrow parking lot underneath the Metro tracks.   Racing through parked cars, Ethan floors it. The Rider follows, gaining. Ethan speeds through an intersection, narrowly missing cross traffic. A car skids to a halt, barely missing him and blocking the intersection. The Rider skids to avoid it, swerving out from under the metro and into oncoming traffic. The Rider is now on a parallel track to Ethan’s left, gaining. The rider gets up along side Ethan and shoots again, shattering the driver’s side windows. OVER ETHAN as a car turns into the lot, coming at him head on. Ethan skids, swerves left, smashing through a row of parked motor-scooters, cutting directly across the Rider’s path. The rider overshoots, skids, and goes after Ethan through a busy intersection filled with cross traffic. Paris Streets - Ethan races through the streets of Paris, pursued by the rider. Rue de Barres - Ethan turns down an alley, and flies towards the end, the rider hot on his tail.   He gets to end, sees a flight of stairs, and brakes desperately spinning the car. Too late. Mid spin, the car takes off, flying off the stairs, landing and skidding to a halt. Ethan roars off. The rider follows, jumping the stairs, maintaining pursuit.  Cherry Rev. (Nov 16 '17) - 1908   52. Palais Royale - Ethan rounds another corner, and flies over a humped road.   The rider is right behind him. Ethan turns again, and the rider breaks off, turning into: The Concorde colonnade parallel to Ethan’s street - i",
      "dialogue_count": 0,
      "word_count": 532
    },
    {
      "scene_number": 22,
      "slugline": "EXT. PARIS STREET - VARIOUS - DAY 100   100  The rider appears up ahead, sitting in the road broadside, visor up, aiming at Ethan. Ethan’s eyes narrow. He slams on the brakes, skidding to a halt and sparing the rider a nasty collision. CLOSE ON: The rider, lowering the weapon TO REVEAL: Ilsa. Her face flashes many emotions at once: Hurt, anger, betrayal. CLOSE ON: Lane, seeing Ilsa. Ilsa’s eyes narrow. She shifts focus to Lane, snaps the weapon up as: Ethan punches the gas just as Ilsa fires. The bullet pierces the windshield, narrowly missing Lane. Ethan plows into Ilsa’s bike, sending her over the roof and into the street. She gets up, watches him drive off, and then hobbles off the street, out of sight.  Cherry Rev. (Nov 16 '17) - 1908   52A.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 136
    },
    {
      "scene_number": 23,
      "slugline": "INT. ETHAN’S CAR 101   101  The car is shot to pieces. Ethan has had a long morning. LANE That was Ilsa? ETHAN Shut up. Lane can wait. He sits back and savors the fresh air rushing through the shattered windows. LANE Very interesting... It’s good to see you again, Ethan.  EXT. PARIS STREET - DAY 101A   101A  Ilsa manages to pick herself up and pull off her helmet, watching Ethan’s car speed away. The sound of approaching sirens gets her moving. She limps down the alley she came from. RACK FOCUS TO REVEAL: ZOLA, parked just up the street, having seen the entire incident.  INT/EXT. BACK-ALLEY - DAY 102   102  A graffiti covered space under an abandoned overpass somewhere on the outskirts of Paris. Sirens in the distance. Luther, Benji and Walker are waiting by a fresh car as Ethan drives in. Ethan is out of the car in a flash. Luther and Benji open the passenger door, coming face to face with a scowling Lane. Benji doesn’t mask his disappointment. BENJI Look who’s still alive. Ethan crosses to Luther who hands him a stopwatch.   * LUTHER   * He has a microwave tracker in his   * neck.   * ETHAN   * You know what to do.   *  Tan Rev. (Jan 31 '18) - 1518   53.",
      "characters": [],
      "action_text": "Walker yanks Lane out of the car and sits him on the remains of a metal crate. Luther and Benji pull on rubber gloves   * before approaching Lane. Benji rips the adhesive patch from   * Lane’s neck.   * BENJI   * I want you to know this won’t hurt   * enough.   * ETHAN   * Ninety seconds.   *  Tan Rev. (Jan 31 '18) - 1518   53aA. Benji plunges a needle into Lane’s neck. He never flinches.   * Luther holds a device that scans Lane’s neck, searching for   * the exact location of the signal. A light on the device alternates from solid red to fleeting green. ETHAN (CONT’D) You and your Apostles think we’re   * gonna trade you for the missing   * plutonium. I’m here to tell you   * that’s never going to happen. LANE Your mission, should you choose to accept it. I wonder... Did you ever choose not to? Did you ever stop to ask yourself who was giving the orders or why? While every day the master you serve moves one step closer to ending the world? LUTHER Strange accusation coming from a terrorist. ETHAN 60 seconds.   * LANE Terrorists are silly little   * schoolboys desperate for attention - hoping to shape public opinion through fear. I don’t care in the least what people think or feel. In my experience, they don’t do either for very long. BENJI And that’s how you justify bombing   * factories and vanishing civilian airplanes. Or stitching me into an explosive vest.   * LANE   * When I down a plane it is to kill a   * specific passenger. When I bomb a   * factory it is because I want it   * destroyed. In either case, I   * eliminate a vital part of a corrupt   * and crumbling system.   *  Tan Rev. (Jan 31 '18) - 1518   53A-53Aa. LANE (CONT’D)   * One you have helped perpetuate. One you have long since ceased to question. BENJI And the explosive vest? LANE Consider it unfinished business, my   * funny little friend.   * ETHAN   * Luther.   * LUTHER   * Almost there.   * LANE   * You see the end as clearly as I do, Ethan.   Governments the world over are descending into mad",
      "dialogue_count": 0,
      "word_count": 1928
    },
    {
      "scene_number": 24,
      "slugline": "EXT. PROMENADE RENÉ CAPITAN - DAY 105   105  A secluded path along the Seine. Notre Dame in the background. Ethan walks alone with the river to his left. The Widow approaches from the other direction, Zola and another goon behind her, watching. WIDOW You’re just full of surprises, Lark. ETHAN Zola’s plan was bad from the word go. You’d have lost all your men and Lane would’ve been killed in the crossfire. I had to improvise. WIDOW Why not say that in the first place? ETHAN Because I don’t trust your people. Especially not your brother. WIDOW Zola is loyal to me. ETHAN That’s the problem. He’d kill to protect you. He thought doing business with me was a bad idea, did he? And who else knew we were meeting at the Palais?  Cherry Rev. (Nov 16 '17) - 1908   56.",
      "characters": [],
      "action_text": "WIDOW You said it yourself, the Americans- ETHAN If the Americans wanted me dead, I’d be dead. The shooters at the Palais were second rate. Zola hired outside men to keep his hands clean and they went off half-cocked. He was trying to protect you from me. Instead, he nearly got you killed. She thinks about this, turns, looks back at her brother. She turns back to Ethan, back to business. WIDOW Family.   What can you do? So where is Lane? Because he’s certainly not at the bottom of the Seine. ETHAN I have him. He’s safe. WIDOW Then, where’s my money? Ethan hands her an envelope. ETHAN Swiss bank account. Thirty million, as promised. Now where do I meet the courier? WIDOW Let’s talk about the woman. (off Ethan’s reaction) She was with you at the Palais. Zola saw her again today. She tried to kill Lane. She had a chance to kill you and didn’t. Why?  Pink Rev. (May 04,17)   57. ETHAN We have a past. It’s complicated. WIDOW I’ll make it more complicated for you. My price just went up. Someone killed four of my men today. I’m assuming it was her. It wasn’t. WIDOW (CONT’D) I want her Lark. And you’re going to bring her to me. Otherwise, you never meet the courier and the plutonium goes to the highest bidder. She steps closer still, intimate now. WIDOW (CONT’D) I’d hate for her to come between us. ETHAN She’s all yours. (off the Widow’s smile) At the meeting. Not before. She kisses him. Not a tender kiss. A threat. She lingers for a moment. WIDOW I do like your style, Lark. She turns, walking away. As she leaves: WIDOW (CONT’D) Go to London. Further instructions will follow. CLOSE ON: ZOLA, glaring at Lark with a slightly satisfied smile until his sister confronts him. WIDOW (CONT’D) I’d like a word with you. Now. She walks on, followed by Zola and the goon. Ethan turns to depart. RACK FOCUS to the far side of the river and a figure standing on the bank, watching: ILSA.  Cherry Rev. (Nov 16 '17) - 1908   58.",
      "dialogue_count": 0,
      "word_count": 497
    },
    {
      "scene_number": 25,
      "slugline": "EXT. ARCADE 1 - DAY 106   106  Ethan moves through the city on foot, slipping through an arcade, unaware that Ilsa is following. He turns a corner in front of us and she follows, only to find an empty street.  EXT. ARCADE 2 - SLIGHTLY FURTHER ON - DAY 107   107  Ilsa searches for Ethan, stalking forward, picking up the pace. She comes to the end of the arcade and looks.   In the distance Ethan enters an archway.   She follows. Ilsa passes an iron linked archway.   Ethan is on the other side, disappearing in the distance.  Cherry Rev. (Nov 16 '17) - 1908   58A.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 105
    },
    {
      "scene_number": 26,
      "slugline": "EXT. PALAIS ROYALE GARDENS - DAY 108   108  She rounds the corner only to find an empty courtyard. Ethan has vanished. After a beat, she realizes, turning around. Ethan stands in the distance, watching her. She approaches. Ethan moves under the trees. She mirrors him. They meet. ILSA I knew if I followed her you’d show up eventually. ETHAN Are you okay? (off her nod) Ilsa (I never wanted to hurt you)- ILSA I’m sure you have your reasons. ETHAN You need to walk away. ILSA I can’t do that. ETHAN You weren’t at the Palais to kill Lark, were you? ILSA No. ETHAN You were there to protect him. ILSA Yes. ETHAN And you killed him to protect me. Pause. ETHAN (CONT’D) You wanted him to break Lane out of prison...No  Cherry Rev. (Nov 16 '17) - 1908   59.",
      "characters": [],
      "action_text": "ETHAN (CONT’D) (realizing) You   needed   him to break Lane out. You need to kill him.  Yellow Rev. (May 15, 17)   59A. Her face says he is right. ETHAN (CONT’D) Who’s making you do this? (When she says nothing) MI6. (she nods) Why? ILSA They tried to bring Lane home through diplomatic channels. But too many countries wanted their pound of flesh. A man like that... what he’s seen, what he knows about British Intelligence... They can’t have him talking to a foreign government... Ever. ETHAN That’s not what I asked. Why did they send   you ? ILSA This is how I prove my allegiance. This is how I come home. ETHAN But you were out, you were free. ILSA  We are never free . Ethan knows this all too well. ILSA (CONT’D) I spent two years undercover with Lane. To them, I’m as much of a threat as he is. I kill him... Or I never stop running. ETHAN I can’t help you. When he doesn’t answer: ILSA You don’t know him like I know him. He’s just waiting for his moment. Sooner or later, he’ll make his move.   Tell me where he is.  Cherry Rev. (Nov 16 '17) - 1908   60. (off Ethan’s look) I’ll get to him one way or another. Don’t make me go through you. And off Ethan’s pained expression, we cut to:  OMITTED 109   109   *  OMITTED 110   110   *  OMITTED 111   111   *  BLACK 112   112  And from out of the blackness, a stationary figure takes shape. We are walking toward: JULIA. Solomon Lane steps out of the darkness behind her, leans over her shoulder, almost intimate. He doesn’t need to say it...  INT. VAN 113   113   *  Ethan wakes with a start. He is in a van facing Solomon Lane   * who stares at him blankly. Walker sits beside Lane. Luther   * and Benji are in front. Ethan’s phone rings. He answers.   * ETHAN   * Yes?   *  OMITTED 114   114   *  ILSA (CONT'D)  Tan Rev. (Jan 31 '18) - 1518   61-66. *  EXT. ALLEY - DAY 115   115  The Widow, seated in a car next to Zola, on the other end of the phone, a smile on her face. WIDOW   * Are you ready to meet the courier?   *  EXT. ALLEY - DAY",
      "dialogue_count": 0,
      "word_count": 2907
    },
    {
      "scene_number": 27,
      "slugline": "INT. SAFE HOUSE - DAY 119   119  WALKER   * You wouldn’t even be sitting here   * if I hadn’t set you free.   * LANE   * That was Hunt.   * WALKER   * With intel I provided.   * LANE   * That was the Widow.   * WALKER   *  My operative   gave it to her. And   * how do you thank me? Your decoy   * almost kills me at the Palais.   * LANE   * He had to be convincing.   * WALKER   *  We’re on the same side .   * LANE   *  Are we? Really?   *  Lane gets up into Walkers face, then sways, blood rushing to   * his head.   * LANE (CONT’D)   *  Y our cooperation could be nothing   * more than an elaborate ruse to   * secure that plutonium for your   * masters in the CIA. What   * reassurance do I have?   * WALKER   *  I offered to kill Hunt .   You   * wouldn’t let me. Death is too good   * for him, you said.   * LANE   * You were going to kill Hunt anyway.   *  That’s not reassurance .   * WALKER   * I recruited Delbruuk. I spared the   * Apostles lives and offered to set   * you free. In   exchange   for that   * plutonium.   * *  Tan Rev. (Jan 31 '18) - 1518   69.",
      "characters": [],
      "action_text": "WALKER (CONT’D)   * Do you really think someone like   * Sloane would condone that?   * LANE   * To recover the plutonium, yes, wipe   * out the Apostles? Yes. You see   * Walker, the only rule in this game   * is that there are no rules. Even   * Hunt understands that.   * WALKER   * Hunt has nothing   but   rules. You’re   * only here now because he didn’t   * have the guts to kill you. Sloane   * was right. The IMF is nothing but   * Halloween. Grown men wearing-   * Walker turns and looks at the mask machine on the table.   *  OMITTED 120   120   *  INT. LONDON SAFE HOUSE - DAY 121   121   *  LANE   * What?   * Walker turns to Lane, studies him. After a beat, he lunges,   * grabs Lane’s scalp with both hands and tears his face down   * the middle TO REVEAL: BENJI   * CLOSE ON: An earpiece in his ear. This whole conversation has   * been broadcast.   * BENJI   * It’s just the job. No hard   * feelings.   * Walker grabs him by the throat. Until a pistol taps the back   * of his head stops him cold.   * HUNLEY   * And you were doing so well up until   * this point...   * Beat. In one fluid motion, Walker grabs the gun and wrenches   * it free as he turns to face Hunley, pulling the trigger   * without hesitation, CLICK. It’s empty. REVEAL: Hunley holds a   * second gun tight to his waist, aimed at Walker’s belly.   * *  Tan Rev. (Jan 31 '18) - 1518   70. HUNLEY (CONT’D)   * It’s an old trick. But it still   * works.   * (re his gun)   * I think this one’s loaded, you want   * to find out?   Let’s go, move it.   * Benji takes the gun from Walker and steps to Hunley who hands   * him a magazine. Benji loads the pistol and the two men lead   * Walker out of the cell at gunpoint.   *  Tan Rev. (Jan 31 '18) - 1518   71. OMITTED 122   122   *  INT. LONDON SAFE HOUSE - DAY 123   123   *  Walker enters to find Ethan, Lane and Luther waiting. They   * never left.   * BENJI   * How’d I do?   * ETHAN   * Never had a doubt.   * Ethan and Luther fist bump.   * ETHAN (CONT’D)   ",
      "dialogue_count": 0,
      "word_count": 2358
    },
    {
      "scene_number": 28,
      "slugline": "INT. FORMERLY PART OF SC 189 193A   193A  Benji watches the screen, tracking Ethan and Walker as two dots on a two dimensional map.  INT. OFFICE BUILDING - DAY 194   194  A pool of cubicles. OFFICE WORKERS stare at him as he runs through. BENJI (ON COMM) To your left. He’s to your left.  Cherry Rev. (Nov 16 '17) - 1908   88A.",
      "characters": [],
      "action_text": "Ethan stops, looking to his left, REVEALING: A bay window and a covered bridge spanning the river beyond. It has a solar-paneled rooftop with a steel spine running the entire length. Walker is on that bridge. Ethan grabs a desk chair, spins like a hammer-thrower and:  EXT. OFFICE BUILDING - OPPOSITE SIDE - DAY 195   195  The chair EXPLODES out the window, followed closely by Ethan, who leaps towards the solar-paneled rooftop below him. He lands on top of some massive air conditioning vents, rolls off, and keeps running. STUNNED OFFICE EMPLOYEES watch from the busted-out window behind him.  EXT. TUBE STATION ROOFTOP - DAY 196   196  A hundred or so massive solar panels are arrayed in two parallel lines along the top of the bridge, a steel spine runs between them. The rooftop is punctuated every thirty feet or so by vertical louvered windows, affording Ethan fleeting glimpses of a train platform below.  INT. 197   197  ON SCREEN: The red dot representing Ethan is nearly touching Walker’s blue dot. BENJI He’s right in front of you.  EXT. BRIDGE 198   198  Of course, all Ethan sees is the bridge. BENJI Do you see him? Ethan looks down, glimpses a figure through the tinted glass. There’s only one way to do this. He leaps, slides down the solar panels feet first and:  INT. TUBE STATION - DAY 199   199  Ethan continues running along the roof.   * CLOSE ON: Walker, striding down the platform.   *  Tan Rev. (Jan 31 '18) - 1518   89. The train comes to a stop and a crowd of commuters   * disembarks. Walker disappears into them.   *  INT. TUBE STATION - STAIRWAY TUNNEL - DAY 200   200  Ethan takes the double staircase at the end of this pedestrian tunnel in two leaps, turning the corner into -  INT. TUBE STATION - VENDING MACHINE LOBBY - DAY 201   201  Ethan skids to a stop at a protective railing. He vaults it, landing atop a vending machine, then the ground, then out to:  EXT. TUBE STATION - UNDER THE BRIDGE - DAY 202   202  Ethan emerges from the tube running out from under",
      "dialogue_count": 0,
      "word_count": 2255
    },
    {
      "scene_number": 29,
      "slugline": "INT. VEHICLE - ROAD TO KASMIR - DAY 216   216  Ethan drives. Ilsa rides shotgun. Luther and Benji are in back, each with a tablet. Luther tracks Lane. Benji pores over bomb schematics. CLOSE ON: Luther’s tablet. LUTHER We just lost our signal. Lane   * must’ve found our transmitter. ETHAN I know where they’re headed. What   * matters now is finding a way to   * defuse those bombs before we get   * there-   *  Tan Rev. (Jan 31 '18) - 1518   103.",
      "characters": [],
      "action_text": "BENJI Eh, I’ve found it.   * All eyes turn to Benji. BENJI (CONT’D) ...Maybe. He leans over the seat, showing Ethan his tablet. BENJI (CONT’D) There appears to be a flaw in the   * bomb’s operating system.   * (points to screen)   * The remote detonator requires that   * firing key. If we remove that key   * then theoretically it   should   short   * out the failsafes, and allow us to   * cut both fuses.   * ETHAN   * So, one of us has to get the   * detonator and remove the key.   * LUTHER   * While the rest of us cut the fuses   * on both bombs. Easy.   * BENJI   * Yeah   but ...   * ETHAN   * But what?   * BENJI   * Well, in order for it to work, we   * can’t remove the key or cut the   * fuses until after...the countdown’s   * started.   * ILSA   * But...wait, just so I understand,   * the only chance we have to   safely   * defuse the two bombs, is to let the   * countdown start...   * BENJI   * ...and then remove the key...   * ILSA   * ...okay...   * *  Tan Rev. (Jan 31 '18) - 1518   103A. A dread silence.   * ILSA (CONT’D)   * There’s the border.   * Benji produces four passports, handing them out to each of them. BENJI Ah okay, now I grabbed what I   * could. (to Ilsa) You are Frau Mani from Switzerland.   * (to Ethan) Monsieur Pilloton from Belgium. (to Luther) And Herr Löfven of Sweden.   * LUTHER Do I look Swedish to you? Benji holds up his own passport:   * BENJI   * I don’t know, do I look Korean?   * Off Luther’s look we cut to:  EXT. KASHMIRI BORDER - DAY 217   217  The team’s vehicle comes to a stop at the open gate. No one steps up to greet them. In fact, no one is evident at all.  INT. VEHICLE - DAY 218   218  The team is instantly unsettled by the silence. Ethan brings the vehicle to a stop. The place is deserted. A single vehicle is parked up the road - passenger door open. The team steps out of the car. Ethan sees a command bunker, noticing a power pole beside it. The phone line running from the pole to the bunker has been cut. Ethan moves towa",
      "dialogue_count": 0,
      "word_count": 482
    },
    {
      "scene_number": 30,
      "slugline": "INT. BUNKER - LOOKING OUT 219   219  We watch Ethan through a peep-slot as he approaches slowly, looking inside. He pushes the door open and enters.  INT. GUARD TOWER #1 220   220  Luther mounts the steps and finds it empty, save for a blood stain on the ground.  INT. GUARD TOWER #2 221   221  Benji enters, finding a single DEAD SOLDIER  EXT. CAR - DAY 222   222  Ilsa approaches the car, hearing the chime of the seatbelt alarm. The car is white, marked with big blue letters HOA. A stinger is stretched across the road. The front tires of the vehicle are blown. In the front seat are TWO DEAD MEN in white vests, also marked HAO.  EXT. BUNKER - DAY 223   223  Ethan backs away from the bunker, his face saying he’s seen something terrible inside. Benji, Luther and Ilsa are all looking at him from their respective places. TIME CUT: The team is standing by the car. Benji peers in the driver’s window: BENJI Humanitarian Aid. Poor bastards. Wrong place wrong time. ETHAN Walker’s men. LUTHER They must have overlooked him and they ambushed them on the way out. Benji looks at his cell phone.  Salmon Rev. (July 30 '17) - 1400   105.",
      "characters": [],
      "action_text": "ETHAN And no Walker. No Lane. LUTHER No nukes. Ethan places his hand on the hood of the car. ETHAN How far did you say that medical camp was? BENJI Thirty miles. They all rush for their vehicle. INT. DARK ROOM - DAY 224   224 Lane loads a plutonium core into the open firing chamber of   * one of Delbruuk’s devices.   * He presses a button, closing the firing chamber.   * REVEAL: Walker, Lane and THREE GOONS standing around the bomb in a dirt-floored room with small windows. LANE   * Both devices are connected to the detonator. Lane types the code into the keypad, takes out the firing   * key, sets it for 15 minutes and picks up the detonator.   * LANE (CONT’D) 15 minutes should give you enough time to reach minimum safe distance. (turning to Walker)   * Yes, this is where it ends for me.   * WALKER Now? You’re doing this   now ? This is just the first phase. There’s more   * work to be done. After.   *  Tan Rev. (Jan 31 '18) - 1518   106. LANE More than you’ll ever realize.   * You’ll see. The world   might   learn   * from what happens here today. More   * likely, they’ll forget it ever   * happened.   * And off Walker’s bewildered expression, they walk out.   *  Tan Rev. (Jan 31 '18) - 1518   107-108.",
      "dialogue_count": 0,
      "word_count": 430
    },
    {
      "scene_number": 31,
      "slugline": "EXT. MEDICAMP - UPPER - DAY 225   225  Ethan and the team arrive, get out of the vehicle. The camp is busy, but quiet. The village below stretches on for a mile down the valley. Walker, Lane, the bombs could be anywhere. Luther and Benji pull out phones that double as geiger counters and fire them up. Benjy points to a large mass of shipping containers. BENJI Signals over there. Weak, but in every direction. LUTHER We’re in a medical camp. X-ray machines, CAT scanners- radiological signatures everywhere. ILSA Needle in a haystack. ETHAN Process of elimination. One at a time. Split up. Stay on comms. Everyone sticks an earpiece in their ear before heading toward the containers just as something catches Ethan’s eye. He turns and sees a long administration tent on an elevated ridge just above him. He mounts a set of stairs, stands in the opening of the tent. REVEAL: The tent is long, narrow, a hive of activity. DOCTORS, NURSES, AID WORKERS. Then a voice: VOICE Ethan. He turns and freezes, finding himself face to face with the one person he never expected to see: ETHAN Julia. JULIA. The team hears this on their comms, all turning at once, seeing Ethan and Julia together. Ilsa looks to Luther:  Salmon Rev. (July 30 '17) - 1400   109.",
      "characters": [],
      "action_text": "ILSA Is that? ON ETHAN AND JULIA. VOICE Julia. They both turn as A MAN (30s) approaches. He's handsome, smiling. ETHAN (softly) Is that- Julia nods. ETHAN (CONT’D) Does he know? She shakes her head just as the man arrives, extending a hand, understandably curious. ERIK Hey. ETHAN Hi. JULIA This is my husband Erik. ETHAN (extending a hand) Rob. Thorne. Doctor Rob Thorne. I worked with Julia at- JULIA Mass General. Before New York. ERIK You're kidding. What a coincidence. What brings you all this way? ETHAN I was in Turtuk, not too far from here. I heard help was needed.  Cherry Rev. (Nov 16 '17) - 1908   110. ERIK Actually, we’re just about finished here. The whole village is inoculated. What were you doing in Turtuk? JULIA Rob’s on vacation. Something in her tone is almost hopeful. ETHAN No... No, I’m working.  OMITTED 226   226  Cherry Rev. (Nov 16 '17) - 1908   111.",
      "dialogue_count": 0,
      "word_count": 376
    },
    {
      "scene_number": 32,
      "slugline": "EXT. MEDICAMP - UPPER - DAY 227   227  ETHAN You’re all a long way from home. ERIK Thanks to our guardian angel. ETHAN Guardian- ERIK We were running an field hospital in Darfur when the outbreak happened here. There comes a call from an anonymous donor. Out of the blue. He’s ready to underwrite this entire operation. One condition. Just then, Julia spots Benji, Luther and a woman. Staring. JULIA We run the whole thing. ERIK Can you believe that? ETHAN I certainly can. ERIK Out of the blue.  Cherry Rev. (Nov 16 '17) - 1908   112.",
      "characters": [],
      "action_text": "JULIA Out of the blue. ETHAN Quite the full life. ERIK You know, before Julia I never traveled, never even left New York. I was on the fast track to Chief of Surgery at fifty. Heart attack at fifty-five. She convinced me to let it all go. Help where it was needed most. We’ve been on the go ever since. And I’ve never felt more fulfilled. ETHAN I’m happy for you. ERIK Thank you. MEANWHILE: CLOSE ON Luther, looking at the phone in his hand, the signal spiking. He looks around, spies a communications mast among the shipping containers. He double takes, looks closer at it. To the untrained eye it’s just a cell tower. But to one who has seen the schematic. LUTHER Ethan... I think I found something. Ethan sees Luther turn away, heading toward the mast. JULIA (to Erik) We should get going. We have a lot of packing to do. ERIK I’ll handle that. You two catch up. ETHAN I should get out of your hair.  Cherry Rev. (Nov 16 '17) - 1908   113. ERIK Are you kidding? You should stick around. I’m only sorry you came all this way for nothing. Tell you what. We’ll pack and then we’ll drive you back to Turtuk. You can catch up in the car. ETHAN You’re very kind. ERIK Settled.   See you soon. JULIA It’s good to see you. They embrace awkwardly before sharing a look that only they understand. ETHAN I’m so sorry, Julia. Ethan moves quickly in the direction Luther, Benji and Ilsa went. CLOSE ON: Julia stops at the edge of the administration tent, watching them go.  OMITTED- MOVED TO SC 230A 227A   227A  EXT. LODGE - DAY 228   228  A house made of split beams with an earthen roof. Walker, Lane and the goons emerge, REVEALING: They are on the boundary between the village and the lower medical camp. Across an open field we spy a helipad with two helicopters. Lane points to them.  Cherry Rev. (Nov 16 '17) - 1908   114. LANE Take both helicopters. No one else leaves. Lane hands Walker the detonator. LANE (CONT’D) Walker, you are a good soldier. Walker nods, shakes Lane’s hand and walks for the he",
      "dialogue_count": 0,
      "word_count": 1372
    },
    {
      "scene_number": 33,
      "slugline": "EXT. SHIPPING CONTAINERS 242   242  JULIA Is that what I think it is? BENJI (ON COMM) Luther, get her out of there. LUTHER Where’s she gonna go? Julia realizes, steps closer, takes a knee. JULIA What can I do? Pause. LUTHER In the kit. The pliers with the red grip. BENJI (ON COMM) ARE YOU INSANE? LUTHER Mind your business, Benji. BENJI (ON COMM) THIS IS MY BUSINESS.  EXT. REES VALLEY - BLACK HELI TOW CABLE - DAY 243   243  With an immense effort, Ethan methodically drags himself to the top of the payload, making slow but steady progress along the cable until he arrives at the tow cable anchor on the bottom of the fuselage. He lunges for one of the skids, just managing to grab it.  Cherry Rev. (Nov 16 '17) - 1908   119.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 137
    },
    {
      "scene_number": 34,
      "slugline": "INT. BLACK HELI - DAY 244   244  Ethan climbs onto skid and edges along it up to the door. AN ARMED CREWMAN sits by the open door, shocked to see Ethan. The Crewman leaps up, drawing a pistol. Ethan catches him by the wrist. The Crewman steps back, inadvertently pulling him into the aircraft. Ethan and the Crewman grapple for the gun. It goes off, striking the oblivious pilot in the back. He instantly slumps forward on his control stick. The heli spins and dives. Ethan and the Crewman stop fighting and look for a way to hold on. The Crewman is tossed out the open door. A beat later, Ethan is flung towards it. The force of the spinning heli causes the door to slam shut just before Ethan would have been ejected.  INT. BLACK HELI - DAY 245   245  Ethan muscles his way to the front of the helicopter. He reaches across the pilot, unharnesses him, pulls the door latch, dumps him from the aircraft and takes the controls. Ethan tries desperately to wrestle control of the helicopter before it plows headfirst into the trees below. He grabs the cyclic, pushing one pedal, then the other.  EXT. REES VALLEY - BLACK HELI - DAY 246   246  The helicopter’s spin slows, mildly stabilizing. Walker’s helicopter is up ahead. ETHAN Benji, Isla, do you copy?   *  INT. TENTS - DAY 246A   246A  Benji stops in his tracks. BENJI   * Ethan, Ethan, where are you?   * ETHAN I’m in a helicopter going after   * Walker.   *  Tan Rev. (Jan 31 '18) - 1518   120.",
      "characters": [],
      "action_text": "BENJI   * What? You’re   in   the helicopter...   * LUTHER   * Did you say Helicopter?   How’d you   * get in a helicopter?   * ILSA   * He can fly a helicopter?   * ETHAN   * (shaking his head)   * I can’t get into it, just find the   * other bomb?   * BENJI   * What? We’re still looking.   * ETHAN   * You’ve have to find the other bomb.   * BENJI   * But finding the other bomb isn’t   * going to matter if we don’t have   * the detonator.   * ETHAN   * I know I know, I’ll get it.   * BENJI If you don’t mind me asking how are   * you going to get it?   *  INT. HELI - DAY 246B   246B  Over Ethan looking at Walker’s heli. How the hell IS he going to get it? ETHAN   * I’ll... figure it out. Find the   * other bomb, be ready, I won’t let   * you down.   I won’t let you down.   * BENJI   * Ethan?   Ethan come in...   * ETHAN   * Benji? Ilsa? Luther? Do you copy?   *  Benji ?   * No answer.  Tan Rev. (Jan 31 '18) - 1518   120A. EXT. SHIPPING CONTAINERS 247   247  Julia and Luther continue to work on the bomb. LUTHER Wire stripper. JULIA I’m a doctor, not an electrician. LUTHER Sorry. That thing with the green grip. Julie grabs it. LUTHER (CONT’D) The wire in my left hand. JULIA The black one. LUTHER My   left   hand. JULIA  That’s   your left hand.  INT. QUARANTINE 248   248  Ilsa searches, listening to this back and forth. LUTHER (ON COMM) Sorry. The other wire. JULIA (ON COMM) The red one. LUTHER (ON COMM)  Yes, the red one . In my right hand. JULIA (ON COMM) Just checking. LUTHER (ON COMM) Thank you. ILSA (to herself) Oh, I like her.  Cherry Rev. (Nov 16 '17) - 1908   121-122. OMITTED 249   249  OMITTED 250   250  INT. BLACK HELI - DAY 251   251  Ethan wrestles with the controls. ETHAN I can do this. (pointing to controls) That’s power... Airspeed. (maneuvering the cyclic) That’s roll.... That’s pitch, pitch, pitch... Pitch, and a little roll. The horizon lowers - the heli levels out. He ventures a look skyward. ETHAN’S POV Above him, Walker’s heli moving steadily up t",
      "dialogue_count": 0,
      "word_count": 677
    },
    {
      "scene_number": 35,
      "slugline": "INT. BLACK HELI - DAY 253   253  ETHAN Payload. How do I get rid of this payload? Ethan looks over the cyclic, sees what he’s looking for: A red toggle switch, marked   cable release . He poises his thumb over the toggle, ready to hit it... then he looks up at Walker’s heli again, an idea forming. ETHAN (CONT’D) Power. Ethan takes his hand away from the switch, grabs the cyclic, GUNS the throttle again and pulls back.  INT. TENTS - INTERCUT - FORMERLY PART OF SC 248 253A   253A  ILSA Benji, I’m not finding anything here. I think we’re looking in the wrong place. BENJI There’s signatures everywhere, this is the perfect place to hide it. ILSA No, I know Lane.   If we’re looking here, it’s because he wants us to. I’m heading for the village. BENJI Just wait for me. Benji continues to look round, and stops in a doorway, picking up a signal. BENJI (CONT’D) Ilsa, I think found something. Benji enters the room, looking around.   He goes up to a large box, and starts picking the lock.  INT. TENTS - ILSA - FORMERLY PART OF SC 248 253B   253B  Ilsa comes to the end of the quarantine tent and freezes:  Cherry Rev. (Nov 16 '17) - 1908   123.",
      "characters": [],
      "action_text": "REVEAL: Across the way, she sees the houses at the edge of the valley village. Standing on the upper deck of one in particular is Solomon Lane. He stares directly at her. ILSA I see Lane. BENJI (still picking the lock) What, where? ILSA (ON COMM) At the edge of the village .  BENJI (ON COMM) Wait for me. Lane moves into the house. Ilsa goes after him.  INT. TENT - BENJI - FORMERLY PART OF SC 248 253C   253C  BENJI  Ilsa, wait for me . Frustrated, Benji stands, drawing his gun to shoot the lock. He takes a second realizing. BENJI (CONT’D) (to himself) No, nuclear bomb... Turning, he spies an gas canister.   Putting his gun down, he picks up the canister, and uses it to smash off the lock. He drops the canister, and opens the box, only to find an X- ray machine. There are many more boxes.  OMITTED 254   254  EXT. HOUSE - DAY 255   255  Ilsa climbs the stairs, pistol in hand. She goes to the spot where she last saw Lane and enters the door.  OMITTED- MERGED INTO SC 281 256   256  Cherry Rev. (Nov 16 '17) - 1908   123A. OMITTED 257   257  OMITTED 258   258  EXT. LAKE QUILL - DAY 259   259  A pristine high-mountain lake, skimming the surface. BEHIND IT, Ethan’s helicopter also clears the range.  Cherry Rev. (Nov 16 '17) - 1908   123B.",
      "dialogue_count": 0,
      "word_count": 445
    },
    {
      "scene_number": 36,
      "slugline": "INT. BLACK HELI - DAY 260   260  Ethan stays heavy on the throttle, watching as the GREEN HELI slips below, and eventually behind him.  EXT. LAKE QUILL - BLACK HELI - DAY 261   261  From above Ethan’s heli, we see the Walker’s below. The payload at the end of Ethan’s tow cable points directly towards it.  INT. BLACK HELI - DAY 262   262  Ethan sizes up the speed and distance of his moving target, giving it his best guess before hitting the   cable release .  EXT. LAKE QUILL - BLACK HELI - DAY 263   263  The payload cable detaches and the payload falls towards Walker’s helicopter, still skimming the water below.  INT. GREEN HELI - DAY 264   264  Walker’s pilot catches the faintest hint of something above him: WALKER’S POV: The payload, rocketing straight towards us. Walker’s hand flies out to his right, MASHING into his pilot’s cyclic and sending the helicopter careening right.  EXT. LAKE QUILL - GREEN HELI - DAY 265   265  Walker’s heli rolls out of the way, the falling payload narrowly missing and plunging into the lake.  INT. GREEN HELI - DAY 266   266  Walker looks back, seeing the plume of water from the lake’s surface behind him. He looks up at Ethan’s black heli above.  Cherry Rev. (Nov 16 '17) - 1908   124.",
      "characters": [],
      "action_text": "No answer. Odd. Walker jerks his thumb in the air.   Take us up.   The pilot nods, gunning the throttle.  EXT. LAKE QUILL - BLACK HELI - DAY 267   267  Looking down from above Ethan’s chopper, the GREEN HELI is rising up to meet the black.  INT. BLACK HELI - DAY 268   268  Ethan sees Walker’s approach, not sure what his next move should be.  INT. GREEN/BLACK HELIS - INTERCUT - DAY 269   269  Walker comes level with Ethan. The two men make eye contact. Walker cannot believe his eyes. WALKER Now I’m gonna kill you. Ethan watches as Walker reveals that he has a machine gun. Ethan doesn’t know how to fly, but he knows when to run. He jams the stick forward and dives as Walker fires. His heli spirals wildly as red-hot tracer rounds streak past.  EXT. LAKE QUILL - DAY 270   270  The BLACK HELI is in a hopeless tumble now, headed for the drop off at the edge of the lake. Behind it, the GREEN HELI turns and starts after it.  EXT. LAKE QUILL - DAY 271   271  The BLACK HELI gets its skids underneath it just in time to provide that last critical bit of lift, avoid a high speed water landing, clear the drop off by a hair and fall into a DARKENED VALLEY below. The GREEN HELI isn’t far behind.  Cherry Rev. (Nov 16 '17) - 1908   125.",
      "dialogue_count": 0,
      "word_count": 454
    },
    {
      "scene_number": 37,
      "slugline": "EXT. SHIPPING CONTAINERS - DAY 272   272  Luther and Julia, both sweating now. JULIA You do this a lot? LUTHER First time. Managing a nervous laugh. JULIA Me too. LUTHER Allen key. Julia picks up the necessary tool. LUTHER (CONT’D) That screw there. Counterclockwise. Slowly. As she does. JULIA So... How is he? LUTHER Oh, you know. Same old Ethan.  EXT. SHOTOVER CANYON - DAY 273   273  Ethan’s heli sweeps down from above, barnstorming a shadowy canyon with steep walls on either side. It narrowly misses a rocky crag as it accelerates, Walker in relentless pursuit.  Cherry Rev. (Nov 16 '17) - 1908   126.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 105
    },
    {
      "scene_number": 38,
      "slugline": "INT. BLACK HELI - DAY 274   274  With one hand on the collective, the other on the cyclic, Ethan looks like he’s trying to tame a wild boar. The BLACK HELI bucks and pitches under his feet, sparing him only a moment to look back at -  EXT. SHOTOVER CANYON - DAY 275   275  THE GREEN HELI, rounding the corner behind him, Walker hanging out the side, aiming, opening fire ... Tracers pepper the rock wall near Ethan’s cockpit.  INT. BLACK HELI - DAY 276   276  Ethan recoils, throwing the cyclic to the left, sending him careening in the other direction.  EXT. SHOTOVER CANYON - GREEN HELI - DAY 277   277  Walker doesn’t have a clean shot. WALKER (screaming at the pilot)  Bring it around.  INT. GREEN HELI - COCKPIT - DAY 278   278  The pilot shifts his feet on the pedals, feathers the cyclic to the side.  EXT. SHOTOVER CANYON - DAY 279   279  The GREEN HELI, without slowing down, rotates 45 degrees, flying sideways, giving Walker a shot out the rear door.  EXT. SHOTOVER CANYON - DAY 280   280  Tracers rattle the canyon walls, sending chunks of rock crashing into the creek below.  INT. HOUSE - CELLAR - DAY 281   281  Dark. Uninhabited. Bright sunlights peeks through cracks in the walls, illuminating dust in the air.  Cherry Rev. (Nov 16 '17) - 1908   127.",
      "characters": [],
      "action_text": "Ilsa comes down the stairs into cool darkness, feet resting on the dirt floor. Her eyes immediately see:  Cherry Rev. (Nov 16 '17) - 1908   127A. Through an open doorway into another room, the second bombs rests in the corner, quietly ticking away. ILSA Benji, I found it. BENJI (ON COMM) Where are you? The wall beside her explodes inward. A pair of hands grab her hair and pull. Ilsa tries to shoot behind her. Lane pulls her through the wall, throwing her to the floor and knocking her unconscious.  INT. QUARANTINE - DAY 282   282  Benji, surrounded by all the open boxes, hears her radio short out. BENJI Ilsa, do you copy? Ilsa come in. Benji grabs the phone and runs out after Ilsa.  OMITTED 283   283  INT. BLACK HELI - DAY 284   284  Ethan, beads of sweat dripping into his eyes, wrestles the wind-tossed helicopter around a final bend and into -  Cherry Rev. (Nov 16 '17) - 1908   128.",
      "dialogue_count": 0,
      "word_count": 389
    },
    {
      "scene_number": 39,
      "slugline": "EXT. STONY CREEK - DAY 285   285  The canyon walls close into a narrow gauntlet of towering pine trees, 40-meter-high green crowns only inches from Ethan’s rotor blades as he swoops past them.  INT. GREEN HELI - DAY 286   286  Walker pulls the trigger.  EXT. STONY CREEK - BLACK HELI - DAY 287   287  Rounds peppers the tail of Ethan’s heli.  EXT. PURITY GLACIER 287A   287A  Ethan banks into an ultra narrow canyon. Walker’s heli gives chase. Walker tries to shoot Ethan, has to reload. Ethan reaches a bowl canyon and climbs. Walker finds it hard to aim.  OMITTED 288   288  OMITTED 289   289  OMITTED 290   290  OMITTED 291   291  OMITTED 292   292  EXT. SHIPPING CONTAINERS - DAY 293   293  Luther and Julia.  Cherry Rev. (Nov 16 '17) - 1908   129.",
      "characters": [],
      "action_text": "LUTHER Benji, come in.  INT. - 2ND HOUSE 294   294  Benji searching to no avail. BENJI Go. LUTHER We’re almost at the fuse. You need to find that other bomb. JULIA Did you say another bomb? BENJI I’m working on it. ILSA. WHERE ARE YOU? Benji looks the house Ilsa went to, and then, not seeing her, heads to the wrong house.  INT. HOUSE - DAY 295   295  Ilsa regains consciousness. She is bound to a chair, a rope around her wrists and neck, pulling her head back. Lane stands over her. LANE I hoped I’d see you again, Ilsa. And here we are. He sits, the bomb ticking away between them... LANE (CONT’D) Wherever we’re going now. We’ll be going together.  EXT. PURITY GLACIER - TOP 295A   295A  Both heli’s streak over the smooth top of the glacier. Walker fires. Ethan’s heli takes another hit, this one critical. Smoke streams from the tail. Ethan reaches a sheer drop and dives.  Cherry Rev. (Nov 16 '17) - 1908   130.",
      "dialogue_count": 0,
      "word_count": 301
    },
    {
      "scene_number": 40,
      "slugline": "EXT. KAIPO WALL - DAY 296   296  The BLACK HELI clears the crest, and pushes forward over the top. Below him, a dense cloud bank hides whatever may be there. Ethan dives for it anyway, vanishing into the void.  INT. BLACK HELI - DAY 296A   296A  Ethan’s POV diving through dense cloud - the world is pure white, until suddenly it’s green. Ethan emerges from the clouds headed straight down toward trees, dead ahead. He pulls back on the stick, too late. The heli levels out, screaming, still descending, crashing through the canopy TO REVEAL: A PICKUP TRUCK heading straight for him. It swerves off the road, horn blaring. REVEAL: Ethan is just inches above a paved road, trapped under a canopy of trees, the blades of his heli just inches from branches on either side, no room to maneuver. And no way back up. He has no choice but to move forward.  INT. GREEN HELI - DAY 297   297  Walker’s pilot throttles back. WALKER  GO AFTER HIM.  Cherry Rev. (Nov 16 '17) - 1908   130aA.",
      "characters": [],
      "action_text": "PILOT Are you out of your mind, we won’t know what’s down th- Walker draws a pistol and places it to the pilot’s temple. WALKER  Now . The Pilot grimaces and dives after Ethan.  INT. BLACK HELI 297A   297A  Another car comes at Ethan, swerves off the road.  Cherry Rev. (Nov 16 '17) - 1908   130A. OMITTED 298   298  OMITTED 299   299  EXT. VALLEY - DAY 300   300  Walker’s GREEN HELI emerges from the cloud bank with room to spare. He scans the valley around him looking for Ethan’s heli. But it’s gone. The pilot presses on.  EXT. VALLEY - ABOVE GREEN HELI - DAY 301   301  Looking straight down at Walker’s heli and the trees far below. A glint of sunlight reflects off of something under the canopy. A gap opens in the trees TO REVEAL: Ethan’s heli skimming UNDER the trees.  INT. BLACK HELI - DAY 302   302  Ethan’s hands are shaking, trying to hold the cyclic steady, legs taut above the pedals. He dares to glance up, seeing Walker’s heli directly above him. A horn blares. Ethan looks forward. REVEAL: A motorcycle headed right at him. It, too, must veer off the road. Ethan glances up again, looking for a way out.Another horn blares, this one louder. REVEAL: A tractor trailer is coming right for him, locking up it’s brakes and jack-knifing across the full width of the road.  Cherry Rev. (Nov 16 '17) - 1908   131. Ethan is going to crash. He has no choice - he has to hit the throttle, and ascend.  EXT. VALLEY - DAY 303   303  The BLACK HELI explodes through the canopy, shredding the treetops and ascending, falling in behind Walker’s heli.  INT. GREEN HELI - DAY 304   304  Walker looks back, realizes he is now the one being chased. He brings his weapon around, spraying tracers in a wide arc behind him.  INT. BLACK HELI - DAY 305   305  Ethan banks right-  INT. GREEN HELI - DAY 306   306  And across the tail of Walker’s heli. Walker changes sides, aims, Ethan swings back the other way, using Walker’s own tail for cover. Walker changes sides again, fires. Again, Ethan ducks beh",
      "dialogue_count": 0,
      "word_count": 593
    },
    {
      "scene_number": 41,
      "slugline": "INT. BLACK HELI - DAY 309   309  Ethan sees Walker yanking the bolt on his weapon, realizes what’s happening. He throttles and dives.  INT. GREEN HELI - DAY 310   310  Walker reaches for his gear bag and a lone box of ammo. The pilot sees Ethan diving directly for them and takes evasive action. Walker is thrown nearly out the door. He grabs on the steady himself, losing the ammo box. He watches it fall out the door. No more ammo. The odds a bit more even now.  INT. BLACK HELI - DAY 311   311  Ethan presses his attack -   ramming speed .  EXT. VALLEY - DAY 312   312  The two helicopters narrowly miss each other, as the GREEN HELI, followed perilously closely by the BLACK HELI, rises into the air, roaring around a mountainous ridge.  INT. GREEN HELI 312A   312A  WALKER HE’S TRYING TO RAM US. THIS FUCKER’S CRAZY.  EXT. SHIPPING CONTAINERS - FORMERLY SC 333 312B   312B  Luther and Julia hovering over the last wire, watching the timer tick away, ever closer to zero. JULIA Is that it? LUTHER This is the last wire. JULIA What do we do?  Cherry Rev. (Nov 16 '17) - 1908   133.",
      "characters": [],
      "action_text": "LUTHER We wait for Ethan. JULIA Ethan. LUTHER Go be with your husband. When she hesitates. JULIA Luther- LUTHER Go. Julia stands, backs away, then runs. LUTHER (CONT’D) Benji, where are you?  EXT. EARNSLAW BURN 312C   312C  Ethan chases Walker across an icy expanse. Walker tries to shoot at him but Ethan ducks repeatedly behind his tail until Walker is out of ammo.  INT. HOUSE 312D   312D  Ilsa and Lane watch as the bomb’s timer ticks away. LANE You should have come with me. Ilsa blinks, those words coming back to haunt her. LANE (CONT’D) We could have done great things. The Syndicate could have set the world free. Instead, you chose Hunt   * and his old world order, even after   * I warned you his luck would run   * out, you remember?   * Lane looks at the bombs ticking clock. Ilsa takes the opportunity to scan the room with a glance. She spies a sharp object - a weapon. But how to get it? He looks back, sensing: LANE (CONT’D) It can’t be stopped.   *  Tan Rev. (Jan 31 '18) - 1518   133A. Do you understand that? There’s   * nothing he can do.   When that clock   * runs out...Ethan Hunt will lose   * everything and everyone he’s ever   * cared for.   *  BENJI (O.S.) ILSA. Lane swivels around Ilsa chair.   * LANE   * You don’t want to see this.   * Ilsa tries to scream a warning to Benji through the gag while   * Lane vanishes into the darkness behind her.   *  INT. TENT - FORMERLY SC 335 312E   312E  Julia enters a tent to find Erik finishing up the packing. He sees immediately that something is terribly wrong. ERIK What is it? She moves to him, embrace him, her eyes shut tight. She opens them. JULIA I love you very much.  EXT. VOLTA GLACIER - DAY 313   313  A massive slab of ice, sloping upwards over an expansive frozen plain. The two helicopters barrel across it in a twisted dance.  INT. HOUSE 313A   313A  Benji enters the basement, sees Ilsa, rushes to her. Lane snares Benji with a rope around his neck. Ilsa struggles with her restraints, glances at the timer on ",
      "dialogue_count": 0,
      "word_count": 1021
    },
    {
      "scene_number": 42,
      "slugline": "INT. BLACK HELI - DAY 325   325  Ethan rams into the back of the GREEN HELI - the tail rotor shattering Ethan’s canopy.  EXT. ICE BOWL - DAY 326   326  The two helicopters spiral apart, both hopelessly damaged and completely out-of-control, MASHING themselves against opposite ends of a huge ice sink rounding out the bottom of the gorge with a pair of sickening CRUNCHES, Walker’s headfirst, Ethan sideways.  INT. GREEN HELI - DAY 327   327  Walker’s pilot takes the full brunt of the impact, while Walker, in the back, braces.  INT. BLACK HELI - DAY 328   328  Ethan’s heli comes to a stop on the edge of a precipice. He is stunned, trying to focus. He hears the crunch of metal sliding on ice, looks around. Then he sees it. Walker’s heli is rolling towards him. Ethan goes to unfasten his harness, but he’s too late. IMPACT  EXT. CREVASSE - DAY 329   329  The decimated helicopters SLAM into each other with an ear- splitting CRASH, metalwork intertwining, Walker’s helicopter flipping over Ethan’s and falling into the crevasse, dragging Ethan’s with it.  INT. BLACK HELI - DAY 330   330  Ethan and Walker now find themselves hanging in the middle of a smoking, twisted Escher painting - difficult to tell which way is up. Ethan looks directly above his head and sees - Walker, sprawled out on his back in the rear of the helicopter below him. Ethan PULLS THE BUCKLE, releasing himself from the seat, and launching downwards, straight at Walker.  Green Rev. (June 11, 17)   135.",
      "characters": [],
      "action_text": "Ethan smashes through Walker’s windscreen, body slamming Walker. They grapple in the battered remains of the heli until their fighting causes the whole twisted structure of the GREEN HELI to rip away, falling through the crevasse towards:  EXT. PULPIT ROCK - DAY 331   331  What remains of the helicopter smashes onto a rocky shelf, spilling the two men out onto the frozen surface, dragging the cable from its winch as it rolls away. The wreckage tumbles over the edge. The cable snags an outcropping and pays out like fishing line. The heli jerks to a stop fifty feet below, slamming into the cliff face and coming to a stop, a thousand feet above a forbidding glacier. Ethan lies face first on the ice Lying twenty feet away, Walker staggers to his feet in a   * murderous rage, eyes only on Ethan -   * Ethan - slowly, painfully - drags himself up, and turns.   * The DETONATOR lies just past Walker.   Walker readies himself.   * Ethan charges down the slope, driving for the detonator.   * Walker gets him into a headlock and they shove back and   * forth, Ethan reaching desperately.   * In the struggle, Walker heels the detonator away. It skids   * further away, towards the edge of the cliff...coming to a   * stop just on the lip.   * Ethan can’t get past and punches and elbows Walker to break   * free. Walker grabs him back as he reaches for it -   * tantalizingly close.   Back to back Walker gets Ethan into a   * hold and flips him away from the edge.   *  EXT. PULPIT ROCK - CONTINUED 332   332  Ethan roles back, barely avoiding Walker’s follow up kick. He   * recovers as Walker charges in, and they punch and block back   * and forth, until they lose their footing and fall away from   * each other.   * Ethan gets up again and charges, putting Walker on the back   * foot, getting him into an arm lock. Walker breaks free and   * punches Ethan to the ground.   He puts an arm around Ethan’s   * throat, and pulls him up into a choke hold.   *  Tan Rev. (Jan 31 '18) - 1518   136",
      "dialogue_count": 0,
      "word_count": 744
    },
    {
      "scene_number": 43,
      "slugline": "EXT. SHIPPING CONTAINERS 336   336  BENJI Doing it now. Stand by. Luther is waiting, watching the timer. LUTHER Where the hell are you, Ethan?  EXT. PULPIT ROCK - DAY 337   337  Walker has Ethan facing the edge, arm around his neck,   * choking him. In desperation, Ethan jumps up and kicks out,   * using his weight and momentum to reverse the hold, flipping   * Walker over him.   * They both go down, Walker heading over the cliff, Ethan   * desperately grabbing for the cable, but Walker gets a hand on   * his jacket and pulls Ethan over with him, leaving the   * detonator just on the edge.   * Ethan manages to grab the winch cable, but his gloved hands   * struggle to grip it. He slides and finally stops.   * REVEAL: Ethan is dangling over a 1000 foot drop into rocks   * and water, Walker hanging on below him.   * The hook slips, sliding on the rock, and they drop another 20   * feet down the cliff face.   * They come to a stop, Ethan grasping the cable, Walker holding   * onto his ankle.   * Ethan struggles, trying to get Walker off, and kicks him in   * the face. Two, three times. Walker releases, falls further.   * He grabs the rope, coming to a stop 15 feet below Ethan.   * Walker shakes it off, glancing down below him. He looks back   * and starts to climbs the cable toward Ethan, determined.   *  EXT. SHIPPING CONTAINERS 338   338  Luther holds his pliers over the wire, waiting, the timer running out. LUTHER Turn the screws counterclockwise  Tan Rev. (Jan 31 '18) - 1518   138.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 273
    },
    {
      "scene_number": 44,
      "slugline": "INT. HOUSE - BASEMENT 339   339  Benji and Ilsa have torn into the bomb. BENJI We copy. LUTHER (ON COMM) Remove that panel and you’ll see the power and ground wire for the fuse. CLOSE ON: Ilsa removes the plate. The wire is revealed. BENJI Got it. LUTHER When the time comes, you want to cut the green wire.   Do not   cut it yet. BENJI Got it. LUTHER Ethan, we’re ready to make the cut. CLOSE ON: The timer. One minute left. Ugly pause. LUTHER (CONT’D) ETHAN, COME IN. No answer.  EXT. PULPIT ROCK - DAY 340   340  Ethan climbs up the cable a short way then jumps to the rock   * face, clinging for dear life. The face is at a slight   * negative angle, making it even harder to hold on.   * Walker continues to climb the cable, gaining, but its too   * slow. He jumps off, grabs the rock. Keeps going, getting   * within arms reach of Ethan.   * Ethan makes it to a small ledge and pulls himself up onto it.   * He turns to climb further, but rocks start tumbling and he   * swings back.   * The hook slips and slides over. Ethan presses his back to the   * rock as the cable - and the hook on the end - whiz past.   * Walker looks up in time to see the hook coming right for him.  Tan Rev. (Jan 31 '18) - 1518   139.",
      "characters": [],
      "action_text": "WALKER’S POV: The hook slams right into the camera. OVER   * ETHAN looking down as the hook hits Walker in the face. He   * and the wreckage of the heli plummet down to the valley   * below. Battered and in pain, Ethan looks up again. The remote   * teeters in the breeze. This is not over. He continues the   * climb.  INT. HOUSE - BASEMENT 341   341  The clock ticks. BENJI How do we know if he has the key? LUTHER He’ll get it done. BENJI How do we   know?  ILSA It’s Ethan Hunt. He’ll get it. Time is running out.  EXT. PULPIT ROCK 342   342  Ethan is still climbing, slowly, the remote seems a mile   * away. He’ll never make it.  INT. HOUSE/EXT. SHIPPING CONTAINERS 343   343  CLOSE ON THE CLOCK. WE’VE REACHED THE LAST FIFTEEN SECONDS. LUTHER We’re out of time. We just have to hope he has it. Benji looks to Ilsa. Beat. BENJI Alright. We’re ready. LUTHER At two seconds we cut. BENJI Why not one?  Tan Rev. (Jan 31 '18) - 1518   140. LUTHER You want to cut it that close?  Tan Rev. (Jan 31 '18) - 1518   140A. BENJI It’s a second we’ll never get back. ILSA Can we please make a decision? BENJI Fine. At one second we cut. In three.... Two... One... BENJI/LUTHER NOW. They cut and: SILENCE AS A BRIGHT WHITE FLASH FILLS THE SCREEN  EXT. PULPIT ROCK 344   344  SUPER CLOSE ON: Ethan’s eyes, watering as they adjust to the superheated nuclear heart of a fire as bright as the sun. And that’s because it is the sun. REVEAL: Ethan, dangling by one hand from the edge of Pulpit Rock, the   * remote dangling in the other, the detonator key in his teeth.   * He looks toward the horizon, waiting for a blast that will never come. He exhales a trembling breath, spits the key out   * and lets the remote fall. With the last shred of strength he   * has in him, he hauls himself up.  INT. HOUSE 344A   344A  The bomb opens and it’s plutonium core drops into Benji’s hands like an egg. He holds it up to Ilsa. She turns to Lane and smiles. He does not smile back.  EXT. SHIPPING CONTAINERS 344B   344B ",
      "dialogue_count": 0,
      "word_count": 1908
    }
  ]
}