{
  "slug": "miss-sloane-2016",
  "title": "miss sloane",
  "genre": "action",
  "format": "film",
  "scenes_count": 6,
  "characters_count": 2,
  "characters": [
    "ELIZABETH",
    "BOB SANDFORD"
  ],
  "total_words": 26457,
  "total_dialogue": 4,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. TOILET STALL - CONTINUOUS - PAST  Elizabeth sits atop a closed commode with her head in her hands, savoring invisibility and relative quiet. A lifetime of ‘being on’ has taken its toll; like she herself is building towards critical mass. She reaches into her handbag and flips open her trinket box. She looks tired, burnt out. She considers the four pills inside long and hard, but denies herself. She flips it shut, flushes (she never went), and exits.  EXT. JEFFERSON HOTEL - NIGHT - PAST  Elizabeth strides from the hotel on a crisp winter’s night, and is caught up by a   PERSISTENT MAN   in his 40s. PERSISTENT MAN Early night?! She doesn’t stop. ELIZABETH If you’re here for a quote, you’re wasting both of our time. Neither does he. PERSISTENT MAN I’ve just watched you extricate yourself from three conversations to use the ladies’ room in the space of thirty minutes. ELIZABETH You busted me. I’m incontinent. Go ahead, write it up. PERSISTENT MAN I hope I’m wrong, but one could be forgiven for thinking you’re sick of this town. She looks at him for the first time. ELIZABETH I haven’t seen you before. You work for the Post? How’d you get in? PERSISTENT MAN I’d like five minutes of your time. ELIZABETH The walk to my car is three, get to the point. PERSISTENT MAN Word on the hill is that the Gun Lobby approached you to bury Heaton- Harris. And you refused. ELIZABETH I don’t comment on ‘the word on the hill’.  19.",
      "characters": [
        "ELIZABETH"
      ],
      "action_text": "PERSISTENT MAN I know there’s no way you’d do that... Unless you support gun control. You know why you’re good, Liz? Same reason Ayrton Senna was the greatest auto racer of his time. The same reason terrorists are scary. ELIZABETH I’m not sure a three-way comparison between myself, a dead race car driver, and Al-Qaeda is a good use of your remaining hundred-and-thirty- five seconds. PERSISTENT MAN A terrorist will strap himself to a bomb for his cause. Senna believed God was protecting him from harm, so he threw himself around corners, fully committed. You won’t find a mercenary on Earth willing to do either. You’re good because you believe in your clients’ causes; conviction-lobbying. And belief motivates people in ways money just can’t. ELIZABETH I said ‘get to the point’- PERSISTENT MAN The Sloane Ranger, sticking up for corporate America against the thieves on the hill, clawing at hard-earned profit to fund frivolities like healthcare. Her ears prick up. Her retort is instant and impassioned. ELIZABETH Or because private property is the foundation of civilized society, I object to any entity being forcibly expropriated of the product of their labor. And you wanna talk about frivolities, those thieves on the hill just spent nearly a million dollars of someone’s hard labor funding research into methane emissions made by dairy cows. I accept a minimum rate of taxation for necessities, but a meddling, all- consuming government constricts freedom, throttles innovation, and subverts the free market. All of which destroy standards of living. PERSISTENT MAN (shrugs, nonplussed) Personally, I’m all for more gun control. Will you admit the present system is unfit for purpose?  20. ELIZABETH I remain committed to the Second Amendment. PERSISTENT MAN Dildos are illegal in Texas, but Joe Public can walk into a sports store and emerge five minutes later with a shotgun. ELIZABETH That would explain the low rate of dildo-related murders in Texas. The Man LAUGHS heartily. ELIZAB",
      "dialogue_count": 1,
      "word_count": 11845
    },
    {
      "scene_number": 2,
      "slugline": "INT. HOTEL BALLROOM - NIGHT - PAST  Influential figures from business and politics rub shoulders and clink champagne flutes. The placard at the entrance tells us we’re at a charity dinner for the prevention of sexual violence in conflict. The disconnect is glaring. FORDE stands in a small circle of ATTENDEES with his CLIENT, a Vera Wang-clad corporate career woman in her 30s. His posture and demeanor are different here; in character, he is polished and gentlemanly. He fits right in. MALE ATTENDEE So we reached the 18th, and I knew all I needed was par to win- FORDE I thought the golden rule was to never beat your client? MALE ATTENDEE Exactly! But he tees off and shanks it into the boonies, how the hell am I not gonna win this?! Polite LAUGHTER from the circle. FEMALE ATTENDEE (to Forde) Calvin, do you get the chance to golf down in Austin? FORDE Not nearly as much as I’d like to. I got a set of Titleist irons gathering dust in my garage.   All the gear, and no idea.  More phoney LAUGHTER. Forde’s client touches him on the arm. CLIENT Excuse me a moment, dear. She goes to the ladies’ room. Forde’s eye catches something, and he peels off from the circle after perfunctory farewells. ELSEWHERE in the ballroom, Elizabeth empties a glass of champagne and returns the flute to a passing waiter. FORDE Howdy. Cal Sneider, I’m in banking and actuarial. You know, you look familiar to me... Elizabeth regards him with no recognition whatsoever. ELIZABETH I’m sorry, I think you have the wrong person. She moves away, uncomfortable. He pursues. FORDE You can do better than that.  67.",
      "characters": [
        "ELIZABETH"
      ],
      "action_text": "ELIZABETH (cold) Really, Mr. Sneider, I’ve no idea who you think I am. Excuse me. She walks away. Forde watches her go, bemused. FROM A CORNER of the ballroom, R.M. Dutton has observed the whole exchange.  INT. COLE, KRAVITZ AND WATERMAN - STRATEGY ROOM - DAY - PAST  Connors watches the TV, pissed. ON THE TV -   CONGRESSMAN BADGLEY   of Michigan fights through press and anti-gun protesters in the shadow of a GIANT RAT. CONNORS I can’t fucking believe they’re showing - can you fucking believe - I don’t fucking believe. JANE Eight of the top ten national news outlets are running it. CONNORS She’s bought them - she’s bought the whole goddam- R.M. DUTTON She doesn’t need to buy them, they swing left all on their own. CONNORS He took that twenty-five grand, we need to make it crystal clear to him what happens if he backs down. R.M. DUTTON I think someone just beat us to it. JANE It has its own Twitter feed. CONNORS Huh? JANE The rat.  INT. OFFICE - DAY - PAST  A dejected Congressman Badgley sits through a strategy meeting with his   SPIN DOCTOR . SPIN DOCTOR Every day that thing follows you around, the more people at the protests, the more voters are- They’re both distracted by the ominous specter of a giant RAT EAR, visible in the window. It ‘waddles’ outside throughout, a big stupid grin on its face.  68. CONGRESSMAN BADGLEY How do we get this fucking thing out of my face? SPIN DOCTOR Ride it out. Might take weeks. Enough time to forge a career-long association between you and a giant rodent. Or you can clarify your position on Heaton-Harris. CONGRESSMAN BADGLEY Can I just stick a knife in it? SPIN DOCTOR If you want the entire news cycle to yourself, be my guest. Congressman Badgley buries his head in his hands and SIGHS.  INT. PETERSON WYATT - STRATEGY ROOM - NIGHT - PAST  SLAP. Congressman Badgley’s mugshot is the latest to get a big green tick stuck over it. SLOWLY PULL BACK to reveal the team working quietly, efficiently. Brian, who just stuck on the tick, talks o",
      "dialogue_count": 2,
      "word_count": 2224
    },
    {
      "scene_number": 3,
      "slugline": "INT. DONUT FACTORY - CONTINUOUS - PAST  A popular donuts and coffee chain. Clara sits at a table, plugged into her laptop, stacks of papers in front of her. CLARA (INTO PHONE) Hey! OK, ah - d’you want me to dial back in a couple minutes? ALEX (INTO PHONE) You kidding? I’m going out of my mind here. I should have been a sports agent. This guy’s been at lunch for the last two hours. Lunch is literally his job. CLARA (INTO PHONE) That can’t be good for your waistline. What’s he look like? Alex flips open a file and regards a bio mugshot of a fat, porcine SPORTS AGENT. ALEX (INTO PHONE) You have a point. (deep breath) Anyway, while we’re on that topic... One of these days, if you’re not too busy, I was thinking maybe we could- AUTOMATED TELEPHONE VOICE (FILTERED) Caller -- ELIZABETH (O.S., FILTERED) (sarcastic deadpan) The Easter Bunny and her Merry Little Helper. AUTOMATED TELEPHONE VOICE (FILTERED) Has entered the conference. THREE-WAY INTERCUT with --  INT. PETERSON WYATT - STRATEGY ROOM - CONTINUOUS - PAST  Elizabeth and Rodolfo Schmidt hover over a conference phone on speaker. ELIZABETH (INTO PHONE) Who do we have so far? ALEX (INTO PHONE) Me and Clara. (quick correction) Clara and I. RODOLFO SCHMIDT (INTO PHONE) Hey guys. Let’s give it a couple minutes then. CLARA (INTO PHONE) (playful) Alex, why don’t you go ahead and finish your thought? Maybe we could..?  76.",
      "characters": [],
      "action_text": "ALEX (INTO PHONE) (panic; in a bind) I was just spit-balling, ah, maybe we could - go see Mel Whitman, Congressman Perez’s chief of staff, lock up his vote once and for all- ELIZABETH (INTO PHONE) The same Perez who appeared on Good Morning America last week, beating the Heaton-Harris drum? I hardly think that’s the best use of your time. Speaking of which, what the hell are you two- AUTOMATED TELEPHONE VOICE (FILTERED) Caller -- ESME (O.S., FILTERED) Esme Manucharian. AUTOMATED TELEPHONE VOICE (FILTERED) Has entered the conference. FOUR-WAY INTERCUT with --  INT. DEMOCRATIC PARTY HQ, ILLINOIS - CONTINUOUS - PAST  Esme is on both her cell and a landline intermittently, as she shouts over the DIN of CROSS-TALK and RINGING PHONES in this campaign boiler room. ESME (into landline) Hold just a second please. (into cell) Illinois says hi, guys. We’re gaining, I’m doing the rounds on local TV, I’m on again tomorrow morning. Rumor out of Perry’s camp is that he’s gonna come out in favor early next week. RODOLFO SCHMIDT (INTO PHONE) Sounds like time well spent. Clara? CLARA (INTO PHONE) In a Donut Factory, going over polling data. ELIZABETH (INTO PHONE) In a Donut Factory? CLARA   (INTO PHONE) You know, with Joe and Jane Public? ELIZABETH (INTO PHONE) Very well. Alex? ALEX (INTO PHONE) Getting nothing from sports agents. None wanna stick their heads above the parapet ‘cause it’ll limit their clients’ commercial appeal. Apparently, we’re not   cool   enough.  77. ELIZABETH (INTO PHONE) Where are you now? ALEX (INTO PHONE) Waiting for Seth Leventhal to roll his fat ass out of Mario’s Trattoria. Been trying to set up a meeting with this pear-shaped bastard all last week, so now I’m just gonna ambush him. ELIZABETH (INTO PHONE) Hold off. The solution’s right there. If Heaton-Harris isn’t cool enough- AUTOMATED TELEPHONE VOICE (FILTERED) Caller -- ROSS (O.S., FILTERED) Hel -- Hello? How do I get this thing to w- AUTOMATED TELEPHONE VOICE (FILTERED) Has entered the conference. FI",
      "dialogue_count": 0,
      "word_count": 5126
    },
    {
      "scene_number": 4,
      "slugline": "INT. MERCEDES S-CLASS - CONTINUOUS - PAST  Elizabeth closes the door and silence envelops the luxury cabin. She hits the start button and the engine PURRS. The MP3 player resumes some vaguely upbeat classical music - Rachmaninov’s Italian Polka. No more than two seconds pass before Elizabeth shoots an arm out to shut it up. She sits for a moment’s silence, sealed off in her little bubble. Finally, she belts up and pulls out.  INT. COLE, KRAVITZ AND WATERMAN - STRATEGY ROOM - DAY - PAST  Jane presents stats to Bob Sandford and the Gun Lobby team. JANE The public is overwhelmingly in favor of gun control. They’ve exploited this and secured the finance necessary to mount a serious challenge. CONNORS Is there not some saturation point? Where everyone who’s backed their position will have coughed in? JANE Yes, but with 80% of the American public on their side, there’s still some way to go. With McGill in the news, this is as good as it gets for us. GEORGE What are your projections? JANE If we take all the uncommitted Congressmen and split them 50-50, they win. 60-40, they still win. We’d need 64% to scrape it. BOB SANDFORD Good God. GEORGE How accurate is your count? JANE Very. BOB SANDFORD Buy them. GEORGE They’re already on the payroll. BOB SANDFORD Buy them again! CONNORS Voter pressure’s too strong.  95.",
      "characters": [
        "BOB SANDFORD"
      ],
      "action_text": "I want everyone in this whole damn firm interviewed - no - I want anyone who ever shared a room with her interviewed. We’ll see how well covered her ass really is. CROSS-CUT STAFF INTERVIEWS: MOORE She wouldn’t let us cut corners. A large part of my job involved researching the legality of our strategy, if there was any exposure she’d hold off. CUT TO: R.M. DUTTON Any questionable surveillance, tapping, anything of that nature? TRAVIS Everybody knows she did it, but we never dealt with those guys. She kept them separate. For evidence purposes, they don’t exist. CUT TO: JANE She’d ply Congressmen with benefits. Free meals, tickets to events, golfing weekends. All paid for by our clients, via the firm. GEORGE Well, that right there’s enough- JANE No, it’s not. She’d make a point of invoicing them. Every single benefit, from a flight ticket to a glass of champagne, she made me keep receipts and invoice the Congressmen. Sure, there was an understanding they’d never pay, but we’d always send an invoice. The debt shows as an asset on our balance sheet, we can theoretically call it in any time we want. GEORGE And that’s legal? JANE Apparently so. You know, now that you ask, there was a time... (hesitates) Ah, it’s nothing. GEORGE Tell me about it.  97.  GEORGE (CONT'D) JANE Just a silly technicality, I didn’t even notice, it was Franklin- GEORGE Jane. I know she mentored you, and you have a lot of respect for her, but you chose this firm. If you have any inkling of misconduct... JANE What would happen? To her? GEORGE (lying) Nothing! We’re mining for leverage, get her to stay out of Nebraska. JANE (beat) There may have been a financial irregularity she glossed over. With the Kenyans, palm oil, the Nutella tax. I think she might have violated the gift ban.  INT. PARKING LOT - NIGHT - PAST  George Dupont approaches a parked Lexus. He gets into the passenger side.  INT. LEXUS - CONTINUOUS - PAST  George Dupont closes the door and takes a brief repose, EXHALES. In the driver’s",
      "dialogue_count": 1,
      "word_count": 1432
    },
    {
      "scene_number": 5,
      "slugline": "INT. CAFE - DAY - PAST  Elizabeth shakes hands with   PRU WEST , who introduces   GORDON . PRU WEST So kind of you to meet at short notice. This is Mike Gordon from our legal department. ELIZABETH Daniel Posner from ours. Pru West and Elizabeth sit. Gordon and Posner follow. Gordon sets a dictaphone down on the table. Posner does likewise. There’s a very obvious hostility behind all the niceties. PRU WEST Ms. Sloane. You’re at the forefront of an industry with a very bad rep. D’you think it’s deserved? ELIZABETH Yes. When a company forks out campaign contributions to a Congressman who then supports legislation favorable to that company, the public see bribery. Because that’s what it is. PRU WEST Can the system change? ELIZABETH Even if you take the money out of it, lobbying will never go away. At its core, lobbying is about relationships. You can’t outlaw relationships. PRU WEST But the bribery you described earlier, that can change? ELIZABETH Yes, but it won’t. The two parties capable of effecting change have no interest in doing so. Why would Congress change a system they profit from? PRU WEST Who’s the second party? ELIZABETH You are. The media. It’s far easier to generate hatred for individuals than it is for abstract systems, so you don’t go for the system, you go for the personality. You choose scandal over insight, and who can blame you, readers respond to it. If you don’t feed it to them, your rival will, you’ll go bust and lose your job. Which brings me to my question for you: why are you wasting my time?  101.",
      "characters": [],
      "action_text": "PRU WEST Excuse me? ELIZABETH You’re asking me abstract questions about the nature of lobbying which, sure as you were born crying, will not form the basis of your article. I’m going to go out on a limb and say this meeting is nothing more than an exercise in box-ticking, and your article’s already written. GORDON (to Pru West) Don’t respond to that. (to Elizabeth) That’s purely speculative on your part, if you have any evidence of this, by all means produce it. ELIZABETH Like I said, I’m going out on a limb. Pru West smiles smugly, knowing Elizabeth is right but powerless to stop the process. ELIZABETH (CONT’D) Who is controlling you? POSNER Let’s not do this. ELIZABETH Why now? GORDON The fact is, you have no way of knowing what Ms. West intends to do with the information gleaned from- ELIZABETH It’s clear you have no interest in what I have to say- GORDON And how would you know that? ELIZABETH (beat) Your dictaphone’s off. Elizabeth exits. Posner grabs his dictaphone and follows.  INT. PETERSON WYATT - STRATEGY ROOM - DAY - PAST  The entire room engrossed in the D.C. Star. ALEX It’s a hit alright. ELIZABETH I thought it could’ve been worse.  102. ROSS I got four factual errors so far. RODOLFO SCHMIDT This isn’t good. ELIZABETH Stop fussing. Put The Star in the recycling. They’ll make pencils out of it, maybe one will find its way into the hand of a reporter with some integrity. It’ll go away.  INT. PETERSON WYATT - RODOLFO’S OFFICE - DAY - PAST  WHACK! A week has passed, and Ross dumps two large lever arch files, both bursting at the seams, on Rodolfo’s desk. ROSS Every attack since the Pru West hack- job that kicked it all off. Every single one just the right side of libelous. RODOLFO SCHMIDT So much for it going away. ROSS My personal favorite is the one about how you toppled the High School Head Prefect in a fabricated plagiarism scandal. I’m assuming that’s not libelous ‘cause I can totally see it. ELIZABETH God, that witch was insufferable. RODOLFO SCHMIDT T",
      "dialogue_count": 0,
      "word_count": 925
    },
    {
      "scene_number": 6,
      "slugline": "INT. U.S. CONGRESS - WAITING ROOM - DAY - PRESENT  SUPER: September 21, 2015 Posner, Alex, and Elizabeth talk at crossed purposes. POSNER (to Alex) We’re on in minutes, you need to get out of here- ALEX Shearman, Ohio, d’you know anything we can hit him with? ELIZABETH Not off the top of my head, I’ll look into it first chance I- POSNER This isn’t her job any more! ALEX (to Posner) You work for the Lobby now? ‘Cause that was their plan all along. POSNER I. Don’t. Care. My job is keeping her out of jail. You’re done here. Alex exits. Elizabeth calls out: ELIZABETH How’s it looking? Alex shakes his head. Not happening. ELIZABETH (CONT’D) Find a way, get to it!  INT. CONGRESSIONAL HEARING ROOM - DAY - PRESENT  Congressman Sperling questions Elizabeth. CONGRESSMAN SPERLING Regarding your representation of the Kenyan government... Senator Len Davies, the sponsor of the bill you dubbed the ‘Nutella Tax’, was flown to Kenya first-class and put up in a five-star hotel, only a week before the bill was dropped. Our audit puts the cost of this trip at over $20,000. Did the Senator ever reimburse these expenses? ELIZABETH No. CONGRESSMAN SPERLING Was he ever invoiced for them? ELIZABETH No.  105.",
      "characters": [],
      "action_text": "CONGRESSMAN SPERLING Was there any expectation that Senator Davis would repay this? ELIZABETH The trip was paid for by the Kenyan Government. If you’re implying I violated the gift ban, you’re barking up the wrong tree. Sovereign states are exempt from the gift ban under Chapter 2 of the House and Senate Ethnics Manuals. CONGRESSMAN SPERLING You sure the Kenyans paid for that trip? See, I don’t think they did. (beat) The trip was funded from a pooled account. Is it not true that one of your staff raised a concern, which you hastily dismissed? ELIZABETH I’ll tell you what I told Franklin Walsh. The Kenyan Government contributed enough to that account to cover the trip five times over. CONGRESSMAN SPERLING But it’s true that the account contained funds from private entities? F&B conglomerates? ELIZABETH Their contributions made up one quarter of the total, yes. CONGRESSMAN SPERLING Is it not also true that, because the Kenyans instructed you late on this, funds from private entities were already in the pooled account when the Kenyans transferred their funds in? ELIZABETH Yes, I believe so. Posner looks crestfallen. He knows what this means. MEDIA BUZZ ratchets up. They smell blood. CONGRESSMAN SPERLING (beat; nods) Well. We have ourselves a smoking gun. This is a violation of Chapter 2 of the Senate Ethics Manual, which prohibits the furnishing of money or gifts from a private entity to a member of Congress. ELIZABETH I repeat, the trip was furnished by the Kenyan government-  106. CONGRESSMAN SPERLING I’m afraid that’s not accurate. In accordance with Regulation 17, subsection (d) of the Financial Accounting Standards Board guidelines, funds in a pooled account are to be treated under a principle known as FIFO. First In, First Out. It means that money paid into a joint account first, is the first money to be paid out of it when the account is drawn upon. The effect of this, is that the Kenyan Government didn’t contribute one dime towards the $20,000 that was spent on",
      "dialogue_count": 0,
      "word_count": 4905
    }
  ]
}