{
  "slug": "modern-family-103-come-fly-with-me-2009",
  "title": "modern family 103 come fly with me",
  "genre": "drama",
  "format": "series",
  "scenes_count": 2,
  "characters_count": 1,
  "characters": [
    "GLORIA"
  ],
  "total_words": 3543,
  "total_dialogue": 1,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. JAY & GLORIA’S HOUSE - ENTRYWAY - DAY 9   9  Tight on Jay.  JAY  You’re here to “hang out?”  Reveal Phil at the front door.   He holds up a six pack.  PHIL  Brought six friends.  PHIL INTERVIEW 10   10  PHIL  I decided to make more of an effort  with Jay.   Our relationship’s  always been stuck in that primal  place where we started.   He’s the  old silverback protecting his  females.   Then this younger,  stronger gorilla comes swinging in,  beating his chest.   Naturally the  ape-ladies come running, presenting  their nice scarlet behinds.   Papa  ape wants to stop all that, but he  can’t.   That’s just life.   I’m not  the enemy.   The enemy is poachers.  INT. JAY & GLORIA’S HOUSE - LIVING ROOM - MOMENTS LATER 11   11  Jay is on the couch finishing up his plane.   Phil stands  awkwardly.  JAY  Do you have to just stand there?  You’re making me uneasy.  PHIL  Um...  JAY  For god’s sake, sit down.   You can  hold this wing in place while I  fasten this.  Phil hesitates.   Jay waves him over.  JAY (CONT’D)  Come on.  MODERN FAMILY   \"Changes\"   8/26/09 Shooting Draft   9.",
      "characters": [],
      "action_text": "Phil sits uncomfortably on the couch, exactly as Dylan did in  the first scene.  END OF ACT ONE  MODERN FAMILY   \"Changes\"   8/26/09 Shooting Draft   10. ACT TWO  INT. COSTCO - DAY 12   12  Mitchell is at a shopping cart.   Cameron shows up with a   *  package containing a dozen large tubes of toothpaste and a  wrapped package of fifty bars of soap.   *  CAMERON  Got the toothpaste and the soap.  MITCHELL  Oh good, now we can open that  general store.  (then)   *  I thought we were just here for   *  diapers.   *  CAMERON   *  We had an old saying back on the   *  farm: as long as you’re bringing   *  the mule to market --   *  (then)   *  I feel you rolling your eyes,   *  Mitchell.   *  MITCHELL & CAMERON INTERVIEW 12A   12A   *  CAMERON   *  It was at one of Pepper’s game   *  nights that we met... I remember   *  Mitchell because he kept rolling   *  his eyes every time I got a little   *  boisterous --   *  MITCHELL   *  I was not.   *  CAMERON   *  You were a little.   *  MITCHELL   *  Maybe a little.   *  (then)   *  Anyway, we started playing charades   *  and it was my turn to act out a   *  clue, but when I saw what it was I   *  had no idea how to do it.   All I   *  could think of was...   *  Mitchell mimes placing his hands on piano keys.   *  MODERN FAMILY   \"Changes\"   8/26/09 Shooting Draft   11. MITCHELL (CONT’D)   *  Without missing a beat, Cam said --   *  CAMERON   *  Casablanca.   *  MITCHELL   *  I mean, all I did was this...   *  He does it again.   *  INT. COSTCO - CONTINUOUS 12B   12B   *  MITCHELL  Let’s just get the diapers and get   *  out of here.   *  CAMERON   *  Fine, I just want to swing by the   *  wine section.   *  MITCHELL   *  There’s a wine section?   *  CAMERON   *  A good one.   Just past the tires.   *  MITCHELL   *  No way, they don’t have --   *  (noticing)   *  Oh my god.   The paper shredder I   *  wanted.   Confetti and crosscut.   *  The true scope of the store begins to dawn on Mitchell.   *  MITCHELL (CONT’D)  Cam, w",
      "dialogue_count": 0,
      "word_count": 2002
    },
    {
      "scene_number": 2,
      "slugline": "INT. CAFE - DAY 22A   22A   *  Gloria and Alex are seated across from each other.   *  GLORIA   *  Well, I have a small flower on my   *  ankle, and a tiny butterfly on   *  my... upper thigh.   *  ALEX   *  How high up?   *  GLORIA   *  Pretty high.   *  ALEX   *  Did you do it to look sexy?   Did   *  you do it for a guy?   Does Grandpa   *  like it?   *  GLORIA   *  No.   No.   Oh yes.   *  ALEX   *  That’s gross.   *  GLORIA   *  (shrugs)   *  Meh.   *  ALEX   *  Let’s go back to your piercings.   *  GLORIA   *  No, no, I have played balls, and   *  answered a lot of your questions.   *  I have one question for you.   *  ALEX   *  What is it?   *  GLORIA   *  Why don’t you want to wear a dress?   *  ALEX   *  Because I don’t want to look like   *  Haley and her stupid friends.   *  GLORIA   *  I wear a dress and I am not Haley.   *  ALEX   *  You are Haley, just forty years   *  older.   *  MODERN FAMILY   \"Changes\"   8/26/09 Shooting Draft   21.",
      "characters": [
        "GLORIA"
      ],
      "action_text": "GLORIA   *  Ten.   *  ALEX   *  Twenty.   *  GLORIA   *  Deal.   *  (then)   *  But Alex, why do you fight me on   *  this --   *  ALEX   *  Just leave me alone, okay.   It   *  doesn’t matter if I dress up.   I’m   *  not pretty like Haley and you.   *  GLORIA   *  Well, that is ridiculous.   You are   *  a beautiful girl.   *  ALEX   *  I’m not.   But that’s okay, I’m the   *  smart one.   *  GLORIA   *  You really believe this?   *  ALEX   *  It’s true.   *  GLORIA   *  The cute busboy doesn’t know you’re   *  smart.   *  ALEX   *  What?   *  GLORIA   *  He smiles at you every time he   *  fills our water.   *  ALEX   *  He does not.   *  GLORIA   *  Why do you think we are the only   *  people here with bread?   *  She sees Alex taking a subtle look in the direction of the   *  Busboy.   *  MODERN FAMILY   \"Changes\"   8/26/09 Shooting Draft   22. Alex, I’ve been thinking about it,   *  and it’s not the end of the world  if you don’t wear a dress to the  wedding.   *  ALEX  It’s all right, I bought one.   *  Alex runs upstairs.   Claire turns to Manny.   *  CLAIRE   *  (re: Alex)   *  See what she does?   *  MANNY   *  We can talk about it next week.   *  Jay comes in, helping a drugged Phil.   During the following,   *  Jay will deposit him on the couch.  JAY  Clear the way.   *  CLAIRE  What happened?  JAY  Just a little accident.   Nothing  big.  PHIL  I was in a plane crash.  CLAIRE  Will somebody tell me what  happened?  Claire examines a bruise or some cuts on Phil.  JAY  We were threading the needle and   *  somebody moved.  PHIL  No I didn’t.   You did it on   *  purpose.   *  JAY  That’s the painkiller talking, he’s   *  a little loopy.   *  GLORIA  How bad is it?  MODERN FAMILY   \"Changes\"   8/26/09 Shooting Draft   24.  CLAIRE (CONT'D) JAY  One of the wings is cracked and the  propeller is bent, but I can --  GLORIA  I mean Phil.   *  PHIL   *  I was in a plane crash.   *  JAY  (aside to Gloria and  Claire)  Look, I didn’t ask for him to be  there.   H",
      "dialogue_count": 1,
      "word_count": 1541
    }
  ]
}