{
  "slug": "monsters-university-2013",
  "title": "monsters university",
  "genre": "horror",
  "format": "film",
  "scenes_count": 3,
  "characters_count": 2,
  "characters": [
    "SULLEY",
    "MIKE"
  ],
  "total_words": 24868,
  "total_dialogue": 2,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. NEIGHBORHOOD - DAY  A bird lands on the ground.   It pecks at something, then the  head stays up and another head pecks at the ground.   It turns  and we see that it has two heads.  It squawks and flies off....  A SCHOOL BUS makes its way down the street.   Singing can be  heard from the kids inside.   Pan up to reveal “Frighton  Elementary” on the side of the bus.  KIDS  (singing)  The neck bone’s connected to the:  head bone.   The head bone’s  connected to the: horn bone.   The  horn bone’s right above the...wing  bones.  (laughing)  The bus pulls into a parking lot.  The bus doors open and a THIRD GRADE CLASS OF MONSTER KIDS  pour through, pushing and yelling and laughing and being  generally chaotic.  KID #1  RAHR!  KID #2  Ahh!  KID #1  I scared you!  KID #2  (laughing)  No you didn't!  MRS. GRAVES  Okay, remember our field trip rules  everyone:   No pushing, no biting,  and no fire-breathing.  One of the kids breathes fire on one of his friends.  FIRE STUDENT  (breathing fire)  RAHR!  1.",
      "characters": [],
      "action_text": "A TEACHER MONSTER, MRS. GRAVES, stands over him, giving him a  stern look.  MRS. GRAVES  What did I just say?  (sigh)  18, 19...?   Okay, we’re missing  one.   Who are we missing?  ON THE CLOSED BUS DOORS.  A little green hand knocks on the windowed doors.  ON MRS. GRAVES.  MRS. GRAVES (CONT’D)  (realizing - this isn’t  the first time...)  Oooh, Mike Wazowski.  The bus doors open revealing a very tiny, 8-year-old Mike  Wazowski, smiling.  YOUNG MIKE  Thanks Joe!   Good luck finishing  your crossword puzzle!  MRS. GRAVES  Sorry, Michael!   I didn’t see you.  Mrs. Graves approaches and Mike jumps down.   When Mike hits  the ground, we see how much bigger all the other kids are.  YOUNG MIKE  That’s okay.   When I was on the  bus, I found a nickel!  Mike walks away, holding the nickel.  YOUNG MIKE (CONT’D)  (sotto)  I wish I had pockets....  MRS. GRAVES  (to the kids)  Okay, everyone, partner up.   Get  your field trip buddy!  ON MIKE as he tries to buddy with the kids who all happen to  be bigger than him.  YOUNG MIKE  Jeremy?   You and me?   Okay, no  biggie.   Haley?   No?  2.  (MORE) Pairing up with Claire?   Great  choice, she’s a good egg.   Russell.  Mike.   Wazowski?   We carpool.  We’re cousins.  PHIL, RUSSELL  (high-fiving)  Hey!  Phil and Russell head off.  YOUNG MIKE  Okay, good catching up!  Everyone has paired up, leaving Mike on his own.   For a  second, Mike’s smile falters.  Mrs. Graves approaches and smiles bitter-sweetly.  MRS. GRAVES  Well, Michael, it looks like it’s  you and me again.  YOUNG MIKE  (small laugh)  Mrs. Graves takes Mike’s hand.  Mike sees the kids walking up ahead.  YOUNG MIKE (CONT’D)  (to his teacher)  C’mon Karen, we’re falling behind.  Mike tugs on Mrs. Graves’ hand, pulling her toward the other  students.  MRS. GRAVES  (laugh)  Please don’t call me Karen.  As we crane up, REVEAL we’re at Monsters, Incorporated.  INT. MONSTERS, INC. - HALLWAY  Mrs. Graves’s class is met by a monster TOUR GUIDE.  MI TOUR GUIDE  Now stay close toge",
      "dialogue_count": 0,
      "word_count": 2998
    },
    {
      "scene_number": 2,
      "slugline": "INT. MIKE AND RANDY’S DORM ROOM  Mike finishes putting the last of his many scaring posters  up, placing books on a shelf, along with Little Mikey and  pinning up the Scare Games flyer.  He then consults his checklist.  MIKE  Okay, unpack - check.   Hang posters  - check.   Now I just need to ace my  classes, graduate with honors, and  become the greatest scarer ever.  RANDY  Boy, I wish I had your confidence,  Mike.   Aren't you even a little  nervous?  MIKE  Actually, no.   I’ve been waiting  for this my whole life.  Mike holds the MU hat he got from the scarer when he was a  kid.   He walks toward the window.  MIKE (CONT’D)  I just can’t wait to get started.  We see the scare school in the distance.  EXT. SCARE SCHOOL - MORNING  The sun rises over the campus, as students make their way to  class.  GONG!   The bells in the campanile sound the hour, signalling  the start of the day.  A slug student realizes he’s late.  SLUG  Oh man!   I can’t be late on the  first day!  He pumps his arms furiously but doesn’t get very far.  CUT TO:  18.",
      "characters": [
        "SULLEY",
        "MIKE"
      ],
      "action_text": "EXT. SCHOOL OF SCARING  Mike and Randy head into the School of Scaring with the other  students.  Students touch a statue as they pass by - an MU superstition.  Mike has to jump up a little to reach it, but he touches the  statue too.  INT. SCHOOL OF SCARING  Mike takes in the enormous rotunda-style classroom.  MIKE  Wow.  Busts of distinguished scare professors and alumni sit on  pedestals near the windows.   In front of each one is a scream  can.  Mike takes a seat, much bigger monsters on either side of  him.   A couple of them look down at Mike, amused.  BIG STUDENT #1  (chuckle)  BIG STUDENT #2  You gotta be kidding me....  Randy sits next to Mike.  RANDY  I’m so nervous....  MIKE  Relax, it’ll be fine.  A large, tough, drill sergeant monster, PROFESSOR KNIGHT,  addresses the class.  PROFESSOR KNIGHT  Good morning students, welcome to  scaring 101, I am Professor Knight!  Now, I’m sure all of you were the  scariest monster in your town, well  bad news kids, you’re in my town  now, and I do not scare easily---  (short scream)  Suddenly a beam of light falls over Professor Knight.  STUDENTS  (gasps)  19. He stops and looks up to a now empty window.   A shape flies  around the room, closing the curtains and lands with a  clatter behind him.  STUDENTS (CONT’D)  (walla)  Dean Hardscrabble/That’s really  her.  The class watches as a form steps out from the light  revealing a tall dragon woman with large bat wings, DEAN  HARDSCRABBLE.  PROFESSOR KNIGHT  Dean Hardscrabble.   This is a  pleasant surprise.  ON Mike watching Hardscrabble heading across the room, her  chilling insect legs tapping against the floor.   Mike’s smile  brightens.  MIKE  (whispered to Randy)  She’s a legend; she broke the all  time scare record with the scream  in that very can.  ON HARDSCRABBLE.  She adjusts her scream can slightly.  HARDSCRABBLE  I don’t mean to interrupt, I just  thought I’d drop by to see the  “terrifying” faces joining my  program.  STUDENTS  (murmur)  PROFESSOR KNIGHT  Wel",
      "dialogue_count": 2,
      "word_count": 12407
    },
    {
      "scene_number": 3,
      "slugline": "EXT. ROAD - NIGHT  Ms. Squibbles drives a car filled with the Oozma Kappas.   She  pulls over and stops, and the Oozma Kappas stretch as they  climb out of the car.  DON  Okay, I need to get out....  ART  Excuse me, my leg’s caught.   There  we go, I got it.  TERRI  Ah...my tentacle fell asleep.  SQUISHY  Thanks, mom!  MS. SQUIBBLES  Have fun, kids!   I’ll just be here,  listening to my tunes.  Ms. Squibbles rolls up the window, and we hear muted heavy  metal thrasher music pounding from inside the car.  ART  Hey, uh, where are we?  Mike walks up to a gate with the guys behind him.   Mike looks  over the gate in awe, as we reveal... Monsters, Incorporated.  MIKE  The big leagues.  Sulley is stunned.  DON  Holy, rolly polly...  SQUISHY  Wow!  ART  Nice fence.  SQUISHY  This is amazing, Mike!  MIKE  We're not stopping here.  94.",
      "characters": [],
      "action_text": "Mike holds up a pair of wire cutters and does a chop-chop  action.  EXT. MONSTERS, INC.  We see a fence cut out and a “No Trespassing” sign on the  ground.  SQUISHY  (nervous voc)  We pan up and see the guys climbing a ladder that gets them  onto the roof of Monsters, Inc.  SQUISHY (CONT’D)  This is crazy, we’re gonna get  arrested!  MIKE  Shh!  CUT TO:  INT. MONSTERS, INC.  They all look down through a window and all their eyes go  wide.  MISFITS  Oh, whoa!   Wow.  (excited laugh)  THEIR POV  We look down on a working scare floor.   The floor is full of  scarers moving in and out of their active doors.   We see  several monsters go through their entire routine.  SQUISHY  Look at them, they’re going into  the human world and they don’t even  look scared!  Mike and Sulley take it all in.   They’re awestruck.   The  fraternity brothers look down in amazement.  MIKE  (to the group)  Take a good look, fellas.   See what  they all have in common?  Squishy strains, but then turns to Mike confused.  95. SQUISHY  Ehhh...no, not really.  MIKE  Exactly.  A sea of monsters of all shapes, sizes, ages, genders, fill  the floor, all scaring in their own way.  MIKE (CONT’D)  There’s no ONE type of scarer.   The  best scarers use their differences  to their advantage.  The team smiles watching all the various types of monsters  using their varied appearances, sizes and shapes in unique,  skillful ways.  A tall skinny guy with long skinny arms flails them around  like wild hoses.   Squishy watches a puff ball turn into a  spider.  SQUISHY  Wow.  TERRY  Terri, look!  ON a three-headed monster as it comes out of a room.  Sulley is starting to see Mike in a new light.   Huh.   Mike  might actually be right about this.   The misfits are  certainly inspired....  DON  Hey, look at that old fella rackin’  up the big numbers!  MIKE  (amazed)  Don, that “old fella” is Earl “The  Terror” Thompson!  SULLEY  What!   Where?!   That’s really him?  MIKE  He held the scare record for three  years! ",
      "dialogue_count": 0,
      "word_count": 9463
    }
  ]
}