{
  "slug": "moonlight-2016",
  "title": "moonlight",
  "genre": "comedy",
  "format": "film",
  "scenes_count": 9,
  "characters_count": 0,
  "characters": [],
  "total_words": 16262,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. PAULA'S APT - NIGHT 22   22  Little standing away from Paula, face open and curious as we see what he sees: an average, working class black man -- longshoreman type -- sitting at the small dining table just off the kitchen. Paula standing as this man sits watching Little, neither of them seeming very familiar with the other; neither seeming very   interested   in the other. A lot of busy work from Paula there, taking things into her arms: glass things, aluminum things, curious things we cannot  quite   see. PAULA (at man) Come on. Paula heading off toward the rear bedroom, the man quietly rising after her, the can of Old English we heard opening clutched in his hand as he follows her across the apartment. Little watching the procession -- confused, suspicious -- eyes lingering on the bedroom door as it closes behind them. OMITTED 23   23  INT/EXT. ELEMENTARY SCHOOL - DAY 24   24  Little entering the front gates of this school. No other kids around, he’s either late or early as a SCHOOL GUARD waves him through. INT. ELEMENTARY SCHOOL, DANCE ROOM - DAY 24A   24A  An open room: high ceilings, grey dance mat spanning the bulk of the room, mirrors running the length of two walls, a ballet studio. Fifteen to twenty boys and girls moving about -- no coordination, just movement and silliness. We find Little among them, throwing his head back, moving his hips to lord knows what rhythm. And holy hell: for the first time all film, it looks like he might be having fun as we... CUT TO: 21.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 267
    },
    {
      "scene_number": 2,
      "slugline": "INT/EXT. ELEMENTARY SCHOOL - DAY - MOVING 24B   24B  Moving   with Little as he makes his way along an exterior pathway within this school. His backpack pulled tight on his shoulders, no one else around as he crosses this space. Ahead of him, a wooden plank appears, leading to adjoining portable classrooms. Little heads up the path, steps into... INT. ELEMENTARY SCHOOL, PORTABLE CLASSROOM - DAY 25   25  Little taking two steps in, stops immediately. REVERSE ANGLE: A circle of boys ...seven in a semi-circle, their backs to us, older looking for an elementary, all of them looking down and   in   on one another. All eyes go to Little, a hurried, hushed business. One of the boys breaks away from the circle, hustles over. As he nears, his identity becomes clear: this is Kevin from our earlier “wrestle.” KEVIN Somebody with you? A nod “no” from Little, Kevin moving past him, over to the portable door and “locks” it. Grabs Little’s shoulder strap, pulls him over to the circle. KEVIN I swear it was locked. ...wedges Little... INSIDE THE CIRCLE ...the other boys barely paying attention as we take them all in, drifting from face to face inside this circle. All their eyes and hands are cast down: they’re comparing their dicks. We drift within this circle: PORTABLE BOY 1 Yo’ shit ugly as hell. PORTABLE BOY 2 So, at least mine ain’t a peanut. 22.",
      "characters": [],
      "action_text": "PORTABLE BOY 3 He got a Freddy Kruger dick, yo’ shit look like Freddy. PORTABLE BOY 1  Yo’   shit ain’t even that big, it’s like the same size as mine, look. Boy 1 leaning into the circle, his head nearly butting Boy 2’s, facing him, they may as well be touching dicks. PORTABLE BOY 1 See! Boy 1 distracted now, looking over at Little. PORTABLE BOY 1 Who let his ass in? KEVIN (O.S.) He just came in. Kevin is over at the door again, playing lookout. PORTABLE BOY 1 What they call you?   Little , right? PORTABLE BOY 1 Show your shit. PORTABLE BOY 3 Why you think they call him Little? Laughs from all the tough guys gathered, Boy 1 grabbing Little roughly by the neck, watching as Little reaches down to himself, nervously unzips his pants. Beat. All the eyes here cast down again, staring down at Little, down at his dick. A curious, prolonged silence, then... KEVIN ...looking back over his shoulder, back at the circle. From his vantage, the backs of all those heads cast down and focused on Little. Off Kevin’s gaze, CUT TO... 23.",
      "dialogue_count": 0,
      "word_count": 428
    },
    {
      "scene_number": 3,
      "slugline": "INT. PAULA'S APT - DAY (DUSK) 26   26  Little entering, stopping himself just a few feet inside as the door closes behind him. A beat of Little listening to the house, tiny ears perked just so. Glances at the far wall -- a modest television used to be there. Blinks in confusion. Off the sound of silence... CUT TO: FLAME ...a chemical flame of blue and red. INT. PAULA'S APARTMENT, KITCHEN - NIGHT 27   27  The front burner on this gas range, Little's scrawny, lanky arms setting a five-gallon pot of water to the stove. The quickest beat of Little before the stove, then... INT. PAULA'S APARTMENT, BATHROOM - NIGHT 28   28  Looking down into a quarter full bathtub, fresh water pouring into it from the spigot. The run of water stopping, the rippling surface slowing as footsteps tread away. A quick beat, then... the return of foot-steps, the sound of them growing nearer as.... REVERSE ANGLE: Little here carrying that five-gallon pot, from the steam coming off it, searing hot with boiling water. Gets it right up to the edge of the tub, expertly,   carefully  pours it in, face leaned back to avoid the steam furiously rising from the surface. Finishes this pouring and sets the pot down behind him, on its side so the handle props most of its metal surface from the carpet. Reaches down to the floor, retrieves a bottle of dollar store dish washing liquid. As he squeezes a ton of this stuff into the water... CUT TO: LITTLE ...in that tub now, soaking in bubbles. 24.",
      "characters": [],
      "action_text": "A beat of the boy at peace. An   extended beat   of this boy at peace, right here with him for a change, no distractions, no deflections. So young and yet... so much happening behind those eyes. So much   weight . INT/EXT. JUAN'S CAR - NIGHT - MOVING 29   29  Neck craned out the window, cruising the neighborhood. VOICE (O.S.)  Heyyyyy, Juan!  Juan barely nodding at whomever that came from, continuing on his way as we CUT TO: TERRENCE ...counting out dollars. EXT. ABANDONED COMPLEX - NIGHT 30   30  Terrence completing a transaction, stuffing money into his pockets and nodding in the direction of one of his runners. Standing opposite him, a face we’ve seen briefly but will recognize: Paula’s longshoreman. As the longshoreman moves off, approaches the runner appearing from behind the complex, Juan approaches, that smooth easy gait of his. It’s a brief moment, but... Juan and the longshoreman meet eyes as they pass one another, nothing of import, but... a moment. JUAN ...approaching Terrence with a nod, all that needs to be spoken as Terrence nods back, whistles at one of the other boys, sends him running off into the cut. TERRENCE Been a good one today. Just a nod from Juan, his attention elsewhere now, following after the longshoreman. Down the block a ways, not close but within shouting distance, we SEE the longshoreman getting into the driver’s side of a Chrysler sedan. Beat. 25. JUAN They basin’? Nothing from Terrence, just watching the same as Juan. JUAN You lettin’ niggas light up at the spot, now? (moving now) You know the rules, no lightin’ up at the spot. Juan getting to the sidewalk now, moving toward the longshoreman’s car a block or so up ahead. Gets there, finds the windows rolled up, a flash of flame emanating from inside. Knocks on the window. Longshoreman rolls it down with a drugged out smile, shrugging his shoulders in apology. Juan not amused by the display and, catching a glimpse of the woman in the passenger seat, clicks into something much more me",
      "dialogue_count": 0,
      "word_count": 2595
    },
    {
      "scene_number": 4,
      "slugline": "INT. PAULA’S LIBERTY SQUARE APT - DAY - CONTINUOUS 38   38  PAULA (30s now, worse for the wear), looking as strung out as ever as she rushes past him... CHIRON Hey Ma.... PAULA (calling back) Find somewhere for you to be. Paula slips into the rear bedroom, closes the door behind her with a considerable thud. Chiron stares at that door indifferently: this is nothing new for him. OMITTED 39   39  EXT. JUAN’S HOME - DAY 40   40  Chiron walking up the block, approaching Juan’s home. As he nears it, we HEAR: TERESA Well I’ll be --   Chiron?!  TERESA appears from the yard, out there in the yard, a bushel of dead palm fronds in hand. She’s aged some, but certainly aged better than the rest. Pulls Chiron into a hug, beaming the most amazing smile. INT. JUAN’S HOME - NIGHT 41   41  Chiron and Teresa at the table in Teresa’s dining room, fresh plates of food before both. Teresa watching as Chiron picks at his plate, paying it just enough attention to qualify as eating. Still... TERESA What’s wrong? CHIRON Nothing, I’m good. TERESA Nah. I seen good and you ain’t it: what’s wrong, Little? 37.",
      "characters": [],
      "action_text": "CHIRON Don’t call me that. TERESA Don’t call you what? Your   name ? You   grown   now? CHIRON I didn’t say that. TERESA Then what you sayin’? Chiron goes quiet. Doesn’t take much. TERESA I’m just messin’ with you boy. (and) And you right, that ain’t no name for you no more. That ain’t you. But if you wanna be somethin’ different, you gotta earn it, you gotta make your name true, understand? Chiron bows his head, out of embarrassment, out of shame? TERESA Hey, don’t put your head down in my house, you know Teresa’s rule: all love, all pride in this house, you feel me? He mumbles, he nods. TERESA What’s that? CHIRON Yeah. (and) I feel you. Teresa rises. She’s not a   tall   woman, so... TERESA Good. (she smiles) Now since you here, there’s some stuff way back on the top shelf in the kitchen I’ve been meaning to get to. 38. Off Chiron’s smiling face.... INT. JUAN’S HOME, SPARE BEDROOM - NIGHT 42   42  A simple room, small twin bed and a single sitting chair. A window just beyond the bed, looking out onto the side-yard. Chiron standing over the bed, pulling the corner on a fitted sheet. From the looks of this room, no one sleeps here. From the looks of Chiron, he’s made and unmade this bed before. CHIRON Thank you for this. Hadn’t noticed Teresa there in the doorway, looking on as Chiron goes about this work. TERESA You know you can stay here anytime, right? CHIRON Yeah. I know. Thank you Teresa, I mean it. Teresa moving from that doorway now, approaching Chiron and that bed. TERESA But if you gonna stay here you got to learn how to make a bed, boy. Teresa laughing as she takes that corner of sheet from Chiron’s grasp, tugs it lightly: the entire cover slips off with ease. CHIRON What? TERESA How you mean,   what?   That ain’t how you make no bed. Teresa moving instinctively, has already got the two bottom corners snagged expertly, is pulling the third corner just so as Chiron watches. TERESA (playful) Think you slick, huh? Do it wrong so Teresa show up and do it right",
      "dialogue_count": 0,
      "word_count": 1213
    },
    {
      "scene_number": 5,
      "slugline": "INT. PAULA’S LIBERTY SQUARE APT - DAY - CONTINUOUS 47   47  Paula walking the apartment determinedly, looking behind half- closed doors and even opening a closet or two. Easing now, she settles in the middle of the space, hands rested at the top of her head. After a beat of thinking, of coming to... ...she turns to Chiron, still there watching from the threshold of the apartment. Paula smiles. Chiron approaches her: CHIRON Mama what you into? PAULA I need some money. CHIRON For what? PAULA That’s my business, don’t you ask me no shit like that. CHIRON I don’t have no-- PAULA Don’t lie to me. I’m your mama. That bitch over there ain’t no kin to you, I’m your   blood , remember? (and) Now I ain’t feeling good. I need something to help me out, baby, just float me across this shake, you hear? CHIRON Where I’m supposed to get money from? PAULA Teresa ain’t give you nothing, huh? Your lil’ play-play mama ain’t put something in your hand? Now give me that damn money, Chiron. Chiron reaches into his pocket, grabs a few bills there, can’t be more than forty dollars but it’s literally his last. 43.",
      "characters": [],
      "action_text": "PAULA Uh huh, I know that bitch like a hooker know her trick. You   my  child, okay? And tell that bitch she better not forget it. Chiron just stares at Paula, unfolding those bills there, crisping and lining them, force of habit. PAULA Go on to school. Ain’t you late? Chiron just staring, his mother in physical form but someone entirely different in mind and spirit. Paula looks up from her counting, finds that scornful face so much like hers looking down on her. INT. HIGH SCHOOL, CLASSROOM - DAY 48   48  Mr. Pierce at the head of a bored looking class, explaining the differences between red and white blood cells. Turns to the class: MR. PIERCE So can you see how a lack of white blood cells could be dangerous to the human body? Crickets in here, no one taking that bait: MR. PIERCE  Okay , can anybody explain what will happen to the body when there’s not enough white blood cells? (and) Nobody’s leaving this classroom until I get a response, this is more important for you than it is for me, trust me. Pierce scanning the room here now, most honestly don’t know the answer, others simply don’t care. Shockingly, a familiar hand goes up: MR. PIERCE Terrell? TERRELL Ummm yeah Mr. Pierce, I’m gonna answer this question, man... 44. but first I just gotta say, why the  hell   this nigga Little wearing the same shit he had on yesterday? Big laughs from the class, Terrell hamming it up: TERRELL Ain’t enough white blood cells in the world to check the funk comin’ off his ass, this nigga foul Mr. Pierce. MR. PIERCE  Terrell.  TERRELL I’m sorry man, I’m sorry, no disrespect Mr. Pierce, I’m just sayin’. Chiron gripping both edges of his desk, eyes locked there. TERRELL And check it: without the white blood cells, body can’t defend itself. That’s why all them gay niggas croakin’ off that AIDS shit, ain’t that right Little? Off Chiron, still staring at that desk. EXT. LIBERTY SQUARE HOUSING PROJECT - DAY - MOVING 49   49  Moving   with Chiron as he makes his way down this street, alon",
      "dialogue_count": 0,
      "word_count": 1005
    },
    {
      "scene_number": 6,
      "slugline": "INT/EXT. METRO-RAIL - NIGHT - MOVING 50   50  Chiron asleep on Miami’s much-neglected elevated train, head leaned against its faded cloth seats as it snakes its way above and through the hardened Liberty City. From the looks of him, he’s been here awhile. From the feel of him, resting wearily if peacefully, he may have slept through several loops of this train, back and forth from the blight of the hood to the glitz of Coral Gables and back again. His head resting on the window, the lights of the train low. We hear the train wheels moving, the lights of the train flickering off and on... of and on, and... finally off. EXT. COLLINS AVE - NIGHT - ESTABLISHING 50A   50A  From very high up, as though viewed from the roof of a condo. And   establishing   that a Metrobus is pulling away from here, having delivered Chiron to... EXT. SOUTH BEACH, 27TH AND COLLINS - NIGHT 51   51  Chiron moving down a dimly lit side-street, Collins receding behind him, the beach growing louder ahead of him. We follow him, moving along behind him as the sound around him shifts, from the noise and chatter of care-free exhibitionism out on Collins... to the whispered loop of the ocean ahead. As he nears the promenade separating the beach from Collins Ave and it’s endless resorts... ...he stops, takes a moment to look back. At what, we’re not sure but, after a beat, he continues on, moves away from us and down into the darkness of the beach. EXT. MIAMI BEACH, SHORE - NIGHT 52   52  Chiron sitting on the shore watching the moon and the stars over the ocean. The sky is clear and yet it’s wild out, the wind whipping the reeds, ocean running waves upon the shore with verve. Tonight, the sea seems immense, moon glowing blue, leaving the ocean a deep black that renders it boundless, entropic. Chiron lost in it all, releasing his troubles in the presence of this nature when... 48.",
      "characters": [],
      "action_text": "VOICE (O.S.) You was waitin’ for me? Chiron turning, looks up into that voice, backlit by the bright beacon of a spotlight mounted on the promenade behind, unrecognizable at first, ethereal. A shift in the light:   of course   it’s Kevin. CHIRON Huh. KEVIN Nice to see you too. Kevin smiles. KEVIN What the hell you doing out here? CHIRON What   you   doing out here? KEVIN You in my smoke out habitat, nigga. A beat as something dawns on Kevin: KEVIN Oh shit, you come out here to smoke too, Chiron? CHIRON Something like that... Kevin taking a seat on the sand beside him now, still smiling that incredible smile. KEVIN Man you know you don’t smoke. Why you pretendin’? You puttin’ on a show for me, Black? CHIRON Why you keep calling me that? A puzzled look from Kevin at first, then pulls a blunt from his pocket. KEVIN  Black?   That’s my nickname for you. You don’t like it? 49. A shrug from Chiron as a huge wave hits the shore, demanding their attention as it runs toward them, stops short a few feet. Keeps their attention a moment: sound of the Ocean, sound of the wind running through the reeds, the night... Kevin sparks flame to that blunt: KEVIN You like the water? Chiron says nothing. KEVIN Well let me introduce you to some  fiyah . Extends the blunt to Chiron: KEVIN Come on now. Ain’t gon’ bite ya’. As Chiron takes the blunt, drags on it with Kevin watching... CUT TO: EXT. MIAMI BEACH, SHORE - NIGHT - LATER 53   53  Chiron and Kevin laughing their asses off, both high as hell, a joke or memory lost in the cut. Whatever it was, extremely funny, so funny that as the two stop laughing those gleeful smiles remain, the two of them looking alternately from each other to the ocean and back, allowing themselves this bit of shared pleasure. KEVIN That breeze feel good as hell man. CHIRON Yeah it do. KEVIN Sometimes round the way, where we live, you can catch this same breeze. It come through the hood and it’s like everything stop for a second ‘cause everybody just wanna feel i",
      "dialogue_count": 0,
      "word_count": 2442
    },
    {
      "scene_number": 7,
      "slugline": "INT. HIGH SCHOOL, PRINCIPLE’S OFFICE - DAY 60A   60A  Chiron sitting opposite PRINCIPAL WILLIAMS, 40s, serious but kind. Williams just eyes Chiron up, can since the anger simmering beneath the surface. Chiron stares at his feet, refuses to meet that gaze: PRINCIPAL WILLIAMS Chiron? Nothing. PRINCIPAL WILLIAMS Chiron, listen: you’re not in trouble. You’re not being punished, okay? You did nothing wrong, we know that, okay? Still nothing, Chiron has completely shut down. PRINCIPAL WILLIAMS Look, if you don’t tell us who did this we can’t press charges, understand? (and) All them damn kids standing around, all of y’all out there and don’t nobody got the heart to say who did it? That getting Chiron’s attention, head snapping to meet Williams’ gaze: CHIRON You don’t even know. WILLIAMS Oh I   don’t?   You think all this just started, boy? CHIRON I ain’t no boy. WILLIAMS Hell you ain’t: if you was a man it’d be four other knuckleheads sittin’ right there with you. Chiron looking away again out a window there, done with this: 60.",
      "characters": [],
      "action_text": "CHIRON (low, breaking)  You don’t even know.  Williams taking him in again now, looking further, looking better, sees things in Chiron he’d not seen before;   sees   him: WILLIAMS Look son, I’m not blaming you, I’m not. I know it’s hard, believe me, I’m not tryna disrespect your struggle. I just need you to know, if you need some help, if you need somebody to talk to... that door right there, it’s always open, you feel me? And as soon as you walk through it, let me tell you -- everything you going through, all of it’s gonna get better. Ignoring that, still set on that window. WILLIAMS You feel me? Off Chiron meeting Williams’ gaze, CUT TO... INT. PAULA’S LIBERTY SQUARE APT, BATHROOM - NIGHT 61   61  Chiron taking in his own image in the bathroom mirror, left side of his face bruised and swollen, that cut at his right ear clotted with blood. He runs water into the basin and, looking down into it, we notice that it’s already filled with something, a pool of ice. Chiron lowering his face to the water, submerging his head in it for the longest moment, long enough to make the silence uncomfortable, then... INT. PAULA’S LIBERTY SQUARE APT, KITCHEN - NIGHT - LATER 62   62  Paula sitting at the kitchen table, a dying cigarette in an ash tray there. She looks beyond exhausted. And fried. Chiron appearing with glasses of water, sits one in front of each of them. We leave them this way: neither drinking those waters, neither speaking, then... OMITTED 63   63  61.",
      "dialogue_count": 0,
      "word_count": 438
    },
    {
      "scene_number": 8,
      "slugline": "INT. HIGH SCHOOL - DAY - MOVING 64   64  Chiron passing the Old Security Guard, entering the building. We continue with him, up a flight of steps, into the cavernous tunnel of the school entrance. All eyes looking in at Chiron, in at us. And the SOUND, so many shifting ticks and voices, whispers accompanying those looks, adolescent energy unhinging itself. Chiron entering a stairwell, rising, pushing past other kids towards the second story of this building. Reaches it, steps onto the landing and slips into one of the interior passageways, the sound of those voices and whispers amplified, echoed and refracted off the metal lockers and industrial design. But Chiron’s face? Unchanged, still that blankness, that pensiveness. With him all the way as we lead/follow him around a turn, toward a door and into... OMITTED 65   65  OMITTED 65A   65A  INT. HIGH SCHOOL, CLASSROOM - DAY - CONTINUOUS 65B   65B  Chiron entering, moving directly to his seat, a wooden chair there. Sets his bookbag atop his desk, takes the chair, slides it from the desk and... ...brings it down atop Terrell’s head.  CRACK!  Terrell spilling to the floor; no blood, no movement, a total collapse to the spot where he sat. Beat. Everyone in the class in shock, nobody moving, all eyes on Terrell. He’s not moving, not breathing, body prone on the floor. A beat, then... ...he spasms back to consciousness, a quick convulsing and then a reach for his head. Chiron raising that chair, brings it down on Terrell again, the boy jolting with the impact. 62.",
      "characters": [],
      "action_text": "Pierce sets upon Chiron. A few others help restrain him. INT/EXT. HIGH SCHOOL - DAY 66   66  Police lights flash on the school’s walls. Kids all stand outside as well as teachers. Chiron is brought out of the school in handcuffs, lead by two officers, staring and muckraking from the gathering as he passes. Gets down to the street, is ushered into a police car. As he stares out from the backseat, a face at the top of the steps stares back: Kevin. CUT TO BLACK. 63. First, OVER BLACK, a beat of SILENCE and, immediately after, a gasp for air, then... FADE IN: ...on a grown man covered in sweat. INT. BLACK’S APT, BEDROOM - NIGHT 67   67  BLACK (the same Little/Chiron character but late 20s now), sitting upright. Eyes open, staring off into the light spilling through the window-pane above this bed. INT. BLACK’S APT, KITCHEN - NIGHT 68   68  Black standing at the kitchen sink. The faucet running in the sink before him and, looking down into it, full of ice cubes, plastic trays from a freezer somewhere nearby. Takes a towel, dips it into the water, wrings it slightly. Brings it to his face, covers his eyes, his forehead gently with it. Dips it into the basin again, wipes across his chest. Slowly, he lowers his torso to the sink, submerges his face completely. INT/EXT. CHEVY IMPALA - DAY - MOVING 69   69  Hot today;   hot as hell out today   as Black sweats through baggy jeans and over-sized white tee. What’s more, unlike the pensive Black glimpsed recovering from a fevered dream, this one menaces through a full array of gold-fronted teeth. They’re impossible to miss as the city passes by outside his window, cruising through the Flats. As the car continues along, we go CLOSE ON: Black’s license plate. The vanity spelling BLACK is interesting, but that it’s issued in the state of Georgia is more important. INT. ATLANTA AGAPE REHAB CENTER - DAY 70   70  Black sitting in the reception area of this Rehab Clinic. He doesn’t look lost here and yet... he doesn’t look comfortable, d",
      "dialogue_count": 0,
      "word_count": 5031
    },
    {
      "scene_number": 9,
      "slugline": "INT. JIMMY'S EASTSIDE DINER, BOOTH - NIGHT - LATER 93   93  Later   by the look of Black’s plate, completely empty. Black takes up his water glass of wine, a second bottle open there beside the first -- they’ve been thirsty. Kevin appears, settles in again. KEVIN You remember Samantha? BLACK (nodding) Yeah, I remember her. Kevin reaching into his wallet, takes out a photo, places it on the counter: KEVIN Kevin Jr. Me and Samantha. Had him young;   too  young. Kevin watching as Black takes up the photo, brings it close, examines it. KEVIN When I got locked up, man. It was hard.   Real   hard. Had me in state, not that county shit. That’s when I knew I had to find somethin’. That’s when I started the cookin’ thing, knew I couldn’t go back to the street, not after that. BLACK Y’all still down? KEVIN Me and Sam? (beat) Nah. We still cool though, gotta be for Lil’ man, but... nah, not like that. Beat. KEVIN What about you? BLACK What   about   me? 85.",
      "characters": [],
      "action_text": "KEVIN Nigga tell me somethin’, what you doin’,   who   you doin’? Black going sheepish at that last part. KEVIN C’mon nigga, I’m waitin’, done cooked for your ass and everything, shit, these grandma rules you know the drill, you gon’ eat, you gotta speak. Black thinking on this, weighing something. Takes another sip of his wine, then... BLACK Alright, straight up? I’m trappin’. KEVIN (serious)  What ? Black just nodding. BLACK When they sent me up to Atlanta, put me straight into Juvie for beatin’ old boy. Met this cat in there, when I come out, put me on the block. Did good at it. Rose up. Black shrugging his shoulders, no explanation, no excuses. BLACK It is what it is. KEVIN Bullshit, it ain’t what it is, Chiron, that ain’t you. BLACK Nigga you don’t know me. KEVIN Oh I   don’t ? Beat. BLACK I’ma get my shit straight. Kevin shooting Black a look: 86. KEVIN And I guess gettin’ your shit straight is drivin’ twelve hours down here for no reason? Kevin looks over his shoulder -- the young couple is up at register, waiting. Black watching as Kevin heads over, begins ringing their till. It’s a small moment, cordial -- Kevin smiling, making small talk with the husband and wife. He’s good at this. The sound of that familiar door jingle on their exit, Kevin beginning back now, stops to buss the couple’s table -- arms loaded with plates and silverware as he passes... KEVIN (moving) And why you got them damn fronts? ...doesn’t bother for a reply, just keeps moving into the kitchen. Beat. Black alone again for the moment. It’s dead in here -- no couples, no groups of girls. Kevin is nowhere to be found, there’s nothing between Black and the door.  The door.  Black watching the door as... Kevin reappears, wiping soap foam from his forearms, heading back over. Takes his seat again across this modest booth. Kevin’s thoughts going back to this conversation, the two of them separated by this table; by   only   this table. It’s as though they can sense this, both mulling their tho",
      "dialogue_count": 0,
      "word_count": 2843
    }
  ]
}