{
  "slug": "motherless-brooklyn-2019",
  "title": "motherless brooklyn",
  "genre": "action",
  "format": "film",
  "scenes_count": 10,
  "characters_count": 0,
  "characters": [],
  "total_words": 28616,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. TRIBOROUGH BRIDGE TOLL BOOTHS - CONTINUOUS ...cars backed up in   three open lanes and they roll to a stop. Lionel again rips open his door as they stop, standing up next to the car in time to see...two lanes over to the right, THE BLACK CAR   BREAKS RIGHT OUT OF THE LANES and heads for an empty lane marked ‘AUTHORIZED VEHICLES ONLY’, as a TOLL OFFICER STEPS INTO THAT BOOTH. The driver of the BLACK CAR flashes something at the guard and THE CAR IS WAVED   THROUGH. LIONEL Son of a bitch! He goes back inside but they’re boxed in and being channeled into a booth. LIONEL hits CONEY in the arm. LIONEL (cont’d) (CONT’D)  QUACKER! QUOTER! QUARTER!  CONEY What?! LIONEL We need a quarter! Get a fuckin’ quarter out! They scramble for the toll. Coney finds one and practically throws it at the guy, barreling through the booth. EXT. TRIBOROUGH BRIDGE / INT. LIONEL’S CAR - DAY AERIAL VIEW: Their car blasts around slower moving cars on the bridge, revealing THE EAST RIVER AND THE NEW YORK SKYLINE with the late afternoon sun in our eyes. LIONEL’S EYES:   Frantically searching, desperate... Lionel is tapping Coney’s shoulder manically. LIONEL Don’t lose em! Jesus, Coney, come on! CONEY What can I do?! Guy had a fucking pass! POV: the BLACK CAR far ahead now, exiting onto an off-ramp.  Pink Revisions   17.",
      "characters": [],
      "action_text": "HORNS GOING OFF EVERYWHERE as they weave and force their way through cars, putting Lionel’s TICS AND SHOUTS into overdrive. LIONEL  HORNY HORN! HONK ME, BAILEY!  EXT. INDUSTRIAL STREETS - QUEENS - LATE AFTERNOON Bridge looming above, the car barrels straight at us down   a side street LIONEL’S EYES FIND -- TIRE MARKS, turning LEFT. LIONEL There, go left!   LEFTY LOOSY LIONEL!  THE CAR rips a left turn onto wider industrial avenue. The streets are pretty desolate over here...a lot of warehouses THEIR CAR MOVES DOWN THE STREET, LIONEL LOOKING RIGHT, CONEY LEFT... CONEY They gotta   be somewhere. LIONEL I’d say they’re   somewhere , Gil, yes! Where? POV: Industrial warehouses, side-streets   WHIPPING BY ...and as they cross   one, all in a flash, LIONEL SEES -- EXT. INDUSTRIAL STREETS / INT CAR - QUEENS LIONEL POV: FRANK. RUNNING TOWARD THEM...hand outstretched... BEHIND HIM -- THE GIANT, out of the car, AIMING A GUN-- THEY WHIP PAST this view and hear: BANG! BANG! Gunshots LIONEL GO BACK!! CONEY JAMS ON THE BRAKES. REVERSES, GRINDS GEARS... The street comes back into view... As they turn into it they see...  Pink Revisions   18. THE GIANT, striding toward a pile of trash, raising a .45 in his GLOVED HAND, pointing down. He looks up as CONEY squeals to a stop 20   yards away. LIONEL jerks open the door and shouts... THE GIANT whips the gun up and pops off a SHOT and LIONEL DUCKS AS IT THUNKS INTO THE EDGE OF HIS DOOR. ANGLE ON: TWO WORKERS poking their heads around the corner and seeing what’s going on. One bolts LOU (seeing this - to GIANT) C’MON!! The GIANT DROPS THE GUN ON THE STREET, jumps into the BLACK CAR, tires squealing   as it races off and disappears around a   corner... LIONEL pops up and scans the alley... POV: A PILE OF TRASH   with a LEG sticking out LIONEL FRANK! He dashes around the   nose of the car and over to find... MINNA: SHOT THROUGH THE BACK AND THE GUT, BLEEDING ON THE GROUND, FACE ASHEN, HAT FALLEN OFF... LIONEL (cont’d) (CONT’D) Jesus, Frank.",
      "dialogue_count": 0,
      "word_count": 2817
    },
    {
      "scene_number": 2,
      "slugline": "INT. LIONEL’S BUILDING - STAIRWELL - NIGHT Lionel mounts the stairs, tired, and turns on the landing. He stops and sits down, almost out of sight behind the bannister but we can   see him put his head down and weep. INT. LIONEL'S APARTMENT - NIGHT Lionel enters takes off his coat and hat. He hangs Minna’s hat up next to his on the wall... His weeping has turned into twitches and small shouts that seem to be building... A   MIRROR reflects his bed. In it we see him sit only partly visible on the edge of the bed, get something out of a drawer (a small pipe) and then a match flares and we see him inhaling something. He sets it down and takes a photo off the side table PHOTO: Much younger and cooler looking Frank Minna with his arm around a young Lionel, skinny...both smiling. ON LIONEL: eyes glazing, he smiles a little and lets himself fall back onto the bed... INT. LIONEL’S DREAM/SWIMMING POOL As he hits the sheets they ripple TURNING INTO AMBER COLORED WATER. Lionel sinks slowly, happily, eyes open We see him sinking fully clothed in a limitless pool of water with amber light dancing around him and as he sinks... ...a SHADOWY FIGURE swims past on the surface above him. CLOSE ON LIONEL’S EYES: disturbed LIONEL’S POV:   from down below looking up through the water, dancing with amber light, A MAN SWIMS HARD ON THE SURFACE, PASSING OVER HIM. INT. INDOOR POOL - EARLY MORNING A   HUGE PUBLIC INDOOR   POOL of the kind they don’t build anymore.   Stained glass, beautiful tile, etc. It’s early morning, dawn light cracking in, and the steam and the light dance on the water. A LONE FIGURE swims powerful laps. Back and forth without pause. A YOUNG AIDE in a suit sits on a bench in the shadows with a valise full of papers in his lap   waiting.  Pink Revisions   32.",
      "characters": [],
      "action_text": "Finally the swimmer climbs straight up out of the water, his back to us. He’s   powerfully built. A BLACK POOL ATTENDANT emerges out of the shadows to put a robe around him and the YOUNG AIDE in the suit hurries to catch up as THE MAN exits. EXT. PUBLIC ATHLETIC   CLUB - MORNING A   SMALL FLAG with an   unfamiliar insignia decorates one corner of a BIG BLACK CAR’s hood. THE LICENSE PLATE reads “BA 1”. WIDE: by the doors of the MEN’s side of the public bathhouse. About a dozen people wait in the cold and spitting RAIN to be let in to swim.   The doors burst open and an umbrella is thrown up by the DRIVER for THE MAN, shielding his face from view as he descends the stairs. MAN (MOSES RANDOLPH) Let em in, Charlie. With his entourage, he heads down the steps to the car in the pre-dawn grey.   His aide takes the umbrella and hands over the valise as the MAN climbs in and the car pulls away, leaving him standing in the rain. INT. CITY HALL ROTUNDA - MORNING Huge marble rotunda,   set up for A SEATED CROWD. A   VOICE BOOMS OVER A   MIC. THE END OF A SPEECH VOICE (MAYOR) ...limited only by our own vision, our own audacity, we will build the legacy of our time. A legacy for future generations to look upon and say “Here was Boldness. Here is the greatest of what Man can create.” Newly elected, this is the end of THE NEW MAYOR’S inaugural address.   The crowd APPLAUDS. OVER THE SHOULDER of   someone standing off to the side, by   a column. It’s THE MAN FROM THE POOL, but we still can’t see his face as he stares at the ceiling, impatient.   A glimpse of a strong jaw, as others applaud he looks at his watch.  Pink Revisions   33. INT. GRAND MARBLE HALL - ROTUNDA - A MOMENT LATER MAYOR ON THE DAIS, swearing in his Appointees handing the rolled appointment papers and shaking hands, watched by... THREE REFORM ADVOCATES (Two men and a woman (GABBY HOROWITZ), among the   seated guests. One nudges the others as THE MAYOR gets handed the rolled appointment forms for the next appointee.",
      "dialogue_count": 0,
      "word_count": 3424
    },
    {
      "scene_number": 3,
      "slugline": "INT. KING ROOSTER JAZZ CLUB - DAY A   small dark Harlem joint. Bar, tables and a little space for the band in a paneled corner that’s hardly even a stage. Black bartender setting up. THREE BLACK GUYS at a back table talking low. One with his back to the bar. LIONEL enters and quick looks check him out. One guy, 50’s very dark black skin, looks at Lionel in the mirror long and hard, watchful. BARTENDER We ain’t open yet. LIONEL Can I get an early one? I’m freezing here.   Whiskey neat. He slaps a bill up.   The bartender’ll take that. LIONEL (cont’d) (CONT’D) (fishing) Say, you the manager? BARTENDER I look like the manager? LIONEL Who’s playing tonight? BARTENDER (at the THREE GUYS) Hey, Billy... The DARK-SKINNED GUY   with his back to the bar looks over. Lionel meets eyes with him in the mirror behind the bar. BARTENDER (cont’d) (CONT’D) Who’s on tonight? BILLY Mr Big Shot. His eyes locked on Lionel, he puts a cigarette in his mouth with his left hand and then using the same hand to snap open a lighter and light it...highlighting that his RIGHT ARM HANGS LIMP AND USELESS. Lionel still staring. Does he know that face? BARTENDER I hope they don’t think they drinking free.  (MORE)  Pink Revisions   48.",
      "characters": [],
      "action_text": "(to Lionel re poster) You caught   this cat? I seen cool. This brother rewriting cool. He tries to make it seem like a sneeze. He’s getting excited and that winds up his tics. He’s got to get out. LIONEL (cont’d) Catch him another time.   If!  BARTENDER Don’t wait   long. Them French girls keep loving him up he’s gonna move over there   for good, you know what I’m saying?  LIONEL  French Kissing Cats!   Thanks pal.  Lionel’s out the door and we CUT TO: INT. LIONEL’S APARTMENT - NIGHT A   RECORD SPINNING, a   standard playing, sad but soothing. Camera pans over to find LIONEL in a chair by the radiator with a joint. His head is moving as though he can’t get a kink out of his neck. Or can’t shake his brain.  LIONEL (V.O.)  On my average day the weed will handle my twitching and shouting but it makes my thinking fuzzy.  A   CAT, comes over and climbs up in his lap. He pets her and this contact seems to calm him as he looks out the window at the lights on the   street.  LIONEL (V.O.)  In my dreams I’m calm and clear like I was when I was a kid. Even after my head started messing with me, my mother could settle it down. She’d sing soft songs and stroke the back of my neck and it would leave me for a while. We’d lie on the bed and talk about all of the places we were gonna go.  The sad trumpet carries us over into....  BARTENDER (CONT'D)  Pink Revisions   49.",
      "dialogue_count": 0,
      "word_count": 479
    },
    {
      "scene_number": 4,
      "slugline": "EXT. BROOKLYN STREET   - MORNING It’s cold and clear.   Lionel’s got a coffee. People are hustling for the subway. Lionel comes past a telephone pole close to camera, flicks his eyes at the flyers on it and EXITS... PIECES OF PAPER posted to the pole rustle in the cold... ...and Lionel comes back into frame, looking closer at one of the flyers, reading: SAVE OUR NEIGHBORHOODS! SAVE FT. GREENE! COME TO A PUBLIC HEARING ON PROPOSED HAMILTON HOUSING PLAN Sponsored by: Committee against Racial Discrimination in Housing  HAMILTON. COMMITTEE .   Lionel takes it down and continues on to: INT. L&L OFFICE/ EXT. COFFEE SHOP PAYPHONE - MORNING Lionel enters Danny’s reading the paper. Tony’s on the phone, pissed... TONY Well, Christ, Coney, did you get the shot or not?...doing what?...Getting the paper ain’t worth shit! The fuck does that have to do   with his back?... Bending over, my ass, we gotta have him lifting the lawnmower out the car or   playing tennis or spinning around the room with some broad sittin’ up on his tentpole and his arms out wide. I don’t care so long as it involves his back!...I know he’s fakin’ all the time, that’s why he’s won three claims! Wait him out or set him up!... I know it’s cold, that’s why they call it winter! He hangs up.   Sees Lionel looking at him. That was his case. TONY (cont’d) (CONT’D) I’m giving   him the rest of the week.  Pink Revisions   50.",
      "characters": [],
      "action_text": "DANNY (not looking up) If the guy lifted a cow into a truck, Coney’d still miss the shot. He still can’t remember to wind the film. Thinks it’s a Tommy- gun. I tell him ‘click-advance- click-advance”... TONY Can it.   I’m giving it a week. Lionel goes to hang up his coat. Phone rings. Tony grabs it... TONY (cont’d) (CONT’D) Gimme a break, will ya Gil-- wha? Excuse me, yeah, L&L... LIONEL (to Danny) We got pickups? DANNY Nobody ever needs a ride on Tuesday, you notice that? Never. Why is that? TONY ...speaking... (beat - his eyes flick to the guys) Yeah fine... (writing) ...yeah I got it. He hangs up and puts   the number in his pocket. DANNY Job? TONY Nah. For me. DANNY Don’t go getting mysterious on us, T. You ain’t no Minna. TONY Yet! I gotta get a prescription for my mother, clambrain. You need all the details? I’m going for coffee, you want?  Pink Revisions   51. DANNY Cream and sugar. Tony makes a pansy flick with his wrist, throws on his scarf and hustles out. LIONEL Hey, D... You up for something? DANNY Like what? LIONEL Sit on a joint for me. DANNY For you? Lionel tosses him the matchbook. LIONEL Club up in Harlem. I think Frank was there that day or the day before...it was in his pants, almost full.   Fullsie Pants!  DANNY (skeptical) Maybe he stopped in for a book of matches. LIONEL glances out the window as they talk and sees... TONY, across the street outside the coffee shop stopping at the payphone. LIONEL In the room he was talking about a girl, a colored chick. Something she knew had em pretty unhappy, wondering who else knew. Frank said her father is a busted up vet who runs a club...this joint is three blocks from that meet. DANNY You went there? LIONEL (nods) Manager is a guy named Billy with a bum arm. LIONEL POV:   Tony pulls the number he wrote down and dials.  Pink Revisions   52. DANNY So what am I supposed to do? LIONEL Get in there see if you can get her name out of him. Do your liquor board bit.   Lick Broader!  DANNY (laughs at that one) Y",
      "dialogue_count": 0,
      "word_count": 1355
    },
    {
      "scene_number": 5,
      "slugline": "INT. L & L OFFICE - DARKROOM - NIGHT WHITE PAPER, SWISHING IN LIQUID A   picture emerges...   the girl named LAURA. Very beautiful. Lionel pulls it out of the tray and stares at it, then lets it dry with the others already printed. TONY (O.S.) Holy shit, what happened?! Lionel rushes out into... INT. L & L OFFICE - NIGHT DANNY stands slumped   against the door frame with TONY rushing to support him. DANNY HAS BEEN BEATEN UP.   He is very shaken, out of breath. Tony moves Danny to a chair and loosens his tie. Danny motions that he needs a drink and CONEY quickly pours him a shot from a bottle in a desk. Danny downs it with a shaky hand. CONEY Who was it, D? DANNY Couple of em. One was a giant. TONY A what? DANNY A fuckin’ giant, I’m telling you. Biggest guy I ever saw. Coney and Lionel look at each other, knowing. DANNY (cont’d) (CONT’D) Worked me over good. Smashed up the camera. LIONEL They say anything?  Pink Revisions   57.",
      "characters": [],
      "action_text": "DANNY Yeah, “Stay outta Minna’s garbage. Tell your crew the same.” Had a big nasty knife on my throat for that part. That sits like a bomb for a second.   Tony’s jaw tenses. CONEY Son of a... Danny reaches into his pocket... DANNY (to LIONEL) Didn’t get this though...assholes. Tosses Lionel a ROLL   OF FILM. TONY ...the fuck is that? What are you two into? Danny looks at Lionel...and we CUT TO: INT. L & L OFFICE - HALF HOUR LATER Danny is cleaned up a little, butterfly bandage over his swelling shiner, holding ice to his lip. The RED LIGHT of the   dark room goes out. Lionel emerges with some still wet photos: Danny’s roll... He hustles to Danny takes three of his own photos, one of each of the young black women, and lays them out on a desk to compare with Danny’s. Danny looks over his   shoulder, can’t help being curious. Lionel starts to flip through them.... DANNY’S PHOTOS: -   The outside of the   King Rooster club -   The guy, BILLY, emerging from the club -   A man in a hat, face unseen, asking Billy for a light -   Over the man’s shoulder on Billy looking away DANNY Forget all that, she didn’t show up until later...tail end of the roll.  Pink Revisions   58. He grabs a few photos off the stack and moves them to the back... -   A black woman entering the club but too much from the back Danny flips that one   back... DANNY (cont’d) (CONT’D) Here...they came out together. -   BILLY and the girl   named LAURA from the office talking -   LAURA kissing BILLY on the cheek as they part LIONEL compares these to his own and quickly finds the match. LIONEL  Match me, Bailey!   That’s it. She’s the one. Her name was Laura. DANNY Laura Rose   then maybe. That’s Billy Rose. If he’s her father... CONEY How the hell you know that? LIONEL (ignores him) You tailed   her? DANNY Didn’t have to...she lives right next to the club on the corner. They musta   made me earlier. Soon as I got out the car to follow her they were on me... He stops. It really shook him up. Lionel is excit",
      "dialogue_count": 0,
      "word_count": 988
    },
    {
      "scene_number": 6,
      "slugline": "EXT. SUBWAY ENTRANCE   - MORNING Laura heads down the   steps...Lionel follows. INT. SUBWAY CAR - MORNING Laura boards the train and moves toward an empty seat only to have a WHITE GUY move his bag onto the seat and stare at her as the train begins to move.   She stares at the man with no expression and he back at her, daring her.   She turns her back to him leans against a pole, facing directly at LIONEL, which makes him feel a tic coming that he comically struggles to suppress. She takes a book from her bag, some sort of textbook and begins to read, studying and with this he turns away to release a tic and shout. A WOMAN WITH A SMALL GIRL reacts to this and moves the child away from him. This makes Laura look up over her book for a moment, just as he turns back around and they meet each others gaze for just a second. She is composed and lovely. EXT. FORT GREENE ROW-HOUSE STREET - DAY Laura walks down a block with Lionel tailing behind. The neighborhood is edgy, run down, with many boarded up row houses, uncollected trash and abandoned furnishings. LAURA goes up a stoop and rings a bell. A BLACK LADY answers, wary.   Laura talks for a moment and removes some papers from her bag,   handing them to the woman.   The woman glances at them, nods and closes the door. ANOTHER DOOR. She buzzes. A   FACE IN THE SECOND   FLOOR WINDOW... a wave. ANOTHER BLACK LADY smiles and hands Laura a sheaf of the same forms and they talk. Lionel can see that the woman is indignant and that Laura is TAKING NOTES. ANOTHER DOOR...this building so bombed out it looks abandoned but AN OLD   BLACK MAN WRAPPED IN A BLANKET OPENS and this time Laura goes inside. Lionel glimpses her in the window of the first floor. LIONEL turns around for a closer look at a row-house behind him, its front door and second story windows boarded up. He looks up AT THE FRONT DOOR  Pink Revisions   62.",
      "characters": [],
      "action_text": "A   SIGN:   CONDEMNED :   PROPERTY OF: BELMONT DEVELOPERS ... A   SOUND SURPRISES HIM and he jumps.   To his surprise a WOMAN WITH TWO KIDS COME OUT from the garden level door under the stoop. He thought it was abandoned but clearly there are people squatting here. The WOMAN eyes him fearfully and hustles her kids away. EXT. INWOOD RESIDENTIAL SERVICES - DAY TIGHT ON: A PUDDLE OF WATER. Stark trees, fire escapes & sky reflected in it as LAURA steps across it, rippling the surface and we tilt up to find LIONEL tailing her. He watches as she heads for a nondescript storefront/office:   Inwood Residential Services . She goes   to the door and tries it but it’s locked. She turns and faces the street, clearly exasperated as a CAR pulls up and GABBY gets out of the driver side.   She and Laura confer and Laura moves to get in the car. LIONEL spots a cab and hails it but hustles over to the storefront for a quick look at the sign on the door: “INWOOD: Your Happy Home is Our Business!”.   HOURS: 9-5 Lionel looks at his watch: 3:21   Should be open. But he hustles to his cab. INT.   CAB / EXT. ROADSIDE/OVERPASS - LATE AFTERNOON The cab pulls over on the shoulder, a distance from the other car which is pulled up under an overpass, with hazard lights on. Lionel’s POV:   the women getting out. LIONEL Get out and pop your hood and check the oil. CABBIE Buddy, come on... LIONEL Keep the meter going. He lifts his binoculars as the cabbie grudgingly complies. Lionel’s POV:   Gabby   shading her eyes, looking up at...  Pink Revisions   63. LAURA, who has climbed up the slope to the overpass above and is lowering a tape measure. We PAN DOWN with the   tape measure to Gabby, who records the height of the overpass. ON LIONEL: no idea what they’re doing.   SMASH CUT TO: INT. TOWN HALL BUILDING - CONTINUOUS FACES IN A BUZZING SEATED CROWD as we tilt up to see GABBY &   LAURA, hustling down the center aisle of a packed auditorium to where their staff members hold seats near a standing mic",
      "dialogue_count": 0,
      "word_count": 4327
    },
    {
      "scene_number": 7,
      "slugline": "INT. DILAPIDATED BROWNSTONE - BATHROOM - DAY Lionel pokes into a bathroom and clicks the light on...it still works, dimly sputtering. Nice tiles broken to get at pipes, sink fixtures   gone. He looks at himself in the mirror, watching impassively as his own head TWITCHES and SPASMS mildly. LIONEL (to himself) Keep it together, freakshow. He reaches for the vanity mirror and opens it to see what’s inside only to find... POV:   he’s looking clear into the next room. The wall behind the mirror has been opened and pipes stripped out. Then... A   BLACK GUY STEPS INTO THE FRAME OUT OF NOWHERE, looking at Lionel who jolts and   with a yelp steps back into... The ANGRY GUY LAURA was with, now blocking the door. ANGRY GUY Looking for somethin’? LIONEL Scared the hell... HELP, BAILEY!  They look round for who he’s calling out to... ANGRY GUY You think you can just walk into people’s homes? LIONEL Looking for a friend. Didn’t look like anyone lived down here... ANGRY GUY Oh, someone live here. My momma live here. Least she tryin’ to. Who you with? I hope you with Belmont. Sounds like an angle, so Lionel nods. LIONEL Yeah...course. Belmont. Who else, right?  Pink Revisions   80.",
      "characters": [],
      "action_text": "He looks back to the   other guy...and the FIST IS ALREADY CRASHING INTO HIS FACE BLACK OUT. INT. DILAPIDATED BROWNSTONE - PARLOR ROOM Muted sounds of argument and feet. The sharp sound of heels. FADE UP SLOWLY... WOOZY POV:   Faces out of focus. LAURA How hard did you hit him? ANGRY GUY I barely tapped him. Fool slipped and hit his own head! Lionel sits up a little and focuses, his nose slightly bloody LIONEL  IF!!  LAURA ‘If’ what?   I’ll tell you what ‘if’, you better explain who you are   if   you   want to walk out of-- (pauses) Have I seen you before? LIONEL (nods - seizing the angle) My name’s Jake Gleason. I’m a reporter. I saw you at the Hamilton housing hearing. I called the committee. Came out here looking for you. She glares at the YOUNG MAN. He looks chagrined. ANGRY GUY He the one   said he’s with them racketeering sons a bitches! They stole   her damn fridge   and   her copper pipe! What you expect?!  Pink Revisions   81.",
      "dialogue_count": 0,
      "word_count": 377
    },
    {
      "scene_number": 8,
      "slugline": "EXT. FORT GREENE STREET/INT. MYSTERY CAR - LATER Lionel has tissue up   his nose as they walk. LAURA First they put up a notice says the house will be condemned. It’s not true but that scares out about half and they sell for cheap. Then they come in and take the nice old family homes and chop em into 4 and rent em up. Folks who don’t leave they harass... turn the heat off, come in to do repairs and steal copper pipe instead.   They re-possessed all the refrigerators, even if people bought them themselves, then resold them out of shopfronts next neighborhood over. City sold em property worth $15 million for $500,000 to take the ‘risk’ of having to build the Federal projects.   They haven’t even submitted plans...just milked it until it really is a slum. LIONEL  Slammer for Slum Lords, Bailey!  LAURA (bristling) Oh what, you another one that thinks we’re just ‘agitating’... making it up like some Negro propaganda conspiracy... LIONEL (stopping her) No, no. Look I got a condition, I say funny things sometimes but I’m not trying to be funny, okay? I’m listening. Where’s everybody go? LAURA Mostly just disappear. Fade away. Go into real slums or other neighborhoods. Some are renting a room in a house they used to own. 200,000 in 2 years just from this part of Brooklyn. Mostly Negro. Latino.  Pink Revisions   82.",
      "characters": [],
      "action_text": "LIONEL But Horowitz said they did it in Tremont too. LAURA Yeah they did it to a few Jews too but not systematic like this. You know how many parks have been built in this city since he’s been Commissioner?   255.   How many of those in Harlem you think?   1. You build a new beach for the ‘people’, but the ones with no cars, the poor ones, the black and brown ones?...how are they going get to the parks and beaches? Public bus.   Guess how high they just built the overpasses on the new parkway? One foot too low for a bus to clear.  Lionel gives an incredulous look... LAURA (CONT’D)  Look forget whether it’s discrimination...the Federal government and the City are being scammed! There’s supposed to be relocation services, company’s got a $2 million dollar contract to handle it but nobody even answers the phone. Call the city, they say these folks are on the list for the new public housing. But then it never gets built. They have come to Lionel’s car.   He stops. LIONEL You know more’n any secretary I ever met. LAURA (indignant) Secretary? Who told you that? I’ve got a law degree you know? I’ll pass the Bar first time I sit too. He’s staring at her now...she’s beautiful to him. She catches it and blushes...then sharpens her look, suspicious.  Pink Revisions   83. LAURA (cont’d) (CONT’D) How are you gonna write about it all when you don’t even take a note? LIONEL “2 million for relocation; bridges a foot too low for buses; 1 out of 255 parks; $15 mil for $500k; 200,000 people in Ft Greene alone”.   I never forget anything, believe me. Not a single word. She nods, impressed.   He’s strange but he really looks at her and listens. He can’t help it and has to tap her twice on the shoulder. LIONEL (cont’d) (CONT’D) Sorry...I really can’t help it. LAURA (softens) It’s okay. Just write about it, okay? What happens to poor people in this city wasn’t news yesterday and it won’t be tomorrow. But you’d think somebody’d care what happens to Brooklyn. It’s only the biggest city on E",
      "dialogue_count": 0,
      "word_count": 2445
    },
    {
      "scene_number": 9,
      "slugline": "INT. TRUMPET PLAYER’S APARTMENT - HARLEM - MORNING SUNLIGHT BEHIND A SMOOTH HEAD. A trumpet playing soft...noodling around a melody. LIONEL’s EYES blinking at...Minna!? He wakes up...and sits up and the MUSIC STOPS.   He looks over at... THE TRUMPET PLAYER...sitting in the window sill by the fire escape, watching him   and smoking a joint. After a beat...  LIONEL Shit...sorry.   I don’t even know what happened. TRUMPET You had a good time, that’s what happened. We had a party. Different mix of people than the usual.   The ‘etrange melange’ she calls it. Lionel’s eyes flick to the kitchen where the French girlfriend is making coffee.  TRUMPET (CONT’D)  Figured you could use a little rest so we let you be. LIONEL I remember that guy’s footprint on my ribs. Thanks for bailing me out of there.  TRUMPET Sarge is a good man...but you gotta watch it round a man’s family...you know? LIONEL Sarge? TRUMPET Billy.  LIONEL Why you call him ‘Sarge’?  TRUMPET How you think his arm got so fucked up? Colored Marine unit. Carrying ammo ‘til he picked up a gun and helped stop some Jap suicide attack. Got hit though.  (MORE)  Pink Revisions   92.",
      "characters": [],
      "action_text": "Damn shame too cause he could really play. Trombone. Jammed with us at Minton’s a lot in ‘40. Came back from the war sour as hell. I told him switch to trumpet...said I’d get him a left-hander made. Said he lost his mojo. Got himself a club. Lionel’s head is clearing...he’s remembering and wants to know things... LIONEL You ever meet his wife? TRUMPET Nah, Sarge never married. LIONEL Laura’s mother...? TRUMPET I don’t know about any of that. It was always just him and Laura, she was just a little thing hanging out in the kitchen and reading while we played. (beat - regards him) You play?  LIONEL Music? No. TRUMPET I’m not to keen on people being vocal while we playing, but you were scatting on the line. I could hear it. LIONEL  (twitches bad)  On the line, Lionel! Lionel’s on the line!   Shit. I’m sorry about that. I have something wrong with my head.   The music really set it off. I’m sorry. TRUMPET Don’t be sorry.   You got a head just like mine.   Always boiling over, turning things around. That’s music...runs you more’n you run it when it gets up in you.  TRUMPET (CONT'D) (MORE)  Pink Revisions   93. Some people call it a gift but it’s a brain affliction just the same. LIONEL Yeah, but I just twitch and shout. At least you got a horn to push it through, make it sound pretty. TRUMPET Yeah but there’s a lotta other hours in the day though, you know what I’m sayin’? Too many! He tokes. Lionel nods and they let that understanding sit between them. Lionel   stands and scribbles a number on a matchbook. LIONEL Thanks for helping me out.   You ever need a ride anywhere or help with anything, give me a call. TRUMPET PLAYER takes   it and nods as Lionel exits. EXT. HOUSING COMMITTEE OFFICE - DAY Lionel is heading across the street to the steps when he sees...Gabby Horowitz...coming down them. He stops... LIONEL Mrs. Horowitz...? She looks up...he extends his hand. LIONEL (cont’d) (CONT’D) Jacob Gleason, reporter with the Post... She looks at him quizzically GABBY I know ",
      "dialogue_count": 0,
      "word_count": 3506
    },
    {
      "scene_number": 10,
      "slugline": "INT. THE KING ROOSTER JAZZ CLUB - CONTINUOUS Over Lionel’s shoulder as he works his way into the club by the back hall and emerges into the back of the stage revealing... THE FIGURE OF BILLY SITTING IN A CHAIR ON THE BANDSTAND, the light from the street silhouetting him LIONEL Billy...?   You hear that? LIONEL STOPS COLD...BILLY is holding a gun down by his side with SMOKE STILL CURLING FROM THE BARREL. He seems to be staring forward toward the front where the door is creaking open as though someone has left fast...but something is odd... And then as Lionel comes around him he can see... BILLY ROSE IS DEAD IN THE CHAIR...blood running down his white shirt from a gunshot wound through the chest and a belt tied around his   chest to hold himself up. A suicide? LIONEL (cont’d) (CONT’D) Ah shit... Then he stops cold, hairs on his neck rising...THE GUN IS HANGING IN BILLY’S USELESS RIGHT HAND. LIONEL RIPS HIS GUN OUT, SPINS TOWARD THE FRONT. SOUND OF A CAR STARTING ON THE STREET. He hustles to the front cubicle and bursts out onto... EXT. KING ROOSTER JAZZ CLUB - NIGHT - CONTINUOUS LIONEL BURSTS ONTO THE STREET in time to see...a BLACK CAR turning the corner, smooth and quiet...spooky...and gone. EXT. KING ROOSTER JAZZ CLUB - NIGHT - A BIT LATER Cop cars...patrolmen   guarding the door.   A DETECTIVE is interviewing Lionel...not your average 3rd Class Dick...this guy has rank... DETECTIVE (spinning it already) So he told you to come and then bumped himself so you could find him before staff came in probably.  Pink Revisions   109.",
      "characters": [],
      "action_text": "LIONEL (exasperated) I already told you, I didn’t just find him...I heard it happen. He didn’t shoot himself... SHOOT MY SHIT, BAILEY!...   Somebody shot him and set it   up to look like he punched out. I heard ‘em leave. DETECTIVE Uh huh. Powder burn on his shirt. Point blank. Neighbors telling us he had money problems...Seems pretty straightforward, friend. LIONEL The gun’s in his   right   hand. DETECTIVE So. LIONEL He’s got a   dead right arm, ace. War wound.   He can’t lift a Zippo with it let alone a .38. You wanna show me how he shot himself in the heart with   his left hand and then handed it off to his right before he punched   out? DETECTIVE  Guy went out in his own joint, center stage with the lights and all. Gotta give him credit. I respect his style.  THE BODY IS BEING BROUGHT OUT ON A STRETCHER. Lionel glances at the COP, something not right... LIONEL They usually put Division dicks on dawn patrol in Harlem? DETECTIVE Oh, we go wherever we’re needed. We done? He winks as over his shoulder LIONEL sees... LAURA RUNNING DOWN THE SIDEWALK. HE SPRINTS TOWARD HER TO STOP HER...  Pink Revisions   110. LAURA Oh no...Oh NOOOOO! She pushes past him to Billy’s body, distraught. WIDE: the sad tableau of her bent over BILLY’S BODY with Lionel hanging behind...and music floats in as we CUT TO: INT. LAURA’S HALLWAY   / APARTMENT DOOR - NIGHT He escorts her up the stairs of the tenement apartment to her door.   She inserts the key but stops with her hand on it. Her head falls and she starts weeping.   He reaches down gently and pulls her   hand off the key, turns it himself and opens the door. She stands in the doorway with tears falling silently down her face. LAURA I can’t think of the last time I saw him smile...But...why would he do that...to himself...? Her voice breaks...he lifts her face up... LIONEL He didn’t.   Someone wanted it to look that way. She shakes her head... LAURA Man was angry as long as I can remember. But nobody hated him like that...nobody. He ",
      "dialogue_count": 0,
      "word_count": 8898
    }
  ]
}