{
  "slug": "mozart-in-the-jungle-101-pilot-2014",
  "title": "mozart in the jungle 101 pilot",
  "genre": "romance",
  "format": "series",
  "scenes_count": 3,
  "characters_count": 0,
  "characters": [],
  "total_words": 888,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. LIVING ROOM - MORNING  Sunlight streaming in through dirty windows.  Hailey, asleep on the couch, blinks awake.   She fumbles for  her ringing cellphone alarm.  INT. BATHROOM - MORNING  Her hair is a mess, her eyes are bloodshot.  She takes four Advil and splashes water on her face.  INT. LIVING ROOM  Hailey, wearing her nice black dress, steps over zonked out  musicians and beer bottles as she spots her oboe case beneath  a drunk girl’s head.   She grabs it.  DRUNK GIRL  What the fuck, mom!?  CUT TO:  INT. PENTHOUSE APARTMENT - DAY  Elevators doors open to REVEAL:  Hailey wearing huge sunglasses.   She steps out, moving  slowly.  Her POV: moving through the tony apartment (from the opening  scene). Chairs are arranged by a little stage in the living  room.   Well-dressed guests mill about.  INT. DUNCAN’S ROOM.  Duncan holds the oboe.  DUNCAN  I practiced last night.   Focused on  my breathing--like you said...  HAILEY  Duncan, shut up.   (Deliberately)  Get me some water.   I’m extremely  hung over and I’m not proud of it.  A KNOCK on the door.   Duncan gets the water.  27.",
      "characters": [],
      "action_text": "WOMAN’S VOICE  (through door, enthusiastic)  Ten minutes till showtime!  Duncan brings the glass.  CLOSE ON DUNCAN  DUNCAN  (seriously)  Each breath is a bridge to another  breath.   Like a story unfolding...  A message alert BUZZES.   Duncan looks at Hailey, slightly  annoyed.  Hailey plays the message on speakerphone.  CYNTHIA  (voice mail)  Hailey.   It’s Cynthia.   I don’t  care what the fuck you are doing  right now, drop it and get over to  the Symphony Hall.   Gustavo is  holding auditions! They are seeing  woodwinds until 11.   You didn’t  hear it from me.  Hailey rubs her temples.  HAILEY  I can’t fucking believe this is  happening.  Duncan is pleasantly surprised by her choice of language.  She shakes her head, crestfallen.  HAILEY (CONT’D)  Ok, where were we?  DUNCAN  --You’re going to be late.  HAILEY  I can’t...  DUNCAN  Hailey--go.  Hailey slips her sunglasses back on and grabs her oboe case.  28. DUNCAN (CONT’D)  You can sneak out through the  service elevator.  HAILEY  What about your mom?  DUNCAN  You kidding?   If you get that job  my mom will brag to everybody that  her son takes lessons from the  oboist of the New York Phil.   Get  out of here.  She kisses him on the cheek and is out the door.   His face  turns RED and he instantly reaches for his phone to send a  text.  CUT TO:  SYMPHONY HALL STAGE - DAY  A LARGE WHITE SCREEN stands alone on the stage.  The SILHOUETTE of an auditioning oboist is cast by a lone  spotlight.   (Note: the screen keeps those who are auditioning  anonymous.)  INT. NY SYMPHONY HALL  A dim music stand light in the audience illuminates Gustavo  and his assistant, Sharon. (Previously Thomas’ assistant)  Eyes shut, he listens intensely to the music. Suddenly:  GUSTAVO  (to Sharon)  NO.  CUT TO:  INT. TAXI  Hailey checks her watch.  She is trying her best to cut a reed for the oboe as the car  lurches through the halting traffic.  CUT TO:  29.",
      "dialogue_count": 0,
      "word_count": 497
    },
    {
      "scene_number": 2,
      "slugline": "INT. NY SYMPHONY HALL  Gustavo watches another audition, through fingers folded  across his face.   Leans over to Sharon.  GUSTAVO  (insistent)  Not perfect. Needs to be perfect.  Cut to:  INT. TAXI - DAY  Hailey leans forward.  HAILEY  Excuse me sir, how much longer?  The driver, who has been talking on the phone in a foreign  language, shouts back:  DRIVER  Faster if you walk.  Hailey urgently shoves a wad of crumpled bills, coins, and a  METROCARD through the divider.  HAILEY  It’s got like five dollars on it--  sorry!  She stumbles out the cab door, only a few blocks left to go.  CUT TO:  INT. NY SYMPHONY HALL  The final audition has ended.   Only the empty chair is in  silhouette.  GUSTAVO  (to Sharon)  Next?  SHARON  It’s over, sir.  Gustavo takes this in.   Deep, disappointed breath.  He rises, collects some papers, and leaves.  CUT TO:  30.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 143
    },
    {
      "scene_number": 3,
      "slugline": "EXT. NY SYMPHONY HALL - FRONT STEPS - DAY  Hailey races up the steps--two at a clip.   She passes a  HOMELESS MUSICIAN playing the violin. The sight stops Hailey  for a moment dead in her tracks.   She shakes her head in  dismay.  Then ducks under a canopy and through the stage door.  Cut to:  INT. NY SYMPHONY HALL - CONTINUOUS  Hailey steps onto the stage and stares at the empty seats.  It’s over.   Crushed that she has missed her chance, she  begins to cry.  She starts to walk off the stage--but stops.  She slowly walks towards the auditioning chair and sits down.  She opens her oboe case.  Inside, something surprises her: wrapped around her oboe is  Joshua’s scarf.   A note written on sheet music reads:  “If found please call Joshua Merriweather at 212 555-6768”  She smiles as she puts the scarf around her neck.  Then, as if it were the audition, she takes in the deepest  breath of her life.  IN THE DARKNESS behind a curtain of a box seat--Gustavo is  pressing his body against Sharon as he works his hand under  her shirt.   She breathes heavily.  Then Hailey begins to play.  The sound stops Gustavo dead in his tracks.   He looks up.  He sees the lone silhouette of Hailey playing.  Gustavo leaves Sharon standing there.   He sits down.   Closes  his eyes.  He DIMS his reading lamp slowly until it is...  ...BLACK.  All we hear is the rapturous melody of the OBOE.  “MOZART IN THE JUNGLE”  31.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 248
    }
  ]
}