{
  "slug": "mr-right-2015",
  "title": "mr right",
  "genre": "action",
  "format": "film",
  "scenes_count": 4,
  "characters_count": 5,
  "characters": [
    "RIGHT",
    "MARTHA",
    "ZEKE",
    "RICHARD",
    "VON"
  ],
  "total_words": 18355,
  "total_dialogue": 13,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. FAST FOOD RESTAURANT - LATER Martha and Right sit together on the ground against the side of the restaurant.   Both of them have kids’ meals in colorful cardboard containers, which they are opening. RIGHT What’d you get, what’d you get? MARTHA Hold on, hold on... (takes out her toy) Green Parrot.   What’d you get? RIGHT Dog with Spot.   Dog With Spot beats Green Parrot. MARTHA What?   No way.   Green Parrot can fly. (beat) Plus, he had this really bad childhood, so now he carries a knife with him everywhere. Right laughs. MARTHA (CONT’D) His parole officer tries to send him in the right direction, but Green Parrot is just too... (laughs) What about Dog with Spot? RIGHT (shakes his head sadly) He had so much promise, but dropped out of college, lives with his girlfriend, she supports him...Not a pretty story, really. MARTHA Is this story indicative of you, or- RIGHT No, nah.   So you were telling me about the museum? MARTHA Right, worked there for two years, and now, back to the petstore. RIGHT Wait, back to Petacular with Elaine?  20. (CONTINUED)",
      "characters": [
        "RIGHT"
      ],
      "action_text": "MARTHA Thus the cat shit, yes. RIGHT But I thought you said you were going to end up managing the Egyptian thing- MARTHA Right, I was, but I’m...People have trouble working with me. RIGHT Yeah?   You’re a troublemaker? MARTHA (grins) No, I just...I have some “restraint issues.”   I’m kind of impulsive. RIGHT I find that really attractive. MARTHA Oh, you wouldn’t if you knew me. RIGHT I’m impulsive too. MARTHA (beat) What do you   do , exactly? RIGHT I sell cars, and I kill people. MARTHA Oh, you split the time? RIGHT (laughing) Seventy-thirty, sure. INT. PETACULAR! Elaine stands alone behind the counter.   She looks around, and then looks at the clock on the wall. EXT. LAKE SIDE PARK - TWILIGHT Martha and Right walk along the edge of an urban lake, laughing. RIGHT Dragons?  21. CONTINUED: (CONTINUED) MARTHA Yeah dragons.   Humans put names on everything to make them safe, but when you come down to it, a whale is just a sea monster, right?   I mean, what’s a dinosaur other than a dragon? As Martha talks, an errant frisbee nearly hits Right; seemingly without even looking, he catches it and throws it back. MARTHA (CONT’D) People see things and they put labels on them, and it takes the...The whatever, the wonder out. It allows people to just glance at stuff instead of really looking. RIGHT People prefer that, I think.   Most people live in little contained worlds; they like a T-Rex better as a big bunch of bones than as something that actually lived. MARTHA Yeah, maybe.   That’s why I got into paleontology in the first place, because I wanted to show the past to people in a new way.   I thought by now I’d be working in the Smithsonian, but I can’t... RIGHT Impulsive, right. MARTHA Right. (beat) We haven’t really, yknow, talked about  you   much. RIGHT Well that’s a shame, because I’m very, very interesting. Martha laughs, but then they’re interrupted by a   CHONGA , early twenties, latina, sexy, who stands with her friends around a picnic table in the park. CHONGA Hey,",
      "dialogue_count": 1,
      "word_count": 1634
    },
    {
      "scene_number": 2,
      "slugline": "INT. MARTHA’S APARTMENT - BEDROOM - MORNING Martha lays asleep, alone, in bed; her towel has come mostly unwrapped, and we can see her bare back and a little bit of her butt.   She blinks, awaking and realizing she’s alone, and then notices a note on her bed. Drawn on it is a simple, childlike image of Martha fighting a cat like a lion tamer, with stiff block letters under it.   “I HAVE TO GO TO WORK.   I WILL SEE YOU TONIGHT.”   She stares at it for a moment, and then slowly allows herself to smile. INT. CAR DEALERSHIP - RIGHT’S OFFICE Right sits at his desk, talking on the phone, looking out the window.   The nameplate reads “Clark Speck.”   There’s a wind up toy on his desk, wandering along. RIGHT No, I see the convertibles. (listens) I see them, I do, but you have to understand, when I say we can’t move convertibles I mean we can’t move convertibles, I’m not going to make up a sales problem, here. Someone walks by, and he covers the phone, calling out to them. RIGHT (CONT'D) Mitch, hey Mitch! The man stops and looks into the office. RIGHT (CONT’D) I’m in love! Mitch shrugs, and keeps walking.   Right goes back to the phone. RIGHT (CONT’D) Look, I’ll get back to you about this on Tuesday, okay?   Okay. Right.   Okay. Mr. Right hangs up, and sits for a moment, and then takes out his cell phone.   It reads “ONE NEW VOICEMAIL.” Right, making the strange, dead face, presses send.  29.",
      "characters": [
        "RIGHT",
        "MARTHA",
        "ZEKE"
      ],
      "action_text": "INT. PETACULAR! Elaine and Martha are loading crates of Kitty Litter up onto the shelves. MARTHA Can’t you hire someone to do this? ELAINE I did, I hired you. MARTHA Yeah, but someone to do it for us, while we watched. Elaine just shakes her head. ELAINE Why did Busta sleep in my room last night? MARTHA It was weird, he wouldn’t come in while... (laughs) I just realized I don’t know his real name. ELAINE Who, Mr. Right? MARTHA Mm, I like that. ELAINE You slept with him and you don’t even know his- MARTHA I slept with him, I didn’t screw him- ELAINE You don’t even know his name? Martha’s quiet. ELAINE (CONT'D) And Busta wouldn’t come in...You know, they say animals can sense evil. Martha glares at her.  30. (CONTINUED) MARTHA He’s not “evil.”   Ooh, actually, what if he is?   I hope he is. Martha lifts a big crate of cat litter up onto the shelf. MARTHA (CONT’D) When I was little I always had this fantasy of dating Lex Luthor. ELAINE Lex Luthor was a genius.   Your guy...he’s like, like some kinda hot Rain Man or something. Martha laughs. MARTHA I think I’m in love with him.   Is that stupid? ELAINE ...  Yes . Martha rolls her eyes. MARTHA Don’t roll your eyes! ELAINE You’re in love with a man you met  yesterday . MARTHA I don’t know, I think so. Elaine’s quiet for a moment, then sighs. ELAINE That’s how my mother and father met. Love at first sight. MARTHA Yeah? ELAINE Don’t start smiling, you’re not them. Martha keeps smiling. ELAINE (CONT’D) You’re not them!   And this guy is   weird , okay?   And he makes you weird.  31. CONTINUED: (CONTINUED) MARTHA I’m already weird. ELAINE When a dude cheats on you, you’re supposed to   reject   men, not just go gaga over the next one you bump into in a drugstore. MARTHA Hey, like you said.   “Mr. Right.” Elaine sighs dramatically, and then laughs. CUT TO: CLOSE UP OF A CLIP OF AMMUNITION BEING SLAPPED INTO A PISTOL. INT. MR. RIGHT’S STORAGE CONTAINER - CONTINUOUS Mr. Right sits in a storage container, wearing only an undershi",
      "dialogue_count": 6,
      "word_count": 8467
    },
    {
      "scene_number": 3,
      "slugline": "EXT. MARTHA’S APARTMENT BUILDING - CONTINUOUS Right and Martha start to come up the ramp, when something comes rolling down towards them. RIGHT (eyes wide) Martha cover your- There’s a blinding flash of light and sound as the flash-bang grenade explodes, and they go crashing into a parking meter on the other side of the street, sending coins everywhere. There’s a moment of silence, and then Mr. Right drops out of the car, pained and dazed, rubbing his eyes; Martha’s been nearly knocked out by the impact from the airbag. RIGHT (CONT’D) Martha...Martha... A flashbang rolls up next to him. RIGHT (CONT'D) Aw, dang. The flashbang  EXPLODES   in a flash of light and sound, and Mr. Right stumbles back, crawling desperately. Shotgun Steve comes out of  NOWHERE, smashing Mr. Right with a baseball bat, knocking him down .   Right, in extreme pain, turns and swats the bat out of Steve’s hands, grabs him by the arm and slams him against the car. Zeke bull-tackles the dazed Right, but Right shrugs him off, slamming his body into the side of the car; as Zeke raises his gun, Right snatches it away from him,  headbutts him in the face,   and turns to try to shoot Steve, but  Steve bashes his hand with the baseball bat, bashes him in the arm, and then raises the bat in the air to smash Right’s skull as Right flips out a switchblade when- BANG!  VON  ENOUGH . Von stands, holding the dazed Martha to him tightly with one hand, his smoking pistol raised in the other. RIGHT (squinting) Steve? Steve stands very still, confused.  70. (CONTINUED)",
      "characters": [
        "RIGHT"
      ],
      "action_text": "RIGHT I am a murderer.   But I’m a good guy. You...You’re one of the bad guys.   You’re just a rotten, rotten person. Von shakes his head and smiles. VON I’dve thought you’d be a little more tender with me, partner. MARTHA (waking up a little) He’ll be tender when he’s fucking you in the- Von viciously slaps Martha.   Right winces behind the car. Police sirens are approaching.   Johnny grabs up one of the flashbangs and bowls it towards the car right hides behind. RIGHT I’m going to get you. VON Yeah, give it your best shot, psycho. Right pops up from behind the car, motioning as though he’s going to throw the switchblade, and then the flashbang comes to rest at his feet. WHITE FLASH. SLAM TO BLACK. EXT. THE CARTIGAN LODGE - NIGHT - LATER It’s a massive house just outside of the city, in a wooded area.   The three cars approach, and stop at a gate.   Von leans out the window to shout back to Steve. VON Steve? SHOTGUN STEVE (annoyed) Yeah? VON Wait out here, okay? SHOTGUN STEVE What?   Why?  72. CONTINUED: (CONTINUED) VON Just wait the fuck out here! Shotgun Steve seems conflicted, but then sighs and pulls over his car next to the gatehouse as the others drive in. He lights a cigarette, and then shakes his head, frustrated, thinking. CUT TO BLACK. There’s faint, somewhat chaotic music.   It’s pretty; as though composed from ambient sounds, woven together to form one flowing song.   It gradually falls apart, separating into individual sounds, which leads to... FADE IN: MR. RIGHT DAZEDLY WAKING UP... EXT. MARTHA’S APARTMENT BUILDING - LATER Mr. Right blinks, he’s face down on the asphalt.   He sees his clown nose sitting only a couple feet away, and reaches for it;   we hear dozens of guns cock. He looks around; there are eight police cars parked on the road, some with lights on, and a mess of police officers, Wally and Hopper stand behind the cars, pistols and shotguns raised, trained on Mr. Right; he’s covered in laser sights. RIGHT (laughs) Think...think you brought",
      "dialogue_count": 1,
      "word_count": 1353
    },
    {
      "scene_number": 4,
      "slugline": "EXT. CARTIGAN LODGE - CONTINUOUS Richie is SCREAMING at Von. RICHARD -AND NOW HE COULD COME HERE! VON Well that’s the plan man, if he comes here we finish him off.   He was hurt, we saw- RICHARD THIS MAN JUST KILLED FIFTEEN OF OUR GUYS! VON  LISTEN . Richard stares at Von, surprised by his brother’s assertiveness. VON (CONT’D) Johnny and I have a plan.   We’ll go out there, get the word out, throw up a hundred grand reward- RICHARD -A hundred grand!- VON Of my own money, yeah, we’ll go out, beat the bushes and get people armed.   Maybe drive up to Sasatchee and get the Drews in on this.   You stay here, hold down the fort and I’ll take care of this.   I promise this time.   If I can’t, then damn, I’ll take whatever you got for me. You can give me whatever you’ve got. Richard stares at Von, thinking. RICHARD (shaking his head) Okay.   Okay, whatever, do what you- BRUCE (O.S.) No. VON  What the fuck-  Von turns to find that Bruce stands on the porch behind them. VON (CONT’D) You better shut your fucking coon yap or-  76. (CONTINUED)",
      "characters": [
        "RICHARD",
        "VON",
        "RIGHT",
        "MARTHA"
      ],
      "action_text": "VON  Richard, for fucksakes, you’re gonna let this jack-off tell you what to do now or...  Von trails off as Bruce and Richard stare at him; he seems deeply shaken by something, and he flinches a little bit. VON (CONT’D) Okay.   Okay, fine.   Okay.   Okay. RICHARD Up the guard on the house.   I want every single guy we can get in here tonight. And be sure you’re quiet about it; I don’t want this nutcase following the ants back to the queen, you know? Bruce nods. As they talk, Von looks through the window, making very intense eye contact with Johnny Howl inside.   He does not look pleased, and slightly shakes his head. Martha watches this silent exchange, and then stares at Johnny Howl. JOHNNY HOWL Looks like we’re going to be up past bedtime. CUT TO: AGENT HOPPER DRIVING HIS CAR. EXT. STORAGE FACILITY - NIGHT Hopper flips his FBI badge to the guy at the check-booth at the edge of the storage facilities parking lot, and the guy lets him pass.   We pan to reveal Mr. Right laying along the bottom of the backseats, two guns pressed to Hopper’s chair. CUT TO: MR. RIGHT OUTSIDE HIS STORAGE CONTAINER. Right is unlocking the storage container, holding Hopper at gunpoint. RIGHT I really am sorry about this.   I’m probably going to have to shoot you, too. HOPPER (more frustrated than scared) Shoot me, jesus christ.  78. CONTINUED: (CONTINUED) RIGHT Yeah, well, that’s the way the cookie crumbles.   Open the door. Hopper pulls open the door, and the fluorescent click on, revealing all of the guns. HOPPER  My god . Right goes in, keeping Hopper at gunpoint. HOPPER (CONT’D) What are you going to do? Mr. Right smiles. AS HOPPER TALKS: Mr. Right goes through the container, keeping him at gunpoint, picking up a sniper rifle, an M-16, a string of grenades, and two miniature bouncing betty land mines. HOPPER (CONT'D) They took her, didn’t they? (beat) They took her.   And you’re, what, you’re going to go after them?   Or, no, you’re going to leave, like you did in Bosnia, just disappe",
      "dialogue_count": 5,
      "word_count": 6901
    }
  ]
}