{
  "slug": "mr-robot-101-eps1-0-hellofriend-mov-2015",
  "title": "mr robot 101 eps1 0 hellofriend mov",
  "genre": "sci-fi",
  "format": "series",
  "scenes_count": 10,
  "characters_count": 0,
  "characters": [],
  "total_words": 14660,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. PHIL’S COFFEE (FLASHBACK) - NIGHT  A small coffee shop with a few patrons. A cheesy sign that   * reads “Phil’s Coffee” displays proudly above. Elliot sits by   * himself, hoodie on, no coffee. His leg taps nervously. Elliot intently watches as a mild-mannered Indian with a   * mustache walks into the shop. This is PHIL (50s).   * He orders a latte from the front and sits alone. He pulls out   * his iPad and sips his latte, enjoying the quiet evening to   * himself.   * Elliot musters courage with a deep breath and walks over. He   * sits across from him without saying a word, his leg twitching.   * Finally, Phil looks up.   * ELLIOT   * You’re Phil.   * He nervously gestures to the cheesy sign. Confused, Phil just   * offers a quick smile in return--   * ELLIOT (CONT’D)   * But your real name is Rohit Pathak.   * (nervous and robotic)   * You changed it to Phil when you   * bought your first Phil’s Coffee shop   * six years ago. Now you have seventeen   * of them with eight more coming next   * quarter. You married an American   * woman named Linda Fielding, age   * thirty-one, then had two kids with   * her. Smallbiztrends.com said your   * life was so perfect it felt like “the   * stuff of sitcoms.”   * An awkward silence. Phil licks his lips, not sure if he should   * be flattered or concerned.   * PHIL   * (thick Indian accent)   * May I help you with something?   * ELLIOT   * I liked coming here because the WIFI   * was fast and with no dropouts. It was   * good. So good that it scratched that   * part of my mind-- the part that   * doesn’t allow good to exist without   * condition. So, I snooped on the   * traffic and that’s when I noticed   * something strange in the filenames--   * 3.",
      "characters": [],
      "action_text": "Elliot looks down, nervous to go on. But he looks back up with   * confidence.   * ELLIOT (CONT’D)   * That’s when I decided to hack you.   * Another awkward silence. Phil goes to say something--   * ELLIOT (CONT’D)   * I know you run a website called   * Lolita City.   * Alarms suddenly go off in Phil’s world.   * PHIL   * Pardon me?   * ELLIOT You use the company servers to run it through Tor networking, SUPER: “Tor Networking - a system intended to enable online anonymity” ELLIOT (CONT’D) Routing the traffic from shop to shop, making it virtually untraceable. You made it really hard for anyone to see it. Even though Elliot came off a little amateurish at first, his   * confidence builds as he continues to talk.   * ELLIOT (CONT’D)   * But I saw it. With all the public   * info out there on you; birth dates,   * anniversary dates, family names,   * pets...   * (clears his throat)   * I cracked your password in three   * minutes.   * Angry and confused, Phil eyes Elliot carefully.   * PHIL Sir...What is the meaning of this? ELLIOT (back to nervous) Sorry, I’m a little nervous. It’s my first time doing this in person. PHIL (firm) Sir, I must ask you to kindly leave-- 4. Phil turns to the man working the register-- ELLIOT I downloaded everything. All your emails, all your files, all your...pics. Phil turns back around. This just got serious, and it shows. PHIL (angry) Get out of here right now, sir, or I will call the-- ELLIOT FBI? Do you want them to find out about the 100GB of child pornography you serve to your 400,000 users? That’s a lot of bandwidth, of course, which explains the higher than usual speeds on all your shops’ internet connections. Phil is stunned silent. For a moment, all that can be heard is the soft musak and quiet sipping of coffee from the other patrons. Phil looks down, cornered and speechless. Elliot looks genuinely sympathetic. ELLIOT (CONT’D)   * Personally, I was hoping it was just   * going to be BDSM stuff. Do you   * realize how much si",
      "dialogue_count": 0,
      "word_count": 1262
    },
    {
      "scene_number": 2,
      "slugline": "INT. NYC SUBWAY (MOVING) - MORNING  Back to present day, Elliot snaps awake. He eyes the two MEN IN BLACK who still sneak looks at him. ELLIOT (V.O.) Now I’m being followed. The higher   * ups don’t like someone with my   * powers. In three short minutes, I   * destroyed a man's business, life,   * existence. I deleted him--   * On the far end of the packed train, a blonde man YAWNS loudly. He looks like a disheveled Californian who’s been forced to relocate. He wears cargo pants and what looks like a gas attendant shirt that reads: Computer Repair With A Smile. Below it, a logo reads MR. ROBOT (40s). He looks at Elliot with a stoner’s smile as he brushes his scraggly beard. Elliot doesn’t smile back. Across the crowd of people, the man shouts: MR. ROBOT Hey sonny, what’s happening? Elliot doesn’t answer. Instead, he looks away, pretending he didn’t hear him. MR. ROBOT (CONT’D) It’s an exciting time for the world right now. An exciting time... Mr. Robot lies on his back, returning to his homeless slumber.  EXT. NYC STREETS - LATER  Elliot walks through the crowded streets of New York, carefully avoiding the touch of other humans. He carries a huge bookbag on his back.  INT. ALLSAFE OFFICES - LATER  He walks into the modest offices of AllSafe Cybersecurity, as announced by the boring, corporate logo. ELLIOT (V.O.) But I’m only a vigilante hacker at night. By day, I’m a hired one, just   * a regular cyber security engineer,   * employee number 0652. 8.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 260
    },
    {
      "scene_number": 3,
      "slugline": "INT. ALLSAFE OFFICES - GIDEON’S OFFICE - CONTINUOUS  The AllSafe boss, GIDEON NORTON (40s), a bearded metrosexual with adult braces sits while ANGELA (20s), a blonde girl-next- door trapped in the prim and proper veneer of a private school upbringing, looks down at him sternly. ANGELA Gideon, I can do it. Not wanting to respond, Gideon lets his attention get distracted by Elliot. He shouts through his glass doors: GIDEON Elliot, in here! Elliot nervously walks in, curiously looking at Angela who pretends he’s not even there. Gideon passes a file to him. GIDEON (CONT’D) They were hacked again. Last night. Elliot looks over the notes. ELLIOT What am I looking at? Is this the code? This was a RUDY attack. SUPER: “RUDY Attack - Also known as R-U-Dead-Yet? This tool attacks by starving available sessions on the web server until they die” Concerned, Gideon nods. Elliot shakes his head, impressed more than he usually is. ELLIOT (CONT’D) This is awesome-- ANGELA Gideon, will you please answer me? GIDEON (to Elliot) You think that’s awesome? This is killing us, Elliot! ANGELA Gideon, I’m not leaving-- GIDEON Angela, let’s just see how the meeting goes today. They’re getting hacked every week now. Who knows if they’ll still even be with us. 9.",
      "characters": [],
      "action_text": "ELLIOT  They’re   coming in? Gideon’s look confirms it. He looks at Elliot’s hoodie. GIDEON What’d we say about the dress code? Elliot sheds his hoodie, revealing an oversized, button-downed dress shirt underneath. He hates it. GIDEON (CONT’D) (re: file) Look over that, be ready this afternoon.  INT. ALLSAFE OFFICES - HALLWAYS  Elliot and Angela walk out. Elliot smells something on her. ELLIOT Did you start smoking again? ANGELA (ignores his question) Did you not get my texts last night? I sent you exactly thirteen of them. ELLIOT Yeah, I’m sorry, I couldn’t make it-- ANGELA (looks at him) You promised me that you would try this time. FLASHBACK: Last night, Elliot nervously walks up to the entrance of a packed bar. Through the big windows outside he sees Angela, laughing, smiling, drinking with friends. Elliot’s hand goes for the door, but his hand trembles-- ANGELA (CONT’D) Stop thinking about something else when I’m talking to you. I hate when you do that. ELLIOT Sorry, I was thinking about work. ANGELA You’re such a kiss-ass. Maybe that’s why Gideon loves you so much. He thanks me all the time for bringing you in. But for some reason, I think you secretly hate it here. 10. ELLIOT (V.O.)   * She was right. I liked most of the   * people, but our business-- a cyber   * security firm that protects   * corporations-- not so much.   * ELLIOT No, it’s cool. I like it here. ANGELA I’m sorry, I’m just in a bad mood. I’ve been late on my last two student loan payments and I can’t get Gideon to give me a raise-- A slick, good-looking Persian named ALI (20s) walks up and kisses Angela. ALI (to Elliot) Yo, bud. Missed you last night, where were you? ELLIOT Gotta go. Big meeting today. Elliot doesn’t wait for a response, he disappears into the maze of cubicles quickly. ALI (to Angela) Did you find out what happened? ANGELA He said he was working. ALI (not buying it) Come on. You have to talk to him-- ANGELA (rolls her eyes) We’re gonna be late for the staff meeting. ALI He ca",
      "dialogue_count": 0,
      "word_count": 599
    },
    {
      "scene_number": 4,
      "slugline": "INT. ALLSAFE OFFICES - CONFERENCE ROOM - LATER  A wide conference room filled to the brim with account executives, programmers and VPs. GIDEON ...The recent hacks on their network have been of grave concern not only to them, but to this company. Let’s make sure we’re on our A game this afternoon. But before we get into it, I hear we have a birthday to celebrate. He gestures over to Angela who sheepishly smiles. Everyone starts singing happy birthday. Cake is being passed around. Smiles all around from the nice folks that work at AllSafe. Elliot, his seat pushed just a little further out than the rest, observes cautiously. On the mounted TV in the corner,   * MSNBC is playing a clip from ex-Defense Secretary Leon   * Panetta. The conversation around him drowns out as he focuses   * on the TV.   *  LEON PANETTA   *  ...there's a strong likelihood the   *  next Pearl Harbor we confront could   *  very well be a cyberattack.   *  MSNBC ANCHOR   *  Panetta went on to say that this is   *  the future of US defense spending,   *  computer engineers with expertise in   *  hacking. This is the new soldier, the   *  intelligence soldier.   * Elliot turns to his co-worker LLOYD (20s), a Chinese engineer   * with a fro, who talks openly with a mouth full of purple frosting. Elliot forces a smile as he passes on a piece of cake.  CUBICLE - LATER  Elliot’s cubicle is as vanilla as a cube could be. He furiously codes on a Linux command line, earbuds plugged in. His fingers take quick breaks to fetch McDonald’s fries out of the bag. Ali interrupts his work with a wave of his hand and a phony smile as icing. Elliot reluctantly removes his earbuds. ALI Yo, man. Wanna do lunch today? ELLIOT Oh, um, yeah, I have other pla-- 12.",
      "characters": [],
      "action_text": "ALI Plans, yeah, that’s what you said the last three times I asked you. Look, bud, you and Angela have been close for a long time. But, that’s even   * more reason why I want us to be on good terms. I just feel like it’s awkward between us, don’t you? ELLIOT I’m okay with it being awkward between us. ALI (scoffs) Well, it’s not okay with me. Lunch, today. Meet me at Sharon’s Deli at 1:15. On me. It’ll be epic. A moment’s hesitation, then Elliot nods. ALI (CONT’D) Cool bro.  EXT. NEW YORK STREETS - DAY  Elliot shiftlessly walks through the streets once again, big bookbag in tow. His eyes wander around in paranoia. He continues to eat his McDonald’s fries from the bag.  INT. PSYCHOLOGIST’S OFFICE - DAY  He sits across from his psychologist, KRISTA (40s), a slightly overweight African-American woman who tries too hard at youth with a short dress. They’re looking at each other in silence. KRISTA What are you thinking about? ELLIOT Nothing. KRISTA Wanna know what I’m thinking about? (off his look) The first time you came to me... ELLIOT (V.O.)   * I didn’t exactly come to Krista, I   * was forced here. But I do like her.   * (then)   * Her password was simple, Dylan2791.   * Favorite artist and the year in which   * she was born, backwards.   * 13. INSERT: Krista’s Gmail, Facebook, iTunes. We land on her   * eharmony profile.   * ELLIOT (V.O.)   * I know she got a divorce four years   * ago. I know she was devastated by it   * and has been dating losers on   * eharmony ever since.   * INSERT: A profile pic of a salt and pepper handsome gent. He’s a pudgy, nice fellow with a friendly mustache and a welcoming smile. His name is listed as Michael Hansen. ELLIOT (V.O.)   * Her most recent foray... Michael   * Hansen. Something about him bugs me,   * scratching that part of my mind   * again.   * Back to the scene. Elliot eyes Krista.   * ELLIOT (V.O.)   * Though she’s a psychologist, she’s   * really bad at reading people. But I’m   * good at reading people. My secret? I   *",
      "dialogue_count": 0,
      "word_count": 5402
    },
    {
      "scene_number": 5,
      "slugline": "INT. SERVER FARM - NIGHT  Gideon nervously paces around the pulled firewalls that are stacked up in a pile on the floor. Elliot is typing furiously as he configures the newly installed firewalls. A group of tech SPECTATORS have now formed around Elliot, watching him with anticipation. GIDEON (discreet) Come on, Elliot, they’ve been down for six hours-- ELLIOT Hold on...try it now. Gideon tries the Evil Corp website. It’s back up. Gideon breathes a sigh of relief. ELLIOT (CONT’D) Wait, ask Angela. We need to see if it’s back up in the outside world. Gideon video conferences Angela through his laptop. ANGELA (smiles) We’re good on our end guys! The song comes to an end as the commotion finally subsides. The spectators CLAP. Gideon stands up proudly and squeezes Elliot’s shoulder. Elliot shies away from the contact. ELLIOT I still have to finish the configuration. Give me a minute. GIDEON (put off) Okay. I’ll meet you by the bathrooms. The spectators disperse along with Gideon. Elliot continues to furiously type. ELLIOT (V.O.) They must have left a mark or something. Every hacker loves to gloat. They don’t just do DoS attacks for no reason. That’s when Elliot stumbles upon a file in the terminal that reads simply: fsociety. He /dir’s it and a flurry of files go flying by, the last one being README.TXT. He opens it. It reads simply: leavemehere 35.",
      "characters": [],
      "action_text": "ELLIOT (V.O.) This was the rootkit. Fsociety? Is that supposed to be a joke? Elliot steps out of the directory and types: rm fsociety/* He takes a pause before hitting enter. ELLIOT (V.O.) Wait. This note is for me. They’re telling   me   to leave it here. But why? Techs walk by, nervously surprising Elliot. He can’t bring   * himself to delete it-- he closes the terminal and walks away.   *  INT. PRIVATE JET (MOVING) - DAWN  Exhausted, Elliot and Gideon sit silently together. Though Elliot is used to the all-nighters, Gideon isn’t. He has a glass of wine as he sits back, deep in thought. GIDEON Did you know that I was gay? ELLIOT   * Um...no. After an awkward pause, Gideon uncomfortably nods.   * GIDEON Consider this me coming out to you then, okay? It’s hard, because I don’t like to talk about my sex life. But my partner-- he gets very paranoid, he thinks I’m ashamed of-- you know. He wants me to be more public about it. Anyway, I’m gay. ELLIOT   * (awkward pause)   * Thanks.   * Deep in thought again, Gideon slowly sips his wine. Elliot notices the troubled look on his face. ELLIOT (CONT’D) Don’t worry about it. Hackers have a short attention span. They’ll get bored and harass someone else-- GIDEON Evil Corp is thinking about leaving. And, I don’t know if I blame them... Gideon shakes his head. 36. ELLIOT We have other clients. GIDEON We   had   other clients. Everyone’s slashing their budgets, doing security internally. Evil Corp is seventy percent of our business right now. We can’t lose them. I’m already extended on our credit line. If we lose them, that’s gonna be it for us. That’s gonna be it for me. Gideon takes another sip of his wine and leans back in his chair. He looks up, hopeless, unsettled. He looks over. GIDEON (CONT’D) I feel like I can talk to you. More than the others, anyway. They share a comfortable moment this time. GIDEON (CONT’D)   * I’m sure, in a strange way, you’ll be   * happy if we went under.   * (off his look)   * Oh, come on. I know ",
      "dialogue_count": 0,
      "word_count": 1867
    },
    {
      "scene_number": 6,
      "slugline": "INT. ELLIOT’S APARTMENT BUILDING - HALLWAY - DAY  Elliot walks into his hallway and sees Angela sitting outside his door, smoking a cigarette by the window. She stands when she sees him. ANGELA Thank God you’re here. I was just about to go wait in that Starbucks on the corner. You live in a bad neighborhood, do you know that? ELLIOT I do know that. She shows him a BACK TO THE FUTURE II DVD. ANGELA Wanna get high and watch our favorite movie? You saved our asses last night. I thought Gideon was definitely going to fire me. Where have you been? I thought you’d be sleeping. ELLIOT I-- fell asleep on the train. ANGELA (skeptical) Sounds like such a lie but, whatever, I don’t wanna get into it right now. So, you wanna do this? I miss Qwerty, hope she’s happy to see me. Elliot unlocks the door and they walk into the apartment.  INT. ELLIOT’S LOFT  Shayla sits up, still naked. She covers herself. ELLIOT Oh, shit. SHAYLA Um, Elliot, who is this? What day is it? It’s not Wednesday, is it? ELLIOT (to Angela) Look, can I talk to you outside? Angela, looking at Shayla’s tattoos, doesn’t register Elliot’s question at first, but then nods. 42.",
      "characters": [],
      "action_text": "HALLWAY - MOMENTS LATER  ELLIOT She wasn’t supposed to be here. ANGELA   * It’s okay. This is great, Elliot. I’m   * happy for you.   * ELLIOT It’s not like that. ANGELA Well, maybe it should be. It’s good that you’re dating.   * Elliot reluctantly nods in defeat. ANGELA (CONT’D) And stop looking so sad. (he looks up) You’re always looking sad--  INT. FUNERAL RECEPTION (FLASHBACK) - DAY  YOUNG ELLIOT (14) wears black. He looks sad, but doesn’t cry. He sits alone in the corner. YOUNG ANGELA (14), also in black, walks up to him. YOUNG ANGELA You’re always looking sad. YOUNG ELLIOT (caught off guard) My dad died. YOUNG ANGELA I know. (she sits next to him)   * But you’ve looked sad before. I’ve seen you. YOUNG ELLIOT You have? YOUNG ANGELA Yeah. This makes Elliot feel good. In fact, this might be the first smile he can remember. YOUNG ANGELA (CONT’D) I’m gonna go-- 43.",
      "dialogue_count": 0,
      "word_count": 367
    },
    {
      "scene_number": 7,
      "slugline": "INT. ELLIOT’S APARTMENT BUILDING - HALLWAY (PRESENT DAY)  ANGELA I’ll see you on Monday. We’ll do movie night next time. I promise. Okay?  (re: Shayla) Oh, and have fun. Elliot nods as she walks away. Frustrated, Elliot walks into his apartment and immediately says: ELLIOT Shayla, leave. NOW.   CUT TO: INSERT: Google, 4chan, reddit, message boards, craigslist, blogs, news sites, etc. ELLIOT (V.O.)   * No mention of Mr. Robot anywhere. No   * mention of fsociety. Not on any of   * the hacker boards. Not on 4chan,   * Reddit, Digg, Slashdot, IRC. Nothing.   * INSERT: Google maps on the fsociety arcade.   * ELLIOT (V.O.)   * Property was owned by Fun Society   * Amusement, LLC for thirteen years,   * owner was shot and killed a year and   * a half ago, no owner since. And the   * ownership history before that is   * sparse to nonexistent. This guy is   * good. Very good. Doesn’t matter. This   * is enough to turn them in.   * Elliot prints out the incriminating pages and files them in a   * blue manila envelope.   * Elliot sits back down, looking at the Google Maps picture of   * the fsociety arcade. The temptation is too strong, he cracks.   *  EXT. CONEY ISLAND STREETS - LATER  Elliot, carrying his bulky bookbag, walks through the slums of Coney Island, back to the fsociety arcade. Outside, Marlene sits on the curb and smokes. She has fuzzy pink ear muffs on to protect her from the cold air. Elliot enters through the metal gate and walks up to her. She doesn’t say anything to him. ELLIOT Hey, I’m Elliot. 44.",
      "characters": [],
      "action_text": "Marlene shoots him an odd look. MARLENE Fucking weirdo. (off his confused look) When are you gonna give us the password? ELLIOT What? MARLENE Don’t fuck with me, I wrote that rootkit. I still have to run the IP trace back to Colby’s laptop. (off his confused look) You really don’t know what I’m talking about? Marlene shakes her head with disgust and flicks her cigarette. MARLENE (CONT’D) Dickhead. She gets up and walks towards the back, leaving Elliot perplexed. Mr. Robot enters from the street, through the gate, holding a grocery bag full of goodies. MR. ROBOT Elliot! I scored the last batch of twinkies at Gristedes. Want one? ELLIOT She just called me a dickhead. MR. ROBOT (smiles) Yeah, that’s Marlene. (gestures toward the Ferris wheel) Hey, you like Ferris wheels?  EXT. CONEY ISLAND - FERRIS WHEEL - DAY  Elliot and Mr. Robot stand in a slow-moving, empty Ferris wheel car as it does its circular motion up. Mr. Robot looks down at the sparse crowd with a grin, eating a twinkie. ELLIOT I’m here to tell you that I’m turning you in. I’m giving them the IP and mac address, plus the logs-- MR. ROBOT Let me tell you why you’re really here. 45. Confused, Elliot says nothing. MR. ROBOT (CONT’D) You’re here because you sense something wrong with the world. Something you can’t explain, but you know it controls you and everyone you care about. It turns them into slaves. And that   angers you . ELLIOT What are you talking about? MR. ROBOT Money. Money hasn’t been real ever since we got off the gold standard. (turns to Elliot) It’s become virtual. Software. The operating system of our world. And the rules are simple: those who have less of it are forever subjugated to those who have more of it. ELLIOT Money? Is that what you and your little family back there do? Steal money? MR. ROBOT (offended) This isn’t the mafia. We’re not a family. Family members trust each other, and that’s what usually fucks them. This isn’t about trust, it’s about freedom. ELLIOT Any of those guys back",
      "dialogue_count": 0,
      "word_count": 1731
    },
    {
      "scene_number": 8,
      "slugline": "INT. CONEY ISLAND STREETS - LATER  Elliot walks fast as a small smile begins to grow on his face. He listens to Neil Diamond’s “If You Go Away.” He stops short to see a billboard of a college student with a sad face. The copy reads: “How am I ever going to pay back my student loans?” Underneath: EVIL CORP  NEIL DIAMOND If you go away on this summer day  INT. NYC SUBWAY (MOVING) - NIGHT  Elliot can’t contain the flurry of emotions pulsing through his entire body. The intercom is in the midst of playing a commercial: SUBWAY INTERCOM --just log on to www.evilcorp.com to purchase now... (repeating) Hello! Wanna save on your health insurance premiums? At Evil Corp, we not only laugh at you for thinking that, but we charge you more for it... Sensing Elliot’s excitement, a CHILD smiles at him. Touched, Elliot smiles back. The MOM, noticing the exchange, shoots a friendly look at Elliot.  NEIL DIAMOND Then you might as well take the sun away  INT. ELLIOT’S LOFT - NIGHT  Elliot types away on his computer, we see text as he’s skipping around. HuffPost - Mortgage lenders now have more equity in U.S. homes than Americans. BBC - The global gap between rich and poor is at its highest level for 20 years and growing. NY TIMES - Debt Slavery, The New American Dream. He pulls up another browser window and logs into Citibank’s site. We see that the account belongs to Angela. He clicks through her statements and lands on her private Evil Corp student loans. She owes $197,455.64. Elliot looks over at Mr. Robot’s slip of paper next to him. He opens a new command-line and begins typing up the report. MOMENTS LATER The final pages of the new diagnostic report prints out. He places the report in a red manila envelope. 51.",
      "characters": [],
      "action_text": "MOMENTS LATER Faintly smiling, Elliot sleeps soundly in his bed. The E logo of Elliot’s Evil Corp desktop pulses in sleep mode, casting a shadow on Elliot periodically.  NEIL DIAMOND If you go away, as I know you must  INT. NYC SUBWAY - PLATFORM - LATER  As Elliot waits for the subway, he stares at a poster for a blockbuster movie called VILLAINS, the tagline reads: Evil Always Wins.  NEIL DIAMOND There'll be nothing left in this world to trust  The MEN IN BLACK on the platform sneak Elliot looks. Elliot’s excitement from the night before starts a slow descent.  INT. ALLSAFE OFFICES - NEXT MORNING  WORKERS file in for another day, but the mood is somber. Terry Colby and his Evil Corp executives are crowded in the conference room. FBI Agents are also walking in and out. Gideon looks stressed. The air is thick with tension. Colby wants someone’s head on a platter. Angela walks in with a worried look. Ali walks in, sharing the same look of dread as everyone else.  NEIL DIAMOND Just an empty room, full of empty space  Elliot nervously walks in, eyeing his blue and red manila envelopes. The smile from the night before is now but a distant memory.  NEIL DIAMOND (CONT’D) Like the empty look, I see on your face...  INT. ALLSAFE OFFICES - CONFERENCE ROOM - LATER  Gideon, AllSafe account executives, FBI, Evil Corp execs, Tyrell and Terry Colby himself surround the expansive table. The red manila envelope sits in front of Elliot. He’s sweating profusely as he swaps the red back into his bag for the blue.   * He shakes his head in disappointment.   * Tyrell Wellick notes the folder swap. 52. NEIL DIAMOND  The good's gone from goodbye, if you go away, if you go away, if you go away....  TERRY COLBY So, what do we got? GIDEON So, if you take a look at the first page of the agenda-- Everyone flips over one page of their packet. Terry looks over at Elliot. Elliot nervously looks back. TERRY COLBY You’re the one we sent to Virginia? (off Elliot’s nervous nod) Great work. The gals in",
      "dialogue_count": 0,
      "word_count": 1314
    },
    {
      "scene_number": 9,
      "slugline": "INT. ALLSAFE OFFICES - DAY  Elliot walks in, he sees Angela ahead of him. She’s dyed her hair jet black. He tries to catch up and say hi, but she gives him the cold shoulder. ELLIOT (V.O.) (eyes the empty conference room) No FBI, Colby, Evil Corp. Maybe Mr.   * Robot was wrong after all.   *  INT. ALLSAFE OFFICES - CUBICLE - LATER  Bored, Elliot stares at his computer screen. A banner ad for the movie VILLAINS flashes on a website.  EXT. NYC STREETS - DAY   * Elliot walks down the street on his cell. ELLIOT Hi, this is Sam from Wells Fargo security fraud department. Unfortunately, we have to inform you that your account has been compromised. MICHAEL (O.S.) What? Really? What happened? ELLIOT First, before I can continue, I need to verify some information. Are you still at 350 Hawthorne Avenue? MICHAEL (O.S.) Yes. Apartment 2C. ELLIOT Great. And the last four of your social security? MICHAEL (O.S.) Umm...6457. ELLIOT Mother’s maiden. MICHAEL (O.S.) Faben. ELLIOT And your security question... A painful pause on the phone. 56.",
      "characters": [],
      "action_text": "ELLIOT (V.O.) I always stretch for this one. MICHAEL (O.S.) Oh, um, I think, dog’s name. Flipper. Wasn’t it that?  INT. ELLIOT’S LOFT - NIGHT  Elliot sits in front of his rundown, stickered up Evil Corp desktop as a command line program runs password checks with the keywords Elliot has inputted. ELLIOT (V.O.) With those details plus a dictionary   * hack, it’ll take my program maybe two   * minutes to crack his password.   * While he waits, Elliot goes on Facebook and looks up Angela. He scans through the pictures of her and Ali. Christmas vacations, Halloween, beach parties, barbecues, etc. ELLIOT (V.O.) What I wouldn’t give to be normal. To live in that bubble, the reality of the naive. He switches Facebook accounts to Krista, his therapist. More happy pictures of families, vacations, friends. ELLIOT (V.O.) That’s how I justify this. To keep their optimism intact. To protect them. His password program BEEPS. He switches screens hurriedly and discovers the program didn’t come up with a single match. ELLIOT (V.O.) How? He’s too old to have a complicated password. It had to have been a combination of these things. Elliot puts his head down and thinks. ELLIOT (V.O.) I’m missing something. I’m missing something. I’m missing something. He closes his eyes. He slouches as he rocks back and forth in his chair. His leg twitches rapidly as he mumbles thoughts to himself. Finally, he looks up at his screen. ELLIOT (V.O.)   * His phone number.   * He quickly goes on Google and does a reverse look-up on Michael’s phone number. 57. ELLIOT (V.O.) Michael Hansen isn’t his real name. Elliot sits back, disappointed.  EXT. 350 HAWTHORNE AVENUE - NIGHT  Michael walks down his street carrying a screaming baby. His WIFE walks next to him. They exchange words before she heads into the corner convenience store and he walks towards their apartment building, baby in arms. Elliot sits on his stoop, in his hoodie, smoking a cigarette, waiting for him. Elliot’s silhouette takes Michael by surp",
      "dialogue_count": 0,
      "word_count": 1632
    },
    {
      "scene_number": 10,
      "slugline": "INT. LIMO (MOVING) - DAY  Elliot sits across from two other MEN IN BLACK. An eerie silence is the only sound that occupies the limo.  INT. SKY RISE - ELEVATOR (MOVING) - DAY  A nervous wreck, Elliot stands in the high speed elevator as it quickly climbs several stories into the air. The elevator DINGS when it reaches the top floor. The MAN IN BLACK by the doors opens the digital latch with his phone. The doors open and almost immediately we hear LOUD ARGUING. MAN IN BLACK Go ahead. ELLIOT (nervous) Where are we? MAN IN BLACK Sir, go on in.  INT. TOP FLOOR - CONTINUOUS  Elliot enters alone. He sees a number of MEN circle around a grand conference table. We only see their silhouettes, as they bicker and argue with one another. Elliot’s silhouette now joins them, dead center in the mess of black outlines. Realizing that Elliot has shown up, their loud arguing hushes into an abrupt silence. The dark shadows now face Elliot, who remains catatonic. What follows is the longest silence of Elliot’s life as he and the dark faces exchange long, tense stares. No one speaks. ELLIOT (V.O.) Please tell me you’re seeing this too... Loud, violent jazz RISES again as we push into the darkness of the menacing silhouettes, until the screen is filled with... BLACK. 63.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 226
    }
  ]
}