{
  "slug": "mudbound-2017",
  "title": "mudbound",
  "genre": "drama",
  "format": "film",
  "scenes_count": 19,
  "characters_count": 2,
  "characters": [
    "HENRY",
    "VERA"
  ],
  "total_words": 25037,
  "total_dialogue": 2,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. THE MCALLAN FARM - THE HOLE - DAY - LATER  The hole has grown longer and deeper and is now a foot over Jamie’s head - a proper grave.   Henry’s face appears in the opening of the hole: HENRY Yep, that should do it. Jamie hands the shovel up.   But then, when Henry tries to help Jamie out, it’s no use.   The hole is too deep, their hands are too wet and the walls are too slick. HENRY (CONT’D) I’ll fetch the ladder. Jamie nods and Henry moves off.   As the squelch of Henry’s boots steadily grows quiet we see the pain and worry in Jamie’s eyes.   All around him is oozing mud.   And overhead is a crude rectangle of darkening gray. Then we hear the staccato pitter-patter of RAIN DROPS.   Jamie looks up and they begin to hit his face.   At first just a few, but then they come faster. Jamie tries to climb out again.   But he slips back in.   Another try and this time he almost makes it before sliding back down. Jamie’s panic rises as he tries to claw out of the hole.   But it’s futile as his fingers cut through the mud like butter. JAMIE Henry!   HENRY!! The rain falls harder as the storm hits it’s stride.   And the hole is already starting to fill with water.   Jamie’s eyes grow wild as he suddenly throws himself against the walls like a trapped animal. ON HENRY As he limps back towards the hole with the ladder, he hears Jamie screaming. JAMIE (O.S.) (CONT’D) HENRY!! Henry hustles back to the hole but Jamie is too frantic to notice. HENRY Jamie!!   Jamie, I’m here!!  3.",
      "characters": [],
      "action_text": "Jamie snaps out of it as Henry lowers the ladder.   Jamie scrambles up and promptly doubles over trying to quell the panic. HENRY (CONT’D) You alright? JAMIE I thought maybe you decided to leave me down there. HENRY Why would I do that? Jamie glances up.   Henry’s looking at him like he’s crazy. Jamie hauls up the ladder and moves off: JAMIE Come on.   Let’s get this over with. INT. THE MCALLAN FARM HOUSE - LEAN TO - DAY  ON PAPPY MCALLAN (60’S), eyes closed, his expression tranquil.   He is dressed as we will see him throughout, in his Sunday best. WIDEN TO REVEAL Jamie and Henry standing over him.   Henry pulls a sheet over Pappy’s face then regards the ramshackle coffin made of mismatched scrap wood. HENRY I wish to hell we’d been able to get to town. Jamie moves to Pappy’s feet and Henry to his head as they get to putting the body in the coffin.   As they lift: HENRY (CONT'D) Gently now. JAMIE Right, wouldn’t want to hurt him. HENRY (sharp) That’s not the point. JAMIE Sorry, brother.   I’m just tired. With ludicrous care they lower the corpse into the box. Henry reaches for the lid and starts to put it on: HENRY Go on.   I’ll finish up here.  4. Jamie nods and throws a last look at the corpse. We STAY WITH him as he drifts outside to the porch. A HAMMER STRIKING A NAIL   gives him pause.   He produces an almost empty bottle of bourbon from his back pocket.   He downs it. EXT. THE MCALLAN FARM HOUSE - DAY  The rain and wind have slowed down.   ON A PAIR OF BOOTS as they trudge through thick, ankle-deep mud.   WIDEN TO REVEAL that the boots belong to LAURA MCALLAN (Caucasian, 30’s). She follows Jamie and Henry who carry the coffin.   Laura is more plain than pretty and there’s a tired strength in her eyes.   She stumbles in the muck and we hear her VOICE OVER: LAURA (V.O.) When I think of the farm I think of mud.   Encrusting knees and hair. Marching in boot shaped patches across the floor.   I dreamed in brown. The procession arrives at the grave.   Henry and Jam",
      "dialogue_count": 0,
      "word_count": 2833
    },
    {
      "scene_number": 2,
      "slugline": "INT. JACKSON CABIN - DAY  Florence opening the windows, chasing out dust. Exorcising fear from the corners of the cabin with her broom. FLORENCE (V.O.) I held his heartbeat in my hand. I remember every beat. He was warm and alive. I know every place in him. Florence throws open the back door. Beyond a small green garden, COTTON FIELDS stretch infinitely from her yard post. Hap and Marlon are slow-moving specks on the horizon. Florence raises her hand in a wave. FLORENCE (V.O.) And it was all I could do to not look back. One of the specks waves back. FLORENCE (V.O.) No, I don’t have favorites. INT. HAP’S CHURCH - DAY  Hap in the pulpit, sweating and quaking and exalting. Swaying trees visible through the missing boards behind him. A breeze blowing in through an empty window pane. Florence in the front row, flanked by her children, duly listening. Her eyes closed. FLORENCE (V.O.) I love them all equally. Every mother does. But during all those four years, all that time he was gone... Florence’s eyes open. FLORENCE (V.O.) I only prayed for him. Hap catches Florence’s eye, shoots her a smile. FLORENCE (V.O.) God’ll forgive me. HAP  John 14:1-3  “In my Father’s house,  are many mansions.  16.  (MORE)",
      "characters": [
        "HENRY"
      ],
      "action_text": "Hap, head hung low, is silent. Speechless, searching for  words.  CONGREGATION  That’s all right, sir. Take your  time!  Hap lifts his heartbroken eyes to the congregation.   He scans   *  the crowd, looking for a reason.   His eyes catch on Florence.   *  The words still don’t come.   *  HAP  Church...Beloved.  I don’t know I just don’t know.  (beat) You see how they done him?  Y’all seen how they done him.  Father I Stretch My Hand To Thee  OMITTED  OMITTED  16A. HAP (CONT'D) If it were not so I would have told you. I go to prepare a place for you... that’s where I am, ye may be also.” (beat) I know that brings me comfort.   It brings me comfort that One Morning My getting up is gonna be just a little bit easier than the day before.   One Morning My children are not gonna wake up in this place, they’re gonna open they eyes on a new sky. One Morning We gonna knock the boot from off our neck, we gonna shake the chains from round our feet. Oh Yes One morning! And I’m not talking about the hereafter. I’m talking about the Right Now!   Oh One Morning! I said One morning Soon... (song) OMITTED  EXT. HIGH AND WIDE OVER A FIELD OF COTTON - DAY  The shadow of a biplane crop duster BUZZES across fields. HENRY (V.O.) The army made Jamie a bomber pilot. But it’s my fault he’s up there. CUT TO: INT. HENRY’S CAR (MOVING) - DAY - SIMULATANEOUS  Henry drives on the road adjacent to the cotton field.   As the plane roars past his VOICE OVER continues: HENRY (V.O.) When Jamie was a boy he had questions about my time in the Great War.   How many Huns did I kill?   How had I been injured?   Why did they call it great?   And all I could do was make him promise that if he ever had to be a soldier he would get up to the sky.   They say battle is cleaner in the sky. CUT TO: INT. HOUSE ON EVERGREEN STREET - DAY  Henry, Laura, 2 YEAR OLD AMANDA LEIGH, and INFANT ISABELLE, finish breakfast.   Henry kisses all his girls good-bye.   He rolls a sheath of BLUEPRINTS, stuffs them in a tube stamp",
      "dialogue_count": 1,
      "word_count": 2825
    },
    {
      "scene_number": 3,
      "slugline": "INT. HENRY’S PICK-UP TRUCK (MOVING) - DAY  Hap bounces uncomfortably between Henry and Pappy.   Hap looks down and sees that his hand is ever so close to Pappy’s.   Hap shifts and we hear his VOICE OVER: HAP (V.O.) Mist McAllan was from Memphis and my guess was he didn’t know the eating end of a mule from the crapping end.   Told me he intends to bring in one of them infernal tractors.   Imagine that, using a machine to work his land instead of the hands the Lord gave him.   This man put three families off on account of that damn tractor. But I thank God we wasn’t one of them. Most times a landlord puts the colored families off first. EXT. THE MCALLAN FARM HOUSE - EVENING  The house is a large rickety shack with a deserted air.   It has a warped tin roof and shuttered windows with neither glass nor screens.   A porch runs the length of the house and connects it to a small lean-to.   There is a dirt yard with a pump.   A barn, pig wallow, chicken coop and a pasture. The two car convoy rolls to a ragged stop.   Henry, Laura, Pappy, Hap, Amanda Leigh and Isabelle pile out.   Laura is mortified.   So is Pappy.   Amanda Leigh goes running. AMANDA LEIGH Will we have chickens, daddy? HENRY You bet.   Pigs too. A recent rain has turned the ground to muck.   Laura steps into an ankle-deep mud puddle and loses her footing.   She sucks her foot out, her nice shoes are ruined. HAP You alright, Ms. McAllan? LAURA I’m fine, thank you. Henry swoops Amanda Leigh into his arms and continues, though it’s more for Laura’s benefit:  27.",
      "characters": [],
      "action_text": "HENRY You know what else, jitter bug? That river we crossed over?   I bet it’s full of catfish and crawdads. PAPPY Better git ‘im to replace them shutters or we might freeze to death. HAP I thought you was planning to live in town, suh. HENRY Plans changed. AMANDA LEIGH Momma, I have to tinkle. LAURA Okay, sweetheart, come on. Laura starts heading towards the house but Henry stops her: HENRY Uh, honey, it’s around back. LAURA Around back? HENRY It’s an outhouse.   There’s no...indoor plumbing. Henry points to a water pump not far off.   Laura is incredulous.   Henry’s eyes urge her to make the best of it. Hap’s presence makes Henry squirm even more.   Thunder rumbles in the distance. CUT TO: INT. THE MCALLAN FARM HOUSE - NIGHT  The roof leaks in several spots. Henry and Hap back in with Laura’s piano. Pappy sits on a rocking chair, smoking as he watches. HENRY Relax yourself Pappy.   We got it. Laura bustles out of one of the bedrooms. She rifles through a box.  28. LAURA The girls are done in. I need their blankets. As Laura tries to get to a particular chest she accidentally knocks over a box of books and they go tumbling out.   Hap rushes over and helps pick the books up. LAURA (CONT’D) Just stack them in the corner. HAP Yes, ma’am. (then reading the titles) A Tale of Two Cities.   Wuthering Heights. LAURA You can read? HAP My son, Ronsel, taught me.   He over there fighting under General Patton. PAPPY You mean diggin’ ditches and peelin’ potatoes. HAP No, suh, he a tank commander. PAPPY Ain’t no way the Army would turn a tank worth thousands of dollars over to a nigger.   Now my son, Jamie, there’s a fightin’ man. He’s flying   bombers . HAP My son’s a sergeant.   761st battalion.   Calls ‘em the black panthers. PAPPY Hey, hey boy! You know this one! Whaddya you call a nigger with stripes? (beat) A ra-COON! Hahahaha! Pappy enjoys his joke. Hap lowers his eyes and keeps packing up the books.  29. HENRY Where you want this piano? LAURA Let me get the girls to bed ",
      "dialogue_count": 0,
      "word_count": 1786
    },
    {
      "scene_number": 4,
      "slugline": "EXT. THE MCALLAN FARM - DAY  HENRY’S TRACTOR GROWLING across an empty, ready to be planted field.   There’s satisfaction and hope in his eyes as he surveys the expanse of his land. EXT. COTTON FIELD - DAY  Hap hoes at the earth with Sisyphean determination.   He stops to wipe sweat from his brow and sees Marlon shirtless chopping alongside him, straining to keep up. Then he sees Florence in the distance hanging laundry on a line. Lily May feeding the chickens in the coop.   Hap resumes his assault on the earth. OMITTED  EXT. THE ATWOOD CABIN - DAY  Where CARL ATWOOD (Caucasian, 30’s) leans against a tree sipping from a flask. He grunts at his very pregnant wife, VERA (Caucasian, 30’s) as she carries a heavy pail of water. ATWOOD You better go slop them hogs. INT. HENRY’S PICK-UP TRUCK - CONTINUOUS  As Henry glides by and sees Atwood sitting as Vera carries her bucket. Atwood trots out to the road, Henry slows the car to a polite roll but doesn’t stop. CARL ATWOOD You the new bossman hunh? Carl. Name’s Carl Atwood. Carl juts a dirty, nail-bitten hand into the cab. Henry holds his breath as he shakes it. CARL ATWOOD (CONT’D) Well you need anything you call me. I’m yer number one man, you hear what I’m saying? Can’t depend on a nigger to do a white man’s job. Me and my wife--that’s Vera back ‘ere-- we been here for awhile. We’ll gitcha acquainted. And listen I know now’s not the right time, but whenever you get settled in I do needa talk t’you ‘bout a new contract. ‘Bout a raise? Last owner said--  35.",
      "characters": [],
      "action_text": "HENRY I’ll catch you later Carl. Henry speeds away, leaves Carl in the dust. Carl waves after the truck. CARL ATWOOD ‘Salright I know yer busy! Nice speaking witcha Henry!  Carl’s smile drains as soon as Henry’s truck disappears over the hill. He spits in the tire track. EXT. THE MCALLAN FARM - DAY A mass of dark rain clouds in the distance.   A distant BOLT OF LIGHTNING cracks the sky.   A few beats later, THUNDER RUMBLES.   Then slowly, rain starts to fall.   A drizzle at first, then heavier and heavier. INT. THE MCALLAN FARM - BARN - DAY Henry HAMMERS repairs.   Outside it’s raining sheets.   Then, through the open doors, we see Pappy, shoulders hunched against the elements, as he hurries toward the barn.   Pappy arrives and shouts over the steady bang of Henry’s hammer: PAPPY Henry!   Your wife wants you. Isabel’s worse and the other one’s comin’ down with it too. INT. THE MCALLAN FARM HOUSE - GIRLS ROOM - MOMENTS LATER   58 Where Henry busts in to find Laura tending to Amanda Leigh and Isabelle.   Isabelle is lethargic, sweaty and wheezing and her lips are blue.   Amanda Leigh is more alert but coughing badly.   Laura is frantic: LAURA It’s whooping cough.   Go bring the doctor.   And tell your father to put water on to boil. (off Henry’s pause) Go! EXT. THE MCALLAN FARM HOUSE - MOMENTS LATER Pouring rain as Henry runs out of the house and into the truck.   He pulls out, tires spinning in the mud.  36.",
      "dialogue_count": 0,
      "word_count": 530
    },
    {
      "scene_number": 5,
      "slugline": "INT. HENRY’S PICK-UP TRUCK (MOVING) - DAY  Where Henry drives, concern all over his face.   Then he reacts to something he sees through the windshield. EXT. RICKETY BRIDGE - SIMULATANEOUS  Henry pulls up.   The river ROARS and is completely flooded. The bridge is two feet underwater.   Henry gets out of the truck and walks closer to get a look.   No way across.   Off Henry, wheels turning, panic rising... INT. THE JACKSON’S CABIN - NIGHT  Hard rain outside with occasional flashes of lightning accompanied by rumbling THUNDER.   Florence, Marlon and Lilly May, all rapt, sit around the table listening to Hap read a letter from Ronsel. HAP “ I wish you all were there to see it.   Her dress was so glittery it looked like it was made of stars. Even the white GI’s couldn’t take their eyes off her.   But tell Lilly May, even the great Lena Horne hasn’t got half the voice she does. And please tell Marlon I tried to save him some snow, but it melted. So I’ll be bringing him a glass of water instead. Ha ha. ” Smiles are exchanged. It’s like Ronsel is right there with them. HAP (CONT’D)  “And please let momma know that I--  BANGING at the door. Florence drops out of her reverie. More BANGING.   Hap answers the door-- Henry soaked and desperate. HAP (CONT’D) Mist McAllan. HENRY I need Florence.   My little girls have taken sick with whooping cough.   I can’t get to town because the bridge is washed out.   And I remember you saying she was a midwife. HAP My wife ain’t a doctor.  37.",
      "characters": [],
      "action_text": "HENRY I realize that.   But my wife... FLORENCE When they start the whooping? HENRY Isabelle’s been sick for a couple days now.   Amanda Leigh’s cough started up this afternoon. FLORENCE They still catching. HAP She can give you some remedies to take but she can’t go with you. HENRY I’ll pay you. FLORENCE I wouldn’t be able to come home for three or four days.   Who gon’ look after my own family? HENRY Please.   My wife is afraid. Florence and Hap consider Henry.   Henry’s pride and upbringing won’t allow him to beg any further. FLORENCE Let me get my things. I’ll meet you outside. Florence moves to Marlon and Lily May and hugs them both. FLORENCE (CONT’D) Be good for your father. CUT TO: INT HENRY’S TRUCK - NIGHT  Pounding Rain.   Henry watches as Florence lifts a flapping chicken out of the coop, shoves it in a burlap sack in one easy swoop. Florence strides gracefully to the truck, doesn’t miss a beat.   Henry’s confusion apparent. FLORENCE Girls gon’ need broth.  38. HENRY Oh. FLORENCE And you all don’t have chickens yet. EXT. RUTTED ROAD - NIGHT  Henry sluices through the rain, Florence watches him from the   *  side of her eyes.   *  FLORENCE (V.O.)  I didn’t have the luxury of only  loving my own children. My own  mother, I remember being blue. Blue  from the dark of the morning, when  the moon would still be up. She:  kissing me and my sister, Us:  pretending to be sleep. Us: not yet  awake. My mother blue in the  twilight, the sun not yet risen.  She: going off to work to wake and  kiss some other woman’s children in  the sunlight.  INT. HENRY’S PICK-UP TRUCK (MOVING) - NIGHT  Henry drives and Florence rides, both silent.   The road is bumpy and the rain makes the visibility minimal. FLORENCE (V.O.) My mother, blue again from the dark  of the evening, well after sunset.  After we had eaten the cold suppers  she had prepared and left for us.  After we had gone to bed and tried  to stay awake to see her, when she  had been late preparing some other  woman’s c",
      "dialogue_count": 0,
      "word_count": 1400
    },
    {
      "scene_number": 6,
      "slugline": "INT. THE MCALLAN FARM HOUSE/GIRLS’ ROOM - DAY  The room is dark until Florence opens a shutter and sunlight breaks through.   Amanda Leigh and Isabelle are sleeping comfortably in their beds.   As Florence tidies up, Amanda Leigh’s eyes flutter open and squint against the daylight. AMANDA LEIGH Momma? Florence checks Amanda Leigh’s forehead for fever and then smiles because it has broken. She checks Isabelle’s she is fine too. FLORENCE Morning. Glad to see you feeling better. (beat) I’ll go fetch your momma. INT. THE MCALLAN FARM HOUSE - DAY  Where Florence quickly packs her things, anxious to get home. Laura and Henry are in the kitchen area talking quietly. Pappy is sitting by a table, smoking. FLORENCE ‘Scuse me, Mist McAllan?   I’m ready. LAURA We can’t thank you enough for your help, Florence. FLORENCE You’re welcome. Just keep after ‘em with the tea. They’ll be fine now. LAURA We have some good news for you. (off Florence) We’d like to offer you a job. Working here.   For me.   I’ll need help with the girls, cooking, cleaning, that sort of thing. Florence flicks a look to Pappy, reeling at the prospect of dealing with him every day. LAURA (CONT’D) It means extra money for you and your family.  43.",
      "characters": [],
      "action_text": "Laura smiles, waiting for Florence to leap at the opportunity.   Off Florence, not leaping... CUT TO: INT. THE JACKSON’S CABIN - NIGHT  The kids are asleep. Hap and Florence whisper by lantern light. FLORENCE How can we say no? HAP We don’t belong to them. We pay rent, work our own crops for us. That’s it. They can’t just pick us up, set us down like we tools. FLORENCE You’re the one always talking about saving. How owning our own parcel the only way to get out from under they foot. We’re almost there. HAP I don’t want you working for them. FLORENCE I wouldn’t be working for them. I’d be working for us. (beat) I already said yes. Hap pulls away from her. HAP (quoting scripture) “For the husband is the head of the wife, even as Christ is the head of the church.” FLORENCE “An excellent wife who can find? She is far more precious than jewels. The heart of her husband trusts in her and he will have no lack of gain... Hap warms. HAP All those Sundays you really are listening, huh?  44. Florence kisses him, strokes his beard. FLORENCE And now you need to listen to me. OMITTED  OMITTED  45. OMITTED  EXT. JACKSON SHED - DAY  Florence watches as Hap inspects their prone, panting MULE. Laying on his side, he foams at the mouth, limbs paralyzed. Hap drops his head, looks up at Florence. PRELAP the sound of a GUNSHOT... INT. HAP’S CHURCH - DAY  Hap is a bullet across the pulpit. He transmutes despair into belief behind his own eyes. He rallies, forces himself to clap and sing. The church falls in with him. Florence tries to sing along but looks exhausted behind her eyes.  46.",
      "dialogue_count": 0,
      "word_count": 502
    },
    {
      "scene_number": 7,
      "slugline": "EXT. HAP’S CHURCH - DAY  Hap still in his Sunday clothes high up on a ladder.   He hammers a mismatched length of siding into place. Another DEACON patches shingles on the roof. Hap stops, takes in the sunset behind him. Marlon sprinting back up the road with building supplies. Hap puffs at the sight of his son. HAP (V.O.) Pride goeth before a fall. But I was just looking at God’s own creation. Is that pride? Is that a sin? Why? Hap’s hammer slips from his grip, he clutches after it, the ladder tumbles sideways. Hap falling in slow motion. HAP (V.O.) I can’t answer my children when they ask me. Hap now paralyzed on the ground, stiff and sputtering like the mule.   Marlon and other Deacons gathering around him. Hap’s eyes wide in surprise. Hap blacks out. OMITTED  INT. JACKSON CABIN - DAY  SERIES OF SHOTS: HAP’S FAILED CONVALESCENCE --Florence cleans Hap’s leg, a river of bloody puss runs from broken skin. Hap doesn’t cry out. His leg is discolored and misshapen. Florence wraps clean bandages around it -- Hap pushes open his bedroom window, sees FLORENCE and MARLON working the field on their own. Florence coaches the boy along, they work well past dark, invisible except for their bobbing lanterns and the percussion of seed bags bouncing against their legs -- Lilly May changes Hap's bedpan, Hap holds himself up one trembling elbow, keeps his face craned toward the wall. Shame pools in the corner of his eyes EXT. COTTON FIELD - DAY  Florence and Marlon’s hard labor apparent in symmetrical rows of furrowed new earth. A RAIN DROP kisses the ground. Then another. Another.  47.",
      "characters": [
        "VERA"
      ],
      "action_text": "HAP (V.O.) The rain came that next day, a big hard rain that packed the fields down tight as wax. INT. JACKSON CABIN - DAY  Florence and children quiet against the windows as they watch nature undo weeks of work. HAP (V.O.) Nothing we could do set there and watch it and fret for two days until it finally cleared up. INT. THE JACKSON’S CABIN - DAWN  Hap watches his family out the window as they hoist their hoes and water buckets out to the mud-slicked mess to begin again. Lilly Mae in an oversized hat has joined them this time and jogs to keep up. Four lanterns bobbing against cold daybreak. HAP (V.O.) Lingered along, lingered along. Laid in that bed knowing my wife was out doing my work for me. Florence’s hands all blistered up and I seen her rubbing her back when she thought I wasn’t looking. Hap picks up a BIRCH BASKET he’s been working on, resumes weaving. The racket of Henry’s tractor crashes the peace. HENRY (O.S.) Hap! HAP In here. Henry McAllan appears in the window, inventories the room. HENRY How’re you feeling? HAP Better by the day. HENRY I expect you are. Henry lights a cigarette.  48. HENRY (CONT’D) How much longer you gonna be laid up? HAP Doc Turpin said six weeks, it’s been four already. I bet I’ll be out there by Monday. HENRY Welp. I don’t think you gon’ have enough time to get everything in the ground. You’re skinning it close. HAP Florence and the boys are working double time sir. Plus you know fields gotta be rebroke because of that rain. HENRY Can’t control the rain. (beat) But y’all ought be well into planting by now and you haven’t even gotten your fields laid by. I can’t afford to wait any longer, you’re a farmer you understand that. HAP Yessir. HENRY As it stands, it’ll be the end of the week ‘fore they even start fertilizing.   Now if they had a mule, they’d be done in no time. HAP We lost our mule to lockjaw sir. Florence and the boys are-- HENRY You’re gonna have to rent one of my mules. You’ll go back on half shares to pay it off. The v",
      "dialogue_count": 1,
      "word_count": 3709
    },
    {
      "scene_number": 8,
      "slugline": "EXT. MCALLAN FARM HOUSE - MORNING  Laura’s hands red, raw, and forgotten between her knees. A washboard leans in a still steaming bucket of gray water. Laura stares at a dead mouse curled on the bottom step. LAURA (V.O.) Violence is part and parcel of country life. You’re forever being assailed by dead things. Amanda Leigh accidentally bumps a pair of trousers off the clothesline. Amanda Leigh jumps back from the muddy heap, braces for her mother’s censure. Laura just blinks. Amanda Leigh slings the pants back onto the line and scurries away. LAURA (V.O.) Dead mice, dead rabbits, dead possums, dead birds. EXT. MCALLAN FARM - BARN - DAY  A POSSUM CORPSE languishes beneath a tree. Ants march in and out of its pink mouth. LAURA (V.O.) You find them in the yard. You smell them rotting under the house. EXT. THE JACKSON’S CABIN - DAY  A sharp flick of the wrist, Florence SNAPS a chicken’s neck. The body flops and unspirals itself as she runs a boning knife across the jugular, spills hot blood onto the dirt. LAURA (V.O.) And then there are the creatures you kill for food. EXT. THE ATWOOD CABIN - DAY  Dirty CHILDREN straddle and climb the rickety porch railing. Vera Atwood nudges tight brown fur backward over limp squirrel haunches. LAURA (V.O.) Chickens, hogs, deer, frogs, squirrels. Pluck, skin, disembowel, debone, fry. Vera wipes her nose on her shoulder, wedges the too-dull pocketknife deeper under the skin.  65.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 246
    },
    {
      "scene_number": 9,
      "slugline": "INT. THE MCALLAN FARM - NIGHT  LAURA (V.O.) Eat. Start again. Kill. Laura runs a pipe cleaner down the barrel of a HUNTING RIFLE. LAURA (V.O.) I learned how to stitch up a bleeding wound, load and fire a shotgun, reach into the womb of heaving sow to deliver a breech piglet. My hands did these things. Laura snaps the barrel into place. LAURA (V.O.) But I was never easy in my mind. INT./EXT. THE MCALLAN FARM HOUSE - MAIN ROOM - DAY  Laura gnawing at the balls of her hands. Thick yellow callouses peel off between her teeth. She chews them thoughtfully. Stares out the window entranced. AMANDA LEIGH Momma, somebody’s coming! A handsome soldier in aviator sunglasses carrying a suitcase. Laura looks and realizes: AMANDA LEIGH (CONT’D) Uncle Jamie!! Laura shoots to her feet, smooths her hands against her apron. HENRY (O.S.) Jamie?! Henry whoops and bolts off the porch, limp and all.   Laura hangs back in the doorway.   She straightens her dress and runs her fingers through her hair. She sights her dirty fingernails, clasps her hands behind her back. Henry rocks Jamie in a tight embrace.   They separate, look at each other. Grab each other again. JAMIE You look good, brother. HENRY You look like hell.  66.",
      "characters": [],
      "action_text": "JAMIE Don’t sugarcoat it now. Laura edges closer with Amanda Leigh and Isabelle, she holds out her hands for a squeeze. Jamie smiles, scoops her into a hug instead. JAMIE (CONT’D) Laura. Sweet sister-in-law. LAURA Welcome home, Jamie. JAMIE How are you liking it here in Henry’s version of paradise? Laura starts to answer but is spared from having to lie by: PAPPY You’d think a son would see fit to greet his own father. JAMIE Dearest Pappy.   I’d forgotten how much I missed you. Said with a cut of sarcasm as Jamie shakes Pappy’s hand. HENRY (to Jamie re: Pappy) He’s missed you too.   He won’t admit it but he has. JAMIE I bet.   And he probably quit smoking and joined the NAACP too. Laura laughs and Jamie winks at her. Pappy doesn’t appreciate the joke.   Then Jamie smiles at Amanda Leigh and Isabelle. JAMIE (CONT’D) Well hello little ones.   Give your uncle Jamie a hug. The girls run and jump into his arms. INT. THE MCALLAN FARM HOUSE - NIGHT  The jitter of Jamie’s hand as he cradles a lit cigarette.   He pours a drink and finishes in a single draught. Pappy takes note, doesn’t hide his disdain. Henry pretends not to see.  67. PAPPY So what’s it like being a big hero? JAMIE I wouldn’t know. PAPPY Don’t give me that.   Army wrote me about your fancy medals.   Said they was the highest honors an airman could receive. JAMIE I was lucky.   Lotta guys weren’t. PAPPY Bet you got plenty of tail out of it too. HENRY Jamie’s never needed medals to get girls. PAPPY Damn right.   Takes after me that way.   Your momma was the prettiest girl in Greenville.   And I had ‘em all sniffing after me. Pappy smiles with his yellow teeth.   Jamie shifts in his chair and lights one cigarette with another. PAPPY (CONT’D) One thing’s for sure.   You must’a killed a whole lotta Krauts to get all them medals. (beat) Well, how many’d you take out? JAMIE I don’t know. PAPPY Take a guess. JAMIE I don’t know.   Why’s it matter? PAPPY A man ought to know how many men he’s killed.  68. Henry returns",
      "dialogue_count": 0,
      "word_count": 1692
    },
    {
      "scene_number": 10,
      "slugline": "EXT. THE JACKSON’S CABIN - DAY - SIMULATANEOUS  Hap, having heard truck, comes out of the shack.   Jamie rolls the window down and smiles drunkenly. HAP Everything alright Mist Jamie? JAMIE Everything’s fine.   I just gave Ronsel here a lift from town. Ronsel rounds the truck, makes his way up the porch stairs. JAMIE (CONT’D) I’ll be heading into town again next Saturday afternoon.   I’ll stop by, see if you want a ride. RONSEL That’d be fine. JAMIE (a nod) Hap. Then Jamie pulls out and weaves off down the road.   Off Hap, worried, as he looks at Ronsel... EXT. THE MCALLAN FARM OUTHOUSE- DAY  Laura sloshes through ankle deep mud, trudges to the leaning outhouse. Laura opens the door to the BUZZING of flies.   It’s a hot day and the smell in here is oppressive.   Breathing though her mouth, she lifts her skirt, squats and pees.   She looks down at the mud caked onto her boots and the hem of her dress. SERIES OF SHOTS: LAURA’S TORTUOUS BATHING RITUAL  LAURA (V.O.) Saturday was my favorite day of the week. --LAURA pumping water in the yard, she hauls sloshing buckets to the stove LAURA (V.O.) It was the only day I felt truly clean. --LAURA hauling steaming water to a ZINC TUB in the yard, she bathes her muddy DAUGHTERS. The water turns brown.  75.",
      "characters": [],
      "action_text": "--The girls clean-washed and napping on the porch. LAURA lowers herself into their cloudy lukewarm leftovers. Laura cups water over herself, squats in the fleeting privacy of a flapping sheet. PAPPY happens by, averts his eyes a little too slowly. LAURA (V.O.) The rest of the time, we stank. --Laura dumps the dirty water. Henry pecks her on the cheek as he drags into the yard covered in mud. OMITTED  INT. THE MCALLAN FARM HOUSE - BEDROOM - NIGHT  Where Laura looks at her expanding belly in a mirror.   She turns profile and sighs with a grin.   A beat, then Henry enters.   Laura looks at him and smiles. HENRY What? (off Laura) What is it? LAURA I’m pregnant. HENRY Oh Lord, honey...   Oh Lord! (hugging and kissing her) Woo! LAURA Shhh, you’ll wake the girls. Henry hugs her again and they are overjoyed. INT. THE MCALLAN FARM HOUSE - MAIN ROOM - DAY  Laura, with bleary eyes and a baby bump, shuffles into the room where Florence works in the kitchen. LAURA What time is it? FLORENCE Near to ten o’clock, Ms. Laura. LAURA Good heavens.  76. FLORENCE Yes’m, you definitely carrying a boy.   Ronsel and Marlon both, couldn’t wake me for nothing. (beat) Something for you on the table. Laura notices a pretty bunch of lavender wrapped up in a bouquet. LAURA Where are these from? Then Laura notices a note next to the flowers.  “Congratulations. Love, Jamie”   Laura closes her eyes and draws in the scent of the flowers. LAURA (CONT’D) He remembered I like lavender.   How sweet. Then suddenly, she has to pee like a pregnant lady. LAURA (CONT’D) Ooh, excuse me.   Nature calls. EXT./INT. THE MCALLAN FARM OUTHOUSE - CONTINUOUS  As Laura hustles to the privy.   Then she enters to find bouquets of lavender everywhere - in cans on the floor, in bunches nailed to the wall and hanging from the ceiling. Laura chuckles and smiles wide then takes a whiff.   Not bad, it’s working.   Then she lifts her skirt, squats and pees. OMITTED  EXT. SAW MILL - DAY  Jamie and Ronsel stumble from the truck t",
      "dialogue_count": 0,
      "word_count": 625
    },
    {
      "scene_number": 11,
      "slugline": "INT. SAW MILL - DAY - MOMENTS LATER  Jamie and Ronsel shimmy in through a ragged gap.   It’s old, decrepit and laden with cobwebs.   Shafts of sunlight jut in through the wooden slats. RONSEL Used to come here when I was a boy. Whenever I needed to be alone and think. JAMIE Well I love what you’ve done with the place. Jamie offers Ronsel a smoke.   Ronsel accepts and Jamie lights his own then tosses Ronsel the lighter.   Ronsel lights up and tosses the lighter back. RONSEL Why you treating me so nice? JAMIE Because you look like you could use it. RONSEL Bullshit. Jamie drags on his smoke and measures Ronsel with a drunken eye.   Then: JAMIE We were somewhere over Austria and we made contact with a swarm of Messerschmitts.   They were everywhere. HARD CUT TO: INT. B-25 BOMBER COCKPIT (MOVING) - DAY  It’s bumpy as Jamie holds the plane on course.   Suddenly bullets rip through the cockpit and the co-pilot gets shredded.   Blood splatters on Jamie and on the “LADY LUCK” pin-up girl.   Jamie is horrified and we hear his VOICE OVER: JAMIE (V.O.) Took out my tail gunner, side gunner...my co-pilot.   Made a deal with God right there.  78.  (MORE)",
      "characters": [],
      "action_text": "BACK TO: INT. SAW MILL - DAY  JAMIE Next thing you know, whole bunch of P-38’s show up.   Just like the goddamn cavalry.   They knocked those Germans right outta the sky. I swear they were angels sent by the Lord himself. HARD CUT TO: INT. B-25 BOMBER COCKPIT (MOVING) - DAY  Jamie holds the plane on it’s shaky course.   Then he looks out to his left and sees a U.S. fighter plane come close. JAMIE (V.O.) Those P-38’s, their tails were painted red.   And one of ‘em, he buzzed me after the fight.   When I looked over I thought I was seeing things.   But that fighter pilot? He was colored. The fighter pilot looks at Jamie and salutes.   Jamie returns the favor.   Then the fighter plane rolls and peels off. BACK TO: INT. SAW MILL - DAY  JAMIE Then he saluted me.   And I saluted back. (beat) Men who died that day...   They were fathers.   Husbands.   Good men.   Lot better than me. Jamie steeps in his survivor guilt.   Ronsel hands him the bottle and he drinks.   They trade a look, a bond forming.  79. JAMIE (V.O.) (CONT'D) Swore if he saved me I was gonna do something right.   I didn’t know what, but I promised anyway.",
      "dialogue_count": 0,
      "word_count": 411
    },
    {
      "scene_number": 12,
      "slugline": "EXT. THE MCALLAN FARM HOUSE - DAY  LAURA (V.O.) As usual, when anything bad happened, Henry was away.He And Pappy had gone to see about some hogs, so I was alone with the girls. Amanda Leigh and Isabelle making mudpies by the water pump. Laura , PREGNANT, mending one of Henry’s shirts. Vera Atwood, barefoot with a FILLETING KNIFE, unlatches the fence, saunters into the yard. Her sweaty dress clinging to her, her smile incongruous. VERA You need to take me to town. I’m gon’ kill Carl. Laura clocks Vera’s knife. Checks the girls who are playing on, oblivious. Laura keep panic out of her voice. LAURA Come here Vera, come sit down and tell me what’s-- VERA I don’t have   time   to sit down. He’s with her   now . He’s started in on Alma, just like he did with Renie. Amanda Leigh looking scared, she takes her sister’s hand. Laura keeps panic out of her voice. LAURA Amanda Leigh take your sister into the house. Vera directs her wild gaze on them, her knife winks in the light. LAURA (CONT’D) Go on around through the back. Go. Vera rocking back and forth on the heels of her feet now. The knife swinging at her side. LAURA (CONT’D) Vera-- Vera levels the point of the knife at Laura’s neck. VERA You got to take me to town now.  80.",
      "characters": [],
      "action_text": "LAURA Vera honestly, I--I don’t have the keys. VERA I seen you driving before. Laura grasps at a lie. LAURA And I got in trouble for it. Vera blinking, coming back to herself. LAURA (CONT’D) My husband took the keys away. Vera buries her face in her hands, lets out a feral howl. Laura hesitates, reaches for her. Vera steps backward out of her grasp. Wanders out of the yard and back down the street like a ghost. LAURA (V.O.) They found Carl’s body lying in the road halfway to town. EXT. COUNTRY ROAD - MORNING  Carl Atwood’s twisted body, dirt blowing across his face. Just another dead thing. LAURA (V.O.) Vera had stabbed him seventeen times then gone on to Marietta and turned herself in to Sheriff Thacker. MEN heft the Carl’s corpse into a truckbed. LAURA (V.O.) Florence said she’d seen her walking down Main Street, covered in blood. She said it looked like she’d bathed in it. INT. MCALLAN FARM HOUSE BEDROOM- DAY  LAURA (V.O.) (beat) But I didn’t find those details until later. I was too lost in my own misery.  81. Laura stooped, rushing through her house. She draws her bloodied hand from between her legs. Doubles over on the bed. AMANDA LEIGH What’s wrong, momma? She grunts and writhes, her hands pressed to her belly. AMANDA LEIGH (CONT’D) Momma? LAURA I need you to be a big girl and go fetch Florence from her house.   Do you remember how to get there? Amanda Leigh nods tightly.   Another cramp hits and it hurts. LAURA (CONT’D) Go.   Run as fast as you can. Amanda Leigh takes off and Laura goes to the ground.   A growing blood stain forms around her crotch. INT. THE MCALLAN FARM HOUSE - BEDROOM - NIGHT  Laura lays in the bed alone staring at the ceiling.   Her expression is stoic and empty.   She does not react when Florence enters with food and drink. FLORENCE How you feeling, Ms. McAllan? (off Laura’s silence) Brought some tea to help with the cramps. LAURA Thank you, Florence.   For everything. FLORENCE You know, I understand how you feeling right now, Ms. McAlla",
      "dialogue_count": 0,
      "word_count": 2002
    },
    {
      "scene_number": 13,
      "slugline": "INT. THE JACKSON’S CABIN - NIGHT  Crickets outside as Ronsel lays in bed by candlelight, wide awake.   He’s gazing at Resl’s gold necklace and crucifix. Then, with resolve, he stuffs it into a small tin box next to his bed and closes the lid shut.   Then he blows out the candle, still wide awake as he tries to forget her. INT. THE MCALLAN FARM - HOUSE - BEDROOM - NIGHT  Henry snores loudly.   So loudly Laura is awake.   She shakes him and he stops.   Then Laura settles in and tries to get comfortable.   But after a few moments, Henry starts snoring again.   Finally, Laura succumbs to the futility and gets up. EXT. THE MCALLAN FARM HOUSE - NIGHT - MOMENTS LATER  Laura exits the house into the moonlight.   She is startled when she nearly trips over Jamie, who is passed out with an empty bottle of bourbon.   Fully clothed and breathing heavily from drink, he is peaceful and pitiful all at once. JAMIE Nonono, I can’t swim! I can’t swim! Laura turns and sees Jamie writhing in his sleep: JAMIE (CONT’D) NO!   AHHHH!   AHHHHH!!!!   LAURA Jamie!   Jamie wake up! Laura shakes him hard.   Jamie shoots to upright, eyes darting.   Then he looks to Laura as the sense creeps back into him.   A beat, then he starts crying.   She pulls him to her and he sinks into her arms. After a few moments, Henry appears in the doorway.   Neither Laura nor Jamie notice him.   Henry says nothing.   He just stands there watching their embrace, jealousy in his eyes. Eventually, Henry moves back into the house. Then Jamie rips himself away from Laura’s embrace: JAMIE (CONT’D) I gotta get outta here. LAURA Jamie... Jamie stumbles toward Henry’s car, gets in and pulls away. CUT TO:  89.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 295
    },
    {
      "scene_number": 14,
      "slugline": "EXT. COUNTRY ROAD - NIGHT  As Henry’s car goes blazing by, swerving. INT. HENRY’S CAR (MOVING) - LATER  Jamie dozing at the wheel. He awakes and jerks the truck toward the side of the road. Overshoots, and slips into a ditch. Jamie squinting, flailing, cursing as he strips the gears trying to free the truck. JAMIE DAMN!! Jamie shuts off the engine, slumps across the wheel crying, blubbering, incoherent. He falls asleep across the wheel. Headlights still on. OMITTED  EXT. COUNTRY ROAD - MORNING  Sheriff Thacker knocking on the truck window. Jamie, red- eyed, stubbled, haggard shoulders a line of drool away. He wakes slowly, drags his sodden gaze to the window. Henry frowns over the Sheriff’s shoulder. Jamie shudders, struggles with the car door. Sheriff helps rip it open. Jamie stumbles into the light. SHERIFF THACKER We’ll get it hauled out in the morning, Henry. Jamie and Henry clamber out of the ditch in silence.   Jamie is hungover and haggard. JAMIE I’m sorry. Henry shakes his head in disgust. INT. THE MCALLAN FARM - BARN - DAY  Henry hammers repairs while Jamie finishes milking the cow. When Jamie stands he trips, falls and spills milk everywhere. Jamie laughs. HENRY You think it’s funny spilling good milk?  90.",
      "characters": [],
      "action_text": "JAMIE (slurring) Well you know what they say, no use crying over it. HENRY No, especially when it’s somebody else’s. Jamie stops grinning and turns sarcastic as he reaches into his pocket and produces some coins and crumpled bills. JAMIE I see.   What do I owe you, Henry? About a dollar and a half?   Let’s just say two to be safe. Jamie pushes the money at him.   Henry slaps his hand away and the money goes flying. A clumsy, half-hearted fist-fight. HENRY For Christ’s sake, this ain’t about the money. JAMIE Then what do you want from me? HENRY For you to be a man! JAMIE One pail of spilled milk and I’m not a man? HENRY You’re sure not acting like one. Disappear for days at a time doing whatever you damn well please.   And when you are here, you’re drunk. JAMIE I don’t answer to you. HENRY You do when you live in my house and work on my farm. JAMIE Oh, well I’m real sorry about that Mr. Boss man.   But don’t take it out on me because your little farmer dream ain’t working.   Ain’t my fault your crops are getting flooded out.  91. HENRY Well you sure as hell ain’t helping matters.   It’s like having another goddamn child to look after. JAMIE You need to open your eyes, big brother.   You’re so busy walking around here like God almighty, so wrapped up in yourself and your damn farm you can’t even see your own wife is miserable. HENRY Watch your mouth. JAMIE Or what? Henry clenches his fists and squares up. Jamie stands his ground.   But Henry restrains himself. HENRY Know what?   You be whatever kind of man you want.   Just go do it someplace else. JAMIE Fine, I’ll go to town. HENRY I don’t mean just for the night. In the morning I’m going to Greenville for a few days to see about some livestock.   I’ll expect you gone when I get back. They hold a look, neither man seeing clearly through the fog of anger and pride.   Then Henry leaves Jamie in his wake. INT. THE MCALLAN FARM HOUSE - BARN - LATER  As Jamie packs his things, frustrated, angry.   He reacts when Laura knoc",
      "dialogue_count": 0,
      "word_count": 1765
    },
    {
      "scene_number": 15,
      "slugline": "INT. THE JACKSON’S CABIN - DAY  The RUMBLE OF DISTANT THUNDER.   Florence flinches when Ronsel enters, wobbly and high. RONSEL Hi, Momma. She watches him, wants to hug him ask him where he’s been. But what comes out is: FLORENCE You hungry? RONSEL No.   Where is everybody? FLORENCE Went up to church.   Late service. Ronsel plops onto his cot.   Florence wants to talk to him, help him, but he seems so unreachable. Ronsel reaches into his pocket and pulls out the envelope from Resl.   He reaches inside and finds nothing.   Where’s the letter and the photo?   Brow furrowed, he stands and rifles through his other pockets.   Not there.   Oh shit.   Rising panic.   He lost it. RONSEL Goddammit...   No, no, no. FLORENCE What is it son? RONSEL You seen a letter? FLORENCE The letter from Germany? RONSEL Yes. FLORENCE Oh God. Let’s just wait. Don’t fret. Wait till your father-- Ronsel busts out of the shack and back into the night. FLORENCE (CONT’D) Ronsel?   Ronsel!  99.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 166
    },
    {
      "scene_number": 16,
      "slugline": "EXT. MISSISSIPPI ROAD - DAY  The threat of thunder has turned into reality of pounding rain.   Ronsel runs to the spot where he told Jamie about the letter.   He looks around desperately.   He finds the empty whiskey bottle with the label Jamie picked off. INT. THE MCALLAN FARM HOUSE - DAY  Laura is in the kitchen.   Amanda Leigh and Isabelle are on the floor playing with building blocks.   Pappy lingers by the window, anxiously waiting. PAPPY Goddammit, where is he? LAURA (re: the girls) Mind your language, please. PAPPY Just like him.   Thinking only of himself. (then) There he is. Outside the truck pulls up, weaving badly.   Jamie gets out and stumbles to the house. PAPPY (CONT’D) Drunk again. Jamie enters, rumpled, wet and smiling. JAMIE Well, hello, dear family. AMANDA LEIGH/ISABELLE Uncle Jamie! LAURA Let him dry off first. PAPPY Who in the hell was that with you in the truck? JAMIE Hello, son.   I’m glad to see you. PAPPY On the road.   When I saw you driving.   Who was that?  100.",
      "characters": [],
      "action_text": "JAMIE Ronsel Jackson.   What’s it to you? PAPPY You care to tell me why that nigger was sitting right next to you like you was two peas in a pod? JAMIE Because I was giving him a ride. PAPPY He can ride in the back. JAMIE He can ride wherever I say. Anything else? PAPPY Gimmie a cigarette.   I’m out. Jamie stares at him for a beat then pulls out an old pack of Lucky Strikes.   Pappy snatches them. It’s empty. PAPPY (CONT'D) You ain’t worth a damn, you know that? JAMIE Yeah. I do. Jamie wobbles. PAPPY Look at mister big war hero. Nothing but a drunk. LAURA Just go. PAPPY Want him all to yourself huh, gal? Too bad he’s too liquored up to be any good to you. LAURA I beg your pardon. PAPPY I’ve seen the way you sniff after him -- JAMIE Pappy.  101. PAPPY Henry may be too thick to notice, but I ain’t. EXT. MISSISSIPPI ROAD - NIGHT  Rain as Ronsel trudges up the road.   Then he reacts to the crescendo of approaching cars.   He turns and sees two sets of headlights approaching fast. Ronsel jumps down into the ditch.   But instead of passing, the cars pull up and stop.   Ronsel is a bit blinded by the headlights and the rain.   But soon several figures in white sheets and hoods pile out of the cars and rush at him. Ronsel runs but they are on him like a pack of dogs.   He fights and struggles, landing several hard punches.   But he’s outnumbered. INT. THE MCALLAN FARM HOUSE - LEAN TO - NIGHT  Rain beats on the roof as Jamie sleeps on his cot.   A beat then he is poked awake by Pappy’s cane.   Jamie bolts up, startled to see Pappy. Orris Stokes and the Sheriff are behind him in white robes. JAMIE What the hell’s going on? PAPPY Put your boots on and come with us. EXT. SAW MILL - NIGHT  Hard rain.   Orris Stokes’ car pulls up and stops among some other parked cars.   Jamie, Pappy, and Orris Stokes get out and move towards the saw mill.   We can see torch lights coming from inside the mill.   As they go, the Sheriff and Stokes don their white hoods.   This gives Jamie pause an",
      "dialogue_count": 0,
      "word_count": 2128
    },
    {
      "scene_number": 17,
      "slugline": "INT. SAW MILL - SAME TIME INTERCUT  FLORENCE Oh Lord, no... A river of blood pools from Ronsel’s mouth as Hap lowers him to the floor. Florence wraps his nude body in her headscarf. Mary Magdalene.   Marlon scoops up his brother’s legs. Florence touches his chest, howls in sorrow. She cups her hand over his chest. Bomp Bomp Bomp. FLORENCE (V.O.) I held his heartbeat in my hand. I remember every beat. He was warm and alive... Ronsel stirs and coughs. OMITTED  INT. THE MCALLAN FARM HOUSE - LEAN TO - DAY  Where Laura KNOCKS on the door. No answer.   Perplexed, she pushes the door open and enters. She reacts when she sees Pappy eyes wide open, lifeless and frozen in shock.   Then she reaches out, touches his skin and quickly recoils from the cold. She scans Jamie’s empty bed. Something on the floor catches her eye.   She reaches down and picks it up.   It’s Pappy’s white hood.   Laura holds it up and sees the eye holes and realizes. JAMIE (O.S.) It’s exactly what you think it is. Laura sees Jamie sitting in the corner clutching the pillow he smothered Pappy with.   She reacts to his beat up face: LAURA What happened to you? (off his desolate look) What happened, Jamie?   Jamie. Jamie reaches into a pocket and fishes out the crumpled photo of Resl and Ronsel’s son.   Laura looks at it, confused. JAMIE Thy got Ronsel. I tried to stop it... there were too many of them...  110.",
      "characters": [],
      "action_text": "LAURA What happened Jamie?   What did they do to him? JAMIE They made me choose. LAURA Choose what? JAMIE I had to. LAURA He’s alive? Jamie shakes his head, twists the pillow in his fists. Laura looks to Pappy, Jamie finally meets her gaze.   Laura gently pries the pillow from Jamie’s hands. INT. JACKSON CABIN - DAWN  The hush of daybreak. Ronsel laid out on the kitchen table. Florence wipes dried blood from his swollen, bruised body. She dabs at the stillness of his face. OMITTED  OMITTED  SCENE MOVED AND RE-NUMBERED TO SCENE 162  EXT. THE MCALLAN FARM - LATER  A truck drives up the road and stops.   Henry gets out with a bag.   He waves and nods to the driver.   Laura and Jamie move out towards Henry. Jamie has cleaned up and changed his clothes, but he’s still beat up.   Jamie and Laura approach Henry as he kneels at his crops.   He flicks a glance at them, more concerned with the cotton. HENRY Got back as soon as I could.   If this keeps up we’ll have to replant.   Almanac predicted-- LAURA Henry.  111. HENRY (re: Jamie’s bruises) What in the hell happened to you? LAURA Henry. HENRY What? Laura looks to Jamie.   But Jamie just shakes his head and stares at his shoes. LAURA It’s your father.   He died last night. HENRY What?   How? LAURA In his sleep.   Peacefully. Henry drops his head as the news washes over him.   Then Henry looks at Jamie and regrets their last exchange. HENRY You alright? (off Jamie’s nod) I’m glad you’re still here. Jamie nods then Henry hugs him.   Jamie, racked with guilt and pain, hugs back.   PRELAP the RUMBLE of THUNDER and... EXT. THE MCALLAN FARM - DAY  A LIGHTNING FLASH and we return to the beginning. HENRY Hap.   Can you help us out here?   We need to get this coffin in. Hap pulls his arm away and steps down.   Florence spits over the side of the wagon and glares at the McAllans. HENRY (CONT’D) Thank you for stopping. Hap takes an end of the rope, Henry eyes Marlon. HENRY (CONT’D) Maybe he can help too?  112. HAP My son is not getti",
      "dialogue_count": 0,
      "word_count": 1328
    },
    {
      "scene_number": 18,
      "slugline": "EXT. SMALL HOUSE - DAY  On a block with other small houses.   Amanda Leigh and Isabelle play in the front yard enclosed by a white picket fence. HENRY But I often miss my brother and find myself hoping he’ll come home someday.   I just pray he’s not lost forever. Laura waddles out onto the porch and we see that she is VERY PREGNANT.   Henry pulls up in his truck and gets out.   The girls see Henry and run to him. LAURA (V.O.) I would never tell Henry the truth about this child.   Jamie’s child. That would only serve to clear my conscience, not his.   It’s a small bit of dignity that I can give back to him.   Though he has no idea I’ve taken it. Henry moves up to the porch and gives Laura a hug and warm kiss on the lips.   Then he bends and kisses her belly.   And for the first time ever, we see Henry truly smile. LAURA (V.O.) I’ve learned that’s what it is to truly love someone: to give whatever you can while taking what you must. OMITTED  EXT. COTTON FIELD - DAY  Hap and Marlon hitch a NEW MULE to a NEW PLOW in a beautiful field. HAP (V.O.) This here is the loins of the land. Beautiful black soil made rich by two great rivers and the hand of the Lord himself.  116. HENRY (V.O.) (CONT'D) She knew Jamie needed to leave this place.   Just like I knew she needed to.   My family’s the only real thing that matters to me now.  (MORE)",
      "characters": [],
      "action_text": "grace of God, we got ourselves a little piece of it.   My children got something they can call they own. And can’t nothing change that. Not ever. Hap can see Florence and Lilly May over by a water pump.   He waves.   They wave back. EXT. NEW JACKSON HOME - DAY  Florence works the water pump with Lilly May at her side. FLORENCE (V.O.) If you got children, you got dreams for ‘em.   You want ‘em to live they life thinking they can do whatever it is they want to. Florence fills the bucket, Lilly May tries to help but Florence shoos Lilly May towards their newer, nicer HOME. Daffodils ring the steps. Florence wipes her sweaty brow and watches as Lilly May perches on the porch, pulls out a notebook, pencils, books : US PERSONNEL OFFICE STENOGRAPHY GRADE AND EVALUATION GUIDE. Lilly May sinks into the pages. FLORENCE (V.O.) All three of my children a gift from God.   Just let them keep shining, Lord.   No matter how hard they try to dim that light, let it shine bright as the sun. EXT. HAP’S WAGON - DAY  Ronsel’s face through slotted wood as Hap’s wagon lurches to a start. Household goods bump and rattle above him. Jamie’s voice trailing away. JAMIE (O.S.) ...give this to him...if you see him again? Pooled rain drips down from a tarp, through the cracks onto Ronsel’s closed eyes. RONSEL (V.O.) My nightmare is always the same. First I’m in a tank wearing a helmet.   Then I’m in the back of a car with a burlap sack over my head.  117. HAP (V.O.) (CONT'D) And now, with sweat, toil and the  (MORE)",
      "dialogue_count": 0,
      "word_count": 537
    },
    {
      "scene_number": 19,
      "slugline": "EXT. BERLIN STREET - DAY  We FLOAT past the war torn Brandenburg Gate.   A pair of AMERICAN SOLDIERS amble past. RONSEL (V.O.) I scream.   My lips move and I can feel the strain.   But nothing is coming out.   Nothing. EXT. BERLIN STREET - DAY  The bombed out spire of the Kaiser Wilhelm Church. RONSEL (V.O.) But should my story end there? Silenced and defeated?   Oppression, fear, deformity. It would take an extraordinary man to beat all that. EXT. BERLIN STREET - DAY  We float down a clean residential street. RONSEL (V.O.) I would have had to wean myself off laudanum and self-pity.   Then I would have had to work the fields with my father while I gathered my courage and saved my money.   And then I would have had to swallow my pride and accept help from Army buddies who had learned of my plight. I would have had to take the scholarship to Morehouse College they arranged for me and travel the four hundred miles to Atlanta alone with a little card in my shirt pocket that said ‘mute’.  INT. APARTMENT BUILDING STAIRWELL - DAY - MOMENTS LATER  A CRISP, SUITED MAN climbs the stairs, checks the addresses. We can’t see his face.   Eventually he reaches a door and stares at it for a long time.  RONSEL (V.O.) And then finally, I would have had cross the Atlantic yet again.   This time not for war.   But for love.  118. RONSEL (V.O.) (CONT'D) I’m surrounded by enemies and the stench of their hate is choking me.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 257
    }
  ]
}