{
  "slug": "my-friend-dahmer-2017",
  "title": "my friend dahmer",
  "genre": "drama",
  "format": "film",
  "scenes_count": 18,
  "characters_count": 0,
  "characters": [],
  "total_words": 18788,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. REVERE HIGH SCHOOL - HALLWAY - MORNING Jeff walks warily down the overcrowded hall, teeming with mid- 70s trends, hormones, and bravado. Platform shoes. Bell bottoms. Layered long hair and sideburns. “Sabbath Bloody Sabbath” by Black Sabbath blares from a beatbox. Two senior BULLY-JOCKS shove Jeff into the wall-- BULLY-JOCKS Outta my way, Dumber! Dumb ass. Jeff slides to the floor. He scurries to pick up his books. INT. BIOLOGY CLASS - DAY Working by himself, Jeff peers into a microscope. Several rows ahead, Derf and two rascally cohorts, KENT and MIKE, joke around. Kent wears a KISS T-shirt, almost always. He also wears a skeptical attitude. Mike is constantly jovial, with a paunchy, short physique to match. MS. BOWLES, 50s, limps around class. Her metal ankle-brace creaks and distracts, as does her lisp. MS. BOWLES Mr. John Backderf. Have you matched, um, the chloroplatz? DERF We’re workin’ on it, Miss Bowles. KENT Yeah, we’re on question sixteen to be precise. Ms. Bowles looks at their papers. Derf’s margins are filled with doodles of the girls’ butts in the row ahead. MS. BOWLES Gather your stuff. DERF Me? We’re-we’re taking turns on the scope, Miss-- MS. BOWLES Over here. With Jeff. DERF Geez. Ms. Bowles leads Derf to the back row.  10.",
      "characters": [],
      "action_text": "MS. BOWLES Jeff, keep on the same slide and give Mr. Backderf a look. Derf focuses to complete the assignment. MS. BOWLES strolls down the side of her classroom and glances in a cabinet. JEFF LOCKS EYES on a jarred FETAL PIG on a shelf, unaware Derf is now copying his answers. INT. CAFETERIA - LUNCH HOUR Jeff carries his tray from the kitchen into a boisterous cafeteria. He sulks past the stereotypical clusters of cliques at separate tables: PSYCHO-STONERS, led by LLOYD FIGG, giving each other dead arms. Lloyd’s the school’s premier delinquent. BULLY-JOCKS, led by the Quarterback, flirting with the PROM QUEEN WANNABES at the next table. BAND NERDS, led by Derf, who chortle over a Mad Magazine and trade music cassettes. Jeff finds a seat at a table against the back wall. The table is empty, except for OLIVER ZLATKA, 16, a sophomore and the school’s effeminate weakling. Jeff sits at the far end to lessen their association. OLIVER Hey. Jeff nods, keeping to himself. He shyly eats. OLIVER (CONT’D) I’m going away this summer to a wilderness camp. But in exchange my dad said I can get tickets to see Neil Sedaka in concert. JEFF My favorite. OLIVER I know. Wanna go? JEFF Um, sure. Prom Queen Wannabe WENDY WATKINS butts in-- WENDY (nudges Jeff) Hey, kid, you’re in my spot. Move.  11. Jeff slides closer to Oliver. Wendy stands on an empty chair and gets the crowd’s attention-- WENDY (CONT’D) Over here. Everyone! ANOTHER PROM QUEEN WANNABE Quiet. WENDY Quiet. Thanks. I’m only talking to the seniors, so the rest of you just keep your traps shut. As you know, I’m on the Prom Planning Committee and I’ve - we’ve put our hearts into the event which is right around the corner. It’s going to be the best prom ever and just a reminder that voting for prom King and Queen ends this Friday. And, and it just came to my-- Figg knocks over Oliver’s food tray. FIGG Hey, Faggot. She’s talking. Laughter erupts. WENDY Stop that-- FIGG You’re a little fruit. WENDY Freakin’ juniors, stop that. Fi",
      "dialogue_count": 0,
      "word_count": 656
    },
    {
      "scene_number": 2,
      "slugline": "INT. DAHMER FAMILY HOME - DEN - NIGHT Jeff stares blankly at   The Mary Tyler Moore Show   as he finishes a bowl of cereal, blocking out his parents’ argument in the living room nearby-- LIONEL (O.S.) I can’t believe you did that without discussing it first. JOYCE (O.S.) Why? You always say no to everything. LIONEL (O.S.) Joyce, I’m not paying for a crony drape hanger. JOYCE (O.S.) Interior decorator. There’s a difference. Dave sidles down the hall to get a look. LIONEL You’re not capable of this kind of project. It needs attention, dedication. Next week you’re going to want to do pottery. JOYCE That’s hardly - I’m ready to go back to work. LIONEL What - how? JOYCE (gesturing to her son) David will be eleven. Lionel shoos David away. JOYCE (CONT’D) He’s old enough to let himself in. Lynn Watkins up the street went back to work. Cynthia Bakula is selling real estate now, she’s not even around on the weekends. Even Jane Kyriazis is doing bookkeeping. LIONEL May I remind you, you’ve been back from the mental hospital for less than a year. Besides.  13.",
      "characters": [],
      "action_text": "A strained pause. LIONEL (CONT’D) (walks away) Forget it. JOYCE Forget what? LIONEL ... Just a month ago you saw a UFO fly past the house, and you chased it down the street in your bathrobe. JOYCE Jerk. INT. DAHMER FAMILY HOME - JEFF & DAVE’S BEDROOM - LATER Jeff and Dave lie in twin beds, forced to listen to their parents’ continued argument on the other side of the wall: LIONEL (O.S.) GODDAMMIT, JOYCE, I’M NOT GOING TO have this argument again! It’s not even about that guy. Dave sniffles. Jeff wipes a tearful eye. JOYCE (O.S.) You’re a fascist, you know that. LIONEL (O.S.) We’re talking about nothing. We have nothing left to say to each other-- JOYCE (O.S.) I have plenty, don’t get me started. LIONEL (O.S.) Shut the hell up. JOYCE (O.S.) I’ve had it with-- SLAM! A door shuts in a face. Absolute silence, except for Dave’s sniffling. Jeff slides over to his brother’s bed to comfort him. DAVE Are they going to hit each other? JEFF No, they just yell.  14.",
      "dialogue_count": 0,
      "word_count": 367
    },
    {
      "scene_number": 3,
      "slugline": "INT. REVERE HIGH SCHOOL - BAND ROOM - DAY MR. HICKS, the heavy-set armpit-stained band leader, conducts a rehearsal. Jeff plays trumpet. In the back row, Derf plays tuba beside Kent on percussion. Mr. Hicks wraps up the song. MR. HICKS That sounds excellent. The trumpet and clarinets were pitch perfect. A momentary proud smile crosses Jeff’s face. MR. HICKS (CONT'D) Groovy. You play like that at our year end recital and we’re gonna blow scalps off the audience... Band members sort of understand his latest idiom. MR. HICKS (CONT’D) ... Once again, from the top. EXT. REVERE HIGH SCHOOL - PARKING LOT - AFTERNOON Oliver lurks among the parked cars, hiding. Two BULLY-JOCKS find him and approach. Oliver backs up, timid. MOOSE Hey, faggot. There you are. GOOCH You’ve been avoiding us all day. Jeff appears - his backpack and trumpet case slung over his shoulder - not expecting to find anyone other than Oliver. OLIVER Hey, Jeff. GOOCH Coming to save the day, Dahmer? JEFF No, no-- MOOSE Are you going to defend this homo with your trumpet case? GOOCH I got a trumpet you can blow. JEFF I was just gonna tell him somethin’.  15.",
      "characters": [],
      "action_text": "MOOSE Go ahead, I’d like to see this. JEFF Forget it. OLIVER (blurts out) Jeff, I got the Neil Sedaka tickets for this Saturday. Jeff acts surprised, like he doesn’t know Oliver’s reference. The bullies encroach on Oliver. MOOSE You guys going together? Cute. JEFF I’m not going to any concert - it’s not my thing, you know. OLIVER But my dad said he’ll pick you up this Saturday around five... The Bully-Jocks beat up on Oliver - it’s routine. Jeff slips away, abandoning the scene for his own safety. EXT. DAHMER FAMILY HOME - AFTERNOON Lionel pulls into the driveway in his gray 1974 AMC Pacer. He grabs his leather briefcase and heads inside. INT. DAHMER FAMILY HOME - CONTINUOUS Lionel looks for Jeff around the house. He finds Dave in the den watching   Family Feud   on TV. LIONEL Hi, Dave. So where’s your brother? DAVE I think he’s in his lab. Been there for hours. LIONEL And your mother? Dave shrugs.  16. E/I. HUT - AFTERNOON LIONEL SWINGS OPEN THE DOOR AND BARGES IN. Jeff is busy examining rodent bones. The fetal pig is in a jar labeled: Baby Pig. JEFF Dad, you’re never home this early. Realizing the breadth of the dead animal collection, Lionel SNATCHES several jars for a closer look. JEFF (CONT’D) Dad!?! LIONEL That’s enough, Jeff. Lionel leaves with the jars. Jeff’s confused, but his attention quickly returns to the bone fragments. Suddenly, Lionel impetuously PULLS THE DOOR OFF THE HINGES. JEFF Dad!?! LIONEL You’re spending too much time in here. With a burst of adrenaline, Lionel stiff-arms Jeff to keep away and starts pulling more jars from the hut. JEFF Don’t, don’t... A moment later; Lionel dumps the jars in the trash can. Jeff impotently circles the hut as Lionel continues to empty it of its jars, acid, and other contents. Jeff moves to save some and prevent his father-- LIONEL (assertive) I let you have a pet cemetery when you were a kid, but then this... Dave has wandered over and watches from a distance. LIONEL (CONT’D) You need, Jeff, to come out, to com",
      "dialogue_count": 0,
      "word_count": 1188
    },
    {
      "scene_number": 4,
      "slugline": "INT. DAHMER FAMILY HOME - JEFF & DAVE’S BEDROOM - EVENING Jeff stares out the window, eyes locked on a squirrel staring right back at him, frozen on a branch. Lionel drops by. LIONEL What are you doing? JEFF Stu-studying for finals. LIONEL Can I have a minute? Look, I went through it too. It’s completely normal. Puberty is this period when your sex glands become functional and your hypothalamus signals hormonal changes that stimulate the pituitary. Then, the gonads and testis... anyway, it’s an awkward time. You mustn’t forget all boys go through it too, not just you, so there’s no reason to be shy. JEFF That’s not it, Dad. LIONEL Try me. I spoke to someone at work about - I’m ready to listen. JEFF Most everyone’s known me since elementary school, they’re not going to change their minds now. It’ll be easier after I graduate. LIONEL But you can’t - look... okay... the hut... You have to understand, Jeff, I just get mad at you sometimes because I see in you things I don’t like about myself. I spend too much time in the chemistry lab, I know. I just want you to be more active than I was, have friends in a way I never really... so... I have something. Lionel steps away. He returns and presents TWO DUMBBELLS. LIONEL (CONT’D) I picked these up at The Summit Mall. It’ll help, I think.  (MORE) 21.",
      "characters": [],
      "action_text": "You’ll be more impressive, you might find it rewarding. And maybe some girl might notice you. Right? Okay? Jeff stares back, blankly. Lionel sets the dumbbells down and withdraws. Jeff pushes them away with his heel. INT. DAHMER FAMILY HOME - JEFF & DAVE’S BEDROOM - THAT NIGHT Jeff hears his parents bickering again. JOYCE (O.S.) You have to start somewhere-- LIONEL (O.S.) It makes no sense. It’s ugly. How much? JOYCE (O.S.) Just a hundred and twenty-five dollars. LIONEL (O.S.) For a pink fucking foot stool? That’s ludicrous, Joyce! DESPERATE KNOCKS at the door. Jeff has placed the dumbbells as doorstops. He moves them away and lets in Dave. Jeff peaks out: JOYCE I think we should divorce. LIONEL Divorce!?! Over this foot stool? JOYCE YOU DON’T BELIEVE ME? Jeff barges out. INT. DAHMER FAMILY HOME - LIVING ROOM - CONTINUOUS Jeff SNAPS, vehemently knocking over a lamp. JEFF Will you stop! Stop it. LIONEL Jeff. JEFF Stop. Fighting. Seriously.  LIONEL (CONT’D) 22. JOYCE Dammit. This doesn’t concern you. LIONEL Go to your room, Jeff. Jeff stews, staring at them. Odd panting. The room is tight with tension. Then, Jeff obediently retreats. INT. DAHMER FAMILY HOME - JEFF & DAVE’S BEDROOM - CONTINUOUS Jeff locks the door. Eyes well up with tears. A jumble of emotions. He returns one dumbbell to the door and takes the other one to his bed. Dave watches as Jeff starts doing bicep curls, furiously. CUT TO: BATH, OHIO during a carefree July day. TEENAGERS roam on bicycles. CHILDREN play in a park. KIDS jump into the town pool. EXT. BATH TOWNSHIP PARK & POOL - TENNIS COURTS - DAY Jeff rallies with Neil. Jeff hits a winning forehand. NEIL Wow, nice slice. Why didn’t you hit like that last season? Jeff shrugs, not comfortable with compliments, as he fetches balls. Neil fetches his water. NEIL (CONT’D) I’m heading over to the pool to cool off. Wanna come? Jeff considers it, then shakes his head no. NEIL (CONT’D) Ah, C’mon. EXT. BATH TOWNSHIP PUBLIC POOL - DAY Jeff treads water in the",
      "dialogue_count": 0,
      "word_count": 7656
    },
    {
      "scene_number": 5,
      "slugline": "EXT. DEEP WOODS - EVENING Jeff carries his stuffed plastic bag down a narrow trail, leading him deeper into the woods. Jeff arrives at a SMALL CLEARING Hidden among thick brush and tall trees. Jeff lays the dead opossum on a rock. He takes out his (stolen) knife and meticulously dissects the road kill, first stripping away the flesh, then fondling the entrails in his hands. INT. CHARTER BUS - TRAVELING - DAY CU: JEFF’S FINGERNAILS. Remnants of dried blood underneath his thumbnail. He inconspicuously scrapes it out. It’s the start of the Senior Trip to Washington DC. Jeff laughs, with his Dahmer Fan Club buddies. A more relaxed, relieved glow on his face - a break from home does him good. DERF And the Dahmer Fan Club has to leave our mark on DC. Something grand. MIKE Boo-yah, something classic. Like what? JEFF A spazz on the White House lawn? KENT You can’t get on the White House lawn. Derf looks around. He lands on CHARLIE SMITH, the one black student, a burly guy. DERF Well for one... Charlie, as the token black in our class, let’s get some Super 8 of you on the steps of the Lincoln Memorial giving Martin Luther King’s I Have A Dream speech. CHARLIE SMITH Good one, loser. DERF The Dahmer Fan Club will stand behind you like-- CHARLIE SMITH I play football, Backderf, not charades.  62.",
      "characters": [],
      "action_text": "NEIL Cut! DERF Fine, good one. We’ll think of something. Jeff notes the brainstorm. He gazes out the window. A highway sign reads: I-70E WASHINGTON and I-76 HARRISBURG. EXT. DAYS INN, WASHINGTON DC - EVENING Teachers call out pairs of names and hand out room keys. TEACHER Jeffrey Dahmer and Charlie Smith, you have Room 327. INT. HOTEL ROOM - EVENING Charlie takes the bed by the window. Jeff hesitantly waits in the door for Charlie to settle in. From the hallway-- NEIL Dahmer, we’re right here. (whispers) If he rapes you in the middle of the night, just knock. JEFF Very funny. Jeff drops his bag on his bed. JEFF (CONT’D) So, we’re roommates, huh... CHARLIE SMITH Yep. Charlie turns on the TV, switches it to   Three’s Company.   In the clip: Janet sustains Mr. Roper’s belief that Jack is gay. CHARLIE SMITH (CONT’D) So obvious. JEFF Huh? CHARLIE SMITH Mr. Roper’s an idiot. Taxi’s on in a few.  63. Charlie crosses to the bathroom with his toothbrush. Jeff’s eyes follow. He pulls off his shirt and watches TV, shirtless. The credits roll. Jeff waits. Charlie returns, though still disinterested in chatting. JEFF I’m curious... is it hard being the only black kid in our class? CHARLIE SMITH Ehh. JEFF Your palms are less black. You think your insides are the same color as mine? Is my stomach and your stomach the same color? Charlie gives Jeff an intimidating stare, silencing the chitchat. Charlie lays supine on his bed as   Taxi   starts. Jeff sneaks a couple glances at his built body. EXT. WASHINGTON DC - VARIOUS LANDMARKS MONTAGE as Jeff AND HIS SENIOR CLASS approach the WASHINGTON MONUMENT. Neil photographs Derf on his back - the landmark his erection. They scale THE CAPITOL BUILDING steps where Jeff throws a quick spazz. They line THE WHITE HOUSE fence, like jailbirds. MR. FEDELE Kids, since World War Two, public access to The White House grounds has been increasingly restricted. But maybe you can see President Carter through a window. DERF Let us in! Let me in! Nearby, a",
      "dialogue_count": 0,
      "word_count": 952
    },
    {
      "scene_number": 6,
      "slugline": "INT. VICE PRESIDENT WALTER MONDALE’S OFFICE - DAY VICE PRESIDENT WALTER MONDALE reviews documents with a Cabinet Member. The teens wait in a line near the door, nervous. The Vice President approaches. VP WALTER MONDALE Kids, thanks for dropping by. I have a moment before a call with Indira Gandhi, who just resigned as Prime Minister of India. Where are you from? Jeff’s heart pounds, in awe. VP WALTER MONDALE (CONT’D) Ohio’s a great state. So, what do each of you want to be when you grow up? The Vice President looks to Derf. DERF I, like, want to draw cartoons, not for TV. I want to draw comics, yeah. VP WALTER MONDALE Well, that’s great, as long as you don’t draw any political ones making fun of me. DERF Of course not. Jeff stiffens. The Vice President finally reaches him-- VP WALTER MONDALE And so, what interests you? All heads turn. His friends are curious, as well. JEFF Biology. VP WALTER MONDALE Great. You should pursue that. The Vice President shakes Jeff’s clean hand. EXT. EISENHOWER EXECUTIVE OFFICE BUILDING - MOMENTS LATER They race away from the building, soaring and giddy. They gratefully pat Jeff on the back.  67.",
      "characters": [],
      "action_text": "NEIL That was the coolest thing I’ve ever done in my life. I can die now. Dahmer, I can die now, thank you. Jeff basks in their congratulations. INT. CHARTER BUS - TRAVELING - NIGHT The bus rumbles into the Revere High parking lot as the trip reaches it’s definitive end. Out the window, parents eagerly await the return of their kids. Despondent over the return, a grave curtain of darkness returns to Jeff’s face. EXT. REVERE HIGH SCHOOL - PARKING LOT - CONTINUOUS Jeff sulks back to his father’s car. LIONEL You have a good time? Y’alright? JEFF Uh-huh. It was great. LIONEL You don’t look well. You have a fever? JEFF I don’t think so. INT. DOCTOR’S OFFICE WAITING AREA - DAY A converted living room lined with chairs. Two children babble and play, just beyond arm’s length of their mother. The kids suck on new lollipops. MOTHER Careful. The mother makes departing small talk and leaves with her kids. A NURSE appears with a clipboard. NURSE Mr. Jeffrey Dahmer. ANGLE ON Jeff Dahmer seated against the far wall. JEFF Yes, that’s me. The nurse shuffles down a hallway. He follows.  68.",
      "dialogue_count": 0,
      "word_count": 395
    },
    {
      "scene_number": 7,
      "slugline": "INT. DOCTOR’S EXAMINATION ROOM - DAY Jeff waits, seated on the examination table in his underwear. He looks around at the cabinets, jars of cotton balls and gauze, the weight scale, the eye chart. Dr. York enters, sucking on a lollipop - it’s the Neighborhood Jogger at work. He glances at the clipboard. DR. YORK/NEIGHBORHOOD JOGGER Are you running a cold? JEFF (represses his excitement) I think so. I’ve been getting chills. DR. YORK/NEIGHBORHOOD JOGGER Always nice to see new patients. JEFF A physical, maybe? Jeff stiffens as Dr. York moves in, on his swivel chair. DR. YORK/NEIGHBORHOOD JOGGER Stick out your tongue. Say Ahhh. JEFF Ahhhh. DR. YORK/NEIGHBORHOOD JOGGER Tonsils look good. Turn. Let me see your ears... JEFF Do you do surgery? DR. YORK/NEIGHBORHOOD JOGGER No. JEFF Why not? DR. YORK/NEIGHBORHOOD JOGGER I like caring for patients but I’m not the type to wanna cut someone open. So this, but almost became a podiatrist. JEFF Less blood. DR. YORK/NEIGHBORHOOD JOGGER Exactly.  69.",
      "characters": [],
      "action_text": "JEFF What about what’s on a patient’s mind? DR. YORK/NEIGHBORHOOD JOGGER You mean, a psychiatrist? JEFF My mom had one. Dr. York puts his stethoscope against Jeff’s chest and back. Jeff fights his quick breathing. DR. YORK/NEIGHBORHOOD JOGGER So far, you look healthy. Okay, before I weigh you. Do you hurt when you pee? JEFF Huh? No. DR. YORK/NEIGHBORHOOD JOGGER Are you sexually active? JEFF What kind, sort of... DR. YORK/NEIGHBORHOOD JOGGER You’re at the age. No growths, okay. Pull down your underwear. Jeff pulls down his underwear. DR. YORK/NEIGHBORHOOD JOGGER (CONT’D) Cough. Cough again. Cough again. Suddenly, a stalled silence. He returns to his clipboard. An awkward tension between them, implies Jeff became erect. DR. YORK/NEIGHBORHOOD JOGGER (CONT’D) Pull up your pants, I’m finished. INT. DAHMER FAMILY HOME - JEFF & DAVE’S BEDROOM - NIGHT Standing in the same position, Jeff finishes jerking off. KNOCK. Another KNOCK. JEFF Just a minute, go away, just a minute. He sharpens up and pulls up his pants. EXT. DAHMER FAMILY HOME - DRIVEWAY - DAY The Dahmer Family rush out of the house. Lionel and the boys are in suits, Joyce in a dress. They scramble into a car.  70. LIONEL Remember, please, behave yourself. It’s my boss and work associates-- JOYCE Boys, he doesn’t even know the groom. LIONEL It’s my boss’s son, which is all the same. Kids, there’ll be some other kids there your age. INT. AKRON HOTEL - RECEPTION HALL - NIGHT It’s cocktail hour. Jeff approaches the bar. JEFF My Dad wants a Jack and coke. BARTENDER (distrustful) Where is he? JEFF Over there. BARTENDER Which one? JEFF On the other side... I swear... He spots Joyce slipping out with a sleazy PERENNIAL BACHELOR. BARTENDER Sorry, kid, he’ll have to come get it himself. Jeff leaves the bar, then swipes an almost empty cocktail glass from a busboy’s tray. AT THE TABLE - MOMENTS LATER Jeff sits, sober, with his father and brother. COWORKER Lionel, and where’s your wife? LIONEL She’s, uh, not feeling well. Head",
      "dialogue_count": 0,
      "word_count": 511
    },
    {
      "scene_number": 8,
      "slugline": "INT. AKRON HOTEL - HALLWAY - LATER Lionel finds Joyce fixing her makeup in a hallway mirror. The Perennial Bachelor idles feet away. LIONEL Where have you been? Dinner was served a half hour ago. JOYCE I was fucking that guy over there. The Perennial Bachelor slips back into the party, avoiding. JOYCE (CONT’D) He’s your boss’s cousin, staying here at the hotel. I might just stay the night. If you won’t divorce me, then deal with it. Lionel swallows his pride and anger. INT. DAHMER FAMILY HOME - NIGHT But, at home, he furiously packs two suitcases. LIONEL I’ve had enough. You’re a mess and impossible... I’m done with you. JOYCE Good. Lionel storms out. Jeff follows, helpless. EXT. DAHMER FAMILY HOME - DRIVEWAY - CONTINUOUS Lionel reverses out of the driveway. JEFF Don’t, dad, don’t... JOYCE Finally. Jeff runs off. EXT. WOODS - NIGHT Jeff stumbles through the woods, unraveling, agonizing. He WHACKS a fallen branch against a tree repeatedly... draining himself. The sound travels... A KITCHEN LIGHT turns on.  72.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 174
    },
    {
      "scene_number": 9,
      "slugline": "EXT. REVERE HIGH SCHOOL - TENNIS COURTS - DAY Jeff WHACKS tennis balls in every direction, spazzing out for his teammates. Neil stops rallying to watch. TENNIS COACH Jeff Dahmer, if you don’t clean up your act, you’re off the team. Jeff stops. He drops his racquet and WALKS OFF. EXT. REVERE HIGH SCHOOL - BRICK WALL - DAY Jeff pounds a fifth of gin in no time. Slurps the last drops. EXT. REVERE HIGH SCHOOL - PARKING LOT - DAY The Dahmer Fan Club hangs around Derf’s Chevy Vegas, listening to Buzzard Radio 101 WMMS. Jeff shuffles by. DERF Dahmer. Dahmier, boy. Wanna hang? KENT How about later? Whitey’s for burgers and arcade - they just got Death Race. JEFF Nah. Jeff veers away, disengaging... INT. REVERE HIGH SCHOOL - HALLWAY - DAY Balderelli polices the main thoroughfare. With cunning, Jeff avoids and staggers by, gripping his leather briefcase, then BUMPS into two students. They smell the alcohol. STUDENT Dang. INT. HEALTH CLASS - DAY In a dark room, a corny 1960s 16mm anti-drug educational film unspools for students. MR. LAPOLLA monitors the projector. TEENAGE BOY ON SCREEN I’m glad I didn’t jump off that bridge. It’s much higher than it looked. TEENAGE GIRL ON SCREEN I really think you should talk to someone. LSD is dangerous.  73.",
      "characters": [],
      "action_text": "NARRATOR FOR FILM Most young people think they’re stronger and have more willpower than they actually do. Jeff opens the door, tries to slip in undetected-- MR. LAPOLLA You’re late, Mr. Dahmer. Again. NARRATOR FOR FILM And one of the potentials for drug traffic is the school. Jeff trips over a student in the front row. STUDENT Watch it, Jerk! (smells Jeff’s boozy breath) Yuck, arrr, Damn. JEFF S-S-Sorry. Disoriented, Jeff BLOCKS THE LIGHT from the projector. Blinded, he struggles to find a path to an empty chair. NARRATOR FOR FILM Here the connection can be found with these peddlers of misery who prey on the unwary, the uninformed, the curious, the thrill-seekers... MR. LAPOLLA Move it, Dahmer, get a seat! NARRATOR FOR FILM ... Most young people will continue through life as normal, responsible citizens. Others, the shunted and unloved, are the candidates for the slave world of lifelong drug addiction. Jeff drops into a chair, and lowers his sad, lonely face. NARRATOR FOR FILM (CONT’D) But no-one is immune. How does it happen? Where does it start? What are the signs?  74.",
      "dialogue_count": 0,
      "word_count": 404
    },
    {
      "scene_number": 10,
      "slugline": "EXT. WOODS BEHIND SCHOOL - DAY A huddled cluster of upperclassmen get high and drink, along with one youthful teacher, MR. PITT. Passing around a joint- SNARKY SLACKER You blow up some gooks? MR. PITT If I told you, I’d have to kill you too. ANOTHER STONER Awesome. C’mon. Nearby, Jeff drinks by his lonesome. His stash and finished bottles are tucked under a log. SNARKY SLACKER Shit, dude, look, Balderelli. Heads turn. In the distance, Vice Principal Balderelli crosses the practice field, approaching. ANOTHER STONER Run. The stoners and Mr. Pitt scatter. Jeff doesn’t freak out and just lies down behind the log, playing dead. Balderelli steps into the woods and looks around. Smells the pot and goes further in... ducking under branches. He passes right by Jeff, but doesn’t see him. Then, spots a couple of stoners making a run for it across the practice field. VICE PRINCIPAL BALDERELLI Hey, I SEE YOU. STOP RIGHT THERE. Balderelli storms out of the woods and chases them down. Jeff sits back up and continues drinking. INT. YEARBOOK & SCHOOL NEWSPAPER OFFICE - DAY Drafts of the yearbook layout are pinned to a bulletin board. Derf, Neil, and Mike enthusiastically rush in. DERF It’s here! MIKE Dahmer’s got to see this. We should get him. Neil, see if he’s around.  75.",
      "characters": [],
      "action_text": "Yet, they cannot contain themselves and rip open the package. They spread out the developed club photos. Laughter swells over sight of Jeff’s face in many. DERF ... And here he is again! MIKE So bad, it’s so bad! Their YEARBOOK ADVISOR enters. She’s a snippy woman. YEARBOOK ADVISOR Good, they came in. Let’s see. She scans the photos, realizing the prank. YEARBOOK ADVISOR (CONT’D) What is Jeff Dahmer - he’s not in any of these clubs. Who did this? NEIL He’s not? YEARBOOK ADVISOR He doesn’t belong in Debate or here or this one. She grabs a wide black marker and BLOTCHES OUT JEFF’S FACE in all the club photos, a fitting symbol. INT. DAHMER FAMILY HOME - JEFF & DAVE’S BEDROOM - NIGHT Jeff stares at the wall, mouthing the lyrics to Black Sabbath’s “Iron Man” playing on his cassette player. BLACK SABBATH LYRICS Is he alive or dead? Has he thoughts within his head? We’ll just pass him there, Why should we even care? INT. DAHMER FAMILY HOME - KITCHEN - MOMENTS LATER Joyce is deeply absorbed on the phone. Jeff approaches. JOYCE (into phone) Is he out of his mind? I can’t believe that’s his position. He’s being completely irrational. JEFF Mom.  76. JOYCE (into phone) There’s no way I’d give custody of Dave over. Never in a million years. JEFF Mom. JOYCE (to Jeff) Shhh. (back to phone) He’s g-g-getting everything. I’M NOT BEING IRRATIONAL. YOU HEAR ME? YOU’RE MY LAWYER, NOT HIS. DAYS? I WON’T DISCUSS HIS CUSTODY. Jeff swipes hot dogs from the fridge and slinks out. EXT. WATKINS FAMILY HOME - MOMENTS LATER Lurking in the bushes, Jeff lures Wendy Watkins’ Irish Setter over to him with his raw hot dogs. JEFF Good dog. Jeff unlatches the dog from its run line. EXT. DEEP WOODS - DAY Jeff leads the dog to the same spot where he once tore apart the frozen opossum. Jeff takes out his knife. His teeth chatter, readying for the kill. The dog sits, panting, wagging its tail. Jeff approaches, knife in hand. He pulls the dog to his SLAUGHTER ROCK, where remnants of rodent skulls are scatte",
      "dialogue_count": 0,
      "word_count": 808
    },
    {
      "scene_number": 11,
      "slugline": "INT. OLDSMOBILE OMEGA - DAY JOYCE Just a minute, before you spend the day with your father, I need to talk to him. Stay in the car. Joyce takes a set of legal documents and gets out. Jeff quickly steals some loose cash from her purse. Both sons hear something, and look out the rear window. They watch in stunned paralysis as: Joyce and Lionel get in each other’s faces, talking forcefully. Joyce waves the legal papers in the air. Suddenly, Joyce blows her lid. She shoves Lionel. She slaps at him, yelling. Retaliating, veins pop out of Lionel’s neck. He holds her arms down. She kicks him. He kicks her back. He shoves her away. She runs right back at him, flailing her arms, losing papers to the ground. RANDOM ADULTS rush over to break it up. They separate Joyce and Lionel. Joyce is crying, and threatening him. All words are muffled inside the car as the kids watch, helpless. Joyce returns to the car, fuming. She rummages for her keys. She pulls out in a rage. DAVE I thought we were going to see Daddy. Jeff glares at his mom. EXT. REVERE HIGH SCHOOL - PARKING LOT - MORNING Jeff buys more alcohol from a HIGH SCHOOL DROPOUT. HIGH SCHOOL DROPOUT You’re my best customer. Jeff takes the large bottle of vodka and drops it into his leather briefcase, revealing how he transports it undetected. EXT. REVERE HIGH SCHOOL - PARKING LOT - LATER Rows of parked cars. It’s quiet with class in session. Coach Natale wanders through on a cigarette break and discovers Jeff behind a car drinking. COACH NATALE Hey! What’s this? On school grounds. What’s your name?  79.",
      "characters": [],
      "action_text": "JEFF J-Jeff. COACH NATALE What do you have to say for yourself? JEFF (puts on an act) It’s just... My parents are splitting up and I’m pretty depressed about it and I thought drinking might help-- COACH NATALE I’m sorry about your folks-- INT. VICE PRINCIPAL BALDERELLI’S OFFICE - MOMENTS LATER VICE PRINCIPAL BALDERELLI But that’s no excuse. It’s not as bad as it seems. JEFF Little late for that. VICE PRINCIPAL BALDERELLI It’s no excuse, period. Here’s the deal. You have a choice. I can either phone your parents and tell them what you did or you can take ten licks and not drink again. Your call. JEFF Don’t call my parents. VICE PRINCIPAL BALDERELLI Your choice... ooookay. Balderelli pulls a paddle from his desk drawer. JEFF Really? VICE PRINCIPAL BALDERELLI Bend over and grab the wall. Jeff’s stunned. He puts his hands on the wall. Balderelli winds up and WHACKS Jeff in the ass. Jeff drops to his knees. VICE PRINCIPAL BALDERELLI (CONT’D) Get up. He returns to his position and receives a paddling. Each strike is worse than the last.  80.",
      "dialogue_count": 0,
      "word_count": 468
    },
    {
      "scene_number": 12,
      "slugline": "INT. DAHMER FAMILY HOME - JEFF & DAVE’S BEDROOM - THAT NIGHT Alone, Jeff paces. A sore limp from the paddling lingers. A swirl of depraved thoughts, his dismantling family, his own inner-disgust brings him to tears. Haunted: JEFF Okay... alright... okay... alright... Tears slide down his face. He drops onto his bed and curls up beside the DEAD NEIGHBORHOOD JOGGER, stiff and speechless. Jeff finds comfort. Jeff holds the dead jogger tight. JEFF (CONT’D) (mutters) Don’t leave me, don’t leave me. CUT TO WIDE SHOT of Jeff in bed alone. The dead Neighborhood Jogger is a fantasy. INT. REVERE HIGH SCHOOL - ENGLISH CLASS - DAY Derf doodles a cartoon of Dahmer in his notebook. Class discussion of Faulkner’s   As I Lay Dying   is background noise. TAP TAP on the window gets his attention. Outside the window, Jeff POPS his head up and GROWLS at him. Derf chuckles. ENGLISH TEACHER Mr. Backderf. Are you with us? EXT. FIELD - NIGHT A field party. Bully-jocks, Psycho-Stoners, Band Nerds are all there. Beer cans. Making out. The Dahmer Fan Club shotgun beers. Several Bully-Jocks impose: BULLY-JOCK JERKOFF Look, the Rah Rah band nerds drink. KENT Yeah, whatdya you think, we’d?-- BULLY-JOCK NUMBSKULL Lightweights-- BULLY-JOCK JERKOFF Be home playin’ snare drum. BULLY-JOCK DICKWAD Snap.  81.",
      "characters": [],
      "action_text": "DERF More active than standing on the sidelines. MIKE Dang. BULLY-JOCK JERKOFF Good one. Y’alright for a turd. Where’s your mascot, Dumb Dahmer? DERF He’s not here-- BULLY-JOCK JERKOFF He gonna be your prom date, Backderf? DERF Your mother might, if she can fit in a dress. BULLY-JOCK JERKOFF Dahmer’s like your little court jester. ‘Cept he’s not hangin’ with you much anymore. DERF The fan club lives on. BULLY-JOCK JERKOFF Really? Looks like he ditched ya. NEIL Just think he’s confused-- BULLY-JOCK NUMBSKULL And looks like Neil’s a little protective. BULLY-JOCK JERKOFF And passing out cartoon flyers is getting kinda old, don’t ya think? DERF He’s still into it. BULLY-JOCK JERKOFF I dunno. Seems like you’re closing out your high school career shucked by the fool. BULLY-JOCK NUMBSKULL Makes you the fools that you are.  82. DERF We’ll get him to show up. MIKE For what? DERF Uh. A rockin’ command performance. He’ll ante up. For sure. BULLY-JOCK DICKWAD Doubt it. DERF (aside, to Kent & Mike) Let’s just do it. Let’s get him to take his spazz to the max-- KENT Derf, he’s hasn’t spazzed in weeks. NEIL He’s not really interested in a whole lot anymore. Better not-- DERF Yeah but, what if we pay him? I’ll put in five bucks. (drops cash in his cap) Gets ‘em out on a Saturday. KENT I’m in. It’ll be killer. MIKE He’ll surely blow it on booze. DERF (to Neil) C’mon, man, put in some. I’m taking a pot. MIKE Yeah, for his booze fund. Neil shakes his head, disapproving. NEIL Nuh-uh. DERF Chill, Neil. Bully-Jock Jerkoff pays in.  83. BULLY-JOCK JERKOFF I’ll believe it when I see it. Derf and Mike start to circulate, selling more tickets. INT. REVERE HIGH SCHOOL - HALLWAY Derf stops Jeff in his stuporous path. Jeff bleeps, BRAAAA. DERF Hey, Jeff. So, look, we got an idea for the Fan Club... Onlooking, Neil steps away, remarks-- NEIL (to Kent) We should just leave him alone. He’s not a side show attraction. BACK TO Derf, wrapping up his plan with Jeff-- DERF Great. Here’s thirty-two buck",
      "dialogue_count": 0,
      "word_count": 862
    },
    {
      "scene_number": 13,
      "slugline": "INT. CHEVY VEGAS - TRAVELING - TEN MINUTES LATER They pull into the Summit Mall Parking lot. Jeff burps in the backseat, already finished with his beers. EXT. SUMMIT MALL - PARKING LOT - CONTINUOUS In a daze, Jeff follows Derf and Kent to the main entrance. JEFF Where we meeting these idiots? DERF Right in front of the Orange Julius. JEFF I’m psyched. INT. SUMMIT MALL - MOMENTS LATER Derf and Kent, with Jeff trailing, spot the pack of paid SPECTATORS, numbering nearly a dozen upperclassmen. MIKE ‘Bout time! (hands Jeff cash) Another fifteen bucks. Not bad. Jeff stuffs the cash in his pocket. DERF Ok. Let’s do this. One teenager pulls out an 8mm camera. Others start commenting and snickering with anticipation. DERF (CONT’D) We present Jeff-- JEFF Jeffrey. For this I’m Jeffrey. DERF The Dahmer Fan Club presents Jeffrey Dahmer in his Command Performance. Derf pats Jeff on the back, gesturing forward... DERF (CONT’D) (whispers in Jeff’s ear) Welcome to the wild world of wasteful capitalism. Why don’t you show them what it’s all about?  86.",
      "characters": [],
      "action_text": "JEFF Glllaaaaaaadddd-lllleeee. Jeff walks down the main shopping hallway toward innocent shoppers. The teenage pack trail him at a distance. And like its origins in the high school hallway, Jeff throws an EPIC EPILEPTIC-LIKE SPAZZ, flailing his arms and legs... JEFF (CONT’D) BAAAAAAAAAAAAAAA! Unsuspecting SHOPPERS turn heads, spooking many. Some scurry away with children. The teenage-pack roars with laughter, snorting, falling over each other. THE TEENAGE-PACK Oh, Man! That was awesome. Where is he? Boo-yah. Over there? Get closer. Jeff chases THREE MIDDLE-SCHOOL GIRLS, moaning and grunting in their wake. The girls dip into the bathroom for safety. THE TEENAGE-PACK (CONT’D) Did you get that on camera? Jeff continues plodding through the mall, spooking more and more shoppers with flares of fits-- JEFF Uh! Uh! Uh! Uh! UUUUUUUUH! A mother grabs her child. An elderly couple scurry into a clothing store. Jeff approaches a FOOD CLERK passing out free samples. He takes two handfuls in his mouth. JEFF (CONT’D) What are these? FOOD CLERK Toasted sunflower seeds. Jeff SPITS THEM OUT EVERYWHERE-- JEFF PFFFFFFFT. I’m allergic, I’m allergic... AAHHHHHH --BUCKING AND RETCHING as he scampers away. JEFF (CONT’D) KOFF! KOFF! GUUUH!  87. Jeff approaches STOUFFER’S RESTAURANT, the main dining spot. He startles diners in a front table, then knocks over drinks at the next and slams his hands - SPLAT - into their food. Jeff shudders into the restaurant, spazzing down the aisle. JEFF (CONT’D) Mr. Burrrrrlmannnnn? Mr. Burlmannnn where are you? Where’s my stooooool? RESTAURANT MANAGER Hey, kid, get out-- Jeff responds with a ROARING SPAZZ, scaring all the diners. RESTAURANT MANAGER (CONT’D) OUT - OUT. LEAVE. The teenage-pack howl with laughter, bringing many to tears. The Restaurant Manager chases Jeff out. Jeff writhes his way through the tables, avoiding the manager on his way out... MONTAGE as Jeff continues his romp in & out of more stores: - JEFF POPS up from behind a clothing rack, sc",
      "dialogue_count": 0,
      "word_count": 607
    },
    {
      "scene_number": 14,
      "slugline": "EXT. SUMMIT MALL - PARKING LOT - EVENING It’s still raining. Derf and Kent head to the car. Jeff shuffles behind them. INT. CHEVY VEGAS - TRAVELING Jeff stews in the backseat, a clenched fist. Derf’s punk plays on his stereo. It’s Electric Eels’ “Agitated.” DERF Or head into Akron, check out The Bank, that new punk club? Yeah. KENT You’re alone in this punk stuff, Derf. DERF It’s a revolution of the American dream gone bust. What could be more enlightening and unsettling at the same time? JEFF Me. DERF Huh? JEFF You’re welcome. A strained silence. DERF I missed the turn onto Granger, so I’ll just take the left on West Bath back to your place. Okay, Dahmer? JEFF I’ll go to The Bank, bang some heads around. DERF I’m not sure if we’re-- JEFF (mumbles) You’re welcome. Something. Thank you. KENT You alright, dude?  89.",
      "characters": [],
      "action_text": "JEFF Just let me out. Why not drag me along? Let me out. DERF I’m gonna drive you home. JEFF Pull over. Fuck. Dickheads. Jeff HITS the back of Kent’s seat. KENT Whoa. Derf pulls his car over onto the shoulder. Jeff pushes Kent’s seat forward before the car comes to a stop. DERF Chill, chill. Jeff BLOWS his lid. JEFF Out, let me out. Kent opens his door and steps out to make Jeff’s exit easier. KENT What’s the stink? JEFF The Dahmer Fuckin’ Fan Club. Jeff kicks the door, then the side of the car. DERF YO! Jeff pounds the roof. Derf bursts out of his car. JEFF Why’d they make me do that? DERF Who? KENT What are you talking about? JEFF You. Them. Everyone. Thanks for nothing.  90. KENT You got fifty bucks, dude. JEFF No no no no. You don’t get it. Don’t get it. You don’t get it. Forget it. I thought you guys had my back. DERF We do, Dahmer. JEFF That you were my friends. Jeff jumps at Kent, an awkward mix of a punch and hug. An animalistic, askew moment. Kent wiggles away as Derf jumps in to pull them apart. It’s such an odd moment that both Derf and Kent laugh it off, which unintentionally makes it worse for Jeff. Derf and Kent withdraw to the car, unsure what to do next. Jeff catches his breath, wipes his runny nose. JEFF (CONT’D) I’m fine. DERF What’s wrong with you Dahmer? JEFF Get out of here. BRAAAA. Go. Derf and Kent get back in the Chevy Vegas. The ignition stutters before finally turning over. KENT Bye, dude. They drive off. Jeff is left in the rain, deeply despondent. INT. DAHMER FAMILY HOME - KITCHEN - MOMENTS LATER Jeff enters, sopping wet. A hollow shell of his former self. Joyce is there, uncommonly joyful and bright. JOYCE (listening, on phone) Uh huh, uh huh, great. That’s great news. I will. Tomorrow, first thing. Joyce hangs up. She turns to Jeff.  91. JOYCE (CONT’D) Great news. The divorce is finalized. JEFF Oh. JOYCE And I need you to promise to keep a secret from your father. I’m moving back to Wisconsin with your brother. JEFF When? JOYCE As soon ",
      "dialogue_count": 0,
      "word_count": 1337
    },
    {
      "scene_number": 15,
      "slugline": "INT. COUNTRY LANE PARTY CENTER - LOBBY AREA - NIGHT Jeff arrives with Bridget. He’s sober. He’s forgone traditional prom attire and instead wears brown slacks, a vest, and a western-style bow tie. Bridget is draped in a long-sleeve, white dress. She seems tentative around him. They immediately encounter the PROM PHOTOGRAPHER, who’s starting to break-down his equipment. PROM PHOTOGRAPHER Oh, okay. Step in front of the back drop. You’re my last of the night. Jeff and Bridget pose stiffly next to each other. BRIDGET You promised me you won’t drink. I told my dad you’re a friend. JEFF I know. PROM PHOTOGRAPHER Get closer. Don’t be scared, she’s not going to bite. Jeff shimmies closer and puts his arm around her, awkwardly. PROM PHOTOGRAPHER (CONT’D) Smile. Bridget smiles. Click. INT. RECEPTION HALL - MOMENTS LATER Jeff and Bridget enter the prom. Many dance to “I Love The Nightlife.” Derf and his buddies idle in the back. KENT Look who’s here. Unbelievable. Derf and his buddies observe as Jeff & Bridget make their way through the space: Jeff finds her a seat and retrieves punch. She’s charmed. BRIDGET Thank you. That’s sweet. JEFF I try. Neil approaches.  97.",
      "characters": [],
      "action_text": "NEIL Dahmer. Hey. Good to see you here. Uh, hey, I feel bad. Wanna apologize for the mall, dude. JEFF You weren’t there. NEIL I know. I couldn’t... You know, you didn’t have to... JEFF It wasn’t bad. NEIL Yeah? I don’t know... I’m sorry. The music shifts to “Hopelessly Devoted To You” as Neil’s date tugs on his arm. Neil withdraws, apology unfinished. Jeff stews. He looks around at the cruel clusters of cliques. Silencing his naysayers, Jeff leads Bridget to the dance floor, increasingly uneasy. Sweat dots his forehead. Jeff and Bridget dance, a bit out-of-sync with each other. But she enjoys herself. Copying couples around them, she places both arms around his neck. He turns rigid. BRIDGET You’re supposed to put your hands around my waist. Jeff follows her order. And grows more uncomfortable by her closeness. Her slight femininity is unpleasant to him. Their presence on the dance floor pressures Derf, Kent, and Neil to lead their dates there as well, joining in the discomfort. PENNY Hi. I’m Penny. BRIDGET Bridget. DERF Hey, Jeff, good to see you. JEFF (muddled) Congratulations.  98. DERF Why? JEFF We made it. DERF Huh? They all continue to dance, but Jeff’s composure is slipping. The cramped dance floor, bouncing heads, loud music, his own sober alertness, all compounds. He draws back. JEFF (into Bridget’s ear) I’ll be right back. Gotta pee. BRIDGET Oh, okay. Bridget remains dancing, now without a date. INT. COUNTRY LANE PARTY CENTER - LOBBY AREA - NIGHT Jeff passes by the bathroom and walks out the front door. INT. COUNTRY LANE PARTY CENTER - RECEPTION HALL - NIGHT Bridget stops dancing, now lost among the mess. She looks around. Circulates among the tables, growing increasingly upset. Jeff’s nowhere in sight. EXT. MCDONALD’S - NIGHT Jeff sits stone-faced in his AMC Pacer, eating a Big Mac. INT. COUNTRY LANE PARTY CENTER - RECEPTION HALL - NIGHT Visibly upset, Bridget hunches over in a chair sniveling. A pack of girls console her, now ignoring their dates. And, mo",
      "dialogue_count": 0,
      "word_count": 564
    },
    {
      "scene_number": 16,
      "slugline": "EXT. COUNTRY LANE PARTY CENTER - ENTRANCE - NIGHT Jeff returns. PARENT/CHAPERONE stands in his way. PARENT/CHAPERONE Where do you think you’re going? You can’t go back in? JEFF Why not? PARENT/CHAPERONE Once you’ve left. You’ve been drinking. JEFF I haven’t. I swear. PARENT/CHAPERONE Rules are rules, young man. Jeff steps away. Disappointed. Dejected. But determined to see the night through, he waits in the parking lot. EXT. COUNTRY LANE PARTY CENTER - PARKING LOT - LATER The prom lets out. Bridget’s leaving with friends. Jeff approaches. BRIDGET I’m not talking to you. They’re taking me home. JEFF Wait, no. I’m sorry. BRIDGET Where’d you go? JEFF Look, they wouldn’t let me back in but I didn’t drink. I just stepped out to get fresh air and it’s not my fault. BRIDGET This is the worst night of my life. JEFF Let me make it up to you. BRIDGET No.  100.",
      "characters": [],
      "action_text": "JEFF Please. I meant for you to have a nice evening. BRIDGET How? The prom’s over. Impossible. JEFF But, but, I promised your dad I’d bring you home safe. I promised him. Bridget stops in her tracks, now feels guilty. INT. AMC PACER - TRAVELING - NIGHT Jeff drives Bridget home. Jeff breaks the silence-- JEFF Did everyone wonder where I was? BRIDGET Yeah. So? JEFF Good. EXT. BRIDGET’S HOME - DRIVEWAY - NIGHT Like a gentleman, Jeff opens the car door for Bridget and walks her to the door. She waits, as any confused young girl might, for an obligatory kiss. Jeff shakes her hand, stiffly. JEFF Good night. Abruptly, and awkwardly, ending the evening. INT. REVERE HIGH SCHOOL - HISTORY CLASS - DAY Derf and Mike sit with their eyes locked on the clock. The minute hand clicks toward 3:15pm-- DERF Five, four, THREE, TWO, ONE! THE FINAL BELL RINGS. They burst out of their seats. MR. FEDELE Have a good summer kids. Best of luck in college.  101.",
      "dialogue_count": 0,
      "word_count": 323
    },
    {
      "scene_number": 17,
      "slugline": "EXT. REVERE HIGH SCHOOL - MOMENTS LATER Students tear out of the school, tossing notebooks in the air. Revere High sign reads: CONGRATULATIONS SENIORS GOOD LUCK! Derf, Kent, Mike, and Neil pile into the Chevy Vegas. They blast WMMS FM, which fittingly plays Queen’s “We Are The Champions.” Penny and girlfriends jump into another car to follow them out. Meanwhile, Jeff drags his feet and files onto a school bus. INT. SCHOOL BUS - CONTINUOUS Jeff walks by jubilant underclassmen and sits in the back row. A sullen pout. His one safe haven has just ended. INT. SCHOOL BUS - TRAVELING - DAY The bus stops. The last passengers file off. BUS DRIVER Hey, kid. Last stop. Jeff trudges off the bus. EXT. WEST BATH ROAD - DAY Jeff walks up the hill, approaching his home. EXT. DAHMER FAMILY HOME - DRIVEWAY - DAY Jeff finds his mother Joyce hurriedly stuffing her last couple of suitcases and boxes into the Oldsmobile Omega. JEFF Mom, you’re gonna miss my graduation ceremony. JOYCE Your father will be there. We can’t be at the same place. DAVE Can I go? JOYCE No, you’ll already be in Wisconsin with me and grandma. Get in. JEFF Now?  102.",
      "characters": [],
      "action_text": "Joyce and Dave get in and reverse out. Dave waves, naively. INT. DAHMER FAMILY HOME - MOMENTS LATER Jeff walks into the deathly silent house. Empty drawers. Missing furniture. Yet, there’s the pink foot stool. Tipped over and forgotten. He takes it in his hands and BASHES it into pieces against the brick fireplace. Leads him to collapse face down on the floor. A flood of tears. EXT. REVERE HIGH SCHOOL - PRACTICE FIELD - DAY Immediately after the graduation ceremony. A congratulatory mood. Lionel hands his camera to another father and asks for a photo of him with Jeff, wearing cap & gown. Lionel smiles proudly. Jeff is blank. INT. BACKDERF FAMILY HOME - DERF’S BEDROOM - EVENING Derf stuffs his clothes into a duffel bag. Then shoves in more random items, quickly realizing he’s missing something. INT. BACKDERF FAMILY HOME - KITCHEN - EVENING DERF Mom, I’ll be right back. Gotta grab some things at the store. CAROL But be back soon. I’m just about to put your favorite Hawaiian chicken in the oven. DERF And pick up my last paycheck. CAROL We’re sitting down, the whole family, in little over an hour. DERF Okay. Gotcha. Derf bursts out of the house. EXT. ACME FRESH MARKET - PARKING LOT - EVENING Exiting with a grocery bag of odds & ends, Derf waves back to some fellow coworkers at the registers. He jumps back in his car and speeds off.  103.",
      "dialogue_count": 0,
      "word_count": 446
    },
    {
      "scene_number": 18,
      "slugline": "INT. CHEVY VEGAS - TRAVELING - EVENING Windows down. Wind in the hair. Listening to Devo’s rendition of “[I Can’t Get No] Satisfaction,” Derf cruises the curvy back roads of his hometown for one last evening. Coming around a turn, his headlights catch a figure walking on the side of the road. It’s Jeff. Derf pulls over. DERF Jeff. Hey, man. JEFF Gweeetings! Baaa. DERF Ha. Wanna ride? Headed home? JEFF Sure. Jeff gets in. DERF I was taking the long way. I leave tomorrow morning for college. Taking some summer classes. JEFF No kidding. EXT. DAHMER FAMILY HOME - DRIVEWAY - NIGHT Derf and Jeff pull into the driveway. The house is completely dark. Not even a light over the front door. INT. CHEVY VEGAS - PARKED IN DRIVEWAY - NIGHT JEFF Wanna come in? DERF Geez, your house is dark. JEFF Yeah, I got it to myself. My dad’s living with his girlfriend and my mom’s gone to Milwaukee with my brother. DERF Are you bleeding?  104.",
      "characters": [],
      "action_text": "JEFF Nah. Just cut myself. Jeff smudges some blood remnants on his jeans. JEFF (CONT'D) So you’re off to Ohio State? DERF No, Pittsburgh, actually. Can’t wait, taking art classes over the summer. What about you? JEFF Ah, I’m going to Ohio State, I think. DERF Really. So is Mike. Whataya gonna major in? JEFF Decowating! Thmmaaa! DERF Thought Biology. JEFF Yep. A strained silence. Derf senses Jeff is lying. DERF Are you alright? JEFF Yep. We could pop open a beer. I got a spleef left?... DERF Oh, I couldn’t. I got dinner with my folks soon. Look, I’m sorry - you know, I think, wait, I do. I got some in my backseat. Been packing up... Derf reaches into the back seat and pulls out a sketch pad. JEFF You got some of me? DERF Uh, huh. Here. The whole Fan Club. And this one’s you playing fife. Was supposed to be the cover of the Yearbook but it got shot down.  105. JEFF Geez. DERF And this early one. You can have ‘em. Jeff takes a moment to look at himself in the cartoons. JEFF I don’t want these. DERF Is everything okay? JEFF Why would you say that? DERF Just askin’... I dunno... you know, high school musta been hard for you. JEFF Just had a lot on my mind. You sure you don’t wanna come in? DERF No hard feelings? JEFF I feel nothing. A strained pause. DERF We were just having fun, you know? JEFF Yeah. DERF Good. JEFF I’m just like anybody else. DERF Yeah, it’s gonna be great. We’re all heading on to exciting stuff. Mike’s blowing off the summer workin’ at the pool. Neil’s working for his dad, and Kent got an office job in Cleveland.  106. JEFF Yeah. I’ll figure it out. Just like everybody else. How ‘bout one beer and all’s forgiven? DERF Okay. They get out of the car. EXT. DAHMER FAMILY HOME - DRIVEWAY - CONTINUOUS Derf steps toward the kitchen door. Moonlight spotlights the Louisville Slugger left against the garage. Jeff is a couple of strides behind him. Jeff reaches forward and opens the door for Derf. INT. DAHMER FAMILY HOME - KITCHEN - CONTINUOUS It’s dark. Derf ste",
      "dialogue_count": 0,
      "word_count": 1070
    }
  ]
}