{
  "slug": "ncis-los-angeles-418-red-part-one-2013",
  "title": "ncis los angeles 418 red part one",
  "genre": "thriller",
  "format": "series",
  "scenes_count": 5,
  "characters_count": 0,
  "characters": [],
  "total_words": 2799,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. STARR HOUSE - DAY 24   24 Deeks enters.   The reception area has an Asian theme that wouldn’t feel out of place on a 1970s porno set. A middle- aged Asian woman behind the counter smiles, nods a welcome. RECEPTIONIST Hello, hello. You want massage? Half hour? One hour? Full body? She slides a glossy folder in front of him. RECEPTIONIST (cont’d) You choose a pretty girl, please. Deeks opens the brochure. Several Asian girls, each one numbered. DEEKS Your place has got a real retro 70s vibe, anyone ever tell you that? (looks at the list) I’ll have the... number seven. With a number three on the side - just kidding.   She’s - good hands? RECEPTIONIST Miss Daisy.   Very good.   This way please. She hustles him through a curtain.   A longish hallway with half a dozen doors on either side.   A HEAVY-SET BOUNCER sits in an alcove, sipping tea.   He clocks Deeks, fixing him with a “don’t-mess-with-the-girls” look. Deeks sees a door marked   Private , opens it, glimpses an office with a stack of hard drives and a couple of security monitors. RECEPTIONIST (cont’d) No, no, this way, this way... Deeks shoots an apologetic look at the Bouncer, who is half out of his chair. DEEKS Sorry, my bad. He’s shown into a room... EP418-90 - \"Red\" - Network Draft - 1-30-13   43.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 225
    },
    {
      "scene_number": 2,
      "slugline": "INT. STARR HOUSE - MASSAGE ROOM - DAY 25   25 There’s a massage table in the middle of the room.   Along one wall, a side table with various massage oils and folded towels.   Deeks pulls a face, takes out his phone, sends a quick text:   What’s in the box?  The door opens and an Asian woman in her 20s enters wearing a super short satin robe. DEEKS ‘Morning. ASIAN GIRL Hi.   I’m Daisy, what’s your name? DEEKS My name?   My name is - The Girl begins to untie her robe. DEEKS (cont’d) Don’t! Don’t do that just yet... The Girl moves close to him, begins to unbutton his shirt. DEEKS (cont’d) Or that. If you’d just wait for a moment... He smiles.   She smiles back uncertainly.   A beat, then the sounds of an argument from the reception area.   Deeks cracks open the door. DEEKS (cont’d) Oh no! It’s my girlfriend!   She must have followed me here.   You’ve got to hide me! ASIAN GIRL Stay here, we’ll take care of it. The Asian Girl slips through the door.   Deeks peeks out the door after her. In the reception area, Kensi is loudly remonstrating with the Receptionist. EP418-90 - \"Red\" - Network Draft - 1-30-13   44. (CONTINUED)",
      "characters": [],
      "action_text": "KENSI I know he’s here!   I just saw him come in, so don’t try to tell me he’s not! I’ll give him a massage when I catch him... The Asian Girl and the Bouncer stand halfway down the hallway watching. Deeks steps out into the hallway, crosses behind the Bouncer and slips into the security room. INT. SECURITY ROOM - DAY 26   26 Deeks pulls out a USB DRIVE, plugs it into the hard drive, types a command via the keyboard.   On screen, a ‘DOWNLOADING DATA’ alert opens. IN RECEPTION Kensi is fighting a losing battle as the Receptionist and the Asian Girl shepherd her towards the door. RECEPTIONIST You go now!   Go! Go! KENSI I’ll be waiting outside for you, Charlie Ferguson!   You hear me! The Bouncer loses interest, turns away. But instead of going to his alcove, he enters the security room. IN THE SECURITY ROOM No sign of Deeks.   He closes the door, revealing Deeks hiding behind the door.   Deeks moves.   A floorboard creaks.   The Bouncer turns - DEEKS Is this the way to the spa bath? EXT. STARR HOUSE - DAY 27   27 Deeks is unceremoniously thrown out of the house by the Bouncer, landing in a heap at Kensi’s feet. KENSI No happy ending? Deeks looks up at her. EP418-90 - \"Red\" - Network Draft - 1-30-13   45. CONTINUED: 25   25 (CONTINUED) DEEKS I wouldn’t say that... And he holds up the USB DRIVE. INT. OPS CENTER - DAY 28   28 CLOSE ON A FLATSCREEN as surveillance footage scrolls at high speed. KENSI’S VOICE Stop. Go back. Reveal Deeks and Kensi watching the footage from the USB Drive, Deeks manning the controls. ON SCREEN we see a van pull up at Santoso’s apartment.   Five men exit the apartment and climb into the van, each carrying an overnight bag. KENSI Twenty four hours ago... DEEKS No prizes for guessing what’s in the duffle bags. Deeks picks a freeze frame, zooms in and enhances it.   All of the men are Middle-Eastern in appearance.   He rolls the footage, frame by frame. HETTY’S VOICE Stop. They both turn to see Hetty standing behind them, eyes fixed to the scree",
      "dialogue_count": 0,
      "word_count": 967
    },
    {
      "scene_number": 3,
      "slugline": "INT. CADDY (DRIVING) - DAY 32   32 Kensi at the wheel, Deeks shotgun, Claire and Dave in back. KENSI Zulu Two, rolling.  INTERCUT WITH:  INT OPS CENTER - DAY 33   33 Eric and Nell working feverishly to feed them info. ERIC Comms check five-five. Target vehicle is parked in the driveway   * of an apartment building.   Four   * condos... Apartment D is a short   * term lease... IN THE EXCURSION Paris, Callen and Sam fill in the blanks. SAM Spears is the head of the snake.   * He took out Santos, who supplied his cell with weapons. CALLEN Either didn’t trust him or didn’t need him any more.   And he took out Sergeant Shaw on the off chance someone might recognize him. PARIS Spears is a Westerner.   Which do   * you think?   Money? Or ideology? CALLEN Money.   I hope. EXT. CONDOS - DAY 34   34 The Excursion and the Caddy pull up outside the condos, both teams spill out. Dave and Claire cover the back, the others enter through the front... EP418-90 - \"Red\" - Network Draft - 1-30-13   49.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 181
    },
    {
      "scene_number": 4,
      "slugline": "INT. CONDO - DAY 35   35 TRACK towards the door until CRASH, it’s violently kicked open and Sam leads them into the apartment. They rapidly spread out, clearing the rooms. We follow Paris as she pushes through the dining room into the kitchen. SAM’S VOICE Clear! KENSI’S VOICE Bedroom clear! PARIS Kitchen clear! (into her comms) Claire? CLAIRE (V.O.) (distorted) Just me and Dave and the crickets. Garage is clear. I think we’ve missed them, Paris. PARIS Come on up. She turns and heads back into the living room, where Callen has pulled on a glove and is checking the body of a FAIR HAIRED MAN in a uniform with BURBANK AIRPORT emblazoned under   * the TSA logo on his jacket.   He’s tied up, his throat   * slashed. CALLEN Airport employee. He finds his wallet on the floor.   Checks it as Paris takes a closer look at the victim’s wound. PARIS Blood’s still clotting. We didn’t miss them by much. CALLEN Cash, driver’s licence, but no airport I.D. Claire and Dave enter. Claire is holding a STENCIL in her gloved hand - TSA. EP418-90 - \"Red\" - Network Draft - 1-30-13   50. (CONTINUED)",
      "characters": [],
      "action_text": "CLAIRE Found this in the garage along with some empty spray cans.   I’m guessing they applied it to a van. Paris looks back at the victim. PARIS Fair hair, fair skin... She looks from Callen to Sam. SAM Burbank Airport. They’re going to   * drive right through security. EXT. CONDO - DAY 36   36 Both teams scramble for their vehicles. CALLEN Eric, alert Burbank authorities to lock down all vehicle access to the airport.   And we need to know which gate TSA personnel use to drive-on. ERIC (V.O.) Stand-by... EXT. AIRPORT STREET - DAY 37   37 The Excursion and the Caddy slide around a corner into a street that runs alongside side the airport. ERIC (V.O.) Callen, end of the street, Gate Three. EXT. TSA SECURITY GATE 3 - DAY 38   38 A TSA VAN slows at the security gate, ROBERT SPEARS at the   * wheel. The TSA GUARD gives Spears’ ID a cursory look, waves   * him through, as the phone rings... EP418-90 - \"Red\" - Network Draft - 1-30-13   51. CONTINUED: 35   35 (CONTINUED) Spears’ Van turns onto the perimeter road and the Excursion   * and the Caddy close fast on the gate, coming from the opposite direction. They’re separated from the TSA van by a mesh security fence. As the vehicles pass, Callen spots Spears at the wheel.   * CALLEN Sam! The blue van! SAM Hang on!   Kensi - stay close! KENSI Roger that! Sam accelerates, swings the Excursion off the road and punches through the fence, the Caddy right behind. In the TSA van, Spears reacts to the crash, sees the   * Excursion and the Caddy closing fast.   He accelerates, crashes through a secondary gate into... EXT. AIRPORT - FREIGHT AREA - DAY 39   39 The TSA van speeds between rows of air freight containers. The Excursion closes, the Caddy drawing alongside, one row across. The back doors of the TSA van suddenly swings open and two of the TERRORISTS open fire with handguns.   Instead of swerving away, Sam swerves towards them, accelerating hard.   He rams the back of the TSA van, throwing the gunmen to the floor. Another har",
      "dialogue_count": 0,
      "word_count": 659
    },
    {
      "scene_number": 5,
      "slugline": "EXT. FREIGHT YARD - DAY 40   40 A few minutes later, Callen and Paris rejoin the others. Airport Police are beginning to cordon off the area.   Claire and Kensi guard the cuffed surviving terrorist, ARI HAMAL. Sam, Deeks and Dave are clearing the terrorists’ weapons. Hetty and Granger survey the scene as Callen and Paris join them. GRANGER Scorecard? CALLEN Four dead, one lightly wounded. HETTY Spears among them?   * CALLEN Lost him in the terminal. PARIS We’ll find him.   * GRANGER   * Don’t count on it.   He got this far. Granger turns away. INT. BULLPEN - NIGHT 41   41 Paris and her team sharing the bullpen with Callen and the others. DAVE What’s in the box? DEEKS You should ask my partner that, not that she’s going to tell you. Dave turns to Kensi. DAVE So what’s in the - EP418-90 - \"Red\" - Network Draft - 1-30-13   53. (CONTINUED)",
      "characters": [],
      "action_text": "KENSI I forgot his birthday.   I felt so bad, I decided to give him something he’s always wanted.   More than anything else in the world. Deeks blinks, caught by surprise. DEEKS Really? DAVE Cool.   Claire gave me socks for my birthday.   They gave me a rash. CLAIRE You already had the rash, Dave. DAVE But it got worse.   They’re warm socks though. Deeks holds Kensi’s gaze. DEEKS You really did that? KENSI Open the box and find out. DEEKS What if you got it wrong? (beat) I mean... it doesn’t get any better than right now. I got what I’ve always wanted in a box.   There’s really no need to open it... A flicker of a smile from Kensi. KENSI No, there’s not. A beat, then -- DAVE It’s not socks, is it? Claire digs him in the ribs. DAVE (cont'd) What? EP418-90 - \"Red\" - Network Draft - 1-30-13   54. CONTINUED: 41   41 (CONTINUED) Across the room, Paris hangs up the phone, breathes a sigh of relief. CALLEN (O.S.) Danny? Claire turns to Callen.   * PARIS They’ve taken him off the critical list. CALLEN   * Good news.   * (beat)   * You’re a man down. PARIS Couple of months, that’s all. (beat) Better tell the team. And she crosses to Dave and Claire as Sam clatters down the   * stairs from ops.   * SAM   * Eric and Nell are checking   * cellphone calls with the NSA... we   * might have a lead on Spears within   * the hour.   * (beat)   * I want this guy.   * Callen gazes across at Hetty’s office.   She’s on the phone. Granger stepping up into her office. CALLEN   * You’re not the only one...   * INT. HETTY’S OFFICE - NIGHT 42   42   * Hetty hangs up the phone as Granger joins her. GRANGER Any word on Spears?   * HETTY Eric and Nell are working on it... (beat) You weren’t in San Francisco, Owen. You were in New York.   On your way to Washington. EP418-90 - \"Red\" - Network Draft - 1-30-13   55. CONTINUED: (2) 41   41 (CONTINUED) Granger smiles, doesn’t answer. HETTY (cont’d) You’ve seen his work before. GRANGER Shooter’s got a name now.   Or at least a face. HETTY Long story, i",
      "dialogue_count": 0,
      "word_count": 767
    }
  ]
}