{
  "slug": "nebraska-2013",
  "title": "nebraska",
  "genre": "drama",
  "format": "film",
  "scenes_count": 10,
  "characters_count": 0,
  "characters": [],
  "total_words": 15618,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. BILLINGS, MONTANA - LAUREL ROAD - DAY 1   1  A MAN in his 70s walks along a narrow stretch of grass separating a busy road from a railroad yard. The man walks purposefully, despite the hesitant gait and clouded eyes of a longtime alcoholic.  EXT. NEAR INTERSTATE 90 - DAY 2   2  Now a bit dazed and slowed by fatigue, the man walks past a sign reading BILLINGS CITY LIMITS. A state patrol cruiser pulls up in front of him, and a TROOPER gets out.  EXT. DAVID’S APARTMENT BUILDING - DAY 3   3  A modest structure set against a bluff.  INT. DAVID’S APARTMENT - DAY 4   4  DAVID GRANT - 40 - sits in a recliner in a sparsely-furnished living room.   He watches TV and drinks from a plastic bottle of Mountain Dew.   The doorbell rings. He gets up and opens the door.   It’s his recent ex-girlfriend NOËL with two suitcases. DAVID Hi. NOËL Hi. DAVID Wow.   Are you moving back in? NOËL No, these are yours.   I’m just returning them. DAVID Right.   Thanks.   Do you want to come in? She thinks a moment before stepping inside and maintains a  polite distance.   She notices a droopy plant.",
      "characters": [],
      "action_text": "NOËL David, you’re supposed to water that plant.   It’s a plant. David goes to the kitchen to fill a container with water. DAVID I’d like you to change your mind. NOËL What does that mean? DAVID You know what it means.   I want you to move back in. NOËL I just moved out. DAVID So two years, and we’re back to dating. NOËL I don’t know yet.   We’ll see in a while. DAVID Are we still having sex? NOËL What do you think? DAVID I think we are. NOËL And then what? DAVID Usually I fall asleep. Not in the mood for a joke -- NOËL I’ve got to go. DAVID Are you saying we can’t be together again unless we get married?  2. NOËL Get married, break up, I don’t know.   Let’s do both.   Let’s just   *  do something. The phone rings.   David and Noël wait in silence as the machine eventually picks up. KATE (ON PHONE) Pick up or call me back right now. It’s your father -- he’s gone crazy. DAVID Oh, shit. He runs to pick up the phone.   Noël starts for the door. DAVID (CONT’D) Hi, Mom.   I’m here. KATE (ON PHONE) David, it’s your mother. DAVID That’s why I said, “Hi, Mom.” KATE (ON PHONE) I don’t know what I’m going to do with him.   I’m going to put him in a goddamned nursing home is what I’m going to do.   I’m too old for this.   *  As Kate continues, David waves a weak goodbye to Noël.  INT. MONTANA SHERIFF STATION - DAY 5   5   *  WOODY GRANT sits on a folding chair in a cinder-block office. A SHERIFF leads David inside.   *  DAVID There’s the man of the hour. WOODY The what? DAVID The man of the hour. WOODY I don’t know.  Blue (10-12-2012)   3. In addition to general confusion, Woody is deaf in one ear. DAVID So you told the sheriff you were   *  walking to... Nebraska? WOODY That’s right.   To get my million dollars. DAVID What million dollars? WOODY I won a million dollars. He pulls a crinkled letter from his jacket pocket, which he unfolds and labors to read. WOODY (CONT’D) “We are now authorized to pay one million dollars to Mr. Woodrow T. Grant of Billings, Montana.” DAVID Let",
      "dialogue_count": 0,
      "word_count": 2650
    },
    {
      "scene_number": 2,
      "slugline": "EXT. HIGHWAY NEAR MOUNT RUSHMORE - DAY 20   20  David and Woody have stopped their car at a PULL-OFF offering a good if slightly distant view of the presidents. DAVID So what do you think, Dad? WOODY Doesn’t look finished to me. DAVID How do you mean? WOODY Looks like somebody got bored doin’ it.   Washington’s the only one with any clothes, and they’re just sort   *  of roughed in.   Lincoln doesn’t   *  even have an ear. David takes a look -- his dad’s got a point.   Woody turns away. WOODY (CONT’D) Okay, now we seen it.  EXT. RAPID CITY MOTEL - NIGHT 21   21  Establishing.  INT. RAPID CITY MOTEL ROOM - NIGHT 22   22  Dark.   The door cracks open, and someone sneaks in before banging into a table and crashing to the floor. DAVID Dad? David turns on the light, jumps out of bed, and finds Woody face down and motionless. DAVID (CONT’D) Oh, Jesus. He rolls Woody over and sees that he’s bleeding from a nasty gash above the eye.   David runs to the bathroom and returns with a towel. WOODY I’m all right.  Blue (10-12-2012)   16.",
      "characters": [],
      "action_text": "David presses the towel onto Woody’s forehead.  Blue (10-12-2012)   16A. DAVID You’ve been drinking. WOODY No, I haven’t.   I’m fine.   Go back to bed.  INT. EMERGENCY ROOM - NIGHT 23   23  David watches a DOCTOR finish dressing Woody’s wound. DOCTOR All righty, that ought to do it. Give me a sec. The doctor walks out of the office. NURSE (O.S.) Who you got in there? DOCTOR (O.S.) Just an old drunk who cut his head. WOODY Where’s my teeth? DAVID You lost your teeth? Woody answers with a grin -- he is missing four upper front   *  teeth.   *  DAVID (CONT’D)   *  Did you leave them at the motel? WOODY No. DAVID The tavern? WOODY I wasn’t in no tavern. DAVID Did you leave them at the place where they serve alcohol that you don’t call a tavern?  Blue (10-12-2012)   17. WOODY Must have been when I fell by the tracks.   *  The doctor returns, speaks to David. DOCTOR Considering it’s a pretty bad head wound, his age, and history of drinking, I think we should keep him in the hospital a day or so for observation. WOODY I don’t drink. DAVID You hear that, Dad?   We won’t be making Lincoln by Friday. WOODY We got till Monday. DAVID We’re going to take you back home. WOODY I’m not going home. DAVID I can’t wait until Monday.   That means I wouldn’t be back at work till Wednesday. WOODY Sellin’ record players. (to doctor) I won a million dollars. DOCTOR Congratulations.   That’ll just about cover one day in the   *  hospital. David offers a weak courtesy laugh.  INT. HOSPITAL ROOM - DAY 24   24  Woody lies in bed like a corpse -- eyes closed, mouth slack. The TV is on.   David enters, shakes his father awake.  Blue (10-12-2012)   18. DAVID I looked, but I couldn’t find your teeth anywhere.  Blue (10-12-2012)   18A. WOODY They’re by the tracks. DAVID You have to be more specific than railroad tracks that run from the Atlantic to the Pacific.   Listen, Mom talked to Uncle Ray and Aunt   *  Martha.   They’re going to put us up in Hawthorne over the weekend. WOODY I don’t want to g",
      "dialogue_count": 0,
      "word_count": 951
    },
    {
      "scene_number": 3,
      "slugline": "EXT. ABANDONED MOTEL - DAY 29   29  David pulls into the driveway.   They get out. WOODY They used to have a big sign with a great big cowboy on it.   Must have been thirty foot tall.  Blue (10-12-2012)   21A.",
      "characters": [],
      "action_text": "David looks at the motel.   Trees grow out of the windows. WOODY (CONT’D) When I was a boy, my brothers and I always wanted to come by and see the big cowboy.   Real big cowboy. DAVID Is that him? David points to a rusted sign for the RUSTLER ROOST lying amid tall weeds.   The big cowboy with the buckshot-pummeled face is no more than ten feet tall. WOODY Seemed bigger then.  MONTAGE --  TBD.  EXT. HAWTHORNE, NEBRASKA - DAY 30   30  David’s car drives slowly into the business district, a wide street with head-in parking spots filled mainly with pickup trucks.   The buildings -- many boarded up -- pre-date 1960, with some clearly over a century old.  INT. DAVID’S CAR - CONTINUOUS 31   31  Woody twists around to take it all in.  EXT. RAY AND MARTHA’S HOUSE - DAY 32   32  David stops at an old two-story house with junk cars out front.   AUNT MARTHA, a lively 70, comes out to greet them. AUNT MARTHA Well, hello there, boys. DAVID Hi, Aunt Martha. She hugs them both. WOODY Martha.  22. AUNT MARTHA Look at you, Davey.   You couldn’t have been more than 15 last time we   *  saw you.   *  DAVID That’s what I was saying to Dad. Long time. AUNT MARTHA Well, what have you got to say for yourself, Woody? WOODY Nothin’. AUNT MARTHA What’d you do to your head? WOODY Fell.   *  AUNT MARTHA You Grant brothers sure are men of few words.  INT. RAY AND MARTHA’S TV ROOM - DAY 33   33   *  Aunt Martha leads Woody and David through the house.   Seated   *  in front of the TV are Woody’s older brother RAY and David’s   *  twin layabout cousins BART and COLE, too old to be living at home. AUNT MARTHA Look who I found hanging around out front, Ray.   Your little brother Woody. UNCLE RAY I can see that.   What’s up, Woody? WOODY Nothing.   How about you? UNCLE RAY Not much. DAVID Hi, Uncle Ray. Ray nods as if not entirely sure he knows who David is.   All stare at each other a few seconds in silence.  Blue (10-12-2012)   23. AUNT MARTHA You boys remember your cousin David. DAVID (shaking han",
      "dialogue_count": 0,
      "word_count": 674
    },
    {
      "scene_number": 4,
      "slugline": "INT. RAY AND MARTHA’S DINING ROOM - DAY 34   34   *  The reunited family sit silently in the parlor.   Then -- AUNT MARTHA Ray’s foot’s been’s bothering him, ain’t that right? UNCLE RAY It’s okay.   It just hurts. David notices that Woody’s been staring off into space. DAVID Did you get that, Dad?   Dad? WOODY What? DAVID Uncle Ray’s foot hurts. WOODY I know. DAVID (to Ray) Everything else good, though? UNCLE RAY Not really. David takes a sip of the off-brand soda in his hand. AUNT MARTHA Kate says they got Ross on the news out there.   Says he’s doing real good. DAVID Yep.   Yeah, he’s doing great. AUNT MARTHA Good for him.   He was always quite a go-getter, wasn’t he ?  DAVID Yep. BART Two goddamn days from Billings! Bart and Cole laugh.  Blue (10-12-2012)   26.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 139
    },
    {
      "scene_number": 5,
      "slugline": "EXT. DOWNTOWN HAWTHORNE - DAY 35   35  As Woody walks David along the storefronts of his early life, he betrays not a shred of nostalgia. WOODY Rottle’s Clothing used to be here. (an antiques store) That was the bank. DAVID Must’ve changed a lot since your day. Woody doesn’t answer.   They continue to walk in silence as David tries to imagine Woody’s impressions. Eventually Woody leads David across the street to --  EXT. SERVICE STATION - CONTINUOUS 36   36  Woody pokes his head into the service bay, where two MEXICAN MECHANICS work on a car. WOODY I used to own this garage. DAVID Own it?   I thought the air compressor guy did. WOODY Ed Pegram. DAVID Yeah, I thought he owned it. WOODY We were partners. DAVID Huh.   What happened? WOODY I sold it to him. DAVID For how much? WOODY Eight hundred.   *  Blue (10-12-2012)   27.",
      "characters": [],
      "action_text": "DAVID You sold him half of a business for eight hundred dollars? WOODY That was a lot of money back then. BIG MECHANIC You need something? DAVID My dad here used to own this place. BIG MECHANIC Oh yeah? Woody and David enter.   Woody steps to the car they’re working on and peers under the hood. WOODY So what you fellas have going on here? SMALL MECHANIC Oh, we just replacing the transmission cooler lines. WOODY Do you know Ed Pegram? BIG MECHANIC   *  Who? WOODY Ed Pegram.   Used to own this place too. They look at each other and shake their heads. WOODY (CONT’D) (to Small Mechanic) Glasses!   You’re using the wrong   *  wrench. DAVID Come on, Dad.   Let’s get going. (to the mechanics) Good talking to you. The mechanics stare after David and Woody as they walk away. WOODY That moron was using the wrong wrench.  Blue (10-12-2012)   28.",
      "dialogue_count": 0,
      "word_count": 299
    },
    {
      "scene_number": 6,
      "slugline": "EXT. DOWNTOWN HAWTHORNE - DAY 37   37  They continue their stroll until happening upon the SODBUSTER BAR.   Woody stops. WOODY Let’s see if there’s anyone I know.  INT. SODBUSTER SALOON - DAY 38   38  Inside, Woody makes a perfunctory scan for familiar faces, but it’s practically empty.   *  DAVID Pretty quiet in here. David starts toward the door, but with automatic reflex Woody takes a seat at the bar.   David reluctantly follows -- what the hell? A perky, earthy FEMALE BARTENDER comes over. BARTENDER Hi, boys.   What can I get you today? WOODY Beer. BARTENDER What kind of beer you want? WOODY Anything’s fine.   Coors if you got it. DAVID I’ll have a Mountain Dew. BARTENDER Fresh out of Coors.   Don’t come in   *  till Monday.   *  WOODY   *  Bud then.   *  BARTENDER   *  Bud and a Dew.   *  WOODY   *  Tom Varnik still own this place?  Blue (10-12-2012)   29.",
      "characters": [],
      "action_text": "BARTENDER Never heard of him.   Must be before my time. WOODY (to David) I used to know everybody in here.   *  Blue (10-12-2012)   29A. DAVID Is this where you had your first drink? WOODY No, Dad used to let me sip his beer. DAVID So I guess you kept up that fine   *  family tradition with Ross and me. WOODY You liked it, as I recall. DAVID I was like six. WOODY A sip of beer isn’t going to kill you when you’re only six.   I   *  thought you drank.   Come on, have a beer with your old man. DAVID I’ve been trying to give it up. WOODY What for? DAVID I was starting to... It just wasn’t helping. WOODY I suppose now you’re okay. The bartender sets the drinks down. DAVID Say, could I have a beer too? BARTENDER You betcha. DAVID Going to drink with my dad.  LATER - AT A BOOTH - DUSK   *  Empty bottles on the table, dimmer light from outside, and   *  more PATRONS in the bar suggest time has passed.  Blue (10-12-2012)   30. Woody is about the same, but David is a little drunk.   He finishes a beer and has another on deck. DAVID   *  Did you and Mom used to come here? WOODY Sure. DAVID I didn’t tell you that Noël and I broke up. WOODY How’s that? DAVID Noël -- you know, the girl I’ve been living with for the past two years.   She moved out.   We broke up. WOODY (no idea) Oh. DAVID Maybe I should have asked her to get married, I don’t know.   I just... I just never felt sure, you know what I mean?   How are you supposed to know when you’re sure? Were you sure? WOODY How’s that? DAVID How did you and Mom end up getting married? WOODY She wanted to. DAVID You didn’t?  Blue (10-12-2012)   31. WOODY I figured what the hell. DAVID Were you ever sorry you married her? WOODY All the time. David sips his beer, eager to take this in. WOODY (CONT’D) It could have been worse. DAVID You must have been in love.   At least at first. WOODY Never came up.   *  DAVID Did you ever talk about having kids   *  -- how many you wanted, stuff like   *  that?   *  WOODY Nope.   *  DAVID Then why d",
      "dialogue_count": 0,
      "word_count": 2169
    },
    {
      "scene_number": 7,
      "slugline": "EXT. HAWTHORNE CEMETERY - DAY 47   47  Flowers in hand, Kate offers a running commentary as she leads Woody and David slowly past the headstones. KATE That’s Woody’s mother Sara.   She   *  hated me because she wanted him to marry someone who’d milk the cows, but I said I ain’t fiddlin’ with no cow titties.   I’m a city girl.   *  The good lord did not do Sara any favors in the looks department. More a man’s face than a woman’s, really.   I was pretty, so she resented me.   You knew your mother was ugly, right, Woody? Woody looks at Kate, then stares at his mother’s grave. DAVID How did she die? KATE Saw herself in the mirror one day! No, cancer. (moving on) And there’s the old Swede Tolf.   A   *  good man, your grandpa.   Never said much.   That farm just ruined him. (to Woody) You’re lucky I took you away from there. Woody nods slightly as he looks at his father’s leaf-covered grave.   *  KATE (CONT’D) That’s Woody’s brother David.   You were named after him.   He died of scarlet fever when he was only two. Woody slept in the same bed with him but never got it. David contemplates the sight of his own name on a headstone. KATE (CONT’D) Here’s Woody’s little sister Rose. She was only nineteen when she got killed in a car wreck near Wausa.  Blue (10-12-2012)   42.  (MORE)",
      "characters": [],
      "action_text": "What a whore.   I liked Rose, but my   *  God, she was a slut. DAVID Mom, come on. KATE I’m just telling the truth.   She was screwing guys in back of the Hawthorne Creamery when she was only... (a whisper) ...fifteen. DAVID Where’s your family? KATE They’re over at the Catholic cemetery.   We’ll go there later. Catholics wouldn’t be caught dead around all these damn Lutherans.   *  Now there’s Delmer, Woody’s cousin. He was a drunk.   One time we were wrastlin’ and he felt me up. Grabbed a handful of boob, and Woody was right there and didn’t have a clue, did you, Woody? DAVID Jesus, Mom. KATE My goodness, I didn’t know Keith   *  White was here.   When did he die? Keith White.   He wanted in my pants too, but oh, he was so boring. Hearing enough, Woody and David head toward the car.   Kate remains at Keith’s grave and pulls her dress up. KATE (CONT’D) See what you could’ve had, Keith, if you hadn’t talked about wheat all the time?  INT. RAY AND MARTHA’S KITCHEN - DAY 48   48  Kate and Martha talk while Ray and Woody sit silent.  Blue (10-12-2012)   43.  KATE (CONT’D) KATE Peggy got knocked up again?   At her age?   That old cow must be fifty. AUNT MARTHA She just looks fifty.   That’s what pig farming will do to you.  EXT. RAY AND MARTHA’S PORCH - DAY 49   49  David sits with his cousins Cole and Bart.   No one speaks for a moment.   Then -- BART You got any other cars? DAVID No, just that one. BART What’s the engine? DAVID It’s, uh, a four-cylinder. BART Yeah, but what size? DAVID I don’t really know. COLE What’s your brother drive? DAVID Who, Ross? COLE Yeah, what’s he drive? DAVID He has a Kia Sedona, and Marcie’s   *  got a Nissan Pathfinder.   She carts the kids around a lot. BART So you all got Jap cars? DAVID   *  Actually, Kia is Korean.   *  Blue (10-12-2012)   44. This clarification is met with a hostile, blank stare.   *  Just then a HIGH SCHOOL KID with a camera pulls up on a bicycle. HIGH SCHOOL KID Hey, is this where I can find Mr. Woody Grant? COLE ",
      "dialogue_count": 0,
      "word_count": 5052
    },
    {
      "scene_number": 8,
      "slugline": "EXT. FARMHOUSE - DAY 69   69  The car stops.   Ross and David emerge and walk up to the front door.   David knocks. Moments later they walk to the BARN.   Woody and Kate watch from the backseat. KATE What in the hell are they doing? (yelling out the window) Will you two knock off this foolishness? David opens the barn door, and the two of them go inside. Moments later they come out lugging a rusty old air compressor. Ross opens the back of the car.   They put the compressor inside, jump in the car, and Ross speeds away.  INT. ROSS’S CAR - RURAL ROAD - DAY 70   70  Beaming and out of breath, David turns around to Woody. DAVID Dad, you finally got your compressor back. WOODY That’s not my compressor. DAVID Sure it is. WOODY Mine didn’t look anything like that. DAVID It has to be yours.   It’s an old compressor we found in Ed Pegram’s barn. WOODY That wasn’t Ed’s barn. ROSS What are you talking about? WOODY That’s the Westendorf place.  71.",
      "characters": [],
      "action_text": "KATE Oh, that’s right. Ross slows the car. KATE (CONT’D) Right, the Pegrams live closer to   *  town.   I got confused.   Ed and his   *  wife Dorothy.   God, what a pig she was. DAVID Anything you want to say about the Westendorfs? KATE No, they’re good folks. Releasing a loud exhale, Ross looks at David and starts turning the car around. KATE (CONT’D) They had some tough times.   Lost a child.   Almost went broke, but they   *  worked hard and saved the farm. Salt of the earth, the Westendorfs. They really didn’t deserve you boys doing that to them. DAVID (to Woody) Why didn’t you tell us that wasn’t Ed’s house? WOODY I didn’t know what the hell you were doing. ROSS   *  Have you ever seen us steal machinery before? WOODY I never know what you boys are up to. ROSS   *  Why didn’t you say it wasn’t yours? WOODY I thought you wanted it.  Blue (10-12-2012)   72. ROSS Why would we want an old compressor? WOODY That’s what I couldn’t figure out.  EXT. FARMHOUSE - DAY 71   71  Back in the driveway, David and Ross return the compressor   *  into the barn.   *  Meanwhile, another CAR comes up the driveway.   GEORGE AND JEAN WESTENDORF get out and approach Ross’s car to find Woody and Kate in the back seat. KATE Hi, George.   Hi, Jean.   Remember us?   Kate and Woody Grant? GEORGE WESTENDORF Oh, sure.   How you doin’?   *  KATE Just fine.   We were passing by, so we thought we’d stop in.   Haven’t been in Hawthorne for a long time. JEAN WESTENDORF What are you doing in the back seat? KATE Oh, we just thought we’d rest back here until you showed up. JEAN WESTENDORF Would you like to come in? KATE Sorry, but we just have time to say hi and get going. GEORGE WESTENDORF Hi there, Woody.   How’s it goin’?   *  WOODY Fine.   How’re you, George? GEORGE WESTENDORF Getting by.   You still up there in Montana?  Blue (10-12-2012)   73. WOODY Yep. GEORGE WESTENDORF Billings, isn’t it? WOODY That’s right. JEAN WESTENDORF Still doing hair out there, Kate? KATE No, I let that go. They al",
      "dialogue_count": 0,
      "word_count": 1231
    },
    {
      "scene_number": 9,
      "slugline": "INT. RAY AND MARTHA’S HOUSE UPSTAIRS - NIGHT 80   80  David knocks on a Cole’s door.   Bart opens it.   Cole watches pornography on his computer -- we can hear it. BART Oh, hey, David. DAVID Where is it? BART Where’s what? DAVID Just give it back. COLE Don’t know what you’re talking about, buddy.   Bart, do you know? BART Course not. DAVID Where is it? Finally -- COLE We don’t got it. BART Shut the hell up, Cole.   *  COLE We tossed it when we saw how bogus it was.   Millionaire.   What a joke. You people are pathetic. David nods slowly, turns and shuts the door behind him. BART (O.S.) Fuck him. COLE (O.S.) Lying to us like we’re a bunch of idiots.   *  EXT. RAY AND MARTHA’S LIVING ROOM AND DINING ROOM - NIGHT 81   81   *  David wanders through the first floor looking for his father.   *  Blue (10-12-2012)   78.",
      "characters": [],
      "action_text": "DAVID   *  Dad?   Dad?   *  Finally David turns on the light inside the --   *  INT. RAY AND MARTHA’S KITCHEN - CONTINUOUS A82   A82   *  -- where he finds that Woody has been sitting in the dark at   *  the kitchen table, utterly dejected, drinking a glass of   *  milk.   *  Blue (10-12-2012)   78A. DAVID   *  I won’t mention any of this to Mom or Ross.   We’ll just tell them you came to your senses, and we’ll head   *  back home.   Sound good?   It’s okay - - at least we’ve had a little change of scenery.   I’m happy we got this time together.   Aren’t you? Woody doesn’t move. DAVID (CONT’D) What’s the matter? (off Woody’s silence) You know they weren’t going to give you that money, right? Woody can’t respond, can’t move.   David looks at him, lets   *  out a long sigh. DAVID (CONT’D) Maybe they dropped it.   Should we go have a look? Woody stands up, grabs his coat, and heads for the door.   *  EXT. DOWNTOWN HAWTHORNE - NIGHT 82   82  David and Woody search along the street and sidewalk. DAVID I think it was easier to find your teeth. He watches his father, tireless at his task. DAVID (CONT’D) Come on, let’s take a break.  INT. BLINKER TAVERN - NIGHT 83   83  As David and Woody enter, Ed Pegram is standing by the bar reading the sweepstakes letter out loud for the benefit of other patrons. ED PEGRAM “Congratulations, Woodrow T. Grant. You may have won one million dollars.” Big laughter.  Blue (10-12-2012)   79. ED PEGRAM (CONT’D) “Just imagine what you could do with one million dollars, Woodrow.” We know what the son of a bitch would do -- buy a truck! More laughter.   Woody remains impassive, but we can see humiliation in his eyes. ED PEGRAM (CONT’D) “All you need to do to collect your prize is return this letter to our office, along with your winning prize number and a list of the magazine subscriptions you’d like to -- The room has grown silent.   Ed looks up and joins the others staring at Woody and David. ED PEGRAM (CONT’D) Oh, hey, Woody, I was just lookin’",
      "dialogue_count": 0,
      "word_count": 2227
    },
    {
      "scene_number": 10,
      "slugline": "INT. PICKUP TRUCK - DAY 103   103  Woody gets comfortable and sets the mirrors before shifting the transmission into Drive. He takes his foot off the brake, and the truck starts to move.  EXT. DOWNTOWN HAWTHORNE - DAY 104   104  As the pickup cruises slowly down Main Street, Bernie Bowen from the bus station spots Woody and gives a big thumbs-up. BERNIE BOWEN Hey there, Woody!   Looking good! WOODY (to David) Get down. DAVID What? WOODY I said get down. DAVID Okay. David obeys and ducks below the dashboard. MOMENTS LATER -- Ed Pegram comes out of the Blinker Tavern, sporting a black eye.   He watches Woody pass. MOMENTS LATER -- Peg Nagy comes out of the Cedar County Record office, keys in hand to lock up.   She looks over, and Woody and she lock eyes for a moment.  EXT. HAWTHORNE - DAY 105   105  Now beyond the business district, Woody passes a tiny house where an old man sits out front watching the traffic -- why, it’s Uncle Albert.   He lights up and waves. WOODY So long, Albert.  90.",
      "characters": [],
      "action_text": "UNCLE ALBERT So long, Woody. David pops back up as the truck continues down the street and   *  toward the setting sun.   But before they continue on home,   *  Woody stops the truck, and he and David exchange places.   *  THE END  Blue (10-12-2012)   91.",
      "dialogue_count": 0,
      "word_count": 226
    }
  ]
}