{
  "slug": "no-activity-101-night-35-2017",
  "title": "no activity 101 night 35",
  "genre": "action",
  "format": "series",
  "scenes_count": 5,
  "characters_count": 0,
  "characters": [],
  "total_words": 6608,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. SAN DIEGO DOCKS - NIGHT Car 27 sits adjacent to the San Diego docks. INT. SAN DIEGO DOCKS - NIGHT [ GOOD SIDE ] Detectives Tolbeck (47, gormless, endearing) and Cullen (39, ambitious, frustrated), long-time partners & work spouses, maintain watch at the docks. Tolbeck looks at his hair in the rearview mirror. TOLBECK I need a haircut. Can you believe that? CULLEN ... I'll call a press conference. TOLBECK But remember when I got this one? CULLEN (sighs) ...No. TOLBECK It was our first day here! Remember you said this was going to be the big one? We’ll be on the news, the classic 'standing behind the drug bust' photo? That’s why I got the haircut. But 35 nights later, it’s grown out and no bust, no photo. Sad, isn’t it? CULLEN Yes, it is sad that we’ve had 35 nights of boring stories and inane conversations. TOLBECK 9 years. CULLEN What? TOLBECK  9 years.   We've been partners for 9 years now. I think our anniversary was last Thursday. I meant to say something, but forgot. CULLEN (depressed) Jesus Christ. We've been together longer than the Beatles. Tolbeck quite likes this. TOLBECK We did it. We beat them.",
      "characters": [],
      "action_text": "CULLEN No we didn't. They beat us. They created   Sgt. Peppers ,   Rubber Soul . What have we done? TOLBECK Hey. John Lennon may have been the walrus, but we're the   war- rus. CULLEN That doesn't work at all. It should be   wall -rus. 'Cuz we're the wall, stopping drugs from getting through. TOLBECK No I think   war -rus is better. War on drugs. CULLEN You know who   would   make it work? John Lennon. TOLBECK Out of the two of us, who's Lennon and who's McCartney? CULLEN I'm Lennon   and   McCartney. You're Pete Best, the drummer they fired before Ringo. Tolbeck suddenly notices something in the mirror. TOLBECK Oh my god, check this out. Tolbeck turns his head back and forth. CULLEN What am I looking at? TOLBECK (turning his head right) Left side. Traditionally my best side, always has been, but now look at this. (turning his head left) Right side! It’s better! CULLEN Is it? TOLBECK Definitely. My good side has changed. Isn’t that incredible? CULLEN I can’t see it. Oh, wait up. Look straight at me. Tolbeck stares straight ahead. NO ACTIVITY Episode 101 7/12/17   2. CULLEN (CONT’D) Now slowly turn clockwise, and stop when I tell you. Tolbeck starts turning his head clockwise. CULLEN (CONT’D) Slowly. Slowly. Tolbeck keeps turning until the back of his head faces Cullen. CULLEN (CONT’D) Stop! That’s it. That’s your best side. TOLBECK I'm trying to be serious here. CULLEN Me too. FATIMA (RADIO)  Car 27, please report.  INT. DISPATCH - CONTINUOUS Fatima (24, quintessential millennial) is making her first call. FATIMA (on headset) Car 27, please report. INT. CAR 27 - CONTINUOUS Back in the car, both Tolbeck and Cullen look surprised. CULLEN (into radio) This is Car 27. No activity. Who’s that? INT. DISPATCH - CONTINUOUS Janice (43, mother hen of dispatch) drops into the call. JANICE (on headset) Fatima. It’s her first day, guys. NO ACTIVITY Episode 101 7/12/17   3.",
      "dialogue_count": 0,
      "word_count": 523
    },
    {
      "scene_number": 2,
      "slugline": "INT. CAR 27 - CONTINUOUS TOLBECK (into radio) Ohh. Fatima. Exotic. Cullen snatches the radio from Tolbeck. CULLEN (into radio) Ah, welcome aboard Fatima. This is Car 27, and we look forward to chatting with you in the future. Cullen nods to Tolbeck, who smiles. CULLEN (CONT’D) (into radio) Actually there is some activity Fatima. Stand by... Oh no. GUN! He- chk - arh - bu - kkkkkchh - ujgh. Cullen passes the radio to Tolbeck. TOLBECK (into radio) Arhhhhhhhhhhhh!!!!!!!!!! INT. DISPATCH - CONTINUOUS Fatima, flustered, tries to type, turns to Janice. FATIMA Car 27?! Janice! What do I? Janice calmly takes the radio. JANICE (on headset) Car 27, please grow up. INT. CAR 27 - CONTINUOUS TOLBECK (into radio) Sorry. Sorry Fatima. CULLEN (into radio) Welcome aboard. SMASH TO TITLES:  \"NO ACTIVITY\"  NO ACTIVITY Episode 101 7/12/17   4.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 140
    },
    {
      "scene_number": 3,
      "slugline": "EXT. PORT OF SAN DIEGO - NIGHT Aerial footage of the Port of San Diego at night.  CHYRON : \"Operation Spearfish, San Diego Docks, 1:17 AM.\" DEA RADIO (V.O.)  No activity yet on El Tigre Cartel’s delivery. All designated units, maintain watch on-site, and report any activity. As soon as intel gives the word, we pounce. Sit tight, guys. The delivery will come. It’s a waiting game.  [Note   to   Reader:   Our   characters   never   directly   hear   radio/audio transmissions   from   the   DEA   /   Cartel.   They   are   for   advancing   the procedural   narrative   off-screen.   The   visuals   accompanying   these transmissions   are   fast-cut,   establishing   shots   of   the   relevant locations:   clean,   ordered   world   for   cops/dispatch,   seedier   areas   for criminals.] INT. DISPATCH - NIGHT [ PRIORITIES ] Janice is putting a frustrated Fatima through her paces. JANICE Look, you've gotta roll with that kind of stuff. Car 27 is on a big drug surveillance job; sometimes they need to blow off steam. It's up to us here at Dispatch to be bigger than the cops. Alright? FATIMA Really? Or maybe they could choose not to be dickheads. JANICE Getting mouthy doesn't solve anything either. Fatima is tight-lipped. JANICE (CONT’D) Now. It's vital that you can type and talk at the same time. FATIMA I know Janice, like I've said, they covered all that in training. JANICE Exactly: training. That's not on the job. You're new to this world. This is the pressure cooker. If you can't do it here, someone dies. OK? FATIMA OK. NO ACTIVITY Episode 101 7/12/17   5.",
      "characters": [],
      "action_text": "JANICE It's not a game. You know, 89% of new dispatch recruits quit in the first month. FATIMA Really? That seems like an aggressively high figure. JANICE It's true. I mean, I don't have data to back it up, but I've been here long enough to feel that it's about right. Question is: do you want to make it? Janice doesn't give Fatima time to answer. JANICE (CONT’D) Nope. You paused. That tells me everything I need to know. FATIMA I didn't pause. You didn't give me a chance to answer. JANICE You pause, people die. Now do you -- FATIMA YES! I want to make it here. JANICE Better. Now, my old partner, your predecessor Tabitha-- FATIMA Tabitha, the great, yes I remember. JANICE (CONT’D) She was the best in the business with the talk'n'type. JANICE (CONT’D) OK, Little Miss Attitude. Do you know the lyrics to   Gold Digger   by Kanye West? FATIMA ... Yes? JANICE Of course you do. OK, start typing them. FATIMA Really? JANICE Go on. \"She take my money when I'm in need / Yeah she's a trifling friend indeed...\" Fatima starts typing. NO ACTIVITY Episode 101 7/12/17   6. FATIMA \"Yeah she's a gold digger...\" JANICE No, do that in your head. Now. (very quickly) Two calls come in, one is a traffic hazard on the 805 North, the other is a shark on the loose. Which takes priority? FATIMA Um... JANICE Keep typing! FATIMA Shark on the loose. JANICE OK stop. Fatima stops typing. JANICE (CONT’D) The 805 North is one of our busiest roads - particularly that bottleneck at Claremont Mesa. A traffic hazard there is a major issue, Fatima. Major. Potential fatalities if not addressed. FATIMA I just thought a shark on the loose- JANICE All sharks are on the loose. OK? They live in the sea. I've never seen a harnessed shark. That's a prank call. FATIMA ... OK. JANICE You've got to think. Tabitha was one of the best thinkers in dispatch. Now, how'd you do with your typing? Janice looks at Fatima's screen. JANICE (CONT’D) (disgusted) I'm sorry? What is this filth? FATIMA Those are the lyrics. NO ACTIV",
      "dialogue_count": 0,
      "word_count": 4528
    },
    {
      "scene_number": 4,
      "slugline": "INT. CAR 27 - CONTINUOUS CULLEN (into radio) How? JANICE (RADIO)  On the can.  TOLBECK (into radio) On the toilet? INT. DISPATCH - CONTINUOUS JANICE (on headset) Yeah. The strain, his heart gave out. It’s more common than you think. Anyway. Chat later. INT. CAR 27 - CONTINUOUS CULLEN (into radio) Thanks Janice. (then to Tolbeck) Poor old Frizell. You OK? TOLBECK No. CULLEN Didn’t realize you guys were so close. TOLBECK Well we weren’t really, not anymore, but we went through the academy together. We always got on though, until one day, we’d just had the morning briefing, and I went to the bathroom and I walk down to my favorite stall, the second to last, same one I used everyday between, usually between about 10.20-- CULLEN ...And 10:45AM. Heard that story. TOLBECK Anyway, I get to my stall and it’s occupied. I think that’s weird, all the other stalls are free. So I just peek into the crack between the door and divider. It couldn’t be more than a quarter inch gap, but all I see is Frizell’s eye. We just completely locked eyes in the most intense human way possible. (MORE) NO ACTIVITY Episode 101 7/12/17   27.",
      "characters": [],
      "action_text": "It’s very rare, but you know when you lock eyes with someone and it’s like you can’t move, the gaze just holds you, and it just buries into your soul? It was like the All-Seeing Eye of Sauron. CULLEN So your eyes met while he was on the toilet? TOLBECK Yeah. CULLEN For how long? TOLBECK A second, maybe two. CULLEN OK. And why is this a story? TOLBECK It was just an incredibly charged moment. CULLEN Sexually? TOLBECK No. Not all charged moments are sexual. It was just a profound moment that neither of us could really fathom. We kinda avoided each other after that. And now he dies on the toilet? That’s gotta mean something. CULLEN Specifically what? TOLBECK Don’t know. CULLEN Probably nothing. TOLBECK Maybe, or maybe something. CULLEN Or maybe definitely nothing. EXT. SAN DIEGO DOCKS - NIGHT Aerial view of hundreds of shipping containers. We move into the bay to see the lone cargo ship closing in on the port.  CHYRON:   \"4:02 AM\" TOLBECK (CONT’D) NO ACTIVITY Episode 101 7/12/17   28. CARTEL VOICE 2 (AUDIO)  Where the shit is the fish food!?  CARTEL VOICE 1 (AUDIO) (in Spanish)  It's docking at 5 AM.  CARTEL VOICE 2 (AUDIO)  Fucking hurry! I don't want to unload this shit in daylight.  CARTEL VOICE 1 (AUDIO) (in Spanish)  Watch your tone, gringo. Your salmon better work fast, yes?  INT. SHPPING CONTAINER - NIGHT [ GOTTA PEE ] Marco is jiggling his leg. Angus notices. ANGUS You're jiggling. You need to pee again? MARCO Who are you, my mother? ANGUS Will you please see a doctor? MARCO Oh, change the record buddy! I'm not having some quack fingering my asshole! ANGUS Prostate cancer is the third biggest killer in men in the USA, OK? MARCO (CONT’D) La la la la la la la la! ANGUS A man your age needs regular checks! MARCO (CONT’D) La la la la la la la la! ANGUS OH FINE!! Just go take a piss will you? Stop pretending you don't need to go! MARCO I'm not going in the bucket again. I don't like you listening. I get shy. ANGUS Just go. I won't listen. MARCO No, I don't even need",
      "dialogue_count": 0,
      "word_count": 926
    },
    {
      "scene_number": 5,
      "slugline": "INT. CAR 27 - CONTINUOUS CULLEN But there's a law against peeing in public. TOLBECK Don't be such a square, man. CULLEN Will you just fucking go and do your job? Something is actually happening! Put your phone away! TOLBECK OK, but you come with me. CULLEN Why? You think he'll piss on you? TOLBECK Oh fine! He throws his phone down. CULLEN Thank you! INT./EXT. CAR 27/SAN DIEGO DOCKS - CONTINUOUS Tolbeck gets out of the car. CULLEN Do you have everything? TOLBECK Ugh. Like what? CULLEN Badge? Flashlight? TOLBECK (Leans in to get them) Yes, mom. EXT. SAN DIEGO DOCKS - CONTINUOUS Marco leans one hand against a shipping container, straining to get a good flow happening. MARCO Come on you shrivelled-up, fucking... NO ACTIVITY Episode 101 7/12/17   32.",
      "characters": [],
      "action_text": "INT./EXT. CAR 27/SAN DIEGO DOCKS - CONTINUOUS CULLEN Do you have your gun? TOLBECK Yes. CULLEN (opening the glove box) No, you don't. Because you put it in the glove box. (handing him the gun) Take it. Got your body cam? TOLBECK I'm not wearing - CULLEN (handing him the body cam) Come on, Tolbeck! We gotta wear this shit. Put it on. TOLBECK (putting it in his top pocket) It's too much stuff! CULLEN Grow up. TOLBECK Oh fuck off. He starts walking off towards Marco. EXT. SAN DIEGO DOCKS - CONTINUOUS - BODYCAM P.O.V. We are now inside the bodycam in Tolbeck's top pocket, seeing and hearing everything from it. We hear Tolbeck's footsteps as we approach a hunched Marco, who's focussed on peeing. TOLBECK (O.S.) Excuse me, sir. Marco whips around, shocked. MARCO What the fuck?! TOLBECK (O.S.) Hey, relax! Relax! We hear the opening bars of   Superstition   from Marco's phone. NO ACTIVITY Episode 101 7/12/17   33. MARCO Shit. TOLBECK (O.S.) What's that?! Cullen! Marco grabs his phone from behind his waist. We hear Tolbeck's panicked breathing. The camera jiggles as Tolbeck pulls out his gun. MARCO The fuck are you?! We see the (lit-up) pistol shape in Marco's hand. TOLBECK (O.S.) Gun! GUN! We hear a gunshot and the sound of a body falling against a shipping container. TOLBECK (O.S.) (CONT’D) Oh shit!! Oh shit!! CULLEN!!! INT. CAR 27 - CONTINUOUS Cullen's eyes go wide, as he witnesses what's just happened. EXT. SAN DIEGO DOCKS - CONTINUOUS From Cullen's POV, we see Tolbeck look helplessly to him for direction. INT. CAR 27 - CONTINUOUS Cullen, adrenalized, checks to see if anyone witnessed anything, then quickly motions for Tolbeck to come back to the car. EXT. SAN DIEGO DOCKS - CONTINUOUS Tolbeck, still freaked out, starts awkwardly jog-walking back towards Car 27. We then cut to Marco, motionless on the ground. The relative silence is broken by a message alert on his blood-spattered phone. We close in on the screen: 5 missed calls and a new message from 'Boss':   Answer your",
      "dialogue_count": 0,
      "word_count": 491
    }
  ]
}