{
  "slug": "nocturnal-animals-2016",
  "title": "nocturnal animals",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 9,
  "characters_count": 0,
  "characters": [],
  "total_words": 20642,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. FREEWAY, LOS ANGELES - HIGH ABOVE THE TRAFFIC. EVENING 2   2 -- CONTINUOUS. OUR CAMERA HOVERS HIGH ABOVE THE CROWDED FREEWAYS OF LOS ANGELES. WE CUT BACK AND FORTH FROM OVERHEAD SHOTS OF THE NUDE WOMEN ON PLINTHS TO OVERHEAD SHOTS OF THE CROWDED FREEWAYS OF LOS ANGLES AS NIGHTFALL SLOWLY OVERTAKES THE CITY. INT. MORROW GALLERY, LOS ANGELES. NIGHT -- LATER. 3   3 Silence. The gallery is now empty. A small crew of men in white shirts and dark ties clear away the last traces of the party. Susan is sitting on one of the plinths deep in thought. A nude sculpture lying face down is behind her. The women on the screens continue to gyrate on all four walls. EXT. FREEWAY, LOS ANGELES - HIGH ABOVE THE TRAFFIC. NIGHT 4   4 -- LATER. Susan’s car weaves it’s way through the night. EXT. MORROW RESIDENCE, LOS ANGELES. NIGHT -- MINUTES LATER. 5   5 Susan pulls up to a pair of large stainless steel gates. The glare of her headlights reflects off of the gates and temporarily blinds her as she shields her eyes. She hits the remote and the massive gates glide open. She drives in as the gates close behind her. As the gates lock in place, another car pulls into the driveway. The glare of the headlights blinds us so that we cannot make out anything but the silhouette of the driver. We see clearly however from the large logo on the hubcap that the car is a vintage dark brown Mercedes. The car door opens as the driver lowers his foot onto the gravel drive. We cut back to the house to see Susan’s silhouette as she walks towards the front door. The house is dimly lit and seemingly empty. EXT. LOS ANGELES. THE NEXT DAY -- MORNING. 6   6  2.",
      "characters": [],
      "action_text": "SEVERAL SHOTS OF THE LOS ANGELES SKYLINE REVEAL A FOGGY GREY MORNING. EXT. MORROW RESIDENCE, LOS ANGELES. MORNING -- CONTINUOUS. 7   7 Our camera glides across the surface of a black swimming pool littered with leaves. We pull back to reveal a vast unkempt lawn and a large Jeff Koons “Balloon Dog” sculpture on a plinth. There are tools, equipment and a small crane next to the sculpture. Despite the neglected feeling of the grounds the house is impressive. Long, low, and elegant. INT. MORROW RESIDENCE, LOS ANGELES. MORNING -- CONTINUOUS. 8   8 We move into the living room which is an expanse of grey carpet and low velvet sofas. There are several very large art crates lining the hall. The house is beautiful but cold and empty. Our camera moves down a long corridor towards a door at the end. The hallway seems endless. A large white Calder mobile moves slowly over a fireplace at the end of the hall as the breeze from the air-conditioner stirs it. Susan stands underneath the Calder in front of an enormous television with a remote control in her hand. Pressing it over and over. As we approach the door the sound of the television becomes louder and louder. We can hear two women’s voices as they shriek with laughter. TELEVISION VOICE 1 And all that decolletage of yours should get you more dickoletage than that dude’s got! And as I can recall, you were the one that told me that when he came it was as thin as coconut water! Honey, that’s a deal breaker for me! TELEVISION VOICE 2 It was that thin.  3. TELEVISION VOICE 1 Well I see we’re settling for less now! The women break into hysterical laughter once again. We cut to Susan’s face. Her mouth literally hangs open as she stands staring at the television and holding the remote in her hand trying to get the television to turn off. SUSAN Beyond. She tosses the remote on the bed in disgust and walks out of the room leaving the television still on. INT. MORROW RESIDENCE - ENTRY HALL. MORNING -- CONTINUOUS. 9   9 CHRISTOPHER, 38, w",
      "dialogue_count": 0,
      "word_count": 9295
    },
    {
      "scene_number": 2,
      "slugline": "INT. MORROW RESIDENCE - SUSAN’S BEDROOM. MORNING -- 41   41 CONTINUOUS. Susan gasps as she continues to fondle the gold cross around her neck. She closes the book. Her breathing is rapid and she slowly collects herself. Susan picks up the phone on her night table and dials. INT. BOARDING SCHOOL DORM ROOM, OJAI CALIFORNIA. MORNING 42   42 -- CONTINUOUS. SAMANTHA MORROW, 16, pale white skin and long red hair is lying naked on a bed. The white arm of a boy is draped across her. They are still. Sam’s phone rings and she turns to answer it. SAM Mom? Is that you? Is everything all right? INT. MORROW RESIDENCE - SUSAN’S BEDROOM. MORNING -- 43   43 CONTINUOUS. SUSAN I’m fine. I just wanted to hear your voice. I miss you. A rustling sound as Sam drops the phone and then picks it up again. We hear movement in the background and a muffled whisper. SAM You woke me up. I’m still in bed. It’s Sunday morning mom. Can I call you later? SUSAN Yeah. I’m sorry sweetheart. Go back to sleep. SAM You sound weird. Are you okay? SUSAN I’m fine. It’s nothing. Go back to bed sweetheart. (Pause) I love you.  49.",
      "characters": [],
      "action_text": "SAM Yeah. Me too. I’ll call you later. Susan hangs up. She stares ahead but can only see the image of Tony kneeling in front of the bodies on the sofa. She closes her eyes. FLASHBACK - EXT. 5TH AVENUE, NEW YORK. NOVEMBER 1996 -- 44   44 EVENING. Susan at 22 is coming out of the door of Bergdorf’s and turns to walk uptown. There is a young man lingering in the next doorway watching her. He steps out just ahead of her and walks in the same direction she is walking. He walks slower than she does and they are now only a few feet apart. She realizes that she knows him, or thinks she knows him. She quickens her pace. SUSAN Edward? Edward! Edward turns around. He is handsome, beautiful in a boyish way. It is striking how much Edward looks like Tony from “Nocturnal Animals” although he has lighter hair, is younger and clean shaven. It is beginning to snow and starting to get dark. EDWARD Susan! God it’s good to see someone I know. He looks her up and down. EDWARD (CONT’D) You look beautiful. As always. They kiss on the cheek. As they do, Edward pulls her close. We see him breathe in deeply and close his eyes. SUSAN What are you doing in New York? EDWARD I am here for a scholarship interview at Columbia.  50. SUSAN Columbia? I thought that you were at the University of Texas, becoming a great writer. EDWARD I am. Becoming a great writer? I don’t know. Are you still at Yale becoming a great artist? SUSAN Columbia graduate school. Art History. They look silently at each other for a moment. SUSAN (CONT’D) Do you know anyone here? EDWARD Just you. SUSAN Would you like to have dinner? EDWARD Absolutely. SUSAN Walk me home and I’ll drop these off. Edward takes her shopping bags. SUSAN (CONT’D) Thank you. I miss Texas men. FLASHBACK - INT. MR. CHOW RESTAURANT, NEW YORK. LATER THAT 45   45 EVENING. Susan and Edward are finished with dinner and are having drinks. It is clear that they have already had a few as the atmosphere between them is warm and intimate. EDWARD You know, you wer",
      "dialogue_count": 0,
      "word_count": 2142
    },
    {
      "scene_number": 3,
      "slugline": "INT. HASTINGS RESIDENCE - TONY’S STUDY, HOUSTON TEXAS. 50   50 EVENING. Tony is on his computer. He is wearing a pair of boxer shorts and an old tee shirt. There is a bottle of Jack Daniels and a glass next to him. He looks rough. He checks his e-mails. There is one from Bobby Andes. Tony opens the attachment and takes a deep breath. He looks at a photo of a clean shaven man. Tony looks carefully. Covers the bottom half of the face with a piece of paper. Covers the top half with a piece of paper. Tony sits at his desk with his head in his hands. His cell phone rings. He looks at the number. He doesn’t recognize it. He answers. TONY Yes? EXT. ANDES CAMP, WEST TEXAS. EVENING -- CONTINUOUS. 51   51 ANDES Tony Hastings? TONY Yes. Who is this? ANDES Roberto Andes. I just sent you an e- mail. Did you get it? TONY Yes. I did. ANDES Well, did you recognize the guy? TONY No. ANDES Shit. God damned it. You sure?  61.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 180
    },
    {
      "scene_number": 4,
      "slugline": "INT. HASTINGS RESIDENCE - TONY’S STUDY, HOUSTON TEXAS. 52   52 EVENING -- CONTINUOUS TONY It’s like the whole thing is a blur. ANDES This guy’s finger prints were on your car. They were also found at the trailer. His name is Steve Adams. He has a record in California, a stolen car with an acquittal on a rape charge. We’ve put out an A.P.B. for him. He is our only lead right now. No one has responded to our call for witnesses. Are you sure you don’t recognize him? TONY No. ANDES Fuck. What’s wrong with you man! Don’t you want these guys put away? TONY Of course I do! It’s all just a blank. CUT TO BLACK. INT. HASTINGS RESIDENCE - TONY’S BEDROOM. LATER THAT NIGHT. 53   53 Tony lies in bed asleep, dreaming. He is tossing about and is clearly in distress. WE SEE TONY’S IMAGINED VERSION OF THE RAPE. IT IS VIOLENT. BRUTAL. HIS DAUGHTER’S SCREAMS ARE PIERCING. TURK LOOKS STRAIGHT TOWARDS HIM AND SMILES. Tony sits up in a sweat. CUT TO BLACK.  62.",
      "characters": [],
      "action_text": "EXT. COUNTRYSIDE, HOUSTON TEXAS. WINTER. DAWN. 54   54 A bleak hillside. Brown grass and bare trees as Tony appears over the hill in his running clothes. He has on a light jacket and long tight running pants. He is clean shaven. He looks thinner. It is remarkable how he now looks almost exactly like Edward. Dark circles ring his eyes and a certain dead quality is evident in his expression. TONY V.O. I know it was him! ANDES V.O. Well, that may be but nobody’s seen him around here lately. Now listen, I’ve got to be honest with you. Right now it’s not looking good. Sometimes these cases go for months or even years without a break. You need to prepare yourself for that. Tony stops running and catches his breath. CUT TO BLACK. INT. HASTINGS RESIDENCE - TONY’S BATHROOM. EVENING. 55   55 Tony stands still in the shower. Just letting the hot water run over him. INT. MORROW RESIDENCE - SUSAN’S BATHROOM. EVENING. 56   56 Susan is in the shower leaning against the wall, just letting the water run over her face and body. She is deep in thought. CUT AWAY SHOTS OF TONY. LYING IN BED. DRINKING. HOLDING HIS HEAD BETWEEN HIS HANDS. NO SOUND. Susan holds herself tightly while the shower steams up and the water washes over her. SUSAN V.O. Why are you so driven to write? EDWARD V.O. I guess it’s a way of keeping things alive. (MORE)  63. Saving things that will eventually die. If I write it down, then it will last forever. Susan stands still and stares straight ahead, deep in thought. CUT TO BLACK. EXT. COUNTRYSIDE, WEST TEXAS. DAY. 57   57 SHOTS OF THE SUNRISE IN THE DESERT. THE HOT LANDSCAPE NEARING NOON, AND THE AFTERNOON LANDSCAPE AS THE WIND STARTS TO HOWL. EXT. POLICE STATION, WEST TEXAS. DAY. 58   58 Bobby Andes is standing outside on the curb smoking. He is thinner and his complexion is sallow. Tony walks towards him and the two men shake hands. ANDES You look different. TONY No beard. Thinner. You look different too. ANDES Yeah. He takes a drag off of his cigarette. ANDES (CO",
      "dialogue_count": 0,
      "word_count": 2435
    },
    {
      "scene_number": 5,
      "slugline": "EXT. RAY’S MOBILE HOME. AFTERNOON -- CONTINUOUS. 66   66 The two men walk through the scruffy trees until they can see a mobile home and an old wooden deck about a hundred feet away. Ray is sitting on a toilet that has been installed outside on the deck. There is a beer beside him. He is shirtless, his pants are down around his ankles and he is on a cordless phone smoking a cigarette. ANDES His name is Ray Marcus and someone named him as a frequent companion of Lou Bates and Steve Adams. Tony stares harder. Clearly agitated. ANDES (CONT’D) Part time electrician. Part time plumber hence the clever toilet facilities. Not a bad match to both your description and the fella in the holdup. No fingerprints but we knew that before. TONY I wonder why there aren’t any finger prints. ANDES His hands were probably on your wife. Tony winces. ANDES (CONT’D) His record is clean except for a rape charge that was dropped. I got out of the barman at a place called “Line Camp Bar” that he lives here with a girl called Leila and that he keeps another place to pick up women that she doesn’t know about. Probably your murder trailer before it got notorious. Does he look like he could be the guy?  75.",
      "characters": [],
      "action_text": "TONY Yeah. That’s him. ANDES Good. Let’s go talk to him. Andes walks out of the brush. ANDES (CONT’D) Hey, Ray. Ray looks at him. RAY What the fuck man! Who the hell are you. Get off my property. Ray speaks into the phone and then hangs up. RAY (CONT’D) I’ll call you back. ANDES I want to ask you some questions. RAY Fuck you. I’m occupied at the moment. Bobby Andes holds up a plastic case with a badge in the window. His other hand is in his jacket. Ray squints. RAY (CONT’D) What’s that? ANDES A few questions, that’s all. We need you to come with us. RAY What for? I ain’t done nothin. ANDES Didn’t say you did. RAY Ask me here.  76. ANDES Naw. We need you to take a little drive with us. Finish what you’re doin and let’s go. RAY You mind turnin around? ANDES Believe me I wish I could but I just can’t do that. Andes tosses Ray’s shirt to him from the back of a chair. ANDES (CONT’D) Come on. Get dressed. INT. TONY’S CAR, WEST TEXAS. AFTERNOON -- MINUTES LATER. 67   67 Andes is in the back seat with Ray. Tony is in the driver’s seat. Andes directs Tony where to drive. RAY Hey, are you questioning me? ANDES Why yes, that’s what we’re doing ain’t it? RAY You ain’t read me my rights. ANDES You know your rights, Ray. RAY You’re supposed to read ‘um to me. ANDES I read you your rights, didn’t I Tony? Tony is stunned at being brought into the game of cat and mouse. RAY This ain’t legal man. I’m supposed to have a lawyer.  77. ANDES Calm down sunshine. This is just informal questioning. That's all. You’re helping me out. I haven’t charged you with anything yet. If you want a lawyer we’ll have to take you in and charge you with somethin. Ray looks out the window. RAY Aw come on man, you don’t need to take me in. I’m answering questions, ain’t I? ANDES Well I don’t know. Seems like I don’t know no more about that holdup than I knew before. Tell you what. There’s somthin else I’d like to ask you about. You recognize this car? RAY What car? Andes bangs his fist against the headliner",
      "dialogue_count": 0,
      "word_count": 5146
    },
    {
      "scene_number": 6,
      "slugline": "INT. TRAILER, WEST TEXAS. NIGHT -- CONTINUOUS. 86   86 In a sudden move he pushes the door open. There on the bed is Ray, who sits up on his elbows shocked. Tony points the gun directly at him. RAY Christ. You. Where’s your pal? TONY He’s on his way. RAY Your cop friends? TONY They’re around. RAY Are they here? Ray sits up and looks out of the window. Tony flicks on the light. TONY Just me for the moment. RAY You and that fucking gun that you don’t know how to use. What happened to Lou? TONY He’s dead. RAY What? That son of a bitch killed him! That’s big trouble for your friend, you know that? TONY I don’t think so. RAY Oh you don’t think so? And so just what do you want. You and that silly gun. I’ve seen how handy you are with that thing. Ray stands up. Tony cocks the gun.  103.",
      "characters": [],
      "action_text": "TONY Sit the fuck down! Sit down or I will fucking kill you! Ray is stunned by the tone of Tony’s voice and backs up to the bed and sits back down. RAY Listen man. Why does a nice guy like you hang out with a guy like Andes. He kills people. TONY You kill people. Ray looks at Tony in disgust. RAY They had it coming to them. Your fuckin wife. That kid. Tony is livid. He is invigorated. RAY (CONT’D) But you got me wrong man. It was an accident. TONY Accident! It was an accident! RAY I got a certain pride in how people talk to me and there are certain things I don’t put up with. Let me tell you man, when someone accuses me of something, that’s an insult. It gives me the right. If my woman accuses me of fucking somebody else, then I go fuck somebody else. If your fucking daughter thinks I’m a rapist, then she gets raped. Tony is livid. TONY Nobody gets away with what you did. Nobody. RAY They don’t?  104. Tony is pointing the gun directly at Ray and closes his eyes for a moment as he squeezes the handle of the gun. He is almost in a trance. TONY Nobody. Nobody. Nobody. RAY So why don’t you just kill me? Come on man, you don’t know nothin. It’s fun to kill people. You of all people ought to try it sometime. Ray is quietly sliding his hand under the pillow on the bed. He has hidden a metal rod of some kind there and we see his fingers slide around the handle. TONY Fun! Did you have fun killing my wife and daughter! Get up. It’s time for you to go. TONY (CONT’D) Go. Go on. Ray surveys Tony and the room. He stands up slowly. One hand is holding the fire poker behind his back. Ray looks Tony in the face. He begins to grin. RAY Your wife. Yeah, I remember your fuckin wife. I remember fuckin your wife, but you’re too weak. To fuckin weak. You’re too weak to do anything about it. Tony pulls the trigger and the gun goes off. It misses Ray. RAY (CONT’D) Son of a bitch! Tony pulls the trigger again. Ray is hit and grabs at his chest but is now moving towards Tony with the fire pok",
      "dialogue_count": 0,
      "word_count": 578
    },
    {
      "scene_number": 7,
      "slugline": "INT. TRAILER, WEST TEXAS. DAY. 87   87 Our sound returns as we hear flies buzzing close by. Our screen is black but begins to shift to a warm brown as murky daylight starts to illuminate the image. Tony is lying on the floor of the trailer. His head is covered in blood that has began to crust over. As a fly crawls across his face he slowly reaches up in pain to fan it away. We see that there is a bloody gash across his face. His eyes are covered in dried blood and as he claws at them we realize that he has been blinded. Tony realizes this too. He feels around and finds the gun. He holds onto it and finds a chair and pulls himself up. Light is now pouring into the room. He manages to get to his feet. As he begins to stumble around the room he walks into something. Someone. It is Ray. He is dead and lying in a pool of blood. Tony bends down and runs his hands over Ray’s face and lifts the deadweight of the arm. He still holds the fire poker in one hand. Tony finds his way out of the trailer. As he does he falls to the ground. EXT. TRAILER, WEST TEXAS. DAY -- CONTINUOUS. 88   88 He drags himself into the brush and towards the road. He struggles to reach into the air and fires the gun then drops to the ground. He tries to lift the gun back up in the air in an attempt to fire it once again. As he rises to his knees he falls back to the ground and onto the gun. A loud gunshot. He has shot himself in the stomach. He is still alive but begins to loose consciousness. INT. MORROW RESIDENCE - SUSAN’S BATHROOM. NIGHT. 89   89 Susan is in her tub. Her face is completely submerged. Her eyes are open. She suddenly sits up and gasps for air.  106.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 333
    },
    {
      "scene_number": 8,
      "slugline": "EXT. TRAILER, WEST TEXAS. DAY -- CONTINUOUS. 90   90 Our camera slides up Tony’s body to see him grasp at his neck for the small gold cross. A breeze causes a loud brushing sound of the grass in the wind as the sound of the insects rises. The sound of Tony’s heartbeat becomes louder and louder and overtakes all other sound as our camera settles on his face. With each beat we cut back and forth from his face, to that of Susan’s as she begins to cry. The sounds of Tony’s cries of pain mingle with Susan’s cries. TONY’S FACE. SUSAN’S FACE. TONY’S FACE. SUSAN’S FACE, UNTIL SUDDENLY TONY’S HEARTBEAT STOPS. INT. MORROW RESIDENCE - SUSAN’S BATHROOM. NIGHT -- 91   91 CONTINUOUS. Susan is in tears as she grabs at the gold cross around her neck. SUSAN (Softly) Edward. CUT TO BLACK. INT. MORROW RESIDENCE - SUSAN’S BEDROOM. NIGHT -- LATER. 92   92 The lights are out. Susan is lying in bed wide awake thinking. Her eyes are still wet. Her thoughts are interrupted by the buzz of an e-mail on her phone. She reaches over to the bedside table and opens the message. Dear Susan, Just let me know when and where. Edward. A soft smile comes over Susan’s face as she quickly types out a response.  107.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 221
    },
    {
      "scene_number": 9,
      "slugline": "INT. MORROW RESIDENCE - SUSAN’S BATHROOM. NEXT EVENING. 93   93 Susan stands in front of her bathroom mirror. She is dressed to go out. She raises her face slightly and looks at herself intently. She reaches for a tissue and wipes the lipstick off of her mouth. She begins to put her wedding ring back on her finger but stops for a moment and looks at her hand. She slips the ring back into the tray on her dressing table. INT. RESTAURANT, LOS ANGELES. EVENING -- LATER. 94   94 Susan walks into the restaurant. She looks especially beautiful and somehow younger. Susan follows the hostess to a table overlooking the courtyard. It is dusk and the lights of the city below are beginning to glisten. It is a beautiful LA night. HOSTESS May I get you a drink while you wait? She smiles at the hostess. SUSAN Yes, thank you. Scotch on the rocks. Susan is seated next to a young couple who are leaning in closely to each other. Time passes. Lingering shots of Susan. Her hands as she feels the finger where her wedding ring usually rests. Her legs as they cross and uncross. Long shot of her sitting by herself in a room full of people looking back towards the entry door of the restaurant. She has finished her drink. HOSTESS Mrs. Morrow, are you all right? May I get you another drink? SUSAN Yes, thank you. More time passes. She finishes her second drink. The couple next to her has now left and the table is empty.  108.",
      "characters": [],
      "action_text": "Long shot of Susan sitting alone in the now almost deserted room. She sits still looking out over the lights of the city. Susan Morrow stares straight ahead and into the night. The expression on her face belies her realization that Edward is not coming. CUT TO BLACK.  109.",
      "dialogue_count": 0,
      "word_count": 312
    }
  ]
}