{
  "slug": "oceans-8-2018",
  "title": "oceans 8",
  "genre": "romance",
  "format": "film",
  "scenes_count": 8,
  "characters_count": 0,
  "characters": [],
  "total_words": 22401,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. NICHOLS WOMEN’S PRISON - DAY Early spring, sparse moments of green against the sterile grey of the correctional facility.   Straining against the bleakness, small flowers start to bloom. The gate clanks open. DEBBIE OCEAN, 40’s, impossibly chic for having just done a stint in the slammer -- suit pressed, hair shiny, struts out. Her gait suggests an unpleasant if not untenable sojourn. She greets the world as if it has been waiting for her, allowing herself a moment of digestion -- her posture relaxes, she exhales, she closes her eyes. She hears before she sees the waiting engine of a classic Mercedes, ‘55, baby Blue.   LINUS (Matt Damon) drapes a single hand on the steering wheel but it’s a forced nonchalance that could never come close to its owner.   Danny Ocean Lite. LINUS Deb... Debbie keeps walking.   He cruises up next to her. LINUS (CONT’D) Where’re you going? DEBBIE (without looking back) I have $35 Linus, I can go wherever I want. LINUS I’ll give you a ride. DEBBIE (slows/turns) He left you his car? LINUS No.   Well -- he knew I loved it... DEBBIE That’s not the same thing. LINUS (seriously/intoned) He would have wanted me to drive it. She rolls her eyes.   Hot day.   Long way to walk.   Deb slows. So does Linus.   He REVS the car in neutral. 7.25.16",
      "characters": [],
      "action_text": "DEBBIE Don’t do that, ok. LINUS Sure. She crosses to the passenger’s side and climbs in. INT. CAR - DRIVING - TEN MINUTES LATER DEBBIE When’s the funeral? LINUS Tomorrow at noon. DEBBIE Where? LINUS Really nice place... (off her look) Queens. Linus changes lanes.   Starts moving over toward the right... DEBBIE Where are you going? LINUS I-95. DEBBIE Why? LINUS We thought -- it might be a good idea to see your folks. DEBBIE  Who   thought? LINUS You know... DEBBIE Eleven of you? LINUS Ten.   Rusty’s in England. Debbie reaches out and JERKS THE WHEEL crossing two lanes of traffic.   They head toward New York. LINUS (CONT’D)  That   is -- dangerous! 2. 7.25.16 DEBBIE We’re going to Manhattan. LINUS They’re not gonna like that. DEBBIE Anything else “they” want? LINUS As a matter of fact... He doesn’t finish.   Knows he spilled too much.   Deb turns. DEBBIE What? LINUS Saul wants to tell you. DEBBIE Goddammit, Linus. LINUS He left you a note. DEBBIE Danny did? Nods. DEBBIE (CONT’D) Let me see it. LINUS Well that’s just it.   In the confusion with him “passing,” and clearing out the “effects” cause we’re the ones who have to deal with the “effects...” DEBBIE Where’s the note? LINUS We’re not sure. DEBBIE You lost it? LINUS It’ll turn up. DEBBIE You lost my dead brother’s note to me. 3. 7.25.16 LINUS I know what it said. Pause. LINUS (CONT’D) It said he doesn’t want you to do it. DEBBIE Do what? LINUS The job. DEBBIE You know about that? LINUS Well not exactly.   But the way he was talking, it sounded pretty clear... DEBBIE Jesus Christ. LINUS He was worried about you Deb.   He doesn’t want you to go back to -- you know... They have come to a stop on the George Washington Bridge and all at once, Deb FLINGS OPEN THE DOOR.   She steps out into bumper to bumper traffic heading toward Manhattan, leaving Linus stuck in the car. LINUS (CONT’D) Deb.   Wait.   Please! CUT TO: EXT. NEW YORK CITY - AFTERNOON Teeming city life.   Blur and shocks of colors.   Saul Leiter come to life ",
      "dialogue_count": 0,
      "word_count": 986
    },
    {
      "scene_number": 2,
      "slugline": "INT. HOTEL ROOM - PLAZA - CONTINUOUS The MAID fixes pillows.   She looks up as Debbie enters. DEBBIE Hi. Sorry.   Can you just finish this later?   I’ve just   got   to get off my feet. MAID Of course.   Sorry. She gathers the rest of her things and hurries toward the door. DEBBIE Wait. She crosses to the maids cart and grabs a handful of chocolates. INT. BATHROOM - HOTEL ROOM - PLAZA - LATER Debbie luxuriates in a bath with all of New York out a huge picture window beside her.   The lights glisten.   The planes glide by.   She sinks a little lower in the warm water. Closes her eyes... CUT TO: INT. TRENDY CLUB.   NIGHT CATE late 30’s, dressed in all black at a landing, hovering above her club.   It’s packed with kids and sweat.   She glances over at the bar. A FEMALE BARTENDER Is pouring Grey Goose into a tumbler.   She catches Cate’s eye who shakes her head.   The woman, chastised, replaces the Grey Goose and grabs a bottle of well vodka... MOVING WITH CATE She scans the floor: hormones and sweat.   In the far corner Lebron James is towering above the throng, dancing.   Cate descends the stairs and crosses to one of her “Bottle Girls.” CATE Did you get him yet? BOTTLE GIRL No. I will. Cate looks at her with judgement: ”C’mon.”   The girl grabs her cell phone hurries across the floor. 7. 7.25.16",
      "characters": [],
      "action_text": "CATE wanders toward the back of the club and spots a girl smoking in the doorway to the alley.   She crosses to her and the girl immediately drops her cigarette, grinding it out on the ground. CATE On a break? SMOKER Yeah. CATE How’s the line? SMOKER It’s pretty good. CATE Is it down the block? SMOKER (busted) Not quite. CATE You know I need a long line right? SMOKER Sorry.   I just got cold. CATE Here.   Take this. She removes her scarf, wraps it around the girl’s neck then smiles.   It’s a “get-the fuck-out-there smile,” but still a smile. SMOKER Thanks. ACROSS THE CLUB... Lebron is seriously into the music when the Bottle Girl comes up and tries to take a selfie.   (The height differential is problematic.)   He squats lower and extends the camera... CATE... Watching it. CATE (to her bouncer) Make sure she pushes that out now .  BOUNCER Hashtag? 8. 7.25.16 CATE How bout our address. AND SHE IS MOVING AGAIN, this time toward the VIP area where a YOUNG MAN is holding court with three women and a bottle of Dom.   Heavily tatted and well toned.   Cate glares -- he looks up... LUIS (beat) They said I could. CATE Who? LUIS The guy at the door. CATE Instead of buying-off my doorman why don’t you pay your bill from last time? LUIS (scared) Ok. CATE Ok. She turns to leave and gets a text.   Cate glances down while   * she walks. INSERT.   CELL PHONE TEXT MESSAGE: FROM JLBRD: “Where is the fkng cemetery?   12 O’clock?” SHE smiles walking away... INT. PLAZA HOTEL SUITE - MORNING Debbie wakes up to see Manhattan doing the same out her window.   Dawn breaks over the skyline as she rises, stretches, and takes in the view -- her first good night’s sleep in four years. CUT TO: BERGDORF’S She enters the same revolving doors as she did yesterday, disappearing for a beat... CURTAIN WIPE: 9. 7.25.16 AND SHE EXITS (TIME CUT) Now dressed in a tasteful black suit with sensible shoes. CUT TO: A CEMETERY Gravestones compressed in a long lens and stretching to the horizon.   A massive 747 ",
      "dialogue_count": 0,
      "word_count": 1482
    },
    {
      "scene_number": 3,
      "slugline": "INT. KLAUS GUNTHER GALLERY - CHELSEA - CONTINUOUS Debbie walks into mecca for the downtown art scene.   KLAUS GUNTHER makes Gagosian jealous.   Sycophants, hipsters and a  lot   of money.   And in the center of it all stands Klaus himself: undeniably handsome, just as oily, he wears a white linen shirt unbuttoned to the jewlery.   You should see through this guy but you can’t.   Debbie grabs a glass of champagne from a waiter and crosses toward him. KLAUS   * Is talking with a group of young women, when he spots Debbie and shifts from charm to restrained terror.   He makes quick apologies and starts to leave... DEB Blocks his path. KLAUS (frozen) What are you doing here? DEBBIE Patron of the arts. KLAUS I have a restraining order. DEBBIE Good. She steps really close to him -- an intimate moment -- DEBBIE (CONT’D) Do you know what a shiv is? He feels something sharp against his ribs.   Gasps -- KLAUS Stop it -- DEBBIE I made this one.   Proud of it, too. See -- it’s important not to melt the toothbrush too much.   That way it keeps its length   and   the strength.   So when you stab, you slice up and around. Debbie drags the shiv up the front of his shirt, towards his neck.   To a bystander it might look like a flirtatious move with a large toothpick. 16. 7.25.16",
      "characters": [],
      "action_text": "DEBBIE (CONT’D) Nice face.   Inside you’re what we like to call “a pretty girl” -- KLAUS I’ll call the police -- Deb takes the shiv and slices up the front of his shirt, shredding it.   She pops the button on his collar, taking it for a souvenir. DEBBIE Auf Wiedersehen. Debbie strides out, still purposeful, while Klaus looks on, terrified. CUT TO: INT. CHINESE TAKE OUT All fluorescence and backlit pictures of the dishes.   Debbie stands at the counter -- draws a long breath of General Tso’s.   They hand her a white plastic bag. INT. THEATER -   LATE  It’s dark.   A few safety lights are on.   Deb enters the back of the theater and crosses to a staircase on the side of the stage carrying her take out. UPSTAIRS LOFT SPACE It used to be a rehearsal studio.   Vast and open with various bits of living area defined by loose furniture.   It’s chic in a very hard-to-define-kind-of-way. DEB Crosses to the kitchen area, fishes through drawers for a plate and decamps at the small kitchen table. CLOSER She takes out the still-warm white containers and dumps them on her plate.   Can’t get to the chopsticks fast enough... CATE (O.S.) Is that all for you? DEBBIE (turning/mouthful) Oh, hi.   Want some. CATE No. 17. 7.25.16 Cate’s wearing a silk chinese robe.   She crosses to the table.   Sits. CATE (CONT’D) It’s late. DEBBIE Took a walk. CATE Where? Deb doesn’t answer.   They look at each other for a beat and exchange five or six lines of unspoken conversation. CATE (CONT’D) Why would you do something like that? DEBBIE I had to. CATE No, you didn’t. DEBBIE Closure? CATE Bullshit.   Did he see you? DEBBIE  Oh   yeah. Debbie takes the shiv out of her purse and shows it to Cate. Toothbrush on one end, lethal blade on the other. CATE Jesus. (beat) Did you “use it?” DEBBIE Just a button. She puts Klaus’ button on the table.   Cate laughs.   They share the moment.   Then suddenly... CATE (calls out) Hey, Luis...   You gotta go. Cate doesn’t turn as the young man from the club enters with",
      "dialogue_count": 0,
      "word_count": 2653
    },
    {
      "scene_number": 4,
      "slugline": "INT. BHALLA JEWLERS - DAY In Hindi: AMITA (This diamond is a K -- at   best.)  AMITA’S MOTHER (It’s an H -- ) AMITA (You’re out of your mind.) AMITA’S MOTHER (I’m concerned about your vision) AMITA (This is piss   yellow   --) AMITA’S MOTHER (Why are you so vulgar.   If your father was alive...) AMITA (Grade it yourself!) AMITA’S MOTHER (This is why you have no husband.) Amita looks up, with the loupe on. AMITA’S POV -- THROUGH THE LOUPE Debbie (highly magnified) stands out the window -- waving, signaling for Amita to join her. CUT TO: EXT. STATEN ISLAND PROMENADE - MOMENTS LATER Amita approaches Debbie -- AMITA What’re you doing here? DEBBIE Sorry to hear about your pops. AMITA Yeah, thanks... (re: her mother/sotto) Sometimes I wish she’d join him. (beat) Sorry about Danny. 30. 7.25.16",
      "characters": [],
      "action_text": "DEBBIE Yeah well...   I got something for you.   A job. AMITA I heard that didn’t work out too well. DEBBIE Happens. AMITA What?   You want to run some stuff through the store? DEBBIE Little more than that. (beat) How long would it take you to make 8 pieces of jewelry?   If the stones are already cut. AMITA I don’t know.   Six hours? DEBBIE What if I told you didn’t have to live with your mother anymore? Amita raises an eyebrow... CUT TO: EXT. STATEN ISLAND FERRY Deb stands at the rail on her cell phone. DEBBIE (into the phone) Yeah.   She’s all good.   But we may have to put her up for a while. Had a fight with her mom. INT. CATE’S LOFT A 23 year old GIRL (huge dreads and lots of tats) sits cross legged in a knoll womb chair with an industrial looking computer on her lap.   Cate sits across from her staring as she pounds away at her keyboard. GIRL (suddenly) Wow. CATE What? 31. 7.25.16 The girl doesn't answer but stays focused on her screen. Cate leans forward, paying rapt attention. DEBBIE I am never taking the F train again. Debbie comes bounding through the doorway with loads of energy. DEBBIE (CONT’D) (sees the girl) Hi there. CATE Shh. DEBBIE What? CATE She’s “in.” DEBBIE In where? GIRL Is this what you mean?   There’s just a lot of vases. Cate leans over and looks at her screen. CATE Yeah.   That’s the Egyptian wing. DEBBIE Shes’s in   The   Met?  Debbie crosses over and looks. CATE (glancing at Deb) Security cameras. DEBBIE Wow. GIRL Here’s some more.   Just a lot of pictures... CATE Kandinsky. DEBBIE Hi.   I’m Debbie. 32. 7.25.16 She looks up.   Squints through the dreads. GIRL Nine Ball. DEBBIE What’s your real name? GIRL (shrugs) Eight Ball. DEBBIE We use real names around here. CATE Can we talk for a minute. PULLING HER AROUND THE CORNER They tuck into the kitchen. CATE She’s one of the best hackers in the world. DEBBIE I’m honored. CATE She has other clients.   They don’t know her real name either. DEBBIE She has other clients?   Now? CATE Yeah. DEBBIE ",
      "dialogue_count": 0,
      "word_count": 4394
    },
    {
      "scene_number": 5,
      "slugline": "INT. TIFFANY’S VAULT Rose looks nauseous, like she is about to faint, steadies herself.   Amita escorts her out. CUT TO: INT. WAREHOUSE - LATER A celebratory kick-back.   The crew drinks wine, Rose smokes a joint, trying to relax.   Debbie stands near the computer with Cate.   She finishes her whiskey, puts it on the table. DEBBIE All right, let’s do this.   C’mere -- They all gather round the printer.   Debbie looks to the crew. DEBBIE (CONT’D) Ready? Cate clicks “print” on the computer -- They stand over the 3D printer. A perfect glass replica of the necklace is birthed into a three dimensional life before their eyes.   It’s massive, almost a foot long, at least five pounds -- astonishing. TIME CUT TO: INT. THEATER - LATER Everyone is good and drunk.   The crew is gathered round. CONSTANCE FREESTYLES from the front of the stage as her cohorts look up her from the front row.   (NOTE: To be played over footage preparing for the heist.) TAMMY.   Teases her about her crush on Debbie and running a side hustle fencing. NINE BALL -- who lives in the dark web.   Stealin’ shit we don’t even know about... Then ROSE -- Teases her about dressing like a Wizard of Oz witch.   Broomstick etc.. AMITA -- her sister.   They both have wrist bands.   Where were you last night girl...   Amita embarrassed. Leaps from the stage landing in front of... DEBBIE AND CATE -- Her bosses.   Bobbsey Twins Boss Bitches, salutes the two of them.   “Can I have the night off?” CUT TO: 55. 7.25.16",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 259
    },
    {
      "scene_number": 6,
      "slugline": "EXT. CAESARS PALACE POOL - DAY (FLASHBACK) Deb lies on a chaise lounge eyes closed.   A shadow crosses over her. CATE (O.S.) Hello. INT. CASINO - LATER Deb and Cate stand at the roulette wheel as total strangers. Cate dressed stylishly is parked at the end.   Deb is higher upon the wheel enthusiastically betting red and black.   Deb downs a cocktail with flourish then calls out for another... DEBBIE Dr. Pepper and Jack please.   No ice. Even the waitress is incredulous and nods.   The croupier spins the ball.   Cate puts two chips on a column bet.   The ball falls onto a red number... DEBBIE (CONT’D) YES!   Rojo!   Awesome!   Better red than dead... (and then) Woohooo... CATE During the commotion past-posts five chips on her column bet- switching out high denominations for low ones.   As the croupier goes to pay her, she corrects him. CATE Actually, those are thousands on the bottom.  CUT TO:  A HOTEL BED An open suitcase, strewn clothes and twenty dollar bills. WIDER Deb watches TV while Cate counts the haul. CATE Nine thousand and sixty. DEBBIE (turns) That’s all? CUT TO:  56. 7.25.16",
      "characters": [],
      "action_text": "ITALY.   (OCEAN’S TWELVE)   RESTAURANT - ONE YEAR LATER... Having completed the heist, Danny and his team clink glasses. It’s a party: laughter, congratulations, poker game, champagne. CUT TO: CASINO QUEEN RIVERBOAT AND RESORT.   ST LOUIS, MO. Deb and Cate sit in the Paddlewheel Grill near the stern.   A man in suspenders and arm garters serenades on a banjo. DEBBIE Did you play with boys when you were little? CATE Only.  (beat)  ...You? DEBBIE Sometimes.   He wouldn’t let me most of the time.   He’d tell my parents he was watching me and then he’d ditch me. CATE Let it go, Deb. DEBBIE Two and a half million dollars. (incredulous) In art. CATE You said you weren’t gonna read about it. DEBBIE I read about it. (beat) And what are we doing?   We’re grinding it out in shitty casino’s every night.   We’ve even run out of casinos.   Now we’re in riverboats. CATE It’s not actually a riverboat. DEBBIE It floats. CATE Touché.  57. 7.25.16 DEBBIE We shouldn’t even be here.   We should be at Caesars lying in a cabana.  (manic)  We need something bigger. CATE No.   We don’t need something bigger. DEBBIE I do.   I need it.  CUT TO: A JOHN SINGER SARGENT (THE PRESENT) Priceless. INT. METROPOLITAN MUSEUM OF ART - AMERICAN WING Debbie moves through the art, searching for the right spot -- she wears a scarf, her hat dipped low, a backpack. ANGLE ON Madame X -- Debbie stares up at it. ANGLE ON Warhol’s Chairman Mao -- Debbie appraises... ANGLE ON Washington Crossing the Delaware -- She looks at the painting -- nods to Amita who peruses the hall.   Amita approaches the GUARD. ANGLE ON - AMITA AND THE GUARD AMITA (unfolding a map) Hi, can you help me with something? I’m a bit lost -- ROOM GUARD Of course, ma’am. 58. 7.25.16 AMITA I feel like I’m walking in circles. So I came from Egypt -- back there... ROOM GUARD Mesopotamia -- AMITA (fancy) Oh, huh -- (re: map) But now we’re in America...   Very confusing. ANGLE ON - DEBBIE, OTHER SIDE OF THE ROOM She takes out her backpack and pulls ",
      "dialogue_count": 0,
      "word_count": 3731
    },
    {
      "scene_number": 7,
      "slugline": "EXT. MARK HOTEL - SAME The BRINKS truck arrives in the front of the hotel. INT. LOBBY - MARK HOTEL Rose stands at the elevator doors looking up at the floor indicator.   As it descends toward her she grows more and more nauseous, stifling a gag as the doors opens... INT. PENTHOUSE SUITE - THE MARK HOTEL - MINUTES LATER Daphne, now in a robe, is getting her hair sprayed, her eye- shadow blended.   She glances in the mirror in front of her to see Rose and two men in suits behind her. DAPHNE KLUGER Is that it? Rose nods and stands to the side.   The two guards from Tiffany’s move into the room, carrying a large velvet jewel box.   There is a weird ceremony to all of this: the place goes quiet; the men march forward in an even cadence.   Rose crosses behind Daphne as the Harrington is revealed... DAPHNE Holy shit. ON ROSE She reaches forward and opens the top of Daphne’s robe, revealing the nape of her neck.   Rose puts the Harrington around her neck and fastens the clasp:   it sounds like tumblers clicking. ROSE WEIL Might be a little cold. DAPHNE And   heavy.  The mirror glitters -- it’s almost celestial. ROSE WEIL (deep breath) Ok.   Let’s get this off and get you dressed. She reaches up and starts to fiddle with the clasp which doesn’t seem to open. TITUS (TIFFANY GUARD) Oh -- can’t get it off like that. He steps forward pulling out a small pen like cylinder. 77. 7.25.16",
      "characters": [],
      "action_text": "TITUS (CONT’D) Special clasp.   Needs this magnet. Titus crosses behind her and fits the device over the clasp. He gives it a half turn and the necklace unlocks. CLOSE UP.   ROSE She is somewhere between ashen and light green.   Rose takes quick shallow gasps clutching the arm of the chair. ROSE WEIL Oh that’s... Brill--iant. (forced smile) Let me see that again. Titus, full of pride fastens the clasp, then shows the small magnetic cylinder like a magician demonstrating a trick. DAPHNE Takes in all of this from the mirror.   The necklace.   Titus behind her...   and behind him Rose who steadies herself with one hand, clutching her iPhone in the other . DAPHNE’S POV.   ROSE’S IPHONE (TIGHT) She points it at the back of Daphne’s neck. INT. WAREHOUSE The women have loaded most of a white panel truck and are about to head out when Debbie gets a text. CLOSER.   DEBBIE She turns the same color as Rose.   Motions for Cate. CATE What? DEBBIE Not... (tries to swallow) ...Good. THEIR POV.   VERY SHAKY VIDEO Of Titus’ hand turning the clasp. TITUS (on the video) “See it’s the magnet that does it.” 78. 7.25.16 INT. BROOKLYN APARTMENT Nine ball’s little sister Veronica (15 years old) is capturing a Pokemon Go character on her fire escape.   Her phone rings, interrupting the capture. VERONICA Goddamn it. NINE BALL Hey. VERONICA I was about to catch a Rhyhorn, Leslie.   What do you want? INT. LOFT They huddle around a speaker phone. CONSTANCE (turns)  Leslie ? NINE BALL I’ll kill you. (to her sister) We’re in a jam, sis.   Need your help. INT. SUBWAY Veronica has an array of magnets spread over the seat beside her.   She tries to look at the shaky video, speaking to Nine Ball on the speaker phone. VERONICA I think I got it.   Just a magnet with double A battery.   I’ll give her a positive and a negative pole so she can flip around when she’s using it. INT. VAN Cate drives.   Everyone hangs on the conversation. NINE BALL (into phone) Awesome, V. TAMMY Really?   She fixed it? Nine B",
      "dialogue_count": 0,
      "word_count": 8235
    },
    {
      "scene_number": 8,
      "slugline": "INT. CATE’S WAREHOUSE - PRESENT Debbie motions to all of them a job well done. DEBBIE And   that’s   how you all get: Sixteen Million, Five hundred and twenty nine thousand dollars. (smiles) A piece. TAMMY Not quite. DEBBIE Right.   We gotta sell ‘em.   And Tammy here has recruited a few old friends to help us do that. CUT TO: INT. AUCTION HOUSE - ZURICH - DAY Reuben sits in the audience, eating a pretzel with mustard. GERMAN AUCTIONEER (O.C.) (in German) The collection is sold!   To the gentlemen in front for thirty-eight million dollars. Reuben looks to the GERMAN BUYER, demonstrating the restrained joy of acquisition. Reuben wipes his mouth, rises, walks out -- PRELAP:   Gavel slamming. CUT TO: INT AUCTION HOUSE - SHANGHAI - DAY The Auctioneer stands before a group of bidders -- some video conference in, projected onto a wall, some bidders, representing in person, hold phones to their ears. CHINESE AUCTIONEER Sold -- to the gentlemen on the left... LINUS (Matt Damon) leans against the wall in the back of the room, remaining inconspicuous. CUT TO: EXT. PROVENANCE - CAPE TOWN - DAY Basher emerges.   He puts on his sunglasses. 122. 7.25.16",
      "characters": [],
      "action_text": "SFX:   The gavel slams. INT. SOTHEBY’S - MOSCOW - EVENING Another gavel. Saul Bloom pets a cat seated on his lap.   Smiles... CUT TO: EXT. 7TH AVENUE SUBWAY STOP - GREENWICH VILLAGE - DAY Debbie stands at the entrance to the subway talking to Tammy. Tammy has that slightly spent quality of someone who has recently “been emotional.” TAMMY I’m in for the next one.   You know that. DEBBIE Of course. TAMMY And if you get back to New York maybe we could... DEBBIE This is better.   We talked about it.   “Little League.” TAMMY (nods) Yeah...   I wrote you a letter, but every time I read it just sounded so lame so... (pulls something from her bag) Here. Tammy hands her a lucite replica of the Statue of Liberty from the 3D printer. DEBBIE Thanks. TAMMY Thanks for this. She pats the black messenger back hanging from her shoulder. It obviously contains her cut. DEBBIE Well. She goes to hug Tammy who tries to lean-in but Deb gives her the cheek. 123. 7.25.16 TAMMY Right. INT. SUBWAY STATION Deb pushes through the turnstile and moved up to the track waiting for the 1.   She heads all the way down the platform toward the far end waiting for the last car. IT ARRIVES Whizzing into the station with a blur.   The train comes to rest and Deb moves through the last set of doors into the subway car. INT. SUBWAY Seated in various positions around the car are the rest of her crew.   Cate, Rose, Nine Ball, Constance, Amita.   Each of them has a black canvas messenger bag.   Deb sits near Cate. None of them make eye contact. The train moves.   A panhandler sings “Lucy in the Sky with Diamonds.”   Everyone stares straight ahead. THE TRAIN SLOWS AGAIN Coming to a stop.   Amita gets up to leave.   Gives Deb a wink. DOORS SHUT.   SUBWAY STARTS AGAIN.   (TIME LAPSE) With each locked-off dissolve, another member of the team disappears -- There are now six, then five, then four, then finally... ROSE WEIL (Gushy/tears) I’m really going to miss you. DEBBIE Shh. Rose nods quickly.   Remembers her cov",
      "dialogue_count": 0,
      "word_count": 661
    }
  ]
}