{
  "slug": "okja-2017",
  "title": "okja",
  "genre": "horror",
  "format": "film",
  "scenes_count": 9,
  "characters_count": 0,
  "characters": [],
  "total_words": 22368,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. STREAM, MOUNTAIN - DAY MUNDO PARK (39) hikes up along the stream, covered in sweat. Dressed in a suit and tie, he carries a bag that bears the 'Mirando Korea' logo. He stops for breath, and looks down the mountain behind him. He takes out his phone. The signal is poor, and he holds up his phone at various angles before finally getting a bar and dialing. WOMAN'S VOICE (O.S.) Hello? MUNDO (Into the phone) Where are you? What's taking you so long? WOMAN'S VOICE (O.S.) (Out of breath) We're all so out of shape. And Dr. Johnny is being... somewhat difficult. MUNDO (Surprised) Dr. Johnny? But he's so much fun on TV! WOMAN'S VOICE (O.S.) (Thinly) Right. On TV. But not in the water. MUNDO Water? WOMAN'S VOICE (O.S.) He dove into the water saying he couldn't stand the heat. Now he won't come out. (quietly) Aw, disgusting. I think he’s doing a secret piss. EXT. FRONT YARD, MIJA'S HOUSE - DAY Hee Bong stands at the faucet and pours water into a bucket. He turns off the faucet almost as soon as he turns it on. Still thinking he poured too much, he pours off a little into the basin before handing the bucket to Mundo. Mundo gulps down the water, thoroughly covered in sweat. Mija washes Okja in the front yard. 18.",
      "characters": [],
      "action_text": "HEE BONG (quietly) I thought a bunch of you were coming. Mundo glances down the hill. MUNDO They're coming. MIJA (calling over) It's nice to see you, Uncle Mundo. Why are you here? Mundo steals a glimpse at Mija. MUNDO (silently mouthing) You didn't tell her? Hee Bong looks away without answering. Mundo looks frustrated. He walks over to Okja. Mija claps and gives a sign to Okja, who obediently sits on the ground. Mundo removes the small black box on Okja's ear and unlocks the waterproof casing. He opens it to reveal various computer chips and SD card slots. He removes the SD cards and plugs them into his laptop. Numbers and graphs showing data about Okja's health abound on the screen:   \"Blood Pressure,\" \"Temperature,\" \"Heart Rate.\"  The clean, design-conscious interface of the   \"Mirando Super Pig Health/Growth Management\"   software. Mija looks over Mundo's shoulder, lustily eyeing his brand new Macbook when... We suddenly hear someone SHOUT in English. JOHNNY Fuck me! (panting) All right. I'm here. I'm fucking here, goddamn it. Hee Bong, Mija, and Mundo all turn their heads. A large man struggles up the steep incline, bitching and moaning all the way. This is Dr. JOHNNY WISEMAN. MIJA (eyes wide) It's that guy! From TV!  19. She runs excitedly to Hee Bong - leaving Okja at the back of the yard. MIJA (CONT'D) (to Hee Bong) It's him, right? From Magical Animals! JOHNNY You... (panting) You just had to... (panting) ... drag me all the way up to this fucking mountain top. MIJA (To Hee Bong) He came to meet Okja even though she isn't in the competition any more! He must think Okja is that special! Mundo looks uneasy. Johnny suddenly notices Mija. Then he is abruptly back to his panting and bitching. JOHNNY All the other Super Pigs were on flat land, accessible by car. Japan's Super Pig was about a five minute drive from the airport. I notice that you leave the fucking mountain top Super Pig to the end because you knew the climb would rile me. Well, guess what? I'm ril",
      "dialogue_count": 0,
      "word_count": 4100
    },
    {
      "scene_number": 2,
      "slugline": "INT. TRAILER, MIRANDO TRUCK - CONTINUOUS THUMP. Okja looks up at the sound. She SQUEALS and hikes up her head. The Uniformed Employees also look up curiously. Okja can feel Mija's presence above her. She touches the ceiling with her face as she continues to SQUEAL. EXT. TRAILER ROOF, MIRANDO TRUCK - CONTINUOUS Mija balances herself on the moving trailer. Through the fluttering strands of her hair she sees an overpass approaching. INT. CAB, MIRANDO TRUCK - CONTINUOUS Mundo sees the overpass. It seems very low. He looks over at Kim, who drives, still looking blank. MUNDO What's the height of this truck? Kim gives Mundo a listless, nonchalant look. KIM Uh, they did tell me...   it was, uh...  Still, Kim doesn't slow down. The overpass approaches fast. The sign that indicates the height comes into view: 4.2 meters. Mundo stares at Kim. EXT. TRAILER ROOF, MIRANDO TRUCK - CONTINUOUS   37  Mija drops to her stomach. She lies flat and closes her eyes.  The truck blasts through.  INT. CAB, MIRANDO TRUCK - CONTINUOUS KIM I guess they said it was less than 4.2 meters. Mundo wipes his sweat, relieved. 36.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 191
    },
    {
      "scene_number": 3,
      "slugline": "EXT. TRAILER ROOF, MIRANDO TRUCK - CONTINUOUS Mija sits up. She made it. Just. INT. CAB, MIRANDO TRUCK - CONTINUOUS Kim continues to floor the gas pedal with a blank face. Mundo looks ahead and sees another overpass quickly approaching. This time the sign reads 3.9 meters. MUNDO (Yelling) The height! Can. You. Remember? Kim slowly shakes his head and indicates his foggy memory. KIM (mumbling) I can't...   They made me drink a lot at the staff dinner last night... The overpass approaches. Mundo turns white. He instinctively shrivels his body like a squid on a grill. EXT. TRAILER ROOF, MIRANDO TRUCK - CONTINUOUS Wind batters Mija's face. She squints and looks ahead at the overpass. Her muscles tense as she instinctively senses danger. INT. CAB, MIRANDO TRUCK - CONTINUOUS Mundo is too paralyzed to speak. Kim floors the pedal with that dead expression on his face. The 3.9 meter overpass approaches fast. INT. TRAILER, MIRANDO TRUCK - CONTINUOUS Okja lets out a piercing SQUEAL - as if calling for Mija. The Uniformed Employees cover their ears. EXT. TRAILER, MIRANDO TRUCK - CONTINUOUS As Okja SQUEALS, Mija runs toward the back of the trailer. The overpass is about to slam the back of her head when... 37.",
      "characters": [],
      "action_text": "...Mija jumps and hangs onto the rear door handle of the trailer. SPARKS fly as the trailer roof scrapes against the underside of the overpass. The horrible sound of metal scratching against concrete, Mundo's scream, and Mija's shouting overwhelm our ears at once. Dangling from the handle, Mija BANGS on the rear door of the trailer. INT. TRAILER, MIRANDO TRUCK - CONTINUOUS The Uniformed Employees stand up to investigate the banging when they get caught between Okja's massive body and the trailer wall. They scream in pain as Okja twists her gigantic body towards Mija. Mija and Okja cry for each other. I/E. MIRANDO TRUCK - CONTINUOUS MUNDO What was that noise? But Kim is preoccupied by something different - something VERY STRANGE occurring O.S. His eyes widen. MUNDO (CONT'D) (Beat) What? Mundo follows Kim's startled stare to the side of the truck. MUNDO (CONT'D) (yelling)  TERRORISTS?!  A black semi is driving purposefully alongside the Mirando truck. The two occupants - both staring at Mundo - are wearing BLACK SKI-MASKS. One wears a   SUIT   underneath, the other a casual   JACKET . JACKET (broken Korean) I'm not terrorist... Nice meet you. But his strange accent, along with the wind noise and roar of the trucks engines, make it impossible for Mundo and Kim to understand him. 38. MUNDO What? JACKET I don't want hurt you. I don't like fighting. Stop car! MUNDO (to Kim) What the hell are they saying? JACKET I said I don't like fighting. Come on, guy. Just cooperate. (to the Suit) Shit. Fucker doesn't even understand my Korean... The   Suit   just looks at the Jacket - his eyes are a curious color. The   Jacket   rolls up the window. He fixes his ski mask and abruptly turns the handle. SLAM. The black semi rams into the side of the Mirando truck. Mundo screams like a girl. The Mirando truck gets sandwiched between the black semi and the underpass wall. Sparks FLY. Nearby DRIVERS react with horror as the two mammoth trucks duel. Horns blare everywhere. Amidst the chaos ",
      "dialogue_count": 0,
      "word_count": 1729
    },
    {
      "scene_number": 4,
      "slugline": "INT. UNDERGROUND SHOPPING CENTER Instead of answering, the   Jacket   lifts his t-shirt and shows Mija a TATTOO - a balaclava-wearing, angel-winged Animal Liberation Front member embracing a lamb in his arms. Mija stares blankly at the tattoo as POLICEMEN come running from the opposite end of the passage with tear gas guns drawn. The group - along with Okja and Mija - stand and run. The police give chase. The   Jacket   sees a passage that leads to a garage. He directs the other members towards it and shouts into the phone. JACKET Underground garage! Zone 3! INT. UNDERGROUND GARAGE - CONTINUOUS The group bolt out of the door just as the black semi speeds toward them from the opposite side. The back doors of the trailer are already open and Mija jumps in first. She gives a sign to Okja, who climbs in with great difficulty. The A.L.F. members push Okja's behind with their combined strength. Again, ONE seems frailer than the others. Once Okja is inside, the Assailants climb aboard. The Police finally arrive and haphazardly fire their tear gas guns, but to no avail. The black semi speeds away, the back doors still swinging open, the policemen running pathetically after them. Suddenly a man squeezes through the group of Policemen and leaps to the front with tremendous speed. It is none other than MUNDO, with the UNIFORMED MIRANDO EMPLOYEES running behind him. Mundo chases the semi with fierce determination. The A.L.F. members watch with mild curiosity. Okja suddenly bends her body and perks up her ears as she turns to Mija. Mija stares in disbelief. MIJA Now? Mija sighs. 44.",
      "characters": [],
      "action_text": "MIJA (CONT'D) Well, I guess you've been holding it in for a long time. Mija gives Okja the sign.  Okja begins pooping. The scale is beyond epic.  Her tail spins like a propeller as she unleashes a veritable 'shit storm.' Mundo has nearly closed the gap when he's BOMBARDED with countless pieces of shit. Two A.L.F. members look on as Mundo cries in horror. A.L.F. MEMBER 1 I never tire of the way they shit. A.L.F. MEMBER 2 Could watch it all day. The black semi reaches the exit. It smashes through the gate - leaving Mundo a dejected shit-covered blob in the distance. INT. TRAILER - CONTINUOUS Mija hugs Okja's face tightly. The A.L.F. members - still in their ski-masks - watch them. MIJA (Whispering) I'll never leave you again. JACKET (Translating) I'll never leave you again. MIJA I’m taking you back to the mountains. JACKET (Translating) I’m taking you back to the mountains. Mija glances suspiciously at the Black Assailants in their ski-masks. FEMALE A.L.F. MEMBER Stop with the creepiness, K. JACKET What? I’m not being creepy. 45. FEMALE A.L.F. MEMBER You don’t think that’s creepy? Translating everything she’s saying in your balaclava and your eerie man’s voice? JACKET (Thinly) The mission is no longer as we’d planned it because the girl showed up so I’m providing the team with unfolding intel. And BY THE WAY. This isn’t my “eerie man’s voice”. It’s my VOICE. SUIT (With quiet authority) Shhh! The bickering A.L.F. members dutifully shut up. The   Suit  walks over to Mija. He crouches to her eye-level and takes off his balaclava. He is   JAY   - good-looking, serious (30s). As he removes his balaclava, the other A.L.F. members take off theirs. They're all younger than Jay, in their 20s. Jay introduces each member to Mija.   Jacket   is   K   (Asian). The woman is   RED . The two others are men -   BLOND   and   SILVER . Each are named after the color of their hair. Silver looks sweet, but socially awkward, very thin. Red and Blond look restless. JAY ...And my name is Jay",
      "dialogue_count": 0,
      "word_count": 2336
    },
    {
      "scene_number": 5,
      "slugline": "EXT. RIVERSIDE EXPRESSWAY / TRAILER, BLACK SEMI - EVENING   57  Once K jumps, the A.L.F. member who was driving stops the truck and runs out. He throws his outdated folder phone into the river and himself jumps off the expressway. SPLASH. The police cars and Mirando security cars surround the black semi. POLICEMEN run out of their vehicles and look down at the river, defeated. The circular ripples from the last splash slowly disperse.  POLICE 1 You swim? POLICE 2 Uh-uh. Never. While the Police look for a way down to the bank, the Uniformed Mirando Employees open the door of the trailer. Headlights and red police lights flood inside the trailer to reveal Okja and a wide-eyed Mija standing side by side. Mija tries to hide her confusion and anger, but her eyes are moist with tears. AMERICAN NEWS ANCHOR (V.O.) The Animal Liberation Front...  INT. CONFERENCE ROOM, MIRANDO COMPANY HEADQUARTERS - DAY   58  ON THE TV: Amateur footage of A.L.F. members with bolt cutters and other tools ambushing the Mirando truck in the underpass.  AMERICAN NEWS ANCHOR (V.O.) ...hasn't been in the headlines for a number of years, but they are back in the spotlight after today's extraordinary events. 16 people - including Lucy Mirando, Frank, Johnny, and Jennifer - sit around the table and watch the news. They are silent, their expressions grave. The scene looks exactly like the photo of Obama, Hillary and the national security team watching the Bin Laden raid in the White House situation room - right down to the gestures and the facial expressions. The only unruffled person among them is head assistant Frank, who sits in the middle in a leisurely, presidential manner. AMERICAN NEWS ANCHOR (V.O.) The group seems to have been highly organized. 55.",
      "characters": [],
      "action_text": "ON THE TV: We see   KIM   - the Mirando driver - being interviewed in front of the truck spray-painted with the \"A.L.F.\" sign. He speaks surprisingly good English. KIM (smiling) They were fast, organized, and on point, like ninjas. No way a salary man from Mirando could take them. (laughs) Mirando is completely fucked! Completely fucked! A BEEP censors Kim every time he says \"fucked,\" but he says it with such emphasis that it is impossible not to read his lips. The Mirando employees bat their eyes nervously, worried about Lucy's reaction. ON THE TV: A repeat of the news footage of A.L.F. members running in formation. EXECUTIVE 1 Look at   that   one! He points at the blurry figure of Silver, lagging behind. EXECUTIVE 1 (CONT'D) Get some exercise, you dick! He laughs and glances at Lucy for approval. The tension is palpable. FRANK I wouldn't worry too much, Luce. The A.L.F technically failed. EXECUTIVE 1 They weren't even able to take the product. EXECUTIVE 2 This is just a kerfuffle over nothing. We shouldn't make a big deal out of it. EXECUTIVE 1 It actually means the security at our US facilities and main office is so airtight that they wouldn't even think about breaking in. That's why they went all the way to South Korea.  56. EXECUTIVE 2 The important thing is that the pig is on its way to New York now. JENNIFER (Brightly) Right! The Best Super Pig Fest will continue as planned! Their eyes flicker nervously towards Lucy - who has thus far said nothing. Finally, she stirs. LUCY (quietly) I know what they call me. They call me a psychopath. JENNIFER YOU'RE not a psychopath! THEY'RE the psychopaths, right, Ms. Mirando? They're narcissists. Jennifer glances around the conference room, pleased with herself. LUCY Do narcissists wear balaclavas? FRANK Oh, crazy radicals have been calling us psychopaths since the '60s! You're a psychopath! Your sister's a psychopath! Your daddy was a psychopath! We barely notice, but Frank has a CELLPHONE concealed in his hand. We see t",
      "dialogue_count": 0,
      "word_count": 3242
    },
    {
      "scene_number": 6,
      "slugline": "INT. MARKETING DEPARTMENT, MIRANDO HQ - DAY The MONTAGE MUSIC continues. CLOSE on a screen: We see an amateur You Tube VIDEO of Mija riding Okja in the Seoul supermarket. It’s had 126 million views. A team of young MIRANDO MARKETING EMPLOYEES sit in front of their computers and eagerly watch their boss, Jennifer. JENNIFER (Brightly) And... GO! All at once, the Mirando Marketing Employees begin enthusiastically typing. CLOSE on their screens: They're typing messages on TWITTER and TUMBLR and FACEBOOK and YOU TUBE and INSTAGRAM - an orchestrated corporate endeavor to flood the Internet with Mirando positivity: \"Yo, I heard the hot You Tube girl riding the giant pig is coming to NYC!!!\" \"Cute!\" \"Totally my type!\" \"She's gonna be at the Mirando Best Super Pig Fest in NYC!! AWESOME!\" \"LOVE HER!!!\" \"The hot girl and Dr. Johnny and the giant pig together in NYC!!! SO COOL!!!\" INT. PLANE - NIGHT Mija sleeps, her body awkwardly folded in her first-class seat. A FEMALE CABIN ATTENDANT stops to pull up her blanket. She removes the “ Smile: Beginner's Conversation Englishî   book from her hand and puts it in the seat-back pocket. Mija sweats from a nightmare. Her eyes twitch under the lids. INSERT - MIJA'S DREAM / FLASHBACK Grainy B & W footage. POV of Mija sitting in the backseat of a compact car: Okja - at this point a piglet - looks up from Mija's embrace and tries to lick her face/the CAMERA. In the front seat, we see the back of Mija's DAD, who turns toward Mija, but whose face is washed featureless by the strong backlight. We also see the silhouette of Mija's MOM in the next seat. Her mouth is open wide as if to scream, but we can't hear anything. 70.  \"   book \"",
      "characters": [],
      "action_text": "Through the front windshield, we see a large truck crossing the yellow line of the narrow mountain road and hurtling toward Mija's car. Okja the piglet SQUEALS in the foreground. CUT TO: The car is crashed in the woods on the steep incline bordering the road. Okja crawls out of the broken window and looks inside the car with a worried look. We see five-year- old Mija bleeding, her eyes out of focus. Okja climbs toward the road as fast as she can. CUT TO: Grainy footage from a fixed high angle CAMERA... seems to be traffic camera footage from the road: Okja climbs onto the road and begins SQUEALING frantically toward the cars as they whiz by dangerously close to her. One car stops, and a YOUNG MAN steps out. Okja continues to SQUEAL as she leads the man down to the woods. The man discovers the wreckage and hurries down the incline after her. The upbeat MONTAGE MUSIC changes into... I/E. LABORATORY ENTRANCE, PARAMUS, NEW JERSEY - EVENING ...DARK, OPPRESSIVE MUSIC. CLOSE ON Okja's terrified face as she's dragged into the dilapidated warehouse - the front for the laboratory.   The lights are dim and the atmosphere ominous. I/E. NEARBY MOTEL ROOM - CONTINUOUS The A.L.F. team is gathered around the laptop, eyes anxiously on the screen. Red opens the large bag and takes out a round satellite dish. K connects the satellite dish to the receiver. With the dish up, static decreases and the image becomes clearer. JAY Are we recording? K Of course. We begin to see the inside of the secret laboratory through Okja's POV. The A.L.F. members all lean in. 71. SILVER Oh my God. INT.   LABORATORY - WHITE ROOM - CONTINUOUS Okja's POV: We see small cages lined on either side of the hallway, each containing tiny Super Piglets: A piglet with a hideously large tumor, one with red, veiny eyes and neck- twitching tic symptoms, one dragging its deformed hind legs... Victims of genetic experimentation. They SQUEAL loudly when they see Okja. Okja also lets out a heart-wrenching SQUEAL as if comm",
      "dialogue_count": 0,
      "word_count": 4331
    },
    {
      "scene_number": 7,
      "slugline": "EXT. OUTDOOR STAGE - CONTINUOUS LUCY Don’t worry! I'm not here to bore you with some corporate speech. I'm here to introduce you to a real superstar! Maybe you've already seen this amazing little girl on You Tube enjoying a shopping trip in Seoul! The audience laughs. JOHNNY I wonder what she bought?! Maybe some oinkment! Or maybe a DVD. Jurassic Pork? Or a copy of Porks Illustrated! If she did, I hope she doesn't HOG it! I want a look at the swimwear models myself!! The audience and Lucy groan. Lucy puts up her hand to shush everyone. LUCY So let’s all welcome an extraordinary young girl! Acoustic indie music plays through the loudspeakers. LUCY (CONT'D) A local farmer who raised her Super Pig in wild and beautiful nature with more love than I could have ever asked for. With a loud WHIR, the barrel-like lift containing Mija begins to rise. Mija's nervous face peeks over the stage. LUCY (O.S.) (CONT'D) The fearless pig rider from all the way across the globe! Please welcome, Miiii - Jaaaaaaa -! Mija turns bright red upon seeing the cheering crowd. She waves at them with an awkward smile. But she keeps her focus. Mija's eyes suddenly widen.   She sees Okja approaching the stage on a parade float.  LUCY (CONT'D) And here she is! Our ultimate Super Pig! Okjaaaa! 89.",
      "characters": [],
      "action_text": "The crowd cheer as they turn around. Okja stands atop a parade float decorated with trees and flowers. She feeds on the real grass covering the top of the float as it approaches slowly. Mija cups her hands around her mouth and yells, MIJA Okja! Mija waves her arms wildly, but Okja doesn't look up.   She merely continues to chomp on the grass. LUCY Separated by a cruel twist of fate, Okja and Mija! Best friends forever, reunited by the Mirando Company! The Mirando Event Staff begin to penetrate the crowd in a single file. Once they've threaded through, they divide the crowd to make a path. It is almost like the parting of the Red Sea. The parade float enters the path and proceeds toward Mija. Jay stands among the crowd. He looks up at Mija and scans the surroundings, on high alert. MIJA Okja, it's me! (sobs) I came for you! Jennifer stands below the stage eagerly awaiting the dramatic reunion. JENNIFER 3...2...1... Okja is now only a few feet away from Mija, but she still doesn't look up. She continues to mindlessly chew on the grass. The crowd begins to stir, and Lucy becomes nervous. Finally, Mija jumps at Okja and grabs her face. MIJA Okja... What's wrong? Okja shakes her head from side to side like she has a tic. Mija lifts up Okja's drooped eyelid. MIJA (CONT'D) AAAHH!!  90. The crowd hold their breath. Silence spreads throughout the plaza. CLOSE ON Okja's eyes. They resemble shark eyes. No focus, no soul. Both eyes are completely saturated blood-red. MIJA (CONT'D) What did you do to my Okja..? BUZZ. Piercing static noise as the LED multi-screen loses its picture. The clips of local farmers in vast, unadulterated nature disappear from the screen. Jay picks up his cell phone as he stands amidst the confused crowd. JAY (in a small voice) Hurry up! Now! INT. LED MULTI-SCREEN - CONTINUOUS BLOND Okay, okay. (grumbling to himself) This is like the most advanced hacking ever endeavored. Blond unplugs the cable from the monitor's HDMI port and holds it in his mouth. He ",
      "dialogue_count": 0,
      "word_count": 3880
    },
    {
      "scene_number": 8,
      "slugline": "INT. SLAUGHTERHOUSE - NIGHT Mija enters the 'factory of death'. The structure is labyrinthine, and she has no idea where to go. She's consumed by shock and fear. The humidity, the revolting smell, the deafening noise, the slick, blood-covered floor. A traumatic sight for a girl who grew up in the mountains. Various slabs of meat hanging from metal hooks move steadily along the aerial conveyor system. Instinctively, she runs in the opposite direction of the movement. WORKERS wearing large noise-blocking earmuffs stand along the conveyor system and go about their jobs. They look at Mija with some curiosity, but return to their work. They're unable to leave the ever-moving production line. Mija finally arrives at the   stun box   - aka the execution box. She sees a Super Pig being forced into the box. Its head is firmly fitted into a hole in the front. A YOUNG HISPANIC WORKER aims a large   bolt gun   at its forehead and prepares to shoot when he sees Mija running toward him. He briefly hesitates but soon returns his attention to his task. CLOSE on Mija’s face. We hear a BANG. The worker has evidently pulled the trigger. Mija is too horrified to even scream. Mija freezes after witnessing the execution in all its gruesome reality. The next Super Pig is led into the stun box. It's   Okja.  MIJA (a trembling voice) Okja... Mija goes blank, completely petrified. She looks straight at Okja, whose head is being threaded through the 'hole of death.' MIJA (CONT'D) It's okay... Okja seems to know that death is imminent. She desperately tries to free her head. She looks up at Mija with tear-filled eyes. MIJA (CONT'D) Because... Mija's voice trembles. The Hispanic Worker looks at Mija as he reloads the bolt gun. He doesn't know who the hell this girl is or why she's here. He just carries on with his work. 105.",
      "characters": [],
      "action_text": "MIJA (CONT'D) Even this man... With his eyes still on Mija, the Hispanic Worker aims the bolt gun at Okja's forehead. Okja closes her eyes when she feels the cold barrel of the bolt gun on her forehead. Tears fall. Mija looks into the Worker's eyes. MIJA (CONT'D) ...he doesn't want to do this. Mija raises her hand at the worker. 'Hold on.' She reaches into her back pocket with her other hand. For some reason, the Hispanic Worker is compelled to hold back from pulling the trigger. He looks into Mija's eyes. Mija removes a PHOTOGRAPH from her back pocket. She shows it to the Worker. It's one of the photos from Mija's room. 10- year-old Mija tightly hugging Okja. The Hispanic Worker squints at the photo, his bolt gun still trained on Okja's forehead. The production line becomes backed up, and the ALARM begins to sound. Red lights flash throughout the slaughterhouse. CLOSE ON the Hispanic Worker's ambiguous expression. He points at the photo Mija is holding -   'that pig...'   - and then points at Okja -   '...is this pig?'  Mija nods quietly. The Hispanic Worker freezes. The finger around the trigger trembles lightly. Just then Jay and K arrive, out of breath. They stop next to Mija. Okja stays absolutely still with her mouth fiercely clamped and eyes closed. Suddenly... A loud metallic CREAK. The large stun box leans to the side. We see the Hispanic Worker holding down the button.  Okja, still alive, slides onto the conveyor belt below.  Mija's legs give in and she falls on her knees. She embraces Okja's head. Her arms continue to shake. The Hispanic Worker looks down at them with a heavy heart. But he soon breaks out of his lull and returns to work like nothing happened. He brings in the next pig. The ALARM and the red lights stop - the production line being back to normal.  106. Mija sobs as she watches the continued death march. K hurries over and helps Mija onto her feet. Jay leads the group toward the exit. As they round the corner... NANCY Was this what caused t",
      "dialogue_count": 0,
      "word_count": 2263
    },
    {
      "scene_number": 9,
      "slugline": "INT. BUS - DAY The bus speeds through city streets. Jay's face fills the foreground. He looks back at the seats behind him to see... Red, Blond, Silver scattered around the bus. They each greet him with a knowing glance or a slight hand gesture. Silver looks healthy, rejuvenated. K enters the FRAME and sits next to Jay. K (quietly) It's going to be big. Record- breaking. A lot of folks have flown in from the Midwest and Canada. JAY Great. K Oh, I want to introduce you to a new member. When K waves, a small Asian man enters the FRAME. We recognize him as KIM - the ex-Mirando truck driver. He shakes hands with Jay and returns to his seat in the back. K (CONT'D) He runs 'Mirandoisfucked.com'. Just arrived here from Seoul. Kim sits between Red and Blond and chatters incessantly like a little bird. K (CONT'D) He's a chatty one... Jay smiles and opens his bag to remove a black balaclava. K gives a signal to the other members, and they all take out their balaclavas. The sound of drums and marching band music grows louder as the demonstration site approaches. JAY I'm guessing most of the Mirando big wigs will be there. K Of course. Including Nancy. Jay flashes a slick smile as he puts on his balaclava. The other members don theirs as well. The remaining passengers take out balaclavas too, revealing themselves to be A.L.F. members. A sea of black all around. 113.",
      "characters": [],
      "action_text": "The only people without balaclavas are two OLD LADIES who look around with befuddled looks. The bus loudly rumbles through the bright sunlight, and the music from the festival reaches a crescendo. As the MUSIC continues, the remaining CREDITS begin to CRAWL OVER BLACK.  114.",
      "dialogue_count": 0,
      "word_count": 296
    }
  ]
}