{
  "slug": "on-the-basis-of-sex-2018",
  "title": "on the basis of sex",
  "genre": "comedy",
  "format": "film",
  "scenes_count": 9,
  "characters_count": 0,
  "characters": [],
  "total_words": 23031,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. HOTEL BATHROOM - DAY Concealer, lipstick, mascara on the counter. RUTH BADER GINSBURG (36) is applying blush. When she’s finished, she considers her reflection. She puts on A GOLD, SUNBURST PIN. And tries a smile. ..... But it looks forced. She drops it. A breath. And she tries again. A different smile. And... RUTH May it please the court. Not right yet. A smile. And... RUTH (CONT’D) Your honors and may it please the court... That’s not it either... RUTH (CONT’D) May it please the court. She looks herself in the eye one more time. CUT TO: MAIN TITLE -- OVER BLACK:  ON THE BASIS OF SEX  HEAR: Driving, martial music. Horns and drums. It’s the Crimson fight song   “Ten Thousand Men of Harvard.”  AS A MALE CHORUS joins... EXT. AUSTIN HALL - DAY  Well groomed white MEN (20s) march through a quad. Into an impressive building with columned arches.  “Ten Thousand Men of Harvard want victory today....”  They’re the future leaders of America. And in their well-cut dark suits, with their cocky grins, it’s clear they know it.  “For they know that o’er old Eli, fair Harvard holds sway...”  But amidst the pants and loafers -- GLIMPSE: a pair of high- heeled shoes, a skirt swaying, shoulder-length brown hair.  “So then we’ll conquer all old Eli’s men...”  1",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 221
    },
    {
      "scene_number": 2,
      "slugline": "INT. AUSTIN HALL - DAY  AS THEY ENTER AN AUDITORIUM: She slows her step. Letting the men pass... IT’S RUTH (23 here). Petite, lean and striking. She takes in the size of the place, its grandeur. And is awed.  “And when the game ends, we’ll sing again...”  Proud, she continues down the center aisle.  “Ten thousand men of Harvard gained victory today!”  Ruth finds a seat. And as the crowd quiets, smiles to the man she’s settling beside. He stares. Confused by her presence. IN FRONT: A line of seated professors. AMONG THEM: Professor Ernest Brown. ERWIN GRISWOLD (52, formidable) comes to a podium: GRISWOLD Settle down, please. ... Be seated.  SUPER:   1956  GRISWOLD (CONT’D) My name is Erwin Griswold. I’m the dean of this place. ... Welcome to Harvard Law School. We have no glee club here. The work is hard. The load is heavy. ... Take a moment to look around you... Ruth does. There are over five hundred people in this grand room. Most of them are white. Only nine of them are women. GRISWOLD (CONT’D) In this room are Rhodes and Fulbright scholars. Phi Beta Kappa members. Student body presidents. A Harvard Crimson football captain. Pats on the back for the smiling sports hero. GRISWOLD (CONT’D) Together, you will become lawyers. It is a privilege you share. And a responsibility that you accept. ... Consider: what does it mean to be a Harvard man? A Harvard man is intelligent, of course. But he is also tenacious. He is a leader devoted to the rule of law. (MORE) (CONTINUED)  2",
      "characters": [],
      "action_text": "He is mindful of his country. Loyal to tradition. And he is respectful and protective of our institutions. OFF RUTH: Determined. INT. GINSBURG HARVARD APARTMENT - LATE DAY  The garden apartment is small and uncluttered: mismatched furniture, books, baby toys and museum posters. IN THE BEDROOM: THE MARRIAGE OF FIGARO plays on a record. Ruth, in a slip, is considering the contents of her closet. One dress in hand, she pulls out another. She can’t decide. She takes them with her... Out of the room. DOWN THE HALL... THE LIVING ROOM empty, she enters THE ADJACENT KITCHEN: RUTH (re: the dresses) Which one makes me look more like a Harvard man? MARTIN GINSBURG (24, classically handsome) is at the kitchen table. Bouncing their daughter JANE (1) on his knee. He looks up from a textbook before him. Adoring. MARTIN I’m thrilled you look nothing like a Harvard man. RUTH Seriously, you know how I am at these things. It’s the dean’s dinner, Marty. I need to make a good impression. MARTIN You will, Kiki (pr: Kick-EE). But it’s the other way around. You make the dress look good. She kisses him -- and Jane. Then notices Martin’s untouched plate of “food” on the table. RUTH You barely touched your tuna casserole. I put onions in. They help, right? They don’t. As he forces down a forkful:  GRISWOLD (CONT’D) (CONTINUED)  3 MARTIN Yeah... Definitely. RUTH (re: the dresses) I don’t like either of these. She breezes out of the room. MARTIN (to Jane) So. Where were we? ... Ah. (reading aloud to her) The Tax Code disallows some deductions held to be contrary to the public interest. (off Jane’s babbling) Just wait. This is the good part. He eats a grape off her plate. OMITTED  INT. HARVARD UNIVERSITY CLUB - FOYER - NIGHT  A grand room. Dignified and formal. MALE PROFESSORS in suits chatting collegially. THE EIGHT OTHER WOMEN of the class of 1959 (20s, intelligent, poised) are ingratiating themselves. Ruth enters. A vision in her swing dress and pearls. And takes it all in: The room. The crow",
      "dialogue_count": 0,
      "word_count": 673
    },
    {
      "scene_number": 3,
      "slugline": "INT. HARVARD UNIVERSITY CLUB - DINING ROOM - LATER  Ruth eats her stewed chicken and lima beans with slow precision. She scans the room. They’re around a formal dining table: men and women in alternating seats. Entrenched in conversation. Being served by Black Waiters. She eyes the women: Confident. Wise. With easy laughs. To her right: a YOUNG PROFESSOR faces away from her, ashing a cigarette in the ashtray between him and Ruth, and talking up one of the women, EMILY: YOUNG PROFESSOR He said, “Professor, have you corrected our papers?” I said, “Correcting them would take a lifetime. I’m merely grading them.” Emily laughs gregariously. DING-DING-DING. At the head of the table, Griswold TAPS HIS GLASS, rising. Ruth puts down her utensils neatly. GRISWOLD Esteemed colleagues. Ladies. This is only the sixth year women have had the privilege to earn a Harvard Law degree. This little soiree is our way of saying welcome. (pointing her out) My wife Harriet and I are glad all nine of you have joined us. APPLAUSE. Ruth is grateful. But notes that some professors are more enthusiastic than others. GRISWOLD (CONT’D) Let us go around the table. And each of the ladies, report who you are, where you’re from... And why you’re occupying a place at Harvard that could have gone to a man. As Griswold sits, Ruth is disquieted. She and the other women exchange anxious glances. Harriet singles out the closest: HARRIET GRISWOLD Why don’t you get us started, dear? One of Ruth’s CLASSMATES rises. White knuckling her chair: (CONTINUED)  5",
      "characters": [],
      "action_text": "CLASSMATE I’m Hennie Callaghan. Father’s a lawyer back in Minneapolis. He used to give me drafts of contracts to use for drawing paper. At some point, I got more interested in reading them than drawing on them. In a few years, it’s going to be Callaghan and Callaghan. GRISWOLD That was fine. Next? EMILY’s turn. She rises. EMILY Emily Hicks. Hello. Connecticut. When I finished Mt. Holyoke, my mother wanted me to get married. But I didn’t want to do THAT. And I didn’t want to be a teacher or a nurse. So when I-- GRISWOLD Ha. That’s not a very good reason. Ruth watches Emily slump into her seat -- mortified. All eyes land on Ruth. Including Griswold’s. She stands... And knocks over the Young Professor’s ash tray. It lands with a heavy thud. Ruth stares at the ash and butts on the rug... When she looks up -- she eyes them all. The anxious women. The men watching her. Emily controlling her frustration. Griswold is waiting... RUTH I’m Ruth Ginsburg, from Brooklyn. GRISWOLD And why are you here Miss Ginsburg? RUTH Mrs. Ginsburg, actually. My husband Marty is in the second-year class. ..... I’m at Harvard to learn about his work. So I can be a more patient and understanding wife. Emily laughs. Several others gasp. And on Griswold’s face is plain dislike. OFF RUTH: Seeing it.  6 RUTH Come to dinner. The beans will be boiled. The chicken will be stewed.  And you will be grilled . ... We came to Harvard to be lawyers. Why else? Martin, in an undershirt, climbs off the bed. MARTIN It was an asinine question. RUTH I couldn’t just ignore it! But the way he looked at me. Now he’ll never take me seriously. MARTIN You’re smarter than everyone here. You’ll be better prepared. Just stand up and say what you know. In this place, that’s all the matters. She turns her back:   Unzip me.  RUTH In my experience even small mistakes are glaring when you stick out. The dress falls to the floor. And he turns her around... MARTIN Then you’re lucky. Because you’re very short. She laughs. Despite ",
      "dialogue_count": 0,
      "word_count": 3486
    },
    {
      "scene_number": 4,
      "slugline": "EXT. HARVARD CAMPUS - AUSTIN HALL - LATER Ruth. Bearing her disappointment. Comes out of the building. For a beat, she watches Martin and Jane playing tag among the trees. Until Martin stops to catch his breath. And notices her. Smiling, he waves. Ruth forces a smile. And waves back. FADE TO BLACK. EXT. GINSBURG APARTMENT (1959) - DAY A brownstone on a quiet side street. Ruth comes out in smart suit. Determined and bold. She heads down the street. And around the corner.   REVEALING:  NEW YORK, NY -- in autumnal red and gold. Vibrant, bustling, and alive.  SUPER: 1959  E/I. MIDTOWN OFFICE BUILDING - DAY Ruth goes through a revolving door into an impressive LOBBY. She enters an elevator full of men in suits. GREENE (V.O.) Jesus, Mary and Joseph. INT. GREENE’S OFFICE - DAY GREENE (45), a big man, a street-wise lawyer, is reading Ruth’s resume. SOUNDS OF CONSTRUCTION outside. GREENE Graduating top of your class. Law Review at Harvard AND COLUMBIA?! I didn’t even know that was possible. RUTH Thank you, Mr. Greene. I’ve worked hard. GREENE You want some white-shoe firm. Big- money cases, complex legal maneuvers. (CONTINUED)  23",
      "characters": [],
      "action_text": "RUTH No, I think Bibler and Greene would be a perfect fit. You handled the Mercer bankruptcy last year, and-- GREENE C’mon. How many have you been to? With a look, she deflects. GREENE (CONT’D) They all turned you down right? How many? Ten? RUTH Twelve. GREENE A woman. A mother. A Jew, to boot. I’m impressed that many let you through the door. RUTH One sent me to interview for the Secretarial Pool. GREENE Ha! RUTH Another told me I’d be too busy at bake sales to be effective. One partner closes clients in the locker room at his club -- so he said I’d be out of the loop. Last week I was told women are too emotional to be lawyers. Then, that same afternoon, that a woman graduating top of her class must be “a real ball-buster,” and wouldn’t make a good colleague. I was asked when I’d have my next baby, and whether I keep Shabbat. One interviewer told me I have a sterling resume, but they hired a woman last year, and what in the world would they want with two of us? Unburdened, she lets out her breath. And grows embarrassed. Greene’s sardonic chuckle says he gets it: GREENE You must be livid. (CONTINUED)  24 RUTH My mother taught me not to give way to emotions. GREENE Bull shit! You’re angry. Good! Use it. I have to say, Mrs. Ginsburg, I’m impressed. A glimmer of hope. Ruth grabs for it... RUTH Mr. Greene. I want to be a lawyer. I want to represent clients before the court in pursuit of justice. (re: her resume) You can see I worked hard through school. I did everything I was supposed to, and I excelled. I swear it: I’ll do the same for you. Greene takes a moment to think... As he does, his gaze drifts over the contours of her body. Ruth tenses. GREENE Thing is... We’re a close-knit firm. Almost like family. And well-- the wives, they get jealous. Ruth stares him down. Fighting her building fury. EXT. NEW YORK CITY STREETS - DAY Ruth back on the street. Stunned... She slows. Almost to a stop. Diminished... New York continues its perpetual movement around her without not",
      "dialogue_count": 0,
      "word_count": 1141
    },
    {
      "scene_number": 5,
      "slugline": "INT. RUTGERS LAW SCHOOL - CLASSROOM - LATER Narrow windows, drop-ceiling, linoleum floor. It’s worlds away from Harvard... As Ruth enters, the students find their seats. And watch her arrange syllabi and lecture notes from her bag in neat piles. At last she looks them over. An uncomfortable silence... RUTH I’m Professor Ginsburg. This is Sex Discrimination and the Law. ... Some of my colleagues will tell you that sex discrimination doesn’t exist. I may as well be teaching the legal rights of gnomes and fairies. Let’s see if they’re right. ...... Hoyt versus Florida. State the facts please, Miss... (checking a class list) Valentin. VALENTIN, an Hispanic, blue-collar Jersey Girl, rises. VALENTIN Gwendolyn Hoyt was a housewife. And her husband was this real asshole. The class CHUCKLES. RUTH Can you recall the specifics? VALENTIN He cheated on her. He choked her. He’d rip off her clothes and threaten to kill her. RUTH So in statutory terms... he was a real asshole. WHEN THE STUDENTS LAUGH, Ruth seems almost embarrassed by it. But the room relaxes. Including Ruth. RUTH (CONT’D) On the night in question, Clarence told his wife he had met another woman, and he was leaving. How did Hoyt respond, Miss... Burton? IN THE BACK: BURTON rises. (CONTINUED)  29",
      "characters": [],
      "action_text": "BURTON She smashed in his skull with a baseball bat. Then called an ambulance, while he was dying. RUTH A jury convicted Hoyt of second- degree murder. And that’s where our story begins. A great civil rights lawyer took up Hoyt’s appeal. Dorothy Kenyon. Ruth writes her name on the board. The students take notes. RUTH (CONT’D) On what grounds, Miss... Roemer? ROEMER, an Angela Davis-type, rises. ROEMER That Florida’s juries violated the U.S. Constitution, ‘cause there were only men on them. Kenyon said a jury with women on it may have convicted Hoyt of a lesser crime, like manslaughter. BENNETT, a male student, calls out: BENNETT That law makes sense though. Women can’t take care of their kids, if they’re on some sequestered jury. WHOA! It doesn’t go over well with the women in the room. FEMALE STUDENTS Excuse me? Are you kidding? (etc.) BENNETT What? Men are the mammoth hunters. BURTON You’re never getting laid again. VALENTIN What about women who don’t have children? BURTON Yeah. Or they’re out of the house. (CONTINUED)  30 ROEMER Let the man stay home and take care of his children. We got work to do. The women HOOT AND HOLLER. BENNETT Hey, hey, hey! Don’t take it out on me. I’m not holding my fiance back. She has TWO jobs. RUTH Which she can be fired from just for marrying you. The law allows it. That quiets him. And the room. RUTH (CONT’D) There are laws that say women can’t work overtime. A woman’s social security benefits, unlike her husband’s, don’t provide for her family after death... The class is furious: STUDENTS What? ... That’s bullshit. (etc.) BURTON We need to do something. Ruth is thrilled by their passionate response. They recognize she’s waiting and shush one another... RUTH Ten years ago, Dorothy Kenyon asked a question: if the law differentiates between people on the basis of sex, then how will women and men ever become equals? And the Supreme Court answered. ... They won’t. Hoyt lost her appeal. The decision was unanimous: discrimination on the b",
      "dialogue_count": 0,
      "word_count": 563
    },
    {
      "scene_number": 6,
      "slugline": "INT. GINSBURG APARTMENT (1970) - DAY They’ve come up in the world. The apartment is spacious, with city views and a balcony. The furniture is contemporary. The artwork, original. The Roman Opera poster is still prevalent on a wall. An ARIA plays on the radio. JANE is stirring   blanquette de veau   simmering in a pot on the stove. She’s 15. Pretty, blonde, in a private school uniform. JANE Daddy, that’s not how you do it. If you put the herbs in too early they lose all their punch. Martin (37 now, in a French apron) is chopping celery, thyme & rosemary with a chef’s speed and precision. MARTIN The flavors are meant to compliment one another. Not pummel each other. As he adds his work to the pot and covers it: MARTIN (CONT’D) That’s why it’s called marrying them. HEAR: THE FRONT DOOR OPEN AND CLOSE. Then... JAMES (O.S.) We’re home! JANE Speaking of which... James bursts in... JAMES Daddy! Martin scoops him up -- matching his tone: MARTIN James! Ruth enters and kisses Martin. RUTH Hi.   (change in tone) Jane. (CONTINUED)  32",
      "characters": [],
      "action_text": "JANE Hey, mom. MARTIN So? How is this year’s class? As she gets a spoon to taste the stew: RUTH These kids are so passionate. To them it’s about more than precedents and dissents. They want to forge a movement. (re: the stew) Mmm. This is delicious. As he does, Jane tries to make her exit. RUTH (CONT’D) Hold on Jane. We need to have a talk. I got a call from her school today. Apparently I mis-dated a note excusing you from classes last week? Martin is flipping through the Advance Sheets... JANE It’s not a big deal. MARTIN (sarcastic) Oh, well, problem solved then. RUTH You skipped school. It’s the first week. Is this what this year’s going to be like? You lied to-- JANE I never lied. RUTH Forging a note IS lying, Jane. You’re smart enough to know that. JANE (leaving) Apparently I’m not, Mom. As Ruth follows Jane out... (CONTINUED)  33 MARTIN Don’t forget we have the party tonight. James, thrilled by the action, tries to follow Ruth out. Martin grabs him by the back of his shirt. MARTIN (CONT’D) Oh no. Not you. IN THE LIVING ROOM: Ruth pursues Jane across the apartment. RUTH Jane. ... Jane, stop. JANE I apologize, okay? RUTH I want to know where you were. Jane turns back on her. JANE Denise and I went to a rally to hear Gloria Steinem speak. Ruth looks at her:   You did WHAT?  JANE (CONT’D) (”obviously”) She’s a writer. She’s starting her own magazine. She just testified in the Senate about-- RUTH I know who Gloria Steinem is. What if you got hurt? Or arrested. JANE It was just a rally. Not a riot. RUTH Those things can get out of hand. JANE I’m fifteen years old. You don’t have to control every minute of-- RUTH Yes. I do. That’s my job. Your job is to go to school and learn. (CONTINUED)  34 JANE Gloria says we need to un-learn the status quo. RUTH You’re on a first name basis now? Jane sees Martin coming from the kitchen. JANE ...You know what, Mom? You may be satisfied sitting around with your students talking about how shitty it is to be a girl-- MARTIN Hey, langu",
      "dialogue_count": 0,
      "word_count": 6032
    },
    {
      "scene_number": 7,
      "slugline": "INT. GINSBURG APARTMENT - BEDROOM - NIGHT On the wall over her desk, Ruth tacks up the same note card. SEE: OTHERS. AND NEWSPAPER CLIPPINGS. It’s the outline of her argument. Martin’s on the bed, surrounded by books, writing his tax section of the brief. INT. RUTGERS LAW SCHOOL - FACULTY OFFICES - DAY CLOSE ON TYPEWRITER KEYS STRIKING THE PAPER: “Changes in societal attitudes.” ... “Unalterable biological traits.” INT. RUTGERS LAW SCHOOL - CLASSROOM - EVENING Ruth’s added a coffee pot to the room. Some of her class is with her. They’re passing books, newspapers, journals -- and Chinese food cartons -- between them. Animated. Discussing. OVER THIS, START TO HEAR: MILLICENT’S TYPING... EXT. NEW YORK STREET - NIGHT AS THE TYPING CONTINUES, GETTING LOUDER... Ruth and Martin walking -- dressed in overcoats: MARTIN Our client is a man. We can’t lose sight of that. Men are also harmed by these stereotypes. Boys who are told they’re not supposed to be nurses, or teachers, or-- RUTH Cook dinner for their families. MARTIN We’re counting on you, too. INT. GINSBURG APARTMENT - LIVING ROOM - NIGHT Ruth and Martin are cuddled on the couch. Writing notes on their work... Noticing one another, they stop. Kiss... And resume working. THE TYPING CONTINUES. LOUDER STILL...  64",
      "characters": [],
      "action_text": "MILLICENT Professor Ginsburg? I finished typing the brief. RUTH (accepting it) You’re a saint, Millicent. MILLICENT May I make an observation? ... It’s just... I’m typing your brief. And jumping out all over it is, well... sex-sex-sex-sex-sex-sex. It reeks of hormones and backseats and-- You know how men are. Maybe you should try a less distracting word. She and Ruth exchange a look... MILLICENT (CONT’D) Maybe... gender? RUTH You realize that means... MILLICENT That’s no problem. I’m happy to type it again. Off Ruth:   END SEQUENCE.  INT. ACLU OFFICES - CORRIDOR - DAY Mel hurries down the hallway, chatting with a LAWYER. MEL Guessing does me no good. I need to know how many people were actually turned away from the polls. (CONTINUED)  INT. RUTGERS LAW SCHOOL - FACULTY OFFICE - DAY  Millicent is typing up their hand-written pages... She pulls out the final page. INT. RUTGERS LAW SCHOOL - RUTH’S OFFICE - LATER  Millicent enters -- the typed Moritz Brief in hand:  65 ACLU STAFFER 4 The Affiliate still hasn’t sent the list. MEL Call Brian Tanner. Remind him, please, that we’re on the same team. And tell him if he doesn’t start acting like it, I’ll come to Wisconsin and rip his God-damn throat out myself! As he opens his OFFICE DOOR: KENYON (O.S.) Melvin. Didn’t your mother ever teach you to clean your room? INT. MEL’S OFFICE - CONTINUOUS She’s sitting behind his desk. Reading a newspaper -- THE IDAHO STATESMAN. Mel, surprised, enters and closes the door. MEL Ms. Kenyon. Is it time for your annual dusting-off already? Kenyon laughs. As she folds her newspaper... KENYON In 1776, Abigail Adams wrote her husband a letter. “As you write this new constitution,” she said, “Remember the ladies.” Know what the bastard went ahead and did? MEL I can guess. She slams the paper down, the article oriented toward him: “COURT FINDS FOR CECIL REED.” MEL (CONT’D) The Idaho Statesman? You need a hobby. KENYON These poor people. Sally and Cecil Reed. Divorced. Their son committed suicide, ",
      "dialogue_count": 0,
      "word_count": 1758
    },
    {
      "scene_number": 8,
      "slugline": "INT. DOJ - BROWN’S OFFICE - LATER The room is utilitarian. Straight lines and right angles. With an orderly and organized charm that’s inviting. (Professor) Brown is 65 now. Dignified. Finished to a high polish. He’s at his desk reading the brief. Bozarth watches. BOZARTH You can’t make a constitutional challenge to the Tax Code. Right? BROWN (still reading) It’s a stretch. BOZARTH And who’s ever heard of ‘gender discrimination?’ Brown gives him a look. Then finishes reading. BOZARTH (CONT’D) These folks are runnin’ at Hell with a bucket of water. BROWN Case law is filled with challenges that could not be made... Until they were. I’m putting Murphy on writing our response brief. BOZARTH With due respect, Mr. Brown-- BROWN It isn’t personal, Bozarth. But if we’re not careful, this appeal will cast a cloud of unconstitutionality over every federal law that differentiates between men and women. I need someone more seasoned on it. For Bozarth, it’s a body blow. Brown picks up his phone... BROWN (CONT’D) Could you get me the Solicitor General, please? Bozarth summons his courage. BOZARTH I pulled the file. I deserve the chance. Murphy’s a weak sister. (CONTINUED)  73",
      "characters": [],
      "action_text": "BOZARTH (CONT’D) I know how to win this case, sir. Better than Murphy. Better than anyone. You need me on this appeal. Brown stares. A bit impressed. A bit dubious... Before he can decide, someone picks up on the other end of the line. BROWN (eyes still on Bozarth) This is Brown. I need to see him. EXT. CAPITOL BUILDING - DAY A cold day. The ground dusted with snow. But (Dean) Erwin Griswold doesn’t seem to notice. He’s 67 now, and Nixon’s Solicitor General. Brown and Bozarth walk with him... GRISWOLD For God’s sake! Where does it end? Gender equality as a civil right?! BROWN When everyone’s aggrieved and a victim. It’s what the ACLU does. Divide the country into smaller and smaller subgroups. GRISWOLD Ginsburg... Cancer, right? And the wife. Very demanding. BROWN But smart. GRISWOLD Ten years. Ten years I fought to enroll women at Harvard Law. The faculty, the university -- even my wife warned me it could come back to haunt me. Now this is the thanks I get. BROWN Erwin, we   could   settle. Martin Ginsburg was one of my best students. A practical young man. I can call him, tell him we’ll let the man have his money. And we go our separate ways. Griswold thinks about it for a beat... (CONTINUED)  Brown gives him a dismissive look. Bozarth leans in. Firm:  74 GRISWOLD No. ... No. We settle now, it’s open season. Let’s put the idea of gender discrimination to bed once and for all. They handed us a winnable case. BROWN (on the mission) Then we’ll win it. Griswold talks of Bozarth as if the young man weren’t there: GRISWOLD You’re sure he’s up to it. BROWN Mr. Bozarth is a fine litigator. (to Bozarth) Tell him your idea. BOZARTH We list the laws. GRISWOLD What laws? BOZARTH All of ‘em. Every federal law that treats men and women differently. So the Court sees exactly the can of worms these folks are-- Griswold’s belly-laugh interrupts him. Until, looking between Brown and Bozarth, Griswold realizes it’s not a joke. (CONTINUED)  75 GRISWOLD Last I checked, the U.S. Code w",
      "dialogue_count": 0,
      "word_count": 5406
    },
    {
      "scene_number": 9,
      "slugline": "INT. COURTROOM - DAY Ruth, Jane and Mel enter between gray, marble pillars. A chandelier casts the JUDGE’S BENCH in warm light. Over it, a clock and an adage:   Reason is the Soul of All Law . MEL (skeptically) Well... Here we are. A small CROWD loiters amid the pews IN THE GALLERY. From among them, Moritz approaches. RUTH Charlie. MORITZ Good morning. (to Mel) Mr. Ginsburg? MEL Uh... Um. No. Mel Wulf. ACLU. Jane chuckles. As Martin arrives. MARTIN Mr. Moritz, that’s me. I’m Mr. Ruth Bader Ginsburg. It’s nice to finally meet you. They shake. Moritz looks warily toward Bozarth and Brown at THE APPELLEE’S TABLE. As the Court Clerk puffs his chest. COURT CLERK All rise. The United States Court of Appeals for the 10th Circuit is now in session. Judges Doyle, Holloway, and Daugherty presiding. Martin and Ruth find their place at the APPELLANT’S TABLE. The Judges enter from behind the velvet curtain beyond THE JUDGES’ BENCH. Each takes a seat behind his name plate. In THE GALLERY, Mel and Jane flank Moritz. Jane reminds him to remain standing. JUDGE HOLLOWAY Be seated. Martin and Ruth share a glance as they sit. At THE APPELLEE’S TABLE across the aisle, Brown catches Bozarth eyeing them. (CONTINUED)  102",
      "characters": [],
      "action_text": "BROWN You have a century of case law on your side. Just do your job. Holloway flips through a couple papers on his desk. JUDGE HOLLOWAY The first case is docket number 71- 1127. Charles Moritz v Commissioner of Internal Revenue. Each side will have 30 minutes to present. When two minutes remain, the Court Clerk will rise to give warning. When your time is up, he will sit. He looks over at Martin and Ruth, seated together before him. JUDGE HOLLOWAY (CONT’D) Counsel for the appellant. Mr. Ginsburg, you may proceed. It begins. Martin and Ruth look to one another. Then Martin takes his place AT THE LECTERN, checking the time on the clock overhead. 9:00 AM. IN THE GALLERY, Moritz sits taller. Smiles nervously to Jane. MARTIN Your Honors and may it please the court. We’re going to demonstrate that Section 214 of the tax code discriminates against our client -- Charles Moritz -- because he is a man. FROM THE BENCH the Judges settle in. Interested. And engaged. INT. COURTROOM - 9:13 AM ON THE BENCH, Judge Holloway remains polite. Thoughtful. JUDGE HOLLOWAY Congress assumed that a caregiver is most likely a woman. Is that so unreasonable? MARTIN If the law said all caregivers can claim a deduction. (MORE) (CONTINUED)  103 And in the back of their minds the authors thought, well, this will only apply to women, that would be an assumption. But they did more than that, Judge. They explicitly listed who counts as a caregiver. JUDGE DOYLE As is their prerogative. MARTIN I doubt you’d turn a blind eye if the code said that only white caregivers-- JUDGE DOYLE That’s hardly the same thing. Martin checks the clock. 9:14:40 MARTIN Respectfully we disagree. But I’ll turn it over to my co-counsel to address the constitutional-- Ruth begins to get up. JUDGE DAUGHERTY You’re telling us that race and gender are the same? Ruth is stuck, mid-rise. Watching Daugherty. MARTIN Your honor, my co-counsel-- JUDGE DAUGHTERTY Yes. Yes. We’ll get to her in a minute. But I’d appreciate an answer to my",
      "dialogue_count": 0,
      "word_count": 3751
    }
  ]
}