{
  "slug": "only-lovers-left-alive-2013",
  "title": "only lovers left alive",
  "genre": "romance",
  "format": "film",
  "scenes_count": 6,
  "characters_count": 0,
  "characters": [],
  "total_words": 12791,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. ADAM’S KITCHEN - NIGHT ADAM and EVE sit across from each other, carefully studying a chessboard between them on the kitchen table.   Both again wear their dark bathrobes, EVE with her Stetson hat pushed back on her head. In the kitchen around them, no trace of human food is visible.   Cupboards, shelves, and counters instead hold stacks of books, vinyl records, and dismantled electronics. EVE smiles as she makes a move on the chess board, taking ADAM’s queen with her bishop. EVE There goes your queen, playboy. Check. Brow furrowed, ADAM studies the board. EVE (cont’d) By the way, your hero Christopher Marlowe sends his regards. ADAM (fixed on the game) I don’t have heroes.   And please don’t talk so much.   You’re just trying to distract me.   (pause) How is he? EVE Oh, eccentric and secretive as always.   I must say he does seem to enjoy being the king of the Tangier underground. ADAM (eyes still on the game) That’s good.   Let’s not talk now. EVE Adam? He doesn’t respond. EVE (cont’d) Since we were talking about great English poets, will you tell me again about when you hung out with Lord Byron? ADAM Eve, please. ADAM’s hand briefly hovers over a chess piece, but withdraws before touching it.  39.",
      "characters": [],
      "action_text": "EVE Oh, tell me again.   Please? ADAM sighs and briefly looks up at her. ADAM What?   Uh, I was in his presence only for a few days.   1815 maybe, something like that.   In a villa on Lake Geneva.   With the others. EVE On your way to Italy, right? ADAM (eyes again fixed on the game) Yeah... EVE And what was he like? ADAM (after a pause, still not looking up) He was a pompous asshole. EVE laughs. EVE And what about the great John Keats? ADAM (eyes on the game) What?   Keats, Keats I never got to meet.   But you know all this, Eve. I know what you’re doing. EVE Oh, but it amuses me so.   Please tell me more. ADAM (distracted) Uh, I met Byron and Mary Shelly.   I met Wordsworth once, briefly, by an English lake. (pause)   Never met Keats though.   (pause, studying the board)   Great poet, Keats... EVE “...That thou wouldst wish thine own heart dry of blood So in my veins red life might stream again...” ADAM looks up at her.   Her eyes sparkle with mischief.  40. EVE (cont’d) So what was Mary like, then?   Mary Wollstonecraft. ADAM looks back at the game, trying to ignore her. EVE (cont’d) Come on then, what was she like? ADAM She was...delicious. EVE Mmm.   I’ll bet she was. They gaze at each other across the table, EVE’s eyes then suddenly lighting up. EVE (cont’d) Oh!   That reminds me.   I have a surprise!   An experiment. She gets up and goes to the refrigerator just behind her. ADAM watches curiously as she opens the freezer. ADAM That doesn’t work. EVE (taking something out) Yes it does.   I plugged it in.   But I must say, you’ve wired this place in a most peculiar way. ADAM (watching her closely) It’s my own system. EVE sits back down, holding two homemade popsicles, frozen onto sticks, blood red.   She extends one to ADAM. ADAM (cont’d) What’s that? EVE (licking her popsicle) O Negative!   Frozen on a stick! Mmm, refreshing. ADAM takes the other from her, examining it carefully, holding the stick hesitantly between two fingers.   His tongue then barely grazes",
      "dialogue_count": 0,
      "word_count": 5816
    },
    {
      "scene_number": 2,
      "slugline": "INT. ADAM’S LIVINGROOM - NIGHT EVE, ADAM, AVA and IAN are in ADAM’s livingroom/studio.   EVE sits on one end of the couch, while at the other end AVA is nestled very close to IAN, her hand lightly moving underneath the sleeve of his shirt.   ADAM, standing, is collecting reels and boxes of his tapes.   Music plays, but not ADAM’s music. IAN Couldn’t we just hear a taste of your new stuff, Adam? ADAM (facing away from them) Now’s not a good time. IAN (disappointed) Oh, man...Last time I saw you, you said that if I came by... ADAM turns and gives him a stern, definitive look. IAN (cont’d) Ok, not now.   That’s cool.   I’m just, you know, excited. AVA’s hand moves to IAN’s leg. AVA Me too. Carrying a stack of tape reels and boxes, ADAM moves to the doorway, then turns and nods to EVE.   She gets up from the couch. EVE It’s getting really late.   We all should retire before it starts getting light out. IAN leans forward on the couch, but AVA immediately pulls him back toward her. AVA Adam? ADAM pauses in the doorway. AVA (cont’d) Could I have that flask back? Please? ADAM No, Ava.   I think you’ve had enough.  68.",
      "characters": [],
      "action_text": "AVA (pouting) But I’m just so...so thirsty. IAN (offering his beer bottle to AVA) Wanna share this? AVA petulantly pushes the bottle away. ADAM Ian, I think it’s time for you to go. AVA wraps her arms around him possessively. AVA He’s gonna leave as soon as he finishes his little beer. ADAM glares at IAN, who nervously drinks from his bottle. IAN Yeah.   I should get goin’. AVA (her arms still encircling him) Yeah.   He’s gonna go in just a few minutes. ADAM leaves the room.   EVE leans in and kisses AVA on the cheek. EVE Goodnight, baby.   (then extending her hand to IAN)   Nice to meet you, Ian.   See you again soon, I hope. IAN Yeah.   Hope so. EVE moves to the door, looking back briefly at AVA and IAN on the couch before closing the door behind her. FADE TO BLACK. CUT TO: INT. ADAM’S BEDROOM - EVENING EVE turns a lamp on.   She is sitting on ADAM’s side of the bed pulling on her dark red bathrobe, the silver flask in one hand.   ADAM is still asleep, again with a pillow over his head.  69. EVE pulls up a corner of the pillow and, smiling, peeks at ADAM.   He opens one eye. ADAM (groggy) Don’t you dare say it. EVE laughs.   ADAM takes the pillow from his head and looks around. ADAM (cont’d) Is it dark out already? EVE Yeah. ADAM What are ya doin’ with that flask? EVE I put a little in for AVA. ADAM Oh, fuck... She touches his head affectionately. EVE I’m gonna go check on her.   But, you’re right, she’s gotta leave.   I need to have you all to myself. ADAM Excellent idea, before it’s too late.   (pause)   I’m getting up, then. EVE kisses him.   Before standing, she pauses, looking over at their wedding photo which she has moved to the nightstand. EVE (standing) We look so young, don’t we? ADAM looks over at the photograph, as EVE leaves the room, their faces in it appearing identical to the present. CUT TO: INT. ADAM’S HOUSE - NIGHT Flask in hand, EVE walks down a corridor, passing the upstairs livingroom, then descending the staircase. Downstairs she moves throu",
      "dialogue_count": 0,
      "word_count": 1642
    },
    {
      "scene_number": 3,
      "slugline": "INT. ADAM’S CAR - NIGHT ADAM angrily, recklessly, drives his Jag through the Detroit night, EVE solemn in the passenger seat. EVE Take it easy.   Let’s just stay calm. ADAM (exploding) Stay calm?! EVE (softly) Please, Adam. She reaches over and touches his shoulder, but he shrugs it away and she withdraws her arm.   A police car passes them, traveling in the opposite direction. EVE (cont’d) What are we gonna do with him? ADAM doesn’t respond. EVE (cont’d) In the old days we could just chuck ‘em in the Thames...alongside all the other tubercular floaters. ADAM Any other ideas? EVE (after a pause, trying to lighten the mood) We could put him through a wood- chipper.   Like in the movie FARGO. ADAM glances over, questioningly. EVE (cont’d) You didn’t see FARGO? ADAM I have no idea what you’re talking about. EVE A movie.   It’s got Steve Buscemi in it.   I love him. ADAM (tersely) I don’t know who that is.  76.",
      "characters": [],
      "action_text": "EVE Darling, you’re so...unhip. ADAM glances at her, a hint of insecurity flashing across his brooding eyes. ADAM Am I? EVE looks forward, smiling, her eyes again bright and irrepressible. CUT TO: EXT. ADAM’S CAR - NIGHT The car moves through a completely deserted post-industrial area.   It turns again, pulling down a narrow alley, which then widens into an open area partially enclosed by broken factory walls.   The ghosts of old machinery stand rusting and collapsed.   The Jag slows, then stops. Its headlights illuminate a very large corroded metal tank, a rusting metal staircase leading to a platform near its rim. In the surrounding area rusting barrels are tossed here and there, leaking small pools of strangely colored liquid chemicals. EVE (surveying the landscape through the windshield) Delightful. ADAM turns and checks behind him, then switches off the headlights, leaving the engine running. CUT TO: EXT. ABANDONED INDUSTRIAL AREA - NIGHT Together ADAM and EVE drag the tarped body from the car toward the large chemical tank. EVE Is this like in BATMAN, when they throw the Joker into the acid? ADAM Yeah, sort of, only he was still alive. Suddenly an eerie sound causes them to freeze.   Not far off a group of coyote howl and yip uncannily.  77. EVE Tell me I’m crazy, but those are most definitely Canis Latrans. ADAM Yeah.   Coyote. EVE Interesting.   In the heart of Detroit? ADAM You’d be surprised. The sounds subside, the coyote moving off.   ADAM and EVE resume, dragging the corpse to the staircase at the base of the tank.   They carry it up the staircase, seemingly without difficulty, indicating prior experience in the physics of moving corpses. Reaching the platform at the top, they pause and peer into the tank, reactively covering their mouths and noses.   Three or four meters below them is a surface of thick, oily, liquid emitting a visible vapor.   EVE glances at ADAM. ADAM (cont’d) Don’t even ask.   (pause) You ready? They hoist the wrapped corpse to rim ",
      "dialogue_count": 0,
      "word_count": 630
    },
    {
      "scene_number": 4,
      "slugline": "INT. ADAM’S BEDROOM - NIGHT ADAM is manically pacing in the small room, his fingers twisting his hair.   EVE sits calmly on the bed, watching him. Clothes and objects are strewn everywhere, and drawers flung open.   Piles of money in various denominations, as well as passports, jewelry, and credit cards are scattered across the surface of the bed surrounding EVE. Still pacing and losing control, ADAM reaches into an open drawer and flings a handful of U.S. bills into the air. ADAM (money fluttering down around him) Need anything?   We’re having a liquidation sale.   Everything must go! He tosses a stack of loose euros toward EVE.   They float down around her like falling leaves. ADAM (cont’d) (ranting) Have some more of mankind’s most useless and tragic invention! He whirls around holding a box containing reels of recorded audio tapes; master tapes of his music. ADAM (cont’d) (wildly) How about some cult music?   Mind bending guitar drone.   Recorded in secret by a real fucking vampire! He tosses the box, his arm then sweeping a stack of antique, leather-bound books to the floor.   He whirls back toward EVE. ADAM (cont’d) What!?   Did you say...blood?   Ah, I see.   Not money, not art, but it’s blood you want!   (he turns away, eyes wild)   That’s right!   What’s more precious than human blood? He turns to EVE, holding up the small silver flask, his eyes now fluttering in his head.   He takes a step toward her, almost menacingly. ADAM (cont’d) Type O!   The original blood of Adam and Eve?   That’s what we need, but...not much of that left, is there?   In fact, almost none!  79.  (MORE)",
      "characters": [],
      "action_text": "(pause, then in an unusual voice) Sorry, but me wife’s sis’ turned up and she sucked it all down!   (then, moving even closer)   Then she sucked up my business partner. Just like that! EVE (quietly) Adam, you’re upsetting me. ADAM Am I? EVE Yeah.   Let’s just calm down. (pause)   What we’re going to do is calmly get the hell out of here. Suddenly the doorbell rings.   Both freeze momentarily, then ADAM rushes to the window.   Pulling the curtain back very slightly, he peeks out.   The bell rings again. Outside he sees the same group of young hipsters who rang his bell earlier.   Several are on his porch, and several more by a car parked in the street. EVE (cont’d) Who is it? ADAM Some fucking rock’n’roll kids. (then closing the curtain)   They’re onto me.   We’re fucked. The bell rings again. EVE (calmly) Don’t be ridiculous.   They’ll go away.   Good job it isn’t the authorities. ADAM (again peering through a thin opening in the curtain.) Yeah, well, they’ll be next. EVE (turning on her white mobile) We’ll be long gone, baby. She scrolls then dials a number on the phone, then waits.  80.  ADAM (cont’d) EVE (cont’d) (calmly into phone) Yes, I’d like to make some reservations.   (pause)   Thank you. The sound of a car pulling away is heard.   ADAM closes the curtain and turns to EVE, a wild look in his eyes. EVE (cont’d) (into phone) Yes, I want to book flights for two to Tangier.   (pause)   Yes, from Detroit, flying at night please. (pause)   Thank you. ADAM What about my equipment and all my fucking instruments!? EVE (to ADAM, hand over the phone) Oh fuck your bloody instruments. There are millions of beautiful instruments in the world.   Calm down.   (then, back into phone). Excuse me?   (pause)   Oh, connecting through London? Her eyes are on ADAM, who spins away from her, fingers again entangled in his hair. EVE (cont’d) (calmly into phone) London’s not good.   How about... (pause)   Oh, yes, Madrid is good. And that flight is also at night? ADAM (spinning arou",
      "dialogue_count": 0,
      "word_count": 686
    },
    {
      "scene_number": 5,
      "slugline": "INT. AIRPLANE - NIGHT ADAM and EVE are seated in first class on an airplane.   The interior is darkened, all other visible passengers asleep. ADAM also appears to be asleep, slouched in the window seat; his gaunt face mostly covered by hair and dark glasses.   EVE, in the aisle seat next to him, also wears dark glasses. Though noticeably more fragile than before, she sits upright, alert and wide awake, as her thin hands caress their wedding photo cradled in her lap. FADE TO BLACK. OVER BLACK: “A secret turning in us makes the universe turn. Head unaware of feet, and feet head.   Neither cares. They keep turning.”   - Rumi CUT TO: EXT. TANGIER STREETS - NIGHT EVE struggles to help ADAM out of a taxi in the somewhat run- down quarter of Tangier near EVE’s apartment.   The Moroccan driver lifts their suitcases from the car’s open trunk. EVE pays him and he thanks her politely.   They pick up their luggage as the car pulls away. ADAM now quite frail, is having trouble walking.   He stops, propping himself against a wall. Two shadowed figures pass them, one pausing in front of them briefly to offer “something really special”, first in French, then English.   EVE shakes her head definitively and the figure moves away. EVE (now taking ADAM’s arm) Come on baby, we’re almost there. ADAM (weakly) It’ll be dawn soon. EVE (she glances at the sky) It’ll be fine, we’ve got time. ADAM But did you reach Marlowe?  82.",
      "characters": [],
      "action_text": "EVE No, which concerns me a little. (pause)   But we’ll find him, I’m sure.   Come on. They make it to the next corner, EVE pausing to look up at the building where she lives. EVE (cont’d) (visibly surprised) That’s odd. ADAM (leaning on her) What? EVE My lights are on. ADAM (exhausted) Oh, great.   What next? EVE still holds his arm as they make it across the street and enter her building. CUT TO: INT. EVE’S BUILDING / HALLWAY - NIGHT ADAM and EVE ascend the narrow staircase as quietly as possible.   They pause in front of the door to EVE’s apartment, listening.   From behind the door voices, both adults and children, can be heard speaking Arabic.   On the floor next to the door, in a neat row, are five pairs of shoes, three in children’s sizes. EVE slips her key in the door and opens it. CUT TO: INT. EVE’S APARTMENT - NIGHT EVE stands in her doorway looking in, ADAM propped up just behind her.   The voices are quiet. Looking back at them is a family of Moroccans seated on the floor around one of EVE’s low tables.   On its surface something is cooking on a hotplate.   A clothesline dissects the apartment, draped with drying laundry. There is a long silent pause.   The family: a man, woman, a girl and two smaller boys, stare in surprise and amazement at the gaunt strangers in the doorway.   All of the family have large, dark, sympathetic eyes.  83. EVE (in Arabic, wide-eyed but calm) What’s going on here?   This is my apartment. The woman glances at the man, then stands up and immediately begins to gather their belongings, the girl instinctively springing up to help her.   The man nods toward the two boys, then stands. MAN (in Arabic) We are extremely sorry.   We were told this apartment had been possibly permanently vacated.   This is an embarrassing accident. While he is talking ADAM and EVE step into the room, ADAM stumbling toward the bed, then collapsing onto it. The man speaks to the small boys who are now standing, but staring at EVE. MAN (cont’d) (in Arabic,",
      "dialogue_count": 0,
      "word_count": 1201
    },
    {
      "scene_number": 6,
      "slugline": "EXT. TANGIER STREETS - NIGHT ADAM and EVE walk shakily through the shadowed corridors of the Medina, ADAM partially supporting himself on EVE’s shoulder.   She is also weak, but determined. They move past several men outside a dim cafe.   One approaches them, speaking in English. MAN IN STREET I have something very special for you. ADAM (faintly) Not what   I   need, I’m sure. MAN IN STREET Are you sure? Then, after getting a better look at the strange couple as they pass through a shaft of dim light, he retreats. MAN IN STREET (cont’d) (in English) No, perhaps not. At the next corner they pause, looking across the small square of the Petit Socco.   On the opposite side is the ONE THOUSAND AND ONE NIGHTS CAFE, where EVE had her previous rendezvous with Marlowe.   This time though its lights are turned off, its doors closed and shaded. EVE Fuck. ADAM What? EVE Come on. They stumble across the square, arriving at the locked door of the cafe.   EVE knocks on the door.   No response. ADAM (slouching) Shit, baby.   We’re not gonna make it. EVE knocks again, much louder this time.   She turns and looks around them, propping ADAM up against her. Just then, there is the sound of someone approaching the door from inside.   A lock turns and the door opens a crack.   Part of a man’s face is visible.   The door then opens wider.   It is the Moroccan BARMAN who was there before.  87.",
      "characters": [],
      "action_text": "His eyes are wide, worried.   He quickly ushers EVE and ADAM through the door and into the darkened cafe. CUT TO: INT. ONE THOUSAND AND ONE NIGHTS CAFE - NIGHT The Moroccan BARMAN cautiously locks the door behind them, then turns to face EVE, his sympathetic eyes on the verge of tears. BARMAN (in English) Madame, the boss is not well.   This is a very bad situation.   Very bad. As he says this he briefly takes EVE’s hand in his own. Letting it go, he turns and crosses beyond the bar, stopping near a closed door.   Opening it, he turns to them. BARMAN (cont’d) Please, this way. EVE and ADAM cross and pass through the door. CUT TO: INT. BACK ROOM, ONE THOUSAND AND ONE NIGHTS CAFE - NIGHT The BARMAN closes the door and turns to face them.   The room is a relatively small office; a library lined with bookshelves, there is a desk, several chairs, and a tea- table.   Books are stacked everywhere. BARMAN (crossing the small room) This is our private library. He presses on a leather-bound book in one of the bookcases. The entire section of wall opens, revealing a secret doorway. Again he motions to them and they cross and move through the opening into a hidden room. CUT TO: INT. HIDDEN ROOM, ONE THOUSAND AND ONE NIGHTS CAFE - NIGHT Just behind EVE, ADAM and the BARMAN, the door mechanically closes.   The room is medium-sized, windowless, and lit by lamps and candles.   It’s walls are dark, it’s furnishings a mixture of antique European and Moroccan.   A small desk sits in a corner, its surface a mess of handwritten manuscripts. Central to the room however is an antique daybed with a reclining figure under a dark red, velvet cover.  88. It’s Marlowe, pale, weak and thin.   His eyes slowly open and light up faintly as they locate his visitors.   With effort, he lifts one hand, palm down, toward EVE. MARLOWE (half whispering) Well, well.   Look what the cat dragged in. EVE steps over and takes his hand, kissing it, and kneeling next to him. EVE My dear Christopher Marlowe. MAR",
      "dialogue_count": 0,
      "word_count": 2816
    }
  ]
}