{
  "slug": "only-the-brave-2017",
  "title": "only the brave",
  "genre": "action",
  "format": "film",
  "scenes_count": 34,
  "characters_count": 0,
  "characters": [],
  "total_words": 32257,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. ARIZONA WILDERNESS - DAWN  Blood red sun rolls over an awakening landscape.  Scrub, chaparral, and trees pockmark endless hills, which  roll off to the feet of mountains.  MOVING - through the wild, something catches our eye.  A TREE. But much more than that. This thing, a monstrosity  one could call ugly, has been here since the Dark Ages.  It has a rough, unusual and distinctive bark, and twisted,  massive limbs that reach out in all directions, mostly  horizontal. It is something else than just two words: a tree.  It is   Juniperas deppeana : Alligator Juniper.  This   Juniperas   is the largest for hundreds of miles.  A MAN’S HAND - reaches up, fingertips brushed against the  lowest branches. His touch runs along the branch, as if  trying to glean the story of the tree: what has it seen out  here, every dawn for 1,000, maybe 2,000 years. No one can be  sure how old it is without cutting it down.  And what are these human fingers to it? A passing blip? A  moment that is gone nearly before it occurs? Will the tree  remember this touch?  FINGERS -- find something unusual hanging down -- A CHAIN.  From a chainsaw. The hands let the chain swing back and  forth. Fingers find another chain. Another. Like Christmas  ornaments; saw teeth still coiled with menace, snake-like.  THE HAND - feels rough bark, some blackened by a fire.  PULLING BACK -- the tree is covered in various scars and  burns from years, decades, eons ago. It’s a survivor.  THE MAN’S HAND IS DWARFED -- by the tree. He sees other  things left here: framed photos; cards with phrases: “WE MISS  YOU!” and “WE THINK OF YOU EVERY DAY, DADDY!” Ribbons tied  around branches. Cans of Kodiak and Copenhagen high up in the  notches of great branches. Unopened. Waiting...  THE EYES - move over the tree, the ornaments, the mementos.  OUR VIEW - becomes the tree, the light rising in the East,  and the branches reaching out to us, beckoning us in...  DISSOLVE TO:",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 339
    },
    {
      "scene_number": 2,
      "slugline": "EXT. ARIZONA LANDSCAPE - NIGHT  Clouds roil over a bleak landscape: rolling hills covered in  chaparral and tinder-dry conifer forest.  A powder keg waiting for a spark. Mother Nature provides it  with a dual lightning strike, right into a copse of 80 year-  old Ponderosa Pine.  The trees -- smolder and catch fire.  The fire spreads.  AN HOUR LATER -- the fire has covered 2,000 acres.  We watch the awesome birth of one of Mother Nature’s most  impressive weapons: a wildland fire.  More acres burn. The fire grows, now a living thing, hungry  for more landscape to consume.  In one hour, the 2,000 acres have become 40 square kilometers  of landscape, all awash in flame. This is what will be known  as the Cave Creek Complex Fire, the third largest forest fire  in Arizona’s history.  FROM A DISTANCE -- horizon awash in walls of shimmering red.  Moving this way. A beast on the hunt, coming toward us.  The fire’s life cycle has accelerated -- what was a nascent  fire has become a raging, powerful adult. Full grown.  There is a power and beauty in the flames that harkens to  something primal. An innate, human fear. To flee.  But there is also fascination; an inability to look away --  the connection with fire that mankind has had since we took  our first steps out of Africa 60,000 years ago.  DISSOLVE TO:  INT. PRESCOTT HOME - DAWN  A small house, two bedroom in an area called Government  Canyon in Prescott. Everything squared away.  Surfboard in the corner. Ice climbing gear in neat closet.  Mountain bike against a wall. Books in a homemade bookshelf,  many scientific volumes on plants.  A LINE PACK -- a backpack developed specifically for wildland  firefighter Hotshots, is laid out on the carpet with a thud.  2.",
      "characters": [],
      "action_text": "HANDS -- smooth out the pack. Make sure it’s completely  empty. The line pack has several pouches, zippered pockets,  and sections to hold different items.  THE CONTENTS -- are placed next to the pack.  HANDS - go through them, organizing into categories.  Head lamp. Flashlight. Spare batteries. Compass.  Driver’s License. Incident Qualification Card, called a Red  Card -- issued by the National Wildfire Coordinating Group,  it allows a wildland firefighter to work, and shows their  qualifications. Both ID cards go into a small ziplock bag.  Small notebook with pen. IRPG pocket guide (a small flip  chart info booklet).  First Aid kit; small. Medication: hay fever pills; small  bottle of Aleve. Sunscreen: SPF 60, several tubes. Insect  repellent spray: small. Lip balm: two tubes.  Nalgene Bottle -- three of them. Ice filled -- it will melt.  Six electrolyte packs. Two MREs.  A signal mirror. Six fusees (road flares, used for lighting  backfires). Two extra chains for a chainsaw.  Wedges, plastic, or wood (used for felling trees into the  direction you want them to fall).  One gallon of fuel for the bar oil cans. Oil: two kinds: one  for the saw, the other to keep the chain running smoothly.  Map. GPS. A sharpening file, used for maintaining tools.  We finally see --  THE OWNER -- of the line pack. Forty year-old ERIC MARSH. He  stands and stares down at the pack.  Marsh's face is dead serious. He takes this mundane task as  reverentially as a painter organizing his palettes for the  day, as a Catholic Priest preparing his dais for Sunday Mass.  He packs each item in its specific place. Matches, a Zippo  lighter, rain poncho, socks (trench foot is a worry for  Hotshots), a tarp, a Bendix King Radio (looks like a walkie-  talkie), and a Cannon Powershot camera, all these go into  different pouches and pockets in the pack.  Marsh works, slowly, methodically.  3. The last item to pack is his fire prevention shelter, to be  used only in the most dire of emergency situatio",
      "dialogue_count": 0,
      "word_count": 1098
    },
    {
      "scene_number": 3,
      "slugline": "INT. THE PAVE HAWK, OVER THE FIRE - DAY  The pilot takes the Pave Hawk right into the massive wall of  smoke as the SPOTTER leans out the side of the open cargo  door. A warning VOICE in the cockpit keeps repeating:  HELICOPTER COMPUTER (V.O.)  Warning : Altitude.   Warning : Landing  Gear. Landing Gear.   Warning . ..  PILOT (INTO MIC)  ICC, okay, we’re right there. Hang  tight, we’re coming in.  THE SPOTTER - eyes hidden behind smoke black visor, looks  down into the fire, flames reaching up toward him:  SPOTTER (INTO MIC)  Drop on 3 - 2 - 1 - DROP.  PILOT (V.O.)  Dropping.  The pilot hits the RELEASE button on the collective.  EXT. UNDER THE HELICOPTER - DAY  The Cloudburst fire bucket opens up and water cascades down  at us, washing us away.  EXT. ABOVE THE FIRE - DAY  The 2,600 gallons of river water falls onto the flaming front  of the wildfire.  INCIDENT COMMANDER (V.O.)  Nice one, Firehawk 3. Can I talk  you into taking another run?  PILOT (V.O.)  We’ve got fuel enough. On our way  back to the river.  THE PILOT - takes the Pave Hawk on a stomach-dropping turn  and whirls back toward the distant, winding river.  The wall of smoke swirls into eddies as the powerful jet  helicopter thunders through the orange-black air.  6.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 220
    },
    {
      "scene_number": 4,
      "slugline": "EXT. OVER THE LANDSCAPE - DAY  THE C-130 HOWLS over rolling hills, toward the black skyline.  The plane, dangerously low, nearly clips the treeline.  C-130 CAPTAIN (V.O.)  Incident Command, Map 3 is in  sight. Gonna put the load right on  top of it if we can swing it.  Heading 305, at 9200. Gonna be  hittin’ that north side we’re just  coming over.  INT. THE C-130 - DAY  Out the cockpit, the four-man crew can see the immense clouds  of smoke from the wildfire, heading up into the stratosphere.  AIR TRAFFIC CONTROL (V.O.)  Air Tanker Six-Two, be advised,  helicopter to your four o’clock, at  600 feet, and three aircraft at  your six, following your lead.  C-130 CAPTAIN (V.O.)  Copy.  (to his crew)  Gonna come in low and put the load  right on the north break.  CO-PILOT (V.O.)  Just make sure to keep the speed  up. Stall this low and we are...  He doesn’t finish the thought. Doesn’t have to.  EXT. OVER THE FIRE - DAY  From up here, the C-130 is a tiny dot moving over the  wilderness, just over the trees.  Behind the first aircraft, three more C-130s trail.  Several helicopters rotor along a different ridgeline. Flames  are red threads in the green and browns of the forest.  C-130 CAPTAIN (V.O.)  We’re coming in for our run...  Command, heading in at 270, now,  we’re gonna start at the North side  of Map 3 and hit that first  ridgeline, then go all the way up.  7.",
      "characters": [],
      "action_text": "INCIDENT COMMAND CENTER (V.O.)  Copy that, Six-Two.  EXT. SOUTHERN ARIZONA - DAY  THE C-130 drops a 3,500 gallon payload of SLURRY onto a  RIDGELINE. A mixture of water and fertilizer (which clings to  plants and doesn’t evaporate, and will help plant growth post-  fire), colored red so the pilot can see if his or her payload  has landed, it rains down from the aircraft belly.  POV - FALLING: the slurry cascades toward the fire -- and we  are part of it, just another molecule of liquid --  -- WE LAND ONTO THE TREES AND PLANTS near the front of the  wildfire. In moments, fire SWALLOWS US.  EXT. OVER THE FIRE - DAY  MOMENTS LATER - another AIRCRAFT drops its payload --  FOLLOWED BY -- A THIRD AIRCRAFT. The world becomes red-orange  liquid as the slurry rains down upon us.  EXT. ON THE GROUND - DAY  In the dust and heat below, digging a backfire trench, we  find Eric Marsh’s WILDLAND FIREFIGHTER CREW. They’re what’s  known as a Tier-Two support crew.  Marsh doesn’t believe in standing around, coordinating.  He believes in working.  He wipes away sweat and he digs next to his men.  TOOLS -- work in an almost symphonic harmony, shovels, awls,  Pulaskis, something known as a Rhino, and metal rakes -- all  the tools have their specific task.  Chain saws cut up the big stuff. Then the next Hotshots on  the line dig out the tough underbrush and roots. Next guys:  chop it all up. Last guys: rake all the flammable stuff away.  WHAT’S LEFT -- is a clean fire break.  THE TEAM -- hears a growling, which becomes a roar, filling  the air, DEAFENING, and their eyes turn skyward to see --  8. -- ANOTHER C-130 absolutely SCREAMING over the ridgeline, 100  feet off the deck, so close it seems as if the men could  reach up and touch the gunmetal gray belly. The payload of  fire retardant comes FLYING DOWN at the team.  EVERYONE DUCKS -- as slurry just misses them.  MARSH  Excellent shot!  Marsh looks to his left, sees the red wall of flame in the  distance, closing in. A mile away. He s",
      "dialogue_count": 0,
      "word_count": 1070
    },
    {
      "scene_number": 5,
      "slugline": "EXT. ON THE RIDELINE - DAY  Jesse Steed and CLAYTON WHITTED cut into trees 150 feet tall.  The saws chew into massive trunks, chips and bark spraying.  STEED -- finishes, shouts a warning and moves RAPIDLY from  the trunk. A falling tree is unpredictable. Steed hauls ass.  Moments later, with a mighty crack and a bellowing groan, the  80 year-old Ponderosa Pine FALLS into a gully below.  EXT. A FIRE ROAD - DAY  ERIC’S TEAM - marches in a straggling line up a long  hillside. Boots kick up fine particles of dust. The day is  getting hotter, sun beating down on them.  The men wear heavy gear, slugging forward, packs slung over  their backs, some with large chainsaws to carry.  EXT. FROM OVERHEAD - DAY  We look down on them, see the team snaking through the back  country toward -- a growing WILDFIRE.  HOURS LATER - Marsh’s team marches to a different spot in the  fire assault. Marsh hikes next to Steed and Whitted.  MARSH  Screw this. We’re better than them.  Steed turns to see straggling line of guys behind him.  STEED  We are?  MARSH  We can be Tier One. Just got to  weed out the short timers. Build a  real squad. Guys like you and me.  CLAYTON  Yeah? That’ll work?  MARSH  If we push it. As it is we clean up  tons of mess made by these so-  called Tier Ones. Half of ‘em don’t  even have a tenth our experience.  It’s a common refrain from Marsh, we can tell.  11.",
      "characters": [],
      "action_text": "CLAYTON  I hear ya, Sup.  [”Sup,” short for Supervisor, is pronounced “Soup”].  STEED  Between me and Clay, got more saw  experience than Tier One guys --  Steed’s voice is drowned out as --  An AIR TANKER roars right overhead and drops 30,000 pounds of  slurry onto the ridgeline three miles above them. Right into  the mouth of the flames.  The men turn their heads away from the falling slurry as  their world becomes red liquid.  DISSOLVE TO:  EXT. PRESCOTT, ARIZONA - DAY  Prescott, Arizona: 40,000 souls (motto:   Welcome to  Everybody's Hometown ), 90 miles north and 4,000 feet above  Phoenix, surrounded by the Prescott National Forest.  Signs read: “WORLD'S OLDEST RODEO! PRIDE OF PRESCOTT!”  Residents call each other by name along Main Street. The  mayor and other big shots of Prescott meet and debate  amicably over cups of coffee at the Lone Spur Cafe. Up the  block, the historic Hassayampa Inn, purported to be haunted --  looks over a grand movie theater from the 1930s.  A street not far from the town square has more historic  registry homes than most towns.  A picturesque, Norman Rockwell meets Old West dreamscape.  INT. PRESCOTT, BRENDAN MCDONOUGH’S ROOM - NIGHT  BRENDAN MCDONOUGH, a lanky, kindly-faced 19-year-old, takes a  big bong hit and sits back on his couch, watching “Aqua Team  Hunger Force” in his small bedroom.  Even though his demeanor says slacker, he's got his little  place squared away, everything in its spot.  His cell rings. He takes another hit, then answers.  BRENDAN  Yeah?  12. It comes out: “Yyyyyyeahhhhhhhhh?” He's unable to focus for a  moment. Listens. We hear a female voice.  BRENDAN (CONT’D)  Wait. You’re what?... Uh... how  pregnant?  EXT. PRESCOTT - STREET - NIGHT  Brendan walks through Prescott, hands in his pockets, his  head slung low.  The night is chilly. He walks, aimless. Other aimless people  walk past without acknowledgement.  He sees a RESTAURANT, open. Checks his pockets for money. Not  enough. Counts the crumpled bills, s",
      "dialogue_count": 0,
      "word_count": 3888
    },
    {
      "scene_number": 6,
      "slugline": "EXT. MARSH GARAGE - MORNING  Marsh, stripped down to his underwear, is covered in soot.  His entire body is discolored a brownish-gray-black.  He doesn’t shower. Shower won’t do it.  He gets the garden hose and a big jug of shampoo. Turns the  hose on himself. Freezing. He soaps up.  HIS DOGS - watch, confused. Marsh lathers. Keeps scrubbing.  Gonna take a while.  STEINBRINK (V.O.)  Welcome to your new Headquarters.  Bequeathed to you by the Prescott  City Council!  INT. CREW 7 HQ - DAY  Marsh unlocks the door to a musty, disused, rat-infested and  seemingly unlivable dwelling -- just two metal structures  slapped next to one another, really.  MARSH  Jeeee sus !  He staggers back from the smell. Steinbrink is next to him.  STEINBRINK  Welcome to Wildland Fire Crew Squad  7’s new home, Eric.  MARSH  So generous of the city council.  Great view.  He motions outside to -- THE TOWN DUMP. Rats, birds, snakes  call the heap home. So does bacteria and disease.  STEINBRINK  At least you won’t have to walk far  to get rid of your trash.  Seagulls descend onto the dump, along with crows. Marsh  stifles rising bile as he turns his face from the stench.  MARSH  Town sewer is a block away, too.  STEINBRINK  Everything you need!  29.",
      "characters": [],
      "action_text": "There is a knock at the door. They turn to see Andrew  Ashcraft, pants neatly ironed, tie and button down shirt.  ASHCRAFT  I heard you might be hiring.  EXT. PRESCOTT - FOREST - DAY  Brendan’s class of 15 is now in the field. A downed tree with  a four-foot diameter trunk lies before the class.  INSTRUCTOR  -- wood on the bottom is pulling  together under tension -- and so,  when we buck the log, the wood is  gonna bite into your saw and hang  on. So, we’re gonna buck here --  (he demonstrates)  -- then pivot down, then cut the  far side of the log. So we can make  our release cut and move back from  the log at the same time.  He starts to CUT. He is precise. Finishes a section and then  takes the back of an axe and pounds in a metal wedge. Keeps  the wood from grabbing the saw blade.  ANOTHER DAY:  THE INSTRUCTOR is before a listing tree, dead from rot. He  starts to cut into it. The class watches.  LATER -- hot and dusty out here. During a break, Brendan  surreptitiously takes a quick hit off a joint.  EXT. STEED BACKYARD - DAY  A celebration of the end of fire season. Some familiar faces--  Whitted, Marsh, Steinbrink, others. Kids run around. Steed  mans the grill. There are no vegans here.  STEED  How carcinogenic do you guys want  your burgers?  WHITTED  Stage Four.  STEED  Sup?  30. MARSH  Rare, Steed. Really rare.  Marsh isn’t drinking, as usual. The other guys are. The guys  talk in a tight huddle.  AMANDA -- talks with some of the wives. KRISTI, Whitted’s  girlfriend, speaks loud enough to be heard by the guys:  KRISTI  I know he’s going to propose, but  he just hasn’t done it yet.  WHITTED  (shouts over:)  I heard that! I will. If I don’t  die from this burger first!  EXT. FOREST - LATER  A fellow CLASSMATE makes conversation with Brendan. The guy  is excitable. Brendan half listens to his diatribe.  CLASSMATE  Gonna do a year of wildland and  then become a city firefighter.  Imagine doing this shit forever?  Sweat your balls off. No one knows  who you ar",
      "dialogue_count": 0,
      "word_count": 637
    },
    {
      "scene_number": 7,
      "slugline": "INT. COYOTE JOE’S BAR - NIGHT  Caldwell is at the bar, talking to a girl named HOLLY, when,  CLAIRE - a girl with tattoos up and down her arms and a sly  smile on her face, walks in.  HOLLY  Over here! Robert, meet Claire!  CALDWELL  Nice to meet you, Claire.  CLAIRE  (sotto: to Holly)  I thought this was girls’ night out  and you’re hitting on some guy?  HOLLY  He’s cute.  CLAIRE  Your boyfriend’s bartending  upstairs!  LATER - the place is PACKED, now, everyone dancing. Caldwell  dances with Claire, who’s a little drunk, laughing.  CALDWELL  I really wanna kiss you, Claire.  CLAIRE  You know I have a little boy. I’m a  single mom. Still wanna kiss me?  They are close. Face to face. About to kiss when Holly RIPS  her away. Waves at Caldwell, “one second.” He nods.  HOLLY  (hisses:)  He’s mine, Claire! I found him and  I like him!  CLAIRE  Well, I like him. You already have  a guy upstairs. Let me have him.  HOLLY  (thinks, glances at  Caldwell)  Well...Okay. But just because I  don’t like his shoes.  Caldwell -- has Ariat cowboy boots on. Beer stained, scuffed.  32.",
      "characters": [],
      "action_text": "CLAIRE  Never dated a cowboy!  HOLLY  They’re dirty. Gross. Look at that.  CLAIRE  I like his boots. So I get him.  This logic seems to make total sense to the girls. Holly  shrugs, whatever, and walks away. Still friends.  Claire looks over at Caldwell, who beckons her back on the  dance floor with a broad smile. She runs over to him.  INT. PRESCOTT - EMT CLASSROOM - DAY  Brendan is in an EMT course. A 60 year old EMT Instructor is  teaching them various CPR methods on a CPR training dummy.  EMT INSTRUCTOR  Mouth to mouth is a thing of the  past. Chest compressions alone are  getting enough oxygen to the brain,  and breathing for a person might  actually   cause   damage.  He demonstrates on a DUMMY on the floor.  EMT CLASSMATE  You wanna find your rhythm. I do it  to “Stayin’ Alive.” Ah-ah-ah-  ah...Stayin’ Alive. Stayin’ Alive.  Six other CLASSMATES have no idea what song the old guy is  singing. One CLASSMATE leans over to Brendan:  EMT CLASSMATE (CONT’D)  You smell like a bong, dude.  EXT. OUTSKIRTS OF PRESCOTT - MORNING  Marsh, Steed, Whitted, Ashcraft and a group of other  applicants for the hot shot crew come running in from a  mountain trail. Marsh is ahead. As usual.  THEY RUN - into town. Christmas decorations being put up. The  men run past an inflatable Santa. Finally come to a stop at a  statue that is the designated finish line.  Marsh is dripping sweat, even in the chilly morning air.  Steed, 12 years his junior, gasps for air --  33. STEED  Beat me every goddamn time!  Whitted and Ashcraft are sucking wind, too. Steed finally  slumps to the ground in defeat, laying on his back.  MARSH  We got lots of applicants, but  shitty ones. No experience. Find me  some good recruits.  Marsh moves over and offers a hand down to Steed. Yanks the  bigger man to his feet. Then looks at Ashcraft:  MARSH (CONT’D)  What are you lookin’ at, rookie?  One more mile. Let’s go, man!  Ashcraft nods and jogs away.  INT. PRESCOTT POLICE STATION INTERROGATION ROOM - DAY  TWO ",
      "dialogue_count": 0,
      "word_count": 1773
    },
    {
      "scene_number": 8,
      "slugline": "EXT. PRESCOTT POLICE STATION - DAY  Brendan's Attorney leads him down the steps of the prison.  Brendan has his clothes back. No more orange jumpsuit.  ATTORNEY  They can still come back to you if  they find evidence of the other  robberies. You can go to prison,  Brendan, for a long time. I’m not  talking Prescott jail, I mean State  goddamn prison; there's not a whole  helluva lot I can do about it.  BRENDAN  You know, I may seem like a loser  to you, but I'm a good--  (hesitates)  --a good student. I show up on  time, I wear slacks and an ironed  shirt. And I'm not a loser.  ATTORNEY  Yep. Expect my bill in the mail.  The Attorney slaps him on the shoulder and hurries off.  Brendan is alone on the steps. He looks to the parking lot  and sees the last thing any young man coming out of jail  wants to see --  -- his MOTHER, waiting behind the wheel of her car. Brendan,  eyes watery, walks toward her.  It’s the longest walk in the world...  INT. CREW 7 FIRE STATION OFFICE - DAY  Marsh is behind his desk, Steed standing next to him. The  office is cramped. Flag on the wall. A poster that reads: “NO  STRUCTURE IS WORTH YOUR LIFE.”  MARSH  How many years can you give me?  APPLICANT  Years? Uh, I was hoping to do one  season and move to a fire station  in Tucson. My Dad has connections,  there. Just need the wildfire  experience to round out my resume.  MINUTES LATER -- ANOTHER APPLICANT -  40.",
      "characters": [],
      "action_text": "-- a geeky, lanky GUY sits across the desk from Marsh.  MARSH  Under experience: “Salvation Army  Bell Ringer.” Is that a joke?  GEEKY APPLICANT  Oh, no. Gotta stand on your feet  all day. One guy spit on me once.  CUT TO:  ANOTHER APPLICANT - has three pencils and four pens in his  front shirt pocket, neatly placed.  COMPUTER APPLICANT  I’m really good with machines,  computers, all types of comms  devices. I could get your station  running and humming like NASA.  MARSH  God knows we could use it.  STEED  There is a physical aspect.  COMPUTER APPLICANT  Oh. Like what?  STEED  Hiking up steep grades in 120  degree heat with a 45 pound pack on  your back.  MARSH  Fourteen-hour shifts, sometimes  pulling two days in a row if the  fires really coming on.  COMPUTER APPLICANT  Oh! Well, I couldn’t do   that .  The guy snorts through his nose in disbelief.  AT THE END OF THE MORNING - one last applicant to go.  Marsh is not impressed by Carter, whose T-shirt and jeans  don’t inspire confidence. At least he’s taken the sunglasses  off. The chew is still in his mouth.  Marsh gives Steed a glance, as if to say, this guy? This is  the guy you said I should hire? Marsh checks Carter’s resume.  41. MARSH  I see you worked wildland before.  CARTER  Yep. Five years.  MARSH  Can’t just hire Steed’s friends  just because he vouches for you.  Why should I hire you and not some  of those eager kids out there?  CARTER  I grew up using chainsaws, axes,  tools. Football taught me to endure  pain and stay in the game.  Carter is almost as clipped and monosyllabic as Marsh.  CARTER (CONT’D)  I can work all day long, and I can  find food at the end of the shift.  Marsh waits for more. None forthcoming. That’s it.  MARSH  We’ll let you know.  Carter reaches out for a quick handshake and leaves. As the  door closes, Marsh jumps in the air, shaking his hand.  STEED  What’s wrong, Sup?  MARSH  Holy   shit ! Felt like a goddamn  grizzly shook my hand!  STEED  Told ya. We gotta hire him.  EXT. P",
      "dialogue_count": 0,
      "word_count": 2123
    },
    {
      "scene_number": 9,
      "slugline": "INT. FIRE STATION - MARSH’S OFFICE - LATER  Marsh motions Brendan to the crappy plastic chair.  MARSH  When's the last time you told a  lie?  BRENDAN  ...This morning. To my mom.  MARSH  And you're a felon.  BRENDAN  I was drunk and took something I  shouldn't have. Not an excuse, but -  - I’m no thief.  Marsh tosses the application on a pile.  MARSH  Well, we all do stupid shit. You're  young... Hey, we're gearing up to  go for a run right now. Come along.  BRENDAN  Oh, I'm not dressed for that.  MARSH  People leave crap behind all the  time. Got extra stuff.  BRENDAN  I, uh, I don't have running shoes.  MARSH  What size are you?  IN MARSH’S OFFICE -- Brendan looks with dawning dread as  Steed, massive through the chest and arms, comes in the room,  huge, nearly demonic smile on his face.  STEED  Here we go, sunshine. Sorry they  don't match. But they're free.  BRENDAN  Uh, how far's is the run?  MARSH  Not too bad. Six.  49.",
      "characters": [],
      "action_text": "BRENDAN  Six.   Miles ?  EXT. PRESCOTT STREET - SUNSET  The RECRUITS jog, some on day one, like Brendan, some a week  or two in. Brendan soon realizes that he can't keep up with  the recruits and the dozen or so of the regular core crew.  Marsh is talking as he runs up and down the single and double-  file line of trainees.  MARSH  Fighting wildland fires is  drudgery. Backbreaking work.  Thankless. Anonymous.  (runs alongside Brendan)  And it's one of the most rewarding  things you'll ever do.  Brendan sees a familiar face from High School -- DAVID.  DAVID  ‘Sup, Donut. Didn’t know you were  hardcore like me.  BRENDAN  I don’t know if I am.  David looks like he spends all day long in the gym. Not  winded at all. Gives Brendan a chummy salute and runs ahead.  MARSH (V.O.)  You are not only saving potential  lives, you are saving entire  landscapes. Forests; sometimes  whole neighborhoods and towns.  Think about that. Most jobs are,  “Do you want fries with that?” This  job is “Do you want   fires   with  that?” Looking Mother Nature in the  eyes and trying to channel her into  a place that doesn't kill people? --  that   is an awesome responsibility.  CHRIS MACKENZIE PASSES BY - smirking.  MACKENZIE  Why don’t you give up, rookie?  Brendan glances at MacKenzie, then looks away.  50. ANOTHER GUY RUNS PAST. It’s DeFord, the guy who scares people  in the gorilla costume:  DEFORD  Brendan. Ain’t this a bitch?  BRENDAN  Hey, DeFord. Where’s your gorilla  suit?  DEFORD  We get into a big fire and I’m  breaking it out. Imagine seeing a  gorilla fight a fire?  DeFord laughs and runs ahead, leaving Brendan behind.  STEED  I’ll run with you. If you can get  through this, you can get through  anything. Tell yourself that.  EXT. STATION - DAY  The run finishes. Brendan PUKES into a ditch. He's completely  and utterly spent. He looks up to see Marsh, not even tired.  Steed starts banging out pushups by the side of the road.  Just for, you know, fun.  Carter comes over and sits o",
      "dialogue_count": 0,
      "word_count": 598
    },
    {
      "scene_number": 10,
      "slugline": "EXT. SERIES OF SHOTS - DAY  THE WEEK -- Brendan shows up every morning, bright and early.  IN THE STREETS -- He runs.  ON THE MOUNTAIN -- Marsh makes the recruits hike up severe  slopes. Times them.  ANOTHER DAY -- Marsh stands before the winnowed applicants.  MARSH (CONT’D)  Today you will find out what it’s  like to hike with the actual weight  on your backs that you’ll carry  from now on, into every fire.  EXT. BASE OF GRANITE MOUNTAIN - DAY  Moments later -- Marsh is using a scale to weigh packs -- 45  pounds each. If it’s underweight, he adds more sandbags.  HE HANDS OUT THE PACKS -- to each man.  MARSH (V.O.)  From this moment forward, you cease  to be individuals.  Steed straps his on. Whitted shoulders his.  MARSH (V.O.)  “I” is not a word that is in use  from this day on. Now, it’s “we.”  It’s McKee’s turn. He puts one on. Sags and almost falls  over. Whoa. But how hard can hiking be? He struts off.  Ashcraft tries his on. Holy   shit .  MacKenzie puts the pack on. Tries to hide how heavy it is.  MARSH (V.O.)  We   are a team.  Steed helps Brendan with his pack. As soon as Steed lets go,  the full weight hits Brendan. He collapses, like his legs  were simply cut out from under him.  BRENDAN  Holy crap.  STEED  Get up, rookie! Come on!  52.",
      "characters": [],
      "action_text": "Brendan does. It takes some doing. But he does.  STEED (CONT’D)  That’s my boy. Let’s march, son.  EXT. GRANITE MOUNTAIN HILLSIDE - DAY  Marsh leads the team, STRAIGHT UP, heading at a 12 percent  grade through brush and scrub at a withering pace.  MARSH (V.O.)  We   are a crew.  THE APPLICANTS -- struggle even at the beginning of the hike.  The packs are incredibly heavy.  CLOSE - on the face of Steed. He powers his way up the slope.  Lives for this shit. Legs are coiled masses of muscle.  He is right behind Marsh, who leads the way.  MARSH (V.O.)  And what   you   do directly impacts  your crew. Each one of us.  NEXT IN LINE ON THE HIKE - Whitted -- a smooth hiker. His  inner calm makes him look like a monk, heading up to the  mountaintop to contemplate something deep and unknowable.  MARSH (V.O.)  The guy on the line standing  shoulder to shoulder with you is  the guy you’ll count on to protect  your life, if it comes to that.  CLOSE -- on the sweating, struggling face of McKee.  MCKEE  I don’t -- get it --  (gasp, gasp)  I’m in shape! This -- this --  CALDWELL  Whole different kind of workout.  Hiking with a 45 pound pack on your back -- it’s a bitch.  MARSH (V.O.)  And it will come to that...  ASHCRAFT -- struggles. He’s young, he’s fit, but goddamn.  53. MACKENZIE -- whose dark eyes and handlebar mustache give him  a slightly dangerous look, has just turned 30. Ancient.  MARSH (V.O.)  We will work to become Tier-1.  The packs are uncomfortable. It’s no use. It sucks.  MARSH (V.O.)  Tier One Hotshots. No more deucers.  No more disrespect. You don't like  that goal, you can quit. Today.  Right now. Because it's going to  mean training like crazy. In six  weeks, you'll be in good shape.  BRENDAN -- is nearly at the back. Legs quivering.  MARSH (V.O.)  Anyone who says hiking with a 45  pound pack isn’t hard is a liar.  EXT. HALFWAY UP THE TRAIL - DAY  The men have spread out, each keeping his own pace.  MARSH (V.O.)  In twelve weeks, you’ll be as  conditioned as p",
      "dialogue_count": 0,
      "word_count": 1143
    },
    {
      "scene_number": 11,
      "slugline": "EXT. PRESCOTT STREET - MORNING  The applicants do a five mile run, Marsh leading the way.  Some give up...  Brendan is still here. Not in the back anymore.  EXT. MOUNTAINSIDE - DAY  Marsh trains the men in deployment of shelters. He holds up a  small piece of reflective fabric. Insignificant-looking.  MARSH  This thin little piece of material  can save your life. Even though you  never want to use it, you will  learn how to get it ready and get  into it within seconds.  (he unfurls it)  It's called your Emergency  Deployment Shelter. Firefighters  can survive interior temperatures  of around 300 degrees. Deployments  have occurred 1,239 times since  wildland firefighters started using  the shelters in the 1960s, and out  of that number, 22 men have died.  LATER -- the applicants are learning how to dig a fire break  with various tools when Marsh suddenly calls out:  MARSH (CONT’D)  Deploy shelters! GO! GO!  The applicants try to move fast, get under the protective  material. The shelters don’t comply the way the men want them  to. It’s harder than it looks.  MARSH (CONT’D)  Fire’s coming! No time, no time!  Ashcraft gets under his shelter. Others do the same. Brendan  can’t get his to stay over his head.  MARSH (CONT’D)  Too late! You’re dead. Reset.  EXT. GRANITE MOUNTAIN TRAIL - DAY  Another training hike --  57.",
      "characters": [],
      "action_text": "MARSH (V.O.)  Today -- we do a double. Up and  down Granite Mountain. No stopping.  -- ANOTHER APPLICANT has dropped out, walking downhill. He  passes Brendan, who desperately wants to go with the guy,  wants to quit. Needs to. Can’t make it. But --  -- he stays put. Starts walking again. One step. Another.  MARSH -- moves uphill. Passes some of the young guys on the  trail. Wears the same gear as everyone else. Carries the same  pack load as the young guys. He is simply a bull.  MARSH (V.O.)  Fire season is late April to late  September. We’ll try for Tier-1  this year. Might not make it. No  municipal fire department crew has  ever become a Tier One Hot Shot.  WE GO BACK TO:  EXT. THE FIRST HIKE, TOP OF GRANITE MOUNTAIN - DAY  It’s the very first hike again. The summit of Granite  Mountain -- a clearing where the hike will mercifully end.  Even Steed seems tired. Whitted keeps his pace and --  -- the two men RUN the rest of the way TO THE TOP.  WHITTED  We made it first!  STEED  I won.  WHITTED  I friggin’ won.  Exhausted, Whitted slogs to the center of a clearing at the  top. Throws the pack of his back. Beyond winded. Whitted  turns to see -- ERIC MARSH is already here, arms crossed.  WHITTED (CONT’D)  When the hell did you pass me?  MARSH  While ago.  Marsh is sweating, but not breathing hard. Waits for the  others. He’s got something in his hand -- a deck of cards.  58. Ashcraft arrives, then Thurston, Zup next to him.  THURSTON  Hey, Zup? You made it.  ZUPPINGER  (looking up)  Ha! I made it. I frickin’ made it!  Zup rushes over to the clearing. Flops down into the dirt,  spread-eagled on his back, eyes to the sky.  NEXT -- cousins McKee and Caldwell slog to a stop. They nod  to each other, congratulating one another without a word.  They are covered in sweat. McKee is bright red.  CALDWELL  Hey. What SPF did you use?  MCKEE  SPF? Forgot.  Caldwell reaches in his pack and fishes out some zinc-oxide.  CALDWELL  Idiot. C’mere.  Caldwell spreads sunblock on McKee",
      "dialogue_count": 0,
      "word_count": 1259
    },
    {
      "scene_number": 12,
      "slugline": "EXT. PRESCOTT STREET - SUNSET  The now 35 applicants RUN through Prescott. Marsh leads. From  the looks of it, they’ve been jogging for a while.  THE GROUP - runs past the town square, the courthouse,  Whiskey Row -- where a few drinkers whoop and holler at them.  THE APPLICANTS - run along the outskirts of town. Guys try  desperately to keep up.  TWO GUYS stop, dead tired. They can’t keep up. They’re out...  The others -- keep pace. The group looks tighter and more  fluid than that very first run.  EXT. RIDGELINE - DAY  THE TEAM is on a ridgeline, working. Marsh suddenly shouts:  MARSH  DEPLOY SHELTERS!  The team looks around, confused. Steed moves fast, shouting:  STEED  Deploy! Deploy! Fire coming! MOVE!  Men get out the small roll of material, putting it over their  heads and feet and hitting the deck.  Brendan -- gets it this time. Ashcraft, too.  STEED (CONT’D)  Rookies in the middle, veterans on  the outside. Form a circle. That's  it. That looks like shit!  The men are in a half-assed configuration under their  shelters. Marsh checks his stopwatch. Shakes his head.  MARSH  You're all dead. Fire got you.  EXT. GRANITE MOUNTAIN “STATION” - AFTERNOON  Marsh works on the roof of the so-called fire station, a  jagged hole in the top. The winnowed group of applicants  works on the rest of the place -- replacing floorboards,  tearing out moldering carpeting.  63.",
      "characters": [],
      "action_text": "Steed and Carter replace windows. Ashcraft is sheetrocking.  Thurston works on the wiring. The lights flicker out.  THURSTON  Shit. Sorry, guys.  EXT. DOWNTOWN PRESCOTT - MORNING  The Granite Mountain applicants walk toward a breakfast place  called The Dinner Bell. They look neat, clean, and polite.  MARSH (V.O.)  Like a pro athlete, when you are  off the field, you will conduct  yourself in a manner that can be  emulated and looked up to by kids  and adults alike. It means you'll  iron your shirts and pants, you’ll  tuck in your shirt.  Zup is about to take a dip of Kodiak, but sees Marsh glance  at him. Zup pockets the can of dip.  Caldwell holds the door open for two older women, who smile  as they pass him.  CALDWELL  Morning, young ladies.  OLDER WOMAN  Good morning, you young charmer.  The ladies giggle and move off. Caldwell makes a small bow to  the women and pretends to remove a hat. The women walk off.  MARSH  It’s not an act, Caldwell.  CALDWELL  Sorry, Sup.  MARSH  Doing. Not seeming. Remember.  Marsh moves into the diner. The rest of the crew follows.  MARSH (V.O.)  You will button your collar, and  you're gonna say “Please” and  “Thank you” to people around  Prescott, or wherever we happen to  be fighting a fire in the country.  You will be exemplary.  64.  (MORE) No drunken fights. No bad behavior.  No spitting on the sidewalk. In a  restaurant you call the waiter sir,  or the waitress ma’am. I don’t care  if he went to high school with you  and you hated his guts. You say  “sir” and “ma'am” when you reply to  someone. You look them in the eye.  EXT. AT THE BASE OF GRANITE MOUNTAIN - DAY  Marsh has all the gear the guys will need. And more.  MARSH  Now, we do it the real way. You  will all wear the gear this time.  Brendan watches David, the fitness junkie, gear up and put on  the 50 pounds of stuff: chainsaw, adze, heavy boots, Nomex  clothing, coat and pants, fuel can, and, of course, water.  David smiles at Brendan and gives him a thumbs' up.  DAV",
      "dialogue_count": 0,
      "word_count": 1340
    },
    {
      "scene_number": 13,
      "slugline": "EXT. PRESCOTT STREET - EVENING  The crew of applicants, dwindling in number, do another six  mile run. This time the guy holding a basketball has to  sprint to the front of the line, then hand the ball back to  the next guy. It goes down the line until the guy in back  gets the ball and has to SPRINT to the front. Torture.  One Trainee waves his hands and drops out. He’s had it. He  walks off toward Whiskey Row.  MARSH  Where you going?  TRAINEE  To goddamn get a beer! Goddammit!  EXT. TOP OF GRANITE MOUNTAIN - DAY  Another grueling hike under punishing sun.  The 25 applicants make it to the top, led by, as usual Eric  Marsh. Second to arrive -- Steed.  MARSH (V.O.)  Two weeks left before fire season.  Push it. You will thank me later.  Marsh waits for the men to make it to the clearing.  BRENDAN -- sees what he’s got in his hands.  BRENDAN  Oh, man.  Cards. He’s shuffling the deck. Shuffling. Shuffling. What  might be taken as a slight grin is on his face.  Shuffle. Shuffle.  The sound of shuffling turns into CRACKLING.  The crackling of flames.  EXT. OUTSIDE OF ECKLY, COLORADO - MORNING  FLAMES - reach skyward, the crackling now a constant roar.  A C-130 dumps a load of fire retardant on the flames. A wall  of smoke covers the horizon. We HEAR a news ANCHOR over this:  69.",
      "characters": [],
      "action_text": "NEWS ANCHOR (V.O.)  ...A blaze which began outside of  Yuma County -- that’s in Colorado,  not Yuma, Arizona, has spread  dramatically and unexpectedly.  Residents in the town of Eckly,  Colorado, have been urged to  evacuate as the fire increases to  50 square miles. Reports claim that  two firefighters have been injured.  EXT. WOODLAND COMMAND CENTER, NEAR YUMA FIRE - DAWN  Crew 7 arrives at the mustering station, joining hundreds of  other firefighters and support staff.  ON THE HORIZON - utter and complete blackness. A wall of  smoke, churning and roiling...  Hotshot teams from all over the US get their orders.  Coordinators, helicopter pilots, C-130 pilots, and support  teams -- cooks, sanitation, water supervisors start work.  This is Brendan’s first wildland fire. The amount of  coordination and personnel is staggering.  SUPERVISORS AND CAPTAINS -- gather to get the plan for the  day. Marsh and Steed are here. The assignments are read off.  ICC COORDINATOR  ...Next: Crew 7 -- Marsh, you work  the firebreak on the northwest side  of the range. Grid 18 on the map.  You’ll assist the Tier Ones. Copy?  MARSH  ...Copy.  The COORDINATOR addresses sleepy faces before him.  COORDINATOR  Fire’s burning 50 square miles,  now, and spreading; wind’s gusting  and changing, fighting like a  hooked bass. Be careful. Let's stop  this thing before it gets to a  town.  Marsh looks over to see -- THE OTHER HOTSHOT CREW who passed  his crew on that ridge, so long ago. Marsh gives the Leader a  jaunty salute that’s more “Fuck you” than “Hi.” The Leader  nods back, surprised that Marsh's team is there at all.  70. NEARBY -- Brendan and the rest of the grunts gather around  the breakfast tables. Brendan hears HELICOPTERS throttle to  life. Feels a change in the air. Looks up to see --  -- THREE C-130 aircraft HOWL overhead, heading to the fire.  Abruptly, the hotshot crews finish slamming coffee and  breakfast burritos and get moving   en masse . Time to move out.  Hotshot buggies ",
      "dialogue_count": 0,
      "word_count": 2292
    },
    {
      "scene_number": 14,
      "slugline": "EXT. FIRE BASE CAMP - NIGHT  Everyone is beyond spent. Marsh gets out his deck of cards.  Starts shuffling. Groans as people clock this.  BRENDAN  On a fire? After 36 hours of work?  MARSH  Wanna be the best? Work hardest.  THE KING OF SPADES -- falls from the deck and lands on the  ground before the Hotshots. They slowly start to do pushups.  Brendan is less clumsy, now. His pushups look half decent.  MARSH (CONT’D)  Got news for you. Applied for Tier-  1 status to the Forest Service.  (everyone listens)  We were denied. “Insufficient  practical experience.” Well, we’re  gonna get some.  EXT. HORSESHOE 2 FIRE - FROM HIGH ABOVE - DAY  Crew 7 snakes its way to the top of the mountain, heading  TOWARD the fire. They head toward a flaming wall of certain  death to do a job that no one else will do.  NEWS ANCHOR (V.O.)  The fire is burning 100 square  miles, and seems uncontrollable...  From up here they all look the same in their yellow and brown  Nomex gear. Anonymous, replaceable, interchangeable...  EXT. HORSESHOE 2 FIRE - DAY  The team works through the day, the fire a constant,  spreading monstrosity on the horizon.  EXT. FOREST - ANOTHER FIRE - CAMPSITE NIGHT  The team camps out. It would be beautiful if the men weren't  so exhausted: canopy of trees, utter silence of the woods.  Except for the sound of someone throwing up --  79.",
      "characters": [],
      "action_text": "BRENDAN -- throws up behind a tree. Nearly faints. Falls to  his knees. He's reached a level of exhaustion that he didn't  know existed. But at least --  -- another guy next to him is throwing up, too. It's  MacKenzie. He looks over at Brendan.  MACKENZIE  Fun times.  EXT. HORSESHOE 2 FIRE - DAY  Steed and his group of sawyers fell enormous trees, which  fall with a groan, whoosh and finally SMASH!  CHAIN SAWS -- go all day, felling 70, 80, 100 foot trees.  STEED -- his face covered in dirt and wood chips, saws into a  Ponderosa Pine, towering above him. He finishes. RUNS.  THE TREE -- stands there.  Steed watches. The team is silent behind him. The tree  refuses to fall.  Steed braves running back to the tree. Slams his Sthil into  the guts of it and takes another two second SLICE, chainsaw  revving and growling.  RUNS AWAY - the rest of the team watching. And now --  -- the enormous tree FALLS into a canyon below.  EXT. MARCHING UPHILL - DAY  Brendan can barely pick up his feet. Sees Whitted, chainsaw  over one shoulder, ambling like a pack animal.  BRENDAN  When do I get to have fun and cut  down the trees?  WHITTED  It’s not that fun.  BRENDAN  Come on. It’s so cool.  80. WHITTED  These trees, some of ‘em, have been  standing since Jesus walked the  Earth. Taking one down -- is a sad  experience. Humbling.  Brendan sees Whitted’s face: the guy is serious.  BRENDAN  Never thought of it that way.  WHITTED  We’re just passing though, man.  (motions with his head at  the countryside)  We’re not much. Remember that and  it keeps the proper perspective.  EXT. TOP OF CHIRICAHUA MOUNTAIN RANGE - NIGHT  The fire has been contained. A small portion still burns, but  is running out of fuel. The teams have killed the beast. And  now it’s time to watch its final heartbeats.  BRENDAN - exhausted, sits with the team on a rock formation  above the mountain camp and watches the red finger of flame,  miles distant, as it sputters...  ...and dies.  EXT. CLEARING AT THE TOP OF A MO",
      "dialogue_count": 0,
      "word_count": 848
    },
    {
      "scene_number": 15,
      "slugline": "INT. CREW 7 FIRE “STATION” - DAY  The applicants help Marsh and Steed out to make the station a  slightly inhabitable structure.  MacKenzie uses his artistic skills to paint a CREW 7 logo  onto the side of the building. He steps back, looks at it.  MARSH  Hey, man. Hate to ask you this,  but, uh -- can you come up with a  new logo?  MACKENZIE  But...I just finished this one.  Marsh gathers other guys around.  MARSH  Got a few possibilities for a new  name. Thumb Butte Hotshots was one.  STEED  Thumb butte? Everyone’s gonna read  that as “Thumb Butt.”  MACKENZIE  We can’t have a Hotshot crew called  the Thumb-Butts.  More guys wander over, Carter, Whitted, Ashcraft.  BRENDAN  What about Whiskey Row Hotshots?  ASHCRAFT  Yeah! That’s awesome. We could have  a JD bottle on the logo.  MARSH  Mayor would never go for it. We’d  sound like drunks.  STEED  Some of us are. Proudly.  MARSH  (thinks, then:)  Granite Mountain Hotshots?  STEED  ...Yeah. It’s non-offensive.  83.",
      "characters": [],
      "action_text": "WHITTED  Sounds cool. Mountains are cool.  CARTER  And granite -- that’s tough.  MARSH  Granite Mountain Hotshots it is.  EXT. SOUTHERN ARIZONA - MORNING  The crappy vans they use to get around in have big letters  that read: GRANITE MOUNTAIN HOTSHOTS. Cool, new logo. There  is a big T for “Trainee” in duct tape next to the logo.  MARSH (V.O.)  Prove ourselves and that 'T' will  come off. But not a moment before.  EXT. SOUTHWESTERN ARIZONA - DAY  The crew works a fire that burns near a NUCLEAR POWER plant.  BRENDAN - cuts a line when he sees -- a RATTLESNAKE, hissing  like crazy before him.  BRENDAN  Oh, shit! Snake!  STEED  Come on, knock its head off, man.  BRENDAN  Really? I like snakes.  STEED  You don’t want that thing biting  you, believe me.  BRENDAN  Nah. I’m just gonna let it go.  Won’t bother me.  (shovels dirt at it)  Come on! Get outta here!  The snake moves away, rattling as it goes.  MCKEE -- shouts from his position:  MCKEE  Got a snake over here! Sidewinder!  84. WHITTED  I got a snake here!  Marsh comes wandering over to Steed and Brendan.  MARSH  Snake alley or somethin’.  They look at the nuclear power plant.  STEED  They’re like, super snakes, feeding  off the nuclear energy.  BRENDAN  You guys serious? Snakes are  already scary. But super snakes?  BRENDAN - is working near Ashcraft, ripping away some half-  charred chapparel, when Ashcraft leans forward.  ASHCRAFT  Whoa. Donut, lookit this.  BRENDAN  (ambles over, stares)  What is that?  REVERSE - it’s a charred HEAD. An animal’s head.  ASHCRAFT  Coyote, I guess. Head’s all cooked.  Fire got it. Crispy. No body.  Brendan moves toward the head. Reaches down to grab it.  EXT. HILLSIDES - DAY  Hiking up hills that seem to have no end, through dense  underbrush, right into the face of a burning wall of flame.  STEED  (ambles over to Thurston)  Look what I got.  Steed shows him. It’s a deck of cards. So? Steed goes through  them -- they’re all low numbers. No face cards. Trick deck.  THURSTON  Awesom",
      "dialogue_count": 0,
      "word_count": 683
    },
    {
      "scene_number": 16,
      "slugline": "EXT. NEAR THE FIRE - LATER  Brendan is AIRLIFTED out of the zone. He winces in agony as  the chopper lifts him skyward.  INT. LOCAL HOSPITAL - DAY  Brendan’s leg is a swollen purple-black balloon all the way  from the puncture wound on the calf up to the knee.  DOCTOR  (examining him)  We think you’ll be okay without the  antivenin, Mr. McDonough.  BRENDAN  What? Inject me, man! I don’t wanna  die. What’s the hold up?  DOCTOR  Antivenin can do more harm than  good, sometimes. I’m giving you a  tetanus toxoid and broad spectrum  antibiotic, and an IV.  MARSH -- appears in the doorway. Comes in without a word.  BRENDAN  Please don’t kick me off the crew.  MARSH  No one’s kicking you off anything.  (peers at his leg, then:)  Not bad. You should see the snake.  Marsh hands Brendan the RATTLE. Brendan takes it, unsure.  MARSH (CONT’D)  Make a key chain out of it or  something. Good luck charm.  OVER BRENDAN - staring at the rattle, we hear:  INCIDENT INVESTIGATOR (V.O.)  Mr. McDonough, would you say your  Supervisor gave you enough training  for a situation like this?  INT. HOSPITAL ROOM - ANOTHER DAY  The blackness is dissipating from Brendan’s leg.  87.",
      "characters": [],
      "action_text": "AN INCIDENT INVESTIGATOR from the Wildland Division is on the  scene with a clipboard and a pen.  BRENDAN  It wasn’t his fault.  INCIDENT INVESTIGATOR  So you think it was you who was  negligent in your duties?  BRENDAN  Huh? No. I must’a stepped right on  that snake. No one’s fault.  INCIDENT INVESTIGATOR  They don’t send me to investigate  these things for no reason. Someone  is at fault and I need to file this  report. So work with me, guys.  BRENDAN  It was just -- something that  happened, sir. You’ll just have to  write that in your report.  MARSH - has been listening in the doorway, arms crossed.  MARSH  Sounds like that’s your cue to get  the fuck outta here.  The Investigator looks at Marsh for a beat, then clicks his  pen, pockets it, and leaves the room.  Brendan -- eyes wide, realizes what just happened: Eric Marsh  just stuck up for him.  EXT. VAST CANYON, ARIZONA - DAY  Granite Mountain Trainees work a fire line all day, smoke  pouring into the sky.  They are at the rim of a canyon, the fire reaching from one  side to the other.  BRENDAN - returns to the fireline. The crew acknowledges him.  AMONG THE TEAM -- MacKenzie works alongside Brendan.  88.",
      "dialogue_count": 0,
      "word_count": 408
    },
    {
      "scene_number": 17,
      "slugline": "EXT. VAST CANYON, ARIZONA - EVENING  At the end of the day, Brendan sits with his legs dangling  off a boulder, watching the tangerine and persimmon-colored  sky, the smoke of the fire, burning itself out, like a  painting over the horizon.  He sits with the crew, all of them watching wordlessly, as  logs break off in the valley below, aflame.  FAR BELOW -- the logs fall and explode like fireworks.  MACKENZIE  Guess you’re here to stay.  MacKenzie extends his hand to Brendan. They shake hands.  The team sits in silence and watches the fire, far below. The  valley filled with smoke and flames. Marsh finally speaks:  MARSH  One more day. Then we got her.  THE FIRE -- rages below them. There is a beauty in it.  EXT. MARSH STABLES - NIGHT  Marsh is hosing himself off. The dogs watch. He lathers up.  There’s two weeks worth of dirt on him.  AMANDA  Welcome home.  She comes out of the house. He turns the hose on her. Douses  her. She screams and jumps into his arms.  AMANDA (CONT’D)  Eric!  He drops the hose. They hold one another, smiling and  laughing. He puts suds all over her head.  INT. CALDWELL HOME - NIGHT  CALDWELL goes home and kisses Claire. They’ve moved in  together. It’s fast. But they can’t keep their hands off each  other. She starts taking off his clothes.  CALDWELL  Claire, I'm beat.  89.",
      "characters": [],
      "action_text": "CLAIRE  Come to bed. I'll keep my hands to  myself.  CALDWELL  You always say that.  INT. THE BEDROOM - NIGHT  Claire puts her head on Caldwell's chest. He goes to sleep.  She doesn't, an intuitive worry coming into her mind. She  stays awake for a long time...  INT. MARSH HOME - BEDROOM - DAWN  Amanda wakes up before Eric. It's five AM. Amanda makes  coffee this time. Lets him sleep.  EXT. MARSH HOME - STABLES - EARLY MORNING  Amanda goes out to see her horses. Feeds them, whispering to  them before heading back inside.  INT. MARSH HOME - BEDROOM - MORNING  Marsh wakes up with a black cup of coffee under his nose.  Blearily looks up. Smiles.  MARSH  Smells good to me, now.  LATER -- at the breakfast nook, Marsh serves Amanda a plate  of eggs. Marsh glances at his watch.  MARSH (CONT’D)  There's a 3,000 acre fire.  AMANDA  When will you be back?  MARSH  Week, maybe.  AMANDA  Be careful.  He gives her a look:   babe . Come on.  90.",
      "dialogue_count": 0,
      "word_count": 403
    },
    {
      "scene_number": 18,
      "slugline": "EXT. ROAD - DRIVING - NIGHT  The Granite Mountain team drives for hours through the night.  EXT. HILLSIDES/WILDLAND FIRE - SERIES OF SHOTS  QUICK SERIES OF SHOTS -- Marsh puts his team through hell,  fighting wildfires for 52 days.  TREES - are chainsawed down.  FIRES - grow, rage, and are contained...  DISSOLVE TO:  A LETTER in MARSH’S hands.  We make out a few words:  DENIED TIER ONE STATUS AT THIS TIME.  YOU MAY REAPPLY NEXT QUARTER...  THE CREW -- works like a football team. Know each other's  moves before they make it. A single organism...  ON A HILLSIDE - MacKenzie shouts to Brendan:  MACKENZIE  Donut! Gimme that Pulaski, wouldya?  Brendan does, no longer Brendan to the team. He’s “Donut.”  EXT. FOREST/HILLSIDES - A SERIES OF FIRES  The Granite Mountain team fights one fire after another,  making mistakes together, and having small victories. They  slowly learn what it takes to be a Hotshot crew.  MCKEE  Beard is getting crazy, Zup. You  gonna cut it?  ZUPPINGER  Naw. It’s not that bad. Maybe I’ll  go for a half-Gandalf.  CUT TO:  THE WORK - continues. Brutal. Thankless. Faceless. They're  just another group of young men climbing along hillsides like  a platoon of yellow ants. Just another team in the  conflagration, trying to redirect the wrath of Nature.  91.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 215
    },
    {
      "scene_number": 19,
      "slugline": "EXT. BASE CAMP - EVENING  Marsh deals cards. A five of diamonds.  MARSH  Five more!  They do the pushups. Marsh deals another.  MARSH (CONT’D)  Two of clubs.  (deals another)  Three of...hearts. Wait a second...  He starts rifling through the deck. All low cards. Nothing  over a five. Looks up. What the   fuck ?  He looks up at Steed.  EXT. BASE CAMP - MORNING  MacKenzie is getting something out of the bottom of his pack  when he JUMPS BACKWARD, shouting in fear.  MACKENZIE  Oh! Sweet Jesus Christ!  Everyone looks over. What the hell is it? Snake?  CLOSE - on his pack. In the bottom, a coyote’s head.  Lifeless eyes stare back.  MacKenzie sees other guys laughing. He nods. Okay, okay.  MACKENZIE (CONT’D)  Donut. You   dick .  He says it with appreciation. Brendan shrugs. MacKenzie  nods... Good one.  EXT. A FIRE, HIKING UP A STEEP HILL - DAY  MARSH looks on as his crew hikes in front of him, smoke  pouring out into the horizon on the next hillside.  There’s something on his stoic face that hasn't been there  before this moment -- pride.  EXT. LANDSCAPE - DAY/NIGHT  RAINFALL. Dark clouds... A cold wind coming through...  92.",
      "characters": [],
      "action_text": "And then, just like that -- fire season is over....  THUNDER RUMBLES:  INT. GRANITE MOUNTAIN HQ - DAY  Brendan turns in his gear and stows his heavy boots for the  season at the Granite Mountain HQ. His locker says “DONUT.”  MARSH  Donut! Coming back next season?  BRENDAN  Hell yes, Sup.  MARSH  You better. We need you.  INT. MARSH BARN - DAY  Amanda sees a pile of material in the corner. Leather goods,  tools. She goes through them, confused.  AMANDA  Eric? Are these yours?  Marsh comes in from fixing up his old Harley Davidson in the  garage, wiping oil off his hands with a rag.  MARSH  Yep.  AMANDA  Well, what is it?  MARSH  I’m making a saddle.  AMANDA  You. Making a saddle? Why?  MARSH  Well, to use on a horse. You sit on  it, and you ride the horse with it.  AMANDA  Smart ass, have you ever made one?  MARSH  Nope. Looked up how to do it. On  the Internet.  93.",
      "dialogue_count": 0,
      "word_count": 356
    },
    {
      "scene_number": 20,
      "slugline": "EXT. THE STEED GARAGE - DAY  The garage opens, and DESIREE STEED shouts --  DESIREE  What is happening out here?  Steed and Carter are revving a dirt bike engine.  STEED  What do you think? Travis and I are  partners, now. Soul mates.  CARTER  I know one thing: I feel free.  DESIREE  Don’t mess with pregnant lady.  What’s for dinner, guys?  STEED  Thought that was a woman’s job.  CARTER  I better go. Domestic disputes  don’t interest me.  DESIREE  When does fire season start again?  STEED  Not for a long time.  DESIREE  Come on, stay for dinner. Invite  the wife and kids.  CARTER  Okay, I’ll call Krista. You sure  it’s okay if the kids come?  DESIREE  Hell yeah. Wanna get some parenting  tips. Not from you. From Krista.  Desiree walks into the garage, a one-year old boy in her  arms. Jesse takes his son and kisses the little boy’s face.  STEED  My little man. Everything’s okay  when I look into that face. That  little toothless smile.  Carter and Steed watch the boy, fawning all over him.  94.",
      "characters": [],
      "action_text": "DESIREE  You know...you guys   would   make a  good pair of dads. Cute couple.  CARTER  We can pick something up in town,  Desiree. Pizza or something?  STEED  We’ll ride in on the bikes.  (to his son)  Caden can sit on back of my bike.  CADEN, the boy, smiles as Steed holds him up high.  DESIREE  Never, Jesse. Never.  Desiree kisses Steed. She’s about as close to giving birth as  possible, her bulging belly leading the way. Tries to wrap  her arms around Steed. It’s like hugging a Redwood.  DESIREE (CONT’D)  Wear a helmet, please. Both of you?  STEED  Course. I’m a grown man.  CARTER  Father of two. Very responsible.  EXT. THE STREET OUTSIDE THE STEED HOUSE - EVENING  MOMENTS LATER -- Carter goes RIPPING past on his dirt bike.  No helmet. Pops a wheelie. The engine HOWLS.  TWENTY FEET BEHIND - Steed screams up behind him on his dirt  bike. No helmet. Pops a wheelie and FLIES past at 50 mph.  FROM DOWN THE STREET -- Desiree watches, sighing heavily.  INT. THURSTON HOME - EVENING  Joe Thurston sets the table for four. Cuts up spaghetti for  his two boys, age 4 and 2.  His high school sweetheart, now wife, MARSENA, pours some  white wine for them. Sits at the table. Smiles up at him.  MARSENA  So... Welcome home for a few months  I hope? We hope?  95. THURSTON  One more season. Then EMT work full  time. But...  (sips his wine)  It’s fun. I’m not just saving  lives, like in an ambulance, I’m  helping to save --  He trails off, can’t think of the words.  MARSENA  What? Houses? Wilderness?  THURSTON  Would it be too much to call it a  way of life?  MARSENA  No.  She leans over and gives him a kiss.  THURSTON  Well, that’s it, then.  INT. ASHCRAFT HOME - EVENING  Andrew Ashcraft walks through the door. Juliann hands him the  baby. They kiss, perfunctory. She gives him a bottle, ready  for him. They’ve got this down to a science, now.  He hands her an In Touch Magazine. She heads to the bathroom.  INT. ZUPPINGER’S APARTMENT - NIGHT  Zup looks at himself in the mirror. Gets",
      "dialogue_count": 0,
      "word_count": 986
    },
    {
      "scene_number": 21,
      "slugline": "INT. BANK - LOAN DESK - DAY  Some of the team helps Brendan with his life: setting up a  loan from the bank so he can make sure his daughter has the  necessities of life: a crib, clothes, formula, a stroller.  INT. GRANITE MOUNTAIN HOTSHOT OFFICE - NIGHT  Marsh helps Brendan fill out his taxes.  MARSH  Now, right here, we're gonna deduct  part of your apartment as a home  office. Okay? Save you $900.  INT. GRANITE MOUNTAIN FIRE STATION - CHRISTMAS PARTY - NIGHT  At the Granite Mountain Christmas party, Brendan looks around  at all the faces of the men he's trained with and realizes --  he's a part of something. He's got this ragged, and sometimes  smelly, family.  Amanda Marsh holds little Michaela, smiling into the baby's  face. Michaela smiles back. Amanda glances up at Brendan and  clutches the girl to her chest, as if to say,   “Can I keep  her?”   Brendan nods, go ahead. Smiles.  HIS FACE -- he looks at peace for the first time.  INT. PRESCOTT BACK YARD - DAY  Caldwell looks as nervous as he’s ever looked as --  -- CLAIRE walks down an outdoor aisle toward him.  EXT. ICE WATERFALL, MONTANA - DAY  Wind whipped conditions. A majestic frozen WATERFALL reaches  up toward the deep blue sky. On the face of the three hundred  foot tower of ice -- a tiny speck, moving upward. Ant-like.  THE SPECK - is Eric Marsh, climbing up the side of the wall  of ice, using crampons and ice axes.  CLOSE - an ice axe WHACKS! into the ice. WHACK! Another.  MARSH - pushes himself, moving ever upward.  FAR BELOW - Amanda watches, in her own gear.  99.",
      "characters": [],
      "action_text": "AMANDA  Eric! Be careful!  ON MARSH - he smiles and calls down as he climbs:  MARSH  Sweetheart ...  INT. HOSPITAL - DAY  Juliann falls back on her hospital bed as --  -- ANOTHER NEWBORN cries. Andrew Ashcraft is teary eyed as he  brings her the baby.  ASHCRAFT  You did it.   Again .  JULIANN  We did it.  INT. MARSH HOME, STABLES - DAY  HANDS - finish work on a leather object. The fingers are  gnarled, callused. Dirt under the nails. Then --  -- the hands let go. Work complete. REVERSE --  MARSH - looks at his accomplishment. Nods.  PULLING BACK - it’s his saddle. Made from scratch. Already,  it looks like a good, worn-in piece of craftsmanship.  EXT. MARSH HOME - STABLES - DAY  Marsh saddles his horse. Secures it. Climbs up on his mount.  Sits in his saddle. Smiles. It’s good.  AMANDA  (comes out behind him)  You just went and made a saddle.  She hands him a travel mug of coffee. He sips it: good.  MARSH  Why didn’t I like coffee sooner?  AMANDA  Stubborn.  100. MARSH  Let’s give the new saddle a go.  AMANDA  Gotta meet a new client.  Marsh shrugs, suit yourself. Amanda can’t resist. Spending  time with her husband on horseback? Rare. The best.  She opens the back gate which leads to a landscape of  wilderness and horse paths. Amanda takes her horse and hops  on. Clucks her tongue. Her mare gently begins moving.  AMANDA (CONT’D)  Guess I could be late.  EXT. KLAMATH NATIONAL FOREST - ONE YEAR LATER - DAY  The first massive forest fire of the season.  EXT. KLAMATH NATIONAL FOREST - BASE CAMP - DAY  Marsh hangs up his cell phone. He sees his CREW getting ready  to move off for the day.  The team watches as Marsh goes to his truck and, without  announcement or fanfare, peels off the big “T” -- for  “trainees,” with his knife. Tosses it into a trash can.  BRENDAN AND MACKENZIE - watch. Brendan is about to speak. But  -- MacKenzie stops him with a gentle hand to his shoulder.  No. Marsh steps in front of the crew. Clears his throat.  A big speech is coming. The guys kno",
      "dialogue_count": 0,
      "word_count": 964
    },
    {
      "scene_number": 22,
      "slugline": "EXT. HIGH OVER THE LAKE IN MICHIGAN - DAY  The team are tiny dots on a sheet of glass, with fire waiting  to greet them.  INT. GRANITE MOUNTAIN FIRE STATION - DAY  Marsh has completely refitted the ailing fire station.  The station is proof of the department's victory. Its new  headquarters has a workshop, a gym, and a stocked gear cache  with a sign on the wall that reads: “Total cost for a well-  equipped Hotshot: $4000. Stopping a wildfire? Priceless.”  Marsh and crew wash and wax Granite Mountain's two brand new  $150,000 buggies: burly 12-person crew hauls that are kitted  out with cubbies for medical equipment and tools.  Everyone pitches in. Brendan does the windows with care.  Marsh's superintendent truck, a Ford F-550 he'd customized  with a welded-steel rack and brake lights in the shape of  Granite Mountain's logo, is in front.  STEINBRINK  (comes in the station)  Looks like a real fire station!  Steinbrink shakes everyone’s hand, moving around the room,  big smile on his face. Finally comes to Marsh.  STEINBRINK (CONT’D)  I’m eatin’ my words, Eric. You did  what I didn’t think you could do.  Way to go. Feel good?  MARSH  Yep. (finally allows a grin)  Real good.  STEINBRINK  Even with all this -- new gear, new  station, you guys are saving this  community a   shitload   of money.  INT. GRANITE MOUNTAIN FIRE STATION - READY ROOM - DAY  Ready room. On one wall hangs a poster common in wildland  fire stations. It shows pictures of wildland-fire fatalities,  including the two biggest: Montana's 1949 Mann Gulch Fire (13  deaths) and Colorado's 1994 South Canyon Fire (14 deaths).  103.",
      "characters": [],
      "action_text": "A POSTER READS:  How is your situational awareness today?  Marsh stares back at the poster.  EXT. DRY CREEKBED - DAWN  Horse hooves walk toward us, the rising sun behind them.  MARSH (V.O.)  How’d they say she got out?  AMANDA (V.O.)  I guess the stall door broke off  its hinges and she wandered out  last night sometime. Half the  valley’s scouring the area for her.  Amanda -- comes into focus on her horse. Behind her, Eric  uses old binoculars to scan the horizon. He’s got nothing.  LATER - NEAR PICTURESQUE HILLSIDES - DAY  Two figures on horseback are tiny against endless landscape.  MARSH (V.O.)  Got somethin’. Three o’clock, at  the base of Woodchute Mountain.  CLOSE - on Marsh and Amanda. He points. Amanda squints. Is  that something moving, three thousand some yards distant? A  long way. Amanda urges her horse to move faster.  AMANDA  Nothing but a forestry road there.  MARSH  Yep. Wanna try it?  She nods. She and Marsh take off down the creekbed, hooves on  the rocks the only noise in the morning stillness.  EXT. BASE OF WOODCHUTE MOUNTAIN  Hours later, Amanda comes around a bend. Sees --  AMANDA  Eric! Got her!  -- a pure white horse, grazing by himself in a small meadow.  104. MARSH - behind her, on his own horse, moves toward the stray.  AMANDA (CONT’D)  Don’t wanna scare her. Let me try.  AMANDA - gets off her horse, lariat in her hand. Walks slowly  toward the lost horse, making soft sounds.  AMANDA (CONT’D)  That’s it. Gonna take you home...  She puts the rope over the willing horse’s neck. Cinches it,  not too tight. Firm. She smiles at Eric. Her smile fades.  She points. Marsh turns in his saddle to see --  -- A thin, pencil black line, leading skyward.  Smoke....  CUT TO:  Information flashes across our vision:  UPDATE -- at 9:15 a.m. MDT, June 19, 2013:  The Arizona Emergency Information Network  (AZEIN) reports that the Doce Fire has  burned 7,000 acres and is zero percent  contained. Evacuated: Granite Basin Homes,  Sundown Acres, Old Stage Acres,",
      "dialogue_count": 0,
      "word_count": 2085
    },
    {
      "scene_number": 23,
      "slugline": "INT. MARSH HOME - STABLES - NIGHT  A HORSE is led into a barn. Amanda finishes her work. It's  dark, lit by an overhead hanging light. To the horse:  AMANDA  G'night.  MARSH  Hey.  She jumps, sees a silhouette standing there in the open barn  doorway, lit by the moonlight.  AMANDA  Eric -- scared the shit out of me.  MARSH  Sorry. I'm home.  (holds grocery bags up)  I'll cook if you're hungry.  EXT. YARNELL, ARIZONA - DAY  TITLES:  THE YARNELL HILL FIRE. ARIZONA, JUNE 28, 2013.  Rolling clouds sweep over a tinder-dry landscape. The sun is  low in the sky. A 22-mph wind gusts over the 700-resident  town of Yarnell, Arizona, 80 miles northwest of Phoenix.  LIGHTNING flashes over the landscape.  Dead silence. Then -- thunder, growling across valleys.  Another lightning strike hits land, like God’s fingertip  pointing at the Earth --   there .  A coil of flame appears.  We are watching the birth of what will become one of the most  lethal fires in US history...  EXT. YARNELL INCIDENT COMMAND STATION - DAY  An INCIDENT COMMANDER has set up HQ at the volunteer fire  station in Yarnell.  INCIDENT COMMANDER (INTO RADIO)  We need eight engines; structure  protection specialists;  112.  (MORE)",
      "characters": [],
      "action_text": "air tankers. As many as you can get  me. Keep em comin’.  (listens)  Yeah, Air Hawks, too. And more  hotshot crews...  He scans a list of Hotshot crews --  INCIDENT COMMANDER (CONT’D)  Get me the closest ones.  ON THE LIST - his finger points to: Granite Mountain.  INT. MARSH HOME - BEDROOM - DAWN  Marsh’s phone rings: it’s 4:30 AM. He answers and has a brief  conversation:  MARSH  Marsh.  (listens)  Yep.... Yessir. Got it. Granite  Mountain will be there.  IN THE LIVING ROOM --  He turns on the TV -- sees the news -- the Yarnell Fire is  now an out of control inferno that has grown from a lightning  strike to a monstrous, 8,300 acre juggernaut.  AMANDA  You going in, Eric?  MARSH  Yeah, babe.  He puts his clothes on and grabs his pack.  AMANDA  I'll make coffee.  (he’s about to protest)  Don’t worry. I’ll make it your way.  INT. MARSH HOME - KITCHEN - DAWN  They go about their quotidian routine in silence. She puts a  thermos of coffee in his hand. Kisses him on the lips.  AMANDA  Wear sun block.  113.  INCIDENT COMMANDER (INTO RADIO) MARSH  You worried I'll get more wrinkles  than I already have?  She looks into his face. He's 43. His face has character.  AMANDA  How long can you do this for? I  mean, you call the guys your kids.  MARSH  Shit. What else am I gonna do?  AMANDA  Be here with me.  MARSH  You love me more when I come back.  AMANDA  (it’s true)  Come back.  MARSH  Always do, babe.  He heads out the front door. She watches him go to his truck.  He starts the engine and drives off. Gives her a final wave.  She watches him go...  INT. BRENDAN’S APARTMENT - PRE-DAWN  Brendan opens the front door for his Mother. He’s got  Michaela in his arms. He kisses his daughter on the head.  BRENDAN  Be good for grandma, okay?  BRENDAN’S MOTHER  She’s an angel. Don’t you worry.  Michaela gurgles up at him, smiling.  BRENDAN  Thanks, Mom. I love you.  She hasn’t heard him say this much lately. She smiles back.  114.",
      "dialogue_count": 0,
      "word_count": 550
    },
    {
      "scene_number": 24,
      "slugline": "EXT. PEEPLES VALLEY - MORNING  Six hundred RESIDENTS of Peeples Valley are fleeing their  homes as the fire rages on the horizon...  EXT. GRANITE MOUNTAIN CARAVAN - MORNING  The sun has risen as the Granite Mountain caravan crests the  Bradshaw Mountains, descending into Skull Valley.  Marsh drives his supervisor truck up front while the buggies  follow close behind.  INT. YARNELL INCIDENT COMMAND STATION - DAY  THE hotshot team SUPERVISORS go over the resources coming in:  engines, water tenders, aircraft. Marsh sees THE TEAM LEADER  who hiked past him, so long ago. The Leader nods at Marsh.  SUPERVISOR  Okay, here’s a good safety zone.  This little smudge -- that’s where  the vegetation has been cleared.  Marsh and the Captains study the terrain using Google Maps.  ON THE SATELLITE IMAGERY -- halfway between Yarnell and the  fire, Marsh sees a cleared area around Boulder Springs Ranch.  MARSH  That’s good. Bombproof.  EXT. FIRE ROAD - DAY  The Hotshots hike in single-file lines. Granite Mountain  takes the lead. Six other crews behind them.  STEED -- up front. Behind are four two-man saw teams and  squad boss Carter, followed by Brendan and the six other men  carrying Pulaskis and hand tools. Whitted and Caldwell next.  EXT. ON THE BASE OF THE HILL, YARNELL - MORNING  A little more than a mile in, the thin road veers left and  climbs 850 feet to the crest of the Weaver Mountains, where  the fire is burning. It is nearly 10 A.M.  MARSH  Donut! How hot is it?  115.",
      "characters": [],
      "action_text": "Brendan checks the thermometer dangling off his pack.  BRENDAN  Hundred, Sup.  THEY KEEP HIKING, this time going UP.  THE HOTSHOT CREWS - peel off in different directions, heading  to different parts of the fire front.  The last spots of shade have disappeared.  Brendan slogs along in the heat. He carries 13 quarts -- 26  pounds of water.  To their left, the blaze is held tight against the rim rock  on the range's crest.  On the east flank, to their right, fingers of fire.  They’re hiking through a valley of flame...  EXT. YARNELL RIDGELINE - DAY  CHAIN SAWS -- break the morning silence.  THE CREW -- builds the fireline, removing all flammable fuel  along the fire's eastern flank.  STEED AND HIS SAWYERS are first, chainsaws buzzing and  snapping into brush.  BRENDAN AND THE SWAMPERS haul it off the line and throw it  down the mountain.  The rest of the hotshots follow behind, using Pulaskis, tools  called Rhinos, and rakes to clear away brush.  EXT. PEAK OF A RIDGELINE ON YARNELL HILLS - MORNING  Marsh is alone, scouting on a ridgeline. He makes it to the  peak above the crew, watching --  -- THE FIRE, burning north toward Peeples Valley.  MARSH (INTO RADIO)  Steed. Starting to build up steam.  STEED (ON RADIO)  Copy that, Sup.  116. Marsh notices the few small CUMULUS CLOUDS, puffy seeds of  thunderstorms, building to the north of the fire. Like giant  vacuums, these clouds create wind, drawing in hot air and  moisture rising from the desert floor as they grow.  MARSH (INTO RADIO)  Command: Granite Mountain. Bigger  those clouds get, the stronger the  vacuum and the faster the flames  will be pulled toward the houses in  Peeples Valley. This fire could get  bigger, real quick.  INCIDENT COMMANDER (ON RADIO)  Copy that, Granite Mountain. You’re  our eyes. Be safe.  INT. INCIDENT COMMAND HQ - DAY  The Incident Commander looks at the weather forecast.  INCIDENT COMMANDER  He’s right. Could get worse in a  damn hurry. Gonna need more Hotshot  crews, aircraft, and engin",
      "dialogue_count": 0,
      "word_count": 712
    },
    {
      "scene_number": 25,
      "slugline": "EXT. DENSE WOODLAND - DAY  Caldwell and most of the crew prepare to burn the fuel before  the fire can reach it.  CALDWELL  Let’s take away this son of a  bitch’s power.  MCKEE  Heard that.  THE MEN - use their drip torches to light the piles of newly-  raked and unearthed underbrush.  MOMENTS LATER - the backfire they’ve set is burning.  MARSH (V.O.)  Donut! With me!  EXT. ANTOHER HILL - DAY  Brendan breaks off with Marsh and a short squad, following  the charred perimeter of the fire.  MARSH  We’re gonna dig a two-foot trench  until we’ve linked up with the rest  of the cold black to the north.  BRENDAN  Sounds good, Sup.  A HALF HOUR LATER - Marsh and Brendan are scraping two feet  wide line down to mineral earth. They finally finish:  MARSH  Okay. That’s a good anchor. Linked  up with the cold black of the  previous burn. Solid and secure.  EXT. THE SKIES OVER YARNELL HILL - DAY  TEMPERATURE RISES -- humidity drops, and the fire PICKS UP.  INT. YARNELL INCIDENT COMMAND STATION - DAY  Storm clouds prowl to the north.  118.",
      "characters": [],
      "action_text": "SUPERVISOR (ON RADIO)  Granite Mountain, this is ICC. Can  you confirm thunderheads through  the smoke from your position?  EXT. RIDGELINE - DAY - CONTINUOUS  Marsh can. Big, rolling anvils of clouds with dark intent.  MARSH (INTO RADIO)  Copy that, ICC. Got eyes on em and  will keep a watch.  AN air tanker ROARS TOWARD THEM and -- DOESN’T DROP on the  main fire. Keeps flying over the flaming front.  MARSH (CONT’D)  Shit.  BRENDAN  Where’s he going?  THEY WATCH AS THE AIR TANKER -- drops retardant RIGHT ON  THEM. They duck as -- THE SLURRY lands on them.  MARSH  Dammit!  STEED (ON RADIO)  Sup, this is Steed. We just got  nailed with that load.  MARSH (INTO WALKIE)  Yeah, us too.  (into radio)  ICC -- this is Granite Mountain.  Air command just put a whole load  of slurry on our backfires!  Marsh gets a garbled response. Brendan and Marsh can make out  a few words: “Repeat last...” “Couldn’t copy...”  MARSH (CONT’D)  They’re putting out the wrong  goddamn fires!  (frustrated)  Get Steed to cut a line where I’m  pointing, up that Eastern flank.  Brendan nods and starts jogging in his full kit, jangling  along with 50 extra pounds of gear on him.  119.",
      "dialogue_count": 0,
      "word_count": 385
    },
    {
      "scene_number": 26,
      "slugline": "EXT. STEED’S POSITION ON THE OPPOSITE RIDGE - DAY  Nine minutes later -- the team watches the skies as --  -- ANOTHER DC-10 HOWLS overhead and -- dumps another load,  compounding the error. RIGHT ON THEM.  STEED  They’re putting out our backburn!  WHITTED  By the time the main front comes  over that ridge, it’s gonna be all  ready to burn it up again.  STEED  It’s gonna eat that fuel and grow.  Brendan comes running up, out of breath.  BRENDAN  Sup wants a line up there.  EXT. MARSH AND BRENDAN’S POSITION - DAY  On the ridgeline, Marsh spots the Granite Mountain Crew, and  sees the approaching wildfire.  The crew looks like little yellow dots on the hillside,  standing in the path of a monumental wall of flame.  MARSH (INTO WALKIE)  Steed. After you cut that line I  want you to make a direct attack  along the fire’s eastern flank.  He points at the eastern part of the ridge. Of course no one  can see him pointing from here, but Steed says:  STEED (ON WALKIE)  Yeah, I see what you mean. Copy  that, Eric. Sounds good.  MARSH (INTO WALKIE)  I’ll come down to help.  STEED (ON WALKIE)  We need a lookout up there.  MARSH (INTO WALKIE)  We’ll send Donut up here to keep  eyes on us. He’s been under the  weather anyway.  120.",
      "characters": [],
      "action_text": "STEED (ON RADIO)  Yeah, his vagina has been bothering  him. Prob’ly needs a rest.  EXT. STEED’S POSITION ON THE OPPOSITE RIDGE - DAY  Steed’s crew is cutting the line along the Eastern flank.  The Blue Ridge Hotshots, a crew out of the Coconino National  Forest, arrives on the scene, marching uphill. The SUPERVISOR  arrives on an ATV. He and Marsh shake hands.  MARSH AND THE OTHER SUP - go over coordinated plans. It’s  obvious that the Supervisor looks up to and respects Marsh.  MARSH  Granite Mountain will keep building  line on the fire's eastern edge  while you guys widen that old road  between the fire and Yarnell.  BLUE RIDGE SUP  Good plan, Marsh.  MARSH  If the winds shift and the blaze  runs toward town, Blue Ridge can  set fire to the brush between the  road and the wildfire, robbing that  thing of the fuel it needs to  survive. Sound good?  BLUE RIDGE SUP  Yep. Let's do it.  MARSH  Would you give our lookout a ride?  BLUE RIDGE SUP  Sure. Hop on.  Brendan glances at Marsh, who points a finger at him.  MARSH  You watch out for us.  He hands Donut the extra tactical radio. Brendan takes it,  checks the batteries and reception. It's good to go.  BRENDAN  Sure thing, Sup.  121. Brendan throws his gear on the back of the ATV. Climbs on and  the Blue Ridge Sup speeds away.  BRENDAN’S POV -- as the crew recedes from his view, the ATV  roaring down the dirt fire road, the faces of the men he’s  come to know so well become indistinct blurs.  MACKENZIE WAVES - then flips him off. Brendan does the same.  It will be the last time he ever sees the crew.  EXT. ON THE HILLSIDES - DAY  Brendan gets a ride to a bluff in the valley that gives him  an incredible view of --  -- THE FIRE.  Brendan is left alone along the ridgeline. The crew are tiny  dots a mile away, cutting line. Worker ants.  EXT. HILLSIDE - DAY  Brendan sees another hill above him. A slight rise. He starts  hiking to the top, radio in hand. The loose earth and  chaparral make it a slog.  EXT. BRENDAN’S LOO",
      "dialogue_count": 0,
      "word_count": 1197
    },
    {
      "scene_number": 27,
      "slugline": "EXT. CALDWELL HOME, OUTSIDE OF PRESCOTT - DAY  Claire waters the sunflowers in the well-kept front yard.  The sky above her is nearly purple.  A GUST OF WIND hits, so strong sunflower blooms are shoved  flat. Moments later, the dry creek behind her house fills  with water. She rushes to watch.  She excitedly grabs her phone and TEXTS:  We got water in the creek! Hope rain  helps you guys! Text when you can.  You coming home tonight? Love you.  EXT. BRENDAN’S LOOKOUT RIDGE - DAY  Brendan can see -- the flames hit his -- TRIGGER POINT.  BRENDAN (INTO RADIO)  Steed, I'm changing position.  STEED (OVER RADIO)  Okay, cool. You good?  EXT. FROM STEED’S POSITION - DAY  Steed turns around, sees the almost infinitesimal dot that is  Brendan crawling down from his ridge, so far away. He also  sees the promise of the fire front, smoke and hazy light.  STEED (OVER RADIO)  I've got eyes on you and the fire,  and it's making a good push.  EXT. ON A RIDGE - DAY  Marsh watches the smoke abruptly twist and writhe, a snake in  the sky, tail coiling to strike.  INCIDENT COMMANDER (V.O.)  We’ve established three trigger  points. First trigger for Yarnell  evac should take an hour. Second  trigger: all teams retreat. Third --  no one should be near Yarnell.  MARSH’S FACE - wind, which a moment before was on his back,  now hits him in a direct blow. He blinks back soot and smoke.  125.",
      "characters": [],
      "action_text": "MARSH (INTO RADIO)  Steed: don’t like this wind. Let’s  get down to that boulder face.  EXT. BOULDER FACE AT THE BOTTOM OF A VALLEY - DAY  Steed, Marsh and the other 17 Granite Mountain hotshots make  it to a boulder face in the burned-out black along the ridge.  The men take a break and sit on the jumble of rocks.  THE SMOKE - seems far off. Not a threat. The men who’ve  brought phones with them take pictures.  INCIDENT COMMANDER (OVER RADIO)  Granite Mountain, ICC. Did you copy  that weather report?  MARSH (INTO RADIO)  Winds are getting squirrely up  here. The dozer and retardant line  have been compromised.  (frustrated)  Those two missed drops have now  given the fire something to burn.  MARSH LOOKS UP THE HILL AT -- the place where Brendan was. He  can see the tiny figure, staring down. A pinpoint.  INCIDENT COMMANDER (OVER RADIO)  Granite Mountain: in a good spot?  MARSH (INTO RADIO)  Affirmative. We're in the cold  black. Safest we can be in.  Marsh and the crew are standing in the island of ash the fire  has left behind the day before. The brush is incinerated, and  the chance of re-burn is nil.  MARSH’S EYES - go up to the hillside where he was scouting  moments before. The hill is turning orange. Flames coming.  INT. AIR HAWK FIVE - DAY  In the Air Hawk helicopter, the PILOT and SPOTTER glance at  the expanse of land below and the incredible --  -- WALL OF FIRE, APPROACHING.  PILOT AND SPOTTER SEE - 19 figures on the boulder face above  a broad valley bowl.  126. FIRE HAWK PILOT (INTO MIC)  Command: Air Five. We have eyes on  Granite Mountain. They're in the  black. Will guide air drop.  INCIDENT COMMANDER (OVER RADIO)  Let's shift focus of the firefight  entirely to Yarnell. Granite  Mountain is safe and sidelined.  EXT. BOULDER FACE - DAY  Granite Mountain crew has a clear view of the fire.  MacKenzie shoots a short video, panning the crew in the  foreground, the fire far in the background. No one seems  concerned. Everything is under control. Except --",
      "dialogue_count": 0,
      "word_count": 2140
    },
    {
      "scene_number": 28,
      "slugline": "EXT. OVER THE FIRE - DAY  The fire reaches the southern end of the boundary line. It's  right above Granite Mountain’s position. WE HEAR:  AIR ATTACK PILOT (V.O.)  Granite Mountain, we’re coming in  with a full load. Can’t see a thing  down there. Guide us if you can.  EXT. IN THE VALLEY - DAY  Marsh watches an air-attack supervisors tracing a flight path  for a big tanker, a modified DC-10, to spread retardant.  MARSH (INTO RADIO)  You got it. That's exactly what  we're looking for. That's where we  want the slurry.  EXT. NEAR YARNELL - BLUE RIDGE TEAM - DAY  Brendan and the Blue Ridge hotshots watch the exodus of the  Yarnell citizen's cars. The fire has overtaken houses at the  end of the street. Every few moments a propane tank EXPLODES,  throwing 30-foot flames skyward.  A HELICOPTER beats the air above -- and Brendan hears the  chopper pilot's voice on the radio:  PILOT (OVER RADIO)  Attempting another grid search for  that Granite Mountain crew...  EXT. YARNELL FIRE - FLYING IN AIR HAWK TWO - DAY  The helicopter searches for the crew through the smoke.  EXT. VALLEY FLOOR - DAY  The outflow winds rush around ridges and into canyons at 50  MPH, pushing fire in new and erratic directions.  MARSH -- looks up the high slope to see --  -- THE FIRST FINGERS of flame, rising over the hill. Heat  waves fill the air above the team. Then -- the flames RISE.  A living beast, it's coming for them...  134.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 251
    },
    {
      "scene_number": 29,
      "slugline": "INT. DC-10 - FLYING - CONTINUOUS  The DC-10 PILOT is still lining up a path for the tanker,  talking with operations supervisors on the ground and the  tanker pilot in the air.  AIR SUPPORT PILOT (V.O.)  Air attack 7, we’re gonna try a  run. Our radio isn’t picking up  Granite Mountain...  EXT. IN THE VALLEY - DAY  The fire is cresting the hill and creeping down. Steed sees  it. So do the others.  MARSH (INTO RADIO)  Granite Mountain hotshots, we are  in front of the flaming front.  (no response)  Air-to-ground 16, Granite Mountain,  Air Attack, how do you read?  (no response)  Air attack, Granite Mountain, how  do you copy me?  MARSH - sees that the air tanker is going to pass right over  them and miss their drop point. Steed and the team are  watching, too. Urging the plane to make the right drop.  MARSH (OVER RADIO) (CONT’D)  Air attack, Granite Mountain! Drop!  INT. THE AIR TANKER - DAY  In the cockpit, the Pilot only sees a wall of fire.  EXT. CANYON BOTTOM - CONTINUOUS  Marsh sees that the flames are right above them, now.  Ashcraft, Caldwell, McKee, Thurston, Zup, DeFord, Whitted and  Carter, and the others, watch the fire come for them.  MARSH (INTO RADIO)  Granite Mountain hotshots.  (stressed:)  Our escape route has been cut off.  135.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 219
    },
    {
      "scene_number": 30,
      "slugline": "EXT. OUTSIDE YARNELL - DAY  Brendan hears the conversation over the radio.  MARSH (V.O.)  Our escape route has been   cut off.  Marsh sounds almost calm. But Brendan knows the difference in  Marsh's voice   this   calm isn't calm.  EXT. CANYON BOTTOM, THE VALLEY - DAY  The team watches their leader. Marsh looks at them all.  MARSH  Deploy your shelters.  The team stares back. Holy shit. This has gone from a regular  day of work to a life and death situation within minutes.  They throw their fuel cans as far into the brush as they can,  and then stretch out close to one another, feet facing the  oncoming fire.  MARSH (CONT’D)  We got ninety seconds, max. Move.  The men do as they're told. They get out their fire-retardant  shelters. Just like they trained, again and again.  WE SEE -- Caldwell, moving quickly. McKee next to him.  MacKenzie -- gets his shelter out.  Ashcraft, face lined with worry, eyes the ridgeline. He sees -  - FLAMES COMING DOWN AT THEM.  STEED  Veterans outside, rookies inside  the circle. Let’s move it!  The men cover themselves with the shelters. Caldwell takes a  last glance at the world and then -- takes cover.  STEED (CONT’D)  Tighten up that circle.  The team moves closer. Eyes peek out from under shelters.  MARSH AND STEED - are the last to deploy.  MARSH  Get under yours, Jesse.  136.",
      "characters": [],
      "action_text": "Steed nods. The big man expertly gets under his shelter.  MARSH - now alone, looks over his crew as the heat of the  fire front nearly bowls him over.  HIS POV - flames coming down at them. Roaring at Marsh. A  living, howling animal.  Marsh gets on the radio, a hot wind screaming around him now,  the front pushing down into the canyon:  MARSH (CONT’D)  We are preparing a deployment site,  and we are burning out around  ourselves in the brush, and I'll  give you a call when we are under  the sh... the shelters.  AIR SUPPORT PILOT (OVER RADIO)  Okay, copy that. So you're on the  south side of the fire, then?  MARSH GLANCES UP TO SEE -- the flames reaching the valley  floor. Eye level. He stares into the eyes of the beast.  It stares back.  The wall of fire seems to rear up at him, bear-like. Fifty  feet tall. One hundred feet tall. Swirling.  MARSH (INTO RADIO)  AFFIRM!  Marsh finally snatches his shelter, so flimsy and light, out  of his pack. Gets under it and next to Steed within seconds.  INT. GRANITE MOUNTAIN BUGGY - DAY  Brendan has heard the conversation on the radio.  Stunned. He can't move. He can't breathe. His eyes water with  horror. It can't be true. The team has to be okay...  EXT. MARSH HOME - STABLES - DAY  Amanda cleans out the barn. And then, for no reason, abruptly  sits down, just as if her legs were cut out from under her.  More curious than frightened, she tries to stand up. Clears  her head. That was strange. She Gets out her phone and texts:  You okay?...  137. ON THE TEXT:  YOU OKAY?  The words fill our view, becoming everything...  INT./EXT. DC-10 - FLYING - DAY  The air-attack pilot calls Granite Mountain, again and again:  AIR ATTACK PILOT (INTO RADIO)  Granite Mountain, do you copy?..  Granite Mountain? Do you copy?...  Granite Mountain? ....  There is no answer...  DISSOLVE TO:  EXT. MULTIPLE LOCATIONS - GROUND AND AIR - DAY  Men on foot and in a helicopter begin a frantic search for  the hotshots at 5:16. They start at the anchor point ",
      "dialogue_count": 0,
      "word_count": 942
    },
    {
      "scene_number": 31,
      "slugline": "INT. STEED HOME - DAY  Desiree is feeding the two kids when she sees something on  the kitchen TV. The news. She stops what she’s doing.  ON THE SCREEN - words on the newscast read:  HOTSHOT CREW MISSING AND FEARED DEAD IN WILD FIRE.  Her home phone rings. She stares at the phone. Ringing.  Ringing... She can’t bring herself to answer...  EXT. COMMAND POST - LATER  Claire Caldwell rushes into a makeshift staging area. Firemen  everywhere. No one in charge. Crazed eyes as people demand  information. Claire cuts through them, sees Steinbrink. She  grabs him. Her eyes are wild.  CLAIRE  Is it true?  STEINBRINK  Claire, I --  CLAIRE  Is my husband fucking d-  (shouts)  -- IS HE DEAD?  AMANDA - walks in. Claire sees her. Amanda can barely walk.  STEINBRINK  They're gone. Nineteen of them. All  except for Brendan.  Amanda and Claire see --  -- Brendan, alone. In a corner. Eyes wide.  Amanda goes over to him.  He looks up at her, confusion on his face. He might not even  be sure where he is or who she is. He's in shock.  She finally reaches out and grabs him to her. They stand  there for a time as other wives show up, and their cries of  realization that their husband or boyfriend or fiancée will  not be coming home are the only sounds that can be heard...  Claire collapses to the floor. Desiree Steed has arrived. She  holds Claire.  140.",
      "characters": [],
      "action_text": "Juliann Ashcraft runs in.  Sees Claire and Desiree. Sees Amanda. Knows instantly what’s  happening. Her legs go weak and she limps toward the wives.  They all hold onto each other. Wordlessly standing there.  Our world slowly fades away to darkness...  OVER BLACK:  NEWSCASTER (ONSCREEN)  -- one of the worst firefighting  tragedies, a reported 19 wildland  firefighters have been killed in  the Yarnell Hill Fire...  THE SUN -- rises through the smoke.  EXT. VALLEY- DAYBREAK  Steinbrink and Brendan drive into the canyon.  A dozer has cut a road through the blackened stumps and heat-  spalled boulders so the bodies can be retrieved.  BRENDAN -- sees the clearing. Stares into it. Like looking  into an abyss...  THE BODIES -- have been bagged, laid out in three tidy rows.  MOMENTS LATER --  Three Ford F-250s drive out the dozer road.  Four fire fighters stand at the rear flanks of each one, two  on a side, at attention and in salute.  Four others gently carry the bodies, covered now by American  flags, and load them into the beds.  EXT. BOULDER SPRINGS RANCH - DAY  The trucks return to Boulder Springs Ranch, where the vans  from the medical examiner's office wait, one man riding in  the back of each truck to make sure the flags don't fly away.  BRENDAN -- is in the back of a truck, holding down one of the  fluttering flags. Unsure who’s body he’s pressing down on.  141.",
      "dialogue_count": 0,
      "word_count": 478
    },
    {
      "scene_number": 32,
      "slugline": "EXT. HIGHWAY 89 - DRIVING - DAY  A grim caravan: 19 white hearses.  Brendan and Steinbrink are in the caravan from Yarnell to  Phoenix, where the bodies will be autopsied.  They drive out Highway 89, south toward Wickenburg, and  that's where --  -- THE CROWDS begin.  STEINBRINK  Would you look at that.  THE HIGHWAY -- people line the side of the highway for miles,  old and young, cops and firefighters and civilians, saluting  or hands over hearts.  EXT. NEAR PHOENIX - DAY  The crowds thicken, sidewalks jammed, now.  BRENDAN - sees people crowded on overpasses as they move  beneath them. He sees flags and respectful faces. News  cameras and the curious. He sees some people crying.  Steinbrink has a hard time watching through tears.  Brendan is silent, set. Doesn't know how to feel, yet. It's a  nightmare come true. It can't really be happening. All of  them, gone...  EXT. THE CARAVAN - DAY  THE CARAVAN -- passes residents lining the roads, news  helicopters whirring overhead. The crowds grow, and grow,  fire department trucks lining the road, firemen and women  saluting as they pass.  INT. THE HEARSE - DAY  CLOSE - on the face of a young child that Brendan sees in the  crowd, held by a FATHER, a firefighter in full regalia,  saluting at the vehicles as they pass.  Brendan turns in his seat to watch the father and child.  Loses sight of them as the caravan continues...  142.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 240
    },
    {
      "scene_number": 33,
      "slugline": "INT. MEDICAL EXAMINER’S OFFICE - DAY  Claire is given that band of metal she was so focused on  before -- Caldwell's wedding ring.  It's all she has of him...  DISSOLVE TO:  EXT. MARSH HOME, WEEKS LATER - STABLES  Amanda works with the horses.  We see the emotions under the tough exterior of hers. She  won't allow herself to cry. Not yet.  Maybe not ever...  INT. THE STABLES - DAY  She’s putting her tools away when she knocks something off a  shelf. It hits the barn floor with a WHUMP.  She looks down.  Eric’s homemade saddle.  She reaches down to pick it up, shaking her head. He made a  saddle from scratch and it’s a beauty. How did he do that?  She can’t seem to lift it. Her arms won’t comply.  Instead, she sits and puts the saddle into her lap. One hand  on the leather. Puts her back against the barn wall.  She stays that way. She won’t move. Can’t.  EXT. CANYON NEAR YARNELL - DAY  The canyon-valley where the 19 men died is a blackened  crater. Boulders have split in two from the heat. The  landscape looks like Hiroshima. Everything is gone...  CLOSING IN -- we see that THERE IS THE REMNANT of one of the  19 Granite Mountain Hotshots' deployment shelters, fluttering  in the breeze. A scrap. So small someone missed it.  Thin and useless in the face of the unstoppable wildfire.  THE WIND - picks up the scrap and sends it tumbling over the  blackened earth. An updraft sends it skyward...  143.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 256
    },
    {
      "scene_number": 34,
      "slugline": "EXT. ALLIGATOR JUNIPER - DAY  CLOSE -- on the ALLIGATOR JUNIPER the men saved.  Someone has placed flowers here. A chain for a chainsaw is  draped over a limb. Hotshot boots lie at the foot of the  tree. A homemade sign,   “We miss you, Daddy!”  Brendan comes to the tree.  Doesn't know why. But he’s here.  He sits, back to the tree. Breathes. He's alive. Doesn't know  why he survived and the others didn't.  But here he is...  ...He puts a can of Kodiak at the base of the tree.  The sun falls on his face. He closes his eyes and just rests  here.  This is a good place to rest.  A FINAL IMAGE -- comes on-screen.  THE PHOTO - of the team before the fire. On top of one  another’s backs in a pyramid, smiles of accomplishment from  ear to ear. Grinning back at the camera, lined up before the  majestic tree they saved...  FADE OUT...  144.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 159
    }
  ]
}