{
  "slug": "origin-2023",
  "title": "origin",
  "genre": "drama",
  "format": "film",
  "scenes_count": 14,
  "characters_count": 0,
  "characters": [],
  "total_words": 25207,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT/EXT. CONVENIENCE STORE - NIGHT We glide above a city on the edge of sleep. Amidst the treetops, a streetlamp invades the darkness. We drop through the lace of branches to land at a simple convenience store. A fresh-faced TEENAGE BOY strolls by. He’s Black with close- cropped hair and a bright smile. He flashes it while talking on a cell to his GIRLFRIEND. They chat about nothing, really. TEENAGE BOY (laughing) I know you wanna say it. Go ‘head. GIRLFRIEND (O.S.) (giggling) I ain’t gotta say it. TEENAGE BOY But you wanna. I know. Go ‘head. GIRLFRIEND I told you so. TEENAGE BOY Always with the ‘I told you so.’  You did. You right. This time. He enters the store with a grin as she banters back. CUT TO: Handing the CLERK a five-dollar bill, he gathers his change, along with a watermelon iced tea and bag of Skittles. Before he exits the store, he notices DRIZZLE outside. He puts his hoodie up, heading into the night. We watch him until he disappears into the darkness. A title appears:  ORIGIN  EXT. RUBY’S HOUSE - AFTERNOON The radio is tuned to NPR as Isabel balances a PINK BAKERY BOX on her lap in the car. Next to her is BRETT HAMILTON, white, handsome and attentive. He pulls into the driveway of a well-loved home. The curtains of the house are closed. A hint of worry on both of their faces. ISABEL Not up yet.",
      "characters": [],
      "action_text": "BRETT Later than last week. They exit the car. Brett heads to the curb to pull in the trash bins. Isabel goes to the front door and uses her key. INT. RUBY'S HOUSE - CONTINUOUS Isabel makes her way through the place by heart. In the kitchen, she places the bakery box on the counter and starts a pot of coffee. In the laundry room, she unloads the dryer. Finally, she comes to her intended destination with a basket of clothes under her arm. She listens at the door, then taps lightly with her fingertips. ISABEL Afternoon... Mama? No answer. She opens the door, then respectfully peeks in. An older woman, RUBY WILKERSON, is asleep. Maybe. ISABEL (CONT’D) Are you really sleeping or kinda? RUBY (beat) Kinda. Isabel nods knowingly, then sits on the bed with the laundry. Ruby turns over. A beauty in her early 80s. Sleepy, but spry. RUBY (CONT’D) Sweetie with you? ISABEL He’s bringing the trash round back. RUBY Ah, yeah. Garbage day. Everything in its right place. (regarding the laundry) He saw these bras like this? ISABEL No, ma’am. Of course not. Ruby struggles to sit up and turn. Isabel helps her by straightening her paralyzed legs, propping a pillow. RUBY Where you off to this time? 2. ISABEL Birmingham tomorrow. RUBY England or Alabama? ISABEL Alabama. A quick turnaround trip. RUBY Can’t keep track. Stay careful. They fold the clothes. Inside the basket are ISABEL’S KEYS. Ruby hands them to her without a second thought. ISABEL Thanks. After this, I’m taking it easy on work trips for a while. RUBY I think that’s silly. ISABEL I know you do. RUBY What’ll your book people say? I don’t want them to let you go. ISABEL They’re not letting me go, Mama. RUBY You don’t know that. All you control is you. Those folks’ll do what they want, how they want. ISABEL I’ve been on tour for ten months. It’s okay to take a break. RUBY You don’t have to though. ISABEL I want to. I want to control my calendar, my time. I want to. RUBY You know, your Father and I used to wonder how we got a chil",
      "dialogue_count": 0,
      "word_count": 1523
    },
    {
      "scene_number": 2,
      "slugline": "EXT. GERMAN SHIPYARD FACTORY - 1936 - MORNING A sea of flannel jackets and wool coats lurches forward under gray skies. But though clouds obscure the sun, an eager energy moves among the WHITE MEN who lean against the cold. ISABEL (V.O.) Shipyard workers at Blohm and Voss gather for a ceremony celebrating the company’s new 295-foot vessel. The hundred or so men settle in. Listening intently. And then, all at once, they RAISE their right arms rigidly. ISABEL (V.O.) Adopted by the Nazis, a heil salute was mandatory for German citizens. But if you look closely, you’ll find someone who defied this. Amidst a wave of outstretched allegiance to the Third Reich, clouds glide away to shine sunlight on the face of ONE MAN. ISABEL (V.O.) His name is believed to be August Landmesser. He had joined the Nazi Party two years before this day. But in that time, August fell in love with a woman unlike any he’d ever met... EXT. WORKING CLASS STREET - 1934 - DAY Leaning on a light post, AUGUST’s face is lined with worry. ISABEL (V.O.) Irma Eckler. A Jewish woman. IRMA rounds the corner with a shopping bag. Her eyes sparkle with intelligence and integrity. She spots him, beams. He smiles back, adoringly. He goes to her. Both speak German. IRMA An unexpected treat. You’re early. AUGUST I’m a surprise. IRMA That you are. A handsome one. He takes the bag from her. She touches his face, unaware of the storm in his mind. He leans down and kisses her sweetly. 8.",
      "characters": [],
      "action_text": "ISABEL (V.O.) Although a member of the dominant class, August saw in Irma what others like him chose not to see. Her humanity. Her beauty. Her love. EXT. HAMBURG, GERMANY - MORNING Back at the shipyard. CLOSE on August, defiant. ISABEL (V.O.) So, on this day, he folded his arms rather than salute a regime that deemed that love illegal. On this day, he was brave. August, unintimidated, stands on his conviction. The camera PULLS BACK to find that the shipyard scene is - INT. MASSIVE LECTURE HALL - 2012 - NIGHT - an image projected on a LARGE SCREEN in a full auditorium. In a perfectly tailored dress, Isabel is centerstage at the podium. She speaks with conviction and control, exuding both humility and authority all at once. From her cadence and manner, it’s clear that she’s made this speech many times. Yet, she refers to TYPED NOTE CARDS. Precise in her delivery. ISABEL He couldn’t have been the only one who felt that something tragic was happening. So, why was he the only one among those men who didn’t go along that day? How would history have changed if more had resisted? Attendees listen in rapt attention. ISABEL (CONT’D) Perhaps we can reflect on what it would mean to be him today. How can we too be brave? Right now. Today. I leave you with that. Thank you. The speech she’s clearly given many times is met with robust applause as the screen switches from the photo to: “Pulitzer Prize-winning author Isabel Wilkerson.” 9. INT. BACKSTAGE/GREEN ROOM - MOMENTS LATER Isabel makes her way through other SPEAKERS, SCHOLARS and CONFERENCE PERSONNEL backstage. She passes AMARI SELVAN, a dashing Black newspaper editor, who she knows well. Surprised, they greet one another warmly. ISABEL You’re speaking? I didn’t know. AMARI One of our reporters is. I’m cheerleading. You were solid up there. Nice work. ISABEL You know I write better than I lecture. AMARI You write better than most people do anything. Amari signals to WAITING COLLEAGUES that he’ll join in a few. AMARI (CONT’D) I",
      "dialogue_count": 0,
      "word_count": 842
    },
    {
      "scene_number": 3,
      "slugline": "INT. CUSTOMER SERVICE CUBICLE - DAY A quartet of cubicles. Inside of one is MARION WILKERSON, a bright-eyed woman in the midst of a spirited conversation. MARION I know keeping our elders at home is supposed to be the noble thing and all. But there’s something to her being independent while she can be. Doing things her own way, in her own time, for as long as she can. That’s important. It is. INT. ISABEL’S HOUSE - DAY Isabel talks to her cousin on SPEAKERPHONE as she calls to her dogs, Chi-Chi and Sophie, then attaches their leashes. ISABEL I agree with that. (beat) Where are my keys? Shoot. MARION (V.O.) And, she’s got a dining hall for socializing with other folks her age. Not sitting up in the house withering away so you can say: ‘I kept Momma at home.’ ISABEL She’s the only Black person there. INTERCUT ISABEL/MARION as Isabel searches for her keys. MARION Aunt Ruby’s been around white folks all her life. If anybody knows how to maneuver, it’s your Mom. “My husband was a Tuskegee Airman.” She knows what to do. Your Daddy was like that, too. Talk to anybody. Boy, they were a sight to see, weren’t they? Best dressed in the family. Always dressed to the nines. You get that from them. ISABEL It’s how she taught me. And how her mother taught her. 12.",
      "characters": [],
      "action_text": "MARION You know, make sure to put all those pictures of your parents and the grands in archival paper before you lock everything up at her place. It preserves it better. ISABEL Good thought. I’ll do that. Brett enters the room, her lost keys now found and in hand. ISABEL (CONT’D) (to Brett, relieved) Where were they? BRETT Next to the lamp. Under a scarf. With the ringer off. Gotta keep it on the hook, Belle. MARION Is that Mr. Brett? BRETT Ms. Marion! You good? How’s Teddy? Now with her keys in hand and dogs ready, Isabel wraps it up. ISABEL You two can have your little catch- up another time. We gotta get the babies out before dark. MARION Brett. She’s just jealous of our relationship. Teddy is too. It’s okay though. We know. BRETT What we have is special. MARION That’s right! INT. ISABEL BEDROOM/OFFICE - SAME NIGHT We pan across their bed to find Brett, sleeping restlessly. Lost in thought, Isabel rises and walks through their home, knowing the path in the dark. Into her office. 13. She sits at her desk, only the screen illuminates her face. She reluctantly clicks on an audio file entitled “Martin 911 Dispatch.” EXT. STREETS - NIGHT Seventeen year old TRAYVON MARTIN grins as he continues on his cell to his girlfriend. He strides down one residential street, then another, minding his business. He pops Skittles as a CAR PASSES HIM SLOWLY. He doesn’t pay any mind, crossing the street, closer to his destination. We watch Trayvon, but hear THE CALL being placed to police. MALE VOICE (V.O.) We’ve had some break-ins in my neighborhood, and there’s a real suspicious guy just walking around. This guy looks like he’s up to no good or he’s on drugs or something. Trayvon clocks the car passing again, this time slowing down. We now hear his conversation with his girlfriend on the cell. TRAYVON I think this guy’s following me. Keeps looping around the block. MALE VOICE (V.O.) He’s just walking around the area, looking at all the houses. Trayvon tries to glimpse the driver. Wha",
      "dialogue_count": 0,
      "word_count": 2220
    },
    {
      "scene_number": 4,
      "slugline": "INT/EXT. RUBY’S SENIOR APARTMENT COMPLEX - CONTINUOUS Isabel and Brett cross the parking lot. A quiet tension builds. No words as they walk together - but apart. They climb in the car and drive. She finally looks to him. ISABEL What’s wrong? He drives on, wrestling with his feelings. She waits. BRETT She asked me that... like I was a stranger. Not her son. (beat) She doesn’t think of me like I think of her. ISABEL That’s not true, baby. She loves you. BRETT I know she loves me. That’s not what I’m saying. ISABEL She’s from a different time. She was just trying to sort through her feelings about... BRETT You’re on a hiatus? ISABEL Huh? BRETT You told Amari you’re on a hiatus. (beat) You told me you were going to travel less. Isabel is processing, trying to catch up to this turn in the conversation. BRETT (CONT’D) You never told me you weren’t going to write at all. ISABEL I said I want to focus on her. 22.",
      "characters": [],
      "action_text": "BRETT What’s that got to do with writing? ISABEL She shouldn’t be at that place. She should be home. She moved because she was lonely. I should have spent more time. Daddy would want me to fix this. BRETT Your father wanted you both happy. Sacrificing your work does exactly the opposite. She told you what she wants. This is not it. The conversation is becoming intense. She tries to diffuse. ISABEL (beat) She’s my responsibility. BRETT And you’re mine. (beat) People are asking you to write for a reason. Your voice. The way you think. And you’re zoning out. Hanging out at an old folks’ home all day. Making cups? (beat) What are you doing? ISABEL I’m taking care of someone I love. BRETT This was her choice. Dammit, Isabel! His outburst stuns her. BRETT (CONT’D) Let the woman make her own decisions! You’re hiding. And I don’t get it. ISABEL Hiding from what?! I’m not hiding. He doesn’t respond. Isabel is stunned. Quiet. 23.",
      "dialogue_count": 0,
      "word_count": 338
    },
    {
      "scene_number": 5,
      "slugline": "INT. ISABEL'S HOUSE - A SHORT TIME LATER They enter their home. Separate in all of their movements. Unusual. BRETT I’m gonna have some of that pasta. Want some? ISABEL Yes, please. Save me some. He heads into the kitchen. She heads to the bedroom. INT. ISABEL'S BATHROOM - MOMENTS LATER Isabel ties up her hair, exhausted. She runs hot water, adds bath salts. She reclines in the tub, a table of books nearby. A moment to think, process. She opens a small BIOGRAPHY on BHIMRAO AMBEDKAR and begins to read to unwind. INT. TRAIN STATION - 1913 - NIGHT From inside of a train car, Black passengers with luggage in hand trail behind white passengers who have disembarked and are headed for the exit. Proud Black men known as Pullman Porters cater to the whims of the white customers. The voice of Suraj Yengde, the author, narrates the scenes. SURAJ (V.O.) In the early 1900s, a young Indian graduate student found himself in New York City on a scholarship to Columbia University. Upon his arrival, he immediately recognized the similarities between how African-Americans were treated and the treatment of Indian people like him known as Dalits. OMITTED EXT. NEW YORK STREETS - 1913 - DAY A 24-year old Indian man, BHIMRAO AMBEDKAR, walks down the Harlem street transfixed by his surroundings. All curiosity and wonder. Observing Black joy and community. 24.",
      "characters": [],
      "action_text": "SURAJ (V.O.) Bhimrao Ambedkar’s presence in the United States was a highly unusual endeavor, for a Dalit is also known by some as a so-called Untouchable. Not the lowest caste in India. Not even   below   the lowest caste. They are outcast. Disposable. Despised. Considered untouchable. He saw kindred spirits among Black people in America. Both in the oppression they face and in their survival. INT. AMBEDKAR HOUSE - 1918 - LONDON - DAY In a cozy library room, Ambedkar reads with intensity. SURAJ (V.O.) He then studied in London earning two PhDs and passing the bar before returning to India as a heralded scholar to help draft India’s new constitution. EXT. INDIA SEASIDE - 1925 - DAY Dr. Ambedkar is cheered by Dalit workers upon arrival. SURAJ (V.O.) Ambedkar wielded his pen for his people like a weapon against injustice. He said: “The emancipation of the mind and the soul is a necessary preliminary for the political expansion of the people. Education all must have. Means of defense all must have. These are paramount requirements for self-preservation.” INT. ISABEL’S BATHROOM - CONTINUOUS Isabel drinks in every word. Her eyes jumping from line to line, reacting with nods and murmurs of agreement. SURAJ (V.O.) “Religion, social status and property are all sources of power and authority, which one man has, to control the liberty of another.” 25. She reads a line and sits up. She looks around for a pen, something to mark the passage. SURAJ (V.O.) “The strength of a society depends upon the presence of points of contact, possibilities of interaction between different groups which exist in it. Caste in India divides groups into fixed units that cannot be moved. The destruction of caste does not mean destruction of a physical barrier. It means a notional change.” She dog ears the page. Then takes a bit of wax from the nearby candle and drips it gently on the word... “CASTE.” INT. ISABEL AND BRETT’S BATHROOM/BEDROOM - LATER She closes the book, eager to share her excitement w",
      "dialogue_count": 0,
      "word_count": 719
    },
    {
      "scene_number": 6,
      "slugline": "INT. ISABEL AND BRETT’S BEDROOM - DREAM Surrounded by darkness, Isabel lies in a LARGE PILE OF LEAVES with her eyes closed. She opens them slowly to find herself facing Brett. His eyes are closed. So, she closes hers again. EXT. ISABEL'S FOYER - DAY Mrs. Copeland is in the foyer in tears, baked goods in hand. Marion receives the package. INT. RUBY’S SENIOR APARTMENT - DAY The TV flickers in Ruby’s dark apartment, making shapes across Isabel’s expressionless face. She is on the couch next to her mother, both covered in a crocheted blanket as Donald Trump demands to see President Obama’s birth certificate. Ruby looks to Isabel, recognizing her daughter’s pain. RUBY Your father was supposed to be here too. They’re supposed to be here. Teary, she holds her daughter’s hand. Isabel can’t move. INT. ISABEL'S OFFICE - DAY INTERCUT CALL with Isabel’s editor, Kate, in her office. MARION Isabel Wilkerson’s office. KATE Hello. Hi. This is Kate. I’m Isabel’s editor and I... MARION I know your name. Hi, Kate. This is her cousin. Marion. KATE Marion, hi. My condolences for your family’s losses. I don’t have the words. Unfathomable. Unthinkable. 27.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 195
    },
    {
      "scene_number": 7,
      "slugline": "INT. ISABEL AND BRETT’S BEDROOM - DREAM Eyes closed, Isabel is still in the leaves in her bedroom. She opens her eyes to find Brett still there, eyes closed. And now, her mother Ruby in front of him, with closed eyes. INT. HOSPICE UNIT - DAY Ruby is bedridden, on oxygen, under a crocheted blanket. Isabel sits on the side of the bed, applying lotion to her mother’s hands. Lip balm to her lips. Ruby doesn’t respond. KATE (V.O.) Who can withstand this? The two closest people to you in a year? It’s just... I don’t know how she’s managing. How is she? INT. ISABEL'S BEDROOM - DAY The blinds are drawn. It’s dark. Marion looks through the door to find Isabel in bed, wrapped in Ruby’s crocheted blanket. Huddled into herself in the fetal position, Isabel’s hand is over her face, shutting out the world. Tears brim Marion’s eyes. She carefully climbs onto the bed, settling herself closely near her cousin. She wraps her arm around Isabel, then draws her in. Isabel lets herself sink into the tenderness, the sisterhood. Marion holds on tight and close, trying with everything she has to protect her loved one from the darkness. INT. ISABEL AND BRETT’S BEDROOM - DREAM In her mind, Isabel is still on the floor in the leaves. Eyes closed. She opens them to find Ruby and Brett, both looking back at her now. She gazes upon them, not wanting to blink. Not wanting to lose them. Ruby reaches out, placing her hand on her daughter’s face. Isabel touches her hand. Brett looks on with love. She closes her eyes. BRETT Breathe, Belle. When Isabel reopens her eyes, they are gone. She rises from the leaves, on her feet, in the room, alone. 28.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 296
    },
    {
      "scene_number": 8,
      "slugline": "INT/EXT. ISABEL'S HOUSE - DAY Isabel sits on the couch, still. She carefully places Brett’s watch on her wrist and her mother’s wedding band on her finger. Near the front door, Isabel puts on a sweater. She calls to her dogs, puts on leashes and takes her KEYS off of a hook with a sign that reads: “Keys.” She ventures outside for what feels like the first time in a while. She crosses the lawn, blanketed in leaves, and takes the same path that she and Brett would always take. And like clockwork, she sees Mrs. Copeland, who approaches. MRS. COPELAND Isabel. Hi. I haven’t seen you out. How are you? I mean, you look well. Do you need anything? The woman is nervous. Isabel senses it and puts her at ease. ISABEL I’m okay. Thanks for asking. MRS. COPELAND I brought a basket over when I heard. I hope you got it. She didn’t. ISABEL I did. Thank you. MRS. COPELAND He was a wonderful man. And you two made the loveliest couple. Both so attractive and accomplished. A beautiful, unlikely pair. May his memory be a blessing. I’m so sorry. Mrs. Copeland continues to talk. But Isabel is stuck. She can’t hear the words. She’s upset, but tries not to show it. EXT. RUBY'S HOUSE - DAY Isabel turns into the driveway under the canopy of trees. She exits the car to find green landscape bins at the curb. It’s her job now. She goes to retrieve them. 29.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 252
    },
    {
      "scene_number": 9,
      "slugline": "INT. RUBY’S HOUSE/PHARMACY - DAY In her mother’s living room, she opens drapery, allowing the sun in. The reflection of a tree outside duplicates itself on the living room wall as if it’s growing there. In the dining room, she removes a package from her shoulder bag. A bundle of archival paper like Marion instructed. JUMP CUTS as she takes frames from the walls and pictures from the frames. Carefully wrapping them in the special paper and placing the fragile images in an acid-resistant album. Her cell rings. It’s MARION. She’s entering a PHARMACY. INTERCUT. MARION Hey. You made it in okay? ISABEL Yep. I’m here. How’re you? Marion enters the megastore’s pharmacy. She waits in line. MARION (gently) Tell me how you are. How does it feel to be with all her things? ISABEL I’m here, Marion. That’s all I am. (softening) I walked the babies. MARION Good! Good. How’d that feel? ISABEL I had a meltdown after. Noticing a SLIGHT PLASTER WELT in the kitchen, Isabel moves a chair, climbs up, touching the bubble with a knife. MARION You went the way you two’d walk. ISABEL There’s no other way. Marion mouths her name to the pharmacist to grab her medication and pays with her credit card. MARION Right. 30.",
      "characters": [],
      "action_text": "ISABEL I ran into my neighbor. She said something so disrespectful. MARION Girl, what? ISABEL She called us an unlikely couple. Isabel waits for a response. Marion waits for the bad part. ISABEL (CONT’D) Me and Brett. MARION (um...) That hit a nerve for you? ISABEL Hell yeah, it did. MARION Why? Isabel can’t believe her ears. ISABEL To say that we were improbable? “Unlikely” as in unbelievable. MARION She was just being nice, I think. That’s probably not what she meant. ISABEL She meant that we didn’t match. But somehow we ended up together. Like it’s this unbelievable phenomenon. MARION You two were from different places, backgrounds. It’s kind of a miracle your paths crossed like they did, that you got together. Isn’t it? Isabel is in disbelief, holding back how hurt she is. Marion is lost as to what the problem is. But stands down. MARION (CONT’D) Listen, no one knows what goes on inside a relationship. And we shouldn’t talk about things we don’t know. My mistake. 31. ISABEL I’ve got to go and get this done. MARION You don’t have to pack everything up now. I can come next weekend and help. Take it slow. ISABEL I’ve got to get this house packed before I start back to work. MARION You’re starting back working? ISABEL Of course. What am I supposed to do? How am I supposed to live? MARION You’ve got money saved. Why not... Isabel sighs, frustrated. Marion’s swimming against the tide. MARION (CONT’D) ... What are you working on? When do you have to start? ISABEL I’m already behind on things I should be doing. I gotta go, okay? MARION Okay. And with that, the line disconnects. Off Marion, worried. EXT. AIRPORT - DAY The same spot where Brett dropped Isabel off and kissed her goodbye. Now, she’s alone, dropped by a TOWNCAR DRIVER. She grabs her bag, tips, then looks up to the sky. CLOSE on a clear, cloudless sky. No shapes. No Little Leaguers in pools. Clearly thinking of her mother, she enters the terminal. We watch her - until we can’t anymore. INT. NEW YORK PUBLIC LI",
      "dialogue_count": 0,
      "word_count": 6066
    },
    {
      "scene_number": 10,
      "slugline": "EXT. RUBY'S HOUSE - DAY Neighbors on their lawn peer with curiosity. A jogger snoops mid-stride. Dogs bark in protest. Isabel speaks with an ARBORIST beneath the magnificent oak tree that has adorned Ruby’s house with beauty for ten decades. ARBORIST The heartwood’s infected, but it ain’t spread. I’d take it down now, if I was you. ISABEL If it hasn’t spread, then it can be saved, right? ARBORIST I ain’t a roof guy, but yours ain’t safe. Got water coming in. If water’s getting in, other things get in. Termites. Mold. What not. ISABEL Yes. Of course. ARBORIST It’s bad up there. Exposed holes to the insulation, whole nine. My guys can fix it with the tree removal. ISABEL Oh, but... I’m not sure yet. My mother loved that tree. I don’t want to cut it down. ARBORIST You need it done. (impatient beat) Lady, I can fix this or I can leave. What do you want? Isabel freezes. He’s trying to strong-arm her. She’s upset. And then, we hear a CAR DOOR BANG SHUT across the street. Isabel turns to find... EXT. ISABEL'S HOUSE - EARLY EVENING - FLASHBACK Brett waves to her from across the street. BRETT Mornin’. 58.",
      "characters": [],
      "action_text": "ISABEL Hi. Good morning. He observes a PEST CONTROL WORKER working on a BUG NEST under the eaves of her house. BRETT Looks like they decided to move in. Even built their own guesthouse. They both squint at the bad joke. The pest man climbs down from a ladder with the DRIPPING HORNET’S NEST in his gloved hands, heading to the back of Isabel’s house. PEST CONTROL Puttin’ it in the backyard to empty out. Have your gardener get rid of it in a day or two. ISABEL Wait, sir. Sir? I... I’d rather not have it in the yard. I have dogs. That spray can’t be good for them. He keeps moving towards the back gate. PEST CONTROL It’s fine. It won’t hurt ‘em. Isabel blinks back her frustration. Doesn’t push or protest. Brett’s been watching. He crosses the street toward her. BRETT (quietly to her) Can I help? She thinks for a second, then nods. He steps forward. BRETT (CONT’D) Hey. She said she doesn’t want it back there. You didn’t hear her? PEST CONTROL I heard her, but I can’t take it with me today. My bins are full. BRETT You gotta figure something out then, don’t you? Or did you just remove that for free? If it’s your treat, then you can drop it right there. If you wanna get paid, buddy, you gotta finish the job. 59. Pest Control looks to Isabel, then back to Brett. He goes to his truck in the driveway and pushes the hive in a bin. Isabel and Brett watch. Standing on the curb, together. BRETT (CONT’D) Did I just mansplain? ISABEL You asked for permission. If you hadn’t... BRETT I’d be in white savior mode. ISABEL (surprised) What do you know about that? BRETT I try to break bad habits. ISABEL (beat) You asked for permission. Let’s call it being neighborly. (then) I haven’t seen your Mom and Dad on their walks much. How are they? BRETT They’re slowing down. Talking about moving to Florida. But, they’re okay. Hanging in, ya know? ISABEL The same with my mother. I get it. BRETT My Mom made me promise to come by. She always wants to see me on my birthday. ISABEL Wait? Is today your b",
      "dialogue_count": 0,
      "word_count": 763
    },
    {
      "scene_number": 11,
      "slugline": "EXT. CITY PARK - UNITED STATES - DAY If you’ve never been to a Black family reunion, feast your eyes on the food, the fun and the festivities. FRANKIE BEVERLY AND MAZE’s “Happy Feelings” plays on a large speaker that shimmies with sound. Old folks and young-uns and everyone in between dance and take delight in each other. Several BBQs are on full blast. A spades game at one table. Uno at another. Loud boasts and brags can be heard from both. Standing near the BBQ pit and the long serving table are Marion and Isabel working on replenishing the food. Marion moves around like a pro, but this time with a CANE. MARION An arborist? What the hell is that? ISABEL It’s a tree doctor. MARION Is it that serious? Lord. What’s it all costing? Two twentysomethings, PATRICE and ANDRE, saunter through. MARION (CONT’D) What? ANDRE Respectfully, we - and everybody - are wondering about an ETA? Marion looks at Isabel, deadpan. Isabel muffles a laugh. MARION The ETA is when I say it’s ready. ANDRE Yes, ma’am. (then) Aunt Isabel, how you been? PATRICE Yeah, how are you holding up? The sympathy they offer changes the tone. ISABEL All’s well. You both good? 62.",
      "characters": [],
      "action_text": "PATRICE Oh yeah. Everything’s good. I was going to ask if you knew one of my professors. Dr. Montgomery. I think he studies the things you do. ISABEL Doesn’t ring a bell, but I haven’t been keeping up like I used to. PATRICE Of course. Yeah. Well, he’s a smart man. A nice older gentleman. I thought you might like to meet him. Handsome for his age. Black. This catches Isabel off-guard. Marion steps in. MARION Here, take this to the Uno table. Let folks know we’ll start in ten. Patrice and Andre grab the bag of chips and head off. MARION (CONT’D) They mean well. ISABEL Brett always looked forward to these. Only you and Mama really let him in. MARION People weren’t mean. ISABEL No, but there was always   that . What’s she doing with him when she could have a good brother? I even thought it at one point, I guess. (beat) The containers we’re in. Maybe the label on your container says Black woman, maybe it says white man, maybe it says Muslim or immigrant or Asian, whatever it says. We assume that because we read the label, we know what’s inside. Trust the label, put the container on the shelf and that’s it. That’s what the book is about in a way. MARION About interracial relationships? 63. ISABEL No. I’m looking at caste, the phenomenon of setting one group of people over another and the consequences to the victims and presumed beneficiaries. Marion looks back at her with a blank stare. MARION Can you repeat that in English? Pulitzer Prize-less. (a challenge) If you can. ISABEL Of course, I can. MARION Then do it. Please. Make it plain. The Nazi stuff got me all twisted around. How’s that in the same book about Brett? I don’t get it. ISABEL (thinking, then new idea) Was slavery a system of torture and terrorism that Europeans used to profit on the labor of Black people who they considered inferior? MARION Yes. Hell, yeah, it was. Isabel shakes her head no. MARION (CONT’D) Yes, it was. ISABEL They made it up, Marion. Race is not real. It’s pseudoscientific nonsense that t",
      "dialogue_count": 0,
      "word_count": 4670
    },
    {
      "scene_number": 12,
      "slugline": "INT. MARION’S HOUSE - SAME TIME Teddy stands at the window on the phone with Isabel. Then, walks to the bed revealing Marion. Her state is alarming. Completely still, eyes closed, on a breathing machine. INTERCUT ISABEL IN INDIA and MARION’S HOME. TEDDY (into the phone) I’ll hold up the phone. He touches Marion’s shoulder gently. TEDDY (CONT’D) (to Marion) Baby. She doesn’t rouse. Just labored breathing through the machine. He puts the phone on SPEAKER. TEDDY (CONT’D) You’re on speaker. She’s... she’s not responding to folks. ISABEL I understand. CLOSE on Isabel. Trying to get her bearings. Control her emotions, which are overflowing. She emerges from the tunnel into the stunning architectural surroundings. But she looks to the sky. To the clouds over this majestic place. She focuses on ONE CLOUD. ISABEL (CONT’D) (then, softly) Marion. It’s Isabel. I believe that you can hear me. I’m calling you now to say goodbye. Teddy drops his head, covers his mouth with one hand and holds the phone with the other. ISABEL (CONT’D) I want you to know that you have meant so much to me. I will never forget our talks. I've remembered everything you said. Everything. From when we were kids to the last time I heard your voice. I promise you...   (MORE) 82.",
      "characters": [],
      "action_text": "I’ll never forget you for as long as I’m still here. You will walk and live in me. I’ll never forget you. Teddy takes Marion’s hand, overcome. Isabel continues. Focusing on the cloud that is taking shape. ISABEL (CONT’D) My father and your father were so close. They loved each other so much, didn’t they? They passed it on to us. We were so lucky. Watch out for me please. Cover me, okay? You’ll have that power soon. I won’t see you. But you’ll see me. There’s more to life than what we can see. You’re going to experience it all. Marion’s face relaxes in a way that feels like peace. Her head moves ever so slightly. Teddy kisses her cheek. WIDE on Isabel. She drops to her knees. INT. ISABEL'S HOUSE - DAY The door opens to reveal Isabel with her luggage. She steps inside, sets down her bags. Then, she stands there. Still. There will be no hug from Brett. There will be no visit to Ruby. There will be no call from Marion. We feel their absence as we watch her. But something has changed, she has a resolve. Something internal, intimate. A light within her guides her forward. She removes her coat. Underneath, she wears the scarf she bought for Marion. She loops it around her neck. She’s ready to WRITE THIS BOOK. She steps PAST THE CAMERA. INT. ISABEL'S OFFICE - MULTIPLE DAYS Isabel rolls a suitcase into the room and kneels to open it. She unzips the suitcase to reveal a BEVY of BOOKS. She removes them like treasures, stopping at one by Ambedkar. Over a montage, we hear her voice in her head. Writing. Isabel reaches for a marker and makes notes on a LARGE WHITEBOARD near her desk entitled   “The Pillars of Caste.”  ISABEL (CONT’D) 83. ISABEL (V.O.) Dr. Ambedkar wrote: Caste is an artificial chopping up of the population into fixed units. She writes the words: Pillar #1:   “Endogamy: Control of Marriage and Mating.”  ISABEL (V.O.) Each unit is prevented from fusing into another through the custom called endogamy. In showing how endogamy is maintained, we can prove the genesis a",
      "dialogue_count": 0,
      "word_count": 965
    },
    {
      "scene_number": 13,
      "slugline": "EXT. MISSISSIPPI DELTA COTTON FIELD - DAY The scene depicted on the cover of a book that she took from her home office shelf long ago: Three Black people in a 1930s pick-up truck. The TRUCK zooms by as the three people in the truck watch a conversation happening on the side of the dirt road. Those having the conversation seem uneasy with being watched. A WHITE MAN, Burleigh Gardner and a WHITE WOMAN, Mary Gardner are clearly uncomfortable with the passersby. From behind, a BLACK MAN tips his straw hat to the people in the truck. ISABEL (V.O.) That scholar was Dr. Allison Davis. (beat) And he did the majority of his ground-breaking work undercover. The CAMERA PANS from Burleigh and Mary to reveal Allison Davis, standing next to his wife, Elizabeth. The couple we followed in Berlin during the Nazi book burning. They look very different from the dapper pair we saw in Germany. Allison is in overalls while Elizabeth wears a simple handmade sundress. ALLISON (to Burleigh and Mary) They’re okay. MARY You sure? There’s no telling what this town’ll do if they find out. ELIZABETH We all know what they’d do. A beat of trepidation, then... ALLISON Let’s stay on topic. There’s nothing we can do about it now. And we have quite a bit to review. They nod and listen to him intently. He’s clearly the boss. ELIZABETH Well, we finally got proof that that one land owner, Bailey, has been whipping sharecroppers. (MORE) 86.",
      "characters": [],
      "action_text": "A tenant farmer named Bo told me Bailey said if he didn’t stop ‘acting so big,’ the next time it’d be “a bullet or a rope.” Mary shakes her head in disgust. MARY Bailey’s wife told me... (reading from her notes) ‘That’s the way to manage ‘em when they get   too uppity .’ Allison nods with encouragement. BURLEIGH We heard about a tenant farmer next county over who was beaten so badly by a store merchant, he can’t bring in a crop. We’re heading over there tomorrow to the store. ALLISON Do we know what sparked that? MARY The Negro MAN asked for a receipt. BURLEIGH Beat him right there in the store. The quartet stands in a field far from the town. As they speak, they look up and down the road, constantly monitoring their surroundings with an air of apprehension. ISABEL (V.O.) In the fall of 1933, Alison Davis and his wife Elizabeth cut short their advanced studies at the University of Berlin and fled Germany when Hitler took power. They’d seen the Nazis burn books and jail teachers, and this gave Dr. Davis new insight into the nature of hate. It inspired him to study the   process   of injustice. The team finish their meeting and head to their cars. ISABEL (V.O.) Davis was a young anthropologist with two degrees from Harvard University and a wealth of experience abroad. ELIZABETH (CONT'D) (MORE) 87. But, once in Mississippi, he had to conceal all of that to survive. One slip-up, one breach of the social order, could cost them all their lives. Inside the car, Allison adjusts the GUN tucked into the back of his belt. Elizabeth glances down at it for a moment as he adjusts it to drive, satisfied that they have it. ISABEL (V.O.) And this was exactly what they were doing in Natchez, Mississippi: breaching the social order to study the social hierarchy of the South. A mission that would render them undercover investigators in order to fit into the community. The other half of their team was... Burleigh and Mary Gardner start their car and make a U-turn. ISABEL (V.O.) ... a wh",
      "dialogue_count": 0,
      "word_count": 2391
    },
    {
      "scene_number": 14,
      "slugline": "EXT. NATIONAL MEMORIAL FOR PEACE AND JUSTICE - DAY Isabel stands amidst a majestic memorial which outlines the crimes for which Black people were lynched.  Arthur St. Clair, a minister, was lynched in Hernando County, Florida, in 1877 for performing the wedding of a black man and white woman. David Walker, his wife, and their four children were lynched in Hickman, Kentucky, in 1908 after Mr. Walker was accused of using inappropriate language with a white woman. Lacy Mitchell was lynched in Thomasville, Georgia, in 1930 for testifying against a white man accused of raping a black woman.  Isabel walks within a pavilion of more than 800 6-foot-tall steel beams suspended from above. Each is inscribed with the name of a state and a county where an African-American was lynched. As she walks through, the beams hang high and higher, conjuring the sensational of a body being strung up, rising from the ground by rope. ISABEL (V.O.) An unknowable number of lives were lost due to endogamy, the defining pillar of caste. It triggered the most publicized cases of lynchings in America. A protocol strictly enforced against Black men and white women. While white men kept full and flagrant access to Black women, whatever their age or marital status. In this way, the dominant gender of the dominant caste, in addition to controlling the livelihood and lives of everyone “beneath” them, also eliminated the competition for its own women and controlled who had access to whom for romantic relationships and reproduction. Isabel touches Brett’s watch as she stands beneath the ascending steel structures. INT. RUBY'S HOUSE - ANOTHER DAY Books and files are scattered across the dining room table. A white board with various pillars of caste listed, crossed through and circled, commands the middle of the living room. Isabel is typing intensely when there is a KNOCK at the door. 96.",
      "characters": [],
      "action_text": "She opens it to find a PLUMBER in uniform. A plumber with a Trump hat on. He’s surprised to see her. She’s shocked by the hat. But of course, she covers. INT. RUBY’S BASEMENT - CONTINUOUS They descend the stairs to the basement. She leads. They both step into about two inches of water. She goes to move things and make room for him to inspect the problem. Her mother’s portable wheelchair. A lampshade. Stacks of her father’s engineering books. An old bucket. ISABEL (to the plumber) There had been three or four inches of water, but the HVAC guy helped get the sump pump restarted to drain most of the water out. (off his silence) This has never happened before. She begins sweeping water as he looks down at the wet floor. ISABEL (CONT’D) I hardly ever come into the basement. We had that drought, so I didn’t think about water in the basement. My husband was the one who came down here. He was the one who checked the filter on the furnace, checked the fuse box. He died last year. He just nods with disinterest, then digs into his tool bag. PLUMBER Uh-huh. He steps over a few boxes, knocking a wreath to the wet floor and not bothering to pick it up. Isabel observes this with frustration, but keeps sweeping - as is her way. He finally points to the sink. PLUMBER (CONT’D) That’s where the water’s coming in. ISABEL (with subtle disagreement) But the sink’s never overflowed before. Maybe there’s a drain somewhere. Maybe it’s clogged. 97. She begins to move boxes, feeling alone and upset. At his inaction. At his lack of empathy. At his hat. At everything. PLUMBER Probably the pump needs clearing out. I’ll write an estimate. Why was he not looking to fix it? Wasn’t that what he was here for? She’s not upset. She’s sad. As if humanity has failed her. We watch her watching him write an estimate. And then, almost involuntarily... ISABEL My mother just died a few months ago. Is your mother still alive? PLUMBER (caught off-guard) No, no, she’s not. Died in 1991. Fifty-two years old. ISAB",
      "dialogue_count": 0,
      "word_count": 3967
    }
  ]
}