{
  "slug": "ouija-2014",
  "title": "ouija",
  "genre": "drama",
  "format": "film",
  "scenes_count": 12,
  "characters_count": 2,
  "characters": [
    "LAINE",
    "PETE"
  ],
  "total_words": 22096,
  "total_dialogue": 2,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. DEBBIE’S HOUSE - DOWNSTAIRS - DAY WITH LAINE.   Standing among the mourners who are gathered in the house.   Adults.   Other high school friends.   A few teachers... Mr. Satlof among them.   Trevor and Isabelle are here. Laine moves through the gathering.   Voices hushed.   Snippets of dialogue: MOURNERS (VARIOUS) ...and that Carol had to find her like that... in the closet.   Just horrible... makes no sense. They’re packed and coming to stay with me... can’t be in this house another night... Laine hovers, glances at a vintage ANNIVERSARY CLOCK.   Small crack in the glass dome.   Hands frozen in time.   Hasn’t worked in years. Beat... then over at the stairs she sees a GUY standing there holding flowers.   Student.   Strange.   Thrift store suit and tie.   He doesn’t seem to know anyone else here.   He’s just standing there.   Glancing up the stairs... Laine hears crying.   Sees Debbie’s PARENTS sitting across the house, being comforted by friends.   THE MOTHER, sobbing.  Laine turns back... and now that GUY at the bottom of the stairs is gone.   His flowers left behind on the foyer table. INT. DEBBIE’S ROOM - DAY Upstairs.   Laine pushes open a door into Debbie’s bedroom. She steps inside and glances around, as if trying to understand Debbie’s sudden death. The room is decorated in an eclectic style.   Evidence of Debbie’s life in high school theatre.   Framed posters and photos of her plays and performances.   But the most prominent feature in the room is a MURAL OF A TREE, silhouette style. Painted branches sweeping across the wall. It’s familiar.   We’ve been in this room before... Laine casts a glance to the closet.   ! The door is slightly open.   An unsettling crack of darkness within.   Laine reaches out and pushes it closed. Laine takes a breath.   ! She steps to a BULLETIN BOARD, covered in mementos and photos.   Almost all   of the pictures are of Debbie and Laine.   Through the years.   Birthday parties. Camping trips.   School dances.   Arms around each other.  7.",
      "characters": [],
      "action_text": "A faint CREAK.   Laine looks over... and the closet door is again slightly open.   She stares... unaware that a FIGURE is now right behind her. MRS. GALARDI (O.S.) You were everything to her. Laine spins and sees Debbie’s MOTHER standing there.   ! The woman’s eyes wild with grief. !  LAINE Mrs. G... (devastating beat) I can’t believe she’s gone. Laine hugs Debbie’s mom.   ! Holds her tight in the silence. And then Mrs. Galardi pulls back, looks at Laine. MRS. GALARDI Do you understand this, Laine?   Why would my baby do this to herself?   !  Tears run down Laine’s cheeks.   ! All of this simply too much. LAINE I don’t know. !  Mrs. Galardi steps away... glances around.   ! Being in this room, the despair is so immense. !  Mrs. Galardi starts collecting some of her daughter’s possessions and putting them in a box.   ! A bracelet.   ! An old Flip camera.   Pulling photos from the bulletin board. Laine watches her with concern, not understanding. LAINE (CONT’D) Mrs. G.... MRS. GALARDI She’d want you to have these.   This way a part of her is always with you... Mrs. Galardi hands Laine the box of mementos. !  MRS. GALARDI (CONT’D) Always remember her. Laine nods.   ! Her heart breaking. EXT. LAINE’S HOUSE - NIGHT A very similar two-story style as Debbie’s house.   ! Same neighborhood.   The sudden SOUND OF GIRLS LAUGHING takes us --  8. FLIP CAMERA VIDEO SCREEN.   Recent footage.   Laine and Debbie trying on dresses in a small store changing room.   Laughing. Posing in the mirror.   Hamming it up for the camera. DEBBIE That’s the one.   Very hot.   Lemme see that booty shake! SALESPERSON (O.S.) Ladies, I need you to keep it down in there.   We do have other customers. Laine and Debbie laugh so hard they can barely breathe. ANOTHER MOMENT.   Laine and Debbie in their dresses.   In Debbie’s house.   Saying goodbye to Debbie’s parents. ANOTHER MOMENT.   School dance.   Music pumping.   Lights swirling.   Debbie holds the camera out, getting a two-shot of her and Laine.   ",
      "dialogue_count": 0,
      "word_count": 1138
    },
    {
      "scene_number": 2,
      "slugline": "INT. LAINE’S BEDROOM - NIGHT - LATER Laine scrolls through her digital photos.   ! Going backwards through the years. !   And Laine finally finds the exact same photo of her and Debbie on the floor playing the Ouija. Laine holds up the printed photo next to the image on her screen.   There's no glare on her computer version.   ! The one from Debbie's bulletin board is definitely different. CLOSE ON THE PRINTED PHOTO.   ! Suddenly lit up with a bright FLASH OF LIGHT. Laine takes a ‘snapscan’ of the photo with her iPad.   ! She opens up the image in her photo app and ENLARGES THE PICTURE. She scrolls around.   ! Down to the Ouija board.   ! That WEIRD GLARE.   Laine taps -- blows the photo up even more.   ! The glare seems to perfectly highlight the word GOOD BYE at the bottom of the Ouija board. !!  Off of Laine’s puzzled expression cut to -- EXT. DEBBIE’S HOUSE - DAY Debbie’s house sits in late afternoon shadows.   Curtains drawn.   Trevor’s car pulls up in front.   Laine gets out and heads around the side of the house. LAINE This’ll just be a second.   I have to grab something. Trevor calls out through the rolled down window -- TREVOR I thought her parents were gone? Laine doesn’t answer.   Keeps walking. EXT. DEBBIE’S HOUSE - BACKYARD - DAY Alone, Laine moves past a tarp covered swimming pool in the backyard.   She glances up at the dark windows of the house. There’s a soft lapping of water from under the pool tarp. Laine turns.   A brief undulating MOVEMENT underneath... but it’s just the wind.   Dead leaves blowing across the tarp. Laine checks under a small garden statue -- finds a SPARE KEY.   A hiding place she’s familiar with. And when she looks back up at the house... there’s now a LIGHT TURNED ON IN AN UPSTAIRS WINDOW.   Laine looks at the window, unsettled, as we go --  11.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 326
    },
    {
      "scene_number": 3,
      "slugline": "INT. DEBBIE’S HOUSE - DOWNSTAIRS - DAY A CLICK at the back door... and Laine comes inside.   Curtains drawn.   Still. LAINE Mrs. G?   Hello? No answer.   Laine moves through the kitchen.   Coffee cups next to an open tin of cookies... remnants of Debbie’s wake. There’s a feeling that Debbie’s parents packed a few things and simply left.   So eerie. INT. DEBBIE’S HOUSE - UPSTAIRS HALLWAY - DAY Laine steps to the top of the stairs.   Down the hall... the LIGHT is coming from Debbie’s bedroom. LAINE Somebody there? INT. DEBBIE’S ROOM - DAY Laine moves into Debbie’s room.   Everything here is just as it was the other day.   Preserved and untouched. The bedside table lamp suddenly FLICKERS off and then back on.   BUZZING like it has a bad bulb.   Laine unplugs it... But now there’s a slight sound.   SCRAAAPE.   Laine turns -- eyes falling on the CLOSET.   Is it coming from in there? She goes to the closet.   Hesitates.   Knowing what happened in here.   Laine opens the doors.   Darkness.   Can’t see.   She reaches up, pulls the light cord -- -- and there’s a FACE.   SOMEONE’S STANDING BEHIND THE CLEAR PLASTIC HANGING BAGS. Laine startles, as -- TREVOR (O.S.) What’re you doing? Laine spins to find Trevor behind her.   Watching.   As Laine turns back to the closet, she sees that the “face” is actually one of Debbie’s painted theatre masks, hanging on the back wall. Laine settles, looks around the closet shelves.   And there among some other games is a OUIJA BOARD.   She pulls it down and brings it over to the floor. Laine sits there, runs her fingers over the antique lettering on the vintage wooden game board. !  12.",
      "characters": [],
      "action_text": "TREVOR (CONT’D) So you came here looking for a Ouija board? LAINE We used to play all the time. TREVOR Anything cool ever happen? LAINE No, it’s just a game.   But we pretended it was real.   Asked questions about our future.   You know... ‘Will I ever find true love?’   Stuff like that.   Debbie would always spell out the answers I needed to hear.   ! And I’d do the same for her.   Like texting each other.   Old school. Trevor picks up the tear-shaped PLANCHETTE out of the box. It’s wooden.   Looks homemade.   Not the plastic kind that usually comes with the game. TREVOR And this is the thing you use -- the game piece? LAINE The   planchette .   Debbie’s mom made this one when she was our age.   Put her initials on the bottom.   And we added ours too.   See? Laine places the planchette on the board.   ! Touches it with two fingers... moving it slightly across the board -- LAINE (CONT’D) You know how Debbie and I had that huge fight a few weeks ago? Trevor nods. LAINE (CONT’D) I thought it would blow over.   You know, ’It'll be okay tomorrow.’   Or next week.   And suddenly there's no tomorrow. Laine looks at Trevor.   ! She is sick with guilt. TREVOR Laine, you can’t blame yourself for this.   Friends have arguments.   Why Debbie did what she did... we’ll never know.  13. Quiet.   Laine keeps looking at the board. LAINE Sit across from me a sec.   !  Trevor gives her a look -- knows where she’s going with this. LAINE (CONT’D) You aren’t supposed to mess with it alone. TREVOR You said it was a game. LAINE It is.   But... Trevor sits across from her.   ! Watches as Laine puts her fingertips on the planchette.   ! He does the same. TREVOR Okay. LAINE You do two circles like this.   One for each of us.   Clockwise. They move the planchette twice around the board.   ! The feeling in the room shifts.   ! Trevor gives Laine her space, knows she needs to say some things. LAINE (CONT’D) Freshman year, when my mom suddenly decided that she needed to ‘find herself’ and split ",
      "dialogue_count": 0,
      "word_count": 743
    },
    {
      "scene_number": 4,
      "slugline": "INT. LAINE’S BEDROOM - NIGHT Laine’s back home.   Alone in her room.   And she now has the OUIJA with her.   She sets the board on her desk.   Slides the planchette on GOOD BYE at the bottom.   Laine lights a votive candle next to the board.   A remembrance. TIME LAPSE DISSOLVE... as the candle burns low... flickers out... the light in the room fading on the board. INT. LAINE’S BEDROOM - NIGHT It’s late.   ! The room sits in darkness.   ! We’re on the Ouija board... the planchette still rests on the words GOOD BYE. !  DRIFT OVER TO LAINE.   ! Asleep.   We hover above the bed as... ...very slowly... almost imperceptibly... the bedside table begins to slide away from the bed. Laine wakes up.   ! Listening in the dark as she hears something moving in her room.   !  Laine sits up, reaches over for her lamp... and it’s not there.   She looks over to see that her bedside table is now three feet away from the bed.   The light cord from the lamp swings slightly.  And that sound comes again.   SCRAAAAPE... something else is sliding around in the room. Laine gets out of bed, turns on the lamp -- and the sound immediately stops. Laine steps over to see the OUIJA BOARD on the desk where she left it.   But something looks different.   The planchette has moved... no longer on GOOD BYE at the bottom of the board. Laine stands right over the board... sees that the planchette is now on top of the letter ‘D.’ Laine is chilled by the sight of it.   She cautiously reaches out and touches the planchette... glances around her room -- ‘what just happened?’ !  INT. LAINE’S BEDROOM - DAY Morning.   Laine’s getting dressed as Sarah shuffles past in the hallway... just now waking up. LAINE Hey, Worm -- Sarah pokes her head in. LAINE (CONT’D) -- were you in my room last night?  15.",
      "characters": [
        "LAINE",
        "PETE"
      ],
      "action_text": "SARAH Wait.   What? -- LAINE -- were you messing around in here. Yes or no? SARAH No.   God.   I wasn’t in here. You’re trippin’. Sarah moves on.   Laine stands there, looking down at the Ouija. INT. DINER - DAY Local hangout.   Family-owned kind of place.   ! Laine sits with Trevor and Isabelle at a booth.   ! Isabelle wears a waitress uniform, taking a break from her shift. Laine is in the middle of her story -- LAINE -- and then the planchette had moved to the letter ‘D.' TREVOR The board must've gotten bumped -- LAINE -- it did not get bumped, Trevor. Stuff was moving in my room. Trevor reaches across the table... takes Laine’s hands. TREVOR Laine.   ! Everyone’s in shock.   ! But you don’t need to keep feeling guilty about this.   Last night... you were having some crazy nightmare. Laine's frustration is growing.   ! She pulls her hands away. LAINE I wasn't asleep.   ! It’s Debbie. She's trying to contact me. Isabelle and Trevor exchange a worried look.   Isabelle tries a softer approach -- ISABELLE Let's say she is.   What do you think she wants? Laine looks at them.   ! Very serious.  16. LAINE She wants me to play the game. TREVOR Are you being for real? Laine fights her emotions.   Trying not to fall apart. LAINE You ever think that even after someone you love has died... there’s still a way they can reach out?   What if the game is real this time?   I need to talk to Debbie.   Please.   Do this with me. The COOK at the kitchen window hits the bell.   DING!   ! Order up.   A man in a tie -- ISABELLE’S FATHER -- angrily waves at her to get back to work. ISABELLE Of course... I’m in. Trevor nods, uncomfortable about this. TREVOR Me too. EXT. LAINE’S HOUSE - DAY Laine stands out at the curb as her FATHER finishes loading a suitcase and hanging bag into the back of a waiting TAXI CAB. Mr. Moreno closes the trunk, comes over to Laine. MR. MORENO I hate to leave right now. LAINE We’ll be okay. MR. MORENO Once these permits get approved, I’ll be back.   ! Might be",
      "dialogue_count": 2,
      "word_count": 4774
    },
    {
      "scene_number": 5,
      "slugline": "INT. LAINE AND SARAH’S HOUSE - DAY Nona retrieves the other sock at the top of the stars, and as she looks down the hall... ...sees that pieces of laundry are scattered on the floor like a trail leading to Laine’s closed bedroom door. Nona feels a chill.   She puts the basket down, moves down the hall, stopping at Laine’s door. She hesitates at the door... then pushes it open. INT. LAINE’S ROOM - MOMENTS LATER Nona steps into Laine’s room and sees that the trail of clothes continues across her floor to the bed. UNDER THE BED... as NONA comes closer.   Picking up the clothes.   Closer...   !  BACK WITH NONA.   She gets down on her hands and knees, starts to lift the dust ruffle when behind her -- a SCRAPING SOUND. Nona turns.   ! Just as the Ouija planchette falls off the desk and lands on the floor.   ! She picks it up.   ! Confused.   ! And as she stands she sees the OUIJA BOARD on the desk.   In an instant, she realizes what she’s holding and drops it. Backing away from the board right into -- Laine.   Home from school.   Both of them scaring the hell out of each other. LAINE Nona, what’re you doing -- Nona points at the Ouija board... but won’t look at it. NONA  -- you should never touch such things, let alone bring one into your house --  LAINE  -- it was Debbie’s.   It’s just a game.   That’s all.   Nona --  Nona’s doesn’t want to hear it.   She’s out of the room. Muttering something to herself.   Laine picks up the planchette from the floor.   Beat, and we’re -- SUDDENLY TIGHT ON TREVOR.   Sweating.   Breathing.   His face a mask of total concentration. EXT. SUBDIVISION STREET - DAY - LATER Trevor bikes along the outer edge road of a neighborhood.   No traffic out here.   Body leaning forward on the bike.  35.",
      "characters": [],
      "action_text": "Pushing hard.   A little further.   Reaching a mental finish line... and then he coasts.   Sits up.   Catching his breath. EXT. PEDESTRIAN TUNNEL - DAY Trevor takes a sip of water... walks his bike to the entrance of a long pedestrian tunnel.   HOLD HERE... as Trevor enters and slowly disappears into the shadows ahead. INT. PEDESTRIAN TUNNEL - DAY Bike gears clickclickclick as Trevor makes his way through the narrow tunnel... light fading on him as he goes deeper. Up ahead, a sound coming from around a tunnel corner. ...SCRATCH-SCRATCH-SCRATCH-SCRATCH .  Trevor stops.   Silencing the clicking of his bike so he can hear better. The SCRATCHING gets louder... like nails on a chalkboard echoing in this concrete corridor. TREVOR Hey -- somebody there? No answer... but something MOVES.   An abandoned SHOPPING CART slowly rolls out from behind the corner... drifts to a stop.  Trevor peers ahead into the darkness.   Can’t see around the corner up ahead.   Was it the wind... or did someone push it? TREVOR (CONT’D) Who is that? The cart just sits there.   Trevor leans his bike against the wall and unclips a safety light from under the seat.   He starts walking toward that corner.   Coiled.   On edge.   His red light BLINKING into the darkness. TREVOR (CONT’D) Pete?   I swear to god dude -- He quickly rounds the corner -- and no one’s there.   Trevor regards the empty tunnel... his light still blinking when suddenly -- a small ROCK comes skipping out of the darkness, landing at his feet.   Like someone just tossed it. Trevor picks up the rock.   Rattled.   He moves toward the direction it came from... notices a sign on the tunnel wall: PLAYGROUND -- with an arrow pointing to the exit.   Trevor runs his light across the sign, revealing that it’s been vandalized.   Some of the letters wildly scratched off. Just the word PLAY remains.  36. Trevor raises his blinking light toward the empty darkness ahead of him where the rock came skittering in from.   He starts to back away... un",
      "dialogue_count": 0,
      "word_count": 1143
    },
    {
      "scene_number": 6,
      "slugline": "INT. DINER - NIGHT SUDDENLY, and quietly, we’re on a CHAIR.   It just sits there. EASE IN on the legs of the chair... as it starts to move... sliding across the floor. IN THE EMPTY DINER, WE FIND ISABELLE in her waitress uniform. She pulls chairs out and flips them upside down on a table. Sweeping underneath.   Closing up for the night. She heads toward the back, but stops at the daily special board.   A prankster has obviously rearranged the letters from “Try Our Meatballs” to “Eat Our Balls.” ISABELLE That’s lovely. She puts the letters back in place.   Then -- INT. DINER KITCHEN - NIGHT Isabelle ties off a large bag of garbage... heads toward the rear exit... passes her FATHER in the restaurant office as he runs through the receipts. EXT. DINER - BACK AREA - NIGHT Isabelle comes out the back exit... nudges a brick against the bottom of the door to keep it open. She takes the sack of garbage over to the dumpster and heaves it in.   DRIFT AWAY FROM HER... ...over to the back door.   As the brick door-stop begins to slide across the ground.   Sliiiding and -- SHHHUNK.   ! Isabelle turns to see the door has fallen shut. She steps away from the dumpster and comes over to the door. Tries the handle.   ! No entry from the outside.   !  ISABELLE Hey! She KNOCKS on the door.   ! Waiting.   ! Stuck out here alone behind the restaurant.   ! Isabelle glances around.   ! The bulky dumpster... her parked car... sodium vapor lights BUZZING overhead. Not a soul in sight... and yet... there is a presence.   ! Like someone out there is watching. Isabelle BANGS on the door again.   ! More urgent.   ! Doesn’t want to be out here a second longer. ISABELLE (CONT’D) Dad!   ! C’mon, open up!  39.",
      "characters": [],
      "action_text": "There’s a faint fluttering sound.   ! Behind her. Isabelle glances back.   ! Sees A FLYER on her car windshield. Fluttering in the night breeze. She goes to her car, passing through a pool of overhead light.   ! Takes the flyer off her windshield.   ! Furniture Sale Saturday!   ! She wads it up, and now notices something else... The word ‘FREND’ written in the condensation on the driver's side window.   ! The letters drip.   ! Like someone was just here... having written the word with their finger.   !  It seems innocent.   ! Isabelle wipes it away with her hand. Stands there in the dark... As her car ALARM suddenly goes off!   ! Scaring the hell out of her.   ! It shrills through the night air.   ! Isabelle takes a step back... something doesn't feel right.   ! The alarm keeps BLARING as -- KA-THUNK!   ! The back door finally opens.   ! Light from the restaurant spilling out.   ! We hear her DAD from inside -- DAD (O.S.) What’s going on -- you okay? DAD has Isabelle’s car keys.   He shuts off the alarm. Silence again.   ! Isabelle takes a final look at her car. ISABELLE Yeah.   ! I'm good. She steps inside and pulls the door closed. EXT. LAINE’S HOUSE - NIGHT Through a window, glimpse SARAH in the living room.   Her face bathed in the glow of her laptop screen.   A GUY’S VOICE -- GUY’S VOICE   (O.S.) Imagine what could happen if one million minds came together with the same mission. INT. LAINE’S HOUSE - LIVING ROOM - NIGHT Sarah is on her laptop, watching a video on a website.   A HIP PODCAST GUY talks about the Ouija, as a ticker runs along the top of the screen... 16,209 and counting. HIP PODCAST GUY That’s right, we’re gonna be talking with the spirits.   Hit the join button.   All you need is your mouse...  40. NOW A “VIRTUAL OUIJA” on the computer screen.   A demo shows someone with their hand on a mouse, slightly moving... as the planchette on the virtual game board also moves. HIP PODCAST GUY (V.O.) ...and you can take part in the world’s biggest Ouija game ",
      "dialogue_count": 0,
      "word_count": 1399
    },
    {
      "scene_number": 7,
      "slugline": "INT. LAINE’S ROOM - NIGHT The girls emerge from the closet.   And even in the dark, right away -- they can tell that something’s different. SARAH Where’s your bed? LAINE Moved.   Over there. SARAH Everything’s moved. The whole room has been rearranged.   But there’s a familiarity about the lay-out of all the furniture.   Car lights pass by outside, just for a moment -- casting a long tree branch shadow across the wall. Laine feels for a light -- CLICK. It’s now set up just like Debbie’s room.   Bed.   Desk.   Side table.   Even the OUIJA BOARD is at the center of the floor... just like when they play it at Debbie’s house. Sarah takes it all in... reeling. SARAH (CONT’D) This is so messed up... who would do this? Laine kneels down next to the Ouija board on the floor and sees that the planchette is once again on the letter ‘D.’ LAINE It’s Debbie.   She wants us to play again. INT. DINER - DAY Corner booth.   ! Away from the other customers.   ! Everyone who played the Ouija is gathered.   ! Except for Pete.   ! Voices hushed.   ! Urgent.   ! Talking over each other -- LAINE -- and all the furniture had been moved.   Arranged just like Debbie’s room.   The game sitting right there.   It was her way of saying we need to come back to the board -- TREVOR -- Laine.   ! Stop it.   This is a living breathing person who’s trying to freak us out.   The game is not real.  44.",
      "characters": [],
      "action_text": "ISABELLE Then how do you explain someone watching me last night, writing messages on my car -- TREVOR -- it’s Pete.   You ever wonder if the guy might be a complete psycho... making us think that it's Debbie doing all this?   I mean, what do you want me to say here? LAINE I want you to say you believe in this. But Trevor won’t give her that. Sarah has remained silent this whole time.   ! Still shaken by the night before.   ! She finally speaks, her voice quiet... SARAH In our house last night, couldn’t have been a person that did all that.   It was her.   I’m with Laine. We’ve got to keep going. Isabelle looks at Laine.   Puts it out there -- ISABELLE You think she's trying to tell us the truth about how she died. Laine holds her look.   ! It's dead quiet.   !  LAINE Someone killed Debbie. ISABELLE Why did we do this?   Never should have touched that thing... LAINE We have to talk to her.   We get a name... and then we’re done. !!!  No one says anything.   Just an incredible sense of dread in the air.   And then jolting us like a clap of thunder -- THE OUIJA BOARD.   Larger than life.   FOUR HANDS reach in... fingertips touching the planchette. INT. DEBBIE’S ROOM - NIGHT Laine, Trevor, Sarah, and Isabelle sit on the floor in Debbie’s room.   ! A couple of battery lanterns placed about the dark room.   ! Everyone has a hand on the planchette.  45. LAINE Four circles this time.   ! One for each of us. They CIRCLE THE BOARD clockwise.   ! One.   ! Two.   ! Three.   ! Four. The game has begun. LAINE (CONT’D) As friends we’ve gathered, hearts are true.   Spirits near, we call to you.   If there’s a presence here, make yourself known. Long beat on the board... the planchette totally still.   !  SARAH It’s not working. ISABELLE Let me try.   Debbie, it’s Iz.   Will you come and talk to us? Everybody remains intensely focused.   Barely breathing.   ! EASE IN on the planchette.   ! Closer and closer... a feeling of passing time... ...and nothing happens.   ! It sits there.  ",
      "dialogue_count": 0,
      "word_count": 2579
    },
    {
      "scene_number": 8,
      "slugline": "INT. LAINE’S BEDROOM - NIGHT Laine’s at her desk.   Lingering on the black and white photo of her Debbie.   She glances over... notices the little keychain figure.   Sees that the penguin’s head is coming loose from the body. Laine pulls on the head.   ! It comes off to reveal... the keychain toy is actually a FLASH DRIVE. Laine now has Debbie’s FLASH DRIVE plugged into her computer. She clicks through folders.   Searching.   Opens up a folder called LET’S PLAY that contains various VIDEO FILES. Beat.   Laine clicks and opens up the first file.   Before we see the image, we hear familiar words --  LAINE AND DEBBIE (O.S.) As friends we’ve gathered, hearts are true.   Spirits near, we call to you. ON SCREEN.   ! LAPTOP CAM POV.   ! We recognize the tree mural of Debbie’s room. Laine sits with Debbie on the bed.   ! Hanging out.   ! They have the Ouija board between them.   ! The footage feels very recent. DEBBIE Is Blake ever going to actually ask me out -- or will he just keep sending me naughty texts? Both girls have their hands on the planchette.   ! It starts to move -- jerky. LAINE Okay.   You’re being a spaz. DEBBIE That’s not me -- LAINE -- yeah, right. The planchette slides to NO.   ! Debbie cuts a look at Laine. DEBBIE Hey -- you're supposed to give me the answers I want to hear -- LAINE -- I didn't do that. DEBBIE I guess you don’t think he’s right for me --  55.",
      "characters": [],
      "action_text": "LAINE -- moving on.   My turn. Laine turns her attention to the board. LAINE (CONT’D) Ouija.   ! I heard a rumor that Debbie isn't coming with me to college next year.   ! Is that true? Debbie hesitates.   ! Then visibly pushes the planchette to YES. Laine takes her hands off the planchette.   !  LAINE (CONT’D) When were you going to tell me? DEBBIE I was trying to find the right time.   ! Listen -- I’m glad you know now because I’ve been dying to share this with you.   ! I got this amazing opportunity for a photography internship in Spain -- LAINE -- but we were going to room together and everything.   ! We had a whole plan.   !  DEBBIE It’s just for a year -- LAINE -- I can’t believe you’re doing the to me.   !  Debbie seems crushed by Laine’s reaction. DEBBIE I was hoping you’d be excited. That I landed this, you know. I’ve always been then there for you.  ON LAINE AS SHE WATCHES.   ! Reliving this moment.   ! The regret playing across her face as we hear the argument on the video escalating.   ! Their voices getting louder.  BACK ON THE VIDEO -- Laine gets up.   ! Feeling totally abandoned by Debbie. LAINE But you’re leaving me behind -- DEBBIE -- you’re my best friend.   ! This doesn’t change anything between us--  56. LAINE It changes everything! Laine storms out of frame.   ! Debbie is stunned.   !  DEBBIE Laine -- please.   Let’s talk about this! Debbie follows.   ! Voices continuing off. Long beat.   ! The Ouija sits there.   ! Debbie returns.   ! Climbs back onto her bed.   ! Upset.   !  She regards the board... positions it in front of her.   ! Puts her fingertips on the planchette.   ! Talking to herself, fighting tears about the argument -- DEBBIE (CONT’D) Question: Is Laine going to keep acting like such a little bitch? Beat... the planchette TWITCHES.   ! Familiar.   ! Slides to an answer.   ! Not in a way that looks like Debbie moving it, but that it's really working.   ! It's obvious by Debbie's expression that she's startled by the moment. DEBBIE (",
      "dialogue_count": 0,
      "word_count": 3994
    },
    {
      "scene_number": 9,
      "slugline": "INT. HIGH SCHOOL AUDITORIUM - SOUND BOOTH - DAY Laine and Pete are on the computer.   Looking for anything that might help them.   It’s all basic info. LAINE Nothing.   Same stuff on all the sites. Laine gets up.   She goes to the window that looks out into the auditorium.   Everything feels like a dead end. Pete stays at the computer.   He types.   Clicks.   Types again. Clicks.   Starts reading something on the screen -- PETE Hey.   Come look at this. There’s now a PARANORMAL WEBSITE pulled up on the computer. PETE (CONT’D) I entered ‘Ouija’ and the initials ‘D.Z.’ into a search and this is what came up.   I guess this happened a while back. Laine clicks into an article.   The HEADLINE: “Friends Die in Tragic House Fire.”   She starts to read -- LAINE ‘Investigators never found a cause for a fire that took the lives of three high school students while they slept.’ As Laine reads, we glimpse accompanying PHOTOS (circa early 80’s) that are on the webpage.   Three TEENAGE GIRLS hanging out in a bedroom.   Making faces.   And playing a OUIJA. LAINE (CONT’D) ‘But there were rumors that the girls had been playing with a Ouija board.’ PETE ‘Other friends from school confirmed the reports.   And that the name of the spirit during contact went by the initials D.Z.’ Hearing those same initials, it’s like Laine has the wind knocked out of her. LAINE This has happened before... Pete keeps reading --  70.",
      "characters": [],
      "action_text": "PETE ‘In our research, these initials have appeared in other instances in which players suffered various outcomes... sudden death due to unexplained accidents... cases where people simply vanished... never seen again --’ Laine clicks on another PHOTO on the website.   FIRE INVESTIGATORS sifting through the remains of the burned down house.   Laine clicks another photo of the destruction -- and notices something. She enlarges the image.   There -- amidst the charred remains of the house -- a OUIJA BOARD.   Uncannily undamaged by the fire.   And then another photo of the back of the board. ANOTHER PHOTO.   A BLACK SMUDGE on the back of the board.   The shape... it looks like a HANDPRINT.   !  Laine turns to Pete, her nerves shredded.   He’s on the same wavelength.   The world feels like it’s closing in on them. LAINE My god.   ‘Finish game.’   I thought it was a message -- something we had to do to end this.   But it’s his pattern.   D.Z. kills all the players.   ! And then he’s finished. Moves on to the next game... PETE ...and it starts all over again. INT. HIGH SCHOOL CLASSROOM - DAY Lights are off.   A TEACHER lectures at the front of the room, projecting science charts on a screen. DRIFT DOWN A ROW OF DESKS to Sarah sitting in the far back. An empty desk behind her. Sarah’s   finding it hard to pay attention to the lecture.   Her thoughts stray. She sets her pen down.   Closes her eyes.   Takes a breath. Trying to tune things out, but something doesn’t feel right. Sarah opens her eyes.   The dim light in the classroom shifts as the teacher advances to another chart. Sarah glances down at her desk.   Her pen sitting there. Beat... and then it twitches.  71. She keeps staring.   Maybe that didn’t just happen. Everything is very still... the droning voice of the teacher at the front of the class... and the pen twitches again. Very slowly, as if being moved by some unseen force, it starts to slide across her desk. Sarah watches in disbelief.   Can’t pull her eyes awa",
      "dialogue_count": 0,
      "word_count": 1164
    },
    {
      "scene_number": 10,
      "slugline": "EXT. VACANT LOT - DUSK The empty neighborhood lot.   ! Trevor sits at the curb next to his bike.   ! He checks his cell phone, looks up as Pete's car pulls up across the street. Laine gets out of the car and approaches.   ! Pete and Sarah hang back, giving them some space.   !  TREVOR Got your text. (beat) Hey, those things I said... LAINE You’re here now.   ! That’s all that matters. TREVOR So... why are we here? EXT. VACANT LOT - DUSK LONG SHOT.   ! In the fading light of day, Laine, Trevor, Pete and Sarah walk through the tall dead grass... heading toward the spot where they burned the Ouija board. Sarah stops.   Doesn’t want to go any further. Laine continues on... walks up to a spot in the dirt.   Black charred bits of wood and grey ash.   Remnants from the fire. Laine leans down, brushes away the ash. Pete and Trevor stand over her shoulder... watching. Laine keeps sweeping the ash away with her hand... a familiar antique font alphabet appearing underneath. It’s the OUIJA BOARD.   ! Totally intact.   ! As if the fire never touched it.   ! The PLANCHETTE too.   ! Not burned.   ! It’s perfect. Everyone stares.   It’s a nightmare they can’t escape. Laine stands with the board in her hands.   ! Beat.   ! She turns it over.   ! And there's a BLACK SMUDGE on the back.   ! That same CREEPY HANDPRINT we glimpsed in the Ouija internet article. LAINE I saw this before.   ! On Debbie's video... she was standing in the mirror.   ! Something was on her skin. It was this.   ! A handprint.   ! His handprint.   !  (beat) Is that what he's doing?   ! Marking us.   ! Telling us who's next.  74.",
      "characters": [],
      "action_text": "Pete, Trevor and Laine check themselves.   Nothing.   And then Laine looks over at Sarah... standing there with her sleeves pulled to her wrist.   Laine doesn't even need to say anything. SARAH Don't make me look.   ! I don't want to know... Laine comes over... gently pulls one of Sarah's sleeves up. Nothing there.   ! Pulls the other one up... and there's the DARK HANDPRINT on her forearm. SARAH (CONT’D) I'm next.   I'm going to die... Sarah frantically tries to wipe away the black handprint. She’s totally losing it.   Laine takes her sister’s face... trying to calm her. LAINE No.   ! I won’t let that happen.   ! We have to play one last time and then it’s over.   ! Do you trust me? Sarah holds the look with Laine -- nods. EXT. DEBBIE’S HOUSE - DUSK Sun setting.   ! Trees casting long shadows.   ! EASE IN on the dark windows... INT. DEBBIE’S HOUSE - CONTINUOUS The downstairs is totally still for a long beat... then a FIGURE moves through the shadowed house.   ! Stepping through the broken mirror shards on the floorboards.   !  It’s DEBBIE’S MOTHER.   She walks slowly.   Eyes searching. Expectant.   She freezes at hearing a dull SLIDING sound coming from upstairs. MRS. GALARDI Debbie? INT. DEBBIE’S HOUSE - STAIRS - MOMENTS LATER Debbie’s mother stands at the bottom of the stairs looking up.   She reaches for the handrail and begins to head up... passing photos of her daughter along the wall.   ! Debbie’s face distorted by the shadows on the glass as she passes. MRS. GALARDI Are you here, baby?   ! Let me see you -- I need to see you. From upstairs... that dull SLIDING sound again.  75. Mrs. Galardi keeps moving up the stairway.   ! Suddenly, she stops.   Gasping at the sight of -- -- a DARK FIGURE standing at the very top of the stairs by the wall.   ! The face is concealed with one of Debbie’s painted theatre MASKS. Mrs. Galardi smiles in astonishment.   ! Her eyes alive. MRS. GALARDI (CONT’D) I knew it.   ! I knew you were here. THE FIGURE just stands there.   Not",
      "dialogue_count": 0,
      "word_count": 3319
    },
    {
      "scene_number": 11,
      "slugline": "INT. DEBBIE’S HOUSE - DOWNSTAIRS - NIGHT Pete and the still soaking wet Trevor hurry through the house.   Their light catching sight of Sarah.   But Trevor immediately notices that Laine’s absent. TREVOR Where’s Laine? SARAH She went upstairs. With a sick realization -- PETE She’s with the Ouija.   Alone. INT. DEBBIE’S BEDROOM - NIGHT Laine is still at the board.   Fingers still in place. The LANTERN flickers as Laine’s hit by an angry uncanny blast of wind.   An angry energy filling the room. The closet door swings open.   The mirror mounted to the inside, reveals Laine's reflection.   ! She gasps at the sight of a prominent large black HANDPRINT now on her arm.   ! She has been marked! And then she sees in the reflection -- BEHIND HER -- someone standing there.   It’s D.Z.   He reaches out toward her with a strange stuttering arm.   !  Suddenly -- THE MIRROR CRACKS.   ! Spiderwebs.   !  A loose shard rattles in the mirror -- then sucked away by the wind.   Flies across the room.   The sharp piece SLICES Laine’s cheek.   Draws blood. There’s POUNDING on the other side of the door.   Trevor’s voice faintly yelling under the rising chaos in Debbie’s room. WHOOSH!   Debbie’s shelves slide in front of the door.   No one’s getting in. Laine shoots a look to the door.   Knows she’s trapped. Bathed in a little island of lantern light in the inky black that surrounds her.   This is where she’s going to die. She takes a brave breath.   Closes her eyes.   Ready. SLOWLY MOVE DOWN LAINE TO THE PLANCHETTE, rattling on the board -- as OTHER HANDS reach in.   Fingertips touching.  87.",
      "characters": [],
      "action_text": "Laine senses something.   Opens her eyes.   Astonished to see that SOMEONE is sitting across from her.   Playing the game. It’s a TEENAGE GIRL.   The girl looks up with sad eyes... It’s DEBBIE. Laine whispers in amazement.   ! Totally overcome with emotion to see her old friend sitting across from her. LAINE Debbie... DEBBIE Never play alone, Laine. The way Debbie says these words... so full of regret.   ! Laine starts to cry.   ! And Debbie does too. Debbie looks around her room.   ! At all of her things.   ! And then sees her bracelet on Laine's wrist.   ! She reaches out and touches it.   ! A piece of her living on through Laine.   !!  LAINE I should've been there for you. I'm so sorry.   ! If I could do it all over again... !  Debbie smiles through her tears.   ! All is forgiven between them.   But Debbie’s smile slowly fades, sensing something -- -- and she suddenly spins and looks behind her.   ! Terrified. DEBBIE Laine -- he’s coming. The LANTERN flickers.   In the flash of light, DEBBIE NOW LOOKS HORRENDOUS!   Plastic dry cleaning bag wrapped tight around her screaming twitching head. Another LAMP flicker -- back to normal.   A part of her stuck here.   Can’t move on. DEBBIE (CONT’D) Take your hands away. Laine shakes her head.   !  LAINE No!   ! I'm not leaving you again.   !  The vibe in the room grows more intense.   All around them, A FIGURE drifts in and out of the shadows.   There!   Then over there!   It feels like being in the very heart of evil. The PLANCHETTE twitches across the board.  88. DEBBIE You have to, Laine... you have to say goodbye. Laine is crying harder.   ! Shaking her head.   ! Terrified but willing to die right here. LAINE I can't. DEBBIE You need to go, Laine.   ! Live a good life.   ! Do great things... The two girls lock eyes with each other.   !  DEBBIE (CONT’D) ...for me. Laine is overcome.   ! Can barely get the words out. LAINE Good bye... Laine pulls her hands away from the board. Alone, Debbie does a reverse circle around t",
      "dialogue_count": 0,
      "word_count": 775
    },
    {
      "scene_number": 12,
      "slugline": "INT. DEBBIE’S ROOM - NIGHT - CONTINUOUS -- he bursts into the room -- -- to find that everything is totally still.   He shines his light around the room.   The calm after the storm. Laine’s not here. It’s just the board sitting on the middle of the floor.   A smear of blood on it.   Next to the board, the planchette. It’s literally cracked in half. Sarah moves in behind Trevor.   Taking in the room.   Doesn’t see her sister anywhere. SARAH Laine? And Sarah starts sobbing.   Fearing the worst.   Trevor holds her.   Both of them speechless. Pete crouches down.   Nudges the broken planchette with his flashlight.   Taking in the stillness of the room. A faint sound.   He shines his light over by the bed.   Can’t see anything.   Pete moves forward... closer... around the side of the bed. And there’s LAINE.   Huddled in a corner.   Her head buried in her arm. Pete gently reaches out... touches her. Laine glances up.   Surprised to see him.   Surprised that she’s even here.   Laine looks at her arm -- the handprint mark that was there is gone. !  Sarah turns.   Sees her sister.   Races over to her.   Crying even harder now.   They hold each other.   Not letting go. EXT. DEBBIE’S HOUSE - NIGHT PULL AWAY from the house.   The horror truly feels over.   The spirit moving on to the next game.   Somewhere out there... DISSOLVE TO: CLOSE.   A PIECE OF PARCHMENT.   Letters appearing one by one, spelling out the name DEBORAH. EXT. CEMETERY - DAY Trees.   Grass.   WE FIND LAINE... at Debbie’s grave.   Making a rubbing of her headstone.   Finished, she pulls the parchment away, revealing the full inscription:  90.",
      "characters": [],
      "action_text": "Deborah Galardi - A Friend Forever SARAH, TREVOR AND PETE are standing here too.   They all place a flower at the grave and then step away.   Allowing Laine to have a final moment. Laine places her single white flower among the others.   She kisses her fingers, touches the headstone. Laine rises.   A last look... and she steps away.  ROLL CREDITS over a haunting, female vocal cover version of Morrissey’s “Ouija Board, Ouija Board.” Ouija board Would you work for me? I have got to say hello To an old friend And for those who stay all the way until the very end of the credits, they are rewarded with a final tag:  BLACK.   ! We hear a GUY'S VOICE -- GUY'S VOICE (O.S.) Here it is.   ! The moment we've all been waiting for. IMAGE COMES UP.   ! A guy on screen, speaking directly to the camera.   ! We recognize him as HIP PODCAST GUY from earlier when Sarah was on her computer. HIP PODCAST GUY One million people online, right now -- ready to play the world's biggest game of Ouija.   What are we waiting for? Let's do this.   Hand on your mouse. The image of a virtual OUIJA BOARD comes up and fills the screen.   ! The layout and lettering identical to the actual game.   The planchette circles the board in a clockwise motion. HIP PODCAST GUY (O.S.) (CONT’D) Is there a spirit with us now? Please let us know that you are here. Beat... then the planchette on screen moves up to the YES. PULL AWAY FROM THE SCREEN... into a bedroom... we see a hand resting on the computer mouse.   ! KEEP PANNING UP to reveal that it's SARAH.   ! Sitting at her laptop in her room.  91. HIP PODCAST GUY (O.S.) (CONT’D) Okay, this is seriously cool. Spirit, can you tell us your name? ON THE SCREEN -- the planchette sits there.   ! Then slowly starts to move.   Across the letters... keeps moving... SARAH watches... waiting... As the planchette finally lands on the letter \"D.\" Whoa.   ! Sarah clicks out of the screen.   ! The online Ouija game is gone.   She sits there.   ! Lets out a breath.   Never aga",
      "dialogue_count": 0,
      "word_count": 742
    }
  ]
}