{
  "slug": "outlaw-king-2018",
  "title": "outlaw king",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 22,
  "characters_count": 1,
  "characters": [
    "ROBERT"
  ],
  "total_words": 26796,
  "total_dialogue": 1,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "I/E. SCOTTISH VILLAGE - DAY 1   1  A flock of SHEEP wander through corpses. A massacre has taken place. Men, women, children are dead on the ground. Sheep walk through cottages. The cottages have been ransacked. A SHEEP DOG barks, trying to herd the flock back where they belong. He works with some success, herding them past burned haystacks into the fields. The animals startle at the sound of galloping hooves. A RIDER is approaching, a BLOODHOUND at his side. The rider dismounts. Looks around. Takes in the destruction, the death. He eyes a crucifix fallen to the floor in one of the cottages. He’s a man of composure but his jaw muscles are popping, his eyes are burning. He is appalled. This is ROBERT THE BRUCE (30s). His dog is FAOLAN. Robert mounts his horse again, canters off. Stops. A few yards outside the village is a dead GIRL (7). She must have been running away. There is blood down her legs. Raped. Robert stares at her. Dismounts. Runs like a madman back towards the village. He returns to the girl, still running, now with a spade. He begins to dig her a grave as fast as he can. Dirt flies through the air. All his anger, all his grief, channeled into the physical act of tearing at the earth. Faolan licks at the girls bloody leg. Robert lets out a roar. ROBERT Here! The dog bounds obediently to his side. EXT. SCOTTISH LANDSCAPE - DAY 2   2  Robert rides as fast as he can. Over this, we read:  Scotland 1297. After their king died suddenly, leaving no heir, the Scottish nobles appointed King Edward of England, to choose a successor. Instead, he exploited the rivalries among the competing claimants to seize power and become the Scots’ overlord. When the people rebelled, he began a reign of terror that threatened to crush all opposition and bring the country to its knees... Almost.  EXT. BRUCE CASTLE, COURTYARD - DAY 3   3  SERVANTS help Robert dismount. They’re all efficiency. Their job’s to be invisible. One leads his horse away, another  quietly asks:",
      "characters": [],
      "action_text": "SERVANT Would you like a bath drawn, my Lord? Something to eat? Something to drink? ROBERT Where are my guests? SERVANT The tannery, my Lord. Robert exits. INT. BRUCE CASTLE, TANNERY - DAY 4   4  Where ANGUS MACDONALD, 30s, a fearsome, cheerful Highlander, and SIR CHRIS SETON, 20s, an agile warrior, are skinning hares. They turn to see a shaken Robert. ROBERT You were right. We must join him. His friends grin. They’ve been waiting a long time for this. ANGUS I told you if you’d get out your castle once in a while you’d see a thing or two. CHRIS What’s all the dirt on your face? Robert has no idea his face is filthy from his grave-digging. CHRIS (CONT’D) (amused) I know you like to keep yourself nice and tidy that’s all. INT. BRUCE CASTLE, ROBERT’S QUARTERS - NIGHT 5   5  A fire burns in the fireplace. Robert sits in a tub, lost in thought. A servant scrubs his fingernails clean. EXT. FALKIRK BATTLEGROUND, ENGLISH SIDE - DAY 6   6  Scottish soldiers charge in a disorderly fashion towards the highly militarized and well-oiled English Army. Volley upon volley of arrows fly from English longbows- impaling the ragged Scots - they are vastly out-numbered, ill-equipped and disorganised. The English advance with THOUSANDS of CAVALRY, INFANTRY, and ARCHERS. DRUMMERS inspire the troops. The English King Edward I, 50s, tall and imperious, sits on his powerful WHITE WARHORSE feeling terribly alive. He signals troops to his left. They increase their speed.  2.",
      "dialogue_count": 0,
      "word_count": 603
    },
    {
      "scene_number": 2,
      "slugline": "EXT. HILL ABOVE FALKIRK, SCOTTISH SIDE - DAY 7   7  Robert on the brow of a hill with FIFTY MEN including Angus and Chris. Horrified, they watch the slaughter of their countrymen. Nearby is SIR JOHN COMYN, 30’s, piercing eyes, affable smile. Not to be trusted. Robert looks away from the bloodshed, notices a SPIDER and web in the dewy grass. Focuses on it. Respite. CHRIS (O.S.) You here to fight, Comyn? Comyn’s horse crushes the spider and web. Robert looks up. COMYN I told Wallace this was madness. He says he wants to save our countrymen. Odd choice to lead them to certain slaughter. EXT. FALKIRK, BATTLEFIELD - CONTINUOUS 8   8  WILLIAM WALLACE (30s) - steely-eyed and filthy - tries to stem the tide of his men fleeing from volleys of arrows - a losing battle. Nearby, a horse rears up, is lanced in the belly. EXT. FALKIRK, BATTLEFIELD, ENGLISH SIDE - CONTINUOUS 9   9  We are at the very back of the English army. No danger here. On the one side, open fields. On the other, the backsides of the last line of ENGLISH CAVALRY, unlikely to see fighting. LORD TENNANT (fat, 50s,) not dressed for battle, is running around like a chicken with its head cut off between the soldiers and the fields. He spies a resting TRUMPET PLAYER (who would have called the sound to battle.) LORD TENNANT Have you seen the Prince? Has anyone seen the Prince? Nearby, but out of Tennant’s view, is THE PRINCE OF WALES (20s) flushed cheeks, hungry to fight. He spies a nearby mounted English soldier. PRINCE OF WALES You, Sir. Get down here. The soldier dismounts, approaches. PRINCE OF WALES (CONT’D) I want to fight. Give me your horse. The soldier hands the reigns to the Prince.  3.",
      "characters": [],
      "action_text": "PRINCE OF WALES (CONT’D) And your helmet. The soldier removes his helmet. Tennant runs up, breathless. TENNANT (to Prince) My Lord, the king your father gave word that you are not to fight today. PRINCE OF WALES (scornful) I’ll be perfectly safe, we’re winning by miles. TENNANT (lowering his voice) You need not worry about reputation. Your father has his finest knight wearing your armour fighting on the front lines. By all accounts he’s doing very well. The Prince looks at Tennant impatiently. PRINCE OF WALES I don’t care. Father gets to fight. TENNANT Your father oversees his great army. He no longer risks his life. That would be irresponsible, my Lord. The Prince looks at the soldier, waiting, uncomfortable. PRINCE OF WALES Give me your helmet. Tennant moves between the Prince and the soldier. TENNANT As the heir apparent, my Lord, you are to wait back here under my watch. Your father has lost two sons and I need not remind you that these recent tragedies make you more precious in not only your father’s eyes but also in all of England’s. (to the soldier) Away with you, soldier. PRINCE OF WALES (to soldier) You will wait here. The soldier freezes, unsure what to do.  4. TENNANT (to soldier) I am the king’s representative in this matter. PRINCE OF WALES And I am me. And I want to fight. The Prince reaches for his sword - TENNANT You’re - - and slices off Tennant’s head. The soldier stares, hardly believing it. PRINCE OF WALES (to soldier) I asked for your helmet. The soldier hands the Prince his helmet. The Prince eyes Tennant on the ground. Looks back at the soldier. The soldier swallows, scared. The Prince grins. He likes scaring people. He puts on the helmet, jumps on the horse, and gallops, an expert horseman, around the cavalry until he can make his way into the action. He finds some Scotsmen to kill. He fights manfully, having the time of his life, whooping. EXT. FALKIRK, BATTLEFIELD, ENGLISH SIDE - CONTINUOUS 10   10  Edward hears the distant whoops. He’s irr",
      "dialogue_count": 0,
      "word_count": 2906
    },
    {
      "scene_number": 3,
      "slugline": "EXT. ENGLISH CAMP - DAY 23   23  A bloody, bruised and battered Robert, along with Angus, Chris, Comyn and their men, are pushed by English soldiers through the massive English military camp. Soldiers flock to jeer and spit at him. Robert takes in the passing weapons stores, blacksmiths, carpenters, and cooks serving the huge English army. He hears a woman’s scream   - looks over to see a SCOTTISH WOMAN being raped by a soldier. He struggles harder to be free, but - PRINCE OF WALES (O.C.) Hello, Robert. Robert looks over, surprised to see the Prince of Wales. The woman keeps screaming. PRINCE OF WALES (CONT’D) (cordially) What are you doing here? I thought you were with us? ROBERT No, I...I chose to side with the just. A weird conversation. They could be talking about soccer. PRINCE OF WALES Fair enough. Although now you’re losing. Probably not used to that, are you? (to soldiers) Robert used to spend his summers playing at Westminster when I was a boy. He was always so good at everything. ROBERT It just seemed that way because I was older. PRINCE OF WALES True. Now you and I would probably be more evenly matched. More screams in the background. ROBERT Could you...help that woman? PRINCE OF WALES No. She’s on the losing side too, silly. The Prince of Wales walks off. On Robert - knowing he’s dealing with madness. He looks up. From his POV we see, high on a hill, twenty gallows and twenty hanging Scottish Lords twisting in the wind.  15.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 259
    },
    {
      "scene_number": 4,
      "slugline": "INT. EDWARD’S TENT   - CONTINUOUS 24   24  Edward sits on a makeshift throne. EDWARD Bishop. Proceed with the petitioners. BISHOP WILLIAM LAMBERTON (37) nods as an AIDE escorts in an OLD WOMAN, who curtsies. OLD WOMAN Yer Majesty. Please gi’s oor laddie back. We cannae run the fairm wi’ nae brawn. Irritated, Edward stares at her, no clue what she’s saying. EDWARD Lamberton? LAMBERTON She’d like her son to be released from duty, Sire. To help her run her farm. EDWARD No. She’s led out. SIR JAMES DOUGLAS (21) enters. He’s intense, haunted. His whole life is trained on a single goal. Had he been born to different circumstances he would have been a man who avoided confrontation. That is not an option for him now. AIDE Sir James Douglas, sire -- JAMES -- Son of Sir William Douglas who died in the Tower of London, where you placed him, when I was thirteen. EDWARD Your father was a traitor who fought with William Wallace at Stirling Bridge. James blinks, forcing himself to stay in control. JAMES My father was the bravest man I ever knew. He died a free man in chains because he would not bend the knee to you. EDWARD A free man in chains. What sweet and silly stories your nursie’s been telling you.  16.",
      "characters": [],
      "action_text": "JAMES You gave our lands, our home, to the English Lord, Sir Richard Clifford. Now I’m of age, I’d like them back. EDWARD I’ll give you this. You have, possibly, the biggest balls in Scotland. Leave, before I have them removed. Lamberton, who is behind James, watches closely as James gropes for something in the back of his tunic. Lamberton steps forward, grabs James arm firmly. LAMBERTON Sire, forgive me, but I need a squire. Let this foolish hothead serve me. EDWARD I will provide you with a more suitable man. LAMBERTON Your Majesty, I baptized him. He’s no parents, no home. (softly) Each generation will tell a story. Better to win a whelp’s gratitude with mercy than earn hatred with hardened hearts and breed another rebel. The Prince enters. PRINCE OF WALES Father. Robert the Bruce is here. He’s with the losing side, can you believe? A beat. Edward nods at Lamberton, exits with his entourage. Lamberton hangs back with James. He removes a dagger from the back of James’ tunic. Before James can speak - LAMBERTON It wouldn’t have worked and you would be dead. EXT. ENGLISH CAMP - DAY 25   25  Edward stands over Robert in the mud. Nearby are Comyn and Robert and Comyn’s men, all prisoners now. The Prince, James, Lamberton and English soldiers stand and watch from various vantage points. James is tense, Lamberton works to appear neutral and the Prince of Wales watches with the same detached interest as when watching a solid tennis match.  17. EDWARD (to Robert) It brings me no pleasure to see you like this. Your father is a dear friend. As the soldiers here know, when you fight by a man in battle he becomes a brother. Your father saved my life many times in the great crusades, and I his. ROBERT I was raised to believe that you and my father were fighting a holy war in the east. I worshiped you both for it. But now I am all grown up. And now I suspect it was not a holy war at all but rather the king partaking in his favorite pass time. The hunt. The Prince of Wales mutter",
      "dialogue_count": 0,
      "word_count": 2176
    },
    {
      "scene_number": 5,
      "slugline": "INT. BRUCE CASTLE, MAIN HALL - NIGHT 33   33  MUSICIANS play as guests dance and laugh. Robert and Elizabeth sit at the centre of a table laden with exotic food. Robert watches their fathers toast each other. He smiles as he sees Margaret de Burgh making Marjorie laugh. Across the room, John Comyn lurks with other Lords and the Prince, clearly talking about Robert, shaking his head. ELIZABETH Do you enjoy music, my Lord? ROBERT Isabella was fond of it. Elizabeth sighs. So Robert’s an asshole. Great. ELIZABETH And dancing? ROBERT My brother enjoys it greatly. Euan! Euan comes to the table. ROBERT (CONT’D) A dance with your new sister-in- law? EUAN Of course. My Lady? Elizabeth gets up to dance. Robert walks through the room, passing several other Knights, including FITZALAN - sour- looking, older, and LENNOX - muscular, noble. FITZALAN Congratulations, Bruce. Quite a prize. LENNOX This must make you the biggest landowner in the country, Robert. Submission’s not all bad. ROBERT (sharp) Aye, well you should know. Comyn approaches, takes Robert aside. COMYN (warm, intimate) Word of advice Robert. Play your part for now. There’s so few we can trust. Robert nods. Good advice.  26.",
      "characters": [],
      "action_text": "COMYN (CONT’D) Why did Angus leave? Dear friends are obliged to stay at weddings until the bitter end. Robert whispers to Comyn. Comyn grins, slaps Robert on the back. COMYN (CONT’D) (beaming, loud, code) Oh happy day, indeed. INT. BRUCE CASTLE, MAIN HALL - NIGHT 34   34  The assembled throng cheer as Robert leads his bride away up the stairs. They do their best to smile gracefully. INT.   BRUCE CASTLE, HALLWAY - NIGHT 35   35  Elizabeth and Robert approach the bed chambers. She's skittish, dreading this. ELIZABETH It's been a long and tiring day, my Lord. Robert opens the door to reveal a beautifully-appointed room, a nightdress laid on the bed. Elizabeth stares. ROBERT Yes it has. And you have been most gracious. ELIZABETH Your first wife, she’s buried here? A shadow falls over Robert’s face. ROBERT She is, yes. ELIZABETH I’m so sorry. ROBERT It was five years ago now. I must thank you - for enduring what you had to tonight. And I am grateful for your sensitivity in this...charade. We are being forced to play politics. As you get to know me you will learn that I hate politics. She's surprised at his frankness and his courtesy.  27. ROBERT (CONT’D) We should, however, continue our act, for the sake of safety. Do you agree? ELIZABETH Of course. They stare at each other. This is weird. ROBERT Sleep well. Robert walks away, leaving her relieved and surprised. INT. BRUCE CASTLE, ROBERT’S QUARTERS - DAY 36   36  A blast from a hunting horn, wakes Robert brutally. He bolts upright, Faolan curled beside him, barking now. Standing over him is the Prince with a horn in his hand, grinning as he pats the dog. PRINCE OF WALES Robert, you’ve got the wrong bitch in your bed! ROBERT What do you want? PRINCE OF WALES A good wedding must always be followed with a hunt! Robert grits his teeth. Faolan growls. EXT. BRUCE CASTLE, COURTYARD - DAY 37   37  Robert mounts his horse, carrying bow and arrows. ROBERT Forest or moor? PRINCE OF WALES Selkirk Forest. Guess our prey. (a beat) Wal",
      "dialogue_count": 0,
      "word_count": 607
    },
    {
      "scene_number": 6,
      "slugline": "EXT. HILL OVERLOOKING SELKIRK FOREST - DAY 38   38  The Prince and Robert look at the thick woods. A thudding of hooves. Comyn rides up with two of his MEN. PRINCE OF WALES I’m afraid Comyn rather has the edge on you for the crown now, Robert. It was his spies that tipped us off. Robert stares at Comyn. Ice.   You’re a traitor?   Comyn stares back defiantly. COMYN Your Royal Highness, my scout says he’s in the south near the river. PRINCE OF WALES (to Robert) If you’re the one who catches him, that will probably even things out. He gallops into the forest. Comyn follows. Then Robert. EXT. FOREST CLEARING/FOREST - DAY 39   39  Deep within the bowels of the huge forest, in a dark and hidden clearing, Robert comes upon the remains of a fire. A twig snaps. He turns to find Wallace, a filthy bag of bones now, and three of his feral MEN. Robert’s face registers shock at their physical state. ROBERT William, my God. WALLACE MAN 1 -- Just kill him! He’s a lackey of the king! One of the men moves to Robert, his dagger out. ROBERT (to Wallace) You must flee. They’re coming for you. WALLACE They will catch me. Our horses are gone. Robert dismounts. ROBERT Take mine. INTERCUT:  29.",
      "characters": [],
      "action_text": "IN THE FOREST: A SOLDIER glimpses the figures in the clearing. He waves the soldier closest to him, pointing. IN THE CLEARING: ROBERT (CONT’D) Gather your strength. We’ll wage war on Edward together - when the time is right. WALLACE You will. I’ve not much fight left in me. Suddenly, several SOLDIERS emerge from behind Robert. Robert and Wallace’s eyes meet. Robert nods. A spark lights in Wallace’s eye. He and Robert wheel round, lightning swords flash as they fell the soldiers. One of Wallace’s men falls. A soldier screams. SOLDIER They’re here! They’re -- Wallace runs him through while the Prince, Comyn and other men charge towards the clearing. Robert grabs Wallace. ROBERT Try to get to Islay. We’ll regroup there.   Angus MacDonald’s men will hide you. God be with you. Wallace vanishes into the trees. Seconds later, the Prince and his men rush in, swords drawn. They see Robert bent over, panting, with seven dead soldiers at his feet. ROBERT (CONT’D) There were thirty, forty even. They ambushed us. Took my horse. PRINCE OF WALES And they didn’t kill you? Robert indicates Wallace’s dead man. ROBERT Well, he tried. Sire. A beat. Will the Prince believe Robert? PRINCE OF WALES So far, you have drawn the first blood, Robert. That’s to be commended. Comyn rolls his eyes. PRINCE OF WALES (CONT'D) And it’s not over yet! Let’s get the bastards, once and for all!  30. He races off, his men follow. Just Robert and Comyn now, staring at each other, hatred between them now. ROBERT Why would you want Wallace dead? COMYN It is more efficient for me to become king if Edward simply offers me the title. ROBERT Edward will only crown someone prepared to be a king in name only. It is Edward who would make every decision and he would make those decisions to serve his interests only. A beat. Comyn shrugs. Fine with him. COMYN I would be king. I have a claim. Oppose me and Edward and his son will know that the horse they will find Wallace on is your horse, with your saddle, your stirru",
      "dialogue_count": 0,
      "word_count": 2666
    },
    {
      "scene_number": 7,
      "slugline": "INT. BRUCE CASTLE, HALLWAY - CONTINUOUS 54   54  Elizabeth marches towards Robert’s room. Two servants, a man and woman, rise. ELIZABETH I don’t need anything, thank you. The servants smirk. Sex is about to happen. SERVANT (to the other) Finally... INT. BRUCE CASTLE, ROBERT’S QUARTERS - CONTINUOUS 55   55  Elizabeth enters. Robert is asleep. ELIZABETH Robert. Robert! And now he’s awake and surprised. Before he can say anything - ELIZABETH (CONT’D) In a certain sense, I know very little of the world. I’ve fought no battles, I’ve sat at no tables where great decisions were made. But I have watched men rise and fall in my father’s favor and in the king’s favor and I have drawn conclusions of my own about the nature of power. ROBERT (where’s this going?) All right... ELIZABETH Power is making decisions. Power is not allowing yourself to be buffeted on the tides of history but instead choosing a boat and climbing aboard and hoisting the sail. Robert is struck by the wisdom of this. ELIZABETH (CONT’D) I choose you and whatever course you are charting. I choose you. Robert nods. Elizabeth is satisfied that she has delivered her message effectively. She exits. INT. BRUCE CASTLE, HALLWAY - CONTINUOUS 56   56  Elizabeth sweeps past the servants.  41.",
      "characters": [],
      "action_text": "SERVANT (to the other) That was quick... INT. BRUCE CASTLE, GREAT HALL - DAY 57   57  Robert and Elizabeth eat. Angus and Chris enter. Chris waits by the door, Angus approaches, whispers in Robert’s ear. Robert listens. He feels Elizabeth’s curious eyes on him. Given the night before, he decides she can be trusted. ROBERT (to Elizabeth) Lord Comyn is in Dumfries and has agreed to meet with me regarding the future of the country. (beat) I will offer him land and money to give up his claim to the throne. Elizabeth takes this in. ELIZABETH What if chooses the title over your riches? ROBERT Our riches. Angus raises his eyebrows. These two seem to be getting along. CHRIS He won’t. ANGUS What he’ll do is strike a hard bargain. The two of you could be the poorest king and queen that ever lived. CHRIS Comyn is a greedy bugger. ROBERT (to Angus) Please don’t use language like - ELIZABETH Do the English know that you are to negotiate with Lord Comyn? ROBERT They do not. ELIZABETH What makes you think they will honor any Islaygement you come to?  42. ANGUS We’re trying to get the Pope on Robert’s side, my lady. And we’re hopeful. If the Pope comes around, then the English will back off. ELIZABETH And if the Pope does not “come around.” ROBERT Civil War. Elizabeth nods. Good to know. Got it. ELIZABETH Travel safely. EXT. BRUCE CASTLE - DAY 58   58  Robert, Angus and Chris ride off. ANGUS (to Robert) Feels good to have the love of a good woman again, doesn’t it, laddie? Feels good to rest that troubled brow of yours on those milky, jaunty breasts. ROBERT (trying not to smile) Enough. ANGUS I’m happy for you. You mourned too long. ROBERT It was not a real marriage. She was forced and I’m not taking advantage of that. ANGUS Are you serious, man? Robert is serious. Angus guffaws, spurs his horse to Chris. ANGUS (CONT’D) Chris! Chris! Listen to this. EXT. SCOTTISH BORDERS - DAY 59   59  Robert, Angus and Chris gallop across high, bleak moors, lightning flashing. A lonely figure awai",
      "dialogue_count": 0,
      "word_count": 2943
    },
    {
      "scene_number": 8,
      "slugline": "EXT. BRUCE CASTLE, COURTYARD - DAY 74   74  Worried-looking tenants assemble as Elizabeth, Robert and Marjorie prepare to depart. An elderly servant holds Faolan while Marjorie bids him a tearful goodbye. MARJORIE Please can we take him? Robert shakes his head. ELDERLY SERVANT Be safe, my lord. ROBERT (quietly to him) Get away from here as soon as possible. Edward’s men will be on your tail. NEIL (to Marjorie) Come on! On my back! I’ll be your horse. Marjorie climbs on. Neil trots her to the men: Chris, James, Euan and Alexander, and several lords, including Lennox, Fitzalan, and Lord Carlyle. Robert walks to his horse, pauses at Carlyle. ROBERT Thank you for joining us, Carlyle. I appreciate it. Carlyle nods. ANGUS (riding up) Let’s move out! Robert and Neil help Elizabeth and Marjorie into their carriage. The Bruce party start their journey. INT. PERTHSHIRE - DAY 75   75  The train moves northwards under a hot midday sun. Elizabeth cradles a sleeping Marjorie. Robert passes on his horse, offers her water to drink. He points into the distance. The town of Perth, its castle prominent. ROBERT That’s Perth. (his finger to the right) And that’s Scone. A smaller hamlet, barely visible. Elizabeth looks concerned. ROBERT (CONT’D) Rest easy. We’ll pass right under his nose.  54.",
      "characters": [],
      "action_text": "They move on. INT. PRIVATE CHAMBER, WESTMINSTER PALACE - DAY 76   76  The Prince is being dressed by SERVANTS in a suit of shining jet black armour. Edward watches. EDWARD I don’t want you to be just like me. Be better than me. PRINCE OF WALES (casually) I asked my servant here, Jacko, to grab you by the neck and hold you immobile as you have had Valence do to me so many times. I thought I would strike you in the face and get a taste of what it will be like to be king. JACKO is uncomfortable, keeps working. PRINCE OF WALES (CONT’D) Jacko refused. He is loyal to the crown. Of course that means when I am king staying alive will prove very precarious for him because I will not forget that he did not do what I asked. Jacko looks like he might vomit. Keeps working. EDWARD My son - PRINCE OF WALES I don’t need anyone to hold you down. The Prince strikes him in the jaw, the hardest punch he’s got, full of all the hate and love he has for his father. Edward rubs his jaw. PRINCE OF WALES (CONT’D) I decided years ago that when you hit me, I would never cry, I would never flinch, I wouldn’t give you the satisfaction of trying to rub the pain away. I’m stronger than you. And although you miss my brothers, one day you’ll realise that I am more intelligent and braver than the two of them put together ever were. Edward smiles, his teeth full of blood. EDWARD Get the Bruce and I’ll believe you.  55.",
      "dialogue_count": 0,
      "word_count": 489
    },
    {
      "scene_number": 9,
      "slugline": "EXT. WESTMINSTER PALACE, COURTYARD - DAY 77   77  The Prince walks in to greet his knights kneeling before him. He raises the DRAGON BANNER. PRINCE OF WALES When this flag is raised, there will be   no mercy, no quarter. No prisoners shall be taken. Robert Bruce is to be hounded from here to hell. Anyone calling him their king forfeits their right to decent death. Now, rise before us as knights. A deafening clatter of steel as THREE HUNDRED KNIGHTS in the same black armour rise to their feet in front of him. EXT. LONDON STREETS - DAY 78   78  Looking like they’ve ridden out of hell, the Prince and his dark mass of knights gallop forbiddingly towards the city gates. TOWNSPEOPLE stare in awe as they pass. EXT. CENTRAL LOWLANDS - NIGHT 79   79  Robert’s party moves silently under the shadow of English- occupied Perth Castle. Soldiers patrol the battlements. Robert dismounts, gesturing for the others to move on. He scans the dark mass of trees. Up ahead, James looks back. As Robert turns away, Buchan and SEVERAL ARMED MEN suddenly lunge out of the dark. Robert jumps aside, narrowly missing Buchan’s sword before turning and slashing one man’s throat, then dropping low and cutting the sword-hand off the second. Screams. Angus, James and Euan thunder into the fray, each taking on an armed man. James swings his sword expertly. Buchan is under pressure from Chris. He hacks his sword down but it’s blocked by Chris’s blade. With a second sword, Chris throws Buchan backwards, onto his knees. Chris is at his throat. Robert steps up. ROBERT Let him go. Stop. All of you. Reluctantly Chris lets Buchan go as the fighting ceases. ROBERT (CONT’D) Buchan, listen to me, what happened with Comyn was not -- BUCHAN -- God will show you no mercy, Bruce. Buchan runs into the dark with his remaining men.  56.",
      "characters": [],
      "action_text": "ROBERT I doubt we’ve seen the last of him. ALEXANDER Why spare him? ROBERT I can’t keep killing my own countrymen. The men return to the others. EXT. STABLES, PERTH - NIGHT 80   80  Armour is placed on hundreds of HORSES. EXT. SCONE ESTATE - NIGHT 81   81  Robert’s train comes to a stop in front of the ancient, imposing Scone abbey. Wishart hurries out. WISHART Come, we must hurry. Wishart and Clergy appears with two ceremonial robes. Elizabeth and Robert eye each other as the robes are draped around their shoulders. It’s both humbling and absurd. So much finery. Elizabeth takes Robert’s hand. ELIZABETH (whispers) Just think of it as our wedding, but for real this time. EXT. INNER COURTYARD, SCONE ABBEY   - NIGHT 82   82  Torches flicker in a decaying but beautiful court-yard. Robert and his party walk through the quiet abbey. They greet serious-looking LORDS, including SINCLAIR and MAR. ROBERT Lord Sinclair. Lord Mar. Thank you for your support. EXT. CEREMONIAL GROUND - NIGHT 83   83  Wishart produces a golden, jeweled crown from his cloak and places it on Robert’s head. Elizabeth smiles proudly. Wishart blesses Elizabeth. They take each other’s hands, and rise together, smiling. Just like newly-weds. Angus, Chris, Marjorie and his brothers watch, burning with pride. Robert catches Marjorie’s eye, pulls a ridiculous face. She giggles. The Lords looks askance. Not appropriate.  57.",
      "dialogue_count": 0,
      "word_count": 546
    },
    {
      "scene_number": 10,
      "slugline": "EXT. SCONE ABBEY - NIGHT 84   84  Robert walks out of the Abbey holding Elizabeth’s hand, his retinue following. Angus puts a hand on his shoulder. ANGUS Robert. Look there. Down the hill, a crowd of supporters has gathered, silently lifting their torches to show honour to their king and queen. Robert and Elizabeth are heartened. Robert raises his hand and bows. Elizabeth curtsies. ANGUS (CONT’D) It’s a good thing they’ve come. Valence men are assembling three miles from here, he has made a challenge. ROBERT How formal. Not his style. JAMES He knows we’re outnumbered. The English seek a very public defeat. ROBERT Alexander. Euan. His brothers approach. ROBERT (CONT’D) Ride down to those that hold the torches, recruit any man prepared to fight. Then ride on to the villages. Do the same. His brothers head away. CHRIS (to Robert) Let’s not reply. We can wait for more men, then launch a surprise attack. JAMES This is his first battle with the English as king. Better word spreads that he fought with all deference to the chivalric code and won because God is on our side, than we gain a dishonorable victory fought devil-cloaked in shadows. ROBERT (thinks, to Angus) Send a messenger back to Valence. Tell him I’ve been crowned king and we can meet tomorrow to agree terms. James nods, pleased.  58.",
      "characters": [],
      "action_text": "ANGUS Yes, Your Majesty. Robert glances at him, adjusting to his new title. EXT. SCONE ABBEY, ROBERT’S TENT, SCOTTISH CAMP - NIGHT 85   85  Robert and Elizabeth sit by the fire. He pours wine into a cup for her. ROBERT I couldn't find any goblets. ELIZABETH (drinks) Nor any decent wine. He laughs. They look at each other. Stirring of desire. ELIZABETH (CONT’D) Alas, we are but king and queen of the May, and the morning will come to strip us of our crowns. ROBERT No my queen, only death can do that. And we have too much to do to let that happen now. She hangs a crown of flowers on him. A quiet moment. Awareness of the gravity of recent events. Robert turns to look at the tents facing theirs. Angus, Chris and others outside one, Lamberton and James outside another. Robert gets to his feet. ROBERT (CONT’D) Shall we walk? EXT. FOREST - NIGHT 86   86  Elizabeth walks ahead of Robert through the willow trees, murmuring in the wind. He takes her hand. She stops, turns to face him. She kisses him. He pulls her to him, strokes her face. The kiss becomes passionate. EXT. FOREST - NIGHT 87   87  Post-coital, Elizabeth lies in Robert's arms. He stares up at the sky, knowing this is a fleeting moment. She laughs at the state they’re in, pulling leaves and twigs from her hair. He pulls her close again. EXT. FLAT GROUND - DAY 88   88  Valence and his generals stop before Robert, Angus, Chris and James and thirty of his men.  59. JAMES We fight for a sovereign nation, under the banner of King Robert the first. Valence looks up at the tatty royal banner. Then at Robert. VALENCE My men have had a long ride. As a knight of honour, Sir. Will you allow them the chance to rest before combat? ROBERT Very well. VALENCE You have my gratitude, Sir. May I suggest we commence at sunrise tomorrow? ROBERT Agreed. And you agree to surrender your castle when faced with defeat? VALENCE By my troth. They shake hands. Angus looks worried. As they ride away - ANGUS All very honorable and everything, b",
      "dialogue_count": 0,
      "word_count": 681
    },
    {
      "scene_number": 11,
      "slugline": "EXT. CAMP AMONGST TREES - NIGHT 90   90  James stands alone, practicing his sword skills. As he runs through imaginary Englishmen he hisses... JAMES Douglas! Douglas! Nearby, a SQUIRE feeds the campfire warming Robert and his knights as they confer. ROBERT At dawn, Angus, take the footsoldiers. Flanking your left will be Chris and Lennox. Fitzalan and Neil will move their men down to your right and come up behind. (to the exiting Squire) Thank you. (to Knights) Sinclair and Mar will hold the rear with Carlyle and James. James? He looks over to see James practising battle in the dark. NEIL (re James) My memory is that when he was a lad they said he was one for study not war. Look at him now. They all study James for a moment, so intent, now brilliant at an art not natural to him. Drew approaches. They look up. Yes? DREW I would fight by King’s side, if he’ll have me to protect him. Robert nods, moved. Drew is pleased. Heads off. The meeting continues. Robert heads after Drew. CHRIS (O.S) I will be heading straight for Valence himself. If he falls, his men will panic. EXT. SCOTTISH CAMP - MOMENTS LATER 91   91  Robert passes through the ranks. The men sit outside their tents by fires, sharpening spears, eating rations. He finds Drew sitting with some foot-soldiers, including ARCHIBALD, a bearded soldier, older than the others. Robert joins them. From his pocket, Archibald pulls out some knucklebones (medieval jacks).  61.",
      "characters": [],
      "action_text": "ARCHIBALD Who’s for a game of knucklebones? The men move closer, grinning. Robert takes off his ring. ROBERT The winner gets this ring. The ring bears the Bruce crest. Impressed, the men play. INT. ROBERT’S TENT - NIGHT 92   92  Robert enters the tent, to find Elizabeth telling Marjorie a bedtime story, stroking her head. ELIZABETH And brave Guinevere waited patiently many years to be reunited with her love... Marjorie’s asleep. Smiling, Robert lies down beside them, so that Marjorie’s in the middle. ROBERT Thank you for being so good with her. She adores you. ELIZABETH We must look after each other. There aren’t many of us ladies around. Suddenly, a sinister HIGH-PITCHED SOUND. Robert sits up. The sound again. ELIZABETH (CONT’D) What is it? ROBERT Wait! He looks out of the tent into the darkness. The sound a third time. It dawns on him. ROBERT (CONT’D) Stay with Marjorie. Don’t go anywhere. EXT. SCOTTISH CAMP - NIGHT 93   93  He runs to the nearby tents. Around him, his foot soldiers begin to awaken, panicking, as the arrows rain down. ROBERT Wake up! Quickly! Angus! Chris! Robert stops dead. Above their camp, standing silently, an immense black wall of Valence’s SOLDIERS. They lift their arms, pulling back their bows, aiming into the sky.  62. ROBERT (CONT’D) GET UP! ARCHERS! The men start to stir and panic. The sound comes again, the quiver of a hundred bow-strings on release. ROBERT (CONT’D) Take cover! Robert dives into his tent. INT. ROBERT’S TENT - NIGHT 94   94  Holding his shield up, Robert throws himself on top of the terrified Elizabeth and Marjorie. Several arrows smash through the tent and lodge in his shield. ROBERT Come with me now! He rushes them out, under cover of his shield. EXT. SCOTTISH CAMP - NIGHT 95   95  Another swarm of deadly arrows fly through the darkness and rain down on Robert’s men killing dozens instantly. EXT. ROBERT’S TENT - NIGHT 96   96  Using his shield to deflect arrows, Robert runs with Elizabeth and Marjorie, to ground out of",
      "dialogue_count": 0,
      "word_count": 2188
    },
    {
      "scene_number": 12,
      "slugline": "EXT. JETTY - SHORES OF LOCH - DAY 103   103  Robert’s forty men ride into a small settlement on the loch’s shores. As they pass, they notice a few VILLAGERS scurry into their houses and extinguish the lights, scared the new arrivals bring trouble. Angus scans the surrounding hills, sensing danger. He spies a man running out around the back of a house, riding off into the hills in haste. Robert looks out over the water. There’s a jetty and a small rowing boat. Angus and Robert share a look at the size of the meagre rowboat. ROBERT How long over land? JAMES Two days. Maybe more. ANGUS If we cross here, it means losing the horses. ROBERT We need the time more. EXT. SHORE OF LOCH - DAY 104   104  The rowboat holds eight men. James motions for Angus to go with Robert. ANGUS Robert, you must go first. Robert, Angus and Alexander wade out, get into the boat. Seven other men climb in, leaving thirty on the shore. Angus and Alexander start rowing. Dark clouds gather. Unseen by Robert several Highlander warriors appear on the brow of the hill above the Loch. EXT. FAR SIDE OF LOCH - DAY 105   105  Robert leaps out into the waist-high water with the others, struggling to reach the shore. Alexander and Angus start rowing back for more of their men. ROBERT As fast as you can, men! Robert struggles ashore, looks back at the crossing and sees a swarm of Highlanders rushing down the hills towards the loch, unseen by Alexander and Angus as they’re facing the wrong way. He looks around, spots a second, smaller rowing boat, pushes it into the loch, starts rowing furiously back.  70.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 288
    },
    {
      "scene_number": 13,
      "slugline": "EXT. NEAR SIDE OF LOCH - DAY 106   106  James catches sight of the Highlanders running down the hill. JAMES Into the water! Into the water! Alexander and the men rush into the water of the loch and start swimming. They gasp at the shock of the cold water. EXT. LOCH - DAY. 107   107  Spears fly towards the boats. Some of the men cannot swim. Robert, Alexander and Angus pull as many on board as they can including James, Drew and several others. As Robert turns around, Alexander is hit in the chest by a spear and killed instantly. Euan grabs him and tries to shake him alive. More men grab hold of the boat’s side. A frantic scrabble to save one another. To make room for his men Robert has to pull Euan away from his dead brother. The Highlanders descend into the water with their spears poised. Out of his mind, Robert screams at the men. ROBERT For God’s sake ROW! Come on, men, row! More spears descend relentlessly on the overflowing boats as they sail out of the Highlanders’ reach. Robert looks back at Alexander amongst the dead, floating away in the dark water, bereft. Euan rows for his life, tears pouring down his face. EXT. MIDDLE OF LOCH - DAY 108   108  Angus’ boat slightly ahead, Robert, James and Euan heave on the oars, aware of the men in the freezing water; teeth chattering, eyes going blank. Once out of range of the arrows, Robert stops rowing and jumps into the water to help save the dying men. James helps to pull the worst cases on board. EXT. FAR SIDE OF LOCH - DAY 109   109  Robert’s exhausted men land on the shore. He drags a shivering MAN out of the water. ROBERT Huddle together. He pulls off his woollen tunic and wraps the man in it. The other men do the same. Robert directs the men to huddle in a large circle, the soaked men in the middle, the dry men on the outside, using their bodies to keep the men warm. Slowly, colour and life returns to the men.  71.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 358
    },
    {
      "scene_number": 14,
      "slugline": "EXT. BAY - ISLAY   - DAY 110   110  Robert, his arm around Euan, heads up the beach towards ANGUS’ with his bedraggled men. Angus’ WIFE and several CLANSMEN run to greet them. Tears of joy as she sees her husband alive. INT. PERTH CASTLE, COURTYARD - DAY 111   111  Valence and his men at attention. The Prince removes his helmet. The black knights stare at Valence unnervingly. PRINCE OF WALES You did not wait for me, you attacked by night. You outnumbered him, you had the element of surprise. And yet you lost him. What is it, I wonder, that my father sees in you? The Prince pokes his sword into Valence’s neck. PRINCE OF WALES (CONT’D) How does it feel to lead an army and yet know that same army standing behind you now would watch me take your life and do nothing? VALENCE (very uncomfortable) I have helped bring Scotland to her knees. There will always be rogue elements, they are nothing. PRINCE OF WALES Rogue elements? He calls himself king. VALENCE He is a deluded soul who, thanks to you can never come home again. He will die friendless, an outlaw and a joke. The Prince responds well to flattery. He lowers his sword. PRINCE OF WALES Do you even know where he was heading? VALENCE West. I’m sure of it. PRINCE OF WALES West, your Highness. A few HORSEMEN approach. They’re challenged by SOLDIERS. VALENCE It’s Buchan. Comyn’s nephew.  72.",
      "characters": [],
      "action_text": "PRINCE OF WALES (to Valence, not letting it go) West, your Highness, West your Highness, West your Highness. VALENCE West, your highness. Buchan’s brought before the Prince. BUCHAN (bowing) Your Highness. The Prince of Wales smiles. Nods at Valence. See? PRINCE OF WALES Do you bring news of the Bruce? BUCHAN No, your Highness. (beat) His wife and child. INT.   KILDRUMMY CASTLE, ELIZABETH’S QUARTERS - NIGHT 112   112  Elizabeth and Marjorie lie asleep in bed. A noise from outside then footsteps outside her chambers. Neil rushes into their room. NEIL Quickly, Army approaching! Neil stares from the window as the army gathers outside the front of the castle as Marjorie and Elizabeth dress hurriedly. Once they’re ready they follow Neil out. INT. KILDRUMMY CASTLE - NIGHT 113   113  Marjorie and Elizabeth follow Neil down some back stairs and through a secret passage. They arrive at an exit. NEIL Get to the trees, I’ll send horses and men. God be with you. Elizabeth and Marjorie run for the trees. EXT. BATTLEMENTS, KILDRUMMY CASTLE - NIGHT 114   114  Lord Fraser looks down at the Prince, with Buchan and Valence beside him. A warning shot of flaming arrows are shot over the castle walls.  73. PRINCE OF WALES Lord Fraser! I know you have the Bruce’s wife and daughter. Hand them over and I spare the castle. Several flaming arrows are shot over the castle walls. Neil runs in, approaches Fraser. NEIL They are gone, my Lord. FRASER (calling down) They are not here, Majesty. And this is a most unwelcome intrusion! INT. KILDRUMMY CASTLE, COURTYARD - NIGHT 115   115  Neil and Fraser stand in front of the Prince. The Prince is working hard and well at running the show. Buchan and Valence are nearby. PRINCE OF WALES Where’s your brother? NEIL Your Highness, I don’t know. PRINCE OF WALES I find that hard to believe. Where are his wife and daughter? NEIL They left for Turnberry on Tuesday. I was to join them there tomorrow. The Prince smirks. Valence’s soldiers drag Elizabeth and Marjo",
      "dialogue_count": 0,
      "word_count": 886
    },
    {
      "scene_number": 15,
      "slugline": "EXT. ISLAY - DAY 117   117  Robert watches GULLS swooping just above the ocean. Nearby, ISLANDERS dry seaweed on rocks, thread nets, catch crabs. Robert turns to see a COURIER approaching with Angus and James. They are grim-faced. Robert blinks, steeling himself. JAMES Kildrummy’s fallen. Every man massacred - Robert loses his mind. Literally in that second. He grabs Angus, ready to kill him - ROBERT My daughter! We’ve killed my daughter with this scheming! ANGUS She’s safe, man! She’s safe! Robert falls to his knees, hides his head. JAMES Elizabeth and Marjorie have been taken by the Prince. Robert cannot speak. EXT. ISLAY - LATER 118   118  Robert’s eyes are red. He and James look out over the water. JAMES We cannot march to England before we’ve conquered the hearts of the Scots. We should sail to Clan Maclean on Mull first. Then Mackenzie. Then MacKinnon on Skye, although he can be a stubborn bugger. ROBERT I’m sure they will join us. They’re tough and proud. We’ve nothing to lose and nor do they. We’ll sail to Mull at first light. JAMES Another day to wait. ROBERT Time to study and plan. Scotland, has a king, yes - but what it needs now is a general. Robert looks at the sea, sees a sailing ship.  76.",
      "characters": [
        "ROBERT"
      ],
      "action_text": "If I were able to confess and was reminded of Christ’s generosity and mercy then perhaps, after, you and I could enjoy each other without shame, without sin. GUARD How would you confess? ELIZABETH Well, I’d need to see a clergyman. GUARD The Prince says no visitors. ELIZABETH But you can sneak in a clergyman. I believe Bishop Lamberton would not betray our secret. GUARD Lamberton? ELIZABETH He is discreet. Send for him. And then afterwards, you and I can enjoy each other more fully. The Guard nods, confused but willing. He kisses her. Exits. Elizabeth sits by the sleeping child. Traumatized. Strong. ELIZABETH (CONT’D) (muttering to herself) I’ll get you out, my darling. I’ll get you out. EXT. SCOTTISH BEACH - DAY 122   122  Robert and his men are pushing out the boat when a MESSENGER approaches. Angus, James and Euan watch curiously as Robert runs towards him. They watch as Robert consults with the messenger, appears to have an emotional moment. He collects himself. Heads back. ROBERT Lamberton has had Marjorie removed to a convent. And Elizabeth’s parents are petitioning the king for her release. The men are relieved, happy for Robert. JAMES The king and de Burgh are close. He will grant the request, annul the marriage to save face. ANGUS She had you pegged as trouble the first time she laid eyes on you. She’ll be glad to be rid of you.  78.  ELIZABETH (CONT’D) EUAN Perhaps there’ll be more good news by the end of the day. It would be nice to get at least one of these Lords on side. ANGUS Aye, maybe MacKinnon’s the one. On Robert, hopeful. They push their boats into the water. INT. CASTLE, ISLE OF SKYE - NIGHT 123   123  Lord MacKinnon, wizened and wise, looks sadly at Robert. MACKINNON You can’t do it, my Lord. JAMES (dangerously) He is your king. MacKinnon silently acknowledges this. MACKINNON You have won not a single battle. I stood with Wallace. Where were you then, my noble sir? ROBERT Wallace inspired me too, that’s why I’m here. MACKINNON You’ve never faced",
      "dialogue_count": 1,
      "word_count": 1277
    },
    {
      "scene_number": 16,
      "slugline": "EXT. DECK OF BOAT - NIGHT 126   126  Sunset. Robert and James stand on the prow as his men row towards the mainland. Robert looks across at several other wooden boats transporting his men across the sea. Angus and Euan head another boat. EXT. BEACH, SEA COAST - NIGHT 127   127  Robert jumps ashore, the men following. Robert’s eyes scan the dark treeline as the men pull the boats into the trees. Suddenly a group of ten English soldiers appear, and give chase. Angus and three knights hold them back, allowing Robert and the rest of the men to escape into the trees. The English soldiers are cut down by Angus and his men, acting together. The other Scottish boats arrive, the men quickly running up the beach and into the woods. EXT. COUNTRYSIDE - NIGHT 128   128  English soldiers steer two wagons full of provisions towards a castle. As they turn a bend they find the path obstructed with branches and have to stop. From behind the branches Robert appears. The driver of the first carriage suddenly finds James beside him, holding a dagger. EXT. A CASTLE - NIGHT 129   129  The two wagons pull up in front of the closed gates. A GUARD steps out to question them. ROBERT Corn for the stores. The guard opens the gate and several soldiers approach. On Robert’s signal, Angus and his men emerge from the corn and ride inside with the wagons, as more men jump from the second wagon and fan out through the castle like a spider’s web, stealthily fighting and killing guards as they go. They light flaming arrows and set the castle alight. EXT. COUNTRYSIDE - MOMENTS LATER 130   130  Robert stares at the flames of the burning castle in the distance. James approaches. ROBERT I hate to burn a man’s house but we haven’t the men to hold it. JAMES My father’s castle is a day’s ride.  82.",
      "characters": [],
      "action_text": "ROBERT And very well-defended. We said our revenge can wait, James. JAMES I can’t wait. ROBERT We must take Perth. JAMES I can’t wait. Robert accepts that James needs to do this. JAMES (CONT’D) You go to Perth.   I need but five men. ROBERT Be safe. I need you with us, James Douglas. You are my brother now. INT. SOUTHERN PRISON - WARDEN’S OFFICE - DAY 131   131  Elizabeth is dragged in, thin, in thread-bare clothes. Visible relief as she sees her father, mother and Lamberton. They are shocked by her appearance which stands in stark contrast to their finery. Elizabeth looks down at her rags and giggles. The world has become insane. The Prince enters. PRINCE OF WALES The only reason you're alive is because of your father's loyalty to my father. Understood? MARGARET DE BURGH (quickly) And we are grateful, Sire. PRINCE OF WALES (to Elizabeth) Give up the title of 'Queen of Scotland’ and you're free. The marriage will be annulled. Lamberton passes her a parchment. He smiles at her encouragingly. Elizabeth hesitates. PRINCE OF WALES (CONT’D) Sign it quickly or you’ll be a widow-woman. (to de Burgh) Valence is flooding the South West, Robert’s raids are becoming tiresome. ELIZABETH His raids?  83. RICHARD DE BURGH Sign. Your pitiful union was a charade and now it is over. Elizabeth steps back. Her mother is worried. MARGARET DE BURGH Sign it, Elizabeth, please. Elizabeth hangs her head. She will not. RICHARD DE BURGH (baffled) Why? Elizabeth’s mother closes her eyes for a moment, overcome by horror and grief. She sees it all. Elizabeth loves Robert. This love may kill her. EXT. DOUGLAS CASTLE - DAY 132   132  James and Drew crawl and survey the castle. On the battlements, GUARDS keep watch. James never takes his eyes off his family’s home as he says - JAMES I watched once from that window my mother and father in the courtyard and my father whispered something in my mother’s ear and I don’t know what he said but it must have been very funny because she couldn’t stop laughin",
      "dialogue_count": 0,
      "word_count": 784
    },
    {
      "scene_number": 17,
      "slugline": "INT. DOUGLAS CASTLE, MASTER BEDROOM - NIGHT 136   136  James approaches the sleeping LORD CLIFFORD. His WIFE asleep beside him. He takes a moment to let it sink in - his dreams are about to become reality. JAMES Lord Clifford? Your Lordship? Clifford rolls over but is still sleeping. JAMES (CONT’D) You’re sleeping in my father’s bed, while his head rests on London Bridge. I am James Douglas, son of Sir William Douglas. Wake up man. Clifford wakes with a start. JAMES (CONT’D) I could never kill a man in his sleep. James pushes his dagger into his neck. Clifford’s wife wakes now - and screams. JAMES (CONT’D) This is my mother’s bed. Get up. Clifford’s wife runs terrified from the room. James screams, finally able to lose all control. JAMES (CONT’D) RUN! RUN! THIS IS MY MOTHER’S BED! INT. DOUGLAS CASTLE, GRAND HALLWAY - NIGHT 137   137  James holds a flaming torch. He looks around his childhood home for a moment before holding the torch to a curtain to ignite it. The flames spread. He strides out. EXT. FIELDS BEYOND DOUGLAS CASTLE - NIGHT 138   138  James and his men ride from the burning castle. A few soldiers give chase. James stops in his tracks and turns. He gallops towards them, two swords drawn. JAMES DOUGLAS! DOUGLAS! The Scots watch as James slaughters the soldiers, screaming his family name. Drew and Sinclair exchange looks. A solemn moment. The glory and horror of vengeance.  85.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 246
    },
    {
      "scene_number": 18,
      "slugline": "EXT. ROWALLAN CASTLE, COURTYARD - DAY 139   139  Another stronghold overcome, its English soldiers roped together to one side. Robert watches his men carry much- needed supplies from the castle larder. ROBERT Keep half of that. Give the rest to them. He nods at the starving TENANTS looking on. James rides up with his men. JAMES (joking) Word is about, that the Bruce has taken ten castles! They can’t count, these English folk - we’ve only taken the five. Robert looks at James, relieved, but notices a slight change in James now he’s had his revenge. Euan appears from inside the castle, with him three French KNIGHTS blinking in the sunlight. They have no armour, they are filthy. They’ve been in prison a long time. EUAN These gentlemen of France were being held here. They request to join us. Robert studies the malnourished warriors. ROBERT The French are always welcome. Get yourself some armour. He nods at the roped English soldiers. The French walk to the English, pick some helmets from off their heads, try them on for size. The French swap helmets with each other. At last, the perfect fit. The English soldiers look on. What is happening? A young tenant approaches Robert. LAD Is it true you’re the King of Scotland? Robert smiles, acknowledges. He looks over to see that many of the tenants are kneeling in acknowledgment of his title. LAD (CONT’D) Will you make me a knight? The boy kneels. Robert takes his sword, rests it on the boys shoulder. ROBERT I dub thee lord -?  86.",
      "characters": [],
      "action_text": "LAD Andrew. ROBERT Lord Andrew. Defender of Scotland. One of the English soldiers watches this. Very nervous. This is not good. EXT. PRISON, RAMPARTS - DAY 140   140  Elizabeth is led to a large WICKER CAGE chained to a swing gallows. A GUARD opens it and pushes her inside.   The cage is lifted clear and swung out one hundred feet from the ground. She screams as the basket plummets. The chain reaches its length, the cage juddering wildly as it stops in mid-air. As she dangles and swings she looks out. Beside her cage hangs another. Inside is a mound of clothes and bones being picked by crows through the iron bars. EXT. ARCHERY FIELD, WESTMINSTER PALACE - DAY 141   141  The king is there for target practise, the Prince and generals are briefing him. PRINCE OF WALES I think we should remove Valence from command. As he seems incapable of even finding the rebels. GENERAL Certainly that is an option. Edward’s aged, liver-spotted hand pulls back an arrow on the bow. His hand shakes. He decides not to take the shot. EDWARD This morning I rose, I performed my ablutions, I walked from bed chamber to the great room to meet with counsellors and on the way I stumbled. No reason. I simply lost my footing. No one is entirely sure how to respond to this information. GENERAL (helpfully) I lose my footing sometimes. Especially in the morning when the body is still waking up. EDWARD It was my hope to grow old and not die on the battlefield. But now I see the great danger of death by natural causes is that you may be lying in a bedchamber thinking of all that was left undone.  87. PRINCE OF WALES We’ll get him, father. It’s just a few castles. Edward doesn’t believe a word of it. EDWARD You were supposed to get him last time and you failed like everyone else. PRINCE OF WALES (peevish) Valence began without me. EDWARD (beat) What will he do next. (answering his own question) Next he will go back to the Lords. EXT. GREAT NORTHERN GLEN - DAY 142   142  Robert and his party ride. They are",
      "dialogue_count": 0,
      "word_count": 878
    },
    {
      "scene_number": 19,
      "slugline": "EXT. INVERNESS - DAY 145   145  Robert, Angus, James, Drew and FIVE SOLDIERS ride towards Inverness Castle. A small settlement off to one side. Robert notices how deserted it is. ANGUS Why’re we riding so far ahead of the men? ROBERT In case I was wrong and you were right. The drawbridge lowers. Abercrombie rides out with several knights. Robert watches them, suspiciously. ABERCROMBIE Welcome, your Majesty -- Suddenly, a YOUNG WOMAN tears out of a croft, yelling. YOUNG WOMAN The English are here, your Majesty! Abercrombie’s face darkens. One of his knights turns quick as a flash and fires an arrow into the young woman. ROBERT Traitor! Abercrombie grins horribly. Before an arrow hits him in the chest - fired by James. From the castle, a flash of steel. Valence rides out with a force of English knights and cavalry behind him. Robert and his men turn and flee. EXT. SCOTTISH HILL COUNTRY, INVERNESS - DAY 146   146  Valence, twenty knights and soldiers thunder after Robert’s small party. ROBERT To the forest! They turn their horses and head for the forest. Valence and his men give chase. EXT. FOREST - DAY 147   147  The forest is too dense to ride through. ROBERT Leave the horses! Separate! Robert and his men abandon the horses and run through the forest, dodging arrows before breaking from the trees.  90.",
      "characters": [],
      "action_text": "Angus leads half the men in another direction which helps take attention away from Robert and James. They sprint towards a steep, gorse-covered hill. EXT. SCOTTISH HILL COUNTRY - DAY 148   148  James watches the English charge behind them. There’s still plenty of them. Angus and his men are up the hill. JAMES They're not giving up. Robert squints up at the glen ahead of them. EXT. HIGHLAND GLEN - DAY 149   149  Robert scrambles up a steep path beside a raging burn, crouches low behind a boulder. On the other side of the burn, the English approach, lead by a TRACKER, a MacDougall Highlander. They look up to where Robert's hidden. MACDOUGALL TRACKER Up there. The gully. EXT. GLEN, THE BURN - DAY 150   150  The tracker scrambles up the north bank. Robert rises up at him, rams his spear into him, kicks his body backwards. It tumbles down to the burn below. Valence’s men scramble into position. Robert puts his shield on top of the boulder so that only his helmet peeks out Three English soldiers cross the burn, one after the other. Robert crouches low and takes out their legs. ENGLISH COMMANDER Archers! EXT. SUMMIT - DAY 151   151  James rejoins Angus and has marshalled the others to the summit. He turns back to help Robert. EXT. GLEN - DAY 152   152  Archers fire off a volley. Some lodge in Robert’s shield. The Commander gestures soldiers to climb up. Robert hacks off the shafts from the arrows, punctures the first soldier’s neck. Using the soldier as cover to prevent the archers firing, Robert retreats. The English archers fire forty arrows into the body of the soldier. ENGLISH COMMANDER For God's sake, get him!  91. Three knights on horseback lurch forwards. Robert reaches for his axe. James runs towards him yelling. He’s stopped as a volley of arrows rain down on Robert. EXT. HIGHLAND CRAGS - DAY 153   153  Bleeding badly, Robert is helped by James and his handful of men, to scramble across rocky outcrops. They stop. Robert has an arrow lodged in his thigh. He takes o",
      "dialogue_count": 0,
      "word_count": 768
    },
    {
      "scene_number": 20,
      "slugline": "EXT. GLEN - DAY 157   157  The troops and tracker are joined by Valence on horseback. Valence watches as Robert rises into view, with bow and arrow, arm shaking. VALENCE Get down! Valence’s men try to duck for cover but Robert’s too quick. Eyes welling up, Robert raises his bow. ROBERT Forgive me, boy. Robert releases the bow. Faolan drops dead, an arrow in his side. Robert looks heartbroken. EXT. FOREST SLOPE - DAY 158   158  Robert and James descend downwards. EXT. HIGHLAND GORGE - DAY 159   159  They emerge out of the forest. Below them, a towering gorge. Hundreds of feet below, a raging river. Downstream, the ominous crest of a massive waterfall. JAMES The fall will kill us. ROBERT Which one? JAMES (thinking) The second one. The English troops draw closer. Robert and James jump into the water below. Valence arrives with his troops. VALENCE After them! He kicks two soldiers over the edge. EXT. HIGHLAND RIVER GORGE - DAY 160   160  Their heads keep disappearing under the water as the current sweeps Robert and James along at speed, towards the treacherous sounding waterfall. Robert slams his axe into an overhanging branch. James grabs onto his legs. Valence’s two soldiers are swept past them. One of them bashes his head on a massive rock before both disappear over the waterfall. ROBERT Climb over me!  93.",
      "characters": [],
      "action_text": "The water rips James free. He too smashes into a rock, his body goes limp. ROBERT (CONT’D) James! He disappears over the waterfall. Robert drags himself out of the water and through the mud, panting, desperately looking for James. EXT. HIGHLAND WATERFALL - DAY 161   161  Robert stares into the raging pool at the drowned bodies of the two English soldiers. There’s no sign of James. Robert looks stricken, his body shaking. Above, but unable to see Robert, Valence and his remaining troops look down. Satisfied, the troops turn away. The Bruce is surely dead. Valence remains, scanning the water for any sign of life. Then, convinced, he too turns and walks away. EXT. UNDERGROWTH - NIGHT 162   162  Robert picks his way through a thick tangle of branches and roots. He comes to a clearing, the blackened remains of a fire. He scrabbles around but finds no food or water. Beyond though, he spots a black slit in the rocks. A cave. EXT. CAVE - NIGHT 163   163  Robert crawls inside. His body screams at the effort. Across his path, a large spider’s web. He takes it in for a moment, swipes at it, destroying it. Exhausted, he rests his head on the cool earth. EXT. PRISON, RAMPARTS - NIGHT 164   164  Elizabeth in the cage sings an old Scots lullaby to herself. In the corner is a bucket for her to relieve herself into. ELIZABETH  My babe on a curling green wave be they cradling La di vik, la di vik,  Ho-ro-la  Ho-ro little child, La na ban, la na ban Ho ro ei While the seagull and swan For thy cur-ach are caring la-na-ban, la-di-vik, la-divik Ho-ro-la  94.  (MORE) With his nets from the bay Will they father be faring La na ban, la na ban, ho ro la.  INT. THE CAVE - DAY 165   165  Robert opens his eyes and the first thing he sees is the spider’s web. The spider is rebuilding her web again. He closes his eyes, barely conscious. INT. CAVE - NIGHT 166   166  A full moon. A shaft of moonlight on a feverish Robert. He checks his wound, it’s angry and swollen. His eye’s caught by the spider s",
      "dialogue_count": 0,
      "word_count": 3257
    },
    {
      "scene_number": 21,
      "slugline": "EXT. ROYAL TENT - MOMENTS LATER 187   187  The Prince of Wales climbs on his father’s white horse and gallops like hell towards battle and victory. EXT. LOUDOUN HILL, ROBERT’S CAMP - DAY 188   188  Robert’s men gather round in full armour: Angus, James, and Euan flank him. Behind are Fitzalan, Mar, Lennox, and Mentieth. He uses a stick to outline the battleground and draws the two trench lines. He indicates the first line. ROBERT Lennox and Fitzalan. You take up position here, while Sinclair, Mar and Euan are here. (points to the second line) James you’re on the near-side, behind the trenches with the archers. Wait for my signal. Stay down until then. Angus, with me. A MESSENGER approaches Robert, whispers in his ear. Robert is taken aback. ROBERT (CONT’D) King Edward did not survive the journey. Serious faces brighten. But Robert is grim. It is his first moment of fear. EUAN This is good news! ROBERT I know from years spent at the palace in my youth that the Prince is a liar and a cheat and thinks nothing of cutting the tail off a cat. He is a different enemy. EXT. LOUDOUN HILL, ENGLISH CAMP - DAY 189   189  Valence looks up as the Prince of Wales arrives leading another thousand men. The two men approach. Valence bows low. PRINCE OF WALES The men were stationed in Edinburgh. VALENCE Majesty, I will incorporate them into our structure of attack. This will not take long. It is now three thousand against five hundred. Six English soldiers to every Scot.  106.",
      "characters": [],
      "action_text": "PRINCE OF WALES You do with your men as you wish. My strategy has rather more effective odds. It is one thousand English soldiers against a single man. He grins. Pleased with himself. And Valence too is impressed - and scared. VALENCE (a beat) May I kiss your ring, Sire? Valence drops to one knee. The Prince extends his hand. INT. ROBERT’S TENT - NIGHT 190   190  Robert lies awake. VOICE (O.C.) Scottish cunt. Whore. INT. PRISON, RAMPARTS - CONTINUOUS 191   191  Elizabeth, pale and thin, is awakened by something hitting the underside of the cage. VOICE (O.C.) Cunt! Scottish whore! She looks down. A group of laughing boys throwing stones at her. Elizabeth struggles to her feet. She picks up her piss- bucket, tips it onto their heads. The boys scream in disgust, run away. Elizabeth lies down again, shivering. Begins to pray. ELIZABETH Pater Noster, qui es in caelis, sanctificetur nomen tuum. INT. ROBERT’S TENT - CONTINUOUS 192   192  Robert is praying too. We hear their voices together, the two of them in the exact same place and so far away. ROBERT / ELIZABETH Adveniat regnum tuum. Fiat voluntas tua, sicut in caelo et in terra. EXT. LOUDOUN HILL, GRASSLAND - DAY 193   193  Robert, grim and determined, walks at the head of his army towards the mounds of earth. Behind Angus, three hundred of the men move to take up their positions.  107. Most go behind the mounds, with a thin line of soldiers lined up in front of them. Angus signals for them to hold. Looks to Robert. A flicker of doubt, then a bold and confident smile. EXT. LOUDOUN HILL, OPEN GROUND, ENGLISH SIDE - DAY 194   194  Valence looks confidently along his front line. Fifty armoured KNIGHTS. Thousands of CAVALRYMEN beyond them and behind, two hundred FOOTSOLDIERS. Valence pulls down his helmet as the army rumbles forward. Meanwhile the Prince is trying to get his father’s white horse to rear up. PRINCE OF WALES Up! Up! The horse refuses. EXT. LOUDOUN HILL, GRASSLAND - SCOTTISH SIDE - CONTINUOUS 195   195  The t",
      "dialogue_count": 0,
      "word_count": 1057
    },
    {
      "scene_number": 22,
      "slugline": "EXT. LOUDOUN HILL, GRASSLAND - SCOTTISH SIDE - DAY 200   200  Angus is directing his men, when he sees a huge English Knight gunning for Drew, sword raised. Angus throws his massive frame towards Drew, pushing him out of the way just as the English Knight descends. The sword finds a gap in Angus’ armour and strikes his leg. ANGUS Argh!!! Angus turns, bashes off the knight’s helmet and sinks his sword into his neck. Angus limps back into the fray. EXT. LOUDOUN HILL, GRASSLAND, ENGLISH SIDE - DAY 201   201  Valence brutally beats a Scottish Knight to the ground then turns to watch in horror as his men are routed. He looks around, trying to make a decision. What to do? EXT. LOUDOUN HILL, GRASSLAND, ENGLISH SIDE - CONTINUOUS 202   202  The Prince of Wales, now far from the bottleneck and initial point of entry, begins to cross the bog. PRINCE OF WALES Solid ground here! Solid ground! Many of his men follow him...and the Prince and the white horse sink into the mud. So too, do the men behind him. Furious, the Prince struggles off his saddle, heaves himself back towards dry land. EXT. LOUDOUN HILL, GRASSLAND, MIDDLE GROUND - CONTINUOUS 203   203  Drew fights, immensely successful with his axe - until - an English knight lances him. EXT. LOUDOUN HILL, GRASSLAND - ENGLISH SIDE 204   204  Fifty or so English soldiers finally make it across the bog. EXT. LOUDOUN HILL, GRASSLAND, SCOTTISH SIDE - CONTINUOUS 205   205  Robert sees several English soldiers racing towards him from the left and right. He begins to mow them down - effectively, but more keep coming. James races to his side. JAMES I have the left! The two men fight side by side. Euan joins them. And then Angus. A stream of English soldiers steadily fight for Robert, but none get near. Robert and his friends fighting for their lives with a passion and precision that is unbeatable.  110.",
      "characters": [],
      "action_text": "On the English side of the bog Valence stares. They are completely immersed in what they are doing, no overview of the battle at all - and then suddenly - - it stops. No more soldiers coming at them. A moment. The group look up. Finally a view of the battlefield. They are surrounded by English corpses. And - VALENCE RETREAT! He turns, rides away. ANGUS Robert, look!! They’re running! They’re running! Robert turns to watch as the massive English army run. Robert runs forward, his face full of vindication, triumph. EUAN We did it! We did it! The Scottish troops are screaming with victory. Robert stops suddenly. Sees Drew, lying dead at his feat. Robert forces his eyes from Drew’s corpse to the retreating English army, cheers, trying to focus on the joy of victory not the cost, not the loss. Then Robert’s eyes catch a sole figure on the English side. The Prince of Wales. Robert walks forward, runs now until the two men are on each side of the bog where the bottleneck allow for a crossing. Robert yells over - ROBERT Get a horse! Robert sees a riderless horse on his side, jumps on it. Prepares his weapon. The Prince of Wales sees the same thing. Runs to a horse, jumps onto his back. The Scottish army watch. The Prince gets his horse to rear up. He raises his sword - every inch the powerful warrior. A beat. He faces Robert, longing to fight him. Close on Robert, finally victorious, finally out in the open, ready, willing, able to fight. The Prince of Wales thinks and thinks. Then he turns tail and rides away. Robert briefly gives chase as the Scottish cheer. Robert pulls his horse up to a halt. ROBERT (CONT’D) Yes! You run! You run! You run now!  111. As the Prince rides, we see he is blinking away tears. The man at the beginning who wanted to fight isn’t as brave as he thought. He feels it with every inch of his being. We read:  Robert the Bruce went on to defeat the English in battle after battle.  Robert rides back, joins Angus, Euan and James, quietly instructs them t",
      "dialogue_count": 0,
      "word_count": 933
    }
  ]
}