{
  "slug": "overlord-2018",
  "title": "overlord",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 7,
  "characters_count": 0,
  "characters": [],
  "total_words": 25241,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. AIRFIELD - DEVONSHIRE, ENGLAND - NIGHT (JUNE, 1944) American boys, PARATROOPERS of the 82ND AIRBORNE, heading for death itself - eyes down, throats tight, no one talking - as they're   herded toward idling C-47's   on an English airstrip. Sgt. Rensin now stands at the CARGO DOOR of one of the C- 47's. On its nose is a drawing of a Betty Grable body and the words \"My Gal Val\". Rensin barks at us: JUMPMASTER RENSIN Let's move! Let's move! Keep up with your stick! SUPER: \" Slapton Sands, Uppottery England. June 5, 1944 \" THOUSANDS OF SOLDIERS marching toward HUNDREDS OF PLANES. Untested young men, here to save Europe from the Nazis - among them we find PFC. ED BOYCE. He's 24. And terrified. Boyce is from Des Moines, used to be a mechanic; his faith in God runs bone-deep. But he's just a boy, and he knows it. His face charcoaled black, his breaths shallow, he keeps pace with his \"stick\" - the 18 GUYS he'll be jumping with - each bearing 120 pounds of gear. It's nearly MIDNIGHT. They pass by BRITISH SOLDIERS of an ANTI-AIRCRAFT BATTERY who salute - a few of them   crying ; that gets Boyce's attention. He and his stick reach Rensin at the CARGO DOOR of that C-47. Every paratrooper needs to be pushed into the plane by fellow soldiers (the gear they carry is that heavy.) JUMPMASTER RENSIN (CONT'D) In! In! In! Let's go! We're dropping in on Herr Hitler this evening! Boyce arrives at the cargo door. The soldier who just climbed aboard in front of him turns with a confident grin: FORD Need a hand, Ed? Meet CPL. LEWIS FORD, offering his hand as if he were helping us onto a trolley on Main Street. Ford is 27, from Brooklyn, matinee-idol handsome, unshakable - even now. BOYCE Thanks, Lew. Ford is Boyce's idol, since Basic. Boyce takes his hand. Ford pulls. Two Soldiers behind Boyce push. Then:  2.",
      "characters": [],
      "action_text": "INT. C-47 - FUSELAGE - CONTINUING (NIGHT) Boyce takes his seat on a bench lining the fuselage wall - among a dozen SILENT PARATROOPERS, so wedged in that nobody can move, each man bearing that same 120 pounds of gear: They carry grenades, mines, rifles, .45's, TNT, bayonets, rations, main and emergency parachutes, musette bags. Ford, beside Boyce, checks Boyce's gear. Boyce pale with fear. FORD You okay? BOYCE Yeah. FORD Hey. This is what we came here for. (re: Boyce's gear) You're good. Me? Boyce checks Ford's gear - including the DETONATOR on Ford's belt - but they both know he's good to go. MORE PARATROOPERS board. Ford casually taps the shoulder of PFC. JULIAN ROSENFELD (from Oak Park, Illinois). FORD (CONT'D) Rosenfeld. Cigarettes for chocolate? Rosenfeld ponders it... as PFC TYLER GRIEB looks on, amused. GRIEB Ford, you must   love   chocolate. FORD It's to win over the locals. (to Rosenfeld:) Deal? ROSENFELD Sure. Done - cigarettes for chocolate. Boyce eyes them with wonder: \" How can you be so nonchalant?! We're about to DIE. \" Then-- A MEDIC stumbles clumsily aboard, his helmet falling off. This is D.F. GRUNAUER. He grabs the helmet, finds a seat... well aware that he's being stared at. By everyone. PFC. PETE GURKIN (23, from Houston) eyes Grunauer... then: GURKIN What happened to Briggs?  3. GRUNAUER He fell outside the PX, broke his ankle. So they reassigned me. Name's D.F. Grunauer. No one's saying, \"Welcome aboard!\" So Ford extends a hand: FORD Lew Ford. BOYCE Ed Boyce. Grunauer shakes their hands, gratefully. But PRIVATE LYLE TIBBET, (24, from Cincinnati,   an asshole ), chimes in: TIBBET Hold it, hold it. We're jumpin' with a Medic from the   JV team ? FORD It's okay. Just don't get shot. Some tight laughs, even from Grunauer. The whole stick is aboard now.   Jumpmaster Rensin climbs in   - shouting: JUMPMASTER RENSIN In your seats, Ladies. GRUNAUER What's our target, Sarge? JUMPMASTER RENSIN  Radio-jamming tower   on top of a church in Cielblanc. Got",
      "dialogue_count": 0,
      "word_count": 6432
    },
    {
      "scene_number": 2,
      "slugline": "EXT. OUTSIDE THE LESNER BARN - NIGHT Ford passes by a BARN beside Lesner's home, then heads up the Foothill, noting the GUARDS at the front gate of the church. They're SS, black uniforms and all. That gets his attention. EXT. FOREST - RESUMING (NIGHT) Boyce follows Tibbet toward a dark stretch of woods. CLICK- CLACK, CLICK-CLACK. No reply. Boyce tries again... This time, we hear a CHIRP IN REPLY. Maybe 50 yards away. BOYCE Tibbet. They turn. The sound came   from the foothill below the church . They head over, staying low to the ground. We TRACK THEM... EXT. WOODS/NEAR THE FOOTHILL - CONTINUING Boyce and Tibbet get to a patch of trees, and: TIBBET Flash. PFC. CHASE/PFC. PENNER Thunder. BOYCE Welcome. Chase, from our stick, emerges from behind a tree. Beside him is another paratrooper - PFC. PENNER. (Penner is new to us; he's got a FLAMETHROWER strapped to his back.) PFC. CHASE You see anybody else? BOYCE Just Ford. He's up the hill. PFC. CHASE This is Penner, five-oh-eighth, B- Company. Lost his whole stick. BOYCE What was your target, Penner? PFC. PENNER Radio-jammer on top of the church. BOYCE Ours too. But they got two captured G.I.'s inside.  29.",
      "characters": [],
      "action_text": "Shit. They study the CHURCH from here - vast, Gothic. TIBBET What else they got in there, vampires? Places give me the creeps. PFC. CHASE Let's move out. Just then, a NOISE - a RUMBLING SOUND coming this way. PFC. CHASE (CONT’D) Hold it. They HALT, and turn: it's a WEHRMACHT TRUCK, crossing pastureland,   its HEADLIGHTS just about to hit us . PFC. CHASE (CONT’D) Hit the dirt! Down they go, ready for a firefight. Here comes the TRUCK. But it TURNS RIGHT, toward the FOOTHILL. They watch it go. It bounces over a bump, KER-CHUNK, an item   nearly falling out of the back of the truck : A DEAD BODY. A fallen German soldier. This truck, they now see,   carries DOZENS OF THEM . Huh? The G.I.'s eye one another. The truck keeps going. Oddly, about 50 yards from here it begins to DESCEND, as if it'd just turned down a slope, or a ramp. PFC. CHASE (CONT’D) On me. Let's go. Hugging the tree-line, they follow the truck. Boyce notes the back of Penner's flamethrower. It says \"Hitler Hunter.\" EXT. CIELBLANC - FOOTHILL/CHURCH GATE - SAME (NIGHT) Ford reaches the top of the FOOTHILL on the SOUTH SIDE of the CHURCH. The RADIO-JAMMING TOWER looms above it. That GATE, 12 feet high, surrounds the grounds. Ford finds a nearby BRANCH... uses it to climb the gate... gets to the top of the gate, scans the grounds: At the FRONT GATE, those two SS GUARDS (PVT. KIEBEL and PVT. WAFNER) eye the skies anxiously. All those planes. Then the church's FRONT DOOR OPENS - a DOCTOR in a LABCOAT emerges:  30. DR. HUGO BRUEL,   the man we saw in that 16 mm. FILM . He's 50, passionate about Nazism, a taskmaster... But Wafner and Kiebel fail to come to attention; that tells Ford something. Bruel has an odd tic, a neck-twitch that often snaps his head to the left by an inch. It infuriates him, always has. He yells at Wafner and Kiebel, gesturing to the PLANES overhead. They answer mechanically, \" Nein, Herr Doktor. \" and \" Jawohl, Herr Doktor. \" Bruel tics again and storms back inside. EXT. FOOTHILL - NORTH S",
      "dialogue_count": 0,
      "word_count": 1361
    },
    {
      "scene_number": 3,
      "slugline": "EXT. BEHIND THE CHURCH GROUNDS - RIDGELINE - CONTINUING He lands hard. Another scream from the church fills the night. Ford starts to slink around the back of the church. EXT. OVERLOOKING THE EARTHEN RAMP - RESUMING KLAXON wailing. Boyce and Tibbet crouching low. From here they can see one of those SS GUARDS (PRIVATE RICHT) eyeing the remains of Chase in that field. The OTHER TWO SS GUARDS are in the cavern at the bottom of the RAMP. We hear a FIRE-HOSE, extinguishing the fire. Then... silence. The Klaxon is shut off. Only the searchlight remains. Pvt. Richt heads down the ramp. ...leaving Boyce and a very shaken Tibbet: BOYCE What the hell happened down there? TIBBET I don't know. I don't know! An SS guy, we put ten shots into him - he musta had body-armor on; guy just kept coming! He tore Penner apart! BOYCE What're you talking about? TIBBET I don't know! Chase gave the order to get outta there, I wasn't gonna argue. At the bottom of the ramp, the BLAST-DOORS close. Christ... BOYCE Let's go find Lew... EXT. OUTSIDE THE CHURCH GATE - RESUMING (NIGHT) Ford heads down the foothill, careful not to make a sound. Then a horrible SNAP - the slamming shut of metal on metal. He just stepped on one of Chloe's ANIMAL TRAPS. His ANKLE SHATTERED, that fast. Blinding pain. EXT. OUTSIDE CIELBLANC/ROAD 13 - LATER (NIGHT) Boyce and Tibbet reach the rendezvous site, that CRUMBLING WALL. The SEARCHLIGHT BEAM sweeps and scans. And there's no sign of Ford. Tibbet, shaken, masks it with rancor:  34.",
      "characters": [],
      "action_text": "TIBBET 4:10. Where's your buddy? Boyce doesn't know. He wishes he did... EXT. FOOTHILL - MOMENTS LATER Ford sits up, perspiring with pain. He grabs that TRAP, opens it, extricates his leg from it, the foot hanging limply. Fuck. He starts CRAWLING down the foothill now... EXT. OUTSIDE CIELBLANC/ROAD 13 - LATER NIGHT Still no Ford. Boyce eyes his watch again, anxiously... and: BOYCE He's in trouble. Let's go. TIBBET Orders were to stay here, remember? BOYCE Not if he's a half-hour late. TIBBET I got the ordnance. Guys carrying ordnance stay put. BOYCE Where'd ya read THAT? TIBBET You wanna risk your neck go ahead. I don't like the guy enough to get killed for him. Tibbet's not moving. Boyce backs away. EXT. CIELBLANC - BEHIND A SILO - LATER (NIGHT) Boyce looks behind a SILO. No Ford. Panic building. The SEARCHLIGHT sweeps past. Boyce moves on... EXT. CIELBLANC - BEHIND AN UNNAMED HOME - LATER (NIGHT) Boyce is walking, searching... Then he STOPS - just saw something at his feet that takes his breath away: The body of a DOG - bloody, dead... and HEADLESS. Just lying there on the ground, a headless canine. Good God. Who the hell would do that? And why? He's at a loss... until: MOTORCYCLE SOUNDS - startling him - followed by VOICES:  35. UNSEEN GERMAN VOICES (O.S.)  Hande hoch! Hande hoch!  Boyce instinctively puts his hands up... then turns - to see: HIS POV: the crumbling wall,   where Tibbet is   - SIX GERMAN SOLDIERS appear across the road, weapons aimed right at him. Boyce crouches down, his eyes peeled. The wall itself obscures our view - but Boyce can see those six Germans approach Tibbet... and his HANDS as they go up. ONE GERMAN takes Tibbet's rifle. Another offers him a smoke. A THIRD ONE FIRES AT HIM, POINT-BLANK. Goodbye, Tibbet. Boyce recoils, accidentally stumbling over the HEADLESS DOG, almost falling. That makes a noise. He FREEZES. The six Germans don't turn; they're too busy - throwing TIBBET'S BODY on the SIDECAR of a Zundapp motorcycle. One SOLDIER sta",
      "dialogue_count": 0,
      "word_count": 5125
    },
    {
      "scene_number": 4,
      "slugline": "INT. LAURENT HOME - ATTIC STEPS - CONTINUING Chloe's waiting at the bottom - which means she heard all this. Boyce reaches her, thinking she's about to say \"Good Luck\" or something. But instead-- --she KISSES him; there's an urgency to it, a desperation. Her eyes wet - she whispers into his ear: CHLOE Please,   please ... take me away from here. I can't stand it anymore. Boyce, his face flushed, can barely manage a half-nod. Chloe gathers herself... then opens the door-- INT. LAURENT HOME - GREAT ROOM - CONTINUING Chloe's family awaits. They note Boyce and his rifle... and for just a second, Boyce feels brave. A   liberator . Then: PAUL You go to die for us? Boyce deflates, just like that. Chloe reddening... BOYCE Your English needs some work, kid. CHLOE He meant \"fight\" for us. BOYCE Let's hope so. Chloe nods. Boyce goes out the back door. We STAY HERE - with Annelise, watching him go. Then: INTERCUT WITH/INT. LAURENT HOME - ATTIC - RESUMING Ford perches at that window,   DAWN just breaking -- INTERCUT WITH/EXT. BEHIND THE LAURENT HOME - SAME (DAWN) Boyce emerges, just as... A HUGE NOISE hits him - shaking the sky: HEAVY GUNS in the distance. Big ones. BOOM-BABOOM. Thunderous sounds-- And   Boyce knows where they're coming from : US Destroyers (and German pillboxes). It's now   June 6, 1944 . D-Day. His watch says 5:45. BOOM-BABOOM.  56.",
      "characters": [],
      "action_text": "BACK TO FORD - The GUNS of Normandy echoing up here, played off of Ford's face - steely, determined... BACK TO CHLOE AND HER FAMILY - They hear it too.   The Invasion!   There's hope in Chloe's eyes. Paul's too. Then-- Behind them,   Annelise   asks Guillaume to open the front door for her. He does so. Annelise steps outside. BACK TO BOYCE - He sends up a silent prayer, D-DAY POUNDING in the distance.   VERY LITTLE COVER between him and the church  - a few barns, that's all. He steels himself... BACK TO FORD - He looks out the window, trying to spot Boyce. Instead Ford sees: ON THE FOOTHILL - The SS Guards from the church emerge now, looking with FIELD-GLASSES toward the GUNS on the Coast. AND THE PEOPLE OF CIELBLANC - They too step out of their homes, awakened by the heavy guns. 50 PEOPLE IN ALL. Women, children, older folks, no men. A few of these people aren't   whole : an older man MISSING A LEG. A TEENAGER in a wheelchair. A LAME CHILD spasming in his mother's arms, his eyes milky white. Ford notes it all. Then, a surprise - visible right below this very window: Annelise walking to the center of the Square, minus one hand, both arms BLACK. But here she is, marching toward the well. The others regarding her in frightened silence... ...Ford watching, thrown, as: INTERCUT WITH/EXT. CIELBLANC - OUTSKIRTS - SAME Boyce ducking behind a barn. Every step is a danger. BACK TO THE TOWN SQUARE - Annelise stops at the well; every head turns. She's gruesome.   What's she doing out here?  Then, even stranger, she starts to sing. A LULLABY, her voice shaky.   Singing , in the middle of the square, odd as Hell: ANNELISE (FRENCH, SINGING)  Nous n'irons plus au bois/Les lauriers sont coupes ... BACK TO FORD - confused at first, then he gets it. BACK TO ANNELISE - People staring at her now - all wondering why this old woman is singing. Here's why:   She's turning all eyes in town onto herself .  57. BACK TO BOYCE - he gets it too. With the villagers distracted, he exits the town ",
      "dialogue_count": 0,
      "word_count": 2852
    },
    {
      "scene_number": 5,
      "slugline": "EXT. CIELBLANC - TOWN SQUARE - CONTINUING Keeping his eyes on that church, he crutches his way across the square - aiming for Lesner's barn... as: INT. CHURCH - BASEMENT/LAB - SAME Boyce awakens in this huge space. Looks around, disoriented. He's on an OPERATING TABLE -   his hands and feet tied to its legs.   A nearby SURGICAL TRAY bears a SCALPEL and SYRINGES. Around him are the   Villager-Creatures , tied to their beds, black tar being pumped through their veins by Autojectors-- ...black blood draining from them into bottles on the floor. Bed #3 remains toppled over, its patient still tied to it. The 25 GERMANS remain on their granite slabs across the lab. The GAS STOVE is on again, black blood boiling in a vial. Rosenfeld's bed is beside Boyce's. Their eyes meet. Then, a BANGING SOUND. Boyce turns: It's Bruel, using a MALLET to crush   TWO US-ARMY DETONATORS . Shit. Bruel drops the mallet and turns, twitching slightly - his eyes on Boyce... Then Bruel grabs a SYRINGE. Boyce braces himself. Bruel finds a VEIN in Boyce's arm. In goes the needle... Bruel drawing blood, as: BRUEL So, Private. Why are you here? Their eyes meet. Bruel's English is surprisingly unaccented. BRUEL (CONT'D) It's the invasion - and yet you're sent to this tiny village. Why? This was a mission? (Boyce is silent) You were obviously intending to blow up something, Private; we found four blocks of tetrytol on one of your fellow soldiers - and you and your Hebrew friend here were carrying detonators.   What was your target?  Again, no reply. Bruel produces the SS DEATH'S-HEAD DAGGER that Boyce found on the ramp, eyeing it fondly. Shit.  66.",
      "characters": [],
      "action_text": "BRUEL (CONT’D) The tower on the roof? Was that it? (Boyce is silent) Was it something else? Boyce just stares. We DRIFT DOWN to find his   right wrist , tied to that table-leg. There's a tiny bit of play in the knot. So Boyce wiggles it, as invisibly as possible, while: BRUEL (CONT’D) Were you perhaps sent to target   me?  This lab? He studies Boyce for a reaction. None. Then he grabs a CRANIOMETER (standard German phrenology instrument), and begins to measure Boyce's skull with it, as: BRUEL (CONT’D) Do you come from Nordic stock by any chance? Parents? Grandparents? Anyone in your bloodline Teutonic? We're always looking for candidates for our re-Germanization program. BOYCE (re: Villager-Creatures) Are   they   being re-Germanized too? At last, a response. Bruel breathes out a grin. BRUEL They are contributing to the war effort in ways you could hardly imagine. BOYCE How? BRUEL I'll ask the questions, if you don't mind. He tears Boyce's t-shirt away, lights his cigarette lighter. BRUEL (CONT’D) Again. Why are you here? He   puts the blade of the SS dagger into the flame . The DAGGER glows red. Boyce tries not to react. Impossible. BRUEL (CONT’D) It won't hurt, you know - telling me. But this...  67. Boyce prays for strength. Bruel grabs the CROSS hanging around Boyce's neck and YANKS IT FREE, tossing it away. BOYCE Why're you doing this? You're French. BRUEL Am I? BOYCE S'posed to be a doctor. BRUEL I am a   soldier   now! Ensuring the Thousand-Year Reich! Himmler's dug up half of Europe looking for the secret - and I've found it for him! BOYCE Secret to what? BRUEL History. He PRESSES THE RED-HOT BLADE FLAT ONTO BOYCE'S BELLY. Boyce howls - the pain unimaginable... BRUEL (CONT'D) WHAT WERE YOUR ORDERS!? WHAT WERE YOU TOLD ABOUT MY WORK HERE!? Boyce keeps praying, but Bruel does it again, red-hot steel onto bare flesh. Rosenfeld cringing at the sight... BRUEL (CONT'D) WHY ARE YOU HERE???? (Boyce crying) I'VE WON THE WAR FOR THEM, YOU UNDERSTAND? MY WORK! MY DISCO",
      "dialogue_count": 0,
      "word_count": 1698
    },
    {
      "scene_number": 6,
      "slugline": "EXT. CIELBLANC - TOWN SQUARE - SAME (MORNING) Ford hobbles through the empty Square, to the Laurent home. The sounds of D-DAY thumping in the distance... INT. LAURENT HOME - GREAT ROOM - RESUMING Boyce moves to the door, adrenaline rocketing through him. BOYCE Lew?! He throws it open, just as Ford hobbles in. Instant relief: BOYCE (CONT'D) Thank God. You don't-- Christ, what happened to your leg? FORD I got shot-- (at Chloe) --your friend with the truck. Then she turned to ash. Was something wrong with the ordnance? BOYCE Whaddaya mean she turned to ash-- FORD I mean she shriveled up like a piece of burnt confetti. BOYCE I don't-- FORD Yes or no? Was something wrong with the ordnance? They study one another, Ford all-business. BOYCE No. Nothin' wrong with it. FORD  Then why's that tower still standing?  That sounded angry. Truth is, Ford's just reeling. BOYCE I... I heard the gunfire, thought you might be in trouble.  73.",
      "characters": [],
      "action_text": "FORD For the   last   time, it doesn't fucking matter if I'm in trouble! The mission is the tower! When're ya gonna get it through that hayseed head of yours? That hurt, but Boyce doesn't fire back. He can't. Instead he just   heads up the attic steps . FORD (CONT'D) Where you going? BOYCE Got a couple questions for our prisoner. FORD It's 8:25 already. BOYCE I know what time it is. INT. LAURENT HOME - ATTIC - CONTINUING Boyce arrives, pulls out the SYRINGE he took from the lab - and a vial of BLACK BLOOD. He thrusts them at Wafner. BOYCE What does this stuff do? (Wafner's silent) That doctor said it was gonna ensure the Thousand-Year Reich. What was he talking about? Again, no reply. Boyce, rattled, puts a GUN to his head. BOYCE (CONT'D) You've got one minute. TALK. Pretty aggressive move. Ford and Chloe appear at the top of the steps. They haven't seen this side of Boyce before. BOYCE (CONT’D) What's the black blood for? WAFNER You saw it. Don't you know? Yes, Boyce knows - but he's silent. Wafner grins... FORD What's he talking about, Ed?  74. BOYCE I dunno; they got a dozen villagers in there - like her grandma, but worse - tied up, bleeding into bottles. The doctor injected some of the blood into a... (reluctantly...) ...dead guy. Wafner smiles a knowing smile. Ford eyes him... FORD Why would he do that? Wafner enjoying every second of this-- WAFNER You want a Thousand-Year Reich, you need a Thousand-Year Army. You see? That lands with a THUD. Boyce and Ford silent... A beat... trying to digest the idea. It goes down hard... WAFNER (CONT’D) It's been there for ages, you know. The tar. Ask her, she'll tell you. All we did was dig it up... FORD (at Chloe) You knew all this? All eyes on Chloe. She looks as lost as they are... CHLOE (dazed...) We heard stories about it, my whole life. The black river under the hill. But they were just stories... Silence - Ford and Boyce still processing all this... WAFNER Credit that doctor - there were so many failed attempts befo",
      "dialogue_count": 0,
      "word_count": 6938
    },
    {
      "scene_number": 7,
      "slugline": "INT. CHURCH - SANCTUARY - SAME The FLOOR BUCKLES - this Sanctuary caving in. INT. CAVERN UNDER THE CHURCH - SAME The ceiling above us craters, rock and cement coming down like a waterfall, ONTO THE FLAMING DERRICK, crushing it-- EXT. CHURCH ROOF - SAME The RADIO-JAMMING TOWER collapses in a heap... INT. CHURCH - BASEMENT/RUINS - RESUMING Half of the Sanctuary collapses into this lab. The church barely standing. The fire doused by the sheer volume of dust and debris. It's all a BLUR, over in mere SECONDS... Then... SILENCE. Just rubble and smoke and dust... We drift through it. Concrete slabs turned over. Operating tables twisted in half, CHURCH PEWS upended. ...and a lonely, charred Zippo. Then: INT. CHURCH - STAIRWELL - RESUMING Rubble, stone, steel, dust. Beneath the pile we find BOYCE, face down. He isn't moving. We DRIFT IN ON HIM, and... FADE TO BLACK... ...over which,   the sound of AIRPLANES . Lots of them. Fighters, bombers, an armada. Then we FADE UP again, on: INT. LESNER BARN - DUSK Boyce awakens, his ears filling with all that sound. He looks around. Nine hours have passed. He's in the LESNER BARN-- ...which has now become a FIELD HOSPITAL. Around him, on cots, lie SEVEN WOUNDED SOLDIERS. We see I.V.'s, DOCTORS, the works. Lesner's TRUCK has been moved out. And the U.S. Army, clearly, has moved in. Boyce is shirtless. His shoulder's been bandaged, the burns on his abdomen field-dressed. He sits up, slowly... Rosenfeld lies on a nearby cot. Grunauer is tending to him. But there's no Ford, of course. And no Chloe. Boyce rises.  102.",
      "characters": [],
      "action_text": "First few seconds on his feet are pretty wobbly. His knees want to give way, but he makes them stiffen. And everyone around here is too preoccupied to notice. He takes a first halting step for the barn door - then notices something to his right, a STANDING CURTAIN, partitioning off one patient from the rest. He hears a familiar voice behind it.   Marie-Elena . Boyce moves to the curtain. Grunauer notices: GRUNAUER Boyce! What're you-- Boyce steps around the curtain, to find a BED: Chloe is in it, wounded but alive, tended to by Marie-Elena. Paul sits in a corner. BOYCE Chloe? She looks up, her eyes suddenly wet with tears. Boyce hurries to her side, feeling very lucky. He takes her hand. BOYCE (CONT’D) You okay? CHLOE (nods then:) You? Boyce breathes out a smile, Marie-Elena and Paul silent. BOYCE I'm sorry about your father-- GRUNAUER (O.S.) --Boyce. Grunauer, standing by the curtain. Boyce turns. BOYCE Derwin Frances. GRUNAUER Back in bed. BOYCE Yeah, okay. He turns to Chloe. She smiles bravely. Boyce gives her an assuring look, turns to go--  103. ...inadvertently putting his hand in his pocket, surprised to find something there. He extracts it. It's that WWI MEDAL... for VALOR.   Ford's parting gift to him . Boyce breathes out a sad smile, eyeing the medal, starts to hand it back to Chloe. BOYCE (CONT’D) Here. This doesn't belong to me. Chloe closes Boyce's hand around the medal... CHLOE Yes. It does. She meant that, and it feels pretty good. So... He kisses her. A big one. She gives into it. The kiss lingers - the OTHER G.I.'s in here watching the silhouette of it through the hospital curtain... until: GRUNAUER Okay, Boyce. That'll do... The kiss ends. Chloe beams; they've got a chance, these two. GRUNAUER (CONT'D) Let's go. Boyce nods. Grunauer tugs him away, leaving Chloe behind. They head back across the barn to Boyce's bed - a few G.I.'s now regarding Boyce as something of a celebrity... GRUNAUER (CONT’D) Hey, I'm sorry about Ford. Guy saved my life up ther",
      "dialogue_count": 0,
      "word_count": 835
    }
  ]
}