{
  "slug": "overboard-2018",
  "title": "overboard",
  "genre": "drama",
  "format": "film",
  "scenes_count": 19,
  "characters_count": 0,
  "characters": [],
  "total_words": 20345,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. KATE’S HOUSE, KITCHEN - LATER At the end of a very long day, an exhausted Kate sits at the table, opens one of her nursing textbooks and BEGINS TO CRY. INT. YACHT, STATEROOM - THE NEXT MORNING Leonardo, passed-out in bed, SPOONS with the three ladies. INT. KATE’S HOUSE, KITCHEN - SAME TIME Kate sleeps face down on her books. Her phone RINGS, startling her. KATE Hello?... Yeah, I can always use more hours. What time do they need me?... Okay, wow, that’s soon. She cups the phone, then YELLS upstairs: KATE (CONT’D) Everybody up. You got ten minutes to get dressed, find something edible, and get in the car. EXT. ELK COVE, HARBOR - LATER Kate walks down the dock lugging her STEAM CLEANER. She passes a row of small fishing boats until she sees -- LEONARDO’S YACHT, dwarfing everything else. INT. YACHT, STATEROOM - LATER The Steward leads Kate into the POST-PARTY MESS -- ice cream toppings everywhere, champagne bottles on the ravaged bed. STEWARD Wish I could say this is the worst of it. I’m here if you need me. As he leaves, Kate fires up her machine with a loud WHIR. Suddenly, the sheets fly off and Leonardo bolts upright. LEONARDO Yaaaa! Turn it off! Turn it off! She quickly does.  10.",
      "characters": [],
      "action_text": "KATE Sorry. Didn’t know anyone was here. LEONARDO I should get up anyway. Busy day. I’ve got a lot of... really nothing to do. He smiles disarmingly. She smiles back. KATE I can clean somewhere else. LEONARDO No, no, please. Let the Beast get out of the Beauty’s way. He steps out from under the covers and walks BUCK NAKED across the room. Surprised, Kate averts her eyes. Although, she hasn’t seen a naked man in a long time and... not bad. He disappears into the closet. LEONARDO (O.S.) (CONT’D) Just give me a sec -- I’ll put on some swim trunks. He re-emerges STILL NAKED, holding up two bathing suits. LEONARDO (CONT’D) What do you think? The solid or the print? KATE I’d... um... solid. LEONARDO Wait, I know. Madras. He reaches back into the closet and grabs a different suit. LEONARDO (CONT’D) So, you live in town? As he bends over to put it on, she notices a TATTOO on his butt of a cartoon mouse wearing a sombrero. KATE Is that Speedy Gonzales? LEONARDO You know another fast Mexican mouse?  11. KATE I’m assuming you were drunk when you got it. LEONARDO No. Not a bit. KATE But... don’t most Mexicans consider it an offensive stereotype? LEONARDO Why? We love Speedy. He’s fast. He’s Mexican. He outsmarts the pussy cat and brings back delicious cheese to his people. I see nothing bad here. She laughs. She can’t help but be charmed by this guy. LEONARDO (CONT’D) My name is Leonardo. KATE Kate... (points to her NAME TAG) ...Sullivan. He grabs an ENGRAVED COCKTAIL NAPKIN, pointing to his name: LEONARDO Monteverde. The Steward pokes his head in. STEWARD Your guests are requesting your company in the pool, sir. LEONARDO And I’d be rude to leave them waiting. He WHISPERS to the Steward... LEONARDO (CONT’D) I’m going to need a supply of condoms on the top deck. STEWARD Already stocked in the usual place. I’m fully aware how much you loathe the very notion of fatherhood.  12. ...but Kate OVERHEARS, instantly put-off. LEONARDO Care to join us, Kate Sullivan? KATE No. I have work ",
      "dialogue_count": 0,
      "word_count": 1935
    },
    {
      "scene_number": 2,
      "slugline": "EXT. YACHT, TOP DECK - CONTINUOUS LEONARDO And to think I invited you to join me in the Jacuzzi. KATE Oh, please, don’t flatter yourself. The ship’s HORN sounds. Kate runs to the railing and sees the yacht leaving the dock. She yells to the Captain: KATE (CONT’D) No! Stop the boat! LEONARDO I’ll have you know, women adore me. I’m charming and irresistible. KATE Oh, grow up! You’re a vain, empty little man who’d be nothing without his daddy’s money. LEONARDO Do you swim? KATE What? Of course I swim. LEONARDO Toodaloo. Leonardo calmly pushes her OVERBOARD. Splash! She pops up in the water, outraged. KATE What the hell’s wrong with you?! FIRST MATE Man overboard! LEONARDO She’s not with us. Keep going. KATE My equipment! Stop. At least let me get my equipment! LEONARDO Of course. I’m not unreasonable. Here you go. He grabs her STEAM CLEANER...  21.",
      "characters": [],
      "action_text": "KATE No. No. Please. That’s a very expensive-- ...and tosses it in after her. As Kate tries to stop it from sinking, he grabs a BULLHORN: LEONARDO My life is not empty. Everyone loves me. Everyone wants my life. (then, yelling at crew) And would somebody please get me some mango!... No, papaya!... Make it an assortment! The boat sails off leaving Kate in the water, furious. INT. NORTH END PIZZERIA, KITCHEN - LATER A TELENOVELA plays as Kate, damp and disheveled, rushes in. COOK You’re late. KATE I got thrown off a yacht by a rich, Mexican industrialist. COOK Make fun, but at it’s peak, “ La Reina Del Sur”   was watched by over forty million people -- not just in Mexico. But in Serbia and Croatia. EXT. YACHT, HELI-PAD - SAME TIME Leonardo, standing next to the Steward, waves goodbye to his three lady friends as their helicopter lifts off. LEONARDO Can you believe the gall of that woman? STEWARD The carpet lady? LEONARDO (with contempt) Kate Sullivan. So rude and arrogant and off-base in her opinions. He turns to leave.  22. STEWARD Sir, aren’t you forgetting something? LEONARDO Fine, yes, she was also quite beguiling. STEWARD I meant -- He points to a new helicopter arriving with an FRENCH BEAUTY. LEONARDO Right. (calling off)  Bienvenue à bord, jolie Genevieve!  INT. NORTH END PIZZERIA, FRONT OF HOUSE - A LITTLE LATER Theresa types at a laptop as Kate assembles to-go boxes. THERESA Is this the guy? KATE Uch, I can’t even look at him. Theresa scrolls through IMAGES of Leonardo. KATE (CONT’D) I have to pay the cleaning company twelve hundred bucks for a new machine. And they fired me. THERESA He’s kinda cute. KATE He’s evil. Theresa’s husband, JORGE, an ex-athlete who’s put on fifty extra pounds, walks in wearing a SEAHAWKS JERSEY. JORGE Who’s evil? Tom Brady? KATE (with contempt) Leonardo Monteverde.  23. THERESA (surfing the internet) Wow, he’s the son of the third richest man in the world. JORGE A Mexican? Hell yeah.   Mi gente  showing up. He kisses Theresa. JORGE",
      "dialogue_count": 0,
      "word_count": 823
    },
    {
      "scene_number": 3,
      "slugline": "INT. YACHT, KITCHEN - CONTINUOUS The Steward, Captain, and a few of the crew eat dinner and watch SOCCER ON TV. The phone RINGS, but the Steward ignores. STEWARD I’ve told the man repeatedly -- the twelve minutes I’m eating supper, I’m off the clock. INT. YACHT, STATEROOM - CONTINUOUS Leonardo hangs up, frustrated. LEONARDO What am I paying these people for? He grabs the bottle and heads out. EXT. YACHT, TOP DECK - MOMENTS LATER Tipsy, swigging champagne, he stumbles his way to the condom drawer by the Jacuzzi. It’s also empty. LEONARDO Dammit. I’m relentless. He starts riffling through the pillows on the love seat, finally spotting a STRIP OF TROJANS stashed behind the back cushion. As he reaches for them, he TRIPS and... ...almost falls, but regains his balance. He starts to walk back, but then stops, thinking ahead -- He smiles and tears off a few condoms, tucking them behind the back cushion for later. Just then, the boat hits a big wave, he loses his grip, and this time -- He tumbles OVERBOARD, smacking his head hard on the anchor before splashing into the sea. He loses consciousness for a moment, but wakes with a jolt when he swallows a mouthful of water. He looks around confused, then: LEONARDO (CONT’D) Help! Help! Someone help me! INT. YACHT, KITCHEN - CONTINUOUS The Steward and the crew CHEER LOUDLY as Norway improbably scores a goal against Brazil drowning out Leonardo’s CRIES.  26.",
      "characters": [],
      "action_text": "CAPTAIN (to First Mate, in Norwegian)  You’re doing my laundry for a month, Jurgen. Never bet against the motherland.  INT. YACHT, STATEROOM - CONTINUOUS The French Beauty sleeps, passed-out on the bed. LEONARDO (O.S.) Stop! Stop the boat! INT. YACHT, BEDROOM - CONTINUOUS Marcelo, wearing EARBUDS, talks on the phone. MARCELO  Everything’s under control, Father.  LEONARDO (O.S.) Help! Man overboard! Help! MARCELO  Bringing him home safe and sound.  EXT. PACIFIC OCEAN - CONTINUOUS Leonardo desperately swims after the boat, but it sails off into the night, leaving him ALL ALONE in the deep, wide sea. DISSOLVE TO: EXT. PACIFIC OCEAN - DAWN The sun rises as the yacht cruises across the Pacific. INT. YACHT, STATEROOM - LATER The French Beauty rolls over to discover the bed... EMPTY?! EXT. YACHT, TOP DECK - LATER Panic mode. The Steward runs over to Marcelo. STEWARD We’ve searched everywhere, sir. I’m deeply concerned.  27. MARCELO He probably just took a dingy ashore to get drunk at some local cathouse. The Captain rushes in. CAPTAIN I think I found him! STEWARD Thank God. Where? Is he okay? CAPTAIN I radioed the Coast Guard and apparently a fishing boat rescued a naked man from the ocean last night not far from our coordinates. MARCELO Are we sure it’s him? CAPTAIN Not a hundred percent. He was very confused and disoriented, but when they offered him some water, he asked if they had sparkling. STEWARD Turn the boat around! INT. ELK COVE GENERAL HOSPITAL, PATIENT’S ROOM - DAY Leonardo sits in bed as a MIDDLE AGED NURSE checks his vitals and a seasoned DOCTOR examines him. LEONARDO For the hundredth time -- I don’t know the president, I don’t know what day it is, I don’t know my own name. I remember nothing except getting pulled out of the sea by some gruff, smelly crabbers. Now show me that white coat means something and fix it. And also... (whispers conspiratorially) Can I get a prettier nurse? EXT. ELK COVE GENERAL - THE NEXT DAY A limousine drives up to the small, REGI",
      "dialogue_count": 0,
      "word_count": 823
    },
    {
      "scene_number": 4,
      "slugline": "INT. NORTH END PIZZERIA, FRONT OF HOUSE - DAY Emily, Abby, Molly eat pizza as Kate enters. KATE Did you behave? EMILY We all had beers and went crazy and Molly’s pregnant. Kate hands the delivery receipts to Theresa as the Cook bursts in, waving his phone in Kate’s face: COOK Check this out. I was searching for a used lawn mower and look what I stumbled on. Amnesia. Right here in our little town. I told you this stuff happens all the time. Dude has no idea who he is. KATE Oh, my God! That’s him! That’s the rich asshole! MOLLY Asshole. Asshole. KATE I’m an adult. And he really is an asshole. Kate grabs the phone and scans through the article. KATE (CONT’D) “Unidentified person”... “General Retrograde Amnesia”... Unbelievable: “There was hope a Mexico City man yachting nearby might be his brother, but it proved to be a false lead.” That was his brother! He’s just pretending not to know him so he can take over the company. COOK Huge plot twist on “ Pedro el Escamosa .” THERESA Let’s go down to the hospital right now and get you your money.  30.",
      "characters": [],
      "action_text": "ABBY Totally, Mom -- that jerk owes you. EMILY Yeah, get some money out of this dude so I don’t have to babysit all the time. KATE He doesn’t remember anything. He’s not even going to know who I am. ABBY Well, we can’t let him get away with this. I need new cleats. EMILY I’m serious, Mom. My life sucks. I want to go to the pool like every other kid in the world. KATE First, I’m sorry, I didn’t know your grandma was gonna bail on us, and second, rich people get away with horrible behavior all the time. There’s nothing we can do about it. THERESA Is that the lesson you want to teach your kids? Hell no. We have to make this guy pay. (to Cook)  Carlos, you still making fake documents?  COOK  Absolutely not. Out of that racket. Law abiding American citizen.  (off Theresa’s look) State or Federal? THERESA Kate, you know where your old wedding ring is, right? KATE Of course, but--  31. THERESA Abby, I’m going to need you to do some photoshopping, and someone’s gonna have to help me sneak a box of Jorge’s useless skinny clothes out of the garage, but here’s my idea. INT. ELK COVE GENERAL - LATER Kate and Theresa at the front desk, talk to a kindly NURSE. THERESA We’re here to claim her husband. The man with amnesia. NURSE Super. We were all so thrilled to get your call. I’ll get the doctor. She starts out, then grabs a MANILA ENVELOPE from her desk. NURSE (CONT’D) Oh, I almost forgot. This is everything he had with him. Kate looks in, appalled to find only the STRIP OF CONDOMS. As the nurse heads off, Kate bolts for the exit: KATE I’m not doing this. THERESA Wait. EXT. ELK COVE GENERAL - CONTINUOUS Kate bursts out. Theresa catches up. THERESA Come on, Kate. You’re just nervous. KATE Of course I am. I’m a terrible liar. THERESA All you have to do is stick to the script. We rehearsed this. You’ll be fine. KATE No. This is nuts. And probably illegal.  32. Kate hops into her car, tossing the manila envelope into the glove compartment. THERESA It’s only for a month until you pas",
      "dialogue_count": 0,
      "word_count": 1799
    },
    {
      "scene_number": 5,
      "slugline": "INT. KATE’S HOUSE, BATHROOM - CONTINUOUS Leo closes the door, then quickly shoves aside bras and bathing suits hanging on the shower curtain to find a window. He hops onto the lip of the tub, opens the window, then squeezes out to make his escape... EXT. KATE’S HOUSE - CONTINUOUS He falls to the ground with a THUD. He pops up to find -- Kate and the girls watching him from the living room window. He waves back sheepishly. LEONARDO Just getting a little air. INT. CRAWFORD MORTUARY - LATER Marcelo approaches the Mortician. MARCELO I’d like to buy an urn. MORTICIAN Certainly. May I also show you a few of our lovely cremation packages? MARCELO No, just the urn. INT. KATE’S HOUSE, LIVING ROOM - LATER Leo, now out of his hospital garb, walks down the stairs wearing Jorge’s old “skinny clothes” -- a SEAHAWKS T-SHIRT and a pair of SEAHAWKS SWEATPANTS. LEONARDO I imagine these Seahawks are some kind of sports team and I’m a big fan because most of my clothing has this God-awful green and blue bird on it. ABBY Football, Dad. It’s our thing. We watch every game together. Even if I haven’t done my homework.  40.",
      "characters": [],
      "action_text": "KATE Stop it. Everyone does their homework in this family. Including me. And right now I’ve got to memorize thoracic surgical protocols. So, Leo, why don’t you get dinner started? LEONARDO What? Cook? Me? KATE Sweetheart, I know you had a head injury, but we made a deal. As she walks him into the KITCHEN: KATE (CONT’D) While I study for my nursing exam, you keep the house running. LEONARDO That’s preposterous. I don’t even know how to turn on a stove. KATE Ha, ha. Nice try. Salad. Pasta. There’s sauce in the fridge. Kate walks out, leaving Leo bewildered. EXT. STATE PARK - SAME TIME At a BBQ pit, Marcelo scoops ASHES into an ornate URN. INT. KATE’S HOUSE - LATER The KITCHEN’s a cluttered mess. Leo, harried and unhappy, checks the boiling pasta, stirs the sauce, then dumps a bag of lettuce into a bowl. In the LIVING ROOM, Kate and the kids monitor his progress while they study. Abby whispers to her mom: ABBY I think he’s buying this. KATE I know. It’s crazy. I can say almost anything and he believes it. (calling out to Leo) When’s dinner, babydoll?  41. LEONARDO I don’t know how people do this every day. How can you even tell when the noodles are done? KATE Set the timer. LEONARDO Too late. KATE Taste it. He goes to pluck a strand of pasta from the BOILING WATER, but wisely stops before burning himself. Using tongs, he carefully pulls out a noodle, blows on it, then takes a bite. Hmmm... pretty good. He places a colander under the faucet, then with both hands grabs the metal handles of the pot. He carries it a few steps towards the sink then -- HOLY SHIT THAT’S FUCKING HOT. Kate and the kids watch as he frantically looks for a place to put it down. LEONARDO Hot, hot, hot, hot, hot, hot! He races back to the stove and drops it. But it lands on the handle of the saute pan CATAPULTING the pan and SPLATTERING sauce everywhere, covering Leo from head to toe in Ragu. LEONARDO (CONT’D) From what I can recall, this is absolutely the lowest point of my life. He reaches for a ",
      "dialogue_count": 0,
      "word_count": 606
    },
    {
      "scene_number": 6,
      "slugline": "INT. KATE’S HOUSE - LATER Everyone sits at the dinner table eating CEREAL. Leo finishes his bowl and takes it into the KITCHEN, which looks like a bomb exploded in it. LEONARDO I take it we can’t afford a housekeeper? KATE We can barely afford sponges. Which are under the sink, by the way. Leo, a beaten man, grabs a sponge and gets to work. INT. KATE’S HOUSE, KIDS BEDROOM - LATER A bunk bed and a futon on the floor. Kate tucks in Molly and Abby. Emily reads with a book light. ABBY Did you see his face when he found out he couldn’t drink anymore? KATE I know! I just came up with that on the spot. Pretty good, right? MOLLY I like having a dad around. ABBY He’s not your dad, genius. EMILY But he probably could babysit sometimes. KATE We talked about this. I don’t want him babysitting. End of story. Now finish your book. Everyone else go to sleep. Kate walks to the door, then stops: KATE (CONT’D) When I’m a nurse, things are going to get a lot better for us. I promise. Love you, guys.  43.",
      "characters": [],
      "action_text": "KIDS Love you too, Mom. KATE Oh, and you know how it always drives me crazy when you ask for a thousand things when you should be going to sleep? Tonight, ask for whatever you want. Just ask him. She closes the door and turns... INT. KATE’S HOUSE, HALLWAY - CONTINUOUS ...to find Leo leaning seductively in the BEDROOM doorway. LEONARDO So... is this where the magic happens? KATE You don’t even remember who I am and you want to have sex? LEONARDO Yes. Very much. KATE So basically you want to have sex with a complete stranger? He thinks a beat, then: LEONARDO Yes. Why are you making this so complicated? KATE Alright, big boy -- let’s ease back into this. She grabs some blankets and a pillow from the linen closet and leads him downstairs. KATE (CONT’D) You’re sleeping on the couch. LEONARDO What? No. This I’m certain of -- I do not like sleeping alone.  44. KATE It was your idea. Because of your snoring. You wanted me to be well- rested so I could pass my test. LEONARDO There’s no way I’m that magnanimous. (getting an idea) Wait -- we have a computer, right? I’ll search myself. Maybe that’ll give me some answers. She points to a laptop on the coffee table. KATE The password’s 1234. You’re not the only one with a bad memory. Leo types at the keyboard. LEONARDO Leo Sullivan. Not a thing. Zero. There’s a Leonard E. Sullivan with a laser hair removal business in Las Vegas which has some atrocious reviews. But that’s it. Nothing about my life is notable enough to be on the internet. I am a nobody. A poor, sterile, drunk nobody. KATE But you’re my nobody. Sweet dreams. INT. PORTLAND INTERNATIONAL AIRPORT - SAME TIME Marcelo waits for his flight, talking on the phone -- the URN rests at his feet. MARCELO  ...I so wish I could have brought his body home, Father, but the shark did too much damage. .. He accidentally knocks over the urn, causing some of “Leonardo’s” remains to fall out. An elegant OLD LADY watches in horror as he picks up the urn and casually kicks the spilled as",
      "dialogue_count": 0,
      "word_count": 748
    },
    {
      "scene_number": 7,
      "slugline": "INT. KATE’S HOUSE - CONTINUOUS Fiona SNORES, sprawled out on the couch. Leo makes do with the tiny bit of real estate left. An ALARM GOES OFF -- high-pitched and relentless. Leo bolts upright and looks at the clock. 5:30 AM. What the fuck? As he angrily shuts it off, he notices a post-it: “Have fun at work today, sweetie! Jorge’s picking you up in ten minutes. XOXO” EXT. KATE’S HOUSE - A LITTLE LATER Leo, half-asleep and wearing yet more SEAHAWKS APPAREL, gets into Jorge’s PICKUP TRUCK. INT. JORGE’S TRUCK - CONTINUOUS Jorge (in a Seahawks hat) hands him a coffee and a donut. Jorge’s in on the lie, except for one small detail: JORGE Great shirt, man. Old school. Have one just like it in the garage. Gonna break it out as soon as I get back to fighting weight. Jorge bites into a BEAR CLAW, then defensive: JORGE (CONT’D) I’m starting after Thanksgiving. As he drives off, he glances over at Leo who’s FAST ASLEEP. EXT. CLIENT’S HOUSE - LATER An OPULENT HILLSIDE HOME overlooking the ocean. Jorge parks in front by a dumpster and a few trucks. Leo hops out and instinctively heads for the front door. JORGE Dude, what’re you doing? No workers in the house. LEONARDO Oh, right. I’m a worker.  47.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 219
    },
    {
      "scene_number": 8,
      "slugline": "EXT. CLIENT’S HOUSE, JOB SITE - LATER Next to mounds of dirt and equipment, orange stakes mark a TENNIS COURT UNDER CONSTRUCTION. Jorge introduces Leo to the CREW -- a mix of Mexicans and Central Americans. JORGE  This is Gato. This is Burro. Burro’s little brother, Burrito. Vito, because he loves the Godfather, and this is his worthless kid, Fredo.  FREDO, young, handsome, born in the U.S., pipes in. FREDO  You’re the idiot who keeps hiring me, Gordo.  JORGE (to Leo)  Now you know my nickname. But you got to work here six months before you can use it.  (then)  Everyone -- this is Leo.  As they welcome him, BURRO, a mule of a man, shakes his hand. BURRO  Damn, bro, you got some soft hands. Look at these things. What have you been doing?  BURRITO  Back off -- poor guy had amnesia.  BURRITO is even bigger than his brother. VITO, an older man with a pencil mustache, checks out Leo’s hands. VITO  I tell you what he’s been doing. Working at a nail salon.  GATO, small and agile, laughs: GATO  Those are some real lady hands.  JORGE  Enough chit-chat, we got two tons of dirt to haul out of here.  As they get to work, Leo pulls Jorge aside.  48.",
      "characters": [],
      "action_text": "LEONARDO Listen, I’m pretty sure I’ve never worked construction, so I might be more suited for running errands or maybe some light clerical work. JORGE Totally understand -- I’ve got your back, dude. I’ll go easy. EXT. CLIENT’S HOUSE, JOB SITE - A LITTLE LATER Leo, huffing and puffing, pushes a heavy wheelbarrow full of dirt up the steep hill. Jorge walks by with a big grin. JORGE Any of this jogging your memory, Lady Hands? INT. MEXICO CITY, HOSPITAL ROOM - SAME TIME Marcelo and Corina comfort Papi as he mourns over Leonardo’s ashes. Papi opens the urn and takes a deep, loving whiff: PAPI  Why does my precious Leonardo smell like meat?  MARCELO  In the end, Father, that’s what we all are... hamburger.  PAPI  Well, it won’t be long until I see him again.  CORINA (through tears)  Don’t say that, Papi.  MARCELO  I know this is an emotional time, but perhaps we should start the transfer of power so you can rest easy.  PAPI  Yes. You are now the heir.  MARCELO  A crown I never wanted to wear.  49. Corina looks at Marcelo, SKEPTICAL. EXT. CLIENT’S HOUSE - LATER Leo, filthy and exhausted, stands in the middle of the dumpster, unloading dirt with Fredo. Leo spits: LEONARDO I have dirt in my mouth. This is inhuman. A TESLA pulls up. The RICH CLIENT steps out and walks over. FREDO Look at this bozo. What does he want? RICH CLIENT Hey guys, I’m Erik. The owner. Any way I could get you to park this dumpster in front of that house over there? I know it’s further for you guys, but this thing’s kind of an eye-sore and my neighbors won’t mind, they’re in Whistler all month. FREDO  Lo siento, senor. No habla.  RICH CLIENT Okay, I’ll talk to Jose. I mean, Jorge. It’s Jorge, right? FREDO  Jorge, si . RICH CLIENT Okay.   Adios, amigos . After the client walks off: FREDO Douchebag. I’m not moving this thing another inch. LEONARDO Probably hasn’t had to work a day in his life.  50.",
      "dialogue_count": 0,
      "word_count": 555
    },
    {
      "scene_number": 9,
      "slugline": "EXT. CLIENT’S HOUSE, JOB SITE - LATER Leo, gasping for air, slowly pushes his wheelbarrow up the hill. Gato cruises by effortlessly with a load of dirt. GATO  What happened,   Lady Hands,   lose your memory and your muscles?  Using every ounce of strength, Leo continues on. He takes a few more steps, then -- He begins to LOSE MOMENTUM and the weight of the wheelbarrow pushes him backwards. It picks up steam and Leo has to let go of the handles and RUN FOR HIS LIFE down the hill. EXT. KATE’S HOUSE - LATER Jorge’s truck pulls up. An exhausted Leo gets out and staggers like a zombie toward the front door. INT. KATE’S HOUSE - CONTINUOUS He enters. Kate and the girls watch him stumble across the room and collapse onto the couch. LEONARDO Tired... thirsty... dirt... KATE Hey honey, how was your first day of work? LEONARDO My body... pain. Every... part... my buh... buh buh... buh buh buh buh... As Leo babbles on: MOLLY Should we take him to the hospital? KATE He’s fine. He just needs to rest. LEONARDO Rest... rest... dirt in nostrils. KATE That’s right, take a few minutes before you get started on all the things you need to do tonight.  51.",
      "characters": [],
      "action_text": "LEONARDO There’s more?! She hands him a slip of paper. KATE I know you’re having trouble remembering, so I made a list. LEONARDO No. I’m done. I can’t do it. KATE Honey-- LEONARDO Kate, it is physically impossible for me to get off this couch. My legs are no longer functioning. And even if I could move, I wouldn’t want to do any of the vile things on this list. Who would? It’s a hideous existence. KATE Emily, can you make your dad some hot tea? INT. GROCERY STORE - LATER Sipping from a “Worlds Greatest Dad” travel mug, Leo trudges down the aisle, pushing a shopping cart. He grabs things off the shelf. Cereal. Milk. Pasta. The last item jars his memory. He stops, backs up, then tosses a pair of OVEN MITTS into the cart. INT. GROCERY STORE - MOMENTS LATER Leonardo stands in front of a BEWILDERING ASSORTMENT OF TAMPONS. He holds two boxes, reading the labels carefully. LEO Wings or no wings? After a beat he gives up and throws them both into the cart. As he heads down the aisle, he passes the BOAT MECHANIC who repaired the yacht, and his very pregnant wife.  52. LOCAL BOAT MECHANIC I know that guy. How do I know that guy? Jiffy Lube. That’s it. (to Leo) Hey, do you work at Jiffy Lube? LEONARDO God, I hope not. Leo disappears around the corner. LOCAL BOAT MECHANIC This is going to drive me crazy. INT. KATE’S HOUSE - LATER The table’s set. Pasta boils on the stove. The timer DINGS. Leo, sporting the new OVEN MITTS, confidently grabs the hot pot and pours it into a colander. Perfect. Except all the noodles stick to the bottom in a gooey clump. LEONARDO Dammit! INT. KATE’S HOUSE - LATER Everyone sits at the dinner table, once again eating CEREAL. KATE This isn’t a criticism, but pretty sure I wrote down “Honey Nut.” LEONARDO (at the end of his rope) They. Were. Out. KATE Did you check the market over by the school? LEONARDO No -- I made the judgement call that it was more important to get home and get dinner on the table. KATE It is on the way, sweetie. Leo gets up in a hu",
      "dialogue_count": 0,
      "word_count": 3995
    },
    {
      "scene_number": 10,
      "slugline": "EXT. ELK COVE/INT. PIZZA CAR - DAY Leo weaves expertly through traffic like he’s in the final lap of the Le Mans Grand Prix. LEONARDO Vroom! INT. NORTH END PIZZERIA, KITCHEN - LATER Leo enters through back door. COOK That was fast. LEONARDO Didn’t feel fast. THERESA There’s more orders on the counter. As Leo grabs the pizzas, he glances at the telenovela on TV. LEONARDO  What happened with the poor housemaid, Catalina?  BUSBOY  She lost the baby.  LEONARDO  So sad. Now the Governor’s son will never marry her.  PRELAP: A doorbell rings. Ding-dong. EXT. RANCH HOUSE, PORCH - LATER Brent (Canadian bacon and pineapple) opens the door in nothing but a bathing suit. BRENT Where’s Kate? She usually works Saturdays. LEONARDO You mean my wife, Kate?! BRENT I didn’t know she was married.  74.",
      "characters": [],
      "action_text": "LEONARDO Well, she is! To me! For fifteen glorious years. Is this how you dress for all your deliveries? MAN’S VOICE (O.S.) Pretty much. Leo turns to see a disgruntled FEDEX GUY carrying a package. FEDEX GUY Got your supplements, Brent. INT. MEXICO CITY, HOSPITAL ROOM - NIGHT Papi sleeps on life support. Corina dozes in a chair until her phone RINGS, startling her awake. She checks caller ID. CORINA Thanks for getting back to me. INT. ELK COVE, SHERIFF’S OFFICE - INTERCUT SHERIFF No problem. What can I do for you? CORINA I’m looking for information on my brother, Leonardo Monteverde. I believe he was killed by a shark in your district several weeks ago. SHERIFF Sorry, ma’am, we haven’t had a shark attack around here in four and a half years. CORINA Really? (her suspicions growing) Are you positive? You don’t need to check with any other precincts? SHERIFF Lady, I promise you, if anyone in this county is gonna hear about a shark attack, it’s gonna be me. PULL BACK to REVEAL the sheriff only has one arm.  75.",
      "dialogue_count": 0,
      "word_count": 318
    },
    {
      "scene_number": 11,
      "slugline": "INT. KATE’S HOUSE - DAY Kate studies at the kitchen table as Leo approaches. LEONARDO Last chance. Sure you don’t want to come with us? KATE I can’t. The test’s in three days. LEONARDO Alright, we’ll miss you. And take some breaks. And eat something. You’re looking thin. EXT. COMMUNITY POOL - LATER Emily, dressed in a t-shirt and shorts, watches as Leo pays her entrance fee. LEONARDO I’ll pick you up at one-thirty for Abby’s game. She dashes off. LEONARDO (CONT’D) You’re welcome! Leo strolls across the parking lot to the car, where Abby and Molly wait in the backseat. INT. PIZZA CAR - CONTINUOUS He gets in and buckles up. MOLLY Why can’t we go swimming? LEONARDO Because we’re giving your sister a little space. As he turns the key, Leo glances at the POOL and discovers -- Emily, now in a skimpy bikini, flirting with a 15 year-old LIFEGUARD with 1970s teen idol hair. LEONARDO (CONT’D) Too much space! We’re giving her too much space!  76.",
      "characters": [],
      "action_text": "EXT. COMMUNITY POOL - MOMENTS LATER Leo drags a humiliated Emily out. EMILY Everyone’s watching. LEONARDO I don’t care. EXT. COMMUNITY POOL, PARKING LOT - MOMENTS LATER He marches her to the car. LEONARDO The implicit understanding was you were going to be in a respectable one-piece. Not parading around in something that leaves very little to the imagination. EMILY This is stupid. I don’t have to listen to you. You’re not even my real dad. LEONARDO Fine. If that’s how you want to play it -- I’m not your real dad. I’m just some stranger your mom dragged in off the street pretending to be your dad but I’m still not letting you throw your life away for some sex-crazed, curly-haired wolf. EMILY Henry’s taking AP classes. LEONARDO Get in the car. Emily stops, suddenly emotional. EMILY No. She starts to CRY. Leo can’t bear it: LEONARDO What are you doing? Why are you crying?  77. EMILY Because I’m miserable. LEONARDO You are? Why? EMILY I was really popular in Portland. LEONARDO Please stop crying. Why is there so much crying in this family? EMILY Here, everyone’s known each other their whole lives and they have group texts that I’m not part of and then I meet a boy who’s really cool and he doesn’t want anything, he just likes talking about bands. LEONARDO Oh, he wants something. He wants something bad. I don’t know how I know. But I know I know. EMILY What are you talking about? LEONARDO I don’t know. EMILY Look, I’m not going to do anything dumb. I’ve never even kissed anyone. So you don’t have to get all crazy on me. (then, earnest) I just really like him. This moves Leo. After a beat: LEONARDO What are these AP classes? EMILY It means he’s smart. Leo takes this in, then: LEONARDO And so are you. I raised you well. Maybe we can work out a compromise.  78.",
      "dialogue_count": 0,
      "word_count": 494
    },
    {
      "scene_number": 12,
      "slugline": "EXT. COMMUNITY POOL - LATER Emily, back in shorts and t-shirt, chats with the lifeguard. LIFEGUARD You’re dad’s kind of freaking me out. PULL BACK to REVEAL Leo, fully clothed, eye-balling them from a lounge chair. Molly and Abby splash in the pool nearby. MOLLY Play Marco Polo with us. LEONARDO I’m not closing my eyes. EXT. LOCAL PARK - LATER A Bantam League FLAG FOOTBALL GAME -- mostly boys, but a few girls. Leo, along with Theresa, watches the game. Emily bored, reads a book. Molly plays with her friends. ON THE FIELD, Theresa’s son, JASON, rifles a slant pass to Abby, who catches it then jukes for a TOUCHDOWN. ON THE SIDELINES, they go nuts, high-fiving. LEONARDO Way to go, Abby! Great pass, Jason! THERESA We’re up by two now, right? I’m texting Jorge. FROM THE OPPOSING SIDE LINE, the Rich Client (watching his son, a LANKY KID in a beanie) yells: RICH CLIENT Flag guarding. She’s flag guarding! THERESA (still texting) I’m also telling him his client’s a jerk. He hasn’t shut up all game. LEONARDO He’s good at making money, but apparently not good at losing. Text that. ON THE FIELD, Abby gets into a shoving match with the Lanky Kid. The REF throws a yellow flag.  79.",
      "characters": [],
      "action_text": "REF Unsportsmanlike conduct. Both teams. Penalties cancel each other. Leo runs over to Abby. LEONARDO What’re you doing? You don’t want to lose the game on a personal foul like Richard Sherman’s late hit in Dallas. ABBY He started it. He pushed me. LEONARDO Doesn’t matter. Walk away. I don’t want to have to go home and tell your mom you got in another fight. ABBY Okay, I get it. Get off the field. LEONARDO One more stop and the Ducks are in sole possession of second place. Now go make a play. The ref blows the whistle and the teams line up. REF First down, Roosters. Twelve seconds on the clock. With the game on the line, Abby guards the Lanky Kid on a post pattern. The quarterback lets one fly and Abby tussles with the receiver and knocks it away. A big celebration. Leo jumps up and down. Abby runs over. LEONARDO You did it! We won! The Rich Client confronts the Ref. RICH CLIENT That was pass interference. REF Let it go, pal. They’re ten. The Ref walks away. The Rich Client turns to Leo.  80. RICH CLIENT That was a penalty and you know it. LEONARDO Incidental contact. The defender has as much right to the ball as the receiver. RICH CLIENT Whatever. Your daughter plays dirty. LEONARDO What? RICH CLIENT You heard me. She’s a cheater. LEONARDO She is not a cheater! Your son runs a sloppy pattern and frankly I don’t think he’s scrappy enough to play football. He seems more suited for tennis. Maybe you should get him lessons on your private court. RICH CLIENT How do you know about my court? LEONARDO I knew you didn’t know who I was. RICH CLIENT Should I? LEONARDO That’s an interesting question. We’ve only had half a dozen conversations in the last three weeks. I guess I’m just another brown face to you. RICH CLIENT What are you talking about? ABBY Dad, let’s just leave. LEONARDO You’re right. I’m gonna walk away. Come on, girls. Bye, Theresa. Great game, Jason. As they head to the car, he uses this as a teaching moment:  81. LEONARDO (CONT’D) See, Abby, I’m taking the hi",
      "dialogue_count": 0,
      "word_count": 919
    },
    {
      "scene_number": 13,
      "slugline": "INT. FROZEN YOGURT PLACE - LATER Leo tastes a sample. LEONARDO Mango. Mango. (smacking his lips) Have I always loved mango? KATE As long as I’ve known you. Kate goes to get a table. Leo hangs back with the kids and helps Molly work the self-serve machine. MOLLY Are you going to leave us? Emily and Abby exchange a nervous look. LEONARDO What do you mean? Of course not. I’m your dad. MOLLY Sometimes dads leave. LEONARDO Well, I guess maybe they do, but I’m not going anywhere. You’re stuck with me. Now let’s go get some toppings. EXT. LANE COUNTY JUNIOR COLLGE - DAY The Pizza Car pulls up to the curb. INT. PIZZA CAR - CONTINUOUS Leo and the girls drop Kate off for her nursing exam. MOLLY/ABBY/EMILY Good luck, Mom./You’re gonna ace it./We’re rooting for you. KATE I’m really nervous. What if I don’t pass? LEONARDO Try not to worry, we’ll be fine either way.  84.",
      "characters": [],
      "action_text": "Kate smiles, touched by the support. LEONARDO (CONT’D) We’ve been through rougher times than this. I think. INT. MEXICO CITY, HOSPITAL ROOM - DAY Marcelo, holding flowers, walks in to find -- The room empty, except for a NURSE making up the bed. Even Marcelo feels the gravity of the moment. MARCELO  Oh, my God -- am I too late?  Just then -- Papi bursts out of the bathroom. PAPI  You’re not burying me yet. I feel like a million bucks.  MARCELO  What? But--  PAPI  The doctors say my meds were off, but I think deep down I wasn’t ready to let go of the company. I have so much left to do.  MARCELO  Wonderful. I’ll move my stuff back into my old office.  INT. NORTH END PIZZERIA, FRONT OF HOUSE - DAY Kate sets tables for the lunch rush, talking to Theresa. KATE I don’t know. There were a couple easy ones I blanked on. Like, I couldn’t remember which sedative is prescribed for seizures? The Dishwasher walks by with a tray of plates. DISHWASHER Phenobarbital. KATE Crap. I knew that.  85. THERESA I’m sure you passed. KATE At least it’s over. Now I don’t have to keep up this insane lie anymore. THERESA So you’re going to tell him? KATE Tonight at dinner. I’ve tortured him long enough. THERESA Sure you don’t want to wait a few weeks? It’s hard to find good help. KATE No, he’s done his time. Fair is fair. He’s paid his debt. (then) I’m really nervous. He’s going to freak out. THERESA You’re telling a ditch digger he’s a billionaire. I think he’s going to be okay with it. INT. KATE’S HOUSE - THAT NIGHT Kate enters to find Leo setting the dinner table. KATE Hey. Can I talk to you? LEONARDO Sure, what’s up? KATE Well, I have something I need to confess and I don’t really know where to start. LEONARDO Whatever it is, I’m sure it’s not that big of a deal.  86. KATE It’s pretty big. And it’s going to sound crazy and you’re probably not even going to believe it, but I did something terrible. Kind of unforgivable. You see -- DING! The oven timer goes off. LEONARDO Hold that thought. (t",
      "dialogue_count": 0,
      "word_count": 1574
    },
    {
      "scene_number": 14,
      "slugline": "EXT. CLIENT’S HOUSE, POOL - MOMENTS LATER Leo approaches the Client, who looks up a little nervous. LEONARDO Don’t worry -- I’m not here to fight. I want to apologize. I behaved like an animal. RICH CLIENT No. I’m the one who started it. My wife read me the riot act. LEONARDO I didn’t even tell my wife. RICH CLIENT Something about watching your kid play sports... LEONARDO Brings out the worst. RICH CLIENT My shrink keeps telling me they learn more from a loss than a win. LEONARDO Maybe, but winning is so much more fun. The Client smiles, then gestures for Leo to sit down. RICH CLIENT Want some lemonade? EXT. CEMETERY - DAY Carrying flowers, Kate stands by a GRAVESTONE which reads: “Mark Sullivan. 1970-2011. Loving husband, father, son.” KATE So... I got laid. Finally. You know how before I met you I was always getting myself in complicated relationships? Well, this one’s a real doozy. She lays the bouquet down.  93.",
      "characters": [],
      "action_text": "KATE (CONT’D) Anyway, the kids are doing good. They miss you, of course. Emily’s starting to get boy crazy... INT. KATE’S HOUSE - DAY Leo watches the SEAHAWKS GAME with Abby and Molly. A commercial comes on, then: MOLLY Dad, what’s erectile dysfunction? Leo throws up his arms, exasperated. LEONARDO Thank you “Cialis for daily use.” (changing subject, calls off) Honey, I didn’t forget, it’s almost halftime, I’m picking up lunch. IN THE KITCHEN, Kate stares at her laptop as Theresa rifles through the fridge. KATE Ahh! Why haven’t they posted them yet? LEONARDO They said they’d have the results up by two. THERESA It’s 11:30. Relax. You want to be a nurse, not need a nurse. (handing her a beer) Here, nurse this. Hey-Oh! LEONARDO Alright, the Giants are taking a knee. Where’s my list? Kate holds it up. As he goes to grab it, she playfully smacks him on the ass with it before handing it over. EXT. KATE’S HOUSE - MOMENTS LATER He climbs into the car as Kate runs out.  94. KATE Get coleslaw. We need coleslaw. And chips. Not the baked kind. I’m stressing. LEONARDO Okay, got it. KATE Write it down. I know you, you’ll forget. And cookies. Get cookies. INT. PIZZA CAR - CONTINUOUS Leo finds a pen on the seat, but it’s out of ink. He opens the glove compartment. Nothing to write with, but he notices the MANILA ENVELOPE and checks inside. What the fuck?! He pulls out the STRIP OF CONDOMS. He’s confused. Then hurt. Then enraged. LEONARDO Kate!!! EXT. KATE’S HOUSE - CONTINUOUS Kate stops in the doorway as Leo jumps out of the car. KATE What’s the matter? LEONARDO Oh, I don’t know. I was just sitting here wondering what the wife of an infertile man would be doing with a strip of ribbed, reservoir-tipped condoms. He holds them up with the righteous anger of a cuckold. KATE Oh, those, um... it’s not what you think. It’s nothing. LEONARDO Nothing?! How could you do this to me? We made a vow! A sacred vow. Which I kept. And don’t think I didn’t have opportunities. Because I have. Lots of",
      "dialogue_count": 0,
      "word_count": 1533
    },
    {
      "scene_number": 15,
      "slugline": "INT. YACHT, WHEELHOUSE - DAY As the Captain steers, singing along to a Scandinavian pop song, his phone BUZZES. He looks to see -- The PHOTO OF LEONARDO CHICKEN FIGHTING with a text: “This is your guy, right? Because now I have a lot of questions.” EXT. YACHT, TOP DECK - SAME TIME A SOMBER CEREMONY in progress. Corina plays the cello. PAPI  ...and now if each of you would take a handful of our beloved Leonardo...  The Captain hurries up to the Steward and hands him the phone. The Steward gasps. PAPI (CONT’D)  ...we can say our final goodbyes.  STEWARD Hold the ashes! He rushes over to Papi and shows him the photo. STEWARD (CONT’D) This was taken twenty minutes ago. PAPI  He’s alive!   Leonardo’s alive! Everyone rejoices. Hugs, kisses, tears. Corina shoots a look at a shaken Marcelo, pretending to be overjoyed. EXT. STATE BEACH - LATER Before cutting the cake, Kate says a few words: KATE It means so much to me that you’re all here today. Getting to be a nurse has been a long journey. I’m obviously not a great test taker. There’s no way I would have passed without all of your help. Especially you, Leo. Big cheer from the group.  102.",
      "characters": [],
      "action_text": "KATE (CONT’D) He cooked. He cleaned. He worked two jobs. He kept me laughing so I didn’t get too stressed out. He was the most supportive man a woman could ask for. BURRO  You’re making us look bad,   Lady Hands. KATE Thank you, babe. She gives him a kiss. LEONARDO I’d like to say something, too, and I’m glad you’re all here. I don’t remember the first time I did this and that doesn’t feel right, so... He gets down on one knee. LEONARDO (CONT’D) Kate, will you marry me again? Everyone hoots and hollers! Kate gets swept up in the moment. KATE Yes! Yes! He stands, lifts her up in a bear hug, and spins her around. He shouts for the world to hear: LEONARDO She said yes! EXT. STATE BEACH - THAT NIGHT The party’s over. Leo, Kate, and the girls huddle around a cozy fire, roasting marshmallows, with a camping tent nearby. In all apparent ways -- a happy, content, loving family. EXT. ELK COVE, HARBOR - SUNRISE The yacht pulls into the dock. INT. PIZZA CAR - MORNING Eating Egg McMuffins, Leo drives his gang home.  103.",
      "dialogue_count": 0,
      "word_count": 400
    },
    {
      "scene_number": 16,
      "slugline": "EXT. ELK COVE - SAME TIME A BLACK LIMOUSINE speeds down the highway. EXT. KATE’S HOUSE, DRIVEWAY - LATER The Pizza Car pulls in to find the limo waiting. LEONARDO Whose fancy car is that? Kate looks nervous as they park. Leo hops out with a bag of trash and sees his dad and siblings stepping out. LEONARDO (CONT’D) Hey, Papi. Hi, Marcelo. Corina. Let me just throw this away. Leo casually walks into the house. Marcelo shoots a steely look at Kate. After a beat, Leo pops back out. LEONARDO (CONT’D) Oh, my God, I remember. I’m Leonardo Monteverde. (thrilled) Oh, Kate, I’m cured. I can remember again. You can’t imagine how terrible it is to not know who you are. The doctor said my mind could come back suddenly and he was right. I mean, I saw Papi, I walked past him into the house and, poof, my memory came back. Honey, ask me anything. Ask me about my childhood in Mexico. About my time at the University. It didn’t last long. About my money. (realizing) Money! I have money! Lots and lots of money. Oh God, this is the happiest day of my life. He runs over to Kate and hugs her. LEONARDO (CONT’D) Oh, thank you. Thank you for bringing me here and making me a husband and a father and -- (confused) Why did you do that? Why? (then, figuring it out)  104.  (MORE)",
      "characters": [],
      "action_text": "I know why. You’re that judgmental carpet cleaner lady who hates me. Reeling, he looks over at the girls. LEONARDO (CONT’D) And these are your children. And you made me... believe... Oh, God. The full weight of the betrayal hits him. Kate averts her eyes, ashamed. LEONARDO (CONT’D) You tricked me. You used me. Say something. KATE At the time... I... Leo, it-- LEONARDO (cutting her off, angry) My name is not Leo. It’s  Leonarrrrdo . And I don’t belong with you. (re: kids) And I don’t belong with them. He staggers back toward the house. LEONARDO (CONT’D) I have to get my things. He disappears inside. PAPI The only reason we’re not pressing charges is to avoid a tabloid scandal. MARCELO And don’t even think about asking for money. We’ve dealt with far craftier gold-diggers than you. INT. KATE’S HOUSE - SAME TIME Leo looks around. It’s bittersweet. So many memories. He was happy here. But he turns and... EXT. KATE’S HOUSE - CONTINUOUS ...walks back out onto the porch.  105.  LEONARDO (CONT’D) LEONARDO There’s nothing in there that’s mine. KATE Leonardo, for whatever it’s worth... I’m sorry. And thank you. The kids nod sadly. Papi ushers him toward the limo. PAPI  Come on, son.  (re: his shirt)  What the hell is a   Seahawk? Papi opens the car door for Leonardo who climbs in. Overcome with sadness, Kate wants to stop him, but knows it’s pointless. Trying to comfort her daughters, she puts her arms around them, but they break away. ABBY Wait! Dad! The girls rush to the car, pounding on the window. EMILY Don’t go! Please! But they drive off. INT. LIMO - CONTINUOUS Leo is gut-punched as the kids run after him, yelling, begging for him to stay. He covers his ears to drown out the painful sound of their voices. Fighting tears, he turns and looks through the back window to see -- Molly, on the bike he taught her to ride, desperately pedaling after him. Leo breaks down, letting himself CRY for the first time in his life. EXT. COUNTRY ROAD - CONTINUOUS No matter how fast Molly r",
      "dialogue_count": 0,
      "word_count": 601
    },
    {
      "scene_number": 17,
      "slugline": "EXT. YACHT, DECK - LATER Papi, Marcelo, Corina, and a melancholic Leonardo walk up the gangplank. The Steward greets them. STEWARD Welcome back, sir. Your funeral was lovely, by the way. EXT. ELK COVE, HARBOR - LATER The yacht sails out to sea. INT. KATE’S HOUSE - LATER Kate sadly removes the “family” photos from the wall. She pauses on the picture of everyone eating frozen yogurt. She smiles wistfully, then tosses it in the trash. EXT. YACHT, STERN DECK - SAME TIME Leonardo, dressed once again in his yachting clothes, watches as Elk Cove and his old life fade into the distance. CUT TO: EXT. YACHT, TOP DECK - DAY Leonardo and Papi hit golf balls into the sea. PAPI  Look at you, you’ve added ten yards to your drive.  LEONARDO  It’s all that manual labor.  PAPI  Well, those days are behind you, thank God.  INT. KATE’S HOUSE - NIGHT Kate and the girls sit at the table, joylessly eating pasta. MOLLY I liked Dad’s sauce more.  107.",
      "characters": [],
      "action_text": "KATE It’s the exact same sauce. And sweetie, you know he was never really your dad. (then) I’m so sorry I put you all through this, but things are going to get better. ABBY I don’t get it. Why didn’t you try to stop him? EMILY Yeah, you’re obviously totally in love with him. KATE What was I gonna say? I lied to the man. I basically kidnapped him. He hates me. And he should. He’s got his rich life back with his yacht and his models. EMILY So what? We should be trying to get him back. KATE No. It’s over. That’s the end of it. Now finish up so we can go see Grandma. INT. YACHT, STATEROOM - SAME TIME Leonardo watches the Seahawks on TV. After a beat, he changes the channel to a SOCCER game. He watches for a moment, then switches back to football. Then back to soccer. Unable to choose, he pushes a button on a nearby console and a panel slides open revealing a SECOND TELEVISION. He watches both games side by side. INT. YACHT, DINING ROOM - A LITTLE LATER An elegant, formal meal. The Steward and the wait staff serve the first course to Leonardo, Papi, Marcelo, and Corina. CORINA  So, Leonardo, how are you feeling? Is it strange being back?  108. LEONARDO  I’ll tell you this -- I’m ecstatic not to have to get up at five a.m. tomorrow and go shovel dirt.  PAPI  Well, you’ve made me very happy. I can finally rest easy knowing a Leonardo Monteverde will be leading our company for decades to come.  LEONARDO  I know I’ve been reluctant, but now I’m ready. And you might be surprised, but I actually have a few ideas.  MARCELO  This should be interesting . LEONARDO  I just think we can make some of our products more user-friendly. Like, offering a thirty pound bag of cement in addition to the ninety.  MARCELO  Do you have any idea how much that would increase our unit production cost? Ballpark -- several million dollars a year.  LEONARDO  Yeah, but they’re hard to carry.  MARCELO  Who cares?  LEONARDO  The people carrying them.  MARCELO  Father, are you listening to this? I’m very ",
      "dialogue_count": 0,
      "word_count": 996
    },
    {
      "scene_number": 18,
      "slugline": "INT. COMMUNITY THEATER, BACK STAGE - LATER Molly hands roses to her grandmother, as the others congratulate her. KATE You were amazing! KATE’S MOM I know I’m no Idina Menzel, and I certainly don’t have her figure -- I gave the rigging guys quite a workout -- but I’m pretty good for an old broad. And I wouldn’t give a hoot if I wasn’t. I love every minute I’m out on that stage. ABBY So true, Grandma -- when you love something, you have to go after it. EMILY Even if you end up making a fool of yourself -- right, Mom? GRACE Whoa, I didn’t say I made a fool of myself. They already booked me for “Fiddler” next season. ABBY Mom, it’s crazy we’re not trying to get him back. GRACE Who? Is there a man in the picture? Did you meet someone special? EMILY We had a fake dad for awhile. It’s a long story. GRACE Did he see the show? What did he think of me? MOLLY I miss him, Mom. KATE I miss him, too, but-- GRACE But nothing. Do you love him?  112.",
      "characters": [],
      "action_text": "KATE Yes, I think so, yes -- it’s just impossible. GRACE Listen, honey -- and I owe a shout out to Stephen Schwartz here -- it’s time to “defy gravity.” EXT. COLONIAL STYLE TRACK HOME - LATER Kate and the girls KNOCK. Theresa opens the door. Behind her, Jorge plays poker with his crew and some of the kitchen guys. KATE Jorge, I need your boat. INT. YACHT, HALLWAY/STATEROOM - SAME TIME Leonardo, holding the champagne, opens the door to find -- The French Beauty, in lingerie, waiting for him on the bed. LEONARDO Wow. I guess we didn’t need more champagne after all. (takes a breath, then) Look, this would be a lot easier if you were fully clothed. And this might not sound like a compliment, but I’ve probably been with several hundred incredibly beautiful women in my life, and you are definitely in the top five. Maybe even top three -- so you know, respect. But I’m gonna have to take a pass. Leonardo rushes off. After a moment he returns, putting the bottle down. LEONARDO (CONT’D)  Profite bien . It’s an excellent vintage. INT. YACHT, WHEELHOUSE - MOMENTS LATER Leonardo enters to find the Captain at the helm. LEONARDO Captain Gundersen, we’ve never really had time to talk.  113. CAPTAIN No, we haven’t. LEONARDO Well, there’s no time now. I need you to turn this boat around. CAPTAIN Why, sir? LEONARDO I’m going home. EXT. PACIFIC OCEAN - DAWN The first morning light dances on the water as the yacht heads back to Elk Cove. EXT. YACHT, TOP DECK - CONTINUOUS Leonardo, in a bathrobe, sips coffee. Papi joins him. LEONARDO  Morning, Papi.  PAPI  Morning, son. Lovely weather.  He takes a deep satisfied breath, then, confused: PAPI (CONT’D)  Why is the sun rising over there?  LEONARDO  I had them turn the boat around.  PAPI  What? Why?  LEONARDO  You’re taking me back to Oregon.  PAPI  To be with that hillbilly?  LEONARDO  Please don’t call her that . PAPI  Oh, so it’s true .  114. LEONARDO  Papi, I love her. I want to be with her.  PAPI  No. I forbid it.  He gets up and storms ",
      "dialogue_count": 0,
      "word_count": 1235
    },
    {
      "scene_number": 19,
      "slugline": "EXT. PACIFIC OCEAN - CONTINUOUS MUSIC SWELLS as the separated lovers swim toward each other. LEONARDO I never want to be apart from you again! KATE I never want to be apart from you! It’s like a modern day fairy tale, until-- ON THE YACHT, Papi yells through a BULLHORN: PAPI  If you do this, Leonardo, it’s over. There’s no turning back.  But Leonardo SWIMS on anyway. LEONARDO  I don’t care!  PAPI  I’ll cut you off. I swear. You’ll be disinherited.  Leonardo SLOWS down a bit. PAPI (O.S.) (CONT’D)  You won’t have a penny to your name.  Leonardo STOPS, and turns. Treading water: LEONARDO  Not a penny?  Marcelo and Corina come up behind Papi. PAPI  Nothing. You’ll be pauper.  LEONARDO  Let’s not overreact, there’s got to be something we can work out.  KATE (yelling across water) What are you doing?  120.",
      "characters": [],
      "action_text": "LEONARDO (yelling back) I’m negotiating. The dingy pulls up to Kate. Jorge lifts her aboard. LEONARDO (CONT’D)  How about I keep the Swiss accounts?  PAPI  No. And don’t even think about running Monteverde Industries.  Marcelo puts his hand on Papi’s shoulder: MARCELO  It’s for the best, Father.  PAPI (to Leonardo, still yelling)  I’ll leave it to your sister.  MARCELO  What?! You can’t do that. I’m next in line.  PAPI  You’re also a deceitful scumbag.  Papi pushes Marcelo overboard -- SPLASH. FIRST MATE And it’s a hat trick! PAPI  Leonardo, this is your last chance.  The dingy with Kate now on board pulls up next to Leonardo. KATE Honey, are you coming? LEONARDO Hold on. This affects you, too. (to Papi)  What if I’m given a generous monthly stipend?  KATE Are you kidding me? This is not how I envisioned this moment.  121. LEONARDO I’m sorry, Kate, most people don’t actually have to choose between love and money. It’s not easy. (then, turning to Papi)  One lump sum, held in trust -- I can only touch the interest.  PAPI  It’s all or nothing, son! What’s it going to be?  Leonardo turns to Kate. Then back to his father. LEONARDO  Really? That’s your final offer?  PAPI  Yes . LEONARDO Then... it’s an easy choice. He turns back to Kate. LEONARDO (CONT’D) I choose you. KATE Are you sure? JORGE You’re giving up a lot. No one would begrudge you if you need to take a few minutes. LEONARDO I don’t even need one second. Kate, you’re the best thing that’s ever happened to me. My life was richer when I was poor with you, than when I had all the money in the world. KATE If I jump back into the water, will you promise to kiss me this time? LEONARDO I promise. She jumps in and they kiss. And it’s the best kiss ever. DISSOLVE TO  122. INT. NORTH END PIZZERIA, FRONT OF HOUSE - ONE WEEK LATER Kate, wearing a NURSE’S UNIFORM, and the girls eat pizza. Leonardo rushes in from the back. LEONARDO Sorry, Jorge made us work late. He grabs a slice. KATE You’re getting overtime, right? LEONARD",
      "dialogue_count": 0,
      "word_count": 772
    }
  ]
}