{
  "slug": "over-the-moon-2020",
  "title": "over the moon",
  "genre": "drama",
  "format": "film",
  "scenes_count": 6,
  "characters_count": 0,
  "characters": [],
  "total_words": 19665,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. CANAL/WUZHEN WATER TOWN/CHINA - EVENING - THAT MOMENT The foot belongs to Fei Fei, 5, who contemplates this information from the comfort of her mother’s lap. MOTHER And that’s the real reason the moon has phases. Mother brushes Young Fei Fei’s LONG HAIR as they gaze up at the waning moon. FATHER shares their picnic blanket. They’re a beautiful family, serene and complete. YOUNG FEI FEI So, when the Moon is big and round, that’s when the Space Dog doesn’t take a bite? MOTHER That’s when the Moon Goddess, Chang’e, makes him spit it out. MOTHER holds the Chang’e doll up next to Fei Fei. MOTHER (CONT’D) BLAH! MOTHER pretends to spit out the moon. Both Young Fei Fei and Mother [LAUGH] and [SNORT]. FATHER [LAUGHS] All right, does anyone want to hear the scientific explanation? YOUNG FEI FEI Sorry baba, I like the Mommy explanation best! MOTHER (teasing, to Dad) Outnumbered. YOUNG FEI FEI Tell me about Chang’e. FATHER Again? YOUNG FEI FEI Again, again! I love to hear about the moon goddess! Tell me, momma? OTM Final Conformed Draft - 07.30.20   2.",
      "characters": [],
      "action_text": "MOTHER unties a SCARF from around her neck that has an image of the Moon Goddess, Chang’e, on it. Mother holds the scarf in front of FEI FEI, using it as a prop as she sings. (Transition to a 2D animated style) The story unravels on the scarf’s surface - the Chinese mythology of Chang’e and Houyi. SONG - ON THE MOON ABOVE MOTHER LONG AGO - AN ANCIENT STORY BEAUTIFUL AND KIND CHANG’E AND A HANDSOME MAN NAMED HOUYI WERE IN LOVE-- YOUNG FEI FEI True love? MOTHER TRUE LOVE BUT SHE TOOK A MAGIC POTION GIVING IMMORTALITY THEN SHE FLOATED LEAVING HER TRUE LOVE AND SHE WAITS FOR HIM ON THE MOON ABOVE- (Transition back to CG animation) Young FEI FEI tugs her Mother’s scarf down in front of her to reveal the waning moon. MOTHER (CONT'D) And that’s where she lives now - on the Moon, with only Jade Rabbit to keep her company. YOUNG FEI FEI Why? MOTHER Because Houyi died here on Earth. YOUNG FEI FEI And when she cries, her tears turn into stardust. MOTHER LONGING, HOPING FOR HER ONE TRUE LOVE NOW SHE WAITS FOR HIM ON THE MOON ABOVE OTM Final Conformed Draft - 07.30.20   3. Mother tosses her scarf in the air. It floats up. YOUNG FEI FEI FOREVER? MOTHER FOREVER.   FATHER FOREVER. The scarf falls back down. Father catches it and wraps it lovingly around Mother’s shoulders and ties it in place. They share a tender look as Fei Fei watches. She [GIGGLES]. CUT TO: EXT. WATER TOWN/CHINA - EVENING - A MOMENT LATER Fei Fei looking up at the moon. She asks her Father- YOUNG FEI FEI (To Father) Baba, do you think Chang’e is real? FATHER (indulgent) If your mother says she’s real, then she is absolutely real. YOUNG FEI FEI [GIGGLES] MOTHER [LAUGHS] Thank you! Mother turns to Fei Fei, whispering- MOTHER (CONT’D) Look up. Can you see Jade Rabbit? He’s making a potion. YOUNG FEI FEI I can see him! MOTHER What do you think he’s making? YOUNG FEI FEI Moooon mush! MOTHER Moooon mush! FATHER Moooon mush! OTM Final Conformed Draft - 07.30.20   4. They all [LAUGH]. CUT TO:  SEQUENCE 0300 - MAKING MOO",
      "dialogue_count": 0,
      "word_count": 1930
    },
    {
      "scene_number": 2,
      "slugline": "EXT. CANOLA FIELDS Fei Fei stops in the canola field, selling mooncakes to a couple. She continues riding through the field. TOWNS PERSON See you next week, Fei Fei! FEI FEI Okay, bye! CUT TO: A truck backs up to reveal- EXT. MAG LEV SITE - CONTINUOUS Railway workers car supplies off a futuristic track.   It’s a brand new magnetic rail. Fei Fei rides up on her bike. Seeing RAIL WORKERS on a lunch break-- FEI FEI Scrumptious mooncakes, fresh for tonight! RAIL WORKER #1 We’ll take four! FEI FEI Four?! [SCOFFS] Why not sixteen? She hands him four boxes- RAIL WORKER #1 Whoa! FEI FEI Well, you fellas must get pretty hungry building the fastest train in the world! A billboard behind them shows imagery of the epic rail. RAIL WORKER #1 (Surprised) You know about the MagLev? FEI FEI (Excited) I heard about it in school - (MORE) OTM Final Conformed Draft - 07.30.20   12.",
      "characters": [],
      "action_text": "It doesn’t even bother with wheels, floats on electromagnetic fields like a cushion of air. (Jumping forward) Whoosh! Magnetic levitation is the coolest! The workers are impressed. RAIL WORKER #2 Huh... Did you know that’s how it works? RAIL WORKER #3 (Mouth full of mooncakes) Mmhmm... (then after a beat, shakes his head) Nuh uhn. CUT TO:  SEQUENCE 0500 - MEET MRS. ZHONG & CHIN  EXT. OUTSIDE OF FEI FEI’S HOUSE Fei Fei rides her bike expertly over the bridge and parks it outside her house. INT. FAMILY BAKERY - CONTINUOUS Fei Fei skips into the kitchen, bursting with excitement- FEI FEI Baba! I sold all of the mooncakes tod- Noticing a pile of fruit on the counter- FEI FEI (CONT’D) [SOFT LAUGH] Red dates? We never use dates. That’s not one of mama’s recipes. FATHER Well, I thought we’d try something new in honor of our guest. Fei Fei, this is Mrs. Zhong. Father walks over to one corner of the kitchen to reveal MRS. ZHONG. FEI FEI (CONT'D) OTM Final Conformed Draft - 07.30.20   13. MRS. ZHONG Hi, Fei Fei. FEI FEI Hello. Bungee looks at Mrs. Zhong, feeling the tension. MRS. ZHONG It’s nice to meet you - [GASP] Mrs. Zhong’s hand inadvertently knocks a bowl full of dates to the floor. She bends to retrieve it, apologizing. Father bends down to help her... FATHER Oh! MRS. ZHONG Oh no- FATHER Don't worry about it. Don’t worry about it. MRS. ZHONG I’m so sorry. FATHER It’s okay. I got it, I got it. He helps her pick up the bowl. Their hands briefly touch. It’s an innocently tender moment. Fei Fei stares. FATHER Uh... tour! Fei Fei, how about we give Mrs. Zhong a tour of the shop? MRS. ZHONG That sounds nice! FEI FEI Uh... I’m sorry, I have some homework to do. FATHER Oh. Well, we could work on it together later? FEI FEI Uh, it’s okay. OTM Final Conformed Draft - 07.30.20   14. FATHER (shares one last look with Fei Fei, making sure she’s okay) All right. [SOFT LAUGH] Walking into the shop- MRS. ZHONG Ugh, I can’t believe I dropped that. FATHER (O.S.) I can’t believe you did i",
      "dialogue_count": 0,
      "word_count": 4573
    },
    {
      "scene_number": 3,
      "slugline": "EXT. WATER TOWN - MONTAGE She rides town with an old car door tied to her bike with a bunch of parts in tow. FEI FEI (CONT’D) CANDLES MAKE A PAPER LANTERN FLY – SO TELL ME WHY CAN’T I! EXT. JUNK YARD - MONTAGE - Fei Fei gathers pieces to build her rocket, an old laundry machine door, various scraps, etc. INT. FEI FEI'S ROOM - MONTAGE - She maps out her design on graph paper. EXT. FIELD - MONTAGE - She places all of the scraps and pieces out methodically. EXT. FIELD - MONTAGE - DAY - She constructs a large rabbit lantern to conceal her rocket. FEI FEI ASTRONAUTS THEY RISE ABOVE THE SEAS SO WHY NOT ME! WITH EACH PIECE THE PUZZLE TURNS MY HOPE INTO REALITY LOOK AND SEE EXT. FIELD - MONTAGE - NIGHT - She continues constructing the large rabbit lantern. EXT. CANOLA FIELDS -   MONTAGE - She tows the giant rabbit behind her bike passing through town. EXT. MAGLEV SITE/THE LAUNCH - MONTAGE - She pulls the rabbit onto the track she’s built at the mag lev site. OTM Final Conformed Draft - 07.30.20   36.",
      "characters": [],
      "action_text": "- She attaches magnets along the track. INT. FEI FEI'S ROOM - MONTAGE - Fei Fei grabs her backpack off her bed. INT. FEI FEI’S HOUSE - MONTAGE - Fei Fei grabs her moon boots and heads out the front door. Chin pokes his head out from around the corner, curiously watching her. EXT. MAGLEV SITE/THE LAUNCH - MONTAGE - She rips the papier-mâché off the rocket’s main window, gets into her rocket and buckles in Bungee to her seat and fits a helmet onto her head. FEI FEI I CAN HAVE LIFT OFF AT ONE MORE DEGREE COUNT DOWN IS STARTING AND SOON THEY WILL SEE I THINK I’VE GOT IT – I’M GOING TO BE FREE SO HOLD ON BUNGEE! FEI FEI (CONT’D) FLY AWAY CHANG’E I AM COMING TO YOU HIGH AWAY BABA, I WILL PROVE IT TO YOU I’LL BE FREE OF ALL GRAVITY - She takes out a family photo of Father, Mother and herself and places it on the dash of the rocket as motivation. - She flicks a few switches in her cockpit and secures her helmet. FEI FEI (CONT’D) HEY CHANG’E I’M GONNA BE THERE SOON IN MY ROCKET TO THE MOON! She raises her hand and hits the launch button-  SEQUENCE 1100 - MALFUNCTION  OTM Final Conformed Draft - 07.30.20   37.",
      "dialogue_count": 0,
      "word_count": 414
    },
    {
      "scene_number": 4,
      "slugline": "EXT. MAGLEV SITE/THE LAUNCH -- CONTINUOUS With a great thud the rocket lurches backwards, then slowly forward. Fei Fei and Bungee brace, expecting to zoom forward. Outside a snail inches by even faster... Back in the cockpit, Bungee jerks forward in her seat trying to make it go! Slowly the speedometer numbers increase, and the rocket creeps down the track. Then a HUM starts to build the magnets engage, the numbers increase: 1, 2, 5, 9, 21, 25, 28... Fei Fei smiles, it’s working- The MagLev speeds right above Fei Fei’s rocket. At first, it passes, but then the rocket catches up-- THE SPACESHIP RIPS DOWN THE TRACK AT AN INSANE SPEED! HURTLING DOWN THE TRACK- 266, 297... The numbers increasing, Fei Fei hits another button and the wings shoot out as the rabbit cover slides off revealing a full blown ROCKET- 487... 502... The rocket LIFTS OFF THE TRACK AND UP INTO THE SKY! INSIDE THE COCKPIT Fei Fei SLAMS another button- IN THE NIGHT SKY: Fireworks explode, providing extra propulsion in a beautiful exclamation. On her tablet she sees the earth below her- FEI FEI [LAUGHING] I did it! I did it! The rapid climb starts to slow... and slow... until all forward momentum stops. A small burst at the back of the rocket, then they STALL. There’s a moment of weightlessness - FEI FEI (CONT’D) Uh oh. THE SPACESHIP STARTS FREE-FALLING BACK TO EARTH! An [EAR PIERCING SCREAM] cuts the air. From behind the seats, CHIN POPS HIS HEAD OUT, wearing a helmet. CHIN We’re gonna die! OTM Final Conformed Draft - 07.30.20   38.",
      "characters": [],
      "action_text": "FEI FEI Chin?!? CHIN [SCREAMS] HIIIIIIIIII FEI FEI! FEI FEI You dingbat! I didn’t calculate your extra weight! They both [SCREAM]. BUT SUDDENLY – a bright gleaming moonbeam shoots down from the sky and catches the space ship from plummeting back to earth. It’s suspended in mid-air- CHIN (O.S.) [GASPS] Are we dead!? FEI FEI Whaaaa... CHIN What’s- What’s happening?!  SEQUENCE 1150 - OH BOY  WIDER - The Spaceship is RIDING ON A MOONBEAM and they’re going BACK UP! The moonlight is a TRACTOR BEAM. FEI FEI (O.S.) We’re... we’re going   up ! INSIDE THE COCKPIT - Fei Fei and Chin are agog. They look out the window in awe. WIDER - the Spaceship ENTERS SPACE. Fei Fei and Chin stare out the window at the strange beauty. The reflection of the round earth passes over the window. CHIN Whoa. FEI FEI What in the world... They know they’ve left gravity behind when CROAK JUMPS ON FEI FEI’S FACE. She lets out a [SCREAM]. Chin [GIGGLES], Croak ribbits- OTM Final Conformed Draft - 07.30.20   39. FEI FEI Chin?! Chin floating around- CHIN Zero Gravity Man! Fei Fei holds him back- FEI FEI Get down here! This is no time to mess around! DIAPERS suddenly float past- CHIN Grandpa’s diapers?! FEI FEI It’s a long flight. She grabs them and tucks them into her jacket. CHIN Ew! SUDDENLY - a strange CLANGING SOUND. It ROCKS the spaceship. Chin lets off a [SCARED EFFORT]. Chin and Fei Fei look up through the observation dome and TWO LION FACES are looking down into the spaceship! FEI FEI AHHHH!   CHIN AHHHH! WIDER - TWO TEENAGE WINGED LIONS fly with the spaceship up the moonbeam trail to the MOON. CHIN FEI FEIIIII! The “TWLs” bat the spaceship around like kittens with a mouse. The spaceship bounces from side to side inside the path of the moonbeam like a bowling ball in a lane. Fei Fei, Chin, and Bungee roll around inside, [GASPING] and [SCREAMING]. A TWL bats the spaceship too hard, AND IT SPINS OFF THE TRACTOR BEAM. Floating rapidly off course. The TWLs chasing but only managing to push it farther",
      "dialogue_count": 0,
      "word_count": 4577
    },
    {
      "scene_number": 5,
      "slugline": "EXT. THE RIDE TO THE LIGHT SIDE OF THE MOON   - NIGHT Fei Fei drives- A CLUSTER OF FIREBALL FLASHES appear in front of them as they drive up to a massive crater- LULU Ahhh, looks like the moon goddess is astronomically upset. GRETCH When she’s mad this road’s a suicide mission. BILL Kid, let’s wait it out. FEI FEI No! We’re going! Follow me! The chicks follow Fei Fei into the crater. Meteors rain through the atmosphere and hit the surface of the moon in front of them; BOOM! BOOM! BOOM! GRETCH WHOA?! BILL Whoa, whoa, whoa, whoa! Fei Fei and the chicks weave their way through just barely dodging as the meteors explode brilliant colors. FEI FEI Go left! All the chickens all [SCREAM] as they follow Fei Fei, narrowly avoiding being smashed. FEI FEI (CONT’D) Right! Okay, now left! Fei Fei maneuvers the bike just in time as Bill’s face ends up inches from the ground- BILL [SCREAMING EFFORTS] WHOA WHOA! FEI FEI We gotta get through THAT canyon! Fei Fei leads them directly in the path of the biggest meteor yet- OTM Final Conformed Draft - 07.30.20   62.",
      "characters": [],
      "action_text": "GRETCH [CHICKEN CLUCKING NOISES] LULU AYAYAYAYAYAYAY! BILL WHOA! We’re not gonna make it! [SCREAMS] FEI FEI Don’t be such a chicken! She punches it at the last second and they are launched over the explosion from the meteor. BILL (CONT’D) [PANICKED YELLS] GRETCH AHHH! LULU AHHH! BILL AHHH! They expertly land on the other side of the canyon all in one piece. Looking out to the horizon of the moon- BILL [SCARED WHIMPERS] FEI FEI Let’s get that gift! The chicks rev their engines and drive off leaving the crater in their dust. [HOOTING] and [HOLLERING]! BILL Woohoo-hoo-hoo! CUT TO:  SEQUENCE 1850 - ESCAPE FAILS  INT. PALACE PING PONG ROOM Chin tries to get out of the room by running at the wall multiple times but it’s no use. OTM Final Conformed Draft - 07.30.20   63. CHIN NO BARRIERS! RAHHHH! He hits the wall out of breath and wobbly, [PANTING]. Croak sits nearby watching, shaking his head “no” CUT TO:  SEQUENCE 1900 - CRASH SITE & LUNAR LUNCH  EXT. CRASH SITE/BRIGHT SIDE OF THE MOON The bikers approach the crater where Fei Fei crash landed. PANNING - the CRASH SITE. The SPACESHIP lies in pieces, strewn across the lunar surface. FEI FEI There it is! Over there! My rocket ship! MOONCYCLES convening down into the crater-- They approach the crash site. Fei Fei sees her broken rocket- FEI FEI (Out of breath) Oh, my rocket ship... BILL What a mess. Fei Fei finds the picture of her perfect family; mom, dad and her tucked in the rubble. She picks it up. GRETCH (O.S.) What’s this gift look like anyway? OFF Fei Fei’s determined expression - FEI FEI I’m not sure. Let’s just spread out. We’ll find it. Fei Fei walks around the carnage and up to what used to be her rocket, which now resembles a small house. A small creature approaches atop what appears to be a lunar rover. It has her helmet on, making funny breathing noises. Through the visor, colors dance and flash... What is this thing? OTM Final Conformed Draft - 07.30.20   64. FEI FEI Huh? GOBI [WEIRD BREATHING NOISES] Kooophaa",
      "dialogue_count": 0,
      "word_count": 4559
    },
    {
      "scene_number": 6,
      "slugline": "INT. PALACE THRONE ROOM With the company of Jade, Chang’e stares at a hologram of the moon, anxious. CHANG’E If she’s coming with the gift, it has to be   now.  EXT. OUTSIDE THE PALACE - THAT MOMENT Fei Fei and Gobi jump from roof to roof through Lunaria heading towards the palace, landing at the entrance and making their way inside- INT. HALLWAY OF SHOOTING STARS/PALACE - THAT MOMENT ENTERING THE HALLWAY - the Shooting Stars sense Bungee and Chin. THEY ATTACK! In a rapid-fire display of skill, BUNGEE USES HER LASER EARS to zap the Shooting Stars, detonating them mid-air before the comets can strike them. CHIN WIELDS HIS PING-PONG PADDLE, hitting the comets away. CHIN (CONT’D) Rah! Zap! Gotcha! Ha ha! They’re a great duo. INT PALACE HALLWAY - CONTINUOUS Chin and Bungee continue fighting off the shooting star guards. FEI FEI Chin?! Chin spots Fei Fei, running towards her - CHIN Fei Fei! Oh my gosh, I’m so happy to see you! FEI FEI You’re okay! Chin dives into telling Fei Fei about all of his adventures in the palace- CHIN It was so crazy! The poles were all moving, and then I was surrounded - OTM Final Conformed Draft - 07.30.20   87.",
      "characters": [],
      "action_text": "Bungee hops into Fei Fei’s arms, her ears sparking. Fei Fei, ecstatic, holds up the amulet proudly - FEI FEI [LAUGHS] Look! We got the gift! CHIN Wow! Gobi meets Chin as they run to the throne room- GOBI Hi, I’m Gobi! CHIN Rad. I’m Chin. GOBI Double rad, I just returned from a thousand years in exile. I wonder if I’ll run into anyone I know-- Just then he gets tackled by moonguards. The amulet slips out of Fei Fei’s grasp - CHIN Gobi!? FEI FEI [SCREAMS] The amulet! Gobi reaches above him amongst the chaos, attempting to catch the precious object. The amulet clatters across the floor. He misses it. GOBI Fei Fei, get it! Fei Fei clamors for the amulet, retrieving it. Chin goes back to pull Gobi out of the grip of the moonguards when the Lunettes hurry up to them- GOBI No, no, no! Leave me be! [STRETCHING EFFORTS] CHIN [PULLING EFFORTS] BLUE LUNETTE We’re almost out of time! Gobi pops out of the moonguards grasp- OTM Final Conformed Draft - 07.30.20   88. GOBI Oh, thank you! YELLOW LUNETTE Oh, hurry, come this way! They pull Fei Fei and Chin to the throne room.  SEQUENCE 2700 - HOUYI REUNION  INT. PALACE THRONE ROOM The doors to Chang’e’s banquet hall open- BLUE LUNETTE Goddess, it’s here! Fei Fei runs up the stairs to meet Chang’e. A crowd of Lunarians are already gathered. Chang’e turns and makes her way down the stairs to meet Fei Fei. Fei Fei presents Chang’e with the amulet. CHANG’E [GASPS] Fei Fei... FEI FEI [PANTING] I think this is the gift you’re looking for. Chang’e BEAMS. CHANG’E Of course, the other half of the Amulet! Chang’e accepts the gift and makes her way up to the center of the hall where Jade waits for her. Before she proceeds with the ritual, she looks back at Fei Fei gratefully. The two share a meaningful look. CHANG’E Our two halves can make us whole again. Now you can come back to me. Chang’e connects the two halves of the amulet and places it in the center of an ornate pedestal, not dissimilar to something in Jade’s rabbitory. Faint music begin",
      "dialogue_count": 0,
      "word_count": 3612
    }
  ]
}