{
  "slug": "ozark-101-pilot-2017",
  "title": "ozark 101 pilot",
  "genre": "drama",
  "format": "series",
  "scenes_count": 6,
  "characters_count": 1,
  "characters": [
    "BOB EVANS"
  ],
  "total_words": 8549,
  "total_dialogue": 1,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. MARTY’S HOUSE-MARTY’S BEDROOM - NIGHT Wendy sleeps.   Marty eases into bed, sheet up.   He stares at the ceiling, then at Wendy.   He studies the back of her head, bare shoulders, the swell of her hips beneath the sheet.   Her hips.   Her back-arching cat-in-heat-hips. He glares at the ceiling, radiates anger.   She snores. MARTY (soft) Alright then. He whips the sheet off, swings his legs over the side. INT. MARTY’S HOME-KITCHEN - NIGHT Marty, dressed in same-day clothes, sans tie, punches buttons on the home security keypad. INT. MARTY’S CAMRY (MOVING) - NIGHT (LATER) Marty slows, flings a fistful of coins into a toll basket, accelerates toward the Chicago skyline. INT./EXT. MARTY’S CAMRY - NIGHT Marty slow-rolls to the curb, stops.   Locks the doors.   His POV: a trio of Howard Avenue HOOKERS, 20s, in thigh-highs and fuck-me pumps work the corner.   He stares at the BLONDE HOOKER, her come-ons to passing cars.   She glances his way-- INT. MARTY’S CAMRY - NIGHT (MOMENTS LATER) Street lamp lit.   Marty nervous, on the lookout for cops. Blonde Hooker nuzzles his neck.   Supermodel-hot; lustrous hair, full lips, flawless skin. BLONDE HOOKER You haven’t done this before, have you? MARTY Why? BLONDE HOOKER Handsome, clean, fit--  26.",
      "characters": [],
      "action_text": "BLONDE HOOKER Let me guess, your wife won’t do... what you want her to do. Tube top shed.   Breasts.   Perfect.   Marty forgets the cops. BLONDE HOOKER If you were my man?   Working all day so I could stay-at-home... She unbuckles his pants.   Marty’s breath hitches. BLONDE HOOKER Which, let’s face it, was a bitch when they were little but now they’re both teens and in school all day -- a private school too, fifteen grand a pop, even though you pay a shit-pot full of state taxes and live in a top-rated public school district. His zipper comes down.   Slow.   Marty braces.   She purrs... BLONDE HOOKER Who’s never missed a mortgage payment?   Marty Bird.   Nice home on a quarter-acre squared-off lot in a suburb with just enough ethnics to make   Chicago Magazine’s   Best Neighborhoods list but not enough to drop the property values. Thanks Marty.   Food on tables, shoes on feet, braces on teeth. Marty fuckin’ Bird, putting presents under the tree since 1999. Not only would I not cheat on you-- She tongues his top lip, locks eyes with him. BLONDE HOOKER I’d let you do... Anything.   You. Wanted.   Do me a favor-- Her head starts its descent. BLONDE HOOKER Don’t cum too fast. He shakes ‘no’, she pauses, looks up. BLONDE HOOKER Nice shirt.  27. Her head disappears into his lap, he gasps, closes his eyes. RING!   RING!   RING! INT. MARTY’S CAMRY - NIGHT Reality.   Phone ringing.   Blonde Hooker closing fast outside his window -- tweeker-teeth, dark roots and a cold sore. BLONDE HOOKER Hey!   You can’t be beatin’ off in your car, baby.   This ain’t a pettin’ zoo. Marty fumbles the car into drive, squeals off.   He fumbles for his phone, answers it.   Over Bluetooth-- MARTY (into phone; breathless) Yeah... BRUCE (V.O.) (over phone) Bird, it’s Bruce... I’m at Hansons. MARTY Trucking?   Why? BRUCE (V.O.) I’m with Senior and Junior.   I need you here, Marty.   Now. MARTY Tonight?   No... Bruce what’s the-- BRUCE (V.O.) Del’s here. Marty sobers.   Silence for a beat. MARTY Okay",
      "dialogue_count": 0,
      "word_count": 560
    },
    {
      "scene_number": 2,
      "slugline": "INT. MARTY’S CAMRY (MOVING) - NIGHT Marty parks, headlights shining on BRUCE vanity plates attached to a Maserati flanked by 3 white Suburbans. INT. HANSON AND SON TRUCKING-SERVICE BAY - NIGHT Dim.   Fluorescent safety lights.   Dark around the edges, the outlines of half a dozen men.   Marty walks past a smattering of tool chests, parked trucks.   Knows the layout. He mounts steel tread-plate steps. INT. HANSON TRUCKING-OFFICE - NIGHT Marty enters, 3 sets of anxious eyes turn to him.   Crammed shoulder to shoulder on a sagging couch-- HANSON SR., 60s, HANSON JR. 30s, Liz, her face flush with fear.   The last to look up-- Bruce. The space small; built to fire drivers, screw secretaries, take a dump in peace.   An empty chair behind a steel desk.   A .44 PISTOL on top. MARTY Bruce?   Mr. Hanson, what...? A toilet FLUSHES behind the john door.   Water runs, paper tears.   The door opens, ARTURO “DEL” DEL RIO emerges. Mexican, 40s, lean, handsome, stylish Del lays eyes on Marty, laugh lines crinkling, he towels his hands dry. DEL There he is-- Del grips Marty’s hand; a two-handed, old friends shake. MARTY Del, I didn’t know you were in town.   What’s going on? DEL You look good, Marty.   Where’s my five million dollars? Marty half-smiles.   A joke?   Serious?   He glances at Bruce, back to Del.   His stomach falls.   Del sees it. DEL Oh, shit.   The Mexican’s serious.  29.",
      "characters": [],
      "action_text": "HANSON JR. Whatever’s between you boys is your business, it’s got nothing to do with me and my dad. HANSON SR. Shut up, son--   HANSON JR. We run a clean shop. Del gestures Marty to Hanson Sr.’s empty chair, Del perches on the edge of the desk, angled to the couch, amused. DEL Clean?   Other than the hundred million in drug money you and your father collect and transport to these two men to launder. Marty sits, Bruce won’t meet his eyes. HANSON JR. Clean to you. Del chuckles. MARTY Whoa, whoa, whoa... Del, this money you’re missing, however much-- DEL The Federation produces a billion dollars a year.   I don’t know I’d use any version of “miss.” “Stolen.”   That’s my word. HANSON SR. Mr. Del Rio, I swear we’re not stealing from you.   We log all our weights -- check ‘em -- numbers don’t lie. Del smiles, spins the .44 on the desk... nods at Marty. DEL Don’t tell him that.   Not to diminish your contribution, Bruce; the ability to charm the Hansons of the world, to recognize weakness equal to your own -- seduce and corrupt them -- is a talent in and of itself.   But Martin Bird... there’s your artist.   A conjurer. A master of the dark arts of black money.   Placement, layering, integration;  30.  (MORE) Chicago to Panama, Moscow to Tel Aviv, this man can make one-hundred million dollars of dirty money disappear like spit on a hot skillet. Liz muffles a sob, Bruce takes her hand, she pulls away. LIZ Mr. Rio? DEL “Del Rio.”   Arturo Del Rio.   Like Dolores Del Rio. LIZ I have to pee? DEL Of course. Del helps Liz off the low couch.   Wiping tears, she scuttles into the john, bolts herself in.   Del sits to the muted sound of Liz retching. DEL When I was nine, I started working in my parents’ grocery store. Stocking shelves, unloading produce.   It’s tough, grocery.   Low margins, spoilage, shrinkage, competition.   But, people gotta eat.   My father loved working the floor, the public.   My mother, not the warmest of women, took care of the books, rarely left the back o",
      "dialogue_count": 0,
      "word_count": 2333
    },
    {
      "scene_number": 3,
      "slugline": "INT. HANSON & SON TRUCKING-SERVICE BAY - NIGHT Marty opens his eyes, Del leans over, snaps his fingers. DEL 500 million.   In five years? Marty looks, sees Bruce being barreled.   Remembers... MARTY Five-hundred   fifteen .   No question. Del considers. DEL You have forty-eight hours to get my money.   Cash.   No negotiable instruments, no cashiers checks, no wire transfers.   Cash.   All of it. Del wags his gun at Marty-- leave.   Marty staggers to his feet, takes a dozen unsteady steps. DEL Marty... Marty turns, relief pivoting to fear, eyes darting. DEL When I drive by?   I better see a ‘For Sale’ sign on your lawn. Marty nods, a weak smile.   He shuffles into the shadows. EXT. MARTY’S HOME - NIGHT A single light spills from the second floor master bedroom. INT. MARTY’S HOME-BEDROOM - NIGHT Marty kneels in the closet, clothes parted, opens a small safe bolted to the floor.   Wendy hovers, on the edge of panic, voice lowered to keep the children from waking. WENDY No!   There’s no choice here... Jesus, Marty, stop!   They killed Bruce.   We’ve got to go to the police! Marty pulls out two neat stacks of cash; ten-thousand, bank- wrapped.   He stands, kicks the safe shut.  40.",
      "characters": [],
      "action_text": "SUPER: $10,000.   TOTAL: $10,000. MARTY Really, Wendy?   Let’s role play that-- He hustles out of the closet, Wendy on his heels. MARTY I’m Detective Whoever The Fuck. And you, you’re the wife of the top money-launderer for the second largest drug cartel in Mexico.   Go! Wendy cuts nervous eyes toward their closed door. MARTY Police mean witness protection at best.   Prison time.   If we get that far. WENDY “We?”   We?   What are you telling me, our family, our kids are in danger?   “We” don’t launder money for the second largest drug cartel in Mexico, you do.   How are “we” in danger, Marty? MARTY What do you want to hear, Wendy?   A million dollars in hundreds weighs about 22 pounds.   People who drive trucks loaded with cash onto scales and weigh it because there’s too much to count don’t have some code of ethics they adhere to.   What’s your solution?   Hmm?   Tell me. WENDY I don’t know... send Liz to the police.   Bruce didn’t come home. He’s missing.   They’ll find out he’s dead.   Lay the blame on-- MARTY Liz is dead, Wendy.   She’s dissolving in a plastic barrel next to the one they stuffed Bruce in-- She slumps onto the bed, terrified.   Marty calms.  41. MARTY What we’re not going to do?   Panic. We’re going to prioritize. Compartmentalize.   Time management. First thing tomorrow, after we tell the kids, call your friend Laura-- (Wendy blanks) The realtor?   List the house.   Then call a moving company.   Box only what we can put in the van.   Help the kids pack, do it for them, I don’t care.   Come Friday after school-- we’re on the road. He starts out, an afterthought stops him, he turns. MARTY The movers... get three bids. Money’s gonna be tight. INT. MARTY’S HOME-KITCHEN - MORNING  Today Show   on TV.   Breakfast table.   A pole-axed Charlotte puts down a forkful of waffle.   A puzzled Jonah glances at his anxious mother.   Both kids in school uniforms.   Marty with a brave face, stage smile. CHARLOTTE No fucking way am I going. MARTY Stop with the la",
      "dialogue_count": 0,
      "word_count": 1147
    },
    {
      "scene_number": 4,
      "slugline": "INT. BANK OF CHICAGO-VP’S OFFICE - MORNING Real wood.   Real paintings.   Bank Manager hovers, the BANK VP, 50s, solid, mans a large desk, phone on speaker. BANK VEEP Mr. Bird, there seems to be a disconnect vis-a-vis large wire transfers and your expectations about withdrawing it.   In cash. MARTY (rope’s end) By end of business today there will be close to 8 million dollars in 4 separate accounts at your bank.   I suspect that puts you in a woefully undercapitalized position relative to your obligations with the FDIC. So unless you’re the Vice President of the one institution exempt from the liquidity ratio laws governing every other bank in the Western hemisphere, I suggest you call the Federal Reserve at 230 South LaSalle and order up a shitpot full of cash. EXT. AQUA TOWER (DOWNTOWN CHICAGO) - DAY 82 stories of rippling mixed-use luxury. INT. GARY SILVERBERG’S APARTMENT - DAY Uncluttered.   Ivory on ecru on bone.   Stainless steel. Quartz.   Home to a man with zero kids, disposable income. GARY SILVERBERG, 50, Wendy’s Facebook Friend and lover, gapes, dumbfounded... cracks a grin-- GARY Get the fuck outta here-- Wendy exhales from the couch, exasperated, rubs puffy eyes. GARY Your husband, the financial advisor, Mr.   Consumer Reports , is laundering money for the Federation cartel, that’s what you’re telling me?  46.",
      "characters": [],
      "action_text": "She glares.   The look sobers him, he tries to process-- GARY They kill his partner, partner’s wife-- WENDY Fiancee. GARY And two others-- and let him live? WENDY He cleans their money, Gary.   He, he... mixes drug money with company pension plans, 401Ks... He moves it all over the world-- WENDY Invests it, makes money on top of money! GARY Yeah, I get that but-- GARY No offense, Wendy, I’ve seen your house.   How much are we talking about? WENDY I don’t know... millions, tens of millions, hundreds-- I don’t know! She trembles.   He moves to her, wraps an arm around her. GARY Shh.   It’s okay.   We’re in Chicago, not some beaner border town.   I’ll take care of it. WENDY How? GARY How?   Really? He gives her a squeeze, his tone upbeat, consoling. GARY Do you love me? (she nods) Because this lawyer loves you.   And this particular lawyer is a partner with arguably the most powerful law firm in town.  47. WENDY You’re an environmental lawyer. GARY I’m a partner.   With other partners who are the top criminal lawyers in Chicago.   Lawyers who know every judge, D.A. and States Attorney with lead in their pencil.   Come Monday, you and I will be sixty stories up and your money- laundering husband will either be in jail or in federal protection. His choice. WENDY You, me and   my kids   will be sixty stories up.   That’s what you meant right?   My kids? GARY I thought it was inferred. (beat) We need to work on articulating your story. (Wendy puzzled) I assume Marty’s hidden profession came as a shock, right? WENDY (guilty beat) Let’s assume that it did, yes. Gary unsettled by the tacit admission of guilt, recovers. GARY Cross that bridge when we come to it.   What you need to know is you’re good.   Your kids are good. She nods, comforted.   He kisses her. GARY I’m never letting you go.   And certainly not to   the Ozarks .   Good Lord, what’s that even like? Camouflage as a primary color? Pickup trucks with those... those big rubber testicles they hang from trailer hitche",
      "dialogue_count": 0,
      "word_count": 795
    },
    {
      "scene_number": 5,
      "slugline": "EXT. EVANS INVESTIGATION AND SURVEILLANCE - DAY Strip mall: Title loans.   Tanning salon.   Subway . Camry parked in a “Reserved for Evans Investigation” spot. BOB EVANS (PRE-LAP V.O.) Gary Silverberg... INT. EVANS INVESTIGATION - DAY Small.   Organized.   Framed photos of CHICAGO POLICE circa 1980s.   Detectives in suits.   Commendations.   A capable man. BOB EVANS (V.O.) He’s a partner with McNeil-Roberts downtown.   Know him? BOB EVANS, 60, shirt-sleeves, ex-Chicago P.D., mans a tidy desk, waits.   Marty in the client chair, flips through a Manila file, photos: Wendy and Gary about town, smiling, close.   In various stages of undress.   Marty shakes ‘no.’ BOB EVANS On the board of half a dozen non- profits; Academy of the Arts, Goodman Theater, Joffrey... one of those.   They see each other at least twice a week.   Sometimes more.   Either his place or halfway between here and the city; an H.I. Express, Fairfield Inn... the Doubletree in Alsip’s where I tagged ‘em. (off Marty’s look) Guy makes four-hundred grand, he can afford better, I’m guessing it’s convenience. MARTY How long? BOB EVANS Hard to say. Marty closes the file, rocked.   The word “SUGARWOOD” scrawled in Sharpie across the file’s tab. MARTY “Sugarwood.”   What is that?  50.",
      "characters": [
        "BOB EVANS"
      ],
      "action_text": "If you have a legal problem I’m not aware of -- don’t tell me if you do -- you could keep your identity, leave the country, go somewhere with no extradition to the U.S. Really depends on who’s looking for you and how much money they have. Marty’s laugh straight from the gallows. MARTY The computers in my office were stolen last night.   All of them. BOB EVANS You download the footage I sent? Marty meets his eyes, he did.   Evans sighs. BOB EVANS Tit, meet ringer.   Let’s hope your wife and Mr. Silverberg don’t wind up splattered all over the internet. Marty’s phone signals a text.   He checks it-- incredulous. MARTY It’s the bank.   My wife just emptied our checking and savings. BOB EVANS You got a gun? Marty shakes his head. BOB EVANS Good.   Aqua Towers.   Sixtieth floor.   Apartment 6003. MARTY What makes you think she’s there? BOB EVANS It’s Thursday. INT. MARTY’S CAMRY (MOVING) - DAY Marty accelerates, mobile to an ear-- Wendy’s voice mail: WENDY (V.O.) (over phone; voice mail) Hi this is Wendy, leave me a--  52.  BOB EVANS (CONT'D) Marty throws his phone into the passenger seat, grips the wheel in a black fidget. MARTY You bitch.   You thankless bitch. (detonates) Fuck you Wendy!   FUCK YOU! INT. GARY SILVERBERG’S APARTMENT - DAY A knock on the front door.   A beat.   The lock clicks, the door opens, Wendy eases in, slips the key card in her purse. WENDY Gary...? A breeze carries her through the apartment.   She nears a corner, sees Gary, seated at the table near the balcony, sliding door open.   He stares at her through a swollen eye, cut lip, frightened. She rounds the corner, freezes-- Enforcer 1 sits at the table, points a Glock at her. EXT. AQUA TOWER - DAY Marty’s Camry wheels to the curb, a handicapped spot.   He boils out of the car, slams the door. MARTY Twenty-two years... Marty stalks past head-turning pedestrians. MARTY Never cheated on you.   Not once. Had the chance.   And not just a few times.   Worked, came home, got up did it all over again.  ",
      "dialogue_count": 1,
      "word_count": 1586
    },
    {
      "scene_number": 6,
      "slugline": "INT. BANK OF CHICAGO-LOBBY - MORNING Marty follows an ASSISTANT MANAGER past dozens of customers, empty duffel slung over a shoulder, large American Tourister in one hand, pink suitcase in the other, a faded   My Little Pony   sticker still attached. INT. BANK OF CHICAGO-CONFERENCE ROOM - MORNING Marty and his suitcases enter, Bank Manager greets him, two SUITS, 30s, converge, one puts a finger to his lips. BANK MANAGER (loud, enunciating) Mr. Bird, good to see you sir. Marty confused.   Suit 1 wands him.   Suit 2 displays a billfold: F.B.I. BADGE, photo. BANK MANAGER Can I get you a cup of coffee? Suit 2 holds up a sign: ARE YOU UNDER DURESS? MARTY What...?   No, no. A second sign: HAS THERE BEEN A KIDNAPPING?   Marty shoves the wand away. MARTY No, stop.   Look, I appreciate your concern.   There’s no wires on me. Nobody’s kidnapped anybody.   I just... I have a business opportunity that requires cash. FBI AGENT 1 There are no business opportunities that require cash.   Not legal ones. MARTY Agree to disagree.   Where’s my money? BANK MANAGER As I told you, we can’t cover that amount within twenty-four hours. Marty’s gut churns, world unraveling.   Steels himself.  58.",
      "characters": [],
      "action_text": "MARTY There are two federal agents here. Which means you wouldn’t take the chance there was a kidnapping and you didn’t have my money.   So if you don’t produce it, immediately, I’m walking into that lobby and letting everyone know that I can’t get my money out.   Let’s see how long that takes to go viral and you have a good old-fashioned run on your bank.   And then you-- (in Bank Manager’s face) --can play George Bailey in my version of It’s   A Wonderful Goddamn Life.   What do you say?   Do you think the good people of Chicago resemble Bedford Falls folk?   My money says ‘no!’   Now, if I want to put all seven-million nine-hundred forty-five thousand, four hundred dollars into a hot tub, get buck naked and play Scrooge McDuck that’s none of your business. Where’s my money? INT. CHICAGO BANK-LOBBY - MORNING Marty lugs the wheeled Tourister behind him, strains against the 40 pounds loaded in the pink one, another 40 in the duffel over a shoulder. SUPER: $7,945,400.   TOTAL: $7,993,050. INT. BIKE SHOP - MORNING Marty’s Trek on a bike stand, BIKE SHOP OWNER turns the pedals, watches the gears engage.   Smooth.   Marty observes. BIKE SHOP OWNER Fifteen hundred.   Cash. Marty rocked, sputters. MARTY That’s a twelve thousand dollar Trek Madone.   This is carbon!   You can sell it for nine, easy. BIKE SHOP OWNER Let’s hope so.  59. MARTY Seven thousand. BIKE SHOP OWNER Take seven grand worth of risk to make two?   See ya. Marty near the end of his rope, glances at the cash register. Owner reads the look, hand closing around a gear wrench. Marty abandons the thought, points to a used 12-speed. MARTY Three grand and throw in that bike. BIKE SHOP OWNER Two.   And I’ll sell you-- He gestures to a sun-bleached beater apologizing in a corner. BIKE SHOP OWNER That bike.   For a hundred. MARTY Fifty. EXT. CHICAGO POLICE H.Q. - DAY The Camry creeps into a no-parking zone, metal letters on the building declare CHICAGO POLICE HEADQUARTERS.   Stop.   The trunk lid bounces once on t",
      "dialogue_count": 0,
      "word_count": 2128
    }
  ]
}