{
  "slug": "pacific-rim-2013",
  "title": "pacific rim",
  "genre": "action",
  "format": "film",
  "scenes_count": 20,
  "characters_count": 6,
  "characters": [
    "PENTECOST",
    "ANCHOR",
    "RALEIGH",
    "MAKO",
    "CZERNY",
    "FLICK"
  ],
  "total_words": 27508,
  "total_dialogue": 9,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. LOCCENT GALLERY -- LATER Pentecost leads Raleigh through an observation gallery overlooking a mission control center buzzing with OFFICERS. PENTECOST Here's our LOCCENT. Much like your own back at LASG, no doubt. A plethora of consoles fan out from an incomprehensible mosaic of holographic data filling the dome-shaped screen that encompasses the command center's front wall. PENTECOST (CONT’D) It's a drill. Raleigh lingers, squinting at the officer at the center of the action: a broad shouldered Japanese man in a crisp uniform -- COMMANDER KAZ TAKADA (50). PENTECOST (CONT’D) Commander Takada... RALEIGH I thought that was him. Why's he running drills in LOCCENT? PENTECOST The Supreme Commander doubles as CO of the Tokyo Strike Group. INT. SHATTERDOME -- DAY Pentecost leads Raleigh onto the mezzanine overlooking the main floor of the Jaeger launch bay. Below - the wide floor of the launch bay. Sunlight spills through the open top of the partial dome onto the mammoth machines and giant equipment needed to service the Jaegers. The nearest Jaeger stands at its docking tower: A Mark-2 dubbed TACIT RONIN. Lean and nimble, his streamlined armor flecked with stark digital camo - steel blue on cool grey. An ultra-modern twenty-six story kickboxer. PENTECOST There's Tacit Ronin. And -- ah, yes, her crew's actually over here. Two Jaeger jocks sit on the edge of mezzanine platform, a young couple in matching track suits. We've already met Kaori Jessop. The man is her husband - DUC JESSOP (23). Korean-Australian. An Asian face, but the bleached hair and drawl of an Aussie surfer. The flashy boots he wears with his jumpsuit testify to his love of Westerns.  15.  (CONTINUED)",
      "characters": [
        "PENTECOST",
        "ANCHOR"
      ],
      "action_text": "Raleigh starts to walk faster, almost jogging across the wide, busy floor to get a clear look at the Jaeger. Finally, a huge repair crane rolls away, revealing the Jaeger. Raleigh's mouth gapes at the sight of it. RALEIGH (reverent) Gipsy Danger... GIPSY DANGER -- Less humanoid than the Mark-2, burlier, more bestial, with back-bending t-rex legs. A monster for the monsters. Armor mottled smoky green and charcoal, bearing the proud scars of all the fights that failed to bring her down. A dinosaurian gladiator; mighty, iconic. PENTECOST You know it? RALEIGH Are you kidding? I was fifteen. I knew all their names... Pentecost crosses his arms with a smirk as he watches Raleigh stagger closer, in an awed trance. RALEIGH (CONT’D) This was LA's first Jaeger. This was the reason we got to sleep at night. The reason I am what I am. He lays his palm on the armor, and cranes his neck to marvel at her history, blazed in decals like a soldier's tattoos: a US flag, a Bear Flag, the Rising Sun, the flag of Tokyo, even retro nose-art -- a buxom gypsy pinup riding a bomb. RALEIGH (CONT’D) I can't drive this. This is like Apollo. She's a monument. She should be in a museum. PENTECOST They tell me she's got one or two more fights left in her... Do you? Raleigh smiles earnestly with an awed chuckle, but before he can answer, a Japanese voice calls out. MAKO  Is that the American?  Raleigh and Pentecost turn to find Mako standing on a catwalk above. She leans on the rail, warily scrutinizing Raleigh. Pentecost answers in Japanese.  17.  CONTINUED: (2)  (CONTINUED) PENTECOST  Yes. This is Raleigh Antrobus.  (to Raleigh) Your gunner -- Mako Mori. RALEIGH Hi. Good to meet you. Mako eyes him, and crosses her arms. MAKO  Is he talking to me, Sensei?  PENTECOST  You want to come down and say hello, Lieutenant?  It hits her -- He doesn't speak Japanese. MAKO  Would it make any difference what I said to him, Sensei?  Pentecost sighs. He has no response. Mako gapes at him, astonished by the impl",
      "dialogue_count": 2,
      "word_count": 5763
    },
    {
      "scene_number": 2,
      "slugline": "INT. CONN-POD 1 -- CONTINUOUS PENTECOST (FILTERED) Nothing. Stay focused, Roma-1. RALEIGH Alright, Mako, I'm setting you up for an IR burst. Get ready. MAKO (FILTERED)  Ready.  EXT. FREEWAY -- CONTINUOUS A barrage of missiles SCREAMS from the Jaeger's hips to pummel the ground at Slattern's feet. Tumescent clouds of smoke and dust erupt to engulf the beast. INT. CONN-POD 1 -- CONTINUOUS Raleigh gapes at the smoky stew. RALEIGH What the hell, Mako? IR! Not missiles! IR! INT. CONN-POD 2 -- CONTINUOUS Mako shouts at him in furious Japanese. We hear Pentecost translate for Raleigh, in a much cooler tone. PENTECOST (FILTERED) You routed her to missiles. INT. CONN-POD 1 -- CONTINUOUS RALEIGH The hell I did! PENTECOST (FILTERED) Log confirms it, Roma-1. He shakes his head and watches his targeting pipper drift helplessly over the wall of smoke, unable to find a lock. RALEIGH Lost him... Shit... INT. CONN-POD 2 -- CONTINUOUS RALEIGH (FILTERED) Too much particulate noise. Mako stares, transfixed by murk stirred up by the missiles. The oily black smoke swirls and billows in the fog, a formless curtain hiding the giant monster.  38.  (CONTINUED)",
      "characters": [
        "RALEIGH",
        "MAKO"
      ],
      "action_text": "TRESPASSER, the first kaiju. We see only its head above the buildings -- long and crocodilian, scabrously armored with rugged scales and scutes. RALEIGH Osaka? You were in Osaka? Young Mako presses her small hand to the window pane. YOUNG MAKO  My dad said monsters weren't real.  She looks over her shoulder to Raleigh, her eyes quivering. YOUNG MAKO (CONT’D)  He's not coming back, is he?  In the distance, Trespasser throws his head back and roars, silent as a distant flash of lightning. We see the soundwave spread over Osaka, shattering windows as it speeds towards us, even after the beast closes its jaws. Finally the delayed ROAR blows out the windows and THUNDERS through the apartment, throwing Young Mako back. EXT. FREEWAY -- DAY (PRESENT) Suddenly, Slattern lunges from the smoky curtain before the Jaeger can react. The mech falls and CRATERS the asphalt. Slattern perches atop the fallen mech and RIPS into his prey. INT. CONN-POD 2 -- CONTINUOUS On the wraparound projection, we see Slattern standing right on top of us, his barbed tail jabbing down like a scorpion until the whole IMAX view flickers to static. Red lights flash. ALARMS go off. Mako lets her head fall back, strangely more frustrated than terrified. INT. CONN-POD 1 -- CONTINUOUS Raleigh shakes his head at the field of static as ALARMS go wild. He reaches behind his ear to disconnect the Pons. The instant he unplugs the wire, the dome of static dissolves into the blank front of the cramped cockpit. INT. THE MOCK-PIT -- CONTINUOUS Pentecost enters the barrel-shaped chamber with a clipboard under his arm. A big steel hemisphere fills the center of the floor, with cables and pistons rising to the ceiling. Hydraulics lift the dome, uncovering the two cockpits, back- to-back, sunken into the floor. It was all just a simulation.  40.  CONTINUED:  (CONTINUED) Raleigh and Mako peel their helmets off. They remain seated, staring in opposite directions, frustrated and drained. He squats, about to impart his feed",
      "dialogue_count": 2,
      "word_count": 4412
    },
    {
      "scene_number": 3,
      "slugline": "INT. HALLWAY -- CONTINUOUS Raleigh bursts out into the hall just as Mako pokes her head out a few doors down. They exchange a deeply stunned look --  Holy shit, that's us...  Without exchanging a single word, they both scramble down the hall as the KLAXONS blare. INT. CHANGEROOM -- MOMENTS LATER Mako and Raleigh quickly undress, much too anxious to be bashful or titillated. Mako mumbles to herself. MAKO  We can do this. We've trained for this. You trust me, I think.  They pull on their drivesuits: single-piece, form-fitting neoprene jumpsuits laced with intricate webs of fiber optics and studded with an array of data ports. MAKO (CONT’D) I trust you. Raleigh turns. To him (and to us), she just spoke English. RALEIGH What did you say? She looks at him, uncomprehending. MAKO  What? What's wrong?  RALEIGH Sorry... I just -- I thought I heard something. INT. JAEGER LAUNCH BAY -- DAY Duc follows Pentecost across the catwalk. The main floor swarms with activity. DUC It should be us suiting up -- PENTECOST It's not Tokyo. It's Busan -- DUC I know it's Busan, but they're not ready. They're going to -- PENTECOST They'll be fine.  57.  (CONTINUED)",
      "characters": [],
      "action_text": "DUC We'd be finer. Pentecost enters the CAGE ELEVATOR and turns to spell it out for Duc. PENTECOST You'd go to Busan and leave COSDEC command and thirteen million Tokyoites in the care of the crew you didn't think was ready? DUC You can't send them out there! PENTECOST It's not my call, Lieutenant! He slams the door on Duc and rides the cage down to THE MAIN FLOOR where he bursts out and jogs to Gipsy Danger. He finds Raleigh and Mako climbing into their conn-pods at the foot of the docking tower. PENTECOST (CONT’D) Don't sweat it. You'll have audio translation in the ear and text on the HUD. I'll be in LOCCENT. They both nod nervously as TECHNICIANS connect cables to the ports on their drivesuits. He tosses them both a pill. RALEIGH What's -- ? PENTECOST Arocin. For the rads. The Mark-1's pretty much a giant, walking nuclear reactor. They both swallow their anti-radiation drugs. PENTECOST (CONT’D) Keep those subroutines straight. The IR beam's -- RALEIGH -- On the beta channel. PENTECOST  Mako, that temper of yours --  58.  CONTINUED:  (CONTINUED) MAKO  -- Yes, Sensei.  PENTECOST No showboating! Your job is to keep that KJ busy! And stay alive! (beat)  You hear me, Mako? Don't try to impress anybody! This isn't a test!  (beat) You've got this! Okay? RALEIGH Thank you, Sensei.   MAKO  Thank you, Sensei.  They both strap on their helmets and give the signal. The canopy on the conn-pods slides closed, sealing them in their self-contained control capsules. The loading arms CLATTER up the tower, hoisting the conn-pods up to their loading positions on the Jaeger. The lower arm swings to deposit Mako's pod on the Jaeger's spine, which hangs out like a ramp to draw the pod inside the torso before closing over it. The armor BUCKLES shut. INT. CONN-POD ROMA-2 -- CONTINUOUS Without the display activated, the cockpit is cramped and dark. Mako shuts her eyes and breathes deep as she feels the pod SHUDDER and LOCK into place. INT. JAEGER LAUNCH BAY -- CONTINUOUS The upper arm de",
      "dialogue_count": 0,
      "word_count": 883
    },
    {
      "scene_number": 4,
      "slugline": "INT. LOCCENT -- CONTINUOUS General Takada stands behind a central dais from where he coordinates LOCCENT's complement of various OPS OFFICERS, TECHNICIANS, and TELEMETRY SPECIALISTS. TAKADA Is the Pons hot? OPS OFFICER Yes, sir. They're both plugged in. TAKADA On the masterboard. A new insert pops up on the wide front-screen; two waveform patterns zigzagging wildly out of sync -- not that we can read it, but we see the reactions of the people who can: Pentecost turns to glare at the General, but Takada ignores him, just scowling at the screen. Kaori gasps and covers her mouth. Duc runs his fingers through his hair. KAORI (whispering to Duc)  We have to do something...  DUC  There's nothing we can do.  EXT. KOREA STRAIT -- DAY The ROARING Jumphawks fly in formation over choppy seas, carrying Gipsy Danger into rough weather ahead. DISPATCH (FILTERED) Roma-1, Your target is a cat-3 kaiju. Reporting name: Invidia. Has demonstrated the capacity to absorb and reconstitute directed energy volleys. Recommend you limit your attacks to melee and solid projectiles. Invidia is moving inland from Haeundae Beach. Drop zone will put you one klick West to intercept. ETA: three and a half minutes. Good hunting. EXT. BUSAN COAST -- DAY A heavy, tropical rain clouds the shapes of the cluttered towers and high-rises along the water's edge. Columns of smoke rise to tangle with the low storm clouds. SUPER:   Haeundae Beach -- Busan, South Korea  Gipsy Danger WHOOSHES past as the V-50s bring her in.  61.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 251
    },
    {
      "scene_number": 5,
      "slugline": "EXT. HAEUNDAE BEACH -- CONTINUOUS The rain pours as the kaiju INVIDIA stalks through the fresh devastation. A spindly, mantid shape; tall as a skyscraper. She twists her viper-like head to HISS at a squad of fighter jets. She lashes out with her mantis-arms as the jets SCREAM by, unloading a hail of BOMBS that only annoy the beast. With the shape of Gipsy Danger growing larger and darker in the rain-smeared sky, the jets bank away, leaving the fight to the pros. The V-50s swing around to drop the Jaeger up the street from the kaiju. The road SHUDDERS as Gipsy Danger's weight hits. INT. CONN-POD ROMA-1 -- CONTINUOUS RALEIGH Okay, Mako. Motor active in three. Mako, confirm. PROXY-2 (FILTERED) Confirmed. RALEIGH Three, two, one -- motor active. EXT. HAEUNDAE BEACH -- CONTINUOUS Invidia turns to face this new challenger, cocking her head. She unfolds a set of long translucent wings. Her wings beat so fast that they seem to wave very slow, not enough to get the monster off the ground, but enough to make her more nimble than something of her size should be. Her THRUMMING wings VIBRATE the buildings like a tuning fork and stir up transient vortexes, strong as tornados, flinging cars and buses about before dissipating. INT. LOCCENT -- CONTINUOUS The tension in the command center spikes as they witness the kaiju's astonishing speed. We hear Mako's Japanese on the radio a few seconds before the Proxy starts to translate. PROXY-2 Raleigh. Autocannon. EXT. HAEUNDAE BEACH -- CONTINUOUS RALEIGH (FILTERED) Autocannon hot.  62.  (CONTINUED)",
      "characters": [],
      "action_text": "The Jaeger's huge Gatling gun SPEWS a steady stream of rounds, each big enough to SHATTER a car, CUTTING a swathe of devastation as it swivels to track the kaiju. But Invidia evades the fire, dancing around the plumes of shrapnel with the aid of her BUZZING wings. The gun ROARS, punching craters in the street and slicing through an office building, but not catching the fleet-footed Invidia before she FLITS out of sight, too fast. INT. CONN-POD ROMA-2 -- CONTINUOUS Mako curses in Japanese as Invidia slips away. INT. CONN-POD ROMA-1 -- CONTINUOUS RALEIGH Goddamn it! It's those wings. She's too fast for a Mark-1. EXT. HAEUNDAE BEACH -- CONTINUOUS Out of sight, the DRONE of the monster's wings provide the only hint of her trajectory. Gipsy Danger shuffles her huge mechanical legs to track the supposed path of the kaiju; built for brute strength and naked power, simply too slow to match the beast's movements. The DRONING grows, SHUDDERING nearby buildings -- Invidia is getting closer. A few blocks away, she draws a predatory circle around Gipsy Danger, skittering over and between the boxy urban terrain. The Jaeger turns slowly clockwise, trying to zero in on the sound as Invidia remains easily outside the periphery. INT. CONN-POD ROMA-2 -- CONTINUOUS MAKO  LOCCENT, I need a bird's eye from one of the V-50s.  An aerial view of the battle area opens up on her wraparound display. On it, she spots Invidia coming to a position just behind the Jaeger, preparing to pounce. MAKO (CONT’D)  Raleigh, she's on our six!  On the aerial, Invidia lunges for the Jaeger's back, her mantid arms open for the kill. MAKO (CONT’D)  Incoming! Get down! Down! Down!  63.  CONTINUED:",
      "dialogue_count": 0,
      "word_count": 546
    },
    {
      "scene_number": 6,
      "slugline": "INT. CONN-POD ROMA-1 -- CONTINUOUS Raleigh hears Mako's frantic Japanese and feels her anxiety, unnerved by the translation delay. PROXY-2 (FILTERED) Raleigh, she's on our six! Incom-- EXT. HAEUNDAE BEACH -- CONTINUOUS Gipsy Danger crouches just as Invidia soars over -- her taloned legs GRAZING the Jaeger's shoulders. The kaiju alights in the road ahead and turns to face the Jaeger. She rears up SCREECHING, and throws her mantid arms open to tower over Gipsy Danger; an intimidation display. INT. CONN-POD ROMA-1 -- CONTINUOUS Raleigh catches his breath, utterly daunted. RALEIGH We're -- we're too slow... The MURMURING voices in the Pons swell, spilling over each other in tense fragments. MAKO (V.O.)  Silence...  RALEIGH (V.O.) Like an anchor... MAKO (V.O.)  Comes flooding back...  RALEIGH (V.O.) Dragging me down... Drowning... MAKO (V.O.)  I've never had to try before...  EXT. LEO CARRILLO STATE BEACH -- NIGHT (DRIFT) Raleigh and Yancy stand atop the sea-battered rocks. MAKO (V.O.)  I don't know how...  YANCY What do you need me to do, Rals? MAKO (V.O.)  I don't know what to do...  RALEIGH I need you to get out of my head!  64.  (CONTINUED)",
      "characters": [
        "PENTECOST"
      ],
      "action_text": "Maddened by the noise in his head, Raleigh finally spins to face his brother, finding himself -- INT. OSAKA PENTHOUSE -- NIGHT (DRIFT) Young Mako stands at the tall windows, watching Trespasser's rampage. She looks over her shoulder to Raleigh. YOUNG MAKO  He's not coming back, is he?  She turns back to watch the monster. YOUNG MAKO (CONT’D)  I don't know what to do...  Trespasser throws open his jaws in a silent roar and Raleigh sets his jaw and marches towards Young Mako with purpose. Outside, the roar's sound-wave rips through high-rises as it spreads closer. Raleigh stands beside Young Mako at the window and offers his hand. She looks up at him, uncertain, but finally she takes it, a critical connection -- -- just as the ROAR blows out the windows. But it doesn't throw either Raleigh or Young Mako back. Their hands clasped, it washes over them -- a baptism of THUNDER. INT. CONN-POD ROMA-2 -- DAY (PRESENT) Mako's eyes shoot open with urgent clarity... and when she speaks, it sounds like English to us. MAKO Raleigh, I need you to -- INT. CONN-POD ROMA-1 -- CONTINUOUS It sounds like English to Raleigh too, but he doesn't have time to be astounded. They have a job to do. MAKO (FILTERED)   PROXY-2 (FILTERED) RALEIGH Shut the hell up! I heard her! INT. LOCCENT -- CONTINUOUS Pentecost catches it first. He looks up at the Pons readouts on the masterboard. Proxy-1 starts to translate \" Shut the hell up \" into Japanese, but Pentecost interrupts him. PENTECOST Stop translating. Cut the com.  65.  CONTINUED:  (CONTINUED) PROXY-2 You want us to leave them -- PENTECOST Look at the interlace! TAKADA Commander? PENTECOST He \"heard\" her. INT. CONN-POD ROMA-1 -- CONTINUOUS RALEIGH He can absorb energy -- MAKO (FILTERED) The wings are too thin. I think we can burn them and -- RALEIGH -- slow him down! Right right! Okay, IR beam is up. EXT. HAEUNDAE BEACH -- CONTINUOUS Gipsy Danger's chest opens up to reveal an elaborate array of lenses and mirrors that begin to glow white hot. A h",
      "dialogue_count": 1,
      "word_count": 2196
    },
    {
      "scene_number": 7,
      "slugline": "EXT. THE ESCHATON INSTITUTE -- NIGHT A bonfire swells, spitting embers into the starry night sky as Czerny heaps more kindling onto the blaze. Flick sits across the fire. Newt stands, arms crossed, wary. CZERNY The Interstice is a gateway to another universe. An older universe. A dying universe... He chuckles and gets a distant look in his eyes as he gazes into the bonfire. His smile fades. CZERNY (CONT’D) I read an article about how a particle accelerator could create a new universe. Nonsense, right? Technology far beyond us. !  (beat) The Anteverse, across the Interstice, is home to a civilization eons older than Man. FLICK Newt? -- What's he saying? CZERNY They created our universe, to escape the death of their own. And we are merely an infestation to them. Rats on their life raft. NEWT A while ago, you told me you were on the verge of a breakthrough. Something that could turn the tide? CZERNY That’s why you’re here? You want to know how to stop them? FLICK I’ve got a contact at Central Command. Whatever you have, Doctor, I can put it in front of the brass. He scratches his chin, a baffled grin on his face. NEWT What were you working on? What did you see in the Interstice? CZERNY Not something in the Interstice. A way to look through the Interstice.  74.  (CONTINUED)",
      "characters": [],
      "action_text": "NEWT How? CZERNY Are you having nightmares, Miss Kincaid? Worse than usual? NEWT We’re trying to ask you -- CZERNY And I’m trying to tell you. They're coming from the Interstice -- the nightmares. It's broadcasting nightmares. Psychic pamphlet bombs. (whispering) I found a way to use that signal to see into the Anteverse... Newt stands up. He's heard enough. NEWT This is ridiculous. Psychic signals, Ivo? Really? CZERNY Midway has technology beyond your wildest dreams. We mapped the Interstice's geometry. We discovered states of matter -- NEWT You mapped the Interstice? CZERNY It can't be closed, Newt, it -- NEWT But it has to have a weak point, right? A targeted detonation -- This catches Czerny, it takes him a moment to cut Newt off. CZERNY -- would just open it wider. NEWT I want to see the map... CZERNY The map isn't important. NEWT No, psychic transmissions are what's important. (shaking his head)  75.  CONTINUED:  (MORE)  (CONTINUED) What happened to you? You used to be a scientist. Czerny shakes his head and sighs. He stands and calmly rests his hand on Newt's shoulder with a smile. CZERNY I'm tired, Newt... We can talk more tomorrow if you feel like listening... Newt and Flick watch him shuffle up towards the main house. NEWT I'm sorry, Flick. I didn't know he was this far gone. Flick watches Czerny with suspicion in her eyes. FLICK He's hiding something. NEWT Maybe. But what can we do? FLICK We can find it. Go see if you can get into his study. I'm going to check out that Quonset hut. INT. QUONSET HUT -- CONTINUOUS Flick steals into the darkened storage hut, finding it full of unlabeled crates. Without turning on the lights she drags one out into the middle of the floor and strains to pry open the lid with her bare hands -- she doesn’t know what kind of time she has. Finally getting it loose, she tosses the lid aside and claws through the packing material. Finally she pulls out -- a generic bottle of water. She looks around at all the crates and her imaginat",
      "dialogue_count": 0,
      "word_count": 838
    },
    {
      "scene_number": 8,
      "slugline": "INT. BACKROOM -- CONTINUOUS Czerny turns on the lights as he leads Flick inside. She stops at the threshold, daunted by the sight: Beside an examination table, a 200 gallon aquarium, wherein a wrinkled coil of meat hangs in aspic-colored liquid, peppered with electrodes. Big as a man, it can only be kaiju’s brain. And then she notices what looks like a rough-hewn Pons on the floor between the table and the vat... CZERNY Well, you’re about to have a drift with a kaiju. INT. MAIN HOUSE -- NIGHT Newt moves through the darkened hallway. INT. CZERNY'S STUDY -- CONTINUOUS In the dark, Newt searches the rustic outback office. He turns on a flat wall monitor -- \"no signal.\" So he follows an AV cable from the monitor to a nearby cabinet. Opening the cabinet, he finds a hard drive stamped with COSDEC's seal, and a menacing anti-theft warning from Sci- Division. Jackpot. He grins and flicks it on. The \"no signal\" message vanishes from the monitor, but nothing else comes up -- just an empty pale glow. Frustrated, Newt keeps searching. He looks in the closet. He opens desk drawers. He crouches to look under the desk -- and on the floor, level with the top of the desk, he stops. We see what's caught his attention: a pair of humble reading glasses, but lined up with the glowing wall monitor, we see in the lenses shapes and colors that aren't there. Newt carefully puts the reading glasses on, and THROUGH THE LENSES clearly sees a 3D projection hanging in the air before the glowing monitor: a hidden holographic interface, invisible without the reading glasses. Finding he can manipulate the data with his hands, Newt opens folders, probing deeper and deeper into Czerny's database... INT. BACKROOM -- NIGHT Flick lies on the examination table. Czerny tightens the straps around her wrists and ankles.  78.  (CONTINUED)",
      "characters": [
        "CZERNY"
      ],
      "action_text": "FLICK I don’t have a wetport. CZERNY We’ll have to do it how we did it before the implants. He shows her the end of a data transmission cable. In place of a mundane connector, the wire terminates in a three inch gold needle, a little thicker than a hypodermic needle. FLICK You’re going to stab that into my brain... CZERNY Carefully. FLICK Could this kill me? CZERNY How badly do you want to see it? Without saying anything, she rests her head on the table. Czerny secures her head, neck, and shoulders in a metal brace designed to keep her skull steady for the delicate procedure. He flips on a small video screen -- on it, he sees a grainy ultrasound image of her brain. He dabs a topical numbing agent on the soft patch of skin behind her ear. CZERNY (CONT’D) I’m numbing you, but it’s going to hurt. Just keep still. I’m aiming for a specific spot. If I miss, you might forget the letter R or you might become a vegetable. Ready? She nods and Czerny lines up the needle. He pierces the skin and gingerly pushes the needle in. She fights to contain her reflexes as her limbs strain against the leather straps. Her face tenses with pain as he guides the needle deeper, watching its progress on the ultrasound, finally finding the targeted section of her brain. The needle, all the way in. He twists a dial on the makeshift Pons. CZERNY (CONT’D) I’m sending a test signal. You should smell chocolate. Do you?  79.  CONTINUED:  (CONTINUED) When she speaks, she can’t hide her pain. Her words spill out slurred and desperate. FLICK Yuh-yuh-yes. I smell it. CZERNY Alright. Then you’re good to go live with the specimen. He flips a switch on the Pons. In the tank, the disembodied brain shivers. Flick gasps. She speaks, oddly loud, as if trying to be heard over music only she can hear. FLICK Voices... I think I see -- something... Oh god... Where am I? He rests his palm on her forehead and answers her quietly, knowing she can’t hear him. Her mind is elsewhere. NEWT The other side, child. And wit",
      "dialogue_count": 2,
      "word_count": 1868
    },
    {
      "scene_number": 9,
      "slugline": "INT. BACKROOM -- CONTINUOUS The door splinters open and Newt rushes in to find Flick drenched in sweat and so pale, almost blue. He pulls the needle out of her brain and unfastens the straps. The drift seems to linger in her mind. FLICK So cold. Can't breath... NEWT Breathe! You have to breathe! FLICK It hurts. Ice in my lungs. INT. CZERNY'S STUDY -- CONTINUOUS The clock ticks -- :44, :43, :42... EXT. THE ESCHATON INSTITUTE -- CONTINUOUS Newt cradles Flick in his arms. Her head lolls as she stares at the sky, seeing another sky, some other place. FLICK No stars. The sky is dead... He briskly carries her to THE JEEP and straps her into the passenger's seat, before climbing in, twisting the ignition, and throttling it so hard that THE REAR WHEELS spin up plumes of red dust, before catching and launching the vehicle up the road. INT. JEEP -- CONTINUOUS Newt's frantic eyes dart between the twisting desert road and the compound's gate, shrinking in his rearview mirror. Flick gags. Her body convulses in her seat. Her back arches as if her spine wants to break her in half. She falls limp. Newt reaches over to feel her pulse as he drives. NEWT No no no! Gimme a pulse, Flick! He can't stop to give her CPR. He knows he's not far enough from the blast yet. He floors it. Her head lolls with the sharp turns, lifeless as a doll.  85.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 248
    },
    {
      "scene_number": 10,
      "slugline": "EXT. OUTBACK ROAD -- CONTINUOUS The jeep bobs and weaves along the tortured road. We pull back to see the escape in context -- the jeep's meandering headlights too slow and still too close to the compound. INT. CZERNY'S STUDY -- CONTINUOUS The final seconds -- :06, :05, :04, :03... EXT. THE ESCHATON INSTITUTE -- CONTINUOUS The pavilion goes up in a mighty CRACK of light followed by a flame-less blast and an incredible shockwave that RIPS through every building in its path, levelling the compound. It speeds out, warping the air and rippling the ground. The wave SLAMS the jeep and tosses it careening end over end. INT. JEEP -- CONTINUOUS Newt steadies Flick's limply flailing body as the jeep rolls. EXT. OUTBACK -- CONTINUOUS The battered jeep finally settles on its side. A moment later, Newt crawls out the sun roof. He turns and pulls Flick's body out after him. He drags her a safe distance from the wreck and checks again for her pulse. Finding nothing, he begins performing CPR as the compound burns in the distance. Cycle after cycle. Compressions, breaths, repeat... Our hearts sink, but Newt doesn't let up. He doesn't shout or lose it; he just keeps at it, like a machine. Suddenly, Flick jolts with a fit of coughing. She weakly pushes Newt away and rolls over to puke. At first, it seems such a fragile miracle, he dares not touch her. She gasps and winces, cradling her CPR-cracked ribs. Weak words spill out of her mouth. FLICK Why did you save me? NEWT What did he do to you? FLICK I did it, Newt! It was my decision! She turns away from Newt, coughing. She holds her ribs gingerly and succumbs to her trembling legs, sitting in the dust. She watches the compound burn.  86.  (CONTINUED)",
      "characters": [
        "FLICK"
      ],
      "action_text": "The air HUMS with electricity as she trains an emerald green targeting laser on Oolong. CRACK — in the searing blink of an eye, a jagged bolt of lightning flashes between the transformers and the kaiju. Oolong recoils, smoke SIZZLING from the flashpoint. MAKO (FILTERED) (CONT’D) Damnit! Weapons short! RALEIGH (FILTERED) We’ll do it the old-fashoined way. Oolong grabs Gipsy Danger in his black claw and drives the Jaeger back, her iron feet GRINDING gullies into the asphalt. The kaiju slams the Jaeger into the two-thousand foot Shanghai Tower. The lower floors SHATTER and COLLAPSE. The soaring glass helix falls,   ! PULVERIZING a quarter-mile of dense city blocks, its pinnacle SMASHING into the river. The throbbing city lights stain the settling dust in lurid color. We see Oolong still bearing down on Gipsy Danger. The beast squeezes the mech in his pincer. But, Gipsy Danger pushes back, prying the it open... RALEIGH (FILTERED) (CONT’D) Push push push! In a sharp outburst of effort, the Jaeger opens the claw so far that the joint CRACKS. Gipsy Danger RIPS off the lower half of the giant claw, and JAMS the chitinous skewer into Oolong's eye. Oolong SHRIEKS and thrashes his dragon-like head. Gipsy Danger grabs the kaiju by the jaws and twists. Finally, Oolong's neck SNAPS. The dead kaiju teeters and CRASHES to the ground. INT. THE MOCK-PIT -- CONTINUOUS Hydraulics lift the lid of the simulated conn-pods as Pentecost enters, carrying his clipboard. PENTECOST Well the tower puts your property damage in the red... RALEIGH Want us to go again?  88.  CONTINUED:  (CONTINUED) PENTECOST You kidding? You beat the time by half. Take the night off. RALEIGH But the property damage... PENTECOST It’s Pudong. Four of the region’s tallest buildings in four square miles. It’s always in the red. (beat) Seriously, call it a night. You ripped through all my scenarios. I need to cook up a new one. Pentecost makes notes on his clipboard as Raleigh and Mako unstrap their helmets and climb out",
      "dialogue_count": 1,
      "word_count": 1373
    },
    {
      "scene_number": 11,
      "slugline": "INT. CONN-POD ZUMA 2 -- CONTINUOUS (GHOST-DRIFT) Tortuga shifts his massive bulk as the sea breeze tosses curtains of mist of his hide. Yancy concentrates but can’t make the targeting pipper find a lock. INT. CONN-POD ZUMA 1 -- CONTINUOUS (GHOST-DRIFT) Raleigh watches as Tortuga plows his weight through the surf, surging towards us. The Jaeger’s aim flinches as Raleigh stops himself from bringing the arm down to block. YANCY (FILTERED) Keep it steady, Rals! RALEIGH He’s charging! EXT. SANTA MONICA PIER -- CONTINUOUS (GHOST-DRIFT) Tortuga bulldozes towards the wading Jaeger, but Coyote Tango holds her aim steady. Tortuga opens his trifurcated beak and launches his harpoon- tongue. The serpentine muscle punches through the Jaeger’s chest armor like a bunker-buster. BACK TO PRESENT RALEIGH How do you know I’m one of those people? MAKO Because it's the part that hurts when you can't. INT. CONN-POD ZUMA 1 -- CONTINUOUS (GHOST-DRIFT) Raleigh feels the very instant his brother dies, and for the first time, we see his reaction... Furious, devastated tears in his eyes, he snaps. His words come out like thunder. RALEIGH No! Yancy! -- Pangs of grief twist his face, choking the words in his throat. His veins stand tight as wires on his temples. EXT. SANTA MONICA PIER -- CONTINUOUS (GHOST-DRIFT) Coyote Tango grabs the harpoon tongue and RIPS the muscle out of the kaiju's jaws, by the ragged root. The Jaeger gathers its other hand in a fist and lands a SKULL- CRACKING blow that sends Tortuga toppling into the shallows.  92.  (CONTINUED)",
      "characters": [],
      "action_text": "Coyote Tango drives her armored fists, one after the other, in an endless siege of mighty freight-train PUNCHES. He doesn't stop. Not even as the PUMMELED sea turns red with gore. Not even as Tortuga’s limbs stop twitching. Smoke begins to spill from the Jaeger's over-taxed muscles; blow after blow reduces its fists to bloody, crumpled knots of machinery -- but still it HAMMERS the lifeless carcass. INT. CONN-POD ZUMA 1 -- CONTINUOUS (GHOST-DRIFT) Raleigh glares through hot tears, his jaw tight with animal rage, utterly consumed by raw anguish. RALEIGH That was my brother you son of a bitch! That was my fucking brother! Through the fog of ALARMS and SHUDDERING machinery, a radio voice calls out to him. DISPATCH (FILTERED) Zuma 1, target subdued. Stand down. But Raleigh shows no sign he hears the command. DISPATCH (FILTERED) (CONT’D) Remote shutdown in 5, 4, 3... BACK TO PRESENT The NOISE of the memory echoes as Raleigh pulls himself up to sit on the edge of the bed, his face in his hands. MAKO You did all you could, Raleigh. You loved him. He pulls his hands from his face and sits in the dark, thinking. Mako just watches. RALEIGH Then it’s not a mistake -- This. Us. We're not a mistake... She sits up and folds her arms around him. EXT. MIDWAY -- DUSK A robust city-sized complex of practical but modern buildings covers the once-desolate spit of land. SUPER:   COSDEC Science Division, Primary Interstice Monitoring Station - Midway Atoll  93.  CONTINUED:",
      "dialogue_count": 0,
      "word_count": 510
    },
    {
      "scene_number": 12,
      "slugline": "INT. MONITORING STATION -- CONTINUOUS A dimly lit control center. A COMMANDER oversees rows of TELEMETRY SPECIALISTS dutifully manning their data terminals. An ALARM goes off. The mood instantly tenses. TELEMETRY SPECIALIST Density spike! Something's coming through the Interstice! COMMANDER Mass estimate? TELEMETRY SPECIALIST Standy-by... These numbers don't make sense... COMMANDER Lieutenant... How big is it? The Telemetry Specialist just shakes his head, confused. INT. JETLINER CABIN -- DUSK A full flight. Flick and Newt chatter quietly. FLICK Are you sure it will work? NEWT Sure enough to try. He turns and looks out the window; a dry, matter-of-fact determination in his voice. NEWT (CONT’D) I don't care if they are the creators of the universe. I like the universe. She leans her head on the seat and watches him with a pining look in her eyes. He turns to add with a chuckle -- NEWT (CONT’D) And I'm not a creationist. -- and turns back to the window. She smiles but doesn't laugh, lost in thought, her gears turning wistfully. NEWT (CONT’D) Is that Mount Fuji? Incredible... OUT THE WINDOW: Mount Fuji's snow-capped volcanic cone rises from a rippled sea of clouds, stained gold and pink by the sinking sun -- a breathtaking vista.  94.  (CONTINUED)",
      "characters": [],
      "action_text": "But Flick doesn't give it a glance. She just looks at him looking out the window, gradually realizing something about this odd fellow. Something important. He turns. NEWT (CONT’D) If that's Fuji, shouldn't we be -- She cups his cheek in her hand and kisses him, suddenly but softly. After a startled flinch, he gives himself to it. The moment draws out. Gossamer and earnest, almost timid -- until finally, Flick gently pulls away. Newt narrows his eyes at her, as if not sure he's awake. Saying nothing, she just smiles. Newt opens his mouth to speak, but is interrupted -- PILOT (FILTERED) We're hearing a kaiju warning has been issued for Tokyo Bay... Newt cranes his neck to look out the window as if expecting to see the monsters. Flick stares dead ahead, anxious. PILOT (FILTERED) (CONT’D) We're being diverted to Toyama... We'll be landing very shortly. Newt notices Flick's white knuckles gripping the armrest. He takes her hand. Their fingers interlace, clinging tightly. EXT. MINATO MIRAI -- NIGHT The city lights scintillate on the water as swarms of Jumphawks hoist Tacit Ronin across Tokyo Bay. DISPATCH (FILTERED) Your target is designated KJ Komodo. Category-4. INT. CONN-POD MEIJI-1 -- CONTINUOUS Duc toggles his pre-fight switches. DUC (sarcastic) Oh, is that all? (to Kaori)  Hey sweetie, did you hear? --  INT. CONN-POD MEIJI-2 -- CONTINUOUS We see Kaori in her own conn-pod, a bit uneasy.  95.  CONTINUED:  (CONTINUED) DUC (FILTERED)  A cat-4. If that doesn't sound fun, I don't know what does.  She lets out a nervous/excited laugh. INT. LOCCENT -- CONTINUOUS Raleigh meets up with Mako, who's already watching from the back of the bustling control room. RALEIGH Did they say cat-4? She nods, her brow furrowed. Raleigh whistles. RALEIGH (CONT’D) What is that, like the third cat-4 anyone's ever seen? MAKO Fourth... They killed the third. DISPATCH Tracking stations report both he's entered Tokyo Bay and is headed for the Minato Mirai waterfront. ETA in less than ten minutes. ",
      "dialogue_count": 0,
      "word_count": 628
    },
    {
      "scene_number": 13,
      "slugline": "EXT. MINATO MIRAI -- CONTINUOUS Ahead of Tacit Ronin, hills of water rise to spill across the street as the kaiju's bow wave heralds its approach. The huge beast hauls itself from the water, onto shore. A long, lizard-like creature called KOMODO. Rows of teeth curl sloppily from his jaws. A baroque frill of coiled and braided horns embellishes his head. He scrabbles on six splayed legs; tail terminating in a spiked thagomizer. He is -- markedly larger than the Jaeger and (as a category-4 kaiju) the largest of any we've yet seen. He shakes the water off his scales and ROARS. Tacit Ronin stands in the shifting carnival light of the towering Ferris wheel, ready for battle. Komodo lumbers onto the street ahead of Tacit Ronin, turning to face the Jaeger. The kaiju rears up on his four hind legs, brandishing his taloned forelimbs. The reptilian monster towers a full head taller than the Jaeger. He throws his head back, RETCHING, and with a neck-snap, SPEWS a wad of noxious bile. It SPLATTERS short of the mech. The sludge BOILS and SEETHES on the cars and pavement below, dissolving anything it touches. Tacit Ronin charges in to engage Komodo hand-to-hand. Her style is different from Gipsy Danger’s; less primal and rugged; more like Bruce Lee, nimble and precise. With lethal grace, she assails Komodo’s scaly hide with a storm of kicks and chops -- taekwondo on an epic scale. Her knifehand strikes cut the air like fighter jets, tracing wingtip vortices off her fingertips. She finishes the combo with a roundhouse kick, a jaw-dropping maneuver for a machine of her unparalleled size. As her feet hit the ground, we hear the metallic GROAN of her settling weight as her frame protests the unorthodox move. INT. LOCCENT -- CONTINUOUS A small alert BUZZES. OFFICER Actuator stress warning...  97.  (CONTINUED)",
      "characters": [
        "RALEIGH"
      ],
      "action_text": "Raleigh and Mako watch, stunned. It was a reckless move. EXT. MINATO MIRAI -- CONTINUOUS In the instant it takes Tacit Ronin to regain her balance, Komodo charges, slashing and snapping. His talons score shallow scars across the Jaeger’s armor. Tacit Ronin staggers back, barely dodging his SNAPPING jaws. The monster pivots to swing his spiked tail. The Jaeger dodges the spikes on the first pass and catches them on the second, clutching the tail in an iron grip. Komodo pulls and thrashes angrily, but Tacit Ronin holds tight. Finally he quivers, HACKING and RETCHING. The Jaeger barely dodges the knot of acidic bile that sails past -- to SPATTER the side of a nearby skyscraper. The glass FESTERS and DRIPS away, exposing more and more of the stacked floors inside, until they can no longer hold the tower's weight, and the whole edifice quivers and COLLAPSES. Again, Komodo rears up on his hind four legs, towering high over Tacit Ronin. INT. CONN-POD MEIJI-1 -- CONTINUOUS DUC  Cutlass laser. Full power. Three second burn.  KAORI (FILTERED)  Three seconds will sap the reserves.  DUC  Gimme three seconds and we won’t need the reserves.  EXT. MINATO MIRAI -- CONTINUOUS A compartment on Tacit Ronin’s forearm opens to deploy a deceptively modest-looking array, and IGNITES a beam of energy that meets Komodo’s exposed chest. A vector-straight line of searing light bores clear through the kaiju’s body in an instant to slice across the sky, an oddly bright laser-light show. With a swing of her wrist, Tacit Ronin pulls the laser up, cleaving Komodo’s torso up the middle.  98.  CONTINUED:  (CONTINUED) The laser turns off. The air around the array still ripples with cosmic heat as the armor folds up to reclaim the weapon. Komodo’s balance holds his dead body up for a brief moment, before his mighty bulk falls. The top third of the beast butterflies open, exposing a macabre cross section of his body cavity, neat as a textbook diagram. The laser-sliced edges still SIZZLE. INT. LOCCENT -",
      "dialogue_count": 1,
      "word_count": 4762
    },
    {
      "scene_number": 14,
      "slugline": "INT. SHATTERDOME -- CONTINUOUS All the Techs on the floor watch on the giant screen. TAKADA (FILTERED) Spread the word. Today, we are kicking the monsters out. Today... EXT. PACIFIC OCEAN -- DAY The reddening sun sinks towards the sea. The V-50 Jumphawks carry Gipsy Danger over the wide water. TAKADA (FILTERED) We are canceling the apocalypse. INT. LOCCENT -- CONTINUOUS On the main screen, we see footage from the V-50's trained on the Jaeger at the end of their cables, and a map displaying their position in relation to the Interstice. Flick stands to the side, biting her nails. Newt joins her. NEWT They crossed their eject triggers. FLICK What does that mean? NEWT Either would save the other sooner than leave them behind. They've got like a second to hit the eject. This way, they won't hesitate. The SERGEANT-AT-ARMS announces the Commander's entrance. The whole room rises in applause. Takada motions them to quiet. TAKADA ETA? OFFICER 1 Two hours six minutes to drop zone. A second Officer puts down a radio to get Takada's attention. OFFICER 2 Commander... It's Midway. TAKADA An attack? OFFICER 2 Multiple hostiles...  117.  (CONTINUED)",
      "characters": [],
      "action_text": "TAKADA Overlay. A red blip pops up on the map; followed by another; and another... A cloud of red dots forms around the Interstice -- literally dozens of kaiju spreading out from the epicenter. NEWT We're scaring them. TAKADA Alert all Strike Groups! Mobilize all Jaegers! MONTAGE -- MOBILIZING THE JAEGERS -- The dense towers and steep, foggy hills of Hong Kong. V- 50s carry the city's two Jaegers in. -- The Sydney Opera House and the Sydney Harbor Bridge rise in the background. Dust stirs in the immediate foreground as a squad of Jumphawks lower Sydney's Jaeger into view. -- Night on the Golden Gate Bridge. Cars stop. ONLOOKERS run to the rail, pointing. They cheer and applaud as the V-50s fly San Francisco's Jaeger over the Bridge. -- One of LA's Jaegers stands on Venice Beach, her lights blazing over the night-cloaked sea. In the distance, her sister Jaeger stands near the Santa Monica Pier. Both wait. EXT. PACIFIC OCEAN -- DAY The Jumphawks hoist Gipsy Danger through the crisp blue sky, nothing but the wide sea beneath them. DISPATCH (FILTERED) Thirty minutes to drop. Suddenly, a huge WORMLIKE KAIJU breaches, rearing high to SNAP his crocodilian jaws at Gipsy Danger. The Jumphawks evade as gravity pulls the monster back down. He SLAMS back into the water throwing up plumes of water. Gipsy Danger sways on her cables as the Jumphawks clumsily regain control of her weight. INT. CONN-POD ROMA-1 -- CONTINUOUS The ocean sways on Raleigh's HUD. He watches the huge shape surge away, just under the water. RALEIGH Whoa! Mako, did you see that?  118.  CONTINUED:  (CONTINUED) DISPATCH (FILTERED) You're passing a wave of heightened KJ activity. Should be a clear shot to the site from here. INT. CONN-POD ROMA-2 -- CONTINUOUS Mako tries to keep her cool. MAKO They can handle it... EXT. ODAIBA -- NIGHT Tacit Ronin stands amidst the modern skyline of the newly developed district. The inverted pyramids of Big Sight. The Fuji TV building. Newer, even more idiosyncratic structures. ",
      "dialogue_count": 0,
      "word_count": 663
    },
    {
      "scene_number": 15,
      "slugline": "EXT. PACIFIC OCEAN -- DAY The Jumphawks release their cables, dropping the Jaeger. Gipsy Danger falls. INT. CONN-POD ROMA-2 -- CONTINUOUS The free-fall lifts Mako against her harness. EXT. UNDERSEA -- CONTINUOUS Gipsy Danger CRASHES through the surface. She drifts down. The blue, sunlit water around her darkens as she sinks. EXT. ODAIBA -- CONTINUOUS Tacit Ronin waits. Lightning. THUNDER. The rain begins to fall in wind-blown torrents. They rise from the storm-darkened tide one by one, less than a mile between, climbing ashore to surround the Jaeger. Kaiju TENGU -- A horrific skein of dozens of viper heads on long sinuous necks erupting from a body like a naked bat. PHARAOH -- Something between a scarab and a bull, with vicious mandibles and long horns like a rhino beetle. SCUNNER -- Beige-hued skin lends it a disturbingly human look; but grotesquely misshapen, joints bulging and twisted. A skull-like face, jaws over-crowded with jagged teeth. The raging wind throws the sea off their towering bodies in fine, misty clouds. INT. CONN-POD MEIJI-2 -- CONTINUOUS Kaori's daunted eyes flit from one to the next. DUC (FILTERED)  Alright... We're all there is between three cat-5's and a city of twenty million people.  KAORI  Let's put up a fight.  INT. LOCCENT -- CONTINUOUS Takada eyes the kaiju on the screen, morbidly astonished. TAKADA Gipsy Danger? OFFICER 1 Six hundred meters...  120.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 229
    },
    {
      "scene_number": 16,
      "slugline": "EXT. THE INTERSTICE -- CONTINUOUS A gap, not in the ocean floor, but in space, just above the ocean floor. A yawning wound in reality, bleeding crimson and electric violet light into the blackness of the deep. In the shafts of otherworldly light and meandering arcs of coronal plasma, we see Gipsy Danger drifting ever down towards the opening, small as a moat of dust. INT. CONN-POD ROMA-1 -- CONTINUOUS The blazing rupture swells across the wraparound HUD, filling the dim conn-pod with unearthly light. We hear it HOWLING outside. Raleigh's face betrays a mounting dread. EXT. ODAIBA -- DAY Kaiju Pharaoh slams into Tacit Ronin, but the Jaeger manages to hold her ground. Monsoonal sheets of rain slash the combatants. Lightning CRACKS the sky. Pharaoh bears down with slavering mandibles, Tacit Ronin strains to hold him at bay. Buildings collapse as their struggle careens through Odaiba, as Tengu and Scunner slowly converge on the sloppy fray. Finally, Tacit Ronin gets the advantage long enough to throw Pharaoh back. The Jaeger deploys her continuous-wave laser. She lights the beam and sweeps it to slice Pharaoh right across the middle. A moment of stillness. Pharaoh's torso slides off his legs along the neat, diagonal cut. The halved kaiju THUNDERS to the ground, dead. Behind the body, the tops of the high-rises slip loose, revealing the same hairline vector that cleaved the kaiju -- the laser had cut through the beast to the skyline behind it. INT. LOCCENT -- CONTINUOUS The kaiju's fall and collapsing buildings are close enough to SHUDDER the floor. The room chatters with urgency. Breathless, Flick stares at the main screen where a blip falls through the digital map of the Interstice's throat. EXT. THE THROAT -- CONTINUOUS The Jaeger falls through the twisting vortex like a sky diver. Curling eddies of plasma stream by. The unworldly HOWL of the Interstice surrounds them.  121.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 317
    },
    {
      "scene_number": 17,
      "slugline": "INT. CONN-POD ROMA-2 -- CONTINUOUS On her HUD map, Mako spots a bogey rising to intercept. MAKO Raleigh! Incoming! EXT. THE THROAT -- CONTINUOUS A solid shape \"falling\" in the opposite direction COLLIDES with Gipsy Danger, a feral KAIJU. INT. CONN-POD ROMA-1 -- CONTINUOUS Raleigh bares his teeth, jumping into his fight response. EXT. THE THROAT -- CONTINUOUS The mech and monster cling to one another, spinning chaotically as they both fall. The Kaiju claws at the Jaeger. Gipsy Danger slugs the beast repeatedly. The mech grabs the beast's head and twists, SNAPPING its neck. It falls away -- and two additional Kaiju hurtle up from the depths to pile into the free-falling Jaeger. EXT. ODAIBA -- DAY Tacit Ronin throws a punch at kaiju Scunner. Scunner catches the strike in his mighty claws and squeezes. The Jaeger strains against him, but Scunner is too strong. He CRUMPLES the mech's fist and RIPS it off the Jaeger's arm, leaving a stump of frayed cables and twisted metal. INT. CONN-POD MEIJI-1 -- CONTINUOUS Duc screams in pain from the sensory feedback. EXT. ODAIBA -- CONTINUOUS The Jaeger quickly sprays gobs of riot foam at the kaiju's hands. The foam bulges and quickly hardens, cementing the kaiju's arm to the ground in a petrified cumulous cloud. Scunner ROARS, yanking to free himself. Before Tacit Ronin can engage the trapped monster, kaiju Tengu is upon her. Tengu's multitude of heads whip and strike at staggered intervals -- SNAP SNAP SNAP -- each hit sinking fangs into the Jaeger's armor. An overwhelming blitz.  122.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 261
    },
    {
      "scene_number": 18,
      "slugline": "INT. CONN-POD MEIJI-1 -- CONTINUOUS Tengu's fanged heads dominate the IMAX-scale vista. Duc watches the storm of HISSING jaws coming right at us on the HUD in endless succession. DUC  Flash freeze!  KAORI (FILTERED)  And empty our coolant?  DUC  We can't defend against this!  EXT. ODAIBA -- CONTINUOUS As Scunner pulls at the knot of rock cementing his arm to the ground, Tacit Ronin turns her coolant hose on Tengu. Tengu vanishes in a cloud of icy vapor as Tacit Ronin empties her coolant reservoirs. The vapor clears, leaving Tengu's frosted husk. Tacit Ronin starts to turn back to Scunner. The remaining kaiju pulls and the hardened foam starts to crack. Finally, it BREAKS off from the ground. With most of the tumor of rock still encasing his arm, he swings it like a club and SMASHES it against Tacit Ronin's torso, a devastating blow that shatters the hardened foam. Tacit Ronin teeters and falls on her back. Scunner climbs atop the fallen Jaeger and lifts his fists high into the air. Like a crazed chimp, he SLAMS his long arms down. INT. CONN-POD MEIJI-2 -- CONTINUOUS The hit BUCKS the pod, knocking the wind out of Kaori and kicking off a cacophony of ALARMS. Looking up at the kaiju as he raises his arms for another blow, Kaori fights to catch her breath. KAORI  Structural integrity compromised!  EXT. ODAIBA -- CONTINUOUS Scunner plunges his arms straight down with a primal burst of strength, SLAMMING his fists down into Tacit Ronin's abdomen.  123.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 254
    },
    {
      "scene_number": 19,
      "slugline": "INT. CONN-POD MEIJI-2 -- SAME A split second -- the pod JOLTS hard, like a high speed car crash, flinging Kaori against her harness; the HUD crashes to static and plunges to black. INT. CONN-POD MEIJI-1 -- CONTINUOUS Duc feels Kaori's sudden absence from his mind. DUC  Kaori? Kaori, come in!  Nothing. No ambient drifting voices. Just silence. INT. LOCCENT -- CONTINUOUS The room THUNDERS with each of Scunner's strikes. The lights flicker. Static skitters across the main screen. Plaster bits fall from the ceiling. Chaos grips the room. PENTECOST Did we lose Kaori -- ? Flick remains tuned out to the chaos, focused on Gipsy Danger's falling blip. EXT. THE THROAT -- CONTINUOUS Gipsy Danger falls deeper into the anomaly, wrestling her Kaiju attackers all the way down. Space seems to distort -- as if viewed through a hyper- exaggerated fish-eye lens. The focal distance shifts. Even the grain seems different. We are falling through the transition between the conflicting physics of two universes. INT. CONN-POD ROMA-2 -- CONTINUOUS Mako winces as she struggles against the Kaijus. MAKO There's too many! RALEIGH (FILTERED) Mako... MAKO They're going to tear us apart! INT. DOJO TRAINING HALL -- NIGHT (DRIFT) Mako stands in the dark hall with her sparring stick. Wild- eyed and dripping with sweat, she fights an endless host of face-less, black-clad ENEMIES closing in on her.  124.  (CONTINUED)",
      "characters": [],
      "action_text": "MAKO We can't fight them! A hand catches her stick. She whirls about to find Raleigh. The Enemies are gone. It's just the two of them. RALEIGH We don't have to. We're close now. MUSIC starts to spill from the turntable. RALEIGH (CONT’D) All we have to do is fall. A calmness settles over her as they start to dance. EXT. ODAIBA -- DAY (PRESENT) Scunner raises his fist high over the Tacit Ronin -- and SLAMS them down again. INT. CONN-POD MEIJI-1 -- CONTINUOUS Trying in vain to raise Kaori, Duc starts to shut down. DUC  Kaori... Please. Come in.  INT. CONN-POD MEIJI-2 -- CONTINUOUS The darkened conn-pod jolts with each blow, but inside we find Kaori bloodied but still alive. She desperately fumbling to get her Pons cable plugged back into the port behind her ear. It must have come out. The moment she does, the HUD comes back to life. KAORI  I'm here! I'm okay!  INT. CONN-POD MEIJI-1 -- CONTINUOUS Duc laughs with relief to hear her voice and thoughts. Tears spill from his eyes. A calm strength falls over him. DUC  Let's finish this...  EXT. ODAIBA -- CONTINUOUS Scunner raises his fists for another strike, but never makes the down-stroke. With her one good hand, Tacit Ronin grabs Scunner's throat. She sinks the jagged metal stub into the kaiju's gut.  125.  CONTINUED:  (CONTINUED) And slowly she rises, gradually lifting the kaiju up -- raising the creature's body over her head. The wind and rain lash her. A flash of lightning. A CRACK of thunder. For a moment she holds the hulk of flesh. We hear her frame GROANING under the beast's weight, but before it can give way, she throws the monster. He smashes through Tengu's frozen body and hits a building. Tacit Ronin's pulse cannon rises from her back to its shoulder-mounted firing position. Scunner pulls himself up from the rubble. INT. CONN-POD MEIJI-2 -- CONTINUOUS DUC (FILTERED)  Do you have the shot?  The targeting pipper locks onto Scunner's head. KAORI  I do...  DUC (FILTERED)  Take it.  EXT. ODAIBA -- CONTINUOUS Scunner",
      "dialogue_count": 0,
      "word_count": 965
    },
    {
      "scene_number": 20,
      "slugline": "EXT. THE THROAT -- CONTINUOUS We see armor explode away for the emergency eject. We see the pods jettison -- -- but a blinding flash of light overwhelms us before we can see if they've made it. An EXPLOSION so deep and thunderous, we almost can't hear it. EXT. PACIFIC OCEAN -- DAY Battleships wait on the surface. A FLASH briefly lights the depths, like underwater lighting. A moment later, the ocean surface bulges, a huge hill of displaced water, and drops, sending out over-sized ripples. The ships roll on the sloping waves. INT. LOCCENT -- DAY Takada, Pentecost, and all the control Officers watch the Interstice map on the main screen. Still rattled by the seismic shaking of the attack, hiccups of static briefly stutter the graphics on the screen. The fleeting POPS and HISSES are the only sound in the room. OFFICER 1 Direct hit! The Interstice has collapsed! The Interstice has collapsed! Everyone is on their feet -- applauding, laughing, weeping, embracing -- before he finishes the sentence. Everyone except for Flick. Newt holds her as she waits with baited breath. TAKADA Do we have the pods? Everyone quiets down as the Officer listens. OFFICER 1 Nothing yet... Standing by... EXT. BATTLESHIP -- CONTINUOUS CREWMEN gather at the edge of the deck, searching. Rescue helicopters draw wide circles in the sky overhead. INT. LOCCENT -- CONTINUOUS A short time has passed -- enough for the hope to begin to deflate. Personnel begin to take their seats. Some hang their heads. Pentecost furrows his brow and sighs.  128.  (CONTINUED)",
      "characters": [],
      "action_text": "Flick keeps her lips tight, but we see her chest and throat quiver with bottled-up sobs. Her tears fall as Newt puts a reassuring hand on her shoulder. Suddenly, the Officer stands up. OFFICER 1 Sir, I've got something... It's one of the pods! EXT. PACIFIC OCEAN -- CONTINUOUS Near the ships, a conn-pod breaches in a fit of salt spray. It rolls and finally settles. The canopy opens. Thick steam bleeds from the open pod. We can't see who it is. As the vapor quickly dissipate, we find Raleigh inside. He quickly unhooks himself and climbs out onto the pod. He shades his eyes and scans the horizon. He spots the rescue ships and keeps searching. He sees no sign of the second conn-pod. We slowly pull back across the water, back from the drifting pod and the ships behind it. It seems final. Suddenly, in the foreground, the second conn-pod heaves up through the surface and settles to bob on the water. Raleigh plunges into the water and swims for the second pod. He climbs on as the canopy opens, spilling plumes of steam into the clear ocean air. He tries to claw the steam away. Finally, he sees Mako tucked down in her cockpit, unbuckling her harness and yanking the cables from her drivesuit. She looks up and sees him. They laugh giddily, wiping tears from their eyes. She reaches up and lets him pull her out. They linger atop the floating pod, holding tight to one another, not daring to let go. We pull back, letting the blue ocean unfurl under us. The ships slowly approach the embracing pair. They never let go.  129.  CONTINUED:",
      "dialogue_count": 0,
      "word_count": 541
    }
  ]
}