{
  "slug": "paddington-2-2018",
  "title": "paddington 2",
  "genre": "drama",
  "format": "film",
  "scenes_count": 21,
  "characters_count": 0,
  "characters": [],
  "total_words": 23011,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. THE BROWNS’ BATHROOM - MORNING 4 Paddington fires up two ELECTRIC TOOTHBRUSHES. PADDINGTON (V.O.) I’m really getting to grips with how things work. He puts the two toothbrushes in his EARS. Next he sticks them up his NOSE. And only then does he use them on his TEETH. PADDINGTON (V.O.) And it seems there’s something new to do every day.  INT. THE BROWNS’ KITCHEN - MORNING 5 Paddington sits at the table, surrounded by the happy chaos of a family breakfast. JUDY, a defiantly intellectual fourteen year old, shows Paddington a leaflet for “KOSLOVA’S STEAM FAIR” while he devours a pile of sandwiches. JUDY Guess what, Paddington? The Steam Fair’s coming to town! I’m going along tonight to write about it for my newspaper. JONATHAN, her twelve year old brother, is immediately concerned at the impact this might have on his reputation. JONATHAN Who’s going to want to read about that? JUDY Everyone! They travel the world in an old steam train. I thought you’d love it. JONATHAN I do, but don’t tell anyone ok? Not cool. Judy rolls her eyes at her conformist brother. Their adventurous mother, MARY, is full of the fun of the fair. MARY Why don’t we all go? Your father’s a dab hand at the coconut shy. Post Additional Photography Draft 2 - 06.08.17   4.",
      "characters": [],
      "action_text": "Her husband, HENRY, mimes throwing a ball and feels a twinge in his shoulder. HENRY Ooh, not anymore. Coconuts are a young man’s game. PADDINGTON Well I think you’re in great shape for a man of your age, Mr Brown. HENRY Thank you, Paddington. Hang on, how old do you think I am? PADDINGTON Oh... about eighty? HENRY Eighty?! PADDINGTON At least! Paddington puts the last sandwich in his hat and gets up to leave - but MRS BIRD, the Browns’ aged Scottish relative and redoubtable housekeeper, stops him in his tracks. MRS BIRD Just a minute, wee bear. I thought I told you to clean your ears. PADDINGTON But I did, Mrs Bird... Mrs Bird MAGICS A COIN from BEHIND HIS EAR. PADDINGTON (CONT’D) I wonder how that got in there!  EXT. WINDSOR GARDENS - MORNING 6 Paddington runs out of the house as a BICYCLE comes round the corner towards him. PADDINGTON (V.O.) I really feel at home in Windsor gardens. The FRENCH CYCLIST rings her bell. PADDINGTON Bonjour, Mademoiselle! CYCLIST Good morning, Paddington! Post Additional Photography Draft 2 - 06.08.17   5. Paddington leaps on the back of the bike and hands the cyclist a sandwich as they free-wheel down the street. PADDINGTON I brought you breakfast. CYCLIST Thank you. Your sandwiches always put me in a good mood. They pass an ABSENT-MINDED DOCTOR emerging from his house. PADDINGTON Morning, Dr Jafri. You haven’t forgotten your keys, have you? Dr Jafri stops, pats his pockets and panics. DR JAFRI Keys? Keys! Dr Jafri rushes back to his closing front door, catching it just before he is locked out. DR JAFRI (CONT’D) Thank you, Paddington! PADDINGTON You’re welcome! Paddington and the Cyclist ride on past the COLONEL, a gloomy, dishevelled man with a military moustache and a week’s stubble wearing a dressing gown. PADDINGTON (CONT’D) Glorious day, Colonel! COLONEL Is it? How absolutely thrilling. They pass a NEWSPAPER KIOSK. The owner is a cheery eccentric with a twinkle in her eye and a parrot on her shoulder. PADDINGTON How was your date",
      "dialogue_count": 0,
      "word_count": 810
    },
    {
      "scene_number": 2,
      "slugline": "INT. HENRY AND MARY’S BEDROOM - NIGHT 8 Mary, sitting at her desk, doodles a picture of herself sitting at the same desk. The drawing COMES TO LIFE and ILLUSTRATED MARY climbs out of the window. We discover the window is actually in an airship floating over an ocean. ILLUSTRATED MARY dives out of the window and into the waters below, where she discovers a sunken city.  INT. JUDY’S BEDROOM - DAY 9 Judy is on the telephone. PADDINGTON (V.O.) Judy is suffering from a broken heart. JUDY I’m dumped? I think you’ll find you’re dumped Tony. She slams down the phone.  CUTAWAY: BLACK AND WHITE STOCK FOOTAGE OF NUNS 10 PADDINGTON (V.O.) Her first reaction was to become a nun - but she soon got over that and has thrown herself into a new hobby.  INT. SCHOOL PRINTING ROOM - VARIOUS DAYS 11 Judy comes into the room and discovers a PRINTING PRESS. PADDINGTON (V.O.) She found an old printing press at school and is starting a newspaper. With no boys. Paddington watches Judy proudly printing the first issue of “The Portobello Express”. JUDY Now all we need is some news!  INT. JONATHAN’S ROOM - DAY 12 Paddington helps Jonathan put the finishing touches to a scale model of a steam engine. Post Additional Photography Draft 2 - 06.08.17   8.",
      "characters": [],
      "action_text": "PADDINGTON (V.O.) Jonathan is joining her at big school this year. He spent the summer building a steam engine but I’m not supposed to talk about it as it is ‘not cool’.  CUTAWAY: CHANGING LOOK BOOK. 13 A flip-flap book shows Jonathan going from his true self to a new persona wearing ridiculous cyber-shades. PADDINGTON (V.O.) He’s got a whole new look and if anyone asks, he’s called J-Dog - and is definitely not into steam trains.  INT. JONATHAN’S ROOM - DAY 14 Jonathan sadly shuts the steam engine away in his cupboard. PADDINGTON (V.O.) But Mr Brown has been busiest of all.  INT. LLOYDS OF LONDON - DAY 15 Mr Brown stands among a crowd of his colleagues, nervously anticipating the announcement of his promotion. PADDINGTON (V.O.) He recently had a surprise at work. C.E.O. I’m delighted to announce our new Head of Risk Analysis will be... Steve Visby. A MUCH YOUNGER MAN steps forward. Henry’s face drops. PADDINGTON (V.O.) This has triggered what Mrs Bird calls a Full Blown Midlife Crisis.  CUTAWAY: FOOD BLENDER, HAIR DYE. 16 PADDINGTON (V.O.) It involves blending his food, painting his hair and engaging in a process called “Chakrabatics.” Post Additional Photography Draft 2 - 06.08.17   9.",
      "dialogue_count": 0,
      "word_count": 426
    },
    {
      "scene_number": 3,
      "slugline": "INT. FITNESS STUDIO - DAY 17 The camera tracks across a group of lycra-clad young people doing the splits. CHAKRABATICS INSTRUCTOR Open your mind and your legs will follow. Henry, similarly dressed, tries to do the splits and falls.  EXT. PORTOBELLO ROAD MARKET - DAY 18 Paddington jumps off the dustbin lorry, returning the A-Z. PADDINGTON That’s ten out of ten, Mr Barnes! MR BARNES Thank you, Paddington. PADDINGTON Keep up the good work! The Bin Lorry drives on as Paddington walks down the market, greeting the market traders. PADDINGTON (V.O.) Oh Aunt Lucy, you sent me to London to find a home and it’s worked out better than I ever imagined. I have a wonderful family and have made friends in all sorts of places. Paddington stops to give some breakfast to WOLFIE, a stray dog who lives in an alley off the Portobello Road. PADDINGTON Here you go, Wolfie. See you tomorrow! PADDINGTON (V.O.) I do hope if you could see me, you’d be pleased. Lots of love from Paddington. Paddington walks up the street into GRUBER’S ANTIQUES. PADDINGTON Mr Gruber?  INT. GRUBER'S ANTIQUES - DAY 19 Paddington walks through to the back of the shop where there are boxes and crates full of FAIRGROUND MEMORABILIA. Post Additional Photography Draft 2 - 06.08.17   10.",
      "characters": [],
      "action_text": "Mr Gruber is coming downstairs from the upper workshop. MR GRUBER Ah Mr Brown, come in! I just had a visit from Madame Kozlova who runs the fair. PADDINGTON Oh yes? MR GRUBER They were having a clear out and found all these old crates stuffed with memory-bilia they thought had been lost forever. Paddington growls, interested. MR GRUBER (CONT’D) She’s asked me to sell it for them while they’re in town and I thought there must be something in here for your Aunt Lucy’s birthday. PADDINGTON Good idea. Paddington starts looking through the memorabilia, touching a VAN DER GRAAF GENERATOR which makes his FUR STAND ON END. MR GRUBER Ooh! Look at this! He pulls out a MECHANICAL MONKEY ON A TRAPEZE. PADDINGTON It’s very nice, Mr Gruber, but... MR GRUBER I know, I know, it’s got to be perfect. PADDINGTON Since Uncle Pastuzo died, I’m the only relative she’s got left - and it isn’t every day a bear turns a hundred. Paddington rummages in a trunk, finding a WIG AND GLASSES. MR GRUBER Quite so. Ah, how about these rolling shoes? He holds up some ROLLER SKATES. Paddington - now wearing the wig and glasses - is unconvinced. Post Additional Photography Draft 2 - 06.08.17   11. PADDINGTON Please Mr Gruber, be serious. MR GRUBER Perhaps your Aunty’s rolling days are behind her. Paddington digs into one of the trunks. PADDINGTON I think you might be right. Ooh. What’s this? He pulls out an OLD BOOK and Mr Gruber consults a list. MR GRUBER Ah, now this must be the popping book! Very interesting. PADDINGTON Really? MR GRUBER You see, Madame Kozlova’s great- grandmother, who started the fair, was a brilliant artist. Every time they visited a new city, she made a popping book to remember it by, and this is London. Paddington opens the book to reveal a POP-UP TOWER BRIDGE. PADDINGTON Oh Mr Gruber it’s wonderful! Aunt Lucy’s always dreamed of coming to London and never had the chance - but if she saw this, it would be like she were finally here... As Paddington gazes into the book, the camer",
      "dialogue_count": 0,
      "word_count": 1093
    },
    {
      "scene_number": 4,
      "slugline": "INT. BARBER’S SHOP - DAY 23 Alone in the shop, Paddington turns to the broom and addresses it as though it were a customer. PADDINGTON Good afternoon. Welcome to Giuseppe’s Grooming Salon. What can I do for you today, sir? A shave? A light pomade? Or is it just a brush? CUSTOMER (O.S.) Quick trim please, barber! Paddington looks round to find a CURT CUSTOMER with a MAGNIFICENT MANE OF GREY HAIR has come in to the shop. The Customer has mistaken Paddington for the barber. PADDINGTON I’m not the Barber. I just tidy up. CUSTOMER That’s all I want. Tidy up the back and sides, and nothing off the top. PADDINGTON Yes, but... CUSTOMER No buts! Come on man, chop chop! The Customer settles down in the chair and closes his eyes. PADDINGTON If you say so, sir. He takes the scissors from his pocket - but he’s not used to them and they fly straight out of his paw into the ceiling. He looks around for something to use instead of the scissors and spots some ELECTRIC CLIPPERS. He switches them on - but the MOTOR is so strong it makes his ARM VIBRATE WILDLY. He manages to grab hold of the clippers with both paws and clasp them to his chest - but they simply make his WHOLE BODY VIBRATE, like a road worker with a JACKHAMMER. He starts to bounce around the room, the LONG FLEX wrapping around his hands and feet, ensnaring him completely. The clippers tear through a display of brushes as the trailing flex starts snagging on various bits of furniture. Luckily, the customer has dropped off to sleep. Post Additional Photography Draft 2 - 06.08.17   15.",
      "characters": [],
      "action_text": "Just then a PHONE RINGS. Paddington happens to bounce pass and answers it, flipping it up behind his ear with his mouth. PADDINGTON (CONT’D) Hello, Giuseppe’s? Oh hello Mr Jameson. Would you mind if I called you back? I think I may be about to shave a customer. Now Paddington finds the clippers heading TOWARDS THE CUSTOMER. He tries to change course but is so bound up in flex that he’s powerless to do anything about it. Millimetres from the customer’s head, Paddington’s progress is miraculously arrested. The cord of the clippers has pulled taut, saving the Customer in the nick of time. Phew! PADDINGTON (CONT’D) Thank goodness. But then, the tension in the cable pulls the lever on the chair, and the customer’s hair is lowered onto the clippers. Paddington yelps as HAIR FLIES EVERYWHERE. And to make things worse, the plug flies out the socket, shoots up to the ceiling fan, and the flex starts being wound up around it. Paddington is yanked off his feet. PADDINGTON (CONT’D) I’m just putting you on hold... The fan whips him up and SPINS HIM AROUND at high speed.  EXT. BARBER’S SHOP - DAY 24 A MOTHER is giving her son a stern talking-to outside the barber’s shop window. MUM It’s only a hair cut, Nelson, there’s nothing to be afraid of. Paddington is HURLED from the fan and SPLATS onto the window. PADDINGTON Come in, take a seat. MUM Let’s go somewhere else. He SQUEAKS OFF THE GLASS and lands on the floor with a thump. Post Additional Photography Draft 2 - 06.08.17   16.",
      "dialogue_count": 0,
      "word_count": 549
    },
    {
      "scene_number": 5,
      "slugline": "INT. BARBER’S SHOP - DAY 25 Paddington picks himself up off the floor and stares at the damage. The customer has a TEN INCH STRIP shaved into the back of his head like a REVERSE MOHICAN. PADDINGTON Ooh, that’s not good. Paddington tries to put the SHAVED HAIR back on to the customer’s head but, of course, it won’t stick. Then he has an idea. He gets a jar of marmalade from his pocket, opens it, scoops out a pawful and SMEARS MARMALADE all over the Customer’s now-bald patch. CUSTOMER (half asleep) What is it? PADDINGTON Just putting in some product, sir. CUSTOMER (half asleep) Jolly good. Carry on. A few moments later: Paddington has finished his repair job. Above him, the fan is still bound up with flex and SMOKING GENTLY. He raises the customer’s chair and shows him his handiwork. PADDINGTON All done, sir! I must say it’s come out a lot better than I expected. The Customer wakes, looks in the mirror. The front is fine. But when he touches the back of his head, he feels something weird and then SCRAPES the marmalade off his head. CUSTOMER What the devil’s this? PADDINGTON Erm...Marmalade. CUSTOMER Marmalade? PADDINGTON Hairy marmalade. CUSTOMER Well get it off! Post Additional Photography Draft 2 - 06.08.17   17.",
      "characters": [],
      "action_text": "PADDINGTON Yes sir! Right away sir. Paddington LICKS the back of the customer’s head. Just then the Barber comes back to see what he’s doing. CUSTOMER What is the matter with you? BARBER Paddington! PADDINGTON Mr Giuseppe! I can explain. It’s not as bad as it looks. But just then the fan sparks, the smoke alarm sounds, and the sprinklers go off, drenching everyone in the shop. CUT TO:  EXT. KOSLOVA’S STEAM FAIR - DUSK 26 Paddington WRINGS OUT HIS HAT as the Browns and Mrs Bird walk through the entrance to KOSLOVA’S STEAM FAIR. PADDINGTON Have you ever been fired, Mr Brown? HENRY Well, no, but are you sure you’re ready for the workplace Paddington? It’s a tough, competitive world out there and I worry a kind, good- natured little bear might get trampled underfoot. Paddington takes a bite of a TOFFEE APPLE but it’s so sticky he struggles to free his tongue from the sticky apple. JUDY He’s right, you know. You can’t trust anyone. That’s why I’m doing my newspaper alone. MARY Darling, is this about Tony? JUDY No! MARY Ok. Post Additional Photography Draft 2 - 06.08.17   18. JONATHAN  Everything’s   about   Tony . And the only reason nobody’s helping with your paper is because it’s so lame. JUDY Well at least I’m not pretending to be someone I’m not. JONATHAN Nor am I! G-Man! Jonathan has spotted a similarly dressed group of other kids, slips on his cyber-shades and fires up an electronic t-shirt. CYBER-KID J-dog. Spud bounce. They bump fists. Paddington finally manages to pull his tongue from the toffee apple. PADDINGTON But Aunt Lucy said if you’re kind and polite, the world will be right. MRS BIRD At least someone’s making sense! PADDINGTON And you’re kind, Mr Brown, and you’ve made it to the top. HENRY I’m nowhere near the top. I peaked in the middle. Now the hair’s gone grey, the belly’s popped out and I’ve started to creak. They approach a large crowd who burst into applause as a charming, handsome, charismatic actor with dazzling blue eyes hops up onto a small sta",
      "dialogue_count": 0,
      "word_count": 2337
    },
    {
      "scene_number": 6,
      "slugline": "EXT. PORTOBELLO ROAD - NIGHT 38 A POLICE CAR pulls up at the top of Portobello Road as Paddington bolts down the road.  INT. POLICE CAR - NIGHT 39 A serious-minded POLICEWOMAN grabs the radio. POLICEWOMAN Robbery in progress at Gruber's Antiques. Suspect is a small bear in a red hat and a duffle coat! She gets out and gives chase.  EXT. PORTOBELLO ROAD / ALLEY - NIGHT 40 Paddington chases the thief down an alley towards the canal.  EXT. CANAL TOWPATH - NIGHT 41 Paddington emerges from the alley onto the towpath. He looks around and sees the thief taking a bicycle from on top of a canal boat and cycling away. Paddington puts his paw in his mouth and WHISTLES!  EXT. ALLEYWAY - NIGHT 42 Wolfie pricks up his ears and runs.  EXT. CANAL TOWPATH - NIGHT 43 Paddington emerges from a tunnel RIDING THE DOG LIKE A HORSE, galloping after the thief - who has the book in a PANIER on the back of his bicycle. Paddington pulls alongside the bicycle and reaches for the book. But just as he takes it, the thief notices what is going on and grabs the book before Paddington can get away. The pair tussle for the book - but suddenly, the thief VEERS OFF up an incline and across a BRIDGE AHEAD OF PADDINGTON. The pair of them are now on different sides of the canal as they head to the basin. And the thief is pulling away. But Paddington isn’t done yet. He spurs the dog into life. They LEAP UP onto the ROOF OF A BOAT moored by the towpath and JUMP ONTO AN ISLAND in the middle of the canal basin. Post Additional Photography Draft 2 - 06.08.17   27.",
      "characters": [],
      "action_text": "They crash through the undergrowth. Ducks, geese and other birds fly up in to the air, squawking wildly. PADDINGTON Excuse me! Coming through! Who are you?! The thief looks round to see PADDINGTON EMERGE from the undergrowth HANGING FROM THE LEGS OF A SWAN. THIEF Strike a light! Amazed by the sight, he LOSES CONTROL OF THE BIKE, and falls off as it goes in the water. High above, hanging from the swan, Paddington watches the thief get to his feet and run off the canal. PADDINGTON That book is reserved for Aunt Lucy! Oh er, hello there. The swan has looked round and starts pecking at Paddington. PADDINGTON (CONT’D) Ooh! Ow! Not the snout! Help Wolfie! Paddington lets go and falls to the towpath beneath. Fortunately, he lands on the back of the dog and together, they race once more after the thief. PADDINGTON (CONT’D) Thank you, Wolfie! Attaboy!  EXT. WINDSOR SQUARE - NIGHT 44 Paddington follows the thief towards the newspaper kiosk. The thief stops as he hears a police sirens heading towards him from the other direction. Cornered, he raises his hands, still holding the pop-up book. THIEF (breathless) Alright, alright! You got me. Paddington gets off the dog and walks towards him. PADDINGTON Hand over the book! THIEF ‘Fraid I can’t do that. Cheerio. Post Additional Photography Draft 2 - 06.08.17   28. The thief turns and then suddenly... POOF! He quite literally DISAPPEARS IN A PUFF OF SMOKE. PADDINGTON But... where did he go? Paddington looks around, astounded, as police cars close in from all directions - and then hears a voice behind him. POLICEWOMAN Hold it right there! PADDINGTON Oh, thank goodness you’re here! POLICEWOMAN Put your... paws in the air. Paddington lifts his paws in the air. PADDINGTON But... I’m not the thief! I was chasing the thief and then he... POLICEWOMAN (sarcastically) Disappeared in a puff of smoke? PADDINGTON Well... yes.  EXT. WINDSOR GARDENS - MOMENTS LATER 45 Paddington’s friends and neighbours come to their windows as the Policewoman le",
      "dialogue_count": 0,
      "word_count": 1235
    },
    {
      "scene_number": 7,
      "slugline": "EXT. COURTROOM - DAY 48 Various legal types walk towards a courtroom.  INT. COURTROOM - DAY 49 Paddington stands alone in the dock, confused and afraid. The Browns and his friends are all in attendance. CLERK OF COURT All rise! PADDINGTON (to himself) Deep breath, Paddington. Remember what Mr Brown said. You’re young, you’ve done nothing wrong, you’ll be fine - so long as you get a fair- minded judge. JUDGE Order! Order! But he looks up to see the judge is the same man from the barber’s shop - and he’s monumentally annoyed. PADDINGTON Oh dear. JUDGE We will now hear the case of the Crown versus Paddington Brown. First, MR GRUBER gives evidence. MR GRUBER ...oh yes, he loved the book. He had set his heart on top of it. PROSECUTOR So you discussed how expensive it was? MR GRUBER Yes, but he was raising the money! I refuse to believe young Mr Brown would ever burglarize my shop. Paddington is delighted to see his friend stand up for him. Next, a FORENSIC INVESTIGATOR is on the stand. He gestures to a plan of Gruber’s Antiques. Post Additional Photography Draft 2 - 06.08.17   32.",
      "characters": [],
      "action_text": "FORENSIC INVESTIGATOR Paw-prints were found here, here, and here, and a substance, later identified as marmalade, was found here. The Prosecutor produces a jar of Paddington’s marmalade. PROSECUTOR And is this the same marmalade? The Forensic Investigator dips his finger in the jar and rubs it around his gums, like a cop testing for cocaine. FORENSIC INVESTIGATOR Yes it is. The court gasp, the tide starting to turn against Paddington. PROSECUTOR Thank you very much. She steps away with the jar, but the Forensic Investigator snatches it off her and starts eating more marmalade. FORENSIC INVESTIGATOR Thank you very much. (off her look) This evidence is very more-ish. Finally, PHOENIX takes the stand. CLERK OF COURT Phoenix Buchanan, do you swear to tell the truth, the whole truth, and nothing but the truth? PHOENIX May my entrails be plucked forth and wound about my neck should I deceive, I do. Prison is no laughing matter. And I should know. I spent three years in Les Miserables. The court laugh. PROSECUTOR Mr Buchanan, you live on the same street as the defendant. PHOENIX Yes, I have known the family for years. Henry and Mary and the unforgettable Mrs Fuh nuh nuh. Mrs Bird rolls her eyes. Post Additional Photography Draft 2 - 06.08.17   33. PROSECUTOR And you were an eye-witness to the events that night. PHOENIX Indeed I was. Everyone leans forward, keen to hear what he has to say. PHOENIX (CONT’D) I was up late writing my one man show when I became aware of a hullaballoo in the street below. I went to my awards room, which is a large room overlooking the kiosk, and I saw young Paddington riding a rather disreputable looking hound. The Prosecutor produces a PENCIL DRAWING of the thief. PROSECUTOR Mary Brown drew this based on the bear’s description of the man he claims he was chasing. Phoenix looks admiringly at the face in the picture. PHOENIX Ooh, handsome devil, isn’t he? Strong cheekbones, noble forehead, dazzling eyes... PROSECUTOR Yes but did you see him? Your",
      "dialogue_count": 0,
      "word_count": 613
    },
    {
      "scene_number": 8,
      "slugline": "INT. PRISON ATRIUM - NIGHT 50 Paddington stands behind a BARRED DOOR wearing a GREY STRIPED PRISON UNIFORM and hat. He carries a ROLLED BLANKET. A STERN WARDEN addresses him. WARDEN Paddington Brown. Ten years for Grand Theft... PADDINGTON Oh, but I never... WARDEN And Grievous Barberly Harm. Paddington growls, unable to argue with that one. WARDEN (CONT’D) Follow me. A buzzer sounds. The barred door SLIDES OPEN. SAD CALYPSO MUSIC plays as Paddington follows a Warden anxiously into the HIGH PRISON ATRIUM and up a staircase. There, in the Atrium, are the Calypso Band, wearing prison uniforms and singing a jailhouse lament. The Warden unlocks a cell door and Paddington steps inside. PADDINGTON Mrs Brown usually reads me a story before bed. I don’t suppose... WARDEN Sorry, son. No bedtime stories in here. The Warden slams the door shut behind him.  INT. PADDINGTON'S PRISON CELL - NIGHT 51 Paddington climbs up to a pipe under the window, and starts to write a letter. PADDINGTON (V.O.) Dear Aunt Lucy. A great deal has happened since I last wrote. I’m afraid there’s been a bit of a mix up with your present and the upshot is I’ve had to leave Windsor Gardens and move... somewhere else. He finds he can’t quite bring himself to tell Aunt Lucy the truth, so tries to put a positive spin on things. Post Additional Photography Draft 2 - 06.08.17   35.",
      "characters": [],
      "action_text": "As he writes, the camera pulls away from the cell window to reveal his is one of dozens in a vast, imposing building. PADDINGTON (V.O.) It’s not quite as charming as the Browns’ house but it’s not all bad. It’s a period property - in fact, it’s one of the most substantial Victorian buildings in London - and the security arrangements are second to none. A searchlight sweeps across walls topped with barbed wire. PADDINGTON I’m only allowed to see the Browns once a month. I wonder what they’re doing now?  INT. KITCHEN - NIGHT (MONTAGE) 52 Mary puts up her drawing on a cork board, the start of what will become her CRIME WALL.  INT. LAW LIBRARY - NIGHT (MONTAGE) 53 Henry surrounded by text books, looking exhausted.  INT. SCHOOL PRINTING ROOM - NIGHT (MONTAGE) 54 Judy prints a newspaper.  INT. JONATHAN’S ROOM - NIGHT (MONTAGE) 55 Jonathan puts up a poster: Have you seen this man?  INT. THE BROWNS’ HALLWAY - NIGHT (MONTAGE) 56 Mrs Bird is standing at the foot of the stairs reading a book called “VANISHING ACTS AND HOW TO DO THEM”. Using a washing up brush like a wand, she vanishes a turnip and looks around, amazed.  INT. PADDINGTON'S CELL - NIGHT 57 Paddington gazes out of the window, his eyes full of tears. PADDINGTON (V.O.) I do hope they don’t forget me. He scrubs this last sentence out, pulling himself together. Post Additional Photography Draft 2 - 06.08.17   36. PADDINGTON Of course they won’t. These are the Browns you’re talking about. PADDINGTON (V.O.) They’ll sort everything out and I’ll be able to go home and get your present and everything will be right as rain. (to himself) I just need to hold on until then.  EXT. TOWER BRIDGE - NIGHT 58 The iconic landmark silhouetted against the night sky.  INT. NORTH TOWER, TOWER BRIDGE - NIGHT 59 A whistling SECURITY GUARD walks past VARIOUS ROYAL SUITS OF ARMOUR on display in front of a large, Gothic window. As soon as the guard has left the room, one of the suits MOVES, lifting up its visor to reveal Phoenix. He runs clan",
      "dialogue_count": 0,
      "word_count": 3220
    },
    {
      "scene_number": 9,
      "slugline": "INT. PADDINGTON’S CELL - NIGHT 75 In the darkness, we hear a voice. KNUCKLES (O.S.) Wakey wakey. Paddington opens his eyes to find Knuckles inches from his nose. Thunder crashes in the distance. KNUCKLES (CONT’D) Marmalade time.  INT. PRISON CANTEEN - NIGHT 76 The Warden lets Paddington and Knuckles into the canteen, locking the door behind them. PADDINGTON Um... Mr McGinty? Mr McGinty? KNUCKLES What do you want? PADDINGTON Well, the thing is, I’m actually innocent. KNUCKLES Ha! PADDINGTON And I wondered if you had any advice on how to clear my name? Now that we’re friends... KNUCKLES Friends? I’m your boss, not your buddy. PADDINGTON Oh. Well, after you. Paddington holds the kitchen door open for Knuckles. KNUCKLES (suspicious) Why? So you can stab me in the back? PADDINGTON No. Because it's polite! Aunt Lucy said if you’re kind and polite, the world will be right. Post Additional Photography Draft 2 - 06.08.17   50.",
      "characters": [],
      "action_text": "KNUCKLES You were ahead of me, now you’re behind. That makes you a sap.  INT. PRISON KITCHEN - CONTINUOUS 77 Paddington follows him in to the kitchen. KNUCKLES Ingredients are over there. He nods over to some shelves and flops into a chair. PADDINGTON Erm... aren’t you going to help? KNUCKLES Nope. Now get on with it. PADDINGTON But there’s five hundred hungry prisoners coming for breakfast so I’ll need a thousand juicy oranges-- KNUCKLES And rule number one: no talking. He opens a prison newspaper: The Hard Times. Paddington starts HUMMING as he puts on his STRIPED APRON and picks up a CHEF’S HAT. Knuckles slowly lowers his paper. KNUCKLES (CONT’D) Rule number two. No humming, or singing or any other expressions of bonhomie. Paddington nods, wanting to stay on the right side of him. Knuckles raises his paper and for two seconds, there’s peace. But then he hears a STRAINING, HEAVING NOISE. Knuckles lowers his paper and looks over to see Paddington trying to heave a LARGE SACK OF ORANGES off a high shelf. PADDINGTON Ooh that’s heavy. Come on, Paddington. Put your back into it. He finally manages to PULL THE SACK OFF THE SHELF, but it pulls all the other sacks with it, BURYING HIM COMPLETELY. Knuckles begrudgingly goes over and with one hand lifts an enormous sack to reveal Paddington underneath. PADDINGTON (CONT’D) These sacks are awfully heavy. Post Additional Photography Draft 2 - 06.08.17   51. KNUCKLES Take them one at a time, then. PADDINGTON Right! One at a-- Knuckles drops the sack of oranges back on top of him. PADDINGTON (CONT’D) --time. Knuckles goes back to his paper, hoping for peace. But behind him, Paddington carries a SINGLE ORANGE from the shelf to the counter, padding on the floor as he goes. PADDINGTON (CONT’D) One juicy orange. He walks back to the shelf. And returns with another orange. PADDINGTON (CONT’D) Two juicy oranges. Then back and forth once more. PADDINGTON (CONT’D) Three juicy oranges. Four-- KNUCKLES Now what are you doing? PADDINGTON T",
      "dialogue_count": 0,
      "word_count": 4181
    },
    {
      "scene_number": 10,
      "slugline": "INT. PADDINGTON'S CELL - NIGHT 100 Paddington is lying in bed when he hears a metallic CLANG followed by a Knuckles’ voice coming along the pipe. KNUCKLES (O.S.) Paddington? Paddington! Paddington climbs up to the horizontal pipes running through his cell. He opens a vent and can now hear Knuckles clearly. PADDINGTON Knuckles? Paddington listens as Knuckles’ voice floats along the pipe. KNUCKLES Got a proposition for you, kid. Me and the boys have been talking, and it seems to us if you’re going to clear your name, you’re going to need our help. SPOON The Browns may mean well but... PHIBS It takes a thief to catch a thief. KNUCKLES Now if we could somehow get out of here, hit the streets, we’d find him soon enough. PADDINGTON But that would mean... escape?! KNUCKLES It certainly would. And we’ve got a plan. But it’s a four man job and we need your help. What do you say? Paddington is sorely tempted - but remembers Aunt Lucy. PADDINGTON That’s very kind, Knuckles, but I don’t think Aunt Lucy would like the idea of me busting out of chokey and going on the lam. The Browns will find the real thief. I just need to be patient. But Knuckles isn’t finished. KNUCKLES You may not want to hear this kid, but sooner or later, the Browns will forget you. Post Additional Photography Draft 2 - 06.08.17   72.",
      "characters": [],
      "action_text": "Paddington looks horrified at the suggestion - but despite himself, the words begin to seep into his mind like poison. PHIBS They always do. SPOON They’ll miss one visit. Then two. KNUCKLES And before you know it, you won’t have a home to go back to. Paddington shakes his head, refusing to believe. PADDINGTON You’re wrong, Knuckles. You’re all wrong. The Browns aren’t like that. They’ll come tomorrow and they’ll have good news, you’ll see. He closes the vent firmly. But Paddington is concerned.  EXT. THEATRICAL AGENT’S OFFICE - MORNING 101 Jonathan and Judy walk up to an office building carrying a basket of pastries. They ring the buzzer. JUDY It’s Judy Brown from the Portobello Express. They are buzzed in.  INT. THEATRICAL AGENT’S OFFICE - MORNING 102 Jonathan and Judy sit in an office, the walls lined with theatrical posters and actors’ photographs. Behind the desk is FLICK FANSHAWE, a glamorous, no-nonsense agent with show-business coursing through her veins. The children are recording the conversation on DICTAPHONES. FLICK So what’s this for, darlings? A school newspaper? JUDY Yes, career profiles. We thought the agent of   the   Phoenix Buchanan would be really interesting. Post Additional Photography Draft 2 - 06.08.17   73. FLICK And you’d be right, but I’ve got two minutes so we’d better make it snappy. And I’m only giving you that because you brought breakfast. She takes a CHELSEA BUN. FLICK (CONT’D) Nice buns by the way.  EXT. WINDSOR SQUARE - DAY 103 The Postman is walking back to his van. Mrs Bird comes over. MRS BIRD Good morning, Marlon. POSTMAN Morning Mrs B. How’s Paddington? MRS BIRD Oh he’s a tough wee bear... As Mrs Bird keeps him talking, Mary sneaks round the other side of the van, carrying a HUGE BARKRIDGE’S HAMPER. She checks the coast is clear, then climbs into the back of the van and GETS INSIDE THE HAMPER. POSTMAN Well, I’d better get on. MRS BIRD Goodbye. The Postman turns back to the van just as MARY CLOSES THE LID FROM INSIDE. He sees th",
      "dialogue_count": 0,
      "word_count": 852
    },
    {
      "scene_number": 11,
      "slugline": "INT. PHONE BOX OUTSIDE AGENT - MORNING 108 Judy and Jonathan are PLAYING EXTRACTS FROM THE INTERVIEW on their DICTAPHONES. Judy presses play. FLICK “I’ve got two minutes so we’d better make it snappy.” PHOENIX (O.S.) Ok... Jonathan presses play on the other dictaphone. FLICK “We’re having lunch with a big Broadway producer.”  INT. PHOENIX’S LIVING ROOM - MORNING 109 PHOENIX still believes he’s in a real conversation. PHOENIX Well that’s wonderful. Where should I go? FLICK (O.S.) “Where do all the big meetings happen? The Ritz, darling!” PHOENIX I’m on my way. FLICK (O.S.) “Nice buns by the way.”  INT. PHONE BOX OUTSIDE AGENT - MORNING 110 Judy has left a tape recorder going by mistake - and it has played the wrong line. Judy stops it but they’re panicking. Have they been rumbled?  INT. PHOENIX’S LIVING ROOM - MORNING 111 PHOENIX I beg your pardon?  INT. PHONE BOX OUTSIDE AGENT - MORNING 112 Jonathan has an idea - and presses a button. FLICK  “Really   nice buns!” Post Additional Photography Draft 2 - 06.08.17   76.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 177
    },
    {
      "scene_number": 12,
      "slugline": "INT. PHOENIX’S LIVING ROOM - MORNING 113 PHOENIX looks bemused, but somewhat pleased with himself. PHOENIX Well, thank you very much. I’ve never had any complaints about Mr and Mrs Botty-cheek. He hangs up, grabs his coat and leaves. As the door shuts behind him, something shifts in the hamper. Mary EMERGES FROM THE STRAW.  INT. HENRY AND MARY’S BATHROOM - MORNING 114 Henry, still in his pyjamas, is brushing his teeth - when he GLANCES OUT THE WINDOW - which looks out along the gardens behind the houses. He sees Mary in PHOENIX’S LIVING ROOM. HENRY Mary?!  INT. PHOENIX’S LIVING ROOM - MORNING 115 Mary is rifling through Phoenix’s paperwork, not sure what she’s looking for, when she spots a blank, used notepad. Using the side of a pencil, she uncovers the indentations left from the previous note. Saturday 06:35 Where All Your Dreams Come True BANG BANG BANG! There is a SHARP KNOCK at the window. MARY JUMPS OUT OF HER SKIN - but it’s just HENRY. Mary goes and opens the window. HENRY Have you gone insane? MARY I know it's Phoenix and I'm going to prove it. Henry climbs through the window. HENRY This is breaking and entering! MARY We haven’t broken anything. Post Additional Photography Draft 2 - 06.08.17   77.",
      "characters": [],
      "action_text": "Henry knocks over a vase. It smashes on the floor. HENRY Why would Phoenix steal a pop-up book? He’s a millionaire! MARY Well that’s where you’re wrong. He owes money all over town. She thrusts some paperwork into Henry’s hands. HENRY So he’s got a few bills, I mean everyone-- good grief the man spends a lot on face cream. MARY He hasn’t got a penny to his name. Now come on. Let’s find that book and get out of here.  EXT. ROAD - DAY 116 Phoenix is walking down the street. He realises he has forgotten his cravat and turns back the way he’s come.  INT. PHOENIX’S LANDING - DAY 117 Henry and Mary stand at the top of the landing. They’ve searched the whole house with no luck. Mary sighs. MARY We must be missing something. HENRY Unless there’s nothing to find. Can we please go? They head downstairs. But suddenly, something catches Mary’s eye. In the landing carpet, there are TWO INDENTATIONS. MARY Look, Henry, the carpet! HENRY It’s lovely I’ll order a swatch. She looks up at the PANELLED CEILING above her. MARY Give me a leg-up. Henry reluctantly does so, creaking as he bends over. Post Additional Photography Draft 2 - 06.08.17   78. MARY (CONT’D) What’s that noise? HENRY It’s me. MARY Gosh you really do creak. HENRY Can we just get on with it? He hoists her up to the ceiling where she presses a ceiling panel - and it SWINGS OPEN. A STEP LADDER UNFOLDS, its feet landing in the two divots. MARY A secret room! HENRY It’s an attic. MARY A secret attic. HENRY It’s an ordinary attic. Mary heads up, followed by Henry. HENRY (CONT’D) Every house on the street has one. See? Just a perfectly normal...  INT. PHOENIX'S ATTIC ROOM - CONTINUOUS 118 Henry sees Phoenix's mannequins. HENRY Oh my god, he’s a weirdo. MARY Look, Henry! The nun! The thief! The King! HENRY We were right! MARY We?! HENRY Well, I never said... Suddenly, they hear the noise of the front door opening. Post Additional Photography Draft 2 - 06.08.17   79.",
      "dialogue_count": 0,
      "word_count": 568
    },
    {
      "scene_number": 13,
      "slugline": "INT. PHOENIX’S HALLWAY - DAY 119 Phoenix comes through the front door.  INT. PHOENIX’S ATTIC ROOM - DAY 120 Henry and Mary creep down the ladder and close the hatch behind them. They peer over the banisters and see Phoenix going into the bathroom at the back of the hall.  INT. PHOENIX’S HALLWAY - DAY 121 They get to the bottom of the stairs and run to the front door but Phoenix turns back to the hall - so they have to BOLT INTO THE LIVING ROOM to hide. Phoenix walks through the hall and hears footsteps. He grabs a WALKING STICK SWORD from the umbrella stand in the hall and goes into the living room. PHOENIX Hello? Who goes there? Show yourself! I am armed and schooled. Everything seems normal - apart from one thing: HENRY'S LEGS disappearing behind the sofa. PHOENIX (CONT’D) Henry? Henry sheepishly gets to his feet. He can’t help noticing Phoenix is brandishing a sword. HENRY Hello Phoenix. PHOENIX What on earth are you doing here? HENRY I might ask you the same thing. PHOENIX I live here! It’s my house. HENRY And I... insure it. And for our Platinum Club members, we perform an annual full home inspection to verify your security arrangements. PHOENIX In your pyjamas? Post Additional Photography Draft 2 - 06.08.17   80.",
      "characters": [],
      "action_text": "HENRY Mm-hm. PHOENIX With your wife? Phoenix pulls back a curtain to reveal Mary, who taps the window, pretending she was inspecting it. MARY ...seems pretty secure. Oh, hello Phoenix! Didn’t hear you come in. HENRY She helps out when we’re busy. PHOENIX Well I must say that sounds... plausible. HENRY Does it? Great. Well I’m delighted to say everything seems tickety- boo... PHOENIX Wonderful. HENRY So we’d better get cracking. Phoenix ushers them towards the door. HENRY (CONT’D) I’ll get the boys in the office to type this up asap and hope to see you soon. PHOENIX Absolutely. Though next time, perhaps not in your pyjamas, eh? They all laugh far too much. Phoenix shuts the door and his smile drops as he darts upstairs.  INT. PHOENIX’S ATTIC ROOM - CONTINUOUS 122 Phoenix bursts in. The POP-UP book is still there, locked in his make-up table. He breaths a huge sigh of relief. PHOENIX Oh thank Larry it’s there. Thank Larry, Johnny and all the ghosts of the avenue. PHOENIX AS MAGWICH That was close. Post Additional Photography Draft 2 - 06.08.17   81. PHOENIX AS MACBETH Aye. Too close if you ask me. Phoenix opens the book. PHOENIX Hold your nerve, MacBeth. Screw your courage to the sticking post. We are so nearly there. I have followed this little lady all the way across London and found every one of her clever little clues. PHOENIX AS MACBETH Aye. But what do they mean? PHOENIX AS MAGWICH It’s just a jumble of letters. PHOENIX AS POIROT Au contraire, mon ami. They are not letters at all. They are musical notes. PHOENIX Indeed, Poirot. And I believe I know just where to play them. He looks at the back cover of the book, which features a picture of the FAIRGROUND ORGAN and the words ‘WHERE ALL YOUR DREAMS COME TRUE.’  EXT. POLICE STATION - DAY 123 From outside, we can hear the Browns all talking at once.  INT. POLICE STATION - DAY 124 The Browns and Mrs Bird are lined up at the counter, making their case to the Policewoman who arrested Paddington. POLICEWOMAN Hold it, ho",
      "dialogue_count": 0,
      "word_count": 1380
    },
    {
      "scene_number": 14,
      "slugline": "EXT. PRISON ROOF - NIGHT 135 The prisoners wait for the searchlight to sweep past the kitchen, then climb out of the skylight and run along the roof to the shadows at the base of the watch tower.  EXT. PRISON WATCH TOWER - NIGHT 136 The light sweeps over them once more and the prisoners climb to the roof above the watch tower guard. They open the basket and pull out an ENORMOUS SHEET OF TABLE CLOTHS that have been STITCHED TOGETHER.  INT. LAUNDRY BASKET - NIGHT 137 Phibs opens the valve of the propane tank. Spoon ignites the flame.  INT. CELL - NIGHT 138 T-BONE looks out the window and double-takes. Rising from the roof of the watch tower is a HOT AIR BALLOON. The CANOPY is made of TABLECLOTHS, the BASKET is the laundry basket, and it's fuelled by PROPANE. And riding in it are Knuckles, Phibs, Spoon and Paddington. T-BONE Good luck, little bear.  EXT. PRISON EXERCISE YARD - NIGHT 139 THE BALLOON floats OVER THE PRISON WALL.  EXT. BALLOON BASKET - NIGHT 140 Three prisoners hurl their prison hats and jackets into the sky, whooping with delight at their escape. But Paddington looks out at the city he loves, worried about the choice he has made, scared of being a fugitive.  EXT. LONDON DOCKLANDS - NIGHT 141 Knuckles and the others are wearing the civilian clothes they took with them. Paddington is back in his hat and coat. Post Additional Photography Draft 2 - 06.08.17   86.",
      "characters": [],
      "action_text": "KNUCKLES Bring her down, Spoon.  EXT. DERELICT FACTORY - NIGHT 142 The balloon comes to earth by a derelict factory on the river in the east end of London. The prisoners tumble out of the basket and run through the factory to the wharf as the balloon deflates behind them.  EXT. DERELICT FACTORY / WHARF - NIGHT 143 The prisoners run up to the wharf where a SEAPLANE waits. KNUCKLES There she is, boys. Our ticket out of here. Paddington is startled by this statement. PADDINGTON What do you mean? Where are you going? The prisoners look guiltily to one another. SPOON May as well tell him, Knuckles. PADDINGTON Tell me what? Aren’t we going to clear my name? KNUCKLES (sheepishly) Sorry, kid, er... Change of plan. Paddington can scarcely believe what he’s hearing. PHIBS We’re leaving the country! SPOON And you’re coming with us! PADDINGTON But you said... You lied to me! Knuckles feels ashamed of the deception but genuinely believes he’s done the right thing. KNUCKLES Hey now, it’s not like that. We were doing you a favour. (MORE) Post Additional Photography Draft 2 - 06.08.17   87. If we’d told you the truth you’d never have come along - and it’s better this way. We’ll make marmalade together! PADDINGTON But I don’t want to, Knuckles. I want to go clear my name and go home. And you said you’d help! You promised! KNUCKLES (hardening his heart) Sorry, kid. No can do. Hearing this, Paddington just turns and runs. SPOON Paddington! KNUCKLES Let him go. If he wants to get himself arrested, it’s his choice.  EXT. STREET / ALLEY - NIGHT 144 Paddington walks down a main road, all alone in the world. Behind him, a POLICE CAR turns on its siren and drives towards him. Paddington ducks into an alley, screwing his eyes shut and waiting for the inevitable. But the Police Car passes by. Paddington heaves a sigh of relief - and looks up to see a TELEPHONE BOX in the alley. An idea occurs to him. He finds a single coin in his pocket, the one Mrs Bird found in his ear at breakfast. He goes",
      "dialogue_count": 0,
      "word_count": 856
    },
    {
      "scene_number": 15,
      "slugline": "INT. BROWNS’ HOUSE / PHONE BOX - NIGHT 147 Mary beckons Henry - who is just coming in from postering - to join her and the rest of the family at the phone. PADDINGTON I’m so sorry I escaped, Mrs Brown but I thought you’d forgotten me. MRS BIRD We’d never forget you, Paddington! HENRY Paddington?! MARY You’re family! JUDY And we know who the thief was! JONATHAN Phoenix Buchanan! PADDINGTON Mr Buchanan?! MRS BIRD But he’s disappeared into thin air. Mary looks at the piece of paper she took from his house. MARY We’ve been looking for him at every landmark in that book, every last page. PADDINGTON ‘Where all your dreams come true’. MARY Why do you say that? PADDINGTON It was written on the last page of the pop-up book. Always made me think of Aunt Lucy. MARY That’s funny. I found the exact same phrase on a piece of paper at Phoenix’s house. JUDY I’m sure I’ve seen that before. Judy looks at the cover of an old copy of her newspaper. It has the picture of Phoenix and Paddington opening the fair. Post Additional Photography Draft 2 - 06.08.17   90.",
      "characters": [],
      "action_text": "On the organ behind them is the FAIRGROUND ORGAN, and on that, the words ‘Where All Your Dreams Come True!’ HENRY The Organ! JONATHAN That must be where Madame Kozlova hid her fortune. HENRY Then let’s get to the fair! JUDY Too late. They’re leaving today. JUDY (CONT’D) From Paddington Station. MARY (looking at her paper) At 6.35. MRS BIRD There’s still time. HENRY Paddington, get to the station. If we can find Phoenix and get hold of that book, his fingerprints will prove everything.  INT. PHONE BOX - NIGHT 148 PADDINGTON But that’s miles away, Mr Brown, I’ll never... Paddington hears the DISTINCTIVE HORN OF THE BIN LORRY and looks down the alley to see MR BARNES, the BINMAN. PADDINGTON (CONT’D) I’ll see you there.  EXT. LONDON STREETS - NIGHT 149 Paddington rides the dustbin lorry as it drives through town. Cars screech to a halt around them. MR BARNES Clear the road! This is a refuse emergency! Post Additional Photography Draft 2 - 06.08.17   91.",
      "dialogue_count": 0,
      "word_count": 363
    },
    {
      "scene_number": 16,
      "slugline": "EXT. WINDSOR GARDENS - NIGHT 150 Mr Curry is standing by the newspaper kiosk his dressing gown with a loud hailer. A homemade neighborhood ‘Panic board’ sits in the road next to him. MR CURRY Fellow citizens. This is your Community Defence Force Commander. The neighbours come to their windows, woken by the sound. MR CURRY (CONT’D) I have just received intelligence the bear has escaped from prison and may be heading this way. I am raising the neighborhood panic level to “Wild Hysteria”. He shifts the arrow on his board from “Extremely Jittery” to “Wild Hysteria”. The Browns run out of their house towards their car. MARY Get out of the way, Mr Curry. JUDY Paddington’s not heading this way. JONATHAN He’s going to clear his name. MRS BIRD And we’re going to bring him home! MR CURRY We don’t want him here! Henry stops and approaches him. And as he speaks, the neighbours begin to understand the truth of his words. HENRY Of course you don’t! You never have. You took one look at that bear and you made up your mind. Well Paddington’s not like that. He looks for the good in all of us and somehow, he finds it. He wouldn’t hesitate if any of us needed help. So stand aside, Mr Curry, because we’re coming through! Henry tries to start the car. But it stalls. MR CURRY Oh very good! Your plan seems to have stalled. Like your vehicle. Post Additional Photography Draft 2 - 06.08.17   92.",
      "characters": [],
      "action_text": "But suddenly the car begins to move. Henry looks around, amazed, to see the neighbours have gathered around their car and are pushing it. DR JAFRI Second gear, clutch down, Mr Brown. COLONEL After three? Three! MR CURRY What’s going on? What are you doing? Do not push that vehicle! DR JAFRI Bring Paddington home. The car roars into life and heads toward the newspaper kiosk. Mr Curry jumps out of the way as the car runs over the Panic Board. The neighbours all cheer in relief.  EXT. PADDINGTON STATION / ENTRANCE RAMP - NIGHT 151 The dustbin lorry pulls up at the station. The Bin Man jumps down, takes the PLASTIC SLEEVE off a LITTER BIN by the entrance, and puts it over Paddington. MR BARNES Now Paddington, keep your head down and remember, you’re a bin.  INT. PADDINGTON STATION / CONCOURSE - NIGHT 152 The bin walks across the concourse, muttering to itself. PADDINGTON (O.S.) You’re a bin, you’re a bin, just an ordinary bin, going for a walk. He suddenly freezes as he sees a DOZY POLICEMAN approach, eating a doughnut. He ducks as the Policeman puts half a doughnut in the bin. PADDINGTON (O.S.) (CONT’D) Thank you! The Policeman freezes. That was weird. PADDINGTON (O.S.) (CONT’D) Nothing to see here, Officer, just a bin. Post Additional Photography Draft 2 - 06.08.17   93. The Policeman shrugs and goes on his way. Paddington pops up, eating the doughnut. PADDINGTON (O.S.) (CONT’D) It’s quite good being a bin.  EXT. ROAD BRIDGE NEAR PADDINGTON STATION - NIGHT 153 The Browns’ car races over a bridge near Paddington. Beyond the station are the first gleams of the winter dawn.  INT. PADDINGTON STATION / PLATFORM 1 - NIGHT 154 Paddington waits in the bin by the Fair Train, watching a TRAIN PORTER APPROACH. It’s PHOENIX IN DISGUISE.  EXT. PADDINGTON STATION / ENTRANCE - NIGHT 155 The Browns pull up at the station and leap out of the car.  INT. PADDINGTON STATION / PLATFORM 1 - NIGHT 156 A whistle is blown and the train starts to move. Phoenix hops onto the platform at the bac",
      "dialogue_count": 0,
      "word_count": 915
    },
    {
      "scene_number": 17,
      "slugline": "INT. PULLMAN CARRIAGE - NIGHT 159 The sudden lurch makes the Steward slosh champagne all over the Judge, who is immediately irate. STEWARD I’m so sorry, sir. JUDGE Get off me! Get off! The Judge’s Wife starts shushing him. JUDGE (CONT’D) Don’t shush me, Gertrude. I have just been spilled upon by chilled liquid! WIFE Gerald? I want you to shush. The Judge is silenced. JUDGE Yes Gertrude.  INT. SEA PLANE - DAWN 160 Spoon pilots the plane high over the English countryside while Knuckles tunes a portable radio. RADIO Four convicts made a daring escape from Portobello Prison last night. The prisoners all appear to have vanished without a trace... The three prisoners are delighted: they’ve got clean away. RADIO (CONT’D) ...except Paddington Brown, who was seen boarding a train bound for Bristol. Police are closing in and expect to make an arrest soon. The prisoners are visibly deflated by the news. Phibs looks out of the window at the railway line far below. PHIBS Poor little guy. He must be somewhere down there right now. Probably scared half to death. SPOON Shouldn’t we help him, Knuckles? Post Additional Photography Draft 2 - 06.08.17   96.",
      "characters": [],
      "action_text": "KNUCKLES If we go down there now, they won’t just lock us up, they’ll throw away the key. SPOON I know but... he’s our friend. KNUCKLES We stick to the plan. I don’t do nuthin for no-one for nuthin. But as he looks out of the window, his eyes fill with tears.  EXT. COUNTRYSIDE - DAY 161 The Fair Train races away from London and into rural England. The camera pushes in towards the front truck which contains the Fairground Organ.  INT. FAIR TRAIN / ORGAN TRUCK - DAY 162 Phoenix walks into the ORGAN TRUCK, taking off the wig he wore to disguise himself as the Porter. He pulls a TARPAULIN off the FAIRGROUND ORGAN. He looks at one of the mannequin figures on the organ: the magician. PHOENIX Well, Grandfather, the moment of truth. He takes the pop-up book from his bag and turns to the first page, Tower Bridge. PHOENIX (CONT’D) “D” He presses the corresponding note on the ORGAN KEYBOARD. A light appears. PHOENIX (CONT’D) It’s working. He starts putting in the other notes, but at the far end of the carriage, Paddington is watching through the window. He spots the book, a HATCH in the roof above it, and remembers Henry’s words. HENRY (V.O.) If we can find that book, his fingerprints will prove everything. Paddington looks around and spots a BARREL OF TOFFEE APPLES. A plan begins to formulate in his mind. Post Additional Photography Draft 2 - 06.08.17   97.",
      "dialogue_count": 0,
      "word_count": 443
    },
    {
      "scene_number": 18,
      "slugline": "INT. PULLMAN CAB - DAY 163 Judy is leaning out of the cab. Looking through her camera’s telephoto lens she can see Paddington climbing towards the roof with a couple of toffee apples. HENRY What’s he doing? JUDY I don’t know! HENRY Paddington! JUDY He can’t hear us! Henry swings inside. HENRY Can this thing go any faster? JONATHAN I can try but we need more coal! MARY I’m on it. HENRY Try to pull alongside. I’m going across. JUDY I’ll come with you. HENRY Judy... MRS BIRD Just you try and stop us. HENRY Come on then. He swings out of the cab.  EXT. FAIR TRAIN / ORGAN TRUCK - DAY 164 Paddington climbs up onto the roof. Using the toffee apples like SUCKERS, he makes his way along the windy roof to the SKYLIGHT above Phoenix’s head. Suddenly, he spots a tunnel approaching and has to LIMBO BACKWARDS to avoid being squashed. Post Additional Photography Draft 2 - 06.08.17   98.",
      "characters": [],
      "action_text": "He emerges from the tunnel, COVERED IN SOOT, and continues towards Phoenix.  EXT. BETWEEN THE TRAINS – DAY 165 Henry, Judy and Mrs Bird climb out onto the FRONT OF THE ENGINE. Henry helps Mrs Bird and Judy onto the FAIR TRAIN. Lastly, he reaches out with one leg and gets ONE FOOT on the PLATFORM at the back of the FAIR TRAIN. But suddenly the TRACKS PART and Henry finds his LEGS BEING PULLED WIDE APART between the two trains. CHAKRABATICS INSTRUCTOR (O.S.) Open your mind and your legs will follow. Henry goes into a zen state and manages to do the splits. But then, suddenly, he spots a telegraph pole rushing towards him and screams for help. Luckily, Mrs Bird hears him, runs back to the platform and pulls him to safety. HENRY Thank heavens for Chakrabatics.  INT. FAIR TRAIN / ORGAN TRUCK - DAY 166 PHOENIX is putting in the last of the code. Above him, Paddington opens the HATCH and looks down. PHOENIX “F”. And “E.” Suddenly the WHOLE FAIRGROUND ORGAN LIGHTS UP. Phoenix steps forward, hypnotised by the splendour of what he’s seeing. Behind him, Paddington SWINGS THROUGH THE SKYLIGHT, using the toffee apples like suckers to HANG FROM THE ROOF. With a whirring of cogs, the ORGAN BEGINS TO OPEN. The pipes sink down, and the mannequin of Madame Koslova rises into the body of the machine, exposing a complex CLOCKWORK MECHANISM. Behind Phoenix, Paddington creeps along towards the book, the sound of the toffee apples masked by the sound of the organ. Meanwhile, a TREASURE BOX rises out of the organ mechanism. Phoenix stares, entranced, as the box opens, revealing its treasure: piles of gold jewellery, trinkets and diamonds. PHOENIX (CONT’D) Hello! Post Additional Photography Draft 2 - 06.08.17   99. Behind him, Paddington manages to grab the book - and starts inching his way back towards the skylight. PHOENIX (CONT’D) Aren’t you pretty! West End, here I come! Suddenly the organ stops playing and now Phoenix can hear the sound of the toffee apples on the roof behind him. He t",
      "dialogue_count": 0,
      "word_count": 1104
    },
    {
      "scene_number": 19,
      "slugline": "INT. FAIR TRAIN / GALLOPERS TRUCK - DAY 173 Henry, Mary and Mrs Bird have been handcuffed to some poles. Phoenix checks they’re securely fastened. PHOENIX Good, good, excellent. Now for your furry friend.  EXT. FAIR TRAIN / REAR TRUCK - DAY 174 Paddington opens his suitcase and pulls out his TELESCOPIC LADDER. He wedges the top end of the ladder into a gap in the floorboards of the platform at the back of the train. Paddington climbs onto the bottom end of the ladder and starts WINDING IT OUT towards the PULLMAN, hoping to create a bridge between the two trains. Suddenly, Phoenix appears at the door and spots Paddington. PHOENIX Coo-ee! He tries to go through the door - but it’s locked. He throws a shoulder against it.  INT. FAIR TRAIN / GALLOPERS TRUCK - DAY 175 JUDY What are we going to do? Mrs Bird pulls a pin out of her hair. MRS BIRD Don’t worry. I know a little trick Harry Houdini used to do. She starts working at the lock of her handcuffs with the pin.  EXT. BETWEEN THE TRAINS - DAY 176 Phoenix is still bashing against the door. The wood starts to splinter. Meanwhile, Paddington has made his way to the far end of the ladder, but still can’t quite reach Mary. And just then, Phoenix breaks through door. He hits the RETRACT BUTTON on the EXTENDABLE LADDER. Paddington is PULLED BACK INTO HIS ARMS. Post Additional Photography Draft 2 - 06.08.17   103.",
      "characters": [],
      "action_text": "Phoenix grabs the BOOK, hurls Paddington into the rear truck, and BOLTS THE DOOR, trapping him inside the last truck.  EXT. FAIR TRAIN - DAY 177 Phoenix PULLS THE PIN between the two trucks, SEPARATING PADDINGTON’S FROM THE REST OF THE TRAIN. PHOENIX Bye bye, bear. He leans out and uses the pin to knock a TRACK-SIDE LEVER. The POINTS SHIFT, sending Paddington’s truck hurtling onto a different track. Phoenix turns back inside but stops in his tracks, standing in the middle of four COCONUTS ON STANDS. We crash zoom as he sees the Browns have escaped from their handcuffs and stand at the far end of the next truck. Judy takes a photograph, while Henry picks up a coconut shy ball, and throws it. It travels through clean the two trucks and connects with PHOENIX’S FOREHEAD - knocking him cold. HENRY Bullseye!  EXT. RAILWAY - DAY 178 PADDINGTON’S TRUCK has left the main railway line and is now hurtling through a siding. He is thrown around as it CRASHES THROUGH THE BUFFERS at the end of the siding. It HURTLES DOWN A SLOPE, crashing through foliage, over a cliff and into the murky waters of a river below.  INT. PULLMAN DRIVER’S CAB - DAY 179 Mary has seen the disaster from their cab. MARY Stop the train, Jonathan. Jonathan PULLS THE BRAKE LEVER.  EXT. VIADUCT - DAY 180 The Pullman SHRIEKS TO A HALT on a viaduct. Post Additional Photography Draft 2 - 06.08.17   104.",
      "dialogue_count": 0,
      "word_count": 497
    },
    {
      "scene_number": 20,
      "slugline": "INT. RUNAWAY FAIR TRUCK - DAY 181 Paddington’s truck is SINKING INTO THE RIVER. He tries to open the door - but it won't give.  EXT. VIADUCT - DAY 182 Mary jumps off the train. MARY Jonathan. Go and get help.  INT. RUNAWAY FAIR TRUCK - DAY 183 Paddington heaves, but the door still won’t give, and the carriage is filling with water.  EXT. VIADUCT - DAY 184 Mary runs to the side of the bridge.  EXT. UNDERWATER - DAY 185 The Runaway Truck lands at the bottom of the river.  EXT. VIADUCT - DAY 186 Mary pulls off her coat and DIVES INTO THE WATER.  EXT. UNDERWATER - DAY 187 Mary cuts through the water, swimming down towards the truck.  INT. RUNAWAY FAIR TRUCK - DAY 188 A FEW INCHES OF AIR have been trapped towards the top of the truck, but they’re DISAPPEARING FAST. Paddington hears a METALLIC NOISE from the other side of the door as Mary works the lock from the outside. He TAKES A FINAL BREATH and sinks under the water.  EXT. UNDERWATER - DAY 189 Mary has UNBOLTED THE DOOR. She HEAVES IT OPEN, inch by inch. She can see Paddington’s face through the crack in the door. Post Additional Photography Draft 2 - 06.08.17   105.",
      "characters": [],
      "action_text": "But then the door STOPS MOVING. Mary looks frantically around for the problem. She sees that the door has been CHAINED SHUT. Mary and Paddington TUG AT THE CHAIN TOGETHER with all their might - but it's no good. The chain is just too strong. Paddington reaches through the gap in the doorway and TAKES MARY'S HAND WITH HIS PAW. They gaze at each other, knowing the end is upon him. But suddenly... a shadow crosses his eyes. He looks up to see the silhouette of a SEAPLANE LANDING ON THE WATER ABOVE THEM! He can hear distant voices. There are three splashes as people dive in. And then... SOMEONE ELSE IS AT THE DOOR! It’s KNUCKLES! Phibs and Spoon follow in his wake. Together, they ALL PULL AT THE DOORS. And slowly, inexorably, the CHAIN BREAKS. Mary grabs Paddington and pulls him towards the surface.  EXT. RIVERBANK - DAY 190 Mary, Knuckles and Paddington surface, gasping for breath. PADDINGTON Knuckles! You came back! KNUCKLES Can’t make marmalade on my own, now, can I? Paddington smiles - and then passes out. MARY Paddington? He’s burning up. KNUCKLES Best get the little fella to bed. They climb out of the water as Henry, Jonathan, Judy and Mrs Bird appear on the bank. Post Additional Photography Draft 2 - 06.08.17   106. HENRY Mary! JUDY Mum! JOANTHAN Paddington! MARY He’s not well. KNUCKLES He’ll be fine. Won’t you, little buddy.  EXT. WINDSOR GARDENS - THREE DAYS LATER 191 Snow falls in the street. The camera cranes up towards Paddington’s attic window and through into his room.  INT. PADDINGTON'S ATTIC ROOM - DAY 192 Paddington lies asleep in bed, surrounded by the family. Mrs Bird is taking his temperature. As she removes the thermometer from his mouth, his eyelids flutter and he wakes up. JONATHAN Paddington! PADDINGTON Where am I? MARY Take it easy, now. MRS BIRD You gave us a wee scare, but you’re home now. Paddington’s face lights up. PADDINGTON Home? JUDY That’s right. Look! Judy hands him a newspaper: “EXCLUSIVE! PADDINGTON FREED! Dog Food Actor Arrested.” J",
      "dialogue_count": 0,
      "word_count": 1292
    },
    {
      "scene_number": 21,
      "slugline": "INT. PRISON ATRIUM - DAY 196 Phoenix is in prison, performing an EXTRAVAGANT MUSICAL version of “RAIN ON THE ROOF”. But instead of performing on his own, he now is part of a company with the other inmates. They finish the routine and the prison crowd go wild. PHOENIX Thank you my darlings, thank you. It seems I didn’t need the West End at all, just a captive audience. The crowd laugh at his terrible joke. PHOENIX (CONT’D) Honestly, what am I like? Guards, lock me up! Oh wait, you have! Post Additional Photography Draft 2 - 06.08.17   112.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 100
    }
  ]
}