{
  "slug": "palm-springs-2020",
  "title": "palm springs",
  "genre": "drama",
  "format": "film",
  "scenes_count": 13,
  "characters_count": 0,
  "characters": [],
  "total_words": 24029,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. CALIFORNIA DESERT - DAY  We’re LOW TO THE GROUND, floating through a patch of Desert Marigolds swaying with the breeze, a stark contrast to their desolate, eerily silent surroundings. Until -- A TORTOISE trudges into frame, an imposing prehistoric beast from this angle. Three healed SCARS mar its shell -- remnants of a lifelong shitstorm. And it’s about to get worse. A MASSIVE EARTHQUAKE HITS, the tortoise halts. A CRACK splinters in the earth’s crust -- ORANGE LIGHT bursts up -- Mother Nature takes the tortoise, burying it alive. Or dead. Who knows? Who cares?   CUT TO: A PERFECTLY CLEAR NIGHT SKY. Full moon, every constellation. As we PAN ACROSS, the muffled sound of Gram Parsons’ “Return of the Grievous Angel” crescendos until we land on its source: A ROADSIDE BIKER BAR. A true desert dive lost in time.  INT. ROADSIDE BIKER BAR - NIGHT  PUSH IN on NYLES, 35 -- his head down on the bar, dressed in swim trunks and a Hawaiian shirt, a full glass of whiskey to the side. How he ended up here is anyone’s guess, but what’s clear is a faded self-regard and fatalistic outlook. A few BARFLIES throw darts and eat chili behind him. DARLA, 60s, a crusty regular, rubs his leg. Nyles shoots up. DARLA You okay, sweetheart? NYLES I've felt everything I'll ever feel so I'll never feel ever again. Darla looks to TED THE BARTENDER -- DARLA What’re you pouring this kid, Ted? TED THE BARTENDER That’s his first drink. NYLES I thought I knew how to live. But I didn’t. Or, I don’t? You know what I mean.",
      "characters": [],
      "action_text": "DARLA Darlin’, take a look around: whatever you’re after, it ain’t here... Nyles stares back at Darla -- for an uncomfortably long time. Darla cocks her head.   What the fuck is this guy on?  DARLA (to Ted the Bartender) You sure he didn’t take something? TED THE BARTENDER He’s sober. Kid’s just moping there. Nyles glares at Ted, defiantly shoots back his whiskey, and shatters his glass on the floor. NYLES I’m a fucking adult, Thaddeus. TED THE BARTENDER Talk to me like that and you’ll be pulling your teeth from the bar. Nyles sizes up the barflies leering at him. He turns to Ted and holds a   peace   sign... and rotates it into a middle finger. CUT TO:  EXT. ROADSIDE BIKER BAR - NIGHT  We HEAR the sound of a FIGHT: SHOUTING, GLASS BREAKING -- The front door flies open and two GIANT BIKERS hurl Nyles face first onto the gravel parking lot, then go back inside.  CUT TO:  EXT. DESERT DIRT ROAD - NIGHT  Nyles trudges up a moonlit road. He takes a Tecate from his pocket and drinks as he reaches the top of a hill, where another source of LIGHT illuminates his face. He gazes out with a look of recognition -- and resignation: A LARGE ESTATE at the end of the road, 100 yards down, in this otherwise pitch black desert valley. The MAIN HOUSE in the center, with two large GUEST HOUSES, all connected through strands of twinkling lights extending down a long dirt driveway, packed full of hybrid cars. Nyles continues toward the estate, passing a SIGN: “Tala & Abe’s Wedding - November 9,” stenciled on driftwood in white Futura font. Nyles SLAPS it down as he passes. 2. NYLES Nooooooovember ninth. PRE-LAP the sound of LAUGHTER FROM A CROWD --  EXT. CALMADA ESTATE - BACKYARD - NIGHT  A Pinterest board come to life: Under an intricately designed web of lights fixed to palm trees, FIFTY WEDDING GUESTS of all ages and dressed in all sorts of hip, eclectic attire sit at tables assembled around a DANCE FLOOR, where MISTY (28, a bridesmaid with face gems) is giving a drawn-out speech -- M",
      "dialogue_count": 0,
      "word_count": 2929
    },
    {
      "scene_number": 2,
      "slugline": "EXT. DESERT HILLSIDE - MOMENTS LATER  Nyles hobbles around the bend, losing blood, slowing down... and he collapses before a mound of boulders blanketing the side of a hill...   almost   at his destination: A TRIANGLE-SHAPED CAVE in the hillside, twenty feet ahead. But he can’t make it in time -- Roy’s grunting just around the bend. Quick decision -- Nyles army crawls to the other side of a nearby Joshua Tree, concealed by darkness. He holds his breath, remaining completely silent, just as -- Roy rounds the bend -- and stops before the cave. Roy looks around, but he can’t see Nyles. It’s too dark. NYLES’ POV: Roy’s menacing silhouette, fifteen feet away. Roy shouts   into   the cave. ROY Keep running, shit bird. I’ll always find you. Then, with a disappointed sigh, Roy marches forward --   into  the cave. And after a few seconds... Roy vanishes. Weird. Relieved, yet still in excruciating pain, Nyles uses his remaining strength to crawl   into   the cave, following Roy.  INT. TRIANGLE CAVE - CONTINUOUS  Nyles goes deeper, groaning and wincing with each movement. SARAH (O.S.) (a loud whisper) Hey! He turns his head to find Sarah, twenty feet back, standing at the mouth of the cave. NYLES Stop! No no no -- SARAH Are you okay? NYLES Don’t come in here -- A POWERFUL FORCE SUCKS NYLES DEEPER INTO THE CAVE -- FARTHER AND FARTHER FROM SARAH -- A BURST OF ORANGE LIGHT -- 14.",
      "characters": [],
      "action_text": "MISTY (PRE-LAP) Wake up.   CUT TO:  INT. NYLES AND MISTY’S BEDROOM - MORNING  Nyles wakes up in bed, shirtless, free from any injuries or scars. He rolls over with a yawn to find Misty wrapped in a towel, leg up on the bed as she moisturizes. Her hair and make-up are wedding ready. NYLES That’s a good leg. She gives him a cheeky smile.  INT. NYLES AND MISTY’S BEDROOM - BATHROOM - MORNING  Misty and Nyles have sex. And it’s a struggle. (This is the same bathroom we saw Misty and Trevor in.) MISTY You close? I can’t start sweating. NYLES Working on it, darling. After a few more thrusts, Misty stops, frustrated. MISTY I have to get ready. Just finish on your own. Watch me, I don’t care. Misty heads to the bedroom. NYLES Cool, yeah, that’s romantic. Nyles tries masturbating, watching her dig in her suitcase... But he catches his reflection in the mirror -- sweat beading on his chest hair, fat jiggling with each stroke. He grimaces back, full of shame, a weak man trying to feel something... So he strokes harder, faster, FASTER --  INT. NYLES AND MISTY'S BEDROOM - MOMENTS LATER  Starfished on the bed, Nyles cycles through every channel on TV, never stopping. Misty pulls on her bridesmaid’s dress. 15. MISTY No offense, but you’re the only guy I’ve been with who’s had a problem coming. And don’t say the age thing. I’ve had older boyfriends. Nyles keeps his eyes locked on the TV. NYLES It’s not you, it’s me. MISTY Yeah, no shit. NYLES I meant it’s you, not me. MISTY Funny. NYLES I meant kill me. MISTY Look, I know weddings make you super uncomfortable, but please don’t bring our drama here. This day doesn’t belong to us. It’s Tala and Abe’s. Nyles gives a thumbs up. Misty doesn’t buy his sincerity, but also doesn’t have time to argue. She escapes to the bathroom.  EXT. CALMADA ESTATE - FRONT - MORNING  Howard carries a driftwood sign down the driveway. At a fork in the road, he hammers it in the dirt with a mallet. REVEAL THE SIGN: “Tala & Abe’s Wedding - November 9.”  EXT. ",
      "dialogue_count": 0,
      "word_count": 4871
    },
    {
      "scene_number": 3,
      "slugline": "EXT. CALMADA ESTATE - BACKYARD - NIGHT  We follow a SERVER through the COCKTAIL HOUR with a tray of tuna tartare on wonton crisps. Guests clutching signature cocktails snag bites as she passes -- NYLES (V.O.) This was back in the early days, before I really became acquainted with everyone. I was still feeling my way through... A HAND taps the server on the shoulder, and we turn around with her to find: ROY (50s), white hair, white teeth, grey suit, much less frightening in the light. He grabs a wonton -- ROY This tuna? SERVER Yeah. He takes a bite -- ROY Mmm. Tasty. The server holds the tray as he takes two more. She moves on, but we follow Roy meander away, smiling at guests he clearly doesn’t know while he continues to eat, until he makes it to -- THE BAR Where Nyles talks nonsense to Daisy the Bartender. NYLES I know you know. But you don’t know that I know. Or do you know? Daisy stares back, unenthused. ROY You being a dick to Daisy? It takes a patient soul to put up with pricks like us. (to Daisy) A more beautiful barkeep I never did see... Moscato, please. NYLES  “What might have been and what has been point to one end, which is always present.”  37.",
      "characters": [],
      "action_text": "Roy considers Nyles, intrigued by this drunk prophet. ROY Actually Dais’, two whiskey shots. Daisy pours the shots, hating life. Roy flips through a massive wad of cash, puts a single dollar bill in the tip jar. Roy hands Nyles one of the shots and holds his up -- ROY To the struggle. Nyles and Roy take their shots -- just as the guests APPLAUD around the dance floor. The WEDDING PARTY makes their grand entrance. There’s Misty and Trevor, Erin and Nico, Sarah and Randy... And the guests go nuts as Tala and Abe stroll out. ROY Why do people clap? What’s to clap about? NYLES People clapped when the Titanic set sail. Roy chuckles. ROY Confucius said: Marriage is a seemingly bottomless pit of sorrow that makes you forget who you are. NYLES He did not. Roy smirks at Nyles: ROY But there is a bottom, my friend. And it’s dark down here. Nyles gives Roy the hang loose sign. ROY (leaning in) You wanna dance a little? Roy taps his nose. ROY The Officiant in the dumb suit -- 38. Roy gestures to THE OFFICIANT (30s), a bearded guy in a hip Nudie suit (A rhinestone embroidered cowboy suit), who MCs the wedding party entrance. ROY Turd bird has a bag of sweets in his pocket. I tried to corner him in the bathroom, but he won’t share -- But Nyles walks away from Roy before he can finish. From ROY’S POV, Nyles walks across the dance floor up to the Officiant, reaches into his pocket, pulls out a bag of pills. The Officiant buries his shock and continues to MC as Nyles, ignoring quizzical looks, returns to an amused Roy. NYLES (holding up bag) Got ‘em.   CUT TO:  INT. BATHROOM - NIGHT  Nyles and Roy grin at each other, swaying, nostrils caked in different colored powders. Roy keeps licking his lips wildly. Nyles’ gaze goes from watching this to the bathroom door handle jiggling. Someone tries to open it -- POUNDS on it -- THE OFFICIANT (O.S.) Give me back my shit! Open up! Nyles’ eyes drift back to Roy -- but he’s vanished. ROY (O.S.) (whispering) Over here. Roy crouches in the bathtu",
      "dialogue_count": 0,
      "word_count": 1409
    },
    {
      "scene_number": 4,
      "slugline": "EXT. DESERT TACO STAND - DAY  A hole-in-the-wall taco stand. Nyles and Sarah finish up burritos. A MEXICAN BOY, 8, walks up with a box of candy. BOY Chocolate? For charity... Nyles takes $100 out of his wallet and hands it to the kid. The kid’s eyes go wide. Nyles speaks to the kid in   Spanish.  NYLES  One Kit Kat, a Snickers...  (to Sarah) What candy do you like? SARAH Twix. NYLES Good choice. (to the boy)  One Twix. Keep the change, friend. And make sure you spend it all today. Buy flowers for that girl Ignacia you have a crush on.  BOY  Thank you!  The boy walks off, staring at the money. SARAH You know that’s a scam. Notice how he didn’t say which charity?  Nyles turns to the kid, now selling to another table. NYLES  What’s the name of your charity?  The boy turns, panics, then sprints down the road. NYLES I know there’s no charity. I give back when I can. I have no interest in material matters. Sarah watches in disgust as he douses his burrito with hot sauce, then takes a huge bite. SARAH Other than beers, burritos, designer drugs, and candy. 44.",
      "characters": [],
      "action_text": "NYLES (chewing through) Obviously. I’m not a Puritan. SARAH What about sex? NYLES I’m not   not   into sex. But it’s been in a steady decline. SARAH Because Misty’s cheating on you? NYLES Nah, I don’t care about that. We have sex all the time. But no matter how you feel about someone, physically or emotionally, the novelty is bound to fade. Sarah studies him.   Is he being serious? Hard to tell.  SARAH But to have to live with that over and over again, to experience that level of betrayal every day, that might really fuck a person up. Nyles studies her. NYLES Yeahhh, but it’d be pretty pathetic of me to hold a grudge. Nyles finishes off his beer. Sarah reaches under the table and grabs two more from the box of Tecate. SARAH What about fucking other people? NYLES Oh I have. It just takes a lot of work and I put very little effort into my life. A thought strikes Sarah. SARAH We’ve never had sex, right? 45. NYLES No. At least not that I recall. Memory is another thing that fades with time, but that may also just be alcoholism. SARAH Yeah, you said that already. NYLES See my point? SARAH Okay... Who, then? Besides Misty. Just curious. NYLES Daisy. The barkeep.   FLASH TO:  EXT. DESERT - NIGHT  Nyles lies on a boulder while Daisy rides him, berating him -- DAISY You are a prop. You are my little fucking dildo. NYLES Oh my goodness. BACK TO:  EXT. DESERT TACO STAND - DAY  SARAH I can see that.   Who else? NYLES Darla.   FLASH TO:  INT. DARLA’S TRAILER - BEDROOM - NIGHT  Nyles and Darla lie on the bed, caressing each other. She grabs his head and brings it to her bosom. DARLA You make me feel illegal. Nyles kisses her belly tenderly... He looks at her and locks eyes. He nods. She guides him down further, between her legs. BACK TO: 46.",
      "dialogue_count": 0,
      "word_count": 524
    },
    {
      "scene_number": 5,
      "slugline": "EXT. DESERT TACO STAND - DAY  NYLES I need to be put in my place sometimes. But it’s great because I always get to wake up alone. Or, ya know, emotionally. SARAH That’s something an asshole says. NYLES Guess I have no choice but to be an asshole. Nyles takes another bite of his burrito. SARAH What about Tala? NYLES HA. No. Tala   actually   is a Puritan. But I have tried.   FLASH TO:  EXT. CALMADA ESTATE - DANCE FLOOR - NIGHT  Tala and Abe slow dance, gazing into each other’s eyes. Nyles, dressed in a tux, taps on Abe’s shoulder. NYLES Ahem. May I cut in? ABE It’s the first dance. REVEAL: All of the guests watch. It is indeed the first dance. NYLES Please. The one dance. And possibly some over-the-clothes stuff. TALA No! BACK TO:  EXT. DESERT TACO STAND - DAY  SARAH Yeah. That’s Tala. Anyone else? NYLES Jerry. 47.",
      "characters": [],
      "action_text": "SARAH You fucked Jerry Schlieffen? NYLES He fucked me. Off Sarah’s bewildered look -- NYLES He stuck his penis in my butthole-- SARAH Yeah, I got it.   FLASH TO:  NYLES FACE   -- He looks nervous... NYLES I’m ready... He WINCES as he’s penetrated. But after a moment, he settles into it, nodding. He looks back to Jerry -- NYLES You know, it’s not that bad.   BACK TO:  EXT. DESERT TACO STAND - DAY  NYLES I’m glad I tried it. Turns out I’m not really into dudes. Nyles gathers their burrito wrappers and tosses each of them over his shoulder across the patio, directly into the trash. SARAH That’s it? NYLES Yeah. (then) Oh, and your dad.   FLASH TO:  EXT. CALMADA ESTATE - BACKYARD - LATE NIGHT  IN A HOT TUB: Nyles and Howard are forehead-to-forehead -- HOWARD What are we doing? NYLES I don’t know. 48. Howard goes in for the kiss.   BACK TO:  EXT. DESERT TACO STAND - DAY  Sarah processes, confused. Nyles stares back. For a long time. NYLES Okay, fine, that one didn’t happen. (continuing casually) What about you? Solid sex life? SARAH I’m not going to fuck you, so don’t even try. Maybe would have the other night. Not now, though. NYLES Girl, I was thinking the same thing. Sarah squints, studying him... SARAH You promise we’ve never hooked up? NYLES Again, my memory is shot, but I don’t think so. (looking up at the sun) Party’s about to start. Head back? SARAH Uh. No. Why would I do that? NYLES Eat, drink, dance. Bask in looove. SARAH That’s not love. NYLES Sure it is! Tala’s in love. SARAH HA! For someone who knows everything, you really have no idea what you’re talking about. Nyles sees he struck a bad chord there. SARAH Tala and Abe are like 95% of all couples.   (MORE) 49. They hit the point in their relationship where they got bored, but are so emotionally stunted they can’t be alone. So, they fall victim to the most archaic patriarchal scam of all time: marriage. Weddings: An industry designed to turn you against the one you ‘love.’ Nyles tries to chime in, but Sarah g",
      "dialogue_count": 0,
      "word_count": 1359
    },
    {
      "scene_number": 6,
      "slugline": "INT. NYLES’ AND MISTY’S BEDROOM - MORNING  Nyles sleeps in bed. Just another day. Someone POUNDING on the door. Misty wraps a towel around her body -- MISTY Hold on, I’m coming! She unlocks it and Sarah barges in, straight to Nyles -- MISTY What the hell, Sarah? Nyles jolts up. SARAH Didn’t work. Life is meaningless. Let’s get the fuck out of here. She heads out. Misty looks at Nyles as he rolls out of bed -- MISTY Are you -- Nyles jumps in -- NYLES -- fucking cheating on me?   MISTY -- fucking cheating on me? Nyles pulls on his swim trunks -- NYLES / MISTY (in unison) What? ... This isn’t funny. Nyles puts on his Hawaiian shirt, Misty is freaking out -- NYLES / MISTY Okay, stop... I’m serious... Don’t copy me... Stop pretending like you know everything... I hate, agh -- And this back and forth takes us into --  A SERIES, THE DAYS AND NIGHTS OF NYLES AND SARAH   - SET TO THE CONGA + SYNTH DANCE GROOVES OF ALEX CAMERON’S “THE CHIHUAHUA”:  I/E. - SARAH’S CAR/HIGHWAY - DAY  Sarah speeds down the open road, her hair blowing in the wind, Nyles stands out her sunroof with a beer.  54.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 207
    },
    {
      "scene_number": 7,
      "slugline": "EXT. BOUTIQUE HOTEL - POOL - DAY  A HIP POOL PARTY alive with dancing, cornhole, bocce ball, and a photo booth. And in the middle of it all: Nyles and Sarah float in the pool with neon cocktails.  INT. CALMADA ESTATE - BEDROOM - MORNING  Sarah wakes up. Glances at the bathroom, shower running. The weight of the real world returns. She fights through --  NYLES AND MISTY’S BEDROOM  Nyles wakes up and jumps out of bed with pep in his step.  EXT. GUN RANGE - DAY  A BULLET STRIKES FIDEL CASTRO (on a poster/target) in the forehead, blowing out cloud of dust and hay -- Nyles lowers his sniper rifle, smoke swirls from the barrel. NYLES Kill shot. Sarah steps up with an AK-47 and scans the targets. Castro, Osama Bin Laden, and some guy with a handlebar mustache. SARAH Who’s the mustache? SPUDS (50), the owner, stands by with a bazooka. A GOAT grazes in a PEN behind him. SPUDS The prick my wife ran off with. SARAH How’d you get such a good picture? SPUDS Facebook. SARAH FIRES -- DESTROYING THE MUSTACHE MAN’S HEAD.  I/E. SARAH’S CAR/HIGHWAY - DAY  Nyles drives, Sarah surfs on top of the car. Nyles hits a POTHOLE and SARAH FALLS OFF --  INT. CALMADA ESTATE - BEDROOM - MORNING  Sarah wakes up, morning dread --  55.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 225
    },
    {
      "scene_number": 8,
      "slugline": "EXT. CALMADA ESTATE - DANCE FLOOR - NIGHT  Sarah (not dressed for the wedding) walks to the edge of the dance floor. Randy drunkenly dances up to her. RANDY What up, Sarah? We missed you earlier. Tala’s pissed. SARAH I missed you. RANDY What? Sarah leans in to his ear -- SARAH Meet me in the bathroom in ten minutes... And you better be naked. RANDY You’re messing with me, right? Sarah grabs his crotch -- SARAH Use your shirt as a blindfold... And film me when you walk in. Off Randy’s bewildered smile --  INT. OUTSIDE THE BATHROOM - NIGHT  Randy is naked, blindfolded by his shirt, holding his iPhone out to record. He takes a deep breath, then opens the door -- REVEAL: Trevor going down on Misty -- MISTY Randy! Fuck! And just behind them we see Nyles and Sarah watching the scene through the bathroom window, loving it.  EXT. OPEN DESERT - DAY  Sarah’s car -- fifty yards up -- EXPLODES! Sarah, Nyles, and Spuds pop up from a DITCH, high-fiving. Nyles points to Sarah’s ears -- they’re bleeding -- but she LAUGHS about it.  56.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 191
    },
    {
      "scene_number": 9,
      "slugline": "EXT. JOSHUA TREE CAMPSITE - AFTERNOON  Nyles tries setting up a tent but can’t because Sarah keeps WHIPPING him with one of the poles, really fucking hard.  INT. TENT - NIGHT  Nyles and Sarah lie in their own sleeping bags, facing away from each other.  INT. CALMADA ESTATE - BEDROOM - MORNING  Sarah wakes up, looks at the empty space next to her in bed.  NYLES AND MISTY’S BEDROOM  Nyles wakes up, looks at the empty space next to him in bed.  EXT. CALMADA ESTATE - BACKYARD - NIGHT  Abe and Tala are about to cut the cake when Nyles runs up, CROSSBOW in hand -- NYLES Don’t! There’s a bomb in the cake! Nyles DIGS into the cake, GASPS throughout the crowd, and he finds a BRICK OF C4. PIA Oh my god! NYLES It’s okay, I used to be a bomb guy. Nyles takes an arrow and STABS it into the C4, cocks the crossbow, and FIRES it into the air -- It EXPLODES above the party, a bizarrely beautiful fireworks display, interrupted by -- SARAH, riding up on a motorcycle. She stops by the pool. TREVOR Hey, that’s my motorcycle -- SARAH (to Nyles) You son of a bitch! You ruined my plan to kill everyone! NYLES Sarah! The sister of the bride! I should’ve known it was you! (MORE)  57.",
      "characters": [],
      "action_text": "(then)  Howard, I’ll take her alive, if it’s the last thing I do.  HOWARD  Son, please, put the weapon down -- Sarah TACKLES Nyles into the pool --  INT. SMALL PROP PLANE - CARGO HOLD - DAY  Nyles (helmet and goggles on) feigns a confident smile and thumbs up to Sarah as he’s led to the open door by his tandem skydiving INSTRUCTOR -- Sarah pushes by and leaps OUT of the plane, without her parachute, turning back at Nyles with two middle fingers -- INSTRUCTOR NO NO NO NO NO!!!  EXT. OPEN DESERT - DAY  Wide shot, brutal sun, clear blue sky, A FIGURE rockets TOWARD the Earth -- it’s SARAH -- in FREEFALL, dive-bombing -- THUMP!!! A mini mushroom cloud where she hits the ground.  ON THE GROUND - LATER  Nyles and the instructor hurry out of the prop plane -- Nyles laughs maniacally while the instructor frantically sprints to Sarah’s body. The instructor checks her pulse, then looks back to Nyles, still laughing as he marches INTO THE PROPELLER --  INT. CALMADA ESTATE - NYLES AND MISTY’S BEDROOM - MORNING  Nyles wakes up, looks at the empty space next to him in bed.  INT. CALMADA ESTATE - BEDROOM - MORNING  Sarah wakes up, looks at the empty space next to her in bed.  INT. ROADSIDE BIKER BAR - NIGHT  Nyles, giddy with excitement, leads a blindfolded Sarah into the bar... He takes off her blindfold to REVEAL: The entire bar is filled with decorations -- STREAMERS, BALLOONS, and giant ‘HAPPY MILLIONTH BIRTHDAY, SARAH’ sign. The unenthused BARFLIES all wear PARTY HATS, Darla claps -- Sarah covers her smile, truly touched and surprised -- NYLES (CONT'D)  58. SARAH Have I really been here that long? NYLES You’re asking the wrong guy -- Nyles lifts up a CONFETTI CANNON and blasts her face --  INT. HOTEL ROOM - NIGHT  Nyles, Sarah, and five other DESERT HIPSTERS party -- drinking, dancing, snorting blow. A couple of them make out.  LATER  Everyone is passed out. Four packed on the bed, including Sarah, eyes closed, nuzzling into Nyles’ arm. ON NYLES’ FACE, watching Sarah fall asl",
      "dialogue_count": 0,
      "word_count": 1743
    },
    {
      "scene_number": 10,
      "slugline": "INT. CALMADA ESTATE - HALLWAY - MORNING  Sarah walks through the house to wake up Nyles, but she stops at the BRIDAL SUITE. The door is ajar. She peeks INSIDE: Tala sips on a mimosa while Erin does her hair, both smiling. Sarah watches, longing for this happiness she can never share with her sister. PRE-LAP: The sound of a beer can opening.  INT. SARAH'S CAR - DRIVING - DAY  Sarah sips her beer, driving. In the passenger seat, Nyles has a fresh glow and a twinkle in his eyes. NYLES I gotta say, I felt different this morning. Like... goooooood. In a good way though, ya know? Sarah’s off in another world. NYLES Because of last night? SARAH Oh. Yeah. She glances in the rearview mirror, noticing a dark car a ways back. Is this guy following her? NYLES Is that a “Yeah” of regret? Or...? SARAH Yeah, it was fun. Tension relief. It’s fun to relieve tension. She’s still looking at this car. It’s a little closer now. Close enough to see that it’s a POLICE CAR. Nyles doesn’t notice, more concerned by her response. NYLES Should we talk about it? SARAH What’s to talk about, it’s all meaningless, and technically that happened tonight. 65.",
      "characters": [],
      "action_text": "Nyles sits back, put off by the cold turn she’s taken. Sarah throws her beer out the window, and checks the mirror for the cop’s reaction. NYLES So we’re littering now? SARAH (re: the cop) Nothing still, Jesus. This cop’s been following us for miles. What’s this fucker’s deal? Sarah presses the gas to pick up speed. 90mph and climbing. NYLES Are you trying to get pulled over? ON NYLES... thinking... he turns around and squints at the cop car, still following at the same distance. Nyles seems to be piecing something together in his head... 100mph. The cop turns the sirens on. SARAH Finally! Sarah starts slowing down. NYLES What are you doing? SARAH Believe it or not I’ve never been arrested before. Curious to see what it’s all about. Nyles looks back one more time. His eyes go wide. NYLES No. Dead serious, he slouches in his seat, out of view. NYLES I think it’s him. SARAH Him? NYLES Roy. 66. SARAH Oh! That fucker. Sarah screeches to a halt. The cop car stops right behind. We only see the cop’s silhouette, his sheriff’s hat... NYLES Keep driving. SARAH No way. If you aren’t going to deal with him, someone has to. Sarah gets out of the car and throws her arms up -- SARAH Help! He’s trying to kill me! Sarah runs back toward the cop car as Nyles sinks deeper into his seat --   what the hell is she doing?  NYLES’ POV: Sarah reaches the cop car, frantically shouting. COP’S VOICE (O.S.) (on the microphone) Sir, step out of the vehicle! Nyles freezes.   Maybe it isn’t Roy. Now what?  COP’S VOICE   (O.S.) (on the microphone) If you don’t step out, I have no choice but to remove you by force. Nyles peeks back again: the cop slowly approaches Sarah’s car. Still backlit, but it doesn’t look like Roy. This guy has a mustache. Nyles breathes a sigh of relief. NYLES Okay! I’m coming out! Nyles opens the door, puts his hands up, still holding his beer, and slowly stands, his back to the officer. NYLES Sorry Mr. Policeman, I thought you were someone else. COP Oh yeah, who’s that? Ny",
      "dialogue_count": 0,
      "word_count": 6732
    },
    {
      "scene_number": 11,
      "slugline": "INT. BRIDAL SUITE BATHROOM - DAY  TIGHT ON Sarah as she explains her theory to Nyles. SARAH ... all lying entirely within a Cauchy horizon, and though the chronology protection hypothesis and quantum fluctuations theoretically don’t allow for traveling back in time, it really comes down to nature always inhibiting us. So, the general consensus is eradicate the energy source and all should reset.  She looks at Nyles, preoccupied and clearly not following. SARAH Nature prevents time travel. The earthquake broke nature. NYLES (unconvincing) Right. I hear that. SARAH No, listen, this is serious. Sarah leans forward and grabs her PURSE from the vanity -- ERIN (O.S.) Please, don’t move -- WIDE TO REVEAL: Erin, thoroughly annoyed as she tries to do Sarah’s hair for the wedding. ERIN I don’t know what you’re talking about, but we only have half an hour until photos and I still need to get ready. SARAH Then get ready. I’ll finish up. Erin puts her hands up, glad to be done, and leaves. Sarah takes out LIPSTICK and draws a DIAGRAM on the mirror, starting with a LONG TUBE -- 98.",
      "characters": [],
      "action_text": "SARAH This is the cave. It’s also life, birth and death, our consciousness, the timeline we all live on, but it’s simpler to think of it solely as the cave. We enter here -- She circles the left entry -- SARAH -- and what’s supposed to happen in life is we just walk through this tube to the other end, continuing on this regular timeline. But, much like an earthquake can break pipes underground, it broke   our   pipe. She circles a section of the tube -- SARAH This is the part where it all turns orange, where we’re sucked in. For exactly 3.2 seconds we lose control of our bodies, and what’s happening is we’re being sucked down into this fissure caused by the earthquake, back to the moment we wake up. Sarah draws a line down from the fissure, back to the start. NYLES (trying to follow) Okay... I really missed you. SARAH Nyles, focus. It’s really not that hard to understand. Here -- (circling the fissure again) This is a highly concentrated energy source. Remember, you said it yourself. Energy Is Everything. We’re trapped in a box of energy. Sarah draws a BOX around the entire graphic. SARAH That’s all this day is. A box of energy. (pointing to the fissure) We destroy the energy source in that 3.2 second window, we break the box. At least I think. Sarah goes back to applying her make-up, pleased with herself. 99. NYLES And then what, there’s like more boxes outside the box? SARAH I don’t know, maybe we wake up and it’s today, maybe it’s twenty years from now, or we’re dead under a pile of rocks. I can’t be sure of any of it, that’s why it’s a theory. But we have to try. Sarah’s making somewhat of a convincing argument, but Nyles remains skeptical. NYLES Okay. And by “break the box,” you mean...? SARAH We blow up ourselves   and   the cave in that 3.2 second window. Then we’re out. Sarah moves onto her mascara, so confident in her plan. NYLES I dunno, I mean, we’ve killed ourselves so many times already and we’re still here, in “this box,” right? I mean, I don’t wanna s",
      "dialogue_count": 0,
      "word_count": 1411
    },
    {
      "scene_number": 12,
      "slugline": "EXT. CALMADA ESTATE -   WEDDING CEREMONY AREA - SUNSET  MOS: Tala and Abe share their vows as family tears up. Sarah smiles, standing by Tala in full support. She glances out at the audience -- everyone falls for the love on display.  EXT. DIRT ROAD - SUNSET  Nyles turns up another dirt road, the sun descends below the mountains behind him -- and   THE EARTHQUAKE HITS . Nyles pauses for a moment. A thought crosses him, he looks west:   The cave is open. Maybe Sarah’s heading in.  He sighs, then keeps walking forth into the darkness. MISTY (PRE-LAP) And   Commitment   is “the state or quality of being dedicated to a cause, activity, etcetera.”  EXT. CALMADA ESTATE - BACKYARD - NIGHT  Misty looks out at the silent guests. TALA Woo-hoo! Tala and Abe stand and clap. Everyone else joins in applause. MISTY Without further ado, let me bring up the maid of honor, the   actual  big sister of the bride, Sarah. All eyes land on Sarah, seated across from Tala. She takes a breath... and heads onto the dance floor. She takes the mic -- SARAH Thanks Misty, that was great. Sarah looks directly at Tala throughout. SARAH Tala. My baby sister, Tala. What can I say that hasn’t been said? Heh... Even from this angle, I can see a very faint halo of light around your head -- hovering just above those angelic cheekbones. 105.",
      "characters": [],
      "action_text": "Tala’ cheekbones radiate. Sarah sighs to herself,   this is ridiculous...   But sees Tala beaming at her... and actually gets a little choked up.   What are these feelings I’m feeling?  SARAH This world is bizarre... things happen, life happens, and it’s easy to bear down and just go through the motions day after day, after day... But, my sweet little sis’, you are so open to the wonder of it all. You have this hopefulness that’s special and rare. Every morning you get up and you confidently charge forth toward the life you’ve dreamt up for yourself. Your joy,   this joyous energy , it’s contagious and it’s just...   FLASH TO:  SARAH AND NYLES  Staring at each other across the campfire -- NYLES ... Everything.   SARAH ... Everything. BACK TO:  SARAH - MID SPEECH  SARAH  ...   it’s   everything . Sarah pauses, struck by the warmth of this memory. She swallows her vulnerability, and looks back at Tala -- SARAH Big sisters are supposed to teach baby sisters, but I will today and forever, and ever and ever, be learning from you. The two sisters share a blissful, teary smile. SARAH So, now, Abe... Abe leans forward, expecting some kind words... SARAH You fucking hurt her and I’ll stab your little fucking dick with a fork, I swear to god. 106. Stunned reactions from the crowd. Sarah smiles, drops the mic, and walks off.   CUT TO:  INT. ROADSIDE BIKER BAR - NIGHT  Nyles sulks at the bar, swirling a glass of whiskey. PUSH IN on that empty mug of his... Until he DROPS his face down on the bar. As we first met him. Gram Parsons’ “Return of the Grievous Angel” plays throughout. Darla slides up and rubs his leg. Nyles shoots up. DARLA You okay, sweetheart? NYLES I've felt everything I'll ever feel so I'll never feel ever again. Darla looks to Ted the Bartender -- DARLA What’re you pouring this kid, Ted? TED THE BARTENDER That’s his first drink. NYLES I thought I knew how to live. But I didn’t. Or, I don’t? You know what I mean. DARLA Darlin’, take a look around: whatever you’re",
      "dialogue_count": 0,
      "word_count": 978
    },
    {
      "scene_number": 13,
      "slugline": "INT. SARAH'S CAR - NIGHT  Sarah drives her car along a rough dirt road, deeply focused --  INT. TED’S PICK-UP - NIGHT  Nyles presses down the gas -- SPEEDING DOWN THE HIGHWAY -- He CRACKS his nose back into place, then -- He hits a POTHOLE -- POP!!! -- he blows a tire -- -- and SKIDS TO A STOP on the shoulder. Nyles jumps out of the truck, checks the tire: torn to shreds and bent in on itself.  NYLES FUUUUCK! Nyles looks down the road -- and takes off RUNNING --  EXT. DESERT VALLEY - NIGHT  Sarah gets out of her car at the dead end of a dirt road. She pops the trunk and pulls out a DUFFEL BAG, throws it over her shoulder, and powers forth into the desert -- on a mission.  EXT. SPUDS' HOUSE - GUN RANGE - NIGHT  Spuds FIRES a shot at the Mustache Man target. As he nods with pride at his perfect shot -- NYLES (O.S.) Don’t shoot, Spuds! Spuds turns and aims the gun at this mysterious man running out of the darkness and into the flood lights -- a lunatic drenched in sweat, caked in dirt, and out of breath -- NYLES I need help! A ride... Anything... SPUDS Who the fuck are you? Spuds doesn’t flinch. Nyles plays his only card: 109.",
      "characters": [],
      "action_text": "NYLES Thirty years ago you met a woman named Tracy Holmes at a bar in Aberdeen, and after she popped your cherry in the little boy’s room, she left town and you never saw her again. Spuds’ hands tremble at the memory, still raw, while maintaining his aim. NYLES Spuds. I’m your son. Spuds sheds a tear. He lowers his gun, totally buying Nyles’ story. He walks up to Nyles and pulls him in for a tight hug. SPUDS I always had a feeling. Mid hug, Nyles glances at the GOAT PEN and considers checking to see if Sarah was telling truth, if the goat is really gone. But the clock's ticking. He gets out of the hug -- NYLES I love you, Dad. But I really need your help. The love of my life might be leaving forever. Spuds wipes his nose and looks at Nyles with fatherly eyes.  EXT. DESERT HILLSIDE - NIGHT  THE CAVE. Open and ready. SARAH. Calm. Resolute. She stands just beyond the mouth, staring at it. She takes a deep breath and pulls on a VEST LINED WITH C4. She walks toward the cave. Just as she’s about to cross the threshold -- NYLES (O.S.) Wait!!! Sarah!!! Sarah turns to see a DIRT BIKE weaving through the valley, Spuds is driving, Nyles holds on tight to his waist. Spuds skids to a stop. Nyles jumps off and runs toward Sarah. SARAH  Goddamnit . What is it, Nyles? 110. NYLES I blew it again! You were right, I was scared, but I’m not anymore! We’re all lost, but somehow we found each other. And yes, I’m quoting myself, but I hope you can look past that, because I know you feel it, too. SARAH You don’t know what I feel. You don’t know me. NYLES But maybe I do! (composes himself) Sarah, from the moment I saw you -- SARAH I don’t want another one of your fucking speeches, Nyles... She looks toward the cave. SARAH You get one more sentence. NYLES Okay, okay, okay -- Nyles thinks for a moment... NYLES Even though I pretend not to be, I’ve realized I’m completely co- dependent, but now I’m cool with it because life is meant to be shared...   semi-colon ...   I   need   you  for surviv",
      "dialogue_count": 0,
      "word_count": 1450
    }
  ]
}