{
  "slug": "papillon-2017",
  "title": "papillon",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 14,
  "characters_count": 0,
  "characters": [],
  "total_words": 34163,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. JEWELRY STORE SAFE ROOM - NIGHT  A darkened room -- the light in the hallway illuminates the crack under the door.   The sound of a man’s approaching footsteps -- his shadow cuts the light under the door -- a scratching sound; he’s working the lock -- The lock pops -- A YOUNG MAN slips inside and closes the door.   He then pushes a nearby desk over, blocks the door... He beelines for the window, and as he peers outside, the red glow of Montmartre at night momentarily illuminates him... tough, wiry -- wears a slick pinstripe suit -- eyes seem to sparkle and threaten at the same time.   This is PAPILLON. Papi’s POV -- looking down on Montmartre -- just one floor up -- denizens of the night coming and going on the sidewalk below.   SUPER --   Montmartre, Paris   --   March 26, 1930  Papi clocks the awning under the window -- sees he can use it to climb down to the street.   His escape route now determined, he closes the blinds -- the room goes dark -- Papi starts humming Franz Lehár’s “The Merry Widow” as he turns on a flashlight, shines it around, illuminating -- A desk with a typewriter on it, stored mannequin hands for displaying jewelry, a fireplace, a large mirror... He walks up to the mirror, takes it down -- raps his knuckles against the wall -- trying different spots.   Then after a moment he stops, shakes his head... He scans the room again...lingers on the fireplace -- considering.   He crouches down, shines his flashlight inside the firebox...staring at the back wall of bricks... Papi reaches into the fireplace -- raps his knuckles against the bricks -- hears a hollow reverberation... He reaches both hands inside, finds a seam -- the back wall of bricks is a false wall --   a removable panel ... He pulls the panel off, revealing a hidden compartment obscured in darkness... Papi grabs the desk chair, drags it over, then sets the flashlight on the seat so it shines into the darkened compartment...illuminating a big, black Diebold safe. Papi examines the safe...admiring its construction.   After a moment he places his hand on the combination dial...",
      "characters": [],
      "action_text": "He closes his eyes, continuing to hum “The Merry Widow” as he starts slowly turning the dial.   After a few rotations his hand goes still and he mutters: PAPILLON One. He starts up again, working the dial -- eyes dancing under closed lids when   he hears footsteps in the hallway .   Shit.  He opens his eyes, looks to the door...the footsteps stop. He waits, tensing -- when they start up again...recede... Papi closes his eyes, recommences turning the dial...slowing; the movement almost imperceptible now...he stops... PAPILLON (CONT’D) Two. He switches to his left hand -- rubs the tips of his fingers together, then starts spinning the dial quickly -- stops, rolls it back a few degrees...hears a tumbling sound... Papi smiles -- grabs the bolt handle -- PAPILLON (CONT’D) Three -- He yanks down the bolt handle, CHACHUNK, opens the safe door. Papi shines the flashlight inside the safe -- scans the velvet shelves full of jewelry and cash.   He zeros in on some uncut diamonds.   He starts to reach inside when he hears something --   more footsteps -- voices : VOICE 1 (O.S.)  There’s someone in there --  He looks over to see the doorknob turning -- the desk that’s blocking the door starting to shift -- VOICE 2 (O.S.) (to Voice 1)  Go call the police -- hurry!  Papi grabs the diamonds -- pulls an empty aspirin tube from his pocket, drops them inside.   Then he grabs a small wad of cash -- lifts up his shirt -- slips it into a hidden pocket sewed inside his belt -- The desk legs start squealing on the floor as whoever’s in the hallway starts forcing it open --  2. Papi heads for the window -- stops -- something occurs to him.   He rushes back to the safe.   Grabs a diamond necklace --  EXT. SIDE STREET - MONTMARTRE - CONTINUOUS  Papi climbs out the window -- hangs off the awning -- then drops, landing on his feet in front of the Jewelry shop’s closed storefront.   A figure appears in the open window, peering down at the street as -- Papi blends into pedestrian traffic -- walki",
      "dialogue_count": 0,
      "word_count": 6141
    },
    {
      "scene_number": 2,
      "slugline": "INT. BRIG - LA MARTINIERE - NIGHT  Papi lies contorted on the floor, hog tied with thumb and shin screws -- agonizingly painful restraints/torture devices.   He’s pushing around a big hunk of bread with his nose -- trying like hell to sink his teeth into it -- but without his hands it’s impossible. He hears the door unlocking -- can’t maneuver himself to see who’s coming in -- hears the guard talking to someone -- GUARD (O.S.) You have five minutes. Papi’s POV -- the sound of the door closing, someone’s scuffling feet as they walk around to where he can see them. It’s Dega.   He gives Papi a smile -- Papi doesn’t return it -- DEGA I’m a little worried about your ability to protect me right now. PAPILLON I think what you’re trying to say is thank you. DEGA They plan to keep you down here for the rest of the voyage. PAPILLON Anybody messed with you since I took down the trusty? DEGA No.   They seem afraid to go near me. PAPILLON That’s because they are.   So don’t worry about it.   The deal was to keep you safe -- you’re safe. Papi motions to the bread with his head -- PAPILLON (CONT’D) Help me out, will ya -- DEGA Feeding you wasn’t part of the bargain.  24.",
      "characters": [],
      "action_text": "PAPILLON If I starve, those guys are going to be a lot less afraid of you. Dega sighs -- starts breaking up the rock hard bread, hand feeding it to Papillon who gobbles it down -- Dega wipes some sweat from his brow... DEGA This heat...   We must be getting close -- Papi grunts impatiently, noses the loaf of bread -- PAPILLON (while chewing) More -- Dega begrudgingly continues hand feeding Papi --  EXT. LA MARTINIERE - DAY  The ship approaches the jungle choked shoreline of Saint Laurent -- a border town in South America’s French Guiana.  INT. BRIG - LA MARTINIERE - DAY  Guards lift up a limp Papillon, begin removing his thumb and shin screws -- he’s in agony.   Outside the port window he sees lush green, birds flying into the air as the ship sounds three wails of its SIREN --  INT. UPPER DECK - LA MARTINIERE - CONTINUOUS  Struggling to move his arms after having spent days in the thumb screws -- Papi and the rest of cage 1 emerge from below deck into the glare of a fiery, sweltering sun... Papi gets in line behind Dega, Julot and Lariot.   He looks out at the coastline as the ship enters an estuary leading into the Maroni river.   Dega notices Papi rubbing his numbed arms; trying to regain feeling in them -- DEGA (to Papi) Please tell me you can move your arms.   You need to ensure we’re not separated. Papi doesn’t answer --  25. DEGA (CONT’D) Did you hear me? PAPILLON You know I bet you’re not the only rich guy who needs protecting around here -- Papi trails off, notices a skiff following alongside the boat now -- three armed men inside.   MANHUNTERS.   The leader is a white guy in his 60’s -- has a dotted line tattooed around his neck with instructions “Cut on the dotted line.”   The other two are black and Chinese respectively. PAPILLON (CONT’D) What are they doing? LARIOT Learning our faces -- so they can better hunt us if we try and escape.   They’re manhunters -- former convicts. DEGA Ex-convicts hunting convicts.   Very efficient model. Papi spits off the bo",
      "dialogue_count": 0,
      "word_count": 1480
    },
    {
      "scene_number": 3,
      "slugline": "EXT. TOWN - EN ROUTE TO PRISON - DAY  Papi’s POV as he carries Lariot’s body with Dega down a surreal, sun baked main street -- distorted piano music reverberates from a loudspeaker, locals draw their curtains as the parade of exiles approaches -- Dega keeps slowing, struggling to hold up his side of Lariot’s body -- Papi compensating, getting frustrated -- PAPILLON Come on, you’re stronger than that. DEGA I’m not -- I swear -- Papi’s POV as they pass a chapel -- locals singing hymns inside.   Then he sees a bedraggled French ex-con walking an oxen hitched to a wagon full of buckets of sewage.   Another French ex-con sifting through garbage -- Then like some kind of mirage Papi spots a pretty French whore, dressed in the height of Paris fashion -- she’s standing in the doorway of a whorehouse run by ex-cons, nodding familiarly to the passing guards -- A guard shoves Dega in the back with the butt of his rifle -- GUARD Hurry up -- that stiff is already starting to smell. Papi, Dega and the half a dozen other cons tasked with carrying bodies are corralled into the town cemetery, while the rest of the prisoners are marched through the main gate into the prison --  EXT. TOWN CEMETERY - DAY  Papi and Dega carry the corpse into the small cemetery, populated with crude, crumbling headstones... GUARD No no -- that’s for real people -- the prisoners’ corner is over there. Papi and Dega are lead to the outskirts of the cemetery -- Papi doing the lion’s share of the lifting, Dega on the verge of passing out as they move into a snake infested thicket, where a lime coated pit awaits...  30.",
      "characters": [],
      "action_text": "There are already two headless bodies sprawled in the pit. Papi and Dega drop Lariot -- he lands with a CRUNCH on top of the other bodies. Papi and Dega drop to their knees, struggling to catch their breath as they stare down at their own possible futures...  EXT. ST LAURANT PRISON COURTYARD - DAY  The two guards lead Papi and Dega through the arched entrance of a thick wooden gate -- where they join the ranks of a couple hundred prisoners now lined up in the courtyard... Papi clocks THE GUILLOTINE standing in the center of the courtyard -- two cons scrubbing the blood stained chopping block with coarse brushes. A prisoner faints from sunstroke -- a guard rushes over, kicks him in the stomach -- GUARD Get up!   On your feet! The man starts to get to his feet, coughing blood now -- another prisoner across the way collapses and gets the same -- Papi watches as Warden Barrot prepares to address the prisoners, the guillotine looming behind him. WARDEN BARROT (to convict) You there, pass out the hats -- A convict starts passing out straw hats -- drops one on top of the collapsed convict.   Papi and Dega are each handed a hat, they both put them on -- WARDEN BARROT (CONT’D) You may notice some of your comrades have failed to survive their time at sea.   This is for the best -- as this is not a place for the weak.   I know there are many who at this very moment are thinking about escape.   Well, you are free to try whenever you like. We are happy to shoot you.   But should you avoid that mercy, there are two guardians, who are always on duty.   On one side there’s the bush -- where the best you can hope for is starvation -- unless you’re willing to eat your comrades. (MORE)  31. And indeed I’m sure many of you are.   Or, you may choose the sea. The sharks too, I assure you, are always hungry.   Those who manage to survive the first escape will get two years in seclusion. Second attempt -- five years in seclusion. There has never been a third attempt.   If you commit murder",
      "dialogue_count": 0,
      "word_count": 1876
    },
    {
      "scene_number": 4,
      "slugline": "INT. BARRACKS - MORNING  Papi’s POV as he wakes up, his eyes slowly focusing as he raises his head up and peers around -- a convict masturbating across the aisle, another staring, unmoving -- looks dead... Papi then looks over at a still sleeping Dega... there’s something on his arm.   A vampire bat, quietly sucking blood --  Papi starts to move when CLANG -- his ankle is shackled to that long pipe.   Every night the cons are shackled to their beat-flanks before lights out.   Papi smacks the bat -- it flies off.   Dega wakes up -- looks at Papi accusingly -- DEGA Did you just hit me? Dega looks down, sees a nasty bite wound on his arm -- DEGA (CONT’D) Dear God -- Papi points to a bunch of bats hanging off the ceiling.   They scatter suddenly --   spooked by distant gunshots.  Papi exchanges a look with Dega as more shots start waking up the barracks -- he hears Sierra talking to a guard outside: SIERRA (O.S.) Which barracks? GUARD 2 (O.S.) No, he broke out of the hospital -- just one I think. Papillon’s eyes light up, he grins and turns to Dega -- PAPILLON I bet it’s Julot -- son of a bitch didn’t waste any time.   See --   it can   be done. Dega smiles weakly, gripping his now swelling bat bite -- Papi slaps him on the shoulder --  INT. MEDICAL INSPECTION LINE - INTAKE CENTER - DAY  Papi and Dega stand in line, waiting to get their physical inspection.   Papi looks around -- disturbed by the condition of most of the convicts; unlike the strong and healthy cons that made up the medical inspection line in France, these men look like the walking dead.  37.",
      "characters": [],
      "action_text": "Papi and Dega watch as a CONVICT steps up to the doctor, his body is covered with sores, bleary eyed. DOCTOR Open your mouth, stick out your tongue -- The Convict obeys -- only a few teeth left in his mouth -- DOCTOR (CONT’D) Approved for work. He stamps the convict’s paperwork -- DOCTOR (CONT’D) Next -- CONVICT 2 steps up -- holds his arm out for the doctor to see -- looks badly infected, some filthy bandages hanging off it. DOCTOR (CONT’D) Get a new dressing on this. Some hope starts to brighten Convict 2’s expression -- DOCTOR (CONT’D) Then report to work. Convict 2’s expression darkens, he shuffles off.   Dega shuffles up to the Doctor -- DOCTOR (CONT’D) Open your mouth and stick out your tongue -- Dega obeys. DOCTOR (CONT’D) You have good teeth.   Appear to be in excellent health. Dega shakes his head -- not pleased, tries to show the doctor his swollen bat bite -- DEGA I assure you that’s not the case. As you can see I’ve been mauled by a flying rat -- DOCTOR Next -- Dega sees the guard getting ready to shove him -- moves. Papi steps up to the Doctor --  38. DOCTOR (CONT’D) Open your mouth and stick out -- PAPILLON Fuck you. The Doctor looks up at Papi wearily, sighs -- DOCTOR Approved for work -- The Doctor stamps Papi’s paperwork -- PAPILLON Who   isn’t   approved for work? DOCTOR Next -- PAPILLON You call yourself a doctor? DOCTOR Who said I was a doctor? A guard grabs a disgusted Papi and shoves him towards the next station --  INT. WORK DETAIL LINE - INTAKE CENTER - DAY  Papi stands behind Dega, who’s standing before Bartiloni -- the guard Sierra paid off.   Bartiloni is checking paperwork -- DEGA My friend and I need to be kept together.   Now, I’m most useful in matters of accounting, book keeping -- a pen is the heaviest thing I should be lifting -- Dega trails off as the Deputy Warden walks up on him...gives him a long look, seems to recognize him... DEPUTY WARDEN I know you.   Do you know me? Papi is watching on, not sure what to make of this. DEGA Y",
      "dialogue_count": 0,
      "word_count": 1136
    },
    {
      "scene_number": 5,
      "slugline": "EXT. ANOTHER SECTION OF ROUTE ZERO - DAY  The rain has stopped.   It’s the sun that tortures Papi, Dega and Clousiot now -- baking their shaved heads while they sit in the mud -- too exhausted to swat the insects crawling over their skin -- their eyes all focused on the convict pouring out the water rations, slowly making his way down the line... Meanwhile Santini and the guards sit under a mosquito net, protected from the bugs, eating their lunch -- Back to Papi cupping his hands together, holding them out to receive his water ration.   The convict pours the water -- most of it leaks between Papi’s fingers as he rushes to bring it to his cracked lips. Papi licks the moisture off his palms, then looks over at the con next to Clousiot, who doesn’t bother holding his hands up, the convict giving out the water passes him by -- Papi notices the guy isn’t moving, his face is grey -- PAPILLON Jesus, he’s dead. DEGA Guard -- Clousiot nudges Dega with his arm -- CLOUSIOT Don’t let’em know yet -- Clousiot holds up a piece of stale bread -- CLOUSIOT (CONT’D) We’ll eat his rations first. Clousiot breaks the bread, hands pieces to Papi and Dega -- then reaches into the dead man’s pockets... CLOUSIOT (CONT’D) He’s got some malaria pills -- Clousiot hands Dega and Papi two pills each -- they gobble them down. PAPILLON You don’t want any? CLOUSIOT Nah.   They give you a headache, make you throw up.   Not much better than malaria.  42.",
      "characters": [],
      "action_text": "Papi and Dega sigh, exchange a look.   Papi notices an anchor tattooed on Clousiot’s forearm. PAPILLON You were in the Navy? CLOUSIOT Yeah, I was in the Navy, mec.   You want to go sailing with me?   Been here almost a year and I’m crazy to get going.   You take me along, mecs won’t fool with you -- I’m a volcano, you understand -- Papi looks dubious. CLOUSIOT (CONT’D) I killed a stool pigeon in Toulouse with my bare hands -- PAPILLON Keep your voice down. A wrinkled old con sitting across from them named CARORA overhears -- CARORA (to Clousiot) A cavale man, eh?   You need money? I’ll give you my last twenty francs if you kill me in my sleep tonight. Papi tell by Carora’s broken expression that he means it. Clousiot scoffs -- CLOUSIOT For twenty francs?   Not worth the effort. A wild eyed, heavily tattooed convict suddenly pipes up -- WILD-EYED CONVICT (to Carora) I’ll kill you, mec. PAPILLON (to Carora) Save your money, old man. CARORA (to Papi) I escaped once.   There’s nowhere to go.   Nobody wants France’s trash --  43. Someone starts SCREAMING across the way.   Papi gets to his feet -- SEES A JAGUAR MAULING A CONVICT -- BANG -- a bullet whizzes past -- Papi, Clousot and Dega hit the dirt.   Papi sees it’s Santini, walking up behind them firing his rifle -- BANG, BANG -- until the din of screaming and growling stops... Papi looks over to see Santini lowering his smoking rile -- both the jaguar and the convict shot dead... CARORA (CONT’D) (re: jaguar and the con) The lucky bastards.  EXT. TRAIL TO PRISON - DUSK - RAIN  Headed back to the penitentiary now, Papi and Dega -- both caked with mud and looking half dead from exhaustion -- stand on a platform with wheels, pushing off with long poles -- propelling it along the train tracks.   It looks like they’re rowing a gondola.   Papi is doing most of the work -- Dega can barely stand at this point, Papi keeps having to steady him -- PAPILLON Easy now -- we’re almost there. Angle widens as the cart squeals over the t",
      "dialogue_count": 0,
      "word_count": 4812
    },
    {
      "scene_number": 6,
      "slugline": "INT. SOLITARY ROW - CONTINUOUS  On Papi’s left and right are a whole multitude of heads.   A con with barber shears is making his way down the line -- snipping their greasy locks, while two guards drag a convict’s skeletal corpse from his now vacant cell -- Papi looks to the blank idiot face of his neighbor on the right...then turns and looks to his neighbor on the left.   An older guy who gives him a toothless smile... OLD GUY How do I look? Papi considers, then: PAPILLON You look great.  INT. SOLITARY CELL - DAY  Papi is pacing when he hears the Sweeper outside his door -- he stops, his expectant eyes go to the wicket -- it opens...the Sweeper starts to push the bucket inside when -- FAT GUARD (O.S.) Hold on -- need to check that -- Papi’s eyes go wide as the bucket is yanked back out...the sound of the Fat Guard dumping it out on the floor...the Skinny Guard’s footsteps as he walks up on them -- SKINNY GUARD (O.S.) (yelling down the hall) Get the Warden! FAT GUARD (O.S.) (to the Sweeper) Who put you up to this -- SWEEPER (O.S.) I don’t know his name, we never met -- I just took the money -- CRACK -- Papi listens, face racked with tension -- as the two guards start mercilessly beating the now screaming Sweeper -- SKINNY GUARD (O.S.) Don’t lie to us -- The sound of the Sweeper hitting the ground -- the guards stomping him -- bones cracking...the screaming stops.   The sound of more guards rushing down the corridor --  60.",
      "characters": [],
      "action_text": "SKINNY GUARD (O.S.) (CONT’D) (to the Fat Guard) Shit, I think you killed him -- Papi’s eyes swell with horror as he clocks the Sweeper’s blood flowing under the door.   He steps back, grabs his mug, brandishing it -- ready to fight. Papi’s hazy POV as the door is unlocked with a CLANG -- it swings open -- revealing Barrot, flanked by six armed guards. PAPILLON Just try something you shitheads! WARDEN BARROT Calm down.   I just want to talk. PAPILLON I’m not allowed to talk. WARDEN BARROT For the next few minutes you may speak freely. PAPILLON Whose word do I have? WARDEN BARROT Mine. PAPILLON What the fuck is that worth? Barrot doesn’t answer, calmly looks Papi over... WARDEN BARROT No wonder you haven’t broken.   How long has this been going on? (re: the dead sweeper) I’m quite sure this simpleton wasn’t working alone -- who put him up to it? Papi stares blankly...shakes his head... PAPILLON I don’t know what you’re talking about.   I eat the same shit as everyone else. Barrot gives Papi a pitying look...  61. WARDEN BARROT Well, until you fess up you’ll be eating a lot less shit than everybody else...and in darkness. One of the guards quietly shuts the door.   Papi hears a dragging sound coming from above.   He looks up, sees the guards covering his barred roof with plywood... PAPILLON You’re going to miss half the show if you do that -- Papi watches the striped light on the floor get smaller and smaller until there’s only darkness...  INT. CLERK’S OFFICE - DAY  Dega sits at a little desk piled with ledgers and official documents, looking clean, rested and healthy.   He dips his pen in an ink well, working on something -- closer -- we see it’s a note to Papi:   Only one more year   -- He hears someone at the door, quickly covers the note with a ledger book as Warden Barrot’s wife walks in -- WARDEN BARROT’S WIFE Clerk, I need fifty francs.   My vocal coach is refusing to accept any more credit. DEGA I’m afraid you’ve exhausted your budget for the month, Mademoisel",
      "dialogue_count": 0,
      "word_count": 4840
    },
    {
      "scene_number": 7,
      "slugline": "EXT. COURTYARD - CONTINUOUS  Dega keeps shooting anxious glances at the prison wall by the hospital.   He looks over at the Warden -- DEGA Do you need your drink refilled, Warden? The Warden nods.   Dega starts for the bar --  INT. DOOR - HOSPITAL - CONTINUOUS  Papi tries key after key, Clousiot and Maturette watching on, panic wrenching their sweating faces...  EXT. PRISON ELECTRIC STATION - CONTINUOUS  A locked cage enclosing a vine covered electrical station outside the prison wall.   Someone unlocks the cage -- angle widens to reveal it’s Sierra the turn key. Sierra slips inside, checks his watch -- looks up at the transformers -- he’s going to have to climb part of the support structure to reach them. He hears voices -- ducks down behind the electrical equipment.   He sees two guards sneaking a smoke break, bitching about Mrs. Barrot’s singing -- GUARD (re: Mrs. Barrot’s voice) Rather stick a bayonet in my ear than listen to this shit.  EXT. COURTYARD - CONTINUOUS  An orderly who’s manning the make-shift bar hands Dega some rum on the rocks.   Dega shakes his head -- points at something -- DEGA It’s for the Warden. The Orderly hands Dega the whole bottle of rum.   Dega starts back towards the stage, sneaks a pull off the rum -- peers up at the lights shining down into the courtyard, then checks his watch -- from his expression we gather Sierra is late --  80.",
      "characters": [],
      "action_text": "Dega turns and looks at the hospital’s side entrance -- sees a jalopy supply truck rolling up -- it stops a few feet from the entrance...  INT. DOOR - HOSPITAL - CONTINUOUS  Papi inserts a key -- CLICK -- he breathes out, looks to Maturette and Clousiot -- nods, then starts opening the heavy iron door...stops, sees the lights in the courtyard are on -- PAPILLON Shit -- the lights are still on. Papi then turns to see that supply truck is idling a few feet away -- a CONVICT unloading crates of medical supplies -- two guards armed with machine guns in the flatbed, monitoring... Papi closes the door.   Clousiot and Maturette give him a   what the hell are we going to do now   look.   A knock -- CONVICT (O.S.) You got supplies out here -- PAPILLON Just a minute -- Papi motions for Clousiot -- who’s now wearing a guard’s uniform -- to go to the door. PAPILLON (CONT’D) (whispers) Open it -- Clousiot nods -- opens the door, avoiding the eyes of watching guards as the convict carries the crates inside, sets them down inside the door... The convict’s POV -- as he clocks the three undressed guards passed out on the floor, Papi and Maturette standing there. Papi looks the convict in the eyes, puts his finger to his lips...then presses some bills into his hand -- After a moment, the convict hides the bills in his pants, says nothing -- turns and heads back to the supply truck... Papi rushes up to Clousiot, watches as the truck putters off towards the next building.   He looks back at the watch, it’s now five minutes past midnight.   Clousiot and Maturette can tell by his expression that they’ve missed their window -- they look at him, terrified -- he steadies them with his gaze; unflagging confidence in his eyes...  81. PAPILLON (CONT’D) We’re going. CLOUSIOT What about the lights? PAPILLON We can’t wait any longer.   We can still make it.   Walk, don’t run --  EXT. COURTYARD - CONTINUOUS  Dega watches his friends silently emerging from the entrance. GUARD (O.S.) What are you do",
      "dialogue_count": 0,
      "word_count": 2925
    },
    {
      "scene_number": 8,
      "slugline": "EXT. MARONI RIVER - NIGHT  Papi, Dega and Clousiot ride in the Breton’s boat, everyone paddling but Dega, as it glides down the winding river.   Dega can’t help but stare at the Breton’s tattooed face... MASKED BRETON Something you want to ask me, mec? DEGA Pardon me, Mister Breton, but yes. You had mentioned the good news regarding this island.   Is there any bad? MASKED BRETON Pigeon Island is a leper colony for convicts -- two hundred murdering thieves with rotting flesh.   If they like you, they’ll sell you a boat.   If they don’t, they’ll kill you and take your money -- or worse -- infect you with their disease. Orderlies from the prison hospital drop supplies there once a week, but no guards ever go there. DEGA Seems like a smart a policy. MASKED BRETON Ha, life’s a bitch, huh.   One minute you’re drinking with a fine lady -- then boom -- you wake up in the fucking jungle with a cockroach on your forehead... DEGA I hope you don’t think me rude for asking this, but your face -- may I inquire why you... MASKED BRETON So mecs think I’m crazy -- don’t fuck with me. DEGA Ah...a clever disguise. MASKED BRETON I can’t go back to France.   But I want to see you bastards succeed. Papi, Dega and Clousiot are looking increasingly anxious --  91.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 229
    },
    {
      "scene_number": 9,
      "slugline": "EXT. SHORELINE - PIGEON ISLAND - NIGHT  Papi and Clousiot lay Dega down on the muddy shore as the Masked Breton starts pushing off in his boat -- PAPILLON Thank you.   I’ll give France your regards. The Breton smiles at Papillon’s confidence... MASKED BRETON Fuck France. Papi nods, seems to concur.   The three of them watch the Masked Breton paddle off into the darkness... Papi turns from the water...can make out some fire light flickering in the distance -- Papi hears Dega GASP   -- looks over to see a skittish looking dog has just emerged from the brush... DEGA Do dogs carry leprosy? Papi sighs.   The dog starts BARKING at them -- Papi turns to see figures moving in front of that distant firelight now -- alerted by the barking.   Dega and Clousiot are looking increasingly terrified... PAPILLON Stay here.   I’ll go make contact. CLOUSIOT You do that. Papi moves into the brush, heading for the flickering light -- the dog following after, almost herding him --  EXT. LEPER VILLAGE - PIGEON ISLAND - MOMENTS LATER  Papi steps into a clearing.   He sees a few straw huts across the way -- starts towards them   when he notices something burning in a trench   -- black smoke wafting up into the night. Then he clocks a wooden cross -- all these tattered prisoner identification papers nailed to it...he walks up on the trench -- sees blackened bones inside .   They burn their dead.  Papi covers his mouth as black smoke wafts in his face...  92.",
      "characters": [],
      "action_text": "He continues on, a clothesline blocking his path now -- all these stained clothes hanging, blowing in the wind.   Papi carefully ducks under the clothes, terrified of contagion -- LEPER WOMAN (O.S.) Who’s there? He turns to see a young woman washing clothes in a bucket. The dog rushes past him, goes to the woman and noses her. She peers around, but can’t find Papi in the darkness... Papi lights a cigarette to announce himself.   The woman starts to turn -- presenting a beautiful profile.   Papi starts slowly walking up on her... LEPER WOMAN (CONT’D) Approach gently, friend. She turns some more --   revealing half of her face has been eaten away.   Papi steadies himself, holds her stare... LEPER WOMAN (CONT’D) You here to rob us?   You think we’re too well off? PAPILLON I’m a friend of the Masked Breton. He told me you have a boat to sell. She considers him for a moment...takes a step closer, detecting the disturbance in his eyes... LEPER WOMAN Do you want to fuck me? Papi doesn’t move, holds her stare... PAPILLON If I could cure you first...I’d love nothing more. She frowns, looks him over for a moment, then motions for him to follow as she starts for the largest hut in the clearing.  INT. HUT - PIGEON ISLAND - CONTINUOUS  Papi’s POV as the leper woman shows him into a darkened hut -- she doesn’t follow him inside.   The only light is a little oil lamp sitting on a table -- six shadowy figures stand just beyond the light’s reach at the back of the hut... VOICE Have a seat.  93. Papi sits down at the illuminated table.   They can see him, but he can’t see them. PAPILLON I mean no disrespect.   But when I negotiate with someone, I like to look them in the eye. Then one of the men steps forward, sits down at the table across from Papillon. TOUSSAINT If you can -- please do... Papi manages to swallow his shock as he takes in the sight of TOUSSAINT, 40 -- no eyelid on his left eye -- nose completely eaten away; just a silver dollar-sized hole in the middle of his face.  ",
      "dialogue_count": 0,
      "word_count": 3755
    },
    {
      "scene_number": 10,
      "slugline": "EXT. BEACH - COLOMBIAN COAST - NIGHT  There’s conflict in Papi’s eyes as he stumbles on to the shore, gripping his wound, peering out at his friends...when he hears someone emerging from the brush -- Papi spins around, sees a Colombian policeman approaching, aiming a pistol at his head.   Papi freezes, nowhere to go -- COLOMBIAN POLICEMAN (yelling to his comrades)  Over here --  Suddenly someone runs up behind the policeman and headbutts him in the back of the head -- The policeman, dazed now, turns to fire on his attacker when Papi thinks fast and tackles the policeman -- Papi wrestles the gun away from the policeman, then pistol whips him unconscious.   Papi then scrambles to his feet and takes in his wild-eyed eyed savior: a panting Colombian man whose hands are shackled behind his back -- looks to have escaped from custody.   This is ANTONIO, 35. Antonio starts frantically trying in vain to remove the hand cuff keys from the policeman’s belt, but can’t manage it with his hands behind his back -- then: ANTONIO  If you get these off me, I can help you.  Papi gets what he’s proposing despite the language barrier -- the police boat’s spotlight about to illuminate them as -- Papi yanks the handcuff keys off the unconscious policeman’s belt.   He unlocks Antonio’s handcuffs just as the spotlight illuminates them -- Papi and Antonio sprint into the jungle -- the sound of police dogs barking, racing up the beach after them --  EXT. COLOMBIAN JUNGLE - NIGHT  Papi’s POV as he struggles to keep up with Antonio -- who’s now running in little leaps -- bounding through the jungle while his arms swing wildly -- a sort of skipping run which allows him to maintain a blistering pace --  108.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 298
    },
    {
      "scene_number": 11,
      "slugline": "EXT. COCA FIELD - MORNING  Papi stumbles across the wide expanse of a coca field -- watching as the unflagging Antonio gets further and further away.   Papi stops, grabs his knees -- sucking air -- He checks behind him -- can hear the distant barking of the police dogs getting louder -- still hasn’t lost them.   Then he turns to see Antonio rushing to pick some coca leaves... Antonio presents Papi with a handful of leaves -- then puts one in his own mouth to demonstrate; chews it -- gives Papi a smile, motions for him to do the same... Papi pops a leaf into his mouth, chews it, doesn’t look sure about the taste, but then as he grinds it between his teeth, a smile grows --   he’s suddenly infused with energy.  Antonio then shows Papi how to do the skipping leap.   Papi watches -- tries it himself.   He’s not bad. Antonio starts running again and now Papi is keeping pace -- looks to actually be enjoying the exsertion -- Papi is doing the skipping leap now -- his eyes wide and wild -- he lets out a laugh as they race across the vast field --  EXT. JUNGLE/MOUNTAIN TRAIL - DAY  Papi reaches into his pocket -- holds the two leaves he has left in his palm -- pops one into his mouth.   Angle widens as he starts moving -- he’s following Antonio up a narrow path now, trudging slowly uphill -- the chorus of animal sounds getting increasingly menacing... Papi’s POV as he starts noticing ominous fetishes dangling from the branches -- fashioned from animal and human bones. Antonio stops, crosses himself -- motions to the fetishes -- ANTONIO  Death awaits us here.   We should go around.  Papi considers as Antonio keeps insistently pointing in the opposite direction.   Papi shakes his head -- PAPILLON No, we should keep going this way -- maybe they’ll be afraid to follow us. Antonio gives Papi a pitying look -- then slaps him on the shoulder --  109.",
      "characters": [],
      "action_text": "ANTONIO  Good bye, my friend --  Papi stands there for a moment, watching as Antonio heads off in the other direction -- disappearing into the jungle... Alone now, Papi looks like he’s not sure he made the right decision.   He continues down the seemingly haunted trail -- now getting narrower, darker -- his eyes darting when -- Papi hears a dog barking in the near distance -- Antonio screaming --   sounds like the dog is mauling him.   Then a single gunshot...  Papi takes off running -- he veers off of the trail -- charges into the bush, smashing through the greenery -- until he suddenly loses his footing, stuck in something now -- He looks down, HE’S SINKING IN QUICKSAND.   He hears something running towards him, but he can’t get free -- A police dog explodes from the jungle -- barking in Papi’s face as three Colombian policeman emerge behind it.   The policemen watch as Papi continues to sink into the quicksand; doesn’t look like they have any plans to help him. Papi claws at branches -- ripping plants from the earth, trying to find something that will hold -- the amused policemen watching on, then -- The policemen’s expressions change -- one of them puts his hand to the back of his neck -- looks at his fingers, blood. Another looks down at his leg, there’s a dart sticking out of it -- more darts silently shooting through the air -- A dart hits Papi in the shoulder, another sticks in his neck. Papi watches as one of the policemen passes out from the dart’s toxin -- falls face first into the quicksand.   The other two collapse soon after -- the dog too... Papi starts to lose consciousness, submerged to his shoulders now -- the sand swallowing him up... Papi’s distorted POV -- he looks up to see three GUJIRO INDIAN WARRIORS approaching with blow guns -- naked but for loin cloths, faces smeared with chalky white. They lower their blow guns and peer down at him.   They seem to be marveling at the butterfly tattoo on his chest WHEN EVERYTHING GOES BLACK...  110.",
      "dialogue_count": 0,
      "word_count": 693
    },
    {
      "scene_number": 12,
      "slugline": "INT. LALI’S HUT - DAY  Papi’s hazy POV as he wakes up -- he’s lying on the sodden floor of a small hut made of brick red earth, staring up at the palm leaf ceiling, something fluttering around up there -- We’re reminded of the vampire bats flying around the barrack’s ceiling...then as Papi’s vision focuses, we see these are not bats, but BLUE MORPHUS BUTTERFLIES... Papi hears soft voices conferring in whispers.   He turns his head, sees two Gujiro Indian girls kneeling on either side of him.   Both are naked and beautiful, braided hair down to their hips.   This is LALI and her younger sister ZORAIMA. Papi looks like he’s died and gone to heaven. The sisters are cleaning the bullet wound on his shoulder, dabbing it with sea weed -- Lali leans in, her face almost touching Papi’s -- gives him a little bite on the corner of his mouth -- Zoraima caresses her finger over Papi’s tattoos, making its way down his stomach towards his crotch -- when a tall man enters the hut and peers down at Papi curiously... Only five teeth remain in the imposing man’s sunken mouth. This is the SORCERER.   Lali and Zoraima make possessive gestures towards Papi.   Note: italics denote Gujiro dialect: LALI  He is ours -- a gift from the jungle.  Papi’s POV -- he notices the butterfly is among the symbols ornamenting the Sorcerer’s scant clothing, looks to have spiritual significance to them.   The Sorcerer leans in to inspect Papi’s tattoo, admiring it -- The Sorcerer starts pantomiming something to Papi, pointing at Papi’s tattoo -- then at himself.   Papi nods along, agreeing, though to what he’s not exactly sure.   He forces a smile as the Sorcerer’s face lights up with excitement --  INT. SORCERER’S HUT - GUIJIRO VILLAGE - NIGHT  A twirling mirror hanging from a string -- Papi’s hand gently stops it, holds it still, we see his face reflected -- all anxious concentration -- Papi puts a coca leaf in his mouth, chewing as he angles the mirror so it reflects his butterfly tattoo, referencing it...  111.",
      "characters": [],
      "action_text": "Papi pricks the Sorcerer’s chest with three needles he’s tied together, affixed to the end of a stick -- while constantly referencing the mirror.   He’s a good two thirds of the way done with the tattoo -- but the quality of the work is obscured by a mess of blood and blue India ink -- Angle widens -- the Sorcerer is lying still as a statue, ramrod straight on the table, a cigar in his mouth -- smokes it from the embers side -- his eyes boring into Papi... Angle widens to reveal the hut is packed with increasingly impatient observers, Lali and Zoraima among them -- as are warriors with bow and arrows, as well as some sawed off shotguns, ready to dispatch Papi should he fuck this up. Papi’s hand slips -- his hand freezes -- strained eyes going wide as he rushes to correct his mistake -- One of the warriors leans in to take a closer look, senses Papi screwed something up -- PAPILLON Give me some room here, will ya -- The Sorcerer motions for the warriors to back up...   Papi sets down his stick-pin tool, starts dabbing at the Sorcerer’s chest with a cloth -- picks up a razor -- deepens some of the lines -- dabs it again, sets down the razor... PAPILLON (CONT’D) Alright.   You can look now. The Sorcerer sits up.   Papi angles the mirror so the Sorcerer can inspect the tattoo on his chest.   It’s almost identical to Papi’s -- only the colors are much more brilliant -- The Sorcerer stares into the mirror, evaluating Papi’s work while Papi crawls out of his skin waiting for a verdict... The Warriors draw back their bows, one of them racks his shotgun -- Lali and Zoraima look worried -- Then suddenly the Sorcerer breaks out in a wide smile -- hugs Papi tight -- the whole place breaks into celebration -- as the Sorcerer excitedly walks around showing off the tattoo. Papi looks like he’s ready to pass out.   The Sorcerer grabs him, puts a leather pouch in his hand -- SORCERER  For you.   For good work.  Papi accepts the pouch -- the Sorcerer motions for Papi to open it.   He",
      "dialogue_count": 0,
      "word_count": 5314
    },
    {
      "scene_number": 13,
      "slugline": "EXT. OCEAN - CONTINUOUS  From above we see Papi, a dot amidst the endless blue -- we move down on him as he peers up at the sky and yells to the heavens -- PAPILLON You won’t regret this, you son of a bitch! CUT TO: EXT. LANDING STRIP - NICE INTERNATIONAL AIRPORT - DAY Super --   1969   -- over an aged Papi, now 62 years old, wearing an overcoat and a fedora hat -- carrying a suitcase, making his way down the passenger stairs of a DC-9 -- VENEZUELA AIRLINES -- His feet touch down on French soil for the first time in almost forty years.   He looks down at his feet -- goes still for a moment -- wonder in his eyes -- other passengers shuffling past --  EXT. BOULEVARD DE CLICHY - DAY  Papi makes his way down the Boulevard, carrying his suitcase. He looks a little taken aback by how much the people and the various establishments lining the boulevard have changed   -- the psychedelic colors, the short skirts -- Then something stops him -- he sees someone he recognizes -- starts to follow him...  It’s   Dega .   Papi veers towards him -- when the man turns to face him -- it’s not Dega...   Papi’s expression darkens, the realization sinking in as he watches the man walk off... There are no more familiar faces.   The world has been marching on, despite his absence...  EXT. THE PALAIS DE JUSTICE DE LA SEINE - DAY  Papi walks up on The Palais De Justice De La Seine.   He stands at the entrance, sets the suitcase down...for a moment we’re reminded of his revenge fantasy and wonder if this suitcase is packed with dynamite... After a moment he picks it up, gives the courthouse one last look and walks off...  130.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 302
    },
    {
      "scene_number": 14,
      "slugline": "EXT. CAFE - PARIS - DAY  Book publisher JEAN-PIERRE CASTELNAU, 40s, sits in an outdoor cafe, sipping an espresso, the sound of a man playing an accordion across the way.   Jean-Pierre sees Papi walking up on him -- stands up excitedly -- offers his hand -- JEAN-PIERRE CASTELNAU You must be Papillon -- Papi nods, his expression guarded as he sets his suitcase down -- shakes Jean-Pierre’s hand -- JEAN-PIERRE CASTELNAU (CONT’D) Please sit -- Papi sits.   Jean-Pierre motions to the waiter -- JEAN-PIERRE CASTELNAU (CONT’D) (to Papi) What would you like? Papi doesn’t answer, taking in his surroundings -- JEAN-PIERRE CASTELNAU (CONT’D) Bring him an espresso. (to Papi) I checked on the statute of limitations -- you could still be arrested -- I’m surprised you risked coming back. PAPILLON I won’t be here long.   My home’s in Venezuela now. Papi picks up his suitcase, sets it on the table -- undoes the latches -- PAPILLON (CONT’D) My father told me I’d give up on the idea of punishment and revenge... Papi opens the suitcase, revealing it’s full of thirteen spiral bound school notebooks. PAPILLON (CONT’D) After fourteen years in the bagne, I finally agreed with him... Jean-Pierre picks up one of the notebooks -- on its cover is the original title: THE ROAD TO RUIN...  131.",
      "characters": [],
      "action_text": "PAPILLON (CONT’D) My wife convinced me to write it down while I was still young enough to remember.   My father was a school teacher -- so I can spell alright... JEAN-PIERRE CASTELNAU If these are anything like the few fragments you sent me...then perhaps   this   will be your revenge. Papi shakes his head, his eyes flush with memories and an indomitable lust for life... PAPILLON Nah...   It’s for the one’s who gave me the chance to live again. CUT TO: TITLES OVER BLACK:   Henri Charrier’s memoir, “Papillon” was published in 1969 and became an international best seller.  CUT TO: THE ISLANDS OF SALVATION MODERN DAY TOURIST ATTRACTION; THE VINE COVERED RUINS THAT ONCE HOUSED SO MANY TORTURED SOULS...  SUPER -- 80,000 prisoners were condemned to the penal colony in French Guiana between 1852–1953, most of whom would never return to France.  THE END  132.",
      "dialogue_count": 0,
      "word_count": 362
    }
  ]
}