{
  "slug": "paradise-2013",
  "title": "paradise",
  "genre": "drama",
  "format": "film",
  "scenes_count": 10,
  "characters_count": 3,
  "characters": [
    "MELANIE",
    "LORAY",
    "WILLIAM"
  ],
  "total_words": 19064,
  "total_dialogue": 3,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. LAMB’S ROOM - MORNING Lamb sits on her bed. She wears a modest dress, a flowered headband and lace tights. Her hair is pulled up into one of those pouf/braid combos commonly seen on fundamentalist Christian women. Melanie has a large professional tacklebox filled with makeup. She uses a puff to apply some type of cover-up powder to Lamb’s scars. MELANIE This is from our new line. It’s all- natural minerals from the earth. It covers everything. You know Shana Qualley’s mom? She has a lot of redness from, well, from drinking. I use this on her and she looks a lot better. Not good-- that would take a miracle-- but better. Lamb says nothing. MELANIE (CONT’D) I really don’t like to talk about people. (finishing) There. You look radiant. Lamb looks at her neck and collarbones in the mirror. It’s not an improvement. We still see the scars. LAMB Dr. Cha says I’m not supposed to put anything on there. MELANIE Lamb, it’s 100% natural. One of our representatives puts this on her four-year-old every day. LAMB Why? Melanie is putting away her makeup tools. She closes the tackle box. MELANIE Do you feel ready to give your guest sermon? LAMB Mm-hm  Blue (mm/dd/yyyy)   7.",
      "characters": [
        "MELANIE"
      ],
      "action_text": "MELANIE If you get nervous, just imagine Pastor Rick in his underwear. LAMB (uncomfortable) That won’t be necessary. MELANIE Let me just hear the beginning. Lamb sighs, dutiful. LAMB “My beloved family in worship. I stand here today as miraculous evidence of God’s healing grace...” Do I have to practice right now? MELANIE No. Just remember: God’s counting on you. You can make a difference with what you say today. It’s like I always say, you can affect change in a small way and it makes a big ripple. Like a-- LAMB (interrupting) Like a toot in the bathtub. I know. MELANIE That’s right. She kisses Lamb’s “pouf.” EXT. SUPER CHURCH - DAY The Mannerheim’s car pulls up to a GIANT MEGA-CHURCH COMPLEX. The vast parking lot is filling up with worshippers. The church’s giant marquee-type sign reads: “WHY ‘TWEET’ AT SATAN WHEN YOU CAN ‘FOLLOW’ CHRIST?” INT. MANNERHEIM FAMILY CAR - SAME The Mannerheim’s are bundled up in parkas and scarves. Melanie rolls down the window and peeks out at the overflowing parking lot.  Blue (mm/dd/yyyy)   8. MELANIE Will you look at this clusterhug? I love seeing this many people come together in His name, don’t you? LAMB I think some of them just come for the smoothies. We see that one of the many entrances to the church superstructure says “GOD’S BOUNTY SMOOTHIES & COFFEE.” DOUG We’re lucky to belong to a church with amenities. The Catholics don’t have a juice bar. LAMB The Catholics get to drink the actual blood of Christ. MELANIE They think that, don’t they? Aren’t our differences interesting? I’ll pray for them. Doug, park over by the gift shop. I want to pick up a new journal after church. (to Lamb) I’ve been writing. LAMB Good for you, Mom. MELANIE I’m writing a little story about an old man and an old woman and their whole epic love story going back decades. LAMB Sounds like The Notebook. MELANIE Um, it’s totally unlike The Notebook. I wouldn’t copy my own favorite book that I’ve read 100 times, would I? (then) Doug, there’s one. A VAN fro",
      "dialogue_count": 1,
      "word_count": 3502
    },
    {
      "scene_number": 2,
      "slugline": "EXT. PLANET HOLLYWOOD - SAME The driver takes Lamb’s pink suitcase out of the trunk. Lamb nervously peels off a few bills from a conspicuously large WAD OF CASH. LAMB Here. DRIVER Thanks. Hey, you know how you said you weren’t allowed to go to Disney World? LAMB Yes? DRIVER Was the Disney Channel also forbidden? LAMB Yes, sir. Emphatically so. DRIVER Even   The Wizards of Waverley Place ? LAMB Satanists. Lamb turns and walks toward the hotel with her suitcase and her flute. The driver looks down with surprise at the LARGE WAD OF MONEY she’s handed him. DRIVER You sure? INT. PLANET HOLLYWOOD - EVENING Lamb walks into the hotel. She scans the room nervously. It’s early in the evening. TOURISTS play craps and blackjack and wander around with drinks. The scene is relatively tame and even a little hokey. Lamb seems relieved. LAMB Huh. It’s kinda like Branson. An OLD WOMAN pulls the lever on a cheesy branded slot machine. The machine discharges a few quarters.  Blue (mm/dd/yyyy)   24.",
      "characters": [],
      "action_text": "LAMB (CONT’D) No problem. She steps forward bravely. INT. HOTEL GIFT SHOP - EVENING Lamb, checked in, tucks her room key into her pocket. She’s about to walk to the elevator, but she pauses and goes into the hotel’s gift shop. Lamb takes a tacky, sparkly T-shirt off one of the racks. It says “I (HEART) LAS VEGAS,” only instead of a heart, there is- - nonsensically-- a pair of dice. LAMB (whispering) “I Dice Las Vegas.” It doesn’t look like anything Lamb would normally wear. But nothing about this night is normal. INT. PLANET HOLLYWOOD (ELEVATOR AREA) - EVENING Lamb, now holding a SHOPPING BAG, waits for an elevator to take her up to her room. From where she stands, we can already hear some raucous shouting coming up the elevator shaft. The elevator doors open, revealing about 5 WET FRAT BOYS coming up from the pool area. They’re drunk and in various states of undress. Think damp towels, tribal tattoos, steroidal acne and loud, booming voices. FRAT GUY #1 I swear, I only had a half a pill, but I’m rolling so hard. FRAT GUY #2 Dude, I’m flying. We should call those sluts from Tao and get an eight ball for tonight. FRAT GUY #1 Phenomenal, bro! FRAT GUY #3  Phenomenal . FRAT GUY #4 Hey.  Blue (mm/dd/yyyy)   25. The shouting and laughing stops abruptly when they notice Lamb standing there. Silence. Lamb primly steps into the elevator. INT. PLANET HOLLYWOOD (ELEVATOR) - SAME The frat boys are trying to hold it together, but they’re making crazy expressions at each other and (barely) suppressing laughter. They don’t know how to respond to a pretty girl who’s been desexualized by injury. Finally, one of the guys talks. FRAT GUY #2 Hi. LAMB Hello. One of the guys begins to crowd her in a creepy way. He strokes her ponytail. One of them whispers FRAT GUY #2 Uh, where are you from? The other guys snicker. This is the equivalent of the high school quarterback hitting on an ugly girl to make his friends laugh. FRAT GUY #3 (under his breath) Chernobyl. Huh huh. LAMB I’m from D.C.",
      "dialogue_count": 0,
      "word_count": 1028
    },
    {
      "scene_number": 3,
      "slugline": "INT. HOTEL ROOM - NIGHT Lamb slides a compression sleeve up her arm. LAMB  A life of pages, waiting to be filled...  INT. HOTEL BATHROOM - NIGHT Lamb, now wearing her sequined Vegas T-shirt and her customary knee-length denim skirt, brushes her hair and slides her stocking-covered feet into pink flats. LAMB  Feels like I'm looking for a reason...  INT. ELEVATOR - NIGHT Lamb rides down to the lobby with a group of shoddily dressed TOURISTS. As always, she wears her cardigan, though the T- shirt’s sequined logo is visible. She sings under her breath. LAMB  Roamin' through the night to find...  The doors open. LAMB (CONT’D)  My place in this world. My place...  INT. CASINO - DAY As the elevator doors open, Lamb’s ears are suddenly assaulted with autotuned, bass-heavy hip-hop music. The mood of the hotel has changed considerably. Shit is GOING OFF. Lamb walks through the casino, observing the chaos. A few hired DANCERS are working the pole next to a craps table. Lamb stares at their hard, flawless bodies as they writhe and gyrate, bored. A PREGNANT BRIDE in handcuffs and a light-up “penis tiara” gets led through the lobby by her FRIENDS. Lamb’s eyes widen as the colorful penises blink at her, as if in code.  Blue (mm/dd/yyyy)   29.",
      "characters": [],
      "action_text": "In a nearby bar, a MIDDLE-AGED MAN plants his mouth at the bottom of an ice luge while someone pours vodka down the ramp. LAMB That doesn’t seem clean. At a centrally located casino buffet, TOURISTS scoop piles of crab legs onto their plates. Even something as innocent as food seems to become excessive and wasteful in Las Vegas. A crab leg falls off the plate of a JOLLY FEMALE TOURIST. LAMB (CONT’D) Excuse me, you dropped a...leg. CRAB TOURIST (to friend, ignoring Lamb) Ha! No, no, no, no Leslie. You’re on crack! You are legit smoking crack. Wait, that’s my phone. LAMB A crab was trapped and asphyxiated so that you might be nourished by its leg. The woman still isn’t listening. Lamb might as well be invisible. Finally, Lamb scurries over to the buffet area and picks the leg off the floor. Immediately, a STERN BUFFET ATTENDANT rushes away from his prime rib carving station and confronts Lamb. BUFFET ATTENDANT Ma’am, the buffet is for paying customers, not scavengers. LAMB (shocked) I wasn’t scavenging. She’s wasting food. BUFFET ATTENDANT Oh, I saw the whole thing. The king crab leg hit the floor and you came scurrying out of nowhere like a dirty raccoon. LAMB I did not   scurry . These people are gluttons.  Blue (mm/dd/yyyy)   30.  (MORE) It’s like they think crabs come from a factory, rather than a delicate marine ecosystem. They have no respect for life. BUFFET ATTENDANT Are you from PETA? Do you hate the circus and pony rides? LAMB What? No. BUFFET ATTENDANT Are you one of those anti-abortion psychos? LAMB I don’t think so... BUFFET ATTENDANT “Hookers for Jesus”? LAMB I suppose I just think buffets are wasteful. BUFFET ATTENDANT Please leave my carving station immediately. EXT. LAS VEGAS STRIP - NIGHT Lamb walks down the street, dejected. She passes a NASTY LITTLE MAN handing out fliers for female escorts. NASTY LITTLE MAN Merry Christmas! Beautiful, sexy girls! Hot girls delivered to your room! Lamb plucks a flier from his outstretched hand. It says: REAL GIRLS!",
      "dialogue_count": 0,
      "word_count": 2617
    },
    {
      "scene_number": 4,
      "slugline": "INT. IMPERIAL PALACE (CASINO FLOOR) - DAY Loray is walking quickly across the casino floor. She’s changed into STREET CLOTHES and carries a backpack. Lamb trots after her eagerly. LAMB Where are we going? LORAY I don’t know yet. I know if I leave you by yourself, you’re going to wind up somewhere horrible, like the trunk of a car or Circus Circus. I feel an strange sense of responsibility toward you. You’re just a little deep-fried pickle from Ohio... LAMB Montana. They’re veering back toward the BAR, where William regards them with curiosity. LORAY From Montana, population   four , and you came here to commit sins. What did you have in mind, specifically? LAMB Well, intoxicants, games of chance... LORAY Sex?   (looking Lamb over) I’m sure you’ll have no problem finding someone to wreck that. Lamb is uncomfortable with this suggestion. LAMB Um, well, just basically the whole Vegas experience. (then) Hey, thanks for watching my purse! They’ve arrived at the bar. Lamb takes her purse from William, who looks a bit guilty. WILLIAM Thanks for believing in me. What’s going on?  43.",
      "characters": [],
      "action_text": "LORAY I’m taking Lamb downtown. WILLIAM OMF-Jesus. LAMB You should come with us! LORAY William’s in the program. He only goes out for donuts and his “Higher Power.” WILLIAM I’m off at eleven. (to Loray) You have my number. The new number, the 702... Loray raises an eyebrow at him, surprised. LORAY I got your number all right, Pedo-Bear. Have a nice night. LAMB Wait! This is to pay for my drink. She tosses a single bill onto the bar as Loray hustles her toward the casino exit. LORAY Come on, Lamb..what’s your last name? LAMB Mannerheim. LORAY Jewish? Lamb gasps, delighted by this “shocking” suggestion. LAMB No! They disappear out the casino doors. LORAY Uh, sorry?  Blue (mm/dd/yyyy)   44. LAMB No, it’s cool! Did you really think I was Jewish? Wow! BACK ON WILLIAM: Watching their departing forms, William scoops the money off the bar. Like the cab driver, he’s surprised by the bill’s denomination. INT. LORAY’S CAR - NIGHT Lamb rides shotgun in Loray’s beat-up Hyundai. We hear a DIALOGUE SNIPPET from the   Natural Born Killers   soundtrack, followed by the appropriate song. LAMB Why are we leaving? LORAY If you want to see Las Vegas, we have to go to Las Vegas. LAMB But we’re in Las Vegas. LORAY No, we’re not. We’re in Paradise. Lamb is perplexed. LORAY (CONT’D) They may call this the “Vegas Strip,” but it’s actually located in a census-designated area called Paradise. Paradise, Nevada. You can look it up. Most tourists don’t know. They all say they’re headed to Vegas, but technically, they’re going to Paradise. Lamb stares longingly out at the lights of the Strip. LAMB Well, maybe I want to see Paradise, then. LORAY No you don’t, Lamb. Paradise is processed cheese. Do you want roller coasters and a fake Eiffel Tower and a bunch of tourists clapping for a frigging computerized fountain?   Yay, robot! Yay, robot fountain!   No.  Blue (mm/dd/yyyy)   45.  (MORE) You want real Las Vegas, where the locals go. None of this trifling theme park trash. Actually, the other stuff ",
      "dialogue_count": 0,
      "word_count": 822
    },
    {
      "scene_number": 5,
      "slugline": "EXT. SCEPTRE LOUNGE - NIGHT A line of LOCAL HIPSTERS snakes around outside Loray’s favorite bar, The Sceptre. Loray and Lamb are quickly waved to the front of the line. INT. SCEPTRE LOUNGE - NIGHT Close on Lamb’S GLOVED HAND, gripping an oversized LEVER. LORAY (O.S.) All right, let’s get this out of the way. Pull. Reveal Lamb in the crowded bar, the kind of place that has Christmas lights even when it isn’t Christmas. She eagerly yanks the lever on a campy vintage SLOT MACHINE. The machine’s display reveals a CHERRY, a BELL and “BAR.” LORAY (CONT’D) There. You gambled. You played your game of chance. And now you see why it’s stupid. Let’s move. She tries to urge Lamb ahead, but Lamb is perplexed. LAMB What’s “bar”? Did I lose? LORAY Yes, Lamb, you lost. Ultimately, everyone loses. If you lit that dollar on fire, at least you’d have kindling. I have no respect for gamblers. They make their way toward the bar. LAMB You deal cards for a living. LORAY That’s right, for a living. Not for my own personal edification. Charlie! Hey, Charlie! CHARLIE, a cute, tattooed FEMALE BARTENDER, looks up from the taps, where she’s busily filling pints. She grins. CHARLIE Loray-who-I-wanna-lay. What are we thinking?  Blue (mm/dd/yyyy)   48.",
      "characters": [],
      "action_text": "LORAY I’m thinking we’re going to need some shots. Line ‘em up. BEGIN DRINKING SEQUENCE Loray and Lamb are ensconced at their own tiny table near the jukebox. Loray’s HIPSTER FRIENDS hover around them. They wear tight jeans, scarves, ironic T-shirts, weird beards, the whole nine. Loud music blasts. The mood is crowded, boozy and festive. A tray of assorted shots sits in front of them. Loray downs one effortlessly; Lamb attempts a sip. Loray proudly plays show-and-tell with her new “discovery.” LORAY (CONT’D) Lamb’s from Montana. She was home- schooled. The hipsters shout over the jukebox, admiring Lamb. HIPSTER #1 Wow! That’s awesome. LAMB It is? HIPSTER #2 It’s anti-establishment. The public school system in this country a joke. I’m going to home-school my kids for sure. LAMB Maybe don’t do that. LORAY Lamb has never danced. She’s not on Facebook. She’s never even seen an R-rated movie. LAMB I saw   The Passion of the Christ.  HIPSTER #3 So basically, you’ve avoided so much empty, spirit-stealing pop culture. (beat) You’re lucky.  Blue (mm/dd/yyyy)   49. HIPSTER #1 Right? It’s so punk rock. LAMB Thanks? LORAY Watch her try to drink this. Loray pushes a SWEET TART toward Lamb. Everyone watches Lamb as if she’s an exotic zoo animal. Lamb takes a tentative sip of the vile pink concoction. Her face crumples. HIPSTER #1 She can’t do it! HIPSTER #2 Her face, like, repels the booze. HIPSTER #3 Amazing. INT. SCEPTRE LOUNGE (ANOTHER CORNER OF THE BAR) - NIGHT A HIPSTER GIRL and her GAY HIPSTER FRIEND drape a trendy fringed SCARF over Lamb’s neck, tucking it fashionably. HIPSTER GIRL This is so cute on you. It’ll cover up some of your battle damage. LAMB I like it. What is it? GAY HIPSTER FRIEND It’s a keffiyeh. LAMB A what? HIPSTER GIRL A keffiyeh. It’s a Muslim head scarf. Lamb nearly does a SPIT TAKE. LAMB (choked) Muslim? GAY HIPSTER FRIEND Oh, don’t worry; it’s not offensive to them or anything.  Blue (mm/dd/yyyy)   50.  (MORE) These things are so popular; they’re total",
      "dialogue_count": 0,
      "word_count": 2151
    },
    {
      "scene_number": 6,
      "slugline": "INT. SCEPTRE BAR (DOWNSTAIRS) - SAME Loray is grinding with a HEAVILY BEARDED GUY. She takes a swig of beer and tries unsuccessfully to make out with him through his mass of facial hair. LORAY I can’t find your mouth. INT. SCEPTRE LOUNGE (UPSTAIRS BAR) - SAME William takes a remote from behind the bar and turns on the big TV. He flips through the channels and finds... The classic 1960s special,   Rudolph the Red-Nosed Reindeer.  Lamb reacts like a delighted child. LAMB  Rudolph the Red Nosed Reindeer ! I remember this. William watches with her, equally pleased. The light flickers on their faces. WILLIAM Of course. Total classic. Even I’ve seen this and my childhood was a blur of beatings and evictions. LAMB I watched this like, every year when I was little. Then my parents realized it left the Christ out of Christmas, and that was the end of that. They watch for a moment. It’s the “Island of Misfit Toys” sequence, in which a haunting song is sung by imperfect toys: a polka-dotted elephant, a boat that doesn’t float, a train with square wheels, and a lonely little rag doll (among others). LAMB (CONT’D) Oh, this part is so sad. These are the Misfit Toys. Nobody wants them because they’re defective. ELEPHANT (on TV)  How’d you like to be a spotted elephant?  Blue (mm/dd/yyyy)   60.",
      "characters": [
        "LORAY",
        "WILLIAM"
      ],
      "action_text": "BOAT (onscreen)  Or a boat that can’t float?  Lamb watches, her eyes shining. Then: WILLIAM What’s wrong with the doll? LAMB I don’t know. Nobody wants her. WILLIAM Seriously, though, what’s her defect? I can see the train has square wheels. And the elephant has polka-dots. But that little doll looks completely normal. What’s she doing with those broken toys? We see the rag doll. She   does   look perfectly normal. (This is one thing that has never made sense about the “Misfit Toys” scene.) LAMB We probably just can’t see what’s wrong with her. WILLIAM You think it’s under her dress or something? Lamb is uncomfortable. Her voice is strained. LAMB Yeah. WILLIAM Or...maybe she’s perfect. LAMB Nah. WILLIAM Maybe she’s just in the wrong place. Loray emerges from the stairwell, interrupting them. She glances at the TV, drunk and dismissive. LORAY What is this? Gumby?  Blue (mm/dd/yyyy)   61. William and Lamb groan at Loray’s flippancy toward such a beloved show. WILLIAM You don’t know what this is? LORAY You guys need to come downstairs immediately. Some people are line dancing as a joke. William fakes jumping out of his seat. Then: WILLIAM She needs to rest. LAMB No, I’m fine now. Much better. They rise and head toward the stairwell. Loray continues babbling happily. LORAY Hey William, you know that girl who always does the splits? She did it  again.   I’m like, bitch, we get it, you can put your whole vagina on the floor. WILLIAM Okay. LORAY I’m gonna fight her. WILLIAM I think it’s time to switch to water. Loray takes a last glance at the TV and shakes her head as they descend. She loudly whispers to William. LORAY (O.S.) You take a girl upstairs and you put on cartoons? You’re a mess. EXT. DOWNTOWN LAS VEGAS - NIGHT Lamb, William and Loray walk down Fremont Street, eating HOT DOGS from a busy food truck.  Blue (mm/dd/yyyy)   62. LORAY So is dirty street meat against your religion? Lamb is enjoying her hot dog immensely. LAMB I think it could   be   my religion. CHARL",
      "dialogue_count": 2,
      "word_count": 2558
    },
    {
      "scene_number": 7,
      "slugline": "EXT. LAS VEGAS STRIP - NIGHT Lamb’s head is hanging between her knees. WILLIAM Hey. Hey. You going to be okay? They’re standing on the still-busy sidewalk. Lamb downplays her nausea and discomfort. LAMB Yes. I’m phenomenal. She stands up. We see a spot of BLOOD on the elbow of her cardigan. LORAY You’re bleeding. LAMB (downplaying) I think I bumped my elbow going around one of those turns. William pulls up the sleeve of the cardigan. Lamb recoils from this violation of privacy. LAMB (CONT’D) Stop it. The elbow of Lamb’s compression garment is SOAKED in blood. Loray winces and looks away. WILLIAM You’re hurt. LAMB It’s my skin graft. William is trying to stay calm. WILLIAM Can they re-graft it? Lamb pulls away from him angrily. LAMB Yeah, at a special clinic in Minnesota for human-jerky. I TOLD you I was a mess. I told you. Nobody ever believes me.  74.",
      "characters": [],
      "action_text": "WILLIAM You’re not a mess. It’s not a big deal. You just need to take it easy. Chill at the hotel. LAMB Chill? I’m tired of “taking it easy.” I’ve been taking it easy for two years now and I feel like I’m rotting alive. LORAY From a scientific standpoint, we’re all rotting alive. LAMB My gosh, I never thought about it that way. You’re so wise. On Loray: OWNED. WILLIAM I think you’ve had enough fun for the night. We need to patch you up. Lamb is clutching her bleeding elbow. LAMB Enough fun my skinless ass! It’s easy for you to say “enough” and to “take it easy”, because you already got to do everything you wanted. You already got to screw up and disappoint your whole family. On William: sadly, this is true. LAMB (CONT’D) You’ve got those lines on your face and that silver in your hair because you lived. Now it’s my turn. WILLIAM I’m a dirtbag. You don’t want to be like me. LAMB (through tears) Yes I do.  Blue (mm/dd/yyyy)   75. LORAY You’re lucky you had a nice life. I know you resent all the Jesus stuff and not being allowed to wear shorts and the fact that they made you practice the recorder every day. LAMB The flute. LORAY But there are worse things than being protected. Having someone care where you go and what happens to you. We can see that Loray has wished for this very thing. William glances at her protectively. LORAY (CONT’D) People in your family are probably looking for you right now. Nobody’s looked for me in years. The last time someone Googled me, there was no Google. They had to Alta Vista that shit. Lamb looks up at Loray, still holding her elbow. LORAY (CONT’D) Also, I’m not the one bleeding on the street right now. You’ve lived, all right? All right, plane crash? You lived, you died, and now you’re living again. You’re a lot harder than most of these clowns. She gestures to the LATE NIGHT REVELERS on the street. WILLIAM Let’s get you to the hospital. LAMB Don’t bother. They’ll just wrap it in some gauze and parade me around in front of the med stud",
      "dialogue_count": 0,
      "word_count": 4358
    },
    {
      "scene_number": 8,
      "slugline": "EXT. CHEETAH STRIP CLUB - SAME The sky is growing light. Lamb walks across the mostly empty parking lot toward William. One of the bouncers calls out to her, concerned. BOUNCER Hey, where you going? Lamb turns to face him, stumbling backwards. She opens her arms to embrace the world. LAMB Everywhere. William takes her gloved hand. They walk off into the dawn. EXT. LAS VEGAS STRIP - DAWN It’s a grey early morning. Williams HANDS are COVERING Lamb’s EYES. He removes them, revealing... The Excalibur CASTLE that captured Lamb’s imagination when she first arrived. LAMB (pleased) The castle! Finally. WILLIAM Do you like buffets? Lamb briefly recalls her bad buffet encounter. Then: LAMB I   love   them. INT. EXCALIBUR ROOFTOP - SUNRISE Lamb sits on the roof, watching the sun rise among the fake castle turrets. William appears with two plates. Lamb’s has MICKEY MOUSE PANCAKES, which she notices with delight. William settles in and takes in the sunrise. Lamb leans in suddenly and KISSES HIM. William is startled, but he does not resist. LAMB Thank you.  97.",
      "characters": [],
      "action_text": "WILLIAM Yes, I’ve done so much for you. LAMB I’m sorry about the bar, when I said you weren’t scary. I lied. I’m terrified. Here, feel this. She puts his hand near her heart. WILLIAM That’s not fear. LAMB You don’t think? WILLIAM No. LAMB It’s been a couple of years since my heart raced for any good reason. WILLIAM Now it’s your turn. They KISS again. And we LEAVE them, looking out onto the waking city... INT. HOTEL ROOM - DAY Lamb returns to her hotel room alone, looking dreamy. Smiling, she packs her suitcase again, tossing everything in with uncharacteristic recklessness. Before she exits, she takes one last look at the now sun- filled room. She rises onto her tiptoes and sinks. Up and down. Up and down again. It’s a strange little bounce. Her arms swing. Could it be? Lamb is...DANCING. INT. PLANET HOLLYWOOD HOTEL (FRONT DESK) - DAY Lamb approaches the reservation desk, her bags in tow. CLERK Checking out? LAMB Yes. 1427.  Blue (mm/dd/yyyy)   98. She slides over her key. The clerk types on the computer. His demeanor changes to one of recognition/annoyance. CLERK 1427. Did you happen to check your messages upstairs? LAMB I didn’t see any messages. CLERK When your phone blinks, it means you have messages. LAMB Sorry. I wasn’t in my room a lot. (winking) Vegas. CLERK Well, you have 17 messages. LAMB 17? CLERK A Doug Mannerheim. Then Melanie Mannerheim. Then Melanie and Doug together, crying and singing hymns. Then Melanie again. Pretty much off and on like that for   hours on end . Eventually she was just like, “Hi sweetie, it’s just me, Mel.” (beat) She’s crazy. Lamb is touched. Loray was right. LAMB Sorry about that. She signs for the room, tips the clerk and heads for the exit. The clerk looks at the tip? CLERK Hey, what did you play? Did you shoot craps? LAMB (leaving) Pardon me!  Blue (mm/dd/yyyy)   99.",
      "dialogue_count": 0,
      "word_count": 503
    },
    {
      "scene_number": 9,
      "slugline": "EXT. MANNERHEIM HOUSE - NIGHT MUSIC UP: A Christmas carol A CAB from a RURAL TAXI COMPANY drives up the isolated country road to the Mannherheim’s house. From a distance, we see Lamb exit the car. A disheveled Lamb heads up the snow-covered front walk. The house is lit-up and looks cozy and inviting. She pauses to look at the big, illumnated NATIVITY SCENE by the front entrance. Yes, it’s plastic and tacky. But it’s also touching. Lamb smiles sadly at the Baby Jesus doll tethered to the manger with a bike lock. Lamb opens the front door. Melanie is passing through the kitchen with a cup of cocoa. She wears glasses and sweatpants and looks adorably frumpy compared to her glamorous “church look.” She turns and sees Lamb. MELANIE Oh thank God. Melanie and Lamb rush toward each other. Melanie sweeps Lamb into her arms, her first words summing up every mother’s chief anxiety: MELANIE (CONT’D) Are you hurt? Are you hurt? Lamb’s face is muffled against her mother’s shoulder. They’re both in tears. LAMB No... I’m happy. Doug hurries down the stairs in pajamas. DOUG Is she in pain? MELANIE She says she’s happy. Doug’s relief turns to anxiety in an instant. DOUG (worried) Oh no.  Blue (mm/dd/yyyy)   100.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 212
    },
    {
      "scene_number": 10,
      "slugline": "INT. LIVING ROOM - NIGHT Melanie and Doug sit on the couch near the Christmas tree. Lamb sits in a chair facing them. Melanie is rapidly tapping her foot on the floor. MELANIE You going to talk first? LAMB If you don’t mind... Melanie’s reply is machine-gun rapid. MELANIE Ha, of course I don’t mind. I’m a very generous listener; you know me. All-Ears Mel. She bites her lip impatiently. LAMB What I did in church-- it was wrong. Disrespectful. I had a problem with people shouting their beliefs at me, but then I went and did the same in turn. DOUG Everyone understands that you’ve been through a trial. LAMB But they must have been upset. DOUG People tried to talk. But your mother wouldn’t let them get away with it. She would defend you through anything. Lamb looks at Melanie. Melanie looks down. LAMB (touched) Really, Mom? MELANIE (quiet) Yes, duh.  Blue (mm/dd/yyyy)   101.",
      "characters": [],
      "action_text": "DOUG You commited apostasy. Are you prepared to repent before God and the community? LAMB No. Doug and Melanie are startled by this. LAMB (CONT’D) ...not before the community. This is between me and God. I know you love your church, but right now I don’t need the stadium-seating and the Teen Club and Christian Talent Night. There’s nothing wrong with those things, but I want to know who I am and what I believe away from all of it. Just me, flesh and bone. Melanie and Doug take this in. Then: MELANIE Well, you’re a just a   little   too old for Teen Club... LAMB That’s not my point. I want to go out in the world and act on it. If you stay in a place where everyone thinks and acts the same as you, it’s just an echo-chamber for Jesus. DOUG (missing the point) I think the new carpeting really cut down that echo. MELANIE Lamb, you may not realize this, but I can be bit of a maverick myself. Remember that sermon about the dangers of yoga and how it subtly encourages the worship of false gods? Well, I thought that was a bunch of bunk. I went ahead and joined a yoga class at the gym. I’ve been going regularly. What do you think of that?  Blue (mm/dd/yyyy)   102. LAMB Good for you, Mom. MELANIE I just change it up a little in my mind. Sun Salutation becomes God Salutation. Down Dog is Down Satan, and so forth. DOUG We’re not stuffy, honey. We’re open to hearing about your new beliefs as long as they’re still extremely conservative. LAMB (carefully) Dad...I disagree with many of the things I’ve been taught. Heavy silence from Melanie and Doug. DOUG Certain things aren’t a matter of agreement or consent. Some things are just God’s word-- LAMB (heated) Or   your   interpretation thereof-- DOUG Christ speaks directly into the hearts of our leaders. LAMB Like Pastor Rick? MELANIE (interrupting) Hey! Lamb and Doug look at Melanie. Her sharp tone implies that maybe she’s not totally ignorant of the Pastor Rick incident. MELANIE (CONT’D) I know there’s one thing God hates and that’s",
      "dialogue_count": 0,
      "word_count": 1313
    }
  ]
}