{
  "slug": "paranorman-2012",
  "title": "paranorman",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 12,
  "characters_count": 0,
  "characters": [],
  "total_words": 23066,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. RESEARCH LABORATORY - NIGHT 1   1  An attractive FEMALE SCIENTIST in a gore-spattered lab coat moves fearfully along a wall, passing benches strewn with broken lab equipment. Her ample bosom heaves as she PANTS nervously, mascara-rimmed eyes darting to and fro. Glass SMASHES on the floor nearby and MELODRAMATIC MUSIC swells. The woman backs into a shadow, not noticing a pair of dead eyes catching the moonlight behind her. The music climbs to a frenzy as something GROANS horribly into the woman’s ear. She spins around on her stiletto heels as a rotted face looms out of the darkness, drooling through broken teeth, and lunges at her neck. ZOMBIE Brains! CLOSE ON the woman as she raises her hands and SCREAMS. CUT TO: INT. BABCOCK’S HOUSE, LIVING ROOM - NIGHT 2   2  Eleven year-old NORMAN BABCOCK sits on the floor watching TV. He has large piercing eyes and a messy shock of hair. The movie scene we just witnessed continues off- screen with the sound of bloodcurdling SCREAMS. Behind him sitting upon a sofa is GRANDMA BABCOCK, a plump old lady squinting through thick glasses. GRANDMA BABCOCK What’s happening now? NORMAN The zombie is eating her head, Grandma. GRANDMA BABCOCK That’s not very nice. What’s he doing that for? NORMAN Because he’s a zombie. That’s what they do. GRANDMA BABCOCK Well he’s going to ruin his dinner. I’m sure if they just bothered to sit down and talk it through it’d be a different story. Norman CHUCKLES, as if the idea is absurd, then winces as he hears his father shout from the kitchen.",
      "characters": [],
      "action_text": "PERRY BABCOCK (O.S.)  Norman!   Didn’t I tell you to take out the garbage? NORMAN Coming, Dad! GRANDMA BABCOCK Tell him to turn up the thermostat too, will ya? My feet are like ice. Norman nods to her and shuffles over to the kitchen door. INT. BABCOCK’S HOUSE, KITCHEN - CONTINUOUS 3   3  Norman’s mother, SANDRA BABCOCK, is emptying the dishwasher. She is in her late thirties, and wears ‘mom’ clothes that do no favors for her figure. His father, PERRY BABCOCK, is older, with a neatly-trimmed beard trying hard to delineate chin from neck. He stands on a chair, decked out in tool belt and safety goggles, even though he’s only changing a light bulb in a ceiling fixture. Sandra smiles at her son as he makes his way silently to an overstuffed trash can as tall as he is. SANDRA BABCOCK Hi. Whatcha watching in there? NORMAN Sex and violence. SANDRA BABCOCK Oh. That’s nice. Perry glares over as Norman wrestles with the garbage. PERRY BABCOCK Can’t you be like other kids your age and pitch a tent in the yard, or have a healthy interest in carpentry? SANDRA BABCOCK Perry... NORMAN I thought you said kids my age were too busy shoplifting and joyriding? SANDRA BABCOCK Norman! He hefts the bag onto the floor and ties it in a knot.  ParaNorman   2.  CONTINUED: 2   2 Breezing into the kitchen through the back door while CHATTING inanely on her cell phone, Norman’s older sister COURTNEY is fifteen years-old and is the bleached-blonde cheerleader archetype of every schoolboy’s sordid dreams. COURTNEY Oh yeah, he’s r-i-double p-e-d. Like, a seven pack at least. (to Norman) Ew! Watch it! She pushes her brother out of the way as he drags the garbage outside. SANDRA BABCOCK Courtney, be nice. COURTNEY Yeah, she totally doesn’t deserve him. I mean, she’s nice and I really like her, but she’s a complete   loser . Yeah, I know. Courtney slumps into a chair at the table, twisting a strand of gum out of her mouth with a finger. Norman returns inside and shuts the door, pausing a moment as if",
      "dialogue_count": 0,
      "word_count": 1142
    },
    {
      "scene_number": 2,
      "slugline": "INT. MR PRENDERGHAST’S HOUSE, STUDY - NIGHT 6   6  CLOSE ON a faded photograph of Norman, held in the grimy hand of MR PRENDERGHAST. He stands over a dusty desk scattered with pictures of Norman, Sandra and older family members. He is in a dark study; a wall-to-wall trove of curious miscellanea and dumpster-dived junk. MR PRENDERGHAST Not much time, not much time... He pulls an old leather-bound book out from the mess, and traces a finger over a woodcut illustration on its cover; an ethereal woman lying beneath a cluster of stars. Wincing with pain, the man drops the book and clutches at his chest, COUGHING and GASPING horribly. CAMERA PANS to a wall covered in countless photographs, newspaper clippings and scrawled occult markings. It is a shrine of sorts; a madman’s recondite genealogy project, and at its center is a photograph of Norman, posing with his family on vacation. ZOOM IN to the photograph, hurtling past the Babcocks and through dense trees further and further into a dark forest. TITLE:   PARANORMAN  INT. BABCOCK’S HOUSE, NORMAN’S BEDROOM - MORNING 7   7  Norman opens bleary eyes, turns off his zombie hand alarm clock, and slides out of bed. INT. BABCOCK’S HOUSE, LIVING ROOM - MORNING 8   8  Dressed for school, Norman pauses at the front door and turns to look at the sofa in the living room. He waves happily, and Grandma smiles back. Courtney passes him as she comes down the stairs in the opposite direction. She also stops to look at the sofa, but to her eyes it is empty. She sneers contemptuously. EXT. SUBURBAN STREET - MORNING 9   9  Norman ambles past houses and lawns spotted with small- town America detritus; cheap plastic lawn furniture, peeling-paint fences and cookie-cutter topiary. Here the quaint colonial buildings are mostly in disrepair, their picket fences rotten or daubed in graffiti.  ParaNorman   6.",
      "characters": [],
      "action_text": "Norman is watched dubiously by the occasional passer-by as he shouts amiable greetings to people who simply aren’t there. NORMAN Good morning! Hey Bruce! How’s it goin’? Not much. I’m kind of late for school. I need to go. Hi, nice to see you guys. Good morning. Sorry I gotta run. Excuse me. Pardon me. See ya. At one street corner, Norman bends over a gutter. He is watched curiously by a man retrieving his morning paper across the other side of the street. MAN’S POV - Norman crouches over the flattened remains of raccoon road kill. NORMAN (CONT’D) Hey there little buddy! C’mere! He realizes he is being stared at and slowly turns to face the onlooker, then hurries away. Though no one else sees them, to Norman’s eyes, a whole host of ghosts are meandering through the streets. NORMAN (CONT’D) Yeah, good to see you! How you doin’? Hi Mrs Hardman. You look nice today. I like what you’ve done with your hair. HAIRDRYER GHOST Does anyone smell burning? HIPPY GHOST Hey, peace, man. NORMAN Totally. CIVIL WAR GHOST As you were, soldier. NORMAN Sir, yes sir! GREASER GHOST Yo Norman, you playin’ hookie? NORMAN No no, I’m just late for school. Sorry, I gotta go. (to Mobster Ghost) How you doin’?  ParaNorman   7.  CONTINUED: 9   9 MOBSTER GHOST Hey, how   you   doin’? A little further along Norman nods pleasantly to the ghost of a parachutist impaled in the branches of a roadside tree. NORMAN Hi! How’s it hanging? PARACHUTIST GHOST Ho ho! Haven’t heard that one before. Well, it’s a nice day. EXT. MAIN STREET - MORNING 11   11  Its industrial days now rusted behind it, Blithe Hollow has become a run-down tourist town, celebrating its heritage with lame fetes and crass knick-knacks. A massive billboard beside the main square reads “BLITHE HOLLOW - A GREAT PLACE TO HANG!” illustrated by a group of waving Puritans beside an equally cheerful witch hanging from a gallows. Across the street a huge banner suggests this year is particularly important for the town; “BLITHE HOLLOW - 300 BEWI",
      "dialogue_count": 0,
      "word_count": 3574
    },
    {
      "scene_number": 3,
      "slugline": "EXT. SCHOOL - NIGHT 29   29  Lit by spotlights, a large banner over the entrance reads, “THE WITCH’S CURSE - presented by BLITHE HOLLOW MIDDLE SCHOOL DRAMA SOCIETY - written, produced and directed for the stage by Margot Henscher”. A notice beneath it reads “SPELLING BEE - NEXT WENSDAY”. A chorus of kids’ voices can be heard SINGING from inside, belting out an operatic rendition of Donovan’s  “Season of the Witch” . INT. SCHOOL GYMNASIUM - SAME 30   30  Rows of plastic chairs in front of the spotlit stage are occupied by expectant families. Among the sea of faintly buzzing video cameras, and a ripple of APPLAUSE, Sandra politely smiles at the acting talents of other peoples’ children. Next to her, Perry struggles to fit a battery into his camera. PERRY BABCOCK Great, now we’ll never get to remember this moment. ANGLE ON STAGE as Salma, in full witch get-up, waves her hands theatrically at the other children. SALMA I curse you accusers to die a horrible and gruesome death and rise from your graves as the living dead; your souls doomed to an eternity of damnation! The Pilgrims who aren’t dying and rising from the dead begin to menace Salma with their farming implements, and begin a slow ominous chant. KIDS Kill the witch! Kill the witch! Sandra nudges her husband and cheerily points toward the stage. SANDRA BABCOCK Gosh, aren’t they   adorable ? Norman hears a HOOTING sound from above. An owl with big glowing eyes wheels down over the audience from the beams of the gymnasium. Norman glances around, wondering why no one else seems to notice as it glides low and alights in the papier mache branches on Neil’s head. It turns to Norman and HOOTS.  ParaNorman   21.",
      "characters": [],
      "action_text": "He looks down from it and catches Neil’s eye. Neil makes a puzzled expression. NEIL What? KIDS  Kill the witch! Kill the witch!  The chanting seems to deepen and slur and the air grows dark and thick. The shapes of the audience and the kids beside him swim around, blurring like a finger pulled through oil paint. The ceiling disintegrates into clouds, which CRACKLE with lightning. NORMAN (under his breath) Oh no! Not again! All around trees have sprouted out of nowhere, and through the darkness in the distance are occasional lights of small houses. This might be how this very spot looked three centuries ago. EXT. OLD FOREST - NIGHT 31   31  As Norman turns on the spot GASPING, he hears a RUSTLE in the bushes behind him and spots several dark and ominous figures in Pilgrim clothing scouring the undergrowth. PURITAN Witch! We know you’re out there! Norman stands on a twig which, naturally, CRACKS loudly, and the figure turns around and points at him. PURITAN (CONT’D) There! NORMAN No! PURITAN Witch. More figures emerge from out of the darkness, wielding hayforks. They SHOUT threateningly and, as one man, surge toward him. Norman turns and runs. The trees around him are shifting, but there’s no wind blowing the branches. Limbs GROAN as they twist, bearing down on him like ragged talons trying to stop his escape. Soon he can run no further, the way ahead tangled up into a wall of thorny fingers.  ParaNorman   22.  CONTINUED: 30   30 Norman finds himself pushed up against the trunk of a huge tree, and a knothole grimaces at him, wood splitting open into a hag-like mouth. It furrows a mossy brow and speaks in a low rumbling voice. TREE  The dead are coming!  Norman GASPS and tries to push himself away, but the pursuing figures are drawing closer, and there’s no escape. A familiar voice whispers out of nowhere. NEIL (O.S.) Hey buddy! Are you okay? Norman turns around to find the knothole is now Neil’s face, bulging out of the side of the tree with a look of concern. This is",
      "dialogue_count": 0,
      "word_count": 2034
    },
    {
      "scene_number": 4,
      "slugline": "INT. SCHOOL HALLWAY, LOCKERS - CONTINUOUS 40   40  Norman sprints madly for the main doors, passing Neil and Salma who glance up from their lockers as he stumbles by. NEIL Norman? Alvin tears around the corner in pursuit, but Neil stands in his way, waving his arms indignantly. NEIL (CONT’D) Hey! What’s the big deal? ALVIN Don’t get your bra in a twist, fat boy, this has nothing to do with you! Keep out of my way! NEIL Or what? ALVIN Or I’ll punch you in the boobs! NEIL I don’t have boobs. These are  pectorals ! Alvin jabs him in the chest. NEIL (CONT’D) Ow! My boobs! Neil swiftly steps aside. Alvin reaches the door to see Norman disappearing along the path as fast as he can. Alvin YELLS after him. ALVIN You’re   dead , freakshow!   Do you hear me? D-E-D! DEAD! You’re gonna be so dead you’re gonna have to talk to   yourself   when you’re dead! INT. BABCOCK’S HOUSE, LIVING ROOM - EARLY EVENING 41   41  Wearing her fanciest dress, Sandra bustles out of the kitchen to the front door. PERRY BABCOCK I really don’t think we should be leaving him. SANDRA BABCOCK Perry, you promised me a meal that someone   else   microwaved.  ParaNorman   29.",
      "characters": [],
      "action_text": "PERRY BABCOCK He’s probably up there right now fiddling with his ouija, or his orbs, or whatever it is he’s got up there. This is not good. INT. BABCOCK’S HOUSE, NORMAN’S BEDROOM - EARLY EVENING 42   42  Norman paces his room looking pale and anxious as he hears the front door shut downstairs. Everywhere he turns he finds himself face to face with some zombie related novelty, from his lurid horror posters to his shelves of ghoulish action figures, and it’s not doing anything for his nerves. His cell phone BEEPS from his pocket, giving him a start. He takes it out and reads a text; “COME TO THE WINDOW”. Norman cautiously walks over and peers around the edge of the window frame. A figure stands motionless in the yard below, sheets of laundry billowing off the clothes line beside it. It stares up at Norman through the blank eye holes of a hockey mask. Norman GASPS and jumps back. With a frown, he re-emerges and opens the window. The figure lifts the mask, and Neil beams out from underneath, waving excitedly. NEIL You wanna play some hockey? Norman SIGHS. NORMAN I’ve kinda got other things on my mind right now. Neil looks a little uncomfortable. NEIL Is it all that walking dead stuff again? NORMAN Mr Prenderghast appeared to me in the bathroom! NEIL Ew.  ParaNorman   30.  CONTINUED: 41   41 NORMAN No, his   spirit ! He says the witch’s curse is real and I have to go up to the old graveyard to stop it! Before the sun sets  tonight ! Neil shifts uneasily as he processes. NEIL So you wanna come play a bit later? NORMAN Didn’t you hear what I just said?! NEIL Yeah, but I thought my idea was less likely to get us eaten. Norman knows he’s on his own in this. NORMAN Just go home, Neil. I’m better off on my own anyway. NEIL But... NORMAN Go home! Norman reaches up and closes the window. Neil’s shoulders sag and he turns away. Across the room, his Grandma materializes, and squints her eyes through the window as Neil awkwardly pulls himself over the garden fence. GRANDMA BABCOCK ",
      "dialogue_count": 0,
      "word_count": 1190
    },
    {
      "scene_number": 5,
      "slugline": "INT. MR PRENDERGHAST’S HOUSE, HALLWAY - CONTINUOUS 47   47  The fading light of day spills across the floorboards and faded wallpaper of a long passage. NORMAN Hello? Mr Prenderghast? Motes of dust float around Norman as he moves slowly toward a door, slightly ajar, muttering to himself. He quietly makes his way past all manner of objects that epitomize the state of Mr Prenderghast’s mind; a mannequin in a shopping cart, a pile of broken typewriters, a suspended bag of spoons, a closet full of identically soiled hobo suits, a Nordic track... INT. PRENDERGHAST’S HOUSE, STUDY - CONTINUOUS 48   48  The study is filled with teetering piles of junk and old furniture draped over in dust sheets. A crucifix hangs over a metal cot with rumpled bedding. This is evidently where the old man lived his whole life. Starlight from a window picks out a macabre halo on a shape on the floor: Mr Prenderghast, dead where he fell, tightly clutching a leather-bound book. CLOSE ON Norman’s face as he swallows nervously and steps closer to the body. He gingerly takes hold of the book and gives a gentle tug. It holds fast in the rigor mortis grasp. He tugs harder, shaking the book repeatedly, the corpse shaking with it. NORMAN Let go! Norman spends several strenuous moments dragging the body across the floorboards, Mr Prenderghast’s head glancing off table legs and smacking repeatedly against the floorboards, as Norman tries to wrestle the book free. With a final yank the book pulls loose and, GASPING, Norman grips the book to his chest and runs to the door. EXT. WOODED LANE, MR PRENDERGHAST’S HOUSE - SAME 49   49  Norman careens through the door, leaps off the porch and sprints along the wooded lane up the hill, watched by Alvin, concealed behind some bushes. EXT. WOODED HILLTOP, OLD CHAPEL GRAVEYARD - LATER 50   50  Norman emerges from the woods, his long shadow preceding him as the sun begins its descent behind the tall trees.  ParaNorman   34.",
      "characters": [],
      "action_text": "He pauses and stares out across weathered tombstones poking out amidst tangles of thorns. Clutching the book tight, Norman wrenches open the heavy gate, its rusted padlock crumbling apart. Eventually the track runs up to a stone slab surrounded on either side by thick bramble. Norman brushes aside vines and reads an epitaph engraved into the stone; “ HERE LIES BURIED THE SEVEN VICTIMS OF THE BLITHE HOLLOW CURSE. MAY YOUR SOULS FIND EVENTUAL AND EVERLASTING SALVATION. 1712. ” Norman pushes through the thick bushes into a secluded plot of land behind the slab with seven gravestones sticking out from the undergrowth. NORMAN This is it! The sun continues its descent, casting an ever lengthening shadow of treetops across the graveyard. NORMAN (CONT’D) Read from the book, stop the curse, go home and pretend this never happened. Norman steels himself, opens the book and starts to read. NORMAN (CONT’D) “Once upon a time, in a far-off land there lived a king and queen in a magnificent castle...” He pauses, confused by what he’s reading. NORMAN (CONT’D) What? A fairy... tale...? A hand reaches over his shoulder from nowhere, whipping the book out of his grasp. He spins around to find Alvin standing behind him. ALVIN What ya got there, Geekula? Norman launches himself at the book, but Alvin holds him back at arm’s length. NORMAN Give it back! ALVIN Can’t wait to see everybody’s faces when they hear about   this  one!  ParaNorman   35.  CONTINUED: 50   50 NORMAN No, don’t! Alvin! ALVIN Hey! Nobody makes me miss out on a possible date with a girl that almost had some interest in talking to me. Yeah? Thought so! You got nothin’ to say! NORMAN Uh-oh. ALVIN Dang straight “uh-oh”. That’s what happens when Alvin gets around here. Uh-oh is that Alvin? Uh-oh Alvin’s gonna make me run home to mommy. As Norman twists and wrestles against the bully the turbulent clouds in the sky above them twist and coalesce into the vague semblance of a huge grinning face. The face of a witch. There is ",
      "dialogue_count": 0,
      "word_count": 2185
    },
    {
      "scene_number": 6,
      "slugline": "INT. MR PRENDERGHAST’S HOUSE, HALLWAY - CONTINUOUS 57   57  CLOSE ON the door knob RATTLING furiously, then a CRACK as a mottled hand punches it right through the wood. A figure limps slowly into the hallway, dragging one crippled foot behind the other. It stops halfway along and tilts its head, as if listening, and emits a dire MOAN. More shapes appear behind it in the doorway and fan out along the hallway. INT. MR PRENDERGHAST’S HOUSE, STUDY - CONTINUOUS 58   58  The boys tremble in their hiding places trying not to make a sound; Alvin crouched behind a stack of books and Norman lying underneath the bed. The footsteps grow louder as the zombies shuffle into the room. NORMAN’S POV - rotten legs step up to Mr Prenderghast’s body, lying where he fell on the floorboards. Two withered feet suddenly step right up to the bed. Something drops onto the floor inches in front of Norman’s face with an unpleasant SLAP. Norman’s eyes bug out as he realizes it is a zombie’s dislodged ear. A weltered arm reaches down to grope around for the body part, until Norman pushes the ear, as carefully as he can manage, back into the zombie’s fingers. The hand retreats back out from under the bed. There is a loud SCREAM as Alvin, unable to contain himself any longer, jumps out from his hiding place and makes for the door. The corpses look up as he disappears down the hall, then stagger after him. Norman takes this chance to follow, but the Dead Judge blocks his exit. They both stand quite still, staring into each others’ eyes. The corpse tilts its head, almost quizzically, and its eyes widen as it notices the book under his arm. Norman steps sideways to run past it, but the corpse does too. Both it and Norman step one way, then the other, and back again. Norman feigns one direction and quickly bolts in the other, past the corpse and out the door. INT. MR PRENDERGHAST’S HOUSE, HALLWAY - CONTINUOUS 59   59  Alvin reaches the front door and throws it open. Directly in front of him is another zombie on the doorstep, opening a mouth full of jagged teeth. Alvin SCREAMS like a little girl, smacks it ineffectually with his spatula, and the door is abruptly SLAMMED in the zombie’s face, a surprised and muffled GROAN coming from the other side.  ParaNorman   43.",
      "characters": [],
      "action_text": "Alvin, still screaming, looks down to see Norman beside him, leaning against the door. The Dead Judge leads the advance of zombies down the hall toward them. Norman hears his MOAN. Norman swings the door back open, the zombie on the other side moving with it, teeth firmly embedded in the wood. As it attempts to pry itself free, Norman grabs Alvin by the arm and they both dart onto the porch behind its back, headed for the road. NORMAN Come on! INT. MITCH’S VAN - SAME 60   60  Mitch drives along dark roads. Neil sits behind him looking bemused while Courtney, in the front passenger seat, extols her life history. COURTNEY And she said I could totally consider a career in formation swimming. But I was like, “I wanna do something that helps people less fortunate than me”, thank you very much, y’know, like the poor or people who are like dying or ugly or something, ‘cuz I really think that ecology and world peace are like totally important today. Do you use free weights? Your deltoids are   huge . MITCH I’ve never used deltoids in my life, I swear. You can test me. Neil lies back in his seat, eyes rolling. NEIL Kill me now. COURTNEY Thank you for doing this Mitch. He means an awful lot to me. I love him like he was a brother. NEIL He   is   your brother. Courtney counters the backseat barbs by smiling demurely, but Mitch’s attention has been drawn by something else. MITCH Whoa! Look at that sky!  ParaNorman   44.  CONTINUED: 59   59 The wooded hill rises steeply a few miles in front of them, and at its top is the old chapel. Pressing down upon it, huge seething thunderclouds shift into otherworldly shapes. Mitch and Courtney are mesmerized. Neil suddenly points past Mitch’s face. NEIL Look out! Mitch slams on the breaks, twisting the wheel. MITCH Oh no! I/E. MITCH’S VAN ON WOODED ROAD - CONTINUOUS 61   61  Running down the middle of the road, blinded by the glare of the van’s headlights, are Alvin and Norman. The van swerves around them and grazes the trees, the side mir",
      "dialogue_count": 0,
      "word_count": 918
    },
    {
      "scene_number": 7,
      "slugline": "EXT. WOODED ROAD - CONTINUOUS 63   63  Mitch climbs out of the van and sees the figure lying still on the moonlit road. He nervously jogs over to it. As he gets closer, Mitch can see the man more clearly. He is wrapped in filthy tattered clothing of a bygone era and is covered in dirt. Flies BUZZ around him. MITCH Er... hello, sir? He hunkers down and is immediately hit by the stench. A mud-encrusted face stares up at him. ANGLE ON the van, as Courtney leans her head out. COURTNEY Is he dead or what? MITCH I... I don’t know! He’s not moving! The figure’s head lets out a faint GASP. MITCH (CONT’D) He’s still breathing! Mitch reaches out to gently lift the figure’s head but as he does, there is a CRUNCH and it comes off in his hands. COURTNEY So he’s okay? MITCH Uh... not exactly. COURTNEY What? What did you just say? Mitch looks from the head back to the van, then at the head again. He licks his lips nervously as he thinks. MITCH Does anyone know CPR? Further down the road, Norman runs back toward the van, Alvin still in tow. He sees Mitch ahead of him, getting dizzily to his feet, still holding the head. NORMAN Run! The head in Mitch’s hands suddenly GASPS again, opening its mouth. Mitch SHRIEKS as the headless figure on the road sits up and reaches out its arms. Mitch drop kicks it like a football. It flies, WAILING, into the bushes.  ParaNorman   46.",
      "characters": [],
      "action_text": "As if struck by the same blow, the rest of the corpse staggers backwards. Alvin and Norman run past him toward the van, bustling past Courtney and clambering inside. More corpses are emerging from the trees on either side of the road. She SCREAMS and leaps back into the van, as Mitch leaps into the driver’s seat beside her. INT. MITCH’S VAN - CONTINUOUS 64   64  MITCH Did you see that? COURTNEY That was   insane ! MITCH I know, right? I kicked that like a hundred yards! COURTNEY Norman, what just happened?! ALVIN  Zombies ! I swear, okay? We saw them burst out of their graves!  For real ! He realizes Mitch and Courtney are staring at him, and tries to disguise his raw panic with nonchalance. ALVIN (O.S.) (CONT’D) (to Courtney) Just so you know, I totally saved his life, and I could   totally   save yours. COURTNEY (O.S.) Sorry,   who   are you? ALVIN (O.S.) I’m Alvin. I’m in his class. Norman, not so easily distracted from the problem at hand as the others, glances uneasily through the window. NORMAN’S POV - The zombies lurch arthritically toward the van, GROANING and GURGLING. NORMAN Uh, guys... maybe we should actually drive away now. MITCH Oh, right.  ParaNorman   47.  CONTINUED: 63   63 Mitch starts the engine with a YELL, just as the nearest zombie leers in through the window. EXT. WOODED ROAD - CONTINUOUS 65   65  CLOSE ON the front wheel, spinning and SQUEALING. The van spits out a cloud of exhaust fumes as it accelerates away. A beat as the smoke clears. The soot-covered zombies SPLUTTER as they cough up what’s left of their lungs. They turn from one to the other, awaiting direction from their leader. But the Dead Judge is nowhere to be seen. A zombie points down the winding road where the woods eventually thin out into leafy suburban drives. The ragged shape of the Judge is clinging to the back of the van, thrashing around and WAILING as it picks up speed. The zombies quietly watch until the van moves out of sight behind the trees, then turn their attention",
      "dialogue_count": 0,
      "word_count": 786
    },
    {
      "scene_number": 8,
      "slugline": "INT. MITCH’S VAN - CONTINUOUS 71   71  Courtney lets out an infuriated GROWL. COURTNEY I just   knew   something like this was going to happen tonight! MITCH You did? Wow, ‘cos that zombie bit really   threw   me. Courtney turns in her seat and glares at her brother. COURTNEY Why d’you have to go and get everyone involved in all your  weird   stuff?! NORMAN Well, you weren’t supposed to follow me, were you? NEIL Sorry. My fault. When I’m nervous  I get mouth diarrhoea. ALVIN Ha ha! Diarrhoea! COURTNEY Oh my gosh, I think I’m having an aneurism! This is so   typical   of you! NORMAN You don’t understand! I’m the only one who can stop this, Courtney! COURTNEY Oh, I understand! I understand that this is all getting completely out of... The van’s sunroof is suddenly ripped open, and the Dead Judge’s arm reaches down into the vehicle, clawing inches above Courtney’s head. COURTNEY (CONT’D)  ...HAND!  The Dead Judge leans further into the van, MOANING horribly. He seems to have his sights set on Norman, and reaches one arm down toward Norman and the book peeking out of his shoulder bag. Norman shrinks back as the zombie GROANS horribly.  ParaNorman   49.",
      "characters": [],
      "action_text": "Alvin disappears behind the back seat with a WHIMPER, but Neil valiantly leaps into the fray, wrestling the clawing fingers away from his friend. NEIL  Whaddawedo? Whaddawedo? Mitch?!  MITCH I don’t know! I don’t know! NEIL You’re the oldest! MITCH Not   mentally ! Mitch hears a SIREN wail out behind him, and looks in his mirror to see the flashing light of Hooper’s bike. MITCH (CONT’D) Oh great. The cops. Hooper pulls level with the passenger seat window, waving angrily. SHERIFF HOOPER Pull over the vehicle! The Dead Judge leans further into the van, Neil hanging off him like a pendulum. COURTNEY Norman! How do we stop them?! Norman looks again at the book in his hands. NORMAN I’m supposed to read from the book at the witch’s grave! NEIL We’ve got to go back to the  graveyard ? NORMAN She wasn’t buried with the others. I don’t know where else to look... COURTNEY Well you better think of something quick! Norman wracks his brain. NEIL I have an idea!  ParaNorman   50.  CONTINUED: 71   71",
      "dialogue_count": 0,
      "word_count": 375
    },
    {
      "scene_number": 9,
      "slugline": "INT. SALMA’S BEDROOM - NIGHT 75   75  Salma sits at her computer in an immaculately tidy bedroom. Even her collection of dolls are flawlessly groomed and sit on a shelf looking like they’re waiting to be called in for an interview. Salma talks into her cell phone with an expression of withering disdain. SALMA So Norman, let me get this straight; you guys all go on this big supernatural adventure and you’re calling me in the middle of the night because you need someone to help you do your homework?  INTERCUT KIDS IN THE VAN/SALMA Norman talks into his cell phone, occasionally ducking as Neil’s flailing limbs are shaken from side to side by the GROWLING upside down zombie hanging above their heads. NORMAN Uh... yeah. EXT. WOODED ROAD - CONTINUOUS 76   76  Hooper steers her bike closer and swings her backside into the side of the van in an attempt to ram it off the road. The van lurches, flipping the Judge up and over the front of the vehicle, planting his face with a SQUELCH against the windscreen. INT. MITCH’S VAN - CONTINUOUS 77   77  Neil drops back down onto his seat. The Dead Judge’s arm, torn off at the shoulder, is still clutched in his hands. He stares down at it, wide-eyed, as it wriggles like an animal in his grasp. The Dead Judge slides slowly down the windscreen of the van with a dull SQUEAK. COURTNEY Mitch, do something! Mitch flicks on the windscreen wipers, which wipe the zombie’s rotten flesh from side to side across the glass. Mitch and Courtney’s eyes follow the Judge’s movements from side to side.  ParaNorman   51.",
      "characters": [],
      "action_text": "Behind them, Neil SQUEALS as the dismembered arm crawls all over him, fingers scuttling like a spider’s legs. The arm frees itself from Neil and turns on Norman, leaping at him like a viper. Norman holds the book up as a shield, and manages to swat the zombie arm away, flipping it across the front seat, where it lands on the back of Mitch’s neck. Mitch SCREAMS as the rotten hand clamps down onto the top of his head, and madly tries to shake it off. It hangs onto him grimly, bony fingers hooked around his nostrils. With Mitch no longer steering, the van swerves crazily across the road, shaking the Dead Judge off the windscreen. He disappears under the front of the vehicle, his one remaining arm clinging onto the underside. INTERCUT KIDS IN THE VAN/SALMA Norman shouts pleadingly into the phone as he and Neil are flung violently from side to side across the back seat. NORMAN Salma! We need to find out where the witch is buried! I went to the old graveyard but her grave wasn’t there! SALMA Well, duh. People found guilty of witchcraft weren’t considered people anymore. Norman, your witch was buried someplace else... in an  unmarked grave ! (reproachfully) If you cared to pay attention some of the time, you would know that we covered this in fifth grade history class. NORMAN Salma! Please! Hurry!   Y’know, I would Google this myself if there wasn’t a 300 year old dead guy trying to rip my face off!  With a SIGH, Salma types at her computer. SALMA Okay. It says here she was tried in the old Town Hall on Main Street. There may be a record of her execution and burial in their archives.  ParaNorman   52.  CONTINUED: 77   77 Norman listens intently then shouts over to Mitch, still struggling with the zombie hand gripping his face. NORMAN Quick! She said go to the Town Hall! EXT. WOODED ROAD - CONTINUOUS 79   79  Mitch hangs a sharp right and accelerates off the road and into thick undergrowth, sending up showers of twigs and thorns. Close on his heels, Hooper swerves her bike ",
      "dialogue_count": 0,
      "word_count": 852
    },
    {
      "scene_number": 10,
      "slugline": "EXT. WOODS - CONTINUOUS 83   83  Mitch swerves his van down the hill toward the more affluent suburbs of the town. Hooper’s police bike bounces along behind them, red light flashing and SIREN wailing. INT. STATION WAGON, NEARBY ROAD - CONTINUOUS 84   84  Perry and Sandra Babcock are driving home from their evening out. Neither look especially happy. SANDRA BABCOCK I really think it might help if you tried to see things from his point of view. PERRY BABCOCK I don’t want to. INT. STATION WAGON - CONTINUOUS 85   85  The Babcocks’ discussion continues as they drive. SANDRA BABCOCK Perry, not believing in the Afterlife is like not believing in Astrology. PERRY BABCOCK I have no idea what you’re talking about. Seriously, where did you learn that? SANDRA BABCOCK Calm down. Perry rolls his eyes and GROANS. EXT. SUBURBAN STREET - CONTINUOUS 86   86  Mitch’s van explodes out of the thinning woods and back on to the winding hill road. Hooper careens through the trees behind it, but fails to make the turn and smashes through a fence across the other side of the road into a suburban back yard, splinters of fence showering down in her wake. Scattering lawn ornaments, plastic garden toys and deck furniture, Hooper rides directly up a kids’ slide, shooting high up into the air like a rocket.  ParaNorman   54.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 226
    },
    {
      "scene_number": 11,
      "slugline": "EXT. SUBURBAN INTERSECTION - CONTINUOUS 87   87  Preceded by an ear-splittingly guttural WAIL, Mrs Henscher runs through the streets, waving her arms about hysterically. Moments later, the Babcocks’ station wagon pulls around the corner. EXT. SUBURBAN INTERSECTION - CONTINUOUS 88   88  Mitch’s van SCREECHES through the intersection, swerving in front of the Babcock’s station wagon, which veers wildly as Perry brakes hard. He leaps out of the car as the van drives away. PERRY BABCOCK Delinquent drivers! Where are the police when you need them? Hooper’s bike hurtles through the air and bounces off the hood of the station wagon with a CRUNCH. Before Perry can react he is buried under the mass of Sheriff Hooper, dropping like a meteorite onto his head. INT. MITCH’S VAN - CONTINUOUS 89   89  The kids, hanging on for dear life, hear a loud CRUNCH from the back of the van. They all turn to see the van’s rear doors ripped open. Silhouetted in the space is the one-armed Dead Judge, cape muddied and torn from his crawling back out from the vehicle’s undercarriage. The zombie lunges toward the startled kids, and MOANS. Mitch turns his attention back to the road ahead, but too late, and he YELLS as green-faced Mrs Henscher runs SQUEALING into the van’s headlights. Mitch throws all his weight onto the wheel, tires SCREAMING as the van misses Henscher by inches. The violence of the turn flings the Dead Judge backwards like a slingshot, disappearing out of the doors and shattering into a dozen pieces as he SMASHES into the hard road. EXT. SUBURBAN BACK YARDS - CONTINUOUS 90   90  Having completely lost control, Mitch’s van ploughs through cookie-cutter back yards.  ParaNorman   55.",
      "characters": [],
      "action_text": "It bounces down the hill, flipping over and over, the kids inside tossed around like rag dolls. Somewhat the worse for wear, it eventually comes to a stop in a parking lot, neatly crashing into an empty space. EXT. PARKING LOT - CONTINUOUS 91   91  The kids clamber out of the far side of the van. MITCH Oh my gosh! I’m gonna be sick! COURTNEY Oh, I broke a nail! As Alvin climbs out, he gingerly holds up the Judge’s arm, as if it were a dead animal, and dangles it limply in front of his face. ALVIN Yeah! Alvin the zombie slayer! I got you... The hand suddenly bends back on itself, slaps him on the face, and as he SQUEALS it drops to the ground and skitters away into the shadows. Mitch sizes up what’s left of his van, and bids a tearful farewell. MITCH (whispers) Baby, I’m so sorry. You’ll be alright. We’re gonna get through this together. Courtney pouts moodily when she realizes the tender words aren’t for her. Norman looks up at the sky. A thick bank of cloud looms over the town, and in its center is the unmistakable otherworldly face, ebbing in and out of visibility, and grinning horribly. NORMAN Uh oh. C’mon! NEIL Oh yeah! Neil HUMS his very own action movie score as he runs to follow Norman out of the parking lot.  ParaNorman   56.  CONTINUED: 90   90 COURTNEY Perfect. Now the geeks are in charge. The kids make toward the parking lot exit. EXT. MAIN STREET ALLEYWAY - SOME TIME LATER 93   93  The town center retains even less charm when the sun goes down, and its remaining denizens are now drunk, high or looking for trouble. Provided one requires alcohol, junk food or pharmaceuticals, it’s the place to be. A ruddy-faced drunk, SLOB GUY, inserts a few coins in a vending machine at the end of an alley, and waits as the metal coil inside curls a candy bar toward the front of the machine. The man notices the approaching figures further down the back street and frowns. He turns back to the machine, waiting. The zombies draw closer, GROANING, and the man fidgets uncomfor",
      "dialogue_count": 0,
      "word_count": 3874
    },
    {
      "scene_number": 12,
      "slugline": "EXT. TOWN HALL, ROOFTOP - CONTINUOUS 123   123  Distraught, Norman bellows into the sky, waving the book angrily above his head. NORMAN  You horrible old witch! Is this what you want?  The roiling face above him seems to CACKLE mercilessly. EXT. TOWN HALL - CONTINUOUS 124   124  The mob begins to lurch to all new stupid conclusions as Norman waves his arms at the clouds. MRS HENSCHER  Necromancer!  FEMALE TOURIST This is all   his   doing! SANDRA BABCOCK Norman! Perry feels the shift in the crowd. They’re not just baying for blood. They’re about to start baying for his  son’s   blood. EXT. TOWN HALL, ROOFTOP - CONTINUOUS 125   125  Norman continues YELLING at the sky, waving the book. He madly flicks through the pages, attempting to read aloud over the ROARING wind. NORMAN Once upon a time in a far-off land there lived a king and queen... in  a magnificent castle... The horrible cloud face above him CACKLES monstrously, drowning out the story. NORMAN (CONT’D)  Why won’t you listen to me? Why are you doing this?!  The face in the clouds turns inside out as a tongue of lightning spits out. It SMACKS into the book held in front of Norman’s chest, lifts him up off his feet and throws him back onto the old timbers of the roof. The air is knocked out of Norman as, trailing smoke, he SMASHES through the wood into the fiery chasm of the building beneath.  ParaNorman   70.",
      "characters": [],
      "action_text": "CAMERA follows him as he plummets, SCREAMING, and is enveloped in thick black smoke. There is a loud THUD, and silence. INT. TOWN HALL, OLD COURTHOUSE - CONTINUOUS 126   126  Norman lies on the floor, shifting painfully. With some effort he sits up, rubbing his head. The book in his hand is now a blackened cinder with a large smoldering hole gouged through the middle. Norman realizes he is no longer inside the burning building. Around him indistinct shapes begin to pool into clarity. He is in the courthouse, but three hundred years ago, and a trial is about to begin. A crowd of onlookers gather around a platform at the head of the room where officious-looking gentlemen in austere Puritan clothing stand around a table. Two dour men in black skull caps are seated, an empty chair between them. Norman moves unnoticed through the crowd toward the platform. The hubbub of the townsfolk dies down. The imposing figure of Judge Hopkins, tall and august, marches out of a side chamber, steps up onto the wooden dais and seats himself silently between his solemn peers. He glares down at Norman with cold, humorless eyes. JUDGE HOPKINS Agatha Prenderghast of his Majesty's Province of Massachusetts... As the Judge’s voice continues, Norman sees played out against it a MONTAGE of the preceding court case. The notary stands up, waving a wad of testimonies. JUDGE HOPKINS   (V.O.) (CONT’D) ...on this day you have been arraigned for the horrible crime of   witchcraft ... A pale woman fiddles nervously with the ribbon on her bonnet as she is questioned by the Judge. JUDGE HOPKINS (V.O.) (CONT’D) ...witnessed by those whose testimonies have been heard. A wiry woman with a pinched face gestures fearfully with her arms as she recounts her evidence.  ParaNorman   71.  CONTINUED: 125   125 JUDGE HOPKINS (V.O.) (CONT’D) You have, by this court, been found   guilty ... NORMAN No! A young farmhand bows his head shamefully, as he adds further ammunition to the prosecution. JUDGE HOPKINS (V.O.) ...",
      "dialogue_count": 0,
      "word_count": 5910
    }
  ]
}