{
  "slug": "parks-and-recreation-202-the-stakeout-2009",
  "title": "parks and recreation 202 the stakeout",
  "genre": "action",
  "format": "series",
  "scenes_count": 6,
  "characters_count": 1,
  "characters": [
    "LESLIE"
  ],
  "total_words": 4695,
  "total_dialogue": 1,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. TOM’S VAN - MOMENTS LATER - N2 19   19  Leslie is watching out the window. LESLIE Oh, look.   Mark. EXT. ANN’S HOUSE - MOMENTS LATER - N2 20   20  Ann answers the door, holding her purse and coat. MARK Hey.   You ready to go? ANN ...No.   I need like an hour to get ready. MARK Seriously?   It starts in like... twenty... you’re joking. ANN (sighs) Boy, this is gonna be fun. MARK Hey, with a body like this, you don’t get brains, too. ANN (smiles) Ewww. INT. TOM’S VAN - CONTINUOUS - N2 21   21  From the POV of the van, we can see Ann and Mark talking. Then, a loud series of CLICKS.   CAMERA TURNS to see Leslie with her camera, long lens pointed directly into Ann’s house. TOM What are you doing? LESLIE (embarrassed, glance to camera) Just testing the lens. She snaps one quick, careless final shot in a random direction. LESLIE (CONT’D) It works. Tom and Leslie watch Mark and Ann drive off.  PARKS AND RECREATION   “The Stakeout”   [02002]   13. 1st Revised Yellow Shooting Draft   08/05/09  (CONTINUED)",
      "characters": [],
      "action_text": "TOM Whoa -- are they dating now? LESLIE No.   They’re just... going on a date. TOM Damn.   Brendanawicz is the man!   That hot chick from the newspaper, that hot chick from the post office, now that hot chick from the hospital... LESLIE You know Ann’s name. TOM That guy is my hero.   Nobody ever turns him down. LESLIE (small, proud) ...I did. Tom laughs. TOM Yeah. LESLIE I did! (forced nonchalance) We were both sort of drunk.   And he started to kiss me, and I just said, “Nuh- uh.   No sir, Mark Brendanawicz.” (proud) I guess I have really high standards. TOM Didn’t you sleep with him like five years ago? LESLIE Well, yes... look, Mark and I have a past.   It’s complicated.   Relationships are complicated, okay?   You’re married. You wouldn’t understand. Tom is quiet. LESLIE (CONT’D) I want to get married someday.   You’re so lucky that you’re married to a beautiful, successful doctor.  PARKS AND RECREATION   “The Stakeout”   [02002]   14. 1st Revised Yellow Shooting Draft   08/05/09  CONTINUED: 21   21  (MORE)  (CONTINUED) You guys going to have kids?   I’ll be their fun Aunt Leslie!   Knock dat bitch up! TOM Okay, listen.   I’m about to tell you something that nobody else knows. LESLIE (gasps) She’s already pregnant!   Congratulations! Congratulate dat bitch! TOM No.   Wendy and I... it’s not a real marriage. LESLIE (gasps) Wendy’s a man! TOM No.   Wendy’s Canadian.   It’s a green card thing.   We’re friends, and I helped her out.   She gets to work here in the States.   I get a smokin’ hot wife on my arm.   It’s win-win. LESLIE Oh!   Okay. (then) Wait, but you’re not from here either. TOM True.   I’m from South Carolina. LESLIE Oh!   Okay. (then) Wait, but where did you move to South Carolina from? TOM ...My mom’s uterus? LESLIE But you were conceived in Libya. TOM Wow.   No.   I was conceived in America. My parents are Indian.  PARKS AND RECREATION   “The Stakeout”   [02002]   15. 1st Revised Yellow Shooting Draft   08/05/09  CONTINUED: (2) 21   21  LESLIE (CONT",
      "dialogue_count": 0,
      "word_count": 1357
    },
    {
      "scene_number": 2,
      "slugline": "INT. TOM’S VAN - LATER - N2 26   26  Leslie, Tom, and Andy sit on bags of fertilizer.   Leslie and Tom keep watch out the windows.   They’re fading a little. Andy sits in the center of the van, talking up a storm. ANDY It’s really nice to have people to talk to.   I haven’t talked with anyone in weeks.   Except for the crazy rock fighting guy,   but all he wants to talk about is rock fighting.   You guys hang out with Ann a lot?   Ugh.   I miss her so much, it’s ridic.   How’s she doing? TOM Doing good tonight -- she’s out on a da-- LESLIE (interrupting, loudly) Ann is great.   But I bet she misses you. Leslie gives Tom a look. ANDY Promise me you guys won’t tell her I’m living in the pit and can see her window from my tarp? Tom looks at him, shakes his head. LESLIE We promise. (shoots back a Pixie Stick) Whoo!   I’m going to need another box of these to get through the night. ANDY Is that a Pixie Stick? LESLIE Yeah, you want one? ANDY God, yes.   I’ve only eaten fruits and vegetables for weeks. Leslie gives him one.   He shoots it back. ANDY (CONT’D) Whoa, sugar rush.   Whoa.   Sugar rush. Sugar rush head!   Sugar rush head!  PARKS AND RECREATION   “The Stakeout”   [02002]   21. 1st Revised Yellow Shooting Draft   08/05/09  (CONTINUED)",
      "characters": [],
      "action_text": "He grabs his head and shakes it back and forth.   Leslie watches him, concerned. LESLIE How about we go get you something more substantial to eat? ANDY Awesome idea.   And you know what?   Food’s on me.   If I can just find that dang credit card... Andy slowly fake-searches his pockets for his “credit card.” EXT. ANN’S HOUSE - LATER - N2 27   27  START ON Andy and Leslie disappearing around the corner. PAN OVER to a SPY SHOT on a long lens of Tom outside the van, stretching his legs.   He tries to get back into the van, but the door is locked.   He pats his pockets for the keys -- but the keys are in the car. TOM You gotta be kidding me. WHIP OVER to see Mark is dropping Ann off. ANN So... that was fun. MARK Yeah. ANN Surprisingly fun. MARK Wow.   Clearly I inspire low expectations. ANN (cheery) But you met those low expectations.   And that’s what’s important. MARK You know, I have been a perfect gentleman this evening.   Watch: ask me in for a nightcap. ANN Not a chance.  PARKS AND RECREATION   “The Stakeout”   [02002]   22. 1st Revised Yellow Shooting Draft   08/05/09  CONTINUED: 26   26  (CONTINUED) MARK Just... ask me in for a nightcap. ANN ...Would you like to come in for a nightcap? MARK Yes.   ...Damn!   I really wanted to say no.   I was planning to say no.  PARKS AND RECREATION   “The Stakeout”   [02002]   22A. 1st Revised Yellow Shooting Draft   08/05/09  CONTINUED: 27   27  (CONTINUED) Ann laughs, then looks concerned. MARK (CONT’D) What?   I was kidding. ANN No -- look over there.   Is that guy breaking into that van? They look toward Tom’s van.   A hooded figure (Tom) is struggling with the door handle.   The top of the window is cracked open.   He’s putting a stick through the crack, trying to unlock the door from the inside. MARK Looks like it.   No big deal.   Hang on. Mark takes out his cell phone.   Dials. ANN What are you doing? MARK (into phone) Hi, I’m on the corner of Sullivan and Collins.   A guy’s trying break into a van over here... EXT. SI",
      "dialogue_count": 0,
      "word_count": 1187
    },
    {
      "scene_number": 3,
      "slugline": "EXT. PIT - LATER - N2 32   32  Leslie and Andy return with bags of fast food.   Leslie has her arm around Andy, whose face is streaked with tears and mustard. ANDY The crazy thing is, I called this.   That night he fell in the pit and she helped him, I was like, “she’s into that guy.” She couldn’t stop touching him. LESLIE She was bandaging his shoulder. ANDY She’s a nurse -- that’s like foreplay for nurses. They get to where the van is, and immediately see that something is wrong.   Because the van is being towed. LESLIE What?   No, no, no... Leslie and Andy run up to the tow truck.   A tow truck DRIVER is completing some paperwork. LESLIE (CONT’D) Excuse me, there was a guy in there -- where is he? DRIVER The cops took him. LESLIE Cops?   Why?   Oh God -- we have to go get Tom. (looks around) Andy? Andy is rushing off in a different direction. ANDY (intense whisper) It’s Ann and Mark! Leslie looks around as Andy disappears into the pit. ANN (O.S.) Leslie!   Hey! Ann and Mark walk over to Leslie, excited.  PARKS AND RECREATION   “The Stakeout”   [02002]   25. 1st Revised Yellow Shooting Draft   08/05/09  (CONTINUED)",
      "characters": [],
      "action_text": "MARK We caught a criminal! ANN He was trying to steal this van.   They dragged him away -- it was crazy. (beat) Wait -- what are you doing here? Off Leslie’s face, trying to sort this all out...  END OF ACT TWO  PARKS AND RECREATION   “The Stakeout”   [02002]   26. 1st Revised Yellow Shooting Draft   08/05/09  CONTINUED: 32   32 ACT THREE  EXT. POLICE STATION - LATER - N2 33   33  Leslie, Ann, and Mark practically run out of Mark’s pickup. INT. POLICE STATION - MAIN AREA - MOMENTS LATER - N2 34   34  Leslie, Ann, and Mark talk with Dave. DAVE Ma’am, as I have told you now several   *  times, this is a police matter.   *  LESLIE   *  Well, it doesn’t seem to matter very much   *  to the police!   *  DAVE   *  (weary)   *  Okay.   Nice job, with that.   But please--   *  LESLIE   *  Is it the policy of the Pawnee police department to arrest a man for trying to get into his own van? DAVE No, and thankfully, that’s not what   *  happened.   So why don’t you just go home,   *  get some sleep, and allow this matter to   *  be resolved. Beat.   Leslie fumes.   Then: LESLIE (temper tantrum) Nnnnnnno!   No no no! ANN Leslie-- MARK   *  Easy, easy--   *  Dave steers Leslie into another room... DAVE (to Leslie) Okay, let’s just... let’s go in here... LESLIE I’m not going anywhere!   This is just like that Gates thing!  PARKS AND RECREATION   “The Stakeout”   [02002]   27.  1st Revised Yellow Shooting Draft   08/05/09",
      "dialogue_count": 0,
      "word_count": 458
    },
    {
      "scene_number": 4,
      "slugline": "INT. POLICE STATION - PRIVATE ROOM - LATER - N2 35   35  Leslie and Dave sit at a table. DAVE   *  ...No, I did not “act stupidly.”   *  LESLIE   *  Okay, fine, I shouldn’t have said that.   *  Tell me what happened.   *  DAVE   *  I really didn’t want to arrest the guy.   *  I was on my way home, I’d already said   *  goodbye to everyone at the station... I   *  knew if I came back they were gonna go,   *  “Hey -- can’t get enough of this place,   *  huh?”   And I’d have to laugh... I hate   *  that.   But your friend was being an ass.   *  I promise you, I didn’t have a choice.   *  LESLIE Your name is Dave, right?   Can I call you Dave?  PARKS AND RECREATION   “The Stakeout”   [02002]   27A. 1st Revised Yellow Shooting Draft   08/05/09  (CONTINUED)",
      "characters": [],
      "action_text": "DAVE   *  Sure, or “David.”   My mom likes “David.”   *  It’s fifty-fifty to me--   *  LESLIE Well, listen, Dave.   You’ve really stepped in it. DAVE What? LESLIE I’m a government employee, David.   And so   *  is your prisoner.   Do you have any idea how serious this is?   You do not want me to take this upstairs. DAVE Upstairs? LESLIE In two seconds, I could get on the horn and have Ron Swanson kicking down these doors.   That’s right, you heard me: Ron Swanson. INT. RON’S OFFICE - LATER - N2 36   36  Ron sits patiently.   The lights in his office, on a motion- sensor, turn off. RON (in the dark) Damn.   Motion sensors. INT. POLICE STATION - PRIVATE ROOM - LATER - N2 37   37  Dave is trying to take this in. DAVE Who’s Ron Swanson?   Sorry, I just moved here-- LESLIE Well, trust me, Dave.   If you don’t release my colleague immediately, God help me, I will have State Senators banging down your door. DAVE ...What branch of government are you in? A beat.  PARKS AND RECREATION   “The Stakeout”   [02002]   28. 1st Revised Yellow Shooting Draft   08/05/09  CONTINUED: 35   35  (CONTINUED) LESLIE (small) Parks and Recreation? Dave smiles a tiny bit. DAVE Here’s the thing, Ms. Knope.   It actually   *  wasn’t just his behavior -- I think your   *  friend’s kind of a pervert.   *  LESLIE   *  A lot of people think that about Tom, but   *  when you get to know him--   *  DAVE   *  No, I’m serious.   When we searched the   *  vehicle, we found some very strange stuff.   There were huge bags of manure,   *  two professional cameras with pictures of   *  people on a date...   *  He puts pictures of Mark down on the table.   Leslie grimaces.   *  DAVE (CONT’D)   *  There was also a disturbing amount of candy in there... I don’t know.   One way   *  or the other, he’s spending the night in jail. Leslie takes a deep breath. LESLIE Look, Tom and I were in that van together.   We were staking out a community garden, to catch who planted marijuana in it.   The candy was mine, and the",
      "dialogue_count": 0,
      "word_count": 590
    },
    {
      "scene_number": 5,
      "slugline": "INT. POLICE STATION - MAIN AREA - LATER - N2 38   38  The clock on the wall shows that it’s almost 2am.   Leslie comes back out.   Ann and Mark stand up, hopeful. LESLIE They’re releasing him.   They said it might be a while, but they’ll get him home safely.  PARKS AND RECREATION   “The Stakeout”   [02002]   29A. 1st Revised Yellow Shooting Draft   08/05/09  (CONTINUED)",
      "characters": [],
      "action_text": "ANN Oh, thank God. MARK Well, let me get you guys home. Ann starts to put on her jacket. LESLIE Actually, you two go on ahead. ANN Are you sure? LESLIE I want to wait here for Tom.   Prison changes a man.   Tom will want to see a familiar face when he’s back on the outside. LESLIE TALKING HEAD 39   39  On the bench in the police station. LESLIE I couldn’t go to sleep now, anyway.   Too much to think about. (then) Plus I’ve had like twenty-five Pixie Stix. INT. RON’S OFFICE - LATER - N2 40   40  Ron hasn’t moved.   April appears in the doorway.   The lights click on. APRIL Hey.   Had to wait ‘til my dad fell asleep, so I could steal his keys.   You ready? RON I was born ready. INT. PIONEER HALL - HALLWAY - MOMENTS LATER - N2 41   41  April wheels Ron in his office chair down the length of the extremely long hallway. RON Ow.   Easy.   Ow.   Careful.  PARKS AND RECREATION   “The Stakeout”   [02002]   30. 1st Revised Yellow Shooting Draft   08/05/09  CONTINUED: 38   38",
      "dialogue_count": 0,
      "word_count": 245
    },
    {
      "scene_number": 6,
      "slugline": "EXT. ANN’S HOUSE - LATER - N2 42   42  Mark drops Ann off.   He opens the door for her, and they stand on the sidewalk. MARK (quickly) Don’t invite me in.   Bad things happened last time. Ann laughs. ANN Let’s never do that again. MARK See you tomorrow. Mark leans over and kisses her on the cheek/corner of the mouth. ANN Hey.   You kind of kissed me. MARK Yeah, I did! (cheery) Now we both have herpes!   See you tomorrow! Ann laughs, as he heads off. WHIP OVER TO Andy watching from the edge of the pit, devastated.   There’s nothing he can do.   He plucks at a plant next to him, chews on it... Spits it out.   It’s bitter.   He looks down, notices what he’s sitting in: the weed patch. Andy looks back up at Ann, watching Mark drive away.   Then back down at the weed... INT. POLICE STATION - MAIN AREA - VERY EARLY MORNING - DAY 3 43   43  Leslie is fast asleep on the bench.   She has a police officer’s jacket draped over her like a blanket.   Tom comes into the room, not expecting anyone there, and sees her.   A sweet moment -- he’s touched that she stayed. Leslie stirs. TOM Hey.   Thanks for waiting.  PARKS AND RECREATION   “The Stakeout”   [02002]   31. 1st Revised Yellow Shooting Draft   08/05/09  (CONTINUED)",
      "characters": [
        "LESLIE"
      ],
      "action_text": "Leslie is moved. LESLIE Tom... TOM I didn’t mean me.   Keep it in your pants, Knope. Tom walks to Leslie’s car and climbs in. EXT. PIT - COMMUNITY GARDEN - MOMENTS LATER - D3 45   45  Dave and Leslie search around.   There’s just a bunch of carrots, some patted-down soil, and several burger wrappers. LESLIE I swear, it was right here... Dave kneels down, pulls up a plant. DAVE These are carrots. LESLIE Um yeah, duh.   I think I know the difference between carrots and marijuana. She gives a quick glance to camera. DAVE Uh-huh.   So, that house up there?   Is that the one where your best friend lives?   Where she saw the van from? LESLIE ...Yes. Dave stands. DAVE Okay.   I get it. LESLIE What? DAVE Well, you wanted to check up on your friend and that guy.   Your ex.   So you made up a story about weed so you could stakeout their date. LESLIE No, there really was--  PARKS AND RECREATION   “The Stakeout”   [02002]   33. 1st Revised Yellow Shooting Draft   08/05/09  CONTINUED: 44   44  (CONTINUED) DAVE It’s okay.   I think it’s kind of cute. Leslie smiles. DAVE (CONT’D) Listen... I may need to come by and see you.   As a follow-up, for the police report. LESLIE This isn’t over?   Oh God.   Poor Tom. DAVE No -- Leslie.   I’m trying to say that I might want to drop by and see you. Not... for my job.   Is that okay? LESLIE Oh.   Yes.   Absolutely. Dave walks back to his car, and Leslie to hers. EXT. PIT/INT. LESLIE’S CAR - MOMENTS LATER - D3 46   46  ANGLE ON: Tom is already asleep, mouth open, cheek pressed up against the window.   Leslie gets in. LESLIE It’s been kind of a crazy night, huh, partner? (beat) Whattya say you and I go get some breakfast? TOM What?!   No!   Take me home! LESLIE Okay.   Or we could just go into work. TOM No!   What is wrong with you? Leslie drives off, as we see the sun come up... LESLIE (O.S.) I wonder if mini golf is open. TOM Home!!!!!!  END OF ACT THREE  PARKS AND RECREATION   “The Stakeout”   [02002]   34. 1st Revised Yellow Shooting Draft",
      "dialogue_count": 1,
      "word_count": 858
    }
  ]
}