{
  "slug": "parks-and-recreation-102-canvassing-2009",
  "title": "parks and recreation 102 canvassing",
  "genre": "drama",
  "format": "series",
  "scenes_count": 3,
  "characters_count": 3,
  "characters": [
    "MARK",
    "LESLIE",
    "RON"
  ],
  "total_words": 3239,
  "total_dialogue": 3,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. NEIGHBORHOOD - STREET - LATER - D1  SPY SHOT: Tom watches one of his fleet, RANDY, eating one of  his CANDY BARS.   He chews, guiltily.  TOM  Randy!   Come on, man!  (he takes the bar)  Never eat the merch.  Tom gives each kid a SLICE OF BREAD.  TOM (CONT’D)  Here you go.   Fill up the tank.  The kids eat the bread.   Tom notices the camera.   He groans.  TOM TALKING HEAD  TOM  It’s the main problem with the business  model.   You give a kid candy to sell,  he’s gonna be tempted.   What’s the  answer?  (holds up slice of white bread)  Hundred calories, tons of carbs for that  long-lasting power boost, and none of  that healthy taste kids hate.   Plus, it  expands in their stomachs, so they fill  up quick.   For the huskier kids--  (holds up three stacked slices  of white bread)  Bread sandwich.  ANN AND MARK TALKING HEAD  ANN  So, it turns out we were basically  drumming up opposition.  B-roll: Ann and Mark leaving various doors, indicating “no”  to the camera, eventually slipping a flier under a door and  quickly leaving.  ANN (V.O.) (CONT’D)  Telling people about the project, then  telling them exactly when and where they  could complain about it.  Back on camera.  ANN (CONT’D)  Then we realized something that changed  our game plan.  PARKS AND RECREATION   “Canvassing”   [01003]   21.  Table Draft   03/09/09  (CONTINUED)",
      "characters": [
        "MARK",
        "LESLIE"
      ],
      "action_text": "ANDY  Oh yeah.   Sorry.  Andy reaches for the nearest thing -- a cereal box -- and  places it over his crotch.   It doesn’t do much.  Ann brings in glasses of ICED TEA.   Mark sips his and sighs.  MARK  This is so much better than knocking on  people’s doors.  ANN  Yeah.  ANDY  Hey, bro, you play Rock Band?   Drums are  wide open.   I’d offer bass, but it got  broken when I smashed it.  Mark looks at a FRACTURED, SMASHED ROCK BAND BASS on the  floor.  MARK  I’m good, thanks.  ANDY  “I’m good” like you suck, or “I’m good”  like you’re scared ‘cause I’m a  professional musician and you’ll get  crushed?  (then)  I’m just kidding you.  (to Ann)  I like this guy!  MARK  And I like you!  Ann looks a little unsure.  INT. FRED’S HOUSE - LATER - D1  Leslie and Fred drink coffee and eat little cookies.  LESLIE  ...And that is why there is no better use  for that lot.   What’s more American than  a park, Fred?  FRED  Leslie, it sounds like a good idea.  PARKS AND RECREATION   “Canvassing”   [01003]   23.  Table Draft   03/09/09  CONTINUED:  (CONTINUED) MARK  Then don’t.   So, what’s your story?  ANN  What story?  MARK  You and Andy.   How’d you meet?   Gaming  convention?   You meet on-line?   You guys  play Xbox Live against each other?  She gives him a look.  ANN  No, we got set up by a girlfriend of mine.  MARK  Huh.   What’d you do to   her ?  He chuckles.   Ann doesn’t.   He stops.  ANN  Okay.   Bye bye.  MARK  Come on.   I’m kidding.  ANN  Bye, Mark.   I’ll see you tomorrow.  She gets up and walks back into the LIVING ROOM and plops  down next to Andy.   Mark sits uncomfortably, trying to smile  to the cameras a little.  ANDY  Hey, babe.  ANN  Hey.   Let’s do “Gimme Shelter.”   I’ll  sing.  ANDY  Nice!  Mark gets up and makes his way awkwardly to the door.  MARK  (small)  Bye, guys.  ANDY  Later, man.  PARKS AND RECREATION   “Canvassing”   [01003]   25.  Table Draft   03/09/09  CONTINUED:",
      "dialogue_count": 2,
      "word_count": 922
    },
    {
      "scene_number": 2,
      "slugline": "INT. FRED’S HOUSE - LATER - N1  Fred is fast asleep, his chest rising and falling.   Leslie  has dimmed the lights, and speaks quietly to not wake him up.  LESLIE  (to camera)  I’ve been here for four hours.   I’m not  leaving.   I mean, it’s only 7:15.   This  has got to be a nap.  (quietly)  Fred?  (louder)  Fred?  (beat)  Fire!  (beat)  He’ll wake up.   He’s so close to saying  “yes.”  EXT. NEIGHBORHOOD - STREET - LATER - N1  SPY SHOT: The kids gather around Tom, their ringmaster.  TOM  How we doing, guys?   Everybody good?  DUKIE  I’m tired.  RANDY  Yeah, I got homework.  TOM  Come on, guys, it’s dinner time --  everybody’s home.   Just give me one more  good hour--  He sees the camera like: “C’mon!   You guys are everywhere!”  TOM (CONT’D)  Okay, great work team.   Head on home, you  little scamps!   God love ya!  (as they drag ass home)  Stay in school!  INT. FRED’S HOUSE - LATER - N1  SPY SHOT: Camera looks through the window, into Fred’s living  room.   Fred is still asleep in the chair.   And on the couch,  curled up like a baby, is Leslie -- fast asleep.  END OF ACT TWO  PARKS AND RECREATION   “Canvassing”   [01003]   26.  Table Draft   03/09/09",
      "characters": [
        "RON"
      ],
      "action_text": "ACT THREE  EXT. FRED’S HOUSE - VERY EARLY MORNING - DAY 2  Leslie, bedraggled, stumbles out of Fred’s house and looks  around... disoriented...  EXT. PIONEER HALL - PARKING LOT - LATER - D2  Leslie pulls up and stumbles out of her car.  INT. LESLIE AND TOM’S OFFICE - LATER - D2  Tom is at his desk.   Leslie rushes in.   She looks like she  slept on a couch.   Because she slept on a couch.   She  frantically searches piles on her desk.  LESLIE  Where’s my gavel?  TOM  You smell like old man.  LESLIE  Darn it!  Leslie looks around, opens a closet and grabs a BIG GREEN  CAN.   She sprays herself with it, like perfume.  TOM  Now you smell like old man and carpet.  LESLIE  Sub-committee meeting.   Now.  INT. PARKS DEPARTMENT CONFERENCE ROOM - MOMENTS LATER - D2  Tom, Mark, and Ann sit around the table.   Leslie presides.  LESLIE  Tom, how’d you do?  TOM  Five or six, that’s all.  LESLIE  Good for you.   I only got a maybe.  TOM  Well, they might flake.  LESLIE  Mark, Ann?  PARKS AND RECREATION   “Canvassing”   [01003]   27.  Table Draft   03/09/09  (CONTINUED) ANN  Uh... I’m not sure we had anything  definite.  LESLIE  It’s just so frustrating.   We all worked  really hard!   We pounded that pavement  non-stop, all day yesterday.  Mark tries to look at Ann.   Ann can’t look at anyone.   She  glances at the camera, feeling terrible.  LESLIE (CONT’D)  Well.   Okay.   Thanks everybody.   I think  the best thing would be: if we delay the  forum for between one and ninety days.  ANN  You want to cancel the meeting?  LESLIE  Delay.   Because I have strep throat.  ANN  You do?   Let me see.  LESLIE  I don’t have strep throat.  MARK  You can’t cancel, Leslie.   You sent out  fliers; it was listed in the paper.  Those people are going to come.  LESLIE  (gaveling hard)  Dammit!  Everyone jumps, reacts.  LESLIE (CONT’D)  What a mess.  INT. PARKS DEPARTMENT OFFICE - PERMITS DESK - LATER - D2  April sits behind the desk, handing out permit applications.  Her attitude hasn’t changed, ",
      "dialogue_count": 1,
      "word_count": 2108
    },
    {
      "scene_number": 3,
      "slugline": "INT. LESLIE AND TOM’S OFFICE - LATER - N2  Leslie sits at her desk, happily spinning the globe.   Ann is  sprawled out on a chair, defeated.  ANN  Man, I don’t know how you do it.   It’s  way tougher than I thought, being on the  other side.  (small)  I’m sorry I gave up.  LESLIE  What?   You didn’t give up.   You’re here.  ANN  ...Yeah.   I’m here.  A beat.  LESLIE  Um.   Are you here ‘cause you need a ride  home?  ANN  No, I’ve got my car.  LESLIE  Oh.   (then)  So... we’re just... hanging out?  ANN  Yeah.   I mean, if that’s okay.  LESLIE  Yes!   Oh!   Yes, that’s... cool.  (She offers a bag)  Gorp?  ANN  Sure.  EXT. COURTYARD - MOMENTS LATER - N2  From outside, we see Ann hanging out in Leslie’s office,  eating gorp.   Leslie looks pleased.  END OF ACT THREE  PARKS AND RECREATION   “Canvassing”   [01003]   36.  Table Draft   03/09/09",
      "characters": [],
      "action_text": "TAG  EXT. ANN’S HOUSE - LATER - N2  Ann comes home, wiped out.   She notices something propped  against the door.   Picks it up.  It’s a new ROCK BAND BASS GUITAR, with a RIBBON and a NOTE  attached.   She opens the envelope.   Reads it, smiles  slightly.  She brings the bass inside.  END OF SHOW  PARKS AND RECREATION   “Canvassing”   [01003]   37.  Table Draft   03/09/09",
      "dialogue_count": 0,
      "word_count": 209
    }
  ]
}