{
  "slug": "parks-and-recreation-207-greg-pikitis-2009",
  "title": "parks and recreation 207 greg pikitis",
  "genre": "drama",
  "format": "series",
  "scenes_count": 5,
  "characters_count": 0,
  "characters": [],
  "total_words": 5878,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. PARKS DEPARTMENT OFFICE - CONTINUOUS - D1 ANN One more thing -- the people in this room, now, are the people I invited, so... just, don’t tell anyone else. APRIL (looking around) Who isn’t h-- Tom walks in. TOM Hey!   What’s going on, cupcake? ANN (camera aware) Nothing.   How are you? TOM Doing good.   Excited about the party tonight. ANN (glancing to camera) Oh... you’re coming?   Great.   I was just about to tell you about that. TOM Jerry already told me.   Can’t wait to see how small your costume is.   What time does it start? Ann glares at Jerry, who tries to hide his face. ANN Seven. TOM Perfect. ANN Yes.   Perfect. EXT. COURTYARD - MOMENTS LATER - D1 Leslie sits at the table working on something as three MAINTENANCE GUYS put up Halloween decorations in the courtyard.   Ann sits with her. ANN I’ll be so sad if you’re not there.  PARKS AND RECREATION   “Greg Pikitis”   [02008]   6.  Table Draft   09/29/09",
      "characters": [],
      "action_text": "LESLIE I’ll come as soon as I can.   But I have a full night of crime prevention ahead of me.   Check it out. She holds up what she’s been working on -- a MAP of the city with lots of ARROWS and MARKINGS and PATHS marked out. LESLIE (CONT’D) Every possible way Greg Pikitis can get from his house to the statue. ANN That looks like something you’d find on the wall of a serial killer. Leslie mulls that over. LESLIE In a way, that’s a compliment.   Shows dedication. ANN Is it really that big a deal?   So this kid TP’s some statue. LESLIE And all the trees, and all the benches. It takes us like ten days to clean his mess up.   But more importantly: Pikitis sucks, and I want to destroy him. ANN Well, if you destroy him early, please come by. LESLIE I will. Ann heads off.   Leslie yells at a MAINTENANCE WORKER. LESLIE (CONT’D) Hey!   How is anyone going to be able to walk through the door? Camera shows a MASSIVE GOB OF FAKE COBWEBS covering the entire entryway to the courtyard. MAINTENANCE WORKER Oh. Jerry, not looking, WALKS INTO THE COBWEB and SCREAMS. Leslie RUSHES OVER and helps him.  PARKS AND RECREATION   “Greg Pikitis”   [02008]   7.  Table Draft   09/29/09",
      "dialogue_count": 0,
      "word_count": 377
    },
    {
      "scene_number": 2,
      "slugline": "EXT. PARK - EARLY EVENING - NIGHT 1 Leslie stands at the statue of MAYOR PERCY with DAVE and ANDY.   Andy has his GUITAR CASE. LESLIE William Percy.   One of Pawnee’s greatest mayors.   And a true hero -- during the Pawnee Bread Factory fire of 1922, he rushed back into the burning building and saved the beloved secret recipe for Pawnee Pumpernickel! DAVE Didn’t like thirty people die in that fire? LESLIE (shrugs) He wasn’t Superman. ANDY He looks like a walrus, kind of. LESLIE Okay.   Andy.   Tonight, I am officially putting you on the Parks Department payroll.   Eight dollars an hour. ANDY Whoo! She hands him a picture of Greg Pikitis. LESLIE Commit this to memory, then burn it. Don’t burn it -- that’s insane.   Keep it.   You see this kid, you stop him. Knock his head off if you have to. DAVE Don’t do that. LESLIE Don’t do that.   But you have my permission to use excessive force. DAVE Don’t use excessive force.  PARKS AND RECREATION   “Greg Pikitis”   [02008]   8.  Table Draft   09/29/09",
      "characters": [],
      "action_text": "LESLIE Don’t go overboard.   But stop him. (quietly) By any means necessary. DAVE No. LESLIE No.   Just stop him. Leslie gives him a look: “Use excessive force.”   He nods. ANDY TALKING HEAD At the statue. ANDY A week ago, I had nothing.   Now I got a part-time job, and tonight I’m gonna make thirty-two bucks.   I owe Leslie everything I have. (beat) Which, after tonight, will be thirty- nine bucks. INT. ANN’S HOUSE - LATER - N1 Ann, dressed as RAGGEDY ANN, rushes around putting the finishing touches on her place.   It’s very well decorated. “MONSTER MASH” is playing from her stereo. The DOORBELL RINGS.   It’s RON, dressed as a PIRATE. RON Hello, Ann.   Am I early? ANN Right on time.   Come on in. RON I like your costume. ANN Raggedy Ann.   It was my favorite book when I was a kid.   I’m named after her. Beat. RON I’m a pirate. Beat.  PARKS AND RECREATION   “Greg Pikitis”   [02008]   9.  Table Draft   09/29/09 ANN So, there’s food over there-- RON (a little too loud and eager) Is there bacon wrapped shrimp?   By any chance? ANN No.   Oh -- you love that, don’t you? I’m sorry.   There’s candy... Ron looks crushed.   DR. HARRIS enters, dressed like a doctor. ANN (CONT’D) Hey, Dr. Harris! DR. HARRIS Ann. ANN Come on in.   This is Ron Swanson, from the Parks Department -- I know him from that thing I’m doing.   This is Dr. Harris, from my hospital. They shake. RON You’re a doctor. DR. HARRIS Yup. RON I meant, your costume. DR. HARRIS I got it.   Pirate? Ron nods.   Beat.   Awkwardness. ANN I’m going to check on the... She’s got nothing.   Walks off. ANN TALKING HEAD From her kitchen, with the two guys in the b.g. ANN Worlds colliding.   Always awkward.  PARKS AND RECREATION   “Greg Pikitis”   [02008]   10.  Table Draft   09/29/09",
      "dialogue_count": 0,
      "word_count": 482
    },
    {
      "scene_number": 3,
      "slugline": "INT. LESLIE’S CAR - LATER - N1 Leslie and Dave are watching through the windshield as GREG and some FRIENDS hang out in a parking lot, skateboarding. LESLIE (into a recorder) 8:22 PM.   Suspect still with friends in 7-Eleven parking lot.   Looks obnoxious and irritating, even at a great distance. DAVE How long are we gonna follow this kid? LESLIE All night, if we have to. DAVE I was kind of hoping we could go to Ann’s party.   That’s why I traded shifts. LESLIE This is kind of like a party.   Here -- I’ll put on some music. She hits a button on the stereo.   SPOOKY GHOST SOUNDS start playing -- chains rattling, etc. DAVE This is the CD you have in? LESLIE It’s Halloween!   What do you want, Christmas music? (into recorder) Suspect is laughing with friends in a snide, turdish manner. DAVE “Turdish?” LESLIE Yes.   Like a turd -- like a little turd. She puts down her binoculars. DAVE TALKING HEAD Outside the car.  PARKS AND RECREATION   “Greg Pikitis”   [02008]   11.  Table Draft   09/29/09",
      "characters": [],
      "action_text": "DAVE I called in a ton of favors and got out of my shift so I wouldn’t have to spend the night chasing after little punk kids who are out to cause trouble.   Then Leslie called and said, “Hey, can you help me with something?” INT. ANN’S HOUSE - LATER - N1 There are a few more PEOPLE in the house, but the party is pretty quiet.   LAME HALLOWEEN SONGS are still playing. APRIL, DEREK, and BEN enter.   She’s a HAPPY CLOWN with a big smiley face.   Ben is also a PIRATE, but it’s WAY MORE ELABORATE than Ron’s costume.   Derek is wearing a button-down shirt and tan pants. ANN Hey, guys! APRIL Hey.   You remember my boyfriend Derek, and his boyfriend Ben? ANN Yeah, hi. (to Derek) It’s totally fine that you didn’t wear a costume. DEREK I did.   I’m a straight person. MARK enters holding a bag with his costume in it.   He’s wearing exactly the same outfit as Derek. MARK Hey, honey. DEREK See? MARK Gotta change.   Be right back. He disappears. ANN Come on in.   Sorry it’s kind of lame right now.  PARKS AND RECREATION   “Greg Pikitis”   [02008]   12.  Table Draft   09/29/09 APRIL That’s cool.   I’m kind of into lame stuff in an ironic way right now.   I’m going to a botanical garden tomorrow. APRIL TALKING HEAD APRIL This Halloween party is dressed up as a funeral. INT. ANN’S HOUSE - MOMENTS LATER - N1 Ann and Mark.   He’s now dressed as an Indiana Pacer. ANN I spent the entire day decorating this whole house, and everyone just hangs out in the kitchen.   Why do people always just hang out in the kitchen?! In the b.g. we see that literally everyone is in the kitchen. MARK It’s going fine. ANN It’s a little quiet.   And all the nurses and doctors are just dressed as nurses and doctors.   That’s so lame. Camera sees, in the kitchen, a bunch of NURSES and DOCTORS in their usual work gear. ANN (CONT'D) Oh my God -- this party is flailing. Ron approaches with a fistful of Almond Joys. RON Ann, do you have any Mounds?   All I see are Almond Joys, and I hate those. Ann rubs her head. ",
      "dialogue_count": 0,
      "word_count": 4104
    },
    {
      "scene_number": 4,
      "slugline": "EXT. GREG’S HOUSE - LATER - N1 Leslie and Andy, giggling, are on the front yard of an average house. LESLIE This is so fun!   What do I do? ANDY Just take this toilet paper and throw it into the tree. They both start doing it. LESLIE This is for Mayor Percy!   And the Parks Department office!   And that time I caught you pooping on the handball court! ANDY This is for Leslie Knope! He starts EGGING the house. LESLIE (giddy) Yeah!   This is fun! (to camera, just as giddy) But I don’t condone it! INT. ANN’S HOUSE - LATER - N1 The party is wrapping up.   Various PEOPLE, all happy, walk out and say nice things to Ann. TOM Annie.   Thanks for hosting, sweetheart. ANN Dude.   Thank you so much.   I... I don’t even know what to say but “thank you.” TOM My pleasure. ANN And you know what else?   Your wife is super cool. TOM Oh yeah -- she’s great, right?  PARKS AND RECREATION   “Greg Pikitis”   [02008]   34.  Table Draft   09/29/09",
      "characters": [],
      "action_text": "ANN I really liked talking to her.   I don’t know how you landed that chick, but nice work.   She’s awesome.   You’re really lucky. Tom looks a tiny bit sad as Wendy comes up. ANN (CONT’D) Hey.   We were just talking about you. So nice to see you. WENDY You, too!   Thanks for everything. They hug.   Tom and Wendy leave.   Mark is the last one there. EXT. GREG’S HOUSE - LATER - N1 Leslie and Andy are still egging the house.   A CRUISER rolls up.   Dave gets out.   Andy sees him and JUMPS INTO THE BUSHES. ANDY Five-oh!   Five-oh! DAVE Leslie?   What are you doing? LESLIE Oh boy. The FRONT PORCH LIGHT goes on and a woman, EVELYN, comes out. EVELYN That’s them, officer!   Right there! Leslie panics. LESLIE Oh my God.   I am so sorry, ma’am.   I think we’re at the wrong house. EVELYN Why are you doing this?! LESLIE ...It’s hard to explain.   I’m getting revenge on this kid, Greg Pikitis, and I thought this was his house, but I guess I got the address wrong-- EVELYN I’m Greg’s mom.  PARKS AND RECREATION   “Greg Pikitis”   [02008]   35.  Table Draft   09/29/09 Beat. LESLIE You are? EVELYN Yes.   I’m Evelyn Pikitis. (beat) Oh God.   Did he hire a fake mom again, to get him out of trouble?   That little S.O.B.! She rushes back in the house.   Leslie, Dave, and Andy are stunned. LESLIE I.   Knew it! DAVE Oh my God. ANDY Dude.   That kid is amazing. Evelyn comes rushing back out. EVELYN He’s not in his room.   Damn it.   I am so sorry, for whatever he did.   But I don’t know where he is. Leslie realizes something. LESLIE I do. EXT. PARK - LATER - N1 Leslie, Dave, Andy, and Evelyn RUSH THROUGH the park and come upon the STATUE, where Greg and his BUDDIES are TPing and spray-painting the statue of William Percy. DAVE Hey! Greg whirls around.   Two of his buddies BOLT. LESLIE Let them go!   Stay on the leader! Dave grabs Greg, who smiles the smile of someone caught red handed.  PARKS AND RECREATION   “Greg Pikitis”   [02008]   36.  Table Draft   09/29/09 GREG Hey, Leslie.   Mom. ",
      "dialogue_count": 0,
      "word_count": 811
    },
    {
      "scene_number": 5,
      "slugline": "INT. PARKS DEPARTMENT OFFICE - LATER - D1 Greg TP’s the office, SPRAY-PAINTS on the wall, and DRAWS MOUSTACHES on Leslie’s pictures.   Then he LEAVES THE PEACH PIT on her desk. LESLIE (V.O.) Does he have a look-a-like, or something? EXT. COURTYARD - LATER - D1 Greg tosses the outfit, fake moustache, and backpack full of stuff into the trash can and walks out. LESLIE (V.O.) Oh well.   The point is, we caught him. On the way out, Greg catches a glimpse of the cameras.   He smirks and walks off.  END OF SHOW  PARKS AND RECREATION   “Greg Pikitis”   [02008]   39.  Table Draft   09/29/09",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 104
    }
  ]
}