{
  "slug": "parks-and-recreation-206-kaboom-2009",
  "title": "parks and recreation 206 kaboom",
  "genre": "action",
  "format": "series",
  "scenes_count": 4,
  "characters_count": 1,
  "characters": [
    "LESLIE"
  ],
  "total_words": 5845,
  "total_dialogue": 2,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. EAGLETON LOT - LATER - D1 4   4  Ann and Leslie are halfway through putting up the swing set. ANN Man, this is tough. LESLIE Think about all the kids who are going to swing on this swing -- fat kids, skinny kids, brainiacs, sluts, gay drama kids, goths, jocks, the alternative crowd... ANDY comes up from behind them.   He’s wearing cargo pants and a photographer’s vest. ANDY Hi, Leslie.   Oh, hey, Ann. ANN What are you doing here? ANDY Volunteering.   I love to volunteer. ANDY TALKING HEAD 5   5  ANDY The key to volunteering: lots of pockets. For putting food in. (reaching into various pockets) The Red Cross has a-may-zing cookies.   I go there a lot.   Meals On Wheels was a bonanza.   Suicide Hotline, surprisingly lame spread.   Who can eat at a time like that? EXT. EAGLETON LOT - CONTINUOUS - D1 6   6  ANDY (smug) Yeah, I thought I’d give back to those less fortunate than me. ANN You live in a pit. ANDY Not anymore.   Crashing with the drummer from my band.   Living indoors, pretty cool, don’t want to brag.   Hard not to. Anyway, gotta go -- me and an old Asian lady are double-teaming some monkey bars.  PARKS AND RECREATION   “Kaboom”   [02006]   3.  1st Revised Pink Shooting Draft   09/08/09",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 215
    },
    {
      "scene_number": 2,
      "slugline": "EXT. EAGLETON LOT - LATER - D1 7   7  Ann and Leslie finally finish their swing set.   Leslie is exuberant. LESLIE (to the swingset) You have been officially Kaboomed.   Ann, say... (like Terminator) “You have been Kaboomed.” ANN (like Terminator) “You have been Kaboomed.   Come with me if you want to live.” LESLIE Ann, you son-of-a-bitch, you’re Kaboomin’. Keef approaches. KEEF Look at you two and your big kabooms! I’ve never seen two Kaboomier chicks. Keef grabs them both in a bear hug. LESLIE Wow, Keef.   One day.   An entire playground.   It’s amazing.   You da man, Keef. KEEF No.   We all da man, Leslie.   We all da man. (beat) And you da Ann, Ann.   Are you going to join us tomorrow in Muncie? LESLIE We can’t.   Back to the real world. KEEF As long as you’re kabooming somewhere. Remember, take a man kabooming, he kabooms for a day.   But teach   a man to kaboom... kaboom, kaboom, kaboom. Keef turns to the other Kaboomers. KEEF (CONT’D) Okay, I love you!   Great job!   I’ll see you all tomorrow in Muncie!  PARKS AND RECREATION   “Kaboom”   [02006]   4. 1st Revised Pink Shooting Draft   09/08/09  (CONTINUED)",
      "characters": [
        "LESLIE"
      ],
      "action_text": "Keef does “the worm” to his car. KEEF (CONT’D) Muncie.   Muncie.   Muncie. LESLIE Ann... there worms a great man. Keef jumps up. KEEF Ow.   I just did the worm over some broken glass.   Kaboomed the hell out of my chest.   See you in Muncie!  END OF COLD OPEN  PARKS AND RECREATION   “Kaboom”   [02006]   5. 1st Revised Pink Shooting Draft   09/08/09  CONTINUED: 7   7 ACT ONE  INT. LESLIE’S CAR - LATER - MORNING - D1 8   8  Leslie drives with Ann.   They’re on a high from Kaboom. LESLIE I’m so pumped.   I could take on the world. ANN I could prep like a thousand diagnostic tests. Leslie looks at her. ANN (CONT’D) In an hour! LESLIE That’s the spirit! The car pulls up in front of Ann’s house. ANN Ugh, there it is... the pit.   That’s something I wish we could kaboom. They contemplate it for a beat. LESLIE Yeah.   Well, we are -- it’s a slow-boom. A slower, more deliberate kaboom. ANN Yeah, no.   Totally.   See you tomorrow. Ann gets out of the car.   The pit starts to bother Leslie now, too.   Leslie watches Ann walk back to her house. LESLIE TALKING HEAD 9   9  LESLIE There’s a word that playground guy said that really stuck with me.   And that word was “dedication.” INT. PARKS DEPARTMENT - CONFERENCE ROOM - MORNING - DAY 2 10   10  Ann, MARK, Tom, and Jerry are seated.   Leslie strides in, fired up.   The dry erase board has a list with so many items that it’s hard to read.  PARKS AND RECREATION   “Kaboom”   [02006]   6. 1st Revised Pink Shooting Draft   09/08/09  (CONTINUED) LESLIE You know what this is?   These are all the steps we need to complete to fill in the pit behind Ann’s house.   You know what this is? She holds up a dry erase board eraser. LESLIE (CONT'D) This is a Kaboomer. She wipes the board.   Nothing happens. LESLIE (CONT’D) Jerry, did you use permanent marker again? JERRY Aw, jeez.   I’m really sorry. EVERYONE Goddamnit, Jerry! / Come on! / Really? LESLIE Forget it.   Just imagine Jerry had never been born and this had all been wiped clean.   How do",
      "dialogue_count": 1,
      "word_count": 3714
    },
    {
      "scene_number": 3,
      "slugline": "EXT. EAGLETON LOT - LATER - D2 29   29  Leslie and Ann lean on the sign for the new park and watch kids play on the play structure they Kaboomed. LESLIE I promise you Andy’s not suing just for the money. ANN The man lived in a pit, Leslie.   He couldn’t find a place to live on the Earth’s surface.   He ended up going under the ground.   You’re dealing with a grown man who thinks like a gopher. LESLIE If I could get past the lawyers and find out what’s going on, I know I could get him to drop the lawsuit. Ann looks at her, then takes out her cellphone.   As she talks, Leslie realizes what she is doing and gets excited. ANN (into phone) Hey... Okay, calm down, yes it’s really me.   We need to talk somewhere private... can you come over to my house later? She holds the phone away from her ear because of the EXCITED SHOUTS. ANN (CONT’D) (into phone) Okay, cool.   Look forward to seeing you, too. (to Leslie) Happy? Leslie hugs her. LESLIE Yay!!   You were talking to Andy, right? INT. ANN’S HOUSE - LATER - NIGHT 2 30   30  Ann sits by the door.   Leslie paces back and forth.   A KNOCK at the door.   Leslie rushes to answer it. ANDY (O.S.) Baby, I’m back--  PARKS AND RECREATION   “Kaboom”   [02006]   25. 1st Revised Pink Shooting Draft   09/08/09  (CONTINUED)",
      "characters": [
        "LESLIE"
      ],
      "action_text": "LESLIE Thank you so much-- Leslie opens the door to reveal Andy.   He’s holding a bouquet of flowers, and is completely NAKED.   Leslie screams. ANN Why are you naked?! Andy hops around, trying to cover up. ANDY Because of what you said!   We’re getting back together! ANN No we’re not! ANDY Yes we are. (to Leslie) You shoulda heard the super sexy stuff she was saying to me! ANN I said, “Hey, Andy.   It’s Ann.   Can we talk at my house?” ANDY That’s not how you said it, you were all like, “Hey, Andy.   It’s Ann.   Can we  ‘ talk ’   at my ‘house’?” ANN You are such a baby!   Literally.   You’re a naked baby.   You need to grow up. (pointing to room) Put on some clothes. Andy goes into the bedroom.   Ann grabs her purse and turns to Leslie. ANN (CONT’D) You know what?   I actually should have seen this coming. LESLIE He’s done this before? ANN Every birthday, every anniversary, every holiday.  PARKS AND RECREATION   “Kaboom”   [02006]   26. 1st Revised Pink Shooting Draft   09/08/09  CONTINUED: 30   30  (CONTINUED) LESLIE Even Easter? ANN Look, I’m sorry.   I’d love to help you. Leslie gestures, “don’t worry.” LESLIE (whispering) I understand. Ann leaves.   Andy emerges wearing Ann’s winter coat and an apron.  PARKS AND RECREATION   “Kaboom”   [02006]   26A. 1st Revised Pink Shooting Draft   09/08/09  CONTINUED: (2) 30   30  (CONTINUED) ANDY None of your clothes fit me.   I had to put this apron over my front stuff. Andy looks around. ANDY (CONT’D) (deflated) Did she leave? INT. BAR - LATER - N2 31   31  Ann sits at a table with Mark, having beer and pretzels. MARK Totally naked?   He must be very confident. ANN This is rock bottom.   He’s not getting out of this one. MARK Socks, too? ANN He’s dead to me. MARK (still fascinated) How long do you think he walked naked down the street?   Where did he stash his clothes?   How much did Leslie see? INT. ANN’S HOUSE - CONTINUOUS - N2 32   32  Leslie sits with Andy, who’s miserable.   Andy wears a sheet, tied like a skirt. LE",
      "dialogue_count": 1,
      "word_count": 1282
    },
    {
      "scene_number": 4,
      "slugline": "EXT. ANN’S HOUSE - LATER - DAY 4 36   36  Ann and Leslie stand behind a fence, watching as the pit is filled in.   Ann shakes her head, in wonder. ANN It’s really happening.   I can’t believe it.   I just can’t believe it! Leslie pinches Ann’s arm. ANN (CONT’D) Ow. LESLIE Oh -- sorry.   Usually in these situations, people say “pinch me.” They continue to watch, smiling.   Then Ann notices something. ANN Is that... Andy? REVEAL Andy in a hard hat, sitting in a deck chair close by the pit, watching the proceedings. LESLIE (nonchalant) Oh, yeah.   Just one of his conditions for the settlement. ANN He settled?! LESLIE Yup.   Gave up probably a hundred thousand dollars for one thing: the city fills in the pit behind your house. ANN Why? LESLIE (doesn’t want to push too hard) Who knows?   Who knows why that gopher does anything he does. Ann takes this in.   Andy looks over and sees them watching. He waves.   Ann smiles a little.   Leslie notes this, then looks back toward the pit.   Muses.  PARKS AND RECREATION   “Kaboom”   [02006]   31. 1st Revised Pink Shooting Draft   09/08/09  (CONTINUED)",
      "characters": [],
      "action_text": "LESLIE (CONT’D) Goodbye, pit.   Hello, lot. (beat) What a beautiful word... lot. She smiles. LESLIE TALKING HEAD 37   37  LESLIE How does taking risks make me feel? Amazing.   Tingling sensations all over my body.   I feel flushed.   My muscles are relaxed but I feel awake.   Waves of pleasure. (beat) I wish there was something physical that could make me feel this way. (smiles and waves) Happy National Service Week, everyone!  END OF ACT THREE  PARKS AND RECREATION   “Kaboom”   [02006]   32. 1st Revised Pink Shooting Draft   09/08/09  CONTINUED: 36   36 TAG  EXT. PIT - LATER - D4 38   38  Leslie and Ann admire the finished, filled-in pit.   Leslie   *  takes out her cell phone.   *  LESLIE   *  Now to finish the job.   *  411 OPERATOR (V.O.)   *  Information?   *  LESLIE   *  (into phone)   *  The number for KaBOOM, the national   *  playground building charity.   *  (to Ann)   *  I hope they can work us in soon.   *  411 OPERATOR (V.O.)   *  There’s no such listing.   *  LESLIE   *  (into phone)   *  What?   Are you sure?   *  411 OPERATOR (V.O.)   *  I have checked every directory.   KaBOOM   *  does not exist.   *  Leslie hangs up, a disturbed look on her face.   *  LESLIE   *  Who was that man?   *  ALT.   *  Leslie and Ann admire the finished, filled-in pit.   *  ANN   *  Incredible.   *  (to Leslie)   *  Incredible!   You did it.   *  LESLIE   *  Well, it’s just the first step.   Long way   *  to go before this baby is a park.   *  Speaking of which --   *  She gets her phone out and dials information.   *  PARKS AND RECREATION   “Kaboom”   [02006]   33. 1st Revised Pink Shooting Draft   09/08/09  (CONTINUED) LESLIE (CONT'D)   *  I’m going to call KaBOOM, check on their   *  availability for next year.   *  411 OPERATOR (V.O.)   *  Information?   *  LESLIE   *  (into phone)   *  The number for Kaboom, the national   *  playground building charity.   *  411 OPERATOR (V.O.)   *  There’s no such listing.   *  LESLIE   *  (into phone)   *  Are you sure?   *  411 ",
      "dialogue_count": 0,
      "word_count": 634
    }
  ]
}