{
  "slug": "pen15-203-vendy-wiccany-2020",
  "title": "pen15 203 vendy wiccany",
  "genre": "drama",
  "format": "series",
  "scenes_count": 3,
  "characters_count": 0,
  "characters": [],
  "total_words": 2787,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. ANNA’S HOUSE - ANNA’S BEDROOM - NIGHT (N4) 203.23   203.23 Anna hears footsteps and a door close. She uses a glass against her wall to listen. It doesn’t work. Spell time! ANNA  Vichaliani Potaroachi louder-o--  EXAGGERATED MOMENT: Her parents voices are louder, clearer. KATHY (O.S.) --I don’t know. Is this crazy? CURTIS (O.S.) Probably. It’s not like I’ve fallen out of love with you in a few weeks. We fight. We are fiery... KATHY (O.S.) Get in this bed. INT. ANNA’S HOUSE - ANNA’S ROOM - NIGHT - MOMENTS 203.24   203.24 LATER (N4) Anna, silhouetted, her naked butt, celebrating by howling out the window by the light of the full moon outside her window. She howls, soundless as dogs howl in the distance. INT. TMS - ABANDONED GREENHOUSE - DAY/LUNCH (D5) 203.25   203.25 Maya and Anna stand in an old, abandoned greenhouse on school property. The circles under their eyes are darker, but they remain focused and excited for their spells. ANNA The sun is 176 degrees above us. MAYA It’s almost high noon, it won’t work after. Hurry. EXT. TMS - ABANDONED GREENHOUSE - DAY - SAME (D5) 203.26   203.26 A ball rolls by the outside wall of the greenhouse. INT. TMS - ABANDONED GREENHOUSE - DAY - SAME (D5) 203.27   203.27 Anna and Maya are sweaty from the magnified heat of the sun. Maya pours OJ in the bowl with the pentagon.  PEN15   - 203   \"Vendy Wiccany\" DOUBLE WHITE PRODUCTION DRAFT   10/23/19   17.",
      "characters": [],
      "action_text": "They add the ingredients,   and pull out a lighter. NOTE: we never see them burn anything. ANNA / MAYA  Vendy Rochele Wiccany, Vendy Rochele Wiccany--  EXT. TMS - ABANDONED GREENHOUSE - DAY - SAME (D5) 203.28   203.28 The ball is sitting, undisturbed. HECTOR walks into frame and gets it. But through the glass, he sees Maya and Anna being... strange. He grabs his ball and runs off, scared. INT. TMS - ABANDONED GREENHOUSE - DAY - SAME (D5) 203.29   203.29 Unaware of the outside world, Maya and Anna get deeper into their spell. Their words change to chanting and singing. ANNA / MAYA  Brethren of all energy... Heaven and Hellions... Mother Witch. Bring us Moritimo in reality which all of us revel in. Anti-love-o-Alexo.  Maya and Anna are REALLY into it now. They sway, dance and go crazy. They go between laughter and terrorizing each other. ANNA / MAYA (CONT’D)  BEDICULAR-ANO. BING MACHO NACHO WILACHO. FREAKANO table-dora, bring my love Brandt and his fedora. For the lover who betrayed you, his cloth -- From outside the greenhouse they hear “shh’s” and voices. They freeze. MAYA (shouting) Stay out, weaklings. ANNA Keep going. We are almost done. EXT. TMS - ABANDONED GREENHOUSE - DAY - SAME (D5) 203.30   203.30 A few more KIDS (Terra, Newton and JESSICA) are outside the greenhouse shushing each other, spying on the girls. Terra looks scared.  PEN15   - 203   \"Vendy Wiccany\" DOUBLE WHITE PRODUCTION DRAFT   10/23/19   18. ANNA / MAYA (O.S.)  BEDICULAR-ANO. BING MACHO NACHO WILACHO. FREAKANO Table-dora, bring-  TERRA You guys need to stop. Seriously. You are SCARING ME! NEWTON WHAT ARE YOU DOING. JESSICA You aren’t allowed in there. TERRA Someone's getting the Principal. ANNA / MAYA Tattletale bitch. INT. TMS - ABANDONED GREENHOUSE - DAY - SAME (D5) 203.31   203.31 Maya and Anna are shaking their bodies and yelling hexes. Kids are yelling back. It’s pure chaos. MAYA Don’t. If you do we hex you. (starting to hex them)  GO BALD SHILAYAYAY PUMPANO.  ANNA  PUMPANO PUMPANO. BE BA",
      "dialogue_count": 0,
      "word_count": 668
    },
    {
      "scene_number": 2,
      "slugline": "INT. TMS - ABANDONED GREENHOUSE - DAY - SAME (D5) 203.33   203.33 Hearing an adult voice, Anna and Maya freeze and run around like mice in a cage. Trapped.  END ACT TWO  PEN15   - 203   \"Vendy Wiccany\" DOUBLE WHITE PRODUCTION DRAFT   10/23/19   20.",
      "characters": [],
      "action_text": "ACT THREE  OMITTED 203.34   203.34   * EXT. TMS - FRONT LAWN - AFTER SCHOOL (D5) 203.35   203.35 Anna and Maya sit, humiliated. Most kids have been picked up already. It’s pretty empty out here. Maya elbows Anna-- MAYA Oh my God, Na. Don’t look up. But look at him. Did the anti-love spell work? Anna sees Alex on the sidewalk from afar. She studies him. The Alex love song is lower volume. Anna’s liking of Alex has lessened but is still present. ANNA A little I think. HEATHER sits down with him too (SEE APPENDIX for lines) and touches his arm. ANNA (CONT’D) Ouch. That still hurts though. Maya’s in her own world and looks around and the only other person there is Brandt. He sits on a curb. She gets up-- MAYA Oh my God-- Brandt. It’s a sign. He’s following me. It worked. ANNA Maya-- MAYA I gotta go. Maya approaches Brandt, hopeful. MAYA (CONT’D) Wazzup. I like your hair-- BRANDT Are you-- serious? Oh my God. Just. Get away from me. (MORE)  PEN15   - 203   \"Vendy Wiccany\" DOUBLE WHITE PRODUCTION DRAFT   10/23/19   21. (Maya doesn’t move) Stop putting your hair in my locker stop fucking talking to me. I think you’re ugly. I. DON’T. LIKE. YOU. YOU’RE CRAZY. YOU. SCARE ME. She goes to respond, but the wind has been knocked out of her. He leaves. Maya turns to Anna from afar, helpless. Alex watches with Heather. This isn’t what they planned. At all. INT. ANNA’S HOUSE - ANNA’S BEDROOM - NIGHT (N5) 203.36   203.36 Kathy and Curtis are mid-talk with Anna. She’s defensive-- ANNA ...Nothing. I’m sorry. We were just playing pretend. KATHY But your Principal said Maya was leaving her hair in Brandt’s locker and you knew about it. That doesn’t sound like pretend. CURTIS Was it doll hair? (no answer, disturbed) What’s going on with you, Nole? KATHY I think sharing our house is making it worse? Is it? We were trying to be a family still. Tell us. We want to know what you think? ANNA To be honest, I don’t want it to happen. I want you to stay married. KATHY See, she’s confused. What we",
      "dialogue_count": 0,
      "word_count": 831
    },
    {
      "scene_number": 3,
      "slugline": "INT. MAYA’S HOUSE - PARENTS’ ROOM - NIGHT - LATER (N5) 203.39   203.39 Maya tip toes up to Fred and Yuki who are fast asleep. MAYA Bye. I love you.   YUKI Hmm? Maya goes up to her and hugs her hard. MAYA (in Japanese)  I’m sorry.  FRED When I’m home you sleep in your own bed. Maya watches them, helpless, silent tears running down her face. Only wanting comfort. She won’t get it here. MAYA (whispers) Bye, I said.  END ACT THREE  PEN15   - 203   \"Vendy Wiccany\" DOUBLE WHITE PRODUCTION DRAFT   10/23/19   25.",
      "characters": [],
      "action_text": "ACT FOUR  EXT. WOODS - MIDNIGHT (N5) 203.40   203.40 Maya runs as though something is chasing her. An owl hoots. EXT. WOODS - MIDNIGHT (N5) 203.41   203.41 Anna has everything set up with their spell book open. A camping lantern lights her work. There is a cut near Anna’s elbow and she is pinching blood into a bowl. Maya runs in-- MAYA Oh my God. Na. I think someone was following me. ANNA I sent an owl to make sure you got here safely. MAYA Oh. Okay. Thanks. Are you okay? ANNA (focused) Mhm. Just in the middle of it and spelling in my head. Join me. Anna is mouthing a spell. Maya takes the knife and tries to cut her own arm but stalls. MAYA Should I do it here? Or here? Here or here? Anna’s somewhere else mentally and doesn’t respond. Maya tries again but can’t do it; it’ll hurt. So she   pretends   to add her blood but doesn’t. She throws the Brandt doll in. ANNA I’m ready, are you? Maya, a bit unsure, nods. The girls read quietly, in the tone of a prayer, out of their homemade book, together. ANNA / MAYA  Iniamintatu. Presence is too much to those around or those around too much. Regardless witches we be and souls inside all us, surely pretend we are gone and never did exist.  PEN15   - 203   \"Vendy Wiccany\" DOUBLE WHITE PRODUCTION DRAFT   10/23/19   26. Long moment of silence. Wind whistles. A bird. Cracking branches. Anna suddenly breathes heavily. Maya looks scared. ANNA It’s starting to... Oh my God... it’s starting to... work. MAYA ANNA. Anna is feeling herself disappear. First her hands. ANNA It’s happening. It’s happening. Oh my God. I feel it in my arms now too. Can you see my fingers? They are leaving me. Maya blinks: Anna’s fingers seem to be fading. She blinks again: they are back. It’s hard to tell in the light of the lantern. Anna is breathing hard and staring at her body as though it’s fading piece by piece. It’s very real and scary. ANNA (CONT’D) Maya. My heart. My heart is floating away. My brain too. But the pain is going away. Maya. Maya. I love ",
      "dialogue_count": 0,
      "word_count": 1288
    }
  ]
}