{
  "slug": "pet-sematary-2019",
  "title": "pet sematary",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 15,
  "characters_count": 0,
  "characters": [],
  "total_words": 16647,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. JUD’S HOUSE - DRIVEWAY - SAME TIME Church picks himself up in the driveway as we hear Jud cursing and cleaning the mess in his kitchen. We hear a rustling as Church turns to SEE -- That evil Dog from the opening emerges from the woods. The animal looks worse now.   Fur clumped up and ragged, head slung low as it moves forward, eyes locked on the cat. Church hisses, backing up. INT. JUD’S HOUSE - SAME TIME Jud dumps a pile of broken plate and food into the trash as -- We hear a loud CAT SQUEAL and a deeper, loud SNARL. Jud goes to the window, looking out -- The Dog has church in his jaws, shaking him wildly. JUD  Sonofabitch!!  Jud grabs the broom and races out to -- EXT. JUD’S HOUSE - DRIVEWAY - CONTINUOUS Jud swings the broom at the wild Dog.   The Dog jumps out of the way, giving Church a final, deadly shake with his head.  CRACK!   We hear the SICKENING SNAP of bone breaking as the Dog drops Church, racing off into the trees. ANGLE on Church, blood seeping from puncture wounds. His head flops to the side.   Neck broken. JUD Dammit... Ellie... Jud glances over at the Creed House as we -- CUT TO: INT. ELLIE’S ROOM - NIGHT Rachel sits on the edge of Ellie’s bed.   Ellie seems worried. 25.",
      "characters": [],
      "action_text": "ELLIE I don’t understand.   Church always comes home for dinner. RACHEL He’s probably out exploring. ELLIE He shouldn’t be out in those woods. RACHEL Shhh, honey.   Church will be fine. You need to get some sleep. Ellie lies back.   Her mind spinning bad thoughts. ELLIE Will you keep the lights on in case he’s trying to find us? Rachel gives Ellie a little kiss. RACHEL Of course, I will. INT. CAR - NIGHT Louis drives down the road, his mind still back in the ER, distracted by the trauma of losing Victor Paskow. He absently flicks on his blinker, about to turn up the driveway when we hear a loud   HOOOONK!   Headlights fill Louis’ car as he looks up to SEE -- A HUGE 18 WHEELER roaring right toward his car. The truck veers into the shoulder, missing his car by inches. Louis watches in the mirror as the huge truck rumbles past, a freight train of chrome and dust, disappearing behind him. He takes a breath and carefully pulls up the drive to find -- Someone standing outside his house in the driveway. It’s Jud. CUT TO: INT. JUD’S HOUSE - NIGHT Louis and Jud stare down at a LUMP on the washing machine. 26. LOUIS Jesus... what happened? Jud pulls the sheet back to reveal Church, bloody puncture wounds on his side, blood crusted on his nose and mouth. JUD Wild dog.   All kinds of animals in those woods... Louis touches Church’s body.   It’s already going stiff. JUD (CONT’D) It’s my fault.   Church had jumped in here and made a mess.   I got so steamed, I shoved him out the door. Jud pours two shots from a bottle of whisky.   He throws one back, hands shaking.   He hands the other to Louis. JUD (CONT’D) Animals out here are scavengers. Bet that old dog had his eye on Church since you guys moved in. Louis tosses his whisky back, taking a moment to think. LOUIS What do I tell Ellie?   The move has already been so hard for her.   This is going to break her heart. Jud watches Louis.   An idea brewing in his head. JUD What are you going to do? LOUIS I don’t know. Louis nods as he",
      "dialogue_count": 0,
      "word_count": 1465
    },
    {
      "scene_number": 2,
      "slugline": "EXT. MARSHY BOG - CONTINUOUS A low SWAMP with clumps of GRASS jutting out of the black water.   Fog curls as Jud wades out into the shallow marsh. LOUIS What the hell are you doing? Jud ignores him, wading into the water.   Louis comes to the edge of the bog.   He pauses, his vision blurring again. Shadows shift and move.   The darkness is alive. LOUIS (CONT’D) Jud, man.   Stop. Jud pauses in the water, pointing at something -- JUD Over there. Louis follows Jud’s finger to SEE -- A circular MOUND OF DIRT sticking out of the marsh. JUD (CONT’D) It has to be right there. Jud sloshes up onto the mound of dirt.   Louis calls out -- LOUIS I don’t understand.   What is this place? Jud drops the sheet with the cat on the ground, turning back to Louis.   The wind swirls with that soft whispering voice. JUD Can’t you hear that?   It’s alive. Louis shakes his head, sloshing out into the bog.   He steps up onto the mound of dirt, tossing the shovel down. Church’s dead face stares up at him in the moonlight. JUD (CONT’D) Bury your cat.   Right here. LOUIS This is crazy... Louis turns, stumbling back in the water.   Then he stops. 32.",
      "characters": [],
      "action_text": "The grass rustles around him.   Wind whispering.   He can’t leave and Jud knows it.   This place won’t let him. Louis turns back to see Jud holding out the shovel. JUD Bury your cat. CLOSE as the shovel slams into the ground. Dirt.   Shovel.   Dirt.   Shovel.   Dirt.   Shovel.   Low and rhythmic like a heartbeat as a hole opens in the ground. Louis slides Church into the hole, pulling dirt over the cat. He tries to wipe it off on his pants as Jud steps into frame. Staring down at Louis as we -- SMASH CUT TO: EXT. CREED HOUSE - DAWN The first sign of light in the sky over the sleeping forest. A flock of birds suddenly takes flight in the morning sky, swirling up and then disappearing over the Creeds’ house. INT. MASTER BEDROOM - SAME TIME TRACK past muddy shoes and clothes scattered across the floor.   SETTLE on Louis’ face sleeping in the bed as -- His eyes open.   He sits up on his elbows.   No memory of coming home or climbing into bed.   He glances over at Rachel, sound asleep.   His hands are still caked with dirt. Louis sits on the edge of the bed, trying to piece his memory back together as a HAND reaches out for him.   He jumps. RACHEL (groggy) Come back.   It’s too early... LOUIS Can’t sleep. Louis gathers his clothes off the floor, stuffing them into the hamper as he walks to the shower.   Rachel looks over. RACHEL Hey, wait.   You and Jud take care of everything last night? 33. Louis gets into the shower.   The water goes on. LOUIS (FROM THE SHOWER) Yeah.   It’s all done. Rachel slides out, walking over to the bathroom door. RACHEL And? LOUIS (FROM THE SHOWER) Nothing.   We buried him.   That’s it. RACHEL We still have to talk to Ellie. LOUIS I know. Rachel watches steam fill the bathroom.   Something seems off in Louis’ voice. INT. ELLIE’S ROOM - LATER Ellie sleeps in her bed.   The window is open, curtains blowing lightly in the breeze.   Louis and Rachel enter. LOUIS (whispering to Rachel) Did we leave that open? Louis goes to close it as Ellie wakes up",
      "dialogue_count": 0,
      "word_count": 1600
    },
    {
      "scene_number": 3,
      "slugline": "INT. UPSTAIRS HALLWAY - SAME TIME CAT POV watching Rachel and Louis make love.   After a BEAT -- The POV turns, gliding low and smooth over the floor, down the hallway and around the corner to a slightly open door. CHURCH sits outside Gage’s bedroom, nudging the door open with his nose. INT. GAGE’S ROOM - CONTINUOUS Back to CAT POV as Church slinks into the room, looking around, clocking the mobile on the wall, the night light, the window, the crib.   The POV moves closer to the crib. REVERSE to Church sitting outside the crib.   Watching Gage sleep.   His tail flicks nervously.   Intense and focused. We hear Ellie’s voice from somewhere in the house. ELLIE (O.S.) Church?   Here, kitty, kitty... Ellie appears in the doorway.   We’re back in CAT POV as we turn around to see Ellie tip-toeing closer, looming over us. ELLIE (CONT’D) (whispering) There you are, you naughty boy. Ellie leans down, reaching out for us with huge arms as we -- CUT TO: EXT. WOODS - NIGHT The moon hovers over the Creed House in the distance. INT. MASTER BEDROOM - NIGHT Rachel and Louis sleep with the window open.   The breeze from the woods billows the curtain, a piece of paper flutters. As it settles we HEAR -- Those soft voices we heard in the woods. Louis suddenly opens his eyes in bed.   Wide awake. He swallows, trying to assess if he is awake or dreaming. 40.",
      "characters": [],
      "action_text": "The wind rises and the curtain billows, the paper flutters. He shivers, sitting up on his elbows.   Something doesn’t feel right.   The house is too quiet.   He glances over -- LOUIS Rach?   Hey, you awake..? No answer from Rachel.   She’s sleeping on her side, facing the other way.   Louis reaches over, shaking her gently -- LOUIS (CONT’D) Did you close the window in Ellie’s room?   Rach..? Louis shakes her again and she rolls back to REVEAL -- It’s Victor Paskow. White jaw bone gleaming through his shredded face.   Louis pushes backwards, getting tangled in the sheets as -- Victor’s hand clamps onto his leg. VICTOR PASKOW  It’s cold, Louis.   Cold...  Louis screams, shoving himself backwards out of bed.   He gasps, sliding away as VICTOR rises up to REVEAL -- It’s only Rachel.   She clicks on the light, groggy. RACHEL What are you doing? Louis looks up at Rachel, unable to speak.   Then -- LOUIS (unsure) I was... I must have been dreaming? Louis thinks about this for a moment.   Then he NOTICES -- Church sitting on a chair nearby.   Watching him. CUT TO: INT. KITCHEN - MORNING Louis sits at the breakfast table in his scrubs, eyes bleary as Rachel packs his lunch into a thermal carry bag. 41. RACHEL (re. Victor) That’s so sad.   Why didn’t you tell me what happened? LOUIS The whole thing with Church happened that night.   Guess I just tried to put it out of my mind... Rachel comes over, sliding a chair close to him -- RACHEL Please don’t do that.   I need to know what’s going on with you. Louis nods, memories of Victor washing over him -- LOUIS He was a kid, Rach.   Maybe five or six years older than Ellie. (glancing at her) If we were in Boston, I could have done more.   Maybe saved his life. RACHEL Oh, honey.   You were there for him. Rachel comes closer, hugging Louis tight -- RACHEL (CONT'D) You gave him peace... CUT TO: EXT. WESTERN MAINE MEDICAL CENTER - LOUIS’ OFFICE - DAY Louis eats lunch at his desk in his doctor clothes, chewing his food as he scrolls thr",
      "dialogue_count": 0,
      "word_count": 1094
    },
    {
      "scene_number": 4,
      "slugline": "INT. UPSTAIRS HALLWAY - CONTINUOUS Louis stops as he NOTICES -- Church sitting at the end of the hallway. Louis reaches back, closing Ellie’s door all the way until it clicks.   He turns toward Church, shooing him with his hand. LOUIS (quietly)  Get out of here!  Church turns and scampers down the stairs as we -- CUT TO: EXT. LUDLOW, MAINE - THE NEXT DAY Louis drives slowly through the quaint business district.   He slows, searching for an address and pulls into a non-descript building marked COUNTY RECORDS OFFICE. INT. COUNTRY RECORDS OFFICE - DAY Louis follows LIONEL HAVERING (70’s), administrator of public records and land deeds for the town of Ludlow.   He talks as they walk down a hallway past a number of office doors. HAVERING They’ve been talking about putting all these old records on computers for years but with all the budget cuts we’ve had... LOUIS Our house, 2116 Bear Creek.   It runs right up against the woods. Havering pauses as his SECRETARY hears the address.   She shares a knowing glance with Havering then looks down. The Old Man opens his office door, waving Louis into -- INT. HAVERING’S OFFICE - CONTINUOUS Cramped with file cabinets, maps of the Ludlow on the wall, stacks of files and papers shoved into messy piles. 45.",
      "characters": [],
      "action_text": "LOUIS You know the specific lot I’m talking about? Havering glances at Louis -- HAVERING I know every plot of land in his town... but that one tends to come up in the system more than others. He pulls out a surveyors map from the 1950’s, spreading it out across his desk.   Louis joins Havering as he points -- HAVERING (CONT’D) Here’s your house.   Top of Bear Creek Road.   Only other person lives up there is Jud Crandall. LOUIS We’ve met Jud.   He’s a nice guy. Havering glances at Louis, a curious look on his face -- HAVERING Crabs are nice, too. (beat) When they’ve been steamed. ANGLE on the map as Havering traces out an old boundary line. HAVERING (CONT’D) All this land including the lot under your house was part of the old Mi’kmaq reservation.   Wasn’t ‘til the early 1900’s that it got officially incorporated. LOUIS I thought the Mi’kmaq died off in some kind of extinction event? HAVERING Some say they moved north.   Some say they got smallpox.   All we know for sure is they never came back. LOUIS What about the people who had the house before us?   The Pearsons. 46. HAVERING Moved away after they lost their son.   Bank took over the property and I guess they sold it to you. Louis thinks about this, almost not wanting to know -- LOUIS And the people before them? A beat as Havering studies Louis’ face -- HAVERING Like I said, that particular lot has changed hands more than a few times. OFF Louis’ face looking down at the map we -- CUT TO: EXT. CREED HOUSE - DAY Rachel plays with Gage on the rug in the living room.   We PAN over to pick up Church sitting behind them on the couch. The tea kettle begins to whistle in the kitchen as Rachel playfully moves a small fuzzy giraffe closer to Gage. RACHEL (Giraffe voice) Hey mister!   You gonna just sit there or play with me? Gage giggles, smiling at the giraffe -- GAGE Play with   you!  RACHEL (Giraffe voice) Well, come on then.   Get playing! Gage reaches for the toy as the tea kettle whistles louder. RACHEL (CONT’D) (Gir",
      "dialogue_count": 0,
      "word_count": 3033
    },
    {
      "scene_number": 5,
      "slugline": "EXT. WOODS - NIGHT Branches sway.   Moonlight piercing the canopy from above. We see Louis and Jud talking through the window. INT. JUD’S HOUSE - LATER Time has passed.   Ashtray full.   Louis on the couch, watching as Jud tries to stamp out his cigarette.   He’s drunk. JUD This is my fault.   I should never have shown you that place... Louis looks down, barely able to hear those words. LOUIS We both had a hand in it. JUD Grief poisons a man.   It makes you do things... Louis watches Jud.   The old man is slurring now, delirious. JUD (CONT’D) It won’t stop now.   It used Church to get to Ellie.   It wants more. Jud looks up at Louis, suddenly focused, eyes wet with tears. JUD (CONT’D) I’m sorry, Louis.   Ellie was the first person to touch my heart in a a long time.   I didn’t want to see her go through all that pain... The glass slips from Jud’s hand, falling to the rug. JUD (CONT’D) Dammit... Jud tries to stand up, losing balance.   Louis comes over. LOUIS Take it easy.   I’ll clean this up. JUD Just need to close my eyes. Louis stands over Jud, looking down as he passes out, then -- 59.",
      "characters": [],
      "action_text": "Thump, thump, thump...  CUT TO: EXT. ROAD - NIGHT The sound of tires as LANE MARKERS whiz below us. INT. STATION WAGON - CONTINUOUS Louis drives through town, face dark and determined. On the seat we see a bunch of ROPE, two SHOVELS, a plastic TARP, a BUCKET.   The bottle of whisky. EXT. LOCAL CEMETERY - ENTRANCE - NIGHT Louis drives slowly past the FUNERAL HOME where we saw Ellie’s service, following the brick wall around to the back. He shuts off the engine and lights, coasting quietly to a stop by the WROUGHT IRON GATES of the rear service entrance. EXT. LOCAL CEMETERY - GRAVEYARD - MOMENTS LATER A tarp wrapped around tools hits the ground with a THUD. A moment later, Louis drops to the ground.   He stands up, wiping dirt of his torn pants.   As he starts to collect his tools, we hear a CAR approaching.   He turns to SEE -- A POLICE CAR making rounds. Louis quickly grabs his tools, diving behind a pair of headstones.   He rolls onto his back, holding his breath. The police car slows outside the gate, using a SEARCHLIGHT to scan the lock and the chains. The light sweeps just over Louis’ head. Then he notices his SHOVEL lying out in the open grass. As the light swings away, he reaches out and pulls the shovel out of sight.   The light swings back.   It holds for a BEAT -- Then the police car moves on. 60. Louis gets up on his knees, watching as the police car rolls around the corner.   He quickly gathers his tools and ducks into the graveyard. EXT. LOCAL CEMETERY - ELLIE’S GRAVE - LATER A headstone by a freshly dug grave:   May 9, 2006 - July 19, 2016.   Eleanor Rose Creed.   Our beloved daughter.  Louis drops his tools, staring at the name.   The gruesome nature of his task sinking in.   He leans on a nearby tree and vomits.   Then he unfolds the tarp and picks up a shovel -- And starts to dig. VARIOUS SHOTS of Louis digging.   Shovel hitting ground.   Back breaking work.   Dripping with sweat.   The hole goes deeper. He’s waist deep now using the bucket to bring ",
      "dialogue_count": 0,
      "word_count": 748
    },
    {
      "scene_number": 6,
      "slugline": "EXT. WOODS - NIGHT Louis hikes up the dark trail, cradling Ellie’s body as he walks.   He passes under the PET SEMATARY sign, heading deeper into the woods.   Determined.   Possessed. As he passes some trees we catch a quick GLIMPSE of -- A PERSON standing in the shadows.   Watching him. Louis doesn’t notice as he continues up the dark trail. EXT. PET CEMETERY - NIGHT Louis steps out into the pet cemetery, thin shafts of moonlight illuminating the tilted markers and stones. He still holds Ellie in his arms, her dress spilling out over his hands, legs bouncing stiffly as he walks. Louis approaches the DEADFALL, pausing to shift Ellie’s body in his hands as he prepares to climb the pile of branches. VICTOR PASKOW (O.S.)  Stop, Louis... this is wrong...  Louis pauses.   Sensing the presence in the cemetery. He turns, squinting into the darkness. Mist curls around the stones.   There’s no one there. Louis takes a breath, collecting himself.   He’s exhausted. Finally, he turns back to the deadfall into -- Victor Paskow blocking his way.   Face still wet with blood. Louis stumbles back, nearly tripping over a grave marker. LOUIS  Get away from me!!!  As his voice rings out he looks again.   Victor is gone. LOUIS (CONT’D) (quietly to himself) You’re not even real... Louis looks down at Ellie’s face in the moonlight.   She’s beautiful and innocent.   Even in this horrible state. He approaches the deadfall again and begins to climb. 62.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 244
    },
    {
      "scene_number": 7,
      "slugline": "EXT. MARSHY BOG - NIGHT Louis stumbles into frame, coming to the edge of the water with Ellie’s body in his arms.   He stands for a moment, a silhouette against the black water.   Staring out at -- The mound of dirt peeking up through the fog. Louis pushes out into the water, wading over to the ground in the center of the bog.   As he lays Ellie’s body down -- We hear the WHISPERING VOICES in the trees. The voices rise, swirling like the wind in shifting layers. ANGLE on Ellie’s face.   Eyes closed in the moonlight. Louis reaches for a stone on the ground, slamming it into the dirt.   CLOSE as he digs, rips, pulls away dirt.   Obsessed. As he digs we WIDEN to REVEAL -- The wild dog from the opening on the shore of the marsh. Watching Louis dig with its pure black eyes. LATER. Louis sits over a shallow grave.   Hands black with dirt. As he turns to pull Ellie’s body into the hole he SEES -- Her eyes are open now.   Staring right at him. The VOICES are louder now.   Powerful.   Growing urgent as -- Louis quickly drags Ellie into the shallow grave. LOUIS I’m sorry, baby... Ellie’s feet disappear, her legs, her dress, her hands. LOUIS (CONT’D) I’m so sorry... Louis pulls the last of the dirt over Ellie’s face. The voices suddenly stop.   Louis turns away from the grave, ashamed and sick to his stomach in the horrible silence. Then his face changes.   What has he just done?  He drops to his knees, pulling the loose dirt away -- 63.",
      "characters": [],
      "action_text": "LOUIS (CONT’D)  No, Ellie... no, no!   I’m sorry...  But there’s nothing there.   Ellie’s body is gone. SMASH CUT TO: INT. MASTER BEDROOM - MORNING HOT WATER pounds Louis as he sits on the floor of the shower. He’s been there for hours trying to scrub the black dirt off his hands.   A phone rings somewhere in the house. Louis ignores it.   In the background we HEAR -- RACHEL (ON MACHINE) Louis, hey it’s me.   Please pick up.   I really need to talk to you. (beat) Shit, okay.   I’ll try you at the clinic.   Just call me when you can. Louis looks up, eyes vacant.   A worm of fear in his stomach. EXT. BACK YARD - DAY Louis busies himself in the yard, picking up the kid’s toys. He glances over at the woods. LOUIS’ POV of that trail leading up into the trees. There’s no sign of movement.   No sign of Ellie. He goes back inside. INT. ELLIE’S ROOM - DAY Louis pushes the door open and steps inside.   He hasn’t been in here since Ellie’s death.   It’s dark and musty. He opens the shades and cracks the window.   He strips the bed and puts on new sheets.   He arranges her stuffed animals. EXT. DRIVEWAY - DAY Louis shoves his muddy clothes in the trash.   He looks down -- The bag with Church’s body is there. 64. Then we hear a SOUND nearby, something moving through the trees.   Louis walks slowly around the side of the house -- There’s nothing.   Just trees and shadows.   He seems deflated. When he turns back around -- JUD IS STANDING BEHIND HIM. JUD What time you leave last night?   I must’ve passed out... Louis closes the garbage bin to conceal his muddy clothes. LOUIS I don’t know, around midnight... Jud notices Louis’ hands.   Raw and blistered from digging. JUD Wanna play some cards?   I could cook something on the grill. Louis slides his hands into his pockets, moving to the door. LOUIS Maybe tomorrow.   I need to start packing... JUD I’ll bring some food over.   You’re gonna have to take a break... Louis slips back into the house -- LOUIS It’s okay, Jud.   Rachel left me",
      "dialogue_count": 0,
      "word_count": 939
    },
    {
      "scene_number": 8,
      "slugline": "INT. CREED HOUSE - NIGHT Louis steps into the room.   Empty spaces and shadows suddenly feel huge, the silence filled with tension and dread. We hear a creak on the ceiling and he looks at the stairs. LOUIS (barely audible) El? Louis starts up the stairs, pausing at the top.   The hallway is dark and long.   Ellie’s door hangs open -- A light spills out of her room.   The purple night light. Then something moves.   A SHADOW fluttering inside the room. Louis comes down the hallway, heart pounding.   The shadow inside the room twists and turns as he reaches for the door -- Louis approaches the door, pulling it open to SEE -- INT. ELLIE’S ROOM - CONTINUOUS The night light on.   Purple butterflies float across the wall.   Both windows are open, curtains fluttering in the breeze.   That’s what was making the shadow. Louis walks across the room, closing the windows.   Then he pauses, sensing something behind him in the closet -- The same closet where Church hid when he first returned. Louis walks over, hand pulling the door open to REVEAL -- Nothing inside but Ellie’s clothes and toys. He turns back to the room, thinking, nerves tense. There’s something under the bed.   A dark shadow.   He comes over to the bed, slowly lifting up the skirt to SEE -- A rumpled white dress caked in mud. Louis pulls Ellie’s dress out, unfolding it in his hands. Lace ripped and stained with black muddy dirt. As he stares down in shock at the dress we HEAR -- BARE FEET running down the hall. 67.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 266
    },
    {
      "scene_number": 9,
      "slugline": "INT. UPSTAIRS HALLWAY - CONTINUOUS Louis comes out of door, looking around.   The hall is empty. LOUIS Ellie? She’s playing a game.   He steps out, heading down the stairs. INT. BASEMENT - CONTINUOUS A HAND reaches inside, clicking on the overhead light.   Louis looks into the darkness, terrified of what he might find. The bulb overhead makes his shadow long as he comes down the stairs.   He peeks under the work bench.   Nothing there. He turns to the CUBBY HOLE.   Ellie’s secret hiding place. Louis comes over, kneeling down.   He reaches out, taking hold of the small curtain, hands shaking as he pulls it open -- The cubby is empty. Louis deflates again.   Is this real?   Is he losing his mind? As he sits back up we NOTICE -- ELLIE CROUCHED IN THE SHADOWS BEHIND HIM!! Her head is lowered, looking out of the top of her eyes, body caked with dried black mud, hair hanging in stringy clumps RACK FOCUS to bring her into focus.   Eyes glued to Louis. Louis doesn’t see her.   He’s too absorbed in disappointment as she rises up to standing, coming closer, reaching out with tiny mud caked fingers, hand coming to rest on his shoulder -- ELLIE  Daddy.  Louis screams, spinning around.   He slides backwards across the floor, breathing rapidly, terrified.   Staring at Ellie. But she’s shivering.   Her body cold.   Terrified and confused. ELLIE (CONT’D)  Where am I?  Louis’ terror melts away, his father instincts kicking in as he goes to Ellie, wrapping his arms around her. 68.",
      "characters": [],
      "action_text": "LOUIS You’re home, baby. CLOSE on Louis’ face, holding Ellie tight -- LOUIS (CONT’D) Home. INT. BATHROOM - LATER Ellie sits in the tub, knees sticking out of dark grey water with pieces of SWAMP GRASS floating around her. LOUIS Tilt your head back. She does.   Louis gently pours water over her head, careful not to get it in her eyes.   She looks straight ahead. Louis brushes out Ellie’s hair, pulling gently down through heavy strands.   Ellie winces as he gets caught on a tangle. ELLIE Ouch. Louis notices clumps of hair in the brush.   He pulls them out and drops them in the wastebasket, going back to brushing. Ellie winces again -- ELLIE (CONT’D) Daddy. LOUIS Sorry.   Mom usually does this. He pulls the brush away from her head.   There’s something under the hair he keeps getting snagged on -- Louis uses his fingers to slide her hair aside to REVEAL -- MORTICIAN’S STAPLES holding the back of her scalp down. Louis closes his eyes, turning away.   He lets the hair fall back over the wound.   Ellie looks up in the mirror. ELLIE What is it? Louis swallows, pushing the horrific truth away. LOUIS Just a tangle. 69.",
      "dialogue_count": 0,
      "word_count": 454
    },
    {
      "scene_number": 10,
      "slugline": "INT. ELLIE’S ROOM - NIGHT Ellie lies in her bed, covers pulled up as Louis turns down the lights.   She shivers, scared.   Louis sits with her. LOUIS What is it, honey? ELLIE Church is gone.   Isn’t he? She watches his face, searching for the truth -- LOUIS (lying) The truck in the road hit him. Ellie sits up, eyes locked on Louis -- ELLIE No, it didn’t.   The truck hit me. Louis freezes.   Ellie’s eyes clear and dark.   Focused on him. LOUIS Church is dead, honey.   I’m sorry. Louis gets up to turn down the light.   Behind him we HEAR -- ELLIE (soft whisper) So am I. Louis spins around.   Did he just hear that correctly?  Ellie looks up at him with huge, sorrowful eyes. ELLIE (CONT’D) Can I sleep with you tonight?   I’m scared. Louis swallows, blood going cold.   He nods slowly -- LOUIS Of course, honey.   Come on... A flicker of a sinister smile in Ellie’s eyes as she slides out of bed, reaching for Louis’ hand. CUT TO: 70.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 173
    },
    {
      "scene_number": 11,
      "slugline": "INT. MASTER BEDROOM - LATER Louis lies in bed, staring at the ceiling.   Ellie lies facing him, curled up under the covers.   She reaches out with her finger, tracing it across his face.   He can barely breathe. ELLIE Where’s mommy and Gage? Louis glances over at her -- LOUIS They went to Grandma and grandpa’s for a couple days. ELLIE When are they coming back? She watches his eyes.   Searching his face for the truth. LOUIS A couple more days... Ellie keeps her eyes on him.   He’s hiding something. ELLIE Does mommy know what you did? LOUIS Shh, baby.   It’s late.   Time to sleep. Louis reaches over and clicks off the light.   As he lies back on his pillow, Ellie has moved closer.   Inches from his face. ELLIE Love you, daddy. LOUIS (terrified) Love you too, El. Louis closes his eyes, praying for sleep to take him. MOVE IN on Ellie’s face, lying in the darkness, eyes open. Staring at Louis in the moonlight. EXT. CREED HOUSE - MORNING Gage’s tricycle sits in the driveway, grass slick with dew. 71.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 181
    },
    {
      "scene_number": 12,
      "slugline": "INT. MASTER BEDROOM - SAME TIME Louis wakes up in bed with a start.   He rolls over but Ellie is gone.   He looks around the bed, heart skipping a beat. LOUIS  Ellie???  Then we hear something.   Music on the stereo downstairs. INT. LIVING ROOM - CONTINUOUS Louis comes down the stairs in disbelief.   Ellie is there and she’s doing what she loves most.   She’s dancing. Louis comes into the room, watching as she gets lost in the graceful joy of the dance.   Spins around.   Alive and free. It’s beautiful, sweet, tender, gentle.   Tears flow down Louis’ face but he’s not sad.   His heart is full again. Ellie sees him and smiles.   Spinning faster and laughing. LOUIS Careful, sweetie... Ellie lets out an excited yell as she twirls past Louis. Now her movements are too fast.   Aggressive and dangerous, striking the wall, kicking over a chair. LOUIS (CONT’D) Ellie, stop it!   Stop! But she can’t.   She won’t.   She’s out of control. Louis tries to grab her but she bites his arm and ducks away. Running past Louis and down the hallway, out into -- EXT. DRIVEWAY - CONTINUOUS Ellie bursts out of the house, laughing and breathing hard. She pauses for a moment, feeling the sun on her face.   It’s glorious.   Louis appears in the doorway, looking around. LOUIS Ellie!   Dammit!   Get back inside. Ellie’s face sharpens, her eyes convicting him -- 72.",
      "characters": [],
      "action_text": "ELLIE No!   I like it out here. Louis runs after Ellie but she takes off around the house -- LOUIS Goddammit, Ellie...   come back!!  Louis dives for her but she ducks away, sprinting around the garbage bins and down the side of the house to -- EXT. BACK YARD - CONTINUOUS Ellie swoops across the open lawn with her arms outstretched like an airplane as Louis comes running up behind her. ELLIE Can’t catch me! She turns backwards, mocking Louis as she comes around the corner of the house and bumps into -- Jud standing in the path. Ellie stops, looking up at him as Louis comes up behind, panting.   Jud stares down in horror at Ellie.   In shock. ELLIE (CONT’D) (playful) Hi, Jud! She moves to hug him.   Jud steps back.   He doesn’t trust her. JUD Ellie. Jud looks up at Louis.   His secret exposed. LOUIS (sharp, to Ellie) Get back inside. Ellie looks from her father to Jud.   Then she turns, walking casually over to the house, lingering in the doorway. ELLIE Can’t I just stand right here? LOUIS No.   Inside.   Now. Ellie sticks her tongue out at Louis and goes inside. 73. Jud turns to Louis, fuming behind his cold eyes. LOUIS (CONT’D) What was I supposed to do? JUD What everyone else does.   You’re supposed to suffer.  ELLIE peeks through the curtain, watching Louis and Jud. LOUIS I’ll take care of it. JUD You couldn’t even put Church down -- LOUIS (angry)  None of this would’ve happened if you hadn’t shown me that place!!!  Jud drops his eyes.   He knows this is true. JUD I couldn’t stop myself... that place gets into your blood... He looks up at Louis, determined -- JUD (CONT’D) (whispering) She’s gonna go bad.   Just like Biffer did.   Just like Church. LOUIS What was I supposed to do?   I just wanted to tuck her into bed one more time, kiss her goodnight... Louis hands his head, ashamed. JUD Ellie’s not a cat, Louis.   She’s dangerous. LOUIS She’s my daughter. ELLIE’S POV: listening and watching as Jud speaks -- JUD Not anymore. 74. Jud turns and walks back to his hou",
      "dialogue_count": 0,
      "word_count": 1376
    },
    {
      "scene_number": 13,
      "slugline": "EXT. FRONT PORCH - MOMENTS LATER Ellie comes out the front door.   Looking around.   She steps slowly down the stairs, walking out into -- EXT. BACK YARD - CONTINUOUS Ellie crosses the grass.   There’s something in her hand. The moonlight hits the tiny SCALPEL, glinting in the light. EXT. WOODS - CONTINUOUS Ellie sneaks through the trees toward Jud’s house.   She pauses, seeing a light in the window.   As she moves closer -- Jud lunges out of the bushes, trying to grab her! Ellie swings the knife, slicing Jud’s hand.   He slips backwards as she scampers away into the woods. Jud pulls himself up, reaching for his light. JUD’S POV of the dark woods.   Ellie is nowhere to be found. EXT. JUD’S HOUSE - NIGHT Jud comes around the front of his house to SEE -- The front door is open. He comes up the wooden steps, pausing at the threshold. JUD Ellie.   Come on out of there. FOLLOW as Jud walks slowly through the door into -- INT. JUD’S HOUSE - CONTINUOUS Jud stands in the dark room, eyes adjusting to the light.   He listens to the empty room, taxidermy staring silently at him. As he crosses to the kitchen we catch a GLIMPSE of -- Ellie passing across a doorway behind him. Jud spins around, heart pounding. 79.",
      "characters": [],
      "action_text": "JUD Dammit, Ellie.   Just come out. Jud walks to a drawer, reaching in to pull out a REVOLVER. He clicks it open to check the bullets.   It’s full.   He flips the chamber closed, walking to the kitchen. JUD (CONT’D) I just want to talk to you. No answer from the house.   He moves through a door into a long, dark hallway leading to his bathroom and bedroom. Jud stands in the hallway for a beat.   His bedroom door is open.   He takes a few cautious steps, gun held out. JUD (CONT’D) I know you’re scared.   I’m scared, too. Jud moves down the hallway to the bathroom.   He holds the gun with one hand as he slowly turns the knob with the other -- Pushing the door open and sweeping the gun around. The bathroom is empty.   Just a toilet, empty bath, sink. Jud backs up, continuing down the hallway to his bedroom. He taps the door with his foot and it swings open slowly with a horrible creak.   He inches forward into the room -- The bedroom is empty.   Moonlight filtering through curtains. Jud moves around the bed to the closet.   He opens it to SEE -- Nothing but old clothes hanging there.   He peeks behind them. He turns, walking past the bed as we DRIFT DOWN to reveal -- Ellie under the bed.   Gleaming SCALPEL clutched in her hand. She screams, swinging her hand out with the blade and -- Slicing Jud’s ACHILLES TENDON. Jud screams, falling to the ground.   He rolls over on his side to see Ellie sliding backwards under the bed and aims -- BAM!   BAM!!   Jud fires two shots under the bed but Ellie is gone.   He moans, his leg bleeding badly as he tries to pull himself up but his foot won’t support his weight. 80. Jud rolls onto his back, taking a breath -- JUD (CONT’D) Come on out, Ellie.   Where are you? He pushes himself up with one hand, craning his head to look around the dark room.   No sign of Ellie anywhere. He rolls onto his knees, sitting up higher as we NOTICE -- Ellie crouched on the dresser behind him like a FERAL CAT. Jud freezes, sensing Ellie’s presence -- CLOS",
      "dialogue_count": 0,
      "word_count": 728
    },
    {
      "scene_number": 14,
      "slugline": "EXT. JUD’S HOUSE - SAME TIME A muffled pop from inside the house as we -- CUT TO: INT. CREED HOUSE - MASTER BEDROOM - LATER Louis asleep in the bed.   His bedroom door swings open to reveal Ellie standing in the doorway.   Just a silhouette. Then she steps into the room and we see she’s returned to normal.   Her eyes are clear.   Just an innocent little girl. She walks to the edge of the bed, standing over Louis to watch him sleep.   He seems so defenseless.   Vulnerable. For a horrible BEAT we wonder what she’s about to do -- Then Louis wakes up.   He sits, startled to see Ellie there. LOUIS El, you okay? She drops her eyes, pouting a little. ELLIE I had a nightmare. Louis pulls the covers back.   Ellie slides into the bed. LOUIS (groggy) You’re okay.   Just a dream... As Louis falls asleep we TRACK in on Ellie lying in his arms, staring out the window at the rain falling outside. CUT TO: EXT. WOODS - DAWN The storm has passed.   Water drips through heavy leaves. INT. MASTER BEDROOM - SAME TIME Louis wakes up to the sound of tires rolling over gravel. He slides out of bed, walking to the window to SEE -- Rachel pulling up the driveway in her father’s car. 82.",
      "characters": [],
      "action_text": "Ellie sits up behind him in the bed.   She smiles. ELLIE Mommy’s home. Louis comes to Ellie, pleading with his eyes.   He knows that she’s the one in control. LOUIS Maybe you can give her a little time to get adjusted before..? ELLIE Don’t you think she’ll be happy to see me? Something in Louis melts.   He still sees her as his daughter. LOUIS Of course, honey.   It’s just, it’s going to take some time. ELLIE Maybe I should hide?   Like a game? Louis gets the chills.   This doesn’t feel like a game to him. LOUIS Okay, great.   I’ll go talk to her. INT. LIVING ROOM - MOMENTS LATER Louis comes slowly down the stairs as we HEAR -- Footsteps on the porch.   The front door opens and Gage bursts inside, running up to his father. GAGE Daddy, daddy, daddy!!! Louis scoops Gage into his arms, hugging his son. LOUIS I missed you so much.   Wait a second, did you get bigger? Gage squeals with laughter as his dad lifts him up and down. Then Louis notices Rachel in the doorway.   He sets Gage down. RACHEL Hi. 83. LOUIS Hi. They come together, hugging.   This is the first time in days that Louis has felt fully alive.   He doesn’t want to let go. RACHEL Oh, babe.   I missed you. LOUIS I missed you, too. Rachel walks into the house.   She pauses, looking around. Nothing has been packed. RACHEL What happened?   I thought you’d been packing this whole time? LOUIS It was hard, Rach... Rach moves around seeing Ellie’s sneakers by the wall, her scooter by the door, her sweatshirt on a chair. She shakes her head, looking back at Louis -- RACHEL What are you doing?   This is all Ellie’s stuff. Gage walks to the stairs as a SHADOW appears on the wall. But Rachel is absorbed with Louis, deeply concerned -- RACHEL (CONT’D) Are you doing this on purpose? Trying to punish yourself? ON THE STAIRS Ellie moves into view.   She puts her finger to her lips indicating for Gage to be quiet. GAGE Mommy! Rachel doesn’t respond.   She’s staring at Louis.   Furious. LOUIS Rach, it’s not like that -- RACHE",
      "dialogue_count": 0,
      "word_count": 1340
    },
    {
      "scene_number": 15,
      "slugline": "INT. CREED HOUSE - SAME TIME Ellie slides backwards around the dining room table as her brother comes into the room, his hands out, feeling his way. She has her father’s scalpel in her hand. GAGE Marco. Ellie jumps out of the way, dropping the scalpel on the ground.   Gage turns, hearing the noise. Gage turns around, waving his hands. GAGE (CONT’D) Marco? GAGE’S POV inside the blindfold: we see Ellie reaching for something on the ground.   She doesn’t answer Gage’s call. GAGE (CONT’D) Marco.   Marco? An excruciating BEAT inside the blindfold.   Then, finally -- ELLIE Polo. Ellie is right in front of him.   Gage pulls his blindfold up. GAGE Got you! Ellie smiles at him.   Her hand hidden behind her back. Then her eyes move to something else -- Rachel coming down the stairs.   She walks quickly over to Gage, gently pulling him back from Ellie. RACHEL Let’s play outside.   Get some air. CUT TO: EXT. PORCH - LATER Ellie plays with Gage on the lawn, chasing and giggling as they roll around in the grass.   BEHIND THEM -- Rachel watches from the porch.   Her face is blank.   Numb. 89.",
      "characters": [],
      "action_text": "Louis comes out, sitting next to her.   After a BEAT -- LOUIS We’ll do it tonight.   After dinner. She glances over at him, a glimmer of hope in her eyes. LOUIS (CONT’D) It was wrong... I’m so sorry... His eyes tear up.   Rachel pulls him close, hugging him. RACHEL Shhh, okay... it’s gonna be okay. Ellie turns away from Gage on the lawn.   Listening to them. RACHEL (CONT’D) (whispering) We’ll do it together. CUT TO: INT. DINING ROOM - SUNSET Gage carries silverware behind Louis, carefully placing a fork on each folded napkin as Louis lays out the plates. LOUIS That’s it, Gage.   One fork for everyone. Ellie enters with a bowl of spaghetti and red sauce. GAGE Bas-getti! Gage tries to reach into the bowl, Ellie lifts it away -- ELLIE Careful, Gage... it’s hot... Everyone takes their seats. LOUIS Should we do our thankful fors? Louis nods at Ellie as they all hold hands. ELLIE I’m thankful mommy and Gage came home. 90. She smiles at Rachel. GAGE I’m thankful for bas-getti! LOUIS I’m thankful we’re all together. They all look at Rachel.   She’s barely able to speak. RACHEL I’m thankful... for Ellie... Rachel quickly looks down, not able to continue.   Louis breaks the tension by serving up food onto everyone’s plate. Ellie just watches Rachel.   Studying her. ELLIE You’re lying. RACHEL No, I am thankful.   I love you. ELLIE (to Louis) You didn’t tell her I was back because you knew she wouldn’t let me stay.   She wants me dead again. UNDER THE TABLE we see Ellie holding the scalpel in her hand. ELLIE (CONT’D) (to Rachel) I know you’re planning on killing me.   I can see it in your face. LOUIS Ellie... stop... please... RACHEL We’re your parents.   We will always love you.   No matter what -- ELLIE  That’s another lie!  The house rumbles as if an earthquake were starting.   A picture frame slides down the wall shattering on the ground. CLOSE on Ellie’s face, glaring at her mother -- 91. ELLIE (CONT’D) (cold) You chose Gage over me. Rachel doesn’t answer.   She can’t.   H",
      "dialogue_count": 0,
      "word_count": 3006
    }
  ]
}