{
  "slug": "pirates-of-the-caribbean-dead-men-tell-no-tales-2017",
  "title": "pirates of the caribbean dead men tell no tales",
  "genre": "sci-fi",
  "format": "film",
  "scenes_count": 9,
  "characters_count": 0,
  "characters": [],
  "total_words": 26979,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. - SAINT MARTIN. - DAY A BUSY CARIBBEAN ISLAND -- MEN IN SUITS AND WOMEN WITH PARASOLS.   A DISTINGUISHED CROWD HAS FORMED IN THE MIDDLE OF SAINT MARTIN -- EVERYONE WATCHING AS THE MAYOR STANDS IN FRONT OF THE ROYAL BANK.  MAYOR Today we dedicate the Royal Bank of Saint Martin -- the most secure banking institution in the Caribbean.  BEHIND THE BANK   --   GUARDS HAVE BEEN KNOCKED COLD -- PIRATES ARE USING ROPES TO PULL THEMSELVES UP TOWARD A SMALL WINDOW AT THE BACK OF THE BANK --  MAYOR (CONT’D) Our new vault is made from crucible steel.   She is five inches thick -- stands as tall as any man and weighs an imperial ton.   She will never be stolen or robbed --  THE PIRATES MAKE IT THROUGH THE OPEN WINDOW -- INSIDE THE BANK -- THE PIRATES DESCEND ON THE MASSIVE VAULT IN THE CENTER OF THE ROOM.   THEY TIE ROPES TO THE BOTTOM OF THE VAULT -- QUICKLY MOVE TOWARD A SMALL HOLE THAT HAS BEEN CUT INTO THE BACK OF THE BANK --  ROPES ARE FED THROUGH THE HOLE -- WHILE OUTSIDE THE BANK --  GIBBS AND SCRUM EACH GRAB THE ROPES -- QUICKLY MOVE TOWARD HORSE AND CARRIAGE -- FOUR TEAMS WAITING --  MAYOR (CONT’D) The Governor has placed his personal gold reserves inside this new branch -- a bank protected by the Royal Guard!  PIRATES ARE TYING ROPES TO FOUR CARRIAGES --  MAYOR (CONT’D) With the opening of this bank -- we enter the modern world!  AS THE BANK DOORS OPEN AND A BAND STARTS TO PLAY -- THE PIRATES SMACK THEIR HORSES --   ROPES PULLED TIGHT FROM THE CARRIAGES TO THE BACK OF THE BANK -- GIBBS AND SCRUM AT THE REINS OF THE LEAD WAGON -- HORSES INCHING FORWARD -- STRAINING AS THE ROPES PULL TIGHT -- INSIDE THE BANK WE SEE THE ROPES TIGHTEN AROUND THE VAULT --  10.",
      "characters": [],
      "action_text": "BUT THE VAULT DOESN’T MOVE --  GIBBS SHE WON’T BUDGE!!  WE SUDDENLY SEE JACK SPARROW STANDING ON THE ROOF OF THE BANK -- PISTOL IN ONE HAND -- A JUG OF RUM IN THE OTHER AS HE YELLS DOWN TO THE PEOPLE OF SAINT MARTIN.  JACK SPARROW Excuse me.   If I could have your attention for just one moment.  THE CROWD REACTING AS JACK STEPS TO THE EDGE OF THE ROOF --  JACK SPARROW (CONT’D) I was wondering if you wouldn’t mind helping me to rob this bank.  TEN GUNS ARE IMMEDIATELY POINTED UP AT JACK -- THE ROYAL GUARD TAKING POSITION.  MAYOR You are a mile from the sea, Pirate! Lower your weapon or you will be shot. JACK SPARROW Being shot will do just fine.  JACK FIRES A SINGLE SHOT INTO THE AIR -- THE ROYAL GUARD OPENING FIRE AS JACK DIVES BACK ON THE ROOF ALL OF THE HORSES SPOOKED BY THE GUNFIRE -- FOUR TEAMS OF HORSES REARING UP NOW -- PULLING HARD -- AS THE VAULT SLIDES ACROSS THE FLOOR OF THE BANK -- SLAMS HARD INTO THE BACK DOORS --  MAYOR WHAT’S HAPPENING!! JACK SPARROW We’re taking the vault.  BUT THE VAULT IS TOO BIG -- GETS CAUGHT BETWEEN THE IRON DOORS -- STUCK INSIDE THE BANK -- HORSES STRAINING -- PULLING WITH ALL THEY’VE GOT -- JACK ON THE ROOF -- FEELS THE VIBRATION UNDERNEATH HIM -- MORE SHOTS FIRED -- AND JACK   SUDDENLY REALIZES WHAT’S ABOUT TO HAPPEN -- AS WOODEN CORNER SUPPORTS SHATTER AROUND THE BANK --  11. AND NOW THE ENTIRE BUILDING STARTS TO MOVE AS THE BANK IS PULLED INTO THE STREET BEHIND THE BANK -- PEOPLE DIVING OUT OF THE WAY AS THE BANK SLIDES THROUGH THE MIDDLE OF TOWN -- PIRATES AT THE HELM OF THE WAGONS -- ALL OF THEM URGING THEIR HORSES FORWARD -- AS THE BUILDING STARTS TO PICK UP SPEED -- THE ROYAL GUARD CHASING THE BANK -- STARTS TO OPEN FIRE -- THE ROPES TIGHT AND PULLING THE BUILDING FASTER AND FASTER --  MAYOR THEY’RE STEALING THE BANK!!  JACK TOSSED AROUND ON THE ROOF -- TRYING TO STAY ON HIS FEET - THE HORSES TURNING A SHARP CORNER -- HALF THE BANK CRASHING INTO ANOTHER BUILDING -- WALLS CRASHING AND CRUMBLING AS THE ROOF CAVES IN -- AND",
      "dialogue_count": 0,
      "word_count": 2080
    },
    {
      "scene_number": 2,
      "slugline": "EXT. - BARBOSSA’S SHIP (QUEEN ANNE’S REVENGE). - DAY THE QUEEN ANNE IS OVERFLOWING WITH SPOILS -- STATUES AND PORCELAIN BOWLS -- SILK SCARVES AND RUGS STACKED ON THE DECK. BARBOSSA’S MEN HAVE DOCKED IN ST. JAMES   -- THE PIRATES CELEBRATING THEIR LATEST CONQUEST --  TWO PIRATES FIGHT OVER A PAIR OF CANDLE STICKS -- ANOTHER PIRATE IS URINATING IN A CHINESE VASE -- THE MEN ARE EATING LIKE KINGS AND DRINKING FROM BARRELS -- THE EXACT OPPOSITE OF JACK’S SHIP --  INT. - CAPTAIN’S QUARTERS. - QUEEN ANNE’S. - CONTINUOUS  BARBOSSA SITS ALONE AT HIS DESK QUIETLY SETTLING ACCOUNTS -- A STACK OF SILVER COINS IN FRONT OF HIM TO BE COUNTED.  HIS QUARTERS ARE FULL OF STOLEN GOODS FROM EVERY CORNER OF THE WORLD -- AND HE CAN HEAR THE MEN CELEBRATING ON DECK -- BARBOSSA OPENS A DRAWER TO FIND A FEATHERED PEN -- PULLS OUT A SMALL PORTRAIT OF A   WOMAN .   THE PAINTING IS CREASED AND CRACKED -- FITS IN THE PALM OF HIS HAND.   THE WOMAN IS DARK- HAIRED, BEAUTIFUL --   CLEARLY A GHOST FROM HIS PAST . HE LOOKS AT THE PORTRAIT FOR A BEAT -- THEN SETS IT BACK IN THE DRAWER AS HIS DOOR OPENS. PINTEL Sir, we know you said never to disturb you -- RAGETTI Or to come in without good cause -- PINTEL Or to speak without first asking ourselves if our thoughts were absolutely necessary -- RAGETTI Like the ship being on fire -- you’d want to know that. PINTEL But it’s not on fire -- that being an example of a necessary thought. THE TWO MEN ARE SUDDENLY THROWN AGAINST THE WALL -- PINNED BACK FROM THE FORCE OF BLACKBEARD’S SWORD -- WHICH IS OUT AND POINTED AT THEM --  18.",
      "characters": [],
      "action_text": "BARBOSSA STATE YOUR BUSINESS BEFORE I OPEN YOUR THROATS! RAGETTI We just come from town, Sir.   The British are enraged -- rounding up pirates and witches as they wish.   In no time they’ll find their way to the Queen Anne. PINTEL It seems one of their ships went missing.   The Monarch lost to the Triangle -- a full crew murdered at sea. BARBOSSA And how do they know this? PINTEL A survivor, Sir.   One man lived to tell the tale. AND NOW BARBOSSA LOOKS AT THEM -- HIS WHEELS SPINNING. BARBOSSA Where is he? EXT. - PORT ROYAL. - NIGHT THE SEEDY UNDERBELLY OF PORT ROYAL HAS COME ALIVE AT NIGHT -- WITH DERELICTS, WHORES AND DRUNKS ALL OVER THE BEACH.   JACK AND SCRUM MAKE THEIR WAY UNDER THE DOCKS, MOVE PAST A SERIES OF SHACKS UNTIL THEY SEE ONE WITH   A BLOOD RED DOOR . THEY BOTH STOP -- CLEARLY NERVOUS -- JACK SPARROW The red door.   Doesn’t look so bad, Scrum.   You go first. SCRUM Jack, I don’t keep company with witches.   All of them covered in warts and boils.   Makes me miss my Mum. JACK SPARROW Your mother was a witch? SCRUM Just incredibly ugly. JACK SPARROW Nothing to be afraid of, Scrum. Except that two-headed dog.  19. A TWO-HEADED DOG IS GROWLING AT THEM BY THE RED DOOR -- SCRUM I’m not going in there.   Even the Redcoats are afraid to touch her. Let’s escape before it’s too late.  SUDDENLY THE DOOR TO THE SHACK SLOWLY OPENS ON ITS OWN --  JACK SPARROW I believe it’s too late to be too late.  AND JACK AND SCRUM STARE IN AT MELIA -- A YOUNG, BEAUTIFUL NAKED WOMAN HIDING IN THE SHADOWS BY THE FIRELIGHT.   HER LONG HAIR COVERS HER BODY AS SHE POURS A CUP OF TEA FROM A KETTLE.  MELIA I’ve been expecting you, Jack Sparrow. Would you like some tea? SCRUM AND JACK STARE IN AT MELIA -- A VISION OF FEMALE PERFECTION. SCRUM I could go for a spot of tea. AND SCRUM LEADS THE WAY INSIDE. INT. - MELIA’S SHACK. - NIGHT SCRUM AND JACK MAKE THEIR WAY TOWARD MELIA -- THE LIGHT FROM THE FIRE CASTING A GLOW ACROSS HER BEAUTIFUL FACE AND HIDDEN BODY. JACK SPARROW I’ve brought yo",
      "dialogue_count": 0,
      "word_count": 1430
    },
    {
      "scene_number": 3,
      "slugline": "INT. - KING GEORGE PUB. - PORT ROYAL. - LATER THAT NIGHT  BRITISH SOLDIERS ARE SEARCHING FOR SOMEONE INSIDE THE PUB -- ROUSING DRUNKS AND DERELICTS.   JACK AND SCRUM WALK INTO THE KING GEORGE -- JACK SPARROW You see, Scrum.   My only destiny is a bottle of rum and a warm bed upstairs. That witch was a charlatan, a two bit four-flusher... SCRUM Jack -- is that your sword?  A FISHERMAN HAS CUT OPEN HIS NET AND DROPPED HIS CATCH ON THE BAR -- FISH FLOPPING EVERYWHERE.   IN THE PILE OF FISH WE SEE THAT JACK’S SWORD HAS DROPPED ONTO THE BAR.  JACK SPARROW No.   Must be a fish.   A swordfish. THE LARGEST OF THE FISH FLIPS ITS TAIL AND KNOCKS THE SWORD ONTO THE FLOOR -- WHERE IT’S QUICKLY KICKED ACROSS THE DIRT BY A DRUNK -- THEN KICKED BY A COUPLE DANCING -- THE SWORD EVENTUALLY LANDING RIGHT AT JACK’S FEET. JACK SLOWLY BENDS DOWN TO PICK IT UP -- SCRUM HORRIFIED -- SCRUM That appears to be a double-edged bone and steel cutlass with a slight nick at the tip. JACK SPARROW No.   There is no destiny! JACK QUICKLY OPENS A BARREL OF RUM -- DROPS THE SWORD INSIDE AND THEN HEADS FOR THE DOOR -- JACK SPARROW (CONT’D) We’ll try a different pub! AS HE TURNS TO LEAVE JACK WALKS STRAIGHT INTO A GUN -- THE WEAPON AIMED AT HIS HEAD. PIG KELLY Well, if it isn’t the pirate who stole my ship! Jack looks at PIERRE “PIG” KELLY AND HIS FOUR LARGE MEN -- ALL HOLDING WEAPONS. JACK SPARROW Pig -- I’ve been looking for you. Wanted to give you this gold coin as compensation for borrowing the Gull.  24.",
      "characters": [],
      "action_text": "JACK HOLDS UP THE GOLD COIN -- WHICH PIG TAKES. PIG KELLY You’ve been sailing on my ship. JACK SPARROW You have three.   And this one’s not much of a ship.   One gun, leaks in the hull, rats everywhere. SCRUM Which are delicious by the way. PIG KELLY You’ll settle your debt here and now. JACK SPARROW Of course, Pig.   Name your price. PIG KELLY Her   name   is Beatrice.   And she’s my daughter. BEATRICE WALKS UP TO THEM NOW -- STARES AT JACK. PIG KELLY (CONT’D) She’s a midwife -- no respectable man will have her.   You’ll do just fine. KELLY AND HIS MEN START TO LAUGH. JACK SPARROW I’ll do what? PIG KELLY Marry her.   Take her off my hands forever.   To clear your debt. BEATRICE SPITS ON THE FLOOR -- SMILES AT JACK WITH YELLOW TEETH. BEATRICE The honeymoon suite is waiting upstairs. JACK SPARROW Remind me of the other option? PIG KELLY A bullet in your eye. JACK SPARROW Scrum, go find me an eye patch. PIG KELLY Last chance.  25. GUNS COCKED -- JACK ABOUT TO BE SHOT -- JACK SPARROW As a Captain I will officiate the ceremony.   How’s next Tuesday? PIG KELLY Say “I do” or die. JACK SPARROW I’m trying.   Having a bit of a midwife crisis. SUDDENLY TWO HORRIBLE CHILDREN COME RUSHING UP TO JACK -- KIDS PAPPA!   PAPPA! SCRUM Jack, you remember the witch said you’d be married with kids?! JACK SPARROW  I do.  PIG KELLY Congratulations! AND NOW TEN BRITISH SOLDIERS COME BURSTING INTO THE PUB --  SURROUND JACK AND PLACE HIM UNDER ARREST.  BRITISH SOLDIER Jack Sparrow, in the name of the King you are under arrest.   You killed 46 men in cold blood aboard the H.M.S. Monarch. JACK STARES AT THE WIFE -- THE KIDS -- THE SOLDIERS. EVERYTHING THE WITCH SAID HAS COME TRUE. SCRUM Jack -- can you find out if she has a sister?  INT. - HOSPITAL ROOM. - INSANE ASYLUM. - ISLAND PORT. - DAY  A HOSPITAL/INSANE ASYLUM IS FULL OF SOLDIERS BACK FROM THE WAR -- MANY INJURED OR UNFIT TO SERVE. AN INJURED HENRY MADDOX LIES IN A HOSPITAL BED STARING OUT THE WINDOW.   HE’S LOOKING OUT TO SEA -- HIS EY",
      "dialogue_count": 0,
      "word_count": 8860
    },
    {
      "scene_number": 4,
      "slugline": "INT. - CORONATION BAY PUB. - DAY  JACK IS HIDING IN THE BAR WHEN HE HEARS -- CARINA SMYTH (V.O.) HELP!!   SOMEBODY HELP ME!! JACK GLANCES OUT THE WINDOW -- SEES CARINA BEING DRAGGED OFF IN THE MIDDLE OF THE STREET BY THE FOUR TRADERS.   HE QUICKLY TURNS BACK TO THE BAR -- HAS A DRINK. JACK SPARROW To trust. JACK OPENS THE MAP -- TRIES TO READ IT.   KEEPS TURNING IT OVER IN HIS HAND -- NOT SURE WHICH WAY IT GOES -- JACK SPARROW (CONT’D) She’s the only one who can read it. A MAN’S VOICE CAUSES JACK TO TURN -- GAMBLER (V.O.) I’ll bet ten pieces. GAMBLER #2 (V.O.) And I’ll raise this here sword -- washed ashore in Coronation Bay this morning... JACK HEARS THE WORD “SWORD” AND STARTS TO PANIC -- GAMBLER #2 (V.O.) This is a fine saber!   A double-edged bone and steel cutlass with a slight nick at the tip -- JACK DRINKING FROM A BOTTLE NOW -- FIGHTING WITH HIMSELF NOT TO TURN AROUND.   BUT HOW CAN HE RESIST? HE STANDS UP AND STARES DOWN AT HIS SWORD -- GAMBLER #2 And what you be looking at? JACK CASUALLY KNOCKS OUT THE TWO CARD PLAYERS AS HE LIFTS HIS SWORD OFF THE TABLE -- JACK SPARROW Destiny... JUST AS A MAN WALKS INTO THE PUB -- MAKES AN ANNOUNCEMENT -- MAN Gentlemen -- the auction is about to begin.  62.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 239
    },
    {
      "scene_number": 5,
      "slugline": "EXT. - CORONATION BAY AUCTION. - NIGHT  TORCHES LIGHT UP A MAKESHIFT PLATFORM -- AN AUCTIONEER STIRRING UP THE LARGE CROWD AS HE AUCTIONS OFF TWO DONKEYS. MEN ARE DRINKING AND BIDDING WILDLY -- FIGHTS BREAKING OUT -- WE PAN OFF THE STAGE TO A LINE OF THREE WOMEN TIED TOGETHER BY ROPE -- EACH OF THE WOMEN WEARING “FANCY” DRESSES.   THEY ARE WAITING TO BE AUCTIONED OFF -- A SIGN ABOVE THEIR HEADS READS:   WENCH AUCTION TONIGHT!  CARINA IS AT THE FRONT OF THE LINE, STUFFED INTO A REVEALING RED DRESS WITH A HEAVY HAND OF MAKE-UP APPLIED TO HER FACE. THE LOOK ON HER FACE IS PURE RAGE. THEY PULL CARINA ONTO THE PLATFORM AND THE CROWD GOES WILD. AUCTIONEER First up is this fresh young lass -- come up here darling and turn about -- show us your larboard side. CARINA TURNS AND KICKS THE AUCTIONEER IN THE BALLS.   SHE TURNS TO THE CROWD OF DISGUSTING TRADERS, PIRATES AND SAILORS. CARINA SMYTH Let me just say that I forgive your common dim-wittedness and feeble brains incapable of educated -- THEY QUICKLY PUT A GAG IN CARINA’S MOUTH AS THE AUCTIONEER STEPS FORWARD -- AUCTIONEER I will start the bidding at one pieces of eight -- and with this one I’ll throw in a goat. WE SEE JACK MAKING HIS WAY THROUGH THE CROWD -- GETTING RIGHT UP FRONT WHERE CARINA CAN SEE HIM.   WITH HER EYES SHE TELLS HIM TO START BIDDING --  JACK REACHES INTO HIS POCKETS -- WHICH ARE EMPTY --  JACK SPARROW This one looks of unremarkable stock -- hard to imagine any warmth coming off those skin and bones.   But alas -- I’ll bid one and let’s be done with it! AUCTIONEER I have one pieces of eight! A DISGUSTING MAN STANDS NEXT TO JACK -- HOLDS UP TWO PIECES OF SILVER.  63.",
      "characters": [],
      "action_text": "DISGUSTING TRADER I’ll bid two. JACK SPARROW Three! DISGUSTING TRADER FOUR!!  JACK STEPS CLOSER TO THE BIDDER -- STARTS STEALING MONEY FROM THE MAN’S POCKETS -- FLIPPING COINS TO HIMSELF AS HE CONTINUES TO BID --  JACK SPARROW FIVE!! DISGUSTING TRADER SIX!! WITH EACH BID JACK IS STEALING MONEY FASTER AND FASTER -- ONE HAND IN THE MAN’S POCKET AND THE OTHER IN HIS JACKET -- JACK SPARROW SEVEN!! DISGUSTING TRADER EIGHT!!! JACK SPARROW NINE!! DISGUSTING TRADER TEN! JACK SPARROW IF YOU HAVE TEN -- THEN SHE IS YOURS. SHOW US YOUR COIN!  THE MAN REACHES INTO HIS POCKETS -- WHICH ARE EMPTY --  DISGUSTING TRADER NOW WAIT A SECOND -- MY MONEY IS GONE!  JACK HOLDING UP THE MAN’S MONEY -- SHOWING THE ROOM HIS COINS.  JACK SPARROW ARE WE TO LET THIS MAN SWINDLE A REPUTABLE WENCH AUCTION SUCH AS THIS! AUCTIONEER GET THAT CHEAT OUT OF HERE! THEY REMOVE THE FAT MAN NEXT TO JACK -- START BEATING HIM AS THEY PULL HIM OUT.  64. AUCTIONEER (CONT’D) Now the last of the bids was ten! Going once!   Going twice! A VOICE FROM THE BACK OF THE ROOM STOPS THE CROWD. PIRATE TWENTY!!   AND LET IT BE DONE AT THAT. JACK HEARS A PIRATE’S VOICE OFF IN THE DARKNESS -- AUCTIONEER 20!!   SOLD!! THE CROWD GOING WILD AS A VICIOUS LOOKING PIRATE MOVES THROUGH THE CROWD -- STEPS UP AND TAKES THE END OF CARINA’S ROPE.   HE LOOKS UP AT HER AND SMILES WITH ROTTING YELLOW TEETH -- PIRATE You belong to me now. CARINA IS TERRIFIED OF THE PIRATE -- STRUGGLING WITH HER ROPES AS SHE’S TAKEN OFF THE PLATFORM -- YELLING THROUGH HER GAG AS JACK WATCHES HER MOVE THROUGH THE CROWD.  EXT. - DOCKS OF CORONATION BAY. - QUEEN ANNE’S. - DAY JACK FOLLOWS THE PIRATE AND CARINA AS THEY HEAD DOWN TO THE DOCKS   -- WATCHES THROUGH THE DARKNESS AS THEY BOARD A SHIP. HE CAN SEE CARINA IN THE WINDOW OF THE CAPTAIN’S QUARTERS -- THE LAMP IS TURNED OFF INSIDE THE SHIP -- AND JACK QUICKLY CLIMBS UP THE SIDE OF THE SHIP -- REACHES UP AND PULLS TWO PIRATES OVERBOARD AS HE USES THEM TO HELP HIMSELF CLIMB ONTO THE MAIN DECK -- HE SNEAKS A",
      "dialogue_count": 0,
      "word_count": 9836
    },
    {
      "scene_number": 6,
      "slugline": "EXT. - COFFIN ISLAND. - DAY  HENRY MADDDOX AND CARINA ARE RUNNING THROUGH THE FOREST -- TRYING TO FIND THEIR WAY OUT. THE GHOST SOLDIERS SPREADING OUT AS THEY CUT THROUGH THE TREES -- LOOKING FOR CARINA -- CARINA SMYTH This way.   Hurry! THEY TURN TOWARD THE BEACH -- SEE A LONG BOAT AT THE SHORE. THEY BOTH RUSH TOWARD IT -- ABOUT TO MAKE IT TO THE SAND -- ONLY TO BE CUT OFF BY GHOST SOLDIERS -- THE SMALL ARMY BLOCKING THEIR PATH. CAPTAIN BRAND/SCARFIELD -- CLEARLY INJURED -- COMES THROUGH THE TREES AND APPROACHES CARINA.   HE REACHES DOWN AND TAKES THE TRIDENT FROM HER HAND -- HOLDS IT UP -- THE SILENT MARY SAILS TOWARD THE SHORE -- GHOST Should we kill them? AND BRAND LOOKS AT CARINA -- CAPTAIN BRAND/SCARFIELD I want them to see this. EXT. - TOMB OF POSEIDON. - DAY JACK RUSHES TO BARBOSSA’S SIDE -- HELPS HIM UP. JACK SPARROW Where’s the Trident? BARBOSSA I let her go, Jack.   This time I’ll never get her back.  INT. - SILENT MARY. - DAY THE GHOST SOLDIERS BRING CARINA AND HENRY ON BOARD THE SILENT MARY -- PLACE THEM IN THE HULL -- ALL OF THE GHOSTS STEPPING OUT FROM THE BODIES THEY POSSESS -- THE LIVING SOLDIERS DROPPING TO THE DECK -- HALF CONSCIOUS AFTER THE GHOSTS DEPART --  THE GHOSTS STEP OUT FROM SCRUM AND GIBBS AS IF THEY’RE STEPPING OUT OF OLD COATS -- THE PIRATES DROPPING TO THE FLOOR -- DOWN IN THE HULL --  103.",
      "characters": [],
      "action_text": "HENRY LOOKS ACROSS INTO THE DARKNESS -- SEES OLIVIA HIDING IN FEAR.  OLIVIA Henry -- HENRY MADDOX I said I’d come back -- we’ll escape together. OLIVIA Please -- you have to go. HENRY MADDOX I won’t leave you again.   From the moment I saw you, I knew where my destiny lies -- OLIVIA It’s not safe. HENRY MADDOX You’re forgetting.   I’m lucky.  CAPTAIN BRAND STEPS OUT OF SCARFIELD’S WOUNDED BODY -- IGNORES THE INJURED, DYING ADMIRAL AS HE TAKES THE TRIDENT -- STEPS TOWARD THE FRONT OF THE SHIP NEXT TO MELIA.  MELIA The sea is yours, Captain.   Take your revenge.  CAPTAIN BRAND LOOKS TO THE ISLANDS -- LIFTS THE TRIDENT NOW -- AND NOW WE SEE THE FULL POWER OF THIS ANCIENT SPEAR -- THE OCEAN IMMEDIATELY STARTS TO SURGE -- THE WATER QUICKLY DRAWING AWAY FROM THE ISLANDS -- THE BEACHES SUDDENLY EXPOSED -- BRAND RAISING THE TRIDENT LIKE A CONDUCTOR -- AS A TIDAL WAVE STARTS TO FORM -- THE MASSIVE WAVE RISING UP IN FRONT OF BRAND’S SHIP -- THE GHOST ORCHESTRATING THE WAVE WITH THE TRIDENT AS HE SENDS IT TOWARD THE ISLAND -- THE WAVE GROWING TO A HUNDRED FEET AS IT BUILDS AND BUILDS --  CARINA WATCHING FROM THE HULL -- HORRIFIED AS SHE SEES WHAT’S ABOUT TO HAPPEN -- CAPTAIN BRAND Goodbye, Jack Sparrow. AND THE WAVE FINALLY CRASHES DOWN ON THE ISLANDS --  104. WATER FLOODING EVERYTHING -- TREES TORN FROM THEIR ROOTS AS THE FOREST IS SPLIT OPEN AND THE RAGING WATER SPREADS ACROSS THE ISLAND --  EXT. - TOMB OF POSEIDON. - DAY  JACK HEARS IT COMING -- LOOKS TO BARBOSSA -- AND THE TWO MEN WATCH AS A MASSIVE WAVE COMES CHARGING TOWARD THEM --  JACK SPARROW TAKE COVER!! JACK HOLDS HIS SHIP -- RUSHES TO BARBOSSA AND THROWS HIMSELF ON TOP OF HIM -- AND NOW THE WATER CRASHES OVER THE FORTRESS AND SWALLOWS UP EVERYTHING IN ITS PATH --  THE WAVE SO STRONG IT COMPLETELY COVERS THE ENTIRE TOMB OF POSEIDON -- THE TOMB BROKEN APART -- STONE AND GOLD EVERYWHERE AS WE SEE IT SINK IN A MATTER OF SECONDS -- THE ENTIRE ISLAND UNDERWATER NOW -- NOTHING IS LEFT -- JACK AND BARBOSSA ARE GONE --  EXT",
      "dialogue_count": 0,
      "word_count": 751
    },
    {
      "scene_number": 7,
      "slugline": "EXT. - OPEN OCEAN. - DAY  WE PUSH IN ON A SPOT IN THE OCEAN -- A SINGLE BUBBLE POPS TO THE SURFACE --  AND THEN A FEW MORE -- QUICKLY WE SEE THE WATERS START TO CHURN AND BUBBLE -- AND SUDDENLY A MASSIVE SHIP IS RISING UP FROM THE DEPTHS OF THE SEA.  JACK AND BARBOSSA CLINGING TO THE DECK OF THE BLACK PEARL AS IT RISES OUT OF THE WATER -- THE MASSIVE SHIP NOW COMPLETELY RESTORED --  THE TWO MEN HOLDING ONTO THE DECK -- JACK CLINGING TO LIFE AS HE GASPS FOR AIR.   SEVERAL CREW MEMBERS HAVE SOMEHOW GRABBED ONTO THE SHIP AS WELL, INCLUDING PINTEL AND RAGETTI. JACK GETS TO HIS FEET -- LOOKS AROUND AT THE BLACK PEARL -- JACK SPARROW See -- just needed a bit more water. JACK SEES BARBOSSA LYING UNCONSCIOUS ON DECK -- JACK SPARROW (CONT’D) Hector...are you dead?   Don’t answer that if you are.   Maybe I should slap you -- always wanted to slap you -- Jack goes to slap him -- but Barbossa catches his hand. BARBOSSA Carina? Barbossa lifts himself up -- struggles to get to his feet. JACK STANDS NEXT TO HIM -- THE TWO OF THEM LOOK OUT AT THE SILENT MARY IN THE DISTANCE -- WATCH AS THE GHOST SHIP HEADS OUT TO SEA -- BARBOSSA (CONT’D) She’s gone, isn’t she? JACK SPARROW The dead took her.   And the sea. BARBOSSA I keep making the same mistake, Jack. Finding things not meant to be found. SUDDENLY THERE IS A FLASH OF LIGHT COMING FROM THE SILENT MARY -- A REFLECTION WAY OFF IN THE DISTANCE -- BARBOSSA (CONT’D) What is that?  106.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 280
    },
    {
      "scene_number": 8,
      "slugline": "EXT. - SILENT MARY. - CONTINUOUS AS THE SILENT MARY SAILS TOWARD THE BOUNDARY -- WE SEE CARINA ON DECK -- THE SUNLIGHT HITTING THE CHRONOMETER AROUND HER NECK AND REFLECTING ACROSS THE SEA -- EXT. - BLACK PEARL. - CONTINUOUS JACK SEES THE REFLECTION IN THE DISTANCE -- KNOWS IMMEDIATELY WHAT IT IS. JACK SPARROW Hector -- she’s alive. BARBOSSA Then there be only one question.   Is this still the fastest ship at   sea?  EXT. - SILENT MARY. - CONTINUOUS SCRUM AND GIBBS SLOWLY WAKE UP FROM THEIR POSSESSION -- SEE CARINA SITTING NEXT TO THEM.  GIBBS Excuse me, Miss, my clothes are all wet -- any idea how that might have happened? SCRUM And I seem to be missing my little finger.   Sliced clean off at the tip -- very strange. Scrum holds up his bloody hand. CARINA SMYTH Will you help me escape? EXT. - BLACK PEARL. - CONTINUOUS THE BLACK PEARL IS SPEEDING TOWARD THE SILENT MARY -- JACK AND BARBOSSA STANDING TOGETHER AS THE PEARL MAKES HER MOVE. INT. - SILENT MARY. - CONTINUOUS HENRY MADDOX IS MOVING THROUGH THE SHIP WITH OLIVIA -- OLIVIA Henry -- wait. HENRY MADDOX Come with me now.   We’ll take our chances at sea.  HE LEADS HER UP TO THE DECK -- WHERE CAPTAIN BRAND IS WAITING -- HOLDS JACK’S SWORD IN HIS HAND.  107.",
      "characters": [],
      "action_text": "CAPTAIN BRAND The Captain’s servant.   Did you come to hear another tale, boy? BRAND THROWS HENRY A SWORD -- CAPTAIN BRAND (CONT’D) Take your irons.   So you can die like a soldier. HENRY LIFTS THE SWORD -- HANDS SHAKING AS SHE STANDS IN FRONT OF THE CAPTAIN -- CAPTAIN BRAND LAUGHS -- AS DO THE OTHER GHOSTS ON DECK. CAPTAIN BRAND (CONT’D) I am not afraid! AND HENRY COMES AT HIM NOW -- CAPTAIN BRAND TOYING WITH HIM AS HE EASILY FIGHTS HIM OFF -- THEY FIGHT FOR A BEAT UNTIL HENRY’S SWORD IS KNOCKED FREE -- AND HENRY IS LEFT STANDING DEFENSELESS AGAINST THIS POWERFUL GHOST -- CAPTAIN BRAND (CONT’D) I’ll make this quick. BRAND COMES AT HIM -- BUT OLIVIA JUMPS IN FRONT OF HIM -- HENRY MADDOX Olivia!! THE SWORD GOES INTO HER -- AND BRAND QUICKLY REMOVES IT. HENRY LOOKS DOWN -- SEES THERE’S NO BLOOD -- HENRY MADDOX (CONT’D) Olivia? HE LOOKS AT HER -- SEES THAT SHE’S NOT IN PAIN -- HAS NO REACTION TO THE SWORD -- OLIVIA I’m sorry -- AND NOW HE STEPS BACK FROM HER -- OLIVIA (CONT’D) You returned for a ghost.  AND ALL AT ONCE HE REALIZES -- SHE’S BEEN DEAD ALL ALONG.  OLIVIA (CONT’D) I was killed that night at sea.   But my last thoughts were of you. HENRY TURNING BACK AS BRAND RAISES HIS SWORD --  108. CAPTAIN BRAND Now let’s finish this, boy. CAPTAIN BRAND ABOUT TO KILL HIM -- STOPS WHEN HE HEARS -- GHOST SOLDIER SHIP TO THE AFT!!! BRAND SEES THE BLACK PEARL CHARGING UP FROM BEHIND -- CAPTAIN BRAND Sparrow!! INT. - SILENT MARY. - CONTINUOUS Carina is MOVING THROUGH THE HULL OF THE SILENT MARY WITH GIBBS AND SCRUM -- GHOSTS COMING THROUGH THE WALLS -- COMING AT THEM FROM ALL ANGLES AS THEY MAKE THEIR ESCAPE -- THEY RUN TO THE STAIRS -- CLIMB UP TOWARD THE BACK OF THE SHIP -- AND THERE’S THE BLACK PEARL SAILING ALONG SIDE -- JACK SWINGS ACROSS FROM THE PEARL -- LANDS IN FRONT OF CARINA -- SHOCK AND DISBELIEF ON HER FACE AS HE HANDS HER THE ROPE -- JACK SPARROW See -- timing is everything. CAPTAIN BRAND CHARGING STRAIGHT THROUGH THE MAST -- COMING FOR HIM WITH THE OTHER GHOSTS",
      "dialogue_count": 0,
      "word_count": 1788
    },
    {
      "scene_number": 9,
      "slugline": "EXT. - BLACK PEARL. - CONTINUOUS  BARBOSSA IS AT THE WHEEL OF THE BLACK PEARL -- STARES DOWN OVER THE SIDE -- TRYING TO LOWER A ROPE -- MELIA APPEARS BEHIND HIM NOW -- SHE’S COME FROM THE SILENT MARY -- SHE CUTS THE ROPE IN HIS HANDS -- SWINGS HER DAGGER TOWARD BARBOSSA -- THE INJURED PIRATE FIGHTING HER OFF -- MELIA BACKING HIM UP -- MELIA ‘Tis time to die. BARBOSSA DRAWING BLACKBEARD’S SWORD -- TRYING TO FEND HER OFF -- BUT HER POWERS ARE TOO STRONG NOW -- MELIA (CONT’D) That sword will not save you -- SHE’S USING HER POWERS TO PUSH HIS SWORD TO THE SIDE -- LEAVING BARBOSSA WITH NO WEAPON.  EXT. - OCEAN FLOOR. - CONTINUOUS  JACK AND CARINA ARE RACING THROUGH THE SHIPWRECKS -- TREASURE STREWN ABOUT -- THE CARGO OF EACH SHIP LYING UNTOUCHED AT THE BOTTOM OF THE SEA.   THEY CLIMB A TALL BED OF SEAWEED AND SLIDE DOWN THE OTHER SIDE --  THEY RUSH THROUGH THE NOW SUNKEN CAVE THAT HELD THE MAP -- JACK STOPPING FOR A BEAT TO EYE THE DIAMONDS ON THE WALLS --  CARINA SMYTH JACK -- THERE!! SHE MOTIONS TO THE GOLDEN TOMB IN FRONT OF THEM -- BOTH LOOK BACK -- THE SILENT MARY IS SAILING ACROSS THE SAND DUNES AT THE BOTTOM OF THE SEA --  EXT. - BLACK PEARL. - CONTINUOUS  BARBOSSA IS BACKING UP FROM MELIA.   SHE’S GOT HIM CORNERED NOW -- IS READY TO KILL HIM. MELIA Your secret is safe, Captain Barbossa. She’ll never know the truth.   Dead Men Tell No Tales.  SUDDENLY A KNIFE IS PLUNGED INTO MELIA’S BACK -- AND SHE LETS OUT A HORRIBLE SCREAM --  114.",
      "characters": [],
      "action_text": "HENRY MADDOX IS BEHIND HER -- THE KID IS HOLDING BLACKBEARD’S SWORD -- HOLDS IT LIKE A SOLDIER -- AS SHE TURNS AND STABS HIM WITH HER DAGGER --  HENRY AND MELIA LYING SIDE BY SIDE ON THE DECK -- HENRY LOOKS UP AS OLIVIA APPEARS BEFORE HIM.   SHE’S WITH HIM - - HOLDING HIM -- OLIVIA It’s okay.   We’ll be together now. SUDDENLY WE SEE AGONY IN HENRY’S EYES -- AN AGONY NOT FROM ANY PAIN -- HENRY MADDOX I’m sorry.   I can’t come with you. HENRY SLOWLY SITS UP -- LOOKS AT HER.   AND NOW SHE SEES HE’S GOING TO LIVE.   IT’S THE WITCH WHO HAS DIED. OLIVIA I’ll be waiting. SHE KISSES HIM -- A LONG KISS THAT SHE KNOWS WILL BE HER LAST.   SHE THEN SLOWLY STEPS BACK -- OLIVIA (CONT’D) Forever.  EXT. - OCEAN FLOOR. - CONTINUOUS  JACK AND CARINA ARE AT POSEIDON’S TOMB -- BOTH STRUGGLING TO PUSH THE HEAVY LID ASIDE -- AS CAPTAIN BRAND APPEARS BEFORE THEM WITH JACK’S SWORD. THEY STAND FROZEN BEFORE BRAND AND HIS DEAD MEN. CAPTAIN BRAND This is your sword, Jack Sparrow. BRAND HOLDS JACK’S SWORD IN FRONT OF HIM -- CAPTAIN BRAND (CONT’D) It will cut your throat -- exactly as I cut my own -- JACK SPARROW This was the part I was hoping to avoid. AND NOW BRAND LIFTS JACK’S SWORD -- JUST AS THE WITCH PREDICTED -- SWINGS IT DOWN --  115. BUT AT THE LAST SECOND JACK RAISES THE TRIDENT IN FRONT OF HIM -- THE SWORD SLICING THROUGH THE TRIDENT -- SPARKS FLYING AS THE TRIDENT IS CUT IN HALF --  WE SEE THE ANCIENT SCEPTER DROP TO THE SAND -- EVERYTHING TURNING DARK AND GRAY -- THE GROUND STARTING TO SHIFT -- THE SAND PARTING -- AND A HOLE STARTS TO OPEN --  AS THE DEAD START TO CRAWL OUT FROM THE BOTTOM OF THE SEA --  ALL OF THE DEAD WHO WERE KILLED BY BRAND IN THE TRIANGLE -- GHOSTS CRAWLING OUT FROM THE DIRT AND MUCK AND OUT OF THE SHADOWS -- SAILORS AND SOLDIERS ALIKE STANDING TOGETHER -- BRAND AND HIS MEN NOW SURROUNDED BY THESE GHOSTS -- GHOSTS WHO ARE LED BY ERIC BRAND -- WHO NOW HOLDS THE TRIDENT. ERIC You killed these men.   Sank their ships.   They died by your hand and were forced thro",
      "dialogue_count": 0,
      "word_count": 1715
    }
  ]
}