{
  "slug": "pitch-perfect-2-2015",
  "title": "pitch perfect 2",
  "genre": "action",
  "format": "film",
  "scenes_count": 11,
  "characters_count": 10,
  "characters": [
    "REPRESENTATIVE",
    "JESSE",
    "BUMPER",
    "FAT AMY",
    "FLO",
    "SAMMY",
    "SNOOP",
    "BENJI",
    "AUBREY",
    "EMILY"
  ],
  "total_words": 23836,
  "total_dialogue": 13,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. KENNEDY CENTER STAGE - CONTINUOUS 6   6  The mash-up comes to an end, and they sing the last line from “America the Beautiful.” BELLAS FROM SEA TO SHINING SEA! The ladies TRANSITION TO:   Miley Cyrus’s “Wrecking Ball.”   From the rafters descends... FAT AMY! She wears a sparkly leotard and sits in a harness with billowy white material flowing from her. She looks like an angel. As she descends: FAT AMY I CAME IN LIKE A WRECKING BALL!/I NEVER HIT SO HARD IN LOVE!... GAIL   (O.C.) Wow! What a surprise! JOHN   (O.C.) An overweight girl dangling from the ceiling. Who hasn’t had that dream? GAIL Lots of us! FAT AMY ...I CAME IN LIKE A WRECKING BALL! As the song continues, each Bella grabs on to a piece of material attached to Fat Amy’s harness. It looks super cool, like something out of Cirque du Soleil. As Fat Amy spins thirty feet above the stage, FAT AMY (CONT’D) DON'T YOU EVER SAY I JUST WALKED AWAY/I WILL ALWAYS WANT YOU... During a move, Fat Amy FLIPS upside down, losing control. As she tries to correct her position, her leotard rips at the seam with her back to the audience EXPOSING her BUTT CHEEKS! The audience gasps! Thrown, the Bellas stop singing. Beca looks up in shock. BECA Goodbye innocence.  BACK ON JOHN AND GAIL, who hold on to each other’s shoulders.  \"Pitch Perfect 2\"   SHOOTING DRAFTS   5-11-14   4.  CONTINUED: 5   5  (CONTINUED)",
      "characters": [
        "REPRESENTATIVE",
        "JESSE"
      ],
      "action_text": "JOHN (O.C.) She has no underwear on. We have a commando situation! There is a commando situation on stage! ANGLE ON: A stern-looking President and First Lady. GAIL (O.C.) Who is on top of this?! INT. KENNEDY CENTER - TECH BOOTH - CONTINUOUS 7   7  TECH GUYS frantically hit buttons to try to prevent the impending situation. INT. KENNEDY CENTER - STAGE - CONTINUOUS 8   8  Balloons are RELEASED from the rafters,   “Hail to the Chief”  begins playing over the PA. Upstage, an American flag UNFURLS and a big birthday cake ROLLS out on a cart. ON STAGE: The harness TURNS Fat Amy very slowly so that she’s about to face the audience. Her arms are caught up in fabric and she can't cover her privates! GAIL (O.C.) Take her back up already! JOHN She’s turning. She’s turning -- GAIL Oh my god, the children! Would somebody think of the children! John SLAPS a hysterical Gail across the face. ON STAGE: As Fat Amy is almost squarely showing her bits to the audience, FAT AMY Avert your eyes or take it all in! You need to make a choice! GAIL (O.C.) Not the front! Nobody wants to see the front! The harness comes to a stop with Fat Amy FLASHING the audience with downtown full frontal. ANGLE ON: Reactions of shocked anticipation from the Bellas, audience members, and John and Gail. CUT TO MAIN CREDITS:  \"Pitch Perfect 2\"   SHOOTING DRAFTS   5-11-14   5.  CONTINUED: 6   6 INT. CREDIT SEQUENCE - MONTAGE 9   9  A montage of clips featuring several NEWS PERSONALITIES covering “Muff-gate.” Some clips feature gifs of Fat Amy, hanging exposed with her downtown pixillated. LOCAL NEWS ANCHOR Happy birthday, Mr. President. The Australian singer who calls herself “Fat Amy” gave the President a birthday gift from “down under” during last night’s celebration held at the Historic Kennedy Center. (turns to co-host) And if you’re wondering what I mean by down under, Chip. I’m talking about her vagina. She showed her vagina. To the President. TODAY SHOW HOST All eyes were on The Barden Bellas -- JAKE TAPP",
      "dialogue_count": 2,
      "word_count": 3249
    },
    {
      "scene_number": 2,
      "slugline": "EXT. ELECTRIC PONY RECORDING STUDIO - CURBSIDE - DAYS LATER 18   18  ESTABLISHING SHOT. Jesse’s car pulls into frame. INT. CAR/EXT. ELECTRIC PONY RECORDING STUDIO - CONTINUOUS 19   19  Jesse and Beca pull up in Jesse’s car outside the main entrance of a hip-looking recording studio. JESSE Lil Wayne’s recorded here, huh? BECA Yep. And was arrested here twice. (then) Can you believe they hired me? JESSE Of course I can. You rock the party that rocks the body. BECA I don’t... know... where to begin with that. They both exit the car. Jesse walks around to Beca who pulls her computer bag from the back seat. JESSE So... Any first day jitters? BECA (a little cocky) Nah, you know me. I’m just gonna act all moody and distant. Artists love it. JESSE You’re all so tortured inside. Try buying a kitten. BECA You don’t buy kittens. You can get them free, literally, anywhere. JESSE There it is! That’s what hooked me! Beca cracks a smile. BECA Dude, why do I feel so guilty about taking this internship?  \"Pitch Perfect 2\"   SHOOTING DRAFTS   5-11-14   20.  (MORE)  (CONTINUED)",
      "characters": [],
      "action_text": "I’ve given a lot to the Bellas, like three years of my life. JESSE Yeah, Bec, you shouldn’t feel guilty for taking your shot. BECA This is a big deal, right? JESSE Yes. This is a very big deal. Beca kisses Jesse goodbye and heads inside. He shouts after her. JESSE NOTHIN’ GONNA STOP MY GIRL! BECS IN EFFECTS Y’ALL! BECA Please don’t embarrass me. BECA (laughing) You can go now! Beca turns the corner of the building. Jesse gets back in the car and drives off. OMIT 20 20   20  OMIT 21 21   21  OMIT 22 22   22  EXT. BELLA HOUSE - LATER 23   23  ESTABLISHING SHOT of the Bella house, a nice two-story colonial. It’s currently toilet-papered and egged. INT. BELLA HOUSE - DAY 24   24  At the kitchen table, Fat Amy, Flo and Stacie go through a huge stack of letters. Chloe is busy on her laptop. STACIE It’s been months. We’re still getting hate mail? FAT AMY You’d think my vagina beat up Rihanna.  \"Pitch Perfect 2\"   SHOOTING DRAFTS   5-11-14   21.  CONTINUED: 19   19  BECA (CONT'D)  (CONTINUED) Chloe hits a button on the computer. CHLOE Okay, we’re officially registered. Update your passports, ladies. ‘Cause we’re headed to the very sunny, very beautiful... COPENHAGEN! They all jump up and down, excited. FAT AMY Yeah! Where is that? CHLOE No idea! I failed Maps! FAT AMY How is that a course?! CHLOE (off computer) Looks like it’s been dominated by that stupid German team that took over our tour. STACIE You mean stole our tour. FAT AMY Word. We need to scout those schweinhunds. Fat Amy picks up one of the letters. FAT AMY (CONT’D) But I’m not worried. When we win, we can stick it to these chumps who sent us all this hate mail, like -- (off letter) Sonia Sotomayor. REVEAL: The letter says “DIE BITCHES” in big, black letters. FAT AMY (CONT’D) Judge-y bitch. The Bellas are back! CHLOE Where’s Beca? She’s missing all the fun! Fat Amy shrugs as we CUT TO:  \"Pitch Perfect 2\"   SHOOTING DRAFTS   5-11-14   22.  CONTINUED: 24   24",
      "dialogue_count": 0,
      "word_count": 536
    },
    {
      "scene_number": 3,
      "slugline": "INT. EP RECORDING STUDIO - HALLWAY/BULLPEN - DAY 25   25  FLASH! Beca, disoriented by a flashbulb, gets her picture taken. THE SAME PICTURE is hung around her neck on a big green ID Badge. IN QUICK SUCCESSION:   She POPS coffee pods into three different machines lined up on a kitchen counter and hits three different brew buttons. She grabs a bag of chips and holds it with her mouth. Then, grabs several coffees. Beca walks briskly through a super hip office, gold and platinum records lining the walls. She takes a wrong turn, corrects herself, and finally lands in a bullpen. She hands out coffee to HIPSTER EMPLOYEES who don’t even look at her. A hipster employee, DAX, talks on the phone and SNATCHES the chips right out of her mouth. BECA Thanks. I was having a hard time breathing. Anything else I -- Dax impatiently WAVES her away. Beca nods “got it.” Then, SAMMY, 40s, a music producer who is always wearing designer t-shirts, sunglasses and a ball cap, sweeps in. SAMMY Okay, everybody huddle up. Let’s go! Let’s go! To the table please! A dozen EMPLOYEES from all over the studio begin crowding into the bullpen. Following their lead, Beca DRAGS a chair over. An IN-CHARGE WOMAN smiles and takes it, assuming Beca brought it for her. Beca awkwardly sits on the floor.  SAMMY (CONT’D) Come on. Last one in has to help Frank watch Youtube videos to find the next Justin Bieber. PAN OVER to a really young millenial, FRANK. FRANK Hey, I’m turning twenty-five next week if anyone wants to get drinks, celebrate...  \"Pitch Perfect 2\"   SHOOTING DRAFTS   5-11-14   23.  (CONTINUED)",
      "characters": [
        "BUMPER"
      ],
      "action_text": "SAMMY Frank, less talk. More watching kids in their bathrooms play guitar. (then) Okay, my people. Check it. Sammy PUSHES a button on a remote. On a projection screen, CALVIN “SNOOP LION” BROADUS, in a three-piece suit, stands at a candlelit gathering, surrounded by MULTI-CULTURAL CHILDREN. SAMMY (CONT’D) That is -- The screen stops working. A frustrated Sammy turns to Dax. SAMMY (CONT’D) Dax, did you call the tech guy? DAX Yeah I talked to him. SAMMY (shakes head) Do you understand that everything else in my life works? DAX Uh huh. SAMMY So I just need everything in here to work, too. DAX He said he was gonna call me back -- SAMMY Oh my god. DAX You want me to call him now? SAMMY (beyond frustrated) Don’t... you do it now. DAX (suddenly nervous) Okay. Sammy hits a button on the remote.  \"Pitch Perfect 2\"   SHOOTING DRAFTS   5-11-14   24.  CONTINUED: 25   25  (CONTINUED) SAMMY There we go. (puts remote down) That is the lion himself, legendary Snoop D-O-Double-G singing “White Christmas” at a tree lighting ceremony in Moscow. They all react, “nice.” SAM He was so moved by the power of music to unite the world or some shit that now he wants to drop a cool Christmas album, put his spin on the classics. And because I sleep on a bed of Grammys, he’s hired me to produce it. There’s a murmur of excitement.  DAX But Snoop Dogg already put out a Christmas album -- SAMMY If you’d listened to it like I did -- stranded in the air with T.I. on a golden hang glider, then you would have known that it wasn’t the classics. I’ve had to listen to that album on two different occasions... Hang glider with T.I. and also on a rocket ship that Eminem built. It doesn’t go anywhere, but he’s got dreams for it, okay? So I need you to close your mouth. (then, re: screen) Herein lies the problem. Last I checked there are over a million Christmas albums -- with the same ten damn songs on them. So we need all hands on deck to come up with ideas on how to make this one stand out. You got me? Fire",
      "dialogue_count": 1,
      "word_count": 2700
    },
    {
      "scene_number": 4,
      "slugline": "EXT. TREBLE HOUSE - POOLSIDE - CONTINUOUS 32   32  Beca and Jesse cross over to the Bellas.   Excited to see her, they cheer like belligerent drunks. BELLAS/CHLOE BECA!/YEAH!/GET OVER HERE, YOU DIRTY SLUT! BECA (re: “dirty slut”) I know you’re just trying to reclaim that word, but it’s still not cool to say-- They PULL Beca into a small Bella dance circle. BECA (CONT’D) OH MY GOD! The Bellas JUMP up and down, laughing and singing to the music. Chloe, caught up in the moment, RIPS off her shirt. CHLOE WE’RE GOING TO THE WORLDS! She CANNONBALLS into the pool in her pants and bra. CHLOE (CONT’D) (resurfacing) Who’s with me? COLLLLLEGE! All the partygoers look at each other, “not interested.” Stacie turns to Cynthia Rose. STACIE Eh, this is kind of a nice blouse. CYNTHIA ROSE My phone is in my pocket. Chloe SPLASHES wildly. CHLOE (CONT’D) C’mon! Everybody in the pool! Bumper DIPS just his toe in. BUMPER Ooh, brisk! FAT AMY The pool’s not happening, Chlo. An overly excited Emily approaches Beca.  \"Pitch Perfect 2\"   SHOOTING DRAFTS   5-11-14   36.  (CONTINUED)",
      "characters": [
        "FAT AMY",
        "FLO",
        "SAMMY",
        "SNOOP"
      ],
      "action_text": "EMILY Holy moly, I am so excited to meet the woman who single-handedly created the Bella sound. I can’t believe we’re sisters! BECA Oh right, Chloe texted me we added a legacy. I didn’t even know that was a thing but hey, good for you. Whatever works. EMILY Yeah, I admit it. I have a lot to prove. But I’m equal to the task. I’m an open vessel and ready to drink of your knowledge. Emily stares at Beca with awe, kind of creeping Beca out. BECA (smiles) Well, it was nice to meet you... I think I’m going to go stand somewhere else. Beca crosses away. Emily reacts, “that wasn’t great.” Just then we ANGLE ON: Squeaks, running wildly with Benji trying to catch him. Squeaks escapes into the pool. TIGHT ON: Lilly, who pops up from the water. She darts her eyes only to go back under. Everyone laughs and sings the night away. ANGLE ON: Fat Amy and Bumper discreetly walking off together. INT. CONVENTION CENTER - CAR SHOW/LOBBY - NEXT DAY 33   33  PEOPLE mill about a large convention hall with several cars on display. The partied-out Bellas cross through the exhibition floor and on to an escalator led by Stacie. All by Emily is hungover. BECA Slow up. I’m not really awake yet. STACIE Last night was epic. CYNTHIA ROSE Until it got weird.  \"Pitch Perfect 2\"   SHOOTING DRAFTS   5-11-14   37.  CONTINUED: 32   32  (CONTINUED) LILLY I   got   adopted   by   a   family   of   cockroaches. BECA (to Fat Amy) What happened to you? We couldn’t find you anywhere. FAT AMY Oh... it was nothing embarrassing. (clearly lying) I just had to rush home and put some yogurt... on my hemorrhoids. Fat Amy HITS her own forehead, disappointed in her lie. CHLOE Guys, focus up. We’re here for one reason: to scout the competition. EMILY It’s totally going to help us win the World’s if we know what we’re up against. CHLOE So where the hell are these tour thieves? Chloe looks around, then sighs. CHLOE (CONT’D) Aw, c’mon. REVEAL: Stacie, rubbing up against a sporty CAR while BUSINESSMEN take photos. FAT AMY Je",
      "dialogue_count": 5,
      "word_count": 3469
    },
    {
      "scene_number": 5,
      "slugline": "INT. MANSION - FOYER/SITTING ROOM - MOMENTS LATER 43   43  Sir Willups   leads the Bellas on a skooter through a gorgeous foyer and sitting room into his kitchen. All nouveau riche. SIR WILLUPS Standing in front of you, ladies, happens to be the world’s biggest a cappella fan. BECA Great! We found you! (then) What can we do for you? SIR WILLUPS So last week when I was having a tinkle, it occurred to me -- Fat Amy touches a ceramic goose that’s sitting on a counter. SIR WILLUPS (CONT’D) DO NOT! FAT AMY (hands up) Sorry. SIR WILLUPS That was rude. You do not come into a gentleman’s house and touch his goose. BECA So are we early...? Or -- SIR WILLUPS Actually, you’re pretty late. Sir Willups gets on a skooter. SIR WILLUPS (CONT’D) Let’s go! The ladies follow him into... INT. MANSION - STAIRCASE - CONTINUOUS 44   44  He leads them down a set of stairs. At the bottom: SIR WILLUPS This is the big time.  \"Pitch Perfect 2\"   SHOOTING DRAFTS   5-11-14   53.  (CONTINUED)",
      "characters": [
        "FAT AMY"
      ],
      "action_text": "He opens some curtains REVEALING: INT. MANSION - BASEMENT SPEAKEASY - CONTINUOUS 45   45  A crowd of BEAUTIFUL PEOPLE mingle, awaiting the festivities. Sir Willups disappears into the crowd. The Bellas wander into the space trying to figure out what’s happening. FLO Only a man who sells the white powder lives like this. Suddenly, the Bellas pull up, stopped behind Chloe. CHLOE Das Sound Machine, ten o’clock. The Bellas turn slightly to their left. No DSM. Beca turns slightly to her right. DSM! BECA Two o’clock, Chloe. Are you failing clocks too? The Kommissar and Pieter approach them. KOMMISSAR (to Beca) Tiny Mouse, we meet again. Have you abandoned your foolish plans to face us at the Worlds? BECA You wish you... gorgeous specimen -- (to Chloe) She’s really in my head. KOMMISSAR Very well.   I’ll be happy to send you there. I’ll mail you. Large envelope. Cost nothing. PIETER Well it would cost more than nothing. But it’s still cheaper than sending like a horse, or an adult moose -- BECA (dander up) You know what, did you ever stop and think that you're too big? It would cost a fortune to mail you!  \"Pitch Perfect 2\"   SHOOTING DRAFTS   5-11-14   54.  CONTINUED: 44   44  (CONTINUED) Chloe pulls Beca away. Jesse walks up to them. They are both surprised to see each other. JESSE Hey! BECA Hey! What are you doing here? What is going on? A start of an announcement... JESSE I guess I gotta go. BECA Why? Jesse crosses away. INT. MANSION - BALLROOM - CONTINUOUS 46   46  Suddenly, the lights dim and A SPOTLIGHT shines down in the middle of the room on our host, Sir Willups. SIR WILLUPS Welcome, welcome to the first ever showdown of the National A Cappella Laser Ninja Dragon League! The spectators cheer while the teams look confused. SIR WILLUPS (CONT’D) Can you dig iiiiiit?! To begin, let’s meet the teams! First we have The Treblemakers! In a corner of the room, A SPOTLIGHT shines down on the Treblemakers. The crowd APPLAUDS. SIR WILLUPS (CONT’D) Next up. The Tone Hangers! ",
      "dialogue_count": 1,
      "word_count": 4856
    },
    {
      "scene_number": 6,
      "slugline": "INT. AUDITORIUM - AUDIENCE - CONTINUOUS 59   59  BACK WITH JOHN AND GAIL: GAIL Everyone in this room can see the Bellas have no shot at reinstatement. What an embarrassment to a cappella and all that it stands for. JOHN They’ve taken something I care deeply about and shoved it into a chemical toilet. I hope they all die unloved. The Bellas drag themselves off stage in disgrace. EXT. ROAD - BELLA BUS - LATER 60   60  Establishing shot of the Bella bus driving down the road. INT. BELLA BUS - CONTINUOUS 61   61  The ladies sit quietly with hangdog expressions. Ashley drives. Cynthia Rose sports a head wrap. A couple Bellas have ice packs on various body parts. Beca and Emily sit side by side. Beca’s staring at her computer hitting random notes on piano app. Emily’s hand flies over her notebook. She’s furiously writing. Beca can’t help but notice and reads over her shoulder. BECA (quietly) Is that for a class? EMILY Oh, no. It’s just that when I’m stressed words just sort of flow out of me and I try to channel them into my songwriting as much as I - BECA - Got it. Chloe stands suddenly. CHLOE Are we just going to ignore what happened back there? You guys, the Worlds are only three weeks away!  \"Pitch Perfect 2\"   SHOOTING DRAFTS   5-11-14   76.  (MORE)  (CONTINUED)",
      "characters": [
        "BENJI",
        "AUBREY"
      ],
      "action_text": "And you’re all acting like we didn’t just eat a big bag of dicks! Everyone snaps to attention. CYNTHIA ROSE Why are you yelling at me? I almost burned to death because of you aca- bitches. FAT AMY You’re right. I am a hero. (then, to Cynthia Rose) But if you almost died, it’s only because you were standing in the wrong spot. CYNTHIA ROSE ’Cause Flo flipped into me! FLO Sure, blame the minority. CYNTHIA ROSE I’m black, gay, and a woman. STACIE Our little sideshow act isn’t working! CHLOE Uh doi, Captain Obvious. Do you have a better idea? STACIE I’m not supposed to have the ideas! I’m the hot one! FAT AMY I thought I was the hot one. EMILY Maybe we should stop blaming each other and just focus on singing together. They all sigh in disgust. Then, apropos nothing: LILLY I   have   ten   knives   on   me   at   all   times.  \"Pitch Perfect 2\"   SHOOTING DRAFTS   5-11-14   77.  CONTINUED: 61   61  CHLOE (CONT'D)  (CONTINUED) CHLOE Okay, let’s regroup. Clearly we’re not going to beat Das Sound Machine at their game. So we need to figure something else out. Like, now. (then) At times like these, there’s only one thing to do-- FLO Put a reed in your mouth and bury yourself. CHLOE Close. Free up your weekend, ladies. We’re going on a retreat. Ashley HITS the brakes, sending the already beat-up ladies forward. She turns around. ASHLEY A what?! (then, normal) I honestly didn’t hear you. A what? INT. BARDEN STUDENT UNION - CAFE - DAY A62   A62  Emily sits with Katherine at a small table. KATHERINE Look, this retreat is a good thing. You girls need to bond. It builds morale, focuses the group’s energy-- EMILY I don’t know. It’s pretty bad. Girls were yelling at each other-- KATHERINE Big deal. I remember putting your Godmother, Maggie Pistol, in a choke hold when she insisted George Michael was gay. So crazy. How could “Careless Whisper” be about two dudes--? EMILY I’m just worried my entire Bella career will be that one terrible performance. I’ll never solo at Lincoln Center, y",
      "dialogue_count": 3,
      "word_count": 5902
    },
    {
      "scene_number": 7,
      "slugline": "EXT. TREBLE HOUSE/LAKE - CONTINUOUS 88   88  Bumper and the Trebles exit the house to   see Fat Amy, PADDLING across the lake in the skiff we saw earlier. As she paddles, she BELTS out   Pat Benatar’s “We Belong.”  FAT AMY MANY TIMES I TRIED TO TELL YOU/MANY TIMES I’VE CRIED ALONE... (song continues)/WE BELONG TO THE SOUND OF THE WORDS/WE'VE BOTH FALLEN UNDER... BACK ON: Bumper and the Trebles, shocked at what they’re witnessing. Bumper is not on board. BUMPER Nope! Turn it around! I don’t want to see you! Fat Amy is only halfway across the lake and very winded. FAT AMY I really thought I was going to be farther than this. She resumes paddling and singing with gusto. EXT. BELLA HOUSE/LAKE - SAME TIME A89   A89  Beca, Chloe and Lilly enjoy some ice cream on their front steps. They watch Fat Amy row with amusement. CHLOE Why didn’t she just walk around the lake? BECA Fat Amy doesn’t do anything small. Emily enters on the phone. EMILY (INTO PHONE) Yeah, I love you, too. Here she is. She hands it to Beca. BECA What’s up, Mrs. Junk? EXT. TREBLE HOUSE/LAKE - CONTINUOUS B89   B89  Fat Amy, now across, crawls up the side to get to the road.  \"Pitch Perfect 2\"   SHOOTING DRAFTS   5-11-14   105.  (CONTINUED)",
      "characters": [],
      "action_text": "FAT AMY MAYBE IT'S A SIGN OF WEAKNESS/WHEN I DON'T KNOW WHAT TO SAY/MAYBE I JUST... NOW THERE’S NO LOOKING FORWARD/NOW THERE’S NO TURNING BACK WHEN -- She stands on the side of a busy street to catch her breath. A car SLOWS, thinking she’s about to run through traffic. Frustrated, she yells: FAT AMY (CONT’D) GOOOOOOOOO! Well, what are you doing? I’m soloing here! Whatever! The car finally drives away. Fat Amy snaps back into her solo and heads toward Bumper. FAT AMY (CONT’D) WE BELONG TO THE NIGHT/WE BELONG TO THE THUNDER...! BUMPER No! FAT AMY WE BELONG/Bumper and Fat Amy WE BELONG TOGETHER/WAS IT...?/CLOSE YOUR EYES... Bumper reacts, defiant. But then: BUMPER CLOSE YOUR EYES AND TRY TO SLEEP NOW/CLOSE YOUR EYES AND TRY TO... FAT AMY/BUMPER WE CAN’T BEGIN TO NOTICE/HOW MUCH WE REALLY CARE...WE BELONG TO-- Bumper KISSES Fat Amy romantically. Then, it gets raunchy. Everyone looks around, uncomfortable. Through kisses: BUMPER I just love kissing! INT. EP RECORDING STUDIO - BOOTH - LATE NIGHT 89   89  Beca and Emily work on recording, “Flashlight.” They’re both in heaven. Emily sings lead vocals. We JUMP CUT to: Sammy, listening to their newly collaborated song, “Flashlight” with Beca and Emily next to him.  \"Pitch Perfect 2\"   SHOOTING DRAFTS   5-11-14   106.  CONTINUED: B89   B89  (CONTINUED) EMILY(THROUGH SPEAKERS) ...GETTING ME THROUGH THE NIGHT... Sammy stops the song and turns to them. SAMMY (to Beca) Okay, so you produced this? BECA Yes, Emily wrote it. SAMMY Who is Emily? BECA This tall drink of water right here. SAMMY (re: song) Well... Ummmm... Gosh, I don't like it. The ladies react, deflated. SAMMY (CONT’D) I don't like it when people can do what I can do. In a manner of speaking, it’s threatening. But uh, you just did it. And I -- I have a few notes that I assume that you are open to. But this is a solid demo with real potential. Yeah, I look forward to working together. Beca and Emily beam. As Sammy exits, SAMMY (CONT’D) I gotta go jump on a call. Lady Ga",
      "dialogue_count": 0,
      "word_count": 626
    },
    {
      "scene_number": 8,
      "slugline": "EXT. MAPS - LATER We see different destinations highlighted on a Google Earth style map. It becomes the... EXT. COPENHAGEN - DAY Map that Beca is holding in her hands. Beca walks in the rain with Emily and Lilly. BECA Okay, is there a restaurant in this town that serves something other than fish. EMILY I did see a KFC back there. BECA Nope. All fish. I checked. CHLOE (O.C.) Guys! Over here! Beca, Emily, and Lilly turn a corner and run into Chloe, Flo, and Fat Amy. BECA Chloe, I’m coming for ya. They walk down a rainy street. CHLOE Whoo hoo! College graduate! Spread my wings, y’all! FAT AMY There’s so many fresh danishes here. I swear if I wasn’t recently locked down, I would tear a hole through this city. FLO This place is so smelly and rainy. Why would anyone ever leave America. FAT AMY Culture, design, history -- place They turn a corner and REVEAL: A beautiful city.  \"Pitch Perfect 2\"   SHOOTING DRAFTS   5-11-14   108.  (CONTINUED)",
      "characters": [
        "EMILY"
      ],
      "action_text": "FLO I’m not Copen-hating this place. FAT AMY It wasn’t funny on the plane, it’s not funny now. EXT. WORLD CHAMPIONSHIP OF A CAPPELLA - EARLY MORNING 91   91  The Bellas crest a hill. Laid out before them is a huge outdoor stage flanked by international flags, tents, towers of amps. Stagehands and vendors set up, awaiting a massive crowd. CHLOE Well, here we are. (then) Is the stage big enough for what we want to do? FAT AMY (taking it in) Yeah. It should be. Emily turns to Beca. EMILY You think it’ll work? BECA It’ll work for us. That’s all that matters. Flo cartwheels towards the stage. The girls follow, excited. EXT. WORLD CHAMPIONSHIP OF A CAPPELLA - DAY TO NIGHT 92   92  MUSIC UP: Journey’s “Any Way You Want It” sung by   PENN MASALA over a series of time-lapse establishing shots. Cars pull up, PEOPLE file in... PENN MASALA ANY WAY YOU WANT IT/THAT’S THE WAY YOU WANT IT. ANY WAY YOU WANT IT. John and Gail speak over a series of international groups performing “ Any Way You Want It ” in their native language. (Penn Masala in Hindi, The Filharmonic in Tagalog, The Soweto Gospel Group in accented English, The Latinotes in Spanish) JOHN (O.C.) Here it is folks. The granddaddy of them all.  \"Pitch Perfect 2\"   SHOOTING DRAFTS   5-11-14   109.  CONTINUED:  (MORE)  (CONTINUED) The World Series, the Olympics, the “Lost” finale all wrapped up in this one night... GAIL (O.C.) Bup-bup-bup. Don’t tell me. I’m going to watch it eventually-- JOHN (O.C.) Dammit, Gail! EXT. WORLD CHAMPIONSHIP OF A CAPPELLA - DAY TO NIGHT 93   93  Camera PANS across a bunch of press tables with COMMENTATORS from various countries, landing on John and Gail. JOHN The World Championship of A Cappella! GAIL Tonight, groups from all over the globe duke it out for the coveted title of Aca World Champion. JOHN Representing America are the embattled Barden Bellas. GAIL The Bellas are making one last attempt to repair their damaged legacy by becoming the first American team to claim the title. You think ",
      "dialogue_count": 1,
      "word_count": 1001
    },
    {
      "scene_number": 9,
      "slugline": "EXT. WORLD CHAMPIONSHIP OF A CAPPELLA - PRESS TABLES - 96   96  CONTINUOUS JOHN Wow! That was something special. If the Bellas of old show up, this could go down as the most significant conflict between America and Germany in history. GAIL Crack a book, John. JOHN No thank you. EXT. WORLD CHAMPIONSHIP OF A CAPPELLA - BACKSTAGE/ON THE 97   97  GRASS - CONTINUOUS As they exit the stage, the audience chants: AUDIENCE DAS SOUND MACHINE! DAS SOUND MACHINE...! (continues) DSM confronts The Bellas. KOMMISSAR You hear that? They chant. For us. But don’t cry too hard when you lose. Makes eyes puffy. BECA Your hands are so soft. KOMMISSAR I’m sorry, I don’t speak loser. What did you say? PIETER She actually speaks eight languages and loser is not one of them. KOMMISSAR Everything must come to an end. Even The Bellas. As they cross away, BECA Ha, ha! Your sweat smells like cinnamon! Dammit!  \"Pitch Perfect 2\"   SHOOTING DRAFTS   5-11-14   113.  (CONTINUED)",
      "characters": [],
      "action_text": "Das Sound Machine crosses away. The Bellas huddle back up, excited yet anxious to take the stage one last time. BECA (CONT’D) This is it. Our last performance. The ladies hold on tight to each other. Chloe’s near sobbing. CHLOE We need to go out there and beat DSM. This ones for us! They squeeze each other a little tighter. FAT AMY Guys, there’s going to be some haters out there. They are going to look at us -- Team USA -- and wonder why is the most talented one Australian. (then, hitting belly) Well I’m fat so that is close enough. We are going to show them who we are -- a bunch of ethnically diverse, for the most part feminine, amazing singers! Let’s go out there and Ac’ the world! EXT. WORLD CHAMPIONSHIP OF A CAPPELLA - AUDIENCE - CONT 98   98  ANGLE ON: Benji in the audience, where he has been handing something out to the crowd. BENJI (to each person) You’ll know what to do... EMCEE   (ON STAGE) Next up, representing the United States, please welcome the Barden Bellas! EXT. WORLD CHAMPIONSHIP OF A CAPPELLA - PRESS TABLES - 99   99  CONTINUOUS As the Bellas take the stage: GAIL John, it’s possible we’re watching the last hurrah of the Barden Bellas. JOHN It’s going to be very difficult for them to pull this off. But if they don’t, it is over.  \"Pitch Perfect 2\"   SHOOTING DRAFTS   5-11-14   114.  CONTINUED: 97   97",
      "dialogue_count": 0,
      "word_count": 410
    },
    {
      "scene_number": 10,
      "slugline": "EXT. WORLD CHAMPIONSHIP OF A CAPPELLA - STAGE - CONTINUOUS 100   100  The ladies stand on stage and do a clap, snap, hand routine. It’s complex and super cool. Then, they begin singing Beyonce’s,   “Run The World (Girls).”  BELLAS WHO RUNS THE WORLD? GIRLS. WE RUN THIS MOTHER! They mash it up with   “We Belong.”   The Bellas move downstage 101   101  into one line across the stage. Each Bella joins in to hold one note. It’s simple, stripped down and poignant. They all motion to Emily, who steps forward to “solo.” EMILY DOO DOO, DAA DAAAAAAAA! Then, they perform a heartfelt version of the Beca/Emily original song, “Flashlight.” A SPOTLIGHT shines down on Beca. BECA WHEN TOMORROW COMES/I’LL BE ON MY OWN/FEELING FRIGHTENED OF THE THINGS THAT I DON’T KNOW/WHEN TOMORROW COMES 3X... BELLAS OOOOH! OOOOH! OOOOH! EXT. WORLD CHAMPIONSHIP OF A CAPPELLA - PRESS TABLES - 102   102  CONTINUOUS BACK ON AN EMOTIONAL JOHN AND GAIL, who can’t believe it. JOHN This is unprecedented. The Bellas have chosen to do an original song. GAIL Ordinarily I’d be coughing up blood in anger, and yet, it’s so damn beautiful. JOHN Like a baby fawn. Sipping morning dew. From a buttercup. EXT. WORLD CHAMPIONSHIP OF A CAPPELLA - STAGE - CONTINUOUS 103   103  BELLAS BUT YOU’RE MY FLASHLIGHT/ YOU’RE GETTING ME GETTING ME THROUGH THE NIGHT...  \"Pitch Perfect 2\"   SHOOTING DRAFTS   5-11-14   115.  (CONTINUED)",
      "characters": [],
      "action_text": "Just then, Aubrey EMERGES from backstage and joins in singing with the ladies... followed by Alice, CJ and generations of Bellas from the beginning. They all sing. BELLAS (CONT’D) BUT YOU’RE MY FLASHLIGHT/ YOU’RE GETTING ME GETTING ME THROUGH THE NIGHT... Emily looks back at her mom, Katherine Junk. EMILY (mouths) Thank you. Katherine winks and sings her heart out. EXT. WORLD CHAMPIONSHIP OF A CAPPELLA - AUDIENCE - CONT 104   104  Benji holds up a flashlight and moves it to the music. The rest of the audience follows his cue. The Bellas take in the sea of light. Emily connects with Benji, thrilled. EXT. WORLD CHAMPIONSHIP OF A CAPPELLA - STAGE/AUDIENCE - 105   105  CONTINUOUS Just then, Beca finds Jesse, sitting with Benji in the front row! He came too! She’s overwhelmed. EXT. WORLD CHAMPIONSHIP OF A CAPPELLA - STAGE - CONTINUOUS 106   106  The stage is now full of generations of Bellas, singing. BELLAS BUT YOU’RE MY FLASHLIGHT/ YOU’RE GETTING ME GETTING ME THROUGH THE NIGHT... It’s quite a sight. BACK ON: John and Gail, JOHN Incredible. Every living Bella is up on that stage right now. ANGLE ON: The judges, clearly moved. The audience, captivated. The Kommissar, stewing. BACK ON STAGE: BECA GETTING ME THROUGH THE NIGHT. Pin drop. Then, the audience CHEERS. The Bellas hold each other tight, relishing the moment.  \"Pitch Perfect 2\"   SHOOTING DRAFTS   5-11-14   116.  CONTINUED: 103   103",
      "dialogue_count": 0,
      "word_count": 469
    },
    {
      "scene_number": 11,
      "slugline": "EXT. WORLD CHAMPIONSHIP OF A CAPPELLA - PRESS TABLES - CONT 107   107  JOHN Simple, raw, vulnerable, exposed... I’ve been called many things, Gail, but let me add one more. Impressed. GAIL (through emotion) Thought you were going to say gay. EXT. WORLD CHAMPIONSHIP OF A CAPPELLA - STAGE - CONTINUOUS 108   108  The alumna exit, leaving just our ten ladies. Lilly and Ashley beatbox a cool dance beat. The Bellas free-style dance until they eventually exit the stage. The audience cheers them on. As they do this, FADE TO BLACK INT. BELLA HOUSE - NIGHT 109   109  Emily stands in front of the Bellas. There is a hazardous amount of lit candles around her. Beca hands Emily a large wine glass. BECA It’s ceremonial. And you should definitely not drink it because it is essentially poison. EMILY (smells it) Aw, it smells like cherry and vanilla. CHLOE Okay, repeat after me. I, sing your name. EMILY I -- EMILYYYYY! CHLOE Promise to uphold the ideals of a Bella woman forever. EMILY Promise to uphold the ideals of a Bella woman forever. BECA And that’s it. That’s the end of the speech. Nothing weird happens after that.  \"Pitch Perfect 2\"   SHOOTING DRAFTS   5-11-14   117.  (CONTINUED)",
      "characters": [],
      "action_text": "Beca hands Emily the house keys. BECA (CONT’D) These are for you. Don’t go in the basement. It’s haunted. FAT AMY Wait! One last thing. Fat Amy picks up a round sled. CHLOE Yes, every Bella must christen the house by sliding down the staircase. EMILY Are you serious? BECA It’s tradition. FAT AMY Yeah. I’ll show you. We JUMP CUT to, Fat Amy at the top of the staircase. FAT AMY (CONT’D) Behold! Using a round sled, she makes her way down the staircase. It’s not elegant. Then, she stands up -- in all of her confidence: FAT AMY (CONT’D) Crushed it. BECA Good form. FAT AMY Now I’m ready to move on. (then, shouting up) Legacy, you’re up! We see Emily at the top of the stairs. TIGHT ON: Emily, right before going down... EMILY Alright I’m ready! Let’s do this! As she starts to slide --  \"Pitch Perfect 2\"   SHOOTING DRAFTS   5-11-14   118.  CONTINUED: 109   109  (CONTINUED) END OF MOVIE DURING END CREDITS: BLAKE SHELTON, CHRISTINA AGUILERA, PHARRELL, and ADAM LEVINE sit with their backs to BUMPER, who is on stage. He sings  John Legends, “All of Me.”  BUMPER ... 'CAUSE ALL OF ME/LOVES ALL OF YOU/LOVE YOUR CURVES AND ALL YOUR EDGES/ALL YOUR PERFECT IMPERFECTIONS/GIVE YOUR ALL...(song continues) Blake Shelton HITS his button. He turns around, sees Bumper and smiles. Bumper can’t contain his excitement. BUMPER (CONT’D) 'CAUSE I GIVE YOU -- Yes! -- ALL OF ME AND YOU GIVE ME -- just like I dreamed! ALL OF YOU -- (song continues) Blake is laughing. Adam HITS his button. Now, Bumper is really losing it with excitement. BUMPER (CONT’D) ALL OF ME... who-am-I-going-to-pick I-have-no-idea!   GIVE YOUR -- Adam, no offense, it’s not going to be you. You can turn back around. Adam hits his button and turns back around. BUMPER (CONT’D) No wait! Come back! I want to hear what you have to say! Blake is falling over, laughing. BUMPER (CONT’D) Adam, hit Gwen’s button! She’s really the one I want! Or Christina’s! Whoever is back there!... (big finish) ALL OF ME! The rest of the judges turn aroun",
      "dialogue_count": 0,
      "word_count": 618
    }
  ]
}