{
  "slug": "pixels-2015",
  "title": "pixels",
  "genre": "sci-fi",
  "format": "film",
  "scenes_count": 14,
  "characters_count": 0,
  "characters": [],
  "total_words": 23992,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. SUBURBS, DELAWARE, SUMMER OF 1982 - DAY 1   1 Our hero, SAM BRENNER, 13, rides his bike through the suburbs.   * Fast, crazed. CHEAP TRICK’S “SURRENDER” (BUDDAKAN VERSION) PLAYS AS CREDITS BEGIN. EXT. HOUSE, SUBURBS - DAY 2   2 As the song continues, WILL COOPER, age 13, is mowing his lawn. His cute LITTLE SISTER is on the sidewalk, operating a lemonade stand. Brenner arrives, SKIDS his bike to a stop. Cooper looks at him. Brenner smiles. YOUNG BRENNER It’s open. Cooper abandons the lawn mower, grabs his bike and starts to pedal off with Brenner. Then he stops, runs back to the lemonade stand, and takes a big jar of coins. LITTLE SISTER  Hey!  EXT. MAIN STREET - MOMENTS LATER - DAY 3   3 Brenner and Cooper pass a movie theater showing “Poltergeist” and pull their bikes into a parking lot. Each stares ahead in awe. CAMERA PANS around them, REVEALS what they’re looking at:  THE ELECTRIC DREAMS ARCADE . A BIG GRAND OPENING SIGN hangs from the roof. INT. ARCADE - DAY 4   4 Its like going into another world. All the classic games are lined up:   PAC MAN, DONKEY KONG, CENTIPEDE, SPACE INVADERS, GALAGA, Q-BERT, PAPERBOY, ASTEROIDS, BREAKOUT . And they’re all BRAND NEW. The guys enter. Cooper opens the mason jar, both guys grab a handful of quarters and they fan out. Brenner waits in line for the holy grail: PAC MAN, watching OTHERS playing and losing. He studies their moves, the game’s controls, taking in every success, every failure. Cooper plays GALAGA. On screen we see him GETTING KILLED BY THE ALIEN/BUG INVADERS THREE TIMES REAL QUICK. He’s terrible. It’s Brenner’s turn on Pac Man. He steps up, puts in his quarter and starts to play. Cooper steps up, watching over his shoulder. YOUNG COOPER Which one’s the alien, Sam, the   * cheese wedge guy or the rainbow blobs?",
      "characters": [],
      "action_text": "YOUNG BRENNER Neither. Those blobs are ghosts, and the cheese wedge is Pac Man. He’s a... I don’t know what he is, but he seems like a good guy. Cooper shakes his head, looks at the game Brenner’s playing: CU of an 80’s 8 Bit video screen as PACMAN RACES ACROSS IT. YOUNG COOPER Wow. How are you so good at this game? You’ve never even played it before. YOUNG BRENNER I don’t know. There’s a pattern to how they are moving. Watch... He does. ON SCREEN the game seems to slow down. We see   * numbers and arrows superimposed over the action in Brenner’s   * eyes. He knows exactly where the ghosts are going, when the   * bonus cherries are going to appear, etc.   * YOUNG COOPER I don’t see it. But you sure do. CHEAP TRICK’S SONG continues as CREDITS PLAY OVER: - MONTAGE of Brenner playing: Centipede, Q-Bert, Galaga, Defender being played at a high level (intercut with other   * 80s kids, janitors, etc. watching slack-jawed), high score   * after high score, crowds growing, “SAM” taking over the   * entire top ten scores. - As a huge crowd has gathered around Brenner, Cooper plays “the Crane Game” by himself in a lonely corner. He deftly maneuvers the claw over an array of stuffed animals and rubber masks. Cooper lowers the claw over a Chewbacca mask. the claw grabs it, but it gets stuck. Will Cooper get it? CUT TO Brenner playing ASTEROIDS, surrounded by a respectful   * crowd. He steps away from the machine.   * YOUNG BRENNER   * Sorry, folks, I gotta eat.   * His guy “dies”. The crowd applauds and pats him on the back   * as he walks over to Cooper - standing there in the Chewbacca   * mask. He hands Brenner a “Reggie” bar.   * YOUNG COOPER   * You can’t stop playing, can you?   * You’re like a video game addict. YOUNG BRENNER You don’t understand, buddy. I suck at sports, I suck at school. (MORE) Numbered Script (04/17/2014)   2. Video games is the first thing I’ve ever been good at. YOUNG COOPER You’re not “good” at video games, Sam - you’re the best.   * (hands him fly",
      "dialogue_count": 0,
      "word_count": 2072
    },
    {
      "scene_number": 2,
      "slugline": "INT. BAR, WASHINGTON DC - DAY 8   8 Still in uniform, Brenner sits across from COOPER also 45. He is dressed in a blue blazer and open collar shirt. They’re eating lunch at a table near the bar.   * BRENNER Look, Chewie, I don’t know why I’m giving you romantic advice; you always did way better with chicks than I did. COOPER Not always. Remember that chick in Ft. Lauderdale? The redhead who was all over you? BRENNER That was my cousin. Moving on. If I were you, I’d take one hour a day where you shut down the phone, turn off the email, the ESPN, put down the Reggie bar and just devote your   * full attention to your wife. COOPER I can’t shut off my phone and email, man; I gotta be reachable   * 24/7. Not all of us work out of a van. BRENNER Yeah, I get it, I have a crappy job. I’m a failure, I wear orange shorts, my wife left me for a busboy... PRESIDENT COOPER Don’t give me some sob story,   * Brenner. You were meant for   * something more than   this . BRENNER   * Why would you think that? I was   * never really good at anything.   * PRESIDENT COOPER   * You were good at one thing. Best I   * ever saw.   * BRENNER   * Second best. And playing old-timey   * videogames ain’t a real lucrative   * career path nowadays.   * PRESIDENT COOPER Hang on, I gotta see this...   * Numbered Script (04/17/2014)   8.",
      "characters": [],
      "action_text": "Brenner turns. ON TV WE SEE CHRIS MATTHEWS on MSNBC. CHRIS MATTHEWS (ON TV) The President’s gaffe-filled summer continued today during an appearance at Joseph Knibb Elementary School to promote his new youth reading initiative. Here’s what happened... ON TV WE SEE Cooper in a classroom, reading to a class of FIRST-GRADERS who have gathered on the rug around him. Parents, teachers, etc. stand watching excitedly. COOPER (ON TV) (dramatic) ...But then, Mittens jumped up on to the table, and knocked over the whole bowl of soup! Mrs. Pickles gassed - gasped, and the whole room fell silent. “This is casta... (struggling with word) catsa... catatastrophic?...”   * LITTLE GIRL (SUNNY) Catastrophic! COOPER (ON TV) (a little loud) I got it, thanks, sweetheart! The Little Girl looks like she’s about to cry. ON TV, back to Chris Matthews. CHRIS MATTHEWS Seems like if the President’s approval ratings don’t improve, the results of the next election could be... catsatatsastrophic. Back in the bar, Brenner is laughing. BRENNER You really should learn how to read. PRESIDENT COOPER I was on three hours sleep!! We pull back further and see that there are A TON OF SECRET SERVICE AGENTS there. People are peeking in the windows   * excitedly.   * BRENNER Dude, I gotta get out of here; I got a 2 o’clock install. You getting this, or... Numbered Script (04/17/2014)   9. Cooper just stares at him, looking sheepish. BRENNER (CONT’D)  I’m   getting this?! PRESIDENT COOPER I forgot my wallet! Brenner turns to the AGENTS, disgusted. BRENNER Could one of you seven guys grab his wallet before he walks out the door next time?! Please? I’m broke, he’s the President! EXT. GUAM - SKY - NIGHT 9   9   * A CLOUDY night sky. Behind the clouds, we see the eerie image   * of a LARGE ALIEN CRAFT. We can’t make out any details.   * Suddenly, A WIDE LIGHT PORTAL OPENS. We HEAR A CLICKING   * SOUND.   * From out of the clouds, we see a cloud of BRIGHTLY-COLORED   * CUBES. They loop down from the stars and FORM",
      "dialogue_count": 0,
      "word_count": 1190
    },
    {
      "scene_number": 3,
      "slugline": "INT. VIOLET AND MATTY’S HOUSE - LATER - DAY 13   13 Brenner is setting up the video game system. Matty is hanging out, watching him. Brenner notices him. MATTY So you a gamer? BRENNER Uh, I was when I was your age. MATTY Were you any good? BRENNER I was alright at some of the classic games. MATTY Classics? You mean like “Halo”? BRENNER No, the   real   classics: Pac-Man, Asteroids, Space Invaders. Games you played at an arcade, which was a   * building outside of your house. You’d   * go with your friends, there was great music playing, cute girls everywhere... MATTY I like games where you shoot people, and their guts go flying everywhere, and   * occasionally you have to rip someone’s spine out and then use to it to beat someone else to death. It’s probably genetic. BRENNER Why? Your mom’s a serial killer? MATTY No, she makes weapons for the military. VIOLET (O.S.) (overhears this) Matty, what are you saying?... MATTY Nothing, Mom. Sorry I mean she works as a waitress at P.F. Changs at the mall. (then mouths to Brenner) No she doesn’t. BRENNER (mouths back) Really? Numbered Script (04/17/2014)   13.",
      "characters": [],
      "action_text": "MATTY (whispers) She says she’s gonna’ make a Whore Destroyer Weapon to take out Sinnamon. They laugh. Violet walks in.   * VIOLET   * What are you guys talking about? MATTY/BRENNER Video games. Violet smiles. Then she gets a text, her face falls. INT. GUAM AIRBASE - COMMAND CENTER - NIGHT 14   14 Chaos. SERVICEMEN RUN OUT to man their posts. They hear the noise. BEEP BOP. BEEP BOP BOOP. That familiar arcade game sound. FIGHTER PILOTS run down the tarmac towards their jets. EXPLOSIONS coupled with VIDEO GAME SOUNDS FILL THE AIR. ONE PILOT stops before getting in his plane, looks up at the air. BLURRY COLORFUL IMAGES are REFLECTED IN HIS HELMET. FIGHTER PILOT  What the hell are those things?  INT. GUAM COMMAND CENTER - NIGHT 15   15 LIGHTS FLICKER ON AND OFF in the command center. EXPLOSIONS ROCK the interior. A WALL IS BLOWN AWAY, sending people flying to the ground. The explosion is UNLIKE ANYTHING we’ve ever seen. The wall PIXELATES INTO A HUNDRED COLORFUL BLOCKS, leaving a HUGE OPENING, FILLED WITH SMOKY COLORFUL LIGHT. The HANDSOME SAILOR get to his feet, runs outside. EXT. GUAM COMMAND CENTER - NIGHT - CONTINUOUS 16   16 The SAILOR RUNS OUTSIDE, looks up to the sky. He is STUNNED by what he sees. He is suddenly BATHED IN LIGHT. He raises his PISTOL and begins firing upward. Suddenly the pistol LEAVES HIS HAND and is PIXELLATED UPWARD, INTO THE LIGHT. This is followed by the SAILOR, whose body PIXELLATES. The PIXELS rise up... DISAPPEARING INTO THE LIGHT... INT. VIOLET’S BEDROOM - DAY 17   17 Brenner knocks on the door and peaks his head in. BRENNER Mrs. Kelly? Just wanted to let you know   * I’m all finished and I need you to sign the work order... (MORE) Numbered Script (04/17/2014)   14. Feels weird calling you Mrs. because you’re probably way younger than me, but contractually I have to. He doesn’t see anyone, but hears a faint crying. VIOLET (O.S.) Okay. Her voice echoes from the closet. BRENNER Mrs. Kelly, are you in the closet?   * VIOLET (FROM THE CLOSET",
      "dialogue_count": 0,
      "word_count": 1349
    },
    {
      "scene_number": 4,
      "slugline": "INT. VIOLET’S KITCHEN - CONTINUOUS A22   A22   * Violet makes two cups of Nespresso coffee, gives one to Brenner. BRENNER Okay, so if I was a billionaire and we were in the Mediterranean on my gigantic yacht and we were sipping Champagne and I   * went to kiss you, would you? Busted. Before she can answer Brenner’s phone rings. He looks at it. It says “PRESIDENT CHEWIE” on the caller ID. BRENNER (CONT’D) Excuse me, Snobby. I have to take this! (answers the phone) Homeboy. What’s up? INT. OVAL OFFICE, WHITE HOUSE - SAME 22   22   * PRESIDENT COOPER Can you get to the White House right now? INT. VIOLET’S KITCHEN - SAME 23   23   * BRENNER I’ll be there in fifteen. He hangs up and turns to Violet. BRENNER (CONT’D) While I’d love to stay and hear you lie about not wanting to make out with the yacht guy, I have to go. Also I’m an   * amazing kisser. You had a chance to find out and you just lost it. As he exits the kitchen, HER PHONE NOW RINGS. VIOLET Hello? EXT. GEORGETOWN STREET - DAY 24   24 Brenner is speeding along in his van, but has to stop for a red light. A car skids to a stop beside him. It’s Violet. Brenner rolls down his window, calls to her. BRENNER Too late, sweetheart. You had your shot and you blew it. VIOLET I’m not following you. Numbered Script (04/17/2014)   19.",
      "characters": [],
      "action_text": "BRENNER Whatever you say, Stalky. It’s   * over. Deal with it. The light changes, and he peels out. 30, 40, 50 mph. Brenner looks in his rear-view and sees Violet is right on his tail. BRENNER (CONT’D) (to himself) Wow, she went from zero to psycho in 6.7 seconds... EXT. PENNSYLVANIA AVENUE - DAY 25   25 We see Brenner’s van racing through the mostly empty streets toward the White House. Violet’s car is right behind. Then both put their blinkers on at the same time to head into... EXT. WHITE HOUSE GATES - DAY - CONTINUOUS 26   26 Brenner pulls up to the guard shack and hands the GUARD his ID. He speaks softly and quickly. BRENNER Steve, there’s a woman with mental   * problems right behind me. You might need to call for back-up or break out   * the stun gun---   * Violet’s car pulls up and the GUARD waves her through. GUARD Go right on in, Lt. Kelly!   * This leaves Brenner flummoxed. INT. HALLWAY, WHITE HOUSE - DAY 27   27 Brenner and Violet walk quickly down a hallway in the West Wing. They notice what a HOTBED OF ACTIVITY THE WHITE HOUSE IS. Everyone is WORRIED, PANICKED. The PRESIDENT’S ASSISTANT (Jennifer) sees them approaching. ASSISTANT Lieutenant Kelly, you can go right   * into the Situation Room. Violet turns to Brenner, cocky. VIOLET So, yeah, they need me in the Situation Room. Have fun doing whatever you-- ASSISTANT Mr. Brenner, the President is waiting for you in the Oval Office. Numbered Script (04/17/2014)   20. Violet is stunned. Brenner’s turn to be cocky. BRENNER Somebody’s more important... Brenner moonwalks into the Oval Office.   * INT. OVAL OFFICE - DAY - CONTINUOUS 28   28 Cooper leans against his desk, worried. PRESIDENT COOPER You couldn’t have at least changed? BRENNER You told me to come right over! Chewie, what’s going on? It’s crazy out there. PRESIDENT COOPER Our naval base in Guam was attacked tonight. BRENNER Attacked by who? PRESIDENT COOPER Not sure. That’s why I asked you here. Brenner, intrigued, goes to the desk. Cooper hits pla",
      "dialogue_count": 0,
      "word_count": 1176
    },
    {
      "scene_number": 5,
      "slugline": "INT. SITUATION ROOM, THE WHITE HOUSE - CONTINUOUS 31   31 VIOLET Mr. President, there’s no nation on earth that has the military   * technology to simply... pixelate   * entire buildings--   * ADMIRAL PORTER   * Except North Korea! DEFENSE SECRETARY Forget North Korea! I think we’re looking at a cutting edge multinational enterprise - an NGO, a think tank, even a corporation. We’re thinking North Korea when we should be thinking Google. ADMIRAL PORTER   * So we should blow up Google! BRENNER (O.S.) Can someone take Grandpa’s keys   * away before he drives us into a   * ditch?   * Everyone turns and looks at BRENNER standing there in his bright orange shorts. ADMIRAL PORTER   * Who is this person?! DEFENSE SECRETARY (hopeful) The sandwich guy? A beat of silence, then...   * PRESIDENT COOPER Uh, yeah. This is... my... old arcade game technical consulting advisor person, Sam Brenner. He works... in the tech   * sector.   * DEFENSE SECRETARY So he’s a systems expert?   * BRENNER Sound systems, yes sir.   * JUNIOR AIDE   * Caltech? MIT?   * BRENNER   * Yes, I did go to MIT, but it was   * the Mississippi Institute of   * Technology.   * (MORE) Numbered Script (04/17/2014)   24.",
      "characters": [],
      "action_text": "You give me two beer cans, some   * duct tape and a nine-volt battery,   * I’ll make you a working blow dryer.   * PRESIDENT COOPER More to the current point, Mr. Brenner was the National Galaga Champion. BRENNER World. PRESIDENT COOPER World champion. He knows everything there is to know about this game. (to Brenner) So what did you and your orange shorts barge in here to say? BRENNER The Galaga that attacked us actually doesn’t exist anymore.   * JUNIOR AIDE You can download Galaga on your phone. They all look at Brenner. He is in the Lion’s Den now. BRENNER Not this version of Galaga, prom king. The Galaga that exists now, that you   * can download off the internet, came out   * in 1986. (points at the screen) But   this   is from the original 1982 arcade version. Those machines were   * recalled and reprogrammed because of   * glitches in the original code. You can tell by the way the giant space bugs swoop in. VIOLET (watching) Kind of ziggy-zaggy. BRENNER (mocking) Whoa, “ziggy zaggy,” is that the military term?   * Violet glares.   * VIOLET So someone designed these ‘space bugs’ after an old out of print version of a video game from 30 years ago that no one today would know? But how? Why? BRENNER (CONT'D) Numbered Script (04/17/2014)   25. ADMIRAL PORTER   * I’m sorry, is this a National Security Council meeting or a dorm room drug party? Our nation has been attacked by an unknown military force, and we must respond swiftly and decisively. If it got out to the press that we were pinning the blame on an old contuter game, they wouldn’t just   * mock you on the news, Mr. President: they’d impeach you! So I   * suggest the man in the orange shorts leave the room immediately, so those of us with long pants and government positions can discuss our options! All eyes turn to the President. PRESIDENT COOPER Uh, you’re right. Brenner, thanks   * for coming down. Appreciate your   * help. Violet mouths “bye”. Brenner nods and salutes the various people as he backs out.",
      "dialogue_count": 0,
      "word_count": 1629
    },
    {
      "scene_number": 6,
      "slugline": "INT. WHITE HOUSE - OVAL OFFICE - NIGHT 36   36 Brenner, Cooper and Ludlow were watching this on a flatscreen. PRESIDENT COOPER What do they mean three lives? LUDLOW Like the old games, you know: one quarter, three lives, Mr.   * President. PRESIDENT COOPER Lud... You gave me my first Playboy when we were 14. I think you can call me Chewie. LUDLOW (smiling) Yes, sir, Mr. President Chewie, sir. BRENNER These moron aliens think the video game footage that NASA shot into space was a declaration of war. LUDLOW --And we’ve already lost the first battle! If we lose two more, they will completely destroy our planet. PRESIDENT COOPER So where do Mr. T and Michael Jackson fit in? LUDLOW The aliens must be shapeshifters! In that orbiter NASA also included movies, music and other current events of 1982, to tell other civilizations about us. BRENNER What are they gonna hit us with   * next? If I’m remembering right,   * there were at least a dozen games we played that night back in ‘82.   *  Breakout, Galaga, Asteroids, Pac Man, Dig-Dug, Donkey Kong--  LUDLOW  Donkey Kong . Not your finest hour, Sam.   * Numbered Script (04/17/2014)   31.",
      "characters": [],
      "action_text": "BRENNER Shut up, Lud, or I’ll have Chewie pass a law against eating Hot Pockets in your underwear. LUDLOW Unconstitutional! Look, assuming those numbers alien Mr. T gave us are latitude and longitude, the next attack will be somewhere in northern India, tonight. If you can   * get your NSA techs to clean up the signal, we can pinpoint the exact location, and maybe even what game   * they’re going to play--   * PRESIDENT COOPER Look: this is an interesting theory. But I can’t authorize a military response based on this crazy Ronald Reagan/Mr. T video. It looks like something a couple of high school kids made. LUDLOW Well, you gotta at least warn the Indians that something might be coming-- PRESIDENT COOPER I’m known as a buffoon right now as it is. I can’t the risk, Ludlow. I   * just can’t. Brenner and Ludlow exchange a look. CUT TO: EXT. TAJ MAHAL - DAWN 37   37   * An excited INDIAN GUY (early 20s) is with a beautiful INDIAN GIRL outside the Taj Mahal. He seems nervous. He takes his iPhone out, pushes some buttons, and a tinny INDIAN VERSION of   Spandau Ballet’s   “TRUE” begins to play. He props it up to record himself. He stands facing the Girl, speaks some Hindi, then drops to one knee. The Girl can’t believe this is happening! Behind them, we see... something. Flashing lights, something   * bright whizzing through frame too fast to see. The couple is oblivious. The Guy speaks some more heartfelt Hindi, getting emotional, then pulls a ring box out of his pocket. The Girl, finally noticing what’s going on off-camera, starts screaming. The Guy thinks she’s screaming about the ring box, nods cockily. Numbered Script (04/17/2014)   32. But then he sees what’s going on and starts screaming, too. He grabs the camera, but never gets a clear shot of what’s   * going on, just quick low-rez images of lights, smoke, himself and --   * He LOWERS the camera. For a few moments, we see the   * DESTRUCTION of the TAJ MAHAL. Is it being TORN APART by the   * game...   BREAKOUT!",
      "dialogue_count": 0,
      "word_count": 3610
    },
    {
      "scene_number": 7,
      "slugline": "EXT. HYDE PARK - NIGHT 57   57 LUDLOW Nooooooo! It ate the Sarge! The centipede ate the Sarge!   * The remaining Seals continue to SHOOT SKYWARD. They are all freaked out by what just happened. Another CENTIPEDE STREAKS BACK AND FORTH ACROSS THE SKY DOWN TOWARDS THEM LIKE A VICIOUS FLYING SHARK. The Big Seal shoots at it. But it’s TOO FAST. He KEEPS MISSING. BRENNER No, shoot right... Now left! Look, you can’t just fire at where they are, they’re too fast. You have to watch the patterns, anticipate where they’re going to be and shoot there! BIG SEAL  I DON’T KNOW THE PATTERNS!  It’s moving fast down towards them, CLOSER AND CLOSER. It’s SCARY MOUTH BITING AWAY. Finally Brenner can’t stand it. He leaps over the barrier, shoves the SAS Officer to the ground   * and sprints toward the SEAL. VIOLET Brenner! No! Brenner grabs the light cannon from the Seal and STARTS FIRING AT THE CENTIPEDE. BLAST BLAST BLAST! Piece by piece Brenner BLASTS it, just like in the game. And as it dies we see it RETROGRADE BACK FROM REAL-LOOKING CENTIPEDE TO THE LOWER RESOLUTION 8 BIT ONE FROM THE GAME, FINALLY TO PIXELS OF ENERGY THAT DISSIPATE INTO THE AIR. The dissipated pixels BRUSH PAST Brenner’s face. BIG SEAL Nice shooting, civilian. BRENNER I’m not just a civilian. I’m a nerd. He looks at Ludlow and makes a decision. BRENNER (CONT’D) Ludlow, grab a light cannon and get   * over here!   * LUDLOW  Me?!   No! NO! I LOOK DELICIOUS, HE’LL EAT ME TOO!! Numbered Script (04/17/2014)   46.",
      "characters": [],
      "action_text": "BRENNER These guys don’t know this game! We were born to do this! The SEALS look to Violet. Violet talks into the walkie- talkie. VIOLET Mr. President? A beat of silence, then... PRESIDENT COOPER (O.S.) (quietly) Let the nerds take over. VIOLET What was that, sir? PRESIDENT COOPER (O.S.) LET THE NERDS TAKE OVER!!! A SEAL hands his light cannon to Ludlow. Ludlow looks at Brenner, terrified. Then... BRENNER Lud... hit the start button. LUDLOW (takes a deep breath)   * What am I worried about? I’m the   * Wonder Kid.   * The two of them turn skyward and start blasting away. THEY   * BOTH KICK ASS.   * A SCREAMING CENTIPEDE FLIES DIAGONALLY DOWN FOR LUDLOW.   * LUDLOW BLASTS IT. IT BREAKS IN TWO RIGHT BEFORE it hits him.   * The two pieces HIT THE GROUND and SLITHER AWAY. But LUDLOW   * quickly nails them both with a cool spin move.   * A HOPPING SPIDER APPEARS, AND BEGINS HOPPING SUPER-FAST TOWARD ADMIRAL PORTER. ADMIRAL PORTER, TERRIFIED, LETS OUT A   * HIGH-PITCHED SCREAM. BRENNER TAKES AIM (THE GUN BARREL TILTING UP AND DOWN AS HE   * TRACKS THE HOPS). HE FIRES AND NAILS THE SPIDER IN THE NICK OF TIME. THE SPIDER EXPLODES INTO A SHOWER OF PIXELS IN THE ADMIRAL’S FACE.   * BRENNER   * You’re welcome, homeboy!   * INT. 10 DOWNING STREET - NIGHT 58   58 Everyone watches this. Numbered Script (04/17/2014)   47. PRESIDENT COOPER YEAH, BOYS! Shock and awe! High   * score, bitches! He turns, sees everyone staring at him. PRIME MINISTER You heard the president. Cheer them on! Everyone in the room starts cheering raucously.   * EXT. HYDE PARK - NIGHT 59   59 BRENNER Only one left!! Daddy’s got ya... Brenner points to the REMAINING CENTIPEDE. But it breaks right quick, MOVING   TOWARDS THE CITY!   Brenner FOLLOWS it OUT   * of the park, as Ludlow, consumed with blood-lust, continues   * shooting crazily into the sky.   * EXT. PARK LANE - NIGHT - CONTINUOUS 60   60 The Centipede RUNS OUT into the street. PEDESTRIANS freak out, RUNNING AWAY. Brenner runs out in hot pursuit. The",
      "dialogue_count": 0,
      "word_count": 4209
    },
    {
      "scene_number": 8,
      "slugline": "EXT. MANHATTAN STREET - CONTINUOUS 87   87 We see Pacman and the Three Ghostcoopers on three sides of him. Then on the fourth side we see...A GIANT POWER PILL! PACMAN EATS IT. He STARTS TO GLOW AND SHAKE. SCREAMING LUDLOW VEERS RIGHT. BRENNER SHIFTS INTO REVERSE AND FLOORS IT. POWERED UP PACMAN HEADS AFTER HIM. EXT. MANHATTAN STREET - CONTINUOUS 88   88 Brenner still flooring it in reverse as Pacman chases him with a vengeance like the   T-Rex in Jurassic Park . VIOLET (OVER COMMS) What’s happening?! BRENNER A power pill!   He’s got ten seconds   *  where he can eat us.  Brenner then makes a HARD TURN. He looks and Pacman is GONE. EXT. MANHATTAN STREETS/VARIOUS - CONTINUOUS 89   89 Ludlow stops. Looks around. He doesn’t see him anywhere. He is breathing heavily, hyper-ventilating. Then in his REAR VIEW WE SEE PACMAN QUICKLY COMING TOWARDS HIM FROM BEHIND. Ludlow HITS the gas. Pacman CHASES HIM, he’s FASTER than Ludlow and QUICKLY CATCHES UP to the Ghost-Cooper. Pacman opens his mouth and... BITES OFF THE BACK HATCH of Ludlow ’s car. Leaving a GAPING HOLE. LUDLOW, EYES WIDE, SCREAMS! Freaked out Ludlow FLOORS THE GAS. But Pacman is still CHASING HIM, STILL CHOMPING. Pacman TAKES ANOTHER BITE and gobbles up the ENTIRE REAR SECTION of the car. Ludlow is literally driving on TWO WHEELS. His seat the only thing separating him from Pacman, who is still in HOT PURSUIT. Only a FEW INCHES from gobbling up Ludlow. He tries to jump, but his seatbelt is JAMMED! He emits a girlish scream, keeps pulling on his seat belt. About to be Pac-food, Ludlow HITS THE BRAKES, causing the car to SPIN around, facing Pacman, whose mouth OPENS WIDE... THE SEATBELT FINALLY BREAKS FREE AND LUDLOW LEAPS OUT OF THE OPEN BACK OF HIS VEHICLE RIGHT AS PACMAN EATS IT! Again we hear the DEAFENING GHOST-EATING SOUND. Then Pacman’s power boost finally runs out. Ludlow lies on the ground, defenseless without his GhostCooper. PACMAN NOW STARTS COMING AFTER LUDLOW.   * Numbered Script (04/17/2014)   63.",
      "characters": [],
      "action_text": "Ludlow takes off RUNNING down the street as Pacman CHASES HIM. LUDLOW   * Don’t do this! You’ve been   * brainwashed! You’re a good boy!   * Pacman is about to EAT LUDLOW WHEN EDDIE’S GHOSTCOOPER BLASTS INTO HIM FROM THE SIDE. PACMAN SCREAMS AGAIN. DIES. EDDIE PLANT You just got fireblasted, sucker! Ludlow sighs, then PASSES OUT on the ground. INT. MANHATTAN - STAGING AREA - NIGHT 90   90 Violet looks at the command map, confused. VIOLET How the hell did he get over there so fast? EXT. MANHATTAN STREETS - NIGHT 91   91 BRENNER Nice work, Eddie. One more and it’s   * happy hour.   * EDDIE PLANT Cake. They spot Pac Man moving away at the far end of a long avenue. They shift their GhostCoopers into high gear and speed after him side by side. But then Eddie really floors it and zooms ahead.   * EDDIE PLANT (CONT’D)   * YOU DON’T MESS WITH THE   * FIREBLASTER!   * Eddie, doing about 120, gets really close when Pac-Man suddenly turns left. Eddie, going too fast, can’t negotiate the turn and continues on straight - right into New York Harbor. EXT. NEW YORK HARBOR/INT. EDDIE’S GHOSTCOOPER - NIGHT A92   A92   * EDDIE PLANT   * The Fireblaster can’t swim!   * INT. MANHATTAN - STAGING AREA - NIGHT 92   92   * VIOLET We’re sending a boat! Brenner, it’s on you. There are   three other power pills   still out there. So stay alert. Numbered Script (04/17/2014)   64.",
      "dialogue_count": 0,
      "word_count": 584
    },
    {
      "scene_number": 9,
      "slugline": "INT. BLINKY (BRENNER’S CAR) - NIGHT 93   93 Brenner stops in the middle of the street. Breathing heavy, feeling the pressure. Maybe feeling like getting out of there. Then... BRENNER I got this. If I don’t, the world ends. No big deal. Brenner shifts into HIGH GEAR and heads after Pacman. EXT. MANHATTAN STREETS - NIGHT 94   94 As Brenner chases Pacman through the streets we see the sidewalks lined with NEW YORKERS CHEERING HIM ON. Brenner sees this and it really impacts him. He can’t help but smile. VIOLET (O.S.) Brenner, he’s leading you directly towards one of the power pills. Get out of there! Up ahead Brenner sees the POWER PILL. Pacman HEADS FOR IT. Brenner SLAMS on the brakes. He is about to throw it in reverse and get out of there. But then he STOPS. Gets another idea. He TURNS THE CAR AROUND and then just SITS THERE. INT. MANHATTAN - STAGING AREA - NIGHT 95   95 They all watch, nervous, on the monitor as Pacman eats the pill. And Brenner is just sitting there. NOT MOVING. VIOLET What the hell is he doing?   * EXT. MANHATTAN STREET - CONTINUOUS 96   96 Powered up Pacman TURNS TOWARD Brenner, who still WAITS. BRENNER  One, two...   * VIOLET (OVER THE COMMS) Dammit, Brenner, I have a son who I would like to see grow up. GET OUT OF THERE!!! Pacman HEADS for Brenner, who THROWS IT IN GEAR and TAKES OFF. BACKWARDS. Pacman is RACING TOWARD HIM. Brenner REVERSES   * INTO A PARKING GARAGE and KEEPS COUNTING.   * BRENNER  You’ll see your boy grow up... Four, five...   * Numbered Script (04/17/2014)   65.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 275
    },
    {
      "scene_number": 10,
      "slugline": "INT. PARKING GARAGE - NIGHT 97   97   * Brenner DRIVES IN REVERSE, as Pacman chases him UP the ramp   * of the garage, sending debris and pixelated RUBBLE   * everywhere.   * INT. BLINKY (BRENNER’S CAR) - NIGHT 98   98   * Brenner KEEPS COUNTING. Sweat rolls down his face. BRENNER  ...Seven, eight...   * Pacman is GAINING by the second. And Brenner is NOT DIVING   * OUT. INT. MANHATTAN - STAGING AREA - NIGHT 99   99 VIOLET BRENNER GET OUT,   IT’S GOING TO EAT YOU!  INT. BLINKY (BRENNER’S CAR) - CONTINUOUS 100   100 Brenner looks back, sees that he’s reached the TOP OF THE   * GARAGE. Heading backwards toward a GUARD RAIL. SEVERAL   * STORIES in the air. He CAN’T STOP IN TIME.   * BRENNER   *  ...Nine...   * EXT. PARKING GARAGE - NIGHT 101   101   * Brenner’s car CRASHES through the guard rail, flying through   * the air, between the rooftops of TWO BUILDINGS. Pac-Man SAILS   * OUT behind him, OPENS his mouth, about to EAT Brenner’s Mini-   * Cooper...   * BRENNER   * Ten.   * And with that THE MINI-COOPER TURNS BLUE. PAC-MAN CAN’T STOP.   * HE CHOMPS DOWN ON BRENNER’S CAR, exactly as the same moment   * as POWERED UP PACMAN’S POWER RUNS OUT.   * Pacman DISSOLVES, SCREAMS. BOOOO-OOP! We hear the noises as   * Pacman DIES. IT’S HIS THIRD DEATH! We hear the game over/victory noise. THE GUYS WIN! Brenner’s car SLAMS down onto the opposite rooftop, SPINS to   * a stop and DRIVES OUT of the garage.   * INT. MANHATTAN - STAGING AREA - NIGHT 102   102 The Command Center erupts in CHEERS. Numbered Script (04/17/2014)   66.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 269
    },
    {
      "scene_number": 11,
      "slugline": "INT. MATTY’S DAD’S HOUSE - NIGHT 103   103   * Matty is watching this on TV with his DAD and SINNAMON. MATTY’S DAD That guy’s gotta lot of balls to pull a maneuver like that. That was pretty phenomenal.   * MATTY Yeah. His name’s Sam Brenner. He   * installed our new home theater. Mom’s in love with him. Matty’s Dad immediately looks jealous. Sinnamon looks mad that he’s jealous. INT. WHITE HOUSE - LIVING QUARTERS - NIGHT 104   104   * Cooper and his wife watch this happily on TV. PRESIDENT COOPER That’s our second win. We’re all tied up, baby! FIRST LADY That’s so great. Can Sarah’s family come with us to the Vineyard this summer? PRESIDENT COOPER Huh? Sure. I guess. What? EXT. MANHATTAN STREETS - NIGHT 105   105 Brenner gets out of the Cooper and sees the people of New York   * cheering. A JEEP pulls up, and a wet Eddie Plant in a robe   * gets out. EDDIE PLANT You’re pretty good, Brenner. Not as good as me, but pretty good. They shake hands. As Brenner and Eddie are being mobbed by well-wishers, Ludlow emerges from the crowd with something hidden under a blanket. LUDLOW I think I found our “trophy”. He lifts the blanket so the other guys can see - it’s a fidgety, grumbling, 3 feet tall Q-BERT. He’s pretty cute. BRENNER Holy crap, it’s Q-Bert! Numbered Script (04/17/2014)   67.",
      "characters": [],
      "action_text": "EDDIE PLANT Can I kill it? Q-Bert makes an extra-sad face. BRENNER No! Leave him alone. Maybe later, I don’t know. Hide that thing! I want   * to play with that later...   * Ludlow pulls the blanket down over Q-Bert as the appreciative crowd closes in on them. FADE TO A flatscreen TV. NEWS REPORT in progress. 106   106 NEWS REPORTER After yesterday’s victory over Pac- Man in New York, the Arcaders spent the day practicing for their final   * battle...   * CHANNEL CHANGES to a different NEWS SHOW. 107   107 ANCHOR A large spacecraft has been detected near Jupiter - and it’s heading toward Earth. There is speculation that the aliens are coming to watch the final game in person, or in alien, I guess... CHANNEL CHANGES to Shep and Megyn. 108   108   * SHEP SMITH   * The space ship is expected to arrive here in three days... MEGYN KELLY   * ...and what the aliens will find is a President whose approval ratings have skyrocketed. CHANNEL CHANGES to Cooper addressing a news conference. 109   109 PRESIDENT COOPER I would urge everyone to carry on business as usual. I have every confidence in the Arcaders to meet the final challenge... A REPORTER calls out from the crowd. REPORTER Thank you for saving us, Mr. President! Numbered Script (04/17/2014)   68. The rest of the reporters break into applause. Cooper smiles. PRESIDENT COOPER Don’t thank me; it’s the Arcaders who have brought us here to the brink of victory. Sam Brenner has   * assembled an unbeatable team, and we owe them a huge debt of gratitude. REPORTER We understand you’re throwing a soiree in their honor this evening.   * PRESIDENT COOPER We are, but don’t worry; they’ll have their Arcader suits on under their tuxes, ready to go at a moment’s notice-- INT. ADMIRAL PORTER’S OFFICE - NIGHT 110   110   * TV CLICKS OFF. CAMERA PULLS BACK, we are inside Admiral   * PORTER’S MILITARY OFFICE. He has been watching the TV. He   * stares off, deep in thought, TROUBLED.   * INT. DARPA - LAB & REC AREA - DAY 111   111   * We ",
      "dialogue_count": 0,
      "word_count": 1626
    },
    {
      "scene_number": 12,
      "slugline": "INT. HOTEL BALLROOM - LATER - NIGHT 113   113   * Brenner and Violet are on the outskirts of the party, sharing a beer. BRENNER So what’s this Sinnamon look like? VIOLET What do you mean? She’s a husband- stealing yoga teacher. She’s hot! BRENNER Not   that   hot though, right? Girls like that, who go with older guys, always have one thing wrong with them, like big nostrils or a huge forehead or something. VIOLET No, Sinnamon is pretty much perfect... except her eyes are too far apart. She kind of looks like a flounder. BRENNER Boom, there it is. Tonight, he’s gonna be looking into those eyes, thinking, “What happened? I used to look into the most gorgeous eyes in the world, now I’m stuck with Goggle-Eyes McGee.” VIOLET Did you just say I had gorgeous eyes? BRENNER  While   insulting the other chick. VIOLET Oh, you’re good. BACK NEAR THE DANCE FLOOR, Cooper is watching his wife 113pt   113pt   * dance with Ludlow (eyes closed, head resting on her   * shoulder), when Ludlow’s Mom walks over.   * LUDLOW’S MOM I don’t mean to bother you, Mr. President, but I wanted to say how proud I am of you. PRESIDENT COOPER Mrs. Lamonsoff, you can call me Will, you’ve known me since I was 12. LUDLOW’S MOM Thank you, President Will of   * America, sir. See? You haven’t   * changed.   (MORE) Numbered Script (04/17/2014)   74.",
      "characters": [],
      "action_text": "You’re still the same good boy you always were. When they say that nonsense on the news, about how you make bad decisions and you’re maybe   * a little slow and a coward and too unattractive for such a pretty wife, I just say, “I’d like to see you do better, Mr. News Man.” You gonna finish that shrimp? On the cocktail plate Cooper is holding, among several discarded shrimp tails, is one shrimp with a bite taken out. Cooper hands it to Ludlow’s Mom. AT THE BAR, Eddie is chatting up Jamie Lee Curtis, the 113pt2   113pt2   * Secret Service Agent hovering nearby. EDDIE PLANT People talk about Brenner this and Brenner that, but make no mistake: the Fire Blaster’s the leader of this crew-- JAMIE LEE CURTIS   * Who’s the Fire Blaster again? EDDIE PLANT Me, Jamie Lee! You know, Fire   * Blaster’s been in prison for 8 years. Haven’t been with a woman since ‘05. You’re in for a real treat tonight. JAMIE LEE CURTIS   * You’re not going to touch me. EDDIE PLANT Alright. (to himself) Shoulda gone with Swift. At least I   * woulda got a song written about   * what a tool I is.   * BACK TO BRENNER AND VIOLET 113pt3   113pt3 VIOLET So can I ask you a question? And I promise this has nothing to do with my   alleged  snobbiness... But I’ve seen what you’re capable of these past few weeks. So how come you’re setting up people’s home entertainment systems for a living? BRENNER I don’t know. I never really was   * great at anything except video   * games, and it turned out I wasn’t   * even the best at that...   * LUDLOW’S MOM (CONT'D) Numbered Script (04/17/2014)   75. QUICK CUT TO Eddie, dancing sexy to impress Jamie Lee Curtis.   * VIOLET   * So you don’t think you’re good at   * anything unless you’re the best in   * the world at it?   * BRENNER   * No, I just... I had my shot, I blew   * it and now I am who I am, and I’m   * comfortable with that.   * VIOLET That sounds like a cop-out. I had the worst acne in the lower 48 states when I   * was 15, and I didn’t curl up in a ball and",
      "dialogue_count": 0,
      "word_count": 1850
    },
    {
      "scene_number": 13,
      "slugline": "EXT. WASHINGTON DC STREET - DAY 116   116 WIDE SHOT - The MOTHERSHIP comes out of the clouds. We SEE IT FULLY FOR THE FIRST TIME. It’s the ship from GALAGA. The PORTAL OPENS. ARCADE CHARACTERS COME TO LIFE, POUR OUT. It’s an ALL STAR VERSION OF VARIOUS ARCADE GAMES FROM THE EIGHTIES. But this time they aren’t here to play games, but to BRING ABOUT OUR DESTRUCTION. JOUST characters surround the Washington Monument and start to destroy it. PAN DOWN to see Brenner, Ludlow, Violet and Q-Bert on the street. MOVING FAST.   They are all in Arcader suits, but   * without weapons. They seem intimidated (especially Ludlow), but are running toward the mothership (as the few people still around run the other way).   * Everywhere around them, cars are OVERTURNED, CRASHED and   * PIXELATED. SECTIONS of the street EXPLODE behind them.   * LUDLOW Are you sure we need to do this? I mean, maybe we can just find another planet to live on. I heard there’s a secret city on Mars where rich people are gonna live when there’s a nuclear war. They have greenhouses there, and zero-gravity gyms, and free HBO... Suddenly, they STOP. Seeing SOMETHING AHEAD. A FROGGER. LEAPING * TOWARD THEM.   * THEY RUN THE OTHER WAY, BUT THE FROGGER IS TOO FAST.   * LUDLOW (CONT’D)   * This is it!   * Just when they’re about to be pounced on, a crane scoop   * descends from the sky. It scoops up the Frogger in its jaws,   * and lifts it in the air, suspending it so it can do no harm.   * Brenner, Ludlow and Violet eyeball the crane, following the   * steel cable to the arm to the cab, where a man in a suit and a   * Chewbacca mask opens the door and emerges.   * He takes off the mask. It’s COOPER.   * PRESIDENT COOPER Nobody’s better at the crane game   * than me!   * BRENNER Chewie, what are you doing? What’s with the disguise? Numbered Script (04/17/2014)   83.",
      "characters": [],
      "action_text": "PRESIDENT COOPER I knew you guys were our only hope, but nobody agreed with me. They were trying to bring me down to some underground bunker. So I “went rogue”. (gestures toward a van)   * And I brought gifts. CUT TO the van. Back doors are open, and inside are A STACK   * OF LIGHT CANNONS.   * INT. ALLEY - TWO MINUTES LATER 117   117 They’re pulling the light cannons out of the van. Brenner   * grabs a cannon, Ludlow grabs two.   * BRENNER Lud, I think you should stay here   * on the ground. These people need   * protection, too.   * LUDLOW Oh g-d, thank you for not making me go up on the spaceship... I mean,   * cool. PRESIDENT COOPER So the rest of us go get Matty and destroy the what again... VIOLET Zorex. PRESIDENT COOPER Sounds like a word Ludlow made up. LUDLOW So sci-fi... BRENNER (turns to Ludlow) Save as many people as possible. We’ll see you on the other side. Ludlow hugs Brenner hard. LUDLOW Live long. Laugh much. Love often. BRENNER Use deodorant. Ludlow can’t help but smile. He takes off shooting. VIOLET Brenner, can I get a light cannon?   * Numbered Script (04/17/2014)   84. He hands one to her. She instantly and expertly nails three   * ASTEROIDS that were heading straight for them. VIOLET (CONT’D) (off guys impressed looks) What, I didn’t go to arcades growing up? Our target is this way. Let’s go. Violet TAKES OFF. Cooper cocks an eyebrow at Brenner. PRESIDENT COOPER (re: Violet) That was pretty hawt. How you doing with that? BRENNER Not bad. I think if I save the kid,   * I’m in. EXT. STREET, DC - DAY 118   118 Ludlow is jogging down the street, screaming like a madman, blasting BERZERK robots and DIG-DUG dragons (coming out of the ground). He then comes upon a bus full of KIDS trying to get out of the city. It’s SURROUNDED by A GROUP OF BIDDY BANDITS (NINJA-LIKE   * characters from LADY LISA). The Bandits CLIMB the bus, trying to get inside. LUDLOW Get away from those kids now! ... Please . It’s Ludlow so it doesn’t sound   that badass . Also he ",
      "dialogue_count": 0,
      "word_count": 1369
    },
    {
      "scene_number": 14,
      "slugline": "EXT. BACK ON THE GROUND - CONTINUOUS - DAY 124   124 Lady Lisa ATTACKS Ludlow with her sword. Ludlow, conflicted, grabs a DROPPED PIXEL SWORD from one of the bandits. He   * DEFLECTS Lady Lisa’s many blows with the sword.   * LUDLOW You don’t have to do this, my love, I sense the good in you. INT. SPACESHIP - DAY 125   125   * THE BARRELS ARE HEADING TOWARDS THEM from above FAST AND FURIOUSLY. Violet attempts to shoot the barrel with her light   * cannon. It FAILS.   * BRENNER   * Guns don’t work in this game.   * There’s only one thing we can do...   *  Jump!!!   * They JUMP the first barrel, and the second... but there are MORE and MORE BARRELS COMING. THEY DUCK UNDER SOME, JUMP OVER OTHERS. They run to the ladder. Brenner watches a barrel roll over head on the ramp above. BRENNER (CONT’D) Get up the ladder!   FAST!!  Brenner is the first up the ladder. He runs to the NEXT   * LEVEL. He reaches up and GRABS THE HAMMER. But a BARREL is   * HEADED TOWARD HIM from overhead.   * COOPER   *  Incoming!!   * Brenner tries to DUCK out of the way, but the flying barrel   * KNOCKS the hammer from his hands, sending it down into the   * bowels of the ship. Cooper, Violet and Q-Bert CLIMB the   * ladder to the next level.   * VIOLET   * (emotional)   * I gotta get up to him!   * They continue to DODGE and LEAP the oncoming barrels. Q-Bert   * FOLLOWS Brenner as he LEAPS over a rolling barrel. Q-Bert   * HOPS onto Brenner’s back and goes to the next level. Brenner   * FOLLOWS.   * Cooper LEAPS and ROLLS over another barrel. He CLIMBS the   * ladder to the next level. He LOOKS to his left, Q-Bert is   * about to be hit by an OVERHEAD BARREL...   * Numbered Script (04/17/2014)   88.",
      "characters": [],
      "action_text": "PRESIDENT COOPER   * Q-Bert! Look out!!!   * Q-Bert LOOKS UP. A barrel is FLYING DOWN AT HIM. He has no   * time to move away and is... CRUSHED BY THE BARREL.   * MATTY   *  Q-bert!!!!  Cooper RUNS BACK to Q-Bert. But he is FLATTENED. His eyes are   * ROLLED BACK. He appears to be... DEAD. Brenner calls back to   * Cooper. Brenner LOOKS DOWN at the fallen Q-Bert.   * BRENNER   * Chewie! Come on!   * They don’t have time to dwell. Cooper DASHES AWAY, leaving Q-   * Bert. Donkey Kong sees them and ROARS. He starts throwing MORE   * BARRELS.   * Brenner GRABS another hammer. He starts POUNDING on the   * barrels. But THERE ARE TOO MANY. Suddenly a BARREL FALLS   * DIRECTLY IN FRONT OF HIM, almost KNOCKING Brenner to his   * death. Brenner panics.   * BRENNER’S POV: he sees the same unpatterned chaos he saw when   * he lost the Donkey Kong championship in ‘82.   * BRENNER (CONT’D) There’s too many. We’re not gonna make it. MATTY (calling down) Brenner! Remember: if someone programmed it, there’s a pattern! You just need to find it! Brenner looks up, counting barrels, mumbling to himself.   * BRENNER I can’t see it... MATTY   * Eddie used cheat codes, right?   * BRENNER   * Yeah, so what? MATTY   * So he must have used them when he beat you at Donkey Kong back in ‘82. You know what that means? Numbered Script (04/17/2014)   89. BRENNER (dawning on him) I’m the Donkey Kong champion of the world... MATTY   * And the Donkey Kong champion of the world sees the patterns! Violet suddenly grabs his face and kisses him hard. Then...   * VIOLET  Save him and you’re in.   * Brenner gives a look to Cooper, who smiles.   * Brenner starts WAILING ON THE BARRELS. He SLAMS DOWN the   * hammer on barrel after barrel, taking them all out, until the   * hammer DE-PIXELATES in his hands. He looks up at Donkey Kong,   * calculating... looks back to the others.   * BRENNER Do exactly what I do!   * Brenner LEADS Violet and Cooper forward. He CLIMBS UP to the   * next level.   * A Barrel HEAD",
      "dialogue_count": 0,
      "word_count": 2784
    }
  ]
}