{
  "slug": "poker-face-101-dead-mans-hand-2023",
  "title": "poker face 101 dead mans hand",
  "genre": "thriller",
  "format": "series",
  "scenes_count": 8,
  "characters_count": 0,
  "characters": [],
  "total_words": 11444,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT.   NATALIE'S LIVING ROOM A   key in the lock.   Then the door swings open.   Natalie enters, blinking in the dark. NATALIE Jerry? A   flash and pop, and Natalie falls to the ground.   Cliff steps from the darkness and shoots her once more.   Then he wipes the gun down and places it carefully in Jerry's right hand. EXT.   NATALIE'S HOME Cliff gets in his car, making a call on his cell.   Someone picks up. CLIFF Okay, it's   done. INT.   CASINO OBSERVATION ROOM - CONTINUOUS A   dark large room suspended above the casino, looking down on   the gaming tables.   Sterling stands with his phone at his ear.   He lowers it, hangs up.   Takes a second to collect himself. Then   walks back across the room and sits across from an unseen woman. WOMAN (O.S.) You alright? STERLING Yeah.   Where were we? CUT   TO BLACK FADE   UP ON EXT.   BULL RUN - EARLY MORNING Sun   on the horizon, sea blue sky.   The casino in the distance.   A trailer home sits on a dirt lot, a beat up dusty '69 Plymouth Barracuda parked in front. 9.",
      "characters": [],
      "action_text": "INT.   TRAILER A   cozy mess.   Lazy sunlight.   Lying on her back in bed is CHARLIE CALE, mid thirties.   She scrolls through her phone, occasionally grunting in reaction to something.   At some point her phone's alarm goes off and without missing a beat she   silences it. CHARLIE Yeah alright yeah. She   stretches. LATER: Charlie's in the shower.   Phone propped up playing the   local NPR station, some current political debate. EXT.   TRAILER - EARLY MORNING Now   in shorts, flip flops and a sleeveless t-shirt, Charlie ambles out into the dirt lawn.   Her neighbor John-O, an elderly man with jet black rockabilly hair, putters in his junk   filled yard. CHARLIE What's good John-O? JOHN-O Yo yo yo.   You wanna help me ebay some old old Playboys?   I'll cut you in,   They're mint. CHARLIE John-O, I gotta go to work in a few. She   cracks open a beer. JOHN-O They're mint. CHARLIE Johhhhn-O,   where'd you get em?   No more break   ins, don't make me bail your ass out again. JOHN-O None of that no, John-O's clean-O. Bitty's in   the kitty, shit's in the kicker, the world is a beautiful place. CHARLIE Alright. 10. She   lights a cigarette, sits in a lawn chair.   Her phone playing a news podcast, a report about online child pornography sites on the dark web. Reacting to the report: CHARLIE   (cont'd) Fuuuck. Sips   her beer. LATER:   She tosses in her bag and slides into her Barracuda. Keys   it, and is met with a lurching grind.   Tries again. Again.   No luck.   She exhales. CHARLIE   (cont'd) Oh for god   damn. She   picks up her phone, calls someone.   After a moment: CHARLIE (INTO PHONE) Hey, you leave yet? EXT.   BULL RUN NEVADA - MORNING A   beat up SENTRA drives over the bridge towards the casino. INT.   SENTRA Charlie rides shotgun, flipping her phone.   Natalie drives, wearing a baseball cap and big Elvis sunglasses.   We'll have plenty of time and cues over the next few scenes to recognize her and realize we've flashed back in time, no need   to get it immedia",
      "dialogue_count": 0,
      "word_count": 2973
    },
    {
      "scene_number": 2,
      "slugline": "INT.   TRAILER - MORNING Similar to when we first met Charlie, but Natalie's sleeping with   her in the tiny bed.   Pulp Fiction plays on an ipad on the   end table.   Charlie flips through her phone.   Natalie stares into space. CHARLIE It's crazy   the things people stick up their asses. NATALIE Yeah.   beat (   ) What are you reading? CHARLIE \"Ten craziest things people have stuck up their asses.\" NATALIE Jerry's gonna be home tonight.   He's gonna be there and he'll be sorry and sweet and he'll get sober for awhile. CHARLIE Get a restraining order. NATALIE It's his house, he owned it before we got together. CHARLIE Divorce him, you get the house. Natalie gets up. NATALIE No I signed a thing.   I dunno, I was stupid.   I   can't afford to be out on my ass right now.   Maybe that's a dumb reason to stay with Jerry but it's just true, with my mom and everything   I can't afford it. CHARLIE You can stay here. Natalie smirks, c'mon. CHARLIE   (cont'd) Just pisses me off. 24.",
      "characters": [],
      "action_text": "NATALIE I know.   I   think in another life you were a knight.   Helping the little guy.   Miss   Galahad. Natalie kisses Charlie's head and exits. JULES (ON THE TV)  Maybe I'll   wander the earth.   Like Kane in Kung-Fu.  EXT.   TRAILER - MORNING Charlie in her Barracuda, keys it and it turns over.   Purrs. She   gives the thumbs-up to Natalie in her Sentra. CHARLIE The car gods smile upon us this day. Natalie returns the thumbs up and drives off. Charlie watches the dust trail of Natalie's Sentra recede towards the highway.   Thinks a moment.   Then she makes a call   on her cell. CHARLIE (INTO PHONE) Hey, whosis, Joe?   Hey man, how goes. You know, bitty's in the kitty, shit's in the kicker, the world is a beautiful place. From   his yard, John-O raises a hand and calls JOHN-O Yeah! CHARLIE (INTO PHONE) Hey Joe gimme Sterling's office. EXT.   STERLING FROST HOTEL AND CASINO - LATE AFTERNOON In   time lapse the desert sun arcs across the sky, until it's low   and looming in early evening. INT.   CASINO FLOOR Buzzing, blinging, swarming with life.   We move over it, coming to... 25. INT.   HIGH ROLLER ROOM - CASINO FLOOR Partitioned off, with its own bar and a few nice tables.   At one   of them sits the SMALL BALD man from the suite in the opening scene.   He plays hold-em while his small entourage hangs out behind him on their phones, bored. STERLING (O.S.) You know who that is? CHARLIE (O.S.) Mr.   Caine. STERLING (O.S.) Saaed Caine.   Oil guy.   Right.   And do you know why you know who he is? CAINE drops a sizeable stack from the racks of chips n the table in front of him.   We follow his practiced movements. CHARLIE (O.S.) Cause he's   a high roller, anything he asks for we bump it to the top of the ticket and   tell the floor boss. STERLING (O.S.) Caine is a   whale.   He's one of four or five whales we get in here every year, we fly them in, they drop what islands cost in a weekend, for them it's a drip in the bucket.   Whales. But Caine is our Moby Dick. W",
      "dialogue_count": 0,
      "word_count": 2047
    },
    {
      "scene_number": 3,
      "slugline": "INT.   CORNER SUITE 2 - DAY An   identical suite.   This one has Sterling on his knees examining a couch.   He turns, looks at Charlie, sitting in the   back of a room, still shell shocked. STERLING I didn't realize you two were close. I'm sorry. CHARLIE She called   me that night.   I don't know when I missed the call, it must have been when we were together.   She might have   been asking if she could stay with me.   If I had picked up... STERLING Hey, you can't go down that path. Nobody knows why she called you, she could have   called for a lot of reasons.   You can't blame yourself for this, it'll lead nowhere good. Right? Charlie manages a half hearted nod.   Sterling gently tries to   re-engage with their planning session. STERLING   (cont'd) So this suite is identical to Caine's, with the exception of ceiling height.   This is the table they'll use for the game. A   large round table at the end of the room, backed by panoramic windows. STERLING   (cont'd) It's heavy   and big so it's unlikely he'll move   it, and our informer said last time he sat with his back to the window, facing the room, which makes sense.   And is good for us. CHARLIE Why'd she go home early? STERLING Why'd she what? 34.",
      "characters": [],
      "action_text": "CHARLIE Her shift ends at 9.   I missed a call from her just before 8 and Nichelle saw her leaving just after 8. STERLING Maybe she got sick? INT.   UTILITY HALLWAY - MORNING - FLASHBACK Charlie talks to a gruff HOUSEKEEPING MANAGER while staff dodges by them. HOUSEKEEPING MANAGER She woulda   clocked out if she got sick, or even texted me. CHARLIE Whoa, she didn't clock out? HOUSEKEEPING MANAGER She just ghosted.   Left her cart in the hall, Cecilia had to clean up the rest of her floor. INT.   CORNER SUITE 2 STERLING Wait you talked to her manager? CHARLIE Louis, yeah STERLING Why did you do that? CHARLIE Cause I wanted to know why she went home early, why she called me. Something happened just before eight o'clock, it was scary enough that she called me for help and then basically ran.   What   happened? STERLING Considering she went straight home, the obvious answer is her husband called her.   Maybe, who knows, threatened   suicide, so she rushes home. 35. CHARLIE That's what you'd assume, that's what everyone is going to assume, just reading the news on here. waves her phone (   ) But I   knew   Nat, and I know that doesn't make sense. STERLING I know you   think you have a read on people, but it actually makes perfect sense CHARLIE Nat kept her phone off during her shift. Sterling takes this in. CHARLIE   (cont'd) So whatever spooked her wasn't a call, it wasn't Jerry, it was something that happened here, while she was working.   What was it? STERLING Look.   Her   husband was an abusive low life.   It's tragic and sad but it's not complicated.   I'm sorry.   I don't want to be   insensitive.   But we're in the middle   of a very time dependent operation and until tomorrow night I need you focused. Can you still do this? She   breathes.   Knows he's right.   Makes an attempt: CHARLIE A camera in the couch won't work. STERLING Why not?   It's the clearest eyeline CHARLIE Swapping out the couch is clunky, could get noticed, and you're going to need multiple eye",
      "dialogue_count": 0,
      "word_count": 1806
    },
    {
      "scene_number": 4,
      "slugline": "INT.   TRAILER - EARLY MORNING A   now familiar tableau of Charlie in bed, sunlight through the   window... but instead of being on her phone she's tapping random numbers into Natalie's iPad, which is plugged in   next to her bed.   Her eyes are bleary.   Who knows if she's been doing it all night. Moments later:   she opens her fridge.   Doesn't see what she wants. CHARLIE Aaauuuuuggghhhh. EXT.   LIQUOR STORE - MORNING A   cinder block liquor store on a desolate sun baked block. Charlie walks down the sidewalk in flip flops, iPad in hand, trying random codes as she walks into the store. INT.   LIQUOR STORE She   grabs a six pack of beer from the refrigerated case, and stops at the little free-standing ATM.   Blearily puts in her card, asks to withdraw 20 bucks and enters her PIN - \"1234.\" As   she's waiting for her cash, she looks at her locked phone, and a spark goes off in her mind. CHARLIE Oh oh oh oh - INT.   NICHELLE'S BEDROOM - MORNING Nichelle has her phone to her ear while trying to get her 5 year   old dressed.   A 2 year old runs around behind her banging on the walls with a plastic bat. NICHELLE Charlie say that again, Natalie's what? Intercut with: 43.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 212
    },
    {
      "scene_number": 5,
      "slugline": "INT.   TRAILER - MORNING CHARLIE Her thing,   her, when they were going to cut it off but you said she got sick and you had the combo for her thing with   the clicking thing where she puts her clothes FUCK what's it called NICHELLE Her locker? CHARLIE HER LOCKER   GODDAMN IT what is up with me and that word yes her locker combo NICHELLE 9248. CHARLIE Thanks Chelle. Moments later - Charlie keys \"9248\" in and the ipad unlocks. She   allows herself a moment of victory, then dives in. Clicks the promising MESSAGES app... but gets a \"to set up messages on this ipad enter your apple id.\"   Shit. Goes   to email instead. Nothing, some innocuous emails about work and from family. Shit   shit.   Checks Facetime.   Last call was a week ago with MOM. Clicks back out to the home screen.   Filled with games and dumb   apps.   The home screen picture visible behind them, Natalie and Jerry smiling lake-side. CHARLIE   (cont'd) I'm missing something Nat.   Tell me what I'm missing. As   Charlie gazes at it her eyes drift to the top of the photo.   To the bright, clear sky above lake Tahoe. With   a single, puffy cloud. Something snaps into place.   BINGO. Charlie clicks PHOTOS. 44.",
      "characters": [],
      "action_text": "The   very first shot is Natalie taking a selfie.   Charlie zooms into the mirror behind her and sure enough, the pic was   taken with Natalie's phone.   These are her phone pictures synced up via the cloud. She   flips through them... more selfies, a sunset shot, out with   the girls, one of Charlie drunk... she goes to grid mode   and scans the pictures for a few pages.   Nothing suspicious or enlightening. Then   she pauses. Clicks back to the \"LIBRARY\" menu.   Then scrolls down... way down... ...to \"RECENTLY DELETED\" The   grid is a matrix of thumbnail dicks. CHARLIE   (cont'd) Augh.   Dick cloud. A   few random normal ones are in there, which Charlie checks out.   Scrolling down to the most recent shot. A   shot of a laptop computer screen.   Weird. The   time stamp on it is the night of her death... 7:54pm She   double checks the missed call on her phone from Natalie - 7:56pm Charlie breathes in.   Expands the photo.   Zooms in on it. Her   eyes go wide with horror, the same that we saw in Natalie's eyes in the opening scene. CHARLIE   (cont'd) Holy holy. EXT.   BULL RUN NEVADA - MORNING Charlie's barracuda tears down the highway towards the distant tower... EXT.   STERLING FROST HOTEL AND CASINO ...and hops the curb peeling into the casino parking lot. 45. INT.   CASINO FLOOR Cuts   through the flashing games and tables, iPad in hand, furious. INT.   STERLING FROST JR'S OFFICE - MOMENTS LATER Sterling, Cliff and Charlie stand over his desk.   The iPad open   to the photo.   They both take fleeting glances at it, like   their eyes are touching something hot. CHARLIE And that's   it.   Look at the time stamp.   She was cleaning Mr. Caine's presidential suite.   His laptop was open, and she saw this. CLIFF How do you   know this is Caine's suite? STERLING weary (   ) The ceilings.   You can see in the background   here.   The presidential suite is the only one with these high ceilings. CHARLIE She could have just let it go.   But she did something.   She took a ",
      "dialogue_count": 0,
      "word_count": 1004
    },
    {
      "scene_number": 6,
      "slugline": "INT.   CASINO FLOOR - LATER Cliff breezes through on his way to the elevators. CHARLIE Hey Cliff,   wait up.   Wait up wait up. Hey, are you going up, I thought we'd go up together if you're going up - She   catches up with him. INT.   ELEVATOR - MOMENTS LATER The   two of them alone in the staff elevator.   As the doors ding   closed, Charlie has not stopped talking, fast and edgy. CHARLIE - so I'm watching the news and they're saying about the whole thing and I'm getting angry thinking what doesn't fit something doesn't fit and it's driving me nuts then I remember you took Jerry into the back room and I figured you would have released him to the cops so what was he doing home that night   but no, no no, you just let him go   for some reason and I wanna know   why, cause the tv news said it was at Natalie's request but I was with   her and she didn't request shit, she didn't - CLIFF Are you on   coke? CHARLIE No, coffee!   I thought \"oh this'll be a good thing, I won't have a beer and be a dumb ass I'll have coffee cause that's for   thinking\" but I never fucking have coffee and I'm spazzing out, I'm sorry, I know I am but this is important. CLIFF You're asking why we released him? Well we decided not to press charges, give him a   warning.   And Natalie split, I think she went with you right?   So   she wasn't around.   So what else were we going to do? 49.",
      "characters": [],
      "action_text": "CHARLIE And he never tried to come back? After you let him go?   He never came back to the casino? CLIFF No. The   elevator DINGS.   Charlie is looking at him weirdly. CLIFF   (cont'd) Am I lying? CHARLIE No you're telling the truth. The   doors open. CUT   TO:   A pixelated video image of STERLING sitting at the table in the Corner Suite 2.   Cliff sits in one of the other chairs, his back to us. Charlie is in: INT.   STERLING FROST JR'S OFFICE Watching this on two monitors set up on the desk.   She studies Sterling's face as he holds up three card, one after the   other, their backs to us.   Over a scratchy speaker: STERLING (ON SPEAKER) Two of hearts.   Ace of diamonds. Eight of diamonds. Charlie breathes, unlocks her phone. INT.   CORNER SUITE 2 Charlie enters. CHARLIE Bullshit, true, bullshit. STERLING Alright.   This is going to work. She   looks at the lamps. CHARLIE Where are the cameras?   I can't even see - 50. STERLING Here, by the knobs.   He's going out to dinner at six tonight, we'll swap these out for the lamps in his room. We'll station you here in my office. CHARLIE So how's it work? Cliff shows her a picture on his phone of a middle aged man. STERLING This is our guy.   You won't meet him before, it's safer if you don't. Presenting   himself to Caine as Don McClintock, he's been in the game a few times before.   He'll wear a clicker on   his ankle. Sterling hands Charlie a little remote with a single button. STERLING   (cont'd) One click for true, two for bullshit. Say that to me. CHARLIE One for true, two for bullshit. That's it? STERLING Keep it simple.   Don't get freaked out if our   guy loses a few at the top, eases   into it.   You just keep watching and feeding him the info. By the end   of the night the betting will get big and that's when he'll make a move. CHARLIE What are we taking Caine for? STERLING You'll see.   Just don't freak out when it gets big.   Truth or bullshit. That's all   you focus on. CHARLIE Always. STERLING Cliff will  ",
      "dialogue_count": 0,
      "word_count": 2856
    },
    {
      "scene_number": 7,
      "slugline": "INT.   HOTEL ROOM And   walks STRAIGHT THROUGH IT past the Housekeeper who barely looks up from her work.   She goes to the picture window and OPENS IT then BREAKS the screen away using the fire   extinguisher. The   Housekeeper watches her. HOUSEKEEPER Charlie? CHARLIE Hey Jen.   Take care of yourself. EXT.   STERLING FROST HOTEL AND CASINO Deep   evening, sky aglow.   Very small in frame, Charlie clambers out of the broken window on the second level, drops the   ten feet to the grass below with a grunt. Then   heaves herself up and limping like Quasimodo drags herself across a long barren stretch of utility concrete, the   hotel tower looming behind her. Into   the employee parking lot, where she finds and falls into   her Barracuda. INT.   BARRACUDA Charlie's a bloody mess.   Distant sirens.   She puts the key in   the ignition and holds her breath.   Please god. SHE   TURNS THE KEY. EXT.   HIGHWAY - NIGHT The   Barracuda ROARS past us, away from the distant tower of the   casino.   Cop cars head the opposite director, their lights ablaze. CUT TO: A   COFFEE CUP With   a smudge of blood on the handle. 63.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 188
    },
    {
      "scene_number": 8,
      "slugline": "INT.   DENNY'S - PRE-DAWN The   cup sits unattended.   Then, from the bathrooms, Charlie limps towards the bar, holding her side.   Cleaned up a little. She   sits with a grunt.   Puts Sheriff Parker's blood-smudged business card on the bar and looks at her phone - she's written an email to him with the text: \"Taken in Saaed Caine's hotel room by Natalie Hill. Trusting you to do your job.\" Attached to the email is the photo.   Charlie scrolls up to hit   \"SEND\" then pauses.   Adds \"FBI@FBI.GOV\" to the CC field. Then   \"CIA@CIA.GOV.\"   Then after consideration, \"OPRAH@OPRAH.COM.\"   Hits SEND. WAITRESS Everything   alright? CHARLIE Yeah.   Hey   can I get a beer? She   flips at her phone.   Stories about Sterling.   CASINO BOSS   SUICIDE.   Nothing about her. Then   her phone starts to ring. From   \"UNKNOWN.\" EXT.   DENNY'S - DAWN Charlie limps out, answers the call. CHARLIE Yeah? VOICE Charlie?   Long time no time.   You know who this is? CHARLIE Mr. Sterling.   Yeah been awhile. STERLING FROST SR Oh god kid.   This is a mess isn't it. I just talked to Cliff.   This is just a mess.   (MORE) 64.",
      "characters": [],
      "action_text": "beat (   ) STERLING FROST SR   (cont'd) I let you off once, Charlie.   I gave you a life.   It was a pretty good life, right? CHARLIE So what happens now? STERLING FROST SR Tell me where you are.   You might as well tell me where you are.   Cause there's no   corner of the country small enough for you to hide in. There's no   off the grid that's off the grid enough for you to hide from me.   I'm a   tough old bastard and I've got some years left and I'm going to spend them   finding you so I can hit you where it's going to hurt.   And when I do kill you, finally, you'll thank me for it.   Now tell me kid... am I lying? CHARLIE Hey I gotta go. She   hangs up.   On her way to her car she drops her phone, picks up a big rock and SMASHES it, tosses it out into the desert. Gets   in her Barracuda and drives off a long straight road into   the middle of America. 65.",
      "dialogue_count": 0,
      "word_count": 358
    }
  ]
}