{
  "slug": "power-101-not-exactly-how-we-planned-2014",
  "title": "power 101 not exactly how we planned",
  "genre": "action",
  "format": "series",
  "scenes_count": 6,
  "characters_count": 1,
  "characters": [
    "FRANKIE"
  ],
  "total_words": 14350,
  "total_dialogue": 1,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. TRUTH NIGHTCLUB - NIGHT Ghost walks through the club, passing the main bar, where BARTENDERS are pouring drinks with deliberate speed. The women’s room door opens, offering a glimpse of a lesbian COUPLE, inside, fucking against the wall. Two other WOMEN tumble out of the restroom, white powder still under one woman’s nose. Ghost signals a bouncer. GHOST Those girls. Find out where they got it and kick him out. No one fucking sells their shit in my club. BOUNCER #3 Should I kick the girls out too? GHOST (with a laugh) Nigga, you crazy? Ghost watches the women laughing, blending into the happy crowd, short skirts, titties bouncing. INT. UNDERGROUND LOADING DOCK - NIGHT QUICK CUT of that same terrified woman-- the club’s music still playing far in the background. It’s clear now that the woman’s lying down on cement. Her right BREAST is EXPOSED. The same white hand from before strokes her breast, lingering at the nipple. Her eyes follow the hand. A TEAR rolls down her cheek. INT. TRUTH NIGHTCLUB - NIGHT Ghost comes back to his table, where Tasha is entertaining their guests. He kisses her on the cheek. GHOST Everyone having a good time? TASHA Everyone except you. Why don’t you sit down with me, relax? GHOST Not yet. I gotta handle some details. He starts to turn away, but she grabs his hand. TASHA Don’t you have people for that?  3.",
      "characters": [],
      "action_text": "GHOST Customer service, Tasha. I do this part myself. He slips his hand from her grasp and splits. Tasha watches him go, resigned. Then, she waves a waitress over, with a practiced smile: TASHA More champagne. More vodka. More everything. As her guests toast her order: “That’s what I’m talking about,” “You know that’s right,” etc, we smash to: INT. UNDERGROUND LOADING DOCK - NIGHT The HAND caresses the woman’s leg, traveling up to the inside of her thigh. It pulls up her skirt, revealing her panties. Blue lace. Cheap. We do not see her face-- just the area between her navel and her upper thigh. Vulnerable. Unprotected. Exposed. We HEAR a muffled sob. INT. TRUTH NIGHTCLUB - NIGHT Ghost ascends to a high banquette and approaches his club manager, JOSH KANTOS (30, Massapequa goes to Wharton, always moving-- like a shark). The two men talk as they look over the dance floor and VIP. KANTOS Headcount’s at 200 and it’s not even midnight. Fire Marshall told us to keep it under 150, so if he shows up we’re fucked. GHOST Place is fucking bananas. (considers him) You might be worth your paycheck. KANTOS Best goddamn nightclub opening the whole year. My whole database turned out. GHOST Max has your list at the front. We’ll see who showed and who didn’t. He moves to get a different vantage point. Kantos turns to follow, but a WAITRESS steps between them with a magnum of champagne service, headed for VIP.  4. A group of MODELS follow her, heat-seeking missiles for the big wallet at the end of the rainbow. Kantos catches up-- KANTOS I told people how hot it was gonna be, but I can’t make’em show up. GHOST Yeah, that’s right. But when this shit hits Page Six tomorrow they’ll call you to make sure they can get in next week. And that’s when you tell them the guest list is full. KANTOS Look, Boss, my VIPs are used to easy access wherever I work. GHOST Which makes you a hooker. (off his look) You know the right people. This place is bangin’ tonight. But we stay in business if we keep t",
      "dialogue_count": 0,
      "word_count": 2601
    },
    {
      "scene_number": 2,
      "slugline": "INT. TRUTH - HALLWAY/KITCHEN - CONTINUOUS -- and walks down a cement hallway. With each step, the throbbing beat of the music gets louder, until-- INT. TRUTH NIGHTCLUB - NIGHT - CONTINUOUS -- Ghost steps out onto the floor, in dead center of his packed club. As he surveys the scene a WAITRESS walks past him with a huge bottle of sake. He stops her cold. GHOST Table 45 was drinking Wataribune Sake. Take that back to the bar. (before she goes) And when you’re done, flip the bottles at 72, 68, and 64. They all need to order another round. WAITRESS I think they’re slowing down. GHOST Then get’em up and out. There’s people outside who want to give us their money. Go. She heads off in a hurry. Off Ghost, back in his element as master salesman, not skipping a beat... EXT. TRUTH - NIGHT Eddie stands outside, up against back of the building. It’s as quiet and dark as the front of the club is vibrant and bright. He dials his cell: JULIO (O.S.) Hello? EDDIE Where you at? INT. JULIO’S CAR - NIGHT The other side of the conversation. JULIO (30), a strong, streetwise Puerto Rican drives on the West Side Highway. JULIO (O.S.) Gonna meet up with ‘Bueso when he’s done, get his stack, make the drop at the house.  14.",
      "characters": [],
      "action_text": "EDDIE Change of plans. (fuck) Close the store. JULIO What? Everybody? EDDIE Shut it all down. Now. Eddie hangs up. STAY WITH Julio as he hangs up. FOLLOW his eyes to his backpack, SEE it’s full of cash.   He heads for the highway exit, redialing his cell, while “Shooting Guns” begins to surge: INT. MANHATTAN STRIP CLUB - PRIVATE ROOM - NIGHT SABUESO (20, slim Latino male), counts cash as a suited white GUY, 30s, waits. His boys (suits) are getting lapdances from various strippers in the background. STRIP CLUB GUY This enough to keep the girls happy? We’ve got a long night ahead of us. Sabueso finishes counting, smiles. He reaches into his pack, pulling out packets of white powder and pills. But suddenly Sabueso’s phone BUZZES. He looks at a text -- reacts, oh shit -- and then smoothly puts the drugs back in his pack and hands the guy back his money. SABUESO I gotta go. STRIP CLUB GUY Wait, where are you going? Dude, I’m the best man. What the fuck am I supposed to do now? Sabueso doesn’t turn around. He just heads out of the building and onto the sidewalk. Off Sabueso, as he blends into the crowd... SMASH TO: INT. POSH MIDTOWN HOTEL - NIGHT LILIANA (26, petite Latina, cocktail dress) gets on an elevator, pushes PH. A group of drunk, partying TWENTYSOMETHINGS get on, give her a look when they realize she’s headed to PH too. They smile at Liliana, who feels her phone buzz. ANGLE on her purse, full of pill packets, as she pulls out the phone, checks it -- reacts, fuck.  15. The elevator doors open on the 6th floor to let some people on and Liliana slips off. She moves quickly down the hall and into the stairwell, heading down to the street, SMASH TO: INT. QUEENS TUXEDO SHOP - NIGHT In the back room, MARCUS (30s, black) runs stacks of money through an auto-counter, then slips bands around them. He’s workman-like, precise. This is the “house,” where Ghost and Eddie’s drug money is counted before it gets laundered. James is wearing SMS Audio headphones, but sees his phone",
      "dialogue_count": 0,
      "word_count": 3049
    },
    {
      "scene_number": 3,
      "slugline": "INT. KATE O’NEILL’S HOUSE - BABYLON, LONG ISLAND - DAY Eddie opens the front door and steps into the living room of a good sized colonial house. The curtains are drawn and the only light in the room emanates from a television tuned to a syndicated judge show. Eddie cocks his head, but the TV makes the only sound. Silent as a cat burglar, he closes and locks the door behind him, then moves down the hall to - INT. KATE O’NEILL’S HOUSE - BASEMENT - CONTINUOUS -- where he goes down the stairs and heads straight for a stand-alone deep freezer. We expect him to open it, but he reaches under it: ANGLE ON the underside of the freezer, revealing twenty duct- taped packets fixed to the bottom. Eddie’s fingers grab two packets. He stands up and shoves the packets in his jacket pocket, flips off the lights and heads upstairs. INT. KATE O’NEILL’S HOUSE - DAY Eddie’s moving down the hall toward the front door when a woman’s voice from the dark stops him cold: KATE Eddie? Is that you? EDDIE (a moment, then) Yeah, Ma. It’s me. KATE You were just gonna leave without saying anything? EDDIE Why aren’t you at work? What are you doing here sitting in the dark? KATE I got a migraine. Last couple of days. You would have known if you had called me. (then) Turn on the light. Let me see you. Eddie turns on a light, revealing his mother, KATE O’NEILL (54), formerly gorgeous, now steeped in cigarettes and disappointment.  27.",
      "characters": [],
      "action_text": "The living room is over-decorated, with QVC angel figurines lined up on every available surface. Kate reaches for her eyeglasses on the table next to her, but her hand is shaking. EDDIE Ma, what’s wrong with your hand? Kate quickly hides her shaking hand under her blanket, almost knocking over a framed 8 x 10 of herself as a beautiful Atlantic City showgirl with flame red hair. KATE My nerves are bad, that’s all. (then) You got anything on you to help me calm down? I know you do. EDDIE No, Ma. No. KATE I just need something to feel better. You do want me to feel better, don’t you? Off Eddie, fuck-- INT. JAMES HOTEL - ELEVATOR - DAY Eddie and Ghost get in and ride next to each other. Eddie reaches into his jacket and   hands Ghost the two packets of cash from Babylon. Ghost tucks them inside his bag. GHOST You tell your mom I said hello? EDDIE Didn’t come up. Sorry. A beat. The two friends ride in silence. EDDIE (CONT’D) She’s gettin’ worse, you know? I can’t be out there all the time-- But Eddie’s cut off by the sound of Ghost’s cell. BUZZ. BUZZ. Ghost looks at it. EDDIE (CONT’D) Lobos? He better not be changing the fucking time again.  28. GHOST Kantos. Let me just see what he wants. What’s up? INT. TRUTH - DAY - INTERCUT Kantos moves through the kitchen. KANTOS You recognize the name Simon Stern? GHOST No. He want on the list or some shit? KANTOS He’s one of the biggest nightlife investors in New York. He saw the Page Six write-up about the club. Wants to sit down. Day after tomorrow. Eddie gives Ghost a look: “Get off the phone.” GHOST I don’t know. Got a lot of shit on my plate at the moment. KANTOS It’s a big deal. He only talks to the major guys. With Stern behind us, we could open clubs in Miami and Vegas end of next year. The elevator stops, and Ghost and Eddie approach the door of Lobos’s suite. GHOST I’ll call you back, man. Ghost hangs up, his mind reeling a bit from the idea. Eddie crashes into his thoughts. EDDIE What’s his problem now? (before Ghost ca",
      "dialogue_count": 0,
      "word_count": 661
    },
    {
      "scene_number": 4,
      "slugline": "INT. JAMES HOTEL - PENTHOUSE - DAY - MOMENTS LATER Eddie and Ghost sit at a dining table in a suite at the St. James hotel. Lobos holds court across from them, with his bodyguards present. Lobos speaks English for Eddie’s benefit. LOBOS You have my money, of course. Ghost brings out the bag he packed the night before. Lobos hands it to one of his men, OMAR, who takes out the money and begins to count in a whisper. LOBOS (CONT’D)  Not out loud. What are you a grade- school child? Javier, you do it.  And JAVIER takes over. As he counts, the air is tense-- GHOST It’s all there. But Lobos wants for Javier’s signal. When it comes: LOBOS Now that the business is out of the way, we can eat and enjoy ourselves. GHOST There’s something you need to know,  Jéfe . We got hit last night. EDDIE Asshole got one of our guys. Cleaned him out. LOBOS You caught this man? (off Eddie’s nod) You got the money back, the drugs? GHOST No. He stashed them. Or gave it to his partner to hide. (then, as Lobos stands) The thing is, the way it happened? His information was too good. He knew who to hit, where and when. Until we know how he got his information, we’re exposed. LOBOS And he didn’t talk.  30.",
      "characters": [],
      "action_text": "EDDIE Unfortunately for him. LOBOS Unfortunately for you. (without anger) You took your men off the street. GHOST Had to. No choice. LOBOS You’re losing about $1000 an hour. Glad to see you knew enough not to let it affect our pay schedule. (with a sigh) When I hired you to be my New York distributors, you guaranteed me a certain level of professionalism. Eddie starts to respond, but Ghost stops him with a look. LOBOS (CONT’D) You told me the Kings, the Bloods, the DDP, none of them were worth my time. I believe your exact words were: “They’re gangs. We’re a business.” You said only you could reach the kind of high-end clientele that would pay premium rates for my product. GHOST We have a plan to fix the situation. LOBOS Good. Then you don’t have time for lunch. Have a good day, gentlemen. Dismissed, Eddie and Ghost stand up to leave. Eddie heads out the door. But Lobos holds Ghost back -- LOBOS (CONT’D)  You know, you get this under control, you could have your own cartel one day. You live in the countryside, take up watercolors while your men take on all the risk. You do business two, three days a year.  (then, a light threat)  31.  (MORE) You don’t, I’ll have to take my business elsewhere. And then, what use will I have for you?  GHOST  We’ll get it done.  LOBOS  I know you will.  Lobos pats Ghost on the shoulder and lets him pass. The door closes behind Ghost. A beat, then, to Javier-- LOBOS (CONT’D)  Tell the pilot we’re not leaving tonight.  INT. JAMES HOTEL - DAY - MOMENTS LATER Ghost and Eddie emerge into the daylight. Shawn is waiting at the curb, as is Julio, behind the wheel of a fully restored late 1960s Mustang. Julio gets out, tosses Eddie the keys. GHOST See you tonight. (then) Watch your back. EDDIE You too, motherfucker. Eddie walks past Julio, who now gets in the passenger seat. EDDIE (CONT’D) Full detail right? Even the trunk? JULIO Especially the trunk. EDDIE Good. ‘Cause I hate the smell of blood. And as the two cars pull away from the curb, May",
      "dialogue_count": 0,
      "word_count": 2559
    },
    {
      "scene_number": 5,
      "slugline": "INT. OAXACAN RESTAURANT - NIGHT Lobos has dinner with a group of Latino men in suits. He laughs, talking with his mouth full of food, totally relaxed. In the reflection of a saint painting on the wall, REVEAL the TEARDROP THUG, watching Lobos from across the restaurant... INT./EXT. TRUTH - NIGHT “GET BUSY” continues as Tasha enters the club with a nod from Max the doorman. She stops, reacting to the redecorated club and the crowd: at the young girls in tight, bright dresses and the men dancing with them, moving to the pounding music. She stops a bouncer. TASHA Can you find my husband for me? BOUNCER (into the radio) Anybody got eyes on the boss? Tasha looks up at Revis and his friends in VIP, covered in girls and alcohol and having a great time. Tasha runs her hand over her black dress, feeling invisible. BOUNCER (CONT’D) The Boss is prepping the live act now. Can I take you to your table? He indicates a table upstairs with a bottle of champagne chilling on ice, away from the action. Tasha looks, then: TASHA I know where he’ll get to me a little sooner. And she heads right into VIP, into the Birthday party in full swing. As she works her way up to Revis’s table.... INT. TRUTH - NIGHT Ghost and Kantos walk and talk, high above VIP. KANTOS He brought back up dancers who were not in the contract. GHOST We got extra spotlights on hand? Kantos sees Tasha pouring drinks with the birthday boy.  42.",
      "characters": [],
      "action_text": "KANTOS Isn’t that your wife, down in VIP? But Ghost doesn’t respond. Instead he’s staring at a beautiful WOMAN (30s) entering the club with her friends. As she walks across the floor, heading for a banquette-- KANTOS (CONT’D) Mrs. St Patrick. Right there... But Ghost abruptly walks away to follow the other woman. She’s making her way through the dance floor-- faces, bodies, hands, drinks, all coming between him and his view of the woman’s face. -- ACROSS THE ROOM IN VIP,   Tasha sees Ghost crossing the room toward her, eyes focused. She pours herself another glass of champagne, waiting expectantly for him to arrive. But he walks right past her, his eyes focused on something, someone else entirely! Off Tasha as she realizes and turns to follow his gaze... -- BACK WITH GHOST, chasing his target. The music is loud, he begins to sweat. She disappears. GHOST (to himself) There’s no way it’s her. But then, above him at a booth, she sits down at a table and we know from his face: it is most definitely her. INT. TRUTH - NIGHT - BANQUETTE - MOMENTS LATER Ghost arrives at a table of four women, each dressed to kill. GHOST You look as good as I remember. ANGELA VALDES (30s) looks up. She’s beautiful -- and shocked. ANGELA Jamie? Ghost breaks into a big grin -- the first real smile we’ve seen from him. She grins back. GHOST Nobody calls me that any more. ANGELA What are you doing here?  43. GHOST I own this place. (signalling a waitress) The real question is, what are you doing here? ANGELA My girls brought me. This is Kayla, this is Cintia... Genesis here knows somebody who got us on the list. This is Jamie St. Patrick, my first real boyfriend, from about a hundred years ago. GHOST James. Kayla and Cintia wave hello, impressed. Genesis, weaved out, nails did, laced and thirsty, holds out her hand. GENESIS Nice to meet you. My boy said this place would be hot and he was right. This one didn’t believe me, though. We had to drag her ass out the house. The champagne arrives and An",
      "dialogue_count": 0,
      "word_count": 1762
    },
    {
      "scene_number": 6,
      "slugline": "INT. UPPER EAST SIDE APARTMENT BUILDING - DAY Liliana walks in and heads for the elevator. A uniformed DOORMAN stops her. DOORMAN  Excuse me, miss?  LILIANA  The Levins are expecting me. 38B? I’m the new housekeeper.  INT. UPPER EAST SIDE APARTMENT - DAY Liliana rings the doorbell and a Jamaican WOMAN holding a white toddler opens the door. GARDENIA Where you been hiding, girl? The Mrs. can’t get out the bed. Liliana follows Gardenia down the hall to the master bedroom. A thin, beautiful woman is lying in bed. GARDENIA (CONT’D) Mrs. Jessica, the girl is here. JESSICA Oh thank God. When you didn’t answer your phone yesterday-- LILIANA Sorry about that. (opening her pack) Won’t happen again. Jessica smiles as Liliana unpacks powder and pills. INT. ANGELA’S APARTMENT - BEDROOM - DAY Angela gets dressed in front of the mirror. She gives herself a once-over, turns to the side, examining her body. ANGELA Not bad for twenty years later. She hears a clattering SOUND off-screen -- WTF? -- and heads for the kitchen, tucking her blouse into her pencil skirt. INT. ANGELA’S APARTMENT - LIVING ROOM/KITCHEN - DAY Angela walks through her neat, comfortable place into the kitchen where GREG KNOX (35, all-American, hyper-fit) scrambles egg whites.  49.",
      "characters": [
        "FRANKIE"
      ],
      "action_text": "GREG You missed our run this morning. When you didn’t show up and you didn’t answer your cell, I thought maybe something was wrong. Angela digs her phone out of her clutch from the previous night. Sure enough five missed calls -- all from Greg. GREG (CONT’D) I got here and you were asleep, so I thought I’d make breakfast. ANGELA I thought we said that key was just for emergencies. GREG Which this could have been. You want some turkey bacon? (off her face) Come on, Angel, most women would be flattered. Greg puts the plate down in front of her at the table. ANGELA You’re right. I’m sorry. You just startled me, is all. Thank you. She kisses him, but he breaks the kiss to answer his buzzing cell. Angela picks up a slice of whole-grain toast, watches him read the text. GREG I gotta go. See you later? He kisses her goodbye. Off Angela, as she watches him go... INT. EDDIE’S CAR - DAY Eddie drives Ghost into the city. Ghost looks out the window at some kids hanging out on the corner. Eddie sees them, too. GHOST Angela Valdes came into the club opening night. EDDIE From freshman year of high school? Wow. What’s that-- GHOST Twenty years. Twenty-two.  50. EDDIE How’d she look? (off Ghost’s reaction) That good, huh? She married, have kids now? GHOST No ring. Didn’t say nothing about kids. EDDIE You tell her about yours? GHOST Well, we didn’t talk that long-- EDDIE  Ohhhhh shit--  GHOST What’s that supposed to mean? EDDIE It means, what are you thinking about doing? (eyeballs Ghost) When that girl moved away, she seriously fucked you up. I was there, remember? GHOST That was a long time ago. EDDIE Tasha’s a good woman, man. Why you wanna go sniffing around pussy from high school? GHOST First of all, I can’t believe you’re starting some shit about monogamy. You got more bitches than the goddamn pound. But second, I know Tasha and I got a good thing. I’m not gonna fuck that up. (then) Just got me thinking about the road not traveled, that’s all. EDDIE The road not traveled? You a",
      "dialogue_count": 1,
      "word_count": 3718
    }
  ]
}