{
  "slug": "pretty-little-liars-101-pilot-2016",
  "title": "pretty little liars 101 pilot",
  "genre": "romance",
  "format": "series",
  "scenes_count": 4,
  "characters_count": 0,
  "characters": [],
  "total_words": 9920,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. ROSEWOOD MALL DEPARTMENT STORE - DAY HANNA MARIN (16) stands at the sunglass counter of the upscale department store. Skinny and gorgeous, Hanna is currently the stylish “it girl” at Rosewood High.   She tries on a glamorous pair of expensive shades and reviews her reflection in the mirror.   While still wearing the shades she beckons the MALE CLERK, a thirty-year-old retail lifer. HANNA Can I see the Guccis in the front? We see that there are a dozen pairs of glasses already out on the counter. CLERK I’ll have to put a few of these back. HANNA But they’re all maybe’s. She leans across the counter, intentionally giving him a peep show of her cleavage.   He gazes at her boobs - CLERK Those look - He glances back up at her face. HARRY Amazing on you. HANNA (still flirting) Maybe. The clerk complies with her request.   MONA VANDERWALL (16), also thin and attractive, calls to Hanna from across the aisle.   She models a floral summer scarf. MONA Is this me? Hanna checks her out. HANNA Or is it a little too much your... mother?  7.",
      "characters": [],
      "action_text": "Mona looks at herself in the mirror.   She takes off the scarf.   TWO WOMEN (40’s) steal glances of Hanna and share gossipy whispers as they pass by her.   Hanna notices. The clerk waits for Hanna to turn back to him.   Finally, she does.   He hands Hanna the Gucci glasses and she tries them on. MONA I am loving those glasses.   How much? HANNA Three fifty. Hanna looks past Mona and sees Spencer perusing the women’s fashions.   As Mona turns her attention to a yellow scarf, Hanna turns to the clerk - HANNA I’ll be right back. Hanna approaches SPENCER HASTINGS (16).   Although she is incredibly attractive, Spencer, an over achiever, prides herself on being smart, athletic, disciplined and successful. HANNA I can’t believe Spencer Hastings actually has time to shop. Spencer looks up to see Hanna.   She acknowledges her old friend with a welcome smile. HANNA I mean, you’re interning for the mayor, taking classes at Hollis, organizing the junior fund-raiser, and overseeing the barn-to-loft conversion which you’re moving into this weekend.   And in your leisure moments, you facebook and tweet. SPENCER You know me.   I like to stay busy. HANNA It’s called a summer vacay, Spence. SPENCER And you spent yours sunning, shopping and Seaning.  8. HANNA Tweet tweet. The women who were staring at Hanna now steal glances of both Hanna and Spencer.   Spencer and Hanna notice. SPENCER I hate this day. The WOMEN approach the girls. WOMAN #1 You were her friends, weren’t you? Spencer and Hanna share a look, but before they can respond. WOMAN #2 Know that we still think about her, too. WOMAN #1 And pray for her. The well intentioned but annoying women finally walk away. SPENCER She’s gone but she’s everywhere. HANNA I can’t believe it’s been three years. SPENCER My parents had the Fields’ over for a ‘que last weekend.   It was almost painful to hang out with Emily.   I mean I still like her, but we just don’t connect anymore. HANNA It’s weird how we all used to be so close and now... n",
      "dialogue_count": 0,
      "word_count": 4727
    },
    {
      "scene_number": 2,
      "slugline": "INT. ROSEWOOD HIGH SCHOOL - HALLWAY - MORNING Ezra walks down the empty hall.   Aria walks out of the classroom and calls to him. ARIA Ezra. He stops and turns back to her. ARIA Did you tell anyone about us? EZRA No. He walks on.   Aria looks down at her phone.   She pulls up the text from “A”. ARIA (to herself) Well, somebody knows. INT. MARIN HOUSE - FAMILY ROOM - MORNING Hanna and her boyfriend, SEAN, sit close to each other on the couch.   Gifted with good looks, brains and athletic ability, he is Rosewood High School’s most likely to succeed at everything he tries. They sip their morning coffees as they review their school work.   Hanna looks over at him.   God, he’s cute.   She casually puts her hand on his leg. After a moment, Hanna slides her hand up Sean’s thigh, toward the crotch of his Paper Denim jeans. SEAN Whoa. He pushes her hand away. SEAN You know I can’t. HANNA If you won’t tell I won’t tell. She leans over and kisses him on the neck.  34.",
      "characters": [],
      "action_text": "ASHLEY, Hanna’s mother walks through the room.   At 36, Ashley is well built and well maintained.   An executive VP at a local bank, she works hard to make her personal and professional successes look effortless. Sean backs away from Hanna.   Ashley is in the middle of a business call while she attempts to get ready for work. SEAN Good morning, Mrs. Marin. Heading into the kitchen, she tosses him a friendly, hello wave.   Hanna scoots back closer to Sean.   She mocks his polite tone. HANNA Good morning, Mrs. Marin. SEAN What am I supposed to say?   Yo, bitch? HANNA I love it when you talk dirty. She rubs up against him - SEAN Jesus, Hanna.   You know how hard this is for me. HANNA It doesn’t have to be. He pushes her away. SEAN I made a commitment.   It’s upsetting that you don’t respect that. She’s annoyed. HANNA You are into girls, right? He’s pissed. SEAN You knew how I felt about this before we started going out.   I was totally up-front with you.  35. HANNA You’re right.   I’m sorry.   And I was just kidding.   I totally respect the “V” club and everything it stands for. He believes her. SEAN You know that it’s not because I don’t want to. He gives her a sweet kiss on the cheek. SEAN This is not easy for me. She throws him a forced, seemingly confident smile. HANNA I know.   And I completely support your commitment to virginity. SEAN Thanks.   That means a lot to me. He hugs her.   Sean doesn’t see the unsettled look that reads on Hanna’s face as she hugs him back. EXT. ROSEWOOD RESIDENTIAL NEIGHBORHOOD - DAY Emily and Maya walk down the sidewalk.   Emily notices that their hands keep bumping into each other.   She notices Maya’s soft skin.   Her eyes.   Her lips. MAYA Thanks for walking me home. EMILY It’s no big deal. When they approach Maya’s house, Emily sees a work CREW tossing Alison’s old stuff into a dumpster.   Maya reads the disquieted look on her face. MAYA Are you okay? Emily turns to Maya - EMILY It’s hard for me to talk about.  36. Maya listens, p",
      "dialogue_count": 0,
      "word_count": 944
    },
    {
      "scene_number": 3,
      "slugline": "INT. ROSEWOOD HIGH SCHOOL - GIRLS LOCKER ROOM - EVENING After their practices, the Rosewood jocks hang out and gossip in the communal showers.   Emily wraps a towel around herself and leaves the showers for her locker.   Just then, Spencer walks in from field hockey practice.   Their lockers are directly across from each other. SPENCER Have you been hanging with Aria? EMILY Not really. Emily opens her locker and a piece of paper falls out.   She picks it up and reads the note which was handwritten on graph paper. CLOSE ON NOTE:   Hey Em, Sob!   I’ve been replaced.   You’ve found another friend to kiss! - A  For a second, Emily stops breathing.   Spencer reads the look of distress on her face. SPENCER Emily?   Is everything alright? EMILY Why wouldn’t it be? She closes her locker.   Spencer shrugs as she watches Emily walk away. END OF ACT THREE  39.",
      "characters": [],
      "action_text": "ACT FOUR EXT. SPENCER’S PATIO - NIGHT On the warm summer night, Spencer, wearing a bikini that leaves little to the imagination, relaxes in the jacuzzi. She looks up when she hears - WREN (O.S.) Oh. Wren stands above her, naked except for his sexy, boxer-brief underwear. WREN I’ll come back. SPENCER It’s a big jacuzzi. He drops his towel and steps into the water. SPENCER I thought you guys were moving in next week. WREN Melissa thought we should get settled before classes start. She massages her shoulder. WREN Tough day at school? SPENCER Tough field hockey practice. WREN I rowed for Oxford. SPENCER That looks good on a Med School app. WREN I did it because I loved it. She massages her shoulder again.  40. WREN You probably have some fluid build up in your bursa sac. SPENCER I bet you say that to all the girls. WREN I can help. SPENCER Okay, Doctor Wren - He reaches over and massages her shoulder.   She relaxes into it. WREN Better, right? SPENCER Wow, that’s awesome. He massages a little deeper.   She releases a pleased moan. His hand reaches to the front of her shoulder.   Near her chest. MELISSA (O.S.) Wren? He immediately backs away from Spencer.   They both know how it looks.   Spencer climbs out of the jacuzzi.   She doesn’t say a word.   As Melissa approaches from the barn, Spencer slips inside the main house. INT. FIELDS HOUSE - STAIRWELL - DINING ROOM - EVENING Emily and her father, ROBERT, walk down the stairs together. A successful Rosewood dentist, Robert makes an effort to stay a part of his teenage daughter’s life. ROBERT How was practice? EMILY Fine. ROBERT Just fine? EMILY I beat Ben in the freestyle.  41. ROBERT That’s great. They sit at the dining room table. EMILY He’s totally mad at me. ROBERT Do you want me to talk to him? Pam carries in a platter of food. PAM Who? ROBERT Emily out-swam Ben today. PAM Not the best way to win a young man’s affections. As Pam serves dinner Robert secretly tosses Emily a “good work” thumbs up.   She smiles at him. ",
      "dialogue_count": 0,
      "word_count": 2600
    },
    {
      "scene_number": 4,
      "slugline": "EXT. STREET - NIGHT Aria walks away from her car, heading toward the scene.   She looks over towards the Hastings house.   She sees Spencer watching from her driveway. EXT. HASTINGS HOUSE - NIGHT Spencer, alone, watches the scene from her front lawn.   She glances over and sees Aria walking up the long drive. Surprising even herself, Spencer almost cries.   They silently take it all in. In the sea of strange faces, Aria sees Hanna standing with the crowd. ARIA I heard the cops took Hanna to the police station today. Spencer, with steel eyes, turns to Aria. SPENCER She’d never talk about - Hanna overhears them as she approaches from the driveway - HANNA - “The Jenna thing?” Startled, Spencer and Aria turn to her. HANNA We made a promise. INT. MARIN HOUSE - FAMILY ROOM - NIGHT The house is dark.   Only the light of the television illuminates the room.   Hanna is curled up on the sofa.   She eats ice cream from the container as she watches the news. ON TELEVISION: A reporter delivers her story. REPORTER Current owners of the residence were in the process of demolishing the structure to make room for a remodeling project when workers made the gruesome discovery.  55.",
      "characters": [],
      "action_text": "ON TELEVISION: We see footage of the coroner wheeling Alison’s body out of Maya’s backyard. REPORTER (V.O.) Parents of the deceased were unavailable for comment but a family spokesperson confirmed the gazebo was under construction the summer thirteen-year-old Alison DiLaurentis disappeared.   The family moved from Rosewood two years after their daughter went missing. ON TELEVISION: The reporter wraps up the piece. REPORTER Tonight they have asked for privacy as they come to terms with the sad ending of a three year old mystery. And local authorities are coming to terms with a killer at large in Rosewood. Hanna hears a THUD at the front door.   Startled, she quickly mutes the television. The front door knob RATTLES.   Hanna coils on the sofa.   A beat later the door opens.   In the darkness we see shadows push into the house.   Two people in a struggle.   They push into a beam of moonlight. Hanna finally realizes that it’s her mother as Ashley is shoved against the wall.   Then the other person moves into the light.   It’s Wilden.   He leans in and kisses Ashley.   She kisses him back. Ashley leads Wilden toward the bedroom.   Before closing the door, she notices Hanna.   Ashley gives Hanna a look that says, “I’m doing this for us.”   She closes the door. EXT. ROSEWOOD CHAPEL - DAY News vans line the street as a flood of PEOPLE make their way into the chapel. REPORTER The discovery of her body has rocked this community and today hundreds of mourners are saying goodbye to Alison DiLaurentis.  56. ANGLE ON - Emily and her parents approach the chapel.   The Hastings see the Fields’.   Rocked by the events, the parents embrace each other.   Emily and Spencer also hug hello. INT. ROSEWOOD CHAPEL - DAY The Montgomery’s walk into a crowded chapel.   It’s too much for Aria.   She turns to her mother. ARIA I think I need some air.   I’ll find you in a minute. ELLA Do you want me to come with you? ARIA I’m okay. Aria heads back to the entrance.   It is jammed with people walki",
      "dialogue_count": 0,
      "word_count": 1649
    }
  ]
}