{
  "slug": "prey-2022",
  "title": "prey",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 16,
  "characters_count": 0,
  "characters": [],
  "total_words": 19589,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. FOREST’S EDGE - DAY 5   5  Naru walks along the plain searching the foliage under the  scrubby cottonwood trees near the edge of the forest. Sarii  keeps pace at her side.  She stops at a cluster of purple flowers. Using the tomahawk  she deftly hacks the breadroot out of the ground. This is the  wrong the tool for the job but it keeps it interesting.  Naru places the root in her satchel and moves on.  She sees another breadroot and digs it out as well. Watching  her we see why Naru would rather be hunting. The gathering  process is boring and tedious.  Naru spots more purple flowers and moves closer to the edge  of the forest. Sarii lies in the grass watching as Naru digs  up the roots.  Naru drops a root into her satchel. She sets the bag down and  looks at the tomahawk in her hand.  She turns quickly and throws it. The tomahawk flips end over  end and --   THUNK   -- sticks into a tree trunk.  Naru walks to retrieve the tomahawk. We see the tree trunk is  scarred with dozens of HATCHET MARKS, this is where Naru  practices with her weapon.  She walks back to where she stood originally.  Facing away from the tree she pivots, throws sidearm -- the  hatchet slams into the tree at the exact same point, creating  a perfect X with the mark from the previous hit.  Naru pulls the hatchet and returns to digging for breadroot .  She stops suddenly. Studies the ground. Spots DEER TRACKS in  the dirt.  Naru looks at Sarii. He stands up. She gestures to him with  her chin and Sarii bounds into the woods to explore. She  follows, holding the tomahawk at the ready.  EXT. FOREST - DAY 6   6  Sarii moves quickly through the trees, on the scent of  something. Naru stays with him. Deep into the woods.  It’s darker here. The forest is dense. Naru looks back.  They’re far from home.  avpgalaxy.net",
      "characters": [],
      "action_text": "Naru pauses for a beat, considers heading back toward the  safety of more familiar land. But she’s on to something and  Sarii is going after it quickly.  Naru moves even farther into the woods.  avpgalaxy.net Sarii stops abruptly. Naru looks around. She spots it before  we do -- a large eight-prong BUCK grazing in the shade. The  deer is unaware it’s being watched.  Naru stays hidden. Downwind. She reaches for her bow --  damnit, it’s not there. She grips the tomahawk. Signals Sarii  to sit. Naru starts in. Quietly. Moving to within the  tomahawk’s range.  She creeps toward the deer.  Slowly.  A dozen yards out.  Presses against a tree.  She can hear the deer breathing. It doesn’t know she’s there  at all, let alone within striking distance.  Naru peers around the tree. Cocks her arm back, readying the  tomahawk.  Suddenly a BARN OWL sails out of the tree, SCREECHING.  The buck instantly bolts. Naru throws. The tomahawk slips  past the huge deer -- slicing off a tuft of hair.  Sarii leaps after the buck, barking.  Naru runs to her weapon. Yanks it out of the tree. Gives  chase following Sarii .  The dog races after the deer, the two animals bounding  between the trees ahead of Naru .  The dog lunges to catch the buck’s hind leg.  He misses. Leaps again.  When he comes down --   CLINKK   -- a metal SNAP.  Sarii freezes. Yelps in pain. The buck keeps going.  Naru arrives at her injured dog. She stops. Listens to the  sound the buck’s hooves receding on the forest floor.  Naru kneels by Sarii. His tail is pinched in the metal jaws  of a FUR TRAP. She examines the rusty steel device. Sarii  whimpers.  Naru spreads the jaws. The dog jumps free, turns and barks  angrily at the trap.  avpgalaxy.net Naru turns the small trap over in her hands. She yanks on it.  A long rusty chain is attached to one end. It wraps around a  tree. She tries to pull it free. The chain doesn’t give.  Naru pulls her knife and jams it into a chain link. She turns  the blade. The knife breaks. Damn",
      "dialogue_count": 0,
      "word_count": 2174
    },
    {
      "scene_number": 2,
      "slugline": "EXT. FOREST - DAY 10   10  The empty pine trees are dark and foreboding. The sounds of  the forest fill the air.  A man’s silhouette appears. It’s holding a weapon.  The figure steps out of the shadows. It’s Taabe. He’s  followed by Wasape and the others in the hunting party:  Huupi, Itsee, Tabu, and Paaka .  As they come into clearer view we see their faces are  painted. Each has their own distinct pattern made with red,  white and black clay.  Taabe’s is the most striking in appearance, it is ominous and  deadly looking -- a THICK WHITE BAND running ear to ear  across his face with a THIN BLACK SLIT intersecting each eye.  The group of Comanche walks in unison, quietly stalking.  OMITTED A10A   A10A  EXT. FOREST - DAY A10B   A10B  The hunting party continues through the forest on the other  side of the stream, undaunted by the threatening feel of the  woods.  There’s a rustling noise behind them. Taabe stops and turns.  The others hear it a moment later and turn as well.  Paaka draws back an arrow, Taabe grabs his hand. Paaka turns  to him, anger in his eyes. Taabe gestures for Paaka to look  in the direction he was about to fire, he does and Naru steps  out of the shadows.  She’s carrying her bow and wearing her own unique face paint  scheme -- hers is primarily black with a JAGGED RED OUTLINE.  NARU  You’re off the cat’s trail.  Taabe cocks his head.  Sarii comes out of the woods. He stops at Naru's feet and  stares back. Naru makes the sound --   TiCh-TiCh   -- Sarii  headsback in.  Taabe nods and starts after Sarii. Wasape stops him.  avpgalaxy.net",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 282
    },
    {
      "scene_number": 3,
      "slugline": "EXT. FOREST - DAY 10   10  The empty pine trees are dark and foreboding. The sounds of  the forest fill the air.  A man’s silhouette appears. It’s holding a weapon.  The figure steps out of the shadows. It’s Taabe. He’s  followed by Wasape and the others in the hunting party:  Huupi, Itsee, Tabu, and Paaka .  As they come into clearer view we see their faces are  painted. Each has their own distinct pattern made with red,  white and black clay.  Taabe’s is the most striking in appearance, it is ominous and  deadly looking -- a THICK WHITE BAND running ear to ear  across his face with a THIN BLACK SLIT intersecting each eye.  The group of Comanche walks in unison, quietly stalking.  EXT. FOREST STREAM - DAY A10A   A10A  The warriors crash through the river maintaining their  formation.  EXT. FOREST - DAY A10B   A10B  The hunting party continues through the forest on the other  side of the stream, undaunted by the threatening feel of the  woods.  There’s a rustling noise behind them. Taabe stops and turns.  The others hear it a moment later and turn as well.  Paaka draws back an arrow, Taabe grabs his hand. Paaka turns  to him, anger in his eyes. Taabe gestures for Paaka to look  in the direction he was about to fire, he does and Naru steps  out of the shadows.  She’s carrying her bow and wearing her own unique face paint  scheme -- hers is primarily black with a JAGGED RED OUTLINE.  PAAKA  You could get shot sneaking up like  that.  NARU  Who is sneaking up? I was loud  enough for an old man to hear.  avpgalaxy.net",
      "characters": [],
      "action_text": "Taabe smiles enjoying his sister’s chutzpah. Paaka gives her  a dirty look.  WASAPE  Why did you come? We won’t be gone  long enough to need a cook.  Paaka laughs. Naru looks like she’d love to shoot him. She  chokes back her anger and turns to Taabe.  NARU  You’re off the cat’s trail.  Taabe cocks his head.  Sarii comes out of the woods. He stops at Naru's feet and  stares back. Naru makes the sound --   TiCh-TiCh   -- Sarii heads  back in.  Taabe nods and starts after Sarii. Wasape stops him.  WASAPE  Hunting is men’s work. We’ll need  silence. Not woman’s chatter.  Paaka laughs. Taabe doesn’t.  TAABE  She should stay. She tracks well.  And if we find Puhi alive she knows  medicine.  avpgalaxy.net Wasape doesn’t like being challenged but he knows the others  respect Taabe. He nods, moves on. The others continue on as  well.  Naru looks down at Sarii. Taabe walks to her. Speaks so only  she can hear.  TAABE (CONT'D)  You have to find that cat now.  NARU  I will.  TAABE  I know.  (beat)  Because you have to.  OMMITED 10A   10A  EXT. FOREST - DAY 11   11  Taabe and Naru are on one side of the group, Wasape is on the  other.  They move with speed and grace. A deadly squad. Cruising over  the terrain with stealth and precision, a cohesive unit of  trained hunters.  Naru is watching as Sarii stops. Sniffs the ground. Taabe  catches sight of it too -- the dog found something. He’s  smelling a pile of animal DROPPINGS.  WASAPE  Oh good. Your dog found shit.  PAAKA  We’re not looking for wolves.  Taabe steps closer.  avpgalaxy.net TAABE  It’s not wolf. See the crushed  bone? That’s lion scat. It’s fresh.  And the cat that made it was big.  Naru scratches Sarii behind the ears. She reaches into her  satchel and pulls out a hunk of PEMMICAN (the Native American  version of MREs; highly portable food that doesn’t spoil).  Naru gives Sarii the food as a reward.  Naru examines the plants nearby. She shows Taabe who touches  them, then walks back to the others.  He shows Wasape ",
      "dialogue_count": 0,
      "word_count": 2953
    },
    {
      "scene_number": 4,
      "slugline": "INT. KEHETU’S   TIPI - NIGHT 21   21  Aruka and Naru are standing in the warchief’s tent. Sumu and  a few other camp ELDERS are there as well. Kehetu is still  lying on his buffalo skin mat.  Naru looks at her mother, fighting to hide her shame.  NARU  We got separated.  She stares at the elders, feeling the pressure of their  judgement.  NARU (CONT'D)  I made my way back alone.  The others look away. Kehetu turns to Aruka. With great  effort he manages to sit up.  KEHETU  He will return.  His words sound like hope, not fact.  NARU  How is Puhi ?  SUMU  The medicine you gave him kept him  alive.  GIRL (O.S.)  Auntie Sumu! Auntie Sumu!  The adults turn to look as the flap of the tipi opens. The  young girl steps in. Stops halfway. Stares at the elders.  She’s struck silent, surprised to see so many faces.  Kehetu looks at her. Gives the smallest of smiles.  KEHETU  What is it, little one?  The girl blurts her excitement.  GIRL  Come. Come see!  She runs back out of the tipi. The others follow.  avpgalaxy.net",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 184
    },
    {
      "scene_number": 5,
      "slugline": "EXT. NARU'S CAMP - NIGHT 22   22  The girl runs to the edge of the camp clearing and points out  into the plain.  With Wasape’s help, Kehetu walks out of the tipi. Joining  him, Naru and the others peer out to where she’s indicating.  In the far distance, a lone figure walks through the tall  grass toward them.  He’s carrying something large in his right hand. A bundle of  some sort. We can’t quite make it out.  Kehetu looks at the little girl. She smiles back at him. He  looks back into the field.  And now we can see. It’s Taabe. His body is soaked in blood.  As he moves closer we see -- the white band of paint on  Taabe’s face has been replaced with the blood of the lion .  In his right hand he grips the head of the beast -- the  evidence of his successful hunt. The huge animal’s pelt is  draped over his shoulders. The rest of the lion is dragging  behind him on a makeshift travois bound to Taabe’s waist.  Kehetu looks at Wasape, then to Sumu. Sumu nods, she stares  at her son, he looks away.  Taabe lays the hunting trophy at Kehetu’s feet.  As more of the Comanche learn of Taabe’s achievement they  come running. The young men get as close as they can, women  watch from nearby.  Kehetu puts his hands on Taabe’s shoulders. Stares into  Taabe’s eyes.  EXT. NARU'S CAMP - LATER 23   23  An enormous BONFIRE is burning outside Kehetu’s   tipi. Its  light flickers on the faces of the Comanche in the camp.  A member of the band plays a HAND DRUM while SINGING softly.  Naru stands alone, observing from a small, self-imposed  distance.  Kehetu is at the front of the crowd, he’s holding a carved  STAFF, gripping it tightly to help hold himself up.  avpgalaxy.net",
      "characters": [],
      "action_text": "The entire camp watches as Kehetu gestures for Taabe to step  forward and join him at the edge of the fire.  Naru looks to the fire. She watches Taabe walk to Kehetu. The  warchief hands the carved staff to Taabe who turns back to  face the camp holding it.  The other young men all step forward. They raise their arms  and let out loud WAR CRIES.  Taabe smiles back in appreciation. He notices that Wasape is  not celebrating. His eyes harden slightly.  Sumu nudges Wasape. He lets out a big WAR CRY.  The rest of the crowd joins in. The women LULU loudly.  Taabe basks in the moment. This is his coronation. He looks  at the beaming faces around him.  Kehetu holds up a hand to silence them.  KEHETU  A new leader stands before us. We  honor him. But remember, one alone  does little. We each have a job to  do.   (looking at Wasape )  We don’t always choose our role.  Some follow, some lead. But to  survive we must all do our part.  The old warchief stares into his son’s eyes. Wasape nods his  acceptance.  KEHETU (CONT'D)  There is honor in all our work.  The warchief is speaking to his son but we see how his words  affect Naru .  Kehetu raises Taabe’s arm. The crowd erupts again. The old  warchief rests his hand on Taabe’s shoulder. Looks into his  eyes. Then heads back to his tipi .  Naru watches the other young men surround her brother. She  stares for a loaded beat. Then cuts through the crowd,  heading back to her tipi .  Taabe looks past the men surrounding him. Sees his sister  walking away.  He rushes forward to meet her.  avpgalaxy.net TAABE  I did it, Naru .  Naru stops.  They stand alone together for a moment. Taabe is beaming. He  gives his sister a wide smile. Then sees the apprehensive  look on her face.  TAABE (CONT'D (CONT’D )  I was young when our father died.  You taught me how to hunt. And  fight. Raised me to where I am. And  I’m grateful, pâtsí. Forever.  (beat)  Because of you I am ready for this.  Naru looks at him. Shakes her head.  NARU  Something sc",
      "dialogue_count": 0,
      "word_count": 997
    },
    {
      "scene_number": 6,
      "slugline": "EXT. OUTSKIRTS OF NARU'S CAMP - DAWN 25   25  Naru looks at the half-dozen other young Comanche WOMEN  heading to do their chores. Among them is a YOUNG MOTHER, her  BABY strapped to her back.  The young girl who announced Taabe’s return exits her tipi  rubbing sleep from her eyes and begins her chores as well.  They are all headed in the same direction. Walking toward the  river.  Naru watches for a beat. Then she stops.  INT. NARU'S   TIPI - DAWN 26   26  Naru enters. Drops the empty bag back by the fire. Grabs her  bow. Quickly and silently packs up her gear.  Sleeping by the door, Sarii cracks an eye as Naru exits. He  springs to his feet and follows her out.  OMITTED 26A   26A  EXT. NARU'S CAMP - DAWN 26B   26B  As the woman of the camp all head to do their chores, Naru  walks in the opposite direction, followed by Sarii .  MONTAGE -- VARIOUS WOODED AREAS - DAY 26C   26C  Naru and Sarii walk along a creek.  They continue through the wildness, beginning their journey.  EXT. PRAIRIE’S EDGE - DAY 27   27  Naru and Sarii move along the edge of the FOREST.  They walk.  And walk.  Naru comes through the tree line and is able to see into a  vast, open plain.  avpgalaxy.net",
      "characters": [],
      "action_text": "Small red MOUNDS dot the landscape. A curious expression  comes across Naru's face.  EXT. PRAIRIE - LATER 28   28  As Naru and Sarii get closer we see what the mounds are -  skinned BUFFALO CARCASSES. Dozens of them litter the plain.  Naru looks out at the rotting remains. No Comanche would  perpetrate this type of slaughter.  Looking closer she spots a BULLET HOLE in the SKULL of the  animal before her. Naru examines it closely -- the wound is  nothing like any she’s seen before.  She kneels and places her palm between the horns. Closes her  eyes and incants a small, quiet prayer.  Naru stands, a look of disgust and outrage flooding her face.  She walks to a charred spot in the grass. Evidence of a  smallcampfire. Naru feels the embers, she puts her hand right  in, they are long cold.  Scanning the ground she spots something -- the chewed BUTT of  a rough-hewn CIGAR. Naru picks it up, sniffs it, makes a sour  face, tosses it away.  NARU  We’re going to find whatever it is  out there.  She looks down at Sarii .  NARU (CONT'D)  And we’re gonna kill it.  OMITTED 29   29  EXT. FOREST - DAY 30   30  There’s movement in the trees above. A limb creaks under the  weight of something heavy.  The Predator’s big feet splash down into the creek we saw  Naru pass as she headed out.  From behind the alien we see him studying the ground. He  spots Naru and Sarii’s tracks.  avpgalaxy.net OMITTED 31   31  OMITTED 32   32  EXT. PINE GROVE - LATER 32A   32A  A COTTONTAIL pops its head up out of a broken stump, sniffs  the air, eats a fallen berry.  SHUNNKK   -- Naru’s tomahawk slams into the stump -- a half *  second too late. The rabbit is gone.  As Naru goes to retrieve her weapon a second rabbit scurries  across the leaf-covered ground right in front of her. Damn.  She dives to grab the tomahawk, pivots and hucks it at the  rabbit -- a shortstop turning a double play. The hatchet  skips off the ground, and just barely misses the second  cottontail.  Sarii looks on as Naru sits in ",
      "dialogue_count": 0,
      "word_count": 2893
    },
    {
      "scene_number": 7,
      "slugline": "EXT. RIVER BEYOND RAPIDS - DAY 58   58  The water is more mellow here. Naru's head pops up above the  waterline. She inhales deeply. Swims towards the bank.  EXT. RIVER BANK - LATER 59   59  All of Naru’s   warpaint has washed off. She wrings the water  out of a soggy leather boot. Slips it back on and steps into  the woods.  EXT. FOREST TRAIL - DAY 60   60  Naru walks stealthily. The light that filters through the  tree tops is dappled and diffuse. Creepy.  Still wet from the river, she squeezes water from her braids.  A noise to her side -- a branch SNAPPING.  Naru draws her tomahawk. Moves in.  She sees Itsee aiming his bow back at her.  NARU  What are you doing here?  Itsee lowers his bow. Wasape steps out of trees with Huupi,  and ANIA [”Ahneeah”](21).  WASAPE  Looking for you. Your brother sent  us to bring you home.  NARU  That’s a waste of time.  WASAPE  (mean smile)  I agree. But he’s warchief now.  NARU  Where is he?  WASAPE  Searching for you on the other side  of the pass.  Naru starts to walk away.  avpgalaxy.net",
      "characters": [],
      "action_text": "WASAPE  Where are you going?  Itsee moves in front of her. Naru stops. Turns to Wasape.  NARU  I saw it.  WASAPE  Saw what?  NARU  The beast that made the track in  the camp. The one that drove the  lion off.  WASAPE  The bear?  NARU  A bear. And another. Something  huge.  WASAPE  What?  Naru struggles to find words to describe the Predator.  NARU  It was invisible. But when it  killed the bear its body showed in  the blood. It was a ... I don’t  know ...  (goes for it)  A moopits .  There’s silence for a beat. Then Wasape breaks into a loud  laugh. The others join in.  WASAPE  You saw a monster from a children’s  story?  The warriors give Naru incredulous looks.  NARU  It fought the bear with just its  hands. Killed it easily.  Wasape shakes his head.  WASAPE  Enough. We’re not safe here. There  are real dangers.  (MORE)  avpgalaxy.net Not just demons from stories that  frighten little girls.  He walks to Naru and grabs her arm.  WASAPE (CONT'D)  We’re going home now. Don’t worry,  I’ll tuck you in if you have any  more bad dreams.  Naru jerks her arm free, draws her tomahawk and glares at  him. Wasape gives her a big, dumb smile -- I dare you.  Naru slowly lowers the weapon. Starts to walk again.  NARU  I’m going to finish my hunt.  Wasape steps in front of her.  WASAPE  Hunting what? A monster? I don’t  know what you saw. But even if it  is real, you tried this already  with the lion. You ran.  Naru's face falls. Wasape nods knowingly, enjoying this.  WASAPE (CONT'D)  Your brother told me.  (beat)  It's time to come home.  Naru looks into Wasape’s eyes. She screws up her courage --  she is not   going to back down.  NARU  I saw it. And I am going to finish  my hunt.  She looks past the big man, into the faces of the other  warriors.  NARU (CONT'D)  Would you leave a hunt?  They stare back in silence, unable to answer.  Naru turns away and starts back on the trail.  Wasape rushes forward and blocks her way again.  WASAPE  We’re going back to the camp.  WASAPE   (C",
      "dialogue_count": 0,
      "word_count": 842
    },
    {
      "scene_number": 8,
      "slugline": "EXT. FOREST, NEARBY - SAME 61   61  Perched on the branch of a tall tree, the blurred outline of  the Predator appears. He stops. Looks down at the Comanche  below.  In Predator vision he scans the warriors. Zooms in on Wasape.  EXT. FOREST TRAIL - DAY 62   62  Wasape rubs the bite mark on his arm. Glares at Naru .  WASAPE  Fine. You want to leave, go.  Naru looks at him for a beat. Licks her split lip and spits.  Then she lowers her fists.  The instant she does, Wasape springs forward and hammers a  right cross directly into her jaw.  Naru drops, woozy. Before she can recover, Wasape grabs her.  Bends her arms back. Binds her wrists with a leather strap.  EXT. FOREST, NEARBY - SAME 63   63  The Predator watches Wasape haul Naru up to her feet where  she stands on shaky legs. Wasape shoves her forward, Itsee  grabs her arm.  EXT. FOREST TRAIL - DAY 64   64  Wasape leads Naru to sit with her back against a downed tree  trunk. Itsee gives him a look.  WASAPE  You like being bit? She fights like  a man, she can fall like a man.  Wasape checks the bite mark on his arm. Gives Naru a dirty  look. He reaches down and takes Naru’s tomahawk. He examines  the customized weapon, a derisive smile on his face.  WASAPE (CONT'D)  You need a leash so you don’t lose  it?  Naru doesn’t give him the satisfaction of a response. Wasape  tucks the hatchet in his belt then grabs her water and  empties it over the bite mark.  avpgalaxy.net",
      "characters": [],
      "action_text": "WASAPE (CONT'D)  We rest a minute, then head back.  Staying together.  ITSEE  What about Taabe?  avpgalaxy.net WASAPE  He’ll meet us at the camp.  Itsee steps into the woods. Wasape shoots him a look.  WASAPE (CONT'D)  I said stay together.  ITSEE  I’m going to take a crap. You want  me to do it here?  Wasape lets him go. Then turns to Huupi .  WASAPE  (demanding)  Water.  Huupi gives Wasape a defiant look but tosses him his canteen.  Wasape drinks.  EXT. DEEP FOREST - DAY 65   65  Itsee adjusts his breechcloth and kicks a pile of leaves over  the small hole he just used.  As he walks back toward camp he pulls leaves off a bush, rubs  them briskly between his palms and tosses them aside.  Continuing, he slows. A funny look comes across his face. He  stops. Turns slowly.  Itsee stands silent in the forest, listening.  The sound of BRANCHES moving.  Itsee stares up at the trees, a terrified look on his face.  EXT. DEEP FOREST TRAIL - DAY 66   66  Naru flexes her jaw while peering up at Wasape. She checks  her surroundings. The other warriors are packing up to move  on.  Naru starts to get up. She’s unsteady on her feet. Uses the  log for balance as she rises.  WASAPE  You don’t need to get up.  Naru continues to get to her feet. Wasape puts his hand on  her shoulder and firmly pushes her back down against the log.  avpgalaxy.net WASAPE (CONT'D)  Just sit.  Naru slips back to the ground. Wasape touches his lip where  it’s split from his fight with Naru. He reaches down and  tears her medicine pouch off her necklace.  Naru strains to get up -- then stops suddenly and listens.  There’s a rustling in the woods. Something moving.  Naru snaps into action -- she instantly ducks down beside the  log.  The other Comanche warriors look nervously to Wasape for what  to do. He just stands still, watching Naru .  The sound gets closer -- and suddenly -- a family of POSSUMS  scurries through the camp.  Ania shoots one of the possums with his bow.  Wasape breaks into a fit of laught",
      "dialogue_count": 0,
      "word_count": 4285
    },
    {
      "scene_number": 9,
      "slugline": "EXT. BURNT GLADE - DAWN 77   77  Trapper #8 squares off against the Predator. He pulls a long  KNIFE.  The Predator looks at the man. Then to his own hand which is  still encased in a trap. He smashes the trap against a tree --  catches the heavy metal device as it opens -- throws it full  force into Trapper #8’s face, killing him.  Two bullets slam into the Predator’s back, drawing green  blood and knocking him forward.  He turns -- and unfolds his spiral metal SHIELD -- it unfurls  on his arm like a Japanese fan forming a circle.  As he turns to face three more trappers, their bullets  bouncing off the alien metal shield.  EXT. BURNT GLADE, NARU'S TREE - DAWN 78   78  Naru manages to hook her ankle around the chain leading to  the bear trap. Her movement pulls hard on Taabe’s arms. He  grunts in pain.  TAABE  What are you doing?  Naru's voice is strained by the effort she’s putting in to  drawing the trap closer.  NARU  Do you remember the flood when we  were young?  Taabe shifts as she pulls the trap closer.  NARU (CONT'D)  The water came fast. The river  swept everything downstream.  She reaches farther.  NARU (CONT'D)  I saw a beaver with it’s leg pinned  between two rocks.  EXT. BURNT GLADE - DAWN 79   79  Raphael hides behind a tree, reloading his flintlock PISTOL  as the Predator advances on the other trappers.  avpgalaxy.net",
      "characters": [],
      "action_text": "The Predator unfolds his shield. Snaps out his wrist blades.  Trapper #9 advances wielding his musket like a club. The  Predator cuts right through him -- Trapper #10 charges -- the  Predator back hands him -- sending Trapper #10 crashing hard  into a tree.  Raphael fires into the Predator’s back.  He turns -- throws a cut clamp -- it hits Raphael in the  thigh -- severing his leg.  avpgalaxy.net Trapper #11 swings his musket at the Predator -- he closes  his hand around Trapper #11’s throat -- chokes him against a  tree.  As Trapper #11 reaches for a knife in his boot, Trapper #12  attacks from the Predator’s side -- swings a HATCHET down --  hits the Predator’s gauntlet -- the Predator grabs the  HATCHET -- spins it end over end -- catches it by the handle -  - slams it into Trapper #12.  Still being choked, Trapper #11 grabs his knife -- but before  he can use it the Predator unfurls his folding shield --  decapitating Trapper #11.  Trapper #13 approaches from behind, loading his MUSKET -- he  raises the weapon and fires, point blank, into the Predator’s  face -- the bullet ricochets off the Predator’s mask and  slams back through Trapper #13’s skull.  EXT. OTHER SIDE OF THE BURNT GLADE - DAWN 80   80  A line of TRAPPERS aim their muskets at the Predator. Big  Beard stands among them.  BIG BEARD  Fire!  WAX MUSTACHE  We’ll hit the others!?  BIG BEARD  FIRE!!!  EXT. BURNT GLADE, NARU'S TREE - DAWN 81   81  A hail of bullets sail past Naru -- piercing the trees around  her and striking the trunk she and Taabe are bound to.  EXT. BURNT GLADE - DAWN 82   82  The Predator turns -- uses his shield to block the volley of  shots coming from the other side of the glade.  EXT. BURNT GLADE, NARU'S TREE - DAWN 83   83  She looks down. Finally has the trap close enough that she  can use it.  NARU  The water kept rising.  avpgalaxy.net Naru bends down.  NARU (CONT'D)  The beaver knew it would drown.  She picks up a rock. Holds it over the trap.  NARU (CONT'D)  So it chewed off",
      "dialogue_count": 0,
      "word_count": 709
    },
    {
      "scene_number": 10,
      "slugline": "EXT. BURNT GLADE - DAWN 84   84  The Predator leaps from tree to tree, flying through the  burnt glade.  He passes Naru and Taabe as they stand, finally able to free  themselves from the tree.  EXT. BURNT GLADE, NARU'S TREE - DAWN 85   85  Taabe looks to the far side of the glade where the horses  ran.  TAABE  I need a horse.  Naru nods. Looks up at the trappers’ camp.  NARU  I’ll get Sarii .  Taabe nods. They head off in opposite directions.  avpgalaxy.net",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 85
    },
    {
      "scene_number": 11,
      "slugline": "EXT. BURNT GLADE - DAWN 86   86  The trappers fire up into the trees as the Predator sails by  overhead.  They stand in a cluster, aiming and missing.  An   ELECTRONIC BEEPING   draws their attention.  Trapper #14 turns to find the source of the strange sound.  The Predator’s gauntlet lies in the dirt at their feet.  Its display counting down in an strange glyph.  It reaches zero.  The gauntlet opens.  Three sharp DISKS rise up out of the device.  They spin, hovering at neck height.  EXT. FUR TRAPPERS’ CAMP - DAY 87   87  From above the glade we see LASERS cut through the fog -- the  Predator’s gauntlet weapon dispatching the trappers.  Naru steps into the camp.  She spots her satchel near a crate by the campfire. Moving  closer, she stays hidden.  The remaining trappers peer nervously toward the scene of the  fight.  TRAPPER #17  Do they need our help?  Trapper #15 shakes his head.  TRAPPER #18  They’re beyond our help. I say we  go.  Trapper #14 looks back toward the battle. Nods agreement.  TRAPPER #17  What about the dog?  TRAPPER #18  I like dog. It tastes better than  beaver.  avpgalaxy.net",
      "characters": [],
      "action_text": "Trapper #17 smiles and pulls his KNIFE. Walks toward Sarii .  Naru jumps out. In one move, she scoops up a small PELT -  reaches into the fire with it -- throws a handful of embers  into the man’s face.  As he bellows in pain she grabs his arm, redirects his wrist -  - shoves the knife into his thigh. He drops.  Trapper #18 draws his knife. Naru looks at her satchel on the  crate right behind him.  She charges -- uses the pelt to grab the hot PAN out of the  fire -- slams it into Trapper #18. He drops but begins to  rise again.  A BULLET blasts into a tree near Naru .  Trapper #19 quickly reloads.  Naru pulls her tomahawk out of her satchel -- dispatches  Trapper #18 just as he is about to stab her -- throws the  tomahawk into Trapper #19 just in time -- he fires upward as  he drops dead.  Trapper #17 pulls his knife from his thigh, moves toward  Naru .  Naru yanks her tomahawk back -- but it comes back too fast,  she fails to catch it.  Trapper #17 gives an evil grin, charges -- Naru grabs Trapper  # 18’s knife -- throws it into Trapper #17’s other thigh -- he  leans forward -- Naru dives between his legs, grabbing the  knife back.  Trapper #17 spins to face her -- Naru stabs through his hand -  - he drops his knife -- she catches it and stabs him in the  face.  Naru looks around. She’s alone now. She walks to Sarii. Cuts  him free. The dog licks her face. She points --   TiCh-TiCh .  NARU  Find Taabe.  Sarii runs off, following her order.  EXT. BURNT GLADE - SAME87A   87A 87A   87A  Dead trappers lay strewn about the clearing floor.  avpgalaxy.net The Predator is sitting propped up against a tree. He opens  his rucksack. Removes a CYLINDRICAL container. Presses the  container against a bullet hole in his chest. A liquid alloy  spreads out like liquid mercury -- sealing the wound.  EXT. FUR TRAPPERS’ CAMP - DAY 87B   87B  Naru looks at the trappers’ gear. She empties a canteen of  water onto her wounded leg. Drinks a second one down in a few  gulps. She spots a coi",
      "dialogue_count": 0,
      "word_count": 1284
    },
    {
      "scene_number": 12,
      "slugline": "EXT. FUR TRAPPERS’ CAMP - SAME 92   92  The Predator walks toward where Raphael cowers, shivering and  terrified.  The Predator gets closer. And closer.  Then walks right by him -- it’s as if he can’t see the man .  EXT. TREES BY THE GLADE - SAME 93   93  Naru watches the Predator. He stops near Raphael, she looks  confused. Why isn’t he killing the trapper?  Seeing Raphael shivering against the cold -- Naru figures it  out -- the medicine she gave him has rendered Raphael  invisible to the Predator.  She opens her pouch and looks at the orange flower petals,  then back at the Predator, he’s standing right next to the  trapper yet unable to see him!  EXT. FUR TRAPPERS’ CAMP - SAME 94   94  Delirious with terror, Raphael holds still.  The alien takes a step back. Examines a pool of blood on the  ground right by Raphael.  He takes another step -- his foot comes down on Raphael’s  knee -- the man yells out in pain.  The Predator tilts his head -- confused.  He snaps out his wrist blades. Puts them through Raphael’s  skull.  EXT. TREES BY THE GLADE - SAME 95   95  Naru slowly backs away. She hears a rustling.  The Predator hears it too. He scans the woods. Sees a blur of  movement. Aims his crossbow.  He walks back toward the burnt glade. Scanning.  Still can’t get a lock on his target.  Then suddenly, Sarii charges out of the forest, barking.  The Predator turns. Aims his lasers at the dog. Fires.  avpgalaxy.net",
      "characters": [],
      "action_text": "As the arrows launch -- the thunderous sound of HOOVES -  Taabe charges into the glade on horseback   --   SMAAKK   -- hits  the side of the Predator’s head with the combistick -- a  direct blow -- Mark McGwire crushing a fastball.  The Predator’s helmet is knocked off -- it falls to the dirt.  With the helmet on the ground, its lasers, the target  guidance system -- now point away from Sarii .  Naru follows the line of the three red lasers -- they’re now  aimed at the base of a nearby tree.  She watches closely as the Predator’s arrows sail around,  adjusting their aim to the new target point, then slam  harmlessly into the base of the tree.  As they hit, Sarii makes it through the clearing.  Naru studies the Predator’s arrows lodged in the tree -- the  lasers from his helmet still shine on the aim points.  Naru looks up. Taabe steers the horse into the camp -- grabs  his bow and quiver -- turns the horse back -- rides straight  at the Predator, firing .  His aim is true -- but the arrows bounce off of the  Predator’s shield -- as Taabe nears, he drops his bow --  lifts the combistick -- prepares to smash the alien again.  The hooves stomp -- Taabe is almost to him -- at the last  second, he leaps off the horse, drives the combistick,  through the Predator’s shoulder.  The alien lets out an angry snarl, grabs the front half of  the combistick, allows the second half to drop, catches it  and moves in, enticed by the prospect of hand-to-hand combat.  As the two circle, the fight is glaringly one-sided -- but  there’s a fearsome look of determination on Taabe’s face.  They close and begin to battle, parrying back and forth.  As Taabe attacks, the Predator cloaks.  Taabe holds his bow, arrow nocked, ready to fire. He scans  for the Predator.  Naru approaches. She shoves the flintlock pistol back in her  belt. Draws her tomahawk as she walks to Taabe.  NARU  Let’s go.  avpgalaxy.net Taabe continues to search for his foe.  TAABE  No, I’ve got this, Naru.  Naru takes a st",
      "dialogue_count": 0,
      "word_count": 720
    },
    {
      "scene_number": 13,
      "slugline": "EXT. FOREST HILL - DAY 95A   95A  Naru runs down the hill.  She moves as fast as she can on her wounded leg. The effort  to keep going is painful. She’s drenched in perspiration.  avpgalaxy.net",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 36
    },
    {
      "scene_number": 14,
      "slugline": "EXT. DEEP FOREST STREAM - DAY 96   96  Naru runs as fast as she can on her wounded leg. The effort  to keep moving is painful. She’s drenched in perspiration.  She crosses the stream then traverses the opposing bank which  is covered in tangled tree roots.  As she climbs up the ridge her injured leg gives out. Naru  crashes to the ground. And lies there.  Sarii pops out of the woods behind her. He runs through the  stream to Naru and licks her face. Naru pushes herself up and  sits.  Naru pulls her leg up toward her body and checks her wounds.  Reaching down toward the stream she tears out a handful of  wet moss.  She crawls toward a deep pocket where the tree’s root  structure bends over the bank of the stream -- a dark nook,  concealed from view.  Naru nestles herself inside, folding her body to fit in the  natural alcove. Sarii climbs in after her.  She pulls her pouch and removes some herbs.  Naru mixes the other herbs in with the moss and packs the  wounds on her leg. It’s painful work but she steadies her  hands. Soldiers through.  When she’s done she leans back in the tree. Rests.  EXT. NARU’S CAMP - DUSK 97   97  Aruka stands outside alone. She’s working a HIDE; scraping  and stretching the animal skin.  The sound of HOOVES galloping.  Tabu and another SCOUT ride up to the camp. Aruka stares as  they hop off their HORSES.  Tabu looks to the scout. Gestures with his head toward  Kehetu’s   tipi and the man heads in that direction.  Aruka watches intently as Tabu approaches her, He’s nervous.  ARUKA  Tell me.  avpgalaxy.net",
      "characters": [],
      "action_text": "TABU  There was a large battle in the  glade. Many dead men. Most were  white.  (holds a painful beat)  But Taabe was among them.  Aruka’s face floods with grief. She holds it back. Steadies  herself. Soldiers through.  ARUKA  Naru ?  Tabu shakes his head.  TABU  We’ve found nothing yet.  EXT. DEEP FOREST STREAM - DUSK 98   98  Naru rests in the tree. She hears FOOTSTEPS approaching.  Shifts in the nook. Pulls the flintlock pistol and peers out  with one eye.  The footsteps get closer. Big Beard steps into view. He looks  nervous, rattled. Keeps looking back over his shoulder.  He walks down to the bank of the stream. Stops. Bends to wash  his face in the water. Begins to fill his leather CANTEEN.  Naru aims the pistol at his head. Holds for a beat. Thinking.  She looks at Sari. Leans down close to the dog.  NARU  Home, Sarii, now.  She signals --   TiCh-TiCh   -- But Sarii doesn’t move. Naru  glares at him.  NARU (CONT'D)  I do this alone.  Sarii stares at her another beat. Then follows Naru’s order.  Naru puts the flintlock pistol in her belt. Pulls her  medicine pouch. Opening it, she sorts out the bright orange  flower petals that we saw her give Puhi and Raphael earlier.  She looks at the orange petals in her palm. It’s a huge dose.  Naru mixes in the mushrooms. Then swallows it all.  avpgalaxy.net Her muscles instantly convulse. Gritting her teeth, Naru  reaches into her satchel and pulls something out.  As Naru returns her focus to Big Beard standing in the stream  we see what she’s holding -- the Predator’s cut clamp unfurls  in her hand .  EXT. CLEARING IN THE WOODS - NIGHT 99   99  Snow drifts down from above.  Big Beard is lying on the ground on his back. Sweat on his  forehead glistens in the light of a large BONFIRE burning  nearby.  A RAT scurries by. Then another.  The big man’s eyes pops open. He looks down at his leg -- the  lower half of the limb is gone   -- three RATS gnaw at the  savage wound. With a SCREAM he slaps them away.  He draws his leg ",
      "dialogue_count": 0,
      "word_count": 1091
    },
    {
      "scene_number": 15,
      "slugline": "EXT. FOREST FLOOR - NIGHT 103   103  The Predator scans the forest floor in the direction Naru  continued on. Spots a blood trail.  The Predator moves on, following the trail. It leads around a  bend in the path.  A thick growth of plants. The Predator pushes through.  EXT. CLEARING INSIDE THE NATURAL HEDGE - NIGHT 104   104  Pausing, he surveys the area ahead. Sees something odd on the  ground. He moves toward it.  And now we see where Naru has led him -- the moss above the  sinkhole.  In the center of the moss is Big Beard’s leg .  The Predator studies the severed limb from afar.  But the Predator is cagey. He stops at the edge, peers down,  recognizing what may be a trap.  EXT. TREE - NIGHT 105   105  Up on a branch, Naru looks down at the Predator’s back. Waits  for him to step forward. He doesn’t. So she leaps down --  EXT. CLEARING INSIDE THE NATURAL HEDGE - CONTINUOUS 106   106  Naru’s crashes down on to the Predator’s back -- the alien  staggers forward -- but just manages to avoid stepping into  the mud pit!  Naru slams to the ground behind him.  As the Predator turns she draws her tomahawk --  They battle hand-to-hand .  avpgalaxy.net",
      "characters": [],
      "action_text": "The Predator using his strength and experience.  Naru using her wit and sheer force of will.  Along with everything she’s learned watching the Predator.  His weapons and techniques.  Sarii returns from the woods to help.  The dog’s ferocious loyalty allows Naru an important moment  in the battle.  But then he is endangered.  And she must help.  During the fight, Naru leads the Predator into position in  the pit.  He sinks. Deeper and deeper.  Then stops, waist deep.  Unfazed, the Predator draws his crossbolt .  Aims it dead at Naru. The weapon activates -- its sharp,  lethal blades shine in the light.  Naru stares right into the weapon. One pull of the trigger  and she’s dead.  But Naru does not move. She holds her ground. Naru speaks  quietly to herself.  NARU  My feet are roots.  Naru glares defiantly down the barrel of the alien weapon.  The Predator fires. The bolts sail out toward Naru .  But Naru doesn’t flinch.  She stares the Predator dead in the eye. Then looks to his  side.  There, propped between two rocks -- his helmet -- the  Predator is right in position where she wanted him.  The red laser sights are pointing directly at him   -- Naru set  him up -- used his own targeting system against him.  avpgalaxy.net The arrows sail up in a loop -- they pass Naru -- and whip  back down -- where they slam home -- into the Predator .  The Predator gasps. Chokes. Coughs green blood out of his  pierced lungs.  Falls backward.  Dead.  Naru stands. Retrieves her tomahawk.  Walks to the Predator.  Grabs a handful of dreadlocks -- pulls his head back exposing  his neck -- lifts the hatchet.  As she brings the weapon down to strike we --  CUT TO:  INT. WARCHIEF   KEHETU’S   TIPI - MORNING 107   107  Kehetu sits by the fire. Sumu is beside him holding his hand.  The old warchief coughs. He struggles to get up and walk to  the stew pot. It’s difficult. His old knees are tired.  Sumu helps him sit back down. Brings him the stew.  She looks at her husband. It pains her to sa",
      "dialogue_count": 0,
      "word_count": 631
    },
    {
      "scene_number": 16,
      "slugline": "EXT. NARU'S CAMP - DAY 108   108  Sumu and the Elders stare out into the tall grass. The rest  of the tribe quickly gathers behind them.  Sumu gestures and a young Comanche MAN goes into her tipi. He  returns a moment later helping Kehetu along. Aruka makes her  way up to join them. She has a fresh CUT LINE on her  shoulder.  As Kehetu is led to the front of the crowd he squints into  the distance.  A lone figure moves through the tall grass toward them.  (page 84A )  avpgalaxy.net",
      "characters": [],
      "action_text": "It’s Naru. Her body is soaked in green blood.  Her face is painted in her own style using the Predator’s  fluorescent green blood.  The Comanche in the camp look on in awe as Naru, with Sarii  at her side, walks toward them.  Aruka stares in stunned silence. As Naru gets close, she  rushes to her.  They embrace. Each has a fresh CUT LINE on their shoulder.  The others gape at what Naru's holding. Marveling at her  accomplishment as a hunter.  They stare in fascination at the head of the Predator.  Naru's prey.  Naru walks to Kehetu. She lays the alien’s head at his feet.  The old warchief looks at the Predator’s face.  Naru pulls the flintlock pistol from her belt. Hands it to  Kehetu. He regards the foreign weapon, then sets it down.  Then he turns back to Naru, studying her.  NARU  There’s danger nearby. We should  move to more easily protected  ground.  The old warchief stares at her. Sees something he missed  before.  Mirroring his actions when Taabe returned with the mountain  lion, Kehetu puts his hands on Naru's shoulders. Stares  deeply into her eyes.  Kehetu hobbles back to his tipi. The crowd watches, silent  now.  The warchief returns. He’s carrying the carved staff he gave  to Taabe. He leans forward. Takes Naru by the hands. He  presses the staff into her palms. Walks back to his tipi .  Naru looks into the crowd. But unlike Taabe, she’s not  basking in the glory of adulation. Naru's expression is  pensive as she contemplates the enormity of the battles to  come.  avpgalaxy.net Naru looks down at the staff. Then she looks to her mother.  Aruka looks back, her face a mix of sadness, fear, pride, and  then reverence .  Naru looks into the crowd. She spots the face of the little  Comanche girl. She’s standing in the grass, holding a bag for  collecting wood.  The girl sets her bag down.  Looks up with pride.  Smiles at the new warchief.  THE END  avpgalaxy.net",
      "dialogue_count": 0,
      "word_count": 423
    }
  ]
}