{
  "slug": "priscilla-2023",
  "title": "priscilla",
  "genre": "romance",
  "format": "film",
  "scenes_count": 21,
  "characters_count": 2,
  "characters": [
    "PRISCILLA",
    "ELVIS"
  ],
  "total_words": 14475,
  "total_dialogue": 2,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. GRACELAND - DAY Close on a young girl's feet, with perfect candy red polish, walking over pink shag carpet. Her feet sink into the plush shag with every step. CUT TO: EXTREME CLOSE UPS on: Black liquid eyeliner being carefully applied. Jet black hair being teased, a cloud of hairspray, Fingernails being painted coral, MAIN TITLE in cursive appears over satin: PRISCILLA Titles continue, intercut with e xtreme close ups, fragments of teenage Priscilla and Graceland. CUT TO: EXT. EAGLE'S CLUB - DAY Reflections off the window of the 50's style American club. Some soldiers outside. Title: US Army base, West Germany, 1959 INT. EAGLE'S CLUB - DAY “Venus” by Frankie Avalon plays on the jukebox as we move in on a soda shop counter where PRISCILLA, 14, with her back to us, sits on her own, doing homework. A man   in uniform approaches. Priscilla slowly turns- Close on the pretty fresh-faced brunette as she looks shyly over her shoulder up at the man staring at her. She's dressed like a typical ‘50s teen girl in ankle socks and saddle shoes. The man, TERRY, handsome in a uniform, late 20s, has a friendly smile.",
      "characters": [],
      "action_text": "TERRY Hi. I'm Terry West, what's your name? She looks up from her milkshake at him suspiciously. PRISCILLA Priscilla Beaulieu. TERRY I see you coming here a lot, is your family stationed here? PRISCILLA Yes. TERRY Where are you from? PRISCILLA Uh Texas... my dad just transferred here in August. TERRY That so? Well, how do you like Germany? She shrugs. TERRY   (CONT’D) I book the entertainment here. My wife plays here som etimes. She's not comfortable making conversation, she's been taught not to talk to strangers. PRISCILLA Neat. TERRY Do you like Elvis Presley? PRISCILLA (Giggles) Of course. Who doesn't? TERRY Well, I'm a friend of his. My wife and I go to his house sometimes when he has people over. He's always glad to see folks from back home. We're going this weekend if you want to join. Priscilla's eyebrows raise in disbelief, she looks away then back at Terry, putting her guard up. She plays it cool. PRISCILLA (nonchalant) Have to ask my parents. CUT TO: EXT. EAGLE'S CLUB - DUSK Close on Priscilla's face walking home, thinking about meeting Elvis. She smiles to herself, she can't believe it. CUT TO: INT. BEAULIEU'S HOME - GERMANY - EVENING MRS. BEAULIEU You wanna go with strangers to Elvi s Presley's house? Priscilla sets the table, as her mom, ANN BEAULIEU, an attractive homemaker, 40, gets dinner ready, and her father, CAPTAIN BEAULIEU, all-American military man, 40's, sits at the table. CAPTAIN BEAULIEU Absolutely not. PRISCILLA There’ll be other people there too. It's the weekend - why can't I go? I'd be with Terry and his wife. They don't budge. PRISCILLA   (CONT’D) There’s nothing to do here. She pouts and leaves. CUT TO: INT. EAGLE'S CLUB - AFTERNOON Mrs. and Captain Beaulieu sit at a booth with Priscilla and her little brother, DON, 10. Terry, in uniform, comes up and introduces himself. TERRY Hello Captain, I'm Terry West. CAPTAIN BEAULIEU Good to meet you, this is my wife, Ann. Terry nods with a friendly smile. TERRY Hi. I book the music here. My wif",
      "dialogue_count": 0,
      "word_count": 2122
    },
    {
      "scene_number": 2,
      "slugline": "INT. BEAULIEU'S HOME - GERMANY - EVENING Priscilla argues with her parents in the kitchen as she clears dishes. PRISCILLA I'm not tired, I'm fine. CAPTAIN BEAULIEU You can't keep going out like this. MRS. BEAULIEU We thought it was gonna be one time. CAPTAIN BEAULIEU If he wants to see you again, we have to meet him. Priscilla looks mortified. CAPTAIN BEAULIEU   (CONT’D) She finished all of her school work? MRS. BEAULI EU I'll check. You need to get some sleep. PRISCILLA I'm fine. He's gonna be gone in a few months! Please don’t ruin my life. MRS. BEAULIEU Priscilla- don't speak to us like that. PRISCILLA He just lost his mother, and he's still grieving. He trusts me. Priscilla leaves. Mrs. Beaulieu looks at her husband- we're really in for it. CUT TO: EXT. BEAULIEU'S HOME - GERMANY - DAY Elvis in full uniform, with Vernon,   comes to door. Captain Beaulieu shakes his hand and ushers them in. The door closes.",
      "characters": [],
      "action_text": "ELVIS Good afternoon, sir. CUT TO: INT. BEAULIEU'S HOME - GERMANY - AFTERNOON Priscilla sneaks a peek of the men from the kitchen, Vernon and Elvis sit across from Captain Beaulieu. Mrs. Beaulieu sets up a tray of coffee, she fumbles with the cups and saucers. We see the men from Priscilla's P.O.V. through the doorway. CAPTAIN BEAULIEU That can be tough this time of year. ELVIS No kidding, sir. We've had   some pretty cold nights out there. CAPTAIN BEAULIEU Guess you're looking forward to getting home? ELVIS Yes, sir. Mrs. Beaulieu brings in the tray of drinks, trying to be careful and stay out of their way. Elvis stands as she approaches. ELVIS   (CONT’D) Well thank you, Ma'am. He sits back down. Mrs. Beaulieu smiles and slips back to the kitchen as quickly as she can, nervously busying herself with kitchen work, wh ile Priscilla watches them. CAPTAIN BEAULIEU Just what is the intent here, Mr. Presley? CAPTAIN BEAULIEU   (CONT’D) Well, let’s face it: you're Elvis Presley. You’ve got women throwing themselves at you. Why my daughter? Vernon shifts in his seat, waiting to see how Elvis will answer. Priscilla watches, holding her breath. ELVIS Well, Sir, I happen to be very fond of your daughter. She's much more mature than her age and I really do enjoy spending time with her. I have to admit, you know, it hasn't been easy for me being away from home and all. You don't have to worry about her, Captain. Captain Beaulieu looks sternly at this young man. Priscilla and her mother share an expectant look. CAPTAIN BEAULIEU (O.S.) Look, son,   you'll need to pick her up yourself. Have her home by 2200. ELVIS (O.S.) Yes, sir. I understand... C.U. Priscilla-she can't believe it. She looks to her mom who is happy for her, but reluctant. EXT. BEAULIEU’S HOME - GERMANY - EARLY EVENING Priscilla looks out to see Elvis cooly leaning on his car (in civilian clothes) with a little smile. She beams, but tries to act cool. INT. MOVIE THEATER - GERMANY Hu mphrey Bogart fills the frame. ",
      "dialogue_count": 0,
      "word_count": 746
    },
    {
      "scene_number": 3,
      "slugline": "INT. BEAULIEU’S HOME - PRISCILLA’S ROOM - GERMANY - NIGHT Priscilla falls back on her pillow, looking up at the ceiling - IN LOVE. CUT TO: INT. ELVIS’ HOUSE - BAD NAUHEIM - NIGHT By a shimmering Christmas tree, Priscilla opens a gift Elvis gives her. In the warm glow of the room, she opens the box to see a delicate gold watch. She looks up at him, beaming. Her eyes are full of tears. PRISCILLA I just wis h there was some way I could go with you. ELVIS Shh, baby. There's nothing we can do. PRISCILLA I'm just afraid you'll forget me. ELVIS I'm not gonna forget you, Cilla. Don't you worry. He holds her close. CUT TO: INT. CAR - AIRPORT - GERMANY - DAY Priscilla sits next to Elvis as they ride in the back of his car. It's overcast, Priscilla sits in silence. ELVIS I know it's not gonna be easy going back to being   a schoolgirl, Cilla, but you got to. Now, I want you to try to have a good time, and write me letters every chance you get. You get pink stationary and address them to Joe. She nods.",
      "characters": [],
      "action_text": "ELVIS   (CONT’D) And promise me you'll stay the way you are now? PRISCILLA I will. He gives her his combat jacket. ELVIS I want you to have this. As they pull up at the airport, she starts to hear and see the crowd gathered. They pull up to the runway. Girls scream. ELVIS   (CONT’D) All right Baby, this is it. Now don't worry, I'll call you as soon as I get there. I promise. Now I don't want to see a sad face. Elvis exits the   car, she gets out. EXT. AIRPORT - CONTINUOUS Elvis holds her hand as they get out surrounded by a crowd of screaming fans and press. Flashes go off in her face. A guard escorts him away. ELVIS   (CONT’D) Bye, Baby. Priscilla watches him go as she is surrounded by fans. She waves, trying to keep cheerful. A flashbulb goes off, as she’s lost in the crowd. CUT TO: INT. CLASSROOM - GERMANY - DAY A deflated Priscilla lo oks out the window as the teacher drones on about algebra, writing out diagrams on the board. We hear the clock tick. C.U. Priscilla practices her signature on her notebook: Elvis, Elvis, Elvis.... CUT TO: Shots of: Magazine covers with Elvis and starlet- a hand puts it down. Priscilla does her homework on her bed, looks at her watch, thinking of Elvis. Priscilla in her room, looks at magazine cover with Elvis’ picture. Hair down. Calendar pages, yearbook photos, time going by. INT. BEAULIEU'S HOME GERMANY Priscilla sits around the table with her parents and little brother. Priscilla doesn't speak, sullen , staring down at her plate. She pushes some peas around with her fork. Time passing montage continues. Priscilla looks at record. C.U. Priscilla writes a letter to Elvis. INT. BEAULIEU'S HOME - KITCHEN - DAY A listless Priscilla packs up her homework from the table. Mrs. Beaulieu looks at Priscilla. MRS. BEAULIEU Maybe it's time to forget about him. Priscilla looks at her- she can't. MRS. BEAULIEU   (CONT’D) I kno w it's hard, but he's probably with women his own age. What about boys at school? Must be some handsome ones. Priscil",
      "dialogue_count": 0,
      "word_count": 754
    },
    {
      "scene_number": 4,
      "slugline": "EXT. THE SKY - DAY Fluffy clouds in the sky. EXT. GRACELAND - DAY In the bright daylight, Priscilla's P.O.V. of the musical note gates of Graceland open.. Vernon's car drives up the steep driveway to where Graceland stands. Priscilla, now 16, with her light blue suitcase walks through the columns of the small mansion. INT. GRACELAND - LATE AFTERNOON Priscilla follows Vernon and Dee into a lavish, colorfu l living room. She puts down her suitcase, and smooths her dress. Priscilla looks at all the extravagant drapes and decoration, chandeliers and mirrors- she's never seen anything like it before. Dodger gives her a hug. DODGER Come on in, Honey. Here, let me take your things. Well, you made it! Did you have a good trip? I bet you would like a lemonade. And the boys are just right down there. CUT TO: INT.   GRACELAND - MUSIC ROOM - AFTERNOON/EVE Priscilla passes through a decorative doorway into a room, filled with Elvis, his buddies including JOE, JERRY, and ALAN, and their girls, partying and playing games. The jukebox is playing and Elvis and some of the guys play pool. Elvis, now with jet black hair, is leaning over the table, a loud ball is smacked as she walks in and he looks up. Priscilla in an i nnocent cotton dress and hair back, looks out of place.",
      "characters": [
        "PRISCILLA"
      ],
      "action_text": "ELVIS There she is! He drops his cue stick down. ELVIS   (CONT’D) Let me get a good look at you. Hi. Come on. Priscilla stands there with the room full of people staring at her. The other girls, pretty and older, check Priscilla out. Elvis comes over to her and picks her up with a kiss. Buddies holler. ELVIS Where you been all my life? Let me see you. He puts her down, Priscilla wipes a tear away, embarrassed at everyone's stares. Elvis takes her in. ELVIS   (CONT’D) You look beautiful. Oh, you look beautiful. Priscilla stands self-consciously as ever. ELVIS   (CONT’D) You gotta meet the guys. This is Hog Ears. You know Joe. And then the rest of them. JOE Nice to see you again. ALBERTA, the cook, brings in a tray of southern food, that delights the crowd, it feels like every night is a party there. Elvis introduces her to Alberta. E LVIS O-Five, this here is Priscilla. ALBERTA Pleased to meet you, honey. I'm Alberta. PRISCILLA Nice to meet you. I've heard so much about you. ALBERTA And we heard plenty about you! Boys, help yourselves. Dig in, dig in. The group looks at her, Elvis introduces her around, some of the women size her up. Elvis and the guys goof around, while Elvis struts. Priscilla doesn't see the insecure sensitive Elvis from Germany, but a self-confident Elvis. LATER: The party continues on, Priscilla is tired from the trip, but excited to be there. Elvis le ans in. ELVIS You tired? Why don't you go head upstairs? I'll meet you. It’s just the first door on your left. Priscilla looks around and sees the other girls checking her out, she slips off. INT. GRACELAND - NIGHT Priscilla, small at the hall stairs under a big chandelier, climbs up next to a bright blue wall. CUT TO: INT. GRACELAND - ELVIS' BEDROOM - NIGHT Priscilla enters Elvis' bedroom, looking around . It's so different from his room in Germany- she looks at all the luxurious furnishings, thick velvet curtains frame the windows. She looks at the king size bed in the middle of the room, and won",
      "dialogue_count": 1,
      "word_count": 2175
    },
    {
      "scene_number": 5,
      "slugline": "INT. GRACELAND OFFICE - DAY She peeks into a room where a few women are working, PATSY, early 20s and friendly, smiles at her, next to BECKY. PATSY Hi Priscilla. I'm Patsy, this is Becky, we run the office, here. BECKY Hi! PRISCILLA It’s nice to meet you. I've heard so much about you. Patsy smiles. PATSY Us too...Elvis left a gift for you, on the back patio. PRISCILLA Oh, okay. PATSY You give us a holler if yo u need anything. PRISCILLA Okay, thank you. Bye. CUT TO: EXT. GRACELAND - PATIO - DAY Priscilla opens the door to see a little gated pen with a small white puppy, HONEY, with a bow around her. Priscilla exclaims overjoyed, and picks her up. CUT TO: INT. GRACELAND - AFTERNOON Close on Priscilla with the phone to her ear. ELVIS (O.S.) How's my girl? PRISCILLA I just can't believe I'm really here.",
      "characters": [],
      "action_text": "ELVIS (O.S.) Yeah, I only have a little longer on this shoot and then I'll be home. Is everyone taking good care of you? PRISCILLA Yes, everyone's been really nice. ELVIS (O.S.) Alright, that’s good... Alright baby, I gotta get back to set. PRISCILLA Okay. I miss you. ELVIS (O.S.) Good night, Baby. CUT TO: INT. VERNON'S CADILLAC - OUTSIDE SCHOOL - DAY Vernon drops Priscilla off for her first day of sc hool. VERNON Good luck. Have a good day. PRISCILLA Thank you. She's anxious to get out. VERNON (firm) Now, you won't be able to invite anyone over, strangers aren't allowed in Graceland. She gives him a look, with a small nod and gets out. EXT. IMMACULATE CONCEPTION HIGH SCHOOL - DAY Priscilla, with her hair done and slight eyeliner, in her school uniform, walks on the path towards the school. We follow her   as fresh-faced school girls look at her. CUT TO:",
      "dialogue_count": 0,
      "word_count": 307
    },
    {
      "scene_number": 6,
      "slugline": "INT. IMMACULATE CONCEPTION HIGH SCHOOL - CLASSROOM - DAY A teacher speaks as Priscilla follows along. She sees a note on the ground being passed. Two girls in the back whisper. SCHOOLGIRL (whispers) She’s supposed to be with Elvis Presley. If we make friends with her, maybe we can meet him! Priscilla hears them. EXT. GRACELAND GATES - DAY Some fans wait at the gates. CUT TO: EXT. GRACELAND - DAY Priscilla s its on the front lawn playing with her puppy. Below at the gate, some fans wait. Dee passes by. DEE Oh Honey, you can't be out here making a public display of yourself. PRISCILLA Oh, I didn't think it-- DEE Well you had better start thinkin'. She walks off. Priscilla looks around, stands up, brushing herself off and takes Honey back to the house. INT. GRACELAND - BATHROOM - DAY Priscilla lies in a bubble ba th, with her hair up. We hear the drip of the faucet. CUT TO: INT. GRACELAND - LIVING ROOM/MUSIC ROOM - AFTERNOON Priscilla does French homework.",
      "characters": [
        "ELVIS"
      ],
      "action_text": "(MORE) C.U. Cotton balls between her toes, as she paints her toe nails. INT. GRACELAND - LIVING ROOM - AFTERNOON Priscilla walks around the shag carpet, twisting the phone cord while she talks on the phone. (Close on her feet, hands twisting cord) ELVIS (O.S.) I said to the director today, “Why'd we come all the way out to Los Angeles to film the Smoky Mountains. Hell, you may know more about movie makin’, b ut I know a think or two about the Smoky Mountains. And I’ll tell you what, they ain’t got no coconut trees on ‘em!” He cracks up, trying to make her laugh, she looks out the window, not able to tell him how she's really feeling. ELVIS (O.S.)   (CONT’D) You, there, baby? PRISCILLA I'm here. ELVIS (O.S.) How are you doing? She puts on a brave face. PRISCILLA I’m great. It’s all been really wonderful. ELVIS (O.S.) That's what I like to hear. Baby, do you have everything you need? How you doin’ on cash? PRISCILLA It’s funny you should ask. Your daddy's pretty strict. ELVIS (O.S.) (laughs) Yeah that's my daddy, He's always been tight. That's why I have him taking care of the bills. (MORE) Priscilla comes down the stairs to greet Elvis, the whole household is there, and the place is back to life. PRISCILLA Hello. ELVIS Hello? Hello. He laughs and picks her up in his arms, kissing her. ELVIS   (CONT’D) Dodger, you waited for me too, bless your little heart. He hugs her and the rest. The house is full of people and energy with the guys bringing in the luggage and meeting their wives, Alberta cooking... Priscilla is a little lost in the sudden change of atmosphere. ELVIS   (CONT’D) (Calls out) O-Five, what's for dinner? Priscilla, not wanting to be too eager, waits in the living room. ELVIS (O.S.)   (CONT’D) Cilla, come here! Priscilla and Elvis talk in foyer. ELVIS   (CONT’D) How's school? She tells him everything she couldn't say on the phone. PRISCILLA Oh, it's okay, I don’t really talk to anybody there. Grandma and Patsy have been   nice. I missed you. I’ve been try",
      "dialogue_count": 1,
      "word_count": 1080
    },
    {
      "scene_number": 7,
      "slugline": "EXT. GRACELAND - SUNNY DAY The door to the Limousine opens and Elvis beckons her in. ELVIS Hop in, I wanna take you shopping. They drive off. INT. MEMPHIS BOUTIQUE - DAY Priscilla tries on a slinky dress, while Elvis and some buddies watch. ELVIS Well, would you look at that, huh? Priscilla models the dress, still an insecure teenager. PRISCILLA I think these clothes are too sophisticated for me. (as she look s in the mirror) ELVIS Honey, what’s sophisticated? You could go around in a feather and it’ll be sophisticated. She tries on dress after dress as Elvis reviews them. ELVIS   (CONT’D) I like you in blue. Blue’s your color. She steps into matching shoes, and shows him another one with a print. ELVIS   (CONT’D) Prints take away from your looks. PRISCILLA I like this one. ELVIS No, solids suit you better. Another dress. ELVIS   (CONT’D) And I   hate brown, it reminds me of the army.",
      "characters": [],
      "action_text": "Boxes and bags are carried out. ELVIS   (CONT’D) Black hair and more eye makeup will make your eyes stand out more. CUT TO: INT. MEMPHIS HAIR SALON - DAY Close on jet black dye running off wet hair in the sink. In moments of real time, we go through the process: Close on the hairdryer blowing hair. Close up on black hair twisting around a big curler, and a cloud of hairspray. Priscilla spins around in the chair - w ith tall coiffed black hair. PRISCILLA, ELVIS AND FRIENDS PARTY AT NIGHT MONTAGE: THEY PACK A DOZEN PEOPLE INTO A CRAMMED LIMO BUMPER CARS - CILLA SCREAMS AS SHE WHIPS BY ROMAN CANDLE WARS IN THE BACK YARD INT. GRACELAND - ELVIS’ BEDROOM - MORNING A tired Priscilla looks at the alarm clock, trying to wake up, she takes a pill from the nightstand. CUT TO: EXT. IMMACULATE CONCEPTION HIGH SCHOOL – DAY Priscil la walks to class- her jet-black hair and eyeliner with her school uniform. Girls look at her judgmentally. CUT TO:",
      "dialogue_count": 0,
      "word_count": 333
    },
    {
      "scene_number": 8,
      "slugline": "INT. GRACELAND - ELVIS’ BEDROOM - AFTERNOON Priscilla comes in (in her school uniform) with a tray of breakfast- eggs and a big pile of bacon. She opens the heavy curtains in the dark room, trying to wake a groggy Elvis. PRISCILLA Hello. ELVIS What time is it? PRISCILLA Almost four. I brought breakfast for you. He leans up and takes a morning pill as he starts the day with a pile of burnt bacon with toas t and eggs. CUT TO: PARTYING AT NIGHT WITH E AND THE BOYS CONT. Elvis gives Priscilla a pearl handled pistol. AFTERNOON - Elvis shows Priscilla how to shoot a gun with the guys. DUSK. ROLLER RINK - They speed by under the lights. INT. ELVIS’ BEDROOM - GRACELAND - DAY In the dark velvet cave, the alarm clock sounds - Priscilla’s arm slams it quickly. She sits up, exhausted and sneaks a Dexedrine in her   mouth while Elvis sleeps soundly. CUT TO: PRISCILLA LAYS OUT A ROW OF SEQUIN DRESSES OUT AT A CROWDED MUSIC CLUB GOLF CARTS SPEED AROUND GRACELAND AT NIGHT - They speed by- the wind blowing her hair. Priscilla screams. EXT. GRACELAND - DAY The house stands in the daylight.",
      "characters": [],
      "action_text": "A gardener turns a golf cart on its side, right side up. Priscilla walks past carrying shopping bags. CUT TO: INT. GRACELAND - ELVIS' BEDROOM - AFTERNOON Priscilla comes in the dark room, carrying some shopping bags, in a new dress (with a bold 60's print) she's proudly wearing. Elvis waking up, pushes a button and the heavy velvet curtains open to let in a stream of sunlight. He leans up to start the   day. He squints to look at her. ELVIS Now what is that dress? Uh, that doesn't suit you, Baby. PRISCILLA It doesn't? ELVIS No, it does nothin’ for you, takes away from your eyes and from your face. He gets up and moves closer. ELVIS   (CONT’D) Oh, man, it does nothing for your figure. All you see is a goddamn dress. Priscilla starts to cry. PRISCILLA You finished? She goes in the bathroom and slams the door. ELVIS (O.S .) Satnin’, you’re a small girl. You gotta keep away from the prints, baby! She opens the door, snapping. PRISCILLA Okay, I’ll return the fucking dress! Elvis falls to the floor with laughter. CUT TO: INT. IMMACULATE CONCEPTION HIGH SCHOOL – DAY Priscilla in her school uniform, sits across from an old strict-looking nun in cat eye glasses. Priscilla taps her foot quickly, wired. SISTER ADRIAN Priscilla, final exams are coming up – you will need to keep your grades up in order to graduate with your class. PRISCILLA Yes, Sister Adrian. CUT TO: INT. GRACELAND   - ELVIS' BEDROOM - NIGHT Close on Priscilla on the phone. PRISCILLA Dad, I am doing great, you don't have to...Yes, of course I'm doing well in school...Yes, I will graduate. Don’t worry...I miss you too… I will… Talk to you soon. Bye. Priscilla hangs up and lies on the carpet with schoolbooks out, trying to study. We can hear Elvis singing along with a Timi Yuro record loudly in the next room with hi s buddies who are joking around. She gets up and shuts the door, trying to focus. CUT TO: INT. GRACELAND - ELVIS’ BEDROOM - MORNING E.C.U. PRISCILLA’S MOUTH- POPPING A YELLOW PILL CUT TO:",
      "dialogue_count": 0,
      "word_count": 561
    },
    {
      "scene_number": 9,
      "slugline": "INT. IMMACULATE CONCEPTION HIGH SCHOOL - CLASSROOM - DAY C.U. On a MATH TEST Priscilla sits with the other girls in a quiet, crowded classroom as they lean over tests. TEACHER (O.S.) Pass that across. You have twenty minutes to complete your answers. Priscilla stares at the sheet, lost, looking at the math equations, tapping her foot nervously, wired on Dexedrine. She looks around as her classmates fil l out answers. The loud sound of the clock’s minutes passing. She looks at a girl next to her, JANET, a straight A student. Priscilla taps her on the shoulder and whispers to her. PRISCILLA (whispers) Are you an Elvis fan? Janet nods. PRISCILLA   (CONT’D) How would you like to come to one of his parties? Priscilla eyes her test, and she gets it. Janet smiles and slides her test to the edge of her desk in Priscilla ’s view. Priscilla gives her a thankful smile. CUT TO: EXT. GRACELAND - DAY Graduation day! Elvis is dressed in a three-piece blue suit, excited for the big day. Grandma Dodger and all the gang are outside while Priscilla in her pink dress comes out to see him present her with a red Corvair with a big bow on it. She is thrilled! PRISCILLA That's for me?! Priscilla smiles. ELVIS Yes ma’am. What do you thin k? You like it?",
      "characters": [],
      "action_text": "PRISCILLA I love it! I can’t believe you did this. Joe takes a photo. ELVIS Alright it’s time to go - Cilla's graduating! Priscilla pulls him aside, looks up at him. PRISCILLA Can I ask you something? I was wondering if, maybe you could wait outside the ceremony. I'm afraid you being there might take away the attention from the graduates. Elvis makes a hurt vulnerable smile. ELVIS I guess I hadn't thoug ht of it like that. Priscilla gives him a loving look. ELVIS I won't come in. I'll wait for you outside in the car. That way it’ll kinda be like I’m there. PRISCILLA Thank you. Priscilla smiles and kisses him. ELVIS Alright, let’s go baby! CUT TO: EXT. IMMACULATE CONCEPTION HIGH SCHOOL - ENTRANCE - DAY Priscilla runs out with her diploma and sees: Elvis and the boys all in dark suits and sunglasses, .38s i n their waistbands, lean against the car, like Mafia, waiting for her. A group of nuns have run out and huddle around getting Elvis' autograph. Elvis looks up at her with a big smile and starts applauding. He kisses her proudly. ELVIS I love you too. Let me see it. Throw it in the air. Priscilla unrolls her diploma and shows him with a big smile. She throws her cap into the air as the guys all holler. The silk cap flies through the blue sky. CUT TO: INT. GRACELAND - ELVIS’ BEDROOM - NIGHT Black out curtains closed, Elvis and Priscilla are in th e dark cave of his room - now they can finally be alone together! He makes a call on the bedside phone. ELVIS No calls unless it’s my daddy or an emergency from the Colonel. They watch old movies, the Johnny Carson show on TV. CUT TO: INT. GRACELAND - HALLWAY - DAY A tray of left over room service sits in front of Elvis’ bedroom door. The TV blares inside. CUT TO: EXT. GRACELAND - DAY The gardener waters p lants outside. INT. GRACELAND - HALLWAY - NIGHT Outside the room -the food tray is taken and replaced with a new one with peanut butter sandwiches. SERIES OF FOOD TRAYS - SHOWING A LAPSE OF TIME",
      "dialogue_count": 0,
      "word_count": 598
    },
    {
      "scene_number": 10,
      "slugline": "INT. GRACELAND - ELVIS' BEDROOM - DAY Elvis sings along to the radio while he eats bacon off a tray in pajamas. He looks at a pile of scripts and throws them on the floor. He turns on the TV. Priscilla peers out the heavy drapes, a crack of light comes in. CUT TO: Later: In bed, taking polaroids, she's in a nighty and a captain's hat, they goof around, start a playful pillow fight, laughing...now she ha s on a flower lei, a secretary look, he grabs her as she laughs. (Intercut quick montage of their polaroids) He throws a pillow at her, they start to wrestle. She breaks away and throws a pillow at him harder than she means to. She throws another one- it hits him in the face. His eyes flash with anger. ELVIS Not so rough! You’re not a goddamn man! He throws her down on the bed demonstrating how hard s he threw it, and accidentally hits her in the eye. She jumps up, touching her eye. PRISCILLA Oh god, you can't play without winning. Priscilla stomps off and slams the door behind her. ELVIS I don’t want to play with a goddamn man! Elvis comes over to the door, tripping on his way. He leans on the door, calming down. He talks through the door. ELVIS Baby, I'm sorry. Are you okay? Open the door. She slowly   opens it.",
      "characters": [],
      "action_text": "ELVIS   (CONT’D) That was a real accident, baby. You know I'd never hurt you in any real way. PRISCILLA Maybe the pills are too much? Elvis gets defensive. ELVIS (pissed) I have my doctors looking after me, I don't need an amateur opinion. He walks off, she realizes this could be a problem. CUT TO: EXT. GRACELAND - DAY Priscilla watches as Elvis and the guys have a shooting contest in the backyard. ELVIS Joe, don't go   tucking that revolver in your waistband now. ELVIS   (CONT’D) See I wouldn't want you to go off... ELVIS/THE GUYS (in unison) ...half-cocked. Elvis, cigar in his mouth sees something in the distance he doesn't like. ELVIS What's that old house still doing back there? JOE Uncle Travis' old place? Yeah it’s storage now. ELVIS Well it looks goddamn awful. CUT TO:",
      "dialogue_count": 0,
      "word_count": 375
    },
    {
      "scene_number": 11,
      "slugline": "EXT. GRACELAND - LATE AFTERNOON Elvis, in a big winter coat, climbs up to drive the bulldozer, putting a football helmet on. Priscilla, Vernon, the guys and some of the maintenance team watch and holler as Elvis takes off in the bulldozer and starts tearing down a side of the small structure. CUT TO: EXT. GRACELAND - DAY The boys load up the bus. Elvis and Priscilla walk arm in arm to the bus. He's full   of energy to hit the road. Music blasts from the bus, the guys call out to each other to make sure they have everything. ELVIS All right. So back to Hollywood. I won’t be too long. He sees her sad face. JOE Hey E, you driving?! ELVIS Yeah, man, of course. Get on the damn bus. (to Priscilla) What is it, Baby? PRISCILLA I'm gonna miss you. He nods to him and back to Priscilla. ELVIS I know, Little One. Ju st give me a few weeks to get into this movie and then maybe you can come out for a while. I need you to keep the home fires warm. Now, you be a good girl, and I'll call you when I get there, okay? He gives her a quick kiss and boards the bus.",
      "characters": [],
      "action_text": "ELVIS   (CONT’D) (calls out) Alright, viva Las Vegas. Let's roll it! Priscilla watches the bus head out. She turns and walks slowly back to the house. CUT TO: INT. GRACELAND – OFFICE – DAY Priscilla sits with Honey in the office talking with Patsy and Becky while they sort fan mail. PATSY Oh, you’ve gotta see the things we get. Open this. The girls laugh. Vernon comes in and breaks it up. He points to a sign on the door ‘employees only.’ VERNON Alright that’s enough gabbing! Priscilla, I’m afraid I’m gonna have to ask you to leave so they can get their work done. Priscilla gets up and Vernon closes the door after her. CUT TO: INT. MEMPHIS HAIR SALON - DAY C.U. A magazine cover with Elvis and ANN-MARGRET. Priscilla sits under a dome hair dryer in a Memphis salon. Zoom out slowly from her face to see her sitting a mongst the Memphis ladies in the salon. We hear the hum of the dryers and Southern ladies’ chit chat. CUT TO: INT. GRACELAND - DAY Priscilla finishes packing her suitcase when the phone rings. She grabs the receiver. PRISCILLA Hello? ELVIS (O.S.) Hi, Baby. PRISCILLA Hi, how's it going there? I can't wait to see you! ELVIS (O.S.) Now's not the time to come out, there's a problem on set. She sets down her nightgown she was folding. PRISCILLA What kind of problem? ELVIS (O.S.) It's just that all hell’s broke loose. ELVIS (O.S.)   (CONT’D) I've got some crazed director madly in love with Ann. The way he's directing it, you 'd think it was her goddamn movie. She's got all the close-ups and now they want her to sing some of the songs with me. I tell you, Colonel ‘bout blew a fuse. PRISCILLA How are you and Ann-Margret getting along? ELVIS (O.S.) Oh, she's fine, I guess. She’s a typical Hollywood starlet. You know, careers come first and their man second, that's not for me. Close on Priscilla's face. PRISCILLA You know, there ’s a lot of rumors about you two, is there anything to it? ELVIS (O.S.) Hell, no. You know how reporters are, just blowing everything out of ",
      "dialogue_count": 0,
      "word_count": 776
    },
    {
      "scene_number": 12,
      "slugline": "EXT. LOS ANGELES HOUSE - DAY Priscilla sits at a table on the patio with sunglasses, breakfast with a grapefruit half on a plate in front of her. Elvis comes out to her with sunglasses on. ELVIS I can't believe she did this. He tosses down a paper with the headline: Elvis and Ann Margret ENGAGED. ELVIS   (CONT’D) Every goddamn paper in town's picked it up. Honey, I'm gonna have to ask you to leave. There’s gonna b e press all over the place. Colonel thinks it’s best that you go back to Memphis just until it all calms down. Priscilla stands up, finally losing it after all these months. PRISCILLA (screams) What's going on! Priscilla throws a vase that smashes on the wall behind him. PRISCILLA   (CONT’D) Why doesn't she go back to Sweden where she belongs?! He leans in close to her. ELVIS Goddamn, I didn't know things were gonna   get out of hand. I need a woman who understands things like this might happen. He looks at her. ELVIS   (CONT’D) Are you going to be her - or not? Priscilla stares at him with defiance. There's a long pause- a standoff. PRISCILLA I'll leave tomorrow. I'll be waiting in Memphis.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 204
    },
    {
      "scene_number": 13,
      "slugline": "EXT. GRACELAND - EVENING Elvis’ bus honks the horn as they return to Graceland. INT. GRACELAND - ELVIS’ BEDROOM - NIGHT Elvis puts down his things, and takes Priscilla's face in his hands. ELVIS It's over, Cilla. I swear to you. It's over. Priscilla listens silently. ELVIS   (CONT’D) I got caught up in a situation that was out of hand from the beginning. I don't like being exploited like that. You know I can't live   like that. She's a nice girl, but she’s not for me. Priscilla doesn't want to hear it. ELVIS   (CONT’D) Let's just forget it. He gives her the little boy look that always melts her. ELVIS You’re my girl, baby. You’re the only girl I ever loved. The only girl I wanna be with. He pulls her close. CUT TO: EXT. GRACELAND POOL - DAY Elvis and the guys goof around in the pool, doing chicken fights. Priscilla and a few   of the wives lie on lounge chairs. She shoots Super 8 home movies. Joe, fully clothed in some bright-colored golf pants, sits on a chaise lounge. Elvis gives two of the other GUYS a sign to throw Joe in the pool. Everyone cracks up.",
      "characters": [],
      "action_text": "Everyone cracks up again, and Joe splashes Elvis and laughs along. Elvis gets out of the pool, dripping with water and lies on Priscilla who laughs and tries to fight him off. They kiss in the late afternoon sun. CUT TO: INT. GRACELAND - ELVIS' BEDROOM - LATE AFTERNOON C.U. Priscilla's hand takes an envelope out of a jacket pocket and finds a note in girly handwriting and a lipstick kiss: When are we   going to get together again? I miss you. CUT TO: INT. GRACELAND - ELVIS' OFFICE - AFTERNOON/EVENING Elvis is on the phone, he looks up at her. Priscilla holds up the letter, looking at Elvis. ELVIS Daddy, I’m gonna have to call you back. His eyes are dark, he's in the middle of some work stress and annoyed to be interrupted. ELVIS   (CONT’D) Now don't go imagining things. PRISCILLA Like Ann-Margret?! She holds up a note. PRISCILLA ‘Scoobie'? She stares at him. ELVIS That's it, Woman! I don't want to hear another word. PRISCILLA Well is there something you're hiding? ELVIS I don't have a goddamn thing to hide. You're just being too goddamn aggressive and demanding. I think you should go see your parents for a little while. PRISCILLA (yells) What? Well I'm not going! ELVIS I think you should. Matter of fact, I'll help you. He goes and gets her suitcase from the closet, and starts throwing all of her clothes with hangers on it. ELVIS   (CONT’D) Start packing! Priscilla sobs while s he packs her bag. Elvis goes out to the hall and yells down. ELVIS (O.S.)   (CONT’D) (yelling) Joe- Joe get Cilla on the next flight outta here. She's gonna go see her parents for a little while. Get her a ticket outta here. He looks at her reaction as he says this. Priscilla sobs as she folds her clothes. Elvis comes back in the room, looking down at her. ELVIS   (CONT’D) Hurry up! Priscilla gets up slowly and makes her way   to the door. Just as she reaches it, she feels his hand on her shoulder. She turns, and he takes her in his arms and holds her tight. ELVIS Now do you understand? All ri",
      "dialogue_count": 0,
      "word_count": 1331
    },
    {
      "scene_number": 14,
      "slugline": "EXT. LOS ANGELES HOUSE - DAY CLOSEUP on backlit palm trees. CUT TO: INT. LOS ANGELES HOUSE - DAY Priscilla walks through and passes a room where Elvis and LARRY sit and talk. LARRY, early 30s, a tan, Californian spiritual man sits cross legged on a floor pillow in gauzy pants. Elvis looks up at her. ELVIS Cilla, this here is Larry, he did my hair on the last shoot. PRISCILLA Hi. ELVIS He knows more about the   spiritual realm than all the preachers and the priests put together... Larry smiles at her humbly. LARRY Well, I don't know about that. But I am here to ask questions alongside my friend here. Priscilla looks at him, gives a polite smile and thinks ‘not another hanger on'. PRISCILLA Well, I'll leave you to it...I'm going to start packing to go home. She walks on. EXT. GRACELAND - DUSK Back home. INT. GRACEL AND - NIGHT CUT TO:",
      "characters": [],
      "action_text": "An LSD drop goes onto a sugar cube. ELVIS Larry says it will help us go deeper. Elvis and Priscilla take the LSD sugar cubes. Priscilla looks at the lights. Priscilla touches print wallpaper. The tiger gives her a secret message! She looks at Elvis. PRISCILLA Oh my god, your shirt is breathing. They look at all the colors. They lay on the floor together. INT. GRACELAND - ELVIS' BEDROOM - NIGHT Priscilla lies   on the bed, coming to. Elvis reads from his spiritual books to her in bed as his audience. She's bored after hours of this. ELVIS ...and his host of evil spirits consumed with him. Man, tired of vain wrangling and contending for power, longs for those quiet groves where olden sages communed with their familiars... He sets down the book, and picks up another. ELVIS   (CONT’D) There's just so much to learn, I need   to find more. Cilla, why me? What am I supposed to do with all this influence? PRISCILLA I don’t know. But you touch so many people. ELVIS Baby, you gotta read Cheiro's book of numbers, there’s no one else like him. She reaches out to him, moving closer, caressing his shoulder. He looks at her hand, then to her. ELVIS   (CONT’D) We have to control our desires otherwise they’ll control us. She looks at him, and rolls over. He begins to read on- then pauses. ELVIS   (CONT’D) Cilla, this is never gonna work if you don't share my interests and philosophies. Cl ose on Priscilla. ELVIS   (CONT’D) I mean there are a lot of women out there that would wanna share in this with me. She turns over and tries to pay attention as he reads on, she cuddles up to him. ELVIS   (CONT’D) Come on, sit up, so you can really pay attention. Elvis reads another passage. Priscilla loses it. PRISCILLA I can't stand it! It’s driving me crazy! I don’t wanna hear it anymore! Elvis stares at her. ELVIS I see a   mad woman-- His words start to slur as his pills take effect. PRISCILLA No. A woman with needs, who needs to be desired. You can have your books and me too. She looks at hi",
      "dialogue_count": 0,
      "word_count": 889
    },
    {
      "scene_number": 15,
      "slugline": "EXT. GRACELAND - AFTERNOON Elvis with his arm around Priscilla, the guys and their wives BBQ by the pool on a summer day. Home movie shot of Priscilla playing wife, holding a banana cream pie. They goof around and mug for the camera. Priscilla and some of the other wives wave as Jerry shoots super 8 home movies. INT. GRACELAND - ELVIS’ BEDROOM - DAY Priscilla lays in bed, she feels funny. She touches   her stomach, lost in thought. CUT TO: INT. GRACELAND - LIVING ROOM - DAY Elvis is having a fitting, he's wearing a speedway racing jumpsuit as his hems are being pinned, when Priscilla walks in. He looks up at her. ELVIS How’d it go? Well? Priscilla nods in disbelief. He turns to his buddies. ELVIS   (CONT’D) I'm gonna… I’m gonna be a daddy!? He picks her up in his arms with a kiss. ELVIS   (CONT’D) Get Vernon on the phone, yo u tell him he’s gonna be a grey-headed Grand-daddy! Priscilla looks nervous. ELVIS   (CONT’D) What is it, Satnin’? They step over to the window as the others step out. ELVIS   (CONT’D) What happened to that twinkle in your eyes?",
      "characters": [],
      "action_text": "PRISCILLA I'm scared. She breaks down in tears, he holds her close. ELVIS (speaks softly) Whatever you want to do, I'll back you up. PRISCILLA I want a baby, just it's so soon. She cries in his arms. PRISCILLA   (CONT’D) What about our trip to Europe and all of our plans together? ELVIS It’s alright, we'll go another time. We’re having a little one. He comforts her sweetly. CUT TO: INT. GRACELAND - SUNPORCH OR DINING R OOM - DAY Priscilla, very pregnant, opens the paper on the breakfast table: Elvis romances Nancy Sinatra on the set of Speedway - a shot of them laughing together. She tosses it down. CUT TO: INT. GRACELAND - ELVIS’ BEDROOM - LATE AFTERNOON Slow zoom out: Priscilla stands in profile, she looks at her full stomach in the mirror. What is in store for them? CUT TO: INT. GRACELAND - BATHROOM - DAY C.U. Prisc illa's feet step on a scale to check her weight. She's getting dressed when she hears Elvis call out to her. ELVIS (O.S.) Cilla! Cilla come here.",
      "dialogue_count": 0,
      "word_count": 374
    },
    {
      "scene_number": 16,
      "slugline": "INT. GRACELAND - ELVIS' OFFICE - DAY Priscilla comes in to Elvis on the couch. ELVIS Cilla, I've been thinking. She looks at him, confused. ELVIS   (CONT’D) You know, I have to have time to think and things just haven’t been right. I think it’d be best for the two of us if we took a little time apart. Priscilla, 8 months pregnant looks at him in shock. PRISCILLA What are you talking about?! He looks at her. PRISCILL A What did I do? ELVIS Oh baby, you don’t see. You didn't do anything. It's not you. It's just that I've been going through some things and I just think it'd be best if we took a little break. Priscilla looks at him with a new strength. PRISCILLA You've got it. Just tell me when to leave. She turns and walks out. Priscilla walks down the hall resolute. CUT TO: EXT. GRACELAND - DAY Elvis plays football with   the guys. CUT TO:",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 163
    },
    {
      "scene_number": 17,
      "slugline": "INT. GRACELAND - NURSERY - DAY Priscilla sets up the baby's nursery. She arranges the dresser, she winds up a music box and unpacks books and stuffed animals. Life goes on at Graceland... CUT TO: EXT. GRACELAND - DAY Flowers are in full bloom as birds chirp on a sunny morning. PRISCILLA (O.S.) Elvis? CUT TO: INT. GRACELAND - ELVIS' BEDROOM - MORNING Elvis is passed out, Priscilla, next to him in bed, wakes   up startled. She feels the sheets around her are wet. She looks at the clock: 8 a.m. Priscilla looks over at Elvis who's asleep. She taps him gently, but he doesn't wake up. She moves him more firmly and he startles awake. PRISCILLA Elvis wake up. ELVIS (asleep) Huh? PRISCILLA The baby's coming. ELVIS You sure? PRISCILLA Yes. She gets up, he leans up, trying to wake up, and picks up the phone.",
      "characters": [],
      "action_text": "ELVIS Daddy, it's time, you need to send the car up. Elvis, nervous and excited, gets up and yells downstairs in a frenzy as he finds her suitcase. ELVIS   (CONT’D) Joe! Jerry! It’s time to send the car up! Cilla's having the baby! It's time! INT. GRACELAND - BATHROOM - MORNING Priscilla calmly puts her lashes on. We hear the household in action downstairs. EXT. HOSPITAL - DAY Their Cadillac pulls up to the back e ntrance of the hospital. CUT TO: INT. MEMPHIS HOSPITAL - DAY Elvis leans close to Priscilla in the bed holding baby LISA MARIE in her arms next to him. He looks at them lovingly. ELVIS (whispers) We got ourselves a baby girl, Satnin'. PRISCILLA We sure do. She beams at him, eye lashes and mascara perfectly in place. EXT. MEMPHIS HOSPITAL - DAY We follow Elvis and Priscilla out of the hospital with their bab y to the car - a wall of screaming fans rejoice. Some nurses get photos with him. Elvis winks at Priscilla in the mayhem. CUT TO:",
      "dialogue_count": 0,
      "word_count": 325
    },
    {
      "scene_number": 18,
      "slugline": "INT. GRACELAND - NURSERY - NIGHT LISA MARIE, around 8-months-old, cries in the crib of her Graceland bedroom, surrounded by yellow floral wallpaper. A nurse rushes in to her. CUT TO: INT. GRACELAND - ELVIS’S BEDROOM - NIGHT Silent, in their sound proof room, Priscilla in a little babydoll nightgown cozies up to Elvis. She kisses him. PRISCILLA Elvis, it’s been so long. ELVIS I know, I just don&’t want to   hurt you, Baby. PRISCILLA Well, I’m ok. ELVIS Let’s just wait a little... He cuddles up to her to sleep. CUT TO: INT. GRACELAND, 1968 - LIVING ROOM - DAY CUT TO: As Priscilla comes home, she gives Lisa Marie, a toddler, an affectionate hug, and finds Elvis with a young director and the usual entourage having a fitting. Elvis wears a tight black leather outfit as they discuss his TV special. Elvis turns to Pr iscilla. ELVIS Satnin’, I don’t know, I feel a little silly in this outfit. What do you think? She smiles at him reassuringly.",
      "characters": [],
      "action_text": "PRISCILLA You look really good. CUT TO: INT. GRACELAND - EVENING Elvis plays guitar as we pull back through his iconic lit- up sign. Cut to: From over the TV, we see Elvis, Priscilla and the gang watching the ‘68 Special. The phone rings nonstop - it’s a hit. Elvis responds to all ratings and all the offers coming in. We see a magazine cover: Elvis is back...and schedules, calendars of tour dates, po sters... Maintenance men put up Elvis posters at the International. CUT TO: EXT. GRACELAND - DAY Priscilla stands out front holding Lisa Marie as Elvis and the guys load up the bus for tour. They're high-fiving and excited to be on tour. Elvis kisses Priscilla and Lisa Marie good-bye. PRISCILLA When should we come meet you? ELVIS (caring) Honey, a tour's no place for a mother and young'un. But I'll be hom e soon as I can. He joins the guys and waves. (try version without dialog) ELVIS   (CONT’D) All right, let's roll it. Get on the damn buss. The bus pulls out and drives off, leaving Priscilla standing, holding the baby, receding into the distance. CUT TO:",
      "dialogue_count": 0,
      "word_count": 363
    },
    {
      "scene_number": 19,
      "slugline": "INT. GRACELAND - LIVING ROOM - DAY Priscilla (now a natural brunette) brushes Lisa's hair, age 3, while her nanny buckles a shoe. PRISCILLA Ok, Honey, let's go. Come on, you. Lisa Marie clings to her nanny. LISA MARIE No, no! PRISCILLA Oh, c'mon, Lisa. Come take a picture with Daddy. LISA MARIE No! Lisa Marie clings to the nanny in tears. Priscilla looks at her and realizes she hasn't been there enough. A ph otographer sets up for a portrait. Priscilla brings Lisa Marie over with her nurse. They sit with Elvis as a photographer takes their family portrait. Elvis takes Lisa Marie in his lap lovingly. Priscilla sits beside Elvis, he turns to her and kisses her forehead playfully. Priscilla smiles for the photo, then her face drops - she watches Lisa Marie run to her nanny. CUT TO: EXT. GRACELAND GARDEN - DAY P riscilla pushes Lisa Marie on a swing, and plays with her on the lawn. CUT TO: INT. LIMOUSINE - DAY Priscilla sits next to Elvis. He wears his sunglasses. They don't speak, we see the distance between them.",
      "characters": [],
      "action_text": "PRISCILLA Should we meet you in Palm Springs? Joe gives Elvis posters to sign. ELVIS I think me and the guys are gonna go for a few days, just to wind down. She looks at him. PRISCILLA Really? ELVIS I need you to lighten up. PRISCILLA I think I'm going to stay with Lisa in L.A. for a little while. ELVIS Whatever you want, Baby. CUT TO: INT. CAR - LA STREETS - DAY Priscilla drives alone, hair blowing, listenin g to Santana - ”Oye Como Va.” Zoom out to see her zipping through Los Angeles in a convertible. Music continues over: INT. KARATE STUDIO - DAY Afternoon light streams in as Priscilla takes a karate lesson with Mike Stone. He focuses intently on her, adjusting her arm position. She moves well and swiftly, deflecting his moves. She feels their connection and the satisfaction of getting stronger. CUT TO:",
      "dialogue_count": 0,
      "word_count": 335
    },
    {
      "scene_number": 20,
      "slugline": "EXT. LOS ANGELES HOUSE - AFTERNOON Priscilla and Lisa Marie play with the dog in the garden. CUT TO: EXT. LOS ANGELES GARDEN RESTAURANT - EVENING Priscilla, Mike and some friends have dinner outside, they talk and laugh surrounded by hanging plants. He tells her about Kurosawa samurai films. Priscilla is dressed in a natural cotton dress, it's the 70s... PRISCILLA I guess I’m getting a little too good an d I punched him straight in the nose. MIKE My memory’s a little blurry because, um… you might’ve shaken something a bit loose, but… No. It’s fine, it’s fine. CUT TO: INT. VEGAS HOTEL ROOM - EVENING Elvis leans up in the dark room as a blonde sleeps next to him under silk sheets. CUT TO: INT. VEGAS SHOW - NIGHT Show lights flare as, slow motion: Elvis, his back to us, lifts the arms of his cape. CUT TO: INT.   LOS ANGELES BATHROOM - DAY C.U. Priscilla washes her face and looks in the mirror. The fake lashes and heavy eye makeup are gone. CUT TO:",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 178
    },
    {
      "scene_number": 21,
      "slugline": "INT. LAS VEGAS RESTAURANT - NIGHT Priscilla and some of the other wives have dinner in the Casino’s Italian restaurant. The maître d’ comes to the table. MAÎTRE D’ Excuse me, Mrs. Presley. Elvis asked that you meet him in the suite. Priscilla looks confused by this. PRISCILLA Ok, thank you. She gets up. PRISCILLA   (CONT’D) He never goes to his room between shows. I’m gonna go see what’s up and I’ll meet you guys aft er. JOANIE Ok, see you later. CUT TO: INT. ELVIS’ HOTEL ROOM - LAS VEGAS - NIGHT Priscilla walks into the dark room curiously. PRISCILLA Hello? Hey. Is everything ok? She finds him in bed, waiting for her. She walks closer and sits on the edge of the bed. He starts kissing her neck and moves her down on the bed, holding her arms tightly. ELVIS I wanna show you how a real man makes love to his woman. Priscil la looks at him-she doesn't recognize him. He clutches her arms, tightly pinning her down. PRISCILLA What are you doing?... Please stop. Just stop. Stop.",
      "characters": [],
      "action_text": "Cut back to a wide shot of Elvis as he walks off, Priscilla puts herself together. FADE OUT: INT. ELVIS' HOTEL ROOM - LAS VEGAS - AFTERNOON In the dark room, Elvis sleeps, he leans up to see Priscilla. A strip of light cuts through the curtains. He looks at her, half awake. PRISCILLA I'm leaving. ELVIS What do you mean, leaving? She has her things, she's packed. PRISCILLA I'm leaving our marriage. ELVIS Ar e you out of your mind? You have everything a woman could want. You don’t mean that Satnin’. You can’t leave. She looks at him. ELVIS   (CONT’D) You mean I've been so blind that I didn't see this coming? PRISCILLA We're living separate lives. ELVIS Have I lost you to another man? PRISCILLA You’re losing me to a life of my own. He stares at her. Priscilla stands tall, teary eyed. PRISCILLA   (CONT’D) I have to go. If I stay, I' ll never leave. She heads to the door, looking back at him, teary eyed. ELVIS Maybe another place, another time. She smiles through her heartbreak, and leaves. CUT TO: INT. VEGAS HOTEL HALL - DAY Priscilla walks down the long hallway alone, leaving the only life she’s known. INT. GRACELAND - DAY Priscilla walks through the empty rooms, taking a last look of where she grew up. It already feels like her past. CUT TO: EXT. GRACELAND PORCH - DAY Priscilla hugs Grandma, Alberta and   Patsy good-bye. They are emotional. INT. PRISCILLA'S CAR - AFTERNOON Close on Priscilla's face as she watches the Graceland gates slowly open. Tears in her eyes, we feel her fear and excitement. EXT. GRACELAND - AFTERNOON Priscilla's car passes through the gates and they close behind her. Dolly Parton sings “I Will Always Love You.” Priscilla drives off, leaving Graceland in the distance.",
      "dialogue_count": 0,
      "word_count": 486
    }
  ]
}