{
  "slug": "project-blue-book-101-the-fuller-dogfight-2019",
  "title": "project blue book 101 the fuller dogfight",
  "genre": "drama",
  "format": "series",
  "scenes_count": 7,
  "characters_count": 1,
  "characters": [
    "HYNEK"
  ],
  "total_words": 9770,
  "total_dialogue": 1,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. PARKING LOT/BEULAH PARK RACETRACK - MORNING Hynek stands by his car, alone in the vacant lot. A long grim look. At last, he retrieves an ENVELOPE from his glove box. EXT. TRACKSIDE/BEULAH PARK - LATER ROGER PERRY (50s), a showboating race track owner slowly counts the money in the envelope as Hynek gazes out at the first turn where some TRAINERS are working with a HORSE. ROGER PERRY Most’a my other clients ain’t so prompt. Specially when they lose. Then I gotta send my boys to accrue... can get messy. (looks up, smiles) But you come back any time. Luck always changes. He turns to go. Hynek holds for a beat, then: HYNEK You switched the feed. Roger stops, turns back --   huh?  HYNEK (CONT’D) To a cheaper brand, lacking lysine. It’s an amino acid I’d accounted for in my calculations. The weather, weight, jockey -- those were constants. You change his feed, my horse never has a chance. ROGER PERRY Chance? (chuckles) This is horse racing. Try going with your gut next time, not your head. Soon as you start trying to figure it all out, that’s when you get into real trouble... As Perry walks off, we PRE-LAP a SCHOOL BELL and SMASH TO: INT. CLASSROOM/OHIO STATE UNIVERSITY - DAY A lecture hall full of STRESSED STUDENTS all look up from their EXAMS to the front where Hynek has been watching them closely, no mercy.  BLUE BOOK - O'Leary - 08.23.17   12.",
      "characters": [
        "HYNEK"
      ],
      "action_text": "HYNEK Pencils down, leave your booklets on your desk and I’ll collect them. STUDENTS grumble, start to exit en masse. As Hynek moves to collect their work, the room emptying behind him: VOICE Dr. Hynek? HYNEK (without looking) Test time is over, I’m sorry-- VOICE Oh, I finished early... Hynek turns, finds a student, LISA (20), hovering behind him. LISA I just wanted you to know there was a typo. Page five? (off Hynek) Syzygy. There’s no ‘i’. In case someone got confused, or put in a wrong answer because of it. I know I’d hate that if it happened to me. Hynek considers her for a beat then opens the test up, scans the page. Finds the typo. Looks back. HYNEK Who are you? LISA Lisa Mahaffey. HYNEK ...You scored ninety-eight on the mid-term. LISA (pleased he knows her) Constellation, stellar classification and visual magnitude are my favorites. (then) And you make it fun. That throws Hynek for a beat before: HYNEK Thank you. For catching the typo. Lisa...  BLUE BOOK - O'Leary - 08.23.17   13. She smiles, nods and turns to go. Then: HYNEK (CONT’D) You really think I make it fun? LISA (the truth) No. But you do get what’s fun   about  astronomy. I mean... The stars are where we come from. You look out, you’re really looking in. Right? INT. HYNEK’S OFFICE - LATER Cluttered with books and celestial maps. Hynek enters, drops the stack of tests on his desk and sits. He contemplates the exams for a beat before his eyes drift to his trash can. He pulls it over, digs out a crumpled piece of paper. CLOSE ON THE PAPER It’s from the National Advisory Committee on Aeronautics. Words jump out. “Sorry to inform you... No relevant need at this time... poor evidence to support your claims...” VOICE How you holding up? Hynek looks up. Sees an older PROFESSOR in his doorway. PROFESSOR I just heard. Those grants are tough. Even the three I managed to get myself were... (trails off, then) You’ll keep trying though. HYNEK (fuck you) Can you get my door? Professor obliges, moves off as Hynek r",
      "dialogue_count": 1,
      "word_count": 2823
    },
    {
      "scene_number": 2,
      "slugline": "INT. MASTER BEDROOM/HYNEK HOME - SAME TIME Mimi removes her make-up at a vanity as Hynek finishes getting into his pajamas, watching her... Her shoulders... neck. The way she removes her earrings. Her skin, hair, eyes. The details of his wife -- HYNEK You’re breathtaking, you know that? She looks up, that caught her by surprise. Hynek comes over her shoulder now. HYNEK I don’t say that enough. She smiles and he leans down to kiss her neck. Lingers there then reaches for her waist... and she pulls away. MIMI Allen... I can’t. I’m sorry. HYNEK You have nothing to be sorry for. The doctor said it would take time. Your body went through a lot. And psychologically a loss is always... (then) When you’re ready to try again, we will. Okay? She gives him a reassuring smile then climbs into bed. Hynek joins her. The two of them reach over and turn off their lights. As they both turn to their side, we PRE-LAP: NEWS ANNOUNCER (V.O.) The sky is the stage, the actors, so-called flying saucers... 1951 TV ARCHIVAL FOOTAGE FLICKERS IN: Dramatic music plays. A TITLE CARD reads: ‘Nation Looks Skyward for Mysterious Riders’. Planes fly. NEWS ANNOUNCER And they’re back with some new twists! AN EYEWITNESS addresses the camera, holding a UFO photo. EYEWITNESS I managed to snap this when it flew over my house. Reminded me of two straw hats stuck together at the brim. See right here...?  BLUE BOOK - O'Leary - 08.23.17   25.",
      "characters": [],
      "action_text": "He points to the photo before we CUT TO: A CLEAN-SHAVEN MAN with a collared shirt speaking to camera. CLEAN-SHAVEN EYEWITNESS I saw this insanely bright white- green object in the sky... Now, I wouldn’t say it’s one of those so- called flying saucers, but whatever it was, it was NOT an illusion... Off his earnestness, we PRE-LAP the sound of a TRAIN WHISTLE and SMASH TO: EXT. COLUMBUS TRAIN STATION - DAY Establish the crowded station filled with PASSENGERS. INT. TRAIN - SAME TIME Hynek is settled in across from Ruppelt, making notes in an astronomy book as Ruppelt scans the faces on the train. He spots a GORGEOUS YOUNG WOMAN down the aisle, gives her a smile. She smiles back. Hynek looks up, sees this. RUPPELT I just love the railway, don’t you? Hynek refocuses on his book. Ruppelt reaches in his pocket. RUPPELT Gum? Hynek looks up. Ruppelt’s offering him a stick. RUPPELT (CONT’D) It’s sugar-free. They just started doin’ that. Swear you can’t taste the difference. HYNEK No, thank you. Ruppelt re-pockets the gum as he looks at the cover of the book Hynek’s reading. RUPPELT Astro-Particle Dynamics and Its Stellar Foundations... must be a real page turner, huh?  BLUE BOOK - O'Leary - 08.23.17   26. HYNEK It is, actually. Beat. RUPPELT So how long you been doing the teaching thing? HYNEK  Thing?   11 years. Not counting the 4 while I earned my doctorate. RUPPELT Wow... I hated school. No offense. HYNEK Why would I be offended? RUPPELT You just look like that kind of guy, I guess. A beat between them before Ruppelt reaches over, grabs a briefcase and places it between them, opens it. RUPPELT Well, Teach. Whaddya say we do some homework then? As he starts to pull out all sorts of files/books, we CUT TO: EXT. DOWNTOWN COLUMBUS - DEPARTMENT STORE - DAY Mimi moves down the block, slows when she sees a MOM MANIKIN in a storefront window gripping a new vacuum. “Moms Love the Hoover Upright!” It’s a scene meant to convey domestic bliss. But for Mimi, it’s more like coming upon ",
      "dialogue_count": 0,
      "word_count": 1239
    },
    {
      "scene_number": 3,
      "slugline": "INT. DEPARTMENT STORE - DAY In Men’s Wear now, Mimi and Susie pore over a sea of ties. MIMI What color are your husband’s eyes? SUSIE Hazel. No, brown. I always confuse the two. Mimi holds up a couple ties to compare, puts one back. SUSIE You’re so good at this. How long have you been married? MIMI Twelve years. SUSIE No... But you’re so young. (off Mimi) Children? MIMI ...Just one. Mimi grabs another tie, distracting herself. Susie sees this. She doesn’t miss a thing. But, she switches subjects. SUSIE So what does your husband do? MIMI He teaches. Astrophysics. SUSIE Should I pretend to know what that is? MIMI Worked for me for the past ten years. They both chuckle. Mimi stops on a tie. Turns, modeling it. SUSIE Oh, that’s perfect. Cal’s gonna flip. That’s when they both notice a POSTER nearby (REAL): It’s a NEAR-NAKED WOMAN cradling a man’s dress shoe: “Keep Her Where She Belongs,” it reads. Susie eyes Mimi’s appalled reaction.  BLUE BOOK - O'Leary - 08.23.17   31.",
      "characters": [],
      "action_text": "SUSIE Mimi, am I crazy, or do I smell apple pie? MIMI Oh, there’s a cafe in the back. SUSIE MILLER Get out! (off the poster re: cafe) Well, I think   that’s   where we belong, don’t you? Come on... As Susie takes her hand and leads her off, the song “High High The Moon” by Mary Ford PRE-LAPS and we CUT TO: INT. RENTAL CAR - HUDSON HORNET - DAY VROOM! MUSIC CONTINUES from the car radio as Ruppelt drives a sparkling 1951 Hudson Hornet, feeling the song, loving the breeze through the window. Hynek’s inspecting the dash. RUPPELT Sleek for a rental, right? They call this design ‘step-down.’ Lots of Senators drive these. HYNEK I don’t know. It’s far too low to be practical. And not very ergonomical. Ruppelt turns to him. HYNEK Do you not know what that means? RUPPELT (laughs) Boy, I bet your students   love   you. HYNEK The smart ones do. RUPPELT Just do me a favor, okay? Once we get to the farmhouse? Let me do the talking. As he TURNS UP THE RADIO to emphasise his point, hits the gas, we CUT TO:  BLUE BOOK - O'Leary - 08.23.17   32.",
      "dialogue_count": 0,
      "word_count": 371
    },
    {
      "scene_number": 4,
      "slugline": "EXT. ROAD - SAME TIME MUSIC CONTINUES as the car speeds along, the SONG carrying us down the road before we TIME CUT TO: EXT. KATHLEEN MAY’S FARMHOUSE - DAY A small group of PEOPLE are gathered near a CLOSED GATE including LOCAL PRESS as the Hudson Hornet turns down the long driveway and approaches. A LOCAL SHERIFF waves it to a stop. FROM AFAR, we watch as Ruppelt rolls down his window to speak to the Sheriff. A beat later the car moves on toward THE FARMHOUSE Where it parks. Ruppelt and Hynek step out, scan the area. RUPPELT I grew up in a spot like this... HYNEK (looking back at the gathering) Is   that   gonna be a problem? RUPPELT If they are, I’m authorized to shoot them. (off Hynek) C’mon... Hynek stares at him. Was that a joke? Ruppelt heads up to THE FRONT DOOR KNOCK-KNOCK. No answer. Then Hynek sees a woman’s face peek out of the living room curtains to the left. HYNEK Afternoon, ma’am. We’re here to-- RUPPELT (cutting in) Kathleen? It’s Captain Ruppelt? We spoke on the phone? KATHLEEN (re: Hynek) Who’s this one? RUPPELT This is Doctor Hynek. We work together. Could you open the door?  BLUE BOOK - O'Leary - 08.23.17   33.",
      "characters": [],
      "action_text": "Kathleen whips the curtain closed. A beat later the front door opens and Kathleen reaches for Hynek. KATHLEEN You a doctor? Follow me. EXT. KATHLEEN’S BARN YARD - MOMENTS LATER Kathleen leads Ruppelt and Hynek to a big barn door, heaves it open and the trio enters: INT. BARN - CONTINUOUS Stacks of hay have blocked out all the windows, so it’s dark in here. Even DARKER when Kathleen closes the door. Hynek’s just trying to get his bearings when a small CHICK runs over his foot. Hynek jumps back, bumps into some saddles. KATHLEEN Mind where you walk, they’re everywhere. She motions for Ruppelt and Hynek to follow her past a couple sheep, a horse, and some goats. KATHLEEN (CONT’D) Had to move ‘em in here. The sunlight burns their eyes now... She comes to a ladder leading to a LOFT, calls up: KATHLEEN (CONT’D) Lily, Will, it’s all right. You can come down. There’s a doctor here. Hynek and Ruppelt step back as Will and Lily descend from the darkness. But when they land, the real shock sets in. KATHLEEN (CONT’D) Please, doctor, tell me what’s happening to my babies... REVEAL NOW - the children are gaunt, pale and petrified. But most prominent are the painful RED BLISTERING SORES festering around their eyes. Off Hynek and Ruppelt, we... END ACT TWO  BLUE BOOK - O'Leary - 08.23.17   34. ACT THREE INT. DEN/KATHLEEN MAY’S FARM HOUSE - DAY Hynek uses a Q-tip to swab ointment over the children’s burns as Ruppelt and Kathleen speak in the background. HYNEK Does that hurt? (off Will) Y’know I got a boy about your age. You read comics? What’s your favorite? WILL  Journey into Unknown Worlds.  (then, leans in) I’m not supposed to. My mom says I can’t read it, ‘cause sometimes I get scared. But only   sometimes ... HYNEK Oh... Well, I understand that. But, don’t worry. I won’t say a word... Off Will’s smile, we MOVE TO -- RUPPELT As he takes notes while Kathleen speaks, hands shaking. KATHLEEN It felt alive, whatever it was. Its flames ravaging trees. Feeding... Smelt like compost. B",
      "dialogue_count": 0,
      "word_count": 647
    },
    {
      "scene_number": 5,
      "slugline": "EXT. RAVINE - LATER The trio approaches from the top of the hill where Kathleen and the kids first encountered the fire. But Kathleen stops. She won’t go any further. KATHLEEN It was down there... Ruppelt and Hynek stare at the VALLEY below... The charred trees... The scorched earth. Remnants of Armageddon. KATHLEEN (CONT’D) It was fire from Hell. And only by God’s Grace was I able to free my son from the Devil’s claws... As Hynek stares deeper INTO THE RAVINE, we ZOOM IN on his eyes (just like at the observatory) as we realize, just like then, he’s moving HIS MIND BACK IN TIME to --  THE BURNING WOODS (FLASHBACK) The moment after Will fell. Kathleen and Lily are searching, SCREAMING FOR WILL as swaying FIRE-TREES HISS and SNAP. They finally find Will and lift a branch off him to help him up. KATHLEEN (V.O.) (CONT’D) But, when that smoke cleared, this horrid thing smiled back at us... The smoke clears and for the first time we glimpse a truly horrifying, melting RED FORM. KATHLEEN   (V.O.) (CONT’D) It was the size of a house with lava pouring from its heart. Was like a raging... red diamond...  CAMERA PUSHES so close to its pulsing diamond-like shape, it’s like we can feel its heat before we SMASH BACK TO HYNEK Coming out of his vision as Kathleen finishes her story. KATHLEEN (CONT’D) But then the angels gave us wings, and we ran for our lives. (off the two men) So, what are y’all gonna do now? Hynek (who had been carrying a bag), zips it open to double check his inventory before he slings it over his shoulder.  BLUE BOOK - O'Leary - 08.23.17   36.",
      "characters": [],
      "action_text": "HYNEK See what we can find. Captain? Without waiting for a reply, Hynek heads down into the ravine. Off Ruppelt, a little more tentative, we PRE-LAP: SUSIE (V.O.) My Lord, this is an aphrodisiac! INT. CAFE/DEPARTMENT STORE - DAY Mimi and Susie sit in the store cafe, eating apple pies. SUSIE I’m getting flushed it’s so good. Mimi laughs aloud, embarrassed as patrons give them looks. MIMI Do you miss living in New York? SUSIE Oh, only every day. Ohio’s been an adjustment. MIMI So’s marriage... Mimi suddenly looks down.   Did she just say too much?  SUSIE Mimi... Where are the fun spots in this town? And if you say the roller-rink, I’m’a squeal. MIMI I’m not the best one to ask. Allen and I don’t get out that much anymore. We used to Rumba down at the Rec Center... SUSIE Oh, I love to dance. MIMI It’s been harder to go. He works so much. He actually just took on another job. SUSIE MILLER You’re kidding. Doing what?  BLUE BOOK - O'Leary - 08.23.17   37. MIMI I can’t really talk about it. Susie studies Mimi intently, an idea forming. SUSIE Know the best thing about dining with a stranger? No need for niceties. (stands) I have an idea...c’mon. INT. WEST VIRGINIA WOODS - DAY Hynek and Ruppelt are moving slowly through the charred woods, scanning, taking notes when Hynek stops suddenly. HYNEK You smell that? Sulfur. Ruppelt sniffs, not sure he smells anything. He turns to follow a long stain of black ash, but freezes when he sees A FIGURE IN A FEDORA Maybe a hundred yards away on a distant road, standing outside his car, watching them. Let’s call him MR. UNSEEN. Ruppelt squints, between the trees, trying to make him out. But when moves to get a better look, Mr. Unseen is suddenly not there. That’s odd. HYNEK (O.S.) Captain...? Ruppelt turns back. HYNEK Look at this. Ruppelt walks over to where Hynek is studying a tree. HYNEK Tree bark’s usually a natural insulator in a fire. But see how deep these singe marks go? He follows them down to the base of the tree, gears turning. ",
      "dialogue_count": 0,
      "word_count": 2008
    },
    {
      "scene_number": 6,
      "slugline": "INT. LIVING ROOM/FARMHOUSE - LATER It’s late. Ruppelt snores, asleep on the couch, case file still in his hand. Hynek is making notes trying to concentrate, but the snoring is distracting. He looks over, contemplates waking Ruppelt, but sees something peeking out from under a couch cushion instead. Slowly, Hynek slides it out -- it’s the   Journey into Unknown Worlds   comic book. It gives Hynek a slight smile. He opens it, flips through and panels of the comic scroll by. Then Hynek stops, gears turning, something’s clicking in for him. He looks over at the drawing on the newspaper headline once more and IMAGES FLASH HIS MIND   -- TREES, GLOWING YELLOW EYES, RAZOR CLAWS, metal tubes embedded into scaled skin. A mouth SNAPS CLOSED.  Hynek snaps out of his vision, rouses Ruppelt. HYNEK Ed, get up. Think I got something. EXT. FARMHOUSE - MOMENTS LATER Still half-asleep, Ruppelt stands between the barn and the farmhouse, watching as Hynek exits the barn. RUPPELT What were you doing in there? Hynek just keeps moving, forcing Ruppelt to follow. EXT. WEST VIRGINIA WOODS - NIGHT Flashlights in hand, the two trudge towards the ‘crash site’. RUPPELT Look, can’t we say the fumes from the meteor caused hallucinations? That’d make sense, right? HYNEK A result doesn’t need to make sense to be true. But it does need to be proven by science before it can ever be called a fact... So, that’s what we have to do here, Captain. Discover the facts...  BLUE BOOK - O'Leary - 08.23.17   45.",
      "characters": [],
      "action_text": "Off Ruppelt, Hynek reaches into his jacket pocket, pulls out a scared BABY CHICK. RUPPELT And to do that, you stole a baby chicken...? Hynek shushes him as he places the chick on the ground. But it’s not until Hynek starts making odd SHRIEKING SOUNDS that Ruppelt thinks he’s really crazy. RUPPELT (CONT’D) Alright,   now   I’m worried about you. Hynek calls again: CA-CAW! Waits. Suddenly from the darkness there comes a SHRIEEEK! RUPPELT ...What was that? CA-CAW! Hynek caws once again. SHRIEK! It’s MUCH CLOSER now. Ruppelt eyes dart to the sky when WOOSH! SOMETHING HUGE descends from above! Ruppelt drops to the ground as-- A GIGANTIC OWL SWOOPS DOWN to snatch the Baby Chick. Hynek dives to protect it and the Owl shoots back up, lands on a nearby branch. RUPPELT (CONT’D) I’ll be damned... Getting up now, he and Hynek move close to the branch where Hynek shines his flashlight up, casting an eerie glow on the Owl’s yellow eyes, his razor-sharp beak and prominent claws. It’s a “monster” from their angle. HYNEK I give you...our forest monster. RUPPELT You’re a god-damned genius. EXT. TOWN SQUARE - MORNING Farmers, policemen, and news reporters gather in the town square. On a platform, Ruppelt stands with Kathleen, Lily and Will, wrapping up his address.  BLUE BOOK - O'Leary - 08.23.17   46. RUPPELT ...So you see, it was entirely reasonable for Kathleen and her children to assume that something extraordinary happened that night. Because it did! A meteor that size? It’s like being struck by lightning. Twice! Ruppelt looks to Kathleen, Lily and Will. RUPPELT (CONT’D) Oh, and as for that mystery creature from the sky? Sheriff... TWO COPS carry up a large object, covered by a bright yellow tarp. They place it on stage and Ruppelt yanks the tarp away revealing the SPECKLED OWL in a cage. As Ruppelt holds Lily’s NEWSPAPER SKETCH of the creature by the caged owl’s face: RUPPELT (CONT’D) I think we got our man. As the Crowd   oohs   and   ahhs , CAMERA MOVES to discover HYNEK Acros",
      "dialogue_count": 0,
      "word_count": 685
    },
    {
      "scene_number": 7,
      "slugline": "EXT. THE TOWN SQUARE - SAME TIME Ruppelt is posing for pictures now with Kathleen and the Owl. As FLASHBULBS POP, we shift perspective ACROSS THE STREET To where a BLACK BENTLEY sits. Inside is a FIGURE IN A FEDORA WHOSE FACE WE DON’T SEE, his black gloved hands resting on the steering wheel. He watches the spectacle closely, then turns to focus on Hynek who’s still on his call. As he pulls his hat lower and opens the door to get out, we notice Lily’s ORIGINAL SKETCH on the seat next to him before we are ON A SIDE STREET Lily and Will approach their mom’s truck, happy to be away from the commotion behind them. WILL Lil... Do you think it really was just an owl? Lily opens the truck’s door, digs around inside. LILY Nope. (turns back, shows Will) Nickel. Gonna buy a soda pop. Will watches her go, then spots his slinky on the front seat. He grabs it and quickly moves to a set of stairs, heads to the top so he can make it walk on down. CLOSE ON THE SLINKY now as it drops down each step...drop... drop...drop... before landing on a SHINY BLACK SHOE. A gloved hand picks it up -- that UNSEEN MAN. Will looks up, uneasy. WILL ...You’re that reporter guy. Mr. Unseen hands Will back his slinky and, as he bends down, WHISPERS SOMETHING to him, never showing us his face. EXT. TOWN SQUARE - CONTINOUS Hynek has rejoined Kathleen and Ruppelt, puffing on his pipe. HYNEK I thought I was gonna get my picture taken?  BLUE BOOK - O'Leary - 08.23.17   48.",
      "characters": [],
      "action_text": "RUPPELT No, I see you as more of a behind- the-scenes kinda guy. Hynek seems genuinely disappointed. Then the CROWD CHEERS. All three turn just as the owl is freed from its cage. As it CAWS into the sky, Hynek watching it soar, Kathleen turns back. KATHLEEN I really ought to be gettin’ back. (then) Thank you both for all your help. God sure works in mysterious ways. She moves off, quickly blending into the dispersing CROWD. Ruppelt turns to Hynek. RUPPELT Mysterious indeed, huh? (then) You a religious man at all, Doc? Did we cover that? HYNEK ...Like, do I believe in god? RUPPELT Or does He have to be “proven by science to exist” in your eyes? Hynek doesn’t answer, clearly struggling with the question. RUPPELT (CONT’D) I don’t need a grant essay. I was just curious. (then) I’m outta smokes, gonna grab some. Meet you at the car? And with that Ruppelt moves off. Hynek watches him go, then heads off towards THE RENTAL CAR Where he finds Will sitting on the curb, staring at his slinky, slowly rocking it in his hands. HYNEK I think your mother’s looking for you... Will hasn’t even acknowledged him. That’s odd.  BLUE BOOK - O'Leary - 08.23.17   49. HYNEK (CONT’D) Will? Hynek touches Will’s shoulder and the boy holds out his hand. WILL He told me to give this to you. Said you better not tell anyone... Hynek looks down, sees Will has given him a POLAROID: It’s a grainy image of A LAKE WITH A TINY ISLAND WITH A TREE ON IT. It takes a second to register, but clearly this photo means something to Hynek.   And it unnerves him . HYNEK Who? Who gave this to you? WILL That weird man... With the hat. (leaning, in a whisper) He says the truth is like the sun. The closer you look, the more it blinds... Hynek is speechless. But, before he can even figure out what to do, Will darts off and quickly joins his mom who scoops him into THE TRUCK. And as they speed off, Hynek is left completely dumbfounded, alone with that Polaroid, as we -- END ACT FOUR  BLUE BOOK - O'Leary - 08.23.17   50.",
      "dialogue_count": 0,
      "word_count": 1997
    }
  ]
}