{
  "slug": "promising-young-woman-2020",
  "title": "promising young woman",
  "genre": "drama",
  "format": "film",
  "scenes_count": 10,
  "characters_count": 0,
  "characters": [],
  "total_words": 18647,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. SWEET SIXTEEN’S DANCEFLOOR - NIGHT A super-depressing dancefloor on a Thursday night. 2-For-1 shots and a sticky floor. The kind of last-resort place people end up after work having accidentally nailed ten “just one” drinks. A bored DJ plays the DROELOE remix of “Boys” by Charlie XCX, while the thin and kind of tragic crowd dances. We linger on the men dancing in particular, their bodies, the sweat running down their backs as they grind and thrust. The slow-mo, the lascivious pan-up, the sort of erotic gaze normally reserved for oiled-up music-video hotties. Except we’re looking at regular dudes in chinos with absolutely no dancing ability. INT. SWEET SIXTEEN’S UPSTAIRS BAR - NIGHT By the bar, is a group of guys still in their work suits, ties loosened. They’re mostly good-looking, in their early- thirties, bantering and eyeing up the diminishing talent pool. Among them are JEZ, a shy, sweet guy who is clearly dying to leave, and PAUL, a sweaty Alpha-bro whose super- fragile masculinity is always one rejection away from shattering to pieces. PAUL Fuck her, man. It’s how things are done. It’s just a fucking round of golf! You’d think we were taking clients to a strip club or something- JIM -which we can’t anymore- PAUL -Exactly we can’t even do that anymore because of last year’s Christmas party. JEZ I think it’s because the golf club doesn’t let women play there. The guys stare at JEZ. PAUL So? 1",
      "characters": [],
      "action_text": "JEZ So...it means we’re having client meetings without her. 2 PAUL Look she should focus on closing her own shit. Not whining because we’re all doing better than her. Something catches PAUL’S eye. PAUL (CONT'D) Jesus. The guys follow his gaze. Across the club, sprawled on a damp leather sofa is CASSANDRA, late-20s. She is hammered, her hair plastered to her face, mascara under her glazed eyes, the skirt of her pinstriped work suit riding up. PAUL (CONT'D) Look at that. God almighty. Get some dignity, sweetheart. The guys all laugh, except JEZ. PAUL (CONT'D) You know. They put   themselves   in danger, girls like that. If she’s not careful someone’s going to take advantage and then she’ll be the one in tears tomorrow morning. JIM She’s kinda hot. PAUL She’s a hot fucking mess. CASSANDRA moves on the sofa, we see her underwear. PAUL (CONT'D) I mean look at that. PAUL sneers. They all look. We feel that slow, animal shift in the group, from disgust to desire, to a heady sense of opportunity. JEZ (trying to divert attention) Hey guys, I was thinking maybe we should talk to Brian again. I think he might be coming round to- The guys aren’t listening. They are all mesmerized by CASSANDRA and the possibility she represents. 3 PAUL I’m sorry that is   asking   for it. You’d think you’d know better by her age, wouldn’t you? Where are her friends? Fucked off somewhere and left her lying around for anyone to pick up. JIM Sounds like a challenge, Paul. PAUL eyes her up, thinking. PAUL Yeah. Maybe. JEZ intervenes. JEZ I’ll go over. The guys whoop. PAUL Ooooooh! JIM Didn’t know you had it in you! JEZ  To see if she’s ok.  PAUL Sure, sure. Mmmm-hmmm. Absolutely. PAUL winks. INT. SWEET SIXTEEN’S UPSTAIRS BAR - MOMENTS LATER CASSANDRA is haphazardly looking through her purse. JEZ approaches. JEZ You ok? What are you looking for? CASSANDRA looks up woozily. CASSANDRA Phone. JEZ sits down next to her. CASSANDRA continues to look. 4 CASSANDRA (CONT'D) S’not here. She starts to look arou",
      "dialogue_count": 0,
      "word_count": 3501
    },
    {
      "scene_number": 2,
      "slugline": "INT. NEIL'S APARTMENT - LATER A few minutes later and NEIL is bringing back a glass of water. CASSANDRA is passed out face down on the couch. He looks at her, sleeping. He’s kind of annoyed. Then- He nudges her. NEIL (gentle) Hey. She stirs. NEIL (CONT'D) (louder) Hey! She wakes. NEIL (CONT'D) (quiet again, sappy) There you are! Hi. You fell asleep. He gives her the water, she drinks it. NEIL (CONT'D) Good girl. He takes the glass from her hand. Strokes her back. NEIL (CONT'D) Feel better? CASSANDRA No. NEIL You know, I nearly didn’t come out tonight. I’m so glad I did. I feel such a connection to you. CASSANDRA Could you call me a cab? NEIL You just got here! CASSANDRA I should go. 24",
      "characters": [],
      "action_text": "NEIL Don’t go...come on...we’re having fun, aren’t we? He kisses her gently. CASSANDRA I... NEIL We can play hooky tomorrow, stay in bed all day. I’ll make you breakfast... Eggs Benedict. I make my own... (French pronunciation) ... hollandaise . He kisses her neck. She is rigid. He ignores it. NEIL (CONT'D) You are so amazing. His hand moves up her leg. CASSANDRA I need to go... NEIL (kissing) You don’t wanna go home. C’mon. His hand is up her skirt. She drops the act. CASSANDRA Hey. Neil. He ignores her. She grabs his face and stares into his eyes. CASSANDRA (CONT'D) I said: I need to go home. NEIL stares at her for a second and then jumps away from her. NEIL Holy shit! He’s practically on the other side of the room. CASSANDRA What? 25 NEIL Woah. What...what is this? Are you some kind of psycho or something? CASSANDRA Why d’you say that? NEIL I thought you were... CASSANDRA Drunk? NEIL Yeah! CASSANDRA Really drunk? He falters a little here. NEIL I guess...yeah. CASSANDRA Well, I’m not. But that’s good, isn’t it? NEIL is starting to panic. NEIL You should leave. CASSANDRA Oh now you want me to leave? NEIL No I...Look I’m really high. Like. Really high. I don’t know what I’m doing. You should go. She walks towards him. He backs away from her. CASSANDRA I mean, a second ago you were determined for me to stay. Pretty insistent actually. NEIL (begging) I’m a nice guy- CASSANDRA Are you? 26 BEAT. 27 NEIL I thought we had a connection, I guess. CASSANDRA A connection? OK. What do I do for a living? No response. CASSANDRA (CONT'D) Sorry. Maybe that one’s too hard. How old am I? How long have I lived in the city? What are my hobbies? (beat) What’s my name? NEIL cannot answer. CASSANDRA (CONT'D) You’re right! This connection is electric! (beat) Of course, I know all about you. Your mom, your sister, your job at a digital marketing agency which it sounds like you completely suck at, by the way, and, oh yeah... (she stifles a smile) Your novel. Good luck with that, sounds like",
      "dialogue_count": 0,
      "word_count": 753
    },
    {
      "scene_number": 3,
      "slugline": "INT. CASSANDRA’S HOUSE - BEDROOM - NIGHT CASSANDRA adds a little line to her book. Writes the name “Neil”. She sighs. All those names. She looks over at a picture on her bedside table. Two young girls hugging each other. She smiles. CASSANDRA Night, Nina. She turns out the light. INT. CASSANDRA'S HOUSE - KITCHEN - MORNING CASSANDRA arrives at breakfast. STANLEY is reading the paper silently, SUSAN is eating neatly. There’s a large, neatly wrapped present in CASSANDRA’S place. She looks at her father: nothing. CASSANDRA What’s this? Silence. CASSANDRA (CONT'D) Mom, what’s this? SUSAN What do you mean? CASSANDRA This gift! Beat. SUSAN It’s your birthday, Cassie. CASSANDRA had completely forgotten. CASSANDRA Oh... yeah. There is a tense silence. SUSAN is suddenly on the verge of tears. STANLEY (gentle, to SUSAN) Hey... SUSAN What kind of person forgets their 30th birthday? 30",
      "characters": [],
      "action_text": "STANLEY Sweetheart- 31 SUSAN Don’t, Stanley. CASSANDRA It was a mistake, Mom. You know I’m terrible with dates. It’s not a big deal. SUSAN Not a big deal? Not a big deal. You just forgot your birthday! Not a big deal. Ok! You don’t want to have a party? Don’t want to see your friends? CASSANDRA (dry) You know I don’t have any friends, Mom. SUSAN Don’t joke about it! You know how strange that is? You still living at home, working in that stupid coffee shop? Out all hours of the night doing god only knows what. No boyfriend. No friends. CASSANDRA Mom! You should have saved all this for my birthday card! STANLEY Let the kid celebrate how she wants to- SUSAN Celebrate! Is this a celebration? (beat) My friends all ask about you and I don’t know what to tell them. All their children are getting married, having kids. I don’t know what happened... A tense silence. They all know what happened. STANLEY Why don’t you open your gift, honey? CASSANDRA calmly opens her present. It is a large, beautiful suitcase. 32 INT. MAKE ME COFFEE SHOP - AFTERNOON CASSANDRA and GAIL are unpacking boxes. GAIL Woah. CASSANDRA Yeah. GAIL That’s direct. CASSANDRA A reeeal kick in the cunt. GAIL Is it a nice suitcase, at least? CASSANDRA Oh yeah it’s definitely the fanciest “get the fuck out of our house” metaphor I’ve received so far. Beat. GAIL Then why don’t you? CASSANDRA What? GAIL Get out of their house? Just...I don’t know...go on Zillow, or Single White Female some girl, or get a basement room in a weird guy’s house. Anything! CASSANDRA I can’t afford it, Gail. Not on what you pay me. Not even a weird guy’s basement. GAIL So take this other job then. Take any job. CASSANDRA Are you firing me? GAIL Maybe I should. 33 Beat. 34 CASSANDRA Look. You’re making the assumption that I want any of it. If I wanted a boyfriend and a yoga class and a house and kids and a job my mom could brag about I’d have done it. You don’t think I could walk into any bar in this city wearing an adorable floral dress",
      "dialogue_count": 0,
      "word_count": 802
    },
    {
      "scene_number": 4,
      "slugline": "INT. CASSANDRA'S HOUSE - HALLWAY - DAY CASSANDRA is wearing a pretty, slightly-too-short floral dress. She creeps across the hallway, trying to avoid her parents who are watching tv in the tv room. SUSAN (O.S.) You’re dressed up. Busted. SUSAN (CONT'D) Where are you going? CASSANDRA I’m going out for lunch. Her parents look at her, surprised. SUSAN With who? CASSANDRA A friend. STANLEY You look very pretty. CASSANDRA is a little shy suddenly. CASSANDRA Thanks, dad. She leaves. Her parents look at one another. They can barely dare to hope. INT. THE HAWT DOG - DAY CASSANDRA and RYAN are mid-date and it’s going well. CASSANDRA How did she get a skeleton’s hand up there? RYAN She stole it from a teaching model. And here’s the worst part, she looked at me right in the eyes, took it out ...and waved it at me. CASSANDRA pushes her food away. 37",
      "characters": [],
      "action_text": "CASSANDRA And I am done. RYAN And I am wondering why I started telling that story... 38 CASSANDRA Hey, there is nothing more romantic than a disturbed woman pulling a skeleton’s hand out of her vagina. RYAN That’s true. CASSANDRA People never pull anything out of anywhere where I work. RYAN So, yeah, you didn’t want to... CASSANDRA What? RYAN Carry on with med school? CASSANDRA goes back to her food. CASSANDRA Nah. RYAN Why not? CASSANDRA I wanted to do something else. RYAN Really? What? CASSANDRA I don’t know. RYAN You were so good though. You knew everything. CASSANDRA I didn’t know everything. RYAN You did! You were brilliant! I was terrible. Remember when I accidentally removed the wrong kidney from my cadaver? 39 CASSANDRA (proud) And look at you now. Operating on children. RYAN laughs. RYAN Yeah. I got better. But you, you were always way ahead of everybody. You’d have been a fantastic doctor. CASSANDRA Just. Didn’t want it anymore, I guess. CASSANDRA shrugs. RYAN senses he’s crossed a line. RYAN Hey, you want coffee? Movie starts in half an hour. I can tell you about the guy who got his dick trapped in a tambourine. EXT. RYAN’S APARTMENT - EVENING RYAN and CASSANDRA are walking down the street. There’s a somewhat awkward, expectant silence. RYAN You think we look like father and daughter from behind? CASSANDRA laughs. RYAN (CONT'D) I always worry about that. Bystanders screaming when I lean in to kiss someone. “Get your hands of that child...oh...sorry sir.” CASSANDRA I mean, don’t be so tall would be my argument. It’s kind of...flashy. RYAN Yeah? CASSANDRA Showing off. He laughs. 40 RYAN Oh. This is a weird coincidence. CASSANDRA What? RYAN I think this is...yep! Huh. This is my apartment. CASSANDRA immediately cools. The wall goes right up. CASSANDRA That   is   weird. What a weird, weird coincidence. RYAN I mean...since we’re already here. You wanna come up for a drink? I could clumsily try to seduce you? CASSANDRA (coldly) Sure. Why not. 41 RYAN Oh. It’s ",
      "dialogue_count": 0,
      "word_count": 793
    },
    {
      "scene_number": 5,
      "slugline": "INT. BATHORY HOSPITAL - WAITING ROOM -   EVENING A red balloon floats in the corner of a ceiling. We reveal CASSANDRA looking up at it. She’s sitting in a hospital waiting room with a few patients. RYAN (O.S.) Cassie! She looks up, RYAN is walking over to her. RYAN (CONT'D) What are you doing here? She stands. CASSANDRA I just came to pick up my herpes medication. RYAN You have herpes too. That saves us an awkward conversation later. The MOTHER of a tragic-looking CHILD PATIENT looks over disapprovingly. CASSANDRA So. I came here to see you. Obviously. (deep breath) I’m not good at this stuff. I’m trying. RYAN If you’re not interested- CASSANDRA No it’s not that. RYAN You sure? She nods. CASSANDRA (huge effort) So, I’d like to see you again...if that’s cool. But we’ll need to take it slow. I understand if- RYAN Of course that’s cool. 44",
      "characters": [],
      "action_text": "CASSANDRA Thank you. RYAN What are you doing now? You wanna go somewhere? Get dinner? 45 CASSANDRA Aren’t you working? RYAN Eh, it’s only a kid with leukemia. He can wait. (beat) I’m kidding. My shift has finished. Let me just get my stuff. CASSANDRA is watching him, she can barely stop smiling. INT. MAKE ME COFFEE SHOP - DAY GAIL and CASSANDRA are cleaning the shop listening to the radio. CASSANDRA starts humming along. GAIL stares at her. GAIL Oh my god. CASSANDRA What? GAIL Are you seeing that guy? CASSANDRA No! Beat. GAIL Good for you. CASSANDRA feigns outrage, but is delighted. INT. MAKE ME COFFEE SHOP - EVENING RYAN is waiting at a table a little awkwardly as GAIL scrutinizes him. CASSANDRA locks up. GAIL You ever kill someone? RYAN What? GAIL You know, operating on them. 46 RYAN No! GAIL Really? RYAN I mean...patients have died during surgery, of course- GAIL So that’s a yes. CASSANDRA Gail! Stop asking Ryan if he’s killed anyone! GAIL nonchalantly removes the remaining coffee cups from the table as Cassie comes over to sit with Ryan. GAIL I’ll stop asking him when he stops killing people. RYAN That does seem fair. GAIL Ok. I’m leaving you lovebirds to it. Can you lock up, honey? CASSANDRA Course. GAIL puts the cups on the counter. GAIL If you have sex on the counter, the bleach is in the back room. I don’t want to find ass prints in the coffee grinds tomorrow morning. (bright) Night! She leaves the coffee shop. RYAN and CASSIE sit awkwardly. RYAN She seems nice! CASSIE laughs. CASSANDRA She is. She’s a good friend. 47 RYAN Are you friends with anyone from Forrest still? Beat. CASSANDRA No. RYAN Really? No one? CASSANDRA Really. No one. RYAN I can’t seem to shake them off. CASSANDRA (ew) You still hang out with those guys? RYAN They’re not that bad! You know Madison McPhee just had twins? Beat. CASSANDRA I don’t remember Madison. RYAN I thought you were close? CASSANDRA Nope. RYAN Huh. Oh yeah, oh my god, Al Monroe is marrying some kind of model. She was in a",
      "dialogue_count": 0,
      "word_count": 4885
    },
    {
      "scene_number": 6,
      "slugline": "EXT. BLUE STAR BAR - LATER PAUL, wearing a fedora, is walking CASSANDRA out, her head is lolling. PAUL looks at his phone. PAUL Fucking surge prices. He looks at CASSANDRA, barely upright. PAUL (CONT'D) It’s not that far, can you walk? CASSANDRA Um. I don’t know... PAUL Good girl. They start to walk, PAUL’s practically holding her up. Then- RYAN (O.S.) Cassie? CASSANDRA turns around. RYAN is on his way into the bar. He looks at her, shocked. CASSANDRA immediately sobers up. Well. She’s not completely sober this time. CASSANDRA What are you doing here? RYAN I’m meeting some friends. (beat) Since my diary opened up last minute. CASSANDRA Let me explain. RYAN No need. Seriously. PAUL looks between them: awkward! PAUL Sorry, dude, I didn’t know she was taken. She’s all yours. RYAN looks at PAUL, disgusted. RYAN All mine? Do you even know her name? 80",
      "characters": [],
      "action_text": "PAUL steps back nervously, racking his brains. 81 PAUL Um...Claire...? CASSANDRA tries to diffuse this. CASSANDRA Eh. Pretty close... RYAN looks at her, shocked. Shakes his head. RYAN Ok. Have a good night. CASSANDRA Don’t go. I’m sorry. Wait. RYAN Could have just told me you weren’t interested, Cassie. RYAN leaves. PAUL is giggling. PAUL ICE COLD!!!! That was humiliating! CASSIE turns on him. CASSANDRA Why don’t you just fuck off now ok? Paul looks at her. PAUL Wait. Are you sober? (realizing) Oh my god. You’re the psycho who went home with Jez. Beat. CASSANDRA I don’t know what you’re talking about. PAUL Shit. Take your crazy elsewhere, sweetheart. Not interested. You’re not even that hot. CASSANDRA is deadly calm. CASSANDRA You’re hardly dropping panties yourself, Paul.  (MORE) 82 CASSANDRA (CONT'D)  When was the last time you scored with someone in daylight? 83 Beat. PAUL Careful. She takes a step towards him. CASSANDRA No.   You   be careful. I’m not the only one who does this, you know? And some of the other girls...they really are crazy. He backs away a little, nervously. PAUL I don’t believe you. CASSANDRA There’s a woman in   this city   who carries a pair of scissors. (she glances down at his crotch) Personally, I think she’s taking it a little far but... PAUL (scared) You’re lying. CASSIE shrugs. CASSANDRA Then try it out next time you go out. See what happens. PAUL looks at her, he’s a little upset. PAUL Why do you all have to ruin everything?? He runs off. She watches him go. Her eyes gleaming in the neon of the club lights. INT. CASSANDRA’S HOUSE - BEDROOM - DAY The following morning, and things are looking bleak in the cold light of day. CASSIE looks down at her book. She’s starting to look and feel a little scary. 84 A new name: JORDAN GREEN. She dials the number next to it. RECEPTIONIST (O.S.) Halder Mackenzie Green. CASSANDRA Hi. I’d like to book an appointment with Jordan Green, please. RECEPTIONIST (O.S.) I’m sorry, ma’am. Mr Green is on sabbatic",
      "dialogue_count": 0,
      "word_count": 1947
    },
    {
      "scene_number": 7,
      "slugline": "INT. MAKE ME COFFEE SHOP - EVENING CASSANDRA is alone. The bell rings, she doesn’t look up. CASSANDRA We’re closed for the night. RYAN (O.S.) Good. CASSANDRA looks up. RYAN is standing in front of her. CASSANDRA Hi. RYAN You wanna go to dinner you miserable asshole? CASSANDRA smiles. CASSANDRA Yeah. He kisses her. It’s wonderful. INT. PHARMACY - DAY That weekend. CASSIE and RYAN are choosing snacks at the pharmacy when Paris Hilton’s “Stars Are Blind” comes on the speaker. RYAN starts to nod his head slightly to the music, CASSIE notices: Paris Hilton, huh? Then suddenly RYAN bursts into a vamping lip synch, using the snacks as props. CASSIE ties not to be impressed but it’s hard, she’s giggling, people are looking. Then finally, she joins in. CUT TO: INT. RYAN’S APARTMENT - BEDROOM - NIGHT MONTAGE: CASSIE and RYAN watching movies in bed eating the pharmacy snacks, as Paris Hilton serenades us. INT. RYAN’S APARTMENT - BEDROOM - DAY MONTAGE: Pt. 1: CASSIE and RYAN kissing in bed. 95",
      "characters": [],
      "action_text": "Pt. 2: CASSIE reading in RYAN’S chair as he tries not to stare at her. Pt. 3: RYAN and CASSIE eating cereal, talking. 96",
      "dialogue_count": 0,
      "word_count": 197
    },
    {
      "scene_number": 8,
      "slugline": "INT. MAKE ME COFFEE SHOP - DAY MONTAGE: CASSIE and RYAN kissing as CASSIE sits on the counter. INT. MAKE ME COFFEE SHOP - DAY MONTAGE: CASSIE, RYAN, and GAIL are eating cupcakes. GAIL immensely relieved to see CASSIE so happy. BACK TO: INT. PHARMACY - MOMENTS LATER “Stars are Blind” is winding down. CASSIE and RYAN go to pay for their stuff. RYAN God, I love that song. CASSANDRA Of course. It’s a masterpiece. INT. CASSANDRA’S HOUSE - DINING ROOM - NIGHT SUSAN brings a big bowl of salad from the kitchen and sets it down on the dining room table. Where CASSANDRA, RYAN and STANLEY are waiting somewhat nervously, bowls full of spaghetti in front of them. It’s a little awkward. SUSAN Eat! Eat! It’ll get cold. RYAN This looks delicious. Thank you! STANLEY I made the sauce! Cassie winces. She forgotten what it’s like to introduce people to your parents. STANLEY (CONT'D) Wow. That is...really great sauce. Stanley beams. SUSAN So you’re a doctor, Ryan? You’re parents must be very proud! 97",
      "characters": [],
      "action_text": "RYAN Oh no. They wanted me to be a DJ. Beat. Then STANLEY and SUSAN laugh. Tension broken. The relief. STANLEY He’s funny! You didn’t say he was funny, Cassie. CASSANDRA Daaaaad. RYAN You didn’t? CASSANDRA No. I said you were boring but rich. 98 RYAN You know, I’m not even that rich. STANLEY Well. Nice knowing you, son. They all laugh. STANLEY and SUSAN catch each other’s eye, and smile. INT. CASSANDRA’S HOUSE - KITCHEN - LATER SUSAN and STANLEY are doing the dishes. We hear the front door close, and CASSANDRA reappears. CASSANDRA He says he wants the sauce recipe, Dad. STANLEY beams. STANLEY Kiss ass. SUSAN What a lovely evening. STANLEY He seems very nice, Cassie. Very nice. CASSANDRA Eh. He’s ok. SUSAN You’re allowed to like someone, honey. CASSANDRA I know. She kisses CASSIE goodnight, squeezes her. CASSANDRA (CONT'D) Alright, alright. Move it along. SUSAN stops the hug. SUSAN Night night. She leaves for bed. STANLEY lingers for a second. 99 STANLEY Thank you for introducing us to Ryan. I know it must have been hard. Your mom is so... we are both so glad. 100 Suddenly STANLEY is on the verge of tears. CASSANDRA is embarrassed, she doesn’t know what to do. CASSANDRA Oh my god. Dad! He’s not that nice! He laughs, and pulls himself together hastily. STANLEY Sorry. I must be tired. He goes to leave. Then- STANLEY (CONT'D) We miss her, Cassie. But god, we’ve missed you too. He leaves her in the kitchen, taking this in. What these years must have been like for her parents. INT. RYAN’S APARTMENT - BEDROOM - DAY CASSIE and RYAN are in bed. RYAN Your mom’s pretty hot. CASSANDRA You want her number? I could hook you up? RYAN (hopeful) Really? CASSANDRA Yeah. I think she likes you more than I do. He laughs. RYAN I hope that’s not true. Beat. RYAN (CONT'D) Can I tell you something? CASSANDRA Sure. RYAN sits up on his elbow and looks at her. He’s nervous. 101 RYAN I think you’re amazing- She realizes what’s happening. CASSANDRA Oh no, Ryan-don’t. Please. No. RYAN Let me fini",
      "dialogue_count": 0,
      "word_count": 1865
    },
    {
      "scene_number": 9,
      "slugline": "I/E. CAR - DIRT ROAD - EVENING CASSANDRA is pulled up on an old road in the middle of nowhere. No cars in sight. No houses. Just the woods. She’s doing her make up in the mirror- it’s super heightened. Big red lips, big eyes. She’s barely recognizable. 112",
      "characters": [],
      "action_text": "She grabs a powder blue wig from the passenger seat, her old book is underneath it, the torn out page stuffed back into it. She puts on the wig. She gets out of the car. She’s wearing a PVC nurse’s uniform, she takes off her plates and tosses them into the bushes. Then goes into the trunk to grab a matching nurse’s bag and a huge bottle of vodka. She slams the trunk shut, and starts the journey down the deserted road. EXT. CABIN HOUSE - EVENING We follow CASSANDRA as she walks up to a isolated house in the middle of the woods. Her high heels are in her hands. EXT. CABIN HOUSE - EVENING/NIGHT CASSANDRA finishes putting on her shoes on and rings the bell. A super hammered guy, JOE, answers. JOE YESSSSSSSSSSS! THE DOCTOR IS IN THE HOUSE!!!! We hear cheering from inside. A wall of choking testosterone. INT. CABIN HOUSE - LOUNGE - MOMENTS LATER JOE leads CASSANDRA into the run-down lounge. It looks like a fart-filled frat house basement. It is full of drunk dudes playing poker, beer pong and listening to terrible EDM. Among them is AL MONROE, preppy and very embarrassed. CASSANDRA is momentarily floored seeing him again. She covers it. JOE This is what I’m talking about, man! It’s stripper time, baby!! CHIP Nurse, I’m feeling sick, can you take my temperature? AL MONROE I thought I said no strippers, you guys! Anastasia will lose her shit. His friends all boo him. 113 AL MONROE (CONT'D) Who ordered her? 114 The dudes all look innocent. JOE Don’t look at me, man! CHIP Not me! AL MONROE No one owning up, huh? Well when Anastasia finds out it’s your funeral. CASSANDRA I take it you’re the groom? AL MONROE Yeah. CASSANDRA Then sit the fuck down. She grabs a chair and slams AL down on it roughly. The boys all “oooooooooooh!” AL MONROE Hey! JOE Uh oh! You’re in trouble, bro. JOE giggles. The guys are giddy with excitement. CASSANDRA gets out the vodka. CASSANDRA Now I’m going to need you all to kneel in front of me like the naughty boys you are. Is everybody here? Don’t want a",
      "dialogue_count": 0,
      "word_count": 3769
    },
    {
      "scene_number": 10,
      "slugline": "EXT. LAWN - DAY - MOMENTS LATER “No Regrets” still playing, RYAN opens the scheduled text. “ Lucky I got insurance! ” He looks up, sirens are coming into the drive. A line of police cars. The beautiful guests all turn to look, confused. Series of shots: AL MONROE looks over at JOE, both of them in a huge panic. They didn’t get away with it. ANASTASIA looks at her husband: what’s going on? AL’S FATHER arguing with the police as they walk into the wedding. AL being put into handcuffs. He’s already crying. His bride sobbing into her father’s shoulder. JOE discreetly slips away. All the guests looking on horrified. RYAN’s phone beeps again amidst all the chaos. He looks down at it, dazed. From CASSIE:  “Enjoy the wedding! ;)”  THE END 139",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 135
    }
  ]
}