{
  "slug": "puzzle-2018",
  "title": "puzzle",
  "genre": "comedy",
  "format": "film",
  "scenes_count": 14,
  "characters_count": 0,
  "characters": [],
  "total_words": 21985,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. LIVING ROOM. AGNES AND LOUIE'S HOUSE - LATER 8   8  Louie and his friends walk back into the house to find Agnes crawling around on her knees looking for the tiny missing piece. LOUIE What's going on? AGNES There’s a piece missing. From the plate. I don’t want anyone to step on-- LOUIE Come on, Agnes. Stand up! She ignores him and continues to look. He puts a hand on her shoulder. LOUIE (CONT'D) Hey. Later, okay? Not tonight. Please. It’s not like anyone ever walks around here barefoot. She stands, disappointed, mission aborted. LOUIE (CONT’D) You’re so cute. Their oldest son, ZIGGY (19), scrutinizes them from across the room.  INT. KITCHEN. AGNES AND LOUIE'S HOUSE - NIGHT 9   9  Agnes pulls the frosted cake out of the refrigerator. She sticks candles in the cake and looks at it for a long beat.  INT. DINING ROOM. AGNES AND LOUIE'S HOUSE - NIGHT 10   10  Holding the cake with the lit candles, Agnes walks out of the kitchen into the dining room. ALL THE PARTY GUESTS gather. EVERYONE (singing loudly)  Happy birthday to you, happy birthday to you, happy birthday-- dear... Agnes, happy birthday to you.  Agnes sets the cake down on the dining room table and looks at it, pleased, her face glowing in the candlelight. This is indeed HER birthday party. This is her world. Her life. She blows out the candles.  (CONTINUED)  4.",
      "characters": [],
      "action_text": "GABE Speech! Speech! EVERYONE LAUGHS. They know Agnes well enough to get the joke. Agnes swallows hard. Clearly, she’s uncomfortable with even a hint of attention. AGNES (whispering) Thank you, everyone. Ziggy inches closer. ZIGGY Speak up, ma! LOUIE Oh, leave the woman alone, will you? Agnes clears her throat, about to speak. Everyone quiets down. AGNES Who wants cake?  INT. KITCHEN. AGNES AND LOUIE'S HOUSE - NIGHT 11   11  Humming to herself, Agnes puts the last of the party dishes away. The house is hers again; the guests gone, her men asleep upstairs.  INT. KITCHEN. AGNES AND LOUIE’S HOUSE - NIGHT 12   12  Agnes sits down at the kitchen table, exhausted. She pours herself a large glass of red wine. Suddenly, she remembers something that sends her out of the room excitedly.  INT. DINING ROOM. AGNES AND LOUIE’S HOUSE - NIGHT 13   13  Agnes is halfway through unwrapping her presents. They're all pretty generic: a vase, a wooden ladle, a book. AGNES (reading book title) Aging with Grace: What the Nun Study Teaches Us About Leading Longer, Healthier, and More Meaningful Lives. She rolls her eyes. AGNES (CONT’D) Oh, Zig.  CONTINUED: 10   10 (CONTINUED)  5. She puts the book away. Opens and reads a series of Hallmark cards. Opens a small box and finds an iPhone inside. Stares at it as if it came from the future. Puts it down with little interest. Then she unwraps a long, rectangular present. It's a Ravensburger puzzle, 1500 pieces. A beautiful contemporary map of the world. Agnes studies the puzzle, then sets it aside.  INT. BEDROOM. AGNES AND LOUIE'S HOUSE - LATER 14   14  Agnes crawls into bed next to Louie who is SNORING LOUDLY. She lies there awake for a while. An old ALARM CLOCK TICKS on the night table on Louie’s side of the bed. Agnes listens to the TICKING. Louie groans and turns onto his side, putting his arm around her. The SNORING stops. Agnes closes her eyes, relieved. A few seconds later, the SNORING starts up again. But she’s already asleep. FADE TO BLACK",
      "dialogue_count": 0,
      "word_count": 2377
    },
    {
      "scene_number": 2,
      "slugline": "INT. KITCHEN. AGNES AND LOUIE’S HOUSE - EVENING 34   34  Agnes runs over to the sink, fills a pot with boiling water, and grabs a jar of tomato sauce from the cupboard. She hears the FRONT DOOR OPEN AND SHUT. A beat later, Gabe walks in. GABE Hey. He gives her a kiss on the cheek. AGNES Hi, sweety. How was your day? GABE Kind of whatever. Chess club was cool. Hockey was canceled; Coach Wilson got bad diarrhea. (laughing) How was your day? AGNES Busy. Pretty busy. GABE Any emergencies? AGNES None. Thank God. He laughs and grabs an apple off the table.  INT. DINING ROOM. AGNES AND LOUIE’S HOUSE - NIGHT 35   35  Wearing dirty coveralls, Ziggy walks in to set up the table. He checks out the finished puzzle. ZIGGY Hey, Mom, what do I do with this thing on--? Agnes runs in, wiping her hands in a kitchen towel. AGNES Sorry. She breaks the puzzle up. ZIGGY No, don’t! Too late. She throws puzzle pieces into the box. ZIGGY (CONT’D) That’s 1500 pieces, Mom. She shrugs. Louie comes down the stairs post-shower.  (CONTINUED)  14.",
      "characters": [],
      "action_text": "LOUIE What’s going on? ZIGGY Nothing. Mom just-- AGNES Dinner is almost ready. LOUIE (to Ziggy) You’re not going to change? ZIGGY Mom asked me to set the table. LOUIE In these filthy clothes? AGNES It’s okay. I’ll do it.  INT. BEDROOM. AGNES AND LOUIE'S HOUSE - NIGHT 36   36  Agnes is lying in bed, struggling to make out the small print of the puzzle instructions with an old magnifying glass. Louie is changing into his pajamas. LOUIE He's lazy. He looks at her, she’s trying to read. LOUIE (CONT’D) Agnes, are you listening? AGNES Shhh. Lower your voice. LOUIE What are you reading there? AGNES Puzzle instructions. LOUIE You put the pieces together until you run out, what other instructions do you need? AGNES Suggestions. Strategies. It doesn’t matter. She puts the paper away.  CONTINUED: 35   35 (CONTINUED)  15. LOUIE You’re so cute. (pause) Puzzles are for children, Agnes. AGNES I don't think he's lazy. LOUIE He just sits there until I ask him to do something. He'll do whatever I tell him but he won't take any initiative. All day long. Louie faces her in his pajama bottoms, shirtless. Agnes eyes him, her expression betraying worry. LOUIE (CONT'D) What? AGNES Huh? LOUIE You were looking at me with some kind of-- some kind of look in your eyes. AGNES No I wasn’t. LOUIE I know you, Agnes. AGNES There was no look-- LOUIE Just say it. AGNES There was no look. LOUIE I turned down a doughnut today. Okay? A jelly doughnut! Do you know how hard that was for me? AGNES You should be very proud of yourself. LOUIE I am. I’m smoking a lot less. For you. For us. Cholesterol is a genetic thing. It’s not my fault... He turns the lights off and gets in bed, putting his arm around her.  CONTINUED: 36   36 (CONTINUED)  16. AGNES I just don’t want to lose you. LOUIE (laughing) Then pray for me! (pause) Is it hot in here? She sighs, gets up and opens a crack in the window. Stops, staring out at: Ziggy, smoking a cigarette outside, looking through messages on his phone, a picture of youthf",
      "dialogue_count": 0,
      "word_count": 1322
    },
    {
      "scene_number": 3,
      "slugline": "INT. DINING ROOM. AGNES AND LOUIE’S HOUSE - NIGHT 47   47  The family around the table, plus NICKI, 17, Gabe’s girlfriend. Agnes comes in from the kitchen with a gorgeous stuffed chicken dish she adds to a salad assembled in the likeness of a fish. There’s homemade bread along with other elaborate dishes on the table. AGNES The chicken is stuffed with potatoes and- GABE Mom! Nicki! AGNES (to Nicki) I thought you just didn't eat red meat. NICKI I'm vegan. GABE We went through this already, Mom. AGNES So you never ever eat chicken? GABE (to Nicki) It's like she’s hoping you’ll forget. It’s so embarrassing. AGNES I should have made fish. I’m sorry. ZIGGY She doesn’t eat any animals, Mom. AGNES But she has to have protein, she’s still growing. GABE Mom, don’t say dumb shit like that-- LOUIE Hey. Enough. Okay. AGNES (to Nicki) The way we were raised, everything had to come with meat. I’m sorry.  (CONTINUED)  20.",
      "characters": [],
      "action_text": "NICKI It's fine. I can eat the salad. And bread. I’m fine. Nicki takes the salad, stirs it up with salad tongs and serves herself. Agnes watches confused. AGNES (to Nicki) Have you always been this way? GABE Nicki’s also a Buddhist. LOUIE That sounds interesting. AGNES You know, I have no idea what that really means. Buddhist. I always hear people talking about Buddhism and celebrities and nobody says what it is. NICKI It's like-- Like the root of all suffering is our desire not to suffer. Intrigued by this strange young woman, Agnes stares, forgetting the food. NICKI (CONT'D) So we have to give up on the idea of being happy Ziggy eats quietly. Gabe’s practically glowing. LOUIE (impressed) You don't care about being happy? NICKI I try not to think that way. Happiness is an illusion. Agnes serves herself some chicken. AGNES Are your parents unhappy? Ziggy cracks up. Nicki stares, surprised. GABE Mom! AGNES I mean, like Buddhist? Did they raise you this way?  CONTINUED: 47   47 (CONTINUED)  21. NICKI God. No. They’re stuck in the past. AGNES Isn’t Buddhism also from the past? NICKI No. Yeah. I mean they’re more conventional Western thinkers. When they bother to think. That’s what I mean. Louie laughs, he likes Nicki’s spirit. Agnes gives him a look, she’s not amused. Ziggy clocks his mother’s anguish. GABE Nicki won't even-- She doesn't even kill mosquitoes. ZIGGY I read something about this kid who drowned in a river because a Buddhist monk was the only one watching him and if you're a Buddhist you're not supposed to try to save people's lives. Like you're not supposed to interfere with their path. LOUIE What?! NICKI That doesn't sound true. AGNES Why can't Buddhists save lives? GABE Where did you read that? ZIGGY It was an article. It was a real article on like the Huffington Post or something. NICKI Um, yeah, that's not Buddhism. Buddhism respects life. It just has a different approach to death and suffering. LOUIE That monk should be shot. GABE/AGNES Dad!/Louie! Z",
      "dialogue_count": 0,
      "word_count": 707
    },
    {
      "scene_number": 4,
      "slugline": "INT. TRAIN CAR. METRO NORTH TRAIN. MOVING - DAY 54   54  Agnes sits in the back of the moving train and looks out the window as Bridgeport flies by. Trees turn the outside world into a green blur. The TRAIN CONDUCTOR comes by. AGNES A ticket to Grand Central please. TRAIN CONDUCTOR That's nineteen dollars. Agnes balks. Stares horrified. AGNES How much? TRAIN CONDUCTOR Nineteen. AGNES I thought it was eight. TRAIN CONDUCTOR Are you an active duty member of the United States armed forces, or disabled or a senior? AGNES No. None of those things. TRAIN CONDUCTOR It’s nineteen dollars one way, off- peak hours when you purchase tickets on board. Next time buy it at the station. It’s cheaper. You could get a ten trip or a weekly. AGNES That’s okay. I don’t really think they’ll be a next time. She hands him a twenty. TRAIN CONDUCTOR One way? AGNES I’ll buy the return in Grand Central.  INT. GRAND CENTRAL TERMINAL - DAY 55   55  Agnes stands in the middle of Grand Central's atrium, staring up at the golden constellations on the ceiling.  (CONTINUED)  24.",
      "characters": [],
      "action_text": "HUNDREDS OF PEOPLE jostle past her, some almost knocking her over. But she can't stop staring.  INT./EXT. TAXI. MOVING/ NYC - DAY 56   56  Agnes sits in the back of a yellow cab, staring out the window at the Big Bad Apple, like a tourist, moving slowly through Manhattan traffic. From time to time she looks at the meter with worry as the fare climbs mercilessly. When it gets to ten dollars, she leans forward toward THE DRIVER. AGNES Could you stop please? I’ll walk. I’m sorry.  EXT. WASHINGTON SQUARE PARK. NYC - DAY 57   57  Agnes crosses Washington Square taking in the fountain and the diverse crowds of STUDENTS, STREET MUSICIANS, TOURISTS and THE HOMELESS.  EXT. THOMPSON STREET. GREENWICH VILLAGE - DAY 58   58  Agnes stops in front of a tiny shop window filled with puzzles on display: PUZZLEMANIA. The look in her eyes is that of child-like awe. She’s arrived!  INT. PUZZLEMANIA. GREENWICH VILLAGE - DAY 59   59  A BELL RINGS as Agnes enters the cluttered shop. A HEAVILY- PIERCED YOUNG MAN at the counter looks up from his phone. YOUNG MAN Let me know if you need any help. The place is a puzzle-lover's fantasy come to life; dusty and dark, almost like an old bookstore, with wall-to-wall puzzles of every type imaginable.  INT. PUZZLEMANIA. GREENWICH VILLAGE - LATER 60   60  The Young Man watches Agnes, her arms full of puzzles, agonizing between two final purchases. YOUNG MAN You ready? AGNES What do you think, sir? Which one?  CONTINUED: 55   55 (CONTINUED)  25. She holds up the two puzzles: a portrait of a mother bathing her child (Mary Cassatt’s painting \"Mother and Child\") and a painting of naked woman lying provocatively on a couch (Goya’s \"The Nude Maja\"). YOUNG MAN Uh... depends on what you want to spend days looking at. AGNES What do you mean? YOUNG MAN They’re each a thousand pieces. They take forever. Agnes looks at them. AGNES I'll take both. She carries her pile of puzzles to the counter. The Young Man starts RINGING her up. Agnes focuses on a handwritten s",
      "dialogue_count": 0,
      "word_count": 6054
    },
    {
      "scene_number": 5,
      "slugline": "INT. BASEMENT. PUZZLEMANIA. MANHATTAN - DAY 104   104  Agnes and Robert are sitting across from each other at a card table, working on a new puzzle, the timer running. Agnes is very tense and ill at ease. We move back to see the store basement lined with shelves stacked with puzzles and filled with populated tables: a collection of ODD BALLS, mostly elderly folks, all gathered to puzzle together. Agnes moves uncomfortably in her seat. She’s not her usual fluid puzzler, she can’t focus. AGNES AND ROBERT WHISPER WHILE PUZZLING FOR THE REST OF THE SCENE: AGNES I don’t understand why we have to compete already? ROBERT What’s the big deal? Agnes shakes her head, she’s upset. AGNES Who are these people? ROBERT I thought we’d do this to boost your confidence. AGNES Well, you thought wrong. ROBERT Just focus on what I’m doing. She looks around, catches some glimpses. Gets back to the puzzle. AGNES I looked you up. I mean, I googled you. On my phone. ROBERT Oh? AGNES You’re an inventor. ROBERT No. Not really. AGNES Something with magnets.  (CONTINUED)  55.",
      "characters": [],
      "action_text": "ROBERT I have a patent under my name. One invention. One good idea that took off. That’s it. I stumbled onto it almost by accident. Haven’t come up with anything since. AGNES It made your very rich. ROBERT It was a fluke. I’m no inventor. Let’s just do the puzzle. She gets frustrated trying to fit a piece in. Throws it back into the box. Looks around. AGNES Why are people staring at us? He stops the timer. ROBERT Okay. Okay. This was a bad idea. I’m sorry. Let’s get out of here.  EXT. PUZZLEMANIA - AFTERNOON 105   105  The street is filled with golden, late afternoon sunlight. Robert and Agnes exit Puzzlemania when Agnes suddenly stops, takes a deep breath and turns her face up towards the moon, smiling. He stares at her, moved and attracted.  EXT. MANHATTAN STREET - AFTERNOON 106   106  Agnes and Robert walk side by side. MID-CONVERSATION: ROBERT At the end she just didn’t like... ME. We got divorced. I never wanted kids anyway. AGNES Why not? ROBERT Frankly, I don’t like kids. AGNES How can you say that? You were a kid yourself once. ROBERT Right. And I hated it. Not everyone’s supposed to have kids, you know. And not only for selfish reasons.  CONTINUED: 104   104 (MORE) (CONTINUED)  56. Sometimes for the kids’ sake. In this town kids are an ornament or a fashion statement. An accessory. A checked box. I never felt a need. Does that make me weird? The PHONE IN Agnes's BAG SUDDENLY STARTS RINGING. She searches for it in panic. Answers. AGNES (TO PHONE) Is everything okay, Ziggy? Yes. You scared me. Well, it’s my emergency phone! I’m not home right now. I’m out. Out. I’m at a church meeting. Yes, I’ll see you later. She hangs up. ROBERT Church? AGNES I have to go. ROBERT Was that your son? AGNES Yes. My oldest accessory. And no, it doesn’t make you weird. Just different from everyone I’ve ever met.  EXT. TRAIN PLATFORM. BRIDGEPORT, CT - EVENING 107   107  It’s getting dark. Agnes hurries up the stairs over the platform where she trips and almost falls on her face. ",
      "dialogue_count": 0,
      "word_count": 1723
    },
    {
      "scene_number": 6,
      "slugline": "INT. BATHROOM. ROBERT’S TOWNHOUSE - DAY 115   115  Agnes sits on a chair in the middle of the white, shiny, palatial bathroom, her burning face in her hands. She takes a couple of deep breaths. Then she gets up and walks over to the sink. There are dozens of expensive soaps and perfumes and lotions. Agnes washes her hands, tries a couple of lotions, and then spritzes some perfume on her wrist.  MONTAGE. AGNES’S HALLWAY PORTRAITS 116   116  --Agnes walks into the hallway and stops, staring at the masks on the wall. --We move through a series of portraits of Agnes trying on three different masks from Robert’s collection in the hallway mirror: happy, blank expression, sad... ROBERT (O.S.) (calling) Agnes, are we playing hide and seek? Cause I’m not sure who’s “it”.  INT. LIBRARY. ROBERT’S TOWNHOUSE - DAY 117   117  Agnes and Robert finish up the puzzle and walk over to the tea room.  INT. TEA ROOM. ROBERT'S TOWNHOUSE - DAY A118   A118  Maria holds up a tea canister to show Agnes. MARIA You like this one Mrs., right? AGNES Yes. Thank you, dear. Maria pours as Agnes turns back to Robert to resume their conversation: AGNES (CONT’D) Kesz. ROBERT What does that mean? AGNES Done. Finished. Maria places the teas in front of them.  (CONTINUED)  64.",
      "characters": [],
      "action_text": "AGNES (CONT’D) Thanks, Maria. Maria smiles and exits. Agnes winces and rubs her shoulder. ROBERT What's wrong? AGNES I hunch over and I-- ROBERT You need to do some yoga. Agnes shakes her head. ROBERT (CONT'D) Why not? He gets out of his chair. ROBERT (CONT'D) You know how to do Sun Salutations? AGNES Yoga is for little anorexic girls. Robert laughs. ROBERT Get up, Mata. Robert stands there, hands on hips. ROBERT (CONT'D) Get up. She gets up. ROBERT (CONT'D) Hands above your head. AGNES I’m not taking instructions from a man in a red kimono. ROBERT Hands above your head. She obeys. ROBERT (CONT'D) Now lean back. Agnes tries to lean back. AGNES Eeee. Ow. Robert gets behind her and starts massaging her shoulder.  CONTINUED: A118   A118 (CONTINUED)  65. AGNES (CONT'D) What are you do--? ROBERT Now open your arms out in a circle and let them fall to your sides. I’ve been doing this for ten years. She opens her arms out in a circle and lets them fall to her sides ROBERT (CONT'D) Good. He keeps rubbing her shoulder. ROBERT (CONT'D) Have you ever had a professional massage? AGNES No. Not really. A tiny moan starts to escape her lips, but she stops herself. ROBERT I'd like to buy you a massage. You won't believe what a difference it- Agnes suddenly walks out of the tea room and back to her chair where she picks up her bag. He follows. AGNES If I want a massage I can buy one myself. I'm not a-- I'm not a bag lady or a-- ROBERT Agnes-- AGNES I should go. ROBERT Come on, Agnes. Don't get weird on me. AGNES It's three already. I can’t be late getting home. ROBERT If you want, I’ll come to your home next time. AGNES I'll see you here Monday.  A118   A118 (CONTINUED)  CONTINUED: (2)   66. AGNES (O.S.) (CONT’D) And next time put on some real clothes for God’s sake.  INT. BEDROOM. AGNES AND LOUIE'S HOUSE - NIGHT 118   118  Agnes crawls in bed with Louie. They lie facing each other. Louie reaches out to caress her. AGNES When I was at your office, doing paperwork... I saw one of the",
      "dialogue_count": 0,
      "word_count": 710
    },
    {
      "scene_number": 7,
      "slugline": "INT. BEDROOM. AGNES AND LOUIE’S HOUSE - MORNING 119   119  Agnes lies awake in bed as the first sun rays caress the room. She listens to LOUIE SNORE. AGNES (whispering) Five. Four. Three. Two. One. Her IPHONE ALARM GOES OFF. She turns to face Louie. LOUIE (groggy) Five more minutes. AGNES Take an hour or two. He opens his eyes in surprise. LOUIE What?  INT. KITCHEN. AGNES AND LOUIE’S HOUSE - MORNING 120   120  Agnes walks into the kitchen in her nightgown, bleary-eyed, and stops short. Ziggy is standing at the stove, frying eggs and making bacon. AGNES What are you doing up already? ZIGGY What does it look like? AGNES I was going to do that. ZIGGY Well, today I’m doing it. You can relax. I bought truffle oil at this imported goods store and I want to try it in the eggs. Agnes sits down at the kitchen table, and watches Ziggy cook for a long beat. AGNES Are you gay, Ziggy? He turns around and gives her a look. ZIGGY I don’t think so.  (CONTINUED)  68.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 180
    },
    {
      "scene_number": 8,
      "slugline": "INT. KITCHEN. AGNES AND LOUIE’S HOUSE - LATER 121   121  Agnes, Ziggy, Louie, and Gabe sit around the table, eating a beautifully cooked breakfast. GABE This is really good. Ziggy beams. Louie, his mouth full, nods enthusiastically. ZIGGY It’s the truffle oil. GABE Isn’t that chocolate? ZIGGY (laughing) No. Mushrooms. Agnes stares blankly at her husband from across the table; he looks back at her worried. She recognizes the look, recovers and smiles at him. He smiles back. LOUIE (to Ziggy) We better skedaddle or we’ll be late.  EXT. ROBERT'S TOWNHOUSE -- DAY 122   122  Agnes rings the doorbell. Robert opens the door. ROBERT Hey-- AGNES I don’t want to hear anything tragic right now. Thank you very much.  CONTINUED: 120   120 (CONTINUED)  AGNES It’s okay if you are. Your father will understand. ZIGGY I don’t think I am. I’m just not very-- AGNES  Experienced? ZIGGY  Interested.  69.",
      "characters": [],
      "action_text": "She pushes past him into the hallway. He looks after her.  INT. LIBRARY. ROBERT'S TOWNHOUSE - DAY 123   123  Agnes is putting a puzzle together with a furious, almost inhuman speed. Robert watches her for a beat, impressed. He then picks up a puzzle piece. AGNES (not looking up) Don't even try. It's not going to fit. We’re wasting time. ROBERT Maybe I should just watch you do it then? AGNES Do what you want. ROBERT I was kidding. AGNES Don’t kid with me. I don’t have a sense of humor. Never have. Never will. That’s why we get along. All you care about is disasters. ROBERT That’s... actually funny. AGNES You’re not listening.  INT. LIBRARY. ROBERT'S TOWNHOUSE - DAY 124   124  Puzzle just finished, Agnes stands up and gathers her things. ROBERT Stay and have a drink with me. AGNES I have to beat traffic. My husband and I are going fishing. ROBERT I would have never guessed you liked fishing. AGNES I don't. He does.  CONTINUED: 122   122 (CONTINUED)  70. ROBERT Can I come? I love fishing! It relaxes the mind. AGNES Don’t say that. Fishing is vile. ROBERT I always throw them back in. I fish for sport not food. AGNES Oh, God, the world’s gone mad. She walks out of the room. Robert watches, amused. ROBERT (calling after her) I’ll miss you, Mata. He waits a beat before following Agnes into the adjoining puzzle box room. She turns to him, furious. AGNES Why did you say that? ROBERT Because I meant it. AGNES How can you mean it? How can this be happening? ROBERT I don’t know. AGNES Why are we wasting all this time doing puzzles? ROBERT What else is there to do? AGNES It’s a childish hobby for bored people. ROBERT You know that’s not true. AGNES Tell me you’re not a bored rich guy. Tell me I’m not a childish housewife. ROBERT That’s not what we are.  CONTINUED: 124   124 (CONTINUED)  71. AGNES You have much more important things to do. You’re a man of ideas. Why do you do these stupid puzzles? He hesitates. Sighs. ROBERT It’s a way to control the chaos. AGNES That’s ridiculou",
      "dialogue_count": 0,
      "word_count": 1687
    },
    {
      "scene_number": 9,
      "slugline": "INT. KITCHEN. ROBERT'S TOWNHOUSE - DAY 136   136  Agnes and Robert stand in his gorgeous kitchen, facing an incredible array of teas in a rack on the wall. Robert is holding a box under her nose. ROBERT Smell it. She does. She’s nervous. AGNES Very nice. ROBERT It's a mix of rose petals and bergamot. Smell this one. He opens another box. Agnes leans into smell it. He watches her. ROBERT (CONT'D) Like it? Agnes nods. ROBERT (CONT'D) Want to try it? AGNES Where’s Maria? ROBERT Visiting family. AGNES I like her.  INT. KITCHEN. ROBERT'S TOWNHOUSE - DAY 137   137  Robert is unfolding the paper Agnes just handed him. AGNES Second paragraph. ROBERT Uh... let's see. (reading out loud) \"My mother doesn't know anything about the world outside of our house, our church, our traditions and our family. She, like my father and brother, never went to--\" He looks up at her.  (CONTINUED)  78.",
      "characters": [],
      "action_text": "ROBERT (CONT’D) He spelled “college” wrong. It says “collage”. Probably the spell- check... AGNES Keep going. ROBERT (reading) \"I love my mother, but I also feel bad for her. She’s a sheltered person and doesn't think of   *  anything but serving the men in her life. A child of Hungarian immigrants, she lost her mother when she was young and grew up doting on her dad. She’s still   *  living in the house he raised her   *  in. When he died after a long   *  illness, she fell apart. She was treated for emotional problems and has never been the same from what I remember. I want to be different. I want to go to-- collage -- and learn about other cultures, not just my own, and other ways of being. I want to travel. I want to gain self-awareness and be sane. I want to try new religions. New foods. I don’t want to just become   *  my father, who is too scared to   *  think outside the box, or my   *  mother, who just won't let herself come alive.\" He puts the essay down. Awkward pause. ROBERT (CONT’D) He does say he loves you. She turns away and looks at the spice rack on the counter. ROBERT (CONT’D) It's smart of him. College admissions love kids who are first generation to attend college. He's totally exploiting that. Very savvy. Agnes reads the description on a tea box. ROBERT (CONT'D) Oh, God. Mata. To me this all just rings false. It doesn't sound like you at all.  CONTINUED: 137   137 (CONTINUED)  79. AGNES (working on puzzle) I think it sounds exactly like me. ROBERT I disagree. You-- AGNES You don't know me. ROBERT Hey. Robert gently puts a finger under her chin and tilts it up so she's looking at him. ROBERT (CONT'D) Hey. I know that you're the best puzzler I've ever met. And I know that you're modest and funny and beautiful and strange. And I happen to know you’re an excellent kisser. They look at each other for a long time. She closes her eyes, as if she’s too overwhelmed to see him or be seen. AGNES I don't know why-- I don't understand why someone like you wo",
      "dialogue_count": 0,
      "word_count": 1557
    },
    {
      "scene_number": 10,
      "slugline": "INT. KITCHEN. AGNES AND LOUIE’S HOUSE - MORNING 144   144  Ziggy is making pancakes while Agnes scrambles eggs. He skillfully flips a couple of perfect-looking pancakes. Agnes peers over, surprised. AGNES Those are beautiful. ZIGGY Thanks. Louie comes in. LOUIE Hey, Ag, a couple of people told me they haven't gotten an invitation to the Easter Party yet. AGNES That’s strange. I mailed them all. ZIGGY I’m helping Mom cook for the party. LOUIE Okay. (to Agnes) And don't forget to buy my cheese. He sits at the table just as Gabe stumbles in and drops to a chair. Agnes takes the frying pan off the stove and starts serving the eggs. Ziggy serves pancakes. GABE So-- Hey. Guess what, everyone. Good news. I've decided what I want to do with the Ellenville money. All eyes are on Gabe. He bangs a drum roll on the table. LOUIE Stop that. AGNES That money is for college. GABE I'm going to take a year off and go to Tibet with Nicki. Agnes stops short. Louie stares. GABE (CONT’D) I'll go to college eventually. I just want some time to figure out what-  (CONTINUED)  86.",
      "characters": [],
      "action_text": "AGNES Dad said that money was for a house for Ziggy and your college. GABE He said it was a gift. Agnes looks at Louie. AGNES Are you going to say anything? GABE Travel is a kind of education unto itself. AGNES Louie. LOUIE I did say it was a gift. Upset, Agnes puts the frying pan down on the table and storms out of the room. GABE What’s her fucking deal? ZIGGY Watch your mouth!  OMITTED 145-150   145-150  INT. BEDROOM. ROBERT'S TOWNHOUSE - DAY 151   151  Robert is reading a book in bed, watching volcanic eruptions on the Weather Channel. His PHONE RINGS.  EXT. BACKYARD. AGNES AND LOUIE’S HOUSE - DAY 152   152  Agnes is lying on her back in the grass, looking at the moon in the sky, her iPhone to her ear. ROBERT (ON PHONE) Hello? She hesitates. Not sure what to say. Finally: AGNES (TO PHONE) Hi. WE CUT BACK AND FORTH BETWEEN AGNES’S BACKYARD AND ROBERT’S BEDROOM:  CONTINUED: 144   144 (CONTINUED)  87. ROBERT Mata. Hi.  CONTINUED: 152   152 (CONTINUED)  87A. AGNES Hello. ROBERT What's up? Agnes closes her eyes. AGNES Happy Holy Thursday. ROBERT Is it Thursday already? AGNES Holy Thursday. Tomorrow is Good Friday. Then Sunday is Easter. The resurrection. ROBERT I know what Easter is, Mata. I also know that you’re not the believer you once were. And that’s okay. You have to be kind to yourself. She smiles. AGNES I like it when you call me Mata. ROBERT It’s who you are. AGNES It was... It used to be. What are you doing right now? Robert sits up in his bed. ROBERT Nothing, really. As usual. She laughs. Then she puts her hands over her eyes, as if remembering something terrible. AGNES God. That's the worst thing I've ever done. ROBERT (O.S.) Wait, what? What happened? AGNES Kissing you. ROBERT Oh. Wow. If that's the worst thing you've ever done, Agnes, you're pretty damn lucky.  152   152 (CONTINUED)  CONTINUED: (2)   88. AGNES I haven’t gone to confession. I don’t know how to confess this-- I’ve been telling lies. ROBERT You’re not lying at all. Everything you say is tru",
      "dialogue_count": 0,
      "word_count": 2096
    },
    {
      "scene_number": 11,
      "slugline": "INT. BEDROOM. ROBERT’S TOWNHOUSE - EVENING 164   164  The sun shimmers down behind a distant building and disappears. Agnes sleeps in bed next to Robert. HER PHONE RINGS INSIDE HER PURSE. She suddenly wakes up, terrified. AGNES Oh, God. He’s going to kill me.  INT. KITCHEN. AGNES AND LOUIE’S HOUSE - NIGHT 165   165  Agnes enters quietly through the back door, then stops short when she sees Louie at the kitchen table. He's sitting there, very still, surrounded by party detritus. Agnes flinches, terrified. AGNES Look, I- LOUIE Please don't make any excuses, Agnes. Please. I know you weren't with Emily. I called her. And Ronnie was here. Said he saw you at the train station the other day. AGNES I was stuck in- LOUIE Please don't lie to me. Just please don't lie to me. Please, don’t-- Louie takes a deep breath. LOUIE (CONT’D) You have to tell me. You have to tell me everything, Ag. Agnes regards him, her mood darkening. AGNES I don’t have to tell you anything. I’m not your servant. You don’t own me. Louie gets up from the table and starts walking out of the room. AGNES (CONT’D) But I will tell you this-- He turns to face her.  (CONTINUED)  97.",
      "characters": [],
      "action_text": "AGNES (CONT’D) Don't make decisions about the family without me. Don't laugh at me when I care about something. Quit telling me I'm cute all the time when you actually mean I’m dumb. Help me shop if you want your cheese. Stop looking at me like I’m damaged goods or a head case. Stop snoring! I can’t sleep at night. And never ever, ever raise a hand on me again. Louie is very still. AGNES (CONT'D) Did you hear any of that? Louie nods, stoic. LOUIE Are you having an affair? AGNES Yes. I am. I think. LOUIE You think you’re having an affair? AGNES I have a puzzle partner. He’s a man. We’re a team. We’re competing as a team. We’ve had... sex. One time. And it wasn’t good but it wasn’t bad. He nods to himself. AGNES (CONT’D) Do you have anything to say? Louie hesitates, lets out a strange little laugh, then shakes his head no, and starts trudging up the stairs to bed. Agnes collapses against the wall, devastated.  INT. BEDROOM. AGNES AND LOUIE'S HOUSE - NIGHT 166   166  Louie enters the bedroom, sits still on the edge of the bed and takes a series of long breaths.  INT. KITCHEN. AGNES AND LOUIE'S HOUSE - AT THE SAME TIME A167   A167  Agnes is on the floor, breathing hard, distraught.  CONTINUED: 165   165  98.",
      "dialogue_count": 0,
      "word_count": 435
    },
    {
      "scene_number": 12,
      "slugline": "INT. ST. STEPHENS CHURCH. BRIDGEPORT, CT - MORNING 167   167  The whole family sits in a full pew and listens to the Father Kutash deliver the Easter Sermon: FATHER KUTASH We began our celebration today with a service of light which represents Jesus Christ rising from the dead and bringing light to us. Christ light has shone in the world, scattering darkness forever. We had been waiting for this moment from the beginning. We heard in our readings today an account of the creation of man. And woman. This was in God’s eternal plan for humankind. But the high point is the resurrection; it is the greatest celebration of God’s Church. This day is the most blessed of all as we heard in the Exsultet, the Easter Proclamation. “Rejoice, let Mother Church also rejoice!” Agnes and Louie keep glancing in each other’s direction.  EXT. ST. STEPHENS CHURCH. BRIDGEPORT, CT - DAY 168   168  The family exits the church amid the WORSHIPPERS. Louie starts to peel off. LOUIE (avoiding eye contact) I'm gonna go to the garage and do a little work. AGNES Do you want a ride? LOUIE Nah. Thanks. Agnes and the boys watch Louie trudge away down the sidewalk, his hands jammed into his pockets.  INT. KITCHEN. AGNES AND LOUIE’S HOUSE - DAY 169   169  Agnes and Gabe sit at the kitchen table while Ziggy stands at the stove, making grilled cheese sandwiches for lunch. ZIGGY Oh, and I also made these little tarts last night, these little mushroom goat cheese things...  (CONTINUED)  99.",
      "characters": [],
      "action_text": "AGNES From scratch?! ZIGGY Yeah. And everyone loved them. Oh, and I roasted the turkey in a different way. I used sage, too. AGNES Sage?   GABE It was really good. AGNES What did Ezster say? About me not showing up? GABE I dunno. She said something to Dad and then he got mad and told her to leave. AGNES He did? GABE Uh-huh. Ziggy serves them sandwiches. They all eat. ZIGGY There's this school in New York City. It's not that expensive but it's really well-known. You can get a degree in two years. And if it was okay with you guys I would keep living here and commute and then I'd still have a little money left over at the end. I don't know how long the commute would be, though. It might be too long. AGNES Just an hour forty to Grand Central. ZIGGY Really? That's it? She nods. ZIGGY (CONT'D) That's not bad. Gabe looks at Agnes curiously. AGNES It’ll be cheaper if you buy a monthly.  CONTINUED: 169   169  100.",
      "dialogue_count": 0,
      "word_count": 431
    },
    {
      "scene_number": 13,
      "slugline": "INT. BATHROOM. AGNES AND LOUIE’S HOUSE - DAY 170   170  Agnes carefully applies mascara and a coat of lipstick while looking in the mirror. It's the first time we've seen her all dolled up.  EXT. ROBERT'S TOWNHOUSE - DAY 171   171  Agnes rings the doorbell. Robert answers. ROBERT Ready? Agnes shakes her head no. He smiles.  EXT. GARDEN STATE PARKWAY - DAY 172   172  A black town car drives down the highway.  EXT. ATLANTIC CITY CASINO - SUNSET 173   173  The town car pulls in front of a flashy, decked-out casino with a sign out front that reads: WELCOME PUZZLERS. Robert jumps out and runs to Agnes's door. He opens it. She looks at him in panic. He offers her his hand. She hesitates. AGNES I shouldn’t be here. This isn’t me. He gingerly takes her hand and leads her out of the car. She lets him.  INT. LOBBY. ATLANTIC CITY CASINO - NIGHT 174   174  Agnes and Robert enter the lobby. They walk through the casino floor toward an entrance to an atrium where they sign in at the Puzzle competition registration table.  INT. ATRIUM. ATLANTIC CITY CASINO - NIGHT 175   175  Agnes and Robert sit down across from each other at a folding table, surrounded by HUNDREDS OF OTHER PEOPLE at identical folding tables. We catch glimpses of just a few of their fellow puzzle Competitors: --AN OVERWEIGHT COUPLE in matching cowboys suits...  (CONTINUED)  101.",
      "characters": [],
      "action_text": "CONTINUED: 175   175 (CONTINUED)  101A. --An OLDER MAN with a floor-length beard and a paper crown that says: PUZZLE KING. --A WOMAN wearing an American Flag sweater. --A COUPLE OF NERDY TEENAGERS. A WOMAN comes by and puts a paper bag full of puzzle pieces and a cardboard box on their table. Agnes reaches out to touch it but Robert stops her. ROBERT (softly) Not yet, honey. She stares, shaken by that last word.  INT. ATRIUM. ATLANTIC CITY CASINO - NIGHT 176   176  THE PUZZLE EMCEE, A WOMAN, STEPS UP TO THE MICROPHONE. PUZZLE EMCEE Alright, Puzzlers, this is it. The moment of truth is upon us. Ready? On my count: Five. Four. Three. Two. One. BEGIN! THE SOUND OF HUNDREDS OF PUZZLES BEING FRANTICALLY DUMPED OUT ON THE TABLE AT THE SAME TIME FOLLOWS.  INT. ATRIUM. ATLANTIC CITY CASINO - NIGHT 177   177  Agnes dumps out the pieces and starts sifting through them with her fingers. Robert, along with EVERYONE ELSE IN THE ROOM, has stood up and is walking around the table, looking at the puzzle pieces. ROBERT (whispering) What are you doing? Stand up! Agnes shakes her head no. ROBERT (CONT'D) Remember? It's important to step away and take a- AGNES Shhh. I'm working.  175   175 (CONTINUED)  CONTINUED: (2)  --AN OLDER WOMAN with half a dozen medals from previous competitions hanging around her neck... --Lots of KOOKY OVERDRESSED MATRONLY TYPES...  102. 178   178  Robert is now sitting across from Agnes and they're working quickly, silently. He glances over her work. ROBERT You're not doing it by color. She nods and continues working. ROBERT (CONT'D) You're doing it the old way. Agnes. What are you-? AGNES Everyone else is doing colors and borders. ROBERT Yes! That's how we trained! AGNES If we do it that way we won't win. We'll come in second or third. I'm doing it the old way. ROBERT Agnes. AGNES If we argue about this we definitely won't win. ROBERT You’re a goddamn rebel is what you are. She looks up for a quick second, smiling. She likes the idea of it.  INT. BATHROOM. R",
      "dialogue_count": 0,
      "word_count": 807
    },
    {
      "scene_number": 14,
      "slugline": "INT. KITCHEN. AGNES AND LOUIE’S HOUSE - NIGHT 183   183  Agnes tiptoes into the dark kitchen. She takes off her shoes and leaves them by the door with the trophy.  INT. LIVING ROOM. AGNES AND LOUIE’S HOUSE - NIGHT 184   184  Agnes tiptoes through the dark living room towards the stairs. Suddenly she stops in her tracks and SCREAMS, groping around in the dark and finally collapsing in a chair. A lamp turns on. It's Louie. He’s been sleeping on the couch. Agnes is illuminated, sitting in an armchair and cradling her bare foot. LOUIE What happened? Agnes shakes her head, unable to speak. Louie comes closer. LOUIE (CONT'D) Let me see. Is it a splinter? AGNES (gasping) It hurts like hell. Louie crouches down in front of Agnes and holds his hands out. After a second, she gives him her foot. He inspects it. LOUIE It looks like a piece of glass. A piece of porcelain or something. It’s tiny. He tries to touch it. Agnes yelps. AGNES Don't. LOUIE Sorry, sorry. Agnes turns the bottom of her foot up and looks at it. And she realizes: AGNES It's the last piece. LOUIE Of what?  (CONTINUED)  105.",
      "characters": [],
      "action_text": "AGNES Of that plate you broke. On my birthday. LOUIE Oh yeah. Hold on a second. He gets up and leaves the room. We stay on her face. Louie comes back with a pair of tweezers, a bag of cotton balls, and a bottle of rubbing alcohol. LOUIE (CONT'D) Here we go. He kneels down in front of Agnes again. LOUIE (CONT'D) Now tell me if anything hurts. Agnes nods, biting her lip. Louie whistles slowly while he works. LOUIE (CONT'D) Ooh... Getting closer... That doesn't hurt? Agnes shakes her head. LOUIE (CONT'D) Ah ha... little bugger... It's almost out... Agnes studies Louie's face. It's full of concentration and tenderness. LOUIE (CONT'D) (tearing up) Ready? AGNES For what? LOUIE I'm gonna pull it out. It may hurt. Ready for me? She nods.  INT. KITCHEN. AGNES AND LOUIE’S HOUSE - MORNING 185   185  Ziggy is cooking breakfast. Gabe inspects Agnes's trophy. GABE It’s kind of small. AGNES I got some gift certificates for puzzles too.  CONTINUED: 184   184 (CONTINUED)  106. THE FRONT DOOR OPENS OFF SCREEN, THEN SLAMS. Gabe jumps up and goes to see what’s going on. A beat later he comes back. GABE Dad left for work. ZIGGY Without me? GABE Da! Ziggy looks at Agnes, who smiles at him. ZIGGY Why are you smiling? AGNES It’s his way of saying you can go to school.  EXT. LOUIE'S PICKUP TRUCK - DAY A186   A186  The pickup truck travels down a country road.  INT. LOUIE’S PICKUP TRUCK. MOVING - DAY 186   186  Agnes drives west on the highway to Ellenville. Ziggy is riding shotgun. Nicki is squeezed in the back with Gabe; she reads out loud to everyone from one of her Shambhala books. NICKI “All worldly pursuits have but one unavoidable and inevitable end, which is sorrow. Acquisitions end in dispersion; buildings in destruction; meetings in separation; births in death. Do not dwell in the past, and do not dream of the future. One of Buddha's students asked him: \"Are you the Messiah?\" \"No,\" answered Buddha. \"Then you are a healer,\" said the student. \"No,\" the Buddha replied. \"Then you are a",
      "dialogue_count": 0,
      "word_count": 1899
    }
  ]
}