{
  "slug": "queen-sugar-101-first-things-first-2016",
  "title": "queen sugar 101 first things first",
  "genre": "drama",
  "format": "series",
  "scenes_count": 2,
  "characters_count": 2,
  "characters": [
    "RID",
    "REMY"
  ],
  "total_words": 10679,
  "total_dialogue": 2,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. VIOLET’S HOUSE - CONTINUOUS He enters to find Blue still napping with his head on Violet’s lap. Ralph Angel sits next to her. Down. VIOLET (softly) It ain’t easy what you doin’. Folks don’t wanna give you a second chance. I know. They don’t believe you can do it. But you can. You can, Ralph Angel. You paid your debt. You did your time. Just stay the course, baby. Do right, so right’ll be done by you. Ralph Angel nods. EXT. SUNSET BOULEVARD - DAY Charley zips through traffic, whizzing by BILLBOARDS of the latest blockbusters and hottest fashion. She eyes one in particular. Her husband looms large over the city hawking his sneaker line with his moniker stenciled across his chest: “DAVIS WEST: THE GENTLEMAN.” She smiles and pulls into valet outside a SWANKY RESTAURANT. Heads turn. She doesn’t notice. INT. RESTAURANT - A SHORT TIME LATER Charley sits at a prime table with her friends, RENEE and LENA, 30s. Both heavily eyelashed and impeccably dressed. CHARLEY I mean, there’d be a camera here right now filming. I don’t want my life on TV. I love it like it is. RENEE Maybe that’s cause your man treats you like a friggin’ queen. Pedestal, crown, the whole nine. Charley just smiles into her salad. There’s truth to that. RENEE (CONT’D) Ya’ll fancy and you know it. And people need to see that positivity, Charley. We’ll do the hair-pulling and name-calling. You’ll bring the class and the romance.  9. (MORE)",
      "characters": [],
      "action_text": "Like that story. You know. How you and Davis met at the fraternity thing. CHARLEY Phi Beta Kappa isn’t a fraternity, T. It’s an academic... LENA Whatever it is, it ain’t the club and it ain’t outside the arena. Bottom line? Everybody doesn’t have Davis West on their arm. Some of us? Real talk? Some of us have to play this game as hard as they play on the court. We need you on this, Charley. They really want   you . You know that. Just as Charley is about to respond, all three women’s phones ring, buzz and vibrate. One by one, they react to what they read. RENEE What the - LENA No. Its an alert from TMZ: Player’s Dirty Ball! LA Gladiators Star Players Caught in Away Game Sex Scandal. All business, Charley quickly scans and doesn’t see Davis’ name. Her attention turns to her friends who are distraught. CHARLEY Let’s go. We gotta get out of here. CUT TO: The women exit the restaurant to find the PAPARAZZI already swarming. Renee and Lena rush to their waiting cars like deer in headlights. Tears fall as they dodge lewd questions. Charley walks calmly to her car and hands a large bill to the valet. Cool as a cucumber. As the photographers yell her name, she adjusts her sunglasses and drives away.  10. RENEE (CONT’D)",
      "dialogue_count": 0,
      "word_count": 477
    },
    {
      "scene_number": 2,
      "slugline": "INT. NOVA’S PLACE - DAY The kitchen table is draped with a white cloth. Various jars of SALTS and SHELLS and ROCKS adorn it. Plants all around. Nova gently rubs oil on the tips of an ELDERLY WOMAN’S trembling hands while mumbling in French. Nova slowly opens her eyes when she’s done. NOVA Just two dabs. No more. ELDERLY WOMAN It real bad, Miss Nova. You don’t expect I need more? NOVA Two dabs only, sister. Faith fills in the rest. When Nova releases her fingers, her hands stop trembling. ELDERLY WOMAN  Mèsi, Jésus.  The Elderly Woman goes to pull out her pocketbook, but Nova gently stops her. NOVA  Mais non.   I won’t take it. Suddenly, there’s a strong KNOCK from the front of the house. NOVA (CONT’D) Stay here, sister. Nova crosses her living room. A colorful and exuberant decor. At the door is a white twenty-something COLLEGE STUDENT. NOVA (CONT’D) Listen. You knock like that again, I’m callin’ somebody. COLLEGE STUDENT Yes, ma’am. NOVA What do you want? COLLEGE STUDENT Um, I heard you, um, sold... grass. A long beat. Nova looks at him expressionless.  11.",
      "characters": [
        "RID",
        "REMY"
      ],
      "action_text": "COLLEGE STUDENT (CONT’D) I’m sorry. I mean, I’m supposed to say, um... “I Am Deliberate And Afraid of Nothing.” NOVA And where is that from? COLLEGE STUDENT From? She shuts the door on him. And goes back to the kitchen. NOVA Okay, now, Mrs. Blange. Two dabs. And also a few puffs on this when you have pain. Nova opens her cupboards and takes out a jar, wraps a joint in a small piece of fabric and hands it to the woman. ELDERLY WOMAN It really helped me last time. EXT. NOVA’S PLACE - LATER Nova sits on her porch with her laptop. We see that she’s writing an op-ed column about a recent incident of police brutality. We see her full by-line. OP-ED COLUMNIST for the New Orleans Picayune newspaper. RID, 25 and street-wise, drives up the street in an old Honda Accord with brand-new rims. He hops out and heads to her. RID What up, Nova? NOVA ‘Sup, Rid. RID Need a half of capers. NOVA No halves. You know better. RID I’m low and I got hypes ready. NOVA How much you marking up these days?  12. RID Twenty percent at the college. Fifty in the business district (off her disbelief) Why not? They got it. Escalation for risk. NOVA You’d make a killing on Wall Street, brother. Third flowerpot. He nods, lifts up the flowerpot, takes an ounce, leaves cash. But, stops short of taking a flyer that’s there as well. NOVA (CONT’D) Take it. RID C’mon, Nova. NOVA We need you at the rally. Be in solidarity with your brothers and sisters. RID I went to the last one! NOVA Well, there’s another one. And I swear, Rid, if I don’t see you and your crew up there, I’m cutting ya’ll off. And you know I got the best. You’d want someone marching for you. I can’t believe I even have to ask you, brother. RID You right. It just messes with my head, ya know. NOVA Yeah, I know. He heads out, but calls over his shoulder. RID What your fine-ass sister say about that Gladiator shake-down? NOVA What you mean?  13. If it’s against your wishes ain’t gonna be another occasion. These thots be thirsty, I’m sayin’. Erne",
      "dialogue_count": 2,
      "word_count": 10202
    }
  ]
}