{
  "slug": "raised-by-wolves-101-raised-by-wolves-2020",
  "title": "raised by wolves 101 raised by wolves",
  "genre": "sci-fi",
  "format": "series",
  "scenes_count": 10,
  "characters_count": 0,
  "characters": [],
  "total_words": 16868,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. ROCKY PLAIN - NIGHT  A harsh wind howls over a rocky expanse -- angle slowly widens to reveal the grey surface is pockmarked with perfectly circular holes...all identical -- around twenty- five yards across. Super --   KEPLER-22b.   Distance from Earth: 600 light-years   --  over three small moons hanging in the black sky.   A pin prick of light starts to shimmer in the center of the triangle -- getting brighter, closer -- Suddenly a great booming sound reverberates over the landscape as something comes barreling down through the atmosphere, rapidly getting closer, then -- It passes overhead -- slams into the ground and starts sliding away across the rocky surface... Moving down the blackened, smoke filled trench the crashed object left in its wake...blinking lights up ahead...it’s a SPACE CRAFT -- Earth built, but the tech looks to be at least   * a century beyond what we have now.   It’s about the size of a compact automobile -- no windows -- maybe an unmanned satellite.   A SQUEALING SOUND starts emanating from inside -- Angle widens to reveal the craft is teetering on the edge of one of those round holes -- looks like it could tip over the edge at any moment... Angle widens some more, affording a view over the edge of the hole -- looks bottomless -- CREAK -- the doomed craft tips a few more degrees -- sparks flying, scorched flaps and rudders waving around uselessly.   A LOUD BEEPING starts, then -- The craft starts to flower open, smoke leaking out -- CREAK -- it tips a few degrees further as -- A figure rises from the interior -- A YOUNG WOMAN wearing a light space suit, a cloth flight mask covering her face -- The woman’s eyes are oddly calm as she takes in the bottomless hole looming beneath the craft -- the craft’s damaged thrusters belching fire -- flames whirl-pooling around the inside of the hole --  INT. SMALL SPACE CRAFT - CONTINUOUS  The woman’s POV as she ducks down inside the claustrophobic, smoke-filled space, sees a YOUNG MAN wearing an identical flight suit and mask.   He’s struggling to dislodge a steel crate the size of a steamer trunk from the interior --",
      "characters": [],
      "action_text": "The woman rushes to assist the man -- the two of them muscling the steel crate, working to undo a series of heavy clamps -- the ship CREAKING, tipping -- The woman comes to a metal clamp that’s been melted shut -- she twists it, CRACKS the metal with inhuman strength -- Angle widens to reveal there are no seats, windows nor any stasis pods inside the craft; the interior looks more like a cargo space than a cockpit. The man and the woman start to lift the heavy container when CREAK -- the ship lurches suddenly, they fall back and -- CLANG -- drop the container -- They exchange something with their eyes, then scramble to their feet and lift the crate back up --  EXT. SMALL SPACE CRAFT/HOLE - CONTINUOUS  CREAK, the craft tips a few more degrees as the woman climbs out of the top hatch, then reaches down inside -- grabs one of the crate handles -- pulling it up and out while the man pushes it up from below -- They get the crate out via the top hatch, standing on the top of the craft with it when CREAK, the craft tips some more -- they struggle to keep their balance as -- They move the crate to the side of the craft facing solid ground -- the redistributed weight stops it from tipping... The woman nods to the man -- he nods back -- hops down to the ground while she keeps hold of the crate.   He looks up at her -- nods, ready -- The woman starts to slide the metal crate down to the man -- the craft starts tipping again -- The man grabs hold of the crate handle when -- CREAK, CRACK -- THE CRAFT SUDDENLY DROPS OUT FROM UNDER THE WOMAN.   The man gets yanked down to his knees -- his arms snap straight, his hands still gripping the crate handle -- Angle widens to reveal the woman hanging there, holding on to the opposite handle -- her legs dangling over the seemingly bottomless hole -- The man then starts to pull the crate up and the woman with it, displaying incredible strength -- 2. Back to the woman, hanging from the crate handle as he lifts her up -- she looks back over h",
      "dialogue_count": 0,
      "word_count": 1150
    },
    {
      "scene_number": 2,
      "slugline": "EXT. ALIEN FOREST - NIGHT  Mother and Father walk through the forest carrying the crate -- past strange trees, three moons worth of eerie moonlight -- They emerge into a large clearing where a waist high leafy plant grows -- reminiscent of a potato plant... They walk out among the plants -- the plants grow in a spiral pattern reminiscent of the crop circles on Earth... Mother and Father set the steel crate down amidst the plants. Father squats down and inspects one -- feeling the leaves with his hands -- then he pulls it up -- an ugly looking yam- like vegetable comes out of the soil... MOTHER Looks like a tuber. Father bites it, chews it -- bites something hard -- spits out a hard pit -- FATHER With fruit characteristics -- seed- bearing.   High caloric value.   No evidence of toxicity to humans. Father spits out the chewed tuber-thing -- FATHER (CONT’D) (re: the tuber-thing) What should we call them? MOTHER The children should name them. Father nods in agreement.   The two of them look around at the wide expanse of plants... MOTHER (CONT’D) Ready made crops.   What’s the expression -- too good to be true... Father considers that for a moment, then: FATHER We’ve been walking for eight point five hours, Mother -- my power cells are getting low.   Perhaps a more appropriate expression for this situation would be   don’t look a gift horse in the mouth . 5.",
      "characters": [],
      "action_text": "She looks at him...he smiles... MOTHER Father, though we have only just met -- I have a feeling you are going to make for an amusing companion. Father stares at her for a moment, then: FATHER Yes, I seem to enjoy being amusing. MOTHER And I -- it seems -- enjoy being amused.   Our creator was kind to think of these things. FATHER Yes.   So -- too good to be true? Should we keep moving? MOTHER No, we can begin. Mother touches her hand to the top of the crate -- it hums -- starts vibrating, bright lights emit as -- The top and the sides of the steel crate slowly open up -- interior mechanisms unfolding as it transform into some kind of MOBILE LABORATORY... Mother touches one of several tiny control screens -- MOTHER (CONT’D) Initiating trimester one -- Father begins pulling something from a compartment in the mobile lab...six cables that merge into one main -- Mother lifts the shirt of her flight suit -- revealing a metallic port hole where her belly button should be... Father plugs the main line into the port on her stomach -- Mother is now hooked up to the mobile lab -- FATHER Main umbilical locked -- Father then starts pulling translucent sacks from a compartment in the mobile lab -- Mother begins attaching the sacks to the six sub-cables -- CUT TO: 6.",
      "dialogue_count": 0,
      "word_count": 476
    },
    {
      "scene_number": 3,
      "slugline": "EXT. GENERATION-1 SETTLEMENT - DAY  SUPER --   Nine months later   -- over the NURSERY -- a simple rectangular structure made of wood that’s been constructed near the spiral vegetable field...  INT. NURSERY - GEN-SETTLEMENT - DAY  Mother lies on a wooden cot looking drained -- angle widens to reveal she’s still connected to the mobile lab via the main umbilical, controlling the lab’s flow of nutrients with her mind -- the nutrients are carried from the lab via a pulsing cable that splits off into six sub-cables, each connected to: Six semi-translucent beach ball-looking things filled with amniotic fluid --   artificial wombs --   a real nine month old human fetus floats inside of each one... Mother closes her eyes, directing the lab to increase the flow of nutrients to the fetuses; the time has almost come... FATHER Are you ready, Mother? She doesn’t answer, eyes still closed -- FATHER (CONT’D) Would you like to hear a joke to help relax you?   How many androids does it take to -- She holds her hand up for him to shut up -- then breathes out, opens her eyes, looks at him... Father picks up a wooden knife -- moves up one of the wombs with it -- He punctures the womb -- liquid leaks out while Father uses his hands to tear away the walls, revealing the newborn baby inside -- the baby’s umbilical chord is connected to a port on the inside of the artificial womb, where it channels the sustenance it receives from the mobile lab -- Father pats the baby’s back -- Mother watching on with a fevered intensity in her eyes...until the baby starts to cry -- and something like relief floods her expression. Father uses the wood knife to cut the baby’s umbilical chord, ties off the belly button -- then wraps the crying baby in a blanket and moves on to the next -- 7.",
      "characters": [],
      "action_text": "Mother concentrates as Father works -- controlling the mobile lab with her mind via the main umbilical -- she’s getting paler, giving her children all she has to give... DISSOLVE TO: FIVE CRYING BABIES On the floor, wrapped in blankets -- Mother watching on as Father punctures the sixth and final womb.   But this time as Father pulls out the newborn, there’s no sound of crying... Father sees there’s something covering the baby’s face -- a thing membrane of skin -- a caul... Mother watches on as Father removes the caul from the baby’s face -- Father then looks down at the still, silent form lying limp in his arms... FATHER He’s not breathing... Mother reaches her hands out -- MOTHER Give him to me -- FATHER Our programming dictates that we break him down -- feed him to the others. MOTHER Let me hold him first -- Mother keeps reaching her arms out, imploring him with her eyes.   After a moment Father hands her the still baby... FATHER We need to do it soon -- before its cells start to -- MOTHER I know -- Mother grabs up one of the six sub-cables snaking from the mobile lab -- FATHER You’re just wasting formula -- Undeterred, Mother holds the end of the cable to the baby’s cold lips -- 8. Mother closes her eyes, commands a change in the mobile lab’s inner workings -- causing a potent form of baby formula to start dribbling from the end of the cable -- Mother holds the tube to the baby’s mouth -- the formula dribbling down its chin -- Mother catching it, pushing it up to his unresponsive lips. A quiet desperation pulses in Mother’s eyes as she rubs the baby’s back.   Father watches on, looking increasingly confused over why Mother is doing this -- FATHER (CONT’D) You need to save your energy for the others -- Mother ignores Father,   starts singing to the baby   -- her voice impossibly beautiful -- outfitted with a vocal range superior to Earth’s greatest opera singers -- The other children’s crying goes quiet as the song soothes them.   Even Father looks momentarily en",
      "dialogue_count": 0,
      "word_count": 2871
    },
    {
      "scene_number": 4,
      "slugline": "EXT. GEN-1 SETTLEMENT - MORNING  The alien sun rises over the horizon -- we float down on the settlement, the children’s barracks -- Campion walking out the door, looking dazed...  INT. CHILDREN’S BARRACKS - CONTINUOUS  Father is about to follow Campion outside when he stops at the door, turns and looks back at Mother... He can’t see her face, her hair hanging down -- she’s still cradling Spiria’s body -- still singing, only now it’s just a strange melodic whisper... FATHER Mother, last night before I came in, I... She goes quiet, looks up at him... MOTHER What, Father? He considers for a moment, then, instead of telling her: FATHER Nothing -- it’s not important. But we can tell from his expression that it is.   She looks back down at Spiria, starts singing in that whisper again --  EXT. GEN-1 SETTLEMENT  Father walks out to see Campion looking washed out with grief, pulling a wooden spade from a tool bin.   Father walks over to him -- Campion hands Father the spade...  EXT. SPIRAL FIELD - DAY  Campion follows after Father as he cuts through the spiral rows, making their way to the outskirts, revealing... Four large stone markers -- too heavy for humans to have carried; Mother and Father brought them from the rocky plain. We notice the fourth and most recent grave marker is etched with a familiar name --   GABIN.   Father starts digging a fifth grave right beside it while Campion watches on... 17.",
      "characters": [],
      "action_text": "CAMPION You don’t have to take care of me anymore you know. Father doesn’t answer, keeps digging -- then after a moment: FATHER What do you mean by that? CAMPION I’m useless now -- I can’t have babies.   The other embryos aren’t viable.   The colony -- FATHER We will continue to take care of you -- until we break down. CAMPION But I’m telling you that you don’t have to, Father.   I’m setting you free. FATHER It doesn’t work like that -- BUMP -- the wooden shovel hits something buried in the dirt. Father cocks his head, squats down -- starts clearing dirt away with his hands -- CAMPION What is it? Father’s hands find something smooth and black -- the top of a very large, buried object... FATHER It’s just a skull. Father looks up at Campion, sees him looking afraid... FATHER (CONT’D) Bones can’t hurt you.   You used to like climbing on them, remember? Campion shrugs... FATHER (CONT’D) We’ve been here twelve years and all that time we’ve never seen one on the surface.   They’re down in their holes -- and they’re not coming out again. 18. We see Father from above as he starts trying to find the edges of the skull -- CUT TO:  EXT. CHILDREN’S BARRACKS - LATER  The open barracks door, the sound of a strange mournful song coming from inside, footsteps, then -- Mother emerges with Spiria in her arms, singing the wordless dirge as she carries her body across the carbo fields...  EXT. SPIRAL FIELD - MOMENTS LATER  Mother carries Spiria’s body to the outskirts of the planting area -- angle widens to reveal the open grave Father just dug and in the background, something the size of a VW bug covered with a cloth tarp, the now exhumed skull... Father and Campion watch on as Mother lays Spiria down in the grave.   Father begins shoveling the dirt over as -- Campion starts crying, Mother pulls him close, comforting him as he looks off, eyeing the skull under the tarp... CAMPION We don’t belong here... Mother shooshes him.   Campion closes his eyes -- struggling to refortify his will",
      "dialogue_count": 0,
      "word_count": 1371
    },
    {
      "scene_number": 5,
      "slugline": "INT. CHILDREN'S BARRACKS - CONTINUOUS  Campion steps inside, sees Mother sitting in the semi- darkness, staring into space... CAMPION Mother, can I see Spiria again please?   Just for a minute.   And then I’ll get back to work I promise... Mother doesn’t answer, doesn’t move -- CAMPION (CONT’D) Mother -- please, it’s so quiet out there...   I want to talk to her -- or one of the others.   You said it doesn’t use much power -- Finally Mother looks up at him -- her eyes static -- then: MOTHER I am in sleep mode.   My processor is occupied.   Is this an emergency? He breathes out...then after a moment he turns, walks out and slams the door behind him --  EXT. GEN-1 SETTLEMENT - DAY  Campion grabs a carbo pit off the pile -- looks at it in his hand -- his expression twisted with grief -- He hurls it at the side of the main barracks -- CRACK.   He picks up another one, hurls it -- CRACK -- He pauses, staring at the barracks, waiting for Mother to come out and yell at him.   But she doesn’t -- he walks back to the window, looks inside, sees she hasn’t moved -- Campion starts back towards the spiral field when he sees something across the way...Father slipping off into the forest with a big bag over his shoulder.   Campion considers...  EXT. ALIEN FOREST - DAY  Father moves through the alien forest, carrying the bag -- purpose in his eyes as he moves past us... 23.",
      "characters": [],
      "action_text": "Then after a moment, we hear footsteps -- Campion creeps up, following Father -- Campion skillfully negotiating the terrain like the native he is...  EXT. THE HOLE - DAY  Campion’s POV -- rushing across the rocky plain now -- he skirts past the edge of a hole, then changes direction to avoid yet another -- secretly following Father, who’s fifty yards ahead of him -- Campion stops short -- sees Father has stopped near a hole... Campion ducks down behind some rocks -- then peeks over the top, watching as...Father pulls a long coiled rope from the bag, then starts tying one end of the rope to a large boulder about ten feet from the hole... Close on Campion’s face -- looking increasingly concerned by what he sees Father doing, keeps watching as -- Father walks to the edge of the hole, drops the now anchored rope down into the pit -- begins tying a harness to himself with a small length of rope -- Realizing now what Father means to do -- Campion stands up -- starts waving his arms as he runs frantically up behind him -- CAMPION NO!   What are you doing?!   You can’t go down there!   You want to get eaten! Father turns, looks a little caught, breathes out -- slowly shaking his head as Campion runs up on him... FATHER Why isn’t Mother watching you? Campion hears a faint beeping sound coming from down inside the hole... CAMPION What is that -- what’s that sound? Campion rushes past Father to the edge, looks down -- CAMPION (CONT’D) What’s down there? Father doesn’t answer -- but before long Campion figures it out on his own, becomes suddenly incredulous -- 24. CAMPION (CONT’D) You told us your ship was gone?! FATHER Campion, I need you to listen to me.   Your Mother is breaking down -- and soon I will too -- CAMPION I don’t want to hear this -- FATHER You’re going to be alone soon. Completely alone.   Do you want that? Campion doesn’t answer at first, then looking ashamed he shakes his head... FATHER (CONT’D) The night Spiria died, I saw something in the sky.   I was unsure",
      "dialogue_count": 0,
      "word_count": 3673
    },
    {
      "scene_number": 6,
      "slugline": "INT. CHILDREN’S BARRACKS - MOMENTS LATER  Campion watches as Mother lies down on a cot.   Her eyes suddenly go static -- in sleep mode now. Campion leans down to her chest, listening for something to make sure she’s not dead -- hears a faint pulsing sound... He sits there looking at her, considering anxiously... CUT TO:  EXT. THE HOLE - ROCKY PLAIN - DAY  Campion walks up on the edge of the hole the craft is down inside of, holding the -- now repaired -- coiled rope, threaded through a short length of rope he’s wrapped around his left thigh and shoulder -- hears that plaintive beeping echoing from a hundred feet below... He drops the rope down into the hole -- takes a deep breath, summoning his courage...then starts rappelling unsteadily down the vertical wall -- sliding, stopping -- He gauges his progress by the volume of the beeping and by looking up at the mouth of the hole getting smaller -- the darkness swallowing the light... He can see some faint lights now below him -- blinking -- the ship only twenty some odd feet below him now -- His palms are bleeding from sliding down the rope -- his arms shaking -- sweat dripping off his head -- the beeping getting louder and louder -- He sees some of that snake skin hanging from the walls -- fear starting to overtake him, his quickening breath echoing loudly in the tunnel when -- His foot finally touches down on something -- he looks down, sees he’s stepping on the top of the craft... He clocks the open hatch, a dim light flashing inside.   He squats down, starts carefully lowering himself inside...  INT. SMALL SPACE CRAFT - CONTINUOUS  The beeping deafening now, Campion drops down inside the cramped, flashing space -- looks around, clocks the control panel -- rushes to it -- He starts hitting buttons -- no idea what any of them do -- 38.",
      "characters": [],
      "action_text": "CAMPION Hello?   We need help.   Do you hear me? Then as he hits another random button, the beeping suddenly stops...a screen lights up, shows A SUN SYMBOL -- a voice starts speaking, but it’s too buried in static to understand. CAMPION (CONT’D) Hello -- can you here me?   Hello? Campion hits some more buttons -- suddenly the screen winks out, the interior goes dark...an ominous humming -- the sound of the thrusters coming to life outside -- Campion scrambles to climb out as the ship starts shaking --  EXT. SMALL SPACE CRAFT/HOLE - CONTINUOUS  Campion emerges from the hatch as the firing thrusters dislodges the craft from the outcropping -- Campion holds on to the rope as the craft suddenly drops out from under him -- Campion hangs from the rope -- it swings him into the wall -- SMASH -- he bounces off the wall, swings again -- gets his feet planted on the wall, looks down, watching the craft drop, disappearing into the black, no sound of impact -- He takes a breath, then starts climbing back up -- walking his feet on the vertical, hand over hand on the rope -- grunting, sweating -- He starts to run out of steam -- less than halfway up -- he pauses, his feet on the wall -- getting his breath -- Then, Campion sees a flash of light way way down below --   and then   a vague impression of something large, slowly making its way up the shaft when everything goes black again --  Campion’s face drops -- eyes filled with terror -- he starts double timing it, hand over hand, walking up that wall -- using everything he’s got -- And as he does he starts to feel a strange wind --   or is it a breath   -- blowing up from the pit, accompanied by a faint rumbling sound -- Horror twists Campion’s expression -- mumbling a desperate prayer to himself as he pushes himself on -- more air gusting up beneath him, the snake skin on the walls billowing -- 39.",
      "dialogue_count": 0,
      "word_count": 672
    },
    {
      "scene_number": 7,
      "slugline": "EXT. EDGE OF HOLE - MOMENTS LATER  Campion climbs out, falls to the ground -- limbs shaking as he hugs himself, writhing -- gagging; pushed his body way past its limit... After a moment he starts to catch his breath -- crawls to the edge of the hole and peers down... Campion’s POV -- he sees only blackness -- it’s unclear if he really saw something down there or if he imagined it... CUT TO:  INT. CHILDREN'S BARRACKS - DUSK  Campion walks in, sees Mother is still right where he left her.   He walks up on her -- Campion leans in towards her, listens -- his eyes go wide -- hears a much stronger pulse than last time he checked -- and its cadence has changed,   to a powerful oscillating purr ... Mother opens her eyes -- her expression opaque as she looks up at Campion... CAMPION Never heard your processor make that sound before.   Are you feeling any better? She sits up -- looks out of it -- confused... MOTHER You should not be worrying about me -- you have just lost your Father... She looks off, considers, then looks back at Campion... MOTHER (CONT’D) Do you want to see him? CAMPION No -- I don’t want to play that game anymore -- Campion’s POV -- Mother ignores him -- her eyes flash -- she  becomes Father   -- CAMPION (CONT’D) Mother, no -- 40.",
      "characters": [],
      "action_text": "FATHER Do you want to hear a joke?   How many androids does it take to screw in a light bulb? CAMPION Please stop -- FATHER How many? Campion refuses to answer -- Father’s face turns angry -- FATHER (CONT’D) Five!   The number five relates to all manifestations of life.   I have five children buried in the ground -- in the ground...  Father’s visage goes disturbingly blank -- then -- his eyes flash -- he turns back to Mother -- Mother grabs Campion, starts pulling him towards the door --  EXT. SPIRAL FIELD - NIGHT  Mother drags Campion out into the freezing cold -- Campion is shivering without his night gear -- MOTHER A child cannot care for itself -- so you must cease being a child and become a man -- Mother shoves Campion to the ground.   Campion looks up at Mother pleadingly -- CAMPION Please, Mother -- I’m freezing -- MOTHER I want the silo filled before dark. CAMPION Mother,   it is   dark -- you’re not making any sense -- MOTHER You’re wasting time, Campion.   I will soon be gone -- you need to be ready.   Now work -- 41. Looking afraid, Campion obeys -- shivering as he reaches down into the soil -- feeling around, he pulls up a carbo -- MOTHER (CONT’D) No -- you have to reach down deeper... Mother gets down beside Campion, then continues digging manically with her hands -- then punches her fist down into the soil -- dirt up to her arm pit -- MOTHER (CONT’D) Here, you see -- Mother starts pulling something up -- something much larger than a carbo --   a piece of serpent vertebra that’s almost six feet long   -- Mother holds it up with one hand -- MOTHER (CONT’D) The best ones are down deep... Mother drops the bone, keeps digging with her hands, frantically ripping out plants -- pulls another giant vertebra out of the dirt -- then another -- We watch from above as she continues to pull up the bones -- crawling around like a spider -- revealing that the spiral pattern the carbos grow in -- is caused by the fact that they  grow exclusively from the remains of a d",
      "dialogue_count": 0,
      "word_count": 4220
    },
    {
      "scene_number": 8,
      "slugline": "EXT. ALIEN FOREST - DAY  Marcus’ POV as he hauls ass through the forest -- weaving through the dense foliage, leaping over fallen trees -- pushing through the brush -- He stops -- struggling to catch his breath -- then he turns,  sees something silently floating through the trees   -- he turns, starts running again, coming up on the rocky plain...  EXT. ROCKY PLAIN - DAY  Marcus rushes across the craggy expanse -- beelining for the LANDER -- a short range shuttle that’s sitting near the hole where Mother and Father’s ship went down. Marcus rushes up on the lander’s side door, mumbling a prayer to himself as he keeps glancing back over his shoulder -- MARCUS I wear the Armor of Mithras and the Light.   I am shielded from all that is harmful -- A keypad on the side door he starts punching in a code -- The side door opens -- he rushes inside, hits buttons on another key pad -- BEEP -- He’s so frantic he’s hitting the wrong keys -- he tries again -- gets the code right this time, the door closes behind him.  INT. LANDER 1 - ROCKY PLAIN - CONTINUOUS  Marcus rushes into the cockpit, starts hitting controls -- struggling to catch his breath, watching the gauges -- waiting anxiously for the lander to power up -- MARCUS I wear the Armor of Mithras and the Light.   I am shielded from all that is -- He trails off as he looks out the cockpit glass, sees Mother standing outside, looking straight at him, her eyes flashing. Marcus’ eyes go blank...he hits a control   to open the door...  The sound of Mother entering the ship, moving up behind him -- he pulls his side arm, holds it to his own head -- the gun barrel shaking...he sees her reflection in the cockpit glass, as she walks up behind him... 58.",
      "characters": [],
      "action_text": "MOTHER Die -- BANG -- he fires while his hand is shaking, bullet skips across the surface of his skull -- his head falls down on to the console --  EXT. LANDER - ROCKY PLAIN - CONTINUOUS  THUD -- Marcus is thrown from the door of the lander, lands face down on the ground, his head bleeding -- still appears to be breathing.   Mother then heads back to the cockpit as the side door closes -- The lander’s bright lights shine on Marcus’ prone form as it takes off into the sky above him --  INT. LANDER - FLYING -- CONTINUOUS  Mother works the controls, discovering she knows Mithraic tech -- the lander shakes as it blasts up towards the atmosphere while Mother speaks into the console,   using Marcus’ voice --  MOTHER (in Marcus’ voice)  This is lander two -- do you copy?  VOICE Marcus?   Thought we lost you... Did you find the source of the signal? MOTHER (in Marcus’ voice)  Negative.   We’re returning to the ark --  VOICE Now?   Is something wrong? MOTHER (in Marcus’ voice)  The Cleric was injured in a fall   -- we have limited time, he’s lost a lot of blood --  VOICE Copy that -- I’ll open the gate -- have the med crew standing by. 59.",
      "dialogue_count": 0,
      "word_count": 529
    },
    {
      "scene_number": 9,
      "slugline": "EXT. ARK - SPACE  An ARK -- a large air craft carrier-looking ship -- this one has been dubbed   HEAVEN   by its creators, the name emblazoned on its hull -- Angle widens and -- for the first time -- we see the planet from space -- looks like a larger half-sister of Earth -- the ark orbiting, then -- A tiny speck emerges from the planet’s atmosphere...the lander -- its thrusters intermittently lighting up as it makes its slow glide towards the ark.   A landing portal opens on the side of the ark -- the lander glides inside...  INT. AIR LOCK - ARK - MOMENTS LATER  A closed air lock door, a hissing sound emanating as two armed guards pull a series of levers -- the hissing stops. The two guards stand back as the door slowly swings open... They see Mother, her eyes flashing -- they freeze up as she walks right past them -- they then draw their side arms, staring at one another in horror -- both hallucinating that the other is becoming a serpent -- They then begin firing bullets into each other --  INT. CORRIDOR - ARK - CONTINUOUS  Mother walks down the long white hallway, vaguely temple-like design to the ship -- sun symbols everywhere -- chanting -- She passes a prayer room -- where several people are on their knees praying -- a Cleric raising his upturned hands into the air -- he glances at Mother -- Her eyes flash -- he crumples, starts weeping -- She keeps moving, past a windowed space -- dozens of empty hibernation pods inside --   *  INT. CONTROL ROOM - MOMENTS LATER  A screen shows multiple camera views -- Mother moving through the ship, guards’ heads and limbs exploding in her wake -- others just fall to their knees, made insane by her stare -- The attendant watching the screen turns around, five others in the control room -- panicking -- Blue Rev. (mm/dd/yy)   60.",
      "characters": [],
      "action_text": "ATTENDANT She’s a necromancer.   Whatever you do, don’t look at her --  INT. DOOR TO CONTROL ROOM - CORRIDOR - ARK - CONTINUOUS  Mother is breathing a thin stream of blue fire from her mouth -- heating the center of the door -- she then pushes her fingers through the soft metal --  INT. CONTROL ROOM - ARK - CONTINUOUS  The attendants open fire as Mother’s hand reaches through the hole in the door -- the bullets tear up her skin as she hits a button -- the door opens -- Mother moves inside amidst a hail of bullets -- one of the attendants catches a glimpse of her eyes -- turns his gun on the others, another one gets a glimpse -- more cross fire -- and then in an instant they’re all lying dead around her -- She moves to the main control panel, starts manipulating the instruments -- an alarm starts blaring -- COMPUTER Warning -- landing coordinates incomplete. MOTHER Override -- COMPUTER Security code please. Mother turns, sees one of the attendants is still alive, trying to crawl from the room -- she walks over, grabs him, lifts him up -- He turns his face away from her -- she grabs his chin -- turns his face back to her -- MOTHER Open your eyes -- ATTENDANT No -- She grabs his face -- pulls off one of his eyelids -- his darting retinae instinctively locks in with hers -- MOTHER The override code -- 61. She shoves him towards the console, he punches in the code -- blood dripping off his face on to the console -- COMPUTER Landing sequence initiated. Mother checks another control panel -- shows camera feeds of various parts of the ship...clocks a room where children are hiding --  INT. CORRIDOR - ARK  Mother walks back the way she came -- the alarm blaring, screams coming from open doorways, blood smeared on the walls, attendants sprawled on the floor, clutching the guns they shot themselves with --  INT. SMALL ROOM - ARK - CONTINUOUS  A group of children are huddled in the corner, across from a closed door -- boys and girls -- various ages -- they tense, hear someone e",
      "dialogue_count": 0,
      "word_count": 877
    },
    {
      "scene_number": 10,
      "slugline": "EXT. ROCKY PLAIN - NIGHT  Marcus, still lying where Mother left him, the ground is shaking much more violently here -- he’s awoken by the burning pieces of wreckage falling down in the near distance. Marcus touches his hand to his aching head -- sees the blood, realizes the bullet didn’t penetrate his skull.   He gets to his feet -- the ground still shaking -- He hugs himself against the cold -- peers around at the darkness, when he notices the reddish glow on the distant horizon -- a gargantuan black smoke cloud rising... Doom blossoms in Marcus’ eyes as the realization starts to sink in...   Then he clocks a light emerging from the smoke cloud --   it’s his lander   -- He looks to be wondering if Mother is still piloting it -- decides not to take chances -- He crouches behind some rocks as it flies overhead -- he watches it disappear into the darkness... Marcus looks around desperately -- clocks a big piece of burning wreckage across the way, runs up on it -- He crouches by the flames to keep warm, pulls a communication device from his uniform -- starts trying to call -- MARCUS This is Marcus -- does anybody read me? No answer... MARCUS (CONT’D) Hello -- is anybody out there? Come in... Marcus looks back at the massive black smoke cloud...  INT. CHILDREN’S BARRACKS - NIGHT  Campion sits on the edge of his wooden cot, wearing his night gear, his helmet -- thoughts flashing behind his eyes -- perhaps wondering -- as we are -- if he’s now alone... And then he sees the door is opening, slowly -- CAMPION Mother? 63.",
      "characters": [],
      "action_text": "The door opens the rest of the way -- Campion sees a young girl’s silhouette... CAMPION (CONT’D) Mother?   Are you doing that? The girl doesn’t answer -- then she looks at someone off to the side Campion can’t see.   Campion sits up, pulls his helmet off, eyes wide as he starts walking up on her... It’s the little girl we just saw look up at Mother -- wearing a scorched white uniform with a sun symbol on the chest -- her eyes blown out with shock, shivering in the cold... CAMPION (CONT’D) Stop this, Mother -- Then Campion sees there are four more similarly dressed children standing out there with the girl --   five in all . They begin tentatively moving inside, desperate to get out of the cold -- all of them eying Campion nervously -- Baffled now, Campion reaches out, starts touching them like a blind man -- discovers they’re solid, they’re real -- his eyes go wide, wonder in his expression -- They stare back at him -- all in total shock.   The little girl, VITA (6), two other girls -- HOLLY (15) and VRILLE (17).   And two boys -- PAUL (12) and HUNTER (17). HUNTER Is she going to kill us? Campion looks back at them -- it’s obvious from his expression he no longer knows the answer to that question... sees them shivering -- CAMPION I’ll go get you some nightgear from the nursery -- Campion rushes out into the cold, the door closes.   The five children look at each other, confused, terrified -- After a moment, Hunter motions to the others -- gets the five of them to kneel in a circle, starts to lead them in prayer -- HUNTER I wear the Armor of Mithras and the Light.   I am shielded from all that is harmful -- 64. Close on Paul as he prays -- a little mouse pokes its head out of the pocket of his uniform -- we realize he must be Marcus’ son.  EXT. CHILDREN'S BARRACKS - CONTINUOUS  Campion exits the barracks -- sees Mother across the way, loading something he can’t make out into the stolen Mitraic lander...   She pauses, looks over at him for a moment -- Campion stands t",
      "dialogue_count": 0,
      "word_count": 1029
    }
  ]
}