{
  "slug": "ready-player-one-2018",
  "title": "ready player one",
  "genre": "sci-fi",
  "format": "film",
  "scenes_count": 6,
  "characters_count": 1,
  "characters": [
    "PARZIVAL"
  ],
  "total_words": 23804,
  "total_dialogue": 1,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. CENTRAL PARK - NIGHT - THE OASIS We open on BETHESDA FOUNTAIN in the heart of New York’s Central Park, then we pull up and away, hurtling backwards over the city until we come to rest in TIMES SQUARE, which has been blocked off for an EPIC STREET RACE. EXT. TIMES SQUARE - NIGHT Huge crowds line the street, cheering on TWENTY EXOTIC VEHICLES waiting at the starting line. A MOTORBIKE straight from Road Warrior idles on the outside lane. Most of the other racers are in STOCK CARS, every driver wearing the same helmet. These are SIXERS, we’ll get back to them later. Interspersed with the Sixers are vehicles of every variety. And when I say every variety I mean that some of them are cars, and some of them are hover craft, and one of them is a BLIMP with a jet engine on it. Their drivers are every size, shape and color, too. They are called GUNTERS. That too will be on the quiz. The closer we get to the West Side of 7th Avenue, the more Gunters there are. The second to last car is probably the most bad-ass of the lot, a replica of DECKARD’S SPINNER from BLADE RUNNER. AECH, a handsome guy with the shoulders of a linebacker,  checks the OVERSIZED ENGINE strapped to the roof. PARZIVAL (O.S.) Lemme guess - Mario Kart? He turns to see PARZIVAL, standing beside his vintage DELOREAN, literally the car from BACK TO THE FUTURE. He’s nineteen years old, good-looking and fit. AECH No. Designed it myself, actually. Bad ass, right? PARZIVAL It’s very Nintendo. Their friendly rivalry requires busting on each other  constantly.",
      "characters": [],
      "action_text": "AECH Better than your p.o.s. level 4 skin over a level 1 frame. PARZIVAL Weird that I’m still gonna outrace you. What does that say? AECH It says you’re delusional, Z. I’m in the two spot. No way you get farther. PARZIVAL Let’s see who makes it past 57th. A SIREN signals the drivers to get in their cars. Parzival makes a fist, Aech returns the salute. PARZIVAL (CONT’D) First to the key. AECH First to the egg. And they get in their cars. EXT. SEVENTH AVENUE A GUNSHOT starts the race and the cars roar onto Seventh Avenue. Almost immediately, an Eighteen Wheeler runs a red light and A THIRD OF THE CARS RAM RIGHT INTO IT. And they literally explode. Just like that. Boom, half the cars are incinerated. Nobody bats an eye or stops cheering. IN THE DELOREAN Parzival stomps on the accelerator, chasing Aech's dust. Cars bump and jockey for position, but Parzival is careful to avoid all of them, steering with tremendous precision. ON 44TH STREET Metal walls suddenly pop up from the street, incongruously and with pretty much no logic to their placement. More of the Sixer vehicles CRASH or SPIN OUT. Aech has already passed them, and Parzival simply veers through the debris.  2. PARZIVAL Dumbasses. You don’t start from the outside lanes. He catches up with Aech, and, as they HANG a LEFT on 45th street, he cuts past him on the inside. Parzival’s winning. For now. EXT. CITY STREETS - CONTINUOUS Parzival hangs a RIGHT on 8th Avenue and puts the pedal to the floor. On every block, a different obstacle emerges, and each time another driver is taken out. SINKHOLES open at 47th street, a MANIAC WITH A FLAMETHROWER sprays the intersection at 50th street, and at 54th street... A T-REX stomps out into the street and Parzival nimbly swerves between its legs, just as its massive jaws POP THE BLIMP. It’s not your typical street race. EXT. 57TH STREET - CONTINUOUS Parzival turns right at 57th to get back over to Seventh Avenue, and now AECH suddenly BOMBS OUT OF NOWHERE and PASSES HIM. He fli",
      "dialogue_count": 0,
      "word_count": 999
    },
    {
      "scene_number": 2,
      "slugline": "EXT. CENTRAL PARK - CONTINUOUS Parzival and Aech run up to the wreckage. The RIDER emerges from the smoke, whipping off her helmet, revealing... ARTEMIS A meteor?! Seriously? Aech and Parzival gape at a woman in her early twenties; raven hair, big hazel eyes, rounded cheekbones and a perpetual smirk. She HURLS HER HELMET at the Meteor. It too explodes. AECH You almost made the park, you realize how huge that is? ARTEMIS Do I have the key? No. Not huge. PARZIVAL (star struck) Hey. You’re Artemis! ARTEMIS Yeah, I know. She walks past them. Parzival, staring, has lost whatever sense of cool he seemed to possess. PARZIVAL I love you. I mean... we love you. AECH (interrupting) What he means is, we’re big fans. We’ve read your stuff, seen your channel... PARZIVAL You should come with us! ARTEMIS (to Aech) He always like this? AECH No.   (to Z, under his breath) Dude, act like you’ve met a girl before.  5.",
      "characters": [],
      "action_text": "PARZIVAL I just mean... to talk about Halliday, and the Egg. And the race. ARTEMIS You guys are gunters? I mean, serious, not just jerking off on the weekend...? PARZIVAL Not jerking off on weekends at all. AECH My socially inept friend here was the first to 49th, first to 55th... ARTEMIS Wait a minute... you’re Parzival. PARZIVAL Yeah, I know. Artemis smiles, touche. She turns to Aech. ARTEMIS So where is your place anyway? INT. AECH’S BASEMENT - OASIS A suburban rec room, circa the early 1980’s. Movie and comic book posters cover the wood-paneled walls. A vintage RCA television is hooked up to a Betamax, a LaserDisc player, and several vintage videogame consoles, most prominently an ATARI 2600. ARTEMIS Wow. Aech leads Artemis in, Parzival right behind. PARZIVAL Show her the workshop. Aech, ahead of him, kicks open the door to what should be a closet... ARTEMIS’S POV -- AN ENORMOUS WORKSHOP/GARAGE Completely out of proportion to the room, Aech's garage is an enormous space filled with exotic vehicles, including replicas of the BATMOBILE, PEE WEE’S BICYCLE, and most impressively...  6. An unfinished replica of a familiar GIANT ROBOT. ARTEMIS Is that... AECH The Iron Giant? Yeah, just got the commission for it. No big deal. Artemis checks out the surface of the enormous, stylized robot. The unfinished parts of it are still a 3D grid. PARZIVAL Aech’s work is top rated on the modboards. AECH (shrugging) It’s mostly about getting the right skins, what you can license, you know? Like Matrix, Matrix kids, forget it, but Star Wars, Marvel, Dark Knight, the classic Ridley Scotts... ARTEMIS Golden Age Spielberg? AECH Pre-Jurassic is a bitch. ARTEMIS Always wanted the Mothership from Close Encounters. AECH Yeah, tough to find. PARZIVAL Tough to park. Artemis laughs. Parzival lights up. ARTEMIS Never thought of that. AECH Oh, yeah, handling is an issue. I mean you can’t build a Giant Robot and have it ride like a Buick Regal. ARTEMIS Buick... ?  7. PARZIVAL A shitty car from H",
      "dialogue_count": 0,
      "word_count": 1416
    },
    {
      "scene_number": 3,
      "slugline": "EXT. WADE’S STACK - NIGHT We follow Wade as he scrambles up the outside of the stack. The climb grows increasingly perilous as he goes. Physically, Wade’s no specimen, but this is one thing in the real world that he is actually good at. WADE Just remembered where they are. He finally reaches his unit. He peers through the BATHROOM WINDOW, then climbs through it. INT. WADE’S HOME - BATHROOM - NIGHT In the pitch dark bathroom, Wade cracks the door and can now see his AUNT ALICE, 30’s and haggard in a meth-y kind of way, standing in the living room. WADE They’re in the kitchen. On top of the fridge. Alice turns to look at the kitchen, AWAY from Wade. When she starts to walk in that direction, Wade makes his move. INT. WADE'S HOME - LIVING ROOM - NIGHT Wade dashes into the messy, cramped living room. He quickly stashes the gloves under the COUCH CUSHIONS, then walks as quietly as he can to the front door. Alice, annoyed, paces back into the living room... ALICE (INTO HEADSET) I can’t be late again. ... just as Wade walks IN through the front door. WADE They’re right there, Alice. He points to the gloves, sticking out from under the couch cushions. WADE (CONT’D) See? I didn’t have em. Alice, slightly chastened, takes the gloves from him, then settles into a recliner.  13.",
      "characters": [],
      "action_text": "RICK (O.S.) That is bull pucky, amigo. A FLUSH from the bathroom as RICK, Alice’s white trash boyfriend, walks into the living room. Wade grimaces, realizing... WADE You were in there when... RICK Fell asleep, it was a long one. (to Alice) This lying bastard had the gloves. Rick continues past them and into the kitchen. Alice glares at Wade. ALICE Damnit Wade, bad enough you don’t have a job without screwing up mine. Now you can’t use ‘em at all. WADE What? But I... Alice waves him away, slipping on her IOI gear. She speaks into her official IOI headset and waves her hands awkwardly. ALICE (INTO HEADSET) (monotone) This way, please... Wade glares at Rick, now tugging on a beer. Rick shrugs. INT. WADE'S BEDROOM - NIGHT Wade enters the tiny slice of the unit he calls his room. Outside his window, like a cruel taunt, is a giant billboard advertising a SHAPTIC@ BRAND HAPTIC BOOTSUIT, a totally badass immersion rig for logging in to the Oasis. The BILLBOARD advertisement reads “Log In!” and features a muscular guy modeling a suit that promises “Total Interface” and “Real-time Neuromuscular Response!” Hold on Wade, staring up at that ad.  14.",
      "dialogue_count": 0,
      "word_count": 435
    },
    {
      "scene_number": 4,
      "slugline": "INT. WADE’S HOUSE - THE NEXT DAY (REAL WORLD) Wade wakes up, wipes the sleep from his eyes. It might be from spending too much time in the Oasis, but there’s a moment of hopefulness, like maybe he’s someplace awesome... But nope, same crappy apartment, same billboard taunting him. INT. WADE’S HOUSE - MORNING Wade pours himself a bowl of cereal and milk water (milk- flavored water). From the kitchen table, through an open door, Wade can see into his aunt’s bedroom. Alice is passed out from a long night of work, Rick lies asleep on top of her, drooling. Wade cringes. CLOSE ON -- the HAPTIC GLOVES and VISOR sitting on Alice’s desk. They’re YANKED out of frame -- INT. CARGO VAN - DAY (REAL WORLD) Back in his hideout, Wade slips his VISOR on, then logs in. He sees the last three words anyone sees before leaving the real world for the Oasis: READY PLAYER ONE EXT. CITY STREET -- THE OASIS INCIPIO, the MAIN PLANET of the Oasis, is a giant city filled with every building or structure, real or fictional, you can possibly imagine. WADE (V.O.) When Halliday first built the Oasis, it was an open-world, massively-multiplayer online game. Over time it grew into way more than that. Parzival suddenly appears, mid stride. He passes the Eiffel Tower next to the Taj Mahal, with EXXON/WHOLEFOODS corporate headquarters jammed between them. WADE (V.O.) One of his biggest ideas was tying your avatar into your DNA, using their proprietary software. One account per person, no exceptions.  15.  (MORE)",
      "characters": [],
      "action_text": "Everyone started equal in the Oasis. And it was free. Parzival opens his HUD, his “heads up display” which appears as a seamless interface with the world around him. He has gamer attributes -- SPEED, STRENGTH, MAGIC, AIM -- and an INVENTORY for weapons, spells, and vehicles. WADE (V.O.) Your avatar was fully upgradeable, but that took experience. And money. The DELOREAN is in there, currently marked “damaged”. The price to fix it is 5,000 gold coins. His account has a balance of 4,560. PARZIVAL (using a voice command) Locate Aech. An image of AECH comes up; like the graphics over any sports broadcast, his avatar moves and poses and winks. “LOCATING...” appears. Wade continues on his way, passing through what looks like the heart of the city. Off to his right is the main GREGARIOUS GAMES headquarters, a gleaming, castle-like tower. WADE (V.O.) Once the Oasis took off, Halliday’s partner Ogden Morrow got pushed out. Since Halliday died, no one knew exactly who ran the Oasis anymore. But a good guess? Just down the block from Gregarious is IOI HEADQUARTERS, a massive, corporate monstrosity. WADE (V.O.) IOI, Innovative Online Industries. They build the haptic gear. The gloves, the visors... INT. WADE’S HIDEOUT - THE REAL WORLD Wade lies in his haptic rig, a series of quick cuts of THE IOI LOGO, on Wade’s gloves, visor, the boots… IOI has their name on everything.  16.  WADE (V.O.) (CONT'D) EXT. INCIPIO (OASIS) Back in Incipio... WADE (V.O.) Which means they control most people’s access to the Oasis. Parzival checks his HUD, Aech is still being “located”. WADE (V.O.) Halliday kept IOI in line. But now? Well if you asked the rebels, IOI’s plan was to turn the Oasis into a hellish place where rules were numerous and always followed. AECH (O.S.) S’up, Z? AECH now appears in a window in a close-up, clearly real time footage. Wherever he is it’s loud and dusty, and bursts of smoke and gunfire make it difficult to see and hear. PARZIVAL What the hell are you doing? AECH I'm tr",
      "dialogue_count": 0,
      "word_count": 6637
    },
    {
      "scene_number": 5,
      "slugline": "INT. VONNEGUT Parzival watches in disgust as the THIRD SLOT on the scoreboard changes to the name “NOLAN SORRENTO”. Feeling guilty, Parzival pulls up Aech in his contacts. There’s no response, so Parzival leaves a message. PARZIVAL I’m sorry. I should’ve said something, you’re my best friend. Here’s how to beat the first challenge... And while he explains... EXT. STREETS OF PLANET DOOM Artemis is making her way through the streets of Planet Doom. Her armor meter is high enough that she doesn’t need to worry about crossfire. The occasional bullet or shell pings off her and falls to the ground. Then she notices someone following her. It’s IOI Security. She speeds up a little, then walks right past the entrance to her CLAN CLUBHOUSE, hoping to lose the tail. She turns a corner. EXT. PLANET DOOM - NIGHT TWO IOI security guards come around a corner, only to be JUMPED by ARTEMIS. She is completely bad-ass in the Oasis, and makes quick work of them with some insane martial arts moves combined with a BLASTER that she uses with deadly accuracy. More Security Guards close in, firing more ordinance. Artemis’s shields are starting to take damage. She has to retreat. EXT. ALLEY -- PLANET DOOM Artemis is PINNED DOWN in an alley, IOI Security closing in from both directions. She ducks out from behind garbage cans, returning fire, but in a few moments she’ll be overwhelmed. PARZIVAL (O.S.) Hey Artemis...  47.",
      "characters": [
        "PARZIVAL"
      ],
      "action_text": "Artemis looks up to see Parzival, standing on a ledge above her, wearing A PAIR OF RED HEADPHONES. He tosses her a matching pair. PARZIVAL (CONT’D) Put these on. She puts them on and them Parzival pulls out a supremely bad- ass RAIL GUN. PARZIVAL (CONT’D) Just bought this puppy. Check ‘er out. Parzival fires and the gun spits out a super-heated light wave that sprays like a shotgun. The blast incinerates everything in its path, except Artemis, who stands in the center of it, unharmed. An impressed Artemis looks up at Parzival. PARZIVAL (CONT’D) Headphones of limitless protection. Keep em, those are my spares. Parzival jumps down to the alley to join her, a fine mist of vaporized IOI goons whirls through the air. PARZIVAL (CONT’D) So what was that all about? ARTEMIS Long story. Let’s get off the streets. Parzival nods, happy to. As they walk away... Reveal a HOODED FIGURE, watching them from afar. He follows. EXT. SAFE ZONE -- PLANET DOOM A comically thin strip of sidewalk is the only safe zone on Planet Doom. ARTEMIS Don’t know if I told you this, but I like your look. PARZIVAL You do?  48. ARTEMIS Yeah, I mean, the Atari Game burial t-shirt, very cool. Also, I like that you’re not all ‘roided out. PARZIVAL Yeah, I hate that. ARTEMIS Your friend... PARZIVAL I’ve tried to talk to him about it... ARTEMIS The shoulders. PARZIVAL Too wide, right? ARTEMIS Totally. I mean, nothing personal but... even your arms are a little big. Parzival checks out his arms. PARZIVAL Are they? ARTEMIS For your frame. I’m just saying, the biceps are kind of... BAM! Parzival’s biceps instantly shrink down a bit. ARTEMIS (CONT’D) There you go, a little less Olympic weightlifter. Parzival smiles, motions to Artemis. PARZIVAL I like yours too. I mean, your arms, but I mean like... your butt, it’s not... ARTEMIS Yeah, tried to keep it real.  49. PARZIVAL And your... you know, your boobs, they’re not those ridiculous porn star... ARTEMIS Those things are a huge liability in a death match. You tr",
      "dialogue_count": 1,
      "word_count": 7594
    },
    {
      "scene_number": 6,
      "slugline": "EXT. REB SAFE HOUSE (REAL WORLD) TWO DRONES have gathered above the Reb Safe House, their red lights pulsing softly. A third and a fourth join them. Something is going down. EXT. FAST FOOD RESTAURANT - NIGHT (REAL WORLD) Wade lingers outside of a fully automated fast food place BURGER CHICKEN-CORN PIZZARITO. There are no workers or cooks, just machines that inject processed protein glop into pre- rolled, deep fried burrito shells. Then, AN RV PULLS UP. A mocha colored SunRider, at least two decades old. A patchwork of solar cells cover the RV's roof along with a liberal amount of rust. The windows are tinted black. The side door opens, revealing a short ASIAN KID who’s way too young to drive. He beckons Wade over. WADE Shoto? You’re a... kid. Shoto laughs. WADE (CONT’D) When did you get here? SHOTO We flew in yesterday. Aech picked us up. Join the party. INT. AECH'S RV - CONTINUOUS (REAL WORLD) Wade climbs in, sees an older Asian male sitting in the back. WADE And you must be Daito. DAITO just nods, he doesn’t speak English. Then, from the driver’s seat, a voice Wade doesn’t recognize. AECH (O.S.) Hi Wade. Wade turns to see a heavyset African American girl, about Wade's age, with short kinky hair. WADE Hi. Where’s Aech?  88.",
      "characters": [],
      "action_text": "AECH I’m Helen. My Dad called me “Aech” and it stuck. Wade is shocked. WADE Wait, Aech? You? AECH Ugh. I knew you’d be mad. Grab a seat. Wade barely has time to sit down before Aech peels out. EXT. COLUMBUS (REAL WORLD) As dawn breaks, the RV rolls into Columbus, the most spectacular city in the world, Paris on the Scioto River. INT. VAN -- Wade now sits in the passenger seat. The tension is palpable. AECH So what is it, that I’m a girl? Or Black? Maybe I’m heavy, is that it? WADE Of course not. It’s just... all those times we talked about girls... AECH Oh, yeah. Well, I’m a lesbian. WADE Really? Aech laughs. Now that she’s smiling, he recognizes her. WADE (CONT’D) Damn, I had no idea. SHOTO You didn’t know? Dude, your gaydar is broken. Aech looks over at Wade. AECH I’m sorry I wasn’t honest with you.  89. WADE It doesn’t matter. I didn’t tell you I was even better looking in the real world. (looking around the RV) I like your set up here. AECH We keep it moving. Stay one step ahead. We’re rigged up for five if we need it... She taps what looks like a radar detector on her dash. AECH (CONT’D) Got my 40G wifi hotspot, fully encrypted. WADE Cool. AECH What happened with Artemis? WADE She hasn’t realized that she loves me yet. AECH But you love her? WADE Doesn’t matter. We have a key to find. AECH That’s the spirit. CUT TO: INT. REB SAFE HOUSE - DAWN (REAL WORLD) Artemis walks up to the second floor, looking like she didn’t get a good night’s sleep. She knocks on Wade’s door. ARTEMIS Wade? No response. She opens the door. His stuff is gone. And so is he.  90. ARTEMIS (CONT’D) (tearing up) Damn it, Wade, I liked you. Then she sees something strange out the window, shadows moving over the front lawn. Pulling herself together, she goes downstairs to check it out... EXT. REB SAFE HOUSE - DAWN Artemis steps outside, studying the strange shadow patterns on the ground. She looks up and sees a weird formation overhead. She squints, realizing too late what it is... THE SKY IS F",
      "dialogue_count": 0,
      "word_count": 6723
    }
  ]
}