{
  "slug": "recovery-road-101-blackout-2016",
  "title": "recovery road 101 blackout",
  "genre": "comedy",
  "format": "series",
  "scenes_count": 4,
  "characters_count": 0,
  "characters": [],
  "total_words": 10560,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. HALLWAY - WINSTON ACADEMY - PRESENT Zack and Maddie are walking down the hallway to their lockers. MADDIE You didn’t miss much.   I’m pretty sure I ate a lot of goldfish.   The crackers, not actual fish. ZACK Thanks for clarifying. MADDIE Oh, and at one point, I’m fairly certain that I took a bunch of naked selfies and I meant to send them to you, but I came to my senses. ZACK That’s just cruel... MADDIE (Smiling) You always hurt the one you love... Zack smiles and kisses her, then Maddie opens her locker and places her bookbag and water bottle in the locker. CLOSE ON: THE WATER BOTTLE. MATCH CUT TO: INT. GUIDANCE OFFICE - WINSTON ACADEMY - DAY The WATER BOTTLE. MS. MOLINA (35) - pretty, put-together and no-nonsense - is sitting at her desk.   Judging by her face, there’s a problem. Opposite her, sit Maddie and her confused parents: ALAN GRAHAM (40’s) - a successful Silicon Valley type. Alan’s smart and confident when it comes to work, but when it comes to Maddie, he’s often at a loss.   Sometimes, he might come off as a bit brusque and uncaring, but his daughter is the most important thing in the world to him.  RECOVERY ROAD / \"Pilot\"   3.",
      "characters": [],
      "action_text": "CHARLOTTE GRAHAM (40’s) - a put-together professional and Maddie’s stepmom.   Whitening stripped, dressed to the nines. She has a good sense of humor - a very intuitive and compassionate woman. Maddie’s panicked gaze is fixated on the water bottle. MS. MOLINA We found this in your locker this morning. MADDIE Can you do that?   Just search my locker? MS. MOLINA Indeed we can. Ms. Molina picks up the water bottle.   She uncaps it and passes it to Alan to smell. ALAN That is...   not   water. MS. MOLINA No, it’s not Mr. Graham.   It’s vodka. Charlotte gasps, shocked. MADDIE (Lying) One of my friends must have put it in there as a joke. MS. MOLINA Alcohol on school premises is a very serious offense, Maddie.   It’s cause for expulsion. MADDIE But like I said: it’s not mine. MS. MOLINA Good.   Then -- Ms. Molina produces a device from her desk drawer: The iBreath Alcohol Breathalyzer.   She snaps it on her iPhone and passes it to Maddie -- MS. MOLINA (CONT’D) This will help clear it up.   I just need you to blow in that tip.  RECOVERY ROAD / \"Pilot\"   4. Maddie squirms and her father sees this.   He puts his hand up to stop Maddie. ALAN Maddie, don’t. (To Ms. Molina) She doesn’t have to do this. Ms. Molina produces a Student Handbook and opens it to an earmarked page. MS. MOLINA (Reading) ‘Students who are suspected of consuming illegal substances on school grounds will be immediately tested by appointed school officials and will face possible expulsion.   Any student refusing to submit to testing will also face possible expulsion.’ She hands it to Alan to read for himself. CHARLOTTE (Desperate) Is there something -- ALAN Charlotte.   Stop. He looks to Maddie, indicating for her to go ahead. Maddie reluctantly blows into the device.   The reading is a .12.   Alan’s demeanor softens. ALAN (CONT’D) Maybe she could do some hard detention.   Or -- MADDIE Dad, I -- ALAN Maddie.   Shut up.   Don’t say another word. MS. MOLINA Unfortunately, I have to report this to the headmas",
      "dialogue_count": 0,
      "word_count": 770
    },
    {
      "scene_number": 2,
      "slugline": "INT. WINSTON ACADEMY - BATHROOM - MORNING In a stall, Maddie rummages through her purse and takes out what LOOKS LIKE a RABBIT FOOT KEYCHAIN.   She unscrews the top and downs the alcohol inside. EXT. DETOX FACILITY - MORNING Maddie and Charlotte walk.   Maddie’s stumbling. MADDIE I can’t believe you’re putting me in detox. CHARLOTTE I can’t believe you were drunk at school.   You did this to yourself. Come on. Charlotte yanks Maddie’s arm and drags her up the stairs. INT. REHABILITATION FACILITY - DAY In a cold, stark and institutional lobby -- Charlotte awkwardly stands next to Maddie as she defiantly dumps the contents of her purse onto a table.   A COUNSELOR sifts through it, then places the items into a drawer. COUNSELOR And what is your relationship to the patient? CHARLOTTE I’m her stepmother. The counselor writes something down on a form.   Returning to the purse -- COUNSELOR (To Maddie) You’ll get everything back after your 48 hours are up. Charlotte nervously grabs a couple of candies from a dish on the desk.   The Counselor stares at her. COUNSELOR (CONT’D) Only one per person.   No exceptions.  RECOVERY ROAD / \"Pilot\"   7.",
      "characters": [],
      "action_text": "Maddie drunkenly snickers, grabs a handful of candies and stuffs them in her pocket.   Charlotte looks at the Counselor apologetically.   The Counselor grimaces, then -- COUNSELOR (CONT’D) (To Maddie) Now, please head down to room 248 for the strip search. Charlotte starts to walk with Maddie.   The Counselor stops her. COUNSELOR (CONT’D) Patients only. As Maddie walks down the hallway, she looks back at Charlotte, who helplessly watches. INT. PATIENT DETOX ROOM POV: SECURITY CAMERA AFFIXED ABOVE The TIMECODE on the video changes as WE SEE -- -- Maddie paces. -- Maddie reads a MAGAZINE. -- Maddie is drenched in sweat. -- Maddie is bored senseless. -- Maddie gets the shakes. -- Maddie flies into a rage. -- Maddie wretches into a bucket. -- Maddie picks at the disgusting tray of food. -- Maddie lays limp and splayed out on the floor.   Is she dead? The counselor comes in. COUNSELOR 48 hours is up, dear. Maddie jumps up enthusiastically and bolts for the door.  RECOVERY ROAD / \"Pilot\"   8. INT./EXT. ALAN’S CAR - DAY An agitated Alan drives and an uncomfortable Charlotte sits in the passenger seat.   A tired-looking Maddie is slumped in the back looking at her phone. CHARLOTTE I, uh, got you a book. Charlotte passes it back to Maddie.   It’s called   Sober Teens Rule!   Maddie grimaces, then tosses it.   Alan rolls his eyes. CHARLOTTE (CONT’D) It got great reviews. The car falls silent.   Maddie slumps further into her seat. CHARLOTTE (CONT’D) Also, I did some research on where you’re going.   It’s called Springtime Meadows.   Looks nice. (Beat.) There’s even a pool. (Beat.) I packed your -- MADDIE Can we get Starbucks, Dad? ALAN (Curtly) Sure. CHARLOTTE Alan, we’ll be late if we -- ALAN (Seething) Oh, that’s right, I forgot.   You make ALL the decisions for my daughter now. They look at each other, tensely, then Charlotte turns away. The car falls silent again, everyone lost in their own thoughts.   Then -- They turn onto a normal, suburban looking stretch of road. Ala",
      "dialogue_count": 0,
      "word_count": 539
    },
    {
      "scene_number": 3,
      "slugline": "EXT. SPRINGTIME MEADOWS SOBER LIVING FACILITY - CONTINUOUS -- a two-story nondescript house situated next to two smaller nondescript houses. Maddie looks out the window to see a group of STRANGE-LOOKING FOLK on the front patio.   They are holding a banner that reads: ‘WELCOME MADDIE!’ Maddie is horrified.   What the hell has she agreed to? SMASH CUT TO: OPENING CREDITS  RECOVERY ROAD / \"Pilot\"   10.",
      "characters": [],
      "action_text": "ACT ONE INT. CRAIG’S OFFICE - SPRINGTIME MEADOWS - DAY Maddie and Charlotte sit across from CRAIG WEINER (30’s) - dorky and awkward, but an effective counselor. Craig’s office is a dreary, cluttered mess.   On the walls hang faded INSPIRATIONAL POSTERS with POSITIVE AFFIRMATIONS. One can tell these were there when he started this job. As a matter of fact, Craig’s face sort of resembles the SAD ORANGUTAN whose mug is displayed above the phrase ‘IT’S GONNA GET EASIER, BABY!’ Craig slides some paperwork across the desk toward both Maddie and Charlotte. CRAIG There’s one more and then we’re officially done with the paperwork. (Pointing to one) This one is a statement that Maddie has finished detox and is currently 48-hours drug and alcohol free. Maddie and Charlotte both sign.   Charlotte hands them back to Craig. CRAIG (CONT'D) (Glancing at the paperwork) I thought Mr. Graham would be here, too? CHARLOTTE (Quickly) He had to jump on a conference call. MADDIE (Scoffing) He doesn’t think I belong here, either. Charlotte shoots Maddie a look. CHARLOTTE (Forcing sunniness) So, Craig, how long have you been a counselor here?  RECOVERY ROAD / \"Pilot\"   11. CRAIG Six years. CHARLOTTE And how long have you been - (Whispering)  - sober ? CRAIG Me?   Oh, I’m not a recovering addict.   This is just my job. MADDIE I’m not an addict either. CRAIG Admitting you   have   a problem is always the hardest part. MADDIE But if I were truly what everyone is saying I am, wouldn’t I have been Lohaning in detox?   It was nothing.   Getting my drivers’ license was more taxing. CRAIG (Ignoring her) If you go before the 90 days are up, I still gotta charge your folks for all of it. MADDIE (Excitedly) So, I can leave? CRAIG (Gravely) Only in a body bag. (Beat.) Just kidding! Charlotte squirms and Craig notices. CRAIG (CONT’D) Sorry.   Recovery humor is a tad macabre.   Trust me.   She’s in good hands. Craig hands her a thick binder.  RECOVERY ROAD / \"Pilot\"   12. CRAIG (CONT’D) All the info’s in ",
      "dialogue_count": 0,
      "word_count": 1575
    },
    {
      "scene_number": 4,
      "slugline": "INT. MEETING ROOM - SPRINGTIME MEADOWS - LATER Rebecca, her arms folded, glares at Maddie.   Coldly -- REBECCA I guess what I’m struggling with the most is how my ugly past keeps coming back to haunt me... No one (except Craig) notices that her eyes are affixed to Maddie, who quickly looks down. INT. MEETING ROOM - SPRINGTIME MEADOWS - LATER Another housemate is mid-share: WES STEWART - a super good looking, mysterious bad-boy type. WES So, I uh -- I had another dream last night.   A relapse dream. The others nod, understandingly. WES (CONT’D) That guilt you wake up with - it’s hard to shake.   And then even when you realize you were just dreaming and you actually didn’t do anything wrong, you still feel it.   All day. (Beat.) I don’t really wanna talk about this right now. CRAIG (Kindly) Wes, my man, that’s your disease talking.   It   wants   you isolated. Let it out. Everyone else nods in encouragement, as Maddie stares at Wes, intrigued.   He’s looking down at the floor.   Craig’s voice snaps her out of it. CRAIG (CONT’D) We’ll deal with this at your one-on- one tomorrow, okay? WES (Grateful) Cool.   Thanks. Craig nods, then turns to Maddie.  RECOVERY ROAD / \"Pilot\"   19.",
      "characters": [],
      "action_text": "CRAIG Are you ready? Everyone looks at her encouragingly.   Then -- MADDIE Ready for what?   I don’t belong here.   Sorry guys.   I just don’t. They all laugh.   Rebecca does, too, however mirthlessly. VERN (Feigning sincerity) I just remembered something. Craig, I don’t belong here either. TRISH Me neither. MARGARITA Neither do I. WES I don’t. CRAIG Anyone else feel like they didn’t belong here on the first day? Raise your hand. Everyone does. CRAIG (CONT’D) See, Maddie?   No one thinks they belong here.   At first. (Leaning toward her) But y’know what?   I think - where it took these guys WEEKS to come around - I have a feeling it’s gonna take you two days.   Two days of hating me -- (Indicating the others) -- hating   them -- Hating this place.   But I have faith in you. VERN He said the same thing to all of us. (To Craig) Sorry. They all laugh.   Craig included.  RECOVERY ROAD / \"Pilot\"   20. CRAIG I did not!   Okay, maybe I did. (To everybody) Alright, chuckleheads.   Get outta here. As the group disperses, Wes walks up to Maddie.   He smiles. WES Welcome to the funhouse. Even more intrigued, Maddie can’t stop staring at Wes as he walks off. INT. MADDIE & TRISH’S BEDROOM - SPRINGTIME MEADOWS - NIGHT Maddie sits upright in bed.   She’s obviously not doing really well.   She divides strands of her hair in front of her face. Occasionally, plucking one from her head. Trish emerges from the bathroom - in ugly pajamas - having just brushed her teeth. TRISH I know this is a horrible thing to say, but sometimes I wish that Frankie would relapse and come back.   He made the best lasagna EVER. Trish notices a TACKY FIGURINE of TWO PEOPLE DANCING on Maddie’s nightstand.   She makes a beeline for it and starts to pick it up. TRISH (CONT’D) Oooo!   This is -- MADDIE Don’t! Trish quickly recoils. MADDIE (CONT’D) Sorry.   It’s --   It has sentimental value.   My mother gave it to me. Before she died. Trish sits on Maddie’s bed. TRISH I’m sorry.   About your mom.  RECOVERY ROA",
      "dialogue_count": 0,
      "word_count": 7676
    }
  ]
}