{
  "slug": "rick-and-morty-105-meeseeks-and-destroy-2013",
  "title": "rick and morty 105 meeseeks and destroy",
  "genre": "drama",
  "format": "series",
  "scenes_count": 3,
  "characters_count": 1,
  "characters": [
    "RICK"
  ],
  "total_words": 6447,
  "total_dialogue": 1,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. EVENT HORIZON STYLE SPACE STATION - NIGHT  We’re at the climax of some random adventure. Rick and Morty  are being chased by terrifying demonic versions of Beth,  Summer, and Jerry. Summer and Jerry tackle Rick, as Morty  gets cornered by a his demonic mom. Rick shouts from the  ground.  RICK  Morty! Do it! Hit the button now!!!  Morty hesitates.  MORTY  I can’t do it, Rick! They’re my  parents and sister!  RICK  Morty, I already told you, it’s not  your family! They’re clones from an  alternate reality, possessed by  demonic alien spirits from another  dimension’s future! Do you need a  mnemonic device or something? Just  hit the button, already!  The Beth demon turns normal for a moment  BETH  Morty, please, I love you,  sweetheart.  MORTY  Oh geez...  Morty closes his eyes and hits a button on the wall of the  space station. A hatch opens up in the floor, and sucks the  demonic versions of Beth and Summer into it (like the   Ghost  Busters   trap), ripping their flesh off first in a disgusting  display. It’s horrifying. Rick gets up, dusts himself off,  and pulls a cartridge out of the floor. Rick shoots a portal  against the wall, and walks into:  INT. GARAGE - DAY - CONTINUOUS  Morty follows Rick into the garage. Rick is holding some kind  of smoking sci-fi device.  RICK  Good work, Morty. These demonic  alien spirits are really valuable.  Morty pukes in the corner.  RAM 104 \"THE MEESEEKS BOX\"   NETWORK DRAFT (2/15/13) 1.",
      "characters": [
        "RICK"
      ],
      "action_text": "If your adventure sucks, you lose  the right to complain about all  future adventures. Plus, you have  to do my laundry for a month.  MORTY  Alright! But if my adventure’s  good, you have to let me be in  charge of every third adventure!  RICK  Every tenth.  MORTY  Fine. Deal. Well let’s go. Now.  RICK  You’re on, LeBron.  Beth comes in.  BETH  Dad, the dishwasher’s doing that  thing again.  RICK  Washing dishes?  BETH  No. The opposite. Can you fix it?  Summer comes in.  SUMMER  Grandpa Rick, can you help me with  my science homework?  RICK  Yeah, don’t do it.  SUMMER  Grandpa --  Jerry comes in.  JERRY  Hey, Rick. You got some kind of  hand-shaped device that can open  this mayonnaise jar?  RICK  Wow. Hat trick. Okay, Morty, let’s  put a pin in this, I gotta help  your pathetic family.  RAM 104 \"THE MEESEEKS BOX\"   NETWORK DRAFT (2/15/13) 3.  RICK (CONT'D) Morty starts flapping his arms and dancing around.  MORTY  Bawk. Bawk. Bawk.  RICK  Oh, Morty. Now you done did it.  It’s on. I can’t wait to watch your  adventure lay a fart.  (to the family)  As for you ding dongs...  Rick rifles around in a box on his shelf. He pulls out a  small ORNATE METAL BOX.  RICK (CONT’D)  This is a Meeseeks Box. Let me show  you how it works. You press this --  Rick presses a big button on the top of the box. Poof! An  adorable, anthropomorphic little blue creature appears (like  “Pit Pat” from Mr. Show.)  MEESEEKS  I’m Mr. Meeseeks!  RICK  You make a request --  (to Meeseeks)  Mr. Meeseeks, open Jerry’s stupid  mayonnaise jar.  MEESEEKS  Yesiree!  The Meeseeks takes Jerry’s jar and starts trying to open it.  RICK  The Meeseeks fulfills the request -  The Meseeks opens the jar and hands it to Jerry.  MEESEEKS  All done!  JERRY  Wow!  RICK  Then it stops existing.  Poof! The Meeseeks disappears in a cloud of smoke. Rick hands  the Meeseeks box to Jerry.  RAM 104 \"THE MEESEEKS BOX\"   NETWORK DRAFT (2/15/13) 4. SUMMER  Oh my God, he exploded!  RICK  Trust me, they’re fine with it.  Knock",
      "dialogue_count": 1,
      "word_count": 4830
    },
    {
      "scene_number": 2,
      "slugline": "INT. FANCY RESTAURANT - NIGHT  Jerry and Beth eat a nice dinner.  BETH  Maybe it’s time I take that trip I  always talk about.  JERRY  Where would you go?  BETH  (shrugs)  Italy. Greece. Argentina.  Jerry holds the wine list to his forehead like Johnny  Carson’s Carnak character  JERRY  (bad impression)  Countries known for their sexually  aggressive men.  Beth doesn’t laugh. Jerry puts the list down.  JERRY (CONT’D)  Did I tell you how much I love your  new hair cut?  A rumbling sound is heard, like a cattle stampede. The  silverware on the table rattles.  JERRY (CONT’D)  What the heck?  An army of Meeseeks smash through the plate glass window and  pour into the restaurant.  RANDOM MEESEEKS  There he is!  The wave of Meeseeks surround Beth and Jerry. They look  angry.  JERRY  Guys. Come on. I’m trying to have a  nice dinner with my wife.  BETH  Jerry. I don’t think they’re here  for a golf lesson.  RAM 104 \"THE MEESEEKS BOX\"   NETWORK DRAFT (2/15/13) 26.",
      "characters": [],
      "action_text": "JERRY  Well it better be damn important  then.  A knife flies through the air, pinning Jerry’s tie to the  table.  BETH  Run, Jerry!  Beth grabs Jerry by the hand and they retreat into the  kitchen.  INT. FANCY RESTAURANT - KITCHEN - FREEZER - MOMENTS LATER  Jerry and Beth run past CONFUSED COOKS with the Meeseeks in  pursuit. They go into the walk in freezer and slam the door.  JERRY’S MEESEEKS (O.S.)  Come on out, Jerry!  JERRY  Guys, I- I’m sorry for being so  difficult. I’ll choke up. I’ll  follow through. I’ll do whatever  you tell me to, okay?  INT. FANCY RESTAURANT KITCHEN - SAME TIME  The Meeseeks are all gathered outside the freezer.  JERRY’S MEESEEKS  Oh, we’re well past that, Jerry...  Jerry’s Meeseeks reveals a gun.  INT. THIRSTY STAIR - DAY  Rick is sitting playing poker with several creatures, one of  whom is Slipper Stair. Morty wearily approaches.  RICK  Morty! Hey! I’m sorry I was giving  you so much crap. This adventure’s  pretty awesome after all.  MORTY  Let’s just go. I- I’m calling it.  The adventure is over.  RAM 104 \"THE MEESEEKS BOX\"   NETWORK DRAFT (2/15/13) 27. SLIPPERY STAIR  Come on, Rick, quit stalling,  whattaya got?  Rick turns his cards over. Everybody   groans . He wins.  RICK  Sorry, fellas!  Rick pulls his pile of winnings in.  RICK (CONT’D)  We can’t leave now, Morty. I’m on  fire!  MORTY  (tearing up)  Look, I want to leave now. You win  the bet alright? Just give me the  portal gun and let’s go, please.  Morty reaches for Rick’s portal gun, Rick pulls back,  concerned.  RICK  (comforting)  Hey, hey, buddy, what’s wrong? What  just happened? You were so gung ho  about the bet earlier...  MORTY  (sniffling)  I don’t want to talk about it.  Rick eyes the bathroom door. He sees Mr. Jelly Bean limping  out, wiping jelly blood off his lip.  MORTY (CONT’D)  Please, Rick, I just want to go  home.  RICK  (knowingly, eyes still on  jelly bean)  Okay. Listen, Morty.  (turns to Morty)  I just won a bunch of Shmeckles.  Why don’t we use 25 ",
      "dialogue_count": 0,
      "word_count": 1149
    },
    {
      "scene_number": 3,
      "slugline": "INT. FANCY RESTAURANT - KITCHEN - CONTINUOUS  The other Meeseeks celebrate as they poof away one by one.  Jerry’s Meeseeks looks around. He turns back to Jerry who  mouths a dramatic “thank you.” His Meeseeks nods back, then  poofs away. Jerry drops the metal shelf support and embraces  Beth. They kiss passionately. Jerry turns to the RESTAURANT  OWNER.  JERRY  (sexy)  I think we’ll take our food to go.  RESTAURANT OWNER  No you won’t. The police are  coming. You have so many questions  to answer.  JERRY  (still sexy)  Fair enough.  EXT. VILLAGE - DAY  Rick and Morty arrive back at the village on Slippery Stair.  Morty approaches the peasant with a sack.  MORTY  Here you go, sir. For your village.  PEASANT  Oh my! Thank you, kind sir. Our  village is saved! You are both true  heroes!  The other villagers   cheer . A couple of CUTE PEASANT GIRLS run  over and kiss Morty on each cheek.  RICK  Good job, Morty. You win the bet.  MORTY  Thanks, Rick, but I don’t know if I  should. You were right about the  universe. It’s chaotic and complex  by nature.  RICK  Well, maybe that’s why it could use  a little cleaning up now and then.  This one’s wrapped up neat and  clean, because we did it Morty  style.  RAM 104 \"THE MEESEEKS BOX\"   NETWORK DRAFT (2/15/13) 32.",
      "characters": [],
      "action_text": "Trumpets sound.  PEASANT  Oh! Heroes, we would like to  introduce you to our beloved king,  so that he may thank you  personally.  Morty turns to see Mr. Jellybean, still bruised and beaten,  but now wearing a crown and fur cape arriving with his ROYAL  ENTOURAGE.  MORTY  Uh, no, it’s cool.  (to Rick)  Portal. Hurry.  Rick zaps a portal open. Rick and Morty scurry through it.  Beat. Rick’s arm sticks back through the portal, holding a  laser gun. He shoots Mr. Jellybean who explodes. The  villagers immediately stop their celebrating and fall to  their knees in agony.  INT. SMITH HOUSEHOLD LIVING ROOM - NIGHT  Rick and Morty enter the destroyed living room to find Beth  and Jerry, rattled, clothes torn.  RICK  What the hell happened to this  place?  BETH  Your Meeseeks Box happened. They  went crazy when they couldn’t take  two strokes off Jerry’s golf game.  He felt terrible.  RICK  Hey, it’s not my fault that Jerry  is an idiot.  BETH  Dad! Is there anything you can do  to clean this place up?  RICK  Well, I do have a Fleeseeks box...  JERRY  No. No more boxes.  RAM 104 \"THE MEESEEKS BOX\"   NETWORK DRAFT (2/15/13) 33. RICK  What? It just has a mop and some  floor wax in it. Whoob Whoob Whoob!  (explaining over laughter)  That’s my new thing! I’m kind of  like what’s his name, Arsenio!  Whoob Whoob Whoob!  (to camera)  See you next week.  END OF EPISODE  RAM 104 \"THE MEESEEKS BOX\"   NETWORK DRAFT (2/15/13) 34.",
      "dialogue_count": 0,
      "word_count": 468
    }
  ]
}