{
  "slug": "ricky-stanicky-2024",
  "title": "ricky stanicky",
  "genre": "drama",
  "format": "film",
  "scenes_count": 12,
  "characters_count": 1,
  "characters": [
    "NANA"
  ],
  "total_words": 19514,
  "total_dialogue": 1,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. HOUSE - A FEW HOURS LATER The house is burnt to the ground.   Firemen douse some still smouldering sections.   Locals in pajamas and kids still in costumes mill around, observing.   The chief holds up the jacket to another fireman. CHIEF Judging from the size of this jacket, we got a junior arsonist on our hands.   Kid probably caught himself on fire during his prank, peeled it off and left it.   And here’s the best part.   His mother wrote his name in it. He points to the name tag. FIREMAN #1 Ricky Stanicky?   What kind of name is that? CHIEF Sounds like a punk to me.   I’ll call it in to the police. The chief walks off.   From the woods, the boys look on amazed. EXT. ANOTHER STREET - LATER The boys walk alone. WES That was the greatest thing ever. JT Yeah, we should use that excuse all the time.   We could be like, “Ricky Stanicky stole my homework.   Or Ricky Stanicky took the car out.” TED Are you crazy?   It’s way too dangerous.   We’re never using that name again.   Agreed? A beat.   Wes and JT nod. WES/JT Agreed. FADE OUT.  \"Ricky Stanicky\"   11.13.09   Bushell   4.",
      "characters": [],
      "action_text": "FADE IN: “20 YEARS LATER” INT. APARTMENT - NIGHT A well furnished apartment.   On one wall is a glass case of Swarovsky collectible miniatures.   ERIN, 28, sets the table for a dinner party.   TED, now 29, enters carrying a few shopping bags.   He drops his blackberry on the table. TED I got the wine and the cheese.   And I slipped the tomato guy an extra ten bucks so he’d give me the heirloom tomatoes from his secret stash.   Smell this. He takes out a gorgeous tomato.   She takes a whiff. ERIN My god. I want to fuck that tomato. She puts it on the cutting board, ready to chop. TED Whoa.   Maybe we should save this baby for later.   When we’re alone. She snatches it back, playfully. ERIN Ted, I really appreciate this.   I know you wanted to see the fight tonight. TED You’ve been planning this for weeks.   And your boss is coming. Who cares about some silly fight? Erin kisses Ted.   As Ted carries the shopping bags over to the fridge, his blackberry (still on the table), BUZZES. Erin looks over at it. On the screen:   A text message reads:   CALL ME.   SENDER: Ricky Stanicky.   Erin looks concerned. ERIN It’s Ricky.  \"Ricky Stanicky\"   11.13.09   Bushell   5. TED I’ll call him later. ERIN But Ted, he’s been so sick. TED Don’t worry about Ricky.   He’s a fighter. ERIN But... the cancer.   It might have come out of remission. TED How much damage can cancer do in one night?   It’s more of a long excruciating illness. JT, 20’s and SUSAN, 20’s enter.   JT carries a small container of Fleur de Sel. JT We got your French salt. Fleur de Sel.   Shit was expensive. SUSAN It wasn’t that bad. JT Really?   Why does salt cost 28 bucks?   Did some French knight climb some dragon infested cliff and scrape it off with his raper. SUSAN Raper? JT You know.   It’s a French sword. SUSAN That’s a rapier, JT.   A rapier. JT I took French for 6 years, Suze. Fleur de Sel.   Raper. SUSAN You’re a moron. They stop, seeing Erin’s concerned look.  \"Ricky Stanicky\"   11.13.09   Bushell   6. SUSA",
      "dialogue_count": 0,
      "word_count": 3270
    },
    {
      "scene_number": 2,
      "slugline": "INT. CONFERENCE ROOM - DAY A group of men and women sit around a massive conference room table in a glass walled room with a view of the city. HAROLD LAMBERT, 50’s, imposing is addressing the group.   He holds up a Mont Blanc Pen. LAMBERT This is the same pen that I gave Jimmy Robbins when I made him head of sales.   It’s a fine writing instrument.   Perfectly weighted, gold inlaid, solid onyx.   And then Robbins betrayed me.   The man who I considered family took four major clients and went to Garson and Taylor.   Let me just say this, if I ever see Jimmy Robbins again, I will jam this fine writing instrument into his heart and I will drink his blood as it spurts out of his aorta.   Now, we need a replacement.   I would like to promote from within.   Remember, I cherish loyalty.   But if you betray me. He jams the pen repeatedly into a Danish.   ANGLE ON Ted and JT, dressed business casual, watching, mildly horrified. LAMBERT (CONT’D) That’s all for now, people.   Ted. My office. INT. LAMBERT’S OFFICE - DAY Lambert sits in an incredible office overlooking Los Angeles. Ted tries to get comfortable in the chair across from him. There is a serious looking family picture of Lambert, his daughters, Erin and Sarah, and his wife, Clare. LAMBERT Uncomfortable? TED No.   I’m good. LAMBERT You’re sitting in the most uncomfortable chair I could find.  \"Ricky Stanicky\"   11.13.09   Bushell   22. (MORE)",
      "characters": [],
      "action_text": "I bought it because I want the person across from me to be uncomfortable. TED Really? LAMBERT Make people uncomfortable and they know you’re in control.   When you’re in control you own them.   So how’s my daughter? TED Great... Lambert looks at him hard. LAMBERT What’s wrong? TED The chair... LAMBERT She speaks very highly of you. TED Thanks.   She’s a great girl. LAMBERT I’ve never met a man that’s good enough for her.   And I’m certain it’s not you. TED I appreciate your honesty, chief. LAMBERT No you don’t.   But you seem like a good employee. And Erin likes you a great deal.   Her opinion is important to me.   Ted, you keep this up, you could end up as the new head of sales.   Just don’t disappoint me.   Or -- Lambert slashes his pen viciously through the air. INT. TED’S HOUSE - DAY JT and Wes are playing WII.   Ted is a reading a magazine.  \"Ricky Stanicky\"   11.13.09   Bushell   23. LAMBERT   (CONT'D) WES What did we do before Wii? JT Honestly, I don’t remember. Erin and Susan enter. TED You guys have fun at the outlets? Ted gives Erin a kiss. ERIN So fun.   I got you a shirt and some jeans. TED Thanks. ERIN And while we were out, Susan had the best idea.   We want to invite Ricky to your 30th birthday party. TED Ricky? SUSAN You guys are always talking about him.   How much a part of your lives he is.   But we’ve never met him. Which is a little bit odd, don’t you think? WES Nah. ERIN And this is a big birthday. Thirty.   He has to come. TED It’s not that big.   Forty is the real milestone these days. SUSAN He has to.   Especially since he couldn’t be at our wedding, which seems a little strange, don’t you think, JT? JT Uh...  \"Ricky Stanicky\"   11.13.09   Bushell   24. TED We might have to wait months.   I think his missionary work in South America lasts until the spring. SUSAN That’s funny, because JT was out with him just the other night. JT He flew back in early.   The Amazon flooded and washed away the village. Ted looks at JT. ERIN So you’ll have him c",
      "dialogue_count": 0,
      "word_count": 2371
    },
    {
      "scene_number": 3,
      "slugline": "INT. BAR - NIGHT Erin sits alone checking her watch.   A MAN, 30’s, comes up next to her. MAN Is this seat taken? ERIN Uh... yeah.   My boyfriend’s coming. MAN That is a lucky guy.   You are incredible. ERIN Thanks. MAN Just in case, let me give you this. He quickly writes his number on the cocktail napkin and slides it to her.   She hands it back to him.   Ted watches this from the doorway. ERIN No thanks. The guy turns and exits passing Ted.   Ted sits down with Erin. TED Was that guy just trying to pick you up? ERIN Yeah.   I gave him the Heisman, though. She poses like the Heisman Trophy, arm extended to ward off tacklers. ERIN (CONT’D) I have to use the ladies.   Then let’s eat. Erin exits.   The man walks up to Ted. GUY How the hell did you end up with that?  \"Ricky Stanicky\"   11.13.09   Bushell   35.",
      "characters": [],
      "action_text": "The guy shakes his head and exits.   Through the window, Ted sees him hand a valet a ticket.   After a beat, the valet pulls up in a Ferrari and climbs out.   The guy gets in. EXT. GOLF RANGE - NIGHT Ted stands with Ricky, at the golf range.   Rod takes out his iPhone and presses record.   He places it on the divider between the booths in the driving range. TED Erin rented out this range for the party because golf is my favorite sport. ROD Aww, that’s sweet. TED Yeah she’s awesome.   She’s the best thing that ever happened to me. She’s smart, and funny and beautiful and so cool.   It’s weird. I spent most of my life using Ricky to ditch my girlfriends so I could hang out with my boys.   But after I got to know Erin, I realized if I could, I would’ve used Ricky to ditch my boys and hang out with her.   I’ve never felt that way about any woman before. ROD Wow.   Don’t worry, I won’t mess this up for you.   I’m a pro. TED Good.   Now, Ricky is an excellent golfer.   People will probably expect him to hit a couple of balls at the party. Ted hands Rod a club.   Rod walks up to the ball.   Addresses it confidently.   He hacks at it violently, whiffing.   The club flies from his hands out onto the range.   Rod runs out and grabs it, ducking out of the way of errant shots. TED (CONT’D) You’ve never played before have you?  \"Ricky Stanicky\"   11.13.09   Bushell   36. ROD (impressed) How’d you know? TED The only thing you need to hit is a 5 iron.   Watch me. Ted takes the club, addresses the ball and takes an easy swing. He hands Rod back the club.   Rod hacks violently again.   Rod hits the ball, this time both the club and ball go flying.   Still the club makes it past the ball. EXT. GOLF RANGE Rod hits a dribbler.   But manages to hold onto his club.   Ted nods.   He walks around and corrects Rod’s grip. EXT. GOLF RANGE - LATER Ted watches as Rod hits a passable shot.   Nothing great but contact. ROD You are like the Milt Conrad Jr. of golf. TED Milt Conrad Jr.? ROD My dir",
      "dialogue_count": 0,
      "word_count": 1105
    },
    {
      "scene_number": 4,
      "slugline": "INT. WES’ ROOM - LATER The bible rests on Rod’s lap.   Wes is showing Rod his book on the computer.   He clicks on a page WES (reading from the book) All daddy’s have hobbies.   Some like to go bowling A picture of a daddy bowling. WES (CONT’D) Some like to watch sports. A picture of a daddy watching a game on tv. WES (CONT’D) My daddy likes to build bongs. A picture of a daddy holding up a bong. WES (CONT’D) The letter B is for bong.   Can you say bong? ROD Bong. Wes continues reading. WES (reading again) My daddy’s really creative.   He makes bongs out of old plastic bottles.   He makes them out of soda cans.   He even made a bong out of an apple once and after he used it to smoke marijuana, he ate it. A picture of the daddy smoking out of an apple.   The next picture shows the daddy’s eyes swirling. WES (CONT’D) He said, “I’m so high I can see Jesus.”   Some day when I grow up, I want to build bongs just like my daddy. RICKY (moved) I love stories about Dads.  \"Ricky Stanicky\"   11.13.09   Bushell   41.",
      "characters": [
        "NANA"
      ],
      "action_text": "And let me say for older woman, that thing is holding up nicely. Nana smiles.   Rod looks over at a night table and sees the wipes next to about thirty bottles of pills. ROD (CONT’D) Is that Oxycontin? NANA For my hip. (then conspiratorially) If you take two of those, you feel like your floating on the bubbles on the “Lawrence Welk Show.” ROD I love bubbles. WES’ ROOM - LATER Wes is still working on his book.   He checks his phone. WES Shit.   We gotta go. He looks around. WES (CONT’D) Rod? INT. GRANDMA’S HOUSE - LATER Wes walks into Nana’s room.   Rod and Nana are dancing VERY slowly to a Lawrence Welk song.   They are both very high. Wes walks over to his phone.   He quickly texts a message to Ted.   Close on the text. WES: ROD ATE NANA’S PILLS.   WE ARE FKED INT. RESTAURANT - LATER Ted, Erin, JT and Susan sit around a table.   Ted is looking down at his phone.   He reads the text and chokes on his food. JT You okay, dude? Ted slides the phone over to JT who looks at the text message and also starts choking.  \"Ricky Stanicky\"   11.13.09   Bushell   43. ROD   (CONT'D)",
      "dialogue_count": 1,
      "word_count": 554
    },
    {
      "scene_number": 5,
      "slugline": "EXT. GOLF RANGE - NIGHT Erin, Ted, Susan and JT walk up to the golf range.   It is decorated with streamers.   Some of his friends are hitting balls and having drinks. TED (looking around for Ricky) This is great.   I love how you decorated. ERIN I knew you would. SUSAN Yeah.   Freaking great.   Where’s Ricky? ANGLE ON Wes in a stall, his arm around Rod to support him. Rod waves. ROD Ted!! Rod nearly falls over. ERIN I thought he didn’t drink. SUSAN Seriously, what the hell is going on? JT looks away. TED Yeah, uh -- Rod lets go of Wes, staggers forward and picks up a five iron. He grabs the railing to steady himself. ROD Check out this fiver iron. He gets in position and dramatically waggles.   It’s almost sexual.   Rod finally takes his club back knocking the ball off the tee. TED Erin, there’s something I have to tell you. JT begins shaking his head “no,” pleading.   But Ted sees no way out.  \"Ricky Stanicky\"   11.13.09   Bushell   44.",
      "characters": [],
      "action_text": "TED (CONT’D) The thing is Ricky is -- ROD Before I hit this, I want to tell you all a story about Ted.   After Katrina, I volunteered in New Orleans.   One weekend Ted and Wes and JT came down to help.   While I was in a boat rescuing stranded people off of roof tops, they were back at base camp serving coffee and soup.   Saturday afternoon, my boat was so full of people that the gunwale was only about six inches above the water. His delivery is so compelling suddenly we’re there seeing it with him, as if it were real. CUT TO: EXT. HOUSE - DAY Rod sits in a boat packed with rescued people wrapped in blankets.   A local man drives.   They coast up to a submerged house.   ON the roof is an old woman (AUNT ESTHER) with a menagerie of animals.   Dogs, birds, a three legged kitten. ROD (V.O.) On top of one house an old lady was stranded.   She didn’t want to leave without her pets. They were her family.   But the boat was full. Rod climbs off to help her, but she won’t budge.   Rod begins pleading with her.   The boat driver shakes his head.   Sadly, the woman steps off the roof.   She gets in the boat.   Rod gets on his cellphone and calls back to base. ROD (V.O.) (CONT’D) I called base camp to see if we could get another boat for the animals. EXT. RED CROSS BASE CAMP - DAY  \"Ricky Stanicky\"   11.13.09   Bushell   45. INTERCUT RED CROSS BASE CAMP - DAY / HOUSE - CONTINUOUS JT, Wes, and Ted ladle hot soup out to cold, wet rescuees. Ted watches a Red cross OFFICIAL on the phone with Rod.   The official explains why they can’t save the pets. ROD (V.O.) But all the boats had to be used to rescue people. Ted stares at the official thinking. END INTERCUT EXT. HOUSE - CONTINUOUS The woman looks mournfully at her pets and they drift off. ROD (V.O.) Then something amazing happened. EXT. RED CROSS BASE CAMP - LATER Wes, and JT serve the rescued people hot cups of coffee. Aunt Esther sobs on Rod’s shoulder.   Then Ted appears rowing a tiny leaky canoe packed with the animals.   Do",
      "dialogue_count": 0,
      "word_count": 1159
    },
    {
      "scene_number": 6,
      "slugline": "EXT. GOLF RANGE PARKING LOT - LATER People are leaving.   Everyone is in good spirits.   Mr. Lambert and Clare and Erin’s sister, SARAH, 20’s, a wild girl, stop on the way out. ERIN Thanks for coming. CLAIRE It was a great party. MR. LAMBERT Ted, that Ricky is very impressive. Most of your friends are complete idiots, but Ricky, he’s like a breath of fresh air. SARAH He’s hot, too. TED I’m glad you all like him. MR. LAMBERT By the way, I want to see you in my office first thing on Monday. There’s something big I need to discuss with you. The Lamberts leave.   Erin squeezes Ted’s hand. TED I think I’m about to get a promotion. ERIN I think you’re also about to get a blow job. TED Best birthday ever. INT. LAX - MORNING Ted, Wes and JT shake Rod’s hand.   Ted gives Rod five more hundreds. ROD Pleasure doing business with you all.   Anytime you need me back, I’d be happy to come.  \"Ricky Stanicky\"   11.13.09   Bushell   50.",
      "characters": [],
      "action_text": "TED We’ll keep it in mind. LAMBERT’S OFFICE - RECEPTION AREA - LATER Ted sits in the uncomfortable chair.   Lambert seems to be in good spirits.   He is straightening a framed picture of he and Hilary Clinton smoking fat cigars. TED Hilary Clinton never struck me as a cigar smoker. LAMBERT Oh yeah.   Three double coronas a day.   Anyway, I was reviewing some records with the guys from accounting.   You played a lot of rounds of golf with Ricky haven’t you? TED A few. LAMBERT Close to four times over the past year. Ted looks worried. TED Was it that many? LAMBERT One round at PGA West came out to four hundred and eighty dollars in greens fees alone. TED Yeah but there’s a lot of potential there.   With Ricky.   And golf’s important for client relations. LAMBERT I agree and Ricky is quite a guy. That’s why I’m not mad at you. Ted is relieved. LAMBERT (CONT’D)  \"Ricky Stanicky\"   11.13.09   Bushell   51. And I think we both agree that sometimes you have to pay to recruit a piece of talent like that.   Whether they be golf rounds or fancy dinners. TED I’m sorry? LAMBERT Our new head of sales is going to be Ricky Stanicky. TED Rod-rrruh rruh Ricky? LAMBERT That’s the exciting news I told you about.   I called him last night. Booked him on a plane back to LA. I thought you’d be thrilled. TED Oh...I am... I LAMBERT I know, you wanted to take over the department.   But your skills lie more in traditional business. Ricky is a total original.   He’s the type of guy who one day might end up as CEO. TED CEO? Rod walks in a business suit with a big grin on his face. ROD Ted.   Mr. Lambert. (then) I am so psyched to be working with you, bro. LAMBERT’S OFFICE - RECEPTION AREA - MOMENTS LATER Rod and Ted walk past Lambert’s assistant to the elevator. ROD Working with my best friend in the world.   Wow. The elevator door opens.   They walk in.  \"Ricky Stanicky\"   11.13.09   Bushell   52. ELEVATOR - CONTINUOUS The elevator is empty.   As soon as the doors close, Ted turns to Rod. TED",
      "dialogue_count": 0,
      "word_count": 2258
    },
    {
      "scene_number": 7,
      "slugline": "INT. MOVIE THEATER - LATER Ted has dozed off.   The music swells.   Erin is dabbing her eyes with a tissue.   Rod puts his arm soothingly around her. It’s platonic but if it was your girlfriend, would you care? Ted wakes up and sees this.   He looks genuinely worried. INT. RESTAURANT - LATER Ted, sits with Wes and JT. TED Did you see that?   He’s moving in on Erin.   I can’t believe this. WES This blows. JT Seriously.   How the heck am I going to see strippers with Ricky here? TED You’re not supposed to use the excuse to see strippers.   That’s why we’re in this mess in the first place. JT Stripper addiction is a real illness.   It’s in medical books. TED That’s a lie. JT The longer he stays the greater the chance he slips up and blabs to Susan and I spend the rest of my life as a eunuch. WES How are we going to get rid of him? If we out him, we out ourselves. Ted is trying to keep it together.   He thinks. TED Wait a minute.   There’s no way Rod can actually like being Ricky. Ricky doesn’t eat meat, Ricky doesn’t drink, Ricky doesn’t smoke, Ricky doesn’t fuck.  \"Ricky Stanicky\"   11.13.09   Bushell   63. (MORE)",
      "characters": [],
      "action_text": "Up until four days ago, Rod did all of that.   To excess.   He handled one night of it.   But can he handle a week of it?   Two weeks... Eventually he’s going to melt down. JT I don’t think we have time to wait for him to flame out. TED Yeah.   You’re right.   You’ve heard of de tox right? WES Yeah. TED Let’s put him through re tox. EXT. TED’S BACK YARD - LATER MUSIC CUE: BILLY JOEL’S PRESSURE Ted carries a load of red meat out toward a grill.   He starts tossing steaks, burgers and sausages on the grill.   Next to it is a closed “meat smoker.” Ted, JT, Susan, Sarah all hanging out in the backyard.   Rod enters.   They exchange greetings.   Ted uses his spatula to press a steak against the grates.   The odor of grilled meat wafts up. ROD Wow.   That smells excellent. SUSAN I thought you’re a vegan. ROD I am.   But sometimes the smell of meat can make you hungry, even if you object to the killing of animals on moral and environmental grounds... Wes enters with a cooler of cold beer.   JT cracks a beer open.   The bottle beads with cool perspiration.   RACK FOCUS TO ROD’s FOREHEAD beading the same way.   He stares at the beer, longingly.  \"Ricky Stanicky\"   11.13.09   Bushell   64. TED   (CONT'D) JT Cold and refreshing.   I could drink like fifty of these in this heat. ROD Can I get a diet coke or something? WES I forgot the soda.   All I bought was beer, wine and clamato juice. Ted takes a long pull on his beer. TED Boy, it’s a hot one. Ricky GULPS, parched.   Some of the SMOKERS from the office, walk up, taking out cigarettes. SMOKER You mind if we smoke back here? ERIN Do you have to?   It’s kind of crowded. TED Do we have a choice?   You guys are going to have to do it.   Right? You’re addicted. The smoker lights up.   They move a little away.   The smoke wafts into Ricky’s face. ERIN I’m going inside to see if we have any non alcoholic drinks. ROD I’ll come with you. Rod is about to walk in after her when Ted opens the rib smoker.   A rack of ribs is slow cooking",
      "dialogue_count": 0,
      "word_count": 1033
    },
    {
      "scene_number": 8,
      "slugline": "INT. BATHROOM - CONTINUOUS Rod is running his hand under cold water.   Ted walks up behind him. TED Something for the pain? Ted opens the cabinet and pulls out a bottle of painkillers. Rod pushes them away. ROD This isn’t fair.   You’re going to make me lose everything! TED No. I’m going to make Ricky lose everything.   But you’re not Ricky. You’re Rod.   Go home, Rod.   You’re ruining my life. ROD No, I’m going to help you.   I promise.   I’ll make your life better. TED By taking my job and fucking my girlfriend? ROD I didn’t fuck her.   I haven’t even tried to fuck her.   Do you want me to fuck her? I’ll do whatever you want.   I’m your best friend. TED You’re not my best friend.   You’re some crazy dude who won’t leave. ROD That’s mean.   Ricky Stanicky is Ted Garvin’s best friend.   That’s what it says in the bible.   We shouldn’t be fighting.   We need to make up. Let’s hug it out. Rod goes to hug Ted.   Ted shakes his head and exits.   Rod stands for a minute with his arms opened for a hug.  \"Ricky Stanicky\"   11.13.09   Bushell   68.",
      "characters": [],
      "action_text": "HALLWAY - CONTINUOUS Ted walks past Sara who is waiting for the bathroom drinking a beer. TED Ricky’s in there.   He burnt his hand.   Could use some TLC. Sarah enters the bathroom. BATHROOM - CONTINUOUS Ricky is staring at the bottle of pills.   He turns to face Sarah, quickly hiding it behind his back. ROD Be out in a second. SARAH So, is it true what they say about guys with one ball? ROD Excuse me? Sarah moves, seductively toward Rod and kisses him on the lips. ROD (CONT’D) I can’t.   I have an abstinence pledge. SARAH I understand.   Just fuck my mouth. She drops to the ground and starts unzipping his pants. HALLWAY - CONTINUOUS Ricky bursts from the bathroom door with his pants around his ankles clutching the bottle of pills.   Erin watches in shock. Sarah comes out after him. SARAH Ricky!   Come back. Rod trips and falls into Erin’s display case of Swarovsky miniatures.   Shattering them all.   Pills roll everywhere. ERIN Are you all right?  \"Ricky Stanicky\"   11.13.09   Bushell   69. She helps him up.   The horn of a shattered glass unicorn is lodged in his head.   Sarah just stands there.   He pulls a glass horn from his head. ERIN (CONT’D) Were you guys taking pills and having sex? SARAH Technically, mouth fucking is not sex. Sarah exits.   Erin looks at Rod, confused. ROD (earnest) Erin, I need to tell you something. EXT. TED’S PATIO - DAY Ted, JT and Wes stand by the BBQ. TED I should probably check on Sarah and Rod. Ted heads in. INT. TED’S HOUSE - LATER Ted walks into find Erin gently bandaging Rod’s head.   She sees him. ERIN Ted, I can’t believe you. TED What? ERIN You knew Ricky had a substance abuse problem but you still invited smokers and served alcohol at the party. TED Substance abuse problem? ROD You don’t need to cover for me anymore.   He was the one who checked me into Promises.  \"Ricky Stanicky\"   11.13.09   Bushell   70. (MORE) Ted said enough of the substance abuse and the group sex. TED Group sex? ROD My name’s Ricky Stanicky and I’m an",
      "dialogue_count": 0,
      "word_count": 653
    },
    {
      "scene_number": 9,
      "slugline": "INT. TED’S HOUSE - CONTINUOUS Ted, Erin and Rod walk back into the room where the wreckage from the crystal animals remains.   Susan, JT and Wes are picking up the shards. ROD I should go.   Erin will you come to a meeting with me tomorrow?   As my sponsor. ERIN Of course.   But shouldn’t Ted do that? ROD After today, I’d prefer if you went. Rod looks at Ted pointedly, then takes out his keys. SUSAN Ricky, can you give me a ride?   I have to take care of some stuff back at the house. JT I’ll drive you, babe. SUSAN That’s okay.   You stay and help clean up the mess. Susan and Rod exit.   Erin looks at Ted disappointed. INT. SUSAN’S VOLVO - LATER Susan drives.   Rod sits in the passenger seat. SUSAN I know what’s going on.   I know about the lies. Rod blanches. ROD Excuse me? Rod is speechless for once. SUSAN Don’t act dumb.   JT has been going to strip clubs.  \"Ricky Stanicky\"   11.13.09   Bushell   72. (MORE)",
      "characters": [],
      "action_text": "And then he says he’s with you rescuing some hapless girl.   And you cover for him. Rod is relieved. ROD How do you know he’s going to strip clubs? SUSAN I found charges on his credit statement to Lacecapades and some place called Jumbo’s Clown Room. Tonight, while he’s sleeping, I’m going to the kitchen to get a knife and in the morning he’s going to have one less testicle than you have. (then) No offense. ROD I covered for him.   I was wrong. Susan softens a little. SUSAN I’m not mad at you.   You’re just a good friend.   But he’s such a cheating bastard -- ROD Susan, what guy goes to a strip club and uses a credit card? SUSAN My brain dead husband? ROD A guy that wants to get caught. This is a cry for help.   Are you guys intimate in your relationship? SUSAN That’s none of your business. ROD You’re right.   I’ve overstepped. SUSAN We don’t have sex as much since we got married.   But we both work. We’re tired.  \"Ricky Stanicky\"   11.13.09   Bushell   73. SUSAN (CONT'D) ROD The passion is gone.   You’re in a rut. SUSAN That’s no excuse for what he did. ROD No, but perhaps you need to spice things up a little.   Look, I’m a Christian who signed an abstinence pledge but when I was in the Peace Corps in Africa some of my liberal colleagues used to do some things so their sexual relations wouldn’t get boring... dressing up in costumes, nipple clamps, dildos, strap ons, sheisse videos, transgender midget gang bangs, sex in “Bed Bath and Beyond,” little things that would make things more fun.   At least that’s what they told me. SUSAN You think that’s the problem? ROD If you love someone you have to try new things.   He has no excuse, but love is a two way street and sometimes we have to meet at the double yellow line. Susan is silent.   A beat. SUSAN There’s a “Bed Bath and Beyond” in Africa? ROD They just opened one in Nairobi. But they call it (perfect accent) “Kitanda, Oga na Beyond.” INT. BED BATH AND BEYOND - AFTERNOON Susan wears a long trench coat.   JT walks pu",
      "dialogue_count": 0,
      "word_count": 3508
    },
    {
      "scene_number": 10,
      "slugline": "INT. STEAK HOUSE - DAY Samantha sits across from MILT CONRAD JR now, long haired, odd, and flamboyant. SAMANTHA BROWN Milt, I can’t believe a Las Vegas Legend like yourself agreed to have dinner with me. MILT Me neither.   I won three Tonies in the eighties.   But hey, you guys are paying. Samantha Brown LAUGHS way to long again. SAMANTHA BROWN You’re a hoot! ANGLE ON Ted TED Milt Conrad Jr!   He can prove Rod’s a fake.   I gotta go.   See you Nana. Let’s go, unicorn. A unicorn walks up.   Ted gets on. TED (CONT’D) Giddyup mother fucker. FROM NANA’S POV we see Ted who thinks he’s astride the back of a unicorn.   Of course there’s nothing there.   She shakes her head. NANA I’ll call you a cab. EXT. LAX - DAY A cab pull up to the terminal at LAX.   Ted hops out. EXT. LAS VEGAS STRIP - LATER Ted steps out of a cab in front of the Treasure Island Hotel. He runs past carrying a suitcase.  \"Ricky Stanicky\"   11.13.09   Bushell   92.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 175
    },
    {
      "scene_number": 11,
      "slugline": "EXT. TREASURE ISLAND - LATER Ted runs past the empty pirate ship and to the Treasure Island. INT. TREASURE ISLAND - DAY Ted is talking to a WOMAN in guest services. TED I’m here to see Milt Conrad. WOMAN Who should I say is calling? She picks up the phone to call Milt’s office. TED Pirate number 3. INT. MILT CONRAD’S OFFICE - MOMENTS LATER The walls are covered with Las Vegas and Broadway posters. Milt Conrad sits on a couch. MILT Rod is the most committed actor I’ve ever seen. TED Oh you have no idea. MILT I do.   He became an alcoholic to make his performance as Pirate #3 more compelling. Then he tried to fight a real duel with the guy that played his mortal enemy Mr. Wainscott.   Luckily he was so drunk he shot and stabbed himself. TED Well, he had a testicle removed to play Ricky Stanicky. MILT Wow. That’s a whole new level. TED How do I get rid of him?  \"Ricky Stanicky\"   11.13.09   Bushell   93.",
      "characters": [],
      "action_text": "MILT No easy task.   He wore the pirate costume and came to rehearsal for three months after I fired him.   I had to have him banned from the hotel.   After that he slept in the crow’s nest of the fake pirate ship until security found him. (then) If you could give him a big finale. One great climactic scene he might feel like the role is complete. But that’s easier said than done. TED Might be easier to just get his real identity and expose him.   You have access to personnel files?   A copy of a birth certificate or a drivers license -- MILT He signed his working papers as Rod Cozette.   Apparently he just finished a run on Les Mis.   Hell of an actor though. TED No one will believe me unless I have some real info on the guy. MILT I’d like to help you.   God knows he drove me crazy every day saying he should be Pirate #1. TED What about you and the guys that worked with him?   Will you admit that Rod is a fraud? MILT When do you need us? Ted checks his watch. TED In about fifteen minutes. MILT We have a show in a half hour.   I’m sorry.   I can’t help you.  \"Ricky Stanicky\"   11.13.09   Bushell   94. TED Please.   I need to do this, or I’ll never be able to prove to my ex girlfriend that I’m a lying deceitful bastard. MILT Why would you want to do that? TED Because I love her.   More than anything. MILT This is one I’ve never heard.   I’ll get the guys. INT. HOTEL CONFERENCE ROOM - DAY Lambert is at a podium speaking to a group of heavy hitters. LAMBERT Now, it’s my pleasure to introduce the newest and certainly one of the most integral members of our team, Ricky Stanicky. Rod walks up on stage. Applause dies down and he takes out some note cards.   Wes stands over by a laptop working a power point presentation. ROD Thank you.   Today I want to talk to you about Feel Good Investing.   As you know I’m a man who spent many years trying to give back to the community doing non profit.   And I wondered why can’t not for profit be for profit. A power point graphic comes ",
      "dialogue_count": 0,
      "word_count": 2283
    },
    {
      "scene_number": 12,
      "slugline": "EXT. BALLET - NIGHT Ted walks up to the ticket window. TICKET TAKER Hey, man. TED Did Erin ever pick up the ticket I left for her? The ticket taker checks through a pile of stuff. TICKET TAKER Nope.   Same as last time.   You want to take the extra? TED Leave it.   Maybe she’ll come late. Ted walks inside. INT. BALLET - NIGHT Ted sits in his seat watching.   The seat next to him is empty. Erin walks up.   Ted does a double take.   But it’s not her, just a woman who looks like Erin. WOMAN Excuse me. She walks past.   He sighs and watches. INT. OFFICE - DAY Erin sits at a desk dressed for work.   Her assistant enters with her mail. ASSISTANT You got another tomato. She hands her an heirloom tomato.   A note is taped to it.   It says, “THERE’S AN EXTRA TICKET FOR THE BALLET AT THE BOX OFFICE AGAIN TONIGHT... IF YOU WANT.   TED.” ERIN Thanks. The assistant exits.   Erin looks at the note, shakes her head and tosses the tomato in the trash.  \"Ricky Stanicky\"   11.13.09   Bushell   105.",
      "characters": [],
      "action_text": "She sifts through the rest of the mail.   She sees a large manilla envelope with no return address. Erin opens the envelope and takes out a letter.   As she reads the letter we hear Rod’s voice. ROD (V.O.) My dearest Erin, I can’t help but thinking I played a small part in what happened between you and Ted. I just want you to know, that every lie Ted told, he told for you. I’ve been around the block a few times and there are a few things I’ve learned in this life. One, Milt Conrad is a genius.   Two, “Saint Elmo’s Fire” is a truly underrated film.   And three, Ted loves Erin. I know this might be hard for you to believe because I’m just an off off Broadway character actor, and because I pretended to be a another person for two months. But all I can give you is my word. And this. Erin takes out Rod’s iPhone.   A message on the screen reads, “PUSH PLAY.” EXT. GOLF RANGE - DAY Ted stands in the pro’s box at the end of the range with a cigarette tucked behind his ear.   NICK, 12, also with a cigarette tucked behind his ear, hits balls.   Nick’s MOM, stands off to the side. TED Better.   Now I want you to relax your hands more.   Just let the club do the work. Ted uses his club to roll another ball in front of Nick. Nick hits a decent shot. TED (CONT’D) There you go.   Okay, time’s up. Next week. Nick and Ted bro-shake and Nick exits.   Ted starts to walk off the tee.   A golf course manager, DAVE, 40’s walks up to him.  \"Ricky Stanicky\"   11.13.09   Bushell   106. DAVE Where you going?   You got a 5 o’clock. TED Really?   With who? DAVE Uh... Dave looks down at a blackberry. DAVE (CONT’D) Name’s uh... Ricky Sta-nicky?   Did I type that right? TED Oh Jesus.   Tell Booker to cover for me.   I gotta run. Ted starts to walk away. DAVE What’s the big deal?   She’s here right now. Ted stops. TED She? He turns back and sees Erin standing in the stall.   In her cutest golf outfit.   She waves shyly.   He approaches her. TED (CONT’D) Uh... hey.   Nice fake name. ERIN You made it",
      "dialogue_count": 0,
      "word_count": 1145
    }
  ]
}