{
  "slug": "rick-and-morty-109-something-ricked-this-way-comes-2013",
  "title": "rick and morty 109 something ricked this way comes",
  "genre": "sci-fi",
  "format": "series",
  "scenes_count": 3,
  "characters_count": 0,
  "characters": [],
  "total_words": 5257,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. NEEDFUL THINGS - DAY  Summer is dusting. Needful is behind the counter. Goldenfold enters the store, looking strung out and angry, with attractive women following him. He storms up to Mr. Needful. MR. GOLDENFOLD   80  This aftershave made women want me but it also made me impotent! Mr. Needful teepees his fingers and darkens his brow. MR. NEEDFUL   81  A price for everything, Mr. Goldenfold. A price for   everything . 81A   Mr. Needful   laughs . Summer looks uncomfortable but keeps dusting. Goldenfold throws his arms to the sky and falls to his knees. MR. GOLDENFOLD   82  (wailing at the sky) Oh my God! How could I not see this coming! My lust! My greed! I deserved this! Rick steps into frame and injects Goldenfold with a syringe. Goldenfold stops crying. RICK   83  That serum should counteract the negative effects. Goldenfold looks down at his pants. MR. GOLDENFOLD   84  Holy cats! Ladies, let’s do this! He runs out of the store with his ladies. MR. GOLDENFOLD (CONT’D)   85  (distant) I haven’t learned a thing! Rick slams the golden microscope on the counter with a dramatic thud. RICK   86  You can have this back. MR. NEEDFUL   87  You didn’t... use it?  RAM 109 \"NEEDFUL THINGS\"   NUMBERED RECORD DRAFT (5/9/13) 9.",
      "characters": [],
      "action_text": "RICK   88  Sure I did. To develop this. Rick holds up a tricorder device. RICK (CONT’D)   89  It detects and catalogues all your Twilight Zone, Ray Bradbury, Friday the Thirteenth the Series voodoo crap magic. I thought you might want it, so you didn’t accidentally sell anybody, say- He points his tricorder at a nearby typewriter. RICK (CONT’D)   90  A typewriter that generates bestselling murder mysteries... and then makes the murders happen in real life, ooooo. MR. NEEDFUL   91  Be quiet! RICK   92  Don’t you want to make sure people know what they’re getting? You’re not   intentionally   selling (reads device) -beauty cream that makes ugly ladies pretty but also makes them BLIND? An ugly woman drops some cream and leaves the store. MR. NEEDFUL   93  I find this all   quite   preposterous. RICK   94  (mocking him) Oh, I say, good sir, I do so find your manner of speaking so very quite tallyho. Rick scans a mink stole that a woman is trying on. RICK (CONT’D)   95  That’s beautiful. You know it’s going to be wearing YOU in three hours. The woman drops it. She and other customers file out of the store.  RAM 109 \"NEEDFUL THINGS\"   NUMBERED RECORD DRAFT (5/9/13) 10. MR. NEEDFUL   96  Do I need to call the police? Rick holds up his cell phone. RICK   97  Sure. Call the Better Business Bureau, too. Call the FBI. Use my phone. Don’t worry, it won’t make you deaf because I’m not a   hack . 97A   Needful slaps Rick’s phone out of his hand. Rick slaps back defensively at Needful. They get into a   SLAP FIGHT . SUMMER   98  (appalled) Stop it! Stop it right now! (separating them) Grandpa Rick, I like working here! RICK   99  You work for the Devil! SUMMER   100  So what?! RICK AND NEEDFUL   101  So what? Rick and Needful are equally thrown to hear her say this. SUMMER   102  Yes,   so what   if he’s the Devil, Rick? At least the Devil has a job. At least he’s   active in the community . What do you do? You eat our food and make gadgets. (SNL) Buh-bye. Rick is visibly stung. H",
      "dialogue_count": 0,
      "word_count": 3733
    },
    {
      "scene_number": 2,
      "slugline": "EXT. MORTY’S HOME - ESTABLISHING - NIGHT INT. MORTY’S HOME - MORTY’S ROOM - NIGHT  Rick sticks his head in. RICK   228  Hey, Morty, you want to go on- The room’s empty. RICK (CONT’D)   229  Oh.  INT. MORTY’S HOME - KITCHEN - SOON  Rick is alone in the kitchen. RICK   230  Beth? Hello?  INT. MORTY’S HOME - JERRY’S DEN - SOON  The den is empty. RICK   231  Jerry? Still stupid? 231A   He   sighs .  INT. MORTY’S HOME - KITCHEN TABLE - SOON  Rick eats a TV dinner. The butter-passing robot walks into frame, offering Rick butter. RICK   232  Thanks. He tosses it in the trash. The robot starts to walk away. RICK (CONT’D)   233  I was thinking I might watch a movie. SMALL ROBOT   234  My purpose is to pass butter. Rick takes a deep swig of his whiskey.  RAM 109 \"NEEDFUL THINGS\"   NUMBERED RECORD DRAFT (5/9/13) 28.",
      "characters": [],
      "action_text": "RICK   235  Suit yourself. Morty walks in. Rick almost fails to contain his excitement. RICK (CONT’D)   236  Hey. MORTY   237  Hey. Can you help me do a project for the science fair? RICK   238  (shrug) Whatever.  INT. PLUTO - KING’S CHAMBER - DAY  King Flippy Nips observes while Jerry is tended to by assistants. KING FLIPPY NIPS   239  You must be excited, Jerry. The Plutobel Prize is the highest honor a scientist can receive. JERRY   240  I’m flattered and humbled. KING FLIPPY NIPS   241  Oh, I like that. Use that in your speech. Also, talk about Pluto being a planet, people like that. Plutonian police drag a handcuffed Scroopy Noopers into the chamber. KING FLIPPY NIPS (CONT’D)   242  Ah. It appears your journey’s come to an end, young man. Take him to Plutanamo Bay. As Scroopy Noopers is dragged out: SCROOPY NOOPERS   243  You can’t kill the truth, father! Jerry is perplexed.  RAM 109 \"NEEDFUL THINGS\"   NUMBERED RECORD DRAFT (5/9/13) 29. KING FLIPPY NIPS   244  I can see you’re confused. Plutanamo Bay is a military prison, not unlike your planet’s “Guantanamo” - JERRY   245  Did he call you father? Scroopy Noopers is your son? KING FLIPPY NIPS   246  The young eat the old if you let them, Jerry. Pluto is a cold, cold celestial dwarf. JERRY   247  It’s a what? KING FLIPPY NIPS   248  Hm? Oh, planet! Ha, Pluto is a cold, cold planet, hey, knock ‘em dead out there.  INT. PLUTO - PARLIAMENT LAWN - DAY  Jerry is at a podium, giving a speech under a “MASTER OF ALL SCIENCE” banner. His single note card says “Pluto = Planet.” He looks at the crowd. JERRY   249  Pluto... is... Jerry sees at Plutonian kid who looks a lot like Morty in the crowd. A tear wells in his eye. JERRY (CONT’D)   250  (sigh) Not a planet. 250A   The crowd starts   booing   and throwing stuff at him. JERRY (CONT’D)   251  It’s not a planet! It’s not a planet! (dodging soda cups) I’m an idiot and I love my son!  INT. NEEDFUL THINGS/ N33DFUL.COM OFFICES - DAY  The store is now an exposed-brick interne",
      "dialogue_count": 0,
      "word_count": 736
    },
    {
      "scene_number": 3,
      "slugline": "EXT. MORTY’S HOME - FRONT YARD - CONTINUOUS  The Plutonian space ship swoops down and Jerry flies out of the door without it stopping. Jerry’s badly beaten, clothes tattered. He dusts himself off and heads inside.  INT. MORTY’S HOME - MORTY’S ROOM - SOON  Morty is sitting at his computer. Jerry opens the door, startling him a bit. MORTY   260  Dad, what happened? JERRY   261  Eh, some people just can’t handle the truth. Especially dummies like me. Morty, I’m not as smart as Rick, but I promise never to make that your problem again. Jerry starts to walk away. MORTY   262  Dad?   (after he turns) Nobody’s smarter than Rick. But nobody else is my dad. You’re a genius at that. JERRY   263  (choked up) That’s... humbling and flattering. (cheering up) What’s say we finish ourselves an eight planet solar system? Morty holds up a Ziploc bag with the butter passing robot in it. MORTY   264  I’m just going to take in this thing Rick made and get an A. JERRY   265  But - MORTY   266  You’re a genius at being my dad, Dad. Quit while you’re ahead.  RAM 109 \"NEEDFUL THINGS\"   NUMBERED RECORD DRAFT (5/9/13) 32.  (MORE)",
      "characters": [],
      "action_text": "And knock next time, I’m fourteen and I have a computer in here. JERRY   267  I think I understand. MORTY   268  You’re really playing with fire when you burst in here, man. JERRY   269  I get it. Say no more. MORTY   270  I mean, one of these days you’re going to see something - JERRY   271  I got it! Noted! Good night!  INT. MORTY’S HOME - LIVING ROOM - CONTINUOUS  Summer gets home and slams the door and goes to Rick, she has mascara tear streaks running down her face. RICK   272  How’s your pretend grandpa, aka the Devil? SUMMER   273  (upset) He dumped me. She flops on the couch beside him. RICK   274  Oof. Sorry. SUMMER   275  Did we learn a lesson here I’m not seeing? RICK   276  Not sure. SUMMER   277  Maybe in a much bigger way, Mr. Needful gave us both what we really wanted? Because I was always jealous of you hanging out with Morty, and you didn’t realize how much you valued my approval?  RAM 109 \"NEEDFUL THINGS\"   NUMBERED RECORD DRAFT (5/9/13) 33.  MORTY (CONT'D) It doesn’t sit right with either of them for a beat. SUMMER (CONT’D)   278  (simultaneously) Nah, not satisfying. RICK   279  (simultaneously) No. That’s dumb. RICK (CONT’D)   280  Tell you what, though. If it’s satisfaction you’re after, I think I have an idea. 280A   He leans in and   whispers something   to Summer. SUMMER   281  Uh huh. Totally. Let’s do it.  MONTAGE:  Cue “Push It To The Limit” from Scarface. -Summer and Rick work out, lifting weights in the garage, spotting each other. -In a locker room, Summer injects Rick’s butt cheek with something, then Rick does the same to her. -Some time has passed, now they’re pumping iron at a gym. They’re fitter, a little more muscular. They do a series of different strength training.  END MONTAGE INT. AUDITORIUM - SEATTLE - SOME TIME LATER  Mr. Needful is finishing a TED talk style lecture, on an oriental carpet, in a stage in front of a projected slide of a e-commerce graph. MR. NEEDFUL   282  And that’s how I was able to take a storefront into ",
      "dialogue_count": 0,
      "word_count": 788
    }
  ]
}