{
  "slug": "rick-and-morty-108-rixty-minutes-2014",
  "title": "rick and morty 108 rixty minutes",
  "genre": "drama",
  "format": "series",
  "scenes_count": 13,
  "characters_count": 0,
  "characters": [],
  "total_words": 7719,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. ALLEYWAY - NIGHT  A KILLER talks to no one in particular. KILLER   S10  I’m the killer! He puts his gun to his mouth and the camera pans right to reveal the Quick Mystery Host. We hear the gunshot and blood splatters on the host.  INT. MORTY’S HOME - LIVING ROOM - CONTINUOUS  RICK   52  Now who wants to watch random, crazy TV shows from different dimensions and-and-and-and then who wants to narcissistically obsess about their alternate selves? JERRY / BETH / SUMMER   53  I want to obsess about myself / narcissistically obsess / the narcissistic option 53A   Rick   sighs . He digs a pair of goggles out of his pocket. RICK   54  Here. These scan your retinas and let you view parallel timelines through genetically matching versions of your eyes. Go fetch. Rick tosses the goggles toward the kitchen. Jerry, Beth and Summer scramble after them. SUMMER / BETH   54A  This is so cool! / Yes! Ladies first! RICK   55  I’m proud of you, Morty. MORTY   56  Hey, man, I don’t give a crap about myself, Rick. Let’s watch some crazy stuff, yo.  INT. ON TV - SKETCH - ANTS IN MY EYES JOHNSON  RAM 108 \"INTERDIMENSIONAL CABLE\"   FINAL ANIMATIC DRAFT (8/5/13) 8.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 205
    },
    {
      "scene_number": 2,
      "slugline": "INT. APPLIANCE STORE COMMERCIAL - DAY  ANTS IN MY EYES JOHNSON, a man in a cheap suit with ants swarming all over his eyes stands in an appliance store like one of those “Crazy Eddie” appliance commercials. ANTS IN MY EYES JOHNSON   S11  I’m Ants In My Eyes Johnson here at Ants In My Eyes Johnsons Electronics! I mean there’s so many ants in my eyes and there’s so many TV’s! Microwaves! Radios! Johnson stumbles along a sparsely filled shelf, pointing to incorrect products as he calls out what he thinks he’s pointing at. Cheesy bold text advertising “TV’s! MICROWAVES! RADIOS!” appears on screen as he calls those items out. (but text not too big that we obscure the joke that he’s pointing at the wrong items) ANTS IN MY EYES JOHNSON (CONT’D)   S12  I think! I can’t, (he stops and faces what he think is the direction of the camera, but he’s slightly off) I’m not 100% sure what we have here in stock because I can’t see anything! We cut to a tight shot of Johnson’s eyes here. ANTS IN MY EYES JOHNSON (CONT’D)   S13  Our prices, I hope, aren’t too low! Johnson stops and gestures to a dishwasher. ANTS IN MY EYES JOHNSON (CONT’D)   S14  Check out this refrigerator! Only two hundred dollars! The price tag of the dishwasher says $5. Johnson then stands in front of a microwave that’s labeled as “FREE.” takes two steps over, we pan with, and he points to a lit stove. His sleeve catches fire, but he doesn’t notice or react. ANTS IN MY EYES JOHNSON (CONT’D)   S15  What about this microwave? Only a hundred dollars! That’s fair! We see a customer steal something in the background. Another customer is playing with a stove and turns on all four of the burners. She walks off camera as Johnson is walking up.  RAM 108 \"INTERDIMENSIONAL CABLE\"   FINAL ANIMATIC DRAFT (8/5/13) 9.",
      "characters": [],
      "action_text": "ANTS IN MY EYES JOHNSON (CONT’D) I’m Ants in my eyes Johnson! Everything’s black! I can’t see a thing, and also I can’t feel anything either, (he holds out his arms and his sleeve catches on fire) did I mention that? But that’s not as catchy as having ants in your eyes so that always goes, you know, off by the wayside. I can’t feel, it’s a very rare disease, all my sense-- all my nerves, they don’t allow for the sensation of touch. Throughout the speech, the flamees spread over Johnson entire body as people continue stealing items from the store.  INT. MORTY’S HOME - LIVING ROOM - CONTINUOUS  Angle on Rick and Morty watching. We just watch them as they stare ahead. We hear Ants in my Eyes Johnson go on. ANTS IN MY EYES JOHNSON (O.S.)   S16  So I never know what’s going on, am I standing, sitting? I don’t know.  INT. MORTY’S HOME - KITCHEN - DAY  Beth holds the goggles. BETH   59  Are we sure we want to do this? Look at our own alternate lives? JERRY   60  You’re right, maybe we should just play Yahtzee, GIVE ME THOSE. Jerry snatches the goggles and puts them on. BETH   61  What do you see? JERRY   62  Whiteness. Pure whiteness.  POV ALTERNATE JERRY - WHITE SCREEN  We hear a snort and the POV moves up, revealing:  RAM 108 \"INTERDIMENSIONAL CABLE\"   FINAL ANIMATIC DRAFT (8/5/13) 10.",
      "dialogue_count": 0,
      "word_count": 558
    },
    {
      "scene_number": 3,
      "slugline": "INT. HOLLYWOOD NIGHT CLUB - NIGHT/CONTINUOUS  Johnny Depp, holding a metal straw, stares at us from across a glass table covered with a pile of cocaine. JOHNNY   63  You’re my best friend, Jerry Smith. I love doing cocaine with you.  INT. KITCHEN - CONTINUOUS  Jerry reaches out in front of him. JERRY   64  Whoa! I love doing cocaine with   you too , Johnny Depp! BETH   65  (taking goggles) Ugh! Haven’t we spent enough time on you? Beth puts on the goggles.  POV ALTERNATE BETH: INT. HOSPITAL - CONTINUOUS  We see a body opened up. BETH   66  I’m performing surgery... Her POV looks to the left to reveal a man passed out. BETH (V.O.)   67  But not on a horse, on a human!  INT. MORTY’S HOME - KITCHEN - CONTINUOUS  Jerry pats Beth on the shoulder. JERRY   68  That’s great, Beth. You always wanted to be a real surgeon. Beth removes the goggles to look at Jerry. BETH   69  I   am   a real surgeon.  RAM 108 \"INTERDIMENSIONAL CABLE\"   FINAL ANIMATIC DRAFT (8/5/13) 11.",
      "characters": [],
      "action_text": "JERRY   70  (at a loss) Gahhhhhhhhhhh, Summer’s turn! Beth looks at the floor while Summer snatches the goggles from Jerry and holds them to her eyes. SUMMER   71  Finally. I don’t see anything. BETH   72  Well, you should select a different timeline, I mean, if your father and I achieved our dreams, there’s a chance you weren’t even born, that came out wrong, that came out  very wrong . SUMMER   73  Fine, I’ll find a world where you bothered to have me. She toggles the switch on the side of the goggles a few times. She looks through the goggles for a moment, then looks sad. SUMMER (CONT’D)   74  We’re playing Yahtzee. BETH   75  (at a loss) Yahtzee’s fun. (to Jerry) We love Yahtzee. JERRY   76  It’s a fun game for fun families, hey, could I... get those goggles back for a second?  INT. MORTY’S HOME - LIVING ROOM - DAY  Rick and Morty are watching TV.  INT. ON TV - SKETCH - MR. SNEEZY CAR AD EXT. WINDING ROAD - FALL - DAY  A colorful, weird, strange, clown type car hugs a curvy hill side road in a beautiful European type country.  RAM 108 \"INTERDIMENSIONAL CABLE\"   FINAL ANIMATIC DRAFT (8/5/13) 12. CAR COMMERCIAL VOICEOVER   76A  It’s a 45 horsepower with anti-lock breaks, and it’s the official car of   Mr. Sneezy 3-D.  The car drives off road, it goes over some boulders no problem. We see it race down a straight road in a beautiful European meadow with large beautiful mountains in the background. The car drives off a cliff into the water below and a propellor pops out from the rear bumper to propel it through the water. The car comes spinning down a road then stops on a dime, driving into the perfect framing for it. CAR COMMERCIAL VOICEOVER (CONT’D)   76B  It’s the brand new Sneezy XL. The horn when you honk it makes a sneeze noise. (HONK/SNEEZE) It’s polite, it’s right, and it’s Sneezy, deezy Mc...Deluxe. The car door opens, revealing Mr. Sneezy coming out. Think Mr. Bean but more colorful clothes and tiny and skinny, strange just like the car itself. MR. SNEEZY  ",
      "dialogue_count": 0,
      "word_count": 617
    },
    {
      "scene_number": 4,
      "slugline": "EXT. SPACE - CONTINUOUS  We see a meteor heading towards Earth. TWO BROTHERS VOICEOVER And then a meteor hit.  EXT. CITY STREET - CONTINUOUS  A METEOR hits the horizon, causing the skyline of a city to explode, the shockwave knocks over the van. The brothers get out and start running. TWO BROTHERS VOICEOVER   S19  And they ran as fast as they could-  EXT. CITY - CONTINUOUS  The two brothers are running when GIANT CAT MONSTERS grab a hold of them. TWO BROTHERS VOICEOVER   S20  -from giant cat monsters. A giant tornado swirls towards them and blows the Giant Cat Monsters off of them. TWO BROTHERS VOICEOVER (CONT’D)   S21  -and then a giant tornado came. And that’s when things got knocked into twelfth gear.  EXT. CITY - CONTINUOUS  The two brothers look up to find a giant spaceship.  EXT. SPACE - CONTINUOUS  The spaceship is in the shape of a giant sombrero and there are many more of them above Earth. TWO BROTHERS VOICEOVER   S22  A Mexican armada shows up.  EXT. CITY - CONTINUOUS  Stereotypical Mexicans step off of the spaceship holding guns and a canon, which are made of tomatoes. The two brothers look ready to fight.  RAM 108 \"INTERDIMENSIONAL CABLE\"   FINAL ANIMATIC DRAFT (8/5/13) 14.",
      "characters": [],
      "action_text": "TWO BROTHERS VOICEOVER   S23  With weapons made from to-tomatoes. And you better bet your bottom dollar that these two brothers know how to handle business. The following title starts to appear on the screen, word by word over the two brothers. TWO BROTHERS VOICEOVER (CONT’D)   S24  In: “Alien Invasion Tomato Monster Mexican Armada Brothers Who Are Just Regular Brothers Running In A Van From An Asteroid And All Sorts Of Things” The Movie. This long title fills the screen. TWO BROTHERS VOICEOVER (CONT’D)   S25  Hold on, there’s more. The brothers are fighting back to back. They turn to see a ton of tough old women show up like gangs in   The Warriors.   We kung fu movie zoom into the old women. They attack. The Mexican Armada fires their weapons at the two brothers. One of the brothers uses a giant cat monster as a shield then throws it at a sombrero spaceship. A fight ensues. TWO BROTHERS VOICEOVER (CONT’D)   S26  Old women are coming, and they’re also in the movie, and they’re gonna come and cross attack these two brothers. TWO BROTHERS VOICEOVER (CONT’D)   S27  But let’s get back to the brothers because they’re, they have a strong bond, you don’t want to know about it here.  EXT. SPACE - CONTINUOUS  The MOON flies towards the Earth. TWO BROTHERS VOICEOVER   S28  But I’ll tell you one thing, the moon, it comes crashing into Earth.  EXT. CITY - DAY  The brothers stand on the street of the destroyed city looking at the moon, which has crushed part of the city.  RAM 108 \"INTERDIMENSIONAL CABLE\"   FINAL ANIMATIC DRAFT (8/5/13) 15. TWO BROTHERS VOICEOVER   S29  And what do you do then? New title appears: Two Brothers TWO BROTHERS VOICEOVER (CONT’D)   S30  It’s two brothers, and a and and they’re gonna, it’s called “Two Brothers”. “Two Brothers.” It’s just called “Two Brothers”. (HE LAUGHS.)  INT. MORTY’S LIVING ROOM - CONTINUOUS  Rick and Morty are watching TV.  INT. MORTY’S HOME - KITCHEN - DAY  Beth is holding the goggles up to her face. BETH   79  Holy crap, I am win",
      "dialogue_count": 0,
      "word_count": 1656
    },
    {
      "scene_number": 5,
      "slugline": "INT. STUDIO SOUND STAGE - CONTINUOUS  We now see the fake door room was on a set built inside a sound stage. He steps down from it, and climbs into a sporty little convertible that is conveniently parked right next to the set. He starts it up and begins driving. Camera continues to pan as his car moves towards screen left, exiting the sound stage and going outside.  INT. MORTY’S HOME - CONTINUOUS  MORTY   S38  Hey, wait a minute, Rick. W- I thought this was a commercial, w- what’s going on, I mean? RICK   S39  Relax, Morty. Don’t-don’t worry about it, lets just, just see where this goes.  INT. SALESMAN’S CAR - CONTINUOUS  He’s stuck behind a slow moving car. FAKE DOORS SALESMAN   S40  (yelling at another car) Step on it! We all got places to be! Son of a bitch. The car moves and he proceeds on his way.  EXT. FAKE DOOR SALESMAN’S HOME - CONTINUOUS  The car pulls into a driveway and parks. He gets out and walks towards the front door.  INT. MORTY’S HOME - LIVING ROOM - CONTINUOUS  MORTY   S43  See, aw, that must be where he lives. Okay.  INT. FAKE DOOR SALESMAN’S HOME - KITCHEN - CONTINUOUS  He’s now in the kitchen making himself a sandwich.  RAM 108 \"INTERDIMENSIONAL CABLE\"   FINAL ANIMATIC DRAFT (8/5/13) 22.",
      "characters": [],
      "action_text": "RICK (V.O.)   S44  Huh. He’s making himself a sandwich now. The salesman finishes making his sandwich, then looks directly into the camera and snaps back into commercial mode. FAKE DOORS SALESMAN   S45  (to the camera) Hey, everybody! So this is my house. Just made a sandwich. Peanut butter and jelly. Still here. Still selling fake doors.  INT. FAKE DOOR SALESMAN’S HOME - KITCHEN/LIVING ROOM - CONT.  We pan and follow him as he walks from his kitchen into his living room (which looks exactly like the sound stage set from earlier).  INT. MORTY’S HOME - LIVING ROOM - CONTINUOUS  MORTY   S46  What? RICK   S47  Oh my god, it’s still the commercial.  INT. FAKE DOOR SALESMAN’S HOME - LIVING ROOM- CONTINUOUS  FAKE DOORS SALESMAN   S48  We have fake doors like you wouldn’t believe. What are you worried about? Come get fake doors. Call us up and order some fake doors today. Don’t even hesitate. Don’t even worry. And don’t even...  INT. MORTY’S HOME - LIVING ROOM - CONTINUOUS  RICK   S49  Alright I’m bored. Change it. MORTY   S50  Wait wait, Rick! Hold on, Hold on!  RAM 108 \"INTERDIMENSIONAL CABLE\"   FINAL ANIMATIC DRAFT (8/5/13) 23.",
      "dialogue_count": 0,
      "word_count": 413
    },
    {
      "scene_number": 6,
      "slugline": "INT. FAKE DOOR SALESMAN’S HOME - LIVING ROOM - CONTINUOUS  FAKE DOORS SALESMAN   S51  ...give it a second thought. That’s our slogan. See it on the bottom of the screen below our name. (graphic of slogan appears on bottom of the screen) Here’s another slogan, right below that one. (graphic of slogan appears below the first one) What are you worried about? Come get fake doors! Get in here quick. Get out quicker with a arm of fake doors in your arms!  INT. MORTY’S HOME - LIVING ROOM  MORTY   S52  Okay, okay you can change it. FAKE DOORS SALESMAN   S53  And don’t even worry about it!  INT. ON TV - SKETCH - GAZORPAZORPFIELD INT. GAZORPAZORPFIELD’S HOUSE - DAY  GAZORPAZORPFIELD, half Garfield half Gazorpazorp (from the Sex Robot episode), wakes up in his cat bed. GAZORPAZORPFIELD   S54  Oh, I hate mamumanumsdays and I really could go for some enchiladas.  INT. MORTY’S HOME - LIVING ROOM - CONTINUOUS  ANGLE ON: Rick and Morty sitting on the couch. MORTY   S55  Hey, Rick, that’s pretty cool. It’s just like Garfield only instead it’s Gazorpazorpfield. RICK   S56  Hey, isn’t Gazorpazorp where, where uh... where those sex-robots came from? Remember that whole thing?  RAM 108 \"INTERDIMENSIONAL CABLE\"   FINAL ANIMATIC DRAFT (8/5/13) 24.",
      "characters": [],
      "action_text": "MORTY   S57  Yea. Hey, that’s a pretty, pretty... That’s true. That’s right. RICK   S58  Yeah. Let’s watch some more Gazorpazorpfield.  INT. GAZORPAZORPFIELD’S HOUSE - DAY  Gazorpazorpfield is followed by the frame as he approaches his human owner JOHN, sitting at a table ala a “Garfield” strip. GAZORPAZORPFIELD   S59  Hey, John, it’s me, Gazorpazorpfield. Boy. Fuck you, John. You fucking dumb, stupid, idiot. JOHN   S60  Come on, Gazorpazorpfield. Go easy on me, huh? GAZORPAZORPFIELD   S61  You dumb, stupid, weak, pathetic. White. White, uhh. Um, guilt. White guilt, milquetoast, piece of human garbage. JOHN   S62  Geez, Gazorpazorpfield, that’s, you know. You’re pretty mean to me but that takes the cake. GAZORPAZORPFIELD   S63  I don’t give a fuck. I’m Gazorpazorp-fucking-field, bitch. Now give me my fucking enchiladas. Gazorpazorpfield kicks over John’s coffee.  INT. MORTY’S HOME - LIVING ROOM - CONTINUOUS  MORTY   S64  Hey, Rick, ya know. Did they use Bill Murray for this? Sounds a lot like Bill Murray.  RAM 108 \"INTERDIMENSIONAL CABLE\"   FINAL ANIMATIC DRAFT (8/5/13) 25. RICK   S65  No, Morty it’s Lorenzo Musik. In this universe he’s still alive. MORTY   S66  Oh, okay, was his name Lorenzo Musik? RICK   S67  Yea, I’m pretty sure. He also did the voice of that one guy from Ghostbusters, which is really strange because it’s the same character Bill Murray played in the movie, but then when they made the movie -- Bill Murray did the voice of, uh, Gazorpazorp--er--Garfield I mean. MORTY   S68  Yea, that’s pretty cool, Rick. So all that happened in this reality too? RICK   S69  I don’t know. Just making conversation with you, Morty. What do you think, I-I-I know everything about everything?  INT. MORTY’S HOME - KITCHEN - DAY  Jerry is sitting on the kitchen floor, back against the oven. Beth sits on the floor across from him holding a box of wine. BETH   108  Did you really talk me out of the abortion? JERRY   109  Well, we-we blew a tire on the way to the clinic. Beth",
      "dialogue_count": 0,
      "word_count": 1070
    },
    {
      "scene_number": 7,
      "slugline": "INT. PIZZA PARLOR - DAY  A burly ITALIAN MAN in a wife beater is putting a pizza in the oven. It’s a busy/sloppy Italian NY style restaurant. ITALIAN MAN   S79  Hey, let the Trunk People have sex and get married, huh!? The following words appear on the screen over the Italian Man: ‘Vote YES on PROP 69’ ‘“Vote YES! Let Trunk People get Married!”’ ‘Paid for by ... Trunk People’ (Alongside a drawing of a trunk person.) PRO-TRUNKMAN VOICEOVER   S80  Paid for by... Trunk People.  INT. ON TV - SKETCH - STRAWBERRY SMIGGLES EXT. STRAWBERRY LAND - AFTERNOON  Rolling green hills and a bright blue sky. MR. TOPHAT JONES, a magical cereal mascot character ala the Trix Rabbit and Lucky Charms, hides behind a moss covered tree stump, pouring a bowl of Strawberry Smiggles cereal. MR. TOPHAT JONES   S81  Oh, I love me Strawberry Sniggles. Oo I hope nobody ever gets my hands on me and tries to steal my Strawberry Smiggles. I’m gonna eat every last one of them because, and then they’ll be in my stomach and nobody will ever be able to eat them! Except for me because they’re gonna be all inside my stomach. I’m, my name is Mr. Tophat... Jones and God forbid anyone ever take my shmakys-little-people-snibbles. I’m keepin ’em all for me. Tophat happily/frantically spoons Sniggles cereal into his mouth. MR. TOPHAT JONES (CONT’D)   S83  Mmm mmm Last bite. (gulp) Mmm. Ah, now they’re all resting comfortably in my stomach. Oo am I feeling good.  RAM 108 \"INTERDIMENSIONAL CABLE\"   FINAL ANIMATIC DRAFT (8/5/13) 29.",
      "characters": [],
      "action_text": "Two cute cartoon cereal style children rush into the scene like trained military seals, with no hesitation. They have very serious looks on their faces and one of them is holding a large knife. The other grabs Tophat and holds him down. MR. TOPHAT JONES (CONT’D)   S84  No! Get away from me! GET AWAY FROM ME, THOSE ARE MY SCRUMPTIOUS STRAWBERRY SNIBBLES! NO! AH! AGH! The child with the knife begins slicing open Tophat’s stomach. MR. TOPHAT JONES (CONT’D)   S85  Jesus Christ! Jesus Christ!   It hurts! They pull out clumps of strawberry Smiggles covered in viscera and guts, and begin to ravenously eat it. Tophat continues to struggle. MR. TOPHAT JONES (CONT’D)   S86  My entrails are out! Why would you even want to eat these? They’re- they’re they’re soaked with my stomach acid! Ah, Jesus Christ, Lord, Savior and, and Spirit! Save me! Take me to the Light! Oh my God! I see demons! I see demons are coming! The kids continue eating the cereal from Tophat’s stomach as he lies helpless. A box of Strawberry Smiggles appears on the screen over this scene alongside ‘PART OF A BALANCED BREAKFAST!!!’  INT. MORTY’S HOME - LIVING ROOM - CONTINUOUS  Angle on Rick and Morty on the couch watching the TV. Rick munches some wafer cookies. They are both entranced. MORTY   S87  Geez, Rick. Oh my God! That’s some pretty hardcore stuff, you know for a cereal commercial. RICK   S88  Well you know, Morty. I mean, you gotta do what you gotta do to move cereal. I mean, y-y-you know. You wanna sell boxes of cereal, you gotta, you gotta pump the gas a little. Pedal to the metal, Morty.  RAM 108 \"INTERDIMENSIONAL CABLE\"   FINAL ANIMATIC DRAFT (8/5/13) 30.",
      "dialogue_count": 0,
      "word_count": 549
    },
    {
      "scene_number": 8,
      "slugline": "INT. ON TV - SKETCH - TURBULENT JUICE EXT. RAINFOREST - DAY  A peaceful rainforest setting. A group of aggressive MUSCULAR MANNIES enter the scene. TURBULENT VOICEOVER   S89  In a world where Muscular Mannies are comin’ and they’re comin’ strong. THREE UNMUSCULAR MICHAELS enter the scene. TURBULENT VOICEOVER (CONT’D)   S90  There’s only three unmuscular Michaels. The Unmuscular Michaels make pretend guns with their hands using their forefinger and thumb and make firing noises. UNMUSCULAR MICHAEL   S91  Get down. Hurry. Run. The Mannies make MONKEY NOISES. TURBULENT VOICEOVER   S92  And that’s when real Turbulent Juice is comin’ and you gotta take care of it. A tidal wave of TURBULENT JUICE pours through the rainforest scene covering the Unmuscular Michaels and turning them into Muscular Michaels. The turbulent juice volcano turns into a tube of Turbulent Juice.  INT. KITCHEN - CONTINUOUS  The turbulent juice is sprays a kitchen table. TURBULENT VOICEOVER   S93  With Turbulent Juice, turbulent tables, no room is safe from the turbulent power of Turbulent Juice. The turbulent juice sprays a refrigerator, a laptop, and a toilet.  RAM 108 \"INTERDIMENSIONAL CABLE\"   FINAL ANIMATIC DRAFT (8/5/13) 31.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 187
    },
    {
      "scene_number": 9,
      "slugline": "INT. MORTY’S LIVING ROOM - CONTINUOUS  MORTY   118L  Hey Rick, what is Turbulent Juice? RICK   118M  I have no idea, Morty. I mean, it’s some kind of juice, I know that much. Jerry enters. JERRY   118J  Ugh, god. MORTY   121  Hey, Dad. W-what’s going on? JERRY   123  Well, your mother and I are going to be spending some time apart, Morty. And your sister found out she was an unwanted pregnancy. MORTY   124  W-w-what? RICK   125  Speaking of (BURP) “what,” Morty, “What” (BURP) should we (BURP) watch next? What about this?  INT. ON TV - SKETCH - BABY LEGS INT. POLICE STATION - CHIEF’S OFFICE - CONTINUOUS  The CHIEF leans against his desk speaking to DETECTIVE BABY LEGS, an adult homicide detective with a normal sized top half sporting a collar shirt and tie, and a tiny bottom half complete with diaper and a pair of very tiny, chubby little baby legs. CHIEF   S94  Baby Legs, you’re a good detective. But not good enough because of your baby legs. So I’m partnering you up with Regular Legs. PULL OUT to reveal REGULAR LEGS, a detective with regular sized legs. Just a normal looking detective. REGULAR LEGS   S95  Hey there.  RAM 108 \"INTERDIMENSIONAL CABLE\"   FINAL ANIMATIC DRAFT (8/5/13) 32.",
      "characters": [],
      "action_text": "Baby legs glances at Regular Legs, then back to the Chief. BABY LEGS   S96  Detective, I’m- this is upsetting to me because I feel like I don’t need no regular legged partner... CHIEF   S97  Baby Legs, don’t talk back to me. Good luck you two, there’s a criminal to kill.  INT. WAREHOUSE - LATER  Regular Legs and Baby Legs, guns drawn, slowly walk past stacks of boxes and what not. REGULAR LEGS   S98  Wow, you sure found this guy quick. BABY LEGS   S99  Uh yeah, because I’m a good detective. REGULAR LEGS   S100  Look Baby Legs, it’s the criminal! The CRIMINAL, A tall, strong jawed bearded man appears from behind a crate carrying a box labeled “NOT DRUGS.” CRIMINAL #3   S101  Ooooh, fucking, I’m the killer, I’m runnin’, I’m runnin’ real quick. The criminal drops the box and runs. Regular Legs starts to go after him but Baby Legs reaches an arm out and stops him. Baby Legs looks down at his baby legs. BABY LEGS   S104  (catchphrase) Baby Legs, here we go! Baby Legs breaks into his best sprint, but it’s incredibly slow and labored. BABY LEGS (CONT’D)   S105  Tw-tw-tw-twwwrrrrr. That’s the sound I make when I’m tryin’ to run fast. Tw-tw-tw-twrrrrrr. Baby Legs tries to keep going but his baby legs lose balance and he falls down.  RAM 108 \"INTERDIMENSIONAL CABLE\"   FINAL ANIMATIC DRAFT (8/5/13) 33. BABY LEGS (CONT’D)   S107  (to himself) Alright, I’m not gonna get him, I’m- I just learned a real valuable lesson. Regular Legs starts running. He’s very fast. REGULAR LEGS   S108  I’m comin’ Baby Legs! (passing baby legs) I’m Regular Legs! Regular Legs tackles the Criminal. REGULAR LEGS (CONT’D)   S110  We got him. Pull out to reveal Baby Legs is standing there. BABY LEGS   S111  Hey that was good team work.  INT. POLICE STATION - CHIEF’S OFFICE - DAY  CHIEF   S112  Baby Legs and Regular Legs, I’m proud of you two for working together. And Baby Legs, I know it was hard for you to come to the conclusion that you need a partner, but I’m proud of you that you did it. BABY LEGS   ",
      "dialogue_count": 0,
      "word_count": 1062
    },
    {
      "scene_number": 10,
      "slugline": "INT. INSURANCE OFFICE  The kitten are puppeteering Mrs. Sullivan, who is sitting in a chair across from a male INSURANCE SALESMAN. INSURANCE SALESMAN   S118  Mrs. Sullivan, I uh, please forgive me for being forward but your eyes are so beautiful. The kitties move her mouth and   MEOW .  INT. INSURANCE SALESMAN’S HOUSE - NIGHT  Just outside the darkened bedroom door. We see Mrs. Sullivan’s moo-moo laying on the floor, along with other clothes leading into the darkened bedroom. CATLADY VOICEOVER   S119  This Fall, sparks will fly. The kitties   MEOW . INSURANCE SALESMAN   S120  Unh unh, Mrs. UNH Sullivan. Ooo. CUT TO:  EXT. PARK - DAY - LATER  We see the Insurance Salesman sitting on a park bench and enjoying ice cream with Mrs. Sullivan, who is being puppeteered by the kittens. CATLADY VOICEOVER   S121  Between a wily-eyed insurance salesman. He stop and looks at Mrs. Sullivan lovingly. INSURANCE SALESMAN   S122  There’s something about you, Mrs. Sullivan. CATLADY VOICEOVER   S123  A group of determined kitties. The kitties work together to puppeteer Mrs, Sullivan so she hugs the insurance salesman. They   MEOW . CATLADY VOICEOVER (CONT’D)   S124  And a rotting old lady corpse.  RAM 108 \"INTERDIMENSIONAL CABLE\"   FINAL ANIMATIC DRAFT (8/5/13) 37.",
      "characters": [],
      "action_text": "The kitties make Mrs. Sullivan smile, revealing even more how dead she is. Her mouth is filled with maggots and flies BUZZ around her face. This becomes a still and the following appears on the screen ‘WEEKEND AT DEAD CAT LADY’S HOUSE II coming soon...’ CATLADY VOICEOVER (CONT’D)   S125  “Weekend at Dead Cat Lady’s House Two” - the fun is just around the coroner.  INT. MORTY’S HOME - LIVING ROOM - DAY  Morty and Summer enter and sit down on the couch next to Rick. RICK   137  You gotta get your priorities right, you just missed something really great. MORTY   138  (for Summer’s benefit) Doesn’t matter. He winks at her. JERRY   139  Hey, if your uh mother and I had to split custody, who would you guys choose? SUMMER   140  (for Morty) Doesn’t matter. She winks and fist bumps Morty. JERRY   141  Oh.  ON TV: A BREAKING NEWS REPORT  NEWS ANCHOR   142  Breaking news. Academy Award winning actor Jerry Smith is leading police on a slow speed pursuit after suffering an apparent breakdown.  RAM 108 \"INTERDIMENSIONAL CABLE\"   FINAL ANIMATIC DRAFT (8/5/13) 38.",
      "dialogue_count": 0,
      "word_count": 383
    },
    {
      "scene_number": 11,
      "slugline": "EXT. FREEWAY - DAY  Parallel universe Jerry drives a SCOOTER down the street wearing nothing but tighty whities. His eyebrow and half of his hair is shaved off. Several police cars are in pursuit. The screen reads the following: ‘LIVE’ (top left corner of screen); ‘6 NEWS’ (top right corner); ‘Special Report’ (lower third); and scrolling at the bottom: ‘Actor Jerry Smith Involved in Slow Speed Pursuit Shaves Head Microwaves Puppy’  INT. MORTY’S HOME - LIVING ROOM - DAY  Rick is about to change it. Jerry stays his hand. JERRY   143  Don’t even think about it. RICK   144  Come on, J-, are you kidding me, Jerry. It’s just a buncha dumb tabloid crap. Jerry stands up and grabs the remote. JERRY   145  (firm) It’s my   life   and we’re watching it.  INT. MORTY’S HOME - KITCHEN - DAY  Beth, holding a bottle and a glass of wine, sits on the kitchen floor wearing the goggles. There are empty bottles, boxes, and glasses of wine surrounding her. BETH   146  (slurred) You did it, Beth. You really nailed it. (BURP) You’re a surgeon. A human surgeon. Yay, you win.  BETH ALTERNATE POV INT. ALTERNATE BETH’S LIVING ROOM - DAY  Beth feeds her birds while sipping wine. She’s also drunk.  RAM 108 \"INTERDIMENSIONAL CABLE\"   FINAL ANIMATIC DRAFT (8/5/13) 39.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 216
    },
    {
      "scene_number": 12,
      "slugline": "INT. MORTY’S HOME (THE REAL ONE) - LIVING ROOM - CONTINUOUS  Jerry, Rick, Morty, and Summer watch the TV. From a helicopter POV, we see Jerry exit the freeway and turn into a gated community. JERRY   147  Where the hell am I going? RICK   148  (Burp) What are you asking me for, Jerry? (Burp) I’m sitting here (Burp) trying to figure out why the cops don’t just take you out, I mea- (Burp) they got a clear shot to your head. I can’t believe our tax dollars pay for this. Alternate Jerry pulls up to a house, parks and runs up to the door.  ALTERNATE BETH POV INT. ALTERNATE BETH’S LIVING ROOM - DAY  SFX: Doorbell. Beth looks from the birds to her front door.  INT. MORTY’S HOME - KITCHEN - DAY - CONTINUOUS  Beth still wearing the goggles and sitting on the floor, looks curious.  ALTERNATE BETH POV INT. ALTERNATE BETH’S DOORWAY - DAY  Alternate Beth opens the door to reveal the messed up Alternate Jerry standing in the doorway. BETH (O.S.)   149  Jerry? Jerry Smith?  INT. MORTY’S HOME (THE REAL ONE) - KITCHEN - CONTINUOUS  Beth drops the bottle and glass of wine, which spill on the floor.  RAM 108 \"INTERDIMENSIONAL CABLE\"   FINAL ANIMATIC DRAFT (8/5/13) 40.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 210
    },
    {
      "scene_number": 13,
      "slugline": "INT. MORTY’S HOME (THE REAL ONE) - LIVING ROOM - CONTINUOUS  Jerry, Morty, Summer, and Rick are glued to the TV not able to see who has opened the door yet.  ALTERNATE BETH POV INT. ALTERNATE BETH’S DOORWAY - CONTINUOUS  ALTERNATE JERRY   150  Beth Sanchez, I have been in love with you since high school. I hate acting, I hate cocaine, I hate Kristin Stewart. I wish you hadn’t gotten that abortion and I’ve never stopped thinking about what might have been. “Seal My Fate” by Belly begins to play quietly under Alternate Jerry’s speech.  INT. MORTY’S HOME (THE REAL ONE) - KITCHEN - CONTINUOUS  Beth stands up from the floor. Tears are streaming down her face from beneath the goggles.  INT. MORTY’S HOME (THE REAL ONE) - LIVING ROOM - CONTINUOUS  “Seal My Fate” by Belly builds as the helicopter POV shows Alternate Beth walk through the door to embrace Alternate Jerry. Jerry’s eyes widen at the revelation. Real Beth walks into the room holding the goggles. Jerry stands up and looks at her. She throws the goggles on the ground. They quickly go up to each other and embrace. JERRY   153  I love you, Beth. BETH   154  I love you, Jerry. Beth and Jerry start making out. Rick, bored of Beth and Jerry, picks up the remote. RICK   151  (to Morty) Hey, Ball Fondlers? Huh? (to Summer) Ball Fondlers?  RAM 108 \"INTERDIMENSIONAL CABLE\"   FINAL ANIMATIC DRAFT (8/5/13) 41.",
      "characters": [],
      "action_text": "SUMMER   152  Yeah, I could go for some Ball Fondlers. MORTY   152A  Yeah Ball Fondlers. They nod. Rick changes it.  INT. ON TV - SKETCH  An action packed scene from “Ball Fondlers.”  END OF ACT TWO  RAM 108 \"INTERDIMENSIONAL CABLE\"   FINAL ANIMATIC DRAFT (8/5/13) 42. TAG INT. ON TV - HAMSTER WORLD  Two hamster people pass each other on the street. The screen reads ‘Hamsters That Live in Butts’ above them. HAMSTER MAN   160  (tips hat) Good day to you, miss. HAMSTER WOMAN   161  Oh, hello there!  INT. MORTY’S HOME - LIVING ROOM - DAY  The whole family is watching. BETH   162  So, the hamsters live inside the rectums of those people? RICK   163  (annoyed) Yeah, sweetie, they- that’s where they live. JERRY   164  Well how does that work? I mean, do the butts look like little apartments inside? MORTY   165  Yeah and can they leave the butt? And like, walk around on their own? RICK   166  (more annoyed) Look, I don’t know. I’m watching the same thing you guys are. SUMMER   167  Grandpa Rick, if they leave the butt and the person wanders off, how would they find their butt person again? RICK   168  I don’t know Summer! I can’t even hear the TV! Alright, that’s it. (stands up and gets his portal gun out)  RAM 108 \"INTERDIMENSIONAL CABLE\"   FINAL ANIMATIC DRAFT (8/5/13) 43.  (MORE) We’re just gonna go there so you idiots can ask your stupid questions all day. Jerry jumps up. JERRY   169  Oo, family vacation! CUT TO:  EXT./INT. HAMSTER WORLD - VARIOUS  Music cue. A series of photographs from the family’s vacation appear on the screen: -In front of a hamster world version of the Iwo Jima soldiers planting the American flag statue. -The family on a roller coaster. We see hamster people in the other seats. -Summer and Beth in a conga line of hamster people at a Mexican restaurant. -A scientist hamster points to an anatomical diagram of a human/hamster illustrating how it works to Jerry. -The family is posing with a few hamster people.  RAM 108 \"INTERDIMENSIONAL CABLE\"   FINAL ",
      "dialogue_count": 0,
      "word_count": 593
    }
  ]
}