{
  "slug": "rick-and-morty-202-mortynight-run-2015",
  "title": "rick and morty 202 mortynight run",
  "genre": "sci-fi",
  "format": "series",
  "scenes_count": 5,
  "characters_count": 0,
  "characters": [],
  "total_words": 6533,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. RICK’S SHIP - CONTINUOUS  RICK   32  Okay, wait here. MORTY   33  I want to come with. RICK   34  Don’t come with, it’s boring, it’s- (BURP) it’s business stuff. MORTY   35  What kind of business do you do in a garage? You know this seems a little shady. RICK   36  Right, yeah, like nothing shady ever happened in a fully furnished office? You ever hear about Wall Street, Morty? Y-y-y-you know what those guys do in a- in th- in their fancy board rooms? They take their balls and they dip them in cocaine and wipe them all over each other. You know, grandpa goes around and he does his business in public because grandpa   isn’t   shady. KROMBOPULOS MICHAEL, a tough-looking creature, appears at Rick’s window and taps on the glass. RICK (CONT’D)   37  Ah, crap. (rolling down window) Hey, what’s up? KROMBOPULOS MICHAEL   38  Hey, Rick! (holds up a bag) Haha, here you go, three thousand flerbos. Do you have the weapon? RICK   39  (embarrassed) C-can we please - this is my  grandson , Morty. KROMBOPULOS MICHAEL   40  Well hi, Morty! I’m Krombopulos Michael, I’m an assassin, I buy guns from your grandpa!  RAM 202 \"MORTY-NIGHT RUN\"   FINAL ANIMATIC DRAFT (9/8/14) 5.",
      "characters": [],
      "action_text": "RICK   41  Ugh. Unbelievable. (hands out a case) Here. Go away. Michael opens the case and brandishes a sinister looking ray gun. KROMBOPULOS MICHAEL   42  Ooooh, yeah, this looks deadly. So this shoots anti-matter? My target can’t be killed with regular matter. Nice to meet you, Morty. (offers card) Listen, if you ever need anybody murdered please give me a call. I’m very discreet, I have no code of ethics, I will kill anyone anywhere. Children, animals, old people, it doesn’t matter. I just love killin’. RICK   45  You’re g- you’re giving him a card?! Morty takes Michael’s card. It’s a high-tech holographic card displaying Michael’s smiling face, his dynamically updated coordinates and, of course, “Krombopulos Michael, Killer.” Michael walks away, leaving Morty and Rick in silence for a beat. MORTY   46  You sell weapons to killers? For money? The camera slowly pushes into Rick’s face as if Morty, and the audience, is about to learn the most epic truth revealed in the show thus far. RICK   47  Ugh, you’ve got what the intergalactic call a very   planetary  mindset, Morty. It’s more complicated out here, this isn’t “money,” these are flerbos. Do you understand what two humans can accomplish with three thousand of these? MORTY   48  Uh, what?  RAM 202 \"MORTY-NIGHT RUN\"   FINAL ANIMATIC DRAFT (9/8/14) 6. RICK   49  An entire afternoon at BLIPS AND CHIIIIIIITZ! We ZOOM INTO his happy mouth, and when we zoom out we’re in:  INT. BLIPS & CHITZ - DAY  An intergalactic arcade with all the coolest games and eats. RICK   50  Oh, this place is the best, it’s got beer, games, prizes, and you can never tell what time it is. They walk past a bank of gaming machines. MORTY   51  You sold a gun to a murderer so you could play video games? RICK   52  Yeah sure, I mean if you spend all day shuffling words around you can make anything sound bad, Morty. Here, check this out. Rick slaps a helmet from one of the machines onto Morty’s head and inserts a flerbo. Morty’s eyes roll back.  I",
      "dialogue_count": 0,
      "word_count": 628
    },
    {
      "scene_number": 2,
      "slugline": "INT. SCHOOL - DAY  Roy studies a textbook while we hear a TEACHER instructing. TEACHER (V.O.)   56  I want you kids to look around you today and think about your future. Roy looks out the window at kids playing football. TEACHER (V.O.)   57  Now is the time in your life when anything is possible. 57A   We zoom in on the spiraling football. The football is caught by a twenty year old Roy as a stadium cheers.   He runs.  SPORTSCASTER (V.O.)   58  Spiraling perfectly it’s gonna be caught by Roy Parsons. Roy Parsons is at the twenty, now he’s at the TEN, NOTHING CAN STOP ROY THE ROCKET! TOUCHDOWN! Roy catches the eye of RHONDA, a bookish girl in the crowd. They smile at each other. We dissolve on Rhonda’s face to:  INT. DINING ROOM - EVENING  Thirty year old Rhonda in a modest home addresses a thirty year old Roy across the dinner table as their eight year old son picks at his food. RHONDA   59  I just think it’s time to get realistic. Have you talked to my father about the carpet store? Roy?  INT. CARPET STORE - DAY  59A   Forty year old Roy takes inventory in a carpet store.   He sighs.   It’s a living. His phone rings. He looks at it. The caller ID reads “Doctor Schmidt.”  INT. DOCTOR’S OFFICE - DAY  DOCTOR SCHMIDT somberly explains test results to Roy.  RAM 202 \"MORTY-NIGHT RUN\"   FINAL ANIMATIC DRAFT (9/8/14) 8.",
      "characters": [],
      "action_text": "DOCTOR SCHMIDT   60  Had we caught it sooner... well, hindsight is twenty twenty, Roy, what’s important is that we move quickly.  INT. HOSPITAL - DAY  A forty eight year old, emaciated Roy is in a hospital bed. Rhonda holds his hand. ROY   61  I’m not ready to die. RHONDA   62  You’re not   going   to.  INT. LIVING ROOM - DAY  62A   Roy is wheeled into his house.   His family cheers   from around a table with a cake, under a banner that says “CANCER CAN’T STOP THE ROCKET.” It’s a jubilant scene.  INT. CARPET STORE - DAY  Roy is fifty five now. He pleasantly shakes hands with a satisfied CUSTOMER. CUSTOMER   63  Hey thanks for the carpet, Roy. Roy watches the customer go, then turns to look at his desk. There’s a trophy with a football on it that says “World’s Greatest Dad.” Roy smiles to himself. MANAGER (V.O.)   64  Hey Roy, you pull those Persian off- white shags for the clearance sale? 64A   Roy goes to a step ladder and starts struggling with a roll of carpet. He loses his balance, falls off the ladder and breaks his neck.   His eyes roll back into his head. ROY   64AA  Whoa, sh- shiiit! Agh. The words “GAME OVER” appear over his death in spooky font.  RAM 202 \"MORTY-NIGHT RUN\"   FINAL ANIMATIC DRAFT (9/8/14) 9.",
      "dialogue_count": 0,
      "word_count": 463
    },
    {
      "scene_number": 3,
      "slugline": "INT. BLIPS & CHITZ - LATER  64B   Morty’s eyes roll back down and he   rips the helmet off his head in shock , looking around. MORTY   65  Hoh, what the hell?! W-w-where am I? What in the hell?! 65A   Rick has been drinking his beer   and watching the screen on Morty’s machine, which we now see is a game called “Roy: A Life Well Lived.” RICK   66  (examining screen) Fifty five years. Not bad, Morty. Y- you kind of wasted your thirties though with that whole “bird watching” phase. MORTY   67  W-where- where’s my wife?   *  RICK   68  Morty, you were just playing a game. It’s called Roy. Snap out of it. Come on. Rick grabs tickets from the machine, hands them to Morty and takes the helmet. MORTY   69  (remembering) I’m Morty. You’re Rick. (back to himself) Hey! You sold a gun to a guy that kills people! RICK   70  Look at this... (re: screen) You beat cancer, and then you went  back to work   at the carpet store? Boo. MORTY   71  D-don’t dodge the issue, Rick! Selling a gun to a hitman is the same as pulling the trigger! RICK   72  It’s also the same as doing nothing.  RAM 202 \"MORTY-NIGHT RUN\"   FINAL ANIMATIC DRAFT (9/8/14) 10.  (MORE)",
      "characters": [],
      "action_text": "If Krombopulos Michael wants someone dead, there’s not a lot anyone can do to stop him, that’s why he does it for a living. (putting on helmet) Now excuse me, it’s time to thrash your Roy score. MORTY   73  You know, you could stop this killing from happening, Rick. You know, y-you did a bad thing selling that gun but you could undo it if you wanted. RICK   74  (half concentrating) Uh huh. Yeah that’s the difference   *  between you and me, Morty. I   never  go back to the carpet store. Rick fully concentrates on the game. A passing RANDOM ALIEN notices Rick’s skills. RANDOM ALIEN   75  Holy shit, this guy’s taking Roy off the grid! (calling out) This guy doesn’t have a social   *  security number for Roy! 75A   A small crowd gathers around the machine.   Morty fumes for a beat, then storms off. INT. JERRYBOREE - DAY  Jerry, upset, talks to Helen at the front desk. JERRY   76  Hi, I’m sorry, I think there was a misunderstanding. I’m an adult and would like to go home, please. HELEN   77  Well of course, right through that tube. 77A   Jerry looks around annoyed, but still enters the tube.  JERRY   78  Unbelievable.  RAM 202 \"MORTY-NIGHT RUN\"   FINAL ANIMATIC DRAFT (9/8/14) 11.  RICK (CONT'D) HELEN   79  You’re doing great! JERRY   80  (indignant) I know how to crawl in a tube. (crawling) Ah, come on. Uch, this is harder than it looks. 80A   (Jerry does not know how to crawl through a tube). As he goes through, we now see a huge room with tons of these tubes.  Jerry keeps crawling and reaches a slide.  JERRY (CONT’D)   81  Whooooa! 81A   He curls around and then flies out   into:  INT. JERRYBOREE - BALL PIT - CONTINUOUS  81B   Other Jerrys are having fun in the ball pit.   The ENTIRE ROOM is decorated like a play version of Morty’s home. JERRY   82  You guys are enjoying this? Don’t you feel a little patronized? OTHER JERRY   83  How so? Just then an alien dressed in a large, PLUSHY BETH costume comes in. PLUSHY BETH   84  Jeerrrrry! JERRY   85  Oh come on, this is ri",
      "dialogue_count": 0,
      "word_count": 870
    },
    {
      "scene_number": 4,
      "slugline": "INT. GROMFLAM MILITARY BASE - SCIENCE LAB - CONTINUOUS  KOOF (a glowing gaseous cloud of light) hovers in the center of a small holding cell, the “bars” of which are rays of some kind. Krombopulos enters and produces the sinister weapon Rick made. He levels it on the gaseous cloud. 93H   Rick’s ship smashes through the wall and into the room exactly where Michael was standing,   obliterating Michael   and burying itself halfway into the floor.  INT. RICK’S SHIP - CONTINUOUS  Krombopulos Michael’s business card is on the dashboard. Amid   *  the sounds of leaking steam and falling debris is the sound of the ship’s navigation system: NAVIGATION (V.O.)   94  You, have, arrived at... (splice) Krombopulos Michael. Your destination is below. 94A   Morty is slumped over the steering wheel of the craft, knocked out from the impact. He   slowly regains consciousness.  MORTY   95  (dazed) We’re all out of off-white Persian.  INT. GROMFLAM MILITARY BASE - SCIENCE LAB - CONTINUOUS  Morty exits the vehicle, looking around. Among the debris, he finds Michael’s arm, still holding the gun. MORTY   96  Aw, man. W-w-w-what have I done? GUARD   97  Drop the gun! A guard with a laser rifle has the drop on Morty. Morty doesn’t know what to do. MORTY   98  Y-you don’t understand. (points to Krombopulos) This guy was gonna kill someone.  RAM 202 \"MORTY-NIGHT RUN\"   FINAL ANIMATIC DRAFT (9/8/14) 14.",
      "characters": [],
      "action_text": "GUARD   99  (raises his gun) I guess that makes two of us. Hurgh! 99A   A Rick portal appears in the middle of the guard’s body, splitting him down the center   like a knife splitting a piece of fruit. The front of his body falls forward, the back falls backward, leaving two even slices of guard on the floor as Rick steps through the portal onto the front half. RICK   100  What are you doing, Morty? This is a Galactic Federation outpost!   *  Look, I don’t have time to tell you my entire backstory but you need to understand that Grandpa and government don’t get along. KOOF   101  He saved my life. 101A   Rick and Morty are startled   that the imprisoned cloud is speaking. RICK   101B  What? MORTY   102  Huh? Whoa! Are you Krombopulos Michael’s target? W-w-w-what’s your name? KOOF   103  My kind has no use for names. I communicate through what you call Jessica’s feet. No. Telepathy. RICK   104  Oh, good job, Morty. Y-y-you- you killed my best customer but you saved a mind-reading fart. KOOF   105  I like this name, “Fart.” Morty, would you kindly release me by pulling that lever to the left of my cell? I am in great pain. 105A   Morty pulls the lever   next to the cell, deactivating its laser bars. An ALARM sounds. MORTY   106  Oh crap. Let’s get you out of here.  RAM 202 \"MORTY-NIGHT RUN\"   FINAL ANIMATIC DRAFT (9/8/14) 15. RICK   107  We can’t get him out of here. He’s gaseous, he’s not gonna make it through a portal, Morty. MORTY   108  Well then I guess we’re all getting in the car. Right, uh... KOOF   109  Fart. MORTY   110  No! Just- j-j-just get in the car. Morty opens the door to Rick’s ship. Koof floats in. RICK   111  Morty, come on. W- I wanna go back to Blips and Chitz. I don’t wanna deal with this. MORTY   112  Rick, you’ve been clear on the fact that you don’t wanna help, so just go away. KOOF   113  More are coming. Rick hears more guards coming. RICK   114  Screw this. I’m out. 114A   Rick goes back through a portal, which disappears. Morty is stunned",
      "dialogue_count": 0,
      "word_count": 3138
    },
    {
      "scene_number": 5,
      "slugline": "INT. JERRYBOREE - LOST WING - CONTINUOUS  The Lost Jerrys are working on an entertainment center. Jerry skulks up, ashamed. TANK TOP WEARING JERRY   212  Hey, are you the one that left? Jerry nods. TANK TOP WEARING JERRY (CONT’D)   213  I get it, it’s a- it’s a hassle out there. JERRY   214  Right? I mean, who needs that? GOATEE JERRY   214A  Right? I mean, who needs that? PAUL FLEISCHMAN, a Jewy man in his early 40s approaches. PAUL FLEISCHMAN   215  Hahoh, not us. JERRY   216  Uh, who are you? PAUL FLEISCHMAN   217  Oh. Excuse me. (extends hand) Paul Fleischman. Infinite timelines. In some of them Beth re- marries. JERRY   218  Jeez. PAUL FLEISCHMAN   219  Don’t worry, I treat Beth very well and I do not overstep my bounds with Morty. Every kid needs a dad but there’s no replacing you. Hey, you wanna give us a hand with this? We’re trying to figure out how to get the sound coming through the stereo instead of the TV. I- I- I don’t- it’s very difficult. JERRY   220  Oh, uh, well is there an AUX input?  RAM 202 \"MORTY-NIGHT RUN\"   FINAL ANIMATIC DRAFT (9/8/14) 29.",
      "characters": [],
      "action_text": "GOATEE JERRY   221  We tried that, but there’s two different colors... We PULL BACK on row upon row of entertainment centers as packs of Jerrys occupy themselves.  EXT. PREHISTORIC PLANET - DAWN  A dinosaur eats something, then moves on, revealing a run- down interstellar rest stop, with a few alien families picnicking. Rick’s ship pulls in.  INT. RICK’S SHIP - CONTINUOUS  Rick, Koof, and Morty. KOOF   222  The wormhole is seventy of what you call meters what you call north of what you call here. RICK   223  Fine, Morty, take your fart to his hole and say your goodbyes. I’m gonna find some fuel and take a biiig fat Morty. That’s my new word for shit because of today’s events.  EXT. PREHISTORIC PLANET - WOODS - DAY - ESTABLISHING EXT. PREHISTORIC PLANET - WOODS - DAY  Morty walks through the brush with Koof floating next to him. They come to a small clearing with a wormhole in the center. KOOF   224  Here it is. This should take me back to my kind. MORTY   225  I’m gonna miss you... Um. Fart. I-I- I’m really sorry your name became Fart. KOOF   226  I will be back soon, Morty. MORTY   227  Really?  RAM 202 \"MORTY-NIGHT RUN\"   FINAL ANIMATIC DRAFT (9/8/14) 30. KOOF   228  After I return to the others with this location, we will be back for your cleansing. MORTY   229  Um. Cleansing? KOOF   230  Carbon-based life is a threat to all higher life. To us, you are what you would call a disease. Wherever we discover you, we cure it. You said yourself that life must be protected, even through sacrifice. You haven’t changed your mind about that, I can sense your thoughts. Morty?   *  Morty nods, frustrated but resigned. MORTY   231  Um. Before you go... could you sing a- c-could you sing for me again?   *  KOOF   232  Yes, Morty.   *  (singing)  Cosmos without hatred ...  INT. VOID OF TIME AND SPACE - MUSIC VIDEO  Koof flies with Morty through space paradise again. KOOF   233  (singing)  Diamond stars of cosmic light, Quasars shine through endless night And everything is one in",
      "dialogue_count": 0,
      "word_count": 1434
    }
  ]
}