{
  "slug": "roma-2018",
  "title": "roma",
  "genre": "action",
  "format": "film",
  "scenes_count": 3,
  "characters_count": 0,
  "characters": [],
  "total_words": 16364,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. - MATERNITY WARD - OB/GYN - DAY Dozens of cribs in a row, each one with its own new-born baby rolled up in a blanket. Cleo watches them through the window. Some sleep and others cry anxiously. Four cribs project strong lights on babies with masks, and to one side - In an INCUBATOR - A premature baby, tiny and fragile is plugged into tubes that barely bind him to life. Cleo watches, fascinated. Suddenly - A great block of plaster falls off the ceiling and lands on the incubator, covering it completely.  Thursday, December 31st, 1970.  INT/EXT - ‘64 VALIANT - PUEBLA FREEWAY EXIT - CERRO LA CALDERA - DAY Señora Sofía drives, her index finger in its eternal argument. Cleo rides next to her, and between them, Pepe. Toño, Paco and Sofi are in the back seat. The radio plays Radio Éxitos. Pepe looks through the rearview mirror off into the distance - PEPE Why does the mountain spell   LEA ? (READ) SEÑORA SOFÍA So that you kids read. See? Even the mountain is asking. TOÑO It’s the initials for Luis Echeverría Álvarez, dummy. SEÑORA SOFÍA Don’t call him that. He’s 5. He doesn’t have to know who Echeverría is. Explain it to him.  58.",
      "characters": [],
      "action_text": "CONTINUED: TOÑO He’s the president! SOFI Isn’t it Gustavo Díaz Ordaz? SEÑORA SOFÍA Not anymore, Sofi. It’s now Luis Echeverría, since December 1st. SOFI Oooooh... PACO Cleo really likes Echeverría. Yuck! CLEO Well, yeah. His wife Doña Ester is always dressed in   huipiles   and Oaxacan clothing. He likes us Indians. TOÑO But my uncle Alberto says he’s the one who ordered the students killed two years ago. CLEO Noooooo! TOÑO He was the Minister of the Interior. SOFI Why did he kill the students? TOÑO ‘Cause they didn’t do their homework. SEÑORA SOFÍA Enough, Toño. No, Sofi, Toño is just messing with you. PEPE Well I don’t like him. Why does he write on the mountain? It’s not his!  59.",
      "dialogue_count": 0,
      "word_count": 329
    },
    {
      "scene_number": 2,
      "slugline": "EXT. - PUEBLA FREEWAY - CERRO LA CALDERA - DAY The Valiant plows on eastward. In the background the Cerro La Caldera, longing to be a mountain, delineates the boundary of the city as it melts into the slums. The west slope of the hill has been desecrated by three immense white letters extending almost all along and across its dry surface - LEA. Like a curse. EXT. - ZAVALETA HACIENDA - DAY A great adobe wall surrounds an immense property in the middle of fields. The Valiant crosses an enormous gate into- EXT. - ENTRANCE - ZAVALETA HACIENDA - DAY A road crosses the enormous walled esplanade. In the background, the beautiful wall of the hacienda, a monument to Profirian estates. The Valiant reaches the Big House. A dozen cars are parked in a row to one side of the road. All large luxury cars of the year: LTDs, Impalas and Country Squires. The ‘64 Valiant parks between an LTD and a Country Squire, making its mileage and its peeling paint very obvious. They get out of the car. Señora Sofía opens the trunk and Cleo starts to pull out the luggage, her belly barely noticeable. A group of people comes out of the Big House to greet them: three adults, some kids and several servants. CLAUDIA DE LA BÁRCENA, 38, SAMANTHA LARSSON, also 38, a high-class Mexican with died blond hair and MOLLY EDWARDS, an affable blond Welsh woman, 37, all throw their arms up in the air - MOLLY Comadre! EXT/INT - CORRIDOR - HACIENDA - DAY BENITA, 55 years old, the Hacienda housekeeper, guides Cleo down a long corridor. Both carry several bags some in their hands others hanging from their shoulders. BENITA You sure you can carry that?  60.",
      "characters": [],
      "action_text": "CONTINUED: CLEO Yes, I’m with child, not sick. What? You tired already? Cleo hurries forward. Benita does the same, following her. BENITA As if! CLEO I haven’t seen you for six months and you got old on me. The two women race hurriedly, buried under bags like ants carrying several times their own weight. Benita catches up with Cleo, who hurries on and overtakes her. But Benita stops - BENITA Where you going? Cleo stops. Benita is standing next to a door - BENITA (CONT’D) You’ve gone too far. What? Since you’re pregnant you forget everything? Cleo smiles and walks back. INT. - CHILDREN’S ROOM - HACIENDA - DAY A hall full of bunk beds, rudimentary but functional. There are several bags next to the beds and there are toys on top of some already. Lined up along all the walls there are stuffed dog heads. Cleo leaves the luggage next to a bunk bed and looks at the heads. BENITA Señor José had the room redecorated. They’re the Hacienda dogs. Look... They were all in storage. They look at a German Shepherd’s head with glass eyes.  61. CONTINUED: BENITA (CONT’D) Look, that there is Pirata. He lived here in 1911. A small plaque confirms this. It also indicates his name - Pirata. Cleo looks on, impressed. CLEO Pirata... BENITA And do you remember Canela? CLEO Yeah, where’s she at? BENITA Look at her. Cleo looks at an Irish Setter’s head. CLEO Yikes! BENITA She died during the summer. Cleo looks at Canela, horrified. CLEO They say she must have eaten a poisoned rat. But I think it was the villagers who are bothering Don José again about the land... Canela looks at them with her glass eyes. EXT - SMALL CLEARING IN THE WOODS - HACIENDA - DAY The winter light filters through the trees and reflects on the great puddle stretching between the clearing and the woods. Children run between the trees throwing firecrackers, two dogs follow them, jumping in the puddle. Adults are practicing shooting bottles lined up on tree stumps with .22 caliber pistols at the other end of the clearing. ",
      "dialogue_count": 0,
      "word_count": 12401
    },
    {
      "scene_number": 3,
      "slugline": "INT. - ROOM - BUNGALOW - TUXPAN - DUSK The sky’s last light attempts to paint the windows but is defeated by the lightbulb inside a wicker lamp, which lights the small room with two beds. Cleo, sits on one of the beds and putting Pepe’s T-shirt on as he stands in front of her with his arms up in the air. When his head pokes out the collar, Pepe looks at her, surprised - PEPE Cat got your tongue? Cleo shakes her head no. PEPE (CONT’D) Then why don’t you talk. Cleo smiles, with a smile that holds back tears, and walks him out of the room to a - INT. - LIVING ROOM - BUNGALOW - TUXPAN - DUSK Another wicker lamp hangs in the middle of the little dining room and two lamps on each side of the sofa, one without a shade, light the room. Toño is tying knots with a string while Señora Sofía is applying vinegar on Paco’s back with a cotton ball. PACO Ay! Ay ! Ay...! SEÑORA SOFÍA I told you to put on your T-shirt. PACO But it was cloudy! SEÑORA SOFÍA That’s why! The glare is worse than the sun! Next to him, crying and crying, Sofi waits her turn. SEÑORA SOFÍA (CONT’D) Are you dressed Pepe? PEPE Yes, but the cat got Cleo’s tongue.  119.",
      "characters": [],
      "action_text": "CONTINUED: Señora Sofía smiles. Cleo sits on the sofa and grabs a cotton ball, douses it in vinegar, comes close to Sofi and starts applying it on her back. Cleo and Señora Sofía swab wet cotton balls over Sofi and Paco’s backs. Sofi won’t stop crying but Cleo’s gaze is absent. INT. - RESTAURANT - TUXPAN - NIGHT Hand-drawn illustrations of each dish and a stuffed sailfish decorate the walls of a family restaurant. Romantic music pours out of a rockola, accompanying the hum of the fluorescent lights. The family’s finishing dinner. Cleo cuts Sofi and Pepe’s meat. They’re wearing pajamas already. Toño has finished and is tying his knots. SEÑORA SOFÍA Children? But the children are distracted. SEÑORA SOFÍA (CONT’D) Children? She finally gets her children’s attention. SEÑORA SOFÍA (CONT’D) Pay attention! I have something to tell you. The children look at her expectantly. Señora Sofía hesitates, gathers her courage and - SEÑORA SOFÍA (CONT’D) Your dad’s not in Ottawa. SOFI Is he back?! SEÑORA SOFÍA No. Your dad never went anywhere. The children look at her, she’s seems confused. SEÑORA SOFÍA (CONT’D) Well, yes. But he only went for a week and... your father’s not coming back home.  120. CONTINUED: The children watch her in silence. Toño and Paco are interested, Sofi and Pepe are confused. The song ends and the rockola digests another coin, expelling a new lament. SEÑORA SOFÍA (CONT’D) We came on this trip so he could come get his things from the house. PACO What things? SEÑORA SOFÍA His things. Or what he says are his things. His clothes, the bookshelves... PACO Are you getting a divorce? SEÑORA SOFÍA He says he doesn’t know. Sofi starts to cry. SOFI He doesn’t love us anymore? SEÑORA SOFÍA Dad loves you very much. He says he wants to see you. TOÑO When? SEÑORA SOFÍA He says he doesn’t know when... Soon. Sofi muffles her cries in Cleo’s breast, Toño looks at the fan and Paco plays with his beans. Only Pepe is still looking at his mother, still confused. SEÑORA SOFÍA (CONT",
      "dialogue_count": 0,
      "word_count": 3634
    }
  ]
}