{
  "slug": "room-2015",
  "title": "room",
  "genre": "drama",
  "format": "film",
  "scenes_count": 20,
  "characters_count": 7,
  "characters": [
    "MA",
    "JACK",
    "OLD NICK",
    "DOUG",
    "OFFICER PARKER",
    "NEIGHBOR BOY",
    "NANCY"
  ],
  "total_words": 22721,
  "total_dialogue": 15,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. ROOM - NIGHT 1   1 Darkness. The faint background hum of a refrigerator. A light clicks on, briefly, then snaps off again. Then on again, for a little longer. We wake groggily with JACK (five), blinking up at MA (26). She's standing in a worn t-shirt and underwear beside a lamp, switching it on and off at apparently random intervals.   She cranes up at the recessed skylight, Room's only window. The irregular flashes of lamp-light reveal glimpses of this little world lined with cork: ten foot a side, seven foot high, gabled ceiling rising to ten foot. Clusters of Jack's and Ma's vivid drawings are pinned all over the walls, quivering in the draft from the vents. Done with five crayons (red, yellow, blue, orange, green) and pencil on toilet tissue, lined pages or cardboard, they show dogs, trees, aliens, rocket ships, figures labelled 'Jack' or 'Ma'. Delicate mobiles (uncooked spaghetti, threads, plastics, foil, down from pillows, cloth scraps) dangle. A wardrobe with slatted louver doors. On top, toys crafted from garbage, a Labyrinth from toilet-roll insides. A dresser with a TV.   A homemade pack of cards, papier mâché checkers and chess. A Fort constructed from vitamin and other bottles and cans.   A single meagre African violet in a pot on the TV. A round dining table, two fold-up chairs side by side. A bath with a single small towel over the side. A toilet, with a flotilla of homemade toy boats floating in the tank which is oddly missing a lid. A sink, with a single worn toothbrush, toothpaste, dish soap, a broken comb, folded rags for washcloths. A small square of mirror tile hung up over it. A small kitchen cabinet.   A dish rack: two each of big and small white plates, bowls, tumblers, knives, forks, spoons (one with a melted handle), a scissors, can opener, serrated knife, wooden spoon, spatula. A basic stove (with more folded rags on its handle, for pot holders), one frying pan and one saucepan. A small refrigerator (more toys on top), a tiny trash. (CONTINUED)",
      "characters": [],
      "action_text": "A rocker.   Above, a shelf. Ten books stacked. Homemade toys. A reddish Persian-style rug on the floor. A grey steel door, no handle.   On the wall, a ten-digit keypad with a red light like a watching eye. Ma looks over at Jack and sees that he's awake.   She mouths 'Sh' at him, soothing him back to sleep. Keeps signalling. Darkness again, as Jack's eyelids fall. TITLE: ROOM INT. ROOM - DAY 2   2 Faint light.   Jack and Ma sleep face to face in a double bed under a thin quilt.   Pale skin, long hair, wearing t-shirts. JACK (V.O.) You cried all day and left TV on till you were a zombie. But then I zoomed down from heaven through Skylight into Room - (makes noise of descent, then crash landing) and I was kicking you from the inside, boom boom, and then I shot out onto Rug with my eyes wide open, and you cutted the cord and said “Hello Jack.” Jack wakes. JACK Ma. I’m five! CHAPTER TITLE: PRESENTS INT. ROOM - DAY 3   3 A little later, Ma, at the kitchen counter, measures out two small bowls of cereal. Jack moves round Room touching things: Rug's rusty bloodstain from his birth; the scarred Table; chairs; faucets, etc. JACK Morning lamp, Morning rug, Morning wardrobe .. (he looks under the bed)  CONTINUED: 1   1 (MORE) (CONTINUED) Morning Eggsnake. It's my birthday. I'm five.  CONTINUED: 3   3 JACK (CONT'D) (CONTINUED) Ma puts breakfast on the table. Sits. Jack sits, too. Ma gives him a half vitamin pill from an almost empty tub. She takes a contraceptive pill from a generic pack. They start to eat. Ma winces. JACK (CONT’D) Is Bad Tooth hurting? MA (taps her head) Mind over matter. He taps his head too as he chants the slogan. JACK If we don't mind, it doesn't matter. MA Guess what we're going to make later. JACK What? MA A cake. JACK A birthday cake, like in TV? MA But for real. INT. ROOM - DAY 4   4 A little later, Ma is brushing Jack's teeth (with their single, frayed brush) zealously. He spits with vigor. A little later, Ma and Jack are looking a two small piles of c",
      "dialogue_count": 0,
      "word_count": 1087
    },
    {
      "scene_number": 2,
      "slugline": "INT. ROOM - DAY 6   6 Later, the furniture is back in place.   Jack picks   Dylan the Digger   from his stack, which includes   Pop-Up Airport, My Big Book of Nursery Rhymes, The Runaway Bunny, Alice in Wonderland.   (He ignores the adult books -   The Da Vinci Code, Twilight, The Guardian, Bittersweet Love, The Shack .) Ma can't hide her revulsion at   Dylan the Digger   again. MA Come on, you can read Dylan yourself. JACK I can read them all but I like when you do. Ma recites animatedly. Jack turns the board pages, not noticing that Ma's eyes are shut as she reads from memory. MA Heeeeeeeere's Dylan, the sturdy digger! / The loads he shovels get bigger and bigger. / Watch his long arm delve into the earth, / No excavator so loves to munch dirt. INT. ROOM - DAY 7   7 Later, Jack blows the second of two small eggs, keeping the shell intact. Beating butter and sugar, Ma keeps up their Rhyme game. MA Our friend Table... just isn't able. Jack pours the eggs into her bowl of butter and sugar. JACK Our friend Spoon, sings to the moon. Ma beats the eggs in. MA Our friend Knife runs for his life. She winces in pain, and shakes out her right wrist. Jack notices and takes over, beating the batter for her.  (CONTINUED)",
      "characters": [
        "MA",
        "JACK"
      ],
      "action_text": "Later: Ma strings the shells onto the needle tongue of their Eggsnake, made of eggshells crayoned, given paper clothes, foil crowns, colored wool for hair...   Eggsnake is hundreds of eggs long. INT. ROOM - DUSK 8   8 A little later.   The birthday cake is small, brown, plain. Ma makes a 5 with thin white icing. MA Abracadabra! JACK Now the candles. Reading her face, his crumples. JACK (CONT’D) You said a birthday cake for real. That means candles on fire. MA Jack - JACK You should ask for candles for Sunday Treat, not dumb jeans. MA Sorry. I have to ask for stuff we really need that he can get easily. JACK But Old Nick gets anything, by magic. MA Try your cake, I bet it's  delicioso . But Jack is sulking. She hugs him, quietly soothing him. JACK Next week when I'm six you better ask for real candles. MA Next year, you mean. Later: Half the cake is eaten.  CONTINUED: 7   7 (CONTINUED) Jack is kneeling at the bath. There’s a bucket with dishes in front of him. He’s washing up as expertly as an adult. INT. ROOM - NIGHT 9   9 Later. Steam makes Room mysterious. Jack lies on Ma in the bath, both with bubble moustaches.   End of the Selkie story: MA But one day the mermaid finds where the fisherman hid her comb. JACK Ha ha. MA So she runs home to the sea. She lets her head and face sink under the water. Jack sits up on her, upset. Ma emerges and opens her eyes.   Realizes what's wrong. MA (CONT’D) Of course she takes her Baby Jack with her. JACK Does he drown? MA No, he's half-merman.   He can breathe air or water, whichever. Satisfied, Jack leans over to scoop up the pile of clothes. JACK Laundry Time. With relish, he plunges them under the water. INT. ROOM - NIGHT 10   10 Laundry is hung up to dry everywhere. Ma and Jack are in their sleep t-shirts and underwear.   She sits breastfeeding him and telling him a story.  CONTINUED: 8   8 (CONTINUED) MA ... and Edmond swims and swims to the island of Monte Cristo and digs up all the treasure, and ... INT. ROOM - NIGHT 11   ",
      "dialogue_count": 2,
      "word_count": 1909
    },
    {
      "scene_number": 3,
      "slugline": "INT. ROOM - DAY 18   18 The third morning.   Jack wakes up in the bed, where Ma always carries him once Old Nick has gone. Ma is up already, sitting at the table, staring at a shiny red truck and remote in a hard pack. The snake is in Eden. Jack can hardly believe what’s in front of him. He looks at it for a while. MA You can open it. We watch as Jack opens the box. Ma tries to help him when he finds the packaging difficult. JACK (pulling it away from her) I can do it. Later, Jack is playing with his new toy. Ma watches him uneasily. We hear a faint echo of screaming ... CHAPTER TITLE: UNLYING The screaming get’s louder. Later, Ma is standing on a chair screaming and howling at the Skylight. Jack stands in the bath screaming into the small air vent above the shelf. He holds his truck up to the vent so it can join in. Then they hush and listen. JACK (CONT’D) Why the aliens never scream back? MA I guess they still can't hear us. JACK Tomorrow we'll do even louderer. Later, Ma, preoccupied, trims mold off cheese she slices very thin and lays on brown bread. Puts it in the toaster oven. Jack zigzags his truck around chair and table legs. Ma checks to see if the frozen peas are boiling yet. Jack drives the truck at the door: clang. MA Jack!  (CONTINUED)",
      "characters": [],
      "action_text": "JACK What smells bad? Ma belatedly realizes the grilled cheese is smoking. She burns her hand slightly on the oven, wrenching it open.  CONTINUED: 18   18",
      "dialogue_count": 0,
      "word_count": 273
    },
    {
      "scene_number": 4,
      "slugline": "INT. ROOM - WARDROBE - NIGHT 19   19 That evening. Jack, in the wardrobe, is meant to be asleep but he’s still playing with his truck. The door beeps; he kneels up for a glimpse as it booms shut. OLD NICK (O.S.) Hey. What's the smell? He puts down groceries, unzips his jacket. MA (O.S.) Sorry, I burned some cheese. OLD NICK (O.S.) You need to take more care. MA (O.S.) I will. I wasn’t thinking. OLD NICK Yeah, well, thinking's not your strong suit. MA (O.S.) I know. I'm really sorry. Ma is unpacking the groceries. OLD NICK So did he like his truck? He laughs at her speechless discomfort. OLD NICK (CONT'D) I know boys, I was one once. Ma looks at the empty bag. MA The vitamins? OLD NICK Waste of money. MA If we had a better diet, maybe...  (CONTINUED)",
      "characters": [
        "OLD NICK"
      ],
      "action_text": "MA What are you going to do? He doesn't answer. MA (CONT’D) Are you... looking for another job? OLD NICK (OVERLAPPING) What job? There are no damn jobs, Jesus Christ! Jack, frightened, shrinks back in the wardrobe knocking into the back panel. Old Nick turns his attention to the wardrobe. OLD NICK (CONT’D) Hey in there. MA He's asleep. OLD NICK Don't think so. You keep him in the closet all day as well as all night? Poor little freak has two heads or something? He roots in his jacket pockets and produces an already opened tube of hard candy. OLD NICK (CONT'D) Hey Jack. You like candy? Wanna come out and have some candy? Jack, tempted, reaches for the door... Desperate to distract Old Nick, Ma touches his arm. MA Let's go to bed. Old Nick chuckles at this unaccustomed seductiveness. MA (CONT’D) Now. OLD NICK Didn't your Momma ever teach you manners? MA Please.  CONTINUED: (2) 19   19 (CONTINUED) Pocketing the candy, he wraps himself round her. They edge backwards out of view. The lamp snaps off. INT. ROOM - WARDROBE - NIGHT 20   20 A little later, everything is quiet.   Moonlight. Jack, asleep in a crooked position, wakes with a jump. He sits up and rubs his neck. Finds his truck. He opens the door and peeks out. Where's the candy? INT. ROOM - NIGHT 21   21 Stepping out, holding his truck for moral support, Jack stumbles into something and gasps.   He picks it up: a thick leather belt, like a cobra.  CONTINUED: (3) 19   19 (CONTINUED) He takes another few steps and stubs his toe on a huge boot. Jack stares at Old Nick, asleep in the middle of the bed. Ma is sleeping too, clinging to the far side. Now he's come this far, Jack forgets the candy, fascinated by Old Nick, whom he's seeing up close for the first time. Jack puts his finger out, almost touching Old Nick's face. Old Nick's eyes open, startled.   Then he grins. OLD NICK Hey sonny. Ma leaps up screaming and flailing at Old Nick. MA Get away from him! Get away! Jack drops his truck and races to the wardrobe. He ",
      "dialogue_count": 1,
      "word_count": 1004
    },
    {
      "scene_number": 5,
      "slugline": "INT. ROOM - DAY 25   25 Jack is at the table reading to his injured truck from ALICE. Both are dressed in all their clothes in an effort to keep warm. JACK For, you see, so many out-of-the- way things had happened lat-ely - MA Lately. JACK - lately, that Alice had begun to think that very few things indeed were really impossible. Ma comes to the table and doles out half-thawed green beans. MA Lunch! JACK No thanks. MA We have to use them up before they rot. Once we eat we'll feel warmer. Jack makes himself chew a limp bean. Ma nibbles a few, with a show of enthusiasm. Jack looks at his three-wheeled truck. JACK When's Old Nick going to put the power back? MA Soon. JACK When's soon?  (CONTINUED)",
      "characters": [
        "JACK"
      ],
      "action_text": "MA Once he's not mad with me anymore. Jack watches the bruises on her throat move. JACK I hope he never comes back not ever. MA Jack.   Think about it. He does, with difficulty. JACK No Sunday Treat? MA No anything. Jack tries the bean again - then spits it out quietly. Ma watches him, kisses him, forces herself to begin telling him the truth. MA (CONT’D) Hey Jack. Remember the mouse? JACK My friend Mouse? MA You know where he is right now? Jack looks all around Room. MA (CONT’D) On the other side of this wall. Jack stares hard at the wall. JACK What other side? MA Oh Jack, everything has two sides. JACK Not an octagon. MA No, that's -  CONTINUED: 25   25 (CONTINUED) Jack shakes his head. MA (CONT’D) Where do you think Old Nick gets our food? JACK From TV by magic. MA There's no magic! Everything we see on TV - it's pictures of real stuff and real people in the world. JACK Dora's real for real? MA No, sorry, not Dora, she's just a picture, but the other ones, with faces like ours - and there's real streets and oceans, dogs, cats - JACK (OVERLAPPING) No way. Where would they all fit? MA Just out there, in the world. Jack, tired of this, changes the subject. JACK Can I have a sandwich? Controlling her exasperation, Ma gets out a half slice of bread and adds a rationed scraping of peanut butter. She sets down his food and he comes to the table to eat it.  CONTINUED: (3) 25   25 (CONTINUED) Ma stands with her hands in her armpits to warm them. She stares around as if for proof. Cranes up at the skylight. MA Look! A leaf! JACK Where? MA On skylight. She climbs up on a chair and lifts Jack onto her shoulders so he can see. His head is close to the recessed skylight. He looks at a brown, sodden half-rotted leaf. JACK Dumbo Ma. That’s not a leaf. Leaves are green. MA On the trees they are but when they fall they rot, like salad, in the fridge, they -. JACK (interrupting) Where's all the stuff you said? Trees and dogs and - MA (OVERLAPPING) Well, we can't see them from here ",
      "dialogue_count": 1,
      "word_count": 1263
    },
    {
      "scene_number": 6,
      "slugline": "INT. ROOM - DAY 27   27 Next morning, a sunny day. Jack wakes up beside Ma. JACK It's warm again. But she pulls the pillow over her head. He knows it's one of her rare catatonic Gone days.  CONTINUED: 26   26 (CONTINUED)",
      "characters": [
        "MA",
        "OLD NICK"
      ],
      "action_text": "Later. Jack eats cereal and watches DORA (sound on very low). DORA AND BOOTS Where do we go next? River, Bridge, Highest Hill. Will you check my backpack for something to help us? Later.   TV off. Jack creeps up to Ma and studies what he can see of her bruises, which are more purple-black today. He tries to read Ma's watch but the angle makes it hard. He plays at switching Ma on with the remote. Later. Jack plays chess (with their homemade papier mâché set) against his truck. Later. Kicks a shrivelled red balloon to keep it in the air. Later. It's turned cloudy. Jack nibbles a bagel at the table. Later.   He makes a tour of his domain, his friends. JACK (V.O.) Eggsnake's our longest friend and fanciest.   Meltedy Spoon's the best to eat with because he's more blobbier. Labyrinth is the twistiest and she hides things so I don't know where. Toilet's the best at disappearing poo. Lamp's the brightest except when the powercut. (glances at Ma) You're the best at reading and songs and lots except if you're having a Gone Day. I'm the best at drawing and jumping and growing and nearly everything. He examines the truck's broken axle.   Yanks on another wheel until it snaps off. Then the last two. He twists the doors off. Stuffs the truck, its parts and remote in the trash. Later, light fading.   Jack lies beside Ma, longing to breastfeed. Lifts the edge of her t-shirt, but doesn't dare. He sits up, rests his hand on the bump of Ma's foot. INT. ROOM - DAY 28   28 Next day. Ma (apparently normal again) and Jack finish their cereal.  CONTINUED: 27   27 (CONTINUED) MA Apple? He takes a big bite and hands it back to her. Ma bites in, winces. She reaches into her mouth and pulls out a tooth. MA (CONT’D) About time. JACK Bad Tooth? Can I have it? MA Sure, if you want it. INT. ROOM - DAY 29   29 A little later.   Jack is watching wildlife while Ma cleans up from breakfast: baby turtles emerging from shells and heading down the beach. Tying up the trash bag, she finds the truck, and ",
      "dialogue_count": 4,
      "word_count": 3106
    },
    {
      "scene_number": 7,
      "slugline": "EXT. STREET NEAR OLD NICK'S - DUSK 36   36 Sound and shaking: the truck roars along too fast. We're with Jack, stunned, face-down in the darkness.  (CONTINUED)",
      "characters": [
        "DOUG",
        "OFFICER PARKER"
      ],
      "action_text": "At last he remembers that he's meant to be wriggling out. He writhes, but the rug has tightened in transit. With an effort, Jack manages to roll over. No better. The engine quietens as the truck slows. Jack is not sure if that's his signal and anyway he's still trapped in the rug. The truck doesn't stop at the stop sign, only slows. Jack remembers his arm. He forces it above his head, wincing as the rug scrapes the skin off his elbow.   Jack puts all his misery into movement, thrashing about, kicking, jack-knifing like a dying fish. The truck's engine lulls as it makes a rolling stop. Jack feels the rug slide a little across the flatbed, which gives him just enough momentum that he bends, with a deep grunt, and the rug starts to roll open. He bursts out, on hands and knees: like a birth. Elbow and lip bloody, face covered in hair, snot and tears. The world hits Jack: street lamps, wind in his face, shocking colors of the sunset. Trees and houses looming and then receding, like a rollercoaster. His glance falls on the shovel meant for his grave. Jack's eyes focus on the cab of the truck and what he realizes must be the back of Old Nick's head, driving. Old Nick slows at the third stop, and swings right. Jack is flung headlong, banging his leg on the left of the flatbed. The truck screeches to a stop, because Old Nick heard the noise and glimpsed Jack in his rearview mirror. He flings the driver's door open. Jack scrabbles over to the opposite side. Old Nick jumps down and strides around the truck. Jack leaps down to the tarmac, bloodying his left knee. His jaw smashes into his right knee. He picks a direction at random and tears away from the truck, stumbles, keeps going. A large dog on a long leash, emerges from a yard.  CONTINUED: 36   36 (CONTINUED) CONTINUED: (3) 36   36 (CONTINUED) He pulls out his cellphone and dials. Old Nick picks up Jack again and hurries to his truck. Doug waits impatiently for the emergency operator. DOUG (shouts after Old Nick) I've got y",
      "dialogue_count": 2,
      "word_count": 1751
    },
    {
      "scene_number": 8,
      "slugline": "INT. POLICE CAR - NIGHT 39   39 Minutes later. Outside an unlit house, with a Police van and a back-up, unmarked car parked facing the other way. A plain clothes OFFICER is knocking on the front door of the house. Jack watches through the car window as Officer Parker consults with an OLDER WHITE MALE OFFICER, also plain clothes. Parker and the older officer start to poke around the side of the house, disappearing for a moment before running back. Officer Parker takes what looks like a crowbar from the trunk of the car. She draws her weapon. Grabowski moves to leave the car. OFFICER PARKER Stay with the boy. She disappears around the back of the house. Jack hyperventilates, thinking about Old Nick and Ma. OFFICER GRABOWSKI (eyes Jack in mirror) You OK, kid? We hear shouting, a crack of splitting wood. Jack starts clawing at the car door, can't find the handle. OFFICER GRABOWSKI (CONT’D) Hey, hey, take it easy. A figure hurtles towards the car: Ma. She can't get the door open either because of the lock. Faces pressed to the glass, she and Jack almost touch. Then, at last the door is open and Jack is in her arms. INT. POLICE CAR - NIGHT 40   40 A little later. Jack and Ma, in blankets, hold each other as the police cruiser moves through the night. Jack does a huge yawn, utterly exhausted now the adrenalin is gone. JACK Can we go to Bed now? MA We can do anything. They'll find us somewhere to sleep soon. JACK No, but Bed.   In Room.  (CONTINUED)",
      "characters": [],
      "action_text": "Ma realizes he thought their escape would be temporary. She hugs him as he drifts off to sleep. INT. HOSPITAL - EMERGENCY ROOM - NIGHT 40A   40A Still in Ma’s arms, Jack half wakes to find himself carried through a hospital emergency room. They are being bustled along by Officers Parker and Grabowski, A FEMALE PLAIN CLOTHES DETECTIVE, a DOCTOR, a NURSE and a HOSPITAL SECURITY GUARD. A woman in her 50s, is beside them, her arm around MA. This is NANCY, Ma’s mother. It’s like a strange dream to Jack. Through the group around him he can make out other figures waiting in chairs. He can hear a drunk shouting, phones ringing. JACK Ma. Ma shushes him, stroking his hair. He drifts back to sleep. OMITTED 41   41 OMITTED 42   42 OMITTED 43   43 OMITTED 44   44 INT. HOSPITAL - MA AND JACK'S SUITE - DAY 45   45 Next morning. A bright hospital room. Jack and Ma share the fancy hospital bed. A cot bed, unused, has been set up to one side. Jack is awake but content to lie close to Ma for a while - studying the dials and switches on the wall above his head. He looks at Ma, asleep, bruises fading to yellow-green. He sits up and pulls back the sheet. He's wearing only a pair of underpants from Room which look particularly wretched in this new antiseptic environment. He touches the part of the mattress he’s being lying on. It’s damp. He examines a bandage on his knee. He gets up. On a side table, he sees a plate with the remains of some toast on it and a half drunk cup of tea. He sniffs at the food. There are two surgical masks there, also. He walks slowly to the opposite wall, his little figure silhouetted against the translucent blinds. He stops in front of the one window which has its blind drawn. The hospital suite is high up and the view is spectacular.  CONTINUED: 40   40 (CONTINUED) From the back we study Jack's small figure and beyond it the vast world below.  CONTINUED: 45   45 (CONTINUED) Coming around on Jack's face we see that he is trying to make sense of what he’s seeing",
      "dialogue_count": 0,
      "word_count": 1054
    },
    {
      "scene_number": 9,
      "slugline": "INT. HOSPITAL - MA AND JACK'S SUITE - BATHROOM - DAY 46   46 Ma and Jack are in the shower. Jack is pressed to the door, as far away as possible from the powerful jet of water. JACK Bath before Bed. She can't hear him over the noise of the water. MA What? JACK Bath before Bed, that's the rule. MA There aren't any rules now, Jack. We can do what we like! Jack is unnerved by all this. Ma groans with pleasure as she lets the water hit the back of her neck. JACK Are you hurting? Ma laughs. Jack edges into the water and she washes him with a hand towel. INT. HOSPITAL - MA AND JACK’S SUITE - MORNING 47   47 Both in robes with wet hair. While Ma looks out the window Jack noses around the room taking in the strange experience of an unknown space. He opens a drawer, then another. Empty. A very light tap at the door which only Jack hears.  (CONTINUED)",
      "characters": [
        "JACK"
      ],
      "action_text": "JACK The door's ticking. The door opens a little. Ma jumps. Jack hides behind his mother as a man's head - wearing a surgical mask - appears around the door. DR. MITTAL Hello there, I hear we’re all woken up. MA That’s right. Jack’s buries his head in. MA (CONT’D) It’s OK, Jack. DR. MITTAL (thirties/forties) come further into the room. A nurse pushes in a breakfast trolly then leaves. DR. MITTAL Hi there, Jack. I’m Dr. Mittal. You were asleep when I cam in this morning. Jack won’t make eye contact. DR. MITTAL (CONT’D) You must be hungry? No answer. Dr. Mittal moves the breakfast trolley in front of Ma and Jack. Ma removes the plastic domed lids and foil. Jack stares at the strange food. He runs his finger around the BLUE RIM OF HIS PLATE and looks at it to see if the color has come off. Ma eats. DR. MITTAL (CONT’D) So, I have some things for you both. He hands 2 pairs of sunglasses to Ma. DR. MITTAL (CONT’D) You may find it more comfortable to wear these if you go outside. Some sunscreen. Holding up a surgical mask. DR. MITTAL (CONT’D) For Jack.  CONTINUED: 47   47 (CONTINUED) MA Is that really necessary? DR. MITTAL Lots of germs in the air to get used to. (taking out some pills) My colleague has prescribed these for the pain in your wrist until we can schedule a surgery. (handing over a last bottle) And something to help you sleep.  CONTINUED: (2) 47   47 (CONTINUED) MA OK. Thanks. (to Jack who is still playing with his food) Try it, it’s   delicioso . Jack’s not convinced. DR. MITTAL Have you thought any more about what we discussed this morning? MA Thanks for the offer but we’re going to go home. DR. MITTAL You know my view. After what you’ve experienced, and to assess Jack properly. And just to soften the transition - MA (interrupting) Nothing happened to Jack. DR. MITTAL I understand, but even at a cognitive-sensory level - depth perception, auditory processing ... MA But he’s OK, right? DR. MITTAL The most important thing you did was to get him out while he’s ",
      "dialogue_count": 1,
      "word_count": 1506
    },
    {
      "scene_number": 10,
      "slugline": "INT. HOSPITAL - MA AND JACK’S ROOM - DAY 49A   49A Jack lies on the bed listening to music on headphones. In the background Ma talks to two DETECTIVES. They show her images on a laptop which is turned away from Jack. INT. HOSPITAL EXAMINATION ROOM - DAY 50   50 Jack being weighed and measured.  (CONTINUED)",
      "characters": [],
      "action_text": "Jack getting his shots. Blood being taken. Jack is left with a little cotton swab fixed to this inner elbow with a thin band-aid. INT. HOSPITAL - MA AND JACK'S SUITE - NIGHT 51   51 Later. Quiet at last. Ma and Jack alone, shoes and masks off. Out of the big window as the last of the sun fades. Ma picks at something plain from their dinner tray, while Jack breastfeeds. In the background the TV news. NEWS ANCHOR (V.O.) Which the major utility companies say they will not cover. Tenants’ organizations have said they will fight this decision, if necessary at the federal level. Beat NEWS ANCHOR And now to developments in the case of the young woman, believed to be Joy Newsome, (a picture of a smiling Ma as a teenager comes on screen) who was rescued last night, along with her child, from a garden shed having allegedly been held captive there for over seven years. We are getting unconfirmed reports that an individual has just been arrested, after what one witness has called a 'short stand-off' at a house on the east side. Footage of Old Nick’s house. The room phone starts to ring. Ma picks up. MA I know, I'm watching it right now. I can't believe it. I just want to be home now. NEWS ANCHOR (V.O.) Both victims are understood to be receiving medical attention at an unknown location.  CONTINUED: 50   50 (MORE) (CONTINUED) The child, of unknown gender, was described by one eyewitness as unable to walk .. MA Wait, wait a second. She switches off the set. OMITTED 52   52 INT. CLINIC - FOYER - DAY 53   53 Ma, Jack (masked, with sunglasses on), Nancy and Robert move towards the doors of the hospital where the Resident FBI agent waits for them. Robert is carrying the small bag that contains all of Ma and Jack’s possessions. Ma puts her sunglasses on as they go through the doors. DR. MITTAL You have your schedule of appointments, and your medications. Please completely finish the course of antibiotics. MA I understand. DR. MITTAL You have my number. MA Got it. DR. MITTAL If you nee",
      "dialogue_count": 0,
      "word_count": 2529
    },
    {
      "scene_number": 11,
      "slugline": "INT. NANCY AND LEO’S HOUSE - LIVING ROOM - MORNING 62   62 Ma and Nancy sit with coffees. Jack has some cereal. The house is very quiet. No one talks for a while. Eventually ... JACK (quietly to Ma) Where’s Grandpa. Beat. NANCY He had to go home for a while. MA (holding Jack’s face gently) Hey Jack, you want play with your new toys? Jack shakes his head. A few minutes later: Nancy is cleaning up in the kitchen as Ma breastfeeds Jack. She looks out on the bare winter back yard. INT. NANCY’S HOUSE - LOUNGE AND FRONT HALL - AFTERNOON 62A   62A Through a chink in net curtains of a car pulling up outside Nancy and Leo’s house. The Lawyer gets out. We see that the press has thinned out substantially. There are a few curious MEMBERS OF THE PUBLIC with nothing better to do, a UNIFORMED POLICE OFFICER and a POLICE CAR. NANCY (O.C.) Jack! Come away from there. We are in the lounge. Jack turns away from the window as Nancy goes to greet the Lawyer, keeping herself hidden as she opens the door. NANCY (CONT’D) Come in. LAWYER Thank you. Automatic door. NANCY Yes. LAWYER Let me take my shoes off here.  (CONTINUED)",
      "characters": [],
      "action_text": "CONTINUED: 62A   62A",
      "dialogue_count": 0,
      "word_count": 213
    },
    {
      "scene_number": 12,
      "slugline": "INT. DINING ROOM - LATER 63   63 The LAWYER and Nancy watch Ma filling out some forms. She is subdued. Jack has some blank paper in front of him. He is staring at a large open box of Crayola pencils; every shade of every color. He carefully selects 5 pencils - the 5 colors he’s used to from Room - and begins to draw. Jack occasionally glances at Leo, drawn by his natural warmth. LAWYER The other thing we need to talk about is coming up with some kind of media strategy. I know you're not thinking about that right now. But there’s a lot to decide about in that category. NANCY I don’t think we’re ready for talking yet. Not like that.  (CONTINUED)",
      "characters": [
        "NEIGHBOR BOY"
      ],
      "action_text": "LAWYER There are certain to be expenses going forward and a prime time interview, one prime time interview, means a lot of money. Donations are coming - and I’ll need some account details, better in yours than mine, right? - but it wouldn’t amount to enough for, you know, open ended support. Beat. LAWYER (CONT’D) There’s huge interest. Ma notices that Jack is using only the same small set of colors for his drawing that he had in Room. MA Jack, you have all those colors. Why don’t you use them. You could draw a picture of Jack the giant slayer, with every color. Jack keeps drawing. INT. NANCY’S HOUSE - LIVING ROOM - NIGHT 63A   63A Ma, Jack, Nancy and Leo eat supper, watching TV. Jack is drawn to look at Leo who does the old thumb trick for him. INT. NANCY AND LEO’S HOUSE - MA’S BEDROOM - MORNING 64   64 Ma is still asleep. Jack sits on the bed beside her, bored. He looks towards the half-open door to the landing. INT. NANCY AND LEO’S HOUSE - LANDING - DAY 65   65 Jack sits on the landing with a favorite toy from the pile in the sitting room. From where he sits he can see the open door to his and Ma’s bedroom. It’s dark inside. Eventually, Leo walks into view with a male DETECTIVE and a female VICTIM LIASON OFFICER. He shows them to the door. LEO Thank you again.  CONTINUED: 63   63 (CONTINUED) He lets them out, closes the door behind them, then peeps through the closed curtains. As he turns away, he spots Jack, gives him a salute and then busies himself in ways calculated to raise the interest of a 5-year-old. Tidying up, he picks up a ball from the floor, spins it on his finger, bounces it. Wanders off out of view, whistling, muttering about how particularly bouncy this ball is, etc. Jack starts down the stairs. He goes down on his backside not yet confident enough to do it standing. INT. LIVING ROOM/KITCHEN - MORNING 66   66 Jack wanders cautiously into the brightness of the living room, finding Leo who smiles at him, then gets back to whatever he’s pretending to ",
      "dialogue_count": 1,
      "word_count": 1139
    },
    {
      "scene_number": 13,
      "slugline": "INT. NANCY AND LEO’S HOUSE - LEO’S DEN 71   71 Ma opens the door of Leo’s den. Jack is beside her, his face smeared with camomile lotion. MA Leo, please don’t ever take Jack outside again unless you know what you’re doing. He can be seriously hurt by the sun. LEO I’m so sorry. It was overcast. MA He has never had any UV. This is serious stuff, OK? INT. LIVING ROOM - LATER 72   72 Jack gazes out the window, not wanting to go outside anymore. In the background, we can hear Ma noisily preparing something in the kitchen. INT. MA’S OLD BEDROOM - LATER 73   73 Ma has boxes spread out all over the room. She is morbidly engrossed in some old papers and memorabilia. Jack sits down. She keeps reading, looking. MA Look at this. She shows him an old photo. Four girls in track uniforms. MA (CONT’D) You know who that is? JACK You? MA Me and Stacy Benton and Heather Noel and Laura Sullivan. That’s how people did their hair. We were the relay team. I was the anchor. I was fast. We did track together. JACK Real track?  (CONTINUED)",
      "characters": [],
      "action_text": "MA Real track. On a field. We were fast. Best in the district. You know what happened to them? JACK No. MA Exactly. Nothing. They just lived and nothing happened. Look ... She picks up her old laptop from the floor by the bed. She has been looking through her friends pages on Facebook. She clicks on a couple of pages showing the same girls as they are now, then loses interest, closes the laptop. JACK Show me more when you were young. MA No. I don’t want to see any more. I don’t want you to look at any more right now. Let’s just be quiet for while. Okey dokey? They sit. She stands and paces the room, gnawing her lips, wincing, trying and failing to keep her despair out of view. INT. MA’S OLD BEDROOM - NIGHT 74   74 Jack wakes from a nightmare with a start. No Ma beside him. He gets out of bed. The only light is coming from the hallway through a crack in the door. JACK Ma? He leaves the bedroom, stands blinking on the bright landing. He hears noises from downstairs, raised voices, a high pitched squeal. JACK (CONT’D) Ma? He goes downstairs. We follow him into the living room. INT. NANCY AND LEO’S HOUSE - LIVING ROOM - LATER 75   75 We enter with Jack to find Nancy, Leo and Ma. Ma and Nancy are hugging. The lawyer is on speaker phone.  CONTINUED: 73   73 (CONTINUED) LEO Not at all, we’ll all sleep better. LAWYER (SPEAKER) I thought you’d want to know. LEO That’s right LAWYER It’s a good day. NANCY Thank God. JACK You were gone! Ma turns. She’s been crying but she comes over to Jack smiling broadly. She kneels so her face is level with his. MA Do you want to hear something really good? In the background Leo ends the call. JACK You were gone. MA Hey listen. Old Nick is going to jail for a really long time. JACK I know Old Nick is in jail. MA But now he’ll be there for ever and ever. And I don’t have to see him ever again or talk to the judge or any of those scary things. Isn’t that great? Jack nods, not really understanding. MA (CONT’D) We can stop worrying now and start",
      "dialogue_count": 0,
      "word_count": 600
    },
    {
      "scene_number": 14,
      "slugline": "INT. NANCY AND LEO’S KITCHEN - DAY 76   76 Ma is on her phone, furiously texting. Jack watches. He’s bored. Just the sound of tapping thumbs. JACK What are you doing? MA I'm talking to people. She keeps texting, not explaining further. INT. MA’S OLD BEDROOM - DAY 77   77 Jack sits on the bed, watching Ma at her dressing table.   She is smartly dressed, her hair is fixed nicely. JACK Why do you look like that? MA I’m dressed to go out, that’s all. He watches MA force earrings through the healed piercings in her ears. It looks painful. JACK I don’t like it. MA It’s just some clothes and makeup. INT. NANCY’S HOUSE - STAIRS - MOMENTS LATER 77A   77A Jack follows Ma downstairs. MA Come on, we need to get you ready. We follow them into ... INT. NANCY’S HOUSE - KITCHEN 77B   77B Nancy cleans up in the kitchen. Ma and Jack come in. Ma finds the sunscreen and starts to apply it.  (CONTINUED)",
      "characters": [
        "NANCY",
        "MA"
      ],
      "action_text": "NANCY Maybe it’s too much for him right now. MA It’s not too much for me. I need to go out, get some air. Ma starts to apply sunscreen to Jack. MA (CONT’D) (to Nancy) You could have a better attitude, you know. With some effort, Nancy holds her tongue. MA (CONT’D) You could support me in this. That’s all I’m asking. I’m trying to take a step. NANCY You don’t have to do it so soon. You could wait and we could go together. Ma wipes her hands, dials a number on her phone.  CONTINUED: 77B   77B (CONTINUED) OMITTED 78   78 EXT/INT. STREET/LAURA’S CAR - DAY 79   79 A car is waiting. Inside, a young woman smiles and waves. Ma - holding a booster seat -   cracks the door. MA Oh my God! LAURA Oh my God! The girls hug. LAURA (CONT’D) You look... Amazing. I can’t believe you’re here. MA (fastening Jack) I know. I know. LAURA I’ve missed you so much. I can’t believe you’re actually here. And look at Jack! What a sweetheart! He is so cute! Ma gets into the passenger seat. MA This is too weird, sitting in this car right now. LAURA You are such an amazing person, Joy. I have thought about you so much.  CONTINUED: (2) 77B   77B (MORE) (CONTINUED) And I am so happy you are here with me now. I cannot even tell you. MA I’m happy, too. And a little freaked out. LAURA You just sit back. Relax. We’ll take it nice and slow. We watch from the sidewalk as the car pulls away. OMITTED 80   80 INT. CAR - SOON 81   81 The girls talk... LAURA ...Tracy is doing so good. She got her teaching certificate and now she’s teaching in Milwaukie, loving it. I saw her last summer and she is still so fun. MA I always liked her even though we never really hung out. LAURA She liked you too. (to Jack) Your Mom was very popular in school. MA That’s actually not true.  CONTINUED: 79   79 LAURA (CONT'D) (CONTINUED) LAURA If you weren’t popular, I don’t know who was. MA Susan Torrey. LAURA That’s true. The girls laugh. Laura’s phone rings and she answers. LAURA (CONT’D) Hey, I’m driving. Something pert/flirtatiou",
      "dialogue_count": 2,
      "word_count": 2141
    },
    {
      "scene_number": 15,
      "slugline": "EXT. BACK YARD - DAY 91   91 Jack wanders the back yard. INT. MA AND JACK’S BEDROOM - DAY 92   92 Jack wanders in. Ma is sitting on the bed. She seems calmer. MA Come here, Jack. He goes over and she wraps her arms around him. He cuddles into her. MA (CONT’D) You know, Jack, we're going to have to move away from here someday. We're going to have to get our own house. And a yard. We’re going to have to do all kinds of things.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 89
    },
    {
      "scene_number": 16,
      "slugline": "EXT. HOUSE - DAY 93   93 Cube vans rolling up. He sees a woman, slick, driven, 50s get out of an SUV. This is the Hostess, the same one we saw on TV in Room. OMITTED 94   94",
      "characters": [],
      "action_text": "OMITTED 95   95 INT. DINING ROOM - DAY 96   96 Jack is fascinated by the machinery. The boxes, cords, tripods and lights. He stands near the camera crew, listening to them talk, watching them set up their gear. INT. LIVING ROOM -   LATER 97   97 Jack, looking through the back window, watches the camera crew follow his mom and the hostess around the yard. They pretend to talk. Ma is dressed in her best outfit. Nancy approaches Jack. NANCY Time for you to go upstairs, Jack. Remember what your Mom said. INT. LEO’S DEN - LATER 98   98 The house is quiet apart from two muffled voices. Jack looks over to see Leo asleep in a chair. OMITTED 99   99 INT. HALLWAY - CONTINUOUS 100   100 Jack creeps out of the room and down the hall. He walks down the stairs - gingerly, but on his feet. INT. LIVING ROOM - CONTINUOUS 101   101 Jack edges into the living room, finding an enthralling circle of lights and cameras focussed on his mother and the hostess in their chairs. The center of the room is shadowless and ultra-vivid, exposed by many bounces and fills. Ma and the Hostess face each other in two armchairs brought in for the occasion. HOSTESS You are an amazing, inspiring, courageous, beautiful young woman.  (MORE) (CONTINUED) I know all our viewers are amazed by the intelligence and poise and endurance and inner strength you displayed during your ordeal.  CONTINUED: 101   101 HOSTESS   (CONT'D) (MORE) (CONTINUED) Truly, an amazing test of character. MA Thank you. Thank you so much. I hope they all know how much their thoughts and prayers have meant the last few weeks. To our whole family. Jack is enthralled. HOSTESS And Jack. Your son. By all accounts he is a normal, high-functioning, happy little boy. Amazing. MA He is. He’s my life. I never could have survived without him. HOSTESS You made life as normal and nurturing as you could given the environment. You gave him a childhood. How did you manage to do that? MA I... I didn’t think about it. I didn’t plan it. When I found out I ",
      "dialogue_count": 0,
      "word_count": 1147
    },
    {
      "scene_number": 17,
      "slugline": "INT. NANCY AND LEO’S HOUSE - HALLWAY - CONTINUOUS 107   107 Jack arrives. Leo holds out the phone. A pause then Jack takes it, holds it too far away: his first call. NANCY (FILTERED) Hi, Jack. I've got someone who wants to talk to you... MA (FILTERED) Is he there? Put him on. LEO He's on. He's waiting. MA (FILTERED) Jack? JACK Ma? She struggles to get control of her voice. MA (FILTERED) Are you doing OK? Jack is stumped by this question. JACK Come back. MA (FILTERED) What's that? JACK (louder) Come back now. MA (FILTERED) I wish I could. I just need to - JACK (OVERLAPPING)  I   pick.   I   pick for both of us.  (CONTINUED)",
      "characters": [],
      "action_text": "Ma breaks down in sobs. Jack hands the phone to Leo who talks to Nancy in murmurs. INT. MA’S OLD BEDROOM - CUBBYHOLE - EVENING 107A   107A Jack sits in the space under the roof in Ma’s bedroom playing with Lego. INT. NANCY’S HOUSE - LOUNGE - NIGHT 107B   107B Jack watches TV with Nancy and Leo OMITTED 107C   107C INT. NANCY’S HOUSE - DOWNSTAIRS VARIOUS 107D   107D Jack mopes around the house. Nancy and Leo give him space. INT. MA’S OLD BEDROOM - DAY 107DA   107DA Jack wakes up alone. Minutes later we see him enter Ma’s walk-in closet. Sounds of things being shifted around inside. INT. NANCY’S HOUSE - LANDING 107E   107E Jack walks out to the landing with Ma’s box of memorabilia. Moments later, journals and photos are spread around him. He examines her year-books, photos of her as a child his own age. EXT. NANCY AND LEO’S HOUSE - DAY 108   108 A week has passed and the outside of the house is completely clear of press/onlookers. Nancy’s car pulls up. She get’s out, let’s Jack out of the back seat and the two of them carry shopping bags to the front door. A NEIGHBOR waves. NEIGHBOR Been shopping. NANCY Yes we have. We’re making cupcakes.  CONTINUED: 107   107 INT. NANCY AND LEO’S HOUSE - KITCHEN - A LITTLE LATER 109   109 Nancy and Jack bake companionably in the kitchen. Jack stands on a chair. NANCY You know how to beat eggs, Jack? JACK Sure. I did it before. In Room.  (CONTINUED) NANCY Did you? Wow. What else did you do there. JACK Lots of things. I miss it sometimes. NANCY Wasn’t it awfully small. Jack shakes his head. JACK Uh uh, it went every direction all the way to the end. It never finished. And Ma was always there.  CONTINUED: 109   109 (CONTINUED) NANCY OK. JACK It was small in wardrobe. NANCY What did you do in wardrobe? JACK Sleep. When Old Nick came. Beat. JACK (CONT’D) I want to see Ma. NANCY I know. She just needs to be on her own a little while. We hear the front door closing. LEO (O.S.) Hey Jack. There’s someone here who’d like to meet you. Jack hops ",
      "dialogue_count": 0,
      "word_count": 603
    },
    {
      "scene_number": 18,
      "slugline": "EXT. PLAYGROUND - DAY 112   112 Jack tentatively climbs on a frame in a playground. Leo watches, with Seamus on a leash. INT. FRONT LIVING ROOM - DAY 113   113 Nancy is reading. Jack enters. JACK Grandma. NANCY Yes? JACK I need the scissors. NANCY What for? JACK For cutting my hair. NANCY You really want to do that? JACK I want to send it to Ma. NANCY Why? JACK She needs my strong more than me. So I want to send it to her. Or you could take it to her. Nancy is moved. NANCY I can help you if you'd like. JACK That would be great.  (CONTINUED)",
      "characters": [],
      "action_text": "NANCY Okay. Let's do this right. I've wanted to cut that hair a very long time. INT. NANCY'S KITCHEN - LATER 114   114 Jack sits in a chair with a sheet around his neck. Nancy clips his hair. NANCY I used to cut your mother's hair all the time. And your Grandpa's hair. I've still got it. JACK You think this will work? Can my strong be her strong too? I’m not really sure if it works that way. NANCY Of course it does. We all help each other stay strong. No one is strong alone. You and your mom, you help each other through, don't you? JACK Yes. NANCY And you and me. And you and Leo. And Leo and me. We all have the same strong.  CONTINUED: 113   113 (CONTINUED) JACK I guess we do. NANCY Ok, here goes. Jack closes his eyes as Nancy cuts off his pony tail. INT. BATHROOM 115   115 Jack is leaning his head back on the round lip of the bathroom sink. She turns on the water. NANCY Now lean back. The water is nicely warm now. NANCY (CONT’D) This is the best part. She pours water over his head, and shampoos him. NANCY (CONT’D) Feels good, doesn't it? He closes his eyes and nods. She pours more water. And more. His face is rosy with the heat. JACK I love you, Grandma. NANCY I love you, Jack.  CONTINUED: 114   114",
      "dialogue_count": 0,
      "word_count": 349
    },
    {
      "scene_number": 19,
      "slugline": "INT. NANCY'S HOUSE - KITCHEN - DAY 116   116 Jack is drawing a multicolored picture. He uses all the colors of the crayon box. The picture of a house grows in colors and dimensions. The door is green. The windows orange. The roof red. EXT. NANCY AND LEO’S HOUSE - BACK YARD - DAY 117   117 Jack plays with the Neighbor Boy and Seamus in the garden. He hears a tap tap tap and looks round. Ma is watching him through the glass back door. He runs to her as she opens the door. They greet each other with nervous joy, without words. INT. NANCY AND LEO’S HOUSE - MA’S BEDROOM - SOON 118   118 Jack and Ma sit beside each other on the bed. MA I'm sorry, Jack. JACK That’s OK. He thinks. JACK (CONT’D) Don’t do it again. MA I promise. JACK Are you better now? MA Starting to be. She strokes his short hair then reaches into her bag and takes out his ponytail. MA (CONT’D) I’ll always keep this with me, Jack.   (MORE) (CONTINUED)",
      "characters": [],
      "action_text": "I will never, ever let it go. When Grandma brought it to me, I... I knew I could get well. You saved me. Again. They sit placidly a moment. He reaches for her shirt. JACK Can I...? MA Sorry. There's none left. Jack think for a bit, accepts the new situation. JACK OK. MA I'm not a good enough Ma. JACK But you're Ma. MA I am. She puts her arm around him. They sit in a gentle silence. JACK I’m going to play with Aaron now. He’s my friend. Ma hugs him hard before he leaves. EXT. BEACH - DAY 119   119 Ma and Jack look out to sea. JACK (V.O.) When I was four I didn't even know about the world and now me and Ma are going to live in it forever and ever till we're dead.  CONTINUED: 118   118 MA   (CONT’D)",
      "dialogue_count": 0,
      "word_count": 324
    },
    {
      "scene_number": 20,
      "slugline": "INT. NANCY AND LEO’S HOUSE - BEDROOM - DAY 120   120 Ma and Jack water their new African Violet. JACK (V.O.) This is a street in a city in a country called America on the earth that's a blue and green planet always spinning so I don't know why we don't fall off. Then there's Outer Space, and nobody knows where's heaven. INT. NANCY’S HOUSE - LOUNGE - NIGHT 120A   120A Ma and Nancy are curled up together on the sofa. Leo is there, too. The adults laugh as Jack fools around with Seamus. INT. NANCY’S CAR - DAY 121   121 Ma and Jack are parked outside a Mom & Pop Burger Joint. They eat in the car. JACK (V.O.) Ma and I have decided that because we don’t know what we like we get to try everything. EXT. SUBURBS -   NIGHT 122   122 Jack and Ma walk in the darkness through quiet suburban streets. EXT. NANCY AND LEO’S HOUSE - DAY 123   123 Ma and Jack sit in a hammock in the back yard. The weather is turning warmer. JACK We have so many things to do. Flying in an airplane. MA Definitely.   Making new friends. Pause.  (CONTINUED)",
      "characters": [
        "JACK"
      ],
      "action_text": "JACK Can we go back to Room? Ma looks concerned. JACK (CONT’D) Just for a visit. INT. POLICE CAR - DAY 124   124 A police car pulls up outside Old Nick's. Jack, Ma and Officer Parker get out. They stare at the house, still surrounded by crime-scene tape. OFFICER PARKER Follow me, guys. INT. OLD NICK'S HOUSE - LOUNGE - DAY 125   125 The car port is now sealed off and the only way out back it through the house. Jack follows Ma and Officer Parker inside. It’s tidy (except for a desk ransacked by police), anonymously banal: a leather suite, a cross-trainer, a flat- screen TV. EXT. OLD NICK'S HOUSE - BACK YARD - DAY 126   126 They step out into the back yard. Jack's gaze moves to the grey shed. A double-take: it's Room. With an enormous bulldozer beside it.  CONTINUED: 123   123 (CONTINUED) MA (CONT’D) I have to go now. Is there... anything you need? Jack looks around at the detritus of his childhood. Then he walks to the wall behind the bed and pats it. JACK Bye-bye. MA Jack - He goes around Room fast, whispering his bye-byes. MA (CONT’D) Please, Jack. He looks up at the skylight, rain running down it. He climbs onto the table. JACK Bye-bye. (to Ma) Say bye-bye to Room. Ma says it but on mute. EXT. OLD NICK'S HOUSE - BACK YARD - DAY 128   128 Crane up as Jack and Ma emerge from the shed, hand in hand, and walk away without looking back. FADE OUT.  CONTINUED: 127   127",
      "dialogue_count": 1,
      "word_count": 634
    }
  ]
}