{
  "slug": "roswell-new-mexico-101-pilot-2019",
  "title": "roswell new mexico 101 pilot",
  "genre": "drama",
  "format": "series",
  "scenes_count": 6,
  "characters_count": 0,
  "characters": [],
  "total_words": 13365,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. FOSTER HOMESTEAD RANCH - DAY -   1947  A twisted piece of wreckage marring the beautiful desert landscape. Glittering metal, curving planes of a glowing, iridescent material in otherworldly purple and blue. LIZ (V.O.) No one could explain it... An AIR FORCE COMMANDER, with a team of a dozen other uniformed men, creeps close to the wreckage -- and suddenly, the entire mass SHUDDERS. The glowing material shifts colors dramatically. The men move for their guns, terrified-- LIZ (V.O.) A month passed, rumors brewing. And then, finally, the intelligence office of the 509th Bombardment at Roswell Army Air Field confirmed to the press that they had possession of a flying saucer. EXT. NEWSSTAND - DAY -   1947  Copies of the Roswell Daily Record fly off the shelves. Its headline:   RAAF Captures Flying Saucer on Ranch in Roswell . LIZ (V.O.) DC debunked it all. They said the debris was a high-altitude weather balloon, end of story. EXT. FOSTER HOMESTEAD RANCH   - DAY -   1947  Kids shoot the hell out of green aliens painted onto targets. LIZ (V.O.) But of course, it wasn’t the end of the story. The UFO incident had finally put Roswell on the map. Proudly, their parents pay MAC for another round of ammo. EXT. ROSWELL CITY LIMITS - DAY -   1947  A sign on the edge of town proclaiming “DAIRY CAPITAL OF THE SOUTHWEST” is torn down. LIZ (V.O.) Nobody wanted to go back to the way things were before. So they leaned into it.  Roswell   Network Revisions 1/13/18 2.",
      "characters": [],
      "action_text": "Two men in cowboy hats proudly erect a new sign, shaped like a UFO, with an arrow on it. “UFO CRASH SITE: FIVE MILES.” LIZ (V.O.) Gave people passing by on their way into Texas or their way out of Mexico a reason to stop and look around. EXT. DESERT ROAD/INT. LIZ’S CAR - NIGHT -   TODAY  Find LIZ ORTECHO (27, Mexican-American, jaded -- but not as jaded as she’d like you to believe) drives in her dusty Prius, packed with everything she owns. LIZ (V.O.) 70 years later, the place is still crawling with tourists, all obsessed with green men and laser guns. Their costumes hiding the truth about the town. Which is that it’s a prison. A place you endure, and then escape. She passes the old sign for the UFO CRASH SITE. Rolls her eyes and turns up the radio, finding a 90s country song-- LIZ (V.O.) Until life deals you a bad hand, and you find yourself returning, despite all your efforts to stay far, far away. Up ahead, she sees flashing red and blue lights. Brow furrowing, she turns the music down... EXT. ROSWELL CITY LIMITS - NIGHT Liz rolls to a stop next to a sign that says “SOBRIETY CHECKPOINT.” Just beyond it, though, is an ICE van, with a HANDCUFFED MAN sitting inside as a COP slams the door closed. LIZ You’ve got to be kidding me. Another cop, with a flashlight in hand, waves cars past the checkpoint. A minivan... then a flashy sedan... then, seeing Liz’s car, he puts up a hand. Indicating for her to stop. She rolls her window down, not even looking at the officer as she launches into a rapid-fire rant. She’s turned away from the window, digging in the footwell for her purse.  Roswell   Network Revisions 1/13/18 3.  CONTINUED: LIZ (CONT’D) So you let the Joneses and the Jenners through, but you’re gonna stop the brown woman and tell me this is a DUI checkpoint? You’re just going to   happen   to ask for my passport, which I have, which will prove that I was born three miles from here, which is why I know-- OFFICER Ma’am-- But she doesn’t look up, too busy digging thro",
      "dialogue_count": 0,
      "word_count": 3066
    },
    {
      "scene_number": 2,
      "slugline": "EXT. CRASHDOWN CAFE/MAIN ST. - NIGHT - CONTINUOUS --there’s a massive power surge, ALL THE WAY DOWN THE STREET. Bulbs explode, sparks and glass showering the street. Power lines crackle. THE STREET GOES DARK. INT. CRASHDOWN CAFE - NIGHT - CONTINUOUS In the darkness, LIZ’s EYES FLY OPEN. She gasps. MAX I’m here. There’s the sound of a GLASS BOTTLE SMASHING. LIZ I was -- I was shot -- Max fumbles with his phone, turning on the light. Liz feels through the red mess on her shirt... but there’s no wound. MAX It’s just ketchup. Are you okay? She looks at the smashed glass bottle of ketchup beside her, then back to Max, gaping. He looks awful, sick -- and  terrified   -- but he touches her face, gently. Grounding her. MAX (CONT’D (CONT’D) Tell me you’re all right, Liz-- LIZ I’m... all right. Breathless, he nods, gets up, and bolts out the door, one hand on the gun in his holster. Liz turns on her own light, looks down at herself, fingers feeling through the red mess on her body. Not a scratch.   Then... suddenly... Her finger finds a bullet hole in the uniform.   Over her heart. As she looks up at where Max just took off, her face frozen in shock and confusion.   What the hell just happened.  END OF ACT ONE  Roswell   Network Revisions 1/13/18 15.",
      "characters": [],
      "action_text": "ACT TWO INT. CRASHDOWN CAFE - NIGHT Liz fumbles under the counter for a LANTERN-STYLE FLASHLIGHT, setting it up so she can look at her skin. Uninjured... but the bullet hole in her uniform is still there. Her antennae bob in her face. As she pulls them off-- FLASHBACK TO: EXT. MAIN STREET - NIGHT -   2008  Liz (17) shoves her antennae into her bag as she steps out of the diner. A group of tourists dressed as aliens crowd the sidewalk, pretending to shoot each other with plastic guns. TOURIST  Die, alien scum!  They clear her line of vision, revealing Max, waiting near his Wrangler. When he sees Liz, his troubled look falls away. EXT. DESERT ROADS - NIGHT -   2008  Max drives Liz out to the desert. Liz messes with the radio until she finds a Counting Crows song. She sings along. He grins, laughing -- not at her. With her. MAX You have a nice voice. LIZ I have a   terrible   voice. MAX I’m sorry you and Kyle broke up. LIZ I’m... not. Max’s eyes widen. Then -- the radio dies, the car breaks down. FLASH-POPS: He pops the hood. As he pulls out his phone (a slider phone, we’re in the olden days)-- LIZ (CONT’D)  Max -- She grabs his arm, pointing to the sky. Their breath catches as a shooting star rockets over them. Then -- Max takes her hand. A nervous question in his eyes... and she smiles.  Roswell   Network Revisions 1/13/18 16. FLASH-POPS: They take the top down on the jeep. They sit in the back, passing a glass bottle of soda back and forth. They share the headphones on Liz’s ipod. She’s looking at the sky. He’s looking at her, enamored, wheels turning. Then -- MAX Liz. She turns her head a bit. He looks like he’s about to say something -- then, slowly, he leans in. Touches his forehead to hers. She closes her eyes, exhales. Their lips touch. Tentative, at first, but then more passionately-- And suddenly, the CAR STARTS UP AGAIN. Headlights kicking on, radio blaring. They jump apart. Max looks embarrassed. Almost nervous. He starts to get out of the backseat. Off Liz",
      "dialogue_count": 0,
      "word_count": 2519
    },
    {
      "scene_number": 3,
      "slugline": "INT. POLICE DEPARTMENT - SHERIFF’S OFFICE - DAY Sheriff Valenti’s office is tidy. There are two photos on her desk: One of herself, Kyle, and his father on his high school graduation, one of just herself and Kyle at med school graduation. Max KNOCKS AT THE DOORFRAME. MAX Sheriff. You asked to see me? SHERIFF VALENTI (waving him in) I was just going over your report from the incident at the Crashdown last night. There are some discrepancies. MAX Discrepancies? SHERIFF VALENTI You reported one gunshot. One bullet was recovered from the scene, but forensics said there were two clear bullet trajectories from the window. MAX Right. Two gunshots. I’m sorry, I guess I was a little rattled-- SHERIFF VALENTI What’s going on with you, Evans? You let the shooter get away, you bungle your report. In eight years on this job, I’ve never once seen you   rattled . CLERK (entering) Excuse me, Sheriff? Sorry. Someone’s here to see Max. Should I tell her to wait, or... Max looks past the clerk at the door. Liz is there, waiting. SHERIFF VALENTI I’ll expect an   accurate   report to hit my desk by the end of the hour. EXT. ROSWELL MAIN STREET - DAY Liz and Max walk. She hands him a milk shake.  Roswell   Network Revisions 1/13/18 26.",
      "characters": [],
      "action_text": "LIZ E.T.’s Crush. A small thank you. MAX I didn’t do anything. The shooter missed. We were lucky. LIZ You wanna know something crazy? I could’ve sworn I was shot. I swear I remember the feeling. Not pain, but searing heat. And then the whole world fading out to nothing. MAX Liz-- LIZ Since there’s not a scratch on me, I figured, concussion. But the doctor says I don’t have one. I also don’t have a bullet in my body. Made him check for that, too. (then) Can you keep a secret? MAX You can tell me anything. LIZ My mom was mentally ill. Rosa too, I think. And I’ve always been afraid I’d end up like them. Hallucinating. Living a fantasy... Tell me that’s not happening, Max. He’s quiet. She steps close to him. Takes his hand. LIZ (CONT’D) Please, Max-- He pulls his hand away from her. Shutting her out. MAX Nothing happened, Liz. Maybe you were just... tired from the drive. It’s a clear cold shoulder. She’s pissed. Betrayed, even. LIZ Or losing my mind.  Roswell   Network Revisions 1/13/18 27.  CONTINUED: She waits for him to reassure her that’s not the case -- but he is quiet. Pissed -- a little betrayed, even -- she turns to go. But then-- MAX Liz, wait. She starts to turn back to him -- but then -- suddenly, in the street, tires squeal against pavement, and a car LURCHES AT TOP-SPEED out of a parking space, crashing into the passenger side of another car driving by. Max pulls away from Liz, dropping his milk shake and racing over to the car to help. Near Liz, pedestrians begin to gather around. There are murmurs of worry, then -- PEDESTRIAN #1 Is there anybody in that red car? PEDESTRIAN #2 It didn’t just drive itself... Back in the street, Max helps the woman out of her car. MAX Are you hurt? She shakes her head no -- but Max’s attention is caught by something over her shoulder. It’s MICHAEL, sitting in his old truck. Watching them, a look of stern warning in his eyes. Max’s jaw drops as he realizes that Michael used his powers to cause the accident -- and isn’t even t",
      "dialogue_count": 0,
      "word_count": 681
    },
    {
      "scene_number": 4,
      "slugline": "INT. MICHAEL’S TRUCK - DAY She’s on the phone with Michael. He drives at the outskirts of town, where it’s mostly dusty roads and dairy farms. MICHAEL He could’ve just healed them, then. Right there in the friggin’ street. ISOBEL If this is your way of threatening him-- MICHAEL Damn right, I was threatening him. He was gonna tell her. I could see it in his face-- ISOBEL I know you’re scared. I am too. But maybe some of your anger comes from the fact that he broke the rules for her, and not for you. MICHAEL It’s not that. ISOBEL When your foster dad messed you up, it killed Max that he couldn’t help you. He wanted to. But doctors were involved, you already had X-rays. You can’t be a medical miracle-- Michael flexes his hand. There are surgical scars on the back. The fingers are stiff, curled oddly. MICHAEL If we were smart, you and I would get a thousand miles away from Max. ISOBEL Is that what you want to do? (Off his silence--) Yeah. Well, then.   Until the men in hazmat suits show up to drag me to the Pentagon, I’m trying to do yoga breaths and remember that I love my stupid idiot of a brother. Otherwise, I might get angry, and start lighting things on fire, and mess up my freakin’ glitter glue.  Roswell   Network Revisions 1/13/18 29.",
      "characters": [],
      "action_text": "She hangs up on him pointedly. Michael rolls his eyes, as he turns into a driveway with a sign for FOSTER HOMESTEAD RANCH. EXT. FOSTER HOMESTEAD RANCH - MICHAEL’S AIRSTREAM - DAY Michael’s truck pulls up to a gleaming AIRSTREAM TRAILER parked near a barn on the ranch land. In front of the trailer is the old RANCHER (70, all belt buckle) and several uniformed military personnel, including Alex Hanes. Michael gets out of the truck. Wary as the rancher moves away from the group of military men and approaches Michael. RANCHER Came knocking this morning and you were gone. MICHAEL So you called in the cavalry? It’s my day off. RANCHER The military’s got some engineers out here. They’re acquiring the land. Need you to move your rig-- MICHAEL The air force has been gobbling up all the decent farmland. They can’t just take your ranch-- RANCHER Oh, they ain’t taking it. They’re buying it, something about a new storage facility. I’m gonna get me a house next to an ocean. He breaks off from the rancher, walking over to Alex, who is peering into the window of the airstream. Michael grabs him by the arm, pulling him away. MICHAEL Hanes. That’s private property. ALEX What the hell do you get up to in there? MICHAEL Weed, casual sex, making covert plans to overthrow the government. Quick, run and tell your daddy.  Roswell   Network Revisions 1/13/18 30.  CONTINUED: He jerks his head toward the other military guys. Alex’s father, MASTER SGT. HANES, is watching them. Michael rolls his eyes, steps up to the airstream, and slams the door. INT. ARTURO’S APARTMENT - BEDROOM - DAY In a series of quick cuts, Liz drags an old science kit out from under her bed, then sets up a microscope on her desk, and then pulls out Max’s straw from her pocket -- when her phone rings. DAD. Realizing the time, she stands -- EXT. CEMETERY - DAY Liz, who has changed into a buttoned-up dress, walks through the cemetery. She passes a LARGE GATHERING for two teen girls -- their photos displayed prominently, hal",
      "dialogue_count": 0,
      "word_count": 977
    },
    {
      "scene_number": 5,
      "slugline": "INT. EARTHLING BAR - DUSK A dingy, but crowded, cowboy bar. Pool tables, a jukebox. Liz and Maria are at the bar, but Liz is preoccupied with the other bar patrons. LINDSAY (28, overgrown mean girl) holds court in a corner. Her stares and whispers are undeniable. MARIA So anyway, I’m a psychic-slash- healer-slash-influencer. (beat) Liz. LIZ Sorry. Influencing what, exactly? MARIA Internet idiots. Honestly, I don’t know how you   live   without social media. I’d perish. She shows Liz her phone. A highly filtered photo of her surrounded by crystals. Liz reads the caption: LIZ Finding my center thanks to these rose quartz crystals and Smooth Groove Health Tea. Hashtag finding hashtag center hashtag tea hashtag skinny hashtag ad. MARIA It pays the bills so I can pursue my true passion, helping people communicate with their lost loves. (then) If you’d let me do a reading-- Liz can’t help the tiny smirk that plays across her lips. LIZ Thanks, Maria. But I should go-- MARIA You can’t, yet. I paid for a song. The jukebox flips to a ‘90s song. Ace of Base. Maria grins and tries to drag Liz to the dance floor. As Liz resists, MICHAEL ARRIVES. He greets a few people near the door, obviously a regular here. One eye on Liz and Maria.  Roswell   Network Revisions 1/13/18 33.",
      "characters": [],
      "action_text": "LIZ Stop. I don’t want to make a scene. MARIA For Lindsay and her posse of human YouTube comments? Come on. If you won’t go to the reunion tomorrow, tonight’s our chance. Let’s dance it out for old times. For Rosa. LIZ (a smile, but--) I’ll stay for another round before I have to go back to my project. But... I don’t really feel like dancing in this town. Maria sighs, but caves, signaling to the bartender. EXT. MAX’S APARTMENT - DUSK Max gets home to his apartment. It’s simple and neat, with an impressive bookshelf practically crying out for mercy under the weight of his collection of books. In the middle of the room, Izzy sits, sifting through a box of old photos. MAX I’ve had a long day, Isobel. The Sheriff’s on my case-- She looks up at him. He realizes she’s been crying. ISOBEL (wiping her eyes) I need a photo of the three of us, for the memory wall at the reunion. Max crosses to the bookshelf, taking out a journal. Tucked between the pages is a photo of Max, Michael, and Izzy in high school. Michael’s arms thrown around them. Best friends. He hands it to Isobel. She looks at it, and sighs. ISOBEL (CONT’D) Make me understand. Why was some girl you haven’t seen in a decade worth putting our lives in danger? She’s a   scientist . Do you know what a discovery like this could do for her? MAX I didn’t tell her--  Roswell   Network Revisions 1/13/18 34.  CONTINUED: ISOBEL Are you in love with her? MAX I haven’t seen her in a decade. ISOBEL You know, Nick and I have been having trouble. He thinks I’m distant. He can feel the secrets. We’ve been trying all this weird stuff in bed, trying to reconnect-- MAX Izzy-- ISOBEL My point is, you can’t be with Liz Ortecho. Because even if she finds out what you are, you and I both know that there are things you can  never   tell her. Secrets much bigger than any I’m keeping from Nick. Fall in love with someone else, Max.   Anyone   else. MAX (a long beat, then) It’s been ten years, Iz. If I could have... I would have. She reaches",
      "dialogue_count": 0,
      "word_count": 5091
    },
    {
      "scene_number": 6,
      "slugline": "INT. CRASHDOWN CAFE - DAY -   2008  Liz is seventeen again. She looks like hell, sitting in a booth, across from Arturo and HELENA, her mother. She is staring at a stack of paper. An autopsy report. No photos, nothing graphic - just a typed sheet of paper. ARTURO The toxicology report came straight from the medical examiner. LIZ Rosa was   clean . She was clean for a  year   -- she was trying -- SMASH! A brick shatters the window beside the booth, showering glass over the family. Liz looks up, horrified. Outside, THREE TEENAGERS high-five, laugh. TEEN ASSHOLE Rosa was a murderer-- TEEN ASSHOLE #2 Go back to Mexico, murderers! EXT. ROSWELL HIGH SCHOOL - NIGHT -   TODAY  Max touches the small of Liz’s back, pulling her out of the memory. MAX We don’t have to. I’ll explain it to Isobel. We can go-- Liz shakes her head. And then she reaches for his hand. INT. ROSWELL HIGH SCHOOL - GYMNASIUM - NIGHT Maria does a palm reading for a classmate, Lindsay. From the bar. LINDSAY Ugh,   seriously?  Maria looks up to see Liz enter. Murmurs begin around the room.   What’s she doing here ?   ...the hell?  LINDSAY (CONT’D) Can’t believe she’d show her face. Maria’s digs her thumb into Lindsay’s palm. Hard.  Roswell   Network Revisions 1/13/18 56.",
      "characters": [],
      "action_text": "MARIA I see you dying alone. Probably pretty soon. Of syphilis. LINDSAY Ugh. You’re a total freak, Maria. You always have been. She stands, walking away as-- INT. ROSWELL HIGH SCHOOL - GYMNASIUM - NIGHT Max leads Liz over to the punch bowl, trying to ignore the stares and whispers -- but it’s bad. She lets go of his hand. LIZ This was a stupid idea. This town-- MAX I know. Then -- the music changes. The Ace of Base song from the bar. Liz looks over to see Maria at the DJ booth. Maria shrugs at Liz. She starts to dance. Alone. Carefree. Totally weird. Despite herself, Liz laughs.   With a “to hell with it” look to Max, she straightens her shoulders, walks past the stares and the whispers, and joins her friend on the dance floor.  Fuck it.   Liz starts to dance, too. Free. Easy. Like nothing hurts. Max watches, captivated by her. Like he’s seventeen again... like nothing hurts. ISOBEL You told her. She steps up next to Max. He nods, with a small, reassuring smile. MAX She wasn’t angry, or scared. We can trust her. She’ll keep the secret. ISOBEL How much did you say, Max? (frustrated) Did you tell her what else the handprint can do? That it’s not just a gift, but it’s also a curse? MAX She didn’t need to know. (then)  Roswell   Network Revisions 1/13/18 57.  CONTINUED:  (MORE) And she can never find out about Rosa. Ever. INT. HANES HOUSE - BASEMENT - NIGHT Kyle is still looking through the autopsies. Meticulously, one after the other, he turns the pages. HANES Aliens killed all of these people. Every last one of them. Then... Kyle turns a page. He has a violent reaction. HANES (CONT’D) That’s the most recent one. Ten years ago. Rosa Ortecho. Kyle drops the pages. He looks like he’s going to be sick. It’s a full page photo of Rosa’s face. Her eyes open in a blank, dead stare, her hair matted and bloodied. And a handprint, burned over her mouth, open in a frozen scream. HANES (CONT’D) The aliens are a violent race, son. INT. ROSWELL HIGH SCHOOL - HALLWAY - NIGHT - CONTIN",
      "dialogue_count": 0,
      "word_count": 1031
    }
  ]
}