{
  "slug": "run-2020",
  "title": "run",
  "genre": "drama",
  "format": "film",
  "scenes_count": 13,
  "characters_count": 0,
  "characters": [],
  "total_words": 17757,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. PACIFIC NORTHWEST - DAWN  Light creeps onto a beautiful landscape. Pine trees and mountains travel into the distance. Fog hovers over us. The light slides onto a single road that splits the forest. Soon, it approaches a humble house tucked along the road.  INT. DAUGHTER’S BEDROOM - CONTINUOUS  The light glides in. On the WALLS: A POSTER FOR THE UNIVERSITY OF WASHINGTON along with pictures from all around the world. On the DESK: arts, crafts and electrical wiring. On the SHELVES: video games, consoles and textbooks. And by the BED- The ALARM CLOCK GOES OFF. Daughter groans. This is ritual. BEGIN DAILY LIFE SEQUENCE. CUT TO: Daughter’s process to get out of bed isn’t easy, but she makes it look like it is. She lifts herself off the bed- -and into her wheelchair, placed exactly where it should be.  INT. DAUGHTER’S BATHROOM - MORNING  Daughter COUGHS UP mucus from her lungs. Waits. Then repeats.  INT. STAIRCASE - MORNING  Daughter rolls up to the staircase. It’s a steep drop. But then she presses a button on a remote control and we reveal-  A STAIR LIFT  Daughter gets in. With the control, she guides the lift down.  CLOSE ON A FRIDGE  Inside is a busy assortment of homemade juices, fruits, veggies and non-fat yogurts. A hand reaches inside and we- CUT TO:  7.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 223
    },
    {
      "scene_number": 2,
      "slugline": "INT. KITCHEN - MORNING  Mom cooks. She chops vegetables, puts them on a food scale, scrambles eggs, adds fruits and powder into a blender and we- CUT TO: Mom and Daughter eat together, comfortable in each other’s silence. But Daughter can’t finish her food. This is normal. MOTHER Eat.  CLOSE ON AN ASTHMA INHALER  Daughter presses down and BREATHES IN the medication. We’re-  INT. GARAGE - MORNING  Mom stretches Daughter’s legs. Daughter, on a physical therapy bed, closes her left nostril with her thumb as- MOTHER Keep holding. 5-6-7-8. And exhale. Daughter exhales. Her leg twitches. Her body shakes. And then- MOTHER (CONT’D) Keep holding. 2-3-4. Now switch hands. Holding. 6-7-8. And inhale. Daughter inhales through her other nostril. Her body relaxes.  INT. DAUGHTER’S BATHROOM - MORNING  After showering, Daughter applies cream to her body. And we see for the first time: her back and arms are full of RASHES. CUT TO: Daughter opens a SMALL DISPENSER labeled “MORNING.” Inside it is A HANDFUL OF PILLS. Daughter swallows the pills with water.  INT. LIVING ROOM - MORNING  Wearing clothes that hide the rashes, Daughter waits at the dining table: a workspace of books, papers, notebooks. Then-  8.",
      "characters": [],
      "action_text": "MOTHER So morning we’ll do an hour and 30 in Physics, and just 45 in Lit since I just gave you a few long chapters. And then second half of the day, you can move to Bio. Cool?  Cool.   Mom hands Daughter the physics exam from earlier: 93%. MOTHER (CONT’D) Let’s go over what you got wrong.  CLOSE ON A LANCING NEEDLE  It pricks Daughter’s finger. A drop of blood appears. We’re-  INT. KITCHEN - AFTERNOON  Daughter touches a BLOOD METER to her finger and waits for the results on the screen. In the BG, Mom cleans the kitchen. Finally, Daughter’s blood sugar levels appear... “153 MG/DL.” DAUGHTER Just a little over. CUT TO: Mother adjusts the dose on an INSULIN PEN. Then Daughter lifts up the side of her shirt. Mother delicately injects.  INT. LIVING ROOM - AFTERNOON  Daughter studies from a textbook. Then turns a page to see-  A PHOTO OF SMILING COLLEGE STUDENTS  It’s cheesy but Daughter’s fingers run over the photo, only to linger a bit longer over the face of a cute college boy. Meanwhile, we hear TIRES CRUNCH outside and then... DING DONG. Daughter’s eyes dart to the FAMILY ROOM WINDOW, where she sees-  THE MAILMAN  returning to his van. Daughter’s eyes light up.  What if...?  Suddenly, Daughter PUSHES off the table and SPEEDS OVER to-  9.",
      "dialogue_count": 0,
      "word_count": 421
    },
    {
      "scene_number": 3,
      "slugline": "INT. FOYER - CONTINUOUS  But Mother’s already at the front door, with the MAIL in hand. MOTHER --Jesus, Chloe! Inhaler! DAUGHTER I’m fine. Daughter, breathing just a little heavier, eyes the mail with suspicion. And Mom, fake-annoyed, fans it out for her to see. MOTHER I told you: if there is even one college letter, I will close my eyes and deliver it straight to you. Daughter’s satisfied. Mother tosses the mail into a laundry hamper next to her, picks up the hamper and opens a door to-  THE BASEMENT STAIRCASE  It’s dark. The only room in the house without wheelchair access. Mom walks down with ease. Daughter watches after her. MOTHER (CONT’D) Trust me: that day could not come sooner. Get back to work.  CLOSE ON DAUGHTER VOMITING  She grips the sides of a toilet until her nausea passes. We’re-  INT. DAUGHTER’S BATHROOM - LATER  On the counter, Daughter picks up a new DISPENSER labeled “AFTERNOON.” Inside are more pills. Daughter swallows them.  EXT. GARDEN - EVENING  It’s magic hour. All the veggies, fruits and flowers glow. CUT TO: Mom steps out of the house. The garden is her happy place. CUT TO: With wine in one hand, Mom first waters the plants. And then after watering, she picks out an assortment of vegetables for-  10.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 218
    },
    {
      "scene_number": 4,
      "slugline": "INT. KITCHEN - EVENING  Mother cooks dinner. One hand stirs the garden vegetables while the other massages her lower back. She winces in pain. CUT TO: Mom and Daughter eat together. Daughter picks at her food. MOTHER Eat.  INT. PANTRY - LATER  Mother stands on her toes to grab a container on the top shelf. When she reaches in, she realizes it’s almost empty.  INT. KITCHEN - CONTINUOUS  Daughter checks her blood sugar. Mother exits the pantry and- MOTHER What are you at? DAUGHTER 121. Dangerously low... Mother reveals TWO DOVE CHOCOLATES in her hand, but then only gives ONE OF THEM to Daughter. Mother pockets the second one. MOTHER 121 is barely low. DAUGHTER Dammit. Daughter eats the chocolate slowly. She savors every bite.  CLOSE ON A TIMER  CRANKED to “30 MINUTES.” It TICKS AWAY as we WIDEN to reveal-  INT. FAMILY ROOM - EVENING  Daughter operates a clunky, old DESKTOP COMPUTER. On the internet, Daughter searches for a video on YouTube when- MOTHER When’s the last time we saw a movie?  11.",
      "characters": [],
      "action_text": "On the couch behind Daughter, Mother reads a tabloid while a massage cushion gets to work on her lower back. Meanwhile- Daughter presses play on an ELECTRIC SOLDERING TUTORIAL and- DAUGHTER I dunno.  CLOSE ON A MIRROR CABINET  which opens to reveal a BEVY OF PRESCRIPTION PILL BOTTLES. On them all: the name “CHLOE SHERMAN” and COMPLEX MEDICAL TERMS.  INT. MOM’S BATHROOM - LATER  Mother sorts through the bottles, looking for the right ones. MOTHER Liver, lungs, stomach... heart.  CLOSE ON A SOLDERING IRON  Solder melts against the heat of the iron and slides onto two flux-covered ELECTRIC WIRES. Just like in the video. We’re-  INT. DAUGHTER’S BEDROOM - NIGHT  Daughter puts down the iron. She’s good at this. She tucks the wires into a small electric board and places the board inside-  A HOMEMADE 3-D PRINTER  Daughter flips a switch on a control panel and looks at the printer. It doesn’t turn on. She tries again. Nothing.   Bummer.  MOTHER (O.S.) What’s wrong with it? Mother is standing behind Daughter. Now with a glass of water. DAUGHTER I dunno. The wiring, maybe? If I had an iPhone, I could probably just tell you, but you know... MOTHER You’ll figure it out. Mother hands her the CUP OF PILLS. Still focused on her 3-D printer, Daughter swallows the pills with the glass of water.  12. DAUGHTER Night, Mom. Daughter returns to her work. Mother kisses her on the cheek. MOTHER Night, baby.  EXT. HOUSE - NIGHT  From the driveway, we can see Mom close Daughter’s door and leave the room. Daughter keeps working. Late into the night. END DAILY LIFE SEQUENCE.  CLOSE ON A DIAGRAM OF A HUMAN HEART  A PEN JOTS NOTES around the diagram. We’re-  INT. LIVING ROOM - AFTERNOON  Daughter studies from a Biology textbook. Her head bobs to the HIP HOP MUSIC PLAYING from her headphones. Suddenly- A STREAK OF LIGHT sweeps across the room. Daughter notices, takes off her headphones... and hears TIRES CRUNCH outside.  What if...?  Daughter pauses her work and turns to the WINDOW, only to see-  ",
      "dialogue_count": 0,
      "word_count": 802
    },
    {
      "scene_number": 5,
      "slugline": "INT. KITCHEN - EVENING  Mom prepares dinner. Around her, all the signs of a laborious meal. Mother plates the lasagna, adds on roasted veggies and- MOTHER It looks like a lot, but it’s not. She brings it to Daughter, who’s watching closely. We can tell Daughter’s now carrying a heavy weight on her shoulders. Mom sits down and dives into her food. But Daughter can only pick at it, debating whether or not to speak up until finally- DAUGHTER Am I a burden? MOTHER What? DAUGHTER I don’t do as much as I can around the house. Right? I could do more. MOTHER Um. What do you want to do? DAUGHTER I dunno. Something that helps you. MOTHER  Something that helps me.   Like what? DAUGHTER Cooking. That takes you a bunch of time. We could split days. Or you take mornings and I’ll do evenings. MOTHER Okay. And what would you make? DAUGHTER Anything. I could start with like simple recipes. I know puttanesca. And I’d only get better with time. MOTHER  Why?  DAUGHTER Because... You do everything for me.   (MORE)  15.",
      "characters": [],
      "action_text": "You teach me, you drive me, you coach me, you take care of hospital stuff for me, you clean after me, you cook lasagna   for me... And I do the dishes. That’s not fair. MOTHER (beat) You’re right, you really do take advantage, don’t you? Daughter’s eyes instantly well up. Mother is taken aback. MOTHER (CONT’D) Hey, I’m kidding. I’m obviously kidding. What is going on? Fighting back tears, Daughter thinks about what to say until- DAUGHTER ...Are you okay, Mom? MOTHER Why would I not be okay? DAUGHTER Because most parents don’t need to do all that for their kids. Beat. In a single graceful moment, Mom enters “parent-mode.” She grabs a forkful of lasagna and feeds it to Daughter. MOTHER It’s good, right? Daughter nods. MOTHER (CONT’D) Wanna know why? Because I put time into it. I put time into it for the same reason I put time into teaching you and coaching you and... all those other words you used. I’m your mom. It’s my job to take care of you when you need me,  and you need me . But that’s okay. (beat) How many times do I tell you about Grandma? When I needed her, Grandma gave up everything to provide for me because I was her daughter. And one day, you’re gonna do the same for your girl or boy... or girl. But that’s just being a parent. DAUGHTER (CONT'D)  16. Mother wipes away Daughter’s tears and pushes her hair back. MOTHER (CONT’D) Of course I’m okay. I’m healthy, I’m happy, and I have you. Got it? (beat) Plus, what would I do with the extra time, huh? Everyone in this county has the IQ of a turtle. Daughter can’t help but laugh. Mom joins her. They’re a team.  INT. DAUGHTER’S BEDROOM - NIGHT  Daughter turns off the lights and lifts herself into bed when- MOTHER (O.S.) By the way! Dr. Qasabian had me stop by her office today. Apparently, the company that makes  Zocor   went under. DAUGHTER Oh. Mother enters the room with the cup of Daughter’s pills and- MOTHER Crazy, right? Anyway, she wrote you a new prescription to replace it... Mother sits. She pulls out a SING",
      "dialogue_count": 0,
      "word_count": 2535
    },
    {
      "scene_number": 6,
      "slugline": "INT. KITCHEN - CONTINUOUS  Daughter watches as Mom re-enters and then stops directly above her. Beat. Mom puts the first item on the table. It’s-  A MEDICAL MANUAL  Titled “MANUAL OF HUMAN & VETERINARY DIAGNOSIS AND THERAPY,” it’s a legitimate reference, filled with PHOTOS OF MEDICINE. But then, Daughter sees a BOOKMARK inside. MOTHER It was on your search history. The CAMERA TRACES Daughter’s hands as she opens the book to-  A MEDICAL DEFINITION OF DIGOXIN  Daughter’s eyes widen. But as she TRACES OVER THE DETAILED DESCRIPTION OF THE DRUG, it becomes clear to everyone that: MOTHER (CONT’D) It’s just heart medication, honey. Beat. Daughter starts to turn the page, but Mother’s fingers gently take her hand. Daughter looks up. Mom is now crying. MOTHER (CONT’D) A couple days ago, you said you saw a pill bottle with my name on it and I told you you were wrong. Daughter sits up in her chair. Whatever Mother wants to tell Daughter, she’s struggling with it. But then, after some time- MOTHER (CONT’D) You weren’t wrong, baby. My name was on the bottle. I printed a new label and stuck it over the other. Beat. Daughter processes Mom’s admission of guilt. And then- DAUGHTER Why? Mom thinks and then slides the second item from the basement to Daughter. It’s a SHOE BOX. And inside the shoe box are-  PILES OF ENVELOPES  Electric bills, internet bills and DOZENS OF MEDICAL INVOICES. Every kind of bill is here, but they all share the same trait:  27.",
      "characters": [],
      "action_text": "They’re stamped with the words “LATE,” “URGENT” or “PAST DUE.” Daughter understands at the same rate it takes the audience... MOTHER It used to be every class needed me a few times a year. Spanish, I’d sub at least twice a month. But it’s changed. A lot. And I don’t know why. Yesterday was the first time I got called in this semester. Mother gets up. Daughter doesn’t take her eyes off her while Mom tries to busy herself in the kitchen. MOTHER (CONT’D) I know this is the worst thing a mother could do: tell their own child about their financial problems and expect them to share in the worry. But I’m only doing it because my trust with you is at stake right now. And between the two of those, I care way more about your trust in me than some stupid money problem that will go away. Mom can’t stop the tears. She pauses whatever task she’s in. MOTHER (CONT’D) Your pills are on my insurance. (beat) Emily Vitale practices cardiology in Tri-State County. I’ve told you about her before, she’s an angel. I told Em I couldn’t afford those fucked-up, jacked-up pharmaceutical prices that your insurance companies keep raising. So she prescribes me   whatever you need. I pay a 10th of the price... and then rush here by 4 to make sure you never see those stamps on the mail. Mom sits back down. And then finally looks in Daughter’s eyes. MOTHER (CONT’D) If Dad was alive, he would’ve taken care of both of us. I wish you got to meet him, baby, I do. But it’s just me now. And all I care about is giving you everything you need. Daughter’s never seen Mom like this. She fights back tears.  28. DAUGHTER You give me what I need. I need you. Mom doesn’t respond. Beat. Suddenly, Daughter turns resolute. DAUGHTER (CONT’D) Do you want me to stay? Mother looks up at Daughter. She doesn’t understand. So then- DAUGHTER (CONT’D) Next year. Should I stay home instead? To work. I can. I want to. Immediately, Mom smacks Daughter on the arm. She’s angry, or at least tries to fake it: it’s that motherly, lov",
      "dialogue_count": 0,
      "word_count": 951
    },
    {
      "scene_number": 7,
      "slugline": "INT. DAUGHTER’S BEDROOM - DAY  Daughter rummages through her arts supplies until she finds-  AN X-ACTO KNIFE  Daughter grips the knife tightly, turns to the booklet and- Cleanly slices a page off. Daughter flips the UW booklet to the previous page, wheels backwards for a better vantage point, and stares intently at-  THE NEARLY-INVISIBLE TEAR NOW IN THE BOOKLET BINDING.  Her eyes widen. The tear looks the same as the medical manual. And suddenly, we understand what Daughter’s been wondering this whole time:   Did Mom rip a page from the medical manual?  Her mind working at warp speed, Daughter studies the tear. But as she does, her questions are replaced by something else... An idea.  INT. KITCHEN - EVENING  It’s another beautiful evening. And Mom’s in a great mood. Mom UNCORKS a bottle of pinot, POURS herself a glass and steps into the GARDEN. But right as the sliding door closes-  INT. UPSTAIRS - CONTINUOUS  Daughter clocks it from the BANISTER. Beat. Immediately, she turns to face Mom’s bedroom door. Daughter takes a breath and-  INT. MOTHER’S BEDROOM - CONTINUOUS  The door CREAKS OPEN. Daughter wheels inside. But instead of heading to the bathroom like yesterday, Daughter wheels to-  THE CORDED TELEPHONE  on Mom’s NIGHT-STAND. Just as she arrives, Daughter looks- OUTSIDE THE WINDOW: Mother’s already watering the plants, wine in one hand. The coast is clear. If only for the moment. Daughter’s nervous. She reaches into her pocket and pulls out-  31.",
      "characters": [],
      "action_text": "THE SINGLE-STRIPED, GREEN PILL  Daughter studies it. The nerves go away. And her face hardens. Then Daughter grabs the phone and dials a number slowly. As she does, we start to notice the wall around her is full of-  FRAMED PHOTOS  Our attention is drawn to two of them. The first was taken in-  THE 1980s  In it, a 7-year-old Mother climbs on the shoulders of her own mom.   Happy times.   Then we notice the second photo, taken in-  THE 1990s  In it, a teenage Mother is kissing a man.   Even happier.   Then-  VOICE OF PHARMACY --Pasco Pharmacy, Kathy speaking.  DAUGHTER Hi. I was wondering if you could look up a medication for me. Its called “Digoxin.” It’s spelled D--  VOICE OF PHARMACY --Connie? Is that you? Just recognized the number you’re--  Daughter hangs up. OUTSIDE THE WINDOW: Mother is still watering plants. But then Daughter gets an idea. Suddenly, she SLAMS ON THREE DIGITS and-  VOICE OF 411 ROBOT Thank you for calling 411, your phone’s directory assistance. To begin, say a city and state, like Atlanta, Georgia or Derry, Maine.  DAUGHTER  Um... Seattle, Washington? VOICE OF 411 ROBOT Did you say Seattle, Washington? If you did, say “yes”. If you didn’t--  DAUGHTER --Yes.   VOICE OF 411 --say “no.”  32. VOICE OF 411 ROBOT I’m sorry. I didn’t get that.  DAUGHTER Yes. OUTSIDE THE WINDOW:   Mom moves to another part of the garden.  VOICE OF 411 ROBOT Okay. Now say the name of the business you want. If you don’t know the name of the business, tell me the type of business you’re looking for, like “Pizza or--”  DAUGHTER Pharmacy.  VOICE OF 411 ROBOT Okay. Here are some choices. When you hear the one you want, repeat the number of the listing. Number 1: Evercreek Pharmacy. Number 2--  DAUGHTER Number 1.  VOICE OF 411 ROBOT Evercreek Pharmacy. 2180 SW Barton Street, Seattle, Washington 98126. If that’s correct, say “connect me.”  DAUGHTER Connect me.  VOICE OF 411 ROBOT Okay, I’ll connect you. Success . Daughter may actually pull this off. But then-  VOICE OF 411 RO",
      "dialogue_count": 0,
      "word_count": 1452
    },
    {
      "scene_number": 8,
      "slugline": "EXT. PACIFIC NORTHWEST - DAY  Mom’s car glides through windy roads as it leaves the forest.  INT. CAR - DAY  Daughter appears calm. But her darting eyes betray her. In the BG, Mom tells a funny story. But to us, it’s WHITE NOISE.  EXT. PASCO, WASHINGTON - DAY  Mother’s car turns onto MAIN STREET - a half-mile long and full of retail stores but unmistakably “Small Town, USA.” CUT TO: The car parks by a MOVIE THEATER MULTIPLEX. But while Mother sets up the wheelchair and helps Daughter out of the car, Daughter’s eyes are instead locked-  ACROSS THE STREET  But whether it’s a shop on Main Street or a local walking by, we can’t make out precisely what she’s looking at. And then- Mom and Daughter, both playful and excited, enter the theater.  INT. MOVIE THEATER - DAY (SERIES OF SHOTS)  --Mother purchases two tickets at the GLASS. Daughter waits. --The ticket vendor RIPS THE TICKETS and lets them inside. --At the CONCESSIONS STAND, Daughter eyes all the options closely. When Mother asks, she points to the item she wants. --Now holding POPCORN and a LARGE WATER, Daughter wheels to the ACCESSIBLE SECTION of the theater. Mom sits next to her. --Daughter observes Mother.   Does Mom suspect something?   Beat.  Not at all.   The lights dim and the FIRST TRAILER BEGINS. CUT TO:  INT. MOVIE THEATER - LATER  The audience GASPS. ON SCREEN: a tense and climactic scene.  38.",
      "characters": [],
      "action_text": "At the same time, Daughter takes a sip from her LARGE WATER, only to SUCK UP AIR. The bottle is empty. Beat. Daughter looks up at Mom, who’s fully invested in the movie.  It’s go-time.   She takes a deep breath, then leans in and- DAUGHTER I need to pee. Mother shoots Daughter a look.   Right now?   Daughter shows Mom her EMPTY WATER BOTTLE.   Right now.  DAUGHTER (CONT’D) Just tell me what I miss. MOTHER No. Daughter chuckles and wheels away. Mother watches until she disappears. Then returns to the movie. She trusts Daughter.  INT. MOVIE THEATER HALLWAYS - CONTINUOUS  Daughter exits the screening and wheels with purpose towards the bathroom. But instead of slowing down as she gets close... Daughter wheels right past it.  EXT. PASCO, WASHINGTON - DAY  Daughter exits the movie theater. She pulls out an INHALER, TAKES A DEEP BREATH OF MEDICATION and then orients herself to-  THE STREET IN FRONT OF HER  where nestled between a veterinary clinic and a shoe store is- A pharmacy. CUT TO: At the STREET CROSSING, Daughter presses the signal and waits. Waits. A pedestrian smiles at her. She smiles back. CUT TO: The signal changes and Daughter speeds across the STREET. She keeps an eye on the THEATER DOORS. All clear.   For the moment.  39.",
      "dialogue_count": 0,
      "word_count": 455
    },
    {
      "scene_number": 9,
      "slugline": "INT. PASCO DRUG AND PHARMACY - DAY  It’s a normal day at the local pharmacy. Nothing’s going on. But then Daughter STORMS inside. She ZIPS BY the check-out, ZOOMS THROUGH an aisle and TURNS a corner, only to arrive at-  THE BACK OF A LONG PHARMACY LINE  A single PHARMACIST finishes up with an older customer at the front. Daughter checks the clock.   She doesn’t have much time.  Daughter thinks. Suddenly, she looks up with “puppy eyes” and- DAUGHTER Excuse me, sir? I’m very sorry to bother you, but I was hoping you’d be so kind and let me cut in line? PERSON IN LINE What, no. I’ve been waiting here-- (turns, sees Daughter) --Oh of course. Go ahead. DAUGHTER Thank you. Daughter wheels past the PERSON IN LINE. And then past all the people ahead of that person, too. They let her through. DAUGHTER (CONT’D) Sorry, everyone. Cutting through. I’m paralyzed. Feel bad for me. Just as the older customer finishes, Daughter ROLLS UP to the COUNTER between customer and pharmacist. Daughter’s PANTING. DAUGHTER (CONT’D) Hey, Mrs. Bates. How’s it going? PHARMACIST Chloe, my goodness, are you OK? DAUGHTER Yeah, totally fine! Actually I   am  dealing with a tiny emergency right now and I could use your help. PHARMACIST Of course, honey. What do you-- Daughter SLAMS HER HANDFUL OF PILLS right onto the pharmacy counter. Then she picks up the GREEN, SINGLE-STRIPED PILL and-  40.",
      "characters": [],
      "action_text": "DAUGHTER What’s the name of this pill? PHARMACIST What? DAUGHTER My mom came here last week and picked up   these pills.   I need to know the name of the medication. PHARMACIST That’s all you want to know. DAUGHTER Yes. The Pharmacist grabs the green pill and studies it. Beat. Then she   moves to her computer and starts TYPING away as- PHARMACIST Next time, you wait your turn. OK? DAUGHTER Yes, Mrs. Bates. PHARMACIST This shouldn’t be too hard though. As long as they’re under your name. DAUGHTER They’re under my mom’s. Beat. The Pharmacist stops typing. She looks up at Daughter. PHARMACIST I’m sorry, Chloe. If they’re under Connie’s name, I can’t help you. DAUGHTER Why? PHARMACIST Because it’s confidential, meaning-- DAUGHTER --I know what confidential means, Mrs. Bates! Daughter looks back at the PHARMACY DOORS: still no Mother.  41. PHARMACIST I’m confused though, sweetheart. Tell me again: Why can’t you just ask your Mom about these pills? Daughter’s eyes scan the store, desperately searching for an answer before Mom arrives. But then finally, she sees it.  A FRAMED, FAMILY PHOTO  sits next to the computer. Daughter squints. In the photo: The Pharmacist and her family hold up a sign: “WE ESCAPED!” Beat. Daughter’s eyes widen. The photo’s from an Escape Room. PHARMACIST (CONT’D) Honey?   DAUGHTER It’s a game. PHARMACIST A game. What kind of game? DAUGHTER A scavenger hunt. PHARMACIST Really. DAUGHTER Yes. Yes. 100% yes. Mom and I love scavenger hunts. So many memories scavenging and hunting and... Anyway, the next clue is about the medication Mom takes. I don’t think she expected me to come here which is why I need you to help me win. Beat. The Pharmacist studies Daughter. And after a long time- PHARMACIST I love games. (beat) But confidential is confidential. Daughter’s face falls. She’s not going to figure this out. PHARMACIST (CONT’D) I’m sorry, honey. I want to help you, but I can’t if it’s all under-- The Pharmacist stops. She notices something on her compute",
      "dialogue_count": 0,
      "word_count": 1097
    },
    {
      "scene_number": 10,
      "slugline": "INT. MOM’S SHOWER - LATER  Steam envelops Mother’s body as she takes a shower. But then Mom turns. And suddenly, we notice her back and buttocks... Are full of violent, aged scars. Mother’s eyes dart all over as her mind races at hyper-speed. MOTHER (PRE-LAP)  Hey Kathy, it’s me. Do you have a sec? Listen, I wanted to apologize for that whole scene today at the pharmacy, I really didn’t mean to...  INT. KITCHEN - DAY  Mom has her hands to her ear, walking around the kitchen as- MOTHER  Thank you... It’s just that her doctor switched her to these new pills a few days ago and it’s totally messed with her head... I appreciate that, Kathy. I’m trying.  (pause)  Anyway, I know she asked you a few questions about another medication and I was just hoping you could remind her there’s no way I would ever give her drugs meant for anim--  (pause)  I was wondering if you could give her a call and assure her that even if she was taking those pills...  (pause)  I just need you to tell her that...  Mother drops her hands. She was never holding a phone. Then- MOTHER (CONT’D) (CONT’D)  Hey Kathy, it’s me. You have a sec?  CLOSE ON A BATHROOM DRAWER  Hands reach into the back and pull out a PACK OF CIGARETTES.  INT. MOM’S BATHROOM - LATER  Mom smokes by an open window. She’s deep in thought. Then-  46.",
      "characters": [],
      "action_text": "CLOSE ON A COMPUTER SCREEN  WORDS ARE TYPED: “ Dr. Qasabian, I’m outraged. I just found out the medicine you were prescribing is meant for dogs?!”  The cursor stops typing. And then we widen to reveal we’re-  INT. DARK, UNDEFINED SPACE  Mother sits in front of a computer.   This isn’t going to work.  CLOSE ON A WINE GLASS  PINOT NOIR IS POURED halfway. And then doubled to the brim.  EXT. GARDEN - AFTERNOON  Wine in one hand, Mom waters the plants. Her mind is still racing. She thinks and thinks and thinks but then finally- Mother breaks down. It’s long and heartbreaking and somehow, it even makes us question how evil Mother really is... if only for a moment. Because suddenly, Mom stops crying. Spotting something in front of her, Mom cocks her head. But we’re confused, because the only things in front of her are-  PLANTS  Mother is staring now. An idea forms. And suddenly, Mom doesn’t seem lost anymore. Instead, she becomes resolute...  Scary resolute.  CLOSE ON A PAIR OF EYES  They’re shut. But then they twitch. Then flicker. And then-  INT. DAUGHTER’S BEDROOM  Daughter opens her eyes. It’s dark. And everything is blurry. Still in bed, Daughter immediately starts to get up when- Her hand KNOCKS OVER A NEW CUP OF PILLS from the BED-STAND.  47. Daughter realizes how groggy she is. She tries to focus her vision. Eventually, she does. Daughter looks around the room. On her BED-STAND are SPILLED PILLS, a GLASS OF WATER and a PLASTIC-WRAPPED PLATE OF FOOD. And past them, Daughter sees-  HER BEDROOM DOOR  She slowly lifts herself off her bed, gets in her WHEELCHAIR, heads to the DOOR and turns the knob, only to discover that- It’s locked. DAUGHTER ...Mom, are you there? Mom? It’s silent. Daughter wiggles the knob again. Nothing. Beat. DAUGHTER (CONT’D) I... I just want to talk. Can we do that? I’m sure there’s a good explanation for everything. Can we talk and you can tell me? Please? No response. It’s dead quiet. Beat. And then, fear crosses over Daughter’s face. And sudd",
      "dialogue_count": 0,
      "word_count": 1409
    },
    {
      "scene_number": 11,
      "slugline": "INT. MOM’S BEDROOM - CONTINUOUS  Daughter lands softly on Mother’s bed. But just as she does- DAUGHTER GASPS. But unlike the last few times, this one sounds like WHEEZING. DAUGHTER GASPS AGAIN. THE WHEEZING GETS WORSE. And we realize- This is an asthma attack. STRUGGLING FOR OXYGEN, Daughter reaches into her pocket, only to realize that her inhaler isn’t there. She panics. And then- GASPING FOR AIR AND WHEEZING LOUDER BY THE SECOND, Daughter slides onto THE FLOOR and CRAWLS AWAY, too busy to notice that-  THE TELEPHONE CORD  has been cut-clean by scissors.  INT. UPSTAIRS - EVENING  HER AIRWAYS CLOSING, Daughter crawls to her door, removes the VERTICAL SECURITY BAR and turns the knob again. And this time-  INT. DAUGHTER’S BEDROOM - CONTINUOUS  The door opens. Daughter crawls to her wheelchair and gets on. SECONDS AWAY FROM FAINTING, she wheels to the BED-STAND, grabs her INHALER and takes the DEEPEST INHALE OF HER ENTIRE LIFE. DAUGHTER Mother fucker.  INT. UPSTAIRS - MOMENTS LATER  Her asthma managed, Daughter wheels out of her room and looks-  AT THE FRONT DOOR  Beyond the front door is freedom. But right in front of her is-  THE STAIR LIFT, ALREADY IN PLACE  Daughter wheels inside and presses the control, only to discover the lift doesn’t move. And it’s blocking the stairs. Then Daughter peers over the LIFT GATE, only to discover that the lift’s breaker is now SEVERED. And the lift is stuck .  52.",
      "characters": [],
      "action_text": "Daughter thinks. Thinks.   Is there a way out of this?   And then- Just one.   Over the lift gate.  Daughter gets out of her wheelchair and slowly raises it over the LIFT GATE. She looks at the STAIRCASE BELOW and then- Gently sets her wheelchair onto the STAIRS, only to watch as-  THE WHEELCHAIR  INSTEAD FLIES DOWN AT FULL SPEED, BOUNCING VIOLENTLY along the rails and walls and finally CRASHING ON THE GROUND FLOOR. Now Daughter’s turn. Daughter carries herself onto the LIFT GATE. Hands straining to support her, she sits on THE LEDGE and looks at THE DROP. It’s steep. Daughter takes a deep breath and summons all the strength she has left (very little) to carefully guide her body off the lift and gently onto the stairs. But just before she lands- Her arms give out. Daughter’s hands SLIP OFF the ledge. Her body follows suit. SHE SLAMS VIOLENTLY ONTO THE STEPS AND TUMBLES PAINFULLY- ALL THE WAY DOWN THE STAIRS. SCREAMING, Daughter hits the floor in a CONTORTED POSITION.  INT. FRONT DOOR - CONTINUOUS  In pain, Daughter stares at the ceiling.   Is this the end? No.  Daughter tries to lift herself. But her arms give out. She tries again. But her arms give out. She tries even harder.  53. But her arms give out. In pain, Daughter stares at the ceiling.   Is this the end? Maybe.  Daughter looks at her arms: bleeding. She looks at her torso: bruised. She looks at her legs: cut. She looks at her feet--  What the...?  Daughter’s looking at her feet, but seeing something else. Suddenly, Daughter’s face begins to morph. From pain, it becomes curiosity. From curiosity, it becomes realization. As Daughter’s eyes widen, the CAMERA GLIDES DOWN to reveal what Daughter is specifically focusing on. She’s staring at-  HER TOES  And after staring at them for what seems like an eternity- HER BIG TOE MOVES. At first, Daughter just stares in disbelief. But then... she laughs. Then she cries. Then she laughs. Then she cries. Then-  DAUGHTER, REVITALIZED  summons that last, necessary piece of ",
      "dialogue_count": 0,
      "word_count": 2342
    },
    {
      "scene_number": 12,
      "slugline": "INT. BASEMENT - CONTINUOUS  Daughter catches her breath. Around her is the destruction of her doing. But she couldn’t care less. At least not until she surveys the damage and sees-  A PHOTO BOX  covered in the mess, NEAR THE WALLS. On the side of the box is a HANDWRITTEN-LABEL. Daughter squints and reads the words:  “PERSONAL, 1975-”  Her rage quieted, Daughter grips her wheels and pushes, only to discover that her wheelchair doesn’t move anymore. Beat. Daughter tries again. Still, nothing. Confused, she reaches behind the wheelchair and feels around, only to land right on-  A METAL HOOK  Daughter gasps. And right then, we CUT TO A WIDE and reveal-  A CHAIN  running from the back of the wheelchair to a PIPE IN THE WALL. Daughter processes this, but very little about her Mother shocks her anymore. Instead, she looks back at the photo box- And gets out of her wheelchair. Daughter WINCES as she crawls to the WALL. She grabs the BOX from the pile and opens it. We can all feel its importance.  STUFFED INSIDE THE BOX  are OLD DOCUMENTS, PHOTOS and MEMORABILIA. Daughter sifts through the pile, only stopping at the items that grab her attention. The first object that does that is-  A NEWS PHOTO FROM THE 1980s  In it, a 7-YEAR-OLD MOTHER climbs on the shoulders of her own mom.   Happy times.   We recognize the photo from Mom’s bedroom. But then, Daughter sees the text around the photo. It’s from-  AN OLD NEWSPAPER ARTICLE  GILROY WOMAN COMMITS SUICIDE IN FRONT OF DAUGHTER Neighbors suspect years of child abuse.  63.",
      "characters": [],
      "action_text": "Daughter reads the headline twice. Her mind races. But before she comes to conclusions, she puts the article aside to reveal-  A FOSTER CARE APPLICATION  In the application photo, a 10-YEAR-OLD MOM appears hopeless. Beat. Daughter keeps sifting through. But then she stumbles on-  LOVE LETTERS AND ROMANTIC TRINKETS  And among this pile is a PHOTO FROM THE 1990s. We recognize this from earlier, too. In it, a TEENAGE MOM is kissing a man. Mom’s beaming. Daughter sifts through these happy times until she lands on-  AN ENVELOPE STAMPED WITH “RETURN TO SENDER”  Its recipient is “Rodney Lee” and we can immediately sense that whatever’s inside the envelope isn’t happy anymore. It’s-  A HAND-WRITTEN LETTER  Daughter reads the letter as the CAMERA reveals key phrases:  “...been trying to call... I don’t understand why you left... I was pregnant with our kid... I need somebody...”   and then-  “Come back.”  Daughter reads those two words over and over, until finally- She spots one last item inside the envelope. Beat. Daughter picks it up to find... A PHOTO FROM THE 2000s. And in it...  Oh my God.  ...DAUGHTER IS RUNNING.  Unable to look away from her 2-year-old self, Daughter breaks down. Like she’s mourning every memory she never got to have. Until suddenly, we hear-  THE BASEMENT DOOR  An OMINOUS FIGURE descends. Holding A SHOPPING BAG in one hand and a BOX OF DOVE CHOCOLATES in the other, we reveal-  MOTHER  But she doesn’t look ominous at all... She looks heartbroken.  64. MOTHER (re: mess) Oh my god, Chloe. What happened? But then Mom’s eyes move from the MESS to the FAKE LETTER to-  THE NOW-EMPTY PHOTO BOX  Mother freezes. Beat. She stares at Daughter for an eternity. Daughter stares back. No one says a word for the longest time. But then, something clicks in Daughter’s mind and suddenly... DAUGHTER No one loved you. Mom’s quiet. But then she sets down the CHOCOLATES and BAG (HOME DEPOT) and moves to Daughter to explain, only for-  DAUGHTER  to scurry to the WALL. She’s ",
      "dialogue_count": 0,
      "word_count": 3654
    },
    {
      "scene_number": 13,
      "slugline": "INT. HOSPITAL HALLWAY - MOMENTS LATER  Mom pushes Daughter, now in a wheelchair and under a blanket, away from ICU crowds. DAUGHTER’S LUNGS ARE WORKING OVERDRIVE. Unable to speak, Daughter tries everything to gain attention. She shakes her head around, moves her hands under the blanket, and even wiggles her feet below. But no one sees. Eventually- The blanket falls off her shoulders, revealing IV TUBES TIED AROUND HER ARMS. Mom gently tucks the blanket back over her. Mom’s getting away with this. But then just as she sees the ELEVATOR FOYER ahead of them, Mother instead takes a sharp turn and pushes Daughter into-  INT. HOSPITAL ALCOVE - CONTINUOUS  Mom puts the brakes on Daughter’s wheelchair. And then waits. ALARMS STILL BLARING, Mom bites her lip. She’s as tense as ever. Daughter wonders what’s happening. HER BREATHING CALMS. And then the alarms stop. Immediately, Mother undoes the brakes. She pushes Daughter to-  INT. ELEVATOR FOYER - CONTINUOUS  Mother jams on the “DOWN” button. She waits impatiently. Finally, an ELEVATOR ARRIVES. Mom pushes Daughter inside.  She’s actually getting away with this.  INT. ELEVATOR - CONTINUOUS  It’s just the two of them. Mom stares at the FLOOR DISPLAY. Daughter stares at the doors. It’s eerily SILENT. But then- MOTHER It’s been stuck in my head all night. What you said. (beat) I know I’ve scared you. I know I’ve lied to you. And I know I’ve hurt you. But I promise I’ll spend every minute of our lives making sure that you never feel that way again. You were right, I do need you. (MORE)  80.",
      "characters": [],
      "action_text": "And deep down, you know the same goes for you. You need me. You’ve always needed me. I’m your mom. The elevator stops before the lobby. The doors open to reveal-  A NEW FAMILY  A Young Dad enters with a Young Mom, who sits in a wheelchair too. The Young Mom holds her newborn baby. They dote over it. Mom grips Daughter’s wheelchair. Daughter can’t help but cry.  INT. HOSPITAL ROOM - CONTINUOUS  The scene outside the hospital room returns to order. A frustrated Nurse re-enters Daughter’s hospital room and- NURSE Sorry about that, false alarm. Either someone pranked us or-- The Nurse freezes when she notices that Daughter is missing. But then she sees the UNPLUGGED BREATHING TUBE and DANGLING WIRES.   That’s not normal.   Immediately, she grabs her HANDSET. NURSE (CONT’D) Did anyone transfer the patient in 603-West during the alarm?  VOICE OF STAFF Don’t think so. The only evacs were in the east wing.  NURSE Then why is her bed-- The Nurse stops mid-sentence. She sees it. Right on the bed.  DAUGHTER’S DRAWING  The Nurse picks it up, looks at it and slowly reads out loud. NURSE (CONT’D) Mom...  THE NURSE  thinks. And thinks. And thinks. And then soon, we watch her face go from confusion to complete understanding.   Holy fuck.  MOTHER (CONT'D)  81. NURSE (CONT’D)  Inform the hospital we have a Code Purple. I repeat: we have an active Code Purple for Chloe Sherman!  INT. HOSPITAL LOBBY - MORNING  DING. At the far end of the lobby, the elevator opens and-  MOTHER  PUSHES Daughter out at full speed, her manic eyes locked on-  THE FRONT DOORS  But despite her mania, no one in the lobby notices. Meanwhile-  DAUGHTER  is now convinced Mom’s going to get away with this. But then-  PA ANNOUNCEMENT Connie Sherman, report to security immediately. Connie and Chloe Sherman to security immediately.  DAUGHTER’S EYES  light up. She starts shaking again, vying for attention, but-  MOTHER  pushes Daughter faster. They’re almost at the exit. But now-  PEOPLE IN THE LOBBY  start to notice ",
      "dialogue_count": 0,
      "word_count": 2198
    }
  ]
}