{
  "slug": "rush-2013",
  "title": "rush",
  "genre": "horror",
  "format": "film",
  "scenes_count": 21,
  "characters_count": 2,
  "characters": [
    "STANLEY",
    "JAMES"
  ],
  "total_words": 21778,
  "total_dialogue": 2,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. CLOUDY SKY - GERMANY - DAY 1   1  Dark clouds passing overhead.  The bad weather that has hovered over the Eifel mountains, (in  Germany), the past three days is on it’s way out..  AN EYE FLICKERS - WIDE OPEN - STARING INTENTLY 2   2  A pupil dilates and contracts in the light. The eye stares.  Blinks. Thinks. Making evaluations..  EXT. CLOUDY SKY - GERMANY - DAY 3   3  The first rays of sunshine break through. The voices of  international TV commentators in different languages.  COMMENTATORS  ...in places the track is still  dangerously wet, but following a  drivers meeting the decision has been  taken. The race is going ahead...  INT. FERRARI - DAY 4   4  The eye belongs to a 27 year old Formula 1 RACING DRIVER  wearing a fireproof balaclava...  Highly intelligent, he also happens to be World Champion. His  name is painted on the side of his Ferrari. NIKI LAUDA.  NIKI (V/O)  My grandfather always said history is  cruel and reductive and no matter how  long we live, or how much we achieve -  we are remembered for very little. So  make sure it's the right things.  NIKI stares up at the clouds. His eyelids flicker. Thinking.  Agonizing. Wrestling with an all important decision...  Is it going to carry on raining? Or become dry? Should he be  using slicks or wets?  EXT. STARTING GRID - DAY 5   5  We widen to find ourselves on the starting grid of a major  Grand Prix. All around us...  1  (CONTINUED)",
      "characters": [],
      "action_text": "Engines scream into life as DRIVERS start their cars. An  OFFICIAL walks through the cars holding aloft a sign, “One  Minute”...  Deafening, angry thunder as engines rev impatiently.  NIKI  This is bullshit. We have no control  over our legacy. We cannot choose what  we are remembered for...  A Ferrari MECHANIC rushes towards NIKI, and shouts in Italian  above the noise, (we see sub-titles)...  MECHANIC  Mass usa slicks. Le vuoi cambiare  anche tu?  ( Mass is going on slicks. You  want to change? )  NIKI looks in his wing-mirror back to see a red McLaren, white  helmet, number 12, several rows behind him. A team of  MECHANICS hastily changing the tyres to dry tyres.  NIKI  Otherwise I wouldn’t be remembered for  my rivalry with this asshole. And the  1976 season.  NIKI then looks over at the car in pole position beside him.  Another McLaren, but with number 11, and a Union Jack...  NIKI  What about Hunt? Has he changed?  MECHANIC  No, he’s going on wets.  The car in pole position: JAMES HUNT, surrounded by TV crews,  mechanics, girlfriends, hangers-on..  The Maclaren team is less than half the size of Ferrari’s, but  HUNT makes up for this with magnetism. The rock star of F1.  NIKI’s face: a stab of envy seeing a flash of his rival’s  glamorous long blonde hair disappearing into his balaclava,  flirting with several hot-looking GIRLS..  NIKI  I don't know why it became such a big  thing. We were just drivers. Busting  each other's balls. To me this is  perfectly normal. But other people saw  it differently.  2  CONTINUED: 5   5  (MORE)  (CONTINUED) That whatever it was between us went  deeper. And changed us both somehow.  Forever.  NIKI stares, then...  NIKI  Be, allora usiamo anche noi quells da  bagnato.  ( Then we go on wets, too. )  The ten-second board is held up.  NIKI pulls down his visor...as he and HUNT’s eyes meet for a  split-second, eyes staring...  NIKI selects second gear for the wet track and revs the  engine. The dashboard needle climbs through 8000",
      "dialogue_count": 0,
      "word_count": 756
    },
    {
      "scene_number": 2,
      "slugline": "INT. PITS - DAY 6   6  Commentary from all the world’s TV stations explaining the  crazy, panicked situation as all the DRIVERS come into the  pits to change to dry tyres.  It’s chaos. A traffic jam of Formula 1 cars...  The Ferrari team frantically work. Changing NIKI’s tyres. Four  men with air guns, two men with rapid-duty jacks. The same  Italian MECHANIC appears, ‘plugs in’ his headset to the car..  MECHANIC  Hair visto? Ti aveto detto di usare le  slicks!  ( See? I told you to go on  slicks!! )  NIKI  Bullshit. Where’s Hunt?  MECHANIC  There!  NIKI looks up to see the name JAMES HUNT written on the black  helmet roar out of the pits ahead, with new tyres on...  NIKI  C’mon...!!  NIKI screams at the MECHANICS, who are struggling. The airguns  make a high-pitched noise...something’s not right.  NIKI  What’s GOING ON???  “Thump”, new (slick) tyres hit the tarmac, engines scream, and  NIKI exit the pits in pursuit of HUNT. But the delay has cost  him dear...  EXT. NUBURGRING - DAY 7   7  Archive TV commentary from the world’s race COMMENTATORS  stations informs us of the positions.  MASS leading, HUNT in 3rd, LAUDA in 20th...  INT. NIKI’S CAR - DAY 8   8  NIKI gives it everything he’s got. Tearing through the gears,  trying to catch JAMES HUNT, breaking as late as he can, engine  screaming.  4  (CONTINUED)",
      "characters": [],
      "action_text": "He flies over the take-off hump between Pflanzgarten and  Swallowtail - passes one car after another. Into 13th place  now. Pulling off outrageous manoeuvres.  NIKI’s P.O.V: the world flies past in a blur. The steering  wheel shakes. The car is right on the edge. Cannot be driven  any harder.  NIKI approaches the Streckenteil Adenauer-Brucke section of  the course...turns left at the Bergwerk corner. Crazy speed.  And tight. Too tight. A mistake...  “Thump”, his wheels come into contact with the kerb on the  inside. NIKI tries to counter-steer, but is travelling at 155  mph. The car jerks horribly to the right..  “Crunch”, hits the embankment, then “Bang”, hits the barrier,  and is thrown across the track..  Fire breaks out in the engine. NIKI’s eyes widen in horror,  with another car bearing down upon him...  NIKI  No...!  The oncoming car crashes head-on into our car, “Crash”, a  sickening, terrifying impact.  The car explodes. Seventy litres of burning high-octane  gasoline, with NIKI strapped inside, unable to undo his  seatbelt. Locked in a blast furnace.  NIKI screams as the flames engulf him. 800 degrees  temperature. Trapped inside his car.  Burning smoke fills his helmet, scarring his lungs...  Pandemonium: commentary in different languages as panicked TV  commentators helplessly describe what’s happening..  NIKI’s POV: he can just make out the barely recognizable  figures of the other DRIVERS rushing towards NIKI..  Their hands get burnt in the flames as they try unsuccessfully  to undo NIKI’s seatbelt..  Fire extinguishers blast at the car. Dry powder extinguishers.  Covering NIKI’s helmet. Blurring his vision, as he cries out  in agony, inhaling the powder..  Screaming voices. Panicked reactions. On the side of the car,  the painted name ‘Niki Lauda’ blisters and melts.  5  CONTINUED: 8   8  (CONTINUED) Then sound fades. As NIKI blacks out - losing consciousness.  FADE TO BLACK:  Over this: the sound of a ringing phone...  INT. HOSPITAL A&E UNIT - (ACCID",
      "dialogue_count": 0,
      "word_count": 2535
    },
    {
      "scene_number": 3,
      "slugline": "INT. NIKI’S APARTMENT - DAY 21   21  NIKI is in front of a mirror, and dresses smartly in a jacket,  and open necked shirt, evidently a little nervous...  NIKI (V/O)  So when they heard I wanted to race  cars for a living, they had a few  things to say. ..  INT. LAUDA GRANDFATHER HOUSE - NIGHT 22   22  A large, forbidding dining room. NIKI’s FATHER and terrifying  GRANDFATHER, are eating supper. GRANDFATHER shakes his head,  clearly disapproves and barks in German...(we see subtitles)  GRANDFATHER  Never! Racing is for playboys and  dilettantes. Frivolous amateurs with  nothing in their heads. The name  ‘Lauda’ appears on the front pages,  with politicians and economists, not  on the back pages with...  (gestures in contempt)  ...footballers and skiers. If you want  my money, you do as I say and follow  me into my business..  NIKI stares at his GRANDFATHER..  NIKI (V/O)  It’s in moments like this that you  discover who you really are..  ...and in a move that he knows will rupture the family for  ever, NIKI gets to his feet..  NIKI  Fine. Keep your money. Don’t invest in  me. But when I’m World Champion, and I  have the trophy, and my name is not  just on the back pages, but on the  front too, you will regret it.  NIKI walks out, the old man’s insults ringing in his ears...  GRANDFATHER  You dare sit at my table and lecture  me on what I will or won’t regret? Get  out! Impertinent wretch! Consider  yourself disowned!  16",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 250
    },
    {
      "scene_number": 4,
      "slugline": "INT. RAIFEISENKASSE - BANK - DAY 23   23  NIKI is in a meeting with visibly concerned BANKERS and  LAWYERS. They speak in German...  BANKER  Another loan? Herr Lauda, you still  haven’t repaid the other...  BANKER 2  Three..  BANKER  Totalling millions of Schillings. Plus  your Grandfather called to inform us  he will no longer be offering  security.  NIKI  I know. There is no room for failure.  I understand that.  NIKI (V/O)  But I was still a Lauda...  INT. NIKI’S CAR/ ROAD TO VIENNA AIRPORT - DAY 24   24  NIKI is driving his car. Beside him, is the attache case on  his lap. His car passes under a motorway sign reading  “Flughafen”. (Airport)...  NIKI (V/O)  ...which meant I was still a  businessman above everything else .  EXT. VIENNA AIRPORT - DAY 25   25  A private jet. A balding, blazered Englishman in late middle-  age (LOUIS STANLEY), owner of BRM racing, disembarks onto the  tarmac...  NIKI (V/O)  It just so happens that the business I  deal in is speed.  INT. VIENNA AIRPORT - CAFE 26   26  NIKI sits with LOUIS STANLEY in an airport cafe.  Contracts are open on the table. NIKI is signing. LOUIS  STANLEY is counter-signing...  17  (CONTINUED)",
      "characters": [],
      "action_text": "STANLEY  In return for your money you get a  car, mechanics and a place on the  team. Plus fifty per cent of starting  fees and bonuses for podium finishes.  NIKI  Who’s the number one driver?  STANLEY  Clay Regazzoni and you will defer to  him at all times.  NIKI takes out his cheque book and pen. He looks up...  NIKI  Why would I defer to him if I am  paying his wages?  NIKI writes the cheque. STANLEY’s smile fades..  STANLEY  Because he’s a proven winner at the  highest level, a good guy, and someone  who quite frankly, could teach you a  thing or two.  NIKI ignores this, continues scrutinizing the contract...  NIKI  OK. There is one clause missing.  STANLEY  The one about mechanics’ exclusivity?  Sorry. We have a cardinal rule at BRM.  All information is shared between ALL  our drivers..  NIKI  And I made it perfectly clear that my  mechanics work for me. No one else.  This is something I cannot sign.  NIKI takes back the cheque. STANLEY stares...  STANLEY  All right. I’ll have the lawyers amend  it.  NIKI  While you’re at it you can tell them  to amend the clause for podium  finishes. Podium is first THREE  places, not just wins.  18  CONTINUED: 26   26  (CONTINUED) NIKI puts the cheque in his attache case. Snaps it shut,  taking it with him..  NIKI  You’ll get the money on signature, as  agreed. See you at winter testing.  NIKI gets to his feet, and leaves. STANLEY watches the attache  case disappear.  STANLEY  If that little git drives half as well  as he negotiates, we’re going to be  fine.  CUT TO:  OMITTED 27   27  INT. AWARD CEREMONY - NIGHT 28   28  An awards ceremony is in progress. The room is thick with  cigar and cigarette smoke. A presenter on stage, wearing black  tie...  PRESENTER  I’m delighted to say the winner of the  British Guild of Motoring Writers  award for the ‘Most Promising Driver  of the Year’ is James Hunt...  A loud, boisterous cheer goes up at the Hesketh Racing table.  JAMES turns to a (new/different) girlfriend beside him, gives  ",
      "dialogue_count": 0,
      "word_count": 1768
    },
    {
      "scene_number": 5,
      "slugline": "EXT. PAUL RICARD CIRCUIT - DAY 37   37  REGAZZONI races round the track at full speed.  REGAZZONI roars past the finishing line in NIKI’s car. LOUIS  STANLEY looks at the stop watch..  His expression changes.  INT. PAUL RICARD CIRCUIT - DAY 38   38  STANLEY comes into the workshop where NIKI and his MECHANICS  are in conversation, getting changed...  STANLEY  All right. What did you do to the car?  NIKI  That’s information I will share with  you under certain conditions only.  STANLEY stares, bracing himself..  STANLEY  Go on...  NIKI  A guaranteed place in the team, and a  paid contract on equal terms with  Regazzoni for two years.  STANLEY  Are you crazy? Clay’s a senior figure  in Formula One...you’re a rookie. The  only reason we took you ON was because  you were paying us.  NIKI  Well, as of now, if you want me to  stay, we rip up the contract. I don’t  pay you a cent.  STANLEY  It’s outrageous.  NIKI  Was he quicker in my car? He was,  wasn’t he?  STANLEY stares...  NIKI  Did he go under two minutes?  26  (CONTINUED)",
      "characters": [
        "STANLEY"
      ],
      "action_text": "But Agnes’s last boyfriend was a  British Formula 2 driver, who has a  reputation for two things. For being a  suicidal jerk on the track, and for  going all night, and all day  afterwards...and all night again in  bed. He’s an OK driver, but an  IMMORTAL fuck, apparently. I don’t  know about you, but that’s not an act  I’d like to follow.  (shrugs)  But if that doesn’t bother you...  NIKI  What’s his name? The driver?  REGAZZONI  Hunt. James Hunt.  NIKI stares. Can hardly believe it.  REGAZZONI  See? You share information, I share  information.  CLAY slaps NIKI on his back, and goes into the showers..  REGAZZONI  That’s what team-mates are for.  NIKI  (quiet/defeated)  Thanks.  EXT. RESTAURANT - NIGHT 41   41  A restaurant in Marseilles. Through the window we can see  AGNES, the attractive TRACK MANAGER sitting at a table alone.  Waiting for NIKI.  Reverse angle to reveal:  INT. NIKI’S CAR/ MARSEILLES STREET - SAME TIME 42   42  NIKI is sitting in a car across the street. He stares at AGNES  in the restaurant. Then starts his car, and drives off.  FADE TO BLACK:  28  CONTINUED: 40   40  REGAZZONI (contíd)",
      "dialogue_count": 1,
      "word_count": 568
    },
    {
      "scene_number": 6,
      "slugline": "EXT. EASTON NESTON - HESKETH RACING HQ - DAY 43   43  Easton Neston. Set in 3,300 acres, one of England’s great  country houses. Home to the Fermor-Hesketh family since 1700.  JAMES and a new GIRLFRIEND drive up the gravel drive in his  anything but grandiose Mini. It splutters to a stop, just in  time.  They are greeted by uniformed STAFF who take his tatty bags  from his filthy car.  INT. HESKETH RACING WORKSHOPS - EASTON NESTON - DAY 44   44  The Hesketh Racing workshops, situated in the converted  stables on the estate. HESKETH leads a blindfolded JAMES in...  HESKETH  Keep them closed...! Wait for it, wait  for it...  HESKETH removes JAMES’s blindfold...  HESKETH  There! What do you say?  JAMES opens his eyes to see a gorgeous F1 racing car, plain  white, no stickers...  HESKETH  Isn’t she a beauty? The March 731.  Converted by the brilliant Doc..!  DOC POSTLETHWAITE takes a modest bow. JAMES shakes hands with  everyone, including his brother, (and manager), PETER..  JAMES  She is a beauty. But...haven’t you  made a mistake?  HESKETH  What?  JAMES  That’s not a Formula 2 car. She’s F1.  HESKETH  She is, Superstar. Why? Because I got  together with the beancounters, and it  turns out that the economics of F1 are  not so significantly different to the  economics of Formula 2...  BUBBLES clears his throat, dutifully bites his tongue..  29  (CONTINUED)",
      "characters": [],
      "action_text": "HESKETH  So we thought if we were going to be  messing about losing money we might as  well be doing it with the big boys.  JAMES  Are you serious?  HESKETH  Never been more serious in my life!  JAMES embraces HESKETH in excitement, kisses him...  HESKETH  Actually, I got the idea after what  you said about the Austrian chap who  bought his way in rather than waste  his time in the lower divisions. I  thought, “Bloody hell, he’s right!”  JAMES slips into the cockpit...  JAMES  Well done the Goosestepper!!  HESKETH  (indicates car)  No sponsorship, Superstar! I hope you  approve.  JAMES  I do, Patron.  HESKETH  No vulgar logos for cigarettes, or  condoms. Just plain white. With the  Union Jack. And racing overalls which  read...  HESKETH indicates JAMES’s hanging racing overalls...  HESKETH  “Sex. Breakfast of Champions.” Unless  it’s me, of course, in which case it’s  two kippers, porridge, boiled eggs,  and half a dozen slices of toast...  Laughter.  JAMES  So when do we start?  HESKETH  Soon as you’re ready.  30  CONTINUED: 44   44  (CONTINUED) JAMES  I’m ready now.  HESKETH  That’s my boy!  HESKETH pops champagne...  HESKETH  They won’t know what’s hit them!  EXT. SPANISH GP - RACE TRACK -27 APRIL 1975- DAY 45   45  To establish: a Formula 1 race track on Grand Prix week-end..  A helicopter comes in to land.  The Hesketh Racing Team makes a grand entrance with a retinue  of BUTLERS, GIRLS, ROLLS’ ROYCE’s, oysters, champagne...  A famous ex-champion TV REPORTER is there (Stirling Moss)  providing skeptical commentary about Hesketh’s debut...  STIRLING MOSS  ...hard to tell whether Lord Hesketh  and his team of upper class  enthusiasts is bringing glamour to the  racing community, or just comedy...  They walk around in their own branded clothing. Alexander’s  jacket reads, “Le Patron”. He speaks to MOSS.  Rolled eyes among other racing teams who express surprise,  curiosity (and frequently disapproval) at these new arrivals..  STIRLING MOSS  It’s certainly the firs",
      "dialogue_count": 0,
      "word_count": 3069
    },
    {
      "scene_number": 7,
      "slugline": "EXT. MOTORWAY - HARD SHOULDER - DAY 79   79  White smoke pours from the engine. The car has broken down.  Bonnet up. NIKI has tried fixing it, but to no avail.  NIKI has a fan belt in his hand, but it’s all but  disintegrated under the heat of the over-worked engine.  NIKI’s hands are covered in oil. He is pushing a pen into a  large crack in the engine, slick with oil and grease.  NIKI  Nothing I can do here. The car needs a  garage.  MARLENE  I’m sorry. You’re not in a hurry, are  you?  NIKI  No. As long as I’m back in Maranello  by Monday morning.  NIKI walks out into the road. Sticks out his thumb...  MARLENE  So who are you anyway?  MARLENE breaks into GERMAN...(we see sub-titles)...  MARLENE  You’re from Vienna, aren’t you. We can  speak German. How do you know Curd?  NIKI  Who’s Curd?  MARLENE  Curd Jurgens. The actor. It’s his  house. He is, or was until yesterday,  my boyfriend. I must have been mad!  There is something very attractive  about an older man when they behave  like one. But when they behave like a  frightened child..  MARLENE gets to her feet...  MARLENE  C’mon, let me do this. Otherwise we’ll  never get out of here. We’re in Italy,  after all.  MARLENE indicates that NIKI should take a back seat, hitches  up her skirt, showing long, tanned legs..  45  (CONTINUED)",
      "characters": [
        "JAMES"
      ],
      "action_text": "SSSCCCREEEEEEEEECCCCCHHHHHHH!!!!!  Immediately a passing car screeches to a halt, then reverses  noisily to pull level. MARLENE smiles at NIKI...  MARLENE  Not bad, eh? Three seconds. Admit it,  you’re impressed..!  MARLENE smiles flirtatiously at the handsome, young Italian  MEN driving the open-topped sports car..  MARLENE  Ciao, Regazzi...!  But the Italian MEN walk right past her, not seeing her, as if  she’s invisible, and stare at NIKI...  ITALIAN MAN  (in Italian)  Excuse me...are you Niki Lauda?  NIKI  Yes.  ITALIAN MAN  (in Italian)  Oh, my God...!!! I told you it was  him..!!!  (blown away)  Do you need a ride?  NIKI  Yes, we do...  The ITALIAN MAN gestures to his car, as his friend loads  MARLENE’s luggage inside...  ITALIAN MAN  An honour, please!!! But on one  condition..  The ITALIAN MAN whisper in NIKI’s ear. MARLENE stares, not  understanding, as NIKI protests, but then slowly, reluctantly  gets into the car. He starts the engine.  MARLENE watches as the ITALIAN MEN strap themselves in with  the seat-belts, tightening them...giggling like schoolboys..  MARLENE  Will someone please tell me what’s  going on?  MARLENE turns to NIKI...  46  CONTINUED: 79   79  (CONTINUED) MARLENE  Who are you, anyway? What do you DO?  ITALIAN MAN  You don’t   know?   He’s a Formula I  driver. Who just signed for Ferrari!  MARLENE  Him? Never. Impossible!  ITALIAN MAN  Why?  MARLENE  Formula 1 drivers have long hair, are  sexy, have shirts open to here..  MARLENE indicates...  MARLENE  Anyway, look at the way he’s driving!!  Like an old man!!  It’s true. NIKI is driving in the slow lane. Like a pensioner.  NIKI  No need to drive fast. It only  increases the percentage of risk.  We’re not in a hurry. No one is paying  me. Right now, with zero incentive or  reward, why would I drive fast?  MARLENE looks at him with her dark green eyes...  MARLENE  (in German)  Because I’m asking you to.  NIKI  (in German)  And do you always get what you want?  MARLENE  (in German)  Usually.",
      "dialogue_count": 1,
      "word_count": 2530
    },
    {
      "scene_number": 8,
      "slugline": "EXT. STARTING GRID - KYALAMI - DAY 100   100  NIKI and JAMES’s cars lined up in positions 1 and 2 on the  starting grid. JAMES proudly indicates to NIKI...  JAMES  New car.  NIKI  I noticed.  JAMES  Pole position.  NIKI  I noticed that, too.  JAMES  Level playing field now, my ratty  little friend.  NIKI  Let’s see where we are at the end of  lap one.  NIKI calls after JAMES as he walks to his car...  NIKI  Let’s see where we are in six races  time!!  JAMES turns, makes a ratty face at NIKI. Protruding teeth.  EXT. VIP GRANDSTAND - DAY 101   101  RICHARD BURTON and LIZ TAYLOR are shown into the VIP area of  the paddock. They take their seats.  LIZ TAYLOR  (bored already)  Will this take very long?  An OFFICIAL introduces BURTON to various people - among them  SUZY HUNT...  OFFICIAL  Richard Burton...Suzy Miller, also  known as Mrs. James Hunt.  BURTON  Who?  There it is. The deep, dark, sonorous Welsh baritone  voice...scarred by alcohol and cigarettes...  58  (CONTINUED)",
      "characters": [],
      "action_text": "SUZY  James Hunt. One of the racers.  BURTON  Forgive me. Richard.  (extending hand)  Also known as Mr. Elizabeth Taylor.  He indicates LIZ who is deeply bored..  LIZ TAYLOR  What does a girl have to do to get a  drink around here?  SUZY smiles. Their eyes meet. And no eyes are more beautiful  than SUZY’s. An immediate connection between them.  Their hands hold a fraction too long as they shake...  OMITTED 102   102  OMITTED 103   103  EXT. RACE TRACK - DAY 104   104  NIKI’s car roars past the finishing line first. JAMES closely  behind...  CAPTION: “SOUTH AFRICA. LAUDA WINS. HUNT SECOND.”  EXT. PODIUM   - KYALAMI - DAY 104A   104A  JAMES and NIKI are on the podium together...  JAMES  My car wasn’t right today. Next time  I’ll have you..  NIKI  Yeah, yeah...  OMITTED 105   105  OMITTED 106   106  OMITTED 107   107  EXT. SPANISH GRAND PRIX - JARAMA, 2ND MAY 1976- DAY 108   108  JAMES’s car takes the chequered flag, finishing first!!!  59  CONTINUED: 101   101",
      "dialogue_count": 0,
      "word_count": 332
    },
    {
      "scene_number": 9,
      "slugline": "INT/EXT. MCLAREN PITS 108A   108A  In the pits: TEDDY MAYER, ALASTAIR CALDWELL and JOHN HOGAN  leap to their feet in delight. Punching the air. Victory..  CAPTION: “RACE 3. SPAIN. HUNT WINS...”  EXT. SPANISH GRAND PRIX PODIUM/ PITLANE 108B   108B  Afterwards: JAMES and NIKI are on the podium together...  JAMES  What did I tell you? Car fixed. Equal  terms. You’d better get used to this.  JAMES walks off, to celebrate with the McLaren team...  NIKI stares darkly - threatened - watching JAMES go..  ...then goes to talk to LUCA DE MONTEZEMOLO and the FERRARI  team.  CAPTION: “...BUT IS THEN DISQUALIFIED”.  EXT. SPANISH GP PADDOCK/ PARC FERME- DAY 109   109  A huge furore as several OFFICIALS and FERRARI TEAM MEMBERS,  and TV CREWS surround JAMES’s car...  Raised voices debating the width of the car, HUNT furious,  people almost coming to blows...  OFFICIAL  The car is too wide..  JAMES  Five   eighths   of an inch..!  OFFICIAL  Which makes it illegal! If you want to  compete, you have to change it.  JAMES  What? You can’t just ‘change it’. That  means rebuilding the car. Who lodged  the complaint? It was Ferrari, wasn’t  it?  The two rival PIT CREWS, (McLaren and Ferrari), scream abuse  at one another in Italian and English - a highly charged and  explosive atmosphere....  CAPTION: “LAUDA GETS MAXIMUM POINTS”  60  (CONTINUED)",
      "characters": [],
      "action_text": "NIKI watches from the inside of the FERRARI TRAILER.  INT. MCLAREN WORKSHOP - NIGHT 110   110  The McLaren MECHANICS, supervised by Alastair Caldwell, are  making adjustments to the car to make it ‘legal’..  MAYER  ...we have to move the wing forward.  To make it legal...  CALDWELL  But that’ll have a knock-on effect on  the oil coolers..  JAMES watches - already fearing the worst - as the car is  stripped down, effectively being rebuilt...  OMITTED 111   111  EXT. WATKINS GLEN 1976 - DAY 111A   111A  “BANG”, JAMES’s car shudders violently, the wheels shake as  the drive shaft snaps...  CAPTION: “RACE 4. LAUDA WINS. HUNT RETIRES.”  EXT. MONACO GRAND PRIX 1976- DAY 111B   111B  “BOOM”, a loud explosion. A thick plume of black smoke billows  from the engine...  JAMES  No! No! No!  CAPTION: “RACE 5. LAUDA WINS AGAIN. HUNT RETIRES.”  EXT. BELGIUM GP 1976 - ZOLDER - DAY 111C   111C  “CRASH” - JAMES spins out...and a tyre bounces along the  track...JAMES’s car has crashed into a wall...  JAMES  I can’t stand it...  The tyre continues bouncing, people diving out of it’s path,  before the tyre finally smashes into a hot-dog stand...  CAPTION: “RACE 6. LAUDA WINS AGAIN. HUNT RETIRES.”  61  CONTINUED: 109   109  (CONTINUED) OMITTED 112   112  EXT. BELGIUM GRAND PRIX - ZOLDER - PITLANE - DAY 113   113  JAMES storms back into the pits, screaming at MAYER, CALDWELL  and the MECHANICS...  JAMES  What’s happened? What have you DONE??  The car’s evil! It’s undriveable..!  CAPTION: “LAUDA 56 POINTS, HUNT 6”  INT. PADDOCK/PRESS TENT - DAY 113A   113A  Later: the victorious NIKI, wearing the garland, is all  smiles, giving ‘winner’ interviews, surrounded by MARLENE and  a delighted LUCA DI MONTEZEMOLO.  JAMES is also giving interviews, but in a total fury.  Vibrating with anger. Still complaining about the  disqualification. Complaining about a conspiracy. Complaining.  NIKI finishes talking to JOURNALISTS, and walks off, through  crowds, and bumps into JAMES..  NIKI  So...six races i",
      "dialogue_count": 0,
      "word_count": 2234
    },
    {
      "scene_number": 10,
      "slugline": "INT. BEDROOM - HOUSE - IBIZA - NIGHT 137   137  MARLENE is fast asleep. She wakes, to discover the bed is  empty beside her..  INT. HOUSE - IBIZA - NIGHT 138   138  MARLENE walks through the house, looking for NIKI. Then finds  him on a balcony...alone..  MARLENE  Come to bed.  MARLENE notices his mood. It’s different.  MARLENE  What’s the matter?  NIKI  It’s the enemy, you know. Happiness.  NIKI looks up at MARLENE...  NIKI  It weakens you. Puts doubt in your  mind. Because all of a sudden you have  something to lose..  MARLENE stares at him.  MARLENE  When you call happiness an enemy, then  it’s too late.  (a beat)  Then you have lost already.  MARLENE turns, and goes..  NIKI is left alone. We can tell from his expression, he is  struggling with something for the first time. Fear.  EXT. NURBURGRING - DAY 139   139  The notoriously difficult and treacherous German race track.  Testing is underway. A CAR (from one of the other teams)  skids, and crashes violently.  70",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 168
    },
    {
      "scene_number": 11,
      "slugline": "EXT. NURBURGRING - CRASH SITE - DAY 139A   139A  AMBULANCES arrive. The Driver is badly hurt. Screaming in  pain. His leg is crushed. Bone is sticking out. A brutal  compound fracture. He is taken away.  INT/EXT. NURBURGRING PITLANE - DAY 139B   139B  In the pits, everyone is shaken. JAMES, REGAZZONI, and other  DRIVERS nervously talk among themselves as the Ambulance races  past.  NIKI’s face: visibly pale. More frightened than ever.  EXT. NURBURGRING - DAY 140   140  Race-day. Huge crowds arrive at the Nurburgring. And rain.  Heavy rain falling.  Television commentary informs us about the Nurburgring’s  terrible reputation as a ‘graveyard’ track.  EXT. NURBURGRING - DAY 141   141  JAMES arrives at the race track, to find ALASTAIR CALDWELL  waiting for him, a concerned look on his face...  CALDWELL  We’ve just been told, a driver’s  meeting has been called.  JAMES  Who by?  CALDWELL  Niki.  JAMES’s face. Instantly suspicious.  INT. MEETING ROOM - NURBURGRING RACE TRACK - DAY 142   142  About sixty people, (26 DRIVERS and all the different team  REPRESENTATIVES), are assembled in the room, where a blazered  FIA OFFICIAL and a member of the DRIVERS SAFETY COMMITTEE are  sitting behind a table...  A buzz of anticipation and curiosity. What’s going on? What is  all this about? NIKI gets to his feet, raises his hands  calling for silence...  71  (CONTINUED)",
      "characters": [],
      "action_text": "NIKI  Thank you. I called this meeting  because as all drivers know the  Nurburgring is a race track from the  Stone Ages. The most stupid, barbaric,  outdated, dangerous, track in the  world. You’ve all seen the rain which  has been falling this morning. Those  of you with experience know the Ring  needs perfect conditions to be even  remotely acceptable in terms of risk.  As you can see today is anything BUT  perfect, so I called this meeting to  take a vote to cancel the race.  A ripple of astonished reactions among the drivers..  NIKI  There would be no change to the  situation as far as points is  concerned. The race would simply be  cancelled.  TEDDY MAYER looks over at FERRARI representatives....  MAYER  This is bullshit...  Another DRIVER (GUY EDWARDS) gets to his feet...  EDWARDS  If the race is cancelled, none of us  get our race fees...  NIKI  It’s true. You leave without your fee,  but you might leave with your LIFE.  Another voice pierces the controversy...  VOICE  It also means you would effectively  win the championship.  It’s JAMES HUNT, who is standing up...  JAMES  So I can see why this suits you just  fine.  NIKI  Why? There would be no points for me  either...  72  CONTINUED: 142   142  (CONTINUED) JAMES  But there would be one race less where  I, or anyone else, could catch you.  Uproar in the room...  BRETT LUNGER  James is right! This is just tactics!  ARTURO MERZARIO  Ferrari’s dirty tricks! We’ve seen it  before!  HARALD ERTL  Maybe it’s just that he’s frightened?  Laughter among the DRIVERS...  NIKI  Which asshole said this?  Silence. No hand goes up. No one has the courage to own up.  NIKI  Yes, I am frightened. Always a little  bit when I race. I accept every time I  get in my car there is 20% chance that  I could die. But not one per cent  more. And today, with the rain the  risk IS more. How dare you accuse me  of lack of courage? Let me remind you.  I have the track record here. I am the  only person in history to do the Ring  in under",
      "dialogue_count": 0,
      "word_count": 1102
    },
    {
      "scene_number": 12,
      "slugline": "INT. PITS - DAY 145   145  Commentary from all the world’s TV stations explaining the  crazy, panicked situation as JAMES comes into the pits to  change to dry tyres.  The McLaren team frantically changes the tyres. Four men with  air guns, two men with rapid-duty jacks.  ALASTAIR CALDWELL appears, talks to JAMES..  CALDWELL  See? I told you to go on slicks!! You  didn’t take my advice...  JAMES  Shut up! Where’s Niki?  CALDWELL  Behind you! He made the same mistake!  JAMES looks in his mirror to see NIKI’s red helmet behind him  in the pits, then...  “Thump”, new (slick) tyres hit the tarmac. JAMES gets the  signal, ‘Clear!’  CALDWELL  Go! Go!! Go!!  JAMES’s foot hits the floor. He roars out, with new tyres,  leaving NIKI behind him in the pits...  EXT. NUBURGRING - DAY 146   146  Archive commentary: from the world’s TV stations informs us  that JAMES roars up into 3rd position..  INT. JAMES’S CAR - DAY 147   147  JAMES gives it everything he’s got. Tearing through the gears,  breaking as late as he can, engine screaming.  The world flies past in a blur. The steering wheel shakes. The  car cannot be driven any harder. No thought for safety. No  thought of failure..  Failure is unimaginable. Unconscionable.  He turns into the final straight, then stops when he sees  something ahead.  76  (CONTINUED)",
      "characters": [],
      "action_text": "Flags. Red flags. RACE MARSHALLS. Something has clearly  happened. An accident..  The race is being stopped. JAMES brakes, slowing down. He  pulls level with a uniformed MARSHALL..  JAMES  What’s up?  MARSHALL  Accident. Bad one.  JAMES  Who?  MARSHALL  We don’t know yet.  INT. NIKI’S CAR - SAME TIME 148   148  NIKI’s POV: a continuation of the opening scene. Burning smoke  fills NIKI’s helmet, burning his lungs. He cries out in agony.  NIKI  AAAAARRRRGHGHGGHGH!!!!  We can just make out the barely recognizable figures of the  other DRIVERS rushing towards him, as their hands get burnt in  the flames as they try unsuccessfully to undo his seatbelt...  We notice it is the same DRIVERS that were critical of NIKI in  the driver’s meeting. HARALD ERTL, BRETT LUNGER, ARTURO  MERZARIO, GUY EDWARDS...  Fire extinguishers blast at the car. Covering NIKI’s helmet.  Filling his lungs with chemicals, along with the smoke and  fumes, blurring his vision, as he screams horribly..  The sound of panicked TV COMMENTARY in different languages.  Screaming voices. Panicked reactions.  Then sound fades. As NIKI blacks out - losing consciousness.  FADE TO BLACK:  OVER THIS: the hypnotic sound of helicopter blades...  NIKI (V/O)  August 1st, 1976, I discovered comas  exist for a reason.  77  CONTINUED: 147   147",
      "dialogue_count": 0,
      "word_count": 427
    },
    {
      "scene_number": 13,
      "slugline": "EXT. MANNHEIM UNIVERSITY HOSPITAL - DAY 149   149  NIKI’s POV: the door to a helicopter opens, as it arrives at  Mannheim University Hospital...  The sound of shouting voices. Hospital STAFF pull reach  towards NIKI, pull his stretcher out.  NIKI’s internal voice groans: cries out at the pain.  NIKI (V/O)  Some things are better not remembered.  INT. MANNHEIM UNIVERSITY HOSPITAL - DAY 150   150  “Crash”, doors burst open and NIKI is rushed into emergency.  Neon ceiling lights pass overhead...  The sound of difficult breathing.  His stretcher is surrounded by DOCTORS, talking urgently,  making quick assessments..  NIKI’s POV: fading in and out of consciousness.  Bursts of concerned, urgent, overlapping dialogue among the  German DOCTORS which NIKI can barely make out..  INT. INTENSIVE CARE UNIT - MANNHEIM HOSPITAL - DAY 151   151  Two narrow, barely open slits of light. NIKI’s swollen eye-  lids. NIKI’s POV: barely making out MARLENE standing beside  the senior burns specialist DOCTOR. NIKI hears voices...  DOCTOR  It’s not the burns to his face that  are the danger. It’s the burns to his  lungs. His blood oxygen level is  currently...  NURSE  6.8.  DOCTOR  Which is not enough to maintain  life...  NIKI slips out of consciousness again. MARLENE is distraught,  in tears.  OMITTED 152   152  OMITTED 153   153  78",
      "characters": [],
      "action_text": "TELEVISION NEWS - FULL-FRAME 154   154  TV news: giving the latest information on NIKI’s condition.  INT. JAMES’S APARTMENT - LONDON - NIGHT 155   155  JAMES sits watching the news on TV in his apartment, while  feeding his budgerigars, (the collection has grown)..  He feels terrible. He goes to his desk, pulls out paper and  pen...  JAMES tries to find the right words, tries to write, tries to  put his feelings on paper, but words in general, and letters  in particular have never been his thing...  JAMES scrunches up the pieces of paper, throws it away. The  budgerigars, sensing his distress, flutter and peep..  INT. INTENSIVE CARE UNIT - DAY 156   156  NIKI’s P.O.V: feels someone touching his forehead and his  hands with oil...and the sound of a WOMAN weeping...  PRIEST  ...durch diese heilige Salbung helfe  dir der Herr in seinem reichen  Erbarmen, er stehe dir bei mit der  Kraft des Heiligen Geistes...  NIKI’s eyes barely crack open, barely manage to focus to see  an ELDERLY PRIEST is giving him the last rites in German..  The sound of MARLENE crying somewhere in the room.  PRIEST  Der Herr der dich von Sunden befreit,  rette dich in seiner Gnade richte er  dich auf...  NIKI strains to move. A sense of excruciating pain.  He fights to open his eyes, give an indication...ANY  indication of the fact that he is hearing this, and is alive  and able to fight for life...  But to no avail. The PRIEST continues giving last rites.  MARLENE continues to cry. The PRIEST touches NIKI’s  shoulder...  NIKI (V/O)  I’m here! Can’t you tell? I’m here!  79  (CONTINUED) NIKI screams inside. Wanting to be heard. Wanting to give them  a sign. He’s OK. He’s still there. But it’s no use.  NIKI blacks out again. The pain is too great.  FADE TO BLACK:  INT. CORRIDOR - HOSPITAL - DAY 157   157  Sunrise: MARLENE has been sitting in the hospital all night  supported by members of FAMILY and several FRIENDS.  Niki’s MOTHER and FATHER. CLAY REGAZZONI.  Presently: the door to the intensive ca",
      "dialogue_count": 0,
      "word_count": 691
    },
    {
      "scene_number": 14,
      "slugline": "INT. NIKI’S HOSPITAL ROOM/TELEVISION COVERAGE FULL FRAME -DAY 160   160  The starter’s flag drops. On television we see the Austrian  Grand Prix start.  NIKI watches the race on television, while beginning his rehab  in bed, in pain as bandages are changed..  ON TV: JAMES narrowly misses out on a podium, but still gains  on NIKI in his points total...  CAPTION: “RACE 11. HUNT FINISHES 4th”  INT. HOSPITAL - DAY - (A WEEK LATER) 161   161  NIKI continues his rehab in the hospital, now out of bed...  ON TV: the starter’s flag drops. Another Grand Prix starts.  This time at Zandvoort, in the Netherlands..  NIKI watches the race on television as DOCTORS put a vacuuum  pump into his lungs. It’s AGONY. JAMES leads, driving the  perfect race...  YOUNG GERMAN DOCTOR  We need to vacuum the lungs. Without  this, they can’t heal. But it will  hurt.  An unimaginably painful pump is forced down his burned lungs,  to try to hoover out the impurities..  COMMENTATORS ON TV: talk about how HUNT is catching up with  LAUDA on points. It spurs NIKI on, through gritted teeth.  NIKI  Aaarrrggghhhh...  The chequered flag. JAMES crosses the line in first position.  CAPTION: “RACE 12. HUNT WINS.”  The DOCTORS tell NIKI he’s had enough vacuum treatment. He’s  had more than enough pain. But NIKI waves them aside...  NIKI  Again!!  The DOCTOR nods. The vacuum is turned on again.  NIKI screams in agony. Eyes bulging. MARLENE and NIKI’s family  cannot bear to watch...  81  (CONTINUED)",
      "characters": [],
      "action_text": "He watches as ON TV: JAMES is on the victory podium spraying  champagne.  INT. HOSPITAL - DAY 162   162  NIKI continues screaming in pain, watching the Canadian GP on  TV as..  CAPTION: “RACE 13 CANADIAN GRAND PRIX. HUNT WINS AGAIN”  For the first time, JAMES has taken the lead in points. NIKI  stares at the TV: his expression changes.  OMITTED 163   163  INT. HOSPITAL - DAY 164   164  NIKI screams again. MARLENE, NIKI’s family and the DOCTORS are  deeply distressed, cannot bring themselves to watch, as...  NIKI  Aaaaarrrrggghghhhhhh!!  We WIDEN to reveal what NIKI is doing. What has caused these  unbearable, bloodcurdling screams of agony..  NIKI  I know what you’re all thinking...  Now we see. With great difficulty NIKI has put his racing  helmet on for the first time. Pressing into his open burn  wounds...  NIKI  But if you love me - all of you - you  won’t say a word.  He is almost unconscious with pain. His legs are weak. But he  has done it...  EXT. ITALIAN GRAND PRIX - MONZA - 12TH SEPT 1976 -DAY 165   165  The Italian Grand Prix. TELEVISION COMMENTARY sets the scene.  JAMES and the MCLAREN TEAM arrive in the pits to see a vast  commotion going on elsewhere...  JAMES  What’s going on?  CALDWELL  Jesus. It’s Niki.  82  CONTINUED: 161   161  (CONTINUED) JAMES  What about him?  CALDWELL  He’s here! He’s racing!  JAMES  What?? They said he was half-dead.  JAMES stares. Shaken.  EXT. MONZA PITLANE/ FERRARI PITS - DAY 166   166  JAMES pushes through the pitlanes, until he reaches the  crowded FERRARI pits. He sees a racer in the background. The  name LAUDA on his overalls...  JAMES  Niki?  NIKI turns round. JAMES sets eyes on him for the first time.  JAMES reels, visibly horrified by his appearance. His bandages  are blood stained. He has no hair. Looks grotesque..  NIKI sees the horror in JAMES’s face. Sees the shock. The  horror. And recognizes in that moment, this is how it’s going  to be - this is how people will respond to him - forever.  NIKI  Wow. It’s that ",
      "dialogue_count": 0,
      "word_count": 1527
    },
    {
      "scene_number": 15,
      "slugline": "EXT. TRACK - DAY 170B   170B  COMMENTATORS look up. Notice NIKI’s slow increase in speed.  What’s this? Maybe there’s life in him yet...  NIKI changes gears smoothly. He begins to overtake. The old  feelings come back..  EXT. PADDOCK/PITS - SAME TIME 170C   170C  MARLENE watches from the pits. Can hardly bring herself to  look...  EXT. TRACK - DAY 170D   170D  COMMENTATORS begin to get excited. LAUDA has started to  overtake the back-markers...  An incredible sequence. As NIKI gains more confidence, more  speed, and begins to work his way through the field..  COMMENTATORS now buzzing with excitement. This is incredible,  as NIKI overtakes first CARLOS REUTEMANN, the driver hired to  replace him, then others, working his way through the field...  INT. JAMES’S CAR - SAME TIME 170E   170E  JAMES sees NIKI coming up behind him. Cannot believe his eyes.  JAMES move to block NIKI’s path...  NIKI attacks fearlessly. Despite terrible pain. NIKI moves to  overtake JAMES.  Utterly intimidated by NIKI’s bravery, JAMES panics, and loses  control of the car. He spins out..  COMMENTATORS cannot believe their eyes. HUNT’s blown it!  LAUDA’s overtaken him!  It’s a miracle. It defies belief. As NIKI crosses the line....  CAPTION: “RACE 15. NIKI 4th. JAMES RETIRED.”  OMITTED 171   171  EXT. MONZA - DAY 172   172  The Italian crowds are ecstatic. Delirious. NIKI is a national  hero. Lazarus back from the dead. Superhuman.  88  (CONTINUED)",
      "characters": [],
      "action_text": "TV commentary in different languages elaborates on what an  extraordinary, superhuman achievement they have just seen...  CAPTION: “LAUDA 68 POINTS. HUNT 65 POINTS.”  STIRLING MOSS  What a race! What a man! What a  season! Now it all boils down to the  final race in Japan!  Hunt walks past, staring at a triumphant Niki.  INT. HOSPITAL - SAME TIME 172A   172A  The DOCTOR in the hospital shakes his head, cannot believe  what he has just witnessed...  EXT. PITS - SAME TIME 172B   172B  The Ferrari Mechanics that had initially so disliked NIKI, are  overwhelmed by what he has achieved...  EXT. TRACK - DAY 172C   172C  A reluctant, modest NIKI carried on shoulders, surrounded by  LUCA DI MONTEZEMOLO, MARLENE and the PRESS...  CUT TO:  EXT. FUJI SPEEDWAY - JAPAN - DAY 173   173  Mount Fuji towers imperiously, dramatically above the Japanese  race track, dominating the skyline on a clear day..  Television cameras and press photographers assemble at the  race track for the biggest sporting event of the year...  INT. JAMES’S HOTEL ROOM - NIGHT 174   174  JAMES sits alone in his hotel suite. Speaking to an old,  trusted friend at the other end...  JAMES (ON PHONE)  The man was in a coma. His doctors  pronounced him dead!! Then he comes  back and does THAT???  89  CONTINUED: 172   172",
      "dialogue_count": 0,
      "word_count": 445
    },
    {
      "scene_number": 16,
      "slugline": "INT. BUBBLES HORSELY HOME - MORNING 174A   174A  BUBBLES HORSLEY back at home in England. At a breakfast  table..  BUBBLES (ON PHONE)  What did you expect? That Niki would  give you the championship lying down?  Of course not. He’s a fighter. He’s  going to come at you with everything  he’s got. But you can do this. As a  driver, you’re his equal - better,  maybe. And God knows you’re quick and  brave enough. You just..  JAMES (ON PHONE)  What?  BUBBLES (ON PHONE)  Need to find the respect for yourself  to close out when it really matters.  You don’t much like yourself, James -  that’s the problem, therefore don’t  believe you deserve it.  INT. JAMES’S HOTEL ROOM - NIGHT 174B   174B  A knock at JAMES’s hotel room door..  JAMES  I’ve got to go.  JAMES hangs up, and goes to the door. He snaps it open to  reveal..  Two gorgeous-looking BOAC Stewardesses standing outside. Smart  blue blazers, short skirts, white gloves, blue caps..  STEWARDESS  Hi. We’ve come for the party?  JAMES  What party?  STEWARDESS  The party we were told was going on in  room 2109.  Sure enough: on JAMES’s door, the number 2109.  JAMES  Who sent you here?  90  (CONTINUED)",
      "characters": [],
      "action_text": "STEWARDESS  A man. On the phone. He didn’t give  his name.  JAMES  This man. Did he speak with an accent?  STEWARDESS  Yes. German accent.  JAMES can’t believe it. NIKI.  JAMES  I’m afraid it was a joke..  STEWARDESS  (liking the look of JAMES)  Awwww. Pity.  JAMES  Sorry, ladies. Any other time. Not  tonight.  JAMES closes the door. Goes back into his hotel room. Then,  after a moment...  He snaps open the door. The STEWARDESSES are about to  disappear into the elevator...  JAMES  Wait..!  EXT. TOKYO SKYLINE - DAWN 175   175  The following morning, day barely breaks. The skies are  ominously dark over Tokyo. Thick, black clouds.  It’s raining heavily...  INT. NIKI’S BEDROOM - HOTEL - DAY 176   176  NIKI wakes up and looks out of the window. Sees the heavy rain  which is falling outside...  His expression changes.  INT. JAMES’S BEDROOM - HOTEL - DAY 177   177  JAMES wakes up. Flinches. JAMES looks around, bleary-eyed.  Hungover.  He’s in a room that looks like a bomb has hit it.  91  CONTINUED: 174B   174B  (CONTINUED) The two STEWARDESSES are still asleep in the bed beside him.  Uniforms discarded on the floor.  Memories are now flooding back. Jesus, what was he THINKING?  JAMES leaps out of bed.  INT. NIKI’S ROOM - HOTEL - DAY 178   178  NIKI is being massaged by WILLI DUNGL in his hotel room in  preparation for the race.  NIKI continues to stare out of the window. They speak in  German. We see sub-titles..  NIKI  Can’t see the mountain.  DUNGL  So?  NIKI  The locals here believe if you can see  the mountain in the morning, it brings  good luck.  NIKI’s POV: the view. Nothing but mist, dark skies and rain.  OMITTED 179   179  EXT. JAPANESE GRAND PRIX - FUJI SPEEDWAY - 24TH OCT 1976 -DAY 180   180  Inside the race track: puddles everywhere. The rain continues  to fall. The circuit is covered in water...  DRIVERS and the TEAMS arrive at the race track. JAMES and  TEDDY MAYER and ALASTAIR CALDWELL among them...  SPECTATORS are huddled under umbrellas. TV CREWS strugg",
      "dialogue_count": 0,
      "word_count": 567
    },
    {
      "scene_number": 17,
      "slugline": "INT. CONTROL TOWER - MEETING ROOM - DAY 181   181  A driver’s meeting has been called. All the DRIVERS are in a  small room, arguing and remonstrating with FIA OFFICIALS and  blazer-wearing POWERS THAT BE...  A Japanese official, (AKIYAMA), is trying to keep the peace...  AKIYAMA  One at a time! Gentlemen, please!  Local JAPANESE DRIVERS are complaining in Japanese, (we see  sub-titles)...  TAKAHARA  You can’t send us out in that! It’s a  death sentence!  HASEMI  You have to postpone the race!  INT. CONTROL TOWER - CORRIDOR OUTSIDE - SAME TIME 181A   181A  JAMES, MAYER and CALDWELL arrive in a corridor outside the  meeting room...  MAYER  Niki’s talking to them about  cancelling the race.  JAMES’s POV: he can see NIKI, his wounds horribly visible,  remonstrating with the JAPANESE OFFICIAL about the dangerous  track conditions...  JAMES turns to TEDDY and ALASTAIR...  JAMES  I don’t want any part of this. I’m not  going to be responsible for turning  the room again.  CALDWELL  But you have no option. You HAVE to  race, James. It’s your only shot. If  you don’t, Niki wins..  JAMES  I’m not voting against Niki  again....or forcing fellow drivers to  risk their lives. Sorry. World  Championship or not...  JAMES raises his hands and walks off. CALDWELL shouts after  him, “James, wait..!” Then MAYER reassures CALDWELL...  93  (CONTINUED)",
      "characters": [],
      "action_text": "MAYER  Don’t worry, this race is going ahead.  The TV rights have been sold all  around the world.  MAYER can see that a vote is taking place in the room. Many of  the drivers have their hands in the air, voting...  The JAPANESE OFFICIAL is struggling to keep order in the room.  MAYER  The drivers can vote all they like.  A round of applause in the room, as the DRIVERS vote to cancel  the race. But unseen by the DRIVERS..  The FIA OFFICIALS, TV NETWORK EXECUTIVES, and the blazered  POWERS THAT BE are in dark, conspiratorial discussion..  ...making the decision that the race goes ahead.  ARCHIVE TELEVISION FOOTAGE 182   182  NEWSCASTERS from all over the world, in several different  languages, announce that a decision has been made..  The JAPANESE Grand Prix is definitely going ahead. The drivers  have been called to the starting grid...  OMITTED 183   183  INT. PITS - VARIOUS - DAY 184   184  In the pits alongside JAMES...  A series of shots of the other DRIVERS...being sent out like  lambs to the slaughter...  Visibly terrified, mouthing prayers, smoking last cigarettes,  meditating, crossing themselves, hands shaking..  Among them the JAPANESE DRIVERS. All laughter gone now.  Realizing what they’ve got into. Risking their lives.  Finally we come to rest on NIKI. Strangely calm.  NIKI puts on his balaclava over his still-raw wounds, wincing  with pain as he puts on his helmet..  94  CONTINUED: 181A   181A",
      "dialogue_count": 0,
      "word_count": 452
    },
    {
      "scene_number": 18,
      "slugline": "EXT. JAPANESE GP - STARTING GRID - DAY 185   185  JAMES is piggy-backed to his car by MECHANICS so his feet  don’t get soaked in the water pooling deep on the track.  EXT. JAPANESE GP - STARTING GRID - DAY 186   186  JAMES lowers himself into a car with puddles on the seat. He  straps himself in.  ALISTAIR CALDWELL approaches with a power-drill. Leans towards  JAMES, with the screaming drill...  CALDWELL  Keep still...  JAMES  What are you doing???  ‘ZZZZ”, “ZZZZ”, “ZZZZ”, CALDWELL drill holes in JAMES’s visor.  CALDWELL  To let the condensation out.  JAMES  But it will also let the water in.  CALDWELL  Not if you’re leading.  CALDWELL stares at JAMES...  CALDWELL  Trust me. This race is all about the  start. Whoever’s in front will see  everything. Whoever’s second...  CALDWELL gestures, “Nothing”..  CALDWELL  Good luck.  They shake hands. JAMES starts the engine with a roar.  EXT. STARTING GRID - DAY 187   187  NIKI’s engine replies with a loud roar. He looks over at  JAMES. JAMES turns to face NIKI..  ALL SOUND GOES SILENT...  ...as JAMES and NIKI stare at one another. All around them,  the world slows down. Comes to a standstill.  95  (CONTINUED)",
      "characters": [],
      "action_text": "THEIR EYES MEET...  A connection between them. Unspoken realization of where they  have both got to. What this moment means. For them both..  It’s what they have been waiting for. Working towards. All  this time.  NIKI raises his hand. In a gesture only JAMES sees. JAMES  raises his in return. A private salute.  Chivalric. From a bygone era. And in that moment, enemies  become brothers. Two men. Risking their lives.  THE TEN SECOND FLAG IS RAISED..  The moment’s truce is broken. They return to the task at hand.  THE FLAG DROPS. THEY’RE OFF.  EXT. RACE - JAPANESE GRAND PRIX - DAY 188   188  HUNT’s foot hits the floor. NIKI’s foot hits the floor...  JAMES gets the better start. His car aquaplanes like crazy,  skating over the water, totally out of control...  EXT. FUJI PIT WALL - DAY 189   189  CALDWELL and MAYER watch from the pit wall...  CALDWELL  Hold onto it, James..!  EXT. RACE - JAPANESE GRAND PRIX - DAY 190   190  Miraculously JAMES steadies the car...  The spray from his wheels creates a curtain of mist. The other  cars are wrapped inside it...  But JAMES has a clear view ahead. He slams his foot down..  COMMENTATOR (V/O)  It’s the perfect start for Hunt!  INT. NIKI’S CAR - SAME TIME 191   191  NIKI can see nothing. Surrounded by spray, water, noise.  96  CONTINUED: 187   187  (CONTINUED) Other cars are spinning all around him. It’s chaos. NIKI  bravely accelerates into blindness...  COMMENTATOR (V/O)  But Lauda’s car is right on his tail!  Barely visible in the spray..!  EXT. RACE - JAPANESE GRAND PRIX - DAY 192   192  JAMES goes to a corner, then his car twitches, aquaplanes  again...badly...almost losing it completely...  COMMENTATOR (V/O)  Hunt turns too tightly! He almost lost  his car right there...!  INT. EASTON NESTON - DAY 193   193  BUBBLES HORSLEY, ALEXANDER HESKETH and a number of the  characters from the Hesketh Racing days are all watching...  HESKETH  Concentrate, Superstar!  INT. JAMES’S CAR - DAY 194   194  JAMES struggles to hold onto his ca",
      "dialogue_count": 0,
      "word_count": 639
    },
    {
      "scene_number": 19,
      "slugline": "EXT. RACE TRACK - JAPAN - SAME TIME 197   197  JAMES continues to race flat out. Engine screaming. Foot to  the floor. His car aquaplanes again...almost skidding out...  INT. HOTEL - MANHATTAN - SAME TIME 198   198  SUZY HUNT is watching on television as RICHARD BURTON talks in  the background on the telephone...  SUZY  (urging him on)  Come on, James...  EXT. PITS - RACE TRACK - JAPAN - DAY 199   199  A sign is held up as JAMES races. Lap 39.  But there are problems with the car. One of the tyres...  CALDWELL  God! His front tyre! Look! It’s  completely frayed!  CALDWELL and TEDDY MAYER watch in horror from the pits and on  TV. They can see the shaking car..  COMMENTATOR  Hunt’s car has problems...it’s  shaking...the Englishman is definitely  getting slower...  EXT. PITS - RACE TRACK - JAPAN - DAY 199A   199A  ALASTAIR CALDWELL holds up a sign....  CHANGE TYRE  COMMENTATOR  ...with just a few laps to go, McLaren  are calling for Hunt to come into the  pits to change tyres...  JAMES’s car roars past the pits, refusing to stop...  COMMENTATOR  But Hunt is refusing! Simply ignoring  his team’s orders...! He’s made the  calculation that he can still hold  onto the lead...!  98",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 204
    },
    {
      "scene_number": 20,
      "slugline": "INT. EASTON NESTON - SAME TIME 199B   199B  HESKETH and BUBBLES cover their eyes. Can’t look...  BUBBLES  James!! What are you doing???  HESKETH  I can’t bear it!  INT. JAMES’S CAR - JAPAN GRAND PRIX - SAME TIME 199C   199C  Suddenly, a Ferrari in JAMES’s wing mirror. Unmistakably, even  in the spray, he can see the distinctive RED HELMET...  It’s NIKI. JAMES’s blood runs cold...  JAMES  No! No! NO!!!!  JAMES tries to fend NIKI off. Swerves this way and that. But  his wounded car is now running at seventy per cent at best...  ...and disaster!!! NIKI OVERTAKES HIM...  JAMES screams in agony and frustration. He’s lost it! And has  no one to blame but himself! His own arrogance. And  stubbornness. NIKI’s overtaken him!  THE CHEQUERED FLAG.  JAMES roars past. Has finished in third place. But that is no  consolation. NIKI has beaten him. As far as he’s concerned..  JAMES has lost. Lost everything.  EXT. PITS - DAY 200   200  JAMES’s car arrives in the pits. In a fury. At himself. For  refusing to listen. What a disgrace. What shame. What a fool.  But he is engulfed. JAMES gets out of his car, raging...  JAMES  I’m sorry!  But TEDDY MAYER is celebrating wildly. ALASTAIR CALDWELL, too.  The world’s media descends on JAMES...  MAYER  Sorry?? What are you talking about??  You did it!  99  (CONTINUED)",
      "characters": [],
      "action_text": "JAMES  What?  MAYER  You WON!!  JAMES  Rubbish!! What about Niki?? He  overtook me!! I saw it!! A Ferrari  with a red helmet..  MAYER  That wasn’t Niki. That was Regazzoni.  JAMES  What???  MAYER  Niki withdrew. Said it was too  dangerous, refused to drive!!  (gestures)  You’re Champion of the World, kiddo!  TEDDY MAYER takes JAMES’s number ‘11’ from the side of his  car, and tears it in two, leaving number ‘1’.  JAMES’s face: as he realizes. Then explodes with happiness.  INT. EASTON NESTON - DAY 200A   200A  HESKETH and BUBBLES cheer in celebration...  HESKETH  He did it! He bloody well did it!  INT. HOSPITAL - NIGHT 200B   200B  A television plays in the Emergency Ward of the hospital.  NURSIE catches sight of the victory, patients cheering and  applauding...  NURSIE allows herself a smile.  INT. HOTEL - MANHATTAN - SAME TIME 200C   200C  BURTON is at the door in tuxedo, waiting to go. SUZY, dressed  glamorously, smiles.  SUZY  Well done, James..  Then turns the TV off. And follows BURTON out.  100  CONTINUED: 200   200",
      "dialogue_count": 0,
      "word_count": 394
    },
    {
      "scene_number": 21,
      "slugline": "EXT. JAPAN GRAND PRIX - DAY 200D   200D  JAMES is embraced by CALDWELL and MAYER.  EXT. FUJI PADDOCK - HELICOPTER - SAME TIME 201   201  Across the race-track, the sound of helicopter blades turning.  JAMES looks over to see...  NIKI in the helicopter with MARLENE and a PILOT. NIKI, now the  ex -World Champion, looks over to see a triumphant JAMES  surrounded by press, McLaren colleagues, etc  MARLENE  Are you OK?  NIKI turns, takes MARLENE’s hand as he answers.  NIKI  Fine. It’s just one race.  The helicopter lifts into the air, and flies off...  EXT. PADDOCK - SAME TIME 202   202  JAMES watches as the helicopter carrying NIKI flies away, then  turns to see...  ...the world’s press begins to descend on him, and the biggest  party of JAMES HUNT’s life is about to begin..  In the background, the two JAPANESE DRIVERS are giving  interviews again. They didn’t just survive, MASAHIRO HASEMI  got the fastest lap of the race, and NORITAKE TAKAHARA came  9th...  And at that moment, magically, the sun breaks through, and the  snowy peak of Mount Fuji is finally revealed.  A QUICKFIRE MONTAGE 203   203  Of newspaper headlines, television talk shows, lucrative  endorsements, TV commercials, sponsorship, public billboards.  JAMES’s world championship victory has made him a rich man.  His movie star looks make him an international STAR and  marketing man’s dream.  Girls, more girls, and even more girls.  101  (CONTINUED)",
      "characters": [],
      "action_text": "JAMES, dashing in a white suit, plays trumpet on the UK’s most  famous talk show...  FADE TO BLACK:  EXT. RUNWAY - DAY 204   204  We’re on the runway of an airport in Northern Italy.  CAPTION: “THREE MONTHS LATER”  A stretch limousine pulls up on the tarmac.  A still-drunk JAMES HUNT and several good-looking WOMEN, rowdy  FRIENDS (and hangers-on) spill out of the limo...  They cross the tarmac towards their waiting private jet,  passing other jets, when JAMES stops.  He’s seen something that has caught his eye.  JAMES sends his FRIENDS on ahead to their waiting jet, and  walks over to a small private jet, (a Learjet 35)...  JAMES  I heard you were spending more and  more time in one of these...  A hunched PILOT doing final checks. The figure turns. It’s  NIKI. His wounds have healed a little, but it’s still a  painful sight...  NIKI  Do you fly?  JAMES  No.  NIKI  You should try it. If something goes  wrong up there, you’re on the edge,  but have to stay within the rules.  Stick to regulations. Suppress the  ego. It’s good discipline for the  racing.  JAMES  And there I was thinking you were  about to wax lyrical about the romance  of flight. I should have known better.  NIKI  What brings you here?  102  CONTINUED: 203   203  (CONTINUED) JAMES indicates his rowdy, cool-looking friends..  JAMES  A friend’s wedding. At least I think  it was a wedding. Might have been a  birthday. All a bit of a blur. How  about you? Been at Fiorano?  NIKI  Pre-season testing.  JAMES  Already? In February? You’re  relentless.  NIKI  Thank you.  JAMES  I’m not sure I meant it as a  compliment.  NIKI  But it is one. Relentlessness is good.  Means you’re a fighter. That you never  give up. Behind my back I know some of  you guys call me ‘The Rat.’ Because I  look like one. It’s meant as an  insult. But I don’t mind it. Rats are  ugly, sure. And no one likes them. But  they’re intelligent. With a strong  survival instinct.  JAMES can’t help smiling. That’s NIKI.  NIKI  So when do you start",
      "dialogue_count": 0,
      "word_count": 1120
    }
  ]
}