{
  "slug": "russian-doll-101-nothing-in-this-world-is-easy-2019",
  "title": "russian doll 101 nothing in this world is easy",
  "genre": "thriller",
  "format": "series",
  "scenes_count": 3,
  "characters_count": 0,
  "characters": [],
  "total_words": 4279,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. NADIA’S APARTMENT - NIGHT - (LOOP A) 8   8  1:00AM. Early Monday. Much like Maxine’s, Nadia’s apartment is another historic-turned-residential building in the East Village. Only Nadia’s is a small one bedroom/one bath. Unlike the open space of Maxine’s loft, Nadia’s space is very limited. The walls feel like they’re caving in with overstuffed bookshelves. Overflowing ashtrays litter every surface. Her computer, with multiple monitors and keyboards, sits like a shrine on a corner desk. Many programs running. On the wall, a poster of William Burroughs with the phrase:  LIFE’S A KILLER  Nadia, post-coital, types and swipes on her iPhone. Mike enters, typing on his phone. MIKE I don’t know why anal play is still so taboo for straight males. It seems almost parodic at this point. But it’s like I tell my students-- Mike notices untouched bowl of cat food and her slightly open window. MIKE (CONT’D) He got out through the window? NADIA Bold to assume my cat is male. I get it. I’m single and choose to foster an animal so it must be a pathetic attempt to fill the hole in my soul that would otherwise be filled by what? A penis? No thanks, I’m full. MIKE (game for a debate) You want me to call you a “sad cat lady” so you can say you aren’t one? NADIA Being a feline lover is not and has never been “sad”. Have you seen the 1982 film Cat People? It holds up. MIKE So you think the standard sexual narrative: pair bonding, marriage or formal partnerships-- RUSSIAN DOLL #101   Pink Draft (02/20/2018)   11.",
      "characters": [],
      "action_text": "NADIA --are just futile ways to stave off death and are destined to fail. MIKE Kinda harsh. NADIA ‘The One’ in practical application, means ‘The One I’m Going to Die With’. To take care of me when you’re infirm and shit. So my move is gonna be to wait ‘til I’m in, like, my late sixties then seal the deal. This is assuming I don’t die in between then and now. MIKE (turned on) Why didn’t you talk like this before we fucked? NADIA I thought you wanted me for my body. MIKE Would you sit on my face right now? NADIA I would... Her phone makes a noise. She holds it up to show him: NADIA (CONT’D) ...but I called you an Uber. HARD CUT TO: INT. NADIA’S APARTMENT - NIGHT - (LOOP A) 9   9  Later. 1:30AM. Nadia, now alone, sits at her computer. She writes code, listens to her headphones, and pounds Red Bull. REVERSE ANGLE: Her computer screen. Lines of code fly across the black screen, pushing the previous line up and away. Nadia pulls her last cigarette out of her pack. She searches for more. She crushes the empty pack. Thinks. She forgot to get them at the deli. She was distracted by Ferran’s FRIEND. She sighs, then layers up to go out. RUSSIAN DOLL #101   Pink Draft (02/20/2018)   12.",
      "dialogue_count": 0,
      "word_count": 493
    },
    {
      "scene_number": 2,
      "slugline": "EXT. STREET - FOUR WAY STOP - NIGHT - (LOOP A) 10   10  Avenue B. WHOOSH! A yellow cab whizzes by Nadia as she starts down the street back toward the deli. SFX. A cat mewing. Meow! Meow! Nadia freezes. Her senses heighten. All diegetic sound drops out. All we hear is: Meow. Meow. Nadia looks around. Calm. Centered. Ready to answer the call. And then she sees: ANGLE ON: A fluffy, gray and white SIBERIAN CAT pokes his head out of the dark, dense night of Tompkins Square Park. BACK ON: Nadia. Her relief floods her body. A softness, previously undetected in her personality, oozes from her. NADIA Hey there, my little one. Oatmeal looks at her then splits! He slips back into the darkness of Tompkins Square Park. All the diegetic sounds of the East Village come roaring back, as Nadia sprints into the street after him and--  WHAM! A car slams into her . Her blood and brains splatter on windshield. Her dead body bounces from the car to the street. A sickening crack as she lands. Then stillness. It’s all over in a few seconds. A couple of BYSTANDERS approach. The DRIVER exits the car. PUSH IN on: Nadia’s corpse. ECU: Nadia’s eye. Glassy. Dead. SFX. Water. The powerful sound of a river. Or is it a faucet? SOUNDTRACK:   “Gotta Get Up”   by Harry Nilsson. INT. MAXINE’S LOFT - BATHROOM - NIGHT - (LOOP B) 11   11  We are back to where we were at the beginning of the episode.  Nadia stares at herself in the mirror and washes her hands in Maxine’s bathroom. There’s a loud KNOCK at the door. Nadia turns off the faucet. Another KNOCK pounds the door. She goes for the door. Then she stops. The door is the same as it was. Still a sculptural portal. Which is still just an art piece. CLOSE ON: Nadia’s face. She registers this moment as significant. Maybe that she’s done this before? RUSSIAN DOLL #101   Pink Draft (02/20/2018)   13.",
      "characters": [],
      "action_text": "Maybe she’s concerned with what’s on the other side? With a rush of anxiety, she flings the door open. SFX. A cacophony of Sounds and Music. INT. MAXINE’S LOFT - KITCHEN - NIGHT - (LOOP B) 12   12  A few minutes later. Maxine prepares her chicken. Nadia across from her. It’s all exactly as it was before. Maxine, in the same outfit, same spirits, same actions. MAXINE Sweet Birthday Baby! Havin’ fun? Nadia takes in the scene again. JUMP CUTS: Maxine, overstimulated, distracted by GUESTS. Her chicken, a carcass. MAXINE (CONT’D) (offering a joint) It’s laced with cocaine like the Israelis do it!  NOTE : Nadia is not fully cognizant of the fact that she is seeing, feeling and hearing the same things all over again. It’s more of an uneasy feeling of deja vu. Not full recall. Nadia takes the joint from her. Looks at it. NADIA Max-- MAXINE Are you not having fun? You hate your party-- NADIA What was I just doing? MAXINE Why? What do you mean? You were in the bathroom. You mean before that? NADIA Does it ever freak you out? Partying here? In an old Yeshiva School? She hands the joint back to Maxine without smoking it. MAXINE Why would that freak me out? RUSSIAN DOLL #101   Pink Draft (02/20/2018)   14. NADIA It doesn’t bother you that this was once, I guess, a sacred place? MAXINE It’s New York. Real estate is sacred. What’s up with you? NADIA (remembers) Oatmeal. He’s gone. MAXINE Gone? No. He always comes back. NADIA Maybe he gave up. Do you think it’s possible for pets to commit suicide? Or do animals just have stronger self-preservation instincts because they don’t have souls. MAXINE (appalled; hands covered in dead chicken) Animals have souls, Nadia. Jesus. NADIA Oh, yeah? Like chickens? She exits just as Lizzy joins. MAXINE (to Nadia) Fuck you, it’s cage-free! LIZZY What’s up with the baby? MAXINE I don’t know. If nobody eats my chicken I’m going to fucking kill myself. INT. MAXINE’S LOFT - BEDROOM - NIGHT - (LOOP B) 13   13  Later. Nadia and Mike. Fish tank. Mike, in ",
      "dialogue_count": 0,
      "word_count": 3181
    },
    {
      "scene_number": 3,
      "slugline": "INT. MAXINE’S LOFT - BATHROOM - NIGHT - (LOOP C) 26   26  We are back to where we were at the beginning of the episode.  Nadia washes her hands in Maxine’s bathroom. CLOSE ON: Nadia’s face. Scared. Trying to piece together what’s going on. A loud KNOCK at the door. The same door. NADIA (to herself) You saw that cat disappear, right? She nods at her own reflection. With a rush of anxiety, she flings the door open. GUESTS file in as she exits. INT. MAXINE’S LOFT - KITCHEN - NIGHT - (LOOP C) 27   27  Moments later. Maxine prepares her chicken. Everything is the same as it was. Maxine behaves exactly as she has in past versions of this scene. Nadia enters. Less disoriented; more determined. MAXINE Sweet Birthday Baby! Havin’ fun? (offering a joint) It’s laced-- NADIA The universe is fucking with me, and I refuse to engage. (to the Universe) Do you hear me?! I WON’T DO IT! I don’t give a fuck if you disappeared my cat! MAXINE Nadia... you’re acting a little-- Nadia takes the joint, examines and does not smoke it. NADIA What’s in this joint? MAXINE It’s laced with cocaine like-- NADIA No. I’ve tried cocaine many times. It didn’t fuck me up the way this did. RUSSIAN DOLL #101   Pink Draft (02/20/2018)   28.",
      "characters": [],
      "action_text": "MAXINE But you haven’t smoked it yet... NADIA If there is a chance, any chance at all, that there is something in this joint that isn’t cocaine... I really need to know. Maxine sees this is very serious for Nadia. MAXINE It was pre-rolled by my guy. He said it was laced with cocaine. NADIA Who’s your guy? I need to talk to him. MAXINE Now I have to share my guy with you? NADIA If you’re gonna roofie me, then fuck yeah, you have to share your guy! MAXINE Come on, Nads. Stop acting like such a victim. You’re a cockroach. NADIA (shocked) I am NOT a cockroach. Don’t call me a cockroach. What does that even mean? A cockroach? MAXINE You can eat anything, take anything, do anything. It’s impossible to destroy you. You’ll never die. NADIA I’m dying constantly! OUCH! The joint burns down to Nadia’s fingers and singes her. Nadia holds up the joint and stares at it. CLOSE ON: The burn on her fingers. Fresh. Real. MAXINE Nads, if you’re gonna act like this then why don’t you just leave-- Nadia turns on her heel. RUSSIAN DOLL #101   Pink Draft (02/20/2018)   29. MAXINE (CONT’D) (180 degrees) Don’t bail on my party for you! NADIA If I’m a cockroach, then that makes you an exterminator! She grabs her coat and is gone, taking the joint with her. Maxine is upset/confused. INT. MAXINE'S LOFT - STAIRWELL - NIGHT - (LOOP C) 28   28  Mike is on the stairs, on a call. MIKE (into phone) I understand. I know. Look, I’m at a work thing. I’ll try to come over after this. Okay. I love you too-- Nadia exits Maxine’s loft and runs right into him. He saves her from falling down the stairs. MIKE (CONT’D) Whoa. You almost took us both down. NADIA Thank you. MIKE (not gracious) Be careful! NADIA Fuck you! Off Mike’s confused look... EXT. MAXINE'S LOFT - NIGHT - (LOOP C) 29   29  Nadia spills out onto the street. She’s breathing hard. New York City. Shrouded in danger. Everything is a way to die. Nadia’s usual devil-may-care attitude severely impaired by the circumstances. NADIA Be. Careful. She he",
      "dialogue_count": 0,
      "word_count": 605
    }
  ]
}