{
  "slug": "salem-101-the-vow-2014",
  "title": "salem 101 the vow",
  "genre": "thriller",
  "format": "series",
  "scenes_count": 5,
  "characters_count": 0,
  "characters": [],
  "total_words": 12069,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. PUBLIC HOUSE - LATER Smoke, dust, and piss.   A simple bar and old wood tables and in the corner a barber chair where the barber surgeon, HAROLD LAMB, shaves a drunken man.   John Alden.   He stares at the man wielding a razor over him. ALDEN I remember you.   Lamb.   My father always said you weren’t an idiot. LAMB High praise from the Sheriff. The door to the bar flies open: a tall man with fine, pale features, clutching a black book -- COTTON MATHER, 29, strides in, opens the book on the bar, and whips out an ingenious portable pen of his own invention. His hand shakes and spatters ink on the page. BARKEEP Rum, Gin, or Ale? COTTON (looking at shaking hand) Yes. The barkeep pours all three and Cotton downs them. LAMB (in Alden’s ear) Salem’s Savior, the great Cotton Mather. Cotton scrawls notes in the book as if the entire bar weren’t staring at him.   Then turns to face the room. COTTON I need three strong men. ALDEN For what? Cotton glances down at the dirty floor -- a crumpled one- sheet showing the crude print of “Mercy” the spider girl. COTTON To subdue a child. EXT. SALEM - PARSONAGE - MOMENTS LATER REV. LEWIS leads his family in prayer as Cotton strides back with Alden, a burly ANCHORSMITH, and a ruddy INDIAN SLAVE.  MALICE   Pilot - \"The Vow\" 5/5/13   15. TV Calling - For educational purposes only",
      "characters": [],
      "action_text": "HUMAN SHRIEKS -- ANIMAL NOISES from within the house. Alden looks at the second floor window, where the shadow of a child flits by.   He looks back at the Reverend and his terrified family -- all this, from a child? But then Alden notes the deep gouges around the Reverend’s bloodshot eyes. COTTON Watch out.   She goes for the eyes. SMASH CUT TO: MERCY LEWIS -- SCREAMING and LAUNCHING herself from her bed! INT. MERCY’S BEDROOM - NIGHT Cotton, Alden, and the other men try to keep the thrashing girl pinned down.   Mercy latches onto the Anchorsmith and digs her nails into his skin.   He screams in pain and terror. The other men shove her back down on the bed, where she struggles for several intense beats, then goes eerily quiet. Cotton examines Mercy.   Her face is covered with scratches, her lips bleed as if gnawed on, arms covered in bites. COTTON Mercy... who’s doing this to you? MERCY She’s... here... now. COTTON Who? MERCY The... Hag. (craning her neck) She’s standing   right there . Alden looks around the room --   nothing .   But Mercy stares in abject terror -- a terrified little girl. Mather pulls a small sachet of white powder from his pocket, mixes it into a cup of water, and brings it to Mercy. COTTON A simple physic.   To sleep. Once he’s assured she’s relaxing into sleep, he turns and quietly ushers the other men from the room -- but he’s blocked by Alden -- his very posture demands explanation.  MALICE   Pilot - \"The Vow\" 5/5/13   16. TV Calling - For educational purposes only COTTON We call it a   spectral   attack. ALDEN I call it bullshit.   She’s clearly touched in the head, and I don’t know   where   you’re touched, but -- Alden walks away in disgust.   Cotton attempts to restore his dignity, waves the others to precede him down the stairs. We remain in the darkened room, alone with sleeping Mercy. No -- not alone. Out of the dark corner beside the tall cabinet, a deeper darkness steps. LEPROUS LEGS crisscrossed with bulging varicose veins, ankles f",
      "dialogue_count": 0,
      "word_count": 1451
    },
    {
      "scene_number": 2,
      "slugline": "EXT. SALEM - MEETING HOUSE - LATER The crowds of people have fallen into tight knots, discussing, arguing, even fighting over what they heard.  ANGLE ON Alden and Giles watching this and the other signs of a community beginning to unravel. GILES Puritans know their day is passing. But nothing like a new Enemy, or better yet, a new Old Enemy, to get people behind you. Mary wheels her chair-bound husband up as Giles walks away... MARY Captain Alden.   Reverend Lewis called for a day of fasting and prayer for the recovery of his daughter.   Mister Sibley and I are hosting a small dinner to break the fast tomorrow night.   We’d be --  honored   -- if you’d join us. Alden looks into her eyes -- even after all these years, he could lose himself.   He tears his eyes from the woman who once was nearly his, to look instead at the drooling old man she married. ALDEN Don’t know about you Mister Sibley, but I haven’t the stomach for prayers -- or fasts.   But I do believe in dinner. Alden looks up from Sibley's glazed, unseeing eyes to the darkly shining eyes of Mary -- ALDEN (to Mary) -- I’ll be there. Mary stares after him, her emotions unreadable. But then we see her notice someone else -- someone also watching Alden. It’s Isaac.   Seeing he’s noticed by her, Isaac bows to Mary and hurries on his way -- while keeping a steady eye on --  MALICE   Pilot - \"The Vow\" 5/5/13   21. TV Calling - For educational purposes only",
      "characters": [],
      "action_text": "ALDEN walking across the Common, past a gaggle of CHILDREN playing a duck-duck-goose type game.   The “Witch” picks her victim with an elaborately folded paper cootie-catcher and then they all explode into raucous screams as the chase is on. It's unsettling.   And somehow as the girl playing the Witch chases the other children, they all end up encircling Alden. The Witch child shoves the folded paper into his face. WITCH CHILD You!   It’s for you! Alden takes the dirty paper from the dirtier little hand. ALDEN For me?   Who says? WITCH CHILD (giggling) Can’t tell. And as quickly as they’ve circled him, the Witch girl leads the gaggle back across the Common, leaving Alden standing in the empty Common staring at the paper. He unfolds it to find a flyer for the local Pleasure Garden,  Knocker’s Hole .   All the latest attractions.   Bear baiting and everything.   Probably just a way of drumming up business. Alden’s about to toss it when he notices the little girl staring at him from across the Common.   She grins and points her witchy finger at him. CUT TO: THICK BLONDE HAIR FALLS AWAY FROM SHEARS As a woman’s hands clip Mercy’s hair away to the scalp. INT. MERCY’S BEDROOM - DAY She’s awake and calm.   A MIDWIFE is gently shaving the girl’s head.   Almost lost in the darkness of the corner, Cotton sits with his book open on his lap, taking notes as he observes. Standing beside him, Mercy’s father shakes his head. REV. LEWIS (whispering to Cotton) Is this really necessary?  MALICE   Pilot - \"The Vow\" 5/5/13   22. TV Calling - For educational purposes only COTTON (without ceasing writing) A Witch's familiars -- demons, usually in the form of an animal. A cat.   A rat.   A bird or a toad. -- they perform all sorts of useful tasks.   As long as they’re fed... He looks up to watch the Midwife's progress as she moves from the girl’s bald head to her body. COTTON You heard what she told us.   She was forced to feed their familiars. She must be searched for the marks. Teats.  ",
      "dialogue_count": 0,
      "word_count": 5003
    },
    {
      "scene_number": 3,
      "slugline": "INT. SIBLEY MANSION - PARLOR - NIGHT Mary sits, trying not to cringe at the stains that Giles’ blood and mud-stained deerskin is leaving on her furniture. GILES I had a small farm.   First it broke my heart and then my back.   As you and I both know, the heart heals. He looks at her pointedly, earning a wintry smile. GILES But the back never do.   Took up trapping.   A meagre living.   Ruined the Indians and it’s ruining me. He pulls a small bottle from his coat pours a dollop into the tea cup.   Something menacing in his manner keeps Mary from objecting -- or interrupting. GILES Thing about trapping is, your good catch comes at night.   But by morning, it’s someone else’s meal. Me -- I stay close to my traps. MARY Fascinating Mister Corey, bu-- GILES That’s why I was there. MARY Excuse me? GILES The night you did it.   You and your Cinnamon Girl. A chilling silence.   She knows exactly what night he’s talking about. MARY You waited a long time. GILES Nobody’s business ‘til now.   But that was John Alden’s baby you buried out there. She doesn’t deny it.  MALICE   Pilot - \"The Vow\" 5/5/13   42. TV Calling - For educational purposes only",
      "characters": [],
      "action_text": "GILES The way he feels about you, he has a right to know.   Now you going to tell him?   Or am I? CUT TO: EXT. ALDEN FARM - NEXT MORNING Alden shoulders his deerskin bag, and at the edge of the road he looks back at the empty house, storing a last look. EXT. SALEM - GRAVEYARD - MORNING Moving past the gravestones -- stopping finally before a wide stone with twin sets of stone wings and two names: John and Sarah Alden. Born in the County of Essex in England and died in the town of Salem, Massachusetts.   Alden bends down over his parents’ grave.   A quiet moment as he pays his respects. Odd sounds break the moment -- SCRAPING, then BRITTLE SNAPPING, and a string of BLASPHEMOUS PROFANITY. Alden peers over a nearby tombstone to find Anne Hale -- who’s snapped a charcoal making a grave rubbing onto a large notebook.   He looks down at a rather fine, and for the day ultra-realistic, sketch of a horse. ALDEN You’re good. Anne looks up, pleased by the sight of him. ANNE Reverend Lewis says drawing is Idolatry.   Like worshipping nature or something. ALDEN There are worse things to worship. She reaches out and takes his big chin in her small hand, turning his head to catch the light. ANNE I'd like to draw you.   Especially your scar. ALDEN No time to sit for a portrait, I’m afraid.   I’m on my way out of town.  MALICE   Pilot - \"The Vow\" 5/5/13   43. TV Calling - For educational purposes only ANNE So soon?   Afraid of Witches?   Or being taken for one? Just as he feels the sweet heat radiating from Anne, Alden gives her a little smile and moves off. Anne studies him as he walks away, then gathers her broken charcoals and steps out from around the old Mausoleum -- -- only to step straight into Mary.   Anne’s startled. MARY I didn’t mean to frighten you. ANNE I wasn’t frightened.   Just surprised. MARY Yes.   Of course.   A girl brave enough to rub gravestones. ANNE I’m not afraid of death. I’m afraid of not living. MARY That’s because you know nothing of death.   And less of",
      "dialogue_count": 0,
      "word_count": 1629
    },
    {
      "scene_number": 4,
      "slugline": "EXT. DAGON WAY - LATER A dirt road off the main Old Salem Road that cuts around Mt. Dagon and skirts the deep woods.   Isaac’s in the wagon, flintlock pointed at the back of Alden’s head as he drives. ALDEN (hitting another rut) You know Isaac, the road’s seen better days, and a flintlock’s a touchy thing.   Mind putting that down or pointing it someplace less -- vital? Isaac keeps the gun trained. EXT. SALEM - SIBLEY MANSION - NIGHT Tituba opens the door even before Mary climbs the steps. TITUBA Hurry -- you’ll be late. INT. SIBLEY MANSION - MARY’S BEDROOM - MOMENTS LATER Tituba applies a salve to Mary's soft skin and daubs her lips and dips into her mouth. Tituba removes a rounded piece of wood from a velvet bag. Like a thick, short broom handle, polished smooth with years of rubbing with oils.   We don't see what Tituba does with this stick --   but it sends ripples of pleasure through Mary . Her entire body seems to be alight by a charge through her spine.   Her back arches in response to Tituba’s movements, her eyes roll back, her hair is visibly blown back by an unseen wind -- And at the peak of this orgasmic movement, in mid-writhe on the bed, mouth open, eyes wide and white, Mary freezes, without even a breath’s movement -- a living statue of herself. EXT. THE WOODS - NIGHT The old dirt road doesn’t so much end as taper down to a foot path where Isaac leads Alden on foot into the deep woods. ALDEN What are we doing here Isaac? ISAAC First time I saw them, I thought I was dreaming.  MALICE   Pilot - \"The Vow\" 5/5/13   49.  (MORE) TV Calling - For educational purposes only",
      "characters": [],
      "action_text": "So I cut myself -- to test. (shows ugly scab on palm) Weren’t no dream.   I know people think I’m touched.   Shit -- if you had a fucking F burned in your forehead you’d be a little touched too.   But I ain’t stupid.   I know things.   And I can follow the Moon and stars.   So I came back.   Night after night.   And what do you know? 28 nights later, the Dark of the Moon, same place, same time -- well, some things just got to be  seen   to be believed. These deep woods at night are dark as a cave. ALDEN Say you managed to convince me witches exist.   What makes you think I’d give a shit? ISAAC Because I know you, John Alden. And I remember -- when the whip tore into my back -- I looked out and saw your face.   No fear, no lust, not even plain relief that it wasn’t you up there.   No, all I saw in your eyes was an angry fire -- fire of Justice.   And fire like that don’t go out. Alden ignores this -- reaches his hand out and feels a tree in front of him. ALDEN If your Witches meet here, they got better night eyes than I do. Isaac crouches and waves at Alden to do the same. ISAAC They don’t need night eyes.   The night   is   their eyes.   Look at this. He beckons Alden to squat down and see -- a thick patch of strange mushrooms growing out of the black mulch of the forest floor.   These aren’t your usual mushrooms -- but cauliflower-sized excrescence of milky fungal flesh which seems to glisten a translucent oily red.  MALICE   Pilot - \"The Vow\" 5/5/13   50.  ISAAC (CONT'D) TV Calling - For educational purposes only Isaac pokes the end of the flintlock into the weird fungous and slowly pulls it out -- strands of sticky fluorescent goo connect it to the earth. ISAAC One night, I seen ‘em cover their whole naked selves in this shit. In lieu of an answer, Alden swiftly flattens Isaac’s nose with his fist and grabs the flintlock from his hand.   Isaac drops to the ground, dazed.   Before Alden can check to see if another blow is necessary -- -- he sees an approaching GLO",
      "dialogue_count": 0,
      "word_count": 1306
    },
    {
      "scene_number": 5,
      "slugline": "INT. SIBLEY MANSION - MARY’S BEDROOM - NIGHT The living statue of Mary suddenly comes alive with a sharp gush of breath.   Tituba rushes to her side. TITUBA What is it? MARY The circle was broken. TITUBA By who? Mary’s face is unreadable.   Did she see Alden? EXT. THE WOODS - CONTINUOUS Alden’s eyes adjust to the darkness and he sees he’s by the black tree -- the one with all the little   dolls   hanging form the gnarled branches. Standing beneath them now, in the flickering bonfire light, he can see them more clearly.   They are not all the same, but each unique.   A tiny patch of cloth, or some artifact to identify them -- the end of a cigar, strands of hair, etc. For a mad moment it seems this blackened tree contains little ragged dolls of all the people of Salem.   And the words of Isaac come back to him -- ISAAC (V.O.) They want Salem.   And won't stop ‘til they fixed us all. ALDEN Isaac. Alden looks around in the darkness for the driver he knocked unconscious nearby. In the fading light of the bonfire he finds him.   He’s rolled onto his stomach.   But there does seem to be some movement -- is he breathing? Alden reaches out and gently turns Isaac over -- -- but he is the human equivalent of a rotten hollowed log -- and that movement was not breath but the heaving mass of bugs, grubs, and beetles that have impossibly devoured him. CUT TO BLACK.  END OF ACT FOUR  MALICE   Pilot - \"The Vow\" 5/5/13   53. TV Calling - For educational purposes only",
      "characters": [],
      "action_text": "ACT FIVE  FADE IN: EXT. SALEM - COMMON - NIGHT In the center of town, the Witch Panic is in full-swing.   An ever-growing crowd gathers around Giles Corey, who’s been tied and staked to the ground.   Cotton Mather stands over him.   The bailiff and two militia men lift HEAVY STONES from a cart. The atmosphere is beyond tense.   Many not happy to see one of their fellow citizens dragged like a roped bull into the Common.   Others want blood.   A palpable sense of people on the edge of becoming an altogether different beast -- a mob. COTTON Please.   I don’t want to do this. GILES Then don’t. COTTON Just plead.   It’s not a difficult question.   Are you guilty or not? Giles doesn’t respond.   People are yelling insults, arguing. A small fight breaks out. CROWD  Set him free!   Hang the Witch!   You can’t make him answer!   Let ‘em go to Hell!   etc.  Cotton kneels down beside Giles -- practically   begging   him. COTTON Be reasonable, man.   I have the power to   press   you for an answer. Just say the words, guilty or not guilty.   And we can stop all this. Cotton gestures at the deadly carnival atmosphere, and the clot of stout men who stand by the pile of stones. GILES If I say I’m guilty you’ll hang me before dawn.   If I say I’m not, I throw my fate in the hands of you cocksuckers.   I’ll hold my peace and trust in the Lord.  MALICE   Pilot - \"The Vow\" 5/5/13   54. TV Calling - For educational purposes only He winks at Cotton.   And actually draws some laughs and hoots from the crowd. Cotton won’t be humiliated.   He nods to the stout men.   And the first lot of stones are placed on the board atop Giles’ grey-haired chest. Giles looks stoic, but the weight audibly forces all the breath out of him.   And must hurt like hell.   He looks to Cotton. COTTON Have you something to say? Giles nods.   Cotton bends down. GILES (defiant whisper)  More stones . EXT. SALEM HILL - NIGHT On the highest point Alden can see Salem below -- some kind of crowd in the Common.   He lo",
      "dialogue_count": 0,
      "word_count": 2680
    }
  ]
}