{
  "slug": "scary-stories-to-tell-in-the-dark-2019",
  "title": "scary stories to tell in the dark",
  "genre": "drama",
  "format": "film",
  "scenes_count": 11,
  "characters_count": 0,
  "characters": [],
  "total_words": 24242,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. MILL VALLEY - ESTABLISHING - DUSK Settled on a fork of the Yamhill River in the Pacific Northwest rests the small railway city of MILL VALLEY. All is quiet, save for the clacking of a lone train. SERIES OF OPENING SHOTS of a TOWN IN DECLINE: ON MAIN STREET Outside MILL VALLEY PAWN SHOP, an OLD TIMER lowers the AMERICAN FLAG. A RECORD SHOP next door is already BOARDED UP. Super:   MILL VALLEY, OCT 31st, 1968.  A DISK JOCKEY who sounds like he is battling throat cancer, cuts through the doleful monotony of Americana -- DISK JOCKEY (V.O.) Dig yourself out of the grave, Mill Valley, ‘cause this could be our last Halloween...  ON HOUSE A MOTHER places a JACK-O-LANTERN on her porch -- then sees her “VOTE NIXON ‘68” YARD SIGN has been vandalized. The ‘X’ has been turned into a swastika. Mortified, she removes it. ON UNFINISHED OVERPASS CONSTRUCTION WORKERS laugh as they pack up for the day beneath an unfinished SPRAWLING RAISED HIGHWAY. DISK JOCKEY (V.O.) ...When that giant monstrosity is finally built, they may as well turn the knife, cause the rest of the world is gonna pass us by... A SULLEN MAN with the name OREN embroidered on his coveralls, drifts away from the pack to load his tools in his pick-up. ON GRAVEYARD STELLA MICHAELS (15), meek with thick black specs that are easy to hide behind, reads a book (TRUE GRIT, Portis) while taking a bite of a sandwich in front of a GRAVESTONE on the anniversary of her mother’s death. DINAH B. MICHAELS Apr 8 1921 - Oct 31 1958.",
      "characters": [],
      "action_text": "DISK JOCKEY (V.O.) But you got   me . To say what I wanna say, and play what I wanna play... The Sun sets--- Stella uses an early POLAROID camera to photograph a STONE SKULL on a gravestone, then grabs her bike to leave. DISK JOCKEY (V.O.) So you be careful out there tonight - cause when the sun goes down... It’s the Season of the Witch. A plucky GUITAR RIFF begins. It’s coupled with a BLUESY BASS LINE. The slow groove of Donovan’s “Season of the Witch” as we continue our OPENING SEQUENCE: ON NEIGHBORHOOD STREET - HALLOWEEN NIGHT Cowboys, princesses and pirates collect their annual haul of sweets on a suburban street from a bygone era. A CLOSED CINEMA: On its dilapidated marquee a crumbling sign announces TH HEART IS A ONELY HUNT R. The cinema may be closed, but the street is alive: Children keep their candy bags close as -- a 68’ BLUE BONNEVILLE sulks down the street like a shark on the prowl. KURT MILNER (18) drives with a sucker in his mouth. His car filled with LETTERMANS chugging Schlitz, looking for trouble. Donovan’s swagger-filled lyrics kick in -- DONOVAN  “When I look out my window... Many sights to see....”  DEPUTY HOBBS (20s) looks out the window of his idle PATROL CRUISER. As he pets his dog TRIGGER, he motions to Kurt to keep it moving. They do. IN STEINBERG HOUSEHOLD - LIVING ROOM / LOWBORN BATHROOM THE STEINBERGS (married, bored, him yawning, her, sewing a costume) watch TV. ON it: Nixon. NIXON (ON TV) I'll take only a minute. I had a very good briefing by Secretary Rusk this morning up at New York.  (MORE)  2. And then I just went over and had a half hour with the General and he’s- it’s the longest visit he had. He just looks great. ALICE STEINBERG (17) cruises by in a slip and her bouffant already done up, carrying swaths of fabric. She heads upstairs and goes by -- The bathroom -- Then does a double take, retraces her steps: There. Kneeling before the toilet, is CHUCK STEINBERG (14), a scamp with a large mouth that looks ill-placed on his unusuall",
      "dialogue_count": 0,
      "word_count": 4698
    },
    {
      "scene_number": 2,
      "slugline": "INT. LIBRARY - BELLOWS ESTATE - CONTINUOUS Chuck and Auggie enter the expansive library to find Stella and Ramón - with an ALCARAZ RUG pulled back, standing over -- A CELLAR HATCH hidden in the floor. The lines of where a rug used to lay framed around it. A SLIDING BOLT locks it. RAMÓN It doesn’t look like it’s ever been opened. CHUCK Maybe where they buried the bodies. Stella stares at the hatch -   only one way to find out.  CUT TO: BLACK. The sound of the bolt unlocks, and the hatch door opens. Moonlight floods in, revealing AN OLD STAIRCASE and the four teens framed within the hatch opening in wonderment. INT. BASEMENT ROOM - CONTINUOUS Ramón is brave enough to lead them down. He finds an OIL LAMP, lights a match to ignite it. A warm glow reveals -- A YOUNG GIRL’S BEDROOM kept preserved like a time capsule. Fine, deco furnishings. A vanity sink and mirror. A quilted bed covered in worn dolls and dust. STELLA It’s Sarah’s bedroom... RAMÓN What kind of family would lock up their own daughter? AUGGIE This room’s for a little kid. I thought Sarah was our age? STELLA (catching on) She was... But her body was the size of an adult -- larger even... Auggie picks up an antique EFFANBEE DOLL. 23.",
      "characters": [],
      "action_text": "STELLA (CONT’D) Her mind was simple -- maybe too simple. Stella sits behind the vanity, trying to imagine being in her place. Personal items still perfectly placed. She puts on Sarah’s slippers. A perfect fit. Disturbed, she quickly removes her feet. STELLA (CONT’D) This is a real person. This isn’t fun anymore. AUGGIE Yeah. Let’s get outta here. As soon as they head toward the stairs --  BOOM!!!   THE HATCH SLAMS CLOSED. THEY SCREAM! Auggie and Ramón try to open it! RAMÓN Someone locked us in! CHUCK IT’S THE WITCH! WE’RE ALL GONNA DIE!!! AUGGIE I can’t open it! But then - familiar LAUGHTER can be heard, coming from -- IN THE LIBRARY It’s Dick Breath, holding a baseball bat, drunk and savoring. Behind him is Alice, her comely dress wasted on the occasion. ALICE Kurt, they’re scared. Let them out. IN THE BASEMENT ROOM CHUCK Alice?! Is that you?! AUGGIE I nearly shit my clown pants. RAMÓN You mean,   Pierrot . 24. TEENS Let us out!/Not cool!/C’mon, Kurt! IN THE LIBRARY Alice shivers, not liking this place one bit. ALICE Joke’s over. If you don’t open it, I’m going to tell your father. Kurt’s sadistic laughter fades. KURT Now why would you do that? Alice is caught in his uncomfortable gaze. ALICE It’s my little brother. Kurt takes a pull from a flask. KURT Fine. Go ahead. Seeing he won’t help, Alice heaves open the hatch. But -- Kurt KICKS her down onto the others, then LOCKS the hatch. KURT (CONT’D) If you’re not putting out, you’re no better than the other trash! IN THE BASEMENT ROOM Alice falls into Auggie’s eager arms. IN THE LIBRARY Kurt wipes whisky from his sweaty grin. TEENS (O.S.) You can’t leave us here!/They’re gonna blow up the house! KURT Then I hope you find a way out. TEENS C’mon, jokes over!/Let us out!/ You’re subhuman, Kurt! Suddenly, TINKERING NOTES come back to life -- 25. Kurt sees the MUSIC BOX sitting upon a derelict book shelf. He stares at the box, a bit spooked. He downs his flask, then SMASHES it into pieces with his baseball bat. EXT. BELLOW",
      "dialogue_count": 0,
      "word_count": 1421
    },
    {
      "scene_number": 3,
      "slugline": "EXT. MILNER FARMSTEAD - NIGHT - SAME TIME Kurt’s Bonneville drives onto his family’s sprawling property with a FARM HOUSE and BARN in the back. Distant CORNFIELDS. Drunk, he staggers out of his car and chucks his beer can at a SCARECROW made from old sacks and stuffed with straw. KURT Eat shit, Harold. ‘Harold’ is pelted in its burlap face, a crooked scowl permanently stitched on. A pile of spent beer cans below. Kurt stumbles to his house -- he’s startled by MRS. MILNER, barking from the front door in a robe and sour face. MRS. MILNER It’s late. KURT It’s Halloween. MRS. MILNER You were supposed to feed the chickens. KURT It’s Brett’s turn. MRS. MILNER Do it before your father gets home. He flippantly saunters toward the barn, kicking a chicken. He fails to notice - the pole where Harold was hung is now bare. INT. BARN - MILNER FARMSTEAD - MOMENTS LATER Kurt sets down a tin bucket filled with water. CLOSE ON: The WATER BUCKET. As the surface of the water stills... the faint REFLECTION OF SARAH BELLOWS. A bag of CHICKEN FEED is RIPPED open. Kurt haphazardly spills some on top of the hungry chickens gathering at his feet. KURT Eat up. Get nice and fat. He gets disturbed at the carcass of a dead chicken, pecked to death by its own. 30.",
      "characters": [],
      "action_text": "The wind picks up outside, creating a faint HOWLING through the slats in the barn walls. The CAWING of crows. Kurt perks up. Thinking it was nothing, he returns to feeding the chickens when he sees -- A FIGURE standing between the barn doors. Kurt squints to see -- It’s the scarecrow standing upright. HAROLD takes an unnatural step forward, jerky. Kurt nearly trips over the chickens. KURT (CONT’D) The hell?! -- The chickens peck at Kurt’s feet, but he doesn’t notice. He’s fixed on the WALKING MAN OF HAY before him. Harold LURCHES closer. Kurt runs -- enters... INT. STABLES - NIGHT A MAZE of stables. He runs- desperate- scared- He hides, panting. A creak is heard- he peeks- Harold is coming. Kurt sprints. Scared, he falls onto his ass. Right next to a PITCHFORK. KURT Whoever’s in there, you’re gonna pay for this! Kurt WHACKS Harold with the pitchfork! The scarecrow FALLS LIMP to the ground with a GRUNT. He stands over the scarecrow, trying to see who is hiding behind the hay. But there is no one, only a sinking feeling. Harold REACHES for Kurt, who CRIES OUT while violently STABBING the scarecrow with the pitchfork. RIPPING out its straw intestines, BEATING the living hay out of it. Harold is completely TORN TO PIECES. Kurt stands over it, heaving, victorious -- but confused as to what this thing is. 31. KURT (CONT’D) Mom?! MOM?!-- He CHOKES on something. Airway obstructed. He COUGHS up some hay, struggling for air. He tries to call for help, but no words come out -- only hay. EXT. BARN - MILNER FARMSTEAD - CONTINUOUS Kurt charges out of the barn, turning blue with asphyxiation. He runs through the cornfield -- His eyes bulge as he witnesses hay coming out of his sleeves and pants. Straw lengthens from his ears, nose and eyes. He trembles to find the skin on his hand drying, like burlap. He falls as straw grows from every part of him. He reaches out to his home and releases a final muffled scream... Only for hay to silently explode from his mouth! And he stops- froze",
      "dialogue_count": 0,
      "word_count": 2205
    },
    {
      "scene_number": 4,
      "slugline": "INT. THE HALLWAY - THE MORALES HOUSE - CONTINUOUS The house is bare with moving boxes stacked about. Ramón inspects the Book in disbelief. RAMÓN How is this possible? Frightened, Stella shakes her head. STELLA There’s a new story. With Chuck’s name in it. RAMÓN Do you want me to drive? STELLA There’s no time. I need your phone. As Stella barges in, Ramón opens the Book to see for himself-- RAMÓN Kitchen. CLOSE ON BOOK: The next story is entitled   “The Big Toe” . Ramón lifts his thumb from the page to find INK PRINT. RAMÓN (CONT’D) The ink’s still wet... STELLA (defensive) I   didn’t   write it. RAMÓN I didn’t say you did. Stella passes the FAMILY ROOM, she catches a glimpse of - RAMÓN’S FATHER. His ear is burned off. His face disfigured. He meets Stella’s glance as she has trouble looking away. Then, she quickly moves on. KITCHEN As Stella rushes to dial Chuck’s number, Ramón quickly reads the ‘The Big Toe’. 41.",
      "characters": [],
      "action_text": "RAMÓN (CONT’D) “ One day, Mrs. Steinberg was digging in her garden, when she saw a big toe sticking out of the ground. She tried to pick it up but it was stuck. So she pulled as hard as she could and it came off in her hand... ” (confused) What the hell is this? This story is gross. Stella gets a busy signal ringing on the other end. STELLA Keep reading. She hangs up and tries again. STELLA (CONT’D) Come on, pick up. RAMÓN (reading) “ ’That looks like a nice piece of meat’, she said. ‘I’ll put it in the loaf and we’ll have it for... dinner’ ”? INT. KITCHEN - THE STEINBERG HOME - SAME TIME Chuck cradles the phone on his shoulder, talking to his mother on the other end, while trying to find something to eat in the kitchen. Shelves are bare. CHUCK (into phone) What leftovers, ma? I don’t see anything. Chuck opens the fridge to discover -- a gleaming MEATLOAF. CHUCK (CONT’D) (into phone) Mmm. My favorite. Thanks. I’ll see you when you get home. Chuck hangs up, and moves the meatloaf to the counter. CHUCK (CONT’D) (licking lips) Meat is back on the table. 42. He fetches a fork and plunges it into the moist loaf. To the trained eye, we see what looks like a HUMAN TOE baked in. Starving, Chuck mows down. Mashing sinewy meat in his mouth. The kitchen phone rings. He stuffs in another mouthful before grabbing the receiver. CHUCK (CONT’D) (into phone) What is it now. -- I’m eating, ma. STELLA (PHONE) CHUCK?! CHUCK Stella? STELLA (PHONE) DON’T EAT ANYTHING! CHUCK Why? I’m starving. My mom made a -- STELLA (PHONE) You’re in the next story. Listen to me. Don’t eat the meat. CHUCK What are you talking about? We got rid of the book. STELLA (PHONE) DON’T EAT THE MEAT! Chuck’s chewing slows as he eyes the loaf of minced meat. He bites on something hard, then pulls from his mouth... A large, rotted human TOE NAIL. STELLA (PHONE) (CONT’D) Chuck?... CHUCK?! Chuck gags, trying not to hurl. He flushes his mouth under the faucet, then gets back on the phone. CHUCK ...What happens in my st",
      "dialogue_count": 0,
      "word_count": 1387
    },
    {
      "scene_number": 5,
      "slugline": "EXT. BELLOWS ESTATE - LATER The Corvair Monza parks in front of the gate leading to the Bellow’s Estate. As soon as they get out --  KRA-KOOOOM!!!   The explosives go off atop the hill, releasing a shower of wood, plaster and bricks. It’s ear-shattering. Surprised, they quickly race up the long driveway -- AUGGIE No no no no noooo! EXT. BELLOWS ESTATE - MOMENTS LATER Stella, Ramón, Auggie and Alice stand before what’s left of the Bellows Mansion. A backhoe compresses down on a remaining awning until it buckles. Wood splinters. Glass breaks. A gaping hole left in the dead carcass of a house. RAMÓN There goes the answers. Bulldozers plow debris, while a FOREMAN wears a hard hat, directing a digger and crane raising a dug up COFFIN. FOREMAN Careful... careful... He unshackles it. Then gives the hand signal for the crane operator to fetch the next one. He notices the teens -- FOREMAN (CONT’D) You shouldn’t be here. This is no place for kids. Stella is mesmerized by the crew raising another casket. As it pans over heads, the worm-eaten coffin crumbles, prying loose from its binds -- DEMOLITION CREW (O.C.)  WATCH OUT! SHE’S COMING APART --  The coffin falls. A Worker dives out of the way just as the casket shatters to pieces on the ground, releasing - A CORPSE, dressed in a rotten white gown and a wide GREEN RIBBON around her neck. The skull rolls off, detaching from the body. It was the ribbon holding it on. Alice screams. AUGGIE The green ribbon -- the woman Chuck saw. 49.",
      "characters": [],
      "action_text": "ALICE How? She’s been dead over 40 years. FOREMAN You gotta get outta here. This is no place for kids. The Foreman returns to his crew as they solemnly head back down the long driveway. ALICE Is there another Haunted House? Why would the last chapter say ‘Haunted House’ if it’s gone? RAMÓN You said Sarah vanished. To where? (mind racing) Maybe if we find her remains, we can lay them to rest... give her a proper burial. AUGGIE This isn’t a movie, dork. HOLD ON A glint of something OS catches Stella’s eye. Then the TINKERING of a familiar childlike-melody. RAMÓN (O.S.) I didn’t say it was. Stella lowers to some construction debris where sits the MUSIC BOX that was destroyed, rebuilt in perfect order. Stella picks it up, intrigued. AUGGIE (O.S.) Then let’s start digging. How ‘bout this? I’ll take these 100 acres. You got those 100 acres. I’m sure Alice is good with a shovel. RAMÓN (O.S.) You don’t need to be a dick about it. I’m just trying to help. AUGGIE (O.S.) Help? I’m trying to   live . She studies the Music Box. Stella turns it over and finds it is engraved with the name -- “ELOISE W”. 50. STELLA You say they died 40 years ago? AUGGIE Yeah. Why? STELLA Maybe there was someone in that house that’s still alive? EXT. SUNNYHAVEN NURSING HOME - AFTERNOON The Corvair Monza pulls into the Sunnyhaven Nursing Home parking lot that looks neither sunny nor a haven. AUGGIE (O.C.) There’s two places dead people go to in this town. The cemetery, and Sunnyhaven. ALICE (O.C.) The caretaker told me they didn’t have anyone named Eloise, but they do have a LouLou Walker that fits the bill. They exit the car, taking in the dreary nursing home. INT. SUNNYHAVEN NURSING HOME - MOMENTS LATER Three old bedridden elderly men share a room with only one window. A CHEERFUL MAN rests closest to the window, while TWO CANTANKEROUS BED MATES are not privileged to enjoy the view. CANTANKEROUS BED MATE #1 How does it look out there today, George? CANTANKEROUS BED MATE #2 What do you see? CHEERFUL ",
      "dialogue_count": 0,
      "word_count": 2458
    },
    {
      "scene_number": 6,
      "slugline": "INT. HALLWAY - LIBRARY - CONTINUOUS The three skid on the linoleum, looking for the washroom! AUGGIE ALICE?!! INT. WASHROOM - LIBRARY - SAME TIME Alice enters the washroom alone. She goes to the mirror to inspect the largest zit ever seen in the history of cinema. Red and raw. She touches the pimple, but it hurts so bad. It must be popped. She turns on the hot water, steaming. Then wets a paper towel to gently compress it. When she leans back down to soak her towel... SARAH BELLOWS is in the mirror’s reflection. Wet and smiling, with the crazed, simple face of a child. INT. HALLWAY - LIBRARY - SAME TIME Stella, Ramón and Auggie charge down the hallway toward a door labeled WOMEN. Auggie hesitates for the briefest of moments -- then BUSTS in. AUGGIE Alice! INT. WOMEN’S WASHROOM - LIBRARY - CONTINUOUS They come to a stop.... It’s empty. Panic on their faces. STELLA There must be another washroom... INT. HALLWAY - LIBRARY - CONTINUOUS The three charge back out, lost and confused. Stella finds a simple MAP PLAQUE on the wall by some stairs. STELLA Upstairs! They follow Auggie up the stairs, two steps at a time. 61.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 204
    },
    {
      "scene_number": 7,
      "slugline": "INT. WASHROOM - LIBRARY - SAME TIME Alice gets a closer look at the pimple when - it almost looks like SOMETHING moved inside it. Her heart stops. She wipes the mirror and inspects it closer. Again, something moves just under the skin... Suddenly, an ingrown BLACK HAIR pokes out...   Ugh gross ... INT. WOMEN’S WASHROOM - SECOND FLOOR - SAME TIME Stella, Ramón and Auggie explode into the second floor washroom. But Alice isn’t there. Only a CUSTODIAN. STELLA WHERE IS SHE?!! Auggie eyes a STAFF NAME TAG on the custodian, then urgently: AUGGIE IS THERE A STAFF WASHROOM?! Before he can answer -- INT. STAFF WASHROOM - LIBRARY - SAME TIME Disgusted, Alice inspects the short black hair sticking out of her boil. She delicately tugs on it - trying to remove the ingrown hair, only for - The hair TWITCHES, as if alive. That’s no hair, it’s a leg. Alice SCREAMS and places her hand over the pimple, just as - A SWARM OF BABY SPIDERS escape through her fingers, spreading across her face!!! SHE SCREAMS BLOODY MURDER! Alice takes her hand off her face. An endless stream of tiny spiders crawl out of her pimple. The more she claws away, the faster they come out. The Librarian enters to see Alice bristled with creepy crawlies. Alice reaches out for help amidst her thrashing, but the scared librarian only runs away. ALICE AAAAAAAAAAAAAAAAGGHHHH!!!!! 62.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 238
    },
    {
      "scene_number": 8,
      "slugline": "INT. LIBRARY - FRONT DESK Auggie, Stella and Ramón plow past the startled Librarian -- RAMÓN OUTTA THE WAY! MOVE! INT. STAFF WASHROOM - LIBRARY - CONTINUOUS They enter to find -- A LARGE BLACK MASS WRITHING and SCREAMING in the corner. A vast majority of Alice is covered in spiders as they spread across the floor like WRIGGLY OOZE! Auggie and Stella instantly take off their jackets and swat them away. But there’s too many. Ramón RUNS OUT into the HALLWAY -- and sees a bucket of mop water. Thinking quick, he picks it up and RACES BACK INTO THE BATHROOM -- He drenches Alice, washing the remaining spiders away. Stella can only watch as Auggie drops to the floor to cradle Alice, left catatonic. Her skin pock-marked with bites. Stunned patrons crowd the door, staring. Alice twitches in Auggie’s arms, unable to cope. She’s alive, but not well. AUGGIE HELP! SOMEONE GET HELP! The crowd doesn’t move. STELLA CALL AN AMBULANCE!!! A concerned patron runs off. Auggie rocks Alice, stroking her hair, trying to calm her. She mutters, unaware of her surroundings. ALICE  ... They’re all over me. Get them off. Get them off...  AUGGIE It’s okay. You’re going to be okay. Alice’s eyes flutter open. Lost and confused. 63.",
      "characters": [],
      "action_text": "ALICE  ... My dress. It’s ripped. I can’t go out like this...  AUGGIE It’s a nice dress, Alice... Don’t worry, you look just fine... Auggie looks to Stella, his eyes filled with sorrow. DISSOLVE TO: EXT. MILL VALLEY PUBLIC LIBRARY - LATER THAT NIGHT Lights flash as paramedics roll Alice’s gurney into the waiting ambulance for ‘Riverwell Psychiatric Hospital’. AT AMBULANCE Sickly, Alice stutters. Unable to cope. ALICE I saw her in the mirror. I saw her in the mirror. The paramedics shake their heads. She’s a lost cause. OUTSIDE AMBULANCE Mrs. Steinberg stifles herself with tissue as her husband is in a heated exchange with Deputy Hobbs. MR. STEINBERG Jesus Christ, Tom! You haven’t even found my son   and now this? ! DEPUTY HOBBS We’re doing everything we can. MRS. STEINBERG Where’s Roy? Why isn’t the Sheriff talking to us? DEPUTY HOBBS He just found his son’s corpse, Darlene. You might want to give him some space. Mrs. Steinberg breaks down into hysterics. Mr. Steinberg stares at the Deputy --   how can you be so cruel?  64. DEPUTY HOBBS (CONT’D) I’m sorry, we’re all on edge. All I can say at this time is we have a warrant out for all of their arrests. We’ll figure this out. Deputy Hobbs eyes the Corvair Monza, knowing Ramón has to return for it eventually. A FEW BLOCKS AWAY Ramón nervously lights a cigarette as Auggie watches from afar, keeping their distance. Stella’s on a bench, staring at ‘The Red Spot’. She looks up with tears in her eyes -- STELLA Alice   dies   at the end of her story. (desperate to others) But she’s not dead. We saved her. We saved her, right? AUGGIE There’s no coming back from that.  She doesn’t even know her name.  (despondent) And now they think we’re all responsible. RAMÓN No, they think I am. Ramón flicks the butt of his cig then takes off his jacket. RAMÓN (CONT’D) Fuck it. I’m turning myself in. STELLA/AUGGIE What? / Why?! RAMÓN To tell them you’ve got nothing to do with this. STELLA Neither do you. What good will that do anyone? RAMÓN",
      "dialogue_count": 0,
      "word_count": 2852
    },
    {
      "scene_number": 9,
      "slugline": "INT. ELEVATOR - RIVERWELL PSYCHIATRIC - SAME TIME Stella and Ramón wheel Auggie onto an empty elevator. They push the 3rd floor button. Just as the doors close - A MEATY HAND JUTS IN, allowing an ORDERLY to enter. ORDERLY I think you want the fifth floor. Brown gown,   fifth floor . He hits the 5th floor button for them. They smile. The Orderly eyes Auggie, giving him a quizzical once over. The elevator is unusually quiet on their way up. Then --  Ding.  INT. FIFTH FLOOR - RIVERWELL PSYCHIATRIC - MOMENTS LATER The doors open to the sound of strange moaning and erratic screams. The occasion banging. The Orderly holds the door open so Stella and Ramón can push Auggie out, though they are unsure where they’ve been taken. ORDERLY Be well, big fella. He gives a warm smile, then the elevator seals behind them. REVERSE Mental patients guzzle pills and struggle to cope. All in hazel scrubs. STELLA You’re conscious. Not crazy, right? Auggie frantically looks around, ultra-sensitive to his surroundings. The walls and linoleum are all a stark white. AUGGIE At least there’s no red. With the coast clear, they wheel Auggie further into the restricted portion of the hospital. RAMÓN Don’t worry. We’ll make this quick. They duck down a hallway, keeping out of the orderlies sight. 77.",
      "characters": [],
      "action_text": "They pass windows, where -- a patient pulls clumps of hair from his scalp... Another patient screams from behind glass: MENTAL PATIENT #1 I don’t want the drum. I promise to be good. I want my mommy back. MENTAL PATIENT #2 Wait till Martin comes! They pass drugged patients sleeping in a room. They quickly wheel inside. INT. PATIENT ROOM - CONTINUOUS The patients are too doped up to notice as the three go to a window and spot the rotting rooftop of the old sanitarium two floors below. Auggie hops out of the wheelchair. AUGGIE I’ll keep watch. Auggie guards the open doorway, on the lookout. Stella and Ramón open the large window, judging the distance. RAMÓN A little high. If the book doesn’t kill us, the jump might. Quick thinking, Stella pulls a stained SPRING MATTRESS off an empty bed, dragging it to the window. RAMÓN(CONT’D) Good thinking. They throw the mattress over the divide. It drops down until landing in a plume of dust on the roof, two stories below. STELLA You think we can make it? Ramón judges the distance, then carefully throws the Book down in a test run... It misses the mattress,   by a lot.  Stella throws Ramón a look -   seriously ? RAMÓN Ladies first? STELLA We go together. 78. AUGGIE Just make it quick, will ya? A drugged patient wakes up. He points to Auggie, moaning. AUGGIE POV: Down the corridor, the elevator opens with the Orderlies, Reception Nurse, and Deputy Hobbs. AUGGIE (CONT’D) Shit. The fuzz. Hurry.   Hurry.  Ramón climbs out onto the ledge and helps Stella out. A five story fall onto a sidewalk if they don’t make the jump. Stella looks back at Auggie. STELLA Catch ya later. AUGGIE Not if ya catch a disease. Now all of the drugged patients have awoken, making an incredible racket, sure to draw attention. Ramón holds Stella’s hand tight. RAMÓN Together? STELLA Together. AUGGIE (whispers) Go, go, go -- ! Outside, the Deputy and staff are about to pass the room -- ON THE LEDGE SLOW MOTION: Stella and Ramón JUMP together... Sneakers kicking i",
      "dialogue_count": 0,
      "word_count": 2341
    },
    {
      "scene_number": 10,
      "slugline": "INT. DREAM CORRIDORS - RIVERWELL PSYCHIATRIC - SAME TIME Auggie’s elevator door opens, but it’s occupied by ORDERLIES. The klaxons instantly shut off and the hallway returns white. More importantly, SARAH HAS DISAPPEARED. Auggie trembles in fright, confused. AUGGIE The witch... she was just here! The Orderlies suspiciously eye him in his red patient gown. AUGGIE (CONT’D) She almost got me! T-the room was red, and... (catches on) ... No, no, it’s not what you think. They firmly grab hold of him. AUGGIE (CONT’D) No wait! I don’t belong here! I snuck in. I’m not crazy! ORDERLY Sure. Sure you aren’t. AUGGIE NO! PLEASE! I’M NOT CRAZY!!! I’M CONSCIOUS!! THE RED ROOM! IT WAS THE WITCH!!! IT WAS SARAH BELLOWS! The Orderlies drag Auggie away behind two doors that read: ELECTROCONVULSIVE SHOCK THERAPY. INT. SHOCK THERAPY - RIVERWELL PSYCHIATRIC -   MOMENTS LATER The Orderlies strap Auggie into a STRAIGHT JACKET. AUGGIE Please. I-I’m not crazy -- They restrain Auggie down onto a gurney. AUGGIE (CONT’D) I don’t want this to be the way it ends... I SHOULD’VE READ... I SHOULD’VE READ... RED... EVERYTHING’S RED...! 88.",
      "characters": [],
      "action_text": "They shut him up by a wooden handle between his teeth. Auggie lets out a muffled SCREAM as they begin strapping electrodes to his temples. He shakes his head, unable to stop it. The electroshock machines charge up with electricity. INT. FIRST FLOOR - RIVERWELL PSYCHIATRIC - SAME TIME Stella and Ramón are distraught as their handcuffed when --  BZZZZZZZ   - The lights FLICKER as a surge of power is felt throughout the hospital. Along with Auggie’s distant SCREAM. TIME SLOWS AS Ramón withers, deeply devastated. Stella releases a long, ANGUISHED SCREAM. She falls upon her knees as the Deputy restrains her. Stella is laid to waste. CUT TO: INT. DETENTION CELLS - MILL VALLEY POLICE - LATER THAT NIGHT  CLANG!   An old JAIL DOOR is slammed shut on Stella. Ramón is in his own cell, sharing a wall of bars between them. The room is bare, save for a fireplace and a folding chair. Deputy Hobbs locks up. RAMÓN You don’t understand. We’re innocent! The Book is cursed, man! DEPUTY HOBBS Sure it is. While Ramón fights for his life, Stella slumps in a corner. RAMÓN At least give us the book before it’s too late! If we could save Alice, we can save ourselves! DEPUTY HOBBS You didn’t hear? Alice died on the way to the hospital. Ramón pales. Stella scoffs - despondent. 89. DEPUTY HOBBS (CONT’D) Whatever you guys are into, I’d start telling the truth. Cause someone’s gotta pay. RAMÓN We ARE telling the truth! Deputy Hobbs leaves as their pleas fall on deaf ears, taking the Book with him. Ramón falls to the ground. Defeated. STELLA (numb) They don’t believe us... just like they didn’t believe Sarah. Alice died... just like the story said. Whatever’s written, comes true. RAMÓN So the son of a war hero, dies a two-bit hood. STELLA I don’t think-- RAMÓN It doesn’t matter what you think. It’s the stories you leave behind. What people believe... It’s all stories... They come up with the right lies and we go to war -- they say the freeway will bring progress and it kills the town. He hits his ",
      "dialogue_count": 0,
      "word_count": 2071
    },
    {
      "scene_number": 11,
      "slugline": "INT. MAIN OFFICE - POLICE STATION - SAME Before they race out of the main office -- Stella breaks her grip with Ramón... to retrieve the Bellows Book. EXT. MILL VALLEY POLICE STATION - NIGHT - CONTINUOUS Ramón opens the squad car, but it’s locked. Stella anxious. TRIGGER jumps on the hood of the car, SNARLING. They YELL! The SARAH BELLOWS’ CORPSE stumbles her way towards them! Suddenly, a POLICE CRUISER barrels into Sarah! She EXPLODES and rains down in body parts. A window lowers, revealing - SHERIFF MILNER. Looking spooked. SHERIFF MILNER Get in! Stella and Ramón dive into the car, closing the door just as Trigger attacks, clawing at the window. Milner can’t take his eyes off the body parts on the street ahead, flopping on the pavement. Some begin to rejoin, slowly rebuilding back into a rotted Sarah. CLOSE ON Her head rolls to a stop, SCREECHING a deafening SCREAM! The cruiser’s wheels kick up dirt and peel off. INT. SHERIFF CRUISER - DRIVING - NIGHT As Sheriff Milner drives, Stella and Ramón gasp in relief. They know they were saved from an inch of their lives. Ramón clings to the mesh screen dividing them. RAMÓN Thank you, thank you, THANK YOU! SHERIFF MILNER What the hell was that? RAMÓN You saw it too? Thank GOD you saw it! You finally believe us. 97.",
      "characters": [],
      "action_text": "STELLA That’s what killed your son. And will kill us too unless we get as far away from here as possible... Stella starts to read the rest of ‘Me Tie Dough-ty Walker’. STELLA (CONT’D) The stories. There’s no way to stop them once they’ve been written. SHERIFF MILNER That was Sarah Bellows? Ramón has never heard sweeter words. RAMÓN You even know her name?! I love you, man. I love the law! Just drive, man. Open her up. (to Stella) How do I die in the end? Stella finishes reading to herself, then mournfully looks up. RAMÓN (CONT’D) It’s okay... I can handle it. I’d rather know. She catches the Sheriff’s cold glance in the rearview mirror. STELLA He shoots you. Milner drives coolly, never taking his eyes off the road. RAMÓN (incredulous) What? You’ve got to be kidding me. STELLA His father... he was the doctor in charge at the hospital. He helped the Bellows cover it up. The CB radio sparks up. An out of jurisdiction DISPATCHER. DISPATCHER (O.S.) Sheriff, we’re getting an unusual amount of calls. Are you picking up the phone-- The Sheriff clicks off his CB. They drive in eerie silence. 98. SHERIFF MILNER You just had to go into that damn house. They try to force their doors open, to no avail. OUTSIDE CRUISER As the cruiser drives down a deserted highway... Stella and Ramón claw at the doors and window -- kicking and screaming -- but their muffled cries for help go unnoticed. EXT. BELLOWS ESTATE - NIGHT - LATER The Sheriff’s cruiser passes through the property gates and crosses a small bridge over a dry riverbed, winding up the hill to where the Bellows mansion once stood. The entire estate has been razed down to dirt and debris, except for the brittle remains of the dual chimney stacks. EXT. BELLOWS DAM - NIGHT - LATER The cruiser has parked beside a dry riverbed and a small MASONRY ARCH-WALL DAM. Beyond it, the remains of a river along with rusty iron frames, chloridized leeching tanks, and drain boxes make up the derelict rail yard. Headlights illuminate the dam, whe",
      "dialogue_count": 0,
      "word_count": 4367
    }
  ]
}