{
  "slug": "serenity-2019",
  "title": "serenity",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 4,
  "characters_count": 0,
  "characters": [],
  "total_words": 26859,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. CARIBBEAN, OCEAN - DAY It is another perfect day in paradise. A flat ocean is an empty blue page apart from a single white dot.   We move across the water toward the dot and see a tuna fishing boat at anchor with outriggers loaded and lines in the water. As we approach we see the name of the boat is ‘Serenity’ out of Plymouth Island.   We board the boat and find hot, woozy silence, apart from a beer bottle that rolls very, very slowly with the almost nonexistent swell. This is a boat that is waiting for fate to take a hand, waiting for the moment of ecstasy, the moment when a big fat blue fin tuna takes the bait and all hell will break loose. Until then, this is a time out of time, when nothing happens and nothing matters apart from the line, the hook and the fish. A hook and knife scarred tattooed hand picks up the rolling bottle and drops it in a trash bucket with some anger.   We rise from the hand to discover the men aboard the Serenity. The scarred hand belongs to the skipper of the vessel, BAKER DILL.   He is late thirties, a creature of the ocean, half crusted in salt and dressed in rolled up chinos and a T shirt bleached by a thousand voyages.   His hair is dressed by the ocean and the wind. He is taking the silence and the lack of a bite personally and he’s getting madder with every silent tick of the clock. He gets a calming glance from his first mate, DUKE.   Duke is a man of every race mixed and is greying into his fiftieth year.   He will become a fish one day and he knows the ocean even better than Baker Dill. Duke glances up at a Frigate bird which is circling over head.   The frigate is a giant, prehistoric looking sea bird that soars above the ocean on warm air currents, flapping its wings maybe twice a day.   It is the spirit of the ocean and is made out of time.   Fishermen know that where the frigate circles there will be mackerel and jacks, and where there are mackerel and jacks, there should be tuna. That’s the theory.... In response to the bird, Duke goes to tighten a line. As we follow him we find two AMERICAN TOURISTS, both fast asleep in the game fishing chairs which are bolted side-by-side to the deck.   The chairs have seat belts to prevent the fisherman being pulled into the ocean.   The seat belts are unbuckled and dangle, swaying gently.",
      "characters": [],
      "action_text": "The two sleeping tourists are dressed in shorts and tennis shoes and T shirts with logos that read ‘ Drink beer, catch fish ’.   They both have beer cans in the metal sleeves meant for the rods and we guess from all the empties in the trash they have drunk themselves to sleep. The two men, ( RON and APE)   are of no consequence to Baker Dill as they slowly turn crimson in their sleep under the burning sun.   Baker Dill steps around their big feet to squint into the glare of the ocean, as if by looking and praying he can summon the fish. Duke glances at the tourists.... DUKE Dill, you think we should wake them and tell them to spray some more lotion? Dill doesn’t even register the concern over two burning tourists.   He gestures at the ocean and Duke comes close. There is a log floating in the water.   Duke half smiles. Dill tenses just a little and looks up to his outrigger snaps on either side of the boat. Duke turns to the tourists.... DUKE (CONT’D) Guys?   Guys. We got a log floating. Ron and Ape are between drunk and hung-over and thirsty as hell as they stir. RON Got a what? DUKE We got a frigate bird in the air and a log in the water. Both mean tuna near... Dill hears the word ‘tuna’ like a bullet in his back.   We should sense Duke just broke some superstitious rule and silently Dill curses him and, silently, Duke tells him to go to hell. They are like a married couple with their use of silence. DUKE (CONT’D) Also, maybe you should put on a little more lotion. The log has galvanized Dill and he skips back around the tourists toward the cabin.... APE ...Chance of another cold beer Captain?...  Serenity   -   Steven   Knight   -   June   29th   2016   2 . Dill has gone up to... INT. SERENITY, CAPTAINS WHEELHOUSE, DILLS PRIVATE WORLD Dill lights a cigarette without interrupting his process of starting the engine, spinning the capstan and shifting a big gear stick to get the boat chugging forward.   The exhaust coughs black smoke.   This boat needs a service. The",
      "dialogue_count": 0,
      "word_count": 4171
    },
    {
      "scene_number": 2,
      "slugline": "INT. DILL’S SHACK, BEDROOM Dill lies on his bed and smokes, looking at the ceiling, thinking about just one thing. The fish. On the air we hear the gentle industry of a tuna cannery. Dill stubs his cigarette and closes his eyes. EXT. SERENITY, BLEACHED OUT OCEAN In colors that almost blind us we see the boat in shimmering water.   Two rods are out and we see Dill in silhouette against blinding light.   Then a boy, twelve years old, approaches him on the deck.   He is also in silhouette.   Dill turns round and we hear the boy close.... KID Dad. I don’t care about catching the fish.   I need you to help me. I need you to do something for me. Only you can do it, Dad. Listen... Dill kneels down on the deck like a penitent in church and the boy comes to him, all in silhouette. He leans forward and whispers in Dill’s ear... INT. DILL’S SHACK, BEDROOM ...Dill wakes with a start. He looks all around.   Outside the sun hasn’t yet risen and a cool breeze blows the curtains. Dill takes a while to come to.   A cockerel crows.   Another day in paradise. Dill lies back and considers. He then gets out of bed and grabs a small spinning rod, already rigged with feathers, from beside the open window. EXT. PLYMOUTH ISLAND - DAWN There is no other traffic around as Dill drives his battered pick-up with the spinning rod in the back.   The pick-up has been worn down to the bones by sea air. Dill arrives at a red light and stops.   He checks his watch. He sees there is no other traffic around and decides to run the light.   He shifts gear and goes to pull away but the engine just revs. He checks the hand brake is off.   He tries again.   The engine revs.   Dill looks puzzled.   Then the light changes to green. He hits the gas and the pick-up pulls away. EXT. PLYMOUTH ISLAND, HARBOUR - MORNING Dill is sitting on the dockside like a kid with his legs dangling.  Serenity   -   Steven   Knight   -   June   29th   2016   16 .",
      "characters": [],
      "action_text": "He is using the skinny little spinning rod, dropping feather bait into the oily water.   Each time he reels in, there are three or four little sprats and jacks wriggling on the hooks. They are silver and beautiful as the morning sun, which is just reflecting off the window panes of Plymouth. He drops the little fish into a bucket of sea water, which is already filled with tiny fish. Duke approaches, buttoning his coat.   It’s chilly in the early morning.   Dill gets to his feet, wipes his hands and picks up the bucket.   As Duke joins he takes the bucket and peers in it as he walks. DUKE Going to try mackerel? DILL Sprats for the mackerel, mackerel for the lure. Wind’s south west. Always mackerel on a south west. Duke smiles.... DUKE So sprats times mackerel equals justice. Dill half smiles as they step aboard the boat. DILL You heard about that, huh? DUKE Is ‘Justice’ really his name? DILL Hell no. Duke heads for the captain’s cabin, filled with hope, just as he is every time he boards the Serenity. EXT. SERENITY, OCEAN - MIDDAY The boat is anchored and Dill is trying live mackerel as bait.   The lines though are taught but the reels are silent. We study Dill’s face beneath the brow of a battered Panama hat as he waits and waits and waits. His notebook is just visible poking out of his top pocket. Duke scans the skies for a Frigate bird but there is none. Dill dumps his cigarette and gets to his feet. DILL OK Duke, reel in, we’ll try the edge.  Serenity   -   Steven   Knight   -   June   29th   2016   17 . Duke is standing in the doorway of the cabin. DUKE That’s more gas, Dill. Dill brushes past him. Duke almost challenges but instead goes to the rods as Dill fires the engine. Duke mumbles to himself as he reels in. DUKE (CONT’D) Eternity in the flap of a wing. EXT. SERENITY, OPEN OCEAN - SUNSET It is the glorious conclusion of a sunset.   The Serenity is at anchor with lines out.   We see a cigarette being lit at the front of the boat.   We see a cigarette being ",
      "dialogue_count": 0,
      "word_count": 11648
    },
    {
      "scene_number": 3,
      "slugline": "EXT. SERENITY, DECK - LATER Dill sits in the game chair on the deck as rain pours on him. He stares out toward the open ocean through the sheets of rain. We come close to his face. Then a rumble of thunder which turns into a whisper... BOY’S VOICE (OOV) Dad? I need you to do it. .. Dill turns sharply but there is no one there, only a lure swinging more quickly than the swell. Dill gets to his feet and stares into the darkness of the hold. Then he turns and looks up at the sky where there is another flash of lightning.... EXT. CONSTANCE’S BEDROOM Constance has her cat on her lap as she stares down at Dill through a rain spattered window.   The cat purrs. She sees Dill looking again into the hold and then returning to his game chair in the pouring rain.... CONSTANCE (SOFTLY) Oh sweet kitty... EXT. SERENITY, DECK We return to Dill as he sits down in the game chair, soaked to the skin.   His mind works.   Then a shadow.   He turns. Karen, dressed in dark clothes, walks across the deck quickly and disappears into the covered hold.   In shock, Dill stands and follows... INT. SERENITY, HOLD Rain drums on the roof. The hold is lit by a single lamp. Tuna lures sway and jangle on the small swell.   Dill is soaked and steams as he walks into the warmth of the hold. Karen turns.... DILL What are you doing here? She is shivering. KAREN He went to look around the commercial harbour.   John.... She comes to him and they face each other...  Serenity   -   Steven   Knight   -   June   29th   2016   64 .",
      "characters": [],
      "action_text": "KAREN (CONT’D) All these years I never stopped thinking about you. Look. From her drenched pocket she produces a small brass ring. KAREN (CONT’D) You put it on my finger when I was sixteen. Remember? Outside the Fix in the parking lot.   I kept it. Dill takes the ring and holds it up to a blade of harbour light. KAREN (CONT’D) The same one.   Brass. You took it from the burner on the stove on your dad’s boat.... He studies it. He then hands it back to her. DILL Some old ring you found... KAREN No. You said ‘with this stupid ring I thee wed baby’.   I remember it word for word and you laughed.   I kept it.   I wear it when I’m alone. She takes it and slips it onto her finger. KAREN (CONT’D) You remember that night too, right? We went to the bridge.   You were fishing. DILL Eels and jacks.... KAREN Then we had sex. First time. For me the first time ever... Karen is trying to make Dill engage.... KAREN (CONT’D) Man.   If we could go back to that bridge that night.   Would you go? Dill considers (she is hooking him). At last he engages... DILL Would I go back?   You mean no war. No fuck up. No pieces of my friends’ bodies laying around in the sand.  Serenity   -   Steven   Knight   -   June   29th   2016   65 . Rain drums on the deck and the roof of the hold. We come close to Karen.   She is playing him. KAREN I love you John. Dill is like a fish that has almost been caught but breaks. His expression changes. His eyes die in his head. He leans her away and speaks without emotion. DILL OK, Karen here’s the deal. Dill lights a cigarette. DILL (CONT’D) Tomorrow I will take him out. He will drink, he will fall over board, the sharks will get to eat and I get ten million in cash. She is about to speak... DILL (CONT’D) Shut up and listen. She nods... DILL (CONT’D) Afterwards I’ll go somewhere.   Set up somewhere.   Havana maybe.   You bring the kid to me. We see what happens. Karen nods again, not wanting to resist anything at all. DILL (CONT’D) But don’t try to bullshit me w",
      "dialogue_count": 0,
      "word_count": 3226
    },
    {
      "scene_number": 4,
      "slugline": "EXT. OCEAN - DAY We see Dill rise from the deep and shake the water from his face.   He treads water and looks all around.   He looks up at the sky.   Miller’s words from last night are in his head. He’s almost sure it was a dream he had when he was drunk, but the card is real. He swims for shore.   He sees someone is waiting for him. EXT. BEACH - DAY Constance is waiting on the beach with a big white towel. She holds it open as Dill emerges and wraps it around him like a mother. CONSTANCE I looked at a map and worked out where you’d come ashore. Dill begins to dry himself. CONSTANCE (CONT’D) You walk back up the hill naked every morning? DILL If there’s no one to see, you’re not naked.   You have a cigarette? She hands Dill a cigarette and lights it. He is wrapped in the towel. Constance’s expression doesn’t change.... CONSTANCE So, did you have sex with her last night? Dill sets off toward a small path that leads back up to his shack with his towel around him. Constance waits, then follows... INT. DILL’S SHACK, BEDROOM Dill is pulling on the same clothes he’s been wearing for a while.   Constance is in the other room. CONSTANCE (OOV) She was on board for twenty minutes. I timed her.   You knocked over the lamp and didn’t bother to put it upright for around seven minutes. So I’m guessing seven minute sex... Dill’s face darkens a little as he buttons his shirt.   She is starting to sound like a witness...  Serenity   -   Steven   Knight   -   June   29th   2016   77 .",
      "characters": [],
      "action_text": "INT. DILL’S SHACK, MAIN ROOM Constance is sitting at Dill’s desk beneath the map of Plymouth Island.   She is studying the mug that reads ‘ World’s Greatest dad ’ as Dill comes back into the room. CONSTANCE I didn’t even know you had a kid. Dill slips his knife into its leather sheath... DILL I have to go. Constance gets to business as she puts the mug down. She explains casually. CONSTANCE Dill? Duke came to see me last night. He told me what you’re planning to do today. Dill freezes. CONSTANCE (CONT’D) He asked me to come up here and talk some sense into you and I said... Dill quickly takes her arm and lifts her to her feet. DILL You said what? DILL (CONT’D) I said if Gonzalez asks, I will tell him nothing. He stares into her eyes and she touches his face. CONSTANCE And I told Duke that, even though murder is a sin and he’s a Christian man, he would never testify against you either. Constance studies him. CONSTANCE (CONT’D) We both love you, Dill. She puts her hand to his face and smiles. CONSTANCE (CONT’D) And we both want you to think again about what you’re planning to do today.  Serenity   -   Steven   Knight   -   June   29th   2016   78 . A pause and a chaste kiss. Dill angles his head at her... DILL You want me to just catch the fish, right? Dill stares at her and now sees two motives. One is live, the other is wildly unthinkable.   After a moment Dill heads for the door... CONSTANCE Dill, don’t listen to that woman, this is crazy.... He has gone. She raises her head and closes her eyes. EXT. PLYMOUTH, MAIN STREET Hardly anyone is around this early.   Dill cruises down the street in his pick up with his window open, lighting a cigarette.   He checks his watch. It’s now 7.15 am. From now until noon his life is against the clock. Constance’s cat licks its paws on a porch as Dill drives by. The radio is playing on low volume and we hear a weather guy.... WEATHER GUY ...low tide noon and twenty five, high tide twenty one hundred, set fair for a beautiful day ar",
      "dialogue_count": 0,
      "word_count": 7814
    }
  ]
}