{
  "slug": "sex-education-101-episode-1-1-2019",
  "title": "sex education 101 episode 1 1",
  "genre": "drama",
  "format": "series",
  "scenes_count": 7,
  "characters_count": 0,
  "characters": [],
  "total_words": 9249,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. AIMEE’S HOUSE. LIVING ROOM - NIGHT 1   1 A MIDDLE-AGED COUPLE watch TV on their pristine, beige sofa. They wear matching house-slippers and laugh every so often at something on the screen. We move up through the ceiling... INT. AIMEE’S HOUSE. AIMEE’S BEDROOM - NIGHT 2   2 A half-smoked joint smoulders precariously close to a pair of knickers. Two teenagers fuck in near-silence amongst the scrunched up sheets of a single bed. It’s the kind of sex you have when your parents are downstairs. AIMEE (16, love-struck and pixie-featured) straddles ADAM (16, a dishevelled stoner kid trapped in a man’s body). He finds every squeak of the mattress excruciating. AIMEE Do you like my tits? Adam looks distracted. AIMEE (CONT’D) Hello? My tits? ADAM Oh yeah, I love your tits. Aimee smiles, elated. AIMEE Do you want to come on them? ADAM Er... I have to take the condom off. He goes to take it off. AIMEE Actually, don’t. I got a rash last time. Let’s do it from behind. Adam flips Aimee over. The mattress is really squeaking now. Adam tries to stop the headboard banging. He can’t. AIMEE (CONT’D) I’m coming! Are you coming? Aimee orgasms. She looks at Adam, expectant. He makes a strange, delayed, groan. AIMEE (CONT’D) Wait... Did you just... fake it?",
      "characters": [],
      "action_text": "ADAM Don’t be stupid. They roll off each other. ADAM (CONT’D) Why are you staring at me? AIMEE Show me the condom. ADAM No way! Aimee wrestles with Adam, she emerges from the sheets holding up the condom. It’s missing semen. AIMEE Where’s the spunk, Adam? Aimee looks at Adam, defiant. He looks guilty as charged. TITLE SEQUENCE. EXT. ROAD OUTSIDE OTIS’S HOUSE - MORNING 3   3 The sun rises over a suburban row of pretty houses. A group of PENSIONERS are on their weekly power-walk. Dogs bark as residents retrieve their mail and leave for work. One house stands out amongst the rest - a large, detached property with an overgrown garden, wind chimes on the porch and stained glass windows. It’s hard not to notice. INT. OTIS’S HOUSE. OTIS’S BEDROOM - MORNING 4   4 OTIS (16, highly intelligent but socially awkward) lays awake in bed, brain already ticking. His alarm BEEPS, he turns it off. His bedroom is meticulously organised. Otis opens his bedside drawer, removing a box of tissues, tube of hand cream and a porn-mag with an oiled-up glamour model on the front. He messes up his bed, dropping scrunched up tissues on the sheets and floor. He leaves the magazine open on the centrefold and unscrews the hand cream, placing it on the bedside table. He steps back, taking in his masterpiece - a perfectly staged scene of fake masturbation. Suddenly, the door opens and DAN (32, ridiculously buff) enters wearing a skimpy pink dressing gown. Dan JUMPS upon seeing Otis. DAN Woah! This is not the bathroom. (pause) I’m... 2. OTIS Sleeping with my mother. DAN Eh... correct. I’m Dan. OTIS Otis. Dan holds his hand out and they shake. Seeing the tissues, hand-cream and open magazine, he pulls his hand away. OTIS (CONT’D) Don’t worry. I’m left handed. (pause) Bathroom’s next door. Dan leaves, pulling down the dressing gown to try and cover his bum cheeks. Otis looks happy with himself. INT. OTIS’S HOUSE. KITCHEN - MORNING 5   5 The kitchen is chaotic but homely, full of hanging plants and Afric",
      "dialogue_count": 0,
      "word_count": 863
    },
    {
      "scene_number": 2,
      "slugline": "EXT. OTIS’S HOUSE - CONTINUOUS 6   6 Otis opens the door to see ERIC (16, an acne-covered motor- mouth with an unruly Afro) in the driveway with his bike. OTIS You’re late. ERIC Sorry man, hair trouble - I had to wait for like, all five of my sisters to use the bathroom, then I got a comb tangled in my hair... I think I hid it okay. Eric parts his bushy hair, revealing a buried comb. Otis gives him a thumbs up. Eric sees Jean in the doorway and grins. ERIC (CONT’D) Wassup, Jean? Cool Kaftan! JEAN Thanks Eric, it’s new. Ready for your big day? ERIC I’m shitting myself to be honest. OTIS It’s not our first day of primary school. It’s no big deal. Jean and Eric share a knowing look as Otis grabs his bike. JEAN Wait one second. Jean goes back inside the house. ERIC Your mum’s such a legend. Otis rolls his eyes and puts on some reflective elbow pads. Jean returns. JEAN Catch. Jean throws a make-up bag at Eric. It lands on the gravel. ERIC Oh, you wanted   me   to catch. Eric opens the make-up bag, it’s full of old lipsticks. 5.",
      "characters": [],
      "action_text": "ERIC (CONT’D) Yes! You are a queen of epic proportions. I mean... not overweight or anything... just, like, awesome. JEAN I’m sashaying away now. Good luck! Jean blows them a kiss and goes back inside. Eric puts the make-up bag into his rucksack. Dan exits the house and walks towards his parked motorbike. He catches Otis’ eye. DAN See you around, mate. OTIS (under breath) I wouldn’t count on it. Eric smiles at Dan, way too eager. ERIC Hi! Dan nods awkwardly, revs the engine and rides off. ERIC (CONT’D) Your mum’s BF is literally a walking, talking wet-dream. OTIS Please don’t. (pause) Anyway, they’re just shagging. ERIC Cool. Otis puts a helmet on. A car parks and AN UPTIGHT-LOOKING COUPLE (45) exit, walking towards the house. ERIC (CONT’D) Are they the ones that like to do it wearing animal costumes? OTIS Nope. He wants her to wear a strap- on. She’s not into it. Classic power dynamic issues. ERIC I wish my mum was a sex therapist. OTIS Trust me, you don’t. Eric and Otis ride off down the street. 6.",
      "dialogue_count": 0,
      "word_count": 383
    },
    {
      "scene_number": 3,
      "slugline": "EXT. ROAD OUTSIDE NORWOOD SECONDARY - MORNING 7   7 Otis and Eric weave their bikes through groups of STUDENTS, heading towards the imposing school building. A beaten-up car full of hip SIXTH FORMERS parks and they pile out. Eric takes his hands off the handlebars, trying to look cool. OTIS Don’t do that. You should be wearing a helmet. ERIC Mate, I'm super pumped! Sixth Form is imminent. Eric SWERVES to avoid TWO STUDENTS (16) kissing furiously on the side of the road. Eric takes his handlebars again. Otis looks back at the kissing couple. The guy comes up for air, he’s weedy with a layer of bum-fluff. OTIS Hang on! Is that Tom Baker?! ERIC Yep, captain of the Warhammer society. His balls finally dropped. Tom moves his hands onto the girl’s arse. ERIC (CONT’D) I keep telling you. EVERYONE has had sex over summer. (pause) Everyone except you. OTIS And   you . ERIC I gave two-and-a-half handjobs to the guy at the Poodle Parlour. OTIS (sarcastic) Wow, you’re a total player. ERIC At least I can wank. OTIS You and every other idiot. ERIC I’m sorry man, but you’re the anomaly in this situation. Do you even get hard-ons? 7.",
      "characters": [],
      "action_text": "OTIS Of course I do. I’m not a eunuch. (pause) I just wait for them to go away. ERIC So, nothing’s changed? You still have zero interest in having sex? OTIS For the hundredth time, yes! I have minus zero interest in having sex. And I’m perfectly happy, thank you. Otis pedals ahead. Eric follows, looking bemused. EXT. NORWOOD SECONDARY. COURTYARD - CONTINUOUS 8   8 Eric and Otis enter the school gates amongst a sea of STUDENTS. They park their rides. ERIC I’m worried about you dude. Look around. Everyone here is either thinking about shagging... Eric points at a FEMALE STUDENT (16, pretty and wearing bi- focal glasses) deep in thought, biting her lip seductively. ERIC (CONT’D) About to shag... Eric points out a LESBIAN COUPLE (both 17, dressed all in black), holding hands and gazing into each other’s eyes. ERIC (CONT’D) Or actually shagging... Otis sees a STRAIGHT COUPLE (both 17) emerging from some bushes. She has twigs in her hair and he is doing up his fly. ERIC (CONT’D) And you can’t even Jack your Beanstalk. You don’t think that’s problematic? OTIS No, I don’t. ERIC Okay, but you’re going to get left behind. Everything we knew has changed. Case in point... They spot MAEVE WILEY (16, sex on legs and hard as nails) entering the courtyard. Everyone stops to watch her pass. 8. ERIC (CONT’D) Even Maeve Wiley’s boobs have got bigger. Which I thought was technically impossible. Otis watches Maeve pass, his face blank. OTIS They look the same to me. (pause) Why do you care anyway? ERIC Dude, I might be a homo-sexual but I still have eyes. And my gay eyes are looking at those massive boobs. The BELL rings and the STUDENTS flood towards the school. ERIC (CONT’D) I hope you’re ready for this. OTIS For what? ERIC A new frontier my sexually repressed friend, a new frontier. Eric grins, full of hope. INT. NORWOOD SECONDARY. ASSEMBLY HALL - DAY 9   9 Eric is on stage playing the school anthem on his trumpet. The auditorium sits in deathly silence. Amongst the crowd is Otis, wi",
      "dialogue_count": 0,
      "word_count": 1452
    },
    {
      "scene_number": 4,
      "slugline": "INT. NORWOOD SECONDARY. ENGLISH CLASSROOM - DAY 13   13 Bored students listen to Miss Sands. Otis sits at the back. MISS SANDS This year’s first assignment will be on ‘As You Like It’... The door swings open and Adam swaggers in. MISS SANDS (CONT’D) Nice of you to join us, Adam. Adam sits next to Otis, hard-core man-spreading. MISS SANDS (CONT’D) You’ll be doing presentations on Shakespeare’s relationship with love and disguise. Whoever you’re sitting next to is your partner. Otis looks horrified as Adam gets out a flick knife and carves his own name into the desk. INT. NORWOOD SECONDARY. ENGLISH CLASSROOM - LATER 14   14 Students file out of the classroom. Otis works up the guts to tap Adam on the shoulder. ADAM Who are you? OTIS Ummm, Otis. We have to partner up... for the presentation. I thought we could - ADAM You new? OTIS No... I’ve been here since first year. We had chemistry together last term. You set my desk on fire. ADAM I’ve never seen your face before in my life. OTIS Anyway, maybe we could meet up at school? The library’s open late... ADAM I don’t do after hours, new kid. Where do you live? 14.",
      "characters": [],
      "action_text": "OTIS Erm, 43, Ashford Street. ADAM I’ll be there at six. Adam whacks Otis’s back and leaves. Otis looks shell-shocked. EXT. NORWOOD SECONDARY. DISUSED TOILETS - DAY 15   15 The bell rings. Otis and Eric are slumped against a wall, watching Adam and HIS MATES goof around across the courtyard. ERIC You told him where you live?! Otis opens a bag of Starmix, sifting out the hearts and eggs. OTIS He asked me. ERIC Dude, your mum has a lot of weird sex-shit in your house. I’m cool with it... obviously... but I’m more emotionally mature than our peers. However, if THAT GUY sees your mum walking around naked, he will destroy your life! OTIS That happened once! (pause) Anyway, she won’t be home. ERIC She better not be. He STILL calls me Trom-boner. It’s been three years... THREE YEARS! OTIS You did get an erection on stage... In front of the whole school. ERIC IT WAS A SEMI! Eric talks through a mouthful of hearts and eggs. ERIC (CONT’D) The nickname doesn’t even make sense - I play trumpet, not the Trombone. He’s such a philistine. OTIS Look, he’ll be in my house for an hour tops. It’ll be fine. 15. Otis and Eric watch Adam grab a fellow STONER in a headlock. ERIC You know what they say, giant dick, tiny brain. OTIS I don’t think anyone says that. Anyway it’s a myth about his... ERIC Gigantic whale cock? It’s not. A friend of a friend of a friend of mine saw it once. She said it was the size of two coke cans. Otis looks confused. ERIC (CONT’D) One on top of the other. Length and width. Life’s so unfair. They watch Adam, now swinging a large stick around his head. OTIS Which friend? You don’t have any friends... except me. ERIC Soon I won’t even have you... when Adam kills you in your own home. Eric shoves more sweets in his mouth. INT. NORWOOD SECONDARY. DISUSED TOILETS - CONTINUOUS 16   16 Maeve and Aimee stand on a toilet seat and smoke out of the tiny window. They observe Adam outside, he’s humping a wall. AIMEE He can’t come. MAEVE More information please? AIMEE Well, w",
      "dialogue_count": 0,
      "word_count": 2865
    },
    {
      "scene_number": 5,
      "slugline": "INT. NORWOOD SECONDARY. CORRIDOR - CONTINUOUS 35   35 Adam opens his locker revealing two cans of Coke, one on top of the other. Checking that no one is watching, he pulls out a packet of Viagra and downs four blue pills with some Coke. Adam slams his locker shut and takes out his phone. He texts Aimee: ‘Meet me in 15. I have a BIG surprise for you.’ A few moments pass before Aimee texts back: ‘I have an assignment... also, fuck off!’ Adam is pissed. He focusses in on Otis, still at his locker. Adam’s eyes narrow and his lip curls. He takes his phone out again. INT. NORWOOD SECONDARY. SCIENCE CLASSROOM - DAY 36   36 Otis scans the room for somewhere to sit. Yet again, there is not one friendly face. There is a free seat next to Maeve. Bracing himself, he approaches. Maeve eyeballs him. MAEVE Yay! Twat-osaurus is here. OTIS You’re mean. I get it. Otis sits down. Maeve watches as he arranges his books and pens in perfect symmetry on the desk. Mr Hendricks (food still in beard) enters the classroom and writes ‘SRE’ on the whiteboard. MR HENDRICKS So, what was going to be biology is now an emergency SRE class. Following an outbreak of pubic lice, Headmaster Groff feels like you all need a refresher. Lucky you. Unlucky me. (pause) You’ll be working in pairs and will need a worksheet, two prophylactics and a plastic phallus. Sporadic giggling is heard. Maeve turns to Otis. MAEVE You heard what he said. Chop chop. Otis goes to the front of the class and takes a worksheet, two condoms and a model phallus from a box. MR HENDRICKS Don’t look so pale, Mr Thompson. They’re only genitals. 29.",
      "characters": [],
      "action_text": "Otis looks back at Maeve, and takes a deep breath. INT. NORWOOD SECONDARY. SCIENCE CLASSROOM - LATER 37   37 Otis and Maeve stare down at a diagram of a cross-section of a vagina. Next to each anatomical part is a blank line. MAEVE Too easy. Maeve fills in the word CLITORIS, followed by HYMEN. OTIS (barely audible) That’s not the hymen. Maeve looks at Otis, incredulous. MAEVE I know what a hymen is, but thanks. OTIS Suit yourself, but you’re wrong. MAEVE What is it then? Otis crosses out HYMEN and writes PARAURETHRAL GLAND. OTIS It’s basically the female prostate. MAEVE Where’s the hymen then? Otis writes the word HYMEN next to the correct space. MAEVE (CONT’D) Who needs to know that one anyway? Once it’s gone it’s gone. OTIS That’s not actually true. MAEVE Alright Dr Phil, go on then? OTIS The hymen doesn’t break. It’s more like a really thin elastic membrane that only covers a small section of a woman’s vagina. The more sex you have, the more it stretches. Maeve looks skeptical. 30. MAEVE So why is it painful... you know, the first time? OTIS Well, if someone doesn’t know what they’re doing then it can cause tearing. If it’s painful it’s probably not your hymen’s fault. It’s more likely that the person you’re with isn’t very experienced. MAEVE Wow, the hymen’s been seriously misrepresented. Maeve grins, looking back at the diagram. Otis watches her doodling a tiny flower on the edge of the sheet - he’s feeling something he never has before... A crush. SUDDENLY, the sound of collective VIBRATING spreads across the room. STUDENTS check their phones. Stifled laughter. MR HENDRICKS Phones away, please. Otis looks around as the laughter spreads. STUDENTS stare at him and whisper. He is the butt of the joke. Maeve looks at her phone. She lets out a snort of laughter, before flashing Otis a pitiful glance. OTIS What is it? MAEVE Nothing. She puts her phone away. A MALE STUDENT plugs his phone into the classroom TV and the screen fills with an image of Jean, stimulating a",
      "dialogue_count": 0,
      "word_count": 2569
    },
    {
      "scene_number": 6,
      "slugline": "INT. NORWOOD SECONDARY. CORRIDOR - LATER 49   49 Adam and Aimee exit the stationery cupboard and go their separate ways. Adam meanders towards his locker when a FEMALE VOICE is heard through the school PA system. FEMALE VOICE Adam Groff to the Headmaster’s office, please... Adam’s shoulders drop and he punches a nearby locker. INT. NORWOOD SECONDARY. MR GROFF’S OFFICE - CONTINUOUS 50   50 Mr Groff sits at his desk, surrounded by framed student awards and polished sports trophies. Adam knocks and enters. Mr Groff looks at him with disappointment. MR GROFF Public indecency is a whole new low. Even for you, son. Sit down. (pause) Strike one. Adam sits in front of his father, shamefaced. EXT. NORWOOD SECONDARY. COURTYARD - DAY 51   51 From across the courtyard, Maeve watches Jackson. He’s flirting with some FEMALE STUDENTS. This clearly bothers her. Aimee sidles up, her hair messy from the recent sex. She takes out a packet of cigarettes and sighs despondently. MAEVE Still no success? AIMEE No... he came. (pause) But I broke up with him. He kept going on about ‘owning his narrative.’ It was really weird. (pause) Want one? MAEVE No thanks. Aimee keeps talking but Maeve isn’t listening. Her brain is in overdrive, calculating something, thinking about... 42.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 212
    },
    {
      "scene_number": 7,
      "slugline": "INT. OTIS’S HOUSE. OTIS’S BEDROOM - NIGHT 52   52 Otis sits upright in his perfectly-made bed. He is looking at the diagram of the vagina from SRE class. Maeve’s handwriting is all over the worksheet. Otis stares at the tiny flower that she doodled in the corner of the paper. Otis’s pulse quickens, he closes his eyes and his hand disappears beneath the sheets. He is about to attempt his first wank when... JEAN (O.S.) Yes! Yes!... Faster! Faster! Otis’s eyes open - listening to the sound of his mum having sex next-door. He pulls his hand out of the covers and folds up the diagram of the vagina, putting it away. JEAN (CONT’D) Just like that! Don’t stop! Otis puts earplugs in and turns the light off. INT. OTIS’S HOUSE. OTIS’S BEDROOM - THE NEXT MORNING 53   53 Otis lays awake in bed. His alarm clock BEEPS and he switches it off. He opens his bedside drawer, inside are the tissues and hand cream. He looks at his fake wanking kit, unsure. Otis makes a decision, he slams his bedside drawer shut. His bedroom door opens, revealing HARRY (50, stocky and bald) wearing Jean’s minuscule pink dressing gown. Harry JUMPS. HARRY Oh! Very sorry... this isn’t the bathroom. Whoops! (pause) I’m Harry by the way- OTIS I don’t care. Bathroom is the next door down. Harry exits, trying to cover his bum cheeks with the gown. INT. OTIS’S HOUSE. KITCHEN - DAY 54   54 Otis is dressed for school, having breakfast with Jean and Harry. Uncomfortable silence as Harry makes SLURPING noises eating cereal. Jean is reading the newspaper. JEAN This study says that under twenty- fives in Japan are having hardly any sex at all. Isn’t that awful? 43.",
      "characters": [],
      "action_text": "Harry looks very uncomfortable. OTIS Mum? Jean doesn’t look up from her paper. JEAN Yes, darling? OTIS I can’t masturbate. Jean looks at Otis, concerned. JEAN Sweetheart, I’m glad you- OTIS I can’t masturbate. But I don’t want to talk about it. I’m dealing with it on my own. Harry has frozen mid-cereal gulp; he glances at the door in panic. Jean takes a long pause before answering. JEAN Thank you for telling me, Otis. The DOORBELL rings. OTIS Gotta go! Otis grabs his school stuff and leaves. HARRY I think I better leave too. JEAN Probably for the best. Harry scuttles off. Jean continues to read her newspaper. EXT. NORWOOD SECONDARY - DAY 55   55 Otis and Eric park their bikes. Otis’s helmet is on too tight and he’s struggling to get it off. Eric sees Maeve making a beeline for them. ERIC Umm, Maeve Wiley is coming over here. She’s literally walking straight towards us. With purpose. Otis pulls at his helmet with desperation. It’s too late. 44. ERIC (CONT’D) Okay, she’s here. Otis turns to find Maeve looking right at him. MAEVE Nice helmet. (pause) And, reflective pads. Otis turns bright red. OTIS Safety first. MAEVE Can I talk to you for a sec? Otis looks around, this must be some sort of joke. OTIS Um, okay. Maeve looks at Eric, still lingering. ERIC Oh... do you want... me to go? OTIS I’ll see you inside. ERIC Well I’ll just... leave then. Eric heads into school, looking back at Otis a few times. Otis tries to get his helmet off again. MAEVE Come here. Maeve leans in and undoes Otis’s clasp. She is so close he can feel her breathing. He takes the helmet off, flustered. OTIS What do you want to talk about? MAEVE Do you see that couple over there? Maeve points out a LESBIAN COUPLE holding hands. These students and the ones that follow are the same people Eric pointed out to Otis on the first day of Sixth Form. MAEVE (CONT’D) The one on the left has never been in a lesbian relationship before. (MORE) 45. She’s terrified of her new girlfriend’s vagina. (pause) Do you ",
      "dialogue_count": 0,
      "word_count": 905
    }
  ]
}