{
  "slug": "sharp-objects-101-vanish-2019",
  "title": "sharp objects 101 vanish",
  "genre": "thriller",
  "format": "series",
  "scenes_count": 5,
  "characters_count": 0,
  "characters": [],
  "total_words": 10816,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. CAMILLE’S CAR/DRIVING -- MAIN STREET -- DAY 1.20   1.20 * Next morning. Camille drives down main street. Very little has changed since 1989. A new Subway here. A 7-11 there...   *  EXT. POLICE STATION -- DAY 1.21   1.21 * Camille parks and gets out of her car. CLOSE ON A school photo of NATALIE KEENE grins from a MISSING GIRL POSTER, stapled to a telephone pole. The girl is unsmiling, plain. But her eyes hold a spark of intelligence. Another sign, all bold black letters, announces a TOWN CURFEW for minors after NINE PM. Camille looks around. It’s eerily silent, even for Wind Gap. No living thing around except a dog looking for scraps. Camille peels the poster off the pole. Pockets it.  INT. POLICE STATION -- WAITING AREA -- DAY 1.22   1.22 * A bored FEMALE RECEPTIONIST, a PURPLE RIBBON pinned to her Walmart blouse, speaks to Camille from behind her desk. The waiting area has the false-hominess of dentist’s office, belied only by the anti-crime posters that dot the wall. An automatic air-freshener hisses periodically. RECEPTIONIST If you want I can call to see when he’ll be back -- ? CAMILLE That’s fine. I can wait. The receptionist notices as Camille’s gaze flicks to the ribbon on her chest. RECEPTIONIST It was Natalie’s favorite color. Well, actually her folks said black but that just seemed too grim. CAMILLE So her second favorite. (CONTINUED)  Sharp Objects - Ep 101 - \"Pilot\" - 2nd Network Draft (02/09/2017)   14.",
      "characters": [],
      "action_text": "RECEPTIONIST Little girls -- first it’s pink. Then purple, purple, purple... My two, they looked like walking grapes until they were 11 or so. (catches herself) It’s a terrible thing. Practically the whole town’s out searching the woods. Chief Vickery, he set it up. (then) You have children? CAMILLE No. RECEPTIONIST I hate to say it, but right now that’s a blessing. I won’t let mine out of the house to get the mail, even. You can’t imagine. My girls get into bed with us every night and, usually my husband won’t have that, but now -- not one of us is getting a good night’s sleep, but at least we know they’re safe. Camille nods. Studies the “DON’T BE A VICTIM” poster on the wall. The receptionist watches her. Curious. RECEPTIONIST (CONT’D) We haven’t had reporters in. I mean, other than the local -- but that’s barely a paper now. More like a page. (laughs at her joke/then) It’s all gone to the internet. CAMILLE I know. It’s like that-- A door slams. CHIEF VICKERY enters. He’s a compact man, prone to anxiety even when things are calm. His pressed uniform soaked through with sweat. The receptionist immediately adopts an air of disdain as she nods to Camille. RECEPTIONIST  Media . Chief Vickery stops. Eyes Camille, wary. CONTINUED: 1.22   1.22  Sharp Objects - Ep 101 - \"Pilot\" - 2nd Network Draft (02/09/2017)   15.",
      "dialogue_count": 0,
      "word_count": 484
    },
    {
      "scene_number": 2,
      "slugline": "INT. POLICE STATION -- VICKERY’S OFFICE -- DAY 1.23   1.23 * The office is tiny and windowless, lined with metal file holders. There are some framed photos on the wall of Vickery with his family. Lots of kids. And some pet FERRETS. Vickery’s smoking, nervous, eyeing Camille. He has a stress ball in the shape of a pig on his desk. VICKERY Thing is, I have no intention of letting this thing get out. CAMILLE I understand, but I promise -- this isn’t going to be some exploitative story. If it makes you feel any better, I’m from here. Just up off Bluebird Circle. VICKERY (a beat) Yeah? What’s your name? CAMILLE Camille Preaker. VICKERY Preaker? How do I not know you? CAMILLE Never got in trouble, I guess. (then) My mother married out of her maiden name about 25 years ago. Adora and Alan Crellin. VICKERY Adora? Well, hell. Yeah, everybody knows them. They own half the town. Vickery takes in this new information. Softens a bit. VICKERY (CONT’D) Jesus. It’s hot as hell in here, isn’t it? He tugs at his shirt, trying to flap it dry. Camille absently picks up the pig-shaped stress ball. When she squeezes it the eyes BUG OUT. Vickery nods to the toy. (CONTINUED)  Sharp Objects - Ep 101 - \"Pilot\" - 2nd Network Draft (02/09/2017)   16.",
      "characters": [],
      "action_text": "VICKERY (CONT’D) My kids gave me that. They told me to squeeze it before I get a heart attack. Stress relief. CAMILLE Because of this case? VICKERY (defensive) We’ve had bad crimes here before. CAMILLE Of course. I didn’t mean-- VICKERY (over her) I just can’t have you here, Miss Preaker. This story comes out in Saint Louis, suddenly it’s all Wind Gap is known for. We’re already the “hog killers.” CAMILLE But publicity might help you get information. It has in other cases. (off his silence) Look. I have a right to be here. I’ll let you do your job, you let me do mine. VICKERY Fine. I got no comment. CAMILLE On Natalie Keene, fair enough. What about Ann Nash? I can dig around and get the local version, or you can have a say in what “gets out.” Vickery sighs. Shit. She’s not going away easily.  INT. FOOTH’S BAR -- DAY 1.24   1.24 * A cave of a place for the serious drinker. Long bar. Silent locals. Camille’s downs a double shot as she talks on the phone: CAMILLE The first girl, Ann, the one found in August? CONTINUED: 1.23   1.23 (MORE) (CONTINUED)  Sharp Objects - Ep 101 - \"Pilot\" - 2nd Network Draft (02/09/2017)   17. Strangled with a clothes line and dumped in Falls Creek. Some hunters found her. CURRY (O.S.)   * That’s all Vickery said? No leads? CAMILLE I don’t think he has anything. Just   * the way -- he was defensive, not like he was hiding something. More like he was frustrated that he   wasn’t . CURRY (O.S.)   * Theory. CAMILLE Jesus, Curry. I just got here. CURRY (O.S.)   * What does your mother say, what’s the town gossip? CAMILLE (lies) She was sleeping when I got in. CURRY (O.S.)   * That’s the color, Preaker. Local stuff. I need facts and color. CAMILLE Fine. I’ll write you a fucking rainbow. CURRY (O.S.)   * You know what I mean-- CAMILLE Curry. If you think this place has small town charm-- CURRY (O.S.)   * Give me local   bleak , then. Paint a Goddamn picture. CAMILLE (a beat/then) I’m going out to join the search party now. I’ll get some quotes. Off",
      "dialogue_count": 0,
      "word_count": 611
    },
    {
      "scene_number": 3,
      "slugline": "EXT. WOODS -- EVENING 1.25   1.25 * Early evening light slants through thick woods. Camille walks past a long row of parked cars until she gets to a dirt road that leads through the trees. She stops when she sees FOUR LOVELY BLONDE GIRLS sitting on a blanket. They’re dressed in short shorts and skimpy tank tops, showing off their blossoming teen-aged bodies. Camille eyes their smooth, supple skin -- their rosy glow. It stirs something in her. She scratches at her arm, an anxious tic. The prettiest BLONDE perks up when Camille arrives. BLONDE You looking for the search? CAMILLE Uh huh. The girl points to a trail head. BLONDE That way. CAMILLE Thanks. But before Camille can move away, the BLONDE eagerly asks: BLONDE Are you -- you’re that reporter, right? From Saint Louis? CAMILLE That was fast. Got to hand it to Wind Gap. You do gossip like nobody else. BLONDE That’s cause this place is so totally dead. (catches herself/laughs) Oh! Dead. That’s...awful. (then) Anyway. Better get going if you want to catch up. Camille nods. Heads into the woods. The girls all watch her go, then fall into hushed laughter as soon as she’s gone. (CONTINUED)  Sharp Objects - Ep 101 - \"Pilot\" - 2nd Network Draft (02/09/2017)   19.",
      "characters": [],
      "action_text": "Camille’s embarrassed to find her cheeks burning a bit. Are they making fun of her?  EXT. WOODS -- DEEPER -- EVENING 1.26   1.26 * VOICE (O.C.) Natalie!   MALE VOICE (O.C.) Natalie!   * The woods echo with a chorus of male voices, yelling the girl’s name. Camille moves toward some figures in the distance. She pushes through some trees -- stops as she sees:  EXT. WOODS (1991) -- EVENING 1.27   1.27 * It’s darker now. A young girl, 14, is running and laughing - - pursued by 5 guys, all bulky jocks. She’s drunk. CLOSE ON THE GIRL Dark hair whipping in her face, it’s TEEN CAMILLE. Her   * awkward body has transformed and she’s tall and radiant -- a beauty newly bloomed. JOCK (O.C.) Damn, Camille! Wait up! RICHARD (O.C.) Hello...?   * MATCH CUT:  EXT. WOODS -- DEEPER -- PRESENT -- EVENING 1.28   1.28 * ADULT CAMILLE turns, startled, the memory still echoing in her head. Sees DETECTIVE RICHARD WILLIS standing a few away. Camille collects herself: CAMILLE Excuse me -- ? RICHARD Sorry. I didn’t mean to... Did you see something? He’s distractingly attractive. And well aware. Out of place in his suit pants and sweat-stained button-down. CONTINUED: 1.25   1.25 (CONTINUED)  Sharp Objects - Ep 101 - \"Pilot\" - 2nd Network Draft (02/09/2017)   20. CAMILLE Oh. No. I... Are you with the search? He moves in, shakes her hand. There’s an immediate hit when they touch. Two lonely people clocking each other. RICHARD In a way. Detective Willis. CAMILLE You’re not from here. Richard gives her the once over. The dark jeans, the long sleeves... Smiles a little, flirtatious.   * RICHARD Neither are you, from the looks of it. CAMILLE On that you’d be wrong. Camille returns his smile, starts walking again toward the voices. He follows her, intrigued. RICHARD Really? I thought I’d cataloged all the Wind Gapians. That’s the proper term, right? CAMILLE I live in Saint Louis now. I’m with the Post. RICHARD (a bit put off) Ah. A reporter. CAMILLE (teases) And you thought I was just a nice concerned ",
      "dialogue_count": 0,
      "word_count": 2969
    },
    {
      "scene_number": 4,
      "slugline": "INT. SENSORS BAR -- NIGHT 1.40   1.40 * Neon Zig Zags on the wall. This place hasn’t changed one bit since the 80’s. Except for getting grimier. Camille sits at the bar. The bartender, CHRIS, stops. CHRIS Camille? He ambles over. He’s cute -- her age but looks older. Paunchy, settled. Not the brightest, but he’s good hang and she’s glad to see him. CHRIS (CONT’D) I heard you were in town. CAMILLE I bet you did. CHRIS Wow. You look the same. CAMILLE Not true. But thanks. CHRIS Come on. You look awesome. You always did. CAMILLE (looks away/then) How about we catch up over your finest well whiskey? CHRIS Screw the well. This is a homecoming drink. On me. As he moves off, Camille notices a YOUNG MAN, not more than 19, nursing a beer at the end of the bar. He’s beautiful, but his athletic build keeps him from being too pretty. His red-rimmed eyes are trained on her. Unsmiling. Studying her. Something’s wrong with him. Strung out, maybe. CHRIS (O.C.) (CONT’D) This is my place now. I own it. CAMILLE Sorry? Camille turns her attention back to Chris. (CONTINUED)  Sharp Objects - Ep 101 - \"Pilot\" - 2nd Network Draft (02/09/2017)   33.",
      "characters": [],
      "action_text": "CHRIS Bought it from those guys. They moved to California. We don’t get that type in here anymore. CAMILLE Type? You mean   the gays ? CHRIS Whatever they call them now. I got nothing against them, you know. (glances at the boy) But they would have tried to eat that one alive. CAMILLE Always recruiting, those gays. CHRIS Still a smart-ass. CAMILLE (smiles) Still a dumb-ass. CHRIS (good natured) Dumb-ass with the hottest karaoke bar in seven counties. You should see this place on Friday nights. (then) What’s your song? CAMILLE Ring of Fire. CHRIS Nice. (his song) Bohemian Rhapsody. Crush it. Camille laughs a little -- then glances again at the young man. Then back to Chris. CAMILLE Gay bait over there looks a little young to be drinking. CHRIS I’m cutting him some slack. That’s John Keene. CONTINUED: 1.40   1.40 (CONTINUED)  Sharp Objects - Ep 101 - \"Pilot\" - 2nd Network Draft (02/09/2017)   34. CAMILLE John... Natalie’s brother? CHRIS Yeah. Poor son-of-a-bitch. He’s taking it really hard. Camille looks over at John, intrigued. Again, John returns her gaze. Bold, like he’s daring her to come over. A beat as Camille assesses the situation -- then says to Chris: CAMILLE Excuse me for a sec, okay? CHRIS Okay... Camille starts to head toward John. But a VOICE stops her. It’s Richard, who’s just planted himself next to her seat. RICHARD Miss Preaker at Sensors? I would have pegged you for more of a Fooths gal.   * CAMILLE Wrong again. Gotta love a Nagel print. (sits back down/then) So is this your spot? You sit here and drink and dream of angular gals in big shoulder pads? He smiles and sits on the stool next to Camille. They fall easily into gentle teasing, their mutual interest evident. RICHARD God. Thank you.   Sarcasm . Most I get from your hometown pals is sugary passive aggression. CAMILLE That’s our specialty. Just smile and nod until the asshole leaves you alone. RICHARD Is that what I am? The   out- of-town asshole? CAMILLE Maybe. You dress like one. But I guess ",
      "dialogue_count": 0,
      "word_count": 1324
    },
    {
      "scene_number": 5,
      "slugline": "INT. WIND GAP GARAGE -- DAY 1.44   1.44 * A garage attached to a shiny new gas station. Camille enters, looking like shit and trying not to appear sheepish. A mechanic sits in the back, eating his mini-mart burrito. CAMILLE Hey. Could I get a jump? My battery died.  INT. CRELLIN HOUSE -- FOYER/KITCHEN -- DAY 1.45   1.45 * Adora, in a simple house shift and slippers, moves around the kitchen. Making eggs and slicing grapefruit. Her expression tightens as the FRONT DOOR opens and Camille tries to enter without being noticed. ADORA Camille. Camille stops. Marshals her brightest morning cheer: CAMILLE Morning. I left my bag in the car... ADORA Would you like an egg? CAMILLE Oh. No. Thank you. ADORA It’s important to eat. CAMILLE I know. And I-- Adora turns, genuinely emotional and scared. ADORA Just -- Camille. I am happy to have you here. I am. But please don’t embarrass me. Not again. CAMILLE What? ADORA When you’re here, everything you do comes back on me. Understand? (CONTINUED)  Sharp Objects - Ep 101 - \"Pilot\" - 2nd Network Draft (02/09/2017)   40.",
      "characters": [],
      "action_text": "CAMILLE Honestly, no. That might have been true before, but I’m an adult now. ADORA Not in Wind Gap. Here, you’re my daughter. You can move away and forget -- but I can’t. You don’t know the people here. You don’t know how they talk-- CAMILLE Oh, I do. Believe me-- ADORA I haven’t heard from you for months -- and now you just show up asking such horrible, morbid questions. Stirring everyone up, staying out all night... Adora tugs at her lashes, suddenly seeming fragile and old. Camille reaches out and takes her mother’s hands. Stops Adora from picking, protective. A child again. CAMILLE Stop. Momma. I’m sorry.   * (then) Honestly, it was nothing. I took a drive. It was stupid. I got so beat I had to pull over, to be safe. ADORA You slept in the car? Did anybody see you? CAMILLE No, momma. And as far as my story--   * ADORA (over her) I shouldn’t have said anything. You know I can’t have that kind of talk around here. Adora removes her hands from Camille’s, turns away from her. Camille’s momentarily wounded -- then pushes it down. CAMILLE I just -- I want you to understand. I’m not here to hurt anybody. That’s not my intention. CONTINUED: 1.45   1.45 (CONTINUED)  Sharp Objects - Ep 101 - \"Pilot\" - 2nd Network Draft (02/09/2017)   41. But Adora just silently busies herself with her breakfast tray. After a long moment, Camille nods to herself. Feeling stupid for even trying. Leaves. FADE TO:  EXT. NASH HOUSE/INT. CAMILLE’S CAR -- DAY 1.46   1.46 * Camille parks outside a run-down 70’s style ranch house. Digs in her bag -- pulls out a fifth of bourbon. Looks around. She’s alone on the street except for a chunky kid crammed into a too-small BIG WHEEL down the street. She takes two long swigs. Waits a beat as it steadies her. Then she finds a travel bottle of mouthwash. She swishes it around her mouth, then swallows it too.  EXT. NASH HOUSE -- DAY 1.47   1.47 * Camille walks to the door -- but is blocked by the BIG WHEEL BOY. He looks up at her with wide-set, dull eyes. H",
      "dialogue_count": 0,
      "word_count": 5428
    }
  ]
}