{
  "slug": "sherlock-401-the-abominable-bride-2016",
  "title": "sherlock 401 the abominable bride",
  "genre": "action",
  "format": "series",
  "scenes_count": 3,
  "characters_count": 6,
  "characters": [
    "JOHN",
    "RANCE",
    "WATSON",
    "MRS HUDSON",
    "MYCROFT",
    "SHERLOCK"
  ],
  "total_words": 24185,
  "total_dialogue": 8,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. AFGHANISTAN/JOHN’S BEDROOM - NIGHT - FLASHBACK 1880 1   1 A blizzard of shots. A foreign battlefield at night. The crackle of gunfire. Now on a dimly glimpsed figure in bed, tossing and turning in a nightmare. Close on the glitter of metal. Bayonets, clashing. Over this, a voice. Almost familiar - the voice of John Watson. John Watson as he might have sounded had he lived many years ago. JOHN (V.O.) The Second Afghan War brought honours and promotion to many - Someone is running, their breath ragged. Suddenly, the night sky is lit up by an explosion. And everything’s red. Not blood. Not fire. But the glimpse of a uniform. A red uniform. Its braiding glints in the afterglow of the explosion. JOHN (CONT’D) (V.O.) - but for me it meant nothing but misfortune and disaster. The crack of a rifle. The owner of the uniform is spun backwards into the night and - In the bedroom, John Watson awakes, sitting up, recovering. Just another nightmare. He lets his breathing return to normal. DISSOLVE TO:  EXT. VICTORIAN LONDON - DAY 1 2   2 A murky, lowering sky - pillars of smoke rising into it.  SHERLOCK SPECIAL - LILAC SHOOTING SCRIPT - 04/02/15   1. (CONTINUED)",
      "characters": [
        "JOHN"
      ],
      "action_text": "Big in the foreground, John sets down his glass with shaking hand. STAMFORD You poor devil. John just shrugs. JOHN I made it home. Many weren’t so lucky. STAMFORD So what now? JOHN Need a place to live - somewhere decent at an affordable price. Not easy. STAMFORD You know, you’re the second person to say that to me today? JOHN Who was the first? Swish,   crack , and - CUT TO:  INT. BARTS/CORRIDOR - DAY 1 4   4 A long narrow corridor, frosted glass windows along one side, looking on to another room. A shadow of the room’s occupant flaps grotesquely against the misted windows - a man slashing away with a riding crop. Now panning to: John and Stamford, entering the corridor. Swish- crack!  JOHN Good Lord. STAMFORD It’s an experiment, apparently. Beating corpses to establish how long after death bruising is still possible. JOHN Is there a medical point to that? STAMFORD I’m not sure.  SHERLOCK SPECIAL - LILAC SHOOTING SCRIPT - 04/02/15   3. (CONTINUED) JOHN Neither am I. So where’s this friend of yours then? He’s marching on down the corridor - - but Stamford has halted, a little apologetically, by the door to the dissecting room. Swish- crack!  John gets it.   No!   Not   him!  CUT TO:  INT. DISSECTING ROOM - DAY 1 5   5 On Stamford and John as they come through the door - - rows of tables, with sheeted bodies, and just out of shot - - swish   crack!  STAMFORD Excuse me? JOHN I hope we’re not interrupting. And SHERLOCK snaps up into a close-up. Those blazing, green eyes, as ever, but the hair slicked back - he looks colder and more exact: this is Victorian Holmes. SHERLOCK You’ve been in Afghanistan, I perceive. STAMFORD Dr. Watson, Mr. Sherl - Whack!! - Sherlock has thrown the riding crop at John, who instinctively catches it. SHERLOCK Excellent reflexes - you’ll do. JOHN I’m sorry? SHERLOCK I have my eye on a suite of rooms near Regents Park. Between us we could afford them. He’s pulling on his coat, striding for the door.  SHERLOCK SPECIAL - LILAC SHOOTING SCRIPT - ",
      "dialogue_count": 1,
      "word_count": 2284
    },
    {
      "scene_number": 2,
      "slugline": "INT. 221B BAKER STREET - EVENING 2 10   10 A little while later. Sherlock (now with his dressing gown thrown over his tweeds) stands at the window, playing away at his violin - we might recognise it as Waltz For Mary And John from The Sign Of Three. Behind him, drowned out by the violin, Mary and John are having something of a domestic, which we barely hear over the music! JOHN It was an affair of international intrigue. MARY It was a murdered country squire - JOHN Nevertheless, matters were pressing - MARY I don’t mind you going, darling - I mind you leaving me behind. JOHN But what could you do? MARY What do you do, except wander around taking notes, and looking surprised?? Suddenly a discordant note from the violin. This causes Mary and John to startle and turn to look at him. Sherlock throws aside the violin, looks fiercely out of the window. SHERLOCK Enough! The stage is set, the curtain rises - we are ready to begin. Mary and John exchange a look. MARY Begin what? Sherlock is staring out of the window. Abstracted, haunted. SHERLOCK Sometimes to solve a case, one must first solve another. JOHN You have a case then? A new one?  SHERLOCK SPECIAL - LILAC SHOOTING SCRIPT - 04/02/15   12. (CONTINUED)",
      "characters": [
        "RANCE",
        "JOHN",
        "WATSON",
        "MRS HUDSON"
      ],
      "action_text": "SHERLOCK An old one. Very old. I shall have to go deep. JOHN Deep? Into what? Oh Sherlock, still staring out of the window. We move in on the window, the Victorian evening outside, the gas lamps, the cabs. SHERLOCK Myself! Abruptly, we roll focus to bring Sherlock’s reflection into focus for a fleeting   moment - - barely long enough to realise we are looking at modern Sherlock, in his coat and turned up collar - - this spectre of the future hangs above the Victorian street scene for the tiniest moment - - and before we are sure what we are looking at - SHERLOCK (CONT’D) Lestrade! He spins round from the window, now back to his Victorian self. SHERLOCK (CONT’D) Do stop loitering by the door and come in. The door pushes open - revealing the Victorian version of Inspector Lestrade, complete with mutton chop whiskers and Derby hat. LESTRADE How did you know it was me? SHERLOCK The regulation tread is unmistakable. Too light for Jones, too heavy for Gregson. LESTRADE Sorry - I just came up, Mrs. Hudson didn’t seem to be ... talking. SHERLOCK I fear she has branched into literary criticism by means of satire - it is a distressing trend in the modern landlady. What brings you here in your off-duty hours?  SHERLOCK SPECIAL - LILAC SHOOTING SCRIPT - 04/02/15   13. (CONTINUED) LESTRADE How do you know I’m off duty? SHERLOCK Since arrival you have addressed over forty percent of your remarks to my decanter. Watson, give the inspector what he so clearly wants. John busies himself pouring a drink. JOHN What can we do for you, Lestrade? LESTRADE I’m not here on business, I just thought I’d ...drop by. Sherlock and John look at each other. JOHN A   social   call? LESTRADE Of course. To wish you the compliments of the season. (An uneasy pause, in the face of scepticism) Merry Christmas. A look among Sherlock and the Watsons. SHERLOCK Merry Christmas. JOHN Merry Christmas. MARY Merry Christmas. SHERLOCK Well thank God that’s over. Now Inspector, what strange happening compels you t",
      "dialogue_count": 4,
      "word_count": 15911
    },
    {
      "scene_number": 3,
      "slugline": "INT. BAKER STREET/STAIRS/HALLWAY - DAY/EARLY EVENING 7 78A   78A Sherlock and John, clattering down the stairs. JOHN But what’s going on?? Are you even in a fit state? SHERLOCK For Mary, of course I am! Never doubt that, Watson - never that! But as reaches to take his topper from the hatstand, he gasps, staggers against the wall - JOHN Holmes. SHERLOCK I’m fine. I’m   fine.  John looks at him - disgusted, but he has to find a way to help him. He grabs, the topper from his hand, tosses it. JOHN Not that one - (Now hands him the deerstalker) - this one. SHERLOCK Why? JOHN You’re Sherlock Holmes. Wear the damn hat!! CUT TO:  EXT. BAKER STREET. DAY/EARLY EVENING 7 79   79 SHERLOCK and JOHN dash out into the street. There’s a hansom cab close by but no driver. JOHN Cabbie!   Cabbie!  SHERLOCK Never mind. No time! He jumps up into the driver’s seat and lashes at the horses, just as John clambers inside. From out of a nearby tea-stall the CABBIE comes darting, holding a mug of tea in his hand.  SHERLOCK SPECIAL - LILAC SHOOTING SCRIPT - 04/02/15   95. (CONTINUED)",
      "characters": [
        "MYCROFT",
        "SHERLOCK"
      ],
      "action_text": "CABBIE  ‘Ere!  CUT TO:  EXT. LONDON STREET. EVENING 7 80   80 SHERLOCK whips at the horses as the cab streaks along the street. JOHN (yelling) So tell me, where is she? You must tell me, what’s going on! SHERLOCK Good old Watson! How would we fill the time if you didn’t ask questions! JOHN Sherlock, tell me where my bloody wife is, you pompous prick or I’ll punch your lights out! Sherlock looks at him in astonishment - - for a moment, as the street flick past, he is looking at Modern John - then a flick of shadow and the moustache is back. JOHN (CONT’D) Holmes? Where is she? SHERLOCK A de-sanctified church. She thinks she’s found the solution, and for no better reason than that, has put herself in the path of considerable danger. What an   excellent   choice of wife. He cracks the whip. CUT TO:  EXT. CHURCH. DUSK 7 81   81 The hansom cab comes careering round the corner into a patch of overgrown ground. In the centre, a big, ugly, tumbledown church. CUT TO:  SHERLOCK SPECIAL - LILAC SHOOTING SCRIPT - 04/02/15   96. INT. CHURCH. NIGHT 7 82   82 Moonlight pours through a high shattered stained-glass window, throwing coloured shapes over the stone floor. SHERLOCK and JOHN enter. From somewhere in the church, they can hear a soft susurration, a murmuring. Voices, in unison. Chanting? They exchange a look. John takes out his revolver and cocks it. They creep past a pew. Suddenly, MARY steps out. JOHN What the devil - ? MARY I’ve found them. She takes John’s hand and leads him down - down - down a spiral staircase into the vault below. Sherlock follows. CUT TO:  INT. CHURCH. VAULT. NIGHT 7 83   83 They emerge into a stone vault, dripping with damp. JOHN What is all this, Mary? MARY This is the heart of it all, John. The heart of the conspiracy. She makes to open a door but Sherlock stops her. He opens the door with a soft   click.   Flame-red light spills out into the vault. They look down onto - CUT TO:  INT. CHURCH. VAULT. NIGHT 7 84   84 - a vision from Hell! A massive",
      "dialogue_count": 3,
      "word_count": 5990
    }
  ]
}