{
  "slug": "shortcomings-2023",
  "title": "shortcomings",
  "genre": "comedy",
  "format": "film",
  "scenes_count": 14,
  "characters_count": 0,
  "characters": [],
  "total_words": 18538,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. SKYSCRAPER - NIGHT 1   1 MRS. WONG (glamorous, 30s) stands in the lobby of a luxury residential building. From behind a reception desk, MARTIN (a white man, 70s, suit and tie) stares at her with barely- concealed contempt. MARTIN Well, Mrs. Wong, thank you for inquiring about the availability of our penthouse suite. I’ve reviewed your application, and unfortunately... A long, dramatic PAUSE. MARTIN (cont’d) Me no like-ee. He stares at her, crumpling a piece of paper in his hands. The woman smiles, then turns and heads to the exit. Through the glass doors, MR. WONG (30s, Asian), her handsome, well-dressed husband waits outside, smoking a cigarette. Mrs. Wong says something to her husband. He casually pulls out his phone and makes a brief call. He puts the phone back in his pocket and nods. They stride back into the lobby. MRS. WONG (to Martin) I’d like to inform you that my husband has just purchased this building. An email confirming said purchase should be arriving in your inbox presently. Martin’s computer emits a gentle audio TONE. In shock, the man glances at the screen, his eyes bulging as he reads. MRS. WONG (cont’d) I trust you’ll see that everything is in order. MARTIN Yes, Mrs. Wong! MRS. WONG Now if you wouldn’t mind, could you please attend to the overflowing trash bin out front? MARTIN Right away, Mrs. Wong!",
      "characters": [],
      "action_text": "Martin sprints out the front door. TRIUMPHANT MUSIC rises as the Asian woman and her husband make their way across the lobby, into the open elevator. MR. WONG Happy birthday, Mrs. Wong. MRS. WONG I thought you said money can’t buy happiness. MR. WONG You be the judge of that. Music swells. They kiss passionately, as the elevator doors close. EXT. SKYSCRAPER - NIGHT 2   2 A massive, ultra-modern tower centered within a glittering cityscape. The surrounding sky erupts with FIREWORKS. INT. MOVIE THEATER - NIGHT 3   3 PULLING BACK, we see the previous scene playing out on a screen. As the movie-within-the-movie cuts to credits and ASIAN-INFLECTED CLUB MUSIC, the audience breaks into THUNDEROUS APPLAUSE. The capacity crowd is comprised entirely of Asian people, who enthusiastically clap, cheer, wipe away tears. We zero in on MIKO and BEN (both early 30s, Japanese American), seated side by side. Miko smiles and applauds, as Ben slumps in his seat, a look of disbelief. The crowd goes into a standing ovation, obscuring Ben, who doesn’t move. INT. MOVIE THEATER - LOBBY - A FEW MINUTES LATER 4   4 The audience mingles under a BANNER that reads “EAST BAY ASIAN AMERICAN FILM FESTIVAL.” A DJ spins. A woman hands out boba drinks. Ben and Miko make their way through the crowd, their discordant expressions still intact. Miko notices RAMON (40s), an enthusiastic Filipino man in a  barong tagalog , waving her over from across the room. He is surrounded by a group of Asian people of various ages. 2. RAMON Everyone, I’d like you to meet one of our incredible co-organizers, Miko Higashi. Miko shakes hands and hobnobs amiably with the crowd. MIKO Oh, and this is my boyfriend Ben. As if snapping out of a daze, Ben smiles and waves. BEN Sorry, I’m just...recovering. RAMON (to Ben and Miko) Wasn’t that amazing? MIKO Yes! Ben grimaces and shrugs, clearly holding his tongue. RAMON (to Ben) Look, bruh, I know it’s a little glossy, but it’s OURS! (to everyone) Right? That’s US, baby! Everyone w",
      "dialogue_count": 0,
      "word_count": 829
    },
    {
      "scene_number": 2,
      "slugline": "EXT. CITY STREETS - BERKELEY - NIGHT 6   6 Ben and Miko’s car zips by. INT. BEN AND MIKO’S APARTMENT - NIGHT 7   7 Ben and Miko enter, turning on lights, removing coats, etc. The apartment is stylish, modest, somewhat cramped. BEN I’m not criticizing you. Or the festival! I’m just expressing my opinion about this particular movie, but-- MIKO Well, you could’ve at least faked it a little bit with Ramon. The way you reacted when he asked what you thought of it...god, I wanted to die. BEN (laughing) It’s good for him! He should hear a range of responses, for once. MIKO Well, who are   you   to criticize? BEN What’s   that   supposed to mean? MIKO Sorry. That wasn’t...Look, if you didn’t like the movie, that’s fine. I just don’t understand why you have to be so-- BEN Because it’s depressing to see a room full of people lose their minds over a movie just because of ”representation” or whatever. MIKO How about the possibility that they also just really enjoyed the movie? BEN Well, that’s even more depressing! 5.",
      "characters": [],
      "action_text": "MIKO Wow. You are a piece of work... Miko shakes her head and chuckles, in spite of herself. OPENING TITLES A7   A7 INT. BAY AREA RESTAURANT - DAY 8   8 Ben sits across the table from his best friend, a young Korean-American woman. This is ALICE (late 20s, glasses). BEN I can’t even do it justice. I’m still having like, aftershock cringes. ALICE Really? I heard it’s great-- BEN The entire theater was going insane! It looked like a med school graduation ceremony. ALICE (laughs) Well, I’m sure Miko really appreciated your in-depth critique. BEN What am I gonna do? Suddenly act like my judgment is as clouded as hers? I mean, she didn’t give a shit about any of this... community... political... whatever  when I met her, so it’s-- NINA, a waitress (mid 20s), arrives holding two plates. NINA Okay, I’ve got a club with fries and a tofu scramble crepe. Ben makes a face in response to Alice’s order. ALICE That’s me. I like your hair. 6. NINA Really? For some reason I thought it would be a good idea to get drunk and cut it myself last night. Alice laughs, a little more than warranted. NINA (cont’d) I should go get it fixed. BEN (to waitress) Can I-- ALICE No way! I should get you to cut   my  hair sometime. BEN Sorry, but can I get some-- ALICE We can get drunk first if it’ll help. Nina laughs. BEN Ketchup! Can I please get some ketchup. NINA (to Ben) Sure. I’ll be right back with that. (to Alice, warmly) Let me know if you need anything else. ALICE I will. As Nina walks away, Alice smiles proudly. BEN Do you know her? ALICE Not yet. They start eating. ALICE (cont’d) Okay, so she’s gotten a little more politically-minded. That’s good! (MORE) 7. I don’t get why it’s such an affront to you. BEN It’s not a...It just, it gets tiresome, you know? ALICE I bet you’d change your tune if you suddenly woke up in Alabama or something. BEN I was practically the only non- Aryan in my entire high school! I showed you the yearbook. It was like a...Mormon modeling agency! ALICE And you never",
      "dialogue_count": 0,
      "word_count": 807
    },
    {
      "scene_number": 3,
      "slugline": "INT. BEN AND MIKO’S APARTMENT - LIVING ROOM - NIGHT 11   11 Ben sits in the darkened room, watching an old movie on a large TV. A stack of Criterion blu-ray discs sits on the coffee table. Miko enters, dressed in a tank top and panties. MIKO It’s getting late. BEN (eyes fixed on the TV) Look at this. They call this an “improved digital transfer”? MIKO Do you want to get to bed soon? BEN Enh...I’m not really tired yet. I slept in today. MIKO Well, we don’t have to go to sleep right away. BEN I’ll be there in a little bit. I still have a couple other discs I want to check out. Miko takes this in, then turns and exits down the hallway. EXT. UNIVERSITY CINEMA - DAY 12   12 A small, slightly shabby movie theater. A young woman strides in. A “HELP WANTED” SIGN is visible in the box office window. INT. UNIVERSITY CINEMA - PROJECTOR ROOM - DAY 13   13 Ben, dressed in his work uniform of black pants, white shirt and tie, sits at a desk of a makeshift office in the projector room. He’s reading a book on screenwriting. WOMAN (O.S.) Hello!..Ben? BEN (not looking up) Yeah. 10.",
      "characters": [],
      "action_text": "The young woman, AUTUMN (mid 20s, white) leans her head into the room. Her choppy hair is bleached blonde, and her blue eyes are ringed with heavy black eyeliner. AUTUMN Hi! The guys downstairs said to talk to you about the, uh, job? Ben closes his book and looks up, suddenly intrigued. INT. UNIVERSITY CINEMA - LOBBY - A FEW MINUTES LATER 14   14 Ben and Autumn descend a staircase. Behind the refreshment counter are two employees: GENE (20s) and LAMONT (20s). Both are dressed in the requisite white shirt, necktie, and black pants. BEN (to Autumn) So the restrooms are up those stairs on the other side of the concession stand-- GENE (O.S.) So what are you into? Ben and Autumn look towards the refreshment counter. Gene and Lamont stare expectantly at Autumn. AUTUMN Oh, hi again! What...? BEN (to Autumn, reluctantly) That’s Gene, and that’s Lamont. She smiles and waves. BEN (cont’d) Guys, this is Autumn. She’ll be starting this weekend, so I’m-- GENE Movie-wise. What are   you   into? AUTUMN Gee. Okay. I, uh... She pauses to think. 11. GENE I’m into genre auteurs. In other words, singular filmmakers who choose to work within the-- LAMONT He’s a Christopher Nolan fan, is what he’s trying to say. GENE Extremely reductive, but nevertheless I-- LAMONT I’m more into world cinema. You know...Bong Joon-Ho, Ruben Östlund,  Céline Sciamma.  GENE Bullshit alert! Bullshit alert! Gene begins to make a grating SIREN SOUND with his voice. BEN Guys! Let’s try not to scare her off before she’s even started, okay? Ben ushers Autumn towards the box office. AUTUMN Yikes. BEN Yeah, sorry. You’ll be safe in here. Autumn laughs as Ben opens the door to the tiny box office. OMIT 15   15 INT. UNIVERSITY CINEMA - BOX OFFICE - CONTINUOUS 16   16 Ben and Autumn enter the cramped booth. BEN Well, I guess I don’t need to explain too much. You know, it’s just...selling tickets...answering questions from confused old people... 12. AUTUMN I love it! BEN I should probably mention that we have a little ",
      "dialogue_count": 0,
      "word_count": 681
    },
    {
      "scene_number": 4,
      "slugline": "EXT. UNIVERSITY CINEMA - DAY - CONTINUOUS 17   17 An unremarkable sedan idles at the curb, lights on. Ben exits the box office and approaches the car as Miko steps out from the driver’s side. She holds a TAKE OUT FOOD CONTAINER. BEN Hey! What are you doing here? MIKO I was having lunch down on Fourth Street, so I got you some take-out. BEN With who? You’re all dressed up. MIKO Just...Ling and Ramon and some of the other festival people. Here... eat before the tempura gets soggy. He takes the container from her. BEN Thanks. I’ll probably be home around one. MIKO I’ll try to stay up. INT. UNIVERSITY CINEMA - BOX OFFICE - CONTINUOUS 18   18 Autumn watches as Ben and Miko share a perfunctory kiss. INT. BEN AND MIKO’S APARTMENT - BEDROOM - NIGHT 19   19 Miko sits in bed on her iPad, while Ben gets ready for the night. BEN No, Gene was actually right. Lamont’s   real   favorite movies are literally all on Disney+. Meanwhile, he’s-- MIKO (laughing) Are you serious? BEN I mean, I guess you can’t blame him for trying, but-- 14.",
      "characters": [],
      "action_text": "MIKO Boy, I guess everyone’s got the hots for the new girl! BEN What do you mean, “everyone”? MIKO Pft, come on. I know your type. BEN What? I don’t have a type. Miko smirks, holding her tongue. BEN (cont'd) I don’t!   MIKO Then how come you didn’t introduce us? BEN Because unlike you, I spare you the pain of having to interact with my co-workers, so-- MIKO Well, you’ve introduced me to Gene, Lamont, uh...that creepy projectionist guy-- BEN Okay, fine! I didn’t know you’d be so interested in meeting some grubby, attention-seeking hipster, but-- MIKO Oh, don’t overdo it, Ben. I know what a sucker you are for those kinds of-- BEN Jesus Christ! Give me a little credit, okay? I’m-- MIKO All right, fine! I’m just-- BEN You wanna know my type?   You. Okay? Even when you’re being an asshole. Miko laughs. Ben joins her in bed, pulls her close and gives her a kiss. As Miko rolls towards Ben, we catch a glimpse of the modern/minimalist FLOWER-PRINT PATTERN on her pillowcase. 15.",
      "dialogue_count": 0,
      "word_count": 366
    },
    {
      "scene_number": 5,
      "slugline": "INT. ALICE’S APARTMENT - MORNING 20   20 A small, collegiate studio. Ben sits on a futon, dressed in a suit and tie. Alice, in a dress and heels, fusses with her hair, applies make-up, etc.--all of which seems very out of character for her. ALICE Thanks for doing this. BEN I’m honored to play a role in your bizarre, ongoing charade. ALICE You’d think the fact that I’m getting a Ph.D would be enough to make them happy, but nope. Ben grabs a FRAMED PHOTO of Alice from the side table. BEN Why do you have a framed photo of yourself? ALICE Because I’m in love with her - Oh, one more thing... maybe don’t mention that your last name is “Tagawa”, okay? He shoots her a baffled look. ALICE (cont’d) My grandpa will be there. BEN So? ALICE Does the phrase “World War II” ring a bell with you? BEN Oh. That. ALICE Yeah, that. Nothing big. Just...just the raping and pillaging my people. BEN  Half   of your people-- 16.",
      "characters": [],
      "action_text": "ALICE Your people making us bow down and change our names to-- BEN That wasn’t “my people”, okay?! My people were already in America for like, two generations when that happened! My people were, you know...getting locked up in fucking internment camps! ALICE I think the preferred term is “incarceration camp”...? “Internment” is a misleading - BEN I know! I can’t defend my ancestors and be perfectly correct in my terminology at the same time, okay? ALICE C’mon, we’re gonna be late. Alice grabs her keys, as Ben pulls himself up off the couch. OMIT 21   21 OMIT 22   22 EXT. KOREAN CHURCH - SAN FRANCISCO - DAY 23   23 Ben and Alice approach an austere, suburban building adorned with Korean signage and a large metal cross. Well dressed Asian people of all ages file in for a wedding. ALICE ...Either way, they’d still rather see me with a Japanese guy than a Korean girl. BEN Oh. So when it comes down to it, rapists and pillagers are still preferable to gays. ALICE  Everything   is preferable to gays... 17. MRS. LEE   (O.S.) (in Korean)  Alice! You’re late! Always late!  MR. and MRS. LEE (both mid 60’s) approach. GRANDPA LEE (80’s, Korean) follows behind. ALICE Hi, Mom Hi, Dad. (in Korean)  Hi, Grandpa!  Alice hugs her family as Ben stands awkwardly. MRS. LEE So...we finally get to meet your mysterious boyfriend! (in Korean)  So handsome!  ALICE Uh, yeah. Everyone... this is Ben. Ben Park. BEN Hi there-- MR. LEE Hello, Ben. Mr. Lee, elated almost to the point of tears, goes in for a warm hug. MRS. LEE Praise Jesus. BEN Yup. MRS. LEE Very nice to meet you, Ben. So Alice tells me you’re a youth pastor! Ben nods uncomfortably. He looks over at Alice, who is all smiles. Ben offers a hand to Grandpa. BEN Uh, nice to meet you, sir. But the old man doesn’t oblige. He just menacingly scowls. MRS. LEE Anyway, let’s go inside! 18. Mr. And Mrs. Lee head inside. Grandpa stares daggers at Ben before turning around and following them in. BEN (to Alice) ...What’s wrong with your Grandpa? ",
      "dialogue_count": 0,
      "word_count": 2657
    },
    {
      "scene_number": 6,
      "slugline": "INT. BAY AREA RESTAURANT #2 - DAY 42   42 Ben and Alice sit across from each other in a booth, eating and drinking. This is a new setting, different from where we’ve seen them having lunch before. BEN Something wrong with the usual place? ALICE I’m just kind of dodging that waitress. BEN Why? I thought you were-- ALICE Enh. She started getting all  attached . BEN You’ve got problems. ALICE What, just because I’m not a serial monogamist like you? BEN I’m not--that’s the old me, okay? ALICE Right. BEN You think I’m gonna sit around pining away for Miko while she’s off traipsing around New York? ALICE What does   that   mean? I thought you said you guys weren’t broken up. BEN I told you: we’re   taking some time off . I don’t know what’s so confusing about-- ALICE Okay, okay! Jeez... BEN I’m just saying...while the cat’s away, the mouse will play. 31.",
      "characters": [],
      "action_text": "ALICE Yeah, with himself, probably. BEN Ha ha. ALICE So is there a dating app for the miserable? BEN What if I told you I already went out with someone? ALICE Wait...what? BEN Yeah, Autumn. She’s-- ALICE That girl from the theater? Ew, how old is she? BEN She’s like 23, 24. 25. Probably older than your waitress. ALICE Yeah, but it’s different. BEN How’s it different? ALICE Everything’s less creepy without the hetero power dynamics. Ben takes a beat to consider this. ALICE (cont’d) So how many times have you gone out with her? BEN Just once, really...but-- ALICE You going out again? BEN Probably. 32. ALICE You gonna make a move? BEN Why are you interrogating me-- ALICE I just don’t want you to be banished to “neutered Asian friend” territory forever. I’ve seen you there, Ben, and it’s pathetic. Ben considers this for a moment, gravely. ALICE (cont’d) Next thing you know, she’s texting you little updates about some guy she likes...showing you pictures...asking your advice... Fuck that place. Right? Ben nods. ALICE (cont’d) Come on, Ben. Say it with me: ALICE (cont'd) FUCK THAT PLACE!   BEN (self-consciously) Fuck that place. Customers glance over in Alice’s direction. INT. BEN AND MIKO’S APARTMENT / NYC APARTMENT - NIGHT 43   43 We cut back and forth as Ben and Miko talk on the phone. We see just enough of Miko’s surroundings to register them as more lavish than expected. BEN They’re doing those inspections at the theater now, which is a total nightmare. We’ve had to cancel a few screenings because they interfered with   their   schedule. MIKO Jeez. BEN How’s the internship going? You haven’t told me much about it. 33. MIKO Oh, I’ve learned not to bore you. But it’s incredible. BEN That’s great. MIKO I keep having these moments where I’ll stop and think, “Wow...I’m in New York City!” BEN Well, that   is   where you are... MIKO I know, Ben. You don’t have to get all sarcastic just because I’m enjoying myself. BEN I’m just kidding around! I wasn’t-- You started it with ",
      "dialogue_count": 0,
      "word_count": 581
    },
    {
      "scene_number": 7,
      "slugline": "EXT. CITY STREETS - OAKLAND - NIGHT 44   44 Ben and Autumn exit a seedy bar and walk through the desolate neighborhood. BEN I probably didn’t need that last drink. AUTUMN You mean that second Amstel Light? Ben laughs at Autumn’s teasing. He stops in front of a wall covered in GRAFFITI. BEN God, look at that. AUTUMN I know. It really is like the last real folk art in America. Caught off guard, Ben nods in agreement. They move away, revealing the spray painted words on the wall: “SUCK MY DICK.” INT. AUTUMN’S APARTMENT - LIVING ROOM - NIGHT 45   45 Ben and Autumn enter the dark, cramped apartment. The room is cluttered with pop culture ephemera: concert posters, records, magazines, collectibles, etc. AUTUMN Let me grab us something to drink, and we can go to my room. As he browses around, Ben notices a bunch of Japanese toys, manga, and kitschy Asian snack food packages. BEN Okay. Ben turns and sees a wall covered with hundreds of POLAROID PHOTOS, neatly arranged in a grid. BEN (cont’d) Wow. What’s all this? AUTUMN Oh! That’s one of my works-in- progress. I wake up every morning, go pee, and then I take a picture. 35.",
      "characters": [],
      "action_text": "In closer detail, we see that each Polaroid is a PHOTO OF A TOILET BOWL, and that there is a HAND-WRITTEN DATE (e.g. “THURS 2/18”) scrawled beneath each image. BEN Are you...You’re serious? AUTUMN Yeah, look: patterns start to emerge, like when I’m dehydrated, or when I get my period... BEN Yeah... AUTUMN It’ll be a huge installation someday. Right now the working title is “Epistemology.” It’s kind of a pun... Ben takes a beat to process this. BEN How about “Urine Sane”? AUTUMN Yeah, right. (a beat) That wasn’t very nice. BEN Sorry. I was just trying to...forget it. I think it’s really amazing. There’s so much subtext to it, and I think it’s a real commentary on-- AUTUMN ...Consumption and waste! BEN Yeah. AUTUMN Let’s go in the kitchen. I think my roommate might be sleeping. INT. AUTUMN’S APARTMENT - KITCHEN - NIGHT 46   46 Autumn rummages through the refrigerator. Ben stands nearby. 36. AUTUMN Dang, I’m sure I had some soju here somewhere. She eventually finds a bottle. BEN Autumn. He steps closer, a serious look on his face. AUTUMN Yeah? They lock eyes. The tension is palpable. Finally, Ben leans in for a kiss. Autumn recoils, lurching backwards abruptly. AUTUMN (cont'd) Oh! Um...   BEN I’m sorry. God, I... AUTUMN What about your girlfriend? BEN Oh, we’re taking some...I mean, basically, we split up. She...she moved to New York. AUTUMN Oh. I didn’t know that. They lock eyes again. AUTUMN (cont’d) But also...I’m just not really...into that kind of stuff. You know...germs. Ben nods. AUTUMN (cont’d) And...bac...teria. A horrible, awkward SILENCE descends. BEN Okay, yeah...   AUTUMN (cont'd) I’m sorry, okay? BEN No, no. Really. I’m the one who should apolo-- JEFFERY, still naked, whom we recognize from Autumn’s stage performance, enters and opens the refrigerator. 37. JEFFERY Hey, Autumn. AUTUMN Hi, Jeffrey. Ben, this is my roommate Jeffrey. JEFFERY Hey, man. Nice to meet you. Ben and Jeffrey shake hands. JEFFERY (cont’d) (noticing the bottle in Autumn’s hand) Ooh, s",
      "dialogue_count": 0,
      "word_count": 1853
    },
    {
      "scene_number": 8,
      "slugline": "I/E. UNIVERSITY CINEMA - BOX OFFICE - DAY 58   58 Autumn sits at the ticket window as Ben, standing nearby, counts out dollar bills for the register. BEN ...fifteen...sixteen... AUTUMN So, we’ve got another show coming up pretty soon. BEN ...eighteen...nineteen...twenty. Oh yeah? That’s great. AUTUMN I know you really liked our last show, and this is kind of like...similar, but more intense. BEN Wow. What night is it? Because I might have to-- AUTUMN It’s actually a month-long residency, so... BEN Oh, perfect! Well, let me-- Ben is rescued by a TAPPING on the box office window. It’s Sasha, looking more radiant than ever. SASHA Hi. Remember me? Ben haphazardly shoves the dollar bills into the register. BEN Of course! Hi! SASHA I was just passing by. BEN Wanna see a movie? She surveys the marquee, grimacing at the options. SASHA Mmm. Maybe another time. 47.",
      "characters": [],
      "action_text": "BEN Hang on a second. He exits the booth. Through the glass, Autumn watches Ben and Sasha’s inaudible conversation. Eventually, Ben and Sasha walk away together, talking animatedly. INT. MEXICAN RESTAURANT - DAY 59   59 Ben and Sasha sit across from each other in the crowded, brightly-decorated restaurant. SASHA (taking a bite) Mm, that’s good. BEN Have you never been here before? SASHA I was in a relationship, and...she became a vegetarian, then a vegan, then a raw-food vegan... BEN And now what does she eat? Dirt? SASHA (laughing) Needless to say, places like this were off limits. It still feels a little transgressive, actually. BEN Yeah, my ex basically liked two kinds of food: Japanese from a restaurant or Japanese cooked at home. SASHA Sounds better than vegan cashew cheese. BEN Yeah. So how long ago did you and...? SASHA Pilar? Uh... BEN Am I prying here? I don’t want to be intrusive. 48. SASHA No, it’s fine. We’ve been broken up a couple months. (a beat) I should probably say it’s been longer, right? So it doesn’t seem like I’m just jumping from one thing to another? BEN Good thought, but then if you make it too long, you start to run the risk of looking kind of-- SASHA I know. Like, “Hi! I haven’t had a date in three years! Wanna meet my cats?” BEN Wait, do you actually have cats? SASHA (covering her face) Maybe! Ben laughs, very much charmed. SASHA (cont’d) So what about you? How long have you been...? BEN Oh, about ten years. Sasha freezes, mid-bite, then starts to laugh. BEN (cont’d) I’m kidding. Same as you: couple, uh...couple months. SASHA Do you have to get back to work, or...? BEN Yeah, unfortunately. SASHA Okay. Well-- BEN But tomorrow! Tomorrow’s my day off! SASHA (cont'd) (startled) Oh! 49. Ben closes his eyes and winces, sure that he’s blown it. BEN I’m...I’m a little out of practice with this. Sasha smiles, charmed. SASHA ...Me too. BEN But if I haven’t made it clear, I am free tomorrow. Sasha laughs. INT. BOOKSTORE - NEXT DAY 60   60 From a dis",
      "dialogue_count": 0,
      "word_count": 2054
    },
    {
      "scene_number": 9,
      "slugline": "INT. BEN AND MIKO’S APARTMENT - LIVING ROOM - CONTINUOUS 69   69 Ben approaches the front door and look through the peephole, his mood suddenly brightened. He unlocks and opens the door, excitedly, to reveal Sasha. BEN Hey! I thought you were at school today. SASHA I had an impulsive urge to see you. She steps inside, giving Ben a peck on the cheek. SASHA (cont’d) Also, my class was cancelled. BEN Lucky me. He abruptly kisses her on the mouth, pushing her back against the wall. As they continue to kiss, Ben takes Sasha’s purse from her shoulder and dramatically tosses it aside. The contents of the bag clatter everywhere, and a puzzled/irritated look crosses Sasha’s face. BEN (cont’d) Shit! Sorry... Ben squats down and begins collecting the spilled items (phone, keys, etc.) and placing them back in the purse. SASHA I was actually thinking maybe we could get lunch. BEN Oh. Yeah. Sorry. INT. UNIVERSITY CINEMA - MAIN THEATER - NIGHT 70   70 Ben stands facing the handful of EMPLOYEES who are scattered among the first few rows of seats. Amongst them, DANNY, the creepy projectionist stares off into the middle distance, casually eating a hot dog. BEN So, uh, I’m afraid I have some disappointing news. (MORE) 60.",
      "characters": [],
      "action_text": "Apparently the inspectors have deemed the building “structurally unsound,” and it looks like we have to shut down for some pretty significant retrofitting. Unfortunately, it doesn’t look like the head office wants to pay for it at this point. Ticket sales haven’t really been what they used to be, as you’ve probably noticed... we’re still sorting things, but... (emotional) I’m really sorry, guys. I know this place means a lot to all of us. A few employees look at each other and shrug, as if to say, “Not really.” BEN (cont’d) So when we figure out when our last night is gonna be, we can talk about having a party or something. Maybe a special after-hours screening...? Gene raises his hand. Ben’s face tenses with irritation. BEN (cont’d) Yes, Gene. GENE (standing up) Greetings, everyone. I just wanted to inform you that I have accepted a position as assistant manager at the E-Flix Multiplex, and, more to the point, we are currently hiring. The employees break into excited CHATTER at the news. GENE (cont’d) Danny, we’re even looking for another projectionist. DANIEL (still eating) I’m in. BEN Okay, well-- BEN (cont'd) 61. GENE If anyone else is interested, or if you have any further queries, I will be out in the lobby, imminently. BEN Okay, well. Thanks, everyone. The employees rise from their seats and start filing out. Ben watches as Autumn exits, deep in conversation with Lamont. AUTUMN So I saw Girlhood last night. LAMONT And? AUTUMN You were right-- I loved it! Oh my god, that ‘Diamonds’ scene will stick with me forever! LAMONT Sublime, right?! Once everyone leaves, Ben remains in the theater. He sits in a seat and looks around, taking it all in for one last time. EXT. MARINA PARK - BERKELEY - DAY 71   71 Ben and Sasha sit on a grassy hill overlooking the bay. Sasha smokes a cigarette. Nearby, several families fly kites. SASHA So... I need to talk to you. BEN Whenever someone says that, it always means “I’m about to really bum you out.” SASHA Well...maybe. I don’t k",
      "dialogue_count": 0,
      "word_count": 2465
    },
    {
      "scene_number": 10,
      "slugline": "EXT. COMMERCIAL SPACE - DAY 85   85 PULLING BACK, we see the above images popping on and off a large digital screen, on a loop. The screen is suspended inside the window of a spartan Lower East Side storefront. Standing side-by-side on the sidewalk, Ben and Alice stare into the window intently. ALICE It’s definitely her, right? I mean, I know all Asian girls look the same to you, but-- BEN Will you shut up for a minute while I try to...process this? ALICE (looking closer) God, I had no idea how hot she was. No offense, dude, but you have always punched above your weight-- BEN I said, shut up! INT. LEON’S STORE - CONTINUOUS 86   86 Ben and Alice push through a glass door, into a large, open space. A few clothing racks are positioned, seemingly at random, around the room. Ben and Alice approach the lone employee ZOA (early 20s), who is seated behind a desk littered with photos of models, Miko among them. ZOA Can I help you? ALICE We were just curious about the photos in the window...? ZOA Aren’t they totally amazing? Alice smiles politely, Ben makes a face like “Not really.” ALICE Do you know anything about them? Where they came from? ZOA Oh, Leon handles all the promo himself. 74.",
      "characters": [],
      "action_text": "BEN And Leon is...? ZOA Leon Alexander? He designs the clothes. This is his boutique. The employee points to a MASSIVE BLACK AND WHITE PHOTO on the wall of a tall, confident BEARDED MAN (early 40s, white), working on his designs at a draft table. ALICE Ah...humility! BEN What about the...model on the screen? Do you-- ZOA Oh, I have no idea where he finds them! EXT. CITY STREETS - CHINATOWN - DAY 87   87 Ben and Alice walk along a bustling Chinatown street. Ben eats a large steamed pork bun. ALICE So, is it over, or...? BEN Why would it be over? ALICE Uh, maybe because she’s been living some skanky double life out here? BEN So she wanted to try...modeling or whatever. She probably thought I wouldn’t be “supportive” if she told me about it. ALICE And she’d be wrong? BEN No, I would’ve been a total prick about it! In a way, I basically forced her to lie. 75. ALICE It’s just so weird to think of her doing that. It’s like if I found out you were a mime or something. BEN Look, it’s embarrassing, but, you know...I acted like I was Autumn’s biggest fan. Do I have to remind you of the pee photos? ALICE Nope. BEN And I sat there and listened intently while Sasha droned on and on about grad school. So I have to be supportive of some stupid shit. That’s just what you do in a relationship. ALICE Uh, those weren’t “relationships--” BEN You know what I mean. ALICE But also, you were horny for those other girls. That’s like the ultimate motivator. BEN (loudly) I never said I wasn’t horny for-- A passerby turns and looks in Ben’s direction. Alice laughs, as they descend into a Brooklyn-bound subway station. EXT. CITY STREETS - BROOKLYN - NIGHT 88   88 A few quick shots at dusk: The Fulton Mall, Prospect Park, Greenwood Cemetery, skyline from DUMBO, etc. EXT. ASIAN-AMERICAN INDEPENDENT FILM INSTITUTE - MANHATTAN - 89   89 DAY Ben and Alice walk through a crowded business district. Ben, holding a BOUQUET OF FLOWERS, glances up from his phone as they arrive at a nondescript doorway. 76",
      "dialogue_count": 0,
      "word_count": 1482
    },
    {
      "scene_number": 11,
      "slugline": "INT. ART AND DESIGN STORE - DAY 96   96 Miko and Leon stroll through the store, browsing the furniture. LEON (in Japanese)  So where do you want to eat?  MIKO (in Japanese)  Can we go to that Japanese place that’s upstairs? Near St. Mark’s?  LEON) (in Japanese)  Yeah, let’s get a drink at the bar first.  They continue to chat as they head towards the exit, arms around each other. Ben and Alice, their backs turned, lurk a few displays down. ALICE (whispering) What did they say? BEN (whispering) How the fuck would   I   know? INT. O’DALY’S BAR - NIGHT 97   97 Ben, Alice, and Meredith stand near the bar, waiting for drinks. BEN I can’t believe she’s with a fucking rice king. ALICE Well, we don’t know that he’s necessarily a-- BEN He was speaking Japanese! He’s a white guy with big beard who was speaking Japanese! ALICE Wait, what does a big beard have to do with it? 82.",
      "characters": [],
      "action_text": "BEN I don’t know! MEREDITH Well, I can see why you’re upset, but there’s nothing inherently wrong with someone having a type. If there’s real love between two people, then-- BEN Yeah yeah yeah. But let’s be honest, okay? (quietly) Just between us? I mean, you see a white guy with an Asian girl....you just assume “rice king.” Right? ALICE Oh boy... Meredith blanches. MEREDITH And when you see an Asian man with a white woman, you think...? BEN Good for him! Good for both of them! And you know...you never second-guess that relationship, right? It’s like, “Wow, he must be a really cool guy! And she’s so evolved!” The bartender places the drinks on the bar: bottled beer for Ben and Alice, a vodka soda for Meredith. ALICE (to Meredith) I know for a fact that he actually agrees with you. He’s just in his over-the-top provocative mode. INT. O’DALY’S BAR - A FEW MINUTES LATER 98   98 Ben, Alice, and Meredith are now seated in a booth. BEN Come on. You know there’s something kinda creepy about a big, older white guy who’s horny for skinny Asian girls. I mean, what do you think   that’s   about? 83. MEREDITH I actually don’t think it’s “about” anything. Ben laughs incredulously. MEREDITH (cont’d) If you’re implying an undercurrent of--what? fetishism? pedophilia?-- then what’s the flip-side to that line of thinking? BEN I don’t know. What--? MEREDITH Is your attraction to white women a sublimated form of assimilation? Are you trying to elevate yourself in society’s eyes by-- BEN What are you...where’d   that   come from? ALICE (to Ben) Sorry... BEN Jesus...you don’t have to turn this into a personal attack on   me ! I’m just... MEREDITH No, no...it’s not an attack. I just think it gets a little tricky when you start making moralistic generalizations based on your own wounded ego. BEN Wow. ALICE (to Meredith) He’s had a hard day. 84. MEREDITH I know, and I’m sorry. I just don’t know if it’s appropriate for someone--particularly a cishet male--to ascribe negative psychological i",
      "dialogue_count": 0,
      "word_count": 861
    },
    {
      "scene_number": 12,
      "slugline": "INT. MEREDITH’S APARTMENT - KITCHEN - MORNING 100   100 Early morning. A pot of coffee in a metal percolator is on the stove. As he waits for it to boil, he looks at his phone. We see that Ben is looking at @leon212’s pictures of Miko again. He focuses on one image in particular: Miko staring up from a messy bed, one bra strap off her shoulder. Ben “unpinches” to zoom in, revealing a familiar FLOWER-PATTERNED PILLOWCASE beneath Miko’s tousled hair. Ben looks up from the phone, a stunned, fuming expression on his face, as the percolator starts to GURGLE. EXT. MEREDITH’S BUILDING - BROOKLYN - MOMENTS LATER 101   101 Ben exits Meredith’s building, gets his bearings, then sprints in the direction of the subway. INT. DAILY PROVISIONS CAFE - DAY 102   102 Ben sits in the chair where Alice sat previously, his gaze fixed out the window. Eventually, something out the window catches his attention. He springs to his feet. EXT. LEON’S BUILDING - MANHATTAN - CONTINUOUS 103   103 Ben exits the cafe, walking with determination. He crosses the street towards Leon and Miko, who are talking amiably. BEN (to Leon) Did you fuck her in my bed? MIKO (startled) Oh my god, Ben! Are you crazy? BEN Did you take the shitty photos first, and then fuck her, or...? LEON (in Japanese, to Ben) Ben , let’s just calm down.  MIKO No--he doesn’t understand-- LEON (kicking himself) Sorry, I shouldn’t have assumed-- 87.",
      "characters": [],
      "action_text": "MIKO What the hell is this, Ben? Did you come all the way here to spy on me? Are you that much of an asshole? BEN Absolutely, I am a giant asshole! But I think it’s warranted in this case-- Leon protectively pushes himself between Ben and Miko. LEON Now, I appreciate that this is an awkward situation for all of us. We’re not meeting on the best of terms here. BEN Yeah, I generally prefer a more formal introduction to the guy who’s fucking my girlfriend. LEON Okay. Let’s all just take a deep breath...Ben, look-- He gently puts his hand on Ben’s shoulder. BEN Don’t fucking touch me! Ben angrily swats Leon’s hand away. Leon springs into a “kung fu” pose, crouching down with his hands raised, a fierce expression on his face. He holds the pose, as if expecting Ben to attack. Ben and Miko both look at Leon, perplexed. BEN (cont’d) What? You gonna do some tai chi on me? Or... Leon chuckles, dropping his pose. LEON Okay, yeah, that was absurd... I’m sorry, it’s just a reflex from decades of training. BEN (to Miko) Of course he’s a martial arts guy. MIKO That’s enough, Ben-- 88. BEN (to Leon) No, come on. You wanna go, let’s go, man. I know you’re dying to do your version of that Tarantino movie. LEON What? BEN Oh, you know the scene where Brad Pitt kicks Bruce Lee’s ass. I bet that’s like your   fantasy,   isn’t it-- Miko looks exasperated, like she’s heard Ben rant about this a million times. LEON Actually, no, no, it is not. Ben looks intrigued. LEON (cont’d) I mean, overall, I thought it was a great film, but I despised the idea of aggrandizing a fictional white protagonist by denigrating a real Asian American icon. Now, I know there’s some theories out there that it was actually-- BEN All right, shut the fuck up! Miko rubs her eyes, wearily. Leon takes a breath. LEON Ben... I just want to say, I’m sorry for this. I understand your anger, and-- Leon puts his hand on Ben’s shoulder again. BEN I said don’t! Ben swats it away, and Leon once again, jumps into a fighting pose",
      "dialogue_count": 0,
      "word_count": 1870
    },
    {
      "scene_number": 13,
      "slugline": "INT. MEREDITH'S APARTMENT - LIVING ROOM - CONTINUOUS 108   108 SILENCE as Ben enters. Alice is on her feet, clearly agitated, and Meredith sits on the couch. Uncomfortable glances all around. BEN (pointing at Meredith) She’s right. ALICE What? BEN She’s right, and I’m gonna do the most helpful thing I can think of... I’m gonna go home. Ben pulls out his phone and taps on the screen. BEN (cont’d) Okay. Gonna take the next flight I could get. He taps and swipes, deep in concentration. ALICE What? No... MEREDITH Ben, I don’t want you to misunderstand-- BEN Definitely no misunderstanding. Ben continues to tap on his phone, and then looks up. BEN (cont’d) (to Meredith) Meredith. I’m sorry you had to meet me at this point in my life. I mean, (chuckles) I’m sure you would’ve hated me anyway, but-- MEREDITH No... BEN Yes you would’ve -   ALICE It’s true. BEN ...but the fact is, you happened to catch me at my absolute... 97.",
      "characters": [],
      "action_text": "Alice and Meredith wait as Ben struggles to find the word. BEN (cont’d) ...uh... MEREDITH Nadir?   BEN (cont'd) Nadir! I’m always afraid I’m gonna mispronounce it. Meredith smiles, unsure what else to say. ALICE (to Ben, cautiously) Did you see her? Ben nods, solemnly. The room falls SILENT. At last, Ben notices something that we’ve already seen in the background: several dozen pastel-colored HELIUM BALLOONS, bundled together and tied by ribbons to a chair. BEN What’s with all the fucking balloons? INT. O’DALY’S BAR - NIGHT 109   109 A diverse group of friends fills the dark, neon-lit room, talking and drinking. The helium balloons from the previous scene decorate the space. Meredith stands up on a stool as the CHATTER and MUSIC die down. MEREDITH Uh, I just wanted to say thanks for being here. I don’t know if getting another year older is really something to celebrate at this point, but I will still allow you to buy me drinks. LIGHT LAUGHTER from the crowd. MEREDITH (cont’d) Um, so last month I got dragged to a party I didn’t really want to go to, and I got introduced to a friend of a friend from California even though I didn’t really want to be introduced to anyone, least of all someone from California. Sorry... 98. ANGLE ON: the crowd. People reacting with LAUGHTER. MEREDITH (cont’d) Now I’m gonna say something that I don’t say very often: I was wrong. I was wrong about the party, I was wrong about getting introduced. I might still be right about California, but anyway...that’s how I met Alice, and, as most of you know, I’ve since fallen head-over- heels for her. ALICE She’s falling down drunk! ANGLE ON: the crowd. People reacting with HOOTS and LAUGHTER. MEREDITH But listen...she just told me that she’s moving here, and that’s honestly the best present I could imagine. So...YOUR LOSS, CALIFORNIA! LAUGHTER and APPLAUSE. MEREDITH (cont’d) So keep buying me drinks, but buy Alice a drink, too, and welcome her to her new home! Meredith climbs down from her chair, int",
      "dialogue_count": 0,
      "word_count": 1016
    },
    {
      "scene_number": 14,
      "slugline": "EXT. LEON'S BUILDING - DAY 116   116 Ben arrives at Leon’s apartment, out of breath. With great urgency, Ben presses a button on the buzzer repeatedly. No answer. He presses the buzzer again and again. Finally, he gives up. He turns to leave, but suddenly stops in his tracks. He looks across the street. ANGLE ON: Miko and Leon seated side-by-side in the cafe window. Miko is drinking coffee while Leon fusses with an elaborate pot of green tea. Their interaction is warm and comfortable, and a radiant smile breaks across Miko’s face. Ben takes a last look, nodding his head. The reality of the situation sinks in, and at last, he seems at peace. He turns and walks off, dragging his suitcase. OMIT 117   117 OMIT 118   118 INT. TAXI - MANHATTAN - DAY 119   119 As the sun sets, Ben sits in the back of a taxi. CAB DRIVER (O.S.) Which terminal, sir? INT. AIRPORT - FOOD COURT - NIGHT 120   120 Ben sits surrounded by cheerful, chatty groups of travelers. In the background, we see the garish neon of a Panda Express- style establishment. Chopsticks in hand, Ben hunches forward and starts to eat from a styrofoam box. TAM (O.S.) Is anyone sitting here? Ben looks up, startled, his mouth full of food. He stares into the eyes of an unbelievably beautiful woman named TAM (Asian, early 30s). She smiles sweetly at Ben, waiting for his reply. BEN (cheerfully) No! 102.",
      "characters": [],
      "action_text": "He wipes his mouth with a napkin, gesturing towards the empty chair. Tam smiles again. TAM Thanks. Then she abruptly drags the chair to a nearby table, where she settles in with her happy Asian-American family (husband, two kids). Ben’s face falls, and he returns to his meal. INT. AIRPLANE - NIGHT 121   121 The cabin lights are dim. Ben sits, pensive. He glances over at an ELDERLY ASIAN WOMAN sitting in the row ahead From his POV, her profile is illuminated by the SEAT BACK SCREEN in front of her. She smiles, wiping a tear from her eye. Ben leans over to get a look at what she’s watching. CLOSE ON: the screen, again from Ben’s POV. It’s the movie that Ben and Miko saw at the Asian Film Festival. Ben sits back, his mind suddenly awash in thoughts. EXT. MEXICAN RESTAURANT - BAR - OAKLAND - NIGHT 122   122 Sasha sits at a bar with PILAR (28), while surrounded by a group of friends. They laugh and talk warmly, as they both casually swirl and sniff their glasses of wine. INT. ART GALLERY - OAKLAND - NIGHT 123   123 A mix of scuzzy bohemians and elite art collectors fill the glowing, white-walled space. Within the crowd, we spot Autumn, who greets a group of friends (including Lamont, Gene and Jeffery, now fully clothed) enthusiastically. She gestures to the gallery wall behind her, where we see a massive INSTALLATION OF POLAROIDS. INT. CITY STREET - MANHATTAN - NIGHT 124   124 Miko, more stylish and fashionable than ever, strolls confidently down a picturesque West Village street. She ducks into an unassuming doorway. INT. RESTAURANT - MANHATTAN - NIGHT 125   125 Miko enters a tiny, austere sushi bar. Leon is the only customer, and he greets Miko with a kiss. 103. The wizened JAPANESE CHEF places two astonishingly perfect pieces of sushi in front of them. Miko and Leon each take a bite of sushi, responding with eye-rolling ecstasy. INT. MEREDITH'S BUILDING - HALLWAY - BROOKLYN - NIGHT 126   126 In the hallway, Meredith adjusts the nameplate frame of her apartment door, w",
      "dialogue_count": 0,
      "word_count": 1016
    }
  ]
}