{
  "slug": "sicario-2015",
  "title": "sicario",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 7,
  "characters_count": 1,
  "characters": [
    "MATT"
  ],
  "total_words": 18457,
  "total_dialogue": 1,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. MACY’S APARTMENT -- BATHROOM -- NIGHT. We stare at the spout. Water washes over us. We look at the drain. Dirt, blood, and small fragments of pink, white, and navy blue circle the drain as gravity carries them to the sewers of Phoenix. Dark brown hair is vigorously scrubbed. Macy does not relax in this shower-- that is not its purpose. The purpose is to decontaminate. INT. BATHROOM -- MOMENTS LATER. Macy stands in front of the mirror, brushing her hair. There are abrasions on her cheek and a deep cut that runs down from the corner of her eye-- like she cried a scar. The hair brush catches. Pulls her head back. MACY OW. She extracts the brush. Feels around on her scalp and retrieves a piece of bone. Looks at it... She wraps it in toilet paper, sets it on the counter, and gets back in the shower. Turns it on. Gonna try this again... INT. MACY’S LIVING ROOM -- NIGHT. The decor is Spare. Functional and nothing more. Doesn’t even tease herself with pictures on the wall. Macy walks in wearing a large men’s t shirt, nothing else. Her COMPUTER CHIRPS. ROSALYN4620 is asking that she chat. Macy looks at the screen. MACY (CONT’D) Not tonight mom. Keeps walking. Her cell phone rings. Call display: MOM. MACY (CONT’D) Uhh... (Answers it) Mom, it was a really tough-- ROSALYN (V.O.) Everyone sure missed you today. Macy’s body tenses and deflates at the same time. MACY Me too. You get my card?  9.",
      "characters": [],
      "action_text": "MOM (V.O.) Get on the computer. I want to see you-- MACY Mom, I just got -- MOM (V.O.) It’s my birthday goddammit- MACY I’m signing on. She hits a button on her computer and ROSALYN MACY, 60 today, appears. She leans back and forth in front of the lens, still unsure about this technology that beams her image through space. MOM Can you see me? MACY Stay in one place, Mom. Happy birthday. Sorry I didn’t call- MOM Can you see me? I don’t see you. Lean forward -- there you are... What happened to your face? Rosalyn’s happy mood is gone. MACY Nothing. It’s something on your lens. MOM Kate. I can see it. MACY Like I said, rough day. Silence. MOM What a waste of a law degree, Kate. Macy holds her tongue, but it takes effort. MACY Who came to the party?  10. MOM Evan sent me a card. I thought that was very sweet. Have you two spoken? Macy sighs. MACY No. MOM Well... I hope you two will become friends. MACY I’m sure we’ll be great friends, Mother. Nothing like a divorce to bring people closer. Beat. MOM You look tired. MACY I am... (forces a smile) Happy birthday. How does it feel to be 60? MOM It would feel a lot better with a grandchild, and I don’t think it’s unreas-- Macy slams the laptop closed. She rubs her eyes... So tired. Her cell phone rings. She flips it open, angry -- MACY I DON’T WANT TO TALK ABOUT GRANDCHILDREN. (It isn’t mom) Yeah, umm... I can, I can be there in, say thirty minutes? Yes sir. Hangs up. Day’s not over. CUT TO: INT. HOMELAND SECURITY COMMAND CENTER -- PHOENIX -- NIGHT. Macy and Reggie sit in chairs against a glass wall. NEWS FOOTAGE of the blast plays on monitors along the wall of a command center filled with activity.  11. In the glass office behind them, a dozen men in suits. Jennings, in the same shape as Macy, has deflated into a chair, Phil sitting beside him. Macy turns and looks through the wall at the men. REGGIE Know what’s going on? MACY No idea. Jennings makes eye contact with Macy through the glass. For the first time, he seems old t",
      "dialogue_count": 0,
      "word_count": 1322
    },
    {
      "scene_number": 2,
      "slugline": "INT. TINY HOUSE -- NOGALES, MEXICO -- DAY. Morning sun hits closed eyes. Dark, fat face. Beads of sweat on his brow and cheeks. Thick mustache. His name is SILVIO. A SHADOW falls over him. He feels it. Eyes pop open, tense. BOY’S VOICE Papa? A smile crosses Silvio’s face. BOY’S VOICE (CONT’D) Despirtate. SILVIO No. Silvio closes his eyes. The little boy taps him on the chest. BOY’S VOICE Si. Silvio’s smile grows. It is a game. SILVIO No. We see the boy now. He is eight. Bright brown eyes. His name is ELISEO. SILVIO (CONT’D) SI!! Tengo un juego de futbol! Silvio acts surprised. SILVIO (CONT’D) Nooooo... The boy laughs and grabs his father’s hand, tugging. ELISEO Si Papa! Tenemos que ir! The boy pulls with all his might. Silvio makes a show of resisting, then climbs out of bed. Eliseo keeps a tight hold of his hand, and walks him down a hall to a small kitchen with adobe walls and a dirt floor. An opening leads to a small patio that now serves mostly as a chicken coop. Two chickens are in the kitchen. A woman stands over a stove, cooking.  17.",
      "characters": [],
      "action_text": "ELISEO (CONT’D) Papa necessita cafe y juevos! Tenemos priso mama! She turns and smiles at her son, the bright star in her black life. Her eyes pass over Silvio. She stopped loving him years ago, but he adores their little boy... At least they have that. He sits down. She scoops eggs onto a plate with tortillas, drops it in front of him. Hands him a coffee. He sniffs it, hands it back. Without a word she pours in two fingers of tequila. The boy stares at his father with endless joy. No idea how unlucky he is. Silvio stares back, winks. The boy smiles. EXT. SILVIO’S HOUSE -- DAY. Silvio and Eliseo exit the house. Silvio wears a State Police uniform, dressed to intimidate. The boy wears his uniform, dressed to play soccer. They walk past cinder-block houses, one after the other, cracked and faded from the sun. Tejano music, car horns, and distant yelling penetrate the morning. Two ARMORED PERSONNEL CARRIERS drive past. Silvio and Eliseo wander away, Eliseo’s tiny hand clinging to Silvio’s police belt. Eliseo has his father for the whole day and he isn’t letting go. They turn and disappear around the corner. Only thing on the street is a stray dog burying itself in an overturned trash can... The mascot of this dying city. CUT TO: EXT. BEACH -- SOUTH OF CARTAGENA -- DAY. We are back with Alejandro, holding a man under water. Face to the sun, somehow able to focus fully on the task at hand while escaping to someplace else. He lets the man up. Coughing, heaving up salt water, and sobbing. He looks at Alejandro with the pleading eyes of a man whose will has been broken.  18. MAN Colonel Guteman. Yes... ALEJANDRO And you too... He nods. ALEJANDRO (CONT’D) Say it. MAN Of course me too! If the Americans would leave, you would see... no one is pure. Alejandro lets the man up and pushes him toward the shore. We now see the man wears a MILITARY UNIFORM. He walks ahead of Alejandro, looking back. The man makes a half hearted attempt at attacking Alejandro, who pushes and spins him",
      "dialogue_count": 0,
      "word_count": 993
    },
    {
      "scene_number": 3,
      "slugline": "INT. CHEVY TAHOE -- DAY. Reggie drives, Macy riding shotgun. Through the windshield, we see the entrance to LUKE AIR FORCE BASE approaching. REGGIE You’re back tonight? MACY Yeah. I’ll call you, let you know what time. REGGIE I don’t understand why they don’t want me there... She deflects. MACY It’s El Paso... Don’t think you’re missing much. REGGIE Well... you keep your eye on that doughy prick in the golf shirt... She smiles. MACY I’m supposed to worry about you. REGGIE This isn’t what we do, Kate. MACY We do what we need to do. EXT. LUKE AIR FORCE BASE -- PHOENIX --   DAY. Reggie pulls to the guard post, hands over their ID’s. An AIR FORCE MP takes them, compares ID’s to a list. AIRPORT MP (To Reggie) You’re not on here. REGGIE I know. What’s she supposed to do? AIRPORT MP Walk. Macy opens the door and steps out.  22.",
      "characters": [],
      "action_text": "MACY I’ll call you when we’re heading back. She walks around the front of the Tahoe and disappears with the MP into the guard house. EXT. LUKE AIR FORCE BASE -- PHOENIX -- DAY. Macy walks toward the runways, looking around, unsure where to go. MATT (O.S.) Kate. She turns, sees Matt. MATT (CONT’D) This way. MACY Am I late? MATT No. We just landed. She walks to him and they head off. Alejandro sits on a bench, patiently. They walk to him. MATT (CONT’D) This is my bird dog, his name’s Alejandro. He stands. ALEJANDRO Hello. MACY Kate Macy. Alejandro studies her. ALEJANDRO Have you been to Juarez before? MACY No... Wait, we’re going to El Paso, right? MATT Yeah, we’ll talk about it on the plane.  23. He walks off, they follow. He leads them to a GULFSTREAM G650. MACY We’re taking this? MATT Yeah. MACY Really... Okay... They climb in. INT GULFSTREAM G650 They strap themselves in as the pilot speaks with the tower. Macy sits beside Alejandro. Studies him. He looks like a doctor or accountant, but there is an absent manner to his actions, as though nothing warrants his full attention but the weight of his thoughts. He catches her looking at him. ALEJANDRO What is your experience with operations like these? MACY None... What IS the operation? He gives her a polite smile. ALEJANDRO Sleep if you can. Juarez will demand all of your focus. He lays his head back and closes his eyes. Macy looks at Matt. MACY Are we going into Juarez? Shakes his head. Could be interpreted as a ‘no’. MACY (CONT’D) DOD flies around in Gulfstreams now? MATT You guys don’t have one? She laughs. MACY Right... Food on this flight?  24. MATT They got some bitchin peanuts in the back. Kind of a self-serve deal though. He puts his head back, closes his eyes. She looks over at Alejandro who is already asleep. Macy’s wired. No chance of sleep. Pulls a magazine from the seat back as the plane begins to taxi... CUT TO: -- FLASH BACK -- WE SEE: Alejandro’s face in profile. Sunlight spilling over him through a sm",
      "dialogue_count": 0,
      "word_count": 8770
    },
    {
      "scene_number": 4,
      "slugline": "INT. BUFFALO CHIP -- BAR -- LATER. Macy and Reggie sit at a long table, many beers in. They are easy together... Would be easy to make a mistake tonight and fuck up a great partnership, but they’ve walked this line many times before. REGGIE I think some of these girl’s are getting drunk enough to forget they’re racist. MACY Oh for God’s sake, a Black man is president. Racism is dead, and even if it wasn’t when he popped Bin Ladin he won over the hold outs. A blonde thing is smiling at him. REGGIE Yeah, baby. Reggie notices a HANDSOME COWBOY. Tall, broad shoulders... REGGIE (CONT’D) I know him. MACY Who? REGGIE He’s Phoenix PD. MACY (Spots him) Really... Invite him over. REGGIE HEY! TED! Ted turns to the sound. Seems surprised to see Reggie. Walks over. He carries what looks like a gym bag. REGGIE (CONT’D) What do you got there man? TED I rode tonight. REGGIE A bull? No shit?  67.",
      "characters": [],
      "action_text": "TED Yeah. Were you watching? REGGIE For a minute, how’d you do? TED Tossed right out of the chute. (Sees Macy) Hi. She smiles a bit. Shy even... REGGIE Sit down, man. TED Let me grab you guys some beers, what is that? REGGIE Anything, man. He walks off. MACY Married? REGGIE All yours. In my basketball league. MACY Good guy? REGGIE He’s great. Sergeant in vice. Divorced, couple kids I think... Macy watches him as he orders. The girl beside him, much younger and pretty, is chatting him... He’s chatting back. She retreats into her shell, feeling foolish for thinking it would be that easy to meet someone... She clouds. Reggie notices. REGGIE (CONT’D) I’ma cock block that little blonde for you... gonna be a sacrifice... MACY Yeah... Thanks. Reggie walks up to Ted and the girl, charms his way between and gabs them both. We see Macy, letting herself be hopeful...  68.",
      "dialogue_count": 0,
      "word_count": 320
    },
    {
      "scene_number": 5,
      "slugline": "INT. BUFFALO CHIP -- LATER. Reggie, the blonde, Ted, and Macy all sit together. Ted sits beside Macy -- the battle lines are drawn for the night -- she is his. He is showing them the cinch that goes around the bull’s belly. TED You wrap this around and then- (he grabs Macy’s arm) I’ll demonstrate. He wraps the nylon belt around her hand once, twice, three times... REGGIE I know where this is going -- MACY Don’t discourage him. Know how long it’s been since someone tied me up? Ted and Macy share a charged look. She smiles. TED Don’t give me any ideas. MACY I’m trying very hard to give you ideas. The tension of it, the flirt of it, she looks ten years younger... Alive. They hold each other’s eyes, almost like a dare... He’s captivated by her. TED (softly) I want to take you outside. There it is... Macy surrenders with a smile... MACY Okay. They stand like school kids. TED Scuse us. We’re just gonna... REGGIE Mmhmm. MACY Take a look around back.  69.",
      "characters": [
        "MATT"
      ],
      "action_text": "REGGIE Yeah. TED Watch my bag. We watch them walk off through the club. EXT. BUFFALO CHIP SALOON -- NIGHT. We are looking at the sheet metal outer wall of the saloon. Macy’s head comes hard into frame, Ted’s right after. They devour each other. She tears at the snaps of his shirt, runs her hand along his chest, grabbing a handful of chest hair and pulling. He tears frantically at her pants. Gets them unbuttoned and slips his hand inside. Her head flies back in ecstacy. MACY What am I -- Uhh. With one hand she attacks his belt and pulls at the zipper of his jeans. She reaches into his jeans. His turn to moan... INT. BUFFALO CHIP -- CONT. Reggie has the cinch and is toying with the blonde girl. REGGIE See you can also... let me show you... She laughs at his attempt to do the wrap Ted did. REGGIE (CONT’D) Fuck it.( He pulls out his handcuffs) We’ll just use these. She loses herself in laughter. GIRL Okay... (she motions to Ted’s bag) Anything else fun in there? REGGIE Let’s see... Shows her Ted’s hand cuffs. GIRL Did you two plan this??  70. He laughs, then spots something else. At the bottom of the bag, he sees it -- A computer print out of a photo from the Wells Fargo security camera... A PHOTO OF MACY. Everything about Reggie changes. REGGIE Got a cell phone? GIRL Yeah... What? REGGIE Call 911. Right fucking now, call 911. Puts his badge on the table. REGGIE (CONT’D) Tell them I said so. Read them the badge number. And Reggie is gone. The girl starts dialing. EXT. BUFFALO CHIP -- CONT. MACY’S back is against the Sheet metal, Ted pressed against her. Bare legs wrapped around him. He thrusts deep inside her. It is rapid, almost angry. She needs this. Release is coming, she moans freely now, she’s so close-- We see something moving toward them in a blur. Reggie’s fist slams the side of Ted’s face. It knocks him out of frame, exposing Macy completely naked below the waist, legs spread wide against the wall. She panics, reaching down to pull up her pants and falls over a",
      "dialogue_count": 1,
      "word_count": 2654
    },
    {
      "scene_number": 6,
      "slugline": "INT. SILVIO’S HOUSE -- NOGALES, MEXICO -- DAY. Silvio sits in his little courtyard, watching the chickens. He tosses a handful of feed and they scamper after it. He drinks a beer. Three empties beside him. He looks at his watch. It’s time. He gets up. EXT. STASH HOUSE -- NOGALES -- DAY. Three state Police Vehicles. One being loaded full of bricks of marijuana. Silvio stands beside the car, smoking. INT. US GOVERNMENT SUBURBAN -- DAY. Matt sits in the front seat. A Delta operator driving. Macy, Reggie, Alejandro and three Delta operators sit in the back. Matt is on his cell. MATT What. What. What’s he saying? VOICE Um. Hold on... They called him back. He’s on the road now. MATT Where. VOICE Turning left on Scottsdale. You got about three hours and he’ll be across. Matt turns back to the Delta operators. MATT We’re gonna have to hit the tunnel the minute we get on the ground. Matt looks at Macy and Reggie. MATT (CONT’D) Pretty exciting, huh? They don’t share his enthusiasm. They just want this to be over. INT. RANGE ROVER -- DAY. Manuel is sweating, even though the AC blasts in his face. On the seat beside him is an overnight bag. EXT. INTERSTATE 10 -- PHOENIX -- DAY.  83.",
      "characters": [],
      "action_text": "We watch Manuel’s Range Rover get on the interstate. VOICE He’s on I 10, travelling southeast... EXT. MEXICAN ROAD -- LATE AFTERNOON. A MEXICAN STATE POLICE VEHICLE ambleS down the road, heading toward the tunnel... INT. POLICE VEHICLE -- MEXICAN ROAD -- CONTINUOUS. Silvio drives, marijuana bundles fill the backseat. He smokes a cigarette, he slows down, pulls off the pavement. EXT. MEXICAN ROAD -- CONTINUOUS. We watch from a distance as Silvio’s vehicle bounces down a dirt road, disappearing into the desert as the sun hides behind the horizon. INT. US GOVERNMENT SUBURBAN -- NIGHT. We pull off the highway and stop. A man in a ghillie suit stands up, walks toward them carrying a camera with an 800mm lens. Matt turns toward us. MATT On foot from here. EXT. TRANSPORT VEHICLE -- CONT. Macy steps out and sees another vehicle parked. Another half dozen men in full camo. From the back of the Suburban, six duffel bags are opened. Operators reach in and grab weapons, magazines, grenades. Generation 4 night vision goggles are passed to everyone. DELTA walks up to Reggie and Macy. DELTA Keep your fucking safeties on and the barrels pointed down. Stay in the back and don’t shoot anyone on my fucking team, got it? Doesn’t wait for a reply. REGGIE We HAVE done this before.  84. MACY I don’t think we’ve done THIS. They move out. We watch the world through NIGHT VISION GOGGLES. We run a bit then kneel down. We are flagged forward. Kneel down. We leap frog this way forever. Macy looks out over the desert. TWO COYOTES(the animals), are stopped, staring right at us. Macy makes eye contact. They begin trotting off, never breaking eye contact with Macy, as though they are begging her to follow. While she still can... We come to a rise. Everyone lays down. DELTA whispers to Alejandro. DELTA Rules of engagement on this deal? ALEJANDRO I don’t use those. Ask Matt. DELTA turns the other way. DELTA Rules of engagement? MATT Weapons free, my friend. He whispers it down the line. Reggie’s eyes",
      "dialogue_count": 0,
      "word_count": 2552
    },
    {
      "scene_number": 7,
      "slugline": "EXT. FAUSTO ALARCON ESTATE -- NIGHT. We near an isolated estate. We turn off the main road to a private road that leads a mile or so onto Fausto’s hacienda. As the large house comes into view. VEHICLES can be seen parked in front. We approach a car along the road, a man sitting on the hood. Manuel rolls his window down. MANUEL Soy Manuel Diaz. GUARD Si, te conosco. El Jefe esta esperando. The rear window rolls down. A pistol comes out. A silenced round is fired into the face of the man. He falls back on the hood. ALEJANDRO Drive. MANUEL What happens when we get to the house? ALEJANDRO You get out and walk toward them. MANUEL What will happen to me? ALEJANDRO What you do now is for your family. There is no you. MANUEL You think you are so different? ALEJANDRO No. Not anymore. Now I am the same. Turn the car a bit more to the left. The car stops. THREE MEN stand in the driveway with automatic rifles. The Range Rover is parked so the right headlight is pointed directly toward them. Manuel opens the door and we are-- EXT. FUASTO ESTATE -- CONT.  96.",
      "characters": [],
      "action_text": "Manuel walks toward the men -- looking for a way out of this. GUARD 2 Senor, buenos noches. MANUEL Cuidado hombres-- Alejandro takes his pistol and presses the silenced barrel to the top of manuel’s head, pulling the trigger and driving Manuel into the ground like a nail. As Manuel’s body drops, Alejandro fires on all three men -- hitting them all in the head, killing them instantly. He walks to the front door, opens it... INT. FAUSTO ESTATE -- CONT. A man rounds the corner into the main foyer and without slowing down, Alejandro touches the barrel to his forehead and fires. We can hear the sound of talking in another room. Alejandro moves to it. INT FAUSTO’S KITCHEN/ DINING ROOM FAUSTO, 50’s, graying hair. Big belly. Sits at the head of the table. JACINTA, 30’s trophy wife, sits beside him gulping wine. They have three CHILDREN, two girls and a boy. A woman in her 60’s cooks in the kitchen. JACINTA RAPIDO, MAMA!, tengo hambre! Alejandro walks into the room, presses his foot against Jacinta’s side, and launches her out of frame, then sits next to Fausto, presses the gun to his shoulder and fires. The children scream. Mama turns, Alejandro points the gun at her. ALEJANDRO SIENTATE! AQUI!! She comes around and sits as ordered. Jacinta stands up. FAUSTO (SUBTITLE) He’ll kill you. Stay still. ALEJANDRO (SUBTITLE) Your children speak English?  97. FAUSTO No. ALEJANDRO Then we will spare them. I interrupted dinner. Please... Continue. Fausto stares at him. ALEJANDRO (CONT’D) Every night, you have families killed, and yet you dine. Tonight should be no different. Points the pistol at him. ALEJANDRO (CONT’D) Eat. He slowly fills a fork, puts it in his mouth. Tells his children to do the same. They chew their meal and cry. Alejandro turns to the old woman. ALEJANDRO (CONT’D) Take the children away from here. She rises and hurries the children out of the dining area. ALEJANDRO (CONT’D) (Points the gun at Jacinta) You. Whore. Sit over there. She sits. Alejandro turns to Fausto,",
      "dialogue_count": 0,
      "word_count": 1846
    }
  ]
}