{
  "slug": "silicon-valley-508-fifty-one-percent-2018",
  "title": "silicon valley 508 fifty one percent",
  "genre": "action",
  "format": "series",
  "scenes_count": 7,
  "characters_count": 0,
  "characters": [],
  "total_words": 7533,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. PIED PIPER OFFICES, BULLPEN - DAY (D33) 801   801 A LARGE MONITOR displays a graphic: \"Days until launch: 0.\" RICHARD pops into frame in front of the timer, wearing an actual Peter Pan-style PIED PIPER HAT. RICHARD Everybody ready?!? REVEAL: Richard's got the whole PIPER COSTUME on. He crosses to a workstation where GILFOYLE preps the launch protocol. RICHARD (cont'd) Photo time! Front-enders, bring it i n. Where are my back-end guys? There you are. Crypto-geeks. Quickly. Let's do this. The entire company nervously gathers around. JARED Holden. Are we set? HOLDEN nervously fumbles with the timer on a CAMERA that's rigged on a STEP LADDER. HOLDEN Sorry... I haven't used this camera before. JARED Are we set? HOLDEN Yes, Jared. Holden is frazzled, but finally gets it ready. RICHARD Okay, everybody, here we go.   We may not have had the budget we wanted to get here, but here we are. This is the moment where all our hard work pays off. The first ever decentralized internet goes live in FIVE, FOUR, THREE, TWO, ONE... Richard lifts a Piper's PIPE, reaches forward, clicks a MOUSE as everyone looks at the camera and cheers. BECKY grabs DANNY and KISSES him. Several people look shocked at this as we FREEZE. SV 508   Final Shooting Script   1.",
      "characters": [],
      "action_text": "THEN, we PULL OUT to REVEAL we are... INT. PIED PIPER OFFICES, BULLPEN - TWO MONTHS LATER (D34) 802   802 The camera DUTCHES as it pulls back, and we see the PHOTO hangs askew on the wall of what is clearly a grim and quiet Pied Piper workplace. There seem to be less people here than before. COTS are scattered in the office. SUPER: \"TWO MONTHS LATER.\" -- A CODER walks into the kitchen, which is now devoid   of most snacks. RECYCLING BINS are piled high. The coder opens the fridge. Nothing. He knocks over a bunch of EMPTY WATER BOTTLES which clatter to the floor. -- A CODER sleeps at his desk. A FISHBOWL with green scummy water and a DEAD PLANT sit on the desk. Someone runs through frame in the BG, toward Richard's office. TIGHT ON: Feet running across the office. INT. PIED PIPER OFFICES, RICHARD'S OFF ICE - CONTINUOUS (D34) 803   803 Richard sits at his desk, head in hands. A figure enters frame. It's DINESH. DINESH Richard? You need to see this. Richard looks up, REVEALING: He has two months of BEARD GROWTH, he looks terrible. RICHARD What's wrong now? REVEAL: Dinesh also has two months of BEARD GROWTH. DINESH No, it's a good thing. A good thing has happened. RICHARD Are you fucking with me? DINESH No. I swe ar. SV 508 Final Shooting Script   2.",
      "dialogue_count": 0,
      "word_count": 448
    },
    {
      "scene_number": 2,
      "slugline": "INT. PIED PIPER OFFICES, BULLPEN - MOMENTS LATER (D34) 804   804 Dinesh leads Richard through the messy offices towards a workstation where Becky and a few other engineers are clustered, hopeful smiles on their faces. DINESH Look. Look at the user numbers. RICHARD Holy shit... is that right? DINESH I think it is. I think... we've reached the inflection point. Richard beams. Dinesh beams. Danny puts his hands   on Becky's shoulders. DANNY We made it. He rubs her shoulders. She is clearly repulsed by his touch. She looks at him, disgusted. BECKY Don't. Just... don't. DANNY Yeah. Sorry... OPENING TITLES INT. PIED PIPER OFFICES, BULLPEN - NIGHT (N34) 805   805 A celebration in progress. The STAFF and the DEVELOPERS are there. Richard addresses the room. RICHARD Guys, it's been a tough couple of months. Our growth has not   been where we needed it to be. But what did I keep saying? HOLDEN Give us time, and then we'll climb, bitches! RICHARD Yes. Well, not the \"bitches\" part, but thank you, Holden. (MORE) SV 508 Final Shooting Script   3.",
      "characters": [],
      "action_text": "You see, I knew that if we just RICHARD (cont'd) kept plugging, eventually we'd get some traction and hit an inflection point. And... as you all know, it's happened. We are now gaining almost twelve thousand users an hour! People applaud. HOLDEN Fuck yeah! He starts going through the crowd: HOLDEN (cont'd) You get a high five!... You get a high five!... And it doesn't stop! DINESH sotto, re: Holden (   ) Jesus, J ared. You really did a number on this kid. JARED I just chipped away at everything that wasn't Richard's assistant, and this is what's left. Holden tries to high five Gilfoyle, who stops him cold with a withering stare. RICHARD Anyway... tomorrow it's back to work conquering the world, but tonight, we celebrate. I especially want to say thanks to you, our seven developers -- our Septapipers -- who st uck with Pied Piper through thick and thin. Unlike K-Hole, who took their game and completely bailed on us. People boo and hiss. HOLDEN chants (   ) Lock them up! Lock them up! RICHARD Yes, thank you, Holden. Lock them up, indeed. Richard toasts. Everyone applauds. Holden keeps chanting. SV 508 Final Shooting Script   4. JARED beams (   ) He's incorrigible! INT. SHENZHEN MANUFACTURING FACILITY - SAME TIME (N34) 806   806 YAO and LAURIE stand on the catwalk overlooking the factory floor. LAURIE How are things advancing? YAO To date, we have manufactured almost four hundred thousand mobile devices. LAURIE I see. And we're signing them all onto the Pied Piper network? YAO Yes. We have to do it manually. It is slow, but it provides an advantage: They may not know what we are doing until it is too late to stop us. WORKERS bring CRATES OF PHONES to large tables, where ROWS OF TECHNICIANS methodically sign up for Pied Piper on phone after phone. The finished phones are put in different crates and taken away. LAURIE I see. YAO Sorry. Are you displeased? LAURIE No. On the contrary. YAO So then, to be clear, you are happy with our progress   here? LAURIE Indeed. YAO Yes.",
      "dialogue_count": 0,
      "word_count": 4250
    },
    {
      "scene_number": 3,
      "slugline": "EXT. LOS TRANCOS CAMPGROUND, WOODS - MOMENTS LATER (D35) 825   825 Tesla in the BG, Dinesh and Jared walk over to the edge of a hill, look down to see the source of the sounds: In a hollow below, a huge, tricked out RV. Booming and thudding video game explosion noises emanate from within. Jared and Dinesh exchange looks, head down the hill. INT. SHENZHEN MANUFACTURING FACILITY, OFFICE - SAME TIME 826   826 ( D35) Yao and Laurie sit in Yao's office looking at a HOOLICHAT WINDOW of Gavin from his kitchen. LAURIE You want us to turn off all of our phones? GAVIN BELSON Listen to me: Right now we're in a standoff. You can't win. But if you back off, I can. I have more devices than anyone.   I will reach fifty-one percent and take control of this little shit's network. A nervous Richard appears behind Gavin. RICHAR D Guys, if I can weigh in here? I think this is a really bad idea. Gavin turns the webcam so Richard is framed out. He continues. GAVIN BELSON In exchange for deleting your principal competition, I'm simply asking you for a partnership between your venture and Hooli. Richard appears in frame again. RICHARD He's leaving Hooli. They're firing him. Gavin turns the camera again. SV 508 Final Shooting Script   26.",
      "characters": [],
      "action_text": "GAVIN BELSON I'm sure my board would find an arrangement between YaoNet and Hooli   vastly preferable to fire sale-ing the company to Jeff Bezos. My proposal is, I help you in exchange for a twenty percent stake in your venture. RICHARD I would like to make a counterproposal... that you not do that. Beat. LAURIE Gavin? How do we proceed? YAO Because... unsure (   ) We like it. INT. SHENZHEN MANUFACTURING FACILITY   – SAME (D35) 827   827 The production line of phones churns along, workers signing up for Pied Piper accounts. ON THE BALCONY: A FOREPERSON approaches with a MICROPHONE, we hear a weird announcement TONE, then... FOREPERSON Mandarin, SUBTITLED (   )  Stop the line!  The workers stop. FOREPERSON (cont'd) Mandarin, SUBTITLED (   )  Turn off all the phones. Quickly!  The workers look around, a little confused, then... The prod uction line basically starts running in reverse. The bins of phones that were being taken away are brought back. Workers who were subscribing are now turning the phones off. EXT. LOS TRANCOS CAMPGROUND - DAY (D35) 828   828 Dinesh and Jared approach the thudding RV. They open the door. SV 508 Final Shooting Script   27.",
      "dialogue_count": 0,
      "word_count": 417
    },
    {
      "scene_number": 4,
      "slugline": "INT. COLIN'S RV - CONTINUOUS (D35) 829   829 Dinesh and Jared burst inside to see Colin inside, playing a violent VIDEO GAME on an 80\" TV, surrounded by BEER, CHIPS and HOMICIDE. COLIN Hey, guys. What are you doing here? JARED We tried to call you. DINESH Like a hundred times. COLIN Oh. Yeah. I'm off the grid. INT. PIED PIPER OFFICES, BULLPEN - SAME (D35) 830   830 Gilfoyle types a few keystrokes. Then... GILFOYLE An d... done. MONICA All right. So the patch is ready? GILFOYLE Indeed it is. And maybe some day, Dark Lord willing, we can run it and -- GONG! Holden hits the gong. HOLDEN Boo-yah! We just crushed the patch, Pipers! MONICA Holden, give me that fucking mallet... Monica heads for Holden, who struts away. BEDEEP! An alert sounds. Gilfoyle looks at a THREE HORSE RACE display. Yao's numbers are going down now. So G avin's percentage is going up. GILFOYLE What...? He picks up his phone, dials. SV 508 Final Shooting Script   28.",
      "characters": [],
      "action_text": "GILFOYLE (cont'd) into phone (   ) Care to tell me what the hell's going on? INTERCUT WITH: INT. GAVIN BELSON'S HOUSE, KITCHEN - SAME (D35) 831   831 Richard's on the phone, looking at his laptop on the counter. Gavin happily turns the crank on an old-fashioned HAND CRANK ICE CREAM MAKER in the BG. RICHARD Gavin's fucking us. He just convinced Yao to pull his phones. I gave him a knife to hold off Yao and now he' s turning around and slitting our throats with it. Gilfoyle eyes the THREE HORSE RACE: Yao is fading fast, Gavin is surging toward fifty-one percent. GILFOYLE Fuck. Can you kill his devices? RICHARD No, he had his server guy lock us out. We need Colin. We need   Galloo . Now. INT. TESLA - SAME (D35) 832   832 Dinesh, Colin and Jared (in the backseat) drive along. DINESH Well, the road is pretty straight from here, so hang on to your kidneys, motherfuckers. We're going Ludicrous. Dinesh taps the control console. But... DINESH (cont'd) What the fuck? INT. PIED PIPER OFFICES, BULLPEN - SAME TIME (D35) 833   833 Priyanka checks her PHONE, answers. SV 508 Final Shooting Script   29. PRIYANKA into phone (   ) What? INTERCUT WITH: INT. TESLA - DAY (D35) 834   834 Dinesh, Colin and Jared drive along. Dinesh holds up his PHONE, on speaker. DINESH Valet Mode? You stuck me in fucking Valet Mode? PRIYANKA You wrecked your Tesla. You're not wrecking mine. DINESH Come on! That caps me at seventy MPH and limits performance to eighty kilowatts! COLIN We could go back and take my RV. It might be faster. DINE SH You have to let me go to Ludicrous Mode! Now! I have been a total gentleman about this. And I have Colin! PRIYANKA Fuck you. I want two more months of payments. DINESH One more month. PRIYANKA Fine. Do not crash. She hangs up, opens the Tesla app on her phone, toggles off Valet Mode. INT. TESLA - CONTINUOUS (D35) 835   835 The car pulls to a stop. Dinesh sees Valet Mode turn off. The Ludicrous Mode option a ppears. SV 508 Final Shooting Script   30. DINESH Here we go",
      "dialogue_count": 0,
      "word_count": 1505
    },
    {
      "scene_number": 5,
      "slugline": "INT. GAVIN BELSON'S HOUSE, KITCHEN - SAME TIME (D35) B840   B840 It dawns on Gavin he's been had. GAVIN BELSON into phone (   ) Scott! Run the patch! Delete Pied Piper! INT. HOOLI, ENGINEERING PEN - SAME (D35) 840   840 Scott turns to see a MONITOR behind him, showing the Pied Piper bar surging above fifty-one percent and Gavin's bar dropping below. SCOTT into phone (   ) It's not working. We've lost control of the networ k. INT. GAVIN BELSON'S HOUSE, KITCHEN - SAME (D35) 841   841 Richard keeps dancing. RICHARD Aw. I guess that's because we've gained control. He turns his laptop to face Gavin, who sees the tables have turned. Richard raises his phone. RICHARD (cont'd) into phone (   ) Gilfoyle? When you're ready. INT. PIED PIPER OFFICES, BULLPEN - SAME (D35) 842   842 Gilfoyle, Monica and the engineers are gleefully looking at the monit ors. GILFOYLE into phone (   ) Bombs away. Gilfoyle clicks and GAVIN'S USERS DISAPPEAR. The TWO HORSE RACE quickly becomes a ONE HORSE RACE. Pied Piper's got total control. SV 508 Final Shooting Script   36.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 183
    },
    {
      "scene_number": 6,
      "slugline": "INT. HOOLI, SERVER ROOM, SUB-BASEMENT D - SAME TIME (D35) 843   843 John gives an odd look at the Box Threes as they stop whirring and go dark. He shrugs, bites a DONUT. INT. HOOLI, ENGINEERING PEN - SAME TIME (D35) A844   A844 Scott looks at a monitor as everyone panics. SCOTT What the fuck happened? Behind him, Rogelio enters with TWO COFFEES, sees the mood of the room, turns and backs out. INT. COLIN'S HOUSE   - SAME TIME (D35) 844   844 Jared melting with relief. JARED You did it, Colin! You saved us! COLIN Nah, man. It was all Dinesh. That was some fucking quick thinking. INT. TESLA - SAME TIME (D35) 845   845 SLO-MO: Dinesh is in the passenger seat, his face warped in ecstasy. DINESH Eeeeaaaaghghghgh!!! Officer Gronski drives, face also warped in perverse joy. OFFICER GRONSKI FFFFfffuuuuuuuuu -- MATCH CUT TO: HOLDEN'S FAC E 846   846 Spittle flying as Holden flexes and screams: HOLDEN FUCK, YEEEEEAAAAHHHHHHH!!!! REVEAL WE ARE... SV 508 Final Shooting Script   37.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 170
    },
    {
      "scene_number": 7,
      "slugline": "INT. PIED PIPER OFFICES, BULLPEN - DAY (D35) Holden stands on the ping pong table. MONICA Holden! Get down from there! GILFOYLE to Monica (   ) Hey, check it out. He gestures to a screen with the PIEDPIPERCOIN PRICE DATA on it. It ticks up. GILFOYLE (cont'd) It's going up. MONICA Well, look at that... Gilfoyle produces the BOTTLE OF PAPPY VAN WINKLE, starts pouring it into TWO PLASTIC CUPS. INT. GAVIN BELSON'S HOU SE, KITCHEN - SAME (D35) 847   847 Richard is packing up his stuff once again. In the BG Gavin is on HooliChat with Yao and Laurie. GAVIN BELSON Come on, don't be assholes. We can still do our deal. You still need an American partner for your network, don't you? LAURIE I believe we're now entitled to explore other options. YAO We will tell Jeff Bezos you say hello. looks to Laurie (   ) Yes? LAURIE Yes. YAO pleased (   ) Y es. With that, the HooliChat goes dark. SV 508 Final Shooting Script   38.",
      "characters": [],
      "action_text": "RICHARD Thanks for the help, Gavin. Richard heads off past a stunned Gavin. Then comes back, picks up the BOWL OF ICE CREAM. RICHARD (cont'd) And thanks for the ice cream. EXT. GAVIN BELSON'S HOUSE - MOMENTS LATER (D35) 848   848 Richard strolls away from Gavin's house with the ICE CREAM. Something SMASHES into a window in the house. GAVIN BELSON (O.C.) distant (   ) Fuuuuck! CUT TO BLACK. Then... FADE IN: INT. OFFIC ES - A FEW WEEKS LATER (D36) 849   849 Monica leads Richard, Dinesh, Gilfoyle and Jared up a flight of stairs into an elegant suite of offices filled with CODERS working. On one wall is a VIDEO FIREPLACE. MONICA And we'd be right up here. DINESH I love that video fireplace. JARED Magnificent. GILFOYLE A bit bright, no? RICHARD This seems great. When do these guys move out? MONICA Oh, no. This isn't our space. We'd be right through here. SV 508 Final Shooting Script   39. Monica leads them through a WHITE DOOR that's oddly reminiscent of the open of 501. The guys exchange a concerned look. INT. OFFICES, NEW SPACE - MOMENTS LATER (D36) 850   850 A door opens and they all enter. MONICA Here we go. What do you think? We start to pull out... RICHARD I'm sorry. What part of this would we be renting? As we continue to pull out, the space seems to have no end. MONICA All of it. RICHARD W hat? JARED Richard, we're signing new developers every day. That's going to require hundreds of new engineers. MONICA And the staff to support them. HR, legal, accounting, government affairs. We keep pulling out... RICHARD Why do we need that? MONICA To deal with things like the NSA. They called yesterday. They have a lot of questions about our tech and about inserting a backdoor. We can push back. RICHARD A gainst the government? DINESH I don't love that. SV 508 Final Shooting Script   40. GILFOYLE I do. Our guys are now tiny in frame, lost in the massive space. MONICA Want to see the second floor? RICHARD There's another floor??? MONICA Three more actually. This all used to b",
      "dialogue_count": 0,
      "word_count": 560
    }
  ]
}