{
  "slug": "sing-street-2016",
  "title": "sing street",
  "genre": "comedy",
  "format": "film",
  "scenes_count": 17,
  "characters_count": 4,
  "characters": [
    "PENNY",
    "CONOR",
    "BRENDAN",
    "ROBERT"
  ],
  "total_words": 23840,
  "total_dialogue": 4,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. CONOR’S KITCHEN (CONTINUOUS) - DAY  We find ourselves in a large kitchen. High ceilings and rattling sash windows, in what 100 years ago was a fine Georgian home. Now, things are a little faded. The room is cold and unwelcoming. Very little on the shelves. A family on a budget. Sitting around the kitchen table are: Conor (no black eyes yet), and his parents, PENNY and ROBERT, both in their mid forties. They’ve just finished a meal of Spag Boll. Though it’s more Spag than Boll. Penny fills up her glass of cheap supermarket wine.   Robert picks his teeth with a toothpick. He is drinking a whiskey and smoking. Penny checks her watch. They are sitting in silence, as if waiting for something to happen. Conor is wearing a woolly hat, and his coat, indoors. Card:  ONE MONTH EARLIER  INT. CONOR’S KITCHEN (CONTINUOUS) - DAY  Finally, the sound of someone racing down the stairs from above. The door opens and BRENDAN, (20), tumbles into the room carrying an ash tray, glass of wine, tobacco pouch, rolling papers and matches. He sits down at the vacant seat, beside his brother. Brendan has long hair, and a moustache. He’s handsome. BRENDAN This meeting has been called to order. Pray proceed. He lights a cigarette. ROBERT Okay, so we wanted to talk about finances. Penny? PENNY What? Go ahead. BRENDAN (to his brother) This is going to be heavy. ROBERT Well, as you might have noticed- your mother and I are really struggling at the moment, like the rest of the country. I haven’t had a single commission this year. Your mother is on a three day week. It doesn’t look like it’s going to get much brighter.  5.  (CONTINUED)",
      "characters": [
        "PENNY"
      ],
      "action_text": "He knocks back his drink. The kids wait for what’s coming next. PENNY So we’ve had a look through the accounts, and we see quite a significant saving if we were to alter the education situation. CONOR What “education situation”? BRENDAN (intuiting) He means your school. They’re taking you out of school. CONOR (excited) What?! ROBERT We’re not   taking   you out of school. We’re   transferring   you from one school to another. CONOR Why!? ROBERT We have to make some cuts to the budget. I’d suggest taking your brother out of college, but he’s already dropped out of his own volition. BRENDAN (raising a glass) Thank you Dad. CONOR Cuts? I’m already wearing three jumpers, indoors. And a hat. I read by candlelight! And it’s the 1980s. I’m like Tiny Tim up there! Brendan laughs. ROBERT Don’t act so entitled. I grew up in a council house with five brothers. BRENDAN (mock surprised) Really? Tell us about that dad. For the first time ever.  6.  (CONTINUED) PENNY A school that’s close by. So there’s no transport costs. You can cycle in. And you can get lunch back here. There’s two savings already! It’s a non-fee paying school. ROBERT Those Jesuits are far too soft on you anyway. BRENDAN The Jesuits have a long history of education. ROBERT So do the Christian Brothers. Silence. CONOR Who are the Christian Brothers? BRENDAN The Christian Brothers, Conor, are a order of the Catholic Church, appointed in the education, formation, and beating of their young charges. ROBERT Oh be quiet Brendan! Six years at the hands of the Jesuits yourself, and look at what they did for you! BRENDAN Well they didn’t   beat   me. PENNY Brendan! Cut that out. Synge Street is a perfectly reputable school. You’ll settle in in no time. CONOR You can’t just change in the middle of the year. Just when I’m making friends and settling in. This could scar me. Long-term! ROBERT Just deal with this, Conor. You know what the Christian Brother’s motto is? “Viriliter Age”. That means “Act Manly”. This meeting is ",
      "dialogue_count": 1,
      "word_count": 4962
    },
    {
      "scene_number": 2,
      "slugline": "EXT. THE YARD - LATER  Now Conor walks through puddles in the yard. His socks are already developing holes. INT. ART CLASS - LATER  Conor sits in art class. This class is made up of about twelve kids. Including Conor. There’s some interesting art on the walls. Conor rubs his feet together, trying to keep warm. MISS DUNNE (40s), sits on the corner of her desk. She has a curvy figure, and a mane of dyed blonde hair. She has a Dublin accent. She has a scented candle lit on her desk. A few flowers in a glass. MISS DUNNE Right, so most of yiz picked this class because ye didn’t wanna do mechanical drawing. Am I right? Most people nod. MISS DUNNE Yiz think art class will be a doddle? A chance to get a break in the day and scribble a few pictures in between other classes? A few lads nod in agreement. MISS DUNNE Right, well you’re not completely off the mark. This gets a little laugh. MISS DUNNE Art should be a break from the rest of the world. It should never be work. It’s kind of... therapy. But don’t think you’re not going to learn something in here. I’m going to impart   some   information to ye, okay? So when you’re out with a girl at the National Gallery, you can look at a painting and SAY something about it. Okay? A few nods and mutterings of acceptance. Mick Mahon puts his hand up. MICK MAHON I’ll take you on a date to the National Gallery any day, miss.  27.  (CONTINUED)",
      "characters": [],
      "action_text": "MISS DUNNE Ah, thanks, Michael. But I have a fiance already. MICK MAHON Are you sure? MISS DUNNE Positive. She puts on her glasses to get a closer look at Conor’s feet under his desk. MISS DUNNE What the hell is going on here? CONOR Oh. I don’t have black shoes. So I have to leave my brown ones in Brother Baxter’s office every day until I get some. She shakes her head. INT. THE CANTEEN - LATER  Conor enters the canteen in his bare feet. He looks around. Up ahead in a little group, he sees Barry. He musters up the courage, and approaches, tapping him on the shoulder. Barry Bray turns around. Other kids notice this. CONOR Hey. I understand that you’re in pain. That there is a conflict within you. And that can’t be easy to deal with in this school. You publicly humiliated me. So now, I publicly forgive you. Barry Bray. EXT. THE SCHOOL - MORNING  Conor now has the TWO black eyes of the opening scene. Darren stands beside him. He marches off towards the GIRL across the street. We hold on Darren this time. In a few moments, Conor returns: CONOR We need to form a band...  28.",
      "dialogue_count": 0,
      "word_count": 471
    },
    {
      "scene_number": 3,
      "slugline": "EXT. A SMALL COTTAGE - DAY  Conor and Darren stand at the front door of a small, run-down cottage on a narrow lane way. They are not wearing their school uniforms. It’s out of school. Darren knocks on the knocker. DARREN Eamon’s a genius. He can play every instrument known to man. His hobby is rabbits. After a while we hear footsteps thundering down the stairs. The door opens and EAMON (14), stands there. Eamon wears stone-washed denims, matching DENIM (!) jacket, a crew neck jumper, and white, dirty boot runners. He has curly hair, and wears steel-rim glasses. He sports a wicked mullet. DARREN Hey Eamon. What you doing? EAMON Nothing. I was just feeding me new bunny. Howareya Darren. DARREN Cool. This is Eamon. Eamon, this is Conor. He’s new in the school, and he’s putting together a band. EAMON So? INT. EAMON’S LIVING ROOM - MOMENTS LATER  Eamon’s small living room has been transformed into a band- rehersal space. In a semicircle in the corner of the room is a drum kit, guitar amp, keyboard, and microphone. Conor looks about, impressed. CONOR Wow! Where did you get all this gear?? EAMON Me da’s in a covers band. Weddings, parties, pubs. Close up on the logo on the kick drum: “EAZY LIVIN’” with some glittery stars. DARREN Eamon can play every instrument known to man, can’t you Eamon?  29.  (CONTINUED)",
      "characters": [],
      "action_text": "EAMON Probably. DARREN Show him. FOUR VERY QUICK SHOTS: Eamon plays the bass guitar, slapping. The drums. The guitar, soloing. And the keyboard, playing jazz. CONOR Wow. So/ But Eamon isn’t finished. SIX more very quick shots. Eamon is playing an African Balaphone. Next, he’s playing an Indian flute. Then the Uilleann pipes. Then a shaker. Then a Conga drum. Finally he is done. He’s clearly something of a prodigy. EAMON What do you play yourself? CONOR (thinking on his feet) I’m more of a singer. Eamon waits for him to go on. CONOR And I write songs. Well, I mean, lyrics. Words. But I haven’t put them to music yet. EAMON So what do yous want from me? DARREN We want to hire your instruments. CONOR (interrupting) No way. You’ve got to be IN the band. You’re amazing. Right Darren? DARREN Are you into that Eamon? We can see that Eamon is very glad to be asked, but bluffs a little: EAMON What kind of music are you going to be doing? CONOR I don’t know yet.  30.  (CONTINUED) EAMON You have to know what you’re going to play. What are you into? CONOR I’m a futurist. EAMON What does that mean? CONOR Like no nostalgia. Not like your dad’s band. Not looking backwards. Just forwards. EAMON Cool. Like Depeche Mode? CONOR (not knowing them) Okay. EAMON Or Joy Division? CONOR (bluffing) Right. Eamon sure knows his stuff. EAMON Or Duran Duran. What do you think of them? CONOR (beat, then parroting Brendan) The jury is out on which way those guys will go. They’re a lot of fun, and James Taylor is one of the most proficient bass players in the UK right now, giving them a funky edge. Silence. Eamon is impressed, even though Conor has got John Taylor’s name wrong. EAMON JOHN Taylor. CONOR Yea. John. Of course. They stand there, sizing each other up.  31.  (CONTINUED) EAMON I’ll be in the band. I’ll play guitar. And help write the songs. We can rehearse here because me da’s in Saint John Of Gods. DARREN Is that a pub? EAMON No, Darren. It’s where alcoholics go to get off drink and stop ",
      "dialogue_count": 0,
      "word_count": 1233
    },
    {
      "scene_number": 4,
      "slugline": "INT. NGIG’S SITTING ROOM - MOMENTS LATER  The three lads stand in a small, tidy living space. In front of them, NGIG (14), a black kid, stocky, well built. DARREN (very slowly) WE-ARE-PUTTING-A-BAND-TOGETHER. I- AM-THE-MANAGER. NGIG What the hell is wrong with   him ? When he speaks, he speaks in a tough, inner city Dublin accent. DARREN Oh. You sound different from your ma? NGIG ‘Course I do, I’ve been here half me bleedin life. What did you expect. CONOR Would you have any interest in being in a band? He clearly is. NGIG Maybe. What kind of music are yous playing? EAMON We’re not 100 percent sure yet. But do you play any instruments? He is about to shake his head, when his mother interrupts. NGIG’S MOTHER Of course he does. He’s black. Ngig looks doubtfully at his ma. She nods her head. Music starts up on the track. It’s sketchy, out of time, but vaguely recognizable. It’s a bad cover version of RIO, by Duran Duran. INT. SYNGE STREET SCHOOL CORRIDOR - DAY  Song over. TRACK out from the flier. Two KIDS are writing down the number from the flier on the wall. They are identical twin rhythm section, GARRY and LARRY (14).  36.  (CONTINUED)",
      "characters": [],
      "action_text": "It is hard to read the number, as the poster is covered in an array of Spunking Dick drawings. INT. EAMON’S LIVING ROOM - DAY  Conor sings into a microphone. Eamon plays rhythm guitar. Garry fingers a bass guitar. His twin brother Larry sits behind the drum kit. Ngig cycles through sounds on an early synthesizer.   He has no real idea what he’s doing. Conor is hesitant and nervous. Though he can sing, he has zero presence. It’s chaos. They are all dressed in their school uniforms and look awful. TRACK down to find a tape casette recorder on a chair in the middle of them. It is RECORDING. The song ends. NGIG Not bad. GARRY Sounds great. NGIG I think we sped up a little. EAMON Really? We were shit. LARRY Yeah, it’s a shit song. We should be a metal band. CONOR It’s not the song. It’s us. It was all over the place. Let’s try it again. LARRY Smoke break! EAMON What? NIGIG Cool. I’m gasping for a smoke! They all run out. Eamon sighs, looking at Conor, the only other one who hasn’t left his station.  37.",
      "dialogue_count": 0,
      "word_count": 399
    },
    {
      "scene_number": 5,
      "slugline": "INT. THE SHED - MOMENTS LATER  ALL of the band are crammed into the shed smoking. NGIG So what are we called? They think. EAMON The Rabbits? NGIG What is wrong with you and Rabbits?? EAMON I just love them. So fluffy. Those ears. Not a dog. Yet not quite a cat. And manageable shit. Just, the perfect pet. CONOR I have an idea. What about “La Vie”. Silence. Darren looks at him, witheringly. DARREN What does that mean? CONOR It French for “The Life” GARRY What’s French for “That’s not going to be the name of the band”? CONOR (beat) “C’est nes pas le nom du groupe” GARRY Right. There you go. EAMON What about Sing Street. They think about this. Not bad. CONOR I like that. INT. BRENDAN’S ROOM - NIGHT  Song continues.  38.  (CONTINUED)",
      "characters": [
        "CONOR"
      ],
      "action_text": "Pull out from Brendan’s tape machine. Conor is playing his brother his first demo tape. The tape reads “SING STREET” DEMO 1. If it sounded bad live this afternoon, it sounds worse played back on a small tape machine. Conor chews his nails in anticipation of his big brother’s response. Brendan finally ejects the tape before it’s over. BRENDAN This is BAD. And there’s nothing as bad as bad music. And you must never play this again. To Conor’s surprise, he begins unspooling the tape, pulling it out in a pile at his feet. CONOR You know you can record over tapes? BRENDAN No no. All evidence of this day must be destroyed. He finally bins the tape. BRENDAN That’s a novelty act. You want to get the girl right? CONOR What? BRENDAN (shouting, impatient) The Girl! That’s what this is about? Right? CONOR (thinking) Oh. Yes. The girl. Right. Okay. BRENDAN Right. So you’re going to get her with someone else’s art? Are you kidding me? CONOR I suppose. But we’re just starting out. We need to learn how to play. BRENDAN Play? PLAY? You don’t need to know how to play! You think the Sex Pistols knew how to play? Who are you, Steely Dan?  39.  (CONTINUED) Brendan is coming into his own. He leaves his chair, pacing the room. Pulling different records from his collection. He now has the first project of his adult life: his brother. BRENDAN You have to learn how to NOT play. That’s rock n roll. And that takes practice. (beat) And you’re not a covers band! CONOR Really? BRENDAN Every school has a covers band. Every wedding. Every pub. And in every covers band there’s a middle aged man who never knows if he could have made it because he never had the balls to write a song for someone. Rock n Roll is a risk. You risk being ridiculed. Conor thinks about this. CONOR I don’t know how to write a song. Brendan now has a large pile of records in his arms. He points at the door. BRENDAN Close the door. And sit down. CONOR Really? I have school in the morning. BRENDAN THIS... is school. Conor closes",
      "dialogue_count": 1,
      "word_count": 1280
    },
    {
      "scene_number": 6,
      "slugline": "EXT. SYNGE STREET SCHOOL - NIGHT  The three of them run back across the road by moonlight laughing. Music plays over. EXT. A LANE-WAY - MORNING  The band are setting up their instruments on a rainy morning. They are down a little laneway at the back of a row of shops. Piles of rubbish, old bins, and an abandoned car. It’s overcast and depressing. And cold. Their guitar amps and drum kit look pretty small out in the open. EAMON It looks like loads of gear back home, doesn’t it? And yet it looks shit here. Conor is setting up the video camera across from them on a tripod. He looks through the viewfinder. It does look shit. He checks his watch. DARREN Where is this chick? CONOR (worried) I don’t know. DARREN Did everyone bring some clothes? They start rooting through plastic bags stuffed with clothes from home. Larry holds up a pair of flares. Garry, a child’s cowboy outfit. DARREN Who the hell brought a cowboy outfit? GARRY Me. It’s all I could find. DARREN No one dresses as a cowboy in a band! LARRY There’s a cowboy in The Village People.  44.  (CONTINUED)",
      "characters": [],
      "action_text": "GARRY Yeah. And Adam Ant. EAMON Adam Ant is a highway man. LARRY So we can have a highway man, but not a cowboy? Are you mentally ill? GARRY So what did   you   bring then? Hard cut. EXT. LANEWAY - MORNING  Conor is dressed as a low-budget New Romantic. A mash-up of ideas from a cross section of TV. Nothing quite works. He’s wearing sunglasses, bangles, his father’s long overcoat with the sleeves rolled up, and a blouse that definitely belongs to his mum. Eamon is dressed in his Dad’s show-band uniform. A purple, velvet suit that is way too big for him. He’s a little Austin Powers. EAMON It’s me Da’s showband outfit. Garry, Larry and Ngig are unimpressed. Darren isn’t sure. GARRY Is this a gay band? CONOR Coming from the one who wants to look like The Village People. GARRY What’s gay about The Village People?? As the others squabble, Conor’s attention is drawn to the end of the lane, where Raphina has just appeared. He smiles. She approaches carrying a large bag. She looks great, in a huge Angora sweater, pencil skirt and high heels. RAPHINA Hello all. Sorry I’m late. I was out last night. At a night club. Still recovering. She takes off her sunglasses, dramatically, looking them up and down.  45.  (CONTINUED) RAPHINA Jesus Christ. What in God’s name are ye all wearing? CONOR Yeah, we’re just working that out. Maybe you can help. RAPHINA Who’s your wardrobe person? Stevie Wonder? CONOR We don’t have a wardrobe person. RAPHINA Right. Who’s the camera man. Maybe he can make some of this work. CONOR Em... We don’t really have... DARREN I’m the camera man. RAPHINA I thought you were the producer. DARREN AND camera man. Saving money all the way. Conor takes her by the elbow, walking her out of earshot a little. CONOR What did you think of the song? RAPHINA I liked it. It’s the only reason I’m here. Did you write it? CONOR Pretty much. Eamon wrote most of the music. RAPHINA So you wrote the lyrics? They’re cool. Who are they about? CONOR Just a girl, I see her about. RAPH",
      "dialogue_count": 0,
      "word_count": 3034
    },
    {
      "scene_number": 7,
      "slugline": "EXT. SYNGE STREET - RAPHINA’S HOUSE - NIGHT  Conor returns down Raphina’s street. He pulls up outside her house across the school, and walks through her gate, climbing the steps. He takes a brown envelope covered in sellotape from inside his jacket and looks at it. RAPHINA He stuffs it through the letter box and heads off, cycling away, looking up at one of the lights in the window. INT. RAPHINA’S ROOM - NIGHT  This is a tiny, monastic little room. There are some posters on the wall, and a small single bed under an alcove. A small dresser with mirror. A chair. Raphina enters, carrying a bowl of cereal. She sits down on her bed. She is still wearing her clothes. In a moment, a knock on the door, and a head pops in. This is MRS. KIRWIN (60), a matronly looking woman in an apron. She is carrying Conor’s envelope. She passes it to Raphina. MRS. KIRWIN This came through the letter box for you. RAPHINA Oh. Thanks. MRS. KIRWIN Is it from that older lad? RAPHINA No. MRS. KIRWIN You know how I feel about that, Raphina, don’t you? RAPHINA Yes. Thank you. Night. Mrs. Kirwin nods, exiting. MRS. KIRWIN Lights out in ten. She pulls the door closed, and Raphina opens the envelope. There’s a cassette in side. With NEW SONG written on it.  59.  (CONTINUED)",
      "characters": [],
      "action_text": "She locates a little tape player from under her bed, and puts it in, pressing play. SECOND SONG The song begins on acoustic guitar with Conor singing. Raphina smiles as she recognizes his voice. She sits down at her dresser and begins combing her long hair, starting to take off her makeup and kicking off her shoes. The song is instantly catchy, and clearly a love letter from Conor to her. As the song hits the chorus, we PAN off her face, and start a 360 slowly around her room as the song plays over. There’s a family photograph on her locker. A 10 year-old Raphina in the company of her parents. They all look very stiff and awkward. A school profile of Raphina in her uniform, a couple of years ago. Very troubled. Off this to various pictures she ripped out of glamour magazines. Models. Big hair. Lots of make up. A poster of Tom Waits. Of The Cure. Of Siouxsie and the Banshees. There’s a teddy bear on her bed, with a pair of sunglasses on his nose, and an unlit cigarette stuffed into his mouth. An ash tray with a few sticks of incense. A collection of cassette tapes. Cartons of cigarettes. Two books on her locker- Catcher in the Rye and To Kill A Mocking Bird. Numerous magazines. Vogue, You, Cosmopolitan. As the song comes towards its end, we have arrived back around on Raphina. She has transformed. She’s changed into her pyjamas and dressing gown. And she’s taken off her makeup to reveal a bruise, under her eye, and a cut lip underneath. She has paused what she’s doing, and her eyes have filled with tears as she listens to the song. EXT. A STREET - NIGHT  The song cross cuts with Conor cycling at night through town. FADE TO BLACK.  60.",
      "dialogue_count": 0,
      "word_count": 538
    },
    {
      "scene_number": 8,
      "slugline": "EXT. SYNGE STREET SCHOOL GATES - A NEW DAY  Music plays over as Conor turns the corner into the school gates. There is a little confidence in his step this time. He has bleached his hair blonde, and styled it so this falls over his eyes a little in a NEW ROMANTIC way. He is wearing a little mascara and a little shadow. People stare at him. As he passes us, we PULL onto BROTHER Baxter, who watches from above. INT. ART CLASSROOM - DAY  Conor sits in art class. He is painting a picture of his band. Miss Dunne leans over his shoulder. MISS DUNNE I like it. What is that? CONOR My band. MISS DUNNE You’re in a band? Cool. What are they called? CONOR I don’t know yet! What about “La Vie”. It’s French for “The life”. MISS DUNNE I know. I like that. In a moment, there is a knock at the door, and a FIFTH FORM KID enters. FIFTH FORMER Headmaster wants to see Conor Lawlor. Miss Dunne nods. Conor gets up, heading out with the fifth former, worried. EXT. SYNGE STREET YARD - DAY  Conor follows the fifth former as he marches across the empty yard. He looks over his shoulder at Conor. FIFTH FORMER What are you wearing on your face? CONOR Bit of make up. I’m in a band. What do you think Brother Baxter wants?  61.  (CONTINUED)",
      "characters": [],
      "action_text": "The fifth former shrugs. FIFTH FORMER Hurry up. INT. BROTHER BAXTER’S OFFICE - DAY  Brother Baxter is filling out files. He doesn’t look up. Conor is led into the room. FIFTH FORMER Conor Lawlor, Brother. He closes the door, leaving Conor standing there. Finally, Brother Baxter looks up. BROTHER BAXTER What’s going on? CONOR With what? BROTHER BAXTER With...this. He gestures the face. CONOR Oh. Well, I checked the rule book. The one you mentioned, about the brown shoes? I couldn’t find anything about makeup. Or altering hair colour. He shrugs. He lifts his foot up, revealing the newly painted black shoes. CONOR I painted them. With paint from the art room. Brother Baxter doesn’t even look at them. He is seething underneath. BROTHER BAXTER Head down to the toilets and remove the make up right now. CONOR Why? BROTHER BAXTER Because I told you to.  62.  (CONTINUED) CONOR I’m in a band now. A school band. And I think it’s important for us to have a “look”. BROTHER BAXTER You’re a man. Men don’t wear makeup. CONOR Yeah, but why not? Like, people in the 18th century would have worn make up. So that means that people like Mozart would have. And he was a man. BROTHER BAXTER So you’re Mozart, are you? Conor shrugs, a little embarrassed. Shakes his head. BROTHER BAXTER That makes me Salieri, is it? CONOR Who’s Salieri? BROTHER BAXTER Take the make up off, and stop acting like you deserve special treatment. CONOR I don’t want special treatment. At all. BROTHER BAXTER You’ve a fine face, I wouldn’t worry about covering it up with make up. He smiles. Conor stands there, trying to work this one out. BROTHER BAXTER You can use me own bathroom there. If you like. He gestures a door off his office. CONOR I’m going to go back to class now. Conor exits. We hold on Brother Baxter.  63.",
      "dialogue_count": 0,
      "word_count": 556
    },
    {
      "scene_number": 9,
      "slugline": "INT. THE CORRIDOR - MOMENTS LATER  Conor exits the office, but Brother Baxter is hot on his tail. He grabs Conor by the hair, and drags him down the corridor. Conor shouts and wriggles, but BB means business. It’s like a red mist has descended over him. He slaps him a couple of times across the side of the head. Other kids look on, clearing the way. BB kicks in the door to the students’ bathroom, pushing Conor through in front of him. INT. THE TOLIETS - CONTINUOUS  Conor falls into the toliets. BB follows, picking him up and forcing him over to one of the sinks. CONOR You can’t do this! BROTHER BAXTER You wanna bet? BB turns on the taps, and as the sink fills up, plunges Conor’s head into the water. Conor bucks like a drowning animal. Brother Baxter pulls his head back out. Conor gasps for air, spluttering water. Brother Baxter slaps a bar of soap into Conor’s face, mushing it into his face. BROTHER BAXTER (shouting) We’ll get you clean! Don’t worry! We’ll clean you up! And get that shite off ye. Then down into the water again. Conor splutters. Again, he is pulled back out, now crying and coughing, his make up mixing with soap and dripping down his face. Brother Baxter wipes his hand with a towel, and turns to go, leaving Conor leaning over the sink shivering. He exits. We hold on Conor. INT. ART CLASSROOM - LATER  Conor is back in regular class. He has makeup stains under his eyes,   and his hair is wet. He looks like a drowned rat. He is shivering, but holding back tears. All eyes are on him. Some giggling, others shocked. He looks very alone.  64.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 292
    },
    {
      "scene_number": 10,
      "slugline": "EXT. SYNGE STREET SCHOOL - DAY  Students exit the main gate at the end of the day. Conor pushes his bike out. To his surprise, Raphina is leaning against the school gates up ahead. She is listening to music on massive, 1970s-style headphones with a curly lead. They are plugged into her battery operated tape player from home. She’s smoking a cigarette. She gives him a wave and one of her killer smiles. Just seeing her lifts him. RAPHINA Hey Cosmo. CONOR Who? RAPHINA That’s what I’m calling you now. Cosmo. You need a catchy name if you’re going to be in a band. CONOR Right. What are you doing here? RAPHINA Waiting for you. What happened to you? He looks pretty rough. CONOR Oh. Nothing. (off her tape machine) Does that work? RAPHINA (shouting) For about half an hour. Then the batteries run out. And I have to rob more. But it means I can take my tapes anywhere. CONOR Wow. Portable music. She smiles. Links his arm, and walks off with him. EXT. THE PARK - LATER - DAY  A small, city centre park. Some kids play on the swings. Others drink cider and smoke on a bench. Conor and Raphina enter.  65.  (CONTINUED)",
      "characters": [],
      "action_text": "RAPHINA I really liked your song. It made me cry. CONOR Oh, I’m sorry. RAPHINA No no, that’s a good thing. But write me a happy one some time. CONOR What if I don’t feel happy? RAPHINA What have you got to not feel happy about? Big house. Family. And we don’t live in the Lebanon! He smiles. She has a point. CONOR Who’s the guy, with the car? RAPHINA Evan? CONOR Yeah. Is he your boyfriend? RAPHINA We’re on and off. It’s complicated. We’re kind of on a break right now. CONOR Yeah. That’s a good idea. Take a break for a year or so. Get some perspective. RAPHINA You’re funny. He’s actually a really nice guy. CONOR Yeah. Shit taste in music though. She smiles. RAPHINA He’s taking me to London. I’m too young to go on my own. He’s organized everything.   Booked the tickets, and got us an apartment and all. We’re going after I get my portfolio shot. It’s a really big deal to get your shots done just right. For modelling. Your whole career can depend on it.  66.  (CONTINUED) CONOR Yeah. And what’s in it for Evan? She pauses, falling behind. RAPHINA Are you jealous, Cosmo? CONOR Why would I be jealous? RAPHINA Exactly. Write me a happy song. I need a laugh. CONOR What if I don’t feel happy? RAPHINA Your problem is that you’re not happy being sad. That’s what love is, Cosmo. (beat) Happy/Sad. Cosmo searches her for the meaning of this. She just smiles back. She checks her watch. RAPHINA Shit, I gotta go. We only have a half an hour dinner window at my house. CONOR Oh yeah, so what’s that house like, where you live? RAPHINA It’s fine. Better than some of the other places I’ve been. CONOR Cool. So... where are your parents? RAPHINA My da’s brown bread. He got hit by a car. CONOR Oh my God. Sorry. RAPHINA No, don’t be. He was drunk. He deserved it. Me ma’s in and out of hospital.  67.  (CONTINUED) CONOR Why? RAPHINA She’s a nurse. She laughs. He gets it. RAPHINA No. She’s a manic depressive. Cosmo is shocked by this. But tries to lighten it. CONOR So, like, “Happy/Sad”? RAPHINA Y",
      "dialogue_count": 0,
      "word_count": 2187
    },
    {
      "scene_number": 11,
      "slugline": "INT. THE TRAIN - RETURNING - DAY  The gang returns to the city at dusk; tired and worn out from all the sea air. The rooftops of Dublin spreading out through the window. Raphina leans her head against the glass looking out. Conor sits next to her. CONOR My brother says all the great artists had to get off this island. The ones who stayed just got depressed. Or turned into alcoholics. RAPHINA That makes sense. You mention your brother a lot, don’t you? Do you really love him? Conor shrugs. He’s never been asked a question like this. CONOR Well, he’s kind of like my dad in a way. He seems to be the only one who cares how I turn out. Like take music- when we were kids, we shared a room- and he’d play me records every night. Falling asleep. He said that way, the music entered into your subconscious. He’s a bit mad like that. RAPHINA He sounds cool. My dad used to sing songs to me falling asleep. And it got so I couldn’t fall asleep until he was back from the pub. Which was usually after 11. Then he’d sit there on the side of the bed, singing The Auld Triangle, or whatever, old mad rebel songs! The smell of drink, and I’d fall asleep with the music. (beat) Always had trouble sleeping since he died. She smiles. INT. CONOR’S HOUSE - DAY  Conor and Brendan sit at the top of their stairs. Down below, Penny is sitting in the porch, catching the last few minutes of evening sun. They watch her, her shoulder straps pulled down a little, a glass of wine poured, and a cigarette in the ashtray. It is a beautiful, sad image.  76.  (CONTINUED)",
      "characters": [
        "BRENDAN",
        "ROBERT"
      ],
      "action_text": "CONOR No you’re not. Because you don’t even exist. BARRY What? Barry comes up close to him. This time, Conor stands his ground. A small group is gathering. CONOR You’re living in my world, I’m not living in yours. You’re just material for my songs. BARRY Be careful what you say now, you’ll get a battering. CONOR Go ahead Barry. Beat me up while you still have the power. This is the best year of your life. But it’ll all come crashing down when you leave school. You only have the power to stop things. But not to create. He turns. Barry doesn’t stop him. It’s a minor triumph for the little man. Conor joins the back of the group, on his own. Barry makes a   wanker   gesture with his fist. This bomb is diffused, but the battle is far from over. INT. SYNGE STREET SCHOOL CORRIDOR - ANOTHER DAY  Conor is excitedly leading Darren and Eamon down a corridor towards the notice board. There’s a poster for the END-OF- TERM disco.  End of Term disco. School hall Fri 15th. DJ and lights! Tickets £2.  EAMON So? CONOR I say we ask if we can play at it. Our first gig! DARREN When is it? CONOR Three weeks.  78.  (CONTINUED) EAMON We’re not ready. CONOR We could be. We need a deadline. Something to prepare for. EAMON We have exams next week. I need to prepare for that. CONOR They’re mid term exams. They mean nothing. EAMON They do to me Ma. She wants me to go to college an all. Get qualifications. Will there be girls at the disco? CONOR Yes! EAMON I say we do it. CONOR We’ve got five songs. We need a half hour set. So three more... INT. CONOR’S BEDROOM - NIGHT  Conor is working away with an acoustic guitar and notebook and pen. He writes lyrics, trying them out. CONOR “Well the boots’s on the other foot now, Look alive we’re taking you down. Your curtain’s falling, take a bow”. As he plucks away on the acoustic, his composition is interrupted by raised voices, off. ROBERT (off) Well you’re sure as hell not moving in here with   him ! PENNY (off) It’s my mother’s house!  79.  (CONTINUED)",
      "dialogue_count": 2,
      "word_count": 2241
    },
    {
      "scene_number": 12,
      "slugline": "EXT. SYNGE STREET SCHOOL - DAY  Conor exits the school, carrying his report card in his hand. Other kids study their’s. He meets Eamon, who is looking at his at the school gate. Darren joins them. CONOR Did you do as badly as me? He shows Eamon his card. Fail. Fail. Fail. DARREN I failed too. EAMON Shit. I scraped a pass. CONOR Well done! CONOR My ma is going to kill me. What are you going to say to yours? CONOR I haven’t thought about it yet... They walk out. In the background, Barry tears his report card in half and throws it away without even reading it. He then boxes another kid in the face and approaches Conor, Eamon and Darren. He reaches in his school bag and takes out a homemade knife. A metal bar with a plastic scalpel welded it to it. BARRY I made this in metal work class. What do you think? And you said I couldn’t create anything? Conor is silent. It looks gnarly, and lethal. Barry smiles. BARRY And I’m going to mark you with it. One of these days. And you won’t be so handsome then. In your little band. Conor looks at it, then at Barry. CONOR Why are you targeting me, Barry? What did I do to you? BARRY I don’t like you.  87.  (CONTINUED)",
      "characters": [],
      "action_text": "CONOR Is it because your brother beats you up? And you’re taking it out on someone else. Like that day down the laneway? BARRY (laughs) That’s not me brother. That’s me da. What are you saying about me da? He leans in, laughing menacingly, raising the knife to Conor’s face. A millimeter from his mouth. Just then, Brother Baxter appears out of a doorway behind them. Barry quickly pockets the knife, before Brother Baxter sees it. BROTHER BAXTER What’s going on here? Is there a problem, Lawlor? CONOR No, Brother. Brother Baxter just turns and re-enters his office, closing the door. Barry is as surprised as the rest of them. He looks around, then skulks off. BARRY See you around. We hold on Conor. INT. SYNGE STREET ART CLASSROOM - DAY  About ten local teenage girls sit on desks. Ten boys stand around the classroom. They’ve turned up to be extras. A number of tables have been turned upsidedown to make a small stage. On this, the band’s gear has been set up. Garry checks his drum kit on stage. Miss Dunne is hanging decorations up, including a disco ball. Darren is moving about with the camera, looking for shots. Across the room, Miss Dunne checks her watch. MISS DUNNE So you’d better film something. I have to lock up in an hour. DARREN Yeah. She’s not coming. Let’s do it without her.  88.  (CONTINUED) Conor reluctantly agrees. He gets up on stage. DARREN So, all of you come and stand here. You have to pretend it’s a live gig. And you’re the audience. CONOR Okay, so everyone. This is like a school video. But not like an Irish school. More like an American school. And it’s the prom night. We’ll rehearse it. He presses playback, and the band mime. Conor sings into a microphone. But his eyes are on the door. We hear the first verse. The band are really coming along. Conor is really developing some stage presence. Again, he looks towards the door. But this time... it opens. Raphina is coming through. But she’s dressed up in an amazing, 1950’s style prom dress. As she enters, w",
      "dialogue_count": 0,
      "word_count": 756
    },
    {
      "scene_number": 13,
      "slugline": "EXT. CONOR’S HOUSE - AFTERNOON  Conor returns home. He pauses at the door, looking at his report card. He enters. INT.CONOR’S HOUSE - HALLWAY - CONTINUOUS  As Conor enters the hallway, he is met by his mother coming down the stairs. CONOR So before you get angry... PENNY Oh good, there you are. (calling) He’s back. You get Bren. ROBERT (off) Okay. PENNY We want to chat to you both. Kitchen. Two minutes. She passes. INT. CONOR’S LIVING ROOM - DAY  Conor, Penny and Robert sit around the table in the kitchen, as they did a few months ago. Waiting. In a moment, we hear Brendan running down the stairs. He enters, carrying all his smoking and drinking shit. BRENDAN Pray begin. He sits down. ROBERT Well. So, firstly, we don’t want to make a big deal about this. Lot’s of married couples- PENNY Your father and I are splitting up. BRENDAN (getting up) Thank you! Knew it was just a question of time. Let me know when we’re moving. I’ll be packed.  90.  (CONTINUED)",
      "characters": [],
      "action_text": "ROBERT Why don’t you sit down Brendan, for a second, and we’ll tell you what we’re thinking. See if you agree. BRENDAN Oh. A consensus? Well that’s novel. Go ahead. He sits down. We push in on Conor for the following. ROBERT So your mother’s fallen in love with Tony. And they’re going to move into his apartment for a while. We got an offer on this house- it’s half what it’s worth, but we’re going to take it. I can’t afford to stay here on my own. CONOR So are you, like, getting a divorce? PENNY No, you can’t get divorced in Ireland. We’ll be legally separated. It’s better for everyone. ROBERT I’ll get an apartment, and you guys will live between there and... there. BRENDAN I won’t be staying in Tony’s. Let’s get that very straight. I’d rather sleep on the street. Brendan seems unusually angry. Even twitchy. ROBERT We’ll talk about all the details. Tony’s a very nice man. I can vouch for that. This is very hard for him to say. Penny is surprised. PENNY (almost silently) Thank you. BRENDAN Wow. Look at you two. This is the first time I’ve seen you being nice to each other in ten years!  91.  (CONTINUED) He lights up a cigarette, raising his eyes to heaven. CONOR Maybe he’s right. Maybe this is what you needed to do, you know, to get back. Closer than before. Everyone looks at Conor. Suddenly seeing how young he is. And how vulnerable. CONOR You don’t love Tony. You hardly know him. You got that job a few months ago. It’s just an excuse. A way of ending this relationship because you don’t know how to keep it together. ROBERT Now Conor. You don’t know what you’re talking about. He gets up and exits, slamming the door. After a moment, Brendan gathers his stuff and exits, shaking his head, leaving the parents sitting there on their own. INT. BRENDAN’S ROOM - MOMENTS LATER  Brendan enters his room to find Conor sitting on the hammock. Brendan sets his stuff down. CONOR So you were right. BRENDAN It was obvious. CONOR They’re our parents. They’re supposed to look after us. ",
      "dialogue_count": 0,
      "word_count": 2087
    },
    {
      "scene_number": 14,
      "slugline": "EXT. EAMON’S HOUSE - DAY  Eamon opens the door to his house. Conor’s is outside, with his journal of lyrics. CONOR Want to write a song? EAMON (smiling) Always. He enters. DISSOLVE TO: INT. BRENDAN’S ROOM - DAY  Conor knocks on Brendan’s room. Brendan is just sitting there. The window open, looking out. CONOR Hi. I’m off to school. Got that gig tonight. BRENDAN Excellent. What time? CONOR Starts at 9. BRENDAN Okay. I’ll see you there, probably. Is your girlfriend going? CONOR She’s not my girlfriend. I don’t know. She’s totally unreliable. I might try and get a new girlfriend tonight. If the gig goes well like. BRENDAN You know I was in a band once? CONOR Really. BRENDAN Oh yeah. We never got to play a gig. But we practiced for about a summer. It was really just an excuse to get high with your friends. But we weren’t half bad. I wrote some pretty good lyrics.  100.  (CONTINUED)",
      "characters": [],
      "action_text": "CONOR What happened? BRENDAN Ah, parents. Mum always wanted me to be a doctor. Or a lawyer. He shakes his head. BRENDAN You should be glad they don’t give as much of a damn about you. CONOR Maybe that’s what you’ll do. BRENDAN When? CONOR When you get off your arse. Re-form a band? Write some lyrics. INT. CONOR’S HOUSE - KITCHEN - DAY  Conor passes through the kitchen. Penny and Robert are eating breakfast and reading the paper. Conor grabs a slice of toast and his school bag and goes to exit. CONOR Oh, I’ll be late tonight. Neither of his parents look up. CONOR School gig. PENNY Okay. What time is it at? CONOR We’re on at around 9. Are you coming? PENNY Ohh. I might be busy. A work do. I’ll try and get out of it. CONOR Cool. Dad? ROBERT Where is it at? CONOR At school. It’s a “school” gig.  101.  (CONTINUED) ROBERT Oh yeah. Okay. I’ll try. Conor smiles, happy. He exits. EXT. CONOR’S HOUSE - DAY  Music over. Conor exits his house. He looks up at a “SALE AGREED” sign in his garden. He is carrying an envelope. He stuffs it into his jacket and gets on his bike. EXT. STREETS - DAY  Music over, as Conor cycles through streets. RAPHINA’S STOOP - DAY  Conor drops in the envelope through Raphina’s door. EXT. SYNGE STREET SCHOOL - NIGHT  People arrive for the school disco. They enter the gym hall. INT. SYNGE STREET SCHOOL - GYM HALL - NIGHT  A DJ plays music. There are a few colored lights. Gangs of teenagers assemble in groups. No one dances. Brothers and teachers supervise things. On stage, the band’s gear is set up. INT. BACK STAGE - NIGHT  Behind the stage is a little changing area, where our boys are assembled. They are dressed up. Conor wears pretty funky makeup. They nervously check behind the curtain. DARREN It’s filling up lads. There’s chicks from Saint Annes, Notre Dame. And St. Louis! This just makes the band more nervous. All except Eamon, who sits on a desk, his guitar strapped on practicing. Conor notices that he’s quiet. He approaches. CONOR You alright?  102",
      "dialogue_count": 0,
      "word_count": 703
    },
    {
      "scene_number": 15,
      "slugline": "INT. SYNGE STREET SCHOOL GYM - NIGHT  Things are turbulent in the school hall. Brothers and teachers have a tough time keeping things under control. A few local skinheads have shown up, drinking bottles of cider. Girls have started kissing guys. On stage, a fifth former (17) speaks into a microphone as the DJ turns down the music. FIFTH FORMER Okay. So now, some live music. No one claps. Except Miss Dunne, who is there with her boyfriend, a man in his late thirties. They are drinking orange juice. The band take to the stage. Conor’s look gets laughs: he’s wearing a dress and heavy makeup.   A few “Faggots” from the crowd, etc. Conor begins a riff. CONOR Hello Dublin. We are Sing Street. From Dublin. CROWD (collectively) BOO!!!!!!! THUG VOICE Faggot band! CONOR Dad, you shouldn’t have come if you’re going to slag us. (beat) This is called “Words”. The band crash into their first song, a lively, up-tempo stomper. Cosmo is transformed on stage. He’s stepped outside himself. He’s carefree and confident with the microphone, and his weeks of rehersal have paid off. The band is tight. Miss Dunne is delighted. The other teachers aren’t so sure of the angry, passionate performance and risqué lyrics, as the crowd begrudgingly starts to come around, gathering at the front of stage. Barry is working their backline. Darren winks at him. The play through their first song passionately, and it ends to some applause, mostly from girls.  104.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 248
    },
    {
      "scene_number": 16,
      "slugline": "INT. RAPHINA’S HOUSE - EARLIER  Raphina opens the envelope Conor dropped in, and puts the tape into her machine. Through her window, Conor jumps on his bike earlier that afternoon, and cycles off. She presses play. INT. SYNGE STREET SCHOOL GYM - NIGHT  Back at the hall the band are well into their gig. They are sweating, and ending a song to applause.   Conor changes out of his dress -- he’s wearing a school uniform underneath. CONOR Thank you. Here’s one called “I will Find you” It’s a slow song. The crowd boo. The rest of the band shake their heads. The band have an unplanned discussion on stage, off mic. NGIG We’re not doing a bleedin slow song at a gig! Are you mad? CONOR No? GARRY They love us. We’ll totally blow it. And we haven’t rehearsed it properly. CONOR But it’s a great song. And it’s really simple. And it’ll test our audience. Girls will love it. Eamon? They all look at Eamon. EAMON It’s a bold move. Let’s do it. Eamon takes a seat by the piano. CONOR This is a slow song. Anyone ever had a girlfriend for a day? Then that’s it? Lots of rowdy shouting from the crowd. This is turning into a proper gig. CONOR What is that about? Anyway. This is called “I Will find you”.  105.  (CONTINUED)",
      "characters": [],
      "action_text": "He begins a mid tempo song. It’s beautiful. Soulful yet forceful. We hear the first verse. INT. RAPHINA’S ROOM - EARLIER THAT DAY  Raphina is listening to the music. It is the same song he is playing live at the gig. She is dressed as we saw her earlier, hair in a pony tail, no make up, sensible jeans and jumper. The song is an address to her to follow her dreams. About being who you’re supposed to be. That she must at least find out if she could have made it as a model. And made it to London. INT. OFFICE - NIGHT  Music plays over Penny is making love to A MAN (45), on the couch in an office. She is smiling and happy. INT. CONOR’S HOUSE - LIVING ROOM - NIGHT  Music plays over. Robert is sitting in front of the TV with a sandwich and a glass of whiskey. He is watching violence on TV from Northern Ireland. INT. BRENDAN’S ROOM - NIGHT  Music plays over. Brenden enters his room. Restless. He is trying on his jacket to go out. Looks in the mirror. The song from the gig still playing over. He checks his watch and looks at his guitar and smiles. Picks it up, sits back and strums it. Blows some dust off it. Tunes a string. Then gives up. Crosses the room, puts the needle onto the vinal. Picks up his hash paraphernalia and begins rolling a joint on the back of the guitar, tapping his feet to the music. Takes off his jacket. He’s not going anywhere. EXT. THE PARK - NIGHT  Raphina sits on the bench listening to the same song Cosmo is playing live. She’s been listening over and over. She’s smiling and crying at the same time. It is a call to her from someone who really cares about her.  106.  (CONTINUED) LYRICS “I got to find out who I’m meant to be. I don’t believe in destiny. But with every word you say to me... something’s going to change... We hold on her, eyes full of tears. INT. SYNGE STREET SCHOOL - GYM - NIGHT  Back on stage, they have lost most of the crowd. Many are outside the windows, smoking. Others in groups chatting. Only a few GIRLS have stayed put, looking up a",
      "dialogue_count": 0,
      "word_count": 2707
    },
    {
      "scene_number": 17,
      "slugline": "EXT. THE BOAT - CONTINUOUS  Conor waves up at the people on deck. Then speeds onwards. Raphina smiles, looking at his back. She tries to light up a cigarette. Then gives up. She starts laughing. The SONG really takes off now. It’s Conor’s voice singing. The lyrics are about him and Raphina. About their future. A model and a singer. About staying together. Written from an older brother’s perspective. What we’re hearing is clearly a marriage of Brendan’s lyrics and Conor’s music. From the future. And it’s the only clue to whether Conor and Raphina ever made it. Because right now, all we can see is mist, rain, and grim determination on COSMO’S drenched face.... Snap to black.  117.",
      "characters": [],
      "action_text": "F O R   Y O U R   C O N S I D E R A T I O N  www.TWCAwards.com BEST ORIGINAL SCREENPLAY  John Carney",
      "dialogue_count": 0,
      "word_count": 146
    }
  ]
}