{
  "slug": "skyfall-2012",
  "title": "skyfall",
  "genre": "action",
  "format": "film",
  "scenes_count": 17,
  "characters_count": 3,
  "characters": [
    "EVE",
    "BOND",
    "SILVA"
  ],
  "total_words": 24169,
  "total_dialogue": 5,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. HOTEL CORRIDOR - DAY We’re moving down a dark corridor. Then, emerging from the darkness. Ice blue eyes. BOND cautiously moves through the tight hallway. Gun ready. We have no idea where we are. We hear distant city noises outside. He rounds a corner. At the end of hall: open door. Dead body. Bond picks up his pace. Gets to the door. Nudges it open. Aiming. INT. HOTEL ROOM - DAY Bond enters. Eyes take it in. Scene of carnage. Another dead body. Euros scattered around. Empty metal briefcase. Laptop, backed ripped off, hard drive missing. Signs of struggle. And a dying MI-6 agent on the floor. Gasping for breath. Eyes pleading up at Bond. Bond moves to him quickly, checks his pulse: BOND (on earpiece) Ronson’s down. He needs a medical evac. A voice crackles through the darkness. It’s M: M (V.O.) Where is it? Is it there? Bond looks over to the laptop. BOND Hard drive’s gone.  1  (CONTINUED)",
      "characters": [],
      "action_text": "M (V.O.) Are you sure? BOND It’s gone -- give me a minute. Bond works urgently to staunch the bleeding. Ronson looks up at him. Eyes desperate. M   (V.O.) They must have it -- get after them. BOND I’m stabilizing Ronson. M (V.O.) We don’t have the time. BOND I have to stop the bleeding. M (V.O.) Leave him. Ronson hears this too. Their eyes meet. Bond sets Ronson down. There’s another door out. He heads toward it. One glance back. The secret agent dying alone. INT. HOTEL CORRIDOR - DAY Bond races through a corridor. Down a dark stairway. Bursts out to-- EXT. ISTANBUL - DAY Blaze of color and crowd and noise. Teeming Istanbul street. Bond stops for a millisecond, looks around. Then a Land Rover screeches up. Bond jumps in. It takes off.  2  CONTINUED:",
      "dialogue_count": 0,
      "word_count": 301
    },
    {
      "scene_number": 2,
      "slugline": "INT. EVE’S CAR - DAY EVE is driving. She’s a smart and capable MI-6 field agent. They are following an Audi as it maneuvers through the crowded streets: BOND Have you got him? EVE He’s in the black Audi ... What about Ronson? BOND He’s been hit. TANNER (V.O.) We’re sending an emergency evacuation squad. BOND They’ll be too bloody late. The Audi suddenly zooms ahead, it’s picked up the tail-- BOND He’s seen us. Eve pursues-- She’s a superb driver. She screeches around corners at breakneck speed, always just on the verge of losing control but not. INT. MI-6 - M’S OFFICE - DAY M is pacing in her busy office, her redoubtable Chief of Staff BILL TANNER close by. Her Executive Assistant, VANESSA, and other MI-6 personnel are standing by and manning monitors. TANNER Medical evac for Ronson five minutes away. She nods.  3",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 147
    },
    {
      "scene_number": 3,
      "slugline": "INT. EVE’S CAR - DAY Bond lurches as Eve takes a corner too tightly -- smash -- the mirror on Bond’s side of the car is shorn off. BOND It’s all right, you weren’t using it. She swerves the car to the other side and sheers off that mirror as well. EVE Wasn’t using that one either. She smiles and floors it, narrowly missing the local traffic. The pursuit continues. She really is good. EXT. ISTANBUL STREET - DAY The cars screech past three Istanbul motorcycle cops -- who take off in pursuit-- EXT. ISTANBUL MARKET SQUARE - DAY In the market square, Bond sees his chance as the two cars speed towards and into the crowded market square. Eve jams down on the clutch -- Bond reaches over -- grabs the steering wheel -- the car lurches to the right -- They slam into the Audi-- The Audi skids around -- Eve’s car pushes it forward -- for a moment Bond has a close view of his quarry-- Then the Audi hits the steps of a statue in the square -- and flips over dramatically-- --sails through the air right over them-- And then crashes down on top of a stall. Upside down. Meanwhile, Bond and Eve screech to a stop. BOND Keep your head down! She ducks then--  4  (CONTINUED)",
      "characters": [
        "EVE",
        "BOND"
      ],
      "action_text": "Smash! Bullets shatter the windscreen-- Eve’s down -- her seat is shredded -- a man has pulled himself from the wrecked Audi ... This is PATRICE: a saturnine, lethal assassin. Patrice has a specialized automatic with a machine-gun like magazine attached -- he sprays bullets toward Bond Just then, the Istanbul motorcycle cops roar into the square. Patrice fires at them too, taking them down-- CLICK-- Patrice’s gun is out of ammunition. He quickly ejects the double magazine. He’s about to reload when-- Bond returns fire-- Patrice quickly holsters his weapon, grabs one of the police bikes and speeds off-- Bond exchanges a quick look with Eve. Bond leaps on a motorcycle and takes off in pursuit of Patrice. Eve smashes out the remainder of the front windscreen with the heel of her hand, and heads off in pursuit. Eve screams out the window as she is backing up: EVE Just get clear! EXT. ISTANBUL ALLEYS - DAY Patrice roars through the insanely congested walkway-- zipping past street bollards, people, animals, markets, tourists, bikes, food stalls-- Bond in close pursuit-- INT. EVE’S CAR - DAY Eve follows as best she can, but her car can’t make it past the street bollards lined across the walkway.  5  CONTINUED:  (CONTINUED) EVE Tanner, which way? She catches glimpses of Bond and Patrice, but they are leaving her behind. She veers off. INT. MI-6 - DAY TANNER Keep going. I can direct you from here. M and Tanner watch the pursuit on GPS. (Eve’s car has a homing transmitter.) Other screens show satellite and CCTV images. Tanner notes M is unusually tense. M You both know what’s at stake here ...We cannot afford to lose that list. BOND (V.O.) Yes, ma’am. EXT. ISTANBUL STREETS - DAY The city zips past. Bond gets closer. The two bikes only a few feet apart. Weaving in and out. Like they’re linked. Bond won’t give an inch. EXT. GRAND BAZAAR ALLEY/STAIRS/ROOF - DAY Patrice races through a series of increasingly narrow alleys and into a small square. People leap back and flatten them",
      "dialogue_count": 2,
      "word_count": 5392
    },
    {
      "scene_number": 4,
      "slugline": "INT. MI-6 BUNKER - LOCKER ROOM - NIGHT Bond is getting dressed after his day of testing. His body is aching. He flexes and rubs his injured right shoulder. He stops. Something has occurred to him. He runs his fingers more closely over the skin of Patrice’s gunshot wound. INT. SHOWER ROOM/BATHROOM - NIGHT Bond walks to the sink, turns the water on. He takes a pen knife and then, determined, he cuts into his shoulder. He holds his hand under the water, washes the blood away. Three small shards of shrapnel. They glisten in the light. INT. MI-6 BUNKER - MAIN OFFICE FLOOR/TANNER’S OFFICE AREA - NIGHT Bond walks up to Tanner, who sits in an improvised office. Bond drops an evidence bag in front of him - it contains the three shards of metal. BOND Get these analyzed. For her eyes only. Tanner studies the evidence bag. Holds it up to the light. INT. MI-6 BUNKER - OFFICE - DAY Bond, in a new suit, pacing. Impatient. He checks his watch. Then someone enters, a voice: EVE She’s ready for you. He glances up. It’s Eve. BOND I’m sorry. Have we met before? EVE I’m the one who should say sorry.  35  (CONTINUED)",
      "characters": [],
      "action_text": "BOND It was only four ribs and some of the less vital organs. Nothing major. She smiles. INT. MI-6 BUNKER - MAIN OFFICE FLOOR - DAY Bond and Eve walk through the main office area. Other agents watch him. Could that be the famous 007? BOND Not enough excitement in Istanbul? EVE I’ve been reassigned. Temporary suspension from field work. BOND Really? EVE Something to do with killing 007. BOND Well, you gave it your best shot. EVE That was hardly my best shot. BOND Not sure I can survive your best. EVE Doubt you’ll get the chance. He’s amused. BOND Well do me a favour, will you? If they do ever let you back out there, warn me first. EVE I’m assisting Gareth Mallory in the transition ... And then I’ll be back in the field. BOND That’s what you want?  36  CONTINUED:  (CONTINUED) EVE Yes, of course. BOND It’s not for everyone. Tanner appears: TANNER Ah, 007, it’s this way. Bond heads toward Tanner. BOND (back to Eve) In your defense, a moving target is much harder to hit. EVE Then you better keep moving. He smiles, not turning. She watches him go. INT. MI-6 BUNKER - M’S OFFICE - DAY CLOSE ON the ugly old Union Jack bulldog paperweight on M’s desk. BOND The whole office goes up in smoke and that bloody thing survives. M Your interior decorating tips have always been appreciated 007... The door opens and in walks Mallory. M 007... Gareth Mallory. MALLORY I hope I haven’t missed anything, the PM does prattle on in a crisis. (nods) Bond. BOND Mallory.  37  CONTINUED:  (CONTINUED) M I’ve just been reviewing Bond’s tests. (to Bond) Seems you’ve passed - by the skin of your teeth. You’re back on active service. This comes as a surprise to Tanner. MALLORY Congratulations. BOND Thank you. (rising) I’ll... I’ll be outside. MALLORY I only have one question ... Why not stay dead? Bond looks at him. Mallory is reasonable: MALLORY You have the perfect way out. Go and live quietly somewhere. Not many field agents get to leave this cleanly. BOND Do you get out in the field much? MALLORY ",
      "dialogue_count": 0,
      "word_count": 1626
    },
    {
      "scene_number": 5,
      "slugline": "EXT. SHANGHAI HIGHWAY - NIGHT They head toward the looming skyscrapers of downtown Shanghai. EXT. SHANGHAI OFFICE TOWER - NIGHT Patrice’s taxi arrives at a darkened office tower. Building’s still under construction ... A huge construction crane looms over it. The monolithic office tower soars up ninety floors: one of a ring of skyscrapers near the river. Patrice steps out of the taxi carrying an aluminum briefcase. In the shadows, we see Bond’s car pull up. Bond watches from outside as Patrice calmly strolls into the building, toward a security desk. WITH BOND: Pulling off his glove, Bond activates the Walther. INSIDE WITH PATRICE: The security guard looks up... A silent flash ... The guard falls ... Patrice has shot him with cold, silent efficiency. INT. SHANGHAI OFFICE TOWER-ATRIUM/ELEVATORS - NIGHT It’s dark, deserted and creepy.   The cavernous building echoes. Bond carefully moves through the lobby, gun ready. He passes the murdered security guard. Turns a corner. Another dead guard. He hears a noise. Looks up. The noise is the sound of elevator doors opening. Patrice steps to a glass elevator that climbs the interior of the towering atrium. Patrice enters and presses the button for the 67th floor. The elevator begins to rise.  45  (CONTINUED)",
      "characters": [],
      "action_text": "As it ascends -- Bond bolts across the darkened lobby. He makes a desperate dive -- Just makes it. He clings to the underside of the elevator. He hangs there as the elevator slowly rises ... and rises ... and rises. IT FINALLY STOPS AT THE 67TH FLOOR. STUNNING DROP BELOW BOND. Bond dangles, sweat dripping, trying to keep his grip, as he waits for Patrice to leave the elevator and his footsteps to disappear completely. It seems to take forever. Finally Bond swings his legs up. Hooks one over. Begins to climb up. Forces the door open of the neighboring elevator. Exits into the corridor. INT. SHANGHAI OFFICE TOWER - 67TH FLOOR - NIGHT A blaze of colorful light illuminates Bond as he moves across the floor searching for Patrice. Then the light’s gone ... Then there’s a different blaze of bright light... Huge LED advertising screens from skyscrapers outside light this dark floor bizarrely. Chiaroscuro flashes of gigantic images -- a jellyfish, a flower blooming, a woman smiling -- blaze on and off. Glass partitions catch the glowing, fanciful LED lights in strange patterns. As Bond moves, he sees multiple reflections of his own image. The floor is eerily deserted. Under construction. Bond snakes through the glass partitions. And now he sees Patrice, in a far corner of the room. WITH PATRICE: CLICK. He flips a special switch on the aluminum briefcase. The core of the briefcase separates and the rest of it ingeniously unfolds to form a sniper’s rifle. He takes a glass-cutter from the case and places it on the window, cuts a small hole in the glass.  46  CONTINUED:  (CONTINUED) Patrice’s eyes go to the building directly across. Something’s going on over there... IN THE BUILDING ACROSS THE WAY: It’s like seeing a play acted out. The window frames the scene like a proscenium arch. And then she enters. SEVERINE. Beautiful and composed. Patrice can see Severine crossing the luxurious hotel suite... Her THREE SERIOUS BODYGUARDS in close proximity. WITH BOND: He moves closer. One",
      "dialogue_count": 0,
      "word_count": 1929
    },
    {
      "scene_number": 6,
      "slugline": "INT. THE FLOATING DRAGON - COURTYARD - NIGHT ...We move with Bond through this exotic and sinister world. A place of mists and shadows. He moves over a pagoda bridge that spans an unusual central enclosure below: like a sand pit or arena. He glances down. A “dragon” hisses back at him, jaws spread wide. It’s a real Komodo Dragon, one of three that prowl the hexagonal pit. A beautiful woman gives Bond the eye as they pass on the bridge. INT. THE FLOATING DRAGON - NIGHT The usual roar of a casino is absent. No bright, flashing slot machines. The stakes are too high. The place is too dangerous. The corners too dark. BOND Good Evening. EVE (V.O.) Evening. It’s Eve. She’s wearing a spectacular dress, ravishing. Bond professionally sizes up the room while he talks on his earpiece. BOND Don’t touch your ear. I’ve got three exits and lots of blind spots. EVE I’ve got them covered. As he makes his way toward the cashier’s cages. BOND You look beautiful in that dress. EVE You don’t scrub up so bad yourself. BOND It’s amazing what one can do with an extra pair of hands. EVE You’re telling me.  55  (CONTINUED)",
      "characters": [
        "BOND",
        "SILVA"
      ],
      "action_text": "BOND You gamble? EVE I like a little flutter now and then. Who doesn’t like to take chances? Without looking, or him at her, Eve now crosses behind Bond. Bond arrives at a CASHIER: CASHIER Good evening, sir. How can I help you? BOND I’d like to cash this in, please. Presents the single casino chip he got in Shanghai. She stops. Her eyes flick up to him. The smile returns. CASHIER One moment, sir. She disappears into the back. Bond’s eyes scan the casino. A woman is standing at the top of the stairs. Her back to Bond. Backless dress. He’d recognize her anywhere. Severine... from the hit. A bodyguard catches the Bond’s look, whispers to her and nods towards Bond ... She turns. Looks at Bond. He smiles back. Charming and confident. Just as he suspected, the casino FLOOR MANAGER emerges from the cashier’s area. His assistant carries an attache case. He offers it to Bond. The Floor Manager smiles ingratiatingly. FLOOR MANAGER Good fortune tonight, sir.  56  CONTINUED:  (CONTINUED) SEVERINE I’ve been waiting to see who would redeem the chip. You made such a bold entrance into our little drama. BOND Did I over-complicate the plot? SEVERINE Who doesn’t appreciate the occasional twist? Mr...? BOND Bond... James Bond. SEVERINE Severine... So... Mr. Bond... Shall we discuss your next performance over that drink? BOND I’d like that. (re: bodyguards) Will your friends be joining us? She glances over her shoulder to the oppressive bodyguards. SEVERINE That, I’m afraid, is inevitable. INT. THE FLOATING DRAGON - MAIN FLOOR - NIGHT Bond follows Severine across the main floor.   Across the room, Eve watches. EVE (V.O.) She’s pretty. BOND Now now. As Severine walks ahead, Bond studies her from behind. EVE (V.O.) If you like that sort of thing... BOND I’ll keep you posted. Eve is sitting at a table, watching Bond and Severine head to the bar. She’s jealous seeing Bond with such a beautiful woman.  58  CONTINUED: (3)  (CONTINUED) Without breaking stride, Bond removes his ear-piece and d",
      "dialogue_count": 3,
      "word_count": 4748
    },
    {
      "scene_number": 7,
      "slugline": "INT. MI-6 BUNKER - CORRIDOR - DAY The corridor adjoining the observation room. Bond and Tanner follow M. M is all business. M Let me know what you recover from his computer. Has he transmitted the list? If so, to whom? I want this resolved. BOND Yes, Ma’am. Tanner starts to go. But M stops, turns to Bond-- M His name is Tiago Rodriguez. He was a brilliant agent. But he started operating beyond his brief, hacking the Chinese. The hand-over was coming up and they were on to him so I gave him up. I got six agents back in return and a peaceful transition. Beat. There’s no more to say. TANNER We should go, ma’am. Board of Inquiry begins in thirty minutes. M (to Bond) I want to know what’s on that computer. She heads out. Bond watches her go. Concerned. INT. MI-6 BUNKER - Q BRANCH - DAY Q’s new headquarters is finally up and running. Q has a whole team working at a series of stations: all trying to hack into Silva’s system ... The dozens of monitors flash different images: moving through Silva’s files.  81  (CONTINUED)",
      "characters": [],
      "action_text": "Below them, beneath a glass floor, is the mainframe room, accessed by a series of sealed electronic security hatches. Q Now, looking at Silva’s computer, it seems to me he’s done a number of slightly unusual things... He’s established fail-safe protocols to wipe the memory if there’s any attempt to access certain files. Only about six people in the world could program safeguards like that. BOND Of course there are. Can you get past them? Q I invented them. Bond watches as Q carefully attaches cables to Silva’s laptop and then plugs it into the MI-6 computer system: Q Right then ... Let’s see what you’ve got for us, Mr. Silva... The computer screen fills with data. Q We’re in. INT. MI-6 BUNKER - ISOLATION CHAMBER - DAY Meanwhile... Silva sits in a meditation pose. INT. MI-6 BUNKER - Q BRANCH - DAY Meanwhile... One of Q’s assistants is getting some images from Silva’s computer. ASSISTANT Sir, what do you make of this...? On the screen: a complex network of confusing images. A strange maze of dimensions, lines and arrows.  82  CONTINUED:  (CONTINUED) Q It’s his Omega site, most encrypted level he has... Looks like obfuscated code to conceal it’s true purpose: security through obscurity. Bond’s eyes seek order in the chaotic images. INT. WHITEHALL OFFICE - BOARD OF INQUIRY - DAY M sits at a table with Tanner. Microphones before her. Crowded room. High ranking politicians, bureaucrats, security guards, etc. No public or press, but a fixed camera pointed at M. Mallory sits at a dais facing M, along with the other members of the Intelligence and Security Committee. Eve is there, alongside the other executive assistants. M readies the papers before her and then raises her head to face her inquisitors. The Right Honorable CLAIR DOWAR, MP, mid 40’s, the formidable Chairperson, brings the meeting to order: DOWAR Ladies and gentlemen, if I might have order. I’d like to begin the proceedings ... We’re gathered today to address important issues concerning the future of our nation",
      "dialogue_count": 0,
      "word_count": 562
    },
    {
      "scene_number": 8,
      "slugline": "INT. WHITEHALL OFFICE - BOARD OF INQUIRY - DAY M is in the midst of being grilled by the panel. Mallory says nothing, face set, taking it all in. INQUIRY BOARD MEMBER 1 .... so you believe your stewardship of MI-6 during the recent crisis has been up to scratch? M Well, I believe we have apprehended the responsible party and are taking all necessary steps to ensure the sensitive information is contained. DOWAR Oh, so it’s a Job Well Done? M Well, I’m not saying it’s all gone perfectly, but-- DOWAR (pouncing) You’ll forgive me for not putting up the bunting. I find it rather difficult to overlook the monumental security breaches and dead operatives for which you are almost single-handedly responsible. Even Mallory is taken aback by the swiftness of Dowar’s attack. INT. MI-6 BUNKER - Q BRANCH - DAY Bond and Q are analyzing the pulsing frequencies of Silva’s glitchy abstract code. Bond on the big screen. Q on his lap top. Q He’s using a polymorphic engine to mutate the code... Whenever I try to gain access it changes. It’s like solving a Rubik’s cube that’s fighting back. Bond stares at the giant screen.  84  (CONTINUED)",
      "characters": [],
      "action_text": "BOND Stop. Q stops probing. In the web of lines and arrows a   tiny   word  is visible to Bond, but it is divided amongst numbers... BOND Go in on that. Q zooms in on the data. Scrolls the lettering. The word reads,   Granborough.  BOND Granborough ... Granborough Road. That’s an old tube stop on the Metropolitan line. Been closed for years. Use that as a key. Q taps on the lap top, finally orientating the image. Pulls back. Now other words and symbols become clear. Q (realizing) Oh, look, it’s a   map ... BOND It’s London... subterranean London... Then... Click. Click. Click. The hatches in the floor that lead to the sealed mainframe room beneath them, unlock and automatically flip open. Q What’s going on? Why are the doors open? Bond’s eyes go to the hatches-- And then he bolts from the room without a word-- Q turns back to the giant screen to see a “SYSTEM SECURITY BREACH” warning appear. Q Oh, no... Can someone tell me how the hell he got into our system? Then:  85  CONTINUED:  (CONTINUED) Almost before the words are out of his mouth -- On Silva’s computer, the all-too-familiar skull appears with the message: “Not such a clever boy.” -- the penny drops! Q Oh, Shit! He leaps to Silva’s laptop and rips out the cables connecting it to the MI-6 computers. Q Shit, shit, shit, shit... He hacked us! INT. MI-6 BUNKER - CORRIDORS - DAY Bond races at top speed through the corridor -- Alarm klaxons begin to howl-- INT. MI-6 BUNKER - OBSERVATION/ISOLATION CHAMBERS - DAY Bond slows at the door to the observation chamber -- BOND Oh, no. Both guards down. Necks broken. Silva is gone. All doors open. BOND (into his earpiece) Q, he’s gone. Bond sees an old Victorian grate in the floor is pulled aside on the far side of the room. Runs to it and starts to climb down-- INT. UNDERGROUND STAIRS - DAY Bond quickly descends a vast metal staircase. Claustrophobic and dripping. BOND I’m in a staircase below isolation.  86  CONTINUED: (2)",
      "dialogue_count": 0,
      "word_count": 549
    },
    {
      "scene_number": 9,
      "slugline": "INT. MI-6 BUNKER - Q BRANCH - DAY BOND (V.O.) Do you read me, Q? Q and his team are now displaying multiple maps of the underground world beneath London: Tube lines, mail train routes, secret military bunkers, access corridors, culverts, sewers, tunnels, ancient passageways, etc. Q I can hear you. I’m looking for you. INT. UNDERGROUND STAIRS - DAY Bond continues down the stairs. He sees Silva disappearing from view at the base of the stairs. INT. MI-6 BUNKER - Q BRANCH - DAY The Map: Q lays 5 separate 2-D images on top of each other (tube lines, access tunnels, mail train, sewers, military bunkers) and out of them creates a 3-D map. On the screen, he is able to turn the 3-D image and study it from any angle. So we are able almost to enter the 3-D world. They superimpose these over Silva’s map. Q studies the map on the large screen. Q Got you! Tracking your location. INT. UNDERGROUND STAIRS - BASE - DAY Bond jumps off the ladder. He’s in another tunnel. Q (V.O.) Just keep moving forward. Bond readies his gun. Q (V.O.) Enter the next service door on your right.  87",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 200
    },
    {
      "scene_number": 10,
      "slugline": "INT. TUBE TUNNEL - DAY Bond emerges through the door -- and is surprised to find he’s in a tube tunnel. Q (V.O.) If you’re through that door, you should be in the tube. BOND I’m in the Tube. INT. MI-6 BUNKER - Q BRANCH - DAY Q is prowling between other monitors: real time tube displays. Sees the trains moving back and forth. Elaborate tube line maps. Q realizing something. Which chills him. Q Bond. This isn’t an escape - this was years in the planning. INT. TUBE TUNNEL - DAY Bond is moving quickly through the dark tube tunnel. Q (V.O.) He wanted us to capture him. He wanted us to access his computer. It was all planned. INT. MI-6 BUNKER - Q BRANCH - INTERCUT - DAY Q Blowing up HQ -- all the emergency protocols, knowing we’d retreat down here... WITH BOND: BOND ...I got all that. It what he’s got planned next that worries me.  88",
      "characters": [],
      "action_text": "WITH Q: Q District line is the closest. There should be a service door on your left. WITH BOND: BOND Got it ... (pushes at the door) ... It won’t open. WITH Q: Q Of course it will. Put your back into it. WITH BOND: BOND Why don’t you come down here and put your back into it! He tries again. BOND No, it’s stuck... We can hear a train coming. BOND Oh good, there’s a train coming. WITH Q: Q Hm ... That’s vexing... Give it another push. WITH BOND: Train sounds much closer. Everything vibrating now. Bond strains -- pushing at the door. There’s the train! Zooming right at Bond! He whips out his Walther and fires--  89  (CONTINUED) Blam-blam-blam-blam-- And at the last second-- Throws himself at the door with everything he’s got-- It crashes open-- Train thunders past--! INT. UNDERGROUND TUNNEL - DAY --Bond lands. Pulls himself up. Train zips past behind him. He’s in one of London’s subterranean tunnels. Low, sloping brick ceiling. BOND I’m through. INT. MI-6 BUNKER - Q BRANCH - DAY Q Told you ... We’ve alerted security. Police are on their way. INT. TEMPLE TUBE STATION - DAY Meanwhile, Silva is moving down steps in a tube station. A few pedestrians around him. TWO UNIFORMED POLICEMEN head right toward him ... closer and closer ... but... They don’t stop him. Instead they hand him a large package as they pass. INT. UNDERGROUND TUNNEL - DAY Bond’s arrived at a metal door. Stops. Strange rumbling noise from the other side. Bond readies his gun. Silva could be on the other side. He braces himself, pushes the door open and steps through-- And is suddenly caught up in a surging mob of people. Bond conceals his gun.  90  CONTINUED:",
      "dialogue_count": 0,
      "word_count": 458
    },
    {
      "scene_number": 11,
      "slugline": "INT. TEMPLE TUBE STATION PLATFORM - DAY Train just pulling in. Crowd jostling. Hundreds of people buffet Bond along the crowded tube platform... Rush hour. Bond moves through the crowd, scanning for Silva. WITH Q: Q Where are you now? WITH BOND: BOND Temple tube station. Along with half of London. INT. MI-6 BUNKER - Q BRANCH - DAY Q moves from monitor to monitor.   He’s completely calm. A real professional. His eyes dart to CCTV security cameras from the platform as they cycle past: mobs of people ... He sees Bond. Q Oh, I see you, there you are. BOND (ON CCTV) I know where I am, Q. Where’s he? Q (V.O.) Give us a second, I’m looking for him. WITH Q: Q and his team continue to scan the images. BOND (V.O.) There’s too many people. I can’t see him. Q Welcome to rush hour on the tube. (Off mic) Not something you’d know much about...  91  (CONTINUED)",
      "characters": [],
      "action_text": "Bond and Q continue searching for Silva. On the CCTV monitor we see the figure of a policeman calmly getting onto the train. It’s Silva. Dressed as a riot policeman. Flak jacket. Silva loves the disguise. INT. TEMPLE TUBE STATION PLATFORM - DAY Bond continues scouting for Silva. It’s mobbed. He’s pushed and shoved as people get on and off the train that just pulled in. BOND Train’s leaving... Do I get on the train? Q (V.O.) Don’t get on the train. I’m not... WITH Q: Q ...sure he’s on it. Give us a minute. He studies the tube display... Trains moving around the system... WITH BOND: The tube train is full, it starts to pull out. Bond waits on the platform, frustrated. WITH Q: BOND (V.O.) Do I get on the train?! CCTV images from the platform ... Q’s eyes move from display to display... He sees Silva in the police uniform on the CCTV monitor! Q Bond? BOND (V.O.) What?  92  CONTINUED:  (CONTINUED) He looks at the image of Silva. Q (calmly) Get on the train. WITH BOND: Train’s almost out of the station-- Bond doesn’t hesitate-- Sprints-- Jumps-- Just catches the back door at the very end of the train with one hand-- As the train speeds into the tunnel, jerking Bond after it-- Husband and wife on the platform gape. HUSBAND  He’s   keen to get home... EXT. TUBE TRAIN - DAY Bond clings to the rear of the train as it zips through the tunnel. Inside, a female driver reads the paper-- BOND (knocking) Open the door, please. --Stops when she sees Bond staring at her. BOND Open the door! Stunned she reaches for the door. Bond steps inside. BOND Health and safety. Carry on. He moves on through to the train, leaving her speechless.  93  CONTINUED:",
      "dialogue_count": 0,
      "word_count": 462
    },
    {
      "scene_number": 12,
      "slugline": "INT. TUBE TRAIN - DAY Bond moves through the packed cars. Searching for Silva. Q (V.O.) ... Where are you? BOND Take a wild guess Q. Q (V.O.) He’s in disguise now. He’s dressed as a policeman. BOND Of course he is. INT. TUBE TRAIN - ANOTHER CAR - DAY Silva is moving through the cars. Calmly hiding in plain sight. INT. MI-6 BUNKER - Q BRANCH - DAY Q’s studies the complex web of tube lines on the monitor. Q (under his breath) Where’s he going..? Where’s he going..? INT. TUBE TRAIN - DAY Bond’s eyes scan the District line tube map on the train wall -- his eyes stop at ... Westminster. BOND He’s going for M. Tell Tanner. Get her out of there. He begins to run -- pushing people aside now, -- desperate to find Silva-- INT. WHITEHALL OFFICE - BOARD OF INQUIRY - DAY M sits, being lectured.  94  (CONTINUED)",
      "characters": [],
      "action_text": "DOWAR You’ve overlooked or chosen to ignore hard evidence and consistently, almost obstinately, relied on what you call your “gut instinct” when the evidence seems to dictate a more prudent course of action... Tanner’s computer displays an alert window. He glances at it, leans over to M: TANNER (whispers) Silva’s escaped. Bond’s in pursuit. We need to get you to a secure location immediately, ma’am. M (whispers) But I’m damned if I’m going to show her my back. DOWAR Are we straining your attention? M No, please Minister, proceed. Mallory watches M. He senses something is up. INT. TUBE TRAIN - DAY With Bond now. Pushing past the passengers. BOND Excuse me. Bond sees Silva in the next car. The train slows, begins to stop at the next station. Silva turns. Can see Bond in the next car. Staring at him. The train doors open. Silva darts out. Bond follows.  95  CONTINUED:",
      "dialogue_count": 0,
      "word_count": 308
    },
    {
      "scene_number": 13,
      "slugline": "INT. EMBANKMENT TUBE STATION - CORRIDORS/ESCALATORS - DAY Silva cuts through the crowd ... Bond close behind. BOND Move! Move! Can’t risk a shot. Too crowded. Silva diverts towards one of the incredibly steep and seemingly endless escalators ... Bond follows, pushes a little closer. Suddenly-- Silva leaps up to the area between the escalators and lies on his back -- he slides down -- like a treacherous bobsled run-- Flashing down in a matter of seconds-- Bond instantly follows-- Silva hits the ground, falls and recovers-- Runs flat out -- Bond lands close behind-- Now the tube station is filling with uniformed police personnel. Silva laughs, diverts through an old metal door. Bond spots the door ajar and follows... INT. WHITEHALL OFFICE - BOARD OF INQUIRY - DAY Meanwhile, M endures the continued grilling: DOWAR ...it’s as if you insist on pretending we still live in a “golden age” of espionage where human intelligence was the only resource available. Well, I find this rather old-fashioned belief demonstrates a reckless disregard for-- Mallory finally speaks. He interrupts rather sharply.  96  (CONTINUED)",
      "characters": [],
      "action_text": "MALLORY Excuse me, Minister, I don’t mean to interrupt, but just for the sake of variety, might we actually hear from the witness? He looks to M. She nods. M Thank you. INT. TUNNEL - DAY Bond has followed Silva through the door and into a tunnel. The tunnel slopes down. He’s lost sight of Silva. Vast rumbling sounds of the tube trains overhead. At the end of the tunnel, a vaulted catacomb. Dozens of brick arches. Long corridors of sinister shadows. Deep and dark. Bond stops. Listens ... Something’s moving ... Gun ready, Bond sees a light switch. He flips it. INT. UNDERGROUND CATACOMBS - DAY Banks of lights sizzle on -- cascading away from Bond -- gradually illuminating sections of the eerie chamber including-- Silva -- in the distance. Darts away. Bond tries to keep him in sight. Brief glimpses down arched corridors and around pillars. It’s Escher-like. Finally, Bond sees Silva in the distance trying to climb an old iron ladder up and out. Bond aims, fires. BLAM! BLAM! BLAM! Hits the next rung. Sparks fly. Silva withdraws his hand. Stops. SILVA ...Wow! Bond has him.  97  CONTINUED:  (CONTINUED) BOND I won’t miss next time, Mr. Silva. Bond slowly moves closer. Gun carefully raised: Silva on the ladder. SILVA Not bad. Not bad, James. For a physical wreck. BOND Why, thank you. SILVA You caught me. Now... here’s your prize. Silva reaches for his radio. He smiles deliciously. SILVA The latest thing from my local toy store. It’s called radio. It’s an electronic detonator. Silva presses the button and-- GIGANTIC EXPLOSIONS FROM THE ROOF! Strategically placed charges go off and-- THE CEILING COLLAPSES Tons of concrete cascade down. Bond ducks as it crashes down around him. He glimpses Silva through the rubble. Looks around him. He is unscathed! SILVA (smiles) Whoo!!! BOND (grimly) I do hope that wasn’t for me.. SILVA (laughs) No... But that is.  98  CONTINUED:  (CONTINUED) And then Bond hears it. A distant train approaching. Closer and closer. Bond turns. His face as he rea",
      "dialogue_count": 0,
      "word_count": 1253
    },
    {
      "scene_number": 14,
      "slugline": "INT. WHITEHALL OFFICE - BOARD OF INQUIRY - DAY By now the security guards at the side doors are taking aim at Silva-- Just as Bond enters-- But he lurches back as-- One of the guards is shot right in front of him -- Bond takes cover in the doorway as bullets are firing everywhere-- Bond sees M on the floor taking cover with Tanner-- One of Silva’s men shoots a security guard -- Mallory takes this opportunity to lunge for the dead guard’s gun -- he returns fire -- killing Silva’s man-- A ferocious barrage now -- Bond, Silva, Mallory, and Silva’s last man firing-- Meanwhile, Eve is moving along behind the table, trying to help-- Bond sees her -- slides a gun from one of the dead guards to her -- Eve grabs it and spins, fires, creating a distraction for Bond-- Across the room Bond can see Mallory taking cover in a doorway. Bond aims -- is he going to shoot Mallory? -- no, he shoots the fire extinguisher next to him-- Sudden burst of STEAMING WHITE POWDER obscures part of the room-- Bond sees there’s another fire extinguisher near him -- he turns and fires-- EXPLOSION of more white powder-- Bond takes advantage of the powder and crosses to the table where M and Tanner are hiding -- firing for cover as he goes-- Silva can’t see M through the clouds of white powder -- starts firing almost randomly -- shooting at the terrified people -- chaos. The sound of sirens. Still firing, Silva backs out of the room. Bond gives chase.  103  (CONTINUED)",
      "characters": [],
      "action_text": "Eve hustles the ministers out-- EVE Go! Go! Go! Move! Go! Move! --Tanner bundles M towards a side door. Mallory closes the door behind them. EXT. WHITEHALL OFFICE - DAY Silva is emerging from a rear exit - the faux police Discovery vehicle is waiting. Silva jumps in -- the Discovery speeds off and disappears into London as emergency vehicles start arriving. Bond arrives in time to see it go. Bond sees M’s staff car waiting there. EXT. WHITEHALL OFFICE - SECURE EXIT - DAY M and Tanner emerge from a different exit at the rear of the building. M climbs into the waiting staff car. As Tanner moves around to the other door -- the car shoots off! INT. M’S CAR - DAY M sways in her seat, surprised as they race away from Tanner - then sees that the driver is BOND. M 007, what the hell are we doing? Bond doesn’t reply. M Are you kidnapping me? BOND That would be one way of looking at it. M looks out the window at the chaos. Emergency vehicles scream past in the opposite direction.  104  CONTINUED:  (CONTINUED) M Too many people are dying because of me. Bond looks at her in the rearview mirror. Their eyes meet. BOND If he wants you, he’s going to have to come and get you. We’ve been one step behind Silva from the start. It’s time to get out in front. Change the game. M And I’m to be the bait? Bond nods. She agrees. M All right. Just us. No one else. Then he activates his earpiece again. BOND Q... INT. MI-6 BUNKER-Q BRANCH/INT. M’S CAR - DAY Q is on his laptop: tracking M’s car. BOND (V.O.) I need help. Q I’m tracking the car, where are you going? BOND (V.O.) I’ve got M. We’re about to disappear. Q What? BOND I need you to lay a trail of bread crumbs impossible to follow for anyone except Silva. Think you can do it? Q speaks quietly:  105  CONTINUED:  (CONTINUED) Q I’m guessing this isn’t strictly official? BOND (V.O.) Not even remotely. Q So much for my promising career in espionage.... EXT. EAST END STORAGE UNIT - NIGHT A line of lock-ups. M gets out, watching Bond as he fiddl",
      "dialogue_count": 0,
      "word_count": 1207
    },
    {
      "scene_number": 15,
      "slugline": "EXT. SKYFALL - DAY The car emerges from the forest. Ahead, an imposing stone gate. Old and decaying. Carved on the gate: SKYFALL. The DB-5 pulls through the gate... Down the drive... Finally revealing... An old hunting lodge at the head of a long valley that stretches away for miles ... Beyond the lodge is desolate moorland and the cold glimmer of a frozen lake. The lodge looks lonely and deserted. Everything has fallen into disrepair. More dead than alive. EXT. SKYFALL - LODGE - DAY Bond and M climb out. They face the imposing old house. M Christ. BOND Uh...Mm. M No wonder you never came back. They go to the front door. INT. LODGE - CENTRAL HALLWAY/GREAT HALL - DAY The front door creaks open. For Bond, it’s like entering a haunted place. Light shafts cut through the dusty rooms. It’s dark. Bond moves through the huge and echoing main hall. Then a sound-- A floor board creaks--  110  (CONTINUED)",
      "characters": [],
      "action_text": "They stop. Turn. And from the darkness, a figure emerges... An old man holding a shotgun. Handsome, weathered face. Strong body. Blue eyes, white beard. He looks at Bond... KINCADE James... James Bond. BOND Good God. Are you still alive? Kincade looks at him, stows his shotgun. KINCADE Ha!... It’s nice to see you too. Slowly smiles. As does Bond. Kincade claps his hand warmly. BOND M, this is Kincade. Gamekeeper here since I was a boy. KINCADE (misheard) Pleased to meet you, Emma. M Mr. Kincade. KINCADE You’re a tad late. They’ve sold the place when they thought you were dead. Seems they were wrong. A steady look to Bond: KINCADE What are you doing here? Bond looks at him. Decides. BOND Some men are coming to kill us. We’re going to kill them first. KINCADE Then we’d better get ready.  111  CONTINUED:  (CONTINUED) Bond glances to M. Her expression: your call. Bond looks back to Kincade. BOND Do we still have a gun room? KINCADE Ah. INT. LODGE - GUN ROOM - DAY Impressive gun room ... But the gun cabinets are empty. Notch after notch. Shelf after shelf. Empty. M stands with Bond and Kincade. Bond looks over the empty shelves, disheartened. They’ve put their weapons out on a table. It’s not impressive: Bond’s Walther and Kincade’s shotgun. KINCADE They sold the lot to a collector from Idaho or some such place. They were shipped out weeks ago ... There’s just your Father’s old hunting rifle. He gets it. A beautiful old rifle, intricately carved. Bond takes his father’s old rifle, looks at it. KINCADE We couldn’t let that go. The initials carved into the stock catch Bond’s eye. “A.B.” His father. M looks over the paltry collection of arms: M And this is what we’ve got. Bond sets the old hunting rifle down on the table. KINCADE There might be a couple sticks of dynamite from the quarry... But if all else fails...  112  CONTINUED: (2)  (CONTINUED) He puts his hunting knife on the table. KINCADE Sometimes the old ways are the best. EXT. MOOR - DAY Little Scottish landscapes",
      "dialogue_count": 0,
      "word_count": 1600
    },
    {
      "scene_number": 16,
      "slugline": "INT. LODGE - GREAT HALL - DUSK TO TWILIGHT The two men are moving into the Great Hall, guns raised, sweeping through the room-- Now we see that M is just around the corner, in the Dining Room-- She peeks in and sees them. Then she leans back and flips the light switch on the wall next to her and-- BLAM! The improvised light bulb bombs she rigged before explode! Bolts and scrap metal fly like shrapnel. The room is blasted and the two go down as-- EXT. LODGE - FRONT - DUSK Bond reloads and is instantly out of the car and firing with the hunting rifle -- BLAM! BLAM! One of Silva’s men at the corner of the house goes down. Bond ejects, reloads and marches toward the house -- fires again -- BLAM! BLAM! -- taking down the other man-- INT. LODGE KITCHEN - TWILIGHT Kincade reloads, takes cover by an archway leading into the kitchen. INT. LODGE - ENTRY HALL - TWILIGHT Bond enters. Framed in the doorway, he tosses the rifle aside and grabs an automatic weapon from one of Silva’s dead men. EXT. LODGE - BOOT ROOM - TWILIGHT Meanwhile, Silva’s remaining TWO MEN that broke off earlier move around the rear of the house. They arrive at the Boot Room door. WHAM! They kick the door open. INT. LODGE - KITCHEN - TWILIGHT Kincade breaks cover--  119  (CONTINUED)",
      "characters": [],
      "action_text": "Silva’s two men push through the back door of the kitchen -- BOOM! BOOM! Kincade fires -- He misses! The two men back off and separate -- one man continues into the kitchen towards Kincade, the second heads into the dining room. Kincade ducks behind a wall and prepares to reload. He drops the shotgun shells, they clatter across the floor. He curses, fumbles for more shells... Silva’s Man moves closer... raises his gun -- Just as Bond enters! Killing the man-- Kincade wide-eyed. BOND You drop something? INT. LODGE - DINING ROOM/GREAT HALL - TWILIGHT In the Great Hall, M has ventured out to see the aftermath of the light-bulb bomb. The two men lie dead. She has also heard Kincade’s gunshots, and is alert ... she senses movement. The other man who came through the back door is in the Dining Room. She tucks behind a cabinet, and prepares the Walther ... She peeks around the cabinet through the dusty shambles of the Great Hall -- sees the man -- fires -- BLAM! -- misses-- He gets off a shot-- The bullet shatters the cabinet by M’s side -- wood and debris fly -- she’s injured-- Just as Bond comes into the room -- firing -- blowing Silva’s man off his feet. BOND You hurt?  120  CONTINUED:  (CONTINUED) M (covering) Only my pride. I never was a good shot. Bond flips over the final dead body, looking for Silva. BOND He’s not here. (moving through the room) He’s not here. And then they hear it. An incongruous sound through the silent house... Approaching from outside... Whoop-whoop-whoop-whoop... EXT. SKYFALL - TWILIGHT Like a great prehistoric beast, a huge army HELICOPTER sweeps through the valley... flying low over the moorland... INT./EXT DINING ROOM - TWILIGHT They move to the Dining Room, towards the sound. Bond looks out of the window. Kincade and M enter behind Bond. Bond stands looking out. We see his POV of the helicopter approaching the house. BOND (to himself) Always got to make an entrance. You two, go to the kitchen... now! Kincade and M move. Bond goes to anothe",
      "dialogue_count": 0,
      "word_count": 3035
    },
    {
      "scene_number": 17,
      "slugline": "EXT. WHITEHALL - ROOFTOP - DAY The rooftops of Whitehall and beyond them London. Bond stands. Alone with his thoughts. Eve approaches. She carries a box. EVE Wow! I didn’t even know you could come up here... BOND Hate to waste a view. Eve looks out. EVE I can see why. BOND I thought you were going back out on active service. EVE I declined. You said it yourself. Field work’s not for everyone. BOND If it helps, I feel a lot safer. She smiles. EVE ...Her will was read today. She left you this. Bond takes the box. Curious. A bequest in M’s will? He opens the box... Inside: The ugly Union Jack bulldog paperweight from her desk. The one he always hated. EVE Maybe it was her way of telling you to take a desk job? BOND Just the opposite.  136  (CONTINUED)",
      "characters": [],
      "action_text": "He looks at the ugly old thing. He smiles. BOND Thank you. Eve leaves. Bond stares out at the city view. INT. WHITEHALL - EVE’S OFFICE - DAY Bond and Eve enter her office. We notice it’s a little familiar... coat stand in the corner... padded leather door to the inner office... BOND You know, we’ve never been formally introduced. EVE Oh. Well, my name’s Eve... Eve Moneypenny. BOND I look forward to our time together, Miss Moneypenny. EVE Me too. I’m sure we’ll have one or two close shaves. She smiles playfully. Tanner emerges from the inner office carrying some files: TANNER Morning 007. BOND Good morning, Tanner. TANNER He’ll see you now. He nods for Bond to proceed. Bond goes into the inner office... INT. WHITEHALL - MALLORY’S OFFICE - DAY Bond walks in.  137  CONTINUED:  (CONTINUED) BOND How’s the arm, sir? Mallory sits behind the desk, his arm in a brace from his injury. MALLORY What? He looks at it as if he hadn’t noticed it before. MALLORY Oh, it’s fine. It’ll get better. All pretty shocking for someone unused to field work ... So, 007. Lots to be done. Mallory places a new Top Secret case file down on his desk. MALLORY Are you ready to get back to work? Bond looks down at the file. Then back up to Mallory. BOND With pleasure, M. Close up on Bond. Those icy blue eyes. BOND With pleasure. Snap to black. The End.  138  CONTINUED:",
      "dialogue_count": 0,
      "word_count": 392
    }
  ]
}