{
  "slug": "skyscraper-2018",
  "title": "skyscraper",
  "genre": "action",
  "format": "film",
  "scenes_count": 8,
  "characters_count": 0,
  "characters": [],
  "total_words": 24694,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. THE PEARL - PRIVATE RESIDENCE - DAY A stunning three-bedroom apartment on the   98th floor   with jaw-dropping views.   Henry and Georgia are transfixed by the television playing the promotional video... SOOTHING VOICE But that's not all.   The Pearl's crowning achievement -- the singular feature that makes this building unlike any other, anywhere else in the world is... ...but just before we reveal what that might be, the TV cuts off. Henry and Georgia turn to see Sarah standing there. SARAH TV goes off, shoes on.   It's Panda Time! Excited, Georgia zips up her PANDA HOODIE, pulling the cowl over her head, turning her into a mini-Panda bear. SARAH   (cont'd) Nice, Georgia.   Subtle. beat (   ) Where's your dad? HENRY Bathroom. GEORGIA He's talking to himself again. INT. THE PEARL - BATHROOM - DAY Dressed nicely, Will ties the laces on his BROWN WINGTIP. Only the shoe is facing him on the bathroom sink counter, attached to his PROSTHETIC LEG -- a handy way to do it. He talks to himself in the mirror as he goes, practicing the Chinese phrase over and over, stumbling every time.   Will shakes his head muttering to himself... WILL Screw   it.   I'm just gonna high-five the guy. Finished tying   his shoe, Will uses a Kleenex to wipe off a smudge on   it,   then tosses the tissue paper into the toilet. (CONTINUED)  12.",
      "characters": [],
      "action_text": "Will attaches his prosthesis, sliding his pant leg down over it.   He goes to flush the toilet but can't find the handle -- there doesn't seem to be one.   It's a mystery. Will looks at a BIZARRE ARRAY of touchscreen buttons next to the toilet -- none of which look like \"flush\".   He presses one and gets a BIDET SPRAY   right in the kisser. One cue,   Sarah walks in. SARAH Everything okay in here? WILL Yep,   just thought I'd take a shower in the toilet. Sarah walks over... WILL   (cont'd) It's broken.   We should call-- ...and presses   a button, the toilet flushes normally. WILL   (cont'd) I was gonna pick that one   next. SARAH Sure you were, big guy. Sarah   fixes   Will's outfit,   drying   him off,   fussing over him. SARAH   (cont'd) Hey -- you think it's weird that we're the only ones on this floor? WILL We're the only ones on any floor from the 96th on up -- so not really. SARAH No, I mean why not put us up in the hotel in the bottom half?   Why give us an entire ghost town floor to ourselves? WILL I don't know -- maybe he's trying to impress us. SARAH You think a billionaire, real estate tycoon is trying to impress us? (CONTINUED) CONTINUED:   13. WILL You think I'm reaching? SARAH I think you drive a Kia.   So, yeah. WILL I'm just saying: don't over-think it. SARAH Have you met me? Will smiles, grabs his jacket, closes his LAPTOP and puts it in his SHOULDER BAG. SARAH   (cont'd) Horace is coming to get you? WILL Any minute now. SARAH Can I just say one thing? WILL I doubt it. SARAH Don't give him any money. WILL He's not going to ask me for money. SARAH How do you know? WILL Because he's head of security for this entire building and they pay him for that. Will and Sarah move into the other room and tag-team   getting Georgia and Henry   ready, backpacks, shoes, etc.   Will puts Georgia's hair into a ponytail, clearly he's had practice. SARAH And how much of that does he double down with? Will frowns.   Moves toward the front door, Sarah follows. (CONTINUE",
      "dialogue_count": 0,
      "word_count": 7771
    },
    {
      "scene_number": 2,
      "slugline": "EXT.   HONG KONG   STREET - NIGHT The Police Van, escorted by   HKP   on motorcycles, moves through the crowded streets, sirens wailing. INT. POLICE VAN - SAME Will rides wordlessly with the assault team.   Suddenly a BUZZING.   Will glances at his laptop bag -- he can see his phone in the mesh webbing of one of its outer pockets. It's Sarah's face.   She's calling him.   It's nothing short of torture for Will as he's feet away but can do nothing. WILL Answer it! The assault team ignores him. WILL   (cont'd) ANSWER MY PHONE! Will tries to answer it himself, moving to get up when he takes the butt of a rifle to the gut for his trouble. Will crumples.   Coughing.   His phone shows the missed call from Sarah.   Wills swings his gaze to a SMIRKING GUARD. Will's eyes narrow, he's gonna--  WHAMMMMM!  OUR WORLD GOES UPSIDE DOWN.   We're trapped in a   violent clothes dryer as we spin and tumble. EXT.   HONG KONG   STREET - SAME The police van is T-boned by a BATTERING RAM TRUCK, sending it spinning like a rolling pin into the   side   of a building. Instantly, a HALF-DOZEN   GANGSTERS, sporting CHINESE DRAGON MASKS, race up in MOTORCYCLES,   ambushing   HKP   officers. It's over in a blink as the Gangsters cut down the cops. INT. POLICE VAN - SAME It's dark   in here. The interior van light stutters, offering an eerie strobe effect. We're completely upside down. (CONTINUED)  48.",
      "characters": [],
      "action_text": "GUNFIRE and shouting outside.   A turkey shoot underway. In the back of the van, the Assault Team members groan, some out cold.   Will shakes out the cobwebs just in time to hear the ROARING WHINE of a gas-powered blade saw. Suddenly a showering of hot sparks rain down inside the van -- the doors are being cut open from the outside. Then a CROWBAR is wedged in prying this prize box open -- one thrust, then two.   The doors crack free revealing: THREE   DRAGON-MASKED GANGSTERS, smoke roiling   past their   horns in wicked slow motion. The   Smirking   Guard goes for his gun but takes two rounds in the chest from the LEAD GANGSTER.   The Lead Gangster swings the barrel of his carbine to Will. A moment as it looks like this might be the most expensive short film in the history of cinema. But then the Lead Gangster drops his weapon and reaches past Will, snagging the thing he came for -- the LAPTOP BAG. The Lead Gangster makes sure the laptop is inside, then he tosses the bag to a waiting COMRADE on a motorcycle.   The comrade tears ass out of there. Fast approaching sirens. No time, the   masked Gangsters   back away, splitting apart   on   their   motorcycles   -- heist complete. IN THE VAN Will   hears   sirens and   weighs his options: stay here and stay arrested or seize the moment and go rescue his family. For a guy like Will, there's only one answer. He   searches   for the CUFF KEYS, finding them on the   Smirking Guard's belt. Will quickly   frees   himself, snags a SIDEARM   and exits. OUTSIDE THE VAN the SIRENS have grown louder, he's got only seconds to make his escape.   BYSTANDERS have   begun   to gather -- they point at Will when he appears   from the wreckage.   Some start shouting.   Many others record it all on their smartphones. (CONTINUED) CONTINUED:   49. Will gets his bearings quickly, scanning the skyline until he finds what he's looking for, then he heads off in that direction -- people part like the Red Sea as this   massive maniac with a gun m",
      "dialogue_count": 0,
      "word_count": 989
    },
    {
      "scene_number": 3,
      "slugline": "EXT.   HONG KONG   STREETS   - NIGHT The broadcast plays inside a bar, patrons are rapt by it. We find Will watching too   from an ALLEYWAY.   He scans the area, every TV screen he sees is playing the same thing: his face right next to the burning Pearl.   He's a wanted man. Will's mind churns: his image is everywhere and he's a foot taller than everyone in this city -- he'll stick out like a sore thumb on the street.   Unless... Catercorner,   Will spots a BEGGAR in a WHEELCHAIR panhandling. CUT TO: THE BEGGAR looking up at us.   A FISTFUL OF CASH is held out to him. Reveal Will as he brings his finger to his lips: SHHHH.   The Beggar smiles a toothless smile and reaches for the cash. INT. THE PEARL - PRIVATE RESIDENCE - BATHROOM - NIGHT Georgia submerges bathroom towels in the tub as Sarah kneels in front of Henry holding an ASTHMA INHALER. HENRY I'm fine, mom. SARAH You're fine now, honey, but we're about to go out there and there's a lot of smoke and bad air and I don't want you to have an attack, okay? to Georgia (   ) Dunk them all the way, make sure the whole thing gets wet.   The hand towels too. Georgia does as she's told.   Sarah looks back to her son... SARAH   (cont'd) Two quick inhales, please? Henry obliges. SARAH   (cont'd) Good job.   Thank you. pocketing it (   ) I'll have it right here with me if you need it, okay? (CONTINUED)  52.",
      "characters": [],
      "action_text": "HENRY Okay. GEORGIA Mom -- are we gonna die? The directness of the question stops Sarah short. SARAH No honey, we're not gonna die. HENRY Where's Dad? SARAH He's not here. HENRY Is he coming to get us? They look at their mother.   Sarah knows this moment matters. SARAH There's nothing in this world that would stop your father from keeping you both safe. HENRY And you too, right? SARAH And me too. Sarah opens her toiletry kit and takes out a pair of CHROME SHEARING SCISSORS. SARAH   (cont'd) Hand me those towels. EXT. OFF-SITE CONTROL FACILITY - NIGHT A motorcycle rips toward the chain-link fence.   The Tough Guy, now dressed as the security guard, opens the gate. Clutching Will's laptop bag, the Biker roars through. INT. OFF-SITE CONTROL ROOM - MOMENTS LATER The Biker rushes into the room and hands the laptop to Xia. She tosses it to the Techie who snags it out of the air and quickly boots it up, gaining access the precious control protocols he needs. (CONTINUED) CONTINUED:   53. XIA  Do it.  ON SCREEN we see full access granted.   The Techie expertly engages   all   of   the anti-fire measures from the 95th down, a cascade of GREEN COLORED FLOORS all the way to the bottom. Then he deactivates all of the anti-fire measures from the 96th   to the top   -- all of those floors BLINK RED. With a swipe on   the   touchscreen, the FIRE DOORS from the 97th   on up slide open, feeding the fire with fresh air. ON THE 96TH FLOOR we see the flames ROAR UPWARD, like a living creature -- a twisting tornado of fire thirsty for fuel and hungry for oxygen. The blaze climbs higher -- a kiln burning white-hot. BACK TO: TECHIE  Ladies and gentlemen, I give you a 6.5 billion dollar chimney.  XIA  Lock   it   in.  Some fancy keystrokes add an encryption code to the changes in the building, effectively making them permanent. TECHIE  Encrypted.  He pops up and hands Will's laptop to Xia. TECHIE   (cont'd)  You've got full systems control from that laptop and that laptop only.   No pass co",
      "dialogue_count": 0,
      "word_count": 928
    },
    {
      "scene_number": 4,
      "slugline": "INT. THE PEARL - PENTHOUSE BOARDROOM - NIGHT Zhao stares at his giant WALL MONITOR: every floor above the 95th   is BLINKING RED, the anti-fire measures all read as OFF-LINE.   Clearly, something is   rotten in Denmark. The suits are agitated.   One sips a bottle of water, his hand shaking as he does.   Mr. Pierce paces, nervous. MR. PIERCE I thought you said the fire wouldn't spread.   You said it would be contained.   What's wrong with your building?   Don't you have sprinkler systems? ZHAO Yes and   the   sprinkler systems on the 96th floor engaged as designed. MR. PIERCE Really?   Then why didn't the fire go out? ZHAO Because the water caused the fire. MR. PIERCE Come again? ZHAO It's the   only   conclusion.   And there's only one way water   itself   can cause a fire:   through an exothermic chemical reaction.   Which means this wasn't an accident -- it was arson. Dov, Zhao's body man, returns... DOV Local control is completely locked out and off-site's not answering. The entire system's been compromised -- our techs are trying to crack it. beat (   ) And there's something else. ZHAO What? (CONTINUED)  56.",
      "characters": [],
      "action_text": "DOV Our log codes show Will Ford's family swiped into their residence two hours ago, before the fire. That news puzzles Zhao, but he's got bigger fish to fry... ZHAO How long to get control of the building back? DOV I don't think they really know, sir. ZHAO What was their estimate? DOV Eighteen hours. The suit drinking the bottle water nearly chokes on it. MR. PIERCE Eighteen hours?!   We don't have eighteen minutes!   This thing's burning like a match! ZHAO Matches burn from the top down. MR. PIERCE Oh fuck you, Buddha!   We need to leave! ZHAO You're missing my point.   With the fire doors open above the fire and closed below them, this building isn't burning like a match -- it's burning like a kiln.   It's super- heating. MR. PIERCE Are you saying it'll collapse? ZHAO No -- The Pearl could burn to cinders and never collapse.   Collapse isn't the issue. MR. PIERCE Then what is? (CONTINUED) CONTINUED:   57. ZHAO The real issue is that the building doesn't   know   it's on fire.   And if it doesn't know it's on fire, it can't act to preserve itself.   Which means the fire will grow hotter and hotter and   spread   faster and faster until it has nothing left to feed on.   Until it eats itself to death.   Until it consumes us whole. MR. PIERCE Fantastic.   Wonderful.   I think we've all learned something really valuable here today. I know I have. Now can we please get on the fucking helicopter? ZHAO You know what's interesting about you, Mr. Pierce? MR. PIERCE What? ZHAO Nothing. Dov chimes in, speaking softly... DOV Sir, you know as well as I do that if the fire gets within twenty floors of us it will   over-heat   the air around the   helipad making liftoff impossible.   If we're going to evacuate, we need to do it now. Zhao weighs the situation.   Then he makes his decision. ZHAO Alert the authorities that we'll be departing. With that, Zhao exits. INT. THE PEARL - PENTHOUSE BEDROOM - NIGHT Zhao moves through his lavish bedroom and into his WALK-IN CLOSET.   Passin",
      "dialogue_count": 0,
      "word_count": 1172
    },
    {
      "scene_number": 5,
      "slugline": "INT. EMERGENCY OPS TRAILER - NIGHT Flanked by his second-in-command, LIEUTENANT HAN, Captain Chan drinks black tea from a paper cup as he moves through the Ops Trailer, keeping an   eye on a series of MONITORS which play local news broadcasts of the unfolding event. LIEUTENANT HAN  ...Fire   Chief says there's nothing he can do.   Water pressure from the trucks can only hit the 30th floor, tops.   The system crash shut down the standpipes in the building -- there's no way to get water up high enough.  CAPTAIN CHAN  So what's he saying?  LIEUTENANT HAN  He's saying it's gonna burn.  CAPTAIN CHAN  Get a team to that off-site control facility -- we need those systems back online.  LIEUTENANT HAN  Yes, sir.  CAPTAIN CHAN  What about the guy -- Will Ford. What do we know?  LIEUTENANT HAN  Marine Corps, Bronze Star, FBI for six years,   Hostage Rescue Team for eight -- early retirement.  CAPTAIN CHAN  Early?  LIEUTENANT HAN  I guess there was an incident.  CAPTAIN CHAN  What kind of an incident?  LIEUTENANT HAN  We're not clear on it yet.  CAPTAIN CHAN  Get clear.  (CONTINUED)  61.",
      "characters": [],
      "action_text": "LIEUTENANT HAN  Yes, sir.  CAPTAIN CHAN  What about the other guy?   The   dead one in the bathtub.  LIEUTENANT HAN  Still no ID on him but medical examiner says he was killed eight, maybe ten hours beforehand.  CAPTAIN CHAN  So you're telling me this one-legged American war hero, travels thirteen thousand miles -- with his wife and kids who no one can seem to locate by the way -- to kill a John Doe this morning, dump the body in his FBI buddy's bathtub before offing him too and then, to kind of round out the evening,   decides to light   the tallest building in the world on fire? That's where we're at with it?  LIEUTENANT HAN  That's what it looks like right now, yeah.  CAPTAIN CHAN  And the attack on the van -- the one that sprung him -- that's part of this?  LIEUTENANT HAN  Maybe.   Maybe not.  CAPTAIN CHAN  Well I don't know about you Lieutenant, but I think we might win a medal for our police work here. Outstanding stuff.  beat (   )  How 'bout this: is there anything we do know for sure?  LIEUTENANT HAN  Zhao's leaving his penthouse by helicopter.   Got word ten minutes ago.  CAPTAIN CHAN  Well, thank god the billionaire's safe.  beat (   )  Lieutenant?  (CONTINUED) CONTINUED:   62. LIEUTENANT HAN  Yes, sir?  CAPTAIN CHAN  Do me a favor?   Go find Will Ford. I'd like to ask him some questions.  LIEUTENANT HAN  Yes, Captain.  Lieutenant Han turns to go but... CAPTAIN CHAN  Lieutenant.  LIEUTENANT HAN  Sir?  CAPTAIN CHAN  Never mind.   Found him.  Captain Chan points   a large monitor   where we   see LIVE NEWS HELICOPTER FOOTAGE of Will climbing the vertical spire of the super crane   FROM THE OUTSIDE. CAPTAIN CHAN   (cont'd)  Send a   strike   team.  An OPS TECH chimes in... OPS TECH  Already there, sir.  EXT. ADJACENT BUILDING - SUPER CRANE - NIGHT NEWS CHOPPERS circle, blasting Will with their SPOTLIGHTS as he works his way, inch-by-inch, up the exterior scaffolding of the 300-hundred foot tall super crane. ON THE CRANE SPIRE, Will mutters to himself... WILL",
      "dialogue_count": 0,
      "word_count": 3660
    },
    {
      "scene_number": 6,
      "slugline": "INT. THE PEARL - PENTHOUSE - SAME Zhao's penthouse is thrown into darkness.   Emergency lights CHUNK ON.   He pulls out his cellphone: no signal. INT. THE PEARL - PENTHOUSE FLOOR - SAME Standing   at   the titanium doors, Pierce looks at his team... FENG  How do we get in?  PIERCE  We can't.   But   I know   someone who can.   And he happens to be in the building.  FENG  The American?   But we don't know where he is.  PIERCE  We don't have to know where he is -- we know what he wants.   All we need to do is get to them first.  INT. THE PEARL - PANGU PARK - NIGHT Sarah and the kids kneel by the stream in the park. Georgia, still sporting a soiled Panda hoodie, re-wets their towels in the ersatz lake.   Henry coughs from smoke inhalation -- an asthma attack taking hold. SARAH It's okay, baby.   Just slow down. Slow down and breathe.   In for three, out for three. Sarah   gives him two hits from the inhaler and   helps Henry calm his breathing, trying to get his attack under control. The MUFFLED ROAR of the unchecked blaze GROWLS from below, a leviathan rising.   Sarah's worried. SARAH   (cont'd) Okay, we gotta go. GEORGIA Why?   There's water here. (CONTINUED)  76.",
      "characters": [],
      "action_text": "SARAH It's not safe. HENRY How do you know-- BOOM!   -- a FIRE DOOR on the far end of the park rockets off its hinges as flames reach through the new opening. SARAH Run! Sarah hustles her kids through the park as from all angles the fire begins to claw its way into the floor. Fire breaks through the seams in the sod -- ZIG-ZAGGING through the grass like snakes, chasing Sarah and the kids. They rush for a STAIRWELL DOOR just as it   EXPLODES LIKE A PIPE BOMB.   They duck as the door WHIZZES overhead shearing through a METAL LAMPPOST behind them. Sarah   grabs her kids and yanks them in the other direction, pushing them toward their only escape:   THE INNER ATRIUM. Henry struggles.   Sarah picks him up, carrying her son, as the trio rush across THE SKY BRIDGE, a narrow footbridge with a glass canopy that spans the diameter of the INNER ATRIUM. From above, we watch as Sarah and the kids race across the sky bridge; the world below them filled with ash and fire, glowing like the mouth of a volcano. ON THE FAR SIDE OF THE BRIDGE they find respite -- this part of the park hasn't been consumed by fire yet.   Sarah puts Henry down, spotting another STAIRWELL DOOR on the opposite wall.   She's about to make for it when, suddenly, it opens revealing   FENG. The guy doesn't miss a beat -- he smiles warmly... FENG Hey!   We've been looking everywhere for you guys. Sarah exhales -- relieved. Then Feng speaks into his mic... (CONTINUED) CONTINUED:   77. FENG   (cont'd) Got 'em.   They're in the park. Something about his tone catches Sarah, she doesn't like it. HENRY Mom -- is that a fireman? SARAH I don't know, honey. calling out (   ) Who are you? FENG Building security.   We met earlier, remember? Feng continues walking, closing the gap between them as Sarah subtly moves in front of her children. FENG   (cont'd) You need to come with us now -- the building's not safe, we're evacuating. Feng reaches for Sarah, she steps back. SARAH I want to see your ID. FENG Miss -- please.   We",
      "dialogue_count": 0,
      "word_count": 5069
    },
    {
      "scene_number": 7,
      "slugline": "INT. THE PEARL - PENTHOUSE FOYER - SAME The CONTROL PANEL next to the PENTHOUSE DOORS flashes the same: FIRE-FIRE-FIRE.   With a heavy metal CHUNK, the TITANIUM DOORS UNLOCK AND SLOWLY START TO SWING OPEN. INT. THE PEARL - PENTHOUSE BEDROOM - SAME The panel by Zhao's bed blinks: FIRE-FIRE-FIRE.   Zhao pulls open his nightstand drawer snatches up a PALM-SIZED BERETTA NANO -- an executive's gun meant to be concealed. Zhao exits. INT. THE PEARL - PENTHOUSE FOYER - MOMENTS LATER Zhao rounds the corner to see the front doors to his penthouse wide open.   He moves to the nearest control panel and tries to shut the doors, but the programming won't allow it -- the fire alarm overrides his controls. Thinking fast,   Zhao pulls his smartphone out of his pocket, snags   a   nearby   USB cable and plugs his phone directly into the panel itself.   He starts thumbing away like mad. EXT. THE PEARL - PANORAMIC WINDOW - NIGHT Will lets go of   the control box   and begins to make his way back across the panoramic window, slide step by sli -- BOOM! A DEAFENING EXPLOSION rattles the world. Will falls. Everything goes topsy-turvy as we plummet.   Suddenly, we're jerked to stop as Will's securing rope snaps taught. That's the good news. The bad news is that the sudden force of the fall has caused Will's securing   rope   to slip down his body -- coming to a snug cinch point around the ankle of Will's prosthetic leg. Fire raging around him,   Will dangles upside down by his ankle, a mile up,   like a rabbit caught in a rope snare. THE MARBLE PEDESTAL is yanked against the window frame at a poor angle, wedging itself against the transom in anything but a secure fashion. (CONTINUED)  97.",
      "characters": [],
      "action_text": "Swinging upside down, Will gets his bearings.   He tries to curl his body up toward the rope -- like a hanging sit-up -- but the added strain of the move causes his prosthetic sleeve to loosen --   WILL'S LEG IS SLIPPING OUT OF IT. Will falls back, dangling by a leg that's coming   loose. Like a car teetering on the edge of a cliff, any movement from Will might cause his leg to come undone completely. The earth a postage stamp below him,   Will steadies himself, becoming as still as   possible, barely daring to breathe. Will knows he's going to have one shot at this.   He gathers his courage and makes one sharp move. With a grunt, he breaks into action using his free leg to kick off the face of the building while throwing his hands toward his toes, propelling himself upward with such force that his   RESIDUAL LIMB POPS OUT OF THE PROSTHESIS. For a blink, Will is in complete free fall -- no rope, no leg -- but his hands snag hold of the CARBON FIBER FEMUR at the last possible second. A strange sight indeed: a one-legged man, clinging to a metal leg, attached to a rope, 3,000 feet in the air. Will starts pulling with everything he's got.   A dead-hang rope climb.   The weight of this undulating action causes THE MARBLE PEDESTAL to strain against the window transom, inching closer and closer to dislodging completely. WILL free-climbs for all he's worth, hand-over-hand, a man of undying determination: his arms burning, but his eyes focused on the open window ledge ten feet   above him. INT. THE PEARL - PENTHOUSE FOYER - NIGHT At the control panel for the doors, Zhao has used his smartphone to hack   bypass   the fire alarm function and   he instructs the doors to reset. Zhao jabs the \"SECURE DOORS\" button the panel and watches as the titanium Goliaths lurch toward each other. Zhao takes cover behind a LOW CABINET, checking   his mini- Beretta, ready to plug anyone who   comes   through the door. CONTINUED:   98.",
      "dialogue_count": 0,
      "word_count": 638
    },
    {
      "scene_number": 8,
      "slugline": "EXT. THE PEARL - PENTHOUSE FLOOR - NIGHT Will's forearm slaps over the marble pedestal.   He   pulls himself up and over the final hurdle. Exhausted, Will collapses.   But only for a moment as he suddenly sees the penthouse doors closing -- he's only got seconds before they shut again, sealing him out for good. Leaping into action, Will starts pulling up the rope, his prosthesis dangling on the other end like fish on a hook. Just then, another explosion from below rocks the penthouse floor causing the marble pedestal to break free and plummet through the window like an anchor. The cord rips through Will's duct-taped hands, smoking them as Will's prosthesis whips back to him like a boomerang. Will clutches his leg as it's being pulled from his grip by the   four-hundred pound pedestal   on   other end of the rope. Will glances back at the penthouse doors -- they're almost closed now: he's gotta make a choice his leg or the door. But Will makes a third play: he pulls the statue's sword from his waistband and cuts the rope with one downward hack. The rope whips through the window opening as Will tumbles back, his prosthetic leg in his hand. Will jams his leg into the PROSTHETIC SLEEVE and spins to see the penthouse doors a foot from sealing shut. Will bolts for them, diving into a head-first slide on his side -- like a car up on two wheels -- and narrowly SKIMS THROUGH THE OPENING.   He made it. Only, he didn't. Will's PROSTHETIC ANKLE is caught in the door like a bear trap.   Will tugs on it with both hands,   it won't budge. With one final pull, Will yanks his leg through the doors, which quickly seal shut behind him, tumbling back into a heap on the foyer.   Then: ZHAO (O.S.) Don't move. Will looks up to see Zhao pointing his tiny Beretta a foot from Will's nose.   Will's shoulders slump at his luck. (CONTINUED)  99.",
      "characters": [],
      "action_text": "WILL You're too close. What an odd thing to say.   Zhao doesn't follow... ZHAO What? WILL You're... WHACK! With cat-like quickness, Will slaps the Beretta out of the inexperienced billionaire's hands   as he   yanks Zhao's wrist downward and simultaneously sweeps   his leg, dropping him to the polished floor -- a slick-ass take down. WILL   (cont'd) ...too close. Will pounces on him, driving the point of his good knee between Zhao's shoulder-blades, pinning him there. WILL   (cont'd) We need to talk. CUT TO: A SMALL MAN IN A SHARP SUIT. Tan, salt & pepper hair.   Bushy eyebrows.   Capped teeth.   A Chinese Martin Scorsese.   This is WU-SAI JUN, kingpin and crime lord of   Hong Kong.   He smiles at us. WU-SAI JUN  I know this is difficult.  We're... INT.   GANGSTER'S OFFICE   -   NIGHT Opulent, dark. The den of a powerful man.   Zhao sits opposite Jun.   Xia   sprawls on a   nearby   chaise as   Feng   looms   in view. Behind   Jun, the most striking   feature: a   wall comprised of GLASS TERRARIUMS, each containing a solitary SNAKE. WU-SAI JUN  For a man like you, this must come with some discomfort.  (MORE) (CONTINUED) CONTINUED:   100. But you can take solace in the fact  WU-SAI JUN   (cont'd)  that it's all for a greater good. The glory of The Middle Kingdom.  ZHAO  Forgive me, but I don't see how extortion glorifies China.  WU-SAI JUN  This isn't extortion, Mr.   Zhao, this is business.  ZHAO  And if I refuse?  Wu-Sai Jun   smiles.   This man might take more convincing.   He rises from this seat moving toward the back wall of snakes. WU-SAI JUN  There are ten snakes in the world to which there exists no known antivenom.  re: the terrarium wall (   )  I've made a home here for each one.  Jun   slides out one particular terrarium from the wall like a drawer in a bureau.   The BLACK & BLUE STRIPED SNAKE   inside it   coils, ready to strike. WU-SAI JUN   (cont'd)  The snake handlers of Burma practice an ancient art called Mithridatism.  He opens the top of glass box",
      "dialogue_count": 0,
      "word_count": 4467
    }
  ]
}