{
  "slug": "slender-man-2018",
  "title": "slender man",
  "genre": "horror",
  "format": "film",
  "scenes_count": 10,
  "characters_count": 0,
  "characters": [],
  "total_words": 17343,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. HALLIE'S BEDROOM -- LATER 39   39 Blue and red lights reflect on the walls. Hallie watches from her window as Katie's Father is gently placed in a POLICE CAR. Another text from Wren:   No comment? U can clearly see him!  Outside, Hallie's Father is yelling at Katie's Father through the police car window. Hallie's Mother is trying to restrain her husband. Hallie starts to type:   Katie's Father was here...  But Hallie stops typing. She looks at Katie's Father distraught and crumpled over in the back seat of the cruiser. She deletes her typing. EXT. SCHOOL - LOCKER AREA -- DAY Hallie passes out flyers asking for leads on Katie’s disappearance. She comes upon Wren and Chloe with A BUNCH OF OTHER KIDS. Hallie’s expression changes to nervous when she realizes Tom is there. She avoids making eye contact. Tom is looking at Chloe’s phone. TOM (to Chloe) You didn't see anything at the park? When you were taking the video? CHLOE Just trees. The police said it’s the light. Playing tricks. TOM Probably. It doesn’t really look like anything... Tom notices Hallie and smiles. Hallie smiles back. WREN Looks like something to me... Naturally, Wren directs the conversation back to herself- Blue Rev. (06/09/16)   39.",
      "characters": [],
      "action_text": "WREN (CONT’D) I mean... There are just things that can’t be explained. TOM You guys really summoned Slender Man? CHLOE Well, sort of... I guess. (self-consciously) Why? KYLE We chickened out-- TOM (teases Kyle) YOU chickened out! The group laughs. Starts to break up. Hallie decides she can’t keep it a secret any longer. Blurts out- HALLIE Katie’s Father broke into my house last night. Everyone turns at that news. WHAT?! HALLIE (CONT’D) He said some crazy shit about Katie being into the occult. Then, he blamed us for getting her into it. Tom's intrigued. Wren and Chloe look stunned. EXT. SCHOOL - LOCKER AREA -- LATER 41   41 Hallie walks away. Wren and Chloe stalk after her. WREN Why didn't you tell us about Katie's Father? HALLIE I just did. CHLOE What did he mean about Katie being “into the occult\"? HALLIE Not sure. He was pretty wasted. Blue Rev. (06/09/16)   40. WREN (excited) Christ! She had that book in her bag! About phantoms and stuff... (beat) This could be the next wrinkle in the story... HALLIE I don't want to play this game. WREN If this is all a game, then where's Katie? That stops Hallie in her tracks. WREN (CONT’D) We know things nobody else knows. HALLIE What do we know? WREN We know that Katie was apparently taking this paranormal shit very seriously just before she disappeared. We know she watched that video. HALLIE What does that have to do with anything? WREN Maybe Slender Man came for her... Hallie scoffs. HALLIE Or,   maybe   she couldn’t take Sergeant Drunk Dad anymore and ran away-- WREN And not say goodbye? To any of us? A silent, but heavy beat. They all contemplate this for a long moment. WREN (CONT’D) When we watched that video, it did something to all of us. I felt it. Blue Rev. (06/09/16)   41. HALLIE I didn't see anything. CHLOE I didn't see anything either, Wren. WREN I didn’t say I saw it...   I felt it.  I think you did, too. I'm damn sure Katie felt it. And that's why she disappeared. Hallie makes a sound like a snort. Wren imitates",
      "dialogue_count": 0,
      "word_count": 930
    },
    {
      "scene_number": 2,
      "slugline": "INT. KATIE'S HOUSE - REAR ENTRYWAY -- DAY 46   46 The doorknob turns on the back door. A slow CREAK as it opens. Wren pokes her head in. The house is silent except for the low drone from the TV. Underneath it, we can hear Mr. Jensen snoring. Wren carefully steps inside. Hallie and Chloe slip in behind. They move quietly into a dark hallway stretching out in front of them. As they pass the kitchen we see an OPEN PANTRY DOOR. In the shadows, we can just make out a cluttered table and chairs. The filthy sink is piled high with dishes. Wren looks back at them with a “Can-you-believe-how-cool-this- is?” smile. She pauses near an entryway table. A framed picture of Katie with her dad sits on top. Happier times. They peek into the living room. POV - Mr. Jensen lies on the couch, still snoring softly. Wren turns to Hallie and Chloe, gives them the hush sign and continues. As she turns, Wren bumps the entryway table, knocking over the framed picture. CLAP!! IN THE SILENCE, IT’S LIKE A GUN SHOT. MR. JENSEN IS STARTLED AWAKE. MR. JENSEN Katie? The girls stand in silence, listening. Then as they slowly start to back away... A FLOORBOARD CREAKS UNDER THEIR FEET. Confused, Mr. Jensen turns toward the sound... THE GIRLS HEAR THE SPRINGS IN THE COUCH GROAN AS MR. JENSEN PULLS HIMSELF TO HIS FEET. He reaches for the SIDE TABLE DRAWER. Slides it open to reveal... A GUN! He grabs it. And revolver poised, cautiously heads in the direction of the noise he heard. Blue Rev. (06/09/16)   44.",
      "characters": [],
      "action_text": "The girls recoil and track back down the hallway. MR. JENSEN (O.S.) (CONT’D) Who’s there? The girls duck into the kitchen. One hiding place. The open pantry. They all try to pile in, but it’s too small. The girls argue in a frantic whisper. We hear Mr. Jensen’s heavy boots clunk on the hollow wooden floor in the front of the house. Wren leaves them and backtracks into the hallway. MR. JENSEN (O.S.) (CONT’D) (voice booming) Who’s there? Wren glances back. She sees Mr. Jensen’s shadow stretch out from the living room onto the floor in the hallway. His footsteps approaching. Ten feet seem like a hundred as Wren turns to the back door. Mr. Jensen, gun in hand, rounds the corner to the hallway. WHERE WREN WAS JUST A SPLIT SECOND BEFORE. It’s empty. She’s gone. INSIDE THE PANTRY: Chloe and Hallie hear heavy measured footsteps moving closer. They hear Mr. Jensen step into the kitchen and stop just outside the pantry door. The girls can hear the man’s heavy breaths. They’re frozen. Trapped. The girls peer through the downward slats of the door as Mr. Jensen makes his way in.  Oh shit... THEY SEE HIS GUN!!! Mr. Jensen scans the darkness in the kitchen. It’s difficult to make out much detail, but he can see it’s empty. INSIDE THE PANTRY: Chloe and Hallie hold perfectly still. Not breathing. Eyes wide. On that gun. Scared to death... MR. JENSEN FOCUSES ON THE PANTRY DOOR. Slowly... Blue Rev. (06/09/16)   45. INSIDE THE PANTRY: The girls see him raise the gun, as he steps towards them. They back up as far as they can from the door. Now only his boots are visible. THE BOOTS STOP JUST OUTSIDE THE DOOR... WHEN A CHIME SHATTERS THE SILENCE! THE DOORBELL. Mr. Jensen shudders, spinning in the direction of the front door. But his attention is quickly back on the possible intruders. The sound that woke him. What he thought he heard. Then... THE DOORBELL RINGS AGAIN! A long beat. Mr. Jensen slowly pulls the gun up and retreats. Heading to the door. INSIDE THE PANTRY: Hallie and Chloe li",
      "dialogue_count": 0,
      "word_count": 3273
    },
    {
      "scene_number": 3,
      "slugline": "INT. WREN'S BEDROOM -- NIGHT Wren sits in her room staring at something opposite her bed. There’s a nervousness in her eyes. She focuses as the nerves turn to determination. Across the room sitting on her desk, is Katie’s laptop. The little green power light blinking. Calling to her. Wren jumps from her bed. Wakes the computer. And types quickly. Before she loses the courage. - ON SCREEN: The small empty box on a black background waiting for the UNLUCKY NUMBER. She types it in. 13. -   The list of names and dates load onto the page. The same basic text, red and underlined.  Wren pauses. - We scroll through and click on a link. The same link from before. The one Katie posted. ON SCREEN: The video loads.   That huge close-up of Katie's face. Eyes wide.  Wren watches, listening to the leaves crunch under Katie’s feet as she meanders through the woods. We know what comes next... DING! -   An IM pops up in the chat box below. Simple like a programers prompt. The name AlleyKat93 next to it...  Wren hits PAUSE. Reads... -   Letters appear in succession. Forming two words... - “What’s up?” - The prompt drops down waiting. The cursor blinking.  Wren studies it for a moment.  - She quickly types: This is a friend of Katie’s. The cursor blinks. A slow rhythm on and off. -   AlleyKat93   responds: Then you’re a friend of mine.  A little smile. Wren takes that as encouragement. Blue Rev. (06/09/16)   59.",
      "characters": [],
      "action_text": "-   Types: She’s missing.  - AlleyKat93:   Of course she is.  -   Wren:   What did you tell her?  - AlleyKat93, immediately:   What she wanted to know...  Wren holds off, considering the cryptic message.  -   Wren : Which was? -   AlleyKat93 : The same thing you want to know.  Wren's mouth drops open a bit, as if she’s going to say something... WREN (PRE-LAP) I talked to her... EXT. SCHOOL - LOCKER AREA -- DAY 53   53 Fueled by caffeine and nerves, Wren tries to download Hallie and Chloe as fast as she can. HALLIE Who? WREN \"AlleyKat93.\" The girl Katie was talking to on that site. I went on there and sent her a message and she answered me! CHLOE (incredulous) You went back on that website? WREN It doesn’t matter. Once you see him, you can't unsee him... HALLIE What are you talking about? WREN Slender Man! She told me everything. He gets in your head. Like a virus. CHLOE What kind of virus? Blue Rev. (06/09/16)   60. WREN (emphatic) Like a virus on your computer. That infects your hard drive.   Only it’s your brain!  HALLIE Wren, slow down... WREN She said once the virus takes hold, he’s got you! Some he haunts. Some he drives mad. Others he takes. Like... CHLOE Like what? WREN Like Katie. Wren sees a dubious look on Hallie’s face. Redoubles her effort- WREN (CONT’D) I know it sounds crazy, but AlleyKat says we can   UNVEIL  OURSELVES . If we surrender something to him. Something that reveals our true selves... CHLOE What the does hell does that mean? Wren pauses for dramatic effect. WREN  We can contact Slender Man.  The girls study Wren as the weight of what she’s proposing sinks in. HALLIE Why the hell would we do that? WREN To get Katie back.   Hello?  She says that like it's the clincher. HALLIE (still dubious) Ask Slender Man? Blue Rev. (06/09/16)   61. WREN AlleyKat said Katie did it and the next day she was gone. HALLIE Katie asked Slender Man to take her? CHLOE No way. WREN She was always talking about running away... The girls digest. WREN (CONT’D) Look, ev",
      "dialogue_count": 0,
      "word_count": 3844
    },
    {
      "scene_number": 4,
      "slugline": "EXT. SCHOOL - LOCKER AREA -- LATER 63   63 Hallie exits one of the school buildings. She texts Chloe. No response. She continues walking, head buried in her phone until... TOM Wait up... Tom comes jogging up next to her. Hallie’s caught off guard. TOM (CONT’D) How you holding up? I mean with Katie and all... HALLIE Uh, well, you know... TOM I got an idea that might cheer you up. HALLIE You do? Hallie can’t help smile, enjoying the newfound attention. TOM It’s Friday. We got the weekend off.   So I was thinking...   We should do something? Hallie can't believe it. She tries to nod casually. Miraculously, Tom doesn’t seem to notice how excited she is. HALLIE Sure... Why not? Cool. Hallie glances away self-consciously, trying to hide the giddiness. But it quickly fades when she sees...  THE TREELINE IN THE DISTANCE.  TOM Want to hang out tonight? Hallie doesn’t even hear the question.  THERE’S SOMETHING ON THE OTHER SIDE OF THE SCHOOL’S CHAIN LINK FENCE!  Blue Rev. (06/09/16)   78.",
      "characters": [],
      "action_text": "A tall dark silhouette. Static. Quietly staring. Too far away to make out any detail. It looks like a man, but with something spreading out from its sides.  LIKE TREE BRANCHES, BUT TANGLED AND MOVING.  TOM (O.S.) (CONT’D) Hallie... This turns Hallie’s attention back to Tom. Distracted, she tries to play it off. HALLIE What? TOM You okay? HALLIE I mean, yeah. Your place? Tom considers that victory. TOM Cool. See you later in Bio. Hallie nods. Tom starts to move off to some other friends and glances back as if to wave goodbye. But Hallie’s attention has drifted again into the distance. Hallie refocuses on the treeline. The fence bordering the school. The exact same spot the man was standing just a moment before.  Nothing there now...  INT. SCHOOL LIBRARY - MAIN FLOOR -- DAY A blanket of silence surrounds us. Wren sits quietly typing at one of the library computers. - ON THE SCREEN: Search results for “paranormal research studies”. A list populates and we scroll through. Wren spots an entry and writes down a call number. PN350.22 INT. SCHOOL LIBRARY - STACKS -- DAY Books line the shelves deep in the stacks of the library. Cherry Rev. (mm/dd/yy)   79. Wren travels down an empty aisle, fingers trailing along the books. It’s so quiet we can hear her fingers drag across the spines. We can hear each footstep pad softly on the carpet. Various titles slide by. She stops at the end of the aisle and pulls one of the books. BIOELECTRIC SYSTEMS AND THE PARANORMAL. The binding groans as it opens. Hasn’t been touched in years. Concentration on her face, as she flips through the pages. A faint sound breaks the silence. CREAK-CREAK-CREAK-CREAK... Wren listens as the sound grows louder. Repeating faster. Then through the books, we see MOVEMENT ON THE OTHER SIDE. Wren watches as the movement reaches her end of the aisle. Now, only a few feet away. About to round the corner when... A LIBRARIAN’S CART COMES INTO VIEW. One last CREAK and it stops. The LIBRARIAN grabs a book and slides it ",
      "dialogue_count": 0,
      "word_count": 3461
    },
    {
      "scene_number": 5,
      "slugline": "INT. HALLIE’S BEDROOM - NIGHT 76   76 Hallie bursts in and drops her things on the bed. Half of it scatters onto the floor. She takes a deep breath trying to calm. In the bedroom mirror Hallie sees the desperation in her eyes. The fear on her face. She’s almost unrecognizable to herself. Finally she breaks. Sobbing. She turns away so she can’t see the tears and lets it all go. INT. SCHOOL - LOCKER AREA -- DAY 77   77 Hallie drifts unnoticed through a seemingly endless crowd of students. Emotionless. Completely torn down. Until she turns the corner and sees...  CHLOE!  Chloe carries books like any other student, but something’s different. Her skin so pale. Except for the make-up caked on her face. Like a corpse prepared for an open casket funeral. HALLIE  Chloe...  She passes, without acknowledging Hallie's presence. Hallie turns to go after her. HALLIE (CONT’D) Chloe! Wait! What's going on? Chloe stops. Turns to Hallie with a crazed and paranoid look on her face. HALLIE   (CONT'D) Something happened... To you. And Katie, I guess. Something's going to happen to me. And Wren, too. Isn't it? No response. HALLIE (CONT’D) Is it already happening? I've seen things? I can’t explain it... A thin smile creeps across Chloe’s face. She breaks into a strange laugh. We see the confusion on Hallie’s face as she watches Chloe drift into a crowded hallway. Blue Rev. (06/09/16)   96.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 238
    },
    {
      "scene_number": 6,
      "slugline": "INT. SCHOOL - CLASSROOM -- DAY 78   78 An EYE stares up at us from a metal tray. A COW’S EYE. Biology class. STUDENTS are lined up at different tables with cow eyes in front of them. SCALPELS AND SCISSORS in hand. Hallie sees Wren. Who looks the other way. Then sees Chloe two tables over silently staring out the window. The scalpel hanging from her hand. BIOLOGY TEACHER Hey, look who decided to show up! We see Tom duck into the room. Distracted and out of breath, like he was being chased. Hallie smiles as he comes closer. But he just slips past, taking the open stool at the end of her table. Wren scowls... BIOLOGY TEACHER (CONT’D) All right, first, take a moment to observe the external anatomy... Hallie leans back to draw Tom’s attention. He still seems to not acknowledge she's there. She whispers- HALLIE Hey. He doesn't respond. Hallie faces forward as the teacher walks by. BIOLOGY TEACHER The cornea looks cloudy and bluish because of the preservation process... Hallie looks at the cloudy, bluish eye then back to Tom. BIOLOGY TEACHER (CONT’D) Now slice as evenly as you can through the sclera to separate the anterior features of the eye... Around Hallie, students are cutting now. Including Chloe. She speaks louder this time- HALLIE Tom! He looks. Seems to notice her for the first time. Blue Rev. (06/09/16)   97.",
      "characters": [],
      "action_text": "HALLIE (CONT’D) Are you okay? It takes him half a beat but he smiles. TOM Yeah, I’m fine. Hallie nods but can see Tom’s smile is short-lived. He looks harried. Hallie’s about to say something else to him but is interrupted by a... LOUD GASP! Hallie turns to see kids backing away from one of the tables. Chloe’s table. We see confusion on Hallie’s face. Chloe just stands there, alone at the table. Oblivious to the other kids backing away. The commotion spreads like a wave through the classroom. Then Hallie sees...  Chloe cutting herself! Drawing the point of her scalpel across her palm as if testing its sharpness! Blood pours onto the table. And then... CHLOE HOLDS THE SCALPEL UP TO HER EYE! We hear chairs scooting. Kids jumping to their feet. Hallie’s eyes widen, frozen in the moment. Chloe studies the blade for a long beat, a sinister smile on her face. And then... SHE STABS!!  As we cut away there are   SCREAMS!!!  Hallie and Wren just stands there. Watching. Paralyzed with terror as   the Teacher grabs for Chloe. Desperately trying to pry the scalpel out of her hands... STUDENT #1 OH MY GOD! We watch as the class erupts into chaos! Students rushing out of the room screaming. STUDENT #2 HER EYES!! Blue Rev. (06/09/16)   98.",
      "dialogue_count": 0,
      "word_count": 454
    },
    {
      "scene_number": 7,
      "slugline": "EXT. SCHOOL - PARKING LOT -- DAY 79   79 PARAMEDICS wheel Chloe to an ambulance. With tears streaming down, Hallie and Wren watch Chloe disappear behind the ambulance doors. For a moment, Tom stands behind them. We see the fear on his face. Then he slowly slips away behind the gathering crowd. Wren and Hallie lock eyes. The nightmare is only getting worse... WREN I told you... (crying hysterically)  I told you and you wouldn’t believe me.  Hallie just stands there, shaking. Tears pour from her eyes as the ambulance’s lights and siren slowly fade away. INT. HALLIE'S HOUSE - HALLWAY -- EVENING 80   80 Hallie races upstairs. Her Mother in hot pursuit. HALLIE'S MOTHER Hallie, are you all right? HALLIE Yeah, Mom. HALLIE'S MOTHER Lizzie told us about Chloe... Hallie stops. HALLIE'S MOTHER (CONT'D) I can't believe it. You were there? Did you see her do it? Hallie can’t speak. She can’t find the words. HALLIE'S MOTHER (CONT’D) Oh my God. That poor girl. Hallie’s mother doesn’t know the half of it. HALLIE I need to lie down... She trails off. Her Mother nods. Blue Rev. (06/09/16)   99.",
      "characters": [],
      "action_text": "HALLIE'S MOTHER Of course. I’m so sorry. She gives Hallie a hug. Senses something... HALLIE’S MOTHER Are you okay? Hallie nods. HALLIE’S MOTHER (CONT’D) Because your sister’s taking it very hard. I’m worried about her. She hasn’t come out of her room since she got home... HALLIE I’m just tired. HALLIE’S MOTHER Can I get you anything? Hallie shakes her head and keeps going. INT. HALLIE’S BEDROOM -- LATER 81   81 Hallie’s computer sits in her lap. That ominous Slender Man website up on the screen. She types a message in the chat window. TO ALLEYKAT93: “ You have to help us!”  The cursor blinks. No response. She tries again: “ How do you make him go away?”   She presses send. Adds:   \"PLEASE!!! \" But gets an automatic response:   “USER ACCOUNT DISCONTINUED.”  On Hallie. We see hope fade and the fear return... LATER 82   82 Hallie lies in bed. Eyes fixed on a framed photo that sits on her bedside table:   Herself, Wren, Katie and Chloe in a goofy selfie from happier times.  She looks at the picture as if it were a distant memory. Then...  SPORADIC SOBS OUT IN THE HALL. HER PARENTS WHISPERING.  Blue Rev. (06/09/16)   100. Hallie sits up- HALLIE'S FATHER (O.S.) Come on. Just breathe, Lizzie. INT. HALLIE’S HOUSE - HALLWAY/BATHROOM -- CONTINUOUS 83   83 Hallie moves through the dark hallway, towards a light in the bathroom. We hear Lizzie crying. Her parents urgent voices. Hallie’s almost running now. She reaches the half-open door and sees her Father tending to Lizzie. Lizzie’s struggling to breathe. Hallie's Mother stands by feeling helpless. HALLIE What's going on? HALLIE'S   MOTHER She can’t breathe. We have to get her to the emergency room. Lizzie gulps for air. HALLIE Lizzie? Oh my God... Lizzie looks up with swollen red eyes. Tears streak down the pale skin on her face. Her hands tremble. HALLIE’S FATHER The ambulance is on its way... Hallie's Father starts bundling Lizzie in a towel. Hallie watches helplessly as he carries Lizzie past her. HALLIE’S MOTHER It’s okay,",
      "dialogue_count": 0,
      "word_count": 1608
    },
    {
      "scene_number": 8,
      "slugline": "INT. CLASSROOM -- CONTINUOUS 97   97 Wren and her classmates just stand there, shocked and confused. Staring out the windows. Hallie charges past. Rushes out of the room. EXT. SCHOOL - BELL TOWER -- CONTINUOUS 98   98 A crowd of STUDENTS, TEACHERS, and SECURITY have gathered below the tower. Looking up at Tom. Calling 911. Begging him to come down. Begging him not to jump... Hallie comes running. HALLIE (yells up to him) TOM!!! Tom spots Hallie fighting her way through the crowd. HALLIE (CONT’D) Tom... WHAT ARE YOU DOING?! TOM (yells down) YOU WERE RIGHT, HALLIE! The crowd’s attention quickly shifts to Hallie. Collectively waiting for an answer.   Right about what?  HALLIE TOM! COME DOWN! RIGHT NOW!! And that’s when Tom makes it clear... TOM BUT I SEE HIM! EVERYWHERE!!  Shit!   He watched the video... We hear SIRENS. EMERGENCY RESPONDERS on the way. TOM’S POV:   In the distance, at the edge of the woods stands a blurred figure. Tall and slender. Arms outstretched like the branches of a tree. Beckoning...  HALLIE (O.S.) IT’S OKAY! COME DOWN! TOM, PLEASE! STOP THIS!!! BACK ON TOM: A realization appears on his face. An unnatural look of joy... Blue Rev. (06/09/16)   107.",
      "characters": [],
      "action_text": "TOM I’M GOING TO!!  HE STEPS OVER THE EDGE AND FREE FALLS! FRIGHTENED VOICES CRY OUT FROM THE CROWD! AS TOM’S BODY CRASHES TO THE GROUND!!!  AND HALLIE SCREAMS!!   A study in shock and terror. Tears streaming down her face. Frozen in this nightmare... INT. HOSPITAL HALLWAY -- DAY Hallie wanders aimlessly like a lost child. Walking down a hallway that feels like it stretches out forever. A round of laughter draws her attention to one of the rooms. Inside the room, a family jokes around, cheering up a little girl in a hospital bed. All smiles as a nurse prepares the tiny patient for release. But the smiles bring sadness to Hallie’s eyes. She starts to cry, the weight of everything crumbling around her. We can see the pain in Hallie’s eyes as we follow her around the corner. Then we hear SHRIEKS from down the hallway. Hallie sees nurses hurrying towards a hospital room. RUSHING INTO LIZZIE’S ROOM! Hallie moves quicker now. Almost running as she reaches the door. Inside the room... IT IS LIZZIE SHRIEKING. OUT OF CONTROL. Hallie’s Mother and Father look up as Hallie steps into the room. We see the panic in their eyes. The tears. INT. LIZZIE’S HOSPITAL ROOM -- CONTINUOUS A DOCTOR stands over Lizzie reading her vital signs. He barks orders at the NURSES who respond immediately. Efficient like a machine. Working in unison. NURSE BP, 80 over 40. Blue Rev. (06/09/16)   108. DOCTOR Let’s get her moving. The railing slides up on the sides of Lizzie’s bed. The wheels release. An IV is attached to a hanger. And suddenly, Lizzie is being wheeled towards the door. HALLIE Where are they taking her? She rushes over, grabbing Lizzie’s bed. Hallie’s Father stops her, letting the nurses pass. HALLIE’S FATHER Hallie, they’ve got to get her to the ICU... MORE SCREAMS from Lizzie. Her face paler than before. HALLIE Lizzie! Hallie pulls away from her father and grabs Lizzie’s hand. Lizzie sees Hallie. LIZZIE (hisses) He didn’t have a face! TERROR WASHES OVER HALLIE WHEN SHE HEARS THE WORDS.",
      "dialogue_count": 0,
      "word_count": 632
    },
    {
      "scene_number": 9,
      "slugline": "EXT. HALLIE’S HOUSE - LIZZIE’S BEDROOM -- NIGHT 99   99 Hallie charges through the door, searching. LIZZIE’S LAPTOP SITS ON THE DESK IN THE CORNER. Hallie rushes over and taps on the keyboard. The screen   * lights up and we see...   * T HAT OMINOUS RED-ON-BLACK WEBSITE!   * A wave of dread washes over her as the realization sinks in.   * - ON THE SCREEN:   We see Lizzie’s conversations with other   *  users. As we scroll through,   a name catches Hallie’s eye ...   * “WREN”   * HALLIE OPENS THE THREAD.   * IN THE FEED: Questions from Lizzie. Answers from Wren. Who is   * Slender Man? What does he do? How does he find you?   * Hallie scrolls down to the last entry...   * THERE’S A VIDEO LINK!! Hallie clicks and it loads...   * - IN THE VIDEO:   The camera moves through the trees.   W e hear a   *  SWEET LAUGH   from behind the camera . Barely audible. Then a   *  girl appears, walking away from us. We follow her into a   *  clearing. She stops and faces the camera.   * Hallie freezes, horrified when she realizes...IT’S LIZZIE!!   * -   We hear Lizzie giggle.   * THEN HALLIE SEES IT!!   *  - SOMEONE HANDS THE CAMERA TO LIZZIE. WE CAN NOW SEE   *  PERFECTLY. BUT LIZZIE DOESN’T FOCUS IT ON HERSELF...   *  - IT’S WREN!! STANDING THERE!! IN THE WOODS WITH LIZZIE!!!   *  LIZZIE (O.C.)   *  Now what do I do?   * -   Wren looks into the camera.   *  WREN   *  Just sacrifice something you love.   * -   The video ends.   * Hallie stares at the dead black screen. Horror on her face.   * Tan Rev. (mm/dd/yy)   110.",
      "characters": [],
      "action_text": "WREN (O.S.) (CONT’D)   * I’m sorry...   * Hallie jumps, the unexpected voice spinning her around.   * Wren stands in the doorway, afraid to enter the room. Tears   * stream down from the dark circles under her eyes.   * HALLIE   * How could you do that?   * WREN   * It was before I knew what would   * happen...   * Wren’s voice breaks, the tears fight against the words.   * HALLIE’S HORROR QUICKLY TURNS TO ANGER.   * HALLIE   * Wren, she’s in the hospital!!   * WREN   * I didn’t know, I swear. But I   * think I found a way-   * Hallie steps to Wren. Full of rage. About to hit her...   * WREN (CONT’D)   * (yells)   * I came over here because I found   * something that might stop this!!   * Hallie stops herself. Just barely.   * WREN (CONT’D)   * See for yourself!   * Wren scrambles to the computer. Hallie just stares at her,   * unconvinced. Suspicious.   * WREN (CONT’D)   * I went through my conversations   * with AlleyKat...   * Wren scrolls to AlleyKat’s last entry. Just random numbers.   * ON THE SCREEN:   “32.903852, -79.988029”   * WREN (CONT’D)   * And then look...   * She clicks on another feed. And another. And another. Hallie   * watches Wren frantically navigate the site.   * Tan Rev. (mm/dd/yy)   111. HALLIE   * You’ve lost your mind.   * WREN   * No!! It’s these numbers...   * ON THE SCREEN:   We click through a series of conversations.   *  People asking for help. “How do you stop Slender Man!!?” And   *  the last entry of each feed...   “32.903852, -79.988029”   * The anger slowly melts away as Hallie sees each new feed.   * WREN (CONT’D)   * Then I saw this.   * ON THE SCREEN: Wren opens a feed from Katie to AlleyKat.   * Desperately, pleading for help. And AlleyKat’s final entry...   *  “32.903852, -79.988029”   * Wren looks back at Hallie.   * WREN (CONT’D)   * So I searched it...   * ON THE SCREEN:   Wren searches the random set of numbers in a   *  web browser. A MAP POPS UP!! A spot in the middle of nowhere.   * WREN (CONT’D)   * They aren’t rand",
      "dialogue_count": 0,
      "word_count": 2705
    },
    {
      "scene_number": 10,
      "slugline": "INT. LIZZIE'S BEDROOM - MONTHS LATER -- NIGHT Lizzie sits at her computer. Designing a MISSING FLYER with HALLIE’S PICTURE on it. We can see Lizzie has recovered from her mental episode. But she’s definitely worse for wear. And then... HALLIE (O.S.) Lizzie... Lizzie listens, not sure what she heard. She gets up and crosses to her door. Opens it. Peers out. Nobody there...  But, just as Lizzie goes to close her door...  HALLIE (O.S.) (CONT’D) Lizzie... Lizzie turns. Exits her room to investigate... LIZZIE Hallie? INT. HALLIE’S HOUSE - HALLWAY -- CONTINUOUS 111   111 Lizzie moves down the hall. Still nobody there. HALLIE (O.S.) Lizzie... She sees the back door open. Heads that way... EXT. HALLIE’S HOUSE -- NIGHT 112   112 Lizzie enters the backyard. Looks around. LIZZIE Hallie? But nobody is there. Only the forest behind the house. A tear rolls down Lizzie’s cheek as she searches the endless trees. No Hallie. Just tangled branches. We can’t tell where one ends and another begins... And then we hear something. Unmistakable... A BELL ECHOES IN THE FOREST. Blue Rev. (06/09/16)   121.",
      "characters": [],
      "action_text": "And off Lizzie’s SCREAM we... SMASH CUT TO BLACK. THE END. Blue Rev. (06/09/16)   122.",
      "dialogue_count": 0,
      "word_count": 198
    }
  ]
}