{
  "slug": "smilf-101-a-box-of-dunkies-and-two-squirts-of-maple-syrup-2017",
  "title": "smilf 101 a box of dunkies and two squirts of maple syrup",
  "genre": "romance",
  "format": "series",
  "scenes_count": 4,
  "characters_count": 0,
  "characters": [],
  "total_words": 6504,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. BASKETBALL COURTS - RINGER PARK - ALLSTON MA - DAY 1   1  Finished playing, BRIDGETTE BIRD, 28, walks towards the water fountain, bending over for a drink. The muscley point guard, BEN, walks up behind her, checks her out. She feels his presence and looks back. DAMN. He’s muscley. BRIDGE Sorry, you can go. BEN Please. I saw you hustlin’ out there. Got that scrappy game... and that sexy tattoo... She can’t help but laugh to herself. She bites her lip. BRIDGE Which one? Tramp stamp? She pulls her shorts down a bit, revealing a lower-back tattoo. She turns back around and lifts her shirt up. BRIDGE (CONT’D) Or the b-ball? BEN The basketball. Both are nice. She clocks his sweet smile, big meaty hands, his tight abs. BRIDGE Why thank you. You got great... ball handling skills. BEN I’m pretty good with my hands. They lock eyes. BRIDGE Lemme see. (holding up her hands to his) Whoa. Your hands are giant. He’s laughing. She’s laughing. Definite chemistry. BEN What are you doing now? Up for a  little game of one on one?",
      "characters": [],
      "action_text": "BRIDGE Oh, that’s my specialty. I got this new behind the back, crossover-- LARRY (O.S.) -- Mama! Oh no. Bridge stares at the Point Guard. BRIDGE -- spin move. LARRY MAMAAAA!!!! Bridge takes a big disappointed breath. BRIDGE One sec. She books it to the stroller under the shade of an elm as the Point Guard follows, looking confused. Bridge picks up LARRY, 2, who is just waking up. BRIDGE (CONT’D) Did you just wake up, little lover? BEN This is   your   kid? BRIDGE Yes, that is a true statement. Bridge sees the lights go out in Ben’s eyes, despite his gallant effort to overcompensate. BEN I love kids!! I got a niece. She’s cool. (then) I should get going. See ya on the court, Scrappy. He leaves. She stands there dejected but not surprised. BRIDGE Bye Hot Big Muscle Maaaan. ARCHIE (PRE-LAP) “Now, Henry reads all the time, although every now and then...”  1st Revised Preproduction Draft (09/20/2016)   2.",
      "dialogue_count": 0,
      "word_count": 345
    },
    {
      "scene_number": 2,
      "slugline": "INT. BRIDGETTE’S STUDIO APT - ALLSTON - EVENING 2   2  ARCHIE, 30 (puppy-dog charm masking some deep-seated pain) takes a fake bite out of Larry. Bridge lies on the other side of him. ARCHIE Yum. Yum. Yum. Archie closes the book, “ Henry, the Book Eating Boy .” ARCHIE (CONT’D) Good night little munch. Sweet dreams. I love you. He gets up and we get a glimpse of the chaos in her one room home: toys, clothes, wrappers everywhere. LARRY Milkies? BRIDGE Ok, sure, just a little. Bridge lifts up her shirt and takes her boob out of her bra. Archie turns to her. ARCHIE Bridge! What are you doing?!   I thought we agreed on this?! BRIDGE Yeah but... ARCHIE Put the boob away and put your hands up where I can see them. BRIDGE Ok. Jeez. Milkies Nazi. (to Larry, softly) I know you want the boob because it helps you sleep and also because it’s a fun time, but your dumb Dad thinks it’ll turn you into a weirdo if we nurse past two. Larry is almost asleep. Bridge rubs his head, her breast still hanging out as she talks. BRIDGE (CONT’D) (whispering) Why are men so weird about dating moms?  1st Revised Preproduction Draft (09/20/2016)   3.  (MORE)",
      "characters": [],
      "action_text": "Do they think we’re not going to give them enough attention? Or are we like tainted, like somehow this means we weren’t good enough to commit to? Archie starts changing Larry’s diaper. ARCHIE Dunno Bridge. (to Larry) We put a night-night diaper on this baby. He takes off Bridgette’s jeans. She lets him. ARCHIE (CONT’D) (to Bridge, playful) And then we put a night-night diaper on   this   baby. BRIDGE Or is it evolution? The vagina has done its job, and subconsciously is no longer of use anymore. He smells her pants. ARCHIE The vagina is definitely of use. BRIDGE Shut up. He dresses her in her sweats and puts a Breathe Rite strip on her nose. This is obviously a ritual for them. ARCHIE The park dude is a dumbass. BRIDGE Why you so sweet to me? ARCHIE Cuz you my baby’s mama! They cuddle Larry, flanking him on either side. ARCHIE (CONT’D) You know, it’s not always going to be like this. Archie kisses Larry’s head.  1st Revised Preproduction Draft (09/20/2016)   4.  BRIDGE (CONT’D) BRIDGE Yeah. I know. Aren’t you so curious to know what he’s going to be like? Like as a teenager? ARCHIE He’s gonna be a P.I.M.P. BRIDGE Ok. So you want your son to be the profiteer of modern day slavery? ARCHIE You know what I mean. Lil pimp! BRIDGE I gotta sleep. The kid is going to wake up in like four hours. He tucks her in and realizes they’re sleeping on towels. ARCHIE You need to start using sheets. BRIDGE He’s just gonna pee through his diaper anyway! ARCHIE Night, Boss. Good luck at the audition tomorrow. BRIDGE (disappointed) It’s a PSA. For veterans. Maybe I should skip it? ARCHIE Hey. You miss a hundred percent of the shots you don’t take. BRIDGE I mean... a lot of directors   did  get their start doing commercials. Do you have any army fatigues I can borrow? ARCHIE There’s the fighting Irish spirit! BRIDGE And I’ll need the car, the thing is like in Milton or something.  1st Revised Preproduction Draft (09/20/2016)   5. ARCHIE Ugh. Really, Bridge? BRIDGE Yeah. I need the car. AR",
      "dialogue_count": 0,
      "word_count": 731
    },
    {
      "scene_number": 3,
      "slugline": "INT. BRIDGETTE’S LIVING ROOM AREA - MORNING  Bright morning sun fills the tiny studio apartment. Larry sits on the carpet playing with an old WOODEN TRAIN. Bridge bends over trying to look at her vagina with a small compact mirror. BRIDGE Oh goodness. Larry walks up to her and copies her, bending over. They are both wearing Bridgette’s T-shirts and nothing else. LARRY Oh goodness. TUTU (50, personality disorder(s), former Miss South Boston, loves a dirty joke) walks in without knocking. BRIDGE Can your vagina get... longer? TUTU Yes. The lips. (to Larry) Hi Larry. BRIDGE Pee comes out when I do tuck jumps. TUTU When do you do tuck jumps? I need to do more cardio. BRIDGE I think my vagina stayed big because I didn’t have sex right away and it atrophied. TUTU Well, you   can   shrink it back, Bridge. BRIDGE Surgery is so expensive. TUTU No, you talk to it. The body has it’s own intelligence. I’m serious Bridge. You have to talk to it. Bridge dismisses her.  1st Revised Preproduction Draft (09/20/2016)   7.",
      "characters": [],
      "action_text": "BRIDGE Yoga doesn’t fix everything. I should go see a doctor. TUTU You’ve always had a strong mind. You could close it right up. It’s the mind body connection. They’re linked Bridgette, more than me and you will ever understand. Bridge ignores her. TUTU (CONT’D) Do it with me. Take a deep breath. Think about your vagina. Come on. Really think about the muscles down there: tighten, tighten, tighten up. BRIDGE Mom, don’t act crazy around Larry. TUTU (biting) Don’t you fucking call me crazy. (injured) I’m trying to help you. BRIDGE Sorry. I didn’t... Bridge stops what she’s doing and reluctantly closes her eyes. BRIDGE (CONT’D) (whispering) Tighten. Tighten. TUTU You gotta focus. BRIDGE I am! RING RING. Someone is calling Tutu on Facetime. She picks up. ALAN (V.O.) Hello my bunny. How are you today? Bridge opens her eyes and exhales audibly. TUTU I’m at Bridgette’s.  1st Revised Preproduction Draft (09/20/2016)   8. ALAN Did you ask if Archie’s girlfriend can get us Sox tickets for when I’m back in town? Bridge stops. BRIDGE What does he mean Archie’s girlfriend? TUTU I’ll call you back. Tutu closes the computer and passes Bridge her phone. It’s an Instagram photo of Archie embracing a BEAUTIFUL WOMAN with the caption:   Is this   what true love looks like? Pinch me. No don’t. #Blessed.  BRIDGE Little dick didn’t tell me. TUTU I figured you knew. BRIDGE He’s probably embarrassed. She’s such a cheeseball. Hashtag blessed. TUTU She’s very pretty! (beat) You’re prettier. (re: vagina) You want me to look at it? I’m a healer. I really am a healer. Bridge thinks about this for a second. BRIDGE No, I can’t show you my vagina.  INT. BOSTON GREEN LINE - A BIT LATER 4   4  Bridge, Tutu and Larry sit on the Green line. Bridge is on her phone. BRIDGE She was named after Nelson Mandela! TUTU You know we saw him once in concert. He was very good.  1st Revised Preproduction Draft (09/20/2016)   9. BRIDGE That is so RIDICULOUS. Yeah, name your beautiful, blonde, blue-eyed daughter aft",
      "dialogue_count": 0,
      "word_count": 3316
    },
    {
      "scene_number": 4,
      "slugline": "INT/EXT. BRIDGETTE’S APT/FANCY RESTAURANT - CONTINUOUS 17   17  Archie, outside of a restaurant, Facetimes Bridge. BRIDGE Are you coming over? ARCHIE You can’t text me ‘Larry 911’ if it’s not ‘Larry 911.’ BRIDGE You missed bedtime. You haven’t missed bedtime since rehab. Are you OK? Archie takes a breath. ARCHIE I’m really sorry B. This is all really hard for me to navigate. I just, I can’t be your errand boy all the time. BRIDGE (real disappointed) You’re not my errand boy. We have a kid together. Ok, forget it. NELSON ROSE (O.S.) Whatcha doing? NELSON ROSE, 26, super “hot” approaches with a beer in her hand. NELSON ROSE (CONT’D) (excited) Is that... is that Bridgette? ARCHIE Uh. NELSON ROSE Can I talk? Archie reluctantly gives the phone to Nelson. ARCHIE I have to pee. He walks back inside.  1st Revised Preproduction Draft (09/20/2016)   24.",
      "characters": [],
      "action_text": "NELSON ROSE Hi! I can’t believe it’s you! Archie talks about you all the time. BRIDGE Uh, yeah, you too! NELSON ROSE You’re so much softer in real life than you are in photos! BRIDGE I have resting bitch face. NELSON ROSE I literally have THE WORST resting bitch face! BRIDGE I find that hard to-- NELSON ROSE See? She does it, and it’s true .   Although Nelson is insanely bubbly and beautiful, there’s a certainty behind her eyes. A kind of confidence that says: don’t fuck with me. BRIDGE Whoa. (THEN) I actually feel like the term resting bitch face is kind of unfair. Like is there a resting dick face? NELSON ROSE I have to be so careful not to look like a bitch because of my job. Oh you work in front of the camera too, right? I have a feeling we have a lot in common. BRIDGE Well...So nice to meet you Nelson Rose! Really big fan. NELSON ROSE Oh, just call me Nelson. Or Nelly. BRIDGE Were you really named after Nelson Mandela?  1st Revised Preproduction Draft (09/20/2016)   25. NELSON ROSE Oh yeah, big shoes to fill. But I try. It does remind me to give back as much as I can. And to stay humble! (then) I can’t believe Archie has kept me from you. BRIDGE I can. Archie does everything in his power to avoid anything complicated. NELSON ROSE But then he makes it more complicated! BRIDGE Seriously! The two women find themselves bonding over their mutual frustration. NELSON ROSE We are really going to have to work on that. BRIDGE Good luck. NELSON ROSE Oh, I believe in him. He has so much potential, just needs a little reminder that he’s a king. Poor guy. BRIDGE Totally, I mean he’s my best-- NELSON ROSE (earnest, truly in-love) He’s the sweetest man I’ve ever met. He literally just follows me around like a cute little puppy. (then) Just like your son!! Oh Bridgette. He is so special. You must be a great mom. Thank you for sharing him. I know it’s hard. This takes Bridgette’s breath away.  1st Revised Preproduction Draft (09/20/2016)   26. BRIDGE Oh... uh... you... Nelson no",
      "dialogue_count": 0,
      "word_count": 2112
    }
  ]
}