{
  "slug": "snowpiercer-101-first-the-weather-changed-2020",
  "title": "snowpiercer 101 first the weather changed",
  "genre": "thriller",
  "format": "series",
  "scenes_count": 14,
  "characters_count": 1,
  "characters": [
    "CLEO"
  ],
  "total_words": 14405,
  "total_dialogue": 1,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. THE GREENHOUSE CAR - LATER LJ enters, now wearing gear (all Amber-Orange) suited to heavy garden work. This car is the most beautiful space we’ve seen so far. Light glows in from a large glass ceiling high above. And everywhere you look, plants. Gardens.   Life.  A number of others already work. LJ approaches an older woman, MRS. WRIGHT (60s). Mrs. Wright is no-nonsense. She adjusts a drip-water hose over a tomato plant. LJ Good morning, Mrs. Wright. MRS. WRIGHT LJ. Could you start hauling some of the big bags of shit from the stores? The aft planters need help. LJ Yes Ma’am. LJ ties her hair up and pulls some work gloves on... INT. A SMALL CHANGING ROOM - SAME Lilah stands in front of a mirror, facing herself down. She applies eyeliner, a steady hand on the rocking train. Stares herself down again. And now lipstick. Perfect. A knock on the changing room door. A harsh whisper: VOICE Lilah. What’s taking you? She’s here. LILAH Shit. Lilah smooths her hair and grabs A SMOCK from the wall. INT. NAIL SALON CAR - SAME Lilah enters her train car: a HIGH-END NAIL SALON. We could be in Paris or Beverly Hills. And like in those cities and those salons, there are two types of people here. Those getting their nails done, and those doing the doing. The clients wear SKY BLUE smocks over their nice clothes while the nail laborers wear BLACK.  8.",
      "characters": [],
      "action_text": "The salon’s already full, buzzing with manicures and pedicures. There’s only one station with an empty chair and it’s Lilah’s. Her client, MELANIE CAVILL, (mid 40s) waits. Melanie puts the   class   in upper class. Come to think of it, she probably puts the   upper   there, too. Lilah slides into her chair opposite Melanie. LILAH I am so sorry, Ms. Cavill. MELANIE It’s all right. I was early. ( Note: Melanie is THE VOICE OF THE TRAIN ANNOUNCEMENTS.)  Lilah picks up Melanie’s hands. Her nails are in bad shape, the polish mostly chipped off. MELANIE (CONT’D) Worse than my usual? LILAH No, just as bad as your usual. MELANIE You know I fight other women for fruit. LILAH Last time you said it was for the good Bordeaux. MELANIE My father used to say that wine was just grapes looking to get fucked. (off Lilah’s look) He was usually drunk when he said it. As he was when he’d slap me for chewing my nail polish off. She wags her messed up nails at Lilah. MELANIE (CONT’D) But he’s not on the train, is he? Upon hearing the word “train”, a salon employee within earshot of Lilah quietly makes a “ W”   sign across her chest like a Catholic would cross themselves...Lilah doesn’t make the sign. Melanie notes it. After a beat: MELANIE (CONT’D) (re signing the “W”) You don’t...?  9. LILAH (shakes head no; quiet) It’s not that I’m not grateful for everything Mr. Wilford’s done. (re train) For making all this. It is a miracle. MELANIE (making the W sign) Just not a   real   miracle. Lilah shrugs, uneasy to talk about this among her coworkers. MELANIE (CONT’D) I think it helps people to believe. LILAH It’s a comfort I guess. MELANIE No. I’m saying...I think...it   helps  people. To believe .  Lilah stares at Melanie, trying to get her meaning. Suddenly Melanie bursts into laughter. MELANIE (CONT’D) Don’t listen to me, Lilah. I just read what they give me. (doing the voice)  Wilford Industries and Transport wishes you well.  (leans in) I’m a monkey. I do it for the fruit. Lilah doesn’t kn",
      "dialogue_count": 0,
      "word_count": 1164
    },
    {
      "scene_number": 2,
      "slugline": "INT. THE BRAKEMEN’S CAR - UPPER DECK - SAME Lined with bunks, we find a number of Brakemen napping before or after shift. Here we meet BRAKEMAN BESS TILL, 30ish, sleeping on a bunk. Sitting on a bunk across from her is BRAKEMAN JOHN OSWEILER 30s, her partner. He’s leaning over her. OSWEILER Till. Till.   Bess.  She won’t open her eyes. TILL No bell, Oz. OSWEILER Doesn’t matter. We gotta get downtrain. We gotta thing. He playfully taps her on the nose with his truncheon. TILL What thing. OSWEILER Remember that girl from The Nightcar? Pixi Aariak. They’re pulling her out. (beat)  We’re   pulling her out. Till sits up, pushing his truncheon away. Her eyes open now. TILL Pixi Aariak. I haven’t thought about her for a long time. OSWEILER Nobody has. Put your fucking boots on.  THE SAME BELL TONE AS WE’VE HEARD EARLIER (PRE=LAP).  EXT. THE TRAIN - SAME The front of the train barrels fast past us, slaloming through a twisty cliffside section of the train track. To the one side, steep frozen mountains, to the other side, abyss.  13.",
      "characters": [],
      "action_text": "WOMAN’S VOICE (V.O.)  Good morning Passengers. Wilford Industries and Transport wishes you well. Enjoy your day.  INT. THE TRAIN - PASSAGEWAY - SAME Till and Osweiler stride down a passageway. To their right: A CURTAINED SERIES OF PRIVATE SLEEPING CARS. To their left: windows looking down onto the dizzying abyss. INT. THE SUB-TRAIN TRANSPO SYSTEM - LATER The two officers step down off a ladder and into a waiting transpo car. Off it goes... INT. TRAIN - PRISON CAR - LATER  The movie’s a good reference.   Industrial metal, lined on both sides with LARGE LOCKED DRAWERS (like a morgue). High above the drawers are SMALL CELLS, accessible by a librarian’s ladder. We see TWO DRUNK PARTY KIDS IN TORN AND BLOODY FUR COATS sleeping off a brawl in non-adjoining cells. The door cycles open and Till and Osweiler enter. Waiting to greet them are THREE MEN: MAGISTRATE MAKI, PRISON WARDEN POPE, and DOCTOR ALFREDSSON. MAGISTRATE MAKI Brakemen. CUT TO: A KEY INSERTED INTO A LOCK. TURN. CLICK. Widen out as Till and Osweiler watch the “parole” process. The Warden PULLS OPEN THE DRAWER TO REVEAL PIXI AARIAK, LATE TEENS, THIN. She appears asleep. Around one of her forearms is a METAL CUFF. A FLEXIBLE METAL TUBE, like a STEEL IV, snakes from the cuff into the darkness of the Drawers. DOCTOR ALFREDSSON We’ve been tapering the Twilight Suspension for the last two days. Hopefully it’ll make her transition to wakefulness easier. The Warden uses a smaller key to unlock the cuff from her arm. He removes it.   Her arm is black from elbow to fingertip.  14. DOCTOR ALFREDSSON (CONT’D) That’s from the Suspension. TILL I’ve never seen it do that before. WARDEN POPE Three years is the longest sentence we’ve served in the Drawers. DOCTOR ALFREDSSON I suspect we’ll learn a lot regarding the long-term effects-- A HORRIBLE, GUTTURAL CRY FROM THE DRAWER As Pixi Aariak awakens from three years of...well, who knows what the hell it’s been. The girl screams again and begins thrashing her way out of the drawe",
      "dialogue_count": 0,
      "word_count": 983
    },
    {
      "scene_number": 3,
      "slugline": "INT. THE NIGHTCAR - WAITING ROOM - LATER A sleeping car furnished in very neutral Mid-Century Office. A MAN (20s) sits at a desk, typing up a report on a RED IBM SELECTRIC. He hears a buzzing and presses a button. CLICK. The door opens. Pixi and her Brakemen escorts enter. MAN Welcome to the Nightcar. (re Pixi) Or...welcome back. (re the couch) Miss Audrey will be right out. Our threesome sits down, Pixi flanked. Still treating her like a prisoner or a patient. Osweiler picks up a LARGE BOUND BOOK from a side table. Begins skimming through it, curious. Inside the book we get glances of words like   “Scenarios”   and  “Dramatic Personae”.   Some pages are beautiful hand-painted plates of rooms dressed from various time periods... TILL (re book) Have you? He looks up to see both women watching him. OSWEILER No. TILL Not even curious? OSWEILER Not really. TILL Because you look curious. He slowly closes the book. TILL (CONT’D) Five times. OSWEILER You? TILL Five. All different. I loved it. Before he can drill down on this, A DOOR opens and MISS AUDREY glides in. She’s ageless but probably sixty.  17.",
      "characters": [],
      "action_text": "MISS AUDREY  Pix.  She approaches them as they stand. Holds out her arms. MISS AUDREY (CONT’D)  With your permission.  Pixi reaches for her and the woman envelops her. MISS AUDREY (CONT’D) We missed you. She takes Pixi by the wrists. Holds up the black hand, caresses it with her thumb. OSWEILER It’s from the Suspension. MISS AUDREY I know what it’s from. (to Pixi) We have all your clothes. And your old bed. If you choose to stay. (taking her in) Oh baby. I am so sorry. Osweiler catches eyes with Till. Time for them to go. They turn to Pixi. A little awkward. TILL Good luck. Till holds out her hand. Formal. Pixi reaches out her black hand. Shakes, maybe holds it a beat longer. Osweiler gives a curt nod, turns to go. Pixi looks to him: PIXI (in the hoarsest whisper) Mr. Osweiler. He stops. She’s speaking? And to him? PIXI (CONT'D)  Everybody loves it.  Off his shock-- INT. THE TRAIN - A CORRIDOR PASSAGEWAY - SECONDS LATER The two Brakemen walk away from the Nightcar, Till barely able to restrain a shit eating grin.  18. TILL All I’m saying is-- OSWEILER Shut up. TILL All I’m saying... OSWEILER Till. TILL All I’m saying is...there must be something about you Oz that would inspire a girl, who hasn’t talked in three years, to make her first words   fuck you.  He shakes his head. Good natured enough to take her shit. But then Till gets a serious look on her face. TILL (CONT’D) What a shit show. SUDDENLY A KLAXON RINGS OUT. A VOICE COMES OVER A SPEAKER: WOMAN’S VOICE (V.O.)  BRACE FOR IMPACT NO DRILL BRACE FOR IMPACT NO DRILL.  Till and Osweiler look at each other: fuck. EXT. THE TRAIN - A WIDE SHOT OVERHEAD - SAME The front of the train has just snaked around a BLIND TURN and right in front of it is A LARGE FROZEN ICESLIDE BLOCKING THE TRACK. There’s nothing for the train to do but   SMASH   its way through the obstruction. As it   COLLIDES...  INT. THE TRAIN - A CORRIDOR PASSAGEWAY - SAME Till and Osweiler are thrown up against the window as the train   ROCKS VIOLENTLY T",
      "dialogue_count": 0,
      "word_count": 587
    },
    {
      "scene_number": 4,
      "slugline": "EXT. THE TRAIN - A WIDE SHOT OVERHEAD Snow shoots out in every direction as the train plows through the iceslide, righting itself. It takes a lot to derail this massive machine, and that little iceslide isn’t gonna do it. INT. THE TRAIN - A CORRIDOR PASSAGEWAY Till and Osweiler on the ground. Till shakes out her wrist. OSWEILER You all right? TILL Yeah. Shit show. They climb to their feet... INT. THE TAIL SECTION OF THE TRAIN - LATER ON LAYTON’S RATS as they all push their faces to through the cages, desperate. WE WIDEN OUT: Layton uses an eye dropper to feed a BLACK LIQUID to each of the rats. It’s not desperation, it’s just feeding time. The tips of Layton’s fingers are stained a little black from this feeding ritual. It echoes Pixi’s dyed arm. Fergus approaches, sits cross-legged at the cage. FERGUS Do you need help? LAYTON I got it. FERGUS I’m going to pull the traps to make the new ones. 4, 8, 12. LAYTON 4, 8, 12. I remember. FERGUS Sometimes you don’t. LAYTON But sometimes I do. He smiles at the boy. Then he looks past Fergus: in a dark corner A COUPLE ARE QUIETLY HAVING SEX. Not in an exhibitionist way, more in a   it is what is   way.  20.",
      "characters": [],
      "action_text": "Where else are they going to go?   Still.   Fergus glances over, as well. Not the first time he’s seen this, either. It probably doesn’t faze him.   Still.  LAYTON (CONT’D) (re the rats, to distract) I can’t find forty-four. Fergus refocuses on the rats, begins looking through the cage. Very quickly finds and identifies Number 44. FERGUS There. Layton hands him the eye-dropper. Fergus feeds 44. FERGUS (CONT’D) And there’s forty-five. LAYTON Do ‘em then. Fergus feeds Number 45, quickly becoming engrossed in the task at hand. Layton’s eyes drift back to the couple just as they arch in climax. He looks away. INT. AQUARIUM CAR - SAME  (Reference Aquarium car from film)  JINJU, Korean, early 30s, lays on her back on a woven mat. She stares up at the Aquarium. The tank arches over her head and surrounds her vision. The fish are hypnotic; the aquarium beautiful. Jinju’s eyes move from fish to fish.  Should we draw a comparison between the rat cage and the aquarium? That’s up to you. I mean, I do. But that’s me.  THE SOUND OF A DOOR OPENING. Jinju sits up. It’s Melanie Cavill. JINJU (rising) Ms. Cavill. Sorry. MELANIE Oh no, my apologies, Jinju. I’m early. (re the mat) Meditation?  21. JINJU Inspection. Whenever we rock the train. MELANIE (touching the glass) I’d hope the tank could handle that little bump. JINJU And much more, yes. I was watching the fish. OFF MELANIE’S LOOK WE CUT TO: Melanie and Jinju   both   laying on the mat. MELANIE The skinny one. JINJU Saltwater skipjack. MELANIE And the pink one behind him. JINJU Opakapaka. Hawaiian snapper. (beat) Don’t look at the fish. Look at all the fish. Jinju holds up her hand, tracing various circles as the fish move through the tank. JINJU (CONT'D) Each school has a path. A speed. A direction. They choose the size of their shape, how long the trip. MELANIE Orbits. JINJU Or trains on tracks. (beat) When we rock the cars, the fish become nervous. I can’t talk to each fish. But I can watch the...orbits. Too fast, too slow. S",
      "dialogue_count": 0,
      "word_count": 1467
    },
    {
      "scene_number": 5,
      "slugline": "INT. PIXI AND VAL’S ROOM - SAME Pixi lays on her bed, wide awake. She looks over to Val’s empty bed--the girl’s gone “to work”--whatever that means. Pixi gets out of bed and climbs underneath her bed. She’s drawn to the tight dark space, like a dog in a thunderstorm. Or a girl in a drawer. EXT. TRAIN TRACKS - LOW ANGLE - MORNING We are low on the tracks as the dull sun touches the blue ice built up on the rails. The ice begins to shiver as the tracks begin to vibrate, their pulse quickening to a shudder and then   AN EXPLOSION OF SOUND AS   THE TRAIN BLASTS BY US.  INT. MEAT FREEZER CAR - MORNING The camera drifts across a row of frozen beef sides, hanging on hooks. They glisten with smears of fresh blood. The camera crosses the car to the other row of hooks, revealing TWO NAKED DEAD BODIES, hanging by their feet, throats cut, slowly twisting on chains. THE DOOR TO THE FREEZER CAR OPENS revealing Jack Anderson, dressed for work. We see the car as he sees it: BLOOD SPRAYED EVERYWHERE. The walls covered, the meat covered. Only the frozen blue marbled bodies of the two victims are bloodless. Jack steps into the car, in shock, drawn to the bodies. He approaches and we see their faces for the first time. The first body is a MAN, 40s, not known to us. The second body, unfortunately, we know. It’s Pixi’s roommate: VAL. INT. THE SUB-TRAIN TRANSPO SYSTEM - MORNING Till and Osweiler speed along in a car. Grim. INT. THE BUTCHER’S CAR - MORNING In between the cattle car and the meat freezer car is the BUTCHER’S CAR. It is exactly what you imagine, filled with knives, axes, electric saws, bolt guns, butchering tables with blood drains, etc. Currently it is filled with Magistrate Maki, Doctor Alfredsson, various Brakemen, and poor Jack Anderson.  27.",
      "characters": [],
      "action_text": "Till and Osweiler enter. Their boss, LEAD BRAKEMAN SAM ROCHE (50s), beckons them to the mouth of the MEAT FREEZER CAR. He keys the door and it opens, revealing the grisly scene. ROCHE Walk on the plastic. PLASTIC WRAP USED FOR MEAT has been laid down as a path to the bodies. ROCHE (CONT'D) It’s the best we could do. Till and Osweiler walk carefully out to the bodies. They aren’t seasoned homicide police and their faces betray their limited experience.   Also,   fuck it’s bad.   At the bodies: TILL That’s Eduardo Raggio. Car 37. Till carefully spins Val’s body so she faces them. Horrible. ROCHE Valerie Childress. OSWEILER Where is she from? ROCHE The Nightcar. Till and Osweiler exchange a look. TILL Was she in 12-N? With Pixi Aariak? (Roche nods) Has anyone told Miss Audrey? ROCHE (nods, re victims) She says he was at the Nightcar last night to see her. TILL What about Pixi? ROCHE They’re waiting to talk to her. TILL Until when? ROCHE Until you talk to her.  28. Things are starting to land for Till right about now... TILL I’ve never worked on a murder. ROCHE Bess.   No one’s   worked on a murder. Most of us were military, or Wilford security, or... (to Osweiler) Goalie? OSWEILER Midfield. Roche shrugs. See? ROCHE In seven years only   one   passenger has ever killed another passenger. The girl   you   pulled out of a Drawer yesterday. Also with a knife. TILL So Pixi’s a   suspect?  ROCHE Suspect. Witness. Unluckiest girl on the train. I don’t know. (re Magistrate Maki) But according to the Magistrate, you’re the only friend the girl’s made in the last three years. Till rolls her eyes. Osweiler shrugs. TILL What about Raggio? Has anyone been to Car Thirty-Seven yet? (off Roche’s look) We’re doing that, too. ROCHE Notify them. And keep them in their car until we can figure out how to question them all. Quietly. OSWEILER How many are they? ROCHE Four, five, six. I don’t know. Who can keep up.  29. TILL They’re   six.   They’ve been a stable six for   at least a year.  (",
      "dialogue_count": 0,
      "word_count": 2595
    },
    {
      "scene_number": 6,
      "slugline": "INT. TRAIN PASSAGEWAY OUTSIDE THE NIGHTCAR - SAME Till and Miss Audrey stand outside of Pixi’s room. The two women reflect quietly, unsure of the girl inside. MISS AUDREY Did you ever meet Pixi? Before? TILL When she worked here? No. MISS AUDREY She was as good as a girl could get. She could do anything. Many people found her...the most beautiful and moving time. For some, like the man who attacked her, she was like a piece of music. She pulled deep at them. TILL Do you think she had something to do with this? MISS AUDREY No. I’m just reminding you that what we do here,   for some,   it’s not entertainment. It pulls   deep.  Till nods, this is not news to her.   She knows.  INT. PIXI AND VAL’S ROOM - SAME Pixi sits on her bed. She gets up and crosses to Val’s bed. Lays down on it. INT. AQUARIUM CAR - DAY Jinju stands in front of the aquarium, watching the fish. We get the feeling she does this...oh, a lot. Magistrate Maki and the Butcher Bolger enter. JINJU Magistrate. Mr. Bolger. I’m sorry. I don’t have you down for today. MAGISTRATE MAKI We’re not here to eat. But could we get some tea? CUT TO:  39.",
      "characters": [],
      "action_text": "JINJU POURS MAKI AND BOLGER TEA AT THE SUSHI BAR. The presentation should be perfect. A perfect cup of tea. The two men drink, savoring the moment of high civilization. Jinju waits, watches. She’s smart. She knows something’s up. MAGISTRATE MAKI Jinju. JINJU Magistrate. MAGISTRATE MAKI I fear we’ve lost twelve-hundred pounds of beef. She looks at him, then the butcher. Didn’t expect   this.  BOLGER THE BUTCHER All of what we’d dressed. (beat) There was a problem in the freezer. She looks at Maki. MAGISTRATE MAKI It’s not something I can explain right now. But we will trust you with the details soon enough. JINJU Mr. Wilford owes me no answers. MAGISTRATE MAKI And he appreciates as always your lack of curiosity for things that don’t concern you. JINJU But you are here. Maki looks to Bolger. BOLGER THE BUTCHER Unless we accelerate the butchering, which would probably include a milk cow, we’ll have real shortages. Up and down the train. MAGISTRATE MAKI Passengers will be unnerved. Especially   up.   They’ve never experienced shortages before.  40.  (MORE) Not on the train. Mr. Wilford’s worked hard at that. A pregnant pause. Jinju appears to consider. Actually: JINJU No.   (off their look) It’s not possible. The tank won’t allow it. MAGISTRATE MAKI We’re not suggesting you make up the shortage. Nothing like that. But maybe if you   increase   your customer load,   slightly ,   for maybe a month. W e could balance the   yin  (Jinju) with the   yang ( Bolger )  during what I assure you will soon be a very   uneasy   period. (beat) It’s really about   l‘esprit de corps.  They wait on her. Hope she’s thinking on it. Jinju pulls out a BOTTLE OF SAKE. She pours the sake for the three of them. JINJU To the Wisdom and Judgment of Mr. Wilford Who Built the Engine Eternal. BOLGER/MAKI To his Wisdom and Judgment. The men drink, pleased. But then she continues: JINJU For trusting me with the care of this car and its passengers. She looks at them hard. Uh oh. JINJU (CONT'D) So I’m ",
      "dialogue_count": 0,
      "word_count": 1415
    },
    {
      "scene_number": 7,
      "slugline": "INT. FIRST CLASS DINING CAR - SAME A luxury dining car fit for a Michelin star. Currently present are: Magistrate Maki, Roche, Till. Roche sits at a table, a COVERED SILVER TRAY in front of him. The door opens and the Brakemen bring in Layton. He may still be a bit stoned but he’s sobering up quick. His eyes are everywhere, trying to get what’s going on. He looks to the suit, Maki, who gestures for him to sit across from Roche. ROCHE Mr. Well. My name is Sam Roche. I’m the Lead Brakeman. That is the Magistrate Maki, Brakeman Till. LAYTON Okay. ROCHE First off, you’re not in any trouble. LAYTON How could I be. MAGISTRATE MAKI You   do   abuse Chronole. LAYTON Is there a law? MAGISTRATE MAKI The industrial waste used to make it comes from uptrain. Perhaps it’s stealing. LAYTON Is it? An awkward moment. Roche recalibrates: ROCHE Let’s start again. This is for you. Slides the tray to Layton. Indicates for him to uncover it. Layton is suspicious but does so, anyway. On the tray is A PERFECT GRILLED CHEESE SANDWICH AND A BOWL OF TOMATO SOUP. We don’t know why but this hits him hard. He blinks tears.  46.",
      "characters": [
        "CLEO"
      ],
      "action_text": "LAYTON What the fuck is going on. (beat, almost pleading)  What the fuck is going on?  Maki gestures to Till. Till opens the door behind her and Osweiler enters with Cleo. Cleo crosses slowly, sits down across from Layton. He shakes from the palm-sweating gut- twist of an ex-lovers’ knife wound rent new in his belly. CLEO Hey. Layton stares at her. Painful silence. A hard silence. CLEO (CONT’D) Leyton-- He cuts her off by slowly sliding the sandwich towards her... CLEO (CONT’D) (re sandwich) They said you might be sick. And who knew what you’ve been eating-- LAYTON You   know   what I’ve been eating. You used to eat it. CLEO (after a pause, a breath) I can’t go back in time with you. Not today. LAYTON (re soup and sandwich) But you did this. He’s really upset by it. She’s not sure why. CLEO I wasn’t trying to fuck with you Layton. I’m   not   trying to fuck with you. They asked me what you liked and that you might be sick and I remembered this was your favorite so I told them-- (a memory stops her)  Oh.   Goddamn.  Suddenly Layton picks up the bowl and violently guzzles it; half of the hot soup pours down his shirt. He gags and vomits out most of it back onto the table and the other occupants. Roche looks to Maki-- fuck this.   But Cleo puts up a hand--  47. (awkward beat) Mr. Wilford imagined almost everything. But not everything. Tired of Maki, Layton looks to Cleo. CLEO They don’t have any cops here, Layton. Not real ones. Not homicide. Layton takes it all in, realizing why he’s here. He searches the different faces. Lands on Till. LAYTON You look like a real cop. TILL I was. Three years. Virginia Beach. “Virginia Beach” means something to Layton. LAYTON Virginia Beach. Sorry. TILL Thank you. CLEO Layton-- She reaches out and touches his arm--not a thing, just an old habit. He   recoils,   springs to his feet. He moves to the window. Watches the dead land roll by. ROCHE Mr. Well.   Detective   Well. This is new to us. And it’s old to you. MAGISTRATE MAKI As Mr. W",
      "dialogue_count": 1,
      "word_count": 1009
    },
    {
      "scene_number": 8,
      "slugline": "INT. THE WORKERS’ CAR - FOURTH CLASS An exhausted Jack Anderson sleeps curled in his bunk. Lilah and LJ sit on the floor, playing gin. Silva, Jack’s workmate, pokes his head into their pod. SILVA Hey, Lilah. LJ. I need Jack. LILAH Silva. Look at him. SILVA I know. LILAH What happened up there? SILVA I just gotta bring him. LJ puts her hand on her dad’s shoulder to wake him... INT. GREENHOUSE CAR - SAME Till and Osweiler lead Layton through the humid luxury of the greenhouse car. It’s an unimaginable bounty to Layton. Osweiler stops at a small orange tree. He catches Mrs. Wright’s eye as he points to an orange. She nods. Osweiler pulls it off. He hands it to Layton with a perverse casualness that is   painful   to Layton. He just...holds it. INT. THE CATTLE CAR - SAME WE OPEN ON: OUR FAMILIAR   COW   NUMBER 18 . WIDEN OUT to reveal BOLGER, SILVA and JACK walking down the line of cows. Bolger leads, trailing his hand across the haunches of each cow. He stops at   NUMBER 18.  INT. THE SUB-TRAIN TRANSPO SYSTEM - SAME The trio ride along. Layton contemplates the orange. Till leans forward and keys a couple buttons. The transpo slides to a stop. Osweiler looks at her: what are you doing?  51.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 220
    },
    {
      "scene_number": 9,
      "slugline": "INT. THE BUTCHER’S CAR - SAME Bolger and Jack SHARPEN KNIVES for butchering. Silva preps a CAPTIVE BOLT GUN in order to kill the cow. It is a nasty and lethal piece of equipment ( Remember No Country for Old Men?).  They glance back as Till, Osweiler and Layton enter the car. Layton sees the knives and the bolt gun--glances at Till nervously. Till makes a gesture to the butcher--can I have the car please? Bolger directs Silva and Jack into the cattle car. Silva takes the bolt gun with him, still loading it. Till walks to the opposite end, to the entrance to the Meat Locker car. She opens up the door, revealing THE CRIME SCENE. Layton looks at her: he’s no idiot, knows what she’s doing. But she’s no idiot, either, she doesn’t force him. She waits for him. He follows her. INT. THE MEAT LOCKER CAR - SAME The murder scene is literally frozen in place. Layton clocks the plastic wrap on the floor. He approaches the bodies. Kneels down so he’s face to face with the victims. TILL Eduardo Raggio. Valerie Childress. He touches Raggio’s face gently. Touches his lip. He reaches for Val, pushes her dangling hair away from her face and revealing the horrible gash on her neck. LAYTON What’s their connection? TILL She worked at The Nightcar. He visited her there last night. LAYTON She’s   young.  TILL It’s not...it’s not that. (off his look) The Nightcar is like a theater. Role playing. She’s a performer. He looks at her skeptically.  52.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 259
    },
    {
      "scene_number": 10,
      "slugline": "INT. THE CATTLE CAR - SAME Jack and Bolger approach   Number 18 . She’s snug in her railed stall, head towards the window and ass to them. Jack slides past her body to her head. He starts pushing at her. JACK C’mon girl. Back it up. The cow looks at him. Are you fucking kidding? INT. THE MEAT LOCKER CAR - SAME Layton stands next to the victims, fingering the chains, thinking to himself. He surveys the rest of the car, the blood sprayed all over the meat. He looks to Till and Osweiler, gathering the larger picture re the meat. He wanders over to a WHITE BUCKET with smears of blood in the bottom of it. He smells it. LAYTON Can you test this? OSWEILER No lab. Till takes the bucket from Layton. Smells it. TILL Is it human? Layton shrugs. LAYTON That’s why we had labs. He wanders to the meat, turning it, inspecting it. TILL (re bucket) You think whoever did this ruined the meat on purpose? LAYTON Dunno. This place is Mars to me. TILL People are still people. LAYTON  Are they?  53.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 188
    },
    {
      "scene_number": 11,
      "slugline": "INT. THE CATTLE CAR - SAME Jack and Bolger struggle with   Number 18 . Silva’s striding down to help them.   Note: he’s got the bolt gun with him.  OUTSIDE THE WINDOW The train rockets through a curvy mountain pass... EXT. THE MOUNTAIN PASS - SAME AROUND A CORNER: A LARGE ICE SLIDE. MUCH BIGGER THAN EARLIER. INT. MEAT LOCKER - SAME Osweiler wraps up the white bucket in plastic wrap. Layton’s returned to the bodies. Till with him. LAYTON Did you want Homicide? Were you gonna go for that? TILL By the time I got my badge...things were pretty bad. Especially in V.B. (beat) I didn’t think that far ahead. Layton returns to Val’s lips. Touches them. He is not callous to any of this. In fact, he’s affected deeply. LAYTON It’s the worst job in the world. (beat) I was glad to see it go. (beat) Something I like about the Tail: when people die no one has to figure out why. We all know. He stands. She looks him in the eye. TILL You’re not gonna help. LAYTON No. I’m not. WOMAN’S VOICE  BRACE FOR IMPACT NO DRILL BRACE FOR IMPACT NO DRILL.  54.",
      "characters": [],
      "action_text": "And BOOM! It hits. A MASSIVE IMPACT ROCKS THEM TO THE GROUND INT. THE CATTLE CAR - SAME The cattle car JOLTS FIERCELY sending the men slamming against the window, ESPECIALLY SILVA. As he hits the window, Silva’s BOLT GUN DISCHARGES against the glass, BLASTING A HOLE in the massive window. The men react in horror as   -140 degree air   rushes into the car, beginning to freeze anything in its path. And then BOOM! Another ice impact throws the train again, causing the broken window to COLLAPSE, letting the deadly cold atmosphere attack the car’s occupants like a wildfire. A cow kicks over a bucket of water; it freezes instantly. Cows closest to the window begin freezing to the metal rails.  NUMBER 18   lurches to the side, crushing Bolger in between the rail and two thousand pounds of animal. Bolger tries to scream but his diaphragm has been collapsed. AN ALARM SOUNDS as the doors to the cattle car seal shut. WOMAN’S VOICE  Breach C-56. Attention Breach Team. Breach C-56.  INT. THE MEAT LOCKER CAR - SAME Layton, Till and Osweiler struggle to their feet amidst the swinging bodies and beef. OSWEILER That’s the cows. The three rush out into the butcher’s car, the floor covered with butcher’s knives that have scattered during the impact. INT. THE CATTLE CAR - SAME Things go south fast. Like, Antarctica South. Jack and Silva struggle to stand but the floor is slick with ice. Bolger is dead or unconscious, frozen to a rail, crushed by   Number 18.  The cows nearest the window are dying fast, freezing in their places. Silva screams, tries to rip his hand from a metal railing. The flesh tears off.  55.",
      "dialogue_count": 0,
      "word_count": 479
    },
    {
      "scene_number": 12,
      "slugline": "INT. THE BUTCHER’S CAR - SAME Till and Osweiler run to the doors, looking through the quickly frosting windows and seeing the chaos. SUDDENLY THE BREACH TEAM ENTERS THE BUTCHER’S CAR--TEN NINJA- LIKE SOLDIERS IN ARCTIC WEATHER SUITS. AN ALIEN FORCE. One of them races to where Till and Osweiler are-- BREACH SOLDIER (an amplified breather) Get out of the way. He shoves them out of the way--looks through the window. BREACH SOLDIER (CONT’D) Downtrain car. The soldiers race out of the Butcher’s car and head around to the other side of car. Layton moves to the window. LAYTON What are they doing? TILL What do you think? Saving the cows. INT. THE WORKERS’ CAR - FOURTH CLASS - SAME The Breach team bursts in. Through amplified breathers: BREACH TEAM Everybody down the stairs! Now! Lilah and LJ are there. They evacuate like they’re told. The team rushes through the workers’ car to the next car, an unoccupied car filled with various machines, piping, etc. INT. THE BUTCHER’S CAR - SAME Our trio watch through the window as from THE BACK OF THE CATTLE CAR the doors open and the Breach Team enters. INT. THE CATTLE CAR - SAME A swarm of black bugs with cattle prods, the Breach team knows nothing about cattle, but they know the dangers of the cold. They brutally zap the animals, trying to get them out of the ice storm that is the cattle car.  56.",
      "characters": [],
      "action_text": "Meanwhile, Jack and Silva are being crushed, trampled and frozen. Silva goes down first as the cows respond to the prods and make for the open door. INT. THE INDUSTRIAL CAR - SAME The cows push back through the industrial car as the Breach Team unseals the door to the Workers’ Car. INT. THE WORKERS’ CAR - FOURTH CLASS - SAME The cows stampede into the residential car, smashing the workers’ pods, destroying living quarters. INT. THE SUB-TRAIN TRANSPO SYSTEM - SAME The workers are gathered, refugees from their car.   Chaos.  INT. THE BUTCHER’S CAR - SAME Our trio’s tortured, pacing, watching. There’s nothing to do without a suit. Layton looks to Till.   We gotta get in.  TILL It’s minus one-forty. INT. THE CATTLE CAR - SAME As the Breach team struggles to get the cows out, Jack and Silva, tangled amongst the frozen and dying cows, are close to death themselves. They try to scream for help, but the sound of the train and their frozen lungs make it impossible. Besides, the Breach team has its orders... INT. BUTCHER’S CAR - SAME Osweiler stares through the window, right into the eyes of a dying Jack, stuck on the ground. Jack stares right back. OSWEILER Get back. TILL What? No. Oz-- He grabs a rag from the butcher’s supplies and wraps it around his face. Wraps his hands.  57. OSWEILER Get the fuck back. He begins keying in the door code for the cattle car. Till grabs Layton, pulling him back to the other side of the car, stumbling over knives and falling. She cuts her arm on one-- TILL Shit-- She scrambles up and they sprint into the MEAT LOCKER CAR as Osweiler OPENS THE CATTLE CAR DOOR. Till shuts the door, sealing them in the Meat Locker. She screams in frustration. BACK IN THE BUTCHER’S CAR, the cold air blasts through the car, immediately frosting the steel equipment. Osweiler moves quickly into the CATTLE CAR, shutting the door behind him. He’s at the messy end of the car: a tangle of frozen, dying and dead cattle intertwined with the three men. Bolger and Silva are",
      "dialogue_count": 0,
      "word_count": 1094
    },
    {
      "scene_number": 13,
      "slugline": "INT. THE SUB-TRAIN TRANSPO SYSTEM - LATER The workers’ car refugees sit, waiting for instruction. A Brakeman climbs down the ladder. He makes his way to Lilah and LJ. He delivers the bad news. They collapse in grief. EXT. THE TRAIN - MOUNTAINS - TRANSITION SHOT - NIGHT The Snowpiercer roars through. We stay on it for a bit... INT. TRANSITIONAL CAR/INDUSTRIAL SPACE - LATER Layton and Till. Standing in front of a door. LAYTON Can I ask you a question? (she shrugs) What do you think of us? In the back? She pauses a second. Then: TILL I think you’re criminals. I think you broke the rules. I think ten billion people were dying, and you all decided you didn’t want to be part of that. I get it. But you put  this world   in jeopardy. You killed people. Mr. Wilford is more forgiving than I am. He’s trying to make the best out of a bad situation. But you don’t belong here. It may not be fair. Or nice. But the train is all that’s left. He gives her a little nod. LAYTON I bet you were a good cop. THE DOORS OPEN, revealing THE TAIL SECTION in all its Warsaw Ghetto Glory. He turns and walks inside. The doors close. She turns and strides off, not looking back. INT. THE TAIL SECTION OF THE TRAIN - LATER Layton sits back in his familiar spot. He’s peeling his orange. Fergus arrives, sitting down across from him.  60.",
      "characters": [],
      "action_text": "FERGUS Where’d you go? LAYTON I don’t even know. FERGUS They give you that? He nods. Gives it to Fergus. Go ahead. The boy takes a bite. The look on his face is   ecstasy.  FERGUS (CONT’D) What is it? Oh, Fergus. Layton’s heart breaks for him. INT. WORKERS’ CAR - FOURTH CLASS - LATER Lilah, LJ and the others enter to find it full of cattle. BRAKEMAN Three minutes. And do not disturb the livestock. A devastated Lilah leads her daughter back to their demolished pod, gathering up their few belongings... INT. THE TAIL SECTION OF THE TRAIN - LATER Layton is over near the heating pipes, sitting on the floor. He has one of Fergus’s new ingenious collapsible rat traps in his hand. He looks up to see Fergus’s mom, Josie. She hands him back AN ORANGE SLICE. He eats it. Holy shit that is good. JOSIE Was it about Cleo? LAYTON Sort of, yeah. JOSIE So she’s alive. LAYTON She is. JOSIE I guess that’s good. (beat) Did you see a lot of it?  61. LAYTON Enough. Layton sees Asher, the boy from the Engineers’ test. LAYTON (CONT’D) He didn’t pass the test? JOSIE The girl made it. LAYTON Good for her. JOSIE I suppose.  Layton idly collapses and uncollapses Fergus’s trap.  WOMAN’S VOICE  Attention passengers and people in the tail.  The Tailies look up. She   never   addresses them. WOMAN’S VOICE (CONT’D)  Due to an incident resulting from this evening’s impact, there will be a temporary reclassification of a small number of fourth class passengers...  THE TAIL DOORS OPEN. IN WALK THE WORKERS’ CAR REFUGEES. WOMAN’S VOICE (CONT’D)  ...until other arrangements can be made for their living quarters. Fourth class passengers will be expected to maintain their current work assignments.  Brakemen begin pulling Tailies from their bunks and directing refugees to those beds.   This is not good.  The Brakemen roughly pull Fergus’s stoned father out of his bunk and direct Lilah and LJ to it. They sit down on it, lost in a sea of strangers. Lilah pulls LJ close as Fergus and Josie rush to help Ian... W",
      "dialogue_count": 0,
      "word_count": 2654
    },
    {
      "scene_number": 14,
      "slugline": "INT. MELANIE’S ROOM - CONTINUOUS A deluxe quarters appropriate for a woman of her station. She changes out of her clothes, hanging things back in her closet neatly. She pulls on a faded t-shirt and jeans. Scrubs her face of the high end makeup...Yanks her hair into a pony. She walks to the uptrain wall of her cabin. She presses A HIDDEN BUTTON tucked in the woodwork. A camouflaged door clicks open. She slides it enough to let herself through and closes it behind her. We are now at  THE PROW OF THE TRAIN.  Somewhere between The Enterprise, a yacht, and well, the most advanced train in the world. The prow is littered with beautiful computer screens, quietly measuring and controlling every possible circuit, fluid, and force.   Present are several HOODED AND ROBED MEN AND WOMEN. THESE ARE THE ENGINEERS. We saw one earlier when he took the children in for testing. They are monk-like in mien. When Melanie enters, the Engineers melt into the background. It’s like a monastery and she’s the Head Abbot. She makes her way to the front, where one Engineer still stands, looking out the ENORMOUS VIEW WINDOW to the tracks ahead. We assume he’s the highest ranking of the hooded ones. She stands next to him, looking much less like The Voice of the Train (which she still is) and more like a prodigy in the Mechanical Engineering Department of M.I.T. Which she was. MELANIE Engineer. ENGINEER Mr. Wilford. MELANIE I have the train. ENGINEER You have the train. He makes the   W sign,   walks away, leaving her there. She watches ahead as her creation rockets down the frozen rails, eating up track, eating up miles, eating time. AND WE BURN TO WHITE.  71.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 291
    }
  ]
}