{
  "slug": "sons-of-anarchy-101-pilot-2008",
  "title": "sons of anarchy 101 pilot",
  "genre": "drama",
  "format": "series",
  "scenes_count": 7,
  "characters_count": 0,
  "characters": [],
  "total_words": 9271,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. ST. THOMAS HOSPITAL - PICU - DAY A GLOVED-HAND PUSHES OPEN the door of a high-tech INCUBATION UNIT.   We meet ABEL TELLER, 53 minutes old, 2 lbs, 13 ozs. Size of a Nerf football.   Tubes, wires coming and going from nearly every orifice.   As the hand attaches an IV, his tiny pink face contorts, a mix of fear, rage, determination -- EXT. STREET - DAY Jax KICK STARTS his Harley.   Bobby and Dublin do the same. The RUMBLE is undeniable.   The men peel out of the lot. INT. HAIRY DOG BAR - DAY Jax walks into the bar.   Bobby and Dublin trail behind. Local joint.   Day drinkers and barflies. In the back room, three large WHITE GUYS eat, drink, shoot pool.   INK on their arms -- NORDS.   Offshoot of the Aryans. Jax SPOTS the one he’s looking for.   Grabs a CUE STICK from a rack, and enters -- INT. POOL ROOM - CONTINUOUS Lining up a shot, one of the Nords, IZZY, 30’s, prison-buff. Without saying a word Jax CRACKS Izzy across the bridge of the nose with the thick end of the stick.   The stick SPLITS, so does Izzy’s nose.   Blood.   Izzy drops to his knees. JAX (livid) Sell crank to my pregnant ex-wife. You stupid peckerwood shithead. Bobby and Dublin pull 9MM’s, hold off the other Nords -- BOBBY Easy. Jax KICKS Izzy in the chest, knocks him flat on his back.   He picks up the BROKEN CUE STICK, drives the SHARP SPLINTERED end into Izzy’s GROIN.   The man MOANS in agony.   Dublin and Bobby wince, then smile.   Dublin advises his brother -- DUBLIN Jax.   Point made. Jax snaps out of his rage.   Nods.   Stares at the chaos he’s created.   Walks out. Bobby and Dublin back out, guns drawn.   Bobby smiles --  Sons of Anarchy - \"Pilot\" - Network Ninth Draft - 10/31/07   19 (CONTINUED) 24",
      "characters": [],
      "action_text": "BOBBY Enjoy your lunch. (re: Izzy’s skewered sack) Shish-ka-balls are on me. EXT. LOCAL STREETS - DAY Jax rides.   Alone.   The wind whipping through his colors. Blowing off the rage.   He slows to a stop at an intersection. Lets an elderly COUPLE cross.   AC Hale pulls up next to him in the Jeep. HALE How ya doing, Jax? (off his nod) Heard about Wendy and the baby. Sorry. JAX Thanks. Intersection clear, Jax roars off.   Hale stays with him. Outlaw and cop ride in tandem, the interrogation continues -- HALE Took a ride out to streams today.   Saw that warehouse that burned down. JAX Outside your jurisdiction, ain’t it? HALE Something blows up that close to your town, be bad law enforcement not to look into it. JAX What’d you find? HALE Not much.   Sanwa Sheriff shooed me off. JAX Guess it be “bad law enforcement” for him not to. HALE Saw Clay and Hawk riding out of the woods.   Guess they were curious, too. JAX Between you and me, I think they’re a little too curious, those two disappear into the woods together all the time. RED LIGHT.   Idling.   No love between Sam Crow and John Law.  Sons of Anarchy - \"Pilot\" - Network Ninth Draft - 10/31/07   20 CONTINUED: (CONTINUED) 25 HALE Ever hear of a Blue Bird Industries? Apparently they hold the title on that parcel. JAX Never heard of them. HALE No one has.   Gotta be some kinda shell corporation.   That whole area was littered with casings and gun parts. Had to be some kind weapons factory. JAX No kidding. Beat.   Dance over -- HALE Chief Unser’s retiring in two months. I’ll be stepping into those shoes. JAX So I’ve heard. HALE Unser’s always had a “look the other way” policy with the Sons of Anarchy. JAX Unser’s a lazy drunk. HALE Yeah.   He is. (beat) I’m not.   I won’t be looking the other way, Jax.   Just a friendly heads up. JAX We’re all free men, protected by the constitution. (smiles) You look any way you want.   Chief. Jax ROARS off the line as the light turns green. EXT. WOODED AREA - DAY Jax sits on his Harl",
      "dialogue_count": 0,
      "word_count": 2447
    },
    {
      "scene_number": 2,
      "slugline": "INT. ST. THOMAS HOSPITAL - PRIVATE ROOM - NIGHT Jax enters.   Wendy’s room.   A BIBLE on her night table. She’s asleep.   Jax watches her.   He wishes he could be angry, but she’s so fragile, so sad.   He moves her greasy hair from her eyes, strokes her face.   At one time, he loved her. Wendy tosses, wakes, sees him.   A flood of remorse -- WENDY Didn’t think you’d wanna see me. He can only nod.   She begins to CRY -- WENDY Everyone hates me.   I’m sorry, Jax. I’m so sorry.   Please don’t -- JAX You need to get help, Wendy. WENDY I know.   I will.   This time, I will. (beat) Told me Abel’s getting stronger. Doctor said they’re gonna fix his belly, maybe tomorrow morning.   That goes okay, then they’ll do his heart. This is news to Jax.   He nods -- JAX They’ll do everything they can. (beat) You should get some sleep. A true junkie, she shifts from remorse to self-preservation -- WENDY My lawyer says they could file criminal charges.   Fetal abuse. (beat) I got some things at the house.   In the stash drawer. JAX Jesus Christ. WENDY They find that shit, they’ll put me away.   You own the house -- (faux concern) Hate to see this blow back on you. Jax exits. WENDY Jax.   Please.   Please... The manipulation done, she shifts back to remorse, SOBS --  Sons of Anarchy - \"Pilot\" - Network Ninth Draft - 10/31/07   30 35",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 242
    },
    {
      "scene_number": 3,
      "slugline": "EXT. WENDY’S HOUSE - NIGHT Jax approaches the house.   Doors and windows are all open. Gemma’s 760 in the driveway.   Jax enters to find -- INT. WENDY’S HOUSE - LIVING ROOM - CONTINUOUS Gemma, dressed down, furiously CLEANING.   We see bags of garbage.   Piles of laundry.   Jax enters -- JAX It’s almost midnight. GEMMA Place is a goddamn pig sty. JAX Clean was never her strong suit. GEMMA No kidding. Jax takes in his home.   Gemma notices his distraction -- GEMMA What’re you doing here? JAX It’s my house. GEMMA You know what I mean.   You shouldn’t see it this way. Gemma finds an empty THUMB BAG under the couch -- GEMMA I swear to god, they better lock her lying junkie ass up. She starts wiping down furniture.   Jax watches her obsessive need to sterilize -- JAX Mom, you don’t need to do this -- GEMMA Just wanna get it livable.   Buy you some decent carpet.   Cigarette burns everywhere -- JAX Mom -- GEMMA Get you out of that dorm room.   Back home.   With your son.  Sons of Anarchy - \"Pilot\" - Network Ninth Draft - 10/31/07   31 (CONTINUED) 36",
      "characters": [],
      "action_text": "JAX Don’t -- Gemma ignores him.   Jax grabs the rag from her hand -- JAX Stop cleaning. He looks her in the eyes -- JAX He’s not gonna make it. GEMMA What’d ya mean?   What happened? JAX He was born with half a stomach and a hole in his heart.   He’s gonna die. Gemma SLAPS him. GEMMA Don’t you say that. (beat) You’re the only one this kid’s got. If you don’t believe he’s gonna live, you might as well go down there, kill him yourself. Jax has no argument.   Gemma softens.   Strokes his red face -- GEMMA Sorry. (off his nod) You need to see him, Jax. Beat.   The truth -- JAX I can’t. GEMMA Why?   ‘Cause he’ll break your heart? Gemma sees the look on her son’s face -- yes. GEMMA It’s called being a father. JAX For how long?   A day?   A week? Beat.   Gemma the matriarch, inspires -- GEMMA You were born with the same heart defect your little brother had. (pounds on his chest) Seem pretty sturdy to me.  Sons of Anarchy - \"Pilot\" - Network Ninth Draft - 10/31/07   32 CONTINUED: (more) (CONTINUED) 37 I came through hell, landed on my feet.   Your father was hit by a goddamn semi, dragged a hundred seventy-eight yards and that bastard lived for two more days. (beat) Tellers do not die easy. Jax is moved by his mother’s devotion. JAX No.   We just die painfully. GEMMA That’s the Irish in us. Jax drops onto the dirty couch, digs deeper -- JAX When you and Dad hooked up, he ever talk about his vision?   What he wanted from the club? GEMMA His vision was, you know, what it is. A brotherhood.   A family. JAX And running guns?   He want that? GEMMA He never really talked about it.   Why? JAX Found a box of Dad’s old shit in the storage unit.   Pictures, journals. Things I never knew about him. GEMMA What kinda things? JAX Little I read, seems his original idea for Sons of Anarchy was something simpler.   Social rebellion.   Living outside the box.   Called it a Harley commune.   Real hippy shit. GEMMA We all had a lot of bright ideas back then.   We were kids.   Your dad became a",
      "dialogue_count": 0,
      "word_count": 2976
    },
    {
      "scene_number": 4,
      "slugline": "EXT. LOCAL STREETS - DAY Jax, on his Harley, the duffle strapped down to the back of his bike, takes in his small town.   A pack of high school GIRLS see him.   Watch in awe.   Jax smiles. As he turns a corner, he’s joined by Clay and Hawk on their Harleys.   Clay sidles up next to him at a RED LIGHT -- CLAY Where’s Op? JAX Kid got hurt.   Rushed her to the ER. (re: duffle) Got the kit.   I can make it work. It’s all good. Clay stares at Jax.   Gauging the truth.   GREEN LIGHT.   The men roar off. A few blocks later, Dublin pulls out of a side street, joins the formation. As they pass a residential area, Rosco fills out the field. Locals have no choice but to take notice of Sam Crow as the pop of the Harleys bitch-slap their central nervous systems. EXT. HIGHWAY - DAY The MC heads out of town.   Clay in front.   Jax behind him, flanking his right.   Hawk behind Jax, flanking his left. Dublin and Rosco bring up the rear.   There’s dignity in the formation.   Leather-clad warriors. Sons of Anarchy MC, Redwood Original, on a mission.   Revenge. SMASH TO BLACK. END OF ACT TWO  Sons of Anarchy - \"Pilot\" - Network Ninth Draft - 10/31/07   45 50",
      "characters": [],
      "action_text": "ACT THREE SMASH UP ON: INT. CASINO (LAKE TAHOE) - LOUNGE - NIGHT 3 Bobby and Half-Sack enter a near-empty performance lounge. On stage, an ASIAN ELVIS IMPERSONATOR finishes a sound check. Bobby, agitated, approaches SIMON, 60’s, the manager. BOBBY Simon, who the hell’s that? SIMON Jesus, Bobby, what’re you doing here? BOBBY I’m booked, tonight and tomorrow. Five shows. Simon reaches behind the bar and grabs a booking JOURNAL. SIMON Oh, shit.   Got a new girl in booking. Bitch doubled up my Elvises.   Sorry. BOBBY Goddamn it, Simon. Asian Elvis walks toward them.   Catches the conversation. HALF-SACK Tell Chun King to take a hike. SIMON Got six busloads of Korean tourists coming in.   They love Asian Elvis. I’ll get you next month, Bobby. Asian Elvis walks past, gives Bobby a pat on the back -- ASIAN ELVIS Better luck next time, killer. Off Half-Sack, is this guy fucking kidding me -- INT. ST. THOMAS HOSPITAL - PEDIATRIC SURGICAL ROOM - DAY A team of NURSES prep Abel for surgery.   Hooked up to hoses and wires, they wipe him down with antibacterials.   He’s got a row of sutures across his tiny belly. EXT. INDUSTRIAL ROAD (OUTSIDE OAKLAND) - NIGHT An old beater VAN cruises a quiet stretch of industrial road. The only thing in sight is a COMMERCIAL STORAGE FACILITY. Three long buildings, each with four large storage units.  Sons of Anarchy - \"Pilot\" - Network Ninth Draft - 10/31/07   46 51",
      "dialogue_count": 0,
      "word_count": 459
    },
    {
      "scene_number": 5,
      "slugline": "EXT. COMMERCIAL STORAGE FACILITY - CONTINUOUS Jax, Clay, Hawk, Dublin and Rosco slip out of the van. Everyone in dark clothes.   No colors.   Hustle over to the storage units.   No guard, but the yard is brightly lit, protected by SECURITY CAMERAS and surrounded by barbed-wire. Jax, with BOLTCUTTERS, Hawk with an AXE, head to a power SUB- STATION.   Jax CUTS the padlock on the gate.   Hawk CLEAVES a thick cable in two.   Lights, cameras, alarms BLACKOUT.   Hawk flashes a rare SMILE as they head back.   Clay and the others have CUT THROUGH the fence and are inside -- EXT. COMMERCIAL STORAGE FACILITY - YARD - CONTINUOUS Clay signals them into action.   They pair up and stealthily move to the buildings.   CUTTING the padlocks that secure the large roll-up doors.   The men search the units. INT. CASINO - DRESSING ROOM - NIGHT Asian Elvis sits in front of a vanity, applying his porkchop sideburns.   A KNOCK.   He stays in character -- ASIAN ELVIS Who is it? VOICE (O.S.) The Colonel. Elvis, curious, opens the door -- Half-Sack.   Before he can ask, the prospect answers.   Brutal RIGHT CROSS.   Asian Elvis goes down.   Half-Sack locks the door.   Elvis, sans sneer -- ASIAN ELVIS What d’hell’s the matter with you? HALF-SACK I’m all shook up. Half-Sack BEATS the living Presley out of the Asian. INT. COMMERCIAL STORAGE UNIT - NIGHT Clay and Jax enter to find the others standing over FOUR CRATES of Mexican RELIGIOUS CANDLES -- Bleeding Heart of Jesus.   Under the top row of the ornate glass candles, are a dozen brand new MP-5's.   Clay smiles -- CLAY Praise Jesus.   It’s a miracle. (to Jax) Wire it up. Dublin and Hawk carry out the crates.   Jax unzips the duffle.  Sons of Anarchy - \"Pilot\" - Network Ninth Draft - 10/31/07   47 52",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 301
    },
    {
      "scene_number": 6,
      "slugline": "INT. ST. THOMAS HOSPITAL - PEDIATRIC SURGICAL ROOM - NIGHT We see a TEAM of SURGEONS operating on Abel.   Tara and the surgical nurses attend.   Abel’s heart is the size of a golf ball.   They desperately try to heal this tiny human. EXT. COMMERCIAL STORAGE FACILITY - YARD - NIGHT Jax has several six-packs of construction-grade TNT laid out. Slow going.   Unsure what wires to attach to the firing caps. Pulls out a PREPAY CELL.   Tries to dial out -- NO RECEPTION. JAX Shit. Clay anxiously checks his watch.   Walks over to Jax -- CLAY You said you could make this work. JAX Just double-checking.   Almost got it. Hawk, standing watch, spots HEADLIGHTS approaching -- HAWK We got company. CLAY Goddamn it. Jax scoops up the TNT.   They rush back into the storage unit. INT. COMMERCIAL STORAGE UNIT - CONTINUOUS Clay pulls the door shut.   The men arm up.   To the others -- CLAY Wait here. Jax and Clay slip out a back door. EXT. COMMERCIAL STORAGE FACILITY - YARD - CONTINUOUS A MAN wearing a gray HOODIE, call him THE SENTRY, opens the front gate, letting a PICKUP TRUCK pull inside.   The Sentry checks out an ELECTRICAL PANEL as four other MEN hop out of the truck.   No urgency.   Three of them wear SNAKESKIN boots and colors -- MAYANS MC, OAKLAND.   The fourth man wears a knit cap and a denim shirt, call him DENIM SHIRT GUY. Jax and Clay watch from the shadows.   DID NOT SEE The Sentry. CLAY We should’ve been long gone by now.  Sons of Anarchy - \"Pilot\" - Network Ninth Draft - 10/31/07   48 (CONTINUED) 53",
      "characters": [],
      "action_text": "JAX I know. CLAY They see those clipped padlocks, they’ll call for backup. JAX We got the iron, let’s get out. CLAY Came here to send a message. Beat.   Jax takes in Clay’s ominous meaning -- JAX Blowing shit up’s one thing.   We off these guys, could trigger something runs out of control.   Bodies’ll drop on both sides. CLAY Cost of doing business. (beat) You have a problem with that? Jax knows this is a test.   Leadership, loyalty.   Then -- JAX I’ll draw ‘em to the middle. Clay heads inside.   Jax takes off his boots, wraps himself in a CARGO BLANKET, grabs a bag of garbage from a trash can.   He walks into the yard.   MUMBLING.   Before the Mayans can investigate the units, they see Jax, the crazy homeless guy. MAYAN 1 Look at this shit. Mayan 1 and 2 head over to Jax, as Denim Shirt Guy and Mayan 3 join The Sentry at the electrical panel. MAYAN 1 Hey, cabron.   This is private property. Jax, mumbles LOUDER as he crosses to the center of the yard. He pulls out his dick, starts PEEING, oblivious to the men. MAYAN 2 Probably took a shit on the transformer, knocked out the power. Mayan 1 spins Jax around.   Jax cowers, playing the role -- MAYAN 1 This look like some kinda Holiday Inn to you, man?   Huh? The two Mayans don’t see Sam Crow moving up behind them.  Sons of Anarchy - \"Pilot\" - Network Ninth Draft - 10/31/07   49 CONTINUED: (CONTINUED) 54 MAYAN 2 Tell your dirtbag buddies, they try to camp out here, they get some of this -- He SMASHES Jax in the face.   Splits his eyebrow.   Before he gets a second punch, Jax pulls out his 9MM and PISTOL WHIPS Mayan 2 across the face.   Mayan 1 reaches for his weapon, but Clay and the others are on them, GUNS out.   Jax disarms Mayan 2, Clay rips the gun from Mayan 1’s hand -- CLAY Tell your dirtbag buddies, they steal from Sam Crow, they get some of this -- Clay SHOOTS Mayan 1 in the throat.   Point blank.   Instant death.   Mayan 2 watches the execution.   Fear and loathing. The Sentry is out of sight, but Mayan 3 and D",
      "dialogue_count": 0,
      "word_count": 2568
    },
    {
      "scene_number": 7,
      "slugline": "INT. LOWELL’S APARTMENT - LIVING ROOM - NIGHT Lowell, dressed, cleaned up, rocks anxiously on the couch. TV on, he just stares at his kid, sleeping at the other end. EXT. SAMCRO CLUBHOUSE - FRONT - NIGHT We see HANDS grab ANTLERS and pull the DEER HEAD out of the dumpster.   Young buck, rescued. INT. ST. THOMAS HOSPITAL - PRIVATE ROOM - NIGHT Wendy’s hand drops limp, the EMPTY syringe hits the floor. Her monitor FLATLINES.   ALARMS signal. INT. CASINO - LOUNGE - NIGHT Bobby sings.   Audience captivated.   Half-Sack nurses a drink. INT. SAMCRO CLUBHOUSE - APARTMENT - NIGHT We see the MANUSCRIPT and PHOTOS of Jax’s father on his bed. Ghost of John Teller.   Undeniable. INT. ST. THOMAS HOSPITAL - PICU RECOVERY ROOM - NIGHT Jax enters the post-surgical room.   Abel is inside the INCUBATION UNIT, hooked up to monitors and tubes.   Jax is awed by the sight of him.   Tiny, fragile.   He places his gloved hand on the unit.   As close to a touch as possible. For the first and last time, we see Jackson Teller shed TEARS.   The emotionality catches him off-guard.   He checks himself, containing the overwhelm, just as -- A HAND caresses his shoulder.   Gemma, in sterile gear, behind him -- GEMMA He’s perfect. Jackson stares at his perfect child.   A son of anarchy. The camera SLOWLY PANS to reveal, through the WINDOW behind them, Clay and Tara, watching three generations of Tellers. Neither one knowing the path that the family will take. Above Tara’s head, barely in frame, is a red EXIT SIGN. SMASH TO BLACK. THE END  Sons of Anarchy - \"Pilot\" - Network Ninth Draft - 10/31/07   58 63",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 278
    }
  ]
}