{
  "slug": "spider-man-into-the-spider-verse-2018",
  "title": "spider man into the spider verse",
  "genre": "action",
  "format": "film",
  "scenes_count": 9,
  "characters_count": 0,
  "characters": [],
  "total_words": 22908,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. VISIONS ACADEMY - MORNING  The car pulls up. Miles sits, not wanting to go in. MILES Why can’t I go back to Brooklyn Middle? JEFFERSON (raises his eyebrows) Miles, you’ve given it two weeks. We’re not having this conversation. MILES --I just think that this new school is elitist-- JEFFERSON --Elitist?-- MILES --and I would prefer to be at a normal school among the people. JEFFERSON The   people ? These are your people! MILES --I'm only here ‘cause I won that stupid lottery-- JEFFERSON No way. You passed the entry test just like everybody else, ok! You have an opportunity here, you wanna blow that, huh? You want to end up like your Uncle? MILES (under his breath) --What’s wrong with Uncle Aaron? He’s a good guy-- --Jefferson FLINCHES, angered. Reins it in. JEFFERSON ...We all make choices in life-- MILES --It doesn't feel like I have a choice right now-- JEFFERSON --YOU DON’T! 8.",
      "characters": [],
      "action_text": "Tension fills the car. They sit in silence for a beat. Miles gets out of the car and opens the front door to get his bag   Jefferson staring through his rearview mirror-- JEFFERSON (CONT’D) I love you, Miles. MILES Yeah, I know, Dad. See you Friday-- --Miles shuts the door and walks away. Jefferson watches, bummed at the state of the relationship. He lifts his P.A. JEFFERSON (INTO P.A.) You gotta say I love you back. MILES Dad are you serious?   JEFFERSON (CONT'D) I wanna hear it. MILES You wanna hear me say it--   JEFFERSON (CONT'D) --I love you, Dad. MILES --You’re dropping me off at a school-- JEFFERSON (CONT'D) --I love you Dad. MILES Look at this place--   JEFFERSON (CONT'D) --Dad, I love you. MILES Dad, I love you. JEFFERSON (INTO P.A.) That’s a copy. Tie your shoes please!  SEQ. 0200 - THE LOTTERY WINNER “TLW” INT. VISIONS ACADEMY - MORNING  PAN UP from UNTIED SHOES -- Miles clocks them but defiantly DOES NOT TIE THEM-- --Miles walks through a LOBBY filled with TALLER KIDS in IDENTICAL BLUE UNIFORMS. A cutting-edge LAB SCHOOL in a converted industrial building. STUDENT I love you, Dad! 9. In a SEA OF BLUE, Miles awkwardly tries to interact like he was on his street but everyone's so focused. MILES Hey good morning. How you doing?... Weekend was short, huh? (he turns to another kid) Oh my gosh this is embarrassing, we wore the same jacket-- MILES P.O.V. -- The UNIFORMED KIDS just pass by. Miles is discouraged. PASSING STUDENT Hey--   MILES (CONT'D) (hopeful) --Yeah? PASSING STUDENT --Your shoe’s untied. MILES Yeah, I’m aware. It’s a choice. And as his SHOULDERS DROOP he turns to walk into--  INT. VISIONS ACADEMY - MONTAGE  --A MATH TEACHER in front of a BAFFLING FORMULA. MATH TEACHER --Who can solve this for XY?-- --A LOGIC TEACHER in front of an ELABORATE PROOF. LOGIC TEACHER --And that is known as a syllogism. --IN JUMPCUTS Miles walks back and forth across the hallway. Each time he is holding more paper and books in his arms, getting more and more WEIGHED D",
      "dialogue_count": 0,
      "word_count": 933
    },
    {
      "scene_number": 2,
      "slugline": "INT. VISIONS ACADEMY CLASSROOM - LATER  Miles stands in front of Ms. Calleros’ desk as she slides a zero with a 0/100 written on it. MILES A zero? A few more of those and you probably have to kick me outta here huh? Maybe I’m just not right for this school? MS. CALLEROS If a person wearing a blind fold picked the answers on a true or false quiz at random, do you know what score they would get? MILES Fifty percent? MS. CALLEROS That’s right! MILES Wait wait! MS. CALLEROS The only way to get all the answers wrong, is to know which answers were right. You’re trying to quit. And I’m not going to let you. I’m assigning you a personal essay. Not about physics, but about you and what kind of person you want to be.  INT. DORM ROOM - NIGHT  Miles stares at his STACK OF HOMEWORK. He takes out a legal pad to start on his   Great Expectations   paper. He sighs. Frustrated, Miles looks out the window for a beat. Miles SMILES -- he has a MISCHIEVOUS IDEA.  SEQ. 0500 - A NIGHT WITH AARON “NWA” EXT. BROOKLYN - NIGHT  Miles moves down a street, alive with nighttime city energy. Once again the CAREFREE kid he yearns to be. Moving AWAY from the Manhattan skyline and turning into-- 13.",
      "characters": [],
      "action_text": "-- AN ALLEY,   where he sees a light on in the top apartment.  INT. UNCLE AARON'S APARTMENT - NIGHT  UNCLE AARON is texting on his couch when he receives a picture text of him, texting, from 1 second ago. Uncle Aaron looks at his window and sees Miles-- MILES (laughing) Uncle Aaroooooon! Hey! Were you scared?! Miles PRESSES HIS FACE UP AGAINST THE WINDOW making a funny face. TIME CUT   -- Aaron washes dishes as Miles SPARS with Aaron’s PUNCHING BAG not-very-competently: MILES (CONT’D) You want that, huh?   Unh. Unh.  UNCLE AARON What’s up with school? MILES Going great. Got tons of friends. UNCLE AARON You can't tell me it’s all that bad there... smart girls is where it’s at. Place must be full of 'em. Aaron walks over to the punching bag and holds it for Miles. MILES No, there’s no one. There’s no one. Aaron walks over to the microwave to get some popcorn. UNCLE AARON ...Yo I cannot have a nephew of mine on the streets with no game. MILES I got game! (fronting) There was a new girl, actually, she's kinda into me. You know how it is. UNCLE AARON What's her name? 14. Miles sits on the couch, and SCRIBBLES in his notebook. MILES (stutters, until--) --You know we... this is... we’re laying down the ground work right now. Uncle Aaron reacts, amused by Miles effort to sound cool. UNCLE AARON You know about the shoulder touch? MILES Of course I do! But tell me anyway. UNCLE AARON Tomorrow find that girl, walk up to her and be like... (does shoulder touch) \"Hey\". MILES (laughing) You serious Uncle Aaron? UNCLE AARON I'm telling you man, it's science. MILES So walk up to her and be like... hey. UNCLE AARON No no no no... like   hey...  MILES \"Hey.\" UNCLE AARON No. “Heyyy” MILES (mocks him) Heyyyyy. UNCLE AARON You sure you’re my nephew, man? Miles’ phone vibrates. UNCLE AARON (CONT’D) Is that her? 15. Miles has a text from Dad: “Done with that homework?” MILES (checking his phone) I should probably go. Still got a paper to do tonight. Aaron sees this text and then casually ",
      "dialogue_count": 0,
      "word_count": 713
    },
    {
      "scene_number": 3,
      "slugline": "INT. SUBWAY TUNNEL - NIGHT  Aaron and Miles walk deeper and deeper down the tunnels and approach an ELECTRIFIED floor-to-ceiling FENCE. RACK TO an AlCHEMAX PRIVATE PROPERTY SIGN, and other HIGH SECURITY PARAPHERNALIA.   Someone really wants people to stay out.  Aaron expertly CLIMBS A FENCE, drops down on the other side. Miles climbs the fence. We STAY ON AARON as we hear Miles struggle. Finally Miles lands next to Aaron. MILES Wassup? Uncle Aaron laughs. UNCLE AARON Yeah man I knew we were related.  INT. ABANDONED SUBWAY TUNNEL - NIGHT  Aaron leads Miles into a huge space. Empty walls and spiderwebs as far as the eye can see. MILES Whoa... (then, for the echoes) BROOKLYN!   Brooklyn!   Brooklyn! The room is full of BEAUTIFUL STREET ART -- it’s a secret spot. UNCLE AARON There’s a lot of history on these walls. MILES This is so fresh. Aaron gestures to a wall that’s been RECENTLY CLEANED AND PREPPED...clearly by Aaron. Aaron smiles, leans down to his BAG and unzips it, revealing KRYLON SPRAY PAINT CANS. He tosses a can to Miles. Presses PLAY on a stereo. Miles SMILES-- --and starts painting. Aaron turns over a BENCH. UNCLE AARON Now you’re on your own, Miles. (then) (MORE) 17.",
      "characters": [],
      "action_text": "Whoa, slow down a little... that's better... that’s perfect. Unbeknownst to them, a faintly glowing SPIDER descends on a web, towards the ground and towards the cans! UNCLE AARON (CONT’D) (coaching him) The real Miles, comin’ out of hiding. Now you can cut that line with another color. That’s it... MILES Little help? CUT TO Miles on Uncle Aaron’s shoulders. For a beat afterward, they paint TOGETHER. UNCLE AARON You want drips? ‘Cause if you do, that’s cool, but if you don’t you gotta keep it moving... MILES That’s intentional! Aaron traces Miles’ silhouette on the wall. UNCLE AARON Wow. Miles steps back, admiring his work. A STRIKING PIECE, built around Miles silouette with nothing painted inside it. A BLANK. “No Expectations” written above. MILES (suddenly embarrassed) Is it too crazy? UNCLE AARON No man. Miles I see   exactly   what you’re doing here, man. Miles smiles. So happy to finally be seen. UNCLE AARON (CONT’D) Yeah. You know me and your Dad used to do this back in the day. MILES Stop lying. UNCLE AARON   (CONT'D) 18. UNCLE AARON It’s true. Then he took on the cop thing... and I don’t know. He’s a good guy, just... you know what I’m saying... Aaron’s   phone VIBRATES, he READS a message. A shadow across his face. UNCLE AARON (CONT’D) All right, come on man. I gotta roll. Aaron walks out of the tunnel leaving Miles alone. Miles takes one last look at their PAINTING and takes a picture of it on his phone. There's the SPIDER, on the back of Miles’ hand. It BITES him! WE JUMP INTO PSYCHEDELIC 2D ANIMATION, watching the VENOM make it’s way into MILES’ BLOOD STREAM, BUILDING UNTIL-- --Miles flicks the spider and it falls off his hand. UNCLE AARON (CONT’D) Miles, let’s go! Miles, hiding the bite, runs to join his Uncle.  SEQ. 0700 - PUBERTY “PUB” INT. DORM ROOM - NIGHT TIME LAPSE: As the moon rises, Miles shifts positions. It’s a restless sleep, the spider-bite faintly glows, Miles starts to sweat...  While Miles tosses and turns, his roomate Ganke works on his c",
      "dialogue_count": 0,
      "word_count": 1949
    },
    {
      "scene_number": 4,
      "slugline": "INT. SUBWAY STATION - NIGHT  He exits the subway, turns toward the DARK TUNNEL he and Uncle Aaron walked into. MILES You’re being crazy Miles. You’re being crazy.  INT. ABANDONED SUBWAY TUNNEL - NIGHT  The MURAL Miles made is still here. MILES Find the spider. You’ll see. The DEAD SPIDER is there. Miles flips it over. It looks WEIRD and FLUORESCENT. MILES (CONT’D) It's a normal spider. It’s like boring how normal the spider is... The spider GLITCHES making Miles jump back. Suddenly, Miles hears a RUMBLE. He stands, STARTLED. The rumble STOPS. It appears to be coming from a   PITCH BLACK ABANDONED TUNNEL . A surge of SPIDER-SENSE. Overwhelming. MILES (V.O.) (CONT’D)  Why is this happening to me?  SEQ. 1200 - ASSEMBLY ROOM FIGHT “ARF” INT. PITCH BLACK TUNNEL  Miles shines his light into darkness. This is SCARY. A LONG, BLUE TUBE, stamped ALCHEMAX, arcs into the DISTANCE, HUMMING. Miles’ spider-sense continues to direct him. Another surge of SPIDER-SENSE hits Miles and we hear competing thoughts in his head. MILES (V.O.) Slow down!/What am I doing? What am I doing? Miles picks up the pace, jogs around the corner, where Miles TURNS,   a BIG SURGE OF SPIDER-SENSE and multiple voices are heard together -- 27.",
      "characters": [],
      "action_text": "MILES Look out./I don’t want to be a hero!/Look out. MYSTERIOUS VOICE #1 --You’re like me-- MYSTERIOUS VOICE #2 --That’s all it is Miles.--   MYSTERIOUS VOICE #3 --You’re like me-- MYSTERIOUS VOICE #4 --LOOK OUT--  --WHAM!!!!!   A SUBWAY CAR flies towards him from the next room and SMASHES AGAINST THE WALL BESIDE HIM! MILES Whoa!  INT. SUPERCOLLIDER STAGING CHAMBER - CONTINUOUS  A massive staging room containing Alchemax EQUIPMENT. ZOOM IN ON:   SPIDER-MAN.   In mid-flight. Backwards. He wrecks against some painful looking equipment. ON MILES, TERRIFIED. What's happening?! SPIDER-MAN Norman, listen to me. MILES (V.O.) Spider-Man?! SPIDER-MAN I cannot let you open a portal to another dimension! Brooklyn is not zoned for that! PAN to reveal GREEN GOBLIN, a 25' beast with massive wings. He unfurls a big BIG BLUE TONGUE. GREEN GOBLIN It’s not up to me. MILES (V.O.) Is that Green Goblin!? GREEN GOBLIN Why won’t you quit?! 28. SPIDER-MAN I don’t know I guess I like Brooklyn not being sucked into a black hole? MILES I think I’m gonna go... SPIDER-MAN Staten Island maybe, NOT Brooklyn! As Miles turns to run, A GIANT BEAM CRASHES INTO THE ROOM. Miles FALLS ON TOP OF IT as it swings back out into the room where Goblin and Spider-Man are FIGHTING. Miles hangs onto the beam for dear life. MILES No, no! Miles is tossed around the room as Goblin and Spider-Man battle. Green Goblin throws CLUSTER BOMBS as Spider-man swings around them, and Miles avoids the explosion but now he's EXPOSED. This is WAY more real in person. He runs down a MASSIVE HALLWAY, away from the battle. Miles catches himself before tumbling over the end of the hallway into a giant room.  SEQ. 1210 - MEET KINGPIN “MKP” INT. SUPERCOLLIDER ROOM  He is now in an ENORMOUS CHAMBER containing a SUPERCOLLIDER. MILES Woah!! Miles looks around the room, confused. MILES (CONT’D) What is this place?-- --Spider-Man and Goblin BURST through doors above him-- --Miles falls STRAIGHT DOWN, but Spidey spots Miles and-- --swings ",
      "dialogue_count": 0,
      "word_count": 1902
    },
    {
      "scene_number": 5,
      "slugline": "INT. SUBWAY TUNNELS - CONTINUOUS  --Miles races down the tunnel toward the LIGHT OF THE STATION. He HOPS THE FENCE, no hesitation. Prowler sprints behind with INFRARED VISION! A SUBWAY TRAIN IS COMING! Miles LEAPS INTO THE AIR and GRABS THE CEILING as the DEAFENING subway passes BENEATH HIM. Prowler WALKS TOWARD MILES as Miles realizes his HANDS ARE STUCK!   Miles swings his legs around to free himself as Prowler approaches.   A nightmare come to life.  MILES Stop sticking! Miles somehow RIPS HIS HANDS OFF, skin tearing --   OW! --   and races out of the tunnel--  INTO THE LIGHT , clambering onto the PLATFORM, another train coming, Miles LEAPS, just CLEARING IT. He runs upstairs. Prowler watches from the SHADOWY TUNNEL, unable to follow. SUBWAY VOICE  Stand clear of the closing doors, please.  EXT. BROOKLYN - NIGHT  Prowler whizzes through the busy streets on his motorcycle. He drives right by a hiding Miles. Miles runs past a crowd that is gathering around the strange CLUSTERED TRAFFIC LIGHT we saw earlier(A remnant of dimensional glitching), taking photos. BROOKLYNITE Yeah, I think it’s a Banksy.  SEQ. 1250 - JUST KID STUFF “JKS” INT. MILES’ CHILDHOOD BEDROOM - LATER  Off screen, a TV plays the news as MILES climbs through the window.  NEWS ANCHOR (O.S.) ...New Yorkers are reporting sporadic power outages in the wake of another strange seismic event...  37.",
      "characters": [],
      "action_text": "He's breathing heavy. He's freaked out and so scared. JEFF'S VOICE rings out from O.S. JEFFERSON (O.S.) Police! Put your hands up!! ..Miles? Miles? Jefferson sees Miles. JEFFERSON (CONT’D) Why aren’t you at school? --Miles runs up to his dad and embraces him. Jeff is confused, then seems to get it. JEFFERSON (CONT’D) Whoa, whoa, it’s ok. RIO Miles? Que te pasa? Is it the earthquake? Miles looks at each of his parents, torn. Maybe he should confide in them...? MILES Can I sleep here tonight? JEFFERSON Miles, it’s a weeknight. You made a commitment to that school-- RIO --Jeff, he’s upset. Rio and Jeff share a look. Jeff understands, softens. JEFFERSON Of course you can stay. Miles sits down on his bed. MILES Dad? JEFFERSON --Yeah?-- MILES ...Do you really hate Spider-Man? JEFFERSON (beat, confused) Yeah?   (MORE) 38. (then) I mean, with a vigilante-- --Rio shoves Jeff out-- RIO --Jeff, mi amor-- JEFFERSON --What? He asked me. Baby, you know how I feel about Spider-Man, c’mon... RIO Mhmm... Jeff leaves. Miles, lies down on his bed. Rio tenderly strokes Miles’ forehead. RIO (CONT’D) Tu sabes que el te quiere mucho... That’s why he’s tough on you, you know that, right? MILES Mom, do you ever think about moving out of Brooklyn? RIO Our family doesn’t run from things, Miles. MILES Yeah, I know. Rio kisses his forehead. Gets up, LIGHTS OUT. RIO (O.S.) He’s having a hard time, Jeff. JEFFERSON (O.S.) When it gets hard, that’s when he’s gotta stick it out. RIO (CONT'D) Shhhh. Tiene que mas suave. Their voices fade. Miles take the KEY out of his pocket in a closed fist as the MUFFLED SOUND of his parents’ voices fades away. Miles opens his hand, revealing the KEY. Miles stares at it.  SEQ. 1330 - PETER’S FUNERAL “PEF”  JEFFERSON (CONT'D) 39. TV NEWS BULLETIN EXT. NEW YORK CITY - INTERCUT  Rio and Jefferson watch the news. Miles sits up in bed. NEWS ANCHOR #2 (V.O.)  We interrupt this broadcast for a special report. Sad news tonight. The hero known as Spider-Man has died after i",
      "dialogue_count": 0,
      "word_count": 772
    },
    {
      "scene_number": 6,
      "slugline": "INT. STAN’S COSTUME STORE - DAY  Miles looks at a Spider-Man costume, deciding. Then BUYS IT from a COMIC BOOK OWNER who looks A LOT LIKE... STORE OWNER I’m going to miss him. MILES Yeah. STORE OWNER We were friends you know. MILES Can I return it if it doesn’t fit? STORE OWNER It always fits. Eventually. Beat. Stan head tilts to a sign: NO RETURNS. He smiles.  INT. BATHROOM  Miles puts the costume on and stares at himself in the mirror. MJ (V.O.)  He didn’t ask for his powers. But he chose to be Spider-Man.  He experiments, crouching in a classic Spider-Man pose. He relaxes then quickly tries another pose.  EXT. CATHEDRAL - DAY  Miles walks in a sea of well wishers in full costume, many also in Spider-Man costumes, homemade and store bought. MJ My favorite thing about Peter is that he made us each feel powerful. We all have powers of one kind or another. But in our own way, we are all Spider-man. And we’re all counting on you. MILES (to himself) They’re counting on me. 41.",
      "characters": [],
      "action_text": "FUNERAL ATTENDEE (whispers to Miles) Probably not you specifically. I think it’s a metaphor. MJ backs away from the dais. Aunt May comforts her.  EXT. ALLEY  Miles rounds a corner and takes out the Spider-Man Origins comic book. He flips to a page that depicts Peter testing his new powers by jumping from a building.  INT. BUILDING - DAY  Miles RUNS UP A FLIGHT OF STAIRS, eyes determined. He BURSTS THROUGH A DOOR AND onto--  EXT. ROOF - DAY  Miles walks to the edge, looks DOWN and then ACROSS to the neighboring roof, calculating the jump. He BACKS UP. Cracks his neck. Waits there. As the MUSIC CRESCENDOES--  INT. BUILDING - DAY  Miles RUNS DOWN A FLIGHT OF STAIRS.  INT. BUILDING - DAY  Miles, disappointed in himself for chickening out, eyes a SHORTER BUILDING.  INT. BUILDING - DAY  Miles RUNS UP ANOTHER FLIGHT OF STAIRS.  EXT. ROOF - DAY  He BACKS UP. Cracks his neck...then RUNS, gaining speed-- --and TRIPS on his untied shoelace, FALLING TO THE GROUND BELOW. We make a meal of the fall, comics-style. 42. Miles lands with a CRACK (BURST CARD), and pulls out the key which is now TOTALLY BROKEN.  SEQ. 1400 - THE CEMETERY “CEM” - PART 1 EXT. CATHEDRAL - NIGHT - LATER  It's snowing now. Empty and quiet. Footsteps on snow as Miles approaches Peter Parker's grave. He takes off his mask, looks down at Parker's gravestone and sighs, then speaks, so softly we can barely hear him. MILES I’m sorry, Mr. Parker... That thing you gave me, that key... (holds it out) I think I really messed it up. I want to do what you asked. I really do, but... I’m sorry. I’m not sure I’m the guy. I can’t do this without you. BEHIND MILES a DARK FIGURE rises, casting a shadow. VOICE (O.S.) Hey! Kid!-- Terrified, Miles pulls his mask down and TURNS AROUND-- --The figure steps forward -- Miles panics and throws his arms up, accidentally delivering a VENOM STRIKE. The Dark Figure flies back as WEBBING flies from his hands and sticks to Miles, yanking Miles forward. MILES Woah!! Miles sits up and looks ",
      "dialogue_count": 0,
      "word_count": 6834
    },
    {
      "scene_number": 7,
      "slugline": "EXT. QUEENS - MORNING  A BUS.   INSIDE,   Miles and Gwen sit next to each other. Gwen holds the broken goober in her hand. Both want to talk, neither wants to start the conversation. It should feel kind of like them side-by-side in class. Peter SNORES in the back seat. GWEN He broke this? MILES Yeah. He’s actually really embarrassed about it. So, just keep it between us, ok? GWEN I know where we can make a new one. And we won’t let him break it this time. Gwen and Miles smile at each other. She’s letting Miles off the hook. MILES I’m sorry about your friend. GWEN Thanks, Miles. (then, continues) I know how hard this is, to have to figure this stuff out on your own. It’s kinda nice not being the only Spider person around. MILES Yeah. If you ever decide to do friends again, I could always open up a slot. A beat. Gwen considers. GWEN I’ll keep you posted. Miles smiles at Gwen. In the back seat, we see Peter is awake and listening. MILES (O.S.) Cool.  INT. QUEEN’S STREET - NIGHT  78.",
      "characters": [],
      "action_text": "Peter takes in A SMALL HOUSE. There are CARDS, BOUQUETS, and TOYS cluttering the porch. A TEXT BOX onscreen tells us:  SOMEWHERE IN QUEENS  PETER We should probably go. GWEN Peter, we’re literally on the doorstep. PETER Bad idea, bad idea, this is a bad idea-- GWEN Just relax. The front door opens a crack, AUNT MAY’S eyes peering out. AUNT MAY You guys are all very sweet but no more fans today, please. AUNT MAY’s eyes WIDEN.   She steps out onto her porch, stunned at the sight of Peter. Isn’t he supposed to be dead? And for Peter, isn’t Aunt May dead? PETER I’m not ready for this. AUNT MAY Peter... PETER Hey Aunt May... So this is going to sound crazy... but I’m pretty sure that I’m from an-- AUNT MAY --an alternate dimension. PETER Yeah. May touches his face in awe. Peter absorbs her touch. AUNT MAY You look tired, Peter. PETER Well, I   am   tired. 79. AUNT MAY (notes his physique) And older. And... thicker. PETER Yeah, I’ve heard that already. AUNT MAY Oh jeez, are those sweatpants? GWEN Yup. That’s what they are. MILES I was there... when it all happened. I am so sorry. AUNT MAY And what dimension are you from? MILES Brooklyn. (then) Did Peter have a place where we could make another one of these? Miles shows her the busted doodad. Aunt May regards it... AUNT MAY (re: goober) A goober... Follow me.  BACK YARD  Aunt May KICKS OPEN A DOOR and leads them to a GARDEN SHED in the tidy yard. PETER Oh yeah, I got one of these too. A little shed where I keep my spider- gear-- --A SPIDER-GRAPHIC begins to glow on the shed's door, which opens to reveal an ELEVATOR. Aunt May looks at Peter:   was YOURS like this?   As they enter: PETER (CONT’D) I mean, this place is pretentious. 80.",
      "dialogue_count": 0,
      "word_count": 503
    },
    {
      "scene_number": 8,
      "slugline": "INT. PETER PARKER'S LAB - CONTINUOUS  --into RIPeter's MASSIVE, SPIDER-MAN MEETS CALATRAVA LAB: Crammed with crime-fighting and science gear, photos, hangout furniture, not to mention every Spider-branded product in existence. They reach the bottom, fan out, exploring. MILES Whoa. Dude, was yours anything like this? PETER Mine was like this, but take away the jeep, the plane... imagine it way smaller. Imagine a futon. I feel sad for this guy. Miles notices one of 616Peter’s costumes... it has a CAPE. He looks back at Peter slyly, vindicated. Peter finds a PHOTO: RIPeter and MJ, together. Happy. It hits him hard. Miles notices. MILES Hey Peter, I think this is a cape. Peter can't help smiling. Gwen, in turn, watches this happen, her wheels turning. Miles is looking at the costumes. His reflection, still a bit off-center. May walks up. AUNT MAY Peter knew how dangerous the job was. But he figured the only one who could stop this guy was Spider- Man. MILES Kingpin knows we’re coming. We’re going to be outnumbered. AUNT MAY Don’t be so sure. May holds out “my name is” stickers. AUNT MAY (CONT’D) You might need these.  81.",
      "characters": [],
      "action_text": "MILES’ POV: Four sets of eyes open in the shadows. Spider sense rings out EVERYWHERE. Miles GASPS. Gwen SPINS AROUND, on high alert. On a SHOCKED Peter, Miles, and Gwen. AUNT MAY (CONT’D) You think you’re the only people who thought to come here? SOUND OF BLINDS FLICKING OPEN-- SPIDER-MAN NOIR is lit with venetian blind shadows, a black-and-white figure whose coat is inexplicably billowing around him. SPIDER-MAN NOIR Hey fellas. MILES Is he in black and white? PETER Where is that wind coming from? We’re in a basement. SPIDER-MAN NOIR Wherever I go, the wind follows. And the wind, smells like rain. SOUND OF MACHINE WHIRRING ABOVE. BOOM! PENI PARKER JUMPS DOWN from above. PENI Hi guys! Konichiwa! Hajimemashita yoroshuku? BOOM! SP//dr, Peni’s robot, LANDS BEHIND PENI IN A BADASS SPIDER-POSE. PETER This could literally not get any weirder. Spider-Ham walks into the shot next to Peter. Long beat. He sticks out his hand for Peter to shake. SPIDER-HAM It CAN get weirder! I just washed my hands that’s why they’re wet. No other reason. All of their spider senses go off. ALL SPIDERS You’re like me. 82. SPIDER-HAM/ SPIDER-MAN NOIR/ PENI PARKER SP//DR comics drop on top of Gwen’s --   ULTIMATE SPIDER-MAN CROSSOVER!  SPIDER-MAN NOIR/PENI/SPIDER- HAM (STAGGERED)  My name is Peter Parker/My name is Peni Parker/My name is Peter Porker.  SPIDER-MAN NOIR/PENI  I was bitten by a radioactive spider.  SPIDER-HAM  I was bitten by a radioactive pig.  Noir DISPATCHES ENDLESS BAD GUYS.   A SPIDER in SP//dr’s helmet BITES Peni’s outstretched hand--  SPIDER-MAN NOIR (V.O.)  In my universe it’s 1933 and I’m a private eye. I like to drink egg creams and I like to fight Nazis. A lot.  PENI (V.O.)  I am from New York in the year 3145. I have a psychic link with a spider who lives inside my father’s robot, and we’re best friends. Forever.  SPIDER-MAN NOIR (V.O.)  Sometimes I let matches burn down to my fingertips just to feel something, anything.  FULL SCREEN CRAZY SPIDER-HAM IMAGES: INCLUDING HIM",
      "dialogue_count": 0,
      "word_count": 1407
    },
    {
      "scene_number": 9,
      "slugline": "EXT. UNCLE AARON'S FIRE ESCAPE - LATER  Miles CLIMBS TO the rooftop across from Aaron's apartment. As he does we hear audio of a PHONE RINGING and then we see--  INT. SQUAD CAR  RIO Aye... he’s not answering me either. Jefferson is on the phone. Rio sits next to him. A CLICK--  UNCLE AARON (PHONE MESSAGE) --It’s Aaron. I'm outta town for a few days. Hit you when I'm back. Peace.  JEFFERSON  Aaron, it’s Jeff. Look, I need you to call me if you’ve heard from Miles.  EXT. UNCLE AARON’S APARTMENT  Miles is on the fire escape, he opens a window and climbs in, calling out for Uncle Aaron. JEFFERSON  He has a soft spot for you and we haven’t heard from him. You know I wouldn’t reach out if this wasn’t important. Hope you’re good.  CUT TO, Jeff hanging up the phone, looking pensive. Rio looks at him.  SEQ. 1700 - UNCLE AARON IS THE PROWLER “UAP” INT. UNCLE AARON'S APARTMENT - CONTINUOUS  Miles WRITES A NOTE: MILES (V.O.)  Dear Uncle Aaron, I gotta do something and I don’t know if I can do it. I’m scared man. I’m just tired of letting everybody down. You’re the only one I can talk to. I just wish you were here.  89.",
      "characters": [],
      "action_text": "--Miles stops writing when he hears a NOISE on the fire escape. Uncle Aaron? As the figure gets closer, the silhouette becomes clear: THE PROWLER. Terrified, Miles scrambling to hide. The PROWLER enters -- but FREEZES. Something feels wrong. Remembering, Miles LOWERS HIS SPIDER-MAN mask.  PROWLER'S POV:   He looks to the sofa, then around the room again, as if sensing something. He pads quietly, towards where Miles is hiding. Miles sits frozen, not daring to breathe. The Prowler is there, inches from Miles' invisible face. Prowler’s PHONE RINGS and he answers. PROWLER Hello, Mr. Fisk. I’ve got the security tapes from the tunnel right here. If the kid’s out there, I’ll find him.  Prowler lifts his mask, revealing himself as AARON . UNCLE AARON You know me, sir. I don’t ever quit. Miles' eyes go wide. He GASPS and slowly backs away-- ---Aaron's head snaps up at the sound. He looks around the room and puts his mask back on... Aaron sees the blur, following to the window--  EXT. UNCLE AARON'S ALLEY - INTERCUT  --Miles, as Spider-Man DROPS FROM THE LADDER -- Prowler in pursuit, LEAPING FROM THE FIRE ESCAPE.  SEQ. 1725 - PURSUIT OF SPIDER-MAN “POS” EXT. BROOKLYN STREETS  Miles RUNS, the Prowler in pursuit on his motorcycle. In the middle of traffic, Miles sees that he seems to have lost Prowler. But Prowler follows from the rooftops, watching where Miles goes. 90. SEQ. 2850 - HE CAN’T BE A BAD GUY “CBG” INT. PETER PARKER'S LAB  Peni and SP//dr finish making a new goober.  INT. AUNT MAY'S HOUSE - LIVING ROOM  Noir lays on the couch, examining a Rubiks Cube. Peni hands Peter the new goober. He hangs it around his neck with a lanyard. SPIDER-MAN NOIR (to Ham) This is purple. SPIDER-HAM No. SPIDER-MAN NOIR Blue? SPIDER-HAM No. GWEN Has anyone heard from Miles? PETER Look, he’s just clearing his head. I know the kid. He’s got what it takes. I bet you he’s going to come back through that door recharged and ready to fight. Gwen stares at Peter, not believing a word he’s saying. ",
      "dialogue_count": 0,
      "word_count": 7895
    }
  ]
}