{
  "slug": "spotlight-2015",
  "title": "spotlight",
  "genre": "drama",
  "format": "film",
  "scenes_count": 18,
  "characters_count": 1,
  "characters": [
    "SAVIANO"
  ],
  "total_words": 25736,
  "total_dialogue": 1,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. POLICE STATION, BOSTON - NIGHT, 1976 1   1  A quiet, cold winter night.   An OLDER COP emerges from an  INTERVIEW ROOM, walks down a long hall.  Boston, MA - December, 1976  He reaches the front desk.   A YOUNG COP looks to him,  curious, as he lights a cigarette.  YOUNG COP  How’s that going?  OLDER COP  The mother’s bawling and the uncle’s  pissed off.  YOUNG COP  She’s not married?  OLDER COP  Divorced with four kids. I guess  Father was helping out.  YOUNG COP  Helping out?  The Older Cop shrugs. The front door opens and BURKE, FRESH  FACED, 32, walks in.   He wears a dark overcoat.  OLDER COP  Hey, Mr. Burke.   They’re in the back  talking to the Bishop.  BURKE  And Father?  The Older Cop nods in the other direction.  OLDER COP  We put him in the break room.  BURKE  Any press?  OLDER COP  Some guy from the Citizen, but we  sent him away.   None of the big  papers.  BURKE  Let’s keep it that way.  Burke walks toward the interview room.",
      "characters": [],
      "action_text": "YOUNG COP  (off Burke)  Who’s that?  OLDER COP  Assistant DA.  YOUNG COP  Gonna be hard to keep the papers  away from the arraignment.  OLDER COP  What arraignment?  He’s matter of fact.   The young cop reacts, looks towards the  PRIEST (GEOGHAN) sitting in the break room.  OLDER COP (O.C.) (CONT’D)  You can tell Father Geoghan it won’t  be much longer.  OMITTED 2   2  INT. POLICE STATION, INTERVIEW ROOM - MOMENTS LATER 3   3  A BISHOP, 50s, talks in hushed tones with SHEILA, 33.   TWO  BOYS, 7 and 9, sit coloring.  BISHOP  Sheila, you know what good work the  church does in the community.   I  give you my personal guarantee that  I’m going to take Father out of the  parish and this will never happen  again.  Burke enters, eyes Sheila nervously fingering ROSARY BEADS.  BISHOP (CONT’D)  We’ll just be another moment, Paul.  BURKE  Of course, Father.  The Bishop turns back to Sheila.   Burke eyes the kids.  BISHOP (O.C.)  Now Sheila, I’m going to give you my  personal card...  11/26/14   2.",
      "dialogue_count": 0,
      "word_count": 339
    },
    {
      "scene_number": 2,
      "slugline": "EXT. POLICE STATION - LATER 4   4  The Young Cop stands outside smoking.   He watches as the  Bishop and Father Geoghan exit the police station and get  into a TOWN CAR, a DRIVER behind the wheel.   As they drive  away, we HOLD ON the cop.   PROCESSING.  FADE TO BLACK.  SPOTLIGHT  FADE IN:  INT. BOSTON GLOBE, NEWSROOM - DAY, 2001 6   6  A large newsroom.   REPORTERS and EDITORS gathered.  Boston, MA - July, 2001  DEPUTY MANAGING EDITOR   BEN BRADLEE JR. , 50s, gruff, stands in  front with an older reporter, STEWART, 60s.   And a cake.  BEN  Losing good reporters, it’s tough.  And losing one of our best... well  to put it as eloquently as I can,  it’s a real kick in the ass.  A few polite chuckles from those in the crowd.  BEN (CONT’D)  But Robby’s known Stewart longer  than most of you have been alive so  I’m gonna turn it over to him.  Robby?  Ben looks to   WALTER ‘ROBBY’ ROBINSON , 55, Boston Everyman.  ROBBY  Thanks, Ben.   I think.   And although  I take issue with the reference to  my seniority, I will say Stewart’s  departure is especially painful for  me.   You see, for... what? 20 years  now, Stewart’s been more than  willing to part with his money at  the poker table...  (Laughter)  And I got a kid in college.  More laughter.  STEWART  Yeah, but I’m gonna keep playing.  11/26/14   3.",
      "characters": [],
      "action_text": "ROBBY  Problem solved.   Godspeed, buddy.  Everyone’s laughing now.   Robby connects in a warm, easy way.  ROBBY (CONT’D)  Now, Stewart, I find the timing of  your departure a bit disconcerting.  The corner office sits empty, the  new editor arrives on Monday, so  forgive me, buddy, but I gotta  ask... what the hell do you know?  The room hoots and laughs.   Stewart covers his mouth. Speak  no evil.   More laughter takes us to...  INT. GLOBE, HALL/STAIRWELL - LATER 7   7  SACHA PFEIFFER , 28, wholesome, no bullshit, and   MATT CARROLL ,  mid 40s, mustache, family man, walk down the hall, into a  stairwell and down a set of stairs, both carrying cake.  INT. GLOBE, HALL OUTSIDE SPOTLIGHT - MOMENTS LATER 7A   7A  They emerge on the floor below, Sacha eating her cake.  MATT  How’s the cake?  SACHA  It’s really good.   Saving yours?  MATT  Nah, it’s for Mike.   I can never eat  at those things.   They kind of  depress me.  SACHA  I know.  (taking a bite)  You see the numbers from Washington?  MATT  Yeah.   Very interesting.  SACHA  I think so too.  They walk into --  INT. GLOBE, SPOTLIGHT OFFICE - CONTINUOUS 8   8  CRAMPED OFFICE.   Small windows.   MIKE REZENDES , late 30s,  good looks, so-so haircut, sits at his UNHOLY MESS of a desk.  11/26/14   4. MIKE (INTO PHONE)  Uh huh. Uh huh. Uh huh.   Dan, I  talked to my guy at Justice, I know  you guys have been dropping cases...  (then)  Look, Dan, I’m not asking if the  PD’s lying, I know they are.   All  I’m asking is who’s behind it?  Matt sets the cake by Mike, sits at a desk full of FAMILY  PHOTOS.   Sacha checks messages at a tidy desk, full of books.  MIKE (INTO PHONE) (CONT’D)  I get it.   You don’t want to talk.  (listens)  I’m not mad, Dan, I’m hungry. We’ve  been talking so long, I missed  lunch.   So I’m going to go eat,  which gives you an hour to decide if  you want to be on the right side of  this or read about it in the paper  like everyone else.  Mike hangs up the phone, digs into the cake.  SACHA  You thin",
      "dialogue_count": 0,
      "word_count": 2717
    },
    {
      "scene_number": 3,
      "slugline": "INT. SACHA’S GRANDMOTHER’S HOUSE, KITCHEN - NIGHT 22   22  Hansi and Sacha wash dishes.   They talk quietly.  HANSI  You gonna tell her?  SACHA  We don’t even know if there’s a  story yet.  HANSI  “Globe sues church?”   There’s gonna  be a story.  Sacha continues rinsing, glances at the small, porcelain  Virgin Mary on the window sill above the sink.  INT. GLOBE, LARGE PUBLISHER’S FOYER - DAY 23   23  Marty ascends a large, open air staircase in the upscale  business side of the building.   He steps off, heads down the  hall then stops, looks around.   Lost in his own building.  A YOUNG EMPLOYEE walks past.  MARTY  Excuse me, do you know where the  Publisher’s office is?  The employee points.   Marty heads that direction.  INT. GLOBE, PUBLISHER’S OFFICE - DAY 24   24  RICHARD GILMAN, 50s, Brooks Brothers suit, finishes a call.  Marty is sitting on a couch in large, plush office opposite.  GILMAN (INTO PHONE)  Thanks, Tom.   Will do.  (hangs up, to Marty)  How are you, Marty?   Settling in?  MARTY  Yes, I think so.  GILMAN  Good. What can I do for you?  MARTY  I’d like to challenge the protective  order in the Geoghan case.  GILMAN  You want to sue the Catholic Church?  11/26/14   19.",
      "characters": [],
      "action_text": "MARTY  We’re just filing a motion. But yes.  GILMAN  You think it’s that important?  MARTY  Yes.   I do.  GILMAN  Because, obviously, the Church will  fight us very hard on this.   Which  won’t go unnoticed by our subscriber  base.   53% of them are Catholic.  MARTY  Uh, I think they’ll be interested.  Gilman considers for a long moment, looks unsettled.  GILMAN  Okay.  Marty nods, gets up to go.  GILMAN (CONT’D)  Marty?   Lake Street will probably  contact you about a face to face  with the Cardinal.   It’s customary.  MARTY  They already have. It’s set up for  next week.  GILMAN  I wouldn’t mention this.  INT. GLOBE - DAY 24A   24A  Matt walks down a row of cubicles, disappears down a spiral  staircase.  INT. BOSTON GLOBE LIBRARY - CONTINUOUS 24B   24B  Matt descends the staircase and arrives at the front desk.  MATT  Hey Lisa. Could you pull all the  relevant clips on that for me?  He hands her a sheet of paper.   She looks at it.   Reacts .  LISA  Yeah.   This is for Spotlight?  11/26/14   20. MATT  Just drop them off when they’re  ready, thanks.  Matt walks off.  INT. MITCHELL GARABEDIAN’S OFFICE - DAY 25   25  Mike steps off an elevator and into a DUMP of an office.   He  eyes a small reception desk covered with FILE BOXES.  MIKE  Hello.   Hello?  Mike peeks through an open door... a small office, crammed  FLOOR TO CEILING with BOXES, each with   GEOGHAN   written on it.  PARALEGAL  Can I help you?  Mike turns.   A PARALEGAL pokes her head out of a cubicle.  MIKE  Oh. Hi. I’m Mike Rezendes from the  Boston Globe. I’m here to see  Mitchell Garabedian.  PARALEGAL  He’s on a call. Please have a seat.  Mike grabs a seat, checks his watch.   He hears YELLING coming  from behind a closed door.   Garabedian?  INT. ONE INTERNATIONAL PLACE, LOBBY - DAY 26   26  Robby and Sacha stride across an enormous, marble and stone  lobby, a STARK CONTRAST to Garabedian’s digs.  OMITTED 27   27  INT. GREENBERG TRAURIG, CONFERENCE ROOM - DAY 28   28  ERIC MACLEISH , 40s, good looks",
      "dialogue_count": 0,
      "word_count": 924
    },
    {
      "scene_number": 4,
      "slugline": "INT. GARABEDIAN’S OFFICE, CONFERENCE ROOM - CONTINUOUS 30   30  A small boardroom.   MITCHELL GARABEDIAN , thin, 50s, sits at a  table buried in paperwork.   He’s abrasive, to say the least.  MIKE  Hi.  GARABEDIAN  Who are you?  MIKE  Mike Rezendes from the Boston Globe.  I had an appointment with you about  an hour ago.  GARABEDIAN  I can’t talk to you, I’m very busy.  (calling to reception)  Sharon?!  MIKE  Sharon went out for coffee, she said  she’d be right back, I’m following  up on an article...  GARABEDIAN  The one in the Phoenix?  MIKE  No. In the Globe.  GARABEDIAN  Did you see the one in the Phoenix?  MIKE  No, I didn’t.  GARABEDIAN  I thought it was very good. I have a  copy here somewhere.  He starts to dig through the heap of papers.  MIKE  That’s okay. I’ll track it down. I’m  actually following up on a column  that Eileen McNamara wrote for the  Globe about your suit.  GARABEDIAN  Suits. There are eighty-four of  them, it’s not a class action.   You  should get your facts straight.  11/26/14   24.",
      "characters": [],
      "action_text": "True to word.   Garabedian is a bit of crank.  MIKE  You’re right. I should.   I’m just  trying to get some background  information on the Geoghan case...  GARABEDIAN  You’re not recording this are you?  MIKE  No, I wouldn’t do that without  asking.  GARABEDIAN  (brusque)  I can’t show you the Church  documents if that’s what you’re  after, they’re under seal.  MIKE  I know that.  GARABEDIAN  Do you know they’ve tried to bring  me before the Massachusetts Board of  Bar Overseers three times?   They’re  watching me very closely.  MIKE  The Church?  GARABEDIAN  Yes, the Church.   They’d like to get  me disbarred.   In fact, put that  away.  (off Mike’s pad)  Put it away!   I don’t want you  recording this in any way, shape or  form.   Not on paper, not on tape,  nothing.   In fact, I probably  shouldn’t even be speaking to you.  MIKE  Look, Mr. Garabedian, I know there  are things you can’t tell me.   But I  also know that there’s a story here.  And I think it’s an important story.  GARABEDIAN  I already talked to the Phoenix.  11/26/14   25. MIKE  Yeah, and there’s a reason I didn’t  see it, nobody reads the Phoenix  anymore.   They’re broke, they don’t  have any power.   The Globe does.  And if we cover this story,  everybody will hear about it.  GARABEDIAN  The Church thinks in centuries, Mr.  Rezendes.   You think your paper has  the resources to take that on?  MIKE  Yeah, I do.   But if you don’t mind  me asking, do you?  Mike’s question is non-threatening, but Garabedian reacts.  He stands, walking Mike to the door...  GARABEDIAN  I don’t have the time to talk to  you, Mr. Rezendes, I’m very busy.  (calling out)  Sharon!  But before he can push Mike out the door, Mike turns back --  MIKE  Can I at least talk to some of your  clients?   The victims?   I’d like to  do that.  GARABEDIAN  Call me tomorrow. I need to think  about it.  INT. GLOBE, LIBRARY - DAY 31   31  A Button is pushed, CONTROL PANEL lights up.  A rotating library clip file comes to stop.  A few ol",
      "dialogue_count": 0,
      "word_count": 898
    },
    {
      "scene_number": 5,
      "slugline": "EXT. FENWAY PARK - NIGHT 34   34  Establishing.   From up above, a game in progress.  INT. FENWAY PARK - NIGHT 34A   34A  Mike and Matt sit with Ben and Steve Kurkjian at the game.   A  called third strike and the crowd groans.  BEN  Jesus.   Has anybody but Manny gotten  the ball out of the infield?  Matt, who’s been scoring the game, checks.  MATT  Nope.  MIKE  I don’t know why you bother with  that thing.  MATT  It distracts me from the game.  KURKJIAN  Know what else is good for that?  Kurkjian holds up an empty beer cup.   Matt stands.  MATT  Good idea.   My round.   I’ll be back.  Anybody want food?  MIKE  Hot dog.  Matt heads off.   Ben grabs some peanuts, turns to Mike.  BEN  You guys making any progress?  MIKE  Absolutely.   It’s a good story.  BEN  Why?   Cause you’re another lapsed  Catholic pissed off at the Church?  MIKE  We’ve got some good stuff.  BEN  Like what?  11/26/14   29.",
      "characters": [],
      "action_text": "Mike glances over at Kurkjian.  KURKJIAN  I’m just watching the game.   Omerta.  MIKE  We got another priest, Liam Barrett.  KURKJIAN  We reported on him.  (off Mike’s look)  We did, I’m just saying.  MIKE  Okay, but the guy was shuffled from  parish to parish every few years,  just like Geoghan and Porter.   I  think there’s a pattern.  Ben looks at Kurkjian, who’s not impressed.  BEN  Sounds thin.   What else you got?  MIKE  Sacha found this guy from a victims’  organization, Phil Saviano.  KURKJIAN  From SNAP?   Oh boy.   We reported on  him too.  MIKE  I thought you were watching the  game, Steve?  KURKJIAN  That guy’s pretty banged up, Mike.  BEN  We ran a couple stories on him, the  guy would not stop writing letters.  KURKJIAN  He wants a holy war.  MIKE  So he’s not worth taking to?  BEN  Where are you on Garabedian?  MIKE  I’m working on it.  11/26/14   30. BEN  Robby said MacLeish thinks he’s  bluffing.  MIKE  I think there’s something there,  Ben.  BEN  Get me something solid or I'm taking  you off it.   I don’t want us chasing  our tails on this.  Off Mike --  EXT. WOLLASTON GOLF CLUB, 8TH TEE, MILTON, MA - DAY 37   37  JIM SULLIVAN, 50s, lines up a tee shot.   Smacks it.   ROBBY  and TWO OTHER GOLFERS watch as Jim talks to his ball...  JIM  Stay away from that trap.  ROBBY  You couldn’t reach that trap in a  million years, partner.  One of the other golfers (PAUL) tees up his ball.  JIM  I’ve reached that trap before.  ROBBY  Yeah.   Now Paul, maybe.  The group laughs.  EXT. WOLLASTON GOLF CLUB, 8TH HOLE FAIRWAY - DAY 38   38  Robby and Jim walk down the fairway.   Robby checks the card.  JIM  How we doing?  ROBBY  We’re good.   We’re two up.  JIM  Good.  (then)  How’s the new editor working out?  11/26/14   31. ROBBY  Well, he doesn’t like baseball.   But  he seems like a smart guy.  JIM  Yeah, I just read an article about  him.   Said he’s the first Jewish  editor at the Globe.  ROBBY  Must have been a slow news day.  JIM  He got a family?  ROBBY  No,",
      "dialogue_count": 0,
      "word_count": 771
    },
    {
      "scene_number": 6,
      "slugline": "EXT. MATT CARROLL’S HOUSE, WEST ROXBURY - SUNDAY MORNING 40   40  Matt, in coat and tie, shepherds his family out the door and  into a minivan.   His wife and daughter wear DRESSES, his sons  are in BLUE BLAZERS and KHAKIS --   clearly en route to church .  PRIEST (PRELAP)  The other day I was on the world  wide web.   Anything you want to  know. It’s right there.  INT. CHURCH, SOUTHIE - DAY 41   41  Sunday mass.   Full house.   A PRIEST mid homily. In back, FIND  Sacha, her husband, HANSI, and her GRANDMOTHER.  PRIEST  Now as a priest, I admit, this makes  me a little nervous. Should I be  worried about job security?  Sacha watches her grandmother laugh with the congregation.  EXT. CHURCH/INT. DINER, SOUTH BOSTON - DAY 42   42  CONGREGANTS milling outside a church.  PRIEST (O.C.)  I don’t think so.   You see knowledge  is one thing.   But faith is another.  FIND Marty, sitting in a diner across the street, eating  breakfast and reading.   He glances at the church.  EXT. OLD HARBOR, DORCHESTER - DAY 42A   42A  Mike, in running gear, runs along the water.  OMITTED 43   43  INT. GLOBE, NEWSROOM - LATER 44   44  Mike walks through the mostly empty newsroom.  INT. GLOBE, SPOTLIGHT OFFICE - DAY 45   45  Mike walks in, grabs a gym bag by his desk, pulls out a towel  when he spots... Robby.   Sitting in his office.   Working.  INT. GLOBE, ROBBY’S OFFICE - MOMENTS LATER 46   46  Robby’s looking over some of the clips Matt pulled.  11/26/14   34.",
      "characters": [
        "SAVIANO"
      ],
      "action_text": "MIKE  Hey.   Shouldn’t you be golfing?  Robby looks up.   Mike’s in the door, towel around his neck.  ROBBY  Golfing’s not a verb.   And I  couldn’t get a tee time today.  MIKE  Is that what they call it?   A tee  time?  ROBBY  They also call it a leisure  activity.   You should try it, Mike.  MIKE  I run.  ROBBY  You run to work.  Mike shrugs, true.   He eyes the clips on Robby’s desk.  MIKE  So what are you doing here today?  ROBBY  Looking at clips.   On Saviano.  MIKE  Ben and Steve think he’s a dead end.  They gave me a bunch of crap about  it at the game.  ROBBY  Yeah, Ben emailed me.  MIKE  He did?  ROBBY  Yeah.   He said we should let it go.  MIKE  What do you wanna do?  ROBBY  Bring Saviano in.  MIKE  So   just   ignore those guys?  11/26/14   35. ROBBY  I think we have to start ignoring  everybody on this one.  MIKE  I’m good with that.  (then)  You think Baron has any idea what’s  coming down the Pike?  ROBBY  No.   I don’t think he cares either.  MIKE  That’s refreshing.  ROBBY  Yeah.   Unless he’s wrong.  Mike registers this.  EXT. LAKE STREET , CARDINAL’S RESIDENCE   - DAY 47   47  An Audi A4 pulls up in a large parking lot.   Marty gets out,  looks up at the Cardinal’s MASSIVE LAKE STREET MANSION.  CARDINAL LAW (PRELAP)  I’ve always been fascinated with the  newspaper business.  INT. LAKE STREET, CARDINAL LAW’S PRIVATE STUDY - DAY 48   48  Mahogany bookshelves, leather furniture.   CARDINAL LAW,  large, 50s, wears a collar and sits across from Marty.  CARDINAL LAW  I used to sit in on lectures with  the Nieman fellows when I was at  Harvard.  MARTY  I, uh, read you were an editor once.  Law chuckles.  CARDINAL LAW  Yes.   A very long time ago.   The  Mississippi Register.   Small,  diocesan newspaper, but for a 30-  year-old pastor it was a big  responsibility.   Too much at times.  MARTY  How so?  11/26/14   36. CARDINAL LAW  I was close with the Evers brothers,  we took a stand on civil rights.  Our readership was not pleased.  They saw me as a medd",
      "dialogue_count": 1,
      "word_count": 3805
    },
    {
      "scene_number": 7,
      "slugline": "INT. NANA’S HOUSE - LATER 62B   62B  Sacha is alone at the dining room table.  ROBBY (INTO PHONE)  Guess he forgot to mention that.  SACHA (INTO PHONE)  I’m gonna go to the courthouse  tomorrow to see if I can find any  cases he settled against the church.  ROBBY (OVER THE PHONE)  Call me after you do.   Good work.  Robby hangs up.   Sacha sits there, spent, the day and the  story LANDING on her.   Hard.  INT. GLOBE, BEN’S OFFICE - NIGHT 63   63  Ben packs up.   A KNOCK.   He turns, finds Robby with his bag.  ROBBY  You wanted to chat?  BEN  I’m late for a dinner. Walk me out.  INT. GLOBE, NEWSROOM - CONTINUOUS 64   64  Ben and Robby walk.   Robby sees Marty in his office, working.  ROBBY  Does he ever go home?  BEN  Apparently not.   I got guys who  won’t leave ‘til he does, he’s  wearing out the goddamn newsroom.  Robby smiles.  BEN (CONT’D)  Where are we on Geoghan?  ROBBY  Following up with more victims.   I  want to expand the investigation.  BEN  Why?  11/26/14   54.",
      "characters": [],
      "action_text": "ROBBY  We got a fourth priest.   There might  be as many as thirteen.  BEN  Thirteen?   Who’s your source?  ROBBY  Phil Saviano.  Ben stops.  BEN  Christ, Robby, I told Mike --  ROBBY  I know.   I think Saviano might be  legit, Ben.  BEN  You wanna elaborate on that?  ROBBY  No.   Not yet.   Just   feels like this  is stacking up.   That’s my gut.  Robby doesn’t embellish.   The case is turning.  BEN  Okay.  ROBBY  Good.   Thanks.  Robby walks off.   Ben watches him go... then heads out --  INT. MIKE’S APARTMENT, EAST BOSTON - NIGHT 65   65  Mike opens the fridge when his phone RINGS.   He picks up.  MIKE (INTO PHONE)  Hello.  SIPE (OVER THE PHONE)  Mr. Rezendes?  MIKE (INTO PHONE)  Yeah.   Who’s this?  SIPE (OVER THE PHONE)  It’s Richard Sipe.  11/26/14   55. MIKE (INTO PHONE)  Oh, hey Richard, thanks for calling.  Phil Saviano gave me your name, can  I ask you a few questions?  SIPE (OVER THE PHONE)  Of course.  Mike reaches for his bag, pulls out his pad and a pen.  MIKE (INTO PHONE)  Great.   So Phil said you worked at  one of the church’s treatment  centers in Baltimore...  SIPE (OVER THE PHONE)  Yes, that’s right.   The Seton  Psychiatric Institute.   It was run  by the Daughters of Charity.  MIKE  And when was that, Richard?  SIPE (OVER THE PHONE)  Well, I started my psychotherapy  fellowship there in 1965 and I was  there for five years, but I spent  the next thirty studying abusive  priests and their victims.  MIKE  Really?   That’s been your sole  focus?  SIPE  Look, Mike, the church wants us to  believe that it’s just a few bad  apples, but it’s a much bigger  problem than that.  MIKE  How much bigger?  SIPE  Well, based on the research, I would  classify it as a recognizable  psychiatric phenomenon.  As Mike starts scribbling, sucked back in...  MIKE  That’s big.  11/26/14   56.",
      "dialogue_count": 0,
      "word_count": 481
    },
    {
      "scene_number": 8,
      "slugline": "INT. GLOBE, CAFETERIA - LATE MORNING 66   66  Eileen reads the paper, drinks a diet coke.   Kurkjian sits  nearby, working on a story and some eggs.   Matt joins.  MATT  Hey Mac, if I needed historical data  on a priest, parishes he’d been  assigned to, where would I find it?  EILEEN  For Geoghan?   It’s all in the clips.  Lisa has the source material.  MATT  Yeah, what if it was another priest?  One that hadn’t been in the papers.  EILEEN  You’re looking at another priest?  KURKJIAN  Who’re you looking at?  Kurkjian looks over.   Matt tries to focus on Eileen.  MATT  Any ideas?  EILEEN  Come on Matt, you’re not going to  tell me?  Matt stares at her.   Then pulls back.  MATT  I gotta get to a meeting. Thanks  Mac.  Matt beats a hasty retreat.   Eileen and Kurkjian trade a  look.   Huh .  INT. GLOBE, LIBRARY - LATER 67   67  A HAND pulls a BOOK off a reference shelf.   FIND LISA TUITE,  handing Matt the 2001 CATHOLIC CHURCH DIRECTORY.  LISA TUITE  The Archdiocese puts out an annual  directory, every priest and parish.  MATT  This is great.   Do these go back any  further than ‘98?  11/26/14   57.",
      "characters": [],
      "action_text": "LISA TUITE  Oh yeah.   They go back to the 80’s  in the Mez.   Beyond that, you gotta  go to the BPL.  MATT  In the Mez.   Thanks, Lisa.  INT. GLOBE, LONG HALLWAY - DAY 68   68  Robby and Mike walk down the hall.   Mike debriefs him, a  little manic, not unaffected by what he’s picked up.  MIKE  He said they all target the same  kinda kid.   Low income family,  absentee father, broken home...  They walk into --  INT. GLOBE, PRESSES - CONTINUOUS 69   69  It’s early.   The presses are relatively quiet.  MIKE  And guys like Geoghan go after boys  not cause they prefer them, but  cause they’re more ashamed, less  likely to talk.   These guys are  predators, Robby.   Sipe says he saw  dozens of them at Seton in the 60’s.  He called it a “a phenomenon.”  ROBBY  Why didn’t he go public?  MIKE  He did, but the church has made a  huge effort to discredit him.   Smear  campaigns, public statements by  prominent bishops.   It’s just like  Saviano said.   And Garabedian.  ROBBY  You getting anywhere with him?  MIKE  More victims.  ROBBY  You can’t empty his pockets?  11/26/14   58. MIKE  I’ll get him.   I just need more  time.  ROBBY  Come on, Mike, you gotta get him.  MIKE  I’ll get him, I’ll get him.  They open a door, walk into --  INT. GLOBE, BASEMENT - CONTINUOUS 70   70  A dank basement, low fluorescents and rows of old books on  cheap tin bookshelves.   Robby and Mike react to the smell.  MIKE  Jeez, what the hell is that smell?  MATT (O.C.)  There’s a dead rat in the corner.  Mike and Robby find Matt beside a HUGE STACK OF BOOKS.  ROBBY  What do we got?  MATT  Church directories.   It’s every  priest in Massachusetts, what parish  they’re assigned to...  MIKE  These are official?  Mike and Robby grab directories, flipping through.  MATT  Yeah.   I figured they could help us  track down the priests Saviano  mentioned, maybe find more victims.  ROBBY  (reads, squinting)  Can we turn on some more lights?  MATT  I couldn’t find the switch.   You  wanna borrow my glasses?  R",
      "dialogue_count": 0,
      "word_count": 1695
    },
    {
      "scene_number": 9,
      "slugline": "INT. ARMENIAN DINER, DOWNTOWN BOSTON - NIGHT 76   76  CLOSE ON a bowl of soup.   HANDS reach for it... REVEAL  Garabedian and Mike having dinner.   Mike’s going over notes.  MIKE  You said there was a victim who  filed a criminal complaint?  GARABEDIAN  There were a few, but the judge  sealed the case records after  friends of the Church stepped in.  The Church has a lot of friends .  MIKE  Like Eric MacLeish?  Garabedian sees he understands.   Garabedian’s impressed.  GARABEDIAN  Let’s just say, he’s not part of the  solution.   You follow what I’m  saying?  MIKE  Sure.  Mike jots down some notes.   Garabedian watches him.  GARABEDIAN  You work hard, Mr. Rezendes.   Are  you married?  MIKE  Yeah.  GARABEDIAN  And your wife doesn’t mind you  working all the time?  MIKE  Yeah, she does.  GARABEDIAN  See.   That’s why I never got  married.   I’m too busy, what I do is  too important.  Garabedian salts his soup.  GARABEDIAN (CONT’D)  Your new editor, he’s a Jew right?  11/26/14   67.",
      "characters": [],
      "action_text": "MIKE  Uh, that’s right.  GARABEDIAN  He comes in, suddenly everybody is  interested in the Church.   You know  why?   Because it takes an outsider.  Like me.   I’m Armenian.   How many  Armenians do you know in Boston?  MIKE  Steve Kurkjian, works at the Globe.  GARABEDIAN  That’s two! You should get a prize  or something. What are you, Italian?  MIKE  Portuguese.  GARABEDIAN  From where?  MIKE  East Boston.  GARABEDIAN  You don’t sound like it.  Mike shrugs. Garabedian shakes his head, chuckles.  GARABEDIAN (CONT’D)  This city, these people, making the  rest of us feel like we don’t  belong.   But they’re no better than  us .   Look how they treat their  children.  (wiping his mouth)  Mark my words, Mr. Rezendes, if it  takes a village to raise a child, it  takes a village to abuse one.  Garabedian eats.   Mike ponders.   Oddly moved.  INT. COPLEY SQUARE BALLROOM, ATRIUM - NIGHT 77   77  Robby crosses the room, joins Jim Sullivan at the bar.  JIM  There he is.  They two men shake.  11/26/14   68. JIM (CONT’D)  Wanna beer?  ROBBY  Love one.  Jim nods to the bartender.  JIM  You here with Barbara?  ROBBY  No.   She hates these things.  JIM  Karen too. Smart ladies.  The bartender sets down two beers.   Robby hands one to Jim.  ROBBY  Sláinte.  JIM  I just met your new editor, seems  like a decent fella.  ROBBY  I think he is.  (then)  I had an interesting conversation  with Eric MacLeish yesterday.   Turns  out he’s been settling abuse cases  with the archdiocese for years.  JIM  You really wanna talk about this  here?  ROBBY  You said you helped out on Father  Barrett as a favor, that was a one-  off?  Jim doesn’t say anything.   Robby DARKENS.  ROBBY (CONT’D)  How many of these cases have you  been involved with, Jim?  JIM  You know I can’t answer that, Robby.  It’s unethical.  11/26/14   69. ROBBY  Is that all it is?  Jim stares Robby down.   He drinks.  JIM  So this is the Robby Robinson I’ve  always heard about but never met.  ROBBY  Listen to me, Jimmy.   You w",
      "dialogue_count": 0,
      "word_count": 1048
    },
    {
      "scene_number": 10,
      "slugline": "INT. GLOBE, BEN’S OFFICE - DAY 80   80  Ben eats lunch, Robby and Mike download him.   Ben’s shocked.  BEN  Ninety fucking priests?   In Boston?  ROBBY  That’s what he said.  BEN  If there were ninety of these  bastards people would know.  MIKE  Maybe they do.  BEN  And no one said a thing?  MIKE  Good Germans?  BEN  I don’t think that’s a comparison  you want to make publicly.  ROBBY  MacLeish knew and said nothing.  BEN  That’s thirteen priests, big  difference between thirteen and  ninety.   Where’s this guy Sipe  getting his numbers?  MIKE  He’s studied this for thirty years,  he’s a trained psychotherapist --  BEN  Okay, but we need something more  than a metric from some hippy ex-  priest who’s shacking up with a nun.  MIKE  So we’ll track down more victims,  we’ll get more priests.   Then we can  check them against the directories.  BEN  That’s a shitload of victims.  11/26/14   73.",
      "characters": [],
      "action_text": "MIKE  We’ll get them.  BEN  How long’s it gonna take?  Mike shrugs.   Robby considers.   Then...  ROBBY  Too long.  Robby gets up, moves for the door.   Maybe with an idea.  BEN  Meeting over?  ROBBY  For now.  INT. GLOBE, NEWSROOM - MOMENTS LATER 81   81  Robby walks through the newsroom.   Mike catches up to him.  MIKE  What do you got?  ROBBY  What if we work backwards?  MIKE  What do you mean?   From what?  ROBBY  The directories.   We’ve been using  them to confirm bad priests.   What  if we do it the other way around?  MIKE  (getting it)  Use the directories to identify bad  priests?  ROBBY  Yeah, exactly.   We search by  designation, we look for any priest  on ‘sick leave’ or ‘unnassigned’ --  MIKE  Or for priests who moved around a  lot...  ROBBY  Yeah.  11/26/14   74. MIKE  That’s gonna take a load of time.  ROBBY  Not if we’re all on it.  MIKE  You too?  ROBBY  Generally, that’s what all means.  MIKE  Yeah, generally.  That’s the plan.   Robby looks set.   Off Mike, we --  INT. GLOBE, SPOTLIGHT - LATER 82   82  CLOSE ON   a ruler moving down a directory.   It stops at a  designation:   Sick Leave .   PAN TO the name of a priest.  MAHAN .   A pen circles it and we --  CUT TO   another ruler scanning a directory.   It stops.  Unassigned .   PAN TO the name of another priest.   KEANE .   The  name is circled and we --  CUT TO another ruler scanning.   Sick Leave .   PAQUIN .  REVEAL   Sacha, moving a ruler down a directory.   CUT TO   --  ABOVE   Mike, scanning a directory with a ruler.   CUT TO   --  CLOSE ON   Robby. Squinting at a directory.   CUT TO   --  Matt, hunched over a computer, entering data.   CUT TO   --  CLOSE ON   an excel spreadsheet.   A date, a priest’s name, then  the designation are typed into a column.   CUT TO --  More names and designations, logged year by year, into the  spreadsheet.   CUT TO --  INT. SACHA’S HOUSE - NIGHT 82A   82A  Sacha at her desk at home, scanning a directory.   It’s late.  INT. SANTARPIO’S, EAST BOSTON - NIGHT 8",
      "dialogue_count": 0,
      "word_count": 532
    },
    {
      "scene_number": 11,
      "slugline": "EXT. PORTER SQUARE T-STOP, CAMBRIDGE, MA - MORNING 84A   84A  Sacha waits for the T, working on a directory.  INT. GLOBE, LIBRARY - DAY 84B   84B  From the crow’s nest above, we see Mike and Matt at the table  in the library, stacks of directories between them.  INT. GLOBE, CAFETERIA - DAY 84BB   84BB  Robby sits alone in cafeteria, working on a directory.  EXT. BOSTON PUBLIC LIBRARY, DOWNTOWN BOSTON - DAY 84C   84C  Sacha walks up the grand steps, enters the massive library.  INT. GLOBE, SPOTLIGHT - DAY 84D   84D  CLOSE ON   the spreadsheet.   More names are entered.   We scan  down the growing list of priests...  INT. GLOBE, LIBRARY - NIGHT 84F   84F  Mike in a back aisle, works on the directories.  INT. BOSTON PUBLIC LIBRARY, READING ROOM - EARLY EVENING 85A   85A  A beautiful, mostly empty reading room, green banker’s lamps  everywhere.   Sacha works late, directories all around her.  INT. MATT CARROLL’S HOUSE, WEST ROXBURY - NIGHT 86   86  Matt sits at a desk at home, hunched over a directory,  scanning it with a ruler.   He pauses... leans in further.  CLOSE ON   a directory entry.   O’Sullivan.   Treatment Center,  276 Pelton Street, West Roxbury.  MATT  Holy shit.  Matt PALES, then takes off his glasses and leaves the house.  EXT. MATT CARROLL’S HOUSE, WEST ROXBURY - CONTINUOUS 87   87  Matt heads across the lawn, down the sidewalk.   He crosses  the street, rounds the corner, turning onto   Pelton Street .  He picks up his pace, checking house numbers.   Finally, he  stops at A CLASSIC, TWO STORY VICTORIAN HOUSE.   Number   276 .  MATT  No freakin’ way.  11/26/14   76.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 266
    },
    {
      "scene_number": 12,
      "slugline": "INT. MATT CARROLL’S HOUSE, KITCHEN - LATER 88   88  Matt sits on the kitchen floor in front of the refrigerator,  taping a note to the door.   We push in over his shoulder...  “ Kids. Stay away from this house at 276 Pelton Street. And  stay away from the men who live inside it .”  Beside the note is a B&W photo of the house down the street.  INT. GLOBE, SPOTLIGHT OFFICE - DAY 90   90  CLOSE ON a COMPUTER SCREEN.   We’re scrolling through the  EXCEL SPREADSHEET.   Dozens of problematic priests.  REVEAL Mike, Sacha and Matt huddled around the computer.  Sacha reads from a large printout.   Matt checks it against a  short list on a computer screen.  SACHA  Talbot.   MATT  Yep.  SACHA  Tivnan.   MATT  Yep.  SACHA  Toma.   MATT  Yep.  SACHA  Turnbull.   MATT  Yep.  SACHA  Walsh.   MATT  Yep.  SACHA  Welsh.   MATT  Yep.  MIKE  Is that it?  SACHA  That’s it.   MATT  That’s it.  Mike looks at the screen.  MIKE (CONT’D)  Holy Shit.  11/26/14   77.",
      "characters": [],
      "action_text": "MATT  Robby?  Robby looks up from his desk.   He walks over to join them.  SACHA  Three off Sipe’s estimate.   That’s  incredible.  ROBBY  How many?  MATT  Eighty-seven.  MIKE  Eighty-seven priests.   In Boston.  ROBBY  Call MacLeish. I wanna talk to him.  Robby takes the PRINTOUT,   walks into --  INT. GLOBE, ROBBY’S OFFICE - CONTINUOUS 91   91  Robby shuts his door, picks up his phone and dials.   It  rings.   A secretary picks up.  SECRETARY (OVER THE PHONE)  Jim Sullivan’s office.  ROBBY (INTO PHONE)  Walter Robinson for Jim Sullivan.  Tell him it’s important.  A beat, then we hear --  JIM (OVER THE PHONE)  Hey Robby.   Everything okay?  ROBBY (INTO PHONE)  I need you to tell me something,  Jim.   Could it be ninety priests?  JIM (OVER THE PHONE)  What?  ROBBY (INTO PHONE)  Could it be as high as ninety?  JIM (OVER THE PHONE)  Jesus, Robby.  11/26/14   78. ROBBY (INTO PHONE)  I need to know, Jim.   I wouldn’t be  asking if it wasn’t important.  Silence.  JIM (OVER THE PHONE)  You gotta stop this, Robby.  Click.   Robby darkens.   Then sees Sacha in the doorway.  SACHA  MacLeish’s assistant said he’s all  booked up, he can’t see us.  ROBBY  The hell he can’t.  Robby exits.   Sacha quickly follows.   Off Mike and Matt --  INT. ONE INTERNATIONAL PLACE, LOBBY - EARLY EVENING 92   92  Eric MacLeish and a colleague get off an elevator, head out.  MacLeish sees Robby and Sacha sitting in the lobby, waiting  for him.   As they stand, MacLeish turns to his colleague.  MACLEISH  You know what, I’ll catch up with  you, okay?  The colleague heads off.  MACLEISH (CONT’D)  Hey guys, I’m really sorry, I am, I  don’t have any time to talk right  now, but if you call my assistant --  SACHA  Mr. MacLeish, we have reason to  believe that there have been  allegations against as many as 87  priests in Boston.  ERIC MACLEISH  I can’t talk about that.  SACHA  Does that number sound right to you?  ERIC MACLEISH  You gotta be... I don’t have time  for this crap.  11/26/14   79. He start",
      "dialogue_count": 0,
      "word_count": 2851
    },
    {
      "scene_number": 13,
      "slugline": "INT. HAMPDEN SUPERIOR COURT, COURTROOM - DAY 108   108  Mike is still listing.  ALBANO  There’s nothing personal in these  documents, your honor, they concern  how the Cardinal is handling--  JUDGE SWEENEY  Say the Archdiocese.  ALBANO  Er, excuse me?  JUDGE SWEENEY  You don’t get to tag the Cardinal  with everything, Mr. Albano.   Say  the Archdiocese.  Albano looks flustered.  WILSON D. ROGERS JR.  Judge Sweeney, the Globe isn’t a  party to this case, they just want  to sell papers. If Mr. Garabedian  hadn’t smeared the Cardinal’s good  name, we wouldn’t even be here.  GARABEDIAN  Your honor, I object to the use of  the word smear.  JUDGE SWEENEY  Duly noted, Mr. Garabedian.  Garabedian, angry, mutters under his breath. Mike catches it.  EXT. HAMPDEN SUPERIOR COURT, SPRINGFIELD, MA - LATER 109   109  Garabedian sits on the courthouse steps, eating a packed  lunch out of tupperware.   Simmering.  MIKE  How you doing, Mitch?  Mike walks up, sits down.  GARABEDIAN  I’m fine.  MIKE  (pushing him)  He’s tough, that Wilson Rogers.  11/26/14   93.",
      "characters": [],
      "action_text": "GARABEDIAN  He’s smug.   And he’s sloppy.  MIKE  He doesn’t seem sloppy.  GARABEDIAN  You don’t know the half of it.  Trust me.  MIKE  What’s the half of it?  (then)  Tell me the half of it, Mitch.  Garabedian looks at him, wrestling with something.  GARABEDIAN  Off the record.  MIKE  Off the record.  GARABEDIAN  Three years ago, I get a call from  an ex-Priest.   Anthony Benzevich.  He was at Blessed Sacrament back in  ‘62 and he saw Geoghan taking little  boys up to the Rectory bedroom.  Benzevich was appalled, he told the  Bishop.   And the Bishop threatened  to reassign him.   To South America.  MIKE  Jeez.  GARABEDIAN  Yeah.   So, fast-forward 35 years,  Benzevich reads Geoghan’s been  charged with molesting more than a  hundred kids.   Benzevich feels  guilty, he calls me.  MIKE  You have testimony from a priest  telling his superiors about Geoghan  in 62’?  GARABEDIAN  No, I do not.   Because when I call  Benzevich in to give a deposition,  he shows up with a lawyer.  11/26/14   94. MIKE  Wilson Rogers.  GARABEDIAN  Suddenly, Father Benzevich has a  foggy memory. Can’t remember  anything.   He’s useless. So I go  back to work, I forget about it,  whatever.   Until about a year ago. I  find an article about a priest who  warned church officials about  Geoghan.  MIKE  (stunned)  Benzevich went to the press.  GARABEDIAN  Local paper, Patriot Ledger, nobody  saw it.   But now I got Benzevich on  record, so I file a motion to depose  him a second time.   And Wilson  Rogers, that smug son of a bitch, he  files a motion opposing my motion.  And that’s when I have him!  MIKE  Have him how?  GARABEDIAN  Rogers opposes my motion. So I gotta  make an argument as to why I’m  allowed to depose Father Benzevich a  second time.   But now, I’m allowed  to attach exhibits.   You follow what  I’m saying?  MIKE  The sealed documents...  GARABEDIAN  Yes, I can use the sealed documents  I’ve gotten in discovery, Mr.  Rezendes, the same documents your  paper is currently suing for",
      "dialogue_count": 0,
      "word_count": 719
    },
    {
      "scene_number": 14,
      "slugline": "INT. SUFFOLK COUNTY COURTHOUSE, RECORDS ROOM - DAY 111   111  A mousy looking CLERK #2 (O’BRIAN) pushes a BINDER across a  help desk to... Mike.   Who starts going through the file.  CLERK #2 (O’BRIAN)  Docket entry #49 in the Geoghan  case.  (then)  We’re closing in ten minutes.  CLOSE ON   DOCKET ENTRY #49 :   Plaintiff’s opposition to  Reverend Anthony Benzevich’s Motion for Protective Order .  Dated APR 2, 2001.   And a list of 14 exhibits .  Mike, excited, opens the file, finds the motion and a FOLDER,  EXHIBITS A - N.   Mike opens it.   It’s empty.   HOLY SHIT .  INT. ROBBY’S HOUSE, ROBBY’S HOME OFFICE - EARLY EVENING 112   112  Robby stands, searching through bookshelves... until he finds  a BC HIGH YEARBOOK.   He flips to the faculty page, homing in  on a PHOTO... FATHER JAMES TALBOT.   A beat.   His phone RINGS.  ROBBY (INTO PHONE)  Robby.  MIKE (OVER THE PHONE)  Hey, it’s me.   You’re not gonna  believe it.  EXT. SUFFOLK COUNTY COURTHOUSE, DOWNTOWN BOSTON - SAME TIME 113   113  Mike is walking out of the courthouse.  MIKE (INTO PHONE)  Garabedian gave me a tip, some of  the sealed docs are already public.  They’re part of a motion he filed.  He said they’re the best of the  bunch, we don’t have to wait for  Sweeney’s ruling.  INTERCUT THE TWO SCENES  ROBBY (INTO PHONE)  So we can get them?  MIKE (INTO PHONE)  Yeah, but they’re not there!   I  already talked to Albano, he said  all we have to do is file a motion  and Sweeney will order Mitch to  refile the docs.  11/26/14   97.",
      "characters": [],
      "action_text": "ROBBY (INTO PHONE)  And you think these documents are...  MIKE (INTO PHONE)  He said these 14 docs are all we  need.   They’re huge, Robby.  ROBBY  Okay.   I’ll call Ben.   Good work.  EXT. GLOBE, PARKING LOT - EARLY MORNING 114   114  Marty gets out of his car and walks toward the building. It’s  a beautiful September morning.  INT. GLOBE, NEWSROOM - MOMENTS LATER 115   115  It’s pretty empty.   Marty walks in, heads toward his office,  but slows when SOMETHING on a TV catches his attention.   He  walks to the TV, joins A YOUNG REPORTER already watching.  MARTY  What happened?  YOUNG REPORTER  They’re saying it’s a prop plane but  that’s not a prop plane.  We glimpse the TV.   The World Trade Center.   On fire.  MARTY  Tell Linda to get every reporter we  have in here now.  INT. GLOBE, NEWSROOM - DAY 116   116  CLOSE ON a TV.   Cardinal Law addressing a large group of  reporters, citizens in front of the Cathedral.  CARDINAL LAW (REAL FOOTAGE)  You pray for the injured, and those  who survived.   You pray, too, for  the nation, that our response might  reflect our best ideals and God’s  teaching as it is found in  Christianity   and Islam as well.  REVEAL a group watching TV in the corner of the newsroom, Ben  front and center.   Robby, Matt, Sacha are off to the side.  BEN  Not bad.   Who’s there?  11/26/14   98. FEMALE EDITOR  Paulson.  Ben starts to move, an editor at his side.  BEN  I wanna talk to him when he’s back.  (to Robby)  Did Rezendes find a way to get to  Florida?  ROBBY  They just opened the airport in  Providence, he’s on his way there  now.  News to Sacha and Matt.  CANELLOS  Ben, I’m gonna need more people on  Massport.  BEN  I’ll give you three of my guys.  Robby, put your team on that too.  ROBBY  Got it.  BEN  And Robby, everything else stops.  ROBBY  Understood.  Ben heads off.  MATT  Why’s Mike going to Florida?  ROBBY  Flight school.   It’s where they  learned to fly.  SACHA  Robby, I’ve got a lot of victim  interviews set up this week.  ROB",
      "dialogue_count": 0,
      "word_count": 1372
    },
    {
      "scene_number": 15,
      "slugline": "INT. GLOBE, ROBBY’S OFFICE/SPOTLIGHT - SAME TIME 123   123  Robby sitting in his chair.  ROBBY (INTO PHONE)  I know, wrap up what you’re doing  and catch the first flight you can.  MIKE (OVER THE PHONE)  I’ll book a flight, go straight to  the courthouse tomorrow.  ROBBY (INTO PHONE)  Good.   Call me when you get it.  Robby hangs up.   Sacha is in his door, putting on her coat.  SACHA  Robby, I’d like to let Phil Saviano  know that we are back on it.  ROBBY  Good idea.   Go have dinner with  Hansi.   Might be the last time for a  while.  SACHA  Okay.  Sacha hesitates, then grabs a clip off her desk.  SACHA (CONT’D)  Robby, after we saw MacLeish, I  started going back through the  clips... and I had a little time  last week finally, so, uh...  (she hands him the clip)  I found that.   It’s from ‘93.  Robby looks down.   We see the clip.   “ LAWYER FOR PORTER  VICTIMS SAYS 20 OTHER PRIESTS IN AREA ARE ACCUSED .”  Robby’s face CHANGES.   Sacha waits, expecting a response.  ROBBY  That it?  Robby’s abrupt tone catches Sacha by surprise.  SACHA  Yeah.   That’s it.  ROBBY  Good night.  11/26/14   104.",
      "characters": [],
      "action_text": "SACHA  Okay.   Good night.  Sacha takes a beat, then leaves, a bit confused and hurt.  Robby looks down at the clip.   Off Robby --  INT. MATT CARROLL’S HOUSE, BEDROOM, WEST ROXBURY, MA - NIGHT 124   124  Matt sits up in bed. Checks the clock. 4am. Can’t sleep.  INT. MATT CARROLL’S HOUSE, KITCHEN - LATER 125   125  Matt walks in, takes two aspirin.   He eyes a 9/11 BUMPER  STICKER on the fridge.   His gaze drifts down to the photo of  the house on Pelton Street.   Matt frowns... realizing he’s  back on the church.  EXT. MODERN RESTAURANT, PROVIDENCE, RI - DAY 126   126  A wide shot.   A well dressed, good looking MAN checking his  blackberry.  Robby walks in, introduces himself to the man.   PRELAP --  INT. MODERN RESTAURANT, PROVIDENCE, RI - LATER 127   127  Robby and the man, KEVIN, 40s, sit at a table.   We’re in a  long shot.   We see them talking.   Kevin is friendly, amiable.  KEVIN  So, I was probably a few years after  you, right?  ROBBY  More than a few.  KEVIN  (laughing)  Well after BC High, I came down to  Providence, played hockey for the  Friars.  ROBBY  You must’ve been pretty good.  KEVIN  No, rode the bench in college.   But  I loved the city, never left.   We  just had our third kid.   And I still  get my Globe, for the record.  ROBBY  Good to know.  11/26/14   105. Kevin smiles.   Robby nods.   Takes a beat.   Then dives in.  ROBBY (CONT’D)  Look, Kevin, that’s actually why I’m  here. I need ask you some questions  about Father Talbot.  Kevin’s face tightens, his eyes intense. Robby waits.  KEVIN  How’d you find out?   I guess that  doesn’t matter.  (shakes his head)  I never even told my wife.  INT. SUFFOLK COUNTY COURTHOUSE, HALLWAY - MOMENTS LATER 129   129  Mike, still carrying his bags from the plane, emerges from an  elevator, hurries down the hall, nearly knocking people out  of the way.   He arrives at the Records Room and slams up  against the glass just as the clerk (O’BRIAN) LOCKS the door.  MIKE  Hey, hey, I need to get in there.  CLER",
      "dialogue_count": 0,
      "word_count": 1225
    },
    {
      "scene_number": 16,
      "slugline": "EXT. BC HIGH, DORCHESTER, MA - DAY 134   134  Robby and Sacha walk from BC High back to the Globe.  SACHA  Does Jack Dunn work for the school?  ROBBY  No. He’s PR for Boston College. They  call him when they need help.  SACHA  And Pete Conley? Why was he there?  ROBBY  Good question.   Pete’s a big alum.  But I called Bill directly and I  asked for a sit-down, I never  mentioned anybody else.  SACHA  It’s like everybody already knows  the story.  This hits Robby.   He pauses, looks back at BC High.  ROBBY  Yeah, except us.   And we work right  there.  INT. SUFFOLK COUNTY COURTHOUSE, JUDGE’S CHAMBERS - LATER 135   135  Mike is still waiting.   A JUDGE enters.   Mike stands.  MIKE  Judge Volterra?  JUDGE VOLTERRA  Yes?  MIKE  Hi, I’m Mike Rezendes from the  Boston Globe.   I’m having some  trouble accessing some public  records down in the records room.   I  was wondering if I could have a word  with you?  INT. SUFFOLK COUNTY COURTHOUSE, JUDGE’S CHAMBERS - LATER 136   136  JUDGE VIERI VOLTERRA stares down at Mike’s request.  11/26/14   110.",
      "characters": [],
      "action_text": "JUDGE VOLTERRA  These exhibits you’re after, Mr.  Rezendes, they’re very sensitive  records.  MIKE  All due respect, your honor, that’s  not the question here.   The records  are public.  JUDGE VOLTERRA  Maybe so, but tell me, where is the  editorial responsibility in  publishing records of this nature?  MIKE  Where’s the editorial responsibility  in not publishing them?  INT. SUFFOLK COUNTY COURTHOUSE, RECORDS ROOM - DAY 137   137  Clerk O’Brian drops the file in front of Mike, who dives in.  His face says it all.   HOLY SHIT.   A beat, then Mike grabs  the files, starts to rush out.  CLERK O’BRIAN  You can’t take those. You need to  make copies.  MIKE  Yeah, I’m going to the copy room.  CLERK O’BRIAN  It closed at four.  Mike stops, fucked.   He digs into his pocket, counts bills.  MIKE  I’ll give you 83 bucks to use yours.  EXT. SUFFOLK COUNTY COURTHOUSE, DOWNTOWN BOSTON - TWILIGHT 138   138  Mike, already on his cell phone, hurries across the street  toward and catches a cab.  MIKE  Hey, Cabbie!   Hey, hey, hey!  Mike gets in cab.  MIKE (CONT’D)  I’m going to the Boston Globe on  Morrisey Boulevard.   Don't take 93.  Take Dorchester Avenue.  11/26/14   111.  (MORE) (into phone)  Robby, it’s incredible!  EXT. STATE STREET, BOSTON - MOMENTS LATER 138A   138A  Mike’s cab moves up State Street.  MIKE (V.O.)  Law knew about Geoghan for years, no  question!   There’s a letter to Law  from a woman, Margaret Gallant, who  lived in Jamaica Plain in the early  80’s when Geoghan was there.   Listen  to this...  EXT. KING’S CHAPEL, TREMONT STREET, BOSTON - MOMENTS LATER 139   139  Mike’s cab whisks past the old King’s Chapel.  MIKE (V.O.)  (reading)  “ Our family is rooted in the Church,  our desire is to protect the Holy  Orders...”  EXT. MONSIGNOR REYNOLD’S WAY, SOUTH END - MOMENTS LATER 140B   140B  Mike’s cab passes the Cathedral of the Holy Cross.  MIKE (V.O.)  “...even in the midst of our agony  over the seven boys in our family...  EXT. PLAYGROUND BY THE CATHEDRAL - ",
      "dialogue_count": 0,
      "word_count": 4351
    },
    {
      "scene_number": 17,
      "slugline": "INT. GLOBE, LOADING DOCKS - NIGHT 167A   167A  Bundles of papers fly down CIRCULAR CHUTES into the trucks.  INSIDE THE TRUCKS , men grab the bundles, and stack them.  INT. GARABEDIAN’S OFFICE, CONFERENCE ROOM = NIGHT 168   168  REVEAL Mitch standing behind his desk, at the window.   He  reads another early edition.   Then folds it up and hands it  back to Mike... who’s standing in front of the desk.  GARABEDIAN  Can I keep this?  MIKE  Sure.   I thought you should see it  first.  GARABEDIAN  Thank you for bringing it by.   Now I  have some clients I have to attend  to.  Mitch goes back to work.   Same old Mitch.   Mike walks out.  INT. GARABEDIAN OFFICE, HALLWAY - CONTINUOUS. 169   169  Mike walks back toward the elevator.   He presses the button,  waits, hears children laughing.   He peers into --  INT. GARABEDIAN OFFICE, SMALL WAITING ROOM - CONTINUOUS 170   170  A MOTHER sits with TWO YOUNG CHILDREN, ten and eight, playing  innocently.   The mother, distraught, fingers ROSARY BEADS.  It’s reminiscent of our open.  GARABEDIAN  Both boys were abused.   Jamaica  Plain.   Two weeks ago.  In the   HALLWAY , Garabedian stands behind Mike.  GARABEDIAN (CONT’D)  Keep doing your work, Mr. Rezendes.  He goes in.   Mike just stands there, GUTTED.   Off Mike, his  reflection playing on the window, CUT TO --  EXT. GLOBE - NIGHT 172A   172A  The GREEN AND GOLD TRUCKS roll out from the Globe.   We see  headlights, a car waits for the trucks to pass.  PUSH IN... and we see it’s   Robby   behind the wheel. CUT INTO --  11/26/14   133.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 258
    },
    {
      "scene_number": 18,
      "slugline": "INT. ROBBY’S CAR - SAME TIME 172B   172B  Robby sits in his car watching the trucks roll out.  EXT. BOSTON - DAWN A173   A173  The   SPARKLING BOSTON SKYLINE .   The City on the Hill.  EXT. WEST ROXBURY, BOSTON - EARLY MORNING 173   173  A welcome mat.   A copy of the Globe is slapped down.   We see  the HEADLINE:   Church Allowed Abuse by Priest for Years .  Reveal Matt walking away from the door.   We see it’s the  treatment center near his house.  INT. GLOBE, HALLWAY - EARLY MORNING 174   174  We’re behind Sacha as she walks down the hall.   She opens the  firehose box, grabs a key.   Unlocks the door to Spotlight.  INT. GLOBE, SPOTLIGHT - EARLY MORNING 174A   174A  Sacha enters, turns on the lights, takes off her coat.   Matt  enters.  MATT  Hey.  SACHA  Morning.  MATT  How’d you sleep?  SACHA  Not very well.   You?  MATT  I haven’t slept well for months.  I’ve actually started writing.  SACHA  Writing?  MATT  Yeah, I’m working on a book.   Gives  me something else to focus on.  SACHA  That’s great.   What kind of book?  MATT  Horror.  11/26/14   134.",
      "characters": [],
      "action_text": "Sacha reacts, the irony not lost on her.   The phone RINGS.  The tip line .   They both stare.   At last, Matt picks up.  MATT (INTO PHONE) (CONT’D)  Spotlight.   Yeah.   Yeah, of course.  Can I get your name please?  He grabs a pen.   As he and Sacha trade a look, CUT TO --  EXT. GLOBE, FRONT PARKING LOT - MORNING 175   175  The small visitor’s lot at the Globe entrance is empty, save  for MIKE’S CAR.   Idling.   Robby’s car enters, pulls up next  to Mike’s.   Robby looks across at Mike.   The two men connect.  Mike and Robby get out of their cars.  ROBBY  You do know it’s Sunday, right?  MIKE  I couldn’t get a tee time.  Robby smiles. Mike notes the SECURITY GUARDS at the entrance.  MIKE (CONT’D)  No picketers.  ROBBY  Probably still at church.  They walk in.   Warriors returning home.  INT. GLOBE, NEWSROOM - EARLY MORNING 177   177  Mike and Robby walk into the newsroom.   It’s QUIET.   Mike and  Robby share a CONFUSED look as they reach the desk.   LINDA,  the operator, and two others sit by the phones.   BORED.  ROBBY  Hey Linda.  MIKE  It’s quiet, huh?  LINDA  Yeah.   Easiest overtime I ever made,  phone hasn’t rung once.   Marty sent  two of mine down to Spotlight.  Mike and Robby trade a look.   Spotlight?   They start moving.  11/26/14   135. LINDA (CONT’D)  (calls out after them)  Great article guys.  ROBBY  Thank you.   MIKE  Thanks.  They hustle through the empty newsroom, heading downstairs.  We hold on Marty, in his office.   Working.   As always.  INT. GLOBE, HALLWAY - CONTINUOUS 178   178  Robby and Mike charge from the stairwell.   They quickly walk  down the corridor with purpose.   As they do, we hear...  A MURMUR.   Buzzing.   And RINGING PHONES.   Mike and Robby  trade a look, pick up the pace.   As they approach Spotlight,  the murmur GROWS.   We hear more phones... and VOICES...  Mike and Robby get to the door.   We HOLD ON them for a second  as they stand in the doorway, looking into --  INT. GLOBE, SPOTLIGHT OFFICE - CONTINUOUS 179   179  Ch",
      "dialogue_count": 0,
      "word_count": 1484
    }
  ]
}