{
  "slug": "stan-and-ollie-2018",
  "title": "stan and ollie",
  "genre": "comedy",
  "format": "film",
  "scenes_count": 15,
  "characters_count": 0,
  "characters": [],
  "total_words": 19759,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. QUEEN’S HALL THEATRE, NEWCASTLE - NIGHT 19aA   19aA  ‘The Dance Of The Cuckoos’   plays again, and the curtain rises. LAUREL waits for a particular note, then steps out on set... but he only manages two paces before HARDY reaches out and pulls him back.   He   goes out first in this partnership. Laughter. But as HARDY strolls out self importantly, LAUREL kicks him up the ass. More laughter. Finally they both walk out together to warm applause. They go into a bowing routine, to the side, to the front, then towards each other - clashing heads. Laughter. LAUREL sees HARDY put his hand on his knee to push himself straight again - sees a flash of pain across his face. HARDY covers it well as he fiddles with his tie; LAUREL takes his hat off and scratches his hair underneath. LAUREL Ladies and gentlemen, thank you for making us feel so welcome on our first night back in England. We hope you’ve enjoyed our bit of fun this evening - we’ve sure enjoyed ourselves haven’t we Ollie?  Stan and Ollie - Blue Revisions 24.03.17   28A",
      "characters": [],
      "action_text": "HARDY We certainly have Stanley, we’ve been made to feel right at home here in Newcastle, and now we’d like to finish- He gives LAUREL a brief nod of reassurance about his knee- HARDY (cont’d) -with a little dance routine we like to do. Music please maestro. The tune to   ‘At The Ball, That’s All’   strikes up. HARDY (cont’d) Stanley. Formally, HARDY holds his hand out and LAUREL takes it, as if he were his dance partner ,   and they begin to perform the same dance routine we saw in   ‘Way Out West’ . Though older and slower, they still dance beautifully, the affection their characters have for each other shining through. They come together to finish, hold hands and take a bow. They look out at the half full auditorium, but still keep up their smiles. CUT TO:  EXT. STAIRWELL, TRAIN STATION - DAY 19A   19A LAUREL and HARDY puff and blow as they clamber up a long staircase carrying their luggage. HARDY, golf clubs again over his shoulder, drags the heavy trunk behind him. LAUREL It was a little slow last night, wasn’t it. HARDY Slow? We could have invited the audience back for a party in our hotel suite - there’d have been plenty of room. LAUREL smiles, HARDY is struck with a sudden thought: HARDY (cont’d) We got to be careful Muffin doesn’t come see us ‘til the houses pick up - we don’t want him getting cold feet about the movie. LAUREL You’re right. I’ll put him off ‘til we get to London... LAUREL reaches the top, rests his case, looks about for where to go next.  Stan and Ollie - Pink Revisions 17.03.17   29 LAUREL (cont’d) (Takes out a slip of paper) Glasgow train... 8.05 Platform Four. (Looks about) Which way is Platform Four..? HARDY (Still struggling up the stairs) 8.05? What time is it now? LAUREL looks at his wrist - he’s not wearing a watch: LAUREL I don’t have my watch on. HARDY instinctively brings up his left wrist to look at his watch - but in doing so he lets go of the heavy trunk... which promptly slides away down the staircase. A moment as they both w",
      "dialogue_count": 0,
      "word_count": 2041
    },
    {
      "scene_number": 2,
      "slugline": "INT. GLASGOW PUB - NIGHT 25   25 That evening. LAUREL and HARDY, glum and apprehensive after another poorly attended show, sit in a corner booth with DELFONT, who tucks into a pub meal of sausage and mash. LAUREL and HARDY don’t eat but have pints of beer in front of them and both smoke heavily, a thick haze hanging over the booth. Nothing is said until, finally, DELFONT finishes his last mouthful and dabs vigorously at his mouth with a napkin: DELFONT Now then, gentlemen... (More dabbing, puts napkin down) Terrific though the show is, and it really is terrific- HARDY Thank you. DELFONT -we really do have to have a little think about where we go from here. Sweating profusely, HARDY pours himself a glass of water from the ever-present jug he has at the dinner table. HARDY We have new material we can work in, don’t we Stan. LAUREL We have a double door routine we can do, set in a railway station, and as soon as Babe’s leg is better we can bring back the dance number at the end. HARDY It’s getting better all the time. DELFONT Yes, I think that would all help enormously. And of course it’s early days and all that but, unfortunately, the houses have thus far been extremely disappointing. HARDY But that’s because we’re playing in all these little theatres. DELFONT Yes and I’m absolutely furious about that.  Stan and Ollie - Locked White Shooting Script 22.02.17   36",
      "characters": [],
      "action_text": "HARDY But you booked us in them? What happened to the big ones we played last time we were over? DELFONT Well we couldn’t be sure how ticket sales would go you see, and- LAUREL, suddenly getting it, looks thunderstruck. LAUREL Wait a minute, wait a minute... you want to close us down? DELFONT Absolutely not. That’s the last thing I want to do. HARDY We haven’t even done a week! LAUREL When do you want us to finish? DELFONT I thought it would be best if we wrapped it up before you got to London? HARDY What! DELFONT That would give us another ten shows or so. With a bit of a push - ‘last shows’, that sort of thing - and the advance bookings we already have, we should just about be able to wash our hands. HARDY But the producer of the movie’s coming to see the show in London next month, isn’t he Stan? LAUREL And Lucille and Ida are coming over in a couple of weeks - we can’t finish early. HARDY We made it perfectly clear- (Grasps at the figure) -one hundred and ten per cent clear, that the only reason we came over for this tour was to be available for that movie.  Stan and Ollie - Locked White Shooting Script 22.02.17   37 DELFONT looks at them both, considering the situation. DELFONT I thought you’d jump at the chance. Neither of you looks particularly well? HARDY I’m in perfect health. LAUREL And so is he. HARDY Mr Delfont, we need this tour to continue. DELFONT And of course I’m enormously sympathetic. Enormously. But your audience doesn’t quite seem to be what it was, and advance bookings are very slow. It’s a wonderful show, very charming and sweet, but perhaps... tastes have changed? All good things must come to an end, that sort of thing? LAUREL We can turn it around. DELFONT The public moves on. So many don’t even come to the theatre now, just stay at home watching their television sets... watching your films on their television sets, come to think of it - and you not even getting any residuals. (Shakes his head and tuts) Filthy business. HARDY Just tell us wha",
      "dialogue_count": 0,
      "word_count": 1514
    },
    {
      "scene_number": 3,
      "slugline": "EXT. TRAIN STATION - DAY (MONTAGE SEQUENCE) 31   31  The train has arrived and LAUREL steps down from the carriage, waving to fans on the platform before turning to help HARDY down. HARDY looks pale and - frankly - exhausted.  Stan and Ollie - Pink Revisions 17.03.17   40A",
      "characters": [],
      "action_text": "He’s wobbly on the steps with his bad knee but once he’s safely on the platform he also turns and waves to the fans. The boys then go into their bowing routine: to each side, to the front, then to each other - banging heads. Big laughs.  INT. THEATRE FOYER - NIGHT (MONTAGE SEQUENCE) 32   32  A queue of fans in the foyer; we snake along the line until we reach the box office, where money is slapped down hand over fist for tickets; demand seems to be growing.  DELETED 33   33   * EXT. STREET - DAY (MONTAGE SEQUENCE) 34   34  Another PA - PHOTOGRAPHERS snap away as LAUREL and HARDY, each with a conductor’s ticket machine strapped to his chest, manually wind out tickets from their machines for PASSENGERS boarding a trolley-bus. Inevitably LAUREL winds out a ticket, hands it to HARDY and he accepts it - before realising what it is and - to laughs - angrily screwing it up and throwing it away. JUMP CUT TO: The BOYS - now on the trolley bus - wave goodbye to everyone from the rear as it rattles off down the street.  DELETED 35   35  EXT. COUNTRYSIDE - NIGHT (MONTAGE SEQUENCE) 36   36  An express sleeper, the engine’s headlamp illuminating swirls of steam as, even at night, the boys keep on moving, moving. The graphic map shows the tour stopping at Cardiff, then Bristol, then Exeter before reaching Plymouth.  END MONTAGE. INT. HER MAJESTY’S THEATRE, PLYMOUTH - NIGHT 37   37 All the hard work leads to here. HARDY sits on a bench in an unfamiliar set - a railway platform - looking at his watch impatiently. The auditorium is jam-packed full; the audience - spread across all ages - happy, expectant. On stage HARDY can wait no more, gets up and exits through a door into the waiting room. At this exact moment LAUREL comes out onto the stage through another door next to the first door. LOUD APPLAUSE as he looks around, puzzled, for Hardy.  Stan and Ollie - Green Revisions 11.04.17   41 LAUREL checks his watch, then decides to go and look for him - but once again at the precise mom",
      "dialogue_count": 0,
      "word_count": 1153
    },
    {
      "scene_number": 4,
      "slugline": "EXT. SAVOY HOTEL, LONDON - DAY 40   40 Next morning, LAUREL exits the hotel dressed in unfamiliar business attire   (smart overcoat and Homburg hat) , smiling and nodding to the BELL BOYS. He takes in the air, full of energy and expectation, then strolls off down the Strand.  EXT. WEST END CINEMA - DAY 41   41 Taxis and red buses weave past, with adverts for Bovril, Players cigarettes and Schweppes on the side. Men in hats and ladies in heels bustle along this busy corner of the west end. LAUREL walks along,   (to where we don’t yet know) , then pauses to study a poster outside a cinema: ‘ Abbott & Costello Go To Mars’ . The blurb tells us they are ‘Hollywood’s No. One Comedy Duo’. This is the double act that has effectively replaced Laurel & Hardy in the affections of modern moviegoers. LAUREL looks at their young faces, the silver space suits, the shiny rocket,   the future ... A MAN walks up and stands next to him, also to look at the poster. A few moments then LAUREL, aware of the MAN standing on his shoulder, turns to look at him. At the same time the MAN turns to LAUREL and gives him a polite smile. LAUREL goes to smile back but realises the MAN is tremendously boss-eyed - his eyes literally looking in opposite directions. LAUREL double takes. The MAN politely raises his hat, then walks away. OUT on LAUREL.  EXT. STRAND TUBE STATION - DAY 42   42 Wearing his beret, a smiling HARDY - full of the joys of life - strolls down the street singing softly to himself, humming some of the words he can’t quite bring to mind: HARDY  (Singing) Let me call you Sweetheart, I'm in love with you Let me hear you whisper that you love me too Keep the da-da hmm hmm in your eyes so true Let me call you Sweetheart, I'm in love with you...  He passes a little florist’s stall outside the tube station, is about to go down the stairs when he decides he’s feeling so good he wants a buttonhole. He selects a red carnation and, with great delicacy, pulls a shilling from his wallet to pay for it. Back to the song, he hums and whistles as he carries on jauntily into the tube station, pinning the carnation to his lapel as he goes.  EXT. WEST END - DAY 43   43 LAUREL strides up to a building with brass business plates outside, checks the address against a slip of paper, enters.  Stan and Ollie - Pink Revisions 17.03.17   45",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 436
    },
    {
      "scene_number": 5,
      "slugline": "INT. OFFICE RECEPTION - DAY 44   44 LAUREL removes his hat and approaches the RECEPTIONIST, an insipid-type, mid-20s. LAUREL I’m here to see Mr. Miffin. RECEPTIONIST And your name please? LAUREL Mr. Laurel. She starts to write everything down.  Stan and Ollie - Pink Revisions 17.03.17   45A",
      "characters": [],
      "action_text": "RECEPTIONIST Do you have an appointment Mr. Lauren? He doesn’t pick her up on mispronouncing his name. LAUREL We keep missing each other on the telephone so I thought if I dropped by that would be the easiest thing. RECEPTIONIST Because he’s not here right now. LAUREL (Beat, thinks about this) That’s okay, I can wait. I think I’ve been speaking to another girl on the telephone about this - I’ve been speaking to her for a while? RECEPTIONIST She’s left. Are you sure you want to wait? He may be quite a while? LAUREL Well, I’m here now aren’t I. RECEPTIONIST Take a seat over there Mr. Lauren- (Indicates a row of chairs) -I’ll let his office know you’re here. He still doesn’t pick her up on the name thing. As she makes an internal call he sits down. He looks over to a door at the far end of the reception area. Another closed door.  EXT. JEWELLERS, BURLINGTON ARCADE - DAY 45   45 A tray of diamond bracelets are removed from a shop window.  INT. JEWELLERS, BURLINGTON ARCADE - DAY 46   46 The tray is set down by a (male) ASSISTANT in front of HARDY. The ASSISTANT indicates a bracelet in the middle of the tray. ASSISTANT A beautiful piece sir. HARDY looks at it, but his eye is taken by one above it which is much, much classier with alternating diamonds and rubies. ASSISTANT Mr. Laurel not with you today? HARDY, preoccupied, answers without looking up:  Stan and Ollie - Pink Revisions 17.03.17   46 HARDY Oh he’s just got himself a new job, mending broken biscuits. The ASSISTANT laughs. ASSISTANT I think it’s wonderful you’re still going. HARDY Rigor mortis hasn’t set in just yet- He points to the expensive bracelet.  Stan and Ollie - Pink Revisions 17.03.17   46A HARDY (cont’d) -I’m very taken with this one? The ASSISTANT takes it from the tray and lays it out on a small patch of velvet cloth. ASSISTANT One of our best pieces, diamonds and rubies set in a gold bracelet. HARDY My wife’s arriving from overseas today and it’s a gift, you see. ASSISTANT It’s the most expensive i",
      "dialogue_count": 0,
      "word_count": 925
    },
    {
      "scene_number": 6,
      "slugline": "INT. MIFFIN’S OFFICE - DAY 50   50 ... an empty office. Desk and chair, leather sofa facing; posters from various low budget British movies from the 40s and 50s on the walls. He looks around. Empty. From behind:  CYNTHIA (OOV) You’re here to see Mr. Miffin?  He turns round, sees CYNTHIA, 50s, glasses, a formidable- looking production executive, standing in the doorway. LAUREL Yes. Sorry, I... Yes. CYNTHIA I’m his production executive, Cynthia Clarke. LAUREL Hello Cynthia. CYNTHIA Mr. Miffin is still detained, but I’ve just spoken to him on the telephone and he wanted me to explain the situation to you. (LAUREL swallows) He says he’s sorry, but he’s been unable to raise the finance needed to proceed with the film. LAUREL (Beat) Oh... I see. CYNTHIA He said he made it clear in a cable he sent to you before you left the United States, that all the finance wasn’t in place? LAUREL Yes but I thought he’d have it all lined up by now. CYNTHIA He wanted you to know that he did everything he could to bring the project together, but he feels sure you’ll understand that the market is very challenging at the moment, and that it just wasn’t possible. LAUREL looks at her, crushed, as the enormity of what she’s saying now starting to sink in. But he remains polite.  Stan and Ollie - Pink Revisions 17.03.17   49",
      "characters": [],
      "action_text": "LAUREL Yes. Thank you. Thank you very much for your time...  EXT. STRAND TUBE STATION - DAY 51   51 HARDY - in coat and beret, cigarette hanging from his lips - hurries out of the tube station and makes for a newspaper vendor who is opening some bales of freshly-arrived evening papers. He pays for one, feverishly turns to the racing pages and scans the   ‘Stop Press’.   He finds his race, and... he’s lost. We see his bitter disappointment. He screws the paper up and is about to angrily hurl it into a litter bin when he sees some SCHOOL KIDS, in uniform, staring at him shyly. A beat, then he forces a smile, calmly drops the paper in the bin and flutters his tie at them.  EXT. SAVOY HOTEL - DAY 52   52 Late afternoon now. LAUREL and HARDY, each glum for different reasons, smoke cigarettes as they wait outside the hotel by the taxi rank. The boys savour deep puffs, as if their last. HARDY’S attention is caught by a NEWSREEL CREW setting up to cover the entrance. He looks puzzled... LAUREL Delfont’s idea, thought the girls arriving would be a good excuse for some free publicity. (Beat) I’m sure lookin’ forward to seeing them again. HARDY I been countin’ the days. LAUREL Forty six. (HARDY looks at him, puzzled) Since we got here. Forty six days. (HARDY still puzzled) I thought you said you been countin’ them? HARDY I just meant the last few. Seven or eight. LAUREL Oh. HARDY Not forty six. Who counts from forty six? LAUREL shrugs, blankly.  Stan and Ollie - Pink Revisions 17.03.17   50 HARDY You know, I been thinking... they don’t need to know about everything we been doing, do they? Like, for instance, all the personal appearances... LAUREL No sense in getting them all worked up. HARDY In a way, it’s a kindness keeping them in the dark. LAUREL It certainly is. HARDY Well that’s settled. We’ll just talk about how well the tour’s going. (Afterthought) And the movie. LAUREL can’t bring himself to break it to Hardy - not yet. LAUREL Yeh. The movie. LAUREL takes another deep ",
      "dialogue_count": 0,
      "word_count": 1826
    },
    {
      "scene_number": 7,
      "slugline": "INT. HARDY’S SAVOY HOTEL ROOM - NIGHT 56   56 Back up in their room, LUCILLE is busy arranging flowers from a huge bunch Hardy has bought her, into a vase. LUCILLE Oh Oliver they’re lovely, you really know how to spoil me. She looks to HARDY, who is lying on the bed watching her. LUCILLE (cont’d) I was so worried you were going to go out and buy me something we couldn’t afford.  Stan and Ollie - Yellow Revisions 31.03.17   56A",
      "characters": [],
      "action_text": "HARDY In future I am only buying you things I don’t have enough money for. He tries to joke about it, but she can see he’s downcast. She goes over to the bed, sits next to him. LUCILLE You don’t have to buy me anything, you’re everything I could ever want. LUCILLE takes off her dressing gown and gets in bed with HARDY, who cuddles up to her, arms around her. HARDY This is what I’ve been waiting for. LUCILLE smiles, squeezes his arm contentedly. HARDY (cont’d) Why are you interested in a fat old man like me? This is clearly an old joke between them. LUCILLE Hey you, that’s my husband you’re talking about. I love you and you can’t stop me. LUCILLE shuts her eyes and tries to relax. HARDY How was the trip over with Ida? LUCILLE You know Ida, exhausting. When she gets something in her head she won’t let it go ‘til she’s worried it to death, and God forbid anyone should raise the slightest criticism of Stanley. Hardy laughs. LUCILLE (cont'd) Has he been pushing you too hard Babe? HARDY (Tired sigh) Well, it’s more difficult than I first thought. HARDY closes his eyes. She looks at him, worried how hard he’s pushing himself. She strokes his forehead.  Stan and Ollie - Blue Revisions 24.03.17   57",
      "dialogue_count": 0,
      "word_count": 304
    },
    {
      "scene_number": 8,
      "slugline": "INT. BAR, SAVOY HOTEL - NIGHT 57   57 LAUREL finishes making an order at the hotel bar and comes back to sit with IDA at a table.  Stan and Ollie - Blue Revisions 24.03.17   57A",
      "characters": [],
      "action_text": "IDA Oliver is like cat on hot roof with Lucille. She wear pants in Hardy house. LAUREL He’s been like that with all his wives. Jumps around after them the whole time, trying to please them. IDA You can learn this. LAUREL smiles. LAUREL But she’s been good for him, considering the state he was in. (Thinks about this) That we were both in. (Turns to IDA) But now we don’t smoke and we don’t drink and we’re much happier. IDA He should say ‘thank you’ to you, for all you do for him. You could have said long time ago, ‘goodbye Oliver’. LAUREL That’s all in the past, where it should stay. A WAITER brings them over cups of coffee each and also places a Scotch in front of LAUREL. LAUREL (cont’d) Thank you. IDA Are you crazy! Take it back. LAUREL (To WAITER) It’s okay. (To IDA) I’m not going to drink it... LAUREL holds the tumbler up to his nose: LAUREL (cont’d) I just wanted to smell it. LAUREL breathes in the aroma of the Scotch  Stan and Ollie - Blue Revisions 24.03.17   58 IDA Bad for diabetes. But LAUREL continues to toy with it. Annoyed, IDA snatches it from him and downs it in one. IDA (cont’d) Now you can’t drink. (Beat) I don’t want to lose you Stanley. He puckers up and she gives him a kiss. LAUREL And nobody even knows you’re really a man. She gives him a weary smile and a little shove.  EXT. PALLADIUM THEATRE, LONDON - NIGHT 58   58 To establish the boys’ opening night in London, their names up in lights outside the iconic London Palladium, the country’s premier theatre.  INT. BACKSTAGE PALLADIUM THEATRE, LONDON - NIGHT 59   59 Backstage, almost ready to start the show. HARDY paces about, nervous. LAUREL, checking the paper clips on his cuffs, peers out through a crack and this time sees the auditorium is packed. He allows himself a smile. He checks - no heels on his boots.  INT. AUDITORIUM, PALLADIUM THEATRE - NIGHT 60   60 DELFONT, all hand-squeezes and big smiles, takes his seat next to LUCILLE and IDA just in time for the start. He looks about,   very   happy.",
      "dialogue_count": 0,
      "word_count": 792
    },
    {
      "scene_number": 9,
      "slugline": "INT. BAR, PALLADIUM THEATRE, LONDON - NIGHT 62   62 LUCILLE and IDA have been left by themselves in a corner. DELFONT has arranged a little after-show party but is firmly with the money - variety club patrons LORD and LADY WARLEY and another well-heeled couple, the BROCKETT-SMITHS. Ever the attentive host he fills their glasses and laughs at their jokes - but has forgotten about the girls. LUCILLE I wonder when the boys will be up? IDA Why don’t we ask for someone to go get them? LUCILLE looks over to DELFONT. LUCILLE He seems a little preoccupied... with his lords and ladies.  Stan and Ollie - Pink Revisions 17.03.17   60A",
      "characters": [],
      "action_text": "IDA Come - we stand like lemon. IDA heads for DELFONT and his GUESTS, LUCILLE follows. DELFONT spots them approaching: DELFONT Ladies! I’m so sorry - I was just on my way over to ask what you wanted to drink. Mrs Laurel and Mrs Hardy, may I present Lord and Lady Warley and Mr. & Mrs Brockett- Smith. General greetings between everybody. LUCILLE Did you enjoy the show? LORD WARLEY Yes very good, stuff and nonsense wasn’t it. On LUCILLE, not entirely sure this is a compliment? LUCILLE Mr. Delfont told us that you- IDA (Abruptly cuts across her) I have many offers to perform on London stage, but Hollywood call me. LORD WARLEY You’re an actress yourself? LUCILLE (Interjecting) More of a dancer really. With a very high pain threshold. IDA I make film with Preston Sturges and Harold Lloyd. No time for London stage. LUCILLE And I’m sure the London stage has been kicking itself all these years- (Looks around, desperate to get away) I wonder where those boys are?  Stan and Ollie - Pink Revisions 17.03.17   61",
      "dialogue_count": 0,
      "word_count": 292
    },
    {
      "scene_number": 10,
      "slugline": "INT. DRESSING ROOM, PALLADIUM THEATRE LONDON - NIGHT 63   63 HARDY, full of energy, is on his feet, clutching his script. Still on a high from how well the show went, he   (and this time not Laurel)   has insisted on running lines from   ‘Robin Hood’ . LAUREL, by contrast, sits at his dressing table finishing removing his make up. He is guilty, downcast, struggling with the knowledge that the movie has been canned - and that he hasn’t yet told HARDY. HARDY This line Robin Hood has when he says he steals from the rich and gives to the poor - there’s a gag in there somewhere Stan... LAUREL Babe, the girls are waiting. And Delfont’s got some people he wants us to meet from his charity. HARDY We just gotta work it up some more. What day’s Muffin comin’ to watch the show? LAUREL He didn’t say. HARDY He should have been here tonight. Went big tonight. LAUREL decides that the time has finally come to tell the truth about the movie. LAUREL Babe, there’s something I gotta tell you- HARDY (Suddenly stopping pacing) How about we tell Robin Hood he’s got it all wrong and he should steal from the poor and give to the rich? Or something like that? LAUREL The thing is... LAUREL’S voice chokes. Is he still going to tell him? HARDY You can play around with that Stan, can’t you? LAUREL Well, you see...  Stan and Ollie - Pink Revisions 17.03.17   62",
      "characters": [],
      "action_text": "LAUREL had every intention of confessing all... but now that HARDY has planted this thought in his mind, the chance to create something takes over. As he thinks about the scene, slowly LAUREL’S expression changes from a frown to a smile. LAUREL (cont’d) How about, we give to the poor by stealing from the poor, and cutting out the middle man? HARDY That’s it! HARDY heads for the door, continuing as ‘Friar Hardy’: HARDY (cont’d) Stealing from the rich to give to the poor - who ever heard of anything so ridiculous? As LAUREL follows him out we see that he has abandoned all thoughts of confessing - his creative juices are flowing.  DELETED 64   64  INT. BACKSTAGE PALLADIUM THEATRE LONDON - NIGHT 65   65 The BOYS make their way through the backstage area towards the (darkened) stage. HARDY (‘Friar Hardy’) It’s obvious - steal from the poor, and give to the poor, and thereby cutting out the middle man. LAUREL (‘Stanley-A-Dale’) And the rich need never be any the wiser. HARDY (’Friar Hardy’, emphatically) Precisely. They emerge into the wings of the theatre. They continue their journey across the empty stage towards an exit at the side of the auditorium leading up to the bar - where they know everybody is waiting for them. HARDY (cont’d) (Out of character) That’s great Stan, that’s funny. But as they cross the stage HARDY - still excited and animated - sees a couple of brooms and stops to pick one up. He throws LAUREL the other:  Stan and Ollie - Locked White Shooting Script 22.02.17   63 HARDY (cont’d) Hey Stan, let’s just play it out/run through it. You be Robin Hood. He turns to face LAUREL. HARDY (cont’d) (As ’Friar Hardy’) I’m warning you now - let me pass. HARDY takes a swipe over LAUREL’S head. HARDY (cont’d) (’Friar Hardy’) I’m an expert at this... (Tries the line differently) I have excellent staffing skills. (Tries for a better line) I am noted for my staff play. LAUREL (As Stan) I’ve got great stick work. HARDY (As ‘Friar Hardy’) I’m warning you, I’ve got great ",
      "dialogue_count": 0,
      "word_count": 2985
    },
    {
      "scene_number": 11,
      "slugline": "INT. HARDY’S SAVOY HOTEL ROOM - NIGHT 69   69 HARDY sits at the table eating his hot dogs; LUCILLE is at the table with him but doesn’t eat anything. LUCILLE Oliver, I would go to the ends of the earth for you, I would do anything for you, but I won’t stand by and watch Stanley put you in a wooden box and nail the lid shut. There, I’ve said it. I’m sorry, but it’s true. HARDY appears to come to a momentous decision. HARDY You know, you’re absolutely right. (Bite of hot dog) Just as soon as we’ve finished up here-  INT. LAUREL’S SAVOY HOTEL ROOM - NIGHT 70   70 It’s like LAUREL finishes his sentence: LAUREL -as soon as we’ve finished our commitments here, that’s it. It’s over-  INT. HARDY’S SAVOY HOTEL ROOM - NIGHT 71   71 Now HARDY finishes Laurel’s sentence: HARDY -I’m done with him, once and for all.  INT. FOYER, SAVOY HOTEL - DAY 72   72 Next morning. LAUREL walks up to the CONCIERGE. CONCIERGE Your taxi is outside Mr. Laurel. LAUREL (Looking around) Have you seen Mr. Hardy at all? CONCIERGE He left about fifteen minutes ago sir. LAUREL He did? By himself? OUT on LAUREL.  Stan and Ollie - Pink Revisions 17.03.17   74",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 211
    },
    {
      "scene_number": 12,
      "slugline": "EXT. HOLIDAY CAMP, WORTHING - DAY 73   73 A classic 50s holiday camp. HOLIDAYMAKERS sit round a pool or on the grass eating sandwiches. An open-air stage has been set up in front of the pool, a little band to one side. A banner tells us a ‘Bathing Beauty Contest’ will be judged ‘in person’ by ‘Laurel and Hardy’. The turn-out is impressive.  INT. TENTED AREA - DAY 74   74 A tented back stage area: LAUREL enters to find HARDY already seated at the far end of the tent, avoiding his gaze. LAUREL Why d’you leave without me? HARDY doesn’t answer. An ORGANIZER enters at Hardy’s end. ORGANIZER Is there anything I can get you gentlemen? HARDY Would you be so kind as to get me a cup of tea. There are some tea things on a table by LAUREL. ORGANIZER Of course. LAUREL gets up and starts to pour himself a cup: LAUREL I’ll do it. HARDY (To ORGANIZER) Thank you, if it’s all the same I’d rather you did it. For a split second she is confused, then works out that all is not well between the boys. ORGANIZER Of course. She goes over to the tea things and pours a cup out for him. HARDY Milk and four sugars please. The ORGANIZER stirs in the sugar, takes the tea up to HARDY and hands it to him. HARDY (cont’d) Thank you so much.  Stan and Ollie - Locked White Shooting Script 22.02.17   75",
      "characters": [],
      "action_text": "ORGANIZER Well I think it’s amazing that you two are still going strong, still doing the same old material. A back-handed compliment, if ever there was one. LAUREL Thank you. HARDY (Looking in a different direction) Thank you.  Stan and Ollie - Pink Revisions 17.03.17   75A She notes how the two men are obstinately and frostily turned away from each other as they sip their tea.  DELETED 75   75  EXT. HOLIDAY CAMP, WORTHING - DAY 76   76 But now, in public, LAUREL and HARDY are a picture of (on- stage) friendship and togetherness, seated at the judge’s table as a line up of BATHING BEAUTIES files past them. Slipping into stage ‘business’ with practised ease, HARDY does a lot of simpering and twiddling of his tie to the GIRLS; but when LAUREL does a goofy smile and waves to one of them an ‘annoyed’ HARDY slaps him down. Laughter - it all seems to be going well.  INT. TENTED AREA - DAY 77   77 Late afternoon, the sun starting to set. LAUREL and HARDY are to the side of the stage, at the bottom of some steps, out of view of the audience - and once again ignoring each other. On stage PHOTOGRAPHERS snap away as the three beauty contest FINALISTS parade for the crowd. Eventually: LAUREL I was talking to this fella about eggs... I know you’re interested in eggs. He said they get dried powder to supplement the ration. (HARDY ignores him) You get a packet a month, same as twelve eggs. Doesn’t taste too good, but you can make omelettes with it. (Still no answer) That’s what he said. HARDY I have nothing to say. LAUREL Well I have nothing to say to you either. And you can forget what I just said ‘cos I won’t be repeating it. HARDY Good. LAUREL Good. LAUREL gets a nod from the ORGANIZER, cutting the conversation short. A moment, then he bounds up a few steps onto the temporary stage. HARDY goes to follow him but pauses on the steps. LAUREL takes the microphone to enthusiastic APPLAUSE.  Stan and Ollie - Pink Revisions 17.03.17   76 LAUREL (cont’d) Hello everybody. Mr. Hardy and ",
      "dialogue_count": 0,
      "word_count": 4492
    },
    {
      "scene_number": 13,
      "slugline": "INT. BACKSTAGE, PALLADIUM THEATRE, LONDON - NIGHT 99   99 LAUREL, in costume, waits in the wings to go on, he looks through a crack in a curtain to check the size of the audience. We can see how anxious and troubled he is by what he is about to do. He turns, sees COOK getting into the hospital bed and having his foot encased in the comedy plaster cast.  Stan and Ollie - Green Revisions 11.04.17   91aA",
      "characters": [],
      "action_text": "As he turns to LAUREL, COOK strokes a little Hardy-style moustache he’s been given by the make-up department:  Stan and Ollie - Yellow Revisions 31.03.17   91A COOK What do you think Stan - I thought I’d try and look the part? LAUREL returns a nervous smile. LAUREL That’s fine. That’s fine. LAUREL makes a cursory check of his heels and cuffs, trying to convince himself he’s perfectly fine with this.  INT. PALLADIUM THEATRE, LONDON - NIGHT 100   100 DELFONT and IDA wait patiently for curtain up. And they wait... but it doesn’t lift. Some restlessness in the audience.   What’s going on?   Finally, after a few more moments, the orchestra stops and the THEATRE MANAGER walks out on stage into a spotlight. THEATRE MANAGER Ladies and gentlemen, I’m afraid due to circumstances beyond our control tonight’s performance has been cancelled... A large murmur of discontent. DELFONT looks around at the full house, in despair. DELFONT Cancelled! IDA realizes straight away what has happened. IDA Oh Stanley...  DELETED 101   101  INT. SAVOY HOTEL BAR - NIGHT 102   102 IDA enters the bar. She sees LAUREL, by himself, a tumbler of Scotch in front of him, smoking a cigarette. She goes over to him, sits down next to him.  Stan and Ollie - Yellow Revisions 31.03.17   92 She gently takes his cigarette and stubs it out; and as before takes his Scotch and drinks it, to stop him drinking it.   * LAUREL (Beat) When you watch our movies, nobody else in the stories knows us. And we don’t know anybody either. It was just the two of us, the only thing we had was each other. And that was the way we wanted it. (Beat, looks at her) I love him Ida. IDA looks at him and gently smiles. She nods, accepts his decision. IDA We go home? LAUREL nods. LAUREL Don’t tell Babe. Tell him I’m going to continue with the dates in Ireland... it’d upset him to think of me cancelling the tour.   * (Beat) I’m sorry my darling...  INT. HARDY’S SAVOY HOTEL ROOM - DAY 103   103 LUCILLE brushes her hair in front of a mirror",
      "dialogue_count": 0,
      "word_count": 1604
    },
    {
      "scene_number": 14,
      "slugline": "INT. OLYMPIA THEATRE, DUBLIN - NIGHT 112   112 A full house, all ages; the audience impatient to see their heroes. We see LUCILLE and IDA in the front row, DELFONT next to them, beaming with pride. His hands are clasped firmly together, a small sign of how nervous he is. Of how much, deep down, he really does care about the boys.  INT. WINGS OLYMPIA THEATRE, DUBLIN - NIGHT 113   113 HARDY is having his leg hoisted up in ‘traction’, LAUREL checks his cuffs and heels. Their eyes meet, and they exchange that nod.  INT. OLYMPIA THEATRE, DUBLIN - NIGHT 114   114 The house lights go down, an expectant hush.   ‘The Dance Of The Cuckoos’   begins, curtain goes up and there is the hospital room set, HARDY in bed, leg in plaster. Applause. LAUREL enters stage left with the bunch of flowers and paper bag and at the sight of the two men together there is renewed applause, whistles and even cheers. LAUREL waits for it to die down. LAUREL Hi Ollie, how are you? HARDY Never mind how I am - what took you so long to get here? LAUREL Well they said no visitors so I said I was your son and it worked like a charm. HARDY My son! You have a lot of nerve telling them I was your father. LAUREL I couldn’t tell them you were my mother. HARDY Of course you couldn’t. I’ve never even been married... Big laughs - the audience are loving it. HARDY What have you got there? LAUREL I brought you some hard boiled eggs and some nuts. HARDY looks to the audience, exasperated, and they laugh.  Stan and Ollie - Yellow Revisions 31.03.17   98",
      "characters": [],
      "action_text": "HARDY Now you know I can't eat hard boiled eggs and nuts! If you wanted to bring me something why didn't you bring me a box of candy? LAUREL Well, they cost too much. HARDY What has that got to do with it? LAUREL And you didn't pay me for the last box I brought you. Laughter. LAUREL offers HARDY the bag: LAUREL Have one? HARDY No. I’d rather not. (To the audience, with disgust) Hard boiled eggs and nuts... LAUREL ignores him, takes an egg out and starts to peel it and eat it. HARDY watches, incredulous, as Laurel pulls a salt cellar from his pocket and sprinkles some on. We see DELFONT smiling at what he sees on stage but, as ever, twisting his head round to make a quick mental calculation on the size of the house. Business is business...  Stan and Ollie - Yellow Revisions 31.03.17   98A We see LUCILLE, next to IDA. LUCILLE is worried, but trying to smile through it. IDA seems calm.  DELETED 115   115  INT. OLYMPIA THEATRE, DUBLIN - NIGHT 116   116 The double door routine. HARDY sweaty, but still on his feet, his and LAUREL’S timing slick as ever as one goes in one door, the other emerges through another.  INT. BACKSTAGE, OLYMPIA THEATRE, DUBLIN - NIGHT 117   117 LAUREL and HARDY, helped by their DRESSERS, hurriedly change into their battered suits and Bowlers for the finale. Outside there is clapping, cheering and whistling. As they wait in the wings, ready to go on, LAUREL is concerned with how exhausted HARDY looks - drenched in sweat, breathless from the effort he’s put in already, struggling to even get on his jacket. LAUREL You look tired out Babe - why don’t we just go out and say goodnight and finish it there? We don’t have to do the song... HARDY I’m fine... (Sudden thought) Listen, I had this idea for the picture. How about I grab Robin Hood’s staff and go to hit you with that, but instead I knock down this bees’ nest and it lands on my head? LAUREL (Smiles) That’s a swell idea. That’ll go big. The   ‘Dance Of The Cuckoos’   strikes up out front, and the c",
      "dialogue_count": 0,
      "word_count": 734
    },
    {
      "scene_number": 15,
      "slugline": "INT. OLYMPIA THEATRE, DUBLIN - NIGHT 118   118 HARDY and then LAUREL walk on together to a storm of clapping and cheering; they wait patiently for it to die down. HARDY Ladies and gentlemen we hope you’ve enjoyed our bit of fun tonight, we’ve sure enjoyed ourselves haven’t we Stanley? LAUREL We certainly have. HARDY We’ll never forget the warm welcome we’ve received here in Dublin. LAUREL Not just Dublin, but the whole of Scotland. HARDY Dublin isn’t in Scotland. LAUREL (thinking) I was wondering why we got on that boat. (realising, whispering to HARDY) We must be in Ireland. HARDY (sarcastically) We must be in Ireland! Another burst of applause. HARDY We’d like to finish tonight with a little dance... HARDY and LAUREL share a look. HARDY From our film ‘Way Out West’. Maestro... Stanley. Then, just as LUCILLE looks like she’s about to pass out with worry, she feels IDA’S hand reaching for hers. She’s shocked. She turns to her, and IDA smiles. LUCILLE smiles back, and squeezes IDA’S hand warmly, grateful that she’s there to support her at this moment. They both turn back to the stage, still holding hands.  Stan and Ollie - Yellow Revisions 31.03.17   100",
      "characters": [],
      "action_text": "On stage HARDY, in that very proper way of his, extends a hand which is taken by LAUREL - and now they are also holding hands. They bow to the audience then wait for the music cue.  Stan and Ollie - Yellow Revisions 31.03.17   100aaA As the orchestra starts   ‘At The Ball, That’s All’,   the BOYS tap their feet, then begin their dance routine once again - and we are transported back to the magic of   ‘Way Out West’ . In spite of HARDY’S physical problems and illness, his light footedness is as exquisite as ever. And although both men are now looking old, their grace and elegance defies their years. LAUREL matches HARDY every step of the way, the two dancing together like the loving couple they most surely are. We finish behind LAUREL and HARDY, silhouetted against the lights, looking out at the audience. As they come together and hold each other’s hands, we FREEZE...  Stan and Ollie - Blue Revisions 24.03.17   100aA Captions  Laurel and Hardy returned to America after the tour, but they never performed together again. Hardy’s health went into decline and, after a long illness, he died in August 1957.  Stan and Ollie - Pink Revisions 17.03.17   100A Laurel refused all offers to perform without his old partner and went into retirement. But he continued writing comedy material for Laurel and Hardy right up until his death in February 1965.  The End  Stan and Ollie - Locked White Shooting Script 22.02.17 101",
      "dialogue_count": 0,
      "word_count": 450
    }
  ]
}