{
  "slug": "steve-jobs-2015",
  "title": "steve jobs",
  "genre": "action",
  "format": "film",
  "scenes_count": 13,
  "characters_count": 2,
  "characters": [
    "STEVE",
    "LISA"
  ],
  "total_words": 27468,
  "total_dialogue": 4,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. STEVE’S DRESSING ROOM - CONTINUOUS 7   7  LISA  I tried to get it to say hello but  it’s shy.  STEVE didn’t even notice she was there. He takes a breath and  smiles...  STEVE  Yeah.  CHRISANN points to the Mac that’s sitting on a table--  CHRISANN  So that’s it?  STEVE  That’s it.  CHRISANN  (pause)  I don’t get it.  STEVE  I know.  CHRISANN  What are people going to do with  it?  STEVE  (for Chrisann’s benefit)  Lisa, how old are you now?  CHRISANN  You know how old (she is).  STEVE  (over)  How old are you, Lisa?  LISA  Five.  STEVE  Come sit here for a minute. You  know what this is?  LISA sits at the table in front of the Mac--  LISA  It’s a computer.  STEVE JOBS - Shooting Script 03/19/15   25.",
      "characters": [],
      "action_text": "STEVE  It’s a computer. Can I borrow your  hand for a second?  STEVE puts his hand on top of LISA’s and demonstrates the  mouse.  STEVE (CONT’D)  Point that arrow...and click. You  don’t have to but if you want you  can play with it. Nothing you can  do will break it so just do  whatever you want with it.  CHRISANN  What are you doing?  While STEVE and CHRISANN continue, LISA becomes engaged with  the computer. She can hear her parents of course, but the  computer and what she’s doing with it become a welcome  distraction.  STEVE  I’m paying you exactly what the  court ordered me to pay you.  CHRISANN  $385 a month.  STEVE  I’m not the one who decided on that  amount.  CHRISANN  And I’m asking you how you feel--if  you feel alright, if it feels  alright to you--that your daughter  and her mother--  STEVE  She’s not--  CHRISANN  --your daughter, who’s   sitting  right   there --and her mother are on  welfare while you’re worth 441  million dollars for making   that ?  STEVE  (pause)  I’m proud to say that Apple donates  free computers to underfunded  schools and we’ll be doing more of--  STEVE JOBS - Shooting Script 03/19/15   26.  CONTINUED: 7   7 CHRISANN  What?  STEVE  Apple donates millions of dollars  worth of computers to schools.  CHRISANN  What does that (have to do with--)  STEVE  (over)  Imagine an underprivileged kid who  has their favorite teacher with  them 24 hours. We’re minutes away  from being able to do that.  CHRISANN  In your head was that an answer to  my question?  STEVE  Tell me the question again.  CHRISANN  I wasn’t the one who sued you for  child support, San Mateo County  sued you.  STEVE  No let me explain what happened,  ‘cause I have plenty of time right  now.  There’s a knock on the door and ANDREA opens it--  ANDREA  Excuse me, you have a visitor.  STEVE (WOZ) WOZNIAK sticks his head in the door. WOZ is  amiable. He’s not looking for trouble and while he’s an  undisputed genius, he doesn’t have Steve’s anger or Steve’s  polish.  WOZ  I",
      "dialogue_count": 0,
      "word_count": 2719
    },
    {
      "scene_number": 2,
      "slugline": "EXT. LAWN - SAME TIME 14   14  WOZ  And thank God I won that argument  ‘cause--  STEVE  Woz--  WOZ  --the open system is what people  love about the machine and it’s why  it sold and still sells.  QUICK CUT TO:  INT. GARAGE - NIGHT 15   15  STEVE  An open system, we’re not doing an  open system.  WOZ  Of course we are. That’s what  people want and the breakthrough on  the Apple II is--  STEVE  People don’t know what they want  until you show it to them. Edison  didn’t do market research on the  light bulb versus the candle.  WOZ  I think it went without saying that  people would rather flip a switch  than, you know, burn whale oil. Let  me explain this world to you.  Serious users--  STEVE  Which   world are you explaining?  WOZ  My world.  STEVE  You live on the Planet Wozniak.  STEVE JOBS - Shooting Script 03/19/15   41.",
      "characters": [],
      "action_text": "WOZ  Serious users want to customize and  modify, they want to jack it up,  they want hardware engineers like me  to expand its capabilities, okay?  Keyboards for music, better sound  boards, better display boards--  CUT BACK TO:  EXT. LAWN - SAME TIME 16   16  WOZ  And it’s why there are 3000 people  here today.  QUICK CUT TO:  INT. GARAGE - SAME TIME 17   17  WOZ  --improved memory cards,   they want  ports!  STEVE  They don’t get a vote. When Dylan  wrote “Shelter From the Storm” he  didn’t ask people to contribute to  the lyrics. Plays don’t stop so the  playwright can ask the audience  what scene they’d like to see next.  A painter--  WOZ  Hobbyists--  STEVE  We are on the verge of a tectonic--  hobbyists?!-- a printer and a modem,  two slots.  CUT BACK TO:  STEVE JOBS - Shooting Script 03/19/15   42.  CONTINUED: 15   15",
      "dialogue_count": 0,
      "word_count": 295
    },
    {
      "scene_number": 3,
      "slugline": "EXT. LAWN - SAME TIME 18   18  WOZ  The slots are what allowed the  Apple II to run, for just one  example, VisiCalc, which my guess  single-handedly sold between two  and three-hundred thousand  machines.  STEVE  The Apple II team has my affection  but I’m not loving up a seven year  old product at the Mac launch.  QUICK CUT TO:  INT. GARAGE - SAME TIME 19   19  WOZ  Computers aren’t paintings.  STEVE  Fuck you. I’m gonna say fuck you  every time you say that until you  either die or stop. Try it.  WOZ  Steve--  STEVE  Say it.  WOZ  Computers aren’t (paintings).  STEVE  (over)  Fuck you. Yes they are and what I  want is a closed system. End to end  control. Completely incompatible  with anything.  WOZ  Computers aren’t supposed to have  human flaws. Why would we want to  incept this one with yours?  The two friends look at each other silently...  STEVE JOBS - Shooting Script 03/19/15   43.",
      "characters": [
        "STEVE"
      ],
      "action_text": "We’ll know soon enough if you’re  Leonardo Da Vinci or just think you  are but in the meantime--  STEVE  --in the meantime the Apple II’s  done. 7 years. It was a great run.  You should go out in the   house and  take your seat.  WOZ  (pause)  Alright.  WOZ heads back up the hallway and calls over his shoulder--  WOZ (CONT’D)  The Mac is Jeff Raskin’s.  STEVE looks at WOZ...  STEVE  (pause)  Say it for me.  WOZ  A computer’s not a (painting).  STEVE  (over)  Fuck you.  WOZ  (laughing a little)  Alright.  WOZ takes off as ANDREA CUNNINGHAM comes up to STEVE--  ANDREA  (whispering)  Hey! Joel Pforzheimer’s on the  other side of that door.  They both keep their voices down.  STEVE  (pause)  GQ?  ANDREA  (over)  GQ. Steve, he’s asking for some  clarification on Xerox PARC.  STEVE JOBS - Shooting Script 03/19/15   45.  CONTINUED: A21   A21  WOZ (CONT'D) STEVE  He’s asking about PARC?  ANDREA  You need to go in there. I want him  to hear it from you (and not  someone else.)  STEVE  (over)  How does he know about (PARC)?  ANDREA  (over)  I don’t know but he does. Is there  something I need to know?  STEVE shakes his head “no,” opens the door to a VIP room and  walks into--  INT. VIP ROOM - CONTINUOUS 21   21  --where the dozen or so people give STEVE a round of  applause.  STEVE  Thanks guys. We’re gonna start, why  don’t you go take your seats. Joel,  stick around a second?  The VIP’s file out, shaking STEVE’s hand or patting his  shoulder or giving him a hug--”Good luck,” “Knock ‘em dead,”  “Here we go,” etc.  As soon as the room is empty--  JOEL  I’ve been trying to get an answer  on--  STEVE  PARC stands for Palo Alto Research  Center--Xerox PARC. In the ‘70s  they came up with something called  “Gooey”--G-U-I--Graphical User  Interface. Instead of typing  commands they used the metaphor of  a desktop and roughly the same idea  as a McDonald’s cash register. You  press a button with a picture of a  cheeseburger.  STEVE JOBS - Shooting Script 03/19/15   46.  CONTINUED: ",
      "dialogue_count": 3,
      "word_count": 6871
    },
    {
      "scene_number": 4,
      "slugline": "INT. CORRIDOR - CONTINUOUS 38   38  JOANNA’s waiting.  STEVE  Back on stage?  JOANNA  We’re out of time. They’ve got to  mop the stage and open the house.  STEVE looks at her...  STEVE  (pause)  If it crashes it crashes, right?  JOANNA  You’ll make a joke.  STEVE  I’ll make a joke.  JOANNA  If it crashes it crashes.  STEVE  It’s a good slogan. “NeXT: If it  Crashes it Crashes.”  JOANNA  (quietly)  I’m not just talking about the  demo. Steve? If it tanks we don’t  swallow cyanide, we go back to the  drawing board.  STEVE  No more drawing boards. You invent  the Edsel twice and you don’t get  anymore drawing boards. So let’s  not--  JOANNA  Tell me what the plan is. You have  to tell me the plan because I don’t  know. You’re walking around like  you’ve got can’t-lose cards.  STEVE  The plan will reveal itself to you  when you’re ready to see it.  STEVE JOBS - Shooting Script 03/19/15   84.",
      "characters": [
        "LISA"
      ],
      "action_text": "JOANNA  Will I have to drop acid?  STEVE  Couldn’t hurt.  JOANNA  Is there a plan?  STEVE  Have I ever let you down?  JOANNA  Every single goddamn time.  STEVE  Then I’m due.  JOANNA  Is there?  STEVE  Joanna, there is a plan. But I  don’t want to put you in a position  where you’re lying to people.  JOANNA considers this a moment...  JOANNA  (pause)  Start 15 minutes late so Avie (can  recompile and try to give us a  fighting)--  STEVE  Jesus Christ, how many times--  JOANNA  Fine.  STEVE  --are we gonna have this con--we’re  not starting late. Ever. We’re not  ever starting late.  JOANNA  But where do you come down on  starting late?  STEVE takes a moment...  STEVE JOBS - Shooting Script 03/19/15   85.  CONTINUED: 38   38 STEVE  Lisa’s been doing this thing where  she asks me about stuff I’ve  already told her. She asks me  questions and I know she already  knows the answers. What’s that  about?  JOANNA  Kids do that when they’re scared  one of their parents is in a bad  mood. They try to get you talking  about something you like. It’s very  common and can be treated by  talking to her about things   she  likes.  STEVE  (pause)  Do have any training or experience  in this field?  JOANNA  No.  STEVE  Tell ‘em to open the house.  STEVE heads down the hall a little, opens the door and walks  into--  INT. HIS DRESSING ROOM - CONTINUOUS 39   39  --where CHRISANN is waiting.  STEVE  Where’s Lisa?  CHRISANN  She’s around.  STEVE  What does that mean?  CHRISANN  She’s running around the building.  STEVE  An hour ago you said you were  taking her to school.  STEVE JOBS - Shooting Script 03/19/15   86.  CONTINUED: 38   38 CHRISANN  She begged me to let her stay. There  are fathers who would so love--  STEVE  It is wrong, okay? It is morally  wrong, it is parentally wrong, it  is wrong for you to use Lisa as a  way of getting money from me. She  will know if she doesn’t already  that that is your primary use for  her and (she will hate you for it  for the rest of your life).",
      "dialogue_count": 1,
      "word_count": 3300
    },
    {
      "scene_number": 5,
      "slugline": "INT. BALCONY LOBBY - SAME TIME 47   47  SCULLEY  Is it?  STEVE  Hm?  SCULLEY  Don’t play stupid, you can’t pull  it off.  STEVE  You came here to ask me--  QUICK CUT TO:  STEVE’S FOYER - NIGHT 48   48  STEVE opens the door and SCULLEY is standing there.  SCULLEY  Sorry to come by unannounced.  CUT BACK TO:  INT. BALCONY LOBBY - SAME TIME 49   49  STEVE  --why people think you fired me?  SCULLEY  Yeah.  STEVE  Seriously?  SCULLEY  Yeah.  STEVE  I haven’t seen or spoken to you in  three years.  SCULLEY  Why do people think I fired you?  STEVE  (pause)  Just confirm something for me,  okay?   You   liked the ad, right?  STEVE JOBS - Shooting Script 03/19/15   105.  (MORE)",
      "characters": [],
      "action_text": "The commercial. “1984.” You liked  it?  QUICK CUT TO:  INT. STEVE’S LIVING ROOM - NIGHT 50   50  SCULLEY  When are you gonna get furniture?  STEVE  It’s not an easy process.  SCULLEY  It is, you buy a couch and take it  from there.  STEVE  I’ve been thinking a lot about  couches. What do we use them for?  SCULLEY  Steve--  STEVE  I’d be really surprised if you came  here to talk about interior  decorating.  CUT BACK TO:  INT. BALCONY LOBBY - SAME TIME 51   51  SCULLEY  I liked the ad very much.  STEVE  You did.  SCULLEY  You know I did, now please answer  my question.  STEVE  You’re lying, son of a bitch, you  tried to kill it.  QUICK CUT TO:  STEVE JOBS - Shooting Script 03/19/15   106.  CONTINUED: 49   49  STEVE (CONT'D)",
      "dialogue_count": 0,
      "word_count": 248
    },
    {
      "scene_number": 6,
      "slugline": "INT. STEVE’S LIVING ROOM - NIGHT 52   52  SCULLEY  It’s time to take a hard look at  the Mac.  STEVE  It’s past time. It’s overpriced, we  need to drop it to nineteen ninety-  five. We need to double the  marketing budget, put more bodies  on an internal hard drive and  invest in FileServer.  SCULLEY  Where would that money come from?  STEVE  It would come from finally getting  rid of the Apple II.  CUT BACK TO:  INT. BALCONY LOBBY - SAME TIME 53   53  SCULLEY  Where the hell did you get the idea  I tried (to kill the ad?)  STEVE  Lee Clow.  SCULLEY  Lee’s wrong.  STEVE  He’s lying?  SCULLEY  He’s mistaken.  STEVE  You agreed with the board.  SCULLEY  I understood the board’s concerns  but I certainly did not (try to  kill--)  STEVE  The board’s concern that we didn’t  show the product.  STEVE JOBS - Shooting Script 03/19/15   107.",
      "characters": [],
      "action_text": "SCULLEY  Among other things, but my  (question was--)  STEVE  (over)  What other things? You said among  other things.  QUICK CUT TO:  INT. STEVE’S LIVING ROOM - NIGHT 54   54  SCULLEY  The Apple II is the only thing  making money.  STEVE  That’s because we keep selling it.  SCULLEY  (pause--this is awkward  and hard)  I can’t diagram that logic but--  STEVE  We keep making it so people keep--  the Mac needs to sell for $1995.  SCULLEY  There is no market research telling  us the Mac is failing because it’s  overpriced. It’s telling us that  people don’t like it because they  think it doesn’t DO anything, it’s  closed end to end. We didn’t know  it wasn’t what people wanted but it  isn’t, they want slots, they want  choices, they want options. The way  we buy stereos, mix and match  components.  STEVE  John, listen to me. Whoever said  the customer is always right was, I  promise you, a customer.  SCULLEY  My job is to make a recommendation  to the board.  STEVE JOBS - Shooting Script 03/19/15   108.  CONTINUED: 53   53 STEVE  Recommend that we drop the price,  double the marketing--  SCULLEY  I can’t.  STEVE  Well what are you gonna do,  recommend that we kill the Mac?  SCULLEY  I already have, Steve.  STEVE  (pause)  What?  CUT BACK TO:  INT. BALCONY LOBBY - SAME TIME 55   55  SCULLEY  Among other things, it was set in a  dystopian galaxy, it took place on  a planet where we don’t live, it  was dark and the opposite of our  brand.   And   we didn’t show the  product. People talked about the ad  but most of them didn’t know what  we were selling.  QUICK CUT TO:  INT. STEVE’S LIVING ROOM - NIGHT 56   56  STEVE  When?  SCULLEY  Just now. An hour ago. I’m coming  from Markkula’s house.  STEVE  And what did he say?  (beat)  What did he say?  STEVE JOBS - Shooting Script 03/19/15   109.  CONTINUED: 54   54 SCULLEY  What do you want the headache for?  Moving money around, figuring out  what--invent something new. I’ll  give you a team, you can sit in  Maui, the resorts c",
      "dialogue_count": 0,
      "word_count": 993
    },
    {
      "scene_number": 7,
      "slugline": "INT. STEVE’S LIVING ROOM - NIGHT 60   60  STEVE  You’re really talking about killing  the Mac.  SCULLEY  I’m euthanizing the Mac, it’s a  mercy killing.  STEVE  I’m gonna take this to the board  myself.  SCULLEY  Don’t do that.  STEVE  I am doing that.  SCULLEY  You can’t.  CUT BACK TO:  INT. BALCONY LOBBY - SAME TIME 61   61  STEVE  You sure it wasn’t Lee Clow who  dragged his feet selling the 60?  SCULLEY  At my direction, Steve, you think  he would have done that on his  own?! Taken it on himself?!  STEVE  Yes, I think he would have done  what it took to save it from you!  SCULLEY  I was the only thing protecting it!  STEVE  You didn’t want the ad because you  were trying to kill the Mac two  months before it launched!  SCULLEY  You are fucking delusional!  STEVE JOBS - Shooting Script 03/19/15   113.",
      "characters": [],
      "action_text": "And now it’s like two boxers unclench after a furious series  of punches, move apart and take a breath...  STEVE  Can I mention something to you?   I  have no earthly idea why you’re  here.  SCULLEY  The story...of why and how you left  Apple...which is quickly becoming  mythologized...isn’t true.  QUICK CUT TO:  INT. STEVE’S LIVING ROOM - NIGHT 62   62  STEVE  I’m going to the board.  SCULLEY  Don’t press it with the board,  Steve. I’m imploring you.  STEVE  Why?  SCULLEY  They believe you’re no longer  necessary to this company.  We stay with STEVE being silent for a long moment before we--  CUT BACK TO:  INT. BALCONY LOBBY - SAME TIME 63   63  STEVE  I’m not your publicist.  SCULLEY  I get hate mail. Death threats.  STEVE  And I’m not your employee.  SCULLEY  I get death threats. My kids get  taunted. Why do people think I  fired you?  STEVE JOBS - Shooting Script 03/19/15   114.  CONTINUED: 61   61 STEVE  (pause)  Joanna’s gonna call my name in a  second.  JOANNA (O.S.)  Steve?  STEVE  That was unrehearsed.  (calling out)  Yeah, I’ll be just a second.  SCULLEY  I gave you your day in court.  STEVE  You   gave   me--  SCULLEY  I gave the board a clear choice. I  said do you want to invest in the  Apple II or the Mac and they chose  the Apple II--  STEVE  The same people who wanted to dump  the Super Bowl spot--  SCULLEY  (rides over STEVE)  --and then I got on a plane to  China.  QUICK CUT TO:  INT. CATHAY PACIFIC AIRLINES FIRST CLASS LOUNGE - NIGHT 64   64  RAIN BEATS AGAINST THE WINDOW as we see SCULLEY sitting at  the bar. A CONCIERGE steps up--  CONCIERGE  Mr. Sculley?  CUT BACK TO:  INT. BALCONY LOBBY - SAME TIME 65   65  SCULLEY  Or I almost got on but I got a call  in the lounge.  STEVE JOBS - Shooting Script 03/19/15   115.  CONTINUED: 63   63 STEVE  Who made that call?  SCULLEY  It doesn’t matter.  STEVE  It matters to me. Who made the  call?  QUICK CUT TO:  INT. CATHAY PACIFIC AIRLINES FIRST CLASS LOUNGE - NIGHT 66   66  SCULLEY is on the phone at the d",
      "dialogue_count": 0,
      "word_count": 625
    },
    {
      "scene_number": 8,
      "slugline": "INT. BALCONY LOBBY - SAME TIME 69   69  STEVE  You took me off the Mac and it was  bad business. The quorum call was a  homicide.  SCULLEY  Right there is the part that’s  bullshit, my friend, it was a  suicide, because you knew your  cards and I showed you mine, I  showed   you mine and you did it  anyway.  QUICK CUT TO:  INT. CHRISANN’S KITCHEN - NIGHT 70   70  CHRISANN is arguing with STEVE while six-year-old LISA has  her face buried in her homework at the kitchen table. Rain is  beating against the windows.  CHRISANN  Everything’s about her all of a  sudden. All the time. All she does  is come home and do homework and  study and ask to see you.  Everything’s about her.  Everything’s about you. And I’m the  maid.  STEVE  I don’t think you’re the maid and I  guarantee you’re the only parent in  America who’s complaining about her  kid spending too much time  studying.  The DOORBELL RINGS--  STEVE (CONT’D)  Who comes over to your house this  late?  CHRISANN exits the kitchen to get the door. STEVE looks at  LISA...  STEVE (CONT’D)  (quietly--confidentially)  It’s almost 10.  STEVE JOBS - Shooting Script 03/19/15   117.  (MORE)",
      "characters": [],
      "action_text": "When you finish with that you  should get ready for bed, okay?  LISA  Can I live with you?  What? STEVE’s stunned by the question that was  heartbreakingly sincere and simple and came out of nowhere...  He’s about to say something--anything--when CHRISANN comes  back in with ANDY HERTZFELD.  ANDY  I tried your house first. Sculley’s  called an emergency meeting of the  board.  STEVE’s still thinking about what LISA just asked--  STEVE  (pause)  Wait, what?  ANDY  Sculley’s getting the board  together.  STEVE  When?  ANDY  Right now.  STEVE  He’s supposed to be on his way to  China.  ANDY shakes his head “no”--  STEVE (CONT’D)  Somebody told him.  (to CHRISANN)  I have to go to--she should get  ready for bed when she’s done with  this.  CHRISANN  Good tip.  STEVE  (to LISA)  I’m sorry. Lees?...I have to go.  STEVE JOBS - Shooting Script 03/19/15   118.  CONTINUED: 70   70  STEVE (CONT’D) STEVE and ANDY head out as we--  CUT BACK TO:  INT. BALCONY LOBBY - SAME TIME 71   71  SCULLEY  What’d you   think   I was gonna do?  I’m okay losing but I’m not gonna  forfeit.  STEVE  I’m not okay losing.  QUICK CUT TO:  INT. APPLE BOARD ROOM - NIGHT 72   72  Rain is beating against the windows. BOARD MEMBERS are there  in various different dress--some from an evening out. STEVE  stands to the side while SCULLEY addresses the board --  SCULLEY  We’re losing market share and the  Mac is losing money. Our only hope  is the Apple II which is stagnating  because of it’s soon-to-be-obsolete  DOS. Users are already rigging  their machines to run with the CP/M  operating system that’s been built  to run on Intel. I can’t put it  more simply than this--we need to  put our resources into updating the  Apple II.  STEVE  By taking resources from the Mac.  SCULLEY  It’s failing, that’s a fact.  STEVE  It’s overpriced.  SCULLEY  There is no evidence--  STEVE  I’m the evidence! I am the world’s  leading expert on the Mac, John,  what’s   your   resume?!  STEVE JOBS - Shooting Script 03/19/15   1",
      "dialogue_count": 0,
      "word_count": 727
    },
    {
      "scene_number": 9,
      "slugline": "INT. BALCONY LOBBY - SAME TIME 73   73  SCULLEY  You’ve done an outstanding job over  the years of cultivating the press  and by that I mean manipulating it  ‘cause none of them, and none of  their editors, and none of the  editors’ publishers, to this day,  have any idea that you forced it.  That you forced the board even  after I told you exactly what  they’d do. Which is exactly what  they did. Unanimously.  STEVE  I don’t have any trouble  remembering that, John, because of  it being the worst night of my life  and I forced a vote because I  believed I was right, I still  believe I’m right...and I’m right.  I bled that night and I don’t  bleed. But time’s done its thing  and I really haven’t thought about  it in a while. I absolutely  understand why you’re upset and I  want people to know the truth too.  SCULLEY looks at STEVE...he’s lying.  JOANNA (O.S.)  It’s time.  STEVE  (calling to JOANNA)  Got it.  SCULLEY  (pause)  You’re gonna end me, aren’t you.  STEVE smiles...  STEVE  (smiles--almost laughs)  You’re being ridiculous. I’m gonna  sit center court and watch you do  it yourself. Then I’m gonna order a  nice meal with a ‘55 Margaux and  sign some autographs.  STEVE JOBS - Shooting Script 03/19/15   121.",
      "characters": [],
      "action_text": "SCULLEY  Jesus (Christ).  STEVE  (over)  You want my help, Pepsi Generation?  Don’t send Woz out to slap me  around in the press. Anybody else.  You, Markkula, Arthur Rock, anyone  but Rainman. Don’t manipulate him  like that. Whatever you may think  I’m always gonna protect him.  JOANNA (O.S.)  Come on, Steve.  STEVE  That’s what men do. I can’t start  late.  STEVE exits out into--  INT. CORRIDOR - CONTINUOUS 74   74  --where JOANNA’s waiting. They walk down the corridor in  silence for a few moments before--  STEVE  I don’t think there was any way to  detect a chip on my shoulder.  JOANNA  Did you know back at Bandley, the  Mac team gave an award every year  to the person who could stand up to  you?  STEVE  No.  JOANNA  I won three years in a row.  STEVE  Cool.  They walk through a door and are--  INT. BACKSTAGE - CONTINUOUS 75   75  --where JOANNA pushes STEVE up against the closest wall.  STEVE JOBS - Shooting Script 03/19/15   122.  CONTINUED: 73   73 STEVE  What the hell--  JOANNA reaches into his pocket and pulls out the folded  MacWorld article.  JOANNA  This--Guy Kawasaki in MacWorld--he  accidentally got it right, didn’t  he? You’ve been dragging your feet  on the NeXT OS until you can figure  out what Apple’s gonna need.  Again we can HEAR the rock concert energy of the audience  waiting for Steve...  STEVE  Even if that were true it doesn’t  sound diabolical to me.  STEVE nods to the STAGE MANAGER--  STAGE MANAGER  (into headset)  House to half.  We HEAR the audience CHEER.  We also HEAR a synthesizer introduction to a piece of music  that will crash in in just a moment--  JOANNA  I’m your closest confidant, your  best friend, your thing--what do  you call it--work wife. This whole  time, the last three years--  STAGE MANAGER  (into headset)  House out. Stand-by VO 1.  JOANNA  --when did you change your mind and  start building the Steve Jobs  Revenge Machine?  STEVE  (pause)  You remember Skylab? It was an  unmanned satellite NASA sent up in  the early ",
      "dialogue_count": 0,
      "word_count": 1325
    },
    {
      "scene_number": 10,
      "slugline": "INT. SYMPHONY HALL - SAME TIME 93   93  In the audience we see some familiar faces among the dozens  of APPLE STAFFERS working the rehearsal. JOANNA, WOZ, ANDY  HERTZFELD and the reporter JOEL PFORZHEIMER is there too.  Everyone is 10 years older than the last time we saw them.  STEVE (O.S.)  This thing has 100MB Ethernet as  standard, and why? Because we’re  seeing these high speed networks in  homes now. Ten percent of the homes  in Silicon Valley now have Class  Five wiring in them.  TITLE:  1998  Davies Symphony Hall  STEVE’s on stage in front of a giant screen showing changing  slides that reflect whatever he’s mentioning at the moment.  He’s dressed in dark jeans, a white shirt buttoned up to the  neck and a black sport jacket. On a small table, which is in  the dark at the moment, sits a computer under a dark silk  sheet.  STEVE’s loose and having a good time with the hundred or so  employees in the audience who are revved up for the big  morning.  STEVE (CONT’D)  A fast modem and also a 4MB IrDA  built in. You wanna beam your  digital photographs from your  digital camera? It’s built in to  every product.  (to his employees)  Check it out--no notes, no note  cards--ready?  (back to it and faster now  to play with the  employees in the house)  We’re going to the new generation  of IO--12Mb USB, two ports--we’re  leaving the old Apple IO behind.  Stereo Surround Sound built in to  every product, a great keyboard and  the coolest mouse you’ve ever seen.  This time we used real mice.  STEVE JOBS - Shooting Script 03/19/15   128.",
      "characters": [],
      "action_text": "JOANNA  (calling to the stage)  We’re opening the house in 10  minutes, Steven, you want to stop  horsing around?  STEVE  Bless my eyes, that’s Steve Wozniak  sitting out there.  The APPLE employees give him a cheer and WOZ gives a sheepish  wave.  STEVE (CONT’D)  Give yourselves a treat and ask Woz  if he happens to have the correct  time.  JOANNA  I have the correct time and we’re  running out of it. “A great  keyboard.”  STEVE  A great keyboard and the coolest  mouse you’ve ever seen. This is  what those things look like today.  On the screen flashes a picture of a bulky PC. Some people in  the rehearsal audience who are seeing the full production for  the first time laugh.  STEVE (CONT’D)  And now I’d like to show you what  they’re going to look like  tomorrow. This is the iMac.  STEVE yanks the dark silk sheet off an iMac as a pool of  perfect light comes up on the table.  CHEERS and APPLAUSE from the APPLE EMPLOYEES.  STEVE clicks the mouse and the screen shows a lightning fast  succession of applications complete with a heart-racing  percussion score--  --after which the screen fills with the words “Hello  (again).”  The hundred or so people sitting and standing around out in  the house CLAP AND CHEER.  STEVE JOBS - Shooting Script 03/19/15   129.  CONTINUED: 93   93 STEVE (CONT’D)  (pause)  That was cool. Why did I like that  better than I usually do?  JOANNA  I don’t know.  STEVE  Something was different.  ANDREA CUNNINGHAM, the publicist from the Mac launch, is  standing at the foot of the stage--  ANDREA  Hey stupid.  STEVE looks at her--  STEVE  (pause)  I think she’s talking to one of you  guys.  ANDREA  Did you notice a difference?  STEVE  That’s what I’m-- the exit signs  were off!  ANDREA  Full blackout.  STEVE  You did it.  ANDREA  We wired all the exit lights to our  board, they go out for seven  seconds with the cue and come back  on again in theory.  STEVE  We think that’s legal?  ANDREA  No, we’re very certain it’s not.  You want to see some quo",
      "dialogue_count": 0,
      "word_count": 3982
    },
    {
      "scene_number": 11,
      "slugline": "INT. CORRIDOR - CONTINUOUS 99   99  The hall is lined with blown up photographs of Ghandi, John  Lennon, Louis Armstrong, etc.--all from the “Think Different”  campaign.  JOEL  (pointing to a photo)  Who’s this one?  STEVE  Alan Turing. He single handedly won  World War II and for an encore  invented the computer but he won’t  be part of the campaign.  JOEL  Why not?  STEVE  ‘Cause you just had to ask me who  he was.  STEVE opens the door and they walk into--  INT. BACKSTAGE AREA - CONTINUOUS 100   100  --where AVIE and his ENGINEERS are doing last minute runs and  adjustments on the iMacs that’ll be running the demo in a few  minutes.  And we can HEAR the CROWD out in the house...  STEVE  (to AVIE)  Can I see a new shark?  AVIE hits a key and the screen fills with a picture of a  PowerBook G3 Laptop and a great white shark with its teeth  bared.  STEVE (CONT’D)  I like it better than the old  shark.  AVIE  Sharks.  STEVE  Sharks.  STEVE JOBS - Shooting Script 03/19/15   153.",
      "characters": [],
      "action_text": "JOEL  How many sharks did you go through?  STEVE  A couple.  AVIE  This is the 39th.  STEVE  (pointing to JOEL)  We’re on the record.  AVIE  39 sharks.  STEVE  Okay.  AVIE  You know what’s special about this  shark?  JOEL  What?  AVIE  No, I’m really asking ‘cause it  looks exactly like the other 38  sharks to me.  STEVE  Let me see it with the cue. From  the profile.  STAGE MANAGER  This is Cue 92B.  STEVE  (reciting)  This is a side profile here. And  this is what it looks like from the  back. And one more thing: It eats  Pentium notebooks as a light snack.  (good)  This is the shark, I really like  it. Nobody gets it right the first  time but I should have been shown  this shark 15, 20 fish ago.  AVIE  You probably were.  STEVE JOBS - Shooting Script 03/19/15   154.  CONTINUED: 100   100 STEVE  Lock it in.  STAGE MANAGER  Ten minutes.  JOEL  He killed himself by taking a bite  of a poison Apple. Alan Turing.  STEVE  Yeah. There should be statues of  that man. His name should be on the  lips of schoolchildren.  JOEL  The rainbow flag Apple with a bite  taken out, that’s where it came  from?  STEVE  No, we picked it off a list of  friendly sounding words. But  wouldn’t it be great if that had  been the story behind it?  (beat)  Anyway, I can’t use him in the  campaign.  WOZ, sitting out in the house, calls up to the stage--  WOZ  (calling)  Steve.  STEVE looks out...  WOZ (CONT’D)  I kind of liked the last shark.  AVIE  (without looking up)  Fuck you.  WOZ  I wanted to ask you a favor.  STEVE  My friend, a long time ago you  asked me a favor before a product  launch and I said no. You wanted me  to acknowledge the Apple II and I--  STEVE JOBS - Shooting Script 03/19/15   155.  CONTINUED: 100   100 WOZ  Hang on. If you’re about to say you  were wrong I want to prepare this  reporter.  STEVE  I was one hundred percent right and  you were spectacularly wrong but I  still owe you a favor so name it.  WOZ  Steve?  STEVE  But it can’t be about acknowledging  the Apple II",
      "dialogue_count": 0,
      "word_count": 2669
    },
    {
      "scene_number": 12,
      "slugline": "INT. ESPRESSO ROMA CAFE - NIGHT 105   105  STEVE  Then 10 years later, DEC invents  the mini-computer and IBM dismisses  it as too small to do serious  computing.  SCULLEY  They weren’t close enough to the  future to see it by then?  STEVE  DEC becomes a billion dollar  corporation and IBM decides they  should maybe get into the computer  business.  The owner of the restaurant, a balding Syrian-American named  JANDALI comes over to the table.  JANDALI  Mr. Steve Jobs.  STEVE  Jandali, say hello to John Sculley.  Jandali owns this place and John’s  the CEO of Pepsi but I’m trying to  get him to move to Cupertino and  put a dent in the universe.  CUT BACK TO:  INT. STEVE’S DRESSING ROOM - SAME TIME 106   106  SCULLEY  You never told me that.  STEVE  A lawyer couple adopted me first  and then gave me back after a  month. They changed their mind.  QUICK CUT TO:  INT. ESPRESSO ROMA CAFE - NIGHT 107   107  JANDALI  (to SCULLEY)  Do you eat vegan as well?  STEVE JOBS - Shooting Script 03/19/15   169.",
      "characters": [],
      "action_text": "SCULLEY  No, I’ll eat anything.  STEVE  Why don’t you start us off with a  Mediterranean lettuce salad with  purslane, mint, cucumbers--  JANDALI  And the sumac-lemon vinaigrette?  STEVE  Thanks.  JANDALI heads away as STEVE continues--  STEVE (CONT’D)  Ten years later, 1977, and another  young company called Apple invents  the first personal computer--  SCULLEY  --and IBM dismisses it as  unimportant to their business.  CUT BACK TO:  INT. STEVE’S DRESSING ROOM - SAME TIME 108   108  STEVE  Then my parents adopted me. My  biological mother had stipulated  that whoever took me had to be  college educated, wealthy and  Catholic. Paul and Clara Jobs were  none of those things so my  biological mother wouldn’t sign the  adoption papers.  QUICK CUT TO:  INT. ESPRESSO ROMA CAFE - NIGHT 109   109  SCULLEY  In ‘81 the Apple II becomes the  world’s most popular computer and  now IBM gets into the game with the  PC.  STEVE JOBS - Shooting Script 03/19/15   170.  CONTINUED: 107   107 STEVE  Apple and IBM each invest upwards  of 50 million in R&D and another 50  million in advertising.  SCULLEY  It’s a shake down. They want to get  rid of the weaker companies.  STEVE  The weaker companies are going  bankrupt. IBM wants it all.  CUT BACK TO:  INT. STEVE’S DRESSING ROOM - SAME TIME 110   110  SCULLEY  What happened?  STEVE  There was a legal battle that went  on for a while and my mother said  she refused to love me for the  first year, you know in case they  had to give me back.  SCULLEY  You can’t refuse to love someone,  Steve.  STEVE  Yeah it turns out you can.  QUICK CUT TO:  INT. ESPRESSO ROMA CAFE - NIGHT 111   111  SCULLEY  And now IBM’s got its guns trained  on you.  STEVE  Apple is the only thing standing  between Blue and industry  domination.  SCULLEY  You said you were going to tell me  what you have in the testing stage.  STEVE JOBS - Shooting Script 03/19/15   171.  CONTINUED: 109   109 STEVE  The most efficient animal on the  planet is a condor. The most  ineffici",
      "dialogue_count": 0,
      "word_count": 977
    },
    {
      "scene_number": 13,
      "slugline": "INT. STEVE’S DRESSING ROOM - SAME TIME 118   118  SCULLEY  Don’t you think you should talk to  him?  STEVE  He’d probably find a reason to sue  me.  SCULLEY sees STEVE clearly...maybe for the first time.  SCULLEY  Ah...Steve.  STEVE  (beat)  John, if you’re here about your  legacy you need to form a line  behind Wozniak.  SCULLEY  Woz is gonna be fine. I’m the guy  who fired Steve Jobs.  (beat)  Rich, college-educated and  Catholic.  There’s a KNOCK at the door--  JOANNA (O.S.)  Steve? It’s time.  STEVE  I’ve gotta go.  STEVE stops at the door--  STEVE (CONT’D)  (pause)  Did I do this? Screw it up?  SCULLEY takes a moment and then says something he’s not sure  he means--  SCULLEY  Let’s let it go now. It has to be  time.  STEVE  (pause)  It was the stylus, John.  STEVE JOBS - Shooting Script 03/19/15   175.",
      "characters": [],
      "action_text": "SCULLEY  What?  STEVE  I killed the Newton because of the  stylus. If you’re holding a stylus  you can’t use the other five that  are attached to your wrist.  (pause)  The things we could have done  together.  SCULLEY  (pause)  God, the things we could have done.  STEVE opens the door and walks out into--  INT. CORRIDOR - CONTINUOUS 119   119  The hallway’s a little crowded now with Apple employees  lining the walls including JOANNA. They’ll serve as an escort  backstage but right now, coming down the hall toward STEVE--  --is LISA. At 19 she’s a beautiful young woman with a  striking resemblance to her father. She’s wearing a coat and  has the same headphones around her neck that we saw her in  when she was nine. She’s nothing like a stereotypical  teenager--she’s without affect and only uses irony in very  small doses. We’re aware that she’s ill at ease and self-  protective and uncomfortable.  She walks down the hallway which is lined with “Think  Different” posters that have a picture of the iMac.  STEVE watches her walk toward him--he’s too worn out now to  have a real confrontation with her but he’ll be slowly forced  into it. He takes his arm to move her to the side of the  corridor and he does his best to speak privately while almost  surrounded by people.  STEVE  (speaking quietly in  Lisa’s ear)  I’m paying your tuition. Are you  crazy? Of course I’m paying your  tuition.  LISA  (quietly in his ear)  I must have misunderstood when you  said you weren’t paying my tuition.  STEVE JOBS - Shooting Script 03/19/15   176.  CONTINUED: 118   118 STEVE  You and your mom selling the house  was a hostile thing to do and you  (knew it).  LISA  (over)  She needed the money.  STEVE  She always needs the money.  LISA  She needs a doctor, she has a sinus  infection.  STEVE  She’s had the same sinus infection  since 1988.  LISA  I’m gonna take care of my mother,  I’m sorry if that angers you.  STEVE  It does anger me ‘cause you’re a  kid and it’s not your job to take  care",
      "dialogue_count": 0,
      "word_count": 2737
    }
  ]
}