{
  "slug": "strawberry-mansion-2021",
  "title": "strawberry mansion",
  "genre": "sci-fi",
  "format": "film",
  "scenes_count": 13,
  "characters_count": 0,
  "characters": [],
  "total_words": 17899,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. - PINK ROOM - DAY 0A   0A  In a small pink room, a man in a black suit sits at a table with a hand covering his face. Everything in the room is pink. The table, cabinets, even a house plant is pink. The man is JAMES PREBLE, 35 years old. By his body language, we sense he’s in pain. We get closer -   he’s pressing his fingers against his forehead, above his eyes. Then he drops his hand to reveal his eyes and face. He looks around the room without moving his head. The following is handheld with many jump cuts. He opens the pink cabinets. Looks through his pill bottles. Everything is empty. He goes to the pink refrigerator. There are bottles and food containers, but everything is empty. To a pantry, no food. To a faucet, no water. Preble collapses to his knees. In agony. He can barely move. There's a knock at the door. Preble looks up. The door begins to slowly open on its own… Preble watches as fog filters into the room. Out of the fog emerges a smiling man wearing a Hawaiin shirt. He is BUDDY. He enters the room holding up a giant bucket of chicken from Captain Kelly’s and a 2 liter bottle of Red Rocket Soda. Preble’s eyes light up. Buddy leans down next to Preble, and begins pouring Red Rocket Soda down his throat. Still in slow motion, Preble looks up to Buddy. PREBLE You’re my best friend. Buddy smiles and puts out his hand to help Preble up. BUDDY You can always count on me, Buddy. Whenever you need anything, I’m here for you. Preble smiles like a child.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 283
    },
    {
      "scene_number": 2,
      "slugline": "INT. - PREBLE'S BEDROOM - MORNING 0B   0B  Preble lays in bed and opens his eyes. He takes a moment to wake up. Next to his bed is a strange machine. Preble takes a small USB like device from the machine and exits the room. INT. - PREBLE'S LIVING ROOM - MORNING 0C   0C  A living room with some futuristic elements, like a box with digital jellyfish swimming around. Preble pours a cup of coffee and walks over to a wall and turns on a large projection of numerous TV channels. He scrolls through some screens and then settles on one. He walks over to a wall of plants and waters them. Above the plants is a digital aquarium filled with exotic fish. He picks up a small audio recorder and begins to speak into it... PREBLE Okay... on the docket for today... Arabella Isadora. 80 years old. Widow. No records on file. Hmm. Assignment length: 1 day. Address of Residence: 3102 Domino Lane. ( under breath ) Where’s that? Estimated arrival: 1:00pm. Preble puts the recorder away and takes one last sip of his coffee. EXT. - FAST FOOD DRIVE THROUGH - DAY 1   1  A large, fried chicken drive-through sign fills most of the frame. Behind the sign, a perfect blue sky. The sign is filled with pictures of fried chicken. A robotic voice comes from the speaker. FAST FOOD ROBOT Welcome to Captain Kelly’s Chicken, home of the new chicken shake. What can I get you today? Preble leans out the window of his car and talks into the speaker. PREBLE A chicken shake? FAST FOOD ROBOT One chicken shake. Anything else? 2.",
      "characters": [],
      "action_text": "PREBLE No, I don’t want a chicken shake. FAST FOOD ROBOT Our new Chicken Shake, made with real blended chicken meat and whipped gravy, all under 500 calories. Would you like to try one? Preble looks disgusted. PREBLE No, no, no. I’ll just have a Barnyard Bucket. FAST FOOD ROBOT For an extra dollar you can upgrade to a Mega Barnyard Bucket. PREBLE Ok. Sure. FAST FOOD ROBOT And would you like regular or crispy chicken? PREBLE Um, regular is fine. FAST FOOD ROBOT And would you like double gravy? PREBLE How much extra is that? FAST FOOD ROBOT 89 cents. Preble thinks for a second. PREBLE Sure. FAST FOOD ROBOT Smooth or chunky? PREBLE Um. Smooth. FAST FOOD ROBOT And anything to drink? 3. PREBLE A medium Red Rocket. FAST FOOD ROBOT Ok, so I’ve got a Mega Barnyard Bucket with extra double gravy, smooth and a medium Red Rocket. Will that be all? Preble thinks for a moment. PREBLE And I'll take a chicken shake too. EXT. - PARKING LOT OF A LARGE SHOPPING CENTER - DAY 2   2  Preble hesitantly takes a sip of the chicken shake. It's not bad. He's sitting in his car in an empty parking lot. The shopping center has seen better days. Many of the businesses appear to be permanently closed. Preble puts the shake down and looks in the bag. He pulls out a clear bag. He opens it up and takes out a small stuffed animal. Preble looks confused and annoyed by this unexpected toy. He begins eating his fried chicken. He turns on the radio and scans the dial until settling on a sad song. Preble sits there, slowly eating his chicken, taking sips of his soda, staring straight ahead. Preble looks up, sees something strange. 15 feet in front of his car stands what appears to a man covered head to toe in lush, green grass. Preble is transfixed. After a few seconds the GRASS MAN is gone. Preble sits there, holding his half eaten drumstick, unsettled, not knowing what he just saw. EXT. - BUSY ROAD - DAY 3   3  Preble drives by stores, signs and traffic lights. The endless sprawl of capitalism whizzing",
      "dialogue_count": 0,
      "word_count": 655
    },
    {
      "scene_number": 3,
      "slugline": "EXT. - FOUR LANE HIGHWAY - DAY 4   4  Preble drives by fields and trees as the landscape becomes noticeably more rural. EXT. - SIDE OF THE ROAD - DAY 5   5  Preble is consulting a map laid out on the front of his car. He looks over and see a roadside memorial. There’s a weathered white cross covered in faded stuffed animals. Preble walks back to the car. CU of the small stuffed animal from Captain Kelly’s being placed on the roadside cross. EXT. - COUNTRY ROAD - DAY 6   6  The car winds along a narrow road. He pulls off into a driveway. The driveway abruptly stops. We see a house in the distance. The driveway does not connect to the house. There’s a sign that says THE END blocking the car from going any further. Preble gets out of the car. EXT. - FIELD - DAY 7   7  Preble gets out and inspects the property. He double checks the mailbox. It reads “Isadora.” He’s at the right place. He begins to walk into an open field in the direction of the house. EXT. - FIELD - DAY 8   8  AN OLD COUNTRY HOUSE sits atop a hill. Clouds drift through the sky. TWO BUTTERFLIES flutter by. Preble steps into the frame. He surveys the scene for a moment before advancing towards the house. EXT. - MANSION - DAY 9   9  Preble steps onto the porch and places his suitcase at his feet. He rings the doorbell and adjusts his tie. The two butterflies reappear and flap next to Preble. He looks at them just as the door opens. ARABELLA ISADORA, a colorfully dressed woman in her late 70s, greets Preble. She’s wearing an elaborate machine of wires and blinking lights on her head. 5.",
      "characters": [],
      "action_text": "ARABELLA (shocked) Oh hello! PREBLE Hello ma’am, are you Ms. Arabella Isadora? ARABELLA (smiling) One second, let me get her for you. Arabella goes inside. The butterflies flap around the porch. Preble watches them. The moment is interrupted as Arabella steps back onto the porch, no longer wearing the machine on her head. She has one hand positioned behind her back, holding an ice cream cone. The butterflies land on top of Arabella’s head. ARABELLA (CONT’D) Hello, Arabella Isadora at your service. And what can I do for you young man? PREBLE My name is James Preble. I’m a tax auditor. He hands her a business card that reads “James Preble. Tax Auditor.” Arabella looks at the card with the hand that's not behind her back, and then at Preble. ARABELLA Yes I see. She hands the card back to Preble and in the same motion he grabs a piece of paper from his suit pocket. PREBLE Ma’am, did you send me this letter? ARABELLA Yes, I suppose I did. PREBLE Ms. Isadora, it... ARABELLA Please, call me Bella. 6. PREBLE Bella, it appears we do not have any tax records for you or your property. BELLA (smiling) Oh dear, is that so? PREBLE Yes. I’m here to perform a preliminary audit-- account, assess, and appraise what you have accumulated here on the premises. BELLA Of course. So you’d like to come in? PREBLE Yes ma’am. The sooner we get started the sooner I’ll be out of your hair. Bella smiles, her hand still behind her back. The butterflies fly into the house. She looks intensely at Preble, and says the following in the style of an old-fashioned rhyme... BELLA (dramatically) Out of my hair and into my home, to enter you must lick the ice cream cone. She brings forth the strawberry ice cream cone that she has been hiding behind her back. Preble stares at the ice cream. Then up at her. Bella smiles. BELLA (CONT'D) It's melting dear. Preble hesitantly grabs the cone. CLOSE UP, SLOW MOTION shot of Preble’s tongue licking the ice cream. 7.",
      "dialogue_count": 0,
      "word_count": 647
    },
    {
      "scene_number": 4,
      "slugline": "INT. - MUSIC ROOM - DAY 10   10  A wide shot of a room filled with musical instruments. A piano is the centerpiece. Stacks of VHS cassette tapes of varying colors are everywhere. On top of the mantle is an old bowling pin. Preble and Bella enter the room. Bella motions for Preble to have a seat on a reading chair. He does so, and she follows suit Preble takes out a clipboard and pen. PREBLE Shall we get started? BELLA Yes, of course. Bella cries out in the direction of a succulent garden: BELLA (CONT’D) You have to get to the witch! PREBLE Excuse me? Bella stands up and walks over the an old fashioned, hand cranked music box. She cranks it and music begins to play. BELLA Did you know in ancient times it was believed a witch’s heart was made of a beet and during years when the beet harvest was particularly abundant it was believed that there was a new coven of witches living in the area. Preble looks at Bella as if she is crazy. PREBLE I...did not know that. Bella sits back down. BELLA Of course I’ve always loved beets. So juicy. A perfect side on a dinner plate. I’ve always thought if you could take a bite from the planet Mars it would taste something like a beet.  (MORE)  8.",
      "characters": [],
      "action_text": "Of course the moon probably tastes like a turnip. I’m sure it would be lovely in a stew. Preble just stares. PREBLE I’ll need to ask you a few preliminary questions. First, what is your full name? BELLA Arabella Henrietta Buckingham Isadora. Preble takes notes. PREBLE And what is your current or former profession? BELLA Oh dear, I never know how to answer this. Recently I’ve been painting, oh I’d love to show you some! And I’m always writing. I’m currently working on a short story about an astronaut who falls in love with a super nova. And of course I’ve been composing songs for many years and constructing various machines and gadgets. I think of myself as something of an atmosphere creator. Preble smirks and nods. CLOSE UP of him checking the box next to ’Artist.’ PREBLE (pointing at the VHS tapes) I couldn't help but notice all the tapes. Have you not updated to the new format? For the first time we see a close up of the stacks of VHS tapes. BELLA Oh, I'm old fashioned. PREBLE Well you know the Air Sticks became mandatory seven years ago.  BELLA (CONT'D)  9. BELLA (laughing) I suppose I've lost track of time. PREBLE Ok. And are these are all of them? BELLA Oh heavens no! There are many more. My husband was always trying to get me to organize them. PREBLE Your husband? BELLA Yes. PREBLE And where is your husband now? BELLA He’s moved on to that distant shore. Preble gives a respectful nod. BELLA (CONT’D) He was a terrific man. I miss him but I do still feel his presence. Now there was a man who loved toast. Preble doesn't know how to react to this out-of-nowhere statement. PREBLE And where are his tapes? BELLA I’m afraid they’re all gone. PREBLE (concerned) Gone? BELLA Burned in a fire. PREBLE (jotting something down) I see. Well, I’m here for yours, so let’s start there. 10. BELLA Yes of course! Preble looks around the room. PREBLE I must say, there a lot more than I was anticipating. BELLA (laughing) Then I’d better make us some tea! Bella leaves as Preble takes ",
      "dialogue_count": 0,
      "word_count": 1953
    },
    {
      "scene_number": 5,
      "slugline": "INT. - MUSIC ROOM 16   16  Preble follows Bella into the music room. Bella picks up some more tapes. She hands him one. BELLA Oh this one. May 12th, 1985. I had this one the night after I met my husband for the first time. It's a very special one. PREBLE Well I'm going to have watch them all, regardless of their personal significance to you. BELLA Of course, of course. Preble looks down. Again, he can't help but notice the big sculpture of the man sitting in the chair. There's something about it that draws him in. On the head of the sculpture sits a helmet of wires and electronic parts. In the sculpture's hand is a paper mache rat wearing a similar helmet. BELLA (CONT'D) My husband made them for me before he died. He didn't want me to be lonely. And I must say, it's nice to have someone to play to. She turns and takes a violin off the wall. PREBLE Do you play all of these instruments? Out of nowhere, a single note rings out on the piano. Preble looks at Bella. BELLA Yes, and sometimes they play themselves. Bella brings the violin up to her chin and smiles. EXT. CEMETERY - DAY 17   17  Standing in a cemetery, Young Bella plays a violin. 17.",
      "characters": [],
      "action_text": "A skeleton crawls out of the ground and begins dancing. The music continues over a dream montage of various moments Bella's dreams. Hologram Preble watches all of these off to the side. The dreams are: 1. A clown hands Bella an ice cream cone with 12 scoops and she licks the scoops from bottom to top. 2. Bella sits in a small boat and fishes. Then she's on land holding an enormous fish, twice the size of her. 3. Bella has a bike pump connected a purple character, Fanny, with a round head. She pumps it up until Fanny's head floats away. 4. A furry beast with antlers, The Beast King, is holding a large wasp nest. Bella puts her hand inside the nest. 5. Sitting at a school desk writing math equations on a piece of paper. Bella's tooth falls out and lands on the paper. The tooth suddenly grows in size and has eyeballs and a mouth. It smiles at Bella and picks up the pencil and begins to finish her math work. Bella smiles with a tooth missing. Hologram Preble smiles. INT. - SUGARBABY’S ROOM - NIGHT 18   18  The dream tape ejects. Paper prints out. Preble takes a moment to collect himself and wipes sweat from his brow. He jumps as he notices Bella sitting on the dresser watching him. PREBLE Ahhhhh! BELLA Oh I didn’t mean to startle you. PREBLE What are you doing? BELLA I was watching you do your work. You were smiling. 18. Preble is embarrassed. He busies himself with the printout. PREBLE Bella, I hate to be rude but I prefer to do my work in private. BELLA Ah, of course. My apologies. On her way out she hands him a plate with a sandwich on it. BELLA (CONT’D) Some dinner for the tax man. Preble inspects it as Bella stands in the doorway. PREBLE Bella, you need not... BELLA It’s avocado and tomato. You love avocados. She leaves the room. Preble stands up and closes the door. He takes a bite of the sandwich, walks over to a painting of a 17th century British ship hanging on the wall. Preble stares at the ship and eats his sandwich. He moves over to the bed and sits in front",
      "dialogue_count": 0,
      "word_count": 710
    },
    {
      "scene_number": 6,
      "slugline": "INT. - KITCHEN 20   20  Preble places the plate into the sink. From the other room he hears the piano. PREBLE Hello? INT. - MUSIC ROOM - NIGHT 21   21  Preble enters. PREBLE I’m going to- He sees that it is SUGARBABY walking on the piano keys. PREBLE (CONT’D) Oh. He looks around the corner to make sure Bella isn’t around then looks back at Sugarbaby. PREBLE (CONT’D) Do you know this one? He reaches down and spontaneously plays a simple rendition of “Row Your Boat.” EXT. - FRONT PORCH - NIGHT 22   22  Bella sits in a rocking chair, smoking a pipe. She listens, smiling wide, nodding her head, quietly singing to herself. As Preble plays the last line on the piano (\"Life is but a dream\") CUT TO A long shot of the house at night, bathed in blue moon light. FADE TO BLACK FADE UP ON INT. - PINK ROOM - NIGHT 23   23  We’re back in the same pink room from the opening scene. A simple room where everything is painted pink. Preble sits at a table surrounded by spiderwebs, which fill up the entire room. 20.",
      "characters": [],
      "action_text": "Preble looks up. We see a spider dangling. Preble stands up and sweeps the webs with a broom. He sweeps and sweeps but doesn't appear to be making progress. He stops the job, frustrated. Just then, there’s a knock on the door. The door begins to open on its own, like in the opening scene, fog spills into the house. The same jovial man wearing a Hawaiian shirt enters holding a can of bug spray. Preble is relieved to see him, as always... BUDDY Whoa buddy! You got a spider problem! Here, try this. Buddy hands Preble the spray can. The label has a picture of a spider with a red X over it. It reads SPIDER SPRAY. BUDDY (CONT'D) This stuff is great! Couple 'o sprays with that and you'll be bug free fo' sure! Haha! Preble holds the can and smiles. BUDDY (CONT'D) Three times more deadly than the other leading brand, you're guaranteed to kill 'em all, haha! Preble begins to spray around his apartment. Buddy is loving it. BUDDY (CONT'D) Oh yeah! Watch 'em squirm, haha! Preble is getting into it, egged on by his friend. BUDDY (CONT'D) Bad day to have 8 legs! Oh yeah, good shot buddy! While Preble continues to spray, there’s another knock on the door. Preble looks up confused. He looks at Buddy. 21. PREBLE Who’s that? BUDDY I’m sure it’s nobody. Another knock. Preble turns to the door… BUDDY (CONT’D) Wait, no. Buddy puts up his hand preventing Preble from going to the door. PREBLE What are you doing? BUDDY If you answer that door, you’re only gonna let in pain. PREBLE What, no. Somebody’s knocking. I should answer it. BUDDY I’ll get it! Preble thinks for a moment and shrugs. Buddy goes to the door, and opens it slightly. BUDDY (CONT’D) We’re not interested, thank you. We can’t see who it is, but it’s a woman’s voice. It sounds like Young Bella. YOUNG BELLA Can I speak with James Preble? BUDDY He’s not accepting visitors at the moment. YOUNG BELLA Well is he here? Preble leans over to see the woman, but she’s being blocked by Buddy. 22. BUDDY He’s busy. I’ll tell him you came by",
      "dialogue_count": 0,
      "word_count": 3696
    },
    {
      "scene_number": 7,
      "slugline": "INT. - KITCHEN - DAY 40   40  Preble talks on the phone and nods. EXT. - BACKYARD - DAY 41   41  Preble stands on the back porch, getting some fresh air. He notices the chickens and walks over to their pen. He grabs some of their feed and sprinkles it down, just as he has seen Bella do. INT. - KITCHEN - DAY 42   42  Preble takes some strawberries from the fridge and chops them up into slices. INT. - MUSIC ROOM - DAY 43   43  Preble puts the strawberry slices into Sugarbaby's aquarium. Close up of Sugarbaby eating. INT. - SUGARBABY’S ROOM - DAY 44   44  Preble's suitcase is on the bed. He's packing up. He places the special tape, with the star on it that Bella gave him the previous night, on top of his clothes. He picks up the ad blocker helmet and considers whether to pack it. He shakes his head slightly. INT. - STAIRS - DAY 45   45  Preble, with suitcase in one hand, and the ad blocker in the other, walks toward Bella's room at the end of the hall. He gets to the door and looks in. INT. - BELLA’S BEDROOM - DAY 46   46  Preble walks into her bedroom. Puts down his suitcase. He puts down the ad blocker on her bedside table, deciding not to take it with him. Then wanders around the room. Soaking up her spirit, saying goodbye, what have you. The doorbell rings. Preble turns to look in the direction of the door. 40.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 257
    },
    {
      "scene_number": 8,
      "slugline": "INT. - FRONT DOOR - DAY 47   47  Preble opens the door. PETER Hello, you must be James Preble. PREBLE Yes. PETER Peter Bloom. Bella was my mother. PREBLE Oh. Yes. Hello. Peter enters and looks around. INT. - MUSIC ROOM 48   48  Peter and Preble walk into the room. Peter takes a look around. PETER Terrible thing to lose your mother. Very sad. PREBLE Yes. I’m sorry for your loss. PETER Thank you. She was rather old so I guess it’s not terribly surprising. PREBLE She was a beautiful soul. PETER Yes yes, she was. Listen James, I’d love to have a few words with you about the last couple of days. Preble stares at him. PETER (CONT’D) To be honest, I think her mind had been slipping these past few years, ever since Jim died. I hope she didn’t fill your head with any of her nonsense. Preble half smiles. 41.",
      "characters": [],
      "action_text": "PETER (CONT’D) Of course you understand she was totally delusional. PREBLE I wasn’t aware. PETER Oh yes. Quite. Listen, my wife and son are arriving this afternoon. Why don’t we all have dinner here tonight. We can all talk and then send you on your way. PREBLE Okay, that sounds fine. PETER Great. I have some business in town, but we’ll see you tonight. They stand looking at each other for a moment. INT. - SUGARBABY’S ROOM - DAY 51   51  Preble opens his suitcase and takes out the special tape with the star on it. He puts it into the viewing machine and presses play. EXT. - FOREST - DAY 52   52  Young Bella walks with a man made of grass. Now Young Bella and the Grass Man are sitting on a picnic blanket, with a full spread of food and drink. The Grass Man reads from a book of poetry... GRASS MAN I’ve loved you in many lifetimes. In many forms. In many places. Through many storms. In the desert. Lost at sea. With little hope to comfort me. But there you were, all alone. Arm in arm we made it home. They share a passionate look. It feels like the moment before a kiss. Hologram Preble is watching the scene with rapt attention. His notepad is down at his side. 42. The Grass Man plucks a flower that has been growing from his chest and hands it to Young Bella. Young Bella takes the flower and smiles. Hologram Preble can't help but smile himself. Young Bella walks through a forest. She's smiling and laughing as she goes. Shes comes to the end of the forest and walks into a field. She turns around, waiting for someone to come out. After a moment the Grass Man appears. Young Bella is delighted. He walks over to her, and they begin to slow dance, her head on his grassy shoulder. After a lovely moment, Young Bella and the Grass Man separate. Bella puts her hand on his face and rubs it lovingly. The Grass Man smiles. Bella lifts her other hand up to his face, and begins brushing the grass off his face, almost like removing makeup. Hologram Preble watches on. She slowly begins to",
      "dialogue_count": 0,
      "word_count": 1381
    },
    {
      "scene_number": 9,
      "slugline": "EXT. FIELD - DAY 60   60  Young Bella finishes clearing away the grass and the face is revealed... IT'S PREBLE! Hologram Preble sees himself for just one second and then... INT. - SUGARBABY’S ROOM 61   61  Peter slams the bowling pin down hard on Preble's head, knocking him out immediately. The pink helmet is smashed into pieces. Preble slumps to the floor. The room stretches and contracts. After a moment Preble staggers to his feet, wiping blood from his face. In a daze he looks around the room and stumbles into the hallway. INT. - HALLWAY 62   62  Peter is walking down the hallway, bloody bowling pin in his hand. Preble sees him and woozily calls out. PREBLE Excuse me, Peter! Preble catches up to him. PREBLE (CONT’D) I-I think something happened, I think I’m in trouble. Peter turns around and he has a WOLF HEAD! Preble leaps back and Wolf Peter begins creeping towards him, growling. WOLF PETER You!? What are YOU doing here? PREBLE (delirious) I-Iaaaaaaaaaay. WOLF PETER You’ve been a bad boy and you need to be punished! Wolf Peter lunges at Preble! Preble ducks under his claws and runs down the stairs. 48.",
      "characters": [],
      "action_text": "INT. - DINING ROOM 63   63  Martha has her back to Preble. She’s stooped over a giant bucket of chicken, treating it like a cauldron. Preble is still woozy. PREBLE Excuse me, I’ve been a bad boy. Martha turns around and she’s a WITCH. She cackles. WITCH MARTHA Death to all bad boys! Witch Martha laughs and creeps towards Preble. Preble runs from the room and crashes right into Brian, except now Brian looks like an OGRE! OGRE BRIAN You should watch where you’re going you dumb donkey boy! PREBLE I’m lost and my head hurts. OGRE BRIAN I’m going to break your head wide open! Ogre Brian, Witch Martha and Wolf Peter stalk towards Preble. WOLF PETER, WITCH MARTHA, OGRE BRIAN Death to all bad boys! Death to all bad boys! Preble tries to open the front door but it’s locked. He runs back up the stairs and down the hallway. A hand grabs him and pulls him into a closet. INT. - COAT CLOSET 64   64  Young Bella stands surrounded by coats. PREBLE Bella! YOUNG BELLA Shhhhh! She puts her hand over Preble’s mouth and locks the closet from the inside. Outside the door Wolf Peter, Witch Martha and Ogre Brian are making a racket. 49. WOLF PETER You can’t hide from us! We’ll find you little man! Young Bella removes her hand from Preble’s mouth and brings her finger to her mouth, motioning him to remain quiet. PREBLE (whispering) Bella, I’m in trouble. YOUNG BELLA (whispering) I know. Look, first things first, we have to get out of this closet. PREBLE (whispering) How are we going to do that? YOUNG BELLA We’re going to swim. The doorknob rattles. OGRE BRIAN Hey dad! This door is locked! PREBLE How are we going to swim? YOUNG BELLA Hold your breath. Wolf Peter begins to break down the door. WOLF PETER Now I’m angry! YOUNG BELLA One- Wolf Peter repeatedly slams against the door. WOLF PETER Open this fucking door! YOUNG BELLA Two- WOLF PETER Ahhhhhhhhhhhhhh! YOUNG BELLA Three! 50. Young Bella and Preble fall backwards into the coats just as Wolf Peter breaks down the door. He searches throug",
      "dialogue_count": 0,
      "word_count": 4602
    },
    {
      "scene_number": 10,
      "slugline": "EXT. - DESERT - DAY 87   87  Preble is laying in the sand. A tiny periscope emerges from the sand and moves towards Preble. A pink submarine surfaces from the sand and circles Preble. TINY SUBMARINE Captain! Captain! Preble looks down at the tiny pink submarine. INT. - SUBMARINE - DAY 88   88  Preble, dressed in a Russian Submarine Captain’s outfit, climbs down a ladder into the sub. The same rats from earlier are there, though now they are dressed in Russian sailor sweaters. STEWART RAT Captain, we finally found you! Preble regards Stewart Rat and nods approvingly. RICHARD RAT Captain, what’s our course? PREBLE (with total determination) To the witch. STEWART RAT But Captain, the witch lives in the Swamp of Evaporating Snakes. MARCUS RAT Where all things go to be erased! PREBLE Do not fear men, for we have-- Preble looks down at his foot. PREBLE (CONT’D) My foot is on fire. INT. - SUGARBABY’S ROOM - NIGHT 89   89  Flames are about to reach Preble’s feet as he lays unconscious on the bed. 72.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 178
    },
    {
      "scene_number": 11,
      "slugline": "INT. - SUBMARINE - DAY 90   90  Preble smashes his burning foot on the ground to extinguish the flames. PREBLE Double speed men, balls to the wall! We’re running out of time! EXT. - DESERT - DAY 91   91  The submarine speeds up in the sand and passes old VHS tapes half buried in the sand. Eventually the sand turns into the black tape found inside VHS tapes. The submarine slowly moves through the black tape swamp. INT. - SUBMARINE 92   92  MARCUS RAT Captain, we’ve entered the swamp. PREBLE Stay alert men. Things are not what they seem. The witch is near. An eerie quiet descends upon the submarine. The rat sailors look around, waiting for something to happen. Richard Rat inspects his compass. RICHARD RAT Napkin, I can’t get a reading. The compass is going haywire. PREBLE Keep your wits men! We’ve got to stay strong! More eerie silence. STEWART RAT Captain it appearaeppa ti naitpac. PREBLE Come again Stewart? Stewart Rat’s head is now slowly turning around 360°. STEWART RAT ohlololo ohlololo ohlololo ohlololo PREBLE Hmmmm. 73.",
      "characters": [],
      "action_text": "Preble glances across the submarine and observes a rat quietly beheading another rat. PREBLE (CONT’D) Hmmmmmm. Preble walks over to Richard Rat. PREBLE (CONT’D) (CONT'D) I’ve been thinking about the bubble bath. Where are the marigolds? Richard Rat morphs into a chicken. He clucks for a second before opening his beak and roaring like a T-Rex. PREBLE (CONT’D) Oh dear. MARCUS RAT (backwards and distorted) sabbabhfbasuhfewinjaksnfdl PREBLE Of course I removed the tourniquet. It was a wonderful addition to the party. Preble wanders away, muttering to himself. PREBLE (CONT’D) Getting the old job done. Preble is slowing down. All the rats are gone. Preble sits down on the submarine floor. PREBLE (CONT’D) (CONT'D) Health and wholesome milk. Just a small taste is enough for me. He's now holding a glass of milk with a long straw that he puts into his mouth. He begins blowing bubbles. Close up of the bubbles. PREBLE (CONT’D) If the bubbles get lost, how do they find their way home? Preble’s face is being wrapped in VHS tape. Slowly, around and around, like he’s in a cocoon. PREBLE (CONT’D) (CONT'D) Wait now a moment! What goes on here? 74.",
      "dialogue_count": 0,
      "word_count": 375
    },
    {
      "scene_number": 12,
      "slugline": "INT. - PICTURE ROOM - DAY 93   93  Preble sits on the lap of Witch Martha. Preble’s whole body is wrapped in VHS tape, resembling a caterpillars cocoon. WITCH MARTHA Calm your heart. You are going to sleep. Away from all pain. Away from all memories. I will erase you. As she says this last line she covers Preble’s face in VHS tape. Static and video distortion flicker on the screen. Image of Preble walking backwards with his suitcase. Preble as a young boy running backwards. Preble as a baby going back into his mother’s vagina. Preble as a fetus in his mother’s womb. Static and distortion and Preble is in an endless sea of VHS tape. He struggles to stay afloat. When he goes under images flash on the screen. A high diver going back to the diving board. A flower closing. Barf going back into a mouth. Preble rips through the image and he surfaces in the room in the mansion, though now there is VHS tape everywhere. It’s up to his waist. Preble is in one corner of the room and the Witch is in the other. WITCH MARTHA (CONT’D) Go to sleep my darling! PREBLE I’m not tired! Preble charges through the tape towards the Witch. She lifts her arms up, conjuring tape that flows up like water around Preble and drags him under. More images flash on the screen. Scenes from life. A baby blowing out a candle on a cake, in reverse. A couple hugging backwards. Cars driving in reverse. VHS images breaking down and erasing and distorting all together. Lightning flashes. INT. - MUSIC ROOM - NIGHT 94   94  A hit of loud thunder. Preble jolts awake. He’s sitting in the music room, in the chair next to Bella. Sugarbaby is playing the piano. PREBLE Oh. Ohhhhhh. I just had quite the dream. Wow. It was so real. 75.",
      "characters": [],
      "action_text": "BELLA I always have vivid dreams during a lightning storm. Maybe it’s all the electricity in the air. PREBLE But this one was SO real. BELLA I hope it was a nice dream. PREBLE Parts were nice. Yeah. But...but you were dead. BELLA Oh dear. PREBLE And then your son came and his family and I was with you and we hid in a closet and then we were on an island and then a ship with rats and then a desert and there was this witch- BELLA What did the witch look like? PREBLE She had a big nose and horrible teeth and just looked awful! Bella swivels around in the chair and it’s really the Witch! WITCH MARTHA That’s not very nice! The Witch cackles and Preble screams. The music room begins breaking down. Items in the room begin floating away and glitching out until VHS distortion takes over. Preble surfaces once more from the tape. WITCH MARTHA (CONT’D) Did you think she was still alive you silly stupid boy! The Witch brings her arms up and more tape envelops Preble, dragging him under. More images. Static and video distortion and chaotic images all mixing together. 76. We see flashes from Bella's dreams - of the Grass Man, of the Frog Waiter and then... We see Bella's father bringing out the airplane from the buffalo and holding it in his hands. (from Bella's first dream) Preble notices the airplane and grabs it from the dream. Preble reemerges right in front of the Witch. He slices with the airplane and cuts open The Witch’s chest. He plunges his hand into the wound. PREBLE Ahhhhh! Preble removes his hand from the wound and there, in his palm, is her still beating heart. INT. - PICTURE ROOM 95   95  The Witch collapses into the VHS tape. The tapes slither away. Preble looks down at the heart in his hand and now it's a beet. He shrugs and takes a bite. INT. - DINING ROOM - NIGHT 96   96  Preble and Young Bella are BEETS on a plate. Around them is chicken, peas and salad. This is the dinner scene between Bella and Preble from earlier in the film. They are sitting next to each ot",
      "dialogue_count": 0,
      "word_count": 2647
    },
    {
      "scene_number": 13,
      "slugline": "INT. - FRONT DOOR - NIGHT 114   114  Preble, holding Sugarbaby, tries to open the front door but it's locked. He kicks at it. It won't budge. He looks around, unsure of what to do. Smoke is filling up around him. A quick flash of one of Rat Sailors, wearing an ad-blocker helmet. RICHARD RAT Here Captain, I've got the key! The Rat Sailor holds up a huge, over sized key. INT. - DINING ROOM - NIGHT 115   115  Preble runs into the room, he breaks the glass around the rat skeleton and grabs the key. INT. - FRONT DOOR - NIGHT 116   116  Preble, still holding Sugarbaby, unlocks the front door and exits the house. EXT. - OUTSIDE MANSION - NIGHT 117   117  Preble runs out of the house, coughing. He places Sugarbaby on the ground so he can catch his breath. He looks up at the house as it burns. CU of Preble's face with fire reflecting on it. He stands there a moment. Then all of the sudden without explanation, he takes off on a sprint back to toward the house... INT. - STAIRS - NIGHT 118   118  Preble runs back up the stairs through the fire. INT. - SUGARBABY’S ROOM - NIGHT 119   119  Evading flames all the way, Preble runs back into the burning room and grabs the VHS tape Bella gave him the night she died, and the ad blocker helmet. Then runs back. Out of the room. Down the stairs. 87.",
      "characters": [],
      "action_text": "Before he leaves he looks over into the music room and sees a VHS tape man standing there. The statue turns and looks at Preble through the smoke. And then Preble is out of the house. EXT. - OUTSIDE MANSION - CONTINUOUS 120   120  Holding the ad blocker, the last VHS tape, and Sugarbaby, Preble watches the house burn. FADE TO BLACK INT. - PREBLE’S APARTMENT - NIGHT 121   121  CU of Sugarbaby eating a strawberry. Preble, with a bandage around his head, stands next to Sugarbaby, watching him eat. He pats Sugarbaby on his head and then walks over to his desk. He sits down and picks up the ad blocker helmet. He turns it around in his hands, studying it. He turns a switch and a light begins to blink. He turns it off and sets it back down. Next he picks up the tape that Bella gave him the night she died. He puts it into his VCR and presses play. EXT. - FRONT PORCH - DAY 122   122  CU of Preble's face with grass around it. Young Bella helps him removes the layers of grass from the rest of his body. They smile back and forth and walk into the house together. A few VHS Tape Characters enters the frame and walk into the house. EXT. - OUTSIDE MANSION 123   123  Cut to wide shot of Strawberry Mansion atop the hill. Fifty VHS Tape Characters walk up the hill towards the house. Clouds drift through the sky. Two butterflies flutter into view and then are gone. CUT TO BLACK THE END 88.",
      "dialogue_count": 0,
      "word_count": 515
    }
  ]
}