{
  "slug": "stranger-things-101-chapter-one-the-vanishing-of-will-byers-2016",
  "title": "stranger things 101 chapter one the vanishing of will byers",
  "genre": "thriller",
  "format": "series",
  "scenes_count": 6,
  "characters_count": 0,
  "characters": [],
  "total_words": 11805,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. WHEELER HOUSE - MIKE’S ROOM - NIGHT  A GROUP OF BOYS, 12 years old, play DUNGEONS AND DRAGONS.  They sit in a circle, their knobby knees buried in carpet. A  map is spread out between them, along with an empty pizza  box, canned cokes, and the all-important DUNGEONS AND DRAGONS  MONSTER MANUAL.  MIKE WHEELER, 12, is the “Dungeon Master.” He is a cute moppy  haired kid, classically good looking except for a BIRTHMARK  on his left cheek.  MIKE (CONT’D)  A shadow grows on the wall behind  you... swallowing you in  darkness...   it   is   almost here ...  The other boys lean forward. Riveted. We survey them:  LUCAS CONLEY, 12, playing as a knight. He is very small but  his loud mouth more than makes up for it.  DUSTIN HENDERSON, 12, playing as a dwarf. He wears glasses,  is overweight, not quite fat, but he’ll get there someday.  WILL BYERS, 12, playing as a wizard. Soft-spoken, gentle.  WILL  ...What is it?  DUSTIN  The Demogorgon?  WILL  We’re screwed if it’s the  Demogorgon --  LUCAS  It’s not the Demogorgon --  Mike waits for them to settle down. Then:  MIKE  An army of Troglodytes charge into  the chamber!  He slams SIX WINGED MINIATURES onto the map.  MIKE (CONT’D)  Their tails drum the floor. Boom!  Boom! Boom!  DUSTIN  Troglodytes?!  3.",
      "characters": [],
      "action_text": "LUCAS  Toldja!  DUSTIN  Easy .  Mike looks over his shoulder. His eyes grow wide.  MIKE  Wait ... do you hear that? Boom!  Boom! BOOM! That sound... it didn’t  come from the   Troglodytes . No. It  came from something behind them...  Mike slams a LARGE TWO-HEADED MONSTER MINIATURE onto the map.  MIKE (CONT’D)  THE DEMOGORGON.  The boys stare.   Shit.  LUCAS  We’re all gonna die.  MIKE  Will, your action.  Will swallows. God, he wishes it wasn’t his turn.  WILL  I -- I don’t know --  LUCAS  Fireball him --  WILL  I’d have to roll thirteen or  higher --  DUSTIN  Too risky. Cast a protection spell--  LUCAS  Don’t be a pussy! Fireball him!  DUSTIN  Protection spell -- !  MIKE  The Demogorgon is tired of your  silly human bickering. It steps  toward you. BOOM!  LUCAS  FIREBALL HIM Will!  4. MIKE  Another step. BOOM!  DUSTIN  Cast protection!  MIKE  It roars in anger --  LUCAS  Fireball -- !   DUSTIN  Protection --  MIKE (CONT’D)  And --  WILL  FIREBALL!  Will rolls the dice. Too hard. The dice scatters to the  other side of the room. It lands in front of the bedroom  door.  LUCAS  What is it?!  WILL  I don’t know!  DUSTIN  Is it a thirteen?  WILL  I DON’T KNOW!  The boys scramble to look at the dice when --  WHOOM! The bedroom door swings open.  The boys look up to find...  KAREN WHEELER, late 30s, Mike’s mom. Short blonde hair,  conservative blouse, blue jeans hiked high above her waist.  MIKE  Mom, we’re in the middle of a  campaign -- !  KAREN  You mean the   end .  She taps her watch.  KAREN (CONT’D)  Fifteen after.  5.",
      "dialogue_count": 0,
      "word_count": 484
    },
    {
      "scene_number": 2,
      "slugline": "INT. WHEELER HOUSE - STAIRS - NIGHT  Mike chases his mom down the stairs.  MIKE  Just twenty more minutes --  KAREN  It’s a school night, Michael, and I  just put Holly to bed. You can  finish next weekend --  MIKE  That’ll ruin the flow --  KAREN  Michael   --  MIKE  I’m serious, Mom! It took two weeks  to design. How was I supposed to  know it’d take seven hours -- ?  KAREN  You’ve been playing seven hours?!  They reach...  THE LIVING ROOM.  Mike’s dad, TED, 45, is watching “CHiPS.” Or   trying   to. The  signal is terrible; a snowstorm of static obscures the image.  He smacks the TV.  MIKE  Dad, don’t you think -- ?  TED  (not even listening)  I think you should listen to your  mother. DAGGUM PIECE OF JUNK!  He smacks the TV again. The static flares.  BACK UPSTAIRS IN MIKE’S ROOM,  Lucas, Dustin, and Will stuff belongings into backpacks.  WILL  Does the seven count?  LUCAS  It was a seven?!  6.",
      "characters": [],
      "action_text": "Will nods.  LUCAS (CONT’D)  Did Mike see it?  Will shakes his head.  LUCAS (CONT’D)  Then it doesn’t count.  THE UPSTAIRS HALLWAY - MOMENTS LATER  Dustin and Will bound down the stairs.  Lucas doesn’t follow. He peers through a cracked door into...  NANCY WHEELER’S ROOM.   This is Mike’s sister, 16, girl-next-  door pretty. She is on her bed in pajamas, a phone in hand,  fingers twisting its cord, slender legs kicked in the air.  Lucas angles himself in such a way that he can see Nancy in  the reflection of her vanity mirror.  NANCY  I know, I know, but -- I don’t  think so -- yeah, he’s cute, but --  Barb -- BARB! -- listen to me --  Nancy turns around on her bed. Spots Lucas in the mirror.  Her smile drops.  NANCY (CONT’D)  The HELL LUCAS! GET OUTTA MY ROOM!  She leaps out of bed and storms over to him.  LUCAS  I’m not in your room --  NANCY  (into phone)  One of Mike’s loser friends --  LUCAS  -- Not technically --  WHAM! Nancy slams the door.  EXT./INT THE WHEELERS GARAGE - NIGHT  Lucas explodes into the garage. Excited.  LUCAS  She knows my name!  7. Dustin and Will are mounting bikes; Mike is seeing them off.  WILL  Who -- ?  LUCAS  NANCY!  MIKE  I’m not listening to this --  DUSTIN  She’s got a boyfriend now --  LUCAS  Does not --  DUSTIN  Does too --  Mike covers his ears.  MIKE  NOT listening --  WILL  Dustin’s right. I’ve seen her  hanging around that Steve guy --  MIKE  NOT LISTENING --  LUCAS  Steve Harrington? He’s cool --  DUSTIN  She’s cool.   You lost your chance.  Should’ve gone for her when she had  braces and no boobs.  LUCAS  I’m playing the long game.  DUSTIN  Oh, yeah, I’m sure a growth spurt  will really do it for you, Lucas...  The boys bike out of the garage, arguing as they go. Mike  takes his hands off his ears. He can’t help but smile. Then:  BZZZZZ. The light above him begins to flicker.   Strange .  Mike switches it off and heads back inside.  We return our gaze to the light.  8. It sputters back on. And...  EXT. MONTAUK NEIGHBORHOOD - ",
      "dialogue_count": 0,
      "word_count": 686
    },
    {
      "scene_number": 3,
      "slugline": "EXT. FOREST ROAD - LATER  Will is now biking along an empty forest road. All alone.  He lives much further out than the rest of his friends. It is  even darker out here and quiet; unnervingly so. Only the  sound of cicadas and a gentle breeze to keep him company.  He bikes past a LARGE METAL FENCE. A warning sign reads:  AUTHORIZED VEHICLES ONLY. NO TRESPASSING .  We’re near Camp Hero.  Will suddenly notices something strange: the hair on the back  of his arms is standing straight up. It’s like he’s in the  middle of a massive electrical storm. And perhaps he is...  A LOW-END RUMBLE reverberates above him. He looks up.  Sees nothing but darkness. Clouds over the moon.  He looks back down. His eyes shoot wide.  A TALL FIGURE STANDS IN THE MIDDLE OF THE ROAD .  Will spins the wheel -- loses control --  He veers off the road --  And explodes into --  THE FOREST.  The bike flies down a steep hill and --  CRASHES. Will flies off the bike. He skids, rolls, eats dirt.  As he lies there on the ground, gasping for air, he hears:  STRANGE GUTTURAL SOUNDS. COMING FROM BEHIND HIM.  He pushes to his feet and turns to the sound.  Foliage shudders. The sounds grow. Something is   coming .  Will abandons his bike --  And runs .  EXT. MONTAUK BEACH -- NIGHT  Will bursts out onto the beach.  The wind whips his clothes. Waves crash the shore. Roaring.  10.",
      "characters": [],
      "action_text": "MOMENTS LATER.  He races up a dune toward a house.   His house .  It is small, lower class, and falling apart after decades of  abuse from the battering ocean winds. But it offers safety.  INT. THE BYERS HOUSE -- NIGHT  Will slams the door shut behind him and bolts the lock.  A shaggy mutt, CHESTER, races to greet him.  Will ignores him, calls for his family.  WILL  MOM?! JONATHAN?! MOM?!  There is no answer.  He checks his   MOM’S BEDROOM . His   BROTHER’S BEDROOM .  No one is home.   He is all alone .  INT. THE BYERS HOUSE - LIVING ROOM  Will scrambles back to the living room window.  He cups his hands to the glass and peers out into the yard.  It is dark. Murky. Quiet. A gust of wind blows and...  Day-old laundry flutters on a clothes line to reveal...  THAT FIGURE AGAIN. JUST STANDING THERE AMONGST THE BILLOWING  LAUNDRY. WE CAN’T MAKE OUT ANY FEATURES, BUT ITS PROPORTIONS  SEEM... OFF. ITS HEAD IS TOO LARGE. ITS ARMS TOO LONG. ITS  BODY SWOLEN AND BENT IN A STRANGE, TWISTED SHAPE.  Another gust of wind. The clothes flutters again and...  The Figure is gone .  Will pales. His heart in his throat.  INT. KITCHEN - MOMENTS LATER  Will rips a phone off the kitchen wall. Dials 911. But --  It does not ring. Just hums with LOW-END STATIC.  WILL  Hello?! HELLO -- ?!  11. Will pauses. He hears something on the other line. But not a  voice... it is that GUTTURAL SOUND he heard in the forest.  The pitch rises and falls, making a series of strange sounds.  Words ? It is as if the figure... whoever...   whatever   it is...  is somehow speaking to him through the phone receiver.  Behind him, Chester begins to GROWL at the front door.  Will lowers the phone. And looks back at the door.  A SHADOW fills the crack at the base of the door.  And then somehow,   impossibly , the chain bolt begins to slide  open, as if drawn by an invisible hand. The metal SHRIEKS.  Will drops the phone and --  EXT. BYERS HOUSE - NIGHT  WHOOM! Will explodes out the back screen door.  He sprints into",
      "dialogue_count": 0,
      "word_count": 1155
    },
    {
      "scene_number": 4,
      "slugline": "INT. HOPPER’S HOUSE - BEDROOM - A LITTLE LATER  Hopper dresses.  He yanks on a pair of brown pants... A matching brown  collared shirt... A belt with a holster... A 9MM GLOCK...  And lastly, he clips on a GOLD BADGE. It reads:  MONTAUK POLICE. CHIEF.  MOMENTS LATER.  Hopper heads out the door. We watch through the smudged  window as he climbs into CHEVY BLAZER POLICE CAR. Mustard  sides. Square sirens.  As he peels away, we   DOLLY TOWARD   a FRAMED PHOTOGRAPH hanging  on the wall. In it, a young Hopper stands with a PRETTY WIFE.  He cradles a LITTLE GIRL in his arms.  He looks like a different man.  He looks   happy .  EXT. BYERS HOUSE - MORNING  Silence outside the Byers house.  The wind has died down. The laundry no longer flutters.  The shed is quiet.  INT. BYERS HOUSE - KITCHEN - MORNING  JONATHAN BYERS, 16, Will’s older brother, cooks breakfast.  He is lanky with dark hair to his shoulders. He’s quietly  handsome... but he wouldn’t believe it if you told him.  JOYCE (O.S.)  Where the fuck are they?!  His mom, JOYCE BYERS, late 30s, races past. She wears a peach  waitress uniform and too much make-up. She has a Long Island  accent, which comes out even stronger when she curses.  JOYCE (CONT’D)  Fuckfuckfuck --  JONATHAN  Check the couch.  Joyce does. She finds her keys under a cushion.   Thank God.  15.",
      "characters": [],
      "action_text": "She snatches them up, gives Jonathan a quick peck on the  cheek, and races for the door, only to pause at the last  second. She turns back to Jonathan.  JOYCE  -- Will?   Where’s Will?  JONATHAN  Sleeping I guess.  JOYCE  You gotta make sure he’s up,  Jonathan, how many times -- ?!  JONATHAN  I’m making breakfast --  JOYCE  And I work two jobs. Only one if  I’m late again.  Joyce storms to Will’s room. Ranting as she goes.  JOYCE (CONT’D)  Then how will we pay the bills?!  You think you can feed this family  working two nights a week at a  movie house? We’ll be out on the  goddamn street --  INT. DUSTIN’S ROOM - MOMENTS LATER  Joyce throws open the door to Will’s room. Silences.  INT. KITCHEN - MOMENTS LATER  She strides back over to Jonathan. Worried now.  JOYCE  Will came home last night, right?  JONATHAN  He’s not in his room?  JOYCE  He come home or not?  JONATHAN  I don’t know --  JOYCE  You   don’t know ?  16. JONATHAN  I was at the dark room late. I...  I guess I lost track of time --  JOYCE  I told you to wait up for him,  Jonathan, I   specifically   told you --  JONATHAN  He was over at the Wheelers’ all  day. I’m sure he just stayed over.  JOYCE  Seriously Jonathan? Seriously?  JONATHAN  I’m sorry --  JOYCE  Fuck!  Joyce grabs the kitchen wall phone. Mashes a number.  INTERCUT WITH:  INT. THE WHEELERS HOUSE - KITCHEN - MORNING  A WALL PHONE RINGS at the Wheelers. It is chaos over here.  Mike is grabbing SYRUP from a cabinet; Nancy is eating  scrambled eggs, HOLLY, 3, is crying; Ted is watching the  morning news; and now the phone is ringing.   The fucking  phone.  Karen answers. Holly squirms in her arms.  KAREN  Hello?  JOYCE  Karen -- it’s Joyce.  KAREN  Joyce, hi --  Behind her, Mike pours syrup onto his scrambles eggs.  NANCY  That’s   disgusting .  MIKE  It’s good, swear.  Mike squeezes some onto Nancy’s eggs.  17. NANCY  WHAT THE FUCK MIKE?!  TED  HEY! LANGUAGE!!  Karen puts the phone on her shoulder. She can’t hear Joyce.  KAREN  QUIET!  (back to J",
      "dialogue_count": 0,
      "word_count": 4460
    },
    {
      "scene_number": 5,
      "slugline": "EXT. FOREST ROAD - DAY  WHOOSH! TWO POLICE CARS speed down the road.  EXT. FOREST ROAD - DAY  The cars pull off onto the side of the road.  Hopper, Callahan, and Powell step outside.  EXT. MIRKWOOD SHORTCUT - A FEW MINUTES LATER  Hopper trudges down the road, searching for signs of Will.  Behind him, we can see Callahan and Powell. They call out:  CALLAHAN  Will Byers?! WILL BYERS?!  POWELL  WILL -- ?!  Hopper pulls a vial out of his pocket. Pops two more of those  red and blue pills. And...  He suddenly spots something. Kneels down. There are FAINT  SKID MARKS ON THE PAVEMENT. Too narrow for a car.   A bike .  He calls out to Callahan and Powell.  HOPPER  Hey, I got something here...  Hopper tracks the skid marks off the road and into...  THE FOREST.  Hop makes his way down the slope. Sure enough, he finds  WILL’S BICYCLE at the bottom. He brushes leaves away,  revealing the front wheel. It is bent, spokes busted.  Callahan and Powell scramble down after him.  CALLAHAN  Shit. That his bike, Chief?  HOPPER  (nods)  Wheel’s busted. Musta crashed.  CALLAHAN  Think he got hurt in the fall?  Hopper looks back up the slope. Squints in the sun.  38.",
      "characters": [],
      "action_text": "HOPPER  Not so hurt he couldn’t make it  home. And a bike to these kids...  that’s like a Cadillac. Doesn’t  make sense he’d leave it out here.  He’d walk it home.  A beat. Then:  HOPPER (CONT’D)  He was in hurry.  EXT. MONTAUK BEACH - A FEW MOMENTS LATER  Hopper and the Deputies walk out onto the beach.  A TRAIL OF FOOTPRINTS lead up a dune toward:  The Byers House.  INT. BYERS HOUSE - KITCHEN - AFTERNOON  Joyce paces in the kitchen. Back and forth. Back and forth.  The wall phone is pressed hard to her ear. Its cord stretches  as she walks. She drags hard on a cigarette while it rings on  the other end. And rings. And...  CLICK. The other line picks up.  JOYCE  Lonnie, Thank God. It’s Joyce --  Her face drops. A MUFFLED FEMALE VOICE is on the other end.  JOYCE (CONT’D)  Who is this?  (listens in disgust)  Cynthia?  (beat)  This is Joyce --   Joyce,   Lonnie’s   ex-  wife . I need to speak to Lonnie --  (beat)  This is an emergency... no, not  later,   now   bitch --  CLICK. The phone goes dead. Joyce burns with anger.  She dials the number again, mashing each number with her long  fingernails. The phone rings. But this time no one answers.  It goes to message.  39. MALE VOICE (O.S.)  (filtered)  Hey, you’ve reached Lonnie, I’m not  here at the moment but...  Joyce’s rage rises and rises and...  BEEP. Her turn.  JOYCE  Lonnie, it’s Joyce. Some teenage  whore sayin’ she’s your girlfriend  just hung up on me. You don’t call  me back in the next goddamn hour  I’ll report you for not paying  child support I swear to God I will  and I’ll make sure you rot in jail  where you belong you FUCKING PIECE  OF SHIT --  WHAM! Joyce slams the phone down and --  BRRRRING! The phone blares again.   That was fast.   She answers.  JOYCE (CONT’D)  Lonnie --  But there is no response. Only static. The kitchen lights  flicker, then return to normal. Joyce stares. What the -- ?  BAM BAM BAM. THERE IS A SUDDEN POUNDING ON THE DOOR.  Joyce startles.  MOMENTS LATER.  Joyce swings open the d",
      "dialogue_count": 0,
      "word_count": 2371
    },
    {
      "scene_number": 6,
      "slugline": "EXT. BENNY’S FISH ‘N FRY - NIGHT  A light flickers inside the FISH N FRY.  INT. BENNY’S FISH ‘N FRY - KITCHEN - NIGHT  Benny glances at the light. Then returns to cleaning dishes.  Eleven sits cross-legged on the floor. She is feeding his  rottweiler strips of raw fish. They’re best friends now.  BENNY  Make sure he doesn’t get any bones  now. Don’t want him to choke.  Eleven feeds the dog one last strip of meat. The dog gobbles  it up, then licks her on the lips. She recoils, then smiles.  For the first time this day, she seems like an actual kid.  Benny notices. Knocks off the faucet.  BENNY (CONT’D)  A smile looks good on ya.  Eleven stares at him. Confused.  BENNY (CONT’D)  A smile.  Benny gives a big smile. Eleven smiles back.  ELEVEN  Good.  BENNY  Yeah, it is good.  She shakes her head. “No.” Then she points at him.  ELEVEN  Good.  BENNY  Me?  Benny can’t help but chuckle.  BENNY (CONT’D)  A know a few ladies who’d beg to  differ.  Benny rolls up his sleeve. There are names tattooed on his  arm. SHARON, BETTY, CAROL ANN. His exes . Mostly.  Eleven points at a male name: “TOMMY.”  51.",
      "characters": [],
      "action_text": "ELEVEN  ...Brother.  Benny stares. His heart skips a beat. His voice catches.  BENNY  ...What’d you say?  ELEVEN  Little brother.  Eleven smiles again. But Benny does not. He is flustered  and confused.   He finally starts to speak when he hears...  THE SOUND OF TIRES ON GRAVEL. Headlights sweep past the  window.  Eleven tenses. Nervous.  BENNY  Just... stay put. Whoever it is,  I’ll turn ‘em away, a’ight?  INT. BENNY’S FISH ‘N FRY - DINING ROOM - NIGHT  Benny lumbers into the dining room. He opens the front door.  A RED-HAIRED WOMAN, 40, approaches. She smiles warmly.  RED-HAIRED WOMAN  You must be Benny. Benny Henderson?  BENNY  ‘fraid so. Also ‘fraid we closed  shop early tonight. Why don’t you  try back tomorrow --  Benny starts to shut the door, but the woman extends a hand.  RED-HAIRED WOMAN  Connie Frazier. Social services.  Benny stops. Opens the door back up. Embarrassed.  BENNY  Social services . Shit. Apologies.  He takes her hand. His grip is firm.  BENNY (CONT’D)  Didn’t think you were gonna make it  here so quick. That’s a heckuva  drive.  52. CONNIE  Not too bad this time of night.  Benny nods. Lowers his voice.  BENNY  Listen. I still haven’t told her  about you. I didn’t want her  runnin’ off again. She’s a tad...  skittish.  CONNIE  Children I work with usually are.  (smiles)  Where is she now?  BENNY  In the back. I’ll introduce ya.  Benny turns and lumbers toward the kitchen.  BENNY (CONT’D)  Apologies again for trying to turn  you away. It’s funny, your voice,  it sounded different on the --  A HOLE SUDDENLY ERUPTS IN BENNY’S FOREHEAD. BLOOD SPRAYS.  HIS BODY GOES LIMP AND HE CRASHES TO THE GROUND WITH A HEAVY  THUD. A POOL OF BLOOD SPREADS FROM THE WOUND ON HIS HEAD.  HIS BODY TWITCHES. THEN STILLS.  HE IS DEAD .  Behind him: “Connie” holds a silencer pistol.  A GROUP OF ARMED MEN sweep into the door behind her.  These aren’t social workers.  These are Agents.  INT. KITCHEN - MOMENTS LATER  Three Armed Agents sweep into the kitchen.  Two more e",
      "dialogue_count": 0,
      "word_count": 2649
    }
  ]
}