{
  "slug": "stuber-2019",
  "title": "stuber",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 11,
  "characters_count": 0,
  "characters": [],
  "total_words": 21352,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. FOUR STAR HOTEL - DOWNTOWN - NIGHT The unmistakable “ U ” decal in the windshield of an Uber car as it pulls up to the hotel valet. Its drunk passengers spill out and head into the posh hotel past other Ubers and taxis jockeying for position. INSERT TITLE:   DOWNTOWN LOS ANGELES  An unmarked DODGE CHARGER parks and two people emerge: DETECTIVE VIC MANNING (50s, seasoned vet, been to hell and back and preferred hell) and his partner, DETECTIVE SARA RODRIGUEZ (30s, savvy, asphalt tough, one of the guys). They head for the lobby entrance, their LAPD jackets repelling the rain, continuing an earlier conversation. RODRIGUEZ Jesus, why do you hate every single guy I date? VIC Hate? I never said hate. I just said it’s too soon to move in. I’m sure he loves you, but living with a cop... My ex-wife could write a trashy novel about it. RODRIGUEZ Luckily, I’m not you. And Derek isn’t your ex-wife. At least... wait... am I dating your ex-wife? VIC Not unless he’s got a tattoo of David Crosby’s face on his upper thigh. Rodriguez chuckles: gross. INT. HOTEL CHECK-IN DESK - MOMENTS LATER The MANAGER looks Vic and Rodriguez up and down. MANAGER I’ll just let Ms. Johnson know you’re on your way up. He reaches for the phone and Vic stops him.",
      "characters": [],
      "action_text": "VIC It’s best if we surprise “ Ms. Johnson. ” The Manager nods, a little unnerved. Rodriguez and Vic head towards the elevator bank, continuing-- RODRIGUEZ One day you’re gonna have to let me grow up. You know that, right? VIC I know how this plays out. First you move in together, next you start a family-- RODRIGUEZ If you think I’d ever trade in my badge for a baby stroller, then fuck you, Vic. Vic beams, almost like a proud father. VIC Yeah. Fuck you, too. Ding! They head inside-- INT. HOTEL ELEVATOR - CONTINUOUS Taps the PENTHOUSE button. Long ride up. RODRIGUEZ You really think someone like Santos would stay here and not some kinda safe house? VIC (shrugs) You got the same intel I got. “ Ms. Johnson .” Probably a celeb hiding out on a coke bender. RODRIGUEZ I’m starving. Let’s hit that Korean taco spot after this. Ding. They’ve arrived. Just as the doors open-- A GIANT KNIFE slices towards them! Just misses Vic, but it’s CAUGHT IN HIS JACKET. 2. The MASSIVE GOON wielding it leaps into the elevator, smashes Rodriguez in the face with an elbow as Vic wrestles for control of the knife! Rodriguez drops to the floor, disoriented, but manages to keep the elevator doors from closing with her foot. Vic’s got his LAPD jacket wrapped around the Goon’s knife hand as he HEAD BUTTS the guy over and over again. Rodriguez gets her bearings. Leaps up and CHOKE HOLDS the asshole from behind, occupying him just enough for-- Vic to TURN THE KNIFE inward on the Goon and... SHOVE THE BLADE into his gut. Holy shit. The Goon DROPS to the ground. The elevator doors thud against his torso attempting to close. He’s bleeding out. Vic and Rodriguez share a look, catch their breath. RODRIGUEZ (CONT’D) Let’s call for backup. Vic shakes her off: this is our collar. Santos is here. They DRAW THEIR WEAPONS and enter the elegant floor-wide penthouse. It’s quiet. Too quiet. They search each room carefully. RODRIGUEZ (CONT’D) Vic. REVEAL: open balcony door. They rush out, look down to see-- A bada",
      "dialogue_count": 0,
      "word_count": 3073
    },
    {
      "scene_number": 2,
      "slugline": "INT. EYE DOCTOR’S OFFICE - DAY The DOCTOR’s examining Vic’s eyes through a phoropter eye scope. Vic’s wearing weird post-surgery goggles. EYE DOCTOR Mmm hmmm. Mmm hmmm. Yeah. (looks up from scope) Everything looks good. VIC Good? EYE DOCTOR I could say “bitchin’” but that doesn’t seem very doctorly. (tests it out) Surgery was a bitchin’ success. Vic hates banter. Feels around for his eyeglasses. EYE DOCTOR (CONT’D) Won’t need those anymore. VIC How long before I can see straight? EYE DOCTOR The blurriness should dissipate in the next 24 hours, give or take. No driving, operating heavy machinery. Basically don’t do anything you wouldn’t do while intoxicated. Doc reaches into a drawer and hands Vic a MINI EYE CHART (just like the big one on the wall but hand-held). EYE DOCTOR (CONT’D) When you can read the bottom line, you’re good to go. VIC’S POV: the whole chart is blurry as fuck. MATCH CUT TO: THAT SAME BLURRY AS FUCK CHART AS VIC STARES AT IT IN-- INT. NICOLE’S CAR - DAY Vic rides shotgun in his goofy paper goggles, trying to make sense of that chart. 15.",
      "characters": [],
      "action_text": "VIC Jackass screwed up my eyes. At the wheel we find Vic’s daughter, NICOLE (20s, bangs, tattoos and piercings belie a beautiful, thoughtful girl). NICOLE Chill. It’s only been half an hour. Vic fumes in his seat, quietly muttering something angrily. NICOLE (CONT’D) You gonna make it over there? Vic says nothing. Nicole uses the silence to change gears. NICOLE (CONT’D) I’m gonna spend Christmas with Mom and David. Just thought you’d want to know. VIC  David ... NICOLE I know you have to hate him because that’s like a thing, you gotta hate your ex’s husband. But he’s actually a good guy. And he makes Mom happy. You know they have a scheduled date night every Friday? VIC What about Howard Wu’s? It’s our Christmas night tradition. NICOLE Howard Wu’s is your tradition. Not that you ever ask, but I hate that place. It’s a wasteland of dirty dishes and MSG. VIC Howard’s good people. Back in ‘99 he gave me vital information which helped me crack-- NICOLE --the Melrose Murders. I know, Dad. More silence as Nicole pulls into the driveway of her Dad’s fourplex building, clearly somewhere up in the valley. 16. NICOLE (CONT’D) I know your vision’s banged up, but think you can make it tonight? (off his confusion) Tonight. Abbot Kinney. My first gallery show. Ever. Nothing?? VIC I know. I know. Abbot Kinney. (beat) The thing is, you know, I don’t fit into that scene. I’m a ballpark and Budweiser guy. And like you said, with my vision I don’t think I could appreciate your paintings-- NICOLE My   paintings ?! Jesus Christ, I’m a fucking sculptor. VIC Calm down. You know what I meant. I’ll make the next one. NICOLE Give me your phone! Hand it over! Vic reluctantly digs into his pocket, hands her his phone. She starts swiping and typing. VIC What are you doing? NICOLE You’re not gonna make   the next one ! You’re gonna make this one! VIC Honey... You’re being emotional. NICOLE Yeah! You should try it some time! (re: his phone) What year is this phone from? And these icons! Holy shit,",
      "dialogue_count": 0,
      "word_count": 2399
    },
    {
      "scene_number": 3,
      "slugline": "INT. LOADING DOCKS - KOREATOWN WAREHOUSE - MOMENTS LATER Vic crawls into the loading dock area, still tracking the droplets when he arrives at-- LEON’S DEAD BODY in a pool of blood. Multiple gunshot wounds. Vic checks his pulse then sighs.   Fuck . Then he hears-- A noise! Someone’s coming! He turns abruptly and-- FIRES HIS PISTOL! AND-- Misses a STRAY CAT by a fucking mile! It hisses and runs off through the factory. Vic exhales. Returns to Leon. Quickly pats him down, searching Leon’s pockets for something, anything, then locates-- Leon’s CELL PHONE. Vic pockets it. INT. STU’S LEAF - DUSK Stu sees Vic exit the warehouse. Vic doesn’t see him, so he TAPS HIS HORN and waves. Vic rushes over and hops in. STU How was your friend? VIC Huh? STU You guys have a nice visit? VIC No. STU (noticing) Is that... blood on your shirt? VIC No. Vic’s too busy looking at LEON’S CELL PHONE. If he holds it 2” from his eyes he can read the numbers. VIC’S POV: an EXTREME CLOSE-UP of Leon’s recent calls with “ Vic Dickhead ” listed at the top of the call log. The only other call is: “ Shaniqua Titties .” Vic dials it. STU So. Where to next? 27.",
      "characters": [],
      "action_text": "Silences Stu with a finger. Waits for “Shaniqua Titties” to answer. Vic does a surprisingly awesome LEON IMPRESSION: VIC  Yo Shaniqua, it’s Leon. Haven’t seen you in a minute, girl!  ON STU’S FACE: what the fuck is happening? VIC (CONT’D)  HA! You know I can dig that. Yeah, you keep that ass warm for Leon.  Vic hangs up. STU Maybe not the   most   offensive thing I’ve ever seen, but Top 20 easy. VIC The Sizzle Room. Compton. (then) And I’m not typing the address into the goddamn app. Stu nods. Silently motors away from the warehouse. INT. STU’S LEAF - NIGHT Compton at night is fantastic: low-riders, hookers, dudes smoking crack on the sidewalk. The occasional WOP-WOP of a police siren -- everyone screams “fuck you” in return. STU Don’t get many ride requests out here. It’s, uh, scenic. VIC Yeah. Real paradise. At a red light, a CRACKHEAD knocks on Vic’s window: CRACKHEAD Hey man. My car broke down and I need a dollar for gas. STU (digging into pocket) I think I’ve got a-- Vic rolls down his window and FLASHES HIS GLOCK. 28. VIC Back the fuck away from the car. Stu’s face is frozen in fear. The light turns green. VIC (CONT’D) Let’s get a move on, pal. Stu drives. After a beat, he gathers the courage. STU So. Once I get you to The Sizzle Room--which I’m hoping is some kind of steakhouse--I’m gonna need to end my shift. Call it a night. VIC No. That doesn’t work for me. STU It... doesn’t work for you? The beauty of Uber is I get to set my own hours. And I’ve set them-- And also, Vic, I’m gonna be totally straight with you, having a .357 magnum in my car freaks me out. VIC It’s a glock. STU Oh. Great! Just a glock? I should’ve left you in Koreatown. Because of you, those other two riders gave me zero stars.   Zero ! VIC What is this, kindergarten? You need some gold stars to put in your little chart? STU No. I need stars, digital stars-- I need high ratings to keep this job. Zero stars are an Uber driver’s worst nightmare, so thanks. VIC It’s really sad how much validat",
      "dialogue_count": 0,
      "word_count": 1534
    },
    {
      "scene_number": 4,
      "slugline": "INT. QUIET ROOM - CONTINUOUS Nice and quiet and dark. Stu sits on a satin couch. STU (to Goddess) Perfect. Thank you. (answers phone) I know what you’re gonna say and I’m so so sorry about dinn-- BECCA (O.S.) Stop lying to me, Stu! STU Whoa. What? BECCA (O.S.) In your text check-in, you said you have to cancel dinner because you got -- and I quote -- a “big fare to Long Beach.” The LIGHTS DIM. Stu doesn’t notice. STU Yeah! Exactly. I’m in traffic right now. BECCA (O.S.) Noooo, you’re in some fucking place called The Sizzle Room in Compton! STU (reeling/confused) Wha-- How-- I-- Goddess puts on some sexy music: SADE. BECCA (O.S.) Find my iPhone! STU You’re tracking my phone?! BECCA (O.S.) Of course I’m tracking your phone. I don’t want you to get raped. STU Damn. What is your obsession with that happening to me?! 35.",
      "characters": [],
      "action_text": "BECCA (O.S.) I dunno, Stu. What’s your obsession with lying to me? STU I’m not--! I’m-- Stu watches as Goddess removes her THONG and approaches him seductively wearing nothing but high heels. STU (CONT’D) I’m picking up the passenger right now in Compton at a very classy steakhouse called The Sizzle Room. Then I’m heading to Long Beach to drop her off. Goddess twirls, then sits down on Stu’s lap and starts GRINDING HIM, slowly at first. STU (CONT’D)  Him ! Drop   him   off. My passenger is a him. A man. A very ugly man. (covering phone) Please. Please stop doing that. Goddess smiles seductively, then CHANGES TEMPO. She’s naughty, and quite gifted in the art of lap dance. STU (CONT’D) (abruptly) Babe? Still there? BECCA (O.S.) Yeah. I’m just thinking. Stu breathes deeply, waiting patiently for Becca to think, trying not to blow his load as Goddess grinds him. BECCA (O.S.) (CONT’D) Do you 100% absolutely positively promise that you’re telling me the truth, my Stu-Bear? Goddess raises up and plops her ass down hard on his crotch. STU (moans) OH GOD YES. (under control) Yes. I promise, my Becca Bird. 36. BECCA (O.S.) (intrigued) Classy steakhouse, huh? I’ve never seen it on Eater. Maybe we can go there next month for our 18th anniversary? STU Yeah... Absolutely. You’d love it. Goddess drops to her knees, goes to UNZIP STU’S PANTS -- too far! -- so Stu politely EVADES HER, quickly tries to find a way out of the dark Champagne Room. Still on the phone: STU (CONT’D) Killer apps. And uh, Champagne. BECCA (O.S.) Ooh, Champagne sounds yummy. STU Yeah, there’s an entire room of it. BECCA (O.S.) Weird. I’m looking online. I don’t see a menu. An exit. Thank God! He pushes through the door and into-- ANOTHER CHAMPAGNE ROOM! Stu’s face: Oh dear God... DAWSON (from the valet) and a STRIPPER are totally naked screwing up against the wall. CHAMPAGNE ROOM STRIPPER FUCK MY ASS, DAWSON! BECCA (O.S.) STU WHAT THE HELL WAS-- STU ENDS THE CALL. Tries to quietly tiptoe back out when-- BIRD ",
      "dialogue_count": 0,
      "word_count": 535
    },
    {
      "scene_number": 5,
      "slugline": "INT. BACKSTAGE - THE SIZZLE ROOM - NIGHT Vic’s sitting across from SHANIQUA at a vanity. She’s dabbing her eyes with a tissue, clearly emotional. SHANIQUA I just talked to him this afternoon. I can’t believe it. Vic pats her shoulder with the bedside manner of a brick. VIC There there. SHANIQUA  There there ? You fucking serious? Vic tries again, with meaning: VIC I’m sorry you had to hear it like this. Leon was a good informant and I’m sure... a good boyfriend. (then) But I need you to think hard. Did he ever mention anything about someone named Carolina Santos? (off her head shake) Anything about shipments out of Colombia? Peru? Ecuador? Think carefully,   Ms. Tittyais . Shaniqua racks her brain, then suddenly: SHANIQUA Amo. Amo Cortez. VIC Amo Cortez. SHANIQUA Leon did a minute in Lancaster. Amo was his cell mate. Leon mentioned something about Amo getting him in on something big. VIC Drugs? Guns? SHANIQUA Dunno. Leon called it “import/export,” made him feel like a big shit. 38.",
      "characters": [],
      "action_text": "VIC Good. Good. I need to get in touch with this Amo Cortez. SHANIQUA Runs with the 182nd Locos, but that’s all I know. VIC This is plenty. Thank you. Vic turns for the door. SHANIQUA You gonna get ‘em? The fools who smoked Leon? VIC That’s the plan. SHANIQUA Then I should thank you. She sobs quietly. Though as soon as Vic exits, her TEARS VANISH INSTANTLY. She straightens up quickly. EXT. THE SIZZLE ROOM - NIGHT Stu and Vic approach the Leaf. STU That place was insane! You’re a cop, let me ask you something. Is it legal for one man to witness another man make love? I’m asking for a friend, of course. VIC We’re heading west to Lawndale. STU I was hoping maybe you’d say Long Beach, but Lawndale it is. Stu scrolls through his iPhone and DISABLES the   Find my iPhone   feature. They hop in the Leaf. As they pull away, we catch-- SHANIQUA standing by an employee entrance. She covertly watches Stu’s Leaf roll by. Speaks into her cell phone: 39. SHANIQUA You said I should call if anyone comes by asking questions? (then) There’s two of ‘em. You want the license plate, too? INT. STU’S LEAF - NIGHT Heading through Gardena towards Lawndale. At a red light, Stu reads a lengthy text message from Becca. STU (to self) Shit... She is next level pissed. VIC Know what your problem is, Steve? You never went through puberty. Stu sighs: good one. VIC (CONT’D) When I was 14, my Dad took me on a camping trip. STU I bet you guys used a Coleman dome tent. Those are still a big seller. Vic glares at him and continues. VIC Didn’t see the old man much, but when he was in town, I was excited to do whatever the hell he wanted. On this particular occasion, he said camping. So we drove out to Sleephole Valley, out past 29 Palms. (beat) First night there, he hops in his truck, says he’s gonna run into town to grab groceries. What that really meant was he was gonna tie one on and make friendly with a Palm Desert local. STU A prostitute? 40. VIC Stop interrupting my story. (beat) So a few hours go b",
      "dialogue_count": 0,
      "word_count": 952
    },
    {
      "scene_number": 6,
      "slugline": "INT. STU’S LEAF - CONTINUOUS Stu’s busy constructing the perfect apology text. STU TEXT POP:   I’m so sorry about earlier. Been a weird night. Will explain later, I promise. You’re my Becca Bird. And I’m your Stu-Bear.  He waits. And waits. And waits. Then. BECCA TEXT POP:   You’ve disappointed me.  He sighs. INT. 182ND LOCOS CRACK HOUSE - CONTINUOUS Everyone’s seated on the couch and living room floor as Vic holds court. VIC All I want is ten minutes with Amo Cortez and I’ll get out of your lives. They remain silent on the couch, Amo included. VIC (CONT’D) Are you Amo Cortez? Are you? How about you? No? Nothing? (then) What the hell’s wrong with your dog? REVEAL: their pitbull dramatically moaning and crawling on the floor, starts dry-heaving by the coffee table. GANGBANGER Nothing’s wrong with him. Don’t you need a warrant or some shit? The pitbull continues pacing around the room dry-heaving. VIC No. You invited me in. And if you don’t tell me where I can find Amo Cortez, I’m gonna shoot your fancy flat screen TV. Vic aims his pistol in that direction. GANGBANGER Dude, that’s the fish tank. 43.",
      "characters": [],
      "action_text": "Vic squints, then aims his pistol in another direction. GANGBANGER #2 That’s a microwave. Annoyed, Vic aims his Glock right at them. VIC You got five seconds to tell me where I can find Amo Cortez or it’s gonna start raining bullets. But before he counts, the PITBULL VOMITS UP THREE POUNDS OF WEED ALL OVER VIC’S SHOES. Holy shit that’s a lot of weed. A beat. Silence. Their faces say it all: oh fuck. Vic grabs a 40oz off the table, deliberately pours it over his shoes to clean off the weed vomit. Clearly pissed. AMO CORTEZ So. Um.   Hypothetically , if uh, one of us here was Amo Cortez,  hypothetically , is there any way you could forget what just happened? VIC (smirks) Nice to meet you, Amo.  Hypothetically . Vic approaches Amo and yanks him to his feet hard. VIC (CONT’D) Carolina Santos. When and where’s the meet? WHEN AND WHERE?! AMO CORTEZ I don’t know shit about that. VIC Let’s go. Yanks Amo through the living room and out the front door. INT. STU’S LEAF - NIGHT Stu sees Vic approaching with Amo. Squints: is that guy in handcuffs? Yep! Behind his back. Vic opens the rear door and SHOVES AMO INSIDE hard. 44. AMO CORTEZ Damn, homie! I got fucking rights. STU (perplexed) Uh. VIC?! What’s-- VIC Just a friend of mine. STU In handcuffs?! VIC He’s a friend who doesn’t feel much like talking right now. (to Amo) But he will. Because he knows he’s looking at six months for possession. And that’s where we head next, Amo: jail. AMO CORTEZ I ain’t got shit on me. VIC I’m gonna go fill that fucking dog vomit in a ziploc with my bare hands. Damn, I can throw an animal cruelty charge on top of it. Not your day, Amo, is it? Vic slams Amo’s door shut. Stu leaps-- OUTSIDE THE CAR -- Rushes to confront Vic on the sidewalk. STU You’re not-- You can’t just leave him in my car. VIC He’s jumping in my UberPool. STU No. That’s not how that works. UberPool is only if another passenger is heading in a similar-- VIC Here. Take this. Vic reaches into his ANKLE HOLSTER, pulls out a .22 PISTO",
      "dialogue_count": 0,
      "word_count": 1323
    },
    {
      "scene_number": 7,
      "slugline": "EXT. BAYSIDE ANIMAL HOSPITAL - NIGHT Stu helps Vic carry Amo into the building, which is clearly closed for business. Stu clocks the ANIMAL HOSPITAL sign: STU You said hospital! VIC It is a hospital. STU An animal hospital! VIC Last I checked, humans are animals. A LIGHT flicks on from inside and DR. BRANCH (elderly, avuncular) politely waves to Vic and Stu. INT. BAYSIDE ANIMAL HOSPITAL - NIGHT Amo lay passed out on a big metal table as Dr. Branch stitches up the leg. Off to the side, Stu paces maniacally. Vic sits in a chair. STU I’m fucked. I’m so fucked. VIC Sit down. Relax. You didn’t do anything wrong. STU (sarcastic) Yeah. Yeah, good point. Shooting an innocent handcuffed man was the right thing to do. VIC Oh, he’s innocent now, too? What is this, a Bernie Sanders rally? (off Stu’s confusion) That scumbag over there has information that’s going to help keep this city safer for years to come. Now sit down and relax. Everything’s fine. I promise you. Stu takes Vic’s advice. Sits down and breathes deeply. Calms. Vic pulls out his eye chart again and studies it. 50.",
      "characters": [],
      "action_text": "STU What’s with the eye chart? VIC Had Lasik this afternoon. STU This afternoon? And you’re out going around town busting heads? What’s wrong with you? VIC You sound like my daughter. STU You have a daughter?? Man, if I were her I’d stay as far away from you as possible. VIC Hey. My daughter and I have a-- (hesitates) Everything’s good between us. STU I’ve only known you a few hours and I find that hard to believe. Dr. Branch nods to Vic and Stu and they hustle over. STU (CONT’D) Is he okay? Is he gonna live? DR. BRANCH He’s fine. Minor tissue damage. It’ll heal itself in a few weeks. Stu exhales, totally relieved! Vic’s vision isn’t great, but he feels the stitches: VIC Nice stitch job, Doc. DR. BRANCH Least I could do for you, Vic. (re: Amo) Gave him some sedatives, should be snapping out soon. Just tell him to stay off the leg for a few days. Dr. Branch shakes Vic’s hand and heads into his office in the next room. Stu tries to make sense of everything. 51. STU I’m glad he’s okay. (thinks) Do I need to... fill out a report or something now? Give a statement? VIC Nah. I’ll take care of it. Stu shakes his head, exhausted, borderline emotional. STU Look, Vic. I’m not equipped for this. Whatever this is. Can you please relieve me from my penal code or whatever and just let me go home? (long beat) I just want to go home now. Vic looks at Stu, his slumped shoulders. Nods. VIC Okay, kid. I understand. If you want to take off, I’ll find another driver. AMO CORTEZ (O.S.) He shoots me in the fucking leg and he just gets to leave?! They turn to see Amo awake on the table. VIC Hey! He said he was sorry. (then) Go ahead, Steve. Take off. Stu does just that. Heads out through the exit. EXT. BAYSIDE ANIMAL HOSPITAL - NIGHT Stu exits, unlocks the Leaf and hops in. But he doesn’t turn it on. He just buries his head in his hands, needing some time to breathe. Not noticing the-- BLACK ESCALADE killing its lights a few parking spaces away. INT. BAYSIDE ANIMAL HOSPITAL - NIGHT We resu",
      "dialogue_count": 0,
      "word_count": 2378
    },
    {
      "scene_number": 8,
      "slugline": "INT. STU’S LEAF - NIGHT Stu silently motors out of the parking lot with Vic in shotgun. VIC Drive with purpose. Stay focused. If you think you’ve picked up a tail, you probably have. Got it? (tries to view clock) What time is it? STU Nine-thirty. VIC Good. We’ve got time. Head to Venice. Abbot Kinney. STU I don’t want any more... guns. Bodies. Can’t handle it right now. VIC How ‘bout sculptures? Can you handle those? Off Stu’s confusion... INT. ART GALLERY - ABBOT KINNEY - NIGHT Knit beanie hats, ironic t-shirts and $600 Japanese selvedge denim jeans. Rich hipster overload. But the artwork is incredible. Massive modern sculptures of welded steel and glass. In the center of it all, we find a wealthy SOCIALITE swooning over NICOLE (Vic’s daughter). SOCIALITE The tryptich of the penises is a divine revelation. NICOLE Those aren’t penises. They actually represent the three phases of my childhood during my parents’ divorce: joy, confusion, isolation. SOCIALITE So in other words: penises. The socialite guffaws. Nicole’s annoyed, smiles politely. 62.",
      "characters": [],
      "action_text": "NICOLE I think I see someone I know. She doesn’t. Walks away anyway. AT THE ENTRANCE: we find VIC and STU, both covered in blood spatter and looking like total garbage. RANDOM HIPSTER Love the shirts, brothas. Blood spatter prints are scorching hot right now. The new chevron. VIC Take a hike, pal. The Hipster smiles, thinks he’s kidding. Then realizes he’s not kidding and walks off. Stu keeps looking over his shoulder, out at the street. VIC (CONT’D) Relax. Nobody tailed us here. STU How can you be sure? VIC I make a living being sure. (then) Go have a drink. STU I badly need one, but it’s against Uber code of conduct. VIC Don’t get hammered. Just have one to calm your nerves. It’s fine. Stu nods, then beelines to the bar where he throws down a flute of Champagne like it’s a shot. It spills sloppily down his shirt. NICOLE (O.S.) Thirsty? He turns to see Nicole. Her eyes. Her neckline. Her cool tats. He’s at a loss for words, but he’s clearly smitten. NICOLE (CONT’D) I should get drunk, too. Everyone here’s high on their own bullshit. 63. She snags a Champagne. Hands one to Stu as well: NICOLE (CONT’D) Chug one with me? VIC (O.S.) I’ve got him on a one-drink limit. She turns, surprised to see Vic. NICOLE Dad? STU (taken aback)  Dad?  NICOLE I-- I can’t believe-- You’re here. You actually came! Her eyes are so full of hope and love. She gives him a hug. Vic takes a beat, trying to choose the right words. Then-- VIC I gotta take a shit. STU VIC! Jesus. Vic turns to Nicole and tries again. VIC Your sculptures--from what I can see--are very good, honey. I’ll pick one out for my apartment. NICOLE They’re kind of expensive. VIC Maybe they’ll cut me a family discount. I know the artist. He winks. It’s the closest he’ll ever get to charming. NICOLE Go... do your business, Dad. He nods, badly needing that shit. Takes off. STU I’m Stu. 64. She shakes his hand, intrigued. NICOLE Don’t be offended, but I find it hard to believe my Dad would be friends with-- STU A black guy? NIC",
      "dialogue_count": 0,
      "word_count": 1242
    },
    {
      "scene_number": 9,
      "slugline": "INT. ART GALLERY - ABBOT KINNEY - CONTINUOUS We resume Stu/Nicole: NICOLE So we get out to the desert and he’s like “ Hey Nicole, I gotta run into town and get some groceries .” STU No! NO! He did NOT leave you in the desert! NICOLE I saw it coming a mile away. He talked my ear off all day about how the desert toughened him up. STU So what’d you do? NICOLE I had already pick-pocketed his car keys. So he gave me the “grocery” line and went to start his car. (beat) Then I watched for two hours as he scoured the desert sand, looking for his keys, getting a sunburn, screaming obscenities. It was magical. Stu laughs, loving it. STU You actually broke him! NICOLE We camped out that night. Made a fire. Told ghost stories. He was actually kind of fun to be around. STU What happened to him? NICOLE He’s always been a little... jagged. It got way worse last year when he lost his partner. STU (recalling) Rodriguez? 69.",
      "characters": [],
      "action_text": "She nods. NICOLE She was the daughter he wished he had. STU I’m sure that’s not true. NICOLE Whatever. You can’t pick your family, right? REVEAL: Vic, standing behind them, eavesdropping. Pipes up: VIC Hey, honey. I need to borrow your house key. NICOLE My house key? VIC Yeah, I need to get into my, ya know, storage. Nicole looks at him quizzically, realizing: NICOLE Wait... Is that why you’re here? VIC Well, I didn’t have time to go all the way back up to Van Nuys. NICOLE You’re a fucking prick. She storms off. He yells after. VIC Honey! Wait! (she turns back) The key? Stu shakes his head. Nicole FLINGS THE KEY at her Dad. EXT. VENICE WALK-STREET - NIGHT The full, yellow moon highlights the narrow walking path as Stu and Vic head towards Nicole’s duplex. 70. STU Do you want to talk about it? VIC No. STU By   it   I mean your relationship with Nicole? VIC No. They keep walking. Stu can’t resist. STU Do you know what John Legend says about unconditional love? VIC Oh Jesus Christ... STU You don’t get to just keep pissing someone off. Eventually they wise up and stay away. You can’t put these walls up around you forever. VIC I’ll keep that in mind. STU Your daughter is incredible, man. And so talented. And beautiful. (realizing) And sexy. Vic grabs Stu and PINS HIM against a light post. VIC First off, my daughter would break you in half, so take the next train out of fantasy land. (then) Secondly, when I want advice from the Uber-driving Webelos Scout, I’ll let you know. Okay, Steve? STU IT’S STU! STU! MY NAME IS STU! Stu PUSHES VIC away. The bravest thing he’s ever done. 71. STU (CONT’D) You know what? I hope Nicole wises up. I hope she stays away from you. She deserves better. VIC (sighs) Tell me something I don’t know. They stand there for a beat. Silence. Vic looks around at a nearby address. Can’t quite make it out. VIC (CONT’D) Is this 117? STU No. 113. Vic continues down the path. Stu follows. INT. NICOLE’S DUPLEX - NIGHT Cool, funky little place. Stu’s sifting ",
      "dialogue_count": 0,
      "word_count": 2143
    },
    {
      "scene_number": 10,
      "slugline": "EXT. WATSEKA SALVAGE YARD - HILLTOP - NIGHT Rain drizzles down as Vic and Stu quietly exit the car. Vic hands Stu a pair of binoculars. VIC Tell me what you see. Stu takes a moment to scan the area below. STU Um. Looks like three cars. VIC Three cars? What kind? What are they doing? STU Just sitting there. Three black Lexuses. Lexi? Lexuses? No. Lexi. VIC (sighs) How many men? What ethnicity? STU Hard to tell. They’re all inside the cars. Six maybe? Vic snags the binoculars and looks for himself. VIC’S POV: a blurry binocular shot that just makes out the silhouettes of the three SUVs. VIC Must be the buyers. They’re waiting for Santos. What time you got? STU (checking his phone) 11:52. VIC You should get out of here. Things are gonna get hairy soon. STU I thought you said it’s unsafe to go home. VIC Cavalry will be here any moment. Santos is toast. You’re safe now. 82.",
      "characters": [],
      "action_text": "Stu nods, looks at Vic. Hard to believe this is goodbye. STU Should we, um? Stu extends his arms for a hug. VIC What are you doing? STU I’m just, uh-- He inches forward with his open arms. VIC Stop that. STU After everything we’ve been through, I think we’ve earned the right to hug. Vic looks Stu over, then... extends a handshake. VIC Thanks for driving. Stu nods, accepts the handshake. Then heads to his car. INT. STU’S LEAF - NIGHT Stu pushes the ignition, silently motors away, watching as Vic grows smaller and smaller in the rearview mirror. BIRD SQUAWKING RINGTONE. Stu takes a deep breath. Pulls off to the side of the road and answers. BECCA (O.S.) You’re still driving? Babe... I hate to be that girl, but you missed another check-in. STU (not sorry) Yeah, well, it’s been a weird night so I guess you can’t win ‘em all. BECCA (O.S.) What’s that supposed to mean? 83. STU I don’t know. Nothing. BECCA (O.S.) I made a Genius Bar appointment for you in the morning. See if they can troubleshoot your Find my iPhone. STU You’re not serious. BECCA (O.S.) Um. Yeah. Thank me later. STU Babe... I don’t want you to   Find my iPhone . I turned that feature off intentionally. BECCA (O.S.) You did? Why? STU Remember when we first started dating? How cool it was? Easy. And then we had our big D-T-R talk and suddenly we were tethered to each other like those poor kids you see at Six Flags on a leash with their parents. BECCA (O.S.) Six flags? Stu, what are you talking about? STU Do you know why I took this job Ubering assholes around? Because I wanted to be able to buy you a 1.7 carat diamond engagement ring. BECCA (O.S.) STU-BEAR!!!! OHMYGOD! HOLYSHIT! AND 1.7?!?! THAT’S BIGGER THAN ABBIE’S RING! FUCK YOU, ABBIE! FUCK YOU! She keeps screaming, laughing, hysterically happy. STU No. Babe. Stop. Becca. STOP! STOP! (off her silence) Yes, I took this job because I intended on buying you that ring. (MORE) 84. (beat) But my intentions have changed. BECCA (O.S.) Changed? How? If you want t",
      "dialogue_count": 0,
      "word_count": 2109
    },
    {
      "scene_number": 11,
      "slugline": "INT. BLACK ESCALADE - NIGHT Squeezed between two goons we find Vic and Stu wearing BLACK HOODS over their heads. VIC Thanks for nothing. STU How is this my fault? VIC I just   had   to call for back-up. STU Oh yeah! Of course! ‘Cause I knew your captain was crooked. God damn, you’re an asshole. The Goon in shotgun turns around: SANTOS’ GOON  Cállate!   Cállate pendejos!  For good measure he rams the BUTT OF HIS AK into their guts. They both double over, gasping for air. INT. CONCRETE ROOM - UNKNOWN We find Vic, hood off, tied to a chair being BEATEN MERCILESSLY by a jacked Colombian. Blood streams from his nose, his ear, his mouth, down onto his shirt. Santos calmly sips espresso a few feet away. SANTOS I’m getting tired of this game, Mr. Manning. VIC It’s   Detective   Manning, you ignorant piece of shit. She rolls her eyes, unimpressed. VIC (CONT’D) Just shoot me already. SANTOS If I shoot you, then I won’t know what you know about my little operation. 93.",
      "characters": [],
      "action_text": "She nods to her Goon who grabs a WHIP and starts WORKING VIC’S NECK AND BACK. CLOSE ON: Vic’s face, not giving Santos the satisfaction of moaning or wincing with each strike. SANTOS (CONT’D) If you won’t talk, your partner will. INT. STU’S CONCRETE ROOM - UNKNOWN Identical situation. Stu’s tied up to a chair. All alone. Santos enters. Stu’s eyes are completely full of fear. SANTOS Detective Manning thinks he’s a real man. He doesn’t want to talk. Santos approaches Stu but doesn’t touch him. She DRAGS HIS CHAIR over to the side of the room. Rips off an air vent, allowing Stu to-- WATCH VIC NEXT DOOR getting the shit beaten out of him. SANTOS (CONT’D) You care about him... Don’t you? Stu doesn’t respond. The anguish on his face says it all. SANTOS (CONT’D) Tell me what you know about my business, or I’ll execute your partner and make you watch. STU  My partner ?? Do I look like a cop to you? SANTOS I don’t know. What’s a cop look like? STU Not like me! I drive strangers around for 13 bucks an hour! Plus tips! If I’m lucky! SANTOS You’re lying, Detective Morris. 94. STU  Detective Morris?   I barely made it through Webelos! I was like a half- step above Ryan Lazzaro and that kid couldn’t even pitch a tent. Please don’t hurt me! Please! Stu’s on the verge of tears and she hasn’t even laid a finger on him yet. Santos squats down to his level. SANTOS Tell me what you know and I will make this as peaceful as possible. STU I don’t know what you want... Santos drags Stu back over to a table. She pulls out a pen and paper, sets it in front of him. SANTOS I want a list of names. Every cop in your department who knows the details of my operation. STU I told you, I’m not in a depart-- SMACK! She SLAPS THE FUCK OUT OF STU’S FACE. She fingers the blood in the corner of his mouth and tastes it. A creepy power play. SANTOS I’ll give you ten minutes to jog your memory. Then you watch your partner die. She whips out a LARGE KNIFE. Stu cringes in fear as she-- CUTS THE ROPE, freeing hi",
      "dialogue_count": 0,
      "word_count": 3664
    }
  ]
}