{
  "slug": "sully-2016",
  "title": "sully",
  "genre": "drama",
  "format": "film",
  "scenes_count": 16,
  "characters_count": 4,
  "characters": [
    "LETTERMAN",
    "PATRICK",
    "CLOSE ON SULLY SULLY",
    "WARNING SYSTEM"
  ],
  "total_words": 20436,
  "total_dialogue": 6,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. HOTEL - ROOM - LATER 12   12 Silence.   Just the hum of a hotel room as Sully slowly dresses in his white shirt, (no epaulets), and black pants. Every motion he makes is precise, but a beat slow. And it is too quiet in here.   So he remotes on the TV. Every channel he checks is focused on the flight 1549 MIRACLE ON THE HUDSON. Shots of the PLANE IN THE WATER, PASSENGERS on the wings and in the emergency rafts. Ecstatic SURVIVORS hugging on the docks. Surviving passenger BARRY LEONARD, 50, handsome and amazed, is shivering with cold and joy while being interviewed by a TV reporter. BARRY (V.O.) (Southern accent) When I looked out the window and saw he was going to land us in the river... I thought... it’s over. What else could I think? Another channel.   Another interview. DIANE HIGGINS, 58, lovely and stunned, is in blissful shock. DIANE HIGGINS (V.O.) You think you’re going to die, that’s what you think.   And then... miraculously... you don’t. Channel change.   Back to Barry. BARRY (V.O.) (into camera) ... I guess I could only say thank you... thank you for saving my life. Sully watches the television and it feels like a show more than the news.   Is this his life? DIANE HIGGINS (V.O.) Thank you, Captain. (choking up) Thank you.   Thank...  SULLY - 11/18/15 (Full Blue)   5. (CONTINUED)",
      "characters": [],
      "action_text": "He smooths out the lines in his shirt, looks in the   * mirror.   But somehow can’t quite meet his own gaze. As we PUSH DEEP INTO Sully’s eyes, we hear... CHARLES PORTER (V.O.) (pre-lap) ... you.   Yes, thank you, Captain Sullenberger, for joining us today... INT. HOTEL - CONFERENCE ROOM - CONTINUOUS ACTION 13   13 Sully and Skiles are sitting in a halogen-bright room, with two glasses of water in front of them. Next to them is MIKE CLEARY, their union rep.   He’s 50s, black hair, intense bearing. Across the table from them are the 3 NTSB members. ELIZABETH DAVIS, late 40s, gentle face, BEN EDWARDS, 50s, a banker’s demeanor and focus, and CHARLES PORTER, mid- 40s, Marine-tough, who is beginning the session. CHARLES PORTER ... and welcome also to First Officer Skiles.   Glad you could make it in this morning. SKILES Not as glad as we are. Slight laughter. CHARLES PORTER For the record, we have an Aircraft Systems Team on this investigation, also Aircraft Structures, MRT, Aircraft Performance, ATC, Wildlife Factors, Survival Factors, and Emergency Response.   Today, we begin with our Operations and Human Performance investigation, of the crash of U.S. Air Flight 1549. SULLY Water landing. CHARLES PORTER Captain?  SULLY - 11/18/15 (Full Blue)   6. CONTINUED: 12   12 (CONTINUED) SULLY This was not a crash.   It was not a ditching.   We knew what we were executing.   A forced water landing. BEN EDWARDS Why didn’t you attempt to return to LaGuardia? SULLY There was simply not enough altitude.   The river was the only place long enough, wide enough, and smooth enough to even attempt to land the airplane safely. BEN EDWARDS Air Traffic testified that you stated you were returning to LaGuardia.   But you didn’t. SULLY As I began the left turn, I realized I couldn’t make it back. It would have ruled out all other options.   Returning would have been a mistake. CHARLES PORTER Let’s get into how you calculated all those parameters. SULLY There wasn’t time for calculating. I had",
      "dialogue_count": 0,
      "word_count": 2570
    },
    {
      "scene_number": 2,
      "slugline": "EXT. 5TH AVENUE - MINUTES LATER 27   27 The wind-whipped streets are empty and the closed storefronts and window displays make the street feel even emptier. The night is mean with cold and Sully and Skiles walk north on 5th Avenue, bundled up.   Words don’t come easy. SKILES You enjoying the shakes, the nightmares, and the rabbit heartbeat? SULLY A little bit. (beat) The union offered us counseling... SKILES What are they going to say?   You were in a plane crash.   And lived. It may have a minor impact on your day-to-day. SULLY I just... hate not being able to control this process.   I want myself back. SKILES I’m hoping that six months from now, we’ll just be laughing about how we got to meet David Letterman. SULLY We’re doing ‘Letterman’? SKILES Right after the NTSB interview.   * I’m guessing Dave will be funnier. SULLY It’s all so surreal.   I guess I’m just having a little trouble separating reality from... whatever the hell this is. SKILES This... is two men freezing their asses off.  SULLY - 11/18/15 (Full Blue)   18. (CONTINUED)",
      "characters": [],
      "action_text": "They laugh, the steam from their mouths like unspoken thoughts. SKILES Sully... don’t worry.   You did a great thing and it’s going to be remembered for a very long time. SULLY Funny thing is... I’ve delivered a million passengers, over 40 years in the air... and in the end I’ll be judged on 208 seconds. SKILES Come on.   Tomorrow’s going to be a good day.   Computer SIMS will prove you were right and we can all put our wings back on. SULLY You’re right.   You’re right.   All back to normal. EXTREME CLOSEUP - SULLY’S EYES The street lights reflecting, as we... MATCH DISSOLVE TO: ANOTHER EXTREME CLOSEUP - SULLY’S EYES 28   28 Lights still reflecting, but these are TV lights.   PULL BACK to reveal he is sitting across from... INT. HOTEL ROOM - DAY KATIE COURIC and her camera crew. SULLY ... it was obvious this was a critical situation... losing thrust in both engines, at a low altitude... over one of the most densely populated areas on the planet... KATIE COURIC But choosing to land on the Hudson... there was still a big if...  SULLY - 11/18/15 (Full Blue)   19. CONTINUED: 27   27 (CONTINUED) SULLY I was sure I could do it. KATIE COURIC You were? SULLY Yes. KATIE COURIC How do you feel about people calling you a hero? SULLY I don’t feel like a hero.   I was just a man doing his job. KATIE COURIC The right man for the job, at the right time.   You’ve been flying for nearly 40 years. SULLY 42.   It has been my life.   My whole life. Sully’s eyes spark bright for a moment as we -- ZOOM INTO them and COME BACK OUT THROUGH -- FLASHBACK - INT. BI-PLANE - DAY (APRIL 3, 1967) 29   29 Seeing all of Denison, Texas stretched out below him. Sixteen-year-old Sully sits in the front of this tandem two-seater prop plane. In the backseat is L.T. COOK, 50s, clean-shaven and gruff, but aware he’s witnessing the birth of a pilot. L.T. COOK Your aircraft. In the roar of the tiny cockpit, L.T. Cook circles the stick to signal it’s Sully’s plane, then takes his hands off the override contr",
      "dialogue_count": 0,
      "word_count": 791
    },
    {
      "scene_number": 3,
      "slugline": "INT. BI-PLANE - ANOTHER DAY 31   31 Sully flies alone, trying out new maneuvers.   Memorizing everything on the panels, constantly testing himself, improving.   He banks into the blue, and when he returns to level, we are... INT. BI-PLANE - ANOTHER DAY 32   32 And this time his Mother is on board.   PAULINE Sullenberger is 41 and attractive.   She’s also relaxed, hands calmly on her lap, as if out for a Sunday drive. SULLY Your stomach’s not queasy, Mom? MOTHER No. SULLY Not too noisy for you? MOTHER No, now let’s enjoy.   Just go low and slow. She reaches over and squeezes his shoulder. MOTHER You realize that if you’d studied piano like this, we’d be on our way to Carnegie Hall now. SULLY This is my piano, Mom. (pause) And I can still get us to Carnegie Hall. They laugh and she squeezes his hand, beyond proud. PUSH IN CLOSE ON Sully’s joy-filled face, not a drop of sweat despite the Texas heat... MATCH DISSOLVE TO: INT. HOTEL - DAY (PRESENT) 33   33 Sully’s face, now 57, and moist with sweat. The Katie Couric interview is over.   Lights get switched off, camera packed up.   Katie’s long gone, and --  SULLY - 11/18/15 (Full Blue)   22. (CONTINUED)",
      "characters": [],
      "action_text": "ALISON, cute, mid-20s, is removing the rest of Sully’s foundation, but he can’t stop sweating. SULLY Sorry about the perspiration. ALISON After what you did, I’d think that Katie couldn’t be too intimidating. SULLY Not Katie.   The lights and camera she brought with her. ALISON (beat) All done. Alison gets on tiptoes and kisses Sully’s cheek. ALISON That was from my mom.   Her name’s Brenda.   She says to say thank you, and she’s single. They laugh. SULLY Tell Brenda thanks, but I’ve got a girl at home. ALISON Lucky woman. Alison exits and... Sully is alone.   Waiting in this strange hotel room, amidst the silence of not knowing what is going to happen next... he feels like the last man on Earth. He stares out onto the streets of Midtown 30 floors below.   Reflected in the window, we see the city before him.   And then... A PLANE... plummeting towards the Manhattan skyline. SULLY’S POV As the jet descends relentlessly across the canyon of buildings, hidden by high-rises and then reappearing, like a ghost that won’t perish.  SULLY - 11/18/15 (Full Blue)   23. CONTINUED: 33   33 (CONTINUED) Half the left wing severs free as it slams a building, then the plane vanishes again, behind a wall of skyscrapers. BOOM.   The plane detonates out of view, fire and debris licking out and around, still visible... the explosion echoing through the streets. MAN (O.S.) Sully.   Sully... CLOSE ON SULLY still gazing out the window.   His eyes are vacant, his nightmare still shadowing him. But there is no reflection in the window. And outside, there is no plane in ruins.   No fire.   Just the city in motion.   * MAN (O.S.) Sully! Finally, Sully whiplashes back to find -- Mike Cleary, his union rep, standing by the door. CLEARY Sully, where are you? Sully looks out the window one last time.   Nothing. CLEARY I’m standing here, calling your name... what’s up with you? Sully keeps staring out.   Transfixed. CLEARY You need to get focused, because the media request avalanche continues.   La",
      "dialogue_count": 0,
      "word_count": 781
    },
    {
      "scene_number": 4,
      "slugline": "INT. CAR - CONTINUOUS ACTION SULLY Larry.   Nice to finally see a friendly face. The Town Car’s dark windows turn the media throng into a horde of silhouettes. LARRY Might be the last one you see today. SMASH CUT TO: INT. NTSB HEARING - LATER 35   35 The tension is high as Sully and Skiles sit across from the investigators.   Rooney is by their side for support. And -- Skiles is riled up. SKILES Isn’t it a little early in the year to go fishing? CHARLES PORTER Seeking the facts is hardly fishing, Mr. Skiles. SKILES Okay.   Then here is the most important fact.   There are only two people who know what happened in the cockpit that day, and I’m one of them. CHARLES PORTER And we appreciate your perspective... SKILES Why do you think we’re even here today?   It’s because Captain Sullenberger did not head back to LaGuardia. No response.  SULLY - 11/18/15 (Full Blue)   26. CONTINUED: 34   34 (CONTINUED)",
      "characters": [
        "LETTERMAN"
      ],
      "action_text": "SKILES Look, I just finished training on the A320, and I can tell you that the only reason the plane operated as well as it did, that the aircraft could land anywhere, is because Captain Sullenberger turned on the Auxiliary Power Unit. ELIZABETH DAVIS He was simply following the QRH... SKILES No.   He wasn’t following the proper procedure at all.   And I know, because I had the QRH in my hands. The board leans forward.   Interested. SKILES He switched on the APU immediately after engine roll back.   According to Airbus, that’s the fifteenth thing on the list to do. Fifteenth. Silence. SKILES If he’d followed the damn rules, we’d all be dead. (heating up) Maybe that’s the part you don’t like.   You’re not used to having answers to your guesses. SULLY (smoothing) Look, what Jeff is saying is that I know the A320.   What it does and doesn’t do.   I’ve read countless CVR transcripts of deceased pilots and I have significant accident investigation experience. CHARLES PORTER There is no question that you are an experienced, dedicated, talented professional.  SULLY - 11/18/15 (Full Blue)   27. CONTINUED: 35   35 (CONTINUED) BEN EDWARDS But all the flights you piloted before January 15th and every crash you investigated are not the purview of this investigation. Only U.S. Airways 1549 matters today. The room takes a breath. ELIZABETH DAVIS Your union has been advised... ACARS data relayed that the left engine continued to turn throughout the flight. SULLY Then the data would be wrong. ELIZABETH DAVIS The evidence shows the left engine was at idle or sub-idle immediately following the bird strike. SULLY (punched) Show me the left engine and it’ll be dead geese and no power. ELIZABETH DAVIS The left engine was lost in the crash, due to the extensive damage on touchdown, but we’ll circle back to that.   Let’s assume it was, as you say, a dual engine loss due to bird strike... CHARLES PORTER Your weight was 151,510 lbs.   Wind and temperature, N-NW, 21 degrees. Speed and altitu",
      "dialogue_count": 1,
      "word_count": 2267
    },
    {
      "scene_number": 5,
      "slugline": "INT. AIRPORT TERMINAL - SAME TIME 40   40 Three MEN in a hurry, racing toward a gate. ROB KOLODJAY, 60, handsome and rumpled in equal measure, tries to keep pace with the hurrying -- JEFF KOLODJAY, his son.   Jeff is 31 and young De Niro good-looking.   Keeping stride with Jeff is -- JIMMY STEFANIK, 27, a cousin, with close-cropped hair and a worried face. ROB Jeff, we’re not going to make it. JEFF Been waiting a year for this trip, Dad.   I am not missing this flight. (beat) We’ll meet you at the gate. Jeff and Jimmy take off into a full run. Rob slows, catches his breath. INT. GATE 21 - MOMENTS LATER 41   41 Jeff and Jimmy slalom through a final clutch of people and reach the gate for Flight 1549.   No line. Just an extremely pretty gate attendant, name tag “EMILY.”   She is 38 and focused on her paperwork. JIMMY Spirit sent us.   We got canceled and they said we were rerouted. That you guys had seats. Emily doesn’t look up. EMILY Flight is closed. JEFF Wait.   Wait.   See the old guy, just limping up?   That’s my dad. He needs to be on this flight. It’s an emergency. EMILY (dubious) What kind of emergency?  SULLY - 11/18/15 (Full Blue)   39. (CONTINUED)",
      "characters": [],
      "action_text": "JEFF A golf emergency. Emily cannot suppress a grin. EMILY I.D.s, please.   How many people are traveling? JEFF Three.   And thank you... EMILY Nothing together. JEFF Hell.   I’ll fly on the wing. Rob finally reaches the gate, a little winded. ROB Canceled, right?   Ought to be. EMILY Here we go. (extending boarding passes) 22A, 6A, and 6C. INT. COCKPIT - CONTINUOUS ACTION 42   42 SKILES I Googled you last night.   Read all about your company on your website.   Impressive. SULLY Thanks. SKILES Man, I thought I was a good bullshitter, but you could go pro. SULLY Hey. SKILES I’m only teasing.   But the site does make your air safety consulting business sound like you’ve got about 100 employees and headquarters in three states.   But then, when I dug deeper, I realized... it’s only you.  SULLY - 11/18/15 (Full Blue)   40. CONTINUED: 41   41 (CONTINUED) SULLY Go easy, I’m just getting it going. (beat) Not usually accused of being a bullshitter. SKILES Don’t take it wrong.   Actually a compliment.   Off that website... I’d hire you. INT. PLANE - MOMENTS LATER 43   43 Sheila is preparing to close the main cabin door when -- Rob, Jeff, and Jimmy appear, just slip on.   They walk down the aisle, squeezing by people jamming OVERSIZED BAGS into the overhead bins. Jeff starts heading further down the aisle. ROB Where you headed?   Jeff, we’re here in 6. JEFF That’s all Jimmy.   I was up ‘til three.   I need to sleep. ROB You can sleep here. JEFF Not with you verbally walking the course the whole flight.   ‘Think I’ll go... with the nine iron on the 7th.’   No.   No.   Good night... As Jeff walks deeper into the cabin, he passes PASSENGER   * WITH BABY, 33, a lovely mother sitting alone with her   * eight-month-old, DAMIAN.   The baby rifles through the seat-back magazines and safety instructions like he’s looking for treasure. Sitting at the window by the woman is JIM WHITAKER, gentle, 46, and busy scooping up what Damian is tossing. PASSENGER WITH BABY   * I’m sorry.   He lik",
      "dialogue_count": 0,
      "word_count": 751
    },
    {
      "scene_number": 6,
      "slugline": "INT. PLANE - SAME TIME 46   46 The flight attendants do final checks, buckle in, and then they feel the plane -- Halt on the tarmac. Donna checks her watch as Sheila joins her in the galley. SHEILA Just once, I’d like to get out of   * LaGuardia on time. DONNA Sheila, you know there’s only one   * way to depart LaGuardia on time.   * SHEILA What’s that?   * DONNA Fly out of JFK.   * They laugh. INT. COCKPIT - CONTINUOUS ACTION 47   47 SKILES Takeoff min. fuel quantity, verify.   19,000 pounds required, we got 21.8 onboard. SULLY 19,000 pounds required, 21.8 onboard. TOWER RADIO (V.O.) Cactus 1549, runway four, clear for takeoff. SULLY Cactus 1549, cleared for takeoff. Skiles picks up speed as they begin down the runway. SKILES TOGA. SULLY TOGA set. They build acceleration...  SULLY - 11/18/15 (Full Blue)   43. (CONTINUED)",
      "characters": [],
      "action_text": "SULLY 80. SKILES Checked. SULLY V one, rotate. They liftoff and start to climb. SULLY Positive rate. SKILES Gear up, please. SULLY Gear up. Sully unclips his shoulder harness, as is his ritual, and slips out of it for comfort during the flight. It could not be more beautiful.   Up above the weather, the sky is stunning.   Sunlight reflects off the Hudson like a million spilled diamonds. This is the glory of flying. SULLY What a view of the Hudson. (beat) I will never get over how beautiful it is up here. SKILES Life’s easier in the air. SULLY Yes.   It.   Is. Skiles guides the plane higher.   The splendor of the New York skyline appears off in the distance.   A moment of quiet wonder. Until a sudden black curtain of GEESE covers the windshield and darkens their view up ahead. SULLY Birds! SKILES Oh, shit!  SULLY - 11/18/15 (Full Blue)   44. CONTINUED: 47   47",
      "dialogue_count": 0,
      "word_count": 299
    },
    {
      "scene_number": 7,
      "slugline": "INT. ENGINES - CONTINUOUS ACTION 48   48 Geese from the flock get SUCKED INTO each engine. Blood.   Shredded bone and metal.   Both engines cough and bang to a -- STOP. FIRE rages in the right engine well.   Useless. INT. COCKPIT - CONTINUOUS ACTION 49   49 The alarm begins to chime.   Banging and ringing every 5.7 seconds. Sully is Wyatt Earp CALM amidst the madness of the alarms. SULLY We got one roll... both of ‘em rolling back.   Ignition start. (beat) I’m starting the APU. He turns on the AUXILIARY POWER UNIT. The engines are toast, but the plane’s flight controls can now continue to work.   He’s bought them a sliver of time. SULLY My aircraft. Sully takes over flying the plane, despite feeling the narrowing of his VISION and the spiking of his PULSE.   He forces himself to concentrate. SKILES Your aircraft. SULLY Get the QRH.   Loss of thrust on both engines. INT. AIR TRAFFIC CONTROL - SAME TIME 50   50 The room is filled with CONTROLLERS and SUPERVISORS behind their consoles.   Another day of focus and details.  SULLY - 11/18/15 (Full Blue)   45. (CONTINUED)",
      "characters": [
        "PATRICK",
        "CLOSE ON SULLY SULLY"
      ],
      "action_text": "ANGLE ON PATRICK HARTEN   * SULLY (V.O.) (into radio) Mayday, Mayday, Mayday.   This is Cactus 1549.   Hit birds. 34-year-old, stocky, handsome, thick New York accent.   * Patrick, the ACT, hasn’t heart Sully’s Mayday.   * He has keyed his microphone and is talking to another   * departing aircraft in his charge, oblivious to the   * danger.   * PATRICK   * (relaxed)   * Maintain one-five thousand, Delta.   * Patrick releases his mic, sips his coffee in time to   * finally hear.   * SULLY We’ve lost thrust on both engines. We’re turning back towards LaGuardia. Patrick jumps on the emergency immediately. PATRICK Okay, Cactus 1549, turn left heading two-two-zero. (beat) Which engine did you lose? SULLY (V.O.) Both.   Both engines. Patrick goes off radio and shouts to his SUPERVISOR, 54, thin, vigilant, two consoles away. PATRICK Supe, I have an emergency. Supervisor hustles to Patrick’s console.   Plugs his headset into the console above Patrick’s. SUPERVISOR What’s the report? PATRICK Both engines. SUPERVISOR What?  SULLY - 11/18/15 (Full Blue)   46. CONTINUED: 50   50 (CONTINUED) PATRICK Both engines gone.   No thrust. SUPERVISOR (receiving info over headset) LaGuardia says bring him around to one-three. PATRICK (into radio) Cactus 1549, if we can get it for   * you, do you want to try runway one- three? INT. COCKPIT - SAME TIME 51   51 ALARMS are chattering at Sully.   Ringing.   Warning. The plane is dropping.   Two stories per second.   But he remains steadfast. SULLY (realizing) Unable.   We may end up in the Hudson. INT. AIR TRAFFIC CONTROL - SAME TIME 52   52 Patrick works the touch screen to carve out a path to Teterboro.   Supervisor is on the phone calling for rescue support from the Coast Guard, police helicopters, any and everyone.   Patrick demands the rest of the controllers’ attention. PATRICK I’ve got an A320 diving for the   * river. Patrick turns to his colleague, Al, at the next console. PATRICK Al, stack all the inbounds to LaGuardia. SULLY (V.O.)",
      "dialogue_count": 2,
      "word_count": 3214
    },
    {
      "scene_number": 8,
      "slugline": "INT. APARTMENT - SAME TIME 77   77 One ELDERLY MAN, in his 80s, uses his cane to get to the window.   Compassion and hope and fear crowd his heart. EXT. BUILDINGS/STREET (MANHATTAN) - SAME TIME 78   78 In a city tuned to the fear of planes crashing... countless windows begin to fill with APARTMENT DWELLERS... magneted by the -- SIGHT of Flight 1549 so close to the riverfront.   They fishbowl to the glass in building after building. EXT.   THOMAS JEFFERSON   FERRY (HUDSON) - SAME TIME 79   79 Gaggero and the   Thomas Jefferson   are 50 yards from the   * dock when he hears an enormous NOISE overhead.   All look up. A plane plummeting toward the Hudson. GAGGERO   * ... all hands on deck, this is a Mayday! He throws the ferry into full impulse and hurtles forward. GAGGERO   * This is Victor Gaggero of the   *  Thomas Jefferson .   We have a... plane... EXTREME CLOSEUP - GAGGERO’S EYES   * as they go wide with astonishment.   The REFLECTION and the sound of impact tells the story just as the plane hits the Hudson. INT. CABIN - CONTINUOUS ACTION 80   80 The plane hits the water. The passengers react as the plane jerks to a halt. A passenger in the last row dares to open the window blind.   Water is already halfway up.   Fish in a fishbowl. Surreal. People begin to vacate their seats.  SULLY - 11/18/15 (Full Blue)   61.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 238
    },
    {
      "scene_number": 9,
      "slugline": "INT. COCKPIT/CABIN - SAME TIME 81   81 Sully bangs OPEN the cockpit door, looks out at the stunned passengers. SULLY Evacuate! Barry Leonard is first by the emergency door as it opens. He looks out onto the freezing river. EXT. PLANE - FRONT LEFT DOOR - SAME TIME 82   82 The life raft has not deployed.   Barry is the only one who can see its useless shape, adhered to the plane. DONNA (O.S.) Jump.   Jump! Barry takes off his shoes.   And obeys.   He jumps directly into the frigid water. EXT. PLANE (WATER) - CONTINUOUS ACTION 83   83 Barry sinks several feet below the surface.   For a moment, it seems this will be his ending place.   And then he -- Rises. At the surface, in shock... he begins to swim. But AWAY from the plane... with half a mile between him and the coast.   Madness. INT. BACK OF PLANE - CONTINUOUS ACTION 84   84 Icy river water FLOODS into the plane through a gaping hole in the floor. Doreen has BLOOD POURING from a leg wound, but she’s still shouting instructions to passengers. DOREEN The aft exits are unusable! Everyone forward to the overwing exits.   Don life vests, now! INT. ROW 22 - CONTINUOUS ACTION 85   85 Jeff is soaked and shivering, water to his knees already.  SULLY - 11/18/15 (Full Blue)   62.",
      "characters": [],
      "action_text": "INT. ROW 6 86   86 In row 6, Rob is screaming towards the back of the plane. ROB Jeff!   Jeffrey! The chaos blocks any visual contact. Jimmy dons a life vest and grabs one for his distraught uncle. JIMMY Put this on.   Uncle Robbie. ROB Can you see Jeff?!   We have to get him. Rob pushes into the aisle, tries to make it back towards Jeff.   But the rush of people coming at him make passage impossible. Too many bodies, and Rob winds up pushed back into row 6. INT. ROW 17 87   87 In row 17, Diane is unbuckling Lucille’s seat belt. Lucille tries to stop her. LUCILLE Diane.   You have to go. DIANE HIGGINS I’m not leaving... LUCILLE Please go.   I’ll only trap you here. DIANE HIGGINS Mom.   I won’t leave you. LUCILLE You have to. Their connection goes deeper than ten thousand words. Diane takes her mother’s face in her hands.   After a long moment... DIANE HIGGINS (to the plane) Help!   My mother needs help!  SULLY - 11/18/15 (Full Blue)   63.",
      "dialogue_count": 0,
      "word_count": 397
    },
    {
      "scene_number": 10,
      "slugline": "INT. CABIN - FORWARD AISLE - ANGLE ON SULLY AND SKILES 88   88 as they march through the morass of confused passengers. SULLY Come forward!   Grab life vests! Sully and Skiles rip free the left behind LIFE VESTS, hand them out as they walk the cabin. SULLY Going to be bitter out there. Sully and Skiles hand out blankets and coats to every departing passenger. SULLY Everyone take a blanket.   Pass them along! The freezing water rises.   It’s at their knees.   Now at their waists.   Relentless. The heavy plane is inhaling water and -- SINKING. And still, some passengers are popping open the overhead bins, trying to take their luggage with them. Skiles slams an overhead shut. SKILES Evacuate.   Now. EXT. SIGHTSEEING HELICOPTER - AERIAL SHOT - CONTINUOUS 89   89 ACTION REVEALS the crippled, drowning plane, lonely in the river.   Then at the EDGES OF THE FRAME, a cavalcade of -- FERRY BOATS and first responders begin to close the gap. ANGLE ON THE WINGS slowly taking on SURVIVORS, hanging on for desperate life. Not enough room.  SULLY - 11/18/15 (Full Blue)   64.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 184
    },
    {
      "scene_number": 11,
      "slugline": "EXT. LEFT WING - CONTINUOUS ACTION 90   90 Rob and Jimmy squeeze out onto the wing.   Followed by others.   The center cannot hold. ROB (overwhelmed) Jimmy.   Jeff’s still in the plane. Rob makes a sudden move, heads back toward the plane.   He tries to step over escaping passengers, but the wing is icy, the water too close, everyone coming towards him in waves. Jimmy finally gets a good grip and Rob fights against it. ROB We’re not... leaving him in there! JIMMY Crew will grab him, Robbie. Rob sees there is no way back for him.   But he can’t accept it.   His heart hammers with the darkest of fears. Other passengers cry out.   Fear passing between them. Hypothermia climbing from toes to torso like a virus. And every new passenger on the wing... makes the plane -- SINK DEEPER into the river.   Which will it be first? Drowning or freezing to death? EXT. FERRY DOCKS - SAME TIME 91   91 CBS reporter RANDALL PINKSTON is live from the docks as the rescue unfolds. PINKSTON With a water temperature of 36 degrees and wind chill of -5, the surviving passengers of Flight 1549 literally... have minutes to live. EXT. HUDSON - ANGLE ON BARRY LEONARD 92   92 ... he has swam 30 yards toward New Jersey.   Stops, breathless.   Knows he will never make it.   Both the coast and the wreckage seem too far a swim.   The water owns him.  SULLY - 11/18/15 (Full Blue)   65.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 245
    },
    {
      "scene_number": 12,
      "slugline": "INT. CABIN - ROW 17 - SAME TIME 93   93 Donna Dent is shouting/waving to the last remaining MALE PASSENGERS for assistance.   And one of them makes it back to the 17th row.   And scoops up -- Lucille Palmer into his arms.   Diane trails behind as they all make their way to the exit. EXT. FRONT RIGHT RAFT - CONTINUOUS ACTION 94   94 They reach the exit and Lucille is carried with the greatest of care into one of the life rafts.   All make room for her and Diane slides in beside her.   She holds her mother as if she were a tiny child. DIANE HIGGINS I won’t leave you. EXT.   THOMAS JEFFERSON   FERRY - CONTINUOUS ACTION 95   95 Gaggero is barking commands to the commuters, mobilizing   * them to assist in the rescue.   And they are responding. United. GAGGERO   * Oxygen’s in the medical closet! Blankets, aft storage.   Life vests in the lockers.   Gonna need everybody! (to ship) Come on, you sonofabitch, go! He hits the chop head on.   20 knots, the ferry maxed out, knocked sideways. Ferry passengers hang on like pirates in pursuit, the whole of them ready to help. EXT. LEFT WING - CONTINUOUS ACTION 96   96 SHAE CHILDERS, 38, frightened, exits onto the wing.   She looks to the closest LIFE RAFT.   But it is overturned and sinking.   She sees a slick of jet fuel in the river... panics... DIVES in, swimming, gulping, trying to get away from the plane.  SULLY - 11/18/15 (Full Blue)   66.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 251
    },
    {
      "scene_number": 13,
      "slugline": "EXT. NYPD AIR/SEA RESCUE HELICOPTER - SAME TIME 97   97 The NYPD AIR/SEA RESCUE HELICOPTER flies toward the Hudson. EXT.   THOMAS JEFFERSON   FERRY/RIGHT WING - CONTINUOUS 98   98 ACTION The   Jefferson   is the first to arrive at the scene. Gaggero tosses a ROPE into the right-side wing and the   * rescue is on. EXT. FRONT LEFT RAFT - CONTINUOUS ACTION 99   99 Barry Leonard finishing his swim back to the left raft, shivering with shock and confusion.   Passengers pull the nearly-dead Barry into the raft.   They huddle around him for warmth.   Giving up their own clothes to warm him. EXT. LEFT SIDE (WATER) - CONTINUOUS ACTION 100   100 Passengers shout out for Shae to return to the wing, but she has seized up with cold and fatigue.   She is barely moving, her head dipping below the water’s surface, water rushing into her gaping mouth.   Her seat cushion floats away. Drowning. EXT. DOCKS - SAME TIME 101   101 NY1’s BOBBY CUZA films a report, surrounded by a cavalcade of first responders.   Police.   Firemen.   EMT. Awaiting the survivors. CUZA Whoever has miraculously survived this plummet from the skies into the icy Hudson has about three hundred of New York’s finest ready to help them.   The only question remaining is, will it be too late. EXT.   MOIRA SMITH /LEFT SIDE OF PLANE - CONTINUOUS ACTION 102   102 The bow of the   Moira Smith   drifts INTO VIEW and there, just bobbing for life is -- Shae Childers.  SULLY - 11/18/15 (Full Blue)   67. (CONTINUED)",
      "characters": [],
      "action_text": "We WIDEN to reveal the stern of the   Moira Smith   swinging toward the front left raft.   It stops just before crushing the raft and its survivors against the sinking plane. INT. CABIN - ANGLE ON SULLY - CONTINUOUS ACTION 103   103 Sully, Skiles and a few remaining male passengers stand abreast of the exit and pass out blankets, life vests, spare coats.   Anything to stem the cold and keep people alive.   Sully grabs the plane’s emergency location transmitter and hands it to someone in the front left raft. Finally, with nothing left to hand out and every other person on a wing or in a raft... Sully walks down the aisle searching for passengers. SULLY Is anyone else here?!   Come forward.   Come forward! Water up to his waist, teeth chattering, he wades back of the front of the plane. EXT. NYPD AIR/SEA RESCUE HELICOPTER - SAME TIME 104   104 The NYPD AIR/SEA RESCUE HELICOPTER arrives overhead, rippling the water and scanning the entire tableau. EXT.   MOIRA SMITH   FERRY - CONTINUOUS ACTION 105   105 With her all strength gone, Shae somehow reaches out and catches the rope ladder attached to the bow of the ferry. But holding on is all she can do. She sobs.   She prays. DECKHANDS shout down at her, encouraging her to climb. But her extremities are frozen.   And she cannot move an inch. SHAE The boat... is going to pull me under.   I have to let go. DECKHAND ALFONSO   * No!   Hang on, ma’am, I can climb down to you.  SULLY - 11/18/15 (Full Blue)   68. CONTINUED: 102   102 (CONTINUED) DECKHAND CARLO ALFONSO, limber and fierce, scampers down   * the rope ladder, reaches for Shae’s hand. But she won’t let go of the rope.   Too afraid.   Too cold. SHAE I can’t... The ferry drifts closer to the left wing. And the wing gets closer and closer, the tip just missing Shae’s back. JOE HART, a Flight 1549 passenger, leaps off the wing and onto to the rope ladder. He desperately tries to pull her up.   But she is paralyzed by fear and cold. SHAE I have to go.   Please, let me go. ",
      "dialogue_count": 0,
      "word_count": 915
    },
    {
      "scene_number": 14,
      "slugline": "INT. COCKPIT - CONTINUOUS ACTION 109   109 Sully grabs the metal AIRCRAFT MAINTENANCE LOGBOOK.   He snares his overcoat and takes a final look around.   The instrument panel is completely dead. EXT. FRONT LEFT DOOR - SULLY’S POV - CONTINUOUS ACTION 110   110 As he steps OUT of the left forward entry door.   Nearly an entire plane-load of people on the slippery wings. The rest in emergency life rafts.   But the river is deathly cold.   And -- RISING. ANOTHER ANGLE Sully, last man out, squeezes onto one of the life rafts next to Skiles. EXT.   THOMAS JEFFERSON   FERRY - CONTINUOUS ACTION 111   111 The deckhands use the Jason’s Cradle to rescue Lucille. EXT. FRONT LEFT RAFT - CONTINUOUS ACTION 112   112 Sully is rapidly scanning the wings, rafts, everything, his lips moving in a silent count. EXT.   ATHENA   FERRY/RAFT - CONTINUOUS ACTION 113   113 The last passengers are being plucked from the rafts, including Barry. Deckhands FRANCO SANTINI, gray-haired, linebacker strong,   * and BRIAN KELLY, 28, laser focus, cover him in blankets   * as he reaches the deck. SANTINI   * We gotta warm him up.   Get him a blanket.   Fast! Kelly wraps him in a blanket.   * BARRY I can’t... this isn’t... He grows increasingly distraught.  SULLY - 11/18/15 (Full Blue)   71. (CONTINUED)",
      "characters": [],
      "action_text": "KELLY   * It’s okay.   You’re good now, sir. Kelly takes off his coat and hat and puts them on Barry,   * to still his quivering, but he can’t stop shaking. KELLY   * Safe home. BARRY It was supposed to be me... it was supposed to be me... it was... SANTINI   * Calm down, sir. BARRY I was sure I was going to die. Santini embraces Barry, pulls him close.   Looks him in   * the eye. SANTINI   * Hey.   No one dies today. ANGLE ON SULLY who is still counting.   Scanning the boats, the rafts, as the final passengers from this raft climb up to safety. He relieves Skiles of the rope connecting them to the  Athena   ferry, sends him up the ladder. Sully is alone in the raft, trying to hold it close to the ferry, but his frozen hands refuse to function.   He’s drifting away from the rescuers’ reach. SKILES (from the ferry) Sully!   Wrap it around your arms! Sully barely manages to twist the rope around his frozen arms and pull himself slowly back toward the ferry. SKILES Climb out now! Sully reaches toward the ferry ladder.   Has to -- HOOK HIS ELBOWS around the rungs and, rung-by-rung, haul himself up toward the ferry deck.   The last three rungs he’s --  SULLY - 11/18/15 (Full Blue)   72. CONTINUED: 113   113 (CONTINUED) PULLED UP by deckhands and Skiles.   They immediately try to throw a blanket around him, but he pushes through. Still carrying the metal aircraft maintenance logbook. While others celebrate and weep, Sully soldiers on, pinpoint focus.   Still counting. But he’s so surrounded by “thank you”s and embraces he can’t keep track. ANOTHER ANGLE ON SULLY ... he goes to a railing, trying to count passengers on the other ferries, even as they dock further down the pier.   Impossible.   Looks out at the plane, listing and sinking. Then in front of him, on the river... PERSONAL ITEMS begin floating by.   Purses, souvenirs, I LOVE NEW YORK bags. The two SNOW GLOBES OF NYC Lucille bought, bobbing in the choppy water.   The Statue of Liberty ringed in fake snow, floating",
      "dialogue_count": 0,
      "word_count": 1565
    },
    {
      "scene_number": 15,
      "slugline": "INT. AIR TRAFFIC CONTROL OFFICE - SAME TIME 118   118 Patrick, the ATC guy in charge of 1549, sits in this windowless room, head in his hands.   He looks like he’s had the longest hour of his life.   Tears still pool in his eyes. The door opens and a ATC #1 pops his head in. ATC #1 Hey, Patty, aren’t you coming? Down the hall, noises emanate. ATC #1 Everyone’s going nuts up top. Supe sent me looking for you. PATRICK I guess you didn’t hear.   Lost Cactus 1549.   In the Hudson. ATC #1 I guess you didn’t hear.   He landed the sonofabitch. PATRICK What? ATC #1 Everyone just got pulled off. It’s a miracle. Patrick grabs his friend in an embrace of disbelief. PATRICK I thought I lost them all. Man, still being hugged, scans the barren room. ATC #1 They have got to get a TV in here. INT. ST. LUKE’S HOSPITAL - EXTREME CLOSEUP - SULLY’S EYES 119   119 - LATER A light beam examines cornea and iris. PULL BACK to reveal Sully, still in his wet clothes, sitting on an examination bed. The DOCTOR, 36, thin hair, thinner waist, writes notes on his pad, then listens to Sully’s heart and lungs.  SULLY - 11/18/15 (Full Blue)   79. (CONTINUED)",
      "characters": [
        "PATRICK",
        "WARNING SYSTEM"
      ],
      "action_text": "SULLY What’s my pulse? DOCTOR 110. SULLY My normal resting is 55.   110 is not good. DOCTOR You’re right.   It’s not good. After what you just went through, 110 is extraordinary. SULLY How is Doreen? DOCTOR Fairly deep laceration, we’ll keep her a day or two to stem infection. SULLY But she’ll... DOCTOR ... have a scar and a story to tell, although no one will believe her.   I’m here with you and I don’t believe it.   You landed a plane on the Hudson.   Not a scratch on you.   Rest of your crew, too. A voice from the other side of the curtain. ARNIE (O.S.) Captain Arnie Gentile to see Captain Sullenberger. SULLY Wow, the union is sending all the big guns today. The curtain pulls back.   ARNIE, middle-aged, stocky. Serious. ARNIE I talked to Dan Britt, Sully. We’ve got a count. A beat.   Sully’s heart constricts.  SULLY - 11/18/15 (Full Blue)   80. CONTINUED: 119   119 (CONTINUED) ARNIE 155. For the very first time, Sully’s professional face gives way to something more vulnerable.   The shock of the human experience breaks across his brow, shadows his eyes, opens his mouth. He leans against the wall. SULLY 155? ARNIE It’s official.   155. SULLY (spent) 155. EXT. COURTYARD MARRIOTT HOTEL - LATER 120   120 ESTABLISHING of the nondescript hotel.   If not for the three police SUVs parked out front, it’d look like just another quiet night in Queens. INT. HOTEL HALLWAY - THAT NIGHT 121   121 U.S. AIR Captain CARL CLARKE, tall, soft-spoken, 50, is walking down the hall with two big shopping bags.   He’s accompanied by hotel manager EVELYN MAY, late 30s, tall,   * lovely.   They knock on rooms 311 and 313. Skiles exits one door, Sully the other. Skiles is showered and in a robe. Sully is still in his wet uniform, six hours after the landing. SKILES Hey.   Carl. CARL Jeff.   Sully.   Helluva thing you pulled off out there today. SULLY We’re here.   That’s about all I know at the moment.  SULLY - 11/18/15 (Full Blue)   81. CONTINUED: (2) 119   119 (CONTINUED) CARL This is Ms. ",
      "dialogue_count": 3,
      "word_count": 5090
    },
    {
      "scene_number": 16,
      "slugline": "INT. BATHROOM - CONTINUOUS ACTION 165   165 Sully and Skiles wash their hands.   Still mute. INT. HALLWAY - MOMENTS LATER 166   166 Sully exits alone, and as he waits for Skiles, his phone rings.   Lorrie. SULLY Lorrie. INTERCUT WITH: INT. SULLENBERGER BEDROOM - SAME TIME 167   167 Lorrie is lying on their bed.   Next to her is a large, opened FEDEX PACKAGE which held... SULLY’S SUITCASE, rescued from the wreckage of Flight 1549.   Including his -- Pilot’s hat.   Which Lorrie is cradling in her hands. Tears steal the rest of her speech. SULLY Sweetheart, what happened? LORRIE For the first time, just now, I realized that there were 155 people on that plane.   And you were one of them. More tears.   Tears of relief and joy. LORRIE I almost lost you.   The girls almost lost you. SULLY But you didn’t.   I’m here. Long pause as they simply take in the sound of each other’s breathing.   Their existence.   It is beautiful. LORRIE How are you holding up?   Tell me it’s almost over. SULLY It’s almost over.  SULLY - 11/18/15 (Full Blue)   106. (CONTINUED)",
      "characters": [],
      "action_text": "LORRIE I love you. SULLY I love you. Sully hangs up.   Takes a moment to gather himself. Skiles exits the bathroom and joins Sully as they walk in silence back toward the conference room. Just before they reach the doors... Sully stops. Skiles stops, too.   Faces Sully. SULLY What did you think?   Listening to the CVR.   Now. Skiles can’t muster an answer. SULLY I’ll tell you what I think... I’m just so damn proud of you.   You were right there with me, through all those distractions.   With so much at stake. (pause) We did this together.   We were a team. Skiles’ eyes brim with tears. SKILES Thank you. Then they lock into an embrace.   Brothers.   For life. When they step back, the emotion is an invisible cord between them. SULLY We did our job. SKILES We did our job. INT. NTSB HEARING ROOM - MOMENTS LATER 168   168 All have returned.   The weight of the investigation has been replaced by a sense of humble awe.  SULLY - 11/18/15 (Full Blue)   107. CONTINUED: 167   167 (CONTINUED) CHARLES PORTER That is, honestly, the first time I have listened to a crash recording... while actually sitting with the Captain and First Officer.   Extraordinary. SKILES That was no simulation. CHARLES PORTER No, it wasn’t. The NTSB board is looking for the right words. Finally... ELIZABETH DAVIS I also wanted to let you know that the left engine was recovered late yesterday. Sully waits a beat. The monitors they have been watching come to life with VIDEO FOOTAGE... A massive crane lifts the LEFT ENGINE from the Hudson River.   It dangles over the water, facing away.   Its damage unseen. On the video, the LEFT ENGINE rotates TOWARD CAMERA.   It is mangled and decimated from within and without. ELIZABETH DAVIS Extensive damage on both the guide   * vanes and fan blades of the   * engine.   Five compressor blades   * were fractured and eight variable   * guide vanes... missing. SULLY No thrust. ELIZABETH DAVIS As you testified, it was completely destroyed.   The ACARS data was wrong. Sully",
      "dialogue_count": 0,
      "word_count": 878
    }
  ]
}