{
  "slug": "super-dark-times-2017",
  "title": "super dark times",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 9,
  "characters_count": 0,
  "characters": [],
  "total_words": 22548,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT.   WOODS - DAWN   * 1   1 A   DEER   stands by the treeline on the edge of a field.   * The   Deer looks up, frozen, staring at something off screen,   * then   suddenly it takes off,   running full speed, bounding   * across the land out into a clearing up ahead. EXT.   SOCCER FIELD - MOMENTS LATER 2   2 The   Deer is running on the neatly trimmed grass. Up ahead A   * SCHOOL BUILDING is visible. EXT.   HIGH SCHOOL 3   3 The   rising sun reflects   on the windows. They’re large, practically floor to ceiling. THE   DEER   * bombing across the field, getting closer to the school. It's   * hooves kicking up mud. It's eyes black and emotionless.   * Eventually it connects with   * THE   WINDOW   * Its   face smashing into the glass. We see it   in slow motion.   * The   window explodes around the deer, glass shards floating   * in   the air; blood tearing off the deer's body and mixing   * with   the hovering glass.   * INT.   HIGH SCHOOL - LATER   * 4   4 Several static shots of   the aftermath. The shattered classroom window; in   the hallway, blood spattered and   * smeared across the pristine white tile; a   trail showing the   * path   the wounded animal   took, leading to: INT.   CAFETERIA 5   5 The   Deer has collapsed in the middle of the room, exhausted, bleeding out. A huddled   brown lump gasping for air.   * A   JANITOR enters and pauses at the sight   of it. He drops the   * mop   and runs down the hallway.   * CUT TO:",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 257
    },
    {
      "scene_number": 2,
      "slugline": "INT.   CAFETERIA - MORNING 6   6 Faculty members crowd around the scene, whispering, shocked,   * disgusted, sad. Two POLICE OFFICERS make their way through.   * THE   DEER   * Kicks and squirms with what little life it has left. The   * Officers look down at the poor creature, then around   at   the   * STUDENTS lining   the walls.   * One   Officer looks at the other and silently kneels down by   * the   dying animal. He gently   takes its head in his hands.   * While   he holds it still, the other Officer   raises his boot,   * bringing it down hard on the animal's neck. It takes two   * STOMPS to do the job, but the deer stops moving, its neck   * broken.   * He   gets closer, makes sure   the animal   has stopped breathing,   * and   stands.   He gives it a gentle kick.   The Students   stare,   * some even   crying.   * TITLE CARD:   * SUPER DARK TIMES FADE   IN: A   COLORFUL PIXELATED IMAGE Moving, undulating, totally abstract.   Colors shifting,   * bathed in static.   Uncomfortably close to a   * TV   SCREEN Just   an indecipherable   mess of colors and static until   * suddenly out of the blur and fuzz   a person   can be seen, but   * then   it’s gone again, flickering back and forth like a magic-eye painting.   The image suddenly clears again.   * A   TOPLESS WOMAN Here   then gone. The volume is raised on the TV and little stabs   of music cut through the white noise, funky porno bass accompanied by moaning.   * SCRAMBLED TV PORN.   It goes on a bit longer.   Almost like   * video   art.   * From   nearby, we hear the VOICES of two teenage boys   * 2.",
      "characters": [],
      "action_text": "JOSH (O.S.) Would you? ZACH (O.S.) I think so. CUT TO: A   YEARBOOK PHOTO OF A GIRL She’s   probably pretty. Hard to tell with that awkward school   * photo   smile. JOSH Yeah, I would too.   * They   flip to a photo of   ANOTHER GIRL.   Blonde hair. Braces.   * ZACH I don’t know, probably. JOSH   * Meh, blonde. ZACH   * I see. ANOTHER GIRL, unquestionably attractive.   * BOTH Yes! A   YEARBOOK PHOTO OF A WOMAN.   A teacher. The name underneath   * reads   ‘Mrs.   Hunt.’   * ZACH Ohh, yes. Twice.   If she’d let me.   * ONE   LAST PHOTO.   Cute girl, terrible picture: mouth half   * open,   clearly not ready   for the camera to snap. INT.   TV ROOM - AFTERNOON 7   7 The   scrambled porn plays on TV while the two boys sit on the couch   flipping through their 8th grade yearbook. They are   * ZACH   and JOSH. Both 14 and trying too hard: Zach with his   * short   sleeve shirt and tie. Josh with his blue hoodie and Elvis   Costello glasses. Zach’s finger is still on the photo. 3. ZACH Allison Banister. Josh   answers instantly. JOSH Obviously yes. Any time, anywhere. ZACH Really? Anywhere? Like ANY where? JOSH Son, I’d do that shit for the talent show   if that's what it took.   Onstage   * in front of everyone: Fuck. Yes.   You   * wouldn’t?   * Zach   is reluctant to answer after Josh's declaration. ZACH She's cool. We’ve known her since, elementary. I mean, I like her.   * JOSH Me   too.   * ZACH We just actually know her. She and I hang out sometimes in   English   so...   * Feels weird talking about her.   * An   awkward pause between them. Clearly they’re both into   * her.   Josh changes the subject. JOSH Uh-huh. Got any drinks? ZACH Caffeine free Coke. JOSH Well then... INT.   KITCHEN - AFTERNOON   * 8   8 Zach   and Josh are slipping on their jackets   and boots.   * JOSH   * Man, I hate the fucking winter. It's   * such a schlep to do anything.   * 4. ZACH   * Yeah,   but the snow is pretty.   * JOSH   * laughing   * (   ) It's pretty?   * Zach shrugs off Josh",
      "dialogue_count": 0,
      "word_count": 8829
    },
    {
      "scene_number": 3,
      "slugline": "EXT.   HILLY ROAD - EVENING 36   36 The   sun has just set and the light is disappearing fast. Zach   is the only thing on this road. He pumps as hard as he can,   climbing a hill, reaching   the top of it, then beginning   * his   roller coaster-like   decent. Only   instead of standing up or letting the bike just roll, Zach   pedals even harder   on the incredibly steep downhill   * slide.   * He   pumps faster and faster, the bike wobbling under the   * strain of the speed. The wind is blowing on his face and he CLOSES HIS EYES   * Squeezing tears down his face, pumping harder than ever until, finally, at the bottom of the hill, he loses control of   the bike and   tumbles down onto the asphalt.   * He   hits the ground hard   and continues to roll and scrape   * himself for several more feet.   He lands on his back and lies   * there   in the fading light staring up at THE   SKY   * The   stars are just beginning to be visible and the moon in full. EXT.   ZACH'S HOUSE - EVENING 37   37 Zach   walks his wrecked bike up to the garage. INT.   KITCHEN - MOMENTS LATER 38   38 Zach   slips in from the garage. He’s beat up from his fall, exhausted from everything else.   He walks straight to the tap   * and   downs a huge glass of water.   He doesn’t notice...   * ALLISON   * Is   sitting behind him, watching him with nervous curiosity. He   fills the glass again. Halfway through it, he sees her and   jumps, startled.   Surprise quickly turns to confusion.   *  What   the hell is she doing here?   * She   waves, a little embarrassed. 50.",
      "characters": [],
      "action_text": "ALLISON Your mom... I just stopped by, she said you’d   be back. She went to get come Cokes   out of the closet. He   just stands there, panting. ZACH Oh... I was on my bike. She   notices his bloody elbow. ALLISON Oh god, are you okay?   * Karen walks in with a case of soda under her arm.   * KAREN   * It’s caffeine free, I hope... Ah, see! There he is. She   smirks at him knowingly. Then notices his wound. KAREN   * You’re bleeding.   * ZACH It’s fine. KAREN   * What happened? ZACH I fell. On   my bike... She   lifts his arms to examine it and winces, hissing through her   teeth. KAREN   * That looks nasty. You should clean it. ZACH I will. There’s an awkward beat. Allison is realizing that coming here   wasn’t such a great idea.   Zach is still spaced out.   * Karen has to step in.   * KAREN   * Zach’s room is upstairs. 51. Zach   nods in Allison’s direction and heads up. She follows, uncertain.   She glances at   Karen   for support.   Karen   gives her   * a   nod   and wave.   He’s always like this.   * INT.   UPSTAIRS HALLWAY/ZACH’S ROOM - EVENING 39   39 Allison starts babbling   behind him. ALLISON I was just   walking and I passed by... I guess I should have called first but I didn't realize I'd be near your house until I saw it and said \"oh that's Zach's house, maybe I should stop and yell ‘handjobs’ at the top   * of my lungs.” Zach   glances back at her. She nods, eyebrow raised. Zach takes   a breath and stops by the upstairs bathroom to grab a wad   of toilet paper. He uses it stop the flow of blood from his   elbow. ALLISON She’s right. You should clean that. ZACH I will. Just for now. She   nods and follows him into his room. He sits on the bed, clearly distracted.   There’s no place for her to sit.   * ALLISON ...You want me to go? He   doesn’t answer. He’s   trying   and failing to hold   * everything in.   * ZACH I’m sorry.   I- She’s   suddenly, surprisingly earnest. ALLISON Don’t apologize. She   moves to the doorway, out of his line of sight. ",
      "dialogue_count": 0,
      "word_count": 2577
    },
    {
      "scene_number": 4,
      "slugline": "INT. 53   53 LIVING ROOM   - MORNING   * Sunlight breaks through   the window and dances across Zach's   * eyes,   gently rousing him awake.   * Karen   is asleep on the love seat nearby, a book on her   * chest.   * ZACH   * Mom. Mom. It's morning, we gotta get   * up.   * She   rises, startled and   confused.   * KAREN   * I'm sorry,   honey. What time is it?   * Zach   looks   at the clock on the mantel.   * ZACH   * It's 7.   * KAREN   * SHIT. Shoot. Shoot, okay, gotta go.   * You get dressed, I'll throw some   * cereal in a bowl.   * ZACH   * Shouldn't you get to work?   * KAREN   * I will, don't worry, just get   * changed.   * EXT.   HIGH SCHOOL - MORNING   * 54   54 A   few   stragglers   slip   into the building. Zach locks   his bike   * up,   staring at   the police car   parked at the curb in front.   * INT.   SCHOOL - HALLWAY -   MORNING   * 55   55   * Zach   walks through the crowd of students. All around him he   * can   hear the murmuring of people talking about Daryl’s   * disappearance.   * INT.   GYM - MORNING   * 56   56 The   entire student body   is seated in the bleachers. Down on   * the   court THE SHERIFF stands with THE PRINCIPLE.   * 62.",
      "characters": [],
      "action_text": "They   share a microphone and talk about how anyone with   * information should come   forward, etc.   * Zach scans the crowd   eventually he spots Allison on the   * opposite side of the court. He continues looking but does   * not   see Josh anywhere. Just a bunch of faces, a bunch of   * people.   * INT.   CLASSROOM - HEALTH   ED   * 57   57 Students are working silently on a test or something.   * AN   EMPTY DESK   * Stands out ominously in   the middle of the room.   * Zach   is seated toward the back. He looks up at the desk and   * then   back to his work.   * Suddenly he feels a kick on his chair. He looks over his   * shoulder to see a girl,   CINDY MAPLES, fiddling with a   * retractable bic pen.   * She   nods at Zach and he   watches as she starts to retract the   * pen,   bringing the tip up, then down, over and over, faster   * and   faster. Moaning quietly as she does it.   * Zach   keeps watching, not sure what to do. A few girls nearby   * stifle laughter.   * EXT.   OPEN ROAD - AFTERNOON   * 58   58 Zach   is biking alone along the side of the road but suddenly   * slows   to stop. He looks   all around him and sees nothing   * moving in any direction.   * He   is   the only living thing within view. After a moment he   * gets   up and pedals off.   * INT.   BATHROOM - NIGHT   * 59   59 Zach   stands looking at himself in the mirror. He runs his   * fingers through his hair, pulling it away from his face.   * He   reaches into a drawer and pulls out some electric hair   * clippers and switches them on.   * But   before he can get at his hair,   he’s interrupted by   a   * KNOCK   on the door.   * 63. ZACH   * Yeah?!   * KAREN   (O.S.)   * I'm going to the store do you need   * anything?   * He   opens the door.   She sees the clippers in his hand and   * makes   a frown.   * KAREN   (CONT’D)   * What the hell are you doing?   * ZACH   * Nothing.   * KAREN   * Don't be doing what I think you're   * doing.   * ZACH   * I'm not doing anything...   * S",
      "dialogue_count": 0,
      "word_count": 3560
    },
    {
      "scene_number": 5,
      "slugline": "EXT.   STREET - NIGHT 74   74 Zach   is walking fast, emotionally strung out. ALLISON (O.S.) Hey! You taking off? ZACH Yeah, I don’t know,   not much of a   * party guy. Just wanted to say happy   * birthday.   * Allison seems genuinely   bummed. ALLISON Oh. ZACH It’s fine.   I just got a lot going on right now. ALLISON That’s   why   you smoke. To relax.   * ZACH But I’m not into that. And neither is Josh, he just brought all that to impress you, it’s fucking lame. She   doesn’t respond. She lets his words hang there.   He turns   * to   her, not meeting her   eyes. ZACH I’m sorry,   Allison. I- ALLISON   * Somebody's lying.   * Zach   is startled.   * ZACH   * What?   * Allison tilts her head to the house and smiles, swaying with   *  Chris   Isaac - \"Somebody's Crying\"   in the background.   * ALLISON   * The song...Chris Isaac.   Best track   * on the album.   * She   moves in for a kiss   as he swings his head around and up.   * Their   heads connect with a BANG. 79.",
      "characters": [],
      "action_text": "ALLISON   (cont'd) Ah! ZACH Sorry! I’m   sorry. She   starts giggling. He   reaches out to touch her head and suddenly instinctively kisses it where they collided. She   stops giggling. He kisses her head again. Then her lips.   * He   stops. They look at one another a moment.   * ZACH   * I’m sorry.   Happy Birthday Allison.   * She   watches him walk off into the night. Alone, he picks up speed. Jogging. Running   through the dark. EXT.   TRACK - DAY   * 75   75 Zach   is in gym clothes running laps around the outdoor track. Other students are running as well in groups of   * threes and fours but Zach is keeping his own company, lost in   thought until he sees something. ZACH’S POV   * We   see the flashing red   and blue lights of police cars in the   distance up on the road traveling toward the school. ZACH   * Watches this with no small interest. The cars turn into the   * school parking lot and OFFICERS walk toward the building Zach   continues running,   going faster now, sprinting. His thoughts running wild in his head. INT. 76   76 LOCKER ROOM   - HIGH SCHOOL   * Zach sits on the bench in front of his locker,   the energy   * around him is terrifying and unnerving.   The other boys   * excitedly talking. Zach's in a daze, barely listening.   Only   * certain words reach him   and resgister.   Words like   *  Dead,   killed, body, cops.   * 80. INT.   CLASSROOM   * 77   77 Zach   slumps down at his   desk, dejected. PHILIP, a kid   * wearing a baseball cap,   sits down at the desk behind him.   * PHILIP   * Dude, you hear that shit?   * Zach   turns around.   * ZACH   * Huh?   * PHILIP   * That guy. He’s dead, they found him   * dead.   * ZACH   * Who?   * PHILIP   * John Whitcomb. The dude with the blue   * hair.   * ZACH   * Wait what? He’s dead, he died?   * PHILIP   * Yeah, they found him this morning.   * ZACH   * Fuck.   * PHILIP   * I know, right? I had Algebra with   * him. Small fucking world.   * Everything slows down and the sound drowns out. Zach",
      "dialogue_count": 0,
      "word_count": 2202
    },
    {
      "scene_number": 6,
      "slugline": "INT.   CHARLIE’S HOUSE - EVENING 89   89 Charlie’s   working   on an enormous desktop computer. The phone   * rings   behind him.   He answers.   * CHARLIE Sharp residence.   * ZACH Charlie? It’s Zach. CHARLIE ...How’d you get my number? ZACH Don't worry about it.   Listen.   * CHARLIE Okay. ZACH   * Shit...   Okay I’ll just say it... it’s   * Josh. CHARLIE What’s Josh? ZACH The killer. I think he Killed John Whitcomb. INT. 90   90 KAREN’S CAR - EVENING   * Karen is driving down the road, listening to the radio. Her   * headlights fall on a kid on a bike in front of her. A blue hoodie. She pulls up beside him and rolls her window down. KAREN   * Josh? He   stops and turns. JOSH Mrs.   Taylor.   * INT.   KITCHEN - NIGHT 91   91 Zach   clutches the phone, pacing. CHARLIE   * Killer? Zach what the hell...   * 90.",
      "characters": [],
      "action_text": "ZACH I’m still figuring it all out but I   * had to talk to somebody who knew and you’re the only who does, so... I’ve tried talking to Josh but there’s something wrong with him. He was so pissed at Daryl for   ganking   his   * brother’s pot but   the other night he   * just gave it away.   * CHARLIE What? ZACH Yeah, to this   girl we know   as a gift   * and   he said he'd sell some to   John   * Whitcomb.   * CHARLIE   * So?   * ZACH   * He hated John Whitcomb. Him and those   * guys he hung out with.   * CHARLIE   * What guys? Zach-   * ZACH   * Forget it, doesn’t matter. I’m saying   * like a week ago Josh was talking   * about how much he hated John Whitcomb   * and now John Whitcomb turns up dead   * in the pipeline where we hung out   * with Daryl that day? He was gonna   * sell him the pot! Like that story   * Daryl told us. He said he would sell   * to him, lured him out there and got   * him alone so he could kill him!   * EXT. 92   92 KAREN'S   CAR - ROADSIDE   * Josh   is standing on the   side of the road. She’s pulled over now. KAREN   * You shouldn’t be out here like this at night.   Not with everything that's   * been going on. Where are you headed?   * JOSH   * I was actually on my way to see Zach. 91. KAREN   * We haven’t seen you around lately.   * Everything alright?   * JOSH   * We had a fight the other day-   * KAREN   * Well, that’s between you two. I’ll   * keep my nose out but you shouldn’t be   * out here alone.   Get in.   You can put   * the bike in the back.   * INT.   CHARLIE’S HOUSE - EVENING   * 93   93 CHARLIE Alright, he’s acting weird. So are you! So am   I, probably.   * ZACH I know, but I couldn’t stop thinking about it. I went back out to the   * woods where Daryl was but it was   * different, someone else had been there before me, he was moved around and- CHARLIE You went out there? What did-   * ZACH   * Look, the sword was gone. The tree   * was uncovered and the sword was gone,   * along with my sweatshirt.   * CHARLIE   * ",
      "dialogue_count": 0,
      "word_count": 3700
    },
    {
      "scene_number": 7,
      "slugline": "INT.   REBECCA’S ROOM 119   119 - CONTINUOUS   * The   place is a wreck. Pink walls. Red floors. Clothes strewn about. And a sizable BOOKSHELF on the floor in   front of the door. That must be what had been keeping him out... but it’s pulled aside now. And the door is open. Josh   is gone. ALLISON is writhing weakly in the corner.   Zach races to her   * side.   Her head hangs forward. THE   BACK HER NECK   * Is   horrific. There are   bruises and lacerations. Deep ones.   * Josh   tried to use the sword on her neck, to cut off her head.   Not quite bamboo grade.   Sharp enough to cut through   * milk   cartons. This is what it does to a human neck. To Allison’s neck. These horrible, ragged   hacks.   * She’s   barely moving. Losing consciousness.   Zach cries out.   * He   screams for help again. The   house CREAKS.   * He   realizes for the first time that Josh might still be here. Allison has gone limp in his arms. He sets her down   * and   stands, watching the doorway. ZACH Josh? He   stoops to collect his shovel and steps toward the doorway. He takes a deep breath, pulls the door open and   * steps   out into   * THE   HALLWAY   * 120   120 He   swings his shovel, but connects with nothing.   * ZACH Jo- But   then   Josh rounds the corner, sword in hand.   * Zach   goes low and   tackles him. The two boys grapple with   * each   other. It’s not unlike the earlier confrontation between Zach and Daryl. Eventually, Zach manages to get free. He scurries back and stands.   * 109.",
      "characters": [],
      "action_text": "They face   one another.   * ZACH   (cont'd) What the fuck? Josh, what the fuck?! Josh   just stares at him, shaking.   Zach is terrified.   * Adrenaline surging through him. JOSH   * Is she dead? ZACH Fuck you. Her brother called the   * police. JOSH I don’t care. There's an emptiness in   Josh's voice. He continues to stand   * there. Shaking.   Zach’s shaking now, too.   * ZACH Please please please don’t. Okay? Josh? Josh   starts breathing heavier. Huffing. Puffing. Working himself up.   * There’s nothing behind Zach but a bathroom. He has to get by Josh   if he wants to get   out. He   makes a break for it, dashing forward and to the side, trying to dodge around Josh and his sword. He   makes it but Josh is   right behind him. He   swings   the   * sword, hitting Zach in the shoulder.   * Not   sharp enough to slice deeply into him, but sharp enough   * to   cut. And fucking hurt.   Zach   SCREAMS.   * Josh brings the sword down hard, to Zach's head. CRACK!   * Right   on the   top of Zach’s skull, splitting the skin. CRACK!   * Blood   streams down Zach’s face. He collapses.   * Josh   is on top of him, stabbing frantically with the sword.   * Zach   squirms around and   manages to kick Josh back.   * He   gets to his feet and   stumbles out the front door, into   * the   yard. 110.",
      "dialogue_count": 0,
      "word_count": 497
    },
    {
      "scene_number": 8,
      "slugline": "EXT.   REBECCA’S HOUSE - EVENING 121   121 Zach   races out as fast as he can go. Josh comes bounding after   him.   Josh bellows and takes another swing.   * A   LITTLE GIRL   * Stands in the doorway of one of the nearby houses. She watches silently. Josh catches up with Zach. He swings again.   * Zach’s ankle twists beneath him and he falls into the street. Josh   straddles him again. This time when he stabs he makes contact. He pierces Zach’s thigh.   * Zach   grabs the blade and shifts to the side, pulling it out, forcing it away from him. A   CAR   * Drives past. Slows. Then speeds the fuck up and peels out.   * Dogs   start barking in the distance. And beyond that...   * SIRENS. Zach   swings blindly up at Josh, trying to fend him off.   Josh   * doesn’t give a shit. With his free hand, he swings back. But   suddenly   A MAN rushes up behind Josh and catches him   * under   the arms, pulling   him away from Zach. The   Man holds   tight against Josh's struggles.   * In a   rage   Zach stands and   rushes at Josh. Takes a good,   * cheap   swing. The   Man tries to pull Josh away. He’s shouting at Zach, trying to calm him down. PEOPLE   * Are   out now. All standing in their yards. Staring. Nervous.   * The   Man’s actions have made others braver, though. More come   * to   help restrain the kids. Josh   manages to wriggle   free and collapse on the blacktop.   * Before anyone can seize   him, Zach rushes over. He KICKS Josh   * in   the face. The   people stand   watching.   * 111.",
      "characters": [],
      "action_text": "DENNIS   * Comes   running over from   his house, surprised at the sudden   * activity. JOSH   * Is   through fighting back. He just lies there. ZACH   * Kicks   again. And STOMPS   and SCREAMS. The   Man is able to subdue Zach just as   the red and blue   * lights of the police cars arrive. The sirens drown   out   * everything.   * Others are helping Josh   to his feet, holding him up. The   Man holds   Zach back.   It’s not necessary, however. The   * fury   is gone. He’s spent. He’s done. He   and Josh make eye contact with one another. ZACH’S FACE   * Still   shows emotion. JOSH’S FACE   * Holds   none. The   two boys are stuck there. They stare at each other until police come and handcuff each of them and put them in separate cars. IN   ONE CAR   * 122   122 Josh   sits staring off. THE   SEAT-BACK   * In   front of him is black vinyl, cracked in a few places   with   * heat   and age.   Josh stares into these lines, cracks, creases.   * There   is nothing more interesting. IN   THE OTHER CAR   * 123   123 Zach   leans back and looks 112. OUT   THE WINDOW   * He   sees all of the activity of police taping off the area and   holding the onlookers back.   Rebecca's parents pull up in   * their   car, totally confounded.   * He   sees paramedics wheel out two gurneys. Dennis runs up and   * alongside the one that clearly carries Allison. She reaches up   to   take his hand. He   gets into the back of the ambulance with   her before it speeds away. Zach   smiles slightly. She’s alive. He looks down at his handcuffed   HANDS, moving them a bit despite the restraint.   * Finally he settles with   them in his lap.   * FADE TO:   * EXT.   WOODS - DAWN   * 124   124 Silence. Time has passed. Winter has moved on. Spring is   * here.   * A   deer stands alone, picking at some plants when suddenly it   * looks   up. It stares into the forest at something unseen. The   * wind   picks up. Trees sway. The deer takes off.   * EXT.   SOCCER FIELD - DAWN   * 125   125   * Break",
      "dialogue_count": 0,
      "word_count": 708
    },
    {
      "scene_number": 9,
      "slugline": "INT.   ALLISON'S KITCHEN - MORNING   * 129   129 She   sits at the table eating a bowl of cereal. Dennis sits   * next   to her. Her mother   comes in and gives her a kiss on the   * head   and whispers something into her ear. Allison nods. Her   * mother smiles.   * INT.   CAR - MORNING   * 130   130 Allison stares out the window as Dennis drives her.   * INT.   HALLWAY - DAY   * 131   131 Allison stands at her locker, staring into it. After a   * moment she grabs her AP   History book and closes the door.   * INT.   AP HISTORY - DAY   * 132   132 The   teacher lectures. The students take notes. Allison   * fiddles with her pony tail unconsciously, then slowly brings   * her   hand down to her neck where she gently rubs the scars   * that   remain there. It's   healed now as time has passed, but   * its   still a visible relic of something terrible.   * A MALE STUDENT   sits behind her. He stares at her pony tail   * and   then down at the back of her neck.   * Without looking back Allison undoes her pony tail and lets   * her   hair down, covering   up the scar.   * * The   teacher asks a question.   Allison raises her hand   * * CUT TO BLACK   * 114.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 218
    }
  ]
}