{
  "slug": "supernatural-101-pilot-2005",
  "title": "supernatural 101 pilot",
  "genre": "thriller",
  "format": "series",
  "scenes_count": 8,
  "characters_count": 1,
  "characters": [
    "SAM"
  ],
  "total_words": 10738,
  "total_dialogue": 1,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. HOUSE - MASTER BEDROOM - LATER THAT NIGHT A BABY MONITOR, on a nightstand.   (We also see Jack and Mary’s WEDDING PHOTO-- he’s wearing naval whites.)   The baby’s PIERCING CRIES, through the monitor receiver. Mary groans awake.   Looks over.   Jack isn’t in bed.   Still the baby bawls. INT. HOUSE - UPSTAIRS HALLWAY - NIGHT Mary shuffles down the hall.   Opens the nursery door, peers in.   Pitch-black inside.   But Mary discerns a FIGURE hunched over the crib. MARY Jack?   Is he hungry? FIGURE Shhhhh. Mary holds up her hands-- okay, sorry.   She turns away. But when she reaches her bedroom door, she stops.   Noticing-- At the other end of the hall... the stairwell.   A pale, dancing, ghostly light.   Coming from downstairs.   Mary frowns.   What the hell? She moves toward the shimmering glow.   Cautious. At the stairs now.   Bare feet padding down the steps. Until, finally, Mary reaches the bottom, to see-- INT. HOUSE - FAMILY ROOM - NIGHT Jack.   Asleep in his La-Z-Boy.   An old movie on the muted TV. MARY Oh my God. Mary spins, BOLTS up the steps! INT. HOUSE - NURSERY - NIGHT Mary BURSTS into the nursery, flips on the light.   And whatever she sees O.S., it causes the color to drain from her face; her breath to come in short, panicked bursts. MARY (a whisper) ...get away from him... 2.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 226
    },
    {
      "scene_number": 2,
      "slugline": "INT. HOUSE - FAMILY ROOM - NIGHT Coming from upstairs, Mary’s terrible, ragged SCREAMING! Jack LUNGES out of his chair-- JACK Mary?! As Jack takes the steps two at a time, Mary’s screaming abruptly snuffs out. INT. HOUSE - NURSERY - NIGHT Jack explodes into the nursery.   Mary’s not there.   He moves up to the crib.   The baby’s okay, thank God, though he’s bawling, inconsolable.   Jack holds Sam, confounded-- JACK Mary...? Jack is about to exit the room, to search for his wife, when he stops.   Sensing something.   He turns back, noticing-- INSIDE THE CRIB.   Plink.   A dime of crimson red appears on the Sesame Street mattress.   Plink.   Then another.   Another. They’re drops.   Drops coming from above. Jack looks up at the ceiling.   His face twists into equal parts anguish and terror. JACK ...no...oh my God no... ON THE CEILING.   MARY.   Impossibly splayed out, as if it were the floor.   Eyes wide open, glassy.   Dead. Jack barely has time to react, before... Sizzling.   BLACK LINES, BURNING THEMSELVES into the wall. Spiderwebbing.   Some horizontal, some vertical.   At first, we don’t realize what it is.   But then it takes shape. A message.   Branded into the wall, in charcoal black letters four feet high--  COMING FOR YOU  The message smolders and IGNITES.   Flames curl the wallpaper. Spreading fast.   A smoke alarm BLARES, piercing. Outside, in the hallway, Dean begins to push open the nursery door, crying, terrified. 3.",
      "characters": [],
      "action_text": "YOUNG DEAN Mommy?!   Daddy?! Snapping to lucidity, Jack carries baby Sam out of the room. Snatches up Dean with his other arm, before the boy enters. JACK No, Dean.   Don’t look, okay?   We gotta go. Jack darts quickly for the stairs. Out the front door. CUT TO: EXT. HOUSE - NIGHT - FEW MINUTES LATER An angry BLAZE.   Firetrucks.   In a few hours, when they finally extinguish the flames, there won’t be much left. Jack.   Across the street.   Holding, comforting his two sons. TIGHTER.   Jack.   Watching the house burn.   Fire illuminating his expression, reflecting in his eyes. His jaw sets in pain and FURY-- BLACKOUT. END OF TEASER 4. ACT ONE OVER BLACK--  STANFORD UNIVERSITY.   PALO ALTO, CALIFORNIA.   PRESENT DAY.  EXT. STANFORD CAMPUS - NIGHT A BLOODY CORPSE walks, casual, across the quad. It takes a drag off a Marlboro.   And shakes its head at-- SAM HARRISON, 23, clad in a gray T-shirt and jeans.   Sam walks beside his girlfriend JESSICA, dressed as a sexy nurse. LUIS (the zombie) ...I gotta tell you, Sam, if your sorry ass was trick or treating my house, there’d be no popcorn balls for you. SAM (gross) You gave out popcorn balls? LUIS Don’t change the subject.   You could’ve at least gone as the slutty version of something. Slutty Dorothy, slutty Alice, slutty nurse-- JESSICA Hey! LUIS I didn’t mean you. SAM Sorry, man, what can I say?   Just never been a big fan of the whole thing. LUIS What are you, a communist?   Who doesn’t like Halloween? Sam doesn’t respond... but something flits across his expression, that the others don’t notice. INT. THE 901 CLUB - NIGHT Scruffy hang-out.   Halloween party.   George W. Bush throws back shots with Bill Clinton and Dracula. 5. Jessica sits at a tall, round table.   Watching Sam and Luis play darts.   Sam THROWS-- JESSICA ...but Sam, I think it’s crazy. Luis, tell him he’s crazy. LUIS You’re crazy. Thwak.   Thwak.   Thwak.   THREE DARTS pierce a DART BOARD. Dead bulls-eyes, crowding the tiny center. LUIS (dismay at the g",
      "dialogue_count": 0,
      "word_count": 3629
    },
    {
      "scene_number": 3,
      "slugline": "INT. COUNTY SHERIFF’S DEPARTMENT - BULLPEN - DAY CLOSE ON THE I.D.   Now in a slim leather wallet.   As a forgery, it’s flawless.   Dean’s photo, beneath the SILVER STAR SEAL of the United States Marshals Service. DEPUTY JAFFE, 40, mostly harmless, holds it.   He looks over these two young men in their street clothes.   Sam hangs back, tense and tight-lipped. DEPUTY JAFFE ...aren’t you two a little young for Federal Marshals? DEAN Deputy Marshals, actually, and thanks, that’s kind of you to say. Meanwhile, the inside of the department is just as chaotic as the outside.   Crowded with tired, overworked staff. INSIDE A GLASS OFFICE.   SHERIFF PIERCE, 50’s, severe and strict-looking, converses with two dark-suited FBI AGENTS. DEPUTY JAFFE Well, take a number, boys.   FBI’s already muscling for rank.   You can talk to Sheriff Pierce when he’s done with ‘em, but it’ll be a few hours at least. DEAN Few hours?   Look, our boss wants a status report, and he wants it yesterday.   How ‘bout you just give us a lay of the land? DEPUTY JAFFE And what makes you think I got the time? DEAN (irritated) Listen, Barney-- When Sam intervenes.   Surprisingly collected-- SAM Hey.   We’re all Deputies here, and we’re all under the gun.   So can you help us out?   Please, just a few minutes?   Then I promise, we’ll blow right outta here. 23.",
      "characters": [],
      "action_text": "OFF Deputy Jaffe.   Considering-- INT. SHERIFF’S DEPARTMENT - EVIDENCE ROOM - DAY Sam and Dean follow Deputy Jaffe into the room.   Dean is reading from a clipboard. DEPUTY JAFFE ...so here’s all the evidence we collected off Centennial Highway. And by that, I mean a whole lotta nothin’. The EVIDENCE TABLE is covered in typical roadside debris-- soda cans, crumpled fast food wrappers.   Sam looks it over. DEAN Any eyewitnesses? DEPUTY JAFFE Not at the time of disappearance. It’s always the same.   Victims are last seen turning onto Centennial, or heading towards it.   But somewhere along that road... poof, they’re gone.   And I mean gone, not even tire treads, it’s... weird. Sam spots something amid the junk.   He lifts it with a pen. An OLD SILVER NECKLACE, with a tarnished (and MEMORABLE) ROSE PENDANT.   Discarded long ago.   Still, it seems out of place. DEAN So what’s the popular theory? DEPUTY JAFFE That it’s some kinda stolen car ring.   We’ve been shaking down chop shops. DEAN (reading the clipboard) Yeah, I see that.   Ford Taurus, Mercury Topaz, Honda Civic.   These are hot rides. SAM All four victims were male? DEPUTY JAFFE Five victims, and yes. Sam and Dean both stop.   Look up. 24. SAM There’s been another? DEPUTY JAFFE Just last night. DEAN (with some worry) Middle-aged man? DEPUTY JAFFE (with a tinge) High school kid.   Name’s Troy Squire.   He was coming home from a Halloween party. SAM You know him. DEPUTY JAFFE Everybody knows everybody here. Dog dying’s a city-wide tragedy. So... five people missing... Sam looks at the Deputy with sympathy. INT. SHERIFF’S DEPARTMENT - BULLPEN - DAY Sam and Dean head for the front entrance.   When they pass Sheriff Pierce and the two FBI Agents. SHERIFF PIERCE (brusque; suspicious) Can I help you with something? DEAN No, sir, we were just leaving. (nodding to the FBI) Agent Mulder.   Agent Scully. As the boys walk on-- SAM So... no eyewitnesses... DEAN No.   But, we put our ears to the ground, we’ll probably pick u",
      "dialogue_count": 0,
      "word_count": 578
    },
    {
      "scene_number": 4,
      "slugline": "EXT. SANGER HIGH SCHOOL - DAY - ESTABLISHING Home of the Fighting Cougars.   On the detachable-letter SIGN: WE MISS YOU, TROY. INT. SANGER HIGH SCHOOL - LIBRARY - DAY A LIBRARIAN pokes her head into an aisle.   Glowering at Dean and Sam.   Dean pulls a 2004 Sanger Yearbook from the shelf. Looks up “Troy Squire” in the index.   Turns to a photo-- A candid of Troy.   Carefree smile.   Arms around two friends, BILL COAKLEY and AMY BROWN. DEAN (PRE-LAP) You must be Amy.   And Bill. EXT. SANGER HIGH SCHOOL - PARKING LOT - AFTERNOON Dean stands before AMY and BILL, both 17.   They lean against Bill’s car, smoking.   Few FRIENDS loiter around, too. DEAN Troy told us all about you.   We’re his uncles. I’m Dean, that’s Sammy. Sam does a slow burn.   He hates being called Sammy. AMY We’re so sorry. DEAN Yeah.   Thanks. SAM So... we’re kinda asking around, as a favor to Troy’s Mom.   Was he acting... weird to you at all? AMY What do you mean? SAM I mean... at the party, before he left?   Did he say anything strange? Maybe he was nervous... scared about something? BILL (irritated) What, you think he was driving high? 26.",
      "characters": [],
      "action_text": "DEAN (stepping in) No, we think the cops got their heads up their ass.   I mean, a carjacking?   Gimme a break.   But something happened out there.   So if you guys know anything at all... Amy and RACHEL, 17, exchange looks.   Dean catches this-- DEAN What? BILL (also spots their looks) Guys.   Please.   It’s just a story. DEAN What story? (the girls are hesitant) It’s okay.   We wanna know. RACHEL ...there was this girl, she got murdered, hitchhiking on Centennial.   Supposedly, she’s still out there, still hitchhiking. And whoever picks her up... well, they just... disappear... Teasing, ghostly OOHS from Bill. RACHEL Hey, my Aunt saw her once, okay? BILL Then why didn’t she disappear...? The students CHATTER-- some teasing, others defending the story.   As Sam and Dean exchange silent looks. EXT. SANGER HIGH SCHOOL - PARKING LOT - A MINUTE LATER Heading back to the Impala-- SAM I don’t know.   Hitchhiking girl, pretty classic urban legend.   Gotta be a hundred different versions of that same story. 27. DEAN (shrugs) Stories have to spring from somewhere... sometimes they spring from the truth.   God, remember that whole Bloody Mary, mirror thing? That was supposed to be an urban legend, too... SAM Yeah.   I guess you’re right. DEAN We’ll at least scope out the girls’ story, see what shakes loose. (they reach the car) Hey.   So those girls-- how old do you think they were? SAM Not old enough. DEAN Yeah.   You’re right. Sam climbs into the car-- SAM Get in the car, Dean. DEAN Yeah. Dean climbs in after. EXT. SANGER PUBLIC LIBRARY - AFTERNOON - ESTABLISHING The wind rattles the dead leaves. INT. SANGER PUBLIC LIBRARY - AFTERNOON A COMPUTER SCREEN.   A website-- The Sanger Herald.   Words are typed into a keyword search field.   “Murder.   Centennial Highway.”   The response: “No Articles Found.” Dean.   At the computer.   Lit, ghostly, by the phosphorescent screen.   Sam stands behind him.   Dean tries again.   This time: “Murder.   Hitchhiking.”   No Articles Found.",
      "dialogue_count": 0,
      "word_count": 1631
    },
    {
      "scene_number": 5,
      "slugline": "EXT. CORNFIELD - WITH DEAN - NIGHT When... over Dean’s shoulder... a white FIGURE BOLTS between the corn.   Dean SPINS.   Nobody there. EXT. CORNFIELD - WITH SAM - NIGHT SAM Dean...? No answer.   Only the wind WHISTLING through the field. EXT. CORNFIELD - WITH DEAN - NIGHT Dean.   Vigilant.   Eyes everywhere at once.   She’s close; he can feel it.   Where is she?   When is she going to lunge out? EXT. CORNFIELD - WITH SAM - NIGHT SAM Dean?! When, out of the corner of Sam’s eye-- Constance DARTS between the stalks!   He pivots.   Nothing. EXT. CORNFIELD - WITH DEAN - NIGHT Dean moves, slow and cautious.   Long, languid, suspense-beat. Then he turns... and suddenly spots something O.S.   Something horrifying, judging by his expression. EXT. CORNFIELD - WITH SAM - NIGHT DEAN (O.S.) (with great alarm) Sam!   Sam! Sam takes off like a shot.   Scrambling to his brother, with urgency.   Stalks scratching his face and arms.   Sprinting. Until he slows... because he spots... Materializing from the corn stalks... a CAR GRILL.   In fact, an ENTIRE TOYOTA, sitting incongruously in the middle of the field.   Troy Squire’s Toyota. Sam steps closer.   Flinches, as he notices-- ANGLE INSIDE TOYOTA.   We’re looking out at Sam, through the windshield.   There’s a FIGURE slumped behind the wheel, out of focus in the foreground.   But we can tell the figure is mutilated.   Wet with crimson. 35.",
      "characters": [
        "SAM"
      ],
      "action_text": "SAM.   Upset.   Disturbed.   When a HAND CLUTCHES his shoulder! Sam shouts, whirls-- it’s Dean.   Wearing a grim visage. DEAN They’re all here.   All the victims. (beat) But not Dad. EXT. CORNFIELD - CRANE SHOT - NIGHT In a wide OVERHEAD SHOT, we see-- Sam and Dean. And FIVE CARS, sitting in the cornfield.   Perfectly arranged, like the spokes of a wheel-- BLACKOUT. END OF ACT TWO 36. ACT THREE EXT. ROADSIDE MOTEL - DAWN - ESTABLISHING A garish, 50’s style NEON SIGN-- THE STAGECOACH INN.   A single-story, cinderblock motel. INT. MOTEL ROOM - DAWN Sam sits on one of the beds, studying a puzzle of NEWSPAPER CLIPPINGS spread before him.   When his CELL PHONE CHIRPS. On the cell phone display screen-- JESSICA CALLING. ANSWER... or IGNORE. Sam wants to pick up.   But what the hell’s he gonna say?   He punches IGNORE.   Then, Dean enters-- SAM You call 911? DEAN Yep. SAM (rolls his eyes) You tell ‘em your name was Ted Nugent? DEAN You know I did. (then) What’ve you got there? SAM Bad news.   I’ve been looking at the dates of the disappearances.   First one was a Wednesday.   Then the following Tuesday.   Then a Sunday. Goes on like this. DEAN I don’t follow. SAM It’s a pattern.   The days between victims.   5 days.   Then 4, 3, 2. Next is one.   It’ll be tonight. Meanwhile, Dean is scooping up his keys and wallet, pulling on his jacket, etc.   Not really listening. DEAN Nice work there, Matlock. 37. SAM Um.   What are you doing? DEAN I’m packing up my toothbrush, what’s it look like? SAM Wait, you wanna take off? DEAN Get on the ball, son.   Our grumpy little hitcher’s stowing her victims in the cornfield.   Dad, Dad’s pick-up-- not in the cornfield.   So sing along with me-- SAM (dry) He’s probably not one of her victims, I know. DEAN He’s probably not even in Sanger. Who knows if he ever came, in the first place?   Anyway, doesn’t matter, we’ll find him. SAM (beat) We’re not leaving.   Not until we deal with Constance. DEAN What?   Sammy.   We don’t have time. We got mo",
      "dialogue_count": 1,
      "word_count": 1587
    },
    {
      "scene_number": 6,
      "slugline": "INT. FOLSOM STATE PENITENTIARY - SERIES OF SHOTS - DAY Sam.   Getting patted down at the Registration Station. Dumping the contents of his pockets into plastic trays. Walking through a series of BARRED DOORS, that open and CLANK shut, as he passes through.   OVER which-- FOLSOM OFFICER (V.O.) You will not be allowed personal items in the visiting area.   You are not to give anything to, or receive anything from, the inmate. You are to maintain a safe distance from the inmate at all times.   You understand? INT. VISITING ROOM - AFTERNOON Sam sits at a mounted steel table.   When JOSEPH BURROUGHS, 40, enters the room.   Bland face, glasses; the “quiet neighbor” type.   He’s cuffed.   GUARDS, stationed at the walls, keep a close eye, as Burroughs sits. SAM Thank you for seeing me. BURROUGHS I don’t get many visitors.   You a law student or something...? SAM I’m writing a paper, I was hoping for some information. BURROUGHS About what? SAM Constance Weld. Burroughs TENSES.   His face hardens into granite. SAM I just need to know-- BURROUGHS I’m not talking about her. SAM I need to know where she’s buried. 44.",
      "characters": [],
      "action_text": "BURROUGHS (through gritted teeth) In a cemetery. SAM No.   Where you buried her. BURROUGHS We’re finished here. INT. MOTEL ROOM - SANGER - LATE AFTERNOON The motel phone.   Dean waits for it to ring.   He glances out the window.   The sun is setting.   Portentous storm clouds gather on the horizon.   Distant lightning. DEAN Come on, Sam. INT. VISITING ROOM - CONTINUOUS SAM You have to tell me-- BURROUGHS Guard-- SAM Someone’s going to die tonight, if you don’t tell me... BURROUGHS (stops; a beat) What? SAM Constance.   She’s out there. Killing people. BURROUGHS (waving off the guard) Sorry.   We’re okay. (to Sam) Constance is dead. SAM Look, normally at this point, I’d bust out my “truth is out there” speech, but we really don’t have time.   She’s dead, yes-- and she’s still hitchhiking.   Men are picking her up, and she’s slashing them. 45. Burroughs reacts to this-- but for now, he keeps his cards close to his chest. BURROUGHS You’re insane. SAM You’re not the first person to say so.   I know how this sounds, I do... but if I can give you some proof, will you help me? BURROUGHS And how you gonna do that? SAM (beat) Well.   For one.   I think I know what happened 10 years ago today. BURROUGHS (goes white as a sheet) How...?   I never... SAM There’s fewer and fewer days between her victims.   It’s a pattern, a countdown.   To tonight. (beat) This was the night you murdered her, wasn’t it? BURROUGHS This is a sick joke.   Constance isn’t killing people.   It’s impossible. SAM Whether you believe me or not... she is.   Because of you.   Because of what you did to her. And Burroughs SHATTERS like GLASS-- BURROUGHS I stopped her.   She can’t be doing it again.   Because I stopped her. SAM ...what do you mean? 46. BURROUGHS What difference does it make?   No one ever believes me anyway. SAM Tell me what you mean-- BURROUGHS I loved Constance. SAM You kept her locked up-- BURROUGHS No.   She lived with me, that’s all. But she liked to hitchhike.   Guys would pick her up. ",
      "dialogue_count": 0,
      "word_count": 1551
    },
    {
      "scene_number": 7,
      "slugline": "EXT. OLD HOUSE - CONTINUOUS - NIGHT And the rental car BURSTS forward.   SMASHING through the termite-ridden wall of the old house.   ENTERING the house. INT. OLD HOUSE - CONTINUOUS - NIGHT The car SNAPS a support beam, second story lumber RAINS down. INT. SAM’S RENTAL CAR - CONTINUOUS - NIGHT Sam cracks his head, sharp, against the steering wheel, as the car comes to an abrupt, dust-settling stop. INT. OLD HOUSE - CONTINUOUS - NIGHT DEAN Sam!   Sam! Dean scrambles through the newly-created opening, up to the car.   It’s wedged between a wall and a heavy fallen beam. Inside the car, Sam is weak.   Forehead bleeding.   But alive. SAM I’m okay. DEAN (extremely relieved) Where is she? SAM I don’t know. Dean looks over the room.   The storm has abated, the wind has died down, the radio’s quiet.   All seems benign. Dean tries to open the car door.   No chance. DEAN Can you move? (Sam nods, yes) Come on, I’ll help you. Sam GROANS, pained and sore.   He begins to crawl through the window.   Dean helping him.   When-- the wind.   It picks up. Tattered curtains flutter.   The RADIO.   Clicks on.   Faint music buried beneath static. DEAN Hurry. Something SKITTERS just outside their field of vision.   Dean spins, vigilant... but nothing’s there. 52.",
      "characters": [],
      "action_text": "Quick as he can, Sam evacuates the car.   Dean gets him to his feet.   Sam’s arm around Dean’s neck, they hobble for the entrance, but it’s slow going-- Another SCUFFLING sound, this one over their shoulders.   They both look back, scanning, cautious... and that’s why they don’t see... IN FRONT OF THEM-- the CURTAINS (beside their exit) BILLOW UP, unveiling-- CONSTANCE.   Blocking the way.   Putrid.   Wrathful.   Her image FLICKERS rapidly, appearing and disappearing. Sam and Dean turn forward.   Spot her-- She DRIFTS towards the brothers, the tips of her yellowed toes lightly scraping the floor planks. Sam and Dean back away.   Dean FIRES his Colt again.   No use. She grows closer.   Closer.   Eyes aflame.   Suddenly-- There’s TWO FIGURES BEHIND HER!   A decayed MAN and WOMAN, 40’s, the fronts of their shirts BLOODY from STAB WOUNDS. Constance’s PARENTS. WHISPERED ON THE WIND ...you’ve come home... They seem to envelop her.   Merging with her.   There’s a horrible, otherworldly ANIMAL SHRIEKING-- and they ALL MELT AWAY.   Gone completely.   Still.   Silence. Sam and Dean.   As they (and we) catch our collective breaths-- DEAN ...hey.   Sam? SAM Yeah? DEAN (long solemn beat; then) Good luck getting the deposit back on that rental. Dean cracks a smile.   Sam smiles back. EXT. CENTENNIAL HIGHWAY - NIGHT A SIGN.   “You Are Leaving Sanger, California, U.S.A. America’s Christmas Tree City.   Come Again Soon!” The Impala BLOWS past it. 53.",
      "dialogue_count": 0,
      "word_count": 444
    },
    {
      "scene_number": 8,
      "slugline": "INT. IMPALA - MOVING - NIGHT The brothers LAUGH.   Enjoying a rare moment of victory. DEAN ...so how’d you know that would work, anyway? SAM What? DEAN Taking her home. SAM I didn’t. DEAN Wow.   Thoughtful plan. SAM Well, I can’t believe you actually shot Casper in the face. DEAN Hey, saved your ass-- EXT. FREEWAY ON-RAMP - NIGHT The I-5 FREEWAY on-ramp.   North.   Dean cruises right past. INT. IMPALA - MOVING - NIGHT SAM Where are you going? DEAN East.   Figured we’d check out the house next. SAM The house? DEAN Our house, Chachi.   Maybe there’s something I missed.   Some bread crumb Dad left behind... When Dean glances at Sam, sees his expression.   Dean’s smile fades, as he puts it together. 54.",
      "characters": [],
      "action_text": "DEAN ...but you’re not going East, are you?   You’re going back to school. Sam nods, a little sad and a little guilty. SAM ...I’m sorry. DEAN (after a beat) I’ll take you back. SAM No, man, I can catch a-- DEAN I’ll take you back, Sam.   It’s the least I can do. Dean SWINGS the car around.   Pulling a U-turn. EXT. I-5 FREEWAY - NIGHT - SEVERAL MINUTES LATER The Impala heads back to Stanford. INT. IMPALA - I-5 FREEWAY - MOVING - NIGHT Clearly, Sam’s conscience is getting the best of him-- SAM ...look, I’m gonna call the cops, the FBI, first thing.   File a Missing Persons. DEAN Good.   It’s a good idea. SAM I mean, he could be anywhere.   We can’t just cruise the whole country, hoping we bump into him. But I’m gonna help, okay?   I’m gonna do everything I can. Dean nods.   More silence.   Sam can’t take it anymore. SAM You know.   “Passive aggressive” isn’t really your gig-- DEAN What?   Did I say anything? 55. SAM That’s just the point.   If you’re pissed, then be pissed. DEAN I’m not pissed. SAM Convincing delivery. DEAN Really.   I’m serious. SAM Well, you’re something. DEAN I’m done.   Okay? SAM What’s that supposed to mean?   Done with what? DEAN This.   These sparkling little arguments of ours.   Trying to drag you into something you just don’t want any part of. (beat) I can’t ask you to throw everything away and hit the road.   To trade in your girl and your school for bad food and mangy motels-- SAM Dean-- DEAN So go live your life, Sam.   I mean it, be happy.   I’m not gonna fight you.   I’m tired, and... SAM And what? DEAN And I just don’t care anymore... SAM (after a beat) I think I’d rather you were pissed. 56. DEAN What do you want me to say? Sam doesn’t answer.   The brothers ride in silence. INT./EXT. IMPALA - STANFORD UNIVERSITY - LATE NIGHT The Impala motors past libraries.   Classrooms.   The various signs and landmarks of the august university.   Sam watches the familiar scenery pass.   Clouded with doubt.   Is he doing the right thing? EXT. SAM’S ",
      "dialogue_count": 0,
      "word_count": 1092
    }
  ]
}