{
  "slug": "suspiria-2018",
  "title": "suspiria",
  "genre": "drama",
  "format": "film",
  "scenes_count": 21,
  "characters_count": 1,
  "characters": [
    "BLANC"
  ],
  "total_words": 25609,
  "total_dialogue": 1,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. MARKOS COMPANY, STAFF KITCHEN -- DAWN In a dim institutional kitchen stands a long, marble table with twenty chairs around it. MISS TANNER (V.O.)  Markos.  MISS MANDEL (V.O.)  Markos.  MISS KILLEN (V.O.)  Blanc!  MISS DANIELS (V.O.)  Markos!  MISS VENDEGAST (50) comes in and turns on the lights. She gets a coal fire going in the heat stove, then another in the cook stove. She fills a big enamel coffee pot. MISS BOUTAHER (V.O.)  Blanc.  MISS MILLUS (V.O.)  Markos!  MISS MARTINCIN (V.O.)  Blanc.  Vendegast sets out bowls, spoons, and mugs on the table. Mue- sli. Biscuits. Soon, other women begin drifting in. Some are still in robes, not yet showered. They go about getting their breakfasts and first cigarettes. Some chat casually. Over it all, the vote continues in v.o. Each voice is strong, decided. We may see flashes of the faces of these women dur- ing the vote, which took place the night before.   If an audi- ence expects sinister faces, they’ll be surprised: The women of our film are banal, matronly, women you see every day.  MISS HULLER (V.O.)  Markos!  MISS HOLZMANN (V.O.)  Blanc!  MADAME BLANC (50) herself comes in for breakfast. She has the long-limbed body and high carriage of a dancer, but her ener- gy is not rarified. It’s grounded, open. But she looks tired. MADAME BLANC  Good morning, everyone.",
      "characters": [],
      "action_text": "MISS MAUCERI (V.O.)  Blanc . MISS MARKS (V.O.)  Markos!  Miss Boutaher comes over to Blanc, still in her hair net. MISS BOUTAHER Were you able to sleep in a lit- tle? It was a long night. MADAME BLANC Yes, thank you. MISS BOUTAHER I’m glad. DANIELLE (V.O.)  Markos.  MISS COTUGNO (V.O.)  Blanc.  Vendegast begins cracking eggs in a bowl, one after another. PAVLA (V.O.)  Markos.  MISS KAPLITT (V.O.)  Blanc.  MISS VERDEGAST (V.O.)  Markos!  MISS GRIFFITH (V.O.)  Markos.  MISS VENDEGAST (V.O.)  Blanc!  MISS BALFOUR (V.O.)  Blanc . Blanc gets coffee and takes a seat at one head of the table and talks with Miss Holzmann. MISS TANNER (55) enters. She is smaller in stature than Blanc, but leans hard into everything to compensate. She and Blanc have a moment of eye contact. ALBERTA (V.O.)  Markos!  A beat, and then, finally:  2. JUDITH (V.O.)  Markos.  There’s a V.O. RAPPING, some ritualized version of applause. MISS TANNER (V.O.)  << Markos by three. It’s decided. Let no one’s vote be held against her. And let the will of the maj- ority proceed. Hail, Markos. >>  ALL (V.O.)  << Hail, Markos. >>  Miss Tanner takes her coffee and sits beside Madame Blanc. As casually as the others are chatting, Tanner says to her: MISS TANNER Markos is asking for you. She wants to know if everything is ready, now that we are clear to proceed. MADAME BLANC She knows my concerns about Patric- ia. But I do agree, we should not delay. Tanner nods, reassured on this crucial point. She spreads her jam on her toast. Madame Blanc gets up. MADAME BLANC (CONT’D) I’ll go and tell her now. CUT TO: EXT. BERLIN, PLATZ -- DAY A Berlin   platz   is packed with protestors SHOUTING in organ- ized rage: CROWD << Free Baader! Free Ensslin! Free Schubert! Free Raspe! We are watch- ing! We are watching! >> (beat) << Free Möller! Free Becker! We are watching all you do! >>  Polizei   observe the protest from half a block away. Some take photos. Leaves drop down on them in the grey afternoon.  3. PATRICIA (20s), skir",
      "dialogue_count": 0,
      "word_count": 1929
    },
    {
      "scene_number": 2,
      "slugline": "INT. BERLIN SUBWAY CAR -- DAY Susie has found her way onto the Berlin subway. She looks a- round, keeping her nerves in check as best she can. She sees armed   Polizei   at various stations watching clusters of youth, both with attitudes like battering rams. EXT. BERLIN SUBWAY STATION, STAIRS -- DAY Susie is on the stairs hurrying out of the subway, asking for directions. A woman with too much lipstick half-helps her. SUSIE  Pohlstraße--?   It’s this way--? Susie has a rural American accent: Southern Ohio, which is almost West Virginia, but not as thick. She lacks sophistica- tion, but makes up for it with bravery. EXT. MARKOS COMPANY -- DAY Susie finally arrives outside a huge old janus of a building-- two brick volumes fused down the center, one taller than the other by several floors. It could be a factory, a school, or an austere sort of hotel, but the stonework over the entrance simply reads “Tanz.” Dance. Dead leaves cartwheel around her. Susie stands a moment look- ing up at the building, gathering herself. Then she goes in. INT. MARKOS COMPANY, ENTRANCE HALL -- DAY Susie comes in and finds the entrance lobby empty. She looks up at the several floors of balustrades above her. She hears DRUMMING coming from somewhere in the building--a slow SYNCO- PATED BEAT--and the SQUEAKS and EXERTIONS of PEOPLE DANCING. A voice CALLS OUT DANCE CUES. There is a KNOCKING ON GLASS and it takes SUSIE a moment to see MISS TANNER hailing her from an interior window of the of- fice, which looks out onto the entrance hall. INT. MARKOS COMPANY, OFFICE -- DAY Susie comes in. Miss Tanner, made up now for the day, is all business. Something is wrong at the company today. Susie be- gins to feel it everywhere. SUSIE Miss Tanner--?  9.",
      "characters": [],
      "action_text": "MISS TANNER Miss Bannion, I’ve been trying to reach you at your hotel. To tell you not to come. SUSIE Not come? Why--? MISS TANNER Something has come up at the company just today. I was hoping you could reschedule. A beat. Tanner waits for Susie to offer to postpone it her- self, but Susie just stands there, panicked. Tanner sets her jaw. The secretary, MISS GRIFFITH (50s), is there typing some- thing, her back to Susie. In a small mirror on the desk, Su- sie can see, though, that Miss Griffith is crying. Miss Griffith’s reflection looks back and she shifts in her chair to cut off the reflection. MISS TANNER (CONT’D) Very well. I have a room where you can change and get warm. I’ll call the panel down-- CUT TO: INT. MARKOS COMPANY, CHANGING ROOM -- DAY Susie has changed into a dance leotard and sits, doing some stretches. She tries to manipulate her breathing to calm her- self. It’s intense to watch her try to control her own body this way. It seems to work. She must be closer to the practice rooms now, because the DRUMS and DANCE CUES are louder here. Susie closes her eyes. She wants this so badly. We see a succession of images of rehearsals going on in prac- tice halls, but it’s unclear if Susie’s imagining them. INT. MARKOS COMPANY, “WHITE” STUDIO -- DAY Susie comes into a small audition room where Miss Tanner sits at a table with MISS MILLIUS (50) and MISS MANDEL (30). They all say hello, but they, too, are subdued. Susie holds a cas- sette tape in her hand.  10. MISS TANNER Miss Millius and Miss Mandel are the company’s   répétiteurs . Susie surprises them by asking, directly: SUSIE And Veva Blanc? MISS TANNER As I said, Madame Blanc is occupied now. Susie’s disappointment is clear. SUSIE But I was told-- MISS TANNER Dear. You have no formal training or references. Madame Blanc took your   insistance   to come   encourag- ingly. That’s why you’re here at all. Tanner is not being cruel, just clear. A beat. Susie nods. MISS MILLIUS (re: the tape, kindly) We prefer",
      "dialogue_count": 0,
      "word_count": 1577
    },
    {
      "scene_number": 3,
      "slugline": "INT. HOTEL PFAU, SUSIE’S ROOM -- NIGHT A storm is coming down hard and with THUNDER. Susie is in her hotel window looking down to the street. A taxi pulls up. Sara, the dancer from the corridor, gets out. EXT. HOTEL PFAU -- NIGHT Sara looks up at the hotel and sees Susie. She waves. Susie waves back, already running to get out of the downpour. INT. HOTEL PFAU, SUSIE’S ROOM -- NIGHT Sara comes in soaked. She’s clearly from money. She doesn’t overtly advertise this. Her clothes   are   lovely, but it’s more in the way she carries herself. SARA I’m sorry I’m late. It’s the rain. Whenever it rains, everyone in Ber- lin jumps in a cab. And like an mo- ron, I just let ours go. It’ll take an hour to get another one now. Oh I’m Sara. We’ll have to take our chances in the street. You have an umbrella? Susie shakes her head. SARA (CONT’D) (looking around) That’s okay. We can borrow one from the hotel if they have them. But Susie’s luggage is still open on the floor, things every- where. SUSIE When you weren’t here by six I had to take the room for another night. SARA I’m so sorry! Everything was a mess at the Company today. (off Susie’s look) Why are you smiling? SUSIE  Berlin.   You said “everybody in Ber- lin” a second ago and I thought: That includes me now. I live here now. Sara smiles at Susie’s guilelessness.  15.",
      "characters": [],
      "action_text": "SARA Yes. Congrats. I heard you here a sensation today. Susie shrugs, happy. There’s a roll of THUNDER. SARA (CONT’D) I should maybe go before this gets worse, then. I’ll come back in the morning? SUSIE If it will be so bad getting a cab, sleep here if you want. We can push the beds apart. I have an extra nightgown-- Sara considers the invitation, surprised and moved by Susie’s openness. SARA We’ll miss dinner, but we can order room service. To celebrate! (intuiting) On me! As a “welcome to Berlin.” CUT TO: They finish plates of meatballs and   Jagerschnitzel.   They also ordered big German beers, which they’ve drunk. The storm out- side has gotten worse. The power goes out for a moment, then comes back on. SARA (CONT’D) Have you called your family yet, to tell them? Sara is a little drunk. The nightgowns are almost comically conservative. Sara looks at the stitching and sees: it’s hand sewn. SARA (CONT’D) Did you tell me where you’re from? SUSIE Tell me about Madame Blanc! She came into my audition, but she left right after. The lights go out and this time they don’t come back on. Lightning occasionally brightens the windows, giving them dim light.  16. SARA She’s incredible. The way she trans- mits her work, her energy. When it shines on you, it’s --addictive, is the word for it. And she’s tough-- She kept the company alive through the war--think about   that --when the Reich just wanted women to shut off their minds and keep their uteruses open, there was Blanc. (beat) -- La vraie chose!  SUSIE Is that French? I don’t even know! There is a SUDDEN DETONATION outside nearby, markedly differ- ent from thunder. It shakes the glass. They run and open the window to look. It came from down the street. They can’t see from this angle, so Sara leans out, into the rain. SARA I can smell it. A bomb. SUSIE A bomb?! Susie keeps her from falling out. Police SIRENS are coming. SARA There’s a bank that way. She comes back into the room, looking at Susie. SARA (CONT’D) Don’t you k",
      "dialogue_count": 0,
      "word_count": 1192
    },
    {
      "scene_number": 4,
      "slugline": "INT. FRIEDRICHSTRAßE STATION, CHECKPOINT -- DAY Klemperer is in line to show his papers at the police check. He is waved through and heads up the stairs into the Russian Sector. One of the armed guards also gives Klemperer a nod, as to a familiar face. EXT. EAST BERLIN, FRIEDRICHSTRAßE -- DAY Klemperer continues down the avenue two blocks. East Berlin is visibly still on its knees from the war, even years later. The rubble and the decay, has the feeling of having been tid- ied, but not yet confronted. He turns off and walks toward a small cobbled corner of an otherwise nondescript intersection. There is a small fountain in the stonework, but nothing comes out of it. There is a ma- sonry bench there just wide enough room for two people to sit at the lip of its dry bowl. Klemperer takes a seat there. We are witnessing a habit, a ritual, possibly a daily occur- rence. He says out loud, to no one, like a mantra: KLEMPERER  <<   And maybe today, my love.   >>  Then he opens his paper and begins eating his breakfast out of a waxed paper bag he’s brought with him. CUT TO: INT. KLEMPERER’S APARTMENT, ENTRYWAY/SITTING ROOM -- DAY Klemperer returns to his apartment to find: No one is wait- ing. He lets himself in. INT. KLEMPERER’S APARTMENT, ENTRYWAY/KITCHEN -- DAY At some point, Klemperer’s housekeeper, FRAU SESAME (50s) lets herself in the front door. She sees the door to Klemper- er’s sitting room is open and he is sitting inside alone. She immediately begins chatting while she takes out her cleaning bucket from under the sink. FRAU SESAME << They're out again today, Doctor. For the prisoners. Do you think it will end today? >> INT. KLEMPERER’S APARTMENT, SITTING ROOM -- DAY Klemperer is not listening. He is looking at the bags Patri- cia left behind. They’ve been moved to the corner.  20.",
      "characters": [],
      "action_text": "He goes to them. He unzips the duffle and begins looking through it. Clothes. Boots. Then a notebook. He hesitates, and then opens it. It is near full with entries, drawings, hand-drawn maps. He begins reading. CUT TO: INT. MARKOS COMPANY, STAIRCASE -- DAY Susie and Sara carry Susie’s luggage up to the third floor passing the mirrors Susie saw the day before. She’s now re- flected in them from just below. INT. MARKOS COMPANY, RESIDENCE CORRIDORS -- DAY They come into a corridor of dormitory-type rooms. Some of the girls are stealing a few moments in their rooms between breakfast and rehearsal. When Susie appears on the floor, a few come out and introduce themselves. Susie smiles at them, greets them. One older dancer, OLGA (40), who is on a telephone, hears what’s going on and steps out to look, but as soon as she sees Susie, she dismisses her and goes back to the argument she was having on the phone. OLGA (O.S.) Why don’t you try speaking to me like you love me for a change --  Sara rolls her eyes and brings Susie to the end of one cor- ridor, pointing out as they pass a room at the end: SARA That’s my room-- The hall turns right, then right again revealing a parallel corridor, also with dorm rooms. Susie’s is first. They go in. SARA (CONT’D) We’re sort of neighbors. SUSIE I’m glad. SARA Settle in. I’ll tell Ms. Vendegast we made it. Rehearsal isn’t for forty minutes. Listen for the bell. (off Susie’s nod) Knock on the wall if you need anything, okay? I’m right on the other side.  21. SUSIE Sara-- Sara turns back. SUSIE (CONT’D) (re: the room) Is this--? SARA  No.   Olga took Patricia’s room. It’s the biggest. She said she needed the space. (sotto) She’s Russian. With that, Sara goes. Susie looks around the room, excited. It’s simple: A bed, a dresser, a desk, an old-fashioned stand with a basin and mirror. But no windows. It’s an interior room inside the center of the building. She has an odd moment of settling into the space, of hearing her own breathing. She pul",
      "dialogue_count": 0,
      "word_count": 2497
    },
    {
      "scene_number": 5,
      "slugline": "INT. MARKOS COMPANY, “IRIS” STUDIO -- DAY Susie is giving the dance everything she has. It is violent and beautiful to watch. Blanc shoots out a hand and snaps to  Danielle , hissing: BLANC  Keep up--  Miss Tanner is watching, arms folded, like a proud Papa. MISS TANNER (in a whisper)  Brava brava brava -- The force of Susie’s movements is being intensified exponenti- ally somehow and transferred to Olga. INTERCUT between the two studios: We watch Susie move through the rest of the solo. Olga moves from being beaten to being pulverized. As muscles are separa- ted from bone, and bones are broken, her silhouette becomes increasingly uncanny. We see Olga’s, Susie’s, and Blanc’s eyes in close up. Olga is in trauma, Susie is in ecstacy, and Blanc has a melancholy in her expression. She takes no joy, apparently, in this   via do- lorosa.  Olga’s form ceases to look human, though it is not yet finish- ed being alive. Finally, Susie finishes the dance and has to sit immediately on the floor to keep from vomiting. For a moment no one helps her, so astonished are they. Then Blanc get down on her knees at Susie’s side. INTERCUTS END. BLANC It’ll pass. You’re not the first dancer to lose the room. SUSIE I’m not usually dizzy. BLANC It’s my fault. I couldn’t help my- self. Sara-- take her upstairs now. She can spend the day there. (getting up, to Susie) A collapse is a vocational hazard I’m afraid.  30.",
      "characters": [],
      "action_text": "SUSIE I didn’t collapse. BLANC You’re on the floor. And that’s not how the dance ends,   cher . Susie gets up on her own. She’s defensive for some reason. SUSIE I was trying not to throw up in your studio. BLANC Susie, it’s all right! It was won- derful. I’ll send Miss Vendegast with your lunch early. You’re pro- bably jet-lagged as well. Sara and Susie head for the door. When they are out of ear- shot, Sara whispers: SARA That was fucking   incredible -- The other girls all watch them leave. Madame Blanc says to Miss Tanner, lightly: BLANC What a surprise. Olga always made that piece look like such heavy lifting. The comment has its intended effect. The girls look inspired. CUT TO: INT. MARKOS COMPANY, SUSIE’S ROOM -- DUSK Susie is in her room, unpacking. She looks a little hollowed out from the events of the afternoon. She can hear the other girls going about their evening rou- tines. Someone is hanging a poster. There is HAMMERING. She can hear her own name now and then as well, but not what’s being said about her. She steps to the closed door to listen, but there is a KNOCK and Miss Vendegast comes in with a tray of lidded plastic cups. All have been labelled with initials. Most are full of urine. MISS VENDEGAST How are you feeling, Susie?  31. Miss Vendegast hands her a cup with her initials on it. MISS VENDEGAST (CONT’D) We do this several times a year. Unannounced. I need you to fill it. SUSIE I just went a little while ago-- MISS VENDEGAST Half is fine. Susie takes the cup and goes into the little WC in the hall. She closes the door and gets ready to try to fill it. Miss Vendegast hums to cover the noise. INT. MARKOS COMPANY, RESIDENTS’ WC -- DUSK Susie holds the cup and tries to pee. The WC is tiny. MISS VENDEGAST (O.S.) I’ve also brought the residency forms we’ll need you to read and sign. I leave them in your room-- Then memory comes to Susie, forcefully: CUT TO: EXT. OHIO FARMHOUSE -- DAY Work is being done on the house, shingles are HAMMERED into place.",
      "dialogue_count": 0,
      "word_count": 1026
    },
    {
      "scene_number": 6,
      "slugline": "INT. KLEMPERER’S APARTMENT, SITTING ROOM -- DUSK Dr. Klemperer sits in his office, staring in the middle dis- tance. The last light in the sky is fading. The framed photo of his wife smiles at him. He’s got Patricia’s pale notebook open on his desk. We see names we know--M. BLANC, SARA, OLGA, HELENA MARKOS-- and names we do not. It is also jammed with little exhibits from Patricia’s life--ticket stubs from concerts, newspaper clippings about terrorist actions around Berlin, more than a few programs from dance performances. One section has drawings of some iconographic symbols, as if from some vulgar religion. It is this symbology that unset- tles Klemperer most. He closes the notebook and picks up the phone. He dials. VOICE ON PHONE << Police. What is the nature of your call? >> Klemperer looks on the verge of hanging up, but he does not. KLEMPERER << I’m reporting a young woman who may be missing. >> VOICE ON PHONE << Hold the line. >> CUT TO: INT. MARKOS COMPANY, STAIRS AND CORRIDORS -- NIGHT Miss Vendegast guides Susie down two flights of stairs and into the staff section of the building. They talk along the way, but the acoustics of the building muffle it. Miss Ven- degast knocks on Blanc’s door. After a moment, Blanc answers, wearing now a Japanese silk tunic. She is smiling when she opens the door, but when she sees Susie, it fades. BLANC You don’t look better. Or are you this pale all the time--? Blanc nods at Miss Vendegast, who goes, and lets Susie in. CUT TO:  34.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 268
    },
    {
      "scene_number": 7,
      "slugline": "INT. MARKOS COMPANY, BLANC’S OFFICE -- NIGHT Madame Blanc’s office is a Beaux-Arts beauty. Its curved walls are painted with a long Japanese garden. A small table is laid with dinner, which Susie and Blanc are finishing. An arch leads into a dark, smaller circular room that must be Blanc’s private studio. Light from the office glints off some kind of lacquered screens there. BLANC It’s different from being Amish, then? SUSIE Yes. The Amish split from the Menno- nites in the 17th century. BLANC Why? SUSIE They worried the Mennonites were be- coming too liberal. But they still believe many of the same things. BLANC Such as? SUSIE Adult baptism. Plain clothing. Non- resistance. BLANC “They”? Not “we”? Have you left re- ligious thinking behind you? Susie offers a small nod. BLANC (CONT’D) Oligarchs writing for patriarchs. (beat) You don’t like to talk about this. SUSIE I don’t know why we are. BLANC I find it hard not to be curious about you. In two days you’ve man- aged to audition, be accepted, and dance a lead. Blanc smiles.  35.",
      "characters": [
        "BLANC"
      ],
      "action_text": "How did it feel to dance Volk today in front of the one who made it? SUSIE I don’t know how to put it-- BLANC Actually, don’t. That’s a vain question. Let me ask a different one: While you danced it, what was happening inside you-- in your body? Susie thinks. SUSIE It felt like what I think it must feel like to fuck. BLANC (curious, but unfazed) Do you mean fuck a man? SUSIE No. I was thinking of an animal. BLANC You looked joyful. In pain, but in joy as well. Susie nods. A long beat. Blanc smiles, sincerely. BLANC (CONT’D) We don’t teach dance here, Susie. We assume dancers come trained. You are not. I don’t exactly understand  what   you are yet, but I will ask Ca- roline to help you with your jumps and leaps. Yours are nowhere near good enough yet. We must build you up now. SUSIE So I can dance the VOLK protagon- ist when you perform it? A beat. Blanc leans back in her chair. BLANC I’ll have to see you do that level of dancing again and again. The sim- plicity of the choreography is an illusion. It’s intuitive to watch and painful to do.  37.  BLANC (CONT'D)  (MORE) We perform next month. I’ll have to grind you to get there in time. SUSIE I can do it. BLANC I don’t have many options, actually. And I’d rather have some- one on who’s messy, but alive than another Olga. She was a   matryoshka  doll with legs. I’m relieved she’s gone. (beat) Thank you for your help in that. Blanc watches Susie’s reaction closely, but there doesn’t seem to be any complicity in it. Just grateful excitement. INT. MARKOS COMPANY, SUSIE’S ROOM -- NIGHT When Susie gets back to her room, Sara pokes her head in. Susie motions her to come in and close the door behind her. She grabs Sara’s hands. SUSIE I didn’t know it was going to be like this! She’s so nice. (beat) And she wants me to dance in VOLK. The protagonist! Sara nods, but with less energy than Susie was expecting. SUSIE (CONT’D) Are you okay? SARA Yes. I’m fine. I was just thinking about Olga. --About what she said today. Susie reme",
      "dialogue_count": 1,
      "word_count": 1778
    },
    {
      "scene_number": 8,
      "slugline": "INT. CORRIDORS, MARKOS COMPANY -- DAY They come silently back out into the corridor. As they turn to head back, another BURST OF LAUGHTER comes from a back of- fice. There is something mocking in it. Susie takes a step away from Sara to look discreetly around the next corner. Through a door that’s half open, Susie can see through one office into the next. SUSIE’S POV:   Detectives Halle and Moser stand expressionless and naked before Miss Tanner, Miss Huller, and Miss Vende- gast, their cocks hanging out. Moser’s body is paunchy, with a scar from a bullet wound on his side. Halle has tattoos like a longshoreman and traces of an athletic past lost to beer and schnitzel. Miss Huller steps into view behind Ven- degast and Tanner. The women recline in their chairs, chat- ting over what they like.  AN IMAGE flashes in Susie’s head next:   Detective Halle raised up in some kind of web. His mouth is covered with it, so he is silent. He hangs in a restless void, in some kind of sus- tained animal release.  Susie steps back out of view, jolted by these images. Sara hasn’t seen what she’s seen, so Susie steers her back toward the staircase to the first floor. Susie looks back once, but says nothing. CUT TO: INT. MARKOS COMPANY, “IRIS” STUDIO -- DAY Susie and Sara are in rehearsal. Caroline smokes between them. Madame Blanc is walking among them. Miss Mandel and Miss Millius are also there. BLANC Now that you’re warmed up, I want to tell you some news that might ex- cite you: In addition to putting on VOLK this fall, we will start work- ing on something new. Of my own. This causes a frisson of excitement among the dancers. BLANC (CONT’D) And there’s no protagonist in this dance. Instead, we have five equal main parts, and an equal number of secondary parts. Today, we’ll im- provise, by my direction, with Mis- ses Mandel and Millius.  43.  (MORE)",
      "characters": [],
      "action_text": "Caroline, Sonia, and Sara also come up. You are the five. Caroline, Sara, and Sonia step forward. Susie watches, wait- ing, already knowing there will be something for her. BLANC (CONT’D) Susie you will improvise with no direction. I’m interested in your instincts here. Consider yourself a  radical libre , moving around the others as you choose. Susie comes forward. Everyone around her is experiencing a shift in attitude about her. The creator has chosen her muse and, as members of a company, the others must abide. But one can feel how badly they wanted it to be them, to be close to Blanc, and if not her, than close now to Susie. BLANC (CONT’D) There are basic nine movements to use. Miss Mandel will show you-- SUSIE What is the piece called? BLANC “ ÖFFNEN WEIDER .” “OPEN AGAIN.” CUT TO: All six dancers are in motion. The five principals are in a formation, a kind of rotating crown, pulsing in and out. Susie darts among them. Within her improvisation, she finds herself paying increasing attention to the floor. She comes to one particular spot, dances over it, comes to it again. Finally, she finds herself reaching out to it, touching the spot, putting her torso on it, then her face. It’s strange. Blanc is watching her closely, wondering what could be prompt- ing this. Then it dawns on her. She shoots a look at Tanner, who levels a mildly defiant look back. Then Blanc looks back at the spot on the floor. INT. MARKOS COMPANY, BLANC’S OFFICE -- DAY Blanc has brought Miss Tanner to her office. She is enraged. BLANC << You should have told me. >>  44.  BLANC (CONT’D) MISS TANNER << Why? Mother wanted it. She wanted to feel Susie for herself. Be in the same space. >> BLANC << I thought we agreed to stop using that title. >> MISS TANNER << Markos is and will always be our Mother. >> BLANC << It’s offensive. If Markos was truly a Mother, we wouldn’t need to save her life. >> MISS TANNER << You should have told her about Miss Bannion yourself. Now Mother wants her. >> BLANC <",
      "dialogue_count": 0,
      "word_count": 831
    },
    {
      "scene_number": 9,
      "slugline": "INT. STAIRWAY/RESIDENTS’ CORRIDOR, MARKOS COMPANY -- DAY After rehearsal, Susie and Sara walk back to their corridor. Susie is a little disturbed. SARA Something in the sequence-- the ones-to-twos. I’ve never seen her use those moves that way before. (beat) It’s exquisite. The whole thing. SUSIE Did anything--   happen   to you dur- ing it? SARA What do you mean? SUSIE You didn’t feel someone there? SARA Someone? Susie considers this. She says, more to herself. SUSIE It was Markos. A beat. Sara looks at her. SARA What made you say that? SUSIE I don’t know. SARA (louder than she means) So why say it? SUSIE I didn’t mean to make you upset-- SARA It’s just-- (beat) It’s the sort of thing Patricia would say. Don’t start bugging out at nothing, too. I couldn’t handle it. They get to their floor and stop at the top of the stairs.  46.",
      "characters": [],
      "action_text": "Suddenly there is a SCREAM in one of the room. EXCITED PANIC. Sara and Susie go toward it, alarmed. They see girls racing to their rooms. SARA (CONT’D) What’s going on?! One of the dancers, MARKETA (20s), tells them, breathlessly. MARKETA Bowie’s doing a surprise concert tonight at SO36!   For “Helden”!   It was just on the radio-- (almost hysterical) If we stand a chance of getting in we’ve got to go now! Sara runs for her room. Sonia and Caroline come marching down the hall in ruffled coats, all glossed up now. Sonia screams: SONIA  “THE FUTURE BELONGS TO THOSE WHO CAN HEAR IT COMING!!!”  CUT TO: INT. CLUB SO36 -- NIGHT The girls are crammed into the intimate venue, under racks of hot lights, thirty feet from DAVID BOWIE (30), who is in the middle of “Beauty and the Beast.” DAVID BOWIE  That’s my kind of highroad, gone wrong. My-my, smile at least. You can’t say no to the Beauty and the Beast.  The crowd is hopping up and down the beat, more of less in unison. The others are ecstatic, but Susie is having trouble staying in the moment. She’s hearing BREATHING, SIGHS, even here. DAVID BOWIE (CONT’D)  Something in the night. Something in the day. Nothing is wrong. But something’s in the way.  She covers her ears, but the SIGHS remain. CUT TO:  47.",
      "dialogue_count": 0,
      "word_count": 377
    },
    {
      "scene_number": 10,
      "slugline": "EXT. BERLIN, STREET -- NIGHT The girls walk home from the concert, excited, sated. They come to a   platz   across which they can see cafes. Sara notices the dance matrons sitting outside one and points. THEIR POV:   Madame Blanc, Miss Tanner, Miss Millius, Miss Man- del, Miss Huller, Pavla, Miss Vendegast, and a few others, are gathered around cafe tables pushed together, having an ev- ening as well. They are brazenly unfashionable. All of Berlin goes on around them, taking no notice.  EXT. BERLIN, CAFE -- NIGHT None of the women turn to look at the girls across the street, but they know they are there. Madame Blanc tells the others: BLANC << It’s good for her to see us like this. That we’re still part of the world. >> MISS TANNER (casually) << She’s already seen a lot. >> MISS MILLIUS << Seen with her heart. Maybe she even senses what’s coming. It’s not far off now. >> MISS MANDEL << What about the witness? It is not too early to discuss this. Who’ll be our witness there? >> MISS MILLIUS << One of our new friends from the  Polizei ? >> MISS HULLER << I like the younger one. >> They laugh all over again. Miss Huller is a bit more serious about the question. MISS HULLER (CONT’D) << We’re forgetting. We already have a witness. >> CUT TO:  48.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 233
    },
    {
      "scene_number": 11,
      "slugline": "INT. MARKOS COMPANY, SARA’S ROOM -- NIGHT The muffled sound of WOMEN LAUGHING, returning from a night out, can be heard in Sara’s room. Sara is not quite asleep. She hears it. It sounds like it’s coming from the opposite direction than the hallway, though. INT. MARKOS COMPANY, SUSIE’S ROOM -- NIGHT Susie is deeply, almost hypnotically, asleep now, deep in a dream. INT. MUTTERHAUS, THE ROOM OF HOLES -- NIGHT (DREAM) Susie is naked, sitting on the floor, legs spread, knees up, chest-to-back in a tight line with the other girls. She can’t move her arms. She looks and sees the floor is full of smooth holes cut out of the wooden studio floor. Women are reaching up from below through the holes to hold the girls’ wrists so they cannot get up. The room is enormous and dim, but Susie can see other matrons around them, staying a few steps back. The other girls are getting increasingly panicked. Some are crying, begging to be let free. A sound is in the room with them. A wet, diseased breathing. At the front of the line, a woman floats forward. She is three feet off the ground. She spreads her robes and her hea- vyset, aged torso can be vaguely seen in the dark. Something is dripping from between her legs. As she levitates over the first girl--robes sliding over the girl’s shoulders--the girl turns her face away from the dripping coming from above, re- pulsed and afraid. So does the next girl, and the next. The women on the periphery are chanting in the whisper: WITCHES  “Mother Is! Mother Is! Mother Is!”  Susie is trying to fight down her own panic. She’s shaking. The Mother approaches just overhead. Susie makes a decision: She throws back her head, opens her mouth, sticks out her ton- gue to receive the blood. BACK TO: INT. SUSIE’S ROOM, MARKOS COMPANY -- NIGHT Susie shouts, with urgency and defensiveness: SUSIE  I know who I am. I KNOW who I AM!  49.",
      "characters": [],
      "action_text": "Sara is suddenly there, shaking Susie awake. SARA It’s all right. It’s all right! Susie is awake in a snap, able to separate things quickly. Caroline and another dancer, DOLL (30) stick their sleepy faces in as well. CAROLINE Is she all right? SARA Just a nightmare. DOLL The Markos Company special. I’m surprised it took this long. They disappear from the door. SUSIE I’m sorry. I’m-- Did I wake you up? SARA I was coming back from the toilet. You scared the hell out of me, though. (beat) Move over. A beat before she realizes Sara is serious. Susie scoots over to make room in the bed. SUSIE I never had a sleepover. Just my sisters-- SARA Well, we’re sisters now aren’t we? Sara closes her eyes, happy, and tries to fall back into it. SUSIE First one back to sleep wins. Susie keeps her eyes open, alert. She’s jolted. And learning. CUT TO: EXT. EAST BERLIN, FRIEDRICHSTRAßE -- DAY Klemperer sits at his small fountain in the stonework, finish- ing his breakfast ritual. He gets up and says to the air:  50. KLEMPERER << Tomorrow, then. >> INT. TRÄNENPALAST -- DAY Klemperer waits to come back into West Berlin in the Soviet- run “Palace of Tears,” named so for all the tearful goodbyes of family, friends, and lovers separating again to two sides of a wall that may not permit any further reunions. Klemperer, who does not have this particular kind of tears, just waits to be let through. INT. BUNDESKRIMINALAMT, WAITING AREA -- DAY Back in West Berlin, Klemperer waits in the reception area of a   Federal Criminal Police Station . The waiting room is pack- ed. A TELEVISION hanging from the ceiling shows footage of the hijacked Lufthansa at yet another airport. Now it’s in Mogadi- shu. Klemperer sits in front of a row of posters with a BKA logo at the top and the headline “TERRORISTEN.” They feature pho- tos of dozens and dozens of men and women, some with names, others with question marks. Some are crossed out. There’s a photo that looks a   lot   like Patricia, which is not crossed o",
      "dialogue_count": 0,
      "word_count": 2453
    },
    {
      "scene_number": 12,
      "slugline": "INT. BERLIN, CAFE IN THE TIERGARTEN -- DAY Sara has accompanied Dr. Klemperer into the   Tiergarten   where they sit at a window table that looks out onto the park. ON A TV: The news is showing Lufthansa flight 181 on the air- strip in Mogadishu. The dead body of one of the hostages is unceremoniously tossed down to the tarmac. The other patrons in the restaurant are watching this, their backs to Klemperer and Sara. KLEMPERER She said she was going to come back for you. That she’d left a note-- Sara shakes her head, touched even in her confusion. SARA I don’t know what to make of any of this. I know the kind of thing she was involved with, but I don’t see how any of it could be happening in- side the   company . KLEMPERER She describes it in terms of a revo- lutionary movement in a moment of crisis. A crisis of leadership, and mandate. Stay underground, or come out in force. Stasis, reinvestion, or extinction. SARA I   live   there. I have friends there. I don’t see any evidence of this at all.   (beat) No one has ever approached me, or any of the other girls as far as I know-- KLEMPERER Read this. Klemperer takes out Patricia’s yellow notebook. He turns to a particular passage and waits for Sara to read it. She does, and then looks up at him in surprise. SARA But this says “witches.” Klemperer puts his hands together, as if grounding himself.  59.",
      "characters": [],
      "action_text": "KLEMPERER Mother Markos.   Mother Meinhoff.  Dance rehearsal, political action, paranoia. In Patricia’s life, these things were of equal influence. And that is how transferences happens, how delusions are made. A delusion is a truth that tells a lie, Sara. (beat) Patricia’s fantasies might have been her way of processing another form of oppression or intellectual manipulation. SARA The company is a --family. There’s a lot of love there. KLEMPERER Love and anarchy have lived in the same houses for centuries. They are forever friends. SARA I sorry. I don’t see this. KLEMPERER There may be things the police missed. Patricia talks about whole secret parts of the building. Actu- al   rooms   that are hidden-- Sara looks at him, putting something together. But she dis- misses it immediately. KLEMPERER (CONT’D) --where a chapter could meet, or a cell could use as its base. But Sara gets up and collects her purse. KLEMPERER (CONT’D) Miss-- SARA I don’t want to be disrespectful, Doctor. I don’t. But you’re asking me and I’m telling you: It’s a dance company. We are not talking about anything else. I’m sorry. KLEMPERER Look harder.  60. SARA Thank you for caring about Patric- ia. But I hope you don’t come again. She leaves. Klemperer can’t run after her, so he is forced to watch her stride off. She doesn’t look back. EXT. BERLIN, TIERGARTEN -- DAY Sara walks far enough away to be out of Klemperer’s view be- fore she slows down again. She rubs her neck, looking very unsure and alone. CUT TO: INT. MARKOS COMPANY, BASEMENT LAUNDRY ROOM -- DAY Sonia and Doll are in the company basement using the washing machines in the costume department to do their personal wash. Caroline is with them, back on her feet. They are talking o- ver the NOISE of the machines. DOLL If they aren’t already, they will be. I’ve never see Blanc take to a girl like this. CAROLINE Still, she   is   good. DOLL She’s good, but she’s a   péquenaud . SONIA I heard she’s from some kind of re- ligious family. From ",
      "dialogue_count": 0,
      "word_count": 1394
    },
    {
      "scene_number": 13,
      "slugline": "INT. MARKOS COMPANY, “MIRRORED” STUDIO -- NIGHT She closes up the door and makes sure it’s flush with the mirrored panel beside it. Then she hides the silver hook in her nightgown, turns off the light and goes out. CUT TO: EXT. BERLIN, STREETS -- DAY On the street, Berliners heading to work watch TELEVISIONS in a display window. A German Special Forces unit boarded Luft- hansa flight 181 in the night, killed three of the four hi- jackers, and apprehended the last. The hostages are in the air again, this time heading home to Germany where they will be received with a heroes’ welcome. INT. BERLIN, OFFICES -- DAY Workers who have arrived early to their offices are gathered around TELEVISIONS there when the news breaks that all of the RAF prisoners at Mannheim Prison were just discovered dead in their cells after an apparent “suicide pact.” INT. MARKOS COMPANY, SONIA’S ROOM -- DAY Dancers from the company are watching this news in their pa- jamas, on a TELEVISION set Olga left behind. Some are crying. Sonia says, to no one: SONIA That’s it for Hanns-Martin Schley- er. They’ve got no reason to return him alive now. Susie is the first to notice: SUSIE Where’s Sara? CUT TO: EXT. FRIEDRICHSTRAßE -- DAY Sara is following directions she’s written out. She turns off a main street and into the little alley that ends at Klemper- er’s building. INT. KLEMPERER’S APARTMENT, KITCHEN -- DAY Sara and Dr. Klemperer are in his study. Every now and then Frau Sesame glances at them, but they’re far away and speak- ing English. She sees Sara take an odd silver hook out of her backpack.  64.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 282
    },
    {
      "scene_number": 14,
      "slugline": "INT. KLEMPERER’S APARTMENT, SITTING ROOM -- DAY Sara is listening to Klemperer intently. KLEMPERER She wrote of “Three Mothers” lost to time, predating all Christian in- vention. Pre-Devil. They are the source of all energy and chaos: Mother   Tenebrarum , Mother   Lachryma- rum , and Mother   Suspiriorum . Dark- ness, Tears, and Sighs. SARA I saw likenesses of them in the room last night. In porcelain. Very  fine   things. They have money. KLEMPERER Patricia named Markos as a devotee of the Three Mothers, and who, in fact, thought she was one of them for a time, but who is now ill and dying. Sara bites her thumbnail. She sees the photograph of Klemper- er’s wife on the bookshelf. She takes it in, then looks away. KLEMPERER (CONT’D) Patricia thought they were trying to recruit her. Groom her. For a place in the matriarchy. That is how Patricia described their goal: Change violent enough to take us back to a time of matriarchies. The question was whether to enact this change in moderation from the sha- dows, or step into a new era of pub- lic work and constant recruitment. She talks about “Markosites” who were for the formers and “Blanc- ites” who were for the later. SARA (horrified, disappointed) Madame Blanc is involved in this? Sara looks at the silver hook now lying on the table. In the full light of day, it just seems bizarre. SARA (CONT’D) Do   they   think they are witches?  65.",
      "characters": [],
      "action_text": "KLEMPERER I do not believe in magic. People can organize themselves to perpe- trate an evil and call it magic. That I can believe. And you can give someone your delusion. That’s religion-- That was the Reich-- (beat) The Reich had these things, too. Esoteric insignia. Esoteric ritual. The important thing is that what you found points to some kind of un- derground organization inside the company. These three “Mothers” could simply be code names for founding members, their histories metaphoric. (beat) I think you’re living with very dan- gerous people, Sara. Incindiaries. SARA Then Patricia could still be in there. In the building, I mean. They could be holding her-- KLEMPERER I cannot promise the authorities will come to look at a closet full of porcelain and one locked door. Not this week, of all weeks. So stay safe. Alert. Until they come. Sara begins to gather her things. Klemperer puts a hand on her arm. KLEMPERER (CONT'D) (re: the hook) In fact, leave this here, or put it back. But don’t let them find it on you, Sara. Sara thinks it over. She stands and shakes Klemperer’s hand. She leaves it on the table and goes. EXT. BERLIN, PLATZ -- DAY Heading home, Sara skirts another protest. This one is get- ting out of control. The police are no longer at a distance taking photos. They are at attention with riot shield and guns ready on their hips. The crowd waves photos of Baader, Ensslin, and Raspe. They’re all screaming:  66. CROWD <<   MURDER!!! MURDER!!! MURDER!!!   >> CUT TO: INT. MARKOS COMPANY, MAIN STAGE -- DAY The tech team, led by MISS KAPLITT (50s), is building the set for the production of VOLK. Lighting is being rigged and test- ed. A small house orchestra is rehearsing. INT. MARKOS COMPANY, DRESSING HALL -- DAY The dancers are getting fittings and haircuts in preparation. Sara is getting her costume altered. Behind her, Miss Marks is cutting Susie’s hair in silence. The chattier MISS BALFOUR (40s) is trimming Caroline’s hair, talking to Caroline in French.",
      "dialogue_count": 0,
      "word_count": 2105
    },
    {
      "scene_number": 15,
      "slugline": "INT. MARKOS COMPANY, SARA’S ROOM -- NIGHT Sara lies awake. She hears Susie return for the night. After a moment, she gets out of bed. INT. MARKOS COMPANY, RESIDENTS’ CORRIDOR -- NIGHT She comes around the corner to Susie’s door and sees it is closed. There is no light under it. She quietly knocks, but Susie doesn’t answer. INT. SUSIE’S ROOM, MARKOS COMPANY -- NIGHT Susie lies in bed, awake. She hears Sara’s voice whisper: SARA I’m not leaving you here, Susie. I’m not leaving without you. Then she is gone. This makes the part of Susie who is simply a young woman who needs her friend smile. She closes her eyes to sleep amid the BREATHING that has joined her again. FADE TO BLACK. ON A TELEVISION: A news story plays about the burials of the RAF prisoners in a Stuttgart cemetery. Thousands of protest- ors silently observes the burial.   Polizei   with machine guns are posted everywhere. NEWS REPORTER << In response to local protesters who wanted to keep Baader, Ensslin, and Raspe from being interred here, Stuttgart Mayor Manfred Rommel, son of Field Marshall Irwin Rommel, re- marked: “I will not accept that there should be first- and second- class cemeteries.” He declared, pas- sionately: “All enmity should cease after death.” (beat) Echoing in a sharper sentiment, BKA Commissioner Horst Harold told the press: “The Baader-Meinhoff era is done. The so-called “German Autumn” is over.” >>  74.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 240
    },
    {
      "scene_number": 16,
      "slugline": "EXT. BERLIN -- DAY Fall marches toward winter. Leaves are all in the street now. CUT TO: INT. MARKOS COMPANY, SECOND FLOOR CORRIDOR -- DAY Miss Tanner is coming out of Blanc’s office, which she locks behind her. She is balancing a pile of thin boxes, perfor- mance gifts for the dancers. All of Tanner’s keys are on a knotted ribbon. She puts them in her pocket. INT. MARKOS COMPANY, MAIN STAGE -- DAY Final checks are being done on lights and sound before the doors are opened to begin letting in audience members for the company’s performance. All of the dancers and matrons are in the theatre preparing for the show. INT. MARKOS COMPANY, DRESSING ROOM -- DAY Susie sits getting her makeup done by Miss Chalice. She sees Sara is not anywhere around. SUSIE Have you seen Sara yet? MISS CHALISE She came in early. Wanted her hair and makeup first. Then she left. INT. MARKOS COMPANY, TECH STAIRS -- DAY One of the technicians, JUDITH (20s) opens a side door and finds Miss Tanner on the floor surrounded by boxes. She has fallen down the stairs, only now just regaining her wits. Judith helps her sit up. JUDITH << What happened? >> Tanner touches her head. It’s tender, but there is no blood. MISS TANNER << I must have fallen. >> INT. MARKOS COMPANY, CORRIDOR -- DAY Sara comes hurrying down the hall, made up for the perform- ance, Miss Tanner’s ribbon of keys in her fist as well as a flashlight. When she gets to door of the “Mirrored” Studio, she lets herself in and locks it behind her.  75.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 275
    },
    {
      "scene_number": 17,
      "slugline": "INT. MUTTERHAUS, FIRST ROOM -- DAY Sara lets herself into the first secret room behind the mir- rored panel and goes to the locked door inside. She begins to try out keys, one after another. There must be thirty on Miss Tanner’s ring. Air moving under the door plays a low note a- cross the jamb. The door springs open and Sara finds herself looking up a nar- row, steep stairway. She hesitates only briefly, then goes. INT. MUTTERHAUS, STAIRWAY -- DAY The stairway is lit by small electric sconces as she makes her way up it, silently as she can. It moves upward past her and Susie’s rooms. Then, when it crests the next floor, it begins   descending   again, widening as it goes, becoming some- thing quite grand by the time it reaches the back part of the building used by the coven, the “Mutterhaus.” INT. MUTTERHAUS, THE APPROACH -- DAY Sara finds herself in a huge, curved arcade that arcs around before ending at an open archway. The architecture is quickly morphing into something hyper-organic and fluid, an emphatic sort of art nouveau. There is nowhere to hide if she hears anyone coming. Sara is terrified. CUT TO: INT. DRESSING ROOM, MARKOS COMPANY -- DAY All of the dancers are gathering, made up and costumed. MISS MILLIUS Ten minutes! Ten minutes! Susie is looking around for Sara, who is still not among them. The girls seem concerned about it, but not the matrons. Susie grows truly worried. CUT TO: EXT. MARKOS COMPANY -- DAY Klemperer comes up the sidewalk to the company and heads to the theatre entrance on one side. He is nervous as well. He shows his ticket to Miss Huller, who gives him a smile and gestures him inside.  76.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 296
    },
    {
      "scene_number": 18,
      "slugline": "INT. THEATRE, MARKOS COMPANY -- DAY Miss Mandel escorts Klemperer to his seat. The audience is filling up to a full house. He regards her, and the other com- pany women, with what he thinks is a discreet eye. When he looks around the theatre, he begins to see some of the icon- ography rendered in Patricia’s journals around him here. It is unnerving to him. CUT TO: INT. THE ROOM OF COMPARTMENTS, MUTTERHAUS -- DAY Sara comes into a huge tube-shaped room. At the opposite end is an arch with further rooms beyond. Sara moves forward, but she notices, all along the walls of this room, are triangle- shaped recesses in shadow. She stops. She can see in one the shape of a leg, as if someone is crouching there. She almost screams, but keeps her wits. Trembling, she slow- ly goes toward whoever it is, flashlight up, but then, impos- sibly, someone in another recess calls her name. PATRICIA (O.S.) Sara. The person leans out and Sara can see in her light: It is Patricia. She runs and kneels at her side. Patricia’s in a strange state--slow, dry-voiced, and cold to touch. PATRICIA I wake up here every day now. Patricia speaks in a normal voice. Sara’s is hushed. SARA Stand up! Come on! I know how to get out. --Take my jacket. PATRICIA She’s inside me. She wants me to hold you. Sara pulls Patricia out of the shadow and sees, with horror, she’s pale. Her eyes are rimmed in pale flesh. Her face is a dead girl’s face, but without the stiffness of death. All her features hang down. Her jaw is slack. Sara takes her wrist and checks for a pulse. There must not be one. Sara begins to cry. Patricia delicately pulls her wrist out of Sara’s grip and reverses things so that she is now holding Sara’s wrist.  77.",
      "characters": [],
      "action_text": "Someone is coming down the passage Sara’s just come from. She can hear it. PATRICIA They’ll take you now. Sara panics and tries to get up, but Patricia grips her. PATRICIA (CONT’D) She shows me things. On the side of a coffin I think is my rest. She’s holding it, holding it back-- Show- ing me things on the side, like this-- A new expression comes into his face. Blank and cold. A few other girls come out from other alcoves, to come hold Sara. A sound of terror escapes Sara’s lips against her will. PATRICIA (CONT’D) A ribbon. For my face. We are ti- red. We are so tired. Sara pulls free from Patricia, and runs past the other girls and through the arch just as the figures of a number of mat- rons appear in the door Sara came in. She only sees them for a split second, but they are naked. INT. MUTTERHAUS, THE ROOM OF HOLES -- DAY Sara runs into the next room, a dark room, the edges of which she cannot see. It’s the room about which Susie dreamed, with the holes in the floor, but Sara doesn’t see them in time. Within a few steps she puts her leg into one. Her momentum carries her forward and her shin snaps. She shrieks and crash- es to the ground. She awkwardly gets her leg out and begins to back away from the door, dragging the it along with her. The matrons come in- to the room and see her injury. MISS MILLIUS Keep still, Sara. Lie still. Some, who are dancers, are in good shape for their ages. Others, who work in administrative capacities, sag. They are all smiling, sort of dancing around the holes in the floor. A few have some of the implements from the first room in their hands. Sara is frightened to the point to frenzy, but also pa- ralyzed now somehow. She can’t move at all. She begs instead.  78. SARA FORGIVE ME! PLEASE! I wanted to help! I DIDN’T KNOW! DON’T DO ANY- THING-- The matrons come in, with calming voices. Pavla goes about setting Sara’s leg. It must be very painful, but they hypno- tize her as they work and she resists less and less. Finally, Miss Vend",
      "dialogue_count": 0,
      "word_count": 2194
    },
    {
      "scene_number": 19,
      "slugline": "EXT. BERLIN, STREET -- DUSK The entire company, along with most of the matrons, walks a- long in high spirits. INT. BERLIN, PARIS BAR -- DUSK The company is given the back tables at a busy cafe. Susie sits at one end with Sonia, Marketa, and Doll. The matrons gather at the other. Blanc is there, as are Tanner, Mandel, and Millius. Vendegast sits beside Danielle, who’s high laugh has already begun. Miss Huller and Pavla are not present. MISS TANNER Girls! Remember the limit! Nine marks. Other than that, choose as you like. You’ve earned it. Susie has not been absorbed into any cliques since Sara’s de- parture. She’s with the group, but not of it anymore. Susie seems to understand tonight is meant to be the night for whatever is going to be asked of her. She seems hypervig- ilent, but not afraid. The matrons certainly understand it. They are already celebrating the end to their long season of worry. Only Blanc looks disconsolate. CUT TO: EXT. EAST BERLIN, FRIEDRICHSTRAßE -- DUSK Klemperer has come into East Germany tonight. But when he gets to the fountain where he usually sits, a WOMAN (60s) is sitting there. As he walks toward her, he recognizes more and more of her posture, the set of her head. He walks faster to her, When he is almost behind her, she turns. It is the woman from the photo in his sitting room, aged thir- ty years. Love fills her face. “ANKE” Jozef. CUT TO: INT. PARIS BAR, BERLIN -- NIGHT The girls eat and drink everything in front of them. The mat- rons have ordered food, but none of them touch it.  84.",
      "characters": [],
      "action_text": "Susie notices this, but no one else seems to. She puts her fork down and abstains as well. CUT TO: EXT. WEST BERLIN -- NIGHT Klemperer and “Anke” walk together through the city, back into West Berlin. When they get to the checkpoint, they walk through it unaccosted. None of the guards seem to notice. “ANKE” << Karol had told them about me. He betrayed us. I had minutes to get out. I couldn’t find you. I travel- ed on foot to try for Teplice where I planned to ask Mirek’s family to take me in, but I was caught at the border and taken to Terezin. >> Klemperer tries to interject the first of what must be a mil- lion regrets and apologies, but she stops him--she wants to tell him everything first. She caresses his face and he grabs her hand as if it were a bird about to fly away. “ANKE” (CONT’D) << After the liberation I made my way to Zurich, and then to Milan. I’ve had a life there. A lovely life. I was told you had died in the invasion. >> Klemperer just shakes his head and lets his eyes go cloudy with tears. They come up the Friedrichstraße, but when Klemperer tries to lead her in the direction of his apartment, she takes his arm and turns him down Kochstraße, in another direction. CUT TO: INT. BERLIN, PARIS BAR -- NIGHT The girls are quite drunk now. Susie notices Blanc looking at her and the other matrons looking at the girls with growing excitement. Tanner is making her way around the table, touch- ing each girl as she goes, rendering each one a little thick- er in affect, hazier in look, beginning a process of mesmeri- zation. She does not touch Susie.  85. The BREATHING in Susie’s head is growing louder, but she seems no longer even intimidated by it. It’s simply the sound of something coming now, possibly something great. SUSIE (V.O.) I’ll go walk in the streets. Blanc is looking at her, as if she might cry. After a beat, her thoughts responds. Susie can hear them now. BLANC (V.O.) If you’re sure. (beat) Give us time. There is much to be done. Susie gets up to",
      "dialogue_count": 0,
      "word_count": 3176
    },
    {
      "scene_number": 20,
      "slugline": "INT. MUTTERHAUS, ROOM OF FEASTS -- NIGHT Death reaches Markos, rears up, and tears through the woman’s meager magical defenses, then through her flesh. Susie gets slowly to her feet to watch. When it is finished, it goes loping back down the stairs to every Markosite in the room. They see it coming and SCREAM-- Miss Mandel and Millius, Miss Balfour, Miss Huller, Miss Marks, Pavla, Miss Verdigast, and Alberta. The black thing cuts them down in its killing ebb, leaving the Blancites un- touched. Then is uncoils into the void beyond. Tanner is spared. She’s weeping, weeping. The remaining witches find their voices and begin to scream praises. They thought they were about to witness the rebirth of their leader Helena Markos, and instead they have seen the arrival of one of the very Mothers they have only read about for cen- turies. MATRONS IN THE ROOM  MUTTER! MUTTER! MUTTER SUSPIRIORUM!  As Susie walks down the stairs, the font of light burns over her head, scattering all shadow, all ambiguity. Up close to it, as Susie is, one can hear the sound of TEN THOUSAND FOR- ESTS BURNING in it. She reaches up and pulls her throat open along a vertical to form a new mouth to speak out of. When she reaches the bottom, where Sara stands, she takes the mask from her and puts it aside. Then she takes off Olga’s, and then Patricia’s, who have come forward, and sets them a- side. She leads them into a dance, telling them as they go: SUSIE/MOTHER SUSPIRIORUM I am here now! I am with you! Their eyes are rimmed with white. They dance for a time until Susie recognizes they are sad in their state. PATRICIA Mother, we are so tired. SUSIE/MOTHER SUSPIRIORUM What do you ask? PATRICIA To die! To die!  95.",
      "characters": [],
      "action_text": "She places a hand briefly on Olga’s ruined face, then Patri- cia’s, and lets them die mortal deaths. She and Sara dance for a time until Sara says to her: SARA Mother, please. SUSIE/MOTHER SUSPIRIORUM What do you ask? SARA To die! And Susie puts her hand briefly on Sara’s face, like a lover would, and then over it until she falls away, as if from a great height, from the mortal world into death. Susie dances in solo then, charging the air, the room, the coven with her power. Finally, she calls out to the other witches: SUSIE/MOTHER SUSPIRIORUM It is beautiful! Beautiful! Contin- ue the dance! The dancers wind back up again, but with a force that gives the impression Susie is controlling them now. She enters the dance, leads it, leads it into the air, with no underfoot or overhead, just circles and circles of power. Klemperer is watching all of this unfold, his mind at the edge of ruin. FADE TO BLACK: EXT. BERLIN, STREETS -- DAWN Susie is walking down the center of the street through the snow. It SQUEALS under her boots. Lights are burning in some windows, but not many people are out yet. She walks with a gait and confidence that is itself nearly a dance. This is her city now, its people her people. CUT TO: INT. MUTTERHAUS, ROOM OF FEASTS -- DAY The remaining matrons are beginning the long process of cleaning the Room of Feasts. They remove the stained linens from the table. They scrub the stones.  96.",
      "dialogue_count": 0,
      "word_count": 565
    },
    {
      "scene_number": 21,
      "slugline": "INT. MARKOS COMPANY, HALLWAYS/STUDIOS -- DAY The dancers are all in the studios rehearsing, oblivious. The company is running again as usual. Miss Boutaher leads the re- hearsal. Danielle beats the drum. There’s no hint of strange- ness in the girls. They remember nothing, it’s clear. BACK TO: INT. KLEMPERER’S APARTMENT, BEDROOM -- DAY Klemperer is alive, though unwell. He has survived his night with the coven, but has been shaken past what he can tolerate psychologically. Madame Sesame brings him tea, a slice of brown bread with a little butter crock, a sliced up pear. She puts it on his bed- side table. The room is dim, the curtains nearly shut against the snowy morning. He doesn’t want the light. After a few moments, the door opens and Susie comes in with- out knocking. Frau Sesame turns in surprise. FRAU SESAME << Good morning. No one taught you to knock on a closed door? >> SUSIE/MOTHER SUSPIRIORUM << Wait on the stairs. >> The housekeeper, coming into her fright, goes. Susie enters. Klemperer’s eyes follow her into the room and to a chair beside the bed. He is shaking. The light from the window is behind her now, casting her nearly in silhouette. SUSIE/MOTHER SUSPIRIORUM (CONT’D) I’ve been thinking about you. I wasn’t yet in a position to prevent what my daughters did to you, but I regret it. Truly. I want to make it up if I can. I brought a gift. (beat) You deserve to know what happened. KLEMPERER Please. But Susie closes her eyes, summoning a path through history to his wife. Her silhouette begins to change as she exerts herself. He can see the outline of Mother Suspiriorum--the halo of darkness.  97.",
      "characters": [],
      "action_text": "SUSIE/MOTHER SUSPIRIORUM Your wife tried to make it south to Teplice. But she was apprehended by border guards in the woods outside Glashütte and taken, finally, to Te- rezin instead. Theresienstadt camp. Klemperer’s eyes are already tearing up with this confirma- tion of his worst nightmare. He clamps them shut. When he opens them, he is looking at the bedside table beside them, where the cut up pear sits in a dish with the knife. It is not a big knife, but it is sharp. And it’s within reach. SUSIE/MOTHER SUSPIRIORUM (CONT’D) She lived there only twenty days. On the 11th of November, 1943, the Commandant of the camp, a man named Burger, ordered all 40,000 detained there to stand in the cold for a census. Hours passed. Most were nak- ed. Some hundreds died of exposure. CLOSE ON: Under the lids, Susie’s eyes move here and there as if she is seeing what she’s describing. SUSIE/MOTHER SUSPIRIORUM (CONT’D) Your wife had two women with her as she died, who told her she was not alone: An elderly secretary from Denmark and a woman from Moravia, whom your wife had befriended. Her final moments were spent thinking of a birthday in which you sur- prised her by taking her to hear a concert. Chopin and Brahms. It was the first time you held her hand. She was not afraid. Her thoughts were of you. Only of you. Susie reaches the end and opens her eyes, back in her mortal form. She sees: Klemperer is crying through all of this, rocking with silent, hopeless sobs. Hope, even hope scraped thin, was preferable to him than this. She savors his pain. SUSIE/MOTHER SUSPIRIORUM (CONT’D) Be calm, doctor. That’s not the gift. Susie leans in and takes his hand.  98. SUSIE/MOTHER SUSPIRIORUM (CONT’D) Of Anke-- Of Patricia-- Of Sara-- Of me-- Of all the women of your un- doing-- When I touch your face, ev- ery memory of them will go. They’ll melt in the sun and be gone. She doesn’t ask him if he’s ready. She touches the place just in front of his ear. Then she gets up to leave him to the attend",
      "dialogue_count": 0,
      "word_count": 921
    }
  ]
}