{
  "slug": "swan-song-2021",
  "title": "swan song",
  "genre": "drama",
  "format": "film",
  "scenes_count": 20,
  "characters_count": 0,
  "characters": [],
  "total_words": 20600,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. FOREST FLOOR - DUSK We are drifting, top down, across a forest floor. Tiny specks of WILD FLOWER amongst the rich dark soil. Snippets of CAMERON TURNER’S dialogue gently fall around us, a tapestry of thoughts and fond observations. CAMERON (V.O.) ...Hums when she’s nervous. Speaks in her sleep sometimes... Rarely stubborn, deeply kind, witty... She loves words. The musicality of language... Music... Her world’s a symphony... We tilt up from the soil now and we’re drifting through an incredible forest like a ghost. Rays of dusty sunlight guide us as we begin to center in on one LARGE TREE... CAMERON (V.O.) Sorta giggles when we make love. Remember thinking it was strange when we started dating... Becomes one of those things you’d miss if she ever stopped doing it... (overlapping) ...What’s that Mariah Carey song? The Christmas one? One of her guilty pleasures... I can hear her now, singing it as she puts the lights up on the tree... We arrive at the LARGE TREE and tilt up. Its impressive bark trunk stretches up as far as the eye can see. In a continuous movement we begin to move up it. CAMERON (V.O.) (overlapping) Everything changes when you have a kid. From that moment, both of you are just viewing the whole world through this completely new lens... (overlapping) ...What’s that Beckett line..? “The light gleams an instant then it is night once more.” Is that it..? As we rise higher and higher we can just about make out the SILHOUETTE of a DEAD MAN’S BODY suspended in the upper branches. The overlapping voices and music crescendo to a cacophony of sound that merges into the sound of a train... CUT TO: 1.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 286
    },
    {
      "scene_number": 2,
      "slugline": "INT. TRAIN - DAY CAMERON TURNER (30-ish) sits on a busy train, at a compartment with 4 seats and a table. He’s in the aisle seat. Cameron is lost in his NOTEBOOK, sketching a very cool pencil drawing of a man in a subway station floating in zero-g. An AUTOMATED CONCESSIONS CART glides up the aisle. It stops beside Cameron, speaks into his EAR BUD. CONCESSIONS CART (V.O.) Cameron Turner, my man... Lemmie guess: Latte, oat milk, no sugar. CAMERON Spot on, sir... And I’ll take an Echo Bar if you got any..? CONCESSIONS CART (V.O.) Echo’s my middle name, amigo. That’ll be all? CAMERON That’s good. Thank you. CONCESSIONS CART (V.O.) Alright. Payment taken. Order coming up. The Automated Concessions Cart whirs into action. Cameron continues drawing as he waits. Moments later we see the COFFEE and ECHO BAR in the little automated shelf of the bot. CONCESSIONS CART (V.O.) Ta-da. CAMERON Thank you, bro. CONCESSIONS CART (V.O.) You’re welcome, Cam. OK good talk. We’ll see you tomorrow. The Concessions Cart glides off to the next compartment. INT. TRAIN - LATER It is early dusk on the train now. Cameron wakes as PASSENGERS from his compartment leave to get off. Cameron sees a WOMAN (late 20’s) coming up the busy train. 2.",
      "characters": [],
      "action_text": "She’s carrying numerous canvas bags and is on a call, arguing with someone via her EAR BUD. She speaks English, weaving in little sentences of French. This is POPPY. POPPY (ON A CALL) Yeah I get that. But he’s a sensitive soul... You gotta be gentle with him, OK? I know my brother. Poppy reaches Cameron's compartment. She gestures to the empty seats across from him.   Can I?   Cameron nods.   Sure.  Poppy shuffles across to the window seat diagonally across from Cameron, placing some of her things on the table. POPPY (ON A CALL) (CONT’D) Well, sorry, but that’s just how it is, OK..? Look I gotta go. Bye. Poppy taps her ear bud and the call ends. She looks out her window. Endless modern buildings. Cameron takes note of the new arrival. She’s unique looking. Incredible eyes. Stylish in a hip, effortless way. Just then, Poppy glances around, catches Cameron checking her out. He smiles awkwardly, diverts his eyes. Poppy checks Cameron out now. He’s handsome with an endearing shyness. She smiles to herself. She takes a book out now and begins reading. Cameron steals another glance at her.   Wow...  CUT TO: INT. TRAIN CARRIAGE - LATER Later. Cameron is working on a DRAWING of Poppy, sketching the outline, stealing glances at her as he goes. As the train rolls on, something unexpected happens... Cameron sees Poppy reach over and turn his Echo Bar toward her. He double takes.   What the..?  Out of the corner of his eye, he watches Poppy open it, break off a chunk and nonchalantly pop it in her mouth.   How brazen!  Cameron tries to process this as Poppy looks back outside. 3. OK, time to assert ownership...   Cameron rotates the Echo Bar back toward him, breaks off the next chunk, and eats it as he’s looking down at his notebook. Poppy notices him eating it, seems to smile to herself. And so it continues. Poppy takes another chunk of Cameron's Echo Bar. Cameron, too polite to say anything, takes the next. They share a glance. Cameron looks at her strangely.   Is this some k",
      "dialogue_count": 0,
      "word_count": 956
    },
    {
      "scene_number": 3,
      "slugline": "EXT. TURNER HOME - NIGHT Present day. 10 years after the opening train scene. Cameron, now 40-ish, sits in a LYFT STEED (A popular self- driving car service with two front facing seats, two back facing, no driver). Cameron’s Steed is traveling through a Seattle suburb as he listens to a voice message in his ear bud. WOMAN (V.O.) ...Look, I don’t want to add any more strain on you, Cameron, but with your latest scans showing an accelerating deterioration, it’s vital that we keep things moving forward -- CAMERON Mute. The message stops as Cameron’s Steed pulls up at a middle class suburban home on the outskirts of Seattle. Modern, compact, 3 stories. It’s so late that the neighborhood is dead quiet. Cameron sits there outside his house, lost in thought. I/E. TURNER HOME - HALLWAY / KITCHEN / LIVING ROOM - NIGHT Cameron's front door auto unlocks once he grabs the handle. He steps into an open planned kitchen & living area. It is tastefully decorated. Mid century modern furniture. Lived in. Although we are in the near future you wouldn’t know it at first glance. Books and vinyl records are still revered. An oak wood upright piano sits at one end of the living room. CAMERON Pig..? Cameron is greeted by ELLINGTON, an adorable dog, lovingly known as “Pig”. He gives him a cuddle then heads to the fridge. We might notice family photos on the fridge door. CAMERON (CONT’D) (to Ellington) You guys save me some food? You didn’t eat all my food today? 6.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 260
    },
    {
      "scene_number": 4,
      "slugline": "INT. TURNER HOME - HALLWAY - NIGHT Cameron, tired and battling a headache, stops at a door with “THE DOC” written on it in HAND DRAWN lettering. He quietly pops his head in. His son CORY (8) is asleep. He’s an adorable kid. Cameron looks in on Cory sleeping for a moment then turns out the night light. INT. TURNER HOME - BEDROOM - NIGHT Cameron comes into the bedroom. We pan around to see Poppy who is asleep in their bed. Cameron kisses her and pads into their bathroom. INT. TURNER HOME - BATHROOM - NIGHT Poppy has placed a piece of paper for him beside their sinks. It’s a drawing, clearly the work of Cory. Through Cameron's AUGMENTED REALITY (AR) contact lenses he sees that Poppy has left him a voice message emoji (a little 3D emoji). The emoji senses Cameron entering the room and comes to life with her voice message into his EAR BUDS. POPPY (V.O.) Child prodigy or future serial killer..?? Can’t wait for parent teacher night... Poppy’s emoji’s head morphs into a 3D LOVE EYES EMOJI that giggles then explodes, spraying tiny blue love hearts across the drawing and sink top. Cameron smiles and picks up Cory’s drawing. The AR love hearts fall off it. It’s an good drawing for an 8 year old. A classroom with a teacher at the front. She has a dog’s head and big bulging eyes. “MS. JONES” is scrawled at the top. Cameron grins. He places Cory’s drawing down, propped against the mirror. He removes two inconspicuous EAR BUDS from his ears. They are beautifully designed, as is the compact docking station he places them into. 7.",
      "characters": [],
      "action_text": "Next he removes his AR CONTACT LENSES and places them into a second docking station. A charging light comes on. Cameron looks down at his left hand. His finger is twitching slightly. He looks up at himself in the mirror as he gets a sudden sharp migraine bolt to his temple... And another... Cameron's vision blurs now and everything sways. He holds on to the faucet but can’t steady himself. He drops to one knee and collapses onto the tiles. His body seizes up and he’s out cold. Some excruciating seconds pass as we wait... ...Then Cameron comes to with a sharp inhalation of air. He is disoriented as he regains awareness of his surroundings. He looks out to the bedroom. Thankfully, Poppy has not woken up. He manages to reach out and quietly pull the bathroom door closed so that Poppy won’t see him if she wakes. He lies there, rattled, trying to calm his breathing. FADE TO BLACK EXT. SPEEDBOAT - DAY Cameron is on a speedboat. He looks up ahead as a boat motors along a choppy sea, manned by an expressionless, fit-looking man in his 30’s. This is RAFA. A couple of miles behind them, the mountainous coast. Way up ahead, an arresting FORESTED ISLAND juts out from the sea. This is BARRA ISLAND. EXT. BARRA ISLAND - JETTY - DAY Cameron and Rafa are walking up a wooden jetty. Cameron looks up at the steep incline of the isolated island. EXT. FOREST PATH - DUSK Cameron and Rafa ascend a path to an impressive, modern Scandinavian style BUILDING nestled in the forest looking out over the sea. 8.",
      "dialogue_count": 0,
      "word_count": 553
    },
    {
      "scene_number": 5,
      "slugline": "EXT. BARRA HOUSE - ENTRANCE AREA - DUSK Standing at the entrance to greet Cameron and Rafa is a smartly dressed, professional-looking woman. This is DOCTOR JO SCOTT (60’s) She smiles at the new arrival. JO Welcome to Barra House, Cameron. Good to meet you in person. (Cameron nods) Come in. Jo leads Cameron along an impressive entrance hallway that opens out into the heart of the facility. JO (CONT’D) This is our main living area... The decor is modern, but lived in, homey. Double height, with an incredible view of the arresting landscape outside. Cameron stands beside Jo taking in the space and view. INT. BARRA HOUSE - JO’S OFFICE - DAY Cameron sits across from Jo with an AR CONTRACT in front of him. We might notice words like “Memory Access” or “Non- disclosure” or “Transference Of Rights”. Jo keeps her eyes trained on Cameron as he studies the contract. JO I know that some of these concepts are uncomfortable. Just remember that if you decide not to proceed at any point in the evaluation process, he never leaves this facility. Cameron looks up from the AR contract at Jo. CAMERON ...And there’s no way he gets this thing again? JO As outlined, we modified the relevant strands of his DNA to prevent that from happening. A beat. Cameron shuts his eyes, massages his temples, thinks. 9.",
      "characters": [],
      "action_text": "CAMERON ...And what happens to him if I decide not to do this..? Do you just... Jo cuts in before Cameron can say something like   kill him . JO He goes to sleep that night, unaware, doesn’t know a thing. This is clearly an uncomfortable thought for Cameron. He looks out at the dramatic landscape surrounding them. Jo continues off screen. JO (O.S.) (CONT’D) ...We’ll be calling him Jack for now. If that name’s OK with you? Cameron just looks at her. INT. BARRA HOUSE - DUSK Jo stands with Cameron in a long hallway as a heavy CENTER PIVOT DOOR opens to reveal a stairway down to a BASEMENT AREA. Sensor lights fade up to reveal the stairway. INT. BARRA HOUSE - BASEMENT AREA - DUSK Cameron follows Jo down the stairs. The natural light cuts off at their backs as the huge door closes behind them. At the bottom of the stairs is a curving hallway. This part of the facility feels more minimal, sleek. Cameron and Jo make their way down this curving hallway. Jo stops outside one of the doors. JO This is the control room. She pushes the door open and gestures for Cameron to enter. INT. BARRA HOUSE - CONTROL ROOM - DUSK Cameron steps into the room. It has an impressive internal glass window through which we can barely make out a large dark room beyond. 10. DALTON (50) sits at a desk facing the glass with a few AR screens in his vicinity. JO ...And this is Dalton. Dalton stands with a nod to Cameron and a friendly smile. DALTON Welcome, Cameron. CAMERON Hey. JO Dalton’s a psychologist and our head technician here. Cameron nods to Dalton but his gaze wanders to the dark room. Reflections on the glass make it hard to see anything. Jo studies Cameron as he tries to peer into Lab One. JO (CONT’D) And that completes our team. Cameron looks back around at her, surprised. CAMERON It’s just three of you here..? JO Three humans. Our AI systems do the work of about fifty people... All the good stuff’s under the hood. Jo smiles at Cameron. She’s hard to read. Cameron’s gaze wanders to the roo",
      "dialogue_count": 0,
      "word_count": 1311
    },
    {
      "scene_number": 6,
      "slugline": "INT. BATHROOM - NIGHT The rain has gotten even heavier outside. Cameron looks at himself in the mirror. He looks very sick, and very alone. INT. TURNER HOME - KITCHEN - DAY Next morning. Cameron and Cory sit at the breakfast table. Poppy is at the sink, putting her breakfast away. Cory’s drawing is on the table between them. Cory holds a VIDEO GAME DEVICE. He is playing his game. Nothing is said at the table for a beat. CORY ...Can I have your pencils? CAMERON Oh, so you’re eyeing my pencils now? Poppy smiles to herself, one ear on the conversation. CORY Uh-huh. CAMERON (amused) Yeah? The same set I’ve had for twenty-two years? CORY You ain’t using ‘em. CAMERON “Ain’t”? When did we start saying “ain’t”. CORY You   don’t   use them since Andre died. Cory keeps playing his video game but the words “Andre died” have dropped like a bomb in the room, clearly hitting an emotional chord for Poppy and Cameron. Cameron looks over at Poppy at the sink a beat, then back at Cory, stuck. 15.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 181
    },
    {
      "scene_number": 7,
      "slugline": "INT. CAMERON’S OFFICE - DAY ON AR VIDEO - ALEX, Cameron’s boss, speaks to him from his OFFICE. Alex is a stylish man, 30’s. Cameron jots notes as Alex lectures him. ALEX Cam, what’s with you lately? Look, I know you’re an artist and this is painful for you. I get it. But this is a health-focused organic tea we’re designing, not some fucking Ayahuasca brew. Cameron chuckles but doesn’t respond. He just continues to scribble notes. We reveal that his ‘notes’ are just a cool pencil drawing of a guy with a large cactus for a head. ALEX (CONT’D) Look, when you follow with what the clients wants you kill it, you know. So just play ball, OK? (beat) Hello..? Earth to Cameron..? Cameron holds up the little doodle drawing for Alex to see. Alex smiles, amused. They’re friends. ALEX (CONT’D) Asshole... CAMERON Bye, Alex. ALEX Bye, Cam. Fix the design. Cameron nods. Alex ends the call and disappears. A hovering camera auto turns off its light and flies over to Cameron. Cameron places his hand under the hovering camera. It senses his hand’s presence and drops into it. He brings the device to his wrist and it magnetically snaps to his watch. Cameron starts eating goldfish crackers as he browses online. He holds one down for Ellington who gratefully devours it. Cameron seamlessly transitions into his workspace now to work on the design for the packaging of the organic tea company. A new message appears from Jo, taking him out of his stride. He minimizes his array of screens and sits there, glum, as a memory emerges... 16.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 271
    },
    {
      "scene_number": 8,
      "slugline": "INT. TURNER HOME - KITCHEN - 6 YEARS AGO (MEMORY) - DAY ...6 years ago. Cameron, Poppy and her twin, ANDRE, are at the kitchen table. Cameron's painting in his moleskin. Andre has BABY CORY (2) on his lap helping him to eat breakfast. Poppy and Andre are mid sibling-style debate. They occasionally dip into little bits of French as they speak. POPPY That is cloning, by the way. ANDRE ...No no no no no. Technically speaking, it’s not. The article said it’s not. It’s ‘regeneration’ or something... POPPY It doesn’t matter what you call it, Andre. It’s still weird... And I don’t care how good they say the tech’s gonna be, you’d know it wasn’t a real person in seconds. ANDRE Look, I’m just saying, hypothetically speaking, what if it actually was possible? What if they did actually work it out..? POPPY They won’t, Andre. You can’t copy a human being. ANDRE (sings) Mais arrêt. Hypothetically! Cameron..? CAMERON No thanks... I’m staying waaaay out of this. Everyone chuckles. Andre grins, keeps pressing Cameron. ANDRE Oh come on... Wimp. (keeps pressing) Come on... CAMERON Nothing like a good death chat first thing in the morning... 17.",
      "characters": [],
      "action_text": "Everyone chuckles. CAMERON (CONT’D) (beat) ...I mean. I dunno. We’re all gonna go, right? It’s part of life... Andre pretends to snore. Cameron laughs. They smile at each other. Clearly good pals. CAMERON (CONT’D) Ok ok... Poppy abruptly speaks up. POPPY Hey if Mum could be sitting here right now with us. And we couldn’t tell? She was indistinguishable..? ...Yes. Yeah. Screw the ethics. I’d take it... Ok? In a heartbeat. Poppy suddenly finds herself unexpectedly choked up. Cameron and Andre see it. A quiet beat. But Poppy quickly resuscitates the mood. POPPY (CONT’D) That said, if they happened to delete her fondness for yacht rock, I wouldn’t be devastated... Cameron and Andre chuckle. ANDRE Hey what about her waddle dance? CAMERON Noooo. We love the waddle dance. Come on... They laugh as Poppy, remaining seated, does an impression of her mom’s silly dancing they all remember well. Cameron and Andre join in with the dancing impression. Cory giggles. We focus on Cameron, smiling, laughing. CUT TO: INT. TURNER HOME - HOME OFFICE – DUSK Back to the present with Cameron, sitting at his desk. A sudden surge of anger. He punches his desk. Hard. It hurts. 18. We read the message from Dr Jo Scott on his AR screen:   Can we meet, please?  Cameron looks at the message, sighs. EXT. DOWNTOWN SEATTLE - PIER - DAY Cameron and Jo sit on a bench at the end of a downtown pier. It’s a boatyard, heavy industrial sounds surround them. CAMERON I can’t lie to my family any more. JO ...Look I know how you’re feeling, but   there is no lie. (beat) When the memory of this process gets wiped, Jack wakes up that day at home as Cameron Turner. And no one knows. Not even him. It’s the only way this works. A clean swap. CAMERON You can’t tell me there’s zero risk of something going wrong here. JO Getting your appendix removed carries a risk. CAMERON And getting your appendix out is legal. It’s not some experiment out on some island. (beat) ...How many others are out there? I want to know. Jo ta",
      "dialogue_count": 0,
      "word_count": 1000
    },
    {
      "scene_number": 9,
      "slugline": "INT. TURNER HOME - LIVING ROOM - NIGHT Cameron sits at the top of the stairs looking down at Poppy at the piano with a recording setup and headphones on, recording herself sing a melody. Cameron watches her a beat, readies himself. He makes his way downstairs and approaches the piano. CAMERON Hey. POPPY Oh hey. Cameron taps his ear. Poppy smiles and hits a button to unmute the audio. The music fills the room. It’s a beautiful, soulful piece, using samples of herself and her students singing with a little beat. Cameron bops his head. Loving it. POPPY (CONT’D) Yeah? Cameron nods.   Yeah.   Poppy smiles. CAMERON ...Is Cory at Jessie’s for dinner? POPPY Yep. Back at eight. You taking a break? CAMERON Yeah. Cameron nods. He gives Poppy a gentle squeeze on the shoulder and goes to sit on the couch behind her. She seems to sense that something is on his mind. Slowly we drift in on Cameron as Poppy comes over, sits beside him. Just as she sits, Cameron gets a dizzying bolt of vision blur for a second. Poppy rests her head back against the couch, closes her eyes. They slouch together, letting Poppy’s music wash over them. We slowly drift in on Cameron as he readies himself... But Poppy breaks the silence first. 22.",
      "characters": [],
      "action_text": "POPPY ...Hey so I think we’re gonna get Doctor Herbert for the ultrasound. Still waiting for them to confirm, but it’s looking good. Poppy places her hand on her stomach. CAMERON Yeah? That’s good. We like her. POPPY (nods, beat) Bracing yourself for sexy bowling ball bod..? Cameron chuckles, but talk of the pregnancy right now is destroying him. He looks out the window to the back garden. Poppy reaches over and takes his hand, places it on her stomach with hers. POPPY (CONT’D) ...Still can’t believe it. We’re gonna fall in love with a new little person again. Seven months... Cameron is unable to speak, trying to hold it together. Poppy senses that something’s up, gently questions him. POPPY (CONT’D) What’s up, Cam? CAMERON ...Nothing. I’m good. It’s just... Time seems to be crawling, second by second. Tension building. Cameron looks at his amazing wife. Can he tell her? CAMERON (CONT’D) Sweetie... I... POPPY (suddenly very worried) Cameron? A long beat... But no... Cameron manages to smile. CAMERON ...It’s just a new little person. I think it’s just sinking in still, y’know? 23. Poppy looks at him as he tries to hold it together. Seeing him emotional makes her emotional. POPPY Aw. Come here... Poppy leans over, hugs him close to her. He berates himself for backing out as she speaks softly. POPPY (CONT’D) Listen I know it took me a minute with everything. And I know we haven’t been us for a while. But this baby’s gonna be good for us. We’re gonna be OK. Alright? CAMERON Yeah. POPPY We’re gonna be good. Cameron nods, forcing himself not to crumble. INT. TURNER HOME - HOME OFFICE - DAY Cameron watches Poppy taking Cory to school, getting into a Lyft Steed outside. Cameron is calling Jo. She picks up. JO (V.O.) Cameron? CAMERON ...I’ve changed my mind. EXT. BARRA HOUSE - FOREST CLEARING - DUSK A WOMAN (30’s) sits out on a bench in a beautiful forest clearing behind the facility. Rafa hangs back as Cameron approaches the bench. CAMERON Hey... Mind if I sit? We reveal th",
      "dialogue_count": 0,
      "word_count": 3371
    },
    {
      "scene_number": 10,
      "slugline": "INT. BARRA HOUSE - LAB ONE – DAY Cameron is in Lab One sitting across from an unconscious Jack. The room is bathed in an orange light as we cut to... A SERIES OF BRIEF MEMORIES WITH CAMERON AND CORY Cameron hugs Cory in the KITCHEN, comforting him. A continuation of a memory snippet we saw earlier. CAMERON ...Together, me and you will take care of her until she can take care of herself again, alright? We gotta be strong for her, OK? She’s just sick right now. CUT TO: Cameron is in CORY’S BEDROOM waking Cory up for school, doing funny voices. CAMERON (CONT’D) Cory... Wake up, man, come on. CORY I need at least six more hours. CAMERON (amused) Six more hours? CORY It’s still dark outside, look. CAMERON Cause it’s early, but you gotta wake up, man. We gotta go. CUT TO: Cameron and Cory play with a kid’s basketball lying on Cory’s bed together. Cameron is showing him how to do it. CUT TO: ...A memory from a year ago. Cory is 7. Cameron is with him in the vegetable garden, attaching clipboards to each row with labels, handwritten by Cory. CAMERON (CONT’D) Zucchinis here? What do you think? 39.",
      "characters": [],
      "action_text": "Cory nods. Then speaks like an alien robot. Cameron replies in an alien robot voice, their own made up language. They both chuckle as we cut to... INT. BARRA HOUSE - LIVING AREA - DUSK Cameron sits in the Barra living area, alone. As the last remnants of the evening’s sun recede, little audio snippets of Cory memories gently reverberate around him. INT. BARRA HOUSE – LAB ONE / CAMERON'S BEDROOM - NIGHT Jack sits unconscious on a chair in Lab One. Dalton and Jo stand by, observing him. They seem on edge as we hear Rafa on the intercom. RAFA (V.O.) OK, standing by up here. CUT TO: Up in his bedroom, Cameron sits on a chair. He seems on edge. Rafa places a head device onto his temple. It automatically attaches and lights up. CAMERON How long will it take? RAFA He should wake instantly. Cameron is apprehensive, sweat on his brow. Rafa checks diagnostics on a couple of floating AR SCREENS. RAFA (CONT’D) OK, we’re ready to go up here. Close your eyes Cameron... CAMERON Gimmie a sec. Cameron takes some deep breaths. Once ready, he nods to Rafa. CAMERON (CONT’D) Alright. RAFA You good? Cameron nods. He exhales, closes his eyes. Slowly we push in. 40. RAFA (CONT’D) OK. Keep your eyes closed. I’m gonna count you down from three. And on three... INT. BARRA HOUSE - LAB ONE - INTERCUT ...Lab One that moment. Dalton and Jo stand facing Jack who sits in a chair, unconscious. They can hear Rafa on the intercom, very slowly counting down. RAFA (INTERCOM) And two... And one... On Jack. No response. Jo and Dalton watch, concerned. Time seems to stand still. After a wait, Jack suddenly opens his eyes and sucks in the air, adrenaline pumping through him. JO You’re OK. Breathe. Jack is impossibly overwhelmed. Five seconds ago he was looking at Rafa. Now he’s downstairs. CUT TO: Back up in Cameron's room. His eyes are open again. A beat. Rafa is studying some AR screens. CAMERON That’s it..? RAFA That’s it. CAMERON Did everything go OK? RAFA Everything went great. CAMERON ...When will I s",
      "dialogue_count": 0,
      "word_count": 584
    },
    {
      "scene_number": 11,
      "slugline": "INT. BARRA HOUSE - LAB ONE - NIGHT Close on a freckle. We cut out to reveal Jack sitting in Lab One. He’s staring at a reddish freckle on his right index finger. It stands out against his other freckles. His hand trembles slightly. We hold on Jack as we hear Jo off screen. JO (O.S.) For the time that you are in this facility, that freckle is the only place on   your entire body that isn’t identical to his... If you get confused you find that freckle and you’ll know who you are, OK? Jack looks up at Jo trying to deal with the overwhelming plethora of emotions that are pulsing through him right now. JO (CONT’D) We know how strange this is. Jack looks at her.   Do you, yeah? You know what it’s like to be woken up as a fucking clone?  JO (CONT’D) ...You got the good deal here, Jack. You’ll see. Jo and Dalton exit the room but we stay with Jack. He walks to the courtyard glass and studies his reflection. It is surreal and terrifying and... breathtaking. INT. BARRA HOUSE - CAMERON'S BEDROOM - NIGHT Later. Cameron is playing a fighting video game called RUMBLE NIGHT with Cory via an AR VIDEO CALL. INTERCUT - Cory is in his BEDROOM, playing against Cameron. CORY Boom! Yeah! CAMERON A little chin music. CORY You’re going down. 42.",
      "characters": [],
      "action_text": "CAMERON Not tonight, chump... Cameron attacks but Cory ducks and catches him with a hook. CORY Booooooooooom! Yeah, baby! CAMERON Ohhhhhh. Another cheap left hook -- Cameron notices that he has started to slur. He stops, clears his throat. Suddenly he is hit with a migraine and his hand starts to seize up. He looks down, stops playing, grimaces. Cory keeps playing but notices that Cameron's character is not fighting back. CAMERON (CONT’D) (slurring) End call. CORY Dad..? Cory looks up just as the video call ends. Cameron's eyes roll and he falls limp. As everything starts to fade to black we hear a flurry of swirling noise and concerned voices... CUT TO BLACK. INT. BARRA HOUSE - CAMERON'S BEDROOM - DAY Next morning. Cameron has just woken up, groggy. He looks around the room, last night’s seizure in his mind. He downs some water. He looks sicker than we have seen him. EXT. BARRA HOUSE - FOREST CLEARING - DAY Cameron speaks to Kate. He seems troubled. Kate just listens. CAMERON I could die out here this week before getting home to see them. Cameron sighs, trails off. Kate really feels for him, gives him a supportive squeeze on his shoulder. 43. CAMERON (CONT’D) ...Poppy and I have been going through some stuff. The other night I made her laugh. And I can’t remember the last time I did that, y’know. Just made her laugh. A beat of silence. Then Kate responds, deadpan: KATE That’s because you’re not funny. Cameron laughs. CAMERON Yeah... That too... A beat. KATE Time to get high. Kate tries to light a joint now with a nice BRONZE LIGHTER but her hands are weak, shaking. Cameron cups his hand around the flame. A beat. CAMERON Those things’ll kill you, y’know? KATE Oh so you   are   funny... Look at that. Kate takes a nice big theatrical drag. They both chuckle. Just then, Rafa appears. RAFA Cameron. We’re ready for you. Cameron looks up at Rafa, then to Kate.   This is it...  CAMERON See you later. Cameron stands and pats Kate’s shoulder. KATE Have fun. Cameron walks off",
      "dialogue_count": 0,
      "word_count": 599
    },
    {
      "scene_number": 12,
      "slugline": "INT. BARRA HOUSE - BASEMENT HALLWAY / CONTROL ROOM - DAY Cameron edges into the Control Room with Dalton. Jo is there at the glass, interviewing Jack, who is out in Lab One. Cameron stops the moment he spots Jack through the glass. Jack doesn’t see Cameron in the dimly lit control room and keeps talking. Cameron watches Jack talk fondly about Poppy. It’s wild to see Jack awake, the life in his eyes, his voice. JACK (O.S.) ...Poppy’s the world best sleeper. When she’s tired, she’ll just drift off in seconds. Out like a light. JO Poppy speaks French? JACK Yeah... She still says the occasional French word. Like she’ll say “bonne nuit” or “quoi de neuf”, “c'est pas possible”... (smiles, fond) Or if something is great, like just perfect, she’ll say “Parfait”. Cameron listens. God he’s going to miss those little things. We push in on Cameron's face and drift into a memory... INT. HOSPITAL ROOM (MEMORY) - DAY ...Poppy sits up in bed minutes after giving birth to Cory. She and Cameron just look at this beautiful little human, emotional. We gently push in on them as Poppy whispers... POPPY Parfait... CUT TO: Back to the present. Cameron lets the memory fade and edges closer to the Lab One glass. JACK She’ll just whisper it... “C’est parfait.” Just then, Jack spots Cameron as he walks into the light. They just stare at each other a long beat. 45.",
      "characters": [],
      "action_text": "Jo breaks through the pin-drop silence. JO (O.S.) You wanna go say hi..? INT. BARRA HOUSE - LAB ONE - THAT MOMENT Jack anxiously watches Cameron and Jo exit the Control Room. Now Jack’s eyes move to the Lab One door. He stands. After what feels like forever, Lab One opens and Cameron steps in, quietly followed by Jo. The atmosphere is charged. Neither man finds any words for a while. JACK ...You OK? After last night? Cameron nods. A beat. JACK (CONT’D) Good... (beat, sighs) ...I don’t know how to... What to say here... Cameron just looks at him. No idea either. A long, nervy beat. Jack is struggling to keep it together. Jo hangs back, watching with rapt attention. JACK (CONT’D) I know you don’t think I’m... (reconsiders his words) ...I’m sitting up in that room. Looking across at Rafa. My heart is beating out of my chest and I’m nervous. I’m really nervous. (beat) And Dad pops in my head. That first trip out to see him after they split. Memory of getting on that airplane. The nerves, you know... Cameron watches Jack. It’s truly strange hearing his experience the night before perfectly recounted to him. JACK (CONT’D) I close my eyes... And then I open them... And I’m not up there in that room anymore. I’m here... (MORE) 46. I am   here . (getting emotional) I’m sorry, man... Sorry. Jack barely keeps it together. Cameron studies him, affected. EXT. BARRA ISLAND - DUSK Dusk descends on Barra Island. The wind swirls and groans. The sky is a foreboding dark purple. INT. BARRA HOUSE - LAB ONE - DUSK In Lab One, Jack sits facing Jo. Interviewer and interviewee. Cameron and Dalton watch from the Control Room. Jack is nervous. He catches eyes with Cameron as Jo begins. JO OK. Commencing interview one. Jack, we’re going to ask you a number of personal questions in a free associative way. Don’t overthink your answers, just speak, OK? Jack looks away from Cameron, back around to Jo. He nods. JO (CONT’D) Alright. Let’s begin with your family. Talk to me about your son. Jack nods",
      "dialogue_count": 0,
      "word_count": 1477
    },
    {
      "scene_number": 13,
      "slugline": "INT. BARRA HOUSE - LAB ONE - DAY Mid interview in Lab One. The LED WALL bathes everything in an intense purple hue. Cameron sits across from Jack, almost uncomfortably close. Jo sits diagonally between them, also close. Both men seem tired. This feels more like an interrogation. Dalton silently observes from the Control Room. JO Keep going, Cameron. Test him... Cameron considers his next words. CAMERON ...Franklin. Herbie. Jack thinks a second, then nods as a memory comes to mind. JACK Very first day I met Andre. Up on the Franklin rooftop that night. The Herbie story. JO Elaborate please, Jack. JACK ...Just like Poppy, Andre was one of those rare people you’re instantly comfortable around. A few hours after we met, Andre and I are up on the rooftop having a smoke. Just me and him. And he tells me this old Herbie Hancock story... INTERCUT WITH: EXT. CITY ROOF TOP - (MEMORY) - NIGHT Cameron and Andre getting stoned on a rooftop overlooking the city. Intercut this story so we flip between Andre telling it on the rooftop and Jack telling it back in Lab One. JACK (V.O.) ...So Herbie’s playing with Miles Davis. It’s a huge night, crazy pressure. Ton of important people there... And the place is jumping. Miles is on fire, they’re all cooking...  (MORE) 52.",
      "characters": [],
      "action_text": "And right at the peak of one of Miles’ jams, Herbie hits this bum chord. I mean it’s   way off . And he can’t even hide it. He’s dying up there. And he’s standing there, playing, just waiting, watching for Miles’ wrath... But Miles..? Nah. INT. LAB ONE - THAT MOMENT Back in Lab One as Jack continues. JACK In an instant, he just...  maneuvers . Glides right into Herbie’s “wrong” chord... Makes the note right. And they keep on playing... (beat) And I’m standing there looking at Poppy’s twin brother, this guy I just met that day. Man... Cameron watches Jack reminisce fondly. As we cut back to... EXT. ROOF TOP - IRONWORKS (MEMORY) - NIGHT ...The memory of Cameron and Andre getting stoned on a rooftop overlooking the city. They chuckle. JACK (V.O.) ...Hadn’t had a best friend like Andre since I was a kid... INT. LAB ONE - THAT MOMENT Back in Lab One, Jack’s words fall like dust around them. Cameron is lost in the memories of Andre, his eyes diverted. Jo looks around at him. JO Cameron? Keep going, please... (beat) Make it obscure. Cameron nods, considers his next words. CAMERON ...Andre. Gift. JACK (V.O.) (CONT'D) 53. Jack thinks a second, then nods as a memory comes to mind. The two men lock eyes for a beat as we cut to... INT. TURNER HOME (MEMORY) - DAY ... Another memory. Cameron and Andre are leading Poppy into the living room with her eyes covered. Cameron leads Poppy across the room, while Andre covers her eyes. Poppy reaches out and touches the piano. POPPY Aww you got me a piano! She opens her eyes and sees that it’s her late father’s piano from their old house back in London. She is blown away. She gets up and hugs Andre. POPPY (CONT’D) Oh my god, Andre, thank you so much. Then the three of them hug now. JACK (V.O.) Andre was so like Poppy. Wildly smart. Gentle... INT. BARRA HOUSE - LAB ONE - DAY Back in Lab One, Jo keeps thing moving. JO What happened to him? JACK (takes a beat) ...Andre was thrown from his bike off of a mountain road... His body landed in the ",
      "dialogue_count": 0,
      "word_count": 3034
    },
    {
      "scene_number": 14,
      "slugline": "INT. BARRA HOUSE - CONTROL ROOM - DAY Cameron is with Dalton about to grant him access to his contact lens feed. He is poised to click “allow access”. DALTON Monitoring your lens feed while you’re back at home is an important part of Jack’s psychological evaluation. CAMERON Nothing’s ever recorded? DALTON That’s the policy. CAMERON And only Jack has access to this feed? DALTON No one else sees or hears a thing. Cameron looks at Dalton. Dalton nods.   You can trust us.  CAMERON Access granted. INT. BARRA HOUSE - VIEWING ROOM - THAT MOMENT In a dark room, that moment a large SCREEN activates, showing what Cameron sees through his contact lenses in real time. The camera focuses on Dalton as Cameron turns to look at him. DALTON Just... Try your best to forget about all of this and enjoy your time with them. EXT. BARRA HOUSE - ENTRANCE AREA - DAY Cameron is leaving Barra House. Dalton and Jo are there to see him off. Rafa waits with Cameron's bags. JO We’ll see you in three days, Cameron. Try to put everything out of your mind and just enjoy your time at home... Cameron nods and turns to walk off. Jo calls after him. 67.",
      "characters": [],
      "action_text": "JO (CONT’D) Do come back. Cameron turns back to look at Jo before walking off. INT. BARRA HOUSE - THAT MOMENT Jack stands at an upstairs window. He watches Cameron and Rafa leave down a FOREST PATH. This is killing him. Cameron and Kate hug. It feels like a goodbye. EXT. BARRA HOUSE - COAST - EVENING Later. Jack walks with Jo along the coast, depressed. JACK He’s not coming back. JO He’ll be back. Jack shakes his head, convinced that she is wrong. JACK He’s scared. And she’s way too smart. She’ll know something’s up. And he won’t be able to lie to her. JO Don’t underestimate the effect that seeing you has had on him. He has a chance to make everything right and he knows that now. JACK Once he’s face to face with Poppy, he’ll tell her. Even if he doesn’t want to. I know. JO That won’t happen. Trust me. They walk on in silence. Jack doesn’t seem comforted. INT. BARRA HOUSE - JACK'S BEDROOM - NIGHT Jack sits at a desk in his room. His eyes drift to the freckle on his index finger. He brings it closer, studies it. 68. Now he digs a pencil into the skin of his finger. It hurts as he pushes it in until it breaks the skin and blood drips out. INT. LYFT STEED - NIGHT Cameron sits in the Steed, moving silently along a mountain road toward his neighborhood. He checks his watch. Tension building... INT. BARRA HOUSE - VIEWING ROOM - THAT MOMENT Jack is sitting down in the viewing room in front of the screen. He sees what Cameron sees. And it’s gut wrenching. EXT. TURNER HOME - NIGHT Cameron sits in the Lyft Steed outside his house. He can see Poppy and Cory in the upstairs window, arranging books on a shelf together. He gets out of the Steed and walks across the street as the Steed takes off. As he walks up the path toward the house, a sudden migraine hits him and his vision starts to fail. Cameron is suddenly woozy. He tries to grab something but there’s nothing to grab. His knees go weak and he falls to the ground with a thud. If Poppy or Cory look out the window now, they’ll",
      "dialogue_count": 0,
      "word_count": 661
    },
    {
      "scene_number": 15,
      "slugline": "INT. BARRA HOUSE - VIEWING ROOM - THAT MOMENT Everyone watches, distraught. The screen is black, says “LENS FEED UNAVAILABLE”. An excruciatingly long beat. Then... The sound of a sudden sharp inhale of air... EXT. TURNER HOME - THAT MOMENT Cameron inhales a lung full of air. He must’ve been milliseconds from the end. Confusion sets in as he looks around him, sweaty and pale. INT. BARRA HOUSE - VIEWING ROOM - THAT MOMENT Everyone breathes again as Jo snaps back into work mode. JO Call him. Send a car. Rafa obeys. We hear Cameron's ear bud start ringing. EXT. TURNER HOME - NIGHT Cameron has regained an awareness of where he is. Jo is calling him. He looks around. The front door of his house is only 15 feet away. Thankfully Poppy or Cory have not seen him. He speaks to answer the call, his voice groggy. CAMERON Pick up. Pick up... JO (V.O.) Cameron. There will be a car there in a moment. Try to stand up. Cameron scrambles to his feet, steadies himself. He looks over at his front door, sways on his feet. We see Cameron looking around at the Lyft Steed parked on his street. He starts to make his way over to it praying Poppy or Cory or a neighbor will not see him. I/E. LYFT STEED / TURNER HOME - MOMENTS LATER Cameron gets into the back of the Lyft Steed. Jo talks to him from the Viewing Room. 70.",
      "characters": [],
      "action_text": "JO Cameron, we’re gonna need you to come back. CAMERON (weak) ...I just got home. JO We might just need to tweak your medication, but we gotta have a look at you. CAMERON I’m not going back. Jo maintains a calm tone but it’s a lid on a scream. JO If you stay and have another seizure without supervision, you could die in front of your family. CAMERON Fuck you. Cameron sits there, utterly torn. His deep pain turns to a sudden rage. Cameron slams his fists into the seat of the car repeatedly. CAMERON (CONT’D) Fuck! Fuck! Fuck! Fuck! Deep in his rage, he collapses again, his body convulsing. JO Cameron? Cameron, talk to me. We drift up from Cameron to see the bedroom window, Poppy and Cory still putting books on a shelf, unaware, as the Lyft Steed moves off into the night. EXT. VARIOUS ROADS - NIGHT The LYFT STEED drives fast along various roads. EXT. BARRA ISLAND - JETTY - NIGHT It is windy. Cameron is lifted out of the small boat on a stretcher by a SERVICE DRONE BOT, guided by Rafa. 71.",
      "dialogue_count": 0,
      "word_count": 436
    },
    {
      "scene_number": 16,
      "slugline": "INT. BARRA HOUSE - MEDICAL BEDROOM - NIGHT Cameron is downstairs in a medical room. He’s lying unconscious, hooked up to medical equipment. Jo and Dalton stand by his bed, both of them tense. JO ...Jack goes in the morning. DALTON I haven’t finished evaluating his psychological state yet. I’m not comfortable with Jack going home. JO Poppy’s expecting him back... Jack is ready. He goes first thing. This doesn’t sit well with Dalton. JO (CONT’D) We’re covered for this in the contract... It will be noted that you opposed the decision. Tell Jack to call Poppy now. Dalton shakes his head; deeply frustrated but overruled. INT. BARRA HOUSE - CAMERON’S BEDROOM - NIGHT Jack sits on the bed. Dalton stands beside him. DALTON You slipped in the shower. Mild concussion. Scan was all good. Home tomorrow. Jack nods. Understood. Rafa wheels a cart over. It has Cameron's clothes neatly folded in a square box. His SHOES, his WATCH, his AR CONTACT LENSES and his WEDDING RING are also on the cart. Jack looks down at the items. His things... INT. BARRA HOUSE - DECK - DAY Jo sits with Jack looking out at the surrounding landscape. She breaks the silence with some parting words for Jack. 72.",
      "characters": [],
      "action_text": "JO ...If these two weeks at home go well, which they will, your memory of this process will be removed and we will not see you here again. If Cameron wakes up, he will monitor your lens feed. But unless there are any issues over the next two weeks, you will not have the option to stop this. Jack nods. Jo hesitates before she continues. JO (CONT’D) I know this isn’t as we planned it, but you’re ready, Jack. Don’t think of these two weeks as a test. Jack studies her a moment, then nods. Understood. JACK ...I’m just going home. Jo nods and studies Jack out of the corner of her eye a beat. Whether she believes that he’s not nervous or if he believes it himself is another question entirely. EXT. TURNER HOME - DAY A Lyft Steed pulls up outside the Turner home. Jack gets out. The Lyft Steed takes off, leaving Jack standing with his luggage outside his house. He begins walking up the driveway. INT. BARRA HOUSE - VIEWING ROOM - DAY Jo watches Jack’s POV on screen. He’s walking toward his front door now. Jack gets to the front door and hesitates, his hand hovering above the handle, but finally moves his hand closer to the handle and the door auto unlocks. INT. TURNER HOME - THAT MOMENT Jack comes in the front door, Poppy runs up the stairs to meet him as he comes in. POPPY Bear... Let me see you. Are you ok? She goes to inspect his head. 73. JACK It’s just a little bit sore, I’m fine. Swelling’s gone down. Poppy has a look at him, worry etched on her face. POPPY What did they say? JACK I might be a little bit fuzzy for a few days, but I’m good. Hey, come here. Jack gives her a massive hug. They hug each other tight. God it’s incredible to see her and hold her. INT. VIEWING ROOM - THAT MOMENT Jo watches the moment from the Viewing Room, tense. POPPY You scared me. JACK I scared me. INT. BARRA HOUSE - MEDICAL ROOM - DAY Cameron lies in bed, still unconscious. His eyelids twitch, a slight grimace on his face like he’s having a nightmare. INT. TURNER HOME - KITCHEN - DAY Jack is ",
      "dialogue_count": 0,
      "word_count": 3338
    },
    {
      "scene_number": 17,
      "slugline": "INT. TURNER HOME - HOME OFFICE - NIGHT Cameron very quietly edges into his office and carefully closes the door behind him. The lights fade up and what greets him is a nice surprise. The unloved office of the last couple of years has been transformed. It is starting to resemble an illustrator’s studio again, like the old days. Jack has been drawing again. Sketches, paintings and works in progress are dotted around the room. A number of drawings feature his character who floats in zero-g. And the framed birthday drawing of Andre is now hanging up on the wall. He sees evidence of Jack and Poppy hanging out up there the night before - records out, wine glasses. INT. TURNER HOME - BEDROOM - NIGHT Poppy is fast asleep. Jack, beside her, has just woken. He thinks he hears a creak in the floorboards. Listens... INT. TURNER HOME - HOME OFFICE - NIGHT Cameron goes to his desk, finds a spare pair of AR GLASSES in the drawer, puts them on. The AR screens wake up. Cameron scans through his messages. All seems to be fine. Jack and Poppy communicating just as he and Poppy used to. A GIF Poppy sent him of the moment they told Cory he was going to be a big brother. Cameron takes it all in. He spots the ORIGAMI ARMADILLO from when he first saw Poppy, sitting on the desk. He picks it up, looks at it fondly. Just then, the door opens. Cameron jumps, swings around in his chair. He sees Jack there. Then Jack holds his hand up. Shhh. Jack quietly steps into the room, closes the door behind him. An ultra charged beat as they stand there in silence. But as Jack stands there looking over at Cameron, it becomes clear that he has no anger, just empathy. JACK It’s OK. Do what you need to do. 88.",
      "characters": [],
      "action_text": "Cameron looks at him, nods. INT. TURNER HOME - STAIRS - NIGHT Cameron quietly pads down the stairs behind Jack. Both men are trembling. At the bottom they round the corner. Just then Ellington bursts in through the dog flap and scurries into the house. When he sees two Camerons he screeches to a halt. Cameron and Jack freeze in their tracks. No one breathes... A tense beat. Ellington double takes but rather than bark, he turns on a dime and bolts into the back garden like a rocket. Cameron and Jack breathe again. Jack heads to the store room under the stairs. Cameron nods. They look at each other. Jack whispers, emotional. JACK Hey... Just... Be careful. Please. Cameron nods. I will. Jack steps into the store room. They share a last nod of trust and Jack shuts the door behind him. Cameron strips down to his boxers and t-shirt. He takes a deep breath, readies himself, then moves for the stairs. INT. TURNER HOME - STORE ROOM - NIGHT Jack paces, listening to the creak of Cameron walking upstairs. Every worst case scenario pulses through his mind. INT. TURNER HOME - CORY’S BEDROOM - NIGHT Cameron pads into Cory’s room. He notices his OLD PENCIL SET by Cory’s bed. More of Jack’s recent handiwork. Nice. Cory is fast asleep. Cameron goes to his side, watches his boy for a moment. Forces himself to stay strong. He takes a deep breath and gently shakes Cory’s shoulder. CAMERON Hey, Doc? Doc? Wake up. Cory stirs. Cam shakes him gently again. Cory wakes, sleepy. CORY What’s wrong? 89. CAMERON I just had a really bad nightmare. Wanted to see you. CORY ...What was it about? CAMERON It doesn’t matter. It’s OK now. (smiles) Hey, I have an idea. INT. TURNER HOME - KITCHEN - NIGHT Cameron and Cory are in the kitchen. Cameron has prepared edamame beans in a bowl with salt. He pours apple juice into glasses. Cory, in his pajamas, catches eyes with Cameron.   This is outrageous, Dad.   Cory giggles. Cameron laughs too. CAMERON We’re gonna pretend that this is beer, OK? My first was wit",
      "dialogue_count": 0,
      "word_count": 1461
    },
    {
      "scene_number": 18,
      "slugline": "INT. TURNER HOME - STORE ROOM - NIGHT Jack sits there, an emotional wreck. Just then, he hears footsteps above him, someone coming down the stairs. CUT TO: Out in the living area, Cameron comes down the stairs and stands there. He looks around the house one last time. So many memories.   Goodbye house.  He has done what he came to do. He turns to go back to the store room for Jack. Just then, Ellington cautiously comes inside through the dog flap and approaches, wagging his tail. Cameron looks down. Seeing Ellington melts his heart. CAMERON Pig. Cameron crouches down to Ellington. Now he crumbles. He hugs and kisses his dog close to him, his shoulders heaving. Jack watches through the from the store room, welling up. I/E. LYFT STEED / TURNER HOME - NIGHT Later. A Lyft Steed is parked down the street. Cameron sits in the back with Jack. No one speaks for a while. When Jack speaks again, his voice is frail. JACK ...Thank you. CAMERON (smiles, teary) Take care of them. JACK I will. Nothing is said for a while. Nothing needs to be. This is goodbye. They hug. Nothing is left to be said. Jack turns and gets out of the car. We stay with him as he watches Cameron drive off. FADE TO BLACK. 95.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 223
    },
    {
      "scene_number": 19,
      "slugline": "EXT. BARRA HOUSE – LOOK OUT POINT - DAY Some days later. Cameron's looking out on the beautiful landscape, drawing. He looks weak but peaceful. Jo approaches and watches Cameron work. He’s drawing a beautiful lonely image of his floating character in a vast landscape. Watching him work in this setting is moving. She sits next to him on the bench. JO ...As of this morning, he’s officially Cameron Turner. He’ll never know about any of this. Cameron digests this information. It seems to give him some comfort. He looks back out to the surrounding landscape. CAMERON Good... Good. Thank you, Doc. Jo smiles, emotional now. He smiles at her. JO Thank you. They both look up and watch a flock of starlings overhead, a beautiful murmuration. Jo's next words come from somewhere deep in her being. JO (CONT’D) ...It’s hard to be left behind. This sentence hangs in the air around them as they share a silent moment together. Jo brings her gaze back to Cameron's moleskin drawing. JO (CONT’D) ...The new client is about to arrive. Come down to us when you’re done speaking with him. Jack left you something. Cameron looks at her, curious. But that’s all she’s saying. EXT. BARRA HOUSE - FOREST CLEARING - DAY We see Cameron speaking to the new arrival on the bench where he first met Kate. The new client is a YOUNG MAN, no older than twenty five. 96.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 240
    },
    {
      "scene_number": 20,
      "slugline": "INT. BARRA HOUSE - HALLWAY - DAY Later. Jo leads Cameron into Lab One then turns and leaves the room. She joins Dalton in the Control Room. In Lab One, Cameron walks into the room and stands in front of the LED WALL, as the lights dim and the LED WALL turns on. On the LED WALL in perfect resolution we see a recording of Jack’s POV. He has recorded something with his contacts before they wiped him... ON VIDEO - Jack’s in the TURNER KITCHEN approaching Poppy. She’s chopping some carrots. Jack puts a cup of coffee on the table and approaches. JACK (V.O.) Babe? POPPY Mmm? JACK (V.O.) Tell me you love me. POPPY Love you. JACK (V.O.) No... Jack comes up behind her, gives her a little cuddle. POPPY (laughing) Cam, what are you doing? I’m chopping stuff. Cameron is tearing up, watching the video as Jack turns Poppy around to face him. JACK (V.O.) For real, P. POPPY What? JACK (V.O.) Look me in the eyes and tell me you love me. POPPY (laughing) What are you doing? 97.",
      "characters": [],
      "action_text": "JACK (V.O.) Just. Come on. For real. I need to hear it. Poppy smiles.   Weirdo.   But she sees that he means it. POPPY OK... She looks him in the eyes a moment. Tender. Cameron is watching the video, deeply moved, as Poppy looks right into the camera, and with love says: POPPY (CONT’D) I love you Cameron Turner. Always have. And always will. She looks at him tenderly before moving forward to kiss him. POPPY (CONT’D) How was that..? We can hear in Jack’s voice that he is moved. JACK (V.O.) ...That was good. Poppy chuckles. A beat. The recording stops there, paused on Poppy looking into camera, smiling with total love. Cameron stands in Lab One looking at Poppy on the screen. Jo is welling up as she watches Cameron standing there, alone, in front of the screen. Back with Cameron, his eyes open again, looking at Poppy’s beautiful smiling face, paused, looking right at him. Cameron's nodding his head now, smiling through his tears. And just above a whisper... CAMERON Parfait. 98.",
      "dialogue_count": 0,
      "word_count": 358
    }
  ]
}