{
  "slug": "ted-lasso-101-pilot-2020",
  "title": "ted lasso 101 pilot",
  "genre": "drama",
  "format": "series",
  "scenes_count": 4,
  "characters_count": 0,
  "characters": [],
  "total_words": 8264,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. GREENWICH FC TRAINING GROUNDS - MORNING We start on the vibrant green PRACTICE GROUNDS of the GREENWICH FOOTBALL CLUB, a mediocre PREMIERE LEAGUE team in OUTER LONDON. The PLAYERS STRETCH and warm up. EXT./INT. GREENWICH FC OWNER’S OFFICE We see those same players out a window. MOVERS bring items in and out - it’s an office in transition. The team’s new owner, REBECCA WELTON, (40s, resilient, hides blue-collar roots), STARES inscrutably at a small PAINTING on her wall. Almost as if she was looking through it, BEYOND it. HIGGINS, (an “old” 45, middle-management, middle everything) enters with a cautious knock on the open door. Rebecca stays focused on the painting. REBECCA I gave this to Rupert on our fifth anniversary... HIGGINS You have exquisite taste, ma’am. REBECCA (takes it off wall) Do you want it? HIGGINS But... it’s a Hockney. It’s worth three-hundred thousand pounds. REBECCA Good point. Should’ve said yes. (hands it to mover) Auction pile, please. As Rebecca moves to sit, Higgins glances down at three BRITISH TABLOIDS on her desk. Each has a picture of REBECCA and her ex-husband, the club’s previous owner, RUPERT MANNION. “He gets the bimbos, she gets the bozos.” Rebecca looks up at Higgins, then puts the magazines in a drawer. HIGGINS Mrs. Mannion-- Excuse me - Miss Welton - George is here... The manager? REBECCA Yes I know who George is, Higgins. Please bring him in. Ted Lasso \"Pilot\"   2.1.19   1.",
      "characters": [],
      "action_text": "Higgins leans out the door and sees GEORGE CARTRICK, (late 50’s, old-school MANAGER) flirting, poorly, with a secretary. Higgins clears his throat. George ENTERS WITH SWAGGER. GEORGE Higgy boy. George pretends TO FLICK Higgins in the nuts, causing Higgins to flinch. George then moves to Rebecca, looks around. GEORGE (CONT’D) Love what you’ve done with the place. You do it yourself or did ya have some poof help you? REBECCA (re: his styled haircut) I could ask the same of your hair. (gestures to chair) Please. GEORGE (to Higgins as he sits) Isn’t this one cheeky? Now luv, training starts in a few, so whatever you need to get off your impressive chest, have at it. REBECCA Oh, of course. (then) You’re fired. GEORGE (with a condescending laugh) Right. REBECCA We’ll be buying out the remainder of your contract. I wish you the best of luck. GEORGE Fired? What the fuck for? REBECCA Yes, you do deserve to know the ‘why’ of it all, don’t you? I suppose I could choose from any number of reasons... Your casual misogyny, for one. (MORE) Ted Lasso \"Pilot\"   2.1.19   2. Perhaps it’s your performance, as you have led this team into yet another remarkably-average season. Or maybe it’s because you insist on wearing those tiny shorts even though it forces me to see one of your testicles. (George shifts in seat) Aaand there’s the other one. Six more weeks of winter, I see. But, if I’m being completely honest, George? You’re sacked because I’m the owner now, and I don’t like you. Now sod off, you fat twat. George stands, grabs a tabloid from her desk, chuckles: GEORGE Higgy boy, what do you think is worse? Your husband cheating on you? Or being the last to know? George tosses the TABLOID back on her desk, then EXITS defiantly. Higgins watches him go, AGHAST. REBECCA (cheerful) Is there someone who could pop out and fetch me a salad? HIGGINS ...I’ll send her right in. And as far as new managers go, shall I prepare a list of candidates? REBECCA (sparkle in her eye) No. That won’t be nece",
      "dialogue_count": 0,
      "word_count": 2142
    },
    {
      "scene_number": 2,
      "slugline": "INT. TRAINING FACILITY - OFFICES - MOMENTS LATER Ted and Beard wheel their luggage behind a VISIBLY NERVOUS Nathan, who KNOCKS on Rebecca’s office door. NATHAN I’ll introduce you. REBECCA(O.S.) Come in. INT. GREENWICH FC OWNER’S OFFICE - CONTINUOUS Rebecca works at her desk with Higgins. She turns, brightly. REBECCA Hello? May I help you? Nathan’s about to speak and... He turns and SPRINTS down the long hallway. TED STEPS INTO the FRAME, watching Nathan go, then turning to Rebecca: TED LASSO How ya’ll doin? I’m Ted Lasso. Your new coach. You must be Miss Welton. Ted and Beard enter. Rebecca gets up and greets Ted. REBECCA Oh please, call me Rebecca. Miss Welton’s my father. TED LASSO If that’s a joke, I love it. If not, I can’t wait to unpack that with you. This here’s Coach Beard. REBECCA How delightful to finally meet you both. So exciting. Higgins-- (back to Ted) Oh, this is Higgins, he’s our current director of communications. HIGGINS (under breath, concerned) “Current?” REBECCA Could you please take Coach Beard and have one of the girls get him their IDs, keys, housing information. Whatever they need... Ted Lasso \"Pilot\"   2.1.19   11.",
      "characters": [],
      "action_text": "As Coach Beard heads out with Higgins, Ted confides: TED LASSO Wifi password, Wet wipes-- COACH BEARD --Humidifier. Way ahead of you, Coach. They EXIT. Rebecca moves to the TEA SETUP. REBECCA May I get you something to drink? TED LASSO Yes please. Didn’t sleep much on the plane, so any iced or blended coffee drink ya got - mocha latte, frappuccino - I ain’t picky as long as I can’t taste a hint of coffee. REBECCA I’m afraid we’re not as coffee- centric as you’re accustomed to. How do you take your tea? She pours Ted a cup. TED LASSO Usually I take it back to the counter cause there’s been a horrible mistake. But hey, when in Rome... Rebecca smiles. Ted takes a sip. He smiles and nods. REBECCA Well? TED LASSO Mmm. I always figured tea was just gonna taste like hot brown water. And y’know what? I was right. REBECCA (with a smile) Welcome to England. TED LASSO Speakin’ of which, I wanna thank you for this opportunity. Ted Lasso \"Pilot\"   2.1.19   12. REBECCA Thank you for accepting. I can’t imagine it was an easy decision. Will your family be joining you? TED LASSO Not right off the bat, but we’ll get ‘em over for a visit soon enough. I did have one question for ya, now that we’re here, face to face and all: why me? Why’d you pick me? I’m just curious. Rebecca SMILES. REBECCA (as she stands) Follow me. INT. TRAINING FACILITY - HALLWAY Rebecca stops in front of a WALL COVERED IN PHOTOS and MEMORABILIA. Ted takes in the wall as Rebecca speaks: REBECCA This hall represents our club’s long, albeit modest, history. First match was in 1897. This was taken on that very day. WE SEE an old photo of 11 FILTHY YOUNG MEN holding a banner that says “GREENWICH FC”. Ted looks closer. TED LASSO Oh man, these fellas are just covered in muck. Musta’ been a heckuva game. REBECCA Actually that photo was taken before the match. That’s how everyone looked in the 1800s. Ted moves to a section labeled “CLUB OWNERS”. They’re all photos of old, wealthy, white men. Ted stops at one. TED LASSO Wa",
      "dialogue_count": 0,
      "word_count": 4707
    },
    {
      "scene_number": 3,
      "slugline": "EXT. CROWN AND ANCHOR - NIGHT Establishing shot of MAE’S PUB. We PRE-LAP TED: TED LASSO (O.S.) ... No, no hints, I got it. The four countries in England are... INT. CROWN AND ANCHOR - CONTINUOUS We find Beard and Ted eating at a table, pints half-full. TED LASSO Wales... (Beard nods for each) England again somehow, Scotland, and... Ireland? COACH BEARD (no nod) That’s a whole other conversation. On the television we see former coach, GEORGE CARTRICK. GEORGE (ON TV) ...Ted Lasso? Beard turns to watch. Ted remains focused on his meal. GEORGE (CONT’D) Ted Lasso’s a joke. But not a funny joke, like: “What’s the hardest part about eating a vegetable? Swallowing the wheelchair.” He’s the opposite of that, ‘cause that’s a joke that makes people happy. COACH BEARD Asshole. TED LASSO Hey, c’mon now. You know that anytime someone is talkin’ ‘bout somebody, that says a lot more somethin’ about that “someone.” COACH BEARD (a bit ashamed) Yeah. Ted Lasso \"Pilot\"   2.1.19   33.",
      "characters": [],
      "action_text": "TED LASSO Well then, let us raise our glasses and wish the best to George: a fellow coach, a leader of men, a-- COACH BEARD Asshole. They both laugh and RAISE THEIR PINTS. Suddenly, Ted’s chair is YANKED BACK, SCREECHING loudly. MAE NOTICES. Our three LOCALS from earlier, now drunk and imposing, stand over Ted. BAZ You think you can come here and fuck up our club? TED LASSO Whoa. How y’all doin’? I’m Ted Las-- JEREMY We know who you are. Time for you to get the fuck outta here, mate. TED LASSO Fellas, we’re just gonna finish our meals then-- BAZ (in Ted’s face) Listen, you cunt. You don’t leave right now, there’s gonna be a big fuckin’ problem. COACH BEARD (casual but terrifying) Not for us. TED LASSO Easy now, Coach. Ted chooses to defuse the situation. TED LASSO (CONT’D) Tell ya what, gentlemen: We’re just gonna get a couple doggie bags and head out. That sound okay? Mae steps in. MAE Nope. Stay put and eat the food we made ya. (turns to guys) (MORE) Ted Lasso \"Pilot\"   2.1.19   34. You’re banned for two weeks, Baz. That goes for all three of ya. PAUL I didn’t even say nothin’! MAE You heard me! Now go. The guys MOVE BACK to the bar to grab their coats. MAE (CONT’D) And leave a fuckin’ tip. They all do so. Mae comes back to Ted and Beard’s table. MAE (CONT’D) I was born in 1940; the day before the Blitz began. Since that moment, I’ve witnessed young men shipped off to war, the Smog taking the lives of thousands, the Kray Twins running our streets, IRA bombings, that cow Thatcher, the riots, the fires, The Spice Girls, not to mention the breathtaking stupidity of this entire Brexit fiasco, which brings us to now. TED LASSO I’m sorry ma’am, but what does all that have to do with me? MAE We’ve gotten through worse. TED LASSO Thank you, ma’am. MAE Tonight’s on me. COACH BEARD Great fish and chips, ma’am. Mae eats one of his chips. MAE I know. She walks off. MAE (CONT'D) Ted Lasso \"Pilot\"   2.1.19   35.",
      "dialogue_count": 0,
      "word_count": 526
    },
    {
      "scene_number": 4,
      "slugline": "EXT. CROWN AND ANCHOR - LATER Ted and Beard exit with their luggage. The entrance to TED’S APARTMENT is only a FEW DOOR FRONTS DOWN. TED LASSO This is me. You good? COACH BEARD Yeah, I’m just a few doors down. G’night Coach. TED LASSO G’night Coach. Ted enters his brownstone. INT. TED’S APARTMENT - EVENING Ted OPENS the door. His HAND SEARCHES the wall for a light switch, NOTHING. He turns on the FLASHLIGHT on his phone and SPOTS the switch at the END of a hallway. TED LASSO (re: switch) Well that’s just a lack of thoughtful planning. He ENTERS, and FLIPS the lights on.  MUSIC CUE: “Opus 26” by Dustin O’Halloran   (No pressure, but we’d really love it if you played this as you read the rest) Ted’s new home is small, but not cramped. We start in the LIVING ROOM - a couch, side tables, an easy chair that faces a decent television. WET WIPES and a SMALL HUMIDIFIER sit on a coffee table, along with a gift basket of local fare. A card reads: “Welcome Coach Tim Lasso.” Ted pulls out a bag of CIRCULAR CHIPS, looks at the label: TED LASSO (CONT’D) “Hula Hoops”. Don’t mind if I do. Ted tries one. Yum! He mows through them as he enters the DINING ROOM. The table seats four but has a SINGLE PLACE SETTING. Ted flips another light switch, revealing the kitchen. It’s serviceable. Next comes a tiny hallway: To the right, the BATHROOM. To the left: the BEDROOM, which is actually quite nice: Decent closet space, a chest of drawers, and a comfortable mattress, thank goodness. There’s ANOTHER DOOR in the corner. Ted OPENS it and finds that it leads back into the living room. “Huh.” Ted checks his watch, then does some QUICK MATH on his fingers. Ted Lasso \"Pilot\"   2.1.19   36.",
      "characters": [],
      "action_text": "IN CUTS: We see Ted UNPACK his suitcase; putting things in drawers, hanging clothes in the closet. He takes a SHOWER. Brushes his teeth. Throws on some PITT STATE SWEATS and makes his way back to the living room. His phone   DINGS ; commencing a TEXT EXCHANGE with Coach Beard:  COACH BEARD : here ya go coach nghub_4199/password  TED LASSO : Thanks Coach. But what’s the password?  COACH BEARD : the password is password all lower case.  TED LASSO : Hope we don’t get hacked! Would hate for folks to find out about your extensive collection of kitten GIFs.  COACH BEARD : lol He opens his laptop and searches for the wifi signal. Two dozen router names appear: some silly, some filthy, some... like Ted’s. He opens up Skype, and clicks on the only saved contact:   “HOME.”   The computer   RINGS . And   RINGS . Ted appears anxious for the first time since we’ve met him. And then-- YOUNG BOY (V.O.) (from computer) Hello? Dad? TED LASSO Hey buddy! Can ya hear me okay? YOUNG BOY (V.O.) Dad? ...Dad, you there?   TED LASSO (CONT'D) Hello? Son? I can’t see you. WOMAN’S VOICE (V.O.) What’s wrong? YOUNG BOY (V.O.) Dad’s gotta a crappy sig-- Ted walks a lap around the apartment with his laptop. TED LASSO How about now, any better?   YOUNG BOY (V.O.) I can barely hear h-- WOMAN’S VOICE (V.O.) Just have him call the land-- YOUNG BOY (V.O.) But I wanna see his face. TED LASSO Helloooo? YOUNG BOY (V.O.) Dad? Dad. Call the landline. TED LASSO But I wanna see your face. Ted Lasso \"Pilot\"   2.1.19   37. YOUNG BOY (V.O.) Just--land line--okay? Back in the living room, Ted calls. We don’t hear the other side. TED LASSO Hey big guy! Sorry about that... how ya doin’, how was school today? ...Oh right. I forgot, ha. I tell ya, I got that ‘jet lag’ stuff real bad, feel a little loopy... Haha, yeah you could say that... What’s that now...oh, yeah, it’s good, ya know...no, that all starts tomorrow ...So hey, me and your mom are gonna find a time for y’all to come out and visit, how’s that sound... h",
      "dialogue_count": 0,
      "word_count": 889
    }
  ]
}