{
  "slug": "tell-me-a-story-101-chapter-1-hope-2018",
  "title": "tell me a story 101 chapter 1 hope",
  "genre": "action",
  "format": "series",
  "scenes_count": 5,
  "characters_count": 0,
  "characters": [],
  "total_words": 9517,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. SHERMAN TOWNHOUSE - KITCHEN - MORNING Standing at the stove, scrambling eggs is COLLEEN SHERMAN, attractive and sexy in her 60’s -- a woman who never stands at a stove.   But here she is, attempting to cook breakfast. Tim sits at the kitchen counter where food is laid out. Bacon, toast, juice...   Kayla enters.   Tim looks up from his coffee. TIM Your grandmother is making eggs. COLLEEN I’m making an effort, not sure they’re eggs. Colleen eyes Kayla’s revealing outfit. COLLEEN Don’t you look nice.   Very sexy. Tim looks at his mom.   Really? TIM Here sit, eat something. Kayla takes a seat, picks at some bacon.   Colleen serves up the eggs. COLLEEN I was slutty when I was your age too. WTF?   Tim looks at his mother, surprised.   So does Kayla. COLLEEN Well, I was. TIM Let’s not talk about it. Kayla rethinks her look.   She readjusts her top, buttoning up her cleavage.   It’s instantly more modest. COLLEEN The truth is in the breakfast, son.   Have you tried the eggs? The Sherman women were not made for the kitchen. (CONTINUED) 12.",
      "characters": [],
      "action_text": "TIM Mom.   Stop. Then, he sees Colleen looking at Kayla -- he looks too, realizing Kayla has buttoned up her shirt.   Colleen returns to the stove -- that was easy. KAYLA I’m not really a breakfast eater... Grand...mother. COLLEEN Then I won’t make it again and if Grandmother is as hard to say as it is to hear, you can call me Colleen. TIM (to Kayla) Do you have everything you need for school?   That lady in the office has my number if-- KAYLA (cuts him off) It’s all taken care of.   I should go.   (to Colleen) Thank you for breakfast. Kayla looks to her dad as if to show that she can be polite, sweet even... just not to him.   She gets up and starts out. COLLEEN Do you have a raincoat?   It’s wet out there. KAYLA No, I’m good. COLLEEN No, no, I have a slicker you can wear. Colleen races to the hallway where coats hang on hooks. She finds a SLICKER -- BLOOD RED.   She holds it up. Kayla takes one look at the HOODED RAINCOAT -- oh hell no.   There is no way Kayla is putting that on her body. KAYLA I’ll be okay.   Thanks anyway. CONTINUED: (CONTINUED) 13. Kayla quickly races out.   Colleen turns to her son.   They share a look. EXT. WEST SIDE HIGH SCHOOL - MORNING An old structure tucked between buildings on a quiet street in the Village.   Signage indicates it’s the West Side High School.   STUDENTS arrive, loiter... the morning norm. INT. HIGH SCHOOL - CORRIDOR - MORNING A crowded New York City charter school.   In all its urban glory.   STUDENTS push and shove their way down a locker lined hallway.   Kayla appears in the sea of students. She’s trying hard not to look overwhelmed.   She makes her way to her locker. ETHAN HUGHES, 17, watches her from his locker nearby. He’s a cute kid, tries too hard, overly cool, not as tough as he appears.   He sees Kayla struggle with her combination lock.   He watches her a moment.   Then, he walks over with faux bravado. ETHAN You new? KAYLA Yeah. ETHAN I’m Ethan. KAYLA Kayla. ETHAN You live around here? KAYLA Just moved here.  ",
      "dialogue_count": 0,
      "word_count": 2440
    },
    {
      "scene_number": 2,
      "slugline": "INT. SHERMAN TOWNHOUSE - DINING ROOM - NIGHT Tim is at the table eating.   Colleen pours a glass of wine for herself.   Actually, it’s a refill.   Colleen likes to drink. TIM Where’s Kayla? COLLEEN She went to bed. TIM Did she say how it went today? COLLEEN She did, she said it was, “whatever.” Tim sighs. INT. SHERMAN TOWNHOUSE - KAYLA'S BEDROOM - NIGHT Kayla lounges on the bed with her cell.   She face-times with a FRIEND -- TISHA, from California. KAYLA High school is another world here. There’s no campus, just the sidewalk and street and you take elevators to class.   It’s weird. This is a different Kayla.   Softer.   More at ease.   Tisha is a good friend and Kayla has lowered her walls. TISHA Don’t be so down on New York. It’s the greatest city in the world. KAYLA Says who?   Cite your source. TISHA Um...Expedia?   Hamilton?   I’m trying to be positive, Kayla. Have you met any friends?   Hot guys? Kayla makes a bug face.   Shakes her head.   Big fucking no.   This Kayla even has a sense of humor.   Tisha laughs. (CONTINUED) 25.",
      "characters": [],
      "action_text": "TISHA Gotta give it time. A GROUP OF GIRLS are heard OFF CAMERA.   “C’mon, Tisha.” “Let’s go.”   She looks at them-- TISHA I gotta go.   I love ya.   Smooches. KAYLA I miss you.   Bye. The call disconnects.   The silence penetrates.   It turns to sadness real quick.   But Kayla shuts it down.   She refuses to hurt.   The wall goes back up. She throws the phone down, starts to get up when it DINGS.   She quickly grabs it.   Who is it? CLOSE ON CELL.   FACEBOOK FRIEND REQUEST.   She taps it. LANEY REED.   She accepts.   She begins to scroll Laney’s FACEBOOK page when she gets an INSTANT MESSAGE. LANEY -- WHAT’S UP? Kayla types back -- BORED. U? LANEY -- DO YOU HAVE A FAKE ID? Intrigue, intrigue.   Off Kayla’s face-- INT. SHERMAN TOWNHOUSE - STAIRCASE - NIGHT A barefooted Kayla comes down the stairs, holding her heels.   She wears a hot club dress.   Sexy is an understatement. She peeks into the kitchen, sees her Dad and Colleen. She tip toes out the front door without a peep.   Once outside the door, she slips into her heels and takes off down the street. INT. WALL STREET BAR - BACK OF BAR - NIGHT The bar is in full swing.   Mason has made his way to Trina and they’re drinking and laughing.   Nearby, Jesse and Peter drink. CONTINUED: (CONTINUED) 26. PETER It’s probably just a screw up. Did you call your Dad’s insurance company? JESSE Oh yeah, it’s confirmed plus interest.   I don’t understand how I can make 200k a year and be broke? PETER You’re a good kid.   Your Dad’s lucky to have you.   I hate my Dad. He’s an asshole. (looks off) Where’d Derek go? Jesse looks to a table across the room.   Connor Price sits all alone, nursing a drink, and texting away. PETER I think someone needs company. Peter starts over. JESSE Where are you going? PETER To make a good impression. JESSE Wait, wait, wait.   Will you hold this for a second? She means her drink.   Peter takes it.   Then, Jesse takes off for Connor’s table.   She looks back.   Sucker.   Peter scoffs.   Oh fuck you.  ",
      "dialogue_count": 0,
      "word_count": 2301
    },
    {
      "scene_number": 3,
      "slugline": "INT. NICK’S APARTMENT - NIGHT A small dark apartment.   It’s on the cheap.   There’s no money here.   A lock turns.   A door opens and Kayla and Nick enter.   He shuts the door-- NICK You wanna drink-- Kayla jumps him.   She throws her arms around him and pulls him into a kiss.   It turns heated quick. MOMENTS LATER.   Sexy MUSIC PLAYS.   Kayla and Nick are on his bed.   They take turns as the aggressor.   Clothes shed quickly.   Flesh on flesh.   Their bodies find an instant groove.   It’s heated and hungry. Kayla loses herself in the act.   Escaping in it.   A freedom takes over -- the world falls away. EXT. WALL STREET BAR - NIGHT Later, Jesse exits the bar with Connor and his assistant, Louise.   Connor is a fun and lively drunk. CONNOR Where’s our ride? Louise points to the limo in front of him.   If it were a snake... LOUISE Right here, sir. CONNOR Let’s go. Jesse is on her phone-- JESSE I’m fine, I’ll Uber. CONNOR We can take you.   Louise, we’re taking this woman home.   Okay? Jesse feels obliged.   Also, more face time with the big shot. JESSE Okay, why not? (CONTINUED) 37.",
      "characters": [],
      "action_text": "Louise holds out the door for her.   Jesse crawls inside. Before Connor gets in he looks to Louise. CONNOR You can cab it, right? LOUISE Sure, seeya tomorrow. And just like that Louise is gone.   Connor hops inside and shuts the door. INT. LIMOUSINE - NIGHT Jesse sits on the reverse seat, facing Connor.   The limo starts to move before Jesse realizes-- JESSE Where’s Louise? CONNOR It’s fine.   She took a cab. JESSE I can take a cab. CONNOR Too late.   Where do you live? Jesse is suddenly uncomfortable.   She turns to the driver, through the partition. JESSE 52nd and Tenth Avenue. As she says it, Connor presses a button and the partition quickly closes.   Jesse turns back to him -- now they’re really alone. INT. NICK’S APARTMENT - NIGHT Later.   On the bed, Nick and Kayla lay in the dark, naked amongst rustled sheets. NICK Want something to drink?   Or eat? KAYLA I’m good. CONTINUED: (CONTINUED) 38. They lay there in the silence.   His finger traces the tattoo that curves around Kayla’s back and hip. NICK What is this symbol? Kayla doesn’t answer.   Nick explores it with his lips. Then, he truly examines it-- NICK It’s tribal. Kayla nods.   He continues to trace it until he sees the outline of a mouth, teeth... NICK It’s a wolf.   I see it now. Kayla puts her finger to her nose.   Ding, ding, ding... It took a second but it’s visible to him -- the face of a wolf, teeth exposed, stares at him. NICK Any personal meaning behind it? KAYLA I thought it was cool.   I haven’t had it that long. Kayla looks down at her tattoo, touches it. KAYLA My mom was Native American.   She believed in spirit animals-- (off his look) Don’t laugh. NICK I’m not. KAYLA It was her thing.   Spirit animals. So stupid.   Except for the wolf. I always liked the wolf.   They’re usually pack animals.   But, sometimes a wolf is separated from their pack.   They’re all alone and have no one but themselves to rely on.   So, it’s important for them to develop great strength and intuition.   They have t",
      "dialogue_count": 0,
      "word_count": 1375
    },
    {
      "scene_number": 4,
      "slugline": "EXT. NEW YORK CITY SKYLINE - MORNING A mass of steel, glass, and everything else that makes up this forest of urban life. INT. RILEY APARTMENT - BEDROOM - MORNING Beth lays in bed, wide awake, last night weighing heavily on her.   She turns to Jordan sleeping next to her. A quiet moment as the morning light frames him just so. He looks peaceful... perfect.   Just then, his eyes flutter open.   He looks at her a moment.   Hey... BETH Still wanna come with me today? To the rally? JORDAN Do you still want me too? Beth nods.   Yes, please.   Jordan smiles.   Okay, then. Tension... trepidation could cut the air but at least they’re both trying. INT. SHERMAN TOWNHOUSE - MORNING Kayla dresses for the day when Colleen appears in the doorway. COLLEEN Rough night? Kayla shrugs.   Whatever. COLLEEN You put your Dad in a tizzy. KAYLA He’ll get over it. Colleen watches Kayla fuss with her hair in the mirror. COLLEEN You’re so pretty.   Just like your mother. KAYLA You hated my mother.   She told me. (CONTINUED) 44.",
      "characters": [],
      "action_text": "COLLEEN I did not hate your mother, I just didn’t like her.   Something about her I didn’t trust.   And I was right.   The minute she married my son she took him away from me, all the way to California. KAYLA You could have visited. COLLEEN I did. KAYLA You came to the funeral. COLLEEN I visited when you were little but the damage was done by then.   We never clicked, your mom and me. That was my fault.   I blamed her for making my son happy and I punished her for it. A very honest admission.   Kayla stares at her, trying to make sense of it. COLLEEN Here’s some helpful information about me.   I’m not a great person. I was never a good parent.   Your dad has this stupid idea that I’m going to be a good influence on you.   That my parental guidance will magically get you back on the right path.   We both know that’s not going to happen. KAYLA He’s clueless. COLLEEN Can be.   He’s like his father.   He only sees what’s wrong and wants to make it right.   Not a horrible quality, just a useless one.   He doesn’t understand that most of us live in between right and wrong. (then) I really fucked things up with your mom.   I’m sorry about that. CONTINUED: (CONTINUED) 45. Colleen exits.   Silence.   Off Kayla -- her grandmother’s words lingering. INT. CLAYTON WEALTH MANAGEMENT - BULLPEN - MORNING Jesse arrives for work.   She’s instantly met by Mason. MASON You went home with Connor Price? JESSE No, he gave me a ride.   Who told you that? Derek is there as well.   A face of confusion. DEREK You certainly made an impression. He wants to see you.   What happened last night? JESSE Nothing happened.   He offered me a ride, I accepted.   I would never sleep with him. MASON I would. Derek is bothered... suspicious. DEREK Well, he wants to see you now. What’s going on? JESSE I don’t know. Jesse is confused by it all.   Derek presses. DEREK Connor Price is a game changer for us. JESSE I understand. DEREK Is there something I need to know? Do you want me to go with you? CONTINUED: (",
      "dialogue_count": 0,
      "word_count": 3276
    },
    {
      "scene_number": 5,
      "slugline": "INT. JEWELRY STORE - DAY Jordan goes to the GUARD who is bleeding out on the floor.   The blood spreads and pools around his body.   His eyes are lifeless.   He’s dead.   Jordan turns to Beth. She’s still perched on her knees, frozen.   Terrified.   He goes to her when her BLOUSE begins to BLOSSOM RED. She was struck by a BULLET. JORDAN No, no, no, NO, NO!!! Beth looks down, clutching a bloody stomach-- She tries to speak... no words come-- Jordan grabs her body as she slumps to the floor. JORDAN Beth.... NOOOOOOOOOOO! Jordan holds her, looking down, watching as the life leaves her body.   She’s dead one second later. Jordan cries out -- gutted.   His world ripped from him. END OF PILOT. 60.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 125
    }
  ]
}