{
  "slug": "tenet-2020",
  "title": "tenet",
  "genre": "action",
  "format": "film",
  "scenes_count": 29,
  "characters_count": 0,
  "characters": [],
  "total_words": 28356,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. RAIL YARDS – DAY The Protagonist, tied to a chair, in a windswept rail yard. In front of him, the ‘Target’, also tied to a chair, back to us. The Driver steps back, SWEATING. BLOODY PLIERS in hand. DRIVER (breathless) A man can be trained to hold out for about eighteen hours. The Driver gestures at a CLOCK on a table – DRIVER (CONT'D) So your colleagues will clear by 7. The Driver PUSHES the ‘Target’s chair over. The ‘Target’ lands hard on his side on the gravel. Groaning. DRIVER (CONT'D) He didn’t last eighteen minutes. The Driver pulls out a KNIFE. Leans in to the Protagonist – DRIVER (CONT'D) But he didn’t have anything to hide. You were smuggling a nobody. The knife moves towards the Protagonist’s throat... DRIVER (CONT'D) Risky. ...then to his collar – which he CUTS – DRIVER (CONT'D) Or were you counting on this? ...pulling out a SILVER CAPSULE. The Protagonist stares. DRIVER (CONT'D) Death, CIA issue. The Driver TOSSES the pill, WAVES the pliers at the clock – DRIVER (CONT'D) Spare yourself once they’re clear. The Protagonist looks at the clock – ‘5:38’. A FREIGHT TRAIN RUMBLES PAST, CLOSE... As we close in on the clock, THE PROTAGONIST’S SCREAMS ARE DROWNED OUT BY THE FREIGHT TRAIN... The Driver steps back. The Protagonist breathes heavy, blood dribbling... the Driver follows his gaze to the clock – ‘6:53’ – then checks his watch. Frowns theatrically, picks up the clock, SHAKES it –  7.",
      "characters": [],
      "action_text": "DRIVER (CONT'D) Running fast... The Driver SETS THE HANDS BACK ONE HOUR. The Protagonist watches, DESPAIRING... as the Driver puts the clock back on the table, the Protagonist notices the ‘Target’s FINGERS WIGGLING... in them is a SILVER PILL... Freight trains rumble past in opposite directions, sound BUILDING... The Driver approaches, bloody pliers in hand – PROTAGONIST We were alone. DRIVER I didn’t ask. Which means we’re finally getting somewhere. The Protagonist HURLS himself onto the ‘Target’s hands – face SMASHING – gets the PILL into his mouth – BITES DOWN – DEAFENING TRAIN NOISE... Arms GRAB at him – HANDS PRY his jaw as he SEIZES, MOUTH FOAMING... the Protagonist’s EYES GLAZE and we – CUT TO: Black screen. Supertitle: TENET FADE IN: The Protagonist opens his eyes. A man stands beside his bed. SWAYING gently. This is FAY. FAY Welcome to the afterlife. The Protagonist lifts his head and we are – INT. BOAT AT SEA – DAY The Protagonist sees the STEELY OCEAN SWELL... FAY You’ve been in a medically induced coma while we got you out of Ukraine and rebuilt your mouth. PROTAGONIST The pills are fake? FAY We swapped yours for a sedative.  8. PROTAGONIST Why? FAY A test. The Protagonist runs a finger around his mouth. REALIZING. PROTAGONIST Test? They pulled my teeth out. Fay lets that dissipate. The Protagonist closes his eyes. PROTAGONIST (CONT'D) Did the team get clear? FAY No. Private Russians, we think. PROTAGONIST Somebody talked. FAY Not you. You chose to die instead of giving up your colleagues. EXT. DECK OF THE BOAT – LATER The Protagonist stands in the wind, contemplating the horizon. FAY (O.S.) We all believe we’d run into the burning building, but until we feel that heat... we can never know. You do. PROTAGONIST I resign. FAY You don’t work for us – you’re dead. The Protagonist turns to Fay, confused. FAY (CONT'D) Your duty transcends national interests. This is about survival. PROTAGONIST Whose? FAY Everyone’s. There’s a cold war. Cold as ice. To even kno",
      "dialogue_count": 0,
      "word_count": 883
    },
    {
      "scene_number": 2,
      "slugline": "EXT. WIND TURBINE – CONTINUOUS A large CATAMARAN nosed up to the windmill, ladder in place, MAINTENANCE CREW in HI-VIZ VESTS moving on and off the turbine. Other boats service other turbines. The Protagonist pulls on his VEST and CLIMBS down onto the catamaran. EXT. EUROPEAN PORT – DAY The Protagonist disembarks with the rest of the wind-farm crew. As they file past a car the driver, also in hi-viz, steps out into line, leaving the door open, engine running. The Protagonist gets in. The GPS is already set... EXT. OFFICE COMPLEX – LATER A bland suburban office park. The Protagonist gets out of the car, wearing his hi-viz and carrying a clipboard. Heads inside, passing numerous STAFF coming out... INT. LOBBY, OFFICE COMPLEX – CONTINUOUS The Protagonist moves through the lobby unimpeded. Checking the tenant listings he sees – ‘WINDFARM TRANSITIONS – B-2’. INT. CORRIDOR – CONTINUOUS The Protagonist walks up to B-2. FEMALE VOICE (O.S.) With a hi-viz vest and a clipboard, you can get almost anywhere. Almost. The Protagonist turns to find a brusque young woman. This is BARBARA. He joins his hands, interlacing the fingers... PROTAGONIST A pretty obscure tenet. Using a key card, she ushers him through a door into – INT. OFFICE, LABORATORY – CONTINUOUS Barbara hands the Protagonist a cup of tea. BARBARA No small talk, nothing that might reveal who we are, or what we do. PROTAGONIST I thought I was here to find out what we do.  11.",
      "characters": [],
      "action_text": "BARBARA You’re not here for ‘what’, you’re here for ‘how’. ‘What’ is your department. And not my business. PROTAGONIST Well, to do what I do, I need some idea of the threat we face. Barbara considers the Protagonist. Sips her tea. BARBARA As I understand it, we’re trying to prevent World War Three. PROTAGONIST Nuclear holocaust? BARBARA No. Something worse. INT. SHOOTING RANGE – MOMENTS LATER Barbara hands the Protagonist a semi-automatic. He reflexively checks the chamber and magazine – EMPTY. BARBARA Aim it and pull the trigger. The Protagonist SHRUGS, lifts the empty pistol, sights a target 25m away with several holes in it... He squeezes the trigger – BAM! – a shot. He is CONFUSED... BARBARA (CONT'D) Check the magazine. The Protagonist checks the clip – THERE IS A ROUND IN IT. PROTAGONIST How? Barbara pulls on PROTECTIVE GLOVES and removes the round from the clip, placing it next to an identical one on a table. BARBARA One of these bullets is, like us, travelling forwards through time. The other one’s going backwards. Can you tell which is which? The Protagonist shakes his head. Barbara reaches forward – BARBARA (CONT'D) How about now? –  12. One of the rounds FLIES UP INTO HER HAND, FALLING IN REVERSE. The Protagonist is taken aback. Barbara holds the round towards him so he can inspect it – BARBARA (CONT'D) It’s inverted – its entropy runs backwards. So, to our eyes, its movement is reversed. We think it’s a type of inverse radiation, triggered by nuclear fission. PROTAGONIST You didn’t make it? BARBARA We don’t know how. Yet. PROTAGONIST So where’d it come from? BARBARA Someone’s manufacturing them in the future. They’re streaming back at us. Barbara places the round on the table, in front of a CAMERA. BARBARA (CONT'D) Try it. He puts on a glove – moves his hand over it, nothing. BARBARA (CONT'D) You have to have dropped it. The Protagonist reaches out again – it LEAPS UP INTO HIS HAND. PROTAGONIST How can it move before I touch it? She cues up the recording ",
      "dialogue_count": 0,
      "word_count": 1516
    },
    {
      "scene_number": 3,
      "slugline": "EXT. HIGH-RISE HOUSE – EVENING ARMED GUARDS patrol the balconies. INT. HIGH-RISE HOUSE – CONTINUOUS Inside one of the magnificent rooms, a middle-aged Indian man mixes drinks. This is SANJAY SINGH. EXT. LOW ROOFTOP NEXT DOOR TO HIGH-RISE HOUSE – CONTINUOUS Neil and the Protagonist race across the roof carrying a sports bag. Neil pulls out a WINCH, the Protagonist pulls out a large CATAPULT, loops it around two pipes, glancing down into the WALLED YARD at the foot of the high-rise house. Neil BOLTS the winch to the roof, the Protagonist sights the upper balcony of the high-rise house, FIRES a ball with a line up and over the balcony railing... EXT. HIGH-RISE HOUSE – CONTINUOUS The Protagonist and Neil lie next to each other as the WINCH RUNS, TENSIONING THEIR ELASTIC LINES... they LAUNCH themselves, FLYING UP to land against the side of the building – They RUN SILENTLY UP THE BUILDING, onto the UPPER TERRACES, SHOOTING TWO GUARDS with silenced pistols... INT./EXT. HIGH-RISE HOUSE – CONTINUOUS Sanjay Singh hands a drink to the Woman in the sari. They move out onto the balcony – EXT. BALCONY – CONTINUOUS The Protagonist surprises Sanjay, holds him at gunpoint – PROTAGONIST (to the Woman) Stay back. (to Sanjay) I was almost taken out by a very unusual type of ammunition in Ukraine. I want to know who supplied it. SANJAY My name’s Sanjay. And you are? (silence) No chit-chat?  19.",
      "characters": [],
      "action_text": "The Woman pushes a RED BUTTON on the wall – PROTAGONIST There’s no one at the other end. No one who’s going to help you, anyway. INT. SECURITY STATION, HIGH-RISE HOUSE – CONTINUOUS An alarm buzzes, the Security Guards are frozen, Neil has a gun on them, a finger to his lips... EXT. BALCONY, HIGH-RISE HOUSE – CONTINUOUS Sanjay tries to turn to see the Protagonist – SANJAY Why would I know who supplied it? The Protagonist pushes his head back around with the gun – PROTAGONIST The combination of metals is unique to India. If it’s from India, it’s from you. SANJAY A fair assumption – PROTAGONIST Deduction. SANJAY Deduction, then. Look, my friend, guns are never conducive to a productive negotiation. PROTAGONIST I’m not the man they send to negotiate... He COCKS his weapon – puts the gun to Sanjay’s head – PROTAGONIST (CONT'D) But I am the man people talk to. SANJAY (charm curdles) I can’t. I can’t tell you. PROTAGONIST You’re an arms dealer, friend – this may be the easiest trigger I’ve ever had to pull.  20. WOMAN (O.S.) To say anything about a client would violate the tenets he lives by... The Protagonist GLANCES at the Woman... whose fingers are casually INTERTWINED. The Protagonist brings his free hand up to hold the gun in both hands, fingers INTERLACED... PROTAGONIST If tenets are important to you, then you can tell me. Everything. WOMAN Not while you have a gun to my husband’s head. The Protagonist releases him. WOMAN (CONT'D) Sanjay, make us a drink. INT. TERRACE OVERLOOKING MUMBAI, SANJAY’S HOUSE – LATER Overlooking the extraordinary bustle of the city. Sanjay has left. His wife hands the Protagonist his drink – PRIYA I’m Priya Singh. PROTAGONIST This is your operation? PRIYA A masculine front in a man’s world has its uses. The dealer you’re looking for is Andrei Sator. PROTAGONIST The Russian oligarch? PRIYA You know him? PROTAGONIST Not personally. Made his billions in gas, moved to London and married an English girl. Said to be on the outs with Moscow. PRIYA",
      "dialogue_count": 0,
      "word_count": 1735
    },
    {
      "scene_number": 4,
      "slugline": "EXT. SHIPLEY’S, LONDON – DAY A BENTLEY pulls up – a DOORMAN opens the rear door, the Protagonist emerges, IMMACULATELY TAILORED, holding a beautiful leather briefcase. INT. SHIPLEY’S – CONTINUOUS The Protagonist is approached by a REPRESENTATIVE – REPRESENTATIVE How can I help, sir? PROTAGONIST I have an appraisal with Ms Barton. REPRESENTATIVE (to receptionist) Tell Kat her client is in the Fallow Room. INT. APPRAISAL ROOM – MOMENTS LATER The Protagonist admires the paintings on the walls. The door opens and the Young Woman from the school gates comes in, dressed for business. This is KAT BARTON. She looks bemused, but gives him a genuine and friendly smile – KAT I’m sorry, I wasn’t notified of any appointments, Mr... PROTAGONIST Goya? KAT Mr Goya? The Protagonist opens his briefcase... PROTAGONIST No, I’m told you’re the person to see about... Offers the drawing to her... PROTAGONIST (CONT'D) ...Goya. She takes it, suddenly interested... KAT Wow. It’s extraordinary. She lays the drawing on the table and grabs a loupe –  28.",
      "characters": [],
      "action_text": "PROTAGONIST What’s it worth? KAT Let’s not get ahead of ourselves. There’s a lot of work before any kind of valuation – provenance, microscopic examination, X-rays... She is bent over the table, peering through the loupe. The Protagonist studies her reaction as he – PROTAGONIST But what does your heart tell you? She steps back. Something about the drawing BOTHERS her... KAT I’m sorry, where did you say you acquired this drawing? PROTAGONIST Tomas Arepo. Kat rises and turns to face the Protagonist. Cold. KAT What do you want? PROTAGONIST What I want is complicated. KAT Do you work for my husband? PROTAGONIST I’ve never met your husband. That’s the reason I’m here. Is there somewhere we can talk? KAT In London? Not really. INT. RESTAURANT – NIGHT The Protagonist and Kat sit at a corner table. PROTAGONIST I bought my Goya for cents on the dollar from an irate Swiss banker. Traced it to Arepo, and realized I’d scored a bargain when he told me who’d paid top dollar for another one of his pictures. Your husband.  29. KAT Where’s the bargain? Your drawing’s an obvious fake. PROTAGONIST My drawing’s a very good fake – you know that better than anyone. The information’s the bargain. KAT The information that I helped defraud my own husband? PROTAGONIST He and I are in related businesses, but he’s a hard man to meet. If you and I were to make an arrangement – KAT Arrangement? You mean blackmail. Don’t be afraid of the word – my husband isn’t. And I’m sorry to tell you he got there first. PROTAGONIST He knows? And he’s never done anything about it? KAT Why would he? PROTAGONIST He paid nine million dollars – KAT Which would barely cover the holiday he just forced us on. PROTAGONIST Where’d you go – Mars? KAT Viet Nam. On our yacht. His yacht. Kat looks the Protagonist up and down... KAT (CONT'D) You’ve got the suit. The shoes, the watch. But I think you’re a little out of your depth. PROTAGONIST (sharp) People who’ve amassed fortunes like your husband’s aren’t generally okay wi",
      "dialogue_count": 0,
      "word_count": 1158
    },
    {
      "scene_number": 5,
      "slugline": "INT. RESTAURANT KITCHEN – CONTINUOUS The Protagonist enters the kitchen, followed by the two thugs. CHEFS and BUSBOYS retreat as the other thug approaches... INT./EXT. ALLEY BEHIND RESTAURANT – CONTINUOUS Kat turns from the window – KAT Please! GAUNT RUSSIAN He wants you to see... INT. RESTAURANT KITCHEN – CONTINUOUS The Protagonist JACKKNIFES HIS LOWER LEG UP into the crotch of the thug behind him – SPINS him into the Thug next to him – POTS and Pans flying – INT. RESTAURANT – CONTINUOUS Volkov wipes sauce with bread, enjoying noises from the kitchen... INT. RESTAURANT KITCHEN – CONTINUOUS The Third Thug SWINGS – the Protagonist DODGES, takes the blow on the shoulder – SLAMS his head into the Third Thug’s neck, leaving him GASPING – the Protagonist GRABS the Third Thug, RACING for the WINDOW... INT./EXT. MERCEDES – CONTINUOUS Kat FLINCHES as, with a CRASH of plates, a body TUMBLES down the stairs... GAUNT RUSSIAN And he gets what he wants. Then she sees something else... the Protagonist exits. KAT Not always, apparently. EXT. ALLEY BEHIND RESTAURANT – CONTINUOUS The Protagonist brushes himself clean, SPOTS the Mercedes, starts moving towards it –  34.",
      "characters": [],
      "action_text": "INT./EXT. MERCEDES – CONTINUOUS The Gaunt Russian SCRAMBLES to get the car moving. Kat looks back at the Protagonist as the car ROARS away... EXT. SCHOOL GATES – DAY Kat is crouched, talking to her son, MAX. The Nanny hovers – MAX Anna says we’re going to Pompeii and see lava. KAT We’ll go together. I’ll be there, too. Max looks up at the Nanny. Kat hugs him, tight. The Nanny TAPS Kat on the shoulder. Kat smiles at her son, tears in her eyes, as the car pulls away. She pulls out her phone, dials... hears a RINGTONE behind her – The Protagonist is there. PROTAGONIST I said I’d surprise you. He’s a cute kid. KAT Max. He’s everything. PROTAGONIST Where’s the drawing? KAT Oslo. At the airport. PROTAGONIST The airport? INSERT CUT: a Rotas car drives across an airport apron, and down a ramp... KAT Do you know what a freeport is? PROTAGONIST A storage facility for art that’s been acquired – ...into a SLEEK facility – the OSLO FREEPORT – as a STAFF MEMBER stands ready to greet a new CLIENT...  35. KAT (V.O.) But not yet taxed. We started a network – Rotas, his construction company, built them, I brought in clients. The facilities are tax havens... The client is NEIL... he takes in the security arrangements... PROTAGONIST (V.O.) The clients can view their investments – EXT. OSLO OPERA HOUSE – DAY The Protagonist is standing on the roof of the Oslo Opera House, briefing Neil... PROTAGONIST (V.O.) – without importing them, so they avoid paying tax. NEIL Sort of a transit lounge for art? We go back to Kat, on the street, briefing the Protagonist... KAT Art, antiques, anything of value, really. PROTAGONIST Anything? KAT Anything legal... Then back to the Protagonist briefing Neil... PROTAGONIST But it’s not unlike the Swiss banking system. Opaque. Back to Kat – KAT Rotas has assets in the Oslo Freeport. I’m guessing it’s there. PROTAGONIST Guessing? Back to Oslo – NEIL Guessing?  36. Back to Kat – KAT We make trips there four or five times a year. PROTAGONIST To view art? KAT An",
      "dialogue_count": 0,
      "word_count": 697
    },
    {
      "scene_number": 6,
      "slugline": "INT. FREEPORT SHIPPING AREA – CONTINUOUS A VAST SHIPPING AREA filled with SHIPPING CONTAINERS – STAFF MEMBER Our logistics department ships to and from other freeports without customs inspection... Neil notices ROTAS containers marked for delivery to TALLINN. NEIL (V.O.) What’re you hoping to find? EXT. OSLO OPERA HOUSE – DAY PROTAGONIST You really want to know? NEIL I’m not sure. PROTAGONIST Bring some lead-lined gloves. NEIL Jesus. Nuclear? PROTAGONIST When you’re on the tour – INT. FREEPORT – DAY Neil is shown back into one of the vaults... PROTAGONIST (V.O.) Pay attention to the fire precautions. NEIL Documents are vulnerable to – STAFF MEMBER Fire. Absolutely – NEIL I was going to say, water damage from sprinkler systems. STAFF MEMBER We don’t use sprinklers. (points to vents) The facility is flooded with halide gas, displacing all the air within seconds.  38.",
      "characters": [],
      "action_text": "NEIL Can you show me? STAFF MEMBER If I did, we’d suffocate. NEIL What about the staff in here? STAFF MEMBER Halide only fills the vaults – they just have to get into the corridor. There’s a ten-second warning. NEIL You only give them ten seconds? STAFF MEMBER Our clients use us because we have no priorities above their property. NEIL Blimey. STAFF MEMBER Well, sir, you asked. INT. OSLO AIRPORT – DAY The Protagonist and Neil walk through the terminal. NEIL Vault doors are fireproof, hydraulic closers, simple key and electronic triggers. Surprisingly easy, once there’s a lockdown. PROTAGONIST Why a lockdown? NEIL Power switches to fail-safe, sealing outer doors, but inner doors revert to factory settings and pickable locks. Child’s play, really. PROTAGONIST Child’s play? They’re inside airport security. They have to worry about climate control, not armed raids. NEIL So how do we get fire power through the perimeter to trigger a lockdown?  39.",
      "dialogue_count": 0,
      "word_count": 300
    },
    {
      "scene_number": 7,
      "slugline": "EXT. CROWDED AIRPORT BUS, OSLO AIRPORT – DAY The Protagonist and Neil look across the tarmac to the freeport structure. NEIL Back wall of the freeport... The Protagonist notices Neil start to smile... PROTAGONIST You’ve got something? NEIL You’re not going to like it. EXT. OSLO STREET – DAY The Protagonist looks at Neil in disbelief. PROTAGONIST You want to crash a plane? NEIL Not from the air, don’t be so dramatic. I want to run a jet off the taxiway, breach the rear wall, start a fire. PROTAGONIST How big a plane? NEIL Well, that part is a little dramatic. They approach a MAN sitting on a harbour-front bench. NEIL (CONT'D) This is Mahir. His team will work the plane. PROTAGONIST There can’t be passengers – MAHIR Norskfreight. They use the hangar on the west side of the freeport. PROTAGONIST You want to crash a transport plane? What about the crew? MAHIR We’ll pop the slides, chuck ’em off –  40.",
      "characters": [],
      "action_text": "PROTAGONIST On the move? MAHIR What’s the problem? They’ll be fine. PROTAGONIST It seems... bold. MAHIR (smiles) ‘Bold’ I’m fine with – I thought you were going to say nuts. PROTAGONIST And if you get caught? MAHIR We won’t. PROTAGONIST If you do? MAHIR Everyone assumes terrorism, but no one’s died. Swift extradition, then lost in the system. It’ll barely make the news. NEIL That may depend on the size of your explosion. MAHIR Actually, the gold bars might get some play. PROTAGONIST Gold bars? NEIL Norskfreight ships treasury gold once a month. MAHIR We blow the back, drop the gold out on the runway. NEIL No one’s going to be looking at your building, I guarantee you. INT. HOTEL ROOM, OSLO – DAY Neil takes LUNGFULS of air, hyperventilating – Mahir starts a stopwatch. The Protagonist studies some plans...  41. PROTAGONIST The space at the centre of the pentagon’s too big... there’s something there, not marked. Neil runs out of air. Mahir checks his watch. NEIL A vault within a vault? PROTAGONIST Maybe. MAHIR Eighty-five seconds. NEIL Ample. MAHIR Won’t you be running? (turns to the Protagonist) Start packing. The Protagonist starts BREATHING HARD... EXT. FREEPORT – NIGHT The Protagonist and Neil, carrying BRIEFCASES, head inside. EXT. APRON, OSLO AIRPORT – CONTINUOUS Two WORKERS (Mahir and his associate, ROHAN) back up a MEAL TRUCK to a TRANSPORT PLANE. They LIFT the cargo until it is level with the front side door... INT. FREEPORT – CONTINUOUS The Protagonist follows Neil through security. Their briefcases are examined, finding FRAMED DOCUMENTS... INT. TRANSPORT PLANE – CONTINUOUS Mahir and Rohan carry crew meals through the door and into the galley, where they stack them into the catering units, supervised by a GUARD... INT. GALLERY SPACE/LOUNGE, FREEPORT – CONTINUOUS The Staff Member brings Neil an espresso. The Protagonist subtly checks his watch...  42.",
      "dialogue_count": 0,
      "word_count": 472
    },
    {
      "scene_number": 8,
      "slugline": "INT. TRANSPORT PLANE – CONTINUOUS Mahir points past the Guard – MAHIR You gonna eat that? The Guard turns – Mahir GRABS him from behind, Rohan stuffs a COTTON PAD over the Guard’s face, rendering him unconscious. They ROLL him into the catering-truck lift... Mahir pops out and signals ANOTHER GUARD... THREE GUARDS have been dumped into the truck lift – Rohan sends it DOWN, SEALS the plane door. Mahir approaches the cockpit as the PILOTS perform checks – SHOWS THEM HIS GUN... MAHIR (CONT'D) Alright, lads? INT. CORRIDOR, FREEPORT – CONTINUOUS The Staff Member leads Neil and the Protagonist into the vaults... INT. TRANSPORT PLANE – CONTINUOUS At gunpoint, the Pilots nervously pull back from the hangar. Rohan checks the stacks of GOLD BARS secured in the rear. EXT. APRON, OSLO AIRPORT – CONTINUOUS The plane is TOWED back onto the taxiway and lifts its engines, easing forward... INT. TRANSPORT PLANE – CONTINUOUS Rohan SLASHES the restraining straps – CROUCHES behind the pile of gold – pulls out a GRENADE – GRABS the nearest gold bar and STUFFS it into his waistband before PULLING THE PIN... INT. VAULTS, FREEPORT – CONTINUOUS The Staff Member shows Neil and the Protagonist into a vault. Neil puts down his briefcase – pulls out the framed documents. EXT. TAXIWAY, OSLO AIRPORT – CONTINUOUS The transport plane BARRELS down the taxiway...  43.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 229
    },
    {
      "scene_number": 9,
      "slugline": "INT. TRANSPORT PLANE – CONTINUOUS Rohan TOSSES the grenade behind the gold at the tail of the plane and DUCKS as it BLOWS – EXT. TAXIWAY, OSLO AIRPORT – CONTINUOUS BLASTING a hole in the rear of the plane... GOLD BARS POUR OUT, CLATTERING ACROSS THE TARMAC... INT. VAULTS, FREEPORT – CONTINUOUS Hearing the distant explosion, the Protagonist and Neil start PACKING AIR... the Staff Member stares at them, quizzical – NEIL (between breaths) Yoga. INT. COCKPIT, TRANSPORT PLANE – CONTINUOUS Mahir forces the Pilots from their seats – EXT. TAXIWAY, OSLO AIRPORT – CONTINUOUS The INFLATABLE SLIDE BURSTS OPEN, DRAGGING on the asphalt, as the Pilots roll onto it, SCRAMBLING DOWN to the ground, ROLLING AWAY from the giant plane... INT. COCKPIT, TRANSPORT PLANE – CONTINUOUS Mahir TURNS the stick HARD LEFT, AIMING AT THE REAR WALL OF THE FREEPORT – INT. TRANSPORT PLANE – CONTINUOUS Rohan lowers a ladder behind the forward landing gear – he and Mahir climb down – EXT. TAXIWAY, OSLO AIRPORT – CONTINUOUS Mahir and Rohan jump down onto the asphalt, racing back between the wheels as the giant plane SMASHES INTO THE BRICK WALL OF THE FREEPORT, ERUPTING IN A MASSIVE EXPLOSION... INT. VAULTS, FREEPORT – CONTINUOUS The vault is ROCKED by the explosion – ALARMS SCREAM – DOORS START CLOSING – Neil looks, panicked, at the Staff Member –  44.",
      "characters": [],
      "action_text": "NEIL Ten seconds, right?! The Staff Member BOLTS – PUSHING PAST THEM – they take a last gulp of air – GAS HISSES IN. They pull apart the frames of the documents, BREAKING THEM INTO LOCK-PICKING APPARATUS – lockpicks, small crowbar – they go to work on the INNER DOOR, PRYING open a panel – HOT-WIRING it – the door SLIDES UP – INT. CORRIDOR, FREEPORT – CONTINUOUS They BURST into the corridor, GASPING – the door SLAMS DOWN behind them – they HUSTLE down to the next vault door – get to work. The door opens, they GULP AIR, then RACE inside – INT. VAULT 2, FREEPORT – CONTINUOUS – round the corner past RACKS, CRATES, some BROKEN – stop at the next door, the Protagonist picks the lock – his PICK BREAKS – Neil BOLTS back to where they entered – the Protagonist STRUGGLES, pulling out pieces of the pick – Neil gets to the first door – NO HANDLE – the Protagonist uses a different tool – Neil SMASHES the door, full-blown PANIC – he looks to the end of the vault where the ROLLER DOOR is BROKEN at the bottom, halide gas HISSING OUT – Neil races towards it – the Protagonist gets his door OPEN – Neil STUMBLES past – the Protagonist DRAGS him through the door – INT. INNER CORRIDOR – CONTINUOUS They lie GASPING. Neil hears something, looks around – NEIL (urgent whisper) There’s someone in here with us! The Protagonist is up, moving down the corridor... They arrive at two doors, side by side: the Rotas vault. They each work on a door. Neil’s OPENS – NEIL (CONT'D) Need a hand? The Protagonist works his door... nothing. PROTAGONIST Actually, yes. Neil leans over, hits ‘ENTER’, the door OPENS.  45.",
      "dialogue_count": 0,
      "word_count": 526
    },
    {
      "scene_number": 10,
      "slugline": "INT. ROTAS VAULT – CONTINUOUS The Protagonist enters a room, one side of which is a LONG GLASS WINDOW. Neil is on the other side of the glass, in an IDENTICAL ROOM. There are BULLET HOLES in the glass. At the end of each room is a tube, like a sealed in REVOLVING DOOR. The Protagonist’s feet crunch BROKEN GLASS... Neil examines BULLET HOLES in the wall opposite the glass. WISPS of SMOKE gather near the holes – Neil reaches up – PROTAGONIST Don’t touch them – NEIL What the hell happened here? The Protagonist sees a STRIPPED AUTOMATIC PISTOL on the floor. He picks it up, thinking – PROTAGONIST It hasn’t happened, yet. Neil looks at the Protagonist, quizzical – A LOUD HUM STARTS UP from the revolving door... the Protagonist looks down – MOVEMENT beneath his feet – the DEBRIS – SMOKE GATHERS – the revolving doors ROTATE, OPENING – a BLACK-CLAD FIGURE in a GAS MASK LEAPS BACKWARDS from the tube – reaching behind itself to GRAB the stripped automatic in the Protagonist’s hand – On Neil’s side an identical BLACK-CLAD FIGURE LEAPS out FORWARDS – knocks Neil over, moving for the vault door – A SLIDE jumps into the Backwards Figure’s hand – he REASSEMBLES the gun in the Protagonist’s hand – a MAGAZINE jumping up to LOAD IT – BLAM! A bullet is SUCKED OUT OF THE WALL – THROUGH THE GLASS – ‘HEALING’ THE BULLET HOLES – the Protagonist STRUGGLES with the Backwards Figure – whose REVERSE MOVEMENTS seem ALIEN and IMPOSSIBLE – Neil gives chase – RACING out of the vault door – The Backwards Figure pulls the Protagonist sideways, lining up his head with the next bullet hole – BLAM! GLASS FLIES UP as the shot JUST MISSES the Protagonist’s head – INT. CORRIDOR, FREEPORT – CONTINUOUS Neil CHASES the Forwards Figure down the corridor –  46.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 316
    },
    {
      "scene_number": 11,
      "slugline": "INT. ROTAS VAULT – CONTINUOUS The Protagonist STRUGGLES – the Backwards Figure PUSHES him towards the next bullet hole, STRANGE REVERSE GROANING building in its throat, behind the black gas mask, the GROAN PEAKING AS the Protagonist takes his PICK and STABS the Backwards Figure in the arm and SMACKS the Figure’s gun out of its hand – it BOUNCES out the door – The Figure RISES into the Protagonist’s arms – PULLS him backwards – we can’t tell if it’s PUSHING or the Protagonist is PULLING as they move backwards through the door – INT. CORRIDOR, VAULT – CONTINUOUS The Figure PUSHES/PULLS the Protagonist down the corridor – INT. CORRIDOR, FREEPORT – CONTINUOUS Neil RACES around a corner, GRABS the Figure’s MASK, which COMES OFF – he looks, SURPRISED, at the Figure’s face, WHICH WE CANNOT SEE, then TURNS, RACING back the way he came... INT. CORRIDOR, FREEPORT – CONTINUOUS The Protagonist and the Backwards Figure struggle into – INT. VAULT 2, FREEPORT – CONTINUOUS They SMASH into the racks and crates – the Protagonist GRABS the gun – raises it to the Figure’s head – NEIL (O.S.) NO! Don’t kill him! The Protagonist freezes – Neil steps up, DESPERATE – NEIL (CONT'D) We need to know if you’re compromised. The Protagonist THROWS the Figure to the ground – PROTAGONIST Why are you here?! The Protagonist tries to rip off the gas mask, but it is strapped tight – the REVERSE KEENING gets LOUDER and LOUDER. The Protagonist STEPS onto the Figure’s injured arm... PROTAGONIST (CONT'D) Who sent you?!  47.",
      "characters": [],
      "action_text": "The Figure’s reverse screaming gets louder – the Protagonist KICKS its arm, HARD, AGAIN AND AGAIN – PROTAGONIST (CONT'D) HOW DID YOU KNOW WE’D BE HERE! A BOOM! from outside – AIR starts BLOWING ACROSS the Backwards Figure, SUCKING underneath the broken roller door – the Backwards Figure SLIDES impossibly across the floor and underneath the door which SLAMS shut, unbroken behind him. The Protagonist and Neil look at each other... NEIL We have to go. EXT. APRON, OSLO AIRPORT – CONTINUOUS One of the plane’s JET ENGINES has come loose, STILL THRUSTING, SWINGING AROUND, wreaking HAVOC for the EMERGENCY SERVICES – an AMBULANCE SKIDS SIDEWAYS, avoiding the THRUST... Mahir and Rohan stand at a distance, watching the MAYHEM along with DOZENS of other UNIFORMED AIRPORT WORKERS... INT./EXT. FREEPORT – CONTINUOUS EMTS race in past the Staff Member... INT. VAULTS, FREEPORT – CONTINUOUS Neil moves to the other door – works the lock – SIRENS sound – PROTAGONIST What happened to the other guy? NEIL I took care of him. The door opens – they slip into the outer vault – INT. OUTER VAULT, FREEPORT – MOMENTS LATER They reassemble the document frames, then LIE DOWN, ‘unconscious’ – EMERGENCY SERVICES BURSTS IN... INT. HOTEL ROOM, OSLO – DAWN Neil hangs up his phone –  48. NEIL Mahir and Rohan slipped out clean. (turns to the Protagonist) I’ve seen too much and I’m still alive. Which means you’ve decided to trust me. PROTAGONIST Or I’ve lost my edge. NEIL Oh, your edge is intact. The Protagonist looks at Neil. PROTAGONIST There’s a cold war. NEIL Nuclear? PROTAGONIST Temporal. NEIL (skeptical) Time travel? PROTAGONIST No. Technology that can invert an object’s entropy. NEIL You mean reverse chronology. Like Feynman and Wheeler’s notion that a positron is an electron moving backwards in time. PROTAGONIST Sure, that’s exactly what I meant. NEIL I’ve a master’s in physics. PROTAGONIST Well, try to keep up. NEIL The implications of this are – PROTAGONIST Beyond secret. NEIL Then why’d you tak",
      "dialogue_count": 0,
      "word_count": 3880
    },
    {
      "scene_number": 12,
      "slugline": "INT. STORAGE AREA, SATOR’S YACHT – CONTINUOUS The Protagonist makes his way through the storage area. Peering through a window, he sees – INT. ENGINE ROOM, SATOR’S YACHT – CONTINUOUS Crew gathered around the capsule. Sator enters, wipes dirt from the latches and opens it. Sator puts his hand over the open capsule, letting small, flat GOLD BARS leap from the capsule into his hand... he looks up, expectantly... The Crew SHOVES a CREW MEMBER forwards, onto his knees... eyes downcast, he reaches behind – pulls a gold bar from his rear pocket. He offers it to Sator with TREMBLING hands. Sator takes it, eyes never leaving the Crew Member... who finally, tentatively looks up – BAM! Sator JABS him in the mouth with the gold bar, then SMASHES him over the head – INT. STORAGE AREA, SATOR’S YACHT – CONTINUOUS The Protagonist is REPULSED by what he sees... INT. ENGINE ROOM, SATOR’S YACHT – CONTINUOUS Sator steps back, breathless, from the Small Crew Member, who lies motionless on the ground. As Sator raises his wrist to check his fitness tracker, BLOOD drips from the gold bar in his hand. SATOR Ninety-eight. Not bad for such exertion. EXT. STORAGE AREA, SATOR’S YACHT – CONTINUOUS The Protagonist SENSES, TURNS – CRACK! Volkov smashes his jaw – KICKS him in the ribs – pistol-whips him... INT. ENGINE ROOM, SATOR’S YACHT – MOMENTS LATER The Protagonist, bleeding, is SHOVED into the room – VOLKOV He was at the window. Sator looks at the Protagonist, who nods at the capsule –  68.",
      "characters": [],
      "action_text": "PROTAGONIST I was curious. SATOR My property shouldn’t concern you. Who are you? How do you come by your information about the opera? PROTAGONIST Do I work for intelligence services? Several, just like you. You wouldn’t do business with someone who wasn’t savvy enough to be recruited. Hell, the CIA provides two-thirds of the market for fissile material. SATOR They’re usually buying, not selling. But we do live in a twilight world... PROTAGONIST Is that Whitman? It’s pretty. SATOR Next warning’s a bullet in your brain. PROTAGONIST No balls in my throat? SATOR There’ll be no time for such things in Tallinn. Sator gestures to his men – they lift the capsule. The Protagonist spots DRIED MUD from the latches on the table... SATOR (CONT'D) Make your way there. I want Volkov on the team. The Protagonist struggles to his feet. PROTAGONIST No. I spring the materials, you pay me off. Your wife does the exchange. SATOR I never involve her in my business. PROTAGONIST That’s why I trust her.  69. SATOR (to Volkov) Put him ashore. PROTAGONIST How do I contact you? SATOR You don’t. PROTAGONIST How do you advance me funds? Sator TOSSES the Protagonist the BLOODY GOLD BAR – the Protagonist FUMBLES it onto the table. Volkov SNEERS – SATOR Handle the plutonium better than that. The Protagonist, looking Volkov in the eye, picks up the gold bar, scooping DRIED MUD into his hand, unseen. EXT. DOWNTOWN STREETS, TALLINN – DAY The Protagonist walks the crowded streets with Neil. PROTAGONIST What did you find on the gold? NEIL Three hundred thousand at today’s price, no franks, mould marks. Nothing. Like it came from outer space. PROTAGONIST Or the future. NEIL How? PROTAGONIST Dead drops. He buries his time capsule, transmits the location, then digs it up to collect whatever inverted material they’ve sent. NEIL Instantaneous. Where’s he bury it? PROTAGONIST Someplace that won’t be disturbed for centuries. What did the soil sample show?  70. NEIL Northern Europe or Asia, radioactive. Dried b",
      "dialogue_count": 0,
      "word_count": 1133
    },
    {
      "scene_number": 13,
      "slugline": "EXT. TALLINN STREET – DAY A LARGE UNMARKED TRUCK, with an ESCORT FRONT AND BACK, makes its stop and-start way through the downtown traffic. INT./EXT. BMW, TALLINN STREET – CONTINUOUS The Protagonist and Neil watch the convoy cross an intersection, then pull forward, squeezing through traffic to get ahead. Neil raises a walkie-talkie – YELLOW CO-PILOT (into radio) Green? Two minutes. INT./EXT. GREEN TRUCK, TALLINN STREET – CONTINUOUS The GREEN DRIVER nods at the GREEN CO-PILOT who holds the radio. GREEN CO-PILOT Check. He puts the radio down and pulls out a LARGE AUTOMATIC RIFLE. INT./EXT. BMW, TALLINN STREET – CONTINUOUS The Protagonist checks his watch – Neil speaks into the radio – NEIL Yellow? Sixty seconds. YELLOW CO-PILOT (over radio) Sixty. Check. NEIL Blue? Forty-five seconds. BLUE CO-PILOT (over radio) Forty-five. Check. NEIL Red? On our way to you. INT./EXT. FIRE ENGINE – CONTINUOUS RED DRIVER and RED CO-PILOT are dressed as FIREFIGHTERS.  74.",
      "characters": [],
      "action_text": "INT./EXT. BMW, TALLINN STREET – CONTINUOUS The BMW pulls out, running behind the nuclear convoy. As the convoy passes the cross street where the green truck, a FLATBED TRUCK, is sitting, it pulls out beside them, settling in to the right of the convoy. INT. STORAGE FACILITY – DAY Sator steps towards Kat – KAT Stay right there! She lifts the gun, intent – SATOR You wouldn’t kill me. KAT I already tried. SATOR You pushed me off a boat. You’re not going to shoot me in cold blood – KAT My blood’s not cold, Andrei. SATOR No, but you’re not angry enough. Sator edges towards Kat... SATOR (CONT'D) Because anger scars over into despair. I look in your eyes... He casually GESTURES at her – SATOR (CONT'D) I see despair. He SMACKS the gun out of her hands – PUNCHES her – she DROPS – SATOR (CONT'D) Vengeful bitch. Living off me, pretending to be better... With a primal, animal viciousness, Sator SPITS at Kat. SATOR (CONT'D) ENOUGH! Sator KICKS her once, in the side.  75. SATOR (CONT'D) You wanted to know when it’s better to kill you? You’ll have your answer. He motions to Volkov, who, with a guard, lifts Kat and carries her towards the door. Sator puts an earpiece in his ear... SATOR (CONT'D) Tell me everything as it happens. Volkov nods, leaving – Sator walks through a large door. SATOR (CONT'D) Seal us this side! As the door shuts behind him, he walks towards a RED DOOR WITH A SMALL PORTHOLE, finding a spot in the shadows nearby... EXT. TALLINN STREET – CONTINUOUS The BMW watches the yellow truck, a BROADCAST TRUCK, which pulls out just ahead of the nuclear convoy... the Protagonist looks back through the BMW’s side mirror, which is CRACKED... The BMW sees the blue truck, a WRECKER, which pulls out onto the larger street, just behind the convoy, which is now SURROUNDED ON THREE SIDES by the coloured trucks. INT. MERCEDES – CONTINUOUS Volkov follows the convoy... VOLKOV (into radio) Three trucks in place... SATOR (over radio) Watch everything, give me all the details... INT. ST",
      "dialogue_count": 0,
      "word_count": 776
    },
    {
      "scene_number": 14,
      "slugline": "EXT. TALLINN STREET – CONTINUOUS TYRES HOWLING, the convoy GRINDS forward – Blue Co-pilot tosses a DYE PACK onto the windshield of the SUV – it BLASTS across the glass, obscuring the view – Yellow Co-pilot does the same in the front – the Guards are now BLIND, CANNOT OPEN THEIR DOORS OR SHOOT OUT THROUGH THE BULLET-PROOF VEHICLES... The Protagonist CLIMBS ONTO THE LADDER, lying on top... Inside, the Red Co-pilot operates the ladder controls... The ladder SWINGS OUT AT NINETY DEGREES, hanging the Protagonist DIRECTLY OVER THE NUCLEAR TRUCK... he PULLS a frame from his pack, unfolds it – fixes it to the roof. The ladder SWINGS him away – the frame EXPLODES – he SWINGS back through the smoke to find an OPENING and climbs into – INT. NUCLEAR TRANSPORTATION TRUCK – CONTINUOUS The Protagonist lands, gets his bearings, finds the SAFE. He reaches into his pack... EXT. TALLINN STREET – CONTINUOUS An Estonian POLICE CAR pulls up behind the fire truck – the POLICEMEN spot SPARKS from the dragging bumper of the SUV – the Policeman Passenger tries his radio... STATIC... INT. NUCLEAR TRANSPORTATION TRUCK – CONTINUOUS The Protagonist affixes a CHARGE to the safe – he runs a wire, pushing back into the farthest corner – BLASTS the door open – INT./EXT. FIRE ENGINE – CONTINUOUS Watching the Police through his mirror, Red Passenger rolls down his window and props his ASSAULT RIFLE on the sill... INT. NUCLEAR TRANSPORTATION TRUCK – CONTINUOUS The Protagonist reaches into the safe... PULLS OUT an ORANGE PLASTIC CASE... reaches up to climb through the roof... INT./EXT. FIRE TRUCK – CONTINUOUS The Protagonist, orange case in hand, CLIMBS onto the ladder – Red Passenger SWINGS his rear-opening door out and SHOOTS OUT the engine block of the police car which DROPS BACK as –  78.",
      "characters": [],
      "action_text": "The fire-truck ladder SWINGS the Protagonist back onto the fire truck – he climbs down onto the side – the BMW pulls alongside – he JUMPS into the car, which SPEEDS away... INT./EXT. BMW, TALLINN STREET – CONTINUOUS Neil, driving, glances at the orange case – NEIL We got it! The Protagonist opens the latches, flips open the lid... revealing the BLACK METAL SHAPE the size of a softball. PROTAGONIST I’ve seen samples of encapsulation in every weapons class – this is not one of them. Neil looks back at the Protagonist. Serious. NEIL It’s what he’s after. The Protagonist looks around at the surrounding traffic... PROTAGONIST Check the radio chatter. Neil clicks on the radio – EMPHATIC GIBBERISH... NEIL I can’t understand – PROTAGONIST You said you spoke Estonian – NEIL It’s not Estonian, it’s... backwards – Up ahead, an Audi is weaving through traffic, towards them, BACKWARDS... Neil STARES... NEIL (CONT'D) The hell? The BACKWARDS-RUNNING AUDI flies at them, CLIPPING the wing mirror, ‘HEALING’ its crack. Behind them it SPINS AROUND, to CHASE them, still running BACKWARDS... The BMW DODGES around traffic, trying to lose the backwards Audi, which pulls up to the back bumper – then ALONGSIDE – in the back is Sator, black eyes peering over a RESPIRATOR, a gun to Kat’s head. She is BOUND and GAGGED, eyes TERRIFIED –  79. Sator rolls the rear window down, holds up his hand, FINGERS EXTENDED. He COCKS the gun at Kat’s head then starts COUNTING DOWN on his fingers... the Protagonist looks down at the BLACK METAL SHAPE in the case... NEIL (CONT'D) You can’t give it to him! The Protagonist LIFTS the closed case, LOWERS the window... PROTAGONIST This isn’t plutonium. Sator is down to TWO FINGERS... Ahead of them in the road, the Protagonist sees a CRASHED, SMOKING, UPSIDE-DOWN SAAB... NEIL It’s worse, goddammit! Both cars race towards the crashed Saab, which starts SHAKING as they approach – as they pass, THE CRASHED SAAB ROLLS VIOLENTLY OVER AND OVER between them until it is on i",
      "dialogue_count": 0,
      "word_count": 1093
    },
    {
      "scene_number": 15,
      "slugline": "EXT. DOCKSIDE AREA, EDGE OF TALLINN – MOMENTS LATER The TRUNK OPENS – the Protagonist is PULLED OUT. Marched towards an entrance, he sees, through a steel fence dividing the yard in two, SATOR, IN RESPIRATOR, WALKING BACKWARDS, PULLING KAT, FORWARDS, TOWARDS A DIFFERENT ENTRANCE... The Protagonist passes a stack of SHIPPING CONTAINERS, several of which are marked OSLO FREEPORT... INT. STORAGE FACILITY, TALLINN FREEPORT – CONTINUOUS The Protagonist is taken past the table of weapons, through a large door, and through RED DOORS with a PORTHOLE... INT. TURNSTILE, TALLINN FREEPORT – CONTINUOUS Into A LONG CHAMBER DIVIDED IN TWO BY A GLASS WINDOW – A MUCH BIGGER VERSION OF THE ROTAS VAULT. The Russians push the Protagonist into a chair. This side is lit by RED LIGHT. On the other side of the glass, lit by BLUE LIGHT, Sator ‘ENTERS’ BACKWARDS, ‘PULLING’ Kat, who is now in a respirator. Sator ‘SHOVES’ her hard into a chair, removes his own respirator, ‘FLIPPING’ it up onto a hook on the wall. The Protagonist looks into Kat’s frightened eyes... between them, embedded in a whirl of cracked glass, is a BULLET... Sator TURNS to meet the Protagonist’s gaze – his movements have the surreal edge of backwards motion as he places his GUN AGAINST KAT’S HEAD and pulls out his phone... He holds his PHONE up and plays a recording IN REVERSE – SATOR (via recording) If you’re not telling the truth, she dies. Sator moves the phone to his lips, SPEAKING IN REVERSE... the Protagonist stares at him, bemused. PROTAGONIST I don’t know what you’re talking about. Sator listens to this played backwards... SATOR (via recording) You left it in the car not the fire truck, right? PROTAGONIST Who told you that?  82.",
      "characters": [],
      "action_text": "SATOR (via recording) Tell me, now! Is it really in the BMW? PROTAGONIST I don’t know! SATOR (via recording) Tell me or I’ll shoot her again! The Protagonist looks at Kat, who is TERRIFIED – KAT (pleading) Tell him! – then at Sator – PROTAGONIST Leave her alone! SATOR (via recording) I don’t have time to negotiate. The Protagonist looks at the bullet hole in the glass – WISPS OF SMOKE are gathering... PROTAGONIST Listen to me! I can help you! SATOR (via recording) Three... PROTAGONIST Don’t! KAT Help me! SATOR (via recording) Two... KAT PLEASE! A FAINT TRICKLE of glass dust rises to where the bullet is lodged in the window... PROTAGONIST Wait!  83. SATOR (via recording) One... Sator LIFTS Kat – PUSHES her up against the glass... KAT PLEASE! PROTAGONIST NO! The SMOKE COALESCES as BANG! The bullet RIPS THROUGH KAT’S SIDE on its inevitable journey to Sator’s gun. Kat SCREAMS – SATOR (via recording) Next one’s a bullet to the head... He holds up a finger – Kat is SCREAMING – SATOR (CONT'D) (via recording) One... PROTAGONIST Please! SATOR (via recording) Two... PROTAGONIST No! SATOR (via recording) Three... PROTAGONIST Okay! Okay! The car! The BMW! I left it in the BMW! Kat’s screams subside to moans as she PASSES OUT... SATOR (via recording) We’re going to check this is real. PROTAGONIST It’s in the glove box! The door OPENS behind the Protagonist – SATOR (O.S.) Where did you leave it?  84. The Protagonist spins around – Sator, BEHIND HIM, SMASHES his gun into the Protagonist’s cheek – THIS SATOR IS FORWARDS – SATOR (CONT'D) Car or truck – which one?! Sator HITS him again – the Protagonist falls near the glass – looks up through the glass to see ‘backwards’ Sator, on the blue side, staring at him dispassionately... SATOR (CONT'D) Which vehicle did you leave it in?! I need to know before I go out there! PROTAGONIST I already told you! Forwards Sator looks through the window at his inverse self – then turns back to the Protagonist – SATOR I believe you... Sator puts his G",
      "dialogue_count": 0,
      "word_count": 3787
    },
    {
      "scene_number": 16,
      "slugline": "EXT. CARGO SHIP – LATER Close on the hull, we see the water UNSPLASHING at the bow and SUCKING UNDERNEATH the stern as the ship steams majestically backwards through the cold North Sea... INT. SHIPPING CONTAINER – LATER BANGING wakes the Protagonist – Neil is at a peephole. NEIL We’re on a truck. Shouldn’t be too long now. INT. SHIPPING CONTAINER – LATER Neil is awake. He looks over at the Protagonist, who is examining a LESION on his right arm... NEIL You in pain? PROTAGONIST Must’ve got nicked in Tallinn. (rolls down sleeve) I’ve been thinking... we’re their ancestors. If they destroy us, won’t that destroy them? NEIL Bringing us to the grandfather paradox. PROTAGONIST The what? NEIL The classic thought experiment – if you went back in time and killed your own grandfather, how could you have been born to commit the act? PROTAGONIST What’s the answer? NEIL There is no answer, it’s a paradox. But in the future, those in power clearly believe that you can kick Grandpa down the stairs, gouge his eyes and slit his throat without consequence. PROTAGONIST Could they be right?  101.",
      "characters": [],
      "action_text": "NEIL It doesn’t matter. They believe it, so they’re willing to destroy us. Can I go back to sleep? PROTAGONIST No. I thought of something else. NEIL Great. PROTAGONIST This reversing the flow of time... doesn’t us being here now mean it never happens? That we stop them? NEIL Optimistically, I’d say that’s right. PROTAGONIST Pessimistically? NEIL In a parallel-worlds theory, we can’t know the relationship between consciousness and multiple realities. Does your head hurt yet? PROTAGONIST Yes. NEIL Try sleep. INT. SAME – LATER A final THUD, then STILLNESS. The Protagonist moves to the peephole, unplugs it and peers out: The WRECKED PLANE, FLOODLIT, sitting outside the COLLAPSED WALL which has been sealed with STEEL FENCING. PROTAGONIST Shit. They didn’t take us inside. NEIL What do we do? PROTAGONIST We use the breach. The chaos right after impact. Get ready. They both turn to look at the unconscious Kat. PROTAGONIST (CONT'D) Is she healed enough?  102. NEIL I don’t know. I’ve never done this before. INT. SAME – NIGHT The Protagonist is at the peephole – the ground is WET. CLEAN- UP CREWS and INVESTIGATORS swarm backwards over the scene. SIRENS start... Water FLOWS UP ONTO THE PLANE’S WINGS. FIRE CREWS ‘unpack’ their equipment around the wreck... PROTAGONIST Fire crew’s there... The Protagonist WINCES as he pulls his arm into its sleeve... PROTAGONIST (CONT'D) We get Kat through the breach, I take care of Sator’s man and secure the vault. Then you bring her in. NEIL How’s the arm? PROTAGONIST Not good. The Protagonist spots a HOLE in the fabric of his black suit – directly over the lesion on his arm... Neil straps a respirator to the gurney – puts the mask over Kat’s face, then puts another on himself. He gives Kat a sedative. PROTAGONIST (CONT'D) We move the second we hear the engines. Neil looks at Kat, unconscious on the gurney. He TIGHTENS the straps – throws a reflective blanket over her... The SIRENS are DEAFENING – the Protagonist flexes his arm, clearly in a lo",
      "dialogue_count": 0,
      "word_count": 571
    },
    {
      "scene_number": 17,
      "slugline": "EXT. APRON, OSLO AIRPORT – CONTINUOUS Onto PANDEMONIUM – FIRE CREWS BATTLE the blaze, chunks of metal on the ground IGNITE, SHUDDER and LEAP ONTO THE AIRFRAME... STREAMS of water RISE up onto the plane – The Protagonist HURRIES BACKWARDS, PULLING THE GURNEY towards the plane, steering around debris that might suddenly – A SHEET OF FLAMING METAL SPINS off the ground, shearing into them, KNOCKING the GURNEY – they duck, HOLDING ON TO THE GURNEY, the metal FLIES into the air, SLAMS into its hole on the side of the plane... the Protagonist spots a line under the fuselage, between flames, towards the breach... PROTAGONIST Come on! Neil looks up as BLACK SMOKE GATHERS, FORMING A MASSIVE CLOUD OVER THE PLANE... a SHOCK WAVE starts to BUILD in the air around them – the Protagonist PULLS Kat and Neil under the fuselage as CURTAINS of FIRE start GATHERING around the wings, CENTRED on a HALF-DESTROYED JET ENGINE – They pass through the hole in the wall LICKED AT BY FLAMES WHICH LEAVE FROST ON THEIR CLOTHES – As they clear into the building, DEBRIS in front of them start SHAKING – they DUCK as the MASSIVE BUILD OF ENERGY CLIMAXES in a CACOPHONOUS REVERSE EXPLOSION as THE JET ENGINE REASSEMBLES – LOOSELY ATTACHED TO THE WING, THRUSTING – INT./EXT. FREEPORT SHIPPING AREA – CONTINUOUS The Protagonist draws his gun – turns to Neil – PROTAGONIST I’m going in. Wait here. The Protagonist turns, rushing up onto the loading dock – The LOOSE JET ENGINE, under FULL THRUST, ATTACHED to the wing, SWINGS BACK AND FORTH, wreaking REVERSE HAVOC... The Protagonist pauses, LISTENING – he can hear BACKWARDS VOICES on the other side of a ROLLER DOOR – the loose jet engine TURNS, BLASTING AIR at the Protagonist with its INVERTED THRUST – the Protagonist is SMASHED through the bottom of the roller door –  104.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 317
    },
    {
      "scene_number": 18,
      "slugline": "INT. VAULT, FREEPORT – CONTINUOUS INTO HIMSELF AND NEIL, DRESSED AS BUSINESSMEN AS IN THEIR EARLIER VISIT TO THE ROTAS VAULT – the Protagonist (wearing black clothes and gas mask) TACKLES the EARLIER PROTAGONIST (wearing business suit), the Earlier Protagonist THROWS the Protagonist onto the ground, getting his gun – SHOUTING at him INCOMPREHENSIBLY – KICKING his INJURED ARM AGAIN AND AGAIN – the Protagonist SCREAMS... The Earlier Protagonist puts his GUN TO THE PROTAGONIST’S HEAD... EARLIER NEIL GRABS HIS ARM, RESTRAINING him... The Protagonist and Earlier Protagonist STRUGGLE, ROLLING across the floor with the unique physics of forward action merged with backwards action... They STRUGGLE through the BLUE DOOR of the Rotas vault. The Protagonist gets his gun – the Earlier Protagonist STABS him in the arm with his lockpick – ‘HEALING’ his wound – ENERGIZING him – He FLIPS the Earlier Protagonist up against the glass, LIFTS his gun – SHOOTS past the Earlier Protagonist’s head, putting a BULLET HOLE through the glass – Glancing at the OPEN TURNSTILE DOOR, the Protagonist FIRES again, forcing the Earlier Protagonist TOWARDS the door... he looks through the proving window – no one there... PROTAGONIST Come on, come on... The Protagonist FIRES AGAIN AND AGAIN, forcing the Earlier Protagonist closer and closer to the open turnstile... The Earlier Protagonist takes hold of the gun – the barrel coming around onto the Protagonist who instinctively EJECTS the magazine, REMOVES the SLIDE, tossing it aside, leaving the Earlier Protagonist with a useless STRIPPED AUTOMATIC – Earlier Neil RACES backwards into the other half of the room – Through the bullet-riddled glass the Protagonist sees HIMSELF (GAS MASK, BLACK CLOTHES) RUN BACKWARDS into the room – The Protagonist LEAPS INTO THE TURNSTILE – we FOLLOW the Protagonist through the machine – BURSTING OUT on the other side – straight into Earlier Neil, who now MOVES FORWARDS as the Protagonist PUSHES past – As the confrontation on the other side of the glass plays out again, FORWARDS... the Protagonist RACES for the RED DOOR, Neil in PURSUIT –  105.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 345
    },
    {
      "scene_number": 19,
      "slugline": "INT. VAULT CORRIDOR – CONTINUOUS The Protagonist runs, pursued by Earlier Neil, skidding around the corners of the vault corridor – Earlier Neil gets a hand on the Protagonist’s GAS MASK and YANKS – it comes off in his hands... this time we see that Neil is looking at the UNMASKED PROTAGONIST. Neil, surprised, turns and BOLTS back the way he came – the Protagonist watches him go, then TURNS – INT. VAULT CORRIDOR – CONTINUOUS The Protagonist races down the angled corridor – The Protagonist SKIDS through the doorway leading out of the corridor and into the SMOKE-FILLED cargo area where he left... INT. VAULT 2, FREEPORT – CONTINUOUS Neil races up to the Earlier Protagonist, grab his arm – NEIL NO! Don’t kill him! INT./EXT. FREEPORT SHIPPING AREA – CONTINUOUS ...Neil (respirator on) guarding Kat, STRAPPED to the gurney. Behind them, the fire crew battle the blazing plane. Neil is already looking up at the Protagonist who POINTS right – The Protagonist DUCKS THROUGH the breach, into the chaos... Neil moves BACKWARDS towards the outside... EXT. BREACH – CONTINUOUS The Protagonist RUNS THROUGH THE SMOKE AND FLAME, DODGING DEBRIS FALLING FROM THE PLANE... heading towards the EMERGENCY SERVICES... The Protagonist CREEPS along the side of an AMBULANCE... the AMBULANCE DRIVER spots him in the mirror – the Protagonist DARTS in, HITTING the driver in the face – INT. VAULT CORRIDOR – CONTINUOUS Neil (moving FORWARDS) ducks back behind the corner as Earlier Protagonist (business suit) and Earlier Neil (business suit) walk backwards away from the Rotas vault. Neil pushes Kat towards the broken roller door and pushes her inside...  106.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 273
    },
    {
      "scene_number": 20,
      "slugline": "EXT. APRON, OSLO AIRPORT – MOMENTS LATER The Protagonist SWERVES the ambulance, trying to get close to the breach – the Protagonist SPINS the ambulance around as close to the breach as possible. He JUMPS out – opens the back – PEERS into the smoke and water... waiting... Neil EMERGES, pushing the gurney with Kat on – INT./EXT. AMBULANCE – MOMENTS LATER The Protagonist DRIVES, sirens blaring. PROTAGONIST You knew it was me coming out of that vault. Why didn’t you say? NEIL That’s a lot of explaining when someone’s about to put a bullet in their own brain. PROTAGONIST But afterwards – NEIL With things the same, I knew you’d be okay. What’s happened happened. If I’d told you and you acted differently... who knows? The policy is to suppress. PROTAGONIST Whose policy? Neil GRINS, offering his hand – NEIL Ours, my friend. We’re the people saving the world from what might have been... INT./EXT. PARKED AMBULANCE – NIGHT Neil and the Protagonist are in the back, checking on Kat... whose eyes OPEN. PROTAGONIST Kat? KAT I’m here. Neil checks the dressing on her wound –  107.",
      "characters": [],
      "action_text": "NEIL Be quite a scar, but you’re okay. We did it. KAT Did what? Andrei’s got the algorithm. You don’t know where he is – Neil looks at the Protagonist – NEIL Or when. PROTAGONIST Get Priya here to Oslo. NEIL Why? PROTAGONIST If I don’t do something now, in two days she’ll tell me about the 241. NEIL Nothing can change that. PROTAGONIST We’ll see. Just get her here. EXT. OSLO WAR MEMORIAL – DAY The Protagonist makes his way through the crowd, following an elegantly dressed lady... Priya. He takes her by the arm, away from the crowd... PROTAGONIST Hello, Priya. PRIYA What’s going on? Where’s Neil? PROTAGONIST Nursing Katherine Barton. Who almost died because of you. PRIYA What did I do? PROTAGONIST It’s what you’re going to do. In two days you’re going to have me dangle plutonium 241 in front of the world’s most dangerous arms dealer... I want to know why.  108. PRIYA You let him get hold of 241? PROTAGONIST No. I let him get hold of the algorithm. Priya looks at the Protagonist, surprised he knows the term. PROTAGONIST (CONT'D) Tell me about it, Priya. PRIYA It’s unique. The scientist who built it took her own life so she couldn’t be forced to make another. PROTAGONIST A scientist in the future? PRIYA Generations from now. PROTAGONIST Why did she have to kill herself? PRIYA You’re familiar with the Manhattan Project? As they approached the first atomic test, Oppenheimer became concerned the detonation might produce a chain reaction, engulfing the world. PROTAGONIST They went ahead anyway, and got lucky. PRIYA Think of our scientist as her generation’s Oppenheimer – she devises a method for inverting the world, but becomes convinced that by destroying us, they destroy themselves. PROTAGONIST The grandfather paradox. PRIYA Unlike Oppenheimer, she rebels, splitting the algorithm into nine sections and hiding them the best place she can think of... PROTAGONIST The past. Here. Now.  109. PRIYA There are nine nuclear powers. Nine bombs. Nine sets of the most closely guarde",
      "dialogue_count": 0,
      "word_count": 1743
    },
    {
      "scene_number": 21,
      "slugline": "INT. AIRLOCK – CONTINUOUS The Protagonist pulls off his respirator. KAT Where’s Neil? PROTAGONIST He must’ve already gone through... KAT I didn’t get to say goodbye – this is goodbye, isn’t it? PROTAGONIST Today’s the 14th. Offshore of Siberia – time for us to go. You keep going back another day, give you time to make it to Viet Nam. KAT Who gets me back on the yacht? PROTAGONIST I’ve got somebody good lined up. I’d like to say you don’t have to do this, but... KAT I once told you I didn’t need redemption. But the chance to save my child? You can’t know what that means to a mother. PROTAGONIST No. KAT The worst thing Andrei ever did to me was that offer – to let me go if I never saw my son again. I shouted, swore – INSERT CUT: Kat FLINGS a crystal BOWL OF RASPBERRIES, SMASHING it on a wooden deck... KAT (CONT'D) But he’d seen it on my face – just for an instant. Kat looks at the Protagonist. Who says nothing. KAT (CONT'D) I don’t know if I hate him more for the things he’s done, or because he knows that about me. You’ve killed people you hated before?  117.",
      "characters": [],
      "action_text": "PROTAGONIST It’s not usually personal. KAT He’s dying, anyway. It might not even count – PROTAGONIST It always counts. You’re not there to kill him – you’re the backstop. If we haven’t lifted that algorithm and he kills himself, he takes us all with him, instantly. Kat moves to the Protagonist, in close – KAT Just keep up your end, okay? The Protagonist nods. She kisses him. PROTAGONIST When it’s over, and you’re raising your boy. Carry this – The Protagonist hands her a DUMB PHONE. PROTAGONIST (CONT'D) There may be a time and place you feel threatened. Hit talk, state your location, hang up. KAT Who gets the message? PROTAGONIST Posterity. INT./EXT. CHINOOK – LATER The Protagonist watches the icebreaker recede... EXT. VAST BARREN PLAIN, DUSTED WITH SNOW – DAY Three CHINOOKS zoom low across the barren landscape, followed by another three CHINOOKS long-lining SHIPPING CONTAINERS... INT. CHINOOK – CONTINUOUS The Protagonist sits amongst a DOZEN SOLDIERS. They watch the endless northern plain unroll beneath them...  118.",
      "dialogue_count": 0,
      "word_count": 376
    },
    {
      "scene_number": 22,
      "slugline": "EXT. TENET CAMP – CONTINUOUS The Protagonist gets off the Chinook, watching another Chinook gently set down a container. He follows the others to a tent. INT. BRIEFING TENT – CONTINUOUS Soldiers in folding chairs facing a screen. The Protagonist looks around – still no Neil. Ives steps up, signals for the projector: a devastated CITY, grey CONCRETE and ABANDONED industry amongst terraced strip mines... IVES Stalsk-12. Hidden from the world. A city where anything can happen, and today, gentlemen, for ten minutes, it most assuredly does. Ives switches to a GRAPHIC: a childishly simple diagram of a LANDING AREA, BUILDINGS, then an UNDERGROUND CAVERN... IVES (CONT'D) You were divided into two teams for a temporal pincer movement. We are Red team, moving forwards. Our friends out there – (gestures at containers) – Blue team, led by Commander Wheeler, are inverted. One hour from now, they had this briefing... INSERT CUT: Neil, in RESPIRATOR, in the front row of Commander Wheeler’s briefing of BLUE TEAM. All are in respirators... BACK TO RED-TEAM BRIEFING – IVES (CONT'D) Then were dropped on the ridge above the hypocentre as close in time to the detonation as possible. Their objectives were clearance and clarification. This briefing has the benefit of their experience – and yes, some of you specialists are on both teams. The Protagonist overhears – RED SOLDIER 1 Why don’t they let us see them? RED SOLDIER 2 Maybe we won’t like what happened.  119.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 244
    },
    {
      "scene_number": 23,
      "slugline": "EXT. COAST OF VIET NAM – DAY A SPEEDBOAT bounces through the chop, Mahir (from the freeport heist) at the helm. Kat, beside him, shields her eyes from the glare as they head towards Sator’s yacht. They pull up some way off. A chopper sits on the yacht. Mahir hands Kat binoculars – Kat watches her EARLIER SELF and HER SON board the tender and head for shore... INT. BRIEFING TENT – DAY Ives gestures across the whole area on the schematic – IVES The entire area is radioactive, so both teams wear full protection. To distinguish teams, wear these – A soldier starts passing out RED ARMBANDS... INSERT CUT: Neil, in respirator, takes a BLUE ARMBAND, and, like the rest of the team, puts it on... BACK TO RED-TEAM BRIEFING – Ives points to each of the three elements in turn: IVES (CONT'D) Landing zone, LZ, well defended, including ground-to-air ordinance. We drop in, clear the LZ for Blue team’s evacuation... We make our way into the city proper... these buildings are abandoned, but we learned they have a turnstile in this one... so expect a bi-temporal response. RED SOLDIER 1 They’ll have inverse ordinance? IVES Inverse, conventional, forwards antagonists, inverted antagonists – they have it all, and it can all end you. Got it? Ives goes back to the diagram – IVES (CONT'D) On the other side of the city, the ground rises to the ridge above the hypocentre. (MORE)  120.",
      "characters": [],
      "action_text": "Most of you will proceed up the hill – a splinter unit will take a tunnel from the city to the floor of the hypocentre. Blue team located an entrance here – Ives points to the city’s edge. Then to the CAVERN. IVES (CONT'D) The bomb is in the rock high above to trigger a collapse, sealing the cavern. RED SOLDIER 2 How do we defuse the bomb up there? IVES We don’t. The explosion takes place as planned, exactly ten minutes after our landing. Everything is synchronized to that explosion. Both teams have countdown watches – ours counts down from ten at landing, to zero at the explosion. He holds up his wrist to display a BLOOD-RED ‘10’ – IVES (CONT'D) Blue team is the reverse – INSERT CUT: a PREVIOUS BRIEFING (BLUE TEAM). NEIL watches as Wheeler holds up her wrist to show a VIVID-BLUE ‘10’ – WHEELER Ten at the explosion, to zero at our extraction. If you are not at the LZ by zero, you are not leaving. BACK TO RED-TEAM BRIEFING – IVES Our job is to fail to defuse the bomb, while the splinter unit achieves its task undetected. RED SOLDIER 1 Which is? IVES Need to know. And you don’t. Any other stupid questions? Right, let’s get ready. Everybody RISES. The Protagonist approaches Ives. PROTAGONIST I wanted to be on the first wave. IVES   (CONT'D)  121. IVES There is no first wave – Red team and Blue team operate simultaneously. Do not get on the chopper if you can’t stop thinking in linear terms. You want to be on the team who lifts the contents of that capsule? PROTAGONIST Absolutely. IVES That’s us. We’re the splinter unit. PROTAGONIST Just us? IVES No one who knows the contents of that capsule can leave the field. I thought we’d manage ourselves. EXT. COAST OF VIET NAM – DAY Mahir shows Kat how to use a small pistol. Kat wears a two- piece bathing suit with a shirt over. He puts the pistol in a diver’s bag, loops the lanyard round Kat’s bare ankle. MAHIR It’s forty feet from the private deck to the water. Can you jump it? KAT I can dive it. They hear the chopper SPIN UP. ",
      "dialogue_count": 0,
      "word_count": 1727
    },
    {
      "scene_number": 24,
      "slugline": "EXT. CITY STREETS, STALSK-12 – DAY The Protagonist RUNS across the street, FIRING at the enemy... he SPOTS the TUNNEL ENTRANCE between two buildings. PROTAGONIST Ives! Splinter unit here! Ives nods. RACES over, drawing fire the whole way... EXT. HYPOCENTRE RIDGE, STALSK-12 Neil races into the city streets... he sees Commander Wheeler and a BLUE SOLDIER take shelter in a large jagged BREACH in the ground-floor wall of a massive structure. Neil is FORCED to hit the deck, ducking INVERTED fire all around... he looks over at Wheeler, and sees DUST GATHERING AROUND THE BREACH... NEIL Wheeler! Get out of there! Wheeler! Wheeler hears him – tries to grab the Blue Soldier – MASSIVE CHUNKS OF CONCRETE SCRAPE OVER NEIL’S HEAD, FLYING TOWARDS WHEELER, who DIVES CLEAR – the wall REASSEMBLES ON TOP OF the Blue Soldier, CRUSHING HIM... Neil winces. Starts crawling for better cover... checks his watch – ‘6:24’,‘6:23’... EXT. PRIVATE DECK, SATOR’S YACHT – LATE AFTERNOON Sator looks past Kat to the lowering sun. SATOR It’s going to be a beautiful sunset. I’ll get Max brought back – we should share the moment with him. Sator picks up the phone. Kat looks at the shore, uneasy... EXT. CITY STREETS, STALSK-12 – DAY Ives and the Protagonist shelter as Red team exchanges fire with the Enemy further up the street. The Protagonist checks his watch – ‘5:15’, ‘5:14’... PROTAGONIST Let’s go. We’re running out of time.  127.",
      "characters": [],
      "action_text": "IVES If they see us, it’s all for nothing. PROTAGONIST We need a distraction. Ives looks ahead to the LEANING RUIN OF A BUILDING TOP... IVES Don’t worry about that... EXT. CITY STREETS – DAY Neil checks his watch – ‘5:10’, ‘5:09’... frustrated, pinned down, he looks around for a way to break cover... Commander Wheeler, with the rest of Blue team, SHELTERS in the shadow of the RUINED BASE of a building, pinned by ENEMY FIRE from the base of the building... WHEELER RPG! Take out the base – on my mark – She checks her watch – ‘5:04’, ‘5:03’... The BLUE RPG SOLDIER takes aim... EXT. CITY STREETS, STALSK-12 – DAY The Protagonist spots SMALL DEBRIS ROLLING across the street... GATHERING MOMENTUM... PROTAGONIST Ives! Ives sees LARGER and LARGER debris is ROLLING down the street towards the LEANING RUIN OF A BUILDING TOP... IVES It’s about to get distracting... He signals a RED RPG SOLDIER... IVES (CONT'D) On my mark! He looks at his watch – ‘5:01’, ‘5:00’ – IVES (CONT'D) Fire! The leaning ruin THRUSTS UPWARDS –  128.",
      "dialogue_count": 0,
      "word_count": 421
    },
    {
      "scene_number": 25,
      "slugline": "EXT. CITY STREETS, STALSK-12 – DAY Wheeler watches as the Leaning Ruin’s UPPER STOREYS REASSEMBLE, as its BASE EXPLODES... EXT. CITY STREETS, STALSK-12 – DAY The Protagonist takes cover as the Leaning Ruin’s BASE REASSEMBLES as its UPPER STOREYS EXPLODE... the Protagonist and Ives race at the tunnel entrance – the GREY TRUCK RACES at them as they dive for the tunnel... EXT. CITY STREETS, STALSK-12 – DAY Wheeler ducks as the weight of the upper storeys COLLAPSES the building... Neil lifts his head after the EXPLO/IMPLOSION. Clear. He gets up and starts RUNNING... EXT. TUNNEL ENTRANCE, STALSK-12 – DAY The Protagonist and Ives RACE into the tunnel, HITTING A TRIPWIRE WHICH BLOWS THE TUNNEL ENTRANCE DOWN BEHIND THEM AS THEY JUMP INSIDE... EXT. PRIVATE DECK, SATOR’S YACHT – LATE AFTERNOON Sator hangs up. He holds a SILVER PILL in the sunlight, studying it... KAT What’s that? SATOR I borrowed it from the CIA. KAT But what is it? SATOR The way the world ends, not with a bang but a whimper. KAT I don’t understand. SATOR When I take this, it’s all over. KAT Then don’t take it, yet. Sator looks at her, needing her to care.  129.",
      "characters": [],
      "action_text": "SATOR Why not? KAT We’ve got the sunset coming and a little vodka left... SATOR And Max will be here soon... they thought it was you, not Anna, on shore with Max. Kat steps up in front of Sator, seductive... KAT As long as you can tell the difference... Sator smiles appreciatively, but pulls out his phone – SATOR A moment’s business, my love... EXT. MAHIR’S BOAT – CONTINUOUS Mahir checks his radio – IVES (over radio) Not clear. Repeat, not clear... INT. TUNNEL, STALSK-12 – DAY The Protagonist and Ives look back at the COLLAPSED ENTRANCE – PROTAGONIST We’re committed now. They turn and RACE through the mining tunnel... IVES (into radio) Just hold tight – we’re almost there... EXT. CITY STREETS, STALSK-12 – DAY Neil spots SATOR’S GREY MI8 OVERHEAD, a rope hanging down. Across the street he sees VOLKOV REVERSE-EXIT the tunnel mouth, CROUCHING to ‘DERIG’ a tripwired booby trap, carrying it towards the chopper, then LEAPING up onto the line – RISING from the streets...  130. Neil STARES. CONCERNED. Checks his watch – ‘4:10’, ‘4:09’... Then TAKES OFF, SPRINTING – WHEELER Neil! She watches him go ahead, then signals Blue team to keep pushing forward... INT. TUNNEL, STALSK-12 – DAY The Protagonist and Ives run down the tunnel... they slow as they see a BODY, blue armband, lying on the ground on the opposite side of a SET OF BARS at the end of the tunnel. They can see into the hypocentre, the GIANT ATOMIC-HEWN CAVERN, daylight above, CAPSULE on the rock floor next to the mouth of a BORE HOLE. The Protagonist checks his watch – ‘4:06’, ‘4:05’ ... Ives checks the ELECTRONIC LOCK – IVES We don’t have anything big enough to blow this. Try him – The Protagonist reaches through the bars and checks the body – FREEZES: attached to a zip, a TALISMAN – A COIN WITH A HOLE HANGING FROM A SMALL LENGTH OF ORANGE AND YELLOW STRING... The Protagonist looks at it, quizzical, rises – PROTAGONIST Nothing. Can you pick it? SATOR (O.S.) I hope not. I paid a lot for that lock... WHAM! Ives goes d",
      "dialogue_count": 0,
      "word_count": 641
    },
    {
      "scene_number": 26,
      "slugline": "EXT. PRIVATE DECK, SATOR’S YACHT – LATE AFTERNOON Sator steps away from Kat as he speaks quietly into the phone. SATOR My fate was always bound up with radiation. We’d work where no one else would. We made a devil’s bargain – money for time. We sold our futures. Kat looks at Mahir’s boat. Nothing. She looks to the shore. Far in the distance, she can see the TENDER APPROACHING... INT. TUNNEL, STALSK-12 – DAY The Protagonist looks at Volkov. At the bars between him and the capsule... PROTAGONIST Now you’re making the same mistake for the entire world. SATOR (over phone) It wasn’t a mistake. I made the bargain I could. What was yours? You fight for a cause you barely understand. With people you trust so little you’ve told them nothing about what you’re doing. When I die the world dies with me. And your knowledge dies with you. Buried in the tomb like an anonymous Egyptian builder sealed in the pyramid to keep his secret... INT. TURNSTILE BUILDING, STALSK-12 – DAY Neil comes into the turnstile room... he watches ENEMY TROOPS enter/exit the machine, inverting to join the battle. He waits for his chance... the room is empty... he sees himself through the proving window, and RUNS at the machine... EXT. PRIVATE DECK, SATOR’S YACHT – EVENING Sator speaks into his phone – SATOR Your faith is blind. You’re a fanatic.  132.",
      "characters": [],
      "action_text": "PROTAGONIST (over phone) What’s more fanatical than trying to destroy the world? Kat moves towards Sator, but he raises a finger... SATOR I’m not. I’m creating a new one. Somewhere, sometime, a man in a crystalline tower throws a switch and Armageddon is both triggered and avoided. Entropy inverts the same way the magnetic poles have switched 183 times over the millennia. Now time itself switches direction. Sator looks out at the lowering sun... SATOR (CONT'D) The same sunshine we’ve basked in will warm the faces of our descendants generations from now. Kat looks at Mahir’s boat. Nothing. She looks to shore, watching the TENDER APPROACHING... INT. TUNNEL, STALSK-12 – DAY The Protagonist looks at his watch – ‘2:12’, ‘2:11’... PROTAGONIST How can they want to destroy us? SATOR (over phone) Because their oceans rose and their rivers ran dry. Don’t you see –? Their world shrivelled because of us. They have no choice but to turn back, there’s no life ahead of them. And we’re responsible. Knowing this, do you still want me to stop? PROTAGONIST Yes. Each generation looks out for its own survival. EXT. PRIVATE DECK, SATOR’S YACHT – CONTINUOUS Sator looks out at the glittering water – SATOR That’s exactly what they’re doing.  133. PROTAGONIST (over phone) Sure, but not you. You’re a traitor. Bringing death to all because you have no life of your own left. SATOR When I’m done, life continues. PROTAGONIST (over phone) Not your son’s. SATOR My greatest sin was to bring a son into a world I knew was ending... do you think God will forgive me? PROTAGONIST (over phone) For killing your son? No. SATOR He should understand – he killed his own. EXT. CITY STREETS, STALSK-12 – DAY Neil, FORWARDS NOW, spots a GREY TRUCK outside the turnstile building – he jumps in, FIRING IT UP – RACING THROUGH THE STREETS, PAST THE IMPLODING/ EXPLODING BUILDING, racing for the tunnel mouth, trying to head off the Protagonist and Ives – NEIL Wait! Wait! They dive into the tunnel, which COLLAPSES. Neil s",
      "dialogue_count": 0,
      "word_count": 831
    },
    {
      "scene_number": 27,
      "slugline": "EXT. PRIVATE DECK, SATOR’S YACHT – SUNSET Sator goes to hang up, pauses... an afterthought – SATOR Volkov? INT. TUNNEL, STALSK-12 – CONTINUOUS Volkov RUSHES FORWARD with his gun... SATOR (over phone; in Russian, subtitled) – Shoot him in the head. – Volkov PULLS HIS TRIGGER – but the Dead Tenet Soldier has ‘RISEN’ to be in front of the gun ‘ABSORBING’ the bullet – then LEAPING to one side, ALIVE – EXT. PRIVATE DECK, SATOR’S YACHT – CONTINUOUS Sator hears the shot, SATISFIED – Kat pulls the phone away – KAT Enough business, Andrei... INT. TUNNEL, STALSK-12 – CONTINUOUS The Protagonist DIVES to where Ives is lying, GRABS his gun – Volkov TURNS, RUNNING FOR the winch-release – PROTAGONIST WAIT! WAIT! He FIRES at Volkov, who goes down just short of the winch... Ives struggles to his feet, checking his watch – ‘1:07’, ‘1:06’... Hearing BEEPS, Ives looks up. THE LOCK is open – EXT. HYPOCENTRE RIDGE, STALSK-12 – CONTINUOUS Neil RACES up the slope to the ridge – through the MINEFIELD, setting off personnel mines in his wake, NARROWLY AVOIDING RUNNING HIMSELF OVER... EXT. PRIVATE DECK, SATOR’S YACHT – EVENING As Kat pours him a drink, Sator looks out at the glowing horizon, fiddling with the silver pill... he POINTS –  136.",
      "characters": [],
      "action_text": "SATOR Tomorrow the sun will rise in that same spot. For the first time in history. Because I’ve told it to. (looks at her like she’s a loyal dog) You have no idea what I’m talking about, do you? She looks at him, smiles sweetly. KAT It sounds terribly important, Andrei. He reaches for her – she gets up, moves to the rail – SATOR Where’re you going? She grabs the hose, starts spraying herself – KAT Aren’t you hot? Kat sprays the deck in front of the rail – SATOR What’re you doing, now? KAT I spilled sunscreen. SATOR So what? KAT It’s slippery. SATOR Just come here... She looks at Sator lying on the daybed like an appalling emperor. Moves towards him. Grabs the sunscreen. KAT Turn over. SATOR The sun’s almost gone. KAT You’ll like it. He rolls over, obedient. She squirts a large dollop across his back. Looks up at Mahir’s boat, hopeful. Nothing.  137. She checks her watch as she lazily smears the sunscreen across Sator’s back. He groans. Kat watches the TENDER APPROACHING, she can just make out HERSELF AND HER SON... INT. TUNNEL, STALSK-12 – DAY The Protagonist watches the Dead Tenet Soldier RACING BACKWARDS from the gate, out of the tunnel – IVES COME ON! The Protagonist TURNS – Ives swings the gate open – they RACE through, just before it closes, SLAMMING SHUT behind them – IVES (CONT'D) Tunnel’s sealed! The Protagonist steps over Volkov, STRUGGLES with the capsule, it swings, HANGING precariously over the well... IVES (CONT'D) (into radio) Mahir, do you copy? EXT. MAHIR’S BOAT – EVENING Mahir looks through binoculars, FRUSTRATED, flare gun ready – IVES (over radio) Hold! Repeat, hold! EXT. HYPOCENTRE RIDGE, STALSK-12 – DAY Neil REVERSES towards the hole – jumps out, pulling a line from the rear winch... EXT. PRIVATE DECK, SATOR’S YACHT – SUNSET Kat looks at Mahir’s boat. Nothing. She checks her watch... looks down at the tender approaching – it’s close enough she can clearly see HERSELF CHATTING AND LAUGHING WITH MAX... she jumps up from the daybed, holding the div",
      "dialogue_count": 0,
      "word_count": 1067
    },
    {
      "scene_number": 28,
      "slugline": "EXT. LZ, STALSK-12 – DAY Wheeler PULLS a last Blue team soldier into the container as her watch hits ZERO – the container door SLAMS shut – BLUE TEAM SOLDIER Do you think they made it? EXT. PRIVATE DECK, SATOR’S YACHT – SUNSET Kat picks up the shell casing, drops it in the diver’s bag, zips it up, attaches the lanyard to her ankle, sprays down the deck, WASHING away BLOOD and SUNSCREEN... Kat steps up to the railing. Watches Mahir, down below, getting a line on Sator’s body. Kat glances over at the TENDER ARRIVING WITH HER EARLIER SELF AND HER SON... Kat DIVES, ARCING GRACEFULLY THROUGH THE SUNSET... Kat’s earlier self, stepping onto the yacht, catches a glimpse of a graceful form SLICING into the water. She looks, CURIOUS, but Max TUGS her sleeve and she turns. EXT. COAST OF VIET NAM – CONTINUOUS On Mahir’s SPEEDING boat, Kat hands Mahir the diver’s bag and looks up ahead to the last light of day... PROTAGONIST (over radio) Kat, you jumped the gun! Mahir hands her the radio – KAT I couldn’t do it, I couldn’t let him die thinking he’d won. And I knew you’d find a way. Silence. She glances Mahir, suddenly concerned – KAT (CONT'D) Wait, you found a way? We’re okay, right? PROTAGONIST (over radio) Yeah. We found a way. Be safe. Mahir’s boat SPEEDS AWAY through the twilight... ...DRAGGING Sator’s body behind.  141.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 240
    },
    {
      "scene_number": 29,
      "slugline": "EXT. WINDSWEPT PLAIN OUTSIDE STALSK-12 – EVENING A Chinook swirls snow around the blasted ruins... Ives and the Protagonist slump, bruised, exhausted, gas masks off, breathing hard. On the ground between them – the matte-black algorithm... Neil approaches, removing his gas mask... PROTAGONIST I thought you were inverted. NEIL Changed gears halfway – you needed help here. IVES We needed help down there. (to Protagonist) How’d you get that lock open? PROTAGONIST It wasn’t me. (to Neil) Didn’t your team need you? NEIL I’ll get them on the next pass. Right, Ives? IVES Once I’ve caught my breath. The Protagonist reaches for the algorithm – Ives PULLS it out of his reach – his gun laying casually across his leg. As Neil and the Protagonist watch, Ives takes his weapon in hand, gets to his feet... He lifts the algorithm... looks around at the deserted plain above Stalsk-12... IVES (CONT'D) Nice and private. Ives SEPARATES the algorithm into THREE COMPONENTS – PROTAGONIST No one who’s seen this leaves the field... IVES We hide it, we end our lives. It’s the only way to be sure. Ives TOSSES them each one component... IVES (CONT'D) But as to when... Ives HOLSTERS his sidearm.  142.",
      "characters": [],
      "action_text": "IVES (CONT'D) Maybe that’s every man’s decision to make for himself. NEIL You’re not going to kill us? IVES If I ever find you I will. NEIL But you won’t look too hard. IVES Yes, I will. Neil shakes his head, smiling at this. Ives heads towards the Chinook. Neil and the Protagonist watch him go... NEIL You’re not heading back to London to check on Kat, are you? PROTAGONIST Of course not. That would be too dangerous. NEIL Even from afar. PROTAGONIST Even from afar. Neil thinks of something. Looks at Ives – NEIL Ives, wait! Neil takes his section of the algorithm, REATTACHES it to the Protagonist’s. PROTAGONIST You’re really going back in? NEIL I’m the only one who could’ve got that door open in time, right Ives? Ives looks at Neil, sizing him up. IVES I don’t have any locksmiths as good as you. Neil turns to the Protagonist, grabs his BACKPACK...  143. NEIL See? That’s me in there, again. Weaving another pass in the fabric of this mission. Neil SWINGS his pack onto his back, revealing a TALISMAN – A COIN WITH A HOLE TIED to the zip WITH ORANGE AND YELLOW THREAD – PROTAGONIST Neil, wait. NEIL We just saved the world – we can’t leave anything to chance. The Protagonist thinks. Struggles. PROTAGONIST But can we change things? If we do it differently...? Neil looks back at the Protagonist. Sees his struggle... NEIL What’s happened’s happened. (smiles) Which is an expression of faith in the mechanics of the world, not an excuse to do nothing. PROTAGONIST Fate? NEIL Call it what you want. PROTAGONIST What do you call it? NEIL Reality. Now let me go. The Protagonist lets him walk, tears welling up... CALLS OUT – PROTAGONIST Hey!   (Neil turns) You never did tell me who recruited you. NEIL (smiles) Haven’t you guessed by now? You did. Just not when you thought. You have a future in the past. Years ago for me. Years from now for you.  144. PROTAGONIST You’ve known me for years? NEIL (nods) For me, I think this is the end of a beautiful friendship. PROTAGONIST But for me it’s ",
      "dialogue_count": 0,
      "word_count": 1059
    }
  ]
}