{
  "slug": "the-lost-city-of-z-2017",
  "title": "the lost city of z",
  "genre": "drama",
  "format": "film",
  "scenes_count": 8,
  "characters_count": 1,
  "characters": [
    "PERCY FAWCETT"
  ],
  "total_words": 27514,
  "total_dialogue": 2,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. BOLIVIAN PLAIN - DAY 18   18  A TRAIN rockets through the area. INT. TRAIN 19   19  A crummy and cramped and loud interior.   Filled with Bolivian and indigenous peoples.   Fawcett talks inaudibly with a Bolivian, then walks toward a seat, holding a map in his hand.   He avoids a FRUITSELLER (who is ad-libbing:  “chirimoyas, grenadillas!”).  Costin is seated, READING A NEWSPAPER.   THE HEADLINE: “SHACKLETON, MURRAY TO SOUTH POLE”.   A PICTURE OF SHACKLETON and JAMES MURRAY.   REMEMBER MR. MURRAY’S FACE.   A Woman with a DOG in a basket stands right near Costin when he moves to accommodate Fawcett; the dog bothers him by continually sniffing his ear. Fawcett joins him in the empty seat, holding a map and a smaller piece of paper.   He seems concerned, remote. HENRY COSTIN There a problem? PERCY FAWCETT We received a cable, in Asuncion. The political situation appears to have worsened and there’s been a change in plan. (to the map) We’ll need to redirect our line of approach--our first priority must now be to map the Verde River and find its source.   It forms a critical part of the border between Bolivia and Brazil. HENRY COSTIN It’s rather far from here, is it not? PERCY FAWCETT It is. (unfolds the map) Our survey route for the river would begin here, at, at--Fazienda Jacobina.  Lost City of Z   Green Revision Set 09/30/2015   23.",
      "characters": [],
      "action_text": "HENRY COSTIN Yes, I’ve come across it in my reading--it’s meant to be quite enchanting. PERCY FAWCETT (looking at his telegram) We’re to meet a Corporal Manley there.   He’s contacted an Indian guide and hired the rest of our crew. (back to the map) We must chart our progress with as much survey detail as possible. Hopefully any mail from our loved ones will beat us to the spot. (as he folds the map) Time is of the essence.   War is at stake and the environment will not be friendly. Costin battles the dog in the basket; it keeps sniffing his ear: HENRY COSTIN We’re to stop a war, you and I? The two of us, and a couple of mules? PERCY FAWCETT (speechless for a moment; the odds ARE long; then:) Mr. Costin--we’re going to have to depend on each other.   Because neither of us will survive this alone. HENRY COSTIN I understand pefectly, sir. However, this DOG will not survive this train ride. (seeing Fawcett reading the journal) What’s that you’re reading? PERCY FAWCETT It’s a poem.   For our journey. Costin looks over at the book.   CLOSE SHOT ON HANDWRITING ABOVE THE TEXT: “TO PERCY, WITH LOVE, NINA.”   We TILT DOWN to THE TEXT, and we HEAR:  Lost City of Z   Green Revision Set 09/30/2015   23A. PERCY FAWCETT (CONT’D) “THERE’S no sense in going further-- it’s the edge of cultivation, So they said, and I believed it--”  Lost City of Z   Green Revision Set 09/30/2015   23B.",
      "dialogue_count": 0,
      "word_count": 478
    },
    {
      "scene_number": 2,
      "slugline": "EXT. ANDES MOUNTAINS - DAY 20   20 A wide shot.   Our two men look like ants.   Over this, we HEAR the PREVIOUS SCENE continue, and we CUT TO A SERIES OF SHOTS of our men walking in MOUNTAINOUS TERRAIN, then HILLS, then GRASS...   Now, NINA FAWCETT’s VOICE.   SHE IS READING IT: NINA FAWCETT (V.O.) “Till a voice, as bad as Conscience, rang interminable changes On one everlasting Whisper day and night repeated--so: ‘Something hidden. Go and find it. Go and look behind the Ranges-- Something lost behind the Ranges. Lost and waiting for you. Go!’” EXT. MOUNTAINS - LATER 21   21   * A different kind of vegetation--GREEN.   The SOUNDS begin to   * change, too--much less wind, much more active with insects...   * Fawcett is sweating.   It is starting to get hot.   There are   * rivulets that all seem to be flowing downhill and gaining   * steam.   Costin stops to take notes in a survey book.   * BACK TO FAWCETT: THERE IS OVERGROWN VEGETATION BLOCKING THE   * VIEW on the path. Fawcett HACKS AWAY with his machete.   * He STOPS.   SOMETHING SEEMS TO DAWN ON HIM.   * PERCY FAWCETT   * Mr. Costin--   * Then he starts to HACK AWAY AGAIN!   * With an astonishing furor.   WE PAN WITH HIM with each BLOW.   * His FEET are in mud; seeing this:   * PERCY FAWCETT (CONT’D)   * Mr. Costin!   * HENRY COSTIN   * What is it...?   * Costin approaches quickly.   Finally, a clearing.   REVEALING:   * AMAZONIA.   * A VAST GREEN. The JUNGLE, which engulfs the riverbanks of the   * magnificent AMAZON RIVER.   It is beautiful and beguiling, and   * so enormous it fills one with awe.   *  Lost City of Z   Buff Revisions (10/25/15)   24.",
      "characters": [],
      "action_text": "Costin comes up behind him, looking over Fawcett’s shoulder.   * He is blown away by the vista.   * HENRY COSTIN (CONT’D)   * My God...   * PERCY FAWCETT   * (almost to himself)   * It’s even grander than one could   * have imagined...   * Stifling the briefest of smiles, Fawcett goes right back to   * putting up a steely front.   He starts going through his   * things.   But he cannot hide his excitement.   As he rummages:   * PERCY FAWCETT (CONT’D)   * The manual insists we keep only the   * essentials now and live off the   * land, as best we can.   * HENRY COSTIN   * Only the essentials, yes.   * (to himself)   * Cricket whites, begone...   *  Lost City of Z   Buff Revisions (10/25/15)   24A. INT. JUNGLE 22   22   * The camera MOVES THROUGH THE GROWTH, the POINT-OF-VIEW of our characters...  Lost City of Z   Buff Revisions (10/25/15)   25. The SOUNDS of the jungle are loud and yet oddly soothing.   It should be clear to us from the noises that nature has taken over.   BUZZING of unidentifiable creatures... SERIES OF SHOTS Of monkeys and birds and snakes and spiders and frogs... Fawcett, Costin ENTER THE JUNGLE in SILENCE...   ONLY THE RUMBLE OF THUNDER...   THUNDER, but no RAIN.   YET. INT. JUNGLE - LATER 23   23  Fawcett and Costin’s feet sink in mud; a bright YELLOW SNAKE slithers around Fawcett’s feet.   Costin’s eyes widen at the   *  sight of it; Fawcett steps over it with studied calm...   *  Sweat pours off their faces; terrible HEAT...   SWARMING INSECTS...   SAUBA ANTS...   TICKS...   CHIGGERS... Percy Fawcett BREATHES heavily but HACKS away with his machete.   Costin is nearby, slightly ahead, HACKING AWAY at the JUNGLE.   Occasionally, Fawcett stops to check a map, takes out his surveying equipment.   He calls out: PERCY FAWCETT   *  Twenty-nine degrees, 16 minutes,   *  south of the equator.   *  HENRY COSTIN   *  Twenty-nine, and sixteen!   *  PERCY FAWCETT   *  (as he starts hacking   *  again)   *  Tell me, Mr. Costin!   What induced   *  you to b",
      "dialogue_count": 0,
      "word_count": 4646
    },
    {
      "scene_number": 3,
      "slugline": "EXT. RAFT 40   40 Fawcett gets aboard the raft with more than a couple of piranhas still attached to his arms and legs.   Fawcett and Costin swat away the piranhas and, courageously braving the still-constant stream of arrows, tries to get Urquhart aboard: PERCY FAWCETT Come on, pull! Manley and the others help, with Tadjui looking on.   Fawcett finally succeeds in pulling Urquhart up, onto the raft. And he is DEAD.   His lower half has been completely devoured by the piranhas... The RAFTS FINALLY PASS THE FLURRY OF ARROWS AND SPEARS.   The last FLURRY OF SPEARS hit near the raft without incident... ANGLE ON FAWCETT.   Out of breath and spent beyond words.   He SEES his PERSONAL EFFECTS--the LETTER, the FAMILY PHOTOGRAPHS, on the raft and soaked.   They’d been spilled during the chaos. PERCY FAWCETT (CONT’D) Thank you for your aid, Mr. Costin. Costin nods.   Fawcett’s face wrinkles in anguished recognition of his articles’ damage.   HE COLLECTS HIS THINGS. DISSOLVE TO: EXT. THE AMAZON JUNGLE - SHALLOW RIVER BED - DUSK 41   41   * Rain.   Silence.   Gloom.   Fear.   All stumble, quietly, as they   * help pull the boats across shallow water.   FAWCETT is still   * alert.   The MAPBOOKS are getting more and more completed...   * Virtually no more food in the containers.   The hounds rummage   * alongside the rafts, sniffing at anything they can lick or   * chew.   * MORE BUGS: flies, mosquitos, spiders, maggots in the skin.   * Costin, who has now grown very sick with fever, shivers in   * the rain as he can barely walk.   Manley VOMITS black fluid.   * Hunched by the edge of the raft:   * ARTHUR MANLEY   * I...I’m sick...I think I’ve   * malaria...   Perhaps the sun shall   * bake the fever out of me!   *  Lost City of Z   Buff Revisions (10/25/15) 40-43.",
      "characters": [],
      "action_text": "Dan is hallucinating; he mutters about his hallucinations   * aloud:   * DAN   * Months on the river! And--so many   * beautiful flowers...   * Dan has MAGGOTS in his ARM.   * DAN (CONT’D)   * My maggots... Are they...they’re my   * friends!   * He SMILES.   * Fawcett sees Costin, who hides his own skin blemish, on his   * arm.   Costin makes eye contact, pulling down his sleeve:   * HENRY COSTIN   * It’s nothing at all...   * Percy moves to Tadjui:   * PERCY FAWCETT   * Are we close?   * TADJUI   * Many week to go.   The river still   * strong.   * Fawcett looks at his men, then back to Tadjui:   * PERCY FAWCETT   * We won’t survive another attack.   * If there are more dangerous tribes   * ahead--   * TADJUI   * The river is death.   * (beat)   * But you will see-- many   people live   * here once.   Beautiful city of gold   * and maize.   Even older than   * English.   With roads and bridges.   * Percy SNAPS to attention.   He looks at Tadjui as though he is   * completely mad.   * TADJUI (CONT’D)   * Deep, in the forest.   All gold.   It   * blaze, like fire.   * Fawcett turns away, devastated by the prospect that Tadjui is   * also going mad.   Under his breath:   *  Lost City of Z   Buff Revisions (10/25/15)40-43A. PERCY FAWCETT   *  Christ...   * TADJUI   * Conquistador try to find it, many   * try.   But the white man never find   * it...   * Reaching for his RIFLE, Fawcett LOADS IT.   POCKETS SPARE   * SHELLS.   TADJUI STARTS TO SCREAM:   * TADJUI (CONT’D)   * I feel sorry for you, English!   * Soon I am free!   For the Espanol   * and you, there is no escape from   * jungle--only death!   * WILLIS   * The river’s coming back!   Pitching   * camp!   * UP AHEAD: A CLEARING.   * EXT. BY THE CAMPFIRE - NIGHT 42   42   * The members of the group sit with their rifles aimed into the   * darkness.   They see the TWINKLES from the eyes of animals out   * into that dark.   The noises of the jungle frighten them   * beyond belief.   Then the jungle goes SILENT.   Th",
      "dialogue_count": 0,
      "word_count": 2607
    },
    {
      "scene_number": 4,
      "slugline": "EXT. BOLIVIAN GOVERNMENT BUILDING - BRITISH EMBASSY - DAY 47   47  A magnificent building in busy downtown La Paz.   BUSTLING. INT. BOLIVIAN GOVERNMENT BUILDING - DAY 48   48  A group of very comfortable British soldiers are at work at their desks as one BRITISH SECRETARY types at the front desk. Smiles, joking.   Then they STOP. Percy Fawcett walks into the building.   He looks and smells like hell, filthy and unshaven and shaking like a leaf from malnutrition.   Hair completely out of control, his beard at epic length. He approaches an official (CECIL GOSLING) at the front desk.   *  The official, whose nose crinkles up--presumably at the stench of Fawcett--seems bewildered.   Fawcett SHAKES LIKE A LEAF; is he mad? CECIL GOSLING   *  May I...help you, sir? PERCY FAWCETT Tell me please--is there war, between Bolivia and Brazil?   I’ll fight if I’m needed. CECIL GOSLING   *  (baffled) War?   No, sir--there’s no war.   Is there something we might do for you? PERCY FAWCETT My name is Major Percy Fawcett.   If you could, please contact my family through the Royal Geographical Society, in London.   *  SLAM!   Fawcett DUMPS a series of frayed map notebooks on the desk.   He also EMPTIES HIS POCKETS OF POTTERY SHARDS.   A BRITISH OFFICIAL (”SIMON BEAUCLERK”) with his back to us   *  overhears this.   He seems interested, turns.   Approaches. Meanwhile, Fawcett is hurriedly throwing everything on the desk: PERCY FAWCETT (CONT’D) I’ve the maps here, they’re, they’re all completed...  Lost City of Z   Green Revision Set 09/30/2015   49.  (MORE)",
      "characters": [
        "PERCY FAWCETT"
      ],
      "action_text": "And, and I found these, these bits of pottery, and statues, in the jungle--a great discovery...to be pursued...  Lost City of Z   Green Revision Set 09/30/2015 49A.  PERCY FAWCETT (CONT’D) SIMON BEAUCLERK   *  Major Fawcett? Fawcett struggles even to nod: PERCY FAWCETT Yes...? ENTERING, almost crawling in now, behind Fawcett: COSTIN, MANLEY, WILLIS.   *  SIMON BEAUCLERK   *  I believe I got your orders on my desk just last week.   You were supposed to arrive here in July 1908? Fawcett looks up, sees a calendar on the wall: “AUGUST.” PERCY FAWCETT (devastated) I’m, I’m so very sorry, it’s August...   We did the best we could- -most members of our party did not survive. SIMON BEAUCLERK   *  Major, it’s August 1907.   You’re eleven months   early .   You’ve mapped the entire Verde tributary a year ahead of schedule. HE AND THE OTHER OFFICERS ARE ASTONISHED.   Another British Officer, seeing how frail Fawcett looks, runs to get a chair and positions it right behind Fawcett: PERCY FAWCETT I can   stand , thank you. A whole host of officers now seem to realize what’s going on and begin to gather around Fawcett. CECIL GOSLING   *  Sir, should you like a bed?   Some food, or a bath perhaps? PERCY FAWCETT Yes.   For ALL of us. CECIL GOSLING   *  Yessir.   Of course.   *  Lost City of Z   Green Revision Set 09/30/2015   50. PERCY FAWCETT And I’d like you to send a telegram to my wife, Mrs. Nina Agnes Fawcett   *  --HELL VERDE CONQUERED. And then FAWCETT’S EYES ROLL BACK INTO HIS HEAD.   He COLLAPSES... PRE-LAP a MARCHING BAND playing an UPBEAT SONG: CUT TO: EXT. PORT - DOCK - LATE DAY 49   49  It is late afternoon and the port is PACKED with people.   A band plays a MARCH and the mood is an absolute celebration. A BOAT is at the DOCK.   OFF THE BOAT COMES PERCY FAWCETT.   A CHEER.   A HERO’S WELCOME. He LOOKS THROUGH THE CROWD.   He looks for someone... The CROWD TRIES TO TOUCH HIM, DOES TOUCH HIM. PUSHING HER WAY toward him: NINA FAWCETT, HOLDING A BABY. It’s BRIAN.   Her ot",
      "dialogue_count": 2,
      "word_count": 11532
    },
    {
      "scene_number": 5,
      "slugline": "EXT. TRENCH - JUST BEFORE DAWN 93   93 The troops, looking weary and beyond battle-scarred, stare at CAMERA as we DOLLY PAST THEM.   They cower from the shells. We’re in Fawcett’s POV.   FAWCETT PATROLS THE TRENCH. Fawcett then looks over to SEE a LOW PRIVATE, shaking like a   * leaf.   The Private has vomited all over his uniform.   Fawcett then charges through the trench, YELLING HIS SPEECH: PERCY FAWCETT   * When I was younger, I ventured all   * for King and Country, for place,   * and rank.   I believed that to be   * the makings of a man.   But my   * travels have taught me that such   * ambitions are mere phantoms.   * Phantoms that exclude humanity from   * the Garden of Eden.   My dear   * friends, what DOES matter--the only   * thing that matters--is the esteem   * we show our fellow man.   In our   * hearts we fight for our loved ones;   * as they are not here today, we   * fight for each other.   * (beat) Good luck and may God be with you.   * HENRY COSTIN   * And fuck the bloody Boche!   * Everyone laughs, including Fawcett.   * Then the men separate, begin to line the trenches.   Cleaning   * their rifles, making sure the bayonets are screwed on tightly.   Readying the charge.   Many men start throwing up; others kiss small bibles; others look at family photos which they kiss and place in their breastpockets.   Others are merely still, awaiting almost certain death.   Fawcett takes a small drawing of AMAZONIA JUNGLE, holds it to his head. Almost like he’s praying to it.   Then pockets it. We SEE: ROWS OF HORSES, getting GAS MASKS put on their heads.   * INDIAN TROOPS are getting ready to mount them, and are   * adorned in the most elaborate and absurd manner...   * EXT. TRENCH - BATTLEFIELD - DAY 94   94 Fawcett takes several steps near the top of the trench. Places a whistle in his mouth.   Looks at his men, who are donning GAS MASKS.   Raises his arm and BLOWS THE WHISTLE. Lost City of Z   White 7/31/15   97.",
      "characters": [],
      "action_text": "Upon blowing the whistle, an army of men charge out of the trench with a collective BATTLE CRY.   Among them, the Low Private.   ALMOST INSTANTLY, so many of the men are RIDDLED WITH MACHINE GUN FIRE.   Others are SET AFIRE with FLAMETHROWERS. EXPLOSIONS ALL AROUND.   Mines.   Shells.   Brutally loud. THEN: THE TWO INDIAN CAVALRY REGIMENTS GALLOP out of the TRENCHES; the HORSES HAVE GAS MASKS OF THEIR OWN.   Absurd. They charge toward the German position, but are SET ON FIRE by FLAMETHROWERS and HIT BY THE HAIL OF BULLETS.   Huge numbers of new troops leap from the trenches, many to be met with a similar fate. Wounded infantrymen crawl into shell holes.   Fawcett himself emerges from the trench.   Sees ARTHUR MANLEY, shrieking. Then MANLEY gets his FACE BLOWN OFF.   Costin charges right along with Fawcett. Fawcett whips off the gas mask and starts to yell.   Screams to his soldiers, often inaudible from the devastating sounds of war, we can nonetheless tell what he’s saying either by reading his lips or by the occasional word peaking through: PERCY FAWCETT Come on!   Come on!   Come on!   * FLASH CUT TO: FAWCETT, URGING ON FELLOW EXPLORERS IN THE JUNGLE; HIS MOTION 95   95 IS PRECISELY THE SAME AS THE ONE ON THE BATTLEFIELD... CUT BACK TO: EXT. BATTLEFIELD 96   96 A GONG sound.   CHEMICAL WEAPONS are coming.   HENRY COSTIN SCREAMS FROM HIS POSITION: HENRY COSTIN Incoming!   Gas! Fawcett stands in the middle of the battlefield, seemingly a man on his own.   And in his own world.   Men shrink and charge forward around him; men die around him; men courageously stand their ground. BULLETS and FLAMES seem mysteriously to avoid him; he seems impervious...   SMOKE seems to envelop Fawcett in his crazed, dazed state.   He holds up his rifle with its bayonet into the air.   He has a THOUSAND-YARD STARE NOW... Lost City of Z   White 7/31/15   98. AND THEN WE HEAR IT: A GONG SOUND.   A nearby explosion. Fawcett falls to his knees.   His mouth opens in lockjaw and his eyes roll",
      "dialogue_count": 0,
      "word_count": 1649
    },
    {
      "scene_number": 6,
      "slugline": "EXT. LARGE FIELD - CLOUDY DAY 100   100  We HEAR distant GUN SHOTS.   The wind howls.   Then we SEE, emerging from over a hill, Jack Fawcett, holding a RIFLE.   A RABBIT runs through the grass.   Jack raises his rifle, FIRES again.   He hits the RABBIT.   Percy and Nina Fawcett emerge, having seen the shot. PERCY FAWCETT You’ve become quite expert with that rifle! JACK FAWCETT Thank you, father. After he recovers, he WATCHES HIS SON RUN to GET THE RABBIT. JACK PROUDLY HOLDS UP THE CARCASS.   Father stares at son, something on his mind.   Then, re the rabbit: PERCY FAWCETT No no, I’ll retrieve it... As Percy goes to get the animal, Nina has a private moment with Jack: NINA FAWCETT I know you feel remorse about the   *  harsh words you said to him.   But   *  that was years ago.   He loves you. Go talk with him. EXT. TOP OF A HILL - LATER 101   101  The RABBIT hangs from a tree.   Fawcett and Jack are settled here, atop a hill, overlooking the field.   Fawcett stands, lighting a small cigar; Jack sits, cleaning his gun. Fawcett PETS THE HANGING CARCASS of the rabbit, then lowers it from the string and begins to prep it for eating. JACK FAWCETT Father...? PERCY FAWCETT Mmm?   *  JACK FAWCETT I realize how fortunate I am not to have lost you in the war.   When we came back to England, I saw how few of my friends still had their fathers.  Lost City of Z   Pink Revision Set 8/24/15   103.",
      "characters": [],
      "action_text": "PERCY FAWCETT (nods; then) It’s been a difficult few years for many. (beat) You’ve been writing to the American newspapers about us, I’m told. JACK FAWCETT I have.   I’ve been reading of your exploits. They are quite extraordinary. Beat. PERCY FAWCETT I’ve something for you. Fawcett pulls something out of his bag: AN INDIAN NECKLACE. He gives it to Jack: PERCY FAWCETT (O.C.) (CONT’D) It was from a Guarani Indian.   It’s yours now. JACK FAWCETT Thank you...   It’s remarkable... (beat) The Americans are going to Amazonia now.   I’m sickened by the thought that they might steal your thunder. PERCY FAWCETT (a broad smile)   *  I’ve little enough thunder to steal, my boy.   I never did find Z. JACK FAWCETT You must not say that!   I’ve read of your achievements--you are a great man!   You still believe in Z, do you not?   That we have always underestimated the Indian? PERCY FAWCETT (beaming at his son’s   *  enthusiasm)   *  Of course...   *  JACK FAWCETT Then why don’t we go back?   You and I, together--to find the lost city once and for all?  Lost City of Z   Pink Revision Set 8/24/15   104. PERCY FAWCETT (taken aback; a flood of   *  emotion)   *  I--I don’t know if I able, Jack. JACK FAWCETT I know you are.   You easily outmatch my strengths. Fawcett STANDS, looks out at the VISTA as Jack continues: PERCY FAWCETT I am touched by your faith in me. But--the war took its toll.   *  JACK FAWCETT Father, the Americans will venture there with their guns.   And then we must pray they do not destroy the Indian.   We must beat them to the spot. (beat; he smiles) I want to go with you so much, I want nothing more. (beat) We could find Z.   You and I can do it. PERCY FAWCETT On this, Jack, we must consult a higher authority. (beat) Your mother, I mean. Jack lets out a laugh. Then: JACK FAWCETT Father, there is something else I can barely speak of.   I wish...to apologize for the disgraceful things I said to you before you went away.   *  Fawcett turns back, looks at Jack. PERCY",
      "dialogue_count": 0,
      "word_count": 2518
    },
    {
      "scene_number": 7,
      "slugline": "EXT. AQUITANIA - DUSK 108   108   * The ship at sea, on its way to South America.   We STILL HEAR:   * PERCY FAWCETT (V.O.)  Ready to fight and averse to wrong... Never forget you’re a gentleman And never a fear you’ll do.  CUT TO:   * STILL PHOTOS of the AQUITANIA, a huge SHIP.   WIDE SHOTS. 109   109   * Then CLOSE SHOTS of JACK AND PERCY on the DECK, WAVING.   * BLACK AND WHITE STILLS.   * PERCY FAWCETT (V.O.)   *  Life is short and the world is   *  wide.   * CUT TO:   * SERIES OF SHOTS of Fawcett’s house and old Ireland ARMY 110   110   * BARRACKS: THE ARMY BARRACKS in Ireland - empty, save the usual post- move detritus.   THE BEDROOM - empty.   Dust now.   ARMY BACKYARD - empty.   Windswept, covered with leaves.   THE FRONT LAWN - empty.   A child’s TOY, covered in dirt. PERCY FAWCETT (V.O.)   *  We’re just a ripple on life’s great   *  pond.   * We END with: INT. NEW MADEIRA HOME - NINA’S BEDROOM - NIGHT 111   111   * A new ROOM, in Madeira.   Nina is asleep with a newspaper on her lap.   It reads, “EXPLORERS ENTER JUNGLES TO SEEK LOST RACE”.   Then we HEAR a LOUD TRAIN WHISTLE: PERCY FAWCETT (V.O.)   *  Enjoy your life to the best you   *  can,   *  All will help enrich the span,   * INT. TRAIN - BRAZIL - NIGHT 112   112 On the train into the jungle, they pass parades for the Carnival.   They pass beautiful fields, vistas. Lost City of Z   White 7/31/15   114.",
      "characters": [],
      "action_text": "Crowds wave to them.   Jack stands, looking out the window. Fawcett remains seated, eyes a map. PERCY FAWCETT (V.O.)   *  But never forget you’re a   *  gentleman.   * JACK FAWCETT   * Forty million, father!   The   * newspaper said forty million are   * following our journey!   Look, even   * here!   * Fawcett stands, looks out the train.   Sotto:   * PERCY FAWCETT   * It is rather marvelous...   * Fawcett turns to look at the people waving at the train. ANGLE ON A SLIGHTLY WISTFUL YET ALSO ENTHUSIASTIC PERCY FAWCETT; he waves back to them.   * CUT TO: SERIES OF SHOTS as we STILL HEAR the train:   The CAMERA 113   113 DOLLIES PAST a sleeping Nina in the MADEIRA HOME.   Next: the   * CAMERA DOLLIES PAST a sleeping Brian.   Last: PAST a sleeping Joan. CUT TO:   * EXT. TRAIN 114   114   * Loses his STETSON HAT.   It blows away.   THE HAT TWISTS AND   * SPINS AND FLOATS IN THE WIND, eventually leaving our sight.   * PERCY FAWCETT   * (to Jack)   * We are getting closer.   * The CAMERA SPINS PAST the COUNTRYSIDE--   * MATCH CUT TO:   * THE CAMERA PANNING, THEN STOPPING, ON THE JUNGLE.   * EXT. JUNGLE - DAY 115   115   * CLOSE SHOT: Fawcett.   He consults a map.   ZOOM OUT: DWARFED   * BY NATURE, THE AWESOME DEPTHS OF THE JUNGLE.   * Lost City of Z   White 7/31/15   115. Jack is right behind him.   The Peons (Indian messengers) are near but bringing up the rear and looking exhausted. SUPERIMPOSE: “PANTANAL REGION, BRAZIL.   APRIL 30, 1925”. Percy turns to Jack. JACK FAWCETT My compass appears to have stopped working. PERCY FAWCETT It’s nothing to fret over--I’ve two   *  others.   How are you faring?   *  JACK FAWCETT I’ve rarely felt better. PERCY FAWCETT Good.   We’ll be on the river soon-- and then if we’re lucky, to see an   *  opera... EXT. FAZIENDA JACOBINA - CLEARING 116   116  Out of the jungle comes our group.   They are close to the hut that served as an opera house... But it seems abandoned.   Fawcett leads the group toward its front doors, which are swinging ",
      "dialogue_count": 0,
      "word_count": 3154
    },
    {
      "scene_number": 8,
      "slugline": "EXT. THE JUNGLE AGAIN 134   134 We’re back where we were.   Or are we?   It’s oddly silent, save for Fawcett’s breathing.   Percy touches his son’s hand. PERCY FAWCETT   * We’re here, Jack...   You’re   * right...   Z is all around us...   * CLOSE UP ON PERCY FAWCETT as the Indians dance, lifting and   * moving him somewhat sloppily.   It is not tender, but it is   * not violent, either.   * Fawcett turns: musicians and dancers circle what looks like a   * plaza.   In the distance: mound-shaped houses in endless rows. They hold him aloft...   He reaches up.   SEES something.   * Tries to touch it.   * We SEE what PERCY FAWCETT SEES: SILHOUETTED: A GATEWAY, a   * LARGE ARCH, in the distance, through the trees.   Across the   * river.   * The Indians carry FAWCETT AND NOW JACK too.   The KAYAPO begin   * a march...   They CARRY PERCY AND JACK up toward the GATEWAY,   * which is HIGH ABOVE the community...   * PERCY SEES SCORES OF TORCHES, EVERYWHERE...   SO MANY INDIANS,   * SO MANY PEOPLE...   * CUT TO:   * A TITLE CARD: “FOUR YEARS LATER” INT. RGS OFFICE - DAY 135   135 Seated behind his desk: SIR JOHN SCOTT KELTIE.   Keltie is   * near eighty now.   ENTERING: WILLIAM BARCLAY.   Keltie does not   * look up from his notes.   After an awkward beat: WILLIAM BARCLAY   * Sir John?   * SIR JOHN SCOTT KELTIE   * Yes...? WILLIAM BARCLAY   * She’s outside again. Keltie seems both sympathetic and peeved.   After a beat:   * Lost City of Z   White 7/31/15   127.",
      "characters": [],
      "action_text": "SIR JOHN SCOTT KELTIE   * Bring her in. Barclay spins around, opens the door.   Entering the room:   * NINA FAWCETT.   Keltie gets up, smiles.   Puts on his best   * behavior in her presence.   * WILLIAM BARCLAY   * Miss Nina.   * SIR JOHN SCOTT KELTIE   * Nina my dear, how are you? NINA FAWCETT Sir John...   Mr. Barclay.   * SIR JOHN SCOTT KELTIE   * How may we be of help to you today? Nina speaks, but in a way that is almost interior, trancelike.   Her eyes have a kind of thousand-yard stare, and she seems to connect, then turn inward, from moment to moment: NINA FAWCETT A man...came to see me yesterday. SIR JOHN SCOTT KELTIE   * A man? NINA FAWCETT He was from Brazil.   He’s seen   * Percy, and Jack, living with the Indians.   He says they claim to   * have reached Z.   * Keltie tries to hide his skepticism, but cannot.   Reaches out   * to Nina.   Tenderly: SIR JOHN SCOTT KELTIE   * My dear, it’s been years.   Almost a hundred men now have been sent to look for your husband and son. I’m...I’m afraid they are no more.   * And I would advise... He cannot continue.   Tears well up in her eyes--and,   * amazingly, he gets emotional as well.   * NINA FAWCETT Sir John, I confess that the brutal   * wear and tear is great, and I suffer with heart and soul. (MORE) Lost City of Z   White 7/31/15   128. It has taken all my strength of will to push horrors out of my thoughts... Then Nina seems to reconnect: NINA FAWCETT (CONT’D) But I beg you not to lose confidence.   I cannot doubt--after so many years of sacrifice--it has become my own life’s work.   It   *  cannot have all been in vain...   *  WILLIAM BARCLAY Miss Nina, we do plan more search parties.   We do. No response.   Keltie looks pained.   He sits back down, behind his desk. NINA FAWCETT The Brazilian gave me this, to give to you.   He said Percy told him you would understand. Nina hands him THE COMPASS.   Keltie takes the COMPASS.   Tries to reveal not a hint of wide-eyed shock.   BUT HE IS SHOCKED! NINA FAWCET",
      "dialogue_count": 0,
      "word_count": 930
    }
  ]
}