{
  "slug": "the-good-wife-101-pilot-2009",
  "title": "the good wife 101 pilot",
  "genre": "drama",
  "format": "series",
  "scenes_count": 4,
  "characters_count": 8,
  "characters": [
    "WILL",
    "TALIA",
    "PETER FLORRICK",
    "CARY",
    "GRANT",
    "DIANE",
    "ALICIA",
    "JUDGE ABERNATHY"
  ],
  "total_words": 10235,
  "total_dialogue": 9,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. EVEREST - DINING ROOM - DAY 9   9 ERICCSON What?   I beat you 3 sets to 2! The settlement lunch.   Laughing taunts.   WILLIAM ERICCSON (40).   Greying handsome.   The kind of fit only money can buy. Think Bradley Whitford.   Loves a good joke, hates to lose. WILL Come on,   you   don’t even believe that. Will.   The two laugh.   At a power lunch spot.   Red brick, racing waiters, and old money.   Sitting with them... ...Alicia looks toward the other two people at the table. LAWYERS from Ericcson’s firm.   Silent and funny as mannequins.   They stare back at Alicia.   Stepford lawyers. ERICCSON So, this is driving me crazy.   How do I know you? Alicia.   Being spoken to.   Oh.   She points to herself. ERICCSON (CONT’D) Yes.   Miner, Parsons & Layton? WILL No.   Alicia is actually our newest Junior Associate: one month in. Will Ericcson, Alicia   Florrick . Ericcson looks to Will incredulously, then smiles at Alicia. Offers a hand... ERICCSON Nice to meet you, Mrs. Florrick. ALICIA And you. ERICCSON I’m rooting for your husband.   I know he’s got a lot of enemies in this town, but I always root for the underdog. (Will snorts incredulously) Just ignore him.  THE GOOD WIFE #101   \"Stripped\"   FINAL DRAFT   9/29/09   8. CONTINUED: (3) 8   8 (MORE) (CONTINUED)",
      "characters": [],
      "action_text": "The only reason anyone is forced to resign in America these days is sex.  THE GOOD WIFE #101   \"Stripped\"   FINAL DRAFT   9/29/09   8A. CONTINUED: 9   9 ERICCSON   (CONT'D) (CONTINUED) Will eyes Alicia.   Sees her discomfort.   Or imagines it. WILL So why don’t we talk about Lloyd McKeon? ERICCSON (still studying Alicia) It’s sad, really.   I remember when you had a respectable firm, Will, one that didn’t sink to scurrilous charges like these. WILL What charges might those be,   Will ? I haven’t said anything yet. ERICCSON (smiles) Look, do you think you’re the first firm she’s been shopping this lawsuit to?   There’s nothing there. Even the States Attorney-- (nods to Alicia) --the   new   States Attorney thinks there’s nothing there-- WILL And yet I got you to a settlement lunch on a half hour’s notice. Ericcson smiles.   Two pros keeping their “tells” to a minimum. ERICCSON Mrs. Florrick, what do you say to someone bringing unsubstantiated sexual charges against a public figure in order to gain an advantage? Will opens his mouth, but Alicia is already answering: ALICIA You want to know what   I   would say? ERICCSON I do. Will’s foot nudges up alongside Alicia:   careful . ALICIA I’d say you’re trying to change the subject from rape.  THE GOOD WIFE #101   \"Stripped\"   FINAL DRAFT   9/29/09   9. CONTINUED: (2) 9   9 (CONTINUED) Silence.   Ericcson stares at her, finally grins, raises his hands: guilty as charged, as Will relaxes-- good.   To Will: ERICCSON I would agree that, as offensive and misguided as these charges are, the optics don’t exactly play in our favor.   So we’re willing to tender a cursory offer. Ericcson writes a number on a post-it note, slides it across to Will who opens it.   Alicia leans slightly, reads $450,000. Alicia and Will don’t react-- work hard not to react.   Wow.  EXT. CHICAGO STREET - DAY 10   10 Alicia and Will walk away from the restaurant.   A second. Then an aside to Will... ALICIA McKeon did it. Will pauses, nods: WILL If it had",
      "dialogue_count": 0,
      "word_count": 1311
    },
    {
      "scene_number": 2,
      "slugline": "INT. CHRISTY’S APARTMENT - ANDERSONVILLE - DAY 15   15 ALICIA Did you tell anyone afterward? CHRISTY Maura.   Our driver, Grant.   He suggested she drive me to the hospital for the rape exam. KALINDA And the service, “Worldwide Elite,” how long did you work for them? CHRISTY Two years. KALINDA And what else did you do there? Christy pauses.   Alicia looks toward Kalinda, confused. CHRISTY What do you mean? KALINDA I mean, what else did you do there? Christy stares at her, shoots a quick look toward her mom. CHRISTY For a year I was an escort. Alicia slumps almost imperceptibly.   Not a good turn. KALINDA Didn’t you think that might be important to tell us? CHRISTY I haven’t gone on a call in a year. I was in an abusive relationship; I needed the money to move out.   When I moved, I stopped working. KALINDA But still stripped? Christy nods reluctantly.   Embarrassed.   Alicia eyes her, and...  THE GOOD WIFE #101   \"Stripped\"   FINAL DRAFT   9/29/09   14.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 166
    },
    {
      "scene_number": 3,
      "slugline": "INT. 28TH FLOOR - HALLWAY - DAY 16   16 ALICIA So what’s your point, a call girl can’t get raped? Alicia and Kalinda arguing-- but now for Will’s benefit-- as they follow him down a firm hallway. KALINDA Yes, that’s my point, thanks.   She lied to us.   Why believe her now? ALICIA Because she walked away from a half million dollars-- and when did she ever lie to us? KALINDA Look, the more you bond with these clients, the less helpful you are. Someone’s gonna’ have to argue this in court. This last is to Will who knocks on Diane’s door as he passes: WILL Your stripper was hooking. DIANE Why is she   my   stripper when she does something bad? Will chuckles, moving on with Alicia, Kalinda. WILL Okay, the whole point is to prepare for trial so we don’t actually have to go to trial-- (stops a passing Cary) Cary, right? CARY Yes, sir. WILL Nice suit.   I have a job for you. (Cary nods: ready, sir) I need you take Alicia’s Sheffrin- Marks depos for a week. A disappointed Cary nods-- got it-- watches jealously as Will continues on with Alicia and Kalinda:  THE GOOD WIFE #101   \"Stripped\"   FINAL DRAFT   9/29/09   15. (CONTINUED)",
      "characters": [
        "WILL",
        "TALIA",
        "PETER FLORRICK",
        "CARY",
        "GRANT",
        "DIANE",
        "ALICIA"
      ],
      "action_text": "CHILDS Designed to embarrass my office and make it look like I don’t care about a rape victim. ALICIA A happy coincidence. Childs clears his throat, waits for a person to pass: CHILDS I understand the need to blame someone for your husband’s downfall, Mrs. Florrick, but I didn’t release that sex tape to hurt you or your family. I have kids too.   Two boys.   And I want you to know, I was holding back. I had more to release about your husband.   A lot more.   Disturbing things.   But, out of compassion, I held back.   I-- ALICIA Mr. Childs, if you have something to show me, just do it, okay?   Because the one thing I don’t have time for these days is empty threats. Childs studies her.   Turns to a sheepish Leah: CHILDS Nothing is to be released to them. Nothing. (to Alicia) You want something, get a subpoena. And he starts off.   Alicia watches him go.  EXT. “WORLDWIDE ELITE” OFFICES - DAY 20   20 A brownstone.   On a quiet tree-lined street.   Inside...  INT. “WORLDWIDE ELITE” OFFICES - DAY 21   21 ...Alicia and Kalinda follow ARIANNA AVARSKI (50) upstairs. A tall and exotic ex-model type. ARIANNA I like Christy.   She was one of my best dancers.   But I have nothing to add here.   I’m sorry. (picks up a stray paper) Clean up after yourselves, people.  THE GOOD WIFE #101   \"Stripped\"   FINAL DRAFT   9/29/09   17. CONTINUED: 19   19 (CONTINUED) Two pretty bookers look up as she passes by.   An escort booking office.   High end.   In the Emperor VIP mode.   With four clocks overhead.   London.   Los Angeles.   New York. ALICIA We just need contact information, Miss Avarski, that’s all.   For the driver and the other stripper. ARIANNA Dancer.   Look, I would love to-- KALINDA (bad cop) Because we’d really hate to subpoena your books and customer records. Arianna stops, turns to Kalinda, smiles, liking her: ARIANNA You’re East Indian? (Kalinda nods) It’s very popular these days.   Mumbai. Bollywood.   We get a lot of requests. So if you’re ever looking... KALINDA You’ll",
      "dialogue_count": 7,
      "word_count": 6133
    },
    {
      "scene_number": 4,
      "slugline": "INT. CIVIL COURTS BUILDING - CIRCUIT COURT ROOM #32 - DAY 45   45 DR. GERALD GIRTZMAN (38).   On the stand.   Everywhere he sits is his throne.   His diction stiff.   His manner brusque. Loves being the center of attention.   Mid-questioning:  THE GOOD WIFE #101   \"Stripped\"   FINAL DRAFT   9/29/09   41A. (CONTINUED)",
      "characters": [
        "ALICIA",
        "JUDGE ABERNATHY"
      ],
      "action_text": "ALICIA And you were the lab supervisor who worked on analysis #5795-- the rape kit in this case-- professor? DR. GIRTZMAN Doctor. Alicia smiles.   This will be fun.   Will in first chair. Christy beside him.   Kalinda in the gallery.   Abernathy on the bench.   Ericcson and McKeon at the respondent’s table. ALICIA Doctor.   And these are your initials-- “G.G.”-- at the bottom of the report? DR. GIRTZMAN Yes, those are mine. ALICIA Oh, wait, excuse me.   This isn’t analysis #5795.   It’s 579 - four. The Manny Lyons case.   My mistake. Ericcson rolls his eyes: a cheap lawyer trick. ALICIA (CONT'D) I see you ran the analysis on both? And given their sequential numbering, I imagine you worked on one right after the other? DR. GIRTZMAN It appears so. Ericcson stops scribbling in a pad.   Looks up.   Uh-oh. ALICIA And both these cases matched the DNA with the same culprit, Manny Lyons, is that correct? DR. GIRTZMAN It is. The reporter at the back looks up from his notes. Interesting.   As Diane enters the court, sits at the back. Catches Will’s eye, raises an eyebrow: how’s she doing?   He nods: clear sailing so far.  THE GOOD WIFE #101   \"Stripped\"   FINAL DRAFT   9/29/09   42. CONTINUED: 45   45 (CONTINUED) ALICIA So let me follow the logic here. Manny Lyons has never set foot in Chicago-- ERICCSON Objection.   Not in evidence. JUDGE ABERNATHY I will sustain that. ALICIA Isn’t it true, Dr. Girtzman, the only connection between Manny Lyons and Christy Barbosa is that you worked on both cases? ERICCSON Objection.   Argumentative. JUDGE ABERNATHY Mrs. Florrick.   This is not a debating society.   Sustained. ALICIA Dr. Girtzman, would you call the standards at a commercial lab relaxed? DR. GIRTZMAN No.   And your honor, may I answer her earlier question?   Personal privilege. Ericcson rolls his eyes.   Oh god, please don’t. JUDGE ABERNATHY If you would like. DR. GIRTZMAN We handle an immense backlog of untested rape kits from crime labs across the country; we do so with spe",
      "dialogue_count": 2,
      "word_count": 2625
    }
  ]
}